{"definition":["B-mode ultrasonography\/prenatal ultrasound scan\/abbr. for B型超聲|B型超声[B xing2 chao1 sheng1]"],"pinyin":["B chao1"],"traditional":["B超"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"B超","characters":[{"definition":["euphemistic variant of 屄[bi1]"],"pinyin":["bi1"],"word":"B"},{"definition":["to exceed\/to overtake\/to surpass\/to transcend\/to pass\/to cross\/ultra-\/super-"],"pinyin":["chao1"],"word":"超"}],"containing_words":[],"sentences":[{"english":"If you want to determine the status of the fetus, at present only through the B-can be sure.","chinese":"如果要确定胎儿的状况，目前只有透过B超才能肯定。"},{"english":"Objective To investigate the clinical value of B-Us-guided pericardiocentesis .","chinese":"目的探讨B超引导下心包穿刺诊治心包积液的价值。"},{"english":"Objective To investigate the application of B ultrasonic examination on the diagnosis of clonorchiasis .","chinese":"目的探讨B超在华支睾吸虫病诊断中的应用价值。"},{"english":"We contrasted the findings of cervical palpation and B-ultrasonography with the pathologic diagnosis.","chinese":"将颈部触诊和B超检查结果与术后病理诊断相对照。"},{"english":"To investigate the application of B-ultrasonic examination on the diagnosis of clonorchiasis.","chinese":"探讨B超在华支睾吸虫病诊断中的应用价值。"},{"english":"To evaluate the clinical value of gall bladder wall change of virus hepatitis tested by B-ultrasound.","chinese":"评价B超检查胆囊壁改变在病毒性肝炎中的临床价值。"},{"english":"Conclusion B ultrasonic examination is valuable to the diagnosis of clonorchiasis.","chinese":"结论B超诊断华支睾吸虫病具有重要的价值。"},{"english":"Phased array ultrasonic beam time -space characteristics affect the image quality directly.","chinese":"相控阵超声波束的时空特性直接影响B超图象的质量。"},{"english":"B sonography and MRI are excellent imaging modalities for accurately depicting prostatic utricle cyst.","chinese":"结论B超和MRI是诊断前列腺囊肿的重要方法。"},{"english":"B-Scan transducers are used to create an ultrasonic two-dimensional cross section view.","chinese":"医用B超换能器用于产生二维超声截面图。"},{"english":"Especially a method for restoring B modeultrasonic tomograms is described.","chinese":"论文阐述了一种用于B超图像恢复的方法。"},{"english":"All patients in this report have been diagnosed by B model ultrasonic and cholangiography by taking medium contrast orally or iv.","chinese":"本组病例均经B超诊断，口服或静脉胆道造影检查。"},{"english":"Objective:To explore the value of B-ultrasonographic diagnosis in suspiciously acute appendicitis.","chinese":"目的研究B超在疑似急性阑尾炎诊断中的价值。"}],"related":[]}