{"definition":["each and every one"],"pinyin":["yi1 ge4 ge4"],"traditional":["一個個"],"rank":5295.0,"normalized_rank":0.07408391980188322,"fraction":0.000022099260975374188,"cumulative_fraction":0.8657469357088583,"word":"一个个","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["variant of 個|个[ge4]","individual\/this\/that\/size\/classifier for people or objects in general"],"pinyin":["ge4","ge4"],"word":"个"},{"definition":["variant of 個|个[ge4]","individual\/this\/that\/size\/classifier for people or objects in general"],"pinyin":["ge4","ge4"],"word":"个"}],"containing_words":[],"sentences":[{"english":"He drove the workers until they collapsed.","chinese":"他迫使工人们干得一个个累趴在地。"},{"english":"Students went out of the clASsroom one by one AS soon AS the bell rang.","chinese":"下课铃一响，学生们一个个从教室里走出来。"},{"english":"Let's take these in turn.","chinese":"我们一个个来看。"},{"english":"Roll the dough into small balls.","chinese":"把它揉成一个个小球。"},{"english":"Dough is kneaded and then molded into little cute animals by this folk artisan.","chinese":"民间艺人搓捏为一个个可爱的小动物。"},{"english":"The children pulled a long face.","chinese":"孩子们一个个都哭丧着脸。"},{"english":"With my tongue I can feel the silencer holes we drilled into the barrel of the gun.","chinese":"我的舌头可以舔到枪管上我们凿出来的一个个消音孔。"},{"english":"A young men and women and rejoice, bundles bright-coloured rose itch to try.","chinese":"一个个年轻男女欢欣鼓舞，一束束鲜艳玫瑰跃跃欲试。"},{"english":"Gangu County in the streets, a common one of the stalls selling fried potato chips.","chinese":"在甘谷县街头，常见一个个卖油炸洋芋片的小摊。"},{"english":"All with their eyes intently fastened on the iron-clamped oaken door.","chinese":"他们一个个都紧盯着布满铁钉的橡木牢门。"},{"english":"Pools of sulfuric acid are indications that deep underground there are titanic stirrings .","chinese":"一个个的硫酸池说明了在深地底下藏有著巨大能源。"},{"english":"The breeze flaunted in succession like a story with beautiful.","chinese":"纷纷飘扬的风絮如同一个个美丽的故事。"},{"english":"Yes, you heard right. She tells stories through sand.","chinese":"对了，你没听错，她的确会用沙子讲述一个个故事。"},{"english":"The once powerful figures have also disappeared from the scene one after another.","chinese":"那些烜赫一时的人物也一个个销声匿迹了。"},{"english":"You find yourself putting off creating until another day.","chinese":"你发现创造被你放到一个个的“改天”。"},{"english":"There were steps along the way, a stairway, in effect.","chinese":"石径上有着一个个台阶，简直就是一道阶梯。"}],"related":[]}