{"definition":["lit. two segments with a single cut (idiom)\/fig. to make a clean break (idiom)"],"pinyin":["yi1 dao1 liang3 duan4"],"traditional":["一刀兩斷"],"rank":40127.0,"normalized_rank":0.5614287912918164,"fraction":3.807096508559191e-7,"cumulative_fraction":0.9965373260238126,"word":"一刀两断","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["knife\/blade\/single-edged sword\/cutlass\/CL:把[ba3]\/(slang) dollar (loanword)\/classifier for sets of one hundred sheets (of paper)\/classifier for knife cuts or stabs","surname Dao"],"pinyin":["dao1","Dao1"],"word":"刀"},{"definition":["two\/both\/some\/a few\/tael, unit of weight equal to 50 grams (modern) or 1⁄16 of a catty 斤[jin1] (old)"],"pinyin":["liang3"],"word":"两"},{"definition":["to break\/to snap\/to cut off\/to give up or abstain from sth\/to judge\/(usu. used in the negative) absolutely\/definitely\/decidedly"],"pinyin":["duan4"],"word":"断"}],"containing_words":[],"sentences":[{"english":"If you dare to use that word in my hearing again, we part brass rags .","chinese":"如果你敢于当着我的面说那个词，咱俩就一刀两断。"},{"english":"Breaking with traditional gender patterns is especially important when children are involved.","chinese":"当孩子卷进来时，与传统性伴侣一刀两断非常重要。"},{"english":"After the quarrel she gave her boyfriend the gate.","chinese":"吵嘴后她和男朋友一刀两断了。"},{"english":"You'd better break off with him.","chinese":"你最好与他一刀两断。"},{"english":"I've finished with the Pangs.","chinese":"我跟庞家一刀两断了。"},{"english":"Why burn a bridge to someone who could help you later? That's just stupid.","chinese":"跟别人一刀两断以后谁还肯帮助你？那真是傻。"},{"english":"But the promised \"clean break\" from the past is not - yet - out of reach.","chinese":"不过他所承诺的与过去”一刀两断“并非遥不可及。"},{"english":"He resolved to make a fresh start, and throw off undesirable acquaintances.","chinese":"他下决心重新开始，和那些狐朋狗友们一刀两断。"},{"english":"I want to make a clean sweep of everything I've learnt and start afresh.","chinese":"我要和以前学的那些玩艺儿一刀两断，一切从头开始。"}],"related":[{"definition":["to split up\/to break all ties"],"pinyin":["en1 duan4 yi4 jue2"],"word":"恩断义绝"},{"definition":["to rip one's robe as a sign of repudiating a sworn brotherhood (idiom)\/to break all friendly ties"],"pinyin":["ge1 pao2 duan4 yi4"],"word":"割袍断义"},{"definition":["to bring to a conclusion\/to settle (a dispute)\/to do away with (oneself)\/to break off (a relationship)\/resolution (of a problem)"],"pinyin":["liao3 duan4"],"word":"了断"},{"definition":["lit. lotus roots may break, but the fiber remains joined (idiom); lovers part, but still long for one another"],"pinyin":["ou3 duan4 si1 lian2"],"word":"藕断丝连"},{"definition":["(of marriage or business partners) to break up (idiom)\/to separate"],"pinyin":["yi1 pai1 liang3 san4"],"word":"一拍两散"},{"definition":["to rupture\/to burst open\/to break\/to break off relations with\/a rupture"],"pinyin":["jue2 lie4"],"word":"决裂"},{"definition":["to cut off\/to chop sth in half"],"pinyin":["zhan3 duan4"],"word":"斩断"},{"definition":["lit. quick sword cuts through tangled hemp (idiom); decisive action in a complex situation\/cutting the Gordian knot"],"pinyin":["kuai4 dao1 zhan3 luan4 ma2"],"word":"快刀斩乱麻"},{"definition":["see 撕破臉|撕破脸[si1 po4 lian3]"],"pinyin":["si1 po4 lian3 pi2"],"word":"撕破脸皮"},{"definition":["to write off at one stroke"],"pinyin":["yi1 bi3 gou1 xiao1"],"word":"一笔勾销"},{"definition":["hopelessly muddled\/impossible to unravel"],"pinyin":["jiu1 chan2 bu4 qing1"],"word":"纠缠不清"},{"definition":["the two cannot exist together (idiom); irreconcilable differences\/incompatible standpoints"],"pinyin":["shi4 bu4 liang3 li4"],"word":"势不两立"},{"definition":["to fall out with sb\/to become hostile"],"pinyin":["fan1 lian3"],"word":"翻脸"},{"definition":["lit. either the fish dies or the net splits\/a life and death struggle (idiom)"],"pinyin":["yu2 si3 wang3 po4"],"word":"鱼死网破"},{"definition":["to have an acrimonious falling-out\/to shed all pretense of cordiality\/to tear into each other"],"pinyin":["si1 po4 lian3"],"word":"撕破脸"},{"definition":["to break off relations\/to break with sb"],"pinyin":["jue2 jiao1"],"word":"绝交"}]}