{"definition":["for a time\/at one time\/one time\/once"],"pinyin":["yi1 du4"],"traditional":["一度"],"rank":2147.0,"normalized_rank":0.030039315545730555,"fraction":0.00007058003661011733,"cumulative_fraction":0.7412768528692993,"word":"一度","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to pass\/to spend (time)\/measure\/limit\/extent\/degree of intensity\/degree (angles, temperature etc)\/kilowatt-hour\/classifier for events and occurrences","to estimate\/Taiwan pr. [duo4]"],"pinyin":["du4","duo2"],"word":"度"}],"containing_words":[{"definition":["to have sexual intercourse (once)"],"pinyin":["chun1 feng1 yi1 du4"],"word":"春风一度"},{"definition":["once a year (every year)"],"pinyin":["mei3 nian2 yi1 du4"],"word":"每年一度"}],"sentences":[{"english":"The epidemic was stopped before the annual pilgrimage to Mecca got under way.","chinese":"这传染病在一年一度进行麦加朝圣之前停止。"},{"english":"The one hundred and first meridian was passed.","chinese":"现在已经越过了经线一百零一度了。"},{"english":"He was invited to present the prizes at the annual flower show.","chinese":"他受邀在一年一度的花展上颁奖。"},{"english":"Lijiashan once housed 600 families.","chinese":"李家山一度曾有600户居民。"},{"english":"The Shuanglong Lake is a shallow and urban lake, it had been a serious typical eutrophic lake.","chinese":"双龙湖是浅水型城市湖泊，一度为重富营养化湖泊。"},{"english":"The typewriter rescued him, at least for a time.","chinese":"打字机挽救了他，起码一度挽救过他。"},{"english":"At one point, he even demanded to know who was behind the killing of JFK.","chinese":"他甚至一度要求知道是谁策划谋杀了肯尼迪总统。"},{"english":"The first prize was awarded to the best competitor of the annual sports meeting .","chinese":"头奖颁给了这一年一度的运动会上最优秀的运动员。"},{"english":"Police suspect the girls were taken by their father.","chinese":"警方一度怀疑孩子们曾被其父亲协持。"},{"english":"The novel I had thrown away was chosen by the Book Society.","chinese":"我一度扔掉的那部小说后来被书社选中了。"},{"english":"The uterus contracted well with bleeding of 200ml, lst degree perineal was repaired.","chinese":"子宫收缩好，出血200毫升，会阴一度撕裂被修复。"},{"english":"The day after tomorrow, we will be celebrating the traditional Chinese holiday, the Mid-Autumn Festival.","chinese":"再过两天，就是一年一度的中国传统佳节中秋节。"},{"english":"York is the capital city of Yorkshire and was once known as England's \"second\" city.","chinese":"约克城是约克郡的首府，曾一度为英格兰第二大城市。"},{"english":"But how the human body is able to sense a one-degree change in temperature has remained a mystery.","chinese":"但人体如何感知一度的温度变化仍是个谜。"},{"english":"It is possible that at one time John was a member of the Judean Desert sect.","chinese":"有可能约翰曾经一度是那个小教派的成员。"},{"english":"After the explosion, Cheney said he was briefly moved to a bomb shelter.","chinese":"爆炸发生后，钱尼说，他一度被转移到防弹设施内。"}],"related":[{"definition":["once more\/once again\/one more time"],"pinyin":["zai4 du4"],"word":"再度"},{"definition":["after this\/afterwards\/hereafter"],"pinyin":["ci3 hou4"],"word":"此后"},{"definition":["even\/so much so that"],"pinyin":["shen4 zhi4"],"word":"甚至"},{"definition":["once\/already\/former\/previously\/ever\/(past tense marker used before verb or clause)"],"pinyin":["ceng2 jing1"],"word":"曾经"},{"definition":["repeatedly\/time and again"],"pinyin":["lu:3 ci4"],"word":"屡次"},{"definition":["but\/yet\/however\/while\/to go back\/to decline\/to retreat\/nevertheless\/even though","old variant of 卻|却[que4]"],"pinyin":["que4","que4"],"word":"却"},{"definition":["soon after"],"pinyin":["sui2 hou4"],"word":"随后"},{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["one more time\/again\/one more\/once again"],"pinyin":["zai4 ci4"],"word":"再次"},{"definition":["to sink into\/to get caught up in\/to land in (a predicament)"],"pinyin":["xian4 ru4"],"word":"陷入"},{"definition":["to be on the brink of\/to be on the verge of"],"pinyin":["ji1 jin4"],"word":"几近"},{"definition":["despite\/although\/even though\/in spite of\/unhesitatingly\/do not hesitate (to ask, complain etc)\/(go ahead and do it) without hesitating"],"pinyin":["jin3 guan3"],"word":"尽管"},{"definition":["straight (in a straight line)\/continuously\/always\/from the beginning of ... up to ...\/all along"],"pinyin":["yi1 zhi2"],"word":"一直"},{"definition":["before this\/before then\/previously"],"pinyin":["ci3 qian2"],"word":"此前"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不过"},{"definition":["a good thing doesn't last forever (idiom)"],"pinyin":["hao3 jing3 bu4 chang2"],"word":"好景不长"}]}