{"definition":["one divides into two\/to be two-sided\/there are two sides to everything\/to see both sb's good points and shortcomings (idiom)"],"pinyin":["yi1 fen1 wei2 er4"],"traditional":["一分為二"],"rank":24242.0,"normalized_rank":0.3391770318861668,"fraction":0.000001590280267033889,"cumulative_fraction":0.9831274324818532,"word":"一分为二","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen4","fen1"],"word":"分"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"},{"definition":["two\/2\/(Beijing dialect) stupid"],"pinyin":["er4"],"word":"二"}],"containing_words":[],"sentences":[{"english":"It has been 60 years since the country was divided by the civil war.","chinese":"自从国内战争这个国家一分为二以来，已经60年了。"},{"english":"I think it should not be divided into only two parts, black and white ones.","chinese":"我想不应该是一分为二，非黑即白的。"},{"english":"Peter now ordered a counter-charge, splitting the Swedish line in two.","chinese":"彼得此时命令发起反冲锋，将瑞典军队一分为二。"},{"english":"You've got,well,it splits.","chinese":"它就这样一分为二了。"},{"english":"How was the Roman Empire cut in half?","chinese":"罗马帝国师如何一分为二的？"},{"english":"Then the king used the sword to cut the dead boy into two halves, right down the spine.","chinese":"于是大仁慈王就用这把剑将尸体从脊柱那里一分为二。"},{"english":"The at last is bisected by first eight mark of halo of generation.","chinese":"终于存在经过前八记号的晕的产生一分为二。"},{"english":"One single whip will split the paper in half.","chinese":"我这一鞭子抽下去，这张纸就一分为二。"},{"english":"If two people only a bowl of rice, will split the one person half.","chinese":"如果两个人只有一碗饭，就要一分为二一人一半。"},{"english":"There are many people in academia,outside academia, who divide the world essentially into two.","chinese":"学术界内外，都有很多人，将世界一分为二。"},{"english":"In The Burning Crusade. this translates into a divided Silvermoon.","chinese":"在燃烧远征中，这被演绎成被一分为二的银月城。"},{"english":"A city of southwest Switzerland located on Lake Geneva and bisected by the Rhone River.","chinese":"瑞士西南日内瓦湖上的一座城市，被罗讷河一分为二。"},{"english":"Parking spaces in parking garages in Brazil were split in half.","chinese":"在巴西，停车场的停车位被一分为二。"},{"english":"Our single-celled ancestors reproduced by dividing in two.","chinese":"我们的单细胞祖先藉著一分为二的分裂方式来繁殖。"},{"english":"It splits the disputed part of the Barents Sea into two equally sized areas.","chinese":"依据协议，巴伦支海争议海域一分为二。"},{"english":"The split-half method of testing can save a lot of time.","chinese":"一分为二的测试方法能节省许多时间。"}],"related":[{"definition":["to cut up\/to break up"],"pinyin":["fen1 ge1"],"word":"分割"},{"definition":["to cut apart\/to sever\/to separate\/to isolate"],"pinyin":["ge1 lie4"],"word":"割裂"},{"definition":["to cleave\/to split open\/to spread open (fingers, legs)"],"pinyin":["pi1 kai1"],"word":"劈开"},{"definition":["to break or cut in two\/to sever\/to cut off\/(fig.) to cut off (a conversation, a flow etc)\/to interrupt\/(math.) to truncate"],"pinyin":["jie2 duan4"],"word":"截断"},{"definition":["as rivers Jing and Wei separate clearly (idiom)\/to be entirely different"],"pinyin":["Jing1 Wei4 fen1 ming2"],"word":"泾渭分明"},{"definition":["to cut across\/a horizontal cut"],"pinyin":["heng2 qie1"],"word":"横切"},{"definition":["to separate"],"pinyin":["ge2 kai1"],"word":"隔开"},{"definition":["to split up\/to divide\/to break up\/fission\/schism"],"pinyin":["fen1 lie4"],"word":"分裂"},{"definition":["to divide\/to separate\/partition"],"pinyin":["fen1 ge2"],"word":"分隔"},{"definition":["curve\/arc\/arch"],"pinyin":["hu2 xing2"],"word":"弧形"},{"definition":["horizontal traverse\/to cut across\/to cross transversally"],"pinyin":["heng2 guan4"],"word":"横贯"},{"definition":["to cut off\/to sever"],"pinyin":["qie1 duan4"],"word":"切断"},{"definition":["all split up and in pieces (idiom); disunity (in an organization)\/complete lack of unity\/to disintegrate\/falling apart\/to be at sixes and sevens"],"pinyin":["si4 fen1 wu3 lie4"],"word":"四分五裂"},{"definition":["cruciform\/cross shape"],"pinyin":["shi2 zi4 xing2"],"word":"十字形"},{"definition":["(hitting) squarely in the middle\/(slicing) across the middle\/to hold by the waist"],"pinyin":["lan2 yao1"],"word":"拦腰"},{"definition":["to form a cohesive whole\/to fuse together"],"pinyin":["rong2 he2 wei2 yi1"],"word":"融合为一"}]}