{"definition":["to showcase one's (unique) talents\/to display one's (individual) prowess"],"pinyin":["yi1 zhan3 shen1 shou3"],"traditional":["一展身手"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"一展身手","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to spread out\/to open up\/to exhibit\/to put into effect\/to postpone\/to prolong\/exhibition","surname Zhan"],"pinyin":["zhan3","Zhan3"],"word":"展"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"},{"definition":["hand\/(formal) to hold\/person engaged in certain types of work\/person skilled in certain types of work\/personal(ly)\/convenient\/classifier for skill\/CL:雙|双[shuang1],隻|只[zhi1]"],"pinyin":["shou3"],"word":"手"}],"containing_words":[],"sentences":[{"english":"It also includes many team cooperations.","chinese":"它又是一场一展身手的团队协作。"},{"english":"He constantly feels he has to prove himself to others.","chinese":"他时常觉得自己必须向人一展身手。"},{"english":"Check out the free version if you want to have a go.","chinese":"退房自由的版本，如果你想一展身手。"},{"english":"They foster social skills and are opportunities for play and exercise.","chinese":"在活动中培养了社交技巧并且有机会一展身手。"},{"english":"They are just waiting now for the chance to play well in the next match.","chinese":"他们只是等待下场比赛的机会一展身手。"},{"english":"This is where the Open Closed Principle comes into play.","chinese":"这就是开闭原则一展身手的地方了。"},{"english":"According to Bell, Yahoo is looking forward to seeing what developers will do with this data.","chinese":"贝尔说，雅虎很期待开发者能利用这些数据一展身手。"},{"english":"Roy Hodgson does not expect to be a busy man when the transfer window opens next month.","chinese":"霍大爷并不打算在冬季转会中一展身手。"},{"english":"OK let's have a go at drawing something like this open book.","chinese":"行让我们一展身手的绘图本打开的书一样的东西。"}],"related":[{"definition":["(idiom) fully displaying one's capabilities"],"pinyin":["da4 xian3 shen1 shou3"],"word":"大显身手"},{"definition":["fig. to rub one's fists and wipe one's palms (idiom)\/to roll up one's sleeves for battle\/eager to get into action or start on a task"],"pinyin":["mo2 quan2 ca1 zhang3"],"word":"摩拳擦掌"},{"definition":["variant of 摩拳擦掌[mo1 quan2 ca1 zhang3]"],"pinyin":["mo2 quan2 ca1 zhang3"],"word":"磨拳擦掌"},{"definition":["to be eager to give sth a try (idiom)"],"pinyin":["yue4 yue4 yu4 shi4"],"word":"跃跃欲试"},{"definition":["to display one's remarkable skill or prowess\/to give full play to one's brilliant abilities"],"pinyin":["da4 xian3 shen2 tong1"],"word":"大显神通"},{"definition":["to accomplish much\/to have good prospects\/to have a promising future"],"pinyin":["da4 you3 zuo4 wei2"],"word":"大有作为"},{"definition":["Chinese boxing\/fist and feet\/punching and kicking"],"pinyin":["quan2 jiao3"],"word":"拳脚"},{"definition":["to look\/to have a glimpse at\/to observe (sth's splendor)"],"pinyin":["yi1 du3"],"word":"一睹"},{"definition":["to feast one's eyes"],"pinyin":["da4 bao3 yan3 fu2"],"word":"大饱眼福"},{"definition":["to shine (of talents, skills, accomplishment)\/to demonstrate extraordinary talent or skill"],"pinyin":["da4 fang4 yi4 cai3"],"word":"大放异彩"},{"definition":["to give a small demonstration of one's impressive skills (idiom)"],"pinyin":["xiao3 shi4 niu2 dao1"],"word":"小试牛刀"},{"definition":["first sign of budding talent\/to display one's ability for the first time"],"pinyin":["chu1 lu4 feng1 mang2"],"word":"初露锋芒"},{"definition":["ample scope for abilities\/favorable position for the use of one's skills (idiom)"],"pinyin":["yong4 wu3 zhi1 di4"],"word":"用武之地"},{"definition":["like a fish back in water (idiom); glad to be back in one's proper surroundings"],"pinyin":["ru2 yu2 de2 shui3"],"word":"如鱼得水"},{"definition":["to have a show-down\/to fight for mastery\/to compete for a championship"],"pinyin":["yi1 jue2 ci2 xiong2"],"word":"一决雌雄"},{"definition":["to stand out among one's peers (idiom)\/to excel"],"pinyin":["chu1 ren2 tou2 di4"],"word":"出人头地"}]}