{"definition":["lit. only one branch of the tree is thriving (idiom)\/fig. to be in a league of one's own\/outstanding"],"pinyin":["yi1 zhi1 du2 xiu4"],"traditional":["一枝獨秀"],"rank":19402.0,"normalized_rank":0.2714591524072027,"fraction":0.0000025486233873824738,"cumulative_fraction":0.9733615257413242,"word":"一枝独秀","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["branch\/classifier for sticks, rods, pencils etc"],"pinyin":["zhi1"],"word":"枝"},{"definition":["alone\/independent\/single\/sole\/only"],"pinyin":["du2"],"word":"独"},{"definition":["handsome\/refined\/elegant\/graceful\/superior\/show (loanword)\/CL:場|场[chang2]\/(literary) to grow\/to bloom\/(of crops) to produce ears"],"pinyin":["xiu4"],"word":"秀"}],"containing_words":[],"sentences":[{"english":"Hongkong Winling has dominated Hongkong basketball league for many years.","chinese":"多年来，永伦队在香港篮球联赛中一直是一枝独秀。"},{"english":"Bianliang Imperial College is a special branch in the central engraving institutions of Song Dynasty.","chinese":"在宋代中央刻书机构中，汴梁国子监可谓是一枝独秀。"},{"english":"Apple lords over the high-end market.","chinese":"苹果目前在高端笔记本电脑市场一枝独秀。"},{"english":"Four Seasons care outshines all else in Alexandria.","chinese":"四季保健一枝独秀一切在亚历山德里亚。"}],"related":[{"definition":["most outstanding\/par excellence"],"pinyin":["du2 ling3 feng1 sao1"],"word":"独领风骚"},{"definition":["to emerge as a new force to be reckoned with (idiom)"],"pinyin":["yi4 jun1 tu1 qi3"],"word":"异军突起"},{"definition":["to come first in triennial palace examinations (idiom, refers to the carved stone turtle head in front of the imperial palace, next to which the most successful candidate in the imperial examinations was entitled to stand)\/to be the champion\/to be the very best in any field"],"pinyin":["du2 zhan4 ao2 tou2"],"word":"独占鳌头"},{"definition":["lit. late-comer lives above (idiom); the up-and-coming youngster outstrips the older generation\/the pupil surpasses the master"],"pinyin":["hou4 lai2 ju1 shang4"],"word":"后来居上"},{"definition":["to take the lead in a race\/to set the pace"],"pinyin":["ling3 pao3"],"word":"领跑"},{"definition":["to rise abruptly (to a towering position)\/to tower over\/to spring up\/to emerge suddenly\/the emergence (e.g. of a power)"],"pinyin":["jue2 qi3"],"word":"崛起"},{"definition":["a hundred flowers bloom (idiom); let the arts have free expression"],"pinyin":["bai3 hua1 qi2 fang4"],"word":"百花齐放"},{"definition":["to advance singing loudly (idiom); triumphant progress"],"pinyin":["gao1 ge1 meng3 jin4"],"word":"高歌猛进"},{"definition":["top three"],"pinyin":["qian2 san1 jia3"],"word":"前三甲"},{"definition":["lit. to proclaim oneself hegemon\/to take a leading role\/to build a personal fiefdom"],"pinyin":["cheng1 ba4"],"word":"称霸"},{"definition":["bellwether"],"pinyin":["ling3 tou2 yang2"],"word":"领头羊"},{"definition":["great heroes pursue deer in the central plains (idiom); fig. many vie for supremacy"],"pinyin":["qun2 xiong2 zhu2 lu4"],"word":"群雄逐鹿"},{"definition":["dark horse\/fig. unexpected winner"],"pinyin":["hei1 ma3"],"word":"黑马"},{"definition":["half of the country (esp. when half the country has fallen into enemy hands)\/vast swathe of territory"],"pinyin":["ban4 bi4 jiang1 shan1"],"word":"半壁江山"},{"definition":["to be perched high\/to be located prominently\/to be preeminent"],"pinyin":["xiong2 ju4"],"word":"雄踞"},{"definition":["an up-and-coming youngster\/new talent\/a brilliant younger generation"],"pinyin":["hou4 qi3 zhi1 xiu4"],"word":"后起之秀"}]}