{"definition":["to stick to one's ways\/to cling to one's course"],"pinyin":["yi1 tiao2 dao4 zou3 dao4 hei1"],"traditional":["一條道走到黑"],"rank":57425.0,"normalized_rank":0.8034502539420479,"fraction":6.014278226711606e-8,"cumulative_fraction":0.999684511985006,"word":"一条道走到黑","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["strip\/item\/article\/clause (of law or treaty)\/classifier for long thin things (ribbon, river, road, trousers etc)"],"pinyin":["tiao2"],"word":"条"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"},{"definition":["to walk\/to go\/to run\/to move (of vehicle)\/to visit\/to leave\/to go away\/to die (euph.)\/from\/through\/away (in compound verbs, such as 撤走[che4 zou3])\/to change (shape, form, meaning)"],"pinyin":["zou3"],"word":"走"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["abbr. for Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1]","black\/dark\/sinister\/secret\/shady\/illegal\/to hide (sth) away\/to vilify\/(loanword) to hack (computing)"],"pinyin":["Hei1","hei1"],"word":"黑"}],"containing_words":[],"sentences":[],"related":[{"definition":["to stubbornly insist on one's own ideas (idiom)"],"pinyin":["bu4 zhuang4 nan2 qiang2 bu4 hui2 tou2"],"word":"不撞南墙不回头"},{"definition":["lit. to follow one road until dark (idiom)\/fig. to stick to one's ways\/to cling to one's course"],"pinyin":["yi1 tiao2 lu4 zou3 dao4 hei1"],"word":"一条路走到黑"},{"definition":["obstinate\/opinionated"],"pinyin":["ren4 si3 li3"],"word":"认死理"},{"definition":["stubborn\/inflexible\/one-track minded"],"pinyin":["yi1 gen1 jin1"],"word":"一根筋"},{"definition":["lit. once you've shot the arrow, there's no getting it back (idiom)\/fig. once you started sth, there's no turning back\/to have to finish what one started\/to be determined to reach one's goals in spite of setbacks"],"pinyin":["kai1 gong1 mei2 you3 hui2 tou2 jian4"],"word":"开弓没有回头箭"},{"definition":["this road is blocked\/fig. This method does not work.\/Doing this is no good."],"pinyin":["ci3 lu4 bu4 tong1"],"word":"此路不通"},{"definition":["the road back to where one came from"],"pinyin":["hui2 tou2 lu4"],"word":"回头路"},{"definition":["stubborn\/obstinate\/having a one-track mind"],"pinyin":["si3 xin1 yan3 'r"],"word":"死心眼儿"},{"definition":["lit. to smash a cracked pot (idiom); crazy despair in the face of a blemish, defect, error or setback"],"pinyin":["po4 guan4 po4 shuai1"],"word":"破罐破摔"},{"definition":["erhua variant of 認死理|认死理[ren4 si3 li3]"],"pinyin":["ren4 si3 li3 'r"],"word":"认死理儿"},{"definition":["lit. not to stop until one reaches the Yellow River (idiom)\/fig. to persevere until one reaches one's goal\/to keep going while some hope is left"],"pinyin":["bu4 dao4 Huang2 He2 xin1 bu4 si3"],"word":"不到黄河心不死"},{"definition":["to obstinately persist in going about things the wrong way (idiom)"],"pinyin":["zhi2 mi2 bu4 wu4"],"word":"执迷不悟"},{"definition":["to persist in one's views"],"pinyin":["gu4 zhi2 ji3 jian4"],"word":"固执己见"},{"definition":["lit. not to shed a tear until one sees the coffin (idiom)\/fig. refuse to be convinced until one is faced with grim reality"],"pinyin":["bu4 jian4 guan1 cai5 bu4 luo4 lei4"],"word":"不见棺材不落泪"},{"definition":["nowhere to go\/at the end of one's tether"],"pinyin":["wu2 lu4 ke3 zou3"],"word":"无路可走"},{"definition":["to leave oneself a way out"],"pinyin":["liu2 hou4 lu4"],"word":"留后路"}]}