{"definition":["a series of\/a string of"],"pinyin":["yi1 xi4 lie4"],"traditional":["一系列"],"rank":1521.0,"normalized_rank":0.021280763365186854,"fraction":0.0001050193702946381,"cumulative_fraction":0.6874506172559789,"word":"一系列","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to tie\/to fasten\/to button up","to connect\/to arrest\/to worry","to connect\/to relate to\/to tie up\/to bind\/to be (literary)","system\/department\/faculty"],"pinyin":["ji4","xi4","xi4","xi4"],"word":"系"},{"definition":["to arrange\/to line up\/file\/series\/(in data tables) column\/(Tw) row"],"pinyin":["lie4"],"word":"列"}],"containing_words":[],"sentences":[{"english":"Our service is free repairs due to a series of bar code barriers.","chinese":"我们的服务是免费维修条码机出现一系列的障碍问题。"},{"english":"All participants were given a series of questions about the true self.","chinese":"所有参与者都要回答有关真实的自我的一系列问题。"},{"english":"Dates become a series of business negotiations, often hard-nosed.","chinese":"约会成为一系列商务谈判，常常就像讨价还价。"},{"english":"Adds a sequence of connected cubic Bzier curves to the current figure.","chinese":"在当前图形中添加一系列相互连接的立方贝塞尔曲线。"},{"english":"The process continues as a chain reaction with other nuclei.","chinese":"这个过程和其他核子一起持续一系列反应。"},{"english":"Robert put the new employees through a series of tests.","chinese":"罗勃让新进员工进行了一系列的测验。"},{"english":"Next year has been designated as the Year of China-Pakistan Friendship. A number of exchange activities will be held.","chinese":"明年是“中巴友好年”，双方将举办一系列交流活动。"},{"english":"The Altamira Cave consists of a series of rooms and passages shaped like anS.","chinese":"阿尔塔米拉洞包括的一系列房间和塑造象像S型。"},{"english":"An outdoor game in which the players drive wooden balls through a series of wickets using long-handled mallets.","chinese":"一种游戏选手通过一系列环绕来打击一个木头球。"},{"english":"OCD patients feel compelled to repeat behaviours such as washing their hands.","chinese":"强迫症患者倍感强迫来重复一系列行为，如重复洗手。"},{"english":"The colours used are a selection of lovely soft greens and pinks.","chinese":"采用的颜色是一系列可爱的淡绿色和粉红色。"},{"english":"Therefore, he facilitates IBM and the software company positively achieves a series of agreements.","chinese":"因而，他积极促成IBM与软件公司告竣一系列协议。"},{"english":"And we're a delicate species, with a long list of wants.","chinese":"我们是一种易受伤害的种类，有着一系列的需求。"},{"english":"After a series of losses, Braddock is forced into retirement.","chinese":"在一系列损失之后，布拉多克被迫退休。"},{"english":"Beware, however, of making all your code a series of templates.","chinese":"不过，要谨防让所有代码成为一系列模板。"},{"english":"The great arises out of small things that are honored and cared for.","chinese":"事无巨细，任何大事都是由一系列的小事组成的。"}],"related":[{"definition":["(used for abstract things) a good deal, a lot of"],"pinyin":["zhu1 duo1"],"word":"诸多"},{"definition":["every kind of\/all kinds of\/various kinds"],"pinyin":["ge4 zhong3"],"word":"各种"},{"definition":["many-sided\/in many aspects"],"pinyin":["duo1 fang1 mian4"],"word":"多方面"},{"definition":["all kinds of"],"pinyin":["zhong3 zhong3"],"word":"种种"},{"definition":["(various things) such as\/such as (the following)"],"pinyin":["zhu1 ru2"],"word":"诸如"},{"definition":["series\/set"],"pinyin":["xi4 lie4"],"word":"系列"},{"definition":["et cetera\/and so on ...\/wait a minute!\/hold on!"],"pinyin":["deng3 deng3"],"word":"等等"},{"definition":["these"],"pinyin":["zhe4 xie1"],"word":"这些"},{"definition":["class\/rank\/grade\/equal to\/same as\/to wait for\/to await\/et cetera\/and so on\/et al. (and other authors)\/after\/as soon as\/once"],"pinyin":["deng3"],"word":"等"},{"definition":["many\/a lot of\/much"],"pinyin":["xu3 duo1"],"word":"许多"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相关"},{"definition":["some\/certain (things)"],"pinyin":["mou3 xie1"],"word":"某些"},{"definition":["as well as\/too\/and"],"pinyin":["yi3 ji2"],"word":"以及"},{"definition":["for example\/for instance\/such as"],"pinyin":["li4 ru2"],"word":"例如"},{"definition":["for example\/for instance\/such as"],"pinyin":["bi3 ru2"],"word":"比如"},{"definition":["to correspond\/answering (one another)\/to agree (among the part)\/corresponding\/relevant\/appropriate\/(modify) accordingly"],"pinyin":["xiang1 ying4"],"word":"相应"}]}