{"definition":["generally speaking"],"pinyin":["yi1 ban1 lai2 shuo1"],"traditional":["一般來說"],"rank":7777.0,"normalized_rank":0.10881031998097183,"fraction":0.000012524734407126918,"cumulative_fraction":0.90706837366346,"word":"一般来说","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["sort\/kind\/class\/way\/manner","see 般樂|般乐[pan2 le4]"],"pinyin":["ban1","pan2"],"word":"般"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"来"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)","variant of 說|说[shuo1]"],"pinyin":["shui4","shuo1","shuo1"],"word":"说"}],"containing_words":[],"sentences":[{"english":"These arenormally sedate affairs where empty chairs outnumber the audience.","chinese":"一般来说，空椅子比听众多是读书会上很平常的事。"},{"english":"Men, as a rule of thumb, should always keep their nails clipped.","chinese":"男人一般来说都应该保持指甲处于修剪过的状态。"},{"english":"Eggs that are scrambled and eaten with toast are typically unfertilized.","chinese":"我们吃的炒鸡蛋一般来说是未受精的鸡蛋。"},{"english":"Baloney. He's usually in bed by now.","chinese":"一般来说，到现在这个钟点，他已经上床睡觉了。"},{"english":"Generally speaking, ceramics product can is classified into two categories: practical and artistic.","chinese":"一般来说，陶瓷产品可以分为两类，即。"},{"english":"In general , a clutch has a clutch has a clutch disc as its major part.","chinese":"一般来说，离合器以离合器盘为其主要部件。"},{"english":"Generally, it should not be modified by the author.","chinese":"一般来说作者不应该修改这些值。"},{"english":"I: Generally it is 6 months and during this period you are half-paid.","chinese":"一般来说是6个月，这段期间你只能拿到工资的一半。"},{"english":"Generally speaking , neither gold nor stone are soluble in water.","chinese":"一般来说，金子和石头都不能溶解于水。"},{"english":"Pennies in particular are rarely pure copper.","chinese":"一般来说，硬币很少使用纯铜制造的。"},{"english":"Typically the marriages are arranged and women have two husbands.","chinese":"一般来说，这里没有婚姻自由，一个女人有两个老公。"},{"english":"As a rule competition reduces the difference in the prices on the same products to a minimum.","chinese":"一般来说，同类产品的竞争可将价格差异降至最低。"},{"english":"In general, the information from the blog posts is informative.","chinese":"一般来说，博客内的内容是具教育性的。"},{"english":"Generally speaking,the universe is hostile to man.","chinese":"一般来说，宇宙对人是不友好的。"},{"english":"The dampened cloth makes a great dirt magnet.","chinese":"一般来说，湿布是一块绝妙的灰尘吸铁石。"},{"english":"Generally, the sound of an announcer is euphonic.","chinese":"一般来说，播音员的声音都很好听。"}],"related":[]}