{"definition":["to get there in one step (idiom); easily done\/success at a stroke\/to get results overnight"],"pinyin":["yi1 cu4 er2 jiu4"],"traditional":["一蹴而就"],"rank":18571.0,"normalized_rank":0.2598323842569922,"fraction":0.000002771531223600644,"cumulative_fraction":0.9711524244173771,"word":"一蹴而就","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["variant of 蹴[cu4]","carefully\/to kick\/to tread on\/to stamp"],"pinyin":["cu4","cu4"],"word":"蹴"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"}],"containing_words":[],"sentences":[{"english":"The move toward worldwide peace and prosperity is a marathon, not a sprint.","chinese":"通往全球和平和繁荣之路是漫长的，不能一蹴而就。"},{"english":"The world must recognise that China can adjust, but it cannot adjust immediately.","chinese":"世界必须认识到，中国能够调整，但不可能一蹴而就。"},{"english":"For many of these entrepreneurs, success didn't happen overnight. Mr.","chinese":"对于其中许多创业者而言，成功并非一蹴而就的。"},{"english":"For many of these entrepreneurs, success didn`t happen overnight.","chinese":"对于许多创业者而言，成功并非一蹴而就。"},{"english":"Fighting corruption is a long-term commitment, and results will not come overnight.","chinese":"与腐败作斗争是一项长期的承诺，不能一蹴而就。"},{"english":"He understands that this ultimate goal will not be reached quickly.","chinese":"他了解实现这个最终目标不可能一蹴而就。"},{"english":"He knew that he could not transform society by one bugle blast.","chinese":"他知道，改造社会不能一蹴而就。"},{"english":"Systemic journalistic change will require societal change, and that will not happen overnight.","chinese":"新闻业的系统化改变要求社会变革，不可一蹴而就。"}],"related":[{"definition":["lit. one morning and one evening (idiom)\/fig. in a short period of time\/overnight"],"pinyin":["yi1 zhao1 yi1 xi1"],"word":"一朝一夕"},{"definition":["to act with undue haste (idiom); eager and impatient\/overhasty"],"pinyin":["cao1 zhi1 guo4 ji2"],"word":"操之过急"},{"definition":["variant of 蹴[cu4]","carefully\/to kick\/to tread on\/to stamp"],"pinyin":["cu4","cu4"],"word":"蹴"},{"definition":["anxious for quick results (idiom); to demand instant success\/impatient for result\/impetuous"],"pinyin":["ji2 yu2 qiu2 cheng2"],"word":"急于求成"},{"definition":["in sequence, step by step (idiom); to make steady progress incrementally"],"pinyin":["xun2 xu4 jian4 jin4"],"word":"循序渐进"},{"definition":["to accomplish the whole task at one stroke (idiom)"],"pinyin":["bi4 qi2 gong1 yu2 yi1 yi4"],"word":"毕其功于一役"},{"definition":["take your time\/take it easy"],"pinyin":["man4 man4 lai2"],"word":"慢慢来"},{"definition":["lit. to want to get fat with only one mouthful (proverb)\/fig. to try to achieve one's goal in the shortest time possible\/to be impatient for success"],"pinyin":["yi1 kou3 chi1 ge5 pang4 zi5"],"word":"一口吃个胖子"},{"definition":["to pursue unremittingly (idiom); to persevere"],"pinyin":["chi2 zhi1 yi3 heng2"],"word":"持之以恒"},{"definition":["lit. to want sth in haste, but cannot get there (idiom, from Analects); more haste, less speed\/don't try to run before you can walk"],"pinyin":["yu4 su4 ze2 bu4 da2"],"word":"欲速则不达"},{"definition":["propitious wind throughout the journey (idiom)\/plain sailing\/to go smoothly\/have a nice trip!"],"pinyin":["yi1 fan1 feng1 shun4"],"word":"一帆风顺"},{"definition":["one step, one footprint (idiom); steady progress\/reliable"],"pinyin":["yi1 bu4 yi1 ge4 jiao3 yin4"],"word":"一步一个脚印"},{"definition":["course of events\/process\/CL:個|个[ge4]"],"pinyin":["guo4 cheng2"],"word":"过程"},{"definition":["inevitable outcome\/inescapable consequence"],"pinyin":["bi4 ran2 jie2 guo3"],"word":"必然结果"},{"definition":["to accumulate\/accumulation\/cumulative\/cumulatively"],"pinyin":["ji1 lei3"],"word":"积累"},{"definition":["lit. where water flows, a canal is formed (idiom)\/fig. when conditions are right, success will follow naturally"],"pinyin":["shui3 dao4 qu2 cheng2"],"word":"水到渠成"}]}