{"definition":["lit. three monks have no water to drink (idiom)\/fig. everybody's business is nobody's business\/(If there is one monk, he will fetch water for himself. If there are two, they will fetch water together. But if there are three or more, none will take it upon himself to fetch water.)"],"pinyin":["san1 ge4 he2 shang5 mei2 shui3 he1"],"traditional":["三個和尚沒水喝"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"三个和尚没水喝","characters":[{"definition":["surname San","three\/3"],"pinyin":["San1","san1"],"word":"三"},{"definition":["variant of 個|个[ge4]","individual\/this\/that\/size\/classifier for people or objects in general"],"pinyin":["ge4","ge4"],"word":"个"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["still\/yet\/to value\/to esteem","surname Shang"],"pinyin":["shang4","Shang4"],"word":"尚"},{"definition":["(negative prefix for verbs)\/have not\/not","drowned\/to end\/to die\/to inundate"],"pinyin":["mei2","mo4"],"word":"没"},{"definition":["surname Shui","water\/river\/liquid\/beverage\/additional charges or income\/(of clothes) classifier for number of washes"],"pinyin":["Shui3","shui3"],"word":"水"},{"definition":["to drink\/variant of 嗬[he1]","to shout"],"pinyin":["he1","he4"],"word":"喝"}],"containing_words":[],"sentences":[],"related":[{"definition":["see 三個和尚沒水喝|三个和尚没水喝[san1 ge4 he2 shang5 mei2 shui3 he1]"],"pinyin":["san1 ge4 he2 shang5 mei2 shui3 chi1"],"word":"三个和尚没水吃"},{"definition":["lit. a child who cries gets to feed at the breast (idiom)\/fig. the squeaky wheel gets the grease"],"pinyin":["hui4 ku1 de5 hai2 zi5 you3 nai3 chi1"],"word":"会哭的孩子有奶吃"},{"definition":["lit. the mountain can't have two tigers (idiom)\/fig. this town ain't big enough for the two of us\/(of two rivals) to be fiercely competitive"],"pinyin":["yi1 shan1 bu4 rong2 er4 hu3"],"word":"一山不容二虎"},{"definition":["three men talking makes a tiger (idiom); repeated rumor becomes a fact"],"pinyin":["san1 ren2 cheng2 hu3"],"word":"三人成虎"},{"definition":["lit. sandpiper and clam war together and the fisherman catches both (idiom); fig. neighbors who can't agree lose out to a third party"],"pinyin":["yu4 bang4 xiang1 zheng1 , yu2 weng1 de2 li4"],"word":"鹬蚌相争，渔翁得利"},{"definition":["it's the most capable people who do the most work (idiom) (intended as consolation for the overworked, or flattery when making a request etc)"],"pinyin":["neng2 zhe3 duo1 lao2"],"word":"能者多劳"},{"definition":["Kong Rong giving up pears, classic moral story about Kong Rong 孔融[Kong3 Rong2] picking up smaller pears while leaving the bigger ones to his older brothers, still used nowadays to educate the young on courtesy and modesty"],"pinyin":["Kong3 Rong2 rang4 li2"],"word":"孔融让梨"},{"definition":["egalitarianism"],"pinyin":["ping2 jun1 zhu3 yi4"],"word":"平均主义"},{"definition":["lit. to try to make an ox drink by forcing its head down to the water (idiom)\/fig. to try to impose one's will on sb"],"pinyin":["niu2 bu4 he1 shui3 qiang3 an4 tou2"],"word":"牛不喝水强按头"},{"definition":["when everybody gathers fuel, the flames are higher (idiom)\/the more people, the more strength"],"pinyin":["zhong4 ren2 shi2 chai2 huo3 yan4 gao1"],"word":"众人拾柴火焰高"},{"definition":["mutually shirking responsibilities (idiom); each blaming the other\/passing the buck to and fro\/each trying to unload responsibilities onto the other"],"pinyin":["hu4 xiang1 tui1 wei3"],"word":"互相推诿"},{"definition":["tragedy of the commons (economics)"],"pinyin":["gong1 di4 bei1 ju4"],"word":"公地悲剧"},{"definition":["unity is strength (revolutionary slogan and popular song of 1943)"],"pinyin":["tuan2 jie2 jiu4 shi4 li4 liang5"],"word":"团结就是力量"},{"definition":["lit. the butt governs the head (idiom)\/fig. where one stands depends on where one sits\/one's views are shaped by one's circumstances"],"pinyin":["pi4 gu5 jue2 ding4 nao3 dai5"],"word":"屁股决定脑袋"},{"definition":["common saying\/proverb"],"pinyin":["su2 hua4"],"word":"俗话"},{"definition":["the shot hits the bird that pokes its head out (idiom)\/nonconformity gets punished"],"pinyin":["qiang1 da3 chu1 tou2 niao3"],"word":"枪打出头鸟"}]}