{"definition":["Romance of the Three Kingdoms by Luo Guanzhong 羅貫中|罗贯中[Luo2 Guan4 zhong1], one of the Four Classic Novels of Chinese literature\/a fictional account of the Three Kingdoms at the break-up of the Han around 200 AD, consistently portraying Liu Bei's Shu Han 劉備|刘备, 蜀漢|蜀汉 as virtuous heroes and Cao Cao's Wei 曹操, 魏 as tyrannical villains"],"pinyin":["San1 guo2 Yan3 yi4"],"traditional":["三國演義"],"rank":21018.0,"normalized_rank":0.29406908902662543,"fraction":0.000002152586085706052,"cumulative_fraction":0.9771492894109156,"word":"三国演义","characters":[{"definition":["surname San","three\/3"],"pinyin":["San1","san1"],"word":"三"},{"definition":["surname Guo","country\/nation\/state\/national\/CL:個|个[ge4]"],"pinyin":["Guo2","guo2"],"word":"国"},{"definition":["to develop\/to evolve\/to practice\/to perform\/to play\/to act"],"pinyin":["yan3"],"word":"演"},{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["yi4","Yi4"],"word":"义"}],"containing_words":[],"sentences":[{"english":"\" The romance of the Three Kingdoms \" in figure on each side of its state, long or short.","chinese":"《三国演义》中的人物各具其态，有长有短。"},{"english":"My favorite book is the romance of The Three Kingdoms by luo guanzhong in Ming dynasty.","chinese":"我最喜爱的书是明代罗贯中所著《三国演义》了。"},{"english":"Historical Pinghua has much bearing on the novel Romance of the Three Kingdoms.","chinese":"讲史平话与《三国演义》成书的关系十分密切。"},{"english":"Some teachers even ask little children to read Romance of the Three Kingdoms.","chinese":"有的老师甚至叫小孩子去读《三国演义》。"},{"english":"The game was designed with the novel Romance of the Three Kingdoms in mind.","chinese":"这款游戏的设计理念源自小说《三国演义》。"},{"english":"The lengthy historical novel\" the Romance of the Three Kingdoms\" inside, displays obviously censures Cao.","chinese":"长篇历史小说《三国演义》里面，表现出明显的贬曹。"},{"english":"Tentative analysis of ambitious scoundrel Caocao figure in Romance of the Three kingdoms.","chinese":"试析三国演义里曹操的奸雄形象。"},{"english":"That day you were reading the Chinese classics \"Romance of the 3 kingdom\".","chinese":"那一天你在读中国古典名著三国演义。"}],"related":[{"definition":["to dramatize historical events\/novel or play on historical theme"],"pinyin":["yan3 yi4"],"word":"演义"},{"definition":["Luo Guanzhong (c. 1330-c. 1400), author of the Romance of the Three Kingdoms and other works"],"pinyin":["Luo2 Guan4 zhong1"],"word":"罗贯中"},{"definition":["History of the Three Kingdoms, fourth of the 24 dynastic histories 二十四史[Er4 shi2 si4 Shi3], composed by Chen Shou 陳壽|陈寿[Chen2 Shou4] in 289 during Jin Dynasty 晉朝|晋朝[Jin4 chao2], 65 scrolls"],"pinyin":["San1 guo2 zhi4"],"word":"三国志"},{"definition":["Water Margin or Outlaws of the Marsh by Shi Nai'an 施耐庵[Shi1 Nai4 an1], one of the Four Classic Novels of Chinese literature"],"pinyin":["Shui3 hu3 Zhuan4"],"word":"水浒传"},{"definition":["the 24 or 25 official dynastic histories\/true history, as opposed to fictional adaptation or popular legends"],"pinyin":["zheng4 shi3"],"word":"正史"},{"definition":["edge of the water\/shore or sea, lake or river\/seashore"],"pinyin":["shui3 hu3"],"word":"水浒"},{"definition":["\"The Story of Yue Fei\", biography of Song dynasty patriot and general Yue Fei 岳飛|岳飞[Yue4 Fei1]"],"pinyin":["Shuo1 Yue4 Quan2 zhuan4"],"word":"说岳全传"},{"definition":["Battle of Redcliff of 208 at Chibi in Huangzhou district 黃州區|黄州区 of Huanggang city 黄冈, a decisive defeat of Cao Cao 曹操 at the hands of southern kingdom of Wu\/famous episode in the Romance of the Three Kingdoms 三國演義|三国演义"],"pinyin":["Chi4 bi4 zhi1 zhan4"],"word":"赤壁之战"},{"definition":["courtesy name of Zhao Yun 趙雲|赵云[Zhao4 Yun2], general of Shu in Romance of the Three Kingdoms"],"pinyin":["Zhao4 Zi3 long2"],"word":"赵子龙"},{"definition":["courtesy name of 關羽|关羽[Guan1 Yu3]"],"pinyin":["Guan1 Yun2 chang2"],"word":"关云长"},{"definition":["Investiture of the Gods, major Ming dynasty vernacular novel of mythology and fantasy, very loosely based on King Wu of Zhou's 周武王[Zhou1 Wu3 wang2] overthrow of the Shang, subsequent material for opera, film, TV series, computer games etc"],"pinyin":["Feng1 shen2 Yan3 yi4"],"word":"封神演义"},{"definition":["the Four Classic Novels of Chinese literature, namely: A Dream of Red Mansions 紅樓夢|红楼梦[Hong2 lou2 Meng4], Romance of Three Kingdoms 三國演義|三国演义[San1 guo2 Yan3 yi4], Water Margin 水滸傳|水浒传[Shui3 hu3 Zhuan4], Journey to the West 西遊記|西游记[Xi1 you2 Ji4]"],"pinyin":["si4 da4 ming2 zhu4"],"word":"四大名著"},{"definition":["Cao Cao (155-220), famous statesman and general at the end of Han, noted poet and calligrapher, later warlord, founder and first king of Cao Wei 曹魏, father of Emperor Cao Pi 曹丕\/the main villain of novel the Romance of Three Kingdoms 三國演義|三国演义"],"pinyin":["Cao2 Cao1"],"word":"曹操"},{"definition":["Dramatized History of Sui and Tang, novel by Qing dynasty author Chu Renhuo 褚人獲|褚人获[Chu3 Ren2 huo4]"],"pinyin":["Sui2 Tang2 Yan3 yi4"],"word":"隋唐演义"},{"definition":["Western Jin dynasty 西晋 historian, author of History of the Three Kingdoms 三國志|三国志"],"pinyin":["Chen2 Shou4"],"word":"陈寿"},{"definition":["lit. using straw boats to borrow arrows (idiom, from 三國演義|三国演义[San1 guo2 Yan3 yi4])\/fig. to use others' manpower and resources for one's own ends"],"pinyin":["cao3 chuan2 jie4 jian4"],"word":"草船借箭"}]}