{"definition":["above\/on top of\/on the surface of","(of alcohol) to go to one's head\/(old) (of a bride-to-be) to bind one's hair into a bun\/(of a prostitute) to receive a patron for the first time"],"pinyin":["shang4 tou5","shang4 tou2"],"traditional":["上頭","上頭"],"rank":24757.0,"normalized_rank":0.3463825500538665,"fraction":0.0000015133500576776511,"cumulative_fraction":0.9839270558802466,"word":"上头","characters":[{"definition":["on top\/upon\/above\/upper\/previous\/first (of multiple parts)\/to climb\/to get onto\/to go up\/to attend (class or university)","see 上聲|上声[shang3 sheng1]"],"pinyin":["shang4","shang3"],"word":"上"},{"definition":["suffix for nouns","head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]"],"pinyin":["tou5","tou2"],"word":"头"}],"containing_words":[],"sentences":[{"english":"Heng Shui Laobaigan is one of the most famous liquors in Hebei province and never goes to the head.","chinese":"衡水老白干是河北省最有名的白酒，而且喝了不上头。"},{"english":"No sooner did our English lessons begin than our heads began to nod.","chinese":"我们一上英文课，瞌睡虫就开始爬上头。"},{"english":"Puppet laughed at those broken lines above him on the high ropes.","chinese":"木偶得意的望著上头断了的悬线大笑。"},{"english":"They serve it in little metal cups and strew rose leaves upon it.","chinese":"他们以小巧的金属杯子盛酒，并在上头撒上玫瑰花瓣。"},{"english":"The red peach blooms high and low;","chinese":"山桃红花满上头。"},{"english":"They greenlit it, and we started writing scenes just to cast the thing.","chinese":"上头审核通过，我们就开始写些场景，开始建组。"},{"english":"During the day to see \"Lotus Just Buds, dragonfly stand on top of already.\"","chinese":"白天看“小荷才露尖尖角，早有蜻蜓立上头”。"},{"english":"The debutante's photograph was at the head of the society page.","chinese":"那位初进社交界少女的照片登在社会版的最上头。"},{"english":"He Junfeng query director, why want to give students wear a top cage?","chinese":"贺俊峰质问主任，为什么要给学员戴上头笼？"},{"english":"As I looked, 'thrones were set in place, and the Ancient of Days took his seat.","chinese":"我观看，见有宝座设立，上头坐着亘古常在者。"},{"english":"Can you afford to anger those above you?","chinese":"你把上头的人激怒了，后果你能承担吗？"},{"english":"Its doors were of powdered lacquer, and bulls and peacocks were wrought on them in raised and polished gold.","chinese":"门上上了金漆，上头还有精致的公牛和孔雀的金浮雕。"},{"english":"Red peach flowers cover a high mountain.","chinese":"山桃红花满上头。"},{"english":"This ones straight from the top.","chinese":"这是直接由上头交卸的。"},{"english":"The white house is on enjoying, really fee to devote to think.","chinese":"白家在享受上头，真是费尽心思。"},{"english":"The pink peach flowers crown the mountaintop.","chinese":"山桃红花满上头。"}],"related":[{"definition":["under\/the underside\/below"],"pinyin":["xia4 bian5"],"word":"下边"},{"definition":["behind\/the back\/the rear\/later\/afterwards\/(in) the future"],"pinyin":["hou4 tou5"],"word":"后头"},{"definition":["short note\/slip of paper\/stripe\/(slang) cop\/(old) prostitute"],"pinyin":["tiao2 zi5"],"word":"条子"},{"definition":["in front\/at the head\/ahead\/above"],"pinyin":["qian2 tou5"],"word":"前头"},{"definition":["inside\/interior"],"pinyin":["li3 tou5"],"word":"里头"},{"definition":["there"],"pinyin":["na4 'r"],"word":"那儿"},{"definition":["leader"],"pinyin":["tou2 'r"],"word":"头儿"},{"definition":["I\/me\/my\/(often used in early vernacular literature)","I\/me\/we\/my home\/our house"],"pinyin":["za2 jia1","zan2 jia1"],"word":"咱家"},{"definition":["peak\/summit\/(old) higher authorities\/superiors"],"pinyin":["shang4 feng1"],"word":"上峰"},{"definition":["in accordance with"],"pinyin":["yi1 zhe5"],"word":"依着"},{"definition":["to come directly towards one\/top\/immediate (superior)"],"pinyin":["ding3 tou2"],"word":"顶头"},{"definition":["to place upside down\/to invert\/to pour\/to throw out\/to move backwards\/however\/actually\/as a matter of fact\/contrary to expectation","to fall\/to collapse\/to lie horizontally\/to overthrow\/to fail\/to go bankrupt\/to change (trains or buses)\/to move around\/to resell at a profit"],"pinyin":["dao4","dao3"],"word":"倒"},{"definition":["front\/the front side\/in front of"],"pinyin":["qian2 bian5"],"word":"前边"},{"definition":["outside\/outer surface\/abroad\/place other than one's home"],"pinyin":["wai4 bian5"],"word":"外边"},{"definition":["important person"],"pinyin":["yao4 ren2"],"word":"要人"},{"definition":["stamp\/official seal"],"pinyin":["da4 yin4"],"word":"大印"}]}