{"definition":["to come up\/to approach\/(verb complement indicating success)"],"pinyin":["shang4 lai2"],"traditional":["上來"],"rank":2780.0,"normalized_rank":0.038895806808165324,"fraction":0.00005275427066112622,"cumulative_fraction":0.7796563517417193,"word":"上来","characters":[{"definition":["on top\/upon\/above\/upper\/previous\/first (of multiple parts)\/to climb\/to get onto\/to go up\/to attend (class or university)","see 上聲|上声[shang3 sheng1]"],"pinyin":["shang4","shang3"],"word":"上"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"来"}],"containing_words":[],"sentences":[{"english":"In fact, I usually don't catch anything.","chinese":"事实上，我通常什么都钓不上来。"},{"english":"They only had time for three people to climb up. Julia climbed up the rope.","chinese":"更恐怖但是时间紧迫，只容得下三个人爬上来。"},{"english":"He pulled a would-be suicide out of a river.","chinese":"他将一位自杀未遂者从河里拖上来。"},{"english":"Let your focus be on guiding your children to develop actual discipline.","chinese":"让你的重点落在指导孩子形成真正的纪律自制上来。"},{"english":"Joshua therefore commanded the priests, saying, Come ye up out of Jordan.","chinese":"你吩咐抬法柜的祭司从约旦河里上来。"},{"english":"How the hell did he get to be a pezzonovante, Hagen wondered.","chinese":"黑根在想，他怎么就做到总统顾问上来了。"},{"english":"Fish rose to the surface.","chinese":"鱼游到水面上来了。"},{"english":"'Jump up, ' said the man. 'Is that your boy?","chinese":"“上来吧，”车把式说道，“这是你儿子？”"},{"english":"Write it in your workbooks and give it in tomorrow.","chinese":"写在你的作业本上明天交上来。"},{"english":"With one last heave, the net was hauled in.","chinese":"随着最后的一下猛拉，网被拖了上来。"},{"english":"Water inched its way up the steps as first as first-floor outside walls collapsed.","chinese":"当一楼外墙塌陷时水慢慢地沿着台阶漫了上来。"},{"english":"Someone brought cold cuts, dark bread, and beer from the jeep.","chinese":"有人把吉普车上的冻肉，黑面包和啤酒送上来。"},{"english":"Oh, one more thing, I've ordered another dish, stuffed pork chop. Can it be served sooner?","chinese":"对了，我还点了一个酿猪扒，能否快些上来？"},{"english":"The sun rose and smiled on it.","chinese":"太阳升上来了，向无名花微笑。"},{"english":"Get ahead and know that some of those things they'll catch back up.","chinese":"往前走，明白有些事情他们会重新追上来。"},{"english":"Your car has heave-hoed out of the lake.","chinese":"你的汽车已从湖中拉上来了。"}],"related":[{"definition":["to go up"],"pinyin":["shang4 qu4"],"word":"上去"},{"definition":["(after a verb, indicates coming out, completion of an action, or ability to discern or detect)","to come out\/to appear\/to arise"],"pinyin":["chu5 lai5","chu1 lai2"],"word":"出来"},{"definition":["to return\/to come back"],"pinyin":["hui2 lai5"],"word":"回来"},{"definition":["to come over\/to manage\/to handle\/to be able to take care of","see 過來|过来[guo4 lai2]"],"pinyin":["guo4 lai2","guo4 lai5"],"word":"过来"},{"definition":["this side\/here"],"pinyin":["zhe4 bian1"],"word":"这边"},{"definition":["to come and see\/to see a topic from a certain point of view"],"pinyin":["lai2 kan4"],"word":"来看"},{"definition":["to go in"],"pinyin":["jin4 qu4"],"word":"进去"},{"definition":["to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)","to look after\/to take care of\/to watch\/to guard"],"pinyin":["kan4","kan1"],"word":"看"},{"definition":["as to\/considering\/for"],"pinyin":["lai2 jiang3"],"word":"来讲"},{"definition":["ahead\/in front\/preceding\/above\/also pr. [qian2 mian5]"],"pinyin":["qian2 mian4"],"word":"前面"},{"definition":["to go down\/to descend\/to go on\/to continue\/(of a servant) to withdraw"],"pinyin":["xia4 qu4"],"word":"下去"},{"definition":["to catch and hold on\/to continue\/to go on to do sth\/to follow\/to carry on\/then\/after that\/subsequently\/to proceed\/to ensue\/in turn\/in one's turn"],"pinyin":["jie1 zhe5"],"word":"接着"},{"definition":["to stand up\/to get up\/also pr. [qi3 lai2]","(after a verb) indicating the beginning and continuation of an action or a state\/indicating an upward movement (e.g. after 站[zhan4])\/indicating completion\/(after a perception verb, e.g. 看[kan4]) expressing preliminary judgment\/also pr. [qi3 lai5]"],"pinyin":["qi3 lai5","qi5 lai5"],"word":"起来"},{"definition":["to come in"],"pinyin":["jin4 lai2"],"word":"进来"},{"definition":["to say again\/to put off a discussion until later\/moreover\/what's more\/besides"],"pinyin":["zai4 shuo1"],"word":"再说"},{"definition":["rear\/back\/behind\/later\/afterwards\/also pr. [hou4 mian5]"],"pinyin":["hou4 mian4"],"word":"后面"}]}