{"definition":["aforementioned\/above-mentioned"],"pinyin":["shang4 shu4"],"traditional":["上述"],"rank":1212.0,"normalized_rank":0.01695745246456704,"fraction":0.00013357128031019031,"cumulative_fraction":0.6508301385688108,"word":"上述","characters":[{"definition":["on top\/upon\/above\/upper\/previous\/first (of multiple parts)\/to climb\/to get onto\/to go up\/to attend (class or university)","see 上聲|上声[shang3 sheng1]"],"pinyin":["shang4","shang3"],"word":"上"},{"definition":["to state\/to tell\/to narrate\/to relate"],"pinyin":["shu4"],"word":"述"}],"containing_words":[],"sentences":[{"english":"In conclusion, photoperiod is an effective method to improve dairy goat production.","chinese":"综合上述，延长光照可有效增进乳羊产能。"},{"english":"By means of the method, a full-scale test pile in Zhenjiang Port has been analysed.","chinese":"对镇江大港原型试桩采用上述方法进行了分析。"},{"english":"The invention also discloses a producing method of above light leading board .","chinese":"本发明还揭露了一种制造上述导光板的方法。"},{"english":"In combination with the above, solar evacuated tubes provide for the domestic hot water needs.","chinese":"结合上述，采用太阳能真空集热管为家里提供热水。"},{"english":"Study the calculational methods of combinatorial sprinkler uniformity based on the above-mentioned mapped model.","chinese":"研究了基于上述映射模型的喷灌组合均匀度计算方法。"},{"english":"Vice Chairman Raidi of the NPC Standing Committee attended the abovementioned activities.","chinese":"全国人大常委会副委员长热地参加了上述活动。"},{"english":"Then, rinses the saliva including the approximately 10 milliliters , rinses 1 minute with the above method.","chinese":"然后，含约10毫升的漱口水，用上述方法漱1分钟。"},{"english":"The air-jet yarn strength of these three kinds material has attained the anticipatory aim.","chinese":"上述三种原料喷气纱的单纱强度均达到了预期的目标。"},{"english":"The district where the experiment was carried out was the area watered by the Tennessee River in the U. S. A.","chinese":"进行上述试验的地区正是美国田纳西河所灌溉的地区。"},{"english":"The following sub-sections will address the final three of the above steps.","chinese":"以下几小节内容将介绍上述后三个步骤。"},{"english":"All of these issues will be on the agenda tomorrow when I meet with President Hu.","chinese":"我明天与胡主席会晤时，会就上述所有问题交换看法。"},{"english":"A hardware-in-the-loop test bench was developed and was applied in debugging the algorithms that had been mentioned previously.","chinese":"应用自制的硬件在环试验平台对上述算法进行了调试。"},{"english":"None of the claims about the Prince were ever proven and no rumours were substantiated.","chinese":"上述对亲王的种种断言及风言风语都没有得到证实。"},{"english":"What does this sketchy historical record suggest for today's number one power?","chinese":"上述粗略的历史回顾，对今天的头号强国有何启示呢？"},{"english":"Enter each in the same manner as above.","chinese":"请按照上述的相同方式输入数据。"},{"english":"There are no or faint enzyme reaction products in low differentiated adenocarcinoma.","chinese":"低分化腺癌上述酶大都无反应或反应微弱。"}],"related":[{"definition":["aforestated\/stated above\/the preceding statement"],"pinyin":["qian2 shu4"],"word":"前述"},{"definition":["this kind\/these kinds\/such"],"pinyin":["ci3 lei4"],"word":"此类"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相关"},{"definition":["besides\/in addition\/moreover\/furthermore"],"pinyin":["ci3 wai4"],"word":"此外"},{"definition":["that level or lower\/that amount or less\/the following"],"pinyin":["yi3 xia4"],"word":"以下"},{"definition":["as follows"],"pinyin":["ru2 xia4"],"word":"如下"},{"definition":["that level or higher\/that amount or more\/the above-mentioned\/(used to indicate that one has completed one's remarks) That is all."],"pinyin":["yi3 shang4"],"word":"以上"},{"definition":["to give\/to impose\/to apply"],"pinyin":["yu3 yi3"],"word":"予以"},{"definition":["other\/(sth or sb) else\/the rest"],"pinyin":["qi2 ta1"],"word":"其他"},{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["to get rid of\/to remove\/to exclude\/to eliminate\/to wipe out\/to divide\/except\/not including"],"pinyin":["chu2"],"word":"除"},{"definition":["notable\/noteworthy\/merit attention"],"pinyin":["zhi2 de5 zhu4 yi4"],"word":"值得注意"},{"definition":["other\/the others\/else\/other than it\/in addition to the thing mentioned above"],"pinyin":["qi2 ta1"],"word":"其它"},{"definition":["additional\/in addition\/besides\/separate\/other\/moreover\/furthermore"],"pinyin":["ling4 wai4"],"word":"另外"},{"definition":["and\/to reach\/up to\/in time for"],"pinyin":["ji2"],"word":"及"},{"definition":["maybe\/perhaps\/might\/possibly\/or"],"pinyin":["huo4"],"word":"或"}]}