{"definition":["not to be repeated\/not to be taken as a precedent\/just this once"],"pinyin":["xia4 bu4 wei2 li4"],"traditional":["下不為例"],"rank":42512.0,"normalized_rank":0.5947980356218432,"fraction":3.0407139675340466e-7,"cumulative_fraction":0.997347945624884,"word":"下不为例","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"},{"definition":["example\/precedent\/rule\/case\/instance"],"pinyin":["li4"],"word":"例"}],"containing_words":[],"sentences":[{"english":"\"Never again\" became the watchword.","chinese":"“下不为例”成了口号。"},{"english":"My decision does not constitute (ie should not be regarded as) a precedent.","chinese":"我的决定下不为例。"},{"english":"Make a promise to your team or peers to act differently.","chinese":"向你的团队或同仁承诺，下不为例。"},{"english":"We're going to look into the root cause of the failures, get it resolved once for all.","chinese":"准备深入调查失效的根本原因，保证下不为例。"},{"english":"I will let you off this time. Do not let it happen again.","chinese":"这次我就饶了你，但下不为例。"},{"english":"I'll overlook it this time, but don't do it again.","chinese":"我这次可以不计较，但下不为例。"},{"english":"It must be clearly understood that, in so doing, we are not establishing a precedent.","chinese":"必须明确理解，我们这样做是下不为例的。"}],"related":[{"definition":["to do as promised\/to be as good as one's word\/to honor one's word\/to mean what one says"],"pinyin":["shuo1 hua4 suan4 hua4"],"word":"说话算话"},{"definition":["lit. to punish a little to prevent a lot (idiom); to criticize former mistakes firmly to prevent large scale repetition"],"pinyin":["xiao3 cheng2 da4 jie4"],"word":"小惩大诫"},{"definition":["to do one's best\/to shape up\/to behave\/to fend for oneself\/you're on your own"],"pinyin":["hao3 zi4 wei2 zhi1"],"word":"好自为之"},{"definition":["a person of great moral stature does not remember the offenses committed by one of low moral stature"],"pinyin":["da4 ren2 bu4 ji4 xiao3 ren2 guo4"],"word":"大人不记小人过"},{"definition":["to keep one's promise\/to mean what one says"],"pinyin":["shuo1 hua4 suan4 shu4"],"word":"说话算数"},{"definition":["to forgive easily\/to let off lightly (often with negative: you won't get away with it)"],"pinyin":["qing1 rao2"],"word":"轻饶"},{"definition":["to recognize one's mistakes and be able to reform oneself (idiom)"],"pinyin":["zhi1 cuo4 neng2 gai3"],"word":"知错能改"},{"definition":["One who does not know is not guilty\/If one does not know any better, one cannot be held responsible"],"pinyin":["bu4 zhi1 zhe3 bu4 zui4"],"word":"不知者不罪"},{"definition":["to repeat a crime\/persistent offender"],"pinyin":["zai4 fan4"],"word":"再犯"},{"definition":["to forget and not bear recriminations (idiom); to let bygones be bygones\/There is no point in crying over spilt milk."],"pinyin":["ji4 wang3 bu4 jiu4"],"word":"既往不咎"},{"definition":["let's talk about the unpleasant things first\/let's be frank"],"pinyin":["chou3 hua4 shuo1 zai4 qian2 tou5"],"word":"丑话说在前头"},{"definition":["to know that one is in the wrong (idiom)"],"pinyin":["zi4 zhi1 li3 kui1"],"word":"自知理亏"},{"definition":["magnanimous (idiom); generous"],"pinyin":["kuan1 hong2 da4 liang4"],"word":"宽宏大量"},{"definition":["lit. to eat one's words\/to break a promise\/to go back on one's word\/to renege\/unsworn testimony"],"pinyin":["shi2 yan2"],"word":"食言"},{"definition":["open the net on one side (idiom); let the caged bird fly\/to give one's opponent a way out\/lenient treatment"],"pinyin":["wang3 kai1 yi1 mian4"],"word":"网开一面"},{"definition":["to act arbitrarily regardless of the rules\/to mess with sth\/to make a hash of things\/to cause trouble"],"pinyin":["hu2 lai2"],"word":"胡来"}]}