{"definition":["next office holder\/next to serve"],"pinyin":["xia4 jie4"],"traditional":["下屆"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"下届","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["to arrive at (place or time)\/period\/to become due\/classifier for events, meetings, elections, sporting fixtures, years (of graduation)"],"pinyin":["jie4"],"word":"届"}],"containing_words":[],"sentences":[{"english":"But he believed they would show in time for the next election.","chinese":"但是他相信在下届选举前结果会及时的呈现了。"},{"english":"Next Kortrijk will see without any doubt even bigger results.","chinese":"下届世界客车博览无疑将有更大的规模。"},{"english":"But he might also have forfeited his chance of a second term.","chinese":"不过他也有可能丧失下届当选的机会。"},{"english":"The focus will shift to a game of who's who in the next administration.","chinese":"焦点将放在下届特区政府的估领袖游戏。"},{"english":"So what should the next president do?","chinese":"那么，下届总统该如何抉择？"},{"english":"There will be no loosening up until after the next leadership change in 2012.","chinese":"直到2012年下届领导人换届前，不会有任何松懈。"},{"english":"We will report on progress at the next Health Assembly.","chinese":"我们将在下届卫生大会上报告进展。"},{"english":"But don’t bet on that necessarily being at the next election.","chinese":"不过你可别急着下届选举在这个上面投注。"},{"english":"And so I don't think that Americans want hubris from their next President.","chinese":"所以我认为美国人不想要一个傲慢的下届总统。"},{"english":"What benefits can Cologne expect from holding the WCG?","chinese":"科隆市可以从举办下届WCG中获得什么利益呢？"},{"english":"Ireland was originally scheduled for the next general election held in mid-2012.","chinese":"爱尔兰下届大选原定于2012年中期举行。"},{"english":"If the Workers' Party comes in at the next election a lot of industry will be state-owned.","chinese":"如果工人党下届上台执政，许多工业都将收为国有。"},{"english":"Both Mr Tsang and Mr Tang are tipped as forerunners in the race for the next chief executive.","chinese":"曾荫权和唐英年都被视为下届特首的热门人选。"},{"english":"This city has been selected as the site for the coming Olympic Games.","chinese":"这个城市被选为下届奥运会的会址。"},{"english":"The next government’s main job will be to sort all this out.","chinese":"下届政府的首要任务便是将这些问题全部解决。"},{"english":"But such measures can come into force only if the next Congress passes new legislation.","chinese":"但这类措施只有经下届国会通过新立法才会生效。"}],"related":[{"definition":["next office holder\/next to serve"],"pinyin":["xia4 ren4"],"word":"下任"},{"definition":["general election"],"pinyin":["da4 xuan3"],"word":"大选"},{"definition":["to continue in (a political) office\/to serve for another term of office"],"pinyin":["lian2 ren4"],"word":"连任"},{"definition":["to take part in an election\/to run for office"],"pinyin":["jing4 xuan3"],"word":"竞选"},{"definition":["presidential election"],"pinyin":["zong3 tong3 xuan3 ju3"],"word":"总统选举"},{"definition":["to be a candidate in an election or other selection process\/to run for office\/to turn out to vote"],"pinyin":["can1 xuan3"],"word":"参选"},{"definition":["all previous (meetings, sessions etc)"],"pinyin":["li4 jie4"],"word":"历届"},{"definition":["presidential election"],"pinyin":["zong3 tong3 da4 xuan3"],"word":"总统大选"},{"definition":["to arrive at (place or time)\/period\/to become due\/classifier for events, meetings, elections, sporting fixtures, years (of graduation)"],"pinyin":["jie4"],"word":"届"},{"definition":["to elect\/election\/CL:次[ci4],個|个[ge4]"],"pinyin":["xuan3 ju3"],"word":"选举"},{"definition":["candidate\/CL:名[ming2]"],"pinyin":["hou4 xuan3 ren2"],"word":"候选人"},{"definition":["to select sb for a position without announcing the decision until later\/to decide behind closed doors\/all cut and dried"],"pinyin":["nei4 ding4"],"word":"内定"},{"definition":["newly-appointed\/newly elected\/new (in a political office)"],"pinyin":["xin1 ren4"],"word":"新任"},{"definition":["the right to host (an international meeting)"],"pinyin":["zhu3 ban4 quan2"],"word":"主办权"},{"definition":["to go off the stage\/to fall from position of prestige\/to step down (from office etc)\/to disentangle oneself\/to get off the hook"],"pinyin":["xia4 tai2"],"word":"下台"},{"definition":["host country"],"pinyin":["zhu3 ban4 guo2"],"word":"主办国"}]}