{"definition":["to issue (a memorandum etc) to lower levels\/to distribute (e.g. disaster relief to victims)"],"pinyin":["xia4 fa1"],"traditional":["下發"],"rank":4116.0,"normalized_rank":0.05758818015194549,"fraction":0.00003195596229634557,"cumulative_fraction":0.8344280847361816,"word":"下发","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["hair\/Taiwan pr. [fa3]","to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa4","fa1"],"word":"发"}],"containing_words":[],"sentences":[{"english":"She unpinned her hair before going to bed.","chinese":"她在上床前取下发夹。"},{"english":"The croupier dealt each player a card , face down.","chinese":"赌台管理员给每位玩家正面朝下发了一张牌。"},{"english":"A document issued to sub-branches shall be sealed by all the issuers .","chinese":"联合下发的公文，发文机关都应当加盖印章。"},{"english":"No ephedrine shall be imported any more under any circumstances as of the date of issuance of this Circular.","chinese":"从本通知下发之日起，一律不再进口麻黄素。"},{"english":"The White House will staff out the recommendations before making a decision.","chinese":"白宫在做出决定之前，将会下发建议书。"},{"english":"So I've handed out an information sheet about it.","chinese":"我已经下发了一个包含考试信息的纸张。"},{"english":"All of these technical guidance documents were distributed to local authorities with the annual residue monitoring program together.","chinese":"上述技术指导性文件随年度残留监控计划一并下发。"}],"related":[{"definition":["to publish\/to print and distribute"],"pinyin":["yin4 fa1"],"word":"印发"},{"definition":["to notify\/to inform\/notice\/notification\/CL:個|个[ge4]"],"pinyin":["tong1 zhi1"],"word":"通知"},{"definition":["to officially launch (a policy, program etc)\/to appear on stage\/to appear publicly\/(of a bar girl) to leave with a client"],"pinyin":["chu1 tai2"],"word":"出台"},{"definition":["to transmit down (a chain of command)\/to pass down (to lower level)\/to issue\/to send through"],"pinyin":["xia4 da2"],"word":"下达"},{"definition":["to issue\/to proclaim\/to enact (laws, decrees etc)"],"pinyin":["ban1 bu4"],"word":"颁布"},{"definition":["letters\/correspondence"],"pinyin":["han2 jian4"],"word":"函件"},{"definition":["red-letterhead document, an official document with the name of the issuing government agency printed in red at the top, circulated to relevant bodies"],"pinyin":["hong2 tou2 wen2 jian4"],"word":"红头文件"},{"definition":["China Banking Regulatory Commission (CBRC), abbr. for 中國銀行業監督管理委員會|中国银行业监督管理委员会[Zhong1 guo2 Yin2 hang2 ye4 Jian1 du1 Guan3 li3 Wei3 yuan2 hui4]"],"pinyin":["Yin2 Jian1 hui4"],"word":"银监会"},{"definition":["to reply officially to a subordinate"],"pinyin":["pi1 fu4"],"word":"批复"},{"definition":["General Office of the Central Committee of the CCP, responsible for technical and logistical matters relating to the Central Committee\/abbr. to 中辦|中办[Zhong1 Ban4]"],"pinyin":["Zhong1 Gong4 Zhong1 yang1 Ban4 gong1 ting1"],"word":"中共中央办公厅"},{"definition":["to tidy up\/to reorganize\/to consolidate\/to rectify"],"pinyin":["zheng3 dun4"],"word":"整顿"},{"definition":["to announce\/to give notice"],"pinyin":["tong1 gao4"],"word":"通告"},{"definition":["post\/announcement"],"pinyin":["gong1 gao4"],"word":"公告"},{"definition":["to report to one's superiors\/to appear in the news\/to reply to a letter"],"pinyin":["shang4 bao4"],"word":"上报"},{"definition":["document\/file\/CL:份[fen4]"],"pinyin":["wen2 jian4"],"word":"文件"},{"definition":["ministries and commissions"],"pinyin":["bu4 wei3"],"word":"部委"}]}