{"definition":["to put poison in sth\/to poison"],"pinyin":["xia4 du2"],"traditional":["下毒"],"rank":29693.0,"normalized_rank":0.41544359408447945,"fraction":9.656420016916813e-7,"cumulative_fraction":0.9899487865567648,"word":"下毒","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["poison\/to poison\/poisonous\/malicious\/cruel\/fierce\/narcotics"],"pinyin":["du2"],"word":"毒"}],"containing_words":[{"definition":["to attack murderously\/to strike treacherously"],"pinyin":["xia4 du2 shou3"],"word":"下毒手"}],"sentences":[{"english":"The leadership of North Korea could be a poisoned chalice.","chinese":"朝鲜领导层有点像一只被下毒的圣杯。"},{"english":"Taste the food before the King eats to make sure it's not poisoned.","chinese":"在国王用餐之前先尝尝食物，确信饭菜没有被下毒。"},{"english":"As the wine was often full of sediment, a poison could be easily slipped into it.","chinese":"红酒中有许多沉淀物，很容易被下毒。"},{"english":"During the reign of King Henry VIII it was a punishment especially reserved for poisoners.","chinese":"在亨利三世统治时期，这是专为下毒的犯人准备的。"},{"english":"He is the sort of man to stab you in the back.","chinese":"他是那种会在背后给你下毒手的人。"},{"english":"Winston, if I were your wife I'd put poison in your coffee.","chinese":"温斯顿，如果我是你老婆，就会在你咖啡里下毒。"},{"english":"In desperation, he decided to throw the helve after the hatchet, in tribute tea against Hu poisoned.","chinese":"情急之下，他决定孤注一掷，在贡茶里下毒陷害胡家。"},{"english":"Mingming later meets Jiahui and forces her to poison Jinsheng.","chinese":"其后，明明再与嘉惠会面，并威逼她向金生下毒。"},{"english":"You miss himself since have been poisoned, who is good-bye Yi's believing him the person who puts poison in?","chinese":"你想他自己既已中毒，谁再会疑信他就是下毒的人？"},{"english":"He said the new poaching method, poisoning water holes, was incomprehensible in its cruelty.","chinese":"他说，在水坑下毒这种新盗猎方法的残忍令人费解。"},{"english":"The God of our fathers hath raised up Jesus, whom you put to death, hanging him upon a tree.","chinese":"我们祖先的天主复活了你们下毒手悬在木架上的耶稣。"},{"english":"Winston, if I were your wife I’d put poison in your coffee.","chinese":"温斯顿，如果我是你老婆，就会在你咖啡里下毒。"},{"english":"British Royals are apparently never served shellfish, because of a fear of food poisoning.","chinese":"皇室成员不吃贝壳类水生物，因为怕下毒。"},{"english":"But zina unwilling, her sister, let her secretly notice to miserably.","chinese":"可吉娜不甘心，她暗中通知姐姐，让她去下毒手了。"},{"english":"Paolo admits that he poisoned the doge.","chinese":"保罗承认是他下毒谋害总督。"}],"related":[{"definition":["to prescribe medicine\/to poison\/to slip a drug (into sb's drink etc)"],"pinyin":["xia4 yao4"],"word":"下药"},{"definition":["to kill by poisoning"],"pinyin":["du2 sha1"],"word":"毒杀"},{"definition":["to kill secretly\/to stab in the back"],"pinyin":["an4 hai4"],"word":"暗害"},{"definition":["to conspire to murder\/to plot against sb's life"],"pinyin":["mou2 hai4"],"word":"谋害"},{"definition":["to impute\/to shift the blame onto someone else"],"pinyin":["jia4 huo4"],"word":"嫁祸"},{"definition":["to entrap\/to set up\/to frame (up)\/to make false charges against"],"pinyin":["xian4 hai4"],"word":"陷害"},{"definition":["to frame sb (by planting sth on them)"],"pinyin":["zai1 zang1"],"word":"栽赃"},{"definition":["poison"],"pinyin":["du2 yao4"],"word":"毒药"},{"definition":["to assassinate\/to commit a murder"],"pinyin":["xing2 ci4"],"word":"行刺"},{"definition":["to kill sb to prevent them from divulging a secret\/to silence sb"],"pinyin":["mie4 kou3"],"word":"灭口"},{"definition":["knockout drops\/incapacitating agent\/Mickey Finn"],"pinyin":["mi2 yao4"],"word":"迷药"},{"definition":["to kill\/to cause death\/to do sb to death"],"pinyin":["hai4 si3"],"word":"害死"},{"definition":["to attack murderously\/to strike treacherously"],"pinyin":["xia4 du2 shou3"],"word":"下毒手"},{"definition":["to entrap\/to frame\/to plant false evidence against sb"],"pinyin":["wu1 xian4"],"word":"诬陷"},{"definition":["to plot against"],"pinyin":["an4 suan4"],"word":"暗算"},{"definition":["to assassinate\/(military) to fight with a bayonet\/(baseball) to put out (a baserunner)"],"pinyin":["ci4 sha1"],"word":"刺杀"}]}