{"definition":["to delegate\/to decentralize\/to demote a party cadre to work on the shop floor or in the countryside"],"pinyin":["xia4 fang4"],"traditional":["下放"],"rank":11764.0,"normalized_rank":0.16459362276663916,"fraction":0.0000063149921380471846,"cumulative_fraction":0.9424549409870152,"word":"下放","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["to put\/to place\/to release\/to free\/to let go\/to let out\/to set off (fireworks)"],"pinyin":["fang4"],"word":"放"}],"containing_words":[],"sentences":[{"english":"Lift brake lever for running out and lowering.","chinese":"抬起重锤使艇倒出并下放。"},{"english":"Lower drill string to top of pin and engage threads.","chinese":"下放钻柱至丝扣部分，拧上丝扣。"},{"english":"The central government has decided to devolve authority on the regions.","chinese":"中央政府已决定将权力下放给地方。"},{"english":"On the exhale bend your elbows and lower your chest onto your thighs.","chinese":"呼气时曲手肘，胸部向下放于大腿上。"},{"english":"But after a project is in motion, control necessarily decentralizes.","chinese":"但是当项目一经启动，就有必要下放控制力。"},{"english":"If we decentralize, the provinces will have more autonomy.","chinese":"如果我们将权力下放，各省就有更多的自主权。"},{"english":"I will sign the signature after any article in this blog.","chinese":"以后我都会在文章下放上这个签名档。"},{"english":"Lots of companies talk about decentralizing responsibility and authority.","chinese":"许多公司都谈论下放责任和权力。"},{"english":"As a first step, managers need to overcome the fear of losing control.","chinese":"但是作为第一步，管理人员需要克服权力下放的恐惧。"},{"english":"The full process of restoring devolution was only completed in 2010.","chinese":"归还下放权力的整个过程，方于2010年完成。"},{"english":"Store bananas at room temperature until they ripen.","chinese":"把香蕉于室温下放至成熟。"},{"english":"Put a bucket under the hole in the drain pipe to catch any overflow.","chinese":"在排水管的那个洞下放个水桶接住漏出的水。"},{"english":"IX. Without approval of the Ministry of Commerce, the local department shall not transfer the approval power to a lower level.","chinese":"未经商务部批准，地方部门不得下放此项审批权限。"},{"english":"When we set the table, we always set the plate upside-down.","chinese":"我们不管什么时候摆餐具，都得把碟子朝下放。"},{"english":"The filing level for foreign direct investment in real estate in the government has been lower down.","chinese":"商务部下放外商直接投资内地房地产备案权。"},{"english":"The refinement process can continue for any number of levels, until it finally reaches users.","chinese":"细化过程还可以逐级下放，直到最终达到用户为止。"}],"related":[{"definition":["to change one's profession\/to transfer to civilian work"],"pinyin":["zhuan3 ye4"],"word":"转业"},{"definition":["to cancel\/cancellation"],"pinyin":["qu3 xiao1"],"word":"取消"},{"definition":["to incline\/to lean\/to slant\/to slope\/to tilt"],"pinyin":["qing1 xie2"],"word":"倾斜"},{"definition":["to promote to a higher job\/to select for promotion"],"pinyin":["ti2 ba2"],"word":"提拔"},{"definition":["to demobilize\/demobilization"],"pinyin":["fu4 yuan2"],"word":"复员"},{"definition":["cadre\/official\/officer\/manager"],"pinyin":["gan4 bu4"],"word":"干部"},{"definition":["to reduce\/to pare down\/to streamline"],"pinyin":["jing1 jian3"],"word":"精减"},{"definition":["higher authorities\/superiors\/CL:個|个[ge4]"],"pinyin":["shang4 ji2"],"word":"上级"},{"definition":["to find a place for\/to help settle down\/to arrange for\/to get into bed\/placement"],"pinyin":["an1 zhi4"],"word":"安置"},{"definition":["working hand\/member of a work team\/participant\/(short form of 第一把手[di4 yi1 ba3 shou3]) the boss"],"pinyin":["yi1 ba3 shou3"],"word":"一把手"},{"definition":["central\/middle\/center\/central authorities (of a state)"],"pinyin":["zhong1 yang1"],"word":"中央"},{"definition":["to temporarily transfer (personnel)"],"pinyin":["jie4 diao4"],"word":"借调"},{"definition":["reform\/CL:次[ci4],種|种[zhong3],項|项[xiang4]\/to reform"],"pinyin":["gai3 ge2"],"word":"改革"},{"definition":["to be transferred to another post\/to post away"],"pinyin":["diao4 zhi2"],"word":"调职"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"},{"definition":["to rise through the ranks (as a party cadre)"],"pinyin":["ti2 gan4"],"word":"提干"}]}