{"definition":["underneath\/below\/the underside\/world of mortals\/to descend to the world of mortals (of Gods)"],"pinyin":["xia4 fang1"],"traditional":["下方"],"rank":6473.0,"normalized_rank":0.09056566815440796,"fraction":0.000016569482492217332,"cumulative_fraction":0.8882806863905324,"word":"下方","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["fang1","Fang1"],"word":"方"}],"containing_words":[{"definition":["beneath"],"pinyin":["zai4 xia4 fang1"],"word":"在下方"}],"sentences":[{"english":"The pain may also be felt beneath the precordium.","chinese":"也可在胸前区下方有疼痛感觉。"},{"english":"The Soyuz spacecraft appears at the bottom left.","chinese":"联盟号宇宙飞船出现在图片的左下方。"},{"english":"When a dam is built, the accumulating water presses down upon the rock below.","chinese":"当大坝建成，逐渐积累的水压压向下方的岩石。"},{"english":"In open-pit mines, the problem of underground mining under the slope is usually encountered.","chinese":"边坡下方井工开采是一个露天煤矿普遍存在的问题。"},{"english":"Please select all the photos you request for the high-resolution version, and then click the bottom button.","chinese":"请在选中所有所需高像素图片后，点击下方按钮。"},{"english":"If you may have any question, please leave them below.","chinese":"西蒙妮有任何问题，请在预告下方留言。"},{"english":"A large complete bottom note LOGO.","chinese":"右下方注有大运完整LOGO。"},{"english":"Label each picture the appropriate style of cooking potatoes.","chinese":"请把正确的土豆烹饪方法填到相应的图片下方。"},{"english":"The bottom part of each separation container unit is provided with water outlet passage pointed back and downward.","chinese":"各分离容器单元的底部均有指向后下方的出水通道。"},{"english":"The Nike shox has a slot beneath the cushion that lines the shoe.","chinese":"耐克弹力柱鞋在鞋垫下方有一个狭缝。"},{"english":"Fuk golden words below to apply the same process for \"Fu as the East China Sea water\" font.","chinese":"金色福字下方采用同样的工艺作“福如东海水”字体。"},{"english":"Set this option to show the file size below the image thumbnail.","chinese":"设定此选项以在图像缩略图下方显示文件大小。"},{"english":"The inferior and lateral convex border of the stomach is the greater curvature .","chinese":"胃的下方及侧面凸缘是胃大弯。"},{"english":"A light tube hangs below the shelves on four leather straps.","chinese":"灯管用四条皮革带挂在架子的下方。"},{"english":"It's an image that will be displayed below the drawings, like a frame for example.","chinese":"这是显示在桌面小程式下方的图形，就像是相框一样。"},{"english":"The slope mine under the town was slowly filled with salt brine making the surface subside.","chinese":"小镇下方的倾斜巷道慢慢被盐水充满以致地表下沉。"}],"related":[{"definition":["bottom"],"pinyin":["di3 bu4"],"word":"底部"},{"definition":["under\/the underside\/below"],"pinyin":["xia4 bian5"],"word":"下边"},{"definition":["end\/tip\/extremity"],"pinyin":["mo4 wei3"],"word":"末尾"},{"definition":["below\/under\/next\/the following\/also pr. [xia4 mian5]","to boil noodles"],"pinyin":["xia4 mian4","xia4 mian4"],"word":"下面"},{"definition":["to leave a message\/to leave one's comments\/message"],"pinyin":["liu2 yan2"],"word":"留言"},{"definition":["two-dimensional barcode\/QR code"],"pinyin":["er4 wei2 ma3"],"word":"二维码"},{"definition":["down\/downward"],"pinyin":["xiang4 xia4"],"word":"向下"},{"definition":["bottom\/bottom side\/end part"],"pinyin":["di3 duan1"],"word":"底端"},{"definition":["to scan"],"pinyin":["sao3 miao2"],"word":"扫描"},{"definition":["the top\/above\/overhead\/upwards\/the top margin\/above-mentioned\/those higher up"],"pinyin":["shang4 bian5"],"word":"上边"},{"definition":["roof\/topmost part\/top (of tree, wall etc)\/apex"],"pinyin":["ding3 bu4"],"word":"顶部"},{"definition":["left side"],"pinyin":["zuo3 ce4"],"word":"左侧"},{"definition":["left\/the left side\/to the left of"],"pinyin":["zuo3 bian5"],"word":"左边"},{"definition":["to pay attention to\/to follow sth closely\/to follow (on social media)\/concern\/interest\/attention"],"pinyin":["guan1 zhu4"],"word":"关注"},{"definition":["sentence-final particle that conveys informality, warmth, friendliness or intimacy\/may also indicate that one is stating a fact that the other person is not aware of","oh (interjection indicating that one has just learned sth)","oh (interjection indicating doubt or surprise)","to chant"],"pinyin":["o5","o4","o2","e2"],"word":"哦"},{"definition":["on top of\/above-mentioned\/also pr. [shang4 mian5]"],"pinyin":["shang4 mian4"],"word":"上面"}]}