{"definition":["to take down from the shelves (e.g. a contaminated product)"],"pinyin":["xia4 jia4"],"traditional":["下架"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"下架","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["to support\/frame\/rack\/framework\/classifier for planes, large vehicles, radios etc"],"pinyin":["jia4"],"word":"架"}],"containing_words":[],"sentences":[{"english":"Authorities said hair dye containing lentine will be pulled off the shelves soon.","chinese":"相关人员表示，这些染发剂将很快下架。"},{"english":"Wan also said the company will not take the product off shelves or accept any returns.","chinese":"万玉华说，不会对产品进行下架或退货处理。"},{"english":"They were shipped all over the country but should be off store shelves by now.","chinese":"这些蜜瓜运抵全国各地，但目前应该都下架了。"},{"english":"Taobao will take the product off the shelves immediately, a manager said.","chinese":"淘宝网某经理表示将对该产品立即进行下架处理。"},{"english":"The next day, the tic-tac-toe game was pulled from stores.","chinese":"第二天，井字游戏从商店下架。"},{"english":"Instead, in an unpublicised recall, powder was withdrawn from shops.","chinese":"得到的结果却是非公开召回，奶粉在商店下架。"},{"english":"The government last week started emergency inspections to get contaminated goods off store shelves.","chinese":"政府上周开始紧急调查，将受污染产品下架。"},{"english":"The Russian authorities say any European vegetables already on sale in shops in Russia will be seized. Here's Foreign Ministry Spokesman Alexander Lukashevich.","chinese":"俄罗斯官员说，所有正在销售的欧洲蔬菜必须下架。"},{"english":"Millions of bottled drinks and tons of juice powder have already been pulled from the shelves.","chinese":"成千上万的瓶装饮料和大量的果汁粉已经被下架了。"},{"english":"Puma said it would pull the products off shelves and recall them.","chinese":"彪马方面称，他们将下架并召回问题产品。"},{"english":"Products without supporting documents will be pulled off shelves.","chinese":"没有证明文件的产品将被下架。"}],"related":[{"definition":["to shut out\/to block\/to smother"],"pinyin":["feng1 sha1"],"word":"封杀"},{"definition":["to reform\/to rectify and improve"],"pinyin":["zheng3 gai3"],"word":"整改"},{"definition":["to put goods on shelves\/(of a product) to be available for sale"],"pinyin":["shang4 jia4"],"word":"上架"},{"definition":["to return merchandise\/to withdraw a product"],"pinyin":["tui4 huo4"],"word":"退货"},{"definition":["(of a power plant, refinery etc) to shut down"],"pinyin":["guan1 ting2"],"word":"关停"},{"definition":["poor evaluation\/adverse criticism"],"pinyin":["cha4 ping2"],"word":"差评"},{"definition":["to refund\/refund"],"pinyin":["tui4 kuan3"],"word":"退款"},{"definition":["to run out of (stock)"],"pinyin":["duan4 huo4"],"word":"断货"},{"definition":["to cease trading (temporarily or permanently)\/to close down"],"pinyin":["ting2 ye4"],"word":"停业"},{"definition":["to withdraw\/to remove (from a place)\/to remove from office"],"pinyin":["che4 xia4"],"word":"撤下"},{"definition":["State Administration of Press, Publication, Radio, Film and Television (SAPPRFT), est. 2013 (abbr. for 國家新聞出版廣電總局|国家新闻出版广电总局[Guo2 jia1 Xin1 wen2 Chu1 ban3 Guang3 dian4 Zong3 ju2])\/(prior to 2013) State Administration of Radio, Film, and Television (SARFT)"],"pinyin":["Guang3 dian4 Zong3 ju2"],"word":"广电总局"},{"definition":["to delete"],"pinyin":["shan1 diao4"],"word":"删掉"},{"definition":["to go bankrupt\/to close down"],"pinyin":["dao3 bi4"],"word":"倒闭"},{"definition":["to cut the price\/to drive down the price\/to get cheaper"],"pinyin":["jiang4 jia4"],"word":"降价"},{"definition":["to order\/to enjoin\/to charge\/to instruct sb to finish sth"],"pinyin":["ze2 ling4"],"word":"责令"},{"definition":["to eject (media player)"],"pinyin":["tui4 pian4"],"word":"退片"}]}