{"definition":["not to do one's best\/not to exert oneself"],"pinyin":["bu4 li4"],"traditional":["不力"],"rank":8724.0,"normalized_rank":0.12206007863109145,"fraction":0.000010386308151226472,"cumulative_fraction":0.9178597260819188,"word":"不力","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["surname Li","power\/force\/strength\/ability\/strenuously"],"pinyin":["Li4","li4"],"word":"力"}],"containing_words":[],"sentences":[{"english":"But hopes for a breakthrough have been frustrated by poor implementation.","chinese":"然而，执行不力令突破现状的希望落空。"},{"english":"Even if the militia battles dint no, also can by ship withdraw.","chinese":"即使陆军作战不力，也可以乘船撤回来。"},{"english":"It was the result of regulatory inaction and infighting.","chinese":"此次疫情是政府监管不力和内讧的结果。"},{"english":"The second one is to correct the inefficiency and deviation of the Zhasake Banner in the league-and-banner system.","chinese":"二是为了纠正盟旗制度下旗札萨克管理的不力与偏差。"},{"english":"We should not confuse lack of implementation with lack of evidence.","chinese":"我们不应当把实施不力与缺少依据混为一谈。"},{"english":"Blame for any shortcomings has tended to land on local-government officials.","chinese":"任何对救灾不力的指责似乎都瞄准了当地官员。"},{"english":"As his staff did not perform well in their jobs, Mr. B failed in his business.","chinese":"先生的生意失败，是由于他的员工工作不力的缘故。"},{"english":"However, the Chinese Embassy did not try its best in bargaining for fear of hurting the China-Iraq relation and other considerations.","chinese":"但中国使馆以中伊关系等多种考虑而交涉不力。"},{"english":"The same indecisiveness characterised the Chia-ching reign on other fronts.","chinese":"嘉靖在位期间的决策不力还体现在其他战线。"},{"english":"The company has faced stinging criticism over its handling of the spill.","chinese":"由于对漏油事件处理不力，该公司面临严厉批评。"},{"english":"Those journalists have criticized his feeble efforts in handling the crises.","chinese":"那些记者抨击他在处理危机时措施不力。"}],"related":[{"definition":["to fail in observing or supervising\/to miss\/to let sth slip through"],"pinyin":["shi1 cha2"],"word":"失察"},{"definition":["to lose one's job\/unemployment\/not to fulfill one's obligations\/to neglect one's job\/dereliction of duty"],"pinyin":["shi1 zhi2"],"word":"失职"},{"definition":["breach of responsibility\/failure to carry out one's duty"],"pinyin":["shi1 ze2"],"word":"失责"},{"definition":["to neglect one's duty\/dereliction of duty\/malpractice"],"pinyin":["wan2 hu1 zhi2 shou3"],"word":"玩忽职守"},{"definition":["inappropriate\/improper"],"pinyin":["shi1 dang4"],"word":"失当"},{"definition":["wrongdoing\/failure to do one's duty"],"pinyin":["du2 zhi2"],"word":"渎职"},{"definition":["cannot escape censure (idiom)\/has to bear the blame"],"pinyin":["nan2 ci2 qi2 jiu4"],"word":"难辞其咎"},{"definition":["to hold accountable\/to blame\/to censure\/to apportion blame"],"pinyin":["wen4 ze2"],"word":"问责"},{"definition":["to be responsible for"],"pinyin":["fu4 you3"],"word":"负有"},{"definition":["to skimp on the job\/to work half-heartedly\/not to take the job seriously"],"pinyin":["fu1 yan3 se4 ze2"],"word":"敷衍塞责"},{"definition":["to abscond\/to be absent without leave"],"pinyin":["shan4 li2 zhi2 shou3"],"word":"擅离职守"},{"definition":["to cover up (a matter that should be reported to the authorities)"],"pinyin":["yin3 man2 bu4 bao4"],"word":"隐瞒不报"},{"definition":["to fail to pay sufficient attention to\/to be negligent in regard to\/to be lacking in"],"pinyin":["shu1 yu2"],"word":"疏于"},{"definition":["to neglect\/to overlook\/negligence\/carelessness"],"pinyin":["shu1 hu5"],"word":"疏忽"},{"definition":["to avoid (esp. responsibility)\/to shift (the blame)\/to pass the buck"],"pinyin":["tui1 xie4"],"word":"推卸"},{"definition":["at fault\/blamed for\/responsible (for a blunder or crime)"],"pinyin":["fu4 you3 ze2 ren4"],"word":"负有责任"}]}