{"definition":["to be awfully (busy etc)"],"pinyin":["bu4 ke3 kai1 jiao1"],"traditional":["不可開交"],"rank":20989.0,"normalized_rank":0.2936633414016482,"fraction":0.0000021600309446760103,"cumulative_fraction":0.9770867615002028,"word":"不可开交","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["see 可汗[ke4 han2]","can\/may\/able to\/to approve\/to permit\/to suit\/(particle used for emphasis) certainly\/very"],"pinyin":["ke4","ke3"],"word":"可"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"开"},{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"}],"containing_words":[],"sentences":[{"english":"I've been as busy as a bee all day doing my spring - cleaning.","chinese":"大扫除使得我一整天一直忙得不可开交。"},{"english":"I would have laughed in different circumstances.","chinese":"换了是别的场合，她这么说我会笑得不可开交。"},{"english":"Between the planning of the wedding and SOUTHLAND, I'm pretty busy.","chinese":"在婚礼跟《南国》之间，我有点忙得不可开交了。"},{"english":"Just when I was busiest, he must come worrying.","chinese":"我正忙得不可开交，他偏要带麻烦的事。"},{"english":"Beihai pavilion every day, from early in the morning is always so busy.","chinese":"北海亭每逢这一天，总是从一大早就忙得不可开交。"},{"english":"Domestic robots keep busy at the Korea Institute of Science and Technology.","chinese":"在韩国科技研究中心，家用机器人忙得不可开交。"},{"english":"This week meanwhile, both parties have been pre-occupied with picking their leaders.","chinese":"同时，本周两党都为安排各自领导人忙的不可开交。"},{"english":"We cannot accept new orders since we have already got our hands full.","chinese":"我们不能再接受新订单，因为已经忙得不可开交了。"},{"english":"The last week of September 2009 was very busy for Oxfam.","chinese":"2009年9月最后一个星期，乐施会忙得不可开交。"},{"english":"With the new baby , my daughter really has her hands full.","chinese":"我女儿新添婴儿后，忙得不可开交。"},{"english":"She came bustling out, wiping her hands on her apron.","chinese":"她忙的不可开交，把手放在围裙上擦了又擦。"},{"english":"I don't want to see our two neighbours engaged in a brawl.","chinese":"我不希望我们两家吵架吵得不可开交。"},{"english":"Pumping that water up to her neck.","chinese":"抽水抽得不可开交。"},{"english":"We used to fight like cats and dogs .","chinese":"我们过去常打得不可开交。"},{"english":"Tomorrow will be their wedding day. Both their families are busy today preparing for the wedding ceremony.","chinese":"他们两个明天就要拜天地了，家里人忙得不可开交。"},{"english":"The planners were busy bypassing the Gordian knot.","chinese":"计划者为回避这个棘手的问题，忙得不可开交。"}],"related":[{"definition":["lit. you die, I live (idiom); irreconcilable adversaries\/two parties cannot coexist"],"pinyin":["ni3 si3 wo3 huo2"],"word":"你死我活"},{"definition":["neither giving way to the other"],"pinyin":["hu4 bu4 xiang1 rang4"],"word":"互不相让"},{"definition":["at a stalemate\/deadlocked\/in unrelenting mutual opposition"],"pinyin":["xiang1 chi2 bu4 xia4"],"word":"相持不下"},{"definition":["lit. with swords drawn and bows bent (idiom); fig. a state of mutual hostility\/at daggers drawn"],"pinyin":["jian4 ba2 nu3 zhang1"],"word":"剑拔弩张"},{"definition":["to obtain by an effort\/to strive to get sth"],"pinyin":["zheng1 de2"],"word":"争得"},{"definition":["each sticks to his own view (idiom); a dialogue of the deaf"],"pinyin":["ge4 zhi2 ji3 jian4"],"word":"各执己见"},{"definition":["lit. badly burned about the head (from trying to put out a fire) (idiom)\/fig. hard-pressed\/under pressure (from a heavy workload, creditors etc)"],"pinyin":["jiao1 tou2 lan4 e2"],"word":"焦头烂额"},{"definition":["(used with negative) to conclude\/(impossible) to end\/(can't) finish"],"pinyin":["kai1 jiao1"],"word":"开交"},{"definition":["lit. chickens flying and dogs jumping (idiom)\/fig. in chaos\/in disarray"],"pinyin":["ji1 fei1 gou3 tiao4"],"word":"鸡飞狗跳"},{"definition":["each sticks to his own version (idiom); a dialogue of the deaf"],"pinyin":["ge4 zhi2 yi1 ci2"],"word":"各执一词"},{"definition":["war of words"],"pinyin":["kou3 shui3 zhan4"],"word":"口水战"},{"definition":["bubbling and gurgling\/hubbubing\/abuzz"],"pinyin":["fei4 fei4 yang2 yang2"],"word":"沸沸扬扬"},{"definition":["lit. wind and rain sweeping through the town (idiom)\/fig. a big scandal\/an uproar\/the talk of the town"],"pinyin":["man3 cheng2 feng1 yu3"],"word":"满城风雨"},{"definition":["dispute\/spat\/shouting match"],"pinyin":["kou3 shui3 zhang4"],"word":"口水仗"},{"definition":["lit. isn't that a joy? (quote from Confucius)\/fig. (jocularly) extremely\/awfully"],"pinyin":["bu4 yi4 le4 hu1"],"word":"不亦乐乎"},{"definition":["to become enemies (idiom); to fall out with sb"],"pinyin":["fan3 mu4 cheng2 chou2"],"word":"反目成仇"}]}