{"definition":["to confess without being pressed\/to make a confession without duress"],"pinyin":["bu4 da3 zi4 zhao1"],"traditional":["不打自招"],"rank":52326.0,"normalized_rank":0.7321086284331146,"fraction":1.1196483980310196e-7,"cumulative_fraction":0.9992561854541128,"word":"不打自招","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to beat\/to strike\/to hit\/to break\/to type\/to mix up\/to build\/to fight\/to fetch\/to make\/to tie up\/to issue\/to shoot\/to calculate\/to play (a game)\/since\/from","dozen (loanword)"],"pinyin":["da3","da2"],"word":"打"},{"definition":["self\/oneself\/from\/since\/naturally\/surely"],"pinyin":["zi4"],"word":"自"},{"definition":["to recruit\/to provoke\/to beckon\/to incur\/to infect\/contagious\/a move (chess)\/a maneuver\/device\/trick\/to confess"],"pinyin":["zhao1"],"word":"招"}],"containing_words":[],"sentences":[],"related":[{"definition":["lit. 300 silver taels not hidden here (idiom); fig. to reveal what one intends to hide"],"pinyin":["ci3 di4 wu2 yin2 san1 bai3 liang3"],"word":"此地无银三百两"},{"definition":["to feel guilty as a thief (idiom); to have sth on one's conscience"],"pinyin":["zuo4 zei2 xin1 xu1"],"word":"做贼心虚"},{"definition":["trying to hide it makes it more conspicuous (idiom); A cover up only makes matters worse."],"pinyin":["yu4 gai4 mi2 zhang1"],"word":"欲盖弥彰"},{"definition":["to have secret motives\/to have a guilty conscience"],"pinyin":["xin1 li5 you3 gui3"],"word":"心里有鬼"},{"definition":["lit. a thief crying \"Stop the thief!\" (idiom)\/fig. to accuse sb of a theft and try to sneak away oneself\/to cover up one's misdeeds by shifting the blame onto others"],"pinyin":["zei2 han3 zhuo1 zei2"],"word":"贼喊捉贼"},{"definition":["to move a stone and stub one's toe\/to shoot oneself in the foot (idiom)"],"pinyin":["ban1 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬石头砸自己的脚"},{"definition":["lacking in confidence\/diffident\/to have a guilty conscience"],"pinyin":["xin1 xu1"],"word":"心虚"},{"definition":["to confess"],"pinyin":["zhao1 ren4"],"word":"招认"},{"definition":["lit. to strike with a muckrake (idiom), cf Pigsy 豬八戒|猪八戒 in Journey to the West 西遊記|西游记; fig. to counterattack\/to make bogus accusations (against one's victim)"],"pinyin":["dao4 da3 yi1 pa2"],"word":"倒打一耙"},{"definition":["slip of the tongue\/indiscretion\/to blurt out a secret"],"pinyin":["shi1 kou3"],"word":"失口"},{"definition":["lit. the more you touch things up, the darker they get\/fig. to only make matters worse"],"pinyin":["yue4 miao2 yue4 hei1"],"word":"越描越黑"},{"definition":["to crush one's own foot while trying to maneuver a rock (to a cliff edge, to drop on one's enemy) (idiom)\/hoisted by one's own petard"],"pinyin":["ban1 qi3 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬起石头砸自己的脚"},{"definition":["If you want to condemn sb, don't worry about the pretext (idiom, from Zuozhuan 左傳|左传); one can always trump up a charge against sb\/Give a dog a bad name, then hang him."],"pinyin":["yu4 jia1 zhi1 zui4 , he2 huan4 wu2 ci2"],"word":"欲加之罪，何患无辞"},{"definition":["to lie through one's teeth (idiom)\/to talk drivel"],"pinyin":["zheng1 yan3 shuo1 xia1 hua4"],"word":"睁眼说瞎话"},{"definition":["to tell a lie"],"pinyin":["che3 huang3"],"word":"扯谎"},{"definition":["to blurt out\/to let slip"],"pinyin":["shuo1 lou4 zui3"],"word":"说漏嘴"}]}