{"definition":["not to accept sth\/to want to have sth overruled or changed\/to refuse to obey or comply\/to refuse to accept as final\/to remain unconvinced by\/not to give in to"],"pinyin":["bu4 fu2"],"traditional":["不服"],"rank":8346.0,"normalized_rank":0.11677136820897402,"fraction":0.000011160865439355887,"cumulative_fraction":0.9137914319515928,"word":"不服","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["classifier for medicine: dose\/Taiwan pr. [fu2]","clothes\/dress\/garment\/to serve (in the military, a prison sentence etc)\/to obey\/to be convinced (by an argument)\/to convince\/to admire\/to acclimatize\/to take (medicine)\/mourning clothes\/to wear mourning clothes"],"pinyin":["fu4","fu2"],"word":"服"}],"containing_words":[{"definition":["not acclimatized"],"pinyin":["shui3 tu3 bu4 fu2"],"word":"水土不服"},{"definition":["(of a stranger) not accustomed to the climate of a new place\/not acclimatized"],"pinyin":["bu4 fu2 shui3 tu3"],"word":"不服水土"},{"definition":["to deny a crime\/to plead not guilty"],"pinyin":["bu4 fu2 zui4"],"word":"不服罪"},{"definition":["not be accustomed to eating sth\/not be used to certain food"],"pinyin":["chi1 bu5 fu2"],"word":"吃不服"},{"definition":["coercion will never convince (idiom)"],"pinyin":["ya1 er2 bu4 fu2"],"word":"压而不服"}],"sentences":[{"english":"A transferee who is dissatisfied with such an order may apply for review not more than once.","chinese":"受让人对裁定不服的，可以申请复议一次。"},{"english":"At that time, England was in a Bible war between two English translations.","chinese":"当时，英国有两版英译《圣经》，互相不服气。"},{"english":"Rabbit and refuses to obey, and race results ranked in the dragon's front.","chinese":"兔子又不服，和龙赛跑，结果排在了龙的前面。"},{"english":"The plaintiff battled the decision all the way to the Supreme Court.","chinese":"原告不服这项判决，上诉直到最高法院。"},{"english":"My dear boy, I have no idea. This is, as they say, your party.","chinese":"“那你认为我们是在哪儿呢？”哈利有点不服气地说。"},{"english":"After the first instance verdict, Lin appealed to the Nanjing intermediate court.","chinese":"一审判决后，林某不服上诉至南京市中级法院。"},{"english":"Despite his insubordination, Dofine remained in command of the blockade's forces.","chinese":"虽然不服管，但多法因依然指挥着封锁部队。"},{"english":"Mr. Bruce pleaded not guilty on his client’s behalf, and Mr. Jiang spoke only two words. Did he understand the charges?","chinese":"布鲁斯律师表示不服，而江先生只说了两个字。"},{"english":"The country not agreeing with her, she returned to England.","chinese":"她杂阿谁国度不服水土，所以回到了英国。"},{"english":"Dezun Company refused to accept and appealed to Sichuan Higher People's Court.","chinese":"德润公司不服，向四川省高级人民法院提起上诉。"},{"english":"The control group refused to use Chinese medicine, and use Oxytocin and Antibiotics to treat.","chinese":"对照组不服中药，加用宫缩素及抗菌素治疗。"},{"english":"Come on, it's because I just arrived and haven't acclimated yet.","chinese":"哪儿能啊，我只是刚来有点儿水土不服罢了。"},{"english":"Neither of them could convince the other.","chinese":"他们俩谁也说不服谁。"},{"english":"If you do not accept the decition of reexamination. you can take further step of suit.","chinese":"只有对复议决定不服的才可以起诉。"},{"english":"For whatever reason, something about the Australian Open seems to disagree with Venus.","chinese":"不知为何，大威对澳网似乎变现得有些“水土不服”。"},{"english":"Huixin company subsequently appealed against the verdict.","chinese":"随后慧信公司不服，提出上诉。"}],"related":[{"definition":["to be convinced\/to accept"],"pinyin":["fu2 qi4"],"word":"服气"},{"definition":["ruling\/adjudication"],"pinyin":["cai2 jue2"],"word":"裁决"},{"definition":["to accept wholeheartedly\/to embrace\/to be won over"],"pinyin":["xin1 fu2 kou3 fu2"],"word":"心服口服"},{"definition":["judgment (by a court of law)\/to pass judgment on\/to sentence"],"pinyin":["pan4 jue2"],"word":"判决"},{"definition":["unsatisfied\/unconvinced\/indignant"],"pinyin":["bu4 fen4"],"word":"不忿"},{"definition":["to admit defeat\/to give in\/to acknowledge a mistake\/to apologize\/to be amenable to persuasion"],"pinyin":["fu2 ruan3"],"word":"服软"},{"definition":["innocent\/guileless\/not guilty (of crime)"],"pinyin":["wu2 zui4"],"word":"无罪"},{"definition":["resentful\/discontented\/dissatisfied"],"pinyin":["bu4 man3"],"word":"不满"},{"definition":["to have nothing to say (idiom)"],"pinyin":["wu2 hua4 ke3 shuo1"],"word":"无话可说"},{"definition":["to speak conceited nonsense\/to come out with arrogant claptrap"],"pinyin":["kou3 chu1 kuang2 yan2"],"word":"口出狂言"},{"definition":["to bare one shoulder\/(fig.) to side with\/to discriminate in favor of"],"pinyin":["pian1 tan3"],"word":"偏袒"},{"definition":["firm\/unyielding\/strong-willed"],"pinyin":["ying4 qi4"],"word":"硬气"},{"definition":["to signal the musicians (in Chinese opera, by prolonging a spoken word before attacking a song)\/(coll.) to challenge"],"pinyin":["jiao4 ban3"],"word":"叫板"},{"definition":["cannot bear to see\/to hate\/to dislike\/to disapprove"],"pinyin":["kan4 bu5 guan4"],"word":"看不惯"},{"definition":["to act shamelessly\/to refuse to acknowledge that one has lost the game, or made a promise etc\/to act dumb\/to act as if sth never happened"],"pinyin":["shua3 lai4"],"word":"耍赖"},{"definition":["reasonable\/justified\/right\/(math.) rational"],"pinyin":["you3 li3"],"word":"有理"}]}