{"definition":["to agree without prior consultation\/to happen to hold the same view"],"pinyin":["bu4 mou2 er2 he2"],"traditional":["不謀而合"],"rank":18434.0,"normalized_rank":0.2579155765114099,"fraction":0.0000028116750709876757,"cumulative_fraction":0.9707699585096924,"word":"不谋而合","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to plan\/to seek\/scheme"],"pinyin":["mou2"],"word":"谋"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]","variant of 合[he2]"],"pinyin":["ge3","he2","he2"],"word":"合"}],"containing_words":[],"sentences":[{"english":"Lincoln's words paraphrase the thoughts Azariah expressed to King Asa of Judah.","chinese":"林肯的话，与亚撒利雅对犹大王亚撒说的话不谋而合。"},{"english":"The precise health wallop you suffer may have to do with how your body manifests stress.","chinese":"你遭受的健康冲击可能与身体所表现出来的不谋而合。"},{"english":"It also happened to coincide with a screening organized by the U.N. press corps.","chinese":"而且它又与联合国记者团组织的审查不谋而合。"},{"english":"The proposal happened to coincide with the strategy of Jinan district government.","chinese":"金建琳的这份建议与晋安区政府的设想不谋而合。"},{"english":"Your name is the same with oen of my best friends in chian .","chinese":"你的名字和我在中国的一个好朋友的名字不谋而合。"},{"english":"This is the traditional medicine of \"prevent disease\" thinking in line.","chinese":"这与祖国医学的“治未病”思想不谋而合。"}],"related":[{"definition":["to run in the opposite direction (idiom); to run counter to"],"pinyin":["bei4 dao4 er2 chi2"],"word":"背道而驰"},{"definition":["agreement\/to agree\/to get on with\/congenial\/agreeing with\/to ally oneself with sb"],"pinyin":["qi4 he2"],"word":"契合"},{"definition":["lit. to be together from the first beat (idiom)\/to hit it off\/to click together\/to chime in easily"],"pinyin":["yi1 pai1 ji2 he2"],"word":"一拍即合"},{"definition":["traceable to the same stock (idiom); of a common origin (of trends, ideas etc)"],"pinyin":["yi1 mai4 xiang1 cheng2"],"word":"一脉相承"},{"definition":["to be precisely the same\/to be no different"],"pinyin":["ru2 chu1 yi1 zhe2"],"word":"如出一辙"},{"definition":["to be a good fit\/to be identical with\/to adjust oneself to\/to fit in"],"pinyin":["wen3 he2"],"word":"吻合"},{"definition":["as different as can be (idiom)\/poles apart"],"pinyin":["da4 xiang1 jing4 ting2"],"word":"大相径庭"},{"definition":["to seal\/to confirm\/to corroborate\/to verify"],"pinyin":["yin4 zheng4"],"word":"印证"},{"definition":["to fit in with\/to suit\/appropriate"],"pinyin":["qie4 he2"],"word":"切合"},{"definition":["different tunes played with equal skill (idiom)\/different methods leading to the same result\/different approach but equally satisfactory outcome"],"pinyin":["yi4 qu3 tong2 gong1"],"word":"异曲同工"},{"definition":["idea\/concept\/philosophy\/theory"],"pinyin":["li3 nian4"],"word":"理念"},{"definition":["(emphasizes that sth is precisely or exactly as stated)\/precisely\/exactly\/even\/if\/just like\/in the same way as"],"pinyin":["zheng4 shi4"],"word":"正是"},{"definition":["consistent\/constant\/from start to finish\/all along\/persistent"],"pinyin":["yi1 guan4"],"word":"一贯"},{"definition":["curious coincidence"],"pinyin":["wu2 qiao3 bu4 cheng2 shu1"],"word":"无巧不成书"},{"definition":["to take orders\/to receive commands\/to carry on (a tradition)"],"pinyin":["bing3 cheng2"],"word":"秉承"},{"definition":["to approve of\/to endorse\/to acknowledge\/to recognize\/to identify oneself with"],"pinyin":["ren4 tong2"],"word":"认同"}]}