{"definition":["rather than...\/與其|与其[yu3 qi2] A 不如[bu4 ru2] B (rather than A, better to B)"],"pinyin":["yu3 qi2"],"traditional":["與其"],"rank":3933.0,"normalized_rank":0.055027772725364826,"fraction":0.000033932791319309856,"cumulative_fraction":0.8283994503397556,"word":"与其","characters":[{"definition":["to take part in","and\/to give\/together with","variant of 歟|欤[yu2]"],"pinyin":["yu4","yu3","yu2"],"word":"与"},{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"}],"containing_words":[],"sentences":[{"english":"This strain of popular discourse and feeling in China is more patriotic than nationalistic.","chinese":"这种感觉与其说是民族主义不如说是爱国心。"},{"english":"Instead, check out the company' s reputation through the industry grapevine.","chinese":"与其这样做，不如通过行业内线来了解该公司的声誉。"},{"english":"They also rue the inwardness of Japanese firms that resist co-operating with others.","chinese":"它们同样规范日本内部的公司来抵制与其公司的合作。"},{"english":"What is the International Environmental Treaty-making System and What are its Objectives?","chinese":"国际环境条约的制定系统与其目的为何？"},{"english":"The amount of solar energy hitting its high-latitude location is now roughly the same as it was when it shut down.","chinese":"如今到达高纬度地区的太阳能与其关闭时的大致相当。"},{"english":"Hypocrisy is also at play in how Bernanke and his Chinese counterparts are embroiled in a race to the bottom.","chinese":"伯南克与其中国对手的竞次之争不也是一种虚伪么。"},{"english":"Instead of looking at leaves as something to rake, think of them as potential fun.","chinese":"与其把树叶扫走扔掉，不如找找它潜在的乐趣。"},{"english":"Treat it gently by allowing your equity to grow steadily rather than in bursts.","chinese":"与其暴赢，不如缓进，稳扎稳打地积累资产。"},{"english":"Use element definitions with the same target namespace as their complex type definition.","chinese":"元素定义与其复杂类型定义使用同一个目标命名空间。"},{"english":"So Madan and colleagues gave cellphones to 70 students in an undergraduate dormitory.","chinese":"因此马丹与其同事给学校里70名学生发了手机。"},{"english":"Autopolyploids are genetically isolated from their parental diploids .","chinese":"同源多倍体与其亲本二倍体在遗传上相隔离。"},{"english":"Firstly, I have searched history of development of comics and their basic information.","chinese":"首先，我先找了许多有关漫画的发展史与其基本资料。"},{"english":"Are any of these lesions associated with his diabetes insipidus?","chinese":"这些病损是否与其尿崩症有关？"},{"english":"At last, it point out the correlation between the Kripke\"semantics and his reference theory.\"","chinese":"最后指出了克里普克语义学与其指称理论的关联。"},{"english":"The antibacterial ability of chitosan to E. coli was related to the protonation of amino group.","chinese":"壳聚糖对大肠杆菌的抑菌作用与其氨基的质子化有关。"},{"english":"No respectable citizen in town had anything to do with Mad Henry","chinese":"市镇里没有哪个正派人与其有任何来往。"}],"related":[{"definition":["not equal to\/not as good as\/inferior to\/it would be better to"],"pinyin":["bu4 ru2"],"word":"不如"},{"definition":["to take part in","and\/to give\/together with","variant of 歟|欤[yu2]"],"pinyin":["yu4","yu3","yu2"],"word":"与"},{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["on the one hand"],"pinyin":["yi1 fang1 mian4"],"word":"一方面"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["on the other hand\/another aspect"],"pinyin":["ling4 yi1 fang1 mian4"],"word":"另一方面"},{"definition":["both sides"],"pinyin":["liang3 zhe3"],"word":"两者"},{"definition":["heel\/to follow closely\/to go with\/(of a woman) to marry sb\/with\/compared with\/to\/towards\/and (joining two nouns)"],"pinyin":["gen1"],"word":"跟"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["the former"],"pinyin":["qian2 zhe3"],"word":"前者"},{"definition":["both\/both of them\/neither"],"pinyin":["er4 zhe3"],"word":"二者"},{"definition":["in short\/in a word\/in brief"],"pinyin":["zong3 er2 yan2 zhi1"],"word":"总而言之"},{"definition":["itself\/oneself\/one's own"],"pinyin":["zi4 shen1"],"word":"自身"},{"definition":["rather"],"pinyin":["er2 shi4"],"word":"而是"},{"definition":["the latter"],"pinyin":["hou4 zhe3"],"word":"后者"}]}