{"definition":["abreast of modern developments\/to keep up with the times\/progressive\/timely"],"pinyin":["yu3 shi2 ju4 jin4"],"traditional":["與時俱進"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"与时俱进","characters":[{"definition":["to take part in","and\/to give\/together with","variant of 歟|欤[yu2]"],"pinyin":["yu4","yu3","yu2"],"word":"与"},{"definition":["surname Shi","old variant of 時|时[shi2]","o'clock\/time\/when\/hour\/season\/period"],"pinyin":["Shi2","shi2","shi2"],"word":"时"},{"definition":["entirely\/without exception\/(literary) to be together\/to be alike"],"pinyin":["ju4"],"word":"俱"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"进"}],"containing_words":[],"sentences":[{"english":"Keeping up with the times is the most prominent hallmark of the new period.","chinese":"新时期最突出的标志是与时俱进。"},{"english":"Every year, the show will release the new season and the stories keep pace with the time.","chinese":"每年，该节目会播出新季，故事也会与时俱进。"},{"english":"The Western broadcasters contend they have simply moved with the times.","chinese":"但西方广播界争辨说他们只是“与时俱进”而已。"},{"english":"The company advocates the philosophy of \"people-oriented, moving forward with times, innovation and development\".","chinese":"公司崇尚“以人为本”，与时俱进，开拓创新。"},{"english":"Construction Project Budgeting and Final Accounting Specialty should undergo reforms.","chinese":"基建工程预决算专业的教学改革应与时俱进。"},{"english":"The views of the Three Generation Leading Group share the same root and keep pace with times.","chinese":"三代中央领导集体的发展观既一脉相承，又与时俱进。"},{"english":"Dinggu Enterprise is ready to keep pace with the times, and create a wonderful future together with people of aall circles.","chinese":"顶固企业愿与社会各界人士与时俱进，共创美好将来。"},{"english":"They just couldn't keep it up, Anne.","chinese":"她们不能让它保持与时俱进，安妮。"},{"english":"The people who advance with times is advisability.","chinese":"与时俱进的人才是明智的人。"},{"english":"It really was just,  even as a physical object, all bound up with the politics of its moment.","chinese":"这样看来，她的想法在当时的确与时俱进。"},{"english":"In demand of being a party affairs worker, we need to update our idea and keep up with the times.","chinese":"更新观念，与时俱进，是时代赋予党务工作者的要求。"},{"english":"This kind of system requires keeping up with the times.","chinese":"这种体系需要保持与时俱进。"},{"english":"Attention should be given to hearing courses, with the hearing without textbooks is infeasible.","chinese":"要重视听力课程，没有与时俱进的听力课本是不行的。"},{"english":"Faced with the new situation, Party building among university students must keep pace with the times.","chinese":"面对新形势，高校学生党建工作必须与时俱进。"},{"english":"It is required to keep pace with the time and improve fire fighting.","chinese":"与时俱进做好消防工作是新时期的新要求。"},{"english":"Professor Wang Ning believes that the standard of Chinese characters should be updated with time.","chinese":"王宁教授相信，中国汉字标准应该与时俱进。"}],"related":[{"definition":["to push out the old and bring in the new (idiom); to innovate"],"pinyin":["tui1 chen2 chu1 xin1"],"word":"推陈出新"},{"definition":["daily renewal, monthly change (idiom)\/every day sees new developments\/rapid progress"],"pinyin":["ri4 xin1 yue4 yi4"],"word":"日新月异"},{"definition":["to discard the old and introduce the new (idiom); to innovate"],"pinyin":["ge2 gu4 ding3 xin1"],"word":"革故鼎新"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"创新"},{"definition":["creativity"],"pinyin":["chuang4 xin1 jing1 shen2"],"word":"创新精神"},{"definition":["stuck in the old ways (idiom); refusing to acknowledge new ideas\/stagnating and conservative"],"pinyin":["gu4 bu4 zi4 feng1"],"word":"故步自封"},{"definition":["(idiom) to continue in the same old rut\/diehard conservative attitudes"],"pinyin":["yin1 xun2 shou3 jiu4"],"word":"因循守旧"},{"definition":["hidebound by convention (idiom)"],"pinyin":["mo4 shou3 cheng2 gui1"],"word":"墨守成规"},{"definition":["tide\/current\/trend"],"pinyin":["chao2 liu2"],"word":"潮流"},{"definition":["new age"],"pinyin":["xin1 shi2 dai4"],"word":"新时代"},{"definition":["to cherish the outmoded and preserve the outworn (idiom); conservative\/stickler for tradition"],"pinyin":["bao4 can2 shou3 que1"],"word":"抱残守缺"},{"definition":["to take the best\/to absorb the essence"],"pinyin":["qu3 qi2 jing1 hua2"],"word":"取其精华"},{"definition":["to dare to be first\/to pioneer (idiom)"],"pinyin":["gan3 wei2 ren2 xian1"],"word":"敢为人先"},{"definition":["to transform\/to change"],"pinyin":["bian4 ge2"],"word":"变革"},{"definition":["to develop\/to make full use of"],"pinyin":["fa1 yang2"],"word":"发扬"},{"definition":["age\/era\/epoch\/period (in one's life)\/CL:個|个[ge4]","Time, US weekly news magazine"],"pinyin":["shi2 dai4","Shi2 dai4"],"word":"时代"}]}