{"definition":["special duty\/assigned full time to a task"],"pinyin":["zhuan1 zhi2"],"traditional":["專職"],"rank":8546.0,"normalized_rank":0.11956962769157585,"fraction":0.000010738698142471178,"cumulative_fraction":0.9159800602053264,"word":"专职","characters":[{"definition":["for a particular person, occasion, purpose\/focused on one thing\/special\/expert\/particular (to sth)\/concentrated\/specialized","variant of 專|专[zhuan1]"],"pinyin":["zhuan1","zhuan1"],"word":"专"},{"definition":["office\/duty"],"pinyin":["zhi2"],"word":"职"}],"containing_words":[],"sentences":[{"english":"Objective To allocate a full-time toll collector in each medical unit and resolve the disputes due to medical charge.","chinese":"目的通过设立病区专职收费员，解决收费矛盾。"},{"english":"In Chinese Mythology, Laojun was in charge of alchemy.","chinese":"在中国神话里，太上老君专职修炼仙丹。"},{"english":"The OCOG may establish a functional area dealing with Transport aspects.","chinese":"组委会可以建立专职部门处理有关交通方面的事务。"},{"english":"Do you do a second job in addition to your full-time job？","chinese":"除了专职工作以外，你有没有从事第二职业？"},{"english":"Kitchens will be staffed by a base of full-time chefs together with a stream of trainee chefs on work experience.","chinese":"厨房将配备专职厨师，还有一些实习生。"},{"english":"We had a number of workstations and full-time staff to manually perform the exports.","chinese":"我们有一些工作站和专职人员来手动地执行导出。"},{"english":"But we didn't want to just make every class-specific quest give a player a new ability.","chinese":"但是我们不希望把每个专职任务的回报都是一个能力。"},{"english":"I have been a full-timer for two years.","chinese":"我成为党的专职人员已经两年了。"},{"english":"Ideally, a dedicated, impartial staff member should address these complaints.","chinese":"最好能设置一位公正的专职人员来处理这些投诉。"},{"english":"From the U. S. Preventive Services Task Force, Rockville, Maryland.","chinese":"来自美国预防服务专职小组，罗克韦尔市，马里兰州。"},{"english":"Next week, I get a chauffeur-driven car to impress the clients.","chinese":"下周，我会有专职司机驾驶的汽车以打动客户。"},{"english":"The Butler will then one by one deliver the laundered items to the Guest Room.","chinese":"专职管家要一样样的把洗好的衣物送返客房。"},{"english":"After Changzhou fire prevention crew west end fire prevention specialty team answers alarm, rushes to the scene rapidly.","chinese":"常州市消防支队城西消防专职队接警后迅速赶到现场。"},{"english":"Apparently neither can the professional politicos and political observers.","chinese":"专职政治人物和政治观察人士显然也离不开民调。"},{"english":"The highest and the autumn people will become a full-time cartoonist, started the comic strip?","chinese":"最高和秋人能成为专职漫画家，开始连载漫画吗？"},{"english":"Working with an Internet-savvy career company can help.","chinese":"和一家互联网专职公司合作对此很有帮助。"}],"related":[{"definition":["to hold concurrent posts\/concurrent job\/moonlighting"],"pinyin":["jian1 zhi2"],"word":"兼职"},{"definition":["person\/employee\/member"],"pinyin":["yuan2"],"word":"员"},{"definition":["full-time job"],"pinyin":["quan2 zhi2"],"word":"全职"},{"definition":["to engage\/to hire (a lawyer etc)"],"pinyin":["pin4 qing3"],"word":"聘请"},{"definition":["to dispatch (sb) in an official capacity\/to be posted (as an ambassador, foreign correspondent etc)"],"pinyin":["pai4 zhu4"],"word":"派驻"},{"definition":["to hold several jobs at once\/concurrent post\/working part-time"],"pinyin":["jian1 ren4"],"word":"兼任"},{"definition":["main job\/day job\/steady full-time job (as opposed to temporary or casual)\/chief or principal post (as opposed to deputy)"],"pinyin":["zheng4 zhi2"],"word":"正职"},{"definition":["to assign\/to appoint\/assignment"],"pinyin":["zhi3 pai4"],"word":"指派"},{"definition":["to be in charge of\/to take responsibility for\/to be to blame\/conscientious"],"pinyin":["fu4 ze2"],"word":"负责"},{"definition":["to hold a governmental office or post\/to assume office of\/to take charge of\/to serve as"],"pinyin":["dan1 ren4"],"word":"担任"},{"definition":["specialist\/specialized staff"],"pinyin":["zhuan1 men2 ren2 yuan2"],"word":"专门人员"},{"definition":["function\/role"],"pinyin":["zhi2 neng2"],"word":"职能"},{"definition":["to direct\/to oversee"],"pinyin":["du1 dao3"],"word":"督导"},{"definition":["to work solely on\/to have as one's (or its) sole function\/person or agency responsible for one specific thing"],"pinyin":["zhuan1 si1"],"word":"专司"},{"definition":["resident\/permanent (representative)"],"pinyin":["chang2 zhu4"],"word":"常驻"},{"definition":["to organize\/to set up\/to establish"],"pinyin":["zu3 jian4"],"word":"组建"}]}