{"definition":["special\/dedicated"],"pinyin":["zhuan1 xiang4"],"traditional":["專項"],"rank":1943.0,"normalized_rank":0.027185090873476696,"fraction":0.00007985238949076041,"cumulative_fraction":0.7260204518307594,"word":"专项","characters":[{"definition":["for a particular person, occasion, purpose\/focused on one thing\/special\/expert\/particular (to sth)\/concentrated\/specialized","variant of 專|专[zhuan1]"],"pinyin":["zhuan1","zhuan1"],"word":"专"},{"definition":["back of neck\/item\/thing\/term (in a mathematical formula)\/sum (of money)\/classifier for principles, items, clauses, tasks, research projects etc","surname Xiang"],"pinyin":["xiang4","Xiang4"],"word":"项"}],"containing_words":[],"sentences":[{"english":"With special renovation, Beijing will again take on the scene it once had, complete with its historical rivers and classical gardens.","chinese":"通过专项整治，再现京城水系和古典园林的历史风貌。"},{"english":"The projects, commonly known as earmarks, cost billions of dollars.","chinese":"这些俗称专项拨款的项目会耗费数十亿美元。"},{"english":"They've appealed to the government for money from a special fund to help in the clear-up .","chinese":"他们已经向政府申请了专项资金推动清理工作。"},{"english":"The transport sector will Silverstrand Fu Xian Xianyang paragraph to carry out special maintenance training.","chinese":"交通部门将对福银线西安至咸阳段进行专项维修整治。"},{"english":"Fifth, we will launch an extensive campaign to solve production safety problems.","chinese":"第五，深入开展安全生产专项整治。"},{"english":"Second Xiangya Hospital AIDS Research allowed to participate in the above-mentioned two specific research.","chinese":"湘雅二医院艾滋病研究室获准参加上述两项专项研究。"},{"english":"A special fund will be launched by the central government to pay these teachers.","chinese":"中央财政将设专项资金，用于特岗教师的工资性支出。"},{"english":"So they have to conquer the discomfort caused by many-ball training.","chinese":"多球训练有利于增强专项身体素质。"},{"english":"We asked high school students to particpate in an anti-drug campaign.","chinese":"我们要求高中学生全程在禁毒专项斗争。"},{"english":"New investments have targeted energy generation and privatized distribution.","chinese":"新增投资将专项用于能源发电和私有化配电服务。"},{"english":"A special fund can be established to control pollution.","chinese":"可以建立一项污染控制的专项基金。"},{"english":"Study Guangzhou special funds to private education system.","chinese":"研究设立广州市民办教育专项资金制度。"},{"english":"The hospital has set up a special fund to buy new equipment.","chinese":"这家医院已经为购买新设备设立了一个专项基金。"},{"english":"The Municipal People's Government shall set up the Special Funds for Privately-run Education Development.","chinese":"市政府设立民办教育发展专项资金。"},{"english":"Special funds diverted in serious condition, too many unreasonable expenditures.","chinese":"挤占专项经费情况严重，不合理支出太多。"},{"english":"Protection of World Ends Symbol should add up the related regulation.","chinese":"《世标条例》应增设相关的专项条款。"}],"related":[{"definition":["to launch\/to develop\/to unfold\/(of an exhibition etc) to open"],"pinyin":["kai1 zhan3"],"word":"开展"},{"definition":["leading small group (LSG), a CCP body that exercises general oversight on matters relating to a specific area (LSG for foreign affairs 外事工作, LSG for comprehensively deepening reforms 全面深化改革 etc)\/aka central leading group"],"pinyin":["ling3 dao3 xiao3 zu3"],"word":"领导小组"},{"definition":["test point\/to carry out trial\/pilot scheme"],"pinyin":["shi4 dian3"],"word":"试点"},{"definition":["to try harder\/to redouble one's efforts"],"pinyin":["jia1 da4 li4 du4"],"word":"加大力度"},{"definition":["(administrative) province-level"],"pinyin":["sheng3 ji2"],"word":"省级"},{"definition":["solid progress"],"pinyin":["zha1 shi5 tui1 jin4"],"word":"扎实推进"},{"definition":["to increase (e.g. one's effort)"],"pinyin":["jia1 da4"],"word":"加大"},{"definition":["to orientate\/directional\/directed\/orienteering"],"pinyin":["ding4 xiang4"],"word":"定向"},{"definition":["main item (of program)"],"pinyin":["da4 xiang4"],"word":"大项"},{"definition":["to set up\/to establish"],"pinyin":["she4 li4"],"word":"设立"},{"definition":["to lead (an animal by the head)\/to take the lead\/to coordinate (a combined operation)\/to mediate\/a go-between (e.g. marriage broker)"],"pinyin":["qian1 tou2"],"word":"牵头"},{"definition":["to implement\/to carry out"],"pinyin":["shi2 shi1"],"word":"实施"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落实"},{"definition":["all categories"],"pinyin":["ge4 lei4"],"word":"各类"},{"definition":["department\/branch\/section\/division\/CL:個|个[ge4]"],"pinyin":["bu4 men2"],"word":"部门"},{"definition":["appropriate sum of money"],"pinyin":["bo1 fu4"],"word":"拨付"}]}