{"definition":["family influential for generations\/aristocratic family"],"pinyin":["shi4 jia1"],"traditional":["世家"],"rank":14521.0,"normalized_rank":0.20316762973430527,"fraction":0.000004386335731947338,"cumulative_fraction":0.956990491366124,"word":"世家","characters":[{"definition":["surname Shi","life\/age\/generation\/era\/world\/lifetime\/epoch\/descendant\/noble"],"pinyin":["Shi4","shi4"],"word":"世"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"}],"containing_words":[],"sentences":[{"english":"Growing up in a family of musicians, he was saturated with music at an early age.","chinese":"他在音乐世家长大，小时候就饱受音乐薰陶。"},{"english":"The Sulzberger family has had control of the “newspaper of record” ever since.","chinese":"该家族就此成了掌控报业的世家。"},{"english":"Bai Bohua, born in Beijing in 1944 to a literary family.","chinese":"白伯骅，1944年出生于北京的一个书香世家。"},{"english":"The Chi-tan great families were closely related with the families?polarization of the tribe union period.","chinese":"契丹世家大族与部落联盟时期的家族分化密切相关。"},{"english":"The formation of the Eastern Han Dynasty confucian classics family depended on the political and cultural aspects.","chinese":"东汉经学世家的形成取决于政治和文化两个方面。"},{"english":"Maison Bouey is one of the last few independent family companies in Bordeaux.","chinese":"宝邑世家是波尔多仅存的几家独立传统家族酒商之一。"},{"english":"He comes from a family of puppeteers and is the sixth generation in his family to inherit this tradition.","chinese":"他出身于木偶表演世家，是家中第六代木偶戏传人。"},{"english":"Laurie came from a skating family.","chinese":"劳利出生于滑冰世家。"},{"english":"Io was of divine ancestry. Her father was the river-god Inachus, son of Oceanus.","chinese":"伊俄出身于神祗世家，父亲是俄刻阿诺斯的儿子。"},{"english":"Born into a musical family, Micheline graduated from the Paris Conservatory of Music.","chinese":"她出身于音乐世家，获得巴黎音乐学院授予的学位。"},{"english":"Jolie comes from a family of actors.","chinese":"裘莉来自演艺世家。"},{"english":"Shen Jinli was born into a mainstream sculpture family in Xiamen, South Fujian Province.","chinese":"沈锦丽，出生在厦门的一个漆线雕工艺世家。"},{"english":"Chapter One examines the families of rank in Jiading district to clarify the ancient local tradition.","chinese":"第一章考察嘉定世家望族，阐明当地古学传统。"},{"english":"He is born for music and his name is JJ Lin.","chinese":"他出生于音乐世家，他的名字叫林俊杰。"},{"english":"Fan Han represents the eleventh generation of poets in the Literary Family of Fan in Nantong.","chinese":"范罕是南通范氏诗文世家第十一代诗人的代表。"},{"english":"\"Balenciaga\"Fashion has always been good at cutting and sewing.","chinese":"“巴黎世家”服装一向是精于裁剪和缝制。"}],"related":[{"definition":["famous family\/prestigious house"],"pinyin":["ming2 men2"],"word":"名门"},{"definition":["princely"],"pinyin":["wang2 jia1"],"word":"王家"},{"definition":["child\/the younger generation"],"pinyin":["zi3 di4"],"word":"子弟"},{"definition":["distinguished or prominent family\/influential clan (old)"],"pinyin":["wang4 zu2"],"word":"望族"},{"definition":["offspring a famous family (idiom); good breeding\/blue blood"],"pinyin":["ming2 men2 wang4 zu2"],"word":"名门望族"},{"definition":["rich and powerful family"],"pinyin":["men2 fa2"],"word":"门阀"},{"definition":["large and influential family\/clan"],"pinyin":["da4 zu2"],"word":"大族"},{"definition":["royal family\/imperial household\/member of the royal family"],"pinyin":["huang2 shi4"],"word":"皇室"},{"definition":["collateral relative (descended from a common ancestor but through different lines)"],"pinyin":["pang2 xi4"],"word":"旁系"},{"definition":["learned person\/expert in a certain field\/abbr. for 大方之家[da4 fang1 zhi1 jia1]"],"pinyin":["fang1 jia1"],"word":"方家"},{"definition":["head of a household"],"pinyin":["jia1 zhu3"],"word":"家主"},{"definition":["direct line of descent\/under one's personal command\/school or faction passing on faithfully one's doctrine"],"pinyin":["di2 xi4"],"word":"嫡系"},{"definition":["wife's parents' home"],"pinyin":["yue4 jia1"],"word":"岳家"},{"definition":["the imperial court\/the government in imperial times"],"pinyin":["huang2 chao2"],"word":"皇朝"},{"definition":["descendants of feudal aristocrats"],"pinyin":["gui4 zhou4"],"word":"贵胄"},{"definition":["the Zhou family (household, firm etc)\/Jow-Ga Kung Fu - Martial Art"],"pinyin":["zhou1 jia1"],"word":"周家"}]}