{"definition":["Han dynasty (206 BC-220 AD)\/refers to the Western Han and Eastern Han"],"pinyin":["liang3 Han4"],"traditional":["兩漢"],"rank":44279.0,"normalized_rank":0.6195206581506303,"fraction":2.561907351426909e-7,"cumulative_fraction":0.9978414978790151,"word":"两汉","characters":[{"definition":["two\/both\/some\/a few\/tael, unit of weight equal to 50 grams (modern) or 1⁄16 of a catty 斤[jin1] (old)"],"pinyin":["liang3"],"word":"两"},{"definition":["man","Han ethnic group\/Chinese (language)\/the Han dynasty (206 BC-220 AD)"],"pinyin":["han4","Han4"],"word":"汉"}],"containing_words":[],"sentences":[{"english":"Liu Xin revised The Classic of Mountains and Rivers, which contributed to the wide spreading in Han Dynasty.","chinese":"刘歆的校订对于扩大《山海经》在两汉传播亦有贡献。"},{"english":"The second cycle began with criticism and reconsideration of the Confucian Ethics.","chinese":"第二个周期从批判和反思两汉“名教”开始。"},{"english":"The custom of elaborate funeral was popular during the Han Dynasty due to people's belief in the existence of gods and ghosts and filial piety.","chinese":"对鬼神的迷信和孝观念的盛行使两汉兴起了厚葬之风。"},{"english":"During the Han Dynasty, the stone tablet sum which was habitually called the sum of seal script was mostly written with the seal script.","chinese":"两汉时期的碑额多用篆书书写，习惯性的被称为篆额。"},{"english":"Shi, according to records, the Xia and Shang Dynasties period began Wuqiang officially formed in the Han Dynasty.","chinese":"据史志记载，武强始于夏商时期，正式建制于两汉。"},{"english":"Zhou, Qin and Han Dynasties was the important period for the formation and development of the belief.","chinese":"周秦两汉是神仙信仰形成与发展的重要时期。"},{"english":"For the text of the Han Chenyan, this chapter is divided into four sections.","chinese":"对于两汉谶言的文本分析，本章分为四个小节。"},{"english":"Rite plays an important role in the literary conception of Pre-Qin period and Han dynasties.","chinese":"先秦两汉文学观念背后，礼起着支配作用。"},{"english":"Han Dynasty, set up temporary elm County.","chinese":"两汉时期，设置临榆县。"},{"english":"This chapter from the literary point of view outside the Han Dynasty Chenyan for multiple interpretation.","chinese":"本章从文学领域之外的角度对两汉谶言进行多元解读。"},{"english":"Han Dynasty to the Northern and Southern is XiaoRouzhi migration and an important period of national change.","chinese":"两汉至南北朝是小月氏人迁徙与民族变迁的重要时期。"},{"english":"From Han Dynasty to Sui-Tang and Five Dynasties, the entertainment of Touhu has become prominent gradually.","chinese":"两汉至隋唐五代时期，此期投壶的娱乐性逐渐凸显。"},{"english":"From the pre-Qin period to the Ming dynasty, the consciousness of the numerical concept experienced great changes.","chinese":"自先秦经两汉至宋明，数字观念问题意识有较大转变。"},{"english":"Prophetic Theology is a flow of distinctive social trend of thought in the Han Dynasty.","chinese":"谶纬是两汉时期独特的社会思潮。"},{"english":"The Han Dynasty (the Eastern Han Dynasty and the Western Han Dynasty) is the first period filled with disasters in Chinese history.","chinese":"两汉时期是中国历史上的第一个灾害多发期。"},{"english":"Bamboo and wood slips and silk are the hook materials in Han Dynasty.","chinese":"两汉书籍的形态是简牍书和帛书两种。"}],"related":[{"definition":["Wei, Jin and North-South dynasties\/generic term for historic period 220-589 between Han and Sui"],"pinyin":["Wei4 Jin4 Nan2 Bei3 Chao2"],"word":"魏晋南北朝"},{"definition":["pre-Qin, Chinese history up to the foundation of the Qin imperial dynasty in 221 BC"],"pinyin":["xian1 Qin2"],"word":"先秦"},{"definition":["Eastern or later Han dynasty, 25-220"],"pinyin":["Dong1 han4"],"word":"东汉"},{"definition":["the Han dynasty (206 BC-220 AD)"],"pinyin":["Han4 dai4"],"word":"汉代"},{"definition":["Wei (220-265) and Jin (265-420) dynasties"],"pinyin":["Wei4 Jin4"],"word":"魏晋"},{"definition":["Western Han Dynasty (206 BC-8 AD), also called 前漢|前汉[Qian2 Han4], Former Han Dynasty"],"pinyin":["Xi1 Han4"],"word":"西汉"},{"definition":["Northern and Southern dynasties (420-589)"],"pinyin":["Nan2 Bei3 chao2"],"word":"南北朝"},{"definition":["the Spring and Autumn (770-476 BC) and Warring States (475-221 BC) periods"],"pinyin":["Chun1 qiu1 Zhan4 guo2"],"word":"春秋战国"},{"definition":["Sui (581-617) and Tang dynasties (618-907)"],"pinyin":["Sui2 Tang2"],"word":"隋唐"},{"definition":["Western Jin dynasty (265-316)"],"pinyin":["Xi1 Jin4"],"word":"西晋"},{"definition":["Qin dynasty (221-207 BC), founded by the first emperor Qin Shihuang 秦始皇[Qin2 Shi3 huang2], the first dynasty to rule the whole of China"],"pinyin":["Qin2 dai4"],"word":"秦代"},{"definition":["the Qin (221-207 BC) and Han (206 BC-220 AD) dynasties"],"pinyin":["Qin2 Han4"],"word":"秦汉"},{"definition":["Xia, Shang and Zhou, the earliest named Chinese dynasties"],"pinyin":["Xia4 Shang1 zhou1"],"word":"夏商周"},{"definition":["Han Dynasty (206 BC-220 AD)"],"pinyin":["Han4 chao2"],"word":"汉朝"},{"definition":["Former Han dynasty (206 BC-8 AD), also called 西漢|西汉[Xi1 Han4], Western Han dynasty"],"pinyin":["Qian2 Han4"],"word":"前汉"},{"definition":["the Song dynasty (960-1279)\/refers to the Northern (960-1127) and Southern Song (1128-1279)"],"pinyin":["Liang3 Song4"],"word":"两宋"}]}