{"definition":["two-phase (physics)","both sides"],"pinyin":["liang3 xiang4","liang3 xiang1"],"traditional":["兩相","兩相"],"rank":27494.0,"normalized_rank":0.3846767310732725,"fraction":0.0000011827107328353745,"cumulative_fraction":0.9875968010178502,"word":"两相","characters":[{"definition":["two\/both\/some\/a few\/tael, unit of weight equal to 50 grams (modern) or 1⁄16 of a catty 斤[jin1] (old)"],"pinyin":["liang3"],"word":"两"},{"definition":["each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang","appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)"],"pinyin":["xiang1","Xiang1","xiang4"],"word":"相"}],"containing_words":[{"definition":["both sides are willing\/by mutual consent"],"pinyin":["liang3 xiang1 qing2 yuan4"],"word":"两相情愿"}],"sentences":[{"english":"A novel two-phase model for the fluidized bed of polyethylene with condensed mode operation was proposed.","chinese":"建立了气相法聚乙烯冷凝模式操作反应器的两相模型。"},{"english":"The mechanical seal for light hydrocarbon pump belong to the seal for liquid and gas phases.","chinese":"轻烃泵机械密封属于汽液两相密封。"},{"english":"The scanning electronic microscope results showed that double screw blending was better than single screw blending.","chinese":"双螺杆共混挤出，扫描电镜观察两相混合效果很好。"},{"english":"The three-dimension gas-particle flow in a spiral cyclone is simulated numerically.","chinese":"对螺旋型旋风分离器进行了两相流场的三维数值模拟。"},{"english":"Two-fluid model was employed to simulate two-phase phenomena of supersonic crossflow .","chinese":"对两相超声速横向喷射试验进行了数值模拟。"},{"english":"The finite difference method was used to discretize and solve the two phase energy equations.","chinese":"采用有限差分法对两相能量方程进行离散求解。"},{"english":"City Northeast Thousand Buddha Caves, cultural and natural landscape of two-phase of its America.","chinese":"城东北有千佛洞，人文与自然景观两相其美。"},{"english":"With the theory of gas-solid two-phase flow, computer simulation of sandblasting process was discussed.","chinese":"运用气固两相流动理论对喷砂过程进行了模拟和仿真。"},{"english":"A simple phenomenological model is proposed to describe the elastic-plastic deformation of two-phase particle composites.","chinese":"提出了一种分析两相材料塑性响应的模型。"},{"english":"The size of microchannel had a great impact on two-phase friction pressure drop.","chinese":"然后对槽道内两相摩擦压降进行了实验研究和对比。"},{"english":"A novel two-phase model for the fluidize bed of polyethylene with condensed mode operation was proposed.","chinese":"建立了气相法聚乙烯冷凝模式操作反应器的两相模型。"},{"english":"Flow friction calculation is one of the basic problems of two phase flow in tubes.","chinese":"摩擦阻力计算是管内两相流动中的一个基本问题。"},{"english":"Improved models regarding dense gas-particle two-phase flow are proposed.","chinese":"提出了模拟稠密气固两相流动的改进模型。"},{"english":"The deformation feature and the mechanism of these biphase W alloys have been also discussed.","chinese":"本文还讨论了两相钨合金的形变特点和形变机制。"},{"english":"This numerical method is the solution of full coupled two-phase flow .","chinese":"这是一个两相完全耦合的数值解方法。"},{"english":"L297 is a type of dedicated chip applied in control of two phase stepping motor.","chinese":"L297是一种适用于两相步进电机控制的专用芯片。"}],"related":[{"definition":["each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang","appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)"],"pinyin":["xiang1","Xiang1","xiang4"],"word":"相"},{"definition":["compatible\/consistent\/to tolerate (each other)"],"pinyin":["xiang1 rong2"],"word":"相容"},{"definition":["to balance up\/to offset\/to counterbalance"],"pinyin":["xiang1 di3"],"word":"相抵"},{"definition":["to complement one another (idiom)"],"pinyin":["xiang1 fu3 xiang1 cheng2"],"word":"相辅相成"},{"definition":["to conform to\/to fit with\/to be compatible with"],"pinyin":["xiang1 he2"],"word":"相合"},{"definition":["how can one endure?\/to be able to endure"],"pinyin":["ke3 kan1"],"word":"可堪"},{"definition":["then\/as a result"],"pinyin":["ci3 ji4"],"word":"此际"},{"definition":["both sides (in contract)\/the two opposing sides (in a dispute)"],"pinyin":["liang3 fang1"],"word":"两方"},{"definition":["really\/truly\/indeed"],"pinyin":["zhen1 ge4"],"word":"真个"},{"definition":["(literary) like this\/such (as this)\/so much\/so many"],"pinyin":["ru2 xu3"],"word":"如许"},{"definition":["to consider\/to weigh (a matter)\/to balance (pros and cons)"],"pinyin":["quan2 heng2"],"word":"权衡"},{"definition":["thirdly\/the third"],"pinyin":["qi2 san1"],"word":"其三"},{"definition":["attack from two sides\/pincer movement\/converging attack\/attack on a flank\/fork in chess, with one piece making two attacks"],"pinyin":["jia1 gong1"],"word":"夹攻"},{"definition":["secondly\/the other (usu. of two)\/the second"],"pinyin":["qi2 er4"],"word":"其二"},{"definition":["to derive benefit"],"pinyin":["de2 yi4"],"word":"得益"},{"definition":["very close\/no gap between them\/continuously\/unbroken\/hard to separate\/indistinguishable"],"pinyin":["wu2 jian4"],"word":"无间"}]}