{"definition":["the middle stretches of a river\/middle level\/middle echelon\/midstream"],"pinyin":["zhong1 you2"],"traditional":["中游"],"rank":14550.0,"normalized_rank":0.20357337735928246,"fraction":0.0000043736356784103485,"cumulative_fraction":0.9571174701508276,"word":"中游","characters":[{"definition":["to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right","China\/Chinese\/surname Zhong"],"pinyin":["zhong4","zhong1","Zhong1"],"word":"中"},{"definition":["to swim\/variant of 遊|游[you2]","to walk\/to tour\/to roam\/to travel","surname You"],"pinyin":["you2","you2","You2"],"word":"游"}],"containing_words":[],"sentences":[{"english":"Each rive has its upward, middle and backward part.","chinese":"每条河流都有上游，中游和下游。"},{"english":"The middle stretch of the Yangtze is a natural transportation and communications nexus.","chinese":"该地区位于长江中游，是天然的运输与通讯会合点。"},{"english":"Lyon slipped to third place, three points behind PSG.","chinese":"马赛滑落至积分榜中游，7分落后第三名里尔。"},{"english":"Lingered upon the pools that stand in drains.","chinese":"在腔池中游向暗沟去干嘛。"},{"english":"Fung is the origin of the Yangtze River middle reaches, stone house culture river phoenix.","chinese":"凤的起源地是在长江中游，石家河文化的凤。"},{"english":"There are at least nine physiographic cycles in the middle reaches of the Yellow River during the Late Cenozoic Era.","chinese":"在晚新生代黄河中游至少存在九个地文期旋回。"},{"english":"The migration of this period has some characteristics, which infected the social development of the region.","chinese":"这个时期的移民影响了沅水中游地区的社会发展。"},{"english":"A sea of tourists walks passed the Shaolin Temple in Henan Province.","chinese":"河南少林寺中游人如潮。"},{"english":"The fish would swim in the seas and birds of every color and size would fly in the sky.","chinese":"于是有鱼在水中游，各样的鸟儿在空中飞。"},{"english":"The influence in the upper reaches is larger than the lower stream.","chinese":"而且，上中游河段受影响大于下游。"},{"english":"Midstream means the transportation of new oil by ship routes and pipelines.","chinese":"中游是指通过船运和管道运输新开采的石油。"},{"english":"Bo Shi Wa swam very fast in that match.","chinese":"博士蛙在那次比赛中游得非常快。"},{"english":"The one man grabbed the life-line, jumped into the sea and swam towards the unfortunate man.","chinese":"有一个人抢过救生索，跳到海中游向这位不幸的人。"},{"english":"The restoration of the ecosystem in the mid-North Canal will be initiated this year.","chinese":"今年还将启动北运河水系中游段的生态修复项目。"},{"english":"By fairy pillow dream to the middle.","chinese":"拟凭仙枕梦中游。"},{"english":"Similar small animal pottery sculptures have also been found among relics along the Yellow River.","chinese":"在黄河中游早期的遗址中也有类似的动物陶塑发现。"}],"related":[{"definition":["lower reaches (of a river)\/lower level\/lower echelon\/downstream"],"pinyin":["xia4 you2"],"word":"下游"},{"definition":["upper reaches (of a river)\/upper level\/upper echelon\/upstream"],"pinyin":["shang4 you2"],"word":"上游"},{"definition":["western part"],"pinyin":["xi1 bu4"],"word":"西部"},{"definition":["main stream (of a river)"],"pinyin":["gan4 liu2"],"word":"干流"},{"definition":["the east\/eastern part"],"pinyin":["dong1 bu4"],"word":"东部"},{"definition":["tributary (river)"],"pinyin":["zhi1 liu2"],"word":"支流"},{"definition":["really\/after all\/details\/particulars"],"pinyin":["duan1 di4"],"word":"端的"},{"definition":["the very front"],"pinyin":["qian2 lie4"],"word":"前列"},{"definition":["to rank (1st, 2nd etc)\/ranking"],"pinyin":["pai2 ming2"],"word":"排名"},{"definition":["to go forward together (idiom); to undertake simultaneous tasks\/going hand in hand"],"pinyin":["qi2 tou2 bing4 jin4"],"word":"齐头并进"},{"definition":["river basin\/valley\/drainage area"],"pinyin":["liu2 yu4"],"word":"流域"},{"definition":["Nananqu district of central Chongqing municipality, formerly in Sichuan"],"pinyin":["Nan2 an4"],"word":"南岸"},{"definition":["middle section\/middle period\/middle area\/mid-"],"pinyin":["zhong1 duan4"],"word":"中段"},{"definition":["faucet\/water tap\/bicycle handle bar\/chief (esp. of gang)\/boss\/decision maker\/(market) leader (of companies)\/front end of mud-flow\/figurehead on prow of dragon boat 龍船|龙船"],"pinyin":["long2 tou2"],"word":"龙头"},{"definition":["riverbed"],"pinyin":["he2 chuang2"],"word":"河床"},{"definition":["level (of achievement etc)\/standard\/level (surveying)"],"pinyin":["shui3 zhun3"],"word":"水准"}]}