{"definition":["center\/backbone\/hub (e.g. of transport network)\/the central administration"],"pinyin":["zhong1 shu1"],"traditional":["中樞"],"rank":18396.0,"normalized_rank":0.25738390720971555,"fraction":0.0000028229153482560444,"cumulative_fraction":0.9706629259619454,"word":"中枢","characters":[{"definition":["to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right","China\/Chinese\/surname Zhong"],"pinyin":["zhong4","zhong1","Zhong1"],"word":"中"},{"definition":["hinge\/pivot"],"pinyin":["shu1"],"word":"枢"}],"containing_words":[{"definition":["central nervous system, CNS"],"pinyin":["zhong1 shu1 shen2 jing1 xi4 tong3"],"word":"中枢神经系统"}],"sentences":[{"english":"It is flammable, explosive, toxic and anesthetize nerve centres.","chinese":"易燃易爆，有毒，能使神经中枢麻醉。"},{"english":"The 10 point is that 1 minutes of central back relaxation?","chinese":"那么10点是这1分钟中枢的背驰点吗？"},{"english":"Axons of the central nervous system in adult mammals do not regenerate spontaneously after axotomy.","chinese":"成年哺乳动物的中枢神经受伤后无法自行再生。"},{"english":"Intelligent protection equipment is the central control unit of high switch.","chinese":"智能型保护装置是高压开关的中枢控制部件。"},{"english":"To study the location of brain areas involved in immunoregulation.","chinese":"目的定位免疫功能相关的中枢脑区。"},{"english":"The exact site at which clonidine exerts this central effect is not precisely known.","chinese":"可乐宁发挥中枢作用的确切部位尚不清楚。"},{"english":"Cocaine is a potent central nervous system stimulant.","chinese":"可卡因是一种强大的中枢神经系统激动剂。"},{"english":"Their hope, they said, is that the islands will become Seoul's new cultural hubs.","chinese":"他们说，希望这些浮岛会成为首尔新的文化中枢。"},{"english":"When blood sugar rises to a certain degree, saturated central issue gastric disorder signal. If all the nutrients, to reduce weight a biscuit products.","chinese":"当血糖上升到一定程度时，饱和中枢发出停食信号。"},{"english":"Objective To investigate the changes of central respiratory drive and inspiratory muscle function in patients with dermatomyositis.","chinese":"目的了解皮肌炎患者呼吸中枢肺的功能变化。"},{"english":"Rolling force model is the crucial model for process control in cold rolling.","chinese":"轧制力数学模型是冷轧工艺控制系统的中枢模型。"},{"english":"During Xia, Shang and Zhou dynasties, Central Plains lay the core of Chinese civilization.","chinese":"夏商周三代文明，中原独领风骚，居于全国中枢地位。"},{"english":"The body is regulated by centers in the brain that co-ordinate all the different parts.","chinese":"身体受到协调不同部位的大脑中枢系统的控制。"},{"english":"Sam, aged six, is just one of around 60 people in Britain with congenital central hypoventilation syndrome (CCHS), which means he often stops breathing.","chinese":"现年6岁的Sam患有先天中枢性换气不足症候群。"},{"english":"More ventilatory threshold intensity can make the brain cells tired.","chinese":"大于通气阈强度运动后易使中枢神经细胞产生疲劳。"},{"english":"Objective To study the pharmacological effects of the Ziziphus jujube leaf extract on central nervous system.","chinese":"目的观察酸枣叶提取物对中枢神经系统作用。"}],"related":[{"definition":["vibration\/oscillation"],"pinyin":["zhen4 dang4"],"word":"振荡"},{"definition":["high position\/eminent status\/top job\/raised position\/upper (limbs)\/a high (i.e. local maximum)\/high point on scale, high grade, temperature, latitude etc"],"pinyin":["gao1 wei4"],"word":"高位"},{"definition":["to shake up\/to jolt\/to vibrate\/to oscillate\/to fluctuate","to vibrate\/to shake\/to shudder"],"pinyin":["zhen4 dang4","zhen4 dang4"],"word":"震荡"},{"definition":["to pull back\/to shrink\/to contract\/(physiology) systole"],"pinyin":["shou1 suo1"],"word":"收缩"},{"definition":["signal"],"pinyin":["xin4 hao4"],"word":"信号"},{"definition":["(of trains) down (i.e. away from the capital)\/(of river boats) to travel downstream\/to issue (a document) to lower bureaucratic levels\/(of writing on the page) vertical, proceeding from top to bottom"],"pinyin":["xia4 xing2"],"word":"下行"},{"definition":["expansion\/dilation\/to expand (e.g. one's power or influence)\/to broaden"],"pinyin":["kuo4 zhang1"],"word":"扩张"},{"definition":["to conduct (heat, electricity etc)"],"pinyin":["chuan2 dao3"],"word":"传导"},{"definition":["to undulate\/to fluctuate\/wave motion\/rise and fall"],"pinyin":["bo1 dong4"],"word":"波动"},{"definition":["down\/downward"],"pinyin":["xiang4 xia4"],"word":"向下"},{"definition":["to prop up\/to support\/strut\/brace"],"pinyin":["zhi1 cheng1"],"word":"支撑"},{"definition":["summit\/peak\/(math.) vertex"],"pinyin":["ding3 dian3"],"word":"顶点"},{"definition":["(of trains) up (i.e. towards the capital)\/(of river boats) to go against the current\/to submit (a document) to higher authorities"],"pinyin":["shang4 xing2"],"word":"上行"},{"definition":["short term\/short-term"],"pinyin":["duan3 qi1"],"word":"短期"},{"definition":["sequence"],"pinyin":["xu4 lie4"],"word":"序列"},{"definition":["secondary"],"pinyin":["ci4 ji2"],"word":"次级"}]}