{"definition":["neutral"],"pinyin":["zhong1 xing4"],"traditional":["中性"],"rank":8734.0,"normalized_rank":0.12219999160522155,"fraction":0.00001036791497024187,"cumulative_fraction":0.9179634786583676,"word":"中性","characters":[{"definition":["to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right","China\/Chinese\/surname Zhong"],"pinyin":["zhong4","zhong1","Zhong1"],"word":"中"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[{"definition":["rollerball pen"],"pinyin":["zhong1 xing4 bi3"],"word":"中性笔"},{"definition":["neutrophil (the most common type of white blood cell)"],"pinyin":["zhong1 xing4 li4 xi4 bao1"],"word":"中性粒细胞"}],"sentences":[{"english":"This paper studied the antiseptic and fresh- keeping technology of pasteurized neutral milk beverage.","chinese":"研究了巴氏杀菌中性乳饮料的防腐保鲜技术。"},{"english":"Neutral colors like tan and white are great, with some color tossed in.","chinese":"中性色如褐色和白色跟其他颜色都很谐调。"},{"english":"Dilate of shallow-layer blood capillary congests , see ooze blood and cell of neutral of be addicted to occasionally.","chinese":"浅层毛细血管扩张充血，偶见渗血及嗜中性细胞。"},{"english":"Magnesium aluminum hydroxides show higher adsorption capacity to the model pitch and stickies at neutral pH.","chinese":"氢氧化镁铝对树脂和胶黏物在中性条件下吸附量较大。"},{"english":"Furniture choose neuter color advisable, avoid choose white or deep color.","chinese":"家具选择中性颜色为宜，避免选择白色或深的色彩。"},{"english":"The suggestive sheerness of this shirt is juxtaposed with an androgynous bow tie and a bright printed skirt.","chinese":"这件透视衬衫搭配中性领结和亮色印花裙，效果很好。"},{"english":"The bleached wood flooring and neutral colors contribute to the feeling of spaciousness.","chinese":"退了色的木地板以及中性色调让空间显得更为开阔。"},{"english":"Neutral protease is used to enzymatically hydrolyze alkaline pretreated cold pressed peanut cake.","chinese":"用中性蛋白酶对碱预处理过的花生饼进行酶解。"},{"english":"Medium-bodied dry red wine, with nose of smoky currants, floral and mineral.","chinese":"中性酒体干红葡萄酒，富有烟熏，黑醋栗和花香气味。"},{"english":"The cleaning effect of neutral multi-enzyme detergent applied in control group was better.","chinese":"单纯应用中性多酶清洗剂组清洗效果更佳。"},{"english":"The Swiss hearing-aid maker was cut to “neutral” from “buy” at UBS AG.","chinese":"瑞银集团把该公司股票评级从买入下调为中性。"},{"english":"He was a natural-born teacher.","chinese":"他是一个中性的老师。"},{"english":"In this paper, the antisepsis and fresh-keeping technology for pasteurized neutral milk beverages is studied.","chinese":"研究了巴氏杀菌中性乳饮料的防腐保鲜技术。"},{"english":"Neutral deinking process is more suitable to the laser printing waste paper.","chinese":"激光打印废纸更适合采用中性脱墨工艺。"},{"english":"Soneva Fushi, for instance, will become the world's first carbon-neutral tourist resort.","chinese":"例如富士公司，将成为世界上第一个碳中性旅游胜地。"},{"english":"OBJECTIVE To screen neutral sphingomyelinase inhibitors from the metabolites of microorganism.","chinese":"目的从微生物代谢物中筛选中性鞘磷脂酶抑制剂。"}],"related":[{"definition":["to feminize\/feminization"],"pinyin":["nu:3 xing4 hua4"],"word":"女性化"},{"definition":["mild\/gentle\/moderate","lukewarm"],"pinyin":["wen1 he2","wen1 huo5"],"word":"温和"},{"definition":["to lean\/to slant\/oblique\/prejudiced\/to deviate from average\/to stray from the intended line\/stubbornly\/contrary to expectations"],"pinyin":["pian1"],"word":"偏"},{"definition":["to relax (policy)\/relaxed"],"pinyin":["kuan1 song1"],"word":"宽松"},{"definition":["dove faction (opposite: 鹰派, hawks)\/peace party\/the faction seeking peace"],"pinyin":["ge1 pai4"],"word":"鸽派"},{"definition":["partial towards sth\/to prefer\/to incline\/erroneous tendencies (Leftist or Revisionist deviation)"],"pinyin":["pian1 xiang4"],"word":"偏向"},{"definition":["hawk faction (opposite: 鸽派, doves)\/fierce and combative party\/war party\/warmongers"],"pinyin":["ying1 pai4"],"word":"鹰派"},{"definition":["moderately\/appropriate"],"pinyin":["shi4 du4"],"word":"适度"},{"definition":["whole entity\/entire body\/synthesis\/as a whole (situation, construction, team etc)\/global\/macrocosm\/integral\/holistic\/whole"],"pinyin":["zheng3 ti3"],"word":"整体"},{"definition":["firm\/stable and steady"],"pinyin":["wen3 jian4"],"word":"稳健"},{"definition":["fresh and cool\/relaxed"],"pinyin":["qing1 shuang3"],"word":"清爽"},{"definition":["purple\/violet (color)"],"pinyin":["zi3 se4"],"word":"紫色"},{"definition":["gentle\/soft"],"pinyin":["rou2 he2"],"word":"柔和"},{"definition":["main key (of a musical composition)\/keynote (speech)"],"pinyin":["ji1 diao4"],"word":"基调"},{"definition":["flowing\/shifting\/fluidity\/mobility\/liquidity (of funds)"],"pinyin":["liu2 dong4 xing4"],"word":"流动性"},{"definition":["money market"],"pinyin":["huo4 bi4 shi4 chang3"],"word":"货币市场"}]}