{"definition":["Chinese and Western medicine\/a doctor trained in Chinese and Western medicine"],"pinyin":["zhong1 xi1 yi1"],"traditional":["中西醫"],"rank":21729.0,"normalized_rank":0.3040169014872749,"fraction":0.000002012447563918597,"cumulative_fraction":0.9786282988157844,"word":"中西医","characters":[{"definition":["to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right","China\/Chinese\/surname Zhong"],"pinyin":["zhong4","zhong1","Zhong1"],"word":"中"},{"definition":["west","the West\/abbr. for Spain 西班牙[Xi1 ban1 ya2]\/Spanish"],"pinyin":["xi1","Xi1"],"word":"西"},{"definition":["medical\/medicine\/doctor\/to cure\/to treat"],"pinyin":["yi1"],"word":"医"}],"containing_words":[{"definition":["to combine traditional Chinese and Western medicine"],"pinyin":["Zhong1 Xi1 yi1 jie2 he2"],"word":"中西医结合"}],"sentences":[{"english":"To explore traditional chinese and western medicine treatment methods anorectal prolapse.","chinese":"探讨中西医治疗肛管直肠脱垂的方法。"},{"english":"However, it also encountered several problems on the way of development.","chinese":"但中西医结合在发展的道路上也遇到了若干问题。"},{"english":"Objective To explore the treatment perscription with the method of integrated traditional and western medicine in type 2 diabetes.","chinese":"目的探讨2型糖尿病中西医结合治疗方案。"},{"english":"Comparative study was done on mentality versus consciousness and mental confusion versus conscious disturbance in western medicine and traditional Chinese medicine.","chinese":"对中西医学神与意识，神昏与意识障碍进行比较研究。"},{"english":"Resultantly , the gastric cancer postoperative complications were successfully treated with the combination of Chinese and Western medicine.","chinese":"中西医结合治疗成功控制此胃癌术后并发症的案例。"},{"english":"Surgery of integrated Chinese and Western medicine is a clinical discipline that attaches great importance to practice.","chinese":"中西医结合外科学是一门实践性极强的临床学科。"},{"english":"Objective To investigate the clinical efficacy of treating tubal reghancy with combined therapy of Chinese and western medicine.","chinese":"目的探讨中西医结合治疗输卵管妊娠的临床疗效。"},{"english":"OBJECTIVE To observe the effect of traditional Chinese medicine combined with western medicine on treatment muscular asthenopia.","chinese":"目的观察用中西医结合方法治疗肌性视疲劳的疗效。"},{"english":"Objective To observe the therapeutic effect of Banxiaxiexin decoction combined with Mosapride tablets in treating functional dyspepsia.","chinese":"目的观察中西医结合治疗功能性消化不良的疗效。"},{"english":"We observed the effect of integrative medical treatment in therapy group and simply isosorbide dinitrate treatment in control group.","chinese":"对中西医结合方法和单纯服用消心痛的疗效进行观察。"},{"english":"To explore the clinical effect of Chinese medicine combined with western medicine in treating lymphoid tuberculosis.","chinese":"目的探讨中西医治疗淋巴结核的临床疗效。"},{"english":"Objective To explore how to increase cure rate of hemorrhagic necrotizing pancreatitis.","chinese":"中西医结合治疗急性坏死性筋膜炎能取得良好的疗效。"},{"english":"Conclusion There is a definite effect of combined Chinese and western medicine of primary nephrosis syndrom.","chinese":"结论中西医结合治疗原发性肾病综合征疗效确切。"},{"english":"Objective To observe the therapeutic effects of two kinds of methods on erysipelas. Methods One hundred and four cases were arranged to two groups.","chinese":"目的观察中西医结合方法治疗丹毒的临床效果。"},{"english":"Objective Treatment of Chinese and Western Medicine Chest to explore effective means of heartache.","chinese":"目的探索中西医结合治疗胸痹心痛的有效手段。"},{"english":"Objective To compare the effectiveness of integrated Chinese and Westen medicine on bed pressure with that of conventional method.","chinese":"目的比较中西医结合方法与传统方法治疗压疮的疗效。"}],"related":[{"definition":["Western medicine\/a doctor trained in Western medicine"],"pinyin":["xi1 yi1"],"word":"西医"},{"definition":["to combine traditional Chinese and Western medicine"],"pinyin":["Zhong1 Xi1 yi1 jie2 he2"],"word":"中西医结合"},{"definition":["holistic diagnosis and treatment (TCM)"],"pinyin":["bian4 zheng4 lun4 zhi4"],"word":"辨证论治"},{"definition":["traditional Chinese medical science\/a doctor trained in Chinese medicine"],"pinyin":["Zhong1 yi1"],"word":"中医"},{"definition":["diagnosis and treatment based on an overall analysis of the illness and the patient's condition"],"pinyin":["bian4 zheng4 shi1 zhi4"],"word":"辨证施治"},{"definition":["internal medicine\/general medicine"],"pinyin":["nei4 ke1"],"word":"内科"},{"definition":["acupuncture and moxibustion\/to give or have acupuncture and moxibustion"],"pinyin":["zhen1 jiu3"],"word":"针灸"},{"definition":["medicine\/medical science\/study of medicine"],"pinyin":["yi1 xue2"],"word":"医学"},{"definition":["surgery (branch of medicine)"],"pinyin":["wai4 ke1"],"word":"外科"},{"definition":["gynecology"],"pinyin":["fu4 ke1"],"word":"妇科"},{"definition":["to investigate\/dialectical"],"pinyin":["bian4 zheng4"],"word":"辩证"},{"definition":["to investigate"],"pinyin":["bian4 zheng4"],"word":"辨证"},{"definition":["pathology"],"pinyin":["bing4 li3"],"word":"病理"},{"definition":["Western medicine"],"pinyin":["xi1 yao4"],"word":"西药"},{"definition":["pediatrics"],"pinyin":["er2 ke1"],"word":"儿科"},{"definition":["to apply a treatment\/to undertake a therapy"],"pinyin":["shi1 zhi4"],"word":"施治"}]}