{"definition":["to establish ties or contact\/in series connection (electricity)"],"pinyin":["chuan4 lian2"],"traditional":["串聯"],"rank":19899.0,"normalized_rank":0.27841282722146826,"fraction":0.0000024229366506543498,"cumulative_fraction":0.9745949809248556,"word":"串联","characters":[{"definition":["to string together\/to skewer\/to connect wrongly\/to gang up\/to rove\/string\/bunch\/skewer\/classifier for things that are strung together, or in a bunch, or in a row: string of, bunch of, series of\/to make a swift or abrupt linear movement (like a bead on an abacus)\/to move across"],"pinyin":["chuan4"],"word":"串"},{"definition":["to ally\/to unite\/to join\/(poetry) antithetical couplet"],"pinyin":["lian2"],"word":"联"}],"containing_words":[],"sentences":[{"english":"Also, a formula calculating the pressure drop of series throttle holes in the liquid propellant transporting sys…","chinese":"文中还给出了液路系统中各串联节流孔压降公式。"},{"english":"Series piezoelectric crystal sensor could detect this change sensitively.","chinese":"串联式压电传感器可以灵敏地检测到这种变化。"},{"english":"They includes improving drying agent feeding pattern and chlorine gas washing pattern, increasing two step in series demister, et al.","chinese":"改进氯气洗涤方式以及增设两级串联防雾等措施。"},{"english":"There are many alternatives in obtaining tandem axle dump truck financing.","chinese":"有许多替代品在获得串联轴自卸车融资。"},{"english":"Continuous conveyer of disc-tube assembly is scattered material conveyer of hight efficiency.","chinese":"串联盘管道连续输送机是一种高效，环保散料传输机。"},{"english":"This paper applies conformal geometric algebra to analyze the reverse kinematics of serial robot.","chinese":"本文应用共形几何代数分析串联机器人的运动学反解。"},{"english":"To operate at higher voltages, supercapacitors are connected in series.","chinese":"工作在更高的电压，超级电容器串联连接。"},{"english":"Be careful to install batteries in series.","chinese":"要注意，所有电池应装成串联。"},{"english":"All the LEDs are connected in parallel with a 100-ohm resistor in series with each.","chinese":"在此方法中，恒压源与未知电阻和安培计相串联。"},{"english":"The improvement of intermodulation distortion with series negative feedback is given quantitatively.","chinese":"定量地给出了串联负反馈对互调失真的改善程度。"},{"english":"The qualitative factor Q of series resonant circuit for voltage withstanding test is analyzed.","chinese":"对串联谐振耐压试验回路的品质因数Q进行了分析。"},{"english":"The four resistors are connected in series, making a chain known as a potential divider, or voltage divider.","chinese":"四个电阻串联接在一起，形成一个链形的分压电路。"},{"english":"Thyristor controlled series compensation (TCSC) is introduced and TCSC dynamic system simulation is designed and carried out.","chinese":"研究了可控串联补偿动态模拟的实验方案和控制装置。"},{"english":"Wu Peixin put all the clues in series, with the facts very close.","chinese":"吴佩欣把所有的线索都串联了起来，跟事实很贴近了。"},{"english":"While wanting to gain noble and pure degree oil liquid, may adopt pair of in-line level essence filter.","chinese":"当想获得高洁度油液时，可采用双级串联精滤。"},{"english":"After land reform, they linked up several farmers and organized an agriculture mutual-aid team.","chinese":"他们串联了几户农民组织起了一个生产互助组。"}],"related":[{"definition":["to bind\/to tie\/to link"],"pinyin":["lian2 jie2"],"word":"联结"},{"definition":["to link\/to join\/to attach\/connection\/a link (on web page)"],"pinyin":["lian2 jie1"],"word":"连接"},{"definition":["to join together\/to combine"],"pinyin":["xian2 jie1"],"word":"衔接"},{"definition":["variant of 連接|连接[lian2 jie1]"],"pinyin":["lian2 jie1"],"word":"联接"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"构建"},{"definition":["to connect\/to communicate\/to relate\/(math.) connected"],"pinyin":["lian2 tong1"],"word":"连通"},{"definition":["seamless connection"],"pinyin":["wu2 feng4 lian2 jie1"],"word":"无缝连接"},{"definition":["both ends (of a stick etc)\/two extremes"],"pinyin":["liang3 duan1"],"word":"两端"},{"definition":["lit. warp string in weaving\/fig. vertical or north-south lines\/to pass through\/to cross lengthwise\/to pierce (esp. north-south or top-to-bottom)"],"pinyin":["zong4 guan4"],"word":"纵贯"},{"definition":["core\/nucleus"],"pinyin":["he2 xin1"],"word":"核心"},{"definition":["structure"],"pinyin":["gou4 jia4"],"word":"构架"},{"definition":["interlinked"],"pinyin":["hu4 xiang1 lian2 jie1"],"word":"互相连接"},{"definition":["to link up (disparate elements)\/coherent (narrative, argument etc)"],"pinyin":["lian2 guan4"],"word":"连贯"},{"definition":["tie\/link\/bond"],"pinyin":["niu3 dai4"],"word":"纽带"},{"definition":["to run through\/a connecting thread from beginning to end\/to link"],"pinyin":["guan4 chuan1"],"word":"贯穿"},{"definition":["to link up\/to thread together"],"pinyin":["guan4 tong1"],"word":"贯通"}]}