{"definition":["lit. not to dig a well until one is thirsty\/to be unprepared and seek help at the last minute (idiom)"],"pinyin":["lin2 ke3 jue2 jing3"],"traditional":["臨渴掘井"],"rank":65084.0,"normalized_rank":0.9106096008282848,"fraction":1.561960607422674e-8,"cumulative_fraction":0.9999548551050936,"word":"临渴掘井","characters":[{"definition":["to face\/to overlook\/to arrive\/to be (just) about to\/just before"],"pinyin":["lin2"],"word":"临"},{"definition":["thirsty"],"pinyin":["ke3"],"word":"渴"},{"definition":["to dig"],"pinyin":["jue2"],"word":"掘"},{"definition":["Jing, one of the 28 constellations of Chinese astronomy\/surname Jing","a well\/CL:口[kou3]\/neat\/orderly"],"pinyin":["Jing3","jing3"],"word":"井"}],"containing_words":[],"sentences":[{"english":"As the saying goes, \"Dig your well before you're thirsty.\"","chinese":"老话说得好啊，不要临渴掘井。"}],"related":[{"definition":["He who gives no thought to far-flung problems soon finds suffering nearby (idiom, from Analects).\/Smug concentration on the here and now will lead to future sorrow."],"pinyin":["ren2 wu2 yuan3 lu:4 , bi4 you3 jin4 you1"],"word":"人无远虑，必有近忧"},{"definition":["to prevent troubles before the event (idiom)\/to forestall\/to nip sth in the bud"],"pinyin":["fang2 huan4 wei4 ran2"],"word":"防患未然"},{"definition":["lit. to mend the pen after sheep are lost (idiom)\/fig. to act belatedly\/better late than never\/to lock the stable door after the horse has bolted"],"pinyin":["wang2 yang2 bu3 lao2"],"word":"亡羊补牢"},{"definition":["lit. to bend the chimney and remove the firewood (to prevent fire) (idiom)\/fig. to take preventive measures"],"pinyin":["qu1 tu1 xi3 xin1"],"word":"曲突徙薪"},{"definition":["one day's sun, ten days' frost (idiom, from Mencius); fig. to work for a bit then skimp\/sporadic effort\/short attention span"],"pinyin":["yi1 pu4 shi2 han2"],"word":"一暴十寒"},{"definition":["lit. before it rains, bind around with silk (idiom, from Book of Songs 詩經|诗经); fig. to plan ahead\/to prepare for a rainy day"],"pinyin":["wei4 yu3 chou2 mou2"],"word":"未雨绸缪"},{"definition":["to work hard while accomplishing little\/to toil to no avail"],"pinyin":["lao2 er2 wu2 gong1"],"word":"劳而无功"},{"definition":["to neglect the root and pursue the tip (idiom)\/to neglect fundamentals and concentrate on details"],"pinyin":["she3 ben3 zhu2 mo4"],"word":"舍本逐末"},{"definition":["lit. sharpening the axe won't make the wood-splitting take longer (idiom)\/fig. time invested in preparations is not lost\/a beard well lathered is half shaved"],"pinyin":["mo2 dao1 bu4 wu4 kan3 chai2 gong1"],"word":"磨刀不误砍柴工"},{"definition":["lit. to see a bow reflected in a cup as a snake (idiom); fig. unnecessary suspicions\/overly fearful"],"pinyin":["bei1 gong1 she2 ying3"],"word":"杯弓蛇影"},{"definition":["it is not too late (idiom)"],"pinyin":["you2 wei4 wei2 wan3"],"word":"犹未为晚"},{"definition":["lit. climb a tree to catch a fish (idiom); fig. to attempt the impossible"],"pinyin":["yuan2 mu4 qiu2 yu2"],"word":"缘木求鱼"},{"definition":["to sit and waste a good opportunity (idiom); to lose the chance"],"pinyin":["zuo4 shi1 liang2 ji1"],"word":"坐失良机"},{"definition":["lit. eyes obscured by a single leaf (idiom)\/fig. not seeing the wider picture\/can't see the wood for the trees"],"pinyin":["yi1 ye4 zhang4 mu4"],"word":"一叶障目"},{"definition":["one day's sun, ten days' frost (idiom, from Mencius); fig. to work for a bit then skimp\/sporadic effort\/lack of sticking power\/short attention span"],"pinyin":["yi1 pu4 shi2 han2"],"word":"一曝十寒"},{"definition":["see 臨淵羨魚，不如退而結網|临渊羡鱼，不如退而结网[lin2 yuan1 xian4 yu2 , bu4 ru2 tui4 er2 jie2 wang3]"],"pinyin":["lin2 yuan1 xian4 yu2"],"word":"临渊羡鱼"}]}