{"definition":["(bird species of China) red-crowned crane (Grus japonensis)"],"pinyin":["dan1 ding3 he4"],"traditional":["丹頂鶴"],"rank":30326.0,"normalized_rank":0.4243000853469142,"fraction":9.163015638123482e-7,"cumulative_fraction":0.9905447221172038,"word":"丹顶鹤","characters":[{"definition":["red\/pellet\/powder\/cinnabar"],"pinyin":["dan1"],"word":"丹"},{"definition":["apex\/crown of the head\/top\/roof\/most\/to carry on the head\/to push to the top\/to go against\/to replace\/to substitute\/to be subjected to (an aerial bombing, hailstorm etc)\/(slang) to \"bump\" a forum thread to raise its profile\/classifier for headwear, hats, veils etc"],"pinyin":["ding3"],"word":"顶"},{"definition":["crane"],"pinyin":["he4"],"word":"鹤"}],"containing_words":[],"sentences":[{"english":"He likes peacocks and cranes.","chinese":"他喜欢孔雀和丹顶鹤。"},{"english":"Red-crowned cranes dance the most beautiful dances in the world of birds.","chinese":"丹顶鹤是在鸟类中跳舞最美的。"},{"english":"One never tires of watching lovely red-crowned cranes.","chinese":"优雅的丹顶鹤令人百看不厌。"},{"english":"A song named the story of the red-crowned crane was specially composed for her.","chinese":"一首名为丹顶鹤的故事是特别为她。"},{"english":"If you have the chance to pay a visit to the hometown of the red-crowned cranes in person, you will surely be impressed.","chinese":"如果你有机会参观丹顶鹤的故乡，你肯定会被打动。"},{"english":"These birds are all raised by humans.","chinese":"这些丹顶鹤啊，都是人工饲养的。"},{"english":"People often draw red crowned crane and pine together.","chinese":"人们经常把丹顶鹤与松树画在一起。"},{"english":"The image of the Red-crowned Crane can be seen in many places in China.","chinese":"丹顶鹤的图案可以在中国很多地方看到。"},{"english":"You can't see red-crowned cranes in other parts of the world.","chinese":"世界其它地方你是看不到丹顶鹤的。"},{"english":"So it is the longest-living of all bird species. For centuries, cranes have been revered in China as symbols of longevity.","chinese":"丹顶鹤的寿命有六十年，它是鸟类中的寿星。"},{"english":"Daniel, during the breeding season, the red-crested cranes live solitarily .","chinese":"大牛，丹顶鹤在繁殖的时候啊是要独居的。"},{"english":"The pathogeny of death of the red_crowned cranes proved to be Candida glabrata by experiments and studies.","chinese":"经实验研究确定其为丹顶鹤致死病原。"},{"english":"Red-crowned cranes are one of the world's most endangered species.","chinese":"丹顶鹤是世界上濒临灭绝的物种之一。"},{"english":"Red-crowned cranes dance the maximum beautiful dances in the globle of birds.","chinese":"丹顶鹤是在鸟类中跳舞最美的。"},{"english":"Red-crowned 5 cranes are one of the world's most endangered species.","chinese":"丹顶鹤是世界上濒临灭绝的物种之一。"},{"english":"Qiqihar is home to the red-crowned crane.","chinese":"齐齐哈尔是丹顶鹤的故乡。"}],"related":[{"definition":["(bird species of China) common crane (Grus grus)"],"pinyin":["hui1 he4"],"word":"灰鹤"},{"definition":["(bird species of China) whooper swan (Cygnus cygnus)"],"pinyin":["da4 tian1 e2"],"word":"大天鹅"},{"definition":["(bird species of China) white-naped crane (Grus vipio)"],"pinyin":["bai2 zhen3 he4"],"word":"白枕鹤"},{"definition":["(bird species of China) hooded crane (Grus monacha)"],"pinyin":["bai2 tou2 he4"],"word":"白头鹤"},{"definition":["(bird species of China) demoiselle crane (Grus virgo)"],"pinyin":["suo1 yu3 he4"],"word":"蓑羽鹤"},{"definition":["(bird species of China) oriental stork (Ciconia boyciana)"],"pinyin":["dong1 fang1 bai2 guan4"],"word":"东方白鹳"},{"definition":["(bird species of China) Eurasian spoonbill (Platalea leucorodia)"],"pinyin":["bai2 pi2 lu4"],"word":"白琵鹭"},{"definition":["(bird species of China) black-necked crane (Grus nigricollis)"],"pinyin":["hei1 jing3 he4"],"word":"黑颈鹤"},{"definition":["(bird species of China) great bustard (Otis tarda)"],"pinyin":["da4 bao3"],"word":"大鸨"},{"definition":["birds"],"pinyin":["niao3 lei4"],"word":"鸟类"},{"definition":["(bird species of China) black stork (Ciconia nigra)"],"pinyin":["hei1 guan4"],"word":"黑鹳"},{"definition":["(bird species of China) white-tailed eagle (Haliaeetus albicilla)"],"pinyin":["bai2 wei3 hai3 diao1"],"word":"白尾海雕"},{"definition":["(bird species of China) mallard (Anas platyrhynchos)"],"pinyin":["lu:4 tou2 ya1"],"word":"绿头鸭"},{"definition":["waterbird"],"pinyin":["shui3 niao3"],"word":"水鸟"},{"definition":["(bird species of China) ruddy shelduck (Tadorna ferruginea)"],"pinyin":["chi4 ma2 ya1"],"word":"赤麻鸭"},{"definition":["(bird species of China) Chinese egret (Egretta eulophotes)"],"pinyin":["huang2 zui3 bai2 lu4"],"word":"黄嘴白鹭"}]}