{"definition":["in order to\/for the purpose of\/so as to"],"pinyin":["wei4 le5"],"traditional":["為了"],"rank":228.0,"normalized_rank":0.003190015810166077,"fraction":0.0005194764208837524,"cumulative_fraction":0.408348818096224,"word":"为了","characters":[{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"}],"containing_words":[],"sentences":[{"english":"Rather he'll say, \"It's for the child's own good.","chinese":"而是说，“这都是为了孩子好。"},{"english":"They started out early so that they would not miss the train.","chinese":"他们早早出发是为了不误火车。"},{"english":"So in the interest of helping out the next generation of thieves, I'm going to offer you a few pointers.","chinese":"所以，为了有助于下一代游荡者们，我准备教你几招。"},{"english":"Should one renounce Nirvana oneself, in order to help others towards it first?","chinese":"人应该放弃自己的涅磐，为了首先帮助它人达到它？"},{"english":"It is better to weed out the bad businesses within the group rather than cross-subsidise them to save face.","chinese":"将集团内的不良业务剔除，好过为了面子予以挽救。"},{"english":"Drache to confidential action content, therefore has not to clarify in this matter.","chinese":"卓凯为了保密行动内容，故一直没有就此事作出澄清。"},{"english":"Walking home by the alma mater is just for seeking fun.","chinese":"经过母校步行回家仅仅为了取乐而已。"},{"english":"The slit scanning is required to obtain two-dimensional spectral imaging.","chinese":"为了得到像斑的二维光谱，需要做狭缝扫描。"},{"english":"You think I'm just withholding information because I like hanging out with you?","chinese":"你以为我会知情不报只为了和你聊天？"},{"english":"Because ofu, I know the distance is just a number for us!","chinese":"答应你，我会为了你在西雅图好好照顾自己。"},{"english":"In order to make strong shot, a player must be able to hold racket very hard.","chinese":"为了击球有力，选手必须将拍子抓得非常紧。"},{"english":"To de fend our country we must strengthen ourselves.","chinese":"为了保卫祖国，我们必须自强不息。"},{"english":"To get that figure, look at the figures before seasonal adjustment.","chinese":"为了得到这个数字，我们先来看下季节调动的情况。"},{"english":"To simulate the Force, technicians hid devices on \"Kenobi's\" person.","chinese":"为了模拟原力，技术人员在“克诺比”身上藏了仪器。"},{"english":"I find the best way to do this is to scrape them with an X-acto knife.","chinese":"我觉得最好的方法这样做是为了刮他们的X雅刀。"},{"english":"One must wash his hands before meals to avoid diseases.","chinese":"为了避免病从口入，饭前要洗手。"}],"related":[{"definition":["purpose\/aim\/goal\/target\/objective\/CL:個|个[ge4]"],"pinyin":["mu4 di4"],"word":"目的"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["to yield\/to permit\/to let sb do sth\/to have sb do sth\/to make sb (feel sad etc)\/by (indicates the agent in a passive clause, like 被[bei4])"],"pinyin":["rang4"],"word":"让"},{"definition":["because\/owing to\/on account of"],"pinyin":["yin1 wei4"],"word":"因为"},{"definition":["therefore\/as a result\/so\/the reason why"],"pinyin":["suo3 yi3"],"word":"所以"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["original intention"],"pinyin":["chu1 zhong1"],"word":"初衷"},{"definition":["for this reason\/with regards to this\/in this respect\/in order to do this\/to this end"],"pinyin":["wei4 ci3"],"word":"为此"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"},{"definition":["merely\/simply\/only\/but"],"pinyin":["zhi3 shi4"],"word":"只是"},{"definition":["with this\/thereby\/thus\/because of this"],"pinyin":["yi3 ci3"],"word":"以此"},{"definition":["to think\/to believe\/to suppose\/to wish\/to want\/to miss (feel wistful about the absence of sb or sth)"],"pinyin":["xiang3"],"word":"想"},{"definition":["to want to\/to feel like\/to fancy\/to care for sb\/desirous of"],"pinyin":["xiang3 yao4"],"word":"想要"},{"definition":["thus\/consequently\/as a result"],"pinyin":["yin1 ci3"],"word":"因此"},{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"}]}