{"definition":["for this reason\/with regards to this\/in this respect\/in order to do this\/to this end"],"pinyin":["wei4 ci3"],"traditional":["為此"],"rank":1524.0,"normalized_rank":0.02132273725742588,"fraction":0.00010485076613561257,"cumulative_fraction":0.6877654257451209,"word":"为此","characters":[{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"},{"definition":["this\/these"],"pinyin":["ci3"],"word":"此"}],"containing_words":[],"sentences":[{"english":"The LORD finds us enough reasons for prayer, and we ought to thank Him that it is so.","chinese":"上帝乐意听我们的琐碎絮语，我们也该为此献上感谢。"},{"english":"It does this by challenging the end user for credentials.","chinese":"为此，它要求终端用户提供凭据。"},{"english":"Kratos: You will pay for this Zeus, be certain of that.","chinese":"你将会为此付出代价的，宙斯，我保证。"},{"english":"I do apologize for giving you the wrong soup.","chinese":"我上错汤了，我为此道歉。"},{"english":"For this purpose, the laboratory compares its evidence to samples maintained in archives.","chinese":"为此，实验室会将证物和保管在柜子中的样本做比较。"},{"english":"An investigation team led by the provincial public security department has been formed.","chinese":"省公安厅为此成立的一个案件调查小组。"},{"english":"It is a charge to keep and I will give it my all.","chinese":"它是一项要履行的职责，我将为此鞠躬尽瘁。"},{"english":"To do this, you essentially need a rollback script for every change.","chinese":"为此，实际上每个更改都需要一个回滚脚本。"},{"english":"Meng shu and liu to fisticuffs, as a result, liu pain beat.","chinese":"为此孟蜀和刘地大打出手，结果刘地被痛揍一顿。"},{"english":"And for that I need a byte of volunteers, alright?","chinese":"为此，我需要一个字节的志愿者，谁来？"},{"english":"For this reason, the researches on opening up wasteland were always hot.","chinese":"为此，有关屯垦的研究历来较为活跃。"},{"english":"B You know, she is moody sometimes. I wouldn’t worry about it.","chinese":"你知道她有时候喜怒无常，我是不会为此而担心的。"},{"english":"Hence, we give a new expression of Slaving Principle and study its relation to Adiabatic Approximation.","chinese":"为此给出了役使原理的新表述，并探讨两者的关系。"},{"english":"When we investigate soils and divide them, We must pay a great attention to the geological factors in depth.","chinese":"为此，在土壤调查与区划时，必须重视深部地质因素。"},{"english":"Self-directed learning may open a new avenue for us.","chinese":"自主学习的研究为此提供了一个思路。"},{"english":"So, I really feel so glad to teach her.","chinese":"为此，我感到很开心，很高兴曾教她瑜伽。"}],"related":[{"definition":["thus\/consequently\/as a result"],"pinyin":["yin1 ci3"],"word":"因此"},{"definition":["in order to\/for the purpose of\/so as to"],"pinyin":["wei4 le5"],"word":"为了"},{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["specially\/intentionally"],"pinyin":["te4 yi4"],"word":"特意"},{"definition":["because\/owing to\/on account of"],"pinyin":["yin1 wei4"],"word":"因为"},{"definition":["not only that, but ..."],"pinyin":["bu4 jin3 ru2 ci3"],"word":"不仅如此"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"},{"definition":["and\/besides\/moreover\/furthermore\/in addition"],"pinyin":["bing4 qie3"],"word":"并且"},{"definition":["to express\/to show\/to say\/to state\/to indicate\/to mean"],"pinyin":["biao3 shi4"],"word":"表示"},{"definition":["even\/so much so that"],"pinyin":["shen4 zhi4"],"word":"甚至"},{"definition":["at the same time\/meanwhile"],"pinyin":["yu3 ci3 tong2 shi2"],"word":"与此同时"},{"definition":["once\/already\/former\/previously\/ever\/(past tense marker used before verb or clause)"],"pinyin":["ceng2 jing1"],"word":"曾经"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["after the event\/in hindsight\/in retrospect"],"pinyin":["shi4 hou4"],"word":"事后"},{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge","to combine\/to amalgamate","variant of 並|并[bing4]"],"pinyin":["bing4","bing4","bing4"],"word":"并"}]}