{"definition":["(military) commander-in-chief\/(sports) team manager\/coach"],"pinyin":["zhu3 shuai4"],"traditional":["主帥"],"rank":3235.0,"normalized_rank":0.045261847131084464,"fraction":0.00004405969722760268,"cumulative_fraction":0.8015067506427294,"word":"主帅","characters":[{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["surname Shuai","handsome\/graceful\/smart\/commander in chief\/(coll.) cool!\/sweet!"],"pinyin":["Shuai4","shuai4"],"word":"帅"}],"containing_words":[],"sentences":[{"english":"Dunga had been in charge of his country since 2006, succeeding Carlos Alberto Parreira.","chinese":"邓加在06年取代佩雷拉成为国家队主帅至今。"},{"english":"That Manlian camp of yours has been waiting too long for you as its general.","chinese":"你们的曼利安军营等待你当他们的主帅已久。"},{"english":"He is our manager now and we have to go out and fight for him.","chinese":"现在他是我们的主帅，我们将与他一起战斗。"},{"english":"The Gunners manager has openly admitted his frustration with Domenech's decision making.","chinese":"这位枪手主帅公开承认他曾对多梅内克决定感到不满。"},{"english":"Former Italy coach Marcello Lippi is a big fan of Massimiliano Allegri.","chinese":"前意大利主帅里皮是阿莱格里的大粉丝。"},{"english":"Commander in Chief confidence Man Manbing said that Durante will return the young vanguard position.","chinese":"主帅信心满满并称杜兰特将回归小前锋位置。"},{"english":"As is always the case when Liverpool meet Chelsea, much is being made of the tactical battle between the two managers.","chinese":"当利物浦碰切尔西，总是会成为两名主帅的战术之争。"},{"english":"These are played every Tuesday. National team line-up is always set by its national coach.","chinese":"每周二举行，国家队参赛阵容由国家队主帅设置。"},{"english":"The manager is also keen to have the option of Eboué for midfield duties.","chinese":"这位主帅还渴望埃布埃能够复出为中场提供选择。"},{"english":"United's Reserves provided a fitting send-off for departing manager Ole Gunnar Solskjaer, hammering Newcastle United at Moss Lane.","chinese":"曼联预备队用主场大胜纽卡来为主帅索尔斯克亚送行。"},{"english":"But Blues boss Jose Mourinho has yet to give his permission for the sale.","chinese":"但是蓝军主帅穆里尼奥对这桩交易亮了绿灯。"},{"english":"Arsenal boss Wenger will also not face any punishment for confronting ref Andre Marriner at the end of Sunday's game.","chinese":"赛后质疑主裁的阿森纳主帅温格也不会面临任何处罚。"},{"english":"I don't think the players are in any position to question who the manager picks.","chinese":"我不认为球员应该对主帅的选人提出疑问。"},{"english":"Brazil coach Denga has highlighted the Netherlands' rapid counter-attacks.","chinese":"巴西主帅邓加特意强调了荷兰快速反击的打法。"},{"english":"It is the only thing that matters - Harry Redknapp is well aware of that.","chinese":"这是热刺主帅雷德克纳普目前最重视的比赛。"},{"english":"We are all in it together, the owners the management, the players and the supporters.","chinese":"我们都团结在一起，老板，主帅，球员，球迷。"}],"related":[{"definition":["to teach\/to be a teacher\/to train\/to coach"],"pinyin":["zhi2 jiao4"],"word":"执教"},{"definition":["sports team (basketball, soccer, football etc)"],"pinyin":["qiu2 dui4"],"word":"球队"},{"definition":["sports club member\/footballer, golfer etc"],"pinyin":["qiu2 yuan2"],"word":"球员"},{"definition":["sporting coach\/military drill master (in Song times)"],"pinyin":["jiao4 tou2"],"word":"教头"},{"definition":["instructor\/sports coach\/trainer\/CL:個|个[ge4],位[wei4],名[ming2]"],"pinyin":["jiao4 lian4"],"word":"教练"},{"definition":["rear guard\/backfield\/fullback"],"pinyin":["hou4 wei4"],"word":"后卫"},{"definition":["vanguard\/front line\/a forward (sports)"],"pinyin":["qian2 feng1"],"word":"前锋"},{"definition":["commander-in-chief, the equivalent of king in Chinese chess"],"pinyin":["jiang4 shuai4"],"word":"将帅"},{"definition":["Kohl (name)\/Helmut Kohl (1930-2017), German CDU politician, Chancellor 1982-1998"],"pinyin":["Ke1 er3"],"word":"科尔"},{"definition":["middle period of a tripartite provincial exam (in former times)\/midfield\/mid-court (in sports)\/half-time\/intermission half-way through a performance"],"pinyin":["zhong1 chang3"],"word":"中场"},{"definition":["Chinese Football Association","soccer association\/soccer federation\/abbr. for 足球協會|足球协会[zu2 qiu2 xie2 hui4]"],"pinyin":["Zu2 xie2","zu2 xie2"],"word":"足协"},{"definition":["Dunga (1963-), former Brazilian soccer player"],"pinyin":["Deng4 jia1"],"word":"邓加"},{"definition":["external help\/foreign aid"],"pinyin":["wai4 yuan2"],"word":"外援"},{"definition":["midfielder\/center (basketball)\/center forward (hockey, football)"],"pinyin":["zhong1 feng1"],"word":"中锋"},{"definition":["(in classical literature) young military officer of high rank for his age\/(during the Cultural Revolution) young militant in the Red Guard\/(in modern usage) rising star (in sport, politics etc)"],"pinyin":["xiao3 jiang4"],"word":"小将"},{"definition":["Manchester City football team"],"pinyin":["Man4 cheng2 dui4"],"word":"曼城队"}]}