{"definition":["anchor (TV)"],"pinyin":["zhu3 bo1"],"traditional":["主播"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"主播","characters":[{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["to sow\/to scatter\/to spread\/to broadcast\/Taiwan pr. [bo4]"],"pinyin":["bo1"],"word":"播"}],"containing_words":[{"definition":["newsreader\/anchor"],"pinyin":["xin1 wen2 zhu3 bo1"],"word":"新闻主播"}],"sentences":[{"english":"I heard that the anchorman of the DBD TV network's evening news got fired.","chinese":"我听说DBD电视网的晚间新闻主播被炒鱿鱼。"},{"english":"North Korea's state television newscaster announced such propaganda will not be tolerated.","chinese":"北韩国营电视台新闻主播宣布这种宣传不会被容忍。"},{"english":"This tape, work of former Raccoon 7 anchorwoman Terri Morales.","chinese":"这盘带子，是前浣熊市7频道主播泰瑞莫拉斯拍摄的。"},{"english":"Then one thing led to another and now I am a news anchor myself.","chinese":"就这样，机缘巧合的，我就当上了新闻主播。"},{"english":"Yellow Ying, the new Chinese television station Cantonese news host broadcasts concurrently reporter.","chinese":"黄颖，新唐人电视台粤语新闻主播兼记者。"},{"english":"DJ – The most handsome was Ah Loke, most beautiful was Xiao Lan.","chinese":"电台主播，最帅的是阿陆，最漂亮的是沈小岚。"},{"english":"Radio and television anchors usually appear on more than one newscast per day.","chinese":"广播电视的主播通常要在每天的新闻节目中多次出现。"},{"english":"The news anchor has an oval face, and is very cameragenic.","chinese":"这位新闻主播有张瓜子脸，在镜头前很上相。"},{"english":"I heard that BCB's evening news anchor was canned.","chinese":"电视网的晚间新闻主播被炒鱿鱼。"},{"english":"BIGTV masters star broadcaster, Ann in yong.","chinese":"BIGTV当家明星主播，安在勇。"},{"english":"The anchorman of the BBC network's evening news got fired.","chinese":"听说BBC电视网的晚间新闻主播被炒了鱿鱼。"},{"english":"Ying Wong, an anchor and reporter of Cantonese from New Chinese TV station.","chinese":"黄颖，新唐人电视台粤语新闻主播兼记者。"},{"english":"But only one newscaster is the host.","chinese":"但是只有一个新闻播音员主播。"},{"english":"The news anchor recaps the headlines at the end of the news broadcast.","chinese":"新闻主播在新闻的最后把主要内容概述一下。"}],"related":[{"definition":["(coll.) eye tooth (maxillary canine tooth)"],"pinyin":["hu3 ya2"],"word":"虎牙"},{"definition":["live broadcast (not recorded)\/direct Internet broadcasting\/(agriculture) direct seeding"],"pinyin":["zhi2 bo1"],"word":"直播"},{"definition":["(of two people in different locations) to sing or otherwise perform together using communications technology"],"pinyin":["lian2 mai4"],"word":"连麦"},{"definition":["video gaming (as a sport)\/e-sports (abbr. for 電子競技|电子竞技[dian4 zi3 jing4 ji4])"],"pinyin":["dian4 jing4"],"word":"电竞"},{"definition":["(video games) PlayerUnknown's Battlegrounds (PUBG)\/battle royale game\/last-man-standing game\/to play PUBG (or similar game)\/to win at PUBG (or similar game)"],"pinyin":["chi1 ji1"],"word":"吃鸡"},{"definition":["player (of a game)\/enthusiast (audio, model planes etc)"],"pinyin":["wan2 jia1"],"word":"玩家"},{"definition":["obscenities\/lewd talk"],"pinyin":["sao1 hua4"],"word":"骚话"},{"definition":["bean vermicelli\/mung bean starch noodles\/Chinese vermicelli\/cellophane noodles\/CL:把[ba3]\/fan (loanword)\/enthusiast for sb or sth"],"pinyin":["fen3 si1"],"word":"粉丝"},{"definition":["Kuaishou, Chinese social video sharing app"],"pinyin":["Kuai4 shou3"],"word":"快手"},{"definition":["to cheat in an online game (abbr. for 開外掛|开外挂[kai1 wai4 gua4])\/(coll.) unbelievably good"],"pinyin":["kai1 gua4"],"word":"开挂"},{"definition":["barrage (military)\/\"bullet screen\", function which allows viewers to post on-screen comments in videos, movies etc in real time\/danmaku (video game subgenre)"],"pinyin":["dan4 mu4"],"word":"弹幕"},{"definition":["(slang) anti-fan"],"pinyin":["hei1 fen3"],"word":"黑粉"},{"definition":["Internet celebrity"],"pinyin":["wang3 luo4 hong2 ren2"],"word":"网络红人"},{"definition":["self-media (news or other content published on independently-operated social media accounts)"],"pinyin":["zi4 mei2 ti3"],"word":"自媒体"},{"definition":["to transmit\/to broadcast"],"pinyin":["bo1 yin1"],"word":"播音"},{"definition":["attached externally (e.g. fuel tank)\/plug-in\/add-on\/special software used to cheat in an online game"],"pinyin":["wai4 gua4"],"word":"外挂"}]}