{"definition":["main\/principal\/major\/primary"],"pinyin":["zhu3 yao4"],"traditional":["主要"],"rank":153.0,"normalized_rank":0.0021406685041903935,"fraction":0.0007454798586571568,"cumulative_fraction":0.3624307538576767,"word":"主要","characters":[{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["to demand\/to request\/to coerce","important\/vital\/to want\/to ask for\/will\/going to (as future auxiliary)\/may\/must\/(used in a comparison) must be\/probably\/if"],"pinyin":["yao1","yao4"],"word":"要"}],"containing_words":[],"sentences":[{"english":"It was easily good enough for pole so that was the main thing.","chinese":"那一圈跑得不错，足以使我获得杆位，那是最主要的。"},{"english":"Reductions in staffing at the major banks.","chinese":"在裁减人员时的主要银行。"},{"english":"The dissertation consists of introduction and four parts.","chinese":"全文分为绪论和四个主要章节。"},{"english":"The first part: to discuss the main concepts and characteristics of commercial subject.","chinese":"本文第一章，主要介绍商主体的概念和特征。"},{"english":"Now she is a teacher of Diligent Education, teaching middle school students, mainly engaged in teaching English.","chinese":"现是用心教育中学部老师，主要从事英语的教学。"},{"english":"Madame Defarge was one of the leading spirits of the Revolution.","chinese":"迪法热夫人是这场革命的主要人物之一。"},{"english":"The main difficulty of off-line handwritten signature verification is feature extraction.","chinese":"离线手写签名鉴别的主要困难在于签名特征的提取。"},{"english":"The new premier is forming his government mainly from young men.","chinese":"这位新总理主要从年轻人中物色人选组建政府。"},{"english":"The government brought two hundred eighty-five charges against him, mostly for murder.","chinese":"政府对他提出二百八十五费，主要用于谋杀。"},{"english":"The sources of Chinese medicine are mainly floras, also includes animals and mineral.","chinese":"中药的来源主要是植物，也有一些动物和矿物。"},{"english":"The main reason of death was hemorrhagic shock.","chinese":"失血性休克是死亡的主要原因。"},{"english":"The geology effect of 3-D seismic exploration in HK area, Jianghan region is presented in this paper.","chinese":"本文主要介绍江汉HK地区三维地震勘探的地质效果。"},{"english":"IntroductionThe centrosome is the major microtubule organizing center ( MTOC) of mammalian cells.","chinese":"中心体是哺乳类细胞主要的微管组织中心。"},{"english":"Ensure compliance to Crowne Plaza Keys mandatories and implementation of new standards.","chinese":"确保编辑皇冠假日主要条款并执行新标准。"},{"english":"But this kind of catabolism mainly concentrates on the banana skin.","chinese":"而这种分解代谢主要集中在香蕉皮上。"},{"english":"Loess is widely distributed in China, and it mainly lies in the central and western regions.","chinese":"黄土在我国分布广泛，而且主要分布在中西部地区。"}],"related":[{"definition":["next\/secondly"],"pinyin":["qi2 ci4"],"word":"其次"},{"definition":["for the most part\/many\/most\/the greater part\/mostly"],"pinyin":["da4 duo1"],"word":"大多"},{"definition":["cause\/origin\/root cause\/reason\/CL:個|个[ge4]"],"pinyin":["yuan2 yin1"],"word":"原因"},{"definition":["to concentrate\/to centralize\/to focus\/centralized\/concentrated\/to put together"],"pinyin":["ji2 zhong1"],"word":"集中"},{"definition":["to rely mainly on\/to attach most importance to"],"pinyin":["wei2 zhu3"],"word":"为主"},{"definition":["the most important\/of chief importance"],"pinyin":["shou3 yao4"],"word":"首要"},{"definition":["important point\/main point\/focus\/key (project etc)\/to focus on\/to put the emphasis on","to recount (e.g. results of election)\/to re-evaluate"],"pinyin":["zhong4 dian3","chong2 dian3"],"word":"重点"},{"definition":["first (of all)\/in the first place"],"pinyin":["shou3 xian1"],"word":"首先"},{"definition":["on the one hand"],"pinyin":["yi1 fang1 mian4"],"word":"一方面"},{"definition":["purpose\/aim\/goal\/target\/objective\/CL:個|个[ge4]"],"pinyin":["mu4 di4"],"word":"目的"},{"definition":["to put emphasis on\/to stress"],"pinyin":["zhuo2 zhong4"],"word":"着重"},{"definition":["in large part\/the greater part\/the majority"],"pinyin":["da4 bu4 fen5"],"word":"大部分"},{"definition":["to comprise\/to include\/to involve\/to incorporate\/to consist of"],"pinyin":["bao1 kuo4"],"word":"包括"},{"definition":["part\/share\/section\/piece\/CL:個|个[ge4]"],"pinyin":["bu4 fen5"],"word":"部分"},{"definition":["due to\/as a result of\/thanks to\/owing to\/since\/because"],"pinyin":["you2 yu2"],"word":"由于"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"}]}