{"definition":["for example"],"pinyin":["ju3 li4 lai2 shuo1"],"traditional":["舉例來說"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"举例来说","characters":[{"definition":["to lift\/to hold up\/to cite\/to enumerate\/to act\/to raise\/to choose\/to elect\/act\/move\/deed","variant of 舉|举[ju3]"],"pinyin":["ju3","ju3"],"word":"举"},{"definition":["example\/precedent\/rule\/case\/instance"],"pinyin":["li4"],"word":"例"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"来"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)","variant of 說|说[shuo1]"],"pinyin":["shui4","shuo1","shuo1"],"word":"说"}],"containing_words":[],"sentences":[{"english":"For example, my mispronunciation of her name could have been a fatal mistake.","chinese":"举例来说，我念错她的姓名可能是最大的错误。"},{"english":"For example, one week you might bring in muffins for no reason.","chinese":"举例来说，这周你可以从家带些松饼与同事分享。"},{"english":"Painting with watercolors is quite different from painting with oils, for example.","chinese":"举例来说，水彩画和油画有很大不同。"},{"english":"Shiites are largely barred from the police force, for example, and from the military.","chinese":"举例来说，什叶派基本不能担任警察或者进入军队。"},{"english":"Turnitin, for example, is a Web site that offers a service to identify papers that contain copied material.","chinese":"举例来说，即网站提供对含有复制材料的鉴定服务。"},{"english":"Think back, for example, to how we used to buy music.","chinese":"举例来说，回想我们以前是如何购买音乐唱片的呢。"},{"english":"For instance, can you describe accurately the faces of five good friends?","chinese":"举例来说，你能准确地描绘出五个好朋友的脸形吗？"},{"english":"For example, the word \"shampoo\" for soap for the hair came from India.","chinese":"举例来说，单词“洗发水”为肥皂，毛将焉来自印度。"},{"english":"For example, consider the task of resending a message.","chinese":"举例来说，考虑重发一个消息的任务。"},{"english":"Car-owners, for example, pay no car or road tax.","chinese":"举例来说，当前车主不需要缴纳车税或路税。"},{"english":"For example, children could rinse out their wet nightclothes .","chinese":"上面举例来说，孩子可以清洗外面的他们湿气睡衣。"},{"english":"For instance, find the common ground between your needs and their wants.","chinese":"举例来说，找到您的需求和他们的愿望的共同点。"},{"english":"The odds of getting endometritis, for example, can be reduced by spaying.","chinese":"的几率越来越子宫内膜炎，举例来说，可以减少喷涂。"},{"english":"The food on some high-speed trains, for instance, could certainly be made better, he said.","chinese":"举例来说，在一些高铁上的食物当然可能作得更好。"},{"english":"For example, last year the Russian air force took possession of one new aircraft.","chinese":"举例来说，去年俄空军得到了一种新型战机。"},{"english":"As an example, research on rapeseed has shown great potential for improved yield and profit.","chinese":"举例来说，油菜研究表明了巨大的增产增收潜力。"}],"related":[]}