{"definition":["the Righteous and Harmonious Fists\/the Boxers (history)"],"pinyin":["Yi4 he2 tuan2"],"traditional":["義和團"],"rank":43639.0,"normalized_rank":0.6105662278063044,"fraction":2.722482740975035e-7,"cumulative_fraction":0.9976724622101212,"word":"义和团","characters":[{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["yi4","Yi4"],"word":"义"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["dumpling","round\/lump\/ball\/to roll into a ball\/to gather\/regiment\/group\/society\/classifier for a lump or a soft mass: wad (of paper), ball (of wool), cloud (of smoke)"],"pinyin":["tuan2","tuan2"],"word":"团"}],"containing_words":[{"definition":["Boxer Rebellion"],"pinyin":["Yi4 he2 tuan2 Yun4 dong4"],"word":"义和团运动"}],"sentences":[{"english":"The incident of Yihetuan (anti-imperialist organization at the end of 19th century) is historical, but also modern.","chinese":"义和团事件是历史的，也是现代的。"},{"english":"The Boxer Band tunes in to historyThe Boxers’ negative image in the West is of little concern.","chinese":"当地毫不在意义和团在西方人眼中的负面形象。"},{"english":"The Boxer episode is commonly portrayed in the West as an orgy of anti-foreign violence.","chinese":"在西方，义和团被视作反西方的暴力狂欢。"},{"english":"Mao Zedong's Red Guards sometimes called themselves “new Boxers”.","chinese":"红卫兵有时自称“新义和团”。"},{"english":"During the uprising, the Plum Flower Boxers renamed themselves the “Righteous and Harmonious Fists”.","chinese":"在义和团运动中，梅花拳更名为“义和拳”。"},{"english":"Ever since the uprising, memories of it have troubled the relationship between China and the West.","chinese":"对义和团运动的历史记忆一直困扰着中西关系。"},{"english":"Trigram of Taoism doctrine had been largely used in the Boxers' notices.","chinese":"道教教义中的八卦在义和团揭帖中多有使用。"},{"english":"The Boxer Rebellion has an important influence on the sea transportation of tribute grain in the Late Qing Dynasty.","chinese":"义和团运动对晚清的漕粮运输产生了重大影响。"},{"english":"In summer 1900, China was convulsed by Boxer attacks on these groups.","chinese":"在1900年夏，义和团的抵抗运动震撼了中国。"},{"english":"A second series of destruction followed when eight allied armies put down the Boxer Movement in 1900.","chinese":"第二次浩劫是1900年的八国联军镇压义和团运动。"},{"english":"Mao Zedong’s Red Guards sometimes called themselves “new Boxers”.","chinese":"红卫兵有时自称“新义和团”。"}],"related":[{"definition":["the Righteous and Harmonious Fists\/the Boxers (history)"],"pinyin":["Yi4 he2 quan2"],"word":"义和拳"},{"definition":["Boxer Rebellion"],"pinyin":["Yi4 he2 tuan2 Yun4 dong4"],"word":"义和团运动"},{"definition":["Support the Qing, annihilate the West! (Boxer rebellion slogan)"],"pinyin":["fu2 Qing1 mie4 yang2"],"word":"扶清灭洋"},{"definition":["Eight-Nation Alliance, involved in a military intervention in northern China in 1900"],"pinyin":["Ba1 guo2 Lian2 jun1"],"word":"八国联军"},{"definition":["Nian Army, leading a peasant rebellion against the Qing dynasty in Shandong, Henan, Jiangsu and Anhui 1851-1868, at the same time as the Taiping Rebellion further south"],"pinyin":["Nian3 jun1"],"word":"捻军"},{"definition":["the Qing court (as government of China)"],"pinyin":["Qing1 ting2"],"word":"清廷"},{"definition":["north China army, a modernizing Western-style army set up during late Qing, and a breeding ground for the Northern Warlords after the Qinghai revolution"],"pinyin":["Bei3 yang2 jun1"],"word":"北洋军"},{"definition":["foreign religion (esp. Western Christianity in Qing China)"],"pinyin":["yang2 jiao4"],"word":"洋教"},{"definition":["the crisis year of 1900 involving the Boxer uprising and the eight nation military invasion"],"pinyin":["geng1 zi3 guo2 bian4"],"word":"庚子国变"},{"definition":["Qing government (1644-1911)"],"pinyin":["Qing1 zheng4 fu3"],"word":"清政府"},{"definition":["Great Sword Society, an offshoot of the White Lotus in the late Qing dynasty, involved in anti-Western activity at the time of the Boxer rebellion"],"pinyin":["da4 dao1 hui4"],"word":"大刀会"},{"definition":["Taiping Heavenly Kingdom (1851-1864)"],"pinyin":["Tai4 ping2 Tian1 guo2"],"word":"太平天国"},{"definition":["Manchu Restoration of 1917, an attempt by general 張勳|张勋[Zhanɡ1 Xun1] to reinstate the monarchy in China by restoring the abdicated emperor Puyi 溥儀|溥仪[Pu3 yi2] to the throne"],"pinyin":["Zhang1 Xun1 Fu4 bi4"],"word":"张勋复辟"},{"definition":["the Northern Warlords (1912-1927)"],"pinyin":["Bei3 yang2 Jun1 fa2"],"word":"北洋军阀"},{"definition":["invading army"],"pinyin":["qin1 lu:e4 jun1"],"word":"侵略军"},{"definition":["the Qing army"],"pinyin":["Qing1 jun1"],"word":"清军"}]}