{"definition":["to take the opportunity\/to take a plane"],"pinyin":["cheng2 ji1"],"traditional":["乘機"],"rank":12416.0,"normalized_rank":0.1737159486799211,"fraction":0.000005786845084060714,"cumulative_fraction":0.9463949574237124,"word":"乘机","characters":[{"definition":["four horse military chariot (archaic)\/four (archaic)\/generic term for history books","to ride\/to mount\/to make use of\/to avail oneself of\/to take advantage of\/to multiply (math.)\/Buddhist sect or creed","surname Cheng","old variant of 乘[cheng2]"],"pinyin":["sheng4","cheng2","Cheng2","cheng2"],"word":"乘"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["ji1","Ji1"],"word":"机"}],"containing_words":[],"sentences":[{"english":"Hackers have already attacked several European Web sites using the unpatched exploit.","chinese":"该漏洞尚为被修补，黑客已乘机攻击了数个欧洲网站。"},{"english":"Please be advised that I will have a five-day business trip to Chicago effective from today night.","chinese":"特此通知，小弟将于今晚乘机远赴芝加哥公干五天。"},{"english":"At this moment the young man returned; Danglars withdrew.","chinese":"这时，那青年人回来了，腾格拉尔便乘机溜走了。"},{"english":"Lin Lei saw the opportunity to ridicule Bai righteousness, want him to hold.","chinese":"林磊看准机会乘机奚落柏义，要他来执筹码。"},{"english":"This card shall be produced when making reservation and boarding.","chinese":"请在定座和乘机时出示此卡。"},{"english":"I''m due to fly back to the States on Friday.","chinese":"我预定星期五乘机返美。"},{"english":"You should check in at Counter No. 18.","chinese":"您乘坐的航班在值机18号柜台办理乘机手续。"},{"english":"Check-in counter usually be closed at least 30 minutes before flight departure.","chinese":"通常在飞机离站前30分钟停止办理乘机手续。"},{"english":"Would you please check in your flight at the check-in counter .","chinese":"请您到值机柜台办理所乘航班的乘机手续。"},{"english":"Although we are knocked wing, but took the opportunity to screw McCarran opened the aircraft fuel tank.","chinese":"虽然被打落机翼，麦卡伦却乘机拧开了飞机油箱。"},{"english":"\"flew out on behalf of Chen Yun-yin, a\" Hydrangea.","chinese":"陈云贤代表乘机抛出了一个“绣球”。"},{"english":"He tried in a hundred ways to convey his own feelings, casting arch glances at them.","chinese":"他乘机百般撩拨，眉目传情。"},{"english":"Then Hampton makes a mistake and the suspect is able to capture her.","chinese":"然后，杰西犯了个错，嫌犯乘机俘虏了她。"},{"english":"ZhuangZhuoYuan also to care about his towers and sister relationship status of the cold war.","chinese":"庄卓源亦乘机关心瀚韬与姐姐恋情的冷战状况。"},{"english":"Then Qi's crack troops rushed out from the gates to attack the now terrified and utterly confused troops.","chinese":"而齐国的精锐部队也乘机冲出城门，大肆进攻。"},{"english":"Screeners took the opportunity to seriously explain use of false will be severely punished.","chinese":"安检员严肃地说明使用假证乘机将会受到严厉的处罚。"}],"related":[{"definition":["to seize an opportunity\/to take advantage of situation"],"pinyin":["chen4 ji1"],"word":"趁机"},{"definition":["to seize the opportunity"],"pinyin":["jie4 ji1"],"word":"借机"},{"definition":["to take advantage of a favorable situation\/to seize an opportunity"],"pinyin":["chen4 shi4"],"word":"趁势"},{"definition":["to wait for an opportunity\/to watch for one's chance"],"pinyin":["si4 ji1"],"word":"伺机"},{"definition":["to seize an opportunity\/to exploit (a loophole)"],"pinyin":["cheng2 xi4"],"word":"乘隙"},{"definition":["to look for an opportunity"],"pinyin":["xun2 ji1"],"word":"寻机"},{"definition":["to attempt\/to try\/attempt\/CL:種|种[zhong3]"],"pinyin":["qi3 tu2"],"word":"企图"},{"definition":["old variant of 趁[chen4]","to avail oneself of\/to take advantage of"],"pinyin":["chen4","chen4"],"word":"趁"},{"definition":["to loot a burning house\/to profit from sb's misfortune (idiom)"],"pinyin":["chen4 huo3 da3 jie2"],"word":"趁火打劫"},{"definition":["unprepared\/off guard"],"pinyin":["bu4 bei4"],"word":"不备"},{"definition":["to have an opportunity that one can exploit (idiom)"],"pinyin":["you3 ji1 ke3 cheng2"],"word":"有机可乘"},{"definition":["to seize the opportunity\/to strike while the iron is hot"],"pinyin":["cheng2 shi4"],"word":"乘势"},{"definition":["to enter by exploiting a weak spot (idiom); to take advantage of a lapse"],"pinyin":["cheng2 xu1 er2 ru4"],"word":"乘虚而入"},{"definition":["usual trick\/old tactics"],"pinyin":["gu4 ji4"],"word":"故伎"},{"definition":["to take advantage of sb's misfortune\/to loot"],"pinyin":["cheng2 huo3 da3 jie2"],"word":"乘火打劫"},{"definition":["to seize"],"pinyin":["xie2 chi2"],"word":"挟持"}]}