{"definition":["second party (law)\/see also 甲方[jia3 fang1]"],"pinyin":["yi3 fang1"],"traditional":["乙方"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"乙方","characters":[{"definition":["second of the ten Heavenly Stems 十天干[shi2 tian1 gan1]\/second in order\/letter \"B\" or Roman \"II\" in list \"A, B, C\", or \"I, II, III\" etc\/second party (in legal contract, usually 乙方[yi3 fang1], as opposed to 甲方[jia3 fang1])\/ethyl\/bent\/winding\/radical in Chinese characters (Kangxi radical 5)\/ancient Chinese compass point: 105°","turning stroke (in Chinese characters)\/see also 折[zhe2]"],"pinyin":["yi3","zhe2"],"word":"乙"},{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["fang1","Fang1"],"word":"方"}],"containing_words":[],"sentences":[{"english":"All arbitration fees will be borne by Party B and be paid in advance.","chinese":"涉及仲裁费用，全部由乙方承担并预交。"},{"english":"Party B shall still have the ownership of the equipment until Party B is paid in full.","chinese":"甲方未付清全款前，设备的所有权仍归乙方所有。"},{"english":"The charge of water is settled and paid to the actual usage each month.","chinese":"乙方使用的自来水费按实结算，每月支付甲方。"},{"english":"The undermentioned project is consigned by Party A to Party B.","chinese":"本工程由甲方委托乙方总承包及施工。"},{"english":"B is responsible for staging the pick to go abroad and accommodation arrangements and costs.","chinese":"负责乙方出国集结地的接机和食宿安排和费用。"},{"english":"Party B will not transfer the lease of the premises or sub without Party A's approval.","chinese":"未经甲方同意，乙方不得将承租的房屋转租或分租。"},{"english":"Part B shall guarantee that the machines to be provided are in accordance with Part A's requirements and specifications.","chinese":"乙方保证其供给的机器符合甲方的要求和规格。"},{"english":"The components and auxiliary materials, etc, supplied by party bare to be shipped from Japan to Henna.","chinese":"收乙方提供的元件和辅助材料等将从日本装运至河南。"},{"english":"UL-STR shall not be held responsible for these risks, which are out of its control.","chinese":"乙方不对此等超出乙方控制范围的风险负有责任。"},{"english":"UL-STR shall not be held responsible for these risks, which are out of its control.","chinese":"乙方不对此等超出乙方控制范围的风险负有责任。"},{"english":"III Party A shall issue invoices fulfilling with requirements of Party B and other departments.","chinese":"甲方开具满足乙方及相关部门要求的发票。"},{"english":"The State regulation shall apply during Employee's sick leave and medical treatment period.","chinese":"乙方患病或非因工负伤的医疗期限，按国家规定确定。"},{"english":"III. Party A guarantees that they will provide complete and high quality service, to satisfy the customers.","chinese":"甲方保证为乙方提供全面优质服务，使客人达到满意。"},{"english":"Sixth, like the second party changes for some reason, the first party does not return the rent.","chinese":"如乙方因故变动，甲方不退还租金。"},{"english":"Party B causes great loss to Party A due to its breach of duty and jobbery.","chinese":"乙方严重失职，营私舞弊，给甲方利益造成重大损失。"},{"english":"Party B agrees that the expiration of this license shall not discharge party B from its obligation.","chinese":"乙方同意在许可证到期时并不免除乙方应尽义务。"}],"related":[{"definition":["first party (law)\/see also 乙方[yi3 fang1]"],"pinyin":["jia3 fang1"],"word":"甲方"},{"definition":["borrower\/leaser\/the hiring side of a contract"],"pinyin":["cheng2 zu1 fang1"],"word":"承租方"},{"definition":["contractor"],"pinyin":["cheng2 bao1 ren2"],"word":"承包人"},{"definition":["parties to a contract (law)"],"pinyin":["he2 tong5 ge4 fang1"],"word":"合同各方"},{"definition":["performance bond (international trade)"],"pinyin":["lu:3 yue1 bao3 zheng4 jin1"],"word":"履约保证金"},{"definition":["labor contract\/contract between employer and employees governing wages and conditions"],"pinyin":["lao2 dong4 he2 tong5"],"word":"劳动合同"},{"definition":["debtor"],"pinyin":["zhai4 wu4 ren2"],"word":"债务人"},{"definition":["service contract"],"pinyin":["lao2 wu4 he2 tong5"],"word":"劳务合同"},{"definition":["leaser\/tenant"],"pinyin":["cheng2 zu1 ren2"],"word":"承租人"},{"definition":["cost"],"pinyin":["jia4 kuan3"],"word":"价款"},{"definition":["guarantor\/bailor"],"pinyin":["bao3 zheng4 ren2"],"word":"保证人"},{"definition":["contract\/protocol"],"pinyin":["xie2 yi4 shu1"],"word":"协议书"},{"definition":["to agree on sth (after discussion)\/to conclude a bargain\/to arrange\/to promise\/to stipulate\/to make an appointment\/stipulated (time, amount, quality etc)\/an arrangement\/a deal\/appointment\/undertaking\/commitment\/understanding\/engagement\/stipulation"],"pinyin":["yue1 ding4"],"word":"约定"},{"definition":["(law) client\/trustor"],"pinyin":["wei3 tuo1 ren2"],"word":"委托人"},{"definition":["seller (in contracts)"],"pinyin":["mai4 fang1"],"word":"卖方"},{"definition":["complainant\/plaintiff"],"pinyin":["yuan2 gao4"],"word":"原告"}]}