{"definition":["in other words\/that is to say\/so\/thus"],"pinyin":["ye3 jiu4 shi4 shuo1"],"traditional":["也就是說"],"rank":3287.0,"normalized_rank":0.045989394596560935,"fraction":0.000043017562949435337,"cumulative_fraction":0.8037697863204717,"word":"也就是说","characters":[{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["is\/are\/am\/yes\/to be","variant of 是[shi4]\/(used in given names)"],"pinyin":["shi4","shi4"],"word":"是"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)","variant of 說|说[shuo1]"],"pinyin":["shui4","shuo1","shuo1"],"word":"说"}],"containing_words":[],"sentences":[{"english":"In other words, \"turtle\" and wife must be unchaste .","chinese":"也就是说，“龟”的老婆一定是不贞洁的。"},{"english":"In other words, Liu's ancestors may be willing to belong to the Xiongnu tribe.","chinese":"也就是说，刘仁愿的祖上有可能属于匈奴族。"},{"english":"This is when you start laying the foundation for what comes next.","chinese":"这也就是说你该开始为以后打基础了。"},{"english":"That is, he was speaking Chinglish.","chinese":"也就是说，他在说中式英语。"},{"english":"The coding procedure can be repeated up to 4 times for additional remotes.","chinese":"这个程序可以进行4次，也就是说可以配4个遥控器。"},{"english":"So you say the outside door was closed when you got here ?","chinese":"也就是说，当你到这儿的时候，外面的门是锁着的。"},{"english":"That’s right, you can be open-minded and think that others are wrong.","chinese":"也就是说，你可以是敞开心扉地认为其他人是错误的。"},{"english":"In other words, OFHEO wasn't just regulating Fannie Mae, it was out to get Fannie Mae.","chinese":"也就是说，督察局不仅要规范房利美，还要摧毁它。"},{"english":"You cannot use CATALOG to catalog a file that belongs to a different dat abase.","chinese":"也就是说你至少还需要原数据库的控制文件。"},{"english":"In other words, it's not just the information that goes in.","chinese":"也就是说，重要的不仅仅是获得了什么信息。"},{"english":"That said, there's nothing wrong with aggressive self-promotion.","chinese":"也就是说，积极的自我推销是没有错的。"},{"english":"That is to say, we lie to develop level disparately.","chinese":"也就是说，我们处在截然不同的发展阶段。"},{"english":"The only problem is that it's fragile and brittle, and that means it breaks easily.","chinese":"唯一的毛病在于它脆弱而易碎，也就是说很容易坏掉。"},{"english":"That is to say it is confined to the atom.","chinese":"也就是说电子会被束缚在原子内。"},{"english":"In another word, Jesus got the abandon that we deserved.","chinese":"也就是说，耶稣承担了我们当得的离弃。"},{"english":"That is to say, it's a wonderful axis of combination that you're looking at.","chinese":"也就是说，你所看到的是一条了不起的组合轴。"}],"related":[]}