{"definition":["to settle\/to finish\/to conclude\/to wind up"],"pinyin":["liao3 jie2"],"traditional":["了結"],"rank":11925.0,"normalized_rank":0.16684622165013366,"fraction":0.000006171204175588183,"cumulative_fraction":0.9434602138707128,"word":"了结","characters":[{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"},{"definition":["knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)","(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]"],"pinyin":["jie2","jie1"],"word":"结"}],"containing_words":[],"sentences":[{"english":"He has had a bit of trouble, and I have to straighten it out for him.","chinese":"他遇到了点儿麻烦，我得替他把这事了结掉。"},{"english":"You see, Giles, my case is not settled yet .","chinese":"你知道，基尔斯，我的那个案子还没有了结。"},{"english":"He must be in at the finish.","chinese":"事情了结的时候，他一定跑不了。"},{"english":"Others would note that maybe it had something to do with closure.","chinese":"其他人会留意到，这也许与了结一切的心态有关。"},{"english":"They tied the matter up at the meeting.","chinese":"他们在会议上了结了这件事。"},{"english":"This move by the exchange may have been designed to facilitate large-scale liquidations of the metals.","chinese":"该交易所此举或旨在促使金属大规模的了结。"},{"english":"I'm glad my legal difficulties are allover.","chinese":"我很高兴我的法律问题了结了。"},{"english":"Giles, my case is not settled yet .","chinese":"你知道，基尔斯，我的那个案子还没有了结。"},{"english":"Finish old business as quickly and completely as you can. The pace is about to pick up again, with new possibilities.","chinese":"尽快完善地了结旧务，事情伴随新的机会接踵而至。"},{"english":"My friends, this must come to an end.","chinese":"我的朋友们，这必须来个了结。"},{"english":"The whole matter is now sealed up and finished.","chinese":"整个事情现已封锁起来，就此了结了。"},{"english":"Profit-taking towards the end of the session pushed the market lower.","chinese":"尾盘时投资人获利了结，股市下滑。"},{"english":"Down in some lonesome valley, hangin' from a white oak tree.","chinese":"也许在偏僻的山谷里，在一棵白橡树上自我了结。"},{"english":"Young Werther eventually ends his live as the end of the story.","chinese":"少年维特最终以了结生命结束了故事。"},{"english":"And just when I was thinking about putting an end to my life, you show up and drink my poison.","chinese":"刚想了结生命，你又走了过来，还喝了我杯毒酒。"},{"english":"I have been very busy settling up things about the training course.","chinese":"我最近一直忙于了结训练班的事。"}],"related":[{"definition":["to bring to a conclusion\/to settle (a dispute)\/to do away with (oneself)\/to break off (a relationship)\/resolution (of a problem)"],"pinyin":["liao3 duan4"],"word":"了断"},{"definition":["to write off at one stroke"],"pinyin":["yi1 bi3 gou1 xiao1"],"word":"一笔勾销"},{"definition":["to resolve\/to settle"],"pinyin":["liao3 que4"],"word":"了却"},{"definition":["to stop\/to pull back"],"pinyin":["shou1 shou3"],"word":"收手"},{"definition":["lit. quick sword cuts through tangled hemp (idiom); decisive action in a complex situation\/cutting the Gordian knot"],"pinyin":["kuai4 dao1 zhan3 luan4 ma2"],"word":"快刀斩乱麻"},{"definition":["to stop at this point\/to end here\/to call it a day"],"pinyin":["dao4 ci3 wei2 zhi3"],"word":"到此为止"},{"definition":["as the water recedes, the rocks appear (idiom)\/the truth comes to light"],"pinyin":["shui3 luo4 shi2 chu1"],"word":"水落石出"},{"definition":["once the main problem is solved, all troubles are solved\/death ends all one's troubles"],"pinyin":["yi1 liao3 bai3 liao3"],"word":"一了百了"},{"definition":["to avoid a problem by walking away from it\/to quit"],"pinyin":["yi1 zou3 liao3 zhi1"],"word":"一走了之"},{"definition":["to give up"],"pinyin":["ba4 shou3"],"word":"罢手"},{"definition":["hatred and desire for revenge"],"pinyin":["chou2 yuan4"],"word":"仇怨"},{"definition":["to settle (a dispute out of court)\/to reconcile\/settlement\/conciliation\/to become reconciled"],"pinyin":["he2 jie3"],"word":"和解"},{"definition":["already"],"pinyin":["ji4 yi3"],"word":"既已"},{"definition":["to get away\/to escape (from obligations)\/to free oneself\/to disengage"],"pinyin":["tuo1 shen1"],"word":"脱身"},{"definition":["to take revenge and wipe out a grudge (idiom)"],"pinyin":["bao4 chou2 xue3 hen4"],"word":"报仇雪恨"},{"definition":["to be even\/to be quits\/to be even-steven"],"pinyin":["liang3 bu4 xiang1 qian4"],"word":"两不相欠"}]}