{"definition":["to understand\/to realize\/to find out","to understand\/to realize\/to find out"],"pinyin":["liao3 jie3","liao3 jie3"],"traditional":["了解","瞭解"],"rank":201.0,"normalized_rank":0.0028122507800148306,"fraction":0.0005799837092851427,"cumulative_fraction":0.3937772004409347,"word":"了解","characters":[{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"},{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","to transport under guard","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","surname Xie"],"pinyin":["xie4","jie4","jie3","Xie4"],"word":"解"}],"containing_words":[],"sentences":[{"english":"However, Toni, who knows Ribery well, believes the Bianconeri should sign him.","chinese":"然而托尼很了解里贝里，并且相信尤文会签下他。"},{"english":"I know him quite well, and there are wheels within wheels.","chinese":"我很了解他，那里的人事关系很复杂。"},{"english":"But first, we need to know some terminology.","chinese":"不过，我们首先需要了解一些术语。"},{"english":"You want to know more about Ili?","chinese":"你想更多地了解伊犁啊？"},{"english":"Learn how Montessori teaches mathematics in this free video clip.","chinese":"了解如何在这个自由蒙台梭利教数学的视频剪辑。"},{"english":"Acute toxicity test, mutation test and single-cell gel electrophoresis(SCGE)were used.","chinese":"了解三氯乙醛的毒性和致突变作用。"},{"english":"Some evidence is available to aid our understanding of the biogenesis of membrane of microbodies in plants.","chinese":"有些证据有助于我们了解植物微体膜的生物发生。"},{"english":"We've learned more general things about parametric equations of curves.","chinese":"我们还了解了，曲线参数方程更一般的性质。"},{"english":"You should learn some ABCs of computer.","chinese":"你了解编程的基础知识吗？"},{"english":"Listen to the tape and find out the main idea of this article and how it is organized.","chinese":"通过听录音磁带，来帮助学生对文章的结构有所了解。"},{"english":"ObjectiveTo find out the cause and actualities of pre-hospital care of pedo-burn.","chinese":"目的了解小儿烧伤的致伤因素和院前急救现状。"},{"english":"You can find more information from the Service Directory in your room .","chinese":"您可以从您房间的服务指南中了解更多的资料。"},{"english":"Objective To analyze the in-doors air condition and the factors affecting the air quality of Guangzhou metro.","chinese":"目的了解影响广州地铁室内空气质量的主要因素。"},{"english":"See publication AV-4, Actuated Thermoplastic Valves, for detailed information.","chinese":"参阅“执行机构驱动热塑性阀门”，了解详细资料。"},{"english":"Its authors had detailed knowledge of Siemens’ software and its security weaknesses.","chinese":"笔者已经详细的了解了西门子软件的安全漏洞在哪里。"},{"english":"Objective To understand the needs of the families of hearing-impaired children.","chinese":"目的了解听障儿童家长对康复认知与需求情况。"}],"related":[{"definition":["to introduce (sb to sb)\/to give a presentation\/to present (sb for a job etc)\/introduction"],"pinyin":["jie4 shao4"],"word":"介绍"},{"definition":["to comprehend\/to understand\/comprehension\/understanding"],"pinyin":["li3 jie3"],"word":"理解"},{"definition":["to tell\/to inform\/to let know","to press charges\/to file a complaint"],"pinyin":["gao4 su5","gao4 su4"],"word":"告诉"},{"definition":["to know\/to recognize\/to be familiar with\/to get acquainted with sb\/knowledge\/understanding\/awareness\/cognition"],"pinyin":["ren4 shi5"],"word":"认识"},{"definition":["clear\/distinct\/to understand thoroughly\/to be clear about"],"pinyin":["qing1 chu5"],"word":"清楚"},{"definition":["to clarify\/to fully understand"],"pinyin":["nong4 qing1"],"word":"弄清"},{"definition":["to penetrate deeply\/thorough"],"pinyin":["shen1 ru4"],"word":"深入"},{"definition":["to consult\/to refer to\/to look sth up in a reference source"],"pinyin":["cha2 yue4"],"word":"查阅"},{"definition":["to grasp (often fig.)\/to control\/to seize (initiative, opportunity, destiny)\/to master\/to know well\/to understand sth well and know how to use it\/fluency"],"pinyin":["zhang3 wo4"],"word":"掌握"},{"definition":["detailed\/in detail\/minute"],"pinyin":["xiang2 xi4"],"word":"详细"},{"definition":["to find out\/to know\/to learn about"],"pinyin":["de2 zhi1"],"word":"得知"},{"definition":["to check\/to inquire\/to consult (a document etc)\/inquiry\/query"],"pinyin":["cha2 xun2"],"word":"查询"},{"definition":["to touch\/to contact\/access\/in touch with"],"pinyin":["jie1 chu4"],"word":"接触"},{"definition":["to investigate\/to delve\/to probe\/to enquire into\/to look into"],"pinyin":["tan4 jiu1"],"word":"探究"},{"definition":["variant of 聯繫|联系[lian2 xi4]","connection\/contact\/relation\/to get in touch with\/to integrate\/to link\/to touch"],"pinyin":["lian2 xi4","lian2 xi4"],"word":"联系"},{"definition":["to analyze\/analysis\/CL:個|个[ge4]"],"pinyin":["fen1 xi1"],"word":"分析"}]}