{"definition":["to compete to be first\/to contest first place"],"pinyin":["zheng1 xian1"],"traditional":["爭先"],"rank":24416.0,"normalized_rank":0.3416115176360304,"fraction":0.000001566631891482256,"cumulative_fraction":0.9834021906952666,"word":"争先","characters":[{"definition":["to strive for\/to vie for\/to argue or debate\/deficient or lacking (dialect)\/how or what (literary)"],"pinyin":["zheng1"],"word":"争"},{"definition":["early\/prior\/former\/in advance\/first"],"pinyin":["xian1"],"word":"先"}],"containing_words":[{"definition":["striving to be first and fearing to be last (idiom); outdoing one another"],"pinyin":["zheng1 xian1 kong3 hou4"],"word":"争先恐后"}],"sentences":[{"english":"Should take after the bus , not to vie with each other , not bicheng bit crowded.","chinese":"乘坐公共汽车应先下后上，勿争先恐后，勿挤逼抢位。"},{"english":"Dooku noticed that the Gold Team members were all scrambling to board a transport.","chinese":"杜库发觉金队队员都在争先恐后地登上飞行器。"},{"english":"Managers are scrambling to provide counseling and a suicide hotline for the young workforce.","chinese":"经理们争先恐后地为年轻劳动力提供咨询和自杀热线。"},{"english":"Journalists who were tipped off about the incident raced to the scene.","chinese":"事先听到有关此事风声的新闻记者争先恐后赶赴现场。"},{"english":"Many communities were scrambling to find the missing;","chinese":"许多社区在争先恐后地寻找失踪者。"},{"english":"Sprints shall be run according to the rules governing sprint races.","chinese":"运动员的冲刺，以争先赛的有关规则为准。"},{"english":"The panic - stricken passengers tried to rush the life - boats .","chinese":"惊慌的旅客争先恐后，想挤进救生艇。"},{"english":"Visitors swarned to mail the special postcards with certain stampers.","chinese":"游客争先恐后地给家里邮寄盖有特别邮戳的明信片。"},{"english":"The men scrambled back into the car and it moved off at a fantastic speed.","chinese":"那些人争先恐后地爬上汽车，以惊人的速度开跑了。"},{"english":"The banks fell over each other to lend money as they jostled for market share.","chinese":"银行竞相追求市场份额，于是争先发放贷款。"},{"english":"On arriving there, everybody went into action in no time. We dug square pits first.","chinese":"到了目的地后，大家不由分说，争先恐后地干起来。"},{"english":"Perhaps to be outdone, jujube scrambling to spit the verdant shoots.","chinese":"也许是不甘落后，枣树争先恐后地吐出了嫩绿的新芽。"},{"english":"On arriving there, everybody went into action in no time.","chinese":"到了目的地后，大家不由分说，争先恐后地干起来。"},{"english":"Olympic sprint is a team race.","chinese":"奥林匹克争先赛是一种团体赛。"}],"related":[{"definition":["to fall over each other in their eagerness to..."],"pinyin":["zheng1 xiang1"],"word":"争相"},{"definition":["competitive\/eagerly\/to vie"],"pinyin":["jing4 xiang1"],"word":"竞相"},{"definition":["(idiom) not want to be outdone\/not content to lag behind"],"pinyin":["bu4 gan1 ren2 hou4"],"word":"不甘人后"},{"definition":["dauntless\/to summon up courage and determination\/using extreme force of will"],"pinyin":["fen4 yong3"],"word":"奋勇"},{"definition":["to flock (to see)\/to mill\/to throng"],"pinyin":["feng1 yong1"],"word":"蜂拥"},{"definition":["to respond instantly\/to act at once on hearing the news"],"pinyin":["wen2 feng1 er2 dong4"],"word":"闻风而动"},{"definition":["variant of 摩拳擦掌[mo1 quan2 ca1 zhang3]"],"pinyin":["mo2 quan2 ca1 zhang3"],"word":"磨拳擦掌"},{"definition":["like a swarm of bees\/everyone swarms around pushing and shouting\/a hornet's nest"],"pinyin":["yi1 wo1 feng1"],"word":"一窝蜂"},{"definition":["to advance dauntlessly in wave upon wave (idiom)"],"pinyin":["qian2 fu4 hou4 ji4"],"word":"前赴后继"},{"definition":["fig. to rub one's fists and wipe one's palms (idiom)\/to roll up one's sleeves for battle\/eager to get into action or start on a task"],"pinyin":["mo2 quan2 ca1 zhang3"],"word":"摩拳擦掌"},{"definition":["to swarm\/to flock"],"pinyin":["feng1 yong3"],"word":"蜂涌"},{"definition":["lit. you fight, I snatch (idiom); to compete fiercely offering no quarter\/fierce rivalry\/tug-of-war"],"pinyin":["ni3 zheng1 wo3 duo2"],"word":"你争我夺"},{"definition":["to make an amphibious assault\/to seize a beachhead\/to gain a foothold in (a new market)"],"pinyin":["qiang3 tan1"],"word":"抢滩"},{"definition":["to strive for mastery (idiom); aiming for the best result\/to have high ambitions"],"pinyin":["li4 zheng1 shang4 you2"],"word":"力争上游"},{"definition":["one after another\/in succession\/one by one\/continuously\/diverse\/in profusion\/numerous and confused\/pell-mell"],"pinyin":["fen1 fen1"],"word":"纷纷"},{"definition":["one falls, the next follows (idiom); stepping into the breach to replace fallen comrades\/advancing wave upon wave"],"pinyin":["qian2 pu1 hou4 ji4"],"word":"前仆后继"}]}