{"definition":["to fight for\/to strive for\/to win over"],"pinyin":["zheng1 qu3"],"traditional":["爭取"],"rank":2113.0,"normalized_rank":0.029563611433688245,"fraction":0.00007195543781041047,"cumulative_fraction":0.7388556771467578,"word":"争取","characters":[{"definition":["to strive for\/to vie for\/to argue or debate\/deficient or lacking (dialect)\/how or what (literary)"],"pinyin":["zheng1"],"word":"争"},{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"}],"containing_words":[{"definition":["to act with urgency\/to buy time"],"pinyin":["zheng1 qu3 shi2 jian1"],"word":"争取时间"}],"sentences":[{"english":"Talent never goes unrecognized, through constant endeavour will it be seen.","chinese":"世上没有怀才不遇，只看你是否百分百争取。"},{"english":"Dozens of years of life in haste, and all should strive for them to strive for.","chinese":"人生匆匆数十寒暑，一切都应自己去奋斗，争取。"},{"english":"He has been pressing to return to China to advocate for greater cultural and religious freedoms for his followers.","chinese":"他一直努力回到天朝为他的信徒争取文化和总角子有。"},{"english":"We must strive for peace with ISIS, it's the only way.","chinese":"我们必须于伊希斯争取和平，这是唯一的出路。"},{"english":"We strongly support education in our own mother tongues.","chinese":"极力支持争取接受母语方言教育的权利。"},{"english":"Mr Maliki is wooing smaller Shia parties.","chinese":"马利基一直在争取小型什叶党派的支持。"},{"english":"The coalminers decided to go on strike for better working conditions.","chinese":"煤矿工许多人决定为争取更好的工作条件举行罢工。"},{"english":"The team seems unstoppable in their drive for the championship.","chinese":"这支球队争取冠军的气势似锐不可当。"},{"english":"The handbills said they would carry on the struggle for freedom and democracy.","chinese":"传单说他们将继续进行争取自由民主的斗争。"},{"english":"He compromised with Democrats to achieve them.","chinese":"他与民主党妥协以争取他们的支持。"},{"english":"A new wave of graduates are scrambling for lots in some companies and factories.","chinese":"一群刚出校门的毕业生正在公司或工厂中争取空缺。"},{"english":"A clerk has just delivered the token by a bicycle.","chinese":"站员以脚踏车递送路牌予司机员以争取时间。"},{"english":"I tried to take several business classes, but my salary was very low.","chinese":"我争取上一些工商管理的课程，但是我的工资很低。"},{"english":"But the primary goal of the teen years is to achieve independence.","chinese":"不过，十几岁这个年龄的首要目标就是要争取独立。"},{"english":"So, here to say nonsense, \" for the little cannon of Peucedanum card\".","chinese":"所以，在这里说一句废话，“争取在点炮之前胡牌”。"},{"english":"On no account should we neglect this section either, and our policy must be to win them over.","chinese":"这一部分人，我们也决不可忽视，必须采取争取政策。"}],"related":[{"definition":["to work hard for\/to do all one can\/to contend strongly"],"pinyin":["li4 zheng1"],"word":"力争"},{"definition":["as quickly as possible\/as soon as possible\/with all speed","see 儘快|尽快[jin3 kuai4]"],"pinyin":["jin3 kuai4","jin4 kuai4"],"word":"尽快"},{"definition":["to strive one's hardest\/to spare no effort"],"pinyin":["jin4 li4"],"word":"尽力"},{"definition":["great effort\/to strive\/to try hard"],"pinyin":["nu3 li4"],"word":"努力"},{"definition":["to wish for\/to desire\/hope\/CL:個|个[ge4]"],"pinyin":["xi1 wang4"],"word":"希望"},{"definition":["to do at all costs\/to make an all-out effort"],"pinyin":["quan2 li4 yi3 fu4"],"word":"全力以赴"},{"definition":["soon\/shortly\/on a day quite soon\/promptly"],"pinyin":["zao3 ri4"],"word":"早日"},{"definition":["as early as possible"],"pinyin":["jin3 zao3"],"word":"尽早"},{"definition":["with all one's strength\/full strength\/all-out (effort)\/fully (support)"],"pinyin":["quan2 li4"],"word":"全力"},{"definition":["to spare no effort (idiom); to do one's utmost"],"pinyin":["jie2 jin4 quan2 li4"],"word":"竭尽全力"},{"definition":["as far as possible\/to do one's utmost"],"pinyin":["jin3 ke3 neng2"],"word":"尽可能"},{"definition":["to grasp firmly\/to pay special attention to\/to rush in\/to make the most of"],"pinyin":["zhua1 jin3"],"word":"抓紧"},{"definition":["to seek\/to strive for"],"pinyin":["mou2 qiu2"],"word":"谋求"},{"definition":["to think up every possible method (idiom); to devise ways and means\/to try this, that and the other"],"pinyin":["xiang3 fang1 she4 fa3"],"word":"想方设法"},{"definition":["to snatch time\/to rush\/to hurry (up)\/to seize the moment"],"pinyin":["zhua1 jin3 shi2 jian1"],"word":"抓紧时间"},{"definition":["to continue the struggle (idiom); to persist\/unremitting efforts"],"pinyin":["zai4 jie1 zai4 li4"],"word":"再接再厉"}]}