{"definition":["a dispute\/to wrangle"],"pinyin":["zheng1 bian4"],"traditional":["爭辯"],"rank":22122.0,"normalized_rank":0.3095154813705875,"fraction":0.0000019382909294727348,"cumulative_fraction":0.97940472257385,"word":"争辩","characters":[{"definition":["to strive for\/to vie for\/to argue or debate\/deficient or lacking (dialect)\/how or what (literary)"],"pinyin":["zheng1"],"word":"争"},{"definition":["to dispute\/to debate\/to argue\/to discuss"],"pinyin":["bian4"],"word":"辩"}],"containing_words":[],"sentences":[{"english":"He threw caution to the winds and began arguing with the manager.","chinese":"他什么也不顾了，和经理争辩起来。"},{"english":"For it is the day of the LORD's vengeance, and the year of recompences for the controversy of Zion.","chinese":"因耶和华有报仇之日，为锡安的争辩，有报应之年。"},{"english":"I have never seen anyone die for the ontologi-cal argument.","chinese":"我从来没有见过有人为本体论的争辩而死。"},{"english":"One of the parents came to the school to expostulate about his son's examination results with the teacher.","chinese":"有一个家长到学校来为他儿子的考试成绩和老师争辩。"},{"english":"Ad hominem attacks are a signal of defeat in a debate.","chinese":"偏激的抨击是则是争辩中失败的象征。"},{"english":"Liu didn't even argue with him; instead Liu stepped off the cart and walked home.","chinese":"刘宽也不和他争辩，就下车走路回家。"},{"english":"That's scientific talk.","chinese":"这是一场科学的争辩。"},{"english":"He often remonstrated with others about unimportant matter.","chinese":"他常与别人争辩一些无关紧要的问题。"},{"english":"She expostulated about her daughter's examination results with the teacher.","chinese":"她和老师争辩关于她女儿的学习成绩。"},{"english":"It is beyond argument that every human being is a composite of good and evil.","chinese":"每个人都是善与恶的混合体，这是无可争辩的事实。"},{"english":"\"Don't friend the boss, \" they would argue.","chinese":"“别把老板加成好友，”他们会争辩道。"},{"english":"Arguments do not bring people to God. This is a good example for the evangelists.","chinese":"争辩不能把人归向主，福传者学习的榜样。"},{"english":"It seemed to me that Sir Robert's arguments were nonsensical.","chinese":"在我看来，罗伯特爵士的争辩纯属瞎说。"},{"english":"The lawyer's cogent arguments convince the jury.","chinese":"这位律师强有力的争辩博得陪审团之信服。"},{"english":"His breathing was becoming more intense. He started to argue with groom’s father.","chinese":"他的呼吸越来越急促，他同亲家公争辩起来。"},{"english":"Avoid arguing and having to being right about every topic.","chinese":"避免争辩和要求自己的每一个话题都正确。"}],"related":[{"definition":["to dispute\/to refute"],"pinyin":["bian4 bo2"],"word":"辩驳"},{"definition":["to explain\/to justify\/to defend (a point of view etc)\/to provide an explanation\/to try to defend oneself"],"pinyin":["bian4 jie3"],"word":"辩解"},{"definition":["to retort\/to refute"],"pinyin":["fan3 bo2"],"word":"反驳"},{"definition":["to argue\/to debate\/to contend\/argument\/contention\/controversy\/debate\/CL:次[ci4],場|场[chang3]"],"pinyin":["zheng1 lun4"],"word":"争论"},{"definition":["to dispute\/to disagree\/to argue opinionatedly\/to wrangle"],"pinyin":["zheng1 zhi2"],"word":"争执"},{"definition":["to bicker\/to argue for the sake of arguing\/to carry on poles (together with sb else)\/to carry a coffin on poles"],"pinyin":["tai2 gang4"],"word":"抬杠"},{"definition":["to quibble"],"pinyin":["jiao3 bian4"],"word":"狡辩"},{"definition":["to argue strenuously or with sophistry\/to quibble"],"pinyin":["qiang3 bian4"],"word":"强辩"},{"definition":["to offer an explanation\/to plead innocence\/to try to defend oneself"],"pinyin":["bian4 bai2"],"word":"辩白"},{"definition":["debate\/argument\/to argue over\/CL:場|场[chang3],次[ci4]"],"pinyin":["bian4 lun4"],"word":"辩论"},{"definition":["to twist words and force logic (idiom)\/sophistry\/loud rhetoric making up for fallacious argument\/shoving false arguments down people's throats"],"pinyin":["qiang3 ci2 duo2 li3"],"word":"强词夺理"},{"definition":["conciliation\/mediation\/to mollify\/to propitiate\/to reconcile"],"pinyin":["quan4 jie3"],"word":"劝解"},{"definition":["to answer back sarcastically (idiom)\/to retort"],"pinyin":["fan3 chun2 xiang1 ji1"],"word":"反唇相讥"},{"definition":["to debate\/to argue"],"pinyin":["bian4 shuo1"],"word":"辩说"},{"definition":["to refute\/to debunk\/to deny\/to denounce"],"pinyin":["bo2 chi4"],"word":"驳斥"},{"definition":["to pester endlessly (idiom)\/an annoying troublemaker"],"pinyin":["hu2 jiao3 man2 chan2"],"word":"胡搅蛮缠"}]}