{"definition":["2nd rank of candidates who passed the imperial examination (i.e. 4th place and up)"],"pinyin":["er4 jia3"],"traditional":["二甲"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"二甲","characters":[{"definition":["two\/2\/(Beijing dialect) stupid"],"pinyin":["er4"],"word":"二"},{"definition":["first of the ten Heavenly Stems 十天干[shi2 tian1 gan1]\/(used for an unspecified person or thing)\/first (in a list, as a party to a contract etc)\/letter \"A\" or roman \"I\" in list \"A, B, C\", or \"I, II, III\" etc\/armor plating\/shell or carapace\/(of the fingers or toes) nail\/bladed leather or metal armor (old)\/ranking system used in the Imperial examinations (old)\/civil administration unit in the baojia 保甲[bao3 jia3] system (old)\/ancient Chinese compass point: 75°"],"pinyin":["jia3"],"word":"甲"}],"containing_words":[{"definition":["xylene"],"pinyin":["er4 jia3 ben3"],"word":"二甲苯"},{"definition":["dimethylarsenic acid (CH3)2AsO2H\/cacodylic acid"],"pinyin":["er4 jia3 ji1 shen1 suan1"],"word":"二甲基砷酸"},{"definition":["dimethylarsenic acid (CH3)2AsO2H\/cacodylic acid"],"pinyin":["er4 jia3 ji1 shen4 suan1"],"word":"二甲基胂酸"},{"definition":["phthalate (chemistry)"],"pinyin":["lin2 ben3 er4 jia3 suan1 zhi3"],"word":"邻苯二甲酸酯"}],"sentences":[{"english":"Chances are it contains phthalates and are out gassing chemicals.","chinese":"它非常可能含有邻苯二甲酸盐，且正在挥发化学物。"},{"english":"There were no serious side effects from minocycline.","chinese":"二甲胺四环素并没有严重的副作用。"},{"english":"Xylene and decalin are better solvents than the others.","chinese":"二甲苯和十氢萘是较好的溶剂。"},{"english":"The paper introduces the progress in synthesis technology and the developing trend of dimethyl - carbonate.","chinese":"本文叙述了碳酸二甲酯合成技术进展情况及发展趋势。"},{"english":"The antiinflammatory effect was demonstrated using auricle edema induced by xylene in mice.","chinese":"采用二甲苯致小鼠耳廓肿胀观察其抗炎作用。"},{"english":"However, over the next few years is the expansion of our para-xylene peak.","chinese":"不过，未来几年也是我国对二甲苯扩能的高峰期。"},{"english":"Mineral filled, toughened, lubricated polybutylene terephthalate resin for injection molding. It has exceptaional surface aesthetics.","chinese":"矿物填充，增韧，润滑聚对苯二甲酸丁二酯树脂注塑。"},{"english":"Conclusion The insulin-sensitizing drugs, rosiglitazone and metformin, are effective in the treatment of NAFLD.","chinese":"结论罗格列酮和二甲双胍可有效治疗大鼠NAFLD。"},{"english":"Last year, the company said it was removing dibutyl phthalate .","chinese":"去年，该公司称要从指甲油中去掉邻苯二甲酸二丁酯。"},{"english":"Metformin and acarbose more often cause diarrhea and other digestive problems than the others.","chinese":"二甲双胍和阿卡波糖多引起腹泻和其他消化道疾病。"},{"english":"The dimethylcarbazole distribution in crude oil from Hui, Liu Structure Ridge(HLSR), the Pearl River Mouth basin, has displayed some regular changes.","chinese":"二甲基咔唑在惠流构造脊油藏中的分布具有规律性。"},{"english":"The estimated results give a good precision for non-polar molecule of DME.","chinese":"由于二甲醚为非极性分子，估算获得相当好的凖确性。"},{"english":"The method can be used to test the dimethyl fumarate in the mold inhibitor.","chinese":"可用于测定防霉剂中的富马酸二甲酯含量。"},{"english":"Dimethyl sulfone is an important material of healthy foods and relative pharmaceutical.","chinese":"二甲基砜是保健食品和相关医药的重要原料。"},{"english":"The blend treated mechanically was extracted by xylon and aceton one by one.","chinese":"经过力化学处理过的混合物用二甲苯和丙酮逐一浸取。"},{"english":"The effect of metformin in the treatment of obese females with amenorrhea was observed.","chinese":"本研究观察二甲双胍对肥胖女性伴停经的治疗效果。"}],"related":[{"definition":["1st rank or top three candidates who passed the imperial examination (i.e. 狀元|状元[zhuang4 yuan2], 榜眼[bang3 yan3], and 探花[tan4 hua1], respectively)"],"pinyin":["yi1 jia3"],"word":"一甲"},{"definition":["successful candidate in the highest imperial civil service examination\/palace graduate"],"pinyin":["jin4 shi4"],"word":"进士"},{"definition":["3rd rank of candidates who passed the imperial examination"],"pinyin":["san1 jia3"],"word":"三甲"},{"definition":["graduate\/successful candidate in the imperial provincial examination"],"pinyin":["ju3 ren2"],"word":"举人"},{"definition":["to pass an exam"],"pinyin":["kao3 zhong4"],"word":"考中"},{"definition":["first-placed candidate in the provincial imperial examinations (old)"],"pinyin":["jie4 yuan2"],"word":"解元"},{"definition":["title of the temporary position in the Hanlin Academy, conferred to meritorious candidates until the next examination"],"pinyin":["shu4 ji2 shi4"],"word":"庶吉士"},{"definition":["court examination, the top grade imperial exam"],"pinyin":["dian4 shi4"],"word":"殿试"},{"definition":["the triennial provincial imperial exam during the Ming and Qing"],"pinyin":["xiang1 shi4"],"word":"乡试"},{"definition":["(old) candidate who has successfully passed the first grades of the examination system, but not yet the court examination (殿試|殿试[dian4 shi4])"],"pinyin":["gong4 shi4"],"word":"贡士"},{"definition":["grade A\/first-class"],"pinyin":["jia3 deng3"],"word":"甲等"},{"definition":["candidate for the Imperial Examination proposed by a tributary state"],"pinyin":["gong4 sheng1"],"word":"贡生"},{"definition":["a person who has passed the county level imperial exam (historical)\/scholar\/skillful writer\/fine talent"],"pinyin":["xiu4 cai5"],"word":"秀才"},{"definition":["court examination, the top grade imperial exam"],"pinyin":["ting2 shi4"],"word":"廷试"},{"definition":["prefectural exam, the 2nd of the three entry-level exams in the imperial examination system of Ming and Qing dynasties"],"pinyin":["fu3 shi4"],"word":"府试"},{"definition":["the last of the three entry-level exams in the imperial examination system of Ming and Qing dynasties"],"pinyin":["yuan4 shi4"],"word":"院试"}]}