{"definition":["Yunnan Province in southwest China, bordering on Vietnam, Laos and Myanmar, abbr. 滇[Dian1] or 雲|云[Yun2], capital Kunming 昆明[Kun1 ming2]"],"pinyin":["Yun2 nan2 Sheng3"],"traditional":["雲南省"],"rank":7220.0,"normalized_rank":0.10101716732192577,"fraction":0.000014012246424850005,"cumulative_fraction":0.8996831810047954,"word":"云南省","characters":[{"definition":["cloud\/CL:朵[duo3]","(classical) to say","surname Yun\/abbr. for Yunnan Province 雲南省|云南省[Yun2 nan2 Sheng3]"],"pinyin":["yun2","yun2","Yun2"],"word":"云"},{"definition":["south","surname Nan"],"pinyin":["nan2","Nan2"],"word":"南"},{"definition":["to save\/to economize\/to do without\/to omit\/to leave out\/province\/(archaic) central government department","to inspect\/to examine\/to be aware\/to pay a visit (to one's parents or elders)"],"pinyin":["sheng3","xing3"],"word":"省"}],"containing_words":[],"sentences":[{"english":"Lijiang is located in Lijing Prefecture in the Northwest of Yunnan province.","chinese":"丽江位于云南省西北部。"},{"english":"Central Yunnan province is an economically developed area of Yunnan province.","chinese":"滇中地区是云南省经济发达的地区。"},{"english":"Objective To study the snails which transmit parasitic diseases of Angiostrongylus cantonensis in Yunnan province.","chinese":"目的了解云南省传播广州管圆线虫病的中间宿主螺类。"},{"english":"The Jingpo ethnic minority is one of the eight \"direct transition nationalities\" in Yunnan Province, China.","chinese":"景颇族是中国云南省八个“直接过渡民族”之一。"},{"english":"Qiaojia County, situated by the Jinsha River, is a typical mountain region in northeastern Yunnan Province.","chinese":"巧家县是云南省东北部金沙江畔的一个典型山区县。"},{"english":"Historical materials of reclaim and cultivate in Kaiyuan and Mengzi district, Yunnan Province are mainly preserved in Yunnan Archives.","chinese":"云南开蒙垦殖的史料主要保存在云南省档案馆。"},{"english":"So, the research subject is the countermeasures of Logistics in Yunnan in the process of sub-region cooperation.","chinese":"以云南省参与次区域合作进程物流对策作为研究对象。"},{"english":"But in Yunnan province, many plants (including D. delavayi) are habitually used as Rhizoma Drynariae.","chinese":"而在云南省则习用多种植物。"},{"english":"This project is a 6MW hydropower project, located in Yunan Province.","chinese":"装机的水电项目，地点位于云南省境内。"},{"english":"En esta zona se encuentran dos de los lagos más grandes de Yunnan.","chinese":"在这个地区有云南省两个最大的湖泊。"},{"english":"The park is a two-hour taxi ride from Kunming, Yunnan's capital, and I made a recent visit there with plans to continue on by bus to Yuanyang and the rice terraces.","chinese":"从云南省会昆明坐出租车过来这里要两个小时。"},{"english":"Xiangyun county is one of the disaster-prone areas in Yunnan Province.","chinese":"祥云县是云南省地质灾害的多发区之一。"},{"english":"It's a special tea from Yunnan province in China.","chinese":"这是中国云南省的一种特殊的茶叶。"},{"english":"Luo Xia Gou is in Yunnan Province, 250km from Kunming City.","chinese":"落霞沟位于云南省，距离昆明市250公里。"},{"english":"Be named to be by round provincial Party committee recently \" Yunnan saves expert of first youth station \" .","chinese":"最近被团省委命名为“云南省首届青年岗位能手”。"},{"english":"The conifer sawflies are important defoliators in Yunnan Province.","chinese":"松叶蜂是云南省的重要食叶性害虫。"}],"related":[{"definition":["abbr. for 德宏傣族景頗族自治州|德宏傣族景颇族自治州, Dehong Dai and Jingpo autonomous prefecture in west Yunnan surrounded on three sides by Myanmar (Burma)"],"pinyin":["De2 hong2 zhou1"],"word":"德宏州"},{"definition":["abbr. for 大理白族自治州, Dali Bai autonomous prefecture in Yunnan"],"pinyin":["Da4 li3 zhou1"],"word":"大理州"},{"definition":["abbr. for 楚雄彞族自治州|楚雄彝族自治州[Chu3 xiong2 Yi2 zu2 zi4 zhi4 zhou1]"],"pinyin":["Chu3 xiong2 zhou1"],"word":"楚雄州"},{"definition":["Yuxi prefecture level city in Yunnan"],"pinyin":["Yu4 xi1 shi4"],"word":"玉溪市"},{"definition":["abbr. for 文山壯族苗族自治州|文山壮族苗族自治州[Wen2 shan1 Zhuang4 zu2 Miao2 zu2 zi4 zhi4 zhou1], Wenshan Zhuang and Miao autonomous prefecture in Yunnan 雲南|云南"],"pinyin":["Wen2 shan1 zhou1"],"word":"文山州"},{"definition":["Pu'er prefecture level city in Yunnan\/county capital of Ning'er Hani and Yi autonomous county 寧洱哈尼族彞族自治縣|宁洱哈尼族彝族自治县"],"pinyin":["Pu3 er3 shi4"],"word":"普洱市"},{"definition":["Honghe Hani and Yi autonomous prefecture in Yunnan 雲南|云南"],"pinyin":["Hong2 he2 zhou1"],"word":"红河州"},{"definition":["Qujing prefecture level city in Yunnan"],"pinyin":["Qu3 jing4 shi4"],"word":"曲靖市"},{"definition":["Baoshan prefecture-level city in Yunnan"],"pinyin":["Bao3 shan1 shi4"],"word":"保山市"},{"definition":["Lincang prefecture-level city in Yunnan"],"pinyin":["Lin2 cang1 shi4"],"word":"临沧市"},{"definition":["abbr. for 怒江傈僳族自治州, Nujiang Lisu autonomous prefecture in northwest Yunnan, capital Liuku or Lutku 六庫鎮|六库镇[Liu4 ku4 zhen4]"],"pinyin":["Nu4 jiang1 zhou1"],"word":"怒江州"},{"definition":["Xishuangbanna Dai Autonomous Prefecture in southern Yunnan 雲南|云南[Yun2 nan2]"],"pinyin":["Xi1 shuang1 ban3 na4 Zhou1"],"word":"西双版纳州"},{"definition":["Kunming, prefecture-level city and capital of Yunnan province in southwest China"],"pinyin":["Kun1 ming2 shi4"],"word":"昆明市"},{"definition":["Zhaotong prefecture level city in Yunnan"],"pinyin":["Zhao1 tong1 shi4"],"word":"昭通市"},{"definition":["abbr. for 迪慶藏族自治州|迪庆藏族自治州, Diqing Tibetan autonomous prefecture, Yunnan"],"pinyin":["Di2 qing4 zhou1"],"word":"迪庆州"},{"definition":["Yunnan province in southwest China, bordering on Vietnam, Laos and Myanmar, abbr. 滇[dian1] or 雲|云, capital Kunming 昆明"],"pinyin":["Yun2 nan2"],"word":"云南"}]}