{"definition":["the one who has retreated 50 steps laughs at the one who has retreated 100 steps (idiom)\/the pot calls the kettle black"],"pinyin":["wu3 shi2 bu4 xiao4 bai3 bu4"],"traditional":["五十步笑百步"],"rank":56968.0,"normalized_rank":0.7970562310243029,"fraction":6.39382005655263e-8,"cumulative_fraction":0.9996561996242777,"word":"五十步笑百步","characters":[{"definition":["five\/5"],"pinyin":["wu3"],"word":"五"},{"definition":["ten\/10"],"pinyin":["shi2"],"word":"十"},{"definition":["surname Bu","a step\/a pace\/walk\/march\/stages in a process\/situation"],"pinyin":["Bu4","bu4"],"word":"步"},{"definition":["old variant of 笑[xiao4]","laugh\/smile\/CL:個|个[ge4]"],"pinyin":["xiao4","xiao4"],"word":"笑"},{"definition":["surname Bai","hundred\/numerous\/all kinds of"],"pinyin":["Bai3","bai3"],"word":"百"},{"definition":["surname Bu","a step\/a pace\/walk\/march\/stages in a process\/situation"],"pinyin":["Bu4","bu4"],"word":"步"}],"containing_words":[],"sentences":[{"english":"You don't play basketball better than I do. That is just like the pot calling the kettle black.","chinese":"你的篮球打得并不比我好，别五十步笑百步了。"},{"english":"Bob's calling him a thief is the same as the pot calling the kettle black.","chinese":"鲍勃说他是小偷，无异于以五十步笑百步。"}],"related":[{"definition":["no better (or worse) than each other\/both in the same boat"],"pinyin":["bi3 ci3 bi3 ci3"],"word":"彼此彼此"},{"definition":["jackals of the same tribe (idiom); fig. They are all just as bad as each other."],"pinyin":["yi1 qiu1 zhi1 he2"],"word":"一丘之貉"},{"definition":["not much to choose between the two\/tweedledum and tweedledee"],"pinyin":["ban4 jin1 ba1 liang3"],"word":"半斤八两"},{"definition":["sour grapes (set expr. based on Aesop)\/lit. to say grapes are sour when you can't eat them"],"pinyin":["chi1 bu4 dao4 pu2 tao5 shuo1 pu2 tao5 suan1"],"word":"吃不到葡萄说葡萄酸"},{"definition":["lit. Dong Shi imitates Xi Shi's frown (idiom)\/fig. to mimick sb's idiosyncrasies but make a fool of oneself"],"pinyin":["Dong1 Shi1 xiao4 pin2"],"word":"东施效颦"},{"definition":["it's all very well to talk, but getting things done is another matter (idiom)\/to be an armchair expert\/to blabber on"],"pinyin":["zhan4 zhe5 shuo1 hua4 bu4 yao1 teng2"],"word":"站着说话不腰疼"},{"definition":["lit. to cover one's ears whilst stealing a bell\/to deceive oneself\/to bury one's head in the sand (idiom)"],"pinyin":["yan3 er3 dao4 ling2"],"word":"掩耳盗铃"},{"definition":["lit. 300 silver taels not hidden here (idiom); fig. to reveal what one intends to hide"],"pinyin":["ci3 di4 wu2 yin2 san1 bai3 liang3"],"word":"此地无银三百两"},{"definition":["to reap what one has sown (idiom)\/to stew in one's own juice"],"pinyin":["zi4 zuo4 zi4 shou4"],"word":"自作自受"},{"definition":["lit. to point at the mulberry tree and curse the locust tree\/fig. to scold sb indirectly\/to make oblique accusations (idiom)"],"pinyin":["zhi3 sang1 ma4 huai2"],"word":"指桑骂槐"},{"definition":["lit. a thief crying \"Stop the thief!\" (idiom)\/fig. to accuse sb of a theft and try to sneak away oneself\/to cover up one's misdeeds by shifting the blame onto others"],"pinyin":["zei2 han3 zhuo1 zei2"],"word":"贼喊捉贼"},{"definition":["If you want to condemn sb, don't worry about the pretext (idiom, from Zuozhuan 左傳|左传); one can always trump up a charge against sb\/Give a dog a bad name, then hang him."],"pinyin":["yu4 jia1 zhi1 zui4 , he2 huan4 wu2 ci2"],"word":"欲加之罪，何患无辞"},{"definition":["to lie through one's teeth (idiom)\/to talk drivel"],"pinyin":["zheng1 yan3 shuo1 xia1 hua4"],"word":"睁眼说瞎话"},{"definition":["to speak sarcastically\/to make cutting remarks"],"pinyin":["wa1 ku3"],"word":"挖苦"},{"definition":["to deceive others and to deceive oneself\/to believe one's own lies"],"pinyin":["zi4 qi1 qi1 ren2"],"word":"自欺欺人"},{"definition":["to pick up what others say (idiom); to pass off other people's opinions as one's own\/to parrot"],"pinyin":["shi2 ren2 ya2 hui4"],"word":"拾人牙慧"}]}