{"definition":["five phases of Chinese philosophy: wood 木, fire 火, earth 土, metal 金, water 水"],"pinyin":["wu3 xing2"],"traditional":["五行"],"rank":21430.0,"normalized_rank":0.2998335035607852,"fraction":0.0000020715685027976794,"cumulative_fraction":0.9780184056045536,"word":"五行","characters":[{"definition":["five\/5"],"pinyin":["wu3"],"word":"五"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"}],"containing_words":[{"definition":["all the trades\/people of all trades and professions"],"pinyin":["wu3 hang2 ba1 zuo1"],"word":"五行八作"}],"sentences":[{"english":"The theory of yin and yang serves to explain the organic structure physiologicing changes of the human body.","chinese":"五行学说能够评释人体的生理功效和病理形态。"},{"english":"Historiographers' expertise was the knowledge background of the Yin-Yang school.","chinese":"史官的王官之学是阴阳五行家的知识背景。"},{"english":"In the theory of five elements, gold and white, the color is a metallic luster.","chinese":"在五行学说中，金为白，乃金属光泽之色。"},{"english":"The ostracon has 5 lines of text in black ink.","chinese":"古陶片上有黑墨水写的五行字。"},{"english":"Promotion and restriction among the five elements are the basic conditions for normal physiological activities of the body.","chinese":"五行的相生相克，是人体正常生理活动的基本条件。"},{"english":"Theory of five elements has some value by its significance of methodology.","chinese":"五行学说的价值主要在于其方法论意义。"},{"english":"Yang house FS's theory is all based on I Ching, Yin Yang and the changes in 5 elements.","chinese":"阳宅风水的理论依据，不离易经阴阳五行的变化。"},{"english":"Twelve-style Boxing is advanced content for further improvement after Wuxing Quan (Five-element Boxing). During exercises, we just require true meanings not alike shapes.","chinese":"十二形拳是在五行拳之后为进一步提高的进阶内容。"},{"english":"The theory of five elements is a main clue of the doctrine of viscera-state of CM (chinese Medicine).","chinese":"五行学说是中医藏象理论的主要基础之一。"},{"english":"Will someone please help me fill in the blanks in the limerick?","chinese":"有人帮我把五行诗的空填上吗？"},{"english":"The exercise is originated from the doctrines of TCM Yin Yang Five Elements Balancing and main and collateral channels.","chinese":"此功法结合了中医阴阳五行平衡和奇正相生学说。"},{"english":"Or God will toss off a limerick for your pleasure.","chinese":"或者上帝为了使你高兴而抛出一首五行打油诗。"},{"english":"In positioning the eight trigrams, it was much possible that the cyclic producing between the five elements had been taken into consideration.","chinese":"在卦位的安排中，很可能已考虑到五行的循环相生。"},{"english":"However, the seismic idea of the ruling class was Yin, Yang and the Five Elements and the idea of heavenly punishment.","chinese":"但居于社会统治地位的地震理念是阴阳五行和天诫观。"},{"english":"Since monkeys belong to the metal family in the Chinese zodiac, this name is perfect for your fair-haired daughter.","chinese":"猴子归属五行中的金，因此是很适合千金女儿的。"},{"english":"Any one of the five elements has two aspects-being restricted and restricting.","chinese":"五行中的任何之一都有克我和我克两方面性质。"}],"related":[{"definition":["yin and yang"],"pinyin":["yin1 yang2"],"word":"阴阳"},{"definition":["Wuxing - \"Five Animals\" - Martial Art"],"pinyin":["wu3 xing2"],"word":"五形"},{"definition":["four divisions (of the twenty-eight constellations 二十八宿[er4 shi2 ba1 xiu4] of the sky into groups of seven mansions), namely: Azure Dragon 青龍|青龙[Qing1 long2], White Tiger 白虎[Bai2 hu3], Vermilion Bird 朱雀[Zhu1 que4], Black Tortoise 玄武[Xuan2 wu3]"],"pinyin":["si4 xiang4"],"word":"四象"},{"definition":["to engender one another"],"pinyin":["xiang1 sheng1"],"word":"相生"},{"definition":["fiend\/demon\/very\/(Tw) SARS (loanword)","to terminate\/to cut short\/to bring to a stop\/to squeeze\/to tighten\/to damage\/variant of 殺|杀[sha1]"],"pinyin":["sha4","sha1"],"word":"煞"},{"definition":["the Moon (esp. in Daoism)"],"pinyin":["tai4 yin1"],"word":"太阴"},{"definition":["the ten Heavenly Stems 甲[jia3], 乙[yi3], 丙[bing3], 丁[ding1], 戊[wu4], 己[ji3], 庚[geng1], 辛[xin1], 壬[ren2], 癸[gui3] (used cyclically in the calendar and as ordinal number like Roman I, II, III)"],"pinyin":["shi2 tian1 gan1"],"word":"十天干"},{"definition":["inborn\/innate\/natural"],"pinyin":["xian1 tian1"],"word":"先天"},{"definition":["menstruation\/woman's period"],"pinyin":["gui3 shui3"],"word":"癸水"},{"definition":["to conform to\/to fit with\/to be compatible with"],"pinyin":["xiang1 he2"],"word":"相合"},{"definition":["the character 8 or 八\/birthdate characters used in fortune-telling"],"pinyin":["ba1 zi4"],"word":"八字"},{"definition":["heaven and earth\/yin and yang"],"pinyin":["liang3 yi2"],"word":"两仪"},{"definition":["typical weather in a given season"],"pinyin":["yue4 ling4"],"word":"月令"},{"definition":["fate\/predestination\/divinatory art"],"pinyin":["ming4 li3"],"word":"命理"},{"definition":["divination based on the eight characters of one's birth date"],"pinyin":["ba1 zi4 ming4 li3"],"word":"八字命理"},{"definition":["bad luck\/unlucky fate"],"pinyin":["ni4 yun4"],"word":"逆运"}]}