{"definition":["to fight hand to hand"],"pinyin":["jiao1 shou3"],"traditional":["交手"],"rank":7931.0,"normalized_rank":0.11096497978257523,"fraction":0.000012130886769853425,"cumulative_fraction":0.9089677050620324,"word":"交手","characters":[{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"},{"definition":["hand\/(formal) to hold\/person engaged in certain types of work\/person skilled in certain types of work\/personal(ly)\/convenient\/classifier for skill\/CL:雙|双[shuang1],隻|只[zhi1]"],"pinyin":["shou3"],"word":"手"}],"containing_words":[{"definition":["diplomatic"],"pinyin":["wai4 jiao1 shou3 wan4"],"word":"外交手腕"}],"sentences":[{"english":"After Houston, we have a very tough 4-game east coast road trip against Detroit, Boston, Philly and New Jersey.","chinese":"之后我们又要去东海岸和凯尔特人等强队进行交手。"},{"english":"On Terephon, Luke beheaded her after a struggle.","chinese":"卢克在泰雷丰与卢米娅交手，斩下了她的首级。"},{"english":"One thing that stands out however, is how competitve the encounters have been.","chinese":"值得一提的是，这几次交手竞争很激烈。"},{"english":"Vritra ninety-nine fortresses, and then came upon the dragon .","chinese":"因陀罗摧毁了维他的九十九座城堡，然后与维他交手。"},{"english":"The last time the sides met in the competition was at the semi-final stage in 1992.","chinese":"两队最近一次在联赛杯交手是在1992年的半决赛。"},{"english":"It is on offer every time the teams meet in a Six Nations contest.","chinese":"每次两队在六国赛交手时，都会给胜者颁发这项奖杯。"},{"english":"Tang wall and cheng bite play gold few rounds.","chinese":"唐壁与程咬金交手没几个回合。"},{"english":"Xabi Alonso, Albert Riera and Alvaro Arbeloa will also be hoping to play against the host nation.","chinese":"阿隆索列拉阿贝罗阿也有望上场与东道主交手。"},{"english":"Inside the spacious interior of the Galactic Senate chambers, Yoda challenged the Emperor.","chinese":"尤达与皇帝在银河议院宏伟的大厅内交手。"},{"english":"They have faced the Madridistas 29 times at the Bernabéu, winning only twice.","chinese":"他们在伯纳乌29次和皇马交手，只取得过两次胜利。"},{"english":"Each team plays each other once, with home advantage alternating on a yearly basis.","chinese":"每年各队互相交手一次，主场则是每年轮换一次。"},{"english":"But when the organization was hit by the killer and instant spike and thus injured.","chinese":"但当于组织杀手交手时被瞬间秒杀并因此受了伤。"},{"english":"This time to conquer the Central Plains Dynasty is the first time dealing with the South Vietnamese people.","chinese":"这一次征服是中原王朝第一次与南越人交手。"},{"english":"Ding Junhui said he felt lucky to have the chance to play against world-class opponents.","chinese":"能和世界级高手交手，丁俊晖说自己感到很幸运。"},{"english":"Small rascal how can with once kill people of does the soldier exchange blows?","chinese":"小流氓怎么能和杀过人的士兵交手呢？"},{"english":"Anyway I also didn't exchange blows with others for a long time, in the mind's returning is really a little bit carefree alarm.","chinese":"反正我也好久没和人交手了，心里还真是有点闲得慌。"}],"related":[{"definition":["to cross swords\/to have a confrontation (with sb)"],"pinyin":["jiao1 feng1"],"word":"交锋"},{"definition":["to fight\/to exchange blows"],"pinyin":["guo4 zhao1"],"word":"过招"},{"definition":["confrontation\/contest\/showdown"],"pinyin":["dui4 jue2"],"word":"对决"},{"definition":["to fight\/to wage war"],"pinyin":["jiao1 zhan4"],"word":"交战"},{"definition":["to pit oneself against sb\/to compete with sb\/contest\/battle\/to haggle\/to quibble"],"pinyin":["jiao4 liang4"],"word":"较量"},{"definition":["to do battle (with sb)"],"pinyin":["dui4 zhan4"],"word":"对战"},{"definition":["to face off against one's adversary (military, sports etc)"],"pinyin":["dui4 lei3"],"word":"对垒"},{"definition":["to meet\/to run into (sb)\/to get together (with sb)"],"pinyin":["peng4 mian4"],"word":"碰面"},{"definition":["to defeat\/to beat"],"pinyin":["ji1 bai4"],"word":"击败"},{"definition":["opponent\/rival\/competitor\/(well-matched) adversary\/match"],"pinyin":["dui4 shou3"],"word":"对手"},{"definition":["to draw (a competition)\/to fight to a standstill"],"pinyin":["da3 cheng2 ping2 shou3"],"word":"打成平手"},{"definition":["to score a victory\/to prevail over one's opponents"],"pinyin":["qu3 sheng4"],"word":"取胜"},{"definition":["to suffer a defeat\/to fail\/to fall behind"],"pinyin":["luo4 bai4"],"word":"落败"},{"definition":["to both share the limelight\/to both have an equal share of"],"pinyin":["ping2 fen1 qiu1 se4"],"word":"平分秋色"},{"definition":["to be utterly defeated\/to be routed"],"pinyin":["bai4 ji4"],"word":"败绩"},{"definition":["to attack (one another)"],"pinyin":["dui4 gong1"],"word":"对攻"}]}