{"definition":["to replace\/alternately\/in turn"],"pinyin":["jiao1 ti4"],"traditional":["交替"],"rank":9991.0,"normalized_rank":0.139787052453374,"fraction":0.000008275617644429797,"cumulative_fraction":0.9296231877488708,"word":"交替","characters":[{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"},{"definition":["to substitute for\/to take the place of\/to replace\/for\/on behalf of\/to stand in for"],"pinyin":["ti4"],"word":"替"}],"containing_words":[{"definition":["alternation of generations"],"pinyin":["shi4 dai4 jiao1 ti4"],"word":"世代交替"}],"sentences":[{"english":"DNP treatment reduced the alternative respiration pathway capacity.","chinese":"而DNP处理则降低交替呼吸途径容量。"},{"english":"The centralization and the decentralization in the old China competed and alternate mutually.","chinese":"旧中国中央集权与地方分权相互竞争，相互交替。"},{"english":"At this point you must alternate lateral and radial truing . Be patient.","chinese":"在这点上你必须交替的从侧面和纵向进行调整。"},{"english":"Good times alternate with bad.","chinese":"走好运与倒霉交替发生。"},{"english":"It showed that the ratio of alternative pathway in total respiration increased during fruit browned.","chinese":"果实褐变时，果成交替途径呼吸比例增高。"},{"english":"Alternating between a deterministic and a non-deterministic node selection effectively solves the bottleneck problem.","chinese":"确定与非确定性节点选择交替有效地解决了瓶颈问题。"},{"english":"Why can my hand be when is season alternant desquamate?","chinese":"我的手为什么会在季节交替的时候脱皮呢？"},{"english":"The girl comes to her employer's house to work on alternate days.","chinese":"这个女孩交替地去她的雇主家干活。"},{"english":"Alternating direction methods are suitable ones for solving large-scale problems.","chinese":"交替方向法适合于求解大规模问题。"},{"english":"Alternating and moving my feet one inch at a time.","chinese":"两条腿交替向前挪步，一次挪一英寸。"},{"english":"So do the dual forces of the Tao wax and wane in the alternation of upward and downward cycles, intercrossing.","chinese":"在升降的交替中，道的盛衰盈亏两个力量也是如此。"},{"english":"Honey of generation had betrayed.","chinese":"世代交替的甜蜜，是否遭背叛？"},{"english":"Linear structure forms localized bond in strong-weak cycles.","chinese":"线形结构大多形成强弱交替的定域键。"},{"english":"An ordinary meter will not respond to these rapid alterations .","chinese":"普通的电流计无法响应这些快速的交替变化。"},{"english":"The experimental results show that transfer of interior moisture mainly controls the drying process.","chinese":"并采用冷热风交替的干燥方法将取得较好的节能效果。"},{"english":"This paper presents a new alternating direction method for a class of variational inequalities.","chinese":"该文对于一类变分不等式提出了一种新的交替方向法。"}],"related":[{"definition":["to crisscross\/to intertwine"],"pinyin":["jiao1 cuo4"],"word":"交错"},{"definition":["to transform\/to convert\/to vary\/to alternate\/a transformation"],"pinyin":["bian4 huan4"],"word":"变换"},{"definition":["to stick onto\/stalemate\/gridlock\/to agglutinate"],"pinyin":["jiao1 zhuo2"],"word":"胶着"},{"definition":["to be deadlocked"],"pinyin":["jiang1 chi2"],"word":"僵持"},{"definition":["to cycle\/to circulate\/circle\/loop"],"pinyin":["xun2 huan2"],"word":"循环"},{"definition":["after this\/afterwards\/hereafter"],"pinyin":["ci3 hou4"],"word":"此后"},{"definition":["to stop in the middle of sth\/intermittent\/intermittence"],"pinyin":["jian4 xie1"],"word":"间歇"},{"definition":["to rise\/to go up\/to ascend"],"pinyin":["shang4 sheng1"],"word":"上升"},{"definition":["to go and come back\/to make a return trip\/backwards and forwards (e.g. of piston or pump action)\/to reciprocate (of machine part)"],"pinyin":["wang3 fu4"],"word":"往复"},{"definition":["lit. the cycle comes back to the start (idiom); to move in circles\/the wheel comes full circle"],"pinyin":["zhou1 er2 fu4 shi3"],"word":"周而复始"},{"definition":["left and right hands\/(fig.) capable assistant\/right-hand man"],"pinyin":["zuo3 you4 shou3"],"word":"左右手"},{"definition":["to-and-fro tussle\/closely-fought contest"],"pinyin":["la1 ju4 zhan4"],"word":"拉锯战"},{"definition":["a two-man saw\/fig. to-and-fro between two sides"],"pinyin":["la1 ju4"],"word":"拉锯"},{"definition":["gap\/interval\/compartment\/to divide\/to separate\/to leave a gap of (two weeks, three meters etc)"],"pinyin":["jian4 ge2"],"word":"间隔"},{"definition":["to change irregularly\/to fluctuate"],"pinyin":["bian4 huan4"],"word":"变幻"},{"definition":["friction\/rubbing\/chafing\/fig. disharmony\/conflict\/also written 磨擦"],"pinyin":["mo2 ca1"],"word":"摩擦"}]}