{"definition":["to blend\/to mix"],"pinyin":["jiao1 rong2"],"traditional":["交融"],"rank":16534.0,"normalized_rank":0.2313321114266926,"fraction":0.000003470472101015575,"cumulative_fraction":0.9648456973865864,"word":"交融","characters":[{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"},{"definition":["to melt\/to thaw\/to blend\/to merge\/to be in harmony","old variant of 融[rong2]"],"pinyin":["rong2","rong2"],"word":"融"}],"containing_words":[],"sentences":[{"english":"For a long time, Hong Kong has embraced the Eastern and Western cultures.","chinese":"长期以来，中西方文化在香港相互辉映，相互交融。"},{"english":"Shanghai culture is the outcome of melting the cultures of north, south, east and west.","chinese":"海派文化是南北东西文化交融的结晶。"},{"english":"National culture intrinsic content blends with modern life concept harmony.","chinese":"民族文化内蕴与现代生活观念的和谐交融。"},{"english":"This paper discusses on Miss Lin's novel technique-----a blend of Chinese .","chinese":"文章着重就林徽因小说中西文化交融技巧作一探析。"},{"english":"Latin America meets East Asia in Los Angeles in one savory bite.","chinese":"一口美味佳淆，使拉美与东亚在洛杉矶交融。"},{"english":"Not merely housed in flesh, but brought to life.","chinese":"这不仅仅是灵肉交融，也带来了新的生机。"},{"english":"Solo and tutti themes are subtly interwoven and the polyphonic texture is transparent.","chinese":"独奏和乐队部分交融在一起，复调织体却又十分透明。"},{"english":"In the two-dimensional world, matter and soul melt into one.","chinese":"心与物交融于无限丰富的平面世界。"},{"english":"The integration of mood and scene is the most representative one.","chinese":"“情”与“景”的交融即为较有代表性的一种。"},{"english":"Tranströmer has said \"My poems are meeting places.\"","chinese":"特兰斯特罗默曾经说过，“我的诗歌是交融之所”。"},{"english":"The blending can be seen in the following three aspects.","chinese":"唐代诗画艺术交融有以下三方面的表现。"},{"english":"Dalliance mountains in China, you can completely blend together with nature.","chinese":"在青山绿水中徜徉，你完全可与大自然交融在一起。"},{"english":"The beauty of Sanya, the beauty of the world, joined together brilliantly.","chinese":"三亚之美，世界之美，交融汇聚，闪耀启幕。"},{"english":"The more the two civilizations intermingle, the worse the tensions will be.","chinese":"两种文明越是交融，紧张关系就会越恶化。"},{"english":"Right click your text layer, and open blending effects.","chinese":"点击右文贵层，并开放交融的结果。"},{"english":"Putonghua has actually resulted from the mergence of various ethnic groups and it was over a long period of time.","chinese":"普通话是在历史长时间冶炼，多民族多方交融的结果。"}],"related":[{"definition":["a mixture\/an amalgam\/fusion\/welding together\/to be in harmony with (nature)\/to harmonize with\/to fit in"],"pinyin":["rong2 he2"],"word":"融合"},{"definition":["fusion\/to combine as one"],"pinyin":["rong2 hui4"],"word":"融汇"},{"definition":["mix together\/put together (usu. things that do not blend well together)"],"pinyin":["rou2 he2"],"word":"糅合"},{"definition":["to blend\/to integrate\/to amalgamate\/to fuse"],"pinyin":["rong2 hui4"],"word":"融会"},{"definition":["to interweave"],"pinyin":["jiao1 zhi1"],"word":"交织"},{"definition":["to fuse together (idiom)\/hypostatic union (religion)"],"pinyin":["rong2 wei2 yi1 ti3"],"word":"融为一体"},{"definition":["variant of 交匯|交汇\/to flow together\/confluence (of rivers, airflow, roads)\/(international) cooperation","to flow together\/confluence (of rivers, airflow, roads)\/(international) cooperation"],"pinyin":["jiao1 hui4","jiao1 hui4"],"word":"交汇"},{"definition":["to reflect\/to shine"],"pinyin":["hui1 ying4"],"word":"辉映"},{"definition":["to blend"],"pinyin":["rou2 he2"],"word":"揉合"},{"definition":["warm\/agreeable"],"pinyin":["rong2 he2"],"word":"融和"},{"definition":["Eastern and Western culture"],"pinyin":["dong1 xi1 fang1 wen2 hua4"],"word":"东西方文化"},{"definition":["to form a cohesive whole\/to fuse together"],"pinyin":["rong2 he2 wei2 yi1"],"word":"融合为一"},{"definition":["to complement one another (idiom)"],"pinyin":["xiang1 fu3 xiang1 cheng2"],"word":"相辅相成"},{"definition":["to sublimate\/sublimation (physics)\/to raise to a higher level\/to refine\/promotion"],"pinyin":["sheng1 hua2"],"word":"升华"},{"definition":["a blend\/a mix"],"pinyin":["za2 rou2"],"word":"杂糅"},{"definition":["to bring out the best in each other (idiom)\/to complement one another well"],"pinyin":["xiang1 de2 yi4 zhang1"],"word":"相得益彰"}]}