{"definition":["to crisscross\/to intertwine"],"pinyin":["jiao1 cuo4"],"traditional":["交錯"],"rank":16762.0,"normalized_rank":0.2345221272368587,"fraction":0.000003376024576435905,"cumulative_fraction":0.9656255256348659,"word":"交错","characters":[{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"},{"definition":["mistake\/wrong\/bad\/interlocking\/complex\/to grind\/to polish\/to alternate\/to stagger\/to miss\/to let slip\/to evade\/to inlay with gold or silver","surname Cuo"],"pinyin":["cuo4","Cuo4"],"word":"错"}],"containing_words":[{"definition":["criss-crossed (idiom)"],"pinyin":["zong4 heng2 jiao1 cuo4"],"word":"纵横交错"},{"definition":["wine goblets and gambling chips lie intertwined\/to drink and gamble together in a large group (idiom)\/a big (drinking) party"],"pinyin":["gong1 chou2 jiao1 cuo4"],"word":"觥筹交错"},{"definition":["lit. shoes and slippers muddled together (idiom); fig. many guests come and go\/a lively party"],"pinyin":["lu:3 xi4 jiao1 cuo4"],"word":"履舄交错"}],"sentences":[{"english":"The shadow intermingled with the sunshine.","chinese":"阴影与日光交错。"},{"english":"They counterchanged the floor in the bedroom with several colours.","chinese":"他们把卧室的地板铺成交错的颜色。"},{"english":"With careful planning, stages can even be interleaved.","chinese":"经过精心计划，阶段之间甚至可以交错。"},{"english":"Rural town Thursday, Pingchou green canals crisscrossing the United States and fertilizer to a wealth of products.","chinese":"城周四郊，绿野平畴河渠交错，地肥水美物产丰饶。"},{"english":"Pulse interleaving also avoids the mutual interference between the transmitted and received impulse pulse signals.","chinese":"脉冲交错也避免了收发冲激脉冲信号间的相互干扰。"},{"english":"The city is criss-crossed with canals.","chinese":"这座城市里运河纵横交错。"},{"english":"Complicated bus routes crisscrossingDespite of your choice.","chinese":"公交车的路线繁杂交错，任君选择。"},{"english":"Crisscrossing the skyline are streams of unending repulsorlift traffic.","chinese":"在天边来往交错的是无尽的反重力交通流。"},{"english":"Our destinies had been interwined, but would never joint.","chinese":"我们的命运曾经交错，但注定不能在一起。"},{"english":"The social interaction of China mutual interleave, benefits relation complications.","chinese":"中国的人际关系互相交错，利益关系复杂。"},{"english":"Staggered the same path in the field, between the villages can hear the voice of the crow like dogs.","chinese":"田间小路交错相通，村落间能听到鸡鸣狗叫的声音。"},{"english":"The plackets of the stirrups should be settled right on the upper part of the beams and in staggered arrangement.","chinese":"梁的箍筋的开口必须放在梁的上部且应交错放置。"},{"english":"Flower petals are joined near the base and stamens alternate with the corolla lobes.","chinese":"花翼瓣在底部邻接，雄蕊与冠片交错。"},{"english":"The delicate fiber-shaped structure recreates the interlacing shadows of the bamboo forest.","chinese":"微细纤维状造型，交错编织光影时空。"},{"english":"A new structure of polarized light interference interleaver is presented.","chinese":"提出了一种偏振光干涉型光交错复用器的新结构。"},{"english":"Of dignified showily bring a person spatiotemporal stagger with romantic vogue bewildered be puzzled.","chinese":"凝重的华贵与浪漫的时尚带给人时空交错的眩惑。"}],"related":[{"definition":["to interweave"],"pinyin":["jiao1 zhi1"],"word":"交织"},{"definition":["criss-crossed (idiom)"],"pinyin":["zong4 heng2 jiao1 cuo4"],"word":"纵横交错"},{"definition":["strewn at random\/disorderly\/untidy\/irregular\/uneven"],"pinyin":["cuo4 luo4"],"word":"错落"},{"definition":["intricate\/complicated\/tangled\/involved\/to synthesize"],"pinyin":["cuo4 zong1"],"word":"错综"},{"definition":["to intertwine\/to intermingle"],"pinyin":["jiao1 chan2"],"word":"交缠"},{"definition":["to overlap\/to superimpose\/to telescope\/to run together\/to duplicate\/one over another\/superposition\/an overlap\/redundancy\/reduplication (in Chinese grammar, e.g. 散散步[san4 san4 bu4] to have a stroll)"],"pinyin":["chong2 die2"],"word":"重叠"},{"definition":["mixed\/jumbled"],"pinyin":["cuo4 za2"],"word":"错杂"},{"definition":["to cross\/to intersect\/to overlap"],"pinyin":["jiao1 cha1"],"word":"交叉"},{"definition":["variant of 交匯|交汇\/to flow together\/confluence (of rivers, airflow, roads)\/(international) cooperation","to flow together\/confluence (of rivers, airflow, roads)\/(international) cooperation"],"pinyin":["jiao1 hui4","jiao1 hui4"],"word":"交汇"},{"definition":["to cover densely"],"pinyin":["mi4 bu4"],"word":"密布"},{"definition":["to be linked together\/to be involved with\/to collude\/interconnection\/involvement\/collusion"],"pinyin":["gou1 lian2"],"word":"勾连"},{"definition":["intertwined (of tree roots or branches)\/fig. an intricate matter"],"pinyin":["pan2 cuo4"],"word":"盘错"},{"definition":["layer upon layer\/tiered"],"pinyin":["ceng2 die2"],"word":"层叠"},{"definition":["to coil (around sth)\/to twine\/to weave (basketwork)"],"pinyin":["pan2 rao4"],"word":"盘绕"},{"definition":["to change irregularly\/to fluctuate"],"pinyin":["bian4 huan4"],"word":"变幻"},{"definition":["to merge with\/interlinking\/to join with\/to interlock"],"pinyin":["xiang1 jie1"],"word":"相接"}]}