{"definition":["to cross swords\/to have a confrontation (with sb)"],"pinyin":["jiao1 feng1"],"traditional":["交鋒"],"rank":6474.0,"normalized_rank":0.09057965945182096,"fraction":0.00001656860662645616,"cumulative_fraction":0.8882972549971588,"word":"交锋","characters":[{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"},{"definition":["point of a spear\/edge of a tool\/vanguard\/forward (in sports team)"],"pinyin":["feng1"],"word":"锋"}],"containing_words":[],"sentences":[{"english":"This was the first historical draw of the Veneti in Turin.","chinese":"这是双方在都灵交锋上的第一次平局。"},{"english":"This is mostly because there is little head-to-head competition between America and China.","chinese":"这主要是由于中美之间几乎没有贸易上的正面交锋。"},{"english":"Carlos Tevez has scored four goals in six Premier League appearances against Liverpool.","chinese":"特维斯在近六次与利物浦的交锋中打入四球。"},{"english":"The last two matches between these teams at the DW Stadium have finished goalless.","chinese":"这两支球队过去两次在DW球场交锋都没有入球产生。"},{"english":"I’ve fought all of these enemies at one time or another.","chinese":"我跟所有这些敌人都交锋过不止一次。"},{"english":"Similarly he tries not to cross the Russians, who are also prone to throwing tantrums.","chinese":"同样，潘也避免与易怒的俄罗斯交锋。"},{"english":"Faced with the danish advance, alfred did not risk open battle .","chinese":"对付丹麦军的进攻，艾尔弗雷德尽力避开正面交锋。"},{"english":"Lazio play against Sampdoria this weekend in the second round of Serie A games.","chinese":"拉齐奥将在本周末的意甲第二轮与桑普多利亚交锋。"},{"english":"He was taken captive by the P. L. A. men at the first engagement.","chinese":"他在第一次交锋时被人民解放军战士俘虏。"},{"english":"There have been several clashes with Juve, in recent times as well.","chinese":"他们与尤文之间曾有多场经典战役，近年来也有交锋。"},{"english":"We're getting close to the end, and the match at Cesena will be an important one.","chinese":"我们已经接近目标了，和切塞纳的交锋将会非常重要。"},{"english":"Let him begin to circle and let the fight come.","chinese":"让这鱼打起转来，就来交锋吧。"},{"english":"Peoples of the world could meet one another at a cricket or a football match .","chinese":"世界各国的民众能在足球赛或板球赛上交锋。"},{"english":"France and Spain will meet in the soccer cup final.","chinese":"法国队和西班牙队将在足球锦标赛决赛中交锋。"},{"english":"Doesn t this sound like a worthy goal?","chinese":"交锋这就像一个有价值的目标声音？"},{"english":"And I'm not talking about some regular-season snoozer against Golden State.","chinese":"不要跟我提常规赛与金州勇士的交锋。"}],"related":[{"definition":["to fight hand to hand"],"pinyin":["jiao1 shou3"],"word":"交手"},{"definition":["confrontation\/contest\/showdown"],"pinyin":["dui4 jue2"],"word":"对决"},{"definition":["to face off against one's adversary (military, sports etc)"],"pinyin":["dui4 lei3"],"word":"对垒"},{"definition":["to pit oneself against sb\/to compete with sb\/contest\/battle\/to haggle\/to quibble"],"pinyin":["jiao4 liang4"],"word":"较量"},{"definition":["to fight\/to wage war"],"pinyin":["jiao1 zhan4"],"word":"交战"},{"definition":["to meet\/to run into (sb)\/to get together (with sb)"],"pinyin":["peng4 mian4"],"word":"碰面"},{"definition":["on the up\/currently winning\/rising (in popularity etc)"],"pinyin":["shang4 feng1"],"word":"上风"},{"definition":["to both share the limelight\/to both have an equal share of"],"pinyin":["ping2 fen1 qiu1 se4"],"word":"平分秋色"},{"definition":["to defeat\/to beat"],"pinyin":["ji1 bai4"],"word":"击败"},{"definition":["total victory\/to excel by far\/name of a tank\/slam"],"pinyin":["quan2 sheng4"],"word":"全胜"},{"definition":["to suffer a defeat\/to fail\/to fall behind"],"pinyin":["luo4 bai4"],"word":"落败"},{"definition":["to be utterly defeated\/to be routed"],"pinyin":["bai4 ji4"],"word":"败绩"},{"definition":["to meet the enemy head-on"],"pinyin":["ying2 zhan4"],"word":"迎战"},{"definition":["to attack (one another)"],"pinyin":["dui4 gong1"],"word":"对攻"},{"definition":["to dominate\/dominant"],"pinyin":["zhan4 you1"],"word":"占优"},{"definition":["to score a victory\/to prevail over one's opponents"],"pinyin":["qu3 sheng4"],"word":"取胜"}]}