{"definition":["to arise\/to come into being\/to come about\/to give rise to\/to bring into being\/to bring about\/to produce\/to engender\/to generate\/to appear\/appearance\/emergence\/generation\/production\/yield"],"pinyin":["chan3 sheng1"],"traditional":["產生"],"rank":587.0,"normalized_rank":0.008212891581436347,"fraction":0.0002596730314314824,"cumulative_fraction":0.5365790954167408,"word":"产生","characters":[{"definition":["to give birth\/to reproduce\/to produce\/product\/resource\/estate\/property"],"pinyin":["chan3"],"word":"产"},{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"}],"containing_words":[{"definition":["logogen model"],"pinyin":["dan1 ci2 chan3 sheng1 qi4 mo2 xing2"],"word":"单词产生器模型"},{"definition":["production of speech"],"pinyin":["yu3 yan2 chan3 sheng1"],"word":"语言产生"}],"sentences":[{"english":"Some desires are formed as the result of rational thought pro-  cesses.","chinese":"有些欲望在理性的思考后产生。"},{"english":"The nature of the stimulus may predispose some children to attention problems.","chinese":"刺激本身很可能使一些孩子易产生注意力问题。"},{"english":"Is this image fresh enough to have an effect?","chinese":"这个形象的新鲜度够不够产生效果？"},{"english":"C) It was produced in oxygen-free environments.","chinese":"它是在缺氧环境中产生的。"},{"english":"Scientists don't yet know what the effects of those reactions might be.","chinese":"科学家们还不清楚这些反应会具体产生什么样的结果。"},{"english":"Transposons are one cause of genetic diseases such as haemophilia .","chinese":"转位子是产生如血友病一类遗传病的一个致病因子。"},{"english":"This inhibited the process of translation, producing a homogeneous population of empty ribosomes.","chinese":"这抑制了翻译的过程，产生了一个均匀的核糖空缺。"},{"english":"This usually occurs during failure scenarios or periods of high load.","chinese":"这种景象经常产生在体系故障或者是高负荷的景象下。"},{"english":"Interference with the normal production of heme or globin leads to anemia.","chinese":"血红素或球蛋白的正常产生收到干扰会导致贫血。"},{"english":"But I am unable to relate the thrill and secrecy that subtle instant holds for me.","chinese":"但我无法描述那微妙的瞬间顷刻产生的震撼和神秘。"},{"english":"This study is significant for generation of ultra-short optical pulse chain at high repetition rate.","chinese":"该研究对高重复率脉冲串产生具有一定意义。"},{"english":"State-of-the-art systems report producing biogas that is more than 95% pure methane.","chinese":"最新系统报告产生的沼气中甲烷的含量超过95%。"},{"english":"High viscosity oils produce foam with small bubbles that do not break easily.","chinese":"高粘度油产生泡沫的小气泡，不容易突破。"},{"english":"All of this polling makes for a lot of extra work.","chinese":"所有这些轮询都产生了许多额外的工作。"},{"english":"These three factors have a lot of power over your metabolism.","chinese":"这三个方面就可以对你的代谢产生重要影响。"},{"english":"Then they timed the reactions that caused the new thymine bonds to form.","chinese":"然后他们记录了产生新的胸腺嘧啶键形成的反应。"}],"related":[{"definition":["to bring about\/to create\/to cause"],"pinyin":["zao4 cheng2"],"word":"造成"},{"definition":["to form\/to take shape"],"pinyin":["xing2 cheng2"],"word":"形成"},{"definition":["to lead to\/to trigger\/to initiate\/to cause\/to evoke (emotions)"],"pinyin":["yin3 fa1"],"word":"引发"},{"definition":["and then (what follows next)"],"pinyin":["jin4 er2"],"word":"进而"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"从而"},{"definition":["to lead to\/to create\/to cause\/to bring about"],"pinyin":["dao3 zhi4"],"word":"导致"},{"definition":["to give rise to\/to lead to\/to cause\/to arouse"],"pinyin":["yin3 qi3"],"word":"引起"},{"definition":["influence\/effect\/to influence\/to affect (usually adversely)\/to disturb\/CL:股[gu3]"],"pinyin":["ying3 xiang3"],"word":"影响"},{"definition":["to interact\/interaction\/interplay"],"pinyin":["xiang1 hu4 zuo4 yong4"],"word":"相互作用"},{"definition":["to appear\/to arise\/to emerge\/to show up"],"pinyin":["chu1 xian4"],"word":"出现"},{"definition":["to generate\/to produce\/generated\/produced"],"pinyin":["sheng1 cheng2"],"word":"生成"},{"definition":["to eliminate\/to remove"],"pinyin":["xiao1 chu2"],"word":"消除"},{"definition":["thus\/consequently\/as a result"],"pinyin":["yin1 ci3"],"word":"因此"},{"definition":["usable\/workable\/feasible\/doable\/to make\/to cause"],"pinyin":["shi3 de5"],"word":"使得"},{"definition":["to exist\/to be\/existence"],"pinyin":["cun2 zai4"],"word":"存在"},{"definition":["to induce\/to promote\/to urge\/to impel\/to bring about\/to provoke\/to drive (sb to do sth)\/to catalyze\/to actuate\/to contribute to (some development)"],"pinyin":["cu4 shi3"],"word":"促使"}]}