{"definition":["highlight\/bright spot"],"pinyin":["liang4 dian3"],"traditional":["亮點"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"亮点","characters":[{"definition":["bright\/clear\/resonant\/to shine\/to show\/to reveal"],"pinyin":["liang4"],"word":"亮"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"点"}],"containing_words":[],"sentences":[{"english":"A major highlight of the ceremony is a unique paper-cut fashion show.","chinese":"颁奖典礼上一大亮点就是独特的剪纸时装秀。"},{"english":"The summit of Western Banquet activities will be the biggest bright spot.","chinese":"本次峰会的西餐夜宴将是活动的最大亮点。"},{"english":"Bruni also dives deep to offer some surprises on non-elite public schools.","chinese":"布鲁尼还深入挖掘了一些非名校的公立大学的亮点。"},{"english":"In addition, a major highlight of the ceremony is a unique paper-cut fashion show.","chinese":"另外，在颁奖典礼上一大亮点就是独特的剪纸时装秀。"},{"english":"The generation of classroom teaching is a light-spot in implementing new courses.","chinese":"课堂教学的“生成”，是实施新课程的一大亮点。"},{"english":"Tourism may become a new bright spot in our bilateral cooperation.","chinese":"旅游可以成为双边合作的新亮点。"},{"english":"Mengcun construction fastener has become a new bright spot in economic development.","chinese":"在建筑扣件已成为孟村经济发展中的新亮点。"},{"english":"The picturesque city of Fez is anther aspects of Morocco.","chinese":"非斯这个独特的城市也是摩洛哥的一个亮点。"},{"english":"P. Morgan's big win came in fixed-income markets.","chinese":"摩根大通当季业绩最大亮点来自于固定收益市场。"},{"english":"The local autonomy of Shanghai was a highlight of local political practice in the late Qing Dynasty.","chinese":"上海地方自治是清末地方政治实践的一个亮点。"},{"english":"Yellow stripes on head and light spot on each marginal scute .","chinese":"头部两边有黄色条纹且头顶有亮点。"},{"english":"Developing the forest tourism industry energetically has become the new bright spot of the landscape planning.","chinese":"大力发展森林旅游业，成为景观规划的新亮点。"},{"english":"Africa will be the highlight of an otherwise dismal year.","chinese":"非洲将是这异常凄凉的一年里的亮点。"},{"english":"What were your highlights of the 2010 Betfred. com World Snooker Championship?","chinese":"你觉得2010年世界斯诺克锦标赛的亮点是什么？"},{"english":"Marin Cilic vs. Marcos Baghdatis would be a highlight of the third round.","chinese":"第三轮，西里奇与巴格达蒂斯是一亮点。"},{"english":"Ma Xiaohui's solo beautifully represents Chinese culture in Norway's Pavilion.","chinese":"马晓辉的独奏成为挪威馆里中国元素的突出亮点。"}],"related":[{"definition":["a faulty stroke in calligraphy or painting\/a faulty expression in writing"],"pinyin":["bai4 bi3"],"word":"败笔"},{"definition":["remarkable (performance, achievement etc)\/worthy of praise"],"pinyin":["ke3 quan1 ke3 dian3"],"word":"可圈可点"},{"definition":["characteristic\/distinguishing feature or quality"],"pinyin":["te4 se4"],"word":"特色"},{"definition":["the brush stroke that dots in the eyes (idiom); fig. to add the vital finishing touch\/the crucial point that brings the subject to life\/a few words to clinch the point"],"pinyin":["dian3 jing1 zhi1 bi3"],"word":"点睛之笔"},{"definition":["new idea"],"pinyin":["xin1 yi4"],"word":"新意"},{"definition":["qualities that make sth worth seeing (or reading)"],"pinyin":["kan4 tou5"],"word":"看头"},{"definition":["conforming with the norms of society"],"pinyin":["zhong4 gui1 zhong4 ju3"],"word":"中规中矩"},{"definition":["short stave of the barrel (which allows the contents to escape)\/(fig.) shortcoming\/weak point"],"pinyin":["duan3 ban3"],"word":"短板"},{"definition":["everything is fine except for one small defect (idiom); the fly in the ointment"],"pinyin":["mei3 zhong1 bu4 zu2"],"word":"美中不足"},{"definition":["eye-catching"],"pinyin":["qiang3 yan3"],"word":"抢眼"},{"definition":["eye-catching"],"pinyin":["xi1 jing1"],"word":"吸睛"},{"definition":["to strike a pose (Chinese opera)\/(fig.) to make a public appearance\/to come out in public (revealing one's true personality, opinions etc)\/(of a product) to appear on the market or at a trade show etc"],"pinyin":["liang4 xiang4"],"word":"亮相"},{"definition":["focus\/focal point"],"pinyin":["jiao1 dian3"],"word":"焦点"},{"definition":["to enrich\/to enhance\/to beautify"],"pinyin":["zeng1 se4"],"word":"增色"},{"definition":["characteristic (feature)\/trait\/feature\/CL:個|个[ge4]"],"pinyin":["te4 dian3"],"word":"特点"},{"definition":["important point\/main point\/focus\/key (project etc)\/to focus on\/to put the emphasis on","to recount (e.g. results of election)\/to re-evaluate"],"pinyin":["zhong4 dian3","chong2 dian3"],"word":"重点"}]}