{"definition":["anew\/from the start"],"pinyin":["cong2 tou2"],"traditional":["從頭"],"rank":14753.0,"normalized_rank":0.20641361073412334,"fraction":0.000004268239831816034,"cumulative_fraction":0.9579941406866558,"word":"从头","characters":[{"definition":["surname Cong","from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor"],"pinyin":["Cong2","cong2"],"word":"从"},{"definition":["suffix for nouns","head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]"],"pinyin":["tou5","tou2"],"word":"头"}],"containing_words":[{"definition":["from start to finish\/from head to tail\/the whole (thing)"],"pinyin":["cong2 tou2 dao4 wei3"],"word":"从头到尾"},{"definition":["from head to foot"],"pinyin":["cong2 tou2 dao4 jiao3"],"word":"从头到脚"}],"sentences":[{"english":"You don't need to start with Chapter 1 and read it cover to cover.","chinese":"您不必与第1章开始和读取它从头到尾。"},{"english":"She can recite the long poem from the beginning to the end.","chinese":"她能把那首长诗从头到尾地背下来。"},{"english":"To my amazement, he was able to recite the poem from memory.","chinese":"令我大为惊奇的是，他把这首诗从头到尾背了出来。"},{"english":"Animated by fresh hops , he started again .","chinese":"他在新希望的激励之下，又从头做起。"},{"english":"Likewise, Sussman reads his newsweekly cover-to-cover every week.","chinese":"苏斯曼同样是每周都从头到尾地阅读新闻周刊。"},{"english":"It is because you know nothing about it that I'll tell you from the beginning.","chinese":"因为你对此事一无所知，所以我将对你从头说起。"},{"english":"The fire puja went well effortlessly from beginning to the end.","chinese":"火供从头至尾很轻松的进行得很顺利。"},{"english":"I read the entire book on the flight back to Connecticut.","chinese":"在回康涅狄格的飞机上，我从头到尾看完了这本书。"},{"english":"Start at the beginning and play the piece again.","chinese":"从头开始，这段再弹一遍。"},{"english":"To learn a language from the ground up, you have to be committed and resilient.","chinese":"从头开始学习一门语言，你必须坚定且有活力。"},{"english":"To start from scratch on everything goes so long as the narrowest opportunity exists.","chinese":"只要一息尚存，一切可以从头开始。"},{"english":"The whole pattern from the beginning.","chinese":"整件事从头到尾。"},{"english":"My weariness amazes me, I'm branded on my feet.","chinese":"从头到脚的疲乏让我吃惊。"},{"english":"Be honest with yourself, every time a thought intrudes start counting from the beginning again.","chinese":"不要欺骗自己，每次一个念头侵入时就从头开始计数。"},{"english":"The FA also noted that at no time did Wenger mention Foy by name.","chinese":"足总同时指出从头到尾，温格都没提过福伊的名字。"},{"english":"If we have to start from scratch then it all takes time.","chinese":"如果我们要从头开始，那么这一切需要时间。"}],"related":[{"definition":["from start to finish\/from head to tail\/the whole (thing)"],"pinyin":["cong2 tou2 dao4 wei3"],"word":"从头到尾"},{"definition":["tail\/remainder\/remnant\/extremity\/sixth of the 28 constellations\/classifier for fish","horse's tail\/pointed posterior section of a locust etc"],"pinyin":["wei3","yi3"],"word":"尾"},{"definition":["one time (all the way through)\/once through"],"pinyin":["yi1 bian4"],"word":"一遍"},{"definition":["from the inside to the outside\/through and through\/thoroughly"],"pinyin":["cong2 li3 dao4 wai4"],"word":"从里到外"},{"definition":["straight\/to straighten\/fair and reasonable\/frank\/straightforward\/(indicates continuing motion or action)\/vertical\/vertical downward stroke in Chinese characters","surname Zhi\/Zhi (c. 2000 BC), fifth of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God"],"pinyin":["zhi2","Zhi2"],"word":"直"},{"definition":["to the end (of)\/at the end of\/in the end\/to come to an end"],"pinyin":["dao4 tou2"],"word":"到头"},{"definition":["to catch and hold on\/to continue\/to go on to do sth\/to follow\/to carry on\/then\/after that\/subsequently\/to proceed\/to ensue\/in turn\/in one's turn"],"pinyin":["jie1 zhe5"],"word":"接着"},{"definition":["everywhere\/all over\/classifier for actions: one time","variant of 遍[bian4]"],"pinyin":["bian4","bian4"],"word":"遍"},{"definition":["to do something at one go\/to flow smoothly"],"pinyin":["yi1 qi4 he1 cheng2"],"word":"一气呵成"},{"definition":["where there's a start, there's a finish (idiom); to finish once one starts sth\/to carry things through\/I started, so I'll finish."],"pinyin":["you3 tou2 you3 wei3"],"word":"有头有尾"},{"definition":["over and over"],"pinyin":["yi1 bian4 you4 yi1 bian4"],"word":"一遍又一遍"},{"definition":["the boring part of something (film, show, etc.) where a bathroom break can be taken"],"pinyin":["niao4 dian3"],"word":"尿点"},{"definition":["to penetrate\/to pass through\/thoroughly\/completely\/transparent\/to appear\/to show"],"pinyin":["tou4"],"word":"透"},{"definition":["again\/once more\/re-\/second\/another\/then (after sth, and not until then)\/no matter how ... (followed by an adjective or verb, and then (usually) 也[ye3] or 都[dou1] for emphasis)"],"pinyin":["zai4"],"word":"再"},{"definition":["early\/prior\/former\/in advance\/first"],"pinyin":["xian1"],"word":"先"},{"definition":["ending\/coda\/to wind up"],"pinyin":["jie2 wei3"],"word":"结尾"}]}