{"definition":["subordinate"],"pinyin":["cong2 shu3"],"traditional":["從屬"],"rank":30426.0,"normalized_rank":0.4256992150882151,"fraction":9.085647495886658e-7,"cumulative_fraction":0.9906359552144408,"word":"从属","characters":[{"definition":["surname Cong","from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor"],"pinyin":["Cong2","cong2"],"word":"从"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"属"}],"containing_words":[],"sentences":[{"english":"The main body sex of dress and integral sex decided the appurtenant position of shoe.","chinese":"服装的主体性和整体性决定了鞋子的从属地位。"},{"english":"Unless you're managing to capture your entire market single-handed, then doesn't the concept of affiliation spring to mind?","chinese":"除非你是想一手抓住整个市场，难道你没有从属概念？"},{"english":"The database security administrator has tight control on the role membership.","chinese":"数据库安全管理员对角色从属关系有严密的控制。"},{"english":"As you can see, it is possible to create an index from an attribute as well as an element.","chinese":"正如您可以看到的，可以从属性以及元素创建索引。"},{"english":"He set up a claim to jurisdiction over Byland on the ground of affiliation.","chinese":"他以从属关系为理由提出对半岛地区拥有管辖权。"},{"english":"a doctor's role, he seemed to believe, was to stay detached from such affiliations.","chinese":"作为一个医生，他似乎相信，应该避免这种从属关系。"},{"english":"Double-clicking a list entry opens its subordinate objects.","chinese":"双击一个列表条目将打开它的从属对象。"},{"english":"Next, you'll initialize the drone node.","chinese":"然后，您需要初始化从属节点。"},{"english":"Written language requires a firm understanding of sequencing and subordination.","chinese":"书面语言需要有对顺序和从属的认识。"},{"english":"This area will become the star in your play. The surrounding area should be subordinate.","chinese":"兴趣中心是画面的重点，周边区域应处于从属地位。"},{"english":"You must still rely on external group membership for these authorities.","chinese":"对于这些权限，仍然必须依赖于外部组从属关系。"},{"english":"Finally, the slave bonder attaches the connecting bonds based on the computed correct bond locations.","chinese":"最后从属焊接机基于正确的焊接位置附上连接粘合剂。"},{"english":"Remove entity names from attribute names where possible.","chinese":"尽可能地从属性名称中除去实体名称。"},{"english":"The settings are read from the properties file.","chinese":"这些设置是从属性文件读取的。"},{"english":"Fraccion give Ryuu a punch.","chinese":"从属官给雨龙一拳。"},{"english":"Role membership is managed by the database security administrator.","chinese":"角色从属关系由数据库安全管理员来管理。"}],"related":[{"definition":["vassal\/dependent\/subordinate\/subservient\/appendage"],"pinyin":["fu4 yong1"],"word":"附庸"},{"definition":["to govern\/to have complete control over\/to be in command of"],"pinyin":["tong3 xia2"],"word":"统辖"},{"definition":["unified administration"],"pinyin":["tong3 guan3"],"word":"统管"},{"definition":["to adhere\/to attach oneself to\/to append"],"pinyin":["yi1 fu4"],"word":"依附"},{"definition":["to equate\/equal to"],"pinyin":["deng3 tong2"],"word":"等同"},{"definition":["subject to (foreign domination, emotions etc)"],"pinyin":["shou4 zhi1 pei4"],"word":"受支配"},{"definition":["to capitulate"],"pinyin":["qu1 cong2"],"word":"屈从"},{"definition":["to oppose\/to set sth against\/to be antagonistic to\/antithetical\/relative opposite\/opposing\/diametrical"],"pinyin":["dui4 li4"],"word":"对立"},{"definition":["to rely on sb for protection"],"pinyin":["tuo1 bi4"],"word":"托庇"},{"definition":["in charge of\/to control"],"pinyin":["zhang3 guan3"],"word":"掌管"},{"definition":["equal status\/equal treatment\/parity (under the law)\/equity\/reciprocity"],"pinyin":["dui4 deng3"],"word":"对等"},{"definition":["to administer\/to have jurisdiction (over)"],"pinyin":["guan3 xia2"],"word":"管辖"},{"definition":["in charge (of a position etc)\/the person in charge\/responsible"],"pinyin":["zhu3 zhang3"],"word":"主掌"},{"definition":["to obey (an order)\/to comply\/to defer"],"pinyin":["fu2 cong2"],"word":"服从"},{"definition":["power\/authority"],"pinyin":["quan2 li4"],"word":"权力"},{"definition":["to depend on sth for existence\/dependent on"],"pinyin":["yi1 cun2"],"word":"依存"}]}