{"definition":["price\/cost\/consideration (in share dealing)"],"pinyin":["dai4 jia4"],"traditional":["代價"],"rank":3894.0,"normalized_rank":0.05448211212625747,"fraction":0.0000343559804595826,"cumulative_fraction":0.8270673535484483,"word":"代价","characters":[{"definition":["to substitute\/to act on behalf of others\/to replace\/generation\/dynasty\/age\/period\/(historical) era\/(geological) eon"],"pinyin":["dai4"],"word":"代"},{"definition":["great\/good\/middleman\/servant","price\/value\/(chemistry) valence"],"pinyin":["jie5","jia4"],"word":"价"}],"containing_words":[],"sentences":[{"english":"The tradeoff is that you take nonlethal damage when you invoke it.","chinese":"代价是你使用的时候会不停受到淤伤。"},{"english":"The increase of gross price level is the sacrifice a country makes for exercizing its function.","chinese":"价格总水平的上涨是国家为实现其职能所付出的代价。"},{"english":"His boasting cost him his life,after all.","chinese":"他的吹嘘最终以他的生命为代价。"},{"english":"Kratos: You will pay for this Zeus, be certain of that.","chinese":"你将会为此付出代价的，宙斯，我保证。"},{"english":"The cost of non-compliance with industry regulations can be catastrophic.","chinese":"对于不符合工业规则的代价可能是毁灭性的。"},{"english":"One consequence of this is a reduction in the GHG cost of production per kilo of product.","chinese":"一个结果是生产每公斤产品的温室气体代价的减少。"},{"english":"All this may be the price we pay for progress.","chinese":"这一切都可能是我们为进步付出的代价。"},{"english":"But the price for such solidarity will be very high.","chinese":"但毫无疑问这种团结的代价将无比高昂。"},{"english":"The general swore to take back this island whatever the cost.","chinese":"我位将军发誓不惜任何代价夺回这个岛。"},{"english":"She pledged to complete her father’s unfinished task, whatever the cost.","chinese":"她立誓不管付出多大代价也要完成其父的未竟事业。"},{"english":"It has been rather costly to install the machinery, but it should pay off in the long run.","chinese":"安装这套机械代价很高，但从长远来看它会赚钱的。"},{"english":"Indeed, monetary easing appeared to be costless .","chinese":"确实，放松货币似乎毫无代价。"},{"english":"There is a price crusaders need to pay for their military misadventures.","chinese":"这是十字军为自己的军事冒险付出的代价。"},{"english":"This is both contagious and deadly and must be avoided at all costs.","chinese":"这会传染且是致命的，必须不惜一切代价加以避免。"},{"english":"Now, the costs of devaluing appear prohibitively high.","chinese":"现在，贬值货币的代价看起来高得让人望而怯步。"},{"english":"There is no doubt thmight the increottom in dema particulard caused the rise in prices.","chinese":"毫无疑问，需求的增加招致了代价的上涨。"}],"related":[{"definition":["to pay\/to invest (energy or time in a friendship etc)"],"pinyin":["fu4 chu1"],"word":"付出"},{"definition":["to obtain (sth) in exchange\/to exchange (sth) for (sth else)"],"pinyin":["huan4 qu3"],"word":"换取"},{"definition":["to sacrifice one's life\/to sacrifice (sth valued)\/beast slaughtered as a sacrifice"],"pinyin":["xi1 sheng1"],"word":"牺牲"},{"definition":["loss\/damage\/CL:個|个[ge4]\/to lose\/to suffer damage"],"pinyin":["sun3 shi1"],"word":"损失"},{"definition":["to waste\/to spend\/to consume\/to squander"],"pinyin":["hao4 fei4"],"word":"耗费"},{"definition":["disastrous"],"pinyin":["can3 zhong4"],"word":"惨重"},{"definition":["expense\/cost\/to spend (time or money)\/expenditure"],"pinyin":["hua1 fei4"],"word":"花费"},{"definition":["(in) return\/reciprocation\/payback\/retaliation\/to report back\/to reciprocate"],"pinyin":["hui2 bao4"],"word":"回报"},{"definition":["not stint\/not spare\/not hesitate (to do sth)\/not scruple (to do sth)"],"pinyin":["bu4 xi1"],"word":"不惜"},{"definition":["to give up\/to abandon\/to abort"],"pinyin":["she3 qi4"],"word":"舍弃"},{"definition":["consequences\/aftermath"],"pinyin":["hou4 guo3"],"word":"后果"},{"definition":["to destroy"],"pinyin":["hui3 diao4"],"word":"毁掉"},{"definition":["whatever the case\/in any event\/no matter what\/by all possible means"],"pinyin":["wu2 lun4 ru2 he2"],"word":"无论如何"},{"definition":["large sum (of money)\/a huge amount"],"pinyin":["ju4 e2"],"word":"巨额"},{"definition":["to pay for sth with the loss of (one's health etc)\/to have sth come at the cost of (one's reputation etc)"],"pinyin":["pei2 shang4"],"word":"赔上"},{"definition":["bitter\/painful\/deeply distressed"],"pinyin":["can3 tong4"],"word":"惨痛"}]}