{"definition":["to do sth in place of sb else"],"pinyin":["dai4 lao2"],"traditional":["代勞"],"rank":30048.0,"normalized_rank":0.4204105046660977,"fraction":9.380522302147759e-7,"cumulative_fraction":0.9902870148204956,"word":"代劳","characters":[{"definition":["to substitute\/to act on behalf of others\/to replace\/generation\/dynasty\/age\/period\/(historical) era\/(geological) eon"],"pinyin":["dai4"],"word":"代"},{"definition":["to toil\/labor\/laborer\/to put sb to trouble (of doing sth)\/meritorious deed\/to console (Taiwan pr. [lao4] for this sense)"],"pinyin":["lao2"],"word":"劳"}],"containing_words":[],"sentences":[{"english":"Is there anything else I could do for you while you wait?","chinese":"您等候时，还有其他要代劳吗？"},{"english":"Well, the Penguin Tea Timer happily does the waiting for you.","chinese":"现在企鹅泡茶定时器可以帮你代劳啦。"},{"english":"If I can be of any service during your convalescence, be sure to let me know.","chinese":"在你康复期间，我如能代劳的事，务必告知。"},{"english":"This measure may preclude the exclusive agency from selling crucial crude oil.","chinese":"这个措施可以使专有的代劳代理不克出售抉择的原油。"},{"english":"Since he can't put his ideas over clearly enough, allow me to speak on his behalf.","chinese":"他不能清楚地表达自己的想法，所以，就让我代劳吧。"},{"english":"Haiti can’t be reconstructed by well-meaning outsiders.","chinese":"海地重建不能由好心的局外人代劳。"},{"english":"If our delegate is unable to attend, we shall have to call on his deputy's services.","chinese":"如果我们的代表不能出席，我们就请他的副手代劳。"},{"english":"The rest of the time their mothers or wives do it for them.","chinese":"其余时间则由母亲或妻子代劳。"}],"related":[{"definition":["to do the job oneself"],"pinyin":["qin1 zi4 dong4 shou3"],"word":"亲自动手"},{"definition":["lit. to go beyond the sacrificial altar and take over the kitchen (idiom); fig. to exceed one's place and meddle in other people's affairs\/to take matters into one's own hands"],"pinyin":["yue4 zu3 dai4 pao2"],"word":"越俎代庖"},{"definition":["to do (sth) oneself\/to help oneself to"],"pinyin":["zi4 ji3 dong4 shou3"],"word":"自己动手"},{"definition":["to inconvenience\/to trouble (sb with a request)"],"pinyin":["lao2 fan2"],"word":"劳烦"},{"definition":["to make a decision\/to make up one's mind"],"pinyin":["na2 zhu3 yi5"],"word":"拿主意"},{"definition":["to decide\/to make decisions\/to take responsibility (for deciding)\/to be in charge\/to give sb justice"],"pinyin":["zuo4 zhu3"],"word":"作主"},{"definition":["see 作主[zuo4 zhu3]"],"pinyin":["zuo4 zhu3"],"word":"做主"},{"definition":["to take a lot of trouble (over sb or sth)\/may I trouble you (to do sth)"],"pinyin":["fei4 xin1"],"word":"费心"},{"definition":["full powers\/total authority\/plenipotentiary powers"],"pinyin":["quan2 quan2"],"word":"全权"},{"definition":["to worry about"],"pinyin":["cao1 xin1"],"word":"操心"},{"definition":["to have more work than one can deal with\/to have one's hands full"],"pinyin":["mang2 bu4 guo4 lai2"],"word":"忙不过来"},{"definition":["to look after\/to attend to\/to have in care"],"pinyin":["zhao4 kan4"],"word":"照看"},{"definition":["to take care of a matter all by oneself\/to run the whole show"],"pinyin":["yi1 shou3 bao1 ban4"],"word":"一手包办"},{"definition":["to put sb to trouble (of doing sth)\/vexation\/inconvenience"],"pinyin":["fan2 lao2"],"word":"烦劳"},{"definition":["to substitute for\/to take the place of\/to replace\/for\/on behalf of\/to stand in for"],"pinyin":["ti4"],"word":"替"},{"definition":["to stand aside and do nothing (idiom)\/to take no part in"],"pinyin":["sa1 shou3 bu4 guan3"],"word":"撒手不管"}]}