{"definition":["for the sake of\/in order to"],"pinyin":["yi3 li4 yu2"],"traditional":["以利於"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"以利于","characters":[{"definition":["old variant of 以[yi3]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)","abbr. for Israel 以色列[Yi3 se4 lie4]","old variant of 以[yi3]"],"pinyin":["yi3","yi3","Yi3","yi3"],"word":"以"},{"definition":["surname Li","sharp\/favorable\/advantage\/benefit\/profit\/interest\/to do good to\/to benefit"],"pinyin":["Li4","li4"],"word":"利"},{"definition":["surname Yu","to go\/to take\/sentence-final interrogative particle\/variant of 於|于[yu2]","in\/at\/to\/from\/by\/than\/out of"],"pinyin":["Yu2","yu2","yu2"],"word":"于"}],"containing_words":[],"sentences":[{"english":"Able to reveal weaknesses in the structure in order to optimize the structure design.","chinese":"能够揭示出结构的薄弱环节，以利于优化结构设计。"},{"english":"Sleeps when should keep the window seam, favors lets the outdoor fresh air unceasing exile.","chinese":"睡觉时应留些窗缝，以利于让室外新鲜空气不断流人。"},{"english":"The government by law and the law must become gradually suitably forgive favor the society to be harmonious.","chinese":"法治和法律要逐渐变得适当宽容以利于社会和谐。"},{"english":"Combustibility of producer gas is compared with other fuel gas to use rationally low calorific value gas.","chinese":"对其燃烧特性进行比较，以利于合理使用低热值煤气。"},{"english":"Endoscopes should be hung in a vertical position to facilitate drying.","chinese":"应垂直悬挂内镜以利于干燥。"},{"english":"A thermal relief is used on plane layers for thru-hole components to make soldering and desoldering easier.","chinese":"限热槽通常用于直插元件的内电层以利于焊接和拆焊。"},{"english":"Harnessing emotions sothat you can take positive actions","chinese":"控制好情绪以利于你采取积极行动，哪怕是面临困境。"},{"english":"In addition, each time measured when blood pressure the basic body posture should be same, favor the comparison.","chinese":"此外，每次测血压时的基本体位应相同，以利于比较。"},{"english":"All the information in this form shall be correct so that Michael could arrange all the work in the right time.","chinese":"表中的各项信息必须准确，以利于黄政安排各项工作。"},{"english":"We layer the crops to make them grow better.","chinese":"我们对农作物进行压条处理，以利于他们生长。"},{"english":"Make music to the proper density billet, for the fungus growth.","chinese":"使曲坯达到适当的密度，以利于菌类生长。"},{"english":"My legs are long with sharp claws for hanging.","chinese":"我的腿长，且带有利爪，以利于悬挂。"}],"related":[]}