{"definition":["Esther (name)"],"pinyin":["Yi3 si1 tie3"],"traditional":["以斯帖"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"以斯帖","characters":[{"definition":["old variant of 以[yi3]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)","abbr. for Israel 以色列[Yi3 se4 lie4]","old variant of 以[yi3]"],"pinyin":["yi3","yi3","Yi3","yi3"],"word":"以"},{"definition":["Slovakia\/Slovak\/abbr. for 斯洛伐克[Si1 luo4 fa2 ke4]","(phonetic)\/this"],"pinyin":["Si1","si1"],"word":"斯"},{"definition":["rubbing from incised inscription","invitation card\/notice","fitting snugly\/appropriate\/suitable\/variant of 貼|贴[tie1]\/to paste\/to obey"],"pinyin":["tie4","tie3","tie1"],"word":"帖"}],"containing_words":[{"definition":["Book of Esther"],"pinyin":["Yi3 si1 tie3 ji4"],"word":"以斯帖记"}],"sentences":[{"english":"When Queen Esther heard of Mordecai's condition, she couldn't understand it.","chinese":"王后以斯帖听闻末底改的哀恸，却不明所以。"},{"english":"So the king and Haman came to banquet with Esther the queen.","chinese":"王带着哈曼来赴王后以斯帖的筵席。"},{"english":"And Esther set Mordecai over the house of Haman.","chinese":"以斯帖派末底改管理哈曼的家产。"},{"english":"Then said the king unto her, What wilt thou, queen Esther? and what is thy request?","chinese":"王对她说，王后以斯帖阿，你要什么。"},{"english":"So Mordecai went his way, and did according to all that Esther had commanded him.","chinese":"于是末底改照以斯帖一切所吩咐的去行。"},{"english":"In a few minutes he returned, only to find Haman begging Esther for his life.","chinese":"过了一会，他从御园回来，却看见哈曼求以斯帖救命。"},{"english":"So the king and Haman came to the banquet that Esther had prepared.","chinese":"于是王带着哈曼赴以斯帖所预备的筵席。"},{"english":"Sidney and Esther are planning a Christmas lunch for 12 people.","chinese":"西德尼和以斯帖正在规划一顿12个人的圣诞大餐。"},{"english":"Staff from the Esther Benjamins Trust rush to stop and apprehend them.","chinese":"员工从以斯帖本杰明信托急于制止并逮捕他们。"},{"english":"Then Esther bade them return Mordecai this answer.","chinese":"以斯帖就吩咐人回报末底改说。"},{"english":"And the decree of Esther confirmed these matters of Purim ; and it was written in the book.","chinese":"以斯帖命定守普珥日，这事也记录在书上。"},{"english":"The first-person narrative related by the orphan Esther is particularly sweet.","chinese":"第一人称叙事的孤儿以斯帖相关的是特别的甜。"},{"english":"Then at the banquet table, the king asks Esther again what she really wants.","chinese":"在席间，王再问以斯帖实在想要甚么。"},{"english":"And they told to Mordecai Esther's words.","chinese":"人就把以斯帖这话告诉末底改。"},{"english":"Why have you come, Queen Esther?You must have some request?","chinese":"王后以斯帖啊，你一定有所求？"},{"english":"And Esther said, The adversary and enemy is this wicked Haman.","chinese":"以斯帖说，仇人敌人就是这恶人哈曼。"}],"related":[]}