{"definition":["Israel"],"pinyin":["Yi3 se4 lie4"],"traditional":["以色列"],"rank":1587.0,"normalized_rank":0.022204188994445456,"fraction":0.00010075361208247873,"cumulative_fraction":0.6942457746239066,"word":"以色列","characters":[{"definition":["old variant of 以[yi3]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)","abbr. for Israel 以色列[Yi3 se4 lie4]","old variant of 以[yi3]"],"pinyin":["yi3","yi3","Yi3","yi3"],"word":"以"},{"definition":["color\/dice","color\/CL:種|种[zhong3]\/look\/appearance\/sex"],"pinyin":["shai3","se4"],"word":"色"},{"definition":["to arrange\/to line up\/file\/series\/(in data tables) column\/(Tw) row"],"pinyin":["lie4"],"word":"列"}],"containing_words":[{"definition":["Israelite\/Israeli"],"pinyin":["Yi3 se4 lie4 ren2"],"word":"以色列人"}],"sentences":[{"english":"I seldom oppose Israel and Israeli teams these days.","chinese":"我很少反对以色列和以色列队这几天。"},{"english":"I seldom oppose Israel and Israeli teams these days.","chinese":"我很少反对以色列和以色列队这几天。"},{"english":"The Israelites moved on and camped at Oboth.","chinese":"以色列人起行，安营在阿伯。"},{"english":"So the king and all the children of Israel dedicated the house of the LORD.","chinese":"这样，王和以色列众民为耶和华的殿行奉献之礼。"},{"english":"And Israel set liers in wait round about Gibeah.","chinese":"以色列人在基比亚的四围设下伏兵。"},{"english":"European commissioner Chris Patten caught the mood when he suggested yesterday that Israel had dealt with a fire by pouring gasoline on the flames.","chinese":"欧盟外委会专员彭定康称，以色列这是往火上浇油。"},{"english":"And Elisha said unto him, Take bow and arrows.","chinese":"又对以色列王说，你用手拿弓。"},{"english":"So they moved the ark of the God of Israel.","chinese":"于是将以色列神的约柜运到那里去。"},{"english":"Last June, Israel and Hamas agreed to a six-month truce.","chinese":"去年6月，以色列和哈马斯同意6个月的停火协议。"},{"english":"For Israel and the Philistines had put the battle in array, army against army.","chinese":"以色列人和非利士人都摆列队伍，彼此相对。"},{"english":"Israel says it killed at least 20 guerillas in the battle.","chinese":"以色列说，以军在战斗中至少打死20名游击队员。"},{"english":"As for our redeemer, the LORD of hosts is his name, the Holy One of Israel.","chinese":"我们救赎主的名是万军之耶和华以色列的圣者。"},{"english":"32a light for revelation to the Gentiles and for glory to your people Israel.","chinese":"是照亮外邦人的光，又是你民以色列的荣耀。"},{"english":"So God subdued on that day Jabin the king of Canaan before the children of Israel.","chinese":"这样，神使迦南王耶宾被以色列人制伏了。"},{"english":"Hezbollah fought a 34-day war with Israel in 2006.","chinese":"真主党在2006年的时候跟以色列交火34天。"},{"english":"3Yet you are enthroned as the Holy One; you are the praise of Israel.","chinese":"但你是圣洁的，是用以色列的赞美为宝座的。"}],"related":[]}