{"definition":["since (some point in the past)"],"pinyin":["yi3 jiang4"],"traditional":["以降"],"rank":34450.0,"normalized_rank":0.4820001958781638,"fraction":6.371923412523339e-7,"cumulative_fraction":0.9937073925091884,"word":"以降","characters":[{"definition":["old variant of 以[yi3]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)","abbr. for Israel 以色列[Yi3 se4 lie4]","old variant of 以[yi3]"],"pinyin":["yi3","yi3","Yi3","yi3"],"word":"以"},{"definition":["to drop\/to fall\/to come down\/to descend","to surrender\/to capitulate\/to subdue\/to tame"],"pinyin":["jiang4","xiang2"],"word":"降"}],"containing_words":[],"sentences":[{"english":"Starting with Socrates, philosophers have been searching for the eternal verities.","chinese":"自苏格拉底以降，哲学家一直在追寻永恒的真理。"},{"english":"Modernization has been the topic in the course of a century's Chinese history since the end of Oing Dynasty.","chinese":"“现代化”是清末以降百年中国历史进程的主题。"},{"english":"These resulted from the gradual intensification of imperial power starting from the middle period of Song Dynasty.","chinese":"诸如此者，皆与皇权自刘宋中叶以降渐趋强化有关。"},{"english":"After Tang and Song Dynasty, the style of landscape-painting represented by the two Lis weakened gradually.","chinese":"唐宋以降，以“二李”为代表的青绿山水逐渐式微。"},{"english":"The emperors of past dynasties have imitated the example since the appearance of it in the Western Han Dynasty.","chinese":"据文献记载，铁券出现于西汉，魏晋以降多有颁赐。"},{"english":"With the introduction of the concept of immortals from the Han dynasty on, the mountain god gradually became defined as Lord Lu.","chinese":"随着汉代以降神仙说的传入，山神逐渐确定为庐君。"},{"english":"From the mid-Ching onwards, large numbers of emigrants went abroad from Fujian and Guangdong.","chinese":"清中叶以降，大量的闽粤移民出洋。"},{"english":"In addition, annexing warfare pricked up the occurence of flood since the Spring and Autumn period.","chinese":"春秋以降兼并战争加剧了水灾的发生。"},{"english":"Since the later period of Ching Dynasty, western missionary appeared in China as the stars in multitude.","chinese":"清季以降，西方传教士现身于中国者，可谓不绝于途。"},{"english":"During Chunqiu period, Fatality Order declined and Zhou Rite was faced with legitimacy crises.","chinese":"春秋以降，天命陨落，周礼出现严重的合法性危机。"}],"related":[{"definition":["to begin\/to start\/then\/only then"],"pinyin":["shi3"],"word":"始"},{"definition":["to decline\/to wane\/weakened\/enfeebled\/in decline"],"pinyin":["shuai1 wei1"],"word":"衰微"},{"definition":["the starting point"],"pinyin":["zhao4 duan1"],"word":"肇端"},{"definition":["scholar"],"pinyin":["shi4 ren2"],"word":"士人"},{"definition":["vestigial residue\/a throwback (to a former age)"],"pinyin":["yu2 xu4"],"word":"余绪"},{"definition":["to propose\/to put forward (an idea)\/to initiate"],"pinyin":["chang4 yan2"],"word":"倡言"},{"definition":["to esteem\/to revere\/to think highly of sb"],"pinyin":["tui1 zun1"],"word":"推尊"},{"definition":["Confucian"],"pinyin":["Ru2 zhe3"],"word":"儒者"},{"definition":["first day of the first lunar month\/(old) calendar promulgated by the first emperor of a dynasty"],"pinyin":["zheng1 shuo4"],"word":"正朔"},{"definition":["the whole world\/throughout the land\/everything under the sun"],"pinyin":["hai3 nei4"],"word":"海内"},{"definition":["dividing line between distinct realms\/boundary\/field-allocation (in Chinese astrology, the association between celestial regions and corresponding terrestrial realms)"],"pinyin":["fen1 ye3"],"word":"分野"},{"definition":["to change\/to modify"],"pinyin":["gai3 yi4"],"word":"改易"},{"definition":["to believe in (a deity or other supernatural being)\/to worship"],"pinyin":["chong2 feng4"],"word":"崇奉"},{"definition":["to bear in mind"],"pinyin":["fu2 ying1"],"word":"服膺"},{"definition":["tragic disaster\/disturbance and bloodshed"],"pinyin":["sang1 luan4"],"word":"丧乱"},{"definition":["the multitude of common people (in highbrow literature)\/plebeian"],"pinyin":["shu4 min2"],"word":"庶民"}]}