{"definition":["lit. a child who cries gets to feed at the breast (idiom)\/fig. the squeaky wheel gets the grease"],"pinyin":["hui4 ku1 de5 hai2 zi5 you3 nai3 chi1"],"traditional":["會哭的孩子有奶吃"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"会哭的孩子有奶吃","characters":[{"definition":["to balance an account\/accountancy\/accounting","can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])"],"pinyin":["kuai4","hui4"],"word":"会"},{"definition":["to cry\/to weep"],"pinyin":["ku1"],"word":"哭"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["child"],"pinyin":["hai2"],"word":"孩"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi5","zi3"],"word":"子"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["mother\/variant of 奶[nai3]","breast\/milk\/to breastfeed","variant of 嬭|奶[nai3]"],"pinyin":["nai3","nai3","nai3"],"word":"奶"},{"definition":["variant of 吃[chi1]","to eat\/to consume\/to eat at (a cafeteria etc)\/to eradicate\/to destroy\/to absorb\/to suffer\/to stammer (Taiwan pr. for this sense is [ji2])"],"pinyin":["chi1","chi1"],"word":"吃"}],"containing_words":[],"sentences":[],"related":[{"definition":["the shot hits the bird that pokes its head out (idiom)\/nonconformity gets punished"],"pinyin":["qiang1 da3 chu1 tou2 niao3"],"word":"枪打出头鸟"},{"definition":["(coll.) meek and civil in public, but a tyrant at home"],"pinyin":["wo1 li5 heng4"],"word":"窝里横"},{"definition":["lit. the butt governs the head (idiom)\/fig. where one stands depends on where one sits\/one's views are shaped by one's circumstances"],"pinyin":["pi4 gu5 jue2 ding4 nao3 dai5"],"word":"屁股决定脑袋"},{"definition":["if you live a life of crime, sooner or later you'll pay for it"],"pinyin":["chu1 lai2 hun4 chi2 zao3 yao4 huan2 de5"],"word":"出来混迟早要还的"},{"definition":["The higher ups have policies while the lower downs have their own ways of getting around them. (idiom)"],"pinyin":["shang4 you3 zheng4 ce4 , xia4 you3 dui4 ce4"],"word":"上有政策，下有对策"},{"definition":["lit. whoever provides milk is your mother (idiom)\/fig. to follow whoever is feeding you\/to put one's loyalties where one's interests lie"],"pinyin":["you3 nai3 bian4 shi4 niang2"],"word":"有奶便是娘"},{"definition":["do not worry about scarcity, but rather about uneven distribution (idiom, from Analects)"],"pinyin":["bu4 huan4 gua3 er2 huan4 bu4 jun1"],"word":"不患寡而患不均"},{"definition":["it's all very well to talk, but getting things done is another matter (idiom)\/to be an armchair expert\/to blabber on"],"pinyin":["zhan4 zhe5 shuo1 hua4 bu4 yao1 teng2"],"word":"站着说话不腰疼"},{"definition":["to go through hell for the sake of keeping up appearances (idiom)"],"pinyin":["si3 yao4 mian4 zi5 huo2 shou4 zui4"],"word":"死要面子活受罪"},{"definition":["to bewail one's poverty\/to complain about being hard up\/to pretend to be poor"],"pinyin":["ku1 qiong2"],"word":"哭穷"},{"definition":["common saying\/proverb"],"pinyin":["su2 hua4"],"word":"俗话"},{"definition":["(of a woman) to be fiercely protective of one's children"],"pinyin":["hu4 du2 zi5"],"word":"护犊子"},{"definition":["one who is not prepared to risk his child will never catch the wolf (proverb)\/(fig.) one who is unwilling to take risks will not achieve great things"],"pinyin":["she3 bu4 de5 hai2 zi5 tao4 bu4 zhu4 lang2"],"word":"舍不得孩子套不住狼"},{"definition":["ugly people will do all kinds of weird things to get attention (idiom)"],"pinyin":["chou3 ren2 duo1 zuo4 guai4"],"word":"丑人多作怪"},{"definition":["it's the most capable people who do the most work (idiom) (intended as consolation for the overworked, or flattery when making a request etc)"],"pinyin":["neng2 zhe3 duo1 lao2"],"word":"能者多劳"},{"definition":["to act shamelessly\/to behave in a way that leaves others tut-tutting and shaking their heads in disapproval"],"pinyin":["shua3 wu2 lai4"],"word":"耍无赖"}]}