{"definition":["to conduct (heat, electricity etc)"],"pinyin":["chuan2 dao3"],"traditional":["傳導"],"rank":16073.0,"normalized_rank":0.22488212331929536,"fraction":0.0000036430176559663793,"cumulative_fraction":0.9632071236332128,"word":"传导","characters":[{"definition":["to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)","biography\/historical narrative\/commentaries\/relay station"],"pinyin":["chuan2","zhuan4"],"word":"传"},{"definition":["to transmit\/to lead\/to guide\/to conduct\/to direct"],"pinyin":["dao3"],"word":"导"}],"containing_words":[{"definition":["heat transfer\/thermal conduction"],"pinyin":["re4 chuan2 dao3"],"word":"热传导"}],"sentences":[{"english":"Wellbore and formation are connected by Ramey heat-transfer coefficient.","chinese":"井筒和地层的温度通过综合热传导系数联系起来。"},{"english":"The good conductivity makes aluminum foil food containers within the food can be quickly heated.","chinese":"而铝良好的传导性使得铝箔餐盒内的食物能很快加热。"},{"english":"Heat losses from the reservoir by heat conduction cannot be prevented .","chinese":"热储通过热传导的热损耗是无法阻挡的。"},{"english":"It occurs for a large number of reasons, which can be categorised into conductive and sensorineural.","chinese":"出现了一大批的原因，可分为传导性和感音神经性。"},{"english":"The bundle sticking out on the right are the optical tracts, leading to the eyes.","chinese":"右边伸出的一束是视觉传导束，它通向眼睛。"},{"english":"Every Bahá'í must acquire the lessons of teaching.","chinese":"每位巴哈伊皆须取得传导经验。"},{"english":"The conductive structure is electrically connected to the LED chip.","chinese":"传导元件电性连接于该发光二极体晶片。"},{"english":"They translate the lifting power of the serratus muscles into elevation of the midabdomen and frontal pelvis.","chinese":"它将前锯肌的提升力传导到中腹部和骨盆前侧。"},{"english":"Such bone-conducted audio reaches the cochlea directly, completely bypassing the eardrum.","chinese":"这种通过骨传导的声音完全绕过耳鼓，直接传入耳蜗。"},{"english":"The potentials and fluxes at the interior points close to the boundary are computed for three-dimensional beat conduction examples.","chinese":"对三维热传导算例，计算了近边界点的温度和热流。"},{"english":"It was proved that the metabolism of conductive tissue is glycolytic.","chinese":"表明传导组织是以无氧代谢为其主要代谢途径。"},{"english":"The flow and heat transfer calculations are performed inside the computational domain.","chinese":"流动和热传导计算在计算的领域内部被执行。"},{"english":"Prolonged ventricular repolarization, an electrical conduction anomaly that could lead to heart rhythm abnormalities.","chinese":"心室复极延长，一种能引起心律失常的异常电传导。"},{"english":"It is the base of research on heat expansion and heat transfer of single screw compressors.","chinese":"它是研究单螺杆压缩机热膨胀及热传导的基础。"},{"english":"Novartis, East Hanover, NJ)is the first selective signal transduction inhibitors in the management of tumour malignancies.","chinese":"格列卫是第一个治疗恶性肿瘤的细胞信号传导抑制剂。"},{"english":"Lessons are then conducted with those psychically bound to us.","chinese":"课程被传导至心灵与我们相连的人那里。"}],"related":[{"definition":["to transmit\/to pass on to sb else\/(math.) transitive"],"pinyin":["chuan2 di4"],"word":"传递"},{"definition":["to pull back\/to shrink\/to contract\/(physiology) systole"],"pinyin":["shou1 suo1"],"word":"收缩"},{"definition":["to transmit\/transmission"],"pinyin":["chuan2 shu1"],"word":"传输"},{"definition":["macro-\/macroscopic\/holistic"],"pinyin":["hong2 guan1"],"word":"宏观"},{"definition":["center\/backbone\/hub (e.g. of transport network)\/the central administration"],"pinyin":["zhong1 shu1"],"word":"中枢"},{"definition":["negative feedback"],"pinyin":["fu4 fan3 kui4"],"word":"负反馈"},{"definition":["to spread\/to proliferate\/to diffuse\/spread\/proliferation\/diffusion"],"pinyin":["kuo4 san4"],"word":"扩散"},{"definition":["to undulate\/to fluctuate\/wave motion\/rise and fall"],"pinyin":["bo1 dong4"],"word":"波动"},{"definition":["to release\/to set free\/to liberate (a prisoner)\/to discharge"],"pinyin":["shi4 fang4"],"word":"释放"},{"definition":["resonance (physics)"],"pinyin":["gong4 zhen4"],"word":"共振"},{"definition":["to shift\/to divert or distract (attention etc)\/to change\/to transform\/metastasis (medicine)\/to evacuate (people)"],"pinyin":["zhuan3 yi2"],"word":"转移"},{"definition":["heat transfer\/thermal conduction"],"pinyin":["re4 chuan2 dao3"],"word":"热传导"},{"definition":["to disturb\/to stir up\/disturbance\/agitation\/turmoil"],"pinyin":["rao3 dong4"],"word":"扰动"},{"definition":["to weaken\/to attenuate"],"pinyin":["shuai1 jian3"],"word":"衰减"},{"definition":["(lit. and fig.) to permeate\/to seep into\/(of a product, idea etc) to penetrate (in a population)\/(of hostile forces) to infiltrate\/(chemistry) osmosis"],"pinyin":["shen4 tou4"],"word":"渗透"},{"definition":["superposition\/layering\/overlay"],"pinyin":["die2 jia1"],"word":"叠加"}]}