{"definition":["to send back"],"pinyin":["chuan2 hui2"],"traditional":["傳回"],"rank":21775.0,"normalized_rank":0.3046605011682733,"fraction":0.0000020042728168143287,"cumulative_fraction":0.978720668202868,"word":"传回","characters":[{"definition":["to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)","biography\/historical narrative\/commentaries\/relay station"],"pinyin":["chuan2","zhuan4"],"word":"传"},{"definition":["to curve\/to return\/to revolve","to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)","variant of 迴|回[hui2]"],"pinyin":["hui2","hui2","hui2"],"word":"回"}],"containing_words":[],"sentences":[{"english":"If the user is not permitted to see any child nodes, an empty collection is returned.","chinese":"如果使用者不允许检视任何子节点，则会传回空集合。"},{"english":"Shows how to reduce the amount of data returned through a data service query.","chinese":"说明如何减少资料服务查询所传回的资料量。"},{"english":"Returns the default property for the specified component with a custom type descriptor.","chinese":"使用自订型别描述项，传回指定元件的预设属性。"},{"english":"The sending application specifies response queues when the application sends its messages.","chinese":"传回至回应伫列的讯息是应用程式指定的。"},{"english":"Is there any information from Moon rover, what was seen on moon?","chinese":"月球车是否传回任何信息，能看到月球上的什么吗？"},{"english":"It transmits about 120 gigabytes of information every week.","chinese":"它每周传回大约120吉比特的信息。"},{"english":"Arrays that are returned by properties are not write-protected, even if the property is read-only.","chinese":"即使属性是唯读，所传回的阵列不会是写入保护。"},{"english":"Returns the largest integer less than or equal to the specified decimal number.","chinese":"传回小于或等于指定的十进位数字的最大整数。"},{"english":"Returns the type or member identified by the specified metadata token.","chinese":"传回指定之中继资料语汇基元所识别的型别或成员。"},{"english":"Returns the encoding associated with the specified code page name.","chinese":"传回与指定字码页名称相关联的编码方式。"},{"english":"Returns the encoding associated with the specified code page identifier.","chinese":"传回与指定字码页识别项相关联的编码方式。"},{"english":"The method returns immediately if a message already exists in the queue.","chinese":"如果伫列中已有讯息，方法会立即传回。"},{"english":"Returns an enumerable collection of file system information in the current directory.","chinese":"传回目前目录中档案系统资讯的可列举集合。"},{"english":"Returns the value of a base expression taken to a specified power.","chinese":"传回指定乘幂值的基底运算式值。"},{"english":"Returns a filtered collection of elements that contains the ancestors of every node in the source collection.","chinese":"传回包含来源集合中每个节点祖系的已筛选项目集合。"},{"english":"Returns a string representing the path to the known local user configuration file.","chinese":"传回字串，表示已知本机使用者组态档的路径。"}],"related":[{"definition":["to send back\/to return"],"pinyin":["fa1 hui2"],"word":"发回"},{"definition":["information\/news\/message\/text message or SMS"],"pinyin":["xun4 xi1"],"word":"讯息"},{"definition":["information\/intelligence"],"pinyin":["qing2 bao4"],"word":"情报"},{"definition":["to summon (a witness)\/to subpoena"],"pinyin":["chuan2 xun4"],"word":"传讯"},{"definition":["news of sb's death"],"pinyin":["si3 xun4"],"word":"死讯"},{"definition":["intelligence gatherer\/spy\/detective\/scout\/sound (medical instrument)\/long and narrow probing and sampling utensil"],"pinyin":["tan4 zi5"],"word":"探子"},{"definition":["to convey\/to deliver"],"pinyin":["chuan2 song4"],"word":"传送"},{"definition":["to monitor\/to keep a close watch over\/surveillance"],"pinyin":["jian1 shi4"],"word":"监视"},{"definition":["reception (of transmitted signal)\/to receive\/to accept\/to admit\/to take over (e.g. a factory)\/to expropriate"],"pinyin":["jie1 shou1"],"word":"接收"},{"definition":["to get in touch with\/to contact\/to stay in contact (with)\/liaison\/(math.) connection"],"pinyin":["lian2 luo4"],"word":"联络"},{"definition":["signal"],"pinyin":["xun4 hao4"],"word":"讯号"},{"definition":["to spread widely"],"pinyin":["chuan2 bian4"],"word":"传遍"},{"definition":["to examine\/to probe\/to scout out\/to nose around"],"pinyin":["tan4 cha2"],"word":"探查"},{"definition":["to blockade\/to seal off"],"pinyin":["feng1 suo3"],"word":"封锁"},{"definition":["to investigate a crime\/to scout\/to reconnoiter\/reconnaissance\/detection\/a scout"],"pinyin":["zhen1 cha2"],"word":"侦察"},{"definition":["to make inquiries\/to try to find out\/to pry"],"pinyin":["tan4 ting1"],"word":"探听"}]}