{"definition":["residual heat\/surplus heat\/fig. old people's capacity for work"],"pinyin":["yu2 re4"],"traditional":["餘熱"],"rank":20888.0,"normalized_rank":0.29225022036293424,"fraction":0.0000021798839019292333,"cumulative_fraction":0.9768677223630512,"word":"余热","characters":[{"definition":["extra\/surplus\/remaining\/remainder after division\/(following numerical value) or more\/in excess of (some number)\/residue (math.)\/after\/I\/me","surname Yu","(archaic) I\/me\/variant of 餘|余[yu2], surplus"],"pinyin":["yu2","Yu2","yu2"],"word":"余"},{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"热"}],"containing_words":[],"sentences":[{"english":"He will return to San Paolo and perhaps continue playing there.","chinese":"而他将会返回圣保罗，继续发挥余热。"},{"english":"However he now has a chance to revive the embers of his career with Lecce.","chinese":"而现在，他有机会在莱切发挥自己职业生涯的余热。"},{"english":"The residual energy of heat will be excluded from the machine.","chinese":"直燃机排出的余热以热能的形式存在。"},{"english":"These retired men are content to devote their remaining energy here.","chinese":"能够来这里发挥余热，这些退休老人也得其所哉。"},{"english":"The steam used for production will adopt the residual heat from the thermal power plant of Tianyuan Salt Factory of Pingdingshan Haolong Corporation.","chinese":"生产用蒸汽利用平顶山皓龙公司天源制盐厂电厂余热。"},{"english":"The utility model relates to a high-efficient energy-saving heat exchanger, particularly a waste heat recovery and reuse device of a boiler.","chinese":"高效节能换热装置涉及一种锅炉余热回收利用装置。"},{"english":"The power generation technology utilizing the temperature difference of engine exhaust gas is introduced.","chinese":"介绍了利用发动机排气余热的温差发电技术。"},{"english":"Excess heat in the commodity above the disired transit temperature.","chinese":"货物本身高于所需运输温度的那部分余热。"},{"english":"They tried to recuperated waste heat to produce electric current.","chinese":"他们试图回收余热发电。"},{"english":"This paper analyzes the process of decay heat removal after Chinese Experimental Fast Reactor(CEFR) scram .","chinese":"分析了中国实验快堆事故停堆后余热的排放过程。"},{"english":"Waste heat accounts for about 40% of the energy produced by power stations.","chinese":"余热约占发电站产生能源的40%。"},{"english":"Tradditionally the power generation with waste gas of long dry kiln is considered as one of the energy saving measures.","chinese":"利用干法窑的窑尾余热发电是一项传统的节能措施。"},{"english":"The heat pipe air preheaters are widely used in the recovery of waste heat of gas.","chinese":"热管式空气预热器广泛应用于烟气的余热回收。"},{"english":"And it would serve as a subplot in the eventual unraveling and dissolution of the Soviet Union.","chinese":"并且在苏联最终解体中也发挥了余热。"},{"english":"You body's afterheat, rapid palpitation, not tranquil lips.","chinese":"你身体的余热，急促的心跳，不平静的吻。"},{"english":"Economizer leakage is a main problem in running of heat recovery boiler.","chinese":"省煤器泄漏是余热锅炉运行中常遇到的问题。"}],"related":[{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"热"},{"definition":["steam\/heat\/CL:股[gu3]"],"pinyin":["re4 qi4"],"word":"热气"},{"definition":["to ignite\/to combust\/to burn\/combustion\/flaming"],"pinyin":["ran2 shao1"],"word":"燃烧"},{"definition":["heat source"],"pinyin":["re4 yuan2"],"word":"热源"},{"definition":["fire\/urgent\/ammunition\/fiery or flaming\/internal heat (Chinese medicine)\/hot (popular)\/classifier for military units (old)\/Kangxi radical 86","surname Huo"],"pinyin":["huo3","Huo3"],"word":"火"},{"definition":["temperature\/heat\/short-lived enthusiasm"],"pinyin":["re4 du4"],"word":"热度"},{"definition":["lit. an old steed in the stable still aspires to gallop 1000 miles (idiom); fig. aged person with great aspirations"],"pinyin":["lao3 ji4 fu2 li4"],"word":"老骥伏枥"},{"definition":["warmth"],"pinyin":["nuan3 yi4"],"word":"暖意"},{"definition":["to stop burning\/to go out (of fire)\/to die out\/extinguished"],"pinyin":["xi1 mie4"],"word":"熄灭"},{"definition":["stove\/oven\/furnace"],"pinyin":["lu2 zi5"],"word":"炉子"},{"definition":["to cool off\/cooling"],"pinyin":["leng3 que4"],"word":"冷却"},{"definition":["oven"],"pinyin":["hong1 lu2"],"word":"烘炉"},{"definition":["tepid\/to warm up (food etc)"],"pinyin":["wen1 re4"],"word":"温热"},{"definition":["heat"],"pinyin":["re4 li4"],"word":"热力"},{"definition":["steam"],"pinyin":["zheng1 qi4"],"word":"蒸汽"},{"definition":["to preheat\/warm-up"],"pinyin":["yu4 re4"],"word":"预热"}]}