{"definition":["to use\/to exert"],"pinyin":["shi3 chu1"],"traditional":["使出"],"rank":12693.0,"normalized_rank":0.17759153806332462,"fraction":0.000005566272889872335,"cumulative_fraction":0.9479679751064818,"word":"使出","characters":[{"definition":["to make\/to cause\/to enable\/to use\/to employ\/to send\/to instruct sb to do sth\/envoy\/messenger"],"pinyin":["shi3"],"word":"使"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"He put forth all his strength and uprooted the tree.","chinese":"他使出全部的力气，把树拔了起来。"},{"english":"So basically, the bow doesn't put-out as much energy as you put-in.","chinese":"所以基本上，船首不会使出更多能源作为你的。"},{"english":"He is a cheeper apparently, I make him purposely happy, exert all over skill.","chinese":"他明显是个雏，我有心让他快乐，使出了浑身解数。"},{"english":"But I expect a full strenght team to play against the Hammers.","chinese":"但是我期待我们队能够使出全力去击败斧头帮。"},{"english":"Now China will pull out all the stops to make sure Modiji doesn't become PM.","chinese":"现在中国会使出所有招数以确保穆迪当不成总理。"},{"english":"Lucy: If you're ever in an argument, you can always trump with a dead mother.","chinese":"如果相持不下就使出你死老妈子的绝招。"},{"english":"Putting forth a great effort,he uprooted the tree.","chinese":"他使出了很大的劲，把那棵树连根拔起。"},{"english":"She swung the hammer at his head with all her might.","chinese":"她使出全身力气抡起榔头砸向他的脑袋。"},{"english":"A man's whole strength is required to successfully carry out these singular ascents .","chinese":"他得使出全身力气才能巧妙地自个儿直升上去。"},{"english":"How are we to know what sort of a hanky-panky trick you're up to?","chinese":"我们怎知道你会使出怎样的卑劣手段。"},{"english":"He hit it with his blood mushed hands driving a good harpoon with all his strength.","chinese":"他使出全身的力气，用糊着鲜血的双手，把一支好。"},{"english":"Town Mouse and Country Mouse ran away as fast as they could.","chinese":"城里老鼠和乡下老鼠都使出了吃奶的劲拼命逃着。"},{"english":"Both of the wrestlers tried to tumble the adversary with all their strength.","chinese":"双方摔跤运动员都使出了全身气力想把对手摔倒。"},{"english":"When he threatened to kill Pentangeli's family members Godfather was hitting the soft underbelly.","chinese":"教父使出围魏救赵之计，威胁杀害老潘的家人来解危。"},{"english":"They make seductive women to corrupt GetWord(\"corrupt\"); the enemy.","chinese":"他们对敌人使出了美人计。"},{"english":"It was a wake-up call for Milan who began to take the game seriously and utilise all their assets.","chinese":"米兰方才如梦初醒，认真对待比赛，使出浑身解数。"}],"related":[{"definition":["move (in chess, on stage, in martial arts)\/gambit\/trick\/scheme\/movement\/same as 著數|着数[zhao1 shu4]"],"pinyin":["zhao1 shu4"],"word":"招数"},{"definition":["to use fully\/to put to use"],"pinyin":["shi1 zhan3"],"word":"施展"},{"definition":["unique skill\/unexpected tricky move (as a last resort)\/masterstroke\/finishing blow"],"pinyin":["jue2 zhao1"],"word":"绝招"},{"definition":["to give it your all\/to go at it with all you've got\/to throw your whole weight behind it\/also pr. [hun2 shen1 jie3 shu4]"],"pinyin":["hun2 shen1 xie4 shu4"],"word":"浑身解数"},{"definition":["consummate skill\/supreme feat\/tour-de-force\/stunt"],"pinyin":["jue2 ji4"],"word":"绝技"},{"definition":["style\/manner"],"pinyin":["zhao1 shi4"],"word":"招式"},{"definition":["to exhaust\/to use up completely"],"pinyin":["yong4 jin4"],"word":"用尽"},{"definition":["to make a move (in martial arts or figuratively)"],"pinyin":["chu1 zhao1"],"word":"出招"},{"definition":["to brandish (a figurative weapon, i.e. some measure intended to deal with the situation)\/to resort to (some tactic)"],"pinyin":["ji4 chu1"],"word":"祭出"},{"definition":["(fig.) trump card"],"pinyin":["sha1 shou3 jian3"],"word":"杀手锏"},{"definition":["talent\/ability\/capability\/martial arts technique\/Taiwan pr. [jie3 shu4]"],"pinyin":["xie4 shu4"],"word":"解数"},{"definition":["to resist\/to ward off\/to hold one's own\/to receive guests"],"pinyin":["zhao1 jia4"],"word":"招架"},{"definition":["to show results\/effective"],"pinyin":["zou4 xiao4"],"word":"奏效"},{"definition":["to stay out of (hot water, trouble, awkward situation etc)\/to avoid (sb)"],"pinyin":["duo3 kai1"],"word":"躲开"},{"definition":["to dodge\/to evade"],"pinyin":["shan3 duo3"],"word":"闪躲"},{"definition":["strength\/CL:把[ba3]"],"pinyin":["li4 qi5"],"word":"力气"}]}