{"definition":["to comply with\/to obey"],"pinyin":["yi1 cong2"],"traditional":["依從"],"rank":49923.0,"normalized_rank":0.6984875407496537,"fraction":1.4510176110076056e-7,"cumulative_fraction":0.9989488753977244,"word":"依从","characters":[{"definition":["to depend on\/to comply with or listen to sb\/according to\/in the light of"],"pinyin":["yi1"],"word":"依"},{"definition":["surname Cong","from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor"],"pinyin":["Cong2","cong2"],"word":"从"}],"containing_words":[],"sentences":[{"english":"And the inhaling steroids compliance and lung function were compared.","chinese":"并观察依从性与哮喘肺功能改善的关系。"},{"english":"Introduction of additional cleaning services is easier than improvements in hand-hygiene compliance.","chinese":"倡导更多的清洁比提高手卫生的依从性容易。"},{"english":"Irbesartan therapy was well tolerated and was not associated with an excess of any side effects.","chinese":"依贝沙坦治疗依从性良好，无过度副作用。"},{"english":"Attention should be paid to drug resistance and dependence in the discharge medication of tuberculosis patients.","chinese":"对结核病患者出院带药应该注意耐药性和患者依从性。"},{"english":"Under His teaching every relationship becomes a lesson in love. T-20. V. 3","chinese":"依从他的教诲每一种关系都成了关于爱的课程。"},{"english":"Objective To explore the compliance of the patients with remission stage of bronchial asthma and the relative factors.","chinese":"目的探讨缓解期哮喘患者用药依从性及其影响因素。"},{"english":"Rhema I will let down the net .","chinese":"但依从你的话，我就下网。"},{"english":"Objective To observe the use of anti-hypertensive and to evaluate the compliance of patients at community.","chinese":"目的探讨社区高血压患者药物应用情况及依从性。"},{"english":"Objective:To probe into the influence of nursing intervention on medicine- taking compliance of schizophrenia patients.","chinese":"探讨护理干预对精神分裂症病人服药依从性的影响。"},{"english":"How much adherence is required for ARVs to be effective?","chinese":"需要怎样的依从性才能使抗病毒药物有效？"},{"english":"This kind of information is essential to an organisation's strategic compliance programme, \" said Woburn.\"","chinese":"这类信息对一个企业的战略依从程序尤为重要。"},{"english":"But because you say so, I will let down the nets.","chinese":"但依从你的话，我就下网。"},{"english":"Patients' medication adherence significantly improved with FDC.","chinese":"FDC制剂可以显著改善患者的服药依从性。"},{"english":"H. Was adherence acceptable in all groups?","chinese":"组内的依从性是否可接受？"},{"english":"Eloise got up from the window seat and felt in the dark for her shoes.","chinese":"艾萝依从窗座起身摸黑找她的鞋子。"},{"english":"RESULTS The level of compliance at the end of duty was 95.0%.","chinese":"结果工作结束后洗手依从性为95。"}],"related":[{"definition":["to disobey\/to defy\/deliberately going against (rule, convention, sb's wishes etc)"],"pinyin":["wei2 ao4"],"word":"违拗"},{"definition":["to comply with\/to follow (directives)\/to defer (to the judgment of superiors)"],"pinyin":["zun1 cong2"],"word":"遵从"},{"definition":["to obey\/to observe\/to follow"],"pinyin":["zun1 cong2"],"word":"尊从"},{"definition":["obedient\/to comply\/to submit\/to defer"],"pinyin":["shun4 cong2"],"word":"顺从"},{"definition":["to allow (sb to do as he pleases)"],"pinyin":["ting1 ping2"],"word":"听凭"},{"definition":["to let (sth happen)\/to allow (sb to do sth)\/to submit to\/to yield"],"pinyin":["ting1 ren4"],"word":"听任"},{"definition":["to disobey\/to defy an edict\/to violate\/to go against\/to run counter to"],"pinyin":["wei2 ni4"],"word":"违逆"},{"definition":["to give one's assent\/to consent"],"pinyin":["ying4 yun3"],"word":"应允"},{"definition":["to conform\/to obey faithfully"],"pinyin":["zun1 feng4"],"word":"遵奉"},{"definition":["disobedient\/to violate the Mandate of Heaven (天命[Tian1 Ming4])"],"pinyin":["wei2 ming4"],"word":"违命"},{"definition":["to comply"],"pinyin":["yi1 shun4"],"word":"依顺"},{"definition":["to adhere strictly (to the rules)"],"pinyin":["jin3 shou3"],"word":"谨守"},{"definition":["already"],"pinyin":["ji4 yi3"],"word":"既已"},{"definition":["to obey an order\/to take orders\/to accept a state of affairs"],"pinyin":["ting1 ming4"],"word":"听命"},{"definition":["to observe\/to obey\/to follow\/to comply with"],"pinyin":["zun1"],"word":"遵"},{"definition":["firm view\/definite opinion"],"pinyin":["ding4 jian4"],"word":"定见"}]}