{"definition":["to place particular emphasis on"],"pinyin":["ce4 zhong4"],"traditional":["側重"],"rank":10140.0,"normalized_rank":0.14187175576791236,"fraction":0.000008098692760673135,"cumulative_fraction":0.9308423036960914,"word":"侧重","characters":[{"definition":["the side\/to incline towards\/to lean\/inclined\/lateral\/side","lean on one side"],"pinyin":["ce4","zhai1"],"word":"侧"},{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["zhong4","chong2"],"word":"重"}],"containing_words":[{"definition":["main point\/emphasis"],"pinyin":["ce4 zhong4 dian3"],"word":"侧重点"}],"sentences":[{"english":"The second chapter questioned the ancient Greek's thoughts about heroes and women.","chinese":"第二章侧重于对古希腊人英雄观与女性观的质疑。"},{"english":"The top-down approach or sometimes known as the Economy-Industry-Company (EIC) model emphasises the market over the company.","chinese":"从上至下的方法侧重于整体市场。"},{"english":"A change in emphasis will be essential.","chinese":"侧重点的改变至关重要。"},{"english":"Third, our institutions must be effective and be focused on delivering results.","chinese":"第三，我们的机构必须具有效益并侧重于产生实效。"},{"english":"This paper centers on how to construct the consuming housing finance system.","chinese":"本文研究的住房金融体系侧重于消费性住房金融方面。"},{"english":"That school puts particular emphasis on arithmetic and reading.","chinese":"那所学校侧重算术和阅读。"},{"english":"Nowadays its keystone is to treat the police with true feelings.","chinese":"现阶段从优待警的侧重点是以情待警。"},{"english":"Huhne’s reforms, worked out in conjunction with the Treasury, focus on four areas.","chinese":"胡纳的改革，曾与财政部一起进行，侧重于四个领域。"},{"english":"Stresses manages the pattern reform to the person military institute the strategy exploration.","chinese":"侧重于人武学院管理模式改革的策略探索。"},{"english":"This paper focuses on basic research of hearing science and the clinical research of diagnostic audiology .","chinese":"本文侧重于基础听力学研究和诊断听力学的进展。"},{"english":"The developing direction and major project of biopesticides in China were suggested in the paper as well.","chinese":"并提出了我国发展生物农药的方向和侧重点。"},{"english":"This paper focuses on the investigation on the self-access learning ability of non-English major freshmen.","chinese":"本文侧重调查非英语专业新生的英语自主性学习能力。"},{"english":"The emphasis is given to the denotational description of code generation languages.","chinese":"本文侧重讨论了代码生成语言的指称描述。"},{"english":"For-profit medical research is even more focused on servicing the needs of those with higher incomes.","chinese":"营利性医学研究更侧重于为那些高收入群体服务。"},{"english":"They angled their column towards modern young women.","chinese":"他们使其栏目侧重于现代年轻女性。"},{"english":"Research-map caters to the needs of specific research, while teaching-map served knowledge propoganda.","chinese":"科研地图面向专业科研，而教学地图侧重知识普及。"}],"related":[{"definition":["main point\/emphasis"],"pinyin":["ce4 zhong4 dian3"],"word":"侧重点"},{"definition":["to stress in a prejudiced way\/to emphasize sth unduly"],"pinyin":["pian1 zhong4"],"word":"偏重"},{"definition":["to pay attention to\/to emphasize"],"pinyin":["zhu4 zhong4"],"word":"注重"},{"definition":["to put emphasis on\/to stress"],"pinyin":["zhuo2 zhong4"],"word":"着重"},{"definition":["place of interest\/a place one has one's eye on"],"pinyin":["zhuo2 yan3 dian3"],"word":"着眼点"},{"definition":["to attend simultaneously to two or more things\/to balance (career and family, family and education etc)"],"pinyin":["jian1 gu4"],"word":"兼顾"},{"definition":["different\/distinct\/not the same\/not alike"],"pinyin":["bu4 tong2"],"word":"不同"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"层面"},{"definition":["subdivision\/segmentation"],"pinyin":["xi4 fen1"],"word":"细分"},{"definition":["to emphasize (a statement)\/to stress"],"pinyin":["qiang2 diao4"],"word":"强调"},{"definition":["partial towards sth\/to prefer\/to incline\/erroneous tendencies (Leftist or Revisionist deviation)"],"pinyin":["pian1 xiang4"],"word":"偏向"},{"definition":["main\/principal\/major\/primary"],"pinyin":["zhu3 yao4"],"word":"主要"},{"definition":["focus\/direction\/purpose\/relevance"],"pinyin":["zhen1 dui4 xing4"],"word":"针对性"},{"definition":["to incline to\/to prefer\/to be prone to"],"pinyin":["qing1 xiang4 yu2"],"word":"倾向于"},{"definition":["to consider\/to give serious consideration to sth\/consideration"],"pinyin":["kao3 liang2"],"word":"考量"},{"definition":["important point\/main point\/focus\/key (project etc)\/to focus on\/to put the emphasis on","to recount (e.g. results of election)\/to re-evaluate"],"pinyin":["zhong4 dian3","chong2 dian3"],"word":"重点"}]}