{"definition":["plain\/informal\/suitable\/convenient\/opportune\/to urinate or defecate\/equivalent to 就[jiu4]: then\/in that case\/even if\/soon afterwards","see 便宜|便宜[pian2 yi5]"],"pinyin":["bian4","pian2"],"traditional":["便","便"],"rank":597.0,"normalized_rank":0.008352804555566437,"fraction":0.00025545106650738154,"cumulative_fraction":0.5391528456410797,"word":"便","components":{"unicode":"U+4FBF","character":"便","decomposition":"⿰亻更","decomposition_definitions":[{"word":"⿰"},{"definition":["\"person\" radical in Chinese characters (Kangxi radical 9)"],"pinyin":["ren2"],"word":"亻"},{"definition":["more\/even more\/further\/still\/still more","to change or replace\/to experience\/one of the five two-hour periods into which the night was formerly divided\/watch (e.g. of a sentry or guard)"],"pinyin":["geng4","geng1"],"word":"更"}]},"containing_words":[{"definition":["convenient\/suitable\/to facilitate\/to make things easy\/having money to spare\/(euphemism) to relieve oneself"],"pinyin":["fang1 bian4"],"word":"方便"},{"definition":["convenient","cheap\/inexpensive\/small advantages\/to let sb off lightly"],"pinyin":["bian4 yi2","pian2 yi5"],"word":"便宜"},{"definition":["convenient","cheap\/inexpensive\/small advantages\/to let sb off lightly"],"pinyin":["bian4 yi2","pian2 yi5"],"word":"便宜"},{"definition":["even if\/even though\/right away\/immediately"],"pinyin":["ji2 bian4"],"word":"即便"},{"definition":["convenient\/easy\/to facilitate"],"pinyin":["bian4 li4"],"word":"便利"},{"definition":["so that\/so as to\/in order to"],"pinyin":["yi3 bian4"],"word":"以便"},{"definition":["(emphasizes that sth is precisely or exactly as stated)\/precisely\/exactly\/even\/if\/just like\/in the same way as"],"pinyin":["bian4 shi4"],"word":"便是"},{"definition":["as one wishes\/as one pleases\/at random\/negligent\/casual\/wanton"],"pinyin":["sui2 bian4"],"word":"随便"},{"definition":["inconvenient\/inappropriate\/unsuitable\/short of cash"],"pinyin":["bu4 bian4"],"word":"不便"},{"definition":["easy to\/convenient for"],"pinyin":["bian4 yu2"],"word":"便于"},{"definition":["convenient and fast"],"pinyin":["bian4 jie2"],"word":"便捷"},{"definition":["conveniently\/in passing\/without much extra effort"],"pinyin":["shun4 bian4"],"word":"顺便"},{"definition":["civilian clothes\/plain clothes\/plainclothesman"],"pinyin":["bian4 yi1"],"word":"便衣"},{"definition":["instant noodles"],"pinyin":["fang1 bian4 mian4"],"word":"方便面"}],"sentences":[{"english":"E. coli O157:H7 causes abdominal cramping, vomiting and a diarrheal illness, often with bloody stools.","chinese":"H7能引起腹部绞痛，呕吐和腹泻，通常是血便。"},{"english":"When her statement was read a very cleat light was cast upon the situation.","chinese":"她的声明宣读后，情况便显得非常清楚了。"},{"english":"He became garrulous after a few glasses of wine.","chinese":"他几杯酒下肚之后便唠唠叨叨说个没完。"},{"english":"Shepherd's purse green season, and grandmother would have to accompany her mother to pick the fields shepherd's purse.","chinese":"荠菜青青时节，外婆便要母亲陪着去田野里挑荠菜。"},{"english":"The acting career plummeted suddenly, he relied on alcohol to release.","chinese":"演艺事业突然一落千丈，他便借酒浇愁。"},{"english":"but he left it to him on such terms as destroyed half the value of the bequest .","chinese":"但是，因为附有条件，这份遗产便失去了一半价值。"},{"english":"Mr Wei rushed to Taipei during his rest day on a Sunday to see Mr Zhang.","chinese":"魏姓同学便利用星期日赶到台北和张先生见面。"},{"english":"Soon he became the top student at school.","chinese":"很快他便成了学校里的尖子生。"},{"english":"From that day on, the Klatooinians were property of the Hutt criminal empire.","chinese":"从那以后，克拉图因人便归属于赫特人的犯罪帝国。"},{"english":"Yu from East Jiangzhou down to the Three Gorges, Three Gorges will begin dredging project.","chinese":"禹从江州东下来到了三峡，便开始疏浚三峡的工程。"},{"english":"Then when you get older and think back, you’ll be able to enjoy it a second time.","chinese":"当你年老回首往事时，便能再次享受你的一生。"},{"english":"Our parents didn't want us to marry, so we eloped .","chinese":"我们的父母亲不同意我们结婚，所以我们便私奔。"},{"english":"There was no longer any question of discovering a posteriori laws of social change.","chinese":"之后便不再有有关社会变革的法则出现。"},{"english":"Around the 4th century AD, the site of the Oita city was once called \"Bungo\".","chinese":"大约在公元4世纪，大分市所在地域便被称为丰后国。"},{"english":"If I want to buy a car, I have to offer enough money to get it.","chinese":"若我想买一辆车，便要支付足够的金钱。"},{"english":"Is the sky in memory of Feiyan, flew over, they left off.","chinese":"记忆是天空中的飞雁，飞过，便留下过。"}],"related":[{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["thereupon\/as a result\/consequently\/thus\/hence"],"pinyin":["yu2 shi4"],"word":"于是"},{"definition":["(once) again\/also\/both... and...\/and yet\/(used for emphasis) anyway"],"pinyin":["you4"],"word":"又"},{"definition":["from now on\/since then\/henceforth"],"pinyin":["cong2 ci3"],"word":"从此"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"},{"definition":["empress\/queen\/(archaic) monarch\/ruler","back\/behind\/rear\/afterwards\/after\/later\/post-","surname Hou"],"pinyin":["hou4","hou4","Hou4"],"word":"后"},{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["since then\/henceforth"],"pinyin":["zi4 ci3"],"word":"自此"},{"definition":["to begin\/beginning\/to start\/initial\/CL:個|个[ge4]"],"pinyin":["kai1 shi3"],"word":"开始"},{"definition":["afterwards\/following\/later\/after"],"pinyin":["zhi1 hou4"],"word":"之后"},{"definition":["he or him\/(used for either sex when the sex is unknown or unimportant)\/(used before sb's name for emphasis)\/(used as a meaningless mock object)\/other\/another"],"pinyin":["ta1"],"word":"他"},{"definition":["not long (after)\/before too long\/soon\/soon after"],"pinyin":["bu4 jiu3"],"word":"不久"},{"definition":["but\/yet\/however\/while\/to go back\/to decline\/to retreat\/nevertheless\/even though","old variant of 卻|却[que4]"],"pinyin":["que4","que4"],"word":"却"},{"definition":["however\/yet\/but"],"pinyin":["ran2 er2"],"word":"然而"},{"definition":["ability\/talent\/sb of a certain type\/a capable individual\/only\/only then\/just now","a moment ago\/just now\/(indicating sth happening later than expected)\/(preceded by a clause of condition or reason) not until\/(followed by a numerical clause) only"],"pinyin":["cai2","cai2"],"word":"才"},{"definition":["after this\/afterwards\/hereafter"],"pinyin":["ci3 hou4"],"word":"此后"}]}