{"definition":["to restore\/to renovate\/restoration\/(computing) to fix (a bug)"],"pinyin":["xiu1 fu4"],"traditional":["修復"],"rank":5036.0,"normalized_rank":0.07046017377191388,"fraction":0.00002381610384489737,"cumulative_fraction":0.8598056086333508,"word":"修复","characters":[{"definition":["dried meat\/private teacher's remuneration\/withered\/variant of 修[xiu1]","surname Xiu","to decorate\/to embellish\/to repair\/to build\/to write\/to cultivate\/to study\/to take (a class)"],"pinyin":["xiu1","Xiu1","xiu1"],"word":"修"},{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out","to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4","fu4","fu4"],"word":"复"}],"containing_words":[],"sentences":[{"english":"Swelling the fundamental law is one common kind of pressure processes in restoring parts.","chinese":"胀大法是压力加工修复常用的一种方法。"},{"english":"Fix of the console output, resp.","chinese":"修复控制台的输出，分别。"},{"english":"They're perfect for closing open plastic bags, such as rice bags.","chinese":"它们也是修复塑料袋开口的完美选择，比如米袋。"},{"english":"Ceramic restorative material is the best living substitutive material for natural tooth.","chinese":"陶瓷修复材料是最自然逼真的牙体组织人工替代材料。"},{"english":"The upper eyelid scar was repaired by concealing it in the supratarsal fold naturally.","chinese":"修复上睑瘢痕，使瘢痕自然隐蔽在上睑皱襞中。"},{"english":"Danburite is also useful in the repair of the will centers in ascension.","chinese":"赛黄晶在提升中对意愿中心的修复也有帮助。"},{"english":"During that project, the new torch was carefully covered with thin sheets of 24k gold.","chinese":"在修复工程中，新的火炬由24K纯金薄片仔细覆盖。"},{"english":"Bi-pedicle muscular flap were used to reconstruct the larynx.","chinese":"残喉创面修复用双蒂肌软骨膜瓣重建喉功能。"},{"english":"The present invention also provides a method for making a removable prosthodontic device.","chinese":"本发明还提供了制备可移动的口腔修复装置的方法。"},{"english":"PHB is one of the ideal scaffold material in bone tissue engineering.","chinese":"PHB可以作为组织工程材料中的一种来修复骨缺损。"},{"english":"The emergency repair diskette was saved successfully.","chinese":"急修复磁盘已成功保存了。"},{"english":"Oils and acrylics can be repaired.","chinese":"油画颜料和丙烯酸都可以得到修复。"},{"english":"Homes, for small minor quick fix on most soft plastics.","chinese":"用于居家，为小较小快速修复在多数软的塑料。"},{"english":"There were no changes in hemo-dynamics, so they were not repaired again.","chinese":"因不构成血流动力学的改变，未行二次修复。"},{"english":"Regenerative and reparative body oil that helps tissue elasticity, treating and preventing the appearance of stretch marks.","chinese":"再生和修复身体组织弹性，治疗和预防妊娠纹的出现。"},{"english":"Designed to: Keep your PC safe, error-free, and running at top speed.","chinese":"保护系统安全，修复错误，以较高的速度运行。"}],"related":[{"definition":["to mend"],"pinyin":["xiu1 bu3"],"word":"修补"},{"definition":["to restore (sth) to (its) former condition\/to recover from illness\/recovery"],"pinyin":["fu4 yuan2"],"word":"复原"},{"definition":["to suffer damage"],"pinyin":["shou4 sun3"],"word":"受损"},{"definition":["to reinstate\/to resume\/to restore\/to recover\/to regain\/to rehabilitate"],"pinyin":["hui1 fu4"],"word":"恢复"},{"definition":["to spruce up\/to renovate\/to tend (a garden)\/to groom (one's hair)\/to finish (a rough surface)\/to trim (a lawn)\/to touch up (a photo)"],"pinyin":["xiu1 zheng3"],"word":"修整"},{"definition":["to damage\/to injure"],"pinyin":["sun3 huai4"],"word":"损坏"},{"definition":["destruction\/damage\/to wreck\/to break\/to destroy"],"pinyin":["po4 huai4"],"word":"破坏"},{"definition":["to be reborn\/to regenerate\/to be a second so-and-so (famous dead person)\/recycling\/regeneration"],"pinyin":["zai4 sheng1"],"word":"再生"},{"definition":["to reconstruct (an art object)\/to remodel"],"pinyin":["chong2 su4"],"word":"重塑"},{"definition":["to become damaged"],"pinyin":["po4 sun3"],"word":"破损"},{"definition":["to renovate\/to repair (a building)"],"pinyin":["xiu1 shan4"],"word":"修缮"},{"definition":["to harm\/to damage\/to injure\/impairment\/loss\/disability"],"pinyin":["sun3 shang1"],"word":"损伤"},{"definition":["to revise\/to amend"],"pinyin":["xiu1 zheng4"],"word":"修正"},{"definition":["to make better\/to improve\/CL:個|个[ge4]"],"pinyin":["gai3 shan4"],"word":"改善"},{"definition":["to reinforce (a structure)\/to strengthen"],"pinyin":["jia1 gu4"],"word":"加固"},{"definition":["to cause damage to\/to ruin\/to destroy"],"pinyin":["sun3 hui3"],"word":"损毁"}]}