{"definition":["to mend"],"pinyin":["xiu1 bu3"],"traditional":["修補"],"rank":13163.0,"normalized_rank":0.18416744784743888,"fraction":0.0000052322760796122354,"cumulative_fraction":0.9505041647035188,"word":"修补","characters":[{"definition":["dried meat\/private teacher's remuneration\/withered\/variant of 修[xiu1]","surname Xiu","to decorate\/to embellish\/to repair\/to build\/to write\/to cultivate\/to study\/to take (a class)"],"pinyin":["xiu1","Xiu1","xiu1"],"word":"修"},{"definition":["to repair\/to patch\/to mend\/to make up for\/to fill (a vacancy)\/to supplement"],"pinyin":["bu3"],"word":"补"}],"containing_words":[{"definition":["tinker"],"pinyin":["xiu1 bu3 jiang4"],"word":"修补匠"}],"sentences":[{"english":"Can web vulnerability scanners help you remediate the vulnerability?","chinese":"Web漏洞扫描器能帮助我们修补漏洞吗？"},{"english":"For patch updates and to play a fast demo, see below.","chinese":"修补更新和发挥快速演示，见下文。"},{"english":"Filling is stuffing and fixing with slurry mixture of raw lacquer and fine gray gypsum.","chinese":"补灰就是用生漆和细石膏调和成浆状举办填密和修补。"},{"english":"SJL daub can be used to repair cement or concrete products for their outlook defects.","chinese":"SJL胶泥可用于修补混凝土与水泥制品的外观缺陷。"},{"english":"Objective To investigate the feasibility of wrapping a lacerated kidney with pedicled omental graft.","chinese":"目的观察肾脏裂伤后大网膜包肾修补方法的疗效。"},{"english":"You can use it repair a leaky toilet, or to fix a crack on a toilet seat.","chinese":"可以用它修补漏水的马桶，修理马桶座圈的裂缝。"},{"english":"I would not hold this up as comparable to surgical mitral valve repair.","chinese":"我不会认为它的效果与二尖瓣外科修补相当。"},{"english":"We must fight the urge to revamp our diplomatic relations.","chinese":"我们必须极力修补我们的外交关系。"},{"english":"Various properties Of F type rapid road patching material is studied in this paper.","chinese":"本文研究了F型道路快速修补材料的各项性能。"},{"english":"Technology and materials used to repair wooden furniture and cabinets.","chinese":"技术和材料用于修补木制家具和橱柜。"},{"english":"Form later repair a phenomenon, occurrence nerve is colloid the cell is proliferous .","chinese":"以后形成修补现象，出现神经胶质细胞增生。"},{"english":"The mends on your shirt were almost invisible.","chinese":"你衬衣上修补的地方简直看不出来。"},{"english":"Hackers have already attacked several European Web sites using the unpatched exploit.","chinese":"该漏洞尚为被修补，黑客已乘机攻击了数个欧洲网站。"},{"english":"Spirit should be the temple, wisdom to release the monks side by hand touching the edge repair figure of Buddha.","chinese":"灵应寺内，智释和尚正在边用手触摸边修补佛像。"},{"english":"Objective To study the value of ultrasound in incisional hernia before and after its operation.","chinese":"目的探讨超声对切口疝修补手术前后检查的应用价值。"},{"english":"Brush or roller for small areas and touch-up only.","chinese":"小面积施工或修补时可采用刷涂或辊涂。"}],"related":[{"definition":["to restore\/to renovate\/restoration\/(computing) to fix (a bug)"],"pinyin":["xiu1 fu4"],"word":"修复"},{"definition":["to become damaged"],"pinyin":["po4 sun3"],"word":"破损"},{"definition":["to reinforce (a structure)\/to strengthen"],"pinyin":["jia1 gu4"],"word":"加固"},{"definition":["to repair\/to fix\/to prune\/to trim\/(coll.) to sort sb out\/to fix sb"],"pinyin":["xiu1 li3"],"word":"修理"},{"definition":["to spruce up\/to renovate\/to tend (a garden)\/to groom (one's hair)\/to finish (a rough surface)\/to trim (a lawn)\/to touch up (a photo)"],"pinyin":["xiu1 zheng3"],"word":"修整"},{"definition":["to restore (sth) to (its) former condition\/to recover from illness\/recovery"],"pinyin":["fu4 yuan2"],"word":"复原"},{"definition":["defective\/defect"],"pinyin":["que1 sun3"],"word":"缺损"},{"definition":["to damage\/to injure"],"pinyin":["sun3 huai4"],"word":"损坏"},{"definition":["to damage\/to devastate\/to vandalize\/damage\/destruction"],"pinyin":["hui3 huai4"],"word":"毁坏"},{"definition":["to renovate\/to repair (a building)"],"pinyin":["xiu1 shan4"],"word":"修缮"},{"definition":["to suffer damage"],"pinyin":["shou4 sun3"],"word":"受损"},{"definition":["to cause damage to\/to ruin\/to destroy"],"pinyin":["sun3 hui3"],"word":"损毁"},{"definition":["(of a wound) to heal"],"pinyin":["yu4 he2"],"word":"愈合"},{"definition":["to smash to pieces\/to shatter"],"pinyin":["po4 sui4"],"word":"破碎"},{"definition":["to repair (sth broken)\/to restore (sth damaged)\/to establish friendly relations with\/(literary) to do meritorious deeds"],"pinyin":["xiu1 hao3"],"word":"修好"},{"definition":["crack\/gap\/split"],"pinyin":["lie4 hen2"],"word":"裂痕"}]}