{"definition":["to invert"],"pinyin":["dao4 zhi4"],"traditional":["倒置"],"rank":28996.0,"normalized_rank":0.4056916597876121,"fraction":0.0000010287043364960359,"cumulative_fraction":0.9892540323176886,"word":"倒置","characters":[{"definition":["to place upside down\/to invert\/to pour\/to throw out\/to move backwards\/however\/actually\/as a matter of fact\/contrary to expectation","to fall\/to collapse\/to lie horizontally\/to overthrow\/to fail\/to go bankrupt\/to change (trains or buses)\/to move around\/to resell at a profit"],"pinyin":["dao4","dao3"],"word":"倒"},{"definition":["to install\/to place\/to put\/to buy"],"pinyin":["zhi4"],"word":"置"}],"containing_words":[{"definition":["lit. to invert root and branch (idiom); fig. confusing cause and effect\/to stress the incidental over the fundamental\/to put the cart before the horse"],"pinyin":["ben3 mo4 dao4 zhi4"],"word":"本末倒置"},{"definition":["to invert the importance of things (i.e. stress the unimportant and neglect the important)\/lacking a sense of perspective\/to put the cart before the horse"],"pinyin":["qing1 zhong4 dao4 zhi4"],"word":"轻重倒置"}],"sentences":[{"english":"emptying buckets and baths, and storing them upside-down.","chinese":"排空水桶和浴盆，倒置存放。"},{"english":"In his view, people spend far too much time putting the cart before the horse.","chinese":"在他来看，人们老是本末倒置。"},{"english":"Morphology of HSV-1 was identified by inverted microscope.","chinese":"利用倒置显微镜对病毒感染进行形态学鉴定。"},{"english":"My experience with the Range Rover and Land Rover was an upside down experience.","chinese":"我对越野路华家家族的汽车的驾驶经验是本未倒置的。"},{"english":"That man has reversed Genesis- man has make God to his image and likeness.","chinese":"人却本末倒置，以自己的形像塑造天主。"},{"english":"The roofing with waterproof layer under thermal insulation layer is usually called as inversion roofing.","chinese":"通常把防水层设置在保温层之下的屋面称为倒置屋面。"},{"english":"Construction in the field have to understand before proportions.","chinese":"建设部在房价的认识上已经到了本末倒置的地步。"},{"english":"There’s certainly nothingrational about putting the cart before the horse.","chinese":"本末倒置当然没有任何理性可言。"},{"english":"METHOD Cell apoptosis was observed with inverted microscope and flow cytometer.","chinese":"方法运用倒置显微镜观察，流式细胞仪检测分析。"},{"english":"Yet perhaps there's an upside to all of this.","chinese":"也许这有点本末倒置。"},{"english":"Betty Skelton did this while flying about three meters off the ground—upside down.","chinese":"贝蒂斯凯尔顿同时起飞下降约三米的地面，倒置。"},{"english":"This thesis goes deeply into the signal processing and the data timely processing of IGPS.","chinese":"本文主要对倒置GPS信号和数据处理进行研究。"},{"english":"Aspects are used to invert dependencies and decouple code.","chinese":"方面用于倒置依赖和解耦代码。"},{"english":"Death Inverted is the door that not close, the old habit that returns to repeat a lesson .","chinese":"倒置的死是不关上的门，回来重复一门课的老的习惯。"},{"english":"A failure of the cooling system that has crippled the entire plant led to water boiling in the No4 pool.","chinese":"整个核电站的冷却系统故障倒置四号池水燃沸。"},{"english":"Handles lateral velocity variations, velocity inversions and blind zones.","chinese":"处理横向速度变化，速度倒置和盲区。"}],"related":[{"definition":["to turn upside down\/to upend"],"pinyin":["dao4 fang4"],"word":"倒放"},{"definition":["convex surface"],"pinyin":["tu1 mian4"],"word":"凸面"},{"definition":["to roll\/to turn over\/to invert\/to flip"],"pinyin":["fan1 zhuan3"],"word":"翻转"},{"definition":["to place\/to put (at or in a position)\/to be located"],"pinyin":["zhi4 yu2"],"word":"置于"},{"definition":["vertical\/to erect\/to set upright\/vertical stroke in Chinese characters\/young servant (old)"],"pinyin":["shu4 zhi2"],"word":"竖直"},{"definition":["funnel"],"pinyin":["lou4 dou3"],"word":"漏斗"},{"definition":["side wall"],"pinyin":["ce4 bi4"],"word":"侧壁"},{"definition":["base\/pedestal\/foundation"],"pinyin":["di3 zuo4"],"word":"底座"},{"definition":["erect\/upright\/vertical"],"pinyin":["zhi2 li4"],"word":"直立"},{"definition":["to shift\/shift\/translocation\/displacement\/(medicine) dislocation"],"pinyin":["yi2 wei4"],"word":"移位"},{"definition":["roof\/lid"],"pinyin":["ding3 gai4"],"word":"顶盖"},{"definition":["symmetry\/symmetrical"],"pinyin":["dui4 chen4"],"word":"对称"},{"definition":["plane (flat surface)\/print media"],"pinyin":["ping2 mian4"],"word":"平面"},{"definition":["upper part\/top half"],"pinyin":["shang4 ban4 bu4 fen4"],"word":"上半部分"},{"definition":["to bend\/to curve around\/curved\/crooked\/to wind\/to warp"],"pinyin":["wan1 qu1"],"word":"弯曲"},{"definition":["accusation\/suit\/state\/condition\/strong\/great\/-shaped"],"pinyin":["zhuang4"],"word":"状"}]}