{"definition":["migratory bird"],"pinyin":["hou4 niao3"],"traditional":["候鳥"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"候鸟","characters":[{"definition":["to wait\/to inquire after\/to watch\/season\/climate\/(old) period of five days"],"pinyin":["hou4"],"word":"候"},{"definition":["bird\/CL:隻|只[zhi1],群[qun2]\/(dialect) to pay attention to\/(intensifier) damned\/goddam","variant of 屌[diao3]\/penis"],"pinyin":["niao3","diao3"],"word":"鸟"}],"containing_words":[],"sentences":[{"english":"Can migratory birds carry H5N1 over long distances?","chinese":"候鸟会长距离携带H5N1型禽流感病毒吗？"},{"english":"I didn't refute, because I see that only habitat in the cloud of migratory birds.","chinese":"我没有反驳，因为我看到了那只栖在云里的候鸟。"},{"english":"Local wetlands serve as a key attraction for migratory birds arriving at Jiaozhou Bay.","chinese":"当地湿地是候鸟飞来胶州湾的主要吸引力。"},{"english":"The Salyan Rayon is located near wetlands frequented by migratory birds.","chinese":"萨利亚内区地处经常出现候鸟的湿地附近。"},{"english":"As the season changes, migratory birds begin to arrive at the coastal wetland.","chinese":"随着季节的变化，候鸟开始陆续到达沿海的湿地。"},{"english":"for photo of Northern Harriers, Bear River Migratory Bird Refuge, UT","chinese":"这张白尾鹞照片摄于犹他州贝尔河候鸟保护地。"},{"english":"Bird Island in Qinghai Lake on the hundreds of thousands of migratory birds.","chinese":"青海湖鸟岛上有数以十万计的候鸟。"},{"english":"A certain period of the birds North final.","chinese":"某年某月，候鸟北归。"},{"english":"The positive rate of migratory birds is higher than resident birds.","chinese":"候鸟的阳性率极显著高于留鸟。"},{"english":"Migratory birds are not carrying the virus into other nations, Karesh said.","chinese":"卡雷什指出，候鸟没有将病毒带到其他国家。"},{"english":"Large amounts of the virus are known to be excreted in the droppings from infected birds.","chinese":"已知在受染候鸟的粪便中分泌出大量病毒。"},{"english":"Do migratory birds spread highly pathogenic avian influenza viruses?","chinese":"候鸟是否传播高致病性禽流感病毒？"},{"english":"The refuge offers nesting habitats for hundreds of thousands of migratory birds.","chinese":"野保区也是成千上万的候鸟筑巢的栖息地。"},{"english":"Phoenicurus auroreus auroreus is a summer resident bird in Liaoning province, its resident period is more than half a year.","chinese":"北红尾鸲在辽宁省为夏候鸟，居留期长达半年。"},{"english":"Aleutian Tern is another numerous passage migrant in both spring and autumn.","chinese":"白腰燕鸥是另一种在春天和秋天会大量迁徙的候鸟。"},{"english":"White stork is migratory birds, like on the roof or large nests in the trees.","chinese":"白鹳是候鸟，喜欢在屋顶或高大的树上筑巢。"}],"related":[{"definition":["(bird species of China) whooper swan (Cygnus cygnus)"],"pinyin":["da4 tian1 e2"],"word":"大天鹅"},{"definition":["(bird species of China) black-headed gull (Chroicocephalus ridibundus)"],"pinyin":["hong2 zui3 ou1"],"word":"红嘴鸥"},{"definition":["nonmigratory bird"],"pinyin":["liu2 niao3"],"word":"留鸟"},{"definition":["(bird species of China) bar-headed goose (Anser indicus)"],"pinyin":["ban1 tou2 yan4"],"word":"斑头雁"},{"definition":["waterbird"],"pinyin":["shui3 niao3"],"word":"水鸟"},{"definition":["(bird species of China) black-necked crane (Grus nigricollis)"],"pinyin":["hei1 jing3 he4"],"word":"黑颈鹤"},{"definition":["(bird species of China) little egret (Egretta garzetta)"],"pinyin":["bai2 lu4"],"word":"白鹭"},{"definition":["(bird species of China) common crane (Grus grus)"],"pinyin":["hui1 he4"],"word":"灰鹤"},{"definition":["birds"],"pinyin":["niao3 lei4"],"word":"鸟类"},{"definition":["wild goose\/CL:隻|只[zhi1]"],"pinyin":["da4 yan4"],"word":"大雁"},{"definition":["(bird species of China) taiga bean goose (Anser fabalis)"],"pinyin":["dou4 yan4"],"word":"豆雁"},{"definition":["(bird species of China) scaly-sided merganser (Mergus squamatus)"],"pinyin":["Zhong1 hua2 qiu1 sha1 ya1"],"word":"中华秋沙鸭"},{"definition":["wild duck\/mallard (Anas platyrhyncha)"],"pinyin":["ye3 ya1"],"word":"野鸭"},{"definition":["(bird species of China) black stork (Ciconia nigra)"],"pinyin":["hei1 guan4"],"word":"黑鹳"},{"definition":["(bird species of China) ruddy shelduck (Tadorna ferruginea)"],"pinyin":["chi4 ma2 ya1"],"word":"赤麻鸭"},{"definition":["(bird species of China) oriental stork (Ciconia boyciana)"],"pinyin":["dong1 fang1 bai2 guan4"],"word":"东方白鹳"}]}