{"definition":["to draw support from\/with the help of"],"pinyin":["jie4 zhu4"],"traditional":["借助"],"rank":4356.0,"normalized_rank":0.06094609153106768,"fraction":0.00002956397290258595,"cumulative_fraction":0.8418180272148712,"word":"借助","characters":[{"definition":["to lend\/to borrow\/by means of\/to take (an opportunity)","variant of 借[jie4]"],"pinyin":["jie4","jie4"],"word":"借"},{"definition":["to help\/to assist"],"pinyin":["zhu4"],"word":"助"}],"containing_words":[],"sentences":[{"english":"With these components, you are ready to begin the process of automatic dialogue replacement, \" or \"ADR\" for short.","chinese":"借助于这些资料，你便可以开始自动对白替换工作。"},{"english":"With an asynchronous model, the queue itself acts as a relief valve.","chinese":"借助异步模型，队列本身可以充当一个减压阀。"},{"english":"So he hold his realism by developing his theory on verisimilitude.","chinese":"这样他就借助逼真性观念坚持了自己的实在论。"},{"english":"I know radio began by restoring the ancient art of storyteller .","chinese":"我知道，广播的开始是借助于说书人这种古老艺术。"},{"english":"She defeated the bad guy by virtue of her courage and by a pair of vices.","chinese":"由于她的勇气和借助一对老虎钳，她打败了那个坏蛋。"},{"english":"All the drum tiles are connected through a drag spring.","chinese":"所有鼓瓦间借助拉簧连接在一起。"},{"english":"The structures of both are characterized by FT-TR and 1H-NMR.","chinese":"借助红外光谱和1H核磁共振谱图分析了产物的结构。"},{"english":"With multiple nodes, load-balancing and fail-over become possible.","chinese":"借助多个节点，负载平衡和故障转移变得可能。"},{"english":"Telling Holding is keeping a quick growth with capital market.","chinese":"天音控股上市以来借助资本市场保持了快速的发展。"},{"english":"Use the straps inside the bag to prevent the clothes from moving.","chinese":"那就借助包里的带子来阻止衣物移动吧。"},{"english":"They visit quite frequently with their flying saucers and invasive experiments.","chinese":"借助飞碟及其他侵入的实验频繁造访人类。"},{"english":"Qin aggrandizement was aided by frequent military expeditions pushing forward the frontiers in the north and south.","chinese":"秦扩张是借助频繁的军事远征推进边界北部和南部。"},{"english":"China's tourist hotspots are hoping to capitalize on this homebody spirit.","chinese":"中国的旅游热点地区正希望借助这股爱国热情。"},{"english":"With this platform, small porcupines will play a big collective strength.","chinese":"借助这个平台，小豪猪们将发挥出大集体的力量。"},{"english":"Meanwhile, Coca-Cola is trying to get hipper without the help of any celebrities.","chinese":"同时，可口可乐正在尝试不借助名人的效应赶上时代。"},{"english":"Each book carving was made using sharp knives , tweezers, and scissors .","chinese":"每一本书雕都是借助锋利的刀片，镊子和剪刀完成的。"}],"related":[{"definition":["to exploit\/to make use of\/to use\/to take advantage of\/to utilize"],"pinyin":["li4 yong4"],"word":"利用"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通过"},{"definition":["using this as a pretext\/thereby"],"pinyin":["jie4 ci3"],"word":"借此"},{"definition":["to rely on sth (for support etc)\/to depend on"],"pinyin":["yi1 kao4"],"word":"依靠"},{"definition":["to borrow sth for another use\/to borrow an idea for one's own use"],"pinyin":["jie4 yong4"],"word":"借用"},{"definition":["a helping hand\/help\/assistance"],"pinyin":["zhu4 li4"],"word":"助力"},{"definition":["itself\/oneself\/one's own"],"pinyin":["zi4 shen1"],"word":"自身"},{"definition":["with this\/thereby\/thus\/because of this"],"pinyin":["yi3 ci3"],"word":"以此"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推动"},{"definition":["to rely on\/to depend on\/support"],"pinyin":["yi1 tuo1"],"word":"依托"},{"definition":["method\/means (of doing sth)\/strategy\/trick\/CL:個|个[ge4]"],"pinyin":["shou3 duan4"],"word":"手段"},{"definition":["to use\/to put to use"],"pinyin":["yun4 yong4"],"word":"运用"},{"definition":["on the other hand\/another aspect"],"pinyin":["ling4 yi1 fang1 mian4"],"word":"另一方面"},{"definition":["to conform\/to integrate"],"pinyin":["zheng3 he2"],"word":"整合"},{"definition":["to combine\/to link\/to integrate\/binding\/CL:次[ci4]"],"pinyin":["jie2 he2"],"word":"结合"},{"definition":["(aerospace) to boost\/booster (rocket)\/(behavioral economics) to nudge"],"pinyin":["zhu4 tui1"],"word":"助推"}]}