{"definition":["to dump\/to pour\/to empty out","to topple over\/to greatly admire"],"pinyin":["qing1 dao4","qing1 dao3"],"traditional":["傾倒","傾倒"],"rank":13396.0,"normalized_rank":0.18742742014467,"fraction":0.000005059584547034569,"cumulative_fraction":0.951704066491582,"word":"倾倒","characters":[{"definition":["to overturn\/to collapse\/to lean\/to tend\/to incline\/to pour out"],"pinyin":["qing1"],"word":"倾"},{"definition":["to place upside down\/to invert\/to pour\/to throw out\/to move backwards\/however\/actually\/as a matter of fact\/contrary to expectation","to fall\/to collapse\/to lie horizontally\/to overthrow\/to fail\/to go bankrupt\/to change (trains or buses)\/to move around\/to resell at a profit"],"pinyin":["dao4","dao3"],"word":"倒"}],"containing_words":[],"sentences":[{"english":"And why do we fall for it, year after year?","chinese":"而我们又为什么年复一年为之倾倒？"},{"english":"The Righteous One takes note of the house of the wicked and brings the wicked to ruin.","chinese":"义人思想恶人的家，知道恶人倾倒，必至灭亡。"},{"english":"I think back over the compendium of knowledge that exists there, and it still takes my breath away.","chinese":"现在回想起存于其中的知识概要，仍旧令我为之倾倒。"},{"english":"A lorry was going to dump sugarcane into the hopper.","chinese":"拼装车正要倾倒一车甘蔗至转装台的漏斗。"},{"english":"A lorry was dumping sugarcane into the hopper.","chinese":"拼装车正倾倒一车甘蔗至转装台的漏斗。"},{"english":"And he answered and said, Babylon is fallen, is fallen; and all the graven images of her gods he hath broken unto the ground.","chinese":"倾倒了，他一切雕刻的神像，都打碎于地。"},{"english":"Children gathered around a truck as it dumped water in a trash dump near Cité Soleil.","chinese":"日光城附近，儿童聚集在一辆倾倒污水的卡车旁。"},{"english":"The truck dumped two loads of gravel on the driveway.","chinese":"卡车把两卡车砾石倾倒在车道口。"},{"english":"Half of those pass straight through where the rubbish will be.","chinese":"其中一半会直接通向将来垃圾被倾倒的地方。"},{"english":"The sudden canting of the ship had made the deck no place for running on;","chinese":"船身突然倾倒使甲板上没有地方可以躲闪。"},{"english":"Get CLOSE UP of steaming water being poured.","chinese":"给倾倒中冒着热气的水特写。"},{"english":"The only people who have sought physically to stop this dumping are Somali pirates.","chinese":"唯一挺身而出阻止这种倾倒行为的人是索马里海盗。"},{"english":"Her fans were stormed by her performance and her charm.","chinese":"她的表演和魅力使她的狂热爱好者倾倒。"},{"english":"Slope in the upper anchorage or Poding beam fixed to prevent dumping.","chinese":"⑶坡体中上部锚固或坡顶连梁固定防止倾倒。"},{"english":"Western leftists were enamored with its Marxist anti-Americanism.","chinese":"西方的左派被书中马克思主义的反美论调所倾倒。"},{"english":"She was beautiful with that unmistakable beauty that only artists delight in .","chinese":"她的美是一望而知的，只有艺术家才会倾倒的。"}],"related":[{"definition":["to drip\/to flow out\/to sprinkle"],"pinyin":["pao1 sa3"],"word":"抛洒"},{"definition":["to overturn\/to overthrow\/to capsize\/to collapse"],"pinyin":["fan1 dao3"],"word":"翻倒"},{"definition":["to throw\/to cast"],"pinyin":["pao1 zhi4"],"word":"抛掷"},{"definition":["to overflow\/to be brimming over"],"pinyin":["man4 yi4"],"word":"漫溢"},{"definition":["to disperse\/to fall scattered\/to sprinkle"],"pinyin":["san4 luo4"],"word":"散落"},{"definition":["to sprinkle"],"pinyin":["pao1 sa3"],"word":"抛撒"},{"definition":["to scatter\/to disperse"],"pinyin":["pao1 san4"],"word":"抛散"},{"definition":["to pile up\/to stack"],"pinyin":["dui1 fang4"],"word":"堆放"},{"definition":["to waft (through the air)\/to drift"],"pinyin":["piao1 san4"],"word":"飘散"},{"definition":["to collapse (of building)\/to topple over"],"pinyin":["dao3 ta1"],"word":"倒塌"},{"definition":["to cascade down\/to flow in torrents\/(fig.) outpouring (of emotions)"],"pinyin":["qing1 xie4"],"word":"倾泄"},{"definition":["to overturn\/to topple\/to tip"],"pinyin":["qing1 fan1"],"word":"倾翻"},{"definition":["to subside\/to sink\/to cave in"],"pinyin":["ta1 xian4"],"word":"塌陷"},{"definition":["to pour down in torrents"],"pinyin":["qing1 xie4"],"word":"倾泻"},{"definition":["to knock sth over"],"pinyin":["peng4 dao3"],"word":"碰倒"},{"definition":["to bury"],"pinyin":["yan3 mai2"],"word":"掩埋"}]}