{"definition":["to give unequal emphasis to\/doing some things at the expense of others"],"pinyin":["pian1 fei4"],"traditional":["偏廢"],"rank":49517.0,"normalized_rank":0.6928070739999721,"fraction":1.5181673193640945e-7,"cumulative_fraction":0.9988885939367128,"word":"偏废","characters":[{"definition":["to lean\/to slant\/oblique\/prejudiced\/to deviate from average\/to stray from the intended line\/stubbornly\/contrary to expectations"],"pinyin":["pian1"],"word":"偏"},{"definition":["to abolish\/to abandon\/to abrogate\/to discard\/to depose\/to oust\/crippled\/abandoned\/waste","variant of 廢|废[fei4]\/disabled"],"pinyin":["fei4","fei4"],"word":"废"}],"containing_words":[],"sentences":[{"english":"The literary and art works that can last forever all give equal emphasis to emotion and meaning with each supporting the other.","chinese":"中外传世经典文学艺术作品都是情意互证两不偏废的。"},{"english":"Therefore, learning and reflection should be integrated and neither should be overemphasized.","chinese":"因此，学思应当有机结合，不可偏废。"},{"english":"Chengchi paid attention to commerce as well as agriculture, especially water conservancy and flood prevention projects.","chinese":"陈炽注重商业而不偏废农政，对水利河防尤为关注。"},{"english":"No one can ignore the great history achievements of Qian…","chinese":"钱氏史学贡献甚大，治史者莫可偏废。"},{"english":"Equal emphasis should be placed on collective leadership and individual responsibility.","chinese":"集体领导和个人负责，二者不可偏废。"},{"english":"In other words, you have to have both. Product and promotion.","chinese":"换句话说，你必须两手都要抓，产品和促销不可偏废。"}],"related":[{"definition":["to run in parallel without hindrance\/not mutually exclusive\/two processes can be implemented without conflict"],"pinyin":["bing4 xing2 bu4 bei4"],"word":"并行不悖"},{"definition":["to neglect the root and pursue the tip (idiom)\/to neglect fundamentals and concentrate on details"],"pinyin":["she3 ben3 zhu2 mo4"],"word":"舍本逐末"},{"definition":["same as 總而言之|总而言之[zong3 er2 yan2 zhi1]"],"pinyin":["gai4 er2 yan2 zhi1"],"word":"概而言之"},{"definition":["intellectual development"],"pinyin":["zhi4 yu4"],"word":"智育"},{"definition":["to stress\/to emphasize\/particular about sth\/to strive for"],"pinyin":["jiang3 qiu2"],"word":"讲求"},{"definition":["careless\/any-old-how, regardless of the specific task"],"pinyin":["mei2 mao5 hu2 zi5 yi1 ba3 zhua1"],"word":"眉毛胡子一把抓"},{"definition":["to stick to sth stubbornly\/never let go"],"pinyin":["zhu1 shou3"],"word":"株守"},{"definition":["biased\/partial"],"pinyin":["pian1 po1"],"word":"偏颇"},{"definition":["to demand perfection (idiom)"],"pinyin":["qiu2 quan2 ze2 bei4"],"word":"求全责备"},{"definition":["to remedy defects and correct errors (idiom); to rectify past mistakes"],"pinyin":["bu3 pian1 jiu4 bi4"],"word":"补偏救弊"},{"definition":["to reject a word because of the speaker (idiom, from Analects); to judge on preference between advisers rather than the merits of the case"],"pinyin":["yi3 ren2 fei4 yan2"],"word":"以人废言"},{"definition":["to investigate\/dialectical"],"pinyin":["bian4 zheng4"],"word":"辩证"},{"definition":["too far is as bad as not enough (idiom, from the Analects)"],"pinyin":["guo4 you2 bu4 ji2"],"word":"过犹不及"},{"definition":["to advance or retreat, each has its rules (idiom from Zhuangzi); many translations are possible"],"pinyin":["jin4 tui4 zhong1 sheng2"],"word":"进退中绳"},{"definition":["to lay equal stress on\/to pay equal attention to"],"pinyin":["bing4 zhong4"],"word":"并重"},{"definition":["lit. not eating for fear of choking (idiom); fig. to cut off one's nose to spite one's face\/to avoid sth essential because of a slight risk"],"pinyin":["yin1 ye1 fei4 shi2"],"word":"因噎废食"}]}