{"definition":["to put out\/to issue"],"pinyin":["zuo4 chu1"],"traditional":["做出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"做出","characters":[{"definition":["to do\/to make\/to produce\/to write\/to compose\/to act as\/to engage in\/to hold (a party)\/to be\/to become\/to function (in some capacity)\/to serve as\/to be used for\/to form (a bond or relationship)\/to pretend\/to feign\/to act a part\/to put on appearance"],"pinyin":["zuo4"],"word":"做"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"We are now in no way to make any further concession in price.","chinese":"我们应经无法再在价格方面做出让步了。"},{"english":"It's much cheaper to anticipate rather than respond.","chinese":"因为预先做出反应远比事后补救便宜的多。"},{"english":"Boeing says it found problems in the process used to reach the decision.","chinese":"波音公司表示他在过去做出决定的过程中发现了问题。"},{"english":"It is suggested that the government should make efforts to set aside an appropriate fund for the vegetable basket program.","chinese":"人们建议政府应该做出努力，为菜篮子工程拨出专款。"},{"english":"Still, Japan quickly suspended imports of American long-grain rice.","chinese":"日本立即做出反应，暂缓对美国长粒大米的进口。"},{"english":"The author firstly reviews the historical evolution of WTO secretariat.","chinese":"笔者首先从历史的角度对秘书处做出了追根溯源。"},{"english":"Beveling can be done by using a coarse file or, preferably, a beveling tool.","chinese":"坡口可以用粗齿锉做出，或者更好的，用去角刀。"},{"english":"In short, they might make better ethical decisions than people.","chinese":"简言之，它们会比人类做出更恰当的道德判断。"},{"english":"We need to fix it when we do start eating real food.","chinese":"我们需要在吃真正的食物时做出改变。"},{"english":"You may want to make changes in your home environment.","chinese":"本周也许你会希望在你的家庭环境中做出些改变。"},{"english":"Pull the top session of the dress out for the drapery effect both in the front and in the back;","chinese":"将裙子的前后压在里层的部分抽出，做出褶皱的效果。"},{"english":"Today that a panel of arbitrators has decided in favor of our company.","chinese":"今天仲裁团做出了有利于我们公司的裁决。"},{"english":"The horse answered to its rider's touch.","chinese":"马对骑马人的轻击做出了反应。"},{"english":"What can we do to make those cheese spread lighter and creamier , also low in fat?","chinese":"怎样才可以做出低脂又美味的起司抹酱呢？"},{"english":"Which areas of the site are they visiting before they make a purchase?","chinese":"他们在做出购买之前访问了站点的哪些区域？"},{"english":"In taking such steps offenders are seeking forgiveness.","chinese":"冒犯者以这种做出悔改的方式来寻求当事人的宽恕。"}],"related":[{"definition":["to put out\/to come up with\/to make (a choice, decision, proposal, response, comment etc)\/to issue (a permit, statement, explanation, apology, reassurance to the public etc)\/to draw (conclusion)\/to deliver (speech, judgment)\/to devise (explanation)\/to extract"],"pinyin":["zuo4 chu1"],"word":"作出"},{"definition":["to do\/to make\/to produce\/to write\/to compose\/to act as\/to engage in\/to hold (a party)\/to be\/to become\/to function (in some capacity)\/to serve as\/to be used for\/to form (a bond or relationship)\/to pretend\/to feign\/to act a part\/to put on appearance"],"pinyin":["zuo4"],"word":"做"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["to contribute\/to dedicate\/to devote\/contribution\/CL:個|个[ge4]"],"pinyin":["gong4 xian4"],"word":"贡献"},{"definition":["to respond\/response"],"pinyin":["hui2 ying4"],"word":"回应"},{"definition":["to decide (to do something)\/to resolve\/decision\/CL:個|个[ge4],項|项[xiang4]\/certainly"],"pinyin":["jue2 ding4"],"word":"决定"},{"definition":["act\/action\/activity\/move\/movement"],"pinyin":["ju3 dong4"],"word":"举动"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"进行"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["oneself\/one's own"],"pinyin":["zi4 ji3"],"word":"自己"},{"definition":["to select\/to pick\/choice\/option\/alternative"],"pinyin":["xuan3 ze2"],"word":"选择"},{"definition":["to adjust\/adjustment\/revision\/CL:個|个[ge4]"],"pinyin":["tiao2 zheng3"],"word":"调整"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["strategic decision\/decision-making\/policy decision\/to determine policy"],"pinyin":["jue2 ce4"],"word":"决策"},{"definition":["to change\/to alter\/to transform"],"pinyin":["gai3 bian4"],"word":"改变"},{"definition":["to renounce\/to abandon\/to give up"],"pinyin":["fang4 qi4"],"word":"放弃"}]}