{"definition":["to make an issue of sth\/to fuss\/to make a song and dance"],"pinyin":["zuo4 wen2 zhang1"],"traditional":["做文章"],"rank":16622.0,"normalized_rank":0.2325633455990374,"fraction":0.000003431204119389716,"cumulative_fraction":0.9651492794663344,"word":"做文章","characters":[{"definition":["to do\/to make\/to produce\/to write\/to compose\/to act as\/to engage in\/to hold (a party)\/to be\/to become\/to function (in some capacity)\/to serve as\/to be used for\/to form (a bond or relationship)\/to pretend\/to feign\/to act a part\/to put on appearance"],"pinyin":["zuo4"],"word":"做"},{"definition":["language\/culture\/writing\/formal\/literary\/gentle\/(old) classifier for coins\/Kangxi radical 67","surname Wen"],"pinyin":["wen2","Wen2"],"word":"文"},{"definition":["chapter\/section\/clause\/movement (of symphony)\/seal\/badge\/regulation\/order","surname Zhang"],"pinyin":["zhang1","Zhang1"],"word":"章"}],"containing_words":[],"sentences":[{"english":"There are some people discriminating the childern born after 1990s to make small to big purposely.","chinese":"是有些人对90后有歧视，故意大做文章吧？"},{"english":"We rarely see someone go after the health area.","chinese":"我们很少见到有人在健康领域做文章。"},{"english":"Propaganda must be turned out about the touring of the hills surrounding the Westlake.","chinese":"西湖深度开发应在四周山岭旅游上做文章。"},{"english":"The Republicans made a great whoop and a hollar about the honesty of federal employees.","chinese":"共和党人在联邦政府官员的廉洁问题上大做文章。"},{"english":"It is unwise to foster a confrontation over ideological differences.","chinese":"针对意识形态的不同来大做文章是不明智的。"},{"english":"It created a big fuss and the fuss persists to this day.","chinese":"它创造了一个大做文章，大惊小怪坚持到今天。"},{"english":"She's quite useful to the media.","chinese":"她对媒体非常有用，双方都在大做文章。"},{"english":"I think that many people are making exploration on the materials of rice paper and ink.","chinese":"我觉得很多人都是在拿宣纸和墨的材料做文章。"},{"english":"A few tabloid newspapers got hold of this under-the-table gossip.","chinese":"几家街头小报抓住这些私下闲话大做文章。"},{"english":"Why do you always make a fuss over a trivial things?","chinese":"只是点风吹草动，你怎么就大做文章？"},{"english":"The Republicans have only just started to point this out.","chinese":"共和党直到现在才就这个问题开始做文章。"},{"english":"Big consulting companies are also ramping up their data-related practices.","chinese":"大型咨询公司同样在与数据相关的实践上大做文章。"}],"related":[{"definition":["to use the current topic to put over one's own ideas\/to use sth as a pretext to make a fuss"],"pinyin":["jie4 ti2 fa1 hui1"],"word":"借题发挥"},{"definition":["to raise the same topic"],"pinyin":["chong2 ti2"],"word":"重提"},{"definition":["see 下工夫[xia4 gong1 fu5]"],"pinyin":["xia4 gong1 fu5"],"word":"下功夫"},{"definition":["to play tricks\/to cheat\/to deceive"],"pinyin":["gao3 hua1 yang4"],"word":"搞花样"},{"definition":["amusing speech or act\/jokes\/antics\/funny\/amusing\/Taiwan pr. [xue1 tou2]"],"pinyin":["xue2 tou2"],"word":"噱头"},{"definition":["to dig for thoughts (idiom); to search everything for an answer\/to rack one's brains"],"pinyin":["wa1 kong1 xin1 si5"],"word":"挖空心思"},{"definition":["moreover\/besides"],"pinyin":["zai4 zhe3"],"word":"再者"},{"definition":["arrogant\/to put on airs\/(business etc) to expand\/to enlarge\/to do sth on a big scale"],"pinyin":["zuo4 da4"],"word":"做大"},{"definition":["to boost support or interest\/to campaign\/to promote"],"pinyin":["zao4 shi4"],"word":"造势"},{"definition":["to hand someone the swordhilt (idiom)\/to give someone a hold on oneself"],"pinyin":["shou4 ren2 yi3 bing3"],"word":"授人以柄"},{"definition":["to extend the scope\/to exaggerate"],"pinyin":["kuo4 da4 hua4"],"word":"扩大化"},{"definition":["in short\/in a word\/in brief"],"pinyin":["zong3 er2 yan2 zhi1"],"word":"总而言之"},{"definition":["to take an alternate route (idiom)\/to find an alternative\/to take a different approach\/to blaze a new trail"],"pinyin":["ling4 pi4 xi1 jing4"],"word":"另辟蹊径"},{"definition":["to carry (hanging down from the hand)\/to lift\/to put forward\/to mention\/to raise (an issue)\/upwards character stroke\/lifting brush stroke (in painting)\/scoop for measuring liquid"],"pinyin":["ti2"],"word":"提"},{"definition":["place of interest\/a place one has one's eye on"],"pinyin":["zhuo2 yan3 dian3"],"word":"着眼点"},{"definition":["to have an ulterior motive (idiom)"],"pinyin":["bie2 you3 yong4 xin1"],"word":"别有用心"}]}