{"definition":["to cease trading (temporarily or permanently)\/to close down"],"pinyin":["ting2 ye4"],"traditional":["停業"],"rank":11243.0,"normalized_rank":0.15730415681446142,"fraction":0.000006818031040213404,"cumulative_fraction":0.9390337996893552,"word":"停业","characters":[{"definition":["to stop\/to halt\/to park (a car)"],"pinyin":["ting2"],"word":"停"},{"definition":["surname Ye","line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already"],"pinyin":["Ye4","ye4"],"word":"业"}],"containing_words":[],"sentences":[{"english":"Cameroon Ministry of Communications has also ordered three companies of informal long-distance passenger business for rectification.","chinese":"喀交通部还勒令三家非正规长途客运公司停业整顿。"},{"english":"The next day, the unit will be ordered to suspend business for reorganization.","chinese":"第二天，该单位将被勒令停业整顿业务。"},{"english":"A number of securities companies were closed or temporary closed for reorganizing because of irregular operations.","chinese":"部分证券公司因违规经营被撤销或停业整顿。"},{"english":"The Going-Out-of-Business Sale is, perhaps, the sale where one can get the biggest discounts.","chinese":"“停业销货”可能是顾客可以获得的最大的折扣。"},{"english":"The place or the document has been closed down on the spot, the case for further processing.","chinese":"该场所无证照，已被当场停业，案件在进一步处理中。"},{"english":"Police ordered the club to close its doors for 3 months and pay a fine of RMB20000 for the illegal practice, according to Xinhua.","chinese":"警方已责令该夜总会停业整顿3个月，罚款2万元。"},{"english":"Closed for half a day for stocktaking.","chinese":"今日盘货，停业半天。"},{"english":"Stores were closed, franchisees filed for bankruptcy and sales continued to fall.","chinese":"商店停业，加盟商申请破产，还有销售量的持续下跌。"},{"english":"You will be out of business if you miss the green train.","chinese":"如果错过了这列绿色列车，你必将停业。"},{"english":"This company has been stopped for an audit because of its messy management and tolerance of misconduct.","chinese":"这家公司管理混乱藏污纳垢，已经停业查办了。"},{"english":"The small factory on the street closed down for lacking of materials.","chinese":"街道上的那家小工厂由于没有原料而停业了。"},{"english":"The shops and warehouses are all closed.","chinese":"商店和货栈都停业了。"},{"english":"Storefronts for exporters that have gone out of business are boarded up.","chinese":"出口商的店面因为停业已经用木板封住。"},{"english":"He decided to close out his book store.","chinese":"他决定将他的书店停业。"},{"english":"The so-called \"construction police\" have twice disabled it by demolishing the staircases.","chinese":"所谓的“建设警察”已经两次拆除楼梯迫使它停业。"},{"english":"The pub has been ordered to suspend business.","chinese":"涉案歌舞厅已被责令停业。"}],"related":[{"definition":["to close down (temporarily or permanently)\/to go out of business"],"pinyin":["xie1 ye4"],"word":"歇业"},{"definition":["to close down a business for good and put the best face on it (idiom)"],"pinyin":["guan1 men2 da4 ji2"],"word":"关门大吉"},{"definition":["to go bankrupt\/to close down"],"pinyin":["dao3 bi4"],"word":"倒闭"},{"definition":["to do business\/to trade"],"pinyin":["ying2 ye4"],"word":"营业"},{"definition":["(of a power plant, refinery etc) to shut down"],"pinyin":["guan1 ting2"],"word":"关停"},{"definition":["to stop work\/to shut down\/to stop production"],"pinyin":["ting2 gong1"],"word":"停工"},{"definition":["to open a business\/to open a practice\/open (for business)"],"pinyin":["kai1 ye4"],"word":"开业"},{"definition":["to reform\/to rectify and improve"],"pinyin":["zheng3 gai3"],"word":"整改"},{"definition":["the people are gone and the place is empty (idiom)\/the sight of a deserted place brings old friends to mind\/the place is deserted\/the birds have flown"],"pinyin":["ren2 qu4 lou2 kong1"],"word":"人去楼空"},{"definition":["dining room\/restaurant"],"pinyin":["can1 yin3 dian4"],"word":"餐饮店"},{"definition":["to declare bankruptcy"],"pinyin":["xuan1 bu4 po4 chan3"],"word":"宣布破产"},{"definition":["to stop production"],"pinyin":["ting2 chan3"],"word":"停产"},{"definition":["unlicensed business activity"],"pinyin":["wu2 zhao4 jing1 ying2"],"word":"无照经营"},{"definition":["shop front"],"pinyin":["dian4 mian4"],"word":"店面"},{"definition":["refurbishment\/renovation"],"pinyin":["chong2 xin1 zhuang1 xiu1"],"word":"重新装修"},{"definition":["to go bankrupt\/to become impoverished\/bankruptcy"],"pinyin":["po4 chan3"],"word":"破产"}]}