{"definition":["to substitute on the sly"],"pinyin":["tou1 huan4"],"traditional":["偷換"],"rank":37332.0,"normalized_rank":0.522323115022456,"fraction":4.919446025247114e-7,"cumulative_fraction":0.9953234084858608,"word":"偷换","characters":[{"definition":["to steal\/to pilfer\/to snatch\/thief\/stealthily"],"pinyin":["tou1"],"word":"偷"},{"definition":["to exchange\/to change (clothes etc)\/to substitute\/to switch\/to convert (currency)"],"pinyin":["huan4"],"word":"换"}],"containing_words":[],"sentences":[{"english":"Only in the dark will ring inadvertently substituted.","chinese":"只是在不经意间暗将年轮偷换。"},{"english":"The original blade in early before they tick off pistol in last bullet.","chinese":"原来刀锋早在之前便偷换掉手枪里最后一颗子弹。"},{"english":"The thief interchanged the diamonds with some pieces of glass.","chinese":"那个窃贼将钻石用一些碎玻璃偷换了。"},{"english":"Will the funds be spent on ballet lessons for his daughter or on a stolen vacation?","chinese":"是把钱用在女儿的芭蕾舞课程，抑或用于周末的偷换？"}],"related":[{"definition":["lit. to steal a rafter and replace it with a column\/to replace the original with a fake\/to perpetrate a fraud (idiom)"],"pinyin":["tou1 liang2 huan4 zhu4"],"word":"偷梁换柱"},{"definition":["see 掉包[diao4 bao1]"],"pinyin":["diao4 bao1"],"word":"调包"},{"definition":["to steal sb's valuable item and substitute a similar-looking but worthless item\/to sell a fake for the genuine article\/to palm off"],"pinyin":["diao4 bao1"],"word":"掉包"},{"definition":["to obscure\/to confuse\/to mix up\/to blur\/to mislead"],"pinyin":["hun4 xiao2"],"word":"混淆"},{"definition":["to obscure the facts (idiom); to mislead the public with prevarication and deliberate falsehoods"],"pinyin":["hun4 xiao2 shi4 ting1"],"word":"混淆视听"},{"definition":["to misrepresent\/to misinterpret"],"pinyin":["qu1 jie3"],"word":"曲解"},{"definition":["to pass off fish eyes for pearls\/to pass off fake products as genuine (idiom)"],"pinyin":["yu2 mu4 hun4 zhu1"],"word":"鱼目混珠"},{"definition":["lit. to put Zhang's hat on Li's head\/to attribute sth to the wrong person (idiom)\/to confuse one thing with another"],"pinyin":["Zhang1 guan1 Li3 dai4"],"word":"张冠李戴"},{"definition":["lit. the plum tree withers in place of the peach tree\/to substitute one thing for another\/to carry the can for sb"],"pinyin":["li3 dai4 tao2 jiang1"],"word":"李代桃僵"},{"definition":["to confuse right and wrong (idiom)"],"pinyin":["hun4 xiao2 shi4 fei1"],"word":"混淆是非"},{"definition":["to make use of\/to use sth as pretext\/under false pretenses\/under the guise of\/masquerading as\/lenient\/tolerant\/loan character (one of the Six Methods 六書|六书 of forming Chinese characters)\/character acquiring meanings by phonetic association\/also called phonetic loan"],"pinyin":["jia3 jie4"],"word":"假借"},{"definition":["lit. to hang a sheep's head while selling dog meat (idiom)\/fig. to cheat\/dishonest advertising\/wicked deeds carried out under banner of virtue"],"pinyin":["gua4 yang2 tou2 mai4 gou3 rou4"],"word":"挂羊头卖狗肉"},{"definition":["lit. to graft flowers onto a tree\/to surreptitiously substitute one thing for another (idiom)"],"pinyin":["yi2 hua1 jie1 mu4"],"word":"移花接木"},{"definition":["to hint at\/to imply\/sth hidden"],"pinyin":["an4 zhi3"],"word":"暗指"},{"definition":["to tamper with\/to falsify"],"pinyin":["cuan4 gai3"],"word":"篡改"},{"definition":["lit. new wine in old bottles; fig. new concepts in an old framework\/(loan idiom from Matthew 9:17, but fig. meaning is opposite)"],"pinyin":["jiu4 ping2 zhuang1 xin1 jiu3"],"word":"旧瓶装新酒"}]}