{"definition":["Confucianism"],"pinyin":["Ru2 xue2"],"traditional":["儒學"],"rank":22698.0,"normalized_rank":0.3175744686804807,"fraction":0.0000018369824564305543,"cumulative_fraction":0.9804914877596982,"word":"儒学","characters":[{"definition":["scholar\/Confucian"],"pinyin":["ru2"],"word":"儒"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"学"}],"containing_words":[],"sentences":[{"english":"Great Master Yinguang, with huge accomplishment of Confucianism, is the 13th master of the Pure Land Sect.","chinese":"印光大师是具有丰厚儒学修养的净土宗十三代祖师。"},{"english":"Confucian academic legitimacy rebuilding under the influence of political reforms and academic changes.","chinese":"政局变革与学术变迁影响下的儒学正统性建构。"},{"english":"This article would like to discuss Mr. Tang Jun-yi's influence on Taiwanese Confucianism.","chinese":"本文旨在论述唐君毅先生对台湾儒学的影响。"},{"english":"The third part focuses on his practice of Confucian education.","chinese":"主要探讨了马一浮儒学教育思想的实践。"},{"english":"There are plentiful the rule of virtue thought in the Confucian tradition.","chinese":"儒学传统中有丰富的“德治”思想。"},{"english":"It is unclear what the revival of Confucianism entails for China.","chinese":"至今还不清楚儒学的复兴能为中国带来什么样的结局。"},{"english":"Of the lofty moral quality of Confucianism we have already spoken.","chinese":"我们已经谈过儒学高尚的道德属性。"},{"english":"He modeled himself on Mencius while he was criticizing heterodoxy and keeping Confucianism traditions.","chinese":"他以孟子为法，力辟异端，维护儒学传统。"},{"english":"Participants discussed the present and future “soft power” of Confucianism.","chinese":"与会者还探讨了儒学现在和未来的“软实力”。"},{"english":"Chinese Buddhism takes effect in Confucianism of song which is an indisputable fact.","chinese":"中国佛教对于宋明新儒学的影响是不争的事实。"},{"english":"Neo-Confucianism Neo-Confucianism continue to interpret within the framework of poetic mood.","chinese":"宋明理学继续在儒学的框架内解读诗意心境。"},{"english":"Solid scholarship is a trend of thought in the process of the development of Confucianism.","chinese":"实学是中国儒学发展过程中的一种思潮。"},{"english":"Greek philosopher, a prototype of the Cynics.","chinese":"希腊哲学家，犬儒学派奠基人之一。"},{"english":"Transcendent being theory is a significant part of Mou Zongsan's Confucianism thought.","chinese":"超越存有论是牟宗三儒学思想的标志性成果之一。"},{"english":"The cultural structure has also been transplanted into the Xixia culture.","chinese":"儒学的文化结构，也大都被移植到西夏文化之中。"},{"english":"In Wu's eyes, \"Kindness\" is the core concept of Confucianism, while according to the New Culture School;","chinese":"吴宓和新文化派产生分歧的另一个领域是儒学。"}],"related":[{"definition":["study of the Confucian classics"],"pinyin":["jing1 xue2"],"word":"经学"},{"definition":["Confucian school, founded by Confucius 孔子[Kong3 zi3] (551-479 BC) and Mencius 孟子[Meng4 zi3] (c. 372-c. 289 BC)"],"pinyin":["Ru2 jia1"],"word":"儒家"},{"definition":["Confucian thoughts\/the thinking of the Confucian school"],"pinyin":["Ru2 jia1 si1 xiang3"],"word":"儒家思想"},{"definition":["Confucianism"],"pinyin":["Ru2 jiao4"],"word":"儒教"},{"definition":["the teaching of Confucius and Mencius"],"pinyin":["Kong3 Meng4 zhi1 dao4"],"word":"孔孟之道"},{"definition":["Former Han dynasty school of Confucian scholars"],"pinyin":["jin1 wen2 jing1 xue2"],"word":"今文经学"},{"definition":["Confucian"],"pinyin":["Ru2 zhe3"],"word":"儒者"},{"definition":["Confucius and Mencius"],"pinyin":["Kong3 Meng4"],"word":"孔孟"},{"definition":["School of Mind\/Neo-Confucian Idealistic School (from Song to mid-Qing times, c. 1000-1750, typified by the teachings of Wang Yangming 王陽明|王阳明[Wang2 Yang2 ming2])"],"pinyin":["xin1 xue2"],"word":"心学"},{"definition":["Confucian study of ethics\/study of Daoism\/school for Daoism in Tang and Song times\/Daoist magic\/another name for 理學|理学, rational learning of Song dynasty neo-Confucianism"],"pinyin":["dao4 xue2"],"word":"道学"},{"definition":["School of Principle\/Neo-Confucian Rationalistic School (from Song to mid-Qing times, c. 1000-1750, typified by the teachings of Cheng Hao 程顥|程颢[Cheng2 Hao4], Cheng Yi 程頤|程颐[Cheng2 Yi2] and Zhu Xi 朱熹[Zhu1 xi1])","science"],"pinyin":["Li3 xue2","li3 xue2"],"word":"理学"},{"definition":["Western learning (intellectual movement in the late Qing)\/also called 洋務運動|洋务运动"],"pinyin":["Xi1 xue2"],"word":"西学"},{"definition":["Dong Zhongshu (179-104 BC), philosopher influential in establishing Confucianism as the established system of values of former Han dynasty"],"pinyin":["Dong3 Zhong4 shu1"],"word":"董仲舒"},{"definition":["sinology\/Chinese studies (in foreign schools)\/Han Learning, a Qing dynasty movement aiming at a philological appraisal of the Classics"],"pinyin":["Han4 xue2"],"word":"汉学"},{"definition":["historiography"],"pinyin":["shi3 xue2"],"word":"史学"},{"definition":["New Confucianism, a social and political movement founded in 1920s China that combines aspects of Western and Eastern philosophy\/see also 當代新儒家|当代新儒家[Dang1 dai4 Xin1 Ru2 jia1]"],"pinyin":["Xin1 Ru2 jia1"],"word":"新儒家"}]}