{"definition":["Confucian thoughts\/the thinking of the Confucian school"],"pinyin":["Ru2 jia1 si1 xiang3"],"traditional":["儒家思想"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"儒家思想","characters":[{"definition":["scholar\/Confucian"],"pinyin":["ru2"],"word":"儒"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"},{"definition":["to think\/to consider"],"pinyin":["si1"],"word":"思"},{"definition":["to think\/to believe\/to suppose\/to wish\/to want\/to miss (feel wistful about the absence of sb or sth)"],"pinyin":["xiang3"],"word":"想"}],"containing_words":[],"sentences":[{"english":"Of long standing, Confucianism is the core of Chinese Culture.","chinese":"儒家思想渊远流长，构成中国民族文化的核心。"},{"english":"The mean is an important intension of the Confucian school.","chinese":"中庸是儒家思想中的一个重要内容。"},{"english":"Human nature is an important constituent of the Confucianism.","chinese":"人性论是儒家思想的重要组成部分。"},{"english":"Discussion on justice of the mean by Confucius;","chinese":"中庸是儒家思想的一个重要组成部分。"},{"english":"But Confucianism revived, with its softer approach to power. Bell says that like the first emperor, the early communists struggled to consolidate their power.","chinese":"但是儒家思想因其推崇以柔克刚的权力手段得以复兴。"},{"english":"Confucianism is still respected that there are temples that have Budda Confucius all together.","chinese":"儒家思想仍然受到尊敬，各地有许多孔圣人的庙。"},{"english":"Thought , aspiration that judging from Confucian learning, he has to go into the society actively become an official.","chinese":"从儒家思想上看，他有积极入世的思想，渴望出仕。"},{"english":"But Confucianism revived, with its softer approach to power.","chinese":"但是儒家思想因其推崇以柔克刚的权力手段得以复兴。"},{"english":"Confucius is the essence of Confucianism to give Jade a, clarifying Tamaari 11 Germany.","chinese":"孔子将儒家思想的精髓赋予玉一身，阐明玉有十一德。"},{"english":"Confucianism didn't become widely known across China until the Han Dynasty; under emperor Wu.","chinese":"儒家思想直到汉朝才在中国得到广泛传播。"},{"english":"Confucianism is one of the spiritual resources for us to solve the ecological crisis.","chinese":"儒家思想是我们解决生态危机的精神资源之一。"},{"english":"Confucian influence, however, remains.","chinese":"然而，中国依旧受着儒家思想的影响。"},{"english":"Confucian values see man as an integral part of nature.","chinese":"儒家思想把人当做自然的有机组成部分。"},{"english":"B:Confucianism is the backbone of Chinese culture.","chinese":"儒家思想是中国传统文化的主干。"},{"english":"The third part of folk belief Confucianist thought.","chinese":"第三部分民间信仰中的儒家思想。"},{"english":"So the Confucianism is the main thoughts of FaYan.","chinese":"可以说，儒家思想是《法言》一书的主流思想。"}],"related":[{"definition":["Confucian school, founded by Confucius 孔子[Kong3 zi3] (551-479 BC) and Mencius 孟子[Meng4 zi3] (c. 372-c. 289 BC)"],"pinyin":["Ru2 jia1"],"word":"儒家"},{"definition":["the teaching of Confucius and Mencius"],"pinyin":["Kong3 Meng4 zhi1 dao4"],"word":"孔孟之道"},{"definition":["Confucianism"],"pinyin":["Ru2 xue2"],"word":"儒学"},{"definition":["Confucianism"],"pinyin":["Ru2 jiao4"],"word":"儒教"},{"definition":["three principles and five virtues (idiom)\/the three rules (ruler guides subject, father guides son and husband guides wife) and five constant virtues of Confucianism (benevolence 仁, righteousness 義|义, propriety 禮|礼, wisdom 智 and fidelity 信)"],"pinyin":["san1 gang1 wu3 chang2"],"word":"三纲五常"},{"definition":["Confucius and Mencius"],"pinyin":["Kong3 Meng4"],"word":"孔孟"},{"definition":["dismiss the hundred schools, revere only the Confucians (slogan of the Former Han dynasty)"],"pinyin":["du2 zun1 ru2 shu4"],"word":"独尊儒术"},{"definition":["restrain yourself and return to the rites (idiom, from Analects); to subdue self and observe proprieties\/(any number of possible translations)"],"pinyin":["ke4 ji3 fu4 li3"],"word":"克己复礼"},{"definition":["Confucius (551-479 BC), Chinese thinker and social philosopher, also known as 孔夫子[Kong3 fu1 zi3]"],"pinyin":["Kong3 zi3"],"word":"孔子"},{"definition":["Mencius (c. 372-c. 289 BC), Confucian philosopher second only to Confucius\/book of the same name, one of the classics of Confucianism"],"pinyin":["Meng4 zi3"],"word":"孟子"},{"definition":["system of thought\/ideology"],"pinyin":["si1 xiang3 ti3 xi4"],"word":"思想体系"},{"definition":["Dong Zhongshu (179-104 BC), philosopher influential in establishing Confucianism as the established system of values of former Han dynasty"],"pinyin":["Dong3 Zhong4 shu1"],"word":"董仲舒"},{"definition":["Dismiss the hundred schools, revere only the Confucian (idiom)\/sole dominant ideology"],"pinyin":["ba4 chu4 bai3 jia1 , du2 zun1 ru2 shu4"],"word":"罢黜百家，独尊儒术"},{"definition":["Confucian"],"pinyin":["Ru2 zhe3"],"word":"儒者"},{"definition":["Legalist School of the Warring States Period (475-221 BC) founded by Han Fei 韓非|韩非[Han2 Fei1] and Li Si 李斯[Li3 Si1], later adopted by Shang Yang 商鞅[Shang1 Yang1] whose reforms helped establish the supremacy of the Qin Dynasty 秦代[Qin1 dai4] (221-207 BC)"],"pinyin":["Fa3 jia1"],"word":"法家"},{"definition":["cultural tradition"],"pinyin":["wen2 hua4 chuan2 tong3"],"word":"文化传统"}]}