{"definition":["to serve as\/to act as\/to play the role of"],"pinyin":["chong1 dang1"],"traditional":["充當"],"rank":6774.0,"normalized_rank":0.0947770486757237,"fraction":0.00001544881225079828,"cumulative_fraction":0.8931048598256528,"word":"充当","characters":[{"definition":["to fill\/to satisfy\/to fulfill\/to act in place of\/substitute\/sufficient\/full"],"pinyin":["chong1"],"word":"充"},{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","(onom.) dong\/ding dong (bell)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang4","dang1","dang1"],"word":"当"}],"containing_words":[],"sentences":[{"english":"They act as small laminated springs and keep the belt strap flat.","chinese":"它们可以充当小小的叠片弹簧，让安全带保持平整度。"},{"english":"Do you think China should play the role of an arbitrator in the dispute between India and Pakistan ?","chinese":"你认为中方是否应该在印巴冲突中充当调解者的角色？"},{"english":"With an asynchronous model, the queue itself acts as a relief valve.","chinese":"借助异步模型，队列本身可以充当一个减压阀。"},{"english":"In the world of international marketing, governments, quasi- government agencies, and profit-seeking and nonprofit entities are frequently buyers.","chinese":"以及赢利与非赢利实体都经常充当买家的角色。"},{"english":"This met the volunteer and to play amain role either by the donation or the participation.","chinese":"本会志愿者并且充当了一个主要角色或由捐赠或参加。"},{"english":"He was tried because he had acted as a Greman spy during the war.","chinese":"他因在战争期间充当德国人的间谍而受审。"},{"english":"An ISFP may find great satisfaction from volunteering as a counselor .","chinese":"在自愿充当顾问时，ISFP会得到极大的满足感。"},{"english":"The wood ant, for example, is a social creature, and acts as a slave for the blood-red ant Formica sanguinea.","chinese":"例如，木蚁是一种社会性动物，充当血红林蚁的奴隶。"},{"english":"Tiny models could be used as spies while gargantuan versions served as mobile armor.","chinese":"微小的型号能用于侦察，而巨型版本可充当移动机甲。"},{"english":"Yvan, less self-assured, acts as a mediator between the two.","chinese":"伊万缺少自我肯定，在他俩当中充当和事佬。"},{"english":"In direct sunlight they act as protective sunshades.","chinese":"在阳光直射下，他们充当保护遮阳篷。"},{"english":"She served her earring as a pin.","chinese":"她将她的耳环充当饰针。"},{"english":"You can't plau God son.","chinese":"你不能充当上帝，儿子。"},{"english":"Each software service can act as a service provider or requester.","chinese":"每个软件服务均可充当一个服务提供者或请求者。"},{"english":"On these cars, three slit windows functioned as opera windows.","chinese":"在这些车上，三个条状小窗充当了后侧壁板小窗。"},{"english":"Test not equal to idea, coffee and often act as my outlet wine.","chinese":"考试不如意时，咖啡便常常充当我的解愁酒。"}],"related":[{"definition":["to act as\/used erroneously for 作為|作为"],"pinyin":["zuo4 wei2"],"word":"做为"},{"definition":["to treat as\/to regard as\/to look upon as"],"pinyin":["dang4 zuo4"],"word":"当做"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作为"},{"definition":["to replace\/to take the place of"],"pinyin":["dai4 ti4"],"word":"代替"},{"definition":["to treat as\/to regard as"],"pinyin":["dang4 zuo4"],"word":"当作"},{"definition":["to use for the purpose of\/to serve as"],"pinyin":["yong4 zuo4"],"word":"用作"},{"definition":["to be used for"],"pinyin":["yong4 lai2"],"word":"用来"},{"definition":["to sink down to\/to be reduced to (sth inferior)"],"pinyin":["lun2 wei2"],"word":"沦为"},{"definition":["necessary\/must have"],"pinyin":["bu4 ke3 huo4 que1"],"word":"不可或缺"},{"definition":["to take upon oneself\/to assume"],"pinyin":["dan1 dang1"],"word":"担当"},{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"word":"协助"},{"definition":["to exchange\/to replace\/to substitute for\/to switch"],"pinyin":["ti4 huan4"],"word":"替换"},{"definition":["to alternate\/to take turns"],"pinyin":["lun2 liu2"],"word":"轮流"},{"definition":["to consider as\/to take to be"],"pinyin":["dang4 cheng2"],"word":"当成"},{"definition":["daring vanguard\/pioneer\/leading figure"],"pinyin":["ji2 xian1 feng1"],"word":"急先锋"},{"definition":["to rely on sth (for support etc)\/to depend on"],"pinyin":["yi1 kao4"],"word":"依靠"}]}