{"definition":["Party committee"],"pinyin":["dang3 wei3"],"traditional":["黨委"],"rank":2920.0,"normalized_rank":0.0408545884459866,"fraction":0.000049605971182594926,"cumulative_fraction":0.7868256367752847,"word":"党委","characters":[{"definition":["party\/association\/club\/society\/CL:個|个[ge4]","surname Dang"],"pinyin":["dang3","Dang3"],"word":"党"},{"definition":["surname Wei","same as 逶 in 逶迤 winding, curved","to entrust\/to cast aside\/to shift (blame etc)\/to accumulate\/roundabout\/winding\/dejected\/listless\/committee member\/council\/end\/actually\/certainly"],"pinyin":["Wei3","wei1","wei3"],"word":"委"}],"containing_words":[],"sentences":[{"english":"Yanzhou Mining Group, Song, deputy secretary of Party Committee chaired the meeting.","chinese":"兖矿集团党委副书记宋国主持会议。"},{"english":"They decided to represent their urgent need to the District Party Committee.","chinese":"他们决定向区党委反映他们的迫切需要。"},{"english":"Jiang Xiaoli, Head of the Party Committee Steering Group of the district SASAC, attended and addressed the meeting.","chinese":"区国资委党委督导组组长江小丽出席会议并讲话。"},{"english":"Autonomous region party committee secretary Chen Jianguo presides over the conference.","chinese":"自治区党委书记陈建国主持会议。"},{"english":"Deputy party secretary of Shenzhen Airlines flights Liu accepted the award and delivered a speech Shenzhen Airlines brand.","chinese":"深航党委副书记刘航接受颁奖并发表深航品牌演说。"},{"english":"Chinese President Hu Jintao spoke with Hunan's Communist Party secretary by telephone.","chinese":"国家主席胡锦涛跟湖南省的党委书记进行了电话交谈。"},{"english":"The committee should encourage criticism and self-criticism among its members, and this should be made habitual.","chinese":"党委内部要开展批评和自我批评，要有这种风气。"},{"english":"Direct election was carried out in the Communist Party committees of 363 neighborhoods in Nanjing.","chinese":"南京363个社区以公推直选方式选党委书记。"},{"english":"The third chapter the villages and towns party committee management chooses by acclamation the direct election reality to realize the way.","chinese":"第三章乡镇党委领导班子公推直选现实的实现途径。"},{"english":"The party secretary of the county began to pore on the problem of soil improvement.","chinese":"县党委书记开始考虑土壤改良问题。"},{"english":"Professor Du Zhichun current party secretary, the principal Professor He Qinhua.","chinese":"现任党委书记杜志淳教授，校长何勤华教授。"},{"english":"Soon letters and pledges of determination poured into the Party committee.","chinese":"大量的决心书很快就送到了党委会。"},{"english":"Gengyanfengs current director of the Taiyuan Tool Factory, deputy secretary of the party committee.","chinese":"邢岩峰同志现任太原工具厂厂长，党委副书记。"},{"english":"Should the leader of a school Party committee, for instance, be a professional?","chinese":"比如学校党委的领导同志，应不应该是个专业人员呢？"},{"english":"“Please believe the Mianzhu Party committee can resolve the issue, ” he said.","chinese":"“请相信绵竹党委能够解决这个问题”，他说。"},{"english":"Mr Li is Party secretary and major.","chinese":"李先生任党委书记兼市长。"}],"related":[{"definition":["party leadership group"],"pinyin":["dang3 zu3"],"word":"党组"},{"definition":["CCP county committee"],"pinyin":["xian4 wei3"],"word":"县委"},{"definition":["municipal committee"],"pinyin":["shi4 wei3"],"word":"市委"},{"definition":["cadre\/official\/officer\/manager"],"pinyin":["gan4 bu4"],"word":"干部"},{"definition":["secretary (chief official of a branch of a socialist or communist party)\/clerk\/scribe"],"pinyin":["shu1 ji5"],"word":"书记"},{"definition":["provincial Party committee"],"pinyin":["sheng3 wei3"],"word":"省委"},{"definition":["Party and government administration"],"pinyin":["dang3 zheng4"],"word":"党政"},{"definition":["discipline inspection commission"],"pinyin":["ji4 wei3"],"word":"纪委"},{"definition":["deputy secretary"],"pinyin":["fu4 shu1 ji5"],"word":"副书记"},{"definition":["party central committee"],"pinyin":["dang3 zhong1 yang1"],"word":"党中央"},{"definition":["comrade\/(slang) homosexual\/CL:個|个[ge4]"],"pinyin":["tong2 zhi4"],"word":"同志"},{"definition":["county administration\/county regional government"],"pinyin":["xian4 zheng4 fu3"],"word":"县政府"},{"definition":["working committee"],"pinyin":["gong1 wei3"],"word":"工委"},{"definition":["leading small group (LSG), a CCP body that exercises general oversight on matters relating to a specific area (LSG for foreign affairs 外事工作, LSG for comprehensively deepening reforms 全面深化改革 etc)\/aka central leading group"],"pinyin":["ling3 dao3 xiao3 zu3"],"word":"领导小组"},{"definition":["United Front Work Department of CCP Central Committee (UFWD)\/abbr. for 統一戰線工作部|统一战线工作部[Tong3 yi1 Zhan4 xian4 Gong1 zuo4 bu4]"],"pinyin":["Tong3 Zhan4 bu4"],"word":"统战部"},{"definition":["CPPCC (Chinese People's Political Consultative Conference)\/abbr. of 中國人民政治協商會議|中国人民政治协商会议[Zhong1 guo2 Ren2 min2 Zheng4 zhi4 Xie2 shang1 Hui4 yi4]"],"pinyin":["Zheng4 Xie2"],"word":"政协"}]}