{"definition":["Octopus card (Hong Kong smart card for electronic payments)"],"pinyin":["Ba1 da2 tong1"],"traditional":["八達通"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"八达通","characters":[{"definition":["eight\/8"],"pinyin":["ba1"],"word":"八"},{"definition":["surname Da","to attain\/to reach\/to amount to\/to communicate\/eminent"],"pinyin":["Da2","da2"],"word":"达"},{"definition":["to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc","classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)"],"pinyin":["tong1","tong4"],"word":"通"}],"containing_words":[],"sentences":[{"english":"Please select the BEA Branch from which you would like to collect all your Personalised Octopus cards.","chinese":"请选择领取所有个人八达通卡之东亚银行分行。"},{"english":"With more popular use of credit cards and Octopus cards, do you bring less cash when going out?","chinese":"八达通及信用卡的普遍会否令你带少了现金上街？"},{"english":"How frequent do you usually use Octopus Card for paying local travelling expenses?","chinese":"你大约多久会使用八达通去付车费最少一次？"},{"english":"Which OCL's product do you prefer?","chinese":"你喜欢下列哪一种的八达通产品？"},{"english":"Which of the following categories of Octopus Card do you use?","chinese":"你现时使用的是下列哪一种类型的八达通呢？"},{"english":"What method do you often use to add value for your Octopus cards?","chinese":"请问你多数使用哪种八达通增值方法？"},{"english":"How frequent do you use Octopus Card?","chinese":"你大约多久日会使用八达通最少一次？"},{"english":"Do you think that the information on OCL's official web site is informative or not?","chinese":"你觉得登录在八达通公司网站的资料是否有价值？"},{"english":"What is your type of Octopus cards, namely the ordinary one or the personal one?","chinese":"请问你的八达通卡是个人还是普通的？"},{"english":"Excuse me, is there any ticket or card like Octopus in Hong Kong?","chinese":"请问这里有像香港八达通之类的储值卡吗？"},{"english":"Have you ever accessed OCL's official web site?","chinese":"你有否曾进入八达通公司的网站？"},{"english":"The company has launched its own inquiry on how it handles personal data.","chinese":"八达通已经就如何处理个人资料发起了自己的调查。"},{"english":"How frequent do you use Octopus Card for making payments in retail shops?","chinese":"你大约多久会使用八达通去付款购物最少一次？"},{"english":"Have you ever read Octopus Card's personal data policy?","chinese":"你是否曾经阅读八达通公司的个人资料声明？"},{"english":"What do you think when Octopus cards plus credit cards add-valued service?","chinese":"你对八达通和信用卡二合一有什么意见？"},{"english":"P: Excuse me, is there any ticket or card like Octopus in Hong Kong?","chinese":"请问这里有像香港八达通之类的储值卡吗？"}],"related":[{"definition":["EasyCard, smartcard used for payment on public transport and at other businesses such as convenience stores in Taipei and surrounding areas"],"pinyin":["You1 you2 Ka3"],"word":"悠游卡"},{"definition":["public transportation card\/prepaid transit card\/subway pass"],"pinyin":["jiao1 tong1 ka3"],"word":"交通卡"},{"definition":["(Hong Kong) MTR (Mass Transit Railway)"],"pinyin":["Gang3 tie3"],"word":"港铁"},{"definition":["to use a credit card (or swipe card, smart card etc)"],"pinyin":["shua1 ka3"],"word":"刷卡"},{"definition":["rapid transit\/subway"],"pinyin":["jie2 yun4"],"word":"捷运"},{"definition":["stored-value card\/prepaid card (telephone, transport etc)"],"pinyin":["chu3 zhi2 ka3"],"word":"储值卡"},{"definition":["Alipay, online payment platform"],"pinyin":["Zhi1 fu4 bao3"],"word":"支付宝"},{"definition":["Lok Ma Chau (place in Hong Kong)"],"pinyin":["Luo4 ma3 zhou1"],"word":"落马洲"},{"definition":["Hong Kong currency\/Hong Kong dollar"],"pinyin":["Gang3 bi4"],"word":"港币"},{"definition":["Mainland Travel Permit for Taiwan Residents\/Taiwan Compatriot Entry Permit\/abbr. for 台灣居民來往大陸通行證|台湾居民来往大陆通行证[Tai2 wan1 Ju1 min2 Lai2 wang3 Da4 lu4 Tong1 xing2 zheng4]"],"pinyin":["Tai2 bao1 zheng4"],"word":"台胞证"},{"definition":["Tsim Sha Tsui, urbanized area in Hong Kong"],"pinyin":["Jian1 sha1 zui3"],"word":"尖沙咀"},{"definition":["Yikatong (Beijing public transport smart card)"],"pinyin":["Yi1 ka3 tong1"],"word":"一卡通"},{"definition":["Causeway Bay"],"pinyin":["Tong2 luo2 Wan1"],"word":"铜锣湾"},{"definition":["Hong Kong LRT (Light Rail Transit) (abbr. for 輕便鐵路|轻便铁路)"],"pinyin":["Qing1 tie3"],"word":"轻铁"},{"definition":["Mong Kok (area in Hong Kong)"],"pinyin":["Wang4 Jiao3"],"word":"旺角"},{"definition":["(dialect) to give change"],"pinyin":["zhao3 shu2"],"word":"找赎"}]}