{"definition":["public security bureau"],"pinyin":["gong1 an1 ji1 guan1"],"traditional":["公安機關"],"rank":2985.0,"normalized_rank":0.04176402277783218,"fraction":0.00004809057743814121,"cumulative_fraction":0.7900002066795017,"word":"公安机关","characters":[{"definition":["public\/collectively owned\/common\/international (e.g. high seas, metric system, calendar)\/make public\/fair\/just\/Duke, highest of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/honorable (gentlemen)\/father-in-law\/male (animal)"],"pinyin":["gong1"],"word":"公"},{"definition":["surname An","content\/calm\/still\/quiet\/safe\/secure\/in good health\/to find a place for\/to install\/to fix\/to fit\/to bring (a charge against sb)\/to pacify\/to harbor (good intentions)\/security\/safety\/peace\/ampere"],"pinyin":["An1","an1"],"word":"安"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["ji1","Ji1"],"word":"机"},{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["guan1","Guan1"],"word":"关"}],"containing_words":[],"sentences":[{"english":"When a public security organ demands the arrest of an offender, it shall obtain the approval of a people's procuratorate.","chinese":"公安机关要求逮捕人犯的时候，由人民检察院批准。"},{"english":"The public security organ shall carry out examination in the course of transportation of precursor chemicals.","chinese":"公安机关应当在易制毒化学品的运输过程中进行检查。"},{"english":"The public security organ or the people's procuratorate shall inform the prison of the result of its handling.","chinese":"公安机关或者人民检察院应当将处理结果通知监狱。"},{"english":"Tangmou said that when she found that when the law on public security organs to the police.","chinese":"唐某称，当她发现违法时，就向公安机关报警了。"},{"english":"False then the passengers and the public security organ for handling by the airport.","chinese":"随后将该旅客和假证交由机场公安机关处理。"},{"english":"Wreck rolling stock engine driver Chen Mou have already been controled by the local communal security institution.","chinese":"失事车辆司机陈某已被当地公安机关控制。"},{"english":"And the Political Security Bureau is the ancestor of the Public Security Bureau .","chinese":"国家政治保卫局则是公安机关的前身。"},{"english":"The police scoured the country for the fugitive.","chinese":"公安机关在全国搜索逃亡者。"},{"english":"If the exposure is true to the fact, the traffic administrative department of the public security organ shall grant awards.","chinese":"举报属实的，公安机关交通管理部门应当给予奖励。"},{"english":"The public security organ shall take the auction trade as a special trade and exercise public security administration on it.","chinese":"公安机关对拍卖业按照特种行业实施治安管理。"},{"english":"Article 71 When making an arrest, a public security organ must produce an arrest warrant.","chinese":"第七十一条公安机关逮捕人的时候，必须出示逮捕证。"},{"english":"Public security departments shall exercise security control over the auctioning industry as special industry.","chinese":"公安机关对拍卖业按照特种行业实施治安管理。"},{"english":"Internet security Administration (abbr. ISA) is a newly emerging assignment for the Police.","chinese":"互联网安全管理是公安机关的一项新型警务活动。"},{"english":"The public security department has solved three major cases this month.","chinese":"本月，公安机关告破三起要案。"},{"english":"'They will be dealt with by the police -- I won't interfere.'","chinese":"他们会由公安机关处理，这件事我绝不参与。"},{"english":"Procuratorates also supervised the public security organs in investigation of 5 IPR infringement crimes.","chinese":"监督公安机关立案侦查侵犯知识产权犯罪案件5件。"}],"related":[{"definition":["to file for investigation\/to prosecute (a case)"],"pinyin":["li4 an4 zhen1 cha2"],"word":"立案侦查"},{"definition":["judicial authorities"],"pinyin":["si1 fa3 ji1 guan1"],"word":"司法机关"},{"definition":["to register (to an official organism)\/to file a case (for investigation)"],"pinyin":["li4 an4"],"word":"立案"},{"definition":["legal (proceedings)\/according to law"],"pinyin":["yi1 fa3"],"word":"依法"},{"definition":["to transfer (a case, a person, files etc)"],"pinyin":["yi2 song4"],"word":"移送"},{"definition":["people's court (of law)\/people's tribunal"],"pinyin":["ren2 min2 fa3 yuan4"],"word":"人民法院"},{"definition":["prosecutor's office\/procuratorate"],"pinyin":["jian3 cha2 yuan4"],"word":"检察院"},{"definition":["case\/instance\/CL:宗[zong1],樁|桩[zhuang1],起[qi3]"],"pinyin":["an4 jian4"],"word":"案件"},{"definition":["criminal offense"],"pinyin":["xing2 shi4 fan4 zui4"],"word":"刑事犯罪"},{"definition":["to report a case to the authorities"],"pinyin":["bao4 an4"],"word":"报案"},{"definition":["public security bureau (government office similar in function to a police station)"],"pinyin":["gong1 an1 ju2"],"word":"公安局"},{"definition":["to detect\/to investigate"],"pinyin":["zhen1 cha2"],"word":"侦查"},{"definition":["police"],"pinyin":["jing3 fang1"],"word":"警方"},{"definition":["to authorize an arrest"],"pinyin":["pi1 bu3"],"word":"批捕"},{"definition":["release from custody, subject to provision of a surety, pending investigation (PRC)"],"pinyin":["qu3 bao3 hou4 shen3"],"word":"取保候审"},{"definition":["local police station"],"pinyin":["pai4 chu1 suo3"],"word":"派出所"}]}