{"definition":["to work together\/to collaborate"],"pinyin":["gong4 tong2 nu3 li4"],"traditional":["共同努力"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"共同努力","characters":[{"definition":["common\/general\/to share\/together\/total\/altogether\/abbr. for 共產黨|共产党[Gong4 chan3 dang3], Communist party"],"pinyin":["gong4"],"word":"共"},{"definition":["like\/same\/similar\/together\/alike\/with","(used in given names)\/variant of 同[tong2]","see 衚衕|胡同[hu2 tong4]"],"pinyin":["tong2","tong2","tong4"],"word":"同"},{"definition":["to exert\/to strive"],"pinyin":["nu3"],"word":"努"},{"definition":["surname Li","power\/force\/strength\/ability\/strenuously"],"pinyin":["Li4","li4"],"word":"力"}],"containing_words":[],"sentences":[{"english":"China stands ready to earnestly implement the agreement together with Vietnam.","chinese":"中方愿与越方共同努力，认真落实协议。"},{"english":"The Chinese side would like to work together with Arab states to compose a new chapter of China-Arab friendly cooperation.","chinese":"中方愿与阿方共同努力，谱写中阿友好合作的新篇章。"},{"english":"A peaceful future is possible only with two states, not just the one.","chinese":"但是孤掌难鸣，只有巴以双方共同努力才能实现和平。"},{"english":"We look forward to growing our business together with DHL.","chinese":"我们很期待与敦豪一起为我们的业务开发共同努力。"},{"english":"We are willing to cooperate with both new and old customers to create a beautiful tomorrow in common!","chinese":"愿与新老客户精诚合作，为开创碧水蓝天共同努力。"},{"english":"The ROK will work with China to cope with the international financial crisis, he said.","chinese":"韩方将同中方共同努力，应对国际金融危机。"},{"english":"Public support is urged to help control rat infestations in Hong Kong.","chinese":"防治虫鼠人员呼吁市民共同努力控制鼠患。"},{"english":"China is willing to join hands with Slovenia to deepen cooperation in various fields, said Wen.","chinese":"我们愿与斯方共同努力，不断深化各领域的合作。"},{"english":"Tape the backboard pattern together to make the full pattern.","chinese":"磁带的篮板模式共同努力，使全模式。"},{"english":"Finally, in the motherland and the people work together in harmony through the joint efforts of the difficulties.","chinese":"最后，在祖国人民上下一心，共同努力下度过了难关。"},{"english":"The Chinese side would like to work with the Malaysian side to advance such relationship.","chinese":"中方愿与马方共同努力，将中马关系不断推向前进。"},{"english":"I look forward to working with you to take the China-UK relationship to a new high.","chinese":"让我们共同努力，推动中英关系更上一层楼。"},{"english":"This illustrates the large and joint effort still required for mitigating climate change.","chinese":"这说明了大和共同努力，仍需要为减缓气候变化。"},{"english":"When they have offspring, the couple works together to care for them.","chinese":"当有了后代，一对田鼠会共同努力照料它们的后代。"},{"english":"Let us all work together for the ultimate realization of a nuclear weapon-free world.","chinese":"让我们为最终实现无核武器的世界而共同努力。"},{"english":"We must work together to promote and utilise each other's strengths, \" he said.","chinese":"我们必须共同努力促进和利用彼此的优势，”他说道。"}],"related":[{"definition":["to join forces\/to give full cooperation"],"pinyin":["tong1 li4 he2 zuo4"],"word":"通力合作"},{"definition":["common\/joint\/jointly\/together\/collaborative"],"pinyin":["gong4 tong2"],"word":"共同"},{"definition":["great effort\/to strive\/to try hard"],"pinyin":["nu3 li4"],"word":"努力"},{"definition":["to coordinate closely\/to act in close partnership with"],"pinyin":["jin3 mi4 pei4 he2"],"word":"紧密配合"},{"definition":["cooperation\/coordination"],"pinyin":["xie2 zuo4"],"word":"协作"},{"definition":["to twist together to form a rope\/(fig.) to unite\/to work together"],"pinyin":["ning2 cheng2 yi1 gu3 sheng2"],"word":"拧成一股绳"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推动"},{"definition":["to unite\/unity\/solidarity\/united"],"pinyin":["tuan2 jie2"],"word":"团结"},{"definition":["to cooperate"],"pinyin":["he2 li4"],"word":"合力"},{"definition":["to walk hand in hand\/to cooperate"],"pinyin":["xie2 shou3 tong2 xing2"],"word":"携手同行"},{"definition":["to tackle a thorny problem and overcome its challenges"],"pinyin":["gong1 jian1 ke4 nan2"],"word":"攻坚克难"},{"definition":["when everybody gathers fuel, the flames are higher (idiom)\/the more people, the more strength"],"pinyin":["zhong4 ren2 shi2 chai2 huo3 yan4 gao1"],"word":"众人拾柴火焰高"},{"definition":["to call on (sb to do sth)\/to appeal (to)\/an appeal"],"pinyin":["hu1 yu4"],"word":"呼吁"},{"definition":["to wish for\/to desire\/hope\/CL:個|个[ge4]"],"pinyin":["xi1 wang4"],"word":"希望"},{"definition":["mutual trust"],"pinyin":["hu4 xin4"],"word":"互信"},{"definition":["common understanding\/consensus"],"pinyin":["gong4 shi2"],"word":"共识"}]}