{"definition":["accomplice"],"pinyin":["gong4 fan4"],"traditional":["共犯"],"rank":35292.0,"normalized_rank":0.4937808682999175,"fraction":5.901875454027917e-7,"cumulative_fraction":0.9942230881095364,"word":"共犯","characters":[{"definition":["common\/general\/to share\/together\/total\/altogether\/abbr. for 共產黨|共产党[Gong4 chan3 dang3], Communist party"],"pinyin":["gong4"],"word":"共"},{"definition":["to violate\/to offend\/to assault\/criminal\/crime\/to make a mistake\/recurrence (of mistake or sth bad)"],"pinyin":["fan4"],"word":"犯"}],"containing_words":[],"sentences":[{"english":"Can non-national public servants commit the bribery crime?","chinese":"非国家工作人员可否构成受贿罪共犯？"},{"english":"Offenses involving the provision of Renminbi funds with the knowledge of fraudulent purchase of foreign exchange shall be punished as an accomplice.","chinese":"明知用于骗购外汇而提供人民币资金的，以共犯论处。"},{"english":"So, it is necessary to re - construct our country's foundation of accomplices' punishment theory in criminal law.","chinese":"因此，有必要重构我国刑法学共犯的处罚根据理论。"},{"english":"Park is the first sitting president of South Korea to be accused by prosecutors of a criminal conspiracy.","chinese":"朴槿惠是韩国首位被检方指控为共犯的在任总统。"},{"english":"He was an accomplice with Bugotu in the bank robbery.","chinese":"在抢劫银行一案中他是布戈图的共犯。"},{"english":"Secondly, the thesis studies the accomplice problem of traffic accident guilty, explains if the common unintentional crime will be established.","chinese":"论文第五章对交通肇事罪的自首与共犯进行研究。"},{"english":"Including recidivism and the accomplice, deep origin has this explanation.","chinese":"这说明连累犯与共犯有着深厚的渊源。"},{"english":"Finally, this article establishes rules of punishment for the complicity relation departure.","chinese":"文章最后为共犯关系的脱离者设立了罚则。"},{"english":"Whoever conspires with the persons listed in the preceding two paragraphs to engage in embezzlement shall be punished as an accomplice in the crime.","chinese":"与前两款所列人员勾结，伙同贪污的，以共犯论处。"},{"english":"At the same time, this paper proves that how to affirm the criminal amount of the complicities of bribery.","chinese":"同时，本文还论证了受贿罪共犯的犯罪数额如何认定。"},{"english":"The reduction behavior should be one of the surplus circumstances of joint crime.","chinese":"共同犯罪中的实行减少，应是共犯过限的情形之一。"},{"english":"The non-national staff members can become the accomplice in bribery crime .","chinese":"非国家工作人员能够成为受贿罪共犯。"},{"english":"Whoever provides the RMB capital knowingly for the purchase of foreign currency by deceitful means shall be dealt with as an accomplice.","chinese":"明知用于骗购外汇而提供人民币资金的，以共犯论处。"},{"english":"Two accomplices of them were each sentenced 19 years in jail, said the report.","chinese":"报道还提及，两名共犯被判处有期徒刑19年。"},{"english":"For this purpose, can only fix position committing a crime in relative with the accomplice single-handed including recidivism.","chinese":"为此，连累犯只能定位于和共犯相对的单独犯罪。"},{"english":"Eniseitige Teilnahme is an issue to be researched in criminal law.","chinese":"片面共犯是刑法中值得研究的问题。"}],"related":[{"definition":["accessory to a crime\/accomplice"],"pinyin":["cong2 fan4"],"word":"从犯"},{"definition":["culprit"],"pinyin":["zhu3 fan4"],"word":"主犯"},{"definition":["to conspire with sb\/to plot\/a conspirator\/a partner in crime\/an accomplice"],"pinyin":["tong2 mou2"],"word":"同谋"},{"definition":["accomplice"],"pinyin":["tong2 an4 fan4"],"word":"同案犯"},{"definition":["to convict (sb of a crime)"],"pinyin":["ding4 zui4"],"word":"定罪"},{"definition":["attempted murder"],"pinyin":["sha1 ren2 wei4 sui4"],"word":"杀人未遂"},{"definition":["to convict (sb of a crime)"],"pinyin":["pan4 zui4"],"word":"判罪"},{"definition":["to sentence (to prison etc)"],"pinyin":["pan4 xing2"],"word":"判刑"},{"definition":["criminal intent"],"pinyin":["fan4 yi4"],"word":"犯意"},{"definition":["to criminalize (an activity)"],"pinyin":["ru4 zui4"],"word":"入罪"},{"definition":["accomplice"],"pinyin":["tong2 fan4"],"word":"同犯"},{"definition":["see 過失致死罪|过失致死罪[guo4 shi1 zhi4 si3 zui4]"],"pinyin":["guo4 shi1 sha1 ren2"],"word":"过失杀人"},{"definition":["fraud"],"pinyin":["zha4 pian4 zui4"],"word":"诈骗罪"},{"definition":["crime committed by an organization"],"pinyin":["dan1 wei4 fan4 zui4"],"word":"单位犯罪"},{"definition":["to repeatedly commit an offense\/repeat offender\/habitual criminal\/recidivist\/recidivism"],"pinyin":["lei3 fan4"],"word":"累犯"},{"definition":["to assess punishment\/to determine the sentence (on a criminal)"],"pinyin":["liang4 xing2"],"word":"量刑"}]}