{"definition":["common understanding\/consensus"],"pinyin":["gong4 shi2"],"traditional":["共識"],"rank":3759.0,"normalized_rank":0.05259328697550124,"fraction":0.00003602494266749507,"cumulative_fraction":0.8223157988734744,"word":"共识","characters":[{"definition":["common\/general\/to share\/together\/total\/altogether\/abbr. for 共產黨|共产党[Gong4 chan3 dang3], Communist party"],"pinyin":["gong4"],"word":"共"},{"definition":["to know\/knowledge\/Taiwan pr. [shi4]","to record\/to write a footnote"],"pinyin":["shi2","zhi4"],"word":"识"}],"containing_words":[{"definition":["1992 Consensus, statement issued after 1992 talks between PRC and Taiwan representatives, asserting that there is only one China"],"pinyin":["Jiu3 Er4 Gong4 shi2"],"word":"九二共识"}],"sentences":[{"english":"A common vocabulary or common understanding can help all in communications.","chinese":"一套公共词汇或共识可以全方位帮助沟通。"},{"english":"Both sides share many consensuses in international affairs.","chinese":"在国际事务中有许多共识。"},{"english":"The United States and the North Korean Government have reached understanding on the disposition of DPRK related funds frozen at Banco Delta Asia.","chinese":"美朝政府就澳门汇业银行冻结朝鲜资金问题达成共识。"},{"english":"Can say this word condensed the consensus that entire party fluctuates.","chinese":"可以说这句话凝聚了全党上下的共识。"},{"english":"Decisions are made by consensus at the weekly meeting.","chinese":"决议通过周会的共识产生。"},{"english":"China and the EU have many consensuses on major international and regional issues.","chinese":"中欧双方在重大国际和地区问题上有许多共识。"},{"english":"China is ready to work with Russia to implement the consensus reached at the session.","chinese":"中方愿同俄方一道，推动对话会议的共识落到实处。"},{"english":"This process provides the basis and structure to support consensus building and joint decision-making.","chinese":"整个过程建立了制定决策所需的共识和基础。"},{"english":"Share a characteristic about yourself thatyou have in common with the audience.","chinese":"分享你和听众的共同点，创造和谐和共识。"},{"english":"Preparatory meetings have made considerable progress in reaching agreement on some of the key issues.","chinese":"在筹备会议中，我们已就一些关键项目，取得共识。"},{"english":"These and similar groups begin with a plea for budget discipline.","chinese":"这些拥有相同共识的团体请求预算的纪律性。"},{"english":"Nowadays, protection of ecology and environment has become a world consensus.","chinese":"当今生态环境保护已成为国际社会的共识。"},{"english":"Second, consolidating consensus and jointly promoting the healthy development of multilateral trade system.","chinese":"第二，凝聚共识，共同推进多边贸易体制健康发展。"},{"english":"Premier Wen held in-depth talks and reached wide consensus with Turkish leaders.","chinese":"温总理同土方领导人深入交谈，达成广泛共识。"},{"english":"Presently, coordination principle of human-environment relations has become the global mutual recognition.","chinese":"当前，人地关系的协调论已成为全球共识。"},{"english":"Mr Conti said he hoped to have agreement on a deal by June.","chinese":"孔蒂表示，他希望在6月前就协议达成共识。"}],"related":[{"definition":["to reach (an agreement)\/to accomplish"],"pinyin":["da2 cheng2"],"word":"达成"},{"definition":["topic of discussion\/topic\/subject\/issue (under discussion)\/CL:項|项[xiang4]"],"pinyin":["yi4 ti2"],"word":"议题"},{"definition":["to approve of\/to endorse\/to acknowledge\/to recognize\/to identify oneself with"],"pinyin":["ren4 tong2"],"word":"认同"},{"definition":["common interest\/mutual benefit"],"pinyin":["gong4 tong2 li4 yi4"],"word":"共同利益"},{"definition":["mutual trust"],"pinyin":["hu4 xin4"],"word":"互信"},{"definition":["precondition\/prerequisite"],"pinyin":["xian1 jue2 tiao2 jian4"],"word":"先决条件"},{"definition":["general trend\/irresistible trend"],"pinyin":["da4 shi4 suo3 qu1"],"word":"大势所趋"},{"definition":["all parties (in a dispute etc)\/all sides\/all directions"],"pinyin":["ge4 fang1"],"word":"各方"},{"definition":["to discuss\/to talk over\/CL:個|个[ge4]"],"pinyin":["tao3 lun4"],"word":"讨论"},{"definition":["divergent\/difference (of opinion, position)\/disagreement\/bifurcation (math.)"],"pinyin":["fen1 qi2"],"word":"分歧"},{"definition":["final conclusion\/accepted argument"],"pinyin":["ding4 lun4"],"word":"定论"},{"definition":["wording (of a proposal)\/formulation\/viewpoint (on an issue)\/(one of eight methods of bonesetting in TCM) restoring the part displaced by a fracture to its correct position by lifting"],"pinyin":["ti2 fa3"],"word":"提法"},{"definition":["to seek common ground, putting differences aside (idiom)"],"pinyin":["qiu2 tong2 cun2 yi4"],"word":"求同存异"},{"definition":["agreement\/pact\/protocol\/CL:項|项[xiang4]"],"pinyin":["xie2 yi4"],"word":"协议"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推动"},{"definition":["notion\/thought\/concept\/sense\/views\/ideology\/general impressions"],"pinyin":["guan1 nian4"],"word":"观念"}]}