{"definition":["to scheme together\/to conspire\/joint plan\/conspiracy"],"pinyin":["gong4 mou2"],"traditional":["共謀"],"rank":17413.0,"normalized_rank":0.2436304618527276,"fraction":0.000003133993671098822,"cumulative_fraction":0.967743411378891,"word":"共谋","characters":[{"definition":["common\/general\/to share\/together\/total\/altogether\/abbr. for 共產黨|共产党[Gong4 chan3 dang3], Communist party"],"pinyin":["gong4"],"word":"共"},{"definition":["to plan\/to seek\/scheme"],"pinyin":["mou2"],"word":"谋"}],"containing_words":[{"definition":["conspiracy"],"pinyin":["gong4 mou2 zui4"],"word":"共谋罪"},{"definition":["conspirator"],"pinyin":["gong4 mou2 zhe3"],"word":"共谋者"}],"sentences":[{"english":"He later came up with the story of the wrongfully accused brother, and the conspiracy subplot .","chinese":"后来他想出了故事的错误指责弟弟，并共谋在本。"},{"english":"Welcome foreign cooperation in the talks to seek common development.","chinese":"欢迎有意合作的中外人士来函来电洽谈，共谋发展。"},{"english":"Literariness becomes the conspirator to inspire consumption;","chinese":"文学性泛化成为刺激消费的“共谋者”。"},{"english":"His decision is prompted by his personal interests and those of his co-conspirators.","chinese":"他的决定显示是为了他个人，以及他的共谋者的利益。"},{"english":"It's necessary to use the concept of \"plotting co-principals\" in study.","chinese":"“共谋共同正犯”这一概念在研究中有必要予以确认。"},{"english":"Our company is willing to make a pure-hearted cooperation with you to seek a mutual development and create a bright future together.","chinese":"本公司愿与您真诚协作，共谋发展，携手共创未来。"},{"english":"Chairman of the board of directors DuKaison welcomes newly old user's your patronage wholeheartedly, and stratagems the development altogether.","chinese":"董事长杜开松竭诚欢迎新老用户惠顾，共谋发展。"},{"english":"The company wishes to connive development with you, create win-win.","chinese":"公司愿与您共谋发展，共创双赢。"},{"english":"Two, endangering the state’s existence by making common cause with jihadism.","chinese":"第二，与圣战主义共谋危及国家的存亡。"},{"english":"They conspired to drive him out of the country.","chinese":"他们共谋把他逐出国外。"},{"english":"The two criminals connived with the police to tob the bank.","chinese":"这两个犯罪分子和警察共谋抢劫银行。"},{"english":"The second chapter illustrates the collusive relations between aesthetic views and economy.","chinese":"第二章，论证这种审美观念与经济的共谋关系。"},{"english":"Bureau and incoming enterprises' total grams of the hard times, and seek common development 'major initiatives.","chinese":"局与港航企业‘共克时艰，共谋发展’主要措施”。"},{"english":"This is the main part of complicity on some of the basic common perpetrator theory.","chinese":"这一部分主要是介绍共谋共同正犯的一些基本理论。"},{"english":"The two countries should help each other to overcome difficulties, strengthen friendly cooperation and seek common development.","chinese":"两国应该同舟共济，共克时艰，友好合作，共谋发展。"},{"english":"Our eyes meet. We both smile and we are conspirators.","chinese":"我们目光相遇，相视一笑，我们是这人生的共谋犯。"}],"related":[{"definition":["to conspire\/to plot together"],"pinyin":["he2 mou2"],"word":"合谋"},{"definition":["to conspire with sb\/to plot\/a conspirator\/a partner in crime\/an accomplice"],"pinyin":["tong2 mou2"],"word":"同谋"},{"definition":["to discuss matters of vital importance"],"pinyin":["gong4 shang1 da4 ji4"],"word":"共商大计"},{"definition":["to jointly discuss\/to discuss together (business)"],"pinyin":["gong4 shang1"],"word":"共商"},{"definition":["accomplice"],"pinyin":["gong4 fan4"],"word":"共犯"},{"definition":["conspiracy\/secret plan\/to conspire"],"pinyin":["mi4 mou2"],"word":"密谋"},{"definition":["large scale program of lasting importance\/project of paramount importance\/to think big\/annual national audit"],"pinyin":["da4 ji4"],"word":"大计"},{"definition":["to act in collusion (idiom); in cahoots with\/villains will look after one another"],"pinyin":["hang4 xie4 yi1 qi4"],"word":"沆瀣一气"},{"definition":["to collude with\/to collaborate with\/to gang up with"],"pinyin":["gou1 jie2"],"word":"勾结"},{"definition":["to scheme\/to plot\/conspiracy"],"pinyin":["mou2 hua4"],"word":"谋划"},{"definition":["villains collude together (idiom); to work hand in glove with sb (to nefarious ends)"],"pinyin":["lang2 bei4 wei2 jian1"],"word":"狼狈为奸"},{"definition":["to form an alliance\/to ally oneself with\/allied with\/aligned\/to bond with"],"pinyin":["jie2 meng2"],"word":"结盟"},{"definition":["to make a suggestion\/to state (one's views, ideas etc)\/suggestion\/advice\/idea"],"pinyin":["jian4 yan2"],"word":"建言"},{"definition":["one-party (state)"],"pinyin":["yi1 dang3"],"word":"一党"},{"definition":["to make a profit\/to gain\/to get an advantage"],"pinyin":["mou2 li4"],"word":"谋利"},{"definition":["to bribe\/to give bribes"],"pinyin":["xing2 hui4"],"word":"行贿"}]}