{"definition":["to pay attention to\/to follow sth closely\/to follow (on social media)\/concern\/interest\/attention"],"pinyin":["guan1 zhu4"],"traditional":["關注"],"rank":352.0,"normalized_rank":0.004924936689379206,"fraction":0.00038943444165820304,"cumulative_fraction":0.4633992089504223,"word":"关注","characters":[{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["guan1","Guan1"],"word":"关"},{"definition":["to inject\/to pour into\/to concentrate\/to pay attention\/stake (gambling)\/classifier for sums of money\/variant of 註|注[zhu4]","to register\/to annotate\/note\/comment"],"pinyin":["zhu4","zhu4"],"word":"注"}],"containing_words":[],"sentences":[{"english":"Considerable attention is given to the action of centrifugal force in grinding wheels.","chinese":"磨床砂轮的离心力作用受到相当的关注。"},{"english":"The Chinese government has demanded that U.S.-led NATO bear all responsibilities for this incident, and the Chinese side will continue to pay close attention to the development of the matter.","chinese":"中方将继续密切关注情况的发展。"},{"english":"The question is whether the dedicated have had more influence than the image- flashers .","chinese":"问题是无论如何对阅读的这种关注比图片根由影响。"},{"english":"Look for scratching or fiddling with clothing.","chinese":"关注抓挠或拨弄衣服的动作。"},{"english":"There is no solution to the question of climate change without forestry.","chinese":"如果不关注森林，那么气候变化问题就是无法解决的。"},{"english":"Liverpool, meanwhile, are monitoring the young Preston North End midfielder Adam Barton.","chinese":"利物浦对普瑞斯顿的中场巴顿密切关注中。"},{"english":"Pod transport technology is even starting gain some stateside attention.","chinese":"豆荚车运输技术甚至引起了美国的关注。"},{"english":"They looked at long-term sick leave (of over 90 days) and hospital admission rates.","chinese":"他们关注的重点是超过90天的长时间病假和住院率。"},{"english":"They should also be constantly concerned in taking care and cleaning their stoma .","chinese":"他们还应该不断关注，在照顾和清洁他们的气孔。"},{"english":"He says these incidents gained a lot of attention seven or eight years ago.","chinese":"他说，这些事件七八年前得到了大量的关注。"},{"english":"Diffenbaugh and Ashfaq focus specifically on heat waves over the United States.","chinese":"迪芬巴夫和阿什法克的研究特别关注美国的热浪。"},{"english":"Brennan said it has long been an area of concern.","chinese":"布伦南说，也门早已成为引人关注的地区。"},{"english":"The Industrial cluster is a topic popularily concerned in the academic world either in our country or abroad in recent years.","chinese":"产业集群是近年来国内外学术界关注的一个热点话题。"},{"english":"Why don't we just accept it for what it often is--the other person's genuine concern and desire to help?","chinese":"为什么不愿接受别人的真诚关注和帮助？"},{"english":"Finally, delegating logic often leads to a cleaner separation of concerns.","chinese":"最后，委派逻辑通常会得到更干净的关注点分离。"},{"english":"Or with Mr. Jobs, if Apple had remained just Apple Computer?","chinese":"如果苹果只是苹果电脑，人们还会如此关注乔布斯吗？"}],"related":[{"definition":["to transmit\/to forward (mail, SMS, packets of data)\/to pass on\/to republish (an article from another publication)"],"pinyin":["zhuan3 fa1"],"word":"转发"},{"definition":["to like (an online post on Weibo, Facebook etc)"],"pinyin":["dian3 zan4"],"word":"点赞"},{"definition":["to welcome\/welcome"],"pinyin":["huan1 ying2"],"word":"欢迎"},{"definition":["to sticky (an Internet forum thread etc)"],"pinyin":["zhi4 ding3"],"word":"置顶"},{"definition":["to look forward to\/to await\/expectation"],"pinyin":["qi1 dai4"],"word":"期待"},{"definition":["information"],"pinyin":["zi1 xun4"],"word":"资讯"},{"definition":["extensive\/wide range"],"pinyin":["guang3 fan4"],"word":"广泛"},{"definition":["to share (let others have some of sth good)"],"pinyin":["fen1 xiang3"],"word":"分享"},{"definition":["to keep an eye on","to regard as having good prospects"],"pinyin":["kan1 hao3","kan4 hao3"],"word":"看好"},{"definition":["article\/essay\/literary works\/writings\/hidden meaning\/CL:篇[pian1],段[duan4],頁|页[ye4]"],"pinyin":["wen2 zhang1"],"word":"文章"},{"definition":["subscription\/to subscribe to"],"pinyin":["ding4 yue4"],"word":"订阅"},{"definition":["to chase after (a popular person or item)\/to pursue\/popularity"],"pinyin":["zhui1 peng3"],"word":"追捧"},{"definition":["to attach importance to sth\/to value"],"pinyin":["zhong4 shi4"],"word":"重视"},{"definition":["to discuss passionately\/heated debate"],"pinyin":["re4 yi4"],"word":"热议"},{"definition":["to fully experience (good or bad)"],"pinyin":["bei4 shou4"],"word":"备受"},{"definition":["focus\/focal point"],"pinyin":["jiao1 dian3"],"word":"焦点"}]}