{"definition":["to take care\/to keep an eye on\/to look after\/to tell\/to remind"],"pinyin":["guan1 zhao4"],"traditional":["關照"],"rank":12977.0,"normalized_rank":0.1815650665286192,"fraction":0.000005362926055653664,"cumulative_fraction":0.9495195381654756,"word":"关照","characters":[{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["guan1","Guan1"],"word":"关"},{"definition":["according to\/in accordance with\/to shine\/to illuminate\/to reflect\/to look at (one's reflection)\/to take (a photo)\/photo\/as requested\/as before","variant of 照[zhao4]\/to shine\/to illuminate"],"pinyin":["zhao4","zhao4"],"word":"照"}],"containing_words":[{"definition":["to be indebted to sb for care\/thank you for looking after me"],"pinyin":["cheng2 meng2 guan1 zhao4"],"word":"承蒙关照"},{"definition":["please treat me kindly (conventional greeting on first meeting)"],"pinyin":["qing3 duo1 guan1 zhao4"],"word":"请多关照"}],"sentences":[{"english":"Whenever you need money, send me words three weeks ahead.","chinese":"无论何时假如你需要钱，请于三星期前来信关照。"},{"english":"After Marquis also invited a lot of attention.","chinese":"以后还请侯爵多多关照。"},{"english":"The fire had crumbled down to greyness, and one of the lamps made a gurgling appeal for attention.","chinese":"炉火已经暗淡，一盏灯咯咯响着请求关照。"},{"english":"Book art is the natural and human attention, imagery, America has become the main pursuit.","chinese":"书艺是对自然以及人的关照，意象美成为了主要追求。"},{"english":"New report, Nice to meet you.","chinese":"新人报到，请多关照。"},{"english":"I know little about the stock and hope you give me more support and consideration.","chinese":"这回请你多多关照，我对股票知之甚少。"},{"english":"The cold, pale sunlight fell on their gloomy faces, long hair and lusterless eyes.","chinese":"冷淡的阳关照著他们的愁眉苦脸和长发白眼。"},{"english":"Newland will particularly appreciate what you have done because of dear May and his new relations.","chinese":"你对梅和他的新亲戚的关照，纽兰会分外感激的。"},{"english":"I am truly honored by the kindnessattention you have shown me today.","chinese":"今天你们对我的厚意与关照，我真的感到很荣幸。"},{"english":"I am inexperienced, but also invite more attention.","chinese":"我初出茅庐，还请多多关照。"},{"english":"We shall be glad if you will se to it that the contract is duly signed.","chinese":"如果你方对合同圆满签字给予关照，我们将十分高兴。"},{"english":"Special to employ seafarers post, hope that the leadership of more concern.","chinese":"特来聘海员一职，希望各位领导多多关照。"},{"english":"The hope in later day, we looks after mutually, helps mutually.","chinese":"英语翻译希望在以后的日子里，我们互相关照。"},{"english":"Studying history is not only to seek the anecdote in the recesses, but to pay close attention to the reality.","chinese":"历史研究并非只为索隐钩沉，主要在于关照现实。"},{"english":"Now, then, I must see you all back into your rooms;","chinese":"好吧，现在我得关照大家回自己房间里去。"},{"english":"The third is to surpass the realism, guide the future.","chinese":"三是实现河现实关照的趄越指向未来。"}],"related":[{"definition":["to lead by the hand\/to guide\/to support"],"pinyin":["ti2 xie2"],"word":"提携"},{"definition":["to take care of\/to show consideration\/to attend to\/to look after"],"pinyin":["zhao4 gu5"],"word":"照顾"},{"definition":["to rely on\/to depend on"],"pinyin":["yang3 zhang4"],"word":"仰仗"},{"definition":["to correlate with\/to correspond to","to look after\/to take care of\/to attend to"],"pinyin":["zhao4 ying4","zhao4 ying5"],"word":"照应"},{"definition":["asylum\/shelter\/to shield\/to put under protection\/to take under one's wing"],"pinyin":["bi4 hu4"],"word":"庇护"},{"definition":["to help\/to assist financially"],"pinyin":["bang1 chen4"],"word":"帮衬"},{"definition":["to point out\/to indicate\/to give directions\/to show how (to do sth)\/to censure\/to pick at"],"pinyin":["zhi3 dian3"],"word":"指点"},{"definition":["to tend\/to take care of sb"],"pinyin":["zhao4 liao4"],"word":"照料"},{"definition":["to be concerned about\/to care about"],"pinyin":["guan1 xin1"],"word":"关心"},{"definition":["to be indebted (to sb)"],"pinyin":["cheng2 meng2"],"word":"承蒙"},{"definition":["to regard sth as valuable\/to think highly of (a younger person, a subordinate etc)"],"pinyin":["qi4 zhong4"],"word":"器重"},{"definition":["to cherish\/to treasure\/to take care of\/to love and protect"],"pinyin":["ai4 hu4"],"word":"爱护"},{"definition":["to empathize\/to allow (for sth)\/to show understanding\/to appreciate"],"pinyin":["ti3 liang4"],"word":"体谅"},{"definition":["to appreciate\/to recognize the worth of sth\/appreciation"],"pinyin":["shang3 shi2"],"word":"赏识"},{"definition":["to care for\/to show concern for\/to think longingly (of one's country)"],"pinyin":["juan4 gu4"],"word":"眷顾"},{"definition":["to give instructions\/to give advice"],"pinyin":["dian3 bo1"],"word":"点拨"}]}