{"definition":["Guan Yu (-219), general of Shu and blood-brother of Liu Bei in Romance of the Three Kingdoms, fearsome fighter famous for virtue and loyalty\/posthumously worshipped and identified with the guardian Bodhisattva Sangharama"],"pinyin":["Guan1 Yu3"],"traditional":["關羽"],"rank":24880.0,"normalized_rank":0.3481034796356666,"fraction":0.0000014962706753348048,"cumulative_fraction":0.9841120864636904,"word":"关羽","characters":[{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["guan1","Guan1"],"word":"关"},{"definition":["feather\/5th note in pentatonic scale"],"pinyin":["yu3"],"word":"羽"}],"containing_words":[],"sentences":[{"english":"Pang shot an arrow at Guan who was unable to dodge it.","chinese":"庞德取箭，关羽躲闪不及中箭，回营养伤。"},{"english":"The worship of GUAN Yu is popular in China.","chinese":"关羽崇拜是民间信仰中较为突出的信仰形态之一。"},{"english":"Guan Yu was hit by a poisonous arrow in the right arm while attacking Fancheng City.","chinese":"关羽攻打樊城时，被毒箭射中右臂。"},{"english":"The man was named Guan Yu.","chinese":"原来这个人就是关羽。"},{"english":"This can be proved from the evolvement of Guan Yu's image.","chinese":"这需要从关羽形象演化史中去探究。"},{"english":"When Guan Yu returned with Hua Xiong's head， the wine in the cup was still warm.","chinese":"当关羽提华雄人头进帐时，那杯酒还微微烫手。"},{"english":"The \"Forest of Guan Yu\" is one of the three major memorial temples of Lord Guan.","chinese":"关林庙是关羽的三个纪念庙宇之一。"},{"english":"Determined to take over Fancheng City, Guan refused to retreat.","chinese":"关羽决心攻下樊城，不肯退。"},{"english":"Lord Guan eyed Liu Bei, who sensed his brother's intent and rose to bid Zhou Yu farewell.","chinese":"关羽给刘备使眼色，刘备会意，起身告辞。"}],"related":[{"definition":["Zhang Fei (168-221), general of Shu and blood-brother of Liu Bei in Romance of the Three Kingdoms, famous as fearsome fighter and lover of wine"],"pinyin":["Zhang1 Fei1"],"word":"张飞"},{"definition":["Zhao Yun (-229), general of Shu in Romance of the Three Kingdoms"],"pinyin":["Zhao4 Yun2"],"word":"赵云"},{"definition":["Cao Cao (155-220), famous statesman and general at the end of Han, noted poet and calligrapher, later warlord, founder and first king of Cao Wei 曹魏, father of Emperor Cao Pi 曹丕\/the main villain of novel the Romance of Three Kingdoms 三國演義|三国演义"],"pinyin":["Cao2 Cao1"],"word":"曹操"},{"definition":["Lü Bu (-198), general and warlord"],"pinyin":["Lu:3 Bu4"],"word":"吕布"},{"definition":["Liu Bei (161-223), warlord at the end of the Han dynasty and founder of the Han kingdom of Shu 蜀漢|蜀汉 (c. 200-263), later the Shu Han dynasty"],"pinyin":["Liu2 Bei4"],"word":"刘备"},{"definition":["Zhuge Liang (181-234), military leader and prime minister of Shu Han 蜀漢|蜀汉 during the Three Kingdoms period\/the main hero of the fictional Romance of Three Kingdoms 三國演義|三国演义, where he is portrayed as a sage and military genius\/mastermind"],"pinyin":["Zhu1 ge3 Liang4"],"word":"诸葛亮"},{"definition":["Huang Zhong (-220), general of Shu in Romance of the Three Kingdoms, portrayed as an old fighter"],"pinyin":["Huang2 Zhong1"],"word":"黄忠"},{"definition":["Zhou Yu or Chou Yü (175-210), famous general of the southern Wu kingdom and victor of the battle of Redcliff\/in Romance of the Three Kingdoms, absolutely no match for Zhuge Liang"],"pinyin":["Zhou1 Yu2"],"word":"周瑜"},{"definition":["Han Xin (-196 BC), famous general of first Han emperor Liu Bang 劉邦|刘邦[Liu2 Bang1]"],"pinyin":["Han2 Xin4"],"word":"韩信"},{"definition":["Ma Chao (176-222), general of Shu in Romance of the Three Kingdoms"],"pinyin":["Ma3 Chao1"],"word":"马超"},{"definition":["Lü Meng (178-219), general of the southern state of Wu"],"pinyin":["Lu:3 Meng2"],"word":"吕蒙"},{"definition":["Liu Chan 劉禪|刘禅 (207-271), son of Liu Bei, reigned as Shu Han emperor 233-263"],"pinyin":["Liu2 Chan2"],"word":"刘禅"},{"definition":["Sun Quan (reigned 222-252), southern warlord and king of state of Wu 吳|吴 in the Three Kingdoms period"],"pinyin":["Sun1 Quan2"],"word":"孙权"},{"definition":["courtesy name of Zhuge Liang 諸葛亮|诸葛亮[Zhu1 ge3 Liang4]"],"pinyin":["Kong3 ming2"],"word":"孔明"},{"definition":["Sun Ce (175-200), general and major warlord of the Later Han Dynasty"],"pinyin":["Sun1 Ce4"],"word":"孙策"},{"definition":["Jiang Ziya (c. 1100 BC, dates of birth and death unknown), partly mythical sage advisor to King Wen of Zhou 周文王[Zhou1 Wen2 wang2] and purported author of “Six Secret Strategic Teachings” 六韜|六韬[Liu4 tao1], one of the Seven Military Classics of ancient China 武經七書|武经七书[Wu3 jing1 Qi1 shu1]"],"pinyin":["Jiang1 Zi3 ya2"],"word":"姜子牙"}]}