{"definition":["to catch a thief by closing his escape route (idiom)"],"pinyin":["guan1 men2 zhuo1 zei2"],"traditional":["關門捉賊"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"关门捉贼","characters":[{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["guan1","Guan1"],"word":"关"},{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["men2","Men2"],"word":"门"},{"definition":["to clutch\/to grab\/to capture"],"pinyin":["zhuo1"],"word":"捉"},{"definition":["thief\/traitor\/wily\/deceitful\/evil\/extremely"],"pinyin":["zei2"],"word":"贼"}],"containing_words":[],"sentences":[],"related":[{"definition":["to defeat the enemy by capturing their chief (idiom)"],"pinyin":["qin2 zei2 qin2 wang2"],"word":"擒贼擒王"},{"definition":["to lure the tiger from its domain in the mountains (idiom)\/to lure an enemy away from his territory"],"pinyin":["diao4 hu3 li2 shan1"],"word":"调虎离山"},{"definition":["to obtain safe passage to conquer the State of Guo\/to borrow the resources of an ally to attack a common enemy (idiom)"],"pinyin":["jia3 dao4 fa2 Guo2"],"word":"假道伐虢"},{"definition":["lit. secretly crossing the Wei River 渭河[Wei4 He2] at Chencang (idiom, refers to a stratagem used by Liu Bang 劉邦|刘邦[Liu2 Bang1] in 206 BC against Xiang Yu 項羽|项羽[Xiang4 Yu3] of Chu)\/fig. to feign one thing while doing another\/to cheat under cover of a diversion"],"pinyin":["an4 du4 Chen2 cang1"],"word":"暗渡陈仓"},{"definition":["to threaten the east and strike to the west (idiom)\/to create a diversion"],"pinyin":["sheng1 dong1 ji1 xi1"],"word":"声东击西"},{"definition":["to catch a turtle in a jar (idiom); to set oneself an easy target\/a turkey shoot"],"pinyin":["weng4 zhong1 zhuo1 bie1"],"word":"瓮中捉鳖"},{"definition":["to deck the tree with false blossoms\/to make something of no value appear valuable (idiom)"],"pinyin":["shu4 shang4 kai1 hua1"],"word":"树上开花"},{"definition":["lit. the plum tree withers in place of the peach tree\/to substitute one thing for another\/to carry the can for sb"],"pinyin":["li3 dai4 tao2 jiang1"],"word":"李代桃僵"},{"definition":["lit. please Sir, get into the boiling pot (idiom)\/fig. to give sb a taste of his own medicine"],"pinyin":["qing3 jun1 ru4 weng4"],"word":"请君入瓮"},{"definition":["lit. to besiege 魏[Wei4] and rescue 趙|赵[Zhao4] (idiom)\/fig. to relieve a besieged ally by attacking the home base of the besiegers"],"pinyin":["wei2 Wei4 jiu4 Zhao4"],"word":"围魏救赵"},{"definition":["The Thirty-Six Stratagems, a Chinese essay used to illustrate a series of stratagems used in politics, war, and in civil interaction\/all the possible schemes and stratagems"],"pinyin":["san1 shi2 liu4 ji4"],"word":"三十六计"},{"definition":["to beat sb at their own game (idiom)"],"pinyin":["jiang1 ji4 jiu4 ji4"],"word":"将计就计"},{"definition":["the mantis stalks the cicada, unaware of the oriole behind (idiom, from Daoist classic Zhuangzi 莊子|庄子); to pursue a narrow gain while neglecting a greater danger"],"pinyin":["tang2 lang2 bu3 chan2"],"word":"螳螂捕蝉"},{"definition":["lit. a short-cut to crush Guo (idiom); fig. to connive with sb to damage a third party, then turn on the partner"],"pinyin":["jia3 tu2 mie4 Guo2"],"word":"假途灭虢"},{"definition":["lit. to pull a snake from its hole\/to expose a malefactor (idiom)"],"pinyin":["yin3 she2 chu1 dong4"],"word":"引蛇出洞"},{"definition":["leaving the door open invites the thief (idiom); to invite disaster by giving evildoers a free hand"],"pinyin":["kai1 men2 yi1 dao4"],"word":"开门揖盗"}]}