{"definition":["to rise\/to spring up\/to burgeon\/to be aroused\/to come into vogue"],"pinyin":["xing1 qi3"],"traditional":["興起"],"rank":7909.0,"normalized_rank":0.11065717123948904,"fraction":0.000012189423798225059,"cumulative_fraction":0.9087002279206912,"word":"兴起","characters":[{"definition":["to rise\/to flourish\/to become popular\/to start\/to encourage\/to get up\/(often used in the negative) to permit or allow (dialect)\/maybe (dialect)","feeling or desire to do sth\/interest in sth\/excitement","surname Xing"],"pinyin":["xing1","xing4","Xing1"],"word":"兴"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"This is the ancient origins of the rise of Buddhism and Taoism in the pre-existing folk activities.","chinese":"这是源流古者在佛道教兴起前就有的民俗活动。"},{"english":"Summary: What does rise of the Tea Party movement mean for U.","chinese":"茶党运动的兴起对美国外交政策意味着什么呢？"},{"english":"Hundred Years' Translation Movement began to arise in Abbasid Dynasty of Arab in the Middle Ages.","chinese":"百年翻译运动兴起于中世纪阿拉伯的阿拔斯王朝。"},{"english":"What have you gained — or lost — from the internet’s rise?","chinese":"您从互联网的兴起获得什么或者失去什么？"},{"english":"Binxing is a kind of etiquette for commending and learning encouragement, which is origin from \"Zhou\".","chinese":"宾兴起源于《周礼》，是一种表彰和劝学的礼仪。"},{"english":"Later, when metaphysics and buddhism arose in Wei Jin period, the shape and bearing of an object.","chinese":"魏晋时期玄佛兴起，理沟通了形与神。"},{"english":"The article content is divided into three parts:Part one, the rise of the constitutionalism group at the beginning of the 20th century.","chinese":"第一部分，20世纪初立宪派的兴起。"},{"english":"The just said rise also doesn't feel, just discover a cool idea set of now person.","chinese":"刚才说的兴起还不觉得，现在才发现凉意袭人。"},{"english":"King Xerxes had a mad thought in his drunken state.","chinese":"满是醉意的亚哈随鲁王突然兴起一个疯狂的念头。"},{"english":"Living in the countryside was only Patricia's passing fancy.","chinese":"到乡村定居不过是帕里西夏一时兴起的想法。"},{"english":"The \"reality TV\" is a new kind entertainment on telescreen .","chinese":"真人秀是近年来在电视屏幕上兴起的新的娱乐形式。"},{"english":"Lockard sent the package anonymously, just on a whim.","chinese":"因此洛卡德先生一时兴起，寄送了一个匿名的包裹。"},{"english":"Stand Up, stand up for Jesus, Ye soldiers of the cross;","chinese":"兴起兴起为耶稣十架忠勇精兵。"},{"english":"Stand Up, stand up for Jesus, Ye soldiers of the cross;","chinese":"兴起兴起为耶稣十架忠勇精兵。"},{"english":"Non-silicon-based ordered mesoporous materials in recent years has been the emergence of a new research focus.","chinese":"非硅基有序介孔材料是近年来新兴起的一个研究热点。"},{"english":"WEB-based simulation is a new branch of simulation technology.","chinese":"基于WEB的仿真是一门刚刚兴起的仿真技术分支。"}],"related":[{"definition":["to rise suddenly\/to grow vigorously"],"pinyin":["bo2 xing1"],"word":"勃兴"},{"definition":["flourishing and still in the ascendant (idiom); rapidly expanding\/still growing strong\/on the up"],"pinyin":["fang1 xing1 wei4 ai4"],"word":"方兴未艾"},{"definition":["to be in vogue\/to be prevalent"],"pinyin":["sheng4 xing2"],"word":"盛行"},{"definition":["to develop rapidly"],"pinyin":["xun4 su4 fa1 zhan3"],"word":"迅速发展"},{"definition":["tempest\/wave (of popular sentiment etc)\/craze or fad"],"pinyin":["feng1 chao2"],"word":"风潮"},{"definition":["to flourish\/to thrive"],"pinyin":["xing1 sheng4"],"word":"兴盛"},{"definition":["Xinxing county in Yunfu 雲浮|云浮[Yun2 fu2], Guangdong\/Xinxing or Hsinhsing district of Kaohsiung city 高雄市[Gao1 xiong2 shi4], south Taiwan","(of markets, industries, infectious diseases etc) rising\/emerging\/in the ascendant"],"pinyin":["Xin1 xing1","xin1 xing1"],"word":"新兴"},{"definition":["upsurge\/popular craze"],"pinyin":["re4 chao2"],"word":"热潮"},{"definition":["to rise abruptly (to a towering position)\/to tower over\/to spring up\/to emerge suddenly\/the emergence (e.g. of a power)"],"pinyin":["jue2 qi3"],"word":"崛起"},{"definition":["rampant\/very popular"],"pinyin":["da4 xing2 qi2 dao4"],"word":"大行其道"},{"definition":["(literary) to decline\/to wane\/title of a section in the Book of Songs 詩經|诗经[Shi1 jing1]"],"pinyin":["shi4 wei1"],"word":"式微"},{"definition":["wave\/tides"],"pinyin":["lang4 chao2"],"word":"浪潮"},{"definition":["to be popular for a while\/to be all the rage for a time"],"pinyin":["feng1 xing2 yi1 shi2"],"word":"风行一时"},{"definition":["to emerge to meet a historic destiny (idiom)\/to arise at an opportune time\/able to take advantage of an opportunity\/to rise to the occasion"],"pinyin":["ying4 yun4 er2 sheng1"],"word":"应运而生"},{"definition":["to fall\/to drop\/to decline\/to deteriorate\/to go downhill"],"pinyin":["shuai1 luo4"],"word":"衰落"},{"definition":["to emerge as a new force to be reckoned with (idiom)"],"pinyin":["yi4 jun1 tu1 qi3"],"word":"异军突起"}]}