{"definition":["before the troops move, fodder and provisions go first (idiom); logistics comes before military maneuvers\/an army marches on its stomach"],"pinyin":["bing1 ma3 wei4 dong4 , liang2 cao3 xian1 xing2"],"traditional":["兵馬未動，糧草先行"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"兵马未动，粮草先行","characters":[{"definition":["soldiers\/a force\/an army\/weapons\/arms\/military\/warlike\/CL:個|个[ge4]"],"pinyin":["bing1"],"word":"兵"},{"definition":["horse\/CL:匹[pi3]\/horse or cavalry piece in Chinese chess\/knight in Western chess","surname Ma\/abbr. for Malaysia 馬來西亞|马来西亚[Ma3 lai2 xi1 ya4]"],"pinyin":["ma3","Ma3"],"word":"马"},{"definition":["not yet\/did not\/have not\/not\/8th earthly branch: 1-3 p.m., 6th solar month (7th July-6th August), year of the Sheep\/ancient Chinese compass point: 210°"],"pinyin":["wei4"],"word":"未"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"动"},{"word":"，"},{"definition":["grain\/food\/provisions\/agricultural tax paid in grain"],"pinyin":["liang2"],"word":"粮"},{"definition":["variant of 草[cao3]","grass\/straw\/manuscript\/draft (of a document)\/careless\/rough\/CL:棵[ke1],撮[zuo3],株[zhu1],根[gen1]","variant of 肏[cao4]"],"pinyin":["cao3","cao3","cao4"],"word":"草"},{"definition":["early\/prior\/former\/in advance\/first"],"pinyin":["xian1"],"word":"先"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"}],"containing_words":[],"sentences":[],"related":[{"definition":["lit. Train an army for a thousand days to use it for an hour. (idiom); fig. extensive preparation eventually pays off"],"pinyin":["yang3 bing1 qian1 ri4 , yong4 bing1 yi1 shi2"],"word":"养兵千日，用兵一时"},{"definition":["lit. sharpening the axe won't make the wood-splitting take longer (idiom)\/fig. time invested in preparations is not lost\/a beard well lathered is half shaved"],"pinyin":["mo2 dao1 bu4 wu4 kan3 chai2 gong1"],"word":"磨刀不误砍柴工"},{"definition":["know yourself and know your enemy, and you will never be defeated (idiom, from Sunzi's \"The Art of War\" 孫子兵法|孙子兵法[Sun1 zi3 Bing1 fa3])"],"pinyin":["zhi1 ji3 zhi1 bi3 , bai3 zhan4 bu4 dai4"],"word":"知己知彼，百战不殆"},{"definition":["lit. speed is a crucial asset in war (idiom)\/fig. swift and resolute (in doing sth)"],"pinyin":["bing1 gui4 shen2 su4"],"word":"兵贵神速"},{"definition":["lit. everything is ready, all we need is an east wind (idiom)\/fig. lacking only one tiny crucial item"],"pinyin":["wan4 shi4 ju4 bei4 , zhi3 qian4 dong1 feng1"],"word":"万事俱备，只欠东风"},{"definition":["The cleverest housewife cannot cook without rice (idiom); You won't get anywhere without equipment."],"pinyin":["qiao3 fu4 nan2 wei2 wu2 mi3 zhi1 chui1"],"word":"巧妇难为无米之炊"},{"definition":["To do a good job, an artisan needs the best tools (idiom). Good tools are prerequisite to the successful execution of a job"],"pinyin":["gong1 yu4 shan4 qi2 shi4 , bi4 xian1 li4 qi2 qi4"],"word":"工欲善其事，必先利其器"},{"definition":["to know the enemy and know oneself (idiom, from Sunzi's \"The Art of War\")"],"pinyin":["zhi1 bi3 zhi1 ji3"],"word":"知彼知己"},{"definition":["He who gives no thought to far-flung problems soon finds suffering nearby (idiom, from Analects).\/Smug concentration on the here and now will lead to future sorrow."],"pinyin":["ren2 wu2 yuan3 lu:4 , bi4 you3 jin4 you1"],"word":"人无远虑，必有近忧"},{"definition":["to fight a battle\/to go to war"],"pinyin":["da3 zhang4"],"word":"打仗"},{"definition":["Easy to raise an army of one thousand, but hard to find a good general. (idiom)"],"pinyin":["qian1 jun1 yi4 de2 , yi1 jiang4 nan2 qiu2"],"word":"千军易得，一将难求"},{"definition":["as the proverb says\/as they say..."],"pinyin":["su2 hua4 shuo1"],"word":"俗话说"},{"definition":["to emerge victorious in every battle\/to be ever-victorious"],"pinyin":["bai3 zhan4 bai3 sheng4"],"word":"百战百胜"},{"definition":["to come unscathed through a hundred battles (idiom, from Sunzi's \"The Art of War\" 孫子兵法|孙子兵法[Sun1 zi3 Bing1 fa3]); to win every fight"],"pinyin":["bai3 zhan4 bu4 dai4"],"word":"百战不殆"},{"definition":["Food is the God of the people. (idiom); People view food as the primary need.\/Food first, ethical niceties second"],"pinyin":["min2 yi3 shi2 wei2 tian1"],"word":"民以食为天"},{"definition":["Preparedness averts peril.\/to be prepared, just in case (idiom)"],"pinyin":["you3 bei4 wu2 huan4"],"word":"有备无患"}]}