{"definition":["other\/(sth or sb) else\/the rest"],"pinyin":["qi2 ta1"],"traditional":["其他"],"rank":202.0,"normalized_rank":0.00282624207742784,"fraction":0.0005736507618989915,"cumulative_fraction":0.3943508512028337,"word":"其他","characters":[{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["he or him\/(used for either sex when the sex is unknown or unimportant)\/(used before sb's name for emphasis)\/(used as a meaningless mock object)\/other\/another"],"pinyin":["ta1"],"word":"他"}],"containing_words":[],"sentences":[{"english":"\"More than any other subject, weight is delicate, \" Maddison said.","chinese":"“体重问题比其他问题都要微妙，”麦迪逊说。"},{"english":"Re-registration and other issues.","chinese":"重新登记和其他问题。"},{"english":"Some other drugs have to be taken on an empty stomach.","chinese":"而其他某些药物，必须在空腹服用。"},{"english":"A blindly ending branch of the alimentary canal or other organ.","chinese":"消化道或其他器官分支的盲端。"},{"english":"The acids in tomato juice can degrade the drink’s other ingredients.","chinese":"番茄汁中的酸会削弱其他材料带来的味觉。"},{"english":"Have Chesapeake and other natural-gas producers survived the worst of the crisis?","chinese":"切萨皮克以及其他的天然气公司真的挺过来了吗？"},{"english":"Applicants should not be receiving any other bursary schemes.","chinese":"申请者不应是其他助学金计划的领受者。"},{"english":"The horse's strides are shorter than at the other canters, without losing elasticity and cadence.","chinese":"马的步幅比其他几种跑步较短，但却不失弹性与节奏。"},{"english":"It is believed that the sperm whale dives deeper than any other cetacean.","chinese":"人们相信，抹香鲸比其他鲸类动物潜得更深。"},{"english":"It took only a short walk on a Beijing street to find other foreigners.","chinese":"我在北京街头仅走了一小段路来寻找其他的外国人。"},{"english":"He shows up in other people and what they say to you.","chinese":"他以其他人的形式出现，这些人对你说什么？"},{"english":"All these facilities help society reduce the generation gap between the elderly and the others.","chinese":"这可以协助缩小老人和其他人之间的代沟。"},{"english":"Unlike most other fish, they are monogamous and mate for life.","chinese":"不像其他的鱼类，它们是一夫一妻制并终生厮守。"},{"english":"Chinese culture sees all non-Chinese as sub-human, to be exploited.","chinese":"中国文化把所有的其他人种视为有待剥削的次等民族。"},{"english":"Gahl: The NT5E gene is like many other genes.","chinese":"NT5E基因像许多其他基因一样。"},{"english":"But users also ask about current events and many other subjects.","chinese":"但是用户也会问及时事和许多其他的问题。"}],"related":[{"definition":["other\/the others\/else\/other than it\/in addition to the thing mentioned above"],"pinyin":["qi2 ta1"],"word":"其它"},{"definition":["apart from\/other than\/except for\/external\/outside of\/on the other side of\/beyond"],"pinyin":["yi3 wai4"],"word":"以外"},{"definition":["outside\/excluding"],"pinyin":["zhi1 wai4"],"word":"之外"},{"definition":["besides\/apart from (... also...)\/in addition to\/except (for)"],"pinyin":["chu2 le5"],"word":"除了"},{"definition":["else\/other"],"pinyin":["bie2 de5"],"word":"别的"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["these"],"pinyin":["zhe4 xie1"],"word":"这些"},{"definition":["outside\/in addition\/foreign\/external"],"pinyin":["wai4"],"word":"外"},{"definition":["or\/possibly\/maybe\/perhaps"],"pinyin":["huo4 zhe3"],"word":"或者"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["the rest\/the others\/remaining\/remainder\/apart from them"],"pinyin":["qi2 yu2"],"word":"其余"},{"definition":["additional\/in addition\/besides\/separate\/other\/moreover\/furthermore"],"pinyin":["ling4 wai4"],"word":"另外"},{"definition":["any\/whatever\/whichever\/whatsoever"],"pinyin":["ren4 he2"],"word":"任何"},{"definition":["to get rid of\/to remove\/to exclude\/to eliminate\/to wipe out\/to divide\/except\/not including"],"pinyin":["chu2"],"word":"除"},{"definition":["aforementioned\/above-mentioned"],"pinyin":["shang4 shu4"],"word":"上述"},{"definition":["only natural\/as it should be\/certainly\/of course\/without doubt"],"pinyin":["dang1 ran2"],"word":"当然"}]}