{"definition":["the rest\/the others\/remaining\/remainder\/apart from them"],"pinyin":["qi2 yu2"],"traditional":["其餘"],"rank":3030.0,"normalized_rank":0.0423936311614176,"fraction":0.00004732988802456368,"cumulative_fraction":0.7921479082078352,"word":"其余","characters":[{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["extra\/surplus\/remaining\/remainder after division\/(following numerical value) or more\/in excess of (some number)\/residue (math.)\/after\/I\/me","surname Yu","(archaic) I\/me\/variant of 餘|余[yu2], surplus"],"pinyin":["yu2","Yu2","yu2"],"word":"余"}],"containing_words":[],"sentences":[{"english":"But, you can perform range scans on the remaining columns in the index key.","chinese":"但是，您可以在索引键的其余列上执行范围扫面。"},{"english":"But others seem content to rely on automatic stabilisers.","chinese":"而其余国家则情愿依赖自动稳定器的作用。"},{"english":"Two passengers were hospitalized in critical condition, while injuries to the 11 others were less serious.","chinese":"两名乘客尚在抢救中，其余11名乘客伤势较轻。"},{"english":"This article provides the rest of the story.","chinese":"本文给出这个故事的其余部分。"},{"english":"For example, the meridian pertaining to the kidney is named the kidney meridian, and the rest may be deduced by analogy.","chinese":"例如，属于肾的经脉命名为肾经，其余由此类推。"},{"english":"As for the other resultant mental states that occur during the rest of life, they number thirty-two.","chinese":"在生命的其余时间生起的果报心共有三十二种。"},{"english":"Octagon —shapedturrets rest on the four corners of the wall.","chinese":"八角形塔楼其余的四个角落的墙上。"},{"english":"What follows is the rest of our conversation.","chinese":"以下是我们谈话的其余部分。"},{"english":"Ignoring those, the remaining central shape is nondescript.","chinese":"不顾这些，其余的中央形状是不伦不类。"},{"english":"All the rest of the Israelites were also of one mind to make David king.","chinese":"以色列其余的人也都一心要立大卫作王。"},{"english":"It will help us recover the rest of the animal more easily and efficiently.","chinese":"这将帮助我们更容易和有效得恢复其余的动物。"},{"english":"Most came from India and the rest hailed from 11 other countries.","chinese":"大部分成员来自印度，其余则来自其他11个国家。"},{"english":"One third of the pawpaw is for the dish, the remainder is for you.","chinese":"这个木瓜三分之一用来做菜，其余的都是你的啦。"},{"english":"About half of them are Chinese, and the rest are Americans from Chengdu's tightknit community of expatriates.","chinese":"当中大约一半是中国人，其余是生活在成都的美国人。"},{"english":"Except the normal control group, experimental colitis was induced in all mice by oxazolone enema.","chinese":"除正常对照组外，其余小鼠均以恶唑酮灌肠造模。"},{"english":"A: I have a tuition scholarship from the university. Otherwise I’m on my own.","chinese":"学校只让我免缴学费，其余还是自掏腰包。"}],"related":[{"definition":["other\/the others\/else\/other than it\/in addition to the thing mentioned above"],"pinyin":["qi2 ta1"],"word":"其它"},{"definition":["to get rid of\/to remove\/to exclude\/to eliminate\/to wipe out\/to divide\/except\/not including"],"pinyin":["chu2"],"word":"除"},{"definition":["remainder\/surplus"],"pinyin":["sheng4 yu2"],"word":"剩余"},{"definition":["apart from\/other than\/except for\/external\/outside of\/on the other side of\/beyond"],"pinyin":["yi3 wai4"],"word":"以外"},{"definition":["other\/(sth or sb) else\/the rest"],"pinyin":["qi2 ta1"],"word":"其他"},{"definition":["outside\/in addition\/foreign\/external"],"pinyin":["wai4"],"word":"外"},{"definition":["in large part\/the greater part\/the majority"],"pinyin":["da4 bu4 fen5"],"word":"大部分"},{"definition":["outside\/excluding"],"pinyin":["zhi1 wai4"],"word":"之外"},{"definition":["to remain\/left over"],"pinyin":["sheng4 xia4"],"word":"剩下"},{"definition":["whole\/entire\/complete"],"pinyin":["quan2 bu4"],"word":"全部"},{"definition":["among\/in\/included among these"],"pinyin":["qi2 zhong1"],"word":"其中"},{"definition":["remaining"],"pinyin":["yu2 xia4"],"word":"余下"},{"definition":["overwhelming majority"],"pinyin":["jue2 da4 bu4 fen5"],"word":"绝大部分"},{"definition":["to eliminate\/to remove\/except for\/apart from"],"pinyin":["chu2 qu4"],"word":"除去"},{"definition":["besides\/apart from (... also...)\/in addition to\/except (for)"],"pinyin":["chu2 le5"],"word":"除了"},{"definition":["barely\/only\/merely"],"pinyin":["jin3"],"word":"仅"}]}