{"definition":["in between\/within that interval\/in the meantime"],"pinyin":["qi2 jian1"],"traditional":["其間"],"rank":5837.0,"normalized_rank":0.08166720299973416,"fraction":0.000019254740938342574,"cumulative_fraction":0.8769127649714381,"word":"其间","characters":[{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["gap\/to separate\/to thin out (seedlings)\/to sow discontent","between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms"],"pinyin":["jian4","jian1"],"word":"间"}],"containing_words":[],"sentences":[{"english":"During this period of 6 years, he quelled the nationalities' Risingup in Yunnan successfully.","chinese":"其间，他成功地镇压了滇东北各族人民起义。"},{"english":"Despite their many differences, there is a remarkable degree of homogeneity among them.","chinese":"他们的差异点虽多，但其间亦有极大的同质点。"},{"english":"In the process, what must be spoken meets what cannot be said.","chinese":"其间，非说不可的遇到了说不出来的。"},{"english":"The space is dotted with various types of houses and tradesman 's workshops with their messy yards.","chinese":"其间还点缀着各种住宅和商人的店铺和各式院子。"},{"english":"He spent around an hour rowing across the river, and also, his boat almost turned over for twice.","chinese":"他花了约一个小时划船过河，其间有两次几乎翻船。"},{"english":"For mount Sion, because it is destroyed, foxes have walked upon it.","chinese":"因为熙雍山已经荒芜，狐狸成群出没其间。"},{"english":"Stream it to the poor, are a fortress village southeast, during which Coke are few Yan.","chinese":"涧之可穷者，皆出石城村东南，其间可乐者数焉。"},{"english":"Lo, let that night be solitary, let no joyful voice come therein.","chinese":"愿那夜没有生育，其间也没有欢乐的声音。"},{"english":"The difference between the living of fish and the death of human is their own individuality.","chinese":"一生一死，其间的差异，就在于个性的不同。"},{"english":"Meanwhile, Aili finds out that she has contracted gastric cancer.","chinese":"其间，艾莉惊悉自己得了胃癌。"},{"english":"A little body often harbours a great soul.","chinese":"莫道身躯小，圣人寓其间。"},{"english":"To be fair, the Republican race is messier than the Democratic one.","chinese":"为公平其间，共和党的竞选就比民主党的乱一些。"},{"english":"During the same period, a Jordanian soldier had gone berserk and killed seven Israeli schoolchildren.","chinese":"其间，一名约旦士兵疯狂杀死了七名以色列学童。"},{"english":"During that walk, the astronaut or taikonaut also will test a new Chinese-made spacesuit.","chinese":"其间，中国宇航员还将对中国制造的宇航服进行测试。"},{"english":"During the period, I participated in the preparatory work of Beijing Wangjing Branch and finished it completely.","chinese":"其间，参与完成了北京望京支行的筹建工作。"},{"english":"They had scoured the intervening miles of moorland.","chinese":"他们已经仔细搜遍了其间绵延数英里的高沼地。"}],"related":[{"definition":["occasionally\/now and then"],"pinyin":["jian4 huo4"],"word":"间或"},{"definition":["gap\/to separate\/to thin out (seedlings)\/to sow discontent","between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms"],"pinyin":["jian4","jian1"],"word":"间"},{"definition":["inside\/among\/in the midst of (doing sth)\/during"],"pinyin":["zhi1 zhong1"],"word":"之中"},{"definition":["winding\/(fig.) complicated"],"pinyin":["qu1 zhe2"],"word":"曲折"},{"definition":["here\/this place"],"pinyin":["ci3 jian1"],"word":"此间"},{"definition":["along the sides of the road\/by the wayside"],"pinyin":["yan2 tu2"],"word":"沿途"},{"definition":["although\/even though"],"pinyin":["sui1"],"word":"虽"},{"definition":["period of time\/time\/time period\/period\/CL:個|个[ge4]"],"pinyin":["qi1 jian1"],"word":"期间"},{"definition":["strewn at random\/disorderly\/untidy\/irregular\/uneven"],"pinyin":["cuo4 luo4"],"word":"错落"},{"definition":["to insert\/to take turns, alternate\/to interweave\/to interlace\/subplot\/interlude\/episode\/(military) to thrust deep into the enemy forces"],"pinyin":["chuan1 cha1"],"word":"穿插"},{"definition":["to crisscross\/to intertwine"],"pinyin":["jiao1 cuo4"],"word":"交错"},{"definition":["to go through\/to bore through\/to push one's way through"],"pinyin":["chuan1 xing2"],"word":"穿行"},{"definition":["from time to time\/now and then\/occasionally\/frequently"],"pinyin":["bu4 shi2"],"word":"不时"},{"definition":["next\/later\/after that"],"pinyin":["qi2 hou4"],"word":"其后"},{"definition":["around\/from beginning to end\/all around\/front and rear"],"pinyin":["qian2 hou4"],"word":"前后"},{"definition":["large and small\/of all sizes"],"pinyin":["da4 da4 xiao3 xiao3"],"word":"大大小小"}]}