{"definition":["to support one's family (idiom); to have difficulty feeding a family"],"pinyin":["yang3 jia1 hu2 kou3"],"traditional":["養家糊口"],"rank":25438.0,"normalized_rank":0.3559106235921257,"fraction":0.0000014229899066501147,"cumulative_fraction":0.9849263439731984,"word":"养家糊口","characters":[{"definition":["to raise (animals)\/to bring up (children)\/to keep (pets)\/to support\/to give birth"],"pinyin":["yang3"],"word":"养"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"},{"definition":["congee\/making a living","variant of 糊[hu2]","muddled\/paste\/scorched","paste\/cream"],"pinyin":["hu2","hu2","hu2","hu4"],"word":"糊"},{"definition":["mouth\/classifier for things with mouths (people, domestic animals, cannons, wells etc)\/classifier for bites or mouthfuls"],"pinyin":["kou3"],"word":"口"}],"containing_words":[],"sentences":[{"english":"Some of the farmers had quit farming and were cutting railroad ties so they could feed their families.","chinese":"有些农民放弃了耕作，靠砍伐铺铁路的枕木养家糊口。"},{"english":"We work. We strive to earn a living.","chinese":"我们工作，我们努力赚钱养家糊口。"},{"english":"I'm just making some kind of living in what I've been doing the last four years.","chinese":"我就是在用我这四年学到的东西养家糊口。"},{"english":"Father was too weak to support the family and the son was dragooned into stealing again.","chinese":"父亲体弱无力养家糊口，儿子又被迫行窃。"},{"english":"The workers send money home to support their families. These are called immigrant remittances.","chinese":"他们寄钱回家，以养家糊口，这称为移民汇款。"},{"english":"The peddlers went to every alley and street to make money to support their families.","chinese":"小商贩们走街串巷赚点小钱养家糊口。"},{"english":"L: Because I like having a job. I don't want to get canned.","chinese":"没办法得养家糊口啊，我可不想被炒了。"},{"english":"I know that I can love, raise a family and give birth to a healthy baby.","chinese":"我知道我可以去爱，养家糊口并生出一名健康的婴儿。"},{"english":"With financial resources exhausted and the pressure of a family to support, Jankowski's thoughts turned to escape.","chinese":"经济来源的枯竭和养家糊口的压力让他想到逃避。"},{"english":"My brother and I worked day and night to keep the family.","chinese":"我和我兄弟为了养家糊口而日夜操劳。"},{"english":"Males are expected to be breadwinners while females rear a family's only child.","chinese":"男人要养家糊口，而女人在家中抚养他们唯一的孩子。"},{"english":"We work to support our family and to promote ourselves.","chinese":"我们工作是为了养家糊口，也是为了自我发展。"},{"english":"Some felt so desperate that they began stealing to feed their families.","chinese":"一些人绝望了，以至于他们开始偷窃来养家糊口。"},{"english":"Many return to families crippled by debt from months without a breadwinner.","chinese":"许多人回到家中不能养家糊口，数月以来负债累累。"}],"related":[{"definition":["to scrape a meager living\/to get by with difficulty","variant of 糊口[hu2 kou3]"],"pinyin":["hu2 kou3","hu2 kou3"],"word":"糊口"},{"definition":["to support one's family (idiom)"],"pinyin":["yang3 jia1 huo2 kou3"],"word":"养家活口"},{"definition":["to support a family\/to raise a family"],"pinyin":["yang3 jia1"],"word":"养家"},{"definition":["to subsist\/to eke out a living\/to keep body and soul together"],"pinyin":["wei2 chi2 sheng1 huo2"],"word":"维持生活"},{"definition":["livelihood"],"pinyin":["sheng1 ji4"],"word":"生计"},{"definition":["to make money"],"pinyin":["zheng4 qian2"],"word":"挣钱"},{"definition":["to seek one's livelihood\/to work to support oneself\/to earn a living"],"pinyin":["mou2 sheng1"],"word":"谋生"},{"definition":["to make a hard living as unskilled laborer"],"pinyin":["mai4 ku3 li4"],"word":"卖苦力"},{"definition":["to provide for\/to keep (animals, a family etc)\/to raise animals\/to feed and clothe\/support\/the necessities of life\/to give birth"],"pinyin":["yang3 huo5"],"word":"养活"},{"definition":["lit. to eat off one's own strength (idiom)\/fig. to stand on one's own feet\/to earn one's own living"],"pinyin":["zi4 shi2 qi2 li4"],"word":"自食其力"},{"definition":["to earn a living","(coll.) job\/work"],"pinyin":["ying2 sheng1","ying2 sheng5"],"word":"营生"},{"definition":["to be industrious, rising early and going to bed late"],"pinyin":["qi3 zao3 tan1 hei1"],"word":"起早贪黑"},{"definition":["to live one's life\/to make a living"],"pinyin":["guo4 huo2"],"word":"过活"},{"definition":["to farm\/to work the land"],"pinyin":["zhong4 di4"],"word":"种地"},{"definition":["to have enough food and warm clothes\/adequately provided"],"pinyin":["wen1 bao3"],"word":"温饱"},{"definition":["family livelihood\/a household's economic situation\/family property"],"pinyin":["jia1 ji4"],"word":"家计"}]}