{"definition":["to annex\/to take over\/to acquire"],"pinyin":["jian1 bing4"],"traditional":["兼併"],"rank":9027.0,"normalized_rank":0.12629944174723326,"fraction":0.000009873488748060507,"cumulative_fraction":0.9209323868151592,"word":"兼并","characters":[{"definition":["double\/twice\/simultaneous\/holding two or more (official) posts at the same time"],"pinyin":["jian1"],"word":"兼"},{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge","to combine\/to amalgamate","variant of 並|并[bing4]"],"pinyin":["bing4","bing4","bing4"],"word":"并"}],"containing_words":[{"definition":["mergers and acquisitions (M&A)"],"pinyin":["jian1 bing4 yu3 shou1 gou4"],"word":"兼并与收购"}],"sentences":[{"english":"Cash-starved companies welcome Chinese investment or acquisition offers.","chinese":"急需资金的公司欢迎中国的投资或兼并提议。"},{"english":"We made progress in enterprise mergers and reorganizations.","chinese":"企业兼并重组取得新进展。"},{"english":"The big company merged various small businesses.","chinese":"那家大公司兼并了多家小商行。"},{"english":"Further progress was made in mergers and reorganization in key industries.","chinese":"重点行业兼并重组取得新进展。"},{"english":"For the first time, it's poised to surpass both Goldman Sachs and Morgan Stanley in the lucrative M&A business.","chinese":"在兼并重组业务方面上它超过了高盛和摩根士丹利。"},{"english":"Acquistions of smaller companies by bigger companies are a fact of the business world.","chinese":"较大公司兼并较小公司是商业界中的事实。"},{"english":"Picture-taking is a technique both for annexing the objective world and for expressing the singular self.","chinese":"照相是一种既兼并客观世界，又表达独特自我的技术。"},{"english":"The small firms were absorbed into large cartels.","chinese":"这些小公司被大企业联盟兼并了。"},{"english":"Some consulting firms also offer computer programs to help mergers succeed.","chinese":"一些谘询公司还提供电脑程式，以帮助兼并成功。"},{"english":"Second, we will encourage mergers and reorganization of enterprises.","chinese":"二是促进企业兼并重组。"},{"english":"This sugar factory is one of the recent acquisitions of the company.","chinese":"这家糖厂是公司最近兼并的厂家之一。"},{"english":"The Galactic Empire inherited the technological achievements of both warring factions of the Clone Wars.","chinese":"银河帝国兼并了克隆人战争交战双方的技术成果。"},{"english":"Land annexation was a persistent ailment of the Ancient China.","chinese":"土地兼并是古代中国的一个顽症。"},{"english":"The development of Chinese enterprises has been entered into the new period of developing by the annex and recombination.","chinese":"中国企业的发展已进入了依靠兼并重组壮大的新时期。"},{"english":"In 2010, the company acquired Holland Darwin Mechanical and Electric Corporation.","chinese":"去年成功兼并了荷兰达尔文机电公司。"},{"english":"Shanxi coal mine massive mergers and acquisitions in real terms in step by step movement.","chinese":"声势浩大的山西煤矿兼并重组运动迈出实质一步。"}],"related":[{"definition":["to annex"],"pinyin":["tun1 bing4"],"word":"吞并"},{"definition":["to unify\/unified"],"pinyin":["yi1 tong3"],"word":"一统"},{"definition":["Vertical and Horizontal Alliance, opposing stratagems devised by the School of Diplomacy 縱橫家|纵横家[Zong4 heng2 jia1] during the Warring States Period (425-221 BC)"],"pinyin":["He2 zong4 Lian2 heng2"],"word":"合纵连横"},{"definition":["to swallow up\/to annex\/to merge"],"pinyin":["bing4 tun1"],"word":"并吞"},{"definition":["to attack\/to raid\/(of medicine) potent"],"pinyin":["gong1 fa2"],"word":"攻伐"},{"definition":["to set up an independent regime\/to secede\/segmentation\/division\/fragmentation"],"pinyin":["ge1 ju4"],"word":"割据"},{"definition":["expansion\/dilation\/to expand (e.g. one's power or influence)\/to broaden"],"pinyin":["kuo4 zhang1"],"word":"扩张"},{"definition":["to incorporate into one's troops\/to weave in"],"pinyin":["shou1 bian1"],"word":"收编"},{"definition":["lit. hunting deer in the Central Plain (idiom)\/fig. to attempt to seize the throne"],"pinyin":["zhu2 lu4 Zhong1 yuan2"],"word":"逐鹿中原"},{"definition":["to contend for supremacy"],"pinyin":["zheng1 xiong2"],"word":"争雄"},{"definition":["to form an alliance\/to ally oneself with\/allied with\/aligned\/to bond with"],"pinyin":["jie2 meng2"],"word":"结盟"},{"definition":["internal strife\/power struggle\/(of members of an organization) to fight each other"],"pinyin":["nei4 dou4"],"word":"内斗"},{"definition":["to go on or send a punitive expedition"],"pinyin":["zheng1 fa2"],"word":"征伐"},{"definition":["internal disorder\/civil strife\/civil unrest"],"pinyin":["nei4 luan4"],"word":"内乱"},{"definition":["to dispute"],"pinyin":["fen1 zheng1"],"word":"纷争"},{"definition":["the task of establishing and maintaining hegemony"],"pinyin":["ba4 ye4"],"word":"霸业"}]}