{"definition":["internal bleeding\/internal hemorrhage"],"pinyin":["nei4 chu1 xue4"],"traditional":["內出血"],"rank":33236.0,"normalized_rank":0.4650147608187707,"fraction":7.066776916386136e-7,"cumulative_fraction":0.9928927979373412,"word":"内出血","characters":[{"definition":["inside\/inner\/internal\/within\/interior"],"pinyin":["nei4"],"word":"内"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["blood\/colloquial pr. [xie3]\/CL:滴[di1],片[pian4]"],"pinyin":["xue4"],"word":"血"}],"containing_words":[],"sentences":[{"english":"Her arms showed green patches, indicating heavy internal bleeding.","chinese":"她的胳膊出现了青斑，表明有严重的内出血。"},{"english":"He died hours later from internal bleeding.","chinese":"他几小时后死于内出血。"},{"english":"Objective To establish an animal model with rabbit for study on monitoring intraperitoneal bleeding.","chinese":"目的为腹腔内出血监护研究建立一种家兔动物模型。"},{"english":"Early identification of the source of occult intraabdominal blood loss may indicate the need for operative control of hemorrhage.","chinese":"早期鉴别腹腔内出血部位可以决定是否需要手术止血。"},{"english":"Objective To summarize the reasons and experiences of misdiagnosis in gynecological patients with intraabdominal hemorrhage.","chinese":"目的总结妇产科腹腔内出血性疾病的误诊经验教训。"},{"english":"Eventually, Corexit also ruptures red blood cells causing internal bleeding.","chinese":"最终地，Corexit亦破裂红血球造成内出血。"},{"english":"For cases with internal hemorrhage, Laparotomy is the best choice.","chinese":"发生腹腔内出血的病例以行开腹手术为宜。"},{"english":"Bilateral simultaneous hypertensive intracerebral hemorrhages (HICH) are a rare occurrence.","chinese":"两侧性同时发生高血压脑内出血甚为罕见。"},{"english":"Necropsies revealed internal hemorrhaging, with no sign of pesticides.","chinese":"尸检表明有内出血，但没有杀虫剂的迹象。"},{"english":"Objective To study the diagnostic and therapeutic features of traumatic intraventricular hemorrhage (TIVH).","chinese":"目的分析总结外伤性脑室内出血的诊断和治疗特点。"},{"english":"Objective To investigate the influence of hemorrhage extension on the prognosis in patients with brain parenchymal hemorrhage.","chinese":"目的探讨脑实质内出血时，血液走向与预后的关系。"},{"english":"To date, carotid bruits have mostly been associated with bleeding events in the brain.","chinese":"到目前为止，颈动脉杂音大多被和脑内出血联系起来。"},{"english":"Yet nothing is being done to stem the haemorrhaging.","chinese":"然而，并没有任何的措施阻止这种内出血。"},{"english":"Based on the impression of internal bleeding, an emergent laparotomy was performed after fluid resuscitation.","chinese":"经过检查后，病童在腹内出血的诊断下接受紧急手术。"},{"english":"To summarize and investigate the main point of clinical observation and nursing of intraventricular hemorrhage (IVH) in premature infants.","chinese":"为探讨早产儿脑室内出血的观察与护理要点。"},{"english":"Objective To investigate the efficacy of the intraventricular hemorrhage treated by continuous drainage in the terminal cistern of spinal canal.","chinese":"目的探讨持续腰大池外引流治疗脑室内出血的疗效。"}],"related":[{"definition":["to bleed\/bleeding\/(fig.) to spend money in large amounts"],"pinyin":["chu1 xue4"],"word":"出血"},{"definition":["hematoma\/swelling of soft tissue due to internal hemorrhage"],"pinyin":["xue4 zhong3"],"word":"血肿"},{"definition":["variant of 瘀血[yu1 xue4]"],"pinyin":["yu1 xue4"],"word":"淤血"},{"definition":["shock (loanword)\/to go into shock"],"pinyin":["xiu1 ke4"],"word":"休克"},{"definition":["injury\/wound\/trauma"],"pinyin":["wai4 shang1"],"word":"外伤"},{"definition":["necrosis"],"pinyin":["huai4 si3"],"word":"坏死"},{"definition":["blood clot"],"pinyin":["xue4 kuai4"],"word":"血块"},{"definition":["septicaemia"],"pinyin":["bai4 xue4 zheng4"],"word":"败血症"},{"definition":["to suffer a fracture\/(of a bone) to break\/fracture"],"pinyin":["gu3 zhe2"],"word":"骨折"},{"definition":["cerebral hemorrhage\/stroke"],"pinyin":["nao3 yi4 xue4"],"word":"脑溢血"},{"definition":["cerebral hemorrhage"],"pinyin":["nao3 chu1 xue4"],"word":"脑出血"},{"definition":["clotted blood\/extravasated blood (leaking into surrounding tissue)\/thrombosis"],"pinyin":["yu1 xue4"],"word":"瘀血"},{"definition":["abscess"],"pinyin":["nong2 zhong3"],"word":"脓肿"},{"definition":["pneumothorax (medicine)"],"pinyin":["qi4 xiong1"],"word":"气胸"},{"definition":["to fester\/to suppurate\/to be infected"],"pinyin":["hua4 nong2"],"word":"化脓"},{"definition":["having blood in one's stool"],"pinyin":["bian4 xie3"],"word":"便血"}]}