{"definition":["to hear a case again\/review\/retrial"],"pinyin":["zai4 shen3"],"traditional":["再審"],"rank":17989.0,"normalized_rank":0.2516894491626209,"fraction":0.0000029402813602530377,"cumulative_fraction":0.9694898715031504,"word":"再审","characters":[{"definition":["again\/once more\/re-\/second\/another\/then (after sth, and not until then)\/no matter how ... (followed by an adjective or verb, and then (usually) 也[ye3] or 都[dou1] for emphasis)"],"pinyin":["zai4"],"word":"再"},{"definition":["to examine\/to investigate\/carefully\/to try (in court)"],"pinyin":["shen3"],"word":"审"}],"containing_words":[],"sentences":[{"english":"The state might not mind trying this again and asking for the death penalty, the judge said.","chinese":"国家可能不介意再审他一次，判他死刑，法官说。"},{"english":"Especially its conflict with the re-trial system becomes more obvious.","chinese":"其中我国的再审制度与之冲突更为明显。"},{"english":"The people's court shall form a new collegial panel for the purpose of the retrial.","chinese":"人民法院审理再审案件，应当另行组成合议庭。"},{"english":"The people's court shall conduct a trial denovo of a case protested by the people's procuratorate.","chinese":"人民检察院提出抗诉的案件，人民法院应当再审。"},{"english":"To reinstitute the death penalty review (to the high court) does not mean we will abolish capital punishment.","chinese":"重新设立死刑再审并不意味着我们将废除死罪的处罚。"},{"english":"The third part is to review the foreign criminal rehear process comparatively.","chinese":"第三部分为刑事再审程序提起的比较法考察。"},{"english":"Chapter Two---The Comparative Study (Comparative Law) of the the Third Party's Applying for Retrial.","chinese":"第二章案外人申请再审之比较法研究。"},{"english":"After a three-hour hearing, the trial was adjourned to Oct 1.","chinese":"庭审持续三小时，并延期至10月1日再审。"},{"english":"The people's court shall, upon examination and verification, re-adjudicate the case.","chinese":"经人民法院审查属实的，应当再审。"},{"english":"This article plans to unify the re-trying practice, the following question makes the rational ponder.","chinese":"本文拟结合再审实践，就如下问题作些理性思考。"},{"english":"Among them, the one that is worth reviewing and making criticism is the review system of our country.","chinese":"其中，最值得反思与检讨的是我国的再审制度。"},{"english":"The rehearing system causes judge to be undecidedly and descends the judicial authority.","chinese":"再审制度导致裁判的不确定和司法权威的下降。"},{"english":"Qiju is a kind of re-appeal procedural system in Qin and Han Dynasties.","chinese":"乞鞫是秦汉时期的一种再审诉讼制度。"}],"related":[{"definition":["first instance (law)"],"pinyin":["yi1 shen3"],"word":"一审"},{"definition":["to protest against a verdict\/to lodge an appeal"],"pinyin":["kang4 su4"],"word":"抗诉"},{"definition":["judgment (by a court of law)\/to pass judgment on\/to sentence"],"pinyin":["pan4 jue2"],"word":"判决"},{"definition":["to affirm the original sentence (law)"],"pinyin":["wei2 chi2 yuan2 pan4"],"word":"维持原判"},{"definition":["to re-investigate\/to investigate and reconsider a judgment"],"pinyin":["chong2 shen3"],"word":"重审"},{"definition":["to appeal (a judicial case)\/appeal"],"pinyin":["shang4 su4"],"word":"上诉"},{"definition":["ruling"],"pinyin":["cai2 ding4"],"word":"裁定"},{"definition":["to hear (a case)"],"pinyin":["shen3 li3"],"word":"审理"},{"definition":["to amend a judgment\/to overrule the original decision\/to commute (a sentence)"],"pinyin":["gai3 pan4"],"word":"改判"},{"definition":["to commit sb for trial\/to bring sb for interrogation"],"pinyin":["ti2 shen3"],"word":"提审"},{"definition":["to reject\/to turn down\/to overrule"],"pinyin":["bo2 hui2"],"word":"驳回"},{"definition":["court of law\/court"],"pinyin":["fa3 yuan4"],"word":"法院"},{"definition":["to register (to an official organism)\/to file a case (for investigation)"],"pinyin":["li4 an4"],"word":"立案"},{"definition":["people's court (of law)\/people's tribunal"],"pinyin":["ren2 min2 fa3 yuan4"],"word":"人民法院"},{"definition":["(law) collegiate bench\/panel of judges"],"pinyin":["he2 yi4 ting2"],"word":"合议庭"},{"definition":["to drop a lawsuit"],"pinyin":["che4 su4"],"word":"撤诉"}]}