{"definition":["to recreate\/to reconstruct (a historical relic)"],"pinyin":["zai4 xian4"],"traditional":["再現"],"rank":7369.0,"normalized_rank":0.10310187063646413,"fraction":0.000013620150519098855,"cumulative_fraction":0.9017409715552588,"word":"再现","characters":[{"definition":["again\/once more\/re-\/second\/another\/then (after sth, and not until then)\/no matter how ... (followed by an adjective or verb, and then (usually) 也[ye3] or 都[dou1] for emphasis)"],"pinyin":["zai4"],"word":"再"},{"definition":["to appear\/present\/now\/existing\/current"],"pinyin":["xian4"],"word":"现"}],"containing_words":[],"sentences":[{"english":"With special renovation, Beijing will again take on the scene it once had, complete with its historical rivers and classical gardens.","chinese":"通过专项整治，再现京城水系和古典园林的历史风貌。"},{"english":"And you've confirmed once again the fundamental decency and generosity of the American people,” Obama said.","chinese":"你们再现了美国人民最本质的礼尚和慷慨。"},{"english":"Adding to Chinese unease is the reappearance of Russia on the scene.","chinese":"俄罗斯的再现也令中国不安。"},{"english":"Huangpu River permanent fountain depicts a group of moving stories of this period.","chinese":"黄浦江边一组永久性喷泉再现了这段动人的佳话。"},{"english":"MOTOMAN-UP6 robot is a traditional playback robot.","chinese":"UP6型机器人为传统的示教再现机器人。"},{"english":"What tendency will be shown in the reproduction of medical disputes?","chinese":"在再现医疗纠纷的过程中将表现出怎样的媒介倾向。"},{"english":"All sorts of article and multiform emersion \" contracted reservation \" .","chinese":"各种物品和各种形式都再现“简约含蓄”。"},{"english":"This great battle was vividly recorded in the documentary film.","chinese":"这部记录片生动地再现了这场伟大的战役。"},{"english":"I have found them hardy, and hopefully they will reappear this summer.","chinese":"我发现它们抗逆性强，今年夏天也有望再现。"},{"english":"The results demonstrated the main observed characteristics of the loop-like coronal mass ejection.","chinese":"模拟结果再现了环状日冕物质抛射的主要观测特征。"},{"english":"The theory and experiment in di cates the measure can reduce playback error efficiently.","chinese":"理论和实验表明，该措施能有效地减少再现误差。"},{"english":"Is gauge Repeatability and Reproducabilty less than 10%?","chinese":"所有量检具的重复性和再现性是否小于10%？"},{"english":"In aesthetic representation of beauty in sound, rhythm and onomatopoetic are further discussed.","chinese":"音美再现中主要讨论了节奏和拟声的再现。"},{"english":"In aesthetic representation of beauty in sound, rhythm and onomatopoetic are further discussed.","chinese":"音美再现中主要讨论了节奏和拟声的再现。"},{"english":"New ball physics accurately recreate bouncing, skidding and topspin.","chinese":"球的新的物理性能精准地再现球的反弹，滑动和上旋。"},{"english":"Autostereoscopic display technology can redisplay the lost depth information.","chinese":"自由立体显示技术可以再现丢失的深度信息。"}],"related":[{"definition":["to reappear"],"pinyin":["chong2 xian4"],"word":"重现"},{"definition":["to restore to the original state\/to reconstruct (an event)\/reduction (chemistry)"],"pinyin":["huan2 yuan2"],"word":"还原"},{"definition":["to appear\/to emerge\/to present (a certain appearance)\/to demonstrate"],"pinyin":["cheng2 xian4"],"word":"呈现"},{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"word":"展现"},{"definition":["(of a story etc) to unfold\/to play out\/to develop (a technique etc)\/to enact\/(logic) to deduce\/to infer"],"pinyin":["yan3 yi4"],"word":"演绎"},{"definition":["to continue\/to go on\/to last"],"pinyin":["yan2 xu4"],"word":"延续"},{"definition":["to screen (a movie)\/to stage (a play)\/a screening\/a staging"],"pinyin":["shang4 yan3"],"word":"上演"},{"definition":["to return"],"pinyin":["chong2 hui2"],"word":"重回"},{"definition":["once more\/once again\/one more time"],"pinyin":["zai4 du4"],"word":"再度"},{"definition":["to reappear\/to persist (in memory)"],"pinyin":["fu4 xian4"],"word":"复现"},{"definition":["to describe\/to portray"],"pinyin":["miao2 hui4"],"word":"描绘"},{"definition":["to pick up (a theme etc)\/to regain (confidence)\/to revive (a custom, friendship etc)"],"pinyin":["chong2 shi2"],"word":"重拾"},{"definition":["to reveal\/to display\/to show\/to exhibit sth"],"pinyin":["zhan3 shi4"],"word":"展示"},{"definition":["to reconstruct (an art object)\/to remodel"],"pinyin":["chong2 su4"],"word":"重塑"},{"definition":["style\/manner\/ethos"],"pinyin":["feng1 mao4"],"word":"风貌"},{"definition":["legend\/fairy tale\/myth\/mythology"],"pinyin":["shen2 hua4"],"word":"神话"}]}