{"definition":["realism\/realistic portrayal\/realistic\/true to life"],"pinyin":["xie3 shi2"],"traditional":["寫實"],"rank":20013.0,"normalized_rank":0.2800078351265513,"fraction":0.0000023897997293566917,"cumulative_fraction":0.9748691342069836,"word":"写实","characters":[{"definition":["to write"],"pinyin":["xie3"],"word":"写"},{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"实"}],"containing_words":[{"definition":["nonrepresentational"],"pinyin":["fei1 xie3 shi2"],"word":"非写实"}],"sentences":[{"english":"Such realism is useful in the development of automated CCTV systems.","chinese":"这么写实的程度，对研发自动闭路电视系统很有益处。"},{"english":"On image, CCP emphasizes abstractness while English verse tries to depict the real world.","chinese":"从意象上讲，汉诗强调抽象而英诗注重写实。"},{"english":"A nonrepresentational style that emphasizes formal values over the representation of subject matter.","chinese":"强调形式至上，无视内容的一种非写实主义绘画作风。"},{"english":"This method of \"Realist Abstraction\", was named by Tan Tian as \"Macro-Far\".","chinese":"这种写实抽象的方法，谭天称其为“宏远”。"},{"english":"The art of chromatic stone carving belongs to the domain of realistic creation. Thus it demands great effort.","chinese":"彩石雕刻艺术属于写实创作范畴，所以很吃功力。"},{"english":"The realistic character of modern Chinese was highly strengthened in this process.","chinese":"在这一过程中，现代汉语的写实性得到加强。"},{"english":"The movie line is a full line. The line for the movie will be broad and have multiple scales.","chinese":"写实电影线将是一条全方位线，有多种规格的玩具。"},{"english":"The added lens-flare is a detail that also adds to the realism.","chinese":"它所添加的光晕特效也是一个增添了写实主义的细节。"},{"english":"Advocating truthfulness and realism in writing is the overall characteristic of Zhang Dai's literary works.","chinese":"尚真写实是张岱文学创作的总体特征。"},{"english":"TV is a realistic lens art reproduction of real life, with verisimilitude .","chinese":"电视是写实的镜头艺术，再现生活真实，具有逼真性。"},{"english":"Through his realistic paintings Boldis creates a vivid embodiment of classics in modern times.","chinese":"巴尔蒂斯的写实油画，集中体现了一种现代的古典性。"},{"english":"It is the most specialized element of language to display to those realism.","chinese":"它也是写实主义绘画最善于表现的语言要素。"},{"english":"It was a kind of procedure through self-satisfaction using the ploy of true-life .","chinese":"而是以一种写实的手法获得自我满足的过程。"},{"english":"The color change will give the photo a surreal and mysterious look.","chinese":"色调的更换将给予照片一种神秘超写实的视感。"},{"english":"A change from surrealistic legends to realistic works.","chinese":"由超现实的传奇故事向写实性的“天然图画”发展。"},{"english":"Chapter III discusses the affection of New Realism Literature on Film.","chinese":"第三章探讨了新写实文学思潮对电影的影响。"}],"related":[{"definition":["realism"],"pinyin":["xian4 shi2 zhu3 yi4"],"word":"现实主义"},{"definition":["line drawing in traditional ink and brush style\/simple and straightforward style of writing"],"pinyin":["bai2 miao2"],"word":"白描"},{"definition":["narrative"],"pinyin":["xu4 shi4"],"word":"叙事"},{"definition":["tangible image\/concrete\/representational (art)"],"pinyin":["ju4 xiang4"],"word":"具象"},{"definition":["to suggest (rather than depict in detail)\/freehand style of Chinese painting, characterized by bold strokes rather than accurate details","comfortable\/enjoyable\/relaxed"],"pinyin":["xie3 yi4","xie4 yi4"],"word":"写意"},{"definition":["romanticism"],"pinyin":["lang4 man4 zhu3 yi4"],"word":"浪漫主义"},{"definition":["brush stroke in Chinese painting and calligraphy\/brushwork\/style of drawing or writing"],"pinyin":["bi3 chu4"],"word":"笔触"},{"definition":["surrealism"],"pinyin":["chao1 xian4 shi2 zhu3 yi4"],"word":"超现实主义"},{"definition":["vivid\/lifelike"],"pinyin":["chuan2 shen2"],"word":"传神"},{"definition":["gongbi, traditional Chinese painting method characterized by meticulous brush technique and detailed description"],"pinyin":["gong1 bi3"],"word":"工笔"},{"definition":["abstract\/abstraction\/CL:種|种[zhong3]"],"pinyin":["chou1 xiang4"],"word":"抽象"},{"definition":["technique of writing\/calligraphy\/or drawing"],"pinyin":["bi3 fa3"],"word":"笔法"},{"definition":["to trace over\/to take a copy (of a calligraphy, a painting etc)\/(fig.) to describe\/to portray"],"pinyin":["miao2 mo2"],"word":"描摹"},{"definition":["symbolism"],"pinyin":["xiang4 zheng1 zhu3 yi4"],"word":"象征主义"},{"definition":["to describe\/to depict\/to portray\/description"],"pinyin":["miao2 xie3"],"word":"描写"},{"definition":["a parody\/to parody"],"pinyin":["xi4 fang3"],"word":"戏仿"}]}