{"definition":["Ministry of Agriculture\/Department of Agriculture"],"pinyin":["Nong2 ye4 bu4"],"traditional":["農業部"],"rank":5663.0,"normalized_rank":0.07923271724987058,"fraction":0.000020041268391874667,"cumulative_fraction":0.8734949455406557,"word":"农业部","characters":[{"definition":["variant of 農|农[nong2]","peasant\/to farm\/agriculture\/diligent (old)\/government field official (old)","surname Nong"],"pinyin":["nong2","nong2","Nong2"],"word":"农"},{"definition":["surname Ye","line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already"],"pinyin":["Ye4","ye4"],"word":"业"},{"definition":["ministry\/department\/section\/part\/division\/troops\/board\/classifier for works of literature, films, machines etc"],"pinyin":["bu4"],"word":"部"}],"containing_words":[],"sentences":[{"english":"Look for the green seal that says USDA Organic.","chinese":"寻找标有“美国农业部有机”的绿色图章。"},{"english":"A changing climate is adding pressure to the already-stressed agricultural sector.","chinese":"气候变化正在增加农业部门已经承受的压力。"},{"english":"The opening ceremony was moderated by Du Qinglin, Minister of Agriculture.","chinese":"开幕式由农业部部长杜青林主持。"},{"english":"USDA agency ruled on the most popular variety of Roundup Ready sugar beets.","chinese":"美国农业部相关部门对最常见的抗农达甜菜做出裁决。"},{"english":"Buy only pasteurized egg products that bear the USDA inspection mark.","chinese":"只买农业部检查标记过的巴氏杀菌蛋。"},{"english":"Development and manufacture of products for military-industrial complex and agricultural sector.","chinese":"军工业和农业部门产品的开发和制造。"},{"english":"China's ministries of commerce and agriculture have moved to stabilize the vegetable market after hearing the report.","chinese":"其后，中国农业部和商业部紧急部署稳定蔬菜市场。"},{"english":"China's Minister of Agriculture Du Qinglin confirmed the extension.","chinese":"中国农业部长杜青林确认了延期一事。"},{"english":"Ministries of Agriculture have not generally participated in formal climate change discussions.","chinese":"农业部门没有普遍的参与到气候变化的讨论中来。"},{"english":"Mr. Weirich, the agriculture secretary, said he was skeptical about that.","chinese":"农业部长维里奇先生说，他怀疑这一点。"},{"english":"Agriculture officials say four million rice farmers have registered for the new scheme.","chinese":"泰国农业部官员说，有400万稻农加入这项新方案。"},{"english":"The USDA also protects natural resources and promotes food safety.","chinese":"美国农业部还保护天然资源并提倡食品安全。"},{"english":"He said it was the company'sdecision to give them up and stop research. The USDA inspected the site this week and has started a formal investigation.","chinese":"美国农业部本周视察了现场，并已开始正式调查。"},{"english":"In the early 1900s, the U.S. Department of Agriculture faced a challenge.","chinese":"世纪初，美国农业部面临一项挑战。"},{"english":"However, Agriculture Minister Aigner comment on this topic in reservations.","chinese":"不过，农业部长艾格纳在置评这一议题时持保留态度。"},{"english":"Scientists from the University of Illinois and the United States Department of Agriculture did the study.","chinese":"利诺伊大学和美国农业部的科学家们对此进行了研究。"}],"related":[{"definition":["AQSIQ\/PRC State Administration of Quality Supervision, Inspection and Quarantine"],"pinyin":["Guo2 jia1 Zhi4 liang4 Jian1 du1 Jian3 yan4 Jian3 yi4 Zong3 ju2"],"word":"国家质量监督检验检疫总局"},{"definition":["Ministry of Water Resources (PRC)"],"pinyin":["Shui3 li4 bu4"],"word":"水利部"},{"definition":["Ministry of Land and Resources (MLR), formed in 1998"],"pinyin":["Guo2 tu3 Zi1 yuan2 bu4"],"word":"国土资源部"},{"definition":["(provincial) department of agriculture"],"pinyin":["nong2 ye4 ting1"],"word":"农业厅"},{"definition":["Food and Agriculture Organization of the United Nations (FAO)"],"pinyin":["Lian2 he2 guo2 Liang2 nong2 Zu3 zhi1"],"word":"联合国粮农组织"},{"definition":["Department of Trade\/Department of Commerce"],"pinyin":["Shang1 wu4 bu4"],"word":"商务部"},{"definition":["(PRC) Ministry of Environmental Protection (MEP)"],"pinyin":["Huan2 jing4 Bao3 hu4 bu4"],"word":"环境保护部"},{"definition":["State Oceanic Administration (PRC)"],"pinyin":["Guo2 jia1 Hai3 yang2 ju2"],"word":"国家海洋局"},{"definition":["Standardization Administration of PRC (SAC)"],"pinyin":["Guo2 jia1 Biao1 zhun3 hua4 Guan3 li3 Wei3 yuan2 hui4"],"word":"国家标准化管理委员会"},{"definition":["PRC National Development and Reform Commission"],"pinyin":["Guo2 jia1 Fa1 zhan3 Gai3 ge2 Wei3"],"word":"国家发展改革委"},{"definition":["(PRC) State Environmental Protection Administration (SEPA), former incarnation (until 2008) of 環境保護部|环境保护部[Huan2 jing4 Bao3 hu4 bu4]"],"pinyin":["Guo2 jia1 Huan2 bao3 Zong3 ju2"],"word":"国家环保总局"},{"definition":["domesticated animal products"],"pinyin":["xu4 chan3 pin3"],"word":"畜产品"},{"definition":["Ministry of Housing and Urban-Rural Development of the PRC (MOHURD)\/abbr. to 住建部[Zhu4 Jian4 bu4]"],"pinyin":["Zhu4 fang2 he2 Cheng2 xiang1 Jian4 she4 bu4"],"word":"住房和城乡建设部"},{"definition":["PRC National Development and Reform Commission (NDRC), formed in 2003"],"pinyin":["Guo2 jia1 Fa1 zhan3 he2 Gai3 ge2 Wei3 yuan2 hui4"],"word":"国家发展和改革委员会"},{"definition":["State Council (PRC)\/State Department (USA)"],"pinyin":["Guo2 wu4 yuan4"],"word":"国务院"},{"definition":["animal husbandry\/stock raising\/livestock raising"],"pinyin":["xu4 mu4 ye4"],"word":"畜牧业"}]}