{"definition":["to sprint\/to spurt\/to dash\/big effort"],"pinyin":["chong1 ci4"],"traditional":["衝刺"],"rank":8778.0,"normalized_rank":0.12281560869139395,"fraction":0.000010313319337795508,"cumulative_fraction":0.9184185551514522,"word":"冲刺","characters":[{"definition":["powerful\/vigorous\/pungent\/towards\/in view of","thoroughfare\/to go straight ahead\/to rush\/to clash","(of water) to dash against\/to mix with water\/to infuse\/to rinse\/to flush\/to develop (a film)\/to rise in the air\/to clash\/to collide with"],"pinyin":["chong4","chong1","chong1"],"word":"冲"},{"definition":["(onom.) whoosh","thorn\/sting\/thrust\/to prick\/to pierce\/to stab\/to assassinate\/to murder"],"pinyin":["ci1","ci4"],"word":"刺"}],"containing_words":[],"sentences":[{"english":"Stop, breathe for a sec, then sprint again.","chinese":"停下来，呼吸几秒，然后再冲刺。"},{"english":"The runner kept some energy in store for spurting at the end.","chinese":"那名赛跑的人为最后的冲刺贮存精力。"},{"english":"We sought to parry the charateristic soviet lunge with fancy footwork.","chinese":"我们以花式步法力图避开典型的苏联冲刺。"},{"english":"Lynx have longer legs and much broader paws. This helps them charge around in snow.","chinese":"山猫腿较长，脚掌较宽，协助它们在雪地中冲刺。"},{"english":"The peak phase is characterized by short, fast workouts that simulate racing.","chinese":"冲刺阶段的特征是短而快的训练，这是为了模拟比赛。"},{"english":"Collecting my energy for one last push, I was eating a chocolate bar when along pedalled two 15-year-olds.","chinese":"为了积蓄能量做最后冲刺，我吃了一块巧克力。"},{"english":"This list of tasks becomes the Sprint Backlog.","chinese":"任务的列表就成了所谓的代办冲刺。"},{"english":"The runner seemed to be rallying for a final sprint.","chinese":"赛跑者似乎在振作精神作最后冲刺。"},{"english":"The two knights tilted at each other on horseback.","chinese":"两个骑士骑马持长矛互相冲刺。"},{"english":"The odor of disinfectant stung my nostrils as I moved down the row of pens.","chinese":"下楼梯时消毒水的味道冲刺着我的鼻孔。"},{"english":"Try it: go outside and sprint all-out for two minutes.","chinese":"试试吧，走到外面，竭尽全力地冲刺两分钟。"},{"english":"He sprinted past the other runners just before reaching the tape.","chinese":"他在到达终点之前全速冲刺，超越了其他赛跑者。"},{"english":"Sprints shall be run according to the rules governing sprint races.","chinese":"运动员的冲刺，以争先赛的有关规则为准。"},{"english":"I got the book-writing done by breaking it down into hour-long sprints.","chinese":"而这本书的完成我是以每小时为单位做写作冲刺的。"},{"english":"The product owner and team agree on a goal for the sprint.","chinese":"产品所有者和团队会就冲刺阶段的目标达成一致意见。"},{"english":"Hurdling is something that involves my whole body being stretched and contorted in quick bursts.","chinese":"跨栏赛跑需要在快速的冲刺中拉伸和扭曲整个身体。"}],"related":[{"definition":["sudden and violent attack\/assault\/fig. rushed job\/concentrated effort to finish a job quickly"],"pinyin":["tu1 ji1"],"word":"突击"},{"definition":["to go at full throttle\/(fig.) to go all out\/to kick into high gear"],"pinyin":["jia1 zu2 ma3 li4"],"word":"加足马力"},{"definition":["to run"],"pinyin":["ben1 pao3"],"word":"奔跑"},{"definition":["to increase the specified cruising speed\/to pick up speed\/to speed up"],"pinyin":["ti2 su4"],"word":"提速"},{"definition":["to wait for action after having accumulated power, energy etc"],"pinyin":["xu4 shi4 dai4 fa1"],"word":"蓄势待发"},{"definition":["to run up (pole vault, javelin, bowling etc)\/approach\/run-up\/(aviation) takeoff run"],"pinyin":["zhu4 pao3"],"word":"助跑"},{"definition":["to start running\/the start of a race"],"pinyin":["qi3 pao3"],"word":"起跑"},{"definition":["to charge forward"],"pinyin":["meng3 chong1"],"word":"猛冲"},{"definition":["to press on towards\/to close in on\/to approach\/to draw near"],"pinyin":["bi1 jin4"],"word":"逼近"},{"definition":["target\/goal\/objective\/CL:個|个[ge4]"],"pinyin":["mu4 biao1"],"word":"目标"},{"definition":["to go forward\/to forge ahead\/to advance\/onward"],"pinyin":["qian2 jin4"],"word":"前进"},{"definition":["to assault a fortified position\/(fig.) to concentrate one's efforts on a particularly difficult part of one's mission"],"pinyin":["gong1 jian1"],"word":"攻坚"},{"definition":["to advance courageously (idiom)\/to press forward"],"pinyin":["yi1 wang3 wu2 qian2"],"word":"一往无前"},{"definition":["to dash (run fast)\/to rush\/to dart"],"pinyin":["fei1 ben1"],"word":"飞奔"},{"definition":["in a spurt of energy"],"pinyin":["yi1 gu3 zuo4 qi4"],"word":"一鼓作气"},{"definition":["forward\/onward"],"pinyin":["xiang4 qian2"],"word":"向前"}]}