{"definition":["to charge into"],"pinyin":["chong1 xiang4"],"traditional":["衝嚮"],"rank":12877.0,"normalized_rank":0.1801659367873183,"fraction":0.000005435622913830906,"cumulative_fraction":0.9489796301320258,"word":"冲向","characters":[{"definition":["powerful\/vigorous\/pungent\/towards\/in view of","thoroughfare\/to go straight ahead\/to rush\/to clash","(of water) to dash against\/to mix with water\/to infuse\/to rinse\/to flush\/to develop (a film)\/to rise in the air\/to clash\/to collide with"],"pinyin":["chong4","chong1","chong1"],"word":"冲"},{"definition":["surname Xiang","towards\/to face\/to turn towards\/direction\/to support\/to side with\/shortly before\/formerly\/always\/all along\/(suffix) suitable for ...\/oriented to ...","to tend toward\/to guide\/variant of 向[xiang4]","variant of 向[xiang4]\/direction\/orientation\/to face\/to turn toward\/to\/towards\/shortly before\/formerly"],"pinyin":["Xiang4","xiang4","xiang4","xiang4"],"word":"向"}],"containing_words":[],"sentences":[{"english":"Burnside had thrown his army against Lee's defensive positions six times.","chinese":"伯恩赛德已经让自己的部队六次冲向李的防御阵地了。"},{"english":"The star half-back jetted toward the goal line .","chinese":"那个球星中锋冲向球门线。"},{"english":"As the rocket sped toward Mulan and Shan-Yu, Mulan pinned Shan-Yu to the roof with his sword.","chinese":"火箭冲向屋顶上的木兰和单与，木兰正用剑指着单于。"},{"english":"I rushed for the door and fell over the cat in the hallway.","chinese":"我冲向门口，在过道踢到一只猫而摔了一跤。"},{"english":"A newly-discovered comet is plunging toward the sun and probably will not survive.","chinese":"一个新发现的彗星正在冲向太阳而且极可能不会幸存。"},{"english":"After that he rushed at the poor little lamb and ate it up.","chinese":"说完，他就冲向小山羊，把他吃掉了。"},{"english":"The river came roaring toward Long Ju's army.","chinese":"河水怒吼着冲向龙且的军队。"},{"english":"At this period, Ying white of the light pillar damage to cost a lumber moncler jackets rush by horizon.","chinese":"就在这时，莹白的光柱突破花林，冲向天际。"},{"english":"Edgar sprang to his unbidden guest, blanched with astonishment and rage.","chinese":"埃德加冲向这位不速之客，脸色因惊愕与愤怒而发白。"},{"english":"Springing into the table with alacrity, he drew his sword and swung it upon skipper Jackson.","chinese":"他敏捷的冲向桌子，拔出佩剑向杰克森船长挥去。"},{"english":"The procession came to a halt and security rushed to the trouble spot.","chinese":"行进队伍停下来，保安人员冲向了事发地点。"},{"english":"Airline executives should rush to the Haunted Mansion in the Magic Kingdom.","chinese":"航空公司的经理们应该直接冲向魔幻世界的鬼屋。"},{"english":"Hit the road in this sporty green street machine with opening doors.","chinese":"打开车门，让此款花俏的绿色道路机器冲向道路中。"},{"english":"The tsunami drew a line of white fury across the ocean, heading toward the shoreline.","chinese":"海啸画一条白线，狂怒地跨越海洋，冲向海岸线。"},{"english":"Some of these comets would have slammed into Earth, causing catastrophic results to life.","chinese":"其中一些彗星会冲向地球，给生物带来灾难性的后果。"},{"english":"We quickly picked up our javelins and spears and we ran at theJebusites.","chinese":"接着，我们迅速捡起标枪与鱼叉，冲向更多的敌人。"}],"related":[{"definition":["to rush out"],"pinyin":["chong1 chu1"],"word":"冲出"},{"definition":["to rush in\/to charge in"],"pinyin":["chong1 jin4"],"word":"冲进"},{"definition":["to rush into\/to break into"],"pinyin":["chong1 ru4"],"word":"冲入"},{"definition":["to charge\/to pounce on\/to swoop down on"],"pinyin":["meng3 pu1"],"word":"猛扑"},{"definition":["to charge forward"],"pinyin":["meng3 chong1"],"word":"猛冲"},{"definition":["to dash (run fast)\/to rush\/to dart"],"pinyin":["fei1 ben1"],"word":"飞奔"},{"definition":["to wave sth\/to brandish"],"pinyin":["hui1 dong4"],"word":"挥动"},{"definition":["to brandish\/to wave sth"],"pinyin":["hui1 wu3"],"word":"挥舞"},{"definition":["to turn around"],"pinyin":["diao4 zhuan3"],"word":"掉转"},{"definition":["to jump up suddenly\/to bound up\/to rise up in one bound"],"pinyin":["yi1 yue4 er2 qi3"],"word":"一跃而起"},{"definition":["to fly out"],"pinyin":["fei1 chu1"],"word":"飞出"},{"definition":["to reassign sb to a different job\/to turn around\/to change direction\/to make a U turn"],"pinyin":["diao4 zhuan3"],"word":"调转"},{"definition":["aggressive\/truculent\/overbearing"],"pinyin":["qi4 shi4 xiong1 xiong1"],"word":"气势汹汹"},{"definition":["to leap\/to spring\/to throw oneself"],"pinyin":["zong4 shen1"],"word":"纵身"},{"definition":["to go straight to\/to make a beeline for"],"pinyin":["zhi2 ben4"],"word":"直奔"},{"definition":["to speed along"],"pinyin":["ji2 chi2"],"word":"疾驰"}]}