{"definition":["determinism"],"pinyin":["jue2 ding4 lun4"],"traditional":["決定論"],"rank":43689.0,"normalized_rank":0.6112657926769549,"fraction":2.7108045308260797e-7,"cumulative_fraction":0.9976860451363458,"word":"决定论","characters":[{"definition":["to decide\/to determine\/to execute (sb)\/(of a dam etc) to breach or burst\/definitely\/certainly"],"pinyin":["jue2"],"word":"决"},{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"论"}],"containing_words":[],"sentences":[{"english":"Finally, it confuses the ambit of historical determinism and historical non-determinism.","chinese":"其四，混淆机械决定论和辩证决定论的局限。"},{"english":"Finally, it confuses the ambit of historical determinism and historical non-determinism.","chinese":"其四，混淆机械决定论和辩证决定论的局限。"},{"english":"The author attempts to avoid technology determinism starting off from the media.","chinese":"在研究中力避单纯从媒介出发的技术决定论。"},{"english":"Popper's Historical Non-determinism is formed and reflected in the process of critiizing Maxist Historical Determinism and once evoked great repercussion in Western society.","chinese":"波普尔的历史非决定论曾在西方社会产生过很大影响。"},{"english":"Fried, too, finds it impossible to keep determinism at the top of his mind.","chinese":"弗莱德也发现在他心灵的最上层无法坚持决定论。"},{"english":"That may sound like a clear-cut piece of biological determinism.","chinese":"乍一听，这似乎是‘生物决定论’的典型例证。"},{"english":"The conclusion was that co-decision theory is more reasonable and it is similar to the theory of demand and supply.","chinese":"结论是，共同决定论更合理，与供求论有相似之处。"},{"english":"The argument of antithesis tries to falsify the possibility of freedom and therefore to ground the determinism of nature causality.","chinese":"反命题则否证一切自由之可能而奠定决定论。"},{"english":"The technological determinist, however, is the opposite of dialectical reasoning.","chinese":"这与技术决定论的非辩证思维是根本对立的。"},{"english":"The technological determinist, however, is the opposite of dialectical$…","chinese":"这与技术决定论的非辩证思维是根本对立的。"},{"english":"Therefore, shaping about innovation psychology should not preponderate over the principle with practice determining theory.","chinese":"所以，创新心理的形成不能超过实践决定论这一原则。"},{"english":"In fact, determinism is required for self-control.","chinese":"事实上，自我控制需要决定论。"},{"english":"This paper puts forward to a new explanation of natural historical process determinism to unemployment in China.","chinese":"提出我国失业的自然历史过程决定论新解。"},{"english":"And some real biological determinism comes in here.","chinese":"一些生理决定论也源自于这儿。"},{"english":"In this paper, non-determinism which is opposite to determinism concept is defined clearly.","chinese":"本文对非决定论概念也作了明确的界定。"}],"related":[{"definition":["scientism"],"pinyin":["ke1 xue2 zhu3 yi4"],"word":"科学主义"},{"definition":["dualism, belief that the universe is made of two different substance (e.g. mind and matter or good and evil)"],"pinyin":["er4 yuan2 lun4"],"word":"二元论"},{"definition":["metaphysics"],"pinyin":["xing2 er2 shang4 xue2"],"word":"形而上学"},{"definition":["agnosticism, the philosophical doctrine that some questions about the universe are in principle unanswerable"],"pinyin":["bu4 ke3 zhi1 lun4"],"word":"不可知论"},{"definition":["fatalism\/fatalistic"],"pinyin":["su4 ming4 lun4"],"word":"宿命论"},{"definition":["epistemology (in philosophy, the theory of how we know things)"],"pinyin":["ren4 shi5 lun4"],"word":"认识论"},{"definition":["positivism\/empiricism"],"pinyin":["shi2 zheng4 zhu3 yi4"],"word":"实证主义"},{"definition":["Darwinism"],"pinyin":["Da2 er3 wen2 zhu3 yi4"],"word":"达尔文主义"},{"definition":["philosophy of idealism, the doctrine that external reality is a product of consciousness"],"pinyin":["wei2 xin1 zhu3 yi4"],"word":"唯心主义"},{"definition":["materialism, philosophical doctrine that physical matter is the whole of reality"],"pinyin":["wei2 wu4 zhu3 yi4"],"word":"唯物主义"},{"definition":["pluralism, philosophical doctrine that the universe consists of different substances"],"pinyin":["duo1 yuan2 lun4"],"word":"多元论"},{"definition":["theism (the belief in the existence of God)"],"pinyin":["you3 shen2 lun4"],"word":"有神论"},{"definition":["philosophy of idealism, the doctrine that external reality is a product of consciousness"],"pinyin":["wei2 xin1 lun4"],"word":"唯心论"},{"definition":["ontology"],"pinyin":["ben3 ti3 lun4"],"word":"本体论"},{"definition":["social Darwinism"],"pinyin":["she4 hui4 Da2 er3 wen2 zhu3 yi4"],"word":"社会达尔文主义"},{"definition":["voluntarism\/metaphysical view, esp. due to Schopenhauer 叔本華|叔本华[Shu1 ben3 hua2], that the essence of the world is willpower"],"pinyin":["wei2 yi4 zhi4 lun4"],"word":"唯意志论"}]}