{"definition":["decisive\/conclusive"],"pinyin":["jue2 ding4 xing4"],"traditional":["決定性"],"rank":10665.0,"normalized_rank":0.14921718690974214,"fraction":0.000007440187685898959,"cumulative_fraction":0.9349187987035168,"word":"决定性","characters":[{"definition":["to decide\/to determine\/to execute (sb)\/(of a dam etc) to breach or burst\/definitely\/certainly"],"pinyin":["jue2"],"word":"决"},{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"Interests are the governing factor in maintaining the relation between the Party and the mass.","chinese":"利益是维系党群关系的决定性因素。"},{"english":"It has scored a knockout win over token ring.","chinese":"它已取得了决定性的胜利，打倒了令牌环网。"},{"english":"To date, no researcher has claimed that genes can determine sexual orientation.","chinese":"直至今日，没有研究人士声称基因可以决定性取向。"},{"english":"The higher educational funds assignment pattern has great influence on the students enrollment policy.","chinese":"高等教育经费分配模式对招生政策具有决定性的影响。"},{"english":"The decisive attack took off fromthe foremost position.","chinese":"决定性进攻是从最前沿阵地开始的。"},{"english":"But the most important agent in the secularizing process was science.","chinese":"但是在脱离教会的过程中做出决定性一击的是科学。"},{"english":"The death of Mr. bin Laden is a defining moment in the American-led war on terrorism.","chinese":"本拉登之死是美国领导的反恐战争的决定性的时刻。"},{"english":"The puzzling part is a critical stage of all invention and inspiration.","chinese":"这个冥思苦想的部分是所有发明和灵感的决定性阶段。"},{"english":"Transcription errors are of decisive importance in stemmatics.","chinese":"抄写错误在校定学中具有决定性的重要性。"},{"english":"Q. Did you expect it to be as decisive as this with the Red Bulls picking up just one point?","chinese":"你是否认为这是与红牛争斗中的一场决定性的胜利？"},{"english":"The symmetry of electrode is crucial for the extinction ration.","chinese":"电极位置的对称性对器件串音度起决定性的影响。"},{"english":"He had performed brilliantly and capped it off with the clinching goal.","chinese":"他在决赛中表现出色，并攻入决定性的进球。"},{"english":"Cloud has a dominant influence on radiation.","chinese":"云对辐射有决定性的作用。"},{"english":"For that we have to rely on indirect and inconclusive evidence.","chinese":"因而，我们必须依靠间接和非决定性的证据。"},{"english":"When the decisive goal is waived offside by another incorrect lines-blind.","chinese":"当一个决定性的进球被另一个瞎子吹成了越位。"},{"english":"We have to lift our heads and the away game at France is decisive.","chinese":"我们要昂起头，毕竟到法国后比赛才是决定性的。"}],"related":[{"definition":["extremely important\/vital\/crucial\/essential"],"pinyin":["zhi4 guan1 zhong4 yao4"],"word":"至关重要"},{"definition":["to play a critical role (idiom)\/influential"],"pinyin":["ju3 zu2 qing1 zhong4"],"word":"举足轻重"},{"definition":["crucial point\/crux\/CL:個|个[ge4]\/key\/crucial\/pivotal"],"pinyin":["guan1 jian4"],"word":"关键"},{"definition":["important\/significant\/major"],"pinyin":["zhong4 yao4"],"word":"重要"},{"definition":["great\/important\/major\/significant"],"pinyin":["zhong4 da4"],"word":"重大"},{"definition":["to act on\/to affect\/action\/function\/activity\/impact\/result\/effect\/purpose\/intent\/to play a role\/corresponds to English -ity, -ism, -ization\/CL:個|个[ge4]"],"pinyin":["zuo4 yong4"],"word":"作用"},{"definition":["clearly and easy to see (idiom); obviously\/clearly\/it goes without saying"],"pinyin":["xian3 er2 yi4 jian4"],"word":"显而易见"},{"definition":["overwhelming"],"pinyin":["ya1 dao3 xing4"],"word":"压倒性"},{"definition":["military campaign"],"pinyin":["zhan4 yi4"],"word":"战役"},{"definition":["a tiny bit\/very little\/next to nothing (idiom)"],"pinyin":["wei1 hu1 qi2 wei1"],"word":"微乎其微"},{"definition":["substantive\/substantial\/material\/considerable"],"pinyin":["shi2 zhi4 xing4"],"word":"实质性"},{"definition":["huge influence"],"pinyin":["ju4 da4 ying3 xiang3"],"word":"巨大影响"},{"definition":["to have an effect\/to play a role\/to be operative\/to work\/to function"],"pinyin":["qi3 zuo4 yong4"],"word":"起作用"},{"definition":["victory or defeat\/the outcome of a battle"],"pinyin":["sheng4 fu4"],"word":"胜负"},{"definition":["precondition\/prerequisite"],"pinyin":["xian1 jue2 tiao2 jian4"],"word":"先决条件"},{"definition":["to display\/to exhibit\/to bring out implicit or innate qualities\/to express (a thought or moral)\/to develop (an idea)\/to elaborate (on a theme)"],"pinyin":["fa1 hui1"],"word":"发挥"}]}