{"definition":["to bring together\/to make do in a bad situation\/to just get by\/to improvise\/passable\/not too bad"],"pinyin":["cou4 he5"],"traditional":["湊合"],"rank":23894.0,"normalized_rank":0.3343080603864396,"fraction":0.0000016368471300028454,"cumulative_fraction":0.9825658437052844,"word":"凑合","characters":[{"definition":["to gather together, pool or collect\/to happen by chance\/to move close to\/to exploit an opportunity"],"pinyin":["cou4"],"word":"凑"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]","variant of 合[he2]"],"pinyin":["ge3","he2","he2"],"word":"合"}],"containing_words":[],"sentences":[{"english":"Knowing your own darkness is the best method for dealing with the darknesses of other people.","chinese":"理解自身的阴暗，是凑合他人阴暗一面的最好办法。"},{"english":"There are so much variety that you never have to do with the second best.","chinese":"物品品种繁多，从来不必用二等品来凑合。"},{"english":"Chen Chen said, benefit also assembles, for a car to earn one thousand or two thousand.","chinese":"陈晨说，效益还凑合，办理一辆车挣一两千。"},{"english":"She'll make do with the old typewriter until the new one arrives.","chinese":"新打字机到之前她将凑合着用旧的。"},{"english":"I forgot the words of my speech, so I had to improvise .","chinese":"我忘了我的演讲词，所以我只得临时凑合。"},{"english":"We threw together a meal out of leftovers.","chinese":"我们用剩菜剩饭匆匆凑合了一顿饭。"},{"english":"He overwhelmed so many of his opponents alone. Hers really something.","chinese":"他实了不讫，居然一个人凑合了这么多的对手。"},{"english":"There is so much variety thatyou never have to make do with second best.","chinese":"物品种繁多，从来不必用二等品来凑合。"},{"english":"I think this is a feature that \"just works\" as I am not aware of JetBrains having worked on specific SCA integration.","chinese":"我认为这仅仅是一种“凑合用”的特性。"},{"english":"They pieced out a meal from leftovers.","chinese":"他们用剩饭剩菜凑合成一顿饭。"},{"english":"I can make this padded jacket do for another winter.","chinese":"我这件棉袄凑合着还能穿一冬。"},{"english":"A tube cutter works best but you can use a hacksaw.","chinese":"最好用截管器，不过用钢锯也能凑合。"},{"english":"We can sleep on the beach. I don't mind roughing it for a night or two.","chinese":"我们可以在海边睡觉，我不介意凑合著睡个一两晚。"},{"english":"The rain, colors, and contrast just brought it all together.","chinese":"雨，色彩，对比度刚巧凑合地在一起。"},{"english":"He has not much money,but he rubs along all right.","chinese":"他没有很多的钱，可是他可以凑合着过日子。"},{"english":"There is so much variety that you never have to make do with second best.","chinese":"物品品种繁多，从来不必用二等品来凑合。"}],"related":[{"definition":["to accept (a bit reluctantly)\/to put up with"],"pinyin":["jiang1 jiu5"],"word":"将就"},{"definition":["to join up with sb\/to become partner\/to take meals regularly in cafeteria"],"pinyin":["da1 huo3"],"word":"搭伙"},{"definition":["to live one's life\/to pass one's days\/to get along"],"pinyin":["guo4 ri4 zi5"],"word":"过日子"},{"definition":["lit. can pass through (an opening)\/fig. can get by (in life)\/tolerably well\/not too bad\/How are you getting by?\/How's life?"],"pinyin":["guo4 de2 qu4"],"word":"过得去"},{"definition":["to put together hastily\/to make do with"],"pinyin":["cou4 fu5"],"word":"凑付"},{"definition":["very good"],"pinyin":["ting3 hao3"],"word":"挺好"},{"definition":["careless\/casual\/vague\/not so bad\/so-so\/tolerable\/fair"],"pinyin":["ma3 ma5 hu1 hu1"],"word":"马马虎虎"},{"definition":["thus\/in this way\/like this"],"pinyin":["zhe4 me5 zhe5"],"word":"这么着"},{"definition":["at that time (old)"],"pinyin":["na4 zan5"],"word":"那咱"},{"definition":["to do with difficulty\/to force sb to do sth\/reluctant\/barely enough"],"pinyin":["mian3 qiang3"],"word":"勉强"},{"definition":["intermittently"],"pinyin":["xiao1 xiao1 ting2 ting2"],"word":"消消停停"},{"definition":["(dialect) oneself\/by oneself"],"pinyin":["zi4 ge3 'r"],"word":"自个儿"},{"definition":["to fall short of the best but be better than the worst\/can pass muster"],"pinyin":["bi3 shang4 bu4 zu2 bi3 xia4 you3 yu2"],"word":"比上不足比下有余"},{"definition":["the two of us"],"pinyin":["zan2 lia3"],"word":"咱俩"},{"definition":["to be picky\/to be choosy"],"pinyin":["tiao1 san1 jian3 si4"],"word":"挑三拣四"},{"definition":["anyway\/in any case\/to come over from the enemy's side"],"pinyin":["fan3 zheng4"],"word":"反正"}]}