{"definition":["to present clearly\/to give prominence to\/to magnify\/clear and obvious"],"pinyin":["tu1 xian3"],"traditional":["凸顯"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"凸显","characters":[{"definition":["to stick out\/protruding\/convex\/male (connector etc)\/Taiwan pr. [tu2]"],"pinyin":["tu1"],"word":"凸"},{"definition":["to make visible\/to reveal\/prominent\/conspicuous\/(prefix) phanero-"],"pinyin":["xian3"],"word":"显"}],"containing_words":[],"sentences":[{"english":"In contrast with developed islands, this paper also analyzed the problems exposed in earlier exploitation.","chinese":"对比已开发无人岛现状，分析开发中凸显的问题。"},{"english":"Butterfly shapes accentuate the sweetness of heart-shaped faces.","chinese":"蝶形的太阳镜会凸显处心形脸的甜美。"},{"english":"Completing the war motif, sandbags surround the outdoor seating area.","chinese":"为了凸显战争主题，店外客座区周围都堆满了沙袋。"},{"english":"City’s recent purchase of Nasri really bumps them up here.","chinese":"曼城队最近购入的纳斯里凸显了他们在这方面的渴求。"},{"english":"The old apse gave an important illusion of depth which has now been restored.","chinese":"原来那个凸显进深的后殿如今得到了修复。"},{"english":"With the opening of the bridge, the value of great natural environment in Dinghai becomes increasingly important.","chinese":"随着跨海大桥的开通，定海自然环境的价值日益凸显。"},{"english":"That highlights the danger in Mr Bernanke's new strategy.","chinese":"这一点凸显了伯南克新招中的一种危险。"},{"english":"I believe as time moves on, the legacy of Zhu Rongji will become more obvious.","chinese":"相信随着时局推移，朱熔基的价值和意义会更加凸显。"},{"english":"That pace has just gotten even slower, highlighting the difficulty the two countries continue to face in putting a nasty past behind them.","chinese":"进展如今甚至更加缓慢，凸显两国捐弃前嫌的困难。"},{"english":"I love how the lighting shows the beams . Really smart idea.","chinese":"我喜欢这种用灯光凸显梁柱的方式，非常明智。"},{"english":"The new curriculum reform calls for experience -based curriculum.","chinese":"新一轮的课程改革凸显课程经验化的问题。"},{"english":"Now on the market of Lingbi rockery highlights the slightly higher prices of the situation.","chinese":"现在市场上灵璧假山石凸显出价格稍高的形势。"},{"english":"After the redecoration, it focuses more on the \"customers-centered\" concept .","chinese":"经全新改版后更凸显出“以人为本”的服务理念。"},{"english":"But this is where you can see the difference between winners and losers.","chinese":"但就里，者和失败者的不同点就凸显了。"},{"english":"The environment highlights how China is caught in a Catch-22 .","chinese":"环境问题凸显出中国怎样陷入了左右为难的境地。"},{"english":"It also highlights the severity of the pollution along the coastal manufacturing belt.","chinese":"这还凸显了沿海制造业带污染的严重性。"}],"related":[{"definition":["conspicuous\/to make sth stand out\/make sth prominent"],"pinyin":["tu1 xian3"],"word":"突显"},{"definition":["to come to prominence\/to appear clearly\/to stick out"],"pinyin":["tu1 xian4"],"word":"凸现"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰显"},{"definition":["prominent\/outstanding\/to give prominence to\/to protrude\/to project"],"pinyin":["tu1 chu1"],"word":"突出"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"体现"},{"definition":["weaken\/make weaker"],"pinyin":["ruo4 hua4"],"word":"弱化"},{"definition":["appearance\/to appear"],"pinyin":["xian3 xian4"],"word":"显现"},{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"word":"展现"},{"definition":["to make visible\/to reveal\/prominent\/conspicuous\/(prefix) phanero-"],"pinyin":["xian3"],"word":"显"},{"definition":["to seem\/to look\/to appear"],"pinyin":["xian3 de5"],"word":"显得"},{"definition":["completely\/fully\/without omission"],"pinyin":["wu2 yi2"],"word":"无遗"},{"definition":["whole entity\/entire body\/synthesis\/as a whole (situation, construction, team etc)\/global\/macrocosm\/integral\/holistic\/whole"],"pinyin":["zheng3 ti3"],"word":"整体"},{"definition":["more (than sth else)\/even more"],"pinyin":["geng4 jia1"],"word":"更加"},{"definition":["to add\/to increase"],"pinyin":["zeng1 tian1"],"word":"增添"},{"definition":["lit. ready to appear at the call (idiom)\/fig. on the verge of coming out into the open\/(of a person's choice etc) on the point of being disclosed\/(of an artistic depiction) vividly portrayed"],"pinyin":["hu1 zhi1 yu4 chu1"],"word":"呼之欲出"},{"definition":["to draw the outline of\/to outline\/to sketch\/to delineate contours of\/to give a brief account of"],"pinyin":["gou1 le4"],"word":"勾勒"}]}