{"definition":["to come to prominence\/to appear clearly\/to stick out"],"pinyin":["tu1 xian4"],"traditional":["凸現"],"rank":10408.0,"normalized_rank":0.1456214234745988,"fraction":0.000007753455673144666,"cumulative_fraction":0.9329664641424296,"word":"凸现","characters":[{"definition":["to stick out\/protruding\/convex\/male (connector etc)\/Taiwan pr. [tu2]"],"pinyin":["tu1"],"word":"凸"},{"definition":["to appear\/present\/now\/existing\/current"],"pinyin":["xian4"],"word":"现"}],"containing_words":[],"sentences":[{"english":"\"Eternal Lake of Scented Souls\", it is growing the value of time and space highlights the eternal realm.","chinese":"“万古香魂”，益加凸现价值时空的永恒境界。"},{"english":"The universe has not forgotten you -just the opposite: It will seek you out.","chinese":"宇宙没有忘记，恰恰相反正将凸现出来。"},{"english":"Isshiki Shimizu red brick, corner decorative patterns highlighted.","chinese":"一色清水红砖，墙角装饰花纹凸现。"},{"english":"In the course of manifesting\"the being\", intention action constructs and manifests the object of intentionality .","chinese":"在显现是者的过程中，意识活动构造并凸现意向对象。"},{"english":"Now, the full power of delayed binding should be coming into focus.","chinese":"现在，延迟绑定全部的能量就凸现了出来。"},{"english":"The transaction match risk also in reliefs in the partial constitutive product.","chinese":"交易对手风险也在部分结构性产品中凸现。"},{"english":"The use of different colours helps to build the idea of multiculturalism and diversity.","chinese":"不同颜色的使用旨在凸现多元文化和多样性的理念。"},{"english":"The entrusting for financing business reflects the deficiency of China' s listed companies' finance & invest mechanism.","chinese":"委托理财凸现我国上市公司投融资机制的缺失。"},{"english":"The game graphics are great and sound punctuates the game action.","chinese":"游戏图形和声音凸现伟大的游戏动作。"},{"english":"Nothing punctuates a pencil pusher's point than a background that is surrounded by pencil doodles.","chinese":"没有凸现了铅笔推比一个由铅笔涂鸦包围的背景点。"},{"english":"Water Margin is very interesting description of the preceding paragraphs, highlighting the true nature of Li Kui's thugs.","chinese":"水浒上几段描写很有意思，凸现李逵的打手本色。"},{"english":"The eternals of the globalization make the government functions more important.","chinese":"经济全球化的外部性，使政府的作用日益凸现。"}],"related":[{"definition":["conspicuous\/to make sth stand out\/make sth prominent"],"pinyin":["tu1 xian3"],"word":"突显"},{"definition":["to draw the outline of\/to outline\/to sketch\/to delineate contours of\/to give a brief account of"],"pinyin":["gou1 le4"],"word":"勾勒"},{"definition":["to express\/to exhibit"],"pinyin":["xian3 chu1"],"word":"显出"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰显"},{"definition":["to become visible\/to reveal"],"pinyin":["xian3 lu4"],"word":"显露"},{"definition":["to set off"],"pinyin":["chen4 tuo1"],"word":"衬托"},{"definition":["prominent\/outstanding\/to give prominence to\/to protrude\/to project"],"pinyin":["tu1 chu1"],"word":"突出"},{"definition":["appearance\/to appear"],"pinyin":["xian3 xian4"],"word":"显现"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"体现"},{"definition":["to set off by contrast\/antithesis\/analogy parallelism (linguistics)"],"pinyin":["ying4 chen4"],"word":"映衬"},{"definition":["to set off\/to highlight by contrast"],"pinyin":["hong1 chen4"],"word":"烘衬"},{"definition":["background (of a painting)\/backdrop\/a foil (to set off something to advantage)\/to offset (something to advantage)"],"pinyin":["hong1 tuo1"],"word":"烘托"},{"definition":["lit. ready to appear at the call (idiom)\/fig. on the verge of coming out into the open\/(of a person's choice etc) on the point of being disclosed\/(of an artistic depiction) vividly portrayed"],"pinyin":["hu1 zhi1 yu4 chu1"],"word":"呼之欲出"},{"definition":["glimpse (of something hidden)"],"pinyin":["yin3 xian4"],"word":"隐现"},{"definition":["to appear\/to come out in the open"],"pinyin":["xian3 lu4 chu1"],"word":"显露出"},{"definition":["faintly discernible (idiom)"],"pinyin":["ruo4 yin3 ruo4 xian4"],"word":"若隐若现"}]}