{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"traditional":["出","齣"],"rank":58.0,"normalized_rank":0.0008114952499545282,"fraction":0.0016056365294692568,"cumulative_fraction":0.2628370303658497,"word":"出","components":{"unicode":"U+51FA","character":"出","decomposition":"⿱屮凵","decomposition_definitions":[{"word":"⿱"},{"definition":["plants sprouting"],"pinyin":["che4"],"word":"屮"},{"definition":["receptacle"],"pinyin":["kan3"],"word":"凵"}]},"containing_words":[{"definition":["to appear\/to arise\/to emerge\/to show up"],"pinyin":["chu1 xian4"],"word":"出现"},{"definition":["to raise (an issue)\/to propose\/to put forward\/to suggest\/to post (on a website)\/to withdraw (cash)"],"pinyin":["ti2 chu1"],"word":"提出"},{"definition":["to push out\/to release\/to launch\/to publish\/to recommend"],"pinyin":["tui1 chu1"],"word":"推出"},{"definition":["(after a verb, indicates coming out, completion of an action, or ability to discern or detect)","to come out\/to appear\/to arise"],"pinyin":["chu5 lai5","chu1 lai2"],"word":"出来"},{"definition":["(after a verb, indicates coming out, completion of an action, or ability to discern or detect)","to come out\/to appear\/to arise"],"pinyin":["chu5 lai5","chu1 lai2"],"word":"出来"},{"definition":["to indicate\/to point out"],"pinyin":["zhi3 chu1"],"word":"指出"},{"definition":["an exit\/CL:個|个[ge4]\/to speak\/to export\/(of a ship) to leave port"],"pinyin":["chu1 kou3"],"word":"出口"},{"definition":["to officially launch (a policy, program etc)\/to appear on stage\/to appear publicly\/(of a bar girl) to leave with a client"],"pinyin":["chu1 tai2"],"word":"出台"},{"definition":["to attend\/to participate\/present"],"pinyin":["chu1 xi2"],"word":"出席"},{"definition":["prominent\/outstanding\/to give prominence to\/to protrude\/to project"],"pinyin":["tu1 chu1"],"word":"突出"},{"definition":["to act (in a play)\/to perform\/to put on (a performance)\/performance\/concert\/show\/CL:場|场[chang3],次[ci4]"],"pinyin":["yan3 chu1"],"word":"演出"},{"definition":["to issue (an order, decree etc)\/to send out\/to dispatch\/to produce (a sound)\/to let out (a laugh)"],"pinyin":["fa1 chu1"],"word":"发出"},{"definition":["remarkable\/outstanding"],"pinyin":["chu1 se4"],"word":"出色"},{"definition":["to be born"],"pinyin":["chu1 sheng1"],"word":"出生"}],"sentences":[{"english":"Blush can be poured through a hidden semi-transparent cover, very fitting skin.","chinese":"腮红可透过隐藏的半透明罩倒出，极度贴合肌肤。"},{"english":"I saw a plant growing out of a crevice in the wall.","chinese":"我看到墙缝里长出一棵草来。"},{"english":"It also reflects the pantheistic experimentation of the period immediately following the Civil War.","chinese":"同时也反映出了泛神论时期紧跟的内战时期状态。"},{"english":"We must first calculate the horse-power needed to propel the ship.","chinese":"我们必须首先计算出驱动这艘船需要多大马力。"},{"english":"The thief walked out of the gallery with the picture underneath his painter's smock.","chinese":"他把画藏在了漆工的工作服下然后把它带出了画廊。"},{"english":"Judge Orie had the curtains drawn while Mladic was taken out of court.","chinese":"当姆拉迪奇被带出法庭时，法官奥列将帘子拉下。"},{"english":"The conjurer waved his magic wand and pulled a rabbit out of the hat.","chinese":"魔术师挥舞魔杖，从帽子里拉出一只兔子。"},{"english":"The hecklers were conducted away from the hall at the request of the Chairman.","chinese":"主席要求把捣蛋分子强行赶出大厅。"},{"english":"My master went back to his friends and we took the boat out to sea.","chinese":"主人回到他的朋友们那儿去了，我们坐船出了海。"},{"english":"As the police moved in, the hostages were running out, he said.","chinese":"随着警方进入该区域，人质也都四散跑出。"},{"english":"Reasons for higher success rates among women are difficult to isolate.","chinese":"女人高成功率的原因很难去单独分析出。"},{"english":"Embracing warm blood, I sing of youth without regret. Look upon the horizon and know not when my ally would return.","chinese":"满腔热血唱出青春无悔，望穿天涯不知战友何时回。"},{"english":"No matter how carefully I plan my time, the plan always goes wrong.","chinese":"不论怎么仔细安排时间，我的计划总是出问题。"},{"english":"Supported user-defined unread notification of automatical protection.","chinese":"支持用户自定义的新未读消息弹出提示。"},{"english":"You couldn't drag that information out of me.","chinese":"你休想从我这儿套出消息。"},{"english":"Bentham sums up two principles that are applicable to penalty.","chinese":"边沁归纳出了刑罚适用的两个基本原则。"}],"related":[{"definition":["(after a verb, indicates coming out, completion of an action, or ability to discern or detect)","to come out\/to appear\/to arise"],"pinyin":["chu5 lai5","chu1 lai2"],"word":"出来"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth","surname Cheng"],"pinyin":["cheng2","Cheng2"],"word":"成"},{"definition":["to make new advances\/to move forwards"],"pinyin":["chu1 xin1"],"word":"出新"},{"definition":["to put out\/to issue"],"pinyin":["zuo4 chu1"],"word":"做出"},{"definition":["to give rise to\/to derive\/derivative\/derivation"],"pinyin":["yan3 sheng1"],"word":"衍生"},{"definition":["to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right","China\/Chinese\/surname Zhong"],"pinyin":["zhong4","zhong1","Zhong1"],"word":"中"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"进"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"来"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"},{"definition":["to draw the outline of\/to outline\/to sketch\/to delineate contours of\/to give a brief account of"],"pinyin":["gou1 le4"],"word":"勾勒"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"}]}