{"definition":["to take up a post\/to start in a new job"],"pinyin":["chu1 ren4"],"traditional":["出任"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"出任","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["surname Ren\/Ren County 任縣|任县[Ren2 Xian4] in Hebei","to assign\/to appoint\/to take up a post\/office\/responsibility\/to let\/to allow\/to give free rein to\/no matter (how, what etc)\/classifier for terms served in office, or for spouses, girlfriends etc (as in 前任男友)"],"pinyin":["Ren2","ren4"],"word":"任"}],"containing_words":[],"sentences":[{"english":"He is currently a deputy general manager of BNS Group Company.","chinese":"出任北辰集团公司副总经理。"},{"english":"Confirming reports over the past few days, Juventus have officially appointed Ciro Ferrara as their coach for next season.","chinese":"尤文官方宣布费拉拉出任下赛季球队主教练。"},{"english":"1988 went out with a new President taking office in the United Sates.","chinese":"1988年随着美国新总统的出任而结束。"},{"english":"In the meantime she takes up other social positions like the vice president of Liaoning Overseas Friends Sodality .","chinese":"同时出任辽宁省海外联谊会副会长等多项社会职务。"},{"english":"There is a rumor going the rounds that Mr Wonton will be the new superintendent.","chinese":"到处都传说诺顿先生将出任新督监。"},{"english":"He is offered a directorship with Smith Ltd.","chinese":"有限公司请他出任董事。"},{"english":"Both sides also discussed taking the post of propagandizes ambassador the incident.","chinese":"双方还商讨了出任宣传大使一事。"},{"english":"And he has hinted that he could return to the presidency in 2012.","chinese":"他暗示他将于2012年再次出任俄罗斯总统的职位。"},{"english":"For one thing, he took command of a ragged army of revolutionaries.","chinese":"首先，他勇敢地出任一支破破烂烂的革命军的司令。"},{"english":"After that, he became the Chief Designer of department store Lane Crawford.","chinese":"之后，任氏出任连卡佛百货公司之首席设计师。"},{"english":"In 1844 Calhoun became Secretary of State.","chinese":"1844年，卡尔霍恩出任国务卿。"},{"english":"Liu Bai first stand up and say to left cold chan as owners.","chinese":"陆柏第一个站出来说要左冷禅出任掌门。"},{"english":"Wenger's first move into management came a year later when he accepted a post with Nancy Lorraine.","chinese":"一年后他接受南锡俱乐部的邀请，第一次出任主教练。"},{"english":"He will chair the all-party group meeting.","chinese":"他将出任那个各党议员小组会议的主席。"},{"english":"54-year-old Zhou took Yongzhi Wang's place as chief designer 5 years ago.","chinese":"5年前接替王永志出任总设计师的周建平娓娓道来。"},{"english":"She served as high school is the famous universities charge wenwu double royal hall college.","chinese":"她出任的高中是文武双收的有名高校御堂学院。"}],"related":[{"definition":["to hold a governmental office or post\/to assume office of\/to take charge of\/to serve as"],"pinyin":["dan1 ren4"],"word":"担任"},{"definition":["to take over (as minister, manager etc)"],"pinyin":["jie1 ren4"],"word":"接任"},{"definition":["to be promoted to"],"pinyin":["sheng1 ren4"],"word":"升任"},{"definition":["to hold several jobs at once\/concurrent post\/working part-time"],"pinyin":["jian1 ren4"],"word":"兼任"},{"definition":["to appoint\/(job) appointment\/CL:紙|纸[zhi3]"],"pinyin":["ren4 ming4"],"word":"任命"},{"definition":["to transfer\/to move to another post"],"pinyin":["diao4 ren4"],"word":"调任"},{"definition":["to hold an office or post"],"pinyin":["ren4 zhi2"],"word":"任职"},{"definition":["newly-appointed\/newly elected\/new (in a political office)"],"pinyin":["xin1 ren4"],"word":"新任"},{"definition":["post\/position\/job\/duties"],"pinyin":["zhi2 wu4"],"word":"职务"},{"definition":["to leave office"],"pinyin":["xie4 ren4"],"word":"卸任"},{"definition":["to take office\/to assume a post"],"pinyin":["jiu4 ren4"],"word":"就任"},{"definition":["to replace\/to take over (a position or post)"],"pinyin":["jie1 ti4"],"word":"接替"},{"definition":["to appoint"],"pinyin":["wei3 ren4"],"word":"委任"},{"definition":["to resign\/to quit"],"pinyin":["ci2 qu4"],"word":"辞去"},{"definition":["key job\/important position"],"pinyin":["yao4 zhi2"],"word":"要职"},{"definition":["to succeed sb in a job\/successor"],"pinyin":["ji4 ren4"],"word":"继任"}]}