{"definition":["to get out of a predicament\/to stick out\/to take the initiative\/remaining odd fraction after a division\/a little more than"],"pinyin":["chu1 tou2"],"traditional":["出頭"],"rank":12938.0,"normalized_rank":0.18101940592951185,"fraction":0.000005388764095608226,"cumulative_fraction":0.9493098436401308,"word":"出头","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["suffix for nouns","head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]"],"pinyin":["tou5","tou2"],"word":"头"}],"containing_words":[{"definition":["to stand out (among a group)\/distinguished"],"pinyin":["chu1 tou2 niao3"],"word":"出头鸟"},{"definition":["the shot hits the bird that pokes its head out (idiom)\/nonconformity gets punished"],"pinyin":["qiang1 da3 chu1 tou2 niao3"],"word":"枪打出头鸟"},{"definition":["to break clear of all the troubles and hardships\/to achieve success\/to make it"],"pinyin":["ao2 chu1 tou2"],"word":"熬出头"}],"sentences":[{"english":"There was much jerking of heads, and looking down the line.","chinese":"常常有人伸出头来，望望后面的队伍。"},{"english":"As he looked out, a fantastic smell came to his nose.","chinese":"当他伸出头时，一股诱人的香味扑鼻而来。"},{"english":"Every dog has his day .","chinese":"每个人都有出头天。"},{"english":"Vinegar-faced Joseph projected his head from a round window of the barn.","chinese":"苦脸的约瑟夫从谷仓的一个圆窗里探出头来。"},{"english":"He stuck his head up through the hatch .","chinese":"他从舱口伸出头来。"},{"english":"Pretty amazing for two guys just barely into their 20s.","chinese":"这对两个20出头的年轻人算是很惊人的成就了。"},{"english":"You can also use this operator to extract the head and tail of a list.","chinese":"你也可以使用这个操作符来从一个列表中解出头和尾。"},{"english":"As more entertainment in the evening before their early 30's, he appears to have potbellied .","chinese":"因为晚上应酬多，才30出头的他已经显得大腹便便。"},{"english":"Larkin can always carry the ball for his friends in an emergency.","chinese":"拉金总能在紧急时刻为他的朋友出头。"},{"english":"Still we don't know what's yet to come…","chinese":"我为什么要来当出头鸟呢？"},{"english":"I know I experienced all of those motivations when I was in my early 20s.","chinese":"我知道在我20出头的时候也经历过所有这些动机。"},{"english":"Mr. Anderson pushed the window and stretched his head out of it .","chinese":"安得森先生推开窗户，伸出头去。"},{"english":"South Suffolk rams may be used on any breed of ewe and will even produce prime lambs from Merino ewes.","chinese":"南萨福克公羊也许能与任一种母羊生产出头等羊羔。"},{"english":"Meanwhile, Zhaoyi reports the case to Jinsheng. Jinsheng scolds Wuji soon after.","chinese":"金生马上替她出头，臭骂戊己一番。"},{"english":"The old circuitry will still show its head.","chinese":"过去的大脑电路依然想要探出头来。"},{"english":"The higher the degree of commercialization, artisanal small websites difficult early.","chinese":"商业化的程度越高，作坊式的小网站越难出头。"}],"related":[{"definition":["at the minimum\/at the very least"],"pinyin":["qi3 ma3"],"word":"起码"},{"definition":["moreover\/besides\/in addition\/furthermore"],"pinyin":["kuang4 qie3"],"word":"况且"},{"definition":["seat of honor\/person in a high-ranking position\/to be promoted to a more senior role\/(genetics) epistatic"],"pinyin":["shang4 wei4"],"word":"上位"},{"definition":["to suffer losses\/to come to grief\/to lose out\/to get the worst of it\/to be at a disadvantage\/unfortunately"],"pinyin":["chi1 kui1"],"word":"吃亏"},{"definition":["to speak the truth\/truth to tell\/frankly"],"pinyin":["shuo1 shi2 hua4"],"word":"说实话"},{"definition":["to feel embarrassed or awkward\/to make things difficult (for someone)\/to find things difficult (to do or manage)"],"pinyin":["wei2 nan2"],"word":"为难"},{"definition":["almost\/nearly\/close to"],"pinyin":["jiang1 jin4"],"word":"将近"},{"definition":["at most\/at best"],"pinyin":["ding3 duo1"],"word":"顶多"},{"definition":["let alone\/to say nothing of\/besides\/what's more"],"pinyin":["he2 kuang4"],"word":"何况"},{"definition":["to exert oneself"],"pinyin":["chu1 li4"],"word":"出力"},{"definition":["to go into battle"],"pinyin":["shang4 zhen4"],"word":"上阵"},{"definition":["now\/at present\/subocular (medicine)"],"pinyin":["yan3 xia4"],"word":"眼下"},{"definition":["to stand firmly\/to gain a foothold\/to establish oneself"],"pinyin":["zhan4 wen3 jiao3 gen1"],"word":"站稳脚跟"},{"definition":["original\/originally\/at first\/it goes without saying\/of course"],"pinyin":["ben3 lai2"],"word":"本来"},{"definition":["to calculate\/to estimate\/in total\/all told\/(fig.) if you think about it"],"pinyin":["suan4 qi3 lai2"],"word":"算起来"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不过"}]}