{"definition":["source (esp. of quotation or literary allusion)\/origin\/where sth comes from"],"pinyin":["chu1 chu4"],"traditional":["出處"],"rank":19367.0,"normalized_rank":0.2709694569977474,"fraction":0.000002560009642277704,"cumulative_fraction":0.9732721017448182,"word":"出处","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish","place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point"],"pinyin":["chu3","chu4"],"word":"处"}],"containing_words":[],"sentences":[{"english":"The answers to difficult problems are usually not found in the same place as the problems.","chinese":"我们不能在问题的出处找到解决疑难问题的方法。"},{"english":"would not have checked the provenance of that story?","chinese":"没有核查那个故事的出处。"},{"english":"But did not make clear provenance and author full name in any place.","chinese":"但没有在任何一个地方表明出处和作者姓名。"},{"english":"But Song Yu's contribution to the motif history …","chinese":"而宋玉在出处仕隐主题史上的历史贡献，由此奠定。"},{"english":"Tanslated by Zhu Xiaoxing. Whoever wants to quote it should note the translator and where the translation is from.","chinese":"本文由朱晓星译出，如要转引，请注明译者及出处。"},{"english":"It differs from reprinted publication in that a reprint cites sources.","chinese":"与单行本出版物的不同之处在于再版引用出处。"},{"english":"But Song Yu's contribution to the motif history was es…","chinese":"而宋玉在出处仕隐主题史上的历史贡献，由此奠定。"},{"english":"An understanding of the provenance of the product is key.","chinese":"对产品出处的了解很关键。"},{"english":"You need not note the source of information that you paraphrased.","chinese":"你没有必要告知你所解释的信息的出处。"},{"english":"I asked her for the provenance.","chinese":"我问她东西的出处。"},{"english":"The article is original, writing is also the strength to live, reference please indicate the source and author.","chinese":"文章原创，写作也是力气活，引用请注明出处和作者。"},{"english":"The picture has since appeared on a host of blog sites, without attribution ⑫.","chinese":"这张图片已在许多博客上出现，却没有注明出处。"},{"english":"Self-plagiarism involves copying from one's own work without proper attribution.","chinese":"自我剽窃涉及复制自己的作品而没有正确注明出处。"},{"english":"Amorphous cloud source element may like clouds also free.","chinese":"浮云出处元无定，得似浮云也自由。"},{"english":"Analysis and commentary should be labeled and not misrepresent fact or context.","chinese":"分析语评论应该标明出处，以避免歪曲事实或语境。"},{"english":"Please indicate the source when you quote from my LIVE space. Thank you.","chinese":"引用本网志内容时请您注明出处，谢谢合作。"}],"related":[{"definition":["to forward (a shipment)\/to reprint sth published elsewhere\/Taiwan pr. [zhuan3 zai4]"],"pinyin":["zhuan3 zai3"],"word":"转载"},{"definition":["to mark\/to indicate"],"pinyin":["biao1 ming2"],"word":"标明"},{"definition":["copyright"],"pinyin":["ban3 quan2"],"word":"版权"},{"definition":["to clearly indicate"],"pinyin":["zhu4 ming2"],"word":"注明"},{"definition":["anonymous author"],"pinyin":["zuo4 zhe3 bu4 xiang2"],"word":"作者不详"},{"definition":["to quote\/to cite\/to recommend\/to appoint\/(computing) reference"],"pinyin":["yin3 yong4"],"word":"引用"},{"definition":["to infringe the rights of\/to violate\/infringement"],"pinyin":["qin1 quan2"],"word":"侵权"},{"definition":["to come from"],"pinyin":["chu1 zi4"],"word":"出自"},{"definition":["author\/writer\/CL:個|个[ge4]"],"pinyin":["zuo4 zhe3"],"word":"作者"},{"definition":["original text"],"pinyin":["yuan2 wen2"],"word":"原文"},{"definition":["to delete\/to cancel"],"pinyin":["shan1 chu2"],"word":"删除"},{"definition":["image\/picture\/photograph\/CL:張|张[zhang1]"],"pinyin":["tu2 pian4"],"word":"图片"},{"definition":["original meaning\/original intention"],"pinyin":["yuan2 yi4"],"word":"原意"},{"definition":["originality\/creativity\/innovation"],"pinyin":["yuan2 chuang4"],"word":"原创"},{"definition":["marginal notes\/annotation\/to annotate\/to add comments to text"],"pinyin":["zhu4 shi4"],"word":"注释"},{"definition":["to ask\/to invite\/please (do sth)\/to treat (to a meal etc)\/to request"],"pinyin":["qing3"],"word":"请"}]}