{"definition":["to leave home (to become a Buddhist monk or nun)"],"pinyin":["chu1 jia1"],"traditional":["出家"],"rank":19463.0,"normalized_rank":0.2723126215493963,"fraction":0.0000025299382511441464,"cumulative_fraction":0.9735163750124814,"word":"出家","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"}],"containing_words":[{"definition":["switch to a job one was not trained for"],"pinyin":["ban4 lu4 chu1 jia1"],"word":"半路出家"},{"definition":["monk\/nun (Buddhist or Daoist)"],"pinyin":["chu1 jia1 ren2"],"word":"出家人"}],"sentences":[{"english":"Finally he ordained also representing her sister's a loving to forest.","chinese":"最后他出家也代表着她对林妹妹的一片钟情。"},{"english":"In the Twelve Maidens in Jinling, Miaoyu is the only nun.","chinese":"妙玉是金陵十二钗中唯一的出家人。"},{"english":"Li Shutong becomes a monk and stays at the Hupao Monastery with Hongyi as his Buddhist name.","chinese":"李叔同到杭州虎跑寺出家为僧，法号弘一法师。"},{"english":"Monks and nuns may wear their robes in keeping with their respective traditions.","chinese":"出家僧侣需要穿僧袍保持优良传统。"},{"english":"Monks are wise, they don't worry about money.","chinese":"出家人是聪明的，因为他们不在乎身外之物。"},{"english":"While monastics are nourished mentally with Buddha Dharma every day, enjoying real bliss.","chinese":"出家人每天用佛法滋养内心才是真正的快乐。"},{"english":"Elder sister, that family at see you.","chinese":"姐姐，那个出家人在看你呢。"},{"english":"So left-home people, wherever they may be, must sternly guard their precepts.","chinese":"所以，出家人处处要严守戒律。"},{"english":"When Hu was six or seven years old, he asked his father and mother if he could become a monk.","chinese":"胡六七岁的时候，问他父母可不可以让他出家为僧。"},{"english":"Why do they choose to be nuns?","chinese":"为什么她们选择出家呢？"},{"english":"What was the monastic name of the late art educator Li Shutong?","chinese":"已故艺术教育家李叔同出家后的法号是什么？"},{"english":"Gentleman will be able to learn to rule the country at home.","chinese":"故君子不出家而成教于国。"},{"english":"Chinese parents don't want their kids to be monks, ' he explained.","chinese":"叶琛说，中国的父母不想让他们的孩子出家。"},{"english":"That was the first he saw a left home person.","chinese":"那是他第一次看到一个出家人。"},{"english":"I have just switched to the profession of a teacher and quite lack experience in teaching work.","chinese":"我刚半路出家来当教师，还没有什么教学经验。"},{"english":"Worse still is an evil recluse who is repulsively loathsome to gods and men alike.","chinese":"更糟的是，一个邪恶的出家人则为人神所共同嫌恶。"}],"related":[{"definition":["to take refuge in religious life"],"pinyin":["dun4 ru4 kong1 men2"],"word":"遁入空门"},{"definition":["to take the tonsure\/to shave the head\/tonsure (shaved head of Buddhist monk)"],"pinyin":["ti4 du4"],"word":"剃度"},{"definition":["to return to normal life (leaving a monastic order)"],"pinyin":["huan2 su2"],"word":"还俗"},{"definition":["to see through the world of mortals (idiom, of Buddhist monk)\/disillusioned with human society\/to reject the world for a monastic life"],"pinyin":["kan1 po4 hong2 chen2"],"word":"看破红尘"},{"definition":["to shave one's head\/fig. to become a monk or nun\/to take the tonsure"],"pinyin":["xue1 fa4"],"word":"削发"},{"definition":["to become a Buddha\/to attain enlightenment"],"pinyin":["cheng2 fo2"],"word":"成佛"},{"definition":["Buddhist nun"],"pinyin":["ni2 gu1"],"word":"尼姑"},{"definition":["monk\/nun (Buddhist or Daoist)"],"pinyin":["chu1 jia1 ren2"],"word":"出家人"},{"definition":["to take oaths as a monk (Buddhism)\/to take orders"],"pinyin":["shou4 jie4"],"word":"受戒"},{"definition":["to convert to (a religion)"],"pinyin":["gui1 yi1"],"word":"皈依"},{"definition":["to believe in Buddhism"],"pinyin":["xin4 Fo2"],"word":"信佛"},{"definition":["name in religion (of Buddhist or Daoist within monastery)"],"pinyin":["fa3 hao4"],"word":"法号"},{"definition":["death\/to pass away (of Buddhist monks, nuns etc)"],"pinyin":["yuan2 ji4"],"word":"圆寂"},{"definition":["Buddhist monk"],"pinyin":["he2 shang5"],"word":"和尚"},{"definition":["to achieve supreme enlightenment or nirvana (Buddhism)"],"pinyin":["da4 che4 da4 wu4"],"word":"大彻大悟"},{"definition":["monk\/Sangha, the Buddhist monastic order"],"pinyin":["seng1"],"word":"僧"}]}