{"definition":["old: to reap the consequences of one's words (idiom, from Mencius); modern: to go back on one's word\/to blow hot and cold\/to contradict oneself\/inconsistent"],"pinyin":["chu1 er3 fan3 er3"],"traditional":["出爾反爾"],"rank":32950.0,"normalized_rank":0.4610132497586501,"fraction":7.25362827876941e-7,"cumulative_fraction":0.9926879018425676,"word":"出尔反尔","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["variant of 爾|尔[er3]","thus\/so\/like that\/you\/thou"],"pinyin":["er3","er3"],"word":"尔"},{"definition":["contrary\/in reverse\/inside out or upside down\/to reverse\/to return\/to oppose\/opposite\/against\/anti-\/to rebel\/to use analogy\/instead\/abbr. for 反切[fan3 qie4] phonetic system"],"pinyin":["fan3"],"word":"反"},{"definition":["variant of 爾|尔[er3]","thus\/so\/like that\/you\/thou"],"pinyin":["er3","er3"],"word":"尔"}],"containing_words":[],"sentences":[{"english":"The tether gave him oxygen to breathe.","chinese":"出尔反尔，给他呼吸的氧气。"},{"english":"The vice - president was accused of flip-flopping on several major issues.","chinese":"副总统受到谴责，说他在几个重大问题上出尔反尔。"},{"english":"The politician was accused of flip- flopping on several major issues.","chinese":"这个政客被指责在若干重大问题上出尔反尔。"},{"english":"Wang is used to the vagaries of government decisions.","chinese":"王秀丽已经习惯了政府的出尔反尔。"}],"related":[{"definition":["to go back on one's word\/to break one's promise\/to be unfaithful\/to be untrustworthy"],"pinyin":["yan2 er2 wu2 xin4"],"word":"言而无信"},{"definition":["breaking faith and abandoning right (idiom); to betray\/treachery\/perfidy"],"pinyin":["bei4 xin4 qi4 yi4"],"word":"背信弃义"},{"definition":["to renege\/to go back (on a deal)\/to back out (of a promise)"],"pinyin":["fan3 hui3"],"word":"反悔"},{"definition":["lit. to grow fat eating one's words (idiom)\/fig. not to live up to one's promises"],"pinyin":["shi2 yan2 er2 fei2"],"word":"食言而肥"},{"definition":["lit. to destroy the bridge after crossing the river (idiom)\/fig. to abandon one's benefactor upon achieving one's goal"],"pinyin":["guo4 he2 chai1 qiao2"],"word":"过河拆桥"},{"definition":["lit. to eat one's words\/to break a promise\/to go back on one's word\/to renege\/unsworn testimony"],"pinyin":["shi2 yan2"],"word":"食言"},{"definition":["to break a promise\/breach of contract"],"pinyin":["hui3 yue1"],"word":"毁约"},{"definition":["to fall out with sb and become hostile"],"pinyin":["fan1 lian3 bu4 ren4 ren2"],"word":"翻脸不认人"},{"definition":["lit. to kill the donkey when the grinding is done (idiom)\/to get rid of sb once he has ceased to be useful"],"pinyin":["xie4 mo4 sha1 lu:2"],"word":"卸磨杀驴"},{"definition":["to forget favors and violate justice (idiom); ingratitude to a friend\/to kick a benefactor in the teeth"],"pinyin":["wang4 en1 fu4 yi4"],"word":"忘恩负义"},{"definition":["lit. to strike with a muckrake (idiom), cf Pigsy 豬八戒|猪八戒 in Journey to the West 西遊記|西游记; fig. to counterattack\/to make bogus accusations (against one's victim)"],"pinyin":["dao4 da3 yi1 pa2"],"word":"倒打一耙"},{"definition":["two-faced, three knives (idiom); double-cross\/double dealing and back stabbing"],"pinyin":["liang3 mian4 san1 dao1"],"word":"两面三刀"},{"definition":["to speak and keep one's promise (idiom); as good as one's word"],"pinyin":["yan2 er2 you3 xin4"],"word":"言而有信"},{"definition":["obstinately clinging to one's course (idiom)\/willful\/one's own way\/dogmatic"],"pinyin":["yi1 yi4 gu1 xing2"],"word":"一意孤行"},{"definition":["to change one's mind\/to go back on one's word"],"pinyin":["bian4 gua4"],"word":"变卦"},{"definition":["to bite the hand that feeds one (idiom)"],"pinyin":["en1 jiang1 chou2 bao4"],"word":"恩将仇报"}]}