{"definition":["to go into battle\/to campaign (military)"],"pinyin":["chu1 zheng1"],"traditional":["出征"],"rank":7845.0,"normalized_rank":0.10976172820505646,"fraction":0.000012360801532160968,"cumulative_fraction":0.9079144655359018,"word":"出征","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["to invite\/to recruit\/to levy (taxes)\/to draft (troops)\/phenomenon\/symptom\/characteristic sign (used as proof)\/evidence","journey\/trip\/expedition\/to go on long campaign\/to attack"],"pinyin":["zheng1","zheng1"],"word":"征"}],"containing_words":[],"sentences":[{"english":"She stood still as a mother seeing off the son heading to the battle field.","chinese":"她笔直地站着，如同一位送子出征的母亲。"},{"english":"We played an intra-squad scrimmage and it was a better game than the NBA All-Star game.","chinese":"这一次他能够代表美国队出征真是一件非常好的事情。"},{"english":"Cao, infuriated, ordered him to the battle front, hoping the enemy's sword would kill him.","chinese":"曹操一气之下，命他立即出征，借敌人的刀杀了祢衡。"},{"english":"As the new semester starts, i adapted the mood of soldiers going for war to Kampar…","chinese":"新的学期开始了，我带着兵士出征的心情前往金宝。"},{"english":"Liu Xiang spearheads Team China to Daegu meet.","chinese":"刘翔领衔中国队出征大邱世锦赛。"},{"english":"Cao， infuriated， ordered him to the battle front， hoping the enemy's sword would kill him.","chinese":"曹操一气之下，命他立即出征，借敌人的刀杀了祢衡。"},{"english":"In the end the Emperor decided to temporarily stop the expedition.","chinese":"最终唐太宗决定暂时停止这次出征。"},{"english":"Lone hero crusading for the truth against a corrupt Establishment?","chinese":"独行侠式的英雄，为真理出征，挑战腐败的体制？"},{"english":"The Warring States era, a father and his son off to fight.","chinese":"春秋战国时代，一位父亲和他的儿子出征打战。"},{"english":"In the Spring and Autumn Period, Duke Huan of Qi led an army to attack a small state in the north.","chinese":"春秋时代，齐桓公出征攻打北方一个小国。"},{"english":"Adm. yi sun-sin decided to lead half board house boat.","chinese":"之后李舜臣决定带领一半的板屋船出征。"},{"english":"The tour is named after the weapon carried by Genghis Khan, the Mongolian emperor.","chinese":"这一名称出自蒙古圣祖成吉思汗出征时所携之武器名。"},{"english":"We heard Sparta was on the warpath.","chinese":"我们听说斯巴达在出征路途上。"},{"english":"The first rider stayed at his last station until it was time for his next job.","chinese":"第一个骑手则在他最终到达的驿站上等待下一次出征。"},{"english":"In ChunQiu era, there is a father and his son going for a war.","chinese":"春秋战国时代，一位父亲和他的儿子出征打战。"},{"english":"I'm always glad to represent my country.","chinese":"能代表国家出征总是让我非常高兴。"}],"related":[{"definition":["campaign\/expedition"],"pinyin":["zheng1 zhan4"],"word":"征战"},{"definition":["to enlist\/to draft\/to conscript\/to appoint to an official position"],"pinyin":["zheng1 zhao4"],"word":"征召"},{"definition":["an expedition, esp. military\/march to remote regions"],"pinyin":["yuan3 zheng1"],"word":"远征"},{"definition":["to lead troups\/(fig.) to lead\/leading"],"pinyin":["ling3 jun1"],"word":"领军"},{"definition":["to take to the field oneself (of emperor)\/to take part in person in an expedition"],"pinyin":["qin1 zheng1"],"word":"亲征"},{"definition":["punitive expedition to the south"],"pinyin":["nan2 zheng1"],"word":"南征"},{"definition":["command\/commander-in-chief"],"pinyin":["tong3 shuai4"],"word":"统帅"},{"definition":["the emperor leads his troops into battle (idiom)\/to take part personally in an expedition"],"pinyin":["yu4 jia4 qin1 zheng1"],"word":"御驾亲征"},{"definition":["punitive expedition to the east"],"pinyin":["dong1 zheng1"],"word":"东征"},{"definition":["New Armies (modernized Qing armies, trained and equipped according to Western standards, founded after Japan's victory in the First Sino-Japanese War in 1895)"],"pinyin":["Xin1 jun1"],"word":"新军"},{"definition":["to go on a punitive expedition"],"pinyin":["zheng1 tao3"],"word":"征讨"},{"definition":["punitive expedition to the west"],"pinyin":["xi1 zheng1"],"word":"西征"},{"definition":["to lead\/to command\/to head"],"pinyin":["shuai4 ling3"],"word":"率领"},{"definition":["to lead troops"],"pinyin":["dai4 bing1"],"word":"带兵"},{"definition":["punitive expedition to the north"],"pinyin":["bei3 zheng1"],"word":"北征"},{"definition":["to drill troops\/army training"],"pinyin":["lian4 bing1"],"word":"练兵"}]}