{"definition":["to overstep the bounds of what is proper\/to take sth too far\/(of a measuring device) to go off the scale"],"pinyin":["chu1 ge2"],"traditional":["出格"],"rank":26284.0,"normalized_rank":0.3677472612035314,"fraction":0.0000013180319929363855,"cumulative_fraction":0.9860851946629232,"word":"出格","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"}],"containing_words":[],"sentences":[{"english":"There is nothing out of the common course of life in my doing this.","chinese":"我这么办，循的是人生的常规，毫无出格之处。"},{"english":"Hostess But even here among the virgins, there is something else going on.","chinese":"但即使在单性生殖的动物中，也有出格的事情发生。"},{"english":"Do be careful with these fireworks, a slight spark could set them off.","chinese":"这些个炊火要出格小心，稍有火星就能导致爆炸。"},{"english":"Taking time to go, see a postage labels vending machines, then send a few franker and bought several new ticket.","chinese":"那时也并没有出格地存眷，只以为是一种新地标签。"},{"english":"Some placards went further, depicting Nazi swastikas on the French flag.","chinese":"有些标语则更加出格，在法国国旗上描绘了纳粹标志。"},{"english":"Mayes said the babies were beingcared for in intensive care in Belfast.","chinese":"梅斯说，婴儿们正在贝尔法斯特受到出格护理。"},{"english":"More tha great 5 years; simply less tha great 10 years. 14 days.","chinese":"任职满5年以上未满10年者全年给14天出格休假。"},{"english":"Today's special is roast leg of lamb.","chinese":"今日的出格菜是烤羊腿。"},{"english":"Daniel Pay attention to punctuation, especially to the correct use of commas and periods.","chinese":"注重标点，出格是逗点和句号的不错施用要领。"},{"english":"So we should choose some good programs to watch, especially for children.","chinese":"所以我们应该拔取一些好节目来看，出格是对孩子们。"},{"english":"Article 56 The Executive Council of the Hong Kong Special Administrative Region shall be presided over by the Chief Executive.","chinese":"第半百六条香港出格行政区行政会议由行政长官主持。"},{"english":"She is a notorious gossiper here, who is very fond of dishing the dirt about others.","chinese":"她出格喜欢说别人的闲话，是我们这出了名的长舌妇。"},{"english":"It was morning but the winter sky was dark.","chinese":"一个冬天的早晨，天色出格阴晦。"},{"english":"I dig songs and Ilike pop music very much.","chinese":"我出格喜欢歌曲和流行音乐。"},{"english":"This shop sells a wide range of watches all of which are the choicest.","chinese":"这家商展卖的腕表都是精品，而且种类还出格多。"},{"english":"Her little flirtation with Drouet seemed now an extraordinary thing.","chinese":"她和杜洛埃的那一段小小的调情现在看来似乎出格了。"}],"related":[{"definition":["to run off the track\/to step out of line\/to overstep the bounds of propriety"],"pinyin":["yue4 gui3"],"word":"越轨"},{"definition":["to offend Heaven and reason (idiom); bloody atrocities that cry to heaven\/outrageous acts"],"pinyin":["shang1 tian1 hai4 li3"],"word":"伤天害理"},{"definition":["drastic\/extreme\/aggressive"],"pinyin":["guo4 ji1"],"word":"过激"},{"definition":["unduly\/excessive"],"pinyin":["guo4 fen4"],"word":"过份"},{"definition":["offending public morals (idiom)"],"pinyin":["shang1 feng1 bai4 su2"],"word":"伤风败俗"},{"definition":["excessive\/undue\/overly"],"pinyin":["guo4 fen4"],"word":"过分"},{"definition":["to go too far (in word or deed)\/over the top"],"pinyin":["guo4 huo3"],"word":"过火"},{"definition":["folly"],"pinyin":["chun3 shi4"],"word":"蠢事"},{"definition":["universally shocking\/to offend the whole of society"],"pinyin":["jing1 shi4 hai4 su2"],"word":"惊世骇俗"},{"definition":["to imitate the dog and steal chicken (idiom)\/to pilfer\/to dally with women\/to have affairs"],"pinyin":["tou1 ji1 mo1 gou3"],"word":"偷鸡摸狗"},{"definition":["dirty\/filthy\/vile\/despicable\/narrow-minded\/petty"],"pinyin":["wo4 chuo4"],"word":"龌龊"},{"definition":["to be content with one's lot (idiom)\/to know one's place"],"pinyin":["an1 fen4 shou3 ji3"],"word":"安分守己"},{"definition":["extreme (usu. of thoughts, speech, circumstances)"],"pinyin":["pian1 ji1"],"word":"偏激"},{"definition":["to turn a blind eye"],"pinyin":["zheng1 yi1 zhi1 yan3 bi4 yi1 zhi1 yan3"],"word":"睁一只眼闭一只眼"},{"definition":["beyond belief\/preposterous\/absurd\/intemperate\/dissipated"],"pinyin":["huang1 tang2"],"word":"荒唐"},{"definition":["to act arbitrarily regardless of the rules\/to mess with sth\/to make a hash of things\/to cause trouble"],"pinyin":["hu2 lai2"],"word":"胡来"}]}