{"definition":["to appear\/to arise\/to emerge\/to show up"],"pinyin":["chu1 xian4"],"traditional":["出現"],"rank":152.0,"normalized_rank":0.0021266772067773843,"fraction":0.0007497393398313612,"cumulative_fraction":0.3616852739990195,"word":"出现","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["to appear\/present\/now\/existing\/current"],"pinyin":["xian4"],"word":"现"}],"containing_words":[{"definition":["to reappear"],"pinyin":["zai4 chu1 xian4"],"word":"再出现"}],"sentences":[{"english":"Non-codependent love requires wholeness to emerge within.","chinese":"不再相互依赖的爱，需要从内在出现完整。"},{"english":"Her arms showed green patches, indicating heavy internal bleeding.","chinese":"她的胳膊出现了青斑，表明有严重的内出血。"},{"english":"Our service is free repairs due to a series of bar code barriers.","chinese":"我们的服务是免费维修条码机出现一系列的障碍问题。"},{"english":"If there are chaos in the society, your planning cannot precede them.","chinese":"人道没有出现祸乱的时候，不可先策划兴师。"},{"english":"There'sno need for that kind of language in this magazine .","chinese":"这份杂志没必要出现那种语言。"},{"english":"As the saying goes, the devil often appears in the subtle.","chinese":"俗话说，魔鬼常出现在细微处。"},{"english":"These elements can be sorted, or processed in the order they appear.","chinese":"可以对这些元素排序，或以其出现的顺序处理它们。"},{"english":"But for now, a symbolic moment is about to occur.","chinese":"但在眼下，一个象征性的时刻即将出现。"},{"english":"He shows up in other people and what they say to you.","chinese":"他以其他人的形式出现，这些人对你说什么？"},{"english":"So the chemo finished. Then, blood began to appear in the patient's urine.","chinese":"后来，化疗结束以后，病人出现了血尿。"},{"english":"Some glorious morn--but when? Ah, who shall say?","chinese":"光荣的黎明，谁能说何时出现？"},{"english":"The image of the woman popped into his head out of the blue.","chinese":"那个女人的形象突然出现在他的脑海里。"},{"english":"Set the debug option to enable a backtrace when a; problem occurs.","chinese":"当有问题出现显示错误信息，便于调试。"},{"english":"Conclusion The above procedure is necessary for the ankle sprains with the injury of the common peroneal nerve.","chinese":"结论踝扭伤出现腓总神经损伤者应作探查松解减压术。"},{"english":"When the terminal has an alarm, the terminal will automatically transmit the location information to the management center.","chinese":"终端出现警情时，终端自动将位置信息传给管理中心。"},{"english":"But the dollar's unity or reunification of the rentier war is inevitable.","chinese":"但是美元统一或食利者的统一战争，是必然出现。"}],"related":[{"definition":["phenomenon\/CL:個|个[ge4],種|种[zhong3]\/appearance"],"pinyin":["xian4 xiang4"],"word":"现象"},{"definition":["to exist\/to be\/existence"],"pinyin":["cun2 zai4"],"word":"存在"},{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["to happen\/to occur\/to take place\/to break out"],"pinyin":["fa1 sheng1"],"word":"发生"},{"definition":["to lead to\/to create\/to cause\/to bring about"],"pinyin":["dao3 zhi4"],"word":"导致"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["to disappear\/to fade away"],"pinyin":["xiao1 shi1"],"word":"消失"},{"definition":["might (happen)\/possible\/probable\/possibility\/probability\/maybe\/perhaps\/CL:個|个[ge4]"],"pinyin":["ke3 neng2"],"word":"可能"},{"definition":["clear\/distinct\/obvious"],"pinyin":["ming2 xian3"],"word":"明显"},{"definition":["circumstances\/state of affairs\/situation\/CL:個|个[ge4],種|种[zhong3]"],"pinyin":["qing2 kuang4"],"word":"情况"},{"definition":["grave\/serious\/severe\/critical"],"pinyin":["yan2 zhong4"],"word":"严重"},{"definition":["to appear\/to emerge\/to present (a certain appearance)\/to demonstrate"],"pinyin":["cheng2 xian4"],"word":"呈现"},{"definition":["to meet\/to run into\/to come across"],"pinyin":["yu4 dao4"],"word":"遇到"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["to arise\/to come into being\/to come about\/to give rise to\/to bring into being\/to bring about\/to produce\/to engender\/to generate\/to appear\/appearance\/emergence\/generation\/production\/yield"],"pinyin":["chan3 sheng1"],"word":"产生"}]}