{"definition":["from the cradle to the grave (idiom); to go through fire and water\/brave\/willing to risk life and limb"],"pinyin":["chu1 sheng1 ru4 si3"],"traditional":["出生入死"],"rank":36155.0,"normalized_rank":0.5058553579673443,"fraction":5.459563244636262e-7,"cumulative_fraction":0.9947135224275336,"word":"出生入死","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"},{"definition":["to die\/impassable\/uncrossable\/inflexible\/rigid\/extremely\/damned"],"pinyin":["si3"],"word":"死"}],"containing_words":[],"sentences":[{"english":"He has distinguished himself many times at the risk of life since he joined the army.","chinese":"他参军以来，出生入死屡建功劳。"},{"english":"Many people, even youth, were willing to sacrifice themselves for him.","chinese":"许多人，甚至是年轻人都心甘情愿地为他出生入死。"},{"english":"Bob is eager to review the previous Superman kind of go through fire and life.","chinese":"鲍勃十分渴望重温以前那种出生入死的超人生活。"},{"english":"You ready to follow Captain America into the jaws of death?","chinese":"愿意跟着美国队长出生入死吗？"},{"english":"He is willing to die for the sake of his country.","chinese":"为了他的祖国他愿意出生入死。"},{"english":"Our journalists are constantly at risk of death.","chinese":"我们的记者经常出生入死。"},{"english":"The soldiers went through hell and high water to capture the fort.","chinese":"为夺取该座堡垒，士兵都出生入死。"},{"english":"Soldiers go through fire and water together in the battlefield.","chinese":"战士们在战场上出生入死。"}],"related":[{"definition":["shared delights and common hardships (idiom); to share life's joys and sorrows\/for better or for worse"],"pinyin":["tong2 gan1 gong4 ku3"],"word":"同甘共苦"},{"definition":["to share joys and sorrows\/sharing good times and hard times\/same as 同甘共苦"],"pinyin":["tong2 gan1 ku3"],"word":"同甘苦"},{"definition":["as close as one's hands and feet (idiom); loving one another as brothers\/deep friendship\/closely attached to one another"],"pinyin":["qing2 tong2 shou3 zu2"],"word":"情同手足"},{"definition":["fellow soldier"],"pinyin":["pao2 ze2"],"word":"袍泽"},{"definition":["bravery with no thought of personal safety (idiom); risking life and limb\/undaunted by perils"],"pinyin":["she3 sheng1 wang4 si3"],"word":"舍生忘死"},{"definition":["loyal and devoted (idiom); faithful and true"],"pinyin":["zhong1 xin1 geng3 geng3"],"word":"忠心耿耿"},{"definition":["a friend in times of tribulations (idiom); a friend in need is a friend indeed"],"pinyin":["huan4 nan4 zhi1 jiao1"],"word":"患难之交"},{"definition":["to charge and break through enemy lines"],"pinyin":["chong1 feng1 xian4 zhen4"],"word":"冲锋陷阵"},{"definition":["blood-soaked"],"pinyin":["yu4 xue4"],"word":"浴血"},{"definition":["to go through water and tread on fire (idiom); not afraid of any difficulty"],"pinyin":["fu4 tang1 dao3 huo3"],"word":"赴汤蹈火"},{"definition":["to attack the enemy"],"pinyin":["sha1 di2"],"word":"杀敌"},{"definition":["to treat one another with absolute sincerity (idiom); to show total devotion"],"pinyin":["gan1 dan3 xiang1 zhao4"],"word":"肝胆相照"},{"definition":["to throw one's life in for\/to haplessly give one's life for\/to sacrifice oneself torturously working for another or for a group\/to pour in one's utmost effort\/to shed one's last ounce of strength for"],"pinyin":["mai4 ming4"],"word":"卖命"},{"definition":["troops under one's command\/subordinate"],"pinyin":["bu4 xia4"],"word":"部下"},{"definition":["to die in battle (idiom)"],"pinyin":["zhan4 si3 sha1 chang3"],"word":"战死沙场"},{"definition":["as close as brothers (idiom); deep friendship"],"pinyin":["qin1 ru2 shou3 zu2"],"word":"亲如手足"}]}