{"definition":["hemorrhagic"],"pinyin":["chu1 xue4 xing4"],"traditional":["出血性"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"出血性","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["blood\/colloquial pr. [xie3]\/CL:滴[di1],片[pian4]"],"pinyin":["xue4"],"word":"血"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[{"definition":["dengue hemorrhagic fever (DHF)"],"pinyin":["chu1 xue4 xing4 deng1 ge2 re4"],"word":"出血性登革热"}],"sentences":[{"english":"Objective To study the diagnostic method and bleeding mechanism of the hemorrhagic moyamoya disease.","chinese":"目的研究出血性烟雾病的出血机制及检查诊断方法。"},{"english":"This paper summarized professor Wang Zuo's experience in the treatment of acute hemorrhagic apoplexy.","chinese":"总结王左教授对急性出血性中风的认识。"},{"english":"Objective To appraise the clinic effect of mini-invasive drainage on hemorrhages cerebral apoplexy with herniation.","chinese":"探讨微创穿刺引流对出血性脑卒中并脑疝的治疗价值。"},{"english":"Objective To explore the etiological factor and diagnostic method of Moyamoya disease.","chinese":"目的研究出血性烟雾病的出血机制及检查诊断方法。"},{"english":"Metastases may lead to a hemorrhagic pericarditis.","chinese":"转移性肿瘤可导致出血性心包炎。"},{"english":"Objictive Treatment of 15 patients with intracranial hemorrhagic cerebral vascular diseases with stent grafts.","chinese":"目的初步应用带膜支架治疗出血性脑血管病15例。"},{"english":"Thrombocytopenia is one of the most common bleeding disorders of animals.","chinese":"血小板减少症是动物最常见的出血性疾病之一。"},{"english":"Bleeding esophageal varices may be the first manifestation of cirrhosis.","chinese":"出血性食管静脉曲张可能是肝硬化的首要表现。"},{"english":"Most fatalities occur in patients who develop the haemorrhagic icterus form.","chinese":"大多数死亡是有出血性黄疸症状的患者。"},{"english":"It has two distinct presentations, acute hemorrhagic enteritis and non-suppurative myocarditis.","chinese":"以急性出血性肠炎和非化脓性心肌炎为特征。"},{"english":"It occurs when twisting of the spermatic cord cuts off the venous drainage, leading to hemorrhagic infarction.","chinese":"精索扭转阻断静脉回流就会导致出血性梗死。"},{"english":"But it did not measurably raise the risk of the other major type, hemorrhagic stroke, in which a blood vessel leaks or bursts open.","chinese":"但沮丧不会导致出血性中风即血管泄露或血管爆裂。"},{"english":"Here is a cerebral infarct from an arterial embolus, which often leads to a hemorrhagic appearance.","chinese":"动脉栓子引起的脑梗死，常导致出血性外观。"},{"english":"But it can result in bleeding, which hold back its use in anti-inflammation.","chinese":"但因其潜在的出血性限制了它在抗炎方面的应用。"},{"english":"The incidence of hemorrhagic lacunar syndrome causes, mainly caused by high blood pressure.","chinese":"出血性腔隙综合征的发病原因，主要由高血压引起。"},{"english":"Objective To summarize the experience for microsurgery treatment of spontaneous supratentorial intracerebral haematoma .","chinese":"目的探讨自发性出血性脑卒中的显微外科治疗方法。"}],"related":[{"definition":["acute"],"pinyin":["ji2 xing4"],"word":"急性"},{"definition":["to bleed\/bleeding\/(fig.) to spend money in large amounts"],"pinyin":["chu1 xue4"],"word":"出血"},{"definition":["blockage\/obstruction\/infarction"],"pinyin":["geng3 si3"],"word":"梗死"},{"definition":["focal (medicine)"],"pinyin":["ju2 zao4 xing4"],"word":"局灶性"},{"definition":["purulent (containing pus)\/septic"],"pinyin":["hua4 nong2 xing4"],"word":"化脓性"},{"definition":["thrombosis"],"pinyin":["shuan1 se4"],"word":"栓塞"},{"definition":["deadly\/terminal"],"pinyin":["zhi4 si3 xing4"],"word":"致死性"},{"definition":["hematoma\/swelling of soft tissue due to internal hemorrhage"],"pinyin":["xue4 zhong3"],"word":"血肿"},{"definition":["encephalitis"],"pinyin":["nao3 yan2"],"word":"脑炎"},{"definition":["septicaemia"],"pinyin":["bai4 xue4 zheng4"],"word":"败血症"},{"definition":["inflammatory (medicine)"],"pinyin":["yan2 xing4"],"word":"炎性"},{"definition":["pathological changes\/lesion\/diseased (kidney, cornea etc)"],"pinyin":["bing4 bian4"],"word":"病变"},{"definition":["myocarditis"],"pinyin":["xin1 ji1 yan2"],"word":"心肌炎"},{"definition":["internal bleeding\/internal hemorrhage"],"pinyin":["nei4 chu1 xue4"],"word":"内出血"},{"definition":["clinical characteristic\/diagnostic trait"],"pinyin":["lin2 chuang2 te4 zheng1"],"word":"临床特征"},{"definition":["cerebral edema"],"pinyin":["nao3 shui3 zhong3"],"word":"脑水肿"}]}