{"definition":["to fund\/to put money into sth\/to invest"],"pinyin":["chu1 zi1"],"traditional":["出資"],"rank":3658.0,"normalized_rank":0.05118016593678732,"fraction":0.00003707393789412492,"cumulative_fraction":0.8186278370418388,"word":"出资","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["resources\/capital\/to provide\/to supply\/to support\/money\/expense"],"pinyin":["zi1"],"word":"资"}],"containing_words":[],"sentences":[{"english":"It actually has a much greater chance of fulfilling our stakeholder's needs.","chinese":"实际上，它还大大增加了满足出资方需要的机会。"},{"english":"We have decided to invest in some new video-conferencing equipment.","chinese":"我们决定出资购买一些视频会议设备。"},{"english":"The free shares shall refer to the shares obtained without making contribution.","chinese":"干股是指未出资而获得的股份。"},{"english":"to review and verify company regulations of wholly state-owned enterprises financed by the Commission.","chinese":"承办所出资的国有独资公司章程的审核工作。"},{"english":"When there's no profit I can't fund new projects and sign new artists.","chinese":"如果赚不到钱，我无法为新项目出资，无法签下新人。"},{"english":"The new dam is a major construction project, funded by the government.","chinese":"新水坝是政府出资建造的一个大工程项目。"},{"english":"Libbey, who died in 1925, endowed the Toledo Museum of Art.","chinese":"1925年逝世的利贝出资成立了托雷多艺术博物馆。"},{"english":"Other guilds will offer to set p shop in your cities depending on the govenor and your actions.","chinese":"别的行会将会根据你的政府和义举来出资建立商店。"},{"english":"For the registration of establishment of an investee company, equities shall not be used for making an initial contribution.","chinese":"被投资公司设立登记的，股权不能作为其首期出资。"},{"english":"This is a dormitory in Thailand that my mom and dad underwrote. And every year about 30 students.","chinese":"这是在泰国的一个由我的妈妈和爸爸出资的学生寝室。"},{"english":"At the same year should a of the Japanese Jin friend meeting invite, leaving for the day to hold personal calligraphy exhibition.","chinese":"同年应日本晋友会出资邀请，赴日举行个人书法展。"},{"english":"This study was funded by private industry, including companies that produce the compounds being studied.","chinese":"该研究有私人产业出资，包括生产这些复合物的公司。"},{"english":"Who owns it, or sponsors its development?","chinese":"谁拥有它，或谁为它的开发出资？"},{"english":"With raid growth of the economy, human capital investment becomes the general trend.","chinese":"随着经济的高速发展，人力资本出资已经是大势所趋。"},{"english":"The foundation is the sole funder of the committee.","chinese":"独立调查委员会由该基金会独家出资创建。"},{"english":"Section two analyzes the criterion for the objects of the non-cash contribution.","chinese":"第二部分探讨作为非货币出资的财产应符合哪些标准。"}],"related":[{"definition":["to inject funds\/to put money into (the market)"],"pinyin":["zhu4 zi1"],"word":"注资"},{"definition":["equity participation (finance)"],"pinyin":["can1 gu3"],"word":"参股"},{"definition":["equity shares\/stock right"],"pinyin":["gu3 quan2"],"word":"股权"},{"definition":["wholly-owned (often by foreign company)\/exclusive investment"],"pinyin":["du2 zi1"],"word":"独资"},{"definition":["to raise resources"],"pinyin":["chou2 zi1"],"word":"筹资"},{"definition":["to invest"],"pinyin":["ru4 gu3"],"word":"入股"},{"definition":["to raise money\/to accumulate funds"],"pinyin":["ji2 zi1"],"word":"集资"},{"definition":["to own a controlling number of shares in a company"],"pinyin":["kong4 gu3"],"word":"控股"},{"definition":["capital increase"],"pinyin":["zeng1 zi1"],"word":"增资"},{"definition":["to spend\/to allocate funds"],"pinyin":["chi4 zi1"],"word":"斥资"},{"definition":["consideration (in exchange for shares)\/a quid pro quo"],"pinyin":["dui4 jia4"],"word":"对价"},{"definition":["shareholder\/stockholder"],"pinyin":["gu3 dong1"],"word":"股东"},{"definition":["a share (in a company)\/stock"],"pinyin":["gu3 fen4"],"word":"股份"},{"definition":["to undertake to purchase sth\/to subscribe (to share issue)"],"pinyin":["ren4 gou4"],"word":"认购"},{"definition":["funds\/a sum of money\/CL:宗[zong1]"],"pinyin":["kuan3 xiang4"],"word":"款项"},{"definition":["to transfer (ownership, rights etc)"],"pinyin":["zhuan3 rang4"],"word":"转让"}]}