{"definition":["to appear personally\/to step in\/to step forth\/to show up"],"pinyin":["chu1 mian4"],"traditional":["出面"],"rank":6688.0,"normalized_rank":0.09357379709820493,"fraction":0.00001578412285970014,"cumulative_fraction":0.8917594015561818,"word":"出面","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["flour\/noodles\/(of food) soft (not crunchy)\/(slang) (of a person) ineffectual\/spineless","variant of 麵|面[mian4]","face\/side\/surface\/aspect\/top\/classifier for flat surfaces such as drums, mirrors, flags etc"],"pinyin":["mian4","mian4","mian4"],"word":"面"}],"containing_words":[],"sentences":[{"english":"Like before, government officials will speak to boost market sentiment.","chinese":"像以前一样，政府官员会出面安慰市场情绪。"},{"english":"Shimizu is her bodyguard and will move in if there are problems.","chinese":"清水是她的保镖，一旦出现问题，便由他出面解决。"},{"english":"More promising may be mooted government support for credit insurance.","chinese":"一个更有前景的措施是政府出面提供贷款信用保证。"},{"english":"He has been asked to adjudicate in the disagreement between the city council and the citizens.","chinese":"请他出面仲裁市议会和市民之间的分歧。"},{"english":"Perhaps there was still time to intervene in behalf of that man.","chinese":"可能还来得及由他出面说一下情？"},{"english":"Liverpool FC's chairman Martin Broughton and managing director Christian Purslow were also in the High Court.","chinese":"俱乐部主席布劳顿和总经理帕斯洛同样在高法出面。"},{"english":"Trade talks are to be held by nongovernmental organizations of both sides.","chinese":"双方由民间团体出面商谈贸易。"},{"english":"The United States is now best placed to secure an accord.","chinese":"现在是美国出面让双方达成协议的最佳时机。"},{"english":"If our country loves its people, it should stand up for them.","chinese":"如果国家是爱人民的，它应该为他们出面。"},{"english":"By a party or by the multi-party appear to lead a society.","chinese":"由某个政党或由多党出面来领导一个社会。"},{"english":"The doubters, in fact, have already come forward.","chinese":"事实上，持怀疑观点的人已经出面放话了。"},{"english":"Finally, a female investigator from the Ministry of Justice saved the day.","chinese":"最后法务部一位女调查官出面解救这个困境。"},{"english":"Then the Chinese government intervened and banned on-site butchery.","chinese":"后来，中国政府出面干预并禁止了现场屠杀。"},{"english":"Cong ex-boyfriend Jiang Dawei, said he is willing to accept the plexus.","chinese":"丛前男友姜大伟出面，表示自己愿意接纳丛。"},{"english":"She hoped that the length of one school can come forward to stop Dr.","chinese":"她希望一校之长的胡博士能出面制止。"},{"english":"Disclosure matters, the three \"heavyweights\" have come forward to explain.","chinese":"事情披露后，三位“重量级人物”纷纷出面解释。"}],"related":[{"definition":["to intercede\/to plead for sb else"],"pinyin":["shuo1 qing2"],"word":"说情"},{"definition":["to get involved in\/to meddle\/interference"],"pinyin":["cha1 shou3"],"word":"插手"},{"definition":["to set out (on a campaign)\/to stand for election\/to throw one's cap in the ring"],"pinyin":["chu1 ma3"],"word":"出马"},{"definition":["to reconcile\/to mediate\/to bring warring parties to agreement\/to arbitrate"],"pinyin":["tiao2 ting2"],"word":"调停"},{"definition":["to be fair\/to be impartial\/to settle (a matter etc)"],"pinyin":["bai3 ping2"],"word":"摆平"},{"definition":["to help\/to lend a hand\/to do a favor\/to do a good turn"],"pinyin":["bang1 mang2"],"word":"帮忙"},{"definition":["to negotiate (with)\/to have dealings (with)"],"pinyin":["jiao1 she4"],"word":"交涉"},{"definition":["to mediate (a conflict etc)"],"pinyin":["wo4 xuan2"],"word":"斡旋"},{"definition":["to plea for leniency\/to ask for a favor"],"pinyin":["qiu2 qing2"],"word":"求情"},{"definition":["to persuade\/to convince\/to talk sb over\/Taiwan pr. [shui4 fu2]"],"pinyin":["shuo1 fu2"],"word":"说服"},{"definition":["to inspire\/to incite"],"pinyin":["shou4 yi4"],"word":"授意"},{"definition":["see 作主[zuo4 zhu3]"],"pinyin":["zuo4 zhu3"],"word":"做主"},{"definition":["to declare one's position\/to say where one stands"],"pinyin":["biao3 tai4"],"word":"表态"},{"definition":["intermediary\/mediator"],"pinyin":["zhong1 jian1 ren2"],"word":"中间人"},{"definition":["to persuade\/persuasion\/to advise"],"pinyin":["quan4 shuo1"],"word":"劝说"},{"definition":["to sb's face\/in sb's presence"],"pinyin":["dang1 mian4"],"word":"当面"}]}