{"definition":["to divide sth into (parts)\/to subdivide"],"pinyin":["fen1 wei2"],"traditional":["分為"],"rank":2855.0,"normalized_rank":0.039945154114141006,"fraction":0.0000511380063765109,"cumulative_fraction":0.7835505868210587,"word":"分为","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen4","fen1"],"word":"分"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"}],"containing_words":[{"definition":["one divides into two\/to be two-sided\/there are two sides to everything\/to see both sb's good points and shortcomings (idiom)"],"pinyin":["yi1 fen1 wei2 er4"],"word":"一分为二"}],"sentences":[{"english":"The dissertation consists of introduction and four parts.","chinese":"全文分为绪论和四个主要章节。"},{"english":"To hit(a ball) into the air just beyond the infield.","chinese":"棒球场分为内场和外场。"},{"english":"Spread foundations generally can be classified as wall and column footings.","chinese":"扩展基础通常可分为墙基和柱基。"},{"english":"The piece is in one movement divided into three parts.","chinese":"全曲只有一个乐章而分为三个部分。"},{"english":"It is divided into two parts: principal structure and ecological structure.","chinese":"哭嫁歌分为主体结构和生态结构两个部分。"},{"english":"The first part introduces the outline of our traffic developing in Changde.","chinese":"第三部分为常德市交通违法的防控策略。"},{"english":"This part is also the key point of this article. It is divides into three aspects.","chinese":"该部分也是本文的重点所在，分为三个方面。"},{"english":"Divided into two sub-type mold, plastic parts in the top and vertical center.","chinese":"模具分为两次分型，分别在塑件顶部和竖直中心。"},{"english":"Chinese gardens can be divided into two categories,  the imperial and the private.","chinese":"中国园林可分为御花园和私家花园两类。"},{"english":"According to this, germplasms were classified into two types, that was maintainer lines and restoring lines .","chinese":"据此将香稻资源分为保持系和恢复系两类。"},{"english":"The spermatid differentiation can be divided into five stages.","chinese":"精细胞的分化可分为五个时期。"},{"english":"The building consists of two parts as visitor center and rural guest houses.","chinese":"该建筑分为游客中心和乡村客舍两部分。"},{"english":"Each Ojibwa tribe was divided into migratory bands.","chinese":"奥吉布瓦人各部落都分为若干迁徙性家族。"},{"english":"Likwise, the sensilla auricillica also can be subdivided into two distinct types(type A and type B).","chinese":"耳形感器根据其形态也可分为A型和B型两类。"},{"english":"There are two ways in structuring handwritten documents, off-line and on-line.","chinese":"目前关于手写文档的结构化，分为联机和脱机两种。"},{"english":"Generally speaking, ceramics product can is classified into two categories: practical and artistic.","chinese":"一般来说，陶瓷产品可以分为两类，即。"}],"related":[{"definition":["can be divided (into parts)\/one can distinguish (several types)"],"pinyin":["ke3 fen1"],"word":"可分"},{"definition":["to divide (into)\/to split a bonus\/to break into\/tenths\/percentage allotment"],"pinyin":["fen1 cheng2"],"word":"分成"},{"definition":["to divide up\/to partition\/to differentiate"],"pinyin":["hua4 fen1"],"word":"划分"},{"definition":["to be collectively called\/collective term\/general designation"],"pinyin":["tong3 cheng1"],"word":"统称"},{"definition":["classification"],"pinyin":["fen1 lei4"],"word":"分类"},{"definition":["more or less\/roughly\/approximately"],"pinyin":["da4 zhi4"],"word":"大致"},{"definition":["as the name implies"],"pinyin":["gu4 ming2 si1 yi4"],"word":"顾名思义"},{"definition":["main\/principal\/major\/primary"],"pinyin":["zhu3 yao4"],"word":"主要"},{"definition":["to differentiate\/to draw a distinction\/to divide into categories"],"pinyin":["qu1 fen1"],"word":"区分"},{"definition":["classification\/category"],"pinyin":["lei4 bie2"],"word":"类别"},{"definition":["to contain\/to embody\/to include"],"pinyin":["bao1 han2"],"word":"包含"},{"definition":["generic term"],"pinyin":["zong3 cheng1"],"word":"总称"},{"definition":["in general\/more or less\/in rough terms\/basically\/on the whole\/overall situation\/the big picture\/(Tw) remains (of a dead person)"],"pinyin":["da4 ti3"],"word":"大体"},{"definition":["also called\/also known as\/a.k.a."],"pinyin":["huo4 cheng1"],"word":"或称"},{"definition":["same type\/category 1 (i.e. class A)"],"pinyin":["yi1 lei4"],"word":"一类"},{"definition":["to comprise\/to include\/to involve\/to incorporate\/to consist of"],"pinyin":["bao1 kuo4"],"word":"包括"}]}