{"definition":["to share (let others have some of sth good)"],"pinyin":["fen1 xiang3"],"traditional":["分享"],"rank":3476.0,"normalized_rank":0.04863374980761966,"fraction":0.00003993787295552916,"cumulative_fraction":0.8116117769863752,"word":"分享","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen4","fen1"],"word":"分"},{"definition":["to enjoy\/to benefit\/to have the use of","old variant of 享[xiang3]"],"pinyin":["xiang3","xiang3"],"word":"享"}],"containing_words":[],"sentences":[{"english":"Love the daing music, Thanks.","chinese":"谢谢分享，非常喜欢。"},{"english":"He told me that he had something grand to show meand share with me.","chinese":"他告诉我说他有一样很棒的东西给我看，要与我分享。"},{"english":"This point is a related one to the financial advice Jason shares in his answer.","chinese":"这一点跟Jason分享的经融方面的建议有关。"},{"english":"The SafeHouse is a place for people of different faiths to share and support each other.","chinese":"是一个让来自不同信仰的人士分享及互相支持的天地。"},{"english":"Share your success with people, instead of pocketing it all.","chinese":"与人分享，而不要独守成功。"},{"english":"Walton will continue to split time with Radmanovic.","chinese":"沃顿将继续和拉德马诺维奇分享上场时间。"},{"english":"However, some help with chores and contributions to shared food are expected.","chinese":"然而，客人可以帮忙做些家务活，一起分享食物。"},{"english":"Shared laughter creates a bond of friendships.","chinese":"分享欢笑创造友谊的结合力。"},{"english":"Almost all share physical traits and mannerisms with their parents.","chinese":"几乎所有孩子都分享他们的父母亲的身体特征和习性。"},{"english":"Online photo sharing website but based on your real-life social network.","chinese":"根据你的现实社会关系来在线分享照片网站。"},{"english":"Thanks to the many talented people who have shared their recipes with us.","chinese":"在此还要感谢曾经与我们分享这些原创食谱的天才们。"},{"english":"Alkenes have one or more double bonds between carbon atoms, where two pairs of electrons are shared.","chinese":"链烯有一个或多个共价键，即碳原子分享两对电子。"},{"english":"\"Ubuntu\" is an ancient African word that means \"humanity to others\".","chinese":"“乌班图”是古非洲词语，意思是“与人分享”。"},{"english":"Do you share what God is doing in your life with your spouse, and visa-versa?","chinese":"你们彼此分享上帝在你们生命中的见证吗？"},{"english":"For others it is merely a way to share in a centuries-old tradition.","chinese":"对另外一些人而言，爆竹纯粹是分享一种悠久的传统。"},{"english":"Clinton and Mezvinsky share a special moment at the altar.","chinese":"克林顿和梅兹文斯基在圣坛分享这个特别的时刻。"}],"related":[{"definition":["to leave a message\/to leave one's comments\/message"],"pinyin":["liu2 yan2"],"word":"留言"},{"definition":["to sticky (an Internet forum thread etc)"],"pinyin":["zhi4 ding3"],"word":"置顶"},{"definition":["dried food (including dried fruits, mushrooms and seafoods such as shrimp and abalone)\/(fig.) (coll.) knowledge presented in readily assimilable form\/just what you want to know: no more, no less (no 水分[shui3 fen1])"],"pinyin":["gan1 huo4"],"word":"干货"},{"definition":["server push (computing)"],"pinyin":["tui1 song4"],"word":"推送"},{"definition":["to transmit\/to forward (mail, SMS, packets of data)\/to pass on\/to republish (an article from another publication)"],"pinyin":["zhuan3 fa1"],"word":"转发"},{"definition":["what one has learned (through experience, reading etc)\/knowledge\/insight\/understanding\/tips\/CL:項|项[xiang4],個|个[ge4]"],"pinyin":["xin1 de2"],"word":"心得"},{"definition":["private correspondence\/personal letter\/(computing) personal message (PM)\/to message sb"],"pinyin":["si1 xin4"],"word":"私信"},{"definition":["to like (an online post on Weibo, Facebook etc)"],"pinyin":["dian3 zan4"],"word":"点赞"},{"definition":["article\/essay\/literary works\/writings\/hidden meaning\/CL:篇[pian1],段[duan4],頁|页[ye4]"],"pinyin":["wen2 zhang1"],"word":"文章"},{"definition":["Moments (social networking function of smartphone app WeChat 微信[Wei1 xin4])"],"pinyin":["Peng2 you5 quan1"],"word":"朋友圈"},{"definition":["to interact\/interactive"],"pinyin":["hu4 dong4"],"word":"互动"},{"definition":["friend\/CL:個|个[ge4],位[wei4]"],"pinyin":["peng2 you5"],"word":"朋友"},{"definition":["everyone\/influential family\/great expert"],"pinyin":["da4 jia1"],"word":"大家"},{"definition":["to exchange\/exchange\/communication\/interaction\/to have social contact (with sb)"],"pinyin":["jiao1 liu2"],"word":"交流"},{"definition":["to pay attention to\/to follow sth closely\/to follow (on social media)\/concern\/interest\/attention"],"pinyin":["guan1 zhu4"],"word":"关注"},{"definition":["Have a nice weekend!"],"pinyin":["zhou1 mo4 yu2 kuai4"],"word":"周末愉快"}]}