{"definition":["to part or leave each other\/to distinguish\/difference\/in different ways\/differently\/separately or individually"],"pinyin":["fen1 bie2"],"traditional":["分別"],"rank":454.0,"normalized_rank":0.006352049025506135,"fraction":0.0003115079349986321,"cumulative_fraction":0.4986732581789682,"word":"分别","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen4","fen1"],"word":"分"},{"definition":["surname Bie","to leave\/to depart\/to separate\/to distinguish\/to classify\/other\/another\/don't ...!\/to pin\/to stick (sth) in","to make sb change their ways, opinions etc"],"pinyin":["Bie2","bie2","bie4"],"word":"别"}],"containing_words":[],"sentences":[{"english":"The samples of tungsten carbide were prepared from the blue tungsten trioxide and the ammonium paratungstate Separately.","chinese":"用蓝色氧化钨和仲钨酸铵分别制取碳化钨。"},{"english":"Divided into two sub-type mold, plastic parts in the top and vertical center.","chinese":"模具分为两次分型，分别在塑件顶部和竖直中心。"},{"english":"Over the next few years, the couple worked, raised their children—Isabel andEli, who were seven and ten years old when their grandfather moved in—and cared for Winokur’s father.","chinese":"孩子们的祖父搬来时他们分别有7岁和10岁。"},{"english":"Other chapters are available in our e-Library.","chinese":"在随后的章节里，我们将分别考察每一个因素。"},{"english":"The use of drugs is individualized for every patient.","chinese":"对每个病人分别用药。"},{"english":"For search engines, mainly Baidu and GG, respectively, please answer.","chinese":"针对搜索引擎，主要是百度和GG，请分别解答。"},{"english":"Raw materials and Packaging materials warehouses are located in rooms W2 and W7, respectively.","chinese":"原材料和包装材料仓库分别位于W2和W7室。"},{"english":"Fix of the console output, resp.","chinese":"修复控制台的输出，分别。"},{"english":"When the women reached age 40, Leupp measured their levels of depression .","chinese":"等到她们40岁时，莱普分别测试她们的抑郁程度。"},{"english":"On the two sides of the Heaven Palace are Bell Tower and Runner Tibet.","chinese":"天王殿两侧分别是钟楼和转轮藏。"},{"english":"The discharges of phrenic nerve and the curve of respiration were recorded.","chinese":"分别记录对照组和模型组大鼠膈神经放电及呼吸曲线。"},{"english":"The velocity distributions previously shown were for a single angle of attack.","chinese":"先前的速度分布列分别为单一迎角。"},{"english":"I went there two times, one is in summer, and the other is in winter.","chinese":"我分别在夏天和冬天两次走进蔚县。"},{"english":"The parents after parting company for placatory I, give me more love respectively.","chinese":"分手后的父母为了抚慰我，分别给予我更多的爱。"},{"english":"In the second group Benidipine, Hydrochloride was used for 6 weeks.","chinese":"各小组分别用生理盐水或盐酸贝尼地平灌胃6周。"},{"english":"He made samplings of the different materials on the very day.","chinese":"他当天对那些不同的材料分别进行了抽样检验。"}],"related":[{"definition":["in order\/in succession"],"pinyin":["yi1 ci4"],"word":"依次"},{"definition":["among\/in\/included among these"],"pinyin":["qi2 zhong1"],"word":"其中"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["to sum up to\/to total"],"pinyin":["gong4 ji4"],"word":"共计"},{"definition":["common\/general\/to share\/together\/total\/altogether\/abbr. for 共產黨|共产党[Gong4 chan3 dang3], Communist party"],"pinyin":["gong4"],"word":"共"},{"definition":["to divide into rows\/to identify subcategories\/to break down into constituent parts\/breakdown\/disaggregation"],"pinyin":["fen1 lie4"],"word":"分列"},{"definition":["to have altogether\/in all"],"pinyin":["gong4 you3"],"word":"共有"},{"definition":["the rest\/the others\/remaining\/remainder\/apart from them"],"pinyin":["qi2 yu2"],"word":"其余"},{"definition":["altogether"],"pinyin":["yi1 gong4"],"word":"一共"},{"definition":["equal\/even\/all\/uniform"],"pinyin":["jun1"],"word":"均"},{"definition":["early or late\/priority\/in succession\/one after another"],"pinyin":["xian1 hou4"],"word":"先后"},{"definition":["to add up the total\/to figure what sth amounts to\/to consider"],"pinyin":["he2 ji4"],"word":"合计"},{"definition":["to follow closely behind sb or sth (idiom)"],"pinyin":["jin3 sui2 qi2 hou4"],"word":"紧随其后"},{"definition":["(grand) total"],"pinyin":["zong3 ji4"],"word":"总计"},{"definition":["to stand side by side\/to be juxtaposed"],"pinyin":["bing4 lie4"],"word":"并列"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"}]}