{"definition":["branch"],"pinyin":["fen1 zhi1"],"traditional":["分枝"],"rank":46453.0,"normalized_rank":0.6499377387265121,"fraction":2.068502972633579e-7,"cumulative_fraction":0.998342811179652,"word":"分枝","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen4","fen1"],"word":"分"},{"definition":["branch\/classifier for sticks, rods, pencils etc"],"pinyin":["zhi1"],"word":"枝"}],"containing_words":[],"sentences":[{"english":"Objective To explore the value of acid-fast stain test of mycobacterium tuberculosis in the diagnosis of pulmonary tuberculosis.","chinese":"目的了解结核分枝杆菌抗酸染色对肺结核的诊断价值。"},{"english":"The shrimp hepatopancreas consists of a lot of epithelial tubules which are symmetrical.","chinese":"肝胰腺由两侧对称的分枝上皮小管组成。"},{"english":"The prothalli are saprophytic, irregularly branched, subterranean bodies .","chinese":"原叶体是腐生的，不规则分枝的地下体。"},{"english":"Seen here are branching hyphae of Aspergillus invading a cerebral vessel.","chinese":"图示曲霉菌的分枝状菌丝正侵入脑血管。"},{"english":"A branch-and bound method is developed to solve the proposed model.","chinese":"设计了基于分枝定界法的算法来求解该模型。"},{"english":"Panicle branches proximally smooth or sparsely scabrid angled.","chinese":"圆锥花序分枝下部的平滑的或疏生粗糙的有棱。"},{"english":"Plants many branched, forming a compact cushion of leafy shoots.","chinese":"植株多分枝，形成一个叶状枝的小型垫。"},{"english":"The sputum acid-fast stain showed positive (one plus) and the culture yielded nontuberculous mycobacterium.","chinese":"痰液抗酸性涂片为阳性且培养结果为非结核分枝杆菌。"},{"english":"Conclusion: Among the six ingredient of Croton oil, The 5th part has the best effect on killing Mycobacterium tuberculosis in vitro.","chinese":"巴豆油抗结核分枝杆菌作用的主要成分为第5组份。"},{"english":"In such cases suitable feathers should be retained or left unpruned .","chinese":"在这种情况下，应该保留合适的分枝不行修剪。"},{"english":"Objective To evaluate the effect of nine fluoroquinolones against mycobacteria .","chinese":"目的研究氟喹诺酮类药物抗分枝杆菌的作用。"},{"english":"Each branch of the tree corresponds to a facet of the metadata.","chinese":"树的每个分枝都对应于元数据的一个方面。"},{"english":"Batsch cv. Elberta) were compared with different pruning measures.","chinese":"不同母枝上的分枝模式进行了比较研究。"},{"english":"Sichuan Grain Storage Institute, Ministry of commerce The stored product mites is one of the three breaches in acarology.","chinese":"储藏物螨类是蜱螨学三大分枝学科之一。"},{"english":"It is also very easy to add new information on lines anywhere in the map.","chinese":"这样非常易于添加新的信息到思维脑图的分枝上。"},{"english":"The cultivar has ramose crown and upright tree appearance.","chinese":"树冠分枝形，树姿直立。"}],"related":[{"definition":["stem\/stalk"],"pinyin":["jing1 gan1"],"word":"茎干"},{"definition":["axillary bud\/bud growing from axil of plant"],"pinyin":["ye4 ya2"],"word":"腋芽"},{"definition":["branch\/twig\/stem"],"pinyin":["zhi1 tiao2"],"word":"枝条"},{"definition":["(botany) stolon"],"pinyin":["pu2 fu2 jing1"],"word":"匍匐茎"},{"definition":["lateral root (botany)"],"pinyin":["ce4 gen1"],"word":"侧根"},{"definition":["terminal bud (growing at the tip of a plant)"],"pinyin":["ding3 ya2"],"word":"顶芽"},{"definition":["petiole\/leafstalk"],"pinyin":["ye4 bing3"],"word":"叶柄"},{"definition":["aerial root (botany)"],"pinyin":["qi4 sheng1 gen1"],"word":"气生根"},{"definition":["stem of flower"],"pinyin":["hua1 geng3"],"word":"花梗"},{"definition":["inflorescence\/flower cluster"],"pinyin":["hua1 xu4"],"word":"花序"},{"definition":["fibrous roots"],"pinyin":["xu1 gen1"],"word":"须根"},{"definition":["axillary bud"],"pinyin":["ce4 ya2"],"word":"侧芽"},{"definition":["plant (horticulture)"],"pinyin":["zhi2 zhu1"],"word":"植株"},{"definition":["branches and tendrils\/fig. overcomplicated or digressive"],"pinyin":["zhi1 man4"],"word":"枝蔓"},{"definition":["stalk\/stem\/CL:條|条[tiao2]"],"pinyin":["jing1"],"word":"茎"},{"definition":["tendril","tendril"],"pinyin":["juan3 xu1","juan3 xu1"],"word":"卷须"}]}