{"definition":["to do sth in batches or groups"],"pinyin":["fen1 pi1"],"traditional":["分批"],"rank":12033.0,"normalized_rank":0.1683572817707386,"fraction":0.000006086537152008263,"cumulative_fraction":0.9441217469594008,"word":"分批","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen4","fen1"],"word":"分"},{"definition":["to ascertain\/to act on\/to criticize\/to pass on\/classifier for batches, lots, military flights\/tier (for the ranking of universities and colleges)"],"pinyin":["pi1"],"word":"批"}],"containing_words":[],"sentences":[{"english":"I heard that partial shipment wasnt permitted.","chinese":"我听说不允许分批装运。"},{"english":"Accounting systems that assemble costs in this fashion are called job order costing systems.","chinese":"这样的成本会计系统就叫分批法。"},{"english":"Please amend your L\/C to allow partial shipment and transhipment.","chinese":"请修改你方信用证允许分批装运与转运。"},{"english":"The xylitol fermentation broth was carried out static state discoloring by using activated carbon.","chinese":"研究用活性碳对木糖醇发酵液的分批脱色。"},{"english":"After German unification, Soviet troops stationed in Germany starting from 1991, withdrew in groups.","chinese":"德国统一后，原驻德苏军从1991年开始分批撤离。"},{"english":"I batch the similar urgent tasks, then clear them at one go.","chinese":"我分批处理类似的紧急任务，然后一次处理完。"},{"english":"The technics conditions of batch fermentation were optimized by orthogonal test.","chinese":"通过正交试验，优化了分批发酵的最适工艺条件。"},{"english":"We deliver the money in mass or in instalments to the treasury.","chinese":"我们把钱整毛或分批送交金库。"},{"english":"Both of these two systems are widely used. We will describe the job order costing system first.","chinese":"这两种方法应用都很广泛，在此，我们先介绍分批法。"},{"english":"The prisoners were led out in batches and shot.","chinese":"这些囚犯被分批带出去枪毙了。"},{"english":"The retention bonuses are structured as a loan and deferred cash paid over three years.","chinese":"这笔留职金将在未来三年以现金方式分批支付。"},{"english":"The yield of acetic acid is high in the batch fermentation.","chinese":"应用于分批发酵试验产酸较高。"},{"english":"Would you accept delivery spread over a period of time?","chinese":"不知你们能在一段里分批交货？"},{"english":"Partial shipment or transshipment shall be permitted unless otherwise stated on the face hereof.","chinese":"应准许分批付运和转运，除非本合同正面另有规定。"},{"english":"Batch fermentation and fed-batch fermentation were carried out.","chinese":"进行了分批发酵和补料发酵。"},{"english":"In this thesis, the modeling and control of the penicillin fed-batchfermentation process were studied.","chinese":"本文主要研究青霉素补料分批发酵过程的建模与控制。"}],"related":[{"definition":["in advance\/beforehand\/premature\/front-end"],"pinyin":["xian1 qi1"],"word":"先期"},{"definition":["to precede others\/in advance"],"pinyin":["xian1 xing2"],"word":"先行"},{"definition":["to break up the whole into pieces (idiom); dealing with things one by one\/divide and conquer"],"pinyin":["hua4 zheng3 wei2 ling2"],"word":"化整为零"},{"definition":["barn\/granary\/storehouse\/cabin\/hold (in ship)"],"pinyin":["cang1"],"word":"仓"},{"definition":["to enter the venue\/to enter the arena\/(aviation) to approach the airfield\/(investing) to get into the market"],"pinyin":["jin4 chang3"],"word":"进场"},{"definition":["gradually\/one after another\/little by little"],"pinyin":["zhu2 ci4"],"word":"逐次"},{"definition":["remainder\/surplus"],"pinyin":["sheng4 yu2"],"word":"剩余"},{"definition":["to appoint a general (in theater)\/fig. to appoint sb for a task"],"pinyin":["dian3 jiang4"],"word":"点将"},{"definition":["in turn\/successively\/one after the other\/bit by bit"],"pinyin":["lu4 xu4"],"word":"陆续"},{"definition":["to assign (a task to different people)\/to allocate"],"pinyin":["fen1 pai4"],"word":"分派"},{"definition":["to rest and reorganize (military)"],"pinyin":["xiu1 zheng3"],"word":"休整"},{"definition":["one by one\/one after another"],"pinyin":["zhu2 ge4"],"word":"逐个"},{"definition":["to withdraw from\/to evacuate"],"pinyin":["che4 li2"],"word":"撤离"},{"definition":["to snatch time\/to rush\/to hurry (up)\/to seize the moment"],"pinyin":["zhua1 jin3 shi2 jian1"],"word":"抓紧时间"},{"definition":["to scatter\/to disperse\/to distribute"],"pinyin":["fen1 san4"],"word":"分散"},{"definition":["(do sth) on a large scale"],"pinyin":["da4 ju3"],"word":"大举"}]}