{"definition":["lit. to take different roads and urge the horses on (idiom)\/fig. to part ways"],"pinyin":["fen1 dao4 yang2 biao1"],"traditional":["分道揚鑣"],"rank":23592.0,"normalized_rank":0.3300826885677109,"fraction":0.000001686917456016488,"cumulative_fraction":0.9820642619517884,"word":"分道扬镳","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen4","fen1"],"word":"分"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"},{"definition":["abbr. for 揚州|扬州[Yang2 zhou1]\/surname Yang","to raise\/to hoist\/the action of tossing or winnowing\/scattering (in the wind)\/to flutter\/to propagate","variant of 揚|扬[yang2]"],"pinyin":["Yang2","yang2","yang2"],"word":"扬"},{"definition":["horsebit\/variant of 鏢|镖[biao1]"],"pinyin":["biao1"],"word":"镳"}],"containing_words":[],"sentences":[{"english":"From this place the party again diverged , according to their several fancies.","chinese":"这伙人根据各自的爱好，又从这里分道扬镳。"},{"english":"citing irreconcilable differences, one party will jilt the other sooner rather than later.","chinese":"无法调解的分歧很快就会使两党分道扬镳。"},{"english":"We parted wishing each other well.","chinese":"我们双方只能在互道祝福后分道扬镳。"},{"english":"Later in the evolution of whale hearing, the toothed and baleen whales parted ways.","chinese":"鲸豚听觉的演化到了后期，齿鲸与须鲸就分道扬镳了。"},{"english":"Horrified , Mr Chanes de Armas first punched him, then drifted away.","chinese":"震惊之余，阿马斯第一次开始抨击他，然后分道扬镳。"},{"english":"Dodonna and Tallon parted ways, with both going into hiding.","chinese":"多登纳和塔隆分道扬镳，都转入地下。"},{"english":"They divorced five years later.","chinese":"五年后，两人分道扬镳。"},{"english":"In a negatively curved, saddle-shaped universe, parallel beams would diverge.","chinese":"如果宇宙呈马鞍形反向弯曲，平行光线就会分道扬镳。"},{"english":"Finally, we went our separate ways.","chinese":"后来，我们分道扬镳。"},{"english":"I guess the only thing to do now is call a halt to this negotiation and part, friend.","chinese":"我想如今专一能做的便是制止会商，然后分道扬镳吧。"},{"english":"The two sides agreed not to criticize each other and went separate ways.","chinese":"双方达成一致，绝不相互指责，继而分道扬镳。"},{"english":"But then our visions of the future began to diverge and eventually we had a falling-out.","chinese":"可是我们对未来的愿景不同，最后只好分道扬镳。"},{"english":"Sun Yat-sen and Chen Jiongming soon split over the continuation of the Northern Expedition.","chinese":"孙逸仙和陈炯明不久就因继续北伐的事宜而分道扬镳。"},{"english":"Its open approach will be what sets the company apart from Microsoft.","chinese":"其开放的解决方案令其与微软分道扬镳。"},{"english":"We may as well exchange good-by and go separate ways.","chinese":"我们还是互道再见，分道扬镳吧。"},{"english":"Then they go their separate ways.","chinese":"然后他们就分道扬镳了。"}],"related":[{"definition":["to be estranged"],"pinyin":["xing2 tong2 mo4 lu4"],"word":"形同陌路"},{"definition":["the shrike and the swallow fly in different directions (idiom)\/(usually of a couple) to part from each other"],"pinyin":["lao2 yan4 fen1 fei1"],"word":"劳燕分飞"},{"definition":["to rupture\/to burst open\/to break\/to break off relations with\/a rupture"],"pinyin":["jue2 lie4"],"word":"决裂"},{"definition":["to become enemies (idiom); to fall out with sb"],"pinyin":["fan3 mu4 cheng2 chou2"],"word":"反目成仇"},{"definition":["to part on bad terms\/(of a meeting etc) to break up in discord"],"pinyin":["bu4 huan1 er2 san4"],"word":"不欢而散"},{"definition":["to quarrel\/to fall out with sb"],"pinyin":["fan3 mu4"],"word":"反目"},{"definition":["to go separate ways (idiom)\/to part ways with sb\/Taiwan pr. [ge4 ben1 dong1 xi1]"],"pinyin":["ge4 ben4 dong1 xi1"],"word":"各奔东西"},{"definition":["to disband\/(of a partnership, group etc) to break up"],"pinyin":["san4 huo3"],"word":"散伙"},{"definition":["(of marriage or business partners) to break up (idiom)\/to separate"],"pinyin":["yi1 pai1 liang3 san4"],"word":"一拍两散"},{"definition":["to have a falling out\/to have a big argument"],"pinyin":["nao4 fan1"],"word":"闹翻"},{"definition":["(literary) stranger"],"pinyin":["mo4 lu4"],"word":"陌路"},{"definition":["to forget previous differences\/to bury the hatchet"],"pinyin":["bing1 shi4 qian2 xian2"],"word":"冰释前嫌"},{"definition":["to part without hard feelings (idiom)\/to cut the knot as smoothly as you tied it"],"pinyin":["hao3 ju4 hao3 san4"],"word":"好聚好散"},{"definition":["incompatibility of temperament"],"pinyin":["xing4 ge2 bu4 he2"],"word":"性格不合"},{"definition":["to part company\/to split up\/to break up"],"pinyin":["fen1 shou3"],"word":"分手"},{"definition":["the appearance of unity, but divided at heart (idiom); seeming harmony belies underlying disagreement"],"pinyin":["mao4 he2 shen2 li2"],"word":"貌合神离"}]}