{"definition":["branch\/subsection\/to subdivide"],"pinyin":["fen1 bu4"],"traditional":["分部"],"rank":18237.0,"normalized_rank":0.2551592909210471,"fraction":0.0000028703580769861717,"cumulative_fraction":0.9702105072835135,"word":"分部","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen4","fen1"],"word":"分"},{"definition":["ministry\/department\/section\/part\/division\/troops\/board\/classifier for works of literature, films, machines etc"],"pinyin":["bu4"],"word":"部"}],"containing_words":[],"sentences":[{"english":"Are there chances for employees to be transferred to the oversea brach of the company?","chinese":"雇员有机会到公司设的海外分部工作吗？"},{"english":"P. of finance and strategy for Campbell Soup's North American division.","chinese":"康宝浓汤北美分部的金融与策略副总裁杰若罗德说。"},{"english":"Eppie Bang is a Senior Financial Analyst at The Nature Conservancy, Florida Chapter.","chinese":"莫慧秀覝任职大自然保护协会佛州分部高级财务分析。"},{"english":"He hopes that the company to dispatch him to the branch in Suzhou.","chinese":"他希望公司能将他调到调到苏州的分部。"},{"english":"Tropomyosin is further made up of three subunits.","chinese":"肌球蛋白是进一步弥补了三个分部。"},{"english":"The voice of the chapter leader goes slowly around the room.","chinese":"分部话事人的声音缓缓的回荡在房间中。"},{"english":"Boeing will be involved in the program through Boeing Rotorcraft Systems.","chinese":"波音公司将通过波音旋翼系统分部参与该计划。"},{"english":"Richard Suzman, director of the division of behavioral and social research at the National Institute on Aging.","chinese":"他是国家老年研究中心行为和社会研究分部的主任。"},{"english":"Know the course and parts of the deferent ducts.","chinese":"熟悉输精管的行程和分部。"},{"english":"The speed-difference control is critical for the automation of paper-making machines' sectional drive system.","chinese":"速差控制是纸机分部传动系统自动化的关键。"},{"english":"After three requests from the chapter leader, I will be ejected from the club.","chinese":"在分部话事人重复三次命令后，我将被逐出俱乐部。"},{"english":"Also introduced each part's construction and function of this welding machine system.","chinese":"介绍了该焊接机系统各分部的结构和功能。"},{"english":"Lincoln hoped the firm would transfer him to the Paris branch.","chinese":"林肯希望公司可以将他调到巴黎的分部工作。"},{"english":"And in various regions and counties and cities have branches or agents.","chinese":"且在各地区及各县市均有分部或代理商。"},{"english":"He is now a Chairman of Hong Kong Institution of Engineers, Building Division.","chinese":"邝先生现为香港工程师学会建造分部主席。"},{"english":"He wishes the company to dispatch him to the branch in Suzhou.","chinese":"他希望公司能将他调到调到苏州的分部。"}],"related":[{"definition":["general headquarters"],"pinyin":["zong3 bu4"],"word":"总部"},{"definition":["guild"],"pinyin":["gong1 hui4"],"word":"公会"},{"definition":["directly subordinate"],"pinyin":["zhi2 shu3"],"word":"直属"},{"definition":["one's affiliation (i.e. the organization one is affiliated with)\/subordinate (i.e. those subordinate to oneself)\/belonging to\/affiliated\/under one's command"],"pinyin":["suo3 shu3"],"word":"所属"},{"definition":["financial group"],"pinyin":["cai2 tuan2"],"word":"财团"},{"definition":["parent company\/head office"],"pinyin":["zong3 gong1 si1"],"word":"总公司"},{"definition":["chamber of commerce"],"pinyin":["shang1 hui4"],"word":"商会"},{"definition":["headquarters\/base camp"],"pinyin":["da4 ben3 ying2"],"word":"大本营"},{"definition":["senior figure\/elder\/doyen"],"pinyin":["yuan2 lao3"],"word":"元老"},{"definition":["geographical area of command\/(PLA) military district"],"pinyin":["jun1 qu1"],"word":"军区"},{"definition":["subsidiary\/auxiliary\/attached\/affiliated\/subordinate\/subordinating"],"pinyin":["fu4 shu3"],"word":"附属"},{"definition":["subsidiary company\/branch office"],"pinyin":["fen1 gong1 si1"],"word":"分公司"},{"definition":["stronghold\/defended military base\/base for operations\/strategic point\/foothold\/(market) presence"],"pinyin":["ju4 dian3"],"word":"据点"},{"definition":["station\/encampment"],"pinyin":["zhu4 di4"],"word":"驻地"},{"definition":["to dispatch (sb) in an official capacity\/to be posted (as an ambassador, foreign correspondent etc)"],"pinyin":["pai4 zhu4"],"word":"派驻"},{"definition":["labor union\/trade union\/CL:個|个[ge4]"],"pinyin":["gong1 hui4"],"word":"工会"}]}