{"definition":["to fit in with\/to suit\/appropriate"],"pinyin":["qie4 he2"],"traditional":["切合"],"rank":18379.0,"normalized_rank":0.2571460551536944,"fraction":0.0000028264188113007305,"cumulative_fraction":0.9706149051618128,"word":"切合","characters":[{"definition":["to cut\/to slice\/tangent (math)","definitely\/absolutely (not)\/(scoffing or dismissive interjection) Yeah, right.\/Tut!\/to grind\/close to\/eager\/to correspond to\/see also 反切[fan3 qie4]"],"pinyin":["qie1","qie4"],"word":"切"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]","variant of 合[he2]"],"pinyin":["ge3","he2","he2"],"word":"合"}],"containing_words":[{"definition":["impractical\/not conforming to reality"],"pinyin":["bu4 qie4 he2 shi2 ji4"],"word":"不切合实际"},{"definition":["practical\/corresponding to reality\/geared to practical situations"],"pinyin":["qie4 he2 shi2 ji4"],"word":"切合实际"}],"sentences":[{"english":"This allows the driver to customize the transmission to suit individual track requirements.","chinese":"这允许司机以自订的传输，以切合个别轨道的要求。"},{"english":"Numerical results showed that the algorithm was efficient and the model was more suitable to the engineering facts.","chinese":"通过一算例求解结果表明算法可行，模型更切合实际。"},{"english":"He has worked closely with U.S. antiterrorism specialists to train police.","chinese":"他和美国反恐专家密切合作，对印尼警方进行训练。"},{"english":"\"A station type real estate operating service\", is different meeds which suit the customer.","chinese":"“一站式地产经营服务”，是切合客户的不同需要。"},{"english":"This suggests people only imply meaning into their dreams when the implications fit their motives.","chinese":"这表明人们只在意义切合动机时，才将意义暗含梦中。"},{"english":"Fitting in with the Theme\"is the first meaning of rhetoric.\"","chinese":"“切合题旨”是修辞的第一义。"},{"english":"Finally, the design should cope with as many situations as practical, and certainly all those normally expected.","chinese":"最后，设计应当切合实际的各种情况，考虑完整性。"},{"english":"Your plan fell down when it proved too costly.","chinese":"你的计划是不切合实际的，因为它被证实耗资太大。"},{"english":"Any comparison that is not strictly factual runs the risk of being interpreted as subjective.","chinese":"任何不完全切合实际的比较都有可能被当作主观臆断。"},{"english":"Thanks to your close cooperation, we succeeded in putting the deal through.","chinese":"多亏你方的密切合作，我们成功地达成了这笔交易。"},{"english":"Have a realistic exercise work out and take one step at a time.","chinese":"制定一个切合实际的运动计划并按时逐步实行。"},{"english":"I have worked closely with my own women's mentoring group at The Commonwealth Institute.","chinese":"我曾与我们女性指导团队在英联邦研究所密切合作过。"},{"english":"One of my jobs is to try to make those more realistic.","chinese":"我的工作之一是使这些模型更切合实际。"},{"english":"Meet the audience at their level of understanding.","chinese":"你的演讲应该切合听众的理解能力才好。"},{"english":"In the Dhamma, there is nothing that is impractical or irrational.","chinese":"佛法中也没有不切合实际或不理性的东西。"},{"english":"They're neither being biblical nor practical in helping that couple.","chinese":"在帮助他们时，他们既不遵循圣经也不切合实际。"}],"related":[{"definition":["agreement\/to agree\/to get on with\/congenial\/agreeing with\/to ally oneself with sb"],"pinyin":["qi4 he2"],"word":"契合"},{"definition":["to hit the target (esp. in argument)\/to strike home"],"pinyin":["qie4 zhong4"],"word":"切中"},{"definition":["to accord with\/conforming to"],"pinyin":["he2 hu1"],"word":"合乎"},{"definition":["to be a good fit\/to be identical with\/to adjust oneself to\/to fit in"],"pinyin":["wen3 he2"],"word":"吻合"},{"definition":["gist\/main idea\/general tenor\/one's judgment"],"pinyin":["zhu3 zhi3"],"word":"主旨"},{"definition":["to agree implicitly\/of one mind\/views coincide without a word exchanged"],"pinyin":["an4 he2"],"word":"暗合"},{"definition":["to match\/to tally"],"pinyin":["xiang1 fu2"],"word":"相符"},{"definition":["to be just right for"],"pinyin":["qia4 he2"],"word":"恰合"},{"definition":["to go well together\/to be compatible\/to cater to\/to please"],"pinyin":["tou2 he2"],"word":"投合"},{"definition":["to stick closely to (a topic or theme etc)"],"pinyin":["jin3 kou4"],"word":"紧扣"},{"definition":["to cater to\/to pander to"],"pinyin":["ying2 he2"],"word":"迎合"},{"definition":["(idiom) appropriate\/apt\/just right"],"pinyin":["qia4 ru2 qi2 fen4"],"word":"恰如其分"},{"definition":["clear\/well-defined\/limpid"],"pinyin":["ming2 xi1"],"word":"明晰"},{"definition":["to conform to no conventional pattern\/unconventional\/offbeat"],"pinyin":["bu4 luo4 su2 tao4"],"word":"不落俗套"},{"definition":["practical\/corresponding to reality\/geared to practical situations"],"pinyin":["qie4 he2 shi2 ji4"],"word":"切合实际"},{"definition":["very close\/touching\/very appropriate"],"pinyin":["qie4 jin4"],"word":"切近"}]}