{"definition":["remember at all costs"],"pinyin":["qie4 ji4"],"traditional":["切記"],"rank":21385.0,"normalized_rank":0.2992038951771998,"fraction":0.0000020795972722750856,"cumulative_fraction":0.9779250098487756,"word":"切记","characters":[{"definition":["to cut\/to slice\/tangent (math)","definitely\/absolutely (not)\/(scoffing or dismissive interjection) Yeah, right.\/Tut!\/to grind\/close to\/eager\/to correspond to\/see also 反切[fan3 qie4]"],"pinyin":["qie1","qie4"],"word":"切"},{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"记"}],"containing_words":[],"sentences":[{"english":"Make sure that fish or other seafood are wrapped and use as soon as possible.","chinese":"切记鱼或其他海鲜要包装好，并且尽快食用。"},{"english":"And remember, this is often the first question you'll face.","chinese":"切记，这往往是第一个摆在你面前的问题。"},{"english":"I do not want you to make detours, remember those lessons.","chinese":"我不想让你再走弯路，切记那些教训。"},{"english":"When you go to your job interview, be sure to include your complete c. v. with your application.","chinese":"当你去作工作面试时，切记讲述你完整的简历和申请。"},{"english":"Remember, people have to feel good about your brand.","chinese":"切记，让人们要对你的品牌保持好感。"},{"english":"When fertilization, be sure to keep in mind not to make fat water is aspersed on plant, lest injure blade.","chinese":"施肥时，切记勿使肥水洒在植株上，以免损伤叶片。"},{"english":"Remember, pretending to be know-it-all will bring troubles.","chinese":"切记，不懂装懂会带来麻烦的。"},{"english":"If you're lucky enough to have snow, don't shovel the walkway.","chinese":"假使你足够幸运遇到下雪的天气，切记不要清扫走道。"},{"english":"Please bear in mind that your homework assignments affect your final grade.","chinese":"请切记，你的家庭作业会影响你的学期成绩。"},{"english":"Just remember that the answers on the answer sheet are the only answers that count.","chinese":"切记答题卡上的答案是唯一算数的。"},{"english":"With the enterprising spirit of the people, remember to choose direction is more important than hard work.","chinese":"拥有实干精神的人，切记选对方向比努力拼搏更重要。"},{"english":"Be mindful of your consumption choices and remember your priorities.","chinese":"慎重对待你的消费选择，切记你的优先级。"},{"english":"Remember to limit yourself to about 30 seconds without rambling on and on.","chinese":"切记限定自己在30秒内完成表述，不要东拉西扯。"},{"english":"When you go food shopping, bear in mind that we areshavingscompany for dinner tonight.","chinese":"你去购买食物时，切记我们今晚请客人吃晚餐。"},{"english":"Peel two raw apples and cut them into small pieces taking care to remove any seeds from the bowl.","chinese":"将两个苹果削皮并切成小块，切记要倒掉碗中的果核。"},{"english":"Remember that overnight success usually takes 15 years. 15.","chinese":"切记一夜成名通常需要付出15年的不懈努力。"}],"related":[{"definition":["to avoid as taboo\/to avoid by all means"],"pinyin":["qie4 ji4"],"word":"切忌"},{"definition":["by no means"],"pinyin":["qie4 wu4"],"word":"切勿"},{"definition":["don't!\/must not"],"pinyin":["bu4 yao4"],"word":"不要"},{"definition":["you must not\/Please don't...\/be sure not to\/on no account (do it)"],"pinyin":["qie4 mo4"],"word":"切莫"},{"definition":["in order to avoid\/so as not to"],"pinyin":["yi3 mian3"],"word":"以免"},{"definition":["to remember with reverence\/to bear in mind\/to keep in mind"],"pinyin":["jin3 ji4"],"word":"谨记"},{"definition":["best\/(you) had better (do what we suggest)"],"pinyin":["zui4 hao3"],"word":"最好"},{"definition":["to take note of\/to pay attention to"],"pinyin":["zhu4 yi4"],"word":"注意"},{"definition":["as much as possible\/to the greatest extent","as much as possible\/to the greatest extent"],"pinyin":["jin3 liang4","jin4 liang4"],"word":"尽量"},{"definition":["must\/to need to\/to be sure to"],"pinyin":["wu4 bi4"],"word":"务必"},{"definition":["cannot\/should not\/must not"],"pinyin":["bu4 ke3"],"word":"不可"},{"definition":["not suitable\/inadvisable\/inappropriate"],"pinyin":["bu4 yi2"],"word":"不宜"},{"definition":["(so as) to avoid\/to prevent\/(just) in case"],"pinyin":["yi3 fang2"],"word":"以防"},{"definition":["if not\/otherwise\/else\/or else"],"pinyin":["fou3 ze2"],"word":"否则"},{"definition":["may not"],"pinyin":["bu4 ke3 yi3"],"word":"不可以"},{"definition":["to be careful\/to take care"],"pinyin":["xiao3 xin1"],"word":"小心"}]}