{"definition":["to divide up\/to partition\/to differentiate"],"pinyin":["hua4 fen1"],"traditional":["劃分"],"rank":5225.0,"normalized_rank":0.0731045289829726,"fraction":0.000022520552406497726,"cumulative_fraction":0.8641878488169981,"word":"划分","characters":[{"definition":["to cut\/to slash\/to scratch (cut into the surface of sth)\/to strike (a match)","to row\/to paddle\/profitable\/worth (the effort)\/it pays (to do sth)","to delimit\/to transfer\/to assign\/to plan\/to draw (a line)\/stroke of a Chinese character"],"pinyin":["hua2","hua2","hua4"],"word":"划"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen4","fen1"],"word":"分"}],"containing_words":[{"definition":["market segmentation"],"pinyin":["shi4 chang3 hua4 fen1"],"word":"市场划分"}],"sentences":[{"english":"Generally, you should try to make gradations in the notes involved.","chinese":"通常来说，你应该试着将所用到的音符划分等级。"},{"english":"But recruiters are very category-driven.","chinese":"但是，招聘人员却非常注重按类别来划分。"},{"english":"A method for division of reservoir petrophysical facies by fuzzy clustering is proposed.","chinese":"提出了应用模糊聚类划分储集层岩石物理相的方法。"},{"english":"That means when the judge decided how the property would be divided in the divorce.","chinese":"那就是说离婚时当法官作出决定财产是如何划分的。"},{"english":"Under certain conditions, the operator of anomaly separation is simply an upward continuation operator.","chinese":"在一定条件下，异常划分算子就是向上延拓算子。"},{"english":"\"What you can do now, at best, is to assign people to a part of West Africa, \" Jackson says.","chinese":"现在能做的顶多是将人们划分为西非的一部分。"},{"english":"Ligature glyph widths are divided evenly among the characters they represent.","chinese":"连字字形宽度以它们代表的字符均匀的划分。"},{"english":"These stages are distinguished by what a learner is able to see.","chinese":"这四个阶段是根据学习者可以理解的东西来划分的。"},{"english":"Venue - Authority of a court to hear a matter based on geographical location.","chinese":"法院审理案件的权力依据地理位置所做的划分。"},{"english":"Are classified, in general, with the permanent population.","chinese":"一般是按常住人口划分的。"},{"english":"The U. S . and Canada are zoned for postal delivery.","chinese":"美国和加拿大划分了邮区。"},{"english":"Partitions are divisions in the formatting of the hard disk.","chinese":"分区就是硬盘格式化过程中的空间划分。"},{"english":"The experiments show that our mail community partition algo…","chinese":"实验表明，这种社区划分算法能够发现高质量的社区。"},{"english":"As you can see, each item in the tree is divided into columns.","chinese":"正如您可以看到的，树中的每一个项都被划分到列中。"},{"english":"Whirl it and divide to north and to south.","chinese":"疾速旋转并划分隔为到北和到南。"},{"english":"This article is not intended to provide a guide to the mechanisms by which overloading and partitioning can be prevented.","chinese":"本文将不对阻止过载或是划分的机制介绍。"}],"related":[{"definition":["to differentiate\/to draw a distinction\/to divide into categories"],"pinyin":["qu1 fen1"],"word":"区分"},{"definition":["classification"],"pinyin":["fen1 lei4"],"word":"分类"},{"definition":["definition\/to delimit"],"pinyin":["jie4 ding4"],"word":"界定"},{"definition":["to divide sth into (parts)\/to subdivide"],"pinyin":["fen1 wei2"],"word":"分为"},{"definition":["to demarcate\/to delimit"],"pinyin":["hua4 ding4"],"word":"划定"},{"definition":["subdivision\/segmentation"],"pinyin":["xi4 fen1"],"word":"细分"},{"definition":["to classify\/to categorize"],"pinyin":["gui1 lei4"],"word":"归类"},{"definition":["to rank\/to grade\/to classify\/rank\/grade\/classification"],"pinyin":["fen1 ji2"],"word":"分级"},{"definition":["to divide (into)\/to split a bonus\/to break into\/tenths\/percentage allotment"],"pinyin":["fen1 cheng2"],"word":"分成"},{"definition":["in general\/more or less\/in rough terms\/basically\/on the whole\/overall situation\/the big picture\/(Tw) remains (of a dead person)"],"pinyin":["da4 ti3"],"word":"大体"},{"definition":["more or less\/roughly\/approximately"],"pinyin":["da4 zhi4"],"word":"大致"},{"definition":["to cut up\/to break up"],"pinyin":["fen1 ge1"],"word":"分割"},{"definition":["definition\/to define"],"pinyin":["ding4 yi4"],"word":"定义"},{"definition":["can be divided (into parts)\/one can distinguish (several types)"],"pinyin":["ke3 fen1"],"word":"可分"},{"definition":["grade\/rank\/status"],"pinyin":["deng3 ji2"],"word":"等级"},{"definition":["limits\/bounds\/dividing line"],"pinyin":["jie4 xian4"],"word":"界线"}]}