{"definition":["various countries"],"pinyin":["lie4 guo2"],"traditional":["列國"],"rank":35840.0,"normalized_rank":0.5014480992822464,"fraction":5.621598410453008e-7,"cumulative_fraction":0.9945389777089828,"word":"列国","characters":[{"definition":["to arrange\/to line up\/file\/series\/(in data tables) column\/(Tw) row"],"pinyin":["lie4"],"word":"列"},{"definition":["surname Guo","country\/nation\/state\/national\/CL:個|个[ge4]"],"pinyin":["Guo2","guo2"],"word":"国"}],"containing_words":[{"definition":["to travel around many countries (idiom); peregrinations\/refers to the travels of Confucius"],"pinyin":["zhou1 you2 lie4 guo2"],"word":"周游列国"}],"sentences":[{"english":"Associate yourselves, O ye people, and ye shall be broken in pieces;","chinese":"列国的人民哪，任凭你们喧囔，终必破坏。"},{"english":"Andersen also wrote travelogs4 while he traveled through different countries.","chinese":"安徒生在周游列国时也写了游记。"},{"english":"Make sure this order is brought to the attention of all IDF soldiers\".","chinese":"此令务必传达全体以色列国防军士兵。"},{"english":"Now for three years there was no war between Aram and Israel.","chinese":"亚兰国和以色列国三年没有争战。"},{"english":"All the kings of the nations, even all of them, lie in glory, every one in his own house.","chinese":"列国的君王俱各在自己阴宅的荣耀中安睡。"},{"english":"To overthrow their seed also among the nations, and to scatter them in the lands.","chinese":"叫他们的后裔倒在列国之中，分散在各地。"},{"english":"Andersen also wrote travelogs while he traveled through different countries.","chinese":"安徒生在周游列国时也写了游记。"},{"english":"And they continued three years without war between Syria and Israel.","chinese":"亚兰国和以色列国三年没有争战。"},{"english":"how is Babylon become an astonishment among the nations!","chinese":"巴比伦在列国中何竟变为荒场。"},{"english":"I cannot craft a thunderbolt. But God directs lightning, and nations cower and run in fear.","chinese":"我无法降下雷电，但神却降下闪电，令列国慌忙逃躲。"},{"english":"She and her husband have served in many nations with Sister Gwen Shaw.","chinese":"她与夫婿跟随石桂林博士在列国中事奉。"},{"english":"Israel is swallowed up: now shall they be among the Gentiles as a vessel wherein is no pleasure.","chinese":"以色列被吞吃，现今在列国中，好像人不喜悦的器皿。"},{"english":"For three years there was no war between Aram and Israel.","chinese":"亚兰国和以色列国三年没有争战。"},{"english":"27 make their descendants fall among the nations and scatter them throughout the lands.","chinese":"叫他们的后裔倒在列国之中，分散在各地。"},{"english":"To execute vengeance upon the nations, chastisements among the people.","chinese":"为向异邦报仇雪耻，为向列国进攻袭击。"},{"english":"And I will scatter the Egyptians among the nations, and will disperse them through the countries.","chinese":"我必将埃及人分散在列国，四散在列邦。"}],"related":[{"definition":["feudal vassal\/feudal princes, esp. the monarchs (dukes or princes) of the several vassal states 諸侯國|诸侯国 of Zhou during Western Zhou and Spring and Autumn periods 11th-5th century BC\/subordinate warlord\/local official"],"pinyin":["zhu1 hou2"],"word":"诸侯"},{"definition":["vassal state"],"pinyin":["zhu1 hou2 guo2"],"word":"诸侯国"},{"definition":["Qi state of Western Zhou and the Warring states (1122-265 BC), centered in Shandong"],"pinyin":["Qi2 guo2"],"word":"齐国"},{"definition":["the state of Qin, one of the seven states of the Warring States Period (475-220 BC)"],"pinyin":["Qin2 guo2"],"word":"秦国"},{"definition":["the state of Chu, one of the most important of the small states contending for power in China between 770 and 223 BC, located around present-day Hubei"],"pinyin":["Chu3 guo2"],"word":"楚国"},{"definition":["country\/state"],"pinyin":["bang1 guo2"],"word":"邦国"},{"definition":["Yan, a vassal state of Zhou in modern Hebei and Liaoning\/north Hebei\/the four Yan kingdoms of the Sixteen Kingdoms, namely: Former Yan 前燕 (337-370), Later Yan 後燕|后燕 (384-409), Southern Yan 南燕 (398-410), Northern Yan 北燕 (409-436)"],"pinyin":["Yan1 guo2"],"word":"燕国"},{"definition":["Lu, vassal state at the time of the Zhou Dynasty 周朝|周朝[Zhou1 chao2], located in the southwest of present-day Shandong 山東|山东[Shan1 dong1], birthplace of Confucius"],"pinyin":["Lu3 guo2"],"word":"鲁国"},{"definition":["Wei State (407-225 BC), one of the Seven Hero States of the Warring States 戰國七雄|战国七雄\/Wei State or Cao Wei 曹魏 (220-265), the most powerful of the Three Kingdoms"],"pinyin":["Wei4 guo2"],"word":"魏国"},{"definition":["national strength\/situation in a state"],"pinyin":["guo2 shi4"],"word":"国势"},{"definition":["fight"],"pinyin":["zheng1 zhan4"],"word":"争战"},{"definition":["the Zhou dynasty from 1027 BC"],"pinyin":["Zhou1 wang2 chao2"],"word":"周王朝"},{"definition":["Yue state\/generic term for states in south China or southeast Asia at different historical periods"],"pinyin":["Yue4 guo2"],"word":"越国"},{"definition":["the Xirong, an ancient ethnic group of Western China from the Zhou Dynasty onwards\/Xionites (Central Asian nomads)"],"pinyin":["Xi1 rong2"],"word":"西戎"},{"definition":["Wu state (in south China, in different historical periods)\/Wu state 220-280, founded by Sun Quan 孫權|孙权 the southernmost of the three Kingdoms"],"pinyin":["Wu2 guo2"],"word":"吴国"},{"definition":["Zhao, one of the seven states during the Warring States Period of Chinese history (475-220 BC)"],"pinyin":["Zhao4 Guo2"],"word":"赵国"}]}