{"definition":["primary election"],"pinyin":["chu1 xuan3"],"traditional":["初選"],"rank":13541.0,"normalized_rank":0.18945615826955636,"fraction":0.0000049597358502610085,"cumulative_fraction":0.9524301500110024,"word":"初选","characters":[{"definition":["at first\/(at the) beginning\/first\/junior\/basic"],"pinyin":["chu1"],"word":"初"},{"definition":["to choose\/to pick\/to select\/to elect"],"pinyin":["xuan3"],"word":"选"}],"containing_words":[],"sentences":[{"english":"By 1916, more than half the states held presidential primaries.","chinese":"到1916年，有半数以上的州举行总统初选。"},{"english":"By 1936, only a dozen states continued to hold presidential primaries.","chinese":"到1936年，只有十来个州继续举行总统初选。"},{"english":"The Illinois stop was particularly important because of the primary calendar.","chinese":"鉴于初选日程安排，伊利诺伊州这一站尤显重要。"},{"english":"We had won the nomination by organizing around the primary schedule.","chinese":"我们围绕初选进度组织管理，所以赢得了提名。"},{"english":"The Socialists will choose their candidate in a primary vote in October.","chinese":"社会党人将在十月份的初选中选出他们的总统候选人。"},{"english":"Your party choice applies only to the King County primary ballot you complete in August.","chinese":"你所选的政党只应用于在景郡初选你填的选票。"},{"english":"And then again turn over verification the model number of doing the machine of the freezing of primary election.","chinese":"而后再反过来验证所初选的冻干机的型号。"},{"english":"The usual rule in primaries is that voters flock to thew inning candidate.","chinese":"初选通常的规律是选民们会纷纷涌向获胜的候选人。"},{"english":"Objective: Primarily to select absorption accelerating agent of nasal absorption preparation for calcitonin gene related peptide.","chinese":"鼻腔给药制剂的吸收促进剂进行初选。"},{"english":"Still, I couldn’t take the primary for granted.","chinese":"尽管如此，我仍然不能对初选掉以轻心。"},{"english":"Hayworth, whom he trounced in the Arizona Senate primary in August).","chinese":"他在八月亚利桑那州议会初选时严责了海华斯。"},{"english":"The U. S. Supreme Court ruled Washington's blanket primary to be unconstitutional.","chinese":"美国最高法院裁判华盛顿州的公开初选有违宪法。"},{"english":"Fernando Torres has been included in Spain's 30-man preliminary squad for the World Cup finals in South Africa.","chinese":"托雷斯进入了西班牙世界杯决赛的30人初选名单。"},{"english":"Clinton won the Texas primary vote 51 to 47 percent.","chinese":"克林顿曾赢得得州初选51%到47%的选票。"},{"english":"It has been an honor to contest these primaries with him.","chinese":"我一直感到很荣幸和他一起经历了这些初选。"},{"english":"Hillary party primaries in 2008, won the support of these groups.","chinese":"喜莱莉在2008年党内初选时，赢得这些族群支持。"}],"related":[{"definition":["to be a candidate in an election or other selection process\/to run for office\/to turn out to vote"],"pinyin":["can1 xuan3"],"word":"参选"},{"definition":["to fail to be chosen (or elected)\/to lose an election"],"pinyin":["luo4 xuan3"],"word":"落选"},{"definition":["to appraise\/to evaluate\/to judge"],"pinyin":["ping2 shen3"],"word":"评审"},{"definition":["preliminary contest\/initial heats of a competition"],"pinyin":["chu1 sai4"],"word":"初赛"},{"definition":["preliminary trial"],"pinyin":["chu1 shen3"],"word":"初审"},{"definition":["to pick\/to choose\/to select"],"pinyin":["lin2 xuan3"],"word":"遴选"},{"definition":["preselection\/short-listing\/primary election"],"pinyin":["yu4 xuan3"],"word":"预选"},{"definition":["to select on the basis of a vote or consensus"],"pinyin":["ping2 xuan3"],"word":"评选"},{"definition":["direct, winner-takes-all system of election in use for village committees\/preselection for a competition"],"pinyin":["hai3 xuan3"],"word":"海选"},{"definition":["candidate\/CL:名[ming2]"],"pinyin":["hou4 xuan3 ren2"],"word":"候选人"},{"definition":["to vote\/vote"],"pinyin":["tou2 piao4"],"word":"投票"},{"definition":["jury\/panel of judges"],"pinyin":["ping2 shen3 tuan2"],"word":"评审团"},{"definition":["to determine the recipient of an award through discussion"],"pinyin":["ping2 jiang3"],"word":"评奖"},{"definition":["referendum\/plebiscite"],"pinyin":["quan2 min2 tou2 piao4"],"word":"全民投票"},{"definition":["(sports) semifinal or quarterfinal\/to compete in a semifinal (or a quarterfinal)"],"pinyin":["fu4 sai4"],"word":"复赛"},{"definition":["preliminary exam\/qualifying exam\/first try\/preliminary testing"],"pinyin":["chu1 shi4"],"word":"初试"}]}