{"definition":["to exploit\/to make use of\/to use\/to take advantage of\/to utilize"],"pinyin":["li4 yong4"],"traditional":["利用"],"rank":511.0,"normalized_rank":0.007149552978047655,"fraction":0.00028797488177222,"cumulative_fraction":0.5156734153981859,"word":"利用","characters":[{"definition":["surname Li","sharp\/favorable\/advantage\/benefit\/profit\/interest\/to do good to\/to benefit"],"pinyin":["Li4","li4"],"word":"利"},{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"}],"containing_words":[{"definition":["to reuse"],"pinyin":["zai4 li4 yong4"],"word":"再利用"},{"definition":["land use plan (official P.R.C. government term)"],"pinyin":["tu3 di4 li4 yong4 gui1 hua4"],"word":"土地利用规划"}],"sentences":[{"english":"McDonald's and KFC use this kind of international business strategy to make their profit.","chinese":"麦当劳和肯得及就是利用这种国际化策略来盈利的。"},{"english":"Further eytogenetic analysis and breeding utilization of this intergeneric hybrid are still being carried out.","chinese":"目前正进一步开展细胞遗传和育种利用研究。"},{"english":"So it's a kind of machine which take advantage of fatigue-fracture.","chinese":"因而，它是一种化害为利，利用疲劳断裂下料的机械。"},{"english":"Mr Wei rushed to Taipei during his rest day on a Sunday to see Mr Zhang.","chinese":"魏姓同学便利用星期日赶到台北和张先生见面。"},{"english":"At the same time, the use of coal exhaustive method to optimize selection.","chinese":"同时利用穷举法对配煤进行优化选取。"},{"english":"The team failed to capitalize on their early lead.","chinese":"这个队未能充分利用开场时领前的优势。"},{"english":"One relatively harmless alternative to sun tanning is to use self-tanning lotions.","chinese":"相对无害的替代办法之一是利用太阳鞣自我鞣洗剂。"},{"english":"By linking Micro-computer and the 721-Spectrophotometre together, the automatic operation of the 721-Spectrophotometre is realized.","chinese":"介绍了利用微型计算机与721型订光光度汁相联帆。"},{"english":"This NNC is utilized by way of associative memory.","chinese":"网络的使用利用联想记忆法则。"},{"english":"Women do phonological processing with both their right and left inferior frontal gyri .","chinese":"女人是利用她们左右眉骨后的侧脑回发音的。"},{"english":"Under the condition of artificial feeding, effect of using cement quadrel to collect eggs was good.","chinese":"在人工饲养条件下，利用水泥方砖采卵效果良好。"},{"english":"The sophisticated system destroys enemy warheads through direct \"hit-to-kill\" technology. \"It's like hitting a bullet with a bullet,\" Watkins says.","chinese":"系统利用命中即摧毁技术，摧毁敌方的弹头。"},{"english":"The vacuolar amino acid pool is utilized during initiation of budding .","chinese":"当出芽开始时，液泡的氨基酸库被利用。"},{"english":"Using this function, we can get more representational eigenvector from email.","chinese":"利用此函数可提取到更具有代表性的邮件特征向量。"},{"english":"One possibility: tapping state disability funds.","chinese":"一种可能就是利用州伤病基金。"},{"english":"Building offside tactics is one kind when use regulation and design defends tactics.","chinese":"造越位战术是利用规则而设计的一种防守战术。"}],"related":[{"definition":["to draw support from\/with the help of"],"pinyin":["jie4 zhu4"],"word":"借助"},{"definition":["to reuse"],"pinyin":["zai4 li4 yong4"],"word":"再利用"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通过"},{"definition":["to rely on sth (for support etc)\/to depend on"],"pinyin":["yi1 kao4"],"word":"依靠"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"进行"},{"definition":["to use\/to put to use"],"pinyin":["yun4 yong4"],"word":"运用"},{"definition":["method\/means (of doing sth)\/strategy\/trick\/CL:個|个[ge4]"],"pinyin":["shou3 duan4"],"word":"手段"},{"definition":["to use\/to employ\/to apply\/to make use of"],"pinyin":["shi3 yong4"],"word":"使用"},{"definition":["assistance\/aid\/to help\/to assist"],"pinyin":["bang1 zhu4"],"word":"帮助"},{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"},{"definition":["superiority\/dominance\/advantage"],"pinyin":["you1 shi4"],"word":"优势"},{"definition":["with this\/thereby\/thus\/because of this"],"pinyin":["yi3 ci3"],"word":"以此"},{"definition":["matching\/fitting in with\/compatible with\/to correspond\/to fit\/to conform to\/rapport\/to coordinate with\/to act in concert with\/to cooperate\/to become man and wife\/to combine parts of machine"],"pinyin":["pei4 he2"],"word":"配合"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["to maximize"],"pinyin":["zui4 da4 hua4"],"word":"最大化"},{"definition":["to manufacture\/to make"],"pinyin":["zhi4 zao4"],"word":"制造"}]}