{"definition":["to have no other choice"],"pinyin":["bie2 wu2 xuan3 ze2"],"traditional":["別無選擇"],"rank":20959.0,"normalized_rank":0.2932436024792579,"fraction":0.00000216528613924304,"cumulative_fraction":0.977021895757796,"word":"别无选择","characters":[{"definition":["surname Bie","to leave\/to depart\/to separate\/to distinguish\/to classify\/other\/another\/don't ...!\/to pin\/to stick (sth) in","to make sb change their ways, opinions etc"],"pinyin":["Bie2","bie2","bie4"],"word":"别"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"无"},{"definition":["to choose\/to pick\/to select\/to elect"],"pinyin":["xuan3"],"word":"选"},{"definition":["to select\/to choose\/to pick over\/to pick out\/to differentiate\/to eliminate\/also pr. [zhai2]"],"pinyin":["ze2"],"word":"择"}],"containing_words":[],"sentences":[{"english":"He had no choice but to comply, allowing the Imperials aboard.","chinese":"他别无选择，只能照办，同意帝国检查队登舰。"},{"english":"In an emergency, buyers under duress have no freedom.","chinese":"在紧急关头，买家迫不得已别无选择。"},{"english":"\"I'd never mobilized people before, but I had no choice, \" says Alger.","chinese":"我以前从来没有动员过别人，但我别无选择。"},{"english":"The USGA gave me no option but to stand up and fight them, and fight them I did.","chinese":"USGA让我别无选择，我只有站起来跟他们对抗。"},{"english":"You have no choice but to break away from the illegal organization.","chinese":"除了摆脱那个非法组织，你别无选择。"},{"english":"Wipe away tears, we have nothing to do but adamancy.","chinese":"擦干眼泪，除了坚强我们别无选择。"},{"english":"The choice was clear -- abandon them, or his dreams.","chinese":"似乎是别无选择了，抛弃他们，或者继续做白日梦。"},{"english":"I had no option but to agree.","chinese":"我除了同意以外别无选择。"},{"english":"Diesel oil looks not so good, but there is no choice.","chinese":"尽管柴油看起来并不怎么好，但也别无选择了。"},{"english":"They have little choice, but it may be a mission impossible.","chinese":"他们别无选择，但这或许只是个不可能完成的使命。"},{"english":"I was left with no choice but to fight my way out.","chinese":"我别无选择，只能背水一战。"},{"english":"We had no choice but to wait.","chinese":"除了等待，我们别无选择。"},{"english":"No choice to be the next retaining the power of a death Lucia.","chinese":"在别无选择的情况下一护得到露琪亚的力量成为死神。"},{"english":"Yang Zhiyuan besides nonofficeholding Ren Youya the tiger is bought outside have no alternative.","chinese":"杨致远除了下台任由雅虎被收购外别无选择。"},{"english":"'We had no choice but to do further research, ' he said.","chinese":"他说，我们别无选择，只能深入调查。"},{"english":"He had no choice, and turned to see the LCD screen of display.","chinese":"别无选择，他回过头看着显示器的液晶屏幕。"}],"related":[{"definition":["there is no alternative"],"pinyin":["bie2 wu2 ta1 fa3"],"word":"别无他法"},{"definition":["to have no alternative (idiom); compelled by circumstances\/forced into sth"],"pinyin":["po4 bu4 de2 yi3"],"word":"迫不得已"},{"definition":["as matters stand\/things having reached this stage"],"pinyin":["shi4 dao4 ru2 jin1"],"word":"事到如今"},{"definition":["(idiom) dead end\/road to ruin"],"pinyin":["si3 lu4 yi1 tiao2"],"word":"死路一条"},{"definition":["without a retreat route\/caught in a dead end\/having burned one's bridges"],"pinyin":["wu2 lu4 ke3 tui4"],"word":"无路可退"},{"definition":["no strategy left to try (idiom); at one's wit's end\/at the end of one's tether\/powerless"],"pinyin":["wu2 ji4 ke3 shi1"],"word":"无计可施"},{"definition":["impotent (idiom)\/powerless\/helpless"],"pinyin":["wu2 neng2 wei2 li4"],"word":"无能为力"},{"definition":["to act against one's will\/to have no alternative but to\/to have to\/to have no choice\/must"],"pinyin":["bu4 de2 yi3"],"word":"不得已"},{"definition":["to sit and wait for death (idiom); resigned to one's fate"],"pinyin":["zuo4 yi3 dai4 bi4"],"word":"坐以待毙"},{"definition":["to have no other choice\/to be the last resort"],"pinyin":["bu4 de2 yi3 er2 wei2 zhi1"],"word":"不得已而为之"},{"definition":["lit. once you've shot the arrow, there's no getting it back (idiom)\/fig. once you started sth, there's no turning back\/to have to finish what one started\/to be determined to reach one's goals in spite of setbacks"],"pinyin":["kai1 gong1 mei2 you3 hui2 tou2 jian4"],"word":"开弓没有回头箭"},{"definition":["to accept misfortunes as decreed by fate\/to be resigned to sth"],"pinyin":["ren4 ming4"],"word":"认命"},{"definition":["to brace oneself to do sth\/to put a bold face on it\/to summon up courage\/to force oneself to"],"pinyin":["ying4 zhe5 tou2 pi2"],"word":"硬着头皮"},{"definition":["to stake all on one throw"],"pinyin":["gu1 zhu4 yi1 zhi4"],"word":"孤注一掷"},{"definition":["to submit to the will of heaven\/to resign oneself to fate\/to trust to luck"],"pinyin":["ting1 tian1 you2 ming4"],"word":"听天由命"},{"definition":["if you ride a tiger, it's hard to get off (idiom); fig. impossible to stop halfway"],"pinyin":["qi2 hu3 nan2 xia4"],"word":"骑虎难下"}]}