{"definition":["in the end\/finally\/as a result"],"pinyin":["dao4 tou2 lai2"],"traditional":["到頭來"],"rank":21147.0,"normalized_rank":0.2958739663929036,"fraction":0.000002122660672199356,"cumulative_fraction":0.977424892834788,"word":"到头来","characters":[{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["suffix for nouns","head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]"],"pinyin":["tou5","tou2"],"word":"头"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"来"}],"containing_words":[],"sentences":[{"english":"Speculators eager to earn a fast buck often wind up in bankruptcy.","chinese":"急于想发横财的投机者到头来往往破产。"},{"english":"The identical concept, very possible is in the end criticism person is different.","chinese":"到头来同一个概念，很可能是人言人殊。"},{"english":"Tis nought but making bridal clothes for other folk to wear.","chinese":"到头来都是为他人作嫁衣裳。"},{"english":"Evildoers are bound to be punished in the end.","chinese":"做坏事的人到头来总会遭报应的。"},{"english":"Dishonest people are bound to come a cropper in the end.","chinese":"不老实的人到头来总是要栽跟头的。"},{"english":"After all, he said to hilf, it's probably only insomnia.","chinese":"到头来，他对说，大概又只是失眠。"},{"english":"Evildoers are bound to be punished in the end .","chinese":"做坏事的人到头来总会遭报应的。"},{"english":"He has been reading books all his life, and has become a pedant.","chinese":"他读了一辈子的书，到头来不过是一个彻底的老夫子。"},{"english":"Retaliation in an intracompany operationis not beneficial to anyone.","chinese":"公司内部之间的报复到头来对谁都没有好处。"},{"english":"In the end the same concept, is likely to be different people will have different.","chinese":"到头来同一个概念，很可能是人言人殊。"},{"english":"Were hammering against the end avoid smelly head, that you love to show off love.","chinese":"免得到头来反被骂个臭头，说你爱炫耀爱情。"},{"english":"He'd end up an exile washing dishes at the automat.","chinese":"到头来他会背井离乡，在自助食堂里洗碗碟。"},{"english":"And I still had to deal with her in the end!","chinese":"这还不算，到头来我还得面对那个同事。"},{"english":"At first he refused to accept any responsibility but he ended up apologizing.","chinese":"最初他拒不承认有任何责任，到头来还是道了歉。"},{"english":"Each hierarchy culminates in its own particular Pope.","chinese":"每一等级的人到头来终有自己具体最崇拜的教皇。"},{"english":"“It ends up being a roundabout way to tax people, ” Hauter says.","chinese":"“到头来还是要迂回向民众征税”，豪特说。"}],"related":[{"definition":["all one's hopes and efforts come to nothing\/futile"],"pinyin":["yi1 chang2 kong1"],"word":"一场空"},{"definition":["ending up as\/leading to\/resulting in\/in total"],"pinyin":["luo4 de5"],"word":"落得"},{"definition":["using a wicker basket to draw water (idiom); wasted effort"],"pinyin":["zhu2 lan2 da3 shui3"],"word":"竹篮打水"},{"definition":["to rack one's brains for schemes (idiom)\/to beat one's brains out"],"pinyin":["fei4 jin4 xin1 ji1"],"word":"费尽心机"},{"definition":["one's own wishful thinking"],"pinyin":["yi1 xiang1 qing2 yuan4"],"word":"一厢情愿"},{"definition":["lamentable\/sad(ly)"],"pinyin":["ke3 tan4"],"word":"可叹"},{"definition":["painstakingly\/with great trouble"],"pinyin":["xin1 xin1 ku3 ku3"],"word":"辛辛苦苦"},{"definition":["in vain\/to no purpose\/for nothing\/white"],"pinyin":["bai2 bai2"],"word":"白白"},{"definition":["to rack one's brains (idiom); to take great pains to think sth through"],"pinyin":["fei4 jin4 xin1 si5"],"word":"费尽心思"},{"definition":["to have achieved nothing\/to be a total failure\/to get nowhere"],"pinyin":["yi1 shi4 wu2 cheng2"],"word":"一事无成"},{"definition":["arduous and thankless task (idiom); strenuous and unrewarding"],"pinyin":["fei4 li4 bu4 tao3 hao3"],"word":"费力不讨好"},{"definition":["one's utmost\/(to fight or work) desperately hard\/to put up a life or death struggle\/at all costs"],"pinyin":["pin1 si3 pin1 huo2"],"word":"拼死拼活"},{"definition":["delighted to (do sth, idiom)\/perfectly happy to do\/most willing to do"],"pinyin":["xin1 gan1 qing2 yuan4"],"word":"心甘情愿"},{"definition":["things turn out contrary to the way one wishes (idiom)"],"pinyin":["shi4 yu3 yuan4 wei2"],"word":"事与愿违"},{"definition":["to commit to the waters (idiom); to lose sth irrevocably"],"pinyin":["fu4 zhi1 dong1 liu2"],"word":"付之东流"},{"definition":["in the end\/after all is said and done"],"pinyin":["zhong1 jiu1"],"word":"终究"}]}