{"definition":["to work out\/to formulate"],"pinyin":["zhi4 ding4"],"traditional":["制訂"],"rank":4560.0,"normalized_rank":0.06380031620332154,"fraction":0.000027467004292714296,"cumulative_fraction":0.8476413316710166,"word":"制订","characters":[{"definition":["to manufacture\/to make","system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4","zhi4"],"word":"制"},{"definition":["to agree\/to conclude\/to draw up\/to subscribe to (a newspaper etc)\/to order"],"pinyin":["ding4"],"word":"订"}],"containing_words":[],"sentences":[{"english":"Yost was an engineer involved in the development of high-altitude weather balloons.","chinese":"约斯特是一名工程师参与制订高空气象气球。"},{"english":"Randomisation assignments were generated by the medical coordinating centre by a pre-decided schedule.","chinese":"医疗协调中心根据预先制订的计划生成随机化分配。"},{"english":"Background. The clinical history of a given pigmented lesion could in fluence the therapeutic decision.","chinese":"一个色素性皮损的临床病史影响其治疗方案的制订。"},{"english":"To establish a coherent and comprehensive population policy.","chinese":"制订周全谐协的人口政策。"},{"english":"Participating in the formulation of company facility layout and adjustment plan.","chinese":"参与制订公司设施规划和调整计划。"},{"english":"The rebels defiantly welcomed new allies and laid plans for unionization campaigns.","chinese":"造反派热烈欢迎新盟友，并制订组织工会的计划。"},{"english":"The general ordered me to strategize.","chinese":"将军责成我制订战略行动计划。"},{"english":"We must determine the heat-treatment technical parameters, according to its influence.","chinese":"因此，必须考虑其影响来综合制订热处理工艺参数。"},{"english":"The establishment of Codex guideline levels for dioxins in foods is under consideration.","chinese":"目前正在考虑制订食品中二恶英含量规定指导原则。"},{"english":"In addition, the complexion of enacting standards for live working is described.","chinese":"另外，介绍了带电作业标准的制订情况。"},{"english":"Working out the company's profit distribution plans and loss recovery plans.","chinese":"制订公司的利润分配方案和弥补亏损方案。"},{"english":"Salvador Idal: American and Israeli defense contractors have now developed effective mind-scanning machines.","chinese":"美国和以色列国防承包商已制订了有效的心态扫描机。"},{"english":"This article analysis the quality of lomar PW and works out analysis method.","chinese":"对进口洛码PW进行了全分析，制订了分析方法。"},{"english":"We can't put off making a plan. Clean-up Day is only two weeks from now.","chinese":"我们不能推迟制订计划，清洁日离现在只有两周了。"},{"english":"Working-out test plan, complete hardware debugging and testing job.","chinese":"制订测试方案，完成硬件调试和测试工作。"},{"english":"\"The central government can only start schemes and give money, \" Rebello said.","chinese":"雷贝罗说，“中央政府只能制订计划然后提供资金。"}],"related":[{"definition":["to draw up\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制定"},{"definition":["to draw up\/to draft\/to formulate"],"pinyin":["ni3 ding4"],"word":"拟定"},{"definition":["to draw up (a plan)"],"pinyin":["ni3 ding4"],"word":"拟订"},{"definition":["program of action"],"pinyin":["xing2 dong4 fang1 an4"],"word":"行动方案"},{"definition":["action plan"],"pinyin":["xing2 dong4 ji4 hua4"],"word":"行动计划"},{"definition":["feasible"],"pinyin":["qie4 shi2 ke3 xing2"],"word":"切实可行"},{"definition":["to issue\/to proclaim\/to enact (laws, decrees etc)"],"pinyin":["ban1 bu4"],"word":"颁布"},{"definition":["plan\/project\/program\/to plan\/to map out\/CL:個|个[ge4],項|项[xiang4]"],"pinyin":["ji4 hua4"],"word":"计划"},{"definition":["regulations\/rules\/code of conduct\/ordinances\/statutes"],"pinyin":["tiao2 li4"],"word":"条例"},{"definition":["plan\/program (for action etc)\/proposal\/proposed bill\/CL:個|个[ge4],套[tao4]"],"pinyin":["fang1 an4"],"word":"方案"},{"definition":["to implement\/to carry out"],"pinyin":["shi2 shi1"],"word":"实施"},{"definition":["to revise"],"pinyin":["xiu1 ding4"],"word":"修订"},{"definition":["to give a more granular level of detail\/to elaborate\/to refine\/to become more differentiated"],"pinyin":["xi4 hua4"],"word":"细化"},{"definition":["to put into effect\/to carry out"],"pinyin":["tui1 xing2"],"word":"推行"},{"definition":["to lay down (a rule, a plan of action)\/to draw up\/booked out (i.e. already fully booked)"],"pinyin":["ding4 chu1"],"word":"订出"},{"definition":["(of systems, facilities etc) comprehensive\/well-developed\/excellent\/to refine\/to improve"],"pinyin":["wan2 shan4"],"word":"完善"}]}