{"definition":["to set up an independent regime\/to secede\/segmentation\/division\/fragmentation"],"pinyin":["ge1 ju4"],"traditional":["割據"],"rank":28449.0,"normalized_rank":0.3980384201026961,"fraction":0.0000010811103045394696,"cumulative_fraction":0.9886765127107456,"word":"割据","characters":[{"definition":["to cut\/to cut apart"],"pinyin":["ge1"],"word":"割"},{"definition":["according to\/to act in accordance with\/to depend on\/to seize\/to occupy","variant of 據|据[ju4]","variant of 據|据[ju4]","see 拮据[jie2 ju1]"],"pinyin":["ju4","ju4","ju4","ju1"],"word":"据"}],"containing_words":[],"sentences":[{"english":"The collapse of the Han dynasty was followed by nearly four centuries of rule by warlords.","chinese":"汉朝灭亡后是长达四个世纪的军阀割据时代。"},{"english":"The nature of the Territory was not a lease territory, but a concession.","chinese":"英租威海卫的性质并非“租借地”而是“割据地”。"},{"english":"In the very early days, China was divided and ruled by many kings.","chinese":"在最初时期，中国曾被许多君王割据。"},{"english":"Our regime tended to exert an ever-growing influence on Hunan and Kiangsi.","chinese":"此割据对湘赣两省的影响，则有日益扩大之势。"},{"english":"An independent regime must be an armed one.","chinese":"所谓割据，必须是武装的。"},{"english":"Of the country has gone forever on this land of China.","chinese":"封建式的割据局面在中国大地上也一去不复返了。"},{"english":"In 1757, the Qing imperial court crushed the long-standing Junggar separatist regime in the Northwest.","chinese":"1757年，清朝平定长期割据西北的准噶尔政权。"},{"english":"Then the dynasty collapsed in 1912, and China was carved up by warlords.","chinese":"1912年军阀割据时代的到来，使它彻底倒塌。"},{"english":"Regional military governors and their supporters were replaced by centrally appointed officials.","chinese":"地区割据的首领和他们的同伙被中央指定的官员代替。"},{"english":"In the period of five dynasties and ten states, the military governorship of late Tang dynasty continued to develop.","chinese":"五代十国时期是唐末藩镇割据的继续和发展。"},{"english":"The Five Dynasties and Ten Kingdoms period is the continuation and development of the Late Tang Dynasty opposite to the splittism.","chinese":"五代十国时期是唐末藩镇割据的继续和发展。"},{"english":"The Wall represented an artificially divided Germany and a dangerously bifurcated world.","chinese":"柏林墙代表着被人为分裂的德国和危险割据的世界。"},{"english":"Her dream is to study in the middle of Europe.","chinese":"大公国出现于欧洲中世纪封建割据时期。"},{"english":"The Grand Duchy appeared in the feudal separation period during middle ages in Europe.","chinese":"大公国出现于欧洲中世纪封建割据时期。"}],"related":[{"definition":["(of a warlord etc) to assemble one's personal army, thereby presenting a challenge to the central government"],"pinyin":["yong1 bing1 zi4 zhong4"],"word":"拥兵自重"},{"definition":["lit. fence town\/buffer region (between enemies)\/Tang dynasty system of provincial administration under a provincial governor 節度使|节度使[jie2 du4 shi3]"],"pinyin":["fan1 zhen4"],"word":"藩镇"},{"definition":["to unify\/unified"],"pinyin":["yi1 tong3"],"word":"一统"},{"definition":["military clique\/junta\/warlord"],"pinyin":["jun1 fa2"],"word":"军阀"},{"definition":["the whole country in rebellion"],"pinyin":["tian1 xia4 da4 luan4"],"word":"天下大乱"},{"definition":["regime\/political power"],"pinyin":["zheng4 quan2"],"word":"政权"},{"definition":["to pacify","Pingding county in Yangquan 陽泉|阳泉[Yang2 quan2], Shanxi"],"pinyin":["ping2 ding4","Ping2 ding4"],"word":"平定"},{"definition":["content to hold a small part of the territory\/fig. forced to relinquish the middle ground\/forced to move away"],"pinyin":["pian1 an1"],"word":"偏安"},{"definition":["to conquer\/to defeat (militarily)"],"pinyin":["gong1 mie4"],"word":"攻灭"},{"definition":["incessant fighting between warlords"],"pinyin":["jun1 fa2 hun4 zhan4"],"word":"军阀混战"},{"definition":["to attack\/to raid\/(of medicine) potent"],"pinyin":["gong1 fa2"],"word":"攻伐"},{"definition":["to exercise sole hegemony (idiom); to dominate a whole area (market, resources etc)\/to hold as one's personal fiefdom"],"pinyin":["du2 ba4 yi1 fang1"],"word":"独霸一方"},{"definition":["feudal vassal\/feudal princes, esp. the monarchs (dukes or princes) of the several vassal states 諸侯國|诸侯国 of Zhou during Western Zhou and Spring and Autumn periods 11th-5th century BC\/subordinate warlord\/local official"],"pinyin":["zhu1 hou2"],"word":"诸侯"},{"definition":["(expr.) hold the feudal overlord and you control his vassals"],"pinyin":["xie2 tian1 zi3 yi3 ling4 zhu1 hou2"],"word":"挟天子以令诸侯"},{"definition":["to annex"],"pinyin":["tun1 bing4"],"word":"吞并"},{"definition":["to go on or send a punitive expedition"],"pinyin":["zheng1 fa2"],"word":"征伐"}]}