{"definition":["to make every effort to\/striving to do one's best"],"pinyin":["li4 qiu2"],"traditional":["力求"],"rank":8081.0,"normalized_rank":0.1130636743945266,"fraction":0.000011775869181325204,"cumulative_fraction":0.9107587055878446,"word":"力求","characters":[{"definition":["surname Li","power\/force\/strength\/ability\/strenuously"],"pinyin":["Li4","li4"],"word":"力"},{"definition":["to seek\/to look for\/to request\/to demand\/to beseech"],"pinyin":["qiu2"],"word":"求"}],"containing_words":[],"sentences":[{"english":"We have to base itself, potential, and strengthen the goal, and strive to become.","chinese":"我们要立足自身，挖掘潜力，强化目标，力求成才。"},{"english":"Will make every effort to achieve will drop an intestinal juices introduction large intestine deeper spot.","chinese":"力求做到将滴肠液引入大肠更深的部位。"},{"english":"We practised various austerities to make our money last longer.","chinese":"我们在各方面力求节省以便钱能用久一点。"},{"english":"The author seeks to break the methods he created yesterday and move on towards unexplored territory.","chinese":"作者在写作方法上力求不断突破，去探索未知的领地。"},{"english":"We will reinforce the sales promotion member's selling enthusiasm , will make every effort to raise a product selling amounts.","chinese":"我们将加强促销员的售卖积极性，力求提高产品销量。"},{"english":"We try to achieve what we can afford, and to achieve our mission.","chinese":"我们竭尽所能，力求不辱使命。"},{"english":"We will enhance our sales persons' enthusiasm, making every effort to improve the sales amount.","chinese":"我们将加强促销员的售卖积极性，力求提高产品销量。"},{"english":"Wulff told reporters that he had asked to keep security measures as low-key as possible.","chinese":"伍尔夫告诉记者，他之前就要求维安措施力求低调。"},{"english":"We endeavour to avoid the old, romantic idea of a gusher .","chinese":"我们力求避免那种陈旧的，富有浪漫色彩的喷油方式。"},{"english":"We will do our Best to make Both the market Brisk and prices staBle.","chinese":"我们要力求做到既繁荣市场，又稳定物价。"},{"english":"Our country must drive at increasing agricultural production.","chinese":"我国必须力求农业增产。"},{"english":"Fashion designers make every effort to show variety and create something new to attract attention.","chinese":"时装设计师要不停地推陈出新，力求花样百出。"},{"english":"Strive for constant improvement and take responsibility for your own performance.","chinese":"力求上进并对自己的本职工作负责。"},{"english":"On such highly divisive issues you must strive to remain objective.","chinese":"在这样高度分歧的问题上，你必须力求保持客观。"},{"english":"Before feeding is best for jackets, and strive to clean and sanitary.","chinese":"喂奶前最好换件外衣，力求干净卫生。"},{"english":"Role-based business intelligence seeks to achieve more relevance .","chinese":"基于角色的商业智能力求取得更多的相关性。"}],"related":[{"definition":["to try hard to\/to strive to"],"pinyin":["li4 tu2"],"word":"力图"},{"definition":["as far as possible\/to do one's utmost"],"pinyin":["jin3 ke3 neng2"],"word":"尽可能"},{"definition":["to work hard for\/to do all one can\/to contend strongly"],"pinyin":["li4 zheng1"],"word":"力争"},{"definition":["to perfect sth that is already outstanding (idiom); constantly improving"],"pinyin":["jing1 yi4 qiu2 jing1"],"word":"精益求精"},{"definition":["in order to\/hoping to\/attempting to\/waiting for"],"pinyin":["yi3 qi1"],"word":"以期"},{"definition":["in order to"],"pinyin":["yi3 qiu2"],"word":"以求"},{"definition":["objective\/aim\/goal"],"pinyin":["zong1 zhi3"],"word":"宗旨"},{"definition":["based on...\/in conformance with..\/taking as one's main principle"],"pinyin":["ben3 zhe5"],"word":"本着"},{"definition":["all around\/omnidirectional\/complete\/holistic\/comprehensive"],"pinyin":["quan2 fang1 wei4"],"word":"全方位"},{"definition":["to take orders\/to receive commands\/to carry on (a tradition)"],"pinyin":["bing3 cheng2"],"word":"秉承"},{"definition":["to uphold\/to hold fast to"],"pinyin":["bing3 chi2"],"word":"秉持"},{"definition":["perfect (idiom); perfection\/the best of all possible worlds\/as good as it gets"],"pinyin":["jin4 shan4 jin4 mei3"],"word":"尽善尽美"},{"definition":["idea\/concept\/philosophy\/theory"],"pinyin":["li3 nian4"],"word":"理念"},{"definition":["to ensure\/to guarantee"],"pinyin":["que4 bao3"],"word":"确保"},{"definition":["to pay attention to\/to emphasize"],"pinyin":["zhu4 zhong4"],"word":"注重"},{"definition":["to restore to the original state\/to reconstruct (an event)\/reduction (chemistry)"],"pinyin":["huan2 yuan2"],"word":"还原"}]}