{"definition":["to reinforce (a structure)\/to strengthen"],"pinyin":["jia1 gu4"],"traditional":["加固"],"rank":11894.0,"normalized_rank":0.16641249143033032,"fraction":0.000006204487074512702,"cumulative_fraction":0.9432684232093472,"word":"加固","characters":[{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"},{"definition":["hard\/strong\/solid\/sure\/assuredly\/undoubtedly\/of course\/indeed\/admittedly"],"pinyin":["gu4"],"word":"固"}],"containing_words":[{"definition":["nuclear hardening"],"pinyin":["kang4 he2 jia1 gu4"],"word":"抗核加固"}],"sentences":[{"english":"The technology of line reinforced by the temporary beam in the D pattern and container bridge jacking has been widely applied.","chinese":"型便梁加固线路顶进箱桥施工技术已得到广泛应用。"},{"english":"We would suggest that you strengthen the cartons with double straps.","chinese":"因此，我方建议用两根包装带加固纸板箱。"},{"english":"The basic principle of a detached type erasible and rewritable reinforced optic head is analyzed.","chinese":"分析了加固型可摄重写分离式光学头的基本工作原理。"},{"english":"It can be called as the exposition of surrounding rock reinforcement.","chinese":"此论述也可称围岩加固论。"},{"english":"The steel fiber concrete is used to strengthening the dam through more schemes comparison.","chinese":"经比选佛子岭大坝加固采用钢纤维混凝土新材料。"},{"english":"The embankment must be reinforced before the flood season.","chinese":"坝基一定要在洪汛期到来之前加固好。"},{"english":"The wooden cases used to pack the goods should be securely strapped.","chinese":"包装货物用的木箱要用包装带加固。"},{"english":"Analysis of Seepage and Measures of Seepage Control Strengthening for Right Abutment of Shitouhe Reservoir Dam.","chinese":"石头河水库大坝右坝肩渗漏分析及防渗加固措施。"},{"english":"Seepage prevention and reinforcement for unsafe reservoirs.","chinese":"病险水库除险加固工程。"},{"english":"So the reinforcing area is consist by natural foundation and reinforcement body.","chinese":"加固区是由天然地基和增强体两部分组成的人工地基。"},{"english":"In this paper, the technique and calculation of beams strengthened by prestressing method are studied.","chinese":"本文研究了用预应力法加固梁的工艺和计算。"},{"english":"We suggest that you reinforce the cartons with twice belts.","chinese":"我方建议用两跟包装带加固纸箱。"},{"english":"The technique of high-pressure gunite is applied to the foundation anti-seepage and reinforcement engineering and outstanding achievements were acquired.","chinese":"高压喷射灌浆进行地基防渗加固，取得了显著的成就。"},{"english":"We have applyed it in submicron radiation-hard circuit successfully.","chinese":"并在亚微米的抗辐射加固电路中成功应用。"},{"english":"Due to the function alteration of Suzhou Wuxian commercial building, structural strengthening is carried out.","chinese":"苏州吴县商业大楼因使用功能改变引起改造加固。"},{"english":"The special features and applications of warp-knitted biaxial and multiaxial reinforcement sturctures are described .","chinese":"描述了双轴向和多轴向加固经编织物特点和应用。"}],"related":[{"definition":["to mend"],"pinyin":["xiu1 bu3"],"word":"修补"},{"definition":["to defend\/to protect"],"pinyin":["fang2 hu4"],"word":"防护"},{"definition":["to repair\/to refurbish\/to renovate\/to refit\/to mend\/to rebuild"],"pinyin":["zheng3 xiu1"],"word":"整修"},{"definition":["fortification\/defensive structure"],"pinyin":["fang2 yu4 gong1 shi4"],"word":"防御工事"},{"definition":["to build"],"pinyin":["xiu1 zhu4"],"word":"修筑"},{"definition":["firm\/firmly\/hard\/stable"],"pinyin":["jian1 gu4"],"word":"坚固"},{"definition":["to renovate\/to repair (a building)"],"pinyin":["xiu1 shan4"],"word":"修缮"},{"definition":["defense\/to defend"],"pinyin":["fang2 yu4"],"word":"防御"},{"definition":["foundations (of a building)\/base"],"pinyin":["di4 ji1"],"word":"地基"},{"definition":["defensive structure\/military fortifications\/(Tw) construction works\/civil engineering works"],"pinyin":["gong1 shi4"],"word":"工事"},{"definition":["to spruce up\/to renovate\/to tend (a garden)\/to groom (one's hair)\/to finish (a rough surface)\/to trim (a lawn)\/to touch up (a photo)"],"pinyin":["xiu1 zheng3"],"word":"修整"},{"definition":["firm\/secure"],"pinyin":["lao2 gu4"],"word":"牢固"},{"definition":["to repair\/to renovate"],"pinyin":["xiu1 qi4"],"word":"修葺"},{"definition":["rammed earth"],"pinyin":["hang1 tu3"],"word":"夯土"},{"definition":["fort"],"pinyin":["bao3 lei3"],"word":"堡垒"},{"definition":["to dig out\/to excavate\/to scoop out"],"pinyin":["kai1 wa1"],"word":"开挖"}]}