{"definition":["to work overtime"],"pinyin":["jia1 ban1"],"traditional":["加班"],"rank":7150.0,"normalized_rank":0.10003777650301512,"fraction":0.000014263619898306256,"cumulative_fraction":0.8986933191251434,"word":"加班","characters":[{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"},{"definition":["team\/class\/squad\/work shift\/ranking\/CL:個|个[ge4]\/classifier for groups","surname Ban"],"pinyin":["ban1","Ban1"],"word":"班"}],"containing_words":[],"sentences":[{"english":"Able to work under pressure, working independently, willingness to work overtime or work with shift.","chinese":"具抗压性，能独立作业，并配合加班及轮班。"},{"english":"On behalf of the staff at Canada Weifang Secondary School (CWSS), we would like to welcome you.","chinese":"代表中加班的教职员工，我们对您表示衷心地欢迎。"},{"english":"It was also announced that all police leave has been cancelled.","chinese":"同时，所有休假的警察都已被要求回岗加班。"},{"english":"As a professional, your position will not be entitled for overtime payment.","chinese":"作为一个专业人士，你的岗位不会获得任何加班补贴。"},{"english":"Working overtime for days made him mentally and physically exhausted.","chinese":"加班使他身心十分疲敝。"},{"english":"On holiday the railways run extra trains for special purpose.","chinese":"假日铁路增开加班火车。"},{"english":"Is a worker terminated or disciplined who is not willing to work in overtimes ?","chinese":"不愿加班的工人是否会被解雇或纪律处罚？"},{"english":"EXAMPLE: Our boss was a stern old grinch who made us work on holidays.","chinese":"我们的严厉老板总是败人兴致，让我们在假日加班。"},{"english":"We hope you will contribute unstintingly to the Gum my Bears Overtime Fund.","chinese":"我们希望诸位为“小熊糖加班基金”慷慨解囊。"},{"english":"If Beijing hao's travel, work overtime and put YangManLi children home.","chinese":"假如郝京妮加班和出差，孩子就放杨曼莉家。"},{"english":"B. 4.3 Do all employees receive paid leave according to statutory regulations?","chinese":"法律要求的加班补偿支付给所有员工了吗？"},{"english":"Transport run extra trains during the rush-hour.","chinese":"伦敦运输公司在交通高峰时间增开加班列车。"},{"english":"To this end, my mother has lost substantial section of country which overtime pay.","chinese":"为此，妈妈失去了国兴节丰厚的加班工资。"},{"english":"Don't forget to sign your overtime on our roll book .","chinese":"别忘了在公司考勤表上签上你的加班时间。"},{"english":"Willing to work overtime, result-oriented and hard working spirit.","chinese":"勤奋，愿意加班，以结果为导向。"},{"english":"After working day after day, we can finish the work before it's due.","chinese":"加班，这项工作总算是可以刻期完成了。"}],"related":[{"definition":["to finish work\/to get off work"],"pinyin":["xia4 ban1"],"word":"下班"},{"definition":["to go to work\/to be on duty\/to start work\/to go to the office"],"pinyin":["shang4 ban1"],"word":"上班"},{"definition":["night shift"],"pinyin":["ye4 ban1"],"word":"夜班"},{"definition":["working hours"],"pinyin":["gong1 zuo4 shi2 jian1"],"word":"工作时间"},{"definition":["to shift holidays, taking a weekday off"],"pinyin":["dao3 xiu1"],"word":"倒休"},{"definition":["time of going to work\/the morning rush hour"],"pinyin":["shang4 ban1 shi2 jian1"],"word":"上班时间"},{"definition":["to change shifts\/to work in turns"],"pinyin":["dao3 ban1"],"word":"倒班"},{"definition":["to stay up late or all night"],"pinyin":["ao2 ye4"],"word":"熬夜"},{"definition":["to take a vacation\/to go on holiday"],"pinyin":["xiu1 jia4"],"word":"休假"},{"definition":["(Internet slang) to be dog-tired"],"pinyin":["lei4 cheng2 gou3"],"word":"累成狗"},{"definition":["karoshi (loanword from Japanese), death from overwork"],"pinyin":["guo4 lao2 si3"],"word":"过劳死"},{"definition":["all night\/throughout the night"],"pinyin":["tong1 xiao1"],"word":"通宵"},{"definition":["to go on an official or business trip"],"pinyin":["chu1 chai1"],"word":"出差"},{"definition":["three-shift system (work rostering)"],"pinyin":["san1 ban1 dao3"],"word":"三班倒"},{"definition":["to take deferred time off (to make up for working during the weekend or holidays)\/compensatory leave"],"pinyin":["bu3 xiu1"],"word":"补休"},{"definition":["to request leave of absence"],"pinyin":["qing3 jia4"],"word":"请假"}]}