{"definition":["to make heavier\/to emphasize\/(of an illness etc) to become more serious\/to aggravate (a bad situation)\/to increase (a burden, punishment etc)"],"pinyin":["jia1 zhong4"],"traditional":["加重"],"rank":6239.0,"normalized_rank":0.08729170455976383,"fraction":0.000017458048306925915,"cumulative_fraction":0.8842988828363024,"word":"加重","characters":[{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"},{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["zhong4","chong2"],"word":"重"}],"containing_words":[{"definition":["to give emphasis\/with emphasis"],"pinyin":["jia1 zhong4 yu3 qi4"],"word":"加重语气"}],"sentences":[{"english":"But problems within that force have put additional burdens on MONUC.","chinese":"但是该部队内部的问题加重了MONUC的负担。"},{"english":"Punish recidivists with increased sentences is explicitly promulgated in many countries' penal codes.","chinese":"加重处罚累犯，在很多国家的刑法典中都有明确规定。"},{"english":"Causes on the kidney the knee to abstain the response to cause the blood fine to elevate, causes the condition aggravation.","chinese":"引起肾上膝戒反应而使血精升高，使病情加重。"},{"english":"Nimodipine could prevent the calcium overload in ischemic myocyte.","chinese":"尼莫地平能阻止缺血心肌细胞钙超载的发展和加重。"},{"english":"Conclusion The victim died suddenly after a person being untied because the cerebral e…","chinese":"结论受害者松绑后即死主要是脑水肿即刻加重的结果。"},{"english":"You may be adding considerably to your debt burden.","chinese":"你会大大的加重债务负担。"},{"english":"CVR were worsen graduately with the severity of hypertension.","chinese":"随着高血压程度的加重。"},{"english":"But isolating yourself can only worsenthose depressive symptoms.","chinese":"但是孤立自己只会加重抑郁症状。"},{"english":"Dry towels and heavier cottons in a separate load from lighter-weight clothes.","chinese":"干毛巾和加重棉花在一个单独的负荷由轻重量的衣服。"},{"english":"With the intensification of left ventricular hypertrophy, the LVDF decreased further.","chinese":"且随着左室肥厚的加重，舒张功能进一步减退。"},{"english":"The economic crisis has intensified the pain from all these burdens.","chinese":"而经济危机本身加重了这些负担带来的痛感。"},{"english":"The ground was covered with okra paint, enhancing the redness of theplace.","chinese":"地面铺满秋葵的图案，加重了祭坛内部的红色调。"},{"english":"Merge the brain contusion and laceration more to harm or after the hair brain dropsy, the condition aggravate.","chinese":"多合并脑挫裂伤或者继发性脑水肿，病情加重。"},{"english":"Several drugs may induce or exacerbate symptoms in acute porphyria.","chinese":"几种药物可能会诱发或加重症状的急性卟啉症。"},{"english":"Symptoms are often worse while in bed or first thing in the morning.","chinese":"通常在睡前和晨起时症状加重。"},{"english":"Doesn`t reading in poor light make the eyes focus more and cause myopia to increase?","chinese":"在暗光下阅读，不会使双眼过度聚焦，引起近视加重？"}],"related":[{"definition":["to intensify\/to sharpen\/to accelerate\/to aggravate\/to exacerbate\/to embitter"],"pinyin":["jia1 ju4"],"word":"加剧"},{"definition":["to induce\/to cause\/to elicit\/to trigger"],"pinyin":["you4 fa1"],"word":"诱发"},{"definition":["to lighten\/to ease\/to alleviate"],"pinyin":["jian3 qing1"],"word":"减轻"},{"definition":["to weaken\/to fall off"],"pinyin":["jian3 ruo4"],"word":"减弱"},{"definition":["burden\/to bear a burden"],"pinyin":["fu4 dan1"],"word":"负担"},{"definition":["to worsen"],"pinyin":["e4 hua4"],"word":"恶化"},{"definition":["to harm\/to damage\/to injure\/impairment\/loss\/disability"],"pinyin":["sun3 shang1"],"word":"损伤"},{"definition":["grave\/serious\/severe\/critical"],"pinyin":["yan2 zhong4"],"word":"严重"},{"definition":["to lead to\/to create\/to cause\/to bring about"],"pinyin":["dao3 zhi4"],"word":"导致"},{"definition":["to bring relief\/to alleviate (a crisis)\/to dull (a pain)"],"pinyin":["huan3 jie3"],"word":"缓解"},{"definition":["to reduce\/to lower\/to bring down"],"pinyin":["jiang4 di1"],"word":"降低"},{"definition":["to ebb\/to go down\/to decline"],"pinyin":["jian3 tui4"],"word":"减退"},{"definition":["overweight (luggage)"],"pinyin":["guo4 zhong4"],"word":"过重"},{"definition":["to raise\/to ascend"],"pinyin":["sheng1 gao1"],"word":"升高"},{"definition":["to flare up\/to break out"],"pinyin":["fa1 zuo4"],"word":"发作"},{"definition":["excessive\/over-\/excess\/going too far\/extravagant\/intemperate\/overdue"],"pinyin":["guo4 du4"],"word":"过度"}]}