{"definition":["to utilize\/to put sth to use"],"pinyin":["dong4 yong4"],"traditional":["動用"],"rank":6417.0,"normalized_rank":0.08978215549927945,"fraction":0.000016795163903345887,"cumulative_fraction":0.8873464069520838,"word":"动用","characters":[{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"动"},{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"}],"containing_words":[],"sentences":[{"english":"The hitherto unutilized amount of the property value is opened for use.","chinese":"迄今未动用余额的财产价值是开放供使用。"},{"english":"Only use the handbrake when your vehicle is stationary.","chinese":"只有在停车时才动用手刹。"},{"english":"Bendong block is the biggest one that is not developed in Yanqi Basin.","chinese":"本东区块是焉耆油区最大的未动用含油气区块。"},{"english":"Vertical producing degree of super heavy oil reservoirs in Shul area is understood through monitoring.","chinese":"通过监测手段，了解曙一区超稠油油层纵向动用程度。"},{"english":"The breaking into this money of Vernon's was one of the first great errata of my life;","chinese":"动用佛南这笔款项是我一生中早期重大的错误之一。"},{"english":"The Thai government has no intention of closing the Thai-Cambodia border and will not use military force to deal with this bilateral problem, he said.","chinese":"但他表示泰国不会关闭两国边境或动用武力解决问题。"},{"english":"The other is that it easily suffers from the re-direction attack for the users.","chinese":"该协议对于移动用户易遭受重定向攻击。"},{"english":"It’s time to use the force for good.","chinese":"是时候动用原力了。"},{"english":"WHDH New England's news, weather, sports source.","chinese":"WHDH新英格兰的新闻，天气，运动用品。"},{"english":"Washington also has begun dispersing medicine from a federal stockpile.","chinese":"华盛顿当局也开始动用联邦库存，分发药品。"},{"english":"Both sides engaged in artillery and heavy-machinegun fire.","chinese":"双方均动用了大炮与重型机枪。"},{"english":"He got a gravy-train job in the government by pulling strings.","chinese":"他动用关系在政府部门谋得了一份美差。"},{"english":"The setup is basically the same, but the user interface has been tailored to fit better into the mobile user experience.","chinese":"但用户界面经过调整以更好的适应移动用户体验。"},{"english":"Others have used their political allies to squeeze out foreign partners.","chinese":"其他的一些公司动用政治同盟排挤外国合作伙伴。"},{"english":"What are you using your imagination for?","chinese":"试问你动用你的想象力干了什么？"},{"english":"It maintained its target of having more than 100 million mobile subscribers in 2011.","chinese":"该公司2011年移动用户超过1亿的目标不变。"}],"related":[{"definition":["to summon\/to muster\/to assemble"],"pinyin":["diao4 ji2"],"word":"调集"},{"definition":["to waste\/to spend\/to consume\/to squander"],"pinyin":["hao4 fei4"],"word":"耗费"},{"definition":["to start out on a trip\/to dispatch troops"],"pinyin":["chu1 dong4"],"word":"出动"},{"definition":["to transfer\/to maneuver (troops etc)\/movement of personnel\/to mobilize\/to bring into play"],"pinyin":["diao4 dong4"],"word":"调动"},{"definition":["military"],"pinyin":["jun1 fang1"],"word":"军方"},{"definition":["to start\/to launch\/to unleash\/to mobilize\/to arouse"],"pinyin":["fa1 dong4"],"word":"发动"},{"definition":["to go to war\/to engage in war"],"pinyin":["can1 zhan4"],"word":"参战"},{"definition":["to operate\/to control\/to rig\/to manipulate"],"pinyin":["cao1 zong4"],"word":"操纵"},{"definition":["to get involved in\/to meddle\/interference"],"pinyin":["cha1 shou3"],"word":"插手"},{"definition":["to handle\/to deal with\/to cope\/to get by with"],"pinyin":["dui4 fu5"],"word":"对付"},{"definition":["to help\/to support\/to aid\/aid\/assistance"],"pinyin":["yuan2 zhu4"],"word":"援助"},{"definition":["to transfer (for a specific purpose)\/to allocate\/(computing) to invoke (a command, an application etc)"],"pinyin":["diao4 yong4"],"word":"调用"},{"definition":["to blockade\/to seal off"],"pinyin":["feng1 suo3"],"word":"封锁"},{"definition":["military force"],"pinyin":["wu3 li4"],"word":"武力"},{"definition":["manpower\/labor power"],"pinyin":["ren2 li4"],"word":"人力"},{"definition":["to regain\/to retake\/to take back\/to withdraw\/to revoke"],"pinyin":["shou1 hui2"],"word":"收回"}]}