{"definition":["to collude with\/to collaborate with\/to gang up with"],"pinyin":["gou1 jie2"],"traditional":["勾結"],"rank":10367.0,"normalized_rank":0.14504778028066542,"fraction":0.00000779841678221814,"cumulative_fraction":0.932647552952084,"word":"勾结","characters":[{"definition":["to attract\/to arouse\/to tick\/to strike out\/to delineate\/to collude\/variant of 鉤|钩[gou1], hook","surname Gou","see 勾當|勾当[gou4 dang4]"],"pinyin":["gou1","Gou1","gou4"],"word":"勾"},{"definition":["knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)","(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]"],"pinyin":["jie2","jie1"],"word":"结"}],"containing_words":[],"sentences":[{"english":"A young policeman has been accused of conspiring with a gang of criminals.","chinese":"一名年轻警察被指控与一个犯罪集团相勾结。"},{"english":"He didn't get any money for this. He didn't go to a foreign government.","chinese":"他没有拿情报来卖钱，没有勾结外国政府。"},{"english":"Necklacing was also used to punish members of the black community who were perceived as collaborators with the apartheid regime.","chinese":"也用在黑人团体中和种族隔离政权勾结的成员身上。"},{"english":"Was it possible that the plaintiffs had colluded with Beristain to handpick the interviewees?","chinese":"是否有可能是原告勾结贝斯坦并精心挑选了受访者？"},{"english":"And there has been a recent crackdown on the corrupt nexus between developers and officials.","chinese":"近期政府又打击了一起官商勾结的腐败问题。"},{"english":"Any one who collaborates should be shot.","chinese":"与敌人勾结者一律枪决。"},{"english":"The prime minister YuWenHuaJi in order to take the throne with collude with the turks.","chinese":"丞相宇文化及为了夺取皇位同突厥暗中勾结。"},{"english":"This idiom is used to describe doing evil things in collusion with others.","chinese":"狼狈为奸这个成语比喻坏人互相勾结起来干坏事。"},{"english":"In part four, I study the applicant and so on defrauds insurance money together with the insurance -company' staff.","chinese":"第四部分，内外勾结骗取保险公司保险金的定性问题。"},{"english":"Therefore, the government said that Anwar colludes with US, is I not clear matter.","chinese":"因此，政府说安华勾结美国，是我所不明白的事。"},{"english":"Several journalists were found to be hand and glove with enemy agents.","chinese":"有几位新闻记者被查出与敌特勾结。"},{"english":"Several high-ranking diplomats were found to be hand and glove with enemy agents.","chinese":"有几个高级外交官被发现与敌方人员勾结。"},{"english":"Human society is a struggle between good and evil.","chinese":"社会乃善与恶的斗争，恶人易以利害互相勾结。"},{"english":"The police were corrupt and were operating in collusion with the drug dealers.","chinese":"警察腐败，与那伙毒品贩子内外勾结。"},{"english":"The result is collusion of power and capital, which has led to the current situation.","chinese":"结果就会造成力量与权力的勾结，导致目前的状况。"},{"english":"It's said the drug pushers stand in with the police.","chinese":"听说毒贩都和警方相勾结。"}],"related":[{"definition":["to act in collusion (idiom); in cahoots with\/villains will look after one another"],"pinyin":["hang4 xie4 yi1 qi4"],"word":"沆瀣一气"},{"definition":["to act in collusion (idiom)"],"pinyin":["chuan4 tong1 yi1 qi4"],"word":"串通一气"},{"definition":["to conspire\/to plot together"],"pinyin":["he2 mou2"],"word":"合谋"},{"definition":["to conspire to murder\/to plot against sb's life"],"pinyin":["mou2 hai4"],"word":"谋害"},{"definition":["to incite\/to stir up\/to instigate"],"pinyin":["tiao3 suo1"],"word":"挑唆"},{"definition":["villains collude together (idiom); to work hand in glove with sb (to nefarious ends)"],"pinyin":["lang2 bei4 wei2 jian1"],"word":"狼狈为奸"},{"definition":["to conspire"],"pinyin":["tu2 mou2"],"word":"图谋"},{"definition":["to shield\/to harbor\/to cover up"],"pinyin":["bao1 bi4"],"word":"包庇"},{"definition":["a spy\/a crafty person"],"pinyin":["jian1 xi5"],"word":"奸细"},{"definition":["conspiracy\/secret plan\/to conspire"],"pinyin":["mi4 mou2"],"word":"密谋"},{"definition":["to entrap\/to set up\/to frame (up)\/to make false charges against"],"pinyin":["xian4 hai4"],"word":"陷害"},{"definition":["treason"],"pinyin":["pan4 guo2"],"word":"叛国"},{"definition":["to kill secretly\/to stab in the back"],"pinyin":["an4 hai4"],"word":"暗害"},{"definition":["to entrap\/to frame\/to plant false evidence against sb"],"pinyin":["wu1 xian4"],"word":"诬陷"},{"definition":["to harbor evil intentions (idiom); concealing malice"],"pinyin":["bao1 cang2 huo4 xin1"],"word":"包藏祸心"},{"definition":["harboring unfathomable motives (idiom)"],"pinyin":["ju1 xin1 po3 ce4"],"word":"居心叵测"}]}