{"definition":["medical knowledge\/principles of medical science"],"pinyin":["yi1 li3"],"traditional":["醫理"],"rank":57480.0,"normalized_rank":0.8042197752997635,"fraction":5.970484938653026e-8,"cumulative_fraction":0.9996878037804912,"word":"医理","characters":[{"definition":["medical\/medicine\/doctor\/to cure\/to treat"],"pinyin":["yi1"],"word":"医"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"}],"containing_words":[],"sentences":[{"english":"In the theory of TCM the term \"triple warmer\" is also used to locate the body parts.","chinese":"在中医理论中，三焦也是划分躯体部位的一个概念。"},{"english":"Chinese medicine theory, the waist for kidney Fu, the main female reproductive and menstrual.","chinese":"中医理论中，腰为肾之腑，主生殖和女性月经。"},{"english":"Development and innovation of theory of TCM should sparkplug the standpoint of Yin -Ya ng equalitarian and c…","chinese":"中医理论的发展与创新，应倡导阴阳平等协调的观点。"},{"english":"TCM is characterized by the concept of organic wholeness and treatment based on syndrome differentiation.","chinese":"中医理论体系的基本特点是整体观念和辨证论治。"},{"english":"Theory of TCM, the waist of renal government office of reproductive and female menstruation, Lord.","chinese":"中医理论中，腰为肾之府，主生殖和女性月经。"},{"english":"Inheritance and innovation of Chinese medicine theory has been the world wide attention.","chinese":"如何将中医理论继承和创新已被世人广泛关注。"},{"english":"Yin-yang is involved in every aspect of traditional Chinese medicine's theoretical system.","chinese":"阴阳理论涉及传统中医理论体系的各个方面。"},{"english":"It deals with the philosophic origin of magnifying Yin and respecting Yang idea and its influence to the theory of TCM.","chinese":"讨论崇阴尊阳思想的哲学渊源及其对中医理论的影响。"},{"english":"Without theoretical support the modernization of TCM could only be like a flower as the broad leaved Epiphyllum briefly.","chinese":"没有中医理论的支持，中医药现代化只能是昙花一现。"},{"english":"Traditional Chinese medicine is a natural-philosophized medicine.","chinese":"中医理论是自然哲学性质的医学。"},{"english":"Can abuse blindly in no way, must act according to the Chinese medicine theory, dialectical selects.","chinese":"决不能盲目滥用，必须根据中医理论，辨证选用。"},{"english":"Chinese materia medica refers to medicinals used under the guidance of traditional Chinese medical theory.","chinese":"中药指在中医理论指导下应用的药物。"},{"english":"Viscera-state doctrine, as a basis of TCM theory, has come into being for more than two thousand years.","chinese":"藏象学说作为中医理论的基石已形成两千多年。"}],"related":[{"definition":["art of healing\/medical skill","Hur Jun (TV series)"],"pinyin":["yi1 dao4","Yi1 dao4"],"word":"医道"},{"definition":["pharmacology"],"pinyin":["yao4 li3"],"word":"药理"},{"definition":["medical expertise\/art of healing"],"pinyin":["yi1 shu4"],"word":"医术"},{"definition":["medical book"],"pinyin":["yi1 shu1"],"word":"医书"},{"definition":["healer\/physician\/medical man\/doctor (esp. of TCM)"],"pinyin":["yi1 jia1"],"word":"医家"},{"definition":["(TCM) diagnosis based on the patient's pulse\/to make such a diagnosis"],"pinyin":["mai4 zhen3"],"word":"脉诊"},{"definition":["to feel sb's pulse"],"pinyin":["qie4 mai4"],"word":"切脉"},{"definition":["Western medicine\/a doctor trained in Western medicine"],"pinyin":["xi1 yi1"],"word":"西医"},{"definition":["traditional Chinese medical science\/a doctor trained in Chinese medicine"],"pinyin":["Zhong1 yi1"],"word":"中医"},{"definition":["to feel the pulse (TCM)\/Taiwan pr. [zhen3 mo4]"],"pinyin":["zhen3 mai4"],"word":"诊脉"},{"definition":["proficient (in sth)\/to understand sth through and through"],"pinyin":["tong1 xiao3"],"word":"通晓"},{"definition":["arts of healing, divination, horoscope etc\/supernatural arts (old)"],"pinyin":["fang1 shu4"],"word":"方术"},{"definition":["case history (TCM)\/case record"],"pinyin":["yi1 an4"],"word":"医案"},{"definition":["acupuncture and moxibustion\/to give or have acupuncture and moxibustion"],"pinyin":["zhen1 jiu3"],"word":"针灸"},{"definition":["to apply a treatment\/to undertake a therapy"],"pinyin":["shi1 zhi4"],"word":"施治"},{"definition":["Sun Simiao (c. 581-682), doctor and herbalist of the Sui and Tang dynasty, author of Prescriptions Worth a Thousand in Gold 千金要方[Qian1 jin1 Yao4 fang1]"],"pinyin":["Sun1 Si1 miao3"],"word":"孙思邈"}]}