{"definition":["Easy to raise an army of one thousand, but hard to find a good general. (idiom)"],"pinyin":["qian1 jun1 yi4 de2 , yi1 jiang4 nan2 qiu2"],"traditional":["千軍易得，一將難求"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"千军易得，一将难求","characters":[{"definition":["see 鞦韆|秋千[qiu1 qian1]","thousand"],"pinyin":["qian1","qian1"],"word":"千"},{"definition":["(bound form) army\/military"],"pinyin":["jun1"],"word":"军"},{"definition":["easy\/amiable\/to change\/to exchange\/prefix corresponding to the English adjective suffix \"-able\" or \"-ible\"","surname Yi\/abbr. for 易經|易经[Yi4 jing1], the Book of Changes"],"pinyin":["yi4","Yi4"],"word":"易"},{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"word":"，"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])","general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead"],"pinyin":["qiang1","jiang1","jiang4"],"word":"将"},{"definition":["difficult (to...)\/problem\/difficulty\/difficult\/not good","disaster\/distress\/to scold"],"pinyin":["nan2","nan4"],"word":"难"},{"definition":["to seek\/to look for\/to request\/to demand\/to beseech"],"pinyin":["qiu2"],"word":"求"}],"containing_words":[],"sentences":[],"related":[{"definition":["there are no poor soldiers under a good general (idiom)"],"pinyin":["qiang2 jiang4 shou3 xia4 wu2 ruo4 bing1"],"word":"强将手下无弱兵"},{"definition":["talented field commander (military)"],"pinyin":["jiang4 cai2"],"word":"将才"},{"definition":["a fine bird chooses a tree to nest in (proverb)\/fig. a talented person chooses a patron of integrity"],"pinyin":["liang2 qin2 ze2 mu4 er2 qi1"],"word":"良禽择木而栖"},{"definition":["expert at appointing people according to their abilities (idiom)\/to put the right people in the right places"],"pinyin":["zhi1 ren2 shan4 ren4"],"word":"知人善任"},{"definition":["mediocrity"],"pinyin":["yong1 cai2"],"word":"庸才"},{"definition":["to lead military operations with extraordinary skill"],"pinyin":["yong4 bing1 ru2 shen2"],"word":"用兵如神"},{"definition":["variant of 人才[ren2 cai2]"],"pinyin":["ren2 cai2"],"word":"人材"},{"definition":["lit. Train an army for a thousand days to use it for an hour. (idiom); fig. extensive preparation eventually pays off"],"pinyin":["yang3 bing1 qian1 ri4 , yong4 bing1 yi1 shi2"],"word":"养兵千日，用兵一时"},{"definition":["strategic experts as thick as rain (idiom); no shortage of advisers on strategy"],"pinyin":["mou2 chen2 ru2 yu3"],"word":"谋臣如雨"},{"definition":["Only an outstanding talent can recognize current trends (idiom). A wise man submits to circumstances."],"pinyin":["shi2 shi2 wu4 zhe3 wei4 jun4 jie2"],"word":"识时务者为俊杰"},{"definition":["lit. to dispatch a general is not as effective as to excite a general\/fig. inciting people to action is more effective than dispatching orders"],"pinyin":["qing3 jiang4 bu4 ru2 ji1 jiang4"],"word":"请将不如激将"},{"definition":["The cleverest housewife cannot cook without rice (idiom); You won't get anywhere without equipment."],"pinyin":["qiao3 fu4 nan2 wei2 wu2 mi3 zhi1 chui1"],"word":"巧妇难为无米之炊"},{"definition":["the storm put strong grass to the test (idiom); fig. troubled times test a faithful minister\/to show one's true colors after a stern test\/also written 疾風勁草|疾风劲草"],"pinyin":["ji2 feng1 zhi1 jing4 cao3"],"word":"疾风知劲草"},{"definition":["to appoint people according to their merits (idiom); appointment on the basis of ability and integrity"],"pinyin":["ren4 ren2 wei2 xian2"],"word":"任人唯贤"},{"definition":["lit. raised up by Xiao He, cast down by Xiao He (idiom), alluding to Han Xin 韓信|韩信[Han2 Xin4] being made Grand General 大將軍|大将军[da4 jiang1 jun1]\/fig. a situation where one's success and failure are both due to the same factor"],"pinyin":["cheng2 ye3 Xiao1 He2 , bai4 ye3 Xiao1 He2"],"word":"成也萧何，败也萧何"},{"definition":["before the troops move, fodder and provisions go first (idiom); logistics comes before military maneuvers\/an army marches on its stomach"],"pinyin":["bing1 ma3 wei4 dong4 , liang2 cao3 xian1 xing2"],"word":"兵马未动，粮草先行"}]}