{"definition":["lit. a thousand mile journey begins with the first step\/fig. big accomplishments come from an accumulation of little achievements made one by one"],"pinyin":["qian1 li3 zhi1 xing2 , shi3 yu2 zu2 xia4"],"traditional":["千里之行，始於足下"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"千里之行，始于足下","characters":[{"definition":["see 鞦韆|秋千[qiu1 qian1]","thousand"],"pinyin":["qian1","qian1"],"word":"千"},{"definition":["li, ancient measure of length, approx. 500 m\/neighborhood\/ancient administrative unit of 25 families\/(Tw) borough, administrative unit between the township 鎮|镇[zhen4] and neighborhood 鄰|邻[lin2] levels","Li (surname)","lining\/interior\/inside\/internal\/also written 裏|里[li3]","variant of 裡|里[li3]"],"pinyin":["li3","Li3","li3","li3"],"word":"里"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"},{"word":"，"},{"definition":["to begin\/to start\/then\/only then"],"pinyin":["shi3"],"word":"始"},{"definition":["surname Yu","to go\/to take\/sentence-final interrogative particle\/variant of 於|于[yu2]","in\/at\/to\/from\/by\/than\/out of"],"pinyin":["Yu2","yu2","yu2"],"word":"于"},{"definition":["excessive","foot\/to be sufficient\/ample"],"pinyin":["ju4","zu2"],"word":"足"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[],"related":[{"definition":["lit. ninety li is merely a half of a hundred li journey (idiom)\/fig. the closer one is to completing a task, the tougher it gets\/a task is not done until it's done"],"pinyin":["xing2 bai3 li3 zhe3 ban4 jiu3 shi2"],"word":"行百里者半九十"},{"definition":["there is nothing the determined person can't accomplish (idiom)\/persistence will overcome"],"pinyin":["shi4 shang4 wu2 nan2 shi4 , zhi3 pa4 you3 xin1 ren2"],"word":"世上无难事，只怕有心人"},{"definition":["a really determined person will find a solution (idiom); where there's a will, there's a way"],"pinyin":["you3 zhi4 zhe3 shi4 jing4 cheng2"],"word":"有志者事竟成"},{"definition":["towering buildings are built up from the ground (idiom)\/great oaks from little acorns grow"],"pinyin":["wan4 zhang4 gao1 lou2 ping2 di4 qi3"],"word":"万丈高楼平地起"},{"definition":["lit. piling up dirt eventually creates a mountain (idiom)\/fig. success is the cumulation of lots of small actions"],"pinyin":["ji1 tu3 cheng2 shan1"],"word":"积土成山"},{"definition":["one step, one footprint (idiom); steady progress\/reliable"],"pinyin":["yi1 bu4 yi1 ge4 jiao3 yin4"],"word":"一步一个脚印"},{"definition":["every beginning is difficult (idiom)\/getting started is always the hardest part"],"pinyin":["wan4 shi4 kai1 tou2 nan2"],"word":"万事开头难"},{"definition":["you get what you put in\/you reap what you sow"],"pinyin":["yi1 fen1 geng1 yun2 , yi1 fen1 shou1 huo4"],"word":"一分耕耘，一分收获"},{"definition":["mastery of study lies in diligence (idiom). You can only master a subject by assiduous study.\/Excellence in work is only possible with diligence.\/Practice makes perfect."],"pinyin":["ye4 jing1 yu2 qin2"],"word":"业精于勤"},{"definition":["almost everything has a start, but not many things have an end (idiom); don't start sth you can't handle"],"pinyin":["mi3 bu4 you3 chu1 , xian3 ke4 you3 zhong1"],"word":"靡不有初，鲜克有终"},{"definition":["lit. sharpening the axe won't make the wood-splitting take longer (idiom)\/fig. time invested in preparations is not lost\/a beard well lathered is half shaved"],"pinyin":["mo2 dao1 bu4 wu4 kan3 chai2 gong1"],"word":"磨刀不误砍柴工"},{"definition":["see 行萬里路，讀萬卷書|行万里路，读万卷书[xing2 wan4 li3 lu4 , du2 wan4 juan4 shu1]"],"pinyin":["du2 wan4 juan4 shu1 , xing2 wan4 li3 lu4"],"word":"读万卷书，行万里路"},{"definition":["lit. nothing is difficult on this earth, if your mind is set (idiom)"],"pinyin":["tian1 xia4 wu2 nan2 shi4 , zhi3 pa4 you3 xin1 ren2"],"word":"天下无难事，只怕有心人"},{"definition":["If you work at it hard enough, you can grind an iron bar into a needle.\/cf idiom 磨杵成針|磨杵成针, to grind an iron bar down to a fine needle (idiom); fig. to persevere in a difficult task\/to study diligently"],"pinyin":["zhi3 yao4 gong1 fu5 shen1 , tie3 chu3 mo2 cheng2 zhen1"],"word":"只要功夫深，铁杵磨成针"},{"definition":["effort will undoubtedly lead to success (idiom)"],"pinyin":["gong1 dao4 zi4 ran2 cheng2"],"word":"功到自然成"},{"definition":["to have one's feet firmly planted on the ground (idiom); realistic without flights of fancy\/steady and serious character"],"pinyin":["jiao3 ta4 shi2 di4"],"word":"脚踏实地"}]}