{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"traditional":["協助"],"rank":3219.0,"normalized_rank":0.045037986372476316,"fraction":0.00004428727634788043,"cumulative_fraction":0.8008000660901422,"word":"协助","characters":[{"definition":["to cooperate\/to harmonize\/to help\/to assist\/to join"],"pinyin":["xie2"],"word":"协"},{"definition":["to help\/to assist"],"pinyin":["zhu4"],"word":"助"}],"containing_words":[],"sentences":[{"english":"All these facilities help society reduce the generation gap between the elderly and the others.","chinese":"这可以协助缩小老人和其他人之间的代沟。"},{"english":"An easy to use collaborative environment for editing and running features. There is already RubyMine and LowDown, but I have some different ideas myself.","chinese":"提供易于使用的协助环境来编辑和运行相关功能。"},{"english":"The economic development that the bank helped spur has unleashed a wave of environmental woes.","chinese":"亚银协助亚洲经济快速发展，引爆一波环保灾难。"},{"english":"And these various feedback mechanisms quickly facilitate jumpstarting the necessary people into action.","chinese":"这些反馈机制能够及时协助有关人员迅速采取行动。"},{"english":"Broken glass and pipettes are \"sharps\". Dispose of them correctly too.","chinese":"弃置大件玻璃利器时，请通知当值职员协助妥善处理。"},{"english":"Max enlisted the help of his neighbors to find his missing dog.","chinese":"麦斯寻求邻居协助他寻找失踪的狗儿。"},{"english":"A Soviet naval base near Murmansk helped the Nazi attack on Norway.","chinese":"苏联摩尔曼斯克一处海军基地协助纳粹攻击挪威。"},{"english":"The gall bladder stores and discharges the bile, which helps to break down fats into minute droplets.","chinese":"胆囊储存和释放胆汁，协助脂肪分解为微小的颗粒。"},{"english":"The clerk assisted the judge by looking up related precedents.","chinese":"这位书记官协助那位法官查阅有关判例。"},{"english":"The farthest Francis and I have gotten is world 7 with some help from his mom.","chinese":"佛朗西斯和我在他妈妈的协助下最高玩到七级世界。"},{"english":"Support to set up and maintain MXM Export Compliance system.","chinese":"协助建立和维护美捷特厦门出口控制系统。"},{"english":"The office in BeiJing will offer the help according to the condition.","chinese":"北京市外办将酌情协助安排。"},{"english":"When 6. free times the assistance warehouse tube processes the warehouse thing.","chinese":"空闲时协助仓管员处理仓库事物。"},{"english":"She was assisted in the management of her vast property by her son-in-law Mathur Mohan.","chinese":"她被女婿马图尔巴乌任命去协助管理巨大的财富。"},{"english":"When Ed finds out, Sam agrees to help the FBI capture several key members of the cartel.","chinese":"艾德发现，曼霞协助警方追查组织的几位头号人物。"},{"english":"Kondo, who have ably assisted me for the continue tgoy ages, and have be connected with the firm from the date of its establishment.","chinese":"该员自自己搞成立二十年来，一直在协助一自己任务。"}],"related":[{"definition":["to cooperate\/in coordination with\/coordinated\/collaborate\/collaboration\/collaborative"],"pinyin":["xie2 tong2"],"word":"协同"},{"definition":["to assign\/to appoint\/assignment"],"pinyin":["zhi3 pai4"],"word":"指派"},{"definition":["cooperation\/coordination"],"pinyin":["xie2 zuo4"],"word":"协作"},{"definition":["to join forces\/to give full cooperation"],"pinyin":["tong1 li4 he2 zuo4"],"word":"通力合作"},{"definition":["to control\/to supervise\/to inspect"],"pinyin":["jian1 du1"],"word":"监督"},{"definition":["to send (on a mission)\/to dispatch"],"pinyin":["pai4 qian3"],"word":"派遣"},{"definition":["to help\/to support\/to aid\/aid\/assistance"],"pinyin":["yuan2 zhu4"],"word":"援助"},{"definition":["specialist\/person appointed for specific task"],"pinyin":["zhuan1 ren2"],"word":"专人"},{"definition":["to supervise and urge completion of a task\/to urge on"],"pinyin":["du1 cu4"],"word":"督促"},{"definition":["so that\/so as to\/in order to"],"pinyin":["yi3 bian4"],"word":"以便"},{"definition":["to be in charge of\/to take responsibility for\/to be to blame\/conscientious"],"pinyin":["fu4 ze2"],"word":"负责"},{"definition":["to appoint"],"pinyin":["wei3 pai4"],"word":"委派"},{"definition":["to organize\/organization\/(biology) tissue\/(textiles) weave\/CL:個|个[ge4]"],"pinyin":["zu3 zhi1"],"word":"组织"},{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge","to combine\/to amalgamate","variant of 並|并[bing4]"],"pinyin":["bing4","bing4","bing4"],"word":"并"},{"definition":["to entrust\/to trust\/to commission"],"pinyin":["wei3 tuo1"],"word":"委托"},{"definition":["to get in touch with\/to contact\/to stay in contact (with)\/liaison\/(math.) connection"],"pinyin":["lian2 luo4"],"word":"联络"}]}