{"definition":["seller (in contracts)"],"pinyin":["mai4 fang1"],"traditional":["賣方"],"rank":11284.0,"normalized_rank":0.15787780000839474,"fraction":0.000006774821662662273,"cumulative_fraction":0.939312314053086,"word":"卖方","characters":[{"definition":["to sell\/to betray\/to spare no effort\/to show off or flaunt"],"pinyin":["mai4"],"word":"卖"},{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["fang1","Fang1"],"word":"方"}],"containing_words":[],"sentences":[{"english":"If seller's designs are used, the design numbers must be stated in full.","chinese":"若选用卖方花样，必须详细注明花号。"},{"english":"The developer claims that this game has been a top-seller on wireless and on retail platforms.","chinese":"开发商声称，这场比赛已顶级无线和卖方的零售平台。"},{"english":"On the other hand, you might get ripped off since you don't know the seller .","chinese":"在另一方面，你可能会被敲竹杠，因为你不知道卖方。"},{"english":"During the warranty period, if the product fails, the sellers will do minor repairs for the product.","chinese":"若产品在保固期内失效时，则卖方为产品做小修。"},{"english":"The age of the carrying vessel chartered by the Seller shall not","chinese":"卖方所租载货船只船龄不得超过15年。"},{"english":"The difference between the two is the bank’s fee and profit.","chinese":"买方和卖方之间的差额就是银行的费用和利润。"},{"english":"But sellers want to offload their risk as well.","chinese":"但是，卖方也想卸下风险。"},{"english":"The Seller should record the configuration state of each product in the product inspection summary.","chinese":"卖方在产品检查记要中要记录每个产品的配置。"},{"english":"All bank charges outside China will be on the account of the Sellers.","chinese":"所有中国之外的银行费用均由卖方承担。"},{"english":"As a rule, the buyers ought to bear the charges of packing.","chinese":"一般来说，包装费由卖方负担。"},{"english":"Seller sends hard copy of BG\/SBLC via bank-bonded courier.","chinese":"卖方通过银行专递发送硬拷贝。"},{"english":"These requirements are considerably more flexible than those provided under (the law of the country of the Seller).","chinese":"那些要件要比卖方地点国的法令的规定矫捷很多。"},{"english":"Buyer issues LOI along with NCND to the Seller.","chinese":"买方向卖方出具意向书和保密协议。"},{"english":"The Seller shall do all jobs of contacting the transportation company.","chinese":"联系运输公司的各项工作完全由卖方承担。"},{"english":"A new buyer-seller watermarking protocol without the third party was proposed, which used the idea of secret sharing and homomorphic public key cryptosystem.","chinese":"提出了一种新的无第三方参与的买方卖方水印协议。"},{"english":"I mean what would the control authority do with the domestic currency owned by foreigners?","chinese":"我的意思是管汇当局是外汇的惟一买方和卖方。"}],"related":[{"definition":["buyer (in contracts)"],"pinyin":["mai3 fang1"],"word":"买方"},{"definition":["to act as intermediary\/to link\/intermediate\/inter-\/agency\/agent"],"pinyin":["zhong1 jie4"],"word":"中介"},{"definition":["down payment\/advance payment"],"pinyin":["ding4 jin1"],"word":"定金"},{"definition":["buyer\/client"],"pinyin":["mai3 jia1"],"word":"买家"},{"definition":["(law) trustee"],"pinyin":["shou4 tuo1 ren2"],"word":"受托人"},{"definition":["to transfer ownership (of a vehicle, securities etc)\/(real estate) conveyancing"],"pinyin":["guo4 hu4"],"word":"过户"},{"definition":["down payment"],"pinyin":["shou3 fu4 kuan3"],"word":"首付款"},{"definition":["borrower\/leaser\/the hiring side of a contract"],"pinyin":["cheng2 zu1 fang1"],"word":"承租方"},{"definition":["developer (of real estate, a commercial product etc)"],"pinyin":["kai1 fa1 shang1"],"word":"开发商"},{"definition":["the lender"],"pinyin":["dai4 kuan3 ren2"],"word":"贷款人"},{"definition":["seller"],"pinyin":["mai4 jia1"],"word":"卖家"},{"definition":["creditor"],"pinyin":["zhai4 quan2 ren2"],"word":"债权人"},{"definition":["debtor"],"pinyin":["zhai4 wu4 ren2"],"word":"债务人"},{"definition":["negotiation (finance)"],"pinyin":["yi4 fu4"],"word":"议付"},{"definition":["cost"],"pinyin":["jia4 kuan3"],"word":"价款"},{"definition":["to defer payment\/to pay back over long term"],"pinyin":["yan2 qi1 fu4 kuan3"],"word":"延期付款"}]}