{"definition":["lit. to sleep on brushwood and taste gall (like King Gou Jian of Yue 勾踐|勾践[Gou1 Jian4]), in order to recall one's humiliations) (idiom)\/fig. to maintain one's resolve for revenge","lit. to lie on firewood and taste gall (idiom); fig. suffering patiently, but firmly resolved on revenge"],"pinyin":["wo4 xin1 chang2 dan3","wo4 xin1 chang2 dan3"],"traditional":["臥薪嘗膽","臥薪嚐膽"],"rank":27317.0,"normalized_rank":0.3822002714311698,"fraction":0.0000012015418467005636,"cumulative_fraction":0.9873858124008426,"word":"卧薪尝胆","characters":[{"definition":["to lie\/to crouch"],"pinyin":["wo4"],"word":"卧"},{"definition":["fuel\/salary"],"pinyin":["xin1"],"word":"薪"},{"definition":["variant of 嘗|尝[chang2]\/to taste\/to experience","to taste\/to try\/to experience\/already\/ever\/once","old variant of 嘗|尝[chang2]"],"pinyin":["chang2","chang2","chang2"],"word":"尝"},{"definition":["gall bladder\/courage\/guts\/gall\/inner container (e.g. bladder of a football, inner container of a thermos)"],"pinyin":["dan3"],"word":"胆"}],"containing_words":[],"sentences":[{"english":"You think it was the resolution of Goujian, the Yue king?","chinese":"你认为是越王勾践卧薪尝胆发奋励志？"},{"english":"The King of Yue, Gou Jian submitted and sued for peace.","chinese":"后越王勾践卧薪尝胆，任用文种和范蠡重振国政。"},{"english":"Why choose Gou yield and Revival.","chinese":"为什么勾践要选择屈服和卧薪尝胆。"},{"english":"This is the story of hardships known Gou same.","chinese":"这与家喻户晓的勾践卧薪尝胆的典故如出一辙。"},{"english":"Maybe the rules of intimacy are something you have to define for yourself.","chinese":"也许，关于亲密，你只能自己定义，靠自己卧薪尝胆。"},{"english":"Story on the hardships do not tell us the virtues of patience it?","chinese":"卧薪尝胆的故事不就告诉我们忍耐的美德吗？"},{"english":"Good people, days, three thousand more can sleep on the brushwood, swallow wu.","chinese":"苦心人，天不负，卧薪尝胆，三千越甲可吞吴。"}],"related":[{"definition":["to endure humiliation as part of an important mission (idiom); to suffer in silence"],"pinyin":["ren3 ru3 fu4 zhong4"],"word":"忍辱负重"},{"definition":["to take revenge and erase humiliation (idiom)"],"pinyin":["bao4 chou2 xue3 chi3"],"word":"报仇雪耻"},{"definition":["to conceal one's strengths and bide one's time (idiom)\/to hide one's light under a bushel"],"pinyin":["tao1 guang1 yang3 hui4"],"word":"韬光养晦"},{"definition":["to be strongly determined to succeed (idiom)"],"pinyin":["fa1 fen4 tu2 qiang2"],"word":"发愤图强"},{"definition":["to work energetically for prosperity (of the country)"],"pinyin":["fen4 fa1 tu2 qiang2"],"word":"奋发图强"},{"definition":["to make an effort to become strong (idiom); determined to do better\/to pull one's socks up"],"pinyin":["fa1 fen4 tu2 qiang2"],"word":"发奋图强"},{"definition":["lit. to break the cauldrons and sink the boats (idiom); fig. to cut off one's means of retreat\/to burn one's boats"],"pinyin":["po4 fu3 chen2 zhou1"],"word":"破釜沉舟"},{"definition":["to bear humiliation to save one's skin (idiom)"],"pinyin":["ren3 ru3 tou1 sheng1"],"word":"忍辱偷生"},{"definition":["lit. to have accumulated knowledge and deliver it slowly (idiom)\/good preparation is the key to success\/to be well prepared"],"pinyin":["hou4 ji1 bo2 fa1"],"word":"厚积薄发"},{"definition":["to take revenge for a past insult\/to expunge a disgrace or humiliation"],"pinyin":["xue3 chi3"],"word":"雪耻"},{"definition":["a really determined person will find a solution (idiom); where there's a will, there's a way"],"pinyin":["you3 zhi4 zhe3 shi4 jing4 cheng2"],"word":"有志者事竟成"},{"definition":["lit. to return to office after living as a hermit on Mount Dongshan (idiom); fig. to make a comeback"],"pinyin":["dong1 shan1 zai4 qi3"],"word":"东山再起"},{"definition":["lit. the birds are over, the bow is put away (idiom); fig. to get rid of sb once he has served his purpose"],"pinyin":["niao3 jin4 gong1 cang2"],"word":"鸟尽弓藏"},{"definition":["to keep on fighting despite continual setbacks (idiom)"],"pinyin":["lu:3 bai4 lu:3 zhan4"],"word":"屡败屡战"},{"definition":["to make painstaking efforts (idiom); after much trouble\/to work hard at sth"],"pinyin":["ku3 xin1 gu1 yi4"],"word":"苦心孤诣"},{"definition":["the task of establishing and maintaining hegemony"],"pinyin":["ba4 ye4"],"word":"霸业"}]}