{"definition":["to defend one's country","state of Wei (c. 1040-209 BC), vassal of Zhou"],"pinyin":["wei4 guo2","Wei4 guo2"],"traditional":["衛國","衛國"],"rank":26551.0,"normalized_rank":0.3714829376128048,"fraction":0.0000012860628926536224,"cumulative_fraction":0.9864329800818836,"word":"卫国","characters":[{"definition":["to guard\/to protect\/to defend\/abbr. for 衛生|卫生, hygiene\/health\/abbr. for 衛生間|卫生间, toilet","surname Wei\/vassal state during the Zhou Dynasty (1066-221 BC), located in present day Henan and Hebei Provinces"],"pinyin":["wei4","Wei4"],"word":"卫"},{"definition":["surname Guo","country\/nation\/state\/national\/CL:個|个[ge4]"],"pinyin":["Guo2","guo2"],"word":"国"}],"containing_words":[{"definition":["guard home, defend the country (idiom); national defense"],"pinyin":["bao3 jia1 wei4 guo2"],"word":"保家卫国"}],"sentences":[{"english":"It's the glorious duty for every soldier to defend our country against enemies.","chinese":"卫国抗敌是每个士兵应尽的光荣职责。"},{"english":"His heart desired this, so he decided to go to Shewei country and learn Buddhism.","chinese":"他心中十分向往，便想去舍卫国观光并修学佛法。"},{"english":"Marshal Zhukov's contribution to the Great Patriotic War is unparalleled to anyone.","chinese":"朱可夫元帅为伟大卫国战争胜利做出的贡献无人能及。"},{"english":"At least the banks would not be holding the whole country hostage.","chinese":"至少银行就不能打着保家卫国的旗号，发国难财了。"},{"english":"His first priority was protecting the country.","chinese":"他的首要任务是保卫国家。"},{"english":"After the Great Patriotic War, the Soviet Union's nuclear fission research have no news.","chinese":"卫国战争爆发后，苏联核裂变研究陷入停滞。"},{"english":"But he that stands by it now, deserves the love and thanks of every man and woman.","chinese":"但真正挺身以卫国者，值得天下男女的爱及感谢。"},{"english":"In the state of Wei, he was besieged and almost killed since he was regarded mistakenly as Yanghu.","chinese":"在卫国，被人误认为阳虎而遭困，差点儿丢了老命。"},{"english":"The protection of the country is the sacred duty of every citizen.","chinese":"保卫国家是每个公民的神圣职责。"},{"english":"What Confucius said couldn't dissuade Yanhui yet. He went on saying, \"I will be upright inside and deferential outside.\"","chinese":"颜回要去卫国的决心并没有因为老师这一席话而打消。"},{"english":"Your charge now is not only to protect our country, but to do what is right and just.","chinese":"你们的使命不仅是保家卫国，更是伸张正义。"},{"english":"They made a promise to our country to be its defenders.","chinese":"他们在保家卫国上做出许诺。"},{"english":"Women now have the ability to fight crime and defend their countries in war.","chinese":"女性如今有能力打击犯罪，更能在战时保家卫国。"},{"english":"Yao Weiguo of the \"hope that the Morning\", the entire screen is Pianleng gray tone.","chinese":"姚卫国的《希望的早晨》，整个画面是偏冷灰调子。"},{"english":"Some officials from Wei made a special trip to Chen to kill the two men.","chinese":"卫国的大臣特地到陈国去执法处死这两个人。"},{"english":"This is what the military leaders, charged with responsibility for our strategic  deterrent, need in order to defend our country.","chinese":"这是肩负战略威慑职责的军事领袖们保家卫国的需要。"}],"related":[{"definition":["the state of Chu, one of the most important of the small states contending for power in China between 770 and 223 BC, located around present-day Hubei"],"pinyin":["Chu3 guo2"],"word":"楚国"},{"definition":["Qi state of Western Zhou and the Warring states (1122-265 BC), centered in Shandong"],"pinyin":["Qi2 guo2"],"word":"齐国"},{"definition":["Lu, vassal state at the time of the Zhou Dynasty 周朝|周朝[Zhou1 chao2], located in the southwest of present-day Shandong 山東|山东[Shan1 dong1], birthplace of Confucius"],"pinyin":["Lu3 guo2"],"word":"鲁国"},{"definition":["Yan, a vassal state of Zhou in modern Hebei and Liaoning\/north Hebei\/the four Yan kingdoms of the Sixteen Kingdoms, namely: Former Yan 前燕 (337-370), Later Yan 後燕|后燕 (384-409), Southern Yan 南燕 (398-410), Northern Yan 北燕 (409-436)"],"pinyin":["Yan1 guo2"],"word":"燕国"},{"definition":["Yue state\/generic term for states in south China or southeast Asia at different historical periods"],"pinyin":["Yue4 guo2"],"word":"越国"},{"definition":["Zhao, one of the seven states during the Warring States Period of Chinese history (475-220 BC)"],"pinyin":["Zhao4 Guo2"],"word":"赵国"},{"definition":["the state of Qin, one of the seven states of the Warring States Period (475-220 BC)"],"pinyin":["Qin2 guo2"],"word":"秦国"},{"definition":["monarch"],"pinyin":["guo2 jun1"],"word":"国君"},{"definition":["Wu state (in south China, in different historical periods)\/Wu state 220-280, founded by Sun Quan 孫權|孙权 the southernmost of the three Kingdoms"],"pinyin":["Wu2 guo2"],"word":"吴国"},{"definition":["Duke Wen of Jin (697-628 BC, reigned 636-628 BC), one of the Five Hegemons 春秋五霸"],"pinyin":["Jin4 Wen2 gong1"],"word":"晋文公"},{"definition":["Wei State (407-225 BC), one of the Seven Hero States of the Warring States 戰國七雄|战国七雄\/Wei State or Cao Wei 曹魏 (220-265), the most powerful of the Three Kingdoms"],"pinyin":["Wei4 guo2"],"word":"魏国"},{"definition":["the Xirong, an ancient ethnic group of Western China from the Zhou Dynasty onwards\/Xionites (Central Asian nomads)"],"pinyin":["Xi1 rong2"],"word":"西戎"},{"definition":["Duke Huan of Qi (reigned 685-643 BC), one of the Five Hegemons 春秋五霸"],"pinyin":["Qi2 Huan2 gong1"],"word":"齐桓公"},{"definition":["the state of Ju, ancient Dongyi state"],"pinyin":["Ju3 guo2"],"word":"莒国"},{"definition":["Duke Mu of Qin, the first substantial king of Qin (ruled 659-621 BC), sometimes considered one of the Five Hegemons 春秋五霸"],"pinyin":["Qin2 Mu4 gong1"],"word":"秦穆公"},{"definition":["Duke Xiang of Song (reigned 650-637 BC), sometimes considered one of the Five Hegemons 春秋五霸"],"pinyin":["Song4 Xiang1 gong1"],"word":"宋襄公"}]}