{"definition":["Ministry of Health"],"pinyin":["Wei4 sheng1 bu4"],"traditional":["衛生部"],"rank":4341.0,"normalized_rank":0.06073622206987254,"fraction":0.00002972192069485056,"cumulative_fraction":0.8413733098780993,"word":"卫生部","characters":[{"definition":["to guard\/to protect\/to defend\/abbr. for 衛生|卫生, hygiene\/health\/abbr. for 衛生間|卫生间, toilet","surname Wei\/vassal state during the Zhou Dynasty (1066-221 BC), located in present day Henan and Hebei Provinces"],"pinyin":["wei4","Wei4"],"word":"卫"},{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"},{"definition":["ministry\/department\/section\/part\/division\/troops\/board\/classifier for works of literature, films, machines etc"],"pinyin":["bu4"],"word":"部"}],"containing_words":[],"sentences":[{"english":"Two are beyond the direct control of the health sector.","chinese":"其中的两个危机在卫生部门的直接控制之外。"},{"english":"The Purchasing Card for Psychotropic Drugs shall be made solely by the Ministry of Public Health.","chinese":"精神药品购用卡》由卫生部统一制定。"},{"english":"Health Minister Chen Zhu, to the General Assembly sent a congratulatory message.","chinese":"卫生部部长陈竺向大会发来了贺信。"},{"english":"Health Minister Chen studied at Paris's St-Louis Hospital.","chinese":"卫生部部长陈竺在巴黎的圣路易医院学习。"},{"english":"The health sector regulates the quality and safety of food and pharmaceutical products.","chinese":"卫生部门控制食品和药品的质量与安全。"},{"english":"However, the Ministry of Health plans to continue intense surveillance activities.","chinese":"但是，卫生部计划继续大力开展监测活动。"},{"english":"Treating efficacy of meropenem was evaluated according to instructing principle of new drug clinical research issued by Ministry of Health.","chinese":"根据卫生部新药临床研究指导原则标准判定疗效。"},{"english":"Additional resources have also been provided to paediatric health care providers by the Ministry of Health.","chinese":"卫生部还为儿科医护机构提供了更多资源。"},{"english":"The Indian health ministry has described the report as \"sensational\".","chinese":"印度卫生部称这一报道是哗众取宠。"},{"english":"Anti-drugs campaign created for the department of Health in Norway.","chinese":"反毒品运动创造了挪威卫生部门。"},{"english":"Leaders in sectors with far more clout than health are making a similar point .","chinese":"影响力远胜卫生部门的领导人也发表了类似的看法。"},{"english":"As action accelerates, the responsibility on the health sector increases.","chinese":"随着行动加快步伐，卫生部门的责任也在增加。"},{"english":"Excellent collaboration between the Ministry of Health and the WHO team continues.","chinese":"卫生部与世卫组织小组之间继续极好的合作。"},{"english":"The results were reported directly to policy-makers at the Ministry of Health.","chinese":"研究结果被直接报告给卫生部的政策制定者。"},{"english":"The containment and control measures that have been implemented by the MoH to date are in accordance with international best practice.","chinese":"乌干达卫生部迄今采取的控制措施符合国际最佳做法。"},{"english":"The health sector means there is no evidence of someone's farm work program error.","chinese":"卫生部门指目前无证据显示涉事农场的工作程序出错。"}],"related":[{"definition":["State Food and Drug Administration (SFDA)"],"pinyin":["Guo2 jia1 Shi2 pin3 Yao4 pin3 Jian1 du1 Guan3 li3 ju2"],"word":"国家食品药品监督管理局"},{"definition":["World Health Organization (WHO)\/abbr. for 世界衛生組織|世界卫生组织[Shi4 jie4 Wei4 sheng1 Zu3 zhi1]"],"pinyin":["Shi4 wei4 Zu3 zhi1"],"word":"世卫组织"},{"definition":["World Health Organization (WHO)"],"pinyin":["Shi4 jie4 Wei4 sheng1 Zu3 zhi1"],"word":"世界卫生组织"},{"definition":["AQSIQ\/PRC State Administration of Quality Supervision, Inspection and Quarantine"],"pinyin":["Guo2 jia1 Zhi4 liang4 Jian1 du1 Jian3 yan4 Jian3 yi4 Zong3 ju2"],"word":"国家质量监督检验检疫总局"},{"definition":["State Food and Drug Administration (SFDA)\/abbr. for 國家食品藥品監督管理局|国家食品药品监督管理局[Guo2 jia1 Shi2 pin3 Yao4 pin3 Jian1 du1 Guan3 li3 ju2]"],"pinyin":["Yao4 jian1 ju2"],"word":"药监局"},{"definition":["Ministry of Agriculture\/Department of Agriculture"],"pinyin":["Nong2 ye4 bu4"],"word":"农业部"},{"definition":["head office\/general office\/central office"],"pinyin":["zong3 ju2"],"word":"总局"},{"definition":["Ministry of Education"],"pinyin":["Jiao4 yu4 bu4"],"word":"教育部"},{"definition":["Ministry of Health and Welfare (Japan) (replaced in 2001 by 厚生勞動省|厚生劳动省[Hou4 sheng1 Lao2 dong4 sheng3])"],"pinyin":["Hou4 sheng1 sheng3"],"word":"厚生省"},{"definition":["Ministry of Health, Labor and Welfare (Japan)"],"pinyin":["Hou4 sheng1 Lao2 dong4 sheng3"],"word":"厚生劳动省"},{"definition":["State Council (PRC)\/State Department (USA)"],"pinyin":["Guo2 wu4 yuan4"],"word":"国务院"},{"definition":["Food and Agriculture Organization of the United Nations (FAO)"],"pinyin":["Lian2 he2 guo2 Liang2 nong2 Zu3 zhi1"],"word":"联合国粮农组织"},{"definition":["(PRC) State Environmental Protection Administration (SEPA), former incarnation (until 2008) of 環境保護部|环境保护部[Huan2 jing4 Bao3 hu4 bu4]"],"pinyin":["Guo2 jia1 Huan2 bao3 Zong3 ju2"],"word":"国家环保总局"},{"definition":["Ministry of the Interior"],"pinyin":["Nei4 zheng4 bu4"],"word":"内政部"},{"definition":["doctor"],"pinyin":["yi1 shi1"],"word":"医师"},{"definition":["Ministry of Civil Affairs (MCA) of the PRC"],"pinyin":["Min2 zheng4 bu4"],"word":"民政部"}]}