{"definition":["to wind\/to coil\/to spool\/to loop around\/winding"],"pinyin":["juan3 rao4"],"traditional":["卷繞"],"rank":60049.0,"normalized_rank":0.8401634183537839,"fraction":4.13116684019268e-8,"cumulative_fraction":0.9998169284363077,"word":"卷绕","characters":[{"definition":["scroll\/book\/volume\/chapter\/examination paper\/classifier for books, paintings: volume, scroll","to roll up\/roll\/classifier for small rolled things (wad of paper money, movie reel etc)","to roll (up)\/to sweep up\/to carry on\/roll"],"pinyin":["juan4","juan3","juan3"],"word":"卷"},{"definition":["variant of 繞|绕[rao4], to rotate around\/to spiral\/to move around\/to go round (an obstacle)\/to by-pass\/to make a detour","to wind\/to coil (thread)\/to rotate around\/to spiral\/to move around\/to go round (an obstacle)\/to by-pass\/to make a detour\/to confuse\/to perplex"],"pinyin":["rao4","rao4"],"word":"绕"}],"containing_words":[],"sentences":[{"english":"The coil is a wound conductive wire having a cross-section of rectangular-shape.","chinese":"线圈是通过卷绕截面为扁平形状的导线而得到的。"},{"english":"Firstly, the characteristics of \"non-round\" winding is analyzed.","chinese":"首先，分析了“非圆”卷绕系统特点。"},{"english":"The products are made of metallized polypropylene film, seal with epoxy resin.","chinese":"金属化聚丙烯膜卷绕而成，阻燃环氧树脂封封。"},{"english":"The driving mechanism further realizes flexible winding of multi-head cords.","chinese":"也可使多头线绳实现柔性卷绕。"},{"english":"The tin wire was spooled  after it was used.","chinese":"焊丝用完后已卷绕起来了。"},{"english":"Besides, the thread rope is respectively curled around the pollex and the middle finger and can prevent the cover body from falling off.","chinese":"且该线绳分别卷绕于姆指及中指上，可防止套体脱落。"},{"english":"Non- inductively wound with metallized polypropylene film.","chinese":"金属化聚丙烯作介质，无感式卷绕。"},{"english":"The application prospects of spirally wound lead acid batteries were presented.","chinese":"展望了卷绕式铅酸蓄电池的应用前景。"},{"english":"The electrode assembly is formed by winding the first and second electrode plates and the separator.","chinese":"电极组件通过卷绕第一和第二电极板以及隔板形成。"},{"english":"Complex accumulations of membranes consisting of vesicular and coiled membranous structures might develop within the plasmalemma invaginations.","chinese":"质膜内陷中的内含物以小泡和卷绕的膜结构形式存在。"},{"english":"Gradually expanding machine head, reducing energy consumption, improving the winding yarn.","chinese":"逐步扩大机台头数，降低能耗，完善卷绕纱筒。"},{"english":"The winding tension can be adjusted at ease in pre-take-up roller.","chinese":"卷绕张力可以在超喂罗拉上任意调节。"},{"english":"The ways to determine the wound coil number and the thickness of sectional warp were investigated.","chinese":"最后讨论了条带卷绕圈数及条带厚度的确定方法。"},{"english":"The grooved drum is a shaped part which is widely used in bobbin winding machines.","chinese":"槽筒是自动络筒机上用于卷绕成形的关键零件。"},{"english":"Due to the brittleness of fiber, the godet and wingding rollers with large diameter were used.","chinese":"由于光纤比较脆，采用了大尺寸的导丝盘和卷绕筒。"},{"english":"The skein after winding is characterized by even thickness and good form.","chinese":"卷绕后的丝片具有厚薄均匀，成形良好的特点。"}],"related":[{"definition":["spinneret\/extrusion nozzle"],"pinyin":["pen1 si1 tou2"],"word":"喷丝头"},{"definition":["to revolve\/stone roller"],"pinyin":["gun3"],"word":"辊"},{"definition":["doubling (combining two or more lengths of yarn into a single thread)"],"pinyin":["bing4 sha1"],"word":"并纱"},{"definition":["drawing (textile industry)"],"pinyin":["bing4 tiao2"],"word":"并条"},{"definition":["warp (vertical thread in weaving)"],"pinyin":["jing1 sha1"],"word":"经纱"},{"definition":["woof (horizontal thread in weaving)\/weft"],"pinyin":["wei3 sha1"],"word":"纬纱"},{"definition":["to clamp\/tongs"],"pinyin":["jia1 chi2"],"word":"夹持"},{"definition":["cop (textiles)"],"pinyin":["guan3 sha1"],"word":"管纱"},{"definition":["solenoid (electrical engineering)\/coil"],"pinyin":["xian4 quan1"],"word":"线圈"},{"definition":["drawing (manufacturing process in which hot metal or glass is stretched)"],"pinyin":["la1 zhi4"],"word":"拉制"},{"definition":["tape"],"pinyin":["juan3 dai4"],"word":"卷带"},{"definition":["to straighten\/(fig.) to mend one's ways"],"pinyin":["jiao3 zhi2"],"word":"矫直"},{"definition":["to bend"],"pinyin":["wan1 zhe2"],"word":"弯折"},{"definition":["foil\/Taiwan pr. [jin1 shu3 bo2 pian4]"],"pinyin":["jin1 shu3 bao2 pian4"],"word":"金属薄片"},{"definition":["spiral surface"],"pinyin":["luo2 xuan2 qu1 mian4"],"word":"螺旋曲面"},{"definition":["to join with glue"],"pinyin":["jiao1 he2"],"word":"胶合"}]}