{"definition":["to unload"],"pinyin":["xie4 xia4"],"traditional":["卸下"],"rank":17035.0,"normalized_rank":0.2383417514306101,"fraction":0.0000032723804613639336,"cumulative_fraction":0.9665323382149992,"word":"卸下","characters":[{"definition":["to unload\/to unhitch\/to remove or strip\/to get rid of"],"pinyin":["xie4"],"word":"卸"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[{"english":"The grounding wires can be fixed on case body and case door. The connecting parts can be detached.","chinese":"箱体和箱门上都可安装接地线，连接件可以卸下。"},{"english":"Lift up the car , remove wheels .","chinese":"首先升起汽车，卸下轮榖。"},{"english":"Two soldiers dismounted the gun from the base.","chinese":"两个战士把炮从底座上卸下来。"},{"english":"They detach the tailer, and start to camp.","chinese":"他们卸下挂车，开始扎营。"},{"english":"Loosen setscrew 1 in the oil shieldplate, and remove oil shieldplate 2.","chinese":"请拧松防油板固定螺丝1，然后卸下防油板2。"},{"english":"A fishing trawler unloads crates of frozen fish.","chinese":"渔船在码头卸下的一箱箱冷冻海鱼。"},{"english":"About one minute later, Jay was at her door with screwdriver in hand and took the door off the hinges.","chinese":"一会儿，杰伊拿着螺丝刀把门上的小五金零件卸下了。"},{"english":"He had taken a summer job and was unloading some sheetrock at work.","chinese":"他拿了一份暑期工被卸下部分胶纸夹板工作。"},{"english":"Multiple payment options. Can easily return money for product unshipped .","chinese":"多种支付选择，能够很容易因为产品被卸下船还钱。"},{"english":"Debus turn head in the manhole 2 to have equipments smoothly entered.","chinese":"在人井2中，将弯头卸下，便于设备进入。"},{"english":"But sellers want to offload their risk as well.","chinese":"但是，卖方也想卸下风险。"},{"english":"pigs being trampled by one another while being unloaded from a truck by a worker with a paddle;","chinese":"猪从卡车上卸下时，被工人使用棍棒驱赶而相互践踏。"},{"english":"Have you ever used a hammer and screwdriver to loosen a nut from a bolt?","chinese":"您是否曾经使用一个锤子和螺丝刀来卸下一个螺母？"},{"english":"Removing Duette blinds is very simple and only requires a drill with a Phillips drill bit.","chinese":"卸下迪埃特百叶窗非常简单，只需要一个十字钻头钻。"},{"english":"The soldiers dismounted a gun from the guncarriage.","chinese":"战士们从炮车上卸下大炮。"},{"english":"Remove the cartridge, the case cover and the small cover.","chinese":"卸下墨盒和左侧机箱头盖及后小盖板。"}],"related":[{"definition":["to lay down\/to put down\/to let go of\/to relinquish\/to set aside\/to lower (the blinds etc)"],"pinyin":["fang4 xia4"],"word":"放下"},{"definition":["to unload\/to unhitch\/to remove or strip\/to get rid of"],"pinyin":["xie4"],"word":"卸"},{"definition":["traveling bag\/luggage"],"pinyin":["xing2 nang2"],"word":"行囊"},{"definition":["to throw off"],"pinyin":["tuo1 qu4"],"word":"脱去"},{"definition":["to remove\/to take off\/to strip off\/to discard\/to shed\/to come off\/to fall off"],"pinyin":["tuo1 diao4"],"word":"脱掉"},{"definition":["to take off (clothing)"],"pinyin":["tuo1 xia4"],"word":"脱下"},{"definition":["to take off\/to remove (one's hat, a door from its hinges etc)\/to pick (a piece of fruit from a tree etc)\/(sports) to pick off (a rebound etc)"],"pinyin":["zhai1 xia4"],"word":"摘下"},{"definition":["to take off (trousers)\/to drop one's pants"],"pinyin":["tun4 xia4"],"word":"褪下"},{"definition":["beaten\/exhausted\/tired"],"pinyin":["pi2 bei4"],"word":"疲惫"},{"definition":["to fill up"],"pinyin":["zhuang1 man3"],"word":"装满"},{"definition":["to take along with one"],"pinyin":["dai4 shang4"],"word":"带上"},{"definition":["to lay\/to place\/to put in a certain place"],"pinyin":["an1 fang4"],"word":"安放"},{"definition":["to throw off\/to abandon\/to cast off\/to get rid of\/to dump"],"pinyin":["shuai3 diao4"],"word":"甩掉"},{"definition":["to throw down\/to dump\/to abandon\/thrown down"],"pinyin":["pao1 xia4"],"word":"抛下"},{"definition":["to take off (one's clothes)\/(fig.) to shed (one's former image etc)\/(of a fad or the after-effects of a disaster etc) to subside\/also pr. [tun4 qu4]"],"pinyin":["tui4 qu4"],"word":"褪去"},{"definition":["to raise aloft with both hands\/(of two or more people) to carry sth together","old variant of 扛[gang1]","to carry on one's shoulder\/(fig.) to take on (a burden, duty etc)"],"pinyin":["gang1","gang1","kang2"],"word":"扛"}]}