{"definition":["crude oil"],"pinyin":["yuan2 you2"],"traditional":["原油"],"rank":1840.0,"normalized_rank":0.02574398723993676,"fraction":0.00008446192501417964,"cumulative_fraction":0.7175584896582666,"word":"原油","characters":[{"definition":["Hara (Japanese surname)","former\/original\/primary\/raw\/level\/cause\/source"],"pinyin":["Yuan2","yuan2"],"word":"原"},{"definition":["oil\/fat\/grease\/petroleum\/to apply tung oil, paint or varnish\/oily\/greasy\/glib\/cunning"],"pinyin":["you2"],"word":"油"}],"containing_words":[],"sentences":[{"english":"Desalting of crude oil consumes huge quantity of fresh water.","chinese":"原油脱盐要消耗大量的新鲜水。"},{"english":"Clean ballast tanks are dedicated to ballasting operations and their contents are not mixed with fuel or oil.","chinese":"意思就是不装燃油或者原油的专用压在舱。"},{"english":"In another month, Sino-Russian crude oil pipeline will officially supply oil.","chinese":"再过一个多月，中俄原油管道将正式供油。"},{"english":"China sold $325.8 million of crude oil to North Korea last year, up 37 percent from 2009.","chinese":"朝鲜去年向中国购买物资中，原油占最多。"},{"english":"Macao beach facilities, power plants and oil storage tank anti-corrosion.","chinese":"澳门电厂海边设施及原油储油罐防腐。"},{"english":"Who has presided over an oil-driven bonanza for his country.","chinese":"他曾为自己的国家赢得了一笔受原油驱使的巨大财富。"},{"english":"Oil pump units are the key instruments in crude oil transportation system.","chinese":"输油泵机组是原油集输系统的关键设备。"},{"english":"The first of what would turn out to be 10.8 million gal. of oil began to spew forth into the cold waters.","chinese":"1080万加仑的原油喷涌到冰冷的海水中。"},{"english":"Sanshui's crude oil in the east of South China Sea has been evaluated.","chinese":"对南海东部三水原油进行初步评价。"},{"english":"Instead, just deploy an army of autonomous, oil-scrubbing robots.","chinese":"相反，只需要部署一支自主的原油擦洗机器人小分队。"},{"english":"The hydrogeologic situation and the distribution of major oil region in Zhongyuan Oilfield are introduced.","chinese":"介绍了中原油田的水文地质概况及主要油区的分布。"},{"english":"Iraq's self-ruled Kurdish region has started exporting crude oil for the first time.","chinese":"伊拉克库尔德自治区开始首次出口原油。"},{"english":"The other one comes mainly from Fengcheng group source rocks of Permian.","chinese":"第二类原油主要来源于二叠系风城组烃源岩。"},{"english":"The oil from Kongdian Formation is immature crude oil.","chinese":"孔店组原油为低熟油。"},{"english":"Chonggao crude oil fell yesterday, the US-led rebound stabilized.","chinese":"昨日原油冲高回落，带动美豆止跌反弹。"},{"english":"Beam pumping units have widely been used in oil fields.","chinese":"原油生产中普遍使用游梁式抽油机。"}],"related":[{"definition":["oil (petroleum) price"],"pinyin":["you2 jia4"],"word":"油价"},{"definition":["gold\/golden (opportunity)\/prime (time)"],"pinyin":["huang2 jin1"],"word":"黄金"},{"definition":["OPEC\/Organization of the Petroleum Exporting Countries"],"pinyin":["Ou1 pei4 ke4"],"word":"欧佩克"},{"definition":["phony\/so-called\/armchair (expert)\/vain (promise)\/(finance) short-seller\/bear (market)\/short (selling)"],"pinyin":["kong1 tou2"],"word":"空头"},{"definition":["in a few days\/one of these days"],"pinyin":["ri4 nei4"],"word":"日内"},{"definition":["bull market (prices appear to be rising)"],"pinyin":["kan4 zhang3"],"word":"看涨"},{"definition":["short term"],"pinyin":["duan3 xian4"],"word":"短线"},{"definition":["poor prospects in the short term (finance)"],"pinyin":["duan3 kong1"],"word":"短空"},{"definition":["exchange rate"],"pinyin":["hui4 jia4"],"word":"汇价"},{"definition":["many-headed\/many-layered (authority)\/devolved (as opposed to centralized)\/pluralistic\/(as classifier) number of animals\/long term (finance)\/long (investment)"],"pinyin":["duo1 tou2"],"word":"多头"},{"definition":["to continue to fall (of share prices)"],"pinyin":["xu4 die1"],"word":"续跌"},{"definition":["market price\/quotation of market price\/the current market situation"],"pinyin":["hang2 qing2"],"word":"行情"},{"definition":["good prospects in the short term (finance)"],"pinyin":["duan3 duo1"],"word":"短多"},{"definition":["methyl alcohol\/methanol CH3OH\/wood alcohol\/wood spirit"],"pinyin":["jia3 chun2"],"word":"甲醇"},{"definition":["fuel oil"],"pinyin":["ran2 liao4 you2"],"word":"燃料油"},{"definition":["iron ore"],"pinyin":["tie3 kuang4 shi2"],"word":"铁矿石"}]}