{"definition":["to stay together\/to rely on one another"],"pinyin":["si1 shou3"],"traditional":["廝守"],"rank":35670.0,"normalized_rank":0.4990695787220349,"fraction":5.712104539107407e-7,"cumulative_fraction":0.9944426567075408,"word":"厮守","characters":[{"definition":["mutually\/with one another\/manservant\/boy servant\/guy (derog.)","variant of 廝|厮[si1]"],"pinyin":["si1","si1"],"word":"厮"},{"definition":["to guard\/to defend\/to keep watch\/to abide by the law\/to observe (rules or ritual)\/nearby\/adjoining"],"pinyin":["shou3"],"word":"守"}],"containing_words":[],"sentences":[{"english":"Unlike most other fish, they are monogamous and mate for life.","chinese":"不像其他的鱼类，它们是一夫一妻制并终生厮守。"},{"english":"I hope we can spend just as many as more years together.","chinese":"希望我们能天长地久，永远厮守在一起。"},{"english":"Working is like old-time marriage, obviously you got no happiness, but still you have to live with it.","chinese":"上班就像旧时代的婚姻，明明不幸福，还得长相厮守。"},{"english":"Possession hinders enjoyment and increase annoyance whethe_r you lend or keep.","chinese":"占有总是妨碍享受，徒增烦扰，无论你借出还是厮守。"},{"english":"Always being together is my greatest happiness.","chinese":"与你长相厮守，是我最大的幸福。"},{"english":"Find amusement when the occasion arises and sincerity, in the heart forever have clear dividing line.","chinese":"逢场作戏和真心厮守，在心里永远有明显的分界线。"},{"english":"Why am I so scared of that time goes away and can not be allowed stay with you everlastingly .","chinese":"为什么我总害怕时光飞逝而无法与你终生厮守？"},{"english":"Yuan, let us together for a lifetime, days without edges, in which birds must dare and the king must.","chinese":"媛，让我们厮守终生，天无棱，鸟飞绝，才敢与君绝。"},{"english":"If we’ve made plans to get together, we’ve been looking forward to it all day.","chinese":"如果我们计划要厮守，肯定早就整天期待了。"},{"english":"He came to your city, in the corner of the carport together for ever figure.","chinese":"他来到你的城市，在街角车棚里厮守曾经身影。"},{"english":"Find amusement when the occasion arises and sincerity, always have a clear dividing line in the heart.","chinese":"逢场作戏和真心厮守，在心里永远有明显的分界线。"},{"english":"One year of service-in exchange for a lifetime with Sabrina.","chinese":"相形之下，用一年的劳役换来与萨布莱娜厮守终生。"},{"english":"Let's say you've met a great girl, and you want to spend more time with her.","chinese":"假如你遇见了一位很棒的女孩，想与她长相厮守。"},{"english":"I can't wait to crawl in bed with you tonight.","chinese":"我快要等不及了，今天晚上要和你一起厮守。"},{"english":"I was in love and ready for a long-term commitment.","chinese":"我爱他，并准备与他长相厮守。"},{"english":"Rich or poor, we will keep together and be happy in one another.","chinese":"不论贫富，我们都要厮守一起，共享天伦之乐。"}],"related":[{"definition":["from dawn to dusk\/all the time"],"pinyin":["zhao1 zhao1 mu4 mu4"],"word":"朝朝暮暮"},{"definition":["to moisten with spittle (idiom); sharing meager resources\/mutual help in humble circumstances"],"pinyin":["xiang1 ru2 yi3 mo4"],"word":"相濡以沫"},{"definition":["to love each other"],"pinyin":["xiang1 ai4"],"word":"相爱"},{"definition":["(to live together until the) white hairs of old age (idiom); to live to a ripe old age in conjugal bliss\/until death do us part"],"pinyin":["bai2 tou2 dao4 lao3"],"word":"白头到老"},{"definition":["(to live together until the) white hairs of old age (idiom); to live to a ripe old age in conjugal bliss\/until death do us part"],"pinyin":["bai2 tou2 xie2 lao3"],"word":"白头偕老"},{"definition":["a whole lifetime (idiom); all my life"],"pinyin":["yi1 sheng1 yi1 shi4"],"word":"一生一世"},{"definition":["enduring while the world lasts (idiom)\/eternal"],"pinyin":["tian1 chang2 di4 jiu3"],"word":"天长地久"},{"definition":["lit. to rest and fly together (idiom)\/fig. to live in each other's pockets\/to be inseparable"],"pinyin":["shuang1 su4 shuang1 fei1"],"word":"双宿双飞"},{"definition":["to grow old together"],"pinyin":["xie2 lao3"],"word":"偕老"},{"definition":["(of a couple) to be harmonious\/to be each other's sunshine"],"pinyin":["liang3 qing2 xiang1 yue4"],"word":"两情相悦"},{"definition":["to have an affinity with each other (idiom)\/to find each other congenial"],"pinyin":["qing2 tou2 yi4 he2"],"word":"情投意合"},{"definition":["lit. heads rubbing together (idiom)\/fig. very close relationship"],"pinyin":["er3 bin4 si1 mo2"],"word":"耳鬓厮磨"},{"definition":["see 月下花前[yue4 xia4 hua1 qian2]"],"pinyin":["hua1 qian2 yue4 xia4"],"word":"花前月下"},{"definition":["to accompany sb\/to accompany each other"],"pinyin":["xiang1 ban4"],"word":"相伴"},{"definition":["to love dearly"],"pinyin":["shen1 ai4"],"word":"深爱"},{"definition":["lit. to lift the tray to eyebrow level (idiom); mutual respect in a marriage"],"pinyin":["ju3 an4 qi2 mei2"],"word":"举案齐眉"}]}