{"definition":["place\/destination"],"pinyin":["qu4 chu4"],"traditional":["去處"],"rank":14437.0,"normalized_rank":0.2019923607516125,"fraction":0.000004426041646453784,"cumulative_fraction":0.9566205214352536,"word":"去处","characters":[{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"},{"definition":["to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish","place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point"],"pinyin":["chu3","chu4"],"word":"处"}],"containing_words":[],"sentences":[{"english":"The past is a good place to visit, but certainly not a good place to stay.","chinese":"过去，是我们偶尔到访的好去处，但显然不宜长留。"},{"english":"The place to see son has red flag finally relieved.","chinese":"见儿子有了去处，文红旗终于松了口气。"},{"english":"But I thought it was actually one of the better places to see a show or a game.","chinese":"但我想它真是个看表演或比赛的好去处。"},{"english":"The best place for diving is the West Islet and the Wuzhizhou Islet in Sanya.","chinese":"潜水的最佳去处是三亚的西岛和蜈支洲岛。"},{"english":"So \"Moonshadow Japanese Restaunrant\" will be the best place of enjoy youself.","chinese":"“月影日本料理”将是您留恋忘返的最佳去处。"},{"english":"The arctic village is you find north, explore photography fans to play, the best place to go.","chinese":"北极村是你找北，探索游玩，摄影爱好者的最佳去处。"},{"english":"Wherever the son went, he inquired about his father.","chinese":"每到一处，他都询问父亲的去处。"},{"english":"One lovely spot is Hembury Woods in the Dart Valley, Devon.","chinese":"一个最佳观赏去处是德文郡达特山谷的亨百丽森林。"},{"english":"Probenecid improves the kidneys ability to remove uric acid from body.","chinese":"丙黄舒可以提高肾脏去处尿酸的能力。"},{"english":"\"Honk the golf club\" is a good whereabouts.","chinese":"“嘎那高尔夫俱乐部”就是个好去处。"},{"english":"If ability with this whereabouts matter, the whole life is happy to allow free and unfettered.","chinese":"若能以此去处事，一生安乐任逍遥。"},{"english":"It's quite a nice area to just meander and just to walk around.","chinese":"这是个遛弯散步的好去处。"},{"english":"What do you think makes Beverly Hills a unique shopping place?","chinese":"你觉得什么让比佛利山庄成了独特的购物去处呢？"},{"english":"After that , what happened to the Amber Room remains a mystery .","chinese":"从那以后，琥珀屋的去处便成了一个谜。"},{"english":"Tianyuan Kui Fan Zhuang is a good place to drink coffee.","chinese":"天元奎饭庄是喝咖啡的好去处。"},{"english":"But the country's new leadership says they do not know where he is.","chinese":"但是国家新领导说他们仍然不清楚卡扎菲的去处。"}],"related":[{"definition":["well-known scenic spot"],"pinyin":["sheng4 di4"],"word":"胜地"},{"definition":["to stay for a time\/to stop over\/to lodge\/to sink down (into soft ground)\/leftovers"],"pinyin":["luo4 jiao3"],"word":"落脚"},{"definition":["to be away for the summer holidays\/to spend a holiday at a summer resort\/to prevent sunstroke"],"pinyin":["bi4 shu3"],"word":"避暑"},{"definition":["holy land (of a religion)\/sacred place\/shrine\/holy city (such as Jerusalem, Mecca etc)\/center of historic interest"],"pinyin":["sheng4 di4"],"word":"圣地"},{"definition":["to drive away cares\/to relieve boredom"],"pinyin":["san4 xin1"],"word":"散心"},{"definition":["to search\/to look for\/to seek"],"pinyin":["xun2"],"word":"寻"},{"definition":["location\/place"],"pinyin":["chang3 suo3"],"word":"场所"},{"definition":["to amuse oneself\/to have fun\/to go sightseeing\/to take a stroll"],"pinyin":["you2 wan2"],"word":"游玩"},{"definition":["quiet\/peaceful and quiet"],"pinyin":["qing1 jing4"],"word":"清静"},{"definition":["a way out (lit. and fig.)\/opportunity for advancement\/a way forward\/outlet (for one's products)"],"pinyin":["chu1 lu4"],"word":"出路"},{"definition":["to rest\/to relax\/to take a break"],"pinyin":["xiu1 qi4"],"word":"休憩"},{"definition":["residence"],"pinyin":["ju1 suo3"],"word":"居所"},{"definition":["to stop on the way for a rest"],"pinyin":["xie1 jiao3"],"word":"歇脚"},{"definition":["paradise\/heaven"],"pinyin":["tian1 tang2"],"word":"天堂"},{"definition":["hiding place\/hideout"],"pinyin":["cang2 shen1 zhi1 chu4"],"word":"藏身之处"},{"definition":["lonely\/secluded"],"pinyin":["pi4 jing4"],"word":"僻静"}]}