{"definition":["to remove\/to dislodge"],"pinyin":["qu4 chu2"],"traditional":["去除"],"rank":12339.0,"normalized_rank":0.1726386187791194,"fraction":0.000005844944179551764,"cumulative_fraction":0.9459471493026476,"word":"去除","characters":[{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"},{"definition":["to get rid of\/to remove\/to exclude\/to eliminate\/to wipe out\/to divide\/except\/not including"],"pinyin":["chu2"],"word":"除"}],"containing_words":[],"sentences":[{"english":"The article discusses the elimination of phenol with sodium permanganate oxidation in water.","chinese":"研究了高锰酸钠对水中苯酚的去除作用。"},{"english":"All cfc coolants must be removed from fridges.","chinese":"必须将所有的氟氯化碳冷却液从冰箱中去除。"},{"english":"A model for the removal of multiplicative noises was proposed based on the non-local diffusion method.","chinese":"提出了一种基于非局部扩散的去除乘性噪声的模型。"},{"english":"Dismiss, for example, “some niggles, some feelings of fatigue, ” he said.","chinese":"他说，比如去除“一些吹毛求疵，一些疲劳感”。"},{"english":"Disclosed is an electrolytic cell for removal of material from a solution.","chinese":"本发明公开了一种从溶液去除物质的电解池。"},{"english":"Often used for removal of RNA primers.","chinese":"常在去除RNA引物中使用。"},{"english":"Endarterectomy removes fatty plaque through an incision in the neck.","chinese":"通过在颈部切口去除内膜上的脂肪斑块。"},{"english":"Baby fat removal had no effect.","chinese":"婴儿肥去除没有效果的。"},{"english":"Clip was placed in the distinct place and then aneurysm coagulated with bipolar forceps and removed. Final clip was placed.","chinese":"夹放在不同的地方，然后用双极电凝去除瘤凝固。"},{"english":"In this method the interference come from inorganic sulfide was removed by Copper acetate homogenous precipitation met…","chinese":"水中无机硫化物的干扰用乙酸铜均匀沉淀法去除。"},{"english":"I pointed out that the perception of a master-servant relationship should be removed.","chinese":"我也表明，马华必须去除和巫统的主从关系。"},{"english":"The efficiency of algae removal by four algaecides for Luanhe River water was studied.","chinese":"研究了四种杀藻剂对引滦水中藻类的去除效能。"},{"english":"We'll remove things and even-up skin tone, that sort of thing.","chinese":"我们做去除一些东西，均化肤色等这类事情。"},{"english":"The chromium in industrial wastewater could be removed with the scrap-iron fixed bed reactor.","chinese":"采用铁屑固定床反应器去除工业废水中的铬。"},{"english":"A wireline bailer that is used to remove sand and debris from the bottom of a well.","chinese":"从井底去除砂子和碎片所用的由钢丝绳起下的捞砂筒。"},{"english":"They are then eviscerated and chilled.","chinese":"最后再去除内脏并进行预冷处理。"}],"related":[{"definition":["to dispel\/to clear"],"pinyin":["qu1 chu2"],"word":"祛除"},{"definition":["to get rid of\/to exclude\/to eliminate\/to remove\/to delete\/to strip out\/to extract"],"pinyin":["qu4 diao4"],"word":"去掉"},{"definition":["to clear away\/to eliminate\/to get rid of"],"pinyin":["qing1 chu2"],"word":"清除"},{"definition":["to eliminate\/to remove\/except for\/apart from"],"pinyin":["chu2 qu4"],"word":"除去"},{"definition":["to eliminate\/to remove"],"pinyin":["xiao1 chu2"],"word":"消除"},{"definition":["to remain\/left over\/surplus\/remnant"],"pinyin":["can2 liu2"],"word":"残留"},{"definition":["filth"],"pinyin":["wu1 gou4"],"word":"污垢"},{"definition":["to wash\/to clean\/to purge"],"pinyin":["qing1 xi3"],"word":"清洗"},{"definition":["to rinse (clothes)"],"pinyin":["piao3 xi3"],"word":"漂洗"},{"definition":["stain"],"pinyin":["wu1 zi4"],"word":"污渍"},{"definition":["remnant\/residue\/material left over"],"pinyin":["can2 liu2 wu4"],"word":"残留物"},{"definition":["to remove completely\/to eliminate\/to cleanse from"],"pinyin":["chu2 jing4"],"word":"除净"},{"definition":["to kill germs\/to disinfect\/to sterilize"],"pinyin":["sha1 jun1"],"word":"杀菌"},{"definition":["to rinse\/to wash\/to develop (photographic film)"],"pinyin":["chong1 xi3"],"word":"冲洗"},{"definition":["to adhere to a surface\/to absorb\/to draw in\/(fig.) to attract\/(chemistry) adsorption"],"pinyin":["xi1 fu4"],"word":"吸附"},{"definition":["to steep\/to soak\/to immerse"],"pinyin":["jin4 pao4"],"word":"浸泡"}]}