{"definition":["(conjunction linking two nouns) and its ...\/and their ...\/and his ...\/and her ..."],"pinyin":["ji2 qi2"],"traditional":["及其"],"rank":1653.0,"normalized_rank":0.02312761462370405,"fraction":0.00009608626941882216,"cumulative_fraction":0.7007322436146985,"word":"及其","characters":[{"definition":["and\/to reach\/up to\/in time for"],"pinyin":["ji2"],"word":"及"},{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"}],"containing_words":[],"sentences":[{"english":"Objective To research the LISREL and its application in the biomedical studies.","chinese":"目的探讨线性结构模型理论及其在医学中的应用。"},{"english":"The change of organic acids in rice wine with the extension of fermentation time was studied.","chinese":"研究了江米酒中有机酸的成分及其随发酵时间的变化。"},{"english":"The dispersion influence in networks of ultrahigh -speed optical fiber communication is researched in this paper.","chinese":"本文研究了光纤通信网中的色散及其补偿方法。"},{"english":"Surface conduit and support should be fixed strongly and arranged into order.","chinese":"明配管及其支架应平滑牢固，排列整齐。"},{"english":"The development of financial circles and strick precaution of the risk are closely linked with disclosure of financial information.","chinese":"金融业的发展及其风险的防范与信息披露息息相关。"},{"english":"Objective To investigate the anatomical structures of the posterior column of the acetabulum and the related clinical significance.","chinese":"目的探讨髋臼后柱的解剖学结构及其相关临床意义。"},{"english":"The invention discloses a device and a method for real-time stream file storage.","chinese":"本发明公开了一种实时流文件存储装置及其方法。"},{"english":"Thanks to demonization of Hinduism by British lootersand their evangelists.","chinese":"感谢英国掠夺者及其布道者对印度教的妖魔化。"},{"english":"Understanding your hardware and its energy usage.","chinese":"清楚你的硬件及其能量使用。"},{"english":"This function terminates the running process and all the associated threads.","chinese":"这个函数终止运行中的进程及其相关线程。"},{"english":"This paper describes the basic principles of the image digitizer and its development course.","chinese":"本文论述了图像数字化器的基本原理及其发展过程。"},{"english":"Studies on pollen morphology and taxonomy of Lespedeza and its allied genera from NE China.","chinese":"我国东北胡枝子属及其近缘属的花粉形态和分类研究。"},{"english":"The structure and the feature of the tank-water quench equipment are introduced.","chinese":"介绍了巨化公司铝厂水槽式水淬装置的结构及其特点。"},{"english":"The present invention relates to a wheat germ nutrient flour and its preparation method.","chinese":"本发明涉及一种麦胚营养粉及其制备方法。"},{"english":"Objective To evaluate the clinical application of CT in the diagnosis of gallstone ileus.","chinese":"目的探讨胆石性肠梗阻的CT诊断价值及其临床意义。"},{"english":"Objective:To discuss the clinical and pathologic characteristics and effective treatment of renal tuberculosis.","chinese":"目的探讨肾结核的临床和病理特征及其有效治疗方法。"}],"related":[{"definition":["and\/to reach\/up to\/in time for"],"pinyin":["ji2"],"word":"及"},{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["as well as\/too\/and"],"pinyin":["yi3 ji2"],"word":"以及"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相关"},{"definition":["to take part in","and\/to give\/together with","variant of 歟|欤[yu2]"],"pinyin":["yu4","yu3","yu2"],"word":"与"},{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"对"},{"definition":["to comprise\/to include\/to involve\/to incorporate\/to consist of"],"pinyin":["bao1 kuo4"],"word":"包括"},{"definition":["in view of\/seeing that\/considering\/whereas"],"pinyin":["jian4 yu2"],"word":"鉴于"},{"definition":["aforementioned\/above-mentioned"],"pinyin":["shang4 shu4"],"word":"上述"},{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge","to combine\/to amalgamate","variant of 並|并[bing4]"],"pinyin":["bing4","bing4","bing4"],"word":"并"},{"definition":["aforestated\/stated above\/the preceding statement"],"pinyin":["qian2 shu4"],"word":"前述"},{"definition":["indirect"],"pinyin":["jian4 jie1"],"word":"间接"},{"definition":["to give\/to impose\/to apply"],"pinyin":["yu3 yi3"],"word":"予以"},{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有关"},{"definition":["therefore\/as a result\/thus\/and as a result, ..."],"pinyin":["yin1 er2"],"word":"因而"}]}