{"definition":["lit. to paint holding two brushes (idiom); fig. to work on two tasks at the same time\/to attack one problem from two angles at the same time"],"pinyin":["shuang1 guan3 qi2 xia4"],"traditional":["雙管齊下"],"rank":27555.0,"normalized_rank":0.385530200215466,"fraction":0.0000011758497843728635,"cumulative_fraction":0.9876687587913024,"word":"双管齐下","characters":[{"definition":["surname Shuang","two\/double\/pair\/both\/even (number)"],"pinyin":["Shuang1","shuang1"],"word":"双"},{"definition":["variant of 管[guan3]","surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["guan3","Guan3","guan3"],"word":"管"},{"definition":["(name of states and dynasties at several different periods)\/surname Qi","neat\/even\/level with\/identical\/simultaneous\/all together\/to even sth out"],"pinyin":["Qi2","qi2"],"word":"齐"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[{"english":"Most transnational corporations engaged in food marketing have done both.","chinese":"大多数从事食品营销的跨国公司都在双管齐下。"},{"english":"Akula Subs and Apocalypse Tanks fire their load at the same time.","chinese":"阿库拉潜艇和天启坦克现在可以双管齐下。"},{"english":"Additionally, mass publicity and appropriate economic methods should be carried out alongside. (Translated by Jieping Hu.","chinese":"另外，公众宣传和适当的经济手段应该双管齐下。"},{"english":"Instead, the company is determined to double-down on its now aging strategy.","chinese":"他们反而决心双管齐下，延续他历来的战略。"},{"english":"Do both, but in any event, don't merely read the book.","chinese":"双管齐下，但是任何情况下，不要只是读书。"},{"english":"We believe in doing both, and learning while we do it.","chinese":"我们坚持双管齐下，并在进行的过程中不断的学习。"},{"english":"South Korean banks have plans to help with both.","chinese":"没错，韩国多家银行就推出了这种双管齐下的服务。"}],"related":[{"definition":["to take drastic measures to deal with a situation\/to pull the carpet from under sb"],"pinyin":["fu3 di3 chou1 xin1"],"word":"釜底抽薪"},{"definition":["use both carrot and stick\/use gentle methods and force\/an iron hand in a velvet glove"],"pinyin":["ruan3 ying4 jian1 shi1"],"word":"软硬兼施"},{"definition":["to develop simultaneously\/to undertake concurrently"],"pinyin":["bing4 ju3"],"word":"并举"},{"definition":["to kill two birds with one stone (idiom)"],"pinyin":["yi1 shi2 er4 niao3"],"word":"一石二鸟"},{"definition":["lit. one arrow, two golden eagles (idiom)\/to kill two birds with one stone"],"pinyin":["yi1 jian4 shuang1 diao1"],"word":"一箭双雕"},{"definition":["half the work, twice the effect (idiom); the right approach saves effort and leads to better results\/a stitch in time saves nine"],"pinyin":["shi4 ban4 gong1 bei4"],"word":"事半功倍"},{"definition":["lit. set up a pole and see the shadow (idiom); fig. instant effect\/quick results"],"pinyin":["li4 gan1 jian4 ying3"],"word":"立竿见影"},{"definition":["circumstances require action (idiom); absolutely necessary\/imperative"],"pinyin":["shi4 zai4 bi4 xing2"],"word":"势在必行"},{"definition":["to lay equal stress on\/to pay equal attention to"],"pinyin":["bing4 zhong4"],"word":"并重"},{"definition":["won't work\/will get (you) nowhere"],"pinyin":["xing2 bu5 tong1"],"word":"行不通"},{"definition":["to advance together"],"pinyin":["bing4 jin4"],"word":"并进"},{"definition":["to complement one another (idiom)"],"pinyin":["xiang1 fu3 xiang1 cheng2"],"word":"相辅相成"},{"definition":["the best policy\/the best thing one can do in the circumstances"],"pinyin":["shang4 shang4 zhi1 ce4"],"word":"上上之策"},{"definition":["to treat only the symptoms but not the root cause"],"pinyin":["zhi4 biao1"],"word":"治标"},{"definition":["to get sth done once and for all"],"pinyin":["yi1 lao2 yong3 yi4"],"word":"一劳永逸"},{"definition":["to try harder\/to redouble one's efforts"],"pinyin":["jia1 da4 li4 du4"],"word":"加大力度"}]}