{"definition":["unstable\/erratic\/changeable\/fickle"],"pinyin":["fan3 fu4 wu2 chang2"],"traditional":["反覆無常"],"rank":38022.0,"normalized_rank":0.5319771102374323,"fraction":4.633329876597728e-7,"cumulative_fraction":0.9956530812928353,"word":"反复无常","characters":[{"definition":["contrary\/in reverse\/inside out or upside down\/to reverse\/to return\/to oppose\/opposite\/against\/anti-\/to rebel\/to use analogy\/instead\/abbr. for 反切[fan3 qie4] phonetic system"],"pinyin":["fan3"],"word":"反"},{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out","to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4","fu4","fu4"],"word":"复"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"无"},{"definition":["always\/ever\/often\/frequently\/common\/general\/constant","surname Chang"],"pinyin":["chang2","Chang2"],"word":"常"}],"containing_words":[],"sentences":[{"english":"Is disease of department of gynaecology gotten capricious ?","chinese":"妇科病一得就反复无常嘛？"},{"english":"Then talk not of inconstancy.","chinese":"不要去谈那反复无常。"},{"english":"Some clients feel like you exist solely to cater to their every whim.","chinese":"一些客户认为你应该完全迎合他们的反复无常。"},{"english":"It is given to all sorts of caprices of wind and weather.","chinese":"经常遇到各种各样反复无常的风和天气。"},{"english":"It's clear that some stocks are more volatile than others.","chinese":"很明显有一些股票会比其他股票反复无常。"},{"english":"Volatile law and order situation also dishearten foreign tourists.","chinese":"反复无常的法律和社会秩序也使游客同样感到沮丧。"},{"english":"The ground is capricious like elephantine cat, the disposition of persist one's old ways.","chinese":"象猫一样地反复无常，我行我素的性格。"},{"english":"It is harder to negotiate safe passage with increasingly unpredictable armed groups.","chinese":"和愈加反复无常的武装组织商定安全通道越发困难。"},{"english":"During inspiration plunder or in the process of creation, play fast and loose is its form of expression.","chinese":"在灵感掠取或创作过程中，反复无常是它的表现形式。"},{"english":"A hailstorm in July is a caprice of nature.","chinese":"七月天的一场冰雹是大自然的反复无常的变化。"},{"english":"In the tumult of battle, robots wouldn't be affected by volatile emotions.","chinese":"身处混乱的战场，机器人不会被反复无常的情绪左右。"},{"english":"The Jade Emperor's rule is orderly and without caprice.","chinese":"玉帝的规则是井然有序，不会反复无常的。"},{"english":"He was rather too indulgent in humouring her caprices.","chinese":"讲到容忍她的反复无常，他实在是太迁就了。"},{"english":"Many of these assets were funded by lenders in fickle wholesale markets.","chinese":"许多这些资产来自反复无常的批发市场。"},{"english":"He was very changeable, often blowing hot and cold.","chinese":"他朝三暮四，老是反复无常。"},{"english":"Hermia was looking at him and wondering at his strange inconstancy.","chinese":"赫米亚望着他，对他莫名其妙的反复无常感到很惊奇。"}],"related":[{"definition":["temperamental\/moody"],"pinyin":["xi3 nu4 wu2 chang2"],"word":"喜怒无常"},{"definition":["fickle\/mercurial\/changeable\/capricious\/to be apt to change"],"pinyin":["shan4 bian4"],"word":"善变"},{"definition":["indecisive\/irresolute"],"pinyin":["you1 rou2 gua3 duan4"],"word":"优柔寡断"},{"definition":["(idiom) to hesitate\/to remain undecided"],"pinyin":["shou3 shu3 liang3 duan1"],"word":"首鼠两端"},{"definition":["mistrustful\/suspicious\/paranoid"],"pinyin":["duo1 yi2"],"word":"多疑"},{"definition":["two-faced, three knives (idiom); double-cross\/double dealing and back stabbing"],"pinyin":["liang3 mian4 san1 dao1"],"word":"两面三刀"},{"definition":["obstinate and self-opinionated (idiom)"],"pinyin":["gang1 bi4 zi4 yong4"],"word":"刚愎自用"},{"definition":["breaking faith and abandoning right (idiom); to betray\/treachery\/perfidy"],"pinyin":["bei4 xin4 qi4 yi4"],"word":"背信弃义"},{"definition":["narrow-minded (idiom); petty\/ungenerous"],"pinyin":["xin1 xiong1 xia2 zhai3"],"word":"心胸狭窄"},{"definition":["old: to reap the consequences of one's words (idiom, from Mencius); modern: to go back on one's word\/to blow hot and cold\/to contradict oneself\/inconsistent"],"pinyin":["chu1 er3 fan3 er3"],"word":"出尔反尔"},{"definition":["serve Qin in the morning Chu in the evening (idiom); quick to switch sides"],"pinyin":["zhao1 Qin2 mu4 Chu3"],"word":"朝秦暮楚"},{"definition":["headstrong\/perverse"],"pinyin":["gang1 bi4"],"word":"刚愎"},{"definition":["lit. see the wind and set the helm (idiom); fig. to act pragmatically\/to be flexible and take advantage of the situation"],"pinyin":["jian4 feng1 shi3 duo4"],"word":"见风使舵"},{"definition":["narrow\/petty-minded"],"pinyin":["xin1 xiong1 xia2 ai4"],"word":"心胸狭隘"},{"definition":["to go back on one's word\/to break one's promise\/to be unfaithful\/to be untrustworthy"],"pinyin":["yan2 er2 wu2 xin4"],"word":"言而无信"},{"definition":["lit. say three in the morning but four in the evening (idiom); to change sth that is already settled upon\/indecisive\/to blow hot and cold"],"pinyin":["zhao1 san1 mu4 si4"],"word":"朝三暮四"}]}