{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"traditional":["反彈"],"rank":2036.0,"normalized_rank":0.028486281532886543,"fraction":0.00007491119279911087,"cumulative_fraction":0.7331991962145451,"word":"反弹","characters":[{"definition":["contrary\/in reverse\/inside out or upside down\/to reverse\/to return\/to oppose\/opposite\/against\/anti-\/to rebel\/to use analogy\/instead\/abbr. for 反切[fan3 qie4] phonetic system"],"pinyin":["fan3"],"word":"反"},{"definition":["to pluck (a string)\/to play (a string instrument)\/to spring or leap\/to shoot (e.g. with a catapult)\/(of cotton) to fluff or tease\/to flick\/to flip\/to accuse\/to impeach\/elastic (of materials)","crossball\/bullet\/shot\/shell\/ball"],"pinyin":["tan2","dan4"],"word":"弹"}],"containing_words":[{"definition":["antimissile missile"],"pinyin":["fan3 dan4 dao3 dan4"],"word":"反弹导弹"}],"sentences":[{"english":"One springback compensation method for car stamping die surface is narrated.","chinese":"介绍了汽车冲压模具型面反弹补偿的一种方法。"},{"english":"Over-use can cause rebound nasal congestion.","chinese":"过度使用可能会导致反弹鼻塞。"},{"english":"In that case, the price spike would be something like a dead-cat bounce.","chinese":"在那种情况下，股价峰值可能会像死猫诈尸一样反弹。"},{"english":"But Shenzhen Stock Cheng Zhi, because is implicated the bank tectonic plate is small, bounce dynamics is slightly big.","chinese":"而深证成指由于受银行板块拖累较小，反弹力度稍大。"},{"english":"S. demand for foreign goods will rebound with the economy.","chinese":"随着经济的复苏，美国对外国产品的需求也会反弹。"},{"english":"These materials will be re-crushed after rebounding into the scale board.","chinese":"这些材料将被重新成规模后板反弹粉碎。"},{"english":"The company can only go to hell in a handbasket with this damned dead-cat bounce.","chinese":"该死的死猫反弹只能使该企业的所处的境地迅疾恶化。"},{"english":"When the noise bounces off a fish or a rock, the dolphin hears the echo come back again.","chinese":"当声音从鱼或岩石反弹回来时，海豚再次听到回声。"},{"english":"They ricochet off the armor, leaving drops of glistening venom.","chinese":"射弹被盔甲反弹回去，盔甲上留下闪闪发光的毒液。"},{"english":"The singularity of big bounce model in the brane world is studied.","chinese":"研究膜上反弹模型的奇异性。"},{"english":"'That, in and of itself, is an impressive rebound,' Mr. Colas says.","chinese":"卡罗斯说，这本身就是一个令人印象深刻印象的反弹。"},{"english":"An overhead shot hit very hard, usually before the ball has bounced.","chinese":"过顶大力击球，通常是在球落地反弹之前。"},{"english":"Stock markets rallied as a form of relief from possible Armageddon.","chinese":"美国股市在避免了一场可能的末日浩劫之后出现反弹。"},{"english":"Dual lead worm system would be very easy to adjust backlash.","chinese":"双系统会导致蠕虫病毒很容易调整反弹。"},{"english":"No sooner did it release its trial balloon on the Luxury Tax, than it met with a public backlash.","chinese":"课征奢侈税才放出风向球，就因民意反弹而收手等等。"},{"english":"So, it should not be surprised to see an oversold relief bounce in the coming days.","chinese":"因此未来数日标普出现超跌反弹行情是不足为奇的。"}],"related":[{"definition":["short term"],"pinyin":["duan3 xian4"],"word":"短线"},{"definition":["to fall back\/to return to low level after a rise (in water level, price etc)"],"pinyin":["hui2 luo4"],"word":"回落"},{"definition":["to shake up\/to jolt\/to vibrate\/to oscillate\/to fluctuate","to vibrate\/to shake\/to shudder"],"pinyin":["zhen4 dang4","zhen4 dang4"],"word":"震荡"},{"definition":["tendency\/trend\/path"],"pinyin":["zou3 shi4"],"word":"走势"},{"definition":["short term\/short-term"],"pinyin":["duan3 qi1"],"word":"短期"},{"definition":["to fall\/to tumble"],"pinyin":["xia4 die1"],"word":"下跌"},{"definition":["stock market index\/share price index\/abbr. for 股票指數|股票指数[gu3 piao4 zhi3 shu4]"],"pinyin":["gu3 zhi3"],"word":"股指"},{"definition":["large fall"],"pinyin":["da4 die1"],"word":"大跌"},{"definition":["market price\/quotation of market price\/the current market situation"],"pinyin":["hang2 qing2"],"word":"行情"},{"definition":["to fall back (of water level or share prices)"],"pinyin":["hui2 die1"],"word":"回跌"},{"definition":["Shanghai Stock Exchange (SSE), abbr. for 上海證券交易所|上海证券交易所[Shang4 hai3 Zheng4 quan4 Jiao1 yi4 suo3]"],"pinyin":["Shang4 Zheng4"],"word":"上证"},{"definition":["phony\/so-called\/armchair (expert)\/vain (promise)\/(finance) short-seller\/bear (market)\/short (selling)"],"pinyin":["kong1 tou2"],"word":"空头"},{"definition":["(of a market index etc) to fall below (a given level)\/to be injured or damaged as a result of a fall"],"pinyin":["die1 po4"],"word":"跌破"},{"definition":["(of sales, prices etc) to fall\/to drop\/decline\/slump"],"pinyin":["xia4 cuo4"],"word":"下挫"},{"definition":["to continue to fall (of share prices)"],"pinyin":["xu4 die1"],"word":"续跌"},{"definition":["(finance) profit-taking"],"pinyin":["huo4 li4 hui2 tu3"],"word":"获利回吐"}]}