{"definition":["to counterattack\/a counteroffensive"],"pinyin":["fan3 gong1"],"traditional":["反攻"],"rank":13385.0,"normalized_rank":0.1872735158731269,"fraction":0.000005067029406004528,"cumulative_fraction":0.9516483801143076,"word":"反攻","characters":[{"definition":["contrary\/in reverse\/inside out or upside down\/to reverse\/to return\/to oppose\/opposite\/against\/anti-\/to rebel\/to use analogy\/instead\/abbr. for 反切[fan3 qie4] phonetic system"],"pinyin":["fan3"],"word":"反"},{"definition":["to attack\/to accuse\/to study"],"pinyin":["gong1"],"word":"攻"}],"containing_words":[],"sentences":[{"english":"After accomplishing those tasks, the paratroopers had to withstand any German counterattacks.","chinese":"完成这些任务之后，伞兵还必须顶住德军的反攻。"},{"english":"Rebels have been trying to fight off a counter-offensive by Gaddafi forces.","chinese":"反政府武装一直试图击退由卡扎菲部队反攻。"},{"english":"During the Alliance push to defeat the Horde, Blackrock was besieged by human forces.","chinese":"当联盟大反攻时黑石塔受到人类的围攻。"},{"english":"The object of strategic retreat is to conserve military strength and prepare for the counter- offensive.","chinese":"战略退却的目的是为了保存军力，准备反攻。"},{"english":"Chopping stability and vicious counterattack.","chinese":"削球稳且反攻凶狠。"},{"english":"The Baggies immediately bounced back, however, and had a goal disallowed for offside, shortly before actually equalising from the penalty spot.","chinese":"西布朗很快反攻，不过他们的进球因为越位不算。"},{"english":"Joint US Japan, counterattack against the mainland, save one billion three hundred million people.","chinese":"联合美日，反攻大陆，解救十三亿中国人。"},{"english":"Furthermore, the Johnson Administration put Taiwan's Plan for attacking the mainland plan aside.","chinese":"此外，约翰逊政府最终搁置了台湾反攻大陆的计划。"},{"english":"He said he would continue working on a second volume of memoirs, to be called The Final Strategic Counteroffensive.","chinese":"他说将继续写作回忆录的第二卷《最后的战略反攻》。"},{"english":"But just for 1 hour, the Russians counterattacked, and forced my Kompanie out again.","chinese":"但是一小时后，苏联人发动了反攻重新夺回了阵地。"},{"english":"From now on the whole country must make \"preparation for the counter-offensive\" its over-all task in the War of Resistance.","chinese":"从现时起，全国应以“准备反攻”为抗战的总任务。"},{"english":"After this careful preparation Tien Tan felt the time was right to launch his counter attack.","chinese":"在经过精心的策划后，田单认为反攻的时机到了。"},{"english":"Allies launch successful counter-offensives at the Marne and Amiens.","chinese":"盟国发射成功反攻在马恩和亚眠。"},{"english":"During the summer counterattack that lasted for one week, the soldiers had used up all the ammunition.","chinese":"在长达一周的夏季反攻中，士兵们用尽了弹药。"},{"english":"All of these things greatly surprised me, but especially the counter-offensive.","chinese":"这些事件很使我感到震惊，尤其是八路军的转入反攻。"},{"english":"Another reason was that the objective situation compelled us to start the counteroffensive at an early date.","chinese":"另一个原因是客观形势迫使我们要早反攻。"}],"related":[{"definition":["to attack violently\/to storm"],"pinyin":["meng3 gong1"],"word":"猛攻"},{"definition":["to strike back\/to beat back\/to counterattack"],"pinyin":["fan3 ji1"],"word":"反击"},{"definition":["(military) offensive"],"pinyin":["gong1 shi4"],"word":"攻势"},{"definition":["to recover (lost territory etc)\/to recapture"],"pinyin":["shou1 fu4"],"word":"收复"},{"definition":["to counterattack\/to come back after a defeat\/to retrieve lost ground"],"pinyin":["fan3 pu1"],"word":"反扑"},{"definition":["to check\/to stop"],"pinyin":["zu3 ji1"],"word":"阻击"},{"definition":["surprise attack"],"pinyin":["tu1 xi2"],"word":"突袭"},{"definition":["to defeat\/to smash\/to rout"],"pinyin":["ji1 kui4"],"word":"击溃"},{"definition":["to retreat and defend\/to withdraw and maintain one's guard"],"pinyin":["tui4 shou3"],"word":"退守"},{"definition":["to retreat"],"pinyin":["che4 tui4"],"word":"撤退"},{"definition":["to seize control of (an enemy position)\/(fig.) to take by storm\/to gain (awards, control of a market etc)"],"pinyin":["gong1 zhan4"],"word":"攻占"},{"definition":["utterly defeated\/routed\/crushed\/to collapse (of army)"],"pinyin":["kui4 bai4"],"word":"溃败"},{"definition":["to sally\/to attack"],"pinyin":["chu1 ji1"],"word":"出击"},{"definition":["(do sth) on a large scale"],"pinyin":["da4 ju3"],"word":"大举"},{"definition":["to pursue and attack"],"pinyin":["zhui1 ji1"],"word":"追击"},{"definition":["to retreat in defeat"],"pinyin":["bai4 tui4"],"word":"败退"}]}