{"definition":["to turn defeat into victory (idiom); to turn the tide"],"pinyin":["fan3 bai4 wei2 sheng4"],"traditional":["反敗為勝"],"rank":21627.0,"normalized_rank":0.30258978915114804,"fraction":0.0000020283591252465474,"cumulative_fraction":0.9784222292068692,"word":"反败为胜","characters":[{"definition":["contrary\/in reverse\/inside out or upside down\/to reverse\/to return\/to oppose\/opposite\/against\/anti-\/to rebel\/to use analogy\/instead\/abbr. for 反切[fan3 qie4] phonetic system"],"pinyin":["fan3"],"word":"反"},{"definition":["to defeat\/to damage\/to lose (to an opponent)\/to fail\/to wither"],"pinyin":["bai4"],"word":"败"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"},{"definition":["victory\/success\/to beat\/to defeat\/to surpass\/victorious\/superior to\/to get the better of\/better than\/surpassing\/superb (of vista)\/beautiful (scenery)\/wonderful (view)\/(Taiwan pr. [sheng1]) able to bear\/equal to (a task)"],"pinyin":["sheng4"],"word":"胜"}],"containing_words":[],"sentences":[{"english":"See the martial arts will be crowned and win the game.","chinese":"眼看武馆馆主将要反败为胜。"},{"english":"He didn't take the best winning chances, and was beaten by his opponent instead.","chinese":"他没有抓住最好的胜机，结果被对手反败为胜了。"},{"english":"Comereturning Gives China A Sensineas Thomonce Cup Win. (The Comereturning Gaudio-videoe China A Sensineas Thomonce Cup Win. )","chinese":"中国队反败为胜荣获汤姆斯杯。"},{"english":"Comeback Gives China A Sensational Thomas Cup Win. (The Comeback Gave China A Sensational Thomas Cup Win. )","chinese":"中国队反败为胜荣获汤姆斯杯。"},{"english":"But public opinion polls suggest that McCain will have to climb out of a deep hole.","chinese":"但是民调结果显示麦凯恩将难以反败为胜。"},{"english":"After a disastrous first half the team fought back to win.","chinese":"该队在上半场惨败后重整旗鼓反败为胜。"},{"english":"Our team turned the tables in the last five minutes by scoring two goals successively.","chinese":"我队在最后五分钟内连进两球，反败为胜。"}],"related":[{"definition":["to turn defeat into victory (idiom); snatching victory from the jaws of defeat"],"pinyin":["zhuan4 bai4 wei2 sheng4"],"word":"转败为胜"},{"definition":["to make a comeback\/(of a doctor's assessment of the gender of a fetus) to turn out to be wrong"],"pinyin":["fan1 pan2"],"word":"翻盘"},{"definition":["lit. to upend heaven and earth (idiom)\/fig. to change the course of events\/to turn things around"],"pinyin":["niu3 zhuan3 qian2 kun1"],"word":"扭转乾坤"},{"definition":["using the weak to defeat the strong (idiom); to win from a position of weakness"],"pinyin":["yi3 ruo4 sheng4 qiang2"],"word":"以弱胜强"},{"definition":["victorious\/to win\/to triumph"],"pinyin":["huo4 sheng4"],"word":"获胜"},{"definition":["lost game\/losing battle"],"pinyin":["bai4 ju2"],"word":"败局"},{"definition":["grasp it and victory is assured\/to have success within one's grasp (idiom)"],"pinyin":["wen3 cao1 sheng4 quan4"],"word":"稳操胜券"},{"definition":["to escape unscathed\/to get through in one piece"],"pinyin":["quan2 shen1 er2 tui4"],"word":"全身而退"},{"definition":["to win by a surprise move"],"pinyin":["chu1 qi2 zhi4 sheng4"],"word":"出奇制胜"},{"definition":["to score a victory\/to prevail over one's opponents"],"pinyin":["qu3 sheng4"],"word":"取胜"},{"definition":["to defeat\/to beat"],"pinyin":["ji1 bai4"],"word":"击败"},{"definition":["to win as a result of tenacious effort\/to fight off tough competition"],"pinyin":["li4 cuo4"],"word":"力挫"},{"definition":["to do sth when least expected (idiom); to catch sb off guard"],"pinyin":["chu1 qi2 bu4 yi4"],"word":"出其不意"},{"definition":["lit. fight with one's back to the river (idiom); fig. to fight to win or die"],"pinyin":["bei4 shui3 yi1 zhan4"],"word":"背水一战"},{"definition":["to prevail\/to achieve victory\/to be victorious"],"pinyin":["qu3 de2 sheng4 li4"],"word":"取得胜利"},{"definition":["to turn peril into safety (idiom); to avert disaster"],"pinyin":["hua4 xian3 wei2 yi2"],"word":"化险为夷"}]}