{"definition":["to issue (an order, decree etc)\/to send out\/to dispatch\/to produce (a sound)\/to let out (a laugh)"],"pinyin":["fa1 chu1"],"traditional":["發出"],"rank":1422.0,"normalized_rank":0.01989562492129895,"fraction":0.00011356402470537444,"cumulative_fraction":0.6766731673087704,"word":"发出","characters":[{"definition":["hair\/Taiwan pr. [fa3]","to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa4","fa1"],"word":"发"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[{"definition":["to burst forth\/to burst out"],"pinyin":["beng4 fa1 chu1"],"word":"迸发出"},{"definition":["to issue instructions"],"pinyin":["fa1 chu1 zhi3 shi4"],"word":"发出指示"}],"sentences":[{"english":"The crowd greeted the performers with boos and hiss es.","chinese":"观众向演出者发出一片嘘声。"},{"english":"Don't make any noise while the baby is sleeping.","chinese":"孩子睡觉时别发出任何声音。"},{"english":"The antibodies have been altered to fluoresce under certain conditions.","chinese":"在一定条件下，这些抗体被变成能发出荧光。"},{"english":"The rain drummed loudly on the metal roof.","chinese":"雨点敲击金属屋顶，发出很大的声响。"},{"english":"People gives out derisive sound.","chinese":"人们都发出嘲笑声。"},{"english":"On summer evenings the flowers gave forth an almost intoxicating scent.","chinese":"夏夜，花朵发出几乎醉人的芳香。"},{"english":"The sound spelled \"miaow\" is used only in talking to people.","chinese":"发出的“喵喵声”只在与人讲话时使用。"},{"english":"He was snapped making sure the windows were sparkling by a resident in a neighbouring apartment block.","chinese":"他烦恼一定是邻近公寓楼的住户让窗玻璃发出闪光。"},{"english":"That mixture is enough to move his jeep; however, whenever the car moves, it exhales food smell.","chinese":"当车子开动时，总是会散发出食物的味道。"},{"english":"The applicants who pass the qualification pre-evaluation will receive the formal invitation for Levy.","chinese":"主办单位向资审合格的应征人发出正式邀请。"},{"english":"The whales expired with a rushing sound.","chinese":"那些鲸鱼呼气时发出一种急促的声音。"},{"english":"With 11)rustling feathers, they swam lightly over the water.","chinese":"他们轻飘飘地浮在水上，羽毛发出飕飕的响声。"},{"english":"But they were uttered only within his imagination.","chinese":"其实只是在他的想象之中发出了声。"},{"english":"Tritium emits a weak form of radiation that does not travel very far in the air and cannot penetrate the skin.","chinese":"氚发出的辐射很弱，在空气传播不远，不能穿透皮肤。"},{"english":"A slight, metallic sound, as of coins rattling in a pocket.","chinese":"叮铛声一种象口袋中硬币碰撞发出轻微。"},{"english":"Data events are used to emit additional data information.","chinese":"数据事件被用于发出额外的数据信息。"}],"related":[{"definition":["voice\/sound\/CL:個|个[ge4]"],"pinyin":["sheng1 yin1"],"word":"声音"},{"definition":["to receive"],"pinyin":["shou1 dao4"],"word":"收到"},{"definition":["sound\/voice\/tone\/noise\/reputation\/classifier for sounds"],"pinyin":["sheng1"],"word":"声"},{"definition":["(of a sound) to come through\/to be heard\/(of news) to arrive"],"pinyin":["chuan2 lai2"],"word":"传来"},{"definition":["to hear"],"pinyin":["ting1 dao4"],"word":"听到"},{"definition":["vocal\/sound\/sound production\/to utter\/to give voice"],"pinyin":["fa1 sheng1"],"word":"发声"},{"definition":["to let off\/to give out"],"pinyin":["fang4 chu1"],"word":"放出"},{"definition":["hiss"],"pinyin":["si1 si1 sheng1"],"word":"嘶嘶声"},{"definition":["hair\/Taiwan pr. [fa3]","to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa4","fa1"],"word":"发"},{"definition":["to transmit outwards\/to disseminate\/efferent (nerve)"],"pinyin":["chuan2 chu1"],"word":"传出"},{"definition":["to respond\/response"],"pinyin":["hui2 ying4"],"word":"回应"},{"definition":["first tone in Mandarin (high, level tone)"],"pinyin":["yi1 sheng1"],"word":"一声"},{"definition":["hissing sound (onom.)"],"pinyin":["si1 si1 sheng1"],"word":"咝咝声"},{"definition":["to put out\/to come up with\/to make (a choice, decision, proposal, response, comment etc)\/to issue (a permit, statement, explanation, apology, reassurance to the public etc)\/to draw (conclusion)\/to deliver (speech, judgment)\/to devise (explanation)\/to extract"],"pinyin":["zuo4 chu1"],"word":"作出"},{"definition":["up here, down there (idiom); to rise and fall in succession\/no sooner one subsides, the next arises\/repeating continuously\/occurring again and again (of applause, fires, waves, protests, conflicts, uprisings etc)"],"pinyin":["ci3 qi3 bi3 fu2"],"word":"此起彼伏"},{"definition":["surname Xiang","towards\/to face\/to turn towards\/direction\/to support\/to side with\/shortly before\/formerly\/always\/all along\/(suffix) suitable for ...\/oriented to ...","to tend toward\/to guide\/variant of 向[xiang4]","variant of 向[xiang4]\/direction\/orientation\/to face\/to turn toward\/to\/towards\/shortly before\/formerly"],"pinyin":["Xiang4","xiang4","xiang4","xiang4"],"word":"向"}]}