{"definition":["vocal\/sound\/sound production\/to utter\/to give voice"],"pinyin":["fa1 sheng1"],"traditional":["發聲"],"rank":22642.0,"normalized_rank":0.31679095602535223,"fraction":0.0000018461790469228557,"cumulative_fraction":0.980388367120396,"word":"发声","characters":[{"definition":["hair\/Taiwan pr. [fa3]","to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa4","fa1"],"word":"发"},{"definition":["sound\/voice\/tone\/noise\/reputation\/classifier for sounds"],"pinyin":["sheng1"],"word":"声"}],"containing_words":[{"definition":["intonation"],"pinyin":["fa1 sheng1 fa3"],"word":"发声法"},{"definition":["sound device"],"pinyin":["fa1 sheng1 qi4"],"word":"发声器"},{"definition":["vocal organs\/vocal cords"],"pinyin":["fa1 sheng1 qi4 guan1"],"word":"发声器官"}],"sentences":[{"english":"Vocalizing is a higher nervous activity of the human being.","chinese":"歌唱发声是人的一种高级神经活动。"},{"english":"The computerized talking dictionary, unparalleled in the world, is. a good assis. ant for your successful career.","chinese":"真人发声电脑辞典，独步天下，事业成功好帮手。"},{"english":"The Parktronic system operates on the echo-sounder principle.","chinese":"驻车定位系统根据回波发声器原理工作。"},{"english":"Chinchillas make a variety of vocalizations, including chirps, squeaks, and barks.","chinese":"龙猫作出了各种发声，包括呻吟，唧唧叫和哨音。"},{"english":"Disclosed is an automatic sounding and counting instrument for pulse which is a medical apparatus suitable for feeling the pulse in traditional Chinese medical treatment.","chinese":"脉搏自动发声计数仪是一种适于中医切脉的医疗器具。"},{"english":"We are very good at picking from very brief vocalization the effective state of a person.","chinese":"通过简单的发声我们就能够推测出一个人的实际状态。"},{"english":"You may mouth the words, but no sound must be uttered.","chinese":"在演唱时，你做出发音的口型就可以了，但不要发声。"},{"english":"He has been using a wheel chair for many years and speaks with the aid of a voice synthesizer.","chinese":"他多年来只能坐在轮椅上，借助发声器“讲话”。"},{"english":"Objective To study the relationship of functional phonation disorders and laryngeal organic diseases.","chinese":"目的探讨功能性发声障碍与喉器质性病变的关系。"},{"english":"Your baby will begin to vocalize long before she can talk.","chinese":"你的女婴早在会说话之前就要开始咿呀发声了。"},{"english":"The computerized talking dictionary, unparalleled in the world, is a good assistant for your successful career.","chinese":"真人发声电脑辞典，独步天下，事业成功好帮手。"},{"english":"Wisdom crieth without; she uttereth her voice in the streets","chinese":"智慧在街市上呼喊，在宽阔处发声。"},{"english":"After that, thorax shrink, the meatus of esophagus turn in again, the voice behavior is over.","chinese":"后胸廓缩小，食管入口黏膜再次内翻，发声结束。"},{"english":"Ma has hit back at Wang, accusing him of abandoning their family.","chinese":"事后，马蓉也发声反击，谴责王宝强抛妻弃子。"},{"english":"In response to a question about the American accent of his synthesiser .","chinese":"回应一个关于他的电子发声器的美国口音问题。"},{"english":"Vocalization should play a primary role in vocality teaching.","chinese":"在声乐教学中发声练习必须放在首位。"}],"related":[{"definition":["to support (a cause)"],"pinyin":["sheng1 yuan2"],"word":"声援"},{"definition":["to respond\/response"],"pinyin":["hui2 ying4"],"word":"回应"},{"definition":["clear (of liquid)\/limpid\/to clarify\/to make sth clear\/to be clear (about the facts)","to settle (of liquid)\/to become clear (by precipitation of impurities)\/precipitate (chemistry)\/to put in order\/to quell disturbances"],"pinyin":["cheng2 qing1","deng4 qing1"],"word":"澄清"},{"definition":["to support\/to back"],"pinyin":["li4 ting3"],"word":"力挺"},{"definition":["to denounce\/to condemn"],"pinyin":["sheng1 tao3"],"word":"声讨"},{"definition":["to call on (sb to do sth)\/to appeal (to)\/an appeal"],"pinyin":["hu1 yu4"],"word":"呼吁"},{"definition":["to make a speech\/statement\/utterance\/CL:個|个[ge4]"],"pinyin":["fa1 yan2"],"word":"发言"},{"definition":["to declare one's position\/to say where one stands"],"pinyin":["biao3 tai4"],"word":"表态"},{"definition":["to issue a document\/document issued by an authority\/outgoing messages\/(Internet) to post an article online"],"pinyin":["fa1 wen2"],"word":"发文"},{"definition":["public\/to publish\/to make public"],"pinyin":["gong1 kai1"],"word":"公开"},{"definition":["public opinion"],"pinyin":["yu2 lun4"],"word":"舆论"},{"definition":["to accuse\/to denounce\/to make a complaint against\/denunciation"],"pinyin":["kong4 su4"],"word":"控诉"},{"definition":["to criticize\/to find fault with\/to denounce"],"pinyin":["zhi3 ze2"],"word":"指责"},{"definition":["to denounce\/to condemn\/to criticize\/condemnation\/criticism"],"pinyin":["qian3 ze2"],"word":"谴责"},{"definition":["(Internet slang) to chastise\/to angrily denounce"],"pinyin":["nu4 dui3"],"word":"怒怼"},{"definition":["to attack (verbally or in writing)"],"pinyin":["peng1 ji1"],"word":"抨击"}]}