{"definition":["to develop and promote\/to carry forward\/to bring to great height of development"],"pinyin":["fa1 yang2 guang1 da4"],"traditional":["發揚光大"],"rank":17988.0,"normalized_rank":0.25167545786520784,"fraction":0.0000029402813602530377,"cumulative_fraction":0.9694869312217902,"word":"发扬光大","characters":[{"definition":["hair\/Taiwan pr. [fa3]","to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa4","fa1"],"word":"发"},{"definition":["abbr. for 揚州|扬州[Yang2 zhou1]\/surname Yang","to raise\/to hoist\/the action of tossing or winnowing\/scattering (in the wind)\/to flutter\/to propagate","variant of 揚|扬[yang2]"],"pinyin":["Yang2","yang2","yang2"],"word":"扬"},{"definition":["light\/ray\/CL:道[dao4]\/bright\/only\/merely\/to use up"],"pinyin":["guang1"],"word":"光"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"}],"containing_words":[],"sentences":[{"english":"We are to push traditional Chinese medicine to the world and carry forward to a higher level of development.","chinese":"健心人要把中药推向世界，将其发扬光大。"},{"english":"People in Hongkong are fond of making soup.","chinese":"香港是广东“汤文化”的发扬光大者。"},{"english":"So we have sufficient reason to carry forward and further develop it in perpetuity.","chinese":"我们有理由永远把它继承并发扬光大。"},{"english":"Democracy will one day prosper in the country.","chinese":"民主终有一天会在这个国家发扬光大。"},{"english":"Therefore, I firmly believe that Guqin will enjoy a bright future of development.","chinese":"我坚信古琴的发展趋势必然是能够发扬光大的。"},{"english":"Can make the Confucianism thoroughfare thought reserve and promote.","chinese":"使儒家孔孟思想得以保留并且发扬光大。"},{"english":"Traditionally girly styles are made even more feminine with theaddition of this fun print.","chinese":"这些趣味十足的印花将传统的柔美风格发扬光大。"},{"english":"Bob: Yeah, we should emulate the spirit of Lei Feng.","chinese":"是的，我们应该把雷锋精神发扬光大。"},{"english":"So you are better off getting someone quick and you develop him with experience.","chinese":"所以你最好找个快手然后用经验让他发扬光大。"}],"related":[{"definition":["to develop\/to make full use of"],"pinyin":["fa1 yang2"],"word":"发扬"},{"definition":["to pass on (to future generations)\/passed on (from former times)\/a continued tradition\/an inheritance"],"pinyin":["chuan2 cheng2"],"word":"传承"},{"definition":["passed on from generation to generation (idiom); to hand down"],"pinyin":["dai4 dai4 xiang1 chuan2"],"word":"代代相传"},{"definition":["to have qualified successors to carry on one's undertaking"],"pinyin":["hou4 ji4 you3 ren2"],"word":"后继有人"},{"definition":["to enhance\/to promote\/to enrich"],"pinyin":["hong2 yang2"],"word":"弘扬"},{"definition":["to inherit\/to succeed to (the throne etc)\/to carry on (a tradition etc)"],"pinyin":["ji4 cheng2"],"word":"继承"},{"definition":["to initiate\/to start\/to found"],"pinyin":["kai1 chuang4"],"word":"开创"},{"definition":["lit. the color blue is made out of indigo but is more vivid than indigo (idiom)\/fig. the student surpasses the master"],"pinyin":["qing1 chu1 yu2 lan2 er2 sheng4 yu2 lan2"],"word":"青出于蓝而胜于蓝"},{"definition":["passed on from generation to generation (idiom); to hand down"],"pinyin":["shi4 dai4 xiang1 chuan2"],"word":"世代相传"},{"definition":["marrow\/pith\/quintessence\/essence"],"pinyin":["jing1 sui3"],"word":"精髓"},{"definition":["the cassock and alms bowl of a Buddhist master passed on to the favorite disciple (Buddhism)\/legacy\/mantle"],"pinyin":["yi1 bo1"],"word":"衣钵"},{"definition":["lit. the flame of a burning piece of firewood passes on to the rest (idiom)\/fig. (of knowledge, skill etc) to be passed on from teachers to students, one generation to another"],"pinyin":["xin1 huo3 xiang1 chuan2"],"word":"薪火相传"},{"definition":["to teach\/to impart\/a disciple\/descendant"],"pinyin":["chuan2 ren2"],"word":"传人"},{"definition":["lit. to fly one's banner on a solitary tree (idiom); fig. to act as a loner\/to stand out\/to develop one's own school\/to have attitude of one's own"],"pinyin":["du2 shu4 yi1 zhi4"],"word":"独树一帜"},{"definition":["to take up sb's mantle\/to follow in sb's steps"],"pinyin":["ji4 cheng2 yi1 bo1"],"word":"继承衣钵"},{"definition":["variant of 弘揚|弘扬[hong2 yang2]"],"pinyin":["hong2 yang2"],"word":"宏扬"}]}