{"definition":["to disperse\/to diverge"],"pinyin":["fa1 san4"],"traditional":["發散"],"rank":22691.0,"normalized_rank":0.3174765295985897,"fraction":0.000001837858322191726,"cumulative_fraction":0.9804786261089282,"word":"发散","characters":[{"definition":["hair\/Taiwan pr. [fa3]","to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa4","fa1"],"word":"发"},{"definition":["scattered\/loose\/to come loose\/to fall apart\/leisurely\/powdered medicine","to scatter\/to break up (a meeting etc)\/to disperse\/to disseminate\/to dispel\/(coll.) to sack","variant of 散[san4]"],"pinyin":["san3","san4","san4"],"word":"散"}],"containing_words":[],"sentences":[{"english":"Happiness would rise from the bottom of your heart when you're enjoying the hot springs.","chinese":"泡在阿尔山的温泉里，幸福则会从心底向外发散。"},{"english":"A new explanation is offered for this diverging \"scissors gap\" in this article.","chinese":"作者对这种发散的“剪刀差”态势作了新的解释。"},{"english":"A method is advanced to avoid of filter diffusion by using residual error prediction.","chinese":"提出一种基于预报残差方法来检测滤波发散问题。"},{"english":"I think it should be decanted now and allowed to breathe for a little while.","chinese":"我认为现在应该轻轻倒，好让气味发散一下。"},{"english":"Moreover, when the weather is cold, the human urinates may follow the radiation \"the steam\".","chinese":"另外，天气寒冷时，人排尿可伴随发散“热气”。"},{"english":"A beam of high radiant power will have high divergence .","chinese":"高辐射功率的光束会有高的发散度。"},{"english":"After re-processing, the divergence difficulties could be overcome.","chinese":"经重整化处理后，发散困难得以解决。"},{"english":"This paper describes a diverging fibre that is analogous to a concave lens.","chinese":"本文讨论一种发散型光学纤维，它类似于凹透镜。"},{"english":"It is pointed out that dispelling exopathogens with pungent and warm drugs were the root of the therapeutic action.","chinese":"并提出“辛温发散”乃是风药治疗作用的根本。"},{"english":"Sealing ring radial cracks are generally divergent, and may be one or more.","chinese":"密封环裂纹一般是径向发散型的，可以是一条或多条。"},{"english":"Biv can with a lens be resolved to tidy white sunbeam once again.","chinese":"可以用一块棱镜将透射的白光发散出来。"},{"english":"The sea began to vibrate with waves that spread out in a circle.","chinese":"大海开始振动，波浪一圈一圈的向外发散。"},{"english":"The only stable solution is the diverging spherical wave.","chinese":"只有发散球面波才是唯一稳定解。"},{"english":"The inner spiritual force disseminates through this inner eye.","chinese":"内在精神力量通过这第三只眼发散。"},{"english":"Directional divergence can occur when the airplane lacks directional or weathercock stability.","chinese":"当飞机方向性稳定不够时会造成方向性发散。"},{"english":"What is the relation between gathering and scattering of thick lens and its thickness?","chinese":"厚透镜的会聚性和发散性与其厚度有何关系？"}],"related":[{"definition":["down\/downward"],"pinyin":["xiang4 xia4"],"word":"向下"},{"definition":["upward\/up\/to advance\/to try to improve oneself\/to make progress"],"pinyin":["xiang4 shang4"],"word":"向上"},{"definition":["moving average index (used in financial analysis)"],"pinyin":["jun1 xian4 zhi3 biao1"],"word":"均线指标"},{"definition":["Boolean (math.)","plum (loanword)"],"pinyin":["Bu4 lin2","bu4 lin2"],"word":"布林"},{"definition":["kinetic energy"],"pinyin":["dong4 neng2"],"word":"动能"},{"definition":["to dissipate everywhere (of light, sound, gas etc)"],"pinyin":["mi2 san4"],"word":"弥散"},{"definition":["to glue together"],"pinyin":["nian2 he2"],"word":"黏合"},{"definition":["to dwindle\/to vanish\/to make vanish\/to exercise restraint\/to curb (one's mirth, arrogance etc)\/to astringe\/(math.) to converge"],"pinyin":["shou1 lian3"],"word":"收敛"},{"definition":["to cast off (in knitting)\/to sew a finishing hem\/to close up (of wound)\/to heal"],"pinyin":["shou1 kou3"],"word":"收口"},{"definition":["to shake up\/to jolt\/to vibrate\/to oscillate\/to fluctuate","to vibrate\/to shake\/to shudder"],"pinyin":["zhen4 dang4","zhen4 dang4"],"word":"震荡"},{"definition":["to extend\/to stretch out\/ductable\/to scale\/scalable"],"pinyin":["yan2 zhan3"],"word":"延展"},{"definition":["vibration\/oscillation"],"pinyin":["zhen4 dang4"],"word":"振荡"},{"definition":["graph of average values"],"pinyin":["jun1 xian4"],"word":"均线"},{"definition":["phony\/so-called\/armchair (expert)\/vain (promise)\/(finance) short-seller\/bear (market)\/short (selling)"],"pinyin":["kong1 tou2"],"word":"空头"},{"definition":["(of trains) up (i.e. towards the capital)\/(of river boats) to go against the current\/to submit (a document) to higher authorities"],"pinyin":["shang4 xing2"],"word":"上行"},{"definition":["resonance (physics)"],"pinyin":["gong4 zhen4"],"word":"共振"}]}