{"definition":["to prevail\/to achieve victory\/to be victorious"],"pinyin":["qu3 de2 sheng4 li4"],"traditional":["取得勝利"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"取得胜利","characters":[{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"},{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["victory\/success\/to beat\/to defeat\/to surpass\/victorious\/superior to\/to get the better of\/better than\/surpassing\/superb (of vista)\/beautiful (scenery)\/wonderful (view)\/(Taiwan pr. [sheng1]) able to bear\/equal to (a task)"],"pinyin":["sheng4"],"word":"胜"},{"definition":["surname Li","sharp\/favorable\/advantage\/benefit\/profit\/interest\/to do good to\/to benefit"],"pinyin":["Li4","li4"],"word":"利"}],"containing_words":[],"sentences":[{"english":"Had Jesus not died on the cross, Christianity would not have triumphed.","chinese":"耶稣要是不死在十字架上，基督教就无法取得胜利。"},{"english":"Once Mao had achieved victory and eliminated his enemies, what was there left for him to do?","chinese":"当毛取得胜利消灭敌人后，他应该做什么？"},{"english":"Victory in Libya comes first in time and importance.","chinese":"在利比亚取得胜利，在时间和重要性上应排在第一。"},{"english":"Keep up the struggle till you succeed.","chinese":"继续战斗直到你们取得胜利。"},{"english":"He is with what he needs to win at life.","chinese":"他的一生中，有取得胜利所需要的能力。"},{"english":"The following year saw Cossack victory at Batoh.","chinese":"第二年，哥萨克在巴托格取得胜利。"},{"english":"Cafu hopes that this will motivate the team to win the game following the draw against Ascoli in the first matchday.","chinese":"卡福希望第一场比赛的平局将激发球队取得胜利。"},{"english":"The Reds got back to winning ways with second-half strikes from Gerrard and Yossi Benayoun.","chinese":"利物浦下半场由杰拉德和贝纳永的进球取得胜利。"},{"english":"China used tough defense to contain their opponents and win the game.","chinese":"中国女篮以严密的防守来抑制对手，并取得胜利。"},{"english":"To get the kind of success that you want, you need to dream big.","chinese":"要想取得胜利，你必需有一个弘远的目的。"},{"english":"The Land Reform is widely conducted in the time of war and achieves success at last.","chinese":"土改在战争环境中得到普遍开展，并最终取得胜利。"},{"english":"We just have to make sure we win at Goodison in a couple of weeks.","chinese":"二周后，我们仍然有信心在古迪逊公园取得胜利。"},{"english":"They diplomatized in order to win victory.","chinese":"他们施展手腕，旨在取得胜利。"},{"english":"So for us to come out with this win, it's just really unexplainable .","chinese":"所以我们最终还能取得胜利，这真的无法解释。"},{"english":"The soldiers exulted at their victory.","chinese":"战士们为取得胜利而欢跃。"},{"english":"M: We must win the negotiation with the foreign businessman.","chinese":"我们必须在这场与外商的谈判中取得胜利。"}],"related":[{"definition":["victory\/CL:個|个[ge4]"],"pinyin":["sheng4 li4"],"word":"胜利"},{"definition":["victorious\/to win\/to triumph"],"pinyin":["huo4 sheng4"],"word":"获胜"},{"definition":["to defeat\/to beat"],"pinyin":["ji1 bai4"],"word":"击败"},{"definition":["to score a victory\/to prevail over one's opponents"],"pinyin":["qu3 sheng4"],"word":"取胜"},{"definition":["to prevail over\/to defeat\/to surmount"],"pinyin":["zhan4 sheng4"],"word":"战胜"},{"definition":["to defeat decisively\/to win decisively\/great victory\/triumph"],"pinyin":["da4 sheng4"],"word":"大胜"},{"definition":["to turn defeat into victory (idiom); to turn the tide"],"pinyin":["fan3 bai4 wei2 sheng4"],"word":"反败为胜"},{"definition":["to beat back\/to repel"],"pinyin":["ji1 tui4"],"word":"击退"},{"definition":["total victory\/to excel by far\/name of a tank\/slam"],"pinyin":["quan2 sheng4"],"word":"全胜"},{"definition":["to seize\/to capture\/to wrest control of"],"pinyin":["duo2 qu3"],"word":"夺取"},{"definition":["to lose\/to suffer defeat"],"pinyin":["shi1 li4"],"word":"失利"},{"definition":["lit. no blood on the men's swords (idiom); fig. an effortless victory"],"pinyin":["bing1 bu4 xue4 ren4"],"word":"兵不血刃"},{"definition":["to lose"],"pinyin":["shu1 diao4"],"word":"输掉"},{"definition":["to defeat\/to smash\/to rout"],"pinyin":["ji1 kui4"],"word":"击溃"},{"definition":["to arrest\/to capture\/to seize\/to win (a set, a game etc)"],"pinyin":["na2 xia4"],"word":"拿下"},{"definition":["to do battle (with sb)"],"pinyin":["dui4 zhan4"],"word":"对战"}]}