{"definition":["to try to please"],"pinyin":["qu3 yue4"],"traditional":["取悅"],"rank":23305.0,"normalized_rank":0.3260671862101773,"fraction":0.000001730418788821344,"cumulative_fraction":0.9815735656039506,"word":"取悦","characters":[{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"},{"definition":["pleased"],"pinyin":["yue4"],"word":"悦"}],"containing_words":[],"sentences":[{"english":"Snow white tried in vain to please her step-mother.","chinese":"白雪公主尝试取悦后母是徒劳的。"},{"english":"Inwardly, I wanted to please him, but I was who I was.","chinese":"内心深处，我试图取悦他，但我还是那一个我。"},{"english":"The censors eviscerated the book to make it inoffensive to the President.","chinese":"审查员删去了该书的精华以取悦于总统。"},{"english":"FIND FREEDOM through seeking to please Me above all else.","chinese":"追求把任何事放下去取悦我，这样能找到自由。"},{"english":"What someone else thinks is urgent can create a sense of people-pleasing induced panic.","chinese":"有些人认为是紧急会造成一种取悦人的感觉引起恐慌。"},{"english":"They want to please us.","chinese":"他们也想取悦我们。"},{"english":"Just be thankful that his intention is to please you in the bedroom.","chinese":"只要明白他的意愿是要在床上取悦于你而已。"},{"english":"This week, the planets blow the whistle on that people-pleasing behavior.","chinese":"这周的星象预示着一些取悦他人的行为。"},{"english":"The firm may take you in just to please your father.","chinese":"本公司可能为取悦你父亲而招你进来。"},{"english":"An ex is flirting, do not entertain them please.","chinese":"你的前任开始卖弄风情，千万别取悦他们。"},{"english":"A strict taskmaster may be difficult, but you're up to the challenge.","chinese":"严格的导师可能难以取悦，但你应付得来。"},{"english":"To seek favor or attention by flattery and obsequious behavior .","chinese":"用拍马屁和谄媚的态度来取悦，引起注意。"},{"english":"But that doesn't mean Google will neuter itself to please the government.","chinese":"然而，这并不意味着谷歌要阉割自己以取悦政府。"},{"english":"You'd lose yourself in the process of being a people-pleaser and there'd be nothing unique left.","chinese":"就会在取悦别人中丢掉自我，丧失独一无二的自己。"},{"english":"But Ferguson wonders exactly who those hard-to-please fans have in mind as a potential replacement.","chinese":"但爵爷担心难以取悦的球迷在想换掉温格。"},{"english":"Our goal is to please customers, to service the society and realize the self-value .","chinese":"我们的目标是取悦顾客，服务社会和实现自我价值。"}],"related":[{"definition":["to get the desired outcome\/to win favor by fawning on sb\/to curry favor with\/a fruitful outcome to reward one's labor"],"pinyin":["tao3 hao3"],"word":"讨好"},{"definition":["to cater to\/to pander to"],"pinyin":["ying2 he2"],"word":"迎合"},{"definition":["favor\/liking\/love\/jubilation\/joy"],"pinyin":["huan1 xin1"],"word":"欢心"},{"definition":["to bow down to everything sb says or does\/to act submissively in order to ingratiate oneself"],"pinyin":["qu1 yi4 feng2 ying2"],"word":"曲意逢迎"},{"definition":["vanity"],"pinyin":["xu1 rong2"],"word":"虚荣"},{"definition":["to rack one's brains (idiom); to take great pains to think sth through"],"pinyin":["fei4 jin4 xin1 si5"],"word":"费尽心思"},{"definition":["delighted to (do sth, idiom)\/perfectly happy to do\/most willing to do"],"pinyin":["xin1 gan1 qing2 yuan4"],"word":"心甘情愿"},{"definition":["to accept a compromise"],"pinyin":["wei3 qu1 qiu2 quan2"],"word":"委曲求全"},{"definition":["to be oneself"],"pinyin":["zuo4 zi4 ji3"],"word":"做自己"},{"definition":["vanity"],"pinyin":["xu1 rong2 xin1"],"word":"虚荣心"},{"definition":["to think through\/to invest effort in thinking about\/to consider thoroughly"],"pinyin":["hua1 xin1 si1"],"word":"花心思"},{"definition":["lit. find a stage, put on a comedy (idiom); to join in the fun\/to play along according to local conditions"],"pinyin":["feng2 chang3 zuo4 xi4"],"word":"逢场作戏"},{"definition":["to belittle\/to disparage\/to play down\/to demean\/to degrade\/to devalue"],"pinyin":["bian3 di1"],"word":"贬低"},{"definition":["to adapt to sb's taste\/to fit sb's fancy"],"pinyin":["tou2 qi2 suo3 hao4"],"word":"投其所好"},{"definition":["to dig for thoughts (idiom); to search everything for an answer\/to rack one's brains"],"pinyin":["wa1 kong1 xin1 si5"],"word":"挖空心思"},{"definition":["to bow and bend the knee (idiom); fawning\/bending and scraping to curry favor"],"pinyin":["bei1 gong1 qu1 xi1"],"word":"卑躬屈膝"}]}