{"definition":["to journey to India on a quest for the Buddhist scriptures\/to learn by studying another's experience"],"pinyin":["qu3 jing1"],"traditional":["取經"],"rank":18001.0,"normalized_rank":0.2518573447315769,"fraction":0.0000029357560538203184,"cumulative_fraction":0.9695251297713218,"word":"取经","characters":[{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"},{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["jing1","Jing1"],"word":"经"}],"containing_words":[],"sentences":[{"english":"The first lesson learned is that lessons can be learned.","chinese":"第一个条件是我们可以吸取经验教训。"},{"english":"As we do so, we must learn the lessons of the past.","chinese":"与此同时，我们必须从以往工作中吸取经验教训。"},{"english":"Companies should learn from these school mottos.","chinese":"公司应该向这些校训取经。"},{"english":"White Horse is a member not to be ignored in the family to Western Paradise for Buddhist Scriptures.","chinese":"白龙马是取经集体中不容忽视的一员。"},{"english":"When we fail, we should make use of oue failure and learn from our experience.","chinese":"当我们失败时，就该充分利用失败，从中吸取经验。"},{"english":"In fact, there are two major sects of Buddhism in India, the Mahayana and the Hinayana .","chinese":"传说玄奘在印度取经时曾住在一座大乘佛寺内。"},{"english":"The bank is also gleaning knowledge from other corporations that invest in green solutions.","chinese":"银行还向其他投资于绿色解决方案的公司取经。"},{"english":"Local governments also look abroad and learn from European efficiency.","chinese":"地方政府到海外取经，学习欧洲国家的节能手段。"},{"english":"The below map shows the route Xuanzang went to India.","chinese":"下面的地图显示当年唐三藏到天竺取经的路线。"},{"english":"\"It's not shameful to learn from successful models, \" Wang says.","chinese":"“从成功案例中吸取经验一点儿也不可耻，”王兴说。"},{"english":"Fox is ready to take advice from a 9-year-old.","chinese":"福克斯公司将从一个9岁的孩子那里取经。"},{"english":"We are all going to the west for Buddhist scriptures .","chinese":"我们几个是去西天取经的。"},{"english":"Of course, Jing Chunhai also constantly went to Crew 5 to learn from their experiences.","chinese":"当然景春海也不断地到5队来走动取经。"},{"english":"But they can take some lessons from Soleri.","chinese":"但它们可以从索拉尼那儿吸取经验教训。"},{"english":"The entire process of getting sutras can be said to have been guided by Tathagata Buddha.","chinese":"整个取经活动可说都是在如来佛的掌控之下。"},{"english":"His name was Xuan Zang and he traveled from China to India in the early Tang Dynasty to collect Buddhist scriptures.","chinese":"他的名字叫玄奘，唐朝初期，他从中国去往印度取经。"}],"related":[{"definition":["Xuanzang (602-664) Tang dynasty Buddhist monk and translator, who traveled to India 629-645"],"pinyin":["Tang2 seng1"],"word":"唐僧"},{"definition":["the eight precepts (Buddhism)"],"pinyin":["ba1 jie4"],"word":"八戒"},{"definition":["Tripitaka (602-664), Tang dynasty Buddhist monk and translator who traveled to India 629-645\/same as 玄奘"],"pinyin":["Tang2 san1 zang4"],"word":"唐三藏"},{"definition":["Zhu Bajie, character in Journey to the West 西遊記|西游记, with pig-like characteristics and armed with a muckrake\/Pigsy in Arthur Waley's translation"],"pinyin":["Zhu1 Ba1 jie4"],"word":"猪八戒"},{"definition":["the Western Paradise (Buddhism)"],"pinyin":["Xi1 tian1"],"word":"西天"},{"definition":["Guanyin, the Bodhisattva of Compassion or Goddess of Mercy (Sanskrit Avalokiteśvara)"],"pinyin":["Guan1 yin1 Pu2 sa4"],"word":"观音菩萨"},{"definition":["tathagata (Buddha's name for himself, having many layers of meaning - Sanskrit: thus gone, having been Brahman, gone to the absolute etc)"],"pinyin":["ru2 lai2"],"word":"如来"},{"definition":["Sha Wujing"],"pinyin":["Sha1 Wu4 jing4"],"word":"沙悟净"},{"definition":["Tripitaka (602-664), Tang dynasty Buddhist monk and translator who traveled to India 629-645\/same as 玄奘"],"pinyin":["San1 zang4"],"word":"三藏"},{"definition":["Xuanzang (602-664), Tang dynasty Buddhist monk and translator who traveled to India 629-645"],"pinyin":["Xuan2 zang4"],"word":"玄奘"},{"definition":["Zhu Bajie 豬八戒|猪八戒[Zhu1 Ba1 jie4] or Zhu Wuneng, Pigsy or Pig (in Journey to the West)"],"pinyin":["Zhu1 Wu4 neng2"],"word":"猪悟能"},{"definition":["to pass on scripture\/to teach Confucian doctrine\/to pass on one's experience"],"pinyin":["chuan2 jing1"],"word":"传经"},{"definition":["Sun Wukong, the Monkey King, character with supernatural powers in the novel Journey to the West 西遊記|西游记[Xi1 you2 Ji4]\/Son Goku, the main character in Dragon Ball 七龍珠|七龙珠[Qi1 long2 zhu1]"],"pinyin":["Sun1 Wu4 kong1"],"word":"孙悟空"},{"definition":["Sun Wukong, the Monkey King, character with supernatural powers from the novel Journey to the West 西遊記|西游记[Xi1 You2 Ji4]"],"pinyin":["Wu4 Kong1"],"word":"悟空"},{"definition":["Sha Wujing"],"pinyin":["Sha1 Seng1"],"word":"沙僧"},{"definition":["sutra\/Taoist treatise"],"pinyin":["zhen1 jing1"],"word":"真经"}]}