{"definition":["ordained or appointed to a post\/to benefit from counsel"],"pinyin":["shou4 ming4"],"traditional":["受命"],"rank":18663.0,"normalized_rank":0.261119583618989,"fraction":0.000002742773631108844,"cumulative_fraction":0.9714060656532664,"word":"受命","characters":[{"definition":["to receive\/to accept\/to suffer\/subjected to\/to bear\/to stand\/pleasant\/(passive marker)"],"pinyin":["shou4"],"word":"受"},{"definition":["life\/fate\/order or command\/to assign a name, title etc"],"pinyin":["ming4"],"word":"命"}],"containing_words":[{"definition":["to become Emperor by the grace of Heaven\/to \"receive the Mandate of Heaven\" (traditional English translation)"],"pinyin":["shou4 ming4 yu2 tian1"],"word":"受命于天"},{"definition":["(idiom) to take on a leadership role at a time of crisis"],"pinyin":["lin2 wei1 shou4 ming4"],"word":"临危受命"}],"sentences":[{"english":"As the enemy retreated, we were ordered to disengage.","chinese":"当敌人退却时我们受命撤出战斗。"},{"english":"The less time you spend sitting, the longer your lifespan.","chinese":"你坐着的时间越短，你的受命则会越长。"},{"english":"The programmer writes one mnemonic (memory-aiding) instruction for each machine-level instruction.","chinese":"接受命令并将该命令解释为机器指令的程序。"},{"english":"The reader or smart card is not ready to accept commands.","chinese":"读取器或智能卡尚未准备好接受命令。"},{"english":"Then he still didn't obey king's order and killed himself with a sword .","chinese":"于是他仍不接受命令，用剑自杀而死。"},{"english":"Paris was tasked with choosing who the most beautiful was.","chinese":"帕里斯受命决定谁是最漂亮的女人。"},{"english":"\"We did not get instructions to shoot at anything that moved, \" said one soldier.","chinese":"“我们没有受命向所有移动目标开枪，”一名士兵说。"},{"english":"He was given the task of painting a picture of St Matthew for the alter of a church in Rome.","chinese":"当时他受命给罗马一座教堂的祭坛画一幅圣马太的像。"},{"english":"Prime Minister Guillaume Soro has been asked to form a new government.","chinese":"总理纪尧姆萦罗已经受命去组织新的政府。"},{"english":"Junkers were ordered northwards to help a German merchantman which were under attack by a Norwegian destroyer.","chinese":"容受命飞助正遭受挪威驱逐舰袭击德运输船。"},{"english":"And I also don't like taking orders.","chinese":"而且我不喜欢接受命令。"},{"english":"Our gun crew was then ordered to destroy this enemy battery.","chinese":"我们炮兵其后受命歼灭敌人的炮兵连。"},{"english":"The Sixth Fleet of the United States Navy was ordered to the South Sea.","chinese":"美国海军第六舰队受命驶向南海。"},{"english":"Large field belongs to the Japanese Army 43 Division was ordered to hang on the island.","chinese":"大场所属的日本陆军43师团受命死守这个小岛。"},{"english":"Dr. Smith is assigned to take charge of the department.","chinese":"史密斯大夫受命分管这个部门。"},{"english":"All of us were sent to Washington to carry out the people's business.","chinese":"我们在座的各位受命来到华盛顿都是要为民服务。"}],"related":[{"definition":["to give orders"],"pinyin":["shou4 ming4"],"word":"授命"},{"definition":["to receive orders\/to follow orders\/to act under orders"],"pinyin":["feng4 ming4"],"word":"奉命"},{"definition":["appointment (to a job)\/to be appointed (to high office)\/to accept an appointment\/entrusted with responsibilities\/same as 授任"],"pinyin":["shou4 ren4"],"word":"受任"},{"definition":["to receive an imperial command"],"pinyin":["feng4 zhao4"],"word":"奉诏"},{"definition":["to put down a revolt\/to pacify a rebellion"],"pinyin":["ping2 pan4"],"word":"平叛"},{"definition":["to offer (tribute)\/to present respectfully (to superior, ancestor, deity etc)\/to esteem\/to revere\/to believe in (a religion)\/to wait upon\/to accept orders (from superior)"],"pinyin":["feng4"],"word":"奉"},{"definition":["to receive orders"],"pinyin":["feng4 zhao4"],"word":"奉召"},{"definition":["to appoint"],"pinyin":["wei3 pai4"],"word":"委派"},{"definition":["on imperial orders"],"pinyin":["feng4 zhi3"],"word":"奉旨"},{"definition":["front line (military)"],"pinyin":["qian2 di2"],"word":"前敌"},{"definition":["to command\/to direct"],"pinyin":["tong3 shuai4"],"word":"统率"},{"definition":["to dispatch\/to assign\/a dispatch"],"pinyin":["diao4 qian3"],"word":"调遣"},{"definition":["to lead troops"],"pinyin":["dai4 bing1"],"word":"带兵"},{"definition":["to send (on a mission)\/to dispatch"],"pinyin":["pai4 qian3"],"word":"派遣"},{"definition":["secret instruction\/secret order"],"pinyin":["mi4 ling4"],"word":"密令"},{"definition":["to go abroad as ambassador\/to be sent on a diplomatic mission"],"pinyin":["chu1 shi3"],"word":"出使"}]}