{"definition":["to accept to hear a case\/to handle (a service)"],"pinyin":["shou4 li3"],"traditional":["受理"],"rank":3717.0,"normalized_rank":0.052005652484154855,"fraction":0.00003645703644300639,"cumulative_fraction":0.8207938448944693,"word":"受理","characters":[{"definition":["to receive\/to accept\/to suffer\/subjected to\/to bear\/to stand\/pleasant\/(passive marker)"],"pinyin":["shou4"],"word":"受"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"}],"containing_words":[],"sentences":[{"english":"He is waiting to find out if the courts will accept his case.","chinese":"他正等着看法院是否会受理此案。"},{"english":"Thirdly, the reception and examination of appeal should be standardized.","chinese":"再次，应规范立卷受理和立案审查两个阶段。"},{"english":"We are handling your complaints, and we will call you back in 3 to 7 working-days.","chinese":"你的投诉我们已经受理，三至七个工作日会给您回音。"},{"english":"If a lawsuit is filed due to disputes of torts , the people's court may accept it directly.","chinese":"因侵权纠纷起诉的，人民法院可以直接受理。"},{"english":"I'm afraid we can't accept perishable goods.","chinese":"我们这里恐怕不能受理易腐烂的物品。"},{"english":"But it seems amazing that the courts of this country allowed him to pursue this case.","chinese":"不过，英国法院受理他这个案子似乎也让人吃惊不小。"},{"english":"The notification in the preceding paragraph shall explain the reason of its rejection in writing.","chinese":"前项不受理之书面通知，应叙明理由。"},{"english":"Have you failed to attend a hearing on removability or inadmissibility within the last five years?","chinese":"你有没有出席在过去五年内就撤换，或受理听证？"},{"english":"The the China Center of Adoption Affairs(CCAA)does not accept the adoption documents directly submitted by single person.","chinese":"中国收养中心不受理个人直接递交的收养文件。"},{"english":"They will wait after the end of this year's pilgrimage to re-opening Umrah Visa application.","chinese":"之后将等待今年朝觐结束后，再行开放受理副朝签证。"},{"english":"As the name implies the courts of appeals have appel late jurisdiction.","chinese":"顾名思义，上诉法院有受理上诉的裁判权。"},{"english":"I think the restaurant accepts credit cards.","chinese":"我想餐厅一定会受理信用卡的。"},{"english":"Other price-related violations which ought to be accepted by the price administrative department.","chinese":"应当由价格主管部门受理的其他价格违法行为。"},{"english":"Before that, patent appeals went to circuit courts of appeal.","chinese":"在此之前，专利上诉由巡回上诉法院受理。"},{"english":"The court dismissed the case because of lack of evidence.","chinese":"法院因证据不足而不受理此案。"},{"english":"Other circumstances falling out of the scope for accepting exposures of price-related violations.","chinese":"不属于价格违法行为举报受理范围的其他情形。"}],"related":[{"definition":["to register (to an official organism)\/to file a case (for investigation)"],"pinyin":["li4 an4"],"word":"立案"},{"definition":["to handle\/to transact\/to conduct"],"pinyin":["ban4 li3"],"word":"办理"},{"definition":["lawsuit"],"pinyin":["su4 song4"],"word":"诉讼"},{"definition":["to transfer (a case, a person, files etc)"],"pinyin":["yi2 song4"],"word":"移送"},{"definition":["to apply for sth\/application (form etc)\/CL:份[fen4]"],"pinyin":["shen1 qing3"],"word":"申请"},{"definition":["to file a complaint\/to appeal (to an authority, a higher court of justice etc)\/complaint\/appeal"],"pinyin":["shen1 su4"],"word":"申诉"},{"definition":["to drop a lawsuit"],"pinyin":["che4 su4"],"word":"撤诉"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"审查"},{"definition":["to conclude a case\/to wind up"],"pinyin":["jie2 an4"],"word":"结案"},{"definition":["case\/instance\/CL:宗[zong1],樁|桩[zhuang1],起[qi3]"],"pinyin":["an4 jian4"],"word":"案件"},{"definition":["applicant"],"pinyin":["shen1 qing3 ren2"],"word":"申请人"},{"definition":["common plea\/civil appeal (as opposed to criminal case)"],"pinyin":["min2 shi4 su4 song4"],"word":"民事诉讼"},{"definition":["to authorize\/to investigate then ratify"],"pinyin":["he2 zhun3"],"word":"核准"},{"definition":["to hear (a case)"],"pinyin":["shen3 li3"],"word":"审理"},{"definition":["to adjudicate\/to finish a trial\/to try and pass verdict"],"pinyin":["shen3 jie2"],"word":"审结"},{"definition":["to sue\/to bring a lawsuit against\/to prosecute"],"pinyin":["qi3 su4"],"word":"起诉"}]}