{"definition":["to give an interview\/to be interviewed\/to respond to (questions, a survey etc)"],"pinyin":["shou4 fang3"],"traditional":["受訪"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"受访","characters":[{"definition":["to receive\/to accept\/to suffer\/subjected to\/to bear\/to stand\/pleasant\/(passive marker)"],"pinyin":["shou4"],"word":"受"},{"definition":["to visit\/to call on\/to seek\/to inquire\/to investigate"],"pinyin":["fang3"],"word":"访"}],"containing_words":[{"definition":["participant in a survey\/an interviewee\/those questioned"],"pinyin":["shou4 fang3 zhe3"],"word":"受访者"}],"sentences":[{"english":"We can invest in clean technologies and make the shift to a clean economy with lower emissions. Switching to sustainable technologies was supported by 66 percent of the UMR poll respondents.","chinese":"UMR调查的受访者66%支持转向可持续的技术。"},{"english":"The interviewer asked the interviewees their opinions on the minimum wage.","chinese":"访问员向受访人查问他们对最低工资的意见。"},{"english":"Even among those polled in the US, some 48 per cent agreed.","chinese":"即使在美国，也有大约48%的受访者同意上述说法。"},{"english":"Like all the other interviewees she refused to be named.","chinese":"想起他的受访者一样，她拒绝留下名字。"},{"english":"Was it possible that the plaintiffs had colluded with Beristain to handpick the interviewees?","chinese":"是否有可能是原告勾结贝斯坦并精心挑选了受访者？"},{"english":"Only 12 percent of respondents said that made-in-China quality was improving.","chinese":"只有12%的受访者认为“中国制造”的质量在改善。"},{"english":"Another 26 percent reported that they didn't clean cabinets.","chinese":"报告称，另外26%的受访者没有清洁他们的厨柜。"},{"english":"Results showed that 70% of respondents did not want to buy dried mushroom from China.","chinese":"结果发现，约70%受访者不愿购买大陆干香菇。"},{"english":"Respondents were quizzed on their feelings about God as a provider of control.","chinese":"受访者被问及对主宰万物的神的感觉。"},{"english":"Britons are ruder than they were a decade ago, according to a survey on Monday that showed almost three-quarters of people think manners should be taught at school.","chinese":"近四分之三的受访者认为学校应加强礼仪教育。"},{"english":"With more than 10 lenders say, their money is ultimately to Shi Guobao.","chinese":"受访的十多名放贷者称，他们的钱最终是给石国豹的。"},{"english":"Sixty-two percent of investors polled by the CAQ believe the rules mandated by Sarbanes-Oxley should be left in place.","chinese":"的受访投资者认为萨班斯法案的相关规则应保持原状。"},{"english":"All the respondent could get a GWP after the research.","chinese":"所有的受访者可以得到一个全球升温潜能的研究后。"},{"english":"The poll is based on a random sample of 1,097 respondents nationwide.","chinese":"该调查的受访者是从全国随机抽取的1097名民众。"},{"english":"Only 10% of those surveyed said they will friend anyone.","chinese":"只有10%的受访者表示他们会同任何人交友。"},{"english":"Bulgarian judges won 31 percent approval, while in Poland 86 percent said they trusted judges.","chinese":"的保加利亚受访者信任法官，而在波兰比例为86%。"}],"related":[{"definition":["participant in a survey\/an interviewee\/those questioned"],"pinyin":["shou4 fang3 zhe3"],"word":"受访者"},{"definition":["respondent (in a survey, questionnaire, study etc)"],"pinyin":["bei4 fang3 zhe3"],"word":"被访者"},{"definition":["investigator"],"pinyin":["diao4 cha2 zhe3"],"word":"调查者"},{"definition":["to express\/to show\/to say\/to state\/to indicate\/to mean"],"pinyin":["biao3 shi4"],"word":"表示"},{"definition":["to confess\/to admit\/to come clean\/calmly"],"pinyin":["tan3 cheng2"],"word":"坦承"},{"definition":["to speak forthrightly\/to talk bluntly"],"pinyin":["zhi2 yan2"],"word":"直言"},{"definition":["opinion poll"],"pinyin":["min2 diao4"],"word":"民调"},{"definition":["to interview\/to gather news\/to hunt for and collect\/to cover"],"pinyin":["cai3 fang3"],"word":"采访"},{"definition":["to say candidly\/to acknowledge frankly"],"pinyin":["tan3 yan2"],"word":"坦言"},{"definition":["Carrie Lam (1957-), chief executive of Hong Kong 2017-, full name 林鄭月娥|林郑月娥[Lin2 Zheng4 Yue4 e2] Carrie Lam Cheng Yuet-ngor"],"pinyin":["Lin2 Zheng4"],"word":"林郑"},{"definition":["previously"],"pinyin":["zao3 qian2"],"word":"早前"},{"definition":["(Tw) to make a telephone call (generally as a representative of a company, school or agency etc, to an individual, often for the purpose of conducting a survey) (abbr. for 電話訪問|电话访问)"],"pinyin":["dian4 fang3"],"word":"电访"},{"definition":["to visit and discuss\/to interview"],"pinyin":["fang3 tan2"],"word":"访谈"},{"definition":["William Lai Ching-te (1959-), Taiwanese DPP politician, vice president of the Republic of China from 2020"],"pinyin":["Lai4 Qing1 de2"],"word":"赖清德"},{"definition":["Taiwan media"],"pinyin":["Tai2 mei2"],"word":"台媒"},{"definition":["results (of an investigation, poll)"],"pinyin":["diao4 cha2 jie2 guo3"],"word":"调查结果"}]}