{"definition":["(transformer) substation"],"pinyin":["bian4 dian4 zhan4"],"traditional":["變電站"],"rank":15346.0,"normalized_rank":0.21471045010003775,"fraction":0.000003984459325196438,"cumulative_fraction":0.9604392041880564,"word":"变电站","characters":[{"definition":["to change\/to become different\/to transform\/to vary\/rebellion"],"pinyin":["bian4"],"word":"变"},{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"电"},{"definition":["station\/to stand\/to halt\/to stop\/branch of a company or organization\/website"],"pinyin":["zhan4"],"word":"站"}],"containing_words":[],"sentences":[{"english":"The powerhouse is designed to be of shaft and semi-underground type and the substation of open type.","chinese":"厂房采用竖井半地下式布置，开敞式变电站。"},{"english":"In this paper, an on-line monitoring device for fast transient overvoltages on substations is designed.","chinese":"本文设计了一个变电站瞬时过电压在线监测系统。"},{"english":"An intelligent equipment which can transmit degrees of ammeters in power system is designed.","chinese":"设计了一种用于电力变电站的智能抄表装置。"},{"english":"The substation equipped with a transformer of 500 KVA is at the south of the plant.","chinese":"在工程的南边有一座装有五百千伏安变电器的变电站。"},{"english":"The system has been put into use in Changsha Mawangdui Unatended Substation.","chinese":"该系统已在长沙马王堆无人值班变电站投入运行。"},{"english":"This paper studies the model of each element in Tang Yin substation.","chinese":"本文在分析了汤阴变电站各元件的谐波参数。"},{"english":"Problem is also encountered in connections between underground lines and substations.","chinese":"地下电缆线路与变电站联接时还会碰到问题。"},{"english":"An insulated conductor forming part of the return circuit and connecting the rest of the re-turn circuit to the substation.","chinese":"形成部分回流且连接变电站其余回路的绝缘导线。"},{"english":"It is well known that substations are the key of power transmission system .","chinese":"众所周知，变电站是输配电系统中的重要环节。"},{"english":"This paper introduces the application of CANbus network in substation automation system SAS .","chinese":"介绍了CAN总线在变电站自动化系统中的实际应用。"},{"english":"Usually, there is no interconnection between the circuits energized by the various substations.","chinese":"通常，由不同变电站送电的线路之间无相互联接。"},{"english":"The power failure took a toll on two traction substations along the Yingtan-Xiamen electric railway.","chinese":"停电影响鹰厦电气化铁路2个牵引变电站。"},{"english":"The sun sets over the Islington substation in Christchurch, New Zealand.","chinese":"落日的余晖笼罩着新西兰基督城的伊斯灵顿变电站。"},{"english":"The short-time electric field strength of 2 m above ground reaches 22.","chinese":"工频短路时变电站内短时电场强度达到22。"},{"english":"Substations and periphery stations can have several user lines or branch channels.","chinese":"变电站等设外围站可提供若干条用户线或转接通道。"},{"english":"In substations, Switching operation will give rise to transient overvoltage.","chinese":"在变电站内，开关的操作将产生瞬态过电压。"}],"related":[{"definition":["power distribution substation"],"pinyin":["pei4 dian4 zhan4"],"word":"配电站"},{"definition":["transformer"],"pinyin":["bian4 ya1 qi4"],"word":"变压器"},{"definition":["kilovolt"],"pinyin":["qian1 fu2"],"word":"千伏"},{"definition":["a power station\/an electricity generating plant"],"pinyin":["dian4 zhan4"],"word":"电站"},{"definition":["to have a power failure\/power cut"],"pinyin":["ting2 dian4"],"word":"停电"},{"definition":["pretest"],"pinyin":["yu4 shi4"],"word":"预试"},{"definition":["power transformation"],"pinyin":["bian4 dian4"],"word":"变电"},{"definition":["lightning arrester"],"pinyin":["bi4 lei2 qi4"],"word":"避雷器"},{"definition":["pumping station"],"pinyin":["beng4 zhan4"],"word":"泵站"},{"definition":["generating line\/generatrix (in geometry)\/bus (in electronics)\/bus bar"],"pinyin":["mu3 xian4"],"word":"母线"},{"definition":["electrical network"],"pinyin":["dian4 wang3"],"word":"电网"},{"definition":["to supply electricity"],"pinyin":["gong1 dian4"],"word":"供电"},{"definition":["electricity transmission\/to transmit electricity"],"pinyin":["shu1 dian4"],"word":"输电"},{"definition":["electric pumping station in irrigation system"],"pinyin":["dian4 guan4 zhan4"],"word":"电灌站"},{"definition":["water treatment plant"],"pinyin":["wu1 shui3 chu3 li3 chang3"],"word":"污水处理厂"},{"definition":["to overhaul\/to examine and fix (a motor)\/to service (a vehicle)"],"pinyin":["jian3 xiu1"],"word":"检修"}]}