{"definition":["to have no alternative but to\/to be obliged to"],"pinyin":["zhi3 de2"],"traditional":["只得"],"rank":6840.0,"normalized_rank":0.0957004743049823,"fraction":0.000015227656146102454,"cumulative_fraction":0.8941171556929791,"word":"只得","characters":[{"definition":["only\/merely\/just\/but","grain that has begun to ripen\/variant of 衹|只[zhi3]","variant of 只[zhi3]","variant of 只[zhi3]","classifier for birds and certain animals, one of a pair, some utensils, vessels etc"],"pinyin":["zhi3","zhi3","zhi3","zhi3","zhi1"],"word":"只"},{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[],"sentences":[{"english":"He had such bad flu that they had to take him to the hospital.","chinese":"他得了严得的流感，只得被子送进医院了。"},{"english":"If yod don't have the right tool for the job, we'll have to make do without it.","chinese":"假如你没有干这活的适当工具，咱们只得对付着干。"},{"english":"We had to eat some potatoes substituted as a meal.","chinese":"我们只得吃了几个马铃薯充饥。"},{"english":"We had to push the car home as it broke down half way and we couldst know how to repair it.","chinese":"半路上车抛锚了，我们又无从修理，只得将其推回。"},{"english":"Eventualy we have to adjust to the environment where fruits are always with worms.","chinese":"最终我们只得适应水果总会有虫子的环境。"},{"english":"Golgi to school, only to pick up trash money.","chinese":"高尔基为了上学，只得去捡垃圾换钱。"},{"english":"They had to change the date fixed to Feb. 28th.","chinese":"他们只得把约期改到2月28日。"},{"english":"So Portia had to show the three boxes to him.","chinese":"因此波西亚只得把那三只盒子拿给他看。"},{"english":"Tassels on the horns of a dilemma, back to the husbands family and no steps, had to find treasure complex complaint.","chinese":"流苏进退两难，回婆家又没台阶，只得找宝络诉苦。"},{"english":"I told him that because of the last condition, I'd have to turn it down.","chinese":"我告诉他，由于那最后一个条件，我只得谢尽。"},{"english":"You will just have to grovel to the bank manager for a loan .","chinese":"你只得低声下气地向银行经理借贷。"},{"english":"The doctor had to abort the pregnancy.","chinese":"医生只得给孕妇堕胎。"},{"english":"I take a deep inhale, depressed at the freshness.","chinese":"但我还得深吸一口清风，只得暂存清新的爱语。"},{"english":"I was surprised; I looked down, flushing, of course.","chinese":"我很惊讶，只得低下了头，理所当然地脸红了。"},{"english":"When the crash came, the family was forced to dispose of most of its possessions.","chinese":"家庭破落时，这家人只得变卖大部分家产。"},{"english":"The teacher spoke in a very stern voice and Timothy had to follow her to her room.","chinese":"老师说得很严厉，蒂莫西只得跟她进房间。"}],"related":[{"definition":["without any better option\/to have to\/to be forced to"],"pinyin":["zhi3 hao3"],"word":"只好"},{"definition":["to drop (subject etc)"],"pinyin":["zuo4 ba4"],"word":"作罢"},{"definition":["to act against one's will\/to have no alternative but to\/to have to\/to have no choice\/must"],"pinyin":["bu4 de2 yi3"],"word":"不得已"},{"definition":["helpless\/without choice\/for lack of better option\/grudgingly\/willy-nilly\/nolens volens\/abbr. for 無可奈何|无可奈何[wu2 ke3 nai4 he2]"],"pinyin":["wu2 nai4"],"word":"无奈"},{"definition":["have no way out\/have no alternative\/abbr. to 無奈|无奈[wu2 nai4]"],"pinyin":["wu2 ke3 nai4 he2"],"word":"无可奈何"},{"definition":["you might as well (do it)\/simply\/just"],"pinyin":["suo3 xing4"],"word":"索性"},{"definition":["to brace oneself to do sth\/to put a bold face on it\/to summon up courage\/to force oneself to"],"pinyin":["ying4 zhe5 tou2 pi2"],"word":"硬着头皮"},{"definition":["can only\/obliged to do sth\/to have no other choice"],"pinyin":["zhi3 neng2"],"word":"只能"},{"definition":["to have no way out\/to have no alternative"],"pinyin":["wan4 ban1 wu2 nai4"],"word":"万般无奈"},{"definition":["to be compelled\/to be forced"],"pinyin":["bei4 po4"],"word":"被迫"},{"definition":["no strategy left to try (idiom); at one's wit's end\/at the end of one's tether\/powerless"],"pinyin":["wu2 ji4 ke3 shi1"],"word":"无计可施"},{"definition":["have no choice or option but to\/cannot but\/have to\/can't help it\/can't avoid"],"pinyin":["bu4 de2 bu4"],"word":"不得不"},{"definition":["straightforward\/clear-cut\/blunt (e.g. statement)\/you might as well\/simply"],"pinyin":["gan1 cui4"],"word":"干脆"},{"definition":["to do with difficulty\/to force sb to do sth\/reluctant\/barely enough"],"pinyin":["mian3 qiang3"],"word":"勉强"},{"definition":["to do something to sb\/to deal with\/to cope\/how?\/to no avail"],"pinyin":["nai4 he2"],"word":"奈何"},{"definition":["to settle for second best\/the next best thing"],"pinyin":["tui4 er2 qiu2 qi2 ci4"],"word":"退而求其次"}]}