{"definition":["can only\/obliged to do sth\/to have no other choice"],"pinyin":["zhi3 neng2"],"traditional":["只能"],"rank":715.0,"normalized_rank":0.010003777650301512,"fraction":0.0002158896698515293,"cumulative_fraction":0.5669249041979086,"word":"只能","characters":[{"definition":["only\/merely\/just\/but","grain that has begun to ripen\/variant of 衹|只[zhi3]","variant of 只[zhi3]","variant of 只[zhi3]","classifier for birds and certain animals, one of a pair, some utensils, vessels etc"],"pinyin":["zhi3","zhi3","zhi3","zhi3","zhi1"],"word":"只"},{"definition":["surname Neng","can\/to be able to\/might possibly\/ability\/(physics) energy"],"pinyin":["Neng2","neng2"],"word":"能"}],"containing_words":[],"sentences":[{"english":"Has the purple devoted to encourage and comfort can only temporarily soothe her injured heart.","chinese":"曾紫陌的鼓励和安慰也只能暂时稍稍安抚她受伤的心。"},{"english":"Running our of grain, the army had to live on wild fruit and tree bark.","chinese":"部队断了粮，只能靠野果和树皮充饥。"},{"english":"He had no choice but to comply, allowing the Imperials aboard.","chinese":"他别无选择，只能照办，同意帝国检查队登舰。"},{"english":"There were no entrances or exits, and players could only leave by hearthing out;","chinese":"既没有入口也没有出口，玩家只能炉石出去。"},{"english":"Pure is in one kind of bone thing, installs only can call affectedly .","chinese":"纯真是一种骨子里的东西，装出来的只能叫矫揉造作。"},{"english":"Most boxers can fight only five rounds because this kind of fighting is very difficult.","chinese":"大多数拳击手只能打五轮，因为这种拼斗非常困难。"},{"english":"Please note that the activation code can be used only on a single phone and is not transferrable .","chinese":"请注意激活码只能在一台手机上使用，不可以传递。"},{"english":"The prototypes they have now let you fly a whole 30 seconds.","chinese":"现在研究出来的原型机只能让你飞整整的30秒。"},{"english":"On WHT and many other places, you only hear about it when it messes up.","chinese":"在西隧和许多其他地方，你只能听到它时它弄乱。"},{"english":"This key is one use only IIRC.","chinese":"简单的说，钥匙只能用一次。"},{"english":"Passion alone cannot win the revolution; Passion just makes martyrs.","chinese":"光靠满腔热血，不会使革命成，只能制造烈士。"},{"english":"We were all told to say that she was a lodger.","chinese":"要是别人问起来，我们只能说她是“一个租客”。"},{"english":"The slave might be your business manager, but all the slave could do is the paperwork.","chinese":"就算他为你管理生意，也只能做做文书工作。"},{"english":"If you spend all the money you get, you will have to depend on pension when old.","chinese":"若把所有钱都“月光”掉，老了将只能靠养老金。"},{"english":"Right now, Hockaday's prototypes put out only a few milli- watts of power.","chinese":"现在，霍克蒂的燃料电池原型只能输出几毫瓦的电力。"},{"english":"Like a little hamster, who once spend his days in a RV pank.","chinese":"比如一只小仓鼠，每天都只能在一个旅行车场度日。"}],"related":[{"definition":["there is nothing to be done\/one can't do anything about it"],"pinyin":["mei2 ban4 fa3"],"word":"没办法"},{"definition":["without any better option\/to have to\/to be forced to"],"pinyin":["zhi3 hao3"],"word":"只好"},{"definition":["at a loss\/unable to do anything about it\/to have no choice"],"pinyin":["mei2 fa3"],"word":"没法"},{"definition":["unable\/incapable"],"pinyin":["wu2 fa3"],"word":"无法"},{"definition":["cannot\/must not\/should not"],"pinyin":["bu4 neng2"],"word":"不能"},{"definition":["merely\/simply\/only\/but"],"pinyin":["zhi3 shi4"],"word":"只是"},{"definition":["have no choice or option but to\/cannot but\/have to\/can't help it\/can't avoid"],"pinyin":["bu4 de2 bu4"],"word":"不得不"},{"definition":["helpless\/without choice\/for lack of better option\/grudgingly\/willy-nilly\/nolens volens\/abbr. for 無可奈何|无可奈何[wu2 ke3 nai4 he2]"],"pinyin":["wu2 nai4"],"word":"无奈"},{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["really\/actually\/indeed\/true\/real\/honest\/dependable\/(philosophy) reality"],"pinyin":["shi2 zai4"],"word":"实在"},{"definition":["but\/yet\/however\/only\/merely\/still"],"pinyin":["dan4"],"word":"但"},{"definition":["again\/once more\/re-\/second\/another\/then (after sth, and not until then)\/no matter how ... (followed by an adjective or verb, and then (usually) 也[ye3] or 都[dou1] for emphasis)"],"pinyin":["zai4"],"word":"再"},{"definition":["but\/yet\/however\/while\/to go back\/to decline\/to retreat\/nevertheless\/even though","old variant of 卻|却[que4]"],"pinyin":["que4","que4"],"word":"却"},{"definition":["but\/however"],"pinyin":["dan4 shi4"],"word":"但是"},{"definition":["only\/merely\/just\/but","grain that has begun to ripen\/variant of 衹|只[zhi3]","variant of 只[zhi3]","variant of 只[zhi3]","classifier for birds and certain animals, one of a pair, some utensils, vessels etc"],"pinyin":["zhi3","zhi3","zhi3","zhi3","zhi1"],"word":"只"},{"definition":["or\/either one or the other"],"pinyin":["yao4 me5"],"word":"要么"}]}