{"definition":["to warn repeatedly\/to urge\/to exhort again and again"],"pinyin":["ding1 zhu3"],"traditional":["叮囑"],"rank":12701.0,"normalized_rank":0.1777034684426287,"fraction":0.000005559265963782963,"cumulative_fraction":0.9480124731745228,"word":"叮嘱","characters":[{"definition":["to sting or bite (of mosquito, bee etc)\/to say repeatedly\/to urge insistently\/to ask repeatedly\/to stick to a point\/(onom.) tinkling or jingling sound"],"pinyin":["ding1"],"word":"叮"},{"definition":["to enjoin\/to implore\/to urge"],"pinyin":["zhu3"],"word":"嘱"}],"containing_words":[],"sentences":[{"english":"One day I was going to my auntie's home, mom told me to bring an umbrella in case it mined.","chinese":"一天我去姑姑家，妈妈叮嘱我带把伞以防下雨。"},{"english":"Lin Yuhui once told Cheng Bijian to beware of high gold.","chinese":"林语慧曾经叮嘱高金榜提防程碧剑。"},{"english":"Our parents used to remind us to put our toys away when we were done with them.","chinese":"小时候，父母总是叮嘱我们玩了玩具之后要收好。"},{"english":"Gerald helped his wife into the carriage and gave orders to the coachman to drive carefully.","chinese":"杰拉尔德把妻子扶进马车，叮嘱车夫小心驾驶。"},{"english":"Jean Valjean's injunction, and the name of Madame Thenardier, had chilled her blood.","chinese":"冉阿让的叮嘱和德纳第这名字早已使她麻木了。"},{"english":"At the same time told I dare stone must be a good person, the destruction of all the bad.","chinese":"同时叮嘱石敢当一定要好好做人，杀尽天下坏人。"},{"english":"The doctor told him to bathe his eyes with a very dilute solution of boric acid.","chinese":"医生叮嘱他用稀释的硼酸溶液洗他的眼睛。"},{"english":"East plant told mother no application susceptibility show.","chinese":"东株叮嘱母亲不准应用敏秀。"},{"english":"He had been warned not to tell anyone about it.","chinese":"曾经叮嘱他不要和任何人讲这事。"},{"english":"I remembered having asked you to prepare two such dresses before our leaving, didn't I?","chinese":"我记得出国前叮嘱过你准备两套这样的礼服。"},{"english":"God tells me not to faint.","chinese":"神叮嘱我不要丧胆。"},{"english":"When the researcher briefly left the room, the children were told not to look.","chinese":"研究人员叮嘱小孩不要向后面看，才离开房间。"},{"english":"Bobridge told Lin Lei to allow the company to maintain growth performance, more to deal with tianlong.","chinese":"骏升叮嘱林磊让公司维持业绩增长，更加要对付天龙。"},{"english":"Immediately told stone I dare to survey murderesss whereabouts.","chinese":"当即叮嘱石敢当好好调查女杀手的去向。"},{"english":"Then enjoining him to keep it strictly confidential, he told him the whole story.","chinese":"叮嘱他严守秘密，然后把这事讲出来。"},{"english":"The doctor ordered you to stay in bed.","chinese":"医生叮嘱你要卧床休息。"}],"related":[{"definition":["to tell\/to exhort\/injunction"],"pinyin":["zhu3 fu4"],"word":"嘱咐"},{"definition":["repeatedly urging\/imploring over and over again"],"pinyin":["qian1 ding1 wan4 zhu3"],"word":"千叮万嘱"},{"definition":["to entrust a task to sb else"],"pinyin":["zhu3 tuo1"],"word":"嘱托"},{"definition":["to warn\/to admonish"],"pinyin":["gao4 jie4"],"word":"告诫"},{"definition":["to warn\/to urge\/to exhort\/to give instructions carefully and insistently"],"pinyin":["ding1 ning2"],"word":"叮咛"},{"definition":["before leaving\/on departure"],"pinyin":["lin2 zou3"],"word":"临走"},{"definition":["to remind\/to call attention to\/to warn of"],"pinyin":["ti2 xing3"],"word":"提醒"},{"definition":["variant of 交代[jiao1 dai4]"],"pinyin":["jiao1 dai4"],"word":"交待"},{"definition":["over and over again\/again and again"],"pinyin":["zai4 san1"],"word":"再三"},{"definition":["meaningful and heartfelt words (idiom); sincere and earnest wishes"],"pinyin":["yu3 zhong4 xin1 chang2"],"word":"语重心长"},{"definition":["to talk about often\/to reminisce about\/to keep repeating\/to keep harping on\/to discuss"],"pinyin":["nian4 dao5"],"word":"念叨"},{"definition":["to pass on\/to communicate\/to transmit"],"pinyin":["zhuan3 gao4"],"word":"转告"},{"definition":["to tell\/to instruct\/to command"],"pinyin":["fen1 fu4"],"word":"吩咐"},{"definition":["to advise\/to urge\/to try to persuade\/to exhort\/to console\/to soothe"],"pinyin":["quan4"],"word":"劝"},{"definition":["to urge"],"pinyin":["cui1 cu4"],"word":"催促"},{"definition":["to look after\/to attend to\/to have in care"],"pinyin":["zhao4 kan4"],"word":"照看"}]}