{"definition":["feasibility"],"pinyin":["ke3 xing2 xing4"],"traditional":["可行性"],"rank":9980.0,"normalized_rank":0.1396331481818309,"fraction":0.000008294594735921847,"cumulative_fraction":0.9295320871993198,"word":"可行性","characters":[{"definition":["see 可汗[ke4 han2]","can\/may\/able to\/to approve\/to permit\/to suit\/(particle used for emphasis) certainly\/very"],"pinyin":["ke4","ke3"],"word":"可"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[{"definition":["feasibility study"],"pinyin":["ke3 xing2 xing4 yan2 jiu1"],"word":"可行性研究"}],"sentences":[{"english":"The feasibility of applying fuzzy mathematics method to appraise manuscript quality is studied. How to apply Method No.","chinese":"探讨应用模糊数学方法评价论文稿质量的可行性。"},{"english":"The design problems of hatch cover and cantilever beam were solved to check the usefulness of the suggested method.","chinese":"舱口盖及悬梁的设计结果表明了该方法的可行性。"},{"english":"Conclusions It was proved feasibility of DNA fingerprints in the heredity monitoring of inbred strain rat.","chinese":"结论证实了该方法在近交系大鼠遗传监测中的可行性。"},{"english":"Therefore it is feasible to obtain the electronic administrative affairs of village in our country's new rural construction.","chinese":"由此得出电子村务在我国新农村建设中的可行性。"},{"english":"The practice makes sure voice electronic mail system model based on 4-tiered architecture is viable and effective.","chinese":"实践证实了该模型的可行性和有效性。"},{"english":"This paper discussed the practicability of bio-refinery the plant of Lycoris radiate.","chinese":"本论文探讨了对石蒜属植物的综合生物炼制可行性。"},{"english":"To explore the feasibility of ligating and embedding a pump in the iliac artery by laparoscopic.","chinese":"目的探讨腹腔镜髂内动脉结扎及置泵可行性。"},{"english":"The feasibility of ergosterol as an index to estimate grain safety degree was discussed in this thesis.","chinese":"探讨了麦角甾醇作为评价粮食质量安全指标的可行性。"},{"english":"The feasibility of up-draft gasifier which exhausts in its middle in fixed beds is verified.","chinese":"证明上吸式中间排气固定床气化炉的可行性。"},{"english":"The feasibility of the proposed method was verified by division of the southwest corridor in China.","chinese":"用大西南通道分割的实例验证了方法的可行性。"},{"english":"The software project manager creates and manages the software feasibility plan.","chinese":"软件项目经理建立并管理软件的可行性计划。"},{"english":"A classical method to determine the content of cinnamaldehyde is called hydrochloride hydroxylamine—pyridine oximation.","chinese":"探讨一种无吡啶盐酸羟胺肟化法测定肉桂醛的可行性。"},{"english":"It is feasible to use the theory of combining with disease and syndrome to treat aged malignant hematonosis.","chinese":"从病证结合角度治疗老年恶性血液病具有一定可行性。"},{"english":"The non-symmetrical AHP method is demonstrated with good feasibility.","chinese":"最后，举一个实例来验证这一方法的可行性。"},{"english":"The feasibility of the joint hot extrusion forming was put forth.","chinese":"提出了虎克式万向节热挤压成型的可行性。"},{"english":"The cases are analyzed in order to illustrate the feasibility of wastewater treatment with thermophilic bacteria.","chinese":"通过实例阐明了利用嗜热菌处理废水的可行性。"}],"related":[{"definition":["feasible"],"pinyin":["ke3 xing2"],"word":"可行"},{"definition":["necessity"],"pinyin":["bi4 yao4 xing4"],"word":"必要性"},{"definition":["to prove a point\/to expound on\/to demonstrate or prove (through argument)\/proof"],"pinyin":["lun4 zheng4"],"word":"论证"},{"definition":["to conceive\/concept"],"pinyin":["gou4 xiang3"],"word":"构想"},{"definition":["reason\/rationality\/rationale\/reasonableness"],"pinyin":["he2 li3 xing4"],"word":"合理性"},{"definition":["to consider\/to give serious consideration to sth\/consideration"],"pinyin":["kao3 liang2"],"word":"考量"},{"definition":["feasible"],"pinyin":["qie4 shi2 ke3 xing2"],"word":"切实可行"},{"definition":["countermeasure for dealing with a situation"],"pinyin":["dui4 ce4"],"word":"对策"},{"definition":["plan\/program (for action etc)\/proposal\/proposed bill\/CL:個|个[ge4],套[tao4]"],"pinyin":["fang1 an4"],"word":"方案"},{"definition":["conclusion\/verdict\/CL:個|个[ge4]\/to conclude\/to reach a verdict"],"pinyin":["jie2 lun4"],"word":"结论"},{"definition":["to put into practice\/to carry out (idiom)"],"pinyin":["fu4 zhu1 shi2 shi1"],"word":"付诸实施"},{"definition":["to imagine\/to assume\/to envisage\/tentative plan\/to have consideration for"],"pinyin":["she4 xiang3"],"word":"设想"},{"definition":["feasibility study"],"pinyin":["ke3 xing2 xing4 yan2 jiu1"],"word":"可行性研究"},{"definition":["to discuss\/to bring up various ideas for discussion"],"pinyin":["shang1 que4"],"word":"商榷"},{"definition":["pros and cons\/merits and drawbacks\/advantages and disadvantages"],"pinyin":["li4 bi4"],"word":"利弊"},{"definition":["legitimacy"],"pinyin":["he2 fa3 xing4"],"word":"合法性"}]}