{"definition":["Records of the Grand Historian, by 司馬遷|司马迁[Si1 ma3 Qian1], first of the 24 dynastic histories 二十四史[Er4 shi2 si4 Shi3]"],"pinyin":["Shi3 ji4"],"traditional":["史記"],"rank":23793.0,"normalized_rank":0.3328949393477257,"fraction":0.000001652612713703934,"cumulative_fraction":0.9823997239394904,"word":"史记","characters":[{"definition":["surname Shi","history\/annals\/title of an official historian in ancient China"],"pinyin":["Shi3","shi3"],"word":"史"},{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"记"}],"containing_words":[{"definition":["History of Three Kingdoms (Korean: Samguk Sagi), the oldest extant Korean history, compiled under Kim Busik 金富軾|金富轼[Jin1 Fu4 shi4] in 1145. The three kingdoms are Goguryeo 高句麗|高句丽[Gao1 gou1 li2], Baekje 百濟|百济[Bai3 ji4], Silla 新羅|新罗[Xin1 luo2]."],"pinyin":["San1 guo2 shi3 ji4"],"word":"三国史记"}],"sentences":[{"english":"Every pratfall loss brings them closer to history.","chinese":"每一次耻辱的失败都让他们离那个历史记录更近。"},{"english":"\"Notes taken in Rong Study\", comments on and studies of the …","chinese":"《容斋随笔》对《史记》人物的评论和研究。"},{"english":"History of humankind in the period before recorded history.","chinese":"历史记录史事的演变。"},{"english":"Sagi was born in North Tel Aviv.","chinese":"史记出生于北特拉维夫。"},{"english":"This specialized documentation is a combination of historical documentation and daily procedures.","chinese":"这个专门的文档是历史记录文档和每日过程的组合。"},{"english":"Shi Ji is a first general history of China by chronology.","chinese":"《史记》是中国第一部纪传体通史。"},{"english":"Sagi also owns two websites for online foreign currency transactions.","chinese":"史记还拥有两家网上外汇交易网站。"},{"english":"The local history isn't a version-control replacement.","chinese":"本地历史记录不能替代版本控制。"},{"english":"It handled a record number of disasters in 2010.","chinese":"2010年该局处理的灾难数目突破了历史记录。"},{"english":"This story appears in the Historical Records Written by Sima Qian.","chinese":"这个故事载自司马迁写的《史记》中。"},{"english":"Make sure that the Field History Sheet is filled in accurately and submitted together with this application form.","chinese":"确保田块历史记录填写正确并且和本申请表一并提交。"},{"english":"\"Notes taken in Rong Study\", comments on and studies of the characters in the Records.","chinese":"《容斋随笔》对《史记》人物的评论和研究。"},{"english":"Presence can be a status, history of activity, or location.","chinese":"存在可以是某种地位，历史记录，或所在位置。"},{"english":"The yellow stone old man return, the water is cool to still see stay the , the historical records your work is historic.","chinese":"黄石老人去不还，水凉犹见留侯影，史记大作炳千古。"},{"english":"An historical record of all IFSA Judges is retained and respected in the consideration of awards.","chinese":"保存好所参加过的国际比赛的历史记录和受奖情况。"},{"english":"The hammer price of the car broke the previous record.","chinese":"这款名车的拍卖成交价打破了此前的历史记录。"}],"related":[{"definition":["History of the Former Han Dynasty, second of the 24 dynastic histories 二十四史[Er4 shi2 si4 Shi3], composed by Ban Gu 班固[Ban1 Gu4] in 82 during Eastern Han (later Han), 100 scrolls"],"pinyin":["Han4 shu1"],"word":"汉书"},{"definition":["Sima Qian (145-86 BC), Han Dynasty historian, author of Records of the Grand Historian 史記|史记[Shi3 ji4], known as the father of Chinese historiography"],"pinyin":["Si1 ma3 Qian1"],"word":"司马迁"},{"definition":["\"Strategies of the Warring States\", chronicle of the Warring States Period (475-220 BC), possibly written by Su Qin 蘇秦|苏秦[Su1 Qin2]"],"pinyin":["Zhan4 guo2 ce4"],"word":"战国策"},{"definition":["Grand Scribe, the title by which Sima Qian 司馬遷|司马迁[Si1 ma3 Qian1] refers to himself in Records of the Historian 史記|史记[Shi3 ji4]"],"pinyin":["Tai4 shi3 gong1"],"word":"太史公"},{"definition":["A Mirror for the Wise Ruler (or Comprehensive Mirror for Aid in Government), a vast chronological general history, written by 司馬光|司马光[Si1 ma3 Guang1] Sima Guang (1019-1089) and collaborators during the Northern Song in 1084, covering the period 403 BC-959 AD, 294 scrolls"],"pinyin":["Zi1 zhi4 Tong1 jian4"],"word":"资治通鉴"},{"definition":["history book"],"pinyin":["shi3 shu1"],"word":"史书"},{"definition":["Bamboo Annals, early chronicle of Chinese ancient history, written c. 300 BC"],"pinyin":["Zhu2 shu1 Ji4 nian2"],"word":"竹书纪年"},{"definition":["History of Eastern Han (later Han), third of the 24 dynastic histories 二十四史[Er4 shi2 si4 Shi3], composed by Fan Ye 范曄|范晔[Fan4 Ye4] in 445 during Song of the Southern Dynasties 南朝宋[Nan2 chao2 Song4], 120 scrolls"],"pinyin":["Hou4 Han4 shu1"],"word":"后汉书"},{"definition":["twenty four dynastic histories (or 25 or 26 in modern editions)"],"pinyin":["er4 shi2 wu3 shi3"],"word":"二十五史"},{"definition":["Ban Gu (32-92), Eastern Han dynasty historian, wrote the Dynastic History of Western Han 漢書|汉书"],"pinyin":["Ban1 Gu4"],"word":"班固"},{"definition":["the Twenty-Four Histories (25 or 26 in modern editions), collection of books on Chinese dynastic history from 3000 BC till 17th century\/fig. a long and complicated story"],"pinyin":["Er4 shi2 si4 Shi3"],"word":"二十四史"},{"definition":["historical records"],"pinyin":["shi3 ji2"],"word":"史籍"},{"definition":["miscellany of writing from the Western Han (aka Former Han)"],"pinyin":["Huai2 nan2 zi5"],"word":"淮南子"},{"definition":["Zuo Zhuan or Tsochuan, Mr Zuo's Annals or Mr Zuo's commentary on 春秋[Chun1 qiu1], early history c. 400 BC attributed to famous blind historian Zuo Qiuming 左丘明[Zuo3 Qiu1 ming2]"],"pinyin":["Zuo3 Zhuan4"],"word":"左传"},{"definition":["Han Feizi, book of Legalist Philosophy authored by Han Fei 韓非|韩非[Han2 Fei1] during the Warring States Period (475-220 BC)"],"pinyin":["Han2 Fei1 zi3"],"word":"韩非子"},{"definition":["the 24 or 25 official dynastic histories\/true history, as opposed to fictional adaptation or popular legends"],"pinyin":["zheng4 shi3"],"word":"正史"}]}