{"definition":["lit. Lord Ye's passion for dragons (idiom)\/fig. to pretend to be fond of sth while actually fearing it\/ostensible fondness of sth one really fears"],"pinyin":["Ye4 Gong1 hao4 long2"],"traditional":["葉公好龍"],"rank":50350.0,"normalized_rank":0.7044618247450086,"fraction":1.3867874551883555e-7,"cumulative_fraction":0.9990094435587958,"word":"叶公好龙","characters":[{"definition":["leaf\/page\/lobe\/(historical) period\/classifier for small boats","surname Ye","to be in harmony"],"pinyin":["ye4","Ye4","xie2"],"word":"叶"},{"definition":["public\/collectively owned\/common\/international (e.g. high seas, metric system, calendar)\/make public\/fair\/just\/Duke, highest of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/honorable (gentlemen)\/father-in-law\/male (animal)"],"pinyin":["gong1"],"word":"公"},{"definition":["to be fond of\/to have a tendency to\/to be prone to","good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello"],"pinyin":["hao4","hao3"],"word":"好"},{"definition":["dragon\/CL:條|条[tiao2]\/imperial","surname Long"],"pinyin":["long2","Long2"],"word":"龙"}],"containing_words":[],"sentences":[{"english":"It's said that this Lord Ye was very fond of dragons.","chinese":"在一开篇，我想要说一个叶公好龙的故事。"}],"related":[{"definition":["to buy a wooden box and return the pearls inside\/to show poor judgment (idiom)"],"pinyin":["mai3 du2 huan2 zhu1"],"word":"买椟还珠"},{"definition":["lit. to see a bow reflected in a cup as a snake (idiom); fig. unnecessary suspicions\/overly fearful"],"pinyin":["bei1 gong1 she2 ying3"],"word":"杯弓蛇影"},{"definition":["to copy the way they walk in Handan (idiom)\/slavishly copying others, one risks becoming a caricature"],"pinyin":["Han2 dan1 xue2 bu4"],"word":"邯郸学步"},{"definition":["Chinese set expression, typically of 4 characters, often alluding to a story or historical quotation\/idiom\/proverb\/saying\/adage\/CL:條|条[tiao2],本[ben3],句[ju4]"],"pinyin":["cheng2 yu3"],"word":"成语"},{"definition":["lit. a notch on the side of a boat to locate a sword dropped overboard (idiom); fig. an action made pointless by changed circumstances"],"pinyin":["ke4 zhou1 qiu2 jian4"],"word":"刻舟求剑"},{"definition":["lit. a monkey wearing a hat (idiom)\/fig. worthless person in imposing attire"],"pinyin":["mu4 hou2 er2 guan4"],"word":"沐猴而冠"},{"definition":["lit. eyes obscured by a single leaf (idiom)\/fig. not seeing the wider picture\/can't see the wood for the trees"],"pinyin":["yi1 ye4 zhang4 mu4"],"word":"一叶障目"},{"definition":["to try to draw a tiger but end up with a likeness of a dog (idiom)\/to try to do sth overambitious and end up botching it"],"pinyin":["hua4 hu3 lei4 quan3"],"word":"画虎类犬"},{"definition":["lit. Dong Shi imitates Xi Shi's frown (idiom)\/fig. to mimick sb's idiosyncrasies but make a fool of oneself"],"pinyin":["Dong1 Shi1 xiao4 pin2"],"word":"东施效颦"},{"definition":["lit. to view the sky from the bottom of a well (idiom); ignorant and narrow-minded"],"pinyin":["zuo4 jing3 guan1 tian1"],"word":"坐井观天"},{"definition":["to parrot\/to repeat uncritically what sb says"],"pinyin":["ying1 wu3 xue2 she2"],"word":"鹦鹉学舌"},{"definition":["lit. climb a tree to catch a fish (idiom); fig. to attempt the impossible"],"pinyin":["yuan2 mu4 qiu2 yu2"],"word":"缘木求鱼"},{"definition":["making a deer out to be a horse (idiom); deliberate misrepresentation"],"pinyin":["zhi3 lu4 wei2 ma3"],"word":"指鹿为马"},{"definition":["lit. to allay one's hunger using a picture of a cake\/to feed on illusions (idiom)"],"pinyin":["hua4 bing3 chong1 ji1"],"word":"画饼充饥"},{"definition":["to make far-fetched claims (idiom)\/to offer outlandish explanations"],"pinyin":["chuan1 zao2 fu4 hui4"],"word":"穿凿附会"},{"definition":["crowing like a cock and stealing like a dog (idiom)\/bag of tricks\/useful talents"],"pinyin":["ji1 ming2 gou3 dao4"],"word":"鸡鸣狗盗"}]}