{"definition":["to entail strenuous effort\/to toil at a task\/strenuous\/laborious\/strain"],"pinyin":["chi1 li4"],"traditional":["吃力"],"rank":13991.0,"normalized_rank":0.1957522421054104,"fraction":0.0000046652989768804905,"cumulative_fraction":0.9545968587022192,"word":"吃力","characters":[{"definition":["variant of 吃[chi1]","to eat\/to consume\/to eat at (a cafeteria etc)\/to eradicate\/to destroy\/to absorb\/to suffer\/to stammer (Taiwan pr. for this sense is [ji2])"],"pinyin":["chi1","chi1"],"word":"吃"},{"definition":["surname Li","power\/force\/strength\/ability\/strenuously"],"pinyin":["Li4","li4"],"word":"力"}],"containing_words":[{"definition":["arduous and thankless task (idiom); strenuous and unrewarding"],"pinyin":["chi1 li4 bu4 tao3 hao3"],"word":"吃力不讨好"}],"sentences":[{"english":"The poor old man plods along, hardly able to lift each food.","chinese":"这可怜白勺白叟吃力地走着，几乎都抬不动脚了。"},{"english":"The soldiers laboured their way in the storm.","chinese":"士兵们在暴风雨中吃力地前进。"},{"english":"May be hard to pull off in some hilly cities.","chinese":"在平原城市还好，在丘陵城市就有点吃力了。"},{"english":"Eg. I'm browned off with working so hard for so little money.","chinese":"工作这么吃力，钱又这么少，够她受的。"},{"english":"With heavy knapsacks on their backs, the explorers plodded on their way up the snow-covered mountains.","chinese":"探险家们身背沉重的背包，吃力地，一步步地爬上。"},{"english":"Now, Bill came in sight plodding up the hill.","chinese":"就在这时，比尔出现了，他正吃力地从山下爬上来。"},{"english":"The old car was labouring along the muddy road.","chinese":"那辆旧车在泥泞的路上吃力地朝前开着。"},{"english":"She struggled for breath, to be calm.","chinese":"她吃力地呼吸着，强作镇定。"},{"english":"Susch parts are often considered to be thankless, unrewarding.","chinese":"这种角色通常被变为是吃力不讨好的。"},{"english":"The tank laboriously crawled on with a huddle of soldiers hanging behind.","chinese":"坦克吃力地爬行着，一堆士兵缩在后面跟着走。"},{"english":"They jumped (over) the ditch without much difficulty.","chinese":"他们不太吃力地就跳过了那道沟。"},{"english":"Kelly: Did you hear the somersault marathon? It is truly straining.","chinese":"你听说过翻跟头马拉松吗？那才叫吃力呢。"},{"english":"He trudged the deserted road for hours.","chinese":"他沿著荒芜的道路吃力地走了几个小时。"},{"english":"Finally, it all came to a halt, with only Leehom's laboured breathing punctuating the silence.","chinese":"最后，一切静止，只剩力宏吃力的呼吸，打破寂静。"},{"english":"For the homemaker water hardness makes home cleaning operations more difficult.","chinese":"硬水让主妇的家居日常清洁工作更加吃力。"},{"english":"In addition, the son has struggled to write legibly.","chinese":"另外，她儿子对于简单明了的写字显得很吃力。"}],"related":[{"definition":["to expend a great deal of effort"],"pinyin":["fei4 li4"],"word":"费力"},{"definition":["to require effort\/strenuous"],"pinyin":["fei4 jin4"],"word":"费劲"},{"definition":["less capable than desirable (idiom); not as strong as one would wish\/the spirit is willing but the flesh is weak"],"pinyin":["li4 bu4 cong2 xin1"],"word":"力不从心"},{"definition":["erhua variant of 費勁|费劲[fei4 jin4]"],"pinyin":["fei4 jin4 'r"],"word":"费劲儿"},{"definition":["to be unable to tolerate or endure\/to find sth difficult to manage"],"pinyin":["chi1 bu5 xiao1"],"word":"吃不消"},{"definition":["to act with confusion\/to be in a flurry\/to be flustered"],"pinyin":["shou3 mang2 jiao3 luan4"],"word":"手忙脚乱"},{"definition":["unripe\/tart\/not fully proficient\/somewhat shaky"],"pinyin":["sheng1 se4"],"word":"生涩"},{"definition":["to do with difficulty\/to force sb to do sth\/reluctant\/barely enough"],"pinyin":["mian3 qiang3"],"word":"勉强"},{"definition":["the will is there, but not the strength (idiom)\/the spirit is willing but the flesh is weak"],"pinyin":["xin1 you3 yu2 er2 li4 bu4 zu2"],"word":"心有余而力不足"},{"definition":["tired\/weary\/to strain\/to wear out\/to work hard","to accumulate\/to involve or implicate (Taiwan pr. [lei4])\/continuous\/repeated","rope\/to bind together\/to twist around","surname Lei"],"pinyin":["lei4","lei3","lei2","Lei2"],"word":"累"},{"definition":["body weary, strength exhausted (idiom); extremely tired\/spent"],"pinyin":["jin1 pi2 li4 jin4"],"word":"筋疲力尽"},{"definition":["heavy\/cumbersome\/unwieldy"],"pinyin":["ben4 zhong4"],"word":"笨重"},{"definition":["slow\/sluggish"],"pinyin":["chi2 huan3"],"word":"迟缓"},{"definition":["awkward\/difficult\/uncomfortable\/not agreeing\/at loggerheads\/gauche"],"pinyin":["bie4 niu5"],"word":"别扭"},{"definition":["clumsy\/awkward\/stupid"],"pinyin":["ben4 zhuo1"],"word":"笨拙"},{"definition":["reliable\/secure\/stable\/firm"],"pinyin":["wen3 dang5"],"word":"稳当"}]}