{"definition":["to cost one dearly\/to end disastrously\/to pay bitterly"],"pinyin":["chi1 da4 kui1"],"traditional":["吃大虧"],"rank":41753.0,"normalized_rank":0.5841786408853693,"fraction":3.24946197394661e-7,"cumulative_fraction":0.9971091631596759,"word":"吃大亏","characters":[{"definition":["variant of 吃[chi1]","to eat\/to consume\/to eat at (a cafeteria etc)\/to eradicate\/to destroy\/to absorb\/to suffer\/to stammer (Taiwan pr. for this sense is [ji2])"],"pinyin":["chi1","chi1"],"word":"吃"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["deficiency\/deficit\/luckily\/it's lucky that...\/(often ironically) fancy that..."],"pinyin":["kui1"],"word":"亏"}],"containing_words":[],"sentences":[{"english":"I must point out that further delay would be unwise.","chinese":"我必须指明再延误就要吃大亏了。"},{"english":"Passwords are an essential part of life online and if we are not careful about keeping them secret, they can cause big problems.","chinese":"网络离不开密码，密码保存不注意，很可能吃大亏。"},{"english":"He thought we would be taken in, but on the contrary, it was he who got shorn.","chinese":"他本以为我们会上当，可是吃大亏的反而是他。"},{"english":"And if we're not careful about keeping them secret, they can cause big problems.","chinese":"密码保存不注意，很可能吃大亏。"},{"english":"Every little helps a mickle.","chinese":"贪小便宜吃大亏。"},{"english":"They are now bitterly paying for their lack of vision.","chinese":"由于缺乏远见，他们正在吃大亏。"},{"english":"Don't act up or you will be spoiled some day.","chinese":"不要卖弄，否则有一天你会吃大亏。"},{"english":"I must point out that further delay will be unwise.","chinese":"我必须指明再延误就要吃大亏了。"},{"english":"Mechanical copying of anything foreign would be disastrous.","chinese":"机械地照搬外国的东西要吃大亏的。"}],"related":[{"definition":["to suffer losses\/to come to grief\/to lose out\/to get the worst of it\/to be at a disadvantage\/unfortunately"],"pinyin":["chi1 kui1"],"word":"吃亏"},{"definition":["to suffer\/to suffer for one's actions\/to pay dearly\/to burn one's fingers"],"pinyin":["chi1 ku3 tou5"],"word":"吃苦头"},{"definition":["to meet with unexpected failure (idiom)\/to fail miserably (where failure was not expected)"],"pinyin":["yin1 gou1 li3 fan1 chuan2"],"word":"阴沟里翻船"},{"definition":["to fall head over heels\/(fig.) to come a cropper"],"pinyin":["zai1 gen1 tou5"],"word":"栽跟头"},{"definition":["to be taken advantage of"],"pinyin":["chi1 kui1 shang4 dang4"],"word":"吃亏上当"},{"definition":["it will cause no end of trouble (idiom)"],"pinyin":["hou4 huan4 wu2 qiong2"],"word":"后患无穷"},{"definition":["taken in (by sb's deceit)\/to be fooled\/to be duped"],"pinyin":["shang4 dang4"],"word":"上当"},{"definition":["advantageous\/favorable\/to benefit at others' expense\/to take unfair advantage"],"pinyin":["zhan4 pian2 yi5"],"word":"占便宜"},{"definition":["the gains do not make up for the losses (idiom)"],"pinyin":["de2 bu4 chang2 shi1"],"word":"得不偿失"},{"definition":["to save a little only to lose a lot (idiom)"],"pinyin":["yin1 xiao3 shi1 da4"],"word":"因小失大"},{"definition":["lit. if you can't eat it all, you'll have to take it home (idiom)\/fig. you'll have to take the consequences"],"pinyin":["chi1 bu5 liao3 dou1 zhe5 zou3"],"word":"吃不了兜着走"},{"definition":["failed and wiped over the floor (idiom); to fail utterly\/a crushing defeat\/beaten and in a hopeless position"],"pinyin":["yi1 bai4 tu2 di4"],"word":"一败涂地"},{"definition":["having given away a bride, to lose one's army on top of it (idiom)\/to suffer a double loss after trying to trick the enemy"],"pinyin":["pei2 le5 fu1 ren2 you4 zhe2 bing1"],"word":"赔了夫人又折兵"},{"definition":["lit. to try to steal a chicken only to end up losing the rice used to lure it (idiom)\/fig. to try to gain an advantage only to end up worse off\/to go for wool and come back shorn"],"pinyin":["tou1 ji1 bu4 cheng2 shi2 ba3 mi3"],"word":"偷鸡不成蚀把米"},{"definition":["think three times then go (idiom); don't act before you've thought it through carefully"],"pinyin":["san1 si1 er2 xing2"],"word":"三思而行"},{"definition":["to underestimate the enemy"],"pinyin":["qing1 di2"],"word":"轻敌"}]}