{"definition":["to close (flower, eyes, suitcase etc)\/to bring together\/(insect or bird when not flying) to fold (its wings)"],"pinyin":["he2 long3"],"traditional":["合攏"],"rank":34817.0,"normalized_rank":0.4871350020287381,"fraction":6.151497195961821e-7,"cumulative_fraction":0.9939371391052696,"word":"合拢","characters":[{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]","variant of 合[he2]"],"pinyin":["ge3","he2","he2"],"word":"合"},{"definition":["to gather together\/to collect\/to approach\/to draw near to\/to add\/to sum up\/to comb (hair)"],"pinyin":["long3"],"word":"拢"}],"containing_words":[],"sentences":[{"english":"Butterfly class at rest their wings folded up in back is.","chinese":"蝶类在休息时它们的翅是合拢起来立于背上。"},{"english":"Spiritless is the mouth which very difficult to close up.","chinese":"懦弱是一条很难合拢的口。"},{"english":"Said tubular or pipe-shaped material is wrapped onto an axis.","chinese":"上述筒状或管状材料合拢成层状收卷在一个轴上。"},{"english":"The next morning, with the sound of firecrackers, the dock gate closure ceremony was held.","chinese":"次日上午，在炮竹声中，坞门合拢仪式正式举行。"},{"english":"Press the Foot Switch to close the head and perform the swage.","chinese":"踩脚踏板合拢扣压机头，完成扣压。"},{"english":"The barrage closure works of Qingtongxia Key Water Control Project on Yellow River in China.","chinese":"中国青铜峡黄河水利枢纽工程拦河坝合拢截流。"},{"english":"After closure, final tensioning of stay 4 is accomplished .","chinese":"合拢以后，拉索4的最终张力即告完成。"},{"english":"The closure of steel sheet piles is the key to the construction of steel sheet pile cut-off walls.","chinese":"钢板桩合拢是钢板桩防渗墙施工的关键。"},{"english":"Ruihong Bridge Closure successful, Yugan to add new impetus to the development.","chinese":"瑞洪大桥合拢成功，给余干增添了新的发展动力。"},{"english":"Begin to slide your hands up your spine, bringing palms together to touch in a prayer position.","chinese":"在脊椎部缓慢张开双手，使手面合拢，做祈祷状。"},{"english":"Thus, a formed net cover can cover and fold up to trap the mosquito like a clamp.","chinese":"这样形成的网罩能罩住并如夹子般合拢夹死蚊子。"},{"english":"He snatched the pistol back, jealously; shut the knife, and returned it to its concealment.","chinese":"他猜忌地把手枪夺回去，合拢刀子，又把它藏回原处。"},{"english":"He closed his eyes and leaned back in his chair.","chinese":"他合拢双眼，后靠在椅子里。"},{"english":"Her fingers clutched the clothes, and gathered them over her eyes.","chinese":"她的手指紧揪住衣服，又把衣服合拢来遮住眼睛。"},{"english":"The clouds have reconvened by now, and it is raining hard.","chinese":"这时，乌云重新合拢了，雨下得很大。"}],"related":[{"definition":["to open up\/to spread\/to extend"],"pinyin":["zhang1 kai1"],"word":"张开"},{"definition":["to stretch out"],"pinyin":["shen1 kai1"],"word":"伸开"},{"definition":["to close (box, book, mouth etc)"],"pinyin":["he2 shang4"],"word":"合上"},{"definition":["to resist\/to press against\/to brace"],"pinyin":["di3 zhu4"],"word":"抵住"},{"definition":["to close by coming together (like the lips of a wound, the doors of an elevator, the walls of a channel)\/to close by connecting in a loop (like a circuit)\/closed-loop"],"pinyin":["bi4 he2"],"word":"闭合"},{"definition":["to split open"],"pinyin":["lie4 kai1"],"word":"裂开"},{"definition":["to draw together\/to place side by side (e.g. one's fingers, two halves of a torn sheet of paper etc)"],"pinyin":["bing4 long3"],"word":"并拢"},{"definition":["the five fingers of one's hand"],"pinyin":["wu3 zhi3"],"word":"五指"},{"definition":["arms\/both arms\/two arms"],"pinyin":["shuang1 bi4"],"word":"双臂"},{"definition":["semicircle"],"pinyin":["ban4 yuan2"],"word":"半圆"},{"definition":["to separate\/to disperse"],"pinyin":["san4 kai1"],"word":"散开"},{"definition":["facing forwards"],"pinyin":["chao2 qian2"],"word":"朝前"},{"definition":["to detain\/to hold back by force\/to buckle\/to hook"],"pinyin":["kou4 zhu4"],"word":"扣住"},{"definition":["to lift up"],"pinyin":["tai2 qi3"],"word":"抬起"},{"definition":["to split\/to cut open"],"pinyin":["po4 kai1"],"word":"破开"},{"definition":["to draw to oneself\/to gather up\/to collect\/to fold up (an umbrella, wings etc)\/to assemble (a party of persons)\/to rope in (some people)"],"pinyin":["shou1 long3"],"word":"收拢"}]}