{"definition":["in time with (i.e. same rhythm)\/to keep in step with\/fig. to cooperate"],"pinyin":["he2 pai1"],"traditional":["合拍"],"rank":17521.0,"normalized_rank":0.24514152197333255,"fraction":0.0000030953095999804093,"cumulative_fraction":0.9680797601806751,"word":"合拍","characters":[{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]","variant of 合[he2]"],"pinyin":["ge3","he2","he2"],"word":"合"},{"definition":["to pat\/to clap\/to slap\/to swat\/to take (a photo)\/to shoot (a film)\/racket (sports)\/beat (music)"],"pinyin":["pai1"],"word":"拍"}],"containing_words":[],"sentences":[{"english":"Listed with rich color and fashion color trend just beat.","chinese":"上市颜色丰富多彩与流行色潮流正好合拍。"},{"english":"Babies and the chancy life of a musician do not exactly go together.","chinese":"生儿育女和乐师动荡不定的生活是不合拍的。"},{"english":"Being in tune with her.","chinese":"与她合拍有默契。"},{"english":"The past co-productions are mostly Hongkong investment company, issued in the mainland.","chinese":"过去合拍片大部分都是香港公司投资，在内地发行。"},{"english":"You are quite likely to agree on most subjects.","chinese":"你们在大多数问题上非常合拍。"},{"english":"Cartoons co-produced by domestic and foreign producers will have to get approval first.","chinese":"中外合拍动画片在这一时段播出，需报广电总局批准。"},{"english":"I always say co-productions can be out living space.","chinese":"我一直说合拍片可以算是港片生存的空间。"},{"english":"To welcome the steamer, a long line of honor guards marched all in step.","chinese":"为了欢迎轮船的到来，一支仪仗队步调合拍的行进着。"},{"english":"He was ­intuitive and especially attuned to the love of his life.","chinese":"他这人是直觉的，特别为了与生命中的爱人合拍时。"},{"english":"The concept of kindness should resonate with your spiritual beliefs.","chinese":"善意的概念与你的精神信仰应该是合拍的。"}],"related":[{"definition":["to be well matched\/to suit"],"pinyin":["ban1 pei4"],"word":"般配"},{"definition":["to be kindred spirits\/to hit it off"],"pinyin":["tou2 yuan2"],"word":"投缘"},{"definition":["to have an affinity with each other (idiom)\/to find each other congenial"],"pinyin":["qing2 tou2 yi4 he2"],"word":"情投意合"},{"definition":["agreement\/to agree\/to get on with\/congenial\/agreeing with\/to ally oneself with sb"],"pinyin":["qi4 he2"],"word":"契合"},{"definition":["agreeing with one another\/congenial"],"pinyin":["xiang1 tou2"],"word":"相投"},{"definition":["lit. to be together from the first beat (idiom)\/to hit it off\/to click together\/to chime in easily"],"pinyin":["yi1 pai1 ji2 he2"],"word":"一拍即合"},{"definition":["to cooperate\/to collaborate\/to work together\/cooperation\/CL:個|个[ge4]"],"pinyin":["he2 zuo4"],"word":"合作"},{"definition":["to love each other"],"pinyin":["xiang1 ai4"],"word":"相爱"},{"definition":["talented man and beautiful woman\/ideal couple"],"pinyin":["nan2 cai2 nu:3 mao4"],"word":"男才女貌"},{"definition":["tacit understanding\/mutual understanding\/rapport\/connected at a deep level with each other\/(of team members) well coordinated\/tight"],"pinyin":["mo4 qi4"],"word":"默契"},{"definition":["romance film"],"pinyin":["ai4 qing2 pian4"],"word":"爱情片"},{"definition":["sweethearts\/lovers"],"pinyin":["qing2 lu:3"],"word":"情侣"},{"definition":["to associate (with)\/to have contact (with)\/to hang out (with)\/to date\/(interpersonal) relationship\/association\/contact"],"pinyin":["jiao1 wang3"],"word":"交往"},{"definition":["to be in contact (with sb)\/to associate\/to interact\/to get along (well, poorly)"],"pinyin":["xiang1 chu3"],"word":"相处"},{"definition":["(of a movie, show etc) to attract large audiences"],"pinyin":["mai4 zuo4"],"word":"卖座"},{"definition":["unwell\/indisposed\/out of sorts\/euphemism or honorific for ill"],"pinyin":["wei2 he2"],"word":"违和"}]}