{"definition":["to discuss together\/to try to reach a common judgment\/panel discussion"],"pinyin":["he2 yi4"],"traditional":["合議"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"合议","characters":[{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]","variant of 合[he2]"],"pinyin":["ge3","he2","he2"],"word":"合"},{"definition":["to comment on\/to discuss\/to suggest"],"pinyin":["yi4"],"word":"议"}],"containing_words":[{"definition":["(law) collegiate bench\/panel of judges"],"pinyin":["he2 yi4 ting2"],"word":"合议庭"}],"sentences":[{"english":"The members of a collegial panel shall be odd in number.","chinese":"合议庭的成员人数应当是单数。"},{"english":"The deliberations shall be recorded in writing, and the transcript shall be signed by the members of the collegial panel.","chinese":"评议应当制作笔录，由合议庭成员签名。"},{"english":"Article 26 The collegial system shall be applied in the trial of compensation cases.","chinese":"第二十六条审理赔偿案件实行合议制。"},{"english":"The people's court shall form a new collegial panel for the purpose of the retrial.","chinese":"人民法院审理再审案件，应当另行组成合议庭。"},{"english":"The penalization of cases should respect the opinions of the entire court.","chinese":"案件的判罚要尊重合议庭的意见。"},{"english":"The parties concerned in the case shall be notified the change of collegiate members.","chinese":"合议庭成员的更换情况应当及时通知诉讼当事人。"},{"english":"And second, in support of the first, relationships between teachers and students are very collegial .","chinese":"第二，支持首之间的关系，教师和学生都是非常合议。"},{"english":"No man of the party against which an application is filed may become a collegiate member.","chinese":"被申请人所属人员不得担任合议人员。"},{"english":"In civil cases of second instance in the people's court, justice is administered by a collegiate bench made up of judges.","chinese":"人民法院审理第二审民事案件，由审判员组成合议庭。"},{"english":"The number of members of a collegial panel shall be an odd number of three or more.","chinese":"合议庭的成员，应当是三人以上的单数。"},{"english":"The judge states collegiate bench closes this case adjudicates choose an auspicious day after discussing.","chinese":"法官表示合议庭合议后将择日宣判此案。"},{"english":"The judge states collegiate bench closes this case adjudicates choose an auspicious day after discussing.","chinese":"法官表示合议庭合议后将择日宣判此案。"},{"english":"The collegiate bench investigates to Zhang the relative, knew that Zhang the father spirit is not normal.","chinese":"合议庭又向张某亲属调查，得知张某之父精神不正常。"}],"related":[{"definition":["(law) collegiate bench\/panel of judges"],"pinyin":["he2 yi4 ting2"],"word":"合议庭"},{"definition":["to hear (a case)"],"pinyin":["shen3 li3"],"word":"审理"},{"definition":["to appraise through discussion"],"pinyin":["ping2 yi4"],"word":"评议"},{"definition":["to attend court\/to take part in a trial"],"pinyin":["ting1 shen3"],"word":"听审"},{"definition":["to hear a case again\/review\/retrial"],"pinyin":["zai4 shen3"],"word":"再审"},{"definition":["to commit sb for trial\/to bring sb for interrogation"],"pinyin":["ti2 shen3"],"word":"提审"},{"definition":["jury"],"pinyin":["pei2 shen3 tuan2"],"word":"陪审团"},{"definition":["to reach an agreement\/to agree upon"],"pinyin":["yi4 ding4"],"word":"议定"},{"definition":["public trial (in a court of law)"],"pinyin":["gong1 shen3"],"word":"公审"},{"definition":["to re-investigate\/to investigate and reconsider a judgment"],"pinyin":["chong2 shen3"],"word":"重审"},{"definition":["to reject\/to turn down\/to overrule"],"pinyin":["bo2 hui2"],"word":"驳回"},{"definition":["joint hearing\/to review jointly (i.e. with other checkers)"],"pinyin":["hui4 shen3"],"word":"会审"},{"definition":["examination of the evidence of the opposing party in a court of law"],"pinyin":["zhi4 zheng4"],"word":"质证"},{"definition":["public decision (by ballot)\/majority decision\/a joint decision\/referendum"],"pinyin":["gong1 jue2"],"word":"公决"},{"definition":["to reach a verdict\/to conclude a judgment"],"pinyin":["ding4 an4"],"word":"定案"},{"definition":["to negotiate\/discussion\/proposal"],"pinyin":["shang1 yi4"],"word":"商议"}]}