{"definition":["to die in such a way that sb (or sth) else also perishes\/to take sb down with oneself\/to end in mutual destruction"],"pinyin":["tong2 gui1 yu2 jin4"],"traditional":["同歸於盡"],"rank":38213.0,"normalized_rank":0.534649448043317,"fraction":4.554501958092284e-7,"cumulative_fraction":0.9957408131166908,"word":"同归于尽","characters":[{"definition":["like\/same\/similar\/together\/alike\/with","(used in given names)\/variant of 同[tong2]","see 衚衕|胡同[hu2 tong4]"],"pinyin":["tong2","tong2","tong4"],"word":"同"},{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"归"},{"definition":["surname Yu","to go\/to take\/sentence-final interrogative particle\/variant of 於|于[yu2]","in\/at\/to\/from\/by\/than\/out of"],"pinyin":["Yu2","yu2","yu2"],"word":"于"},{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely","to the greatest extent\/(when used before a noun of location) furthest or extreme\/to be within the limits of\/to give priority to"],"pinyin":["jin4","jin3"],"word":"尽"}],"containing_words":[],"sentences":[{"english":"We are moving to replace mutually assured destruction with mutual cooperation.","chinese":"我们正在采取行动，以共同合作代替同归于尽。"},{"english":"This well where drank so many of the dead was destined to die itself.","chinese":"这口被许多死人喝过水的井也该同归于尽。"},{"english":"Finally, in order to protect her Wolf sun, end up with golden eagles.","chinese":"最后，她为了保护自己的狼孙，与金雕同归于尽了。"},{"english":"Buha by the go, just want to die and come to a boar's.","chinese":"布哈依这次去，就是想和公猪来个同归于尽的。"},{"english":"Third, they would attack their adversaries, smear them and threaten to drag them down with them.","chinese":"第三步则是反咬对手，抹黑大家，威胁一起同归于尽。"},{"english":"Tarkin never returned, having died in the explosion that consumed the Death Star.","chinese":"塔金再也没有回来，他和死星在爆炸中同归于尽。"}],"related":[{"definition":["to burn both jade and common stone\/to destroy indiscriminately (idiom)"],"pinyin":["yu4 shi2 ju4 fen2"],"word":"玉石俱焚"},{"definition":["lit. either the fish dies or the net splits\/a life and death struggle (idiom)"],"pinyin":["yu2 si3 wang3 po4"],"word":"鱼死网破"},{"definition":["both sides suffer (idiom)\/neither side wins"],"pinyin":["liang3 bai4 ju4 shang1"],"word":"两败俱伤"},{"definition":["to fight to one's last gasp"],"pinyin":["bu4 si3 bu4 xiu1"],"word":"不死不休"},{"definition":["to go all out for sth at risk of one's life"],"pinyin":["pin1 si3"],"word":"拼死"},{"definition":["fight to the death\/desperate struggle"],"pinyin":["si3 zhan4"],"word":"死战"},{"definition":["to brave it out\/to the bitter end"],"pinyin":["pin1 dao4 di3"],"word":"拼到底"},{"definition":["to explode\/spontaneous detonation\/self-detonation\/suicide bombing\/to disclose private matters about oneself"],"pinyin":["zi4 bao4"],"word":"自爆"},{"definition":["to fight with all one has"],"pinyin":["bo2 ming4"],"word":"搏命"},{"definition":["to meet force with force\/painstaking"],"pinyin":["ying4 peng4 ying4"],"word":"硬碰硬"},{"definition":["lit. you die, I live (idiom); irreconcilable adversaries\/two parties cannot coexist"],"pinyin":["ni3 si3 wo3 huo2"],"word":"你死我活"},{"definition":["to wait helplessly for death (idiom)\/to resign oneself to extinction"],"pinyin":["shu4 shou3 dai4 bi4"],"word":"束手待毙"},{"definition":["to mount a sneak attack\/to raid"],"pinyin":["tou1 xi2"],"word":"偷袭"},{"definition":["the two cannot exist together (idiom); irreconcilable differences\/incompatible standpoints"],"pinyin":["shi4 bu4 liang3 li4"],"word":"势不两立"},{"definition":["to kill to the last one (idiom)\/to exterminate\/to eradicate\/ruthless"],"pinyin":["gan3 jin4 sha1 jue2"],"word":"赶尽杀绝"},{"definition":["to place sb on field of death\/to confront with mortal danger\/to give sb no way out\/with one's back to the wall\/looking death in the eye\/part of idiom 置之死地而後生|置之死地而后生"],"pinyin":["zhi4 zhi1 si3 di4"],"word":"置之死地"}]}