{"definition":["the latter"],"pinyin":["hou4 zhe3"],"traditional":["後者"],"rank":3239.0,"normalized_rank":0.0453178123207365,"fraction":0.00004400349584126083,"cumulative_fraction":0.8016828637449029,"word":"后者","characters":[{"definition":["empress\/queen\/(archaic) monarch\/ruler","back\/behind\/rear\/afterwards\/after\/later\/post-","surname Hou"],"pinyin":["hou4","hou4","Hou4"],"word":"后"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"The latter release turned out to be the most popular among filesharers.","chinese":"而后者就是在文件共享者中传播的最广泛的一个版本。"},{"english":"Clearly this was a profitable happenstance for both the owners and the king.","chinese":"显然后者对于农场主和国王来说都是收益颇丰的惊喜。"},{"english":"It needs land, so absorbing Chaohu will benefit Hefei.","chinese":"因此，将巢湖的土地并入合肥对后者的发展有利。"},{"english":"The latter will move back, watching to the Englishman.","chinese":"后者将回迁，看向英国人。"},{"english":"On the contrary, the latter expresses sex by way of love.","chinese":"后者通过情来表达性，其状态反之。"},{"english":"Dealing with the latter can be anguishing and taxing.","chinese":"与后者打交道会让人心力交瘁，痛苦不堪。"},{"english":"In overall consideration, we prefer the later with cost-efficiency.","chinese":"综合考虑，大家选择了更经济的后者。"},{"english":"They keep horses and cattle, the former for riding, the latter for food.","chinese":"他们养着马和牛，前者供乘骑，后者供食用。"},{"english":"Root is diarch, the diameter lesser than A. obliterata.","chinese":"根为二原型，直径比后者略小些。"},{"english":"As for me, I agree with the latter opinion.","chinese":"就我看采，我同意后者的意见。"},{"english":"We chose the latter for demonstration purposes for the article.","chinese":"基于本文的演示目的，我们选择了后者。"},{"english":"I like the latter approach for creating VOB containers that store similar types of artifacts.","chinese":"我倾向于后者来建立存储相似类型工件的VOB容器。"},{"english":"He picked out Wazza, and he stretched his leg out and managed to guide it past the keeper.","chinese":"他将球挑给鲁尼，后者伸长了腿，让球越过了门将。"},{"english":"Of pigs and cows, the latter (=the cows) are more valuable.","chinese":"猪牛两种动物中，后者较有价值。"},{"english":"The latter is defined as processes which are sleeping at a non- interruptible level.","chinese":"后者的定义是处于非可中断级别睡眠状态的进程。"},{"english":"The latter one formed as sulfides and gossan.","chinese":"后者系岩体与地层接触，形成硫化物或铁帽。"}],"related":[{"definition":["the former"],"pinyin":["qian2 zhe3"],"word":"前者"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"则"},{"definition":["clear\/evident\/obvious(ly)"],"pinyin":["xian3 ran2"],"word":"显然"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["same\/equal\/equivalent"],"pinyin":["tong2 yang4"],"word":"同样"},{"definition":["both sides"],"pinyin":["liang3 zhe3"],"word":"两者"},{"definition":["to turn to (sth else)\/to switch to"],"pinyin":["zhuan3 er2"],"word":"转而"},{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["in fact\/in reality\/as a matter of fact\/in practice"],"pinyin":["shi2 ji4 shang4"],"word":"实际上"},{"definition":["certainty\/without a doubt"],"pinyin":["hao2 wu2 yi2 wen4"],"word":"毫无疑问"},{"definition":["in fact\/in reality\/actually\/as a matter of fact\/de facto\/ipso facto"],"pinyin":["shi4 shi2 shang4"],"word":"事实上"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["at the same time\/meanwhile"],"pinyin":["yu3 ci3 tong2 shi2"],"word":"与此同时"},{"definition":["additional\/in addition\/besides\/separate\/other\/moreover\/furthermore"],"pinyin":["ling4 wai4"],"word":"另外"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不过"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"}]}