{"definition":["down\/downward"],"pinyin":["xiang4 xia4"],"traditional":["向下"],"rank":6806.0,"normalized_rank":0.09522477019294001,"fraction":0.00001534983941978589,"cumulative_fraction":0.8935973876087969,"word":"向下","characters":[{"definition":["surname Xiang","towards\/to face\/to turn towards\/direction\/to support\/to side with\/shortly before\/formerly\/always\/all along\/(suffix) suitable for ...\/oriented to ...","to tend toward\/to guide\/variant of 向[xiang4]","variant of 向[xiang4]\/direction\/orientation\/to face\/to turn toward\/to\/towards\/shortly before\/formerly"],"pinyin":["Xiang4","xiang4","xiang4","xiang4"],"word":"向"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[{"definition":["top-down"],"pinyin":["zi4 ding3 xiang4 xia4"],"word":"自顶向下"}],"sentences":[{"english":"Scroll down to read about the latest update, or just click here.","chinese":"滚动鼠标向下，阅读最新的更新，或者点击这里。"},{"english":"When I looked down the hall I saw what looked like a transparent hunchback limping toward us.","chinese":"我向下看，看到一个驼背的跛子向我们走来。"},{"english":"A grading and styling design of garment pattern pieces is described in a top-down way.","chinese":"介绍服装样片分类和款式的自顶向下设计方法。"},{"english":"Fill it with White andnudgeit down another 1px then press Delete.","chinese":"用白色填充再向下轻移1px然后删除。"},{"english":"Lie face down on the floor with your elbows bent and your palms next to your shoulders.","chinese":"脸朝地板向下，肘关节弯曲，手心靠近肩膀。"},{"english":"The top-down management support should not be confused with the rollout approach.","chinese":"自顶向下的管理支持不应该与铺展过程相混淆。"},{"english":"You could also embed the sideway approach within the top-down or bottom-up approach.","chinese":"您也可以在自顶向下或自底向上方法中嵌入旁路方法。"},{"english":"The rubble was moving. It was pressing down, slowly crushing them.","chinese":"瓦砾还在不断地向下滚动，碾压着他们的身体。"},{"english":"Thus, ice floats on water and a body of water freezes from the top down.","chinese":"因此，冰浮在水上，水体从上向下冻结。"},{"english":"Slides easily up the rope and jams when the cam is loaded.","chinese":"防坠器向上滑动自如，而向下受重时凸轮会制停。"},{"english":"Normal breathing is accomplished by contracting the dome-shaped diaphragm downward into a flat shape.","chinese":"顶状的横隔膜向下压缩成水平状来完成的。"},{"english":"Front fold-down panel can be secured in different positions for temperature control.","chinese":"前折向下面板很安全，各个不同方向的温度控制。"},{"english":"Suspension type thumb nut is used for fastening so that it can be quickly opened up sand downward is conventient for maintenance.","chinese":"采用碟型活节螺栓紧固，能快速向下开启，便于维修。"},{"english":"They swung huge car advertisements from the top of the tall buildings.","chinese":"他们从高楼顶上向下悬挂了巨大的汽车广告。"},{"english":"Pull out retainer plate downwards.","chinese":"向下拔出固定板。"},{"english":"After the downward roll, I begin a recovery pull to level out.","chinese":"在向下滚转之后，我开始重新拉到水平退出。"}],"related":[{"definition":["upward\/up\/to advance\/to try to improve oneself\/to make progress"],"pinyin":["xiang4 shang4"],"word":"向上"},{"definition":["(of trains) down (i.e. away from the capital)\/(of river boats) to travel downstream\/to issue (a document) to lower bureaucratic levels\/(of writing on the page) vertical, proceeding from top to bottom"],"pinyin":["xia4 xing2"],"word":"下行"},{"definition":["to shake up\/to jolt\/to vibrate\/to oscillate\/to fluctuate","to vibrate\/to shake\/to shudder"],"pinyin":["zhen4 dang4","zhen4 dang4"],"word":"震荡"},{"definition":["(of trains) up (i.e. towards the capital)\/(of river boats) to go against the current\/to submit (a document) to higher authorities"],"pinyin":["shang4 xing2"],"word":"上行"},{"definition":["to rise (i.e. number increases)\/a price rise\/to raise"],"pinyin":["shang4 yang2"],"word":"上扬"},{"definition":["to disperse\/to diverge"],"pinyin":["fa1 san4"],"word":"发散"},{"definition":["lowest point\/minimum (point)"],"pinyin":["zui4 di1 dian3"],"word":"最低点"},{"definition":["out\/outward"],"pinyin":["xiang4 wai4"],"word":"向外"},{"definition":["moving average index (used in financial analysis)"],"pinyin":["jun1 xian4 zhi3 biao1"],"word":"均线指标"},{"definition":["forward\/onward"],"pinyin":["xiang4 qian2"],"word":"向前"},{"definition":["high position\/eminent status\/top job\/raised position\/upper (limbs)\/a high (i.e. local maximum)\/high point on scale, high grade, temperature, latitude etc"],"pinyin":["gao1 wei4"],"word":"高位"},{"definition":["phony\/so-called\/armchair (expert)\/vain (promise)\/(finance) short-seller\/bear (market)\/short (selling)"],"pinyin":["kong1 tou2"],"word":"空头"},{"definition":["backward"],"pinyin":["xiang4 hou4"],"word":"向后"},{"definition":["to bend\/to curve around\/curved\/crooked\/to wind\/to warp"],"pinyin":["wan1 qu1"],"word":"弯曲"},{"definition":["to stand firm"],"pinyin":["zhan4 wen3"],"word":"站稳"},{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"word":"反弹"}]}