{"definition":["lit. for a nobleman to take revenge, ten years is not too long (idiom)\/fig. revenge is a dish best served cold"],"pinyin":["jun1 zi5 bao4 chou2 , shi2 nian2 bu4 wan3"],"traditional":["君子報仇，十年不晚"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"君子报仇，十年不晚","characters":[{"definition":["monarch\/lord\/gentleman\/ruler"],"pinyin":["jun1"],"word":"君"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi5","zi3"],"word":"子"},{"definition":["to announce\/to inform\/report\/newspaper\/recompense\/revenge\/CL:份[fen4],張|张[zhang1]"],"pinyin":["bao4"],"word":"报"},{"definition":["hatred\/animosity\/enmity\/foe\/enemy\/to feel animosity toward (the wealthy, foreigners etc)","spouse\/companion","surname Qiu"],"pinyin":["chou2","qiu2","Qiu2"],"word":"仇"},{"word":"，"},{"definition":["ten\/10"],"pinyin":["shi2"],"word":"十"},{"definition":["grain\/harvest (old)\/variant of 年[nian2]","surname Nian","year\/CL:個|个[ge4]"],"pinyin":["nian2","Nian2","nian2"],"word":"年"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["evening\/night\/late"],"pinyin":["wan3"],"word":"晚"}],"containing_words":[],"sentences":[],"related":[{"definition":["a wise man knows better than to fight when the odds are against him (idiom)"],"pinyin":["hao3 han4 bu4 chi1 yan3 qian2 kui1"],"word":"好汉不吃眼前亏"},{"definition":["Only an outstanding talent can recognize current trends (idiom). A wise man submits to circumstances."],"pinyin":["shi2 shi2 wu4 zhe3 wei4 jun4 jie2"],"word":"识时务者为俊杰"},{"definition":["A leader can submit or can stand tall as required.\/ready to give and take\/flexible"],"pinyin":["da4 zhang4 fu5 neng2 qu1 neng2 shen1"],"word":"大丈夫能屈能伸"},{"definition":["(idiom) great plans can be ruined by just a touch of impatience"],"pinyin":["xiao3 bu4 ren3 ze2 luan4 da4 mou2"],"word":"小不忍则乱大谋"},{"definition":["persisting in evil brings about self-destruction (idiom)"],"pinyin":["duo1 xing2 bu4 yi4 bi4 zi4 bi4"],"word":"多行不义必自毙"},{"definition":["if revenge breeds revenge, will there ever be an end to it? (Buddhist saying)"],"pinyin":["yuan1 yuan1 xiang1 bao4 he2 shi2 liao3"],"word":"冤冤相报何时了"},{"definition":["lit. to nurture a tiger invites calamity\/fig. to indulge one's enemy is asking for trouble (idiom)"],"pinyin":["yang3 hu3 wei2 huan4"],"word":"养虎为患"},{"definition":["lit. to sleep on brushwood and taste gall (like King Gou Jian of Yue 勾踐|勾践[Gou1 Jian4]), in order to recall one's humiliations) (idiom)\/fig. to maintain one's resolve for revenge","lit. to lie on firewood and taste gall (idiom); fig. suffering patiently, but firmly resolved on revenge"],"pinyin":["wo4 xin1 chang2 dan3","wo4 xin1 chang2 dan3"],"word":"卧薪尝胆"},{"definition":["lit. easy to dodge the spear in the open, hard to avoid a stab in the dark (idiom); it is hard to guard against secret conspiracies"],"pinyin":["ming2 qiang1 yi4 duo3 , an4 jian4 nan2 fang2"],"word":"明枪易躲，暗箭难防"},{"definition":["While the green hills last, there'll be wood to burn (idiom). Where there's life there's hope."],"pinyin":["liu2 de5 qing1 shan1 zai4 , bu4 pa4 mei2 chai2 shao1"],"word":"留得青山在，不怕没柴烧"},{"definition":["no poison, no great man (idiom); A great man has to be ruthless."],"pinyin":["wu2 du2 bu4 zhang4 fu5"],"word":"无毒不丈夫"},{"definition":["where it is possible to let people off, one should spare them (idiom); anyone can make mistakes, forgive them when possible"],"pinyin":["de2 rao2 ren2 chu4 qie3 rao2 ren2"],"word":"得饶人处且饶人"},{"definition":["It is better to squash enmity rather than keeping it alive (proverb)"],"pinyin":["yuan1 jia1 yi2 jie3 bu4 yi2 jie2"],"word":"冤家宜解不宜结"},{"definition":["If you want to condemn sb, don't worry about the pretext (idiom, from Zuozhuan 左傳|左传); one can always trump up a charge against sb\/Give a dog a bad name, then hang him."],"pinyin":["yu4 jia1 zhi1 zui4 , he2 huan4 wu2 ci2"],"word":"欲加之罪，何患无辞"},{"definition":["A debt of blood must be paid in blood.\/Blood calls for blood."],"pinyin":["xue4 zhai4 xue4 chang2"],"word":"血债血偿"},{"definition":["It's all exaggeration, you don't need to take it seriously\/a fuss about nothing\/nothing to write home about"],"pinyin":["sha1 ren2 bu4 guo4 tou2 dian3 di4"],"word":"杀人不过头点地"}]}