{"definition":["to enlighten\/to explain (a text etc)\/to stimulate (a mental attitude)\/enlightenment\/revelation\/motivation"],"pinyin":["qi3 fa1"],"traditional":["啟發"],"rank":8941.0,"normalized_rank":0.12509619016971446,"fraction":0.000010016108889504613,"cumulative_fraction":0.9200770627336841,"word":"启发","characters":[{"definition":["variant of 啟|启[qi3]","to open\/to start\/to initiate\/to enlighten or awaken\/to state\/to inform","variant of 啟|启[qi3]","Qi son of Yu the Great 禹[Yu3], reported founder of the Xia Dynasty 夏朝[Xia4 Chao2] (c. 2070-c. 1600 BC)"],"pinyin":["qi3","qi3","qi3","Qi3"],"word":"启"},{"definition":["hair\/Taiwan pr. [fa3]","to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa4","fa1"],"word":"发"}],"containing_words":[{"definition":["heuristic"],"pinyin":["qi3 fa1 shi4"],"word":"启发式"},{"definition":["heuristic method\/heuristics"],"pinyin":["qi3 fa1 fa3"],"word":"启发法"}],"sentences":[{"english":"He inspires me and becomes a good friend of mine.","chinese":"他成了我的忘年交也为我带来启发。"},{"english":"Creative Adam and Eve inspired blanket cover for your bed.","chinese":"受亚当和夏娃所启发的创意毛毯床罩。"},{"english":"After forty minutes of interaction with the students, everyone says they are inspired to follow an eco-friendly way of life.","chinese":"四十分钟的互动下来，孩子们的环保心也跟著被启发。"},{"english":"The Heuristic will be similar to CIMA and on similar lines to Kaspersky and Avira.","chinese":"启发式将类似于西玛和类似的行卡巴斯基和查杀。"},{"english":"Topic designing is the key step of heuristic discussion teaching.","chinese":"问题设置是启发讨论式教学中的关键环节。"},{"english":"Modern clock inspired by the movement of Japanese folding fan.","chinese":"受日本折扇的转动所启发而制作的时尚时钟。"},{"english":"A new heuristic density-based ant colony clustering algorithm (HDACC) is presented.","chinese":"提出一种基于密度的启发性群体智能聚类算法。"},{"english":"A firm and solid will could awaken our wisdom, not just our conscience.","chinese":"若是道心坚固，就能够启发我们的智慧，不只是良知。"},{"english":"Dr Schnall's study was inspired by some previous work of her own.","chinese":"Schnall博士的研究受她先前研究工作的启发。"},{"english":"So here are my takeaways from the story","chinese":"我从这个故事中得到了以下启发。"},{"english":"Wooden computer case inspired by the Steampunk movement.","chinese":"由蒸汽朋克运动所启发的木质电脑机箱。"},{"english":"Searching the text-searchable parts you are interested in does not require an heuristic approach.","chinese":"搜索您感兴趣的可搜索部分不需要启发式方法。"},{"english":"Creative bedding set inspired by the iconic video game console.","chinese":"受到标志性的视频游戏机所启发的创意床上用品。"},{"english":"and what implications that has on our society here in the United States and throughout the world.","chinese":"以及他们对于我们美国社会和整个世界的启发。"},{"english":"Love comes to man through his senses , to woman through her imagination.","chinese":"男人靠触感来启发爱意，女人透过想像感受情爱。"},{"english":"That, he said, might help enlighten them.","chinese":"他说，这样或许可以启发他们。"}],"related":[{"definition":["to reveal\/to enlighten\/enlightenment\/revelation\/illumination\/moral (of a story etc)\/lesson"],"pinyin":["qi3 shi4"],"word":"启示"},{"definition":["to edify\/enlightenment"],"pinyin":["qi3 di2"],"word":"启迪"},{"definition":["inspiration\/insight\/a burst of creativity in scientific or artistic endeavor"],"pinyin":["ling2 gan3"],"word":"灵感"},{"definition":["opinion\/view\/understanding"],"pinyin":["jian4 jie3"],"word":"见解"},{"definition":["to come to realize\/to appreciate (feelings)"],"pinyin":["gan3 wu4"],"word":"感悟"},{"definition":["to draw on (others' experience)\/to learn from (how others do things)\/lesson to be learned (by observing others)"],"pinyin":["jie4 jian4"],"word":"借鉴"},{"definition":["to reflect on\/to ponder over"],"pinyin":["si1 kao3"],"word":"思考"},{"definition":["to touch\/to stir up (trouble or emotions)\/to move (sb's emotions or worry)"],"pinyin":["chu4 dong4"],"word":"触动"},{"definition":["to benefit (from)"],"pinyin":["shou4 yi4 fei3 qian3"],"word":"受益匪浅"},{"definition":["what one has learned (through experience, reading etc)\/knowledge\/insight\/understanding\/tips\/CL:項|项[xiang4],個|个[ge4]"],"pinyin":["xin1 de2"],"word":"心得"},{"definition":["one's thoughts and feelings\/emotional stirring\/moved\/touched"],"pinyin":["gan3 chu4"],"word":"感触"},{"definition":["to comprehend\/to understand\/comprehension\/understanding"],"pinyin":["li3 jie3"],"word":"理解"},{"definition":["variant of 啟蒙|启蒙[qi3 meng2]\/to instruct the young","to instruct the young\/to initiate\/to awake sb from ignorance\/to free sb from prejudice or superstition\/primer\/enlightened\/the Enlightenment\/Western learning from the late Qing dynasty"],"pinyin":["qi3 meng2","qi3 meng2"],"word":"启蒙"},{"definition":["resonance (physics)\/sympathetic response to sth"],"pinyin":["gong4 ming2"],"word":"共鸣"},{"definition":["cognition\/cognitive\/understanding\/perception\/awareness\/to be cognizant of\/to recognize\/to realize"],"pinyin":["ren4 zhi1"],"word":"认知"},{"definition":["way of looking at a thing\/view\/opinion\/CL:個|个[ge4]"],"pinyin":["kan4 fa3"],"word":"看法"}]}