{"definition":["Wu and Yue in the same boat (idiom); fig. cooperation between natural rivals\/to collaborate towards a common end\/in the same boat together"],"pinyin":["Wu2 Yue4 tong2 zhou1"],"traditional":["吳越同舟"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"吴越同舟","characters":[{"definition":["surname Wu\/area comprising southern Jiangsu, northern Zhejiang and Shanghai\/name of states in Southern China at different historical periods"],"pinyin":["Wu2"],"word":"吴"},{"definition":["generic word for peoples or states of south China or south Asia at different historical periods\/abbr. for Vietnam 越南","to exceed\/to climb over\/to surpass\/the more... the more"],"pinyin":["Yue4","yue4"],"word":"越"},{"definition":["like\/same\/similar\/together\/alike\/with","(used in given names)\/variant of 同[tong2]","see 衚衕|胡同[hu2 tong4]"],"pinyin":["tong2","tong2","tong4"],"word":"同"},{"definition":["boat"],"pinyin":["zhou1"],"word":"舟"}],"containing_words":[],"sentences":[],"related":[{"definition":["cross a river in the same boat (idiom); fig. having common interests\/obliged to collaborate towards common goals"],"pinyin":["tong2 zhou1 gong4 ji4"],"word":"同舟共济"},{"definition":["lit. the old man lost his horse, but it all turned out for the best (idiom)\/fig. a blessing in disguise\/it's an ill wind that blows nobody any good"],"pinyin":["bei3 sou3 shi1 ma3"],"word":"北叟失马"},{"definition":["to work with a common purpose (idiom); to make concerted efforts\/to pull together\/to work as one"],"pinyin":["tong2 xin1 xie2 li4"],"word":"同心协力"},{"definition":["of one mind (idiom)"],"pinyin":["tong2 xin1 tong2 de2"],"word":"同心同德"},{"definition":["internal disunity dissolves at the threat of an invasion from outside (idiom)"],"pinyin":["xiong1 di4 xi4 yu2 qiang2 , wai4 yu4 qi2 wu3"],"word":"兄弟阋于墙，外御其侮"},{"definition":["to support the weak and restrain the strong (idiom); robbing the rich to help the poor"],"pinyin":["fu2 ruo4 yi4 qiang2"],"word":"扶弱抑强"},{"definition":["to pledge undying love (idiom); oath of eternal love\/to swear by all the Gods"],"pinyin":["meng2 shan1 shi4 hai3"],"word":"盟山誓海"},{"definition":["to call sth a cow or a horse (idiom); it doesn't matter what you call it\/Insult me if you want, I don't care what you call me."],"pinyin":["hu1 niu2 hu1 ma3"],"word":"呼牛呼马"},{"definition":["a just cause enjoys abundant support (idiom); those upholding justice will find help all around"],"pinyin":["de2 dao4 duo1 zhu4"],"word":"得道多助"},{"definition":["to correct in the evening a fault of the morning (idiom)\/to quickly amend one's ways"],"pinyin":["zhao1 guo4 xi1 gai3"],"word":"朝过夕改"},{"definition":["to bide one's time, waiting for an opportunity to stage a comeback in public life (idiom)"],"pinyin":["zun1 shi2 yang3 hui4"],"word":"遵时养晦"},{"definition":["to make known to every household (idiom); to disseminate widely\/to shout from the rooftops"],"pinyin":["hu4 gao4 ren2 xiao3"],"word":"户告人晓"},{"definition":["cow and famous steed at the same trough (idiom); fig. the common and the great are treated alike"],"pinyin":["niu2 ji4 tong2 zao4"],"word":"牛骥同皂"},{"definition":["Sima Xiangru is meticulous and Mei Gao is fast (idiom)\/to each his good points"],"pinyin":["Ma3 gong1 Mei2 su4"],"word":"马工枚速"},{"definition":["(of friends or partners) to share both the honor and the disgrace (idiom)"],"pinyin":["rong2 ru3 yu3 gong4"],"word":"荣辱与共"},{"definition":["both near and distant treated alike (idiom)"],"pinyin":["xia2 er3 yi1 ti3"],"word":"遐迩一体"}]}