{"definition":["to draw a lesson (from a setback)"],"pinyin":["xi1 qu3 jiao4 xun5"],"traditional":["吸取教訓"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"吸取教训","characters":[{"definition":["to breathe\/to suck in\/to absorb\/to inhale"],"pinyin":["xi1"],"word":"吸"},{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"},{"definition":["surname Jiao","to teach","religion\/teaching\/to make\/to cause\/to tell"],"pinyin":["Jiao4","jiao1","jiao4"],"word":"教"},{"definition":["to teach\/to train\/to admonish\/instruction (from superiors)\/teachings\/rule"],"pinyin":["xun4"],"word":"训"}],"containing_words":[],"sentences":[{"english":"Draw lessons from mistake,don't make same mistakes.","chinese":"从错误中吸取教训，不要重犯旧错。"},{"english":"Our focus now should bein drawing lessons.","chinese":"我们现在的重点应当是吸取教训。"},{"english":"A failure is a man who has blundered, but is not able to cash in on the experience. -(Elbert Hubbard)","chinese":"失败者是犯了错误而不能从中吸取教训的人。"},{"english":"We can take lessons of the successes and failures from that.","chinese":"我们可以从那些成功或失败的例子吸取教训。"},{"english":"The second thing to do after realizing the inevitability of it all is to learn from it.","chinese":"第二点，在意识到它的不可避免性之后，吸取教训。"},{"english":"We should draw a moral from the startling fact.","chinese":"我们应当从这些触目惊心的事实中吸取教训。"},{"english":"Shriver said people should gain a lesson from the incident.","chinese":"施立弗说，人们应该从这件事中吸取教训。"},{"english":"Failure is success if we learn from it.","chinese":"果能从失败中吸取教训，失败亦是成功。"},{"english":"We should learn by the mistakes of others.","chinese":"我们应该从别人的错误中吸取教训。"},{"english":"It is time we finally learned the lessons of this lost decade.","chinese":"这失去的十年，我们终于学会吸取教训，是时候了。"},{"english":"They want to learn from our mistakes.","chinese":"他们希望从我们的错误中吸取教训。"},{"english":"Mr. Wong understands something that Lakers fans found out long ago, and the lesson remains relevant to this day.","chinese":"王先生从湖人球迷那儿吸取教训，直至今日任然受用。"},{"english":"They should learn a lesson from this incident :he who plays with fire will surely get burnt.","chinese":"他们应从这件事中吸取教训，玩火者必自焚。"},{"english":"And President Pinera said lessons have to be learnt from the accident.","chinese":"皮涅拉总统表示，必须从这次事故中吸取教训。"},{"english":"If you fall, get up, and learn from it.","chinese":"如果你失败了，站起来，并吸取教训。"},{"english":"We all learn something from doing that.","chinese":"那样做的话，我们都会吸取教训。"}],"related":[{"definition":["lesson\/moral\/to chide sb\/to lecture sb"],"pinyin":["jiao4 xun5"],"word":"教训"},{"definition":["Fall into the moat and you'll be wiser next time (idiom); One only learns from one's mistakes."],"pinyin":["chi1 yi1 qian4 , zhang3 yi1 zhi4"],"word":"吃一堑，长一智"},{"definition":["to repeat a crime\/persistent offender"],"pinyin":["zai4 fan4"],"word":"再犯"},{"definition":["to follow the track of an overturned cart\/to repeat a disastrous policy"],"pinyin":["chong2 dao3 fu4 zhe2"],"word":"重蹈覆辙"},{"definition":["to think of the pain when the pain is gone (idiom)\/to ponder about a painful experience"],"pinyin":["tong4 ding4 si1 tong4"],"word":"痛定思痛"},{"definition":["(coll.) to learn one's lesson\/to have enough brains to learn from one's mistakes"],"pinyin":["zhang3 ji4 xing5"],"word":"长记性"},{"definition":["to reflect upon oneself\/to examine one's conscience\/to question oneself\/to search one's soul"],"pinyin":["fan3 xing3"],"word":"反省"},{"definition":["lit. the cart in front overturns, a warning to the following cart (idiom); fig. draw lesson from the failure of one's predecessor\/learn from past mistake\/once bitten twice shy"],"pinyin":["qian2 che1 zhi1 fu4 , hou4 che1 zhi1 jian4"],"word":"前车之覆，后车之鉴"},{"definition":["to think back over sth\/to review\/to revisit\/to rethink\/reflection\/reassessment"],"pinyin":["fan3 si1"],"word":"反思"},{"definition":["error\/mistake\/CL:個|个[ge4]\/mistaken\/false\/wrong"],"pinyin":["cuo4 wu4"],"word":"错误"},{"definition":["to repeat errors\/to continue blundering\/to make continuous mistakes"],"pinyin":["yi1 cuo4 zai4 cuo4"],"word":"一错再错"},{"definition":["to err\/to make a mistake\/to do the wrong thing"],"pinyin":["fan4 cuo4"],"word":"犯错"},{"definition":["completely correcting one's former misdeeds (idiom); to repent past mistakes and turn over a new leaf\/a reformed character"],"pinyin":["tong4 gai3 qian2 fei1"],"word":"痛改前非"},{"definition":["to correct\/to amend\/to put right\/correction\/CL:個|个[ge4]"],"pinyin":["gai3 zheng4"],"word":"改正"},{"definition":["to learn a lesson from the mistakes of one's predecessor (idiom)"],"pinyin":["qian2 che1 zhi1 jian4"],"word":"前车之鉴"},{"definition":["lit. to mend the pen after sheep are lost (idiom)\/fig. to act belatedly\/better late than never\/to lock the stable door after the horse has bolted"],"pinyin":["wang2 yang2 bu3 lao2"],"word":"亡羊补牢"}]}