{"definition":["to absorb\/to assimilate\/to ingest\/to recruit"],"pinyin":["xi1 shou1"],"traditional":["吸收"],"rank":3482.0,"normalized_rank":0.048717697592097715,"fraction":0.0000398184632567561,"cumulative_fraction":0.8118509641015634,"word":"吸收","characters":[{"definition":["to breathe\/to suck in\/to absorb\/to inhale"],"pinyin":["xi1"],"word":"吸"},{"definition":["to receive\/to accept\/to collect\/to put away\/to restrain\/to stop\/in care of (used on address line after name)"],"pinyin":["shou1"],"word":"收"}],"containing_words":[{"definition":["absorbed dose"],"pinyin":["xi1 shou1 ji4 liang4"],"word":"吸收剂量"}],"sentences":[{"english":"Absorption is also dependent upon air flow rates and the partial pressure of the gases in the inspired air.","chinese":"吸收也取决于空气流速和吸入空气中的气体分压。"},{"english":"Conclusions Osteoclast-mediated bone resorption was inhibited by the bisphosphonate administration.","chinese":"结论双膦酸盐对破骨细胞性骨吸收有明显的抑制作用。"},{"english":"It attracted many thousands of visitors from all levels of society.","chinese":"水晶宫曾吸收了社会各阶级的瞻仰者驻足欣赏。"},{"english":"Moreover, the existence of absorbing sets was achieved in the non-homogeneous case.","chinese":"进而，也得到了对非齐次问题吸收集的存在性。"},{"english":"The influence of absorbing type refrigerating machine upon enorgysaving rate of the triplex cogeneration system to be very little.","chinese":"吸收式制冷机对三联产系统节能率的影响很小。"},{"english":"OBJECTIVE To investigate the absorption characteristics and mechanism of bergenin in rat intestine.","chinese":"目的研究岩白菜素在大鼠肠道中的吸收机理。"},{"english":"Spread abundant quantities of cream and massage carefully until absorbed.","chinese":"涂抹足量的霜，并且仔细按摩，直至完全吸收。"},{"english":"Bottle-feeding lets me know how much nutrition the baby has had.","chinese":"瓶喂使我知道宝宝到底吸收了多少营养。"},{"english":"Once the water reaches saturation , it can't take anymore.","chinese":"当达到饱和时，水将无法吸收更多的砂糖。"},{"english":"The best, most ideal situation is that we absorb Bible doctrine, and learn the principles of Biblical apologetics, during our secondary school years.","chinese":"我们在中学时期就充分吸收《圣经》教义和护教学。"},{"english":"Black carbon absorbs solar radiation, warming the atmosphere.","chinese":"炭黑吸收阳光辐射，让大气增温。"},{"english":"In your experience, what benefits has recruitment brought to your club?","chinese":"在你经验中，于贵社吸收新社员时有何益处？"},{"english":"In addition, MRP2 also influences the complicated absorption process of the traditional Chinese medicine, in particul…","chinese":"此外，MRP2还影响着中药成分的肠吸收过程。"},{"english":"A lack of sleep can interfere with your ability to assimilate new information.","chinese":"缺少睡眠能够影响你吸收新信息的能力。"},{"english":"Plants take up CO2 and store carbon in their biomasses.","chinese":"植物吸收二氧化碳并存储在植物生物量中。"},{"english":"Lounge patrons desperately wanted to imbibe the essence of all this.","chinese":"酒吧的老主顾们极欲将全部精华吸收殆尽。"}],"related":[{"definition":["nutrient"],"pinyin":["yang3 fen4"],"word":"养分"},{"definition":["to resolve\/to decompose\/to break down"],"pinyin":["fen1 jie3"],"word":"分解"},{"definition":["to adhere to a surface\/to absorb\/to draw in\/(fig.) to attract\/(chemistry) adsorption"],"pinyin":["xi1 fu4"],"word":"吸附"},{"definition":["to digest\/digestion\/digestive"],"pinyin":["xiao1 hua4"],"word":"消化"},{"definition":["to absorb\/to draw (a lesson, insight etc)\/to assimilate"],"pinyin":["xi1 qu3"],"word":"吸取"},{"definition":["to dissolve"],"pinyin":["rong2 jie3"],"word":"溶解"},{"definition":["to permeate"],"pinyin":["shen4 ru4"],"word":"渗入"},{"definition":["moisture content\/(fig.) overstatement\/padding"],"pinyin":["shui3 fen4"],"word":"水分"},{"definition":["to absorb (nutrients etc)\/to assimilate\/intake\/to take a photograph of (a scene)"],"pinyin":["she4 qu3"],"word":"摄取"},{"definition":["to draw\/to derive\/to absorb"],"pinyin":["ji2 qu3"],"word":"汲取"},{"definition":["to replenish\/to supplement\/to complement\/additional\/supplementary\/CL:個|个[ge4]"],"pinyin":["bu3 chong1"],"word":"补充"},{"definition":["best feature\/most important part of an object\/quintessence\/essence\/soul"],"pinyin":["jing1 hua2"],"word":"精华"},{"definition":["outside the body\/in vitro"],"pinyin":["ti3 wai4"],"word":"体外"},{"definition":["to take in\/to absorb\/to admit\/to accept"],"pinyin":["xi1 na4"],"word":"吸纳"},{"definition":["to change\/to transform\/isomerization (chemistry)"],"pinyin":["zhuan3 hua4"],"word":"转化"},{"definition":["(of soil etc) to wash away\/to be eroded\/(fig.) (of talented staff, followers of a religious faith, investment funds etc) to go elsewhere\/to fail to be retained"],"pinyin":["liu2 shi1"],"word":"流失"}]}