{"definition":["peace settlement\/peaceful solution"],"pinyin":["he2 ping2 jie3 jue2"],"traditional":["和平解決"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"和平解决","characters":[{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["surname Ping","flat\/level\/equal\/to tie (make the same score)\/to draw (score)\/calm\/peaceful\/see also 平聲|平声[ping2 sheng1]"],"pinyin":["Ping2","ping2"],"word":"平"},{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","to transport under guard","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","surname Xie"],"pinyin":["xie4","jie4","jie3","Xie4"],"word":"解"},{"definition":["to decide\/to determine\/to execute (sb)\/(of a dam etc) to breach or burst\/definitely\/certainly"],"pinyin":["jue2"],"word":"决"}],"containing_words":[],"sentences":[{"english":"Hopes of a peace settlement faded.","chinese":"和平解决的希望成为泡影。"},{"english":"We have consistently called for settling international disputes by peaceful means and opposed the use of force.","chinese":"我们一贯主张和平解决国际争端，反对使用武力。"},{"english":"We believe that it is up to the people on both sides of the Strait to resolve their differences peacefully.","chinese":"我们认为要由海峡两岸人民和平解决他们的分歧。"},{"english":"What are the prospects foreseen by China for the peace-talk process and the peaceful resolution of the issue?","chinese":"对和谈进程及和平解决核问题的前景怎么看？"},{"english":"All hopes of a peaceful settlement were destroyed by the bomb.","chinese":"这个爆炸事件使一切和平解决的希望都破灭了。"},{"english":"And there is still long way to go before the issue is ultimately resolved peacefully.","chinese":"最终和平解决朝核问题还有很长的一段路要走。"},{"english":"Third, , uphold mutual understanding and mutual accommodation and peaceful settlement of disputes through dialogue and consultation.","chinese":"第三，互谅互让，坚持对话协商和平解决争议。"},{"english":"always upholds a peaceful settlement of the Iranian nuclear issue through dialogue and negotiations.","chinese":"中方一贯主张通过对话与谈判和平解决伊朗核问题。"},{"english":"We only \"export\" peace and cooperation and are committed to peaceful solution of international disputes and hotspot issues.","chinese":"我们致力于和平解决国际争端和热点问题。"},{"english":"It urged all sides to peacefully resolve existing problems through dialogue.","chinese":"该组织敦促各方通过对话和平解决现存的问题。"},{"english":"I have only requested the League of Nations, taking into account justice and peaceful resolution.","chinese":"我考虑到只有请国际联盟主持正义，和平解决。"},{"english":"Within Israel, there is very little pressure for a peace settlement.","chinese":"在以色列内部，几乎没有和平解决的压力。"},{"english":"The question of the peace settlement is likely to prominently in the talks.","chinese":"和平解决的问题很可能是这次谈判的突出重点。"}],"related":[]}