{"definition":["to bury the hatchet\/to become reconciled"],"pinyin":["he2 hao3 ru2 chu1"],"traditional":["和好如初"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"和好如初","characters":[{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["to be fond of\/to have a tendency to\/to be prone to","good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello"],"pinyin":["hao4","hao3"],"word":"好"},{"definition":["as\/as if\/such as"],"pinyin":["ru2"],"word":"如"},{"definition":["at first\/(at the) beginning\/first\/junior\/basic"],"pinyin":["chu1"],"word":"初"}],"containing_words":[],"sentences":[{"english":"Can we make it good?","chinese":"我们能否和好如初？"},{"english":"They have like a two second rebound rate and you're back doing the next pain-in-the-ass thing.","chinese":"不好两秒钟我们就和好如初然后我们接着再吵。"},{"english":"Hao 9 and peach kyi reconciliation, peach kyi win the lawsuit.","chinese":"浩九和桃姬和好如初，桃姬打赢了官司。"},{"english":"I left as depressed as I’ve ever been, knowing that reconciliation was impossible.","chinese":"离开父亲时我很沮丧，我想，和好如初是不可能的了。"},{"english":"The breakdown of their marriage was irretrievable .","chinese":"他俩婚姻破裂，已无法和好如初。"},{"english":"He didn't do a runner. He was trying to make everything all right.","chinese":"他没有想要逃避，他试着让一切和好如初。"},{"english":"Little read this I rest assured, two people reconciliation.","chinese":"小念这才放心，俩人和好如初。"},{"english":"Sometimes we will fight but we always get along well.","chinese":"有时我们会争吵，但我们总是会和好如初。"},{"english":"The two friends have at last made up after the slight misunderstanding.","chinese":"在这小小的误会之后，两个朋友已经和好如初。"},{"english":"They patched up their tiff again.","chinese":"他们平息了争执，又和好如初了。"},{"english":"Can you turn around and reconnect?","chinese":"你能回头并和好如初吗？"},{"english":"They quarrelled but now they are completely reconciled.","chinese":"他们争吵过，但现在已和好如初。"},{"english":"In the KaDing under repeated explanations, two into finally animosity, reconciliation. Mrs.","chinese":"在卡丁的再三解释下，二入终于冰释前嫌，和好如初。"}],"related":[]}