{"definition":["to be forced to suffer in silence (idiom)\/unable to speak of one's bitter suffering\/sometimes written 啞子吃黃連，有苦說不出|哑子吃黄连，有苦说不出"],"pinyin":["ya3 ba5 chi1 huang2 lian2 , you3 ku3 shuo1 bu5 chu1"],"traditional":["啞巴吃黃連，有苦說不出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"哑巴吃黄连，有苦说不出","characters":[{"definition":["dumb\/mute\/hoarse\/husky\/unexploded (of artillery shell etc)","(onom.) sound of cawing\/sound of infant learning to talk\/variant of 呀[ya1]"],"pinyin":["ya3","ya1"],"word":"哑"},{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"},{"definition":["variant of 吃[chi1]","to eat\/to consume\/to eat at (a cafeteria etc)\/to eradicate\/to destroy\/to absorb\/to suffer\/to stammer (Taiwan pr. for this sense is [ji2])"],"pinyin":["chi1","chi1"],"word":"吃"},{"definition":["surname Huang or Hwang","yellow\/pornographic\/to fall through"],"pinyin":["Huang2","huang2"],"word":"黄"},{"definition":["to link\/to join\/to connect\/continuously\/in succession\/including\/(used with 也[ye3], 都[dou1] etc) even\/company (military)","surname Lian"],"pinyin":["lian2","Lian2"],"word":"连"},{"word":"，"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["bitter\/hardship\/pain\/to suffer\/to bring suffering to\/painstakingly"],"pinyin":["ku3"],"word":"苦"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)","variant of 說|说[shuo1]"],"pinyin":["shui4","shuo1","shuo1"],"word":"说"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[],"related":[]}