{"definition":["business activity\/commercial activity"],"pinyin":["shang1 ye4 xing2 wei2"],"traditional":["商業行為"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"商业行为","characters":[{"definition":["commerce\/merchant\/dealer\/to consult\/2nd note in pentatonic scale\/quotient (as in 智商[zhi4 shang1], intelligence quotient)","Shang Dynasty (c. 1600-1046 BC)\/surname Shang"],"pinyin":["shang1","Shang1"],"word":"商"},{"definition":["surname Ye","line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already"],"pinyin":["Ye4","ye4"],"word":"业"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"}],"containing_words":[],"sentences":[{"english":"Non-business dealing and business objective.","chinese":"无商业行为和商业目的。"},{"english":"Almost all businesses have a mission statement and a vision statement.","chinese":"几乎所有的商业行为都有任务与远景声明。"},{"english":"The exploration of a new world has turned into business as usual.","chinese":"对新世界的探索已经转变成了寻常的商业行为。"},{"english":"Personal relationships are by nature not an open business.","chinese":"私人关系并非天然意义上的一种公开的商业行为。"},{"english":"Exhibition pieces should not be labeled for price or have relation with any other methods of commercial behavior.","chinese":"展出作品不得有标价及其他方式之商业行为。"},{"english":"This characteristic finds an echo in business conduct.","chinese":"这一特征也反映在商业行为中。"}],"related":[]}