{"definition":["to deal with the aftermath (arising from an accident)\/funeral arrangements\/reparations"],"pinyin":["shan4 hou4"],"traditional":["善後"],"rank":9389.0,"normalized_rank":0.13136429141074252,"fraction":0.000009205057194659716,"cumulative_fraction":0.9243820911171338,"word":"善后","characters":[{"definition":["good (virtuous)\/benevolent\/well-disposed\/good at sth\/to improve or perfect"],"pinyin":["shan4"],"word":"善"},{"definition":["empress\/queen\/(archaic) monarch\/ruler","back\/behind\/rear\/afterwards\/after\/later\/post-","surname Hou"],"pinyin":["hou4","hou4","Hou4"],"word":"后"}],"containing_words":[{"definition":["reconstruction loan provided by Great Powers to Yuan Shikai in 1913"],"pinyin":["shan4 hou4 jie4 kuan3"],"word":"善后借款"}],"sentences":[{"english":"To work with pertinent institutions to prepare funerals for deceased retired cadres and take charge of cadres' posthumous affairs.","chinese":"会同有关部门办理离退休干部的丧葬和善后处理事宜。"},{"english":"Unclaimed bodies of the victims, such as rehabilitation work is under way.","chinese":"遇难者遗体认领等善后工作也正在展开。"},{"english":"The two sides will keep close contacts and cooperation to appropriately handle the aftermath.","chinese":"双方表示将就妥善处理善后事宜保持密切联系与合作。"},{"english":"Hygienic fight-flight reaction damage control processing.","chinese":"卫生应急反应的善后处理。"},{"english":"Fourthly, the works of rescue injured and rehabilitation dead people were done with all our strength.","chinese":"四是全力做好受伤人员抢救和遇难人员善后事宜。"},{"english":"Relevant follow-up work is underway.","chinese":"目前相关善后工作正在进行。"},{"english":"BP is hiring local fishing boats to help in oil clean-up efforts.","chinese":"英国石油公司目前亦雇用了当地渔船帮忙处理善后。"},{"english":"This old gentleman is to deal with the aftermath of the traffic accident.","chinese":"这位老先生负责处理这次车祸的善后工作。"},{"english":"Also through reading your book I've learnt things they never tell you about aftercare in the Studio.","chinese":"书中还通过阅读我学到的东西，没告诉你善后的画室。"},{"english":"Although, this takes place automatically, you must still carry out the aftercare recommendations.","chinese":"虽然，这需要自动进行，您仍然必须进行善后的建议。"},{"english":"Currently, relevant departments under way deal with the aftermath.","chinese":"目前，有关部门正在进行善后处理。"},{"english":"In-centre treatment is followed by 12 months of statutory after-care supervision.","chinese":"吸毒犯获释后，尚须接受法定善后监管12个月。"},{"english":"Handling public crisis is an important link in crisis management.","chinese":"公共危机善后处理是危机管理的一个重要环节。"},{"english":"This way, you will be in a much better place during the end game part of your release.","chinese":"这样，在发行版的善后工作中，您会更加轻松。"},{"english":"Competent Chinese authorities attach great importance to searching and rescuing the crew members and handling the aftermath.","chinese":"中方有关部门高度重视对遇险船员的搜救和善后工作。"}],"related":[{"definition":["to clear up the mess\/to pick up the pieces"],"pinyin":["shou1 shi5 can2 ju2"],"word":"收拾残局"},{"definition":["to be fair\/to be impartial\/to settle (a matter etc)"],"pinyin":["bai3 ping2"],"word":"摆平"},{"definition":["terrible mess\/shambles"],"pinyin":["lan4 tan1 zi5"],"word":"烂摊子"},{"definition":["to be made a scapegoat\/to be unjustly blamed"],"pinyin":["bei1 hei1 guo1"],"word":"背黑锅"},{"definition":["appropriate\/proper"],"pinyin":["tuo3 shan4"],"word":"妥善"},{"definition":["appropriate\/proper\/ready"],"pinyin":["tuo3 dang5"],"word":"妥当"},{"definition":["to take one's time making a decision (idiom)\/to consider at length"],"pinyin":["cong2 chang2 ji4 yi4"],"word":"从长计议"},{"definition":["various jobs\/low-grade work"],"pinyin":["za2 wu4"],"word":"杂务"},{"definition":["to reconcile\/to mediate\/to bring warring parties to agreement\/to arbitrate"],"pinyin":["tiao2 ting2"],"word":"调停"},{"definition":["to assign (a task to different people)\/to allocate"],"pinyin":["fen1 pai4"],"word":"分派"},{"definition":["to handle\/to take care of\/to punish"],"pinyin":["chu3 zhi4"],"word":"处置"},{"definition":["(of an organization that has a duty of care) to give financial support to relatives of sb who has died or suffered serious injury"],"pinyin":["fu3 xu4"],"word":"抚恤"},{"definition":["to get involved in\/to meddle\/interference"],"pinyin":["cha1 shou3"],"word":"插手"},{"definition":["internal affairs\/domestic affairs\/family affairs\/(trad.) affairs within the palace"],"pinyin":["nei4 wu4"],"word":"内务"},{"definition":["to appear personally\/to step in\/to step forth\/to show up"],"pinyin":["chu1 mian4"],"word":"出面"},{"definition":["to investigate thoroughly"],"pinyin":["che4 cha2"],"word":"彻查"}]}