{"definition":["to reply\/to recover\/to return (to a previous condition)\/Re: in reply to (email)"],"pinyin":["hui2 fu4"],"traditional":["回復"],"rank":6280.0,"normalized_rank":0.0878653477536972,"fraction":0.000017282729177064735,"cumulative_fraction":0.8850103339963392,"word":"回复","characters":[{"definition":["to curve\/to return\/to revolve","to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)","variant of 迴|回[hui2]"],"pinyin":["hui2","hui2","hui2"],"word":"回"},{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out","to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4","fu4","fu4"],"word":"复"}],"containing_words":[],"sentences":[{"english":"Agnes hasn't added or RSVPed to any events yet.","chinese":"尚未添加或回复任何事件。"},{"english":"This message contains a request to return a notification about your reception of the message.","chinese":"这封信要求回复信件处理通知给寄件者。"},{"english":"Concise, after receipt of the g frequently reply in turn good mood.","chinese":"简洁收到克勤的回复后，心情转好。"},{"english":"Enemies hit by meteors are knocked down, 25 second recharge.","chinese":"被陨石雨击中的敌人将倒地，25秒回复。"},{"english":"The answer to the girl's letter cost him much time.","chinese":"回复那姑娘的信使他花了许多时间。"},{"english":"I want to reply to the person's request .","chinese":"我想要回复那人的请求。"},{"english":"As difficult as it may be at times, try not to take negative feedback personally.","chinese":"回复时尽可能不牵动个人情绪，虽然有时候很难做到。"},{"english":"Seats are limited and will be available on first-reply-first-serve basis.","chinese":"座位有限及采用先回复先留位的方法。"},{"english":"For more information please check the appendix.","chinese":"请收阅附件并回复。"},{"english":"I have a batch of letters to answer.","chinese":"我有一批信要回复。"},{"english":"In real prices, oil briefly fell back to pre-1973 levels.","chinese":"实际石油价格甚至短暂回复到1973年之前的水平。"},{"english":"Women are, in general, more capable of rapidly returning to orgasm immediately after an orgasmic experience.","chinese":"通常女性在高潮后可以更快的再次回复高潮。"},{"english":"PAN\/PU hollow fibers possess excellent elastic recovery percentage.","chinese":"PU具有较好的弹性回复率。"},{"english":"A daily conditioning shampoo to help protect hair, leaving it soft and manageable.","chinese":"能有效改善受损发质，令秀发回复柔顺。"},{"english":"The researchers measured how many responses they received by each type of postcard.","chinese":"研究者们分析了人们对于不同明信片的回复数量。"},{"english":"The aircraft's transponder replies with coded information to interrogation from the ground ATC station.","chinese":"飞机的应答机用代码信息来回复地面空管站的询问。"}],"related":[{"definition":["private correspondence\/personal letter\/(computing) personal message (PM)\/to message sb"],"pinyin":["si1 xin4"],"word":"私信"},{"definition":["dialog box (computing)"],"pinyin":["dui4 hua4 kuang4"],"word":"对话框"},{"definition":["to respond\/response"],"pinyin":["hui2 ying4"],"word":"回应"},{"definition":["keyword"],"pinyin":["guan1 jian4 zi4"],"word":"关键字"},{"definition":["to transmit\/to dispatch\/to issue (an official document or credential)"],"pinyin":["fa1 song4"],"word":"发送"},{"definition":["to leave a message\/to leave one's comments\/message"],"pinyin":["liu2 yan2"],"word":"留言"},{"definition":["to sticky (an Internet forum thread etc)"],"pinyin":["zhi4 ding3"],"word":"置顶"},{"definition":["to reply\/to answer\/the answer\/CL:個|个[ge4]"],"pinyin":["hui2 da2"],"word":"回答"},{"definition":["to question\/to quiz\/to grill"],"pinyin":["ti2 wen4"],"word":"提问"},{"definition":["to receive"],"pinyin":["shou1 dao4"],"word":"收到"},{"definition":["to answer\/to reply\/Reply to: (in email header)","variant of 答覆|答复[da2 fu4]"],"pinyin":["da2 fu4","da2 fu4"],"word":"答复"},{"definition":["to consult\/to seek advice\/consultation\/(sales) inquiry (formal)"],"pinyin":["zi1 xun2"],"word":"咨询"},{"definition":["customer service"],"pinyin":["ke4 fu2"],"word":"客服"},{"definition":["screenshot (computing)"],"pinyin":["jie2 tu2"],"word":"截图"},{"definition":["server push (computing)"],"pinyin":["tui1 song4"],"word":"推送"},{"definition":["to comment on\/to discuss\/comment\/commentary\/CL:篇[pian1]"],"pinyin":["ping2 lun4"],"word":"评论"}]}