{"definition":["to return to one's home country"],"pinyin":["hui2 guo2"],"traditional":["回國"],"rank":4444.0,"normalized_rank":0.06217732570341247,"fraction":0.000028742264840980127,"cumulative_fraction":0.8443849915232478,"word":"回国","characters":[{"definition":["to curve\/to return\/to revolve","to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)","variant of 迴|回[hui2]"],"pinyin":["hui2","hui2","hui2"],"word":"回"},{"definition":["surname Guo","country\/nation\/state\/national\/CL:個|个[ge4]"],"pinyin":["Guo2","guo2"],"word":"国"}],"containing_words":[],"sentences":[{"english":"This is the first solo exhibition of Ding Li upon his return to home from his study at L'ecole des Beaux-Arts in France.","chinese":"这是丁力自巴黎艺术学院毕业回国后的第一个个展。"},{"english":"The soldiers posted abroad in 2001 rotated home last year.","chinese":"2001年派驻国外的士兵去年轮换调防回国。"},{"english":"He got his Master of Asian studies from Lund University in Sweden.","chinese":"沈亮在回国创业前在瑞典隆德大学获得硕士学位。"},{"english":"Qian was immediately allowed to establish an Institute of Mechanics in Beijing, and to work within the state -established Chinese Academy of Science.","chinese":"钱回国后随即在北京建立力学院，并创建中国科学院。"},{"english":"Both the United Nations and the United States are upset about Dostum's return.","chinese":"但联合国和美国对杜斯塔姆的回国感到不安。"},{"english":"Canda has made some secret business deal with China in exchange for sending this man back home.","chinese":"把这人送回国去，是加拿大跟中国私底下有交易。"},{"english":"And in the studies after returning home, I will be even more full play to their ability.","chinese":"并且在学成回国后，我将更加充分的发挥自己的能力。"},{"english":"Where a diplomat stationed abroad leaves his post and returns to his country, his rank shall be terminated correspondingly.","chinese":"驻外外交人员离任回国，其衔级相应终止。"},{"english":"After returning home she held solo exhibitions many times in Shanghai.","chinese":"回国后多次在上海举行个人油画展。"},{"english":"After he got the Doctor's Dearee of Meteorology, he returned to China.","chinese":"获得气象学博士学位后，竺可桢回国。"},{"english":"But Rong Hong returned only to find a poverty-stricken country under a corrupt government.","chinese":"容闳回国后，看到了清政府的腐朽落后和国家的贫困。"},{"english":"Out organization has effectuated the return to their countries of all the political prisoners.","chinese":"我们的组织已达成遣送所有政治犯回国。"},{"english":"Gillard's Apricot Kernels will be short-lived, with Rudd due to return to Artificial Turf late Thursday.","chinese":"但吉拉德的升职只是短暂的，陆克文周四晚就会回国。"},{"english":"However, after his return, 26-year-old Wang was no better prepared to find work.","chinese":"但回国后，26岁的王建海在求职时可以说毫无准备。"},{"english":"Is ready to return in his country Marcos Assuncao (31), former midfield of Roma and Betis Sevilla.","chinese":"前罗马和贝蒂斯中场马克思阿松桑准备回国。"},{"english":"And Mr. Green will make another appointment when Mr. Wang comes back.","chinese":"格林先生回国后再和王经理安排另一个见面。"}],"related":[{"definition":["to go home (to one's native country)\/to return from abroad"],"pinyin":["gui1 guo2"],"word":"归国"},{"definition":["to go abroad\/to leave the country\/emigration"],"pinyin":["chu1 guo2"],"word":"出国"},{"definition":["to study abroad"],"pinyin":["liu2 xue2"],"word":"留学"},{"definition":["overseas\/abroad"],"pinyin":["hai3 wai4"],"word":"海外"},{"definition":["to travel to (a distant place)"],"pinyin":["yuan3 fu4"],"word":"远赴"},{"definition":["to come to China"],"pinyin":["lai2 Hua2"],"word":"来华"},{"definition":["to resign"],"pinyin":["ci2 zhi2"],"word":"辞职"},{"definition":["to set out on a journey"],"pinyin":["qi3 cheng2"],"word":"启程"},{"definition":["to take a vacation\/to go on holiday"],"pinyin":["xiu1 jia4"],"word":"休假"},{"definition":["sb who has come back to China after gaining overseas experience (a pun on 海龜|海龟[hai3 gui1])\/to return to China after a period of study or work overseas"],"pinyin":["hai3 gui1"],"word":"海归"},{"definition":["to depart\/to leave"],"pinyin":["li2 kai1"],"word":"离开"},{"definition":["to return\/to come back"],"pinyin":["hui2 lai5"],"word":"回来"},{"definition":["to pursue one's studies"],"pinyin":["shen1 zao4"],"word":"深造"},{"definition":["to return to one's unit\/to go back to one's station in life"],"pinyin":["gui1 dui4"],"word":"归队"},{"definition":["to rush to\/to hurry to"],"pinyin":["ben1 fu4"],"word":"奔赴"},{"definition":["to return\/to go back"],"pinyin":["hui2 qu5"],"word":"回去"}]}