{"definition":["to return home"],"pinyin":["hui2 jia1"],"traditional":["回家"],"rank":1490.0,"normalized_rank":0.020847033145383567,"fraction":0.00010728056373472945,"cumulative_fraction":0.6841529873364519,"word":"回家","characters":[{"definition":["to curve\/to return\/to revolve","to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)","variant of 迴|回[hui2]"],"pinyin":["hui2","hui2","hui2"],"word":"回"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"}],"containing_words":[{"definition":["(coll.) (Tw) to get sacked\/to be fired"],"pinyin":["hui2 jia1 chi1 zi4 ji3"],"word":"回家吃自己"}],"sentences":[{"english":"The tired children get home 7pm.","chinese":"这些劳累的孩子直到7点才回家。"},{"english":"Boy stole a lesson-book from one of his school-fellows and took it home to his Mother.","chinese":"有个男孩偷了同学的一本教科书，带回家给母亲。"},{"english":"Red back home, light fire make life.","chinese":"红色跟着回家，人间烟火。"},{"english":"I came home for lunch.","chinese":"我回家吃中午饭。"},{"english":"It was fine at first; most of my friends had moved home too.","chinese":"起初我觉得还好，我的很多朋友也都回家投靠父母了。"},{"english":"Doudou has been home half a month, how I miss him.","chinese":"豆豆回家已经半个月了，我好想他啊。"},{"english":"Gastrointestinal disorders big investigation, the health to take home.","chinese":"胃肠道疾病大排查，把健康带回家。"},{"english":"My elder brother and I loaded the handcart with wheat and pulled it home.","chinese":"我和哥哥用架子车装了一车麦子拉回家。"},{"english":"Walking home by the alma mater is just for seeking fun.","chinese":"经过母校步行回家仅仅为了取乐而已。"},{"english":"He likes a drink when he returns home from work.","chinese":"他喜欢放工回家后喝一杯酒。"},{"english":"I would recite all that had been rehearsed on the way home.","chinese":"我会把在回家路上练习过的东西背诵一遍。"},{"english":"Glass and a Half Full Productions, home of Cadbury Dairy Milk, the gorilla and trucks.","chinese":"玻璃和半饱制作，吉百利牛奶，大猩猩和卡车回家。"},{"english":"She then took the chicken bones home and made soup out of them.","chinese":"然后她把鸡骨头打包回家，做成了汤。"},{"english":"As she drove home, Mrs. Cox thought about the class she had just left.","chinese":"科克斯夫人在驱车回家的路上想着她刚上完的这节课。"},{"english":"Now the lifeguards have all gone home.","chinese":"现在救生员全都回家了。"},{"english":"Think of the long trip home.","chinese":"想起回家的长途旅程。"}],"related":[{"definition":["to return\/to go back"],"pinyin":["hui2 qu5"],"word":"回去"},{"definition":["to go back to one's roots\/to return to one's native place\/by ext. to join one's ancestors (i.e. to die)"],"pinyin":["hui2 lao3 jia1"],"word":"回老家"},{"definition":["to return\/to come back"],"pinyin":["hui2 lai5"],"word":"回来"},{"definition":["perfect\/excellent\/brought to the utmost degree"],"pinyin":["dao4 jia1"],"word":"到家"},{"definition":["to finish work\/to get off work"],"pinyin":["xia4 ban1"],"word":"下班"},{"definition":["to go out\/to leave home\/to go on a journey\/away from home\/(of a woman) to get married"],"pinyin":["chu1 men2"],"word":"出门"},{"definition":["native place\/place of origin\/home state or region"],"pinyin":["lao3 jia1"],"word":"老家"},{"definition":["to celebrate the Chinese New Year"],"pinyin":["guo4 nian2"],"word":"过年"},{"definition":["(of a wife) to return to her parental home\/(fig.) to return to one's old place, job, school etc"],"pinyin":["hui2 niang2 jia1"],"word":"回娘家"},{"definition":["to go out"],"pinyin":["chu1 qu4"],"word":"出去"},{"definition":["to dismiss students at the end of the school day"],"pinyin":["fang4 xue2"],"word":"放学"},{"definition":["dad and mom"],"pinyin":["ba4 ma1"],"word":"爸妈"},{"definition":["to go to work\/to be on duty\/to start work\/to go to the office"],"pinyin":["shang4 ban1"],"word":"上班"},{"definition":["home"],"pinyin":["jia1 li3"],"word":"家里"},{"definition":["to go to school\/to attend school"],"pinyin":["shang4 xue2"],"word":"上学"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}]}