{"definition":["to flow back\/reflux\/circumfluence\/refluence\/backward flow\/returning flow (e.g. of talent)"],"pinyin":["hui2 liu2"],"traditional":["回流"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"回流","characters":[{"definition":["to curve\/to return\/to revolve","to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)","variant of 迴|回[hui2]"],"pinyin":["hui2","hui2","hui2"],"word":"回"},{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"}],"containing_words":[],"sentences":[{"english":"It is said that reshoring is a growing trend.","chinese":"据说企业“回流”将呈增长趋势。"},{"english":"The proposed repeat of the corporate tax repatriation holiday is one such wolf in sheep's clothing.","chinese":"重提回流资金减税就是这种批着羊皮的狼。"},{"english":"Time of recirculating and eluting must be over 3 h.","chinese":"回流洗脱时间一定大于3小时。"},{"english":"Copper tubing shall not be used on the downstream side of the backflow preventer.","chinese":"在防回流阀的下游不应该安装铜管。"},{"english":"In addition, the taper also affects the original position of the backward flow.","chinese":"此外，锥度对于回流的初始发生位置也产生了影响。"},{"english":"Certain jobs have been dribbling back to the U.S. for a few years.","chinese":"某些职位多年来一直在往美国回流。"},{"english":"As a result, it is important to minimize the number of times your code results in a re-flow and re-paint.","chinese":"因此，减少代码中回流和重绘的次数就尤为重要。"},{"english":"The efficiency of UPE was better than heat reflux extraction.","chinese":"超高压提取的效率优于热回流提取。"},{"english":"The gate valve with the test cock is to mounted on the inlet side of the backflow preventer .","chinese":"带有测试旋塞的闸阀安装在防回流阀的进口一侧。"},{"english":"The action of effluent recycle on an upflow anaerobic filter is very complex.","chinese":"出水回流对上流式厌氧滤器的影响非常复杂。"},{"english":"That means both reflow soldering and wave soldering are used.","chinese":"这意味着既回流焊和波峰焊使用。"},{"english":"Superior solder ability and resistance to soldering heat, ldeal for wave or reflow soldering.","chinese":"优良的可焊性及耐热冲击性，适合波峰焊及回流焊。"},{"english":"Reflux the mixture untill no tin remains.","chinese":"回流此混合物直至没有锡剩下。"},{"english":"It occurs when twisting of the spermatic cord cuts off the venous drainage, leading to hemorrhagic infarction.","chinese":"精索扭转阻断静脉回流就会导致出血性梗死。"},{"english":"Upon completion of the Three Gorges project, the sewage will back up in the reservoir.","chinese":"大坝建成后，这些污水将回流至水库中。"},{"english":"The auxiliary line shall consist of an approved backflow preventer and water meter.","chinese":"辅助管路应该由通过认证的防回流阀和水表构成。"}],"related":[{"definition":["outflow\/to flow out\/to drain"],"pinyin":["wai4 liu2"],"word":"外流"},{"definition":["to flow into\/to drift into\/influx\/inflow"],"pinyin":["liu2 ru4"],"word":"流入"},{"definition":["to come pouring in\/influx"],"pinyin":["yong3 ru4"],"word":"涌入"},{"definition":["to flow\/to circulate\/to go from place to place\/to be mobile\/(of assets) liquid"],"pinyin":["liu2 dong4"],"word":"流动"},{"definition":["hot money, money flowing from one currency to another in the hope of quick profit"],"pinyin":["re4 qian2"],"word":"热钱"},{"definition":["expansion\/dilation\/to expand (e.g. one's power or influence)\/to broaden"],"pinyin":["kuo4 zhang1"],"word":"扩张"},{"definition":["to intensify\/to sharpen\/to accelerate\/to aggravate\/to exacerbate\/to embitter"],"pinyin":["jia1 ju4"],"word":"加剧"},{"definition":["to pull back\/to shrink\/to contract\/(physiology) systole"],"pinyin":["shou1 suo1"],"word":"收缩"},{"definition":["against the stream\/adverse current\/a countercurrent\/fig. reactionary tendency\/to go against the trend"],"pinyin":["ni4 liu2"],"word":"逆流"},{"definition":["a big margin\/substantially"],"pinyin":["da4 fu2"],"word":"大幅"},{"definition":["to tighten up (restrictions etc)"],"pinyin":["shou1 jin3"],"word":"收紧"},{"definition":["(of soil etc) to wash away\/to be eroded\/(fig.) (of talented staff, followers of a religious faith, investment funds etc) to go elsewhere\/to fail to be retained"],"pinyin":["liu2 shi1"],"word":"流失"},{"definition":["to coalesce\/to gather together\/to amass"],"pinyin":["ji1 ju4"],"word":"积聚"},{"definition":["to squeeze\/to press\/to extrude"],"pinyin":["ji3 ya1"],"word":"挤压"},{"definition":["to speed up\/to expedite"],"pinyin":["jia1 su4"],"word":"加速"},{"definition":["blood"],"pinyin":["xue4 ye4"],"word":"血液"}]}