{"definition":["to repay a favor\/to give back\/feedback"],"pinyin":["hui2 kui4"],"traditional":["回饋"],"rank":12580.0,"normalized_rank":0.17601052145565454,"fraction":0.000005657362929034181,"cumulative_fraction":0.9473338158883602,"word":"回馈","characters":[{"definition":["to curve\/to return\/to revolve","to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)","variant of 迴|回[hui2]"],"pinyin":["hui2","hui2","hui2"],"word":"回"},{"definition":["food\/to make a present","to make an offering to the gods\/variant of 饋|馈[kui4]"],"pinyin":["kui4","kui4"],"word":"馈"}],"containing_words":[],"sentences":[{"english":"For it is just as when I feed myself – I don't expect to be rewarded.","chinese":"就像自己给自己喂饭一样，从来不会希求回馈或善报。"},{"english":"Negative feedback and not being appreciated demotivates me.","chinese":"消极的回馈，不被欣赏，让我沮丧。"},{"english":"Visit on a Sunday or ask for cashback at the supermarket.","chinese":"周日再来或是在超市要求现金回馈。"},{"english":"I often say to people that producing is the best paid form of cowardice.","chinese":"我常跟人说，“制作”是对懦弱的最佳回馈方式。"},{"english":"The RMS will pick this up before it gets to the client application.","chinese":"回馈到达客户端应用后，将由RMS接收。"},{"english":"Log into Ebates or rebate site of your choice.","chinese":"登陆Ebates或者你选择的回馈站点。"},{"english":"Specialized donation groups or thrift stores will have other methods of giving back to the community.","chinese":"专门的捐赠组织或旧货店有其他的途径回馈社区。"},{"english":"Collecting the various countries fans' feedback and report back to the Cloud staff.","chinese":"收集各个国家球迷的回馈和报告回云的工作人员。"},{"english":"Answer questions and build your product with their feedback.","chinese":"回答问题并基于他们的回馈来创建你的产品。"},{"english":"With you as educational czar or czarina, feedback becomes your friend and guide.","chinese":"你作为教育沙皇或女皇，回馈将变成你的朋友和导师。"},{"english":"There are feedbacks or new knowledge from others after individuals express their opinions.","chinese":"当伙伴表达他们的见解后，会得到意见或新知识回馈。"},{"english":"In this case, incentives could entice people to provide feedback.","chinese":"在这种情况下，奖励可以吸引公众提供回馈。"},{"english":"This kind of community feedback has been a big help in solidifying the software.","chinese":"像这样的社区回馈给了项目极大的帮助。"},{"english":"The president would no doubt then reward former warlords who supported him with jobs and spoils.","chinese":"无疑卡尔扎伊之后会以部分官职回馈军阀对他的支持。"},{"english":"The obligation for human to reciprocate the environment is the requirement of eco-justice.","chinese":"环境回馈义务也是生态正义的要求。"},{"english":"Service data related to vehicle, compile and feedback to CSD.","chinese":"编写并向CSD回馈有关车辆的服务信息。"}],"related":[{"definition":["(in) return\/reciprocation\/payback\/retaliation\/to report back\/to reciprocate"],"pinyin":["hui2 bao4"],"word":"回报"},{"definition":["variant of 給予|给予[ji3 yu3]"],"pinyin":["ji3 yu3"],"word":"给与"},{"definition":["to accord\/to give\/to show (respect)"],"pinyin":["ji3 yu3"],"word":"给予"},{"definition":["(express) thanks\/gratitude\/grateful\/thankful\/thanks"],"pinyin":["gan3 xie4"],"word":"感谢"},{"definition":["to offer respectfully\/to consecrate\/to dedicate\/to devote"],"pinyin":["feng4 xian4"],"word":"奉献"},{"definition":["to show concern and care for"],"pinyin":["guan1 ai4"],"word":"关爱"},{"definition":["to give to\/to provide to\/to bring to\/to take to"],"pinyin":["dai4 gei3"],"word":"带给"},{"definition":["care\/solicitude\/to show care for\/concerned about\/attentive to"],"pinyin":["guan1 huai2"],"word":"关怀"},{"definition":["to present (a gift) to (sb)"],"pinyin":["kui4 zeng4"],"word":"馈赠"},{"definition":["material benefit\/benefit in kind\/(social) welfare"],"pinyin":["fu2 li4"],"word":"福利"},{"definition":["to harvest\/to reap\/to gain\/crop\/harvest\/profit\/gain\/bonus\/reward","variant of 收穫|收获[shou1 huo4]"],"pinyin":["shou1 huo4","shou1 huo4"],"word":"收获"},{"definition":["to encourage\/to urge\/motivation\/incentive"],"pinyin":["ji1 li4"],"word":"激励"},{"definition":["to pay\/to invest (energy or time in a friendship etc)"],"pinyin":["fu4 chu1"],"word":"付出"},{"definition":["to support one's parents in their old age\/to show filial piety\/to to repay\/to return a favor"],"pinyin":["fan3 bu3"],"word":"反哺"},{"definition":["to transmit\/to pass on to sb else\/(math.) transitive"],"pinyin":["chuan2 di4"],"word":"传递"},{"definition":["to have expectations\/to earnestly hope\/expectation\/hope"],"pinyin":["qi1 wang4"],"word":"期望"}]}