{"definition":["to revolve around\/to center on (an issue)"],"pinyin":["wei2 rao4"],"traditional":["圍繞"],"rank":2230.0,"normalized_rank":0.031200593231010314,"fraction":0.00006699395022862712,"cumulative_fraction":0.7470001441118858,"word":"围绕","characters":[{"definition":["to encircle\/to surround\/all around\/to wear by wrapping around (scarf, shawl)","surname Wei"],"pinyin":["wei2","Wei2"],"word":"围"},{"definition":["variant of 繞|绕[rao4], to rotate around\/to spiral\/to move around\/to go round (an obstacle)\/to by-pass\/to make a detour","to wind\/to coil (thread)\/to rotate around\/to spiral\/to move around\/to go round (an obstacle)\/to by-pass\/to make a detour\/to confuse\/to perplex"],"pinyin":["rao4","rao4"],"word":"绕"}],"containing_words":[],"sentences":[{"english":"Therefore, the dissertation concentrates on the research of localization in WSNs.","chinese":"因此，本论文围绕无线传感器网络定位技术展开研究。"},{"english":"The castle was embosomed in huge rocks.","chinese":"那座城堡有巨岩围绕着。"},{"english":"Stalks of grain, representing the peasant population, surround the gate.","chinese":"围绕着天安门的稻穗代表了中国的农民阶级。"},{"english":"But the mystique that surrounded the terrorist chieftain in life is persisting in death.","chinese":"但是围绕这位恐怖主义首领一生的谜团却并未解开。"},{"english":"They plopped each turtle into a small pool surrounded by magnetic coils.","chinese":"他们把每个海龟放进有磁线圈围绕的小池子里。"},{"english":"The main topic of this paper is about steel pipe strapping machine.","chinese":"本论文主要是围绕钢管打捆机研制开发进行的。"},{"english":"Development governance encompasses the software development lifecycle.","chinese":"开发治理围绕着软件开发生命周期。"},{"english":"And this article makes a simple discussion about our Foreign Trade system.","chinese":"本文即围绕我国外贸代理制度做出初步探讨。"},{"english":"A host of misunderstanding swirls around Francis Schaeffer's reputation today.","chinese":"今天有许多错误的理解围绕着薛华。"},{"english":"There are limits and acceptable behavior that surround the exercise of delegated authority.","chinese":"存在围绕实行委托权力的限制和可接受的行为。"},{"english":"Promotes the desired work culture around the Winning Ways of the IHG Hotels Group and the brand ethos.","chinese":"围绕洲际酒店集团的致胜之道的企业文化和品牌理念。"},{"english":"No, you can see them by poking around Google Maps .","chinese":"不，你可以看到他们的洪学智就是围绕谷歌地图。"},{"english":"This thesis is to analyze his theory of journalism occupation from the before-mentioned aspects.","chinese":"本文将围绕以上这几个方面来讨论他的新闻职业观。"},{"english":"The tape acts as ribbing that we will be sewing around.","chinese":"这条带子就像书的肋骨，帮助我们围绕它进行缝订。"},{"english":"Amid all the pomp and celebration, one of the darker aspects to the wedding was how thin she was too.","chinese":"围绕着盛况和庆典，美中不足的一点是，新娘太瘦了。"},{"english":"The act of turning or winding or folding around a central axis .","chinese":"围绕一个中心轴翻或绕或叠的动作。"}],"related":[{"definition":["to unfold\/to carry out\/to be in full swing\/to launch"],"pinyin":["zhan3 kai1"],"word":"展开"},{"definition":["to focus"],"pinyin":["ju4 jiao1"],"word":"聚焦"},{"definition":["core\/nucleus"],"pinyin":["he2 xin1"],"word":"核心"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推动"},{"definition":["theme\/subject"],"pinyin":["zhu3 ti2"],"word":"主题"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"构建"},{"definition":["important point\/main point\/focus\/key (project etc)\/to focus on\/to put the emphasis on","to recount (e.g. results of election)\/to re-evaluate"],"pinyin":["zhong4 dian3","chong2 dian3"],"word":"重点"},{"definition":["to rely on\/to depend on\/support"],"pinyin":["yi1 tuo1"],"word":"依托"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推进"},{"definition":["to stick closely to (a topic or theme etc)"],"pinyin":["jin3 kou4"],"word":"紧扣"},{"definition":["to put emphasis on\/to stress"],"pinyin":["zhuo2 zhong4"],"word":"着重"},{"definition":["leading\/dominant\/prevailing\/to lead\/to direct\/to dominate"],"pinyin":["zhu3 dao3"],"word":"主导"},{"definition":["to put effort into sth\/to try really hard"],"pinyin":["zhuo2 li4"],"word":"着力"},{"definition":["to concentrate\/to centralize\/to focus\/centralized\/concentrated\/to put together"],"pinyin":["ji2 zhong1"],"word":"集中"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引领"},{"definition":["to build\/to construct"],"pinyin":["gou4 zhu4"],"word":"构筑"}]}