{"definition":["PRC State Development and Planning Committee, set up 1998 to replace State Planning Committee 國家計劃委員會|国家计划委员会, replaced in 2003 by National Development and Reform Commission 國家發展和改革委員會|国家发展和改革委员会"],"pinyin":["Guo2 jia1 Fa1 zhan3 Ji4 hua4 Wei3 yuan2 hui4"],"traditional":["國家發展計劃委員會"],"rank":52912.0,"normalized_rank":0.7403075287171379,"fraction":1.0481193608686731e-7,"cumulative_fraction":0.9993197376898296,"word":"国家发展计划委员会","characters":[{"definition":["surname Guo","country\/nation\/state\/national\/CL:個|个[ge4]"],"pinyin":["Guo2","guo2"],"word":"国"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"},{"definition":["hair\/Taiwan pr. [fa3]","to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa4","fa1"],"word":"发"},{"definition":["to spread out\/to open up\/to exhibit\/to put into effect\/to postpone\/to prolong\/exhibition","surname Zhan"],"pinyin":["zhan3","Zhan3"],"word":"展"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"计"},{"definition":["to cut\/to slash\/to scratch (cut into the surface of sth)\/to strike (a match)","to row\/to paddle\/profitable\/worth (the effort)\/it pays (to do sth)","to delimit\/to transfer\/to assign\/to plan\/to draw (a line)\/stroke of a Chinese character"],"pinyin":["hua2","hua2","hua4"],"word":"划"},{"definition":["surname Wei","same as 逶 in 逶迤 winding, curved","to entrust\/to cast aside\/to shift (blame etc)\/to accumulate\/roundabout\/winding\/dejected\/listless\/committee member\/council\/end\/actually\/certainly"],"pinyin":["Wei3","wei1","wei3"],"word":"委"},{"definition":["person\/employee\/member"],"pinyin":["yuan2"],"word":"员"},{"definition":["to balance an account\/accountancy\/accounting","can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])"],"pinyin":["kuai4","hui4"],"word":"会"}],"containing_words":[],"sentences":[],"related":[{"definition":["State Economic and Trade Commission (SETC)"],"pinyin":["Guo2 jia1 Jing1 ji4 Mao4 yi4 Wei3 yuan2 hui4"],"word":"国家经济贸易委员会"},{"definition":["PRC State Planning Committee, abbr. for 國家計劃委員會|国家计划委员会[Guo2 jia1 Ji4 hua4 Wei3 yuan2 hui4]"],"pinyin":["Guo2 jia1 Ji4 Wei3"],"word":"国家计委"},{"definition":["PRC National Development and Reform Commission (NDRC), formed in 2003"],"pinyin":["Guo2 jia1 Fa1 zhan3 he2 Gai3 ge2 Wei3 yuan2 hui4"],"word":"国家发展和改革委员会"},{"definition":["Commission for Science, Technology and Industry for National Defense (COSTIND)\/abbr. to 國防科工委|国防科工委[Guo2 fang2 Ke1 Gong1 Wei3]"],"pinyin":["Guo2 fang2 Ke1 xue2 Ji4 shu4 Gong1 ye4 Wei3 yuan2 hui4"],"word":"国防科学技术工业委员会"},{"definition":["PRC State Planning Committee, set up in 1952, replaced in 1998 by State Development and Planning Committee 國家發展計劃委員會|国家发展计划委员会[Guo2 jia1 Fa1 zhan3 Ji4 hua4 Wei3 yuan2 hui4] then in 2003 by National Development and Reform Commission 國家發展和改革委員會|国家发展和改革委员会[Guo2 jia1 Fa1 zhan3 he2 Gai3 ge2 Wei3 yuan2 hui4]"],"pinyin":["Guo2 jia1 Ji4 hua4 Wei3 yuan2 hui4"],"word":"国家计划委员会"},{"definition":["PRC National Development and Reform Commission"],"pinyin":["Guo2 jia1 Fa1 zhan3 Gai3 ge2 Wei3"],"word":"国家发展改革委"},{"definition":["(PRC) State Environmental Protection Administration (SEPA), former incarnation (until 2008) of 環境保護部|环境保护部[Huan2 jing4 Bao3 hu4 bu4]"],"pinyin":["Guo2 jia1 Huan2 bao3 Zong3 ju2"],"word":"国家环保总局"},{"definition":["State Council (PRC)\/State Department (USA)"],"pinyin":["Guo2 wu4 yuan4"],"word":"国务院"},{"definition":["State-owned Assets Supervision and Administration Commission of State Council (SASAC)\/abbr. to 國資委|国资委[Guo2 Zi1 Wei3]"],"pinyin":["Guo2 wu4 yuan4 Guo2 you3 Zi1 chan3 Jian1 du1 Guan3 li3 Wei3 yuan2 hui4"],"word":"国务院国有资产监督管理委员会"},{"definition":["Ministry of Finance"],"pinyin":["Cai2 zheng4 bu4"],"word":"财政部"},{"definition":["Ministry of Land and Resources (MLR), formed in 1998"],"pinyin":["Guo2 tu3 Zi1 yuan2 bu4"],"word":"国土资源部"},{"definition":["Central Propaganda Department (abbr. for 中國共產黨中央委員會宣傳部|中国共产党中央委员会宣传部[Zhong1 guo2 Gong4 chan3 dang3 Zhong1 yang1 Wei3 yuan2 hui4 Xuan1 chuan2 bu4])"],"pinyin":["Zhong1 yang1 Xuan1 chuan2 bu4"],"word":"中央宣传部"},{"definition":["emergency aid committee (of PRC Ministry of Civil Affairs 民政部)"],"pinyin":["jiu4 zai1 jiu4 ji4 si1"],"word":"救灾救济司"},{"definition":["Ministry of Housing and Urban-Rural Development of the PRC (MOHURD)\/abbr. to 住建部[Zhu4 Jian4 bu4]"],"pinyin":["Zhu4 fang2 he2 Cheng2 xiang1 Jian4 she4 bu4"],"word":"住房和城乡建设部"},{"definition":["AQSIQ\/PRC State Administration of Quality Supervision, Inspection and Quarantine"],"pinyin":["Guo2 jia1 Zhi4 liang4 Jian1 du1 Jian3 yan4 Jian3 yi4 Zong3 ju2"],"word":"国家质量监督检验检疫总局"},{"definition":["Standing Committee of the National People's Congress"],"pinyin":["Quan2 guo2 Ren2 min2 Dai4 biao3 Da4 hui4 Chang2 wu4 Wei3 yuan2 hui4"],"word":"全国人民代表大会常务委员会"}]}