{"definition":["State Council (PRC)\/State Department (USA)"],"pinyin":["Guo2 wu4 yuan4"],"traditional":["國務院"],"rank":1265.0,"normalized_rank":0.017698991227456527,"fraction":0.00012806967550901778,"cumulative_fraction":0.6577724888273438,"word":"国务院","characters":[{"definition":["surname Guo","country\/nation\/state\/national\/CL:個|个[ge4]"],"pinyin":["Guo2","guo2"],"word":"国"},{"definition":["affair\/business\/matter\/to be engaged in\/to attend to\/by all means"],"pinyin":["wu4"],"word":"务"},{"definition":["courtyard\/institution\/CL:個|个[ge4]"],"pinyin":["yuan4"],"word":"院"}],"containing_words":[{"definition":["State Council Information Office of the People's Republic of China"],"pinyin":["Guo2 wu4 yuan4 Xin1 wen2 Ban4 gong1 shi4"],"word":"国务院新闻办公室"},{"definition":["Taiwan Affairs Office"],"pinyin":["Guo2 wu4 yuan4 Tai2 wan1 Shi4 wu4 Ban4 gong1 shi4"],"word":"国务院台湾事务办公室"},{"definition":["State-owned Assets Supervision and Administration Commission of State Council (SASAC)\/abbr. to 國資委|国资委[Guo2 Zi1 Wei3]"],"pinyin":["Guo2 wu4 yuan4 Guo2 you3 Zi1 chan3 Jian1 du1 Guan3 li3 Wei3 yuan2 hui4"],"word":"国务院国有资产监督管理委员会"},{"definition":["State Council Legislative Affairs Bureau (PRC)"],"pinyin":["Guo2 wu4 yuan4 Fa3 zhi4 ju2"],"word":"国务院法制局"},{"definition":["Hong Kong and Macao Affairs Office of the State Council"],"pinyin":["Guo2 wu4 yuan4 Gang3 Ao4 Shi4 wu4 Ban4 gong1 shi4"],"word":"国务院港澳事务办公室"},{"definition":["US Department of State"],"pinyin":["Mei3 guo2 Guo2 wu4 yuan4"],"word":"美国国务院"}],"sentences":[{"english":"Environmental protection departments under the State Council shall be held responsible for the interpretation of This Bylaw .","chinese":"本细则由国务院环境保护部门负责解释。"},{"english":"Is the artist at the national level, enjoy State Council special benefit.","chinese":"系国家一级美术师，享受国务院特殊津贴。"},{"english":"For registered mail, compensation shall be made according to standard amounts formulated by the competent department of postal services under the State Council.","chinese":"挂号信件，按照国务院邮政主管部门规定的金额赔偿。"},{"english":"The state Department approved Shenzhen city to be a coastal, economic open zone.","chinese":"国务院批准深圳为沿海经济开放城市。"},{"english":"The State Department is simply not equipped to handle interdepartmental machinery.","chinese":"国务院根本不具备驾驭部际机构的能力。"},{"english":"Tense negotiations were under way in the State Department conference room.","chinese":"在国务院会议厅里，正进行着激烈的协商。"},{"english":"Article 32. Environmental protection departments under the State Council shall be held responsible for the interpretation of This Bylaw .","chinese":"第三十二条本细则由国务院环境保护部门负责解释。"},{"english":"He is a national important contribution expert and is granted a Special Allowance from the State Council.","chinese":"国家级有突出贡献专家，国务院特殊津贴获得者。"},{"english":"In 2005, he was approved to receive the State Council special allowance.","chinese":"2005年被批准享受国务院特殊津贴。"},{"english":"Jiang Zhigang was appointed Vice-Chairman of State-owned Assets Supervision and Administration.","chinese":"姜志刚任国务院国有资产监督管理委员会副主任。"},{"english":"Article 7 The department of finance under the State Council shall administer the accounting work throughout the country.","chinese":"第七条国务院财政部门主管全国的会计工作。"},{"english":"Feng Fei, department director of Industrial Economy in Development Research Center of the State Council, told the reporter.","chinese":"国务院发展研究中心产业经济部部长冯飞告诉记者。"},{"english":"e.other expenses relating to unemployment insurance stipulated or approved by the State Council.","chinese":"国务院规定或者批准的与失业保险有关的其他费用。"},{"english":"State Council held a picturephone meeting on developing recycling economy.","chinese":"昨天下午，国务院召开发展循环经济电视电话会议。"},{"english":"The super transport ministry has been established in the super ministry reform of the State Council recently.","chinese":"近期国务院实行了大部制改革，成立了大交通部。"},{"english":"August 27, 1982, approved by the State Council officially open ports.","chinese":"1982年8月27日，经国务院批准口岸正式开放。"}],"related":[{"definition":["to publish\/to print and distribute"],"pinyin":["yin4 fa1"],"word":"印发"},{"definition":["Ministry of Land and Resources (MLR), formed in 1998"],"pinyin":["Guo2 tu3 Zi1 yuan2 bu4"],"word":"国土资源部"},{"definition":["Central Committee of the Communist Party of China, abbr. for 中國共產黨中央委員會|中国共产党中央委员会[Zhong1 guo2 Gong4 chan3 dang3 Zhong1 yang1 Wei3 yuan2 hui4]"],"pinyin":["Zhong1 Gong4 Zhong1 yang1"],"word":"中共中央"},{"definition":["party central committee"],"pinyin":["dang3 zhong1 yang1"],"word":"党中央"},{"definition":["General Office of the Central Committee of the CCP, responsible for technical and logistical matters relating to the Central Committee\/abbr. to 中辦|中办[Zhong1 Ban4]"],"pinyin":["Zhong1 Gong4 Zhong1 yang1 Ban4 gong1 ting1"],"word":"中共中央办公厅"},{"definition":["Department of Trade\/Department of Commerce"],"pinyin":["Shang1 wu4 bu4"],"word":"商务部"},{"definition":["Ministry of Finance"],"pinyin":["Cai2 zheng4 bu4"],"word":"财政部"},{"definition":["PRC National Development and Reform Commission"],"pinyin":["Guo2 jia1 Fa1 zhan3 Gai3 ge2 Wei3"],"word":"国家发展改革委"},{"definition":["PRC National Development and Reform Commission (NDRC), formed in 2003"],"pinyin":["Guo2 jia1 Fa1 zhan3 he2 Gai3 ge2 Wei3 yuan2 hui4"],"word":"国家发展和改革委员会"},{"definition":["to reply officially to a subordinate"],"pinyin":["pi1 fu4"],"word":"批复"},{"definition":["Standing Committee of the National People's Congress (abbr. of 全國人民代表大會常務委員會|全国人民代表大会常务委员会)"],"pinyin":["Quan2 guo2 Ren2 Da4 Chang2 Wei3 hui4"],"word":"全国人大常委会"},{"definition":["abbr. for 國家發展和改革委員會|国家发展和改革委员会, PRC National Development and Reform Commission (NDRC), formed in 2003"],"pinyin":["Fa1 gai3 wei3"],"word":"发改委"},{"definition":["abbr. for 全國人大會議|全国人大会议[Quan2 guo2 Ren2 Da4 hui4 yi4], National People's Congress (NPC)"],"pinyin":["Quan2 guo2 Ren2 Da4"],"word":"全国人大"},{"definition":["Ministry of Civil Affairs (MCA) of the PRC"],"pinyin":["Min2 zheng4 bu4"],"word":"民政部"},{"definition":["to approve\/to ratify"],"pinyin":["pi1 zhun3"],"word":"批准"},{"definition":["ministries and commissions"],"pinyin":["bu4 wei3"],"word":"部委"}]}