{"definition":["Tujia ethnic group of Hunan"],"pinyin":["Tu3 jia1 zu2"],"traditional":["土家族"],"rank":28100.0,"normalized_rank":0.393155457305556,"fraction":0.000001117166778374367,"cumulative_fraction":0.988293134296916,"word":"土家族","characters":[{"definition":["Tu (ethnic group)\/surname Tu","earth\/dust\/clay\/local\/indigenous\/crude opium\/unsophisticated\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Tu3","tu3"],"word":"土"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"},{"definition":["race\/nationality\/ethnicity\/clan\/by extension, social group (e.g. office workers 上班族)"],"pinyin":["zu2"],"word":"族"}],"containing_words":[{"definition":["Xiangxi Tujia and Miao autonomous prefecture in northwest Hunan, capital Jishou 吉首"],"pinyin":["Xiang1 xi1 Tu3 jia1 zu2 Miao2 zu2 zi4 zhi4 zhou1"],"word":"湘西土家族苗族自治州"},{"definition":["Enshi Tujia and Miao autonomous prefecture in Hubei"],"pinyin":["En1 shi1 Tu3 jia1 zu2 Miao2 zu2 zi4 zhi4 zhou1"],"word":"恩施土家族苗族自治州"},{"definition":["Changyang Tujia Autonomous County in Hubei"],"pinyin":["Chang2 yang2 Tu3 jia1 zu2 Zi4 zhi4 xian4"],"word":"长阳土家族自治县"},{"definition":["Wufeng Tujia Autonomous County in Hubei"],"pinyin":["Wu3 feng1 Tu3 jia1 zu2 Zi4 zhi4 xian4"],"word":"五峰土家族自治县"},{"definition":["Yanhe Tujia autonomous county in Tongren prefecture 銅仁地區|铜仁地区[Tong2 ren2 di4 qu1], Guizhou"],"pinyin":["Yan2 he2 Tu3 jia1 zu2 Zi4 zhi4 xian4"],"word":"沿河土家族自治县"},{"definition":["Youyang Miao and Tujia autonomous county in Qianjiang suburbs of Chongqing municipality"],"pinyin":["You3 yang2 Tu3 jia1 zu2 Miao2 zu2 Zi4 zhi4 xian4"],"word":"酉阳土家族苗族自治县"},{"definition":["Pengshui Miao and Tujia autonomous county in Qianjiang suburbs of Chongqing municipality"],"pinyin":["Peng2 shui3 Miao2 zu2 Tu3 jia1 zu2 Zi4 zhi4 xian4"],"word":"彭水苗族土家族自治县"},{"definition":["Shizhu Tujia Autonomous County in Qianjiang suburbs of Chongqing municipality"],"pinyin":["Shi2 zhu4 Tu3 jia1 zu2 Zi4 zhi4 xian4"],"word":"石柱土家族自治县"},{"definition":["Xiushan Miao and Tujia autonomous county in Qianjiang suburbs of Chongqing municipality"],"pinyin":["Xiu4 shan1 Tu3 jia1 zu2 Miao2 zu2 Zi4 zhi4 xian4"],"word":"秀山土家族苗族自治县"},{"definition":["Yinjiang Tujia and Hmong autonomous county in Tongren prefecture 銅仁地區|铜仁地区[Tong2 ren2 di4 qu1], Guizhou"],"pinyin":["Yin4 jiang1 Tu3 jia1 zu2 Miao2 zu2 Zi4 zhi4 xian4"],"word":"印江土家族苗族自治县"}],"sentences":[{"english":"The flesh-patting dance (Rou Lianxiang) in West part of Hubei is closely related to Buddhism.","chinese":"鄂西土家族民间舞蹈肉连响与佛教关系密切。"},{"english":"Fenghuang is a habitat area of Chinese minorities, ethnic Miao and Tujia.","chinese":"凤凰是土家族和苗族的居住区。"},{"english":"I had heard about the Tujia before, but new next to nothing about them.","chinese":"我先前听说过土家族，但对他们几乎一无所知。"},{"english":"Tujia ethnic group in Hubei mainly lives in the compact communities of Wuling mountain area.","chinese":"湖北土家族长期聚居在鄂西武陵山区。"},{"english":"Song of Tima is a glorious epic of Tujia.","chinese":"《梯玛神歌》是一部辉煌的土家族历史史诗。"},{"english":"Tima has played an important role in the history of Tujia society.","chinese":"梯玛在土家族社会历史中具有重要作用。"},{"english":"Phoenix city since ancient times has been the areas inhabited by the Miao and Tujia.","chinese":"凤凰古城自古以来就一直是苗族和土家族的聚居地区。"},{"english":"The funerals in the regions of Tujia Nationality are often accompanied with drum music and dance.","chinese":"土家族地区的丧葬习俗，常和鼓乐同在，与歌舞同存。"},{"english":"In 1984, approved by the State Council, a local government was finally established.","chinese":"1984年，经国务院批准设立长阳土家族自治县。"},{"english":"Chinese culture is brilliant, and Tujia Minority Medicine is also in long history.","chinese":"汉文化灿烂辉煌，土家族医药渊源流长。"}],"related":[{"definition":["Hmong or Miao ethnic group of southwest China"],"pinyin":["Miao2 zu2"],"word":"苗族"},{"definition":["Gelao or Klau ethnic group of Guizhou"],"pinyin":["Ge1 lao3 zu2"],"word":"仡佬族"},{"definition":["Yao ethnic group of southwest China and southeast Asia"],"pinyin":["Yao2 zu2"],"word":"瑶族"},{"definition":["Zhuang ethnic group of Guangxi, the PRC's second most numerous ethnic group"],"pinyin":["Zhuang4 zu2"],"word":"壮族"},{"definition":["Yi ethnic group"],"pinyin":["Yi2 zu2"],"word":"彝族"},{"definition":["Maonan ethnic group of Guangxi"],"pinyin":["Mao2 nan2 zu2"],"word":"毛南族"},{"definition":["Hani ethnic group"],"pinyin":["Ha1 ni2 zu2"],"word":"哈尼族"},{"definition":["Wa, Kawa or Va ethnic group of Myanmar, south China and southeast Asia"],"pinyin":["Wa3 zu2"],"word":"佤族"},{"definition":["Buyei ethnic group"],"pinyin":["Bu4 yi1"],"word":"布依"},{"definition":["Jingpo ethnic group of Tibet and Yunnan"],"pinyin":["Jing3 po1 zu2"],"word":"景颇族"},{"definition":["Nakhi ethnic group in Yunnan"],"pinyin":["Na4 xi1 zu2"],"word":"纳西族"},{"definition":["Mulao ethnic group of Guangxi"],"pinyin":["Mu4 lao3 zu2"],"word":"仫佬族"},{"definition":["Jinuo ethnic group"],"pinyin":["Ji1 nuo4 zu2"],"word":"基诺族"},{"definition":["Pumi ethnic group"],"pinyin":["Pu3 mi3 zu2"],"word":"普米族"},{"definition":["Lisu ethnic group of Yunnan"],"pinyin":["Li4 su4 zu2"],"word":"傈僳族"},{"definition":["Bai (ethnic group)"],"pinyin":["Bai2 zu2"],"word":"白族"}]}