{"definition":["to be in\/to lie in\/to consist in\/to depend on\/to rest with"],"pinyin":["zai4 yu2"],"traditional":["在於"],"rank":1527.0,"normalized_rank":0.02136471114966491,"fraction":0.00010476493129101776,"cumulative_fraction":0.6880798135267423,"word":"在于","characters":[{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"},{"definition":["surname Yu","to go\/to take\/sentence-final interrogative particle\/variant of 於|于[yu2]","in\/at\/to\/from\/by\/than\/out of"],"pinyin":["Yu2","yu2","yu2"],"word":"于"}],"containing_words":[{"definition":["the whole year must be planned for in the spring (idiom)\/early planning is the key to success"],"pinyin":["yi1 nian2 zhi1 ji4 zai4 yu2 chun1"],"word":"一年之计在于春"},{"definition":["make your day's plan early in the morning (idiom)\/early morning is the golden time of the day"],"pinyin":["yi1 ri4 zhi1 ji4 zai4 yu2 chen2"],"word":"一日之计在于晨"},{"definition":["the problem is..."],"pinyin":["kun4 nan2 zai4 yu2"],"word":"困难在于"},{"definition":["life is motion (popular saying with many possible interpretations)\/Physical effort is vital for our bodies to function (Aristotle).\/Life derives from physical exercise."],"pinyin":["sheng1 ming4 zai4 yu2 yun4 dong4"],"word":"生命在于运动"}],"sentences":[{"english":"The main difficulty of off-line handwritten signature verification is feature extraction.","chinese":"离线手写签名鉴别的主要困难在于签名特征的提取。"},{"english":"The fear of the Lord, which is the beginning of wisdom, consists in a complete devotion to God.","chinese":"敬畏耶和华是智慧的开端，是在于完全委身于神。"},{"english":"Case of the table with the biggest difference is that dioica and face.","chinese":"案，案与桌的最大不同，在于腿子和面的关系。"},{"english":"One of the disadvantages of the phenothiazines is their potential for dystonic effects.","chinese":"吩噻嗪类药物弊端在于其潜在的张力不能反应。"},{"english":"It aims to improve the useability of sensor uncertain data stream and gain more information from it.","chinese":"目的在于从不确定传感器数据流中获得更多有用信息。"},{"english":"The reason flu keeps infecting us again and again is that the virus is constantly changing.","chinese":"流感能够反复感染我们的原因在于病毒的不断变化。"},{"english":"The only difference is that government's shares would be nonvoting until the government sold the shares at a later date.","chinese":"唯一的区别就在于政府在出售股票之前不具有表决权。"},{"english":"The key to following your heart is to learn to deal with fear.","chinese":"要做到心随所愿，秘诀在于学会克服恐惧。"},{"english":"All of this with only natural talent.","chinese":"所有这一切只在于他的自然天赋。"},{"english":"The advantage of Microsoft's method is that it works better for on-screen reading.","chinese":"微软的做法的好处在于它更利于屏幕阅读。"},{"english":"The problem with technological predictions is that they are almost always solution-driven.","chinese":"技术预测的问题在于，这种预测总是受解决方法驱使。"},{"english":"And so the only two differences are, right there, and there versus here and here.","chinese":"因此这两块代码的不同之处，就仅仅在于位置不同了。"},{"english":"The answer to the question, I think, gets at the very heart of the meaning of this elegy.","chinese":"问题的答案，在于这首挽歌的中心意义。"},{"english":"The grip cover lies directly over the hammering end of the tool.","chinese":"抓地力覆盖在于直接在锤打结束工具。"},{"english":"Now whether or not any of this is true, believe me, is neither here nor there.","chinese":"不管这些正确与否，相信我，关键不在于此。"},{"english":"A big sticking point will be Merkel's insistence on renegotiating the Lisbon treaty.","chinese":"目前的关键在于默克尔坚持要修订里斯本条约。"}],"related":[{"definition":["itself\/in itself\/per se"],"pinyin":["ben3 shen1"],"word":"本身"},{"definition":["characteristic (feature)\/trait\/feature\/CL:個|个[ge4]"],"pinyin":["te4 dian3"],"word":"特点"},{"definition":["is\/are\/am\/yes\/to be","variant of 是[shi4]\/(used in given names)"],"pinyin":["shi4","shi4"],"word":"是"},{"definition":["actually\/in fact\/really"],"pinyin":["qi2 shi2"],"word":"其实"},{"definition":["place\/location\/(after a noun) place where it is located"],"pinyin":["suo3 zai4"],"word":"所在"},{"definition":["difference\/to distinguish\/to discriminate\/to make a distinction\/CL:個|个[ge4]"],"pinyin":["qu1 bie2"],"word":"区别"},{"definition":["essence\/nature\/innate character\/intrinsic quality"],"pinyin":["ben3 zhi4"],"word":"本质"},{"definition":["rather"],"pinyin":["er2 shi4"],"word":"而是"},{"definition":["(emphasizes that sth is precisely or exactly as stated)\/precisely\/exactly\/even\/if\/just like\/in the same way as"],"pinyin":["jiu4 shi4"],"word":"就是"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"体现"},{"definition":["immediately\/at once"],"pinyin":["zhe4 jiu4"],"word":"这就"},{"definition":["crucial point\/crux\/CL:個|个[ge4]\/key\/crucial\/pivotal"],"pinyin":["guan1 jian4"],"word":"关键"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["in simple terms\/to put things simply\/briefly"],"pinyin":["jian3 yan2 zhi1"],"word":"简言之"},{"definition":["in fact\/in reality\/actually\/as a matter of fact\/de facto\/ipso facto"],"pinyin":["shi4 shi2 shang4"],"word":"事实上"},{"definition":["in fact\/in reality\/as a matter of fact\/in practice"],"pinyin":["shi2 ji4 shang4"],"word":"实际上"}]}