{"definition":["(included) in it\/among them"],"pinyin":["zai4 nei4"],"traditional":["在內"],"rank":1830.0,"normalized_rank":0.02560407426580667,"fraction":0.00008492584191234686,"cumulative_fraction":0.7167115103878313,"word":"在内","characters":[{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"},{"definition":["inside\/inner\/internal\/within\/interior"],"pinyin":["nei4"],"word":"内"}],"containing_words":[],"sentences":[{"english":"All their costs, including study and living expenses, will be covered by the fund.","chinese":"包括通信费在内的大部分支出，都会由公司支付。"},{"english":"They also take into consideration the difficulty of the shot.","chinese":"镜头的易度果艳也会斟酌在内。"},{"english":"In other words polarization properties are excluded.","chinese":"换句话说，偏振性质未包括在内。"},{"english":"20 the lampstands of pure gold with their lamps, to burn in front of the inner sanctuary as prescribed;","chinese":"并精金的灯台和灯盏，可以照例点在内殿前。"},{"english":"Counseling or interjecting personal opinion is never permitted.","chinese":"翻译过程中不许掺杂译者的个人观点在内。"},{"english":"There are six people in my family counting my grandfather and grandmother.","chinese":"我家里连祖父母算在内有六口人。"},{"english":"With Meher Baba's great love in our hearts, external disasters can't harm us.","chinese":"有美赫巴巴之大恋爱藏在内心中，无外灾可伤害。"},{"english":"I tend to extend the vernacular to include the owner of the software asset, such that","chinese":"我打算扩展包括软件资源拥有者在内的这些概念。"},{"english":"Requests for essential supplies, including diagnostic reagents, are being met.","chinese":"正在满足对包括诊断试剂在内的基本用品的要求。"},{"english":"Websites including Gawker have reported on the site.","chinese":"包括Gawker在内的多家网都对此进行了报道。"},{"english":"Do not violate third-party intellectual property rights, including copyrights and trademarks.","chinese":"请勿侵害包括版权，商标在内的第三方知识产权。"},{"english":"The dilemma is that not one single country within the EU is below the 3% limit, not even Germany.","chinese":"事实是包括德国在内，没有一个国家刺字低于3%。"},{"english":"The men, who included four guards, were injured by rubber bullets and machetes.","chinese":"包括4名警卫在内的伤者因橡胶弹和大砍刀而受伤。"},{"english":"Sadly, video files are not on the list of accepted formats.","chinese":"遗憾的是，视频文件不包含在内。"},{"english":"You have to take capital appreciation of the property into account.","chinese":"你必须将该处房产的资本增值考虑在内。"},{"english":"None of us, including the veteran comrades, is sufficiently capable of directing modern wars.","chinese":"指挥现代化战争，包括我们老同志在内，能力都不够。"}],"related":[{"definition":["to comprise\/to include\/to involve\/to incorporate\/to consist of"],"pinyin":["bao1 kuo4"],"word":"包括"},{"definition":["as well as\/too\/and"],"pinyin":["yi3 ji2"],"word":"以及"},{"definition":["class\/rank\/grade\/equal to\/same as\/to wait for\/to await\/et cetera\/and so on\/et al. (and other authors)\/after\/as soon as\/once"],"pinyin":["deng3"],"word":"等"},{"definition":["to include\/to embrace\/to bring together"],"pinyin":["nang2 kuo4"],"word":"囊括"},{"definition":["among\/in\/included among these"],"pinyin":["qi2 zhong1"],"word":"其中"},{"definition":["besides\/in addition\/moreover\/furthermore"],"pinyin":["ci3 wai4"],"word":"此外"},{"definition":["(various things) such as\/such as (the following)"],"pinyin":["zhu1 ru2"],"word":"诸如"},{"definition":["to cover\/to comprise\/to include"],"pinyin":["han2 gai4"],"word":"涵盖"},{"definition":["outside\/excluding"],"pinyin":["zhi1 wai4"],"word":"之外"},{"definition":["apart from\/other than\/except for\/external\/outside of\/on the other side of\/beyond"],"pinyin":["yi3 wai4"],"word":"以外"},{"definition":["apart from this\/in addition to this"],"pinyin":["chu2 ci3 zhi1 wai4"],"word":"除此之外"},{"definition":["the rest\/the others\/remaining\/remainder\/apart from them"],"pinyin":["qi2 yu2"],"word":"其余"},{"definition":["to contain\/to embody\/to include"],"pinyin":["bao1 han2"],"word":"包含"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["at the same time\/meanwhile"],"pinyin":["yu3 ci3 tong2 shi2"],"word":"与此同时"},{"definition":["other\/the others\/else\/other than it\/in addition to the thing mentioned above"],"pinyin":["qi2 ta1"],"word":"其它"}]}