{"definition":["to be present\/to be on the scene"],"pinyin":["zai4 chang3"],"traditional":["在場"],"rank":2980.0,"normalized_rank":0.041694066290767134,"fraction":0.00004829786566828515,"cumulative_fraction":0.7897593853447807,"word":"在场","characters":[{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"},{"definition":["threshing floor\/classifier for events and happenings: spell, episode, bout","large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","variant of 場|场[chang2]","variant of 場|场[chang3]"],"pinyin":["chang2","chang3","chang2","chang3"],"word":"场"}],"containing_words":[],"sentences":[{"english":"But the alibi did not hold up long.","chinese":"但是，不在场证明没坚持多久。"},{"english":"Many of those present felt this atavistic fear.","chinese":"在场的那些人中，很多都感到这种隔代遗传的恐惧。"},{"english":"Bao-chai seemed interested in the fact that Bao-yu was there.","chinese":"宝钗似乎对宝玉当时在场这件事更感兴趣。"},{"english":"Some of them are here this evening, and a few will even join us onstage.","chinese":"他们有些今晚也在场，有几位更会上台与大家见面。"},{"english":"She gets very skittish when her boy - friend is around.","chinese":"她男朋友在场时，她就显得格外轻佻。"},{"english":"The guests are all present .","chinese":"他的发言冲犯了在场的所有人。"},{"english":"I found a person who watched with him, and was present at his burial.","chinese":"我找到一个一直陪着他的人，葬礼的时候也在场。"},{"english":"Daniel Wong gave a smile – a sophisticate smilethat inspired the reporters.","chinese":"黄博士脸上露出的一丝深沉的微笑启迪了在场记者。"},{"english":"Missandei and plenty of Dothraki soldiers will also be on hand.","chinese":"弥桑黛和大批多斯拉克士兵也会在场。"},{"english":"You can ask our administrator here (Antonio Giraudo).","chinese":"你可以问在场的吉拉乌多。"},{"english":"His plea unimpressed the vast majority of shareholders present.","chinese":"他的请求未能使在场的大多数股东动心。"},{"english":"The police are suspicious of his alibi because he already has a record.","chinese":"警方对他不在场的辩解表示怀疑，因为他已有前科。"},{"english":"This excludes several hundred round-table meetings where numerous companies were present.","chinese":"这还没有包括数百次有多家公司代表在场的圆桌会议。"},{"english":"The audience were greatly impressed and many of them moved to tears.","chinese":"在场观众深受感染，有人不禁落泪。"},{"english":"You were not by, when I told mamma and the others all about it.","chinese":"我跟妈妈和别的姐姐们讲的时候，你都不在场。"},{"english":"He even tells all the audiences present in the venue what allures him.","chinese":"他甚至是告诉了所有在场者，他著迷的是什么。"}],"related":[{"definition":["on stage\/to go on stage\/to take the field"],"pinyin":["shang4 chang3"],"word":"上场"},{"definition":["stadium\/playing field for a competition"],"pinyin":["bi3 sai4 chang3"],"word":"比赛场"},{"definition":["team member"],"pinyin":["dui4 yuan2"],"word":"队员"},{"definition":["(of a performer) to come onto the stage to perform\/(of an athlete) to enter the arena to compete\/(fig.) to enter the scene (e.g. a new product)\/(of an examinee etc) to leave the venue"],"pinyin":["chu1 chang3"],"word":"出场"},{"definition":["competition (sports etc)\/match\/CL:場|场[chang3],次[ci4]\/to compete"],"pinyin":["bi3 sai4"],"word":"比赛"},{"definition":["everyone present\/the whole audience\/across-the-board\/unanimously\/whole duration (of a competition or match)"],"pinyin":["quan2 chang3"],"word":"全场"},{"definition":["to show up\/present (at the scene)"],"pinyin":["dao4 chang3"],"word":"到场"},{"definition":["to attack\/to assault\/to go on the offensive\/attack\/assault\/offense (sports)"],"pinyin":["jin4 gong1"],"word":"进攻"},{"definition":["racetrack\/field (for athletics competition)"],"pinyin":["sai4 chang3"],"word":"赛场"},{"definition":["to dispose of\/to spend (money)\/to undertake a task"],"pinyin":["chu1 shou3"],"word":"出手"},{"definition":["to go on stage\/fig. to appear on the scene\/used in advertising to mean new product"],"pinyin":["deng1 chang3"],"word":"登场"},{"definition":["Paul"],"pinyin":["Bao3 luo2"],"word":"保罗"},{"definition":["tactics"],"pinyin":["zhan4 shu4"],"word":"战术"},{"definition":["(ball sports) good shot!\/nice hit!\/well played!"],"pinyin":["hao3 qiu2"],"word":"好球"},{"definition":["one of a sequence of contests (or subdivisions of a contest) between the same two opponents\/round (boxing etc)\/rally (tennis etc)\/frame (billiards etc)\/inning\/(tennis, soccer etc) rubber or leg\/round (of negotiations)"],"pinyin":["hui2 he2"],"word":"回合"},{"definition":["to defend\/to protect (against)"],"pinyin":["fang2 shou3"],"word":"防守"}]}