{"definition":["regional\/local"],"pinyin":["di4 qu1 xing4"],"traditional":["地區性"],"rank":21326.0,"normalized_rank":0.2983784086298322,"fraction":0.0000020905455942897307,"cumulative_fraction":0.9778020632580814,"word":"地区性","characters":[{"definition":["earth\/ground\/field\/place\/land\/CL:片[pian4]","-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct"],"pinyin":["di4","de5"],"word":"地"},{"definition":["surname Ou","area\/region\/district\/small\/distinguish\/CL:個|个[ge4]"],"pinyin":["Ou1","qu1"],"word":"区"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"FDI can promote the local industrial structure.","chinese":"FDI可以促进地区性产业结构实现高度化。"},{"english":"Regional institutions have already played a significant part in Asia’s evolution.","chinese":"地区性机构在亚洲的演变中已经发挥了重要作用。"},{"english":"The immigrants moved into the mountain area in northeast of Guangdong province and had regional difference.","chinese":"流民进入粤东北山区具有地区性的差异。"},{"english":"The government has used the crisis as an opportunity to accelerate regional infrastructure spending.","chinese":"政府转危为机，加速了地区性的基础设施支出。"},{"english":"Do U.S. bases in Okinawa help dampen regional arms spending?","chinese":"美国在冲绳的基地抑制了地区性的军需消费了吗？"},{"english":"Bendavid-Val, A. Chap. 7 in Regional and Local Economic Analysis for Practitioners.","chinese":"《针对业者之区域性与地区性经济分析》第七章。"},{"english":"She sued6 Harco Drugs, Inc. , the regional chain where the mistake was made.","chinese":"她起诉了造成错误的地区性连锁店哈克药品公司。"},{"english":"Taken as a whole, a regional cooperation mechanism is lacking.","chinese":"总的来说，地区性合作机制不成方圆。"},{"english":"We view ASEAN as a fulcrum for the region’s emerging regional architecture.","chinese":"我们把东盟看成是该地区新兴地区性架构的支点。"},{"english":"Both sides realized the importance of regional cooperation.","chinese":"双方认识到地区性合作的重要性。"},{"english":"The city is a regional command center for the Chinese military, one of seven in the country.","chinese":"济南是中国军队的地区性指挥中心，七大军区之一。"},{"english":"The cause seems to be a region-wide trend towards warmer winters and springs.","chinese":"这看来是地区性暖冬和暖春的趋势引起的。"},{"english":"The endemics actually are from a number of different marine groups.","chinese":"地区性实际上来自不同的海洋群。"},{"english":"The initiative will coordinate closely with local and regional efforts.","chinese":"该计划将密切配合地方及地区性努力。"},{"english":"This regional bloc has fallen apart.","chinese":"这一地区性集团已土崩瓦解。"},{"english":"Previous studies have linked regional income and education levels to well-being.","chinese":"先前的研究将其归因于地区性的经济收入和教育水平。"}],"related":[]}