{"definition":["Chinese foxglove (Rehmannia glutinosa), its rhizome used in TCM"],"pinyin":["di4 huang2"],"traditional":["地黃"],"rank":36776.0,"normalized_rank":0.5145439536608231,"fraction":5.171987319718256e-7,"cumulative_fraction":0.995043138887144,"word":"地黄","characters":[{"definition":["earth\/ground\/field\/place\/land\/CL:片[pian4]","-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct"],"pinyin":["di4","de5"],"word":"地"},{"definition":["surname Huang or Hwang","yellow\/pornographic\/to fall through"],"pinyin":["Huang2","huang2"],"word":"黄"}],"containing_words":[],"sentences":[{"english":"Dried rhizome of rehmannia and other herbs are also added.","chinese":"同时也会加一些干地黄和其他的草药。"},{"english":"Therefore, Dihuang Yinzi could shorten the latency time and increase the number of target quadrant.","chinese":"地黄饮子能缩短潜伏时间，增加经过目标象限次数。"},{"english":"She picked up a pink flower from a foxglove.","chinese":"她从毛地黄上斋了一朵港花。"},{"english":"Lack of an uniform index diagnosis of digitalis intoxication.","chinese":"缺乏统一的洋地黄中毒的诊断标准。"},{"english":"The doctor injected the patient with digitalis .","chinese":"医生给病人注入洋地黄。"},{"english":"Objective: To study the influence of Liuwei Dihuang Decoction against the thrombus.","chinese":"目的研究六味地黄汤及其配伍对血栓形成的影响。"},{"english":"Excessive loss of potassium in patients receiving cardiac glycosides may precipitate digitalis toxicity.","chinese":"过多的损失中钾的病人接受心苷可能沉淀洋地黄毒性。"},{"english":"Methods:Using TLC to identify Radix Rehmanniae and its Preparata.","chinese":"方法采用薄层色谱方法鉴别地黄及加工炮制品。"},{"english":"The traditional cultivated method of Rehmannia glutinosa is the asexual reproduction that small rhizomes are used as materials of reproduction.","chinese":"地黄传统种植方法是用小生地作种栽，进行无性繁殖。"},{"english":"ZBDHD can be used as a basic prescription to treat male infertility suffered from UU infection.","chinese":"知柏地黄丸可作为治疗UU感染性不育症的基本方。"},{"english":"CONCLUSION The validation method of Qiju Dihuang Pills for microbial limit should use culture dish method.","chinese":"结论可按平皿法对杞菊地黄丸进行微生物限度检查。"},{"english":"Conclusion The polysaccharide content in Liuwei Dihuang prescription with different dosage forms are obviously different.","chinese":"结论六味地黄方不同剂型中多糖含量具有一定的差异。"},{"english":"Digitalis, lithium toxicity.","chinese":"洋地黄，锂毒性。"},{"english":"Foxglove can cause heart failure.","chinese":"毛地黄会引起心脏衰竭。"},{"english":"Foxglove can calls hot cause heart failure.","chinese":"毛地黄可能会导致心力衰竭。"},{"english":"The dense extract and lactose were mixed fully, then granulate after vacuum drying.","chinese":"制粒方法为地黄稠浸膏与乳糖混匀，真空干燥后制粒。"}],"related":[{"definition":["Ningpo figwort (Scrophularia ningpoensis)\/root of Ningpo figwort (used in TCM)"],"pinyin":["xuan2 shen1"],"word":"玄参"},{"definition":["root bark of the peony tree (used in TCM)"],"pinyin":["mu3 dan5 pi2"],"word":"牡丹皮"},{"definition":["the rhizome of large-headed atractylodes (Atractylodes macrocephaia)"],"pinyin":["bai2 zhu2"],"word":"白术"},{"definition":["Wolfiporia extensa (a wood-decay fungus)\/fu ling\/tuckahoe"],"pinyin":["fu2 ling2"],"word":"茯苓"},{"definition":["King Solomon's seal (plant of genus Polygonatum)"],"pinyin":["huang2 jing1"],"word":"黄精"},{"definition":["Angelica sinensis"],"pinyin":["dang1 gui1"],"word":"当归"},{"definition":["Salvia miltiorrhiza"],"pinyin":["dan1 shen1"],"word":"丹参"},{"definition":["common water plantain (Alisma plantago-aquatica)\/water plantain rhizome (used in TCM)"],"pinyin":["ze2 xie4"],"word":"泽泻"},{"definition":["dodder (Cuscuta sinensis, a parasitic vine with seeds used in medicine)"],"pinyin":["tu4 si1 zi3"],"word":"菟丝子"},{"definition":["variant of 黃檗|黄檗[huang2 bo4]"],"pinyin":["huang2 bo4"],"word":"黄柏"},{"definition":["Achyranthes bidentata (root used in Chinese medicine)"],"pinyin":["niu2 xi1"],"word":"牛膝"},{"definition":["huangqi\/milk vetch root (used in TCM)\/Astragalus membranaceus or Astragalus mongholicus"],"pinyin":["huang2 qi2"],"word":"黄芪"},{"definition":["schizandra (Schisandra chinensis)\/Magnolia vine"],"pinyin":["wu3 wei4 zi3"],"word":"五味子"},{"definition":["root of herbaceous peony (Paeonia lactiflora), used in TCM"],"pinyin":["bai2 shao2"],"word":"白芍"},{"definition":["eucommia (a kind of rubber tree)"],"pinyin":["du4 zhong4"],"word":"杜仲"},{"definition":["the root bark of the peony tree"],"pinyin":["dan1 pi2"],"word":"丹皮"}]}