{"definition":["(literary) towns\/cities"],"pinyin":["cheng2 yi4"],"traditional":["城邑"],"rank":57762.0,"normalized_rank":0.8081653211702321,"fraction":5.751518498360128e-8,"cumulative_fraction":0.9997043307834936,"word":"城邑","characters":[{"definition":["city walls\/city\/town\/CL:座[zuo4],道[dao4],個|个[ge4]"],"pinyin":["cheng2"],"word":"城"},{"definition":["city\/village"],"pinyin":["yi4"],"word":"邑"}],"containing_words":[],"sentences":[{"english":"He led them by a straight way to a city where they could settle.","chinese":"又领他们行走直路，使他们往可居住的城邑。"},{"english":"And Benhadad hearkened unto king Asa, and sent the captains of his armies against the cities of Israel;","chinese":"便哈达听从亚撒王的话，派军长去攻击以色列的城邑。"},{"english":"Jousting Lists improve the quality of knights recruited here.","chinese":"枪术赛场提高城邑中骑兵部队的作战技巧。"},{"english":"Like a city breached; without walls, is one who lacks self—control.","chinese":"人不制伏自己的心，好像毁坏的城邑，没有城垣。"},{"english":"An Alchemists ' Guild house notably improves the experience level of gunpowder units trained in the same settlement.","chinese":"炼金大师行会明显提高城邑中火药部队的作战经验。"},{"english":"He removed the high places and incense altars in every town in Judah, and the kingdom was at peace under him.","chinese":"又在犹大各城邑除掉丘坛和日像，那时国享太平。"},{"english":"And all their cities, and their villages, and castles, they burned.","chinese":"火烧了他们所住的一切城邑和营寨。"},{"english":"What kind of towns are these you have given me, my brother?","chinese":"说，我兄阿，你给我的是什么城邑呢？"},{"english":"Like a city whose walls are broken down is a man who lacks self control .","chinese":"人不伏制自己的心，好像毁坏的城邑，没有墙垣。"},{"english":"Measures the fertility and barrenness of the earth, to decide where to build cities.","chinese":"要衡量土地的肥瘠来确定建立城邑。"},{"english":"There were fairly perfect supplies of water and drainages in the cities of Shang Dynasty.","chinese":"商代城邑已具有较完备的给排水设施。"},{"english":"Port allows a settlement to trade with the far-distant corners of the world.","chinese":"港口令城邑可与世界任何角落进行海路贸易。"},{"english":"And they smote all the cities round about Gerar;","chinese":"又打破基拉耳四围的城邑。"},{"english":"But as for the Israelites who were living in the towns of Judah, Rehoboam still ruled over them.","chinese":"惟独住犹大城邑的以色列人，罗波安仍作他们的王。"},{"english":"And upon Kerioth, and upon Bozrah, and upon all the cities of the land of Moab, far or near.","chinese":"加略，波斯拉，和摩押地远近所有的城邑。"},{"english":"The Alchemists ' Guild Headquarters greatly improves the experience level of gunpowder units trained in the same settlement.","chinese":"炼金行会总部显著提高城邑中火药部队的作战经验。"}],"related":[{"definition":["a city wall"],"pinyin":["cheng2 guo1"],"word":"城郭"},{"definition":["capital city"],"pinyin":["du1 cheng2"],"word":"都城"},{"definition":["vassal state"],"pinyin":["zhu1 hou2 guo2"],"word":"诸侯国"},{"definition":["grant of territory by an emperor or monarch (old)"],"pinyin":["feng1 yi4"],"word":"封邑"},{"definition":["the state of Chu, one of the most important of the small states contending for power in China between 770 and 223 BC, located around present-day Hubei"],"pinyin":["Chu3 guo2"],"word":"楚国"},{"definition":["vassal state"],"pinyin":["feng1 guo2"],"word":"封国"},{"definition":["army camp"],"pinyin":["ying2 lei3"],"word":"营垒"},{"definition":["feudal vassal\/feudal princes, esp. the monarchs (dukes or princes) of the several vassal states 諸侯國|诸侯国 of Zhou during Western Zhou and Spring and Autumn periods 11th-5th century BC\/subordinate warlord\/local official"],"pinyin":["zhu1 hou2"],"word":"诸侯"},{"definition":["Qi state of Western Zhou and the Warring states (1122-265 BC), centered in Shandong"],"pinyin":["Qi2 guo2"],"word":"齐国"},{"definition":["seat of the principal county magistrate in imperial China"],"pinyin":["jun4 zhi4"],"word":"郡治"},{"definition":["garrison\/soldier stationed in some place"],"pinyin":["tun2 shu4"],"word":"屯戍"},{"definition":["old name for Beijing 北京[Bei3 jing1]"],"pinyin":["Ji4 cheng2"],"word":"蓟城"},{"definition":["former capital\/ancient capital"],"pinyin":["gu4 du1"],"word":"故都"},{"definition":["country\/state"],"pinyin":["bang1 guo2"],"word":"邦国"},{"definition":["the Xirong, an ancient ethnic group of Western China from the Zhou Dynasty onwards\/Xionites (Central Asian nomads)"],"pinyin":["Xi1 rong2"],"word":"西戎"},{"definition":["to attack and seize"],"pinyin":["gong1 qu3"],"word":"攻取"}]}