{"definition":["foundation groove\/trench for building foundation"],"pinyin":["ji1 keng1"],"traditional":["基坑"],"rank":28877.0,"normalized_rank":0.404026695395464,"fraction":0.0000010405285242718522,"cumulative_fraction":0.9891309423769656,"word":"基坑","characters":[{"definition":["base\/foundation\/basic\/radical (chemistry)\/(slang) gay"],"pinyin":["ji1"],"word":"基"},{"definition":["variant of 坑[keng1]\/pit\/hole","hole\/pit\/tunnel\/to defraud"],"pinyin":["keng1","keng1"],"word":"坑"}],"containing_words":[],"sentences":[{"english":"This article aims to analyze various processing methods for groundwater excavation of the foundation ditch in earthwork construction.","chinese":"分析土方工程施工中基坑开挖地下水的各种处理办法。"},{"english":"In this paper, the excavation work of deep foundation pit for the north concrete anchor of south branch of Runyang Bridge is introduced.","chinese":"介绍了润扬大桥南汊北锚碇深基坑工程开挖实例。"},{"english":"Exemplary into about deep foundation pit bracing design methodology.","chinese":"专题部分为关于深基坑支护设计方法的研究。"},{"english":"In the end, some suggestions for the treatment scheme of confined water for the deep foundation pit were presented.","chinese":"最后，对基坑承压水的处理提出了一些建议。"},{"english":"The accumulative total displacements at the measuring points on the base top and pile top are somewhat high.","chinese":"基坑西侧支护体系的基顶和桩顶测点累计位移偏大。"},{"english":"The paper has adopted object function method and created optimization model of foundation ditch precipitation well cluster.","chinese":"采用目标函数法，建立基坑降水井群优化模型。"},{"english":"Bore-hole cast-in-place pile was filled outside the foundation pit.","chinese":"对于基坑外的部分，采用钻孔灌注桩补桩。"},{"english":"With the development of city construction, there are more and more deep foundation pit projects.","chinese":"随着城市建设的发展，深基坑工程增多。"},{"english":"So it becomes more important to study foundation ditch support in deep foundation pit projects.","chinese":"因此深基坑支护的研究越来越重要。"},{"english":"The South Anchor of Runyang bridge is a super-deep foundation pit.","chinese":"润扬大桥南锚工程为一大型深基坑工程。"},{"english":"Diaphragm wall is widely used as soil retaining structure in deep excavation in Shanghai.","chinese":"地下连续墙是上海地区深基坑的主要围护形式。"},{"english":"The paper states the design of the trestle protection of foundation pit of intercepting trunk in Longhugou regulation in Santou City.","chinese":"阐述汕头市龙湖沟整治中截污干管的基坑支护设计。"},{"english":"Prior to foundation pit excavation, the culvert section shall be prefabricated and carried to position.","chinese":"基坑开挖前涵节预制并按序运至工点摆放。"},{"english":"\"New two pipe method\"is a new way to stop the water in deep foundation pit.","chinese":"“新二管法”是一种新型的深基坑止水方法。"},{"english":"In order to construct conveniciently, the wells group was often used to reduce the underground water level.","chinese":"工程中常采用井群来降低基坑的地下水位，以便施工。"},{"english":"Therefore, the influence of unsteady seepage should be taken into account in the design of retaining wall.","chinese":"因此，在基坑支护设计中应该考虑非稳定渗流的影响。"}],"related":[{"definition":["open caisson"],"pinyin":["chen2 jing3"],"word":"沉井"},{"definition":["a cofferdam"],"pinyin":["wei2 yan4"],"word":"围堰"},{"definition":["to dig out\/to excavate\/to scoop out"],"pinyin":["kai1 wa1"],"word":"开挖"},{"definition":["to backfill"],"pinyin":["hui2 tian2"],"word":"回填"},{"definition":["face (mining)"],"pinyin":["zhang3 zi5 mian4"],"word":"掌子面"},{"definition":["excavated soil and rock\/construction spoil"],"pinyin":["tu3 shi2 fang1"],"word":"土石方"},{"definition":["building envelope"],"pinyin":["wei2 hu4 jie2 gou4"],"word":"围护结构"},{"definition":["construction\/to carry out construction or large-scale repairs"],"pinyin":["shi1 gong1"],"word":"施工"},{"definition":["foundation piles"],"pinyin":["ji1 zhuang1"],"word":"基桩"},{"definition":["brickwork"],"pinyin":["qi4 ti3"],"word":"砌体"},{"definition":["roof\/roof plate\/rock layer forming roof of a cave or mine\/abacus"],"pinyin":["ding3 ban3"],"word":"顶板"},{"definition":["abutment (architecture)"],"pinyin":["qiao2 tai2"],"word":"桥台"},{"definition":["vertical shaft (for mining, ventilation systems etc)"],"pinyin":["shu4 jing3"],"word":"竖井"},{"definition":["culvert pipe"],"pinyin":["han2 guan3"],"word":"涵管"},{"definition":["(civil engineering) cutting (for a railway or highway)"],"pinyin":["lu4 qian4"],"word":"路堑"},{"definition":["tube well"],"pinyin":["guan3 jing3"],"word":"管井"}]}