{"definition":["main key (of a musical composition)\/keynote (speech)"],"pinyin":["ji1 diao4"],"traditional":["基調"],"rank":10717.0,"normalized_rank":0.1499447343752186,"fraction":0.00000738354836667653,"cumulative_fraction":0.9353038993613888,"word":"基调","characters":[{"definition":["base\/foundation\/basic\/radical (chemistry)\/(slang) gay"],"pinyin":["ji1"],"word":"基"},{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["tiao2","diao4"],"word":"调"}],"containing_words":[],"sentences":[{"english":"It strikes a tone of irreverence and sarcasm that teenagers often appreciate.","chinese":"孩子们都喜欢广告里面那种不甚恭敬和讽刺的基调。"},{"english":"This tone has prevailed through subsequent commemorations and debates.","chinese":"这一基调在过去的纪念活动和辩论中成为主流。"},{"english":"When choosing actors, the Assistant Director needs to pay attention to the basic tone of the character.","chinese":"副导演挑选演员时需把握好上述人物基调。"},{"english":"Shimmery deep gold, with an opaque rusty brown base.","chinese":"不透明锈褐色基调上闪耀着深金色。"},{"english":"And pessimism, sarcasm or silence becomes the dominant style of family communications.","chinese":"而悲观，冷嘲热讽或沉默则成为家庭沟通的主基调。"},{"english":"The adornments do not cohere with the basic design.","chinese":"装饰物与设计的基调不协调。"},{"english":"Pearlescent pewter with turquoise shimmer over a charcoal base.","chinese":"在炭灰色基调上闪耀着珠光锡金与绿松石光芒。"},{"english":"I do a one hour very funny keynote called \"The Power of Partnerships\".","chinese":"我会做长达一小时的基调解说，叫“合作的力量”。"},{"english":"Tenor of discourse is the sub-field of Systemic Functional Linguistics.","chinese":"话语基调是系统功能语言学研究的领域。"},{"english":"The insertion that suckles white sofa changed approximately callous fundamental key.","chinese":"奶白色沙发的插入改变了近乎冷酷的基调。"},{"english":"The wedding breakfast scene take the red color as a main key, provides the self-service dining.","chinese":"喜宴现场以大红色为基调，提供自助餐饮。"},{"english":"This really provides the central rhetorical base for Milton's Lycidas.","chinese":"这为弥尔顿的《利西达斯》提供了行文基调。"},{"english":"When designing its space, the color of beige was widely employed to create a warm and harmonious tone.","chinese":"空间设计上大量运用米色，营造温暖与和谐的基调。"},{"english":"Then follows the “emotional tone” of the product.","chinese":"那么就请跟随产品的“感情基调”吧。"},{"english":"Ensure that the General Assembly adopt a resolution not less strong than those passed at the previous sessions.","chinese":"争取联大通过的决议基调不低于去年。"},{"english":"Ashton's new powerful bluetongue amplifiers set a new benchmark for tone and affordability.","chinese":"阿什顿的新的放大器确定一个新基调和音准。"}],"related":[{"definition":["main point of an argument\/a principal viewpoint"],"pinyin":["zhu3 diao4"],"word":"主调"},{"definition":["to set the tone"],"pinyin":["ding4 diao4"],"word":"定调"},{"definition":["hue\/tone"],"pinyin":["se4 diao4"],"word":"色调"},{"definition":["to make progress while ensuring stability"],"pinyin":["wen3 zhong1 qiu2 jin4"],"word":"稳中求进"},{"definition":["theme or subject (music)"],"pinyin":["zhu3 xuan2 lu:4"],"word":"主旋律"},{"definition":["theme\/subject"],"pinyin":["zhu3 ti2"],"word":"主题"},{"definition":["whole entity\/entire body\/synthesis\/as a whole (situation, construction, team etc)\/global\/macrocosm\/integral\/holistic\/whole"],"pinyin":["zheng3 ti3"],"word":"整体"},{"definition":["ambience\/atmosphere"],"pinyin":["fen1 wei2"],"word":"氛围"},{"definition":["tint\/coloring\/coloration\/(fig.) flavor\/character"],"pinyin":["se4 cai3"],"word":"色彩"},{"definition":["to rely mainly on\/to attach most importance to"],"pinyin":["wei2 zhu3"],"word":"为主"},{"definition":["style"],"pinyin":["feng1 ge2"],"word":"风格"},{"definition":["to implement\/to put into practice\/to carry out"],"pinyin":["guan4 che4"],"word":"贯彻"},{"definition":["to spread out bedding\/bedcover"],"pinyin":["pu1 dian4"],"word":"铺垫"},{"definition":["background\/backdrop\/context\/(fig.) powerful backer\/CL:種|种[zhong3]"],"pinyin":["bei4 jing3"],"word":"背景"},{"definition":["to continue\/to go on\/to last"],"pinyin":["yan2 xu4"],"word":"延续"},{"definition":["to build (housing)\/to construct\/to make"],"pinyin":["ying2 zao4"],"word":"营造"}]}