{"definition":["to subside\/to sink\/to cave in"],"pinyin":["ta1 xian4"],"traditional":["塌陷"],"rank":13661.0,"normalized_rank":0.19113511395911745,"fraction":0.000004882221730397322,"cumulative_fraction":0.9530207077556674,"word":"塌陷","characters":[{"definition":["to collapse\/to droop\/to settle down"],"pinyin":["ta1"],"word":"塌"},{"definition":["pitfall\/trap\/to get stuck\/to sink\/to cave in\/to frame (false charge)\/to capture (a city in battle)\/to fall (to the enemy)\/defect"],"pinyin":["xian4"],"word":"陷"}],"containing_words":[],"sentences":[{"english":"Ground collapse is a common geological hazard in shallow buried karst area.","chinese":"地面塌陷是浅埋岩溶区常见的一种地质灾害。"},{"english":"Collapse distribution centres on the intensive runoff zones.","chinese":"在地下水强径流带，塌陷分布较为密集。"},{"english":"Water inched its way up the steps as first as first-floor outside walls collapsed.","chinese":"当一楼外墙塌陷时水慢慢地沿着台阶漫了上来。"},{"english":"Collapse of mined-out area in coal mines is the chief geologic disaster in Shanxi Province.","chinese":"煤矿采空塌陷是山西省地质灾害的主要灾种。"},{"english":"With the technics of purdah infusion to stem water, surface sinking of large area can be prevented.","chinese":"采用帷幕注浆堵水工艺可防止大面积地表塌陷的发生。"},{"english":"In recent years, karst collapses have frequently occurred in Zaozhuang City.","chinese":"近年来枣庄市岩溶塌陷频繁发生。"},{"english":"Collapse of mined-out area is an environmental geological hazard of the coal mining area.","chinese":"采空区塌陷属于煤矿区的环境地质灾害问题。"},{"english":"People fled toward the Sumida River, drowning by the hundreds when bridges collapsed.","chinese":"人们都逃向隅田川，当桥塌陷时淹死了几百人。"},{"english":"Excavate coal subsided water area is the special component of the surface water in Huainan.","chinese":"采煤塌陷水域已成为淮南市矿区一种特殊的地表水体。"},{"english":"The ground gave in under the weight of the heavy car.","chinese":"地面在沉重的汽车的重压下塌陷了。"},{"english":"Rescue workers should know how to locate and search these voids .","chinese":"救援人员应知道如何定位和搜寻这些塌陷空腔。"},{"english":"Mining induced collapses are widely distributed at karst water filled mining areas in our country.","chinese":"采矿诱发的塌陷在我国岩溶充水矿区广泛分布。"},{"english":"The roadbed of a 300-metre section rail in Qianjiang city collapsed on Friday.","chinese":"星期五，潜江市300米长的铁路路基塌陷。"},{"english":"Eventually, the necrotic bone collapses, distorting the overlying articular cartilage and producing secondary osteoarthritis.","chinese":"骨塌陷，扭曲叠压关节软骨从而产生继发性骨关节炎。"},{"english":"The masonry facing of the embankment was destroyed seriously by stormy waves.","chinese":"围坝上游干砌石护坡在风浪淘刷下，发生严重塌陷。"},{"english":"Shuicheng County is one of the most serious karst collapse regions.","chinese":"水城是贵州最严重的岩溶塌陷区之一。"}],"related":[{"definition":["to subside\/subsidence"],"pinyin":["xia4 xian4"],"word":"下陷"},{"definition":["to collapse"],"pinyin":["tan1 ta1"],"word":"坍塌"},{"definition":["to cave in\/hollow\/sunken\/depressed"],"pinyin":["ao1 xian4"],"word":"凹陷"},{"definition":["to rupture\/to burst open\/to break up"],"pinyin":["beng1 lie4"],"word":"崩裂"},{"definition":["to crack\/cracked\/fissured\/creviced\/(of skin) chapped"],"pinyin":["jun1 lie4"],"word":"龟裂"},{"definition":["to collapse (of building, dam or bridge)"],"pinyin":["kua3 ta1"],"word":"垮塌"},{"definition":["to collapse (of building)\/to topple over"],"pinyin":["dao3 ta1"],"word":"倒塌"},{"definition":["hole\/pit\/pothole"],"pinyin":["keng1 dong4"],"word":"坑洞"},{"definition":["crack\/crevice\/CL:道[dao4]"],"pinyin":["lie4 feng4"],"word":"裂缝"},{"definition":["Shenkeng township in New Taipei City 新北市[Xin1 bei3 shi4], Taiwan"],"pinyin":["Shen1 keng1"],"word":"深坑"},{"definition":["to disintegrate\/to shatter into small pieces"],"pinyin":["sui4 lie4"],"word":"碎裂"},{"definition":["to rupture\/to burst\/to explode"],"pinyin":["bao4 lie4"],"word":"爆裂"},{"definition":["to split open"],"pinyin":["lie4 kai1"],"word":"裂开"},{"definition":["concave depression\/crater"],"pinyin":["ao1 keng1"],"word":"凹坑"},{"definition":["collapse"],"pinyin":["beng1 hui3"],"word":"崩毁"},{"definition":["talus slide\/to crumble (of scree slope)\/to collapse\/landslide"],"pinyin":["beng1 ta1"],"word":"崩塌"}]}