{"definition":["lit. a caged bird in a pavilion (idiom); fig. to lose vigilance by comfortable living\/unaware of the disasters ahead\/a fool's paradise"],"pinyin":["chu4 tang2 yan4 que4"],"traditional":["處堂燕雀"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"处堂燕雀","characters":[{"definition":["to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish","place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point"],"pinyin":["chu3","chu4"],"word":"处"},{"definition":["(main) hall\/large room for a specific purpose\/CL:間|间[jian1]\/relationship between cousins etc on the paternal side of a family\/of the same clan\/classifier for classes, lectures etc\/classifier for sets of furniture"],"pinyin":["tang2"],"word":"堂"},{"definition":["swallow (family Hirundinidae)\/old variant of 宴[yan4]","variant of 燕[yan4]","Yan, a vassal state of Zhou in modern Hebei and Liaoning\/north Hebei\/the four Yan kingdoms of the Sixteen Kingdoms, namely: Former Yan 前燕 (337-370), Later Yan 後燕|后燕 (384-409), Southern Yan 南燕 (398-410), Northern Yan 北燕 (409-436)\/surname Yan"],"pinyin":["yan4","yan4","Yan1"],"word":"燕"},{"definition":["a freckle\/lentigo","small bird\/sparrow\/also pr. [qiao3]"],"pinyin":["qiao1","que4"],"word":"雀"}],"containing_words":[],"sentences":[],"related":[{"definition":["person narrow-minded and shortsighted"],"pinyin":["dou3 shao1 zhi1 qi4"],"word":"斗筲之器"},{"definition":["to make endless exorbitant demands"],"pinyin":["zhu1 qiu2 wu2 yi3"],"word":"诛求无已"},{"definition":["lit. to wear one's coat inside out and carry firewood on one's back (idiom)\/fig. to live a life of poverty and hard work\/fig. to act stupidly"],"pinyin":["fan3 qiu2 fu4 chu2"],"word":"反裘负刍"},{"definition":["to jump into a well to rescue sb else (idiom); fig. to help others at the risk to oneself"],"pinyin":["cong2 jing3 jiu4 ren2"],"word":"从井救人"},{"definition":["has eyes but can't see (idiom); unable or unwilling to see the importance of sth\/blind (to sth great)"],"pinyin":["you3 mu4 wu2 du3"],"word":"有目无睹"},{"definition":["to think nothing of doing sth (idiom)\/to do sth without considering the risks\/to leave out of consideration"],"pinyin":["fu4 zhi1 du4 wai4"],"word":"付之度外"},{"definition":["to correct in the evening a fault of the morning (idiom)\/to quickly amend one's ways"],"pinyin":["zhao1 guo4 xi1 gai3"],"word":"朝过夕改"},{"definition":["to be set in one's ways (idiom)"],"pinyin":["kuang2 nu2 gu4 tai4"],"word":"狂奴故态"},{"definition":["lit. an ant trying to shake a tree\/to overrate oneself (idiom)"],"pinyin":["han4 shu4 pi2 fu2"],"word":"撼树蚍蜉"},{"definition":["Danger appears where many harmful factors exist. (idiom)"],"pinyin":["du4 zhong4 mu4 zhe2"],"word":"蠹众木折"},{"definition":["thinking and pondering (idiom); to turn sth over in one's mind\/to consider repeatedly"],"pinyin":["ba1 qian2 suan4 hou4"],"word":"巴前算后"},{"definition":["lit. the old man lost his horse, but it all turned out for the best (idiom)\/fig. a blessing in disguise\/it's an ill wind that blows nobody any good"],"pinyin":["bei3 sou3 shi1 ma3"],"word":"北叟失马"},{"definition":["lit. to catch sparrows blindfolded (idiom)\/fig. to act blindly"],"pinyin":["bi4 se4 yan3 jing1 zhuo1 ma2 que4"],"word":"闭塞眼睛捉麻雀"},{"definition":["cow and famous steed at the same trough (idiom); fig. the common and the great are treated alike"],"pinyin":["niu2 ji4 tong2 zao4"],"word":"牛骥同皂"},{"definition":["lit. violating heaven and reason (idiom); immoral character"],"pinyin":["wei2 tian1 hai4 li3"],"word":"违天害理"},{"definition":["to judge people based on their success or failure (idiom)"],"pinyin":["cheng2 bai4 lun4 ren2"],"word":"成败论人"}]}