{"definition":["to discipline sb\/to punish\/disciplinary action\/to deal with (a matter)\/CL:個|个[ge4]"],"pinyin":["chu3 fen4"],"traditional":["處分"],"rank":5594.0,"normalized_rank":0.07826731772837295,"fraction":0.00002043467809626757,"cumulative_fraction":0.872098274816218,"word":"处分","characters":[{"definition":["to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish","place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point"],"pinyin":["chu3","chu4"],"word":"处"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen4","fen1"],"word":"分"}],"containing_words":[],"sentences":[{"english":"The competent authorities shall impose necessary administrative and disciplinary sanctions on those who have violated the aforesaid provisions.","chinese":"违反者，主管部门应给予必要的行政或纪律处分。"},{"english":"The obligee's ratification of unauthorized disposition can validate the disposition behavior.","chinese":"权利人对无权处分的追认可以使处分行为有效。"},{"english":"The obligee's ratification of unauthorized disposition can validate the disposition behavior.","chinese":"权利人对无权处分的追认可以使处分行为有效。"},{"english":"The police rank of any traffic policeman who is imposed upon an administrative sanction below removal from post shall be degraded.","chinese":"受到撤职以下行政处分的交通警察，应当降低警衔。"},{"english":"Any member of the Macao Garrison who breaches military discipline shall be subject to disciplinary sanction.","chinese":"澳门驻军人员违反军队纪律的，给予纪律处分。"},{"english":"He was degraded for being drunk.","chinese":"他因酗酒而受到降级处分。"},{"english":"if the case is not serious for criminal punishments, they shall be given administrative sanctions in accordance with law.","chinese":"尚不够刑事处罚的，依法给予行政处分。"},{"english":"The deputy police commissioner yesterday promised to discipline officers found to be slack on duty.","chinese":"警务处副处长答应会对“蛇王”的警员纪律处分。"},{"english":"He was degraded from office for his dereliction of duty.","chinese":"他因渎职而受到降级处分。"},{"english":"Part five, The protective measures of law in operation of China.","chinese":"第五部分，我国现行法上的保安处分性质措施。"},{"english":"He had been punished for covering up for a friend.","chinese":"他因包庇友人曾受到处分。"},{"english":"Should be given disciplinary action by the discipline inspection and supervision departments.","chinese":"应当给予纪律处分的，由纪检监察部门处理。"},{"english":"those who violate traffic regulations should be punished.","chinese":"违背交通规矩的人应该受到处分。"},{"english":"The student handbook says that students will face disciplinary action if caught.","chinese":"学生手册称被抓到的学生将会面临纪律处分。"},{"english":"The second part introduces the history of the right of disposition.","chinese":"第二部分介绍了处分权的历史沿革。"},{"english":"Expulsion is the ultimate Party disciplinary measure.","chinese":"开除党籍是党内的最高处分。"}],"related":[{"definition":["lack of discipline\/to break a rule\/to violate discipline\/to breach a principle"],"pinyin":["wei2 ji4"],"word":"违纪"},{"definition":["to eliminate\/to sack\/to remove from office"],"pinyin":["che4 zhi2"],"word":"撤职"},{"definition":["to expel from school"],"pinyin":["kai1 chu2 xue2 ji2"],"word":"开除学籍"},{"definition":["to expel from the Party"],"pinyin":["kai1 chu2 dang3 ji2"],"word":"开除党籍"},{"definition":["to relieve sb of his post\/to sack\/to demote\/dismissal\/sacking"],"pinyin":["mian3 zhi2"],"word":"免职"},{"definition":["to suspend (sb) from duties"],"pinyin":["ting2 zhi2"],"word":"停职"},{"definition":["to give sb a demerit"],"pinyin":["ji4 guo4"],"word":"记过"},{"definition":["to punish\/to administer justice"],"pinyin":["cheng2 chu3"],"word":"惩处"},{"definition":["to demote (to a lower rank)"],"pinyin":["jiang4 zhi2"],"word":"降职"},{"definition":["to penalize\/to punish"],"pinyin":["chu3 fa2"],"word":"处罚"},{"definition":["abuse of power"],"pinyin":["lan4 yong4 zhi2 quan2"],"word":"滥用职权"},{"definition":["rules for political staff\/political discipline"],"pinyin":["zheng4 ji4"],"word":"政纪"},{"definition":["wrongdoing\/failure to do one's duty"],"pinyin":["du2 zhi2"],"word":"渎职"},{"definition":["to expel (a member of an organization)\/to fire (an employee)"],"pinyin":["kai1 chu2"],"word":"开除"},{"definition":["to neglect one's duty\/dereliction of duty\/malpractice"],"pinyin":["wan2 hu1 zhi2 shou3"],"word":"玩忽职守"},{"definition":["to hold accountable\/to blame\/to censure\/to apportion blame"],"pinyin":["wen4 ze2"],"word":"问责"}]}