{"definition":["to recur (of a disease)\/to reappear\/to relapse (into a former bad state)"],"pinyin":["fu4 fa1"],"traditional":["復發"],"rank":14252.0,"normalized_rank":0.1994039707302058,"fraction":0.000004512022468675461,"cumulative_fraction":0.9557936685381668,"word":"复发","characters":[{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out","to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4","fu4","fu4"],"word":"复"},{"definition":["hair\/Taiwan pr. [fa3]","to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa4","fa1"],"word":"发"}],"containing_words":[{"definition":["old illness recurs (idiom); a relapse\/fig. to repeat an old error\/the same old problem"],"pinyin":["jiu4 bing4 fu4 fa1"],"word":"旧病复发"}],"sentences":[{"english":"There was no relapse after radical operation.","chinese":"行根治性手术切除后，未见复发。"},{"english":"There was no recurrence after six months of follow-up.","chinese":"术后经六个月追踪没有复发的情形。"},{"english":"However, soon after that, she has a relapse of breast cancer.","chinese":"但是不久，滴发现她的乳癌居然复发。"},{"english":"Because embolus can fall off repeatedly, have a relapse easily so.","chinese":"由于栓子可以反复脱落，所以容易复发。"},{"english":"Both tumors were successfully resected without recurrence.","chinese":"二者皆经手术成功切除肿瘤且未再复发。"},{"english":"The main cause of treatment failure was local recurrence and distant metastasis.","chinese":"局部复发和远处转移是治疗失败的主要原因。"},{"english":"FemaleBleb of recrudescent sex genital must make department of gynaecology check in order to divide cancer of husband palace neck.","chinese":"女性复发性生殖器疱疹须作妇科检查以除外子宫颈癌。"},{"english":"Urolithiasis is a common disorder with a high recurrence rate.","chinese":"尿路结石症是一种具有高复发率的常见疾病。"},{"english":"Conclusion Consolidate of anisometropia amblyopia have been cured is found to arrest palindromia.","chinese":"结论屈光参差性弱视治愈后的巩固是预防复发的根本。"},{"english":"Objective To discuss the palindromic reason and treatment of excision of intracranial tumor.","chinese":"目的探讨颅内肿瘤术后复发的原因及其治疗方法。"},{"english":"A positive family history is a risk factor for recurrence and for contralateral patellofemoral instability.","chinese":"阳性家族史是复发和对侧髌股不稳定的危险因素。"},{"english":"Objective To study the recurrent mechanism and prognosis of primary retroperitoneal liposarcoma.","chinese":"目的探讨原发性腹膜后脂肪肉瘤复发的机理及预后。"},{"english":"Objective To determine the recurrent reasons about tubercular goiters after operation.","chinese":"目的为探讨结节性甲状腺肿术后复发的原因。"},{"english":"All patients were treated with a full course of postoperative antibiotic treatment. No cases of recurrent infection were recorded.","chinese":"术后所有患者给予全程抗生素治疗，无感染复发。"},{"english":"The extent of surgical depletion was believed to be approp…","chinese":"认为本术的切除范围有利于预防肿瘤的局部复发。"},{"english":"Post-operative 30-month follow up showed no local recurrence of the tumor.","chinese":"手术后30个月追踪并无肿瘤复发之迹象。"}],"related":[{"definition":["to treat (an illness)\/medical treatment\/therapy"],"pinyin":["zhi4 liao2"],"word":"治疗"},{"definition":["complications (undesired side-effect of medical procedure)"],"pinyin":["bing4 fa1 zheng4"],"word":"并发症"},{"definition":["onset\/outbreak (of a disease)"],"pinyin":["fa1 bing4"],"word":"发病"},{"definition":["state of an illness\/patient's condition"],"pinyin":["bing4 qing2"],"word":"病情"},{"definition":["chemotherapy"],"pinyin":["hua4 liao2"],"word":"化疗"},{"definition":["tumor"],"pinyin":["zhong3 liu2"],"word":"肿瘤"},{"definition":["pathological changes\/lesion\/diseased (kidney, cornea etc)"],"pinyin":["bing4 bian4"],"word":"病变"},{"definition":["disease\/sickness\/ailment"],"pinyin":["ji2 bing4"],"word":"疾病"},{"definition":["to recover completely (from illness or injury)"],"pinyin":["quan2 yu4"],"word":"痊愈"},{"definition":["patient\/sufferer"],"pinyin":["huan4 zhe3"],"word":"患者"},{"definition":["cancer"],"pinyin":["ai2 zheng4"],"word":"癌症"},{"definition":["shingles\/herpes zoster (medicine)"],"pinyin":["dai4 zhuang4 pao4 zhen3"],"word":"带状疱疹"},{"definition":["inflammation"],"pinyin":["yan2 zheng4"],"word":"炎症"},{"definition":["to make a definite diagnosis\/confirmed (case of a specific disease)"],"pinyin":["que4 zhen3"],"word":"确诊"},{"definition":["illness\/CL:場|场[chang2]\/disease\/to fall ill\/defect"],"pinyin":["bing4"],"word":"病"},{"definition":["lymphoma"],"pinyin":["lin2 ba1 ai2"],"word":"淋巴癌"}]}