{"definition":["to come back out of retirement\/to get involved again after having withdrawn"],"pinyin":["fu4 chu1"],"traditional":["復出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"复出","characters":[{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out","to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4","fu4","fu4"],"word":"复"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"I hope to be available for the Coppa Italia match against Udinese. I remain confident.","chinese":"希望在意大利杯对阵乌迪内斯的比赛时我能复出吧。"},{"english":"He was scheduled to begin a series of 1550 comeback concerts in London.","chinese":"原计划他在伦敦会进行50场的复出演唱会。"},{"english":"Because previous round the yellow card stops play, the Li Yi epicycle lifts a ban resurfaces .","chinese":"上轮因黄牌停赛，李毅本轮可谓解禁复出。"},{"english":"If Battier health back, no doubt the sky is the limit of this rocket.","chinese":"如果巴蒂尔健康复出，无疑天空才是这支火箭的极限。"},{"english":"Rafael Benitez has today been boosted by the return to fitness of defender Daniel Agger.","chinese":"贝尼特斯今天表示，阿格将在近日正式复出。"},{"english":"David Nalbandian is ready come back from injury.","chinese":"波特罗势头正与日俱增，纳尔班迪安准备复出。"},{"english":"Jo In Sung has been selected as the \"most anticipated comeback after veteran actor first.\"","chinese":"赵寅成曾被选为“退伍后最期待复出的演员第一名”。"},{"english":"Ferguson, meanwhile, revealed he was taking a long-term view when he opted for Nemanja Vidic of his returning centre-backs.","chinese":"福格森爵士说他选择复出的维蒂奇是一个长期的考虑。"},{"english":"All being well he should be available for the Carling Cup or the game before.","chinese":"他应该可以在联赛杯前正式复出。"},{"english":"I asked him, 'why now?'.","chinese":"我问他，‘为何现在复出？’"},{"english":"Kevin-Prince Boateng is back in action for AC Milan after more than two months out with injury.","chinese":"在两个多月的因伤缺席后，博阿滕终于复出。"},{"english":"Koscielny is back from suspension and he will be involved.","chinese":"科斯切尔尼结束禁赛复出，他将会参加比赛。"},{"english":"Sadr's political comeback was the result of careful and deliberate planning.","chinese":"伊拉克的政治复出是经过小心谨慎规划的结果。"},{"english":"The manager is also keen to have the option of Eboué for midfield duties.","chinese":"这位主帅还渴望埃布埃能够复出为中场提供选择。"},{"english":"This service, Xisuoke lifts a ban resurfaces , but he has received a yellow card once more.","chinese":"此役，西索科解禁复出，但他再次领到了一张黄牌。"},{"english":"After three month's treatment, the sportsman finally recovered and can reappear.","chinese":"经过三个月的治疗，这个运动员终于伤愈复出了。"}],"related":[{"definition":["armistice"],"pinyin":["xiu1 zhan4"],"word":"休战"},{"definition":["to return to\/to retreat\/regression (statistics)"],"pinyin":["hui2 gui1"],"word":"回归"},{"definition":["absence\/absent"],"pinyin":["que1 xi2"],"word":"缺席"},{"definition":["on stage\/to go on stage\/to take the field"],"pinyin":["shang4 chang3"],"word":"上场"},{"definition":["debut"],"pinyin":["shou3 xiu4"],"word":"首秀"},{"definition":["to pull\/to injure by straining"],"pinyin":["la1 shang1"],"word":"拉伤"},{"definition":["poised for battle\/to square up for a fight"],"pinyin":["dui4 zhen4"],"word":"对阵"},{"definition":["(of a performer) to come onto the stage to perform\/(of an athlete) to enter the arena to compete\/(fig.) to enter the scene (e.g. a new product)\/(of an examinee etc) to leave the venue"],"pinyin":["chu1 chang3"],"word":"出场"},{"definition":["competition (sports etc)\/match\/CL:場|场[chang3],次[ci4]\/to compete"],"pinyin":["bi3 sai4"],"word":"比赛"},{"definition":["to replace (a damaged component with a new one, an injured player with a substitute player, full-time workers with casual workers etc)\/a substitute\/a replacement"],"pinyin":["ti4 bu3"],"word":"替补"},{"definition":["to heal a wound\/to recuperate (from an injury)"],"pinyin":["yang3 shang1"],"word":"养伤"},{"definition":["holiday roster"],"pinyin":["lun2 xiu1"],"word":"轮休"},{"definition":["to go on stage\/fig. to appear on the scene\/used in advertising to mean new product"],"pinyin":["deng1 chang3"],"word":"登场"},{"definition":["to replace"],"pinyin":["ding3 ti4"],"word":"顶替"},{"definition":["to become a member of an alliance or union\/to align\/to join\/participate"],"pinyin":["jia1 meng2"],"word":"加盟"},{"definition":["to return to one's unit\/to go back to one's station in life"],"pinyin":["gui1 dui4"],"word":"归队"}]}