{"definition":["to review a judicial case\/to reexamine"],"pinyin":["fu4 shen3"],"traditional":["復審"],"rank":19737.0,"normalized_rank":0.2761462370405608,"fraction":0.0000024608908336384525,"cumulative_fraction":0.9741995276796636,"word":"复审","characters":[{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out","to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4","fu4","fu4"],"word":"复"},{"definition":["to examine\/to investigate\/carefully\/to try (in court)"],"pinyin":["shen3"],"word":"审"}],"containing_words":[],"sentences":[{"english":"Reviewing will not be addressed further in this article.","chinese":"复审不会在本文中进一步详细说明。"},{"english":"It is recommended that you perform the testability review.","chinese":"推荐你执行易测性复审。"},{"english":"The evidence was flimsy, and a campaign was launched to secure a re-trial.","chinese":"由于证据不足，掀起了一场为取得复审的运动。"},{"english":"However, some organizations designate just one or two people to review change requests periodically.","chinese":"但是，某些企业只指派一两个人来定期复审变更请求。"},{"english":"But the administration that reviews and interprets the resulting data will also incur costs.","chinese":"但是复审和解释最终数据的管理机构同样需要花钱。"},{"english":"Superior courts may review decisions of lower courts.","chinese":"高级法院可复审下级法院的判决。"},{"english":"Take proceedings to have reheard in a higher court.","chinese":"到更高一级法院进行复审。"},{"english":"Chunk up to review and agree the project.","chinese":"从整体上复审和商定最终的项目。"},{"english":"We proceeded with the examination of the applications for two hours.","chinese":"专利复审委员会成员曾参与原申请的审查的。"},{"english":"A retrial was necessary after the original trial ended with a hung jury.","chinese":"由于初审中陪审员裁决意见不一致，所以需要复审。"},{"english":"They will run back over the safety regulations again.","chinese":"他们将复审一下安全规程。"},{"english":"The court ordered certiorari following judicial review.","chinese":"在司法复审后，该法院命令调取案卷。"},{"english":"The higher people's court decided to rehear this criminal case.","chinese":"高级人民法院决定复审这桩刑事案件。"},{"english":"The dossiers of the three promotion applicants will be submitted to the Collegiate Teachers' Evaluation Committee for further evaluation.","chinese":"将三位升等申请人之资料提送院教评会复审。"},{"english":"Ask customers to do heuristic UI reviews.","chinese":"要求客户进行启发式的界面复审。"},{"english":"An appeals court ordered a partial retrial for Mr. Riina.","chinese":"一个上诉庭要求对里伊纳一案进行复审。"}],"related":[{"definition":["preliminary trial"],"pinyin":["chu1 shen3"],"word":"初审"},{"definition":["to reconsider\/to reexamine\/to review (e.g. a report prior to accepting it)"],"pinyin":["fu4 he2"],"word":"复核"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"审查"},{"definition":["final ruling"],"pinyin":["zhong1 shen3"],"word":"终审"},{"definition":["to re-investigate\/to investigate and reconsider a judgment"],"pinyin":["chong2 shen3"],"word":"重审"},{"definition":["to report (to the authorities)\/to declare (to customs)"],"pinyin":["shen1 bao4"],"word":"申报"},{"definition":["to examine sth and make a decision\/to screen\/to evaluate\/to approve"],"pinyin":["shen3 ding4"],"word":"审定"},{"definition":["to reconsider"],"pinyin":["fu4 yi4"],"word":"复议"},{"definition":["to accept to hear a case\/to handle (a service)"],"pinyin":["shou4 li3"],"word":"受理"},{"definition":["to submit (a report etc)\/to refer (a problem) to sb"],"pinyin":["ti2 jiao1"],"word":"提交"},{"definition":["to appraise\/to evaluate\/to judge"],"pinyin":["ping2 shen3"],"word":"评审"},{"definition":["to hear a case again\/review\/retrial"],"pinyin":["zai4 shen3"],"word":"再审"},{"definition":["evaluation\/to investigate and evaluate"],"pinyin":["kao3 ping2"],"word":"考评"},{"definition":["applicant"],"pinyin":["shen1 qing3 ren2"],"word":"申请人"},{"definition":["to audit\/to investigate thoroughly"],"pinyin":["shen3 he2"],"word":"审核"},{"definition":["preliminary hearing\/interrogation (of a suspect)\/preliminary examination (of a project etc)"],"pinyin":["yu4 shen3"],"word":"预审"}]}