{"definition":["compound prescription (involving several medicines)"],"pinyin":["fu4 fang1"],"traditional":["複方"],"rank":21036.0,"normalized_rank":0.29432093238005963,"fraction":0.000002146455025377851,"cumulative_fraction":0.9771879873499084,"word":"复方","characters":[{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out","to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4","fu4","fu4"],"word":"复"},{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["fang1","Fang1"],"word":"方"}],"containing_words":[],"sentences":[{"english":"Objective To observe the traditional Chinese medicine slimming capsule of the role of weight loss.","chinese":"目的观察复方中药减肥胶囊的减肥作用。"},{"english":"Objective To establish quality standard for Compound Zhuanggu Capsule.","chinese":"目的建立复方壮骨胶囊质量标准。"},{"english":"Objective To probe the curative effect of compound Anisodine injection treating ocular fundus disease.","chinese":"目的探讨复方樟柳碱注射液治疗眼底病疗效。"},{"english":"Aim To establish a method for microbial limit tests of compound Huaimi capsules.","chinese":"目的建立复方槐米胶囊微生物限度检查方法。"},{"english":"Compound anisodine injection clinical application in ophthalmology, quite a number of reports.","chinese":"复方樟柳碱注射液在眼科的临床应用已有不少报道。"},{"english":"Conclusion:Injectio Salviae Miltiorrhizae Composita, as add-on treatment of bronchiolitis of newborn, has a good efficacy.","chinese":"结论复方丹参辅佐治疗新生儿毛细支气管炎疗效明显。"},{"english":"Objective To establish a method for determination of the total flavonoids contents in Complex Prescription Kudouzi Granules.","chinese":"目的建立测定复方苦豆子颗粒中总生黄酮含量的方法。"},{"english":"Objective To study the effect of different extraction parts from Xiongjiang Decoction (XD) on promoting uterine muscle contraction (UMC).","chinese":"目的分析芎姜复方不同提取部位的缩宫作用。"},{"english":"Compond Erythromycin Alcohol Solution Set in the Content Side Crythyomycin.","chinese":"测定复方红霉素醇溶液中红霉素含量。"},{"english":"To the compound anisodine injection as the control group.","chinese":"以单纯复方樟柳碱穴位注射治疗作为对照组。"},{"english":"Clinical observation on curative effect of compound areca gargle on dental plaque and gingivitis.","chinese":"复方槟榔含漱液对控制菌斑和消除牙龈炎疗效观察。"},{"english":"OBJECTIVE To prepare the combined rivanol paste and observe its clinical effect.","chinese":"目的制备复方利凡诺糊剂，观察临床疗效。"},{"english":"Conclusion The tolerance of compound nitrendipine is good in healthy volunteers.","chinese":"结论健康志愿者对复方尼群地平片能较好耐受。"},{"english":"Objective To observe the clinical efficacy of \"Fufang Daihuang Lotion\" in the treatment of mixed hemorrhoids.","chinese":"目的观察复方大黄汤熏洗治疗混合痔的临床疗效。"},{"english":"Conclusion The reform of the prescription of the compound Hai Tong Pi bag is successful.","chinese":"结论复方海桐皮袋泡剂的剂型改革是成功的。"},{"english":"Objective The technology of the optimal extraction for Compound Gema granules was investigated in this paper.","chinese":"目的优选复方葛麻颗粒最佳提取工艺。"}],"related":[{"definition":["prepared prescription (Chinese medicine)"],"pinyin":["zhong1 cheng2 yao4"],"word":"中成药"},{"definition":["to take medicine orally\/oral (contraceptive etc)\/to say that one is convinced"],"pinyin":["kou3 fu2"],"word":"口服"},{"definition":["ointment\/paste"],"pinyin":["ruan3 gao1"],"word":"软膏"},{"definition":["Western medicine"],"pinyin":["xi1 yao4"],"word":"西药"},{"definition":["(chemical or pharmaceutical) preparation"],"pinyin":["zhi4 ji4"],"word":"制剂"},{"definition":["dexamethasone"],"pinyin":["di4 sai1 mi3 song1"],"word":"地塞米松"},{"definition":["(traditional) Chinese medicine\/CL:服[fu4],種|种[zhong3]"],"pinyin":["Zhong1 yao4"],"word":"中药"},{"definition":["medicine to be taken after being mixed with water (or other liquid)"],"pinyin":["chong1 ji4"],"word":"冲剂"},{"definition":["clindamycin"],"pinyin":["ke4 lin2 mei2 su4"],"word":"克林霉素"},{"definition":["tablet"],"pinyin":["pian1 ji4"],"word":"片剂"},{"definition":["ointment"],"pinyin":["yao4 gao1"],"word":"药膏"},{"definition":["azithromycin (macrolide antibiotic)\/Zithromax"],"pinyin":["a1 qi2 mei2 su4"],"word":"阿奇霉素"},{"definition":["to take medicine orally (as opposed to applying externally)"],"pinyin":["nei4 fu2"],"word":"内服"},{"definition":["amoxicillin (loanword)"],"pinyin":["a1 mo4 xi1 lin2"],"word":"阿莫西林"},{"definition":["aciclovir (also spelled acyclovir), antiviral drug"],"pinyin":["a1 xi1 luo4 wei2"],"word":"阿昔洛韦"},{"definition":["medicaments\/pharmaceuticals\/medication\/medicine\/drug"],"pinyin":["yao4 wu4"],"word":"药物"}]}