{"definition":["to recover (health, economic)\/to resuscitate\/anabiosis","variant of 復甦|复苏[fu4 su1]\/to recover (health, economic)\/to resuscitate\/anabiosis"],"pinyin":["fu4 su1","fu4 su1"],"traditional":["復甦","復蘇"],"rank":8240.0,"normalized_rank":0.11528829068319504,"fraction":0.000011366401937977487,"cumulative_fraction":0.9125973421167654,"word":"复苏","characters":[{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out","to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4","fu4","fu4"],"word":"复"},{"definition":["old variant of 蘇|苏[su1]","surname Su\/abbr. for Soviet Union 蘇維埃|苏维埃 or 蘇聯|苏联\/abbr. for Jiangsu province 江蘇|江苏\/abbr. for Suzhou city 蘇州|苏州","see 囉囌|啰苏[luo1 su1]","variant of 蘇|苏[su1]\/to revive","Perilla frutescens (Chinese basil or wild red basil)\/place name\/to revive\/used as phonetic in transliteration"],"pinyin":["su1","Su1","su1","su1","su1"],"word":"苏"}],"containing_words":[{"definition":["cardiopulmonary resuscitation (CPR)"],"pinyin":["xin1 fei4 fu4 su1 shu4"],"word":"心肺复苏术"}],"sentences":[{"english":"On the grounds of modern emergency medicine, defibrillation has to be performed in combination with CPR.","chinese":"根据现代急救理念，电除颤必须与心肺复苏联合应用。"},{"english":"To assess the effectiveness of cardiac compressions during adult cardiopulmonary resuscitation, the nurse should palpate which pulse site?","chinese":"心肺复苏时，评估按压的有效性，应检查哪处的脉搏？"},{"english":"The cells were passaged by mechanical methods, frozen and thawed by general procedure.","chinese":"采用机械方法传代，常规方法冻存和复苏。"},{"english":"S. demand for foreign goods will rebound with the economy.","chinese":"随着经济的复苏，美国对外国产品的需求也会反弹。"},{"english":"Still, a recovery strategy dependent on reinflating an asset bubble is fraught with risks.","chinese":"不过，依靠再次创造资产泡沫的复苏策略充满了风险。"},{"english":"B. The stock market shows signs of recovery.","chinese":"股市显示出复苏的迹象。"},{"english":"This paper introduces the control system of a novel double-pump resuscitation(DPR) instrument.","chinese":"本文介绍一种新型双泵复苏装置的控制系统。"},{"english":"I don't see a double dip... The recovery is on track.","chinese":"我不觉得是双谷衰退，经济复苏已经走上正轨。"},{"english":"However, the pace and timing of the recovery is still highly uncertain.","chinese":"然而，复苏的速度和时间仍然是十分不确定的。"},{"english":"Resuscitating an 89-year-old woman was difficult but well worth it.","chinese":"使89岁的老妇复苏艰难，但非常值得。"},{"english":"They also saw the need to explore new options for energizing the rebound.","chinese":"他们看到了为深化经济复苏探索新方法的需要。"},{"english":"The spring snow melt, all things recovery, 10000 Purple Yan-hong, to give hope.","chinese":"春天冰雪融化，万物复苏，万紫嫣红，给人们希望。"},{"english":"Such a frugal mind-set could take the edge off any recovery.","chinese":"而这样的节约心态将会减弱复苏进度。"},{"english":"Spring rains and warm sunlight quickened the earth.","chinese":"春雨和温暖的阳光使大地复苏了。"},{"english":"Banks need to be recapitalized for the recovery process to begin.","chinese":"银行要重新注资，以启动复苏进程。"},{"english":"Yet it is hard to believe that economic recovery and the debate over political reform cannot continue on parallel tracks.","chinese":"然而，政制改革和经济复苏是可以同时进行的。"}],"related":[{"definition":["(of the weather) to warm up again"],"pinyin":["hui2 nuan3"],"word":"回暖"},{"definition":["to rise again after a fall\/to pick up\/rally (stock market etc)"],"pinyin":["hui2 sheng1"],"word":"回升"},{"definition":["to decline\/to fall\/to drop\/to falter\/a decline\/recession (in economics)"],"pinyin":["shuai1 tui4"],"word":"衰退"},{"definition":["tired and feeble"],"pinyin":["pi2 ruan3"],"word":"疲软"},{"definition":["power\/momentum\/tendency\/impetus\/situation\/the look of things"],"pinyin":["shi4 tou2"],"word":"势头"},{"definition":["to improve\/to take a turn for the better\/improvement"],"pinyin":["hao3 zhuan3"],"word":"好转"},{"definition":["expansion\/dilation\/to expand (e.g. one's power or influence)\/to broaden"],"pinyin":["kuo4 zhang1"],"word":"扩张"},{"definition":["mark\/indication\/sign\/indicator"],"pinyin":["ji4 xiang4"],"word":"迹象"},{"definition":["strong\/powerful\/robust"],"pinyin":["qiang2 jing4"],"word":"强劲"},{"definition":["to grow\/to increase"],"pinyin":["zeng1 zhang3"],"word":"增长"},{"definition":["to rise abruptly (to a towering position)\/to tower over\/to spring up\/to emerge suddenly\/the emergence (e.g. of a power)"],"pinyin":["jue2 qi3"],"word":"崛起"},{"definition":["to slow down\/to ease up\/to abate\/slowdown\/downturn"],"pinyin":["qu1 huan3"],"word":"趋缓"},{"definition":["to speed up\/to accelerate\/growth rate (economics)"],"pinyin":["zeng1 su4"],"word":"增速"},{"definition":["turning point\/breaking point\/inflexion point (math., a point of a curve at which the curvature changes sign)"],"pinyin":["guai3 dian3"],"word":"拐点"},{"definition":["appearance\/to appear"],"pinyin":["xian3 xian4"],"word":"显现"},{"definition":["to slow\/to slow down (the pace of)"],"pinyin":["fang4 huan3"],"word":"放缓"}]}