{"definition":["take-out (fast food)\/(outer part of) tire\/as well\/besides\/into the bargain\/outer zone"],"pinyin":["wai4 dai4"],"traditional":["外帶"],"rank":35572.0,"normalized_rank":0.49769843157556,"fraction":5.76611626104632e-7,"cumulative_fraction":0.9943863897772448,"word":"外带","characters":[{"definition":["outside\/in addition\/foreign\/external"],"pinyin":["wai4"],"word":"外"},{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"带"}],"containing_words":[],"sentences":[{"english":"Maruko: To go. Would you give me some ketchup?","chinese":"外带。可以给我一些蕃茄酱吗？"},{"english":"The house has a diamond-shaped lawn with it.","chinese":"这幢房子外带一块菱形草坪。"},{"english":"We only have spring rolls today for take-out .","chinese":"今天我们的外带食物只有春卷。"},{"english":"Subpleural nodules are visible peripherally and in relation to the major fissures.","chinese":"可见肺外带胸膜下结节，与肺裂相关。"},{"english":"HRCT shows ill defined nodular areas of ground-glass opacity in the lung periphery.","chinese":"HRCT显示肺外带边界不清的结节形毛玻璃样阴影。"},{"english":"A fine but irregular reticular pattern is present in the lung periphery, representing intralobular interstitial thickening.","chinese":"肺外带可见明显的不规则网状影，提示小叶间质增厚。"},{"english":"Tony always buys a takeout milk tea on his way home every day.","chinese":"汤尼每天回家的路上都会外带一杯奶茶。"},{"english":"I'd like to have a two-item combo to go, please.","chinese":"我想要外带一个二道菜的套餐。"},{"english":"He now has to live rent-free in a three-bedroom villa, complete with pool.","chinese":"他现住在一个免房租的三卧室别墅，外带游泳池。"},{"english":"Uh, can we have three chocolate mousses to go please?","chinese":"恩，能给我们三份巧克力慕思外带吗？"},{"english":"The hallway smelt of boiled cabbage and old rag mats.","chinese":"门厅里一股子清煮白菜外带破草垫的味儿。"},{"english":"That comes with a soup or salad. Which one would you like?","chinese":"这道菜外带一碗汤或者一份色拉。您想选哪一个？"},{"english":"You can buy coffee today in several different sizes of takeout containers.","chinese":"现在你可以用外带的容器买各种容量的咖啡。"},{"english":"One man ordered a rum and Coke to go.","chinese":"一个男人甚至点了一杯琴酒与可乐外带。"},{"english":"Just get a to-go box. Problem solved.","chinese":"就弄个外带盒子就好了，问题解决啦。"},{"english":"We don't need to buy take-out. I packed homemade lunches for us already.","chinese":"我们不用买外带食物，我已经带了在家做好的午餐了。"}],"related":[{"definition":["in addition\/extra"],"pinyin":["wai4 jia1"],"word":"外加"},{"definition":["to include (as a free gift, when buying sth)\/to come with"],"pinyin":["fu4 song4"],"word":"附送"},{"definition":["convenient\/handy\/easy\/bento (a meal in a partitioned box)\/lunchbox"],"pinyin":["bian4 dang1"],"word":"便当"},{"definition":["buy one, get one free\/two for the price of one"],"pinyin":["mai3 yi1 song4 yi1"],"word":"买一送一"},{"definition":["half a dozen"],"pinyin":["ban4 da2"],"word":"半打"},{"definition":["sandwich (loanword)\/CL:個|个[ge4]"],"pinyin":["san1 ming2 zhi4"],"word":"三明治"},{"definition":["(do sth) in passing\/incidentally (while doing sth else)"],"pinyin":["shun4 dai4"],"word":"顺带"},{"definition":["to provide one's own...\/own\/self-provided\/self-contained"],"pinyin":["zi4 bei4"],"word":"自备"},{"definition":["full to the point of bursting\/(coll.) at most"],"pinyin":["cheng1 si3"],"word":"撑死"},{"definition":["mini (as in mini-skirt or Mini Cooper) (loanword)"],"pinyin":["mi2 ni3"],"word":"迷你"},{"definition":["server (at a restaurant)"],"pinyin":["fu2 wu4 sheng1"],"word":"服务生"},{"definition":["to carry within it\/to be mixed in\/to slip sth in\/to intersperse\/(hydrology etc) to entrain\/to smuggle\/notes smuggled into an exam"],"pinyin":["jia1 dai4"],"word":"夹带"},{"definition":["beverage\/a drink"],"pinyin":["jiu3 shui3"],"word":"酒水"},{"definition":["appetizer\/small side dish\/easy job\/piece of cake\/see also 小菜一碟[xiao3 cai4 yi1 die2]"],"pinyin":["xiao3 cai4"],"word":"小菜"},{"definition":["to lift\/to carry in one's hand\/Taiwan pr. [ling1]"],"pinyin":["lin1"],"word":"拎"},{"definition":["to carry"],"pinyin":["di1 liu1"],"word":"提溜"}]}