{"definition":["many-headed\/many-layered (authority)\/devolved (as opposed to centralized)\/pluralistic\/(as classifier) number of animals\/long term (finance)\/long (investment)"],"pinyin":["duo1 tou2"],"traditional":["多頭"],"rank":5134.0,"normalized_rank":0.07183132091838876,"fraction":0.000023169714913152733,"cumulative_fraction":0.8621089487338693,"word":"多头","characters":[{"definition":["many\/much\/often\/a lot of\/numerous\/more\/in excess\/how (to what extent)\/multi-\/Taiwan pr. [duo2] when it means \"how\""],"pinyin":["duo1"],"word":"多"},{"definition":["suffix for nouns","head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]"],"pinyin":["tou5","tou2"],"word":"头"}],"containing_words":[{"definition":["bull market"],"pinyin":["duo1 tou2 shi4 chang2"],"word":"多头市场"}],"sentences":[{"english":"In technical side, short and mid-term technical indicators keep on rise.","chinese":"技术面，短期及中期各项技术指标保持多头强势状态。"},{"english":"This system can be extended to realize the multi-center data acquisition, and the measurement of many-headed ignition coil.","chinese":"将此系统进行扩展可实现多头点火线圈的测试。"},{"english":"And well, of course, the Dutch can't eat all these pigs.","chinese":"当然，荷兰人不可能吃完那么多头猪。"},{"english":"A multipronged approach could address that dilemma. Like Mr.","chinese":"或许多头并进的手段可以化解这个难题。"},{"english":"The driving mechanism further realizes flexible winding of multi-head cords.","chinese":"也可使多头线绳实现柔性卷绕。"},{"english":"Bob, because he is buying the underlying, is said to have entered a long forward contract.","chinese":"由于鲍勃是购标人，所以说他签订了多头期货合同。"},{"english":"Larvae often aggregate in one root and overwinter in stems and roots.","chinese":"幼虫常多头聚集危害同一株沙蒿。"},{"english":"However, there is one thing the bulls have that the bears do not: seasonality .","chinese":"不过多头有一个独享的利好因素，那就是季节性因素。"},{"english":"\"Xiao Li\" men mostly use black kerchiefs , whereas the women will not wear the headband.","chinese":"“侾”黎男子多头裹黑巾，大部分妇女平时不戴头巾。"},{"english":"This system can be extended to realize the multi-center data acquisition, and the measurement of man…","chinese":"将此系统进行扩展可实现多头点火线圈的测试。"},{"english":"The establishment of long or short position through buy-in or sell-out.","chinese":"通过买进或卖出来建立多头或空头仓位。"},{"english":"The normality was tested by analysing 12 metric characters of 200 female ducks.","chinese":"对200多头母鸭的12个计量性状进行了正态测验。"},{"english":"When the price breaks below the low of the two previous calendar weeks, liquidate your long position and sell short.","chinese":"当价格低于前2周的最低价时，平掉多头仓位并做空。"}],"related":[{"definition":["phony\/so-called\/armchair (expert)\/vain (promise)\/(finance) short-seller\/bear (market)\/short (selling)"],"pinyin":["kong1 tou2"],"word":"空头"},{"definition":["short term"],"pinyin":["duan3 xian4"],"word":"短线"},{"definition":["bull market (prices appear to be rising)"],"pinyin":["kan4 zhang3"],"word":"看涨"},{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"word":"反弹"},{"definition":["short term\/short-term"],"pinyin":["duan3 qi1"],"word":"短期"},{"definition":["exchange rate"],"pinyin":["hui4 jia4"],"word":"汇价"},{"definition":["in a few days\/one of these days"],"pinyin":["ri4 nei4"],"word":"日内"},{"definition":["rising trend\/upward momentum (e.g. in prices)"],"pinyin":["zhang3 shi4"],"word":"涨势"},{"definition":["market price\/quotation of market price\/the current market situation"],"pinyin":["hang2 qing2"],"word":"行情"},{"definition":["to continue to fall (of share prices)"],"pinyin":["xu4 die1"],"word":"续跌"},{"definition":["poor prospects in the short term (finance)"],"pinyin":["duan3 kong1"],"word":"短空"},{"definition":["moving average index (used in financial analysis)"],"pinyin":["jun1 xian4 zhi3 biao1"],"word":"均线指标"},{"definition":["graph of average values"],"pinyin":["jun1 xian4"],"word":"均线"},{"definition":["gold\/golden (opportunity)\/prime (time)"],"pinyin":["huang2 jin1"],"word":"黄金"},{"definition":["(finance) profit-taking"],"pinyin":["huo4 li4 hui2 tu3"],"word":"获利回吐"},{"definition":["(of trains) up (i.e. towards the capital)\/(of river boats) to go against the current\/to submit (a document) to higher authorities"],"pinyin":["shang4 xing2"],"word":"上行"}]}