{"definition":["vigorous expansion\/rapid development"],"pinyin":["da4 li4 fa1 zhan3"],"traditional":["大力發展"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"大力发展","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["surname Li","power\/force\/strength\/ability\/strenuously"],"pinyin":["Li4","li4"],"word":"力"},{"definition":["hair\/Taiwan pr. [fa3]","to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa4","fa1"],"word":"发"},{"definition":["to spread out\/to open up\/to exhibit\/to put into effect\/to postpone\/to prolong\/exhibition","surname Zhan"],"pinyin":["zhan3","Zhan3"],"word":"展"}],"containing_words":[],"sentences":[{"english":"We will vigorously develop the circular economy.","chinese":"大力发展循环经济。"},{"english":"It plans to develop the handicraft industry in the area alongside Guoji Road.","chinese":"在国基路两侧地区，拟大力发展工艺品制作业。"},{"english":"We will vigorously develop traditional Chinese medicine and ethnic minority medicine and implement supporting policies.","chinese":"大力发展中医药和民族医药事业，落实各项扶持政策。"},{"english":"Developing the forest tourism industry energetically has become the new bright spot of the landscape planning.","chinese":"大力发展森林旅游业，成为景观规划的新亮点。"},{"english":"We will energetically develop the energy conservation service industry and the environmental protection industry.","chinese":"大力发展节能服务产业和环保业。"},{"english":"Seaweed cultivation industry has developed in many countries in the world.","chinese":"因此，世界上许多国家都在大力发展大型海藻栽培业。"},{"english":"According to the new situation changes, we should vigorously develop non-diploma education examination.","chinese":"根据新形势的变化，我国应大力发展非学历教育考试。"},{"english":"We will improve irrigated areas, build small water conservancy facilities and work hard to develop water-efficient irrigation.","chinese":"搞好小型农田水利建设，大力发展节水灌溉。"},{"english":"Mountain district in ZheJiang province is developing energetically green-rice production, it is established in the predominance of ecological resource.","chinese":"立足生态资源优势，浙南山区大力发展绿色稻米生产。"},{"english":"Coastal regions and suburbs of large and medium-sized cities should energetically develop high-efficiency agriculture.","chinese":"沿海地区和大中城市郊区要大力发展高效农业。"},{"english":"There is a bright future of millet bran oil industry in China.","chinese":"我国大力发展谷糠油产业前景广阔。"},{"english":"We should attract foreign high-quality education resources and accelerate the development of e-education.","chinese":"吸引国外优势资源和大力发展网络教育。"},{"english":"We will make every effort to develop and upgrade the software industry.","chinese":"大力发展和提升软件产业。"},{"english":"By doing that , it may be necessary for the government to strongly develop cultural industry in new age.","chinese":"对我国政府而言，在新世纪，应大力发展文化产业。"},{"english":"Fourth, we need to work hard to develop the circular economy.","chinese":"四要大力发展循环经济。"},{"english":"We will continue to energetically develop financial markets and encourage financial innovation.","chinese":"继续大力发展金融市场，鼓励金融创新。"}],"related":[{"definition":["industry\/estate\/property\/industrial"],"pinyin":["chan3 ye4"],"word":"产业"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"发展"},{"definition":["to build\/to construct\/construction\/constructive"],"pinyin":["jian4 she4"],"word":"建设"},{"definition":["mainstay industry"],"pinyin":["zhi1 zhu4 chan3 ye4"],"word":"支柱产业"},{"definition":["to develop rapidly"],"pinyin":["xun4 su4 fa1 zhan3"],"word":"迅速发展"},{"definition":["flourishing and still in the ascendant (idiom); rapidly expanding\/still growing strong\/on the up"],"pinyin":["fang1 xing1 wei4 ai4"],"word":"方兴未艾"},{"definition":["emerging industry"],"pinyin":["xin1 xing1 chan3 ye4"],"word":"新兴产业"},{"definition":["to try harder\/to redouble one's efforts"],"pinyin":["jia1 da4 li4 du4"],"word":"加大力度"},{"definition":["to rely on\/to depend on\/support"],"pinyin":["yi1 tuo1"],"word":"依托"},{"definition":["Xinxing county in Yunfu 雲浮|云浮[Yun2 fu2], Guangdong\/Xinxing or Hsinhsing district of Kaohsiung city 高雄市[Gao1 xiong2 shi4], south Taiwan","(of markets, industries, infectious diseases etc) rising\/emerging\/in the ascendant"],"pinyin":["Xin1 xing1","xin1 xing1"],"word":"新兴"},{"definition":["to expand"],"pinyin":["tuo4 zhan3"],"word":"拓展"},{"definition":["industrial cluster"],"pinyin":["chan3 ye4 ji2 qun2"],"word":"产业集群"},{"definition":["to industrialize\/industrialization"],"pinyin":["chan3 ye4 hua4"],"word":"产业化"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推动"},{"definition":["strategy"],"pinyin":["zhan4 lu:e4"],"word":"战略"},{"definition":["with great prospects for the future (idiom); well worth doing"],"pinyin":["da4 you3 ke3 wei2"],"word":"大有可为"}]}