{"definition":["eldest of father's younger brothers\/uncle (term used to address a man about the age of one's father)"],"pinyin":["da4 shu1"],"traditional":["大叔"],"rank":20248.0,"normalized_rank":0.28329579001860844,"fraction":0.0000023331604101342616,"cumulative_fraction":0.9754243358784664,"word":"大叔","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["uncle\/father's younger brother\/husband's younger brother\/Taiwan pr. [shu2]"],"pinyin":["shu1"],"word":"叔"}],"containing_words":[],"sentences":[{"english":"THE uncle had a great fall and is now in hospital nursing a fractured wrist.","chinese":"大叔摔倒了，现在在医院里，左手腕打着石膏。"},{"english":"Uncle Wang was waiting for them outside the factory gate.","chinese":"王大叔在工厂大门外等他们。"},{"english":"On the way back we stopped once more at the uncle's house in Kumjung.","chinese":"返程途中，我们又在昆坰那位大叔家稍事停留。"},{"english":"You can take Uncle Sam before a world court.","chinese":"在国际法庭之前，你能够抓到山姆大叔。"},{"english":"The students walked through the gate with Uncle Li.","chinese":"学生们和李大叔走过大门。"},{"english":"However, Deke has trouble matching up against faster-paced teams.","chinese":"但木大叔在快攻体系下有明显的弱点。"},{"english":"So, D dint big uncle, aftertime's your self-discipline cans not stop, either.","chinese":"所以，丁力大叔，今后的你的修炼也不能停止。"},{"english":"East strains and to the beer room help uncle took the opportunity to give them, manufacturing time.","chinese":"东株又到啤酒屋帮助，大叔趁机给他们制造时机。"},{"english":"Thinks that Deke plays to the utmost of his ability every single game.","chinese":"认为大叔在每一场比赛中就尽全力的发挥。"},{"english":"Only one counterforce was available, and that was you, Uncle Sam.","chinese":"只有一种反作用力，那就是你，山姆大叔。"},{"english":"Why does human including Marsian hate Uncle Sam?","chinese":"为什么人类包括火星人都讨厌山姆大叔？"},{"english":"There is no question in my mind that it is Mt.","chinese":"对我来说，这个人毫无疑问是非洲大山木大叔。"},{"english":"Road to see a blind Uncle and a clothing of the past, Flowery cooperating.","chinese":"路上见到一个盲人大叔和一个衣杉蓝缕的大妈。"},{"english":"Mutombo's strength is defending the paint and the rim.","chinese":"穆大叔的能力仅仅是防守内线和篮圈。"},{"english":"He listened to me repeat what Uncle Li had said the day before.","chinese":"他听我把李大叔头天说的话又讲了一遍。"},{"english":"The Rockets' Dikembe Mutombo was saluted at the State of the Union by President Bush.","chinese":"布什在国家讲话中向穆大叔致意。"}],"related":[{"definition":["father's elder brother's wife\/aunt (affectionate term for an elderly woman)"],"pinyin":["da4 ma1"],"word":"大妈"},{"definition":["(coll.) father's older brother\/uncle\/term of respect for older man","arrogant idler\/self-centered show-off"],"pinyin":["da4 ye5","da4 ye2"],"word":"大爷"},{"definition":["uncle\/grandpa\/CL:位[wei4]"],"pinyin":["lao3 da4 ye2"],"word":"老大爷"},{"definition":["maternal aunt\/step-mother\/childcare worker\/nursemaid\/woman of similar age to one's parents (term of address used by child)\/CL:個|个[ge4]"],"pinyin":["a1 yi2"],"word":"阿姨"},{"definition":["young man\/young guy\/lad\/youngster\/CL:個|个[ge4]"],"pinyin":["xiao3 huo3 zi5"],"word":"小伙子"},{"definition":["old fellow\/old man\/father\/husband"],"pinyin":["lao3 tou2"],"word":"老头"},{"definition":["(coll.) father's father's father\/paternal great-grandfather"],"pinyin":["lao3 ye2 ye5"],"word":"老爷爷"},{"definition":["\"Madam\" (affectionate term for an elderly woman)\/CL:位[wei4]"],"pinyin":["lao3 da4 ma1"],"word":"老大妈"},{"definition":["big sister\/elder sister\/older sister (also polite term of address for a girl or woman slightly older than the speaker)"],"pinyin":["da4 jie3"],"word":"大姐"},{"definition":["handsome guy\/lady-killer\/handsome (form of address)"],"pinyin":["shuai4 ge1"],"word":"帅哥"},{"definition":["eldest brother\/big brother (polite address for a man of about the same age as oneself)\/gang leader\/boss"],"pinyin":["da4 ge1"],"word":"大哥"},{"definition":["(coll.) father's father's mother\/paternal great-grandmother\/respectful form of address for an old woman"],"pinyin":["lao3 nai3 nai5"],"word":"老奶奶"},{"definition":["young guy\/lad\/youngster\/CL:個|个[ge4]"],"pinyin":["xiao3 huo3"],"word":"小伙"},{"definition":["father's younger brother\/uncle\/Taiwan pr. [shu2 shu5]\/CL:個|个[ge4]"],"pinyin":["shu1 shu5"],"word":"叔叔"},{"definition":["see 怪叔叔[guai4 shu1 shu5]"],"pinyin":["guai4 shu3 shu3"],"word":"怪蜀黍"},{"definition":["young person\/youngster"],"pinyin":["xiao3 qing1 nian2"],"word":"小青年"}]}