{"definition":["lit. under a big tree the shade is plentiful (idiom)\/fig. to benefit by proximity to an influential person"],"pinyin":["da4 shu4 di3 xia4 hao3 cheng2 liang2"],"traditional":["大樹底下好乘涼"],"rank":55338.0,"normalized_rank":0.774250416241098,"fraction":7.838998562485758e-8,"cumulative_fraction":0.9995403546991511,"word":"大树底下好乘凉","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["tree\/CL:棵[ke1]\/to cultivate\/to set up"],"pinyin":["shu4"],"word":"树"},{"definition":["(equivalent to 的 as possessive particle)","background\/bottom\/base\/end (of the month, year etc)\/remnants\/(math.) radix\/base"],"pinyin":["de5","di3"],"word":"底"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["to be fond of\/to have a tendency to\/to be prone to","good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello"],"pinyin":["hao4","hao3"],"word":"好"},{"definition":["four horse military chariot (archaic)\/four (archaic)\/generic term for history books","to ride\/to mount\/to make use of\/to avail oneself of\/to take advantage of\/to multiply (math.)\/Buddhist sect or creed","surname Cheng","old variant of 乘[cheng2]"],"pinyin":["sheng4","cheng2","Cheng2","cheng2"],"word":"乘"},{"definition":["cool\/cold","the five Liang of the Sixteen Kingdoms, namely: Former Liang 前涼|前凉 (314-376), Later Liang 後涼|后凉 (386-403), Northern Liang 北涼|北凉 (398-439), Southern Liang 南涼|南凉 (397-414), Western Liang 西涼|西凉 (400-421)","to let sth cool down"],"pinyin":["liang2","Liang2","liang4"],"word":"凉"}],"containing_words":[],"sentences":[],"related":[{"definition":["to enjoy the benefits of the hard work of one's predecessors. (idiom)"],"pinyin":["qian2 ren2 zai1 shu4 , hou4 ren2 cheng2 liang2"],"word":"前人栽树，后人乘凉"},{"definition":["lit. strong dragon cannot repress a snake (idiom); fig. a local gangster who is above the law"],"pinyin":["qiang2 long2 bu4 ya1 di4 tou2 she2"],"word":"强龙不压地头蛇"},{"definition":["a fine bird chooses a tree to nest in (proverb)\/fig. a talented person chooses a patron of integrity"],"pinyin":["liang2 qin2 ze2 mu4 er2 qi1"],"word":"良禽择木而栖"},{"definition":["the shot hits the bird that pokes its head out (idiom)\/nonconformity gets punished"],"pinyin":["qiang1 da3 chu1 tou2 niao3"],"word":"枪打出头鸟"},{"definition":["lit. a tall tree attracts the wind (idiom)\/fig. a famous or rich person attracts criticism"],"pinyin":["shu4 da4 zhao1 feng1"],"word":"树大招风"},{"definition":["lit. don't let one's own fertile water flow into others' field\/fig. keep the goodies within the family (proverb)"],"pinyin":["fei2 shui3 bu4 liu2 wai4 ren2 tian2"],"word":"肥水不流外人田"},{"definition":["the pavilion closest to the water enjoys moonlight first (idiom)\/to benefit from intimacy with an influential person"],"pinyin":["jin4 shui3 lou2 tai2 xian1 de2 yue4"],"word":"近水楼台先得月"},{"definition":["patron\/supporter\/close to a mountain"],"pinyin":["kao4 shan1"],"word":"靠山"},{"definition":["Only an outstanding talent can recognize current trends (idiom). A wise man submits to circumstances."],"pinyin":["shi2 shi2 wu4 zhe3 wei4 jun4 jie2"],"word":"识时务者为俊杰"},{"definition":["When the tree topples the monkeys scatter. (idiom); fig. an opportunist abandons an unfavorable cause\/Rats leave a sinking ship."],"pinyin":["shu4 dao3 hu2 sun1 san4"],"word":"树倒猢狲散"},{"definition":["lit. people fear getting famous like pigs fear fattening up (for the slaughter)\/fig. fame has its price"],"pinyin":["ren2 pa4 chu1 ming2 zhu1 pa4 zhuang4"],"word":"人怕出名猪怕壮"},{"definition":["a centipede dies but never falls down\/old institutions die hard"],"pinyin":["bai3 zu2 zhi1 chong2 si3 er2 bu4 jiang1"],"word":"百足之虫死而不僵"},{"definition":["to latch on to the rich and powerful"],"pinyin":["bao4 cu1 tui3"],"word":"抱粗腿"},{"definition":["as they say, ...\/as the saying goes, ..."],"pinyin":["you3 dao4 shi4"],"word":"有道是"},{"definition":["lit. when a man achieves the Dao, his poultry and dogs rise to Heaven (idiom)\/fig. to ride on sb else's success\/Once one man gets a government position, all his cronies get in too\/Once sb has cracked the problem, every Tom, Dick and Harry can do it"],"pinyin":["yi1 ren2 de2 dao4 , ji1 quan3 sheng1 tian1"],"word":"一人得道，鸡犬升天"},{"definition":["being close to the sovereign can be as perilous as lying with a tiger (idiom)"],"pinyin":["ban4 jun1 ru2 ban4 hu3"],"word":"伴君如伴虎"}]}