{"definition":["(bird species of China) greater racket-tailed drongo (Dicrurus paradiseus)"],"pinyin":["da4 pan2 wei3"],"traditional":["大盤尾"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"大盘尾","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["plate\/dish\/tray\/board\/hard drive (computing)\/to build\/to coil\/to check\/to examine\/to transfer (property)\/to make over\/classifier for food: dish, helping\/to coil\/classifier for coils of wire\/classifier for games of chess"],"pinyin":["pan2"],"word":"盘"},{"definition":["tail\/remainder\/remnant\/extremity\/sixth of the 28 constellations\/classifier for fish","horse's tail\/pointed posterior section of a locust etc"],"pinyin":["wei3","yi3"],"word":"尾"}],"containing_words":[],"sentences":[],"related":[{"definition":["stock market index\/share price index\/abbr. for 股票指數|股票指数[gu3 piao4 zhi3 shu4]"],"pinyin":["gu3 zhi3"],"word":"股指"},{"definition":["tendency\/trend\/path"],"pinyin":["zou3 shi4"],"word":"走势"},{"definition":["many-headed\/many-layered (authority)\/devolved (as opposed to centralized)\/pluralistic\/(as classifier) number of animals\/long term (finance)\/long (investment)"],"pinyin":["duo1 tou2"],"word":"多头"},{"definition":["(numerical, statistical) index\/(math.) exponent\/index\/exponential (function, growth)"],"pinyin":["zhi3 shu4"],"word":"指数"},{"definition":["Shanghai Stock Exchange (SSE), abbr. for 上海證券交易所|上海证券交易所[Shang4 hai3 Zheng4 quan4 Jiao1 yi4 suo3]"],"pinyin":["Shang4 Zheng4"],"word":"上证"},{"definition":["(bird species of China) lesser racket-tailed drongo (Dicrurus remifer)"],"pinyin":["xiao3 pan2 wei3"],"word":"小盘尾"},{"definition":["(of a stock price or market index) currently higher than at the previous day's close"],"pinyin":["hong2 pan2"],"word":"红盘"},{"definition":["market close"],"pinyin":["shou1 pan2"],"word":"收盘"},{"definition":["vulnerable\/weak"],"pinyin":["ruo4 shi4"],"word":"弱势"},{"definition":["to fall back\/to return to low level after a rise (in water level, price etc)"],"pinyin":["hui2 luo4"],"word":"回落"},{"definition":["(bird species of China) Taiwan yuhina (Yuhina brunneiceps)"],"pinyin":["he4 tou2 feng4 mei2"],"word":"褐头凤鹛"},{"definition":["(bird species of China) scarlet-backed flowerpecker (Dicaeum cruentatum)"],"pinyin":["zhu1 bei4 zhuo2 hua1 niao3"],"word":"朱背啄花鸟"},{"definition":["(of trains) up (i.e. towards the capital)\/(of river boats) to go against the current\/to submit (a document) to higher authorities"],"pinyin":["shang4 xing2"],"word":"上行"},{"definition":["to go down\/to decline"],"pinyin":["zou3 di1"],"word":"走低"},{"definition":["(bird species of China) ashy drongo (Dicrurus leucophaeus)"],"pinyin":["hui1 juan3 wei3"],"word":"灰卷尾"},{"definition":["phony\/so-called\/armchair (expert)\/vain (promise)\/(finance) short-seller\/bear (market)\/short (selling)"],"pinyin":["kong1 tou2"],"word":"空头"}]}