{"definition":["rampant\/very popular"],"pinyin":["da4 xing2 qi2 dao4"],"traditional":["大行其道"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"大行其道","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"},{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"}],"containing_words":[],"sentences":[{"english":"What? It sounds funny. Mischievous distortion is on its way.","chinese":"什么？很有意思啊。现在，恶搞是大行其道啊。"},{"english":"Sea lampreys leave a swath of destruction as the invasive species chomps through the Great Lakes.","chinese":"七鳃鳗留下一条致命的伤口，其在五大湖大行其道。"},{"english":"With the recession, the offshoring of jobs only seems to have gained steam.","chinese":"似乎只有离岸外包在伴随着经济衰退大行其道。"},{"english":"Why did chattel slavery take hold in the Americas?","chinese":"为什么奴役制度在美洲能大行其道？"},{"english":"So how did they go from being something Japanese to something served in Chinese restaurants?","chinese":"那么，日式幸运饼又是如何在中餐馆大行其道的呢？"},{"english":"Why does He allow crime and terrorism?","chinese":"犯罪行为和恐怖主义大行其道？"},{"english":"Inshallah, true religion prevails . Peace.","chinese":"但凭天意，真教大行其道，和平。"},{"english":"Service-oriented systems are currently all the rage, and rightfully so.","chinese":"面向服务的系统目前大行其道，并且的确理应如此。"}],"related":[{"definition":["to be in vogue\/to be prevalent"],"pinyin":["sheng4 xing2"],"word":"盛行"},{"definition":["to rise\/to spring up\/to burgeon\/to be aroused\/to come into vogue"],"pinyin":["xing1 qi3"],"word":"兴起"},{"definition":["tempest\/wave (of popular sentiment etc)\/craze or fad"],"pinyin":["feng1 chao2"],"word":"风潮"},{"definition":["to be popular for a while\/to be all the rage for a time"],"pinyin":["feng1 xing2 yi1 shi2"],"word":"风行一时"},{"definition":["in the middle of the road\/to be in the way\/to hold power\/(fig.) to predominate\/to be in vogue"],"pinyin":["dang1 dao4"],"word":"当道"},{"definition":["to emerge to meet a historic destiny (idiom)\/to arise at an opportune time\/able to take advantage of an opportunity\/to rise to the occasion"],"pinyin":["ying4 yun4 er2 sheng1"],"word":"应运而生"},{"definition":["more and more emerge\/innumerable succession\/breeding like flies (idiom)"],"pinyin":["ceng2 chu1 bu4 qiong2"],"word":"层出不穷"},{"definition":["flourishing and still in the ascendant (idiom); rapidly expanding\/still growing strong\/on the up"],"pinyin":["fang1 xing1 wei4 ai4"],"word":"方兴未艾"},{"definition":["main stream (of a river)\/fig. the essential point\/main viewpoint of a matter\/mainstream (culture etc)"],"pinyin":["zhu3 liu2"],"word":"主流"},{"definition":["fashionable for a while (idiom); all the rage"],"pinyin":["feng1 mi3 yi1 shi2"],"word":"风靡一时"},{"definition":["at present\/right now"],"pinyin":["shi2 xia4"],"word":"时下"},{"definition":["(of a contagious disease etc) to spread\/to propagate\/(of a style of clothing, song etc) popular\/fashionable"],"pinyin":["liu2 xing2"],"word":"流行"},{"definition":["to blossom everywhere\/to spring up all over the place\/to flourish on a large scale"],"pinyin":["bian4 di4 kai1 hua1"],"word":"遍地开花"},{"definition":["fashionable\/popular"],"pinyin":["feng1 mi3"],"word":"风靡"},{"definition":["(literary) to decline\/to wane\/title of a section in the Book of Songs 詩經|诗经[Shi1 jing1]"],"pinyin":["shi4 wei1"],"word":"式微"},{"definition":["age\/era\/epoch\/period (in one's life)\/CL:個|个[ge4]","Time, US weekly news magazine"],"pinyin":["shi2 dai4","Shi2 dai4"],"word":"时代"}]}