{"definition":["to defeat decisively\/to win decisively\/great victory\/triumph"],"pinyin":["da4 sheng4"],"traditional":["大勝"],"rank":67143.0,"normalized_rank":0.9394176822016704,"fraction":9.050612865439794e-9,"cumulative_fraction":0.9999799555200921,"word":"大胜","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["victory\/success\/to beat\/to defeat\/to surpass\/victorious\/superior to\/to get the better of\/better than\/surpassing\/superb (of vista)\/beautiful (scenery)\/wonderful (view)\/(Taiwan pr. [sheng1]) able to bear\/equal to (a task)"],"pinyin":["sheng4"],"word":"胜"}],"containing_words":[],"sentences":[{"english":"It was important to get a good result before the Celtic tie.","chinese":"在对阵凯子的欧冠比赛前，获得一场大胜是如此重要。"},{"english":"This is a great success in the front of politics and ideology of our party and our country.","chinese":"这是我们党和国家在思想政治战线上的一个伟大胜利。"},{"english":"In math and engineering, recursion, especially, is a big win.","chinese":"在数学和工程中，递归获得了重大胜利。"},{"english":"He foresaw the German trouncing of Australia on June 13.","chinese":"他预测了6月13号德国大胜澳大利亚队。"},{"english":"The monkey was above back to sale gun of DingDaSheng threat.","chinese":"猴子便以上回售枪之事威胁丁大胜。"},{"english":"It was a great victory by our Party and nation in the ideological and political front.","chinese":"这是我们党和国家在思想政治战线上的一个伟大胜利。"},{"english":"He drubbed his opponent in the table tennis match.","chinese":"他在乒乓球比赛中大胜对手。"},{"english":"Then a hand push the door and enter, DingDaSheng to explain some of the situation.","chinese":"这时一手下推门而入，向丁大胜说明了一些情况。"},{"english":"It was a major victory for the embattled software maker.","chinese":"这对陷入垄断案的微软公司来说是一个重大胜利。"},{"english":"United's Reserves provided a fitting send-off for departing manager Ole Gunnar Solskjaer, hammering Newcastle United at Moss Lane.","chinese":"曼联预备队用主场大胜纽卡来为主帅索尔斯克亚送行。"},{"english":"However, his Anfield bow brought a first strike for the Reds in a 3-0 demolition of West Brom.","chinese":"不管怎样，他在3比0大胜西布朗的比赛中首开纪录。"},{"english":"Mr. Xie is now Director of Finance development dept. of Mitsubishi Corp. China.","chinese":"谢大胜先生现任三菱商事中国财务开发部部长。"},{"english":"He spoke of his admiration for the Chinese people and the \"great sweep of history.","chinese":"他表达了他对中国人民和“对历史伟大胜利”的敬佩。"},{"english":"On the one hand, it marks a big victory for them.","chinese":"一方面，它标志着环保主义者取得了重大胜利。"},{"english":"There have hardly been any complete thrashings in this World Cup.","chinese":"在本届世界杯几乎没有大胜或者轻松击败对手的比赛。"},{"english":"But you cannot win with a mandate if you do not bring the sides together.","chinese":"但是，如果我们不把各方团结起来，就不可能大胜。"}],"related":[{"definition":["to beat easily\/to gain an easy victory"],"pinyin":["qing1 qu3"],"word":"轻取"},{"definition":["to defeat\/to beat"],"pinyin":["ji1 bai4"],"word":"击败"},{"definition":["to prevail with difficulty"],"pinyin":["li4 ke4"],"word":"力克"},{"definition":["to prevail over\/to defeat\/to surmount"],"pinyin":["zhan4 sheng4"],"word":"战胜"},{"definition":["no match for\/cannot beat"],"pinyin":["bu4 di2"],"word":"不敌"},{"definition":["to win by a narrow margin\/to barely win\/narrow victory"],"pinyin":["xian3 sheng4"],"word":"险胜"},{"definition":["hat-trick (sports)"],"pinyin":["san1 lian2 sheng4"],"word":"三连胜"},{"definition":["home ground (sports)\/home field\/main venue\/main stadium"],"pinyin":["zhu3 chang3"],"word":"主场"},{"definition":["to score a victory\/to prevail over one's opponents"],"pinyin":["qu3 sheng4"],"word":"取胜"},{"definition":["to meet the enemy head-on"],"pinyin":["ying2 zhan4"],"word":"迎战"},{"definition":["total victory\/to excel by far\/name of a tank\/slam"],"pinyin":["quan2 sheng4"],"word":"全胜"},{"definition":["away-game arena\/away-game venue"],"pinyin":["ke4 chang3"],"word":"客场"},{"definition":["victorious\/to win\/to triumph"],"pinyin":["huo4 sheng4"],"word":"获胜"},{"definition":["poised for battle\/to square up for a fight"],"pinyin":["dui4 zhen4"],"word":"对阵"},{"definition":["an upset (esp. in sports)\/unexpected turn of events\/to pull off a coup\/a breakthrough"],"pinyin":["bao4 leng3"],"word":"爆冷"},{"definition":["to suffer a crushing defeat"],"pinyin":["can3 bai4"],"word":"惨败"}]}