{"definition":["there are plenty more fish in the sea (idiom)"],"pinyin":["tian1 ya2 he2 chu4 wu2 fang1 cao3"],"traditional":["天涯何處無芳草"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"天涯何处无芳草","characters":[{"definition":["day\/sky\/heaven"],"pinyin":["tian1"],"word":"天"},{"definition":["border\/horizon\/shore"],"pinyin":["ya2"],"word":"涯"},{"definition":["surname He","what\/how\/why\/which\/carry"],"pinyin":["He2","he2"],"word":"何"},{"definition":["to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish","place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point"],"pinyin":["chu3","chu4"],"word":"处"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"无"},{"definition":["fragrant"],"pinyin":["fang1"],"word":"芳"},{"definition":["variant of 草[cao3]","grass\/straw\/manuscript\/draft (of a document)\/careless\/rough\/CL:棵[ke1],撮[zuo3],株[zhu1],根[gen1]","variant of 肏[cao4]"],"pinyin":["cao3","cao3","cao4"],"word":"草"}],"containing_words":[],"sentences":[],"related":[{"definition":["lit. a good horse doesn't turn around and graze the same patch again (idiom)\/fig. once you've moved on, don't go back again (romantic relationship, job etc)\/leave the past behind"],"pinyin":["hao3 ma3 bu4 chi1 hui2 tou2 cao3"],"word":"好马不吃回头草"},{"definition":["don't insist on only taking one road to Rome (idiom)\/there's more than one way to skin a cat"],"pinyin":["bu4 yao4 zai4 yi1 ke1 shu4 shang4 diao4 si3"],"word":"不要在一棵树上吊死"},{"definition":["lit. if you have to use force to break a melon off the vine, it won't taste sweet (because it's only when the melon is ripe that it can be removed with just a slight twist) (idiom)\/fig. if sth is not meant to be, it's no use trying to force it to happen"],"pinyin":["qiang3 niu3 de5 gua1 bu4 tian2"],"word":"强扭的瓜不甜"},{"definition":["better to just get the pain over with, rather than prolong the agony"],"pinyin":["chang2 tong4 bu4 ru2 duan3 tong4"],"word":"长痛不如短痛"},{"definition":["lit. the falling flowers are yearning for love, but the heartless brook ripples on (idiom)\/fig. one side is willing, yet the other one remains indifferent (usually of unrequited love)"],"pinyin":["luo4 hua1 you3 yi4 , liu2 shui3 wu2 qing2"],"word":"落花有意，流水无情"},{"definition":["to part without hard feelings (idiom)\/to cut the knot as smoothly as you tied it"],"pinyin":["hao3 ju4 hao3 san4"],"word":"好聚好散"},{"definition":["a prodigal son returned home is worth more than gold"],"pinyin":["lang4 zi3 hui2 tou2 jin1 bu4 huan4"],"word":"浪子回头金不换"},{"definition":["(coll.) womanizer\/skirt-chaser"],"pinyin":["hua1 xin1 da4 luo2 bo5"],"word":"花心大萝卜"},{"definition":["affectionate\/an affectionate person"],"pinyin":["qing2 zhong3"],"word":"情种"},{"definition":["unrequited love\/one-sided love"],"pinyin":["dan1 lian4"],"word":"单恋"},{"definition":["to seek happiness elsewhere (euphemism for extramarital sex)\/a bit on the side"],"pinyin":["ling4 mi4 xin1 huan1"],"word":"另觅新欢"},{"definition":["change of affection, shift of love (idiom); to change one's feelings to another love\/to fall in love with sb else"],"pinyin":["yi2 qing2 bie2 lian4"],"word":"移情别恋"},{"definition":["there are no rivers to one who has crossed the ocean, and no clouds to one who has passed Mount Wu (idiom)\/one who has seen the world doesn't stop at small things"],"pinyin":["ceng2 jing1 cang1 hai3 nan2 wei2 shui3 , chu2 que4 Wu1 Shan1 bu4 shi4 yun2"],"word":"曾经沧海难为水，除却巫山不是云"},{"definition":["A rabbit doesn't eat the grass by its own burrow (idiom); One shouldn't do anything to harm one's neighbors."],"pinyin":["tu4 zi5 bu4 chi1 wo1 bian1 cao3"],"word":"兔子不吃窝边草"},{"definition":["infatuated\/lovesick person"],"pinyin":["qing2 chi1"],"word":"情痴"},{"definition":["one-sided lovesickness\/unrequited longing"],"pinyin":["dan1 xiang1 si1"],"word":"单相思"}]}