{"definition":["Imperial College of Supreme Learning, established in 124 BC, and the highest educational institute in ancient China until the Sui Dynasty"],"pinyin":["Tai4 xue2"],"traditional":["太學"],"rank":51289.0,"normalized_rank":0.7175996530158242,"fraction":1.2510282622067586e-7,"cumulative_fraction":0.9991332628037456,"word":"太学","characters":[{"definition":["highest\/greatest\/too (much)\/very\/extremely"],"pinyin":["tai4"],"word":"太"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"学"}],"containing_words":[],"sentences":[{"english":"Taixue was very important to the political control and the development of culture in the Han Dynasty.","chinese":"太学对汉代的政治统治和文化发展起了重大作用。"},{"english":"The development of the university made Luoyang form the strong atmosphere of study of Confucian Classics.","chinese":"太学的发展，使京师洛阳形成了浓厚的经学文化氛围。"},{"english":"Han imperial power and the enhanced powers of the decision of the Imperial College is bound to decline.","chinese":"皇权及大族权力的增强决定了太学势必衰落的命运。"},{"english":"Compared with previous ones, the education system of Song Dynasty is a great innovation.","chinese":"和前代相比，宋代的太学教育制度有了很大的创新。"},{"english":"At the same time, it also laid emphasis on the selection and appointment of teachers that is done through competition.","chinese":"同时，也注重对太学教师的选拔和任用，优胜劣汰。"},{"english":"Early tour Yuanyou Imperial College, say industry court building, it is called hold urns.","chinese":"元祐初游太学，筑堂讲业，名曰抱瓮。"}],"related":[{"definition":["Imperial College (or Academy), the highest educational body in imperial China"],"pinyin":["Guo2 zi3 jian4"],"word":"国子监"},{"definition":["school or academic institution (old)"],"pinyin":["guan1 xue2"],"word":"官学"},{"definition":["Imperial Hanlin Academy, lasting from Tang dynasty until 1911"],"pinyin":["Han4 lin2 yuan4"],"word":"翰林院"},{"definition":["official\/scholar (old)"],"pinyin":["shi4 zi3"],"word":"士子"},{"definition":["imperial examination"],"pinyin":["ke1 ju3"],"word":"科举"},{"definition":["scholar preparing for imperial examinations (in former times)"],"pinyin":["sheng1 yuan2"],"word":"生员"},{"definition":["academy of classical learning (Tang Dynasty - Qing Dynasty)"],"pinyin":["shu1 yuan4"],"word":"书院"},{"definition":["Ministry of (Confucian) Rites (in imperial China)"],"pinyin":["Li3 bu4"],"word":"礼部"},{"definition":["study of the Confucian classics"],"pinyin":["jing1 xue2"],"word":"经学"},{"definition":["to offer a libation\/person who performs the libation before a banquet\/senior member of a profession\/important government post in imperial China"],"pinyin":["ji4 jiu3"],"word":"祭酒"},{"definition":["members of the Hanlin Imperial Academy 翰林院, employed as imperial secretaries from the Tang onwards"],"pinyin":["Han4 lin2 xue2 shi4"],"word":"翰林学士"},{"definition":["Confucian scholar (old)"],"pinyin":["ru2 sheng1"],"word":"儒生"},{"definition":["metropolitan civil service examination (held triennially in spring in imperial times)\/Crown Prince's chambers\/by extension, the Crown Prince"],"pinyin":["chun1 wei2"],"word":"春闱"},{"definition":["Imperial scholar from the Ming Dynasty onwards"],"pinyin":["zhu1 sheng1"],"word":"诸生"},{"definition":["place where the emperor listened to lectures (traditional)"],"pinyin":["jing1 yan2"],"word":"经筵"},{"definition":["refers to academics employed as imperial secretaries from the Tang onwards, forming the Hanlin Imperial Academy 翰林院"],"pinyin":["Han4 lin2"],"word":"翰林"}]}