{"definition":["to lose land\/dispossessed"],"pinyin":["shi1 di4"],"traditional":["失地"],"rank":12129.0,"normalized_rank":0.16970044632238748,"fraction":0.000006011504651801229,"cumulative_fraction":0.9447025563181431,"word":"失地","characters":[{"definition":["to lose\/to miss\/to fail"],"pinyin":["shi1"],"word":"失"},{"definition":["earth\/ground\/field\/place\/land\/CL:片[pian4]","-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct"],"pinyin":["di4","de5"],"word":"地"}],"containing_words":[{"definition":["to recover lost territory"],"pinyin":["shou1 fu4 shi1 di4"],"word":"收复失地"}],"sentences":[{"english":"So, study the theory with significance of peasant's problem of lost territory and realistic meaning.","chinese":"因此，研究失地农民问题具有重大的理论与现实意义。"},{"english":"Skeptics say Chinese bank stocks might not recover their lost ground.","chinese":"怀疑论者认为，中资银行股或许无法收复失地。"},{"english":"Point out that solves importance and urgency of peasant's problem in the lost territory through analyzing.","chinese":"通过分析指出解决失地农民问题的重要性和紧迫性。"},{"english":"Beijing suburb farmers' appealing to the higher authorities for help focus losing land problems.","chinese":"失地问题已成为京郊农民上访的主流。"},{"english":"The people in the colony recovered their lost territory.","chinese":"殖民地的人民光复了失地。"},{"english":"They won the battle and resumed lost territory.","chinese":"他们打胜了这一仗并收复了失地。"},{"english":"In addition, as the storage reservoirs, a large number of landless peasants who need rehouse.","chinese":"另外，随着水库的蓄水，产生大量失地农民需要安置。"},{"english":"Therefore, the major concern for the land-expropriated peasants is their old-age pension.","chinese":"对失地农民而言，他们最关心的是社会养老保障问题。"},{"english":"The fourth chapter researches on the perceptions of farmers losing land in Wuhu city.","chinese":"第四章是芜湖市失地农民的感知分析。"},{"english":"Along with the quickening of urbanization, the number of farmers who have lost their land is increasing day by day.","chinese":"随着城市化进程的加快，失地农民数量日益增多。"},{"english":"Second, construct the internal system environment of the land-lost peasants'social security system.","chinese":"二是失地农民社会养老保障的内部制度建设。"},{"english":"Major European indexes erased early morning losses.","chinese":"欧洲几大股指早盘收复失地。"},{"english":"The amount of land-losing peasants is increasing rapidly accompanying with the process of urbanization.","chinese":"随着城市化进程的推进，失地农民数量激增。"},{"english":"The conference resolved to resort to force to recover the lost territory.","chinese":"会议决定以武力恢复失地。"},{"english":"Every year, there are tens of thousands of protests across China by the disgruntled dispossessed.","chinese":"中国每年有成千上万起失地农民示威。"},{"english":"After the term of the armistice expired in 1590, Russian troops moved in to take them back.","chinese":"在1590年停战期满后，露西亚军队挥师收复失地。"}],"related":[{"definition":["to recover lost territory"],"pinyin":["shou1 fu4 shi1 di4"],"word":"收复失地"},{"definition":["to recover (lost territory etc)\/to recapture"],"pinyin":["shou1 fu4"],"word":"收复"},{"definition":["to lose what one has just obtained (idiom)"],"pinyin":["de2 er2 fu4 shi1"],"word":"得而复失"},{"definition":["(military) (of a city etc) to fall into enemy hands\/(fig.) to take a turn for the worse"],"pinyin":["shi1 shou3"],"word":"失守"},{"definition":["to counterattack\/a counteroffensive"],"pinyin":["fan3 gong1"],"word":"反攻"},{"definition":["to take back (forcibly)\/to recapture\/to win back"],"pinyin":["duo2 hui2"],"word":"夺回"},{"definition":["devastating setback\/slump (in stock market etc)\/crushing defeat\/to cause a serious setback\/to plummet"],"pinyin":["zhong4 cuo4"],"word":"重挫"},{"definition":["to recover (territory or power)\/the liberation of Taiwan from Japanese rule in 1945","Guangfu or Kuangfu township in Hualien County 花蓮縣|花莲县[Hua1 lian2 Xian4], east Taiwan"],"pinyin":["guang1 fu4","Guang1 fu4"],"word":"光复"},{"definition":["cumulative weakness\/to decline (over time)\/degeneration"],"pinyin":["ji1 ruo4"],"word":"积弱"},{"definition":["to follow up a victory\/to pursue retreating enemy"],"pinyin":["cheng2 sheng4"],"word":"乘胜"},{"definition":["to defeat\/to inflict a defeat on sb"],"pinyin":["da4 bai4"],"word":"大败"},{"definition":["in command of the army"],"pinyin":["hui1 shi1"],"word":"挥师"},{"definition":["to lose a war"],"pinyin":["zhan4 bai4"],"word":"战败"},{"definition":["territory"],"pinyin":["jiang1 tu3"],"word":"疆土"},{"definition":["to withdraw troops\/to retreat"],"pinyin":["che4 bing1"],"word":"撤兵"},{"definition":["troops in defeat like a landslide (idiom); a beaten army in total collapse"],"pinyin":["bing1 bai4 ru2 shan1 dao3"],"word":"兵败如山倒"}]}