{"definition":["to tuck one's tail between one's legs\/fig. to back down\/in a humiliating situation"],"pinyin":["jia1 qi3 wei3 ba5"],"traditional":["夾起尾巴"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"夹起尾巴","characters":[{"definition":["variant of 夾|夹[jia2]","Taiwan pr. used in 夾生|夹生[jia1 sheng1] and 夾竹桃|夹竹桃[jia1 zhu2 tao2]","double-layered\/lined (garment)","to press from either side\/to place in between\/to sandwich\/to carry sth under armpit\/wedged between\/between\/to intersperse\/to mix\/to mingle\/clip\/folder\/Taiwan pr. [jia2]"],"pinyin":["jia2","jia4","jia2","jia1"],"word":"夹"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"},{"definition":["tail\/remainder\/remnant\/extremity\/sixth of the 28 constellations\/classifier for fish","horse's tail\/pointed posterior section of a locust etc"],"pinyin":["wei3","yi3"],"word":"尾"},{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"}],"containing_words":[],"sentences":[{"english":"These are the dogs that tuck their tails or lay on the ground when asked to do something.","chinese":"这些狗听到命令的时候夹起尾巴或者躺在地板上。"}],"related":[{"definition":["a turtle that pulls its head in\/(fig.) coward\/chicken"],"pinyin":["suo1 tou2 wu1 gui1"],"word":"缩头乌龟"},{"definition":["a wise man looks after his own hide (idiom)\/to put one's own safety before matters of principle"],"pinyin":["ming2 zhe2 bao3 shen1"],"word":"明哲保身"},{"definition":["stray dog (idiom)"],"pinyin":["sang4 jia1 zhi1 quan3"],"word":"丧家之犬"},{"definition":["to play deaf-mute"],"pinyin":["zhuang1 long2 zuo4 ya3"],"word":"装聋作哑"},{"definition":["dull gray\/gloomy\/dejected\/crestfallen\/with one's tail between one's legs"],"pinyin":["hui1 liu1 liu1"],"word":"灰溜溜"},{"definition":["a wise man knows better than to fight when the odds are against him (idiom)"],"pinyin":["hao3 han4 bu4 chi1 yan3 qian2 kui1"],"word":"好汉不吃眼前亏"},{"definition":["to submit to humiliation (idiom); to suffer in silence\/to swallow one's anger\/to grin and bear it"],"pinyin":["ren3 qi4 tun1 sheng1"],"word":"忍气吞声"},{"definition":["to pack and quit\/to be sacked"],"pinyin":["juan3 pu1 gai4"],"word":"卷铺盖"},{"definition":["chicken-hearted (idiom)\/gutless"],"pinyin":["dan3 xiao3 ru2 shu3"],"word":"胆小如鼠"},{"definition":["bowed head and ears glued (idiom); docile and obedient\/at sb's beck and call"],"pinyin":["fu3 shou3 tie1 er3"],"word":"俯首帖耳"},{"definition":["to have a clear view of things\/to adapt to circumstances"],"pinyin":["shi2 shi2 wu4"],"word":"识时务"},{"definition":["lit. see the wind and set the helm (idiom); fig. to act pragmatically\/to be flexible and take advantage of the situation"],"pinyin":["jian4 feng1 shi3 duo4"],"word":"见风使舵"},{"definition":["cowering\/cringing"],"pinyin":["wei4 wei4 suo1 suo1"],"word":"畏畏缩缩"},{"definition":["lit. to retreat three day's march (idiom); fig. to give way in the face of superior strength\/a strategic withdrawal"],"pinyin":["tui4 bi4 san1 she4"],"word":"退避三舍"},{"definition":["to bow and bend the knee (idiom); fawning\/bending and scraping to curry favor"],"pinyin":["bei1 gong1 qu1 xi1"],"word":"卑躬屈膝"},{"definition":["to be cocky"],"pinyin":["qiao4 wei3 ba5"],"word":"翘尾巴"}]}