{"definition":["may I offer a bit of advice"],"pinyin":["feng4 quan4"],"traditional":["奉勸"],"rank":24534.0,"normalized_rank":0.3432624907307655,"fraction":0.000001547216867109619,"cumulative_fraction":0.9835859823665912,"word":"奉劝","characters":[{"definition":["to offer (tribute)\/to present respectfully (to superior, ancestor, deity etc)\/to esteem\/to revere\/to believe in (a religion)\/to wait upon\/to accept orders (from superior)"],"pinyin":["feng4"],"word":"奉"},{"definition":["to advise\/to urge\/to try to persuade\/to exhort\/to console\/to soothe"],"pinyin":["quan4"],"word":"劝"}],"containing_words":[],"sentences":[{"english":"I'd advise you not to associate with him, he's a bad lot.","chinese":"我奉劝你不要和他交往，他是一个坏蛋。"},{"english":"I myself urge you to put friendship before all human affairs.","chinese":"我自己奉劝你们将友谊置于人类事务之首。"},{"english":"I would urge Mourinho to listen to Spalletti's interviews.","chinese":"我奉劝穆里尼奥去听听斯帕莱蒂的访谈。"},{"english":"I told Sally it was foolish to marry that man.","chinese":"我早奉劝过萨利嫁给那个男人是多么愚蠢。"},{"english":"I would caution you against undue optimism .","chinese":"我奉劝你不要过于乐观。"},{"english":"Right now, many commentators are urging Mr. Obama to think small.","chinese":"当前，很多评论家都在奉劝奥巴马不要过于好高骛远。"},{"english":"Friendly advice to China - Dont underestimate them .","chinese":"奉劝中国人，不要轻视越南。"},{"english":"Do yourself a favor, don't buy the book.","chinese":"奉劝你一句，别买这本书。"},{"english":"the mender recommends me to amend the legend agenda.","chinese":"修理工提议奉劝我修改传奇议程。"},{"english":"So I urge members of congress to act without delay.","chinese":"因此，我奉劝国会议员们立即行动起来。"},{"english":"So perhaps you can skip those sneaks, say the study authors.","chinese":"研究报告的作者们奉劝你也许可以放弃那些运动鞋。"}],"related":[{"definition":["to give sb a word of advice\/advice\/counsel\/a wise word"],"pinyin":["zhong1 gao4"],"word":"忠告"},{"definition":["to advise\/to urge\/to try to persuade\/to exhort\/to console\/to soothe"],"pinyin":["quan4"],"word":"劝"},{"definition":["to warn\/to admonish"],"pinyin":["gao4 jie4"],"word":"告诫"},{"definition":["to advise\/to urge\/to exhort\/exhortation\/advice\/CL:席[xi2]"],"pinyin":["quan4 gao4"],"word":"劝告"},{"definition":["to do one's best\/to shape up\/to behave\/to fend for oneself\/you're on your own"],"pinyin":["hao3 zi4 wei2 zhi1"],"word":"好自为之"},{"definition":["you must not\/Please don't...\/be sure not to\/on no account (do it)"],"pinyin":["qie4 mo4"],"word":"切莫"},{"definition":["think again and again before acting (idiom); consider carefully in advance"],"pinyin":["san1 si1 er2 hou4 xing2"],"word":"三思而后行"},{"definition":["(coll.) Don't waste your breath.\/Save it!"],"pinyin":["sheng3 sheng5 ba5"],"word":"省省吧"},{"definition":["think three times then go (idiom); don't act before you've thought it through carefully"],"pinyin":["san1 si1 er2 xing2"],"word":"三思而行"},{"definition":["as soon as possible\/at the first opportunity\/the sooner the better\/before it's too late"],"pinyin":["chen4 zao3"],"word":"趁早"},{"definition":["to obstinately persist in going about things the wrong way (idiom)"],"pinyin":["zhi2 mi2 bu4 wu4"],"word":"执迷不悟"},{"definition":["variant of 告誡|告诫[gao4 jie4]"],"pinyin":["gao4 jie4"],"word":"告戒"},{"definition":["to challenge the law (idiom)\/to knowingly violate the law"],"pinyin":["yi3 shen1 shi4 fa3"],"word":"以身试法"},{"definition":["to remember with reverence\/to bear in mind\/to keep in mind"],"pinyin":["jin3 ji4"],"word":"谨记"},{"definition":["to keep one's eyes open (idiom)\/to be on one's guard\/to be clear-eyed"],"pinyin":["ca1 liang4 yan3 jing1"],"word":"擦亮眼睛"},{"definition":["The sea of bitterness has no bounds, turn your head to see the shore (idiom). Only Buddhist enlightenment can allow one to shed off the abyss of worldly suffering.\/Repent and ye shall be saved!"],"pinyin":["ku3 hai3 wu2 bian1 , hui2 tou2 shi4 an4"],"word":"苦海无边，回头是岸"}]}