{"definition":["to pursue (a course, a policy)"],"pinyin":["feng4 xing2"],"traditional":["奉行"],"rank":12268.0,"normalized_rank":0.17164523666279574,"fraction":0.000005903043275042812,"cumulative_fraction":0.9455303647847756,"word":"奉行","characters":[{"definition":["to offer (tribute)\/to present respectfully (to superior, ancestor, deity etc)\/to esteem\/to revere\/to believe in (a religion)\/to wait upon\/to accept orders (from superior)"],"pinyin":["feng4"],"word":"奉"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"}],"containing_words":[],"sentences":[{"english":"First, China sticks to the principle of independence.","chinese":"第一，中国始终奉行独立自主的原则。"},{"english":"Reiterating that the Australian government will firmly pursue the one-China policy, Howard said he fully agrees to the proposals.","chinese":"澳大利亚政府坚定奉行一个中国政策。"},{"english":"He reaffirmed that his country firmly pursues the one-China policy.","chinese":"他重申，斯里兰卡坚定地奉行一个中国的政策。"},{"english":"In addition many early nudists practiced vegetarianism and engaged in daily exercise.","chinese":"此外许多早期裸癖者奉行素食主义并忙于日常运动。"},{"english":"Ghaddafi spoke highly of China's independent foreign policy of peace, saying that China is a great nation in its development.","chinese":"卡扎菲高度评价中国奉行的和平外交政策。"},{"english":"The Bolivian government adheres to the one-China policy.","chinese":"玻利维亚政府坚持奉行一个中国政策。"},{"english":"Toledo also reasserted that the Peru government will firmly follow the one-China policy.","chinese":"托莱多还重申，秘鲁政府坚定地奉行一个中国政策。"},{"english":"You won’t often see abundance-minded people running the outrage script.","chinese":"你很少看到思想丰富的人奉行义愤脚本。"},{"english":"Consequently, to attract and to accept foreign immigrants have become a national policy long observed by Canada.","chinese":"吸收外来移民，是加拿大长期奉行的国策。"},{"english":"He emphasized that Afghanistan unswervingly pursues the one-China policy.","chinese":"他强调阿毫不动摇地奉行一个中国政策。"},{"english":"He also vowed that Denmark would play an active role in developing Europe-China relations and reaffirmed Denmark's adherence to the one-China policy.","chinese":"丹麦将继续奉行一个中国政策。"},{"english":"Diallo noted that since its independence, Guinea has always pursued the one-China policy.","chinese":"迪亚洛表示，几独立以来，一直奉行一个中国政策。"},{"english":"Susilo also indicated that Indonesia resolutely pursues the one-China policy.","chinese":"苏西洛还表示，印尼坚定奉行一个中国政策。"},{"english":"Zia reiterated that Bangladesh will continue to follow the one-China policy.","chinese":"齐亚重申，孟方将继续奉行一个中国政策。"},{"english":"Cyprus has always adhered to the one-China policy and been devoted to promoting China-Europe relations, the Cypriot foreign minister said.","chinese":"塞始终奉行一个中国政策，致力于促进欧中关系。"},{"english":"Urusemal reaffirmed his government's adherence to the one-China policy.","chinese":"乌鲁塞马尔总统重申密政府坚定奉行一个中国政策。"}],"related":[{"definition":["belief\/to believe (in sth)"],"pinyin":["xin4 feng4"],"word":"信奉"},{"definition":["policy\/guidelines\/CL:個|个[ge4]"],"pinyin":["fang1 zhen1"],"word":"方针"},{"definition":["to uphold\/to hold fast to"],"pinyin":["bing3 chi2"],"word":"秉持"},{"definition":["to scrupulously abide by"],"pinyin":["ke4 shou3"],"word":"恪守"},{"definition":["to hold up (as an model)\/to hold in esteem\/to revere\/to advocate"],"pinyin":["chong2 shang4"],"word":"崇尚"},{"definition":["norm\/standard\/criterion"],"pinyin":["zhun3 ze2"],"word":"准则"},{"definition":["creed\/article of faith"],"pinyin":["xin4 tiao2"],"word":"信条"},{"definition":["to promote\/to advocate"],"pinyin":["ti2 chang4"],"word":"提倡"},{"definition":["to conform\/to obey faithfully"],"pinyin":["zun1 feng4"],"word":"遵奉"},{"definition":["to abide by\/to keep (promises etc)"],"pinyin":["xin4 shou3"],"word":"信守"},{"definition":["a national policy"],"pinyin":["guo2 ce4"],"word":"国策"},{"definition":["doctrine\/dogma\/creed\/dogmatic"],"pinyin":["jiao4 tiao2"],"word":"教条"},{"definition":["to advocate\/to initiate\/to propose\/to be a proponent of (an idea or school of thought)"],"pinyin":["chang4 dao3"],"word":"倡导"},{"definition":["consistent\/constant\/from start to finish\/all along\/persistent"],"pinyin":["yi1 guan4"],"word":"一贯"},{"definition":["to follow\/to abide by\/to comply with\/compliance"],"pinyin":["zun1 xun2"],"word":"遵循"},{"definition":["to implement\/to put into practice\/to carry out"],"pinyin":["guan4 che4"],"word":"贯彻"}]}