{"definition":["pipe casing"],"pinyin":["tao4 guan3"],"traditional":["套管"],"rank":38006.0,"normalized_rank":0.5317532494788242,"fraction":4.6377092054035856e-7,"cumulative_fraction":0.9956456656293904,"word":"套管","characters":[{"definition":["to cover\/to encase\/cover\/sheath\/to overlap\/to interleave\/to model after\/to copy\/formula\/harness\/loop of rope\/(fig.) to fish for\/to obtain slyly\/classifier for sets, collections\/bend (of a river or mountain range, in place names)\/tau (Greek letter Ττ)"],"pinyin":["tao4"],"word":"套"},{"definition":["variant of 管[guan3]","surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["guan3","Guan3","guan3"],"word":"管"}],"containing_words":[],"sentences":[{"english":"The linear rods are supported by engineered polymer plastic bushings.","chinese":"线性棒支持的聚合物塑料套管。"},{"english":"Customized multi-character marking on one single sleeve.","chinese":"在单个套管上根据客户要求定制多字符数码。"},{"english":"Objective To observe the success rate of urethral catheterization by telescopic saccule urinary catheter.","chinese":"目的观察套管式球囊导尿管置管的成功率。"},{"english":"And the glass cannula was more suitable than adhesive bandages for enswathement .","chinese":"玻璃套管法包扎的效果较创可贴法为好且更为简便。"},{"english":"First, connect the guide shoe and the casing shoe.","chinese":"先接好引鞋和套管鞋。"},{"english":"Acting as an important accessories of transformer, the bushing should have a lower dielectric loss.","chinese":"套管作为变压器的配套件，其介损应当较低。"},{"english":"The material used to permanently seal annular spaces between casing and borehole walls.","chinese":"用于永久封隔套管和井壁之间的环型空间的材料。"},{"english":"This is Red Valve's standard sleeve material for Pinch Valves.","chinese":"这是美国红阀公司为夹管阀标准配置的套管材料。"},{"english":"The thesis discusses the merit of sewage heat energy collection deliver heat transfer method.","chinese":"论文论述了污水热能采集套管输送换热法的优点。"},{"english":"However, they do not support the weight of the casing very well in deviated wellbores.","chinese":"但是在定向井中不能够很好地支撑套管的重量。"},{"english":"GOST 6238Casing and coring tubes for geology-exploring drilling and nipples to them.","chinese":"地质勘探钻井用套管和岩心管及其内接头技术条件。"},{"english":"Replacement sleeves are made with one flange end slightly softer than the other.","chinese":"用来更换的套管其一端的法兰比另一端稍微柔软一些。"},{"english":"Connect the Luer lock to the trocar port on the patient side.","chinese":"在病者傍边把针头锁接与套管针端口连接上。"},{"english":"Our technique is done under direct visualization and trocar sheath in its position.","chinese":"我们的技术是直接可视化及套管针鞘的位置。"},{"english":"In general, earth the cable shield only at the control panel end.","chinese":"通常接地电缆套管只在控制板末端使用。"},{"english":"The steel retaining plate has two functions, retaining the bushing and preventing rod rotation.","chinese":"固定板的钢具有两种功能，保留套管和防止杆旋转。"}],"related":[{"definition":["pipe sleeve"],"pinyin":["guan3 tao4"],"word":"管套"},{"definition":["electrical lead"],"pinyin":["dao3 xian4"],"word":"导线"},{"definition":["junction box (elec.)"],"pinyin":["jie1 xian4 he2"],"word":"接线盒"},{"definition":["piping (for water, oil, etc)\/conduit"],"pinyin":["guan3 lu4"],"word":"管路"},{"definition":["screw"],"pinyin":["luo2 ding1"],"word":"螺钉"},{"definition":["spacer\/shim"],"pinyin":["dian4 pian4"],"word":"垫片"},{"definition":["to join\/to connect up"],"pinyin":["da1 jie1"],"word":"搭接"},{"definition":["screw"],"pinyin":["luo2 gan3"],"word":"螺杆"},{"definition":["bolt (male component of nut and bolt)\/screw"],"pinyin":["luo2 shuan1"],"word":"螺栓"},{"definition":["hose\/flexible tube"],"pinyin":["ruan3 guan3"],"word":"软管"},{"definition":["cable gland"],"pinyin":["dian4 lan3 jie1 tou2"],"word":"电缆接头"},{"definition":["to bore a hole\/to drill\/drilled hole"],"pinyin":["zuan1 kong3"],"word":"钻孔"},{"definition":["sleeve\/a tube for wrapping"],"pinyin":["tao4 tong3"],"word":"套筒"},{"definition":["nut (female component of nut and bolt)"],"pinyin":["luo2 mao4"],"word":"螺帽"},{"definition":["to spread litter in a cowshed, pigsty etc","washer (on bolt)\/toilet seat"],"pinyin":["dian4 juan4","dian4 quan1"],"word":"垫圈"},{"definition":["flange"],"pinyin":["tu1 yuan2"],"word":"凸缘"}]}