{"definition":["sequence of movements in martial arts\/routine\/pattern\/standard method"],"pinyin":["tao4 lu4"],"traditional":["套路"],"rank":14263.0,"normalized_rank":0.1995578750017489,"fraction":0.000004508810960884499,"cumulative_fraction":0.9558432839978952,"word":"套路","characters":[{"definition":["to cover\/to encase\/cover\/sheath\/to overlap\/to interleave\/to model after\/to copy\/formula\/harness\/loop of rope\/(fig.) to fish for\/to obtain slyly\/classifier for sets, collections\/bend (of a river or mountain range, in place names)\/tau (Greek letter Ττ)"],"pinyin":["tao4"],"word":"套"},{"definition":["surname Lu","road\/CL:條|条[tiao2]\/journey\/route\/line (bus etc)\/sort\/kind"],"pinyin":["Lu4","lu4"],"word":"路"}],"containing_words":[],"sentences":[{"english":"Film-goers and television-watchers know and appreciate the format.","chinese":"看电影和电视的人都了解并且喜欢这个套路。"},{"english":"It is one kind of traditional long weapon routines in Eight Diagrams School.","chinese":"八卦滚手刀是八卦掌门传统长兵器套路之一。"},{"english":"Do Katas Help You Defend Yourself or Improve Fighting Skills?","chinese":"套路有助于自卫还是能改善战斗技能？"},{"english":"The grampian no, completely is Hollywood like routines.","chinese":"历史的厚重感没有，完全是好莱坞似的套路。"},{"english":"The reform of having the Chinese meals in a western way, is only emphasizing in the aspects of health and sanitation.","chinese":"中餐西吃的改革，也只是按体学套路从卫生角度着力。"},{"english":"The most essential charm of Wushu is the consistency of Wushu and Dance.","chinese":"舞与武的一体性，是武术套路最根本的魅力所在。"},{"english":"Chum Kiu is a middle rank routine of Wing Chun.","chinese":"寻桥是咏春拳的中级套路。"},{"english":"Practice attacking and defending. The whole routine is made up of thirteen steps.","chinese":"整个套路十三步由十三个摇法的动作组成。"},{"english":"Stott Pilates uses the neutral spine position in exercise routines.","chinese":"斯托特普拉提练习套路中使用中立的立场脊柱。"},{"english":"The Chinese shadow boxing is the universal, popularized set pattern after the validation of national Wushu authority.","chinese":"此拳术是经过国家武术权威机构审定的普及推广套路。"},{"english":"Did you practice this at training?","chinese":"你们在训练中练过这个套路吗？"},{"english":"The interview topic was on skill sets for academic success.","chinese":"这次的采访内容是关于取得学术性成功的技巧套路。"},{"english":"Example of Value of Degree of Difficulty of Changquan.","chinese":"第二套国际武术竞赛套路长拳难度分值个案。"},{"english":"This is the way science welcomes newcomers.","chinese":"这就是科学迎接新人的套路。"},{"english":"Shao-lin unique er-zhi-zen is the representative of hawk's claw.","chinese":"少林绝技二指禅是少林鹰派武术的代表性套路。"},{"english":"Some suggestions are offered to apply this method to the teaching of other carte and tierce repertoire extensively.","chinese":"综合教学法也适用于其它剑术套路的教学。"}],"related":[{"definition":["trick\/deceit"],"pinyin":["pian4 shu4"],"word":"骗术"},{"definition":["fancy"],"pinyin":["hua1 shi4"],"word":"花式"},{"definition":["well-tried\/time-tested"],"pinyin":["lu:3 shi4 bu4 shuang3"],"word":"屡试不爽"},{"definition":["social connections\/stratagem\/method\/approach\/movement (martial arts)\/(sb's) background story"],"pinyin":["lu4 shu4"],"word":"路数"},{"definition":["hackneyed\/well-worn (phrase etc)\/same old story\/stereotypical fashion"],"pinyin":["lao3 tao4"],"word":"老套"},{"definition":["item (on a program)"],"pinyin":["xi4 ma3"],"word":"戏码"},{"definition":["move (in chess, on stage, in martial arts)\/gambit\/trick\/scheme\/movement\/same as 著數|着数[zhao1 shu4]"],"pinyin":["zhao1 shu4"],"word":"招数"},{"definition":["skill\/technique"],"pinyin":["ji4 qiao3"],"word":"技巧"},{"definition":["many superficial changes but no departure from the original stand (idiom); plus ça change, plus ça reste la mème chose"],"pinyin":["wan4 bian4 bu4 li2 qi2 zong1"],"word":"万变不离其宗"},{"definition":["(coll.) to flirt\/to hit on girls"],"pinyin":["liao2 mei4"],"word":"撩妹"},{"definition":["different broth but the same old medicine (idiom); a change in name only\/a change in form but not in substance"],"pinyin":["huan4 tang1 bu4 huan4 yao4"],"word":"换汤不换药"},{"definition":["the same old stuff"],"pinyin":["lao3 yi1 tao4"],"word":"老一套"},{"definition":["acrobatics\/jugglery\/cheap trick\/game"],"pinyin":["ba3 xi4"],"word":"把戏"},{"definition":["to counter every move\/to be full of tricks"],"pinyin":["jian1 zhao1 chai1 zhao1"],"word":"见招拆招"},{"definition":["(Tw) unoriginal\/hackneyed\/(of a joke) old"],"pinyin":["lao3 geng3"],"word":"老梗"},{"definition":["item of storytelling or performed dialogue (folk arts)\/sketch"],"pinyin":["duan4 zi5"],"word":"段子"}]}