{"definition":["vestibule\/small inner room (opening to others)\/suite\/apartment"],"pinyin":["tao4 jian1"],"traditional":["套間"],"rank":27528.0,"normalized_rank":0.3851524351853147,"fraction":0.000001179499225044412,"cumulative_fraction":0.9876369680756798,"word":"套间","characters":[{"definition":["to cover\/to encase\/cover\/sheath\/to overlap\/to interleave\/to model after\/to copy\/formula\/harness\/loop of rope\/(fig.) to fish for\/to obtain slyly\/classifier for sets, collections\/bend (of a river or mountain range, in place names)\/tau (Greek letter Ττ)"],"pinyin":["tao4"],"word":"套"},{"definition":["gap\/to separate\/to thin out (seedlings)\/to sow discontent","between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms"],"pinyin":["jian4","jian1"],"word":"间"}],"containing_words":[],"sentences":[{"english":"I afraid we have no vacant suite room, would you mind having a double room?","chinese":"我们恐怕没有空余的套间了，你介意改定双人间吗？"},{"english":"The bridal suite was prepared for the reception of the honeymooners.","chinese":"新婚套间已准备好以接待度蜜月的人。"},{"english":"I stayed in the largest of the 3 -suite with king bed.","chinese":"我入住的是其中最大的一个套间带有特大号床。"},{"english":"We live in a triplex house of a multilayer apartment.","chinese":"我们住在多层公寓大楼的一个三室套间里。"},{"english":"Suits are decorated in such way that you’ll get the feeling you’re actually camping outside.","chinese":"套间的设计会让你恍若真的在室外露营。"},{"english":"The apartment was centrally heated,and we had bottled gas to cook with.","chinese":"公寓套间集中供热，我们有瓶装煤气做饭。"},{"english":"The apartment consisted of two small rooms and a parlor.","chinese":"他们的寓所包括两个小房间和一个套间。"},{"english":"There are two dressing closest and a large ensuite bath.","chinese":"有两个大型梳妆衣柜和一个大浴室套间。"},{"english":"The cozy guest bedroom has an large ensuite bath with white Italian marble.","chinese":"舒适的客房有一个白色意大利大理石浴室的大型套间。"},{"english":"Please reserve me a suite of two rooms .","chinese":"请给我留一个两间房的套间。"},{"english":"The second volume contains the master bedroom suite and a downstairs office.","chinese":"第二个体量包括主卧室台套间和楼下的办公区。"},{"english":"I'm afraid we haven't vacancy suits. Would you mind having a double room instead?","chinese":"我们恐怕没有空余的套间了，您介意改定双人间吗？"},{"english":"They live in a poky little flat.","chinese":"他们住在一个逼仄的小套间里。"},{"english":"I'm sorry to tell you that we have no vacant suites, would you mind order a double room?","chinese":"我们恐怕没有空余的套间了，您介意改订双人间吗？"},{"english":"I'm afraid we have no redundant suite, could you mind to book a double room?","chinese":"我们恐怕没有多余的套间了，您介意改定双人间吗？"},{"english":"I am sorry we do not have enough suite rooms , would mind having a double room instead?","chinese":"我们恐怕没有空余的套间了，你介意改订双人间吗？"}],"related":[{"definition":["guest room"],"pinyin":["ke4 fang2"],"word":"客房"},{"definition":["single room (hotel)"],"pinyin":["dan1 ren2 jian1"],"word":"单人间"},{"definition":["compartment\/booth\/cubicle\/partitioned-off area"],"pinyin":["ge2 jian1"],"word":"隔间"},{"definition":["living room\/sitting room"],"pinyin":["qi3 ju1 shi4"],"word":"起居室"},{"definition":["room\/CL:間|间[jian1],個|个[ge4]"],"pinyin":["fang2 jian1"],"word":"房间"},{"definition":["double room"],"pinyin":["shuang1 ren2 fang2"],"word":"双人房"},{"definition":["double room (hotel)"],"pinyin":["shuang1 ren2 jian1"],"word":"双人间"},{"definition":["bedroom\/a sleeping compartment (on a train)"],"pinyin":["wo4 fang2"],"word":"卧房"},{"definition":["standard (hotel) room\/two-person room of standard size and amenities\/abbr. to 标间"],"pinyin":["biao1 zhun3 jian1"],"word":"标准间"},{"definition":["compartment (of train, ship etc)\/private room at restaurant\/rented room for karaoke\/hotel room rented by the hour"],"pinyin":["bao1 fang2"],"word":"包房"},{"definition":["private room (in a restaurant, or for karaoke etc)\/parlor\/booth\/compartment"],"pinyin":["bao1 jian1"],"word":"包间"},{"definition":["bedroom\/CL:間|间[jian1]"],"pinyin":["wo4 shi4"],"word":"卧室"},{"definition":["box (in a theater or concert hall)\/private room (in a restaurant or karaoke)"],"pinyin":["bao1 xiang1"],"word":"包厢"},{"definition":["bathroom\/restroom\/shower room\/CL:間|间[jian1]"],"pinyin":["xi3 zao3 jian1"],"word":"洗澡间"},{"definition":["bedroom"],"pinyin":["shui4 fang2"],"word":"睡房"},{"definition":["single bed\/CL:張|张[zhang1]"],"pinyin":["dan1 ren2 chuang2"],"word":"单人床"}]}