{"definition":["a real man doesn't boast about his past achievements (idiom)"],"pinyin":["hao3 han4 bu4 ti2 dang1 nian2 yong3"],"traditional":["好漢不提當年勇"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"好汉不提当年勇","characters":[{"definition":["to be fond of\/to have a tendency to\/to be prone to","good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello"],"pinyin":["hao4","hao3"],"word":"好"},{"definition":["man","Han ethnic group\/Chinese (language)\/the Han dynasty (206 BC-220 AD)"],"pinyin":["han4","Han4"],"word":"汉"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to carry (hanging down from the hand)\/to lift\/to put forward\/to mention\/to raise (an issue)\/upwards character stroke\/lifting brush stroke (in painting)\/scoop for measuring liquid"],"pinyin":["ti2"],"word":"提"},{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","(onom.) dong\/ding dong (bell)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang4","dang1","dang1"],"word":"当"},{"definition":["grain\/harvest (old)\/variant of 年[nian2]","surname Nian","year\/CL:個|个[ge4]"],"pinyin":["nian2","Nian2","nian2"],"word":"年"},{"definition":["brave"],"pinyin":["yong3"],"word":"勇"}],"containing_words":[],"sentences":[],"related":[{"definition":["best not to mention it\/drop it\/never mind\/let's not talk about it"],"pinyin":["bu4 ti2 ye3 ba4"],"word":"不提也罢"},{"definition":["the past is dead (idiom)"],"pinyin":["wang3 shi4 yi3 yi3"],"word":"往事已矣"},{"definition":["the river flows thirty years to the East, thirty years to the West (proverb)\/change is the only constant"],"pinyin":["san1 shi2 nian2 he2 dong1 , san1 shi2 nian2 he2 xi1"],"word":"三十年河东，三十年河西"},{"definition":["however strong you are, there is always someone stronger (idiom)\/there is always sth more to learn\/never be satisfied to rest on your laurels\/there is no room for complacency"],"pinyin":["qiang2 zhong1 zi4 you3 qiang2 zhong1 shou3"],"word":"强中自有强中手"},{"definition":["General Lü Meng 呂蒙|吕蒙 of the southern state of Wu (idiom); model of self-improvement by diligent study (from unlettered soldier to top strategist of Wu)"],"pinyin":["Wu2 xia4 a1 Meng2"],"word":"吴下阿蒙"},{"definition":["lit. the rear waves of the Yangtze River drive on those before (idiom)\/fig. the new is constantly replacing the old\/each new generation excels the previous\/(of things) to be constantly evolving"],"pinyin":["Chang2 Jiang1 hou4 lang4 tui1 qian2 lang4"],"word":"长江后浪推前浪"},{"definition":["demoralizing talk"],"pinyin":["sang4 qi4 hua4"],"word":"丧气话"},{"definition":["to digress\/to get sidetracked\/to go off on a tangent"],"pinyin":["che3 yuan3"],"word":"扯远"},{"definition":["see 成則為王，敗則為寇|成则为王，败则为寇[cheng2 ze2 wei2 wang2 , bai4 ze2 wei2 kou4]"],"pinyin":["cheng2 wang2 bai4 kou4"],"word":"成王败寇"},{"definition":["old but vigorous (idiom); hale and hearty despite the years"],"pinyin":["lao3 dang1 yi4 zhuang4"],"word":"老当益壮"},{"definition":["the young will be redoubtable in the years to come (idiom)\/the younger generations will surpass us in time"],"pinyin":["hou4 sheng1 ke3 wei4"],"word":"后生可畏"},{"definition":["the old man lost his mare, but it all turned out for the best (idiom); fig. a blessing in disguise\/it's an ill wind that blows nobody any good"],"pinyin":["sai4 weng1 shi1 ma3 yan1 zhi1 fei1 fu2"],"word":"塞翁失马焉知非福"},{"definition":["lit. even a scrawny camel is bigger than a horse (idiom)\/fig. even after suffering a loss, a rich person is still better off than ordinary people\/a cultured person may come down in the world, but he is still superior to the common people"],"pinyin":["shou4 si3 de5 luo4 tuo5 bi3 ma3 da4"],"word":"瘦死的骆驼比马大"},{"definition":["lit. an arrogant army is bound to lose (idiom)\/fig. pride goes before a fall"],"pinyin":["jiao1 bing1 bi4 bai4"],"word":"骄兵必败"},{"definition":["lit. When we get to the mountain, there'll be a way through. (idiom)\/fig. Everything will turn out for the best.\/Let's worry about it when it happens.\/It will be all right on the night.\/cf couplet 車到山前必有路，船到橋頭自然直|车到山前必有路，船到桥头自然直"],"pinyin":["che1 dao4 shan1 qian2 bi4 you3 lu4"],"word":"车到山前必有路"},{"definition":["to forget past pains once the wound has healed (idiom)"],"pinyin":["hao3 le5 shang1 ba1 wang4 le5 teng2"],"word":"好了伤疤忘了疼"}]}