{"definition":["Zi Chan (?-522 BC), statesman and philosopher during the Spring and Autumn period"],"pinyin":["Zi3 Chan3"],"traditional":["子產"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"子产","characters":[{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi5","zi3"],"word":"子"},{"definition":["to give birth\/to reproduce\/to produce\/product\/resource\/estate\/property"],"pinyin":["chan3"],"word":"产"}],"containing_words":[],"sentences":[{"english":"\"Electronics are a lot easier to compare online, \" Robertson said.","chinese":"罗伯特森认为，“网上更容易比较电子产品的价格。"},{"english":"Our peripheries are the professional markets of cellular phone accessories and the electronics product export.","chinese":"我们的周边是手机配件及电子产品出口的专业市场。"},{"english":"In the electronic products used as demoulding agent of electronic components.","chinese":"在电子产品中可作电子元件的脱模剂。"},{"english":"Is a professional manufacturer of LED light emitting diode of the high-tech enterprise of electronic products.","chinese":"是专业生产LED发光二极管电子产品的高科技企业。"},{"english":"Tom always flaunts his electronic productions. I really want to make him feel jealous once.","chinese":"总是炫耀他那些电子产品，我也想让他嫉妒眼红一回。"},{"english":"To guarantee a higher level of safety for electrical consumer products.","chinese":"保障消费性电子产品有一更高之安全水准。"},{"english":"The plant makes electronic components for cars and consumer devices.","chinese":"该工厂主要生产齐射电子元件和消费电子产品。"},{"english":"Chengdu and Mianyang are the production bases for textiles and electronics products.","chinese":"成都和绵阳为纺织和电子产品基地。"},{"english":"I also do some waterproofing to electronics.","chinese":"我也做一些防水到电子产品。"},{"english":"Production of CNC Sample for home appliance, commodity, timekeeper and electronic product.","chinese":"家用电器，日用品，钟表电子产品手板制作。"},{"english":"An encouraging outlook for electronics maker Panasonic lifted market sentiment.","chinese":"电子产品制造商松下电器前景乐观，增加了市场信心。"},{"english":"I find shopping for electronics is the worst.","chinese":"而我发现购买电子产品则最让人蛋疼。"},{"english":"With the development of electronic technology and electronic products.","chinese":"随着电子科技的发展和电子产品。"},{"english":"Perhaps you’ll start with a certain category of belongings, like electronics.","chinese":"也许你可以从一个种类开始整理，如电子产品。"},{"english":"But to specific Xie Qing is carried out by the food industry or the electronics.","chinese":"而是要具体的写清所从事的是食品业还是电子产品。"},{"english":"Zi Chan smiled, \"I am the boss here.","chinese":"子产笑了，“这里我说了算。"}],"related":[{"definition":["Yanzi (-c 500 BC), famous statesman from Qi of the Warring States, also known as 晏子, hero of book 晏子春秋"],"pinyin":["Yan4 Ying1"],"word":"晏婴"},{"definition":["Lu, vassal state at the time of the Zhou Dynasty 周朝|周朝[Zhou1 chao2], located in the southwest of present-day Shandong 山東|山东[Shan1 dong1], birthplace of Confucius"],"pinyin":["Lu3 guo2"],"word":"鲁国"},{"definition":["Guan Zhong (-645 BC), famous politician of Qi 齊國|齐国 of Spring and Autumn period\/known as Guangzi 管子","a restricted view through a bamboo tube"],"pinyin":["Guan3 Zhong4","guan3 zhong4"],"word":"管仲"},{"definition":["Duke Huan of Qi (reigned 685-643 BC), one of the Five Hegemons 春秋五霸"],"pinyin":["Qi2 Huan2 gong1"],"word":"齐桓公"},{"definition":["Zi Gong or Duanmu Ci 端木賜|端木赐[Duan1 mu4 Ci4] (520 BC-), disciple of Confucius"],"pinyin":["Zi3 Gong4"],"word":"子贡"},{"definition":["Duke Wen of Jin (697-628 BC, reigned 636-628 BC), one of the Five Hegemons 春秋五霸"],"pinyin":["Jin4 Wen2 gong1"],"word":"晋文公"},{"definition":["Yanzi (-c 500 BC), famous statesman from Qi of the Warring States, also known as 晏婴, hero of book 晏子春秋"],"pinyin":["Yan4 zi3"],"word":"晏子"},{"definition":["Duke Mu of Qin, the first substantial king of Qin (ruled 659-621 BC), sometimes considered one of the Five Hegemons 春秋五霸"],"pinyin":["Qin2 Mu4 gong1"],"word":"秦穆公"},{"definition":["the lord of Lu (who declined to employ Confucius)"],"pinyin":["Lu3 jun1"],"word":"鲁君"},{"definition":["my late father\/my ancestors\/the late emperor"],"pinyin":["xian1 jun1"],"word":"先君"},{"definition":["Li Kui (455-395 BC), legalist philosopher and statesman of Wei state 魏國|魏国[Wei4 guo2]"],"pinyin":["Li3 Kui1"],"word":"李悝"},{"definition":["King Xuan, eleventh King of Zhou, reigned (828-782 BC)"],"pinyin":["Zhou1 Xuan1 wang2"],"word":"周宣王"},{"definition":["Deng Xi (545-501 BC), Chinese philosopher and rhetorician, the first lawyer of ancient China"],"pinyin":["Deng4 Xi1"],"word":"邓析"},{"definition":["Duke Xiang of Song (reigned 650-637 BC), sometimes considered one of the Five Hegemons 春秋五霸"],"pinyin":["Song4 Xiang1 gong1"],"word":"宋襄公"},{"definition":["Confucius (551-479 BC), Chinese thinker and social philosopher, also known as 孔夫子[Kong3 fu1 zi3]"],"pinyin":["Kong3 zi3"],"word":"孔子"},{"definition":["Zi Lu (542-480 BC), disciple of Confucius 孔夫子[Kong3 fu1 zi3], also known as Ji Lu 季路[Ji4 Lu4]"],"pinyin":["Zi3 Lu4"],"word":"子路"}]}