{"definition":["Sun Wukong, the Monkey King, character with supernatural powers in the novel Journey to the West 西遊記|西游记[Xi1 you2 Ji4]\/Son Goku, the main character in Dragon Ball 七龍珠|七龙珠[Qi1 long2 zhu1]"],"pinyin":["Sun1 Wu4 kong1"],"traditional":["孫悟空"],"rank":16445.0,"normalized_rank":0.2300868859569348,"fraction":0.000003501711313164029,"cumulative_fraction":0.9645354724489504,"word":"孙悟空","characters":[{"definition":["grandson\/descendant","surname Sun"],"pinyin":["sun1","Sun1"],"word":"孙"},{"definition":["to comprehend\/to apprehend\/to become aware"],"pinyin":["wu4"],"word":"悟"},{"definition":["empty\/air\/sky\/in vain","to empty\/vacant\/unoccupied\/space\/leisure\/free time"],"pinyin":["kong1","kong4"],"word":"空"}],"containing_words":[],"sentences":[{"english":"Learn more through with Sun Wukong Xianqi that simply.","chinese":"学千术跟孙悟空吹仙气一样那么简单。"},{"english":"The features of the image of Monkey King are a combination of fiction and fact.","chinese":"孙悟空形象的特点是亦真亦幻，幻中寓真。"},{"english":"Monkey King, you bastard.","chinese":"孙悟空，你这个畜牲。"},{"english":"He is Sun Wukong, the Great Sage Equaling Heaven, who made havoc in Heaven.","chinese":"就是那大闹天宫的齐天大圣孙悟空。"},{"english":"In comparison, the Monkey King is a lone ranger.","chinese":"相比较而言，孙悟空是一个孤胆英雄。"},{"english":"In the Chinese classic Journey to the West, who does Sun Wukong meet in his first challenge?","chinese":"在《西游记》里，孙悟空斩妖除魔的第一关遇到谁？"},{"english":"The Tang Dynasty the monk misunderstands Sun Wu empty excessive to kill however innocent, chase its a division door.","chinese":"唐僧却误会孙悟空滥杀无辜，将其逐出师门。"},{"english":"In her blog, Tsuji noted that she was and continues to be a fan of Dragon Ball's Goku character.","chinese":"在她的博客中写道她将继续作七龙珠中孙悟空的粉丝。"},{"english":"After the havoc in heaven monkey king is captured and sealed in a magic furnace.","chinese":"大闹天宫后，孙悟空遭擒拿被打入八卦炉冶炼。"},{"english":"The Monkey King cannot jump out of Buddha's palm.","chinese":"孙悟空跳不出如来佛的手心。"},{"english":"To directly contact Sun Wukong, or Monkey Sun, of course you should go to Huaguo Mountain.","chinese":"要与孙悟空零距离接触，自然要去花果山。"},{"english":"I like the most in the big brother Sun Wukong.","chinese":"在其中我最喜欢的是大师兄孙悟空。"},{"english":"Hence Princess Iron Fan hated Monkey and refused to lend the fan to him.","chinese":"因此铁扇公主恨孙悟空，拒绝借扇他。"},{"english":"This mantra, Sun Wukong never dare not listen to his words.","chinese":"咒，从此孙悟空再也不敢不听唐僧的话了。"},{"english":"Some time ago, Red Boy had tried to eat the Tang Priest and Monkey had subdued him.","chinese":"前一段时间，红孩儿吃了唐僧和孙悟空制服了他。"},{"english":"Sun Wukong, still in the guise of an overseas Chinese, Mr. Sun, prepared to return to his birthplace.","chinese":"孙悟空的化身华侨孙先生准备回到他出生之地花果山。"}],"related":[{"definition":["Zhu Bajie, character in Journey to the West 西遊記|西游记, with pig-like characteristics and armed with a muckrake\/Pigsy in Arthur Waley's translation"],"pinyin":["Zhu1 Ba1 jie4"],"word":"猪八戒"},{"definition":["Sun Wukong, the Monkey King, character with supernatural powers from the novel Journey to the West 西遊記|西游记[Xi1 You2 Ji4]"],"pinyin":["Wu4 Kong1"],"word":"悟空"},{"definition":["Xuanzang (602-664) Tang dynasty Buddhist monk and translator, who traveled to India 629-645"],"pinyin":["Tang2 seng1"],"word":"唐僧"},{"definition":["Erlangshen, Chinese deity"],"pinyin":["Er4 lang2 shen2"],"word":"二郎神"},{"definition":["Sha Wujing"],"pinyin":["Sha1 Seng1"],"word":"沙僧"},{"definition":["Gyuumao"],"pinyin":["Niu2 mo2 wang2"],"word":"牛魔王"},{"definition":["Great Sage the Equal of Heaven, self-proclaimed title of the Monkey King Sun Wukong 孫悟空|孙悟空[Sun1 Wu4 kong1] in the novel Journey to the West 西遊記|西游记[Xi1 you2 Ji4]"],"pinyin":["Qi2 tian1 Da4 sheng4"],"word":"齐天大圣"},{"definition":["the eight precepts (Buddhism)"],"pinyin":["ba1 jie4"],"word":"八戒"},{"definition":["tathagata (Buddha's name for himself, having many layers of meaning - Sanskrit: thus gone, having been Brahman, gone to the absolute etc)"],"pinyin":["ru2 lai2"],"word":"如来"},{"definition":["Sha Wujing"],"pinyin":["Sha1 he2 shang5"],"word":"沙和尚"},{"definition":["Monkey Wreaks Havoc in Heaven, story about the Monkey King Sun Wukong 孫悟空|孙悟空[Sun1 Wu4 kong1] from the novel Journey to the West 西遊記|西游记"],"pinyin":["Da4 nao4 Tian1 gong1"],"word":"大闹天宫"},{"definition":["Sha Wujing"],"pinyin":["Sha1 Wu4 jing4"],"word":"沙悟净"},{"definition":["Tripitaka (602-664), Tang dynasty Buddhist monk and translator who traveled to India 629-645\/same as 玄奘"],"pinyin":["Tang2 san1 zang4"],"word":"唐三藏"},{"definition":["Great-Sage Sun\/Sun Wukong 孫悟空|孙悟空[Sun1 Wu4 kong1]"],"pinyin":["Sun1 da4 sheng4"],"word":"孙大圣"},{"definition":["Sun Wukong 孫悟空|孙悟空[Sun1 Wu4 kong1], the Monkey King, character with supernatural powers in the novel Journey to the West 西遊記|西游记[Xi1 you2 Ji4]"],"pinyin":["Sun1 xing2 zhe3"],"word":"孙行者"},{"definition":["the Jade Emperor"],"pinyin":["yu4 di4"],"word":"玉帝"}]}