{"definition":["seasonal"],"pinyin":["ji4 jie2 xing4"],"traditional":["季節性"],"rank":11508.0,"normalized_rank":0.16101185062890885,"fraction":0.000006558774774906612,"cumulative_fraction":0.9408061784332196,"word":"季节性","characters":[{"definition":["surname Ji","season\/the last month of a season\/fourth or youngest amongst brothers\/classifier for seasonal crop yields"],"pinyin":["Ji4","ji4"],"word":"季"},{"definition":["see 節骨眼|节骨眼[jie1 gu5 yan3]","festival\/holiday\/node\/joint\/section\/segment\/part\/to economize\/to save\/to abridge\/moral integrity\/classifier for segments, e.g. lessons, train wagons, biblical verses\/CL:個|个[ge4]"],"pinyin":["jie1","jie2"],"word":"节"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"It was found that giant pandas in Fopinghad tke habit of seasonal vertical movement.","chinese":"结果表明，佛坪大熊猫有季节性垂直移动习性。"},{"english":"They were traditionally semisedentary, moving seasonally between fixed sites.","chinese":"他们是传统的半定居部落，在定居点间季节性迁移。"},{"english":"Departures from seasonal jobs, such as Census taker, are not counted.","chinese":"季节性工作人员的离职，如普查人员，没有加入统计。"},{"english":"Lake Aha, located in the suburb of Guiyang, Guizhou Province, is a medium artificial reservoir with seasonally anoxic hypolimina.","chinese":"贵州阿哈湖是一底层滞水带季节性缺氧的中型人工湖。"},{"english":"Unseasonal rains can make animals come out of hibernation too early.","chinese":"非季节性的雨会导致动物提前出冬眠。"},{"english":"Also some rests assume the seasonal outbreak, many spring is taken bad in the fall.","chinese":"也有的息者呈季节性发作，多在秋春季发病。"},{"english":"How to treat seasonal rhinitis?","chinese":"如何治疗季节性鼻炎？"},{"english":"Clouds and showers soon returned to Sochi, and the Black Sea returned to its seasonally typical tempestuous ways.","chinese":"云和雨回到索契，黑海恢复季节性的汹涌。"},{"english":"Characteristics of sea ice floe size distribution in the seasonal ice zone.","chinese":"在季节性冰冻地带海冰浮冰块大小分布的特性。"},{"english":"In some mountainous areas, the seasonal wheat becomes mature around the Summer Solstice.","chinese":"在一些山区，季节性小麦在夏至前后成熟。"},{"english":"Reproduction of Tibetan monkeys troop in Yulingkeng of Huangshan Mountain wasseasonality, and it belongs to the birth rhythm pattern.","chinese":"黄山短尾猴鱼鳞坑群为季节性繁殖，属产仔节律型。"},{"english":"Thankfully, they are seasonal and will pass by mid-summer.","chinese":"可幸的是，沙尘暴是季节性的，仲夏之后就会停止。"},{"english":"Flood period is seasonal or periodic flood rise phenomenon of rivers.","chinese":"汛是指江河等水域的季节性或周期性的涨水现象。"},{"english":"The spermary develops seasonally.","chinese":"精巢的发育具有季节性。"},{"english":"There is little seasonal variation in the incidence of the disease.","chinese":"在该病的发病率方面存在着极小的季节性差别。"},{"english":"The supervision of the customs and the inspection of commodities should also be reinforced at seasonal frontier ports.","chinese":"季节性的边境口岸也要加强海关监管和商品检验。"}],"related":[{"definition":["busy season\/peak period\/see also 淡季[dan4 ji4]"],"pinyin":["wang4 ji4"],"word":"旺季"},{"definition":["periodic\/periodicity (math)\/cyclicity"],"pinyin":["zhou1 qi1 xing4"],"word":"周期性"},{"definition":["off season\/slow business season\/see also 旺季[wang4 ji4]"],"pinyin":["dan4 ji4"],"word":"淡季"},{"definition":["flowing\/shifting\/fluidity\/mobility\/liquidity (of funds)"],"pinyin":["liu2 dong4 xing4"],"word":"流动性"},{"definition":["springtime"],"pinyin":["chun1 ji4"],"word":"春季"},{"definition":["supply and demand"],"pinyin":["gong1 xu1"],"word":"供需"},{"definition":["qualities that make sth popular or fashionable\/(of a disease) epidemic"],"pinyin":["liu2 xing2 xing4"],"word":"流行性"},{"definition":["climate\/atmosphere\/situation\/CL:種|种[zhong3]"],"pinyin":["qi4 hou4"],"word":"气候"},{"definition":["specific to a particular stage (of a project etc)\/interim (policy etc)\/occurring in stages\/phased"],"pinyin":["jie1 duan4 xing4"],"word":"阶段性"},{"definition":["short term\/short-term"],"pinyin":["duan3 qi1"],"word":"短期"},{"definition":["supply exceeds demand"],"pinyin":["gong1 guo4 yu2 qiu2"],"word":"供过于求"},{"definition":["to slow down\/to ease up\/to abate\/slowdown\/downturn"],"pinyin":["qu1 huan3"],"word":"趋缓"},{"definition":["supply exceeds demand"],"pinyin":["gong1 da4 yu2 qiu2"],"word":"供大于求"},{"definition":["peak period\/rush hour"],"pinyin":["gao1 feng1 qi1"],"word":"高峰期"},{"definition":["supply and demand (economics)"],"pinyin":["gong1 qiu2"],"word":"供求"},{"definition":["the whole year\/all year long"],"pinyin":["quan2 nian2"],"word":"全年"}]}