{"definition":["to stake all on one throw"],"pinyin":["gu1 zhu4 yi1 zhi4"],"traditional":["孤注一擲"],"rank":28119.0,"normalized_rank":0.3934212919564031,"fraction":0.0000011142472258371285,"cumulative_fraction":0.9883143347736424,"word":"孤注一掷","characters":[{"definition":["lone\/lonely"],"pinyin":["gu1"],"word":"孤"},{"definition":["to inject\/to pour into\/to concentrate\/to pay attention\/stake (gambling)\/classifier for sums of money\/variant of 註|注[zhu4]","to register\/to annotate\/note\/comment"],"pinyin":["zhu4","zhu4"],"word":"注"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to toss\/to throw dice\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"掷"}],"containing_words":[],"sentences":[{"english":"Roosevelt, avid for war, undertook a desperate gamble.","chinese":"罗斯福，渴望战争，他就此孤注一掷。"},{"english":"He careened through foreign territories on a desperate kind of blitz.","chinese":"在孤注一掷地闪电战中他猛冲过外国领地。"},{"english":"And risk it all on one turn of pitch-and-toss.","chinese":"孤注一掷的冒险失败后。"},{"english":"The thirty - six Enterprise dive-bomber were being squandered in a jittery shot from the hip.","chinese":"这三十六架“企业号”上的俯冲轰炸机正被孤注一掷。"},{"english":"Then Caspian decided to risk everything on one stroke.","chinese":"于是凯斯宾决定孤注一掷。"},{"english":"This did not yet tempt them to adventures staking Soviet assets.","chinese":"这还没有促使他们把苏联的老本拿来孤注一掷。"},{"english":"Could you risk everything for the chance of being alone ?","chinese":"你能否孤注一掷，最后却换来孤独寂寞？"},{"english":"He hazarded a week's salary on a game of chance.","chinese":"他把一星期的薪水孤注一掷地赌了。"},{"english":"In desperation, he decided to throw the helve after the hatchet, in tribute tea against Hu poisoned.","chinese":"情急之下，他决定孤注一掷，在贡茶里下毒陷害胡家。"},{"english":"With no time to think the yearnings gave up everything for a shot.","chinese":"来不及细想思念从此孤注一掷。"},{"english":"Kind of like going all-in on a poker hand.","chinese":"如同扑克牌中的孤注一掷。"},{"english":"He hazarded all his money to save the business.","chinese":"他孤注一掷，拿出了所有的钱来挽救企业。"},{"english":"Democrates may be ready for an all or nothing gamble on health care reform.","chinese":"民主党可能准备对医疗改革方案进行孤注一掷的冒险。"},{"english":"He gambled his savings to start a small shop.","chinese":"他孤注一掷用自己的积蓄开了一家小商店。"}],"related":[{"definition":["to put one's all into the fight"],"pinyin":["fang4 shou3 yi1 bo2"],"word":"放手一搏"},{"definition":["lit. to break the cauldrons and sink the boats (idiom); fig. to cut off one's means of retreat\/to burn one's boats"],"pinyin":["po4 fu3 chen2 zhou1"],"word":"破釜沉舟"},{"definition":["lit. fight with one's back to the river (idiom); fig. to fight to win or die"],"pinyin":["bei4 shui3 yi1 zhan4"],"word":"背水一战"},{"definition":["to succeed or die trying (idiom)"],"pinyin":["bu4 cheng2 gong1 bian4 cheng2 ren2"],"word":"不成功便成仁"},{"definition":["lit. the path exhausted, the end of the road (idiom); an impasse\/in a plight with no way out\/things have reached a dead end"],"pinyin":["qiong2 tu2 mo4 lu4"],"word":"穷途末路"},{"definition":["to fight with all one has"],"pinyin":["bo2 ming4"],"word":"搏命"},{"definition":["without a retreat route\/caught in a dead end\/having burned one's bridges"],"pinyin":["wu2 lu4 ke3 tui4"],"word":"无路可退"},{"definition":["place sb on a field of death and he will fight to live (idiom based on Sunzi's \"The Art of War\" 孫子兵法|孙子兵法[Sun1 zi3 Bing1 fa3]); to fight desperately when confronting mortal danger\/fig. to find a way out of an impasse"],"pinyin":["zhi4 zhi1 si3 di4 er2 hou4 sheng1"],"word":"置之死地而后生"},{"definition":["to burn both jade and common stone\/to destroy indiscriminately (idiom)"],"pinyin":["yu4 shi2 ju4 fen2"],"word":"玉石俱焚"},{"definition":["desperate straits"],"pinyin":["jue2 jing4"],"word":"绝境"},{"definition":["to be at an impasse (idiom)\/in a tight spot\/at the end of one's rope\/desperate"],"pinyin":["zou3 tou2 wu2 lu4"],"word":"走投无路"},{"definition":["failed and wiped over the floor (idiom); to fail utterly\/a crushing defeat\/beaten and in a hopeless position"],"pinyin":["yi1 bai4 tu2 di4"],"word":"一败涂地"},{"definition":["lit. either the fish dies or the net splits\/a life and death struggle (idiom)"],"pinyin":["yu2 si3 wang3 po4"],"word":"鱼死网破"},{"definition":["stake (in a gamble)\/(what is at) stake"],"pinyin":["du3 zhu4"],"word":"赌注"},{"definition":["to be determined"],"pinyin":["jue2 yi4"],"word":"决意"},{"definition":["mountain and river exhausted (idiom); at the end of the line\/nowhere to go"],"pinyin":["shan1 qiong2 shui3 jin4"],"word":"山穷水尽"}]}