{"definition":["college\/school (old)"],"pinyin":["xue2 tang2"],"traditional":["學堂"],"rank":18776.0,"normalized_rank":0.26270060022665903,"fraction":0.000002713724083363319,"cumulative_fraction":0.9717143887943804,"word":"学堂","characters":[{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"学"},{"definition":["(main) hall\/large room for a specific purpose\/CL:間|间[jian1]\/relationship between cousins etc on the paternal side of a family\/of the same clan\/classifier for classes, lectures etc\/classifier for sets of furniture"],"pinyin":["tang2"],"word":"堂"}],"containing_words":[{"definition":["college of Western learning in late Qing"],"pinyin":["yang2 wu4 xue2 tang2"],"word":"洋务学堂"},{"definition":["Fuzhou Naval College, a.k.a. Foochow Naval Dockyard School, set up in 1866 by the Qing dynasty"],"pinyin":["Chuan2 zheng4 Xue2 tang2"],"word":"船政学堂"},{"definition":["Mawei River naval college, alternative name for Fuzhou naval college 福州船政學堂|福州船政学堂, set up in 1866 by the Qing dynasty"],"pinyin":["Ma3 wei3 shui3 shi1 xue2 tang2"],"word":"马尾水师学堂"}],"sentences":[{"english":"The author has also probed the historical role and meaning of the overseas Chinese school songs.","chinese":"作者也分析了海外学堂乐歌的历史作用和意义。"},{"english":"How to just want to consult with Luan school let Yao Zhenzhen be dead.","chinese":"自己来只是想和栾学堂商量怎么让姚珍珍死心。"},{"english":"In 1897, Jiangsu had the first normal school.","chinese":"1897年，江苏出现了第一所师范学堂。"},{"english":"John takes part in many school avtivities.","chinese":"约翰参加许多学堂里的营谋。"},{"english":"Li Shutong teaches at the Normal College of Zhejiang, with Feng Zikai as one of his students.","chinese":"李叔同任教于浙江两级师范学堂，学生中包括丰子恺。"},{"english":"My crying drove me prematurely into the Oriental Seminary.","chinese":"我的哭闹使我年龄不到就被送到东方学堂去了。"},{"english":"Alright, welcome back to CS50, this is the start of week 4.","chinese":"欢迎来到CS50学堂，这是第四周的课程。"},{"english":"Yao Zhenzhen but come back see Luan school game.","chinese":"姚珍珍可是特地回来看栾学堂比赛的。"},{"english":"If you were only one inch tall, you’d ride a worm to school.","chinese":"假如你身高只有一寸，你或许会骑着蚯蚓去学堂。"},{"english":"Let Luan school and GuanYa before the memorial tablet of LuanFu kowtow to apologize.","chinese":"让栾学堂和关雅丽在栾父的牌位前磕头认错。"},{"english":"Luan school who also hard, can only be sandwiched between two women by air splint.","chinese":"栾学堂谁也说不得，只能夹在两个女人中间受夹板气。"},{"english":"GuanYa lili is a should be under, but also asked whether Luan school abandon themselves.","chinese":"关雅丽却一口应下，还问栾学堂是否嫌弃自己。"},{"english":"Why do we choose Baowei school?","chinese":"为什么选择宝威学堂？"},{"english":"After I go back to study, for after ten years in the Tsinghua school.","chinese":"我回去后进行研究，经过十多年的清华学堂。"},{"english":"Master xu day not see Luan school worried that an accident, is to look for him.","chinese":"徐师傅一整天没有见栾学堂担心出事，就去找他。"},{"english":"Mr Yao huiyong, please the boss a few people to FengZeYuan tea, Luan school were there, too.","chinese":"姚先生请雍老板几个人到丰泽园喝茶，栾学堂也去了。"}],"related":[{"definition":["private school (in former times)"],"pinyin":["si1 shu2"],"word":"私塾"},{"definition":["academy of classical learning (Tang Dynasty - Qing Dynasty)"],"pinyin":["shu1 yuan4"],"word":"书院"},{"definition":["private school"],"pinyin":["shu2"],"word":"塾"},{"definition":["free school (old)"],"pinyin":["yi4 xue2"],"word":"义学"},{"definition":["lecture hall\/CL:家[jia1],間|间[jian1]"],"pinyin":["jiang3 tang2"],"word":"讲堂"},{"definition":["the first modern Chinese library established in 1898 by William A.P. Martin 丁韙良|丁韪良, becoming the foundation for Peking University library"],"pinyin":["Tong2 wen2 guan3"],"word":"同文馆"},{"definition":["school or academic institution (old)"],"pinyin":["guan1 xue2"],"word":"官学"},{"definition":["primary school"],"pinyin":["meng2 guan3"],"word":"蒙馆"},{"definition":["Imperial College (or Academy), the highest educational body in imperial China"],"pinyin":["Guo2 zi3 jian4"],"word":"国子监"},{"definition":["school building\/school\/(Tw) student dormitory"],"pinyin":["xue2 she4"],"word":"学舍"},{"definition":["Ming or Qing dynasty school"],"pinyin":["she4 xue2"],"word":"社学"},{"definition":["teashop with performance by 評書|评书 story tellers\/(attached to name of publishing houses)\/(in former times) private school\/library (of classic texts)"],"pinyin":["shu1 guan3"],"word":"书馆"},{"definition":["Imperial College of Supreme Learning, established in 124 BC, and the highest educational institute in ancient China until the Sui Dynasty"],"pinyin":["Tai4 xue2"],"word":"太学"},{"definition":["to advance one's learning\/to enter the prefecture school under the imperial examination system"],"pinyin":["jin4 xue2"],"word":"进学"},{"definition":["school begins\/give a course\/teach a subject"],"pinyin":["kai1 ke4"],"word":"开课"},{"definition":["primary school"],"pinyin":["meng2 shu2"],"word":"蒙塾"}]}