{"definition":["to hold on to\/to defend\/to keep\/to guard"],"pinyin":["shou3 zhu5"],"traditional":["守住"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"守住","characters":[{"definition":["to guard\/to defend\/to keep watch\/to abide by the law\/to observe (rules or ritual)\/nearby\/adjoining"],"pinyin":["shou3"],"word":"守"},{"definition":["to live\/to dwell\/to stay\/to reside\/to stop\/(suffix indicating firmness, steadiness, or coming to a halt)"],"pinyin":["zhu4"],"word":"住"}],"containing_words":[],"sentences":[{"english":"But can convey with the character only, we should defend that adorably .","chinese":"但只能用文字表达的，我们要把那块美妙守住。"},{"english":"He can withhold the China nationalism and in the same time to blow his horn of democracy loudly.","chinese":"他一边能守住民族大义，也能高吹民主的号角。"},{"english":"Keep the mind pure and undefiled. Remain calm and serene always.","chinese":"守住清净无为的心，让心时时寂静。"},{"english":"Whether can hold you give me beauty?","chinese":"是否就能守住你给我的美？"},{"english":"The most our one battalion can manage is to keep the road to the county town open.","chinese":"镇里的一营兵只够守住那条到县里去的要路。"},{"english":"The Japanese aggressors in order to hold their positions, you must ensure WanDing bridge is not an accident.","chinese":"日寇为了守住阵地，必须要保证畹町桥不出事。"},{"english":"Can we still keep that pure emotion?","chinese":"我们是否还能守住那份单纯的感情？"},{"english":"But as difficult as the testing may be, we can keep our faith in God.","chinese":"不过，熬炼纵然难受，我们仍然能守住对神的信心。"},{"english":"Dr Livesey take the north side, if you please;","chinese":"利弗西医生，烦劳你守住北面。"},{"english":"To keep the fruit of \"shaking\" it is necessary to have the support of blazing fire.","chinese":"为了守住“摇”来地成果，必须借以烈火。"},{"english":"Ripple but have no language, guarded happiness of this pond. This is from cradle to the grave one a life time","chinese":"荡漾而无语，守住了这一池的幸福。"},{"english":"In front of her, hold the moral bottom line, is the minimum life part.","chinese":"在美色面前，守住道德底线，是做人的起码本分。"},{"english":"The goal now is to hold Buner.","chinese":"现在的目标是守住布纳。"},{"english":"Holding a quiet heart.","chinese":"守住一颗宁静的心。"},{"english":"This time, the Spurs made it hold up.","chinese":"而这一次，马刺守住了自己。"},{"english":"Holding this hill-top for twenty-four hours will ensure our victory over the enemy.","chinese":"能守住这个山顶24小时就可以保证我们战胜敌人。"}],"related":[{"definition":["to defend one's property to the death\/to cling obstinately to old habits\/die-hard"],"pinyin":["si3 shou3"],"word":"死守"},{"definition":["to preserve\/to save"],"pinyin":["bao3 zhu4"],"word":"保住"},{"definition":["to guard\/to defend\/to keep watch\/to abide by the law\/to observe (rules or ritual)\/nearby\/adjoining"],"pinyin":["shou3"],"word":"守"},{"definition":["(military) (of a city etc) to fall into enemy hands\/(fig.) to take a turn for the worse"],"pinyin":["shi1 shou3"],"word":"失守"},{"definition":["to withstand\/to stand up to"],"pinyin":["ding3 zhu4"],"word":"顶住"},{"definition":["to strongly defend one's position\/to be entrenched\/to cling to"],"pinyin":["gu4 shou3"],"word":"固守"},{"definition":["to retreat and defend\/to withdraw and maintain one's guard"],"pinyin":["tui4 shou3"],"word":"退守"},{"definition":["to control\/to curb\/to restrict\/to impede\/to pin down (enemy troops)"],"pinyin":["qian1 zhi4"],"word":"牵制"},{"definition":["to take back (forcibly)\/to recapture\/to win back"],"pinyin":["duo2 hui2"],"word":"夺回"},{"definition":["to escape unscathed\/to get through in one piece"],"pinyin":["quan2 shen1 er2 tui4"],"word":"全身而退"},{"definition":["to make a breakthrough\/to break through\/to breach (military)"],"pinyin":["gong1 po4"],"word":"攻破"},{"definition":["to defeat\/to smash\/to rout"],"pinyin":["ji1 kui4"],"word":"击溃"},{"definition":["to hold up\/to hinder\/to stall"],"pinyin":["tuo1 zhu4"],"word":"拖住"},{"definition":["to beat back\/to repel"],"pinyin":["ji1 tui4"],"word":"击退"},{"definition":["to seek to protect\/to ensure\/to maintain\/to guard"],"pinyin":["li4 bao3"],"word":"力保"},{"definition":["to seize\/to capture\/to wrest control of"],"pinyin":["duo2 qu3"],"word":"夺取"}]}