{"definition":["to arrange\/to plan\/to set up\/arrangements\/plans"],"pinyin":["an1 pai2"],"traditional":["安排"],"rank":769.0,"normalized_rank":0.010759307710604005,"fraction":0.0002031823174331981,"cumulative_fraction":0.5782064878794845,"word":"安排","characters":[{"definition":["surname An","content\/calm\/still\/quiet\/safe\/secure\/in good health\/to find a place for\/to install\/to fix\/to fit\/to bring (a charge against sb)\/to pacify\/to harbor (good intentions)\/security\/safety\/peace\/ampere"],"pinyin":["An1","an1"],"word":"安"},{"definition":["a row\/a line\/to set in order\/to arrange\/to line up\/to eliminate\/to drain\/to push open\/platoon\/raft\/classifier for lines, rows etc"],"pinyin":["pai2"],"word":"排"}],"containing_words":[],"sentences":[{"english":"The remaining places on the Middletons' front row are yet to be confirmed.","chinese":"剩余的座位安排尚有待确定。"},{"english":"And we scheduled it and we get it and my dad and my sister would help trim it.","chinese":"先做安排然后实践，爸爸和姐姐会帮忙修剪圣诞树。"},{"english":"As you can see, there are some consequences with the current arrangement.","chinese":"正如您所看到的，当前这种安排还存有许多问题。"},{"english":"As for whether he will visit the DPRK, I am not aware of such an arrangement.","chinese":"至于他是否去朝鲜，目前我没有听说有这方面的安排。"},{"english":"In the beginning the training sessions were held at Volvo Trucks dealerships on Saturdays.","chinese":"最初的培训课程由沃尔沃卡车公司安排在周日进行。"},{"english":"The workers phased the various processes in shirt production.","chinese":"工人们安排好衬衣生产的各道工序。"},{"english":"L2. Due to the destination is an inland city, we have to arrange sea-land intermodal transportation.","chinese":"由于目的地是内陆城市，我们只好安排海陆联运。"},{"english":"No matter how carefully I plan my time, the plan always goes wrong.","chinese":"不论怎么仔细安排时间，我的计划总是出问题。"},{"english":"I dovetailed my work arrangements with hers.","chinese":"我把自己的工作和她的工作做了妥善安排。"},{"english":"We can reset the seam and take in some of the material.","chinese":"我们可以重新安排缝口，并收进一点衣料。"},{"english":"Add a loop or make a schedule to generate large data volumes.","chinese":"添加一个循环或者做一个安排以生成大型的数据集。"},{"english":"Three, we will spend the excess revenue in the central government budget in an appropriate way.","chinese":"三是合理安排中央财政超收收入。"},{"english":"The letter added that counselling had been arranged for pupils and staff.","chinese":"信中说，已为学生和教职员工安排了心理咨询。"},{"english":"And the test arrangement is the important constituent part of the educational administration management.","chinese":"而考场安排管理系统是教务管理系统的重要组成部分。"},{"english":"No, I don't think I have any plans. Why do you ask?","chinese":"不忙，我想我没什么安排。你问来干嘛？"},{"english":"You have other plans on a Wednesday afternoon?","chinese":"难道你星期三下午还有其他安排吗？"}],"related":[{"definition":["to put in order\/to arrange\/to decorate\/to fix up\/to deploy"],"pinyin":["bu4 zhi4"],"word":"布置"},{"definition":["specialist\/person appointed for specific task"],"pinyin":["zhuan1 ren2"],"word":"专人"},{"definition":["plan\/project\/program\/to plan\/to map out\/CL:個|个[ge4],項|项[xiang4]"],"pinyin":["ji4 hua4"],"word":"计划"},{"definition":["to distribute\/to assign\/to allocate\/to partition (a hard drive)"],"pinyin":["fen1 pei4"],"word":"分配"},{"definition":["matters\/arrangements"],"pinyin":["shi4 yi2"],"word":"事宜"},{"definition":["to shift to an earlier date\/to do sth ahead of time\/in advance"],"pinyin":["ti2 qian2"],"word":"提前"},{"definition":["to draw up\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制定"},{"definition":["as the time draws near\/at the last moment\/temporary\/interim\/ad hoc"],"pinyin":["lin2 shi2"],"word":"临时"},{"definition":["rest\/to rest"],"pinyin":["xiu1 xi5"],"word":"休息"},{"definition":["to notify\/to inform\/notice\/notification\/CL:個|个[ge4]"],"pinyin":["tong1 zhi1"],"word":"通知"},{"definition":["to take a vacation\/to go on holiday"],"pinyin":["xiu1 jia4"],"word":"休假"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"进行"},{"definition":["to work\/(of a machine) to operate\/job\/work\/task\/CL:個|个[ge4],份[fen4],項|项[xiang4]"],"pinyin":["gong1 zuo4"],"word":"工作"},{"definition":["according to\/in accordance with\/in the light of\/on the basis of"],"pinyin":["an4 zhao4"],"word":"按照"},{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"word":"协助"},{"definition":["mission\/assignment\/task\/duty\/role\/CL:項|项[xiang4],個|个[ge4]"],"pinyin":["ren4 wu5"],"word":"任务"}]}