{"definition":["to find a place for\/to help settle down\/to arrange for\/to get into bed\/placement"],"pinyin":["an1 zhi4"],"traditional":["安置"],"rank":3842.0,"normalized_rank":0.053754564660781,"fraction":0.00003495259102056731,"cumulative_fraction":0.8252647209414169,"word":"安置","characters":[{"definition":["surname An","content\/calm\/still\/quiet\/safe\/secure\/in good health\/to find a place for\/to install\/to fix\/to fit\/to bring (a charge against sb)\/to pacify\/to harbor (good intentions)\/security\/safety\/peace\/ampere"],"pinyin":["An1","an1"],"word":"安"},{"definition":["to install\/to place\/to put\/to buy"],"pinyin":["zhi4"],"word":"置"}],"containing_words":[{"definition":["to relocate\/to evacuate"],"pinyin":["zhuan3 yi2 an1 zhi4"],"word":"转移安置"}],"sentences":[{"english":"The residents were resettled and church services were held in the Convent.","chinese":"居民被重新安置和教会服务，被关押在女修道院。"},{"english":"Refugees from Messina were relocated to cities throughout Italy.","chinese":"墨西拿难民被重新安置在意大利境内其它城市。"},{"english":"They placed dirt and rocks in a pan and then filled it about half way with water.","chinese":"他们在平底锅安置了土和岩石然后填装了一半。"},{"english":"A workbench is set up to assemble analog cameras in the Leica assembly room.","chinese":"在徕卡的装配车间里，安置着组装类似相机的工作台。"},{"english":"What is the installation elevation of this pipeline?","chinese":"这条管线的安置标高是多少？"},{"english":"Or ever I was aware, my soul made me like the chariots of Amminadib.","chinese":"不知不觉，我的心将我安置在我尊长的车中。"},{"english":"It is ideal for keeping in the living room.","chinese":"客厅是其理想的安置地。"},{"english":"The world seemed very small - there was no place for me and my little roll of bedding.","chinese":"我觉得世界很小，没有安置我与我的小铺盖卷的地方。"},{"english":"The placement of dollies on carrier pallets can also easily be carried out after the palletizing process.","chinese":"安置承运人托盘推车上也可以轻易地进行后码垛进程。"},{"english":"She was receiving treatment in Huaxi Hospital in Chengdu. Her conditions were not immediately available.","chinese":"她被安置在成都华西医院治疗，伤情目前还不清楚。"},{"english":"Bogey tablets placed in the top of Road.","chinese":"神位忌安置在道的上方。"},{"english":"The villagers whose cottages are destroyed by the floods have to be relocated immediately.","chinese":"房舍被洪水冲坏的村民必须立即被安置到其他地方。"},{"english":"Other similar steel statues are already in place in Chicago and Santa Clara, California.","chinese":"其他类似的钢像也已经安置在芝加哥与圣克拉拉。"},{"english":"Releases and resettlements are now happening more quickly.","chinese":"释放和重新安置的步伐已经加快。"},{"english":"It is a famous temple in China. It was built in ancient times to house the fingerbones of Sakyamuni, the founder of Buddhism.","chinese":"它是我国古代安置释迦牟尼佛骨舍利的著名寺院。"},{"english":"This vending machine is provided by a food company from the UnitedKingdom.","chinese":"人工售货机是由英国的一家食品公司安置在这里的。"}],"related":[{"definition":["to move\/to relocate\/removal"],"pinyin":["ban1 qian1"],"word":"搬迁"},{"definition":["to expropriate\/to commandeer"],"pinyin":["zheng1 yong4"],"word":"征用"},{"definition":["to set sth aside\/to let sth lie idle\/idle\/unused"],"pinyin":["kong1 zhi4"],"word":"空置"},{"definition":["to reside\/to dwell\/to live in a place\/resident in"],"pinyin":["ju1 zhu4"],"word":"居住"},{"definition":["to provide a place to stay\/to house\/to accommodate\/(of an institution etc) to take in\/to accept"],"pinyin":["shou1 rong2"],"word":"收容"},{"definition":["to migrate\/to move"],"pinyin":["qian1 yi2"],"word":"迁移"},{"definition":["to compensate\/to make up"],"pinyin":["bu3 chang2"],"word":"补偿"},{"definition":["appropriate\/proper"],"pinyin":["tuo3 shan4"],"word":"妥善"},{"definition":["to distribute\/to assign\/to allocate\/to partition (a hard drive)"],"pinyin":["fen1 pei4"],"word":"分配"},{"definition":["to stay behind to take care of things"],"pinyin":["liu2 shou3"],"word":"留守"},{"definition":["to tear down\/to demolish\/to dismantle\/to remove"],"pinyin":["chai1 chu2"],"word":"拆除"},{"definition":["to stay at\/to live in (temporarily)"],"pinyin":["qi1 shen1"],"word":"栖身"},{"definition":["habitation\/dwelling place\/residence\/CL:處|处[chu4]"],"pinyin":["zhu4 suo3"],"word":"住所"},{"definition":["to assign (a task to different people)\/to allocate"],"pinyin":["fen1 pai4"],"word":"分派"},{"definition":["to purchase"],"pinyin":["gou4 zhi4"],"word":"购置"},{"definition":["to withdraw from\/to evacuate"],"pinyin":["che4 li2"],"word":"撤离"}]}