{"definition":["to find a place for\/to help settle down\/to arrange for\/undisturbed\/peaceful"],"pinyin":["an1 dun4"],"traditional":["安頓"],"rank":20191.0,"normalized_rank":0.2824982860660669,"fraction":0.000002349363926715936,"cumulative_fraction":0.9752909463403016,"word":"安顿","characters":[{"definition":["surname An","content\/calm\/still\/quiet\/safe\/secure\/in good health\/to find a place for\/to install\/to fix\/to fit\/to bring (a charge against sb)\/to pacify\/to harbor (good intentions)\/security\/safety\/peace\/ampere"],"pinyin":["An1","an1"],"word":"安"},{"definition":["to stop\/to pause\/to arrange\/to lay out\/to kowtow\/to stamp (one's foot)\/at once\/classifier for meals, beatings, scoldings etc: time, bout, spell, meal"],"pinyin":["dun4"],"word":"顿"}],"containing_words":[],"sentences":[{"english":"We settled in, getting the wood stove going and then propping our boots around it to dry.","chinese":"我们安顿下来，生起木柴炉，把靴子放在炉边烤干。"},{"english":"The government is taking measures to resettle those laid-off workers.","chinese":"政府正采取措施重新安顿那些失业工人。"},{"english":"In China, Overseas Chinese Farm is the most significant organization that collectively settled the returned Vietnamese Chinese refugees.","chinese":"华侨农场是中国安顿越南归难侨最集中的社区。"},{"english":"The mother cat settled down in the basket with her kittens.","chinese":"猫妈妈和她的小宝宝们在篮子里安顿下来。"},{"english":"Our horse was bedded down in the barn by the stable boy.","chinese":"我们的马被小马夫安顿好在马厩里了。"},{"english":"The soldiers were billeted on an old lady.","chinese":"士兵们已安顿在一位老太太家里。"},{"english":"\"They don't want to settle, \" one official said dismissively.","chinese":"“他们不想安顿下来，”一位官员以嘲笑的口吻说道。"},{"english":"The first thing they needed to do was to check the geographical setting and settled down.","chinese":"他们做的第一件事就是要查看地理环境并安顿下来。"},{"english":"After settling down at Ellis Island.","chinese":"在埃利斯岛安顿下来后。"},{"english":"Her boyfriend is waiting for her, but she has no plans to settle down.","chinese":"她的男朋友正在等她，可她并不打算就此安顿下来。"},{"english":"I have been settling in well in Launceston and have made a few new friends.","chinese":"现在一切已安顿，亦在此地交了一些朋友。"},{"english":"Through many whetting difficult, settle down in Hong Kong finally, open a small business.","chinese":"经过许多磨难，终于在香港安顿下来，开了个小买卖。"},{"english":"Settle down far from town get him a pirogue.","chinese":"远离都市地方安顿下来弄艘独木舟。"},{"english":"Let's get together for a chat, as soon as you are settled.","chinese":"您安顿一下之后，让我们聚在一起叙谈一下。"},{"english":"The Separatists chose to settle just south of the Hudson River.","chinese":"分离派选择在哈德逊河南岸安顿下来。"},{"english":"The orphon was placed in a good home.","chinese":"那个孤儿被安顿在一个善良人家里。"}],"related":[{"definition":["to put in order\/to tidy up\/to pack\/to repair\/(coll.) to sort sb out\/to fix sb"],"pinyin":["shou1 shi5"],"word":"收拾"},{"definition":["settled\/accomplished\/ready"],"pinyin":["ting2 dang4"],"word":"停当"},{"definition":["to go on a journey\/to leave"],"pinyin":["dong4 shen1"],"word":"动身"},{"definition":["to have a rest\/to stay for the night\/to go to bed\/to sleep"],"pinyin":["xie1 xi5"],"word":"歇息"},{"definition":["residence\/dwelling\/dwelling place"],"pinyin":["zhu4 chu4"],"word":"住处"},{"definition":["to go to bed\/to retire for the night"],"pinyin":["an1 xie1"],"word":"安歇"},{"definition":["to set out\/to leave"],"pinyin":["qi3 cheng2"],"word":"起程"},{"definition":["to take leave"],"pinyin":["ci2 bie2"],"word":"辞别"},{"definition":["to look after\/to attend to\/to have in care"],"pinyin":["zhao4 kan4"],"word":"照看"},{"definition":["to stay for a time\/to stop over\/to lodge\/to sink down (into soft ground)\/leftovers"],"pinyin":["luo4 jiao3"],"word":"落脚"},{"definition":["clothes and other items packed for traveling\/baggage\/luggage"],"pinyin":["xing2 zhuang1"],"word":"行装"},{"definition":["to tend\/to take care of sb"],"pinyin":["zhao4 liao4"],"word":"照料"},{"definition":["appropriate\/proper\/ready"],"pinyin":["tuo3 dang5"],"word":"妥当"},{"definition":["to bribe\/to get (luggage) ready\/to put in order\/to organize things\/(baseball) RBI (run batted in)"],"pinyin":["da3 dian5"],"word":"打点"},{"definition":["to find a place for\/to help settle down\/to arrange for\/to get into bed\/placement"],"pinyin":["an1 zhi4"],"word":"安置"},{"definition":["to receive (guests)\/to entertain\/reception"],"pinyin":["zhao1 dai4"],"word":"招待"}]}