{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"traditional":["定"],"rank":1339.0,"normalized_rank":0.0187343472360192,"fraction":0.00012067474088744602,"cumulative_fraction":0.6669386899892403,"word":"定","components":{"unicode":"U+5B9A","character":"定","decomposition":"⿱宀𤴓","decomposition_definitions":[{"word":"⿱"},{"definition":["\"roof\" radical in Chinese characters (Kangxi radical 40), occurring in 家, 定, 安 etc\/see also 寶蓋|宝盖[bao3 gai4]"],"pinyin":["mian2"],"word":"宀"},{"word":"𤴓"}]},"containing_words":[{"definition":["provision\/to fix\/to set\/to formulate\/to stipulate\/to provide\/regulation\/rule\/CL:個|个[ge4]"],"pinyin":["gui1 ding4"],"word":"规定"},{"definition":["surely\/certainly\/necessarily\/fixed\/a certain (extent etc)\/given\/particular\/must"],"pinyin":["yi1 ding4"],"word":"一定"},{"definition":["to decide (to do something)\/to resolve\/decision\/CL:個|个[ge4],項|项[xiang4]\/certainly"],"pinyin":["jue2 ding4"],"word":"决定"},{"definition":["steady\/stable\/stability\/to stabilize\/to pacify"],"pinyin":["wen3 ding4"],"word":"稳定"},{"definition":["to be certain\/to be positive\/assuredly\/definitely\/to give recognition\/to affirm\/affirmative (answer)"],"pinyin":["ken3 ding4"],"word":"肯定"},{"definition":["definite\/certain\/fixed\/to fix (on sth)\/to determine\/to be sure\/to ensure\/to make certain\/to ascertain\/to clinch\/to recognize\/to confirm\/OK (on computer dialog box)"],"pinyin":["que4 ding4"],"word":"确定"},{"definition":["to draw up\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制定"},{"definition":["to orientate\/to position\/to categorize (as)\/to characterize (as)\/positioning\/position\/niche"],"pinyin":["ding4 wei4"],"word":"定位"},{"definition":["to fix\/to fasten\/to set rigidly in place\/fixed\/set\/regular"],"pinyin":["gu4 ding4"],"word":"固定"},{"definition":["to maintain (that sth is true)\/to determine (a fact)\/determination (of an amount)\/of the firm opinion\/to believe firmly\/to set one's mind on\/to identify with"],"pinyin":["ren4 ding4"],"word":"认定"},{"definition":["to appraise\/to identify\/to evaluate"],"pinyin":["jian4 ding4"],"word":"鉴定"},{"definition":["to set a price\/to fix a price"],"pinyin":["ding4 jia4"],"word":"定价"},{"definition":["to appoint\/to assign\/to indicate clearly and with certainty\/designated"],"pinyin":["zhi3 ding4"],"word":"指定"},{"definition":["legal\/statutory\/rightful"],"pinyin":["fa3 ding4"],"word":"法定"},{"definition":["to agree on sth (after discussion)\/to conclude a bargain\/to arrange\/to promise\/to stipulate\/to make an appointment\/stipulated (time, amount, quality etc)\/an arrangement\/a deal\/appointment\/undertaking\/commitment\/understanding\/engagement\/stipulation"],"pinyin":["yue1 ding4"],"word":"约定"}],"sentences":[{"english":"Went to IB-CAS, decided to take the phd exam and try to follow a academician.","chinese":"去了一次北京植物所，定下来报考一位院士的博士。"},{"english":"Objective To research the synthesis method of Apraclonidine.","chinese":"目的探讨安普乐定的合成方法。"},{"english":"The body is the parents decides, the huge leading role is studies drills comes out.","chinese":"身体是父母定的，巨大的主导作用是学“钻”出来的。"},{"english":"Don't try to change my mind, I am resolved on it.","chinese":"甭想使我改变想法，我主意已定。"},{"english":"Her next performance is scheduled for Brazil.","chinese":"她下一场演出已经定在巴西。"},{"english":"Then, set aside 5 or 10 minutes to focus on quieting your thoughts.","chinese":"然后，定5至10分钟来让你的思绪平静下来。"},{"english":"And if it spread much abroad in the skin, then the priest shall pronounce him unclean: it is a plague.","chinese":"若在皮上发散开了，祭司就要定他为不洁净，是灾病。"},{"english":"She advises keeping small talk finely tuned and topical.","chinese":"她建议闲聊时要定好调子选好话题。"},{"english":"Objective To observe the effects of Qingfeifang in treating cough.","chinese":"观察清肺定哮方加减治疗婴幼儿毛细支气管炎的效果。"},{"english":"The order came from an arbitration court in the Hague. Greg Morsbach reports.","chinese":"这项判决是由海牙的一个仲裁法院定的。"},{"english":"With desolation shall the earth be laid waste, and it shall be utterly spoiled: for the Lord hath spoken this word.","chinese":"大地必要完全荒废，惨遭浩劫，因为上主这样定了。"},{"english":"Thread-Safe Function:B function that may be safely invoked concurrently by multiple threads.","chinese":"线程安全函数纷歧定是可重入函数。"},{"english":"Users can use the pre-existing Cmdlets or create their own.","chinese":"用户可以使用预设定的Cmdlet，或者自己创建。"},{"english":"The system focuses on the counterwork stage between decoy and torpedo.","chinese":"该系统将目标定位于声诱饵诱骗鱼雷的对抗阶段。"},{"english":"He was calm and steady when playing difficult things.","chinese":"在演奏一些难度片断时，他依然很淡定。"},{"english":"An experimental method of applying the polarographic double-point determination to complexation titration was proposed.","chinese":"提出在络合滴定中应用极谱双点滴定的实验方法。"}],"related":[{"definition":["middle of the night\/the dead of night"],"pinyin":["ren2 ding4"],"word":"人定"},{"definition":["undecided\/indeterminate\/still in doubt"],"pinyin":["wei4 ding4"],"word":"未定"},{"definition":["success or failure"],"pinyin":["cheng2 bai4"],"word":"成败"},{"definition":["end\/finish"],"pinyin":["zhong1"],"word":"终"},{"definition":["to reach an agreement\/to agree upon"],"pinyin":["yi4 ding4"],"word":"议定"},{"definition":["to allow\/to grant\/in accordance with\/in the light of","accurate\/standard\/definitely\/certainly\/about to become (bride, son-in-law etc)\/quasi-\/para-"],"pinyin":["zhun3","zhun3"],"word":"准"},{"definition":["final conclusion\/accepted argument"],"pinyin":["ding4 lun4"],"word":"定论"},{"definition":["to depend on\/to comply with or listen to sb\/according to\/in the light of"],"pinyin":["yi1"],"word":"依"},{"definition":["compass\/a rule\/regulation\/to admonish\/to plan\/to scheme","variant of 規|规[gui1]"],"pinyin":["gui1","gui1"],"word":"规"},{"definition":["certainly\/must\/will\/necessarily"],"pinyin":["bi4"],"word":"必"},{"definition":["yes","-ism\/only\/alone"],"pinyin":["wei3","wei2"],"word":"唯"},{"definition":["evidently\/clearly\/no wonder\/knowable"],"pinyin":["ke3 zhi1"],"word":"可知"},{"definition":["to make a decision\/resolution\/decisiveness\/resolute"],"pinyin":["jue2 duan4"],"word":"决断"},{"definition":["Bulgaria\/Bulgarian\/abbr. for 保加利亞|保加利亚[Bao3 jia1 li4 ya4]","to defend\/to protect\/to keep\/to guarantee\/to ensure\/civil administration unit in the baojia 保甲[bao3 jia3] system (old)"],"pinyin":["Bao3","bao3"],"word":"保"},{"definition":["to press\/to push\/to leave aside or shelve\/to control\/to restrain\/to keep one's hand on\/to check or refer to\/according to\/in the light of\/(of an editor or author) to make a comment"],"pinyin":["an4"],"word":"按"},{"definition":["to come to a decision\/to fix on (a date etc)\/to determine\/to finalize\/to nail down (a deal etc)"],"pinyin":["qiao1 ding4"],"word":"敲定"}]}