{"definition":["to fix\/to confine to\/freeze frame\/stop motion (filmmaking)"],"pinyin":["ding4 ge2"],"traditional":["定格"],"rank":13711.0,"normalized_rank":0.19183467882976787,"fraction":0.0000048543400036666935,"cumulative_fraction":0.953264117857623,"word":"定格","characters":[{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"},{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"}],"containing_words":[],"sentences":[{"english":"We all trials and hardships to walk, past experience has stopped.","chinese":"我们一路风雨兼程地走来，过去的经历已经定格。"},{"english":"By and by, all came to halt, the autumn in chilly night in frame frozen.","chinese":"时光停滞，渐渐地，定格在这寒夜秋塘落叶。"},{"english":"Your smile on the screen I've already got used to will be fixed to my mind forever.","chinese":"习惯了屏幕那边你熟悉的笑，将永远定格我的心间。"},{"english":"I love you just wishful thinking began as stop-motion.","chinese":"我爱你只是一厢情愿一开始就成为定格。"},{"english":"The method to solve Schrodinger equation with metrix function theory is presented.","chinese":"本文提出应用矩阵函数理论来解薛定格方程的方法。"},{"english":"Shanghai Automobile Museum recounts the century-long auto history.","chinese":"上海汽车博物馆定格了汽车的百年历史。"},{"english":"And critical point, it is interpretation of the numerous freeze-frame moments.","chinese":"而临界，则是无数无常演绎中的瞬间定格。"},{"english":"Memory frames, sad like water diffuse.","chinese":"回忆定格的年间，悲伤如水般弥漫。"},{"english":"The profound affection is sinking, unhurriedly stops, so reaches the very heart of life.","chinese":"深切的情思沉下去，从容定格，抵达生命的内蕴。"},{"english":"Stop-motion animation has the special artistic charm and the characteristic.","chinese":"定格动画的具有特殊的艺术魅力及特性。"},{"english":"Not much, if any of the pale fingertips jump, cold, frozen at the moment of memory.","chinese":"若有若无的惨白，指尖跳跃的冰凉，定格此刻的记忆。"},{"english":"As she exhaled, her face settled into repose.","chinese":"当她呼气的时候，脸孔定格在了安详的表情。"},{"english":"I am a sojourner in your life, and you are my life eternal frames.","chinese":"我是你生命中的过客，而你是我这辈子永恒的定格。"},{"english":"Sometimes the form of death defines the appreciation of the beautiful modeling.","chinese":"死亡形态有时定格为隐喻性的审美化造型。"},{"english":"Dancing is like bank robbery, it takes split-second timing.","chinese":"舞蹈好似银行抢劫，将瞬间永远定格。"},{"english":"But, how do you capture lightning in photographs?","chinese":"但是，你怎样才能把闪电定格在自己的照片里呢？"}],"related":[{"definition":["with a grunting sound it stops (idiom); to come to an end spontaneously (esp. of sound)"],"pinyin":["jia2 ran2 er2 zhi3"],"word":"戛然而止"},{"definition":["still\/immobile\/static\/stationary"],"pinyin":["jing4 zhi3"],"word":"静止"},{"definition":["covered in dust\/dusty\/lying unused for a long time"],"pinyin":["chen2 feng1"],"word":"尘封"},{"definition":["to stay somewhere temporarily\/to stop over"],"pinyin":["ting2 liu2"],"word":"停留"},{"definition":["in an instant\/in a flash"],"pinyin":["shun4 jian1"],"word":"瞬间"},{"definition":["to take a curtain call\/(fig.) to come to an end"],"pinyin":["xie4 mu4"],"word":"谢幕"},{"definition":["the curtain drops\/the end of the show"],"pinyin":["luo4 mu4"],"word":"落幕"},{"definition":["to fade away"],"pinyin":["xiao1 shi4"],"word":"消逝"},{"definition":["to elapse\/to pass away\/to die\/demise"],"pinyin":["shi4 qu4"],"word":"逝去"},{"definition":["to come to nothing (idiom)"],"pinyin":["hua4 wei2 pao4 ying3"],"word":"化为泡影"},{"definition":["to remember\/to recall\/memory\/CL:個|个[ge4]"],"pinyin":["ji4 yi4"],"word":"记忆"},{"definition":["termination\/to finish\/to end\/to conclude\/to close"],"pinyin":["jie2 shu4"],"word":"结束"},{"definition":["(of time) to pass\/to elapse"],"pinyin":["liu2 shi4"],"word":"流逝"},{"definition":["eternal\/everlasting\/fig. to pass into eternity (i.e. to die)"],"pinyin":["yong3 heng2"],"word":"永恒"},{"definition":["one instant\/very short time\/the twinkle of an eye"],"pinyin":["yi1 shun4"],"word":"一瞬"},{"definition":["to recall\/memories\/CL:個|个[ge4]"],"pinyin":["hui2 yi4"],"word":"回忆"}]}