{"definition":["to calibrate (measure or apparatus)\/fixed coefficient"],"pinyin":["ding4 biao1"],"traditional":["定標"],"rank":39782.0,"normalized_rank":0.5566017936843284,"fraction":3.923878610048737e-7,"cumulative_fraction":0.99640394320062,"word":"定标","characters":[{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"},{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"标"}],"containing_words":[{"definition":["scaler"],"pinyin":["ding4 biao1 qi4"],"word":"定标器"}],"sentences":[{"english":"Corner detection is the main task of the image processing in camera calibration.","chinese":"特征角点的提取是摄像机定标中图像处理的主要任务。"},{"english":"In fact, the focus of this paper is the logic verification of the Scaler chip.","chinese":"本文的重点为定标器芯片的逻辑验证。"},{"english":"This can be achieved by SAR Radiometric Calibration.","chinese":"这个工作是由SAR辐射定标完成的。"},{"english":"Fashion designers feel beauty should not have a legal standard.","chinese":"时尚设计师认为美是不需要有个法定标准的。"},{"english":"A floating calibration method for resistance moisture teller is introduced.","chinese":"提出了一种基于浮动定标原理的示值标定方法。"},{"english":"Multi-wavelength intensity calibration procedure based on ICCD detector has been presented.","chinese":"给出了基于ICCD探测器的多波长强度定标方法。"},{"english":"The legal criterion of divorce is proper to resume generalization doctrine.","chinese":"离婚法定标准宜恢复为概括主义。"},{"english":"The calibration method of automatic analysis for seawater nutrients in situ has been optimized.","chinese":"对海水营养盐现场自动测量定标方法进行了优化研究。"},{"english":"Moreover, the calibration scheme is outlined on the basis of the characteristics of radiometry for shooting range.","chinese":"根据靶场辐射测量特点，设计了整体定标方案。"},{"english":"Followed by the statutory criteria for the completion of the land resettlement compensation for the demolition work.","chinese":"随后按法定标准完成了征地拆迁安置补偿工作。"},{"english":"The body cavity mucosa scaling biopsy forceps includes handle with chute on its side;","chinese":"本发明公开了一种体腔粘膜定标活检钳。"},{"english":"Finally, the key technological problems of the calibration technologies under researching are analyzed predicatively.","chinese":"对未来需要开展研究的定标技术做了初步分析。"},{"english":"The V-shaped upper section is provided with a cut-out for the scale and the measuring capillaries.","chinese":"形的上部有一个开口用于定标和测量毛细管。"},{"english":"It has been proved that the device satisfies all requirements of the large aperture infrared opto-electric system by experiments.","chinese":"实验表明，能满足大口径红外光电系统的定标要求。"},{"english":"FPGA synthesis is employed to perform the logic verification for the front-end design of the Scaler.","chinese":"定标器芯片前端设计通过FPGA实现进行逻辑验证。"},{"english":"Secondly, the relation between high resolution spaceborne SAR radiometric calibration and SMP is discussed.","chinese":"定标与卫星运动参数的关联技术。"}],"related":[{"definition":["to stake out (the boundaries of a property etc)\/to demarcate\/(engineering etc) to calibrate"],"pinyin":["biao1 ding4"],"word":"标定"},{"definition":["to calibrate"],"pinyin":["jiao4 zhun3"],"word":"校准"},{"definition":["on-site operations (e.g. surveying)"],"pinyin":["wai4 ye4"],"word":"外业"},{"definition":["bid inviting and bid offering\/bidding\/auction"],"pinyin":["zhao1 tou2 biao1"],"word":"招投标"},{"definition":["parameter (math)\/quantity used as a parameter\/modulus (math.)"],"pinyin":["can1 liang4"],"word":"参量"},{"definition":["to invite bids"],"pinyin":["zhao1 biao1"],"word":"招标"},{"definition":["to advance\/in advance\/beforehand\/to prepare"],"pinyin":["yu4"],"word":"预"},{"definition":["demarcation\/boundary\/delimited\/bound (math.)"],"pinyin":["ding4 jie4"],"word":"定界"},{"definition":["to survey and draw\/to map"],"pinyin":["ce4 hui4"],"word":"测绘"},{"definition":["survey\/to measure\/to gauge\/to determine"],"pinyin":["ce4 liang2"],"word":"测量"},{"definition":["theodolite"],"pinyin":["jing1 wei3 yi2"],"word":"经纬仪"},{"definition":["level (device to determine horizontal)\/spirit level\/surveyor's level"],"pinyin":["shui3 zhun3 yi2"],"word":"水准仪"},{"definition":["to inspect and accept\/acceptance"],"pinyin":["yan4 shou1"],"word":"验收"},{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"标"},{"definition":["norm\/standard\/standard of reference\/base\/base point\/base line\/benchmark\/reference point\/reference frame\/criterion\/data"],"pinyin":["ji1 zhun3"],"word":"基准"},{"definition":["scaler"],"pinyin":["ding4 biao1 qi4"],"word":"定标器"}]}