{"definition":["throne"],"pinyin":["bao3 zuo4"],"traditional":["寶座"],"rank":10002.0,"normalized_rank":0.1399409567249171,"fraction":0.000008267880830206114,"cumulative_fraction":0.9297141671369916,"word":"宝座","characters":[{"definition":["jewel\/gem\/treasure\/precious","variant of 寶|宝[bao3]"],"pinyin":["bao3","bao3"],"word":"宝"},{"definition":["seat\/base\/stand\/CL:個|个[ge4]\/classifier for buildings, mountains and similar immovable objects"],"pinyin":["zuo4"],"word":"座"}],"containing_words":[],"sentences":[{"english":"3Yet you are enthroned as the Holy One; you are the praise of Israel.","chinese":"但你是圣洁的，是用以色列的赞美为宝座的。"},{"english":"On both sides of the seat were armrests , with a lion standing beside each of them.","chinese":"宝座两旁有扶手，靠近扶手有两个狮子站立。"},{"english":"He is the true prince who finds his throne in the heart of the dervish.","chinese":"在托钵僧的心中找到自己的宝座的是真正的王子。"},{"english":"It may sunder the thrones of gods.","chinese":"它可以击破众神的宝座。"},{"english":"Who will grant me that I might know and find him, and come even to his throne?","chinese":"惟愿我知道怎样能寻到天主，能到达他的宝座前。"},{"english":"On the throne sits God who has a book with seven seals.","chinese":"上帝坐在宝座上，拿着一本有七个封印的书。"},{"english":"The students excited are describing in Imperial Palace's that golden small tinkling bell throne.","chinese":"学生们正在兴奋的描述故宫里的那个金銮宝座。"},{"english":"First Rafael Correa, the leftist economist, won the presidency.","chinese":"首先拉斐尔科雷亚，左派经济学家，赢得总统宝座。"},{"english":"So what is the immortal legend of taro push tens of thousands of people lost the throne?","chinese":"那么是什么把仙芋传奇推上万人迷的宝座呢？"},{"english":"Zeus, sitting on his throne, saw with alarm how strong man was becoming.","chinese":"宙斯坐在宝座上看到人类逐渐强大起来，非常惊讶。"},{"english":"You knew of the time Nebuchadnezzar's pride cost him his mind and his throne.","chinese":"你知道尼布甲尼撒的骄傲令他失去理智和宝座。"},{"english":"It is called the river of life and flows from the throne of God.","chinese":"它被称为生命河，从神的宝座流出来。"},{"english":"And we have in Ancient Near Eastern iconography thrones of this type.","chinese":"在古近东时期的肖像研究中我们看见过这样的宝座。"},{"english":"Would you picture a grey-bearded, elderly gentleman perched on a throne?","chinese":"你会否想象一个白发老人，满面胡子，坐在宝座上？"},{"english":"Then the king made a great throne inlaid with ivory and overlaid with pure gold.","chinese":"王用象牙制造一个大宝座，用精金包裹。"},{"english":"St. Cyril did not last long on the throne of St.","chinese":"圣西里尔并没有在圣马可的宝座上持续很长时间。"}],"related":[{"definition":["old-style wooden folding armchair, typically featuring a footrest\/(fig.) position in a hierarchy"],"pinyin":["jiao1 yi3"],"word":"交椅"},{"definition":["to aspire to the throne\/to aim at (the first place etc)"],"pinyin":["wen4 ding3"],"word":"问鼎"},{"definition":["to continue in a post\/(to hold a post) several times in succession\/(to win a title) in successive years\/to stay at number one\/to defend a championship"],"pinyin":["chan2 lian2"],"word":"蝉联"},{"definition":["laurel\/victory garland (in Greek and Western culture)"],"pinyin":["gui4 guan1"],"word":"桂冠"},{"definition":["top of the list"],"pinyin":["bang3 shou3"],"word":"榜首"},{"definition":["to vault"],"pinyin":["yue4 ju1"],"word":"跃居"},{"definition":["to occupy by force\/to seize\/to dominate"],"pinyin":["ba4 zhan4"],"word":"霸占"},{"definition":["to climb over\/to ascend onto\/to mount"],"pinyin":["deng1 shang4"],"word":"登上"},{"definition":["to stand above\/to occupy an important position\/to rank (among the top few)"],"pinyin":["gao1 ju1"],"word":"高居"},{"definition":["variant of 榜[bang3]","notice or announcement\/list of names\/public roll of successful examinees"],"pinyin":["bang3","bang3"],"word":"榜"},{"definition":["to crown\/coronation"],"pinyin":["jia1 mian3"],"word":"加冕"},{"definition":["ranked number one in the world\/the world's first"],"pinyin":["shi4 jie4 di4 yi1"],"word":"世界第一"},{"definition":["(of a list, music chart etc) to reach the top"],"pinyin":["rong2 deng1"],"word":"荣登"},{"definition":["top three"],"pinyin":["qian2 san1 jia3"],"word":"前三甲"},{"definition":["seat of honor\/person in a high-ranking position\/to be promoted to a more senior role\/(genetics) epistatic"],"pinyin":["shang4 wei4"],"word":"上位"},{"definition":["to take (after a struggle)\/to wrest\/to seize\/to capture\/to win (a trophy)"],"pinyin":["duo2 de2"],"word":"夺得"}]}