{"definition":["to implement\/to carry out"],"pinyin":["shi2 shi1"],"traditional":["實施"],"rank":368.0,"normalized_rank":0.005148797447987352,"fraction":0.0003720809133321103,"cumulative_fraction":0.4695185856673024,"word":"实施","characters":[{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"实"},{"definition":["surname Shi","to grant\/to give\/to bestow\/to act\/to carry out"],"pinyin":["Shi1","shi1"],"word":"施"}],"containing_words":[{"definition":["to put into practice\/to carry out (idiom)"],"pinyin":["fu4 zhu1 shi2 shi1"],"word":"付诸实施"},{"definition":["(patent) implementation\/embodiment"],"pinyin":["shi2 shi1 li4"],"word":"实施例"},{"definition":["to put into effect (idiom)"],"pinyin":["jian4 zhi1 shi2 shi1"],"word":"见之实施"}],"sentences":[{"english":"Teacher is a key factor in actualizing education for quality.","chinese":"教师是实施素质教育的关键因素。"},{"english":"It is an inevitable choice to develop the strategy of famous brand for an enterprise in the keen market competitions.","chinese":"实施名牌战略是企业在激烈的市场竞争中的必然选择。"},{"english":"Just show me one county where Dr. Sun's principles have been put in practice.","chinese":"你给我指出哪一个县实施了孙中山先生的三民主义？"},{"english":"The raid was conducted with U. S. military personnel assaulting on two helicopters.","chinese":"实施袭击的是两驾直升机上的美国军方人员。"},{"english":"Implementing customer scenarios to include the flow of defect submissions expands integration coverage.","chinese":"包含缺陷交付流程的实施客户场景扩展了集成的范围。"},{"english":"China is implementing a family planning policy. So I'm the only child in my family.","chinese":"中国正在实施计划生育政策，所以我是家中的独生子。"},{"english":"In the implementation of this cross-century strategy, ethnic issues merit special attention.","chinese":"民族问题在这项跨世纪战略的实施中具有特殊的地位。"},{"english":"This is a superb concept. It should certainly be done.","chinese":"这是一种极好的概念，当然应该实施。"},{"english":"How do these issues influence the implementation and improvement of BASIX?","chinese":"这些问题是怎样影响BASIX的实施和改善的？"},{"english":"They are currently in the process of piloting two programs aimed at getting families outdoors.","chinese":"他们最近还在实施另两个旨在让家庭走向户外的项目。"},{"english":"They (China) are mistakenly trying to impose a flawed Monroe Doctrine in their backyard.","chinese":"中国错误的想在自己的后院实施有缺陷的门罗主义。"},{"english":"Did their parents check up on their whereabouts and set curfews?","chinese":"他们的父母会调查他们的行踪并实施宵禁吗？"},{"english":"Thus, embodiments of a virtual local memory for a graphics processor are disclosed.","chinese":"这样，公开了图形处理器的虚拟本地存储器的实施例。"},{"english":"After hacker attack website is procurable, carry out \" hang a horse \" .","chinese":"当黑客攻击网站得手后，便实施“挂马”。"},{"english":"Since 2003, the Tourism-based Country Strategy has been established and implemented in Japan.","chinese":"自2003年以来，日本确立并实施了观光立国战略。"},{"english":"Cross-sectoral international collaboration key to implementing IHR.","chinese":"跨部门的国际合作是实施《国际卫生条例》的关键。"}],"related":[{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"实行"},{"definition":["to put in place\/to put into practice\/to take effect"],"pinyin":["shi1 xing2"],"word":"施行"},{"definition":["measure\/step\/CL:個|个[ge4]"],"pinyin":["cuo4 shi1"],"word":"措施"},{"definition":["to adopt or carry out (measures, policies, course of action)\/to take"],"pinyin":["cai3 qu3"],"word":"采取"},{"definition":["to put into effect\/to carry out"],"pinyin":["tui1 xing2"],"word":"推行"},{"definition":["to draw up\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制定"},{"definition":["to launch\/to develop\/to unfold\/(of an exhibition etc) to open"],"pinyin":["kai1 zhan3"],"word":"开展"},{"definition":["to officially launch (a policy, program etc)\/to appear on stage\/to appear publicly\/(of a bar girl) to leave with a client"],"pinyin":["chu1 tai2"],"word":"出台"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推进"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落实"},{"definition":["to move\/to act\/action\/decision\/conduct\/manner"],"pinyin":["ju3 cuo4"],"word":"举措"},{"definition":["to implement\/to carry out\/to execute\/to run"],"pinyin":["zhi2 xing2"],"word":"执行"},{"definition":["policy\/CL:個|个[ge4]"],"pinyin":["zheng4 ce4"],"word":"政策"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"进行"},{"definition":["to try out\/to test"],"pinyin":["shi4 xing2"],"word":"试行"},{"definition":["to start (a machine)\/(fig.) to set in motion\/to launch (an operation)\/to activate (a plan)"],"pinyin":["qi3 dong4"],"word":"启动"}]}