{"definition":["actual situation\/the ultimate essence of things (Buddhism)"],"pinyin":["shi2 xiang4"],"traditional":["實相"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"实相","characters":[{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"实"},{"definition":["each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang","appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)"],"pinyin":["xiang1","Xiang1","xiang4"],"word":"相"}],"containing_words":[],"sentences":[{"english":"Your reality is only spirit. Therefore you are in a state of grace forever.","chinese":"你的实相是纯粹属灵的，因此你永存于恩典之境。"},{"english":"Instead of running away from the problem, we are facing reality as it is.","chinese":"我没有逃避问题，反之我是如实地正视实相。"},{"english":"She who sends energy to the matrix that perpetuates the reality in which souls may manifest.","chinese":"向矩阵传送能量的她使灵魂可以显现的实相永存。"},{"english":"We must experience directly the reality of this mental-physical phenomenon.","chinese":"我们必须直接体验这身心现象的实相。"},{"english":"In reality, though, she is none other than our own buddha nature.","chinese":"然而于实相中，伊喜措嘉与我们自己的佛性并无分别。"},{"english":"Remember, to truly understand Ultimate Reality you","chinese":"记住，要真正领会终极实相，你得走出你的心智。"},{"english":"In the waking state it focuses in physical reality.","chinese":"它在清醒状态时聚焦于物质实相。"},{"english":"This is the Self that never sinned, nor made an image to replace reality.","chinese":"这个自性永不犯罪，也不会妄造形象来取代实相。"},{"english":"To put it differently, does the thought process discover the real?","chinese":"换句话说，思维过程是否能发现实相？"},{"english":"The awakened one is one with the what is.","chinese":"觉醒的人与如是的实相在一起。"},{"english":"Samadhi is the only stable unchanging Reality.","chinese":"三摩地唯一的稳定不变的实相。"},{"english":"What difference does the content of a dream make in reality?","chinese":"不同的梦在实相里又有何分别？"},{"english":"It is only then that we will find reality.","chinese":"只有这时，我们才能发现实相。"},{"english":"Conscious guardians seek to support the whole of the consensus reality or planet or star that they reside upon.","chinese":"者寻求去支持一致实相或所居住的行星或恒星的整体。"},{"english":"Is this part of becoming reconnected to the larger reality?","chinese":"这部分正连接到更大的实相？"},{"english":"All probable reality is based on the actualized thought forms and free will of mankind.","chinese":"所有可能的实相都是基于实现人类的自由意志与想法。"}],"related":[{"definition":["emptiness"],"pinyin":["kong1 xing4"],"word":"空性"},{"definition":["the appearance of all things (Buddhism)"],"pinyin":["zhu1 xiang4"],"word":"诸相"},{"definition":["to understand\/to comprehend the ultimate essence of things (Buddhism)"],"pinyin":["wu4 ru4"],"word":"悟入"},{"definition":["common person\/ordinary guy\/mortal man"],"pinyin":["fan2 fu1"],"word":"凡夫"},{"definition":["to become enlightened (Buddhism)"],"pinyin":["kai1 wu4"],"word":"开悟"},{"definition":["(of a deity) to take a material shape\/to appear"],"pinyin":["shi4 xian4"],"word":"示现"},{"definition":["to follow\/to go along with"],"pinyin":["sui2 shun4"],"word":"随顺"},{"definition":["fabricated"],"pinyin":["xu1 wang4"],"word":"虚妄"},{"definition":["wild fantasy\/unwarranted thought"],"pinyin":["wang4 nian4"],"word":"妄念"},{"definition":["the Five Aggregates (from Sanskrit \"skandha\") (Buddhism)"],"pinyin":["wu3 yun4"],"word":"五蕴"},{"definition":["life and death"],"pinyin":["sheng1 mie4"],"word":"生灭"},{"definition":["the Four Noble Truths (Buddhism)\/see also 四諦|四谛[si4 di4] and 苦集滅道|苦集灭道[ku3 ji2 mie4 dao4]"],"pinyin":["si4 sheng4 di4"],"word":"四圣谛"},{"definition":["all living things"],"pinyin":["zhong4 sheng1"],"word":"众生"},{"definition":["the Four Noble Truths (Budd.), namely: all life is suffering 苦, the cause of suffering is desire 集, emancipation comes only by eliminating passions 滅|灭, the way 道 to emancipation is the Eight-fold Noble Way 八正道\/also called 四諦|四谛"],"pinyin":["ku3 ji2 mie4 dao4"],"word":"苦集灭道"},{"definition":["the Four Noble Truths (Budd.), covered by the acronym 苦集滅道: all life is suffering 苦, the cause of suffering is desire 集, emancipation comes only by eliminating passions 滅|灭, the way 道 to emancipation is the Eight-fold Noble Way 八正道"],"pinyin":["si4 di4"],"word":"四谛"},{"definition":["annihilation (of soul, Sanskrit uccheda)"],"pinyin":["duan4 mie4"],"word":"断灭"}]}