{"definition":["to examine and approve\/to endorse"],"pinyin":["shen3 pi1"],"traditional":["審批"],"rank":2231.0,"normalized_rank":0.03121458452842332,"fraction":0.00006697876855543347,"cumulative_fraction":0.7470671228804412,"word":"审批","characters":[{"definition":["to examine\/to investigate\/carefully\/to try (in court)"],"pinyin":["shen3"],"word":"审"},{"definition":["to ascertain\/to act on\/to criticize\/to pass on\/classifier for batches, lots, military flights\/tier (for the ranking of universities and colleges)"],"pinyin":["pi1"],"word":"批"}],"containing_words":[],"sentences":[{"english":"They might be required information for the approval or rejection decision.","chinese":"他们在决定审批或拒绝时可能需要这些信息。"},{"english":"Replacing thiomersal in vaccines would require regulatory approval.","chinese":"替换疫苗中的硫柳汞还需要管制审批。"},{"english":"Liaising and expediting approval of the quotation with the client.","chinese":"联系客户，并加快对客户报价的审批。"},{"english":"The Shareholder shall cause the Company to report such appointment to the original examination and approval authority for the record.","chinese":"股东应责成公司将该委任报原审批机关备案。"},{"english":"Such advance studies can greatly expedite regulatory approval.","chinese":"这种预先研究可以大大加快管制审批。"},{"english":"The new US$100 million funding is subject to approval by the World Bank's Board of Directors.","chinese":"1亿美元追加资金需经世行董事会审批。"},{"english":"Victor Li said that at present, have all been through the project planning approval.","chinese":"李泽钜表示，目前项目规划已经全部通过审批。"},{"english":"Article 21: The establishment of a branch by a company with an investment nature shall be submitted to the Ministry of Commerce for examination and approval.","chinese":"第二十一条投资性公司设立分支机构应报商务部审批。"},{"english":"Today's approval of new drugs in the international community needs to carry out the raw data transmission.","chinese":"如古旧药的审批须要反在邦际间入行本初数据的传输。"},{"english":"Some 200 more are believed to be awaiting approval.","chinese":"据信，还有大约200家机构正等待审批。"},{"english":"Approval of construction of the heliport to go through and above the provincial level government, and military.","chinese":"修建直升机场的审批要经过省级以上政府，以及军方。"},{"english":"All expenses or applications of expenses have to be approved by the budget holders.","chinese":"所有借支或费用报销均需由预算控制人审批。"},{"english":"His application has been sent up for approval.","chinese":"他的申请已经送上去审批。"},{"english":"The approver considers and decides whether to reject the loan application or not.","chinese":"由审批人综合判断是否应拒绝该申请。"},{"english":"Serious efforts were made to implement Law of Administrative Licensing and deepen the reform of administrative approval system .","chinese":"认真贯彻行政许可法，深化行政审批制度改革。"},{"english":"We will continue to separate government functions from enterprise management, reduce the number of matters requiring administrative examination and approval, and standardize procedures for doing so.","chinese":"继续推进政企分开，减少和规范行政许可和行政审批。"}],"related":[{"definition":["to report for criticism\/to submit for approval to higher authority"],"pinyin":["bao4 pi1"],"word":"报批"},{"definition":["to approve\/to ratify"],"pinyin":["pi1 zhun3"],"word":"批准"},{"definition":["to authorize\/to investigate then ratify"],"pinyin":["he2 zhun3"],"word":"核准"},{"definition":["to put on record\/to file"],"pinyin":["bei4 an4"],"word":"备案"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"审查"},{"definition":["to reply officially to a subordinate"],"pinyin":["pi1 fu4"],"word":"批复"},{"definition":["to launch a project"],"pinyin":["li4 xiang4"],"word":"立项"},{"definition":["official written ruling in response to a submission\/official approval in writing"],"pinyin":["pi1 wen2"],"word":"批文"},{"definition":["procedure\/CL:道[dao4],個|个[ge4]\/formalities"],"pinyin":["shou3 xu4"],"word":"手续"},{"definition":["to report for judgment\/to submit for approval"],"pinyin":["bao4 shen3"],"word":"报审"},{"definition":["to report to one's superiors\/to appear in the news\/to reply to a letter"],"pinyin":["shang4 bao4"],"word":"上报"},{"definition":["to apply for sth\/application (form etc)\/CL:份[fen4]"],"pinyin":["shen1 qing3"],"word":"申请"},{"definition":["preliminary hearing\/interrogation (of a suspect)\/preliminary examination (of a project etc)"],"pinyin":["yu4 shen3"],"word":"预审"},{"definition":["to report (to the authorities)\/to declare (to customs)"],"pinyin":["shen1 bao4"],"word":"申报"},{"definition":["to accept to hear a case\/to handle (a service)"],"pinyin":["shou4 li3"],"word":"受理"},{"definition":["to handle\/to transact\/to conduct"],"pinyin":["ban4 li3"],"word":"办理"}]}