{"definition":["polite greeting\/civilities\/to exchange pleasantries"],"pinyin":["ke4 tao4"],"traditional":["客套"],"rank":35490.0,"normalized_rank":0.4965511451876933,"fraction":5.804070444030422e-7,"cumulative_fraction":0.9943389692371141,"word":"客套","characters":[{"definition":["customer\/visitor\/guest"],"pinyin":["ke4"],"word":"客"},{"definition":["to cover\/to encase\/cover\/sheath\/to overlap\/to interleave\/to model after\/to copy\/formula\/harness\/loop of rope\/(fig.) to fish for\/to obtain slyly\/classifier for sets, collections\/bend (of a river or mountain range, in place names)\/tau (Greek letter Ττ)"],"pinyin":["tao4"],"word":"套"}],"containing_words":[{"definition":["conventional greeting\/polite formula"],"pinyin":["ke4 tao4 hua4"],"word":"客套话"}],"sentences":[{"english":"The team captains exchanged civilities before the kickoff.","chinese":"两队的队长在开球之前互相客套了一番。"},{"english":"How do you do is a social formula.","chinese":"“你好”是社交中的客套话。"},{"english":"He was also not much ceremonious, returned apt ugg then hurriedly let the matchmaker base out.","chinese":"他也不多客套，回去就赶紧让媒婆打听了。"},{"english":"Not at all. We'll meet our general manager tomorrow.","chinese":"不客套，明天将来诰日带你去见一下我们总经理。"},{"english":"My close friends and family needed no ceremonious preliminaries.","chinese":"我的密友和家人不需要跟我客套寒暄。"},{"english":"We share everything between and relate well to each other regardless of chinchin or ceremony.","chinese":"我们不分彼此，相处融洽，不必拘泥客套礼节。"},{"english":"Their tablemanners seemed very normal or even excessively polite.","chinese":"他们的餐桌礼仪似乎非常规矩，甚至过于客套。"},{"english":"She prefixed a few complimentary remarks to her speech.","chinese":"她在演说之前说了几句客套话。"},{"english":"Polite formula, to feel sorry for one's own mistakes it is also used ot show modesty.","chinese":"客套话，为自己的失误而感到抱歉，也用于表示谦虚。"},{"english":"Kids think of me as his friend, to avoid some of the  hypocrisy and polite.","chinese":"孩子把我当成他的朋友，避免了一些虚伪和客套。"},{"english":"Conversation on such an occasion is not expected to soar above polite commonplaces.","chinese":"不能指望在这种场合的谈话会超越平常的客套。"},{"english":"The adults drank their tea in a ceremonious manner, and the children imitated them.","chinese":"大人们客套地喝著茶，孩子们模仿著他们。"},{"english":"Then continue pleasantries for a bit, before making your goodbyes and heading back.","chinese":"然后说些客套话，接着说声再见并往回走。"}],"related":[{"definition":["conventional greeting\/polite formula"],"pinyin":["ke4 tao4 hua4"],"word":"客套话"},{"definition":["to exchange conventional greetings\/to exchange pleasantries"],"pinyin":["han2 xuan1"],"word":"寒喧"},{"definition":["words of politeness\/politesse\/decorous talking\/talk with propriety"],"pinyin":["ke4 qi5 hua4"],"word":"客气话"},{"definition":["to exchange conventional greetings\/to talk about the weather"],"pinyin":["han2 xuan1"],"word":"寒暄"},{"definition":["polite\/courteous\/formal\/modest"],"pinyin":["ke4 qi5"],"word":"客气"},{"definition":["to fawn on\/to flatter\/to ingratiate oneself\/flattery"],"pinyin":["feng4 cheng5"],"word":"奉承"},{"definition":["to return a politeness\/to present a gift in return"],"pinyin":["huan2 li3"],"word":"还礼"},{"definition":["lit. going round the curves and skirting the corners (idiom)\/fig. to speak in a roundabout way\/to equivocate\/to beat about the bush"],"pinyin":["guai3 wan1 mo4 jiao3"],"word":"拐弯抹角"},{"definition":["to decline (an appointment, invitation etc)"],"pinyin":["tui1 ci2"],"word":"推辞"},{"definition":["to return a greeting\/to send a gift in return"],"pinyin":["hui2 li3"],"word":"回礼"},{"definition":["intimate\/friendly\/warm\/active\/lively (interaction, participation etc)"],"pinyin":["re4 luo4"],"word":"热络"},{"definition":["to say goodbye\/to take one's leave"],"pinyin":["gao4 ci2"],"word":"告辞"},{"definition":["to regard sb as an outsider"],"pinyin":["jian4 wai4"],"word":"见外"},{"definition":["to praise\/to speak highly of\/compliment\/praise"],"pinyin":["gong1 wei5"],"word":"恭维"},{"definition":["polite phrase\/conventional greetings\/cliché\/to try to worm facts out of sb"],"pinyin":["tao4 hua4"],"word":"套话"},{"definition":["to chat\/idle talk"],"pinyin":["xian2 che3"],"word":"闲扯"}]}