{"definition":["head of a household"],"pinyin":["jia1 zhu3"],"traditional":["家主"],"rank":33698.0,"normalized_rank":0.471478740223581,"fraction":6.783580320273989e-7,"cumulative_fraction":0.9932128273163074,"word":"家主","characters":[{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"},{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"}],"containing_words":[{"definition":["president (title of the head of state of China and several other nations)"],"pinyin":["guo2 jia1 zhu3 xi2"],"word":"国家主席"},{"definition":["nationalism\/statism"],"pinyin":["guo2 jia1 zhu3 yi4"],"word":"国家主义"}],"sentences":[{"english":"British nationalism ebbs and flows in its intensity.","chinese":"英国国家主义的强度时高时低。"},{"english":"Hu said that China supports Equatorial Guinea's efforts in safeguarding its sovereignty and security.","chinese":"中方支持赤几维护国家主权和安全的努力。"},{"english":"Finally, it should realize the willing assignment of national sovereignty on the trans-frontier pollution issue.","chinese":"最后需要在越境污染问题上国家主权权力的自愿让渡。"},{"english":"Nazism was not only nationalism run amok.","chinese":"纳粹不仅仅是杀气腾腾的国家主义。"},{"english":"National sovereignty was previously a standard held aloft mainly by British eurosceptics.","chinese":"以前，国家主权主要是英国“疑欧派”高举的旗帜。"},{"english":"He blasted East European critics as 'collaborators with Fascism.","chinese":"他指责东欧的评论家为“极端国家主义的同谋”。"},{"english":"The sovereignty of States must no longer be used as a shield for gross violations of human rights.","chinese":"国家主权不能再被用作严重侵犯人权的挡箭牌。"},{"english":"Its drafter's intention was to put sovereignty in the hands of the people .","chinese":"起草人的意图是要把国家主权置于人民手中。"},{"english":"The Anti-Secession Law was enacted to resolutely safeguard China's sovereignty and territorial integrity.","chinese":"制定反分裂国家法，坚决维护国家主权和领土完整。"},{"english":"But he answered one of them, `Friend, I am not being unfair to you.","chinese":"家主回答其中的一人说，朋友，我不亏负你。"},{"english":"The first is how the idea should be related to that of state sovereignty.","chinese":"第一个问题是人权思想如何与国家主权思想相联的。"},{"english":"Chapter five mainly analyses the subject and object of the national sovereignty transference with self-determination and finity .","chinese":"第五章主要研究国家主权自主有限让渡的主体和客体。"},{"english":"The international capitalists dictate and the nation’s sovereignty becomes a sham.","chinese":"这样国际资本家拥有支配权，而国家主权沦为傀儡。"},{"english":"For the kingdom of heaven is like unto a man that is an householder, which went out early in the morning to hire labourers into his vineyard.","chinese":"因为天国好像家主，清早去雇人，进他的葡萄园作工。"},{"english":"They were all virulently pacifistic and anti-nationalistic.","chinese":"他们坚持极度的和平主义和反国家主义。"},{"english":"The right-maintaining ideas embody Zhang(Zhidong's) consciousness of nation's sovereignty.","chinese":"让利争权的维权思想，体现了张之洞的国家主权意识。"}],"related":[{"definition":["clan elder"],"pinyin":["zu2 zhang3"],"word":"族长"},{"definition":["head of a clan\/natural leader\/person of prestige and authority in a domain\/suzerain"],"pinyin":["zong1 zhu3"],"word":"宗主"},{"definition":["elder\/term of respect for a Buddhist monk"],"pinyin":["zhang3 lao3"],"word":"长老"},{"definition":["princely"],"pinyin":["wang2 jia1"],"word":"王家"},{"definition":["two-character surname Zhangsun","eldest grandson\/the eldest son of one's eldest son"],"pinyin":["Zhang3 sun1","zhang3 sun1"],"word":"长孙"},{"definition":["learned person\/expert in a certain field\/abbr. for 大方之家[da4 fang1 zhi1 jia1]"],"pinyin":["fang1 jia1"],"word":"方家"},{"definition":["paraphernalia of a guard of honor","to perform one's job\/attendant\/job\/duties\/(respectful appellation for the addressee) you\/your Excellency\/(Church) deacon"],"pinyin":["zhi2 shi5","zhi2 shi4"],"word":"执事"},{"definition":["grandfather's younger brother"],"pinyin":["shu1 zu3"],"word":"叔祖"},{"definition":["counselor of king or feudal warlord\/henchman"],"pinyin":["jia1 chen2"],"word":"家臣"},{"definition":["Presbyterianism"],"pinyin":["Zhang3 lao3 hui4"],"word":"长老会"},{"definition":["son of first wife"],"pinyin":["di2 zi3"],"word":"嫡子"},{"definition":["the Zhou family (household, firm etc)\/Jow-Ga Kung Fu - Martial Art"],"pinyin":["zhou1 jia1"],"word":"周家"},{"definition":["wife's parents' home"],"pinyin":["yue4 jia1"],"word":"岳家"},{"definition":["marquis"],"pinyin":["hou2 jue2"],"word":"侯爵"},{"definition":["minister of education (history)\/two-character surname Situ"],"pinyin":["Si1 tu2"],"word":"司徒"},{"definition":["duke\/dukedom"],"pinyin":["gong1 jue2"],"word":"公爵"}]}