{"definition":["family member\/(family) dependent"],"pinyin":["jia1 shu3"],"traditional":["家屬"],"rank":2735.0,"normalized_rank":0.03826619842457992,"fraction":0.00005368137456932635,"cumulative_fraction":0.7772600941081279,"word":"家属","characters":[{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"属"}],"containing_words":[],"sentences":[{"english":"It says they also tried to silence the victims' relatives with bribes and threats.","chinese":"并且威逼利诱受难者家属保持沉默。"},{"english":"But families at Fort Hood said afterwards they ­appreciated Obama's visit.","chinese":"但在胡德堡家属们随后都表示感激奥巴马来访。"},{"english":"This must be co-signed by a family member.","chinese":"这份记录还必须由一位家属的共同签名。"},{"english":"The Democratic Presidential hopeful plans to visit the fallen officier's family.","chinese":"这位民主党候选人希望能够慰问死者的家属。"},{"english":"Since then, the military has given little information about its investigation to the Chens, immigrants who speak no English.","chinese":"美国军方几乎不给死者家属有关死因调查信息。"},{"english":"And we also had the privilege of meeting with some of their families, as well as some of the courageous survivors.","chinese":"我们还有幸会见了部分罹难者家属和无畏的幸存者。"},{"english":"Comrade Wang and his families have been transferred to Shanghai recently.","chinese":"王同志和他的家属最近已调到上海去了。"},{"english":"For deaths not designated karoshi the family gets next to nothing.","chinese":"而不被认为是过劳死的死者家属几乎什么也得不到。"},{"english":"Emergency surgical repair was suggested but declined by the patient and her family.","chinese":"需要进行急诊外科修补但遭到患者和家属的拒绝。"},{"english":"Schools do not invite students' family members to accompany them to study.","chinese":"学校不邀请留学生家属来校陪读。"},{"english":"Hospital is with the community to to provide the support of positive mental state society patient family members.","chinese":"医院和社区对病人家属要提供积极的心理社会支持。"},{"english":"Family members accompanying students shall apply for L visa only.","chinese":"外国留学生的陪读家属，应作为探亲者申请L签证。"},{"english":"Chan said that patients and their families really magical drug.","chinese":"患者及其家属赞称此药真神奇。"},{"english":"On behalf of the American people, I express my deepest condolences to the families of the victims.","chinese":"我代表好国人仄易远背遇易者家属暗示最深切的慰唁。"},{"english":"Family members mourned the loss of their loved ones at the World Trade Center.","chinese":"家属在世贸中心悼念死难者。"},{"english":"The families of British embassy staff have left Iran.","chinese":"英国使馆人员的家属已经离开伊朗。"}],"related":[{"definition":["kin\/kindred\/relatives"],"pinyin":["qin1 shu3"],"word":"亲属"},{"definition":["casualty\/victim (of an accident)\/wounded person"],"pinyin":["shang1 zhe3"],"word":"伤者"},{"definition":["medical personnel\/doctors and nurses"],"pinyin":["yi1 hu4 ren2 yuan2"],"word":"医护人员"},{"definition":["medical personnel"],"pinyin":["yi1 wu4 ren2 yuan2"],"word":"医务人员"},{"definition":["the dead\/the deceased"],"pinyin":["si3 zhe3"],"word":"死者"},{"definition":["household\/(one's) family"],"pinyin":["jia1 ren2"],"word":"家人"},{"definition":["offender\/culprit"],"pinyin":["zhao4 shi4 zhe3"],"word":"肇事者"},{"definition":["sick personnel\/person on the sick list\/patient"],"pinyin":["bing4 yuan2"],"word":"病员"},{"definition":["old man or woman\/the elderly\/one's aged parents or grandparents"],"pinyin":["lao3 ren2"],"word":"老人"},{"definition":["friends and relatives"],"pinyin":["qin1 you3"],"word":"亲友"},{"definition":["to rescue"],"pinyin":["qiang3 jiu4"],"word":"抢救"},{"definition":["to leave hospital\/to be discharged from hospital"],"pinyin":["chu1 yuan4"],"word":"出院"},{"definition":["autopsy"],"pinyin":["shi1 jian3"],"word":"尸检"},{"definition":["to attend to the needs of (an invalid, disabled person etc)\/caregiver"],"pinyin":["pei2 hu4"],"word":"陪护"},{"definition":["sick person\/patient\/invalid\/CL:個|个[ge4]"],"pinyin":["bing4 ren2"],"word":"病人"},{"definition":["illness\/disease\/patient\/sufferer"],"pinyin":["bing4 huan4"],"word":"病患"}]}