{"definition":["lit. a wealthy person does not sit under the eaves (idiom); fig. a rich man does not expose himself to danger"],"pinyin":["jia1 lei3 qian1 jin1 , zuo4 bu4 chui2 tang2"],"traditional":["家累千金，坐不垂堂"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"家累千金，坐不垂堂","characters":[{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"},{"definition":["tired\/weary\/to strain\/to wear out\/to work hard","to accumulate\/to involve or implicate (Taiwan pr. [lei4])\/continuous\/repeated","rope\/to bind together\/to twist around","surname Lei"],"pinyin":["lei4","lei3","lei2","Lei2"],"word":"累"},{"definition":["see 鞦韆|秋千[qiu1 qian1]","thousand"],"pinyin":["qian1","qian1"],"word":"千"},{"definition":["surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)","gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Jin1","jin1"],"word":"金"},{"word":"，"},{"definition":["surname Zuo","to sit\/to take a seat\/to take (a bus, airplane etc)\/to bear fruit\/variant of 座[zuo4]"],"pinyin":["Zuo4","zuo4"],"word":"坐"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to hang (down)\/droop\/dangle\/bend down\/hand down\/bequeath\/nearly\/almost\/to approach"],"pinyin":["chui2"],"word":"垂"},{"definition":["(main) hall\/large room for a specific purpose\/CL:間|间[jian1]\/relationship between cousins etc on the paternal side of a family\/of the same clan\/classifier for classes, lectures etc\/classifier for sets of furniture"],"pinyin":["tang2"],"word":"堂"}],"containing_words":[],"sentences":[],"related":[]}