{"definition":["to watch\/to look carefully at"],"pinyin":["cha2 kan4"],"traditional":["察看"],"rank":12465.0,"normalized_rank":0.17440152225315853,"fraction":0.000005755167939031677,"cumulative_fraction":0.9466777597342544,"word":"察看","characters":[{"definition":["short name for Chahar Province 察哈爾|察哈尔[Cha2 ha1 er3]","variant of 察[cha2]","to examine\/to inquire\/to observe\/to inspect\/to look into\/obvious\/clearly evident"],"pinyin":["Cha2","cha2","cha2"],"word":"察"},{"definition":["to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)","to look after\/to take care of\/to watch\/to guard"],"pinyin":["kan4","kan1"],"word":"看"}],"containing_words":[],"sentences":[{"english":"13 consider well her ramparts, view her citadels, that you may tell of them to the next generation.","chinese":"细看他的外郭，察看他的宫殿，为要传说到后代。"},{"english":"India is an observer state to the Shanghai Co-operation Organisation.","chinese":"印度是上海协作组织的察看员国。"},{"english":"Looking through the Akashic records is like leafing through an infinite mental photo album.","chinese":"察看阿卡西记录就像翻阅一本无限的精神相册一样。"},{"english":"2Test me, O Lord , and try me, examine my heart and my mind;","chinese":"耶和华阿，求你察看我，试验我，熬炼我的肺腑心肠。"},{"english":"If I sin, then thou markest me, and thou wilt not acquit me from mine iniquity.","chinese":"我若犯罪，你就察看我，并不赦免我的罪孽。"},{"english":"He observes the sons of men; his eyes examine them.","chinese":"他的慧眼察看世人。"},{"english":"Shawn and Walt were around the front of the church looking at the bell tower while I was exploring the back area.","chinese":"肖恩和沃尔特在教堂前部检查灯塔而我在后面察看。"},{"english":"Go to the ant, you sluggard; consider her ways, and be wise.","chinese":"懒惰人哪，你去察看蚂蚁的动做，就可得聪慧。"},{"english":"The shoemaker carefully examined the leather before starting to cut out the uppers.","chinese":"鞋匠仔细察看了这张皮子以后才开始裁剪鞋帮儿。"},{"english":"He sees not just images and activities but discerns thoughts and motives.","chinese":"他不单察看我们的言行举止，更鉴察我们的心思意念。"},{"english":"Fierce with pain the monster turned back his head to view the wound.","chinese":"疼痛使得那怪物暴躁不安，它扭过头来察看伤口。"},{"english":"It could view “click-through rates” as a measure of ad quality.","chinese":"通过察看“点击率”可以作为判断广告质量的标准。"},{"english":"Go to the ant, you sluggard, consider her ways and be wise!","chinese":"懒惰的人哪，你去察看蚂蚁的动作，就可得智慧。"},{"english":"I looked through the telescope and saw a small boy with a bag over his shoulder.","chinese":"我透过望远镜察看并看到肩上扛着一个包的小男孩。"},{"english":"Please review and contact Bank of China, Beijing Branch, Beijing to collect the LC.","chinese":"请察看并联系中国银行北京分行接收这个信用证。"},{"english":"Some officials will look over our factory this Friday.","chinese":"本周五一些官员将察看我们的厂子。"}],"related":[{"definition":["to visit\/to go to see what's going on"],"pinyin":["tan4 kan4"],"word":"探看"},{"definition":["to investigate\/to observe\/to scout\/to seek out and examine\/to explore"],"pinyin":["tan4 cha2"],"word":"探察"},{"definition":["to check\/to investigate\/to probe (into)"],"pinyin":["cha2 tan4"],"word":"查探"},{"definition":["to examine\/to probe\/to scout out\/to nose around"],"pinyin":["tan4 cha2"],"word":"探查"},{"definition":["to inquire about"],"pinyin":["cha2 wen4"],"word":"查问"},{"definition":["to inspect\/to examine"],"pinyin":["jian3 shi4"],"word":"检视"},{"definition":["to patrol\/to make a tour\/to inspect\/to scan with one's eyes"],"pinyin":["xun2 shi4"],"word":"巡视"},{"definition":["unusual condition\/something odd\/strange shape"],"pinyin":["yi4 zhuang4"],"word":"异状"},{"definition":["to visit (a patient, prisoner etc)\/to look inquiringly"],"pinyin":["tan4 shi4"],"word":"探视"},{"definition":["to investigate"],"pinyin":["cha2 fang3"],"word":"查访"},{"definition":["to make inquiries\/to try to find out\/to pry"],"pinyin":["tan4 ting1"],"word":"探听"},{"definition":["to recognize\/to identify"],"pinyin":["bian4 ren4"],"word":"辨认"},{"definition":["to reconnoiter\/to explore\/to survey"],"pinyin":["kan1 cha2"],"word":"勘察"},{"definition":["to search\/to look for"],"pinyin":["sou1 xun2"],"word":"搜寻"},{"definition":["to explore\/to search out\/to scout\/to visit\/to stretch forward"],"pinyin":["tan4"],"word":"探"},{"definition":["everywhere"],"pinyin":["si4 xia4"],"word":"四下"}]}