{"definition":["not to let sb down\/to treat sb fairly\/be worthy of"],"pinyin":["dui4 de5 qi3"],"traditional":["對得起"],"rank":17156.0,"normalized_rank":0.24003469841758426,"fraction":0.0000032275653299173207,"cumulative_fraction":0.9669256401879036,"word":"对得起","characters":[{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"对"},{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"Of the top payroll teams, only the Mavs are getting production equal to the investment.","chinese":"薪水册顶端的球队中，只有小牛的产出对得起投入。"},{"english":"Be worthy of people's trust.","chinese":"对得起人民的信任。"},{"english":"That ye would walk worthy of God, who hath called you unto his kingdom and glory.","chinese":"要叫你们行事对得起那召你们进他国得他荣耀的神。"},{"english":"So which deserves your hard-earned cash?","chinese":"那么，谁更对得起你的血汗钱呢？"},{"english":"Just ask ourselves whether we really deserve the pay we receive.","chinese":"扪心自问，我们对得起这份收入吗？"},{"english":"Do women deserve their reputation for cattiness and backbiting?","chinese":"这样的阴险和中伤朋友是否对得起自己的地位？"},{"english":"Little Turtle could only blame himself for oversleeping . He let his good friend down.","chinese":"怪只怪睡过头，怎么对得起好朋友。"},{"english":"For the sake of his ancestors, Old Bi held out, all alone.","chinese":"为了对得起祖宗，老毕一直孤独坚持着。"},{"english":"Jose Mourinho believes he is worth every penny Chelsea Football Club pay him.","chinese":"穆帅相信他对得起切尔西俱乐部付给他的每一分钱。"},{"english":"When will you be worthy of your million Trotskyites?","chinese":"你什么时候才对得起你那百万托派分子？"},{"english":"She feels that just being regarded as like this is of equal status, to the identity that must heave our Luo house.","chinese":"她觉得这样才算是门当户对，对得起我们洛家的身份。"},{"english":"Most importantly, Blueberry Garden is definitely worthy of the prize bestowed upon it.","chinese":"更重要的是，她对得起颁给她的大奖。"}],"related":[{"definition":["to be ashamed to face (sb)\/to feel bad about having failed (sb)"],"pinyin":["kui4 dui4"],"word":"愧对"},{"definition":["conscience"],"pinyin":["liang2 xin1"],"word":"良心"},{"definition":["to waste (one's breath, one's energy etc)\/to try in vain"],"pinyin":["wang3 fei4"],"word":"枉费"},{"definition":["to treat sb unfairly"],"pinyin":["kui1 dai4"],"word":"亏待"},{"definition":["to fail to live up (to expectations)\/unworthy (of trust)\/to let down\/to betray (hopes)\/to disappoint"],"pinyin":["gu1 fu4"],"word":"辜负"},{"definition":["to have a clear conscience\/to feel no qualms"],"pinyin":["wu2 kui4"],"word":"无愧"},{"definition":["not in vain"],"pinyin":["bu4 wang3"],"word":"不枉"},{"definition":["lit. can pass through (an opening)\/fig. can get by (in life)\/tolerably well\/not too bad\/How are you getting by?\/How's life?"],"pinyin":["guo4 de2 qu4"],"word":"过得去"},{"definition":["to repay\/to requite"],"pinyin":["bao4 da2"],"word":"报答"},{"definition":["to ask oneself honestly\/to search in one's heart"],"pinyin":["men2 xin1 zi4 wen4"],"word":"扪心自问"},{"definition":["acceptable\/passable\/justifiable\/(of a course of action) to make sense"],"pinyin":["shuo1 de5 guo4 qu4"],"word":"说得过去"},{"definition":["lit. look into one's heart, no shame (idiom); with a clear conscience"],"pinyin":["wen4 xin1 wu2 kui4"],"word":"问心无愧"},{"definition":["not worth"],"pinyin":["bu4 zhi2"],"word":"不值"},{"definition":["in all honesty\/truth to tell"],"pinyin":["tian1 di4 liang2 xin1"],"word":"天地良心"},{"definition":["to be loyal to"],"pinyin":["zhong1 yu2"],"word":"忠于"},{"definition":["to be honest, ..."],"pinyin":["ping2 xin1 er2 lun4"],"word":"平心而论"}]}