{"definition":["(in classical literature) young military officer of high rank for his age\/(during the Cultural Revolution) young militant in the Red Guard\/(in modern usage) rising star (in sport, politics etc)"],"pinyin":["xiao3 jiang4"],"traditional":["小將"],"rank":4455.0,"normalized_rank":0.062331229974955576,"fraction":0.000028565631912477197,"cumulative_fraction":0.844700142183947,"word":"小将","characters":[{"definition":["small\/tiny\/few\/young"],"pinyin":["xiao3"],"word":"小"},{"definition":["to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])","general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead"],"pinyin":["qiang1","jiang1","jiang4"],"word":"将"}],"containing_words":[],"sentences":[{"english":"Liverpool are reportedly monitoring Valentin Stocker - with a view to making a January bid for the Swiss youngster.","chinese":"最近利物浦和瑞士小将斯托克尔联系在了一起。"},{"english":"The ambitions of the young and talented also reveal a lot.","chinese":"小手册透露出这些小将雄心的还真有不少。"},{"english":"If you have seen Little Big Soldier , you will understand why canola flowers are so important in the movie.","chinese":"如果你们看过《大兵小将》就会明白油菜花的意义。"},{"english":"Czech teen Vaidisova is looking for her first Grand Slam title.","chinese":"捷克小将瓦娃在期待她的第一个大满贯。"},{"english":"\"Hoisting ring's king\" rookie player Chen Yibing has demonstrated brilliant performance which made me clap the table.","chinese":"“吊环王”小将陈一冰的精彩表现令我拍案叫绝。"},{"english":"The Spanish starlet curled home a superb free-kick after 10 minutes.","chinese":"比赛开始10分钟，西班牙小将任意球弧线钻进网窝。"},{"english":"Zhou Yang of China coasted to victory in the women's 1500m short-track speed skating at the Winter Olympics.","chinese":"中国小将周洋在女子1500米短道速滑中轻松夺冠。"},{"english":"He’s a great guy, a basketball player, you know. And a Boy Scout.","chinese":"他是个好孩子，篮球小将，也是一名童子军。"},{"english":"Brazilian Vitor Flora and Hungarian Andras Simon were also on the mark for the Reds.","chinese":"巴西人弗洛拉和匈牙利小将西蒙在比赛中有所斩获。"},{"english":"Si handkerchief Lettie uses in the young fellow plum to change Totty .","chinese":"斯帕莱蒂则用小将梅内换下托蒂。"},{"english":"Earlier this year, China picked Ding Hui, a young man from Hangzhou, for its national volleyball team.","chinese":"今年早些时候，杭州小将丁慧入选国家男子排球队。"},{"english":"\"Captain Tsubasa\" Japan eyes of the public well-deserved hero.","chinese":"《足球小将》是日本民众心目中当之无愧的英雄。"}],"related":[{"definition":["lit. old general\/commander-in-chief 將帥|将帅, the equivalent of king in Chinese chess\/fig. old-timer\/veteran"],"pinyin":["lao3 jiang4"],"word":"老将"},{"definition":["nova (astronomy)"],"pinyin":["xin1 xing1"],"word":"新星"},{"definition":["sports club member\/footballer, golfer etc"],"pinyin":["qiu2 yuan2"],"word":"球员"},{"definition":["rear guard\/backfield\/fullback"],"pinyin":["hou4 wei4"],"word":"后卫"},{"definition":["vanguard\/front line\/a forward (sports)"],"pinyin":["qian2 feng1"],"word":"前锋"},{"definition":["to replace (a damaged component with a new one, an injured player with a substitute player, full-time workers with casual workers etc)\/a substitute\/a replacement"],"pinyin":["ti4 bu3"],"word":"替补"},{"definition":["middle period of a tripartite provincial exam (in former times)\/midfield\/mid-court (in sports)\/half-time\/intermission half-way through a performance"],"pinyin":["zhong1 chang3"],"word":"中场"},{"definition":["(sports) member of the national team\/national representative\/(medicine, chess etc) one of the most highly skilled practitioners in one's country"],"pinyin":["guo2 shou3"],"word":"国手"},{"definition":["on stage\/to go on stage\/to take the field"],"pinyin":["shang4 chang3"],"word":"上场"},{"definition":["(military) commander-in-chief\/(sports) team manager\/coach"],"pinyin":["zhu3 shuai4"],"word":"主帅"},{"definition":["a general or admiral"],"pinyin":["da4 jiang4"],"word":"大将"},{"definition":["to defeat decisively\/to win decisively\/great victory\/triumph"],"pinyin":["da4 sheng4"],"word":"大胜"},{"definition":["commander-in-chief (military)\/star player (sports)\/key figure (in an organization)"],"pinyin":["zhu3 jiang4"],"word":"主将"},{"definition":["first round (of a competition etc)"],"pinyin":["shou3 lun2"],"word":"首轮"},{"definition":["team member"],"pinyin":["dui4 yuan2"],"word":"队员"},{"definition":["famous general"],"pinyin":["ming2 jiang4"],"word":"名将"}]}