{"definition":["editor or creator of online content (diminutive term, often used to refer to oneself: I, me, this writer)"],"pinyin":["xiao3 bian1"],"traditional":["小編"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"小编","characters":[{"definition":["small\/tiny\/few\/young"],"pinyin":["xiao3"],"word":"小"},{"definition":["to weave\/to plait\/to organize\/to group\/to arrange\/to edit\/to compile\/to write\/to compose\/to fabricate"],"pinyin":["bian1"],"word":"编"}],"containing_words":[],"sentences":[{"english":"So let's see how to make the trifle.","chinese":"下面小编就为大家介绍一下乳脂松糕的做法。"},{"english":"The following small series for you to explain about the typical application of inert gas booster pump.","chinese":"下面小编为您讲解一下惰性气体增压泵的典型应用。"},{"english":"Today, I will take you to read the poetic life of Li Po.","chinese":"今天，小编将同大家一起赏读李太白的诗酒人生。"},{"english":"Today, I will take you to listen to the story of RuanJi and wine.","chinese":"今天，小编将向您讲述阮籍与酒的故事。"}],"related":[{"definition":["everyone\/influential family\/great expert"],"pinyin":["da4 jia1"],"word":"大家"},{"definition":["everybody\/all (guests, colleagues etc)\/all of you"],"pinyin":["ge4 wei4"],"word":"各位"},{"definition":["below\/under\/next\/the following\/also pr. [xia4 mian5]","to boil noodles"],"pinyin":["xia4 mian4","xia4 mian4"],"word":"下面"},{"definition":["(onom.) smack!","(modal particle indicating suggestion or surmise)\/...right?\/...OK?\/...I presume.","bar (loanword) (serving drinks, or providing Internet access etc)\/to puff (on a pipe etc)\/(onom.) bang\/abbr. for 貼吧|贴吧[tie1 ba1]"],"pinyin":["bia1","ba5","ba1"],"word":"吧"},{"definition":["monarch\/lord\/gentleman\/ruler"],"pinyin":["jun1"],"word":"君"},{"definition":["sentence-final particle, contraction of 了啊, indicating exclamation\/particle placed after each item in a list of examples","(onom.) sound of singing, cheering etc\/(phonetic)\/(dialect) to chat"],"pinyin":["la5","la1"],"word":"啦"},{"definition":["sentence-final particle that conveys informality, warmth, friendliness or intimacy\/may also indicate that one is stating a fact that the other person is not aware of","oh (interjection indicating that one has just learned sth)","oh (interjection indicating doubt or surprise)","to chant"],"pinyin":["o5","o4","o2","e2"],"word":"哦"},{"definition":["to return to the topic (idiom)\/to get back to the main point"],"pinyin":["yan2 gui1 zheng4 zhuan4"],"word":"言归正传"},{"definition":["darlings\/fans\/followers\/short form of 親愛的們|亲爱的们"],"pinyin":["qin1 men5"],"word":"亲们"},{"definition":["woolen material","particle indicating that a previously asked question is to be applied to the preceding word (\"What about ...?\", \"And ...?\")\/particle for inquiring about location (\"Where is ...?\")\/particle signaling a pause, to emphasize the preceding words and allow the listener time to take them on board (\"ok?\", \"are you with me?\")\/(at the end of a declarative sentence) particle indicating continuation of a state or action\/particle indicating strong affirmation"],"pinyin":["ni2","ne5"],"word":"呢"},{"definition":["today\/at the present\/now"],"pinyin":["jin1 tian1"],"word":"今天"},{"definition":["you (plural)"],"pinyin":["ni3 men5"],"word":"你们"},{"definition":["we or us (including both the speaker and the person(s) spoken to)\/(dialect) I or me\/(dialect) (in a coaxing or familiar way) you\/also pr. [za2 men5]"],"pinyin":["zan2 men5"],"word":"咱们"},{"definition":["(Internet slang for 然而[ran2 er2]) however"],"pinyin":["ran2 e2"],"word":"然鹅"},{"definition":["(used after a verb) give it a go\/to do (sth for a bit to give it a try)\/one time\/once\/in a while\/all of a sudden\/all at once"],"pinyin":["yi1 xia4"],"word":"一下"},{"definition":["as for\/when it comes to"],"pinyin":["yao4 shuo1"],"word":"要说"}]}