{"definition":["to discuss sth on its own merits\/to judge the matter as it stands"],"pinyin":["jiu4 shi4 lun4 shi4"],"traditional":["就事論事"],"rank":32488.0,"normalized_rank":0.4545492703538399,"fraction":7.554342190104991e-7,"cumulative_fraction":0.992346005744985,"word":"就事论事","characters":[{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"论"},{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"}],"containing_words":[],"sentences":[{"english":"To be respectful of one another and the relationship, you should try and keep the discussion (or argument) focused to the topic at hand.","chinese":"出于对双方和彼此关系的尊重，你应该争取就事论事。"},{"english":"The cops were matter-of-fact about the whole thing.","chinese":"两个警察对整个事件抱着就事论事的态度。"},{"english":"As a matter of fact, a successful person is capable of setting goals and paving the way against all odds.","chinese":"就事论事，成功者懂得立定目标，又能排除万难铺路。"},{"english":"Try to look at the experience objectively.","chinese":"就事论事地看待这次经验。"},{"english":"But perhaps they are teaching us to separate the deed from the person.","chinese":"不过可能他们在教我们就事论事吧。"},{"english":"Management deals in facts and figures, an analytical approach to a problem.","chinese":"管理侧重于确定性的事实和就事论事的分析。"},{"english":"Leaders can also set aside matters of personality and make decisions based on fact.","chinese":"领导者也会排出个人成见，就事论事。"},{"english":"Just call it for what it is.","chinese":"我是就事论事而已。"},{"english":"An editorial writer should maintain a hard-eyed attitude.","chinese":"社论作者应保持就事论事的态度。"},{"english":"\"I have cerebral palsy, \" he answered matter-of-factly.","chinese":"“我患有大脑性麻痹，”他就事论事地回答说。"},{"english":"Instead, a thing should be considered on its own terms;","chinese":"但恰恰相反，我们应该就事论事地考虑一件事情。"},{"english":"Instead, a thing should be considered on its own terms; we should avoid the tendency to compare it to something else.","chinese":"我们应该就事论事，避免把它拿去和其他事物比较。"}],"related":[{"definition":["it's nothing personal (idiom)"],"pinyin":["dui4 shi4 bu4 dui4 ren2"],"word":"对事不对人"},{"definition":["to criticize (as a matter of principle)"],"pinyin":["shang4 gang1 shang4 xian4"],"word":"上纲上线"},{"definition":["personal attack"],"pinyin":["ren2 shen1 gong1 ji1"],"word":"人身攻击"},{"definition":["to avoid the important and dwell on the trivial\/to keep silent about major charges while admitting minor ones"],"pinyin":["bi4 zhong4 jiu4 qing1"],"word":"避重就轻"},{"definition":["to twist words and force logic (idiom)\/sophistry\/loud rhetoric making up for fallacious argument\/shoving false arguments down people's throats"],"pinyin":["qiang3 ci2 duo2 li3"],"word":"强词夺理"},{"definition":["to try to smooth things over\/to paper over the issues\/to gloss things over"],"pinyin":["huo4 xi1 ni2"],"word":"和稀泥"},{"definition":["to seek truth from facts (idiom)\/to be practical and realistic"],"pinyin":["shi2 shi4 qiu2 shi4"],"word":"实事求是"},{"definition":["to let emotions affect one's decisions"],"pinyin":["yi4 qi4 yong4 shi4"],"word":"意气用事"},{"definition":["present the facts and reason things out"],"pinyin":["bai3 shi4 shi2 jiang3 dao4 li3"],"word":"摆事实讲道理"},{"definition":["(lit.) to take a part for the whole\/to generalize"],"pinyin":["yi3 pian1 gai4 quan2"],"word":"以偏概全"},{"definition":["to blame unscrupulously"],"pinyin":["heng2 jia1 zhi3 ze2"],"word":"横加指责"},{"definition":["to use the current topic to put over one's own ideas\/to use sth as a pretext to make a fuss"],"pinyin":["jie4 ti2 fa1 hui1"],"word":"借题发挥"},{"definition":["to vent one's anger on an innocent party (idiom)"],"pinyin":["qian1 nu4 yu2 ren2"],"word":"迁怒于人"},{"definition":["lit. right and wrong, crooked and straight (idiom); fig. merits and demerits\/pros and cons"],"pinyin":["shi4 fei1 qu1 zhi2"],"word":"是非曲直"},{"definition":["to tag sb with unfair label\/power word"],"pinyin":["kou4 mao4 zi5"],"word":"扣帽子"},{"definition":["to bare one shoulder\/(fig.) to side with\/to discriminate in favor of"],"pinyin":["pian1 tan3"],"word":"偏袒"}]}