{"definition":["employment opportunity\/job opening"],"pinyin":["jiu4 ye4 ji1 hui4"],"traditional":["就業機會"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"就业机会","characters":[{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["surname Ye","line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already"],"pinyin":["Ye4","ye4"],"word":"业"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["ji1","Ji1"],"word":"机"},{"definition":["to balance an account\/accountancy\/accounting","can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])"],"pinyin":["kuai4","hui4"],"word":"会"}],"containing_words":[],"sentences":[{"english":"Grads get offers in grassroots-level schools teaching in Guangdong.","chinese":"广东应届毕业生获得农村学校教书的就业机会。"},{"english":"There is consider-able pessimism about job opportunity.","chinese":"人们对就业机会相当悲观。"},{"english":"You only get one opportunity like this and I had to take it.","chinese":"既然我只得到了一个就业机会，那当然要好好利用。"},{"english":"Middle and small-sized firms are job creators.","chinese":"中小型企业是制造就业机会的源泉。"},{"english":"The plan has the added advantage of bringing employment to rural areas.","chinese":"该计划另有一个优点，就是给屯子带来了就业机会。"},{"english":"The manufacturing sector has shed more than a million jobs.","chinese":"制造业裁掉了过百万个就业机会。"},{"english":"I wonder how many manufacturing jobs Baird is taking with him.","chinese":"我挺想知道贝尔德带上了多少制造业就业机会。"},{"english":"All African Americans hope that their employments will be based on EOE.","chinese":"所有美国黑人都希望他们享有平等的就业机会。"},{"english":"Employment opportunities are limited in the man's racially segregated neighborhood.","chinese":"就业机会在他所在的种族隔离区确实有限。"},{"english":"Large print buffer handles even very graphics-intensive jobs.","chinese":"大打印缓冲处理甚至非常图形密集型的就业机会。"},{"english":"The town relies on the seasonal tourist industry for jobs.","chinese":"这个城镇依靠季节性旅游业提供就业机会。"},{"english":"They are dependent on Amercia for jobs and hard currency.","chinese":"他们的社会依赖美国带来的就业机会和货币硬流通。"},{"english":"A favorable aspect about MNCs is that they reate jobs in foreign countries.","chinese":"跨国公司在国外提供就业机会，这是它受欢迎的一面。"},{"english":"But then, who is talking seriously about job creation these days?","chinese":"那么，今天是谁在义正言辞地说要提供就业机会的呢？"},{"english":"There are dozens of things we could do that would create jobs.","chinese":"只要我们肯做，创造就业机会的门路有很多。"},{"english":"For a place like Quincy that's a good number of jobs.","chinese":"对于像昆西这是一个相当数量的就业机会的地方。"}],"related":[]}