{"definition":["to go to school"],"pinyin":["jiu4 du2"],"traditional":["就讀"],"rank":6421.0,"normalized_rank":0.08983812068893149,"fraction":0.000016778814409137345,"cumulative_fraction":0.88741355052938,"word":"就读","characters":[{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["to read\/to study\/reading of word (i.e. pronunciation), similar to 拼音[pin1 yin1]","comma\/phrase marked by pause"],"pinyin":["du2","dou4"],"word":"读"}],"containing_words":[],"sentences":[{"english":"Currently I am an international student at Graduate School of Int'l Studies, Korea University, Seoul, Korea.","chinese":"我目前就读于韩国高丽大学国际研究生院。"},{"english":"Liu Xiaofeng, 20, from Guangdong Peizheng College, has a younger sister.","chinese":"20岁的刘晓凤就读于广东培正学院，她有一个妹妹。"},{"english":"Do you have any siblings studying in HKAC or HKAA?","chinese":"你有兄弟姐妹就读于香港三育书院香港复临学校？"},{"english":"Jong Un was reportedly educated at the International School of Berne, which he attended under a pseudonym","chinese":"据报道，金正云在伯尔尼的国际学校以化名就读。"},{"english":"Families with a younger brother, 12 years old, studying in the village on the heap in the third grade.","chinese":"斯朗曲措有一弟弟12岁，就读日堆村小学三年级。"},{"english":"She currently pursues her first year bachelor music degree in Haute Ecole de Musique de Genève.","chinese":"她现就读于日内瓦国立高等音乐学院，攻读学士学位。"},{"english":"The program provides job training for people who otherwise could not attend college.","chinese":"该项目为那些不能在学院就读的人提供职业培训。"},{"english":"She is an eighteen-year-old girl, in the third year a group of schools.","chinese":"她是一个十八岁的女孩，在高三一班就读。"},{"english":"Which kindergarten your child is living in ?","chinese":"您孩子目前就读于何所幼儿园？"},{"english":"Yang Sheng, 22, a marketing major at Shenzhen University, is one of them.","chinese":"杨盛，22岁，就读于深圳大学市场营销专业。"},{"english":"Three. My school is six in Xiamen.","chinese":"我现在就读的学校是厦门六中。"},{"english":"I attended high school and college at the University of the Philippines and I graduated with a degree in Accountancy.","chinese":"我在菲律宾就读高中及大学，并且得到会计学士学位。"},{"english":"Students receiving special education include those learning in the same class of formal regular junior and primary school students.","chinese":"特殊教育学生数中包括普通中小学随班就读的学生。"},{"english":"The 20-year-old is a sophomore at the prestigious Royal College of Music in London.","chinese":"现在，他在久负盛名的伦敦皇家音乐学院就读二年级。"},{"english":"I am one go study the Nanyang teachers' college's big new student.","chinese":"我是一个就读南阳师院的大一新生。"},{"english":"Many students save money by starting their education at a two-year public college, also known as a community college.","chinese":"许多学生为了省钱通常先就读两年制的社区学院。"}],"related":[{"definition":["graduation\/to graduate\/to finish school"],"pinyin":["bi4 ye4"],"word":"毕业"},{"definition":["to pass entrance exam\/to enter college after a competitive exam"],"pinyin":["kao3 ru4"],"word":"考入"},{"definition":["to attend (a school)\/to drop out (of college etc)"],"pinyin":["yi4 ye4"],"word":"肄业"},{"definition":["undergraduate course\/undergraduate (attributive)"],"pinyin":["ben3 ke1"],"word":"本科"},{"definition":["to enter a school or college\/to go to school for the first time as a child"],"pinyin":["ru4 xue2"],"word":"入学"},{"definition":["the Great Learning, one of the Four Books 四書|四书[Si4 shu1] in Confucianism","university\/college\/CL:所[suo3]"],"pinyin":["Da4 xue2","da4 xue2"],"word":"大学"},{"definition":["to hold a teaching position"],"pinyin":["ren4 jiao4"],"word":"任教"},{"definition":["middle school\/CL:個|个[ge4]"],"pinyin":["zhong1 xue2"],"word":"中学"},{"definition":["to read\/to study"],"pinyin":["nian4 shu1"],"word":"念书"},{"definition":["university undergraduate course"],"pinyin":["da4 xue2 ben3 ke1"],"word":"大学本科"},{"definition":["famous school"],"pinyin":["ming2 xiao4"],"word":"名校"},{"definition":["to change schools\/to transfer to another college"],"pinyin":["zhuan3 xue2"],"word":"转学"},{"definition":["to accept an applicant (prospective student, employee etc) who passes an entrance exam\/to admit (a student)\/to hire (a job candidate)"],"pinyin":["lu4 qu3"],"word":"录取"},{"definition":["to major (in a field)\/to study a specialty to obtain a higher degree"],"pinyin":["gong1 du2"],"word":"攻读"},{"definition":["master's degree"],"pinyin":["shuo4 shi4 xue2 wei4"],"word":"硕士学位"},{"definition":["graduate student\/postgraduate student\/research student"],"pinyin":["yan2 jiu1 sheng1"],"word":"研究生"}]}