{"definition":["inaugural speech"],"pinyin":["jiu4 zhi2 yan3 shuo1"],"traditional":["就職演說"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"就职演说","characters":[{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["office\/duty"],"pinyin":["zhi2"],"word":"职"},{"definition":["to develop\/to evolve\/to practice\/to perform\/to play\/to act"],"pinyin":["yan3"],"word":"演"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)","variant of 說|说[shuo1]"],"pinyin":["shui4","shuo1","shuo1"],"word":"说"}],"containing_words":[],"sentences":[{"english":"American presidents' inaugural addresses (APIA) represent the characteristics of the typical formal address.","chinese":"美国总统就职演说代表了正式演说的典型特点。"},{"english":"American presidential inaugural address is a-sub-component of the public political speaking.","chinese":"美国总统就职演说是政治演讲的一种。"},{"english":"Lincoln's inaugural address, brave and elegiac as it was, was speaking into a hurricane.","chinese":"林肯的就职演说，勇敢，祭文，因为它被说成飓风。"},{"english":"She recited the speech, and Munindra recorded it .","chinese":"然后她念出就职演说，穆恁德拉把它录下来。"},{"english":"Some of the best-remembered words of presidents came from their inaugural addresses.","chinese":"有一些总统的经典语句出自他们的就职演说。"},{"english":"Inaugurals mark the end of the presidential election campaign and the beginning of a new administration.","chinese":"就职演说标志着总统竞选结束，新一届领导正式开始。"}],"related":[]}