{"definition":["nearby\/in a close neighborhood"],"pinyin":["jiu4 jin4"],"traditional":["就近"],"rank":9717.0,"normalized_rank":0.13595343696220952,"fraction":0.00000864377321937559,"cumulative_fraction":0.9273073810130406,"word":"就近","characters":[{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["near\/close to\/approximately"],"pinyin":["jin4"],"word":"近"}],"containing_words":[],"sentences":[{"english":"Remove thy way far from her, and come not nigh the door of her house","chinese":"你所行的道要离他远，不可就近他的房门。"},{"english":"Rainwater is outlet naturally by conduits to the nearby rivers.","chinese":"过道路下的雨水管就近排入河道。"},{"english":"In general these two pins should be joined together and to the analog ground of the system.","chinese":"通常，这两个引脚应该就近连接后再接模拟地。"},{"english":"Jane put one foot in the near stirrup and turned to look at the stranger.","chinese":"简一只脚就近蹬上马镫，转脸看着陌生人。"},{"english":"Were the bodyguards so dumb they didn't know where is the closest hospital?","chinese":"难道哪那些随扈不知到就近的医院吗？"},{"english":"The company has a large-scale group of after service, you may go to the one which is close to you.","chinese":"公司有庞大的售后服务队伍您可以就近维修。"},{"english":"My girl friend enjoys traveling through the country hailing up at the nearest inn.","chinese":"我的女朋友喜欢乡间旅行，夜宿就近的小旅店。"},{"english":"In the evening, we had a rest in a hotel after coming alongside the shore.","chinese":"傍晚，我们拢岸后，就近找了一家旅店休息。"},{"english":"Let the sun liuhe town six leading the way into the nearest town.","chinese":"让孙六带路进入了就近的小镇六合镇。"},{"english":"So they came forward and placed their feet on their necks.","chinese":"他们就近前来，把脚踏在这些王的颈项上。"},{"english":"Since students automatically went to neighborhood schools, schools did not have to compete for students.","chinese":"由于学生自动就近入学，故而学校并不争夺生源。"},{"english":"Always have the ability to kill yourself nearby.","chinese":"一定要具备就近自裁的能力。"},{"english":"Suggest your nearby consults a person of the same trade, far hydrolyze not close thirsty.","chinese":"建议你就近请教同行，远水解不了近渴。"},{"english":"The gas can then be funneled to a nearby generator.","chinese":"接下来，把气体汇集到就近的一台发电机。"},{"english":"The corpse of anyone who died from a quarantinable infectious disease must be cremated at a nearby place.","chinese":"因患检疫传染病而死亡的尸体，必须就近火化。"},{"english":"When the king came back from Damascus and saw the altar, he approached it and presented offerings on it.","chinese":"王从大马色回来看见坛，就近前来，在坛上献祭。"}],"related":[{"definition":["locally\/on the spot"],"pinyin":["jiu4 di4"],"word":"就地"},{"definition":["current address\/place of residence"],"pinyin":["ju1 zhu4 di4"],"word":"居住地"},{"definition":["inside the city"],"pinyin":["shi4 nei4"],"word":"市内"},{"definition":["to determine a location\/designated\/appointed\/specific\/fixed (time)\/fixed point (geometry)\/fixed-point (number)"],"pinyin":["ding4 dian3"],"word":"定点"},{"definition":["voluntary\/autonomous\/by oneself\/self-"],"pinyin":["zi4 xing2"],"word":"自行"},{"definition":["location\/site"],"pinyin":["suo3 zai4 di4"],"word":"所在地"},{"definition":["periphery\/rim\/surroundings\/all around\/perimeter\/peripheral (computing)\/spin-offs"],"pinyin":["zhou1 bian1"],"word":"周边"},{"definition":["to leave for\/to proceed towards\/to go"],"pinyin":["qian2 wang3"],"word":"前往"},{"definition":["convenient\/suitable\/to facilitate\/to make things easy\/having money to spare\/(euphemism) to relieve oneself"],"pinyin":["fang1 bian4"],"word":"方便"},{"definition":["dependency\/possession\/annexed territory"],"pinyin":["shu3 di4"],"word":"属地"},{"definition":["to precede others\/in advance"],"pinyin":["xian1 xing2"],"word":"先行"},{"definition":["quick\/fast\/nimble\/agile\/(computer) shortcut"],"pinyin":["kuai4 jie2"],"word":"快捷"},{"definition":["as early as possible"],"pinyin":["jin3 zao3"],"word":"尽早"},{"definition":["to respond to an emergency\/to meet a contingency\/(attributive) emergency"],"pinyin":["ying4 ji2"],"word":"应急"},{"definition":["local\/this locality"],"pinyin":["ben3 di4"],"word":"本地"},{"definition":["parts of the country other than where one is"],"pinyin":["wai4 di4"],"word":"外地"}]}