{"definition":["to try one's utmost\/to strive"],"pinyin":["jin4 li4 er2 wei2"],"traditional":["盡力而為"],"rank":32786.0,"normalized_rank":0.4587186769829166,"fraction":7.35581261757276e-7,"cumulative_fraction":0.9925681285135252,"word":"尽力而为","characters":[{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely","to the greatest extent\/(when used before a noun of location) furthest or extreme\/to be within the limits of\/to give priority to"],"pinyin":["jin4","jin3"],"word":"尽"},{"definition":["surname Li","power\/force\/strength\/ability\/strenuously"],"pinyin":["Li4","li4"],"word":"力"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"}],"containing_words":[],"sentences":[{"english":"I had no idea in what terms one shouted at koalas, but I did my best.","chinese":"我不知道别人用什么字眼来叫，不过，我尽力而为啦。"},{"english":"If your goal is to ‘do your best, ’ you probably won’t.","chinese":"如果你的目标是尽力而为，你或许不会努力。"},{"english":"Also tell what guide dont have to worry about the cast, he will do his best.","chinese":"亦名告诉何导不用操心剧组的事，他会尽力而为。"},{"english":"So, when that thing happens, you just do what you have to and try your best.","chinese":"所以，在这种情况下，你只能尽力而为。"},{"english":"Shit happens, especially when a newbie is \"trying his best\".","chinese":"天有不测风云，尤其是个新手在“尽力而为”的时候。"},{"english":"All that you do, do with your might; things done by halves are never done right. –R. H. Stoddard.","chinese":"做一切事情都要尽力而为，半途而废永远不行。"},{"english":"Despite all his efforts, Mr. B failed again and again.","chinese":"虽然B先生尽力而为，但他还是一再失败。"},{"english":"Do the best you can when the time comes, and if the audience laughs, don't blame me.","chinese":"演出时尽力而为吧，如果观众笑你，别怪我。"},{"english":"He told his wife, \"A man ain't nothing but a man. But, a man always has to do his best.\"","chinese":"男人无论什么时候都应该勇挑重任，尽力而为。"},{"english":"Do your best and then let go.","chinese":"尽力而为，然后随缘。"},{"english":"If we canwoult do as we would, we must do as we can.","chinese":"如不能如愿而行，定须尽力而为。"},{"english":"Now is the time for all of us to do our part.","chinese":"现在是我们所有的人尽力而为的时候了。"},{"english":"We will try our best to fulfill your requests to your utmost satisfaction.","chinese":"您的要逑我尽力而为，希望这样能让您满意。"},{"english":"Except that his villain is climate change, and while he’s still doing everything he can to avoid a fight, Keith is also stockpiling ammo.","chinese":"基思尽力而为避免一场战斗，同时他也在贮备弹药。"},{"english":"They who cannot do as they would, must do as they can.","chinese":"羮不能如愿而行，也须尽力而为。"},{"english":"Should you give me a trial, I will do my utmost to afford you every satisfaction.","chinese":"如有试用的机会，本人必尽力而为，以使贵院满足。"}],"related":[{"definition":["to strive one's hardest\/to spare no effort"],"pinyin":["jin4 li4"],"word":"尽力"},{"definition":["planning is with man, accomplishing with heaven (idiom); Man proposes but God disposes."],"pinyin":["mou2 shi4 zai4 ren2 , cheng2 shi4 zai4 tian1"],"word":"谋事在人，成事在天"},{"definition":["to spare no effort (idiom); to do one's utmost"],"pinyin":["jie2 jin4 quan2 li4"],"word":"竭尽全力"},{"definition":["the matter depends on the individual (idiom); it is a matter for your own effort\/With effort, one can achieve anything."],"pinyin":["shi4 zai4 ren2 wei2"],"word":"事在人为"},{"definition":["to spare no effort (idiom); to do one's utmost"],"pinyin":["jin4 xin1 jie2 li4"],"word":"尽心竭力"},{"definition":["if only it were so\/I hope so (idiom)"],"pinyin":["dan4 yuan4 ru2 ci3"],"word":"但愿如此"},{"definition":["to weigh one's abilities and act accordingly\/to act according to one's means\/to cut one's coat according to one's cloth"],"pinyin":["liang4 li4 er2 wei2"],"word":"量力而为"},{"definition":["with all of one's heart"],"pinyin":["jin4 xin1"],"word":"尽心"},{"definition":["to do at all costs\/to make an all-out effort"],"pinyin":["quan2 li4 yi3 fu4"],"word":"全力以赴"},{"definition":["to insist on\/to demand\/to impose"],"pinyin":["qiang3 qiu2"],"word":"强求"},{"definition":["life and death are ruled by fate (idiom)"],"pinyin":["sheng1 si3 you3 ming4"],"word":"生死有命"},{"definition":["one's limited power (humble expr.)"],"pinyin":["mian2 li4"],"word":"绵力"},{"definition":["Since they have come, we should make them comfortable (idiom). Since we're here, take it easy.\/Since this is so, we should accept it.\/Now we have come, let's stay and take the rough with the smooth.\/If you can't do anything to prevent it, you might as well sit back and enjoy it."],"pinyin":["ji4 lai2 zhi1 , ze2 an1 zhi1"],"word":"既来之，则安之"},{"definition":["lit. look into one's heart, no shame (idiom); with a clear conscience"],"pinyin":["wen4 xin1 wu2 kui4"],"word":"问心无愧"},{"definition":["as far as one's capabilities extend (idiom); to the best of one's ability\/within one's powers"],"pinyin":["li4 suo3 neng2 ji2"],"word":"力所能及"},{"definition":["not to be shirked without dishonor (idiom)\/incumbent\/bounden (duty)"],"pinyin":["yi4 bu4 rong2 ci2"],"word":"义不容辞"}]}