{"definition":["as early as possible"],"pinyin":["jin3 zao3"],"traditional":["儘早"],"rank":7766.0,"normalized_rank":0.10865641570942873,"fraction":0.000012554951775887338,"cumulative_fraction":0.906930424952053,"word":"尽早","characters":[{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely","to the greatest extent\/(when used before a noun of location) furthest or extreme\/to be within the limits of\/to give priority to"],"pinyin":["jin4","jin3"],"word":"尽"},{"definition":["early\/morning\/Good morning!\/long ago\/prematurely"],"pinyin":["zao3"],"word":"早"}],"containing_words":[],"sentences":[{"english":"What other types of things should co-founders be discussing in the early days of a startup and getting clarity on?","chinese":"还有哪些事情是创业公司应当尽早考虑的？"},{"english":"We also urge opposition parties to present their manifestoes to voters as early as possible.","chinese":"我们还敦促在野党尽早发布他们对选民的政治宣言。"},{"english":"The soil pollution in this area is very serious, we should deal with it as soon as possible.","chinese":"这个地区的土壤污染非常严重，我们应尽早治理。"},{"english":"If you get bingo on the way, tell me in plenty of time.","chinese":"如果路上车快没油了，要尽早告诉我。"},{"english":"Please inform us of your travel plan at the earliest date so that we can make arangements.","chinese":"请尽早告知我们您的旅游计划，以便我们做出安排。"},{"english":"Please make up your mind \/ make your decision as early as possible \/ you can, or you’ll miss the good \/ golden chance \/ opportunity.","chinese":"请尽早做出决定，不然你会坐失良机。"},{"english":"So I want to see my great motherland to achieve peaceful reunification as soon as possible.","chinese":"我愿意看到我们的伟大祖国能够尽早实现和平统一。"},{"english":"Dark lines beneath the nail should be investigated as soon as possible.","chinese":"科学家应该尽早对指甲之下的暗线进行调查。"},{"english":"You should go to see the doctor as soon as possible.","chinese":"你应该尽早看医生，别让它发展成一个严重的疾病。"},{"english":"It would be much appreciated if you could send me the reply as soon as possible.","chinese":"如果贵司能尽早的寄给我，我将十分感激。"},{"english":"Identify and correct problems early.","chinese":"尽早的发现和更正问题。"},{"english":"Please advise your travel plan at earliest date so we make argot acidly.","chinese":"请尽早告知旅游计划，以便我们做出安排。"},{"english":"A decision could come as soon as this week.","chinese":"必须在这周尽早地作出决定。"},{"english":"It was recommended that the annual maximum value method is worth to accept by the design code.","chinese":"建议《室外排水设计规范》尽早改用年最大值法选样。"},{"english":"Conclusion Ascertaining diagnosis and doing surgical operations as soon as possible is the key to cure trau…","chinese":"结论应该尽早明确诊断和手术是治愈本病的关键。"},{"english":"You early reply will be highly appreciated.","chinese":"你方若能尽早答复我方将非常感激。"}],"related":[{"definition":["at the earliest possible time\/as soon as possible"],"pinyin":["ji2 zao3"],"word":"及早"},{"definition":["as quickly as possible\/as soon as possible\/with all speed","see 儘快|尽快[jin3 kuai4]"],"pinyin":["jin3 kuai4","jin4 kuai4"],"word":"尽快"},{"definition":["soon\/shortly\/on a day quite soon\/promptly"],"pinyin":["zao3 ri4"],"word":"早日"},{"definition":["ahead of schedule\/sooner than planned\/to bring forward (to an earlier time)"],"pinyin":["ti2 zao3"],"word":"提早"},{"definition":["breakfast"],"pinyin":["zao3 dian3"],"word":"早点"},{"definition":["to snatch time\/to rush\/to hurry (up)\/to seize the moment"],"pinyin":["zhua1 jin3 shi2 jian1"],"word":"抓紧时间"},{"definition":["as far as possible\/to do one's utmost"],"pinyin":["jin3 ke3 neng2"],"word":"尽可能"},{"definition":["to fight for\/to strive for\/to win over"],"pinyin":["zheng1 qu3"],"word":"争取"},{"definition":["so that\/so as to\/in order to"],"pinyin":["yi3 bian4"],"word":"以便"},{"definition":["top priority job\/matter of vital importance"],"pinyin":["dang1 wu4 zhi1 ji2"],"word":"当务之急"},{"definition":["to adopt measures\/to take steps"],"pinyin":["cai3 qu3 cuo4 shi1"],"word":"采取措施"},{"definition":["in time\/promptly\/without delay\/timely"],"pinyin":["ji2 shi2"],"word":"及时"},{"definition":["must\/to need to\/to be sure to"],"pinyin":["wu4 bi4"],"word":"务必"},{"definition":["see 防患未然[fang2 huan4 wei4 ran2]"],"pinyin":["fang2 huan4 yu2 wei4 ran2"],"word":"防患于未然"},{"definition":["eager to\/in a hurry to"],"pinyin":["ji2 yu2"],"word":"急于"},{"definition":["in order to\/hoping to\/attempting to\/waiting for"],"pinyin":["yi3 qi1"],"word":"以期"}]}