{"definition":["despite\/although\/even though\/in spite of\/unhesitatingly\/do not hesitate (to ask, complain etc)\/(go ahead and do it) without hesitating"],"pinyin":["jin3 guan3"],"traditional":["儘管"],"rank":614.0,"normalized_rank":0.008590656611587592,"fraction":0.0002515847030823164,"cumulative_fraction":0.5434641345670124,"word":"尽管","characters":[{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely","to the greatest extent\/(when used before a noun of location) furthest or extreme\/to be within the limits of\/to give priority to"],"pinyin":["jin4","jin3"],"word":"尽"},{"definition":["variant of 管[guan3]","surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["guan3","Guan3","guan3"],"word":"管"}],"containing_words":[],"sentences":[{"english":"However, the moonlit glare washes this rather faint constellation from the sky tonight.","chinese":"尽管如此，月光洗去了今晚天际中星星们昏暗的光。"},{"english":"Plus, although she's a vampire, she doesn't go around killing innocent humans.","chinese":"最后，尽管她是一名吸血鬼，她并没有滥杀无辜人类。"},{"english":"Be that as it may， the nerve poison does its business with man far more quickly than the blood poison.","chinese":"尽管如此，神经毒液毒杀人类比血毒液快得多。"},{"english":"If you believe Sony it's still the best camera even without OIS.","chinese":"如果你相信索尼尽管没有光学防抖仍然是最好的相机。"},{"english":"However, Massimo Ambronisi equalized in the 25th minute for Milan.","chinese":"尽管如此，安布罗西尼在25分钟为米兰扳平了比分。"},{"english":"While this is particularly true for primary cells, this technique can also be used for secondary cells.","chinese":"尽管对于原电池是这样，该技术还可以用于蓄电池。"},{"english":"Despite living in freshwater, it is also resembles marine turtles.","chinese":"尽管猪鼻龟生活在淡水中，它同时又很像海龟。"},{"english":"That's a long way off but it's not too early to make plans.","chinese":"尽管来日方长，但是及早打算总没错。"},{"english":"For all its troubles, it seems that the US is still the real Middle Kingdom.","chinese":"尽管危机重重，美国似乎仍是真正的“中央王国”。"},{"english":"Despite all my efforts to persuade him, he wouldn't agree.","chinese":"尽管我尽力说服他，可他就是不同意。"},{"english":"Although De Gang can blame the sea aloud, but he is same however ashamed is right Chun Yan.","chinese":"尽管德纲可以大声责备大海，但他却一样愧对春颜。"},{"english":"Although the farm is large, my Dad has two men working for him.","chinese":"尽管农场较大，我爸爸只雇了两个人帮他干活。"},{"english":"Susan: Because, I have a lot of things to say so you can just listen.","chinese":"因为我有很多话要说，你尽管听便是了。"},{"english":"Let me reassure you that it's standard practice.","chinese":"有关那一点，请您尽管放心好了。"},{"english":"And in spite of its being winter I would perspire all over.","chinese":"尽管这时还是冬天，我却浑身都被汗湿透。"},{"english":"I will lend you all the few books that I can spare.","chinese":"我愿把我能不用的书都借给你，尽管这些书为数不多。"}],"related":[{"definition":["although\/even though\/even if"],"pinyin":["sui1 ran2"],"word":"虽然"},{"definition":["but\/yet\/however\/only\/merely\/still"],"pinyin":["dan4"],"word":"但"},{"definition":["still\/yet"],"pinyin":["reng2 ran2"],"word":"仍然"},{"definition":["but\/however"],"pinyin":["dan4 shi4"],"word":"但是"},{"definition":["still\/as before"],"pinyin":["yi1 ran2"],"word":"依然"},{"definition":["but\/yet\/however\/while\/to go back\/to decline\/to retreat\/nevertheless\/even though","old variant of 卻|却[que4]"],"pinyin":["que4","que4"],"word":"却"},{"definition":["however\/yet\/but"],"pinyin":["ran2 er2"],"word":"然而"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不过"},{"definition":["still\/yet\/to remain"],"pinyin":["reng2"],"word":"仍"},{"definition":["still (remaining)\/to remain (the same)\/yet"],"pinyin":["reng2 jiu4"],"word":"仍旧"},{"definition":["although\/even though"],"pinyin":["sui1"],"word":"虽"},{"definition":["in fact\/in reality\/as a matter of fact\/in practice"],"pinyin":["shi2 ji4 shang4"],"word":"实际上"},{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["as before\/still"],"pinyin":["yi1 jiu4"],"word":"依旧"},{"definition":["even if\/even though"],"pinyin":["ji2 shi3"],"word":"即使"},{"definition":["in fact\/in reality\/actually\/as a matter of fact\/de facto\/ipso facto"],"pinyin":["shi4 shi2 shang4"],"word":"事实上"}]}