{"definition":["as much as possible\/to the greatest extent","as much as possible\/to the greatest extent"],"pinyin":["jin3 liang4","jin4 liang4"],"traditional":["儘量","盡量"],"rank":2688.0,"normalized_rank":0.037608607446168486,"fraction":0.000054555488598975605,"cumulative_fraction":0.7747158233356456,"word":"尽量","characters":[{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely","to the greatest extent\/(when used before a noun of location) furthest or extreme\/to be within the limits of\/to give priority to"],"pinyin":["jin4","jin3"],"word":"尽"},{"definition":["capacity\/quantity\/amount\/to estimate\/abbr. for 量詞|量词[liang4 ci2], classifier (in Chinese grammar)\/measure word","to measure"],"pinyin":["liang4","liang2"],"word":"量"}],"containing_words":[],"sentences":[{"english":"Modify your diet to exclude or limit dairy products, alcohol, smoking or other stimulants.","chinese":"不吃或少吃乳制品，尽量不要接近烟酒或其他刺激物。"},{"english":"In order to construct harmonious society, it is necessary to try to decrease the recidivism rate.","chinese":"建设和谐社会，尽量降低重新犯罪率是必要的。"},{"english":"I would try to maximize my combat capability, as long as this process goes on,\" he said.","chinese":"只要这个过程还在继续，我就会尽量加大战斗能力。"},{"english":"Try to squeeze in the grocery trip in that intermediate time.","chinese":"尽量在此期间挤时间去购物。"},{"english":"Try to avoid sending large records to the front end to be transformed there.","chinese":"尽量避免发送大型记录到前端并在那里转换。"},{"english":"The diet is As It IS. Replacements are NOT recommended.","chinese":"餐单内食物请尽量不要以其他食物代替。"},{"english":"In other words, avoid the left side of the entire hole.","chinese":"总之，你应该尽量避开洞的整个左侧区域。"},{"english":"Try to pay attention as you eat and stop when you're full.","chinese":"请尽量注意你的饱足感，如果你觉得饱了就不要再吃。"},{"english":"The property right need to be very clearly and blench of the pawn of bank.","chinese":"房产产权清晰，尽量回避银行抵押物业。"},{"english":"Her job is keeping the lecture hall as clean as possible.","chinese":"她的工作是尽量使报告厅保持干净。"},{"english":"As far as possible need not chlorpromazine.","chinese":"尽量不用氯丙嗪。"},{"english":"My basic game plan was to try and reduce the incoming light to the absolute minimum.","chinese":"我拍摄的基本计划是尽量的减少进光量。"},{"english":"The demonstration was carefully orchestrated to attract maximum publicity.","chinese":"该示威经过精心策画以尽量吸引公众注重。"},{"english":"Install the shades as close to the glass as possible.","chinese":"安装的时候，尽量把这种遮光窗户和玻璃安的紧一点。"},{"english":"Use of global variables should be minimized.","chinese":"尽量减少全局变量的使用。"},{"english":"First, shake out as much water as you can and dry it off with a paper towel.","chinese":"首先你要使劲的甩干它，然后用纸巾尽量吸干。"}],"related":[{"definition":["as far as possible\/to do one's utmost"],"pinyin":["jin3 ke3 neng2"],"word":"尽可能"},{"definition":["best\/(you) had better (do what we suggest)"],"pinyin":["zui4 hao3"],"word":"最好"},{"definition":["to avert\/to prevent\/to avoid\/to refrain from"],"pinyin":["bi4 mian3"],"word":"避免"},{"definition":["don't!\/must not"],"pinyin":["bu4 yao4"],"word":"不要"},{"definition":["remember at all costs"],"pinyin":["qie4 ji4"],"word":"切记"},{"definition":["in order to avoid\/so as not to"],"pinyin":["yi3 mian3"],"word":"以免"},{"definition":["to avoid as taboo\/to avoid by all means"],"pinyin":["qie4 ji4"],"word":"切忌"},{"definition":["to take note of\/to pay attention to"],"pinyin":["zhu4 yi4"],"word":"注意"},{"definition":["suitable\/appropriate"],"pinyin":["shi4 dang4"],"word":"适当"},{"definition":["to avoid\/to evade\/to keep away from"],"pinyin":["bi4 kai1"],"word":"避开"},{"definition":["(so as) to avoid\/to prevent\/(just) in case"],"pinyin":["yi3 fang2"],"word":"以防"},{"definition":["by no means"],"pinyin":["qie4 wu4"],"word":"切勿"},{"definition":["to propose\/to suggest\/to recommend\/proposal\/suggestion\/recommendation\/CL:個|个[ge4],點|点[dian3]"],"pinyin":["jian4 yi4"],"word":"建议"},{"definition":["must\/to need to\/to be sure to"],"pinyin":["wu4 bi4"],"word":"务必"},{"definition":["to agree (to do sth)\/should\/ought to\/must\/(legal) shall","surname Ying","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["ying1","Ying4","ying4"],"word":"应"},{"definition":["not suitable\/inadvisable\/inappropriate"],"pinyin":["bu4 yi2"],"word":"不宜"}]}