{"definition":["unexpectedly\/to one's surprise\/go so far as to"],"pinyin":["ju1 ran2"],"traditional":["居然"],"rank":3100.0,"normalized_rank":0.04337302198032823,"fraction":0.0000462565145342479,"cumulative_fraction":0.7954200133553949,"word":"居然","characters":[{"definition":["to reside\/to be (in a certain position)\/to store up\/to be at a standstill\/residence\/house\/restaurant\/classifier for bedrooms","(archaic) sentence-final particle expressing a doubting attitude","surname Ju"],"pinyin":["ju1","ji1","Ju1"],"word":"居"},{"definition":["correct\/right\/so\/thus\/like this\/-ly"],"pinyin":["ran2"],"word":"然"}],"containing_words":[],"sentences":[{"english":"You hurt my feelings by betraying me when I'm in trouble.","chinese":"你太伤我感情了，居然在我身陷困境之时背叛了我。"},{"english":"However, soon after that, she has a relapse of breast cancer.","chinese":"但是不久，滴发现她的乳癌居然复发。"},{"english":"It' really surprises me that Xiao gives me an ticket of Olympic.","chinese":"确实比较惊喜，老肖居然送我一张奥运门票。"},{"english":"One cannot imagine mere human beings concocting such dreadful things, and one can scarcely imagine human beings bearing life in them.","chinese":"更令人想不到的是，居然还有人类在其中繁衍生息。"},{"english":"You insult the Queen of Burgund in public with these lies?","chinese":"你居然在大庭广众下用这种谎言侮辱勃艮的皇后？"},{"english":"I had no idea of thescale of things until I went over last year to give readings.","chinese":"我直到去年去做读书会才知道居然卖了那么多。"},{"english":"We choose to go to the moon and other things, not because they are easy, but because they are hard.","chinese":"好容易翻完这么长这么专业的东西居然没人认领？"},{"english":"Have not missed Chen Shi to her gushed is to have a cordiality, incredibly wanted to cry in doctor for her.","chinese":"没曾想沈氏对她倒是颇有情意，居然要为她去请大夫。"},{"english":"After a really short explanation, the staff member who came up began to leave.","chinese":"终于上来的员工居然在超快超仓促的解释后就要走。"},{"english":"One only knows how bloody men, even, for you to tears.","chinese":"一个是只懂流血的男人，居然，为你流了泪。"},{"english":"You may think it strange that anyone would live there.","chinese":"你也许感到奇怪，居然有人愿意住在那儿。"},{"english":"Ichoate time , I Actually foolish foolish go believe you.","chinese":"刚开始的时候，我居然儍傻去相信祢。"},{"english":"Eyes a bright, incredibly have force monk is having a competition?","chinese":"眼睛一亮，居然有武修士在比试？"},{"english":"Late returns, people find, sammo hung the dwellings of lamp incredibly still on.","chinese":"深夜返回时，大家发现，洪金宝住处的灯居然还亮着。"},{"english":"Yang Hong interrogated in light of this that Manager Hao said unexpectedly looked Yang Hong does not look like the ordinary consumer.","chinese":"杨鸿就此质问，郝经理居然说看杨鸿不像普通消费者。"},{"english":"Wah dares to offend Our Majesty.","chinese":"华太师居然敢得罪我们皇爷。"}],"related":[{"definition":["unexpectedly\/to one's surprise\/in spite of everything\/in that crazy way\/actually\/to go as far as to"],"pinyin":["jing4 ran2"],"word":"竟然"},{"definition":["didn't expect"],"pinyin":["mei2 xiang3 dao4"],"word":"没想到"},{"definition":["unexpectedly\/actually\/to go so far as to\/indeed"],"pinyin":["jing4"],"word":"竟"},{"definition":["indeed\/truly\/(coll.) (used to express disapproval, annoyance etc about sth)"],"pinyin":["zhen1 shi5"],"word":"真是"},{"definition":["really\/sure enough\/as expected\/if indeed"],"pinyin":["guo3 ran2"],"word":"果然"},{"definition":["unexpected\/hard to imagine\/it had not occurred to me\/who could have thought that"],"pinyin":["xiang3 bu5 dao4"],"word":"想不到"},{"definition":["don't tell me ...\/could it be that...?"],"pinyin":["nan2 dao4"],"word":"难道"},{"definition":["(it's) no wonder (that...)\/(it's) not surprising (that)"],"pinyin":["nan2 guai4"],"word":"难怪"},{"definition":["original\/former\/originally\/formerly\/at first\/so, actually, as it turns out"],"pinyin":["yuan2 lai2"],"word":"原来"},{"definition":["but\/however\/(used for emphasis) indeed"],"pinyin":["ke3 shi4"],"word":"可是"},{"definition":["no wonder!\/so that's why!"],"pinyin":["guai4 bu5 de5"],"word":"怪不得"},{"definition":["obviously\/plainly\/undoubtedly\/definitely"],"pinyin":["ming2 ming2"],"word":"明明"},{"definition":["almost\/nearly"],"pinyin":["cha4 dian3"],"word":"差点"},{"definition":["to appear to be\/to seem as if"],"pinyin":["mao4 si4"],"word":"貌似"},{"definition":["God knows...\/Who would have imagined...?"],"pinyin":["shei2 zhi1 dao4"],"word":"谁知道"},{"definition":["so much\/this much\/how much?\/this way\/like this"],"pinyin":["zhe4 me5"],"word":"这么"}]}