{"definition":["the end of fixed period in office\/expiration of a term"],"pinyin":["jie4 man3"],"traditional":["屆滿"],"rank":15060.0,"normalized_rank":0.2107089390399172,"fraction":0.000004119634607670588,"cumulative_fraction":0.9592809903987176,"word":"届满","characters":[{"definition":["to arrive at (place or time)\/period\/to become due\/classifier for events, meetings, elections, sporting fixtures, years (of graduation)"],"pinyin":["jie4"],"word":"届"},{"definition":["Manchu ethnic group","to fill\/full\/filled\/packed\/fully\/completely\/quite\/to reach the limit\/to satisfy\/satisfied\/contented"],"pinyin":["Man3","man3"],"word":"满"}],"containing_words":[],"sentences":[{"english":"Article 169. An independent director may submit his resignation before the expiration of his term.","chinese":"第一百六十九条独立董事在任期届满钱可以提出辞职。"},{"english":"Mr Tung's five-year term ends in June 2000.","chinese":"董建华的五年任期将于二千年六月届满。"},{"english":"Prior to the expiration of a director's term, the shareholders' general committee may not remove him without cause.","chinese":"董事在任期届满前，股东大会不得无故解除其职务。"},{"english":"Prior to expiration of a director's term, the shareholders' committee may not remove him without cause.","chinese":"董事在任期届满前，股东会不得无故解除其职务。"},{"english":"A contract subject to a time of expiration is extinguished at such time.","chinese":"附终止期限的合同，自期限届满时失效。"},{"english":"The Andes Favored Trade Act expired last December.","chinese":"安地斯贸易优惠法已于去年十二月届满。"},{"english":"This provision shall also apply after lapse of the centralized custody period.","chinese":"继续予以集中保管，集中保管期间届满后亦同。"},{"english":"However, the ESE can be large for resources with intermediate expiration granularity.","chinese":"然而，东南偏东可大量的资源与中间届满粒度。"},{"english":"The ownership of the leased asset is transferred to the lessee when the term of lease expires;","chinese":"在租赁期届满时，租赁资产的所有权转移给承租人。"},{"english":"Which being expired, the same day all the army of the Lord went forth out of the land of Egypt.","chinese":"四百三十年届满的那一天，上主的军旅离开了埃及。"},{"english":"This Contract shall terminate upon expiration of the Joint Venture Term.","chinese":"本合同在合营期限届满时终止。"},{"english":"Upon expiration, re-inspection and license renewal shall be conducted.","chinese":"有效期届满应当重新审查发证。"},{"english":"The President can be elected again at the expiration of his4 years in office.","chinese":"总统在四年任期届满时可以连选连任。"},{"english":"Nothing in this licence confers any right to a renewal thereof on its expiry or to the grant of a new licence.","chinese":"本牌照并无授予牌照届满时续期或批给新牌照的权利。"},{"english":"Those not reorganized shall be terminated in one year's time starting from the date of the implementation of this law.","chinese":"未重新组建的，自本法施行之日起届满一年时终止。"},{"english":"Mr. Trichet, 68, will retire at the end of October after an eight-year term.","chinese":"今年68岁，会在8年任期届满后在10月底退休。"}],"related":[{"definition":["to expire\/to run out\/to come to an end"],"pinyin":["qi1 man3"],"word":"期满"},{"definition":["grace period\/period of grace"],"pinyin":["kuan1 xian4 qi1"],"word":"宽限期"},{"definition":["time limit\/deadline\/allotted time"],"pinyin":["qi1 xian4"],"word":"期限"},{"definition":["to fall due (loan etc)\/to expire (visa etc)\/to mature (investment bond etc)"],"pinyin":["dao4 qi1"],"word":"到期"},{"definition":["to delay\/to extend\/to postpone\/to defer"],"pinyin":["yan2 qi1"],"word":"延期"},{"definition":["closing date (of contract)\/maturity (of an investment bond)"],"pinyin":["dao4 qi1 ri4"],"word":"到期日"},{"definition":["to take effect\/to go into effect"],"pinyin":["sheng1 xiao4"],"word":"生效"},{"definition":["period of validity\/sell-by date"],"pinyin":["you3 xiao4 qi1"],"word":"有效期"},{"definition":["on schedule\/on time"],"pinyin":["an4 qi1"],"word":"按期"},{"definition":["stakeholder\/interested party\/interested person"],"pinyin":["li4 hai4 guan1 xi5 ren2"],"word":"利害关系人"},{"definition":["to repay a debt in full\/to redeem\/to clear"],"pinyin":["qing1 chang2"],"word":"清偿"},{"definition":["debtor"],"pinyin":["zhai4 wu4 ren2"],"word":"债务人"},{"definition":["to set a time limit\/time limit\/deadline"],"pinyin":["xian4 qi1"],"word":"限期"},{"definition":["creditor"],"pinyin":["zhai4 quan2 ren2"],"word":"债权人"},{"definition":["to fulfill (one's obligations)\/to carry out (a task)\/to implement (an agreement)\/to perform"],"pinyin":["lu:3 xing2"],"word":"履行"},{"definition":["according to provisions\/as stipulated in the rules"],"pinyin":["gen1 ju4 gui1 ding4"],"word":"根据规定"}]}