{"definition":["to reveal\/to display\/to show\/to exhibit sth"],"pinyin":["zhan3 shi4"],"traditional":["展示"],"rank":1355.0,"normalized_rank":0.018958207994627344,"fraction":0.00011952779467319182,"cumulative_fraction":0.6688612414650074,"word":"展示","characters":[{"definition":["to spread out\/to open up\/to exhibit\/to put into effect\/to postpone\/to prolong\/exhibition","surname Zhan"],"pinyin":["zhan3","Zhan3"],"word":"展"},{"definition":["to show\/to reveal"],"pinyin":["shi4"],"word":"示"}],"containing_words":[],"sentences":[{"english":"This article shows you how to create a user registration form from beginning to end.","chinese":"本文向您展示了创建用户注册表单的全过程。"},{"english":"Plastic bottles and buckets, even the sole of a shoe are all on display.","chinese":"塑料瓶和塑料桶，甚至还有鞋底都在那里展示。"},{"english":"The company showed the prototype of the new model at the exhibition.","chinese":"公司在展览会上展示了这种新模型的原型。"},{"english":"I showed him a wide selection, and quickly he picked out a pair.","chinese":"我给他展示了许多款选择，很快他选种了一对。"},{"english":"He hopes to write reports in English to support the exposure of his hometown to the rest of the world.","chinese":"他希望通过英文文章向世界展示自己的家乡。"},{"english":"The section diagrams are meant to show two levels of information in the cut.","chinese":"这个剖面图意在展示切面的两个层的信息。"},{"english":"How did you think about\"Luxe Pack in Green\" area?","chinese":"您认为“奢侈品包装的绿色革命”特区的展示如何？"},{"english":"Reading these same stories mythologically, however, can bring forth their universal qualities.","chinese":"然而，这些相同的神话故事也展示了他们的普遍特征。"},{"english":"I chose three of them to show all of you a full view.","chinese":"我选了当中的三张以展示完整的外观给您们大家看。"},{"english":"I'm going to show you one last technique.","chinese":"我要给你展示最后一项技术。"},{"english":"In here, from the slash-and-burn cultivation to the high tech agriculture, obtains the demonstration.","chinese":"在这里，从刀耕火种到高科技农业，都得到展示。"},{"english":"Beutiful photos and very powerful representation of a great Nation.","chinese":"漂亮的图片，这也是对一个大国的强有力的展示。"},{"english":"The thesis mainly demonstrates the securitization from the perspective of Cross-Border.","chinese":"本文主要从跨国性的视角向读者展示资产证券化。"},{"english":"However, Rock Financial Showplace might also prove to be too small for the international show.","chinese":"然而，岩财务展示也可能被证明是太小，国际查看。"},{"english":"That particular screenshot mentioned shows off a visceral fight between Marauders and Immortals.","chinese":"这张截屏展示了掠夺者和不朽者的激烈战斗。"},{"english":"10 a.m. - Head over to the Urban Planning Exhibition Center, a six story building, situated on People's Square.","chinese":"参观位于人民广场的上海城市规划展示馆。"}],"related":[{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"word":"展现"},{"definition":["to put on display\/to be on show\/to exhibit"],"pinyin":["zhan3 chu1"],"word":"展出"},{"definition":["to appear\/to emerge\/to present (a certain appearance)\/to demonstrate"],"pinyin":["cheng2 xian4"],"word":"呈现"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"体现"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰显"},{"definition":["to demonstrate\/to show\/presentation\/demonstration"],"pinyin":["yan3 shi4"],"word":"演示"},{"definition":["to expound (a position)\/to elaborate (on a topic)\/to treat (a subject)"],"pinyin":["chan3 shu4"],"word":"阐述"},{"definition":["to put on display\/to exhibit\/exhibition\/show\/CL:個|个[ge4],次[ci4]"],"pinyin":["zhan3 lan3"],"word":"展览"},{"definition":["to spread out\/to open up\/to exhibit\/to put into effect\/to postpone\/to prolong\/exhibition","surname Zhan"],"pinyin":["zhan3","Zhan3"],"word":"展"},{"definition":["charm\/fascination\/glamor\/charisma"],"pinyin":["mei4 li4"],"word":"魅力"},{"definition":["to have unique (talent, insight etc)"],"pinyin":["du2 ju4"],"word":"独具"},{"definition":["to recreate\/to reconstruct (a historical relic)"],"pinyin":["zai4 xian4"],"word":"再现"},{"definition":["to present clearly\/to give prominence to\/to magnify\/clear and obvious"],"pinyin":["tu1 xian3"],"word":"凸显"},{"definition":["to explain\/to expound\/to interpret\/elucidation"],"pinyin":["chan3 shi4"],"word":"阐释"},{"definition":["style\/manner\/ethos"],"pinyin":["feng1 mao4"],"word":"风貌"},{"definition":["to create\/to build\/to develop\/to forge (of metal)"],"pinyin":["da3 zao4"],"word":"打造"}]}