{"definition":["south of the five ranges\/old term for south China, esp. Guangdong and Guangxi"],"pinyin":["Ling3 nan2"],"traditional":["嶺南"],"rank":15626.0,"normalized_rank":0.21862801337568036,"fraction":0.000003843590915274673,"cumulative_fraction":0.9615351878610418,"word":"岭南","characters":[{"definition":["mountain range\/mountain ridge"],"pinyin":["ling3"],"word":"岭"},{"definition":["south","surname Nan"],"pinyin":["nan2","Nan2"],"word":"南"}],"containing_words":[],"sentences":[{"english":"Madame Xian Tai was the chief of the Baiyue ethnic group in the Lingnan region.","chinese":"冼夫人是岭南百越族的一位首领。"},{"english":"From the historical perspective, there is a staged meaning that the Nanyue Kingdom explored the Lingnan region.","chinese":"从历史上看，南越王国对岭南开发有着阶段性的意义。"},{"english":"Taishan is well known as the hometown of overseas Chinese in Southern China.","chinese":"台山是我国岭南著名的华侨之乡。"},{"english":"The west garden in Liuhua Park is a famous miniascape garden and one of the excellence Lingnan Gardens.","chinese":"流花西苑是广州著名的盆景园，也是岭南园林的精品。"},{"english":"In a word. East River Region was the economic barycenter of Lingnan in Eastern Zhou Period.","chinese":"归纳之，东周时期东江流域是岭南的经济重心。"},{"english":"It can be said that The Xielu Villa can be a window to display the Lingnan culture.","chinese":"可以说，谢鲁山庄开启的是一扇展示岭南文化的窗口。"},{"english":"Guangdong and Gungxi both belong to Lingnan Cultural Area.","chinese":"广东广西本属岭南文化区。"},{"english":"This is also one of the main characteristics of Lingnan culture.","chinese":"世俗性这也是岭南文化主要特征之一。"},{"english":"The southern Cantonese culture is a separate cultural entity.","chinese":"岭南文化是一单独的文化实体。"},{"english":"Nanyue Kingdom was an important regional regime in Lingnan in late Qin and early Han Dynasty.","chinese":"南越国是秦末汉初存在于岭南地区的重要地方政权。"},{"english":"The following information is provided by Lingnan University and posted by Student Affairs Section.","chinese":"以下资料由岭南大学提供，学生事务处代传。"},{"english":"Nanhan Dynasty is short, but it still affected the development of the Ling Nan area.","chinese":"南汉统治的时间虽短，但对岭南地区的开发仍有影响。"},{"english":"There were five climaxes of immigration to Lingnan in history.","chinese":"历史上先后有五次移民岭南的高潮。"},{"english":"That program, CHEMBA (China Executive MBA in Guangzhou, China), is offered through a partnership between the Carlson School and Lingnan (University) College.","chinese":"该项目由卡尔森管理学院和岭南学院合作办学。"},{"english":"Secularity This is also one of the main characteristics of Lingnan culture.","chinese":"世俗性这也是岭南文化主要特征之一。"},{"english":"Banana is one of the four shaddock are lingnan.","chinese":"香蕉是岭南四大名果之一。"}],"related":[{"definition":["the two provinces of Guangdong and Guangxi (traditional)"],"pinyin":["Liang3 Guang3"],"word":"两广"},{"definition":["Yangcheng, a nickname for 廣州|广州[Guang3 zhou1]"],"pinyin":["Yang2 cheng2"],"word":"羊城"},{"definition":["Central Plain, the middle and lower regions of the Yellow river, including Henan, western Shandong, southern Shanxi and Hebei"],"pinyin":["Zhong1 yuan2"],"word":"中原"},{"definition":["Lianzhou county level city in Qingyuan 清远, Guangdong"],"pinyin":["Lian2 zhou1"],"word":"连州"},{"definition":["Sichuan\/originally two provinces of Qin and Han"],"pinyin":["Ba1 shu3"],"word":"巴蜀"},{"definition":["Qingyuan prefecture level city in Guangdong"],"pinyin":["Qing1 yuan3"],"word":"清远"},{"definition":["Xijiang River"],"pinyin":["Xi1 jiang1"],"word":"西江"},{"definition":["Leizhou county level city in Zhanjiang 湛江[Zhan4 jiang1], Guangdong"],"pinyin":["Lei2 zhou1"],"word":"雷州"},{"definition":["Dongjiang River"],"pinyin":["Dong1 jiang1"],"word":"东江"},{"definition":["south of Changjiang or Yangtze river\/south of the lower reaches of Changjiang\/often refers to south Jiangsu, south Anhui and north Zhejiang provinces\/a province during Qing times\/in literature, refers to the sunny south\/Gangnam (district in Seoul, South Korea)"],"pinyin":["Jiang1 nan2"],"word":"江南"},{"definition":["Chaozhou prefecture-level city in Guangdong 廣東省|广东省[Guang3 dong1 sheng3]\/Chaochou town in Pingtung County 屏東縣|屏东县[Ping2 dong1 Xian4], Taiwan"],"pinyin":["Chao2 zhou1"],"word":"潮州"},{"definition":["Wuzhou prefecture level city in Guangxi"],"pinyin":["Wu2 zhou1"],"word":"梧州"},{"definition":["Nanchou township in Pingtung County 屏東縣|屏东县[Ping2 dong1 Xian4], Taiwan"],"pinyin":["Nan2 zhou1"],"word":"南州"},{"definition":["Guangxi Zhuang Autonomous Region 廣西壯族自治區|广西壮族自治区 in South Central China, on the border with Vietnam, abbr. 桂, capital Nanning 南寧|南宁\/until 1959, Guangxi province"],"pinyin":["Guang3 xi1"],"word":"广西"},{"definition":["Qiongzhou, historic name for Hainan Island 海南島|海南岛[Hai3 nan2 Dao3]"],"pinyin":["Qiong2 zhou1"],"word":"琼州"},{"definition":["Baiyue, generic term for southern ethnic groups\/also written 百越"],"pinyin":["Bai3 Yue4"],"word":"百粤"}]}