{"definition":["the mountain road twists around each new peak (idiom)\/(of a mountain road) twisting and turning\/fig. an opportunity has come unexpectedly\/things have taken a new turn"],"pinyin":["feng1 hui2 lu4 zhuan3"],"traditional":["峰回路轉"],"rank":30284.0,"normalized_rank":0.4237124508555679,"fraction":9.198050268570345e-7,"cumulative_fraction":0.9905061653385758,"word":"峰回路转","characters":[{"definition":["(of a mountain) high and tapered peak or summit\/mountain-like in appearance\/highest level\/classifier for camels","old variant of 峰[feng1]"],"pinyin":["feng1","feng1"],"word":"峰"},{"definition":["to curve\/to return\/to revolve","to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)","variant of 迴|回[hui2]"],"pinyin":["hui2","hui2","hui2"],"word":"回"},{"definition":["surname Lu","road\/CL:條|条[tiao2]\/journey\/route\/line (bus etc)\/sort\/kind"],"pinyin":["Lu4","lu4"],"word":"路"},{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan4","zhuan3"],"word":"转"}],"containing_words":[],"sentences":[{"english":"Will Ferguson revitalise Owen's career in much the same manner he did Eric Cantona's?","chinese":"爵爷能让欧文的职业生像坎通纳那样涯峰回路转吗？"},{"english":"In this way, they persevered , Strive to turn one day.","chinese":"就这样，他们坚持下来了，奋斗到了峰回路转的一天。"},{"english":"There are always twists and turns in life.","chinese":"生活中总是峰回路转。"},{"english":"However, in a twist to the transfer, Palladino has decided not to go to the Grifoni.","chinese":"然而现在峰回路转，帕拉迪诺决定拒绝加盟热那亚。"},{"english":"I suddenly really understand Song Wei's paintings.","chinese":"我对宋微画作的理解顿时峰回路转。"},{"english":"But now the tide may be turning in its favour.","chinese":"但是现在峰回路转了。"},{"english":"Different people love to play the game, end has is back.","chinese":"不同的人去玩爱情这场游戏，结局已经是峰回路转。"},{"english":"Sooner than it seems, life turns around.","chinese":"很快生活就会峰回路转。"},{"english":"These are just the sort of traits needed to turn a company around.","chinese":"诚然，这些都是使一个公司峰回路转的必要因素。"}],"related":[{"definition":["lit. the willow trees make the shade, the flowers give the light (idiom); at one's darkest hour, a glimmer of hope\/light at the end of the tunnel"],"pinyin":["liu3 an4 hua1 ming2"],"word":"柳暗花明"},{"definition":["to come back from death's door (idiom); unexpected rescue from danger\/fig. to recover from a seemingly impossible situation\/to find a way out of a predicament"],"pinyin":["jue2 chu3 feng2 sheng1"],"word":"绝处逢生"},{"definition":["calligraphic flourish with many twists\/fig. many twists and turns"],"pinyin":["yi1 bo1 san1 zhe2"],"word":"一波三折"},{"definition":["lit. to dispel the clouds and see the sun (idiom); fig. to restore justice"],"pinyin":["bo1 yun2 jian4 ri4"],"word":"拨云见日"},{"definition":["shift in the trend of events\/turnaround\/plot shift in a book\/turn in the conversation"],"pinyin":["zhuan3 zhe2"],"word":"转折"},{"definition":["one climax follows another (of thrilling story)"],"pinyin":["bo1 lan2 qi3 fu2"],"word":"波澜起伏"},{"definition":["to develop rapidly after abrupt turn (idiom); dramatic change"],"pinyin":["ji2 zhuan3 zhi2 xia4"],"word":"急转直下"},{"definition":["winding\/(fig.) complicated"],"pinyin":["qu1 zhe2"],"word":"曲折"},{"definition":["impossible to unravel\/confusing"],"pinyin":["pu1 shuo4 mi2 li2"],"word":"扑朔迷离"},{"definition":["turned out other than expected (idiom); unexpected"],"pinyin":["chu1 ren2 yi4 wai4"],"word":"出人意外"},{"definition":["suddenly opens up to a wide panorama (idiom); to come to a wide clearing\/fig. everything becomes clear at once\/to achieve speedy enlightenment"],"pinyin":["huo4 ran2 kai1 lang3"],"word":"豁然开朗"},{"definition":["dramatic"],"pinyin":["xi4 ju4 xing4"],"word":"戏剧性"},{"definition":["the road to happiness is strewn with setbacks (idiom)"],"pinyin":["hao3 shi4 duo1 mo2"],"word":"好事多磨"},{"definition":["twists and turns"],"pinyin":["bo1 zhe2"],"word":"波折"},{"definition":["each new high point replaced by another\/(of a movie etc) one climax after another"],"pinyin":["gao1 chao2 die2 qi3"],"word":"高潮迭起"},{"definition":["unexpected (idiom)\/surprising"],"pinyin":["chu1 ren2 yi4 liao4"],"word":"出人意料"}]}