{"definition":["to reveal outstanding talent (idiom); to stand out as conspicuously brilliant"],"pinyin":["zhan3 lu4 tou2 jiao3"],"traditional":["嶄露頭角"],"rank":19390.0,"normalized_rank":0.2712912568382466,"fraction":0.000002553440649068917,"cumulative_fraction":0.9733309107295084,"word":"崭露头角","characters":[{"definition":["high\/very","variant of 嶄|崭[chan2]","precipitous","variant of 嶄|崭[zhan3]"],"pinyin":["zhan3","chan2","chan2","zhan3"],"word":"崭"},{"definition":["to show\/to reveal\/to betray\/to expose","dew\/syrup\/nectar\/outdoors (not under cover)\/to show\/to reveal\/to betray\/to expose","surname Lu"],"pinyin":["lou4","lu4","Lu4"],"word":"露"},{"definition":["suffix for nouns","head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]"],"pinyin":["tou5","tou2"],"word":"头"},{"definition":["surname Jue","role (theater)\/to compete\/ancient three legged wine vessel\/third note of pentatonic scale","angle\/corner\/horn\/horn-shaped\/unit of money equal to 0.1 yuan, or 10 cents (a dime)\/CL:個|个[ge4]"],"pinyin":["Jue2","jue2","jiao3"],"word":"角"}],"containing_words":[],"sentences":[{"english":"As more time passes real world problems begin to surface.","chinese":"时间继续无声无息得流过，现实问题开始崭露头角。"},{"english":"Do you have any advice for up-and-coming programmers?","chinese":"您有什么忠告给崭露头角的程序员？"},{"english":"At the beginning of sixty time cut a striking figure painting, after study at the Xi'an Academy of Fine Arts.","chinese":"六十年代初在画坛崭露头角，后深造于西安美术学院。"},{"english":"GANI MARBLE TILES will take it as a important step to perform on the world stage.","chinese":"简一大理石瓷砖在世界舞台上崭露头角。"},{"english":"Buds, looking urgent, those on the conker trees already beginning to burst.","chinese":"树芽看上去很着急，七叶树上的芽儿已经崭露头角。"},{"english":"Young conductors earn their spurs in a small orchestra or opera house.","chinese":"年轻的指挥家们在小乐队或小歌剧院里崭露头角。"},{"english":"Thereinto, the grass-roots voluntary organizations have begun the fore.","chinese":"其中，草根志愿组织也已开始崭露头角。"},{"english":"Song Rong - hui is the early part of the last two years - and - coming female players.","chinese":"宋容慧初段是近两年崭露头角的女棋手。"},{"english":"This next big shift is on the horizon, but you can see it coming.","chinese":"新的变革还远在天边，但是你已经看到它崭露头角了。"},{"english":"Alison has made her mark in the theatre and is already playing leading parts.","chinese":"艾利森已在该剧院崭露头角，她已扮演主角。"},{"english":"He distinguished himself in British theatre at an early age.","chinese":"他很小就在英国戏剧界崭露头角了。"},{"english":"And Costner's machines finally got a look.","chinese":"科斯特纳的机器也终于得到了崭露头角的机会。"}],"related":[{"definition":["lit. to first show one's horns (idiom); fig. a first show of emerging talent\/first sign of emerging talent\/budding genius"],"pinyin":["chu1 lu4 tou2 jiao3"],"word":"初露头角"},{"definition":["first sign of budding talent\/to display one's ability for the first time"],"pinyin":["chu1 lu4 feng1 mang2"],"word":"初露锋芒"},{"definition":["to stand firmly\/to gain a foothold\/to establish oneself"],"pinyin":["zhan4 wen3 jiao3 gen1"],"word":"站稳脚跟"},{"definition":["to emerge as a new force to be reckoned with (idiom)"],"pinyin":["yi4 jun1 tu1 qi3"],"word":"异军突起"},{"definition":["to win instant success (idiom)\/to become an instant hit"],"pinyin":["yi1 pao4 er2 hong2"],"word":"一炮而红"},{"definition":["to shine (of talents, skills, accomplishment)\/to demonstrate extraordinary talent or skill"],"pinyin":["da4 fang4 yi4 cai3"],"word":"大放异彩"},{"definition":["to amaze the world with a single brilliant feat (idiom); an overnight celebrity"],"pinyin":["yi1 ming2 jing1 ren2"],"word":"一鸣惊人"},{"definition":["to rise to fame"],"pinyin":["sheng1 ming2 da4 zao4"],"word":"声名大噪"},{"definition":["to make one's name\/to become famous"],"pinyin":["cheng2 ming2"],"word":"成名"},{"definition":["an up-and-coming youngster\/new talent\/a brilliant younger generation"],"pinyin":["hou4 qi3 zhi1 xiu4"],"word":"后起之秀"},{"definition":["lit. like the sun at noon (idiom)\/fig. to be at the peak of one's power, career etc"],"pinyin":["ru2 ri4 zhong1 tian1"],"word":"如日中天"},{"definition":["to reveal one's talent (idiom)\/to rise above others\/to distinguish oneself"],"pinyin":["tuo1 ying3 er2 chu1"],"word":"脱颖而出"},{"definition":["to come first in triennial palace examinations (idiom, refers to the carved stone turtle head in front of the imperial palace, next to which the most successful candidate in the imperial examinations was entitled to stand)\/to be the champion\/to be the very best in any field"],"pinyin":["du2 zhan4 ao2 tou2"],"word":"独占鳌头"},{"definition":["to assume personal responsibility (idiom); to take charge of a section"],"pinyin":["du2 dang1 yi1 mian4"],"word":"独当一面"},{"definition":["to play a leading role\/to bear a heavy responsibility"],"pinyin":["tiao3 da4 liang2"],"word":"挑大梁"},{"definition":["to be popular\/to be in luck\/to have good luck\/to develop smoothly"],"pinyin":["zou3 hong2"],"word":"走红"}]}