{"definition":["lit. to strike water right and left (idiom)\/fig. to turn everything into gold\/to have everything going one's way\/to benefit from both sides"],"pinyin":["zuo3 you4 feng2 yuan2"],"traditional":["左右逢源"],"rank":35814.0,"normalized_rank":0.5010843255495082,"fraction":5.636196173139203e-7,"cumulative_fraction":0.9945243453495992,"word":"左右逢源","characters":[{"definition":["surname Zuo","left\/the Left (politics)\/east\/unorthodox\/queer\/wrong\/differing\/opposite\/variant of 佐[zuo3]"],"pinyin":["Zuo3","zuo3"],"word":"左"},{"definition":["right (-hand)\/the Right (politics)\/west (old)"],"pinyin":["you4"],"word":"右"},{"definition":["to meet by chance\/to come across\/(of a calendar event) to come along\/(of an event) to fall on (a particular day)\/to fawn upon"],"pinyin":["feng2"],"word":"逢"},{"definition":["root\/source\/origin"],"pinyin":["yuan2"],"word":"源"}],"containing_words":[],"sentences":[{"english":"But what makes good TV doesn't necessarily make for good teaching.","chinese":"然而做纪录片得心应手不代表必然能教课左右逢源。"},{"english":"The way kids learn to be resourceful is by having to use their resources.","chinese":"让孩子学会左右逢源的方法是让他们使用自己的资源。"},{"english":"Your communication skills will help you in rounding this person up -- and you refuse to let this one get away!","chinese":"交流技巧让你左右逢源，更不会轻易放走这个人。"},{"english":"Don't try to be all things to all people.","chinese":"不要想对所有人都左右逢源。"},{"english":"The Li bald astute extroversion, according to the circumstance, can achieve success one way or another in front of the reality.","chinese":"李光头精明外向，随机应变，在现实面前左右逢源。"}],"related":[{"definition":["be smooth and slick (in establishing social relations)"],"pinyin":["ba1 mian4 ling2 long2"],"word":"八面玲珑"},{"definition":["long sleeves help one dance beautifully (idiom); money and power will help you in any occupation"],"pinyin":["chang2 xiu4 shan4 wu3"],"word":"长袖善舞"},{"definition":["like a fish back in water (idiom); glad to be back in one's proper surroundings"],"pinyin":["ru2 yu2 de2 shui3"],"word":"如鱼得水"},{"definition":["lit. see the wind and set the helm (idiom); fig. to act pragmatically\/to be flexible and take advantage of the situation"],"pinyin":["jian4 feng1 shi3 duo4"],"word":"见风使舵"},{"definition":["to be popular\/to be getting on well\/much in demand"],"pinyin":["chi1 de5 kai1"],"word":"吃得开"},{"definition":["free to come and go (idiom)\/to have room to maneuver"],"pinyin":["jin4 tui4 zi4 ru2"],"word":"进退自如"},{"definition":["to rapidly go up in the world\/meteoric rise (of a career, social position etc)"],"pinyin":["ping2 bu4 qing1 yun2"],"word":"平步青云"},{"definition":["two-faced, three knives (idiom); double-cross\/double dealing and back stabbing"],"pinyin":["liang3 mian4 san1 dao1"],"word":"两面三刀"},{"definition":["toadying for personal gain\/to curry favor\/to study in great depth"],"pinyin":["zuan1 ying2"],"word":"钻营"},{"definition":["rising straight up in a clear sky (idiom); rapid promotion to a high post\/meteoric career"],"pinyin":["qing1 yun2 zhi2 shang4"],"word":"青云直上"},{"definition":["(fig.) adaptable\/able to deal with various kinds of people and situations\/(derog.) insincere\/two-faced"],"pinyin":["jian4 ren2 shuo1 ren2 hua4 , jian4 gui3 shuo1 gui3 hua4"],"word":"见人说人话，见鬼说鬼话"},{"definition":["to smooth whiskers and pat a horse's bottom (idiom); to use flatter to get what one wants\/to toady\/boot-licking"],"pinyin":["liu1 xu1 pai1 ma3"],"word":"溜须拍马"},{"definition":["a wise man looks after his own hide (idiom)\/to put one's own safety before matters of principle"],"pinyin":["ming2 zhe2 bao3 shen1"],"word":"明哲保身"},{"definition":["lit. the divine steed Feihuang gallops (idiom)\/fig. to achieve meteoric success in one's career"],"pinyin":["Fei1 huang2 teng2 da2"],"word":"飞黄腾达"},{"definition":["(of a political career) everything is going smoothly (idiom)"],"pinyin":["guan1 yun4 heng1 tong1"],"word":"官运亨通"},{"definition":["to win power\/to get authority\/to become dominant"],"pinyin":["de2 shi4"],"word":"得势"}]}