{"definition":["to consolidate\/consolidation\/to strengthen"],"pinyin":["gong3 gu4"],"traditional":["鞏固"],"rank":4561.0,"normalized_rank":0.06381430750073454,"fraction":0.000027452844462908692,"cumulative_fraction":0.8476687845154796,"word":"巩固","characters":[{"definition":["secure\/solid"],"pinyin":["gong3"],"word":"巩"},{"definition":["hard\/strong\/solid\/sure\/assuredly\/undoubtedly\/of course\/indeed\/admittedly"],"pinyin":["gu4"],"word":"固"}],"containing_words":[],"sentences":[{"english":"Finally, I give back to help others, which cements the knowledge in.","chinese":"最后，我返回来帮助其他人，进一步巩固我的知识。"},{"english":"Third, after-school careful review, the consolidation of the knowledge the teacher said on the day.","chinese":"第三，课后认真复习，巩固当天老师讲过地知识。"},{"english":"There are also signs that Chinese policymakers are focusing more on shoring up rural infrastructure.","chinese":"还有迹象表明中国的决策者更注重巩固农乡基本产业。"},{"english":"Conclusion Consolidate of anisometropia amblyopia have been cured is found to arrest palindromia.","chinese":"结论屈光参差性弱视治愈后的巩固是预防复发的根本。"},{"english":"It also helped fortify our market position online.","chinese":"这也有助于巩固我们的在线市场地位。"},{"english":"To prepare for the coming storm, the first task of the newly-formed alliance was to fortify their defenses.","chinese":"为应对灾难降临，新联盟的首要任务就是巩固防御。"},{"english":"Reinforcing a special American-Indian relationship should be a strategic priority of the next U.S. president.","chinese":"巩固特殊的美印关系应该是美国下任总统的战略重点。"},{"english":"The consolidation and development of village political power at the grass-roots level is directly connected with the countryside safely.","chinese":"农村基层政权的巩固与发展直接关系到国家的安危。"},{"english":"All Party comrades must strive to consolidate and develop this united front.","chinese":"全党同志必须为这个统一战线的巩固和发展而奋斗。"},{"english":"Acquiring Atheros will help Qualcomm cement relationships with new customers.","chinese":"收购创锐讯将有助于高通巩固与新客户的关系。"},{"english":"She will attend the Kabul conference aimed at shoring up the Afghan government of President Hamid Karzai.","chinese":"她将参加旨在巩固阿富汗卡尔扎伊政府的喀布尔会议。"},{"english":"These results have further strengthened China’s bilateral economic ties with the two countries respectively.","chinese":"这些成果进一步巩固了我同两国的经济纽带。"},{"english":"A miner's lamp is fixed onto his helmet.","chinese":"矿灯巩固在矿工的头盔上。"},{"english":"Crime in full glory consolidates authority by the sacred fear it inspires.","chinese":"道貌岸然的罪行通过激发神圣的恐惧来巩固权威。"},{"english":"On the other hand, we have sanctions which are strengthening the illegitimate government.","chinese":"另一方面，制裁却巩固了这个非法政府的权力。"},{"english":"Fourth, the international community should undertake joint responsibilities and consolidate the momentum of world economic recovery.","chinese":"第四，国际社会要共担责任，巩固世界经济复苏势头。"}],"related":[{"definition":["stable\/steady\/firm\/to stabilize"],"pinyin":["wen3 gu4"],"word":"稳固"},{"definition":["to reinforce\/to strengthen\/to increase"],"pinyin":["jia1 qiang2"],"word":"加强"},{"definition":["to tamp\/to ram (earth etc)"],"pinyin":["hang1 shi2"],"word":"夯实"},{"definition":["to strengthen\/to intensify"],"pinyin":["qiang2 hua4"],"word":"强化"},{"definition":["to establish\/to institute"],"pinyin":["que4 li4"],"word":"确立"},{"definition":["to expand"],"pinyin":["tuo4 zhan3"],"word":"拓展"},{"definition":["to lay (a foundation)\/to conquer (a city etc)\/to shoot down (a bird etc)"],"pinyin":["da3 xia4"],"word":"打下"},{"definition":["to deepen\/to intensify"],"pinyin":["shen1 hua4"],"word":"深化"},{"definition":["to increase\/to strengthen"],"pinyin":["zeng1 qiang2"],"word":"增强"},{"definition":["to establish\/to fix\/to settle"],"pinyin":["dian4 ding4"],"word":"奠定"},{"definition":["base\/foundation\/basis\/underlying\/CL:個|个[ge4]"],"pinyin":["ji1 chu3"],"word":"基础"},{"definition":["to deepen"],"pinyin":["jia1 shen1"],"word":"加深"},{"definition":["to break new ground (for agriculture)\/to open up (a new seam)\/to develop (border regions)\/fig. to open up (new horizons)"],"pinyin":["kai1 tuo4"],"word":"开拓"},{"definition":["to expand"],"pinyin":["kuo4 chong1"],"word":"扩充"},{"definition":["steady\/stable\/stability\/to stabilize\/to pacify"],"pinyin":["wen3 ding4"],"word":"稳定"},{"definition":["to promote\/to enhance\/to further\/to advance (a cause etc)"],"pinyin":["zeng1 jin4"],"word":"增进"}]}