{"definition":["already"],"pinyin":["yi3 jing1"],"traditional":["已經"],"rank":65.0,"normalized_rank":0.000909434331845592,"fraction":0.0014590586426056686,"cumulative_fraction":0.2734199727161013,"word":"已经","characters":[{"definition":["already\/to stop\/then\/afterwards"],"pinyin":["yi3"],"word":"已"},{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["jing1","Jing1"],"word":"经"}],"containing_words":[],"sentences":[{"english":"Two cases of cholera, one of which has ended fatally, have occurred here.","chinese":"这里发生过两起霍乱病例，其中一人已经死亡。"},{"english":"“We have done this every June for nineteen years, ” he said.","chinese":"每年逢六月，我们这样做，现已经有十九年了。"},{"english":"The local store has started selling baguettes and Belgian beers.","chinese":"当地的商店已经开始出售法国棍式面包和比利时啤酒。"},{"english":"Mass armies (in most societies) have been replaced by highly trained professional-technical military forces.","chinese":"数量庞大的军队已经被高技术军队取代。"},{"english":"The book was out of print, but I eventually ran it to earth at a secondhand bookshop.","chinese":"那本书已经绝版，但我终于在一家旧书店淘到了它。"},{"english":"B. The college I applied to has accepted me.","chinese":"我报了名的学院已经录取了我。"},{"english":"This is a function declaring the hot summer has been coming.","chinese":"这是一个宣告火辣的夏天已经来临的仪式。"},{"english":"Has passed 3C certification.","chinese":"目前已经通过3C认证。"},{"english":"IP has become an important subject in fields of diplomacy and foreign trade.","chinese":"知识产权已经成为外交外贸领域的重要议题。"},{"english":"The one hundred and first meridian was passed.","chinese":"现在已经越过了经线一百零一度了。"},{"english":"The mobile phone has already enabled developing countries to skip fixed-line networks.","chinese":"移动电话已经使发展中国家跨越了固话网络这个阶段。"},{"english":"I have the answer when I am in Eurasia.","chinese":"当我身临欧亚时，我已经知道了。"},{"english":"It was time to write down and acknowledge that he was gone.","chinese":"这是记下和承认它已经离去这一事实的时候。"},{"english":"Doudou has been home half a month, how I miss him.","chinese":"豆豆回家已经半个月了，我好想他啊。"},{"english":"They've already implanted electrodes into blind patients on a temporary basis, allowing them to see flashes of light.","chinese":"他们已经为盲者植入暂时的义眼，让他们能看到闪光。"},{"english":"The thief had run more than forty miles.","chinese":"那个小偷已经跑了四十多里路。"}],"related":[{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"},{"definition":["already\/to stop\/then\/afterwards"],"pinyin":["yi3"],"word":"已"},{"definition":["long ago\/for a long time"],"pinyin":["zao3 yi3"],"word":"早已"},{"definition":["now\/at present\/at the moment\/modern\/current\/nowadays"],"pinyin":["xian4 zai4"],"word":"现在"},{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["already at an earlier time"],"pinyin":["zao3 jiu4"],"word":"早就"},{"definition":["nowadays\/now"],"pinyin":["ru2 jin1"],"word":"如今"},{"definition":["to be already so\/already"],"pinyin":["yi3 ran2"],"word":"已然"},{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["although\/even though\/even if"],"pinyin":["sui1 ran2"],"word":"虽然"},{"definition":["despite\/although\/even though\/in spite of\/unhesitatingly\/do not hesitate (to ask, complain etc)\/(go ahead and do it) without hesitating"],"pinyin":["jin3 guan3"],"word":"尽管"},{"definition":["however\/yet\/but"],"pinyin":["ran2 er2"],"word":"然而"},{"definition":["but\/however"],"pinyin":["dan4 shi4"],"word":"但是"},{"definition":["before\/prior to\/ago\/previously\/beforehand"],"pinyin":["zhi1 qian2"],"word":"之前"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不过"}]}