{"definition":["thinking and pondering (idiom); to turn sth over in one's mind\/to consider repeatedly"],"pinyin":["ba1 qian2 suan4 hou4"],"traditional":["巴前算後"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"巴前算后","characters":[{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"},{"definition":["front\/forward\/ahead\/first\/top (followed by a number)\/future\/ago\/before\/BC (e.g. 前293年)\/former\/formerly"],"pinyin":["qian2"],"word":"前"},{"definition":["to regard as\/to figure\/to calculate\/to compute"],"pinyin":["suan4"],"word":"算"},{"definition":["empress\/queen\/(archaic) monarch\/ruler","back\/behind\/rear\/afterwards\/after\/later\/post-","surname Hou"],"pinyin":["hou4","hou4","Hou4"],"word":"后"}],"containing_words":[],"sentences":[],"related":[{"definition":["female chicken crows at daybreak (idiom); a woman usurps authority\/women meddle in politics\/The female wears the trousers."],"pinyin":["pin4 ji1 mu3 ming2"],"word":"牝鸡牡鸣"},{"definition":["to trip forwards or stumble back (idiom, from Book of Songs); can't get anything right"],"pinyin":["ba2 qian2 zhi4 hou4"],"word":"跋前踬后"},{"definition":["has eyes but can't see (idiom); unable or unwilling to see the importance of sth\/blind (to sth great)"],"pinyin":["you3 mu4 wu2 du3"],"word":"有目无睹"},{"definition":["person narrow-minded and shortsighted"],"pinyin":["dou3 shao1 zhi1 qi4"],"word":"斗筲之器"},{"definition":["lit. the old man lost his horse, but it all turned out for the best (idiom)\/fig. a blessing in disguise\/it's an ill wind that blows nobody any good"],"pinyin":["bei3 sou3 shi1 ma3"],"word":"北叟失马"},{"definition":["clay ox, wooden horse (idiom); shape without substance\/worthless object"],"pinyin":["tu3 niu2 mu4 ma3"],"word":"土牛木马"},{"definition":["to ride to take up an official appointment (idiom); to take on a job with alacrity\/to undertake a task"],"pinyin":["zou3 ma3 fu4 ren4"],"word":"走马赴任"},{"definition":["lit. to wear one's coat inside out and carry firewood on one's back (idiom)\/fig. to live a life of poverty and hard work\/fig. to act stupidly"],"pinyin":["fan3 qiu2 fu4 chu2"],"word":"反裘负刍"},{"definition":["to jump into a well to rescue sb else (idiom); fig. to help others at the risk to oneself"],"pinyin":["cong2 jing3 jiu4 ren2"],"word":"从井救人"},{"definition":["war on all sides (idiom); fighting from all four quarters"],"pinyin":["dong1 zheng1 xi1 yuan4"],"word":"东征西怨"},{"definition":["see 一之為甚|一之为甚[yi1 zhi1 wei2 shen4]"],"pinyin":["yi1 zhi1 wei4 shen4"],"word":"一之谓甚"},{"definition":["(of literature, music) deeply moving (idiom)"],"pinyin":["yi1 chang4 san1 tan4"],"word":"一倡三叹"},{"definition":["Words of benevolence apply universally (idiom). Humanitarian expressions benefit all."],"pinyin":["ren2 yan2 li4 bo2"],"word":"仁言利博"},{"definition":["to call sth a cow or a horse (idiom); it doesn't matter what you call it\/Insult me if you want, I don't care what you call me."],"pinyin":["hu1 niu2 hu1 ma3"],"word":"呼牛呼马"},{"definition":["Sima Xiangru is meticulous and Mei Gao is fast (idiom)\/to each his good points"],"pinyin":["Ma3 gong1 Mei2 su4"],"word":"马工枚速"},{"definition":["cow and famous steed at the same trough (idiom); fig. the common and the great are treated alike"],"pinyin":["niu2 ji4 tong2 zao4"],"word":"牛骥同皂"}]}