{"definition":["to fawn on\/to curry favor with\/to make up to"],"pinyin":["ba1 jie5"],"traditional":["巴結"],"rank":37452.0,"normalized_rank":0.5240020707120171,"fraction":4.866894079576819e-7,"cumulative_fraction":0.9953821090091752,"word":"巴结","characters":[{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"},{"definition":["knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)","(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]"],"pinyin":["jie2","jie1"],"word":"结"}],"containing_words":[{"definition":["lymphatic node\/lymph gland"],"pinyin":["lin2 ba1 jie2"],"word":"淋巴结"},{"definition":["to manage with difficulty\/only just getting by\/in a difficult position"],"pinyin":["ba1 ba1 jie1 jie1"],"word":"巴巴结结"},{"definition":["to flatter someone in a hundred different ways\/assiduous fawning (idiom)"],"pinyin":["bai3 ban1 ba1 jie2"],"word":"百般巴结"}],"sentences":[{"english":"We didn't like him, as he always fawned on the rich.","chinese":"我们不喜欢他，因为他老是巴结有钱人。"},{"english":"Nodal NK-cell lymphoma are quite rare.","chinese":"在淋巴结中，NK细胞淋巴瘤很少。"},{"english":"Objective:To explore CT features and diagnostic value of castleman disease.","chinese":"目的探讨巨淋巴结增生症的CT表现及诊断价值。"},{"english":"Many distant relatives fawned on the rich old man.","chinese":"远亲都来巴结这位有钱的老人。"},{"english":"He tried to wriggle round the man with money,but he failed.","chinese":"他试着用钱巴结那个人，可是失败了。"},{"english":"He fawns on his rich uncle.","chinese":"他巴结富有的叔叔。"},{"english":"We didn't like him, as he fawned on anyone in an influential position.","chinese":"我不喜欢他，因为他爱巴结有权势的人。"},{"english":"Many flattering relatives fawned on the rich old man.","chinese":"许多好谄媚的亲戚支巴结那个富有的老人。"},{"english":"Objective To identify intraoperatively the feasibility of lymphatic mapping with methylene.","chinese":"目的研究亚甲蓝术中定位胃癌前哨淋巴结的可行性。"},{"english":"Objective To investigate an effective method for detecting lymphatic micrometastasis in gastric carcinoma.","chinese":"目的探讨检测胃癌淋巴结微转移的有效方法。"},{"english":"Large lymph node swellings must be drained.","chinese":"淋巴结肿大很可能消除。"},{"english":"Indirect sign including carotid lymphnode enlargement was found.","chinese":"同时可发现颈淋巴结肿大征象。"},{"english":"They could also have enlarged lymph nodes, lethargy and vertigo.","chinese":"他们还可能有淋巴结肿大，嗜睡和眩晕等症状。"},{"english":"Objective To investigate the D-limonene on the clinical impact of lymph node breast cancer and research.","chinese":"目的探讨右旋柠烯对乳腺癌淋巴结转移的影响。"},{"english":"Did cheeper get mesentery lymph node how cure?","chinese":"幼儿得了肠系膜淋巴结怎么医治呢？"},{"english":"Unilateral inguinal lymphadenopathy is usually a response to infection of an ipsilateral lower extremity.","chinese":"单侧腹股沟区淋巴结肿大常是单侧下肢感染的反应。"}],"related":[{"definition":["to fawn on\/to flatter\/to ingratiate oneself\/flattery"],"pinyin":["feng4 cheng5"],"word":"奉承"},{"definition":["to get the desired outcome\/to win favor by fawning on sb\/to curry favor with\/a fruitful outcome to reward one's labor"],"pinyin":["tao3 hao3"],"word":"讨好"},{"definition":["to flatter\/to fawn on\/to butter sb up\/toadying\/bootlicking"],"pinyin":["pai1 ma3 pi4"],"word":"拍马屁"},{"definition":["to smooth whiskers and pat a horse's bottom (idiom); to use flatter to get what one wants\/to toady\/boot-licking"],"pinyin":["liu1 xu1 pai1 ma3"],"word":"溜须拍马"},{"definition":["to ingratiate oneself with\/to pander to"],"pinyin":["xian4 mei4"],"word":"献媚"},{"definition":["to seek contact with sb for one's own benefit\/to suck up to sb"],"pinyin":["la1 guan1 xi4"],"word":"拉关系"},{"definition":["to fawn on\/to ingratiate oneself\/(literary) to meet face to face"],"pinyin":["feng2 ying2"],"word":"逢迎"},{"definition":["to worm one's way into being friends with sb (usually derogatory)"],"pinyin":["tao4 jin4 hu1"],"word":"套近乎"},{"definition":["flattering and fawning (idiom)\/sweet-talking"],"pinyin":["e1 yu2 feng4 cheng2"],"word":"阿谀奉承"},{"definition":["toadying for personal gain\/to curry favor\/to study in great depth"],"pinyin":["zuan1 ying2"],"word":"钻营"},{"definition":["to throw one's weight around\/to put on airs"],"pinyin":["na2 jia4 zi5"],"word":"拿架子"},{"definition":["to be particularly attentive to (an attractive young lady or man etc)\/to fawn upon (an influential politician etc)\/to court sb's favor\/to ingratiate oneself"],"pinyin":["xian4 yin1 qin2"],"word":"献殷勤"},{"definition":["see 扳龍附鳳|扳龙附凤[ban1 long2 fu4 feng4]"],"pinyin":["pan1 long2 fu4 feng4"],"word":"攀龙附凤"},{"definition":["to put on airs\/to assume great airs"],"pinyin":["bai3 jia4 zi5"],"word":"摆架子"},{"definition":["to fawn on\/to kiss up to"],"pinyin":["qu1 feng4"],"word":"趋奉"},{"definition":["to put on airs\/to be ostentatious"],"pinyin":["bai3 pu3"],"word":"摆谱"}]}