{"definition":["to put in order\/to arrange\/to decorate\/to fix up\/to deploy"],"pinyin":["bu4 zhi4"],"traditional":["佈置"],"rank":5246.0,"normalized_rank":0.07339834622864579,"fraction":0.000022328737804801145,"cumulative_fraction":0.8646585742576597,"word":"布置","characters":[{"definition":["cloth\/to declare\/to announce\/to spread\/to make known","variant of 布[bu4]\/to announce\/to spread"],"pinyin":["bu4","bu4"],"word":"布"},{"definition":["to install\/to place\/to put\/to buy"],"pinyin":["zhi4"],"word":"置"}],"containing_words":[],"sentences":[{"english":"One day Mrs. Slaton gave the class an assignment.","chinese":"有一天，斯莱顿夫人给全班同学布置了一项作业。"},{"english":"Anchor rope distribution is the key point in prestressed floodgate room design.","chinese":"锚索布置是预应力闸室设计的关键所在。"},{"english":"Even so, some teachers still gave us homework.","chinese":"即便如此，有些老师还是布置了寒假作业。"},{"english":"Many arrange to fight in a sitting posture.","chinese":"许多人布置好可以坐着战斗的位置。"},{"english":"Vertical or horizontal layout, full load-bearing steel frame design.","chinese":"立式或卧式布置，全承重钢架设计。"},{"english":"He's just been setting up a bachelor party, he says.","chinese":"他说他刚才在布置一个单身汉派对的会场。"},{"english":"Stone said his work skyshatter organization would have decorated.","chinese":"石破天说他的工作组织上早就布置好了。"},{"english":"During this period you should arrange your home to reflect your grief and sorrow.","chinese":"这段期间内，家里的布置要有哀泣的气氛。"},{"english":"They’ll make the invitations, hang the decorations, and even serve the food.","chinese":"他们将会发邀请函，布置装饰品，和甚至提供食物。"},{"english":"My teacher arranged me homework and asked me to make a bargain with a stranger who looks like a black sheep.","chinese":"老师给我布置了一个作业，让我和看起来像败家子。"},{"english":"Urban planning from two-dimensional arrangement to three-dimensional planning began long time ago.","chinese":"城市规划由平面的布置转向三维的规划，历史源远。"},{"english":"The inside of each house depended on the personality of its owner.","chinese":"每个房间内怎样的布置，这要看各个使用者的性格了。"},{"english":"Clay warehouse near 11 o clock at night, Sun Weijun decorate plan.","chinese":"夜里11点红土仓库附近，孙维君布置作战计划。"},{"english":"But I don't feel confident enough delegating that much work on a film set.","chinese":"我不觉得我有足够的信心在电影拍摄场去布置工作。"},{"english":"I'm going to end with the final reading response.","chinese":"本节课最后布置一个课后作业。"},{"english":"\"Do insides in the house all set out?\"Chen Shi lightly continues to ask a access.","chinese":"“屋子里都布置好了么？”沈氏淡淡的继续问道。"}],"related":[{"definition":["to set up\/to install"],"pinyin":["she4 zhi4"],"word":"设置"},{"definition":["to arrange\/to plan\/to set up\/arrangements\/plans"],"pinyin":["an1 pai2"],"word":"安排"},{"definition":["to set up\/to arrange\/to lay out"],"pinyin":["bai3 fang4"],"word":"摆放"},{"definition":["to set aside\/to reserve"],"pinyin":["yu4 liu2"],"word":"预留"},{"definition":["to lay (railroad tracks, carpet, pipeline)\/to install (wiring, cable)\/to construct (road, concrete slab)"],"pinyin":["pu1 she4"],"word":"铺设"},{"definition":["to plan (how to do sth)\/planning\/plan\/program"],"pinyin":["gui1 hua4"],"word":"规划"},{"definition":["surrounding"],"pinyin":["wai4 wei2"],"word":"外围"},{"definition":["to do a drill\/to practice\/training\/drill"],"pinyin":["yan3 lian4"],"word":"演练"},{"definition":["ring-shaped"],"pinyin":["huan2 xing2"],"word":"环形"},{"definition":["to transform\/to reform\/to remodel\/to remold"],"pinyin":["gai3 zao4"],"word":"改造"},{"definition":["facilities\/installation"],"pinyin":["she4 shi1"],"word":"设施"},{"definition":["to lay out a defense"],"pinyin":["bu4 fang2"],"word":"布防"},{"definition":["in advance\/before the event\/beforehand\/prior"],"pinyin":["shi4 xian1"],"word":"事先"},{"definition":["space\/room\/(fig.) scope\/leeway\/(astronomy) outer space\/(physics, math.) space"],"pinyin":["kong1 jian1"],"word":"空间"},{"definition":["to construct\/to erect"],"pinyin":["jia4 she4"],"word":"架设"},{"definition":["school assignment\/homework\/work\/task\/operation\/CL:個|个[ge4]\/to operate"],"pinyin":["zuo4 ye4"],"word":"作业"}]}