{"definition":["to spur\/to provide impetus\/to drive"],"pinyin":["dai4 dong4"],"traditional":["帶動"],"rank":2242.0,"normalized_rank":0.03136848879996642,"fraction":0.00006671119156539555,"cumulative_fraction":0.7478018117809654,"word":"带动","characters":[{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"带"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"动"}],"containing_words":[],"sentences":[{"english":"He is a greto football player, from all accounts.","chinese":"外传他是个很不了起的足球运带动。"},{"english":"We experimented with diesel engines to drive the pumps.","chinese":"我们试着用柴油机来带动水泵。"},{"english":"Join type to adopt bent elbow expand force organization, it is smoothly reliable to work;","chinese":"合型采用曲肘扩力机构，液压马达带动齿轮调模装置。"},{"english":"The propeller turns a small d. c. generator .","chinese":"螺旋桨带动一个小型直流发电机。"},{"english":"It has been implicated in the Reformation, the Renaissance and the Scientific Revolution.","chinese":"文艺复新时期和科学时期带动了印刷业的改革。"},{"english":"The development of network teaching is necessarily to drive the innovation in hist …","chinese":"网络教学的发展与普及必将带动高中历史教学的改革。"},{"english":"Liu Xiang is the most hardworking sportsman that I have ever seen.","chinese":"刘翔是我所见过的最勤奋的运带动。"},{"english":"And his clear moving tips protected me effectively from making mistakes.","chinese":"而他明显的带动暗示，也真的有效避免了我踏错舞步。"},{"english":"Simultaneously the citizen's recreational action has spurred the out comers'participation.","chinese":"市民的环城游憩活动同时又带动了外来旅游者的参与。"},{"english":"Chonggao crude oil fell yesterday, the US-led rebound stabilized.","chinese":"昨日原油冲高回落，带动美豆止跌反弹。"},{"english":"An extension of the spindle shaft drives a counter for totalizing discharge.","chinese":"心轴的延长部分带动一个累计流量的计量器。"},{"english":"This is expected to drive large private and foreign follow-up.","chinese":"这可望带动大量民资和外资的跟进。"},{"english":"Is us, control the locomotive , drive the car case?","chinese":"是我们，驾驭了车头，带动着车箱？"},{"english":"The development of this country helps other satellite countries to develop.","chinese":"这个国家的发展带动了周围许多卫星国的发展。"},{"english":"New explorations should be made for the key fields of results-based projects drive strategy.","chinese":"在项目带动的重点领域上实现新开拓。"},{"english":"China's sustained and rapid economic development, led to the development of freight forwarding and logistics.","chinese":"中国经济持续高速发展，带动了货代和物流的发展。"}],"related":[{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推动"},{"definition":["(aerospace) to boost\/booster (rocket)\/(behavioral economics) to nudge"],"pinyin":["zhu4 tui1"],"word":"助推"},{"definition":["to bolster\/to give a boost to (the economy etc)"],"pinyin":["tui1 zhu4"],"word":"推助"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引领"},{"definition":["to motivate"],"pinyin":["cu4 dong4"],"word":"促动"},{"definition":["a helping hand\/help\/assistance"],"pinyin":["zhu4 li4"],"word":"助力"},{"definition":["to drive\/to propel\/drive (vehicle wheel)\/drive mechanism (tape or disk)\/device driver (computing software)"],"pinyin":["qu1 dong4"],"word":"驱动"},{"definition":["effect (scientific phenomenon)"],"pinyin":["xiao4 ying4"],"word":"效应"},{"definition":["to boost\/to stimulate"],"pinyin":["ti2 zhen4"],"word":"提振"},{"definition":["to prop up\/to support\/strut\/brace"],"pinyin":["zhi1 cheng1"],"word":"支撑"},{"definition":["to rise again after a fall\/to pick up\/rally (stock market etc)"],"pinyin":["hui2 sheng1"],"word":"回升"},{"definition":["strong\/powerful\/robust"],"pinyin":["qiang2 jing4"],"word":"强劲"},{"definition":["a big margin\/substantially"],"pinyin":["da4 fu2"],"word":"大幅"},{"definition":["to rise abruptly (to a towering position)\/to tower over\/to spring up\/to emerge suddenly\/the emergence (e.g. of a power)"],"pinyin":["jue2 qi3"],"word":"崛起"},{"definition":["to arouse\/to excite"],"pinyin":["ji1 fa1"],"word":"激发"},{"definition":["(of the weather) to warm up again"],"pinyin":["hui2 nuan3"],"word":"回暖"}]}