{"definition":["to take the lead\/to be the first\/to set an example"],"pinyin":["dai4 tou2"],"traditional":["帶頭"],"rank":7891.0,"normalized_rank":0.11040532788605488,"fraction":0.000012256427528954688,"cumulative_fraction":0.908480394227317,"word":"带头","characters":[{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"带"},{"definition":["suffix for nouns","head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]"],"pinyin":["tou5","tou2"],"word":"头"}],"containing_words":[],"sentences":[{"english":"I hope Your Most Reverend will take the lead and we shall do our best to follow in this work.","chinese":"希望大主教能带头领导，我们将尽心尽力追随。"},{"english":"In a sense a leader is the pacesetter in doing things.","chinese":"在某种意义上，领导应是事业的带头人。"},{"english":"The construction of socialism new countryside must have the good leaders.","chinese":"建设社会主义新农村，要有好的带头人。"},{"english":"The group also spearheads various social programs in China.","chinese":"该组织还带头参与中国的各种社会活动。"},{"english":"C-sf22 lead single node chain and the addition of data can be deleted.","chinese":"sf22带头结点的单链表，可以删除添加数据。"},{"english":"Venice pioneered a commerical revolution in the 14th Century in Europe.","chinese":"在14世纪，威尼斯在欧洲带头发起了一场商业革命。"},{"english":"The UK must take a lead in cleaning up emissions, \" said Simon Birkett, spokesman for the Campaign for Clean Air in London.","chinese":"英国必须带头清理排放。"},{"english":"Louis Riel, the leader of the Métis was hanged for treason in 1885 for his leading role in resisting the federal government.","chinese":"瑞尔，因带头试图反抗联邦政府以叛国的罪名被绞死。"},{"english":"And yes, marketers will lead the way, and probably get a lot of it wrong.","chinese":"没错，营销者将是带头者，并且很可能走很多弯路。"},{"english":"The leader apologized and claimed he was confused by the dates.","chinese":"那位带头人表示道歉并声称他弄混了日期。"},{"english":"The terms ‘project leader’ and ‘project manager’ are often used interchangeably.","chinese":"项目带头人和项目经理这两个名词常常可以互换。"},{"english":"The European Union must assert a common position and take the lead on this.","chinese":"欧盟必须主张共一个立场，并发挥带头作用。"},{"english":"Be a leader when you see a path others have missed.","chinese":"在别人错过的路上你要带头向前走。"},{"english":"Microsoft needs to muscle into this area and take the lead.","chinese":"微软需要进入该领域并且称为该领域的带头人。"},{"english":"State-owned enterprises, especially the central government - owned enterprises should take the initiative in the implementation thereof.","chinese":"国有企业特别是中央企业要带头落实。"},{"english":"They must also take the lead in working hard and living simply.","chinese":"艰苦奋斗，也要高级干部带头。"}],"related":[{"definition":["to take the lead\/to be first to start"],"pinyin":["ling3 tou2"],"word":"领头"},{"definition":["to call\/to appeal"],"pinyin":["hao4 zhao4"],"word":"号召"},{"definition":["to take the lead"],"pinyin":["yi1 ma3 dang1 xian1"],"word":"一马当先"},{"definition":["head\/be headed by"],"pinyin":["wei2 shou3"],"word":"为首"},{"definition":["to endorse\/to support"],"pinyin":["yong1 hu4"],"word":"拥护"},{"definition":["to open up a path\/to make one's way through\/to construct a road\/(electricity) open circuit"],"pinyin":["kai1 lu4"],"word":"开路"},{"definition":["example\/model"],"pinyin":["biao3 shuai4"],"word":"表率"},{"definition":["(the) very first"],"pinyin":["zui4 xian1"],"word":"最先"},{"definition":["all\/entire"],"pinyin":["quan2 ti3"],"word":"全体"},{"definition":["to convene\/to gather"],"pinyin":["zhao4 ji2"],"word":"召集"},{"definition":["(military) to leave one's place in the ranks\/to fall out\/(fig.) to emerge\/to become prominent"],"pinyin":["chu1 lie4"],"word":"出列"},{"definition":["to heckle\/rowdy jeering\/to create a disturbance"],"pinyin":["qi3 hong4"],"word":"起哄"},{"definition":["large strides"],"pinyin":["da4 bu4"],"word":"大步"},{"definition":["roll call\/to mention sb by name\/(to call or praise or criticize sb) by name"],"pinyin":["dian3 ming2"],"word":"点名"},{"definition":["in big strides\/(fig.) in giant steps"],"pinyin":["da4 ta4 bu4"],"word":"大踏步"},{"definition":["to show one's colors\/to have a clear-cut stand (idiom)"],"pinyin":["qi2 zhi4 xian1 ming2"],"word":"旗帜鲜明"}]}