{"definition":["to bring\/to bring about\/to produce"],"pinyin":["dai4 lai2"],"traditional":["帶來"],"rank":431.0,"normalized_rank":0.006030249185006926,"fraction":0.00032087166987369083,"cumulative_fraction":0.4913975020276085,"word":"带来","characters":[{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"带"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"来"}],"containing_words":[{"definition":["Opportunity brings success. (idiom)"],"pinyin":["ji1 hui4 dai4 lai2 cheng2 gong1"],"word":"机会带来成功"}],"sentences":[{"english":"Ageing will put pressure on societies at all levels.","chinese":"老龄问题将对社会各阶层带来压力。"},{"english":"The acids in tomato juice can degrade the drink’s other ingredients.","chinese":"番茄汁中的酸会削弱其他材料带来的味觉。"},{"english":"Hideyoshi himself brought along two portable teahouses in starkly contrasting styles.","chinese":"丰臣秀吉本人带来了两个风格截然不同的便携式茶馆。"},{"english":"That was Hedwig. She brought a letter from Lupin .","chinese":"是海德薇，她带来了一封卢平的信。"},{"english":"Quality and moderation often bring more joy than an excess.","chinese":"品质和适度通常会比超额带来更多的欢乐。"},{"english":"EA brings MONOPOLY's new card game to mobile.","chinese":"电子艺界垄断带来的新游戏移动。"},{"english":"They are round and so they bring us good luck all the year round.","chinese":"它们都是圆的，能给我们带来一年的好运气。"},{"english":"Hooley 's Irish Pub brings an authentic slice of Irish culture to Guangzhou.","chinese":"胡利的爱尔兰酒吧给广州带来了真正的爱尔兰文化片。"},{"english":"I say that because it gives tremendous liquidity to the markets.","chinese":"我这样说是因为它给市场带来的巨大的流动性。"},{"english":"Rewards for past good deeds will be yours.","chinese":"往时的善事会给带来报答。"},{"english":"Trouble develops, however, when any human instinct or appetite causes overdeveloped.","chinese":"但假使人的欲求或喜好过度膨胀则会带来麻烦。"},{"english":"Chinese government is popular with the people because the government brings stability and wealth to the people.","chinese":"中国政府却因为为人民带来了稳定和财富而深得民心。"},{"english":"Bottom line, you bring in revenue for them, you win, they win.","chinese":"底线就是，你为他们带来收入，大家双赢。"},{"english":"Music brings my heart fairy air.","chinese":"音乐给心灵带来仙气。"},{"english":"Shi Xing pain Chen interests, points out the consequences of the Japanese occupation of Korea will bring.","chinese":"石星痛陈利害，指出了日军占领朝鲜会带来的恶果。"},{"english":"Papa would bring an old battered coal shovel and an old-fashioned ice chest with him.","chinese":"爷爷总会带来一把破旧的煤铲和一台老式冰柜。"}],"related":[{"definition":["to give to\/to provide to\/to bring to\/to take to"],"pinyin":["dai4 gei3"],"word":"带给"},{"definition":["to take along with one"],"pinyin":["dai4 qu5"],"word":"带去"},{"definition":["to supply\/to provide","to\/for\/for the benefit of\/to give\/to allow\/to do sth (for sb)\/(grammatical equivalent of 被)\/(grammatical equivalent of 把)\/(sentence intensifier)"],"pinyin":["ji3","gei3"],"word":"给"},{"definition":["to add\/to increase"],"pinyin":["zeng1 tian1"],"word":"增添"},{"definition":["maximum\/enormous"],"pinyin":["ji2 da4"],"word":"极大"},{"definition":["to bring about\/to create\/to cause"],"pinyin":["zao4 cheng2"],"word":"造成"},{"definition":["to arise\/to come into being\/to come about\/to give rise to\/to bring into being\/to bring about\/to produce\/to engender\/to generate\/to appear\/appearance\/emergence\/generation\/production\/yield"],"pinyin":["chan3 sheng1"],"word":"产生"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["to offer\/to supply\/to provide\/to furnish"],"pinyin":["ti2 gong1"],"word":"提供"},{"definition":["influence\/effect\/to influence\/to affect (usually adversely)\/to disturb\/CL:股[gu3]"],"pinyin":["ying3 xiang3"],"word":"影响"},{"definition":["to experience for oneself"],"pinyin":["ti3 yan4"],"word":"体验"},{"definition":["nice surprise\/to be pleasantly surprised"],"pinyin":["jing1 xi3"],"word":"惊喜"},{"definition":["to yield\/to permit\/to let sb do sth\/to have sb do sth\/to make sb (feel sad etc)\/by (indicates the agent in a passive clause, like 被[bei4])"],"pinyin":["rang4"],"word":"让"},{"definition":["to create\/to bring about\/to produce\/to set (a record)"],"pinyin":["chuang4 zao4"],"word":"创造"},{"definition":["huge\/immense\/very large\/tremendous\/gigantic\/enormous"],"pinyin":["ju4 da4"],"word":"巨大"},{"definition":["auxiliary verb introducing future action: may (be able to)\/will (cause)\/should (enable)\/going to"],"pinyin":["jiang1 hui4"],"word":"将会"}]}