{"definition":["It is better to travel hopefully than to arrive."],"pinyin":["dai4 zhe5 xi1 wang4 qu4 lu:3 xing2 , bi3 dao4 da2 zhong1 dian3 geng4 mei3 hao3"],"traditional":["帶著希望去旅行，比到達終點更美好"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"带着希望去旅行，比到达终点更美好","characters":[{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"带"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"},{"definition":["to hope\/to admire\/variant of 稀[xi1]"],"pinyin":["xi1"],"word":"希"},{"definition":["full moon\/to hope\/to expect\/to visit\/to gaze (into the distance)\/to look towards\/towards","15th day of month (lunar calendar)\/old variant of 望[wang4]"],"pinyin":["wang4","wang4"],"word":"望"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"},{"definition":["trip\/travel\/to travel\/brigade (army)"],"pinyin":["lu:3"],"word":"旅"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"},{"word":"，"},{"definition":["Belgium\/Belgian\/abbr. for 比利時|比利时[Bi3 li4 shi2]","to compare\/(followed by a noun and adjective) more {adj.} than {noun}\/ratio\/to gesture\/(Taiwan pr. [bi4] in some compounds derived from Classical Chinese)","euphemistic variant of 屄[bi1]"],"pinyin":["Bi3","bi3","bi1"],"word":"比"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["surname Da","to attain\/to reach\/to amount to\/to communicate\/eminent"],"pinyin":["Da2","da2"],"word":"达"},{"definition":["end\/finish"],"pinyin":["zhong1"],"word":"终"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"点"},{"definition":["more\/even more\/further\/still\/still more","to change or replace\/to experience\/one of the five two-hour periods into which the night was formerly divided\/watch (e.g. of a sentry or guard)"],"pinyin":["geng4","geng1"],"word":"更"},{"definition":["the Americas\/abbr. for 美洲[Mei3 zhou1]\/USA\/abbr. for 美國|美国[Mei3 guo2]","beautiful\/very satisfactory\/good\/to beautify\/to be pleased with oneself"],"pinyin":["Mei3","mei3"],"word":"美"},{"definition":["to be fond of\/to have a tendency to\/to be prone to","good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello"],"pinyin":["hao4","hao3"],"word":"好"}],"containing_words":[],"sentences":[],"related":[]}