{"definition":["(of an area) vast or extensive\/large-scale\/widespread\/(of people) numerous"],"pinyin":["guang3 da4"],"traditional":["廣大"],"rank":1093.0,"normalized_rank":0.015292488072418956,"fraction":0.00014619527950358332,"cumulative_fraction":0.63420959354065,"word":"广大","characters":[{"definition":["surname Guang","\"house on a cliff\" radical in Chinese characters (Kangxi radical 53), occurring in 店, 序, 底 etc","wide\/numerous\/to spread"],"pinyin":["Guang3","yan3","guang3"],"word":"广"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"}],"containing_words":[{"definition":["to possess great magical power\/to possess remarkable abilities"],"pinyin":["shen2 tong1 guang3 da4"],"word":"神通广大"}],"sentences":[{"english":"The tenet of superiority for broad hall is built and promoted the collectors.","chinese":"文博会馆的宗旨也是为广大收藏者而倡建的。"},{"english":"The current vegetable price slump has taken its toll on Chinese farmers.","chinese":"近日蔬菜价格暴跌使广大的中国菜农损失惨重。"},{"english":"Connaught in good faith observe the operating principle of serving the majority of users.","chinese":"本着诚信守诺的经营原则服务于广大用户。"},{"english":"It is the rail and commercial center for the vast northern section of the country. Population, 385, 603.","chinese":"是这个国家北部广大地区铁路和商业中心。"},{"english":"We warmly welcome all our customers, old and new, in and abroad, with our most sincerity.","chinese":"万联轴承真诚欢迎广大国内外新老客户。"},{"english":"Workshop director of high-strength comrades wholeheartedly welcome customers to negotiate business.","chinese":"车间主任高强同志竭诚欢迎广大客户前来洽谈业务。"},{"english":"We welcome the broad masses of old and new customers continue to support the Company.","chinese":"竭诚欢迎广大的新老客户继续支持本公司。"},{"english":"The same is very much the case in Africa's fragile post-colonial nations.","chinese":"这一点，对于非洲广大后殖民地国家来说，同样如此。"},{"english":"Nuwa not only to the day of salvation, but also in creation, work miracles.","chinese":"女娲不但补天救世，还创造万物，神通广大。"},{"english":"It is greatly welcomed with a mass of enterprises and has built up a good company credit standing within and outside food industry.","chinese":"深受广大企业的青睐，在业内外享有良好的企业信誉。"},{"english":"Strong support of extensive customer has been cast along being popular today.","chinese":"广大客户的大力支持铸就了顺兴的今天。"},{"english":"So, everyone. Please don’t be blaming porn on your relationship problems.","chinese":"因此，广大群众，请不要因为感情问题而责怪不雅物。"},{"english":"The priest always preaches on grace to a large congregation.","chinese":"牧师经常向广大会众讲关于恩典的道理。"},{"english":"I company produces the hubei type finely machine also quite broad new old customer's favour.","chinese":"我公司所生产鄂式细碎机也颇广大新老用户的青睐。"},{"english":"Dopod counters into full operation on the vast number of consumers.","chinese":"正式全面多普达专柜对广大消费者营业。"},{"english":"By popular demand, the play will run for another week.","chinese":"应广大观众要求，这出戏将加演一周。"}],"related":[{"definition":["everybody\/all (guests, colleagues etc)\/all of you"],"pinyin":["ge4 wei4"],"word":"各位"},{"definition":["plural marker for pronouns, and nouns referring to individuals"],"pinyin":["men5"],"word":"们"},{"definition":["numerous"],"pinyin":["zhong4 duo1"],"word":"众多"},{"definition":["to remind\/to call attention to\/to warn of"],"pinyin":["ti2 xing3"],"word":"提醒"},{"definition":["to receive in no small measure"],"pinyin":["shen1 shou4"],"word":"深受"},{"definition":["hereto\/here"],"pinyin":["zai4 ci3"],"word":"在此"},{"definition":["everyone\/influential family\/great expert"],"pinyin":["da4 jia1"],"word":"大家"},{"definition":["to call on (sb to do sth)\/to appeal (to)\/an appeal"],"pinyin":["hu1 yu4"],"word":"呼吁"},{"definition":["all walks of life\/all social circles"],"pinyin":["ge4 jie4"],"word":"各界"},{"definition":["mass\/multitude\/the masses"],"pinyin":["qun2 zhong4"],"word":"群众"},{"definition":["well known"],"pinyin":["zhou1 zhi1"],"word":"周知"},{"definition":["maximum\/enormous"],"pinyin":["ji2 da4"],"word":"极大"},{"definition":["ever since a long time ago"],"pinyin":["chang2 qi1 yi3 lai2"],"word":"长期以来"},{"definition":["to like\/to love\/to be fond of\/favorite"],"pinyin":["xi3 ai4"],"word":"喜爱"},{"definition":["lover (of art, sports etc)\/amateur\/enthusiast\/fan"],"pinyin":["ai4 hao4 zhe3"],"word":"爱好者"},{"definition":["this kind\/these kinds\/such"],"pinyin":["ci3 lei4"],"word":"此类"}]}