{"definition":["to apply (for a job)\/to reply to a job advertisement"],"pinyin":["ying4 zheng1"],"traditional":["應徵"],"rank":13803.0,"normalized_rank":0.1931218781917647,"fraction":0.000004798722527832296,"cumulative_fraction":0.9537079891080692,"word":"应征","characters":[{"definition":["to agree (to do sth)\/should\/ought to\/must\/(legal) shall","surname Ying","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["ying1","Ying4","ying4"],"word":"应"},{"definition":["to invite\/to recruit\/to levy (taxes)\/to draft (troops)\/phenomenon\/symptom\/characteristic sign (used as proof)\/evidence","journey\/trip\/expedition\/to go on long campaign\/to attack"],"pinyin":["zheng1","zheng1"],"word":"征"}],"containing_words":[],"sentences":[{"english":"The applicants who pass the qualification pre-evaluation will receive the formal invitation for Levy.","chinese":"主办单位向资审合格的应征人发出正式邀请。"},{"english":"A few months later my younger brother enlisted as a bugler .","chinese":"几个月以后，我弟弟作为号兵应征入伍。"},{"english":"She was jumpy during her job interview because she was so nervous.","chinese":"她在应征面谈的时候心惊肉跳，因为她太紧张了。"},{"english":"He was drafted by the army and served for four years.","chinese":"他应征入伍，服役4年。"},{"english":"An unemployed man goes to try for a job with Microsoft as a Lavatory cleaner.","chinese":"一名失业的人到微软去应征一份实验室清洁员的工作。"},{"english":"Aunt Sally was to find a cook, a lot, she signed up to personal interview.","chinese":"莱莉姑姑要找个厨师，良多人应征，她要亲身面试。"},{"english":"Conclusion Generally speaking, the mental health state of enrollee is normal.","chinese":"结论应征青年的心理健康状况总体正常。"},{"english":"He applied for a job as a clerk.","chinese":"他应征事务员的工作。"},{"english":"No, I haven't got any dutiable things with me.","chinese":"不，我没有带任何需要交应征税的东西。"},{"english":"When he was in graduate school, he was drafted into the army and sent to fight in China.","chinese":"读研究生时，他应征入伍并被派往中国参战。"},{"english":"In countries where there is conscription men are called up at the age of eighteen．（call up men／call men up／call them up）","chinese":"在实行征兵制的国家里，18岁的男子要应征服役。"},{"english":"But as you know，we have dozens of applicants to be answered.","chinese":"但你也知道，我们还有几个应征者要面谈。"},{"english":"After graduating from college, forrest gump and enlistment to Vietnam.","chinese":"在大学毕业后，阿甘又应征入伍去了越南。"},{"english":"Our company has a few openings. Why don't you apply?","chinese":"我们公司有一些职缺。你何不来应征呢？"},{"english":"He was called up in 1997.","chinese":"他于1997年应征入伍。"},{"english":"It's a good time to schedule that salary review or to apply for a bigger and better-paying job.","chinese":"现在是时候重温你的工资或者应征更好的工作。"}],"related":[{"definition":["to recommend oneself (for a job)"],"pinyin":["zi4 jian4"],"word":"自荐"},{"definition":["to accept a job offer\/to apply for an advertised position"],"pinyin":["ying4 pin4"],"word":"应聘"},{"definition":["to collect\/to recruit"],"pinyin":["zheng1 ji2"],"word":"征集"},{"definition":["to engage (a teacher etc)\/to hire\/to betroth\/betrothal gift\/to get married (of woman)"],"pinyin":["pin4"],"word":"聘"},{"definition":["Mao Sui recommends himself (idiom); to offer one's services (in the style of Mao Sui offering his services to king of Chu 楚 of the Warring states)"],"pinyin":["Mao2 Sui4 zi4 jian4"],"word":"毛遂自荐"},{"definition":["to conscript"],"pinyin":["zheng1 mu4"],"word":"征募"},{"definition":["to hire (an employee)\/to accept (a manuscript) for publication"],"pinyin":["lu4 yong4"],"word":"录用"},{"definition":["to levy troops\/recruitment"],"pinyin":["zheng1 bing1"],"word":"征兵"},{"definition":["to sign up\/to enter one's name\/to apply\/to register\/to enroll\/to enlist"],"pinyin":["bao4 ming2"],"word":"报名"},{"definition":["announcement (written, on billboard, letter, newspaper or website)\/to post information\/a notice"],"pinyin":["qi3 shi4"],"word":"启事"},{"definition":["of age\/of the appropriate age"],"pinyin":["shi4 ling2"],"word":"适龄"},{"definition":["to join the army"],"pinyin":["can1 jun1"],"word":"参军"},{"definition":["in the newspaper"],"pinyin":["bao4 shang4"],"word":"报上"},{"definition":["to restrict\/to agree to a contract\/offer\/bid"],"pinyin":["yao1 yue4"],"word":"要约"},{"definition":["to recruit\/to enlist"],"pinyin":["zhao1 mu4"],"word":"招募"},{"definition":["to employ\/to hire"],"pinyin":["pin4 yong4"],"word":"聘用"}]}