{"definition":["person taking a job\/job applicant\/CL:位[wei4]"],"pinyin":["ying4 pin4 zhe3"],"traditional":["應聘者"],"rank":14230.0,"normalized_rank":0.1990961621871196,"fraction":0.000004522532857809522,"cumulative_fraction":0.9556943012756068,"word":"应聘者","characters":[{"definition":["to agree (to do sth)\/should\/ought to\/must\/(legal) shall","surname Ying","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["ying1","Ying4","ying4"],"word":"应"},{"definition":["to engage (a teacher etc)\/to hire\/to betroth\/betrothal gift\/to get married (of woman)"],"pinyin":["pin4"],"word":"聘"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"Employment interview is the process of transferring information between interviewers and interviewees.","chinese":"面试是面试官与应聘者进行面对面交流的过程。"},{"english":"Xu believes that stress has become a common problem for employees.","chinese":"徐永革认为应聘者普遍存在的问题是压力。"},{"english":"Many employers also check whether potential hires can speak Mandarin.","chinese":"许多用人单位也会核查应聘者是否会讲普通话。"},{"english":"During a phone interview the candidate flushed the toilet while talking to hiring manager.","chinese":"应聘者在一次电话面试外边和招聘经理谈话边冲马桶。"},{"english":"Secondly, an interviewee must demonstrate his skills for the job.","chinese":"其次，应聘者要证明自己能胜任这份工作。"},{"english":"“This also helps you become a better interviewee, ” Richards says.","chinese":"这可以帮助你成为一个更好的应聘者”，理查兹说。"},{"english":"The applicant smelled his armpits on the way to the interview room。","chinese":"应聘者闻着腋窝走进面试房间。"},{"english":"Some candidates don'tto spell the company's name correctly.","chinese":"一些应聘者都懒得把公司的名称拼写正确。"},{"english":"A friend or lover—I can see that. But an employer?","chinese":"朋友还是情人我能了解，但是通过一个应聘者做到呢？"},{"english":"Some candidates giggled nervously as they waited for the interview.","chinese":"一些应聘者在等待面试的时候紧张的傻笑。"},{"english":"During a phone interview the candidate flushed the toilet while talking to hiring manager。","chinese":"应聘者在一次电话面试中边和招聘经理谈话边冲马桶。"},{"english":"An interviewer hosts the meeting in an office setting where a friendly conversation takes place between two people.","chinese":"在一间办公室里，面试官和应聘者进行融洽的交流。"},{"english":"This question is one of the most tricky questions for fresh graduates.","chinese":"对于应届生应聘者来说，对这个问题是最易陷入圈套。"},{"english":"This is particularly important if the firm is in a different industry than the one you worked in before.","chinese":"对于跨行业的应聘者来说，这一点尤其重要。"},{"english":"Candidates who don’t ask questions also come across as unprepared and unengaged.","chinese":"应聘者没有问题同样被看作是没有准备和没有事的。"},{"english":"You are now working with or within the animal health industry.","chinese":"应聘者需是动物保健行业的在业人员或相关人员。"}],"related":[{"definition":["job applicant"],"pinyin":["qiu2 zhi2 zhe3"],"word":"求职者"},{"definition":["prospective employer\/person advertising a job\/recruiter"],"pinyin":["zhao1 pin4 zhe3"],"word":"招聘者"},{"definition":["to be interviewed (as a candidate)\/interview"],"pinyin":["mian4 shi4"],"word":"面试"},{"definition":["to accept a job offer\/to apply for an advertised position"],"pinyin":["ying4 pin4"],"word":"应聘"},{"definition":["to invite applications for a job\/to recruit"],"pinyin":["zhao1 pin4"],"word":"招聘"},{"definition":["curriculum vitae (CV)\/résumé\/biographical notes"],"pinyin":["jian3 li4"],"word":"简历"},{"definition":["student graduating in the current year\/recent graduate"],"pinyin":["ying1 jie4 bi4 ye4 sheng1"],"word":"应届毕业生"},{"definition":["written examination\/paper test (for an applicant)"],"pinyin":["bi3 shi4"],"word":"笔试"},{"definition":["to seek employment"],"pinyin":["qiu2 zhi2"],"word":"求职"},{"definition":["to hire (an employee)\/to accept (a manuscript) for publication"],"pinyin":["lu4 yong4"],"word":"录用"},{"definition":["headhunting (executive recruitment)\/headhunter (profession)\/headhunting (tribal custom)"],"pinyin":["lie4 tou2"],"word":"猎头"},{"definition":["personnel office"],"pinyin":["ren2 shi4 bu4 men2"],"word":"人事部门"},{"definition":["face-to-face meeting\/an interview"],"pinyin":["mian4 tan2"],"word":"面谈"},{"definition":["cover letter\/job application"],"pinyin":["qiu2 zhi2 xin4"],"word":"求职信"},{"definition":["salesperson"],"pinyin":["ye4 wu4 yuan2"],"word":"业务员"},{"definition":["exam candidate\/student whose name has been put forward for an exam"],"pinyin":["kao3 sheng1"],"word":"考生"}]}