{"definition":["to defer\/to postpone\/to put off\/to retard\/to slow sth down"],"pinyin":["yan2 huan3"],"traditional":["延緩"],"rank":15067.0,"normalized_rank":0.21080687812180826,"fraction":0.000004115401256491592,"cumulative_fraction":0.959309811783432,"word":"延缓","characters":[{"definition":["surname Yan","to prolong\/to extend\/to delay"],"pinyin":["Yan2","yan2"],"word":"延"},{"definition":["slow\/unhurried\/sluggish\/gradual\/not tense\/relaxed\/to postpone\/to defer\/to stall\/to stave off\/to revive\/to recuperate"],"pinyin":["huan3"],"word":"缓"}],"containing_words":[],"sentences":[{"english":"CSE Cutter delays the onset of fracturing and cutter wear.","chinese":"CSE齿延缓切削齿的破裂和磨损。"},{"english":"Being proved by modern medical research, it also helps to delay the decrepitude of skin.","chinese":"现代医学证明，它还可以起到延缓皮肤衰老的作用。"},{"english":"Objective To investigate the delaying aging mechanism of selenium on neurons.","chinese":"目的探讨硒延缓神经细胞衰老的作用机制。"},{"english":"Probenecid can delay this for the renal excretion.","chinese":"丙磺舒可延缓本品经肾排泄。"},{"english":"One package of Cerasilk Aging & Wrinkle Defying Serum contains 60 capsules.","chinese":"每一盒抗皱紧肤延缓老化精华含有60片胶囊。"},{"english":"Cytokinin has the characteristic of delaying plant cell and tissue senescence.","chinese":"细胞分裂素具有延缓植物细胞和组织衰老的特性。"},{"english":"Conclusion Ginsenoside can prevent or delay the development of hypertrophy.","chinese":"结论人参皂苷在早期能预防或延缓心肌肥大的发生。"},{"english":"Due to heavy rains, the construction project was slightly delayed.","chinese":"因天雨关系，整个建校工程进度稍作延缓。"},{"english":"Black tea contains plenty of tea polyphenols, so it helps to strengthen the bones and can stave osteoporosis.","chinese":"红茶因多酚类含量高，可以强健骨骼，延缓骨质疏松。"},{"english":"It must be cautiously used for animals with renal dysfunction because of delay of sulfanilamide excretion.","chinese":"肾功能障碍时，磺胺药排泄延缓，应慎用。"},{"english":"Seasonal effects did not appear to be responsible for the delayed density-dependent effects on survival.","chinese":"季节性影响看来与对生存的延缓性密度依赖效应无关。"},{"english":"Regulation of the endocrine, balance hormones, improve sub-health, anti-aging.","chinese":"调节内分泌，平衡荷尔蒙，改善亚健康，延缓衰老。"},{"english":"All refactoring that slows feature progress is an investment in the future.","chinese":"所有延缓特性开发进度的重构工作都是对未来的投资。"},{"english":"Currently there is no treatment that has been shown to slow the progression of PD .","chinese":"目前还没有一种有效的治疗可以延缓帕金森病的进程。"},{"english":"China may be allowing it to drift higher to stave off American retaliation.","chinese":"中国可能会允许它升值的更高，从而延缓美国的报复。"},{"english":"Financial constraints cause many to skip antenatal care or postpone treatment for minor ailments.","chinese":"经济制约使许多人不去接受产前保健或延缓治疗小病。"}],"related":[{"definition":["to slow down\/to retard"],"pinyin":["jian3 huan3"],"word":"减缓"},{"definition":["to slow down"],"pinyin":["jian3 man4"],"word":"减慢"},{"definition":["to prevent\/to block"],"pinyin":["zu3 zhi3"],"word":"阻止"},{"definition":["to block\/to obstruct\/to intercept\/to interdict"],"pinyin":["zu3 duan4"],"word":"阻断"},{"definition":["to prevent\/to guard against\/to take precautions"],"pinyin":["fang2 zhi3"],"word":"防止"},{"definition":["to inhibit\/to keep down\/to suppress"],"pinyin":["yi4 zhi4"],"word":"抑制"},{"definition":["to lower\/to reduce"],"pinyin":["jian3 di1"],"word":"减低"},{"definition":["to prolong\/to extend\/to delay","Yanchang county in Yan'an 延安[Yan2 an1], Shaanxi"],"pinyin":["yan2 chang2","Yan2 chang2"],"word":"延长"},{"definition":["to promote (an idea or cause)\/to advance\/boost"],"pinyin":["cu4 jin4"],"word":"促进"},{"definition":["to prevent\/to take precautions against\/to protect\/to guard against\/precautionary\/prophylactic"],"pinyin":["yu4 fang2"],"word":"预防"},{"definition":["to obstruct\/to hinder\/to block\/obstruction\/hindrance"],"pinyin":["zu3 ai4"],"word":"阻碍"},{"definition":["to age\/to deteriorate with age\/old and weak"],"pinyin":["shuai1 lao3"],"word":"衰老"},{"definition":["slow\/slow-moving"],"pinyin":["huan3 man4"],"word":"缓慢"},{"definition":["to speed up\/to expedite"],"pinyin":["jia1 su4"],"word":"加速"},{"definition":["to delay\/to postpone\/to keep putting sth off\/to procrastinate\/(computing) to lag"],"pinyin":["yan2 chi2"],"word":"延迟"},{"definition":["to induce\/to promote\/to urge\/to impel\/to bring about\/to provoke\/to drive (sb to do sth)\/to catalyze\/to actuate\/to contribute to (some development)"],"pinyin":["cu4 shi3"],"word":"促使"}]}