{"definition":["to continue\/to go on\/to last"],"pinyin":["yan2 xu4"],"traditional":["延續"],"rank":2884.0,"normalized_rank":0.04035090173911827,"fraction":0.00005049147146713941,"cumulative_fraction":0.7850234273573937,"word":"延续","characters":[{"definition":["surname Yan","to prolong\/to extend\/to delay"],"pinyin":["Yan2","yan2"],"word":"延"},{"definition":["to continue\/to replenish"],"pinyin":["xu4"],"word":"续"}],"containing_words":[],"sentences":[{"english":"These traditional disciplines and the use of bamboo weapons remain alive today.","chinese":"这些传统学科以及竹制武器的使用一直延续至今。"},{"english":"Shehuo is a continuation of an ancient tradition of offering sacrifices to Land Gods and Fire Gods.","chinese":"社火是古代祭祀土地神和火神活动的延续。"},{"english":"Our thinking is of the Fred Flintstone vintage, hence the Chinese blow us away.","chinese":"我们的思维是弗雷德是延续，因此中国任意打击我们。"},{"english":"We recommend continuance of this program.","chinese":"我们推荐的延续，这一计划。"},{"english":"The meeting droned on for hours.","chinese":"会议单调地延续了几个小时。"},{"english":"The test will be whether they can continue that streak.","chinese":"但能否延续这一强劲势头是他们所面临的考验。"},{"english":"This feudal society, beginning with Zhou and Qin Dynasties. lasted about 3000 years.","chinese":"这个封建社会，从周秦开始，延续了约三千年。"},{"english":"Polar mesospheric clouds appear as light blue ribbons extending across the top of the image.","chinese":"极地云层出现淡蓝色的色带一直延续到图片的顶端。"},{"english":"Me, Forever will also belong to our story extension go down.","chinese":"涐，永逺亦将属箊涐们旳故亊延续落去。"},{"english":"To what extent did the Bolsheviks simply continue policies that the tsarist government was already embracing?","chinese":"布尔什维克延续俄帝政府固有的政策到怎样的程度？"},{"english":"Contemporary Calvinists may sometimes be responsible for perpetuating this image.","chinese":"当代的加尔文派也许要为延续这种印象负责。"},{"english":"Movie gradation Cist the development and transformation of movie examination.","chinese":"分级制是电影审查制的延续和变型。"},{"english":"Mystical bloodlines are only important when continuing a dynasty.","chinese":"血统只在延续朝代的时候起作用。"},{"english":"I want to know your feeling about the original song \"Bressanone\".","chinese":"所以我决定做这首新歌来延续布列瑟农的故事。"},{"english":"It shows how the formatting gets carried down to the next paragraph.","chinese":"它说明了格式如何延续到下一个段落。"},{"english":"The letter continues a legal battle between Mr. Harder and Gawker.","chinese":"这封信延续了哈德与高客之间的法律争斗。"}],"related":[{"definition":["to carry on as before\/to follow (an old custom etc)"],"pinyin":["yan2 xi2"],"word":"沿袭"},{"definition":["to continue to use (old methods)\/to apply as before\/according to usage"],"pinyin":["yan2 yong4"],"word":"沿用"},{"definition":["to continue\/to proceed with\/to go on with"],"pinyin":["ji4 xu4"],"word":"继续"},{"definition":["as before\/still"],"pinyin":["yi1 jiu4"],"word":"依旧"},{"definition":["once more\/once again\/one more time"],"pinyin":["zai4 du4"],"word":"再度"},{"definition":["to recreate\/to reconstruct (a historical relic)"],"pinyin":["zai4 xian4"],"word":"再现"},{"definition":["to break\/to smash"],"pinyin":["da3 po4"],"word":"打破"},{"definition":["to continue\/to persist\/sustainable\/preservation"],"pinyin":["chi2 xu4"],"word":"持续"},{"definition":["to return to\/to retreat\/regression (statistics)"],"pinyin":["hui2 gui1"],"word":"回归"},{"definition":["to keep\/to maintain\/to hold\/to preserve"],"pinyin":["bao3 chi2"],"word":"保持"},{"definition":["power\/momentum\/tendency\/impetus\/situation\/the look of things"],"pinyin":["shi4 tou2"],"word":"势头"},{"definition":["to pass on (to future generations)\/passed on (from former times)\/a continued tradition\/an inheritance"],"pinyin":["chuan2 cheng2"],"word":"传承"},{"definition":["still\/as before"],"pinyin":["yi1 ran2"],"word":"依然"},{"definition":["end\/conclusion\/to come to an end\/to terminate (sth)"],"pinyin":["zhong1 jie2"],"word":"终结"},{"definition":["whole entity\/entire body\/synthesis\/as a whole (situation, construction, team etc)\/global\/macrocosm\/integral\/holistic\/whole"],"pinyin":["zheng3 ti3"],"word":"整体"},{"definition":["to pick up (a theme etc)\/to regain (confidence)\/to revive (a custom, friendship etc)"],"pinyin":["chong2 shi2"],"word":"重拾"}]}