{"definition":["organizational structure"],"pinyin":["jian4 zhi4"],"traditional":["建制"],"rank":15571.0,"normalized_rank":0.21785849201796484,"fraction":0.00000386899102234865,"cumulative_fraction":0.9613231255785891,"word":"建制","characters":[{"definition":["to establish\/to found\/to set up\/to build\/to construct"],"pinyin":["jian4"],"word":"建"},{"definition":["to manufacture\/to make","system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4","zhi4"],"word":"制"}],"containing_words":[{"definition":["feudalism"],"pinyin":["feng1 jian4 zhi4 du4"],"word":"封建制度"}],"sentences":[{"english":"The people's war has helped crush the feudal structure in the rural areas.","chinese":"人民战争摧毁了农村地区的封建制度。"},{"english":"We should develop small towns on the Basis of existing county seats and of organic towns where conditions permit.","chinese":"发展小城镇要以现有的县城和有条件的建制镇为基础。"},{"english":"But it was also a bold attack on feudalism and arranged marriage.","chinese":"但它同时也是对封建制度和包办婚姻的一记猛击。"},{"english":"In the architecture, the old building like Cosmological temple was built according to the idea of \"Round Sky & Square Earth\".","chinese":"在建制上，古代的建筑样式如明堂就拟天圆地方而建。"},{"english":"They are the hieroglyphics of feudalism succeeding those of theocracy .","chinese":"这是继神权政治象形文字之后的封建制度象形文字。"},{"english":"Their victims from the feudal system, become the accomplices of the feudal rulers.","chinese":"她们由封建制度的受害者，变成封建统治者的帮凶。"},{"english":"We will improve the system for managing government investment, and accelerate implementation of the contractor system for construction projects.","chinese":"健全政府投资管理体制，加快推行代建制。"},{"english":"Feudal and monarchical maladies no longer run in our blood.","chinese":"在我们的血液里已不再存在封建制和君主制的病害。"},{"english":"The process and driving model of institutionalization for the discipline are discussed here.","chinese":"分析了消防工程学科建制化的过程及其驱动模式。"},{"english":"The fall of the West Rome Empire marked the beginning of feudalism in Eurpoe.","chinese":"西罗马帝国的灭亡标志着欧洲封建制度的开始。"},{"english":"Refers to cities establish with the approval of the central government.","chinese":"指经国家批准成立的“市”建制的城市。"},{"english":"Feudal economic structure formulated in Warring States period.","chinese":"战国秦汉时期是我国封建制度的奠基时期。"},{"english":"A number of slips record the discussion about the administrative establishment of Dongting Prefecture.","chinese":"其中还有多枚简涉及对洞庭郡某一行政建制的讨论。"},{"english":"Shi, according to records, the Xia and Shang Dynasties period began Wuqiang officially formed in the Han Dynasty.","chinese":"据史志记载，武强始于夏商时期，正式建制于两汉。"},{"english":"Withdrawn in 1950 the establishment of Dalian University, Dalian Medical College independent.","chinese":"1950年撤消大连大学建制，大连医学院独立。"},{"english":"The approval for the government injection into the Community Care Fund hinged on support from pro-establishment legislators.","chinese":"关爱基金拨款获批与否，取决于建制派议员的支持。"}],"related":[{"definition":["directly subordinate"],"pinyin":["zhi2 shu3"],"word":"直属"},{"definition":["number of military unit"],"pinyin":["fan1 hao4"],"word":"番号"},{"definition":["administered by\/under the rule of"],"pinyin":["xia4 xia2"],"word":"下辖"},{"definition":["to incorporate\/to put under (external administration)"],"pinyin":["hua4 gui1"],"word":"划归"},{"definition":["large military unit\/formation\/corps\/army"],"pinyin":["bing1 tuan2"],"word":"兵团"},{"definition":["to expand (esp. by new recruitment)\/to increase the army\/to augment"],"pinyin":["kuo4 bian1"],"word":"扩编"},{"definition":["to govern directly"],"pinyin":["zhi2 xia2"],"word":"直辖"},{"definition":["regular army\/standing army"],"pinyin":["zheng4 gui1 jun1"],"word":"正规军"},{"definition":["to merge into\/to incorporate in","to merge into\/to incorporate in"],"pinyin":["bing4 ru4","bing4 ru4"],"word":"并入"},{"definition":["to establish (a unit or department)\/staffing structure (excluding temporary and casual staff)","to weave\/to plait\/to compile\/to put together (a lesson plan, budget etc)"],"pinyin":["bian1 zhi4","bian1 zhi4"],"word":"编制"},{"definition":["to govern\/to control\/having jurisdiction over\/linchpin of a wheel (archaic)\/noise of a barrow"],"pinyin":["xia2"],"word":"辖"},{"definition":["station\/encampment"],"pinyin":["zhu4 di4"],"word":"驻地"},{"definition":["to govern\/to have complete control over\/to be in command of"],"pinyin":["tong3 xia2"],"word":"统辖"},{"definition":["administrative subdivision"],"pinyin":["xing2 zheng4 qu1 hua4"],"word":"行政区划"},{"definition":["military institution"],"pinyin":["jun1 shi4 ji1 gou4"],"word":"军事机构"},{"definition":["to belong to (a category)\/to be attached to"],"pinyin":["li4 shu3"],"word":"隶属"}]}