{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"traditional":["開"],"rank":265.0,"normalized_rank":0.0037076938144474133,"fraction":0.0004637290249614491,"cumulative_fraction":0.4265085318069927,"word":"开","components":{"unicode":"U+5F00","character":"开","decomposition":"⿱一廾","decomposition_definitions":[{"word":"⿱"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["hands joined"],"pinyin":["gong3"],"word":"廾"}]},"containing_words":[{"definition":["to begin\/beginning\/to start\/initial\/CL:個|个[ge4]"],"pinyin":["kai1 shi3"],"word":"开始"},{"definition":["to exploit (a resource)\/to open up (for development)\/to develop"],"pinyin":["kai1 fa1"],"word":"开发"},{"definition":["to launch\/to develop\/to unfold\/(of an exhibition etc) to open"],"pinyin":["kai1 zhan3"],"word":"开展"},{"definition":["to convene (a conference or meeting)\/to convoke\/to call together"],"pinyin":["zhao4 kai1"],"word":"召开"},{"definition":["public\/to publish\/to make public"],"pinyin":["gong1 kai1"],"word":"公开"},{"definition":["to depart\/to leave"],"pinyin":["li2 kai1"],"word":"离开"},{"definition":["to unfold\/to carry out\/to be in full swing\/to launch"],"pinyin":["zhan3 kai1"],"word":"展开"},{"definition":["to bloom\/to open\/to be open (to the public)\/to open up (to the outside)\/to be open-minded\/unrestrained by convention\/unconstrained in one's sexuality"],"pinyin":["kai1 fang4"],"word":"开放"},{"definition":["to open\/to show (a ticket)\/to turn on\/to switch on"],"pinyin":["da3 kai1"],"word":"打开"},{"definition":["to pull open\/to pull apart\/to space out\/to increase"],"pinyin":["la1 kai1"],"word":"拉开"},{"definition":["open-minded","to open up (windows for air, ideas for discussion, transportation routes etc)"],"pinyin":["kai1 tong5","kai1 tong1"],"word":"开通"},{"definition":["open-minded","to open up (windows for air, ideas for discussion, transportation routes etc)"],"pinyin":["kai1 tong5","kai1 tong1"],"word":"开通"},{"definition":["to feel happy\/to rejoice\/to have a great time\/to make fun of sb"],"pinyin":["kai1 xin1"],"word":"开心"},{"definition":["development zone"],"pinyin":["kai1 fa1 qu1"],"word":"开发区"},{"definition":["to begin work (of a factory or engineering operation)\/to start a construction job"],"pinyin":["kai1 gong1"],"word":"开工"}],"sentences":[{"english":"Can you please open an irrevocable documentary credit?","chinese":"能开一张不可撤消的跟单信用证吗？"},{"english":"Use a little milk to soak the gelatine powder first.","chinese":"吉利丁先用少许牛奶浸泡开。"},{"english":"Those two ideas must be kept distinct from one another.","chinese":"必须把那两种思想区分开。"},{"english":"There, I've said it -- it feels so good to have that off my chest.","chinese":"在此，我已经说过能够脱离开书架让我感觉非常好。"},{"english":"The news of her divorce gradually rippled outwards.","chinese":"她离婚的消息渐渐向外传开。"},{"english":"This opens it to a brute-force attack over a network.","chinese":"这为网络上用暴力法攻击开了方便之门。"},{"english":"B：We want to open a US dollar account with your bank.","chinese":"我们想在贵行开一个美元账户。"},{"english":"I rang again and a maid with a sullen face opened the door .","chinese":"我又揿了一下门铃，一名侍女紧绷着脸把门开了。"},{"english":"This cook-shop was kept by some people named Thenardier, husband and wife.","chinese":"这客店是名叫德纳第的夫妇俩开的。"},{"english":"The guy warned me that you have to knock on the door first to scatter them away.","chinese":"店员警告我说开门前最好先敲敲门，以便把它们吓跑。"},{"english":"They are too conscientious and responsible to drive like manias .","chinese":"妇女格外谨慎，责任心也强，不会像狂人一样开飞车。"},{"english":"I figured instead of killing other people, I’d just put the truck in the ditch.","chinese":"我在想的是为了避免别人送命，我得将卡车开向路堤。"},{"english":"Doris:I think because I turned on the air conditioner right after showering and before I blow-dried my hair.","chinese":"大概是我刚刚洗完澡没吹头发又立刻开冷气的关系吧。"},{"english":"B----Oh, Come on, high cal is exactly the thing we need here!","chinese":"哦，开什么玩笑，高卡路里正是我们需要的。"},{"english":"I bought a ship. I will drive the ship.","chinese":"我买了艘船，自己开。"},{"english":"If no returns, one-inch the hole.","chinese":"如果返高不够，开1英寸的小孔。"}],"related":[{"definition":["to reopen\/to start again"],"pinyin":["zai4 kai1"],"word":"再开"},{"definition":["to hang or suspend (from a hook etc)\/to hang up (the phone)\/(of a line) to be dead\/to be worried or concerned\/to make a phone call (dialect)\/to register or record\/classifier for sets or clusters of objects\/(slang) to kill\/to die\/to be finished\/to fail (an exam)"],"pinyin":["gua4"],"word":"挂"},{"definition":["mistake\/wrong\/bad\/interlocking\/complex\/to grind\/to polish\/to alternate\/to stagger\/to miss\/to let slip\/to evade\/to inlay with gold or silver","surname Cuo"],"pinyin":["cuo4","Cuo4"],"word":"错"},{"definition":["to joke\/joke\/jest"],"pinyin":["wan2 xiao4"],"word":"玩笑"},{"definition":["to choose\/to pick\/to select\/to elect"],"pinyin":["xuan3"],"word":"选"},{"definition":["to announce the winners in a lottery"],"pinyin":["kai1 jiang3"],"word":"开奖"},{"definition":["individually courageous"],"pinyin":["du2 dan3"],"word":"独胆"},{"definition":["tail\/remainder\/remnant\/extremity\/sixth of the 28 constellations\/classifier for fish","horse's tail\/pointed posterior section of a locust etc"],"pinyin":["wei3","yi3"],"word":"尾"},{"definition":["gall bladder\/courage\/guts\/gall\/inner container (e.g. bladder of a football, inner container of a thermos)"],"pinyin":["dan3"],"word":"胆"},{"definition":["to change\/to alter\/to transform\/to correct"],"pinyin":["gai3"],"word":"改"},{"definition":["weight\/number\/code\/to pile\/to stack\/classifier for length or distance (yard), happenings etc"],"pinyin":["ma3"],"word":"码"},{"definition":["variant of 期[qi1]\/period\/cycle","a period of time\/phase\/stage\/classifier for issues of a periodical, courses of study\/time\/term\/period\/to hope\/Taiwan pr. [qi2]"],"pinyin":["qi1","qi1"],"word":"期"},{"definition":["flower\/blossom\/CL:朵[duo3],支[zhi1],束[shu4],把[ba3],盆[pen2],簇[cu4]\/fancy pattern\/florid\/to spend (money, time)\/(coll.) lecherous\/lustful","surname Hua","old variant of 花[hua1]","variant of 花[hua1]\/flower\/blossom\/also pr. [wei3]"],"pinyin":["hua1","Hua1","hua1","hua1"],"word":"花"},{"definition":["surname Che","car\/vehicle\/CL:輛|辆[liang4]\/machine\/to shape with a lathe\/Kangxi radical 159","war chariot (archaic)\/rook (in Chinese chess)\/rook (in chess)"],"pinyin":["Che1","che1","ju1"],"word":"车"},{"definition":["to get over (a shock, bereavement etc)\/to avoid dwelling on unpleasant things\/to accept the situation and move on"],"pinyin":["xiang3 kai1"],"word":"想开"},{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"}]}