{"definition":["to begin\/beginning\/to start\/initial\/CL:個|个[ge4]"],"pinyin":["kai1 shi3"],"traditional":["開始"],"rank":112.0,"normalized_rank":0.0015670253102570198,"fraction":0.0009685494380858905,"cumulative_fraction":0.3274507618147041,"word":"开始","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"开"},{"definition":["to begin\/to start\/then\/only then"],"pinyin":["shi3"],"word":"始"}],"containing_words":[{"definition":["to start from scratch"],"pinyin":["cong2 ling2 kai1 shi3"],"word":"从零开始"},{"definition":["to resume\/to restart\/to start afresh"],"pinyin":["chong2 xin1 kai1 shi3"],"word":"重新开始"},{"definition":["before the beginning (of sth)"],"pinyin":["kai1 shi3 yi3 qian2"],"word":"开始以前"},{"definition":["to start a match\/to kick off"],"pinyin":["kai1 shi3 bi3 sai4"],"word":"开始比赛"}],"sentences":[{"english":"Dr Kraabel began as an editor with the Edanz Group in 2008.","chinese":"2008年开始为理文编辑工作，担任编辑。"},{"english":"Is your focus on productivity starting to make you feel miserable or stressed out?","chinese":"如果你追求效能时开始感到痛苦或是精疲力竭？"},{"english":"It starts with that deep breath of confidence you take before the first step.","chinese":"千里之行，开始于迈出第一步前那口自信的深呼吸。"},{"english":"The local store has started selling baguettes and Belgian beers.","chinese":"当地的商店已经开始出售法国棍式面包和比利时啤酒。"},{"english":"But in the third week of May, currents drew some of the oil southeast.","chinese":"但到了5月的第三周，洋流开始把浮油带向东南方向。"},{"english":"The Grain Budding shows that crops that will ripen in summer start to show plump seeds.","chinese":"小满表示在夏季成熟的农作物籽粒开始饱满了。"},{"english":"Yu from East Jiangzhou down to the Three Gorges, Three Gorges will begin dredging project.","chinese":"禹从江州东下来到了三峡，便开始疏浚三峡的工程。"},{"english":"He started to unbutton his pants.","chinese":"他开始解裤子上的纽扣。"},{"english":"Before I got these, my allergies would turn into weeks-long sinus infections.","chinese":"在我开始使用前，过敏症状已变成持续几周的鼻炎。"},{"english":"She clicks on the link to the registration form and begins entering her information.","chinese":"她在登记表的连接处点击一下，开始进入她的信息。"},{"english":"During Hellenistic times, Greek women also started to artificially wave and curl their hair.","chinese":"在希腊化时代期间，希腊女人就已开始人为地卷发了。"},{"english":"The press began to lionize him enthusiastically.","chinese":"媒体开始狂热地吹捧他。"},{"english":"GLO started the sponsorship of the Confederation of African Football African Player of the Year Award.","chinese":"格洛开始赞助的非洲足球联合会非洲年度最佳球员。"},{"english":"What advice do you have for anyone looking to start a collection of single malts ?","chinese":"你对那些想开始收藏单麦芽威士忌的人有何建议？"},{"english":"Once fastening bolts, each bolt to ensure that the force evenly.","chinese":"一旦开始紧固螺栓，要确保各个螺栓均匀受力。"},{"english":"Ever since she was six years old, Loryn has yearned to visit India.","chinese":"从六岁开始，洛恩就向往游览印度。"}],"related":[{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["afterwards\/following\/later\/after"],"pinyin":["zhi1 hou4"],"word":"之后"},{"definition":["until"],"pinyin":["zhi2 dao4"],"word":"直到"},{"definition":["gradually"],"pinyin":["zhu2 jian4"],"word":"逐渐"},{"definition":["surname Cong","from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor"],"pinyin":["Cong2","cong2"],"word":"从"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"},{"definition":["at last\/finally\/in the end"],"pinyin":["dao4 liao3"],"word":"到了"},{"definition":["after\/later\/afterwards\/following\/later on\/in the future"],"pinyin":["yi3 hou4"],"word":"以后"},{"definition":["time\/length of time\/moment\/period"],"pinyin":["shi2 hou5"],"word":"时候"},{"definition":["plain\/informal\/suitable\/convenient\/opportune\/to urinate or defecate\/equivalent to 就[jiu4]: then\/in that case\/even if\/soon afterwards","see 便宜|便宜[pian2 yi5]"],"pinyin":["bian4","pian2"],"word":"便"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["slowly"],"pinyin":["man4 man4"],"word":"慢慢"},{"definition":["already"],"pinyin":["yi3 jing1"],"word":"已经"},{"definition":["to enter\/to join\/to go into"],"pinyin":["jin4 ru4"],"word":"进入"},{"definition":["start\/beginning"],"pinyin":["kai1 duan1"],"word":"开端"}]}