{"definition":["to begin\/to open\/to start\/beginning of an event"],"pinyin":["kai1 chang3"],"traditional":["開場"],"rank":5758.0,"normalized_rank":0.08056189050410645,"fraction":0.000019600415958751637,"cumulative_fraction":0.8753784909186593,"word":"开场","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"开"},{"definition":["threshing floor\/classifier for events and happenings: spell, episode, bout","large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","variant of 場|场[chang2]","variant of 場|场[chang3]"],"pinyin":["chang2","chang3","chang2","chang3"],"word":"场"}],"containing_words":[{"definition":["prologue of play\/opening remarks\/preamble (of speeches, articles etc)"],"pinyin":["kai1 chang3 bai2"],"word":"开场白"}],"sentences":[{"english":"The team failed to capitalize on their early lead.","chinese":"这个队未能充分利用开场时领前的优势。"},{"english":"On this high note the puppet show commences .","chinese":"木偶戏就在这阵高昂的调子里开场了。"},{"english":"The movie begins with Superman’s failed search for Krypton.","chinese":"电影以超人寻找氪星人失败开场。"},{"english":"By way of an introduction, I'd just like to give some historical background for this issue.","chinese":"作为开场白，我来解释一下这件事的历史背景。"},{"english":"Let's just hope that we're just seeing a few getting-started hiccups.","chinese":"我们都希望看到的仅仅是几个开场曲。"},{"english":"You don't engage in prolonged public displays of affection.","chinese":"你不会在公开场合长时间直露自己的情绪。"},{"english":"She begins by opening a colorful hatbox.","chinese":"她常用一个色彩斑斓的冒盒作为自己的开场。"},{"english":"Added new movie to boot Imperial Company (Julii) and the introductory video.","chinese":"增加了新的尤利乌斯家族帝国会战开场介绍性动画。"},{"english":"In other words, this kind of question is often a lead-in to a suggestion or invitation.","chinese":"换言之，这种问题通常是建议或邀请的开场白。"},{"english":"And then, the movie.","chinese":"接着，电影开场。"},{"english":"The play opens on a cold night at Elsinore, the Danish royal castle.","chinese":"该剧开场于艾尔西诺皇家城堡一个寒冷的夜晚。"},{"english":"River had gone 1-0 up within the first five minutes.","chinese":"河床在开场五分钟就取得领先。"},{"english":"I'm talking about intros that ooze with concern.","chinese":"我讲的是富有关怀的开场白。"},{"english":"But he ain’t had time to get good started yet.","chinese":"可是眼下，他恐怕还没来得及准备好开场白呢。"},{"english":"Host and win 10 matches with at least 6 players present.","chinese":"开场且赢这10场配对，但至少需6位玩家同场。"},{"english":"The Sunday afternoon class' version of \"The Little Prince\" got off to the strongest start of all three shows.","chinese":"周日下午班的“小王子”的开场戏是三场中最出色的。"}],"related":[{"definition":["to go on stage\/fig. to appear on the scene\/used in advertising to mean new product"],"pinyin":["deng1 chang3"],"word":"登场"},{"definition":["opening (chess etc)\/early stage of game, match, work, activity etc"],"pinyin":["kai1 ju2"],"word":"开局"},{"definition":["everyone present\/the whole audience\/across-the-board\/unanimously\/whole duration (of a competition or match)"],"pinyin":["quan2 chang3"],"word":"全场"},{"definition":["debut"],"pinyin":["shou3 xiu4"],"word":"首秀"},{"definition":["second half (of sporting competition)"],"pinyin":["hou4 ban4 chang3"],"word":"后半场"},{"definition":["half of a game or contest\/half-court"],"pinyin":["ban4 chang3"],"word":"半场"},{"definition":["(of a performer) to come onto the stage to perform\/(of an athlete) to enter the arena to compete\/(fig.) to enter the scene (e.g. a new product)\/(of an examinee etc) to leave the venue"],"pinyin":["chu1 chang3"],"word":"出场"},{"definition":["competition (sports etc)\/match\/CL:場|场[chang3],次[ci4]\/to compete"],"pinyin":["bi3 sai4"],"word":"比赛"},{"definition":["end (of a performance or sports match)\/last round of testing in the imperial examinations"],"pinyin":["zhong1 chang3"],"word":"终场"},{"definition":["on stage\/to go on stage\/to take the field"],"pinyin":["shang4 chang3"],"word":"上场"},{"definition":["score"],"pinyin":["bi3 fen1"],"word":"比分"},{"definition":["to go smoothly\/to come off\/to succeed"],"pinyin":["de2 shou3"],"word":"得手"},{"definition":["lit. the guest acts as host (idiom); fig. to turn from passive to active behavior"],"pinyin":["fan3 ke4 wei2 zhu3"],"word":"反客为主"},{"definition":["to equalize\/to level the score\/to pull back the advantage"],"pinyin":["ban1 ping2"],"word":"扳平"},{"definition":["high tide\/high water\/upsurge\/climax\/orgasm\/chorus (part of a song)"],"pinyin":["gao1 chao2"],"word":"高潮"},{"definition":["termination\/to finish\/to end\/to conclude\/to close"],"pinyin":["jie2 shu4"],"word":"结束"}]}