{"definition":["to start a war\/to make war\/to battle against"],"pinyin":["kai1 zhan4"],"traditional":["開戰"],"rank":8723.0,"normalized_rank":0.12204608733367844,"fraction":0.000010387038039360784,"cumulative_fraction":0.9178493397737676,"word":"开战","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"开"},{"definition":["to fight\/fight\/war\/battle"],"pinyin":["zhan4"],"word":"战"}],"containing_words":[],"sentences":[{"english":"He's got a new movie opening soon.","chinese":"他的另一部新作马上要开战首映。"},{"english":"The waiting is over. The World Cup is about to kick off.","chinese":"漫长的等待终于结束了，南非世界杯即将鸣锣开战。"},{"english":"We will wage guerrilla warfare against the Burmese army if conflict breaks out.","chinese":"如果开战，我们会针对缅甸政府军发起游击战。"},{"english":"Edward struck first, and overwhelmed the younger de Montfort.","chinese":"爱德华首先开战，并打败了年轻的孟福尔。"},{"english":"But his move also underscores the frustration of trying to do battle against the amorphous online community.","chinese":"但是他的行动却是试图与整个无组织的网络社区开战。"},{"english":"The White House made no comment Friday on the anniversary of the start of the war.","chinese":"星期五，白宫对伊战开战纪念日无任何评论。"},{"english":"China is despo to show off her military power, looking for a reason to start war.","chinese":"中国急切想炫耀军事实力，正在找一个理由开战。"},{"english":"Zaiyi advised to kill the foreigners and fight against the foreign countries.","chinese":"主张杀洋人，杀教民，与外国开战。"},{"english":"The ancient Greeks sacrificed lambs or calves to the gods before engaging in battle.","chinese":"古希腊人在开战前用羊羔或牛犊祭神。"},{"english":"Warring with the mainstream media is standard republican foolery.","chinese":"对主流媒体开战是共和党典型的愚蠢行为。"},{"english":"Constantine went to war with the other guy on the other side, and he won.","chinese":"君士坦丁和对面的家伙开战，胜利了。"},{"english":"By 1958, Communist-led guerrillas known as the Viet Cong had begun to battle the South Vietnamese government.","chinese":"1958年，越共游击队即越共开始与南越政府开战。"},{"english":"Rukia sighed and started working, for once not trying to start a fight.","chinese":"露琪亚叹了口气，然后开始工作，这一次不要开战。"},{"english":"War of resistance against aggression wins, country in all battle, does Chinese whereto go?","chinese":"抗战胜利，国共开战，中国向何处去？"},{"english":"A TAX dispute as old as mail-order catalogues turned into warfare this month.","chinese":"一项跟邮购目录一样古老的税务纠纷在这个月开战了。"},{"english":"\"Do you disapprove, nanna?\" Justine growled, ready to do battle.","chinese":"“你不赞成吗？外婆？”贾斯丁咆哮着，准备开战了。"}],"related":[{"definition":["(of a sports competition or match) to commence\/(of a war or battle) to break out\/to perform acrobatic or choreographed fighting (in Chinese opera)\/to brawl\/to come to blows"],"pinyin":["kai1 da3"],"word":"开打"},{"definition":["to fight\/to wage war"],"pinyin":["jiao1 zhan4"],"word":"交战"},{"definition":["decisive battle\/to fight a decisive battle\/to fight for supremacy in ..."],"pinyin":["jue2 zhan4"],"word":"决战"},{"definition":["civil war"],"pinyin":["nei4 zhan4"],"word":"内战"},{"definition":["to declare war"],"pinyin":["xuan1 zhan4"],"word":"宣战"},{"definition":["to do battle (with sb)"],"pinyin":["dui4 zhan4"],"word":"对战"},{"definition":["to go to war\/to engage in war"],"pinyin":["can1 zhan4"],"word":"参战"},{"definition":["to fight fiercely\/fierce battle"],"pinyin":["ji1 zhan4"],"word":"激战"},{"definition":["to start a war\/to open hostilities"],"pinyin":["kai1 zhang4"],"word":"开仗"},{"definition":["allied armies"],"pinyin":["lian2 jun1"],"word":"联军"},{"definition":["to pit oneself against sb\/to compete with sb\/contest\/battle\/to haggle\/to quibble"],"pinyin":["jiao4 liang4"],"word":"较量"},{"definition":["chaotic warfare\/confused fighting\/melee\/to join in such fighting"],"pinyin":["hun4 zhan4"],"word":"混战"},{"definition":["to send troops"],"pinyin":["chu1 bing1"],"word":"出兵"},{"definition":["combat\/to fight"],"pinyin":["zuo4 zhan4"],"word":"作战"},{"definition":["to start shooting or firing\/to win an initial success\/to succeed (of a plan)"],"pinyin":["da3 xiang3"],"word":"打响"},{"definition":["powerful enemy"],"pinyin":["qiang2 di2"],"word":"强敌"}]}