{"definition":["to dig out\/to excavate\/to scoop out"],"pinyin":["kai1 wa1"],"traditional":["開挖"],"rank":15910.0,"normalized_rank":0.2226015418409749,"fraction":0.00000371104323008404,"cumulative_fraction":0.9626076774568264,"word":"开挖","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"开"},{"definition":["to dig\/to excavate\/to scoop out"],"pinyin":["wa1"],"word":"挖"}],"containing_words":[],"sentences":[{"english":"This article aims to analyze various processing methods for groundwater excavation of the foundation ditch in earthwork construction.","chinese":"分析土方工程施工中基坑开挖地下水的各种处理办法。"},{"english":"The temporary concrete lining guard wall method was used in excavating vertical shaft.","chinese":"竖井开挖采用了临时混凝士衬砌护壁措施。"},{"english":"At Futang hydropower station, the cylinder restricted surge tank is 31.","chinese":"福堂水电站圆筒阻抗式调压井工程开挖直径31。"},{"english":"In this paper, the excavation work of deep foundation pit for the north concrete anchor of south branch of Runyang Bridge is introduced.","chinese":"介绍了润扬大桥南汊北锚碇深基坑工程开挖实例。"},{"english":"The excavation of inclined shaft was always difficult in the construction of Pumped-Storage Power Station.","chinese":"在抽水蓄能电站中斜井开挖施工历来是一个难点。"},{"english":"The paper will generally analyze and discuss the non-digging pulling pipe construction technology.","chinese":"本文将针对非开挖拉管施工技术进行整体的分析探讨。"},{"english":"The paper has certain refernce value for actual application of blasting excavation of rock in engineering.","chinese":"本文对岩石爆破开挖的实际应用具有一定价值。"},{"english":"High speed decoiler with cantilever support, adopting ground recoiling reduces the heavy labor of excavating a pit.","chinese":"采用高速悬臂开卷，地面放卷，减少开挖地坑之苦。"},{"english":"The excavation of the left-bank diversion tunnel of Longtan Hydropower Project adopts the excavation by layer.","chinese":"龙滩水电站左岸导流洞开挖采用分层开挖法。"},{"english":"The excavation of the left-bank diversion tunnel of Longtan Hydropower Project adopts the excavation by layer.","chinese":"龙滩水电站左岸导流洞开挖采用分层开挖法。"},{"english":"Deep-hole blasting was used to excavate soil-rock in some project in Shenzhen.","chinese":"深圳某土石方开挖工程采用中深孔爆破方式。"},{"english":"Excavate side earth should ensure the stability of the slope and upright.","chinese":"在开挖槽边弃土时，应保证边坡和直立帮的稳定。"},{"english":"Britain had already dug thousands of miles of canals to connect the different shires .","chinese":"英国已经开挖了数千里的运河连接不同的郡。"},{"english":"From the top of the unexcavated acropolis, I had a bird's eye view of the whole city.","chinese":"我从还未开挖的卫城高处俯瞰这整座失落的城市。"},{"english":"Prior to foundation pit excavation, the culvert section shall be prefabricated and carried to position.","chinese":"基坑开挖前涵节预制并按序运至工点摆放。"},{"english":"Tunnel discharge disaster is a severe problem of Zoumaling tunnel.","chinese":"重庆走马岭隧道开挖中岩溶涌水灾害是一个突出问题。"}],"related":[{"definition":["to backfill"],"pinyin":["hui2 tian2"],"word":"回填"},{"definition":["a cofferdam"],"pinyin":["wei2 yan4"],"word":"围堰"},{"definition":["to dig into\/to cut a mine into"],"pinyin":["wa1 kai1"],"word":"挖开"},{"definition":["foundation groove\/trench for building foundation"],"pinyin":["ji1 keng1"],"word":"基坑"},{"definition":["to pilot a ship\/to channel water\/to draw water (for irrigation)"],"pinyin":["yin3 shui3"],"word":"引水"},{"definition":["to dredge"],"pinyin":["shu1 jun4"],"word":"疏浚"},{"definition":["construction\/to carry out construction or large-scale repairs"],"pinyin":["shi1 gong1"],"word":"施工"},{"definition":["to dredge\/to dig out (a channel)"],"pinyin":["shu1 wa1"],"word":"疏挖"},{"definition":["to cut (a canal, tunnel, well etc)"],"pinyin":["kai1 zao2"],"word":"开凿"},{"definition":["to build"],"pinyin":["xiu1 zhu4"],"word":"修筑"},{"definition":["canal"],"pinyin":["shui3 qu2"],"word":"水渠"},{"definition":["underground water channel\/covered ditch\/culvert"],"pinyin":["an4 qu2"],"word":"暗渠"},{"definition":["to install (water pipes, landmines etc) underground"],"pinyin":["mai2 she4"],"word":"埋设"},{"definition":["excavated soil and rock\/construction spoil"],"pinyin":["tu3 shi2 fang1"],"word":"土石方"},{"definition":["to drain flood-water"],"pinyin":["pai2 hong2"],"word":"排洪"},{"definition":["vertical shaft (for mining, ventilation systems etc)"],"pinyin":["shu4 jing3"],"word":"竖井"}]}