{"definition":["open-minded","to open up (windows for air, ideas for discussion, transportation routes etc)"],"pinyin":["kai1 tong5","kai1 tong1"],"traditional":["開通","開通"],"rank":2901.0,"normalized_rank":0.04058875379513943,"fraction":0.000050121126227790695,"cumulative_fraction":0.7858790981357323,"word":"开通","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"开"},{"definition":["to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc","classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)"],"pinyin":["tong1","tong4"],"word":"通"}],"containing_words":[],"sentences":[{"english":"Consider the recent opening of the new, expanded Fairview Container Terminal at the Port of Prince Rupert.","chinese":"最近在鲁伯特王子岛港新开通了怡景集装箱转运站。"},{"english":"Do you require fund transfer services?","chinese":"您是否需要开通银证转帐服务？"},{"english":"You must sign the service agreement before we can go to work.","chinese":"服务开通前您得先签一下这个协议。"},{"english":"1 minute to the airport light rail (up and running by 2011).","chinese":"离2011年底开通的机场轻铁仅1分钟路程。"},{"english":"But setting up a blog is just the first step.","chinese":"话虽如此，开通一个博客却仅仅是第一步。"},{"english":"Within the next three years it hopes to serve the pet jet-set in 25 North American cities.","chinese":"在未来三年里，北美25个城市有望开通宠物航班。"},{"english":"The Panama Canal opened almost one hundred years ago.","chinese":"巴拿马运河开通于近100年前。"},{"english":"1932 - The Sydney Harbour Bridge opens.","chinese":"1932年的今天，悉尼海港大桥开通。"},{"english":"you know, like, paying bills and setting up cable, and you know, talking to doctors.","chinese":"比如，支付账单，开通网络，还有去找医生看病。"},{"english":"And unlike those plans, Virgin lets you turn on service only when you want it.","chinese":"不同于其他方案，维珍让你仅当需要时才开通服务。"},{"english":"Last week China introduced the world's fastest scheduled service between Shanghai and Hangzhou.","chinese":"上周，中国速度最快的高铁沪杭高铁开通了。"},{"english":"With the opening of the bridge, the value of great natural environment in Dinghai becomes increasingly important.","chinese":"随着跨海大桥的开通，定海自然环境的价值日益凸显。"},{"english":"In addition, turn up, or off, the air conditioning or heater during the day.","chinese":"补充一下，在这些天里开通或者关闭，空调和加热器。"},{"english":"For example Nanchang to Shanghai high-speed railway line started generating profits in the first year of its operation after opening to public.","chinese":"比如，南昌到上海的高铁从开通第一年就开始盈利。"},{"english":"The second is diagnosing the closing fault of the train coupling cock.","chinese":"二是监测列车管折角塞门开通关闭状态。"},{"english":"The Confucius Institute Online has opened channels in 9 languages, with 100,000 registered users.","chinese":"网络孔子学院开通9个语种，注册用户达10万人。"}],"related":[{"definition":["special-purpose phone line or communications link\/hotline\/special rail line (e.g. between airport and city)\/CL:條|条[tiao2]"],"pinyin":["zhuan1 xian4"],"word":"专线"},{"definition":["to open to traffic (e.g. new bridge, rail line etc)\/(of a locality) to have a transportation service\/(Tw) to commute"],"pinyin":["tong1 che1"],"word":"通车"},{"definition":["to access (a network)\/to insert (a plug) into (a socket)"],"pinyin":["jie1 ru4"],"word":"接入"},{"definition":["to establish\/to build"],"pinyin":["jian4 cheng2"],"word":"建成"},{"definition":["to be in operation\/to do business\/(of train, bus etc) to be in service\/operation\/service"],"pinyin":["yun4 ying2"],"word":"运营"},{"definition":["to go nonstop to\/through (as in \"through train\")\/nonstop"],"pinyin":["zhi2 da2"],"word":"直达"},{"definition":["high speed rail"],"pinyin":["gao1 tie3"],"word":"高铁"},{"definition":["railroad\/railway\/CL:條|条[tiao2]"],"pinyin":["tie3 lu4"],"word":"铁路"},{"definition":["to change train (plane, bus etc)\/transfer between modes of transport"],"pinyin":["huan4 cheng2"],"word":"换乘"},{"definition":["line\/circuit\/wire\/road\/railway track\/bus route"],"pinyin":["xian4 lu4"],"word":"线路"},{"definition":["(communications) channel\/thoroughfare\/passage","Tongdao Dong autonomous county in Huaihua 懷化|怀化[Huai2 hua4], Hunan"],"pinyin":["tong1 dao4","Tong1 dao4"],"word":"通道"},{"definition":["to put a new bus or railway station into operation"],"pinyin":["kai1 zhan4"],"word":"开站"},{"definition":["to connect\/to communicate\/to relate\/(math.) connected"],"pinyin":["lian2 tong1"],"word":"连通"},{"definition":["website"],"pinyin":["zhan4 dian3"],"word":"站点"},{"definition":["to access\/to transfer passengers between two railway lines"],"pinyin":["jie1 bo2"],"word":"接驳"},{"definition":["to bloom\/to open\/to be open (to the public)\/to open up (to the outside)\/to be open-minded\/unrestrained by convention\/unconstrained in one's sexuality"],"pinyin":["kai1 fang4"],"word":"开放"}]}