{"definition":["rarity\/rare delicacy\/foreign matter\/alien body\/the dead\/ghost\/monstrosity\/alien life-form"],"pinyin":["yi4 wu4"],"traditional":["異物"],"rank":18884.0,"normalized_rank":0.26421166034726395,"fraction":0.000002681609005453694,"cumulative_fraction":0.9720058874300878,"word":"异物","characters":[{"definition":["different\/other\/hetero-\/unusual\/strange\/surprising\/to distinguish\/to separate\/to discriminate"],"pinyin":["yi4"],"word":"异"},{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"}],"containing_words":[],"sentences":[{"english":"Objective To study the diagnostic value of diaphragm activity range to foreign body transmitted X-rays in bronchus.","chinese":"目的评价横膈动度对透X线性支气管异物的诊断价值。"},{"english":"Stage-16 Stator Vane was damaged by foreign objects on several places.","chinese":"压气机第16级有多处静叶受异物打击受损。"},{"english":"Objective To explore the new technique on extracting anterior segment nonmagnetic foreign bodies.","chinese":"目的探讨眼前段非磁性异物摘出的方法。"},{"english":"Huge rash can cause local foreign body sensation or because of friction and cause pain.","chinese":"巨大皮疹可引起局部异物感或因摩擦而引起疼痛。"},{"english":"Summerized the key nursing methods of removing the tracheobronchial foreign bodies in children.","chinese":"总结了小儿气管支气管异物取出术的护理要点。"},{"english":"Wax or foreign bodies blocking the ear canal can cause hearing loss at any age.","chinese":"蜡或异物阻塞耳道在任何年龄都会造成听力丧失。"},{"english":"Sutures are foreign bodies but a necessary adjunct in surgery .","chinese":"缝线是一种异物，但是一种在手术中必要的附属品。"},{"english":"There is the seam relation between some peculiar objects appear or disappear and the mode that the family poorness when its treasure lost.","chinese":"其三，某一异物的出现与消失，也与物因宝失家贫。"},{"english":"So attention should be paid to the different names of the same substance and th…","chinese":"这种同物异名和同名异物的情况，应引起注意。"},{"english":"Objective To investigate the surgery skill in examination and extraction of pharyngolaryneal foreign body(PFB).","chinese":"目的探讨咽喉部异物检查及取出的方法和技巧。"},{"english":"\"Thirty-eight hundred?\" I repeated, with a catch in my throat.","chinese":"“三千八？”我重复道，好像有异物卡住了嗓子一样。"},{"english":"A large skin rash can cause local foreign body sensation or cause pain due to friction.","chinese":"巨大皮疹可引起局部异物感或因摩擦而引起疼痛。"},{"english":"Swallow the eyewinker is in mental person and many seeing.","chinese":"吞服异物在精神病人中并不少见。"},{"english":"The pipe ends are sealed with cups to prevent ingress of foreign objectives.","chinese":"管端应加盖密封防止异物进入。"},{"english":"Lashes trap debris and dirt, preventing it from coming in contact with our eyes, which could cause injuries.","chinese":"睫毛能够阻止灰尘及异物进入眼睛，从而损伤眼睛。"},{"english":"Objective To observe the clinical effects of bFGF after extraction of corneal foreign body.","chinese":"目的观察角膜异物剔除术后贝复舒治疗的临床效果。"}],"related":[{"definition":["windpipe\/trachea\/respiratory tract\/air duct\/gas pipe"],"pinyin":["qi4 guan3"],"word":"气管"},{"definition":["secretion"],"pinyin":["fen1 mi4 wu4"],"word":"分泌物"},{"definition":["esophagus\/the proper way to eat\/food transportation route"],"pinyin":["shi2 dao4"],"word":"食道"},{"definition":["anus"],"pinyin":["gang1 men2"],"word":"肛门"},{"definition":["vomit"],"pinyin":["ou3 tu4 wu4"],"word":"呕吐物"},{"definition":["digestive tract"],"pinyin":["xiao1 hua4 dao4"],"word":"消化道"},{"definition":["mucus"],"pinyin":["nian2 ye4"],"word":"黏液"},{"definition":["saliva\/spittle"],"pinyin":["tan2 ye4"],"word":"痰液"},{"definition":["bronchial tube\/bronchus"],"pinyin":["zhi1 qi4 guan3"],"word":"支气管"},{"definition":["external auditory meatus\/auditory canal, between the outer ear 外耳 and tympanum 鼓膜"],"pinyin":["wai4 er3 dao4"],"word":"外耳道"},{"definition":["intestine\/gut"],"pinyin":["chang2 guan3"],"word":"肠管"},{"definition":["abdominal cavity"],"pinyin":["fu4 qiang1"],"word":"腹腔"},{"definition":["fishbone"],"pinyin":["yu2 ci4"],"word":"鱼刺"},{"definition":["remnant\/residue\/material left over"],"pinyin":["can2 liu2 wu4"],"word":"残留物"},{"definition":["to hamper\/to obstruct"],"pinyin":["geng3 zu3"],"word":"梗阻"},{"definition":["esophagus"],"pinyin":["shi2 guan3"],"word":"食管"}]}