{"definition":["to lead to\/to trigger\/to initiate\/to cause\/to evoke (emotions)"],"pinyin":["yin3 fa1"],"traditional":["引發"],"rank":1637.0,"normalized_rank":0.02290375386509591,"fraction":0.00009711482777769134,"cumulative_fraction":0.6991860859612495,"word":"引发","characters":[{"definition":["to draw (e.g. a bow)\/to pull\/to stretch sth\/to extend\/to lengthen\/to involve or implicate in\/to attract\/to lead\/to guide\/to leave\/to provide evidence or justification for\/old unit of distance equal to 10 丈[zhang4], one-thirtieth of a km or 33.33 meters"],"pinyin":["yin3"],"word":"引"},{"definition":["hair\/Taiwan pr. [fa3]","to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa4","fa1"],"word":"发"}],"containing_words":[],"sentences":[{"english":"And the NMD program is, in essence, an U.S. program of unilateral nuclear expansion, which harbors the inherent danger of triggering an arms race at a higher level.","chinese":"美国此举显然孕育着引发更高水平上军备竞赛的危险。"},{"english":"The crack initiation time determined the composite's toughness.","chinese":"木粉对裂纹引发时间的影响最为显著。"},{"english":"Looking at the artistic creations of Pan Li-hong gave rise to a series of thoughts.","chinese":"看了潘丽红的美术创作，引发一连串的思考。"},{"english":"The research could lead to new therapies for preventing cancer metastasis.","chinese":"这项研究将会引发癌转移的新疗法。"},{"english":"It seems likely that this protein will attract a great deal more analgesic research.","chinese":"这种蛋白质可能会引发更多的镇痛剂研究。"},{"english":"This will initiate a neurological chain reaction that will help move us in the right direction.","chinese":"这将引发一些列能将我们引导到正确方向的连锁反应。"},{"english":"The flooding reignites one of the key debates over the construction of the Three Gorges Dam.","chinese":"洪灾重新引发了就建设三峡大坝的主要争议之一。"},{"english":"The virus triggered myocarditis, a serious inflammation of the heart muscle.","chinese":"这些病毒引发心肌炎，对心脏肌肉造成严重的炎症。"},{"english":"S. was considering compulsory Iraq service for its diplomatic corps, but thee-mails sparked outrage nevertheless.","chinese":"但是，这些电子邮件还是引发了一片愤怒。"},{"english":"This makes you pause for a minute and think.","chinese":"这让你停顿了一下，并引发了你的思考。"},{"english":"A bad padlock invites a picklock.","chinese":"一个劣质的挂锁引发一个撬锁者。"},{"english":"It could aggravate the symptoms by amplifying the very inflammatory agents that cause them.","chinese":"这会增加引发这些症状的炎性因子进而加剧症状。"},{"english":"The psychological effects often exacerbate health problems that the physiological stress response has already caused.","chinese":"心理作用通常加剧了生理负担早已引发的健康问题。"},{"english":"Gaudy art caused a lot of disputes in society.","chinese":"艳俗艺术在社会上引发了许多争论。"},{"english":"Aphrodite was the goddess who triggered the Trojan War.","chinese":"阿佛罗狄忒是引发特洛伊战争的女神。"},{"english":"Mr Obama's agricultural policies also resonate beyond rural counties.","chinese":"奥巴马的农业政策同样在农业县外引发共鸣。"}],"related":[{"definition":["to give rise to\/to lead to\/to cause\/to arouse"],"pinyin":["yin3 qi3"],"word":"引起"},{"definition":["to lead to\/to create\/to cause\/to bring about"],"pinyin":["dao3 zhi4"],"word":"导致"},{"definition":["to bring about\/to create\/to cause"],"pinyin":["zao4 cheng2"],"word":"造成"},{"definition":["to intensify\/to sharpen\/to accelerate\/to aggravate\/to exacerbate\/to embitter"],"pinyin":["jia1 ju4"],"word":"加剧"},{"definition":["to arise\/to come into being\/to come about\/to give rise to\/to bring into being\/to bring about\/to produce\/to engender\/to generate\/to appear\/appearance\/emergence\/generation\/production\/yield"],"pinyin":["chan3 sheng1"],"word":"产生"},{"definition":["to discuss passionately\/heated debate"],"pinyin":["re4 yi4"],"word":"热议"},{"definition":["chain reaction"],"pinyin":["lian2 suo3 fan3 ying4"],"word":"连锁反应"},{"definition":["to recruit (followers)\/to scout for (talent etc)\/to incur\/to lead to"],"pinyin":["zhao1 zhi4"],"word":"招致"},{"definition":["to happen\/to occur\/to take place\/to break out"],"pinyin":["fa1 sheng1"],"word":"发生"},{"definition":["to cause to burn\/to ignite\/to detonate\/a fuse"],"pinyin":["yin3 bao4"],"word":"引爆"},{"definition":["hereby\/from this"],"pinyin":["you2 ci3"],"word":"由此"},{"definition":["to appear\/to arise\/to emerge\/to show up"],"pinyin":["chu1 xian4"],"word":"出现"},{"definition":["event\/happening\/incident\/CL:個|个[ge4]"],"pinyin":["shi4 jian4"],"word":"事件"},{"definition":["old variant of 因[yin1]","cause\/reason\/because"],"pinyin":["yin1","yin1"],"word":"因"},{"definition":["and then (what follows next)"],"pinyin":["jin4 er2"],"word":"进而"},{"definition":["to lift\/to raise in height\/to begin\/upsurge\/to set off (a campaign)"],"pinyin":["xian1 qi3"],"word":"掀起"}]}