{"definition":["to extend (the meaning of a word, an analogy etc)\/derivation"],"pinyin":["yin3 shen1"],"traditional":["引申"],"rank":26953.0,"normalized_rank":0.3771074391728345,"fraction":0.0000012421236269681808,"cumulative_fraction":0.9869410102510691,"word":"引申","characters":[{"definition":["to draw (e.g. a bow)\/to pull\/to stretch sth\/to extend\/to lengthen\/to involve or implicate in\/to attract\/to lead\/to guide\/to leave\/to provide evidence or justification for\/old unit of distance equal to 10 丈[zhang4], one-thirtieth of a km or 33.33 meters"],"pinyin":["yin3"],"word":"引"},{"definition":["to extend\/to state\/to explain\/9th earthly branch: 3-5 p.m., 7th solar month (7th August-7th September), year of the Monkey\/ancient Chinese compass point: 240°","old name for Shanghai 上海[Shang4 hai3]\/surname Shen"],"pinyin":["shen1","Shen1"],"word":"申"}],"containing_words":[{"definition":["extended meaning (of an expression)\/derived sense"],"pinyin":["yin3 shen1 yi4"],"word":"引申义"}],"sentences":[{"english":"“Never lie” also can be extended as “Don’t mask truths.","chinese":"“不要说谎”也可以引申为“不掩饰真相”。"},{"english":"Many connotations are developed on the basis of this denotation in the mediaeval times.","chinese":"中古汉语时期，由此基本义产生出许多引申义。"},{"english":"The extensional meaning of compound directional complement has its cognitive basis.","chinese":"复合趋向补语的引申意义有其认知上的理据。"},{"english":"This extends naturally to the pleasures of the imagination.","chinese":"这也就很自然引申到想象的乐趣。"},{"english":"For more details on issues and does not serve to extend the scope of discussion.","chinese":"至于更多的细节性问题和引申不作为本文的讨论范畴。"},{"english":"According to the relation of sememes, a word has both original meaning and extended meaning.","chinese":"从词义义位之间的关系看，词有本义和引申义。"},{"english":"A word's meaning is made up of both denotation and connotation.","chinese":"一个单词的含义是由表面义和引申义组成的。"},{"english":"This story gave rise to the idiom \"be wholeheartedly devoted to public duty.\"","chinese":"人们根据这个故事引申出“克己奉公”这句成语。"},{"english":"It is generally difficult for foreigners to grasp the extended meanings of Chinese words.","chinese":"外国人一般很难掌握中国词语的引申义。"},{"english":"She extracted a completely personal meaning from what was said.","chinese":"她从所说的话里引申出一个完全是个人的意思。"},{"english":"Finally, Dayu flood control extended the basic framework for the legal administration.","chinese":"最后，以大禹治水引申法治行政的基本框架。"},{"english":"Since then, from this story come out of the ghost is said Mahogany.","chinese":"此后，从这个故事中引申出了鬼怪桃木之说。"},{"english":"Furthermore, it presents a creditability problem about theorem proof in propositional logic.","chinese":"也引申出命题逻辑定理证明的一个可信性问题。"},{"english":"It has to be a two-way street.","chinese":"一条双向道，有来有往，引申为互相忍让。"},{"english":"In a word, extended sememes are a result of the motion and changing of these sememes .","chinese":"引申义的形成实际上就是这些义素运动变化的结果。"},{"english":"The second kind of newly-coined words is formed by the extension of word meanings.","chinese":"第二种新造词主要是通过词义的引申而形成的。"}],"related":[{"definition":["extended meaning (of an expression)\/derived sense"],"pinyin":["yin3 shen1 yi4"],"word":"引申义"},{"definition":["original meaning\/literal sense"],"pinyin":["ben3 yi4"],"word":"本义"},{"definition":["to refer to\/to be used in place of"],"pinyin":["zhi3 dai4"],"word":"指代"},{"definition":["to mean\/to imply"],"pinyin":["yi4 zhi3"],"word":"意指"},{"definition":["original meaning"],"pinyin":["yuan2 yi4"],"word":"原义"},{"definition":["to give rise to\/to derive\/derivative\/derivation"],"pinyin":["yan3 sheng1"],"word":"衍生"},{"definition":["meaning of a word"],"pinyin":["ci2 yi4"],"word":"词义"},{"definition":["to compare\/to liken to\/metaphor\/analogy\/figure of speech\/figuratively"],"pinyin":["bi3 yu4"],"word":"比喻"},{"definition":["the meaning of a phonetic loan character 假借字[jia3 jie4 zi4] acquired from a similar-sounding word (e.g. 而[er2] originally meant \"beard\" but acquired the meaning \"and\")"],"pinyin":["jia3 jie4 yi4"],"word":"假借义"},{"definition":["to sum up\/to summarize\/to conclude from facts\/induction (method of deduction in logic)"],"pinyin":["gui1 na4"],"word":"归纳"},{"definition":["to make a general reference\/to be used in a general sense"],"pinyin":["fan4 zhi3"],"word":"泛指"},{"definition":["the meaning of sth\/an explanation of the meaning of words or phrases\/definition\/an interpretation (of doctrine)\/religious doctrine"],"pinyin":["shi4 yi4"],"word":"释义"},{"definition":["to produce (from sth else)\/to derive (from raw material)\/derivative"],"pinyin":["pai4 sheng1"],"word":"派生"},{"definition":["to explain\/to expound\/to interpret\/elucidation"],"pinyin":["chan3 shi4"],"word":"阐释"},{"definition":["to elucidate\/to expound\/to study and explain"],"pinyin":["chan3 fa1"],"word":"阐发"},{"definition":["content\/meaning\/connotation\/implication"],"pinyin":["han2 yi4"],"word":"涵义"}]}