{"definition":["to invite trouble"],"pinyin":["yin3 huo3 shao1 shen1"],"traditional":["引火燒身"],"rank":44782.0,"normalized_rank":0.6265582807493739,"fraction":2.4392861448628865e-7,"cumulative_fraction":0.9979671789226136,"word":"引火烧身","characters":[{"definition":["to draw (e.g. a bow)\/to pull\/to stretch sth\/to extend\/to lengthen\/to involve or implicate in\/to attract\/to lead\/to guide\/to leave\/to provide evidence or justification for\/old unit of distance equal to 10 丈[zhang4], one-thirtieth of a km or 33.33 meters"],"pinyin":["yin3"],"word":"引"},{"definition":["fire\/urgent\/ammunition\/fiery or flaming\/internal heat (Chinese medicine)\/hot (popular)\/classifier for military units (old)\/Kangxi radical 86","surname Huo"],"pinyin":["huo3","Huo3"],"word":"火"},{"definition":["to burn\/to cook\/to stew\/to bake\/to roast\/to heat\/to boil (tea, water etc)\/fever\/to run a temperature\/(coll.) to let things go to one's head"],"pinyin":["shao1"],"word":"烧"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"}],"containing_words":[],"sentences":[{"english":"Or it is like holding onto hot coals, but you're the one getting burned.","chinese":"或许这就像手持热炭，你却引火烧身。"},{"english":"Anything sort of that we're going to burn you 11)at the stake\"?\"","chinese":"任何此类行为将会是引火烧身”？"},{"english":"Venture capitalists are right to warn entrepreneurs of getting caught with their pants singed.","chinese":"风投资本家警告创业者勿“引火烧身”，这是对的。"},{"english":"The un skilled novice can misuse the principle and get himself fired quite easily.","chinese":"拍得技巧不够可能会适得其反，很容易引火烧身。"}],"related":[{"definition":["stir up the fire and you get burnt (idiom); to get one's fingers burnt\/fig. to suffer on account of one's own meddling"],"pinyin":["re3 huo3 shao1 shen1"],"word":"惹火烧身"},{"definition":["to play with fire and get burnt (idiom); fig. to play with evil and suffer the consequences\/to get one's fingers burnt"],"pinyin":["wan2 huo3 zi4 fen2"],"word":"玩火自焚"},{"definition":["to hand someone the swordhilt (idiom)\/to give someone a hold on oneself"],"pinyin":["shou4 ren2 yi3 bing3"],"word":"授人以柄"},{"definition":["to offend"],"pinyin":["re3 nao3"],"word":"惹恼"},{"definition":["a cornered dog will jump over the wall (idiom)\/to be driven to desperate action"],"pinyin":["gou3 ji2 tiao4 qiang2"],"word":"狗急跳墙"},{"definition":["to overreach oneself\/to try to be clever and end up with egg on one's face"],"pinyin":["nong4 qiao3 cheng2 zhuo1"],"word":"弄巧成拙"},{"definition":["to pour oil on the fire (idiom); fig. to aggravate a situation\/to enrage people and make matters worse"],"pinyin":["huo3 shang4 jiao1 you2"],"word":"火上浇油"},{"definition":["to anger sb\/to enrage"],"pinyin":["chu4 nu4"],"word":"触怒"},{"definition":["to court disaster (idiom)\/to dig one's own grave"],"pinyin":["zi4 qu3 mie4 wang2"],"word":"自取灭亡"},{"definition":["lit. to try to steal a chicken only to end up losing the rice used to lure it (idiom)\/fig. to try to gain an advantage only to end up worse off\/to go for wool and come back shorn"],"pinyin":["tou1 ji1 bu4 cheng2 shi2 ba3 mi3"],"word":"偷鸡不成蚀把米"},{"definition":["to provoke anger"],"pinyin":["re3 nu4"],"word":"惹怒"},{"definition":["a conflict arises close to home (idiom)"],"pinyin":["hou4 yuan4 qi3 huo3"],"word":"后院起火"},{"definition":["to ask for trouble\/to invite difficulties"],"pinyin":["zi4 zhao3 ma2 fan5"],"word":"自找麻烦"},{"definition":["to crush one's own foot while trying to maneuver a rock (to a cliff edge, to drop on one's enemy) (idiom)\/hoisted by one's own petard"],"pinyin":["ban1 qi3 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬起石头砸自己的脚"},{"definition":["a new branch grows out of a knot (idiom); fig. side issues keep arising"],"pinyin":["jie2 wai4 sheng1 zhi1"],"word":"节外生枝"},{"definition":["to offend sb\/to give offense\/to displease"],"pinyin":["kai1 zui4"],"word":"开罪"}]}