{"definition":["to dissipate everywhere (of light, sound, gas etc)"],"pinyin":["mi2 san4"],"traditional":["彌散"],"rank":36873.0,"normalized_rank":0.5159011095098849,"fraction":5.129653807928296e-7,"cumulative_fraction":0.9950930997299376,"word":"弥散","characters":[{"definition":["full\/to fill\/completely\/more","brimming or overflowing"],"pinyin":["mi2","mi2"],"word":"弥"},{"definition":["scattered\/loose\/to come loose\/to fall apart\/leisurely\/powdered medicine","to scatter\/to break up (a meeting etc)\/to disperse\/to disseminate\/to dispel\/(coll.) to sack","variant of 散[san4]"],"pinyin":["san3","san4","san4"],"word":"散"}],"containing_words":[],"sentences":[{"english":"The wave are of course dispersive.","chinese":"当然这种波是弥散的。"},{"english":"When the clouds break months, will offer all kinds of knot wind dispersed in the sea the sky.","chinese":"当云破月来，千般纠结都将随风弥散在水际云天。"},{"english":"In Darcy flow , dispersion decreases as the permeability coefficient increases.","chinese":"在达西流阶段，弥散度随着渗透系数增大而减小。"},{"english":"Non-tension method and smeared crack model is applied to the analysis of concrete cracking.","chinese":"引入无拉力法和弥散裂缝分析混凝土开裂。"},{"english":"Those forces permeated the Chinese government, from local functionaries all the way to Beijing.","chinese":"这种力量弥散在中国整个政府系统，从地方直到中央。"},{"english":"Active foci of demyelination may demonstrate restricted diffusion.","chinese":"脱髓鞘的活动性的病灶可以显示为弥散受限。"},{"english":"Objective To explore the diagnosis and treatment of diffuse axonal injury(DAI).","chinese":"目的探讨弥散性轴索损伤的诊断与治疗。"},{"english":"In multipath environments, ultra-wide band signals suffer from severe time dispretion.","chinese":"超宽带信号经多径信道传播会产生严重的时间弥散。"},{"english":"The forgeability of dispersion-strengthened copper material with high strength and high conductivity is studied.","chinese":"对高强高导弥散强化铜材料的可锻性进行了实验研究。"},{"english":"When blood vessels connect to form a region of diffuse vascular supply it is called an anastomosis (pl. anastomoses).","chinese":"血管联结构成一弥散性维管联结区，即并接。"},{"english":"Lattice Orthogonal Frequency Division Multiplexing(LOFDM) is a promising technique for high data-rate transmission in double(namely time-frequency) dispersive channel.","chinese":"是时频弥散信道上的一种高速数据传输技术。"},{"english":"The immunoreactive products were diffusely distributed in the cytoplasm.","chinese":"免疫反应产物弥散分布于胞浆内。"},{"english":"The effect of modifying and dispersion treatment on the structure and properties of high Mn steel is studied in this paper.","chinese":"研究了变质和弥散处理对高锰钢组织和性能的影响。"},{"english":"To the east, the first pale light of day suffused the sky above the river.","chinese":"东边第一缕苍白的日光弥散在河的上空。"},{"english":"Galactic nebulas are masses of diffuse material within our galaxy .","chinese":"银河星云是我们星系中的一团团弥散物。"},{"english":"An air passageway leading from the powder location to the dispersion chamber is closed off by the cover.","chinese":"从粉末场所通到弥散腔的空气通道被盖件封闭。"}],"related":[{"definition":["to pervade\/to fill the air\/diffuse\/everywhere present\/about to inundate (water)\/permeated by (smoke)\/filled with (dust)\/to saturate (the air with fog, smoke etc)","variant of 彌漫|弥漫[mi2 man4]"],"pinyin":["mi2 man4","mi2 man4"],"word":"弥漫"},{"definition":["to waft (through the air)\/to drift"],"pinyin":["piao1 san4"],"word":"飘散"},{"definition":["dense (of smoke, mist)"],"pinyin":["yin1 yun1"],"word":"氤氲"},{"definition":["to rise\/to ascend\/to leap up"],"pinyin":["sheng1 teng2"],"word":"升腾"},{"definition":["to curl up\/to linger on (sound)"],"pinyin":["liao2 rao4"],"word":"缭绕"},{"definition":["to drift\/to wave\/to float on the waves\/to flutter in the wind"],"pinyin":["piao1 dang4"],"word":"飘荡"},{"definition":["to spill out"],"pinyin":["san4 chu1"],"word":"散出"},{"definition":["to vaporize\/to dispel"],"pinyin":["yi4 san4"],"word":"逸散"},{"definition":["(of a vapor etc) to rise\/to hang in the air"],"pinyin":["zheng1 teng2"],"word":"蒸腾"},{"definition":["dispersal"],"pinyin":["san4 yi4"],"word":"散逸"},{"definition":["vast haze\/lost in boundless mists"],"pinyin":["mi2 man4"],"word":"迷漫"},{"definition":["(of a perfume or a foul odor) permeating the whole place\/(of grease etc) dripping everywhere\/flowing all over the place"],"pinyin":["si4 yi4"],"word":"四溢"},{"definition":["to overflow\/to be brimming over"],"pinyin":["man4 yi4"],"word":"漫溢"},{"definition":["to ripple\/to undulate","to ripple\/to undulate\/also written 蕩漾|荡漾"],"pinyin":["dang4 yang4","dang4 yang4"],"word":"荡漾"},{"definition":["congestion\/to block\/to congest\/to crowd\/to choke\/to cram\/to fill up\/to stuff\/to take up all the space"],"pinyin":["chong1 se4"],"word":"充塞"},{"definition":["strong (taste, flavor, smell)"],"pinyin":["nong2 lie4"],"word":"浓烈"}]}