{"definition":["winding road\/road curve"],"pinyin":["wan1 dao4"],"traditional":["彎道"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"弯道","characters":[{"definition":["to bend\/bent\/a bend\/a turn (in the road etc)\/CL:道[dao4]"],"pinyin":["wan1"],"word":"弯"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"}],"containing_words":[{"definition":["to overtake on a bend (driving)\/(fig.) taking opportunity of tight corners to make swift progress (economy etc)"],"pinyin":["wan1 dao4 chao1 che1"],"word":"弯道超车"}],"sentences":[{"english":"A curved margin of a highway was reflectorized for safety.","chinese":"为安全起见公路的弯道边上装设了反射镜。"},{"english":"Prefabricated modular bays of hot dip galvanized balustrading are constructed off site.","chinese":"热沾电渡栏杆的预制弯道模型是建造在场所之外的。"},{"english":"Bi-xenon headlights, dynamic headlight range adjustment, with fixed bending light.","chinese":"双氙气大灯，照明范围自动调节，带静态弯道照明。"},{"english":"You'll also want to avoid tight turns, so look for slow curves and straight paths.","chinese":"还要避免急转弯，所以尽量寻找温和的弯道和直道。"},{"english":"Hairpin followed hairpin, rainforest gave way to pine.","chinese":"经过一个接一个的U形弯道，松树林取代了雨林。"},{"english":"I lost ground at turn four on the first lap, and [Nico] Rosberg got past me.","chinese":"在第一圈的第四个弯道罗斯伯格超过了我。"},{"english":"Eg - they brake too late and wash out wide of the apex and have to reduce speed etc.","chinese":"他们刹车太晚冲过弯道顶点并减速。"},{"english":"Last year the highway was redesigned to broaden the curves and improve roadway visibility.","chinese":"去年高速公路进行了改造，加宽了弯道并改善了视野。"},{"english":"The rollover accident happened at a curve just 9 km from the start point.","chinese":"翻车发生在距离出发点9公里左右的一个弯道。"},{"english":"Start your turn by slowly edging your skis , keep an anticipated re-position until you reach halfway.","chinese":"通过慢慢立刃来开始转弯，沿预定路线进入弯道。"},{"english":"As I said, it's one corner with two kerbs.","chinese":"正如我说过的，这是一个带两个路肩的弯道。"},{"english":"At the curve in the road where his cab had caught fire, the interstate was streaked with black ash.","chinese":"在他的卡车着火的弯道，洲际公路上都是黑灰。"},{"english":"Straights of varying length and curves of varying degrees appear automatically.","chinese":"长短不一的直轨和不同弧度的弯道会自动出现。"},{"english":"This hole has a dogleg to the left.","chinese":"这个球洞有个朝左的弯道。"},{"english":"The flow in open channel bends is one of the most familiar forms in hydropower projects.","chinese":"明渠弯道水流是工程实际中经常碰到的一种水流形式。"},{"english":"The curve equations are also shown in this paper.","chinese":"给出与之相匹配的该机头尾星轮弯道曲线方程。"}],"related":[{"definition":["to make a sudden turn"],"pinyin":["ji2 zhuan3 wan1"],"word":"急转弯"},{"definition":["to turn\/to go around a corner"],"pinyin":["zhuan3 wan1"],"word":"转弯"},{"definition":["downhill"],"pinyin":["xia4 po1"],"word":"下坡"},{"definition":["road on a slope\/inclined path\/ramp"],"pinyin":["po1 dao4"],"word":"坡道"},{"definition":["steep incline\/water chute\/sluice"],"pinyin":["dou3 po1"],"word":"陡坡"},{"definition":["uphill\/upslope\/to move upwards\/to climb a slope"],"pinyin":["shang4 po1"],"word":"上坡"},{"definition":["to overtake (another car)"],"pinyin":["chao1 che1"],"word":"超车"},{"definition":["to go round a curve\/to turn a corner\/fig. a new direction"],"pinyin":["guai3 wan1"],"word":"拐弯"},{"definition":["vehicle speed"],"pinyin":["che1 su4"],"word":"车速"},{"definition":["to brake (when driving)\/to stop\/to switch off\/to check (bad habits)\/a brake"],"pinyin":["sha1 che1"],"word":"刹车"},{"definition":["(of two vehicles traveling in opposite directions) to pass by each other"],"pinyin":["hui4 che1"],"word":"会车"},{"definition":["drifting (motorsport)"],"pinyin":["shuai3 wei3"],"word":"甩尾"},{"definition":["to skid\/to slip\/to slide"],"pinyin":["da3 hua2"],"word":"打滑"},{"definition":["traffic lane\/driveway"],"pinyin":["che1 dao4"],"word":"车道"},{"definition":["to change lanes"],"pinyin":["bian4 dao4"],"word":"变道"},{"definition":["road condition(s) (e.g. surface, traffic flow etc)"],"pinyin":["lu4 kuang4"],"word":"路况"}]}