{"definition":["to accuse of misconduct (in official task)\/to impeach"],"pinyin":["tan2 he2"],"traditional":["彈劾"],"rank":20002.0,"normalized_rank":0.2798539308550082,"fraction":0.000002392865259520792,"cumulative_fraction":0.9748428348777284,"word":"弹劾","characters":[{"definition":["to pluck (a string)\/to play (a string instrument)\/to spring or leap\/to shoot (e.g. with a catapult)\/(of cotton) to fluff or tease\/to flick\/to flip\/to accuse\/to impeach\/elastic (of materials)","crossball\/bullet\/shot\/shell\/ball"],"pinyin":["tan2","dan4"],"word":"弹"},{"definition":["to impeach"],"pinyin":["he2"],"word":"劾"}],"containing_words":[],"sentences":[{"english":"HW1. The Illinois House impeaches Governor Rod Blagojevich.","chinese":"伊利诺亚州众议院弹劾了州长罗德。"},{"english":"The Senate shall have the sole Power to try all Impeachments.","chinese":"唯参议院具有审判一切弹劾案之权。"},{"english":"It takes a simple majority of representatives’ votes to impeach an official.","chinese":"弹劾案的通过只需要过半众议员投赞成票。"},{"english":"He believes it should be easier to sack judges.","chinese":"他认为应该能更容易地弹劾法官。"},{"english":"\"Impeachment of the president is clearly the end goal for the left, \" Mr. Hannity added.","chinese":"“弹劾总统显然是左派的最终目标，”汉尼提还说。"},{"english":"If the House votes for impeachment, the case then goes to the Senate.","chinese":"弹劾案在众议院通过后即转交参议院审理。"},{"english":"In eight years, she battled impeachment attempts and attempts of a military takeover.","chinese":"八年来，她挫败了弹劾她以及军事接管的企图。"},{"english":"Eunuchs for impeachment after being exiled Shuofang.","chinese":"后因弹劾宦官，被流放朔方。"},{"english":"So what do you have to do to get impeached?","chinese":"那么，你有没有这样做，以获得弹劾？"},{"english":"Impeachment Trials The Senate shall have the sole power to try all impeachments .","chinese":"在开庭审理弹劾案时，参议员们均应宣誓或誓愿。"},{"english":"This is why impeachment is \"off the table.\"","chinese":"这就是为什么克林顿弹劾案是“小康之列。"},{"english":"In the case of an impeached president, the chief justice of the Supreme Court presides over the trial.","chinese":"如果弹劾对象为总统，则由最高法院首席大法官主审。"},{"english":"The House of Representatives shall choose their Speaker and other officers; and shall have the sole power of impeachment.","chinese":"众议院选举本院议长和其他官员，并独自拥有弹劾权。"},{"english":"Another, Shamsoddin Hosseini, the finance minister, narrowly survived a bid to have him impeached.","chinese":"另一位盟友，伊朗经济财政部长侯赛尼也险遭弹劾。"},{"english":"The President's impeachment process is once in a blue moon in the U. S. history.","chinese":"总统弹劾案在美国历史上是很少见的。"},{"english":"Following the trial, senators vote on the articles of impeachment.","chinese":"听证结束后，参议员们对弹劾条款进行投票。"}],"related":[{"definition":["to accuse\/to impeach\/(in imperial China) to level charges against an official"],"pinyin":["can1 he2"],"word":"参劾"},{"definition":["imperial censor (formal title of a dynastic official)"],"pinyin":["yu4 shi3"],"word":"御史"},{"definition":["imperial censor"],"pinyin":["yan2 guan1"],"word":"言官"},{"definition":["to remove sb from their post\/to dismiss"],"pinyin":["ba4 mian3"],"word":"罢免"},{"definition":["to dismiss from office\/to ban\/to reject"],"pinyin":["ba4 chu4"],"word":"罢黜"},{"definition":["to imprison"],"pinyin":["xia4 yu4"],"word":"下狱"},{"definition":["(government) cabinet"],"pinyin":["nei4 ge2"],"word":"内阁"},{"definition":["North Korea-China"],"pinyin":["Chao2 Zhong1"],"word":"朝中"},{"definition":["to sack\/to remove from a position\/to depose"],"pinyin":["ge2 zhi2"],"word":"革职"},{"definition":["to dismiss from office\/to resign from office"],"pinyin":["ba4 guan1"],"word":"罢官"},{"definition":["(of a court official) to present a memorial to the emperor (old)"],"pinyin":["shang4 shu1"],"word":"上疏"},{"definition":["political enemy\/opponent"],"pinyin":["zheng4 di2"],"word":"政敌"},{"definition":["henchmen"],"pinyin":["dang3 yu3"],"word":"党羽"},{"definition":["court councilor"],"pinyin":["chao2 chen2"],"word":"朝臣"},{"definition":["memorial to the emperor (folded in accordion form)"],"pinyin":["zou4 zhe2"],"word":"奏折"},{"definition":["Director of Board of Rites (Confucian)"],"pinyin":["li3 bu4 shang4 shu1"],"word":"礼部尚书"}]}