{"definition":["out of ammunition and no food left (idiom); in desperate straits"],"pinyin":["dan4 jin4 liang2 jue2"],"traditional":["彈盡糧絕"],"rank":41666.0,"normalized_rank":0.5829613980104376,"fraction":3.2830368281248545e-7,"cumulative_fraction":0.997080765839967,"word":"弹尽粮绝","characters":[{"definition":["to pluck (a string)\/to play (a string instrument)\/to spring or leap\/to shoot (e.g. with a catapult)\/(of cotton) to fluff or tease\/to flick\/to flip\/to accuse\/to impeach\/elastic (of materials)","crossball\/bullet\/shot\/shell\/ball"],"pinyin":["tan2","dan4"],"word":"弹"},{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely","to the greatest extent\/(when used before a noun of location) furthest or extreme\/to be within the limits of\/to give priority to"],"pinyin":["jin4","jin3"],"word":"尽"},{"definition":["grain\/food\/provisions\/agricultural tax paid in grain"],"pinyin":["liang2"],"word":"粮"},{"definition":["to cut short\/extinct\/to disappear\/to vanish\/absolutely\/by no means","variant of 絕|绝[jue2]"],"pinyin":["jue2","jue2"],"word":"绝"}],"containing_words":[],"sentences":[{"english":"As a result, they were surrounded by the army of Qin till the supplies were exhausted.","chinese":"结果，赵军被秦军包围，直至弹尽粮绝。"},{"english":"And then for eight days, they had nothing.","chinese":"随后的八天内，他们弹尽粮绝了。"},{"english":"The little scamp had tempted us to think these kind of weapons were no longer to be found in his artillery.","chinese":"这个家伙时常让我们错认为他的武器库早已弹尽粮绝。"},{"english":"The enemy yielded up that city when ammunition and food supplies were exhausted.","chinese":"敌人弹尽粮绝，被迫放弃那座城市。"}],"related":[{"definition":["out of ammunition and no hope of reinforcements (idiom); in desperate straits"],"pinyin":["dan4 jin4 yuan2 jue2"],"word":"弹尽援绝"},{"definition":["to run out of food"],"pinyin":["duan4 liang2"],"word":"断粮"},{"definition":["the few are no match for the many\/heavily outnumbered\/facing impossible odds (idiom)"],"pinyin":["gua3 bu4 di2 zhong4"],"word":"寡不敌众"},{"definition":["mountain and river exhausted (idiom); at the end of the line\/nowhere to go"],"pinyin":["shan1 qiong2 shui3 jin4"],"word":"山穷水尽"},{"definition":["utterly defeated\/routed\/crushed\/to collapse (of army)"],"pinyin":["kui4 bai4"],"word":"溃败"},{"definition":["multitude of enemies, few friends (idiom from Mencius)\/heavily outnumbered\/beaten by the weight of numbers"],"pinyin":["di2 zhong4 wo3 gua3"],"word":"敌众我寡"},{"definition":["riders tired and horses weary (idiom)\/worn out\/exhausted\/spent\/fatigued"],"pinyin":["ren2 kun4 ma3 fa2"],"word":"人困马乏"},{"definition":["troops in defeat like a landslide (idiom); a beaten army in total collapse"],"pinyin":["bing1 bai4 ru2 shan1 dao3"],"word":"兵败如山倒"},{"definition":["lit. the path exhausted, the end of the road (idiom); an impasse\/in a plight with no way out\/things have reached a dead end"],"pinyin":["qiong2 tu2 mo4 lu4"],"word":"穷途末路"},{"definition":["to be at an impasse (idiom)\/in a tight spot\/at the end of one's rope\/desperate"],"pinyin":["zou3 tou2 wu2 lu4"],"word":"走投无路"},{"definition":["to stand a siege\/trapped in a besieged city"],"pinyin":["kun4 shou3"],"word":"困守"},{"definition":["the multitude against the few, a wide disparity (idiom from Mencius); heavily outnumbered\/unequally matched\/overwhelmed by weight of numbers"],"pinyin":["zhong4 gua3 xuan2 shu1"],"word":"众寡悬殊"},{"definition":["soldiers at the city walls (idiom); fig. at a critical juncture"],"pinyin":["bing1 lin2 cheng2 xia4"],"word":"兵临城下"},{"definition":["total defeat of an army (idiom); fig. a complete wipeout"],"pinyin":["quan2 jun1 fu4 mo4"],"word":"全军覆没"},{"definition":["to retreat and defend\/to withdraw and maintain one's guard"],"pinyin":["tui4 shou3"],"word":"退守"},{"definition":["to besiege"],"pinyin":["wei2 kun4"],"word":"围困"}]}