{"definition":["lit. strong dragon cannot repress a snake (idiom); fig. a local gangster who is above the law"],"pinyin":["qiang2 long2 bu4 ya1 di4 tou2 she2"],"traditional":["強龍不壓地頭蛇"],"rank":64588.0,"normalized_rank":0.9036699173114324,"fraction":1.751731522343186e-8,"cumulative_fraction":0.9999466529141986,"word":"强龙不压地头蛇","characters":[{"definition":["strong\/powerful\/better\/slightly more than\/vigorous\/violent\/best in their category, e.g. see 百強|百强[bai3 qiang2]","variant of 強|强[jiang4]","variant of 強|强[qiang3]","to force\/to compel\/to strive\/to make an effort","variant of 強|强[qiang2]","surname Qiang","stubborn\/unyielding"],"pinyin":["qiang2","jiang4","qiang3","qiang3","qiang2","Qiang2","jiang4"],"word":"强"},{"definition":["dragon\/CL:條|条[tiao2]\/imperial","surname Long"],"pinyin":["long2","Long2"],"word":"龙"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya4","ya1"],"word":"压"},{"definition":["earth\/ground\/field\/place\/land\/CL:片[pian4]","-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct"],"pinyin":["di4","de5"],"word":"地"},{"definition":["suffix for nouns","head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]"],"pinyin":["tou5","tou2"],"word":"头"},{"definition":["variant of 蛇[she2]","snake\/serpent\/CL:條|条[tiao2]"],"pinyin":["she2","she2"],"word":"蛇"}],"containing_words":[],"sentences":[{"english":"However, strong dragon does not pressure the local bosses.","chinese":"可是强龙不压地头蛇。"}],"related":[{"definition":["local bully\/tyrant\/regional mafia boss"],"pinyin":["di4 tou2 she2"],"word":"地头蛇"},{"definition":["a wise man knows better than to fight when the odds are against him (idiom)"],"pinyin":["hao3 han4 bu4 chi1 yan3 qian2 kui1"],"word":"好汉不吃眼前亏"},{"definition":["Only an outstanding talent can recognize current trends (idiom). A wise man submits to circumstances."],"pinyin":["shi2 shi2 wu4 zhe3 wei4 jun4 jie2"],"word":"识时务者为俊杰"},{"definition":["lit. the sky is high and the emperor is far away (idiom)\/fig. remote places are beyond the reach of the central government"],"pinyin":["tian1 gao1 huang2 di4 yuan3"],"word":"天高皇帝远"},{"definition":["a centipede dies but never falls down\/old institutions die hard"],"pinyin":["bai3 zu2 zhi1 chong2 si3 er2 bu4 jiang1"],"word":"百足之虫死而不僵"},{"definition":["peaceful measures before using force (idiom); diplomacy before violence\/jaw-jaw is better than war-war"],"pinyin":["xian1 li3 hou4 bing1"],"word":"先礼后兵"},{"definition":["lit. not for the monk's sake but for the Buddha's sake (idiom)\/fig. (to do sth for sb) out of deference to sb else"],"pinyin":["bu4 kan4 seng1 mian4 kan4 fo2 mian4"],"word":"不看僧面看佛面"},{"definition":["He who comes is surely ill-intentioned, no-one well-meaning will come (idiom).\/Be careful not to trust foreigners.\/Beware of Greeks bearing gifts!"],"pinyin":["lai2 zhe3 bu4 shan4 , shan4 zhe3 bu4 lai2"],"word":"来者不善，善者不来"},{"definition":["lit. when one beats a dog, one must answer to its master (idiom)\/fig. before punishing sb, one should consider how that would affect others associated with him"],"pinyin":["da3 gou3 hai2 dei3 kan4 zhu3 ren2"],"word":"打狗还得看主人"},{"definition":["many men, a great force (idiom); many hands provide great strength\/There is safety in numbers."],"pinyin":["ren2 duo1 shi4 zhong4"],"word":"人多势众"},{"definition":["lit. easy to dodge the spear in the open, hard to avoid a stab in the dark (idiom); it is hard to guard against secret conspiracies"],"pinyin":["ming2 qiang1 yi4 duo3 , an4 jian4 nan2 fang2"],"word":"明枪易躲，暗箭难防"},{"definition":["the shot hits the bird that pokes its head out (idiom)\/nonconformity gets punished"],"pinyin":["qiang1 da3 chu1 tou2 niao3"],"word":"枪打出头鸟"},{"definition":["as they say, ...\/as the saying goes, ..."],"pinyin":["you3 dao4 shi4"],"word":"有道是"},{"definition":["lit. without the lips, the teeth feel the cold (idiom); fig. intimately interdependent"],"pinyin":["chun2 wang2 chi3 han2"],"word":"唇亡齿寒"},{"definition":["It is better to squash enmity rather than keeping it alive (proverb)"],"pinyin":["yuan1 jia1 yi2 jie3 bu4 yi2 jie2"],"word":"冤家宜解不宜结"},{"definition":["lit. under a big tree the shade is plentiful (idiom)\/fig. to benefit by proximity to an influential person"],"pinyin":["da4 shu4 di3 xia4 hao3 cheng2 liang2"],"word":"大树底下好乘凉"}]}