{"definition":["to belong to\/affiliated to\/to result in sth\/to incline towards"],"pinyin":["gui1 yu2"],"traditional":["歸於"],"rank":16069.0,"normalized_rank":0.22482615812964332,"fraction":0.000003645937208503618,"cumulative_fraction":0.9631925468913048,"word":"归于","characters":[{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"归"},{"definition":["surname Yu","to go\/to take\/sentence-final interrogative particle\/variant of 於|于[yu2]","in\/at\/to\/from\/by\/than\/out of"],"pinyin":["Yu2","yu2","yu2"],"word":"于"}],"containing_words":[{"definition":["to die in such a way that sb (or sth) else also perishes\/to take sb down with oneself\/to end in mutual destruction"],"pinyin":["tong2 gui1 yu2 jin4"],"word":"同归于尽"},{"definition":["to become reconciled\/to bury the hatchet"],"pinyin":["yan2 gui1 yu2 hao3"],"word":"言归于好"}],"sentences":[{"english":"Such as that which is complete comes, that the limited shall come to nought.","chinese":"等那完全的来到，这有限的必归于无有了。"},{"english":"Birds resort unto their like: so truth will return to them that practise her.","chinese":"鸟兽与同类相聚，真理也必归于实行真理的人。"},{"english":"He ascribes his success to skill or exert stay.","chinese":"他把他的胜利归于技能和努力的任务。"},{"english":"He decided to square himself with his wife after their quarrel.","chinese":"争吵之后，他决定与他的妻子言归于好。"},{"english":"We are moving to replace mutually assured destruction with mutual cooperation.","chinese":"我们正在采取行动，以共同合作代替同归于尽。"},{"english":"The woodlands have hushed their songs, and doors are all shut at every house.","chinese":"林地里，歌声归于沉寂，家家户户都关门了。"},{"english":"Glory to God in highest and peace to the humans of good will on the earth.","chinese":"荣耀归于至高的上主，和平归于地下的良民。"},{"english":"Glory to God in highest and peace to the humans of good will on the earth.","chinese":"荣耀归于至高的上主，和平归于地下的良民。"},{"english":"Remember, I beseech thee, that thou hast made me as the clay; and wilt thou bring me into dust again?","chinese":"求你记念制造我如抟泥一般，你还要使我归于尘土吗？"},{"english":"The blame for this accident attaches to the man who destroyed the signal.","chinese":"这个事故的责任归于那个破坏信号的人。"},{"english":"He even reconciled with a classmate with whom he had had trouble several years ago.","chinese":"他甚至和一位积怨多年的同学言归于好。"},{"english":"They quarrelled but now they're completely reconciled.","chinese":"他们争吵过，但现在已经完全言归于好了。"},{"english":"In both cases, the remainder would go to the book's publishers.","chinese":"在这两种情况下，其余的份额将归于图书的出版商。"},{"english":"Miguel:I think a good friendship deserves a second chance.","chinese":"我认为深厚的友情应该有言归于好的机会。"},{"english":"The two boys agreed to let bygones be bygones and made friends again.","chinese":"这两个男孩同意不计较过去，而且重归于好了。"},{"english":"Is it possible to make peace with the dead?","chinese":"有可能与死者重归于好吗？"}],"related":[{"definition":["to assign (to a class)\/to classify as\/to include"],"pinyin":["gui1 ru4"],"word":"归入"},{"definition":["to return\/to come back"],"pinyin":["fu4 gui1"],"word":"复归"},{"definition":["to eliminate\/to obliterate"],"pinyin":["xiao1 min3"],"word":"消泯"},{"definition":["to die out\/to wither away"],"pinyin":["xiao1 wang2"],"word":"消亡"},{"definition":["that being the case\/then\/in that case"],"pinyin":["ran2 ze2"],"word":"然则"},{"definition":["surname Zhu","all\/various"],"pinyin":["Zhu1","zhu1"],"word":"诸"},{"definition":["silence\/stillness"],"pinyin":["chen2 ji4"],"word":"沉寂"},{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely","to the greatest extent\/(when used before a noun of location) furthest or extreme\/to be within the limits of\/to give priority to"],"pinyin":["jin4","jin3"],"word":"尽"},{"definition":["nothingness"],"pinyin":["xu1 wu2"],"word":"虚无"},{"definition":["to merge together (idiom); to unify disparate elements into one whole"],"pinyin":["he2 er2 wei2 yi1"],"word":"合而为一"},{"definition":["both\/both of them\/neither"],"pinyin":["er4 zhe3"],"word":"二者"},{"definition":["to convert to (a religion)\/to rely upon\/refuge\/mainstay"],"pinyin":["gui1 yi1"],"word":"归依"},{"definition":["to give up\/to abandon\/to abort"],"pinyin":["she3 qi4"],"word":"舍弃"},{"definition":["to belong to\/to be affiliated to\/to fall under the jurisdiction of\/a place where one feels that one belongs\/one's final destination (where one need look no further)"],"pinyin":["gui1 shu3"],"word":"归属"},{"definition":["only"],"pinyin":["wei2 you3"],"word":"唯有"},{"definition":["to obliterate\/to die out\/to disappear"],"pinyin":["min3 mie4"],"word":"泯灭"}]}