{"definition":["to put sth back where it belongs\/to return to the original position\/to return to one's seat (in a classroom)"],"pinyin":["gui1 wei4"],"traditional":["歸位"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"归位","characters":[{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"归"},{"definition":["position\/location\/place\/seat\/classifier for people (honorific)\/classifier for binary bits (e.g. 十六位 16-bit or 2 bytes)\/(physics) potential"],"pinyin":["wei4"],"word":"位"}],"containing_words":[],"sentences":[{"english":"Let the water run for several minutes, check for leaks, and then reattach the aerator.","chinese":"让水流出几分钟，检查是否漏水，然后将透气口归位。"},{"english":"Swam: Uxie and the others said they would return the recaptured Time Gears to their rightful places.","chinese":"湖精们说过他们会把失而复得的时之齿轮归位的。"},{"english":"If you're the one who has checked out, see the next two options.","chinese":"如果你是那个已经“归位”的人，看看下面两个选择。"},{"english":"Migration is one of the most significant methods in ground-penetrating radar data processing.","chinese":"偏移归位是探地雷达资料处理中的一种重要方法。"},{"english":"Can be applied to 4A homing method shuffle.","chinese":"都可以应用4A归位的方法把牌洗出来。"},{"english":"We all want to make a reseat.","chinese":"我们也都希望能让他重新归位。"},{"english":"Pitt founded the Make it Right Foundation to do just that.","chinese":"皮特成立了“让它重新归位”基金会来支持这一项目。"},{"english":"Perfector arm A reached timeout during homing procedure.","chinese":"完善臂归位程序在达到超时。"},{"english":"But there were only 27 names on the published list, with the section of strikers completed with the words 'plus one other'.","chinese":"公布的名单上只有27人，现在只等阿圭罗归位。"},{"english":"And everything else will fall into place.","chinese":"然后所有事情都将会像元神归位一般的和谐。"}],"related":[{"definition":["to meet together\/to assemble (of a group of people)"],"pinyin":["ju4 qi2"],"word":"聚齐"},{"definition":["to come to\/to awaken\/to regain consciousness"],"pinyin":["su1 xing3"],"word":"苏醒"},{"definition":["(of the people in a group) to get into position (idiom)\/(athletics) On your mark!"],"pinyin":["ge4 jiu4 ge4 wei4"],"word":"各就各位"},{"definition":["to return to one's unit\/to go back to one's station in life"],"pinyin":["gui1 dui4"],"word":"归队"},{"definition":["(of a spirit or deity) to possess sb"],"pinyin":["fu4 ti3"],"word":"附体"},{"definition":["to be born\/to come into being\/to withdraw from worldly affairs"],"pinyin":["chu1 shi4"],"word":"出世"},{"definition":["this life\/to lose face\/to be disgraced"],"pinyin":["xian4 shi4"],"word":"现世"},{"definition":["to return\/to go back\/to come back"],"pinyin":["hui2 fan3"],"word":"回返"},{"definition":["to remove\/to step back from involvement\/to disengage"],"pinyin":["chou1 li2"],"word":"抽离"},{"definition":["to draw to oneself\/to gather up\/to collect\/to fold up (an umbrella, wings etc)\/to assemble (a party of persons)\/to rope in (some people)"],"pinyin":["shou1 long3"],"word":"收拢"},{"definition":["to meet again"],"pinyin":["chong2 ju4"],"word":"重聚"},{"definition":["to make an about-turn\/to reverse one's direction, policy, sequence etc\/to turn things on their head"],"pinyin":["dao4 zhuan3"],"word":"倒转"},{"definition":["to rotate\/to turn round\/slalom","to revolve\/to rotate\/rotation"],"pinyin":["hui2 zhuan3","hui2 zhuan3"],"word":"回转"},{"definition":["to clear up\/to tidy up\/to dispose of"],"pinyin":["qing1 li3"],"word":"清理"},{"definition":["to separate\/to disperse"],"pinyin":["san4 kai1"],"word":"散开"},{"definition":["to become visible\/to appear\/to manifest one's true nature"],"pinyin":["xian4 xing2"],"word":"现形"}]}