{"definition":["to blame sb"],"pinyin":["gui1 zui4"],"traditional":["歸罪"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"归罪","characters":[{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"归"},{"definition":["variant of 罪[zui4], crime","guilt\/crime\/fault\/blame\/sin"],"pinyin":["zui4","zui4"],"word":"罪"}],"containing_words":[],"sentences":[{"english":"All this above imputes or contributes to the communication su ort.","chinese":"以上这些都可以归罪于或归功于通信保障。"},{"english":"I have no aspirations such as those you impute to me.","chinese":"我可没有你归罪于我的这些欲望。"},{"english":"Londoncannot claim credit for having produced all of the whipping-boys of the financial crisis.","chinese":"不能归罪伦敦给金融危机带来这么多带罪羔羊。"},{"english":"He blamed the evils of market competition.","chinese":"他把这归罪于市场竞争这个魔鬼。"},{"english":"But the pure behavior imputation also has the various insufficiency and the flaw.","chinese":"但是单纯的行为归罪亦有多方面的不足和缺陷。"},{"english":"He had no hesitation in imputing the failure of his marriage to his wife's shortcomings.","chinese":"他毫不犹豫地将他婚姻的失败归罪于他妻子的缺点。"},{"english":"The government blames middle men who collect milk from dairy farmers.","chinese":"政府归罪于从奶牛养殖者手中收购牛奶的中间商。"},{"english":"The heatwave has been blamed on masses of hot air from the Sahara Desert moving north.","chinese":"这场热浪归罪于从撒哈拉沙漠向北袭来的大量热空气。"},{"english":"Germans far more likely to blame cars and aircraft use for global warming.","chinese":"德国人更倾向于把全球变暖归罪于汽车和飞机的使用。"},{"english":"But Zhu did not trace all of China’s troubles to foreign invaders.","chinese":"但是朱先生没有把中国所有的苦难归罪于侵略者。"},{"english":"Series of attacks blamed on people with grievances, mental illness","chinese":"一连串的截击归罪于具有不满情绪和心理疾病的人。"},{"english":"Now Andy, just take it easy. I'm not saying you are to blame for everything .","chinese":"安狄，别激动，我并没有说所有的问题都归罪于你。"},{"english":"They later blamed their experience on the crime culture of the favellas.","chinese":"事后他们把遭遇归罪于这个贫民区的犯罪文化。"},{"english":"How dare you impute such monstrous intentions to me?","chinese":"我可没有你归罪于我的这些欲望。"},{"english":"He thought of inculpating his brother to escape punishment himself.","chinese":"他想归罪于他的兄弟以避免自己受罚。"},{"english":"But to blame the service for infidelity is to confuse cause and effect.","chinese":"但将夫妻不忠归罪在线约会则是本末倒置了。"}],"related":[{"definition":["to put the blame on\/to accuse"],"pinyin":["gui1 jiu4"],"word":"归咎"},{"definition":["to avoid (esp. responsibility)\/to shift (the blame)\/to pass the buck"],"pinyin":["tui1 xie4"],"word":"推卸"},{"definition":["guilt"],"pinyin":["zui4 ze2"],"word":"罪责"},{"definition":["to take one's anger out on sb (who does not deserve it)"],"pinyin":["qian1 nu4"],"word":"迁怒"},{"definition":["to blame"],"pinyin":["guai4 zui4"],"word":"怪罪"},{"definition":["to impose\/to force upon"],"pinyin":["qiang2 jia1"],"word":"强加"},{"definition":["scapegoat\/sacrificial lamb\/same as 替罪羊"],"pinyin":["ti4 zui4 gao1 yang2"],"word":"替罪羔羊"},{"definition":["scapegoat"],"pinyin":["ti4 zui4 yang2"],"word":"替罪羊"},{"definition":["to vent one's anger on an innocent party (idiom)"],"pinyin":["qian1 nu4 yu2 ren2"],"word":"迁怒于人"},{"definition":["to exculpate\/to absolve\/to exonerate"],"pinyin":["kai1 tuo1"],"word":"开脱"},{"definition":["to have only oneself to blame (idiom)\/to bring trouble through one's own actions"],"pinyin":["jiu4 you2 zi4 qu3"],"word":"咎由自取"},{"definition":["to frame sb (by planting sth on them)"],"pinyin":["zai1 zang1"],"word":"栽赃"},{"definition":["error\/fault\/(law) negligence\/delinquency"],"pinyin":["guo4 shi1"],"word":"过失"},{"definition":["to censure"],"pinyin":["ze2 nan4"],"word":"责难"},{"definition":["to target sb or sth (for attack, criticism etc)"],"pinyin":["mao2 tou2 zhi3 xiang4"],"word":"矛头指向"},{"definition":["to shield (a miscreant) from punishment, criticism etc\/to take sb's side"],"pinyin":["tan3 hu4"],"word":"袒护"}]}