{"definition":["current\/present\/now\/nowadays"],"pinyin":["dang1 jin1"],"traditional":["當今"],"rank":4566.0,"normalized_rank":0.06388426398779959,"fraction":0.000027443501894789527,"cumulative_fraction":0.8478060226077989,"word":"当今","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","(onom.) dong\/ding dong (bell)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang4","dang1","dang1"],"word":"当"},{"definition":["now\/the present time\/current\/contemporary\/this (day, year etc)"],"pinyin":["jin1"],"word":"今"}],"containing_words":[],"sentences":[{"english":"And the Northwest Passage in the Arctic became ice-free for the first time in living memory.","chinese":"在当今人们的记中，北极西北航道首次成为无冰航道。"},{"english":"The very major problem that Chinese mathematics faces is lack of leadership.","chinese":"当今中国数学界面对的大难，便是缺乏领导者。"},{"english":"Today's companies should think of high-earning singles as a key market.","chinese":"当今的企业应该把高收入的单身族当成重要的市场。"},{"english":"Today madam Gao is wearing a red skirt.","chinese":"当今高老师穿着一件红裙子。"},{"english":"In the world of today, absolute majority countries have parties and exercise party politics.","chinese":"当今世界，绝大多数国家都存在政党，实行政党政治。"},{"english":"Ecotype waterscape residential district is the trend of modern resident design.","chinese":"生态型水景住宅是当今住宅设计的一大趋势。"},{"english":"Currently, the Japanese are experiencing an age of having few children in families, which influences the development of higher education greatly.","chinese":"“少子化”是当今影响日本社会的主要人口问题之一。"},{"english":"Nowadays weight-losing has become popular among young and middle-aged women.","chinese":"当今女性减肥已成为一种时尚。"},{"english":"Think of the endless opportunity our connectedness provides.","chinese":"想想我们当今社会的连通性给我们所带来的无限机遇。"},{"english":"Most people turn to countless sources of information these days.","chinese":"当今大多数人要面对不计其数的信息源。"},{"english":"Today’s upheaval did not occur from nowhere. The seeds were planted earlier.","chinese":"当今的剧变并非凭空发生，这些种子早已埋下。"},{"english":"SamuelLing, The Meaning and ContemporarySignificance Confessing the Inerrancy of Scripture Today.","chinese":"林慈信，《认信圣经无误的重要性和当今适切性》。"},{"english":"The potential curricula is a new task and hotspot of the current teaching research?","chinese":"潜在课程是当今教学研究的一个新课题和热点。"},{"english":"When (Juventus keeper Gigi) Buffon retires, the best goalkeeper will be Igor Akinfeev.","chinese":"当布冯退役后，当今第一门将将会是阿金费耶夫。"},{"english":"Now let's enjoy the tape of a fiwimous popular singer Miss Tianzhen.","chinese":"目下当今欣赏一下在大歌星田震的磁带。"},{"english":"This theory has become the theoretical framework for China’s current qigong and health preservation studies.","chinese":"这一理论已成为当今气功健身研究的基础理论。"}],"related":[{"definition":["now\/nowadays\/modern"],"pinyin":["xian4 jin1"],"word":"现今"},{"definition":["the present age\/the contemporary era"],"pinyin":["dang1 dai4"],"word":"当代"},{"definition":["at present\/right now"],"pinyin":["shi2 xia4"],"word":"时下"},{"definition":["age\/era\/epoch\/period (in one's life)\/CL:個|个[ge4]","Time, US weekly news magazine"],"pinyin":["shi2 dai4","Shi2 dai4"],"word":"时代"},{"definition":["nowadays\/now"],"pinyin":["ru2 jin1"],"word":"如今"},{"definition":["publicly known (to be)\/accepted (as)"],"pinyin":["gong1 ren4"],"word":"公认"},{"definition":["indeed\/true! (I agree with you)"],"pinyin":["cheng2 ran2"],"word":"诚然"},{"definition":["21st century"],"pinyin":["er4 shi2 yi1 shi4 ji4"],"word":"二十一世纪"},{"definition":["this day and age (dialect)"],"pinyin":["jin1 shi2 jin1 ri4"],"word":"今时今日"},{"definition":["to survey comprehensively\/an overall survey"],"pinyin":["zong4 guan1"],"word":"纵观"},{"definition":["main stream (of a river)\/fig. the essential point\/main viewpoint of a matter\/mainstream (culture etc)"],"pinyin":["zhu3 liu2"],"word":"主流"},{"definition":["lit. burn your hand, feel the heat (idiom)\/fig. arrogance of the powerful\/a mighty figure no-one dares approach\/hot (exciting or in favor)"],"pinyin":["zhi4 shou3 ke3 re4"],"word":"炙手可热"},{"definition":["generation"],"pinyin":["yi1 dai4"],"word":"一代"},{"definition":["the last few years\/last several years\/recent years"],"pinyin":["zui4 jin4 ji3 nian2"],"word":"最近几年"},{"definition":["peak\/apex\/world best\/number one\/finest (competitors)\/top (figures in a certain field)"],"pinyin":["ding3 jian1"],"word":"顶尖"},{"definition":["to count as number one (idiom); second to none\/outstanding"],"pinyin":["shou3 qu1 yi1 zhi3"],"word":"首屈一指"}]}