{"definition":["top priority job\/matter of vital importance"],"pinyin":["dang1 wu4 zhi1 ji2"],"traditional":["當務之急"],"rank":10675.0,"normalized_rank":0.14935709988387222,"fraction":0.0000074220864601680785,"cumulative_fraction":0.9349930887615134,"word":"当务之急","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","(onom.) dong\/ding dong (bell)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang4","dang1","dang1"],"word":"当"},{"definition":["affair\/business\/matter\/to be engaged in\/to attend to\/by all means"],"pinyin":["wu4"],"word":"务"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["urgent\/pressing\/rapid\/hurried\/worried\/to make (sb) anxious"],"pinyin":["ji2"],"word":"急"}],"containing_words":[],"sentences":[{"english":"India obviously has preoccupations enough to keep its focus fixed on its border regions.","chinese":"印度的当务之急显然是把焦点定在边界地区。"},{"english":"But buttering up China appears to be a new priority.","chinese":"但显然向中国示好成为其当务之急。"},{"english":"I think the first order of business is to get you out of here.","chinese":"我认为，当务之急首先是得把你撵出去。"},{"english":"For him, tackling climate change is every bit as urgent.","chinese":"但在他看来，应对气候变化同样是当务之急。"},{"english":"Its urgent for telecommunication enterprises in China to emphasize and implement marketing research.","chinese":"重视和开展市场调研是国内电信企业的当务之急。"},{"english":"On the correct application of market research in enterprises marketing;","chinese":"重视和开展市场调研是国内电信企业的当务之急。"},{"english":"I believe now that cooperation is everything.","chinese":"我认为当务之急是要通力合作。"},{"english":"Now he believed that mitigating the impact of rising temperatures was urgent.","chinese":"如今，他坚信减轻气温升高的影响是当务之急。"},{"english":"What is pressing at present is to resume the negotiation as soon as possible.","chinese":"当务之急是争取尽快复谈。"},{"english":"The environmental management of coal waste has become an impending problem.","chinese":"煤矸石的环境治理问题已成当务之急。"},{"english":"The necessity for making decisions devolves on him.","chinese":"作出决策乃当务之急，此事必然地落在他身上。"},{"english":"Encourage farmers to macro-control of cotton is a matter of urgency.","chinese":"鼓励农民种棉是宏观调控的当务之急。"},{"english":"Now the urgent task is to make sure you get vigilante thing right.","chinese":"现在的当务之急是务必把“治安维持会”的事情办好。"},{"english":"The task of promptly building up an administrative system of criminal science and technology is of top priority.","chinese":"建立新型刑事科学技术管理体制是当务之急。"},{"english":"State-owned commercial banks improve customer loyalty become an urgency matter.","chinese":"提高国有商业银行的客户忠诚度成为当务之急。"},{"english":"The priority for policymakers must be to keep the number of losers as small as possible.","chinese":"决策者的当务之急是尽量减少这些失意者的数量。"}],"related":[{"definition":["circumstances require action (idiom); absolutely necessary\/imperative"],"pinyin":["shi4 zai4 bi4 xing2"],"word":"势在必行"},{"definition":["as quickly as possible\/as soon as possible\/with all speed","see 儘快|尽快[jin3 kuai4]"],"pinyin":["jin3 kuai4","jin4 kuai4"],"word":"尽快"},{"definition":["the most important\/of chief importance"],"pinyin":["shou3 yao4"],"word":"首要"},{"definition":["to take one's time making a decision (idiom)\/to consider at length"],"pinyin":["cong2 chang2 ji4 yi4"],"word":"从长计议"},{"definition":["the best policy\/the best thing one can do in the circumstances"],"pinyin":["shang4 shang4 zhi1 ce4"],"word":"上上之策"},{"definition":["key task\/important affair"],"pinyin":["yao4 wu4"],"word":"要务"},{"definition":["pressing in on one's eyelashes (idiom); imminent"],"pinyin":["po4 zai4 mei2 jie2"],"word":"迫在眉睫"},{"definition":["as early as possible"],"pinyin":["jin3 zao3"],"word":"尽早"},{"definition":["now\/at present\/subocular (medicine)"],"pinyin":["yan3 xia4"],"word":"眼下"},{"definition":["plan of convenience (idiom); stop-gap measure\/makeshift stratagem\/interim step"],"pinyin":["quan2 yi2 zhi1 ji4"],"word":"权宜之计"},{"definition":["important\/urgent"],"pinyin":["yao4 jin3"],"word":"要紧"},{"definition":["sensible act"],"pinyin":["ming2 zhi4 zhi1 ju3"],"word":"明智之举"},{"definition":["of the utmost importance\/of highest priority"],"pinyin":["zhong4 zhong1 zhi1 zhong4"],"word":"重中之重"},{"definition":["eager to\/in a hurry to"],"pinyin":["ji2 yu2"],"word":"急于"},{"definition":["to brook no delay\/to demand immediate action"],"pinyin":["ke4 bu4 rong2 huan3"],"word":"刻不容缓"},{"definition":["to try\/to make an attempt\/to think of a way (to accomplish sth)"],"pinyin":["she4 fa3"],"word":"设法"}]}