{"definition":["current\/today's\/modern\/present\/to be facing (us)"],"pinyin":["dang1 qian2"],"traditional":["當前"],"rank":1252.0,"normalized_rank":0.0175171043610874,"fraction":0.0001296580580669025,"cumulative_fraction":0.6560967566150302,"word":"当前","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","(onom.) dong\/ding dong (bell)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang4","dang1","dang1"],"word":"当"},{"definition":["front\/forward\/ahead\/first\/top (followed by a number)\/future\/ago\/before\/BC (e.g. 前293年)\/former\/formerly"],"pinyin":["qian2"],"word":"前"}],"containing_words":[{"definition":["facing a powerful enemy (idiom); fig. confronting grave difficulties\/Enemy at the Gates, 1991 movie by Jean-Jacques Annaud"],"pinyin":["da4 di2 dang1 qian2"],"word":"大敌当前"}],"sentences":[{"english":"Context is the most frequently studied theme in pragmatics.","chinese":"语境是当前语用学研究的一个热点。"},{"english":"The existing vaccines can only reduce the amount of virus, rather than totally inactivating it.","chinese":"当前的疫苗只会减少病毒数量，并非真正杀灭病毒。"},{"english":"As you can see, there are some consequences with the current arrangement.","chinese":"正如您所看到的，当前这种安排还存有许多问题。"},{"english":"The financial restraint in rural areas is one of the bottlenecked factors in current new rural construction.","chinese":"农村金融抑制是当前新农村建设问题的瓶颈因素之一。"},{"english":"However, the present recognition of TV essays still remains on the text-oriented level.","chinese":"但当前对电视散文的认识仍然停留在文本主导论层次。"},{"english":"Adds a sequence of connected cubic Bzier curves to the current figure.","chinese":"在当前图形中添加一系列相互连接的立方贝塞尔曲线。"},{"english":"Each plug-in has access to information about a personâ ™s current location whereabouts. The location information includes","chinese":"各插件都可访问关于某人当前位置所在的信息。"},{"english":"The rotating sphere shows the current pitch and bank angles.","chinese":"旋转的球体表示了当前的俯仰角和坡度角。"},{"english":"The rapid development of the present vocational colleges calls for the 2nd-level management in schools or departments.","chinese":"院系二级管理是当前高职院校迅速发展的需要。"},{"english":"To narrate is to give an account of what happened or is happening.","chinese":"记叙文讲述的是发生在当前或过去事情的经过。"},{"english":"Development and ecology are two main theme in urban design and construction in Beijing nowadays.","chinese":"发展与生态是当前北京城市建设的两大突出主题。"},{"english":"Make the directory containing the files the current working directory.","chinese":"将包含这些文件的目录作为当前工作目录。"},{"english":"The domestic caustic soda production techniques by diaphragm method and ion-exchange membrane method at present are introduced.","chinese":"介绍了当前国内隔膜法和离子膜法烧碱的生产技术。"},{"english":"He can cope with the present situation.","chinese":"他能够应付当前的局势。"},{"english":"Eutrophication is becoming a serious problem in most of the mariculture areas in China.","chinese":"当前，中国的多数海水养殖区富营养化相当严重。"},{"english":"How to develop the economy of tax fund is a new problem now.","chinese":"如何培育地方税源经济是当前的新课题。"}],"related":[{"definition":["at the present stage"],"pinyin":["xian4 jie1 duan4"],"word":"现阶段"},{"definition":["at the present time\/currently"],"pinyin":["mu4 qian2"],"word":"目前"},{"definition":["immediately\/at once\/at that moment\/at the moment"],"pinyin":["dang1 xia4"],"word":"当下"},{"definition":["circumstances\/situation\/terrain\/CL:個|个[ge4]"],"pinyin":["xing2 shi4"],"word":"形势"},{"definition":["currently existing\/currently available"],"pinyin":["xian4 you3"],"word":"现有"},{"definition":["posture\/situation"],"pinyin":["tai4 shi4"],"word":"态势"},{"definition":["completely\/totally\/total\/entire\/overall\/population (statistics)"],"pinyin":["zong3 ti3"],"word":"总体"},{"definition":["the next step"],"pinyin":["xia4 yi1 bu4"],"word":"下一步"},{"definition":["trend\/tendency"],"pinyin":["qu1 shi4"],"word":"趋势"},{"definition":["current situation"],"pinyin":["xian4 zhuang4"],"word":"现状"},{"definition":["process\/course"],"pinyin":["jin4 cheng2"],"word":"进程"},{"definition":["near in time\/in the near future\/very soon\/recent"],"pinyin":["jin4 qi1"],"word":"近期"},{"definition":["to be in (some state, position, or condition)"],"pinyin":["chu3 yu2"],"word":"处于"},{"definition":["to be situated at\/to find oneself at"],"pinyin":["chu3 zai4"],"word":"处在"},{"definition":["in view of\/seeing that\/considering\/whereas"],"pinyin":["jian4 yu2"],"word":"鉴于"},{"definition":["future\/tomorrow\/CL:個|个[ge4]\/approaching\/coming\/pending"],"pinyin":["wei4 lai2"],"word":"未来"}]}