{"definition":["Angelica sinensis"],"pinyin":["dang1 gui1"],"traditional":["當歸"],"rank":31377.0,"normalized_rank":0.4390049389279868,"fraction":8.339701822622184e-7,"cumulative_fraction":0.991463309106742,"word":"当归","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","(onom.) dong\/ding dong (bell)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang4","dang1","dang1"],"word":"当"},{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"归"}],"containing_words":[{"definition":["(botany) lovage\/Levisticum officinale"],"pinyin":["Ou1 dang1 gui1"],"word":"欧当归"}],"sentences":[{"english":"Objection To observe analgesic effect of Angelica oil on mouse dysmenorrhea.","chinese":"目的观察研究当归油对小鼠痛经的镇痛作用。"},{"english":"Externally used Dan Gui is very versatile; if you are wanting mostly the invigorating properties you should use the TAIL of the herb, or Dang Gui Wei.","chinese":"如果主要需要滋补的话，可以使用当归的尾部。"},{"english":"Furthermore, Danggui Buxue Tang also can promote the production of blood and improve angiogenesis .","chinese":"当归补血汤还具有促进造血和血管生成作用。"},{"english":"For example, Dang Gui is found in balms to help with burns and such.","chinese":"例如，烧伤等所用的镇痛软膏中就含有当归。"},{"english":"Chinese angelica parenteral solution was replaced by normal saline in control group.","chinese":"对照组给予生理盐水代替当归注射液治疗。"},{"english":"Conclusion: Angelica injection can reduce GE ototoxicity.","chinese":"结论当归注射液能降低GE的耳毒性。"},{"english":"Aim To study the anti-dysmenorrhea effect of the essential oil from Angelica sinensis Diels.","chinese":"目的研究当归精油治疗痛经的药理作用。"},{"english":"Objective To evaluate the antioxidation activities of two Chinese herbs, polygonum multiflorum and Angelica sinensis.","chinese":"目的研究生首乌和当归两种中药的抗氧化活性。"},{"english":"As an example, study of DangGui verified the predicting abililty of the proposed method.","chinese":"以中药当归为实例对该方法进行应用研究。"},{"english":"Boss will add in the angelica based on the customers' needs.","chinese":"老板是应顾客的需要而加入当归。"},{"english":"Ultrasonography and extracting a short time, Angelica in the basic ferulic acid can be extracted completely.","chinese":"且超声提取时间短，当归中的阿魏酸基本能提取完全。"},{"english":"RESULTS The contents of components were changed after Angelica sinensis(Oliv. )Diels was processed by different methods.","chinese":"结果当归经不同方法炮制后，其所含成分发生了变化。"},{"english":"What's more, Dong Quai is a mild tranquilliser and helps relieve stress and pressure.","chinese":"当归亦具有温和的镇静效果，有助缓解紧张及压力。"},{"english":"Objective To explore the inner quality of ultra micro-powder.","chinese":"目的探讨当归超微细粉的内在质量。"}],"related":[{"definition":["chuanxiong rhizome"],"pinyin":["chuan1 xiong1"],"word":"川芎"},{"definition":["huangqi\/milk vetch root (used in TCM)\/Astragalus membranaceus or Astragalus mongholicus"],"pinyin":["huang2 qi2"],"word":"黄芪"},{"definition":["root of herbaceous peony (Paeonia lactiflora), used in TCM"],"pinyin":["bai2 shao2"],"word":"白芍"},{"definition":["Wolfiporia extensa (a wood-decay fungus)\/fu ling\/tuckahoe"],"pinyin":["fu2 ling2"],"word":"茯苓"},{"definition":["Salvia miltiorrhiza"],"pinyin":["dan1 shen1"],"word":"丹参"},{"definition":["the rhizome of large-headed atractylodes (Atractylodes macrocephaia)"],"pinyin":["bai2 zhu2"],"word":"白术"},{"definition":["Achyranthes bidentata (root used in Chinese medicine)"],"pinyin":["niu2 xi1"],"word":"牛膝"},{"definition":["licorice root"],"pinyin":["gan1 cao3"],"word":"甘草"},{"definition":["red nut sedge (Cyperus rotundus)"],"pinyin":["xiang1 fu4"],"word":"香附"},{"definition":["dried ginger"],"pinyin":["gan1 jiang1"],"word":"干姜"},{"definition":["ladybell root (Radix adenophorae)"],"pinyin":["sha1 shen1"],"word":"沙参"},{"definition":["golden eye-grass (Curculigo orchioides)\/Curculigo rhizome (used in TCM)"],"pinyin":["xian1 mao2"],"word":"仙茅"},{"definition":["cinnamon (Ramulus Cinnamomi)"],"pinyin":["gui4 zhi1"],"word":"桂枝"},{"definition":["eucommia (a kind of rubber tree)"],"pinyin":["du4 zhong4"],"word":"杜仲"},{"definition":["root bark of the peony tree (used in TCM)"],"pinyin":["mu3 dan5 pi2"],"word":"牡丹皮"},{"definition":["dwarf lilyturf (Ophiopogon japonicus), its tuber used in TCM"],"pinyin":["mai4 dong1"],"word":"麦冬"}]}