{"definition":["to manage the household\/to be the one in charge of the family\/to call the shots\/to be in charge"],"pinyin":["dang1 jia1"],"traditional":["當家"],"rank":10847.0,"normalized_rank":0.1517636030389098,"fraction":0.000007235089120157944,"cumulative_fraction":0.9362536004602492,"word":"当家","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","(onom.) dong\/ding dong (bell)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang4","dang1","dang1"],"word":"当"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"}],"containing_words":[{"definition":["to be in charge in one's own house (idiom)\/to be the master of one's own affairs"],"pinyin":["dang1 jia1 zuo4 zhu3"],"word":"当家作主"},{"definition":["a person who doesn't manage a household would not be aware how expensive it is (idiom)"],"pinyin":["bu4 dang1 jia1 bu4 zhi1 chai2 mi3 gui4"],"word":"不当家不知柴米贵"}],"sentences":[{"english":"The people are the masters of their country.","chinese":"人民当家作主人。"},{"english":"It is the striking theme of the ruling history and country history that people are the masters.","chinese":"人民当家作主成为党的执政史和国史的鲜明主题。"},{"english":"When her husband was out she wore the trousers.","chinese":"当她丈夫不在时，她当家做主。"},{"english":"I will raise you ten because it is Home Alone.","chinese":"我加十块，我猜是小鬼当家。"},{"english":"The force at the core leading our cause forward is the Chinese Communist Party.","chinese":"领导我们事业的核心力量是中国当家的。"},{"english":"It was a comedy called \"Home Alone\".","chinese":"这是一部叫《小鬼当家》的喜剧。"},{"english":"In in out out one handle, the poor family's child can get marry earlier.","chinese":"里里外外一把手，穷人的孩子早当家。"},{"english":"Today, Chinese cabbage is no longer the main dish for northern people in winter.","chinese":"如今，大白菜不再是北方人冬天的当家菜。"},{"english":"There's no doubt who wears the trousers in that household.","chinese":"那户人家里谁当家是毫无疑问的。"},{"english":"Granite is our shops' main business.","chinese":"花岗岩是本店经营的当家品种。"},{"english":"He couldn't visualize either Martinez or Brown as platoon sergeant.","chinese":"他不信马丁内兹和布朗有谁能当得了排里的当家上士。"},{"english":"I am honored to be the host of kids club.","chinese":"我很荣幸被选为小鬼当家的主持人。"},{"english":"That poor children as early as it headed.","chinese":"都说穷人的孩子早当家吧。"},{"english":"The bonus told the five children with people outside the door to protect the big headed.","chinese":"花红告诉小五子带着人去门外面保护大当家。"},{"english":"Ma Po's bean curd is a specialty in our restaurant.","chinese":"本店的当家菜是麻婆豆腐。"},{"english":"But they say that Mrs. Smith wears the pants in the house.","chinese":"但是他们说史密斯太太当家掌权。"}],"related":[{"definition":["master (i.e. employer)\/landlord\/boss"],"pinyin":["dong1 jia1"],"word":"东家"},{"definition":["tablet announcing the name of leading actor in a theatrical production\/by extension, the lead role"],"pinyin":["tou2 pai2"],"word":"头牌"},{"definition":["old age\/very\/eldest child in a family\/leader of a group\/boss\/captain of a boat\/leader of a criminal gang"],"pinyin":["lao3 da4"],"word":"老大"},{"definition":["wind direction\/the way the wind blows\/fig. trend\/direction of events\/how things develop (esp. how they affect oneself)\/public opinion (concerning one's actions)\/publicity (usually derog.)\/limelight"],"pinyin":["feng1 tou2"],"word":"风头"},{"definition":["senior figure\/elder\/doyen"],"pinyin":["yuan2 lao3"],"word":"元老"},{"definition":["trump card"],"pinyin":["wang2 pai2"],"word":"王牌"},{"definition":["currently popular (of movie stars, singers etc)"],"pinyin":["dang1 hong2"],"word":"当红"},{"definition":["to be unwilling to pass on one's responsibilities to others"],"pinyin":["dang1 ren2 bu4 rang4"],"word":"当仁不让"},{"definition":["commander-in-chief (military)\/star player (sports)\/key figure (in an organization)"],"pinyin":["zhu3 jiang4"],"word":"主将"},{"definition":["backbone\/mainstay\/pillar\/definite view\/one's own judgment"],"pinyin":["zhu3 xin1 gu3"],"word":"主心骨"},{"definition":["pillar\/backbone"],"pinyin":["ding3 liang2 zhu4"],"word":"顶梁柱"},{"definition":["to replace"],"pinyin":["ding3 ti4"],"word":"顶替"},{"definition":["a general or admiral"],"pinyin":["da4 jiang4"],"word":"大将"},{"definition":["to play a leading role\/to bear a heavy responsibility"],"pinyin":["tiao3 da4 liang2"],"word":"挑大梁"},{"definition":["great family\/rich family\/large landlord\/conspicuous spender or consumer"],"pinyin":["da4 hu4"],"word":"大户"},{"definition":["an up-and-coming youngster\/new talent\/a brilliant younger generation"],"pinyin":["hou4 qi3 zhi1 xiu4"],"word":"后起之秀"}]}