{"definition":["that very same year","in those days\/then\/in those years\/during that time"],"pinyin":["dang4 nian2","dang1 nian2"],"traditional":["當年","當年"],"rank":1326.0,"normalized_rank":0.01855246036965008,"fraction":0.00012153922039372241,"cumulative_fraction":0.6653656972686453,"word":"当年","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","(onom.) dong\/ding dong (bell)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang4","dang1","dang1"],"word":"当"},{"definition":["grain\/harvest (old)\/variant of 年[nian2]","surname Nian","year\/CL:個|个[ge4]"],"pinyin":["nian2","Nian2","nian2"],"word":"年"}],"containing_words":[{"definition":["to be in the prime of life"],"pinyin":["zheng4 dang1 nian2"],"word":"正当年"},{"definition":["(of one's skills, appearance etc) not to have deteriorated a bit\/to be as (good, vigorous etc) as ever"],"pinyin":["bu4 jian3 dang1 nian2"],"word":"不减当年"},{"definition":["a real man doesn't boast about his past achievements (idiom)"],"pinyin":["hao3 han4 bu4 ti2 dang1 nian2 yong3"],"word":"好汉不提当年勇"}],"sentences":[{"english":"In the intensive care unit, beam aunt continue to talk to her mother that year.","chinese":"重症病房里，梁大妈继续跟马母说着当年的事。"},{"english":"We were both on the tennis team.","chinese":"我们当年都是校网球队的。"},{"english":"The mistake is caused by the situation today, Sheng Maolin too late to regret.","chinese":"当年的误以为是造成了今天的局面，盛茂林追悔莫及。"},{"english":"The magpies nest year high, waterlogging rain.","chinese":"喜鹊搭窝高，当年雨水涝。"},{"english":"The Bells of Bow Church spoke truly when they chimed to young Dick.","chinese":"当年包教堂的钟声对年轻的迪克的确说了真话。"},{"english":"Those early years' folding Ru old grudge have already eliminated thin?","chinese":"难道当年的折辱仇恨已经消淡了？"},{"english":"In those years, workers lived right on those cliffs.","chinese":"当年修渠的勇士们就住在那些山崖上。"},{"english":"Liu Bei lost no time in telling his brothers the story of King Wen bent on visiting one of his subjects called Jiang Ziya.","chinese":"刘备忙讲了当年文王访姜子牙的故事。"},{"english":"The 54-year-old had promised during the campaign to serve out his term as mayor.","chinese":"当年54岁的朱立伦在竞选中承诺将服满市长任期。"},{"english":"Look, here are the tools they used then.","chinese":"你看，这些就是当年修渠的人们使用的工具。"},{"english":"The Weill family were very close-knit, as were many immigrant Jewish families of that era.","chinese":"一如当年许多犹太移民家族，魏尔家也是非常团结的。"},{"english":"It was no great distance, in those days, from the prison-door to the market-place.","chinese":"当年，从牢门到市场没有几步路。"},{"english":"The appropriate direction lost many elites in those early annuals, it was under the archaic divine tree to fair cage him.","chinese":"当年正道损失无数精英，才将他困在上古神木之下。"},{"english":"I was back on the physical irks , but now do not they became a physics teacher?","chinese":"我当年对物理很厌烦，可现在不也当了个物理老师吗？"},{"english":"His voice is no longer young children, more powerful.","chinese":"他的声音不再是当年稚嫩的童音，变得浑厚有力。"},{"english":"The 42-year-old one-time heart-throb cut a distinctly portly figure.","chinese":"当年的大众情人如今已经42岁，身体发福。"}],"related":[{"definition":["at that time\/originally"],"pinyin":["dang1 chu1"],"word":"当初"},{"definition":["then\/at that time\/in those days"],"pinyin":["na4 shi2"],"word":"那时"},{"definition":["nowadays\/now"],"pinyin":["ru2 jin1"],"word":"如今"},{"definition":["then\/at that time\/while","at once\/right away"],"pinyin":["dang1 shi2","dang4 shi2"],"word":"当时"},{"definition":["once\/already\/former\/previously\/ever\/(past tense marker used before verb or clause)"],"pinyin":["ceng2 jing1"],"word":"曾经"},{"definition":["things change with the passage of time (idiom)"],"pinyin":["shi2 guo4 jing4 qian1"],"word":"时过境迁"},{"definition":["at that time"],"pinyin":["na4 shi2 hou5"],"word":"那时候"},{"definition":["now\/at present\/at the moment\/modern\/current\/nowadays"],"pinyin":["xian4 zai4"],"word":"现在"},{"definition":["former days\/in the past"],"pinyin":["xi1 ri4"],"word":"昔日"},{"definition":["before\/formerly\/previous\/ago"],"pinyin":["yi3 qian2"],"word":"以前"},{"definition":["afterwards\/later"],"pinyin":["hou4 lai2"],"word":"后来"},{"definition":["early years\/adolescence"],"pinyin":["zao3 nian2"],"word":"早年"},{"definition":["tremendously popular for a while"],"pinyin":["hong2 ji2 yi1 shi2"],"word":"红极一时"},{"definition":["(idiom) up to the present\/even now\/now (in contrast with the past)\/at this late hour"],"pinyin":["shi2 zhi4 jin1 ri4"],"word":"时至今日"},{"definition":["that one\/that thing\/that (as opposed to this)\/(used before a verb or adjective for emphasis)\/(used to humorously or indirectly refer to sth embarrassing, funny etc, or when one can't think of the right word)\/(used in speech as a filler, similar to \"umm\", \"you know\" etc)\/(euph.) menstruation\/sex\/also pr. [nei4 ge5]"],"pinyin":["na4 ge5"],"word":"那个"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"}]}