{"definition":["to consider as\/to take to be"],"pinyin":["dang4 cheng2"],"traditional":["當成"],"rank":5176.0,"normalized_rank":0.07241895540973514,"fraction":0.00002286900100181716,"cumulative_fraction":0.863075335513413,"word":"当成","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","(onom.) dong\/ding dong (bell)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang4","dang1","dang1"],"word":"当"},{"definition":["to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth","surname Cheng"],"pinyin":["cheng2","Cheng2"],"word":"成"}],"containing_words":[],"sentences":[{"english":"Does Bruce see him as a left-winger or a central midfielder?","chinese":"布鲁斯会把他当成一个左边锋还是中场球员？"},{"english":"Today's companies should think of high-earning singles as a key market.","chinese":"当今的企业应该把高收入的单身族当成重要的市场。"},{"english":"In primitive tribes, dreams were thought to be the indication of God or the haunting of the devil.","chinese":"在原始部落中，梦被当成天神降临或是妖魔附体。"},{"english":"I entertained myself flicking wheat-based projectiles at the cat.","chinese":"我把小面团当成子弹弹向那只猫，以此来打发时间。"},{"english":"Break the task down into little bits of time. Make it a game.","chinese":"把任务分解成小段的时间，把它当成游戏。"},{"english":"Don't consider me as CEO. Consider me as your project manager.","chinese":"不要把我当成CEO，就当做是一个项目经理。"},{"english":"Hope everybody to chongqing food web forums for his own family, often at home.","chinese":"希望大家把渝菜网论坛当成自己的家，常回家看看。"},{"english":"Gradually, Li felt at home with the factory and the life.","chinese":"渐渐地，李万胜把东方汽轮机厂当成了自己的家。"},{"english":"Today, my grandpa who is staying with us mistook me for a Japanese soldier and started to hit me with a bat.","chinese":"今天来家里住的爷爷把我当成了日本鬼子用球棒打我。"},{"english":"A lot of people here think of Lebanon as the Middle East, as like a war zone.","chinese":"许多人把黎巴嫩当成中东，就好像一个战区一样。"},{"english":"Everything I told him seemed to go in one ear and out the other.","chinese":"我告诉他的每件事他好像都当成耳边风一样。"},{"english":"Unlabelled terminals must not be used as \"tie points\" for other wires.","chinese":"不可将无标号的接线端当成其它导线的“结点”。"},{"english":"Investing your emotions in someone. That's scary.","chinese":"把对某人的感情当成是投资，是可怕的。"},{"english":"When out of work, treat the job hunt as a full-time job.","chinese":"失业时，要把找工作当成一份全职工作来做。"},{"english":"I was made to look ridiculous because of Fowler, and I defended him.","chinese":"我被当成很好可笑，就因为科拿，而我是保护他。"},{"english":"I hadn’t expected this. I had been outed as an eco-murderer.","chinese":"我没想到他会这么说，我被当成了一个“生态杀手”。"}],"related":[{"definition":["to treat as\/to regard as\/to look upon as"],"pinyin":["dang4 zuo4"],"word":"当做"},{"definition":["to treat as\/to regard as"],"pinyin":["dang4 zuo4"],"word":"当作"},{"definition":["to regard as"],"pinyin":["kan4 cheng2"],"word":"看成"},{"definition":["to look upon as\/to regard as"],"pinyin":["kan4 zuo4"],"word":"看作"},{"definition":["to regard as\/to look upon as"],"pinyin":["kan4 zuo4"],"word":"看做"},{"definition":["to regard as\/to treat as"],"pinyin":["shi4 zuo4"],"word":"视作"},{"definition":["to view as\/to see as\/to consider to be\/to deem"],"pinyin":["shi4 wei2"],"word":"视为"},{"definition":["to regard as\/to view\/to consider sth as\/to treat as"],"pinyin":["ren4 zuo4"],"word":"认作"},{"definition":["to bring\/to fetch\/to get"],"pinyin":["na2 lai2"],"word":"拿来"},{"definition":["to liken to\/to compare to"],"pinyin":["bi3 zuo4"],"word":"比作"},{"definition":["to take seriously (often with negative expression: \"don't take it too seriously\")\/to treat conscientiously"],"pinyin":["dang4 hui2 shi4"],"word":"当回事"},{"definition":["to look upon\/to regard"],"pinyin":["kan4 dai4"],"word":"看待"},{"definition":["to care about\/to take seriously\/to take to heart"],"pinyin":["fang4 zai4 xin1 shang4"],"word":"放在心上"},{"definition":["to be done\/to be ready\/that's enough!\/that will do!"],"pinyin":["cheng2 le5"],"word":"成了"},{"definition":["to treat\/treatment"],"pinyin":["dui4 dai4"],"word":"对待"},{"definition":["to abandon\/to discard\/to renounce\/to dump (sb)"],"pinyin":["pao1 qi4"],"word":"抛弃"}]}