{"definition":["in front of\/in the presence of"],"pinyin":["dang1 zhe5"],"traditional":["當著"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"当着","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","(onom.) dong\/ding dong (bell)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang4","dang1","dang1"],"word":"当"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"}],"containing_words":[],"sentences":[{"english":"Ay, I don't talk behind a nigga back, I say it in his face.","chinese":"诶，我不会在人背后说三道四，我会当着他的面说。"},{"english":"If you dare to use that word in my hearing again, we part brass rags .","chinese":"如果你敢于当着我的面说那个词，咱俩就一刀两断。"},{"english":"The doctor sliced his arm open right in front of us.","chinese":"医生当着我们的面在他胳膊上割开一条口。"},{"english":"He felt he lost face when his teacher scolded him in front of the class.","chinese":"当老师当着全体同学的面批评他时他感到面子大丢。"},{"english":"He tore up a traffic citation for jaywalking in front of the police officer who'd ticketed him.","chinese":"他当着交通警察的面，把闯越马路的罚单撕掉了。"},{"english":"Instead of stagehands, the actors will move the scenery right in front of the audience.","chinese":"演员们将替代舞台工作人员，当着观众的面置换布景。"},{"english":"It is considered rude to pick your teeth in front of others.","chinese":"当着他人的面剔牙是很不礼貌的。"},{"english":"Act as you would like them to act and do not argue in front of them.","chinese":"表现出你希望他们多活动，不要当着他们的面争吵。"},{"english":"That dragon lady have three gigolo under her husbands nose.","chinese":"那位女强人当着丈夫的面，公开有三位小白脸。"},{"english":"His father had just been trampled under foot and stamped upon in his presence, but by whom?","chinese":"他的父亲刚才被别人当着他的面践踏了一阵，被谁？"},{"english":"He tried to steal sugar under his aunt's very nose, and got his knuckles rapped for it.","chinese":"他当着姨妈的面偷糖吃，结果被她用指关节敲了一顿。"},{"english":"What does it mean to wipe of the dust against you?","chinese":"当着你们擦去脚上的尘土，这是什么意思？"},{"english":"Now when the noodles that wears the madam of Hou Ye begs a madam to help and backs this wedding.","chinese":"现下当着侯爷夫人的面，求夫人成全，退了这头婚事。"},{"english":"Please say it clearly in front of your parents.","chinese":"当着你父母的面，请把事情说清楚。"},{"english":"In China, the opening of a gift in front of the giver is considered improper behavior.","chinese":"在中国，当着送礼人打开礼物是不妥之举。"},{"english":"Self-cleaning work, he only thing we seek the presence of people do?","chinese":"自我清理的工作，他为嘛偏要当着人做呢？"}],"related":[{"definition":["in public\/in front of everybody"],"pinyin":["dang1 zhong4"],"word":"当众"},{"definition":["to sb's face\/in sb's presence"],"pinyin":["dang1 mian4"],"word":"当面"},{"definition":["to contradict (elders or superiors)"],"pinyin":["ding3 zhuang4"],"word":"顶撞"},{"definition":["to be put on the spot\/to find oneself in an awkward situation"],"pinyin":["xia4 bu4 lai2 tai2"],"word":"下不来台"},{"definition":["see 萬目睽睽|万目睽睽[wan4 mu4 kui2 kui2]"],"pinyin":["zhong4 mu4 kui2 kui2"],"word":"众目睽睽"},{"definition":["to lash out\/to reprimand"],"pinyin":["chi4 ze2"],"word":"斥责"},{"definition":["public place with numerous people"],"pinyin":["da4 ting2 guang3 zhong4"],"word":"大庭广众"},{"definition":["to reprimand\/to rebuke\/to berate\/stern criticism"],"pinyin":["xun4 chi4"],"word":"训斥"},{"definition":["to question\/to ask questions\/to inquire\/to bring to account\/to interrogate"],"pinyin":["zhi4 wen4"],"word":"质问"},{"definition":["to speak rudely"],"pinyin":["chu1 yan2 bu4 xun4"],"word":"出言不逊"},{"definition":["to be unable to extricate oneself gracefully\/to be put on the spot\/to be embarrassed"],"pinyin":["xia4 bu5 liao3 tai2"],"word":"下不了台"},{"definition":["to fly into a rage out of humiliation\/to be ashamed into anger (idiom)"],"pinyin":["nao3 xiu1 cheng2 nu4"],"word":"恼羞成怒"},{"definition":["unpleasant talk\/malicious words"],"pinyin":["huai4 hua4"],"word":"坏话"},{"definition":["to be furious\/to fly into a terrible rage"],"pinyin":["da4 fa1 lei2 ting2"],"word":"大发雷霆"},{"definition":["to baffle\/to humiliate\/shame\/dishonor\/humiliation"],"pinyin":["xiu1 ru3"],"word":"羞辱"},{"definition":["to tease\/to make fun of"],"pinyin":["qu3 xiao4"],"word":"取笑"}]}