{"definition":["Yi ethnic group"],"pinyin":["Yi2 zu2"],"traditional":["彞族"],"rank":22260.0,"normalized_rank":0.31144628041358274,"fraction":0.0000019121609342644497,"cumulative_fraction":0.9796703768925642,"word":"彝族","characters":[{"definition":["ancient wine vessel\/ancient sacrificial vessel\/Yi ethnic group\/normal nature of man\/laws and rules"],"pinyin":["yi2"],"word":"彝"},{"definition":["race\/nationality\/ethnicity\/clan\/by extension, social group (e.g. office workers 上班族)"],"pinyin":["zu2"],"word":"族"}],"containing_words":[{"definition":["Honghe Hani and Yi autonomous prefecture in Yunnan 雲南|云南"],"pinyin":["Hong2 he2 Ha1 ni2 zu2 Yi2 zu2 zi4 zhi4 zhou1"],"word":"红河哈尼族彝族自治州"},{"definition":["Liangshan Yi autonomous prefecture, Sichuan"],"pinyin":["Liang2 shan1 Yi2 zu2 zi4 zhi4 zhou1"],"word":"凉山彝族自治州"},{"definition":["Chuxiong Yi autonomous prefecture in central Yunnan, capital Chuxiong city 楚雄市"],"pinyin":["Chu3 xiong2 Yi2 zu2 zi4 zhi4 zhou1"],"word":"楚雄彝族自治州"},{"definition":["Shilin Yi autonomous county in Kunming 昆明[Kun1 ming2], Yunnan"],"pinyin":["Shi2 lin2 Yi2 zu2 Zi4 zhi4 xian4"],"word":"石林彝族自治县"},{"definition":["Ning'er Hani and Yi Autonomous County in Yunnan, capital Pu'er city 普洱市[Pu3 er3 shi4]\/formerly Pu'er Hani and Yi autonomous county"],"pinyin":["Ning2 er3 Ha1 ni2 zu2 Yi2 zu2 Zi4 zhi4 xian4"],"word":"宁洱哈尼族彝族自治县"},{"definition":["Luquan Yi and Miao autonomous county in Kunming 昆明[Kun1 ming2], Yunnan"],"pinyin":["Lu4 quan4 Yi2 zu2 Miao2 zu2 Zi4 zhi4 xian4"],"word":"禄劝彝族苗族自治县"},{"definition":["Weining Yi, Hui and Miao autonomous county in Bijie prefecture 畢節地區|毕节地区[Bi4 jie2 di4 qu1], Guizhou"],"pinyin":["Wei1 ning2 Yi2 zu2 Hui2 zu2 Miao2 zu2 Zi4 zhi4 xian4"],"word":"威宁彝族回族苗族自治县"},{"definition":["Ninglang Yizu Autonomous County in Lijiang 麗江|丽江[Li4 jiang1], Yunnan"],"pinyin":["Ning2 lang4 Yi2 zu2 Zi4 zhi4 xian4"],"word":"宁蒗彝族自治县"},{"definition":["Xundian Hui and Yi autonomous county in Kunming 昆明[Kun1 ming2], Yunnan"],"pinyin":["Xun2 dian4 Hui2 zu2 Yi2 zu2 Zi4 zhi4 xian4"],"word":"寻甸回族彝族自治县"},{"definition":["former Pu'er Hani and Yi autonomous county in Yunnan, renamed in 2007 Ning'er Hani and Yi autonomous county 寧洱哈尼族彞族自治縣|宁洱哈尼族彝族自治县, capital Pu'er city 普洱市"],"pinyin":["Pu3 er3 Ha1 ni2 zu2 Yi2 zu2 Zi4 zhi4 xian4"],"word":"普洱哈尼族彝族自治县"},{"definition":["Jinggu Dai and Yi autonomous county in Pu'er 普洱[Pu3 er3], Yunnan"],"pinyin":["Jing3 gu3 Dai3 zu2 Yi2 zu2 Zi4 zhi4 xian4"],"word":"景谷傣族彝族自治县"},{"definition":["Eshan Yizu autonomous county in Yuxi 玉溪[Yu4 xi1], Yunnan"],"pinyin":["E2 shan1 yi2 zu2 Zi4 zhi4 xian4"],"word":"峨山彝族自治县"},{"definition":["Weishan Yi and Hui autonomous county in Dali Bai autonomous prefecture 大理白族自治州[Da4 li3 Bai2 zu2 zi4 zhi4 zhou1], Yunnan"],"pinyin":["Wei1 shan1 Yi2 zu2 Hui2 zu2 Zi4 zhi4 xian4"],"word":"巍山彝族回族自治县"},{"definition":["Xinping Yi and Dai autonomous county in Yuxi 玉溪[Yu4 xi1], Yunnan"],"pinyin":["Xin1 ping2 Yi2 zu2 Dai3 zu2 Zi4 zhi4 xian4"],"word":"新平彝族傣族自治县"},{"definition":["Nanjian Yizu autonomous county in Dali Bai autonomous prefecture 大理白族自治州[Da4 li3 Bai2 zu2 zi4 zhi4 zhou1], Yunnan"],"pinyin":["Nan2 jian4 yi2 zu2 Zi4 zhi4 xian4"],"word":"南涧彝族自治县"}],"sentences":[{"english":"The ritual displays the custom of ancestor worship of the Yi people.","chinese":"从杀年猪的仪式可以窥视到彝族原始崇拜的一角。"},{"english":"The birth of Torch Festival stems from of the ancient Yi people's worshiping of fire.","chinese":"火把节的诞生始于彝族先民对火的崇拜。"},{"english":"The first chapter directly describes the natural and sociocultural fostering space of Yi flower-drum dance.","chinese":"第一章直接介入彝族花鼓舞的自然人文生境。"},{"english":"\"Haicai Tune\" of the Yi Nationality got its name from a sea-vegetable in Yilong Lake.","chinese":"石屏彝族“海菜腔”是从异龙湖中的海菜而得名的。"},{"english":"It is not even considered imperative that all people of Yi Ethnic Minority learn it.","chinese":"人们并不认为所有彝族人绝对要学习彝语。"},{"english":"Reflects the Torch Festival of Yi people in Yunnan defying brutal force for the struggle against the spirit of a happy life.","chinese":"反映了云南与对幸福生活的斗争精神暴力彝族火把节。"},{"english":"The Liangshan Yi are an ethnic group at risk;","chinese":"凉山彝族正面临危险。"},{"english":"The Gourd Myth shows the worship for the reproductive capacity of the maternal body amon…","chinese":"彝族谷种神话无一例外地体现了对母体的崇拜。"},{"english":"The Yi world in the field of vision of emic and etic research.","chinese":"主客位研究视野中的彝族世界。"},{"english":"Juding by her dress, she may be of the Yi nationality.","chinese":"从她的打扮看，她或许是彝族。"},{"english":"He is a well-known intellectual among the Yi people.","chinese":"他是彝族人中有名的智者。"},{"english":"The Pemo is central character in the ceremony offering sacrifices to Yi people ancestor.","chinese":"“毕摩”是彝族宗教信仰活动的中心人物。"},{"english":"four lost their interest in Yi traditional culture.","chinese":"四个人已经失去了对彝族文海的兴趣。"},{"english":"Yi ethnic wedding is taking place over there.","chinese":"那边好像有彝族人在结婚。"},{"english":"The Gourd Myth shows the worship for the reproductive capacity of the maternal body among the …","chinese":"彝族谷种神话无一例外地体现了对母体的崇拜。"},{"english":"Developing the Yi nationality medicine, in theory we need further excavation and unscrambling.","chinese":"发展彝族医药，应在理论上进一步加以挖掘整理。"}],"related":[{"definition":["Lisu ethnic group of Yunnan"],"pinyin":["Li4 su4 zu2"],"word":"傈僳族"},{"definition":["Pumi ethnic group"],"pinyin":["Pu3 mi3 zu2"],"word":"普米族"},{"definition":["Hmong or Miao ethnic group of southwest China"],"pinyin":["Miao2 zu2"],"word":"苗族"},{"definition":["Hani ethnic group"],"pinyin":["Ha1 ni2 zu2"],"word":"哈尼族"},{"definition":["Jingpo ethnic group of Tibet and Yunnan"],"pinyin":["Jing3 po1 zu2"],"word":"景颇族"},{"definition":["Lahu ethnic group of Yunnan"],"pinyin":["La1 hu4 zu2"],"word":"拉祜族"},{"definition":["Wa, Kawa or Va ethnic group of Myanmar, south China and southeast Asia"],"pinyin":["Wa3 zu2"],"word":"佤族"},{"definition":["Jinuo ethnic group"],"pinyin":["Ji1 nuo4 zu2"],"word":"基诺族"},{"definition":["Lisu ethnic group of Yunnan"],"pinyin":["Li4 su4"],"word":"傈僳"},{"definition":["Zhuang ethnic group of Guangxi, the PRC's second most numerous ethnic group"],"pinyin":["Zhuang4 zu2"],"word":"壮族"},{"definition":["Jingpo ethnic group of Tibet and Yunnan"],"pinyin":["Jing3 po1"],"word":"景颇"},{"definition":["Gelao or Klau ethnic group of Guizhou"],"pinyin":["Ge1 lao3 zu2"],"word":"仡佬族"},{"definition":["Nakhi ethnic group in Yunnan"],"pinyin":["Na4 xi1 zu2"],"word":"纳西族"},{"definition":["Bai (ethnic group)"],"pinyin":["Bai2 zu2"],"word":"白族"},{"definition":["Nu ethnic group"],"pinyin":["Nu4 zu2"],"word":"怒族"},{"definition":["Blang people, one of the 56 ethnic groups officially recognized by the PRC"],"pinyin":["Bu4 lang3 zu2"],"word":"布朗族"}]}