{"definition":["journey\/expedition\/voyage"],"pinyin":["zheng1 cheng2"],"traditional":["征程"],"rank":11865.0,"normalized_rank":0.16600674380535307,"fraction":0.000006229303271079233,"cumulative_fraction":0.9430881494528524,"word":"征程","characters":[{"definition":["to invite\/to recruit\/to levy (taxes)\/to draft (troops)\/phenomenon\/symptom\/characteristic sign (used as proof)\/evidence","journey\/trip\/expedition\/to go on long campaign\/to attack"],"pinyin":["zheng1","zheng1"],"word":"征"},{"definition":["surname Cheng","rule\/order\/regulations\/formula\/journey\/procedure\/sequence"],"pinyin":["Cheng2","cheng2"],"word":"程"}],"containing_words":[],"sentences":[{"english":"How Far Will the Oklahoma City Thunder Go in the Playoffs?","chinese":"雷霆队能在季后赛的征程中走多远？"},{"english":"Take a journey to find your dream.","chinese":"踏上征程去寻梦。"},{"english":"combination of community-sourced content and algorithmically-driven smarts is forging a promising path towards this potential future.","chinese":"这种结合铸造了朝向潜在未来的光明征程。"},{"english":"Some might get no farther than Bristol.","chinese":"对有些人来说，征程可能不会远于布里斯托。"},{"english":"And we don't have much time left to make that journey.","chinese":"为了奔赴征程，我们剩余的时间已经不多。"},{"english":"The quest to develop fortified genetically modified (GM) plants has yielded mixed results.","chinese":"开发强化转基因作物的征程获得了悲喜交加的结果。"},{"english":"A group of heroes begins a quest to defeat Diablo and his brothers.","chinese":"一群英雄踏上了击杀迪亚波罗和它的兄弟们的征程。"},{"english":"She said good-bye, and for the first time, they went their separate ways. Monday, Tuesday, Wednesday, Thursday…","chinese":"说了声再见，她就踏上了第一次独立的征程。"},{"english":"The Chinese people are now going all out to build a well-off society in all aspects.","chinese":"中国人民正在全面建设小康社会的征程上奋勇前进。"},{"english":"The Japanese government is embarking on a long and perilous road to resuscitating its bank system.","chinese":"日本政府踏上了复兴其银行业的漫长而艰险的征程。"},{"english":"The Blues start their bid for a hat-trick of titles at home to Manchester City on Sunday.","chinese":"蓝军周日主场将打曼城，来开始他们三冠王的征程。"},{"english":"But this is just the beginning, says Dr Greenhalgh.","chinese":"但这只是千里征程第一步，格林浩尔博士说。"},{"english":"They started off to Normandie at midnight.","chinese":"他们在午夜踏上了开赴诺曼底的征程。"},{"english":"It was on to striving toward the next achievement.","chinese":"而是踏上取得下一个成就的征程。"}],"related":[{"definition":["long journey\/trek\/course of an expedition"],"pinyin":["zheng1 tu2"],"word":"征途"},{"definition":["writing\/sections and chapters"],"pinyin":["pian1 zhang1"],"word":"篇章"},{"definition":["to set foot on\/to step on or into"],"pinyin":["ta4 shang4"],"word":"踏上"},{"definition":["course\/process"],"pinyin":["li4 cheng2"],"word":"历程"},{"definition":["to stride toward (success)\/to march toward\/to take a step toward"],"pinyin":["mai4 xiang4"],"word":"迈向"},{"definition":["to compose (a piece of music)\/(fig.) to create, by one's actions, a narrative (generally one that can be recounted with pride)"],"pinyin":["pu3 xie3"],"word":"谱写"},{"definition":["(of a ship) to set sail\/(of an aeroplane) to take off\/also written 啟航|启航[qi3 hang2]"],"pinyin":["qi3 hang2"],"word":"起航"},{"definition":["to advance singing loudly (idiom); triumphant progress"],"pinyin":["gao1 ge1 meng3 jin4"],"word":"高歌猛进"},{"definition":["new age"],"pinyin":["xin1 shi2 dai4"],"word":"新时代"},{"definition":["(of a ship) to set sail\/(of an aeroplane) to take off\/also written 起航[qi3 hang2]"],"pinyin":["qi3 hang2"],"word":"启航"},{"definition":["milestone"],"pinyin":["li3 cheng2 bei1"],"word":"里程碑"},{"definition":["army life (idiom)\/the experience of war"],"pinyin":["rong2 ma3 sheng1 ya2"],"word":"戎马生涯"},{"definition":["mission\/long-term task to which one devotes oneself\/a calling"],"pinyin":["shi3 ming4"],"word":"使命"},{"definition":["campaign\/expedition"],"pinyin":["zheng1 zhan4"],"word":"征战"},{"definition":["lit. to cut one's way through thistles and thorns (idiom)\/fig. to overcome all obstacles on the way\/to break through hardships\/to blaze a new trail"],"pinyin":["pi1 jing1 zhan3 ji2"],"word":"披荆斩棘"},{"definition":["splendid\/glorious"],"pinyin":["hui1 huang2"],"word":"辉煌"}]}