{"definition":["the gains do not make up for the losses (idiom)"],"pinyin":["de2 bu4 chang2 shi1"],"traditional":["得不償失"],"rank":18706.0,"normalized_rank":0.2617212094077484,"fraction":0.000002732847152482232,"cumulative_fraction":0.97152375544364,"word":"得不偿失","characters":[{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to repay\/to compensate for\/to recompense\/to fulfill (hopes etc)"],"pinyin":["chang2"],"word":"偿"},{"definition":["to lose\/to miss\/to fail"],"pinyin":["shi1"],"word":"失"}],"containing_words":[],"sentences":[{"english":"Some clothes are not the advisability of using either washing machines wash, or it will lose.","chinese":"有些衣物则不宜用洗衣机洗涤，否则将得不偿失。"},{"english":"This is a Pyrrhic victory for Basildon council.","chinese":"对于巴西尔登地方议会来说，这个胜利得不偿失。"},{"english":"This is why I say this is a Pyrrhic victory.","chinese":"这就是为什么我把这看作一种得不偿失。"},{"english":"In general, using regulation to create a pared-down financial industry will be costly.","chinese":"总的来说，监管只能束缚金融业，得不偿失。"},{"english":"They get excited about their Pyrrhic victory.","chinese":"他们为自己得不偿失的胜利而兴奋。"}],"related":[{"definition":["to save a little only to lose a lot (idiom)"],"pinyin":["yin1 xiao3 shi1 da4"],"word":"因小失大"},{"definition":["not worth it"],"pinyin":["hua2 bu5 lai2"],"word":"划不来"},{"definition":["to produce the opposite of the desired result"],"pinyin":["shi4 de2 qi2 fan3"],"word":"适得其反"},{"definition":["it isn't worth it\/not cost-effective\/not profitable\/too expensive"],"pinyin":["bu4 hua2 suan4"],"word":"不划算"},{"definition":["having given away a bride, to lose one's army on top of it (idiom)\/to suffer a double loss after trying to trick the enemy"],"pinyin":["pei2 le5 fu1 ren2 you4 zhe2 bing1"],"word":"赔了夫人又折兵"},{"definition":["to waste all one's previous efforts (idiom)\/all that has been achieved goes down the drain"],"pinyin":["qian2 gong1 jin4 qi4"],"word":"前功尽弃"},{"definition":["it will cause no end of trouble (idiom)"],"pinyin":["hou4 huan4 wu2 qiong2"],"word":"后患无穷"},{"definition":["to overreach oneself\/to try to be clever and end up with egg on one's face"],"pinyin":["nong4 qiao3 cheng2 zhuo1"],"word":"弄巧成拙"},{"definition":["harmful and without benefit (idiom); more harm than good"],"pinyin":["you3 hai4 wu2 li4"],"word":"有害无利"},{"definition":["to neglect the root and pursue the tip (idiom)\/to neglect fundamentals and concentrate on details"],"pinyin":["she3 ben3 zhu2 mo4"],"word":"舍本逐末"},{"definition":["lit. to try to steal a chicken only to end up losing the rice used to lure it (idiom)\/fig. to try to gain an advantage only to end up worse off\/to go for wool and come back shorn"],"pinyin":["tou1 ji1 bu4 cheng2 shi2 ba3 mi3"],"word":"偷鸡不成蚀把米"},{"definition":["to cost one dearly\/to end disastrously\/to pay bitterly"],"pinyin":["chi1 da4 kui1"],"word":"吃大亏"},{"definition":["irreversible"],"pinyin":["bu4 ke3 wan3 hui2"],"word":"不可挽回"},{"definition":["to let go of the big prize while grabbing at trifles (idiom)"],"pinyin":["jian3 le5 zhi1 ma5 diu1 le5 xi1 gua1"],"word":"捡了芝麻丢了西瓜"},{"definition":["twice the effort for half the result"],"pinyin":["shi4 bei4 gong1 ban4"],"word":"事倍功半"},{"definition":["if not\/otherwise\/else\/or else"],"pinyin":["fou3 ze2"],"word":"否则"}]}