{"definition":["able to\/so that sb can\/enabling\/in order to\/finally in a position to\/with sth in view"],"pinyin":["de2 yi3"],"traditional":["得以"],"rank":3260.0,"normalized_rank":0.04561162956640969,"fraction":0.00004357271586439127,"cumulative_fraction":0.8026015283945388,"word":"得以","characters":[{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["old variant of 以[yi3]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)","abbr. for Israel 以色列[Yi3 se4 lie4]","old variant of 以[yi3]"],"pinyin":["yi3","yi3","Yi3","yi3"],"word":"以"}],"containing_words":[],"sentences":[{"english":"This construction has survived the Crimean War and the WWII.","chinese":"这幢建筑在克里米亚战争和二战中得以幸存。"},{"english":"The dispute was settled by mediation of the third country.","chinese":"这场争端通过第三国的斡旋而得以解决。"},{"english":"Village work to get to meet with siew, he put away the resolution dove.","chinese":"中村功得以脱身去与萧船见面，他决议除掉白鸽。"},{"english":"Then the eye is relaxed for distance and the entire amount of focusing ability is available to see close.","chinese":"远视的眼睛得以松弛，用全部调焦能力近看。"},{"english":"As a result, fewer of the plants are being pollinated and bearing fruit.","chinese":"因此，得以授粉并结果的植物越来越少。"},{"english":"What happened is that a group of Jihadists managed to infiltrate the town over night.","chinese":"一股圣战组织成员在夜间得以渗入廷巴克图。"},{"english":"Their position enabled them to usurp power.","chinese":"他们所处的地位使其得以篡权。"},{"english":"That the man of God may be complete, fully equipped for every good work.","chinese":"叫属神的人得以完备，为着各样的善工，装备齐全。"},{"english":"Now I, his coddled son, get to dick around on the Internet all day.","chinese":"现在，他溺爱的孙子，我，才得以网络上混口饭吃。"},{"english":"Gains are realized when assets are liquidated to cash.","chinese":"当资产进行清算兑现后，收益得以实现。"},{"english":"Mr Sallah had only recently had earlier charges dropped against him, following public pressure.","chinese":"迫于公众压力，先前对他的指控最近才得以消除。"},{"english":"When the first paraglider appeared, People's dream came true.","chinese":"自从飞行伞出现后，人们的这一愿望得以实现。"},{"english":"And that is how illusion and delusion vanishes .","chinese":"唯有放下，所有幻觉与假相才得以消失。"},{"english":"Sakyamuni was thus able to continue his journey.","chinese":"释迦牟尼由此得以继续行程。"},{"english":"He was bedridden for three weeks, but ultimately healed.","chinese":"随后，杰克逊三周卧床不起，但最终得以康复。"},{"english":"They rejoice in your name all day long; they exult in your righteousness.","chinese":"他们因你的名终日欢乐，因你的公义得以高举。"}],"related":[{"definition":["usable\/workable\/feasible\/doable\/to make\/to cause"],"pinyin":["shi3 de5"],"word":"使得"},{"definition":["to make\/to cause\/to enable\/to use\/to employ\/to send\/to instruct sb to do sth\/envoy\/messenger"],"pinyin":["shi3"],"word":"使"},{"definition":["ability\/talent\/sb of a certain type\/a capable individual\/only\/only then\/just now","a moment ago\/just now\/(indicating sth happening later than expected)\/(preceded by a clause of condition or reason) not until\/(followed by a numerical clause) only"],"pinyin":["cai2","cai2"],"word":"才"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"从而"},{"definition":["to be saved from\/to be spared (something)"],"pinyin":["mian3 yu2"],"word":"免于"},{"definition":["to be capable of\/to be able to\/can"],"pinyin":["neng2 gou4"],"word":"能够"},{"definition":["to yield\/to permit\/to let sb do sth\/to have sb do sth\/to make sb (feel sad etc)\/by (indicates the agent in a passive clause, like 被[bei4])"],"pinyin":["rang4"],"word":"让"},{"definition":["until"],"pinyin":["zhi2 dao4"],"word":"直到"},{"definition":["cannot\/to fail to\/unable to"],"pinyin":["wei4 neng2"],"word":"未能"},{"definition":["(emphasizes that sth is precisely or exactly as stated)\/precisely\/exactly\/even\/if\/just like\/in the same way as"],"pinyin":["zheng4 shi4"],"word":"正是"},{"definition":["talent\/ability\/capacity"],"pinyin":["cai2 neng2"],"word":"才能"},{"definition":["hard to (predict, imagine etc)"],"pinyin":["nan2 yi3"],"word":"难以"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通过"},{"definition":["therefore\/as a result\/thus\/and as a result, ..."],"pinyin":["yin1 er2"],"word":"因而"},{"definition":["to get\/to obtain\/to receive"],"pinyin":["de2 dao4"],"word":"得到"},{"definition":["in order to\/hoping to\/attempting to\/waiting for"],"pinyin":["yi3 qi1"],"word":"以期"}]}