{"definition":["to obtain (results)\/to arrive at (a conclusion)"],"pinyin":["de2 chu1"],"traditional":["得出"],"rank":4469.0,"normalized_rank":0.0625271081387377,"fraction":0.000028475417739076526,"cumulative_fraction":0.8450993978543628,"word":"得出","characters":[{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"That's according to a new AP Ipsos poll.","chinese":"这是根据最新的美联社依普索民意调查得出的结论。"},{"english":"If the conclusions can not be applied in practice, better dump them when it is still early.","chinese":"如果得出结论不能在实践中应用，趁早扔了。"},{"english":"Therefore it is feasible to obtain the electronic administrative affairs of village in our country's new rural construction.","chinese":"由此得出电子村务在我国新农村建设中的可行性。"},{"english":"At last that RFID is IT Pioneer is concluded.","chinese":"最后本文得出RFID是IT“尖兵”的结论。"},{"english":"Still, like I used to tell you, no conclusions based on assumptions.","chinese":"还是如我所告诉你的，不能再假设中得出结论。"},{"english":"Although, only a human mind could invent something as insipid as love.","chinese":"尽管，只有人类思维才发明得出爱情这般乏味的东西。"},{"english":"Finally, he incorporated some compromises suggested by others into a specific motion.","chinese":"最后，他整合了一些各个方面建议，得出折衷议案。"},{"english":"This yields NT$18,000 or so of disposable income for each person in the household every month.","chinese":"得出家中每人每月可支配所得是一万八千多元。"},{"english":"It's the best way out of this discussion.","chinese":"这是经过这次讨论得出的最好做法。"},{"english":"These results suggest that the antimutagenic and anticancer effect of White Tea are better than that of Green Tea.","chinese":"由此得出，白茶的抗突变和体外抗癌效果好于绿茶。"},{"english":"I have arrived at seven billion myself, theoretically.","chinese":"在理论上，我自己得出的数字为七十亿。"},{"english":"The result obtained is of importance in guiding the ground-pressure control and mining procties.","chinese":"得出的结论对于控制地压和采矿生产有指导意义。"},{"english":"Currid’s conclusion, based on dozens of interviews, is less sublime.","chinese":"克里德做了几十个采访后得出的结论可没有这么高尚。"},{"english":"The changes of the fabric characteristics can be qualitatively giv…","chinese":"通过分析可以定性地得出其特性的变化。"},{"english":"Moreover, the reactive force between slab and roller is obtained in this paper.","chinese":"此外，还得出了铸坯对夹辊的作用力。"},{"english":"We both arrived at the same conclusion.","chinese":"我们两个得出了一致的结论。"}],"related":[{"definition":["conclusion\/verdict\/CL:個|个[ge4]\/to conclude\/to reach a verdict"],"pinyin":["jie2 lun4"],"word":"结论"},{"definition":["derivation\/to deduce"],"pinyin":["tui1 dao3"],"word":"推导"},{"definition":["to figure out"],"pinyin":["suan4 chu1"],"word":"算出"},{"definition":["to infer\/to deduce\/to predict\/to extrapolate"],"pinyin":["tui1 duan4"],"word":"推断"},{"definition":["to judge\/to determine\/judgment"],"pinyin":["pan4 duan4"],"word":"判断"},{"definition":["to infer\/inference\/corollary\/reasoned conclusion"],"pinyin":["tui1 lun4"],"word":"推论"},{"definition":["to analyze\/analysis\/CL:個|个[ge4]"],"pinyin":["fen1 xi1"],"word":"分析"},{"definition":["to conclude\/to determine\/to come to a judgment"],"pinyin":["duan4 ding4"],"word":"断定"},{"definition":["to find\/to search out"],"pinyin":["zhao3 chu1"],"word":"找出"},{"definition":["to count\/to calculate\/to compute\/CL:個|个[ge4]"],"pinyin":["ji4 suan4"],"word":"计算"},{"definition":["to suppose\/to presume\/to assume\/supposing that ...\/if\/hypothesis\/conjecture"],"pinyin":["jia3 she4"],"word":"假设"},{"definition":["to make out\/to see"],"pinyin":["kan4 chu1"],"word":"看出"},{"definition":["speculation\/to conjecture\/to surmise\/to speculate"],"pinyin":["tui1 ce4"],"word":"推测"},{"definition":["more or less\/roughly\/approximately"],"pinyin":["da4 zhi4"],"word":"大致"},{"definition":["evidently\/clearly\/no wonder\/knowable"],"pinyin":["ke3 zhi1"],"word":"可知"},{"definition":["to sum up\/to summarize\/to conclude from facts\/induction (method of deduction in logic)"],"pinyin":["gui1 na4"],"word":"归纳"}]}