{"definition":["to get\/to obtain\/to receive"],"pinyin":["de2 dao4"],"traditional":["得到"],"rank":261.0,"normalized_rank":0.0036517286247953772,"fraction":0.000468001644122071,"cumulative_fraction":0.4246438852764731,"word":"得到","characters":[{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"}],"containing_words":[{"definition":["available"],"pinyin":["ke3 de2 dao4"],"word":"可得到"}],"sentences":[{"english":"RS_Halion_Phase2. wav - You will find only suffering within the realm of Twilight.","chinese":"在暮光的势力范围，你得到的只有痛苦。"},{"english":"At the end of the term, you typically get no cash back.","chinese":"固定年限到期后，你一般不会得到任何现金返还。"},{"english":"Closed laser intensity Langevin equation is got.","chinese":"得到封闭的光强朗之万方程。"},{"english":"The verification and measurement plan of checking fixture dimension should be confirmed by YFV engineer.","chinese":"检具的尺寸验证测量计划需得到延锋工程师的确认。"},{"english":"Ten nets are exquisite and regular, seemlingly having gained mercy of gods.","chinese":"网织的精巧而规矩，八卦形的张开，仿佛得到神主。"},{"english":"The cases have been laboratory confirmed by the Institut Pasteur, Dakar.","chinese":"这些病例已得到达喀尔巴斯德研究所的实验室确认。"},{"english":"No junketing activity would be conducted on official expenses without permission of the company.","chinese":"在未得到公司授权情况下，不得以公费进行宴请活动。"},{"english":"You can get the norwalk virus from hand to mouth activity or from contaminated food.","chinese":"你可以得到手诺瓦克病毒污染的食物或活动口。"},{"english":"So, that is how we got the diffusion equation.","chinese":"这就是得到扩散方程的过程。"},{"english":"The copolymer was wet spun to get flame-retardant fiber.","chinese":"将共聚物通过湿法纺丝，得到了阻燃纤维。"},{"english":"I always get a negative response.","chinese":"我向来都得到否定的回答。"},{"english":"I think it depends what they're offered, ' said Lupin .","chinese":"“我想这取决于他们会得到什么好处，”卢平说。"},{"english":"After making some simplifying assumptions, this paper obtains the fatigue life of steel towers.","chinese":"在作了一些简化假设后，得到了钢塔架疲劳寿命。"},{"english":"How do almond-flavored liqueurs derive their flavor?","chinese":"杏味甜酒是怎样得到这种味道的？"},{"english":"And I heard it helps to have funding in advance too.","chinese":"而且我听说这也有助于提前得到资助。"},{"english":"Those opinions and propositions were agreed upon and echoed by many participating leaders.","chinese":"这些观点和主张得到许多与会领导人的赞同和呼应。"}],"related":[{"definition":["to obtain\/to receive\/to get"],"pinyin":["huo4 de2"],"word":"获得"},{"definition":["to receive (praise, an education, punishment etc)\/to be ...ed (praised, educated, punished etc)"],"pinyin":["shou4 dao4"],"word":"受到"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["to approve\/approval\/acknowledgment\/OK"],"pinyin":["ren4 ke3"],"word":"认可"},{"definition":["to win\/to gain"],"pinyin":["ying2 de2"],"word":"赢得"},{"definition":["to be capable of\/to be able to\/can"],"pinyin":["neng2 gou4"],"word":"能够"},{"definition":["to contribute\/to dedicate\/to devote\/contribution\/CL:個|个[ge4]"],"pinyin":["gong4 xian4"],"word":"贡献"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["to accord\/to give\/to show (respect)"],"pinyin":["ji3 yu3"],"word":"给予"},{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["to harvest\/to reap\/to gain\/crop\/harvest\/profit\/gain\/bonus\/reward","variant of 收穫|收获[shou1 huo4]"],"pinyin":["shou1 huo4","shou1 huo4"],"word":"收获"},{"definition":["to acquire\/to get\/to obtain"],"pinyin":["qu3 de2"],"word":"取得"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["able to\/so that sb can\/enabling\/in order to\/finally in a position to\/with sth in view"],"pinyin":["de2 yi3"],"word":"得以"},{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"},{"definition":["however\/yet\/but"],"pinyin":["ran2 er2"],"word":"然而"}]}