{"definition":["appropriate\/suitable"],"pinyin":["de2 dang4"],"traditional":["得當"],"rank":13778.0,"normalized_rank":0.1927720957564395,"fraction":0.000004810984648488699,"cumulative_fraction":0.9535878654327232,"word":"得当","characters":[{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","(onom.) dong\/ding dong (bell)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang4","dang1","dang1"],"word":"当"}],"containing_words":[],"sentences":[{"english":"You can count on being well-treated, as long as you behave yourself.","chinese":"只要你行为得当，保证就会得到善待。"},{"english":"You will have a productive day if you organize yourself well at work.","chinese":"如果工作安排得当，肯定能度过富有成效的一天。"},{"english":"It's a question of getting the right mix of policies to appeal to the electorate.","chinese":"问题是要有能投合选民心意的一整套相配得当的政策。"},{"english":"Floor are the proportion of properly, a deep eaves, cornices pick angle.","chinese":"楼身比例得当，出檐深邃，飞檐挑角。"},{"english":"If one handles small matters poorly, how can one handle large matters capably?","chinese":"如果连小事都无法管理得当，又哪有能力去处理大事？"},{"english":"First, ask yourself if you are acting honourably .","chinese":"首先，你应该问问你自己做得是否得当。"},{"english":"Nor is the charge of over-refinement altogether applicable to the Brahmins.","chinese":"指责绅士派文人过于文雅，也并非完全得当。"},{"english":"You have to be product manager, if not the actual coder and designer.","chinese":"就算不去搞编程设计，你也得当产品经理。"},{"english":"If venting is done carefully, there will be little leakage.","chinese":"如果释放压力得当的话，泄露将会非常少。"},{"english":"Appropriate educational methods, in the Student Union memories that last a lifetime impression.","chinese":"教育方法得当，中学生会留下终身难忘的印象。"},{"english":"If cared for properly, standard cells are very stable.","chinese":"如果处理得当，标准电池是非常稳定的。"},{"english":"When used appropriately, these medications can be very helpful and have few side effects.","chinese":"使用得当的话，这些药会很有效且几乎无副作用。"},{"english":"The effectiveness of your speech depends on your diction.","chinese":"你的演说效果在于你的用字是否得当。"},{"english":"If used properly, Weibo can also be effective in countering negative news.","chinese":"如果使用得当，微博还可以有效消除负面新闻。"},{"english":"The machine will go on working for years provided (that) it is looked after properly.","chinese":"这台机器如保养得当，就将继续工作很多年。"},{"english":"Be honest, use proper grammar and avoid slang and expletives.","chinese":"要坦诚，用语得当，并避免俚语和粗话。"}],"related":[{"definition":["appropriate\/suitable"],"pinyin":["qia4 dang4"],"word":"恰当"},{"definition":["it's just perfect\/it's just right"],"pinyin":["qia4 dao4 hao3 chu4"],"word":"恰到好处"},{"definition":["rational\/reasonable\/fair"],"pinyin":["he2 li3"],"word":"合理"},{"definition":["in addition\/moreover\/(used before a disyllabic verb to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["jia1 yi3"],"word":"加以"},{"definition":["half the work, twice the effect (idiom); the right approach saves effort and leads to better results\/a stitch in time saves nine"],"pinyin":["shi4 ban4 gong1 bei4"],"word":"事半功倍"},{"definition":["fabulous\/superb\/excellent"],"pinyin":["ji2 hao3"],"word":"极好"},{"definition":["moreover\/besides"],"pinyin":["zai4 zhe3"],"word":"再者"},{"definition":["in short\/in a word\/in brief"],"pinyin":["zong3 er2 yan2 zhi1"],"word":"总而言之"},{"definition":["appropriate\/proper\/ready"],"pinyin":["tuo3 dang5"],"word":"妥当"},{"definition":["adequate\/sufficient\/abundant"],"pinyin":["chong1 zu2"],"word":"充足"},{"definition":["suitable\/appropriate"],"pinyin":["shi4 yi2"],"word":"适宜"},{"definition":["lit. what the heart wishes, the hand accomplishes (idiom) skilled at the job\/entirely in one's element\/going smoothly and easily"],"pinyin":["de2 xin1 ying4 shou3"],"word":"得心应手"},{"definition":["if"],"pinyin":["ruo4 shi4"],"word":"若是"},{"definition":["suitable\/appropriate"],"pinyin":["shi4 dang4"],"word":"适当"},{"definition":["to get to the intended location\/to be in place\/to be in position\/precise\/well (done)"],"pinyin":["dao4 wei4"],"word":"到位"},{"definition":["if\/in case\/in the event that"],"pinyin":["ru2 guo3"],"word":"如果"}]}