{"definition":["to win power\/to get authority\/to become dominant"],"pinyin":["de2 shi4"],"traditional":["得勢"],"rank":32984.0,"normalized_rank":0.4614889538706925,"fraction":7.23173163474012e-7,"cumulative_fraction":0.9927125266624658,"word":"得势","characters":[{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["power\/influence\/potential\/momentum\/tendency\/trend\/situation\/conditions\/outward appearance\/sign\/gesture\/male genitals"],"pinyin":["shi4"],"word":"势"}],"containing_words":[],"sentences":[{"english":"They, too, are a good barometer of who is up and who is down.","chinese":"这同样也是体现谁家得势谁家失意很好的晴雨表。"},{"english":"There is no imminent threat of the government being overthrown, but the Taliban has gained momentum.","chinese":"近期不存在阿政府被颠覆的危险，但塔利班开始得势。"},{"english":"Leafs will be astrut in breeze but chill when gale makes them falling down.","chinese":"树叶得势时趾高气扬，失意时威风扫地。"},{"english":"Those members of Crown Prince Party have risen to fame on the coat-tails of their fathers.","chinese":"太子党成员之所以得势不过是靠父亲而已。"}],"related":[{"definition":["to hold power"],"pinyin":["dang1 quan2"],"word":"当权"},{"definition":["to wield (political etc) power\/be in power"],"pinyin":["zhang3 quan2"],"word":"掌权"},{"definition":["to be in a position of power"],"pinyin":["da4 quan2 zai4 wo4"],"word":"大权在握"},{"definition":["to overthrow\/downfall\/to fall from power\/to go bankrupt"],"pinyin":["dao3 tai2"],"word":"倒台"},{"definition":["one-party (state)"],"pinyin":["yi1 dang3"],"word":"一党"},{"definition":["bossy and domineering\/throwing one's weight about"],"pinyin":["fei1 yang2 ba2 hu4"],"word":"飞扬跋扈"},{"definition":["lit. see the wind and set the helm (idiom); fig. to act pragmatically\/to be flexible and take advantage of the situation"],"pinyin":["jian4 feng1 shi3 duo4"],"word":"见风使舵"},{"definition":["to be a favorite\/favor"],"pinyin":["de2 chong3"],"word":"得宠"},{"definition":["to curry favor (idiom); playing up to those in power\/social climbing"],"pinyin":["qu1 yan2 fu4 shi4"],"word":"趋炎附势"},{"definition":["to accomplish one's ambition\/a dream come true\/to enjoy success"],"pinyin":["de2 zhi4"],"word":"得志"},{"definition":["to take advantage of a favorable situation\/to seize an opportunity"],"pinyin":["chen4 shi4"],"word":"趁势"},{"definition":["When the tree topples the monkeys scatter. (idiom); fig. an opportunist abandons an unfavorable cause\/Rats leave a sinking ship."],"pinyin":["shu4 dao3 hu2 sun1 san4"],"word":"树倒猢狲散"},{"definition":["domineering\/bossy"],"pinyin":["ba2 hu4"],"word":"跋扈"},{"definition":["to take advantage of one's position to bully people (idiom)\/to kick people around"],"pinyin":["zhang4 shi4 qi1 ren2"],"word":"仗势欺人"},{"definition":["political enemy\/opponent"],"pinyin":["zheng4 di2"],"word":"政敌"},{"definition":["(of status or wealth) to decline\/(of buildings etc) to become dilapidated\/run-down\/(of plants) to wilt"],"pinyin":["bai4 luo4"],"word":"败落"}]}