{"definition":["to accomplish one's ambition\/a dream come true\/to enjoy success"],"pinyin":["de2 zhi4"],"traditional":["得誌"],"rank":39407.0,"normalized_rank":0.5513550571544499,"fraction":4.0625573555675716e-7,"cumulative_fraction":0.9962542367212556,"word":"得志","characters":[{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["aspiration\/ambition\/the will","sign\/mark\/to record\/to write a footnote"],"pinyin":["zhi4","zhi4"],"word":"志"}],"containing_words":[{"definition":["soured by the loss of one's hopes"],"pinyin":["yu4 yu4 bu4 de2 zhi4"],"word":"郁郁不得志"},{"definition":["lit. a vile character flourishes (idiom)\/fig. an inferior person gets into a position of power, becoming conceited and arrogant"],"pinyin":["xiao3 ren2 de2 zhi4"],"word":"小人得志"}],"sentences":[{"english":"This in turn blighted his middle years.","chinese":"这最终使他在中年郁郁不得志。"},{"english":"He is very persuasive and you need to be pretty strong-minded to say no to him.","chinese":"他很善于说服人，得志很坚强的人才能跟他说不。"},{"english":"The second is the unsuccessful scholars' spiritual sustenance and restructuring of the value.","chinese":"不得志文人的精神寄托和价值重构之所。"},{"english":"He who delights in slaughter will not succeed in his ambition to rule the world.","chinese":"夫乐杀人者，则不可以得志于天下矣。"},{"english":"Deng Guida's colleague Huang Dezhi was also wounded in the incident.","chinese":"邓贵大同事黄得志也一同受伤。"},{"english":"The consequence of your failing is to make flunkies achieve their ambition while talents shed tears.","chinese":"你学不会的结果是小人得志，人才流泪。"},{"english":"Most actors toil in obscurity, never stepping into the spotlight.","chinese":"大多数演员都郁郁不得志，从未真正站到舞台中央。"},{"english":"Your present life sover atisfthing?","chinese":"你对现在的生活得志吗？"},{"english":"He thought too much of himself and was getting too big for his boots, though he kept his thoughts to himself.","chinese":"他少年得志，目中无人，不过没有表露出来。"},{"english":"Here bad people hold sway while good people suffer and justice is trodden down underfoot.","chinese":"在这里坏人得志，好人受苦，正义受到摧残。"},{"english":"Red chardonnay was frustrated in the restaurant drink, was the shopkeeper for arrears.","chinese":"赤霞郁郁不得志的在酒家喝酒，却被掌柜追讨欠款。"},{"english":"The film hero is a rather Tanner blossom actor.","chinese":"本片主人公丹拿是一个颇不得志的演员。"},{"english":"When you're up and well, remember to keep your feet down.","chinese":"当你得志的时候，记得保持脚踏实地。"},{"english":"The last months and days of Simon Bolivar, the brilliant and thwarted liberator of South America.","chinese":"南美洲卓越但不得志的解放者波利瓦尔最后一段时日。"}],"related":[{"definition":["flushed with success\/proud of one's success (in exams, promotion etc)\/as pleased as punch"],"pinyin":["chun1 feng1 de2 yi4"],"word":"春风得意"},{"definition":["soured by the loss of one's hopes"],"pinyin":["yu4 yu4 bu4 de2 zhi4"],"word":"郁郁不得志"},{"definition":["disappointed\/frustrated"],"pinyin":["shi1 yi4"],"word":"失意"},{"definition":["fully content with one's achievements (idiom)\/complacent"],"pinyin":["zhi4 de2 yi4 man3"],"word":"志得意满"},{"definition":["lit. a vile character flourishes (idiom)\/fig. an inferior person gets into a position of power, becoming conceited and arrogant"],"pinyin":["xiao3 ren2 de2 zhi4"],"word":"小人得志"},{"definition":["to have talent but no opportunity (idiom)\/to be an unrecognized talent"],"pinyin":["huai2 cai2 bu4 yu4"],"word":"怀才不遇"},{"definition":["bossy and domineering\/throwing one's weight about"],"pinyin":["fei1 yang2 ba2 hu4"],"word":"飞扬跋扈"},{"definition":["to have reached the highest official positions"],"pinyin":["wei4 ji2 ren2 chen2"],"word":"位极人臣"},{"definition":["to win power\/to get authority\/to become dominant"],"pinyin":["de2 shi4"],"word":"得势"},{"definition":["so pleased as to lose one's sense of measure\/beside oneself with joy"],"pinyin":["de2 yi4 wang4 xing2"],"word":"得意忘形"},{"definition":["lit. the divine steed Feihuang gallops (idiom)\/fig. to achieve meteoric success in one's career"],"pinyin":["Fei1 huang2 teng2 da2"],"word":"飞黄腾达"},{"definition":["to hold power"],"pinyin":["dang1 quan2"],"word":"当权"},{"definition":["official career (formal)"],"pinyin":["shi4 tu2"],"word":"仕途"},{"definition":["to curry favor (idiom); playing up to those in power\/social climbing"],"pinyin":["qu1 yan2 fu4 shi4"],"word":"趋炎附势"},{"definition":["proud\/arrogant"],"pinyin":["jiao1"],"word":"骄"},{"definition":["to think too much of oneself\/self-important\/arrogant"],"pinyin":["zi4 ming4 bu4 fan2"],"word":"自命不凡"}]}