{"definition":["to offend sb\/to make a faux pas\/a faux pas\/see also 得罪[de2 zui4]","to commit an offense\/to violate the law\/excuse me! (formal)\/see also 得罪[de2 zui5]"],"pinyin":["de2 zui5","de2 zui4"],"traditional":["得罪","得罪"],"rank":14118.0,"normalized_rank":0.1975291368768626,"fraction":0.000004587346924136219,"cumulative_fraction":0.9551844573344096,"word":"得罪","characters":[{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["variant of 罪[zui4], crime","guilt\/crime\/fault\/blame\/sin"],"pinyin":["zui4","zui4"],"word":"罪"}],"containing_words":[],"sentences":[{"english":"Some of the most popular expressions are those that are guaranteed not to offend anyone.","chinese":"一些最流行的表达是那些保证不会得罪任何人的表达。"},{"english":"Offending United States because of Irq is not in their national interests.","chinese":"为伊拉克而得罪美国，不符合他们的国家利益啊。"},{"english":"Chinese is not my mother tongue, so if I've written something wrong or offended someone, I wish all of you could excuse me.","chinese":"如果我有什么写错或者有得罪的地方，请诸位别见笑。"},{"english":"The superficial nobody dares to give misdemeanour to you and make in the behind floor Ban son of will be more.","chinese":"表面上没人敢得罪你，在背地里使绊子的会更多。"},{"english":"It appears you are the emotional one, but am I offended?","chinese":"你现在好像也很冲动，得罪朕了么？"},{"english":"In a fight to save in Bai Yang and lentils.","chinese":"在一次打架斗殴中杨林为了救白文得罪了沈庆和扁豆。"},{"english":"He got in Dutch with his boss and in a few months he was fired.","chinese":"他得罪了他的老板，于是几个月后他就被解雇了。"},{"english":"Your refusal to come might give offence.","chinese":"你如果拒绝来就会得罪人。"},{"english":"Jesus gave a stern warning about giving offense and causing others to lose their faith.","chinese":"得罪人和使人失去信心的情况被耶稣严厉地警告。"},{"english":"Wah dares to offend Our Majesty.","chinese":"华太师居然敢得罪我们皇爷。"},{"english":"He got across the boss, who made life very difficult for him.","chinese":"他得罪了上司，上司就给他小鞋穿。"},{"english":"But Huang Jiashan had offended the treacherous prime minister Yan Hao.","chinese":"黄嘉善却在京为官时，得罪了奸相严嵩。"},{"english":"The petty clerk was afraid of offending his boss.","chinese":"这个小职员不敢得罪他的老板。"},{"english":"What wrong did they do to the Catholic Church?","chinese":"他们哪里得罪了天主教堂？"},{"english":"I have not wronged you, but you are hunting me down to take my life.","chinese":"你虽然猎取我的命，我却没有得罪你。"},{"english":"May conduct a tour must say, but my mouth is very actually stupid, everywhere queers.","chinese":"可导游要会说，可我却嘴很笨，到处得罪人。"}],"related":[{"definition":["to offend sb\/to give offense\/to displease"],"pinyin":["kai1 zui4"],"word":"开罪"},{"definition":["to offend"],"pinyin":["re3 nao3"],"word":"惹恼"},{"definition":["to provoke\/to tease"],"pinyin":["zhao1 re3"],"word":"招惹"},{"definition":["to anger sb\/to enrage"],"pinyin":["chu4 nu4"],"word":"触怒"},{"definition":["to provoke anger"],"pinyin":["re3 nu4"],"word":"惹怒"},{"definition":["to start a feud\/to become enemies"],"pinyin":["jie2 chou2"],"word":"结仇"},{"definition":["to provoke\/to irritate\/to vex\/to stir up\/to anger\/to attract (troubles)\/to cause (problems)"],"pinyin":["re3"],"word":"惹"},{"definition":["to arouse dislike\/to incur hatred"],"pinyin":["jie2 yuan4"],"word":"结怨"},{"definition":["to involve\/to implicate sb\/to spread to others (harm, trouble, damage etc)"],"pinyin":["lian2 lei3"],"word":"连累"},{"definition":["to offend"],"pinyin":["mao4 fan4"],"word":"冒犯"},{"definition":["stir up the fire and you get burnt (idiom); to get one's fingers burnt\/fig. to suffer on account of one's own meddling"],"pinyin":["re3 huo3 shao1 shen1"],"word":"惹火烧身"},{"definition":["can't afford to offend\/dare not provoke\/difficult to deal with\/insufferable"],"pinyin":["re3 bu5 qi3"],"word":"惹不起"},{"definition":["to fall out with sb\/to become hostile"],"pinyin":["fan1 lian3"],"word":"翻脸"},{"definition":["see 撕破臉|撕破脸[si1 po4 lian3]"],"pinyin":["si1 po4 lian3 pi2"],"word":"撕破脸皮"},{"definition":["to take one's anger out on sb (who does not deserve it)"],"pinyin":["qian1 nu4"],"word":"迁怒"},{"definition":["to fawn on\/to curry favor with\/to make up to"],"pinyin":["ba1 jie5"],"word":"巴结"}]}