{"definition":["lit. catch fish then forget the trap (idiom, from Zhuangzi 莊子|庄子); fig. to take help for granted"],"pinyin":["de2 yu2 wang4 quan2"],"traditional":["得魚忘筌"],"rank":69064.0,"normalized_rank":0.9662949645320612,"fraction":4.671284059581829e-9,"cumulative_fraction":0.999992932347205,"word":"得鱼忘筌","characters":[{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["surname Yu","fish\/CL:條|条[tiao2],尾[wei3]"],"pinyin":["Yu2","yu2"],"word":"鱼"},{"definition":["to forget\/to overlook\/to neglect"],"pinyin":["wang4"],"word":"忘"},{"definition":["bamboo fish trap"],"pinyin":["quan2"],"word":"筌"}],"containing_words":[],"sentences":[],"related":[{"definition":["lit. a notch on the side of a boat to locate a sword dropped overboard (idiom); fig. an action made pointless by changed circumstances"],"pinyin":["ke4 zhou1 qiu2 jian4"],"word":"刻舟求剑"},{"definition":["lit. climb a tree to catch a fish (idiom); fig. to attempt the impossible"],"pinyin":["yuan2 mu4 qiu2 yu2"],"word":"缘木求鱼"},{"definition":["to see the ox already cut up into joints (idiom); extremely skilled\/able to see through the problem at one glance"],"pinyin":["mu4 wu2 quan2 niu2"],"word":"目无全牛"},{"definition":["happen unexpectedly\/turn out contrary to one's expectations"],"pinyin":["bu4 qi1 ran2 er2 ran2"],"word":"不期然而然"},{"definition":["to pluck a pearl from the black dragon (idiom, from Zhuangzi); fig. to pick out the salient points (from a tangled situation)\/to see through to the nub"],"pinyin":["tan4 li2 de2 zhu1"],"word":"探骊得珠"},{"definition":["to buy a wooden box and return the pearls inside\/to show poor judgment (idiom)"],"pinyin":["mai3 du2 huan2 zhu1"],"word":"买椟还珠"},{"definition":["lit. Ying writes a letter and Yan reads it\/fig. to misinterpret the original meaning\/to pile up errors\/refers to the letter from capital 郢[Ying3] of 楚[Chu3] in which the inadvertent words \"hold up the candle\" are mistaken by the minister of 燕[Yan1] as \"promote the wise\""],"pinyin":["Ying3 shu1 Yan1 shuo1"],"word":"郢书燕说"},{"definition":["(literary) how is one to know?"],"pinyin":["yan1 zhi1"],"word":"焉知"},{"definition":["to neglect the root and pursue the tip (idiom)\/to neglect fundamentals and concentrate on details"],"pinyin":["she3 ben3 zhu2 mo4"],"word":"舍本逐末"},{"definition":["not to be taken as an example\/not an example to be followed\/not to be taken as authoritative"],"pinyin":["bu4 zu2 wei2 xun4"],"word":"不足为训"},{"definition":["Jiang Ziya is fishing, if you want take the hook (idiom, refers to early sage 姜子牙 fishing with no bait and the hook above the water); to put one's head in the noose"],"pinyin":["tai4 gong1 diao4 yu2 , yuan4 zhe3 shang4 gou1"],"word":"太公钓鱼，愿者上钩"},{"definition":["to aim to carve a swan and get a semblance of a duck (idiom)\/to fail utterly in trying to copy something\/to get a reasonably good, if not perfect, result"],"pinyin":["ke4 hu2 lei4 wu4"],"word":"刻鹄类鹜"},{"definition":["so dedicated as to forget one's meals (idiom)"],"pinyin":["fa1 fen4 wang4 shi2"],"word":"发愤忘食"},{"definition":["whatever you like\/to do as one pleases"],"pinyin":["cong2 xin1 suo3 yu4"],"word":"从心所欲"},{"definition":["one's words reflect one's thinking (idiom)"],"pinyin":["yan2 wei2 xin1 sheng1"],"word":"言为心声"},{"definition":["to understand\/to comprehend the ultimate essence of things (Buddhism)"],"pinyin":["wu4 ru4"],"word":"悟入"}]}