{"definition":["otaku, a Japanese term for people with obsessive interests such as anime, manga, and video games\/see also 宅男[zhai2 nan2]\/see also 宅女[zhai2 nu:3]"],"pinyin":["yu4 zhai2 zu2"],"traditional":["御宅族"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"御宅族","characters":[{"definition":["to defend\/to resist","to resist\/imperial\/(classical) to drive (a chariot)\/to manage\/to govern"],"pinyin":["yu4","yu4"],"word":"御"},{"definition":["residence\/(coll.) to stay in at home\/to hang around at home"],"pinyin":["zhai2"],"word":"宅"},{"definition":["race\/nationality\/ethnicity\/clan\/by extension, social group (e.g. office workers 上班族)"],"pinyin":["zu2"],"word":"族"}],"containing_words":[],"sentences":[{"english":"The area where otaku have the most influence in manga tends to be with dojinshi.","chinese":"御宅族在漫画领域最有影响的是同人志。"},{"english":"These shops attract many otaku, and forms unique culture of Akihabara.","chinese":"吸引了大量的御宅族，形成了独特的秋叶原文化。"},{"english":"Because of this the otaku subculture has much influence over the mainstream anime industry in Japan.","chinese":"因此御宅族亚文化对日本主流动画产业有巨大影响。"},{"english":"There are also many femal otaku in the society nowadays.","chinese":"当今社会也有许多女御宅族。"},{"english":"This is where you'll find the otaku, Japanese uber-nerds whose lives revolve around comic books and computers.","chinese":"在这里你会见识到日本痴迷于漫画和电脑的御宅族。"}],"related":[{"definition":["two-dimensional\/the fictional worlds of anime, comics and games"],"pinyin":["er4 ci4 yuan2"],"word":"二次元"},{"definition":["single girl who is not interested in relationships, living a lackadaisical life (loanword from Japanese \"himono onna\")"],"pinyin":["gan1 wu4 nu:3"],"word":"干物女"},{"definition":["a guy who stays at home all the time, typically spending a lot of time playing online games (derived from Japanese \"otaku\")"],"pinyin":["zhai2 nan2"],"word":"宅男"},{"definition":["die-hard otaku (sb who hardly ever emerges from their home, where they play games, watch movies etc)"],"pinyin":["si3 zhai2"],"word":"死宅"},{"definition":["Japanophile (refers to teenage craze for everything Japanese, originally mainly in Taiwan)"],"pinyin":["ha1 Ri4 zu2"],"word":"哈日族"},{"definition":["three-dimensional\/the real world (cf. 二次元[er4 ci4 yuan2])"],"pinyin":["san1 ci4 yuan2"],"word":"三次元"},{"definition":["lolicon or rorikon (Japanese loanword)\/manga or anime genre depicting young girls in an erotic manner"],"pinyin":["luo2 li4 kong4"],"word":"萝莉控"},{"definition":["female geek\/female nerd\/otaku girl"],"pinyin":["zhai2 nu:3"],"word":"宅女"},{"definition":["(Tw) (neologism c. 2007) young person who is not studying, working or being trained for work (loanword from NEET: not in education, employment or training)"],"pinyin":["ni2 te4 zu2"],"word":"尼特族"},{"definition":["cartoons and comics\/animes and mangas\/cartoon (animated movie)\/anime"],"pinyin":["dong4 man4"],"word":"动漫"},{"definition":["subculture"],"pinyin":["ci4 wen2 hua4"],"word":"次文化"},{"definition":["erotic (loanword mimicking the shape of Japanese katakana エロ, pronounced \"ero\")"],"pinyin":["ei1 luo2"],"word":"工口"},{"definition":["Enjo-kōsai or \"compensated dating\", a practice which originated in Japan where older men give money or luxury gifts to women for their companionship and sexual favors"],"pinyin":["yuan2 zhu4 jiao1 ji4"],"word":"援助交际"},{"definition":["subculture"],"pinyin":["ya4 wen2 hua4"],"word":"亚文化"},{"definition":["voice actor (loanword from Japanese 声優 seiyū)"],"pinyin":["sheng1 you1"],"word":"声优"},{"definition":["fujoshi (woman who likes mangas about male homosexual love)"],"pinyin":["fu3 nu:3"],"word":"腐女"}]}