{"definition":["hearts linked as one, just as the proverbial rhinoceros communicates emotion telepathically through his single horn (idiom); fig. two hearts beat as one"],"pinyin":["xin1 you3 ling2 xi1 yi1 dian3 tong1"],"traditional":["心有靈犀一點通"],"rank":53775.0,"normalized_rank":0.7523820183845648,"fraction":9.459350220653203e-8,"cumulative_fraction":0.9994056363266453,"word":"心有灵犀一点通","characters":[{"definition":["heart\/mind\/intention\/center\/core\/CL:顆|颗[ke1],個|个[ge4]"],"pinyin":["xin1"],"word":"心"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["quick\/alert\/efficacious\/effective\/to come true\/spirit\/departed soul\/coffin"],"pinyin":["ling2"],"word":"灵"},{"definition":["rhinoceros\/sharp"],"pinyin":["xi1"],"word":"犀"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"点"},{"definition":["to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc","classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)"],"pinyin":["tong1","tong4"],"word":"通"}],"containing_words":[],"sentences":[{"english":"This time the husband and the wife finally reached a perfect mutual understanding.","chinese":"这次，夫妻俩终于心有灵犀一点通。"}],"related":[{"definition":["two hearts beat as one (idiom); a kindred spirit"],"pinyin":["xin1 xin1 xiang1 yin4"],"word":"心心相印"},{"definition":["kindred spirits"],"pinyin":["ling2 xi1 xiang1 tong1"],"word":"灵犀相通"},{"definition":["one day apart seems like three years (idiom)"],"pinyin":["yi1 ri4 bu4 jian4 , ru2 ge2 san1 qiu1"],"word":"一日不见，如隔三秋"},{"definition":["close friend in a distant land, far-flung realms as next door\/close in spirit although far away"],"pinyin":["hai3 nei4 cun2 zhi1 ji3 , tian1 ya2 ruo4 bi3 lin2"],"word":"海内存知己，天涯若比邻"},{"definition":["telepathy"],"pinyin":["xin1 dian4 gan3 ying4"],"word":"心电感应"},{"definition":["to make sheep eyes at\/to cast amorous glances at"],"pinyin":["mei2 mu4 chuan2 qing2"],"word":"眉目传情"},{"definition":["a thousand cups of wine is not too much when best friends meet (idiom)\/when you're with close friends, you can let your hair down"],"pinyin":["jiu3 feng2 zhi1 ji3 qian1 bei1 shao3"],"word":"酒逢知己千杯少"},{"definition":["so close, yet worlds apart (idiom)"],"pinyin":["zhi3 chi3 tian1 ya2"],"word":"咫尺天涯"},{"definition":["to have an affinity with each other (idiom)\/to find each other congenial"],"pinyin":["qing2 tou2 yi4 he2"],"word":"情投意合"},{"definition":["lit. a pair of birds flying close together (idiom)\/fig. two hearts beating as one\/name of a sweet and sour chicken wing dish"],"pinyin":["bi3 yi4 shuang1 fei1"],"word":"比翼双飞"},{"definition":["familiarity at first sight"],"pinyin":["yi1 jian4 ru2 gu4"],"word":"一见如故"},{"definition":["soul brothers\/friends in spirit who have never met\/to commune with"],"pinyin":["shen2 jiao1"],"word":"神交"},{"definition":["(of a couple) to be harmonious\/to be each other's sunshine"],"pinyin":["liang3 qing2 xiang1 yue4"],"word":"两情相悦"},{"definition":["there are no rivers to one who has crossed the ocean, and no clouds to one who has passed Mount Wu (idiom)\/one who has seen the world doesn't stop at small things"],"pinyin":["ceng2 jing1 cang1 hai3 nan2 wei2 shui3 , chu2 que4 Wu1 Shan1 bu4 shi4 yun2"],"word":"曾经沧海难为水，除却巫山不是云"},{"definition":["in perfect harmony\/in sync\/lit. qin and se sing in harmony"],"pinyin":["qin2 se4 he2 ming2"],"word":"琴瑟和鸣"},{"definition":["lit. to lift the tray to eyebrow level (idiom); mutual respect in a marriage"],"pinyin":["ju3 an4 qi2 mei2"],"word":"举案齐眉"}]}