{"definition":["anxiety\/sore point\/secret worry\/mental disorder\/heart disease (medicine)"],"pinyin":["xin1 bing4"],"traditional":["心病"],"rank":25493.0,"normalized_rank":0.3566801449498412,"fraction":0.0000014156910253070181,"cumulative_fraction":0.985004409012626,"word":"心病","characters":[{"definition":["heart\/mind\/intention\/center\/core\/CL:顆|颗[ke1],個|个[ge4]"],"pinyin":["xin1"],"word":"心"},{"definition":["illness\/CL:場|场[chang2]\/disease\/to fall ill\/defect"],"pinyin":["bing4"],"word":"病"}],"containing_words":[{"definition":["coronary heart disease"],"pinyin":["guan1 xin1 bing4"],"word":"冠心病"},{"definition":["deranged\/demented\/berserk (idiom)"],"pinyin":["sang4 xin1 bing4 kuang2"],"word":"丧心病狂"},{"definition":["pulmonary heart disease (medicine)"],"pinyin":["fei4 xin1 bing4"],"word":"肺心病"}],"sentences":[{"english":"Objective To explore the diagnosis and treatment features of pulmonary heart disease caused by tuberculosis.","chinese":"目的探讨肺结核所致肺心病的诊断和治疗特点。"},{"english":"I was relieved from anxiety.","chinese":"我的心病消除了。"},{"english":"Along with being a risk factor for coronary artery disease, obesity may increase your risk of developing an arrhythmia.","chinese":"肥胖会增加患有冠心病的危险，由此导致心律失常。"},{"english":"Cardiac catheterization with angiography is the reference standard for diagnosing CAD.","chinese":"心血管导管造影是诊断冠心病的金标准。"},{"english":"Coronary disease is the coronal atherosclerosis heart disease's abbreviation.","chinese":"冠心病是冠状动脉粥样硬化性心脏病的简称。"},{"english":"Objective To investigate the possible association of apolipoprotein M gene polymorphism with coronary artery disease.","chinese":"目的探讨载脂蛋白M的基因多态性与冠心病的相关性。"},{"english":"Objective To discuss the role of plasmatic fibrinogen in the pathogenesis of coronary heart disease (CHD).","chinese":"目的探讨血浆纤维蛋白原在冠心病发病中的作用。"},{"english":"The utility model relates to a first-aid treating device for coronary heart disease.","chinese":"本实用新型是一种冠心病急救治疗器。"},{"english":"Gradient gel electrophoresis determine small, dense low-density lipoprotein in plasma of patients with coronary heart disease.","chinese":"梯度胶电泳法测定冠心病患者血浆小密低密度脂蛋白。"},{"english":"Chief Physician Wang Zhiqiang's experience in treating senile coronary heart disease is described in this paper.","chinese":"介绍王治强主任中医师治疗老年性冠心病的经验。"},{"english":"To observe the clinical effect of Nuodikang capsule(NDKC) in treating angina of CHD.","chinese":"目的观察诺迪康胶囊治疗冠心病心绞痛的临床疗效。"},{"english":"Heart myositis and lobar anxiety patient are sensitive to strong heart glucoside, should notice dosage.","chinese":"心肌炎及肺心病患者对强心甙敏感，应注意用量。"},{"english":"Thus, PDE technique is useful for early diagnosis of Cot Pulmonale.","chinese":"因此，PDE技术对于肺心病的早期诊断是有价值的。"},{"english":"Metal statuses adjusted to well is key for rehabilitation of coronary artery disease.","chinese":"调整好心理状态是冠心病康复的关键。"},{"english":"Context The coronary artery calcium score (CACS) has been shown to predict future coronary heart disease (CHD) events.","chinese":"冠状动脉钙评分已经被用来预测未来冠心病事件。"},{"english":"Objective:To explore relationship between the sphygmograms of the radial arteries and coronary heart disease(CHD).","chinese":"目的，为了探讨寸口脉脉象图和冠心病的关系。"}],"related":[{"definition":["ineradicable disease\/fig. deep-seated problem\/perennial problem"],"pinyin":["wan2 ji2"],"word":"顽疾"},{"definition":["a matter that gnaws at one's mind\/preoccupation\/sore point\/rancor"],"pinyin":["xin1 jie2"],"word":"心结"},{"definition":["illness\/CL:場|场[chang2]\/disease\/to fall ill\/defect"],"pinyin":["bing4"],"word":"病"},{"definition":["rib cartilage\/(fig.) weak spot\/soft underbelly"],"pinyin":["ruan3 lei4"],"word":"软肋"},{"definition":["an incompletely cured illness\/an old complaint\/the root cause of trouble"],"pinyin":["bing4 gen1"],"word":"病根"},{"definition":["incurable disease"],"pinyin":["bu4 zhi4 zhi1 zheng4"],"word":"不治之症"},{"definition":["an unmentionable illness (e.g. venereal disease)"],"pinyin":["yin3 ji2"],"word":"隐疾"},{"definition":["root of the trouble\/cause of the ruin"],"pinyin":["huo4 gen1"],"word":"祸根"},{"definition":["to bring under permanent control\/to effect a radical cure"],"pinyin":["gen1 zhi4"],"word":"根治"},{"definition":["hard lump in the abdomen (in Chinese medicine)\/crux of an issue\/main point in an argument\/sticking point\/deadlock in negotiations"],"pinyin":["zheng1 jie2"],"word":"症结"},{"definition":["to suffer from pent-up frustrations\/mental knot\/emotional issue"],"pinyin":["yu4 jie2"],"word":"郁结"},{"definition":["stumbling block\/obstacle\/someone who gets in your way"],"pinyin":["ban4 jiao3 shi2"],"word":"绊脚石"},{"definition":["to take troubles to heart (idiom); brooding"],"pinyin":["geng3 geng3 yu2 huai2"],"word":"耿耿于怀"},{"definition":["lit. whoever hung the bell on the tiger's neck must untie it (idiom)\/fig. whoever started the trouble should end it"],"pinyin":["jie3 ling2 hai2 xu1 xi4 ling2 ren2"],"word":"解铃还须系铃人"},{"definition":["incurable disease\/terminal illness"],"pinyin":["jue2 zheng4"],"word":"绝症"},{"definition":["secret concern\/private worry"],"pinyin":["yin3 you1"],"word":"隐忧"}]}