{"definition":["to be certain of victory\/to be bound to prevail"],"pinyin":["bi4 sheng4"],"traditional":["必勝"],"rank":17284.0,"normalized_rank":0.24182558448644945,"fraction":0.0000031845019299930507,"cumulative_fraction":0.9673360126385152,"word":"必胜","characters":[{"definition":["certainly\/must\/will\/necessarily"],"pinyin":["bi4"],"word":"必"},{"definition":["victory\/success\/to beat\/to defeat\/to surpass\/victorious\/superior to\/to get the better of\/better than\/surpassing\/superb (of vista)\/beautiful (scenery)\/wonderful (view)\/(Taiwan pr. [sheng1]) able to bear\/equal to (a task)"],"pinyin":["sheng4"],"word":"胜"}],"containing_words":[{"definition":["Pizza Hut"],"pinyin":["Bi4 sheng4 Ke4"],"word":"必胜客"},{"definition":["an army burning with righteous indignation is bound to win (idiom)"],"pinyin":["ai1 bing1 bi4 sheng4"],"word":"哀兵必胜"}],"sentences":[{"english":"We have a character of fortitude, a spirit of never being defeated, and a confidence of certain triumph.","chinese":"我们有着坚毅的性格，永不言败的精神和必胜的信心。"},{"english":"It’s easy to see an echo of that in blogosphere triumphalism.","chinese":"从博客世界中可以很容易看出对这一必胜信念的回应。"},{"english":"We can improve but we have the spirit to win.","chinese":"我们可以更好些，但我们有必胜的信念。"},{"english":"Gradually, I had to win the confidence of the people, want to repay the teacher of this pay.","chinese":"渐渐的，我有了必胜的信心，想回报老师的这份付出。"},{"english":"Simon: If it were up to me, I’d prefer to go to Pizza Hut.","chinese":"要是我说呀，我更愿意去必胜客餐厅。"},{"english":"The people will stop your profiteering schemes, and the people will win .","chinese":"人民将阻止你们牟取暴利的诡计，人民必胜。"},{"english":"Finally, believing that the nation was sure to win, the poet set up the flag of belief reconstruction.","chinese":"诗人最终以民族必胜的信心扬起了信仰重构之旗。"},{"english":"If it were up to me, the toppings are much tastier at Pizza Hut.","chinese":"要是我说呀，必胜客的比萨浇头味道更好。"},{"english":"Lian: Ok, shall we go to Pizza Hut or Pizza Italia?","chinese":"那我们是去必胜客餐厅还是去比萨意大利餐厅？"},{"english":"The Chinese government has traditionally viewed Chinese IP theft as a win-win.","chinese":"所以通常中国政府会认定盗版商是必胜的。"},{"english":"Northwest corner of Huixin Dongqiao, Chaoyang, next to Pizza Hut.","chinese":"慧新东桥西北角，朝阳区，必胜客旁。"},{"english":"Our football team wins every time.","chinese":"我们的足球队每战必胜。"},{"english":"Laurie had great skill, dazzling grace, and a winning smile.","chinese":"劳利技巧娴熟，优雅无比，面带必胜的喜悦。"},{"english":"Sucess is the conviction to succeed at all costs!","chinese":"成功是一个必胜的决心和信念。"},{"english":"In the team can prevent the heaven, win.","chinese":"摩里支天能防官非，必胜法。"},{"english":"Daring to fight and win, scaled new heights of the vigorous spirit of fighting.","chinese":"敢打必胜，勇攀高峰的旺盛斗志。"}],"related":[{"definition":["odds of success\/stratagem that ensures success\/to be sure of success"],"pinyin":["sheng4 suan4"],"word":"胜算"},{"definition":["fight to the death\/desperate struggle"],"pinyin":["si3 zhan4"],"word":"死战"},{"definition":["to triumph in every battle (idiom); invincible\/to succeed in every undertaking"],"pinyin":["zhan4 wu2 bu4 sheng4"],"word":"战无不胜"},{"definition":["to beat comfortably\/to win easily\/abbr. for 穩操勝券|稳操胜券, to have victory within one's grasp"],"pinyin":["wen3 sheng4"],"word":"稳胜"},{"definition":["grasp it and victory is assured\/to have success within one's grasp (idiom)"],"pinyin":["wen3 cao1 sheng4 quan4"],"word":"稳操胜券"},{"definition":["lit. fight with one's back to the river (idiom); fig. to fight to win or die"],"pinyin":["bei4 shui3 yi1 zhan4"],"word":"背水一战"},{"definition":["lit. to break the cauldrons and sink the boats (idiom); fig. to cut off one's means of retreat\/to burn one's boats"],"pinyin":["po4 fu3 chen2 zhou1"],"word":"破釜沉舟"},{"definition":["using the weak to defeat the strong (idiom); to win from a position of weakness"],"pinyin":["yi3 ruo4 sheng4 qiang2"],"word":"以弱胜强"},{"definition":["to turn defeat into victory (idiom); to turn the tide"],"pinyin":["fan3 bai4 wei2 sheng4"],"word":"反败为胜"},{"definition":["to put one's all into the fight"],"pinyin":["fang4 shou3 yi1 bo2"],"word":"放手一搏"},{"definition":["honorable even in defeat (idiom)"],"pinyin":["sui1 bai4 you2 rong2"],"word":"虽败犹荣"},{"definition":["decisive battle\/to fight a decisive battle\/to fight for supremacy in ..."],"pinyin":["jue2 zhan4"],"word":"决战"},{"definition":["powerful enemy"],"pinyin":["qiang2 di2"],"word":"强敌"},{"definition":["morale"],"pinyin":["shi4 qi4"],"word":"士气"},{"definition":["to brave it out\/to the bitter end"],"pinyin":["pin1 dao4 di3"],"word":"拼到底"},{"definition":["to underestimate the enemy"],"pinyin":["qing1 di2"],"word":"轻敌"}]}