{"definition":["lit. quick sword cuts through tangled hemp (idiom); decisive action in a complex situation\/cutting the Gordian knot"],"pinyin":["kuai4 dao1 zhan3 luan4 ma2"],"traditional":["快刀斬亂麻"],"rank":41122.0,"normalized_rank":0.5753501322177605,"fraction":3.4479915464788377e-7,"cumulative_fraction":0.9968977224499608,"word":"快刀斩乱麻","characters":[{"definition":["rapid\/quick\/speed\/rate\/soon\/almost\/to make haste\/clever\/sharp (of knives or wits)\/forthright\/plainspoken\/gratified\/pleased\/pleasant"],"pinyin":["kuai4"],"word":"快"},{"definition":["knife\/blade\/single-edged sword\/cutlass\/CL:把[ba3]\/(slang) dollar (loanword)\/classifier for sets of one hundred sheets (of paper)\/classifier for knife cuts or stabs","surname Dao"],"pinyin":["dao1","Dao1"],"word":"刀"},{"definition":["to behead (as form of capital punishment)\/to chop"],"pinyin":["zhan3"],"word":"斩"},{"definition":["in confusion or disorder\/in a confused state of mind\/disorder\/upheaval\/riot\/illicit sexual relations\/to throw into disorder\/to mix up\/indiscriminate\/random\/arbitrary"],"pinyin":["luan4"],"word":"乱"},{"definition":["variant of 麻[ma2]\/hemp","generic name for hemp, flax etc\/hemp or flax fiber for textile materials\/sesame\/CL:縷|缕[lu:3]\/(of materials) rough or coarse\/pocked\/pitted\/to have pins and needles or tingling\/to feel numb","surname Ma"],"pinyin":["ma2","ma2","Ma2"],"word":"麻"}],"containing_words":[],"sentences":[{"english":"He never procrastinates , but always takes resolute measures to solve a complicated problem in an instant.","chinese":"他干什么事总是快刀斩乱麻，从不拖泥带水。"},{"english":"Often say \"cut the Gordian knot\" and the knife can continue, but more threads.","chinese":"常说“快刀斩乱麻”，可这一刀下去，头绪却更多了。"},{"english":"He could cut through disputes with the sharp knife of authority.","chinese":"他可以运用他的权威象快刀斩乱麻样地解决纠纷。"}],"related":[{"definition":["to make a decision when it's time to decide"],"pinyin":["dang1 duan4 ze2 duan4"],"word":"当断则断"},{"definition":["better to just get the pain over with, rather than prolong the agony"],"pinyin":["chang2 tong4 bu4 ru2 duan3 tong4"],"word":"长痛不如短痛"},{"definition":["a blitzkrieg strategy (idiom)\/to resolve sth in the shortest time possible\/to get sth done quickly"],"pinyin":["su4 zhan4 su4 jue2"],"word":"速战速决"},{"definition":["strike first and gain the upper hand (idiom, martial arts term); Making the first move is an advantage."],"pinyin":["xian1 xia4 shou3 wei2 qiang2"],"word":"先下手为强"},{"definition":["to bring to a conclusion\/to settle (a dispute)\/to do away with (oneself)\/to break off (a relationship)\/resolution (of a problem)"],"pinyin":["liao3 duan4"],"word":"了断"},{"definition":["lit. wading in mud and water\/a slovenly job\/sloppy"],"pinyin":["tuo1 ni2 dai4 shui3"],"word":"拖泥带水"},{"definition":["lit. two segments with a single cut (idiom)\/fig. to make a clean break (idiom)"],"pinyin":["yi1 dao1 liang3 duan4"],"word":"一刀两断"},{"definition":["to illuminate\/to open up (a topic)"],"pinyin":["tiao3 ming2"],"word":"挑明"},{"definition":["(of marriage or business partners) to break up (idiom)\/to separate"],"pinyin":["yi1 pai1 liang3 san4"],"word":"一拍两散"},{"definition":["to get away from\/to withdraw\/to free oneself"],"pinyin":["chou1 shen1"],"word":"抽身"},{"definition":["indecisive\/irresolute"],"pinyin":["you1 rou2 gua3 duan4"],"word":"优柔寡断"},{"definition":["to cut weeds and eliminate the roots (idiom); to destroy root and branch\/to eliminate completely"],"pinyin":["zhan3 cao3 chu2 gen1"],"word":"斩草除根"},{"definition":["to lay one's cards on the table"],"pinyin":["tan1 pai2"],"word":"摊牌"},{"definition":["to part without hard feelings (idiom)\/to cut the knot as smoothly as you tied it"],"pinyin":["hao3 ju4 hao3 san4"],"word":"好聚好散"},{"definition":["lit. lotus roots may break, but the fiber remains joined (idiom); lovers part, but still long for one another"],"pinyin":["ou3 duan4 si1 lian2"],"word":"藕断丝连"},{"definition":["it will cause no end of trouble (idiom)"],"pinyin":["hou4 huan4 wu2 qiong2"],"word":"后患无穷"}]}