{"definition":["to hug\/to cherish\/within the bosom (of the family)\/to embrace (also fig. an ideal, aspiration etc)"],"pinyin":["huai2 bao4"],"traditional":["懷抱"],"rank":11311.0,"normalized_rank":0.158255565038546,"fraction":0.000006746064070170471,"cumulative_fraction":0.9394948472512892,"word":"怀抱","characters":[{"definition":["bosom\/heart\/mind\/to think of\/to harbor in one's mind\/to conceive (a child)","surname Huai"],"pinyin":["huai2","Huai2"],"word":"怀"},{"definition":["to hold\/to carry (in one's arms)\/to hug\/to embrace\/to surround\/to cherish"],"pinyin":["bao4"],"word":"抱"}],"containing_words":[],"sentences":[{"english":"Just like that, I could feel her in my arms.","chinese":"就像字面意思那样，我能够感觉到她在我的怀抱中。"},{"english":"The manufacturers in Mainland China are eager to adopt the products of Media Tek and MStar Semiconductor.","chinese":"而中国厂家则迫不及待地投入联发科和晨星的怀抱。"},{"english":"When I saw the blue, I can not wait into the embrace of the sea.","chinese":"当看到那片蔚蓝色时，我迫不及待地投入到它的怀抱。"},{"english":"The South Korean puppet regime must return my daughter to her mother's arms right away.","chinese":"韩国傀儡政权必须马上送还我的女儿到母亲的怀抱。"},{"english":"I must go down to the seas again, to the vagrant Gypsy life.","chinese":"我必须重回大海的怀抱，回到浪迹天涯的无拘生活。"},{"english":"And an autumn reflection , will deliver me to your arms.","chinese":"而一副秋日的倒影，将把我领入你的怀抱。"},{"english":"Then she gave a deep sight and snuggled into my arms.","chinese":"接着她深深叹口气，紧紧的偎依在我的怀抱里。"},{"english":"Little girl, you go on dancing in your new friend's arms.","chinese":"小姑娘，你在新友的怀抱里继续跳舞。"},{"english":"An enormous iceberg nestles into an ice shelf in Antarctica.","chinese":"一座巨大的冰山依偎在南极冰架的怀抱。"},{"english":"Two completely different fleets are making their way towards the Southern Ocean.","chinese":"两支怀抱著完全不同使命的舰队正朝著南冰洋前进。"},{"english":"John's wife left him for another man.","chinese":"约翰的妻子舍他而去，投入另一个男子的怀抱。"},{"english":"Blue and white porcelain is broken, five field of the earth return to embrace.","chinese":"青花瓷碎，五方土重归中华大地怀抱。"},{"english":"She threw herself into his outflung arms.","chinese":"她投入他那双臂张开的怀抱。"},{"english":"Then with a heart of gratefulness, everything turns out to be gorgeous.","chinese":"然后，怀抱感恩的心去生活，一切都将会变得美好。"},{"english":"Children were rent from their mothers'arms by the brutal soldiers.","chinese":"凶暴的士兵强使孩子离开母亲的怀抱。"},{"english":"Children were rent from their mothers' arms by the brutal soldiers.","chinese":"凶暴的士兵强使孩子们离开他们母亲的怀抱。"}],"related":[{"definition":["embrace\/bosom"],"pinyin":["huai2 li3"],"word":"怀里"},{"definition":["to nestle against\/to snuggle up to"],"pinyin":["yi1 wei1"],"word":"依偎"},{"definition":["to embrace\/to hug"],"pinyin":["yong1 bao4"],"word":"拥抱"},{"definition":["to call out (a name etc)\/to shout"],"pinyin":["hu1 huan4"],"word":"呼唤"},{"definition":["to miss\/to long for\/to remember with longing\/yearning"],"pinyin":["juan4 lian4"],"word":"眷恋"},{"definition":["to aspire"],"pinyin":["re4 wang4"],"word":"热望"},{"definition":["to have one's heart filled with\/(to collide) full on\/(of farm animals) heavy with young"],"pinyin":["man3 huai2"],"word":"满怀"},{"definition":["to be fondly attached to\/to not wish to part with\/to cling to"],"pinyin":["yi1 lian4"],"word":"依恋"},{"definition":["to become intoxicated"],"pinyin":["chen2 zui4"],"word":"沉醉"},{"definition":["wholeheartedly\/(to devote oneself) heart and soul"],"pinyin":["quan2 shen1 xin1"],"word":"全身心"},{"definition":["tender\/affectionate\/tenderness"],"pinyin":["wen1 cun2"],"word":"温存"},{"definition":["to hold in one's arms\/to embrace"],"pinyin":["lou3 zhu4"],"word":"搂住"},{"definition":["true love"],"pinyin":["zhi4 ai4"],"word":"挚爱"},{"definition":["swaddling clothes\/fig. early stage of development\/infancy"],"pinyin":["qiang3 bao3"],"word":"襁褓"},{"definition":["to be fast asleep\/(fig.) to lie dormant\/to lie undiscovered"],"pinyin":["chen2 shui4"],"word":"沉睡"},{"definition":["earth\/mother earth"],"pinyin":["da4 di4"],"word":"大地"}]}