{"definition":["to restore sth to its original state"],"pinyin":["hui1 fu4 yuan2 zhuang4"],"traditional":["恢復原狀"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"恢复原状","characters":[{"definition":["to restore\/to recover\/great"],"pinyin":["hui1"],"word":"恢"},{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out","to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4","fu4","fu4"],"word":"复"},{"definition":["Hara (Japanese surname)","former\/original\/primary\/raw\/level\/cause\/source"],"pinyin":["Yuan2","yuan2"],"word":"原"},{"definition":["accusation\/suit\/state\/condition\/strong\/great\/-shaped"],"pinyin":["zhuang4"],"word":"状"}],"containing_words":[],"sentences":[{"english":"When pressure is lost, the air pressure inside the cell meeting general cell is restorable .","chinese":"当压力失去时，细胞内的空气压力会将细胞恢复原状。"},{"english":"To handle an invalid contract must abide by the principle of restitution .","chinese":"处理无效合同应当遵循恢复原状的原则。"},{"english":"After a given length of time the buoy sinks itself and is not recovered.","chinese":"浮标自身下沉，并且不再恢复原状。"},{"english":"Hand clenched face loosen, crease is not obvious, and can be quickly restored.","chinese":"用手捏紧呢面松开，折痕不明显，且能迅速恢复原状。"},{"english":"As the world economy stabilizes, the older relationships should largely return.","chinese":"随着世界经济趋稳，传统的关系将基本恢复原状。"},{"english":"I worked hard to restore the wall and the floor to its former condition.","chinese":"又费了很大的力把墙壁及地板恢复原状。"},{"english":"Need to be returned to Yang state, the whole natures will resume elemental shape.","chinese":"待回了扬州，一切自然会恢复原状的。"},{"english":"Comb clear and coherent, natural air, after air can restorable .","chinese":"梳理通顺，自然晾干，晾干后即可恢复原状。"},{"english":"When I think about the bamboo tree's ability to bounce back or return to its original position.","chinese":"每当我想到竹子这种弹回去或者说恢复原状的本领时。"},{"english":"After pressing can very fast restorable, general quality is better.","chinese":"压后能够很快恢复原状的，一般质量较好。"},{"english":"From such a position, \"you just can't recover.","chinese":"在这样的姿态下，“你根本无法恢复原状。"},{"english":"Stop using the tiny keyboard on your PDA and see if they grow back to normal.","chinese":"停止使用你的掌上电脑，看看它们能不能恢复原状。"}],"related":[{"definition":["previous condition\/original state"],"pinyin":["yuan2 zhuang4"],"word":"原状"},{"definition":["original shape\/the same as before"],"pinyin":["yuan2 yang4"],"word":"原样"},{"definition":["to restore (sth) to (its) former condition\/to recover from illness\/recovery"],"pinyin":["fu4 yuan2"],"word":"复原"},{"definition":["to reinstate\/to resume\/to restore\/to recover\/to regain\/to rehabilitate"],"pinyin":["hui1 fu4"],"word":"恢复"},{"definition":["impair, damage"],"pinyin":["hui3 sun3"],"word":"毁损"},{"definition":["to damage\/to injure"],"pinyin":["sun3 huai4"],"word":"损坏"},{"definition":["deformation\/to become deformed\/to change shape\/to morph"],"pinyin":["bian4 xing2"],"word":"变形"},{"definition":["to damage\/to devastate\/to vandalize\/damage\/destruction"],"pinyin":["hui3 huai4"],"word":"毁坏"},{"definition":["to regain\/to retake\/to take back\/to withdraw\/to revoke"],"pinyin":["shou1 hui2"],"word":"收回"},{"definition":["to cause damage to\/to ruin\/to destroy"],"pinyin":["sun3 hui3"],"word":"损毁"},{"definition":["to mend"],"pinyin":["xiu1 bu3"],"word":"修补"},{"definition":["to become damaged"],"pinyin":["po4 sun3"],"word":"破损"},{"definition":["to subside\/to sink\/to cave in"],"pinyin":["ta1 xian4"],"word":"塌陷"},{"definition":["to remove\/to sack\/to get rid of\/to relieve (sb of their duties)\/to free\/to lift (an embargo)\/to rescind (an agreement)"],"pinyin":["jie3 chu2"],"word":"解除"},{"definition":["to subside\/subsidence"],"pinyin":["xia4 xian4"],"word":"下陷"},{"definition":["to split open\/to dehisce (of fruit or cotton bolls, to split open)"],"pinyin":["kai1 lie4"],"word":"开裂"}]}