{"definition":["it's just perfect\/it's just right"],"pinyin":["qia4 dao4 hao3 chu4"],"traditional":["恰到好處"],"rank":14542.0,"normalized_rank":0.20346144697997845,"fraction":0.000004375825342813279,"cumulative_fraction":0.9570824743504296,"word":"恰到好处","characters":[{"definition":["exactly\/just"],"pinyin":["qia4"],"word":"恰"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["to be fond of\/to have a tendency to\/to be prone to","good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello"],"pinyin":["hao4","hao3"],"word":"好"},{"definition":["to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish","place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point"],"pinyin":["chu3","chu4"],"word":"处"}],"containing_words":[],"sentences":[{"english":"His speech struck a perfect balance between humor and seriousness.","chinese":"他的演说把幽默性和严肃性的方寸掌握得恰到好处。"},{"english":"A basin of charcoal fire of proper heat will be the key to Yao's work in the afternoon.","chinese":"一盆烧得恰到好处的炭火，是姚贵文下午工作的关键。"},{"english":"The first taste is almost sweet, a rush of fruit giving way to a smooth sensation with just enough acid backbone.","chinese":"初尝口味偏甜，一抹果味赋予了她恰到好处的酸度。"},{"english":"Her little shoes now fitted her smartly.","chinese":"她的小鞋子穿来恰到好处。"},{"english":"You are the point of golden section in my life, loving me to the perfect degree.","chinese":"你是我生命中的黄金分割点，恰到好处的爱着我。"},{"english":"Learn to be mischievous and coquetry.","chinese":"学会恰到好处地撒娇调皮。"},{"english":"Super-ripe fruit, silk-like tannins and good acidity linger on the palate.","chinese":"蕴含醇熟的果味口感，单宁丝滑，酸度恰到好处。"},{"english":"The skin fried to perfection, crispy golden and the meat is tender.","chinese":"皮炸的恰到好处，金黄色的脆皮和软嫩的肉。"},{"english":"It is just fine to put the ellipsis at the end of the article.","chinese":"删节号用在这篇文章的末尾，恰到好处。"},{"english":"I found his speech wholly apposite to the current debate.","chinese":"我认为他的讲话对当前的辩论是恰到好处的。"},{"english":"He often sets the table a-roaring with a well-placed bon mot.","chinese":"他经常以恰到好处的珠玑妙语使满桌的人哄堂大笑。"},{"english":"The situation of the house was good.","chinese":"房子的位置选得恰到好处。"},{"english":"Her eye appears small and of the correct almond shape and is set very correctly into her skull.","chinese":"小小的杏仁眼恰到好处地嵌在头骨中。"},{"english":"It features intense fruit aromas in harmony with slight mint and anise notes.","chinese":"浓郁的果香与丝丝薄荷和茴芹味道协调得恰到好处。"},{"english":"That Caroline ran after a man was hit off by Linda.","chinese":"琳达把卡罗琳追求一名男子的情况描绘得恰到好处。"},{"english":"We approached the confluence at the perfect speed.","chinese":"我们以恰到好处的速度来到汇流处。"}],"related":[{"definition":["(idiom) appropriate\/apt\/just right"],"pinyin":["qia4 ru2 qi2 fen4"],"word":"恰如其分"},{"definition":["ingenious\/clever\/ingenuity\/artifice"],"pinyin":["qiao3 miao4"],"word":"巧妙"},{"definition":["to grasp\/(dialect) affecting shyness\/coy\/to create difficulties"],"pinyin":["na2 nie1"],"word":"拿捏"},{"definition":["lit. extreme saturation (idiom)\/fig. vividly and thoroughly\/in great detail\/without restraint\/(of a performance) brilliant"],"pinyin":["lin2 li2 jin4 zhi4"],"word":"淋漓尽致"},{"definition":["perfect\/perfection\/perfectly"],"pinyin":["wan2 mei3"],"word":"完美"},{"definition":["to bring out the best in each other (idiom)\/to complement one another well"],"pinyin":["xiang1 de2 yi4 zhang1"],"word":"相得益彰"},{"definition":["exquisite\/meticulous"],"pinyin":["xi4 ni4"],"word":"细腻"},{"definition":["the brush stroke that dots in the eyes (idiom); fig. to add the vital finishing touch\/the crucial point that brings the subject to life\/a few words to clinch the point"],"pinyin":["dian3 jing1 zhi1 bi3"],"word":"点睛之笔"},{"definition":["appropriate\/suitable"],"pinyin":["qia4 dang4"],"word":"恰当"},{"definition":["excellent in every respect\/flawless"],"pinyin":["wu2 ke3 tiao1 ti5"],"word":"无可挑剔"},{"definition":["squeaky clean\/neat and tidy\/efficient"],"pinyin":["gan1 jing4 li4 luo5"],"word":"干净利落"},{"definition":["grace\/graceful"],"pinyin":["you1 ya3"],"word":"优雅"},{"definition":["to resemble nature itself\/of the highest quality (idiom)"],"pinyin":["hun2 ran2 tian1 cheng2"],"word":"浑然天成"},{"definition":["ample\/complete\/hundred percent\/a pure shade (of some color)"],"pinyin":["shi2 zu2"],"word":"十足"},{"definition":["to paint a dragon and dot in the eyes (idiom); fig. to add the vital finishing touch\/the crucial point that brings the subject to life\/a few words to clinch the point"],"pinyin":["hua4 long2 dian3 jing1"],"word":"画龙点睛"},{"definition":["gentle\/soft"],"pinyin":["rou2 he2"],"word":"柔和"}]}