{"definition":["(idiom) appropriate\/apt\/just right"],"pinyin":["qia4 ru2 qi2 fen4"],"traditional":["恰如其分"],"rank":25989.0,"normalized_rank":0.3636198284666937,"fraction":0.0000013546723772787306,"cumulative_fraction":0.9856908120176471,"word":"恰如其分","characters":[{"definition":["exactly\/just"],"pinyin":["qia4"],"word":"恰"},{"definition":["as\/as if\/such as"],"pinyin":["ru2"],"word":"如"},{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen4","fen1"],"word":"分"}],"containing_words":[],"sentences":[{"english":"The sutra also lists 250 examples to describe aptly the qualities of bodhichitta.","chinese":"并以250种比喻恰如其分地描述了菩提心的功德。"},{"english":"Blue bath rooms are appropriately watery.","chinese":"蓝色的卫生间与水相衬恰如其分。"},{"english":"he could not be expected to appraise properly the spirit of America.","chinese":"大家对他能否恰如其分地把握美国精魂不抱什么期望。"},{"english":"Once you have been using the right words will be eye-catching.","chinese":"一旦你能恰如其分地应用这些词汇，将会引人注目的。"},{"english":"Appropriately enough, Chambers' conviction has spurred a flurry of tweets ridiculing the decision.","chinese":"恰如其分地，钱伯斯的信念促使了嘲笑决定鸣叫乱舞。"},{"english":"His jaw tightened, but he kept his smile in place with some effort.","chinese":"他下巴一紧，但还是努力保持着恰如其分的微笑。"},{"english":"The financial markets are appropriately cynical about U.S. politics.","chinese":"金融市场恰如其分地对美国的政治冷嘲热讽。"},{"english":"Jazz has been called America's classical music, and for good reason.","chinese":"爵士乐被称作为美国的经典音乐，是恰如其分的。"},{"english":"If handled well, there is a sense of the United States appropriately defects.","chinese":"处理得好，令人有恰如其分缺陷美之感。"},{"english":"Many Chinese proverbs cannot be properly rendered into English.","chinese":"许多中国谚语都不能恰如其分地译成英语。"},{"english":"They react to how they are treated and always respond appropriately.","chinese":"它们总能恰如其分的对别人对自己的行为作出回应。"},{"english":"Guomu conference table gives you a proper sence of comfort and shows its full function.","chinese":"国木会议桌为您营造出恰如其分的感觉和功能。"},{"english":"I don't know whether that's true or not, but it may very well be.","chinese":"我不知道这一说法是否真实，但是它很可能恰如其分。"},{"english":"When this mind is master of itself, all the actions of our daily life will be perfectly appropriate.","chinese":"这念心能够作主，日常生活所作所为，就能恰如其分。"}],"related":[{"definition":["it's just perfect\/it's just right"],"pinyin":["qia4 dao4 hao3 chu4"],"word":"恰到好处"},{"definition":["appropriate\/suitable"],"pinyin":["qia4 dang4"],"word":"恰当"},{"definition":["lit. extreme saturation (idiom)\/fig. vividly and thoroughly\/in great detail\/without restraint\/(of a performance) brilliant"],"pinyin":["lin2 li2 jin4 zhi4"],"word":"淋漓尽致"},{"definition":["close-fitting\/closest (translation)"],"pinyin":["tie1 qie4"],"word":"贴切"},{"definition":["properly\/satisfactorily\/firmly\/very fitting\/appropriate\/proper\/to be in good order\/also written 妥貼|妥贴[tuo3 tie1]"],"pinyin":["tuo3 tie1"],"word":"妥帖"},{"definition":["ingenious\/clever\/ingenuity\/artifice"],"pinyin":["qiao3 miao4"],"word":"巧妙"},{"definition":["just as if"],"pinyin":["qia4 ru2"],"word":"恰如"},{"definition":["to conform to no conventional pattern\/unconventional\/offbeat"],"pinyin":["bu4 luo4 su2 tao4"],"word":"不落俗套"},{"definition":["to contain\/to hold\/(of a person or style etc) reserved\/restrained\/(of words, writings) full of hidden meaning\/implicit\/veiled (criticism)"],"pinyin":["han2 xu4"],"word":"含蓄"},{"definition":["appropriate to the occasion\/fitting"],"pinyin":["de2 ti3"],"word":"得体"},{"definition":["to grasp\/(dialect) affecting shyness\/coy\/to create difficulties"],"pinyin":["na2 nie1"],"word":"拿捏"},{"definition":["to paint a dragon and dot in the eyes (idiom); fig. to add the vital finishing touch\/the crucial point that brings the subject to life\/a few words to clinch the point"],"pinyin":["hua4 long2 dian3 jing1"],"word":"画龙点睛"},{"definition":["in the finest detail"],"pinyin":["jin4 zhi4"],"word":"尽致"},{"definition":["to interpret\/to comment and explain\/to annotate\/to perform (i.e. interpret a theatrical role)\/to decode\/interpretation\/annotation"],"pinyin":["quan2 shi4"],"word":"诠释"},{"definition":["background (of a painting)\/backdrop\/a foil (to set off something to advantage)\/to offset (something to advantage)"],"pinyin":["hong1 tuo1"],"word":"烘托"},{"definition":["original and ingenious (idiom)\/to show great creativity"],"pinyin":["jiang4 xin1 du2 yun4"],"word":"匠心独运"}]}