{"definition":["to think of\/to keep thinking about\/to be concerned about"],"pinyin":["dian4 ji4"],"traditional":["惦記"],"rank":18544.0,"normalized_rank":0.2594546192268409,"fraction":0.0000027794140154511883,"cumulative_fraction":0.9710774974589944,"word":"惦记","characters":[{"definition":["to think of\/to remember\/to miss"],"pinyin":["dian4"],"word":"惦"},{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"记"}],"containing_words":[],"sentences":[{"english":"With an eye out for lake deposits, I went back to get samples a few days later.","chinese":"惦记着湖泊沉积，几天后我又回去取了样本。"},{"english":"With seven mouths and eight tongues, all were talking together. They tried to tell how they had missed him.","chinese":"男男女女都七嘴八舌地说出他们的惦记和盼念。"},{"english":"Forget rubbing elbows with strangers at networking mixers .","chinese":"别惦记着和社交网站的陌生人拉关系。"},{"english":"In combat, one lives in the now and does not think much about yesterday or tomorrow.","chinese":"战斗中，此刻尚存者别想昨天，也别惦记明天。"},{"english":"She will always have something to remember you by while you are away.","chinese":"即使你不在她身边时母亲总会惦记着你。"},{"english":"Was there any use buying Dilcey if she was going to mope about the child?","chinese":"只买来迪尔茜，要是她整天惦记孩子，又有什么用呢？"},{"english":"Mr Li is unlikely still to be thinking about this little setback.","chinese":"李先生不太可能还惦记着这个小小的挫折。"},{"english":"Once throne eyes gaze, age face a dark, remember the human into blacklist.","chinese":"皇帝眼睛一瞪，老脸一黑，就把人惦记入黑名单了。"},{"english":"My heart cared about everyone, it just couldn't take care of itself.","chinese":"我的心惦记每个人，但它就是没能照顾好自己。"},{"english":"Though rarely seen during the election campaign, Canadians have China on their minds.","chinese":"加拿大人心头惦记着中国，这在选举期间是少见的。"},{"english":"LL: I'd be psyched if you left behind that new leather couch you got for Christmas last year.","chinese":"原来你在惦记我去年圣诞节买的新沙发。"},{"english":"She is dead now herself, but many still living remember her.","chinese":"她现在已经死了，却仍为很多在世的人所惦记。"},{"english":"We shall miss her; but SHE will be happy.","chinese":"我们会惦记她的，不过她会很幸福。"},{"english":"Kurita had one more major factor to bear in mind .","chinese":"栗田还惦记着一个重大的决胜因素。"},{"english":"But you, O my brothers, remember sometimes thy little Alex that was.","chinese":"而你们，弟兄们哪，要不时惦记小亚历克斯哥们啊。"},{"english":"I've been thinking about that all the time.","chinese":"我一直惦记着这件事。"}],"related":[{"definition":["to constantly have (sb or sth) on one's mind"],"pinyin":["dian4 nian4"],"word":"惦念"},{"definition":["concerned"],"pinyin":["gua4 nian4"],"word":"挂念"},{"definition":["to worry about\/to be concerned about"],"pinyin":["qian1 gua4"],"word":"牵挂"},{"definition":["deeply worried (idiom); to feel anxious"],"pinyin":["qian1 chang2 gua4 du4"],"word":"牵肠挂肚"},{"definition":["to keep in mind constantly (idiom)"],"pinyin":["nian4 nian4 bu4 wang4"],"word":"念念不忘"},{"definition":["to bear grudges"],"pinyin":["ji4 hen4"],"word":"记恨"},{"definition":["to worry\/to be on one's mind"],"pinyin":["gua4 xin1"],"word":"挂心"},{"definition":["to miss\/to remember with longing\/to long to see again"],"pinyin":["xiang3 nian4"],"word":"想念"},{"definition":["to hate to do sth\/to hate to part with\/to begrudge"],"pinyin":["she3 bu5 de5"],"word":"舍不得"},{"definition":["(coll.) to be eager for\/to long for\/to look forward to"],"pinyin":["ba1 bu5 de5"],"word":"巴不得"},{"definition":["to talk about often\/to reminisce about\/to keep repeating\/to keep harping on\/to discuss"],"pinyin":["nian4 dao5"],"word":"念叨"},{"definition":["carefully\/meticulously\/to set one's heart on sth"],"pinyin":["shang4 xin1"],"word":"上心"},{"definition":["not to have room to put sth\/to be unable to let go"],"pinyin":["fang4 bu5 xia4"],"word":"放不下"},{"definition":["to feel apprehensive\/to be alarmed"],"pinyin":["dan1 jing1 shou4 pa4"],"word":"担惊受怕"},{"definition":["to bother about\/to haggle\/to bicker\/to argue\/plan\/stratagem"],"pinyin":["ji4 jiao4"],"word":"计较"},{"definition":["rare\/uncommon\/rarity\/to value as a rarity\/to cherish\/Taiwan pr. [xi1 han3]"],"pinyin":["xi1 han5"],"word":"稀罕"}]}