{"definition":["to suffer (defeat, death etc)"],"pinyin":["can3 zao1"],"traditional":["慘遭"],"rank":11955.0,"normalized_rank":0.16726596057252388,"fraction":0.000006143614404111278,"cumulative_fraction":0.943644968264486,"word":"惨遭","characters":[{"definition":["miserable\/wretched\/cruel\/inhuman\/disastrous\/tragic\/dim\/gloomy"],"pinyin":["can3"],"word":"惨"},{"definition":["to meet by chance (usually with misfortune)\/classifier for events: time, turn, incident"],"pinyin":["zao1"],"word":"遭"}],"containing_words":[{"definition":["to meet with disaster\/to die tragically"],"pinyin":["can3 zao1 bu4 xing4"],"word":"惨遭不幸"}],"sentences":[{"english":"Many prisoners were tortured and were victims of gruesome medical experiments.","chinese":"许多囚犯惨遭蹂躏，成为了可怕的医学实验的受害者。"},{"english":"With desolation shall the earth be laid waste, and it shall be utterly spoiled: for the Lord hath spoken this word.","chinese":"大地必要完全荒废，惨遭浩劫，因为上主这样定了。"},{"english":"Eventually fall joinville city, the people were massacred in the city, the Ming army on the sidelines is not saved.","chinese":"最终晋州城陷落，城内百姓惨遭屠杀，明军旁观不救。"},{"english":"Not all malls have suffered from competition and the suburbs’ transformation.","chinese":"竞争和郊区的变革并没有让所有的商城都惨遭不幸。"},{"english":"Many civilians were killed in the attack on the town.","chinese":"在那次攻城中，许多平民惨遭杀害。"},{"english":"But then they dwindled and were humbled through oppression, sorrow and distress.","chinese":"其后因惨遭灾患苦难，人口减少而被弃如前。"},{"english":"Many innocent blacks were slain and their homes sacked.","chinese":"许多无辜的黑人惨遭杀害，他们的家也被洗劫一空。"},{"english":"What kind of national security do we have when were robbed of our leaders?","chinese":"当我们的领袖惨遭横祸还会有什么样的国家安全？"},{"english":"Others blamed the careful doe for leading him to the slaughter.","chinese":"还有些树仙责怪那只母鹿害他惨遭屠杀。"},{"english":"The child's misery would move even the most obdurate heart.","chinese":"这个孩子的悲惨遭遇即使最冷酷的心肠也会为之动情。"},{"english":"On the other hand, relatively few people have had badexperiences with Apple.","chinese":"另一方面，相对较少的人在使用苹果时惨遭不测。"},{"english":"Dr Manette realized that the sister must have been very badly treated.","chinese":"曼奈特医生意识到这位姐姐准是惨遭虐待。"},{"english":"What was Job's understanding of God after all his miseries?","chinese":"约伯在这一切悲惨遭遇之后对上帝有何看法？"},{"english":"He told me a tale of woe about himself.","chinese":"他告诉了我一个关于他自己的悲惨遭遇。"},{"english":"Wars have been waged. Innocents have been slaughtered.","chinese":"为此曾经战火连天，无辜民众惨遭屠杀。"},{"english":"A remote village in Kaohsiung was feared fully sudmerged by flood-created lake burst.","chinese":"高雄县甲仙乡小林村甚至有恐全村惨遭灭顶。"}],"related":[{"definition":["to meet by chance (usually with misfortune)\/classifier for events: time, turn, incident"],"pinyin":["zao1"],"word":"遭"},{"definition":["to suffer\/to meet with (sth unfortunate)"],"pinyin":["zao1 dao4"],"word":"遭到"},{"definition":["to meet with\/to encounter\/(bitter) experience"],"pinyin":["zao1 yu4"],"word":"遭遇"},{"definition":["to suffer the painful loss of (a loved one etc)\/to miss out on (an opportunity)\/to fail to gain (victory etc)"],"pinyin":["tong4 shi1"],"word":"痛失"},{"definition":["no match for\/cannot beat"],"pinyin":["bu4 di2"],"word":"不敌"},{"definition":["to meet with disaster\/to die tragically"],"pinyin":["can3 zao1 bu4 xing4"],"word":"惨遭不幸"},{"definition":["quilt\/by\/(indicates passive-voice clauses)\/(literary) to cover\/to meet with\/(coll.) (since c. 2009) used before a verb that does not accurately represent what actually happened, to describe with black humor how sb or sth was dealt with by the authorities (as in 被自殺|被自杀[bei4 zi4 sha1])"],"pinyin":["bei4"],"word":"被"},{"definition":["Waterloo (Belgium)\/Battle of Waterloo (1815)\/fig. a defeat\/failure"],"pinyin":["Hua2 tie3 lu2"],"word":"滑铁卢"},{"definition":["blood purge\/massacre"],"pinyin":["xue4 xi3"],"word":"血洗"},{"definition":["to kill (or assault) sadistically"],"pinyin":["nu:e4 sha1"],"word":"虐杀"},{"definition":["to sink down to\/to be reduced to (sth inferior)"],"pinyin":["lun2 wei2"],"word":"沦为"},{"definition":["to hang sb up and beat him"],"pinyin":["diao4 da3"],"word":"吊打"},{"definition":["spectacle too horrible to endure (idiom); tragic sight\/appalling scenes of devastation"],"pinyin":["can3 bu4 ren3 du3"],"word":"惨不忍睹"},{"definition":["to suffer\/to sustain (loss, misfortune)"],"pinyin":["zao1 shou4"],"word":"遭受"},{"definition":["to nurse a grievance\/to harbor a grudge"],"pinyin":["yin3 hen4"],"word":"饮恨"},{"definition":["(literary) to be routed (in a war)\/to suffer defeat (in sports etc)"],"pinyin":["bai4 bei3"],"word":"败北"}]}