{"definition":["to signify\/to mean\/to imply"],"pinyin":["yi4 wei4 zhe5"],"traditional":["意味著"],"rank":1510.0,"normalized_rank":0.021126859093643757,"fraction":0.00010615697394077314,"cumulative_fraction":0.6862883420771057,"word":"意味着","characters":[{"definition":["Italy\/Italian\/abbr. for 意大利[Yi4 da4 li4]","idea\/meaning\/thought\/to think\/wish\/desire\/intention\/to expect\/to anticipate"],"pinyin":["Yi4","yi4"],"word":"意"},{"definition":["taste\/smell\/(fig.) (noun suffix) feel\/quality\/sense\/(TCM) classifier for ingredients of a medicine prescription"],"pinyin":["wei4"],"word":"味"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"}],"containing_words":[],"sentences":[{"english":"Becoming a winning poker player means knowing when to quit.","chinese":"成为扑克中的赢家意味着你知道何时收手。"},{"english":"Tears don't mean you're losing, everybody's bruising.","chinese":"眼泪并不意味着你失去了，大家的青肿。"},{"english":"In particular this means that this file is not malicious but a false alarm .","chinese":"这意味着，这个文件是没有恶意的，只是虚惊一场。"},{"english":"Of course, lots of cookies means some of them must be put away for later days.","chinese":"当然，大量的曲奇就意味着有一些会被留着以后再吃。"},{"english":"\" Gentling \" means training it to except accept the human attention need it needed for care and gloomygrooming.","chinese":"“驯化”意味着训练他们接受人类必要的照顾与护理。"},{"english":"Flap Horton: Does this mean you won't be knitting the baby any booties?","chinese":"这不会是意味着你不打算给婴儿做任何衣服？"},{"english":"What does this mean for the Arrow -verse?","chinese":"这对绿箭侠来说意味着什么？"},{"english":"And that means they need to be smaller.","chinese":"但意味着他们需要小型的。"},{"english":"What will the euro beggarly for customers?","chinese":"欧元对消费者意味着什么？"},{"english":"What do alignment and harmonization really mean?","chinese":"校准和协调真正意味着什么？"},{"english":"The ontological character of literary understanding signifies self-understanding of interpretive subject.","chinese":"理解的本体论性质意味着阐释主体的自我理解。"},{"english":"That means programmers have to keep track or recompute how much space is left all the time.","chinese":"这意味着程序员必须始终跟踪或重新计算剩余的空间。"},{"english":"This means the change had procreated .","chinese":"这意味着改变了生育。"},{"english":"Intriguingly, this could mean the device is even older than thought.","chinese":"有趣的是，这意味着这个装置可能比想象的还要古老。"},{"english":"Union with Christ means that when Christ died, I died with Him.","chinese":"与基督团结意味着当基督死去的时候，我与他同死。"},{"english":"That doesn't mean these materials won't play a significant role, Wadia says.","chinese":"瓦迪亚说，这并不意味着这些材料起不了多大作用。"}],"related":[{"definition":["might (happen)\/possible\/probable\/possibility\/probability\/maybe\/perhaps\/CL:個|个[ge4]"],"pinyin":["ke3 neng2"],"word":"可能"},{"definition":["in other words"],"pinyin":["huan4 yan2 zhi1"],"word":"换言之"},{"definition":["to make clear\/to make known\/to state clearly\/to indicate\/known"],"pinyin":["biao3 ming2"],"word":"表明"},{"definition":["thus\/consequently\/as a result"],"pinyin":["yin1 ci3"],"word":"因此"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["in fact\/in reality\/actually\/as a matter of fact\/de facto\/ipso facto"],"pinyin":["shi4 shi2 shang4"],"word":"事实上"},{"definition":["possibility\/probability"],"pinyin":["ke3 neng2 xing4"],"word":"可能性"},{"definition":["if\/in case\/in the event that"],"pinyin":["ru2 guo3"],"word":"如果"},{"definition":["auxiliary verb introducing future action: may (be able to)\/will (cause)\/should (enable)\/going to"],"pinyin":["jiang1 hui4"],"word":"将会"},{"definition":["inevitable\/certain\/necessity"],"pinyin":["bi4 ran2"],"word":"必然"},{"definition":["regarding\/as far as sth is concerned\/with regards to"],"pinyin":["dui4 yu2"],"word":"对于"},{"definition":["with regard to (preceding phrase)"],"pinyin":["er2 yan2"],"word":"而言"},{"definition":["in fact\/in reality\/as a matter of fact\/in practice"],"pinyin":["shi2 ji4 shang4"],"word":"实际上"},{"definition":["immediately\/at once"],"pinyin":["zhe4 jiu4"],"word":"这就"},{"definition":["in case (sth happens)\/if\/once (sth happens, then...)\/when\/in a short time\/in one day"],"pinyin":["yi1 dan4"],"word":"一旦"},{"definition":["to explain\/to illustrate\/to indicate\/to show\/to prove\/explanation\/directions\/caption\/CL:個|个[ge4]"],"pinyin":["shuo1 ming2"],"word":"说明"}]}