{"definition":["not to feel like (doing sth)\/disinclined to"],"pinyin":["lan3 de2"],"traditional":["懶得"],"rank":17386.0,"normalized_rank":0.2432526968225764,"fraction":0.0000031428983063373995,"cumulative_fraction":0.9676586884458795,"word":"懒得","characters":[{"definition":["lazy","variant of 懶|懒[lan3]"],"pinyin":["lan3","lan3"],"word":"懒"},{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[{"definition":["not wishing to acknowledge sb\/unwilling to respond"],"pinyin":["lan3 de5 da1 li3"],"word":"懒得搭理"}],"sentences":[{"english":"Needless to say, the British made no attempt to introduce anti-racist legislation.","chinese":"不用说，英国人是懒得在香港对反种族主义立法的。"},{"english":"Even I don't feel like moving my hand which holds the mouse.","chinese":"甚至握着鼠标的手都懒得挪一下位置。"},{"english":"Multicasting requires some more coding and programmers are lazy to even look into it.","chinese":"多播需求更多甚至连程序员都懒得浏览检验的代码。"},{"english":"Lying in a den in Bombay , with a slack jaw and not much to say.","chinese":"躺在孟买的一个密室里，下巴都懒得动，不想说什么。"},{"english":"Why, I'm that tired Sunday I can't even read the papers.","chinese":"唉，星期天我可是疲倦得要命，连报都懒得看的。"},{"english":"Larry is too lazy to lift a finger.","chinese":"拉里懒得不想动指头去帮任何人。"},{"english":"He is too lazy to move but luckily he has strong toes.","chinese":"他虽然懒得不肯动，但是幸而有强壮的脚趾。"},{"english":"The main influencing factors for perceived barriers to exercise include laziness and lack of time.","chinese":"自觉运动障碍最大因素为懒得动和时问不够。"},{"english":"She walked into my room without bothering to ring the bell first.","chinese":"她连先按下门铃都懒得按一下就走进了我的房间。"},{"english":"Larry is too lazy to lift a finger to help anybody.","chinese":"拉里懒得不想动指头去帮助任何人。"},{"english":"I was too tired to think about it more so I just glanced at it and fell asleep.","chinese":"一路累乏，懒得多想，只看了它一眼，倒头便睡。"},{"english":"And you'd rather spend an extra ten minutes in a hot shower than go out for a morning job.","chinese":"相信你宁愿多花十分钟冲热水澡也懒得出门工作。"},{"english":"Some candidates don'tto spell the company's name correctly.","chinese":"一些应聘者都懒得把公司的名称拼写正确。"},{"english":"I sent them an invitation, but they didn't even bother to reply.","chinese":"我给他们寄了个请帖，但他们竟连话也懒得回。"},{"english":"You don't feel like leaving comments? Please leave your palm-print.","chinese":"懒得留言？那留下您的掌印吧。"},{"english":"Like I said, I've been feeling lazy.","chinese":"就像我说的，我觉得懒得动。"}],"related":[{"definition":["unexpectedly"],"pinyin":["bu4 xiang3"],"word":"不想"},{"definition":["lazy","variant of 懶|懒[lan3]"],"pinyin":["lan3","lan3"],"word":"懒"},{"definition":["nonsense\/rubbish\/superfluous words\/You don't say!\/No kidding! (gently sarcastic)"],"pinyin":["fei4 hua4"],"word":"废话"},{"definition":["you might as well (do it)\/simply\/just"],"pinyin":["suo3 xing4"],"word":"索性"},{"definition":["variant of 答理[da1 li5]"],"pinyin":["da1 li5"],"word":"搭理"},{"definition":["useless"],"pinyin":["mei2 yong4"],"word":"没用"},{"definition":["straightforward\/clear-cut\/blunt (e.g. statement)\/you might as well\/simply"],"pinyin":["gan1 cui4"],"word":"干脆"},{"definition":["at a loss\/unable to do anything about it\/to have no choice"],"pinyin":["mei2 fa3"],"word":"没法"},{"definition":["need not"],"pinyin":["bu4 yong4"],"word":"不用"},{"definition":["there is nothing to be done\/one can't do anything about it"],"pinyin":["mei2 ban4 fa3"],"word":"没办法"},{"definition":["to understand\/to pay attention to\/to take notice of"],"pinyin":["li3 hui4"],"word":"理会"},{"definition":["to argue needlessly\/to waste time explaining"],"pinyin":["fei4 kou3 she2"],"word":"费口舌"},{"definition":["to refuse to acknowledge\/to pay no attention to\/to take no notice of\/to ignore"],"pinyin":["bu4 li3"],"word":"不理"},{"definition":["to pay no attention to\/not to mind"],"pinyin":["bu4 zai4 yi4"],"word":"不在意"},{"definition":["never"],"pinyin":["cong2 lai2 bu4"],"word":"从来不"},{"definition":["not very\/not particularly"],"pinyin":["bu4 zen3 me5"],"word":"不怎么"}]}