{"definition":["to become\/to turn into"],"pinyin":["cheng2 wei2"],"traditional":["成為"],"rank":130.0,"normalized_rank":0.001818868663691184,"fraction":0.0008598398993618095,"cumulative_fraction":0.34409657075281297,"word":"成为","characters":[{"definition":["to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth","surname Cheng"],"pinyin":["cheng2","Cheng2"],"word":"成"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"}],"containing_words":[{"definition":["God became man"],"pinyin":["Shen2 cheng2 wei2 ren2"],"word":"神成为人"}],"sentences":[{"english":"The lesions will \"bleach out\" and become clean wounds that will heal after a molt.","chinese":"病变会“漂白了”，成为清洁伤口愈合后，将蜕皮。"},{"english":"And fire raised man above all animals .","chinese":"火使人成为万物之灵。"},{"english":"MBL's work is truly amazing, thank you for letting me be a part of it.","chinese":"MBL的工作确实是惊人的，谢谢你让我成为一部分。"},{"english":"Becoming a winning poker player means knowing when to quit.","chinese":"成为扑克中的赢家意味着你知道何时收手。"},{"english":"And the Northwest Passage in the Arctic became ice-free for the first time in living memory.","chinese":"在当今人们的记中，北极西北航道首次成为无冰航道。"},{"english":"In Love + Sex With Robots, Levy explains how human-robot love can become a reality.","chinese":"Levy在书中说人与机器间的爱情可以成为现实。"},{"english":"He can hold the ball, and be a target man.","chinese":"他可以护住球，也能成为一个目标男。"},{"english":"IP has become an important subject in fields of diplomacy and foreign trade.","chinese":"知识产权已经成为外交外贸领域的重要议题。"},{"english":"Gradually,it became a stage show on its own in the eighteenth century.","chinese":"在十八世纪，芭蕾渐渐地发展成为了一种舞台表演。"},{"english":"But, if a man bites a dog, that might make front-page news.","chinese":"但是，如果人咬了狗，那倒可能成为头版新闻。"},{"english":"It is now the highest-grossing independent British film of all time.","chinese":"如今，这已成为迄今为止最成功的英国独立电影。"},{"english":"Going blind was the watershed of my life.","chinese":"失明成为我人生的一个分水岭。"},{"english":"Therefore, statuary had turn into a three-dimensional political picture poster.","chinese":"由此，雕塑成为了一种立体的政治“宣传画”。"},{"english":"If a new strategy works, then it will be adopted and further routinized as a rule of thumb.","chinese":"如果新办法行得通，以后就会沿用而成为经验法则。"},{"english":"Freaky monster you whether to become the new king of monsters you?","chinese":"奇特的怪物你是否成为新国王的怪物吗？"},{"english":"Dates become a series of business negotiations, often hard-nosed.","chinese":"约会成为一系列商务谈判，常常就像讨价还价。"}],"related":[{"definition":["to be done\/to be ready\/that's enough!\/that will do!"],"pinyin":["cheng2 le5"],"word":"成了"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作为"},{"definition":["to change into\/to turn into\/to become"],"pinyin":["bian4 cheng2"],"word":"变成"},{"definition":["to sink down to\/to be reduced to (sth inferior)"],"pinyin":["lun2 wei2"],"word":"沦为"},{"definition":["is\/are\/am\/yes\/to be","variant of 是[shi4]\/(used in given names)"],"pinyin":["shi4","shi4"],"word":"是"},{"definition":["one of (sth)\/one out of a multitude\/one (third, quarter, percent etc)"],"pinyin":["zhi1 yi1"],"word":"之一"},{"definition":["not just in name only, but also in reality (idiom)"],"pinyin":["ming2 fu4 qi2 shi2"],"word":"名副其实"},{"definition":["to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth","surname Cheng"],"pinyin":["cheng2","Cheng2"],"word":"成"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["nowadays\/now"],"pinyin":["ru2 jin1"],"word":"如今"},{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["to rise (in society)"],"pinyin":["ji1 shen1"],"word":"跻身"},{"definition":["pronoun\/synonym\/byword"],"pinyin":["dai4 ming2 ci2"],"word":"代名词"},{"definition":["however\/yet\/but"],"pinyin":["ran2 er2"],"word":"然而"},{"definition":["(emphasizes that sth is precisely or exactly as stated)\/precisely\/exactly\/even\/if\/just like\/in the same way as"],"pinyin":["jiu4 shi4"],"word":"就是"}]}