{"definition":["(of a large number of things) to form an expanse\/to cover an area"],"pinyin":["cheng2 pian4"],"traditional":["成片"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"成片","characters":[{"definition":["to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth","surname Cheng"],"pinyin":["cheng2","Cheng2"],"word":"成"},{"definition":["thin piece\/flake\/a slice\/film\/TV play\/to slice\/to carve thin\/partial\/incomplete\/one-sided\/classifier for slices, tablets, tract of land, area of water\/classifier for CDs, movies, DVDs etc\/used with numeral 一[yi1]: classifier for scenario, scene, feeling, atmosphere, sound etc\/Kangxi radical 91","disk\/sheet"],"pinyin":["pian4","pian1"],"word":"片"}],"containing_words":[],"sentences":[{"english":"Danyun (Red-Cloud) Valley, a name which compares the red leaves to red clouds.","chinese":"丹云峡，把成片的红叶比作红色的云彩。"},{"english":"We just peel the stickers off, cut them up, and throw them in your iced tea.","chinese":"我们只是揭掉商标然后把它们切成片丢进你的冰茶里。"},{"english":"In cities, modules can be stacked to make a new generation of efficient buildings.","chinese":"城市里，模型房能建造成片形成新一代的有效住房。"},{"english":"The tofu needs to be cut into slices first.","chinese":"这豆腐干要把它先片成片。"},{"english":"By policy, the police impolitely sliced the politician's politics books.","chinese":"依政策，警察没礼貌的把政治家的政治书切成片。"},{"english":"In fact, you can cut the mushrooms into pieces, dry them in the sun and preserve them.","chinese":"其实吃不完的蘑菇还可以切成片晒干保存起来。"},{"english":"Also can become in gardens piece cultivated, it is the better land that watch a flower by the plant.","chinese":"也可在园林中成片栽植，是较好的观花地被植物。"},{"english":"The single crystal is sectioned and then sliced and subsliced with a diamond .","chinese":"用金刚石锯先将单晶体切成段，再切成片。"},{"english":"It can be sliced and eaten as a salad.","chinese":"它也可以切成片条以色拉的形式食用。"},{"english":"The masson pines of the forest area are oversized, easy to have the big area plant disease.","chinese":"马尾松成片林面积过大，易产生大面积的病害。"},{"english":"Slice the ginger or beat it with cooking knife;","chinese":"姜切成片，或用刀拍散。"},{"english":"The Large expanse of granulose grows, does not have the inflammation, but very difficult to retreat.","chinese":"成片小粒生长，无炎症，但很难退去。"},{"english":"Raytheon even as tablets, rain Gouhe Man.","chinese":"雷声连成片，雨下沟河漫。"},{"english":"Acres of black and yellow smoke rolled steadily towards the sea .","chinese":"成片的黑黄色的浓烟不断地滚滚涌向大海。"},{"english":"Patches of resprouted trees now border the lakeshore.","chinese":"现在在湖边可以看到成片的新生树木。"},{"english":"There's lots of modern parts of Shanghai but it's the ye olde areas we love.","chinese":"上海有成片现代的区域，但是我们就是爱老区。"}],"related":[{"definition":["wide expanse\/large area\/vast stretch\/extending widely\/blockbuster movie"],"pinyin":["da4 pian4"],"word":"大片"},{"definition":["forming a continuous sheet\/continuous\/contiguous\/closely grouped"],"pinyin":["lian2 pian4"],"word":"连片"},{"definition":["lit. covering the mountains and the plains (idiom)\/fig. as far as the eye can see\/covering everything\/omnipresent"],"pinyin":["man4 shan1 bian4 ye3"],"word":"漫山遍野"},{"definition":["tree"],"pinyin":["shu4 mu4"],"word":"树木"},{"definition":["covering the whole land\/over hills and dales"],"pinyin":["man3 shan1 bian4 ye3"],"word":"满山遍野"},{"definition":["thin piece\/flake\/a slice\/film\/TV play\/to slice\/to carve thin\/partial\/incomplete\/one-sided\/classifier for slices, tablets, tract of land, area of water\/classifier for CDs, movies, DVDs etc\/used with numeral 一[yi1]: classifier for scenario, scene, feeling, atmosphere, sound etc\/Kangxi radical 91","disk\/sheet"],"pinyin":["pian4","pian1"],"word":"片"},{"definition":["in groups\/large numbers of\/grouping"],"pinyin":["cheng2 qun2"],"word":"成群"},{"definition":["Shulin city in New Taipei City 新北市[Xin1 bei3 shi4], Taiwan","woods\/grove\/forest"],"pinyin":["Shu4 lin2","shu4 lin2"],"word":"树林"},{"definition":["fragmentary\/random\/bits and pieces\/sporadic"],"pinyin":["ling2 xing1"],"word":"零星"},{"definition":["continuous\/unbroken\/uninterrupted\/extending forever into the distance (of mountain range, river etc)"],"pinyin":["lian2 mian2"],"word":"连绵"},{"definition":["lit. to fill the whole sky and cover the land; everywhere\/as far as the eye can see"],"pinyin":["man4 tian1 bian4 ye3"],"word":"漫天遍野"},{"definition":["as far as the eye can see (idiom)"],"pinyin":["yi1 wang4 wu2 ji4"],"word":"一望无际"},{"definition":["farmland\/cultivated land"],"pinyin":["nong2 tian2"],"word":"农田"},{"definition":["lit. to fill the whole sky\/everywhere\/as far as the eye can see"],"pinyin":["man4 tian1"],"word":"漫天"},{"definition":["in picturesque disorder (idiom); irregular arrangement with charming effect"],"pinyin":["cuo4 luo4 you3 zhi4"],"word":"错落有致"},{"definition":["(of snow etc) to fill the sky"],"pinyin":["man4 tian1 fei1 wu3"],"word":"漫天飞舞"}]}