{"definition":["wherever one goes"],"pinyin":["suo3 dao4 zhi1 chu4"],"traditional":["所到之處"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"所到之处","characters":[{"definition":["actually\/place\/classifier for houses, small buildings, institutions etc\/that which\/particle introducing a relative clause or passive\/CL:個|个[ge4]"],"pinyin":["suo3"],"word":"所"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish","place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point"],"pinyin":["chu3","chu4"],"word":"处"}],"containing_words":[],"sentences":[{"english":"Everywhere they appeared they were ovations.","chinese":"他们所到之处都有人欢呼。"},{"english":"He went to strike at the hedge, but where his sword met the thorns, great roses bloomed instead.","chinese":"他开始披荆斩棘，但是他宝剑所到之处都开出了蔷薇。"},{"english":"This footprint damages and depletes almost everything in its path.","chinese":"这些足迹所到之处破坏并耗尽了几乎一切资源。"},{"english":"Wherever he went, the wound soldier left behind him a trail of blood.","chinese":"伤员所到之处，都留下道道血迹。"},{"english":"They went to meet prime minister Jospin.","chinese":"所到之处，以满足总理若斯潘。"},{"english":"Everywhere are the collapsed buildings, such as death or injury to life, a bleak.","chinese":"所到之处，都是残垣断壁如死伤的生命，一片凄凉。"},{"english":"The hurricane flattered crops, uprooted trees, washed away roads and rippled off roofs.","chinese":"飓风所到之处，庄稼倒伏，树根拔起，房顶掀飞。"},{"english":"Everywhere you turn, people are talking about trends. On a CNN news show, a Chyron runs in the corner of the screen pointing out stories that are \"trending now.\"","chinese":"你所到之处，人们都在谈论潮流。"},{"english":"It will give you a whole new perspective on the place you are visiting.","chinese":"这将给你一个全新的视角来观察你们所到之处。"},{"english":"Wherever we looked, we saw evidence of destruction.","chinese":"我们的目光所到之处，都是毁坏的迹象。"},{"english":"The leaves rustled where Tim had disappeared into the underbrush.","chinese":"蒂姆消失在灌木从里，他所到之处树叶沙沙作响。"},{"english":"Everywhere he went, audiences reacted with almost delirious delight.","chinese":"他所到之处，听众无不欢欣若狂。"},{"english":"He leads an army so massive it shakes the ground with its march.","chinese":"他率领的部队是如此豪壮，所到之处地动山摇。"}],"related":[{"definition":["in an instant"],"pinyin":["qing3 ke4 jian1"],"word":"顷刻间"},{"definition":["to disperse\/to scatter in all directions"],"pinyin":["si4 san4"],"word":"四散"},{"definition":["in all directions\/all around\/far and near"],"pinyin":["si4 mian4 ba1 fang1"],"word":"四面八方"},{"definition":["to engulf\/to sweep\/to carry away everything"],"pinyin":["xi2 juan3"],"word":"席卷"},{"definition":["lit. to fill the whole sky\/everywhere\/as far as the eye can see"],"pinyin":["man4 tian1"],"word":"漫天"},{"definition":["instantly\/in no time"],"pinyin":["qing3 ke4"],"word":"顷刻"},{"definition":["to sweep everything before one\/to be invincible (idiom)"],"pinyin":["suo3 xiang4 pi1 mi3"],"word":"所向披靡"},{"definition":["to be swept by the wind\/to be blown about by the wind\/to be routed (in battle etc)"],"pinyin":["pi1 mi3"],"word":"披靡"},{"definition":["in a split second"],"pinyin":["sha4 shi2 jian1"],"word":"霎时间"},{"definition":["everything"],"pinyin":["jin4 shu4"],"word":"尽数"},{"definition":["to flock (to see)\/to mill\/to throng"],"pinyin":["feng1 yong1"],"word":"蜂拥"},{"definition":["impossible to resist (idiom); an irresistible force"],"pinyin":["shi4 bu4 ke3 dang1"],"word":"势不可当"},{"definition":["to spring up everywhere\/from all around"],"pinyin":["si4 qi3"],"word":"四起"},{"definition":["(of snow etc) to fill the sky"],"pinyin":["man4 tian1 fei1 wu3"],"word":"漫天飞舞"},{"definition":["lit. not even a blade of grass grows (idiom)\/fig. barren"],"pinyin":["cun4 cao3 bu4 sheng1"],"word":"寸草不生"},{"definition":["defeated\/routed"],"pinyin":["kui4 san3"],"word":"溃散"}]}