{"definition":["the feel (of sth touched with the hand)\/(textiles) handle"],"pinyin":["shou3 gan3"],"traditional":["手感"],"rank":7979.0,"normalized_rank":0.11163656205839967,"fraction":0.000012005637966005887,"cumulative_fraction":0.9095469883706636,"word":"手感","characters":[{"definition":["hand\/(formal) to hold\/person engaged in certain types of work\/person skilled in certain types of work\/personal(ly)\/convenient\/classifier for skill\/CL:雙|双[shuang1],隻|只[zhi1]"],"pinyin":["shou3"],"word":"手"},{"definition":["to feel\/to move\/to touch\/to affect\/feeling\/emotion\/(suffix) sense of ~"],"pinyin":["gan3"],"word":"感"}],"containing_words":[],"sentences":[{"english":"The products made of well-selected wool feel soft (have a soft feel).","chinese":"用料上乘的羊毛制品，手感柔软。"},{"english":"Micro-channels filled with different materials in order to increase the speed and feeling.","chinese":"微坑道填充不同的材料以提高速度和手感。"},{"english":"This paper is smooth to the touch.","chinese":"这种纸张手感平滑。"},{"english":"The GR223 grip has great flexibility with a protective membrane layer that adds softness and comfort.","chinese":"伸缩弹性好，具有护膜的握把胶，手感柔软舒服。"},{"english":"Uncle Feel, Are you serious, or just kidding?","chinese":"叔叔手感，你是稀瑞耳屎先生还是贾斯特。鸡丁？"},{"english":"Fold back the cover and read comfortably with just one hand.","chinese":"反折的覆盖面和阅读只有一个手感舒适。"},{"english":"The quality is superior, yet the price is very reasonable. It feels soft and smooth.","chinese":"该产品质优价廉，手感柔软光滑。"},{"english":"This quality does have sueded face and brushed back and soft handfeel which we like.","chinese":"这个品质绒布的正面为仿皮，背面为拉绒，手感柔软。"},{"english":"Because An more expensive racket only gives you more comfortable hand feelings!","chinese":"因为贵点的球拍仅仅给你提供了更舒适的手感。"},{"english":"The proposal buys those feel exquisite, of withy function beautiful.","chinese":"建议购买那些手感细腻，柔韧性能佳的。"},{"english":"My skin texture has improved to feel soft and silky without any greasiness.","chinese":"我的皮肤纹理有改进，手感柔软，没有任何油腻柔滑。"},{"english":"Our TW playtesters found a comfortable response with lots of feel and control with this racquet.","chinese":"在实际使用会感受到这支球拍的良好控球及舒适手感。"},{"english":"It is cool to the touch and very absorbent .","chinese":"它的手感非常好并且非常吸汗。"},{"english":"The fibre whiteness is better and lofty, has no bast-fibre scratchiness.","chinese":"白度好，手感柔软，无麻类纤维的刺痒感。"},{"english":"Craquelure is even and clear. Do not lose varnish. Smooth handle.","chinese":"裂纹效果明显均匀，不掉漆，手感平整。"},{"english":"Cotton sateen fabric feels soft and smooth on the skin.","chinese":"棉缎面料手感柔软，皮肤光滑。"}],"related":[{"definition":["hit rate\/scoring rate"],"pinyin":["ming4 zhong4 lu:4"],"word":"命中率"},{"definition":["front sight (firearms)\/the zero point indicator marked on a steelyard"],"pinyin":["zhun3 xing1"],"word":"准星"},{"definition":["somewhat\/to some degree"],"pinyin":["san1 fen1"],"word":"三分"},{"definition":["to score"],"pinyin":["de2 fen1"],"word":"得分"},{"definition":["tactile sensation\/touch\/feel"],"pinyin":["chu4 gan3"],"word":"触感"},{"definition":["(military) line of troops encircling an enemy position\/(telephony) outside line\/(basketball) outside the three-point line"],"pinyin":["wai4 xian4"],"word":"外线"},{"definition":["to hit (a target)"],"pinyin":["ming4 zhong4"],"word":"命中"},{"definition":["to shoot for the basket (basketball)"],"pinyin":["tou2 lan2"],"word":"投篮"},{"definition":["opening (chess etc)\/early stage of game, match, work, activity etc"],"pinyin":["kai1 ju2"],"word":"开局"},{"definition":["to attack\/to assault\/to go on the offensive\/attack\/assault\/offense (sports)"],"pinyin":["jin4 gong1"],"word":"进攻"},{"definition":["half of a game or contest\/half-court"],"pinyin":["ban4 chang3"],"word":"半场"},{"definition":["not up to scratch\/subpar\/off\/gone awry\/(of an instrument) to be out of kilter\/(of a forecast) to be off the mark"],"pinyin":["shi1 zhun3"],"word":"失准"},{"definition":["to hit the target with one's throw\/(basketball) to score"],"pinyin":["tou2 zhong4"],"word":"投中"},{"definition":["penalty shot\/penalty kick (in sports)"],"pinyin":["fa2 qiu2"],"word":"罚球"},{"definition":["inessentials\/minor detail"],"pinyin":["mo4 jie2"],"word":"末节"},{"definition":["to cast\/to send\/to throw oneself (into the river etc)\/to seek refuge\/to place oneself into the hands of"],"pinyin":["tou2"],"word":"投"}]}