{"definition":["lit. sth hits one in the face\/directly in one's face\/sth assaults the senses\/blatant (advertising)\/eye-catching\/(a smell) assaults the nostrils"],"pinyin":["pu1 mian4 er2 lai2"],"traditional":["撲面而來"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"扑面而来","characters":[{"definition":["to throw oneself at\/to pounce on\/to devote one's energies\/to flap\/to flutter\/to dab\/to pat\/to bend over"],"pinyin":["pu1"],"word":"扑"},{"definition":["flour\/noodles\/(of food) soft (not crunchy)\/(slang) (of a person) ineffectual\/spineless","variant of 麵|面[mian4]","face\/side\/surface\/aspect\/top\/classifier for flat surfaces such as drums, mirrors, flags etc"],"pinyin":["mian4","mian4","mian4"],"word":"面"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"来"}],"containing_words":[],"sentences":[{"english":"The acrid smell of lamb kebabs and the sweet smell of cakes soaked in honey reign over everything else.","chinese":"烤羊肉串的辛香和蜜制蛋糕的甜香扑面而来。"},{"english":"Early in the morning when the sliding window, there is the smell of rain, but the thick autumn is coming.","chinese":"晨起推窗，还有雨的气息，但那浓浓的秋凉扑面而来。"},{"english":"The Resting Area for Guests are redecorated in a festival atmosphere.","chinese":"来宾休息区装点一新，扑面而来的喜悦氛围。"},{"english":"Our society is developing rapidly, economy based knowledge and society of information is coming.","chinese":"人类社会迅猛发展，知识经济和信息化社会扑面而来。"},{"english":"Open the lid, an intense gasoline blowing.","chinese":"打开壶盖，一股浓烈的汽油味扑面而来。"},{"english":"Opened the window, rushing toward us is a light rain started falling day.","chinese":"推开窗，扑面而来的是一个细雨霏霏的日子。"},{"english":"As soon as I walked outside, I was greeted with white shimmering blanket of cold.","chinese":"刚出门，扑面而来的是一片晶莹雪白的冰冷。"},{"english":"I was greeted with the shimmering white blanket of cold.","chinese":"扑面而来的是一大片晶莹雪白的冰凉。"},{"english":"The acrid smell of lamb kebabs and the sweet smell of cakes soggy in honey predominate over everything else.","chinese":"烤羊肉串的辛香和蜜制蛋糕的甜香扑面而来。"},{"english":"A sense of satire is strongly felt.","chinese":"强烈的讽刺味道扑面而来。"},{"english":"The sights and sounds of summer suburbia assaulted me.","chinese":"夏日郊区的景致与声音扑面而来。"},{"english":"The odor of hot pavement and auto exhaust blew into thecar.","chinese":"路面蒸腾的热浪混合着汽车尾气扑面而来。"},{"english":"Just walk to the stone house entrance, a water vapor that mixed medicine joss-stick rushes toward noodles since then.","chinese":"才走到石室入口，一股混合了药香的水汽扑面而来。"},{"english":"When the door was open,a musty smell came from the room.","chinese":"打开门，一股霉味扑面而来。"}],"related":[{"definition":["lit. sth hits one in the face\/directly in one's face\/sth assaults the senses\/blatant (advertising)\/eye-catching\/(a smell) assaults the nostrils"],"pinyin":["pu1 mian4"],"word":"扑面"},{"definition":["directly\/head-on (collision)\/in one's face (of wind)"],"pinyin":["ying2 mian4 er2 lai2"],"word":"迎面而来"},{"definition":["strong (taste, flavor, smell)"],"pinyin":["nong2 lie4"],"word":"浓烈"},{"definition":["breath\/smell\/odor\/flavor"],"pinyin":["qi4 xi1"],"word":"气息"},{"definition":["to pervade\/to fill the air\/diffuse\/everywhere present\/about to inundate (water)\/permeated by (smoke)\/filled with (dust)\/to saturate (the air with fog, smoke etc)","variant of 彌漫|弥漫[mi2 man4]"],"pinyin":["mi2 man4","mi2 man4"],"word":"弥漫"},{"definition":["to assail the nostrils (of fragrance and odors)"],"pinyin":["pu1 bi2"],"word":"扑鼻"},{"definition":["(of a perfume or a foul odor) permeating the whole place\/(of grease etc) dripping everywhere\/flowing all over the place"],"pinyin":["si4 yi4"],"word":"四溢"},{"definition":["to distribute\/to emit\/to issue"],"pinyin":["san4 fa1"],"word":"散发"},{"definition":["rich\/strong\/heavy (fragrance)\/dense\/full-bodied\/intense"],"pinyin":["nong2 yu4"],"word":"浓郁"},{"definition":["heat wave"],"pinyin":["re4 lang4"],"word":"热浪"},{"definition":["arising involuntarily (idiom); spontaneous\/to spring up unbidden (of emotion)"],"pinyin":["you2 ran2 er2 sheng1"],"word":"油然而生"},{"definition":["to have guts\/to have courage\/to be brave"],"pinyin":["you3 zhong3"],"word":"有种"},{"definition":["pressing\/threatening"],"pinyin":["bi1 ren2"],"word":"逼人"},{"definition":["to smell\/to sniff sth out\/to perceive by smelling"],"pinyin":["wen2 dao4"],"word":"闻到"},{"definition":["to penetrate deeply into the heart (idiom)\/to gladden the heart\/to refresh the mind"],"pinyin":["qin4 ren2 xin1 pi2"],"word":"沁人心脾"},{"definition":["biting cold"],"pinyin":["lin3 lie4"],"word":"凛冽"}]}