{"definition":["to dispatch sb to do sth\/to make sb leave\/to pass (the time)\/(old) to make arrangements\/(old) to bestow (alms etc)"],"pinyin":["da3 fa5"],"traditional":["打發"],"rank":15665.0,"normalized_rank":0.21917367397478768,"fraction":0.000003820526450230489,"cumulative_fraction":0.9616846726003888,"word":"打发","characters":[{"definition":["to beat\/to strike\/to hit\/to break\/to type\/to mix up\/to build\/to fight\/to fetch\/to make\/to tie up\/to issue\/to shoot\/to calculate\/to play (a game)\/since\/from","dozen (loanword)"],"pinyin":["da3","da2"],"word":"打"},{"definition":["hair\/Taiwan pr. [fa3]","to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa4","fa1"],"word":"发"}],"containing_words":[{"definition":["to pass the time"],"pinyin":["da3 fa1 shi2 jian1"],"word":"打发时间"}],"sentences":[{"english":"Perhaps they spent time in the yard.","chinese":"也许他们在院子里打发时光。"},{"english":"I sent Tychicus to Ephesus.","chinese":"12我已经打发推基古往以弗所去。"},{"english":"That's good. I was just wondering about how to spend my free time on weekends.","chinese":"太好了，我正在想怎么打发我的周末时间呢？"},{"english":"17From Miletus, Paul sent to Ephesus for the elders of the church.","chinese":"保罗从米利都打发人往以弗所去，请教会的长老来。"},{"english":"They sent therefore fifty men； and they sought three days， but found him not.","chinese":"他们便打发五十人去，寻梢了三天，也没有找着。"},{"english":"I entertained myself flicking wheat-based projectiles at the cat.","chinese":"我把小面团当成子弹弹向那只猫，以此来打发时间。"},{"english":"The rest of the men he sent back to their homes.","chinese":"其馀的人扫罗都打发各回各家去了。"},{"english":"But experience had taught him not to proffer academic work as an excuse.","chinese":"不过经验告诉他，文化课作业打发不了爸爸的要求。"},{"english":"Come, I am going to send you to them.","chinese":"你来，我要打发你往他们那里去。"},{"english":"And he traveled by train. And so to pass the time, he would play solitaire.","chinese":"他坐火车旅行，为了打发时间，他会玩纸牌。"},{"english":"I have more squires than I know what to do with.","chinese":"我的侍从多的不知道该打发他们去干什么。"},{"english":"It's called Cubix! It's stupid and pointless but good for killing time.","chinese":"这个游戏很无聊也没有什么意义，但值得打发时间。"},{"english":"These are the names of the men which Moses sent to spy out the land.","chinese":"这就是摩西所打发，窥探那地之人的名字。"},{"english":"Check it out — it can help your otherwise dreary workday go a little faster.","chinese":"试一下这个网站，它能帮助你快一点打发工作时间。"},{"english":"He lounged away the whole night in the bar.","chinese":"他在酒吧打发了整个晚上。"},{"english":"Romance is every time I eat a bowl of left Douer you will help me to pass out.","chinese":"浪漫是我每次吃饭留下的碗兜儿你都会帮我打发掉。"}],"related":[{"definition":["to mix\/to blend\/(fig.) to spoil\/to mess up things\/to run around with (sb)\/to get involved with\/to mix (with other people)"],"pinyin":["jiao3 huo5"],"word":"搅和"},{"definition":["to while the time away\/amusement\/pastime\/recreation\/to make sport of"],"pinyin":["xiao1 qian3"],"word":"消遣"},{"definition":["to bribe\/to get (luggage) ready\/to put in order\/to organize things\/(baseball) RBI (run batted in)"],"pinyin":["da3 dian5"],"word":"打点"},{"definition":["to disturb\/to annoy\/to mix\/to stir"],"pinyin":["jiao3"],"word":"搅"},{"definition":["to chat\/idle talk"],"pinyin":["xian2 che3"],"word":"闲扯"},{"definition":["to pass on a story\/to communicate a message"],"pinyin":["chuan2 hua4"],"word":"传话"},{"definition":["to overtake\/to catch up with\/to hurry\/to rush\/to try to catch (the bus etc)\/to drive (cattle etc) forward\/to drive (sb) away\/to avail oneself of (an opportunity)\/until"],"pinyin":["gan3"],"word":"赶"},{"definition":["to send sb away (with an excuse)"],"pinyin":["zhi1 zou3"],"word":"支走"},{"definition":["to kill time"],"pinyin":["xiao1 mo2 shi2 jian1"],"word":"消磨时间"},{"definition":["thus\/in this way\/like this"],"pinyin":["zhe4 me5 zhe5"],"word":"这么着"},{"definition":["bored\/boring\/senseless"],"pinyin":["wu2 liao2"],"word":"无聊"},{"definition":["to have nothing to do\/to idle one's time away (idiom)"],"pinyin":["wu2 suo3 shi4 shi4"],"word":"无所事事"},{"definition":["to be chattersome\/to talk on and on without stopping\/to nag"],"pinyin":["dao1 lao5"],"word":"叨唠"},{"definition":["to chat\/casual conversation"],"pinyin":["xian2 liao2"],"word":"闲聊"},{"definition":["to put in order\/to tidy up\/to pack\/to repair\/(coll.) to sort sb out\/to fix sb"],"pinyin":["shou1 shi5"],"word":"收拾"},{"definition":["to send (sb) away\/to change the subject\/to open (an umbrella etc)"],"pinyin":["zhi1 kai1"],"word":"支开"}]}