{"definition":["to merge\/to integrate\/to become as one\/to unify together"],"pinyin":["da3 cheng2 yi1 pian4"],"traditional":["打成一片"],"rank":28334.0,"normalized_rank":0.3964294209002001,"fraction":0.0000010922046041809765,"cumulative_fraction":0.9885515484172928,"word":"打成一片","characters":[{"definition":["to beat\/to strike\/to hit\/to break\/to type\/to mix up\/to build\/to fight\/to fetch\/to make\/to tie up\/to issue\/to shoot\/to calculate\/to play (a game)\/since\/from","dozen (loanword)"],"pinyin":["da3","da2"],"word":"打"},{"definition":["to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth","surname Cheng"],"pinyin":["cheng2","Cheng2"],"word":"成"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["thin piece\/flake\/a slice\/film\/TV play\/to slice\/to carve thin\/partial\/incomplete\/one-sided\/classifier for slices, tablets, tract of land, area of water\/classifier for CDs, movies, DVDs etc\/used with numeral 一[yi1]: classifier for scenario, scene, feeling, atmosphere, sound etc\/Kangxi radical 91","disk\/sheet"],"pinyin":["pian4","pian1"],"word":"片"}],"containing_words":[],"sentences":[{"english":"Tap into your network of friends and acquaintances.","chinese":"和你的朋友以及熟人打成一片。"},{"english":"Do not be picky in the social intercourse . Try to make friends with all kinds of people.","chinese":"交际不要挑肥拣瘦，应该和各种各样的人打成一片。"},{"english":"Try to make friends with all kindsof people.","chinese":"交际不要挑肥拣瘦，应该和各种各样的人打成一片。"},{"english":"Don't pick and communicate, you should talk and play with all.","chinese":"交际不要挑肥拣瘦，应该和各种各样的人打成一片。"},{"english":"The fifth principle is to engage with local communities and communicate your values.","chinese":"第五项原则是与当地社区打成一片，传播你的价值观。"},{"english":"He is a kindly teacher, mucking in with his students.","chinese":"他是一位和蔼可亲的教师，能与学生们打成一片。"},{"english":"Mr Wen has always delighted in an officially fostered man-of-the-people image.","chinese":"温家宝一直喜欢塑造和人民打成一片的形象。"},{"english":"I liked Fromm and identified with him.","chinese":"我喜欢弗罗姆，和他打成一片。"},{"english":"A cadre must become one with the masses.","chinese":"干部必须和群众打成一片。"},{"english":"Intellectuals should identify with the workers, peasants and soldiers.","chinese":"知识分子应该和工农兵打成一片。"}],"related":[{"definition":["to get familiar with"],"pinyin":["hun4 shou2"],"word":"混熟"},{"definition":["familiar\/close"],"pinyin":["shu2 luo4"],"word":"熟络"},{"definition":["amiable\/easy-going"],"pinyin":["sui2 he2"],"word":"随和"},{"definition":["to talk cheerfully and wittily\/to joke together"],"pinyin":["tan2 xiao4 feng1 sheng1"],"word":"谈笑风生"},{"definition":["to be in contact (with sb)\/to associate\/to interact\/to get along (well, poorly)"],"pinyin":["xiang1 chu3"],"word":"相处"},{"definition":["harmonious\/friendly relations\/on good terms with one another"],"pinyin":["rong2 qia4"],"word":"融洽"},{"definition":["amiable and approachable (idiom); easy-going\/modest and unassuming\/(of writing) plain and simple\/easy to understand"],"pinyin":["ping2 yi4 jin4 ren2"],"word":"平易近人"},{"definition":["to make friends\/(dialect) to start an affair with sb"],"pinyin":["jiao1 peng2 you5"],"word":"交朋友"},{"definition":["to come into contact with\/to have dealings"],"pinyin":["da3 jiao1 dao4"],"word":"打交道"},{"definition":["to worm one's way into being friends with sb (usually derogatory)"],"pinyin":["tao4 jin4 hu1"],"word":"套近乎"},{"definition":["to be able to talk to\/to get along with\/to be congenial"],"pinyin":["tan2 de5 lai2"],"word":"谈得来"},{"definition":["privately\/secretly\/confidentially"],"pinyin":["si1 di3 xia5"],"word":"私底下"},{"definition":["talking and laughing\/to jest\/cheerful and lively"],"pinyin":["you3 shuo1 you3 xiao4"],"word":"有说有笑"},{"definition":["to be well acquainted with\/to know well"],"pinyin":["shu2 shi5"],"word":"熟识"},{"definition":["to carry on intimately with (idiom); ardent relationship (esp. between lovers)\/billing and cooing"],"pinyin":["da3 de5 huo3 re4"],"word":"打得火热"},{"definition":["intimate\/friendly\/warm\/active\/lively (interaction, participation etc)"],"pinyin":["re4 luo4"],"word":"热络"}]}