{"definition":["lit. when one beats a dog, one must answer to its master (idiom)\/fig. before punishing sb, one should consider how that would affect others associated with him"],"pinyin":["da3 gou3 hai2 dei3 kan4 zhu3 ren2"],"traditional":["打狗還得看主人"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"打狗还得看主人","characters":[{"definition":["to beat\/to strike\/to hit\/to break\/to type\/to mix up\/to build\/to fight\/to fetch\/to make\/to tie up\/to issue\/to shoot\/to calculate\/to play (a game)\/since\/from","dozen (loanword)"],"pinyin":["da3","da2"],"word":"打"},{"definition":["dog\/CL:隻|只[zhi1],條|条[tiao2]"],"pinyin":["gou3"],"word":"狗"},{"definition":["surname Huan","to pay back\/to return","still\/still in progress\/still more\/yet\/even more\/in addition\/fairly\/passably (good)\/as early as\/even\/also\/else"],"pinyin":["Huan2","huan2","hai2"],"word":"还"},{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)","to look after\/to take care of\/to watch\/to guard"],"pinyin":["kan4","kan1"],"word":"看"},{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"}],"containing_words":[],"sentences":[],"related":[{"definition":["lit. not for the monk's sake but for the Buddha's sake (idiom)\/fig. (to do sth for sb) out of deference to sb else"],"pinyin":["bu4 kan4 seng1 mian4 kan4 fo2 mian4"],"word":"不看僧面看佛面"},{"definition":["a dog threatens based on master's power (idiom); to use one's position to bully others"],"pinyin":["gou3 zhang4 ren2 shi4"],"word":"狗仗人势"},{"definition":["lit. strong dragon cannot repress a snake (idiom); fig. a local gangster who is above the law"],"pinyin":["qiang2 long2 bu4 ya1 di4 tou2 she2"],"word":"强龙不压地头蛇"},{"definition":["extremely daring (idiom)\/foolhardy"],"pinyin":["gou3 dan3 bao1 tian1"],"word":"狗胆包天"},{"definition":["It's all exaggeration, you don't need to take it seriously\/a fuss about nothing\/nothing to write home about"],"pinyin":["sha1 ren2 bu4 guo4 tou2 dian3 di4"],"word":"杀人不过头点地"},{"definition":["lit. to kill a chicken in front of a monkey; fig. to make an example of sb (by punishment) to frighten others"],"pinyin":["sha1 ji1 gei3 hou2 kan4"],"word":"杀鸡给猴看"},{"definition":["to disrespect one's superiors\/to offend one's elders"],"pinyin":["yi3 xia4 fan4 shang4"],"word":"以下犯上"},{"definition":["dog's leg\/fig. one who follows a villain\/henchman\/hired thug"],"pinyin":["gou3 tui3 zi5"],"word":"狗腿子"},{"definition":["fail to appreciate sb's kindness\/not know how to appreciate favors"],"pinyin":["bu4 shi2 tai2 ju3"],"word":"不识抬举"},{"definition":["unable to tell good from bad (idiom)\/undiscriminating"],"pinyin":["bu4 shi2 hao3 dai3"],"word":"不识好歹"},{"definition":["If you want to condemn sb, don't worry about the pretext (idiom, from Zuozhuan 左傳|左传); one can always trump up a charge against sb\/Give a dog a bad name, then hang him."],"pinyin":["yu4 jia1 zhi1 zui4 , he2 huan4 wu2 ci2"],"word":"欲加之罪，何患无辞"},{"definition":["to bully intolerably (idiom)"],"pinyin":["qi1 ren2 tai4 shen4"],"word":"欺人太甚"},{"definition":["to wave a chicken feather as a token of authority (idiom); to assume unwarranted authority on the basis of some pretext"],"pinyin":["na2 zhe5 ji1 mao2 dang4 ling4 jian4"],"word":"拿着鸡毛当令箭"},{"definition":["unable to differentiate good from bad (idiom)\/not to know what's good for one\/unable to recognize others' good intentions"],"pinyin":["bu4 zhi1 hao3 dai3"],"word":"不知好歹"},{"definition":["lit. to climb all over sb\/fig. to take advantage of sb's weakness"],"pinyin":["deng1 bi2 zi5 shang4 lian3"],"word":"蹬鼻子上脸"},{"definition":["the elbow turns the wrong way\/to favor an outsider instead of someone on one's own side (idiom)"],"pinyin":["ge1 bo5 zhou3 chao2 wai4 guai3"],"word":"胳膊肘朝外拐"}]}