{"definition":["to take care of\/to sort out\/to manage\/to put in order"],"pinyin":["da3 li3"],"traditional":["打理"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"打理","characters":[{"definition":["to beat\/to strike\/to hit\/to break\/to type\/to mix up\/to build\/to fight\/to fetch\/to make\/to tie up\/to issue\/to shoot\/to calculate\/to play (a game)\/since\/from","dozen (loanword)"],"pinyin":["da3","da2"],"word":"打"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"}],"containing_words":[],"sentences":[{"english":"But everyone can tell cheap or poorly cared-for shoes.","chinese":"但是每个人都能看出廉价或者不常打理的鞋子来。"},{"english":"She's also e-mailing me daily to-do lists.","chinese":"她还把每日需打理事务的清单电邮给我。"},{"english":"XiaoMin cannot go back to the home for my parents with small-business hua.","chinese":"小敏无法回到了老家华欣帮父母打理小本生意。"},{"english":"To help you on your way to becoming an early riser try getting things ready the night before.","chinese":"在前天晚上就把事情打理好有助你成为早起者。"},{"english":"For yardwork, hire a teenager to do it for a month.","chinese":"至于庭院打理，这个月请一个年轻人来做。"},{"english":"Upon use, hair is softer, shinier and more manageable.","chinese":"使用后头发变得柔软，闪亮易于打理。"},{"english":"The Qin Dynasty isn't dealing with that hero, merely turns a head to ask Tang Ao.","chinese":"秦朝不在打理那个杨杰，而是转头问着唐傲。"},{"english":"when you're getting ready to hit your pick-up spots, definitely take a shower but DON'T SHAMPOO YOUR HAIR.","chinese":"当你准备要打理，绝对要洗澡，但不要洗头发。"},{"english":"Its hard to imagine a time when people weren t concerned with taking care of their appearance and their bodies.","chinese":"很难想象一个人们不在乎打理外表和身体清洁的时代。"},{"english":"Organize your living space and working space.","chinese":"打理你的生活空间和工作空间。"},{"english":"Have you ever worked with Asian hair?","chinese":"你打理过亚洲人的头发吗？"},{"english":"Jim gardened at the homes of friends on weekends.","chinese":"吉姆周末帮忙打理朋友家的花园。"},{"english":"Self-restraint and a little good grooming is.","chinese":"自我克制和打理一下精神面貌才是。"},{"english":"Uh, Also, But now I really do not have energy to take care of things that.","chinese":"呵，想想也是，可我现在真的没有精力打理那些东西。"},{"english":"Goi dropped out of high school to help his father at the store.","chinese":"魏成辉在念高中时辍学，帮助父亲打理店铺。"},{"english":"Old gramps will even act as your assistant.","chinese":"老爷爷将会作为你的助手打理农场。"}],"related":[{"definition":["everything clear and orderly (idiom); neat and tidy"],"pinyin":["jing3 jing3 you3 tiao2"],"word":"井井有条"},{"definition":["to look after\/to attend to\/to have in care"],"pinyin":["zhao4 kan4"],"word":"照看"},{"definition":["to clean\/to sweep"],"pinyin":["da3 sao3"],"word":"打扫"},{"definition":["to manage\/to handle"],"pinyin":["cao1 chi5"],"word":"操持"},{"definition":["to tend\/to take care of sb"],"pinyin":["zhao4 liao4"],"word":"照料"},{"definition":["to prune\/to trim"],"pinyin":["xiu1 jian3"],"word":"修剪"},{"definition":["to clear up\/to tidy up\/to pick up\/to repair"],"pinyin":["shi2 duo5"],"word":"拾掇"},{"definition":["to look after\/to tend (one's crops, garden, livestock, pets etc)\/to repair"],"pinyin":["shi4 nong4"],"word":"侍弄"},{"definition":["to bribe\/to get (luggage) ready\/to put in order\/to organize things\/(baseball) RBI (run batted in)"],"pinyin":["da3 dian5"],"word":"打点"},{"definition":["to worry about"],"pinyin":["cao1 xin1"],"word":"操心"},{"definition":["to look after\/to provide for"],"pinyin":["zhao4 guan3"],"word":"照管"},{"definition":["to take care of\/to show consideration\/to attend to\/to look after"],"pinyin":["zhao4 gu5"],"word":"照顾"},{"definition":["to put in order\/to tidy up\/to pack\/to repair\/(coll.) to sort sb out\/to fix sb"],"pinyin":["shou1 shi5"],"word":"收拾"},{"definition":["to do sth oneself"],"pinyin":["qin1 li4 qin1 wei2"],"word":"亲力亲为"},{"definition":["various jobs\/low-grade work"],"pinyin":["za2 wu4"],"word":"杂务"},{"definition":["household duties\/housework"],"pinyin":["jia1 wu4"],"word":"家务"}]}