{"definition":["to reverse\/to turn around (an undesirable situation)\/(mechanics) torsion"],"pinyin":["niu3 zhuan3"],"traditional":["扭轉"],"rank":7251.0,"normalized_rank":0.10145089754172903,"fraction":0.000013927433423643225,"cumulative_fraction":0.9001162128325368,"word":"扭转","characters":[{"definition":["to turn\/to twist\/to wring\/to sprain\/to swing one's hips"],"pinyin":["niu3"],"word":"扭"},{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan4","zhuan3"],"word":"转"}],"containing_words":[{"definition":["lit. to upend heaven and earth (idiom)\/fig. to change the course of events\/to turn things around"],"pinyin":["niu3 zhuan3 qian2 kun1"],"word":"扭转乾坤"}],"sentences":[{"english":"Airlift tipped the balance of the sieges .","chinese":"空运扭转了围攻战的战局。"},{"english":"Twists can help detoxify the internal organs and lymphatic system.","chinese":"扭转有助于提高内部器官和淋巴系统的解毒功能。"},{"english":"To reverse the \" decline \" in sales of Sable, and Mercury are also great to cut costs.","chinese":"扭转销售下降的紫貂，水星也主要成本削减。"},{"english":"We put forward the suitable moments for rotation of human's teeth.","chinese":"提出了人尖牙和前磨牙扭转移动时的适宜力矩。"},{"english":"Our dream is to change this bad image.","chinese":"我们的梦想是扭转这种不良印象。"},{"english":"Other very important, but more complicated, deformations are bending and torsion.","chinese":"其他非常重要，但更为复杂的是弯曲形变和扭转形变。"},{"english":"Neither have closed-door meetings or trying out rookie hurlers.","chinese":"开密室会议及派菜鸟投手上场也没有扭转颓势。"},{"english":"The twisting version will stimulate the Gall Bladder along the side of the torso.","chinese":"扭转变式会刺激沿着上身旁侧的胆经。"},{"english":"A challenge is nothing but an opportunity turned upside down.","chinese":"挑战，无他，仅是一次扭转乾坤的机会。"},{"english":"But the easy money also brings a slew of unexpected problems.","chinese":"但这容易赚入的钱也带给意外问题的扭转。"},{"english":"But Mr. Obama said the current trend is reversible.","chinese":"但是奥巴马说，目前的发展趋势尚能扭转。"},{"english":"These valves will also sustain damage when excessively torqued.","chinese":"当过分扭转时，这些阀门还是会受到损伤。"},{"english":"Have him shift his lower body into a half-kneeling position, entering you from behind.","chinese":"让他扭转他的下体成半跪姿式，从后面插入。"},{"english":"This is an example of cecal volvulus .","chinese":"此图所示的为盲肠扭转。"},{"english":"Could it reverse a two-decade decline in economic and social progress?","chinese":"它是否能够扭转历时二十年的经济和社会倒退？"},{"english":"Eg. He says his friend is confident in turning the table.","chinese":"他说他的朋友很有信心扭转局面。"}],"related":[{"definition":["to change\/to alter\/to transform"],"pinyin":["gai3 bian4"],"word":"改变"},{"definition":["aspect\/phase\/situation"],"pinyin":["ju2 mian4"],"word":"局面"},{"definition":["to break away from\/to cast off (old ideas etc)\/to get rid of\/to break away (from)\/to break out (of)\/to free oneself from\/to extricate oneself"],"pinyin":["bai3 tuo1"],"word":"摆脱"},{"definition":["to roll\/to turn over\/to invert\/to flip"],"pinyin":["fan1 zhuan3"],"word":"翻转"},{"definition":["to pull back\/to shrink\/to contract\/(physiology) systole"],"pinyin":["shou1 suo1"],"word":"收缩"},{"definition":["to change\/to transform\/shift\/transformation\/CL:個|个[ge4]"],"pinyin":["zhuan3 bian4"],"word":"转变"},{"definition":["change of appearance\/to revise one's point of view"],"pinyin":["gai3 guan1"],"word":"改观"},{"definition":["decline (in fortune)"],"pinyin":["tui2 shi4"],"word":"颓势"},{"definition":["stagnation\/at a standstill\/bogged down"],"pinyin":["ting2 zhi4"],"word":"停滞"},{"definition":["to improve\/to take a turn for the better\/improvement"],"pinyin":["hao3 zhuan3"],"word":"好转"},{"definition":["to separate oneself from\/to break away from\/diastasis (medicine)\/abscission\/abjunction (botany)"],"pinyin":["tuo1 li2"],"word":"脱离"},{"definition":["to slow down\/to retard"],"pinyin":["jian3 huan3"],"word":"减缓"},{"definition":["situation\/state (of affairs)"],"pinyin":["ju2 shi4"],"word":"局势"},{"definition":["by a wide margin\/substantial"],"pinyin":["da4 fu2 du4"],"word":"大幅度"},{"definition":["variant of 衝擊|冲击[chong1 ji1]","to attack\/to batter\/(of waves) to pound against\/shock\/impact"],"pinyin":["chong1 ji1","chong1 ji1"],"word":"冲击"},{"definition":["to counteract\/to cancel out\/to offset"],"pinyin":["di3 xiao1"],"word":"抵消"}]}