{"definition":["to set sth upright or straight\/to promote an employee from part-time to full-time (or from deputy to principal)\/(old) to raise from concubine to wife status"],"pinyin":["fu2 zheng4"],"traditional":["扶正"],"rank":28152.0,"normalized_rank":0.3938830047710325,"fraction":0.0000011111816956730276,"cumulative_fraction":0.9883510501904847,"word":"扶正","characters":[{"definition":["to support with the hand\/to help sb up\/to support oneself by holding onto something\/to help"],"pinyin":["fu2"],"word":"扶"},{"definition":["first month of the lunar year","straight\/upright\/proper\/main\/principal\/to correct\/to rectify\/exactly\/just (at that time)\/right (in that place)\/(math.) positive"],"pinyin":["zheng1","zheng4"],"word":"正"}],"containing_words":[{"definition":["to uphold good and suppress evil (idiom)"],"pinyin":["fu2 zheng4 ya1 xie2"],"word":"扶正压邪"}],"sentences":[{"english":"Re-righting the walkie-talkie, you can cancel the alarm.","chinese":"把对讲机重新扶正，即可取消报警。"},{"english":"Through the above, Chinese medicines has proven effective role in NASH rats.","chinese":"证明攻毒扶正法治疗NASH大鼠有切实的作用。"},{"english":"The young people have a kind strength which can strengthen body resistance and eliminating evil in future.","chinese":"年轻人身上有一种在未来能够扶正祛邪的力量。"},{"english":"Where to connect the centralizer.","chinese":"扶正器下在什么地方？"},{"english":"These indicate that this herb has the effects of increasing organism immunity and supporting healthy energy.","chinese":"说明该药具有提高机体免疫力，扶正固本的作用。"},{"english":"Objective To establish the quality standards for the Zhenqi Fuzheng Oral Liquid.","chinese":"目的制订贞芪扶正口服液质量标准。"},{"english":"Casing centralizer with double bow spring blade is modified from single bow.","chinese":"使用最普遍的是单弓形弹簧片套管扶正器。"},{"english":"Enriching consumptive disease, benefiting pneuma, protect lung and tonifying kidney, support healthy energy.","chinese":"补虚损，益精气，保肺益肾，扶正固本。"},{"english":"I smiled, small SanNeng centralizer, the devil angel's wings.","chinese":"我笑了，小三能扶正，魔鬼都能长出天使的翅膀。"},{"english":"Many nations have issued the norms of computing centralizer intervals.","chinese":"很多国家都颁布了套管扶正器间距计算规范。"},{"english":"That shelf isn't square on the wall; can you straighten it?","chinese":"墙上的那个搁架不平你能把它扶正吗？"},{"english":"The design of centralizer assembly is the basic and key job for directional drilling.","chinese":"扶正器组合设计是钻定向井基本而关键的工作。"},{"english":"Objective To study the effect of Zhongyao Fuzheng Mixture(ZFM)on cytokines in tumor model mice.","chinese":"目的研究中药扶正合剂对肿瘤模型细胞因子的影响。"},{"english":"Dismantle square group in order to strengthen body resistance and eliminating evil each and concurrently bitter cold that construct add sweet warm curative effect best group.","chinese":"各拆方组中以扶正祛邪兼施的苦寒加甘温组疗效最佳。"},{"english":"Hold it straight while I put in the nail.","chinese":"请把画扶正，我钉钉子。"},{"english":"Now that the Hunley is upright once again, perhaps the mystery will be solved.","chinese":"现在亨利号船体被扶正，谜团可能将被揭开。"}],"related":[{"definition":["seat of honor\/person in a high-ranking position\/to be promoted to a more senior role\/(genetics) epistatic"],"pinyin":["shang4 wei4"],"word":"上位"},{"definition":["to replace\/to take over (a position or post)"],"pinyin":["jie1 ti4"],"word":"接替"},{"definition":["to abdicate\/to yield"],"pinyin":["rang4 wei4"],"word":"让位"},{"definition":["to unblock\/to dredge\/to clear the way\/to get things flowing\/to facilitate\/to mediate\/to lobby\/to explicate (a text)"],"pinyin":["shu1 tong1"],"word":"疏通"},{"definition":["to put in an important position"],"pinyin":["zhong4 yong4"],"word":"重用"},{"definition":["to promote to a higher job\/to select for promotion"],"pinyin":["ti2 ba2"],"word":"提拔"},{"definition":["to support with the hand\/to help sb up\/to support oneself by holding onto something\/to help"],"pinyin":["fu2"],"word":"扶"},{"definition":["to take over (from those working the previous shift)\/to take over (in a leadership role etc)\/to succeed sb"],"pinyin":["jie1 ban1"],"word":"接班"},{"definition":["to exorcise\/to drive away evil spirits"],"pinyin":["qu1 xie2"],"word":"祛邪"},{"definition":["(TCM) to rectify 氣|气[qi4]"],"pinyin":["li3 qi4"],"word":"理气"},{"definition":["to take over (as minister, manager etc)"],"pinyin":["jie1 ren4"],"word":"接任"},{"definition":["to press down\/to crush down\/to restrain (anger)\/to keep down (voice)"],"pinyin":["ya1 zhu4"],"word":"压住"},{"definition":["place\/seat"],"pinyin":["wei4 zi5"],"word":"位子"},{"definition":["to preserve\/to save"],"pinyin":["bao3 zhu4"],"word":"保住"},{"definition":["to protect"],"pinyin":["hu4"],"word":"护"},{"definition":["to set right\/to correct"],"pinyin":["bo1 zheng4"],"word":"拨正"}]}