{"definition":["to reply officially to a subordinate"],"pinyin":["pi1 fu4"],"traditional":["批復"],"rank":7455.0,"normalized_rank":0.1043051222139829,"fraction":0.000013376513859866291,"cumulative_fraction":0.9029031692200123,"word":"批复","characters":[{"definition":["to ascertain\/to act on\/to criticize\/to pass on\/classifier for batches, lots, military flights\/tier (for the ranking of universities and colleges)"],"pinyin":["pi1"],"word":"批"},{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out","to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4","fu4","fu4"],"word":"复"}],"containing_words":[],"sentences":[{"english":"The State Council has officially approved the Qianhai Bay Bonded Port Area in Shenzhen recently.","chinese":"国务院正式批复同意设立深圳前海湾保税港区。"},{"english":"The final construction scale is subject to the ratified reply of Development and Reform Bureau of Baoan District.","chinese":"最终建设规模以宝安区发展和改革局立项批复为准。"},{"english":"After I saw a report in the newspaper last year, I started paying attention to the approval of the Xiao Nanhai hydroelectric power station.","chinese":"去年看了报纸的报道后，关注小南海水电站的批复。"},{"english":"A fatuous and self-indulgent ruler wouldn't spend much time reading and replying to memorials.","chinese":"一个昏君是不会用多少时间来批复奏疏的。"},{"english":"Coastal Tourism Master Plan has received a formal city approval.","chinese":"滨海旅游区总体规划日前获得市政府正式批复。"},{"english":"Audit all samples of merchandiser dept and give comment.","chinese":"审核跟单部所有批复的样衣，并提出有效建议。"},{"english":"After-tax profits for 2008 are distributed pursuant to the written reply of the Ministry of Finance.","chinese":"根据财政部批复，对2008年税后利润进行分配。"},{"english":"Stanford University shall remit the principal within 6 months since the date of the issuance of this Reply.","chinese":"斯坦福大学应在本批复之日起6个月内汇入本金。"},{"english":"Prepared and issued \"notification of withdrawal application\" to student.","chinese":"已准备并已把《学生退学申请批复信》发给学生。"}],"related":[{"definition":["to authorize\/to investigate then ratify"],"pinyin":["he2 zhun3"],"word":"核准"},{"definition":["to approve\/to ratify"],"pinyin":["pi1 zhun3"],"word":"批准"},{"definition":["to report for criticism\/to submit for approval to higher authority"],"pinyin":["bao4 pi1"],"word":"报批"},{"definition":["to examine and approve\/to endorse"],"pinyin":["shen3 pi1"],"word":"审批"},{"definition":["official written ruling in response to a submission\/official approval in writing"],"pinyin":["pi1 wen2"],"word":"批文"},{"definition":["State Council (PRC)\/State Department (USA)"],"pinyin":["Guo2 wu4 yuan4"],"word":"国务院"},{"definition":["to report, requesting approval\/written request for instructions"],"pinyin":["bao4 qing3"],"word":"报请"},{"definition":["to report to one's superiors\/to appear in the news\/to reply to a letter"],"pinyin":["shang4 bao4"],"word":"上报"},{"definition":["to issue (a memorandum etc) to lower levels\/to distribute (e.g. disaster relief to victims)"],"pinyin":["xia4 fa1"],"word":"下发"},{"definition":["abbr. for 國家發展和改革委員會|国家发展和改革委员会, PRC National Development and Reform Commission (NDRC), formed in 2003"],"pinyin":["Fa1 gai3 wei3"],"word":"发改委"},{"definition":["to write comments on a report submitted by a subordinate\/written comments from a superior"],"pinyin":["pi1 shi4"],"word":"批示"},{"definition":["to launch a project"],"pinyin":["li4 xiang4"],"word":"立项"},{"definition":["to prepare to build sth"],"pinyin":["chou2 jian4"],"word":"筹建"},{"definition":["to approve and forward\/to endorse\/stamp \"approved for distribution\""],"pinyin":["pi1 zhuan3"],"word":"批转"},{"definition":["deliberation\/pondering\/due consideration"],"pinyin":["shen3 yi4"],"word":"审议"},{"definition":["to draw up\/to draft\/to formulate"],"pinyin":["ni3 ding4"],"word":"拟定"}]}