{"definition":["to be unable to find"],"pinyin":["zhao3 bu5 zhao2"],"traditional":["找不著"],"rank":22348.0,"normalized_rank":0.3126775145859276,"fraction":0.000001898147082085704,"cumulative_fraction":0.9798380138038336,"word":"找不着","characters":[{"definition":["to try to find\/to look for\/to call on sb\/to find\/to seek\/to return\/to give change"],"pinyin":["zhao3"],"word":"找"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"}],"containing_words":[{"definition":["to be confused and disoriented"],"pinyin":["zhao3 bu5 zhao2 bei3"],"word":"找不着北"}],"sentences":[{"english":"He looked for a way out, but could not find one, going instead deeper and deeper into the woods.","chinese":"他想找一条出去的路，却再也找不着，反而越迷越深。"},{"english":"It goes without saying , no one here in our place has seen the new book.","chinese":"没有见到新教材就参加培训，有时会有点找不着北。"},{"english":"At first listen, seem to have very reasonable, everyone will find north.","chinese":"乍一听，似乎都很有道理，大家就找不着北了。"},{"english":"Tag: Are you kidding me?! With a cute butt like this, I'd find work.","chinese":"别逗了，有这么帅的屁股，我还愁找不着新工作？"},{"english":"I’ll draw a map for you in case you can’t find our house.","chinese":"我还是画张地图给你，以免你找不着我们家。"},{"english":"It's a colloquialism in north China.","chinese":"这找不着北啊是口语里的一种说法。"},{"english":"I know, but it's hard to fit a piano in a foxhole.","chinese":"我知道，但在这散兵营，你压根找不着钢琴来合奏。"},{"english":"I can't find my baggage.","chinese":"我找不着非主流闪图行李了。"},{"english":"We need a new strategy that will make our enemies scratch their heads.","chinese":"我门需要一个让我门的敌人找不着北的策略。"},{"english":"Quite many painters, once getting involved in the market, would get lost.","chinese":"不少画家一旦介入市场自己就找不着北。"},{"english":"I left my bag with you,but I can't find the tag anywhere.","chinese":"我把袋子放在你这儿了可我找不着取物牌。"},{"english":"If I go and tell Ahab and he doesn't find you, he will kill me.","chinese":"这样，我去告诉亚哈，他若找不着你，就必杀我。"},{"english":"If you don't find papa and mamma, young 'uns, come back here this evening.","chinese":"小乖乖们，要是你们找不着爹妈，今晚便回到这里来。"}],"related":[]}