{"definition":["to receive\/to accept\/to carry on"],"pinyin":["cheng2 jie1"],"traditional":["承接"],"rank":8400.0,"normalized_rank":0.11752689826927652,"fraction":0.000011043791382612615,"cumulative_fraction":0.9143906347832752,"word":"承接","characters":[{"definition":["to bear\/to carry\/to hold\/to continue\/to undertake\/to take charge\/owing to\/due to\/to receive","surname Cheng\/Cheng (c. 2000 BC), third of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God"],"pinyin":["cheng2","Cheng2"],"word":"承"},{"definition":["to receive\/to answer (the phone)\/to meet or welcome sb\/to connect\/to catch\/to join\/to extend\/to take one's turn on duty\/to take over for sb"],"pinyin":["jie1"],"word":"接"}],"containing_words":[],"sentences":[{"english":"Our factory also carries on researches of all types of non-standard thin-walled metal rolling forming machines.","chinese":"本厂并承接各种非标薄壁金属型材滚压成形机的研制。"},{"english":"The production and marketing to all kinds of chemical fiber fabrics. It also receives various order business.","chinese":"各种化纤面料的生产销售，承接各类定单业务。"},{"english":"What's more, our factorycan process and repair axletrees.","chinese":"另外，本厂还承接各种要求的轴芯加工和维修。"},{"english":"The Company to undertake the design and production of various high-level commemorative gift table.","chinese":"本公司承接设计及生产有纪念性的各种高级礼品表。"},{"english":"He took a job as a carpenter with the task of building a recording studio.","chinese":"于是他承接了修建一个录音棚的木匠活。"},{"english":"The \"YIDE\" sensor is a well-known brand in sensor industry in China.","chinese":"同时我们承接国内外称重传感器的修理及咨询业务。"},{"english":"She took on the mission of exterminating the apostles.","chinese":"她承接了歼灭使徒的使命。"},{"english":"Our factory continues to give the pattern request production when the customer samples provided.","chinese":"我厂承接客户提供实样，图样要求生产。"},{"english":"Besides, we also can offer OEM service, or process non-standard bearing housings according to the customers' samples or drawings.","chinese":"同时，我们还承接各种非标产品的来图来样加工业务。"},{"english":"Our shop accepts advance telephone orders for special Spring Festival goods.","chinese":"本店承接电话预约办年货业务。"},{"english":"I think we’d have more small projects than big ones.","chinese":"我想，我们承接的小项目数量将超过大项目。"},{"english":"We would be using a retreat in commodities and commodity-based currencies to buy at lower levels, \"PineBridge's King said.","chinese":"我们会利用商品市场和商品货币下滑之机，逢低承接。"},{"english":"Most eternities symbolise the continuation of the man's love for his wife.","chinese":"最三不朽象征承接该男子的妻子爱。"},{"english":"To undertake a variety of aluminum products and sample processing.","chinese":"并且承接各种铝制品来样加工。"},{"english":"The factory also plans to undertake non-standard business.","chinese":"本厂同时承接来图非标业务。"},{"english":"And ancient gardens to undertake the planning, design and construction business.","chinese":"并且承接园林古建工程的规划，设计和施工业务。"}],"related":[{"definition":["to assemble\/to gather"],"pinyin":["ji2 ju4"],"word":"集聚"},{"definition":["to join up\/to dock\/a joint (between components)"],"pinyin":["dui4 jie1"],"word":"对接"},{"definition":["leading\/dominant\/prevailing\/to lead\/to direct\/to dominate"],"pinyin":["zhu3 dao3"],"word":"主导"},{"definition":["to rely on\/to depend on\/support"],"pinyin":["yi1 tuo1"],"word":"依托"},{"definition":["body weight\/dimensions"],"pinyin":["ti3 liang4"],"word":"体量"},{"definition":["to prop up\/to support\/strut\/brace"],"pinyin":["zhi1 cheng1"],"word":"支撑"},{"definition":["to contract for an entire project"],"pinyin":["cheng2 lan3"],"word":"承揽"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推动"},{"definition":["main part\/bulk\/body\/subject\/agent"],"pinyin":["zhu3 ti3"],"word":"主体"},{"definition":["to seek investment or funding\/investment promotion"],"pinyin":["zhao1 shang1"],"word":"招商"},{"definition":["regional"],"pinyin":["qu1 yu4 xing4"],"word":"区域性"},{"definition":["to spur\/to provide impetus\/to drive"],"pinyin":["dai4 dong4"],"word":"带动"},{"definition":["fundamentally complete\/basically finished"],"pinyin":["ji1 ben3 wan2 cheng2"],"word":"基本完成"},{"definition":["entity\/substance\/thing that has a material existence (as opposed to a conceptual, virtual or online existence)\/the real thing (as opposed to an image or model of it)"],"pinyin":["shi2 ti3"],"word":"实体"},{"definition":["to entrust\/to trust\/to commission"],"pinyin":["wei3 tuo1"],"word":"委托"},{"definition":["to undertake\/to assume (responsibility etc)"],"pinyin":["cheng2 dan1"],"word":"承担"}]}