{"definition":["to bear the weight\/to sustain"],"pinyin":["cheng2 zai4"],"traditional":["承載"],"rank":7723.0,"normalized_rank":0.10805478992066933,"fraction":0.000012665602817048684,"cumulative_fraction":0.9063883941119532,"word":"承载","characters":[{"definition":["to bear\/to carry\/to hold\/to continue\/to undertake\/to take charge\/owing to\/due to\/to receive","surname Cheng\/Cheng (c. 2000 BC), third of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God"],"pinyin":["cheng2","Cheng2"],"word":"承"},{"definition":["to carry\/to convey\/to load\/to hold\/to fill up\/and\/also\/as well as\/simultaneously","to record in writing\/to carry (i.e. publish in a newspaper etc)\/Taiwan pr. [zai4]\/year"],"pinyin":["zai4","zai3"],"word":"载"}],"containing_words":[{"definition":["carrying capacity"],"pinyin":["cheng2 zai4 li4"],"word":"承载力"},{"definition":["carrying capacity"],"pinyin":["cheng2 zai4 liang4"],"word":"承载量"}],"sentences":[{"english":"The estimated six to seven thousand languages spoken around the globe are the repository of our collective memory and intangible heritage.","chinese":"这六七千种语言承载者我们共同的回忆和非物质遗产。"},{"english":"Shakedown analysis is an important part of the structural design or the research on load-bearing capacity.","chinese":"安定分析是结构设计或承载能力研究的一个重要方面。"},{"english":"A new table of axial capacity parameter of driven pile has been compiled.","chinese":"在此基础上编制了新的打入桩竖向承载力参数表。"},{"english":"Carry me on the waves to the lands Ive never seen.","chinese":"让我承载着波浪去我从未亲见的土地。"},{"english":"He explores and meditates about various meaningful questions which are being carried by human beings.","chinese":"他探求并冥想着作为人类所承载的各种意义问题。"},{"english":"The invention relates to a rubber tube tyre jointly born by a tyre tube and a tyre cover.","chinese":"本发明是一种内外胎联合承载的胶管轮胎。"},{"english":"Influence of loading path on axial strength of circular tubular TX-joints.","chinese":"荷载路径对TX型圆管节点轴向承载力的影响。"},{"english":"Its advantages are simple geometry, radial load carrying capacity and high.","chinese":"它的长处是复杂的几何体，径向负荷承载才能和高。"},{"english":"The magnolia liliflora is ingrained, load bearing marriage structure and family member's care.","chinese":"紫玉兰根深蒂固，承载着婚姻的结构和亲人的关心。"},{"english":"The paper is accompanied with a self-developed software called LandSmart that is for facilitating calculating land demand and land-population sustainability.","chinese":"并自主设计出土地需求量和土地人口承载力预测软件。"},{"english":"The load-carrying capacity of spherical roller bearings is high.","chinese":"承载能力，球面滚子轴承高。"},{"english":"What the artification of abnormal psychology carries is the reflection on culture and the appeal made by freedom of life.","chinese":"变态心理艺术化承载的是文化反思和生命自由的呼吁。"},{"english":"Electric furnace is major equipment of zinc powder reduction smelting.","chinese":"电炉是锌粉工艺进行还原熔炼的承载设备。"},{"english":"Individually the energy available in each of these signals is miniscule.","chinese":"单一来看，这些信号每一种所承载的能量微乎其微。"},{"english":"Chrome steel balls have an excellent surface quality and high load bearing.","chinese":"铬钢球有一个极好的表面质量和高承载。"},{"english":"The bearing capacity of the cold-formed thin-walled steel which was used in combination wall.","chinese":"分析了冷弯薄壁型钢在组合墙体中的承载力。"}],"related":[{"definition":["to assign\/to entrust (a task)\/to give\/to bestow"],"pinyin":["fu4 yu3"],"word":"赋予"},{"definition":["carrier (chemistry)\/vector (epidemiology)\/vehicle or medium"],"pinyin":["zai4 ti3"],"word":"载体"},{"definition":["deposits accumulated over long periods\/fig. valuable experience, accumulated wisdom"],"pinyin":["ji1 dian4"],"word":"积淀"},{"definition":["to remember\/to recall\/memory\/CL:個|个[ge4]"],"pinyin":["ji4 yi4"],"word":"记忆"},{"definition":["to be full of (emotion)\/to brim with (love, tears etc)"],"pinyin":["bao3 han2"],"word":"饱含"},{"definition":["to shoulder (a burden)\/to bear\/to suffer (a disadvantage)"],"pinyin":["jian1 fu4"],"word":"肩负"},{"definition":["to declare publicly\/to make clear"],"pinyin":["zhao1 shi4"],"word":"昭示"},{"definition":["to hold in store\/to contain (untapped reserves etc)"],"pinyin":["yun4 cang2"],"word":"蕴藏"},{"definition":["to pass on (to future generations)\/passed on (from former times)\/a continued tradition\/an inheritance"],"pinyin":["chuan2 cheng2"],"word":"传承"},{"definition":["to waken (to action)\/to rouse (the masses)\/to evoke (attention, recollection etc)"],"pinyin":["huan4 qi3"],"word":"唤起"},{"definition":["mission\/long-term task to which one devotes oneself\/a calling"],"pinyin":["shi3 ming4"],"word":"使命"},{"definition":["changes\/vicissitudes"],"pinyin":["bian4 qian1"],"word":"变迁"},{"definition":["to place (hope, importance etc) on\/to express\/to show\/to give"],"pinyin":["ji4 yu3"],"word":"寄予"},{"definition":["to be witness to\/witness\/evidence"],"pinyin":["jian4 zheng4"],"word":"见证"},{"definition":["to give to\/to provide to\/to bring to\/to take to"],"pinyin":["dai4 gei3"],"word":"带给"},{"definition":["feelings\/mood"],"pinyin":["qing2 huai2"],"word":"情怀"}]}