{"definition":["to plagiarize\/to copy\/to attack the flank or rear of an enemy"],"pinyin":["chao1 xi2"],"traditional":["抄襲"],"rank":10997.0,"normalized_rank":0.15386229765086115,"fraction":0.000007066193005878688,"cumulative_fraction":0.9373258086111694,"word":"抄袭","characters":[{"definition":["to make a copy\/to plagiarize\/to search and seize\/to raid\/to grab\/to go off with\/to take a shortcut\/to make a turning move\/to fold one's arms"],"pinyin":["chao1"],"word":"抄"},{"definition":["to attack\/to inherit\/classifier for suits (esp. of funeral robes)"],"pinyin":["xi2"],"word":"袭"}],"containing_words":[],"sentences":[{"english":"Several methods are taken in US universities to stop students' plagiarizing on line.","chinese":"美国大学采取好几种方法来阻止学生在网络上面抄袭。"},{"english":"The poem employs as its first lines a verse plagiarized from a billboard .","chinese":"这首诗开头的几行抄袭了一个广告牌上的一节诗。"},{"english":"The case was about a screenwriter plagiarizing another writer's novel.","chinese":"此案是关于一位编剧抄袭另一个作家的小说。"},{"english":"just making sure that things are not plagiarized.","chinese":"只是为了确保没有抄袭。"},{"english":"Recent studies have shown that a growing number of college students in China plagiarize.","chinese":"最近的研究表明，许多中国学生抄袭。"},{"english":"Furthermore, rich of information easily abets vogue of copy.","chinese":"而且，信息富足容易助长抄袭之风。"},{"english":"Well, let's see. We'll do some jumping, I guess.","chinese":"懒惰的抄袭者好的，我们来看一下。"},{"english":"Do people in your school take plagiarism seriously?","chinese":"你们学校的人对抄袭的态度严肃吗？"},{"english":"The teacher made an example of the boy who copied from another student during a test.","chinese":"老师公开处罚那个考试抄袭他人的学生以示儆戒。"},{"english":"Rip off as many samples from horror movies as possible to use in your extreme album. Copyright is for pussies .","chinese":"从恐怖电影中抄袭尽量多的片断用在你的极端专辑中。"},{"english":"The lazy student cribbed the composition off me.","chinese":"那个懒惰的学生抄袭了我的作文。"},{"english":"He cribbed the plot of his narrative from another author.","chinese":"他从别的作者那里抄袭了他这段描述。"},{"english":"Soon after, Guo was accused of plagiarizing the novel from Zhuang Yu’s “In and Out of the Circle.”","chinese":"随后，郭敬明被指控抄袭庄羽的《圈里圈外》。"},{"english":"Plagiarism is a great enemy of scientific research that deserves nothing but detestation.","chinese":"抄袭乃科学研究之大敌，为人不齿。"},{"english":"Do you feel people are taking the idea of self-ownership seriously?","chinese":"你觉得抄袭别人的风格是严重的问题吗？"},{"english":"The student will plagiarize the work to give his study to bring the adverse consequences.","chinese":"学生抄袭作业会给他的学习带来很多不良后果。"}],"related":[{"definition":["to plunder\/to plagiarize"],"pinyin":["piao1 qie4"],"word":"剽窃"},{"definition":["to embezzle\/to defraud\/to use illegitimately\/to misappropriate"],"pinyin":["dao4 yong4"],"word":"盗用"},{"definition":["originality\/creativity\/innovation"],"pinyin":["yuan2 chuang4"],"word":"原创"},{"definition":["to use an image without permission"],"pinyin":["dao4 tu2"],"word":"盗图"},{"definition":["to modify a text so it can be plagiarized without detection (neologism c. 2014, formed by analogy with 洗錢|洗钱[xi3 qian2], to launder money)"],"pinyin":["xi3 gao3"],"word":"洗稿"},{"definition":["(neologism c. 2018) to incorporate ideas or material from sb else's creative work in one's own work"],"pinyin":["rong2 geng3"],"word":"融梗"},{"definition":["the attitude of mechanically borrowing (ideas etc)"],"pinyin":["na2 lai2 zhu3 yi4"],"word":"拿来主义"},{"definition":["mirroring others\/identical"],"pinyin":["lei2 tong2"],"word":"雷同"},{"definition":["to infringe the rights of\/to violate\/infringement"],"pinyin":["qin1 quan2"],"word":"侵权"},{"definition":["copyright"],"pinyin":["zhu4 zuo4 quan2"],"word":"著作权"},{"definition":["to pick up what others say (idiom); to pass off other people's opinions as one's own\/to parrot"],"pinyin":["shi2 ren2 ya2 hui4"],"word":"拾人牙慧"},{"definition":["to forward (a shipment)\/to reprint sth published elsewhere\/Taiwan pr. [zhuan3 zai4]"],"pinyin":["zhuan3 zai3"],"word":"转载"},{"definition":["to copy word for word"],"pinyin":["zhao4 chao1"],"word":"照抄"},{"definition":["to stir-fry leftover rice\/fig. to rehash the same story\/to serve up the same old product"],"pinyin":["chao3 leng3 fan4"],"word":"炒冷饭"},{"definition":["tort\/infringement (of sb's rights)"],"pinyin":["qin1 quan2 xing2 wei2"],"word":"侵权行为"},{"definition":["pirated\/illegal\/see also 正版[zheng4 ban3]"],"pinyin":["dao4 ban3"],"word":"盗版"}]}