{"definition":["to buy frenetically\/to snap up (bargains, dwindling supplies etc)"],"pinyin":["qiang3 gou4"],"traditional":["搶購"],"rank":11233.0,"normalized_rank":0.1571642438403313,"fraction":0.00000682678969782512,"cumulative_fraction":0.9389655843443226,"word":"抢购","characters":[{"definition":["see 搶風|抢风[qiang1 feng1]","to fight over\/to rush\/to scramble\/to grab\/to rob\/to snatch"],"pinyin":["qiang1","qiang3"],"word":"抢"},{"definition":["to buy\/to purchase"],"pinyin":["gou4"],"word":"购"}],"containing_words":[],"sentences":[{"english":"They are eagerly trying to buy the shoes and boots.","chinese":"她们都在急切地抢购各种鞋靴。"},{"english":"Rapid inflation and above curtailments acquired by agitation buying.","chinese":"迅猛的通货膨胀和抢购造成重大的商品缺乏。"},{"english":"A host of government conglomerates have snapped up coal mining companies in Shanxi Province.","chinese":"一大批国有企业进入山西抢购煤矿公司。"},{"english":"For fare that the electricity will cut off, people storm into convenience store to grab candles.","chinese":"为了勉于断电之苦，人们踊进便利商店抢购蜡烛。"},{"english":"A rush of salt in the multilateral tide, under the rumours, gradually died down.","chinese":"一场食盐的抢购潮，在多方辟谣之下，逐渐平息。"},{"english":"Studio flats meant for artists-in-residence get snapped up by bankers.","chinese":"艺术家们居住的单间公寓遭到银行业者的抢购。"},{"english":"Silly city people panic buying salt, afraid that all sea salt from today on will have been exposed to radiation.","chinese":"小市民疯狂抢购盐，恐怕日后的海盐受到核辐射。"},{"english":"Elsewhere supermarkets reported a surge in panic-buying as shoppers tied to stockpile food supplies.","chinese":"其他地区的超市里，群众为了抢购储存食物一团慌乱。"},{"english":"Just 12 bottles were made and the company has already sold out.","chinese":"该公司酿制的区区12瓶“历史终点”已经抢购一空。"},{"english":"But not all salt-buyers were looking for radiation protection.","chinese":"然而，并非所有的食盐抢购者都是出于防辐射的目的。"},{"english":"Don't lose more by joining the stampede of buy-high, sell-low market timers.","chinese":"不要应为参与高买低卖的抢购风潮而亏损更多。"},{"english":"The rush for rice in Hong Kong began after wholesale prices spiked in Thailand.","chinese":"泰国的大米批发价格猛涨之后，香港人开始抢购大米。"},{"english":"Food always comes in the mornings - it just gets bought up by people caught up in things.","chinese":"食品总在早上供应，而且总被抢购的人买走。"},{"english":"This is one of the factors that create unnecessary speculation and also panic buying,” he said.","chinese":"这些都是造成不必要的市场投机和抢购的因素之一。"},{"english":"Over the National Day holiday in early October, retailers say large flat-screen TVs flew off the shelves.","chinese":"国庆节当日，零售商说人们抢购大型纯平电视。"},{"english":"Rumor spread the prices would go up, many peopel stampeded into a wave of panic buying.","chinese":"谣传物价要上涨，很多人卷入了抢购的风潮中。"}],"related":[{"definition":["to sell strongly\/to be in great demand"],"pinyin":["re4 mai4"],"word":"热卖"},{"definition":["advance sale\/to sell in advance\/to book"],"pinyin":["yu4 shou4"],"word":"预售"},{"definition":["to be completely sold out\/to sell out"],"pinyin":["shou4 qing4"],"word":"售罄"},{"definition":["to promote sales"],"pinyin":["cu4 xiao1"],"word":"促销"},{"definition":["to cut the price\/to drive down the price\/to get cheaper"],"pinyin":["jiang4 jia4"],"word":"降价"},{"definition":["special price"],"pinyin":["te4 jia4"],"word":"特价"},{"definition":["to sell out\/to run out (of supplies)\/deficient\/lack of supplies"],"pinyin":["tuo1 xiao1"],"word":"脱销"},{"definition":["to place an order\/to order\/an order (of goods)"],"pinyin":["xia4 dan1"],"word":"下单"},{"definition":["to give a discount"],"pinyin":["da3 zhe2"],"word":"打折"},{"definition":["lack of supplies\/unavailable goods"],"pinyin":["que1 huo4"],"word":"缺货"},{"definition":["to sell well\/hot-selling"],"pinyin":["re4 xiao1"],"word":"热销"},{"definition":["to place an order\/to book ahead"],"pinyin":["yu4 ding4"],"word":"预订"},{"definition":["to run out of (stock)"],"pinyin":["duan4 huo4"],"word":"断货"},{"definition":["while stocks last\/subject to availability"],"pinyin":["shou4 wan2 ji2 zhi3"],"word":"售完即止"},{"definition":["to have a sale\/sale"],"pinyin":["te4 mai4"],"word":"特卖"},{"definition":["to sell out"],"pinyin":["shou4 wan2"],"word":"售完"}]}