{"definition":["to resist\/to withstand"],"pinyin":["di3 yu4"],"traditional":["抵禦"],"rank":10346.0,"normalized_rank":0.14475396303499224,"fraction":0.000007818415717098224,"cumulative_fraction":0.9324835973046084,"word":"抵御","characters":[{"definition":["to press against\/to support\/to prop up\/to resist\/to equal\/to balance\/to make up for\/to mortgage\/to arrive at\/to clap (one's hands) lightly (expressing delight) (Taiwan pr. [zhi3] for this sense)"],"pinyin":["di3"],"word":"抵"},{"definition":["to defend\/to resist","to resist\/imperial\/(classical) to drive (a chariot)\/to manage\/to govern"],"pinyin":["yu4","yu4"],"word":"御"}],"containing_words":[],"sentences":[{"english":"Thi provide the hip with an effective protection againt torpedoe attack.","chinese":"这对舰船抵御鱼雷攻击提供了有效保护。"},{"english":"Of course, exercise and vitamin supplements can't head off all potential risks.","chinese":"当然，锻炼和维生素补充剂不能抵御所有的潜在风险。"},{"english":"They sandbagged their homes to keep out floods.","chinese":"他们在房屋周围垫上沙袋以抵御水灾。"},{"english":"Protected by lamellar armour, giving these horse archers better protection against enemy attacks.","chinese":"库尔德弓骑兵身穿鳞甲，能有效抵御敌军攻击。"},{"english":"It cannot defend against vulnerabilities in third-party scripts or servers.","chinese":"它不能抵御第三方脚本或服务器中的安全漏洞。"},{"english":"We'll just keep dreaming of our active cloaking that counters earthquakes.","chinese":"我们将继续坚持我们抵御地震的梦想。"},{"english":"Interior organic cotton, exterior weather-resistant nylon fabric.","chinese":"内部是有机棉，外部是抵御冰冷气象的尼龙原料。"},{"english":"Nothing could be defensed but for the lure.","chinese":"除了诱惑我什么都能抵御。"},{"english":"The doctor thinks right amount take vitaminic E to be able to resist effectively anile .","chinese":"医生认为适量服用维他命E能有效抵御衰老。"},{"english":"Right mindfulness is a shield that protects us from our enemies.","chinese":"正念如盾牌，可以抵御强敌，何卫自身。"},{"english":"All the people had been armed to defend their country against imperialist and colonialists.","chinese":"所有的人被武装抵御帝国主义和殖民主义的国家。"},{"english":"She has become so poor that she has little power of resisting famines.","chinese":"印度已经穷得对饥荒没有抵御能力了。"},{"english":"Driving the branches into firm snow gives a quick and easy lean-to to keep the wind off.","chinese":"将树枝深埋于雪中可以简单迅速的抵御寒风。"},{"english":"Firstly, to further improve ability to resist flood and drought disasters.","chinese":"第一，进一步提高抵御水旱灾害的能力。"},{"english":"He also said that Lorca old building is not easy to resist earthquakes.","chinese":"他还说，洛尔卡的建筑老旧，也不容易抵御地震。"},{"english":"To prepare for an attack by raiders, Kardaine prays to the Father to inspire courage.","chinese":"为了抵御掠袭者攻击，卡典向天父祈祷让他鼓起勇气。"}],"related":[{"definition":["to resist\/to hold back\/to stop\/to ward off\/to withstand"],"pinyin":["di3 dang3"],"word":"抵挡"},{"definition":["to resist\/resistance"],"pinyin":["di3 kang4"],"word":"抵抗"},{"definition":["to invade\/to assail\/onslaught"],"pinyin":["qin1 xi2"],"word":"侵袭"},{"definition":["to resist (an aggressor)\/to oppose (a menace)"],"pinyin":["kang4 ji1"],"word":"抗击"},{"definition":["defense\/to defend"],"pinyin":["fang2 yu4"],"word":"防御"},{"definition":["to stop\/to resist\/to obstruct"],"pinyin":["zu3 dang3"],"word":"阻挡"},{"definition":["to defend\/to protect"],"pinyin":["fang2 hu4"],"word":"防护"},{"definition":["to invade and harass"],"pinyin":["qin1 rao3"],"word":"侵扰"},{"definition":["to avoid suffering\/to prevent (sth bad)\/to protect against (damage)\/immunity (from prosecution)\/freedom (from pain, damage etc)\/exempt from punishment"],"pinyin":["mian3 shou4"],"word":"免受"},{"definition":["to resist\/to fight\/to defy\/anti-"],"pinyin":["kang4"],"word":"抗"},{"definition":["to make (military) incursions\/to invade\/to intrude into\/to trespass\/to gain unauthorized access (computing)"],"pinyin":["qin1 ru4"],"word":"侵入"},{"definition":["barrier"],"pinyin":["ping2 zhang4"],"word":"屏障"},{"definition":["to erode\/to corrode"],"pinyin":["qin1 shi2"],"word":"侵蚀"},{"definition":["to withstand\/to resist\/to stand off\/antagonism\/confrontation"],"pinyin":["dui4 kang4"],"word":"对抗"},{"definition":["to separate\/to cut off"],"pinyin":["zu3 ge2"],"word":"阻隔"},{"definition":["to prevent\/to block"],"pinyin":["zu3 zhi3"],"word":"阻止"}]}