{"definition":["to break up (a marriage, family etc)"],"pinyin":["chai1 san4"],"traditional":["拆散"],"rank":27902.0,"normalized_rank":0.39038518041778014,"fraction":0.000001138333534269347,"cumulative_fraction":0.9880698583051232,"word":"拆散","characters":[{"definition":["to tear open\/to tear down\/to tear apart\/to open"],"pinyin":["chai1"],"word":"拆"},{"definition":["scattered\/loose\/to come loose\/to fall apart\/leisurely\/powdered medicine","to scatter\/to break up (a meeting etc)\/to disperse\/to disseminate\/to dispel\/(coll.) to sack","variant of 散[san4]"],"pinyin":["san3","san4","san4"],"word":"散"}],"containing_words":[],"sentences":[{"english":"But the Queen Mother of ruthless, and finally he just break up this pair of happy couples.","chinese":"然而王母冷酷无情，最后硬是拆散了这对恩爱夫妻。"},{"english":"You had better ravel a bit of the left-over cloth to mend the tear in your trousers.","chinese":"你最好拆散一小块碎布头来织补你的裤子。"},{"english":"3He said his daughter was worried that they might have separated a monogamous couple.","chinese":"3他说他的女儿担心他们可能拆散了一对终生伴侣。"},{"english":"He said his daughter was worried that they might have separated a monogamous couple.","chinese":"他说他的女儿担心他们可能拆散了一对终生伴侣。"},{"english":"My son stripped my watch and couldn't assemble it.","chinese":"我儿子把我的手表拆散后组装不起来了。"},{"english":"He was separated from him because of political opinions.","chinese":"人家要拆散他们父子是为了政治上的见解不同。"},{"english":"Phoebe tries to break it up and enlists help from Ross and Joey.","chinese":"菲比想拆散他们，向罗斯和乔伊求助。"},{"english":"Our laws should respect families following the rules -– instead of splitting them apart.","chinese":"我们的法律应当尊重循规蹈矩的家庭，而非拆散他们。"},{"english":"I hope your family is not angry with him. I hope his disease has not torn us apart.","chinese":"希望你家人不对他生气，希望他的疾病没把我们拆散。"},{"english":"The old ship was towed away to be broken up and sold as scrap.","chinese":"那艘旧船被拖走以便拆散当废铁卖了。"},{"english":"What could rip a star apart?","chinese":"是何方神圣能把一颗恒星拆散了？"},{"english":"The Qixi Festival day, on the street to make a practical joke, break up a pair is a pair.","chinese":"七夕这天，到大街上搞恶作剧，拆散一对是一对。"},{"english":"Olivier's marriage to the shallow Jacqueline separated the two friends.","chinese":"奥里维与肤浅的雅葛丽纳的婚姻把这两个朋友拆散了。"},{"english":"Divorce breaks up a lot of families.","chinese":"离婚拆散了许多家庭。"},{"english":"The days of tactical, disjointed marketing campaigns and programs are numbered.","chinese":"在天的战术，拆散营销活动和项目编号。"}],"related":[{"definition":["to rob sb of sth they cherish (idiom)"],"pinyin":["heng2 dao1 duo2 ai4"],"word":"横刀夺爱"},{"definition":["to squeeze in\/to step in\/to take part\/to step between (two persons in a relationship)"],"pinyin":["cha1 zu2"],"word":"插足"},{"definition":["to abandon\/to discard\/to renounce\/to dump (sb)"],"pinyin":["pao1 qi4"],"word":"抛弃"},{"definition":["to kill\/to cause death\/to do sb to death"],"pinyin":["hai4 si3"],"word":"害死"},{"definition":["an unhappy couple (formal writing)"],"pinyin":["yuan4 ou3"],"word":"怨偶"},{"definition":["to become enemies (idiom); to fall out with sb"],"pinyin":["fan3 mu4 cheng2 chou2"],"word":"反目成仇"},{"definition":["to destroy"],"pinyin":["hui3 diao4"],"word":"毁掉"},{"definition":["to undermine\/to let someone down\/to seduce someone away from something"],"pinyin":["wa1 qiang2 jiao3"],"word":"挖墙脚"},{"definition":["to throttle\/to choke to death"],"pinyin":["qia1 si3"],"word":"掐死"},{"definition":["to betray"],"pinyin":["bei4 pan4"],"word":"背叛"},{"definition":["the shrike and the swallow fly in different directions (idiom)\/(usually of a couple) to part from each other"],"pinyin":["lao2 yan4 fen1 fei1"],"word":"劳燕分飞"},{"definition":["to drive a wedge between (allies, partners etc)"],"pinyin":["li2 jian4"],"word":"离间"},{"definition":["to help sb accomplish his aim\/to help sb succeed\/to complete\/to make whole\/to round off"],"pinyin":["cheng2 quan2"],"word":"成全"},{"definition":["to have a falling out\/to have a big argument"],"pinyin":["nao4 fan1"],"word":"闹翻"},{"definition":["to entrap\/to set up\/to frame (up)\/to make false charges against"],"pinyin":["xian4 hai4"],"word":"陷害"},{"definition":["to snatch (esp related to a robbery)"],"pinyin":["qiang3 zou3"],"word":"抢走"}]}