{"definition":["to spoil things through excessive enthusiasm (idiom)"],"pinyin":["ba2 miao2 zhu4 zhang3"],"traditional":["拔苗助長"],"rank":36730.0,"normalized_rank":0.5139003539798246,"fraction":5.186585082404451e-7,"cumulative_fraction":0.9950193122729101,"word":"拔苗助长","characters":[{"definition":["to pull up\/to pull out\/to draw out by suction\/to select\/to pick\/to stand out (above level)\/to surpass\/to seize"],"pinyin":["ba2"],"word":"拔"},{"definition":["Hmong or Miao ethnic group of southwest China\/surname Miao","sprout"],"pinyin":["Miao2","miao2"],"word":"苗"},{"definition":["to help\/to assist"],"pinyin":["zhu4"],"word":"助"},{"definition":["length\/long\/forever\/always\/constantly","chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance"],"pinyin":["chang2","zhang3"],"word":"长"}],"containing_words":[],"sentences":[{"english":"To educate the young generation in such a way is just like making the rice shoots grow by pulling them up.","chinese":"用这种方法教育下一代无异于拔苗助长。"},{"english":"Let your ideas cook in May, and don't rush the process by calling or adding subtle pressure.","chinese":"让你的好主意在5月萌芽，不要施加压力拔苗助长。"},{"english":"Teaching children in this way simply means applying too much pressure and damaging them.","chinese":"用这种方法教育孩子，简直是拔苗助长。"},{"english":"Grass grows in its own time but if you keep pulling it, it will just die.","chinese":"草会自己生长，如果拔苗助长，它便会死去。"},{"english":"But it's important not to rush things to avoid setbacks.","chinese":"为了防止复发，拔苗助长是绝对不可以的。"},{"english":"I believe he has the talent – the problem is not to hurry him too much.","chinese":"我相信他有能力，问题是不要拔苗助长。"}],"related":[{"definition":["see 拔苗助長|拔苗助长[ba2 miao2 zhu4 zhang3]"],"pinyin":["ya4 miao2 zhu4 zhang3"],"word":"揠苗助长"},{"definition":["anxious for quick results (idiom); to demand instant success\/impatient for result\/impetuous"],"pinyin":["ji2 yu2 qiu2 cheng2"],"word":"急于求成"},{"definition":["seeking instant benefit (idiom); shortsighted vision, looking only for fast return"],"pinyin":["ji2 gong1 jin4 li4"],"word":"急功近利"},{"definition":["lit. to want sth in haste, but cannot get there (idiom, from Analects); more haste, less speed\/don't try to run before you can walk"],"pinyin":["yu4 su4 ze2 bu4 da2"],"word":"欲速则不达"},{"definition":["to neglect the root and pursue the tip (idiom)\/to neglect fundamentals and concentrate on details"],"pinyin":["she3 ben3 zhu2 mo4"],"word":"舍本逐末"},{"definition":["to act with undue haste (idiom); eager and impatient\/overhasty"],"pinyin":["cao1 zhi1 guo4 ji2"],"word":"操之过急"},{"definition":["lit. to kill the chicken to get the eggs (idiom)\/fig. to kill the goose that lays the golden eggs"],"pinyin":["sha1 ji1 qu3 luan3"],"word":"杀鸡取卵"},{"definition":["lit. to want sth in haste, but cannot get there (idiom, from Analects); more haste, less speed\/also written 欲速則不達|欲速则不达"],"pinyin":["yu4 su4 er2 bu4 da2"],"word":"欲速而不达"},{"definition":["to let sb do whatever they want\/to indulge\/to give free reins to\/to let things slide\/to drift aimlessly\/laissez-faire"],"pinyin":["fang4 ren4 zi4 liu2"],"word":"放任自流"},{"definition":["to produce the opposite of the desired result"],"pinyin":["shi4 de2 qi2 fan3"],"word":"适得其反"},{"definition":["to copy the way they walk in Handan (idiom)\/slavishly copying others, one risks becoming a caricature"],"pinyin":["Han2 dan1 xue2 bu4"],"word":"邯郸学步"},{"definition":["lit. to want to get fat with only one mouthful (proverb)\/fig. to try to achieve one's goal in the shortest time possible\/to be impatient for success"],"pinyin":["yi1 kou3 chi1 ge5 pang4 zi5"],"word":"一口吃个胖子"},{"definition":["too far is as bad as not enough (idiom, from the Analects)"],"pinyin":["guo4 you2 bu4 ji2"],"word":"过犹不及"},{"definition":["lit. to drain the pond to get at the fish (idiom)\/fig. to kill the goose that lays the golden eggs"],"pinyin":["jie2 ze2 er2 yu2"],"word":"竭泽而渔"},{"definition":["lit. not eating for fear of choking (idiom); fig. to cut off one's nose to spite one's face\/to avoid sth essential because of a slight risk"],"pinyin":["yin1 ye1 fei4 shi2"],"word":"因噎废食"},{"definition":["in sequence, step by step (idiom); to make steady progress incrementally"],"pinyin":["xun2 xu4 jian4 jin4"],"word":"循序渐进"}]}