{"definition":["to recruit\/to enlist"],"pinyin":["zhao1 mu4"],"traditional":["招募"],"rank":6095.0,"normalized_rank":0.08527695773229052,"fraction":0.000018127355726087883,"cumulative_fraction":0.8817345934219604,"word":"招募","characters":[{"definition":["to recruit\/to provoke\/to beckon\/to incur\/to infect\/contagious\/a move (chess)\/a maneuver\/device\/trick\/to confess"],"pinyin":["zhao1"],"word":"招"},{"definition":["canvass for contributions\/to recruit\/to collect\/to raise"],"pinyin":["mu4"],"word":"募"}],"containing_words":[],"sentences":[{"english":"TDF for a minimum of 12 months were recruited to this single centre study.","chinese":"至少12个月，华盈被招募到这个单中心研究。"},{"english":"Dahomey Amazons: this unit is available when holding territory in North Africa.","chinese":"必须拥有疆土在北非，这个单位是可招募的。"},{"english":"The US presence is just a recruiting poster for the Taliban.","chinese":"美国的存在也就不过是张塔利班招募新兵的海报罢了。"},{"english":"You will help recruit the best optometrists for our new stores;","chinese":"您将协助我们的新店招募优秀，专业的验光师。"},{"english":"Some luxury companies recruit for sales trainees at China's top universities.","chinese":"部分奢侈品公司在中国最好的大学中招募销售实习生。"},{"english":"But when the pack had puppies, the other adults recruited him to babysit .","chinese":"但是包让人招募他照看婴孩小狗，其它成年人。"},{"english":"Safe havens have also afforded the militants endless opportunities to find new recruits.","chinese":"安全庇护所也为武装分子提供无限的机会去招募新兵。"},{"english":"He enlisted help from 10 Web-savvy volunteers and began soliciting donations on his blog.","chinese":"他在网上招募志愿者，并在博客中呼吁捐款捐物。"},{"english":"So why not recruit volunteers to try out chemicals for us?","chinese":"那为什么不招募志愿者替我们试验呢？"},{"english":"The best way to recruit scientists would be to break the development log-jam.","chinese":"招募科学家的最好办法是打破开发僵局。"},{"english":"Every financial holding company (FHC) has invested considerable capitals in establishing systems and in recruiting financial consultants for wealth management.","chinese":"各家金控公司皆投入大量资金在软硬体及人才招募上。"},{"english":"Remember, recruiting is the lifeblood of any successful college athletic program.","chinese":"记住，招募是任何大学运动项目成功的命门。"},{"english":"He and his staff bring in couples and observe them as they perform various tasks.","chinese":"他和他的部下招募情侣们并观察他们进行的各种活动。"},{"english":"HCIA Program advertisements will be removed from the website after close of application.","chinese":"职位截止申请后，有关的网上招募广告将被移除。"},{"english":"The dearth of returning migrants set off a desperate scramble this week to recruit workers.","chinese":"返城民工的短缺使得这周的招募工人变得饥不择食。"},{"english":"He moved here three years ago, when Mr. Masfuk first put out a call for Chinese teachers.","chinese":"在麦夫克县长招募中文教师的三年前来到了这里。"}],"related":[{"definition":["to conscript"],"pinyin":["zheng1 mu4"],"word":"征募"},{"definition":["to attract (customers)\/to drum up (trade)"],"pinyin":["zhao1 lan3"],"word":"招揽"},{"definition":["to employ\/to hire"],"pinyin":["gu4 yong1"],"word":"雇佣"},{"definition":["to hire\/to recruit"],"pinyin":["zhao1 shou1"],"word":"招收"},{"definition":["to recruit soldiers and buy horses (idiom); to raise a large army\/fig. to expand business\/to recruit new staff"],"pinyin":["zhao1 bing1 mai3 ma3"],"word":"招兵买马"},{"definition":["to select the best"],"pinyin":["xuan3 ba2"],"word":"选拔"},{"definition":["to organize\/to set up\/to establish"],"pinyin":["zu3 jian4"],"word":"组建"},{"definition":["to send (on a mission)\/to dispatch"],"pinyin":["pai4 qian3"],"word":"派遣"},{"definition":["to enlist\/to draft\/to conscript\/to appoint to an official position"],"pinyin":["zheng1 zhao4"],"word":"征召"},{"definition":["to collect\/to recruit"],"pinyin":["zheng1 ji2"],"word":"征集"},{"definition":["to employ\/to hire"],"pinyin":["pin4 yong4"],"word":"聘用"},{"definition":["to convene\/to gather"],"pinyin":["zhao4 ji2"],"word":"召集"},{"definition":["to invite applications for a job\/to recruit"],"pinyin":["zhao1 pin4"],"word":"招聘"},{"definition":["to incorporate into one's troops\/to weave in"],"pinyin":["shou1 bian1"],"word":"收编"},{"definition":["to assemble\/to concentrate\/to mass\/to build up\/to marshal"],"pinyin":["ji2 jie2"],"word":"集结"},{"definition":["to mobilize\/to arouse\/mobilization\/CL:次[ci4],個|个[ge4]"],"pinyin":["dong4 yuan2"],"word":"动员"}]}