{"definition":["to attract (customers)\/to drum up (trade)"],"pinyin":["zhao1 lan3"],"traditional":["招攬"],"rank":15893.0,"normalized_rank":0.22236368978495374,"fraction":0.0000037216995968449608,"cumulative_fraction":0.9625444722099252,"word":"招揽","characters":[{"definition":["to recruit\/to provoke\/to beckon\/to incur\/to infect\/contagious\/a move (chess)\/a maneuver\/device\/trick\/to confess"],"pinyin":["zhao1"],"word":"招"},{"definition":["to monopolize\/to seize\/to take into one's arms\/to embrace\/to fasten (with a rope etc)\/to take on (responsibility etc)\/to canvass"],"pinyin":["lan3"],"word":"揽"}],"containing_words":[{"definition":["to enlist the services of sb"],"pinyin":["yan2 pin4 zhao1 lan3"],"word":"延聘招揽"},{"definition":["to advertise\/to solicit business"],"pinyin":["zhao1 lan3 sheng1 yi5"],"word":"招揽生意"}],"sentences":[{"english":"We advertised our services to make more bussiness.","chinese":"我们登广告宣传自己的服务项目来招揽生意。"},{"english":"Zhou gong was very diligent at government matters when assisting young King Cheng. He tried to attract talents widely.","chinese":"周公辅佐年幼的成王时，勤于政事，广泛招揽人才。"},{"english":"The department sore is offering big discounts to drum up business.","chinese":"为了招揽生意这家百货商场进行打折活动。"},{"english":"Ochroma manages to attract its clientele through a simple trick of timing.","chinese":"巴尔沙树通过一种简单的时机选择将顾客们招揽来。"},{"english":"Securities companies shall not procure the underwriting business with improper means of competition.","chinese":"证券公司不得以不正当竞争手段招揽证券承销业务。"},{"english":"It’s raised paw is said to beckon customers and money into shops.","chinese":"它那举着的小爪子意来为店家招揽客人和钱财。"},{"english":"He was soon drafted into the NBA as a guard for the Chicago Bulls.","chinese":"不久，他受NBA招揽，成为芝加哥公牛队的后卫。"},{"english":"Plaintiff thereafter began to recruit advertisement clients.","chinese":"此后，原告方开始对外招揽广告客户。"},{"english":"Many taxis were cruising in the downtown area.","chinese":"很多出租汽车在市区内缓缓行驶以招揽生意。"},{"english":"The barber was tinkling the metal to canvass for business.","chinese":"理发师在胡同中敲着唤头招揽生意。"},{"english":"Manufacturers are offering big discounts to drum up business.","chinese":"生产厂家正提供很大的折扣来招揽生意。"},{"english":"From content business exterior the work that solicits core management layer still did not stop.","chinese":"从内容商外部招揽核心管理层的工作仍未停止。"},{"english":"The very process of shooting for these people will make your pitch better.","chinese":"这种招揽人才的手段可以使你的公司形象变得更好。"},{"english":"Journalists may not solicit advertisements in the name of news coverage.","chinese":"新闻记者不得借采访名义招揽广告。"},{"english":"Talley Moore tries to drum up business in Lookout Mountain, Tenn.","chinese":"卢克奥特山市场的一名摊主在招揽顾客。"}],"related":[{"definition":["to coax\/to beguile\/to win over"],"pinyin":["long3 luo4"],"word":"笼络"},{"definition":["to rope in\/fig. to involve sb\/to entice"],"pinyin":["la1 long3"],"word":"拉拢"},{"definition":["to recruit\/to enlist"],"pinyin":["zhao1 mu4"],"word":"招募"},{"definition":["to canvass (for customers)\/to solicit\/to recruit"],"pinyin":["zhao1 lai2"],"word":"招徕"},{"definition":["to recruit soldiers and buy horses (idiom); to raise a large army\/fig. to expand business\/to recruit new staff"],"pinyin":["zhao1 bing1 mai3 ma3"],"word":"招兵买马"},{"definition":["to lobby\/to campaign\/to promote (an idea, a product)\/(old) to visit various rulers and promote one's political ideas (in the Warring States period)"],"pinyin":["you2 shui4"],"word":"游说"},{"definition":["to rely on help from sb"],"pinyin":["tou2 kao4"],"word":"投靠"},{"definition":["to make friends with"],"pinyin":["jie2 jiao1"],"word":"结交"},{"definition":["to purchase\/to bribe"],"pinyin":["shou1 mai3"],"word":"收买"},{"definition":["to foster\/to support"],"pinyin":["fu2 zhi2"],"word":"扶植"},{"definition":["troops\/subordinates\/(honorific appellation for a general)"],"pinyin":["hui1 xia4"],"word":"麾下"},{"definition":["to win the support of\/to get over to one's side\/to keep control of"],"pinyin":["shou1 lan3"],"word":"收揽"},{"definition":["to hire\/to recruit"],"pinyin":["zhao1 shou1"],"word":"招收"},{"definition":["to recommend sb\/to give a referral"],"pinyin":["yin3 jian4"],"word":"引荐"},{"definition":["to help\/to assist"],"pinyin":["fu2 chi2"],"word":"扶持"},{"definition":["to boost support or interest\/to campaign\/to promote"],"pinyin":["zao4 shi4"],"word":"造势"}]}