{"definition":["lit. to dispel the clouds and see the sun (idiom); fig. to restore justice"],"pinyin":["bo1 yun2 jian4 ri4"],"traditional":["撥雲見日"],"rank":43826.0,"normalized_rank":0.6131826004225371,"fraction":2.675769900379217e-7,"cumulative_fraction":0.9977229482804171,"word":"拨云见日","characters":[{"definition":["to push aside with the hand, foot, a stick etc\/to dial\/to allocate\/to set aside (money)\/to poke (the fire)\/to pluck (a string instrument)\/to turn round\/classifier: group, batch"],"pinyin":["bo1"],"word":"拨"},{"definition":["cloud\/CL:朵[duo3]","(classical) to say","surname Yun\/abbr. for Yunnan Province 雲南省|云南省[Yun2 nan2 Sheng3]"],"pinyin":["yun2","yun2","Yun2"],"word":"云"},{"definition":["to appear\/also written 現|现[xian4]","to see\/to meet\/to appear (to be sth)\/to interview"],"pinyin":["xian4","jian4"],"word":"见"},{"definition":["abbr. for 日本[Ri4 ben3], Japan","sun\/day\/date, day of the month"],"pinyin":["Ri4","ri4"],"word":"日"}],"containing_words":[],"sentences":[{"english":"Because it only takes a smile to make a dark day seem bright.","chinese":"因为，只需一个微笑，就可以拨云见日。"}],"related":[{"definition":["lit. the willow trees make the shade, the flowers give the light (idiom); at one's darkest hour, a glimmer of hope\/light at the end of the tunnel"],"pinyin":["liu3 an4 hua1 ming2"],"word":"柳暗花明"},{"definition":["lit. to anoint your head with the purest cream (idiom); fig. to enlighten people with perfect wisdom\/flawless Buddhist teaching"],"pinyin":["ti2 hu2 guan4 ding3"],"word":"醍醐灌顶"},{"definition":["the mountain road twists around each new peak (idiom)\/(of a mountain road) twisting and turning\/fig. an opportunity has come unexpectedly\/things have taken a new turn"],"pinyin":["feng1 hui2 lu4 zhuan3"],"word":"峰回路转"},{"definition":["murky darkness suddenly opens (idiom); a sudden flash of insight and all is clear"],"pinyin":["mao2 se4 dun4 kai1"],"word":"茅塞顿开"},{"definition":["the clouds melt and the mists disperse (idiom)\/to clear up\/to vanish into thin air"],"pinyin":["yun2 xiao1 wu4 san4"],"word":"云消雾散"},{"definition":["suddenly opens up to a wide panorama (idiom); to come to a wide clearing\/fig. everything becomes clear at once\/to achieve speedy enlightenment"],"pinyin":["huo4 ran2 kai1 lang3"],"word":"豁然开朗"},{"definition":["to come back from death's door (idiom); unexpected rescue from danger\/fig. to recover from a seemingly impossible situation\/to find a way out of a predicament"],"pinyin":["jue2 chu3 feng2 sheng1"],"word":"绝处逢生"},{"definition":["sky clears after rain\/new hopes after a disastrous period (idiom)\/every cloud has a silver lining (idiom)\/see also 雨過天青|雨过天青[yu3 guo4 tian1 qing1]"],"pinyin":["yu3 guo4 tian1 qing2"],"word":"雨过天晴"},{"definition":["bitterness finishes, sweetness begins (idiom); the hard times are over, the good times just beginning"],"pinyin":["ku3 jin4 gan1 lai2"],"word":"苦尽甘来"},{"definition":["extreme sorrow turns to joy (idiom)"],"pinyin":["pi3 ji2 tai4 lai2"],"word":"否极泰来"},{"definition":["lit. to spin silk from cocoons\/fig. to make a painstaking investigation (idiom)"],"pinyin":["chou1 si1 bao1 jian3"],"word":"抽丝剥茧"},{"definition":["haze"],"pinyin":["yin1 mai2"],"word":"阴霾"},{"definition":["a flash of realization\/the truth in a flash\/a moment of enlightenment (usually Buddhist)"],"pinyin":["dun4 wu4"],"word":"顿悟"},{"definition":["lit. the spring comes upon a withered tree (idiom)\/fig. to get a new lease on life\/to be revived\/(of a difficult situation) to suddenly improve"],"pinyin":["ku1 mu4 feng2 chun1"],"word":"枯木逢春"},{"definition":["to achieve supreme enlightenment or nirvana (Buddhism)"],"pinyin":["da4 che4 da4 wu4"],"word":"大彻大悟"},{"definition":["lit. spring wind and rain (idiom); fig. the long-term influence of a solid education"],"pinyin":["chun1 feng1 hua4 yu3"],"word":"春风化雨"}]}