{"definition":["to push aside\/to part\/to brush away"],"pinyin":["bo1 kai1"],"traditional":["撥開"],"rank":25815.0,"normalized_rank":0.3611853427168301,"fraction":0.0000013739414240245055,"cumulative_fraction":0.985453497503456,"word":"拨开","characters":[{"definition":["to push aside with the hand, foot, a stick etc\/to dial\/to allocate\/to set aside (money)\/to poke (the fire)\/to pluck (a string instrument)\/to turn round\/classifier: group, batch"],"pinyin":["bo1"],"word":"拨"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"开"}],"containing_words":[],"sentences":[{"english":"A nicked pearl opens a treasure of innovation.","chinese":"一个拨开的珍珠蚌打开了创新的宝藏。"},{"english":"IrritaBly, she elBowed a path through the streams of girls entering and leaving the gate.","chinese":"她急躁地从进进出出的姑娘群中拨开一条道。"},{"english":"I will protect you and break open the crowds in your way like an ice-breaker in arctic sea.","chinese":"我要护著妳，拨开挡路的人群如破冰船行在北极冰洋。"},{"english":"She brushed away the 28)bangs hiding my eyes and then pulled me against her breast.","chinese":"她拨开遮着我眼睛的刘海儿，一把将我搂进怀里。"},{"english":"We're poking and quantitatively measuring the softness of the cells.","chinese":"我们拨开细胞并定量地测量其柔软度。"},{"english":"I had to part the willow branches to get in;","chinese":"我得拨开柳树丛的枝桠，这才进得去。"},{"english":"Find Road clouds are cleared, leaning against the tree, listen to gurgling flow of the springs.","chinese":"拨开云雾寻找古道，靠在树上细听淙淙流动的泉水。"},{"english":"For prying beneath and forcing the lids of sight.","chinese":"窥伺俯望，拨开视界的眼睑。"},{"english":"Out the portholes, Europe slipped over the horizon and the Carthage hit open water.","chinese":"舷窗外，迦太基号拨开水浪，欧洲逐渐消失在地平线。"},{"english":"After pulling off the shell, she observed the hard-boiled egg.","chinese":"拨开外壳后，他看到一个煮老的鸡蛋。"},{"english":"Just as a black mouse pointer disperses them, \"HP\"is in sight.","chinese":"黑色鼠标指针将他们拨开，发现了“HP”。"},{"english":"Precious are God's words that unravel life's mystery and lighten my heart.","chinese":"神的话字字重千钧，拨开迷雾照亮我的心。"}],"related":[{"definition":["to pry open or apart\/to spread (sth) open with both hands"],"pinyin":["ba1 kai1"],"word":"扒开"},{"definition":["to push aside (clothing, curtain etc) to reveal something\/to toss aside"],"pinyin":["liao1 kai5"],"word":"撩开"},{"definition":["to lift open\/to tear open"],"pinyin":["xian1 kai1"],"word":"掀开"},{"definition":["to raise\/to lift up (curtains, clothing etc)"],"pinyin":["liao1 qi3"],"word":"撩起"},{"definition":["to pull apart\/to pry open with the hands"],"pinyin":["bai1 kai1"],"word":"掰开"},{"definition":["to lean forward\/to lean out (of a window, door etc)"],"pinyin":["tan4 shen1"],"word":"探身"},{"definition":["to pick up"],"pinyin":["jian3 qi3"],"word":"拣起"},{"definition":["to reach out with one's hand\/to hold out a hand\/(fig.) to beg\/to get involved\/to meddle"],"pinyin":["shen1 shou3"],"word":"伸手"},{"definition":["to move to and fro (with hand, foot, stick etc)\/to fiddle with\/to stir up"],"pinyin":["bo1 nong4"],"word":"拨弄"},{"definition":["to approach\/to lean close to"],"pinyin":["cou4 jin4"],"word":"凑近"},{"definition":["to push open (a gate etc)\/to push away\/to reject\/to decline"],"pinyin":["tui1 kai1"],"word":"推开"},{"definition":["to grasp firmly"],"pinyin":["che3 zhu4"],"word":"扯住"},{"definition":["to detain\/to hold back by force\/to buckle\/to hook"],"pinyin":["kou4 zhu4"],"word":"扣住"},{"definition":["lightly\/softly"],"pinyin":["qing1 qing1"],"word":"轻轻"},{"definition":["to lean over\/to bend over\/to stoop\/to bow"],"pinyin":["fu3 shen1"],"word":"俯身"},{"definition":["to cleave\/to split open\/to spread open (fingers, legs)"],"pinyin":["pi1 kai1"],"word":"劈开"}]}