{"definition":["lit. to wipe one's eyes and wait (idiom); to wait and see"],"pinyin":["shi4 mu4 yi3 dai4"],"traditional":["拭目以待"],"rank":12653.0,"normalized_rank":0.17703188616680424,"fraction":0.000005599555788796856,"cumulative_fraction":0.9477445940107976,"word":"拭目以待","characters":[{"definition":["to wipe"],"pinyin":["shi4"],"word":"拭"},{"definition":["eye\/item\/section\/list\/catalogue\/table of contents\/order (taxonomy)\/goal\/name\/title"],"pinyin":["mu4"],"word":"目"},{"definition":["old variant of 以[yi3]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)","abbr. for Israel 以色列[Yi3 se4 lie4]","old variant of 以[yi3]"],"pinyin":["yi3","yi3","Yi3","yi3"],"word":"以"},{"definition":["to wait\/to treat\/to deal with\/to need\/going to (do sth)\/about to\/intending to","to stay"],"pinyin":["dai4","dai1"],"word":"待"}],"containing_words":[],"sentences":[{"english":"As is so often the case with the Big Questions in physics, we'll have to wait and see.","chinese":"就像众多物理学的大谜题一样，让我们拭目以待吧。"},{"english":"Okay. I'm going to watch for that.","chinese":"好吧，那我可要拭目以待了。"},{"english":"Beebe for the new season of change wait and see.","chinese":"所以我对新赛季毕比的改变拭目以待。"},{"english":"I will wait see your words is true .","chinese":"你的话是真是假，我拭目以待。"},{"english":"WhetIT or not we can trust Don or Penrab remains to be easysting.","chinese":"咱们也许能信任唐和佩拉伯还需求拭目以待。"},{"english":"We'll see if Pazzini and Cassano are better.","chinese":"至于卡萨诺和帕齐尼是否更为出色，我们将拭目以待。"},{"english":"People are still looking to see if there are significant changes in US policies.","chinese":"人们对美国是否有政策上的巨大转变而拭目以待。"},{"english":"It remains to be seen whether or not Original Sin will become a thriller classic.","chinese":"《原罪》能否成为恐怖片的经典仍需拭目以待。"},{"english":"It remains to be seen what kinds of reforms will actually materialise.","chinese":"哪种改革会最终成为现实，我们仍然拭目以待。"},{"english":"Ha-ha. Let's wait and see.","chinese":"哈哈，让我们拭目以待吧。"},{"english":"Whether it will greatly curtail gold farming remains to be seen.","chinese":"至于这是否会在很大程度上遏制打金业还要拭目以待。"},{"english":"However it's going to be interesting to see how long they can keep it up.","chinese":"然而他们能坚持多久，我们饶有兴趣的拭目以待。"},{"english":"Just how much tactile acuity can be achieved remains to be seen.","chinese":"能够达到多大的触敏度还要拭目以待。"}],"related":[{"definition":["to look forward to\/to await\/expectation"],"pinyin":["qi1 dai4"],"word":"期待"},{"definition":["to whom the deer falls (idiom); the one to emerge victor (i.e. to seize the empire)\/prize winner\/champion"],"pinyin":["lu4 si3 shei2 shou3"],"word":"鹿死谁手"},{"definition":["whether or not\/can it or can't it\/is it possible?"],"pinyin":["neng2 fou3"],"word":"能否"},{"definition":["to accept\/to take\/next\/following"],"pinyin":["jie1 xia4 lai2"],"word":"接下来"},{"definition":["unknown quantity"],"pinyin":["wei4 zhi1 shu4"],"word":"未知数"},{"definition":["woolen material","particle indicating that a previously asked question is to be applied to the preceding word (\"What about ...?\", \"And ...?\")\/particle for inquiring about location (\"Where is ...?\")\/particle signaling a pause, to emphasize the preceding words and allow the listener time to take them on board (\"ok?\", \"are you with me?\")\/(at the end of a declarative sentence) particle indicating continuation of a state or action\/particle indicating strong affirmation"],"pinyin":["ni2","ne5"],"word":"呢"},{"definition":["the best part of the show is yet to come\/(with ironic tone) the worst is yet to come\/you ain't seen nothin' yet"],"pinyin":["hao3 xi4 hai2 zai4 hou4 tou5"],"word":"好戏还在后头"},{"definition":["to take a look at\/to examine\/to survey\/(coll.) pretty soon"],"pinyin":["kan4 kan5"],"word":"看看"},{"definition":["the result (becomes apparent)\/now one understands"],"pinyin":["fen1 xiao3"],"word":"分晓"},{"definition":["to announce publicly\/to publish\/to make known\/to disclose"],"pinyin":["jie1 xiao3"],"word":"揭晓"},{"definition":["dark horse\/fig. unexpected winner"],"pinyin":["hei1 ma3"],"word":"黑马"},{"definition":["to amaze the world with a single brilliant feat (idiom); an overnight celebrity"],"pinyin":["yi1 ming2 jing1 ren2"],"word":"一鸣惊人"},{"definition":["tomorrow"],"pinyin":["ming2 tian1"],"word":"明天"},{"definition":["finally\/in the end\/when all is said and done\/after all\/to the end\/to the last"],"pinyin":["dao4 di3"],"word":"到底"},{"definition":["lit. to return in a swirl of dust (idiom)\/fig. to regroup and come back even stronger\/to make a comeback"],"pinyin":["juan3 tu3 chong2 lai2"],"word":"卷土重来"},{"definition":["great heroes pursue deer in the central plains (idiom); fig. many vie for supremacy"],"pinyin":["qun2 xiong2 zhu2 lu4"],"word":"群雄逐鹿"}]}