{"definition":["to arrest\/to capture\/to seize\/to win (a set, a game etc)"],"pinyin":["na2 xia4"],"traditional":["拿下"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"拿下","characters":[{"definition":["to hold\/to seize\/to catch\/to apprehend\/to take\/(used in the same way as 把[ba3]: to mark the following noun as a direct object)","old variant of 拿[na2]","variant of 拿[na2]"],"pinyin":["na2","na2","na2"],"word":"拿"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[{"english":"Unscrew the burnt ones and replace them with the good ones.","chinese":"拿下那些烧坏了的，再换上好的。"},{"english":"'There's a real small chance but it's still a must-win game.","chinese":"可能性确实不大，但是我们必须拿下。"},{"english":"Bynum had 18 points and 13 rebounds for Los Angeles.","chinese":"拜纳姆拿下了18分13个篮板。"},{"english":"That the 32 points Kobe Bryant hung on them three days earlier would have been convincing enough.","chinese":"三天前拿下32分的科比已经令人心悦诚服了。"},{"english":"He was confident on their own can also win city huoshan, then ordered the attack.","chinese":"他自信靠自己的力量也能拿下霍山城，于是命令进攻。"},{"english":"Irrefutable evidence, we had the last one day every stronghold.","chinese":"铁证如山，我方一举拿下最后一个日伪据点。"},{"english":"Radmanovic added eight points in the third, including two 3-pointers.","chinese":"拉德马诺维奇在第三节拿下8分，其中有两个3分球。"},{"english":"Corey Maggette scored 23 points and Tim Thomas had 20 for the Clippers.","chinese":"马盖蒂，托马斯为快船分别拿下了23及20分。"},{"english":"Faulcon jumped up and took a pencil stub down from his shelf .","chinese":"富尔康跳了起来，从他那架子上拿下了一个铅笔头儿。"},{"english":"After serving out the first set, Li broke in the opening game of the second set.","chinese":"拿下第一盘之后，李娜在第二盘破发对手一个发球局。"},{"english":"Odom also had 11rebounds for his fifth consecutive double-double.","chinese":"奥多姆拿下11个篮板，连续第五个两双。"},{"english":"The least we can do now is win against Mainz on Saturday.","chinese":"现在我们可以做的就是本周六拿下美因茨队。"},{"english":"He took down a dictionary from the top shelf.","chinese":"他从书架顶格拿下了一本词典。"},{"english":"What was sweeter: winning your first title or beating Liverpool in the cup final?","chinese":"拿下第一个联赛冠军和刷马桶哪个更爽一点？"},{"english":"He took down a heavy brown volume from his shelves.","chinese":"他从书架上拿下一本很厚的棕色书皮的书。"},{"english":"I could see them winning 57, 58 (games).","chinese":"我认为他们可以拿下57胜或者58胜。"}],"related":[{"definition":["person\/number of people\/(per) capita\/(a person's) head\/(Tw) person whose identity is used by sb else (e.g. to create a bogus account)"],"pinyin":["ren2 tou2"],"word":"人头"},{"definition":["to defeat\/to beat"],"pinyin":["ji1 bai4"],"word":"击败"},{"definition":["victory\/CL:個|个[ge4]"],"pinyin":["sheng4 li4"],"word":"胜利"},{"definition":["to take (after a struggle)\/to wrest\/to seize\/to capture\/to win (a trophy)"],"pinyin":["duo2 de2"],"word":"夺得"},{"definition":["highland\/upland"],"pinyin":["gao1 di4"],"word":"高地"},{"definition":["to pull back\/to regain (one's dignity etc)\/to recover from (an adverse situation)\/to turn the tables"],"pinyin":["ban1 hui2"],"word":"扳回"},{"definition":["to make a comeback\/(of a doctor's assessment of the gender of a fetus) to turn out to be wrong"],"pinyin":["fan1 pan2"],"word":"翻盘"},{"definition":["to prevail\/to achieve victory\/to be victorious"],"pinyin":["qu3 de2 sheng4 li4"],"word":"取得胜利"},{"definition":["a move\/an action\/in one move\/at a stroke\/in one go"],"pinyin":["yi1 ju3"],"word":"一举"},{"definition":["to rely on\/to depend on\/by means of\/thanks to\/sth that one relies on"],"pinyin":["ping2 jie4"],"word":"凭借"},{"definition":["match point (tennis etc)"],"pinyin":["sai4 dian3"],"word":"赛点"},{"definition":["victorious\/to win\/to triumph"],"pinyin":["huo4 sheng4"],"word":"获胜"},{"definition":["midway\/mediocre (quality)\/midfield (soccer)"],"pinyin":["zhong1 lu4"],"word":"中路"},{"definition":["opening (chess etc)\/early stage of game, match, work, activity etc"],"pinyin":["kai1 ju2"],"word":"开局"},{"definition":["lit. no blood on the men's swords (idiom); fig. an effortless victory"],"pinyin":["bing1 bu4 xue4 ren4"],"word":"兵不血刃"},{"definition":["to prevail over\/to defeat\/to surmount"],"pinyin":["zhan4 sheng4"],"word":"战胜"}]}