{"definition":["the attitude of mechanically borrowing (ideas etc)"],"pinyin":["na2 lai2 zhu3 yi4"],"traditional":["拿來主義"],"rank":34003.0,"normalized_rank":0.4757460859345487,"fraction":6.618625601920003e-7,"cumulative_fraction":0.9934170647600276,"word":"拿来主义","characters":[{"definition":["to hold\/to seize\/to catch\/to apprehend\/to take\/(used in the same way as 把[ba3]: to mark the following noun as a direct object)","old variant of 拿[na2]","variant of 拿[na2]"],"pinyin":["na2","na2","na2"],"word":"拿"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"来"},{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["yi4","Yi4"],"word":"义"}],"containing_words":[],"sentences":[{"english":"This article to \"brings the principle\" a word proverb newly to say.","chinese":"本文对“拿来主义”一词老话新说。"},{"english":"In regards to foreign popular culture, I always take it and use it.","chinese":"始终是用拿来主义的态度接受的。"}],"related":[{"definition":["to copy\/to imitate"],"pinyin":["zhao4 ban1"],"word":"照搬"},{"definition":["to pick up what others say (idiom); to pass off other people's opinions as one's own\/to parrot"],"pinyin":["shi2 ren2 ya2 hui4"],"word":"拾人牙慧"},{"definition":["to copy word for word"],"pinyin":["zhao4 chao1"],"word":"照抄"},{"definition":["lit. to build a cart behind closed doors\/to be overly subjective and disregard the outside world (idiom)"],"pinyin":["bi4 men2 zao4 che1"],"word":"闭门造车"},{"definition":["to draw on (others' experience)\/to learn from (how others do things)\/lesson to be learned (by observing others)"],"pinyin":["jie4 jian4"],"word":"借鉴"},{"definition":["lit. drawing a tiger using a cat as a model (idiom); fig. to follow a model and get things more or less right but without capturing the spirit of the subject\/uninspired imitation"],"pinyin":["zhao4 mao1 hua4 hu3"],"word":"照猫画虎"},{"definition":["\"learn from the foreigners in order to gain command of them\", idea advocated by Wei Yuan 魏源[Wei4 Yuan2]"],"pinyin":["shi1 yi2 chang2 ji4 yi3 zhi4 yi2"],"word":"师夷长技以制夷"},{"definition":["lit. new wine in old bottles; fig. new concepts in an old framework\/(loan idiom from Matthew 9:17, but fig. meaning is opposite)"],"pinyin":["jiu4 ping2 zhuang1 xin1 jiu3"],"word":"旧瓶装新酒"},{"definition":["to try to draw a tiger but end up with a likeness of a dog (idiom)\/to try to do sth overambitious and end up botching it"],"pinyin":["hua4 hu3 bu4 cheng2 fan3 lei4 quan3"],"word":"画虎不成反类犬"},{"definition":["lit. to draw a dipper with a gourd as a model (idiom)\/fig. to copy slavishly"],"pinyin":["zhao4 hu2 lu5 hua4 piao2"],"word":"照葫芦画瓢"},{"definition":["to take the best\/to absorb the essence"],"pinyin":["qu3 qi2 jing1 hua2"],"word":"取其精华"},{"definition":["book worship\/bookishness"],"pinyin":["ben3 ben3 zhu3 yi4"],"word":"本本主义"},{"definition":["market access in return for technology transfer (PRC policy since the 1980s which gives foreign companies access to China's domestic market in exchange for sharing their intellectual property, characterized by the US in the 2019 trade war as \"forced technology transfer\")"],"pinyin":["shi4 chang3 huan4 ji4 shu4"],"word":"市场换技术"},{"definition":["to revere everything foreign and pander to overseas powers (idiom); blind worship of foreign goods and ideas"],"pinyin":["chong2 yang2 mei4 wai4"],"word":"崇洋媚外"},{"definition":["to take an alternate route (idiom)\/to find an alternative\/to take a different approach\/to blaze a new trail"],"pinyin":["ling4 pi4 xi1 jing4"],"word":"另辟蹊径"},{"definition":["stuck in the old ways (idiom); refusing to acknowledge new ideas\/stagnating and conservative"],"pinyin":["gu4 bu4 zi4 feng1"],"word":"故步自封"}]}