{"definition":["to pick up"],"pinyin":["na2 qi3"],"traditional":["拿起"],"rank":6716.0,"normalized_rank":0.09396555342576918,"fraction":0.000015708214493731932,"cumulative_fraction":0.8922001645050195,"word":"拿起","characters":[{"definition":["to hold\/to seize\/to catch\/to apprehend\/to take\/(used in the same way as 把[ba3]: to mark the following noun as a direct object)","old variant of 拿[na2]","variant of 拿[na2]"],"pinyin":["na2","na2","na2"],"word":"拿"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"Even now during my part-time, I drew some goldfish for pleasure.","chinese":"闲暇时光有时会拿起画笔，画金鱼玩。"},{"english":"He carefully picked up his pole. He felt his heart pounding.","chinese":"他小心翼翼地拿起撑竿，只觉得心怦怦在跳。"},{"english":"Sara grabs a hole-punch and smashes the glass of a nearby cabinet.","chinese":"Sara拿起一个打孔机，打碎了附近壁柜的玻璃。"},{"english":"Ashley leaves. Scarlett throws a vase to the wall in anger.","chinese":"艾希礼离开了，愤怒之中思嘉拿起一个花瓶向墙砸去。"},{"english":"Feliks gently lifted the bottle of nitroglycerine out of the sink.","chinese":"费利克斯轻轻地从水池中拿起那瓶硝化甘油。"},{"english":"Daddy picked up the paddle and started spanking Melody's bare bottom with the gentlest spanks possible.","chinese":"乔希拿起扁板，开始尽量轻的拍打米洛蒂的光屁股。"},{"english":"Each picked up a, that the taste is changed.","chinese":"每拿起一本，那味道就变了。"},{"english":"Brendan drained the rest of his glass and looked back into Tom's face, which seemed more serious now, his lips closed in a flat line.","chinese":"丹拿起杯子一饮而尽，回头看看汤姆的脸。"},{"english":"The judge took up the gavel with solemnity.","chinese":"法官严肃地拿起了小木槌。"},{"english":"There have been many people who took up meaningful hobbies in their advanced age.","chinese":"曾有不少人拿起他们年事已高有意义的业余爱好。"},{"english":"Ben picked up a notebook and started towrite Felicity a note.","chinese":"本拿起记事簿，开始给费莉希蒂写纸条。"},{"english":"Simon picked the toy up and squeezed it.","chinese":"西蒙拿起这只玩具紧紧地把它握紧。"},{"english":"Absurdly I held it and weighed it in my hand, to give myself courage.","chinese":"我可笑地拿起枪，在手里掂掂，替自己壮胆。"},{"english":"I picked up a knife, on the whole front of the microfilm into the world's gone.","chinese":"一拿起刻刀，整个人就钻进眼前那个缩微世界里去了。"},{"english":"Sometimes life hits you in the head with a brick.","chinese":"虽然命运有时候会拿起板砖，猛拍你的脑袋。"},{"english":"She picked up a new magazine with her free hand.","chinese":"她用空着的一只手拿起一本新杂志。"}],"related":[{"definition":["to take (sth proffered)"],"pinyin":["jie1 guo4"],"word":"接过"},{"definition":["on hand\/at hand"],"pinyin":["shou3 bian1"],"word":"手边"},{"definition":["to heave\/to lift\/to raise up\/to uphold"],"pinyin":["ju3 qi3"],"word":"举起"},{"definition":["to pick up"],"pinyin":["jian3 qi3"],"word":"拣起"},{"definition":["to fish out\/to take out (from a pocket, bag etc)"],"pinyin":["tao1 chu1"],"word":"掏出"},{"definition":["to lay down\/to put down\/to let go of\/to relinquish\/to set aside\/to lower (the blinds etc)"],"pinyin":["fang4 xia4"],"word":"放下"},{"definition":["conveniently\/without extra trouble\/while doing it\/in passing"],"pinyin":["sui2 shou3"],"word":"随手"},{"definition":["to pick up (from the ground with one's hands)"],"pinyin":["lin1 qi3"],"word":"拎起"},{"definition":["to cast or put aside\/to forget for a while"],"pinyin":["diu1 kai1"],"word":"丢开"},{"definition":["to take out\/to put out\/to provide\/to put forward (a proposal)\/to come up with (evidence)"],"pinyin":["na2 chu1"],"word":"拿出"},{"definition":["table\/desk\/CL:張|张[zhang1],套[tao4]"],"pinyin":["zhuo1 zi5"],"word":"桌子"},{"definition":["easily\/without trouble\/while one is at it\/in passing\/handy"],"pinyin":["shun4 shou3"],"word":"顺手"},{"definition":["to get up\/to leave\/to set forth"],"pinyin":["qi3 shen1"],"word":"起身"},{"definition":["to move back and forth\/to fiddle with"],"pinyin":["bai3 nong4"],"word":"摆弄"},{"definition":["to throw down\/to drop (bomb)"],"pinyin":["reng1 xia4"],"word":"扔下"},{"definition":["to stand up"],"pinyin":["zhan4 qi3 lai5"],"word":"站起来"}]}