{"definition":["lit. to hang up a plate\/to open up for business\/listed (on stock market)"],"pinyin":["gua4 pai2"],"traditional":["掛牌"],"rank":3378.0,"normalized_rank":0.04726260266114477,"fraction":0.00004155603494929368,"cumulative_fraction":0.8076220969173318,"word":"挂牌","characters":[{"definition":["to hang or suspend (from a hook etc)\/to hang up (the phone)\/(of a line) to be dead\/to be worried or concerned\/to make a phone call (dialect)\/to register or record\/classifier for sets or clusters of objects\/(slang) to kill\/to die\/to be finished\/to fail (an exam)"],"pinyin":["gua4"],"word":"挂"},{"definition":["mahjong tile\/playing card\/game pieces\/signboard\/plate\/tablet\/medal\/CL:片[pian4],個|个[ge4],塊|块[kuai4]"],"pinyin":["pai2"],"word":"牌"}],"containing_words":[],"sentences":[{"english":"Learn to Read the TicketMany times the price ticket contains the date or season the item arrived at the store.","chinese":"挂牌上通常都会包含物品进店的日期或是季节。"},{"english":"Listing period of adjustment may be based on competitive bids were increased price range.","chinese":"挂牌期间可根据竞买人竞价情况调整增价幅度。"},{"english":"Group of Chinese harbour construction hangs out his shingle formally hold water already two years many.","chinese":"中国港湾建设集团正式挂牌成立已经两年多了。"},{"english":"The Changsha Chamber of Commerce American Sub-chamber was officially established in Los Angeles recently.","chinese":"近日，美国长沙商会在洛杉矶正式挂牌成立。"},{"english":"Hainan, Yunnan Rubber Group, the company officially launched operations Yunnan Jinghong City.","chinese":"海南橡胶集团云南公司在云南景洪市正式挂牌运营。"},{"english":"Heron is a private company and is not quoted on the Stock Market.","chinese":"赫伦公司是一家私营公司，没有在股票交易市场挂牌。"},{"english":"Many times the price ticket contains the date or season the item arrived at the store.","chinese":"挂牌上通常都会包含物品进店的日期或是季节。"},{"english":"This is the first Zhangjiajie was listed on the five-star hotel.","chinese":"这是张家界首家获得挂牌的五星级酒店。"},{"english":"\" January 2001, \"staff of shares\" in the Shang Jiaosuo listed transactions.","chinese":"2001年1月，“红豆股份”在上交所挂牌交易。"},{"english":"Assignment System of industrial land and profit - oriented land shall be implemented strictly by means of public bidding , auction or hanging out a shingle.","chinese":"严格落实工业和经营性用地招标拍卖挂牌出让制度。"},{"english":"When an energy-isolating device cannot accept multiple locks or tags, a multiple lock-out or tag-out hasp must be used.","chinese":"当有些设备即要上锁又要挂牌时，必须又这样的工具。"},{"english":"The listing of the 21 Tsing Ai cottages, among them, a small one Wenchuan.","chinese":"此次挂牌的二十一所青艾小屋当中，有一间汶川一小。"},{"english":"The shares change hands on the Shenzhen and Shanghai exchanges, respectively.","chinese":"这些股票分别在上海和深圳证券交易所挂牌交易。"},{"english":"Listing the past year, Jiyuan City Health appearance of the changes?","chinese":"挂牌近一年来，济源市卫生面貌有何变化呢？"},{"english":"Tag-out will not be acceptable where lock-out provisions are available.","chinese":"能上锁的地方挂牌是不允许的。"},{"english":"With most products, the listed price actually means something.","chinese":"对于所有的商品来说，挂牌价格其实还是意味重大。"}],"related":[{"definition":["to delist (a traded security)\/(sports) to accept a transfer-listed player from another club"],"pinyin":["zhai1 pai2"],"word":"摘牌"},{"definition":["sampan"],"pinyin":["san1 ban3"],"word":"三板"},{"definition":["to put on record\/to file"],"pinyin":["bei4 an4"],"word":"备案"},{"definition":["to transfer (one's property or rights to sb else)"],"pinyin":["chu1 rang4"],"word":"出让"},{"definition":["to transfer (ownership, rights etc)"],"pinyin":["zhuan3 rang4"],"word":"转让"},{"definition":["post\/announcement"],"pinyin":["gong1 gao4"],"word":"公告"},{"definition":["to report (to the authorities)\/to declare (to customs)"],"pinyin":["shen1 bao4"],"word":"申报"},{"definition":["tectonic plate"],"pinyin":["di4 kuai4"],"word":"地块"},{"definition":["to hit the market (of a new product)\/to float (a company on the stock market)"],"pinyin":["shang4 shi4"],"word":"上市"},{"definition":["China Beijing Equity Exchange (CBEX)"],"pinyin":["Bei3 jing1 chan3 quan2 jiao1 yi4 suo3"],"word":"北京产权交易所"},{"definition":["Growth Enterprise Markets (GEM)"],"pinyin":["chuang4 ye4 ban3 shang4 shi4"],"word":"创业板上市"},{"definition":["Shanghai Stock Exchange (SSE)"],"pinyin":["Shang4 hai3 Zheng4 quan4 Jiao1 yi4 suo3"],"word":"上海证券交易所"},{"definition":["intercrural sex"],"pinyin":["gu3 jiao1"],"word":"股交"},{"definition":["market maker"],"pinyin":["zuo4 shi4 shang1"],"word":"做市商"},{"definition":["stock exchange"],"pinyin":["zheng4 quan4 jiao1 yi4 suo3"],"word":"证券交易所"},{"definition":["to register (one's name)"],"pinyin":["deng1 ji4"],"word":"登记"}]}