{"definition":["hook (on which to hang sth)\/to couple\/to link together\/to establish contact with\/hook\/coupling links (e.g. between two railway coaches)"],"pinyin":["gua4 gou1"],"traditional":["掛鉤"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"挂钩","characters":[{"definition":["to hang or suspend (from a hook etc)\/to hang up (the phone)\/(of a line) to be dead\/to be worried or concerned\/to make a phone call (dialect)\/to register or record\/classifier for sets or clusters of objects\/(slang) to kill\/to die\/to be finished\/to fail (an exam)"],"pinyin":["gua4"],"word":"挂"},{"definition":["to hook\/to sew\/to crochet\/hook\/check mark or tick\/window catch","variant of 鉤|钩[gou1]"],"pinyin":["gou1","gou1"],"word":"钩"}],"containing_words":[{"definition":["erhua variant of 掛鉤|挂钩[gua4 gou1]"],"pinyin":["gua4 gou1 'r"],"word":"挂钩儿"}],"sentences":[{"english":"Others issued currencies linked to the price of rye.","chinese":"其他州的货币与黑麦价格挂钩。"},{"english":"Bends and hooks do not contribute to compression anchorages.","chinese":"弯曲和挂钩无助于压缩锚地。"},{"english":"Our factory practises direct linking of production and sales, thus ensuring supply of goods.","chinese":"本厂实行产销直接挂钩，保证供应。"},{"english":"He took off his hat and shawl and went to the rack to hang them up .","chinese":"他脱去帽子和围巾，走到挂钩前，要把它们挂起来。"},{"english":"Usually only bonuses and long-term incentive plans are tied to results.","chinese":"通常情况下，只有奖金和长期激励才和业绩挂钩。"},{"english":"Self-punishment and the voluntary expression of the self are bound together.","chinese":"自我惩罚跟自我的自愿表达，密切挂钩。"},{"english":"The medal links are transformed from Chinese traditional double-dragon Puwen semi-circular jade.","chinese":"奖牌挂钩由中国传统玉双龙蒲纹璜演变而成。"},{"english":"The post-startup and pre-shutdown hooks are blank by default.","chinese":"启动后和关闭前挂钩在默认情况下是空的。"},{"english":"Defining hooks for standard events.","chinese":"定义标准事件的挂钩。"},{"english":"We instituted a mechanism to increase social aid and social security benefits when consumer prices rise.","chinese":"建立社会救助和保障标准与物价上涨挂钩的联动机制。"},{"english":"The picture won't stop up long if you use one of those weak hooks.","chinese":"你用的那个挂钩不结实，画挂不久就会掉下来。"},{"english":"Keep the tree from toppling by tying it to a ceiling hook.","chinese":"将树顶端固定在房顶的挂钩上，以避免树倾倒。"},{"english":"He's not about to let mankind off the hook with Judgment Day.","chinese":"他并不打算让人类从审判日的挂钩上下来。"},{"english":"Winch upgrade, load and a set of dual-reflector system link.","chinese":"有提升绞盘，负载反光镜和一套双挂钩系统。"},{"english":"The designer host is the hook into the design-time environment.","chinese":"设计器宿主是到设计时环境的挂钩。"},{"english":"A framework is larger grained than just a single class, typically. Also, you hook into frameworks by subclassing somewhere.","chinese":"通常你通过在某个例子子类化来与框架挂钩。"}],"related":[{"definition":["to cut ties\/to disconnect\/out of touch"],"pinyin":["tuo1 gou1"],"word":"脱钩"},{"definition":["to fix\/to fasten\/to set rigidly in place\/fixed\/set\/regular"],"pinyin":["gu4 ding4"],"word":"固定"},{"definition":["incentive mechanism\/motivation method"],"pinyin":["ji1 li4 ji1 zhi4"],"word":"激励机制"},{"definition":["closely bound up (idiom); intimately related"],"pinyin":["xi1 xi1 xiang1 guan1"],"word":"息息相关"},{"definition":["height\/altitude (aviation)\/pitch (music)\/ups and downs (success or failure)\/whether sth is right or wrong\/comparative strength, weight, depth, stature\/(spoken interjection) anyway, whatever\/eventually, in the end"],"pinyin":["gao1 di1"],"word":"高低"},{"definition":["equal status\/equal treatment\/parity (under the law)\/equity\/reciprocity"],"pinyin":["dui4 deng3"],"word":"对等"},{"definition":["coefficient\/factor\/modulus\/ratio"],"pinyin":["xi4 shu4"],"word":"系数"},{"definition":["closely related"],"pinyin":["mi4 qie4 xiang1 guan1"],"word":"密切相关"},{"definition":["whether or not (at the end of a phrase)"],"pinyin":["yu3 fou3"],"word":"与否"},{"definition":["too low"],"pinyin":["guo4 di1"],"word":"过低"},{"definition":["length\/duration\/accident\/right and wrong\/good and bad\/long and short"],"pinyin":["chang2 duan3"],"word":"长短"},{"definition":["to bind"],"pinyin":["kun3 bang3"],"word":"捆绑"},{"definition":["equal to\/having the same social class or status"],"pinyin":["tong2 deng3"],"word":"同等"},{"definition":["to reward\/reward (as encouragement)"],"pinyin":["jiang3 li4"],"word":"奖励"},{"definition":["greater than\/to exceed"],"pinyin":["gao1 yu2"],"word":"高于"},{"definition":["both sides"],"pinyin":["liang3 zhe3"],"word":"两者"}]}