{"definition":["to indicate\/to point out"],"pinyin":["zhi3 chu1"],"traditional":["指出"],"rank":553.0,"normalized_rank":0.007737187469394038,"fraction":0.0002740243838835326,"cumulative_fraction":0.5275189468547816,"word":"指出","characters":[{"definition":["finger\/to point at or to\/to indicate or refer to\/to depend on\/to count on\/(of hair) to stand on end"],"pinyin":["zhi3"],"word":"指"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"It is worth noting that the monohydrate is not mentioned in the literature.","chinese":"值得指出的是，在本文献中没有提到一水化物。"},{"english":"Just show me one county where Dr. Sun's principles have been put in practice.","chinese":"你给我指出哪一个县实施了孙中山先生的三民主义？"},{"english":"Eventually it puts forward the focus of studying V-based solid solution type hydrogen stora…","chinese":"指出了今后钒基固溶体型贮氢材料应用研究的重点。"},{"english":"Mr Zorin says this kind of social engineering is the key to understanding today's problem.","chinese":"佐林指出这种社会工程是理解俄罗斯现有问题的关键。"},{"english":"And \"sexsomnia\" disorders are easily treated with medication, he added.","chinese":"申克还指出，性行为睡眠障碍用药物治疗很方便。"},{"english":"Shi Xing pain Chen interests, points out the consequences of the Japanese occupation of Korea will bring.","chinese":"石星痛陈利害，指出了日军占领朝鲜会带来的恶果。"},{"english":"This article explains the problems and countermeasures of the examples in CNKI system.","chinese":"指出了CNKI系统中存在的问题及对策。"},{"english":"Bokova that media facilities should not be the target of military operations.","chinese":"博科娃指出，媒体设施不应当成为军事行动的目标。"},{"english":"Connection among quasi-H closedness, weakly continuous mapping and compactness is also shown.","chinese":"并指出了拟H闭性与弱连续映射和紧性的联系。"},{"english":"It is point out that the fluctuation of structure function lead to nonlinear scaling law.","chinese":"指出结构函数的振荡涨落导致非线性标度律。"},{"english":"He points to other bars he considers better-looking.","chinese":"他给我指出一些他认为好看的。"},{"english":"The Russian Defense Ministry dismissed claims of the airport bombing as disinformation .","chinese":"俄国防部指出关于轰炸机场的消息并不属实。"},{"english":"Other good security characteristic of one-time pad is pointed out at the same time.","chinese":"同时指出一次一密体制依然具有很好的安全特性。"},{"english":"It is indicated that it is an interested problem on the use of polyester bottle in packing beer.","chinese":"指出研制灌装啤酒用聚酯瓶是近年的一个热门课题。"},{"english":"Critics argue this stunt is hostile to the Catholic Church.","chinese":"批语家指出这样的惊人表演是对天主教堂的不敬重。"},{"english":"During his speech he pointed out the 3 root reasons for why Chinese are not good at communication.","chinese":"吴建民指出，“中国人不大会交流”有三个根本原因。"}],"related":[{"definition":["to express\/to show\/to say\/to state\/to indicate\/to mean"],"pinyin":["biao3 shi4"],"word":"表示"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"认为"},{"definition":["to emphasize (a statement)\/to stress"],"pinyin":["qiang2 diao4"],"word":"强调"},{"definition":["to raise (an issue)\/to propose\/to put forward\/to suggest\/to post (on a website)\/to withdraw (cash)"],"pinyin":["ti2 chu1"],"word":"提出"},{"definition":["to mention\/to raise (a subject)\/to refer to"],"pinyin":["ti2 dao4"],"word":"提到"},{"definition":["variant of 秤[cheng4]\/steelyard","to weigh\/to state\/to name\/name\/appellation\/to praise","to fit\/balanced\/suitable"],"pinyin":["cheng4","cheng1","chen4"],"word":"称"},{"definition":["to quote\/to cite\/to recommend (one's friend's, associates etc)"],"pinyin":["yuan2 yin3"],"word":"援引"},{"definition":["clear-cut\/definite\/explicit\/to clarify\/to specify\/to make definite"],"pinyin":["ming2 que4"],"word":"明确"},{"definition":["to make clear\/to make known\/to state clearly\/to indicate\/known"],"pinyin":["biao3 ming2"],"word":"表明"},{"definition":["to claim\/to state\/to proclaim\/to assert"],"pinyin":["sheng1 cheng1"],"word":"声称"},{"definition":["besides\/in addition\/moreover\/furthermore"],"pinyin":["ci3 wai4"],"word":"此外"},{"definition":["to inform\/to report\/to make known\/report\/speech\/talk\/lecture\/CL:篇[pian1],份[fen4],個|个[ge4],通[tong4]"],"pinyin":["bao4 gao4"],"word":"报告"},{"definition":["to declare one's position\/to say where one stands"],"pinyin":["biao3 tai4"],"word":"表态"},{"definition":["in fact\/in reality\/actually\/as a matter of fact\/de facto\/ipso facto"],"pinyin":["shi4 shi2 shang4"],"word":"事实上"},{"definition":["in view of\/seeing that\/considering\/whereas"],"pinyin":["jian4 yu2"],"word":"鉴于"},{"definition":["to formulate\/enunciation\/to explain sth precisely"],"pinyin":["biao3 shu4"],"word":"表述"}]}