{"definition":["to guide\/to show\/to point (the way)\/directions\/guidance\/guidelines"],"pinyin":["zhi3 yin3"],"traditional":["指引"],"rank":6094.0,"normalized_rank":0.0852629664348775,"fraction":0.00001813450862980411,"cumulative_fraction":0.8817164660662343,"word":"指引","characters":[{"definition":["finger\/to point at or to\/to indicate or refer to\/to depend on\/to count on\/(of hair) to stand on end"],"pinyin":["zhi3"],"word":"指"},{"definition":["to draw (e.g. a bow)\/to pull\/to stretch sth\/to extend\/to lengthen\/to involve or implicate in\/to attract\/to lead\/to guide\/to leave\/to provide evidence or justification for\/old unit of distance equal to 10 丈[zhang4], one-thirtieth of a km or 33.33 meters"],"pinyin":["yin3"],"word":"引"}],"containing_words":[],"sentences":[{"english":"The Way of the Dragon God believes that the heart, more than anything else, points the way forward.","chinese":"龙神道相信指引方向的最大力量莫过于心。"},{"english":"In peripheral equipment sticked hang \"homework manipulate guidance\".","chinese":"在周边设备上贴挂“功课操纵指引”。"},{"english":"This has led to a more comprehensive neurobiological paradigm for the system of cognitive therapy.","chinese":"指引着认知治疗系统更全面的神经生物学范式。"},{"english":"You would just walk along that path, and it will get you there without effort.","chinese":"你只要沿着那条路，它将会指引你到达那里。"},{"english":"Listen to your heart for guidance.","chinese":"听从你的内心，以此为指引。"},{"english":"Guided by their sense of smell, they will return in a few years to  spawn.","chinese":"在其嗅觉的指引下，几年后它们会回到这里产卵。"},{"english":"In his heart a man plans his course, but the Lord determines his steps.","chinese":"人心筹算自己的道路，惟耶和华指引他的脚步。"},{"english":"The ideas of Marxism-Leninism point the way to victory.","chinese":"马克思列宁主义思想指引著通向胜利的道路。"},{"english":"Motivation provides learners with the impetus to create and sustain intentions and goal-seeking acts.","chinese":"动机是为学习者提供动力和指引方向的一系列因素。"},{"english":"Motivation Forces that energize, direct, and sustain a person's efforts.","chinese":"鼓舞，指引和维持个人努力行为的驱动力。"},{"english":"They will still ignite the innovation process.","chinese":"它们仍然指引着创新的全过程。"},{"english":"The results of the study can contribute to the promotion of breastfeeding.","chinese":"本研究结果可为提升母奶哺喂措施提供指引。"},{"english":"The nation looks to them for guidance .","chinese":"全国民众期待他们能够指引方向。"},{"english":"The European startup provides how-to guides in English and Spanish.","chinese":"欧洲人开始提供英语和西班牙语的指引指南。"},{"english":"You who travel with the wind, what weathervane shall direct your course?","chinese":"你是随风旅行的人，什么风向将会指引你该走了路呢？"},{"english":"The asterisk refers the reader to a footnote.","chinese":"星号指引读者去查阅脚注。"}],"related":[{"definition":["to guide\/to lead (around)\/to conduct\/to boot\/introduction\/primer"],"pinyin":["yin3 dao3"],"word":"引导"},{"definition":["to show clearly\/to designate\/to indicate"],"pinyin":["zhi3 ming2"],"word":"指明"},{"definition":["(literary) to go forward"],"pinyin":["qian2 xing2"],"word":"前行"},{"definition":["path\/route\/method\/ways and means"],"pinyin":["lu4 jing4"],"word":"路径"},{"definition":["to point out\/to indicate\/to instruct\/directives\/instructions\/CL:個|个[ge4]"],"pinyin":["zhi3 shi4"],"word":"指示"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引领"},{"definition":["to go forward\/to forge ahead\/to advance\/onward"],"pinyin":["qian2 jin4"],"word":"前进"},{"definition":["to guide\/to give directions\/to direct\/to coach\/guidance\/tuition\/CL:個|个[ge4]"],"pinyin":["zhi3 dao3"],"word":"指导"},{"definition":["to drive\/to propel\/drive (vehicle wheel)\/drive mechanism (tape or disk)\/device driver (computing software)"],"pinyin":["qu1 dong4"],"word":"驱动"},{"definition":["route map\/roadmap (also fig.)"],"pinyin":["lu4 xian4 tu2"],"word":"路线图"},{"definition":["to pull\/to draw (a cart)\/to tow"],"pinyin":["qian1 yin3"],"word":"牵引"},{"definition":["to encourage\/to urge\/motivation\/incentive"],"pinyin":["ji1 li4"],"word":"激励"},{"definition":["mission\/long-term task to which one devotes oneself\/a calling"],"pinyin":["shi3 ming4"],"word":"使命"},{"definition":["to look for\/to seek\/to find fault"],"pinyin":["zhao3 xun2"],"word":"找寻"},{"definition":["to seek\/to look for"],"pinyin":["xun2 zhao3"],"word":"寻找"},{"definition":["to illuminate\/to light up\/lighting"],"pinyin":["zhao4 liang4"],"word":"照亮"}]}