{"definition":["to show clearly\/to designate\/to indicate"],"pinyin":["zhi3 ming2"],"traditional":["指明"],"rank":14763.0,"normalized_rank":0.20655352370825347,"fraction":0.000004262984637249005,"cumulative_fraction":0.9580367900940302,"word":"指明","characters":[{"definition":["finger\/to point at or to\/to indicate or refer to\/to depend on\/to count on\/(of hair) to stand on end"],"pinyin":["zhi3"],"word":"指"},{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"}],"containing_words":[{"definition":["concise but unambiguous (idiom)"],"pinyin":["ci2 yue1 zhi3 ming2"],"word":"词约指明"}],"sentences":[{"english":"Some reserves were named to cover the possibility of withdrawals.","chinese":"已指明一些替补队员，为可能有人退出比赛作准备。"},{"english":"It gives developers direction as to where the changes should occur.","chinese":"它向开发人员指明变更将在哪里发生的方向。"},{"english":"Circulation areas and storage areas will be indicated on the site installation drawing.","chinese":"周转区域和仓储区域需在现场安装图上指明。"},{"english":"It indicates that the annotated method is overriding a method in a superclass.","chinese":"它指明注释的方法将覆盖超类中的方法。"},{"english":"I'm again, saying print argument's new line.","chinese":"我再次指明，打印参数的新行。"},{"english":"It pinpoints the \"current position\" on the screen.","chinese":"它指明屏幕上的“当前位置”。"},{"english":"Forth argument stands for the length of the variable and the fifth one specifies the value of the parameter.","chinese":"笼四上参数代表变量的长度，第5个指明参数的值。"},{"english":"River channels indicate a weak point in the crust, a point where pulling apart is most likely to happen.","chinese":"河道指明了地壳的薄弱点，那里最可能发生撕裂。"},{"english":"A hovering mar-of-war bird showed him where dolphin were chasing some flying fish.","chinese":"鸟给他指明了海豚追逐飞鱼的地方。"},{"english":"The report does not specify the brand names of any formula tested.","chinese":"这份报告并未指明经检测的产品的商标。"},{"english":"The policy also states that tattoos must be covered.","chinese":"规定还指明，纹身必须被衣物所覆盖。"},{"english":"THE Bible designates two things which are at absolute enmity with God.","chinese":"圣经指明了两件完全与上帝为敌的事。"},{"english":"I must point out that further delay would be unwise.","chinese":"我必须指明再延误就要吃大亏了。"},{"english":"Will people be discouraged if we point out this backwardness as an objective fact?","chinese":"如实地指明这种落后状况，会不会使人们失去信心呢？"},{"english":"It shall BE duly executed by or on BEhalf of each mortgagor in the specified manner.","chinese":"须由每名抵押人或其代表按指明方式妥为签立。"},{"english":"They found a 24-fold rise in adenosine, which seemed promising.","chinese":"他们发现，腺苷增加了24倍，这似乎指明了方向。"}],"related":[{"definition":["to guide\/to show\/to point (the way)\/directions\/guidance\/guidelines"],"pinyin":["zhi3 yin3"],"word":"指引"},{"definition":["to elucidate\/to explain clearly\/to expound"],"pinyin":["chan3 ming2"],"word":"阐明"},{"definition":["to point out"],"pinyin":["dian3 ming2"],"word":"点明"},{"definition":["the objects indicated\/as pointed out"],"pinyin":["suo3 zhi3"],"word":"所指"},{"definition":["clear-cut\/definite\/explicit\/to clarify\/to specify\/to make definite"],"pinyin":["ming2 que4"],"word":"明确"},{"definition":["path\/route\/method\/ways and means"],"pinyin":["lu4 jing4"],"word":"路径"},{"definition":["to point out\/to indicate\/to instruct\/directives\/instructions\/CL:個|个[ge4]"],"pinyin":["zhi3 shi4"],"word":"指示"},{"definition":["to give directions"],"pinyin":["zhi3 lu4"],"word":"指路"},{"definition":["to hint\/to suggest\/suggestion\/hint"],"pinyin":["an4 shi4"],"word":"暗示"},{"definition":["clear\/well-defined\/limpid"],"pinyin":["ming2 xi1"],"word":"明晰"},{"definition":["to reveal\/to enlighten\/enlightenment\/revelation\/illumination\/moral (of a story etc)\/lesson"],"pinyin":["qi3 shi4"],"word":"启示"},{"definition":["route map\/roadmap (also fig.)"],"pinyin":["lu4 xian4 tu2"],"word":"路线图"},{"definition":["to infer\/to judge\/inference\/judgment\/conclusion"],"pinyin":["lun4 duan4"],"word":"论断"},{"definition":["to point towards\/aimed at\/facing\/the direction indicated"],"pinyin":["zhi3 xiang4"],"word":"指向"},{"definition":["a way out (lit. and fig.)\/opportunity for advancement\/a way forward\/outlet (for one's products)"],"pinyin":["chu1 lu4"],"word":"出路"},{"definition":["to pass on\/to convey\/to relay\/to transmit\/transmission"],"pinyin":["chuan2 da2"],"word":"传达"}]}