{"definition":["making a deer out to be a horse (idiom); deliberate misrepresentation"],"pinyin":["zhi3 lu4 wei2 ma3"],"traditional":["指鹿為馬"],"rank":48990.0,"normalized_rank":0.6854336602633162,"fraction":1.6072136717498733e-7,"cumulative_fraction":0.9988061870847336,"word":"指鹿为马","characters":[{"definition":["finger\/to point at or to\/to indicate or refer to\/to depend on\/to count on\/(of hair) to stand on end"],"pinyin":["zhi3"],"word":"指"},{"definition":["deer"],"pinyin":["lu4"],"word":"鹿"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"},{"definition":["horse\/CL:匹[pi3]\/horse or cavalry piece in Chinese chess\/knight in Western chess","surname Ma\/abbr. for Malaysia 馬來西亞|马来西亚[Ma3 lai2 xi1 ya4]"],"pinyin":["ma3","Ma3"],"word":"马"}],"containing_words":[],"sentences":[{"english":"You might have heard the saying a camel is a horse designed by committee.","chinese":"你可能曾经听说过委员会设计过一个指鹿为马的故事。"},{"english":"Lomborg pretends otherwise because he disagrees with the priorities they set.","chinese":"隆伯格指鹿为马，只不过因为他反对别人订定的顺序。"},{"english":"But why is this era of taking rubbish to be cream still far from its end?","chinese":"但是为什么指鹿为马的时代仍然没有结束？"},{"english":"Interpreting is not the same as reviewing a work of art;","chinese":"所谓指鹿为马，今日是处处一现实。"}],"related":[{"definition":["lit. to invert black and white (idiom); to distort the truth deliberately\/to misrepresent the facts\/to invert right and wrong"],"pinyin":["dian1 dao3 hei1 bai2"],"word":"颠倒黑白"},{"definition":["to confuse black and white\/to say that black is white\/fig. not to distinguish right from wrong"],"pinyin":["hun4 xiao2 hei1 bai2"],"word":"混淆黑白"},{"definition":["to confuse right and wrong (idiom)"],"pinyin":["hun4 xiao2 shi4 fei1"],"word":"混淆是非"},{"definition":["to invert right and wrong"],"pinyin":["dian1 dao3 shi4 fei1"],"word":"颠倒是非"},{"definition":["three men talking makes a tiger (idiom); repeated rumor becomes a fact"],"pinyin":["san1 ren2 cheng2 hu3"],"word":"三人成虎"},{"definition":["lit. public opinion is powerful enough to melt metal (idiom)\/fig. public clamor can obscure the actual truth\/mass spreading of rumors can confuse right and wrong"],"pinyin":["zhong4 kou3 shuo4 jin1"],"word":"众口铄金"},{"definition":["to speak off the cuff\/to casually opine"],"pinyin":["xin4 kou3 ci2 huang2"],"word":"信口雌黄"},{"definition":["lit. to graft flowers onto a tree\/to surreptitiously substitute one thing for another (idiom)"],"pinyin":["yi2 hua1 jie1 mu4"],"word":"移花接木"},{"definition":["to cover up one's faults (idiom)\/to whitewash"],"pinyin":["wen2 guo4 shi4 fei1"],"word":"文过饰非"},{"definition":["to obscure the facts (idiom); to mislead the public with prevarication and deliberate falsehoods"],"pinyin":["hun4 xiao2 shi4 ting1"],"word":"混淆视听"},{"definition":["can't tell black from white (idiom); unable to distinguish wrong from right"],"pinyin":["hei1 bai2 bu4 fen1"],"word":"黑白不分"},{"definition":["lit. a thief crying \"Stop the thief!\" (idiom)\/fig. to accuse sb of a theft and try to sneak away oneself\/to cover up one's misdeeds by shifting the blame onto others"],"pinyin":["zei2 han3 zhuo1 zei2"],"word":"贼喊捉贼"},{"definition":["lit. a monkey wearing a hat (idiom)\/fig. worthless person in imposing attire"],"pinyin":["mu4 hou2 er2 guan4"],"word":"沐猴而冠"},{"definition":["to be glib in one's speech and wear an ingratiating expression (idiom)"],"pinyin":["qiao3 yan2 ling4 se4"],"word":"巧言令色"},{"definition":["to pass the misfortune on to sb else (idiom); to blame others\/to pass the buck"],"pinyin":["jia4 huo4 yu2 ren2"],"word":"嫁祸于人"},{"definition":["lit. the fox exploits the tiger's might (idiom); fig. to use powerful connections to intimidate people"],"pinyin":["hu2 jia3 hu3 wei1"],"word":"狐假虎威"}]}