{"definition":["a mortgage (loanword via Cantonese)\/to buy property on a mortgage"],"pinyin":["an4 jie1"],"traditional":["按揭"],"rank":5934.0,"normalized_rank":0.08302435884879605,"fraction":0.000018845273694994853,"cumulative_fraction":0.8787603400024065,"word":"按揭","characters":[{"definition":["to press\/to push\/to leave aside or shelve\/to control\/to restrain\/to keep one's hand on\/to check or refer to\/according to\/in the light of\/(of an editor or author) to make a comment"],"pinyin":["an4"],"word":"按"},{"definition":["to take the lid off\/to expose\/to unmask"],"pinyin":["jie1"],"word":"揭"}],"containing_words":[],"sentences":[{"english":"Tell your friends and relatives about Excellent's free mortgage referral and consulting services.","chinese":"告诉你的亲友们有关卓誉的免费按揭转介及谘询服务。"},{"english":"Or find out that you're six months behind on your mortgage payment?","chinese":"或者发现你的按揭付款已经超期六个月了？"},{"english":"Reinstatement cost of the building or mortgaged loan amount required by the Bank.","chinese":"楼宇建筑之重建费或银行指定之按揭金额。"},{"english":"Also, the developer will offer another ten percent mortgage to purchasers.","chinese":"开发商可提供一成的按揭给认购者。"},{"english":"Some homeowners are delinquent, or unable to make the payments on costly, exotic mortgages they took out during the boom.","chinese":"一些屋主拖欠债务，或者无力支付高额的按揭款。"},{"english":"When you remortgage you are ending your old mortgage deal and switching to a new one.","chinese":"当你结束你的老转你转按揭交易和新车。"},{"english":"They have little motivation to refinance commercial real-estate loans.","chinese":"它们没有多少动力对商业房地产贷款进行转按揭。"},{"english":"Finally, it discusses the validity of Louhua mortgage.","chinese":"最后，讨论了楼花按揭的效力问题。"},{"english":"You would choose a remortgage because it allows you to change your mortgage without moving your home.","chinese":"你会选择，因为它允许你转按揭动你改变你的家。"},{"english":"It is understood that this was the first domestic - type housing mortgage finance varieties.","chinese":"据了解，这是国内首个理财型住房按揭品种。"},{"english":"I make people happy all day with foreclosures.","chinese":"我成天都在取消按揭回赎权，这让人们很高兴。"},{"english":"Now I am saving thousands with my new refinanced mortgage.","chinese":"现在我与我的新转按揭节省数千。"},{"english":"The mortgage guarantee insurance of housing has been in dispute since it was adopted in China.","chinese":"住房按揭保证保险是一项备受争议的险种。"},{"english":"The meaning and legal characteristics of mortgage; purchasing house by means of mortgage is guaranteed by hypothec of the target house.","chinese":"按揭购房是以房屋本身设立抵押权为保证的。"},{"english":"First , for pre - sale mortgage real estate mortgage and real estate.","chinese":"第一，对于预售商品房按揭与不动产抵押。"},{"english":"Using mortgage purchases at the highest price, it is also our wage- earners .","chinese":"用按揭在最高价买房的，也恰恰正是我们的工薪阶层。"}],"related":[{"definition":["down payment"],"pinyin":["shou3 fu4"],"word":"首付"},{"definition":["down payment"],"pinyin":["shou3 fu4 kuan3"],"word":"首付款"},{"definition":["to repay a loan"],"pinyin":["huan2 dai4"],"word":"还贷"},{"definition":["home loan"],"pinyin":["fang2 dai4"],"word":"房贷"},{"definition":["a loan\/CL:筆|笔[bi3]\/to provide a loan (e.g. bank)\/to raise a loan (from e.g. a bank)"],"pinyin":["dai4 kuan3"],"word":"贷款"},{"definition":["monthly loan repayment\/mortgage payment"],"pinyin":["yue4 gong1"],"word":"月供"},{"definition":["to buy a house on a mortgage\/house mortgage"],"pinyin":["gong1 fang2"],"word":"供房"},{"definition":["to buy a house"],"pinyin":["mai3 fang2"],"word":"买房"},{"definition":["mortgage loan"],"pinyin":["di3 ya1 dai4 kuan3"],"word":"抵押贷款"},{"definition":["forward delivery apartment\/unfinished housing to be paid for in advance by the buyer and then completed within certain time frame"],"pinyin":["qi1 fang2"],"word":"期房"},{"definition":["official reserves\/accumulated fund"],"pinyin":["gong1 ji1 jin1"],"word":"公积金"},{"definition":["to pay in installments\/payment in installments"],"pinyin":["fen1 qi1 fu4 kuan3"],"word":"分期付款"},{"definition":["to transfer ownership (of a vehicle, securities etc)\/(real estate) conveyancing"],"pinyin":["guo4 hu4"],"word":"过户"},{"definition":["suite\/apartment\/flat"],"pinyin":["tao4 fang2"],"word":"套房"},{"definition":["second-hand house\/house acquired indirectly through a middle-man"],"pinyin":["er4 shou3 fang2"],"word":"二手房"},{"definition":["title deeds\/certificate of property ownership"],"pinyin":["fang2 chan3 zheng4"],"word":"房产证"}]}