{"definition":["to provoke\/to stir up\/to incite"],"pinyin":["tiao3 qi3"],"traditional":["挑起"],"rank":12308.0,"normalized_rank":0.1722048885593161,"fraction":0.000005863629315790091,"cumulative_fraction":0.9457656572168792,"word":"挑起","characters":[{"definition":["to raise\/to dig up\/to poke\/to prick\/to incite\/to stir up","to carry on a shoulder pole\/to choose\/to pick\/to nitpick"],"pinyin":["tiao3","tiao1"],"word":"挑"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"He is one of those people who always seem intent on stirring up trouble among his workmates.","chinese":"他是个有意要在工友之间挑起纠纷的那种人。"},{"english":"Chinawill not wage an offensive war now.","chinese":"中国现在不会挑起一场进攻战。"},{"english":"Dug activists even disrupted what was to be a placid, respectful funeral for the fallen Moe.","chinese":"达格族激进分子甚至在莫的肃穆葬礼上挑起骚乱。"},{"english":"The adulterated honey can not be chosen, or can't become silks to choose either.","chinese":"掺假蜂蜜则不能被挑起，也不能挑成丝状。"},{"english":"The flame is just there, which only needs to be enkindled.","chinese":"火焰就在那里，只是需要挑起。"},{"english":"They’re afraid to make waves, and therefore, they avoid changes.","chinese":"他们害怕挑起风波，所以他们避免做出改变。"},{"english":"Georgian and South Ossetian officials have accused each other of initiating the hostilities.","chinese":"格鲁吉亚和南奥塞梯官员相互指责对方挑起敌对行动。"},{"english":"I made shoulder strong enough to carry the weight of the world. Yet, gentle enough to give comfort.","chinese":"我使她的肩膀能挑起整个世界的重担，并且柔情似水。"},{"english":"I made her shoulders strong enough to carry the weight of the world; yet , gentle enough to give comfort.","chinese":"我使她的肩膀能挑起整个世界的重担，并且柔情似水。"},{"english":"They were busy canvassing and drumming up sentiment against the new government.","chinese":"他们当时正忙于游说，挑起对新政府的不满情绪。"},{"english":"He shouldered the loaded carrying pole and walked off with a swing.","chinese":"他挑起担子颤悠颤悠地走了。"},{"english":"We are really working hard to start a WWIII, don't we?….","chinese":"我们在努力挑起第三次世界大战，是吗？"},{"english":"provoked the situation and doubled its mistakes, causing further escalation.","chinese":"日方挑起事端，又错上加错，导致事态进一步升级。"},{"english":"So what exactly is it about the new ball that's provoking all the controversy?","chinese":"那么究竟这个新的比赛用球是怎么挑起这些争论的呢？"},{"english":"Harry raised an eyebrow.","chinese":"哈利挑起了一条眉毛。"},{"english":"One at a time, push each pin up with the paperclip.","chinese":"用回形针将锁里的针脚一个一个地挑起来。"}],"related":[{"definition":["to entice\/to arouse\/to provoke"],"pinyin":["tiao3 dong4"],"word":"挑动"},{"definition":["capital of Wei 魏 during Warring states\/CL:根[gen1]"],"pinyin":["Da4 liang2"],"word":"大梁"},{"definition":["to arise again\/to make a comeback\/resurgence"],"pinyin":["zai4 qi3"],"word":"再起"},{"definition":["dispute\/controversy\/conflict"],"pinyin":["zheng1 duan1"],"word":"争端"},{"definition":["to incite disharmony\/to instigate"],"pinyin":["tiao3 bo1"],"word":"挑拨"},{"definition":["to infuriate\/to enrage\/to exasperate"],"pinyin":["ji1 nu4"],"word":"激怒"},{"definition":["to arouse\/to evoke\/to cause\/to stir up"],"pinyin":["ji1 qi3"],"word":"激起"},{"definition":["to start a war\/to make war\/to battle against"],"pinyin":["kai1 zhan4"],"word":"开战"},{"definition":["to get involved in\/to meddle\/interference"],"pinyin":["cha1 shou3"],"word":"插手"},{"definition":["to rise in revolt\/to raise difficult questions"],"pinyin":["fa1 nan4"],"word":"发难"},{"definition":["ambition\/wild schemes\/careerism"],"pinyin":["ye3 xin1"],"word":"野心"},{"definition":["to lift (a lid)\/to rock\/to convulse"],"pinyin":["xian1"],"word":"掀"},{"definition":["to press down\/to crush down\/to restrain (anger)\/to keep down (voice)"],"pinyin":["ya1 zhu4"],"word":"压住"},{"definition":["internal disorder\/civil strife\/civil unrest"],"pinyin":["nei4 luan4"],"word":"内乱"},{"definition":["to settle (a dispute)\/to quieten down\/to suppress"],"pinyin":["ping2 xi1"],"word":"平息"},{"definition":["to take on (a responsibility)"],"pinyin":["jie1 xia4"],"word":"接下"}]}