{"definition":["to cut one's flesh to cover a sore (idiom); faced with a current crisis, to make it worse by a temporary expedient"],"pinyin":["wa1 rou4 bu3 chuang1"],"traditional":["挖肉補瘡"],"rank":65538.0,"normalized_rank":0.9169616498537908,"fraction":1.4013852178745488e-8,"cumulative_fraction":0.9999615633609559,"word":"挖肉补疮","characters":[{"definition":["to dig\/to excavate\/to scoop out"],"pinyin":["wa1"],"word":"挖"},{"definition":["meat\/flesh\/pulp (of a fruit)\/(coll.) (of a fruit) squashy\/(of a person) flabby\/irresolute\/Kangxi radical 130"],"pinyin":["rou4"],"word":"肉"},{"definition":["to repair\/to patch\/to mend\/to make up for\/to fill (a vacancy)\/to supplement"],"pinyin":["bu3"],"word":"补"},{"definition":["sore\/skin ulcer"],"pinyin":["chuang1"],"word":"疮"}],"containing_words":[],"sentences":[{"english":"It is just like robbing Peter to pay Paul if you try to prepare for the English exam during a maths class.","chinese":"如果你在数学课上准备英语考试，那好比是挖肉补疮。"}],"related":[{"definition":["lit. pull down the east wall to repair the west (idiom); fig. temporary expedient\/Rob Peter to pay Paul"],"pinyin":["chai1 dong1 bu3 xi1"],"word":"拆东补西"},{"definition":["lit. drinking poison in the hope of quenching one's thirst (idiom)\/fig. a supposed remedy that only makes matters worse"],"pinyin":["yin3 zhen4 zhi3 ke3"],"word":"饮鸩止渴"},{"definition":["to take drastic measures to deal with a situation\/to pull the carpet from under sb"],"pinyin":["fu3 di3 chou1 xin1"],"word":"釜底抽薪"},{"definition":["lit. pull down the east wall to repair the west wall (idiom); fig. temporary expedient\/rob Peter to pay Paul"],"pinyin":["chai1 dong1 qiang2 bu3 xi1 qiang2"],"word":"拆东墙补西墙"},{"definition":["lit. to kill the chicken to get the eggs (idiom)\/fig. to kill the goose that lays the golden eggs"],"pinyin":["sha1 ji1 qu3 luan3"],"word":"杀鸡取卵"},{"definition":["lit. to carry firewood to put out a fire (idiom); fig. to make a problem worse by inappropriate action"],"pinyin":["bao4 xin1 jiu4 huo3"],"word":"抱薪救火"},{"definition":["lit. to foster an ulcer and bequeath a calamity (idiom); tolerating budding evil can only lead to disaster\/to cherish a viper in one's bosom"],"pinyin":["yang3 yong1 yi2 huan4"],"word":"养痈遗患"},{"definition":["to cover up mistakes or crimes\/to stitch up\/to fix"],"pinyin":["mi2 feng2"],"word":"弥缝"},{"definition":["to treat the symptoms rather than getting to the root of the problem (proverb)\/reactive (rather than proactive)"],"pinyin":["tou2 tong4 yi1 tou2 , jiao3 tong4 yi1 jiao3"],"word":"头痛医头，脚痛医脚"},{"definition":["lit. much thunder but little rain; fig. a lot of talk but little action\/his bark is worse than his bite"],"pinyin":["lei2 da4 yu3 xiao3"],"word":"雷大雨小"},{"definition":["lit. to drain the pond to get at the fish (idiom)\/fig. to kill the goose that lays the golden eggs"],"pinyin":["jie2 ze2 er2 yu2"],"word":"竭泽而渔"},{"definition":["excessive\/exorbitant\/excessively"],"pinyin":["fu2 lan4"],"word":"浮滥"},{"definition":["lit. eating away next year's food in advance\/fig. to dip into the next month's check\/live now, pay later"],"pinyin":["yin2 chi1 mao3 liang2"],"word":"寅吃卯粮"},{"definition":["rook sacrifice to save the king (in Chinese chess); fig. to protect a senior figure by blaming an underling\/to pass the buck"],"pinyin":["she3 ju1 bao3 shuai4"],"word":"舍车保帅"},{"definition":["to carry out one's duties perfunctorily\/to fulfill one's responsibility"],"pinyin":["se4 ze2"],"word":"塞责"},{"definition":["to damage the public interest for personal profit (idiom); personal profit at public expense\/venal and selfish behavior"],"pinyin":["sun3 gong1 fei2 si1"],"word":"损公肥私"}]}