{"definition":["to squeeze out\/to extrude\/to drain\/to find the time\/to burst out"],"pinyin":["ji3 chu1"],"traditional":["擠出"],"rank":12674.0,"normalized_rank":0.17732570341247744,"fraction":0.000005586125847125558,"cumulative_fraction":0.9478620376828921,"word":"挤出","characters":[{"definition":["to crowd in\/to cram in\/to force others aside\/to press\/to squeeze\/to find (time in one's busy schedule)"],"pinyin":["ji3"],"word":"挤"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"Figure12 represents a typical die for extruding tubing.","chinese":"图释12代表了挤出管材的典型模具。"},{"english":"Candy's face reddens, but she manages to force a smile.","chinese":"凯蒂的脸涨红，却强挤出了一丝笑容。"},{"english":"The support tube profile will be extruded to this surface.","chinese":"支撑细管轮廓将被挤出至此曲面。"},{"english":"Secretary of State Condoleezza Rice squeezed in some ice time while in Russia.","chinese":"在俄罗斯美国国务卿赖斯挤出一些时间在冰场上。"},{"english":"In the perspective of subordinates, has also not condemning mouth, and you would like to smile out of him?","chinese":"在下属的角度，已经骂不还口了，你还想他挤出笑容？"},{"english":"At the same time the Brabender extrusion behaviour was also studied.","chinese":"同时对共混体的挤出加工性能进行了研究。"},{"english":"This is what makes this necklace special and standing out of the crowd.","chinese":"这个就是什么使得这条项链特殊而站人群中挤出来的。"},{"english":"Parison formation is a critical stage in plastics extrusion blow molding.","chinese":"型坯成型是塑料挤出吹塑中的一个重要阶段。"},{"english":"Too abused extrusions also add to this chaotic feeling.","chinese":"过度使用挤出也给这个模型增添了些混乱的感觉。"},{"english":"I could only spare two or three hours, from my numerous diurnal occupations, to follow her footsteps .","chinese":"我只能从无数的日常工作中挤出两三个小时来跟着她。"},{"english":"The young man made a run for it. Soon the manager broke free of us too and charged.","chinese":"年轻人跑过来取了帽子，很快经理也从人群中挤出来。"},{"english":"The scanning electronic microscope results showed that double screw blending was better than single screw blending.","chinese":"双螺杆共混挤出，扫描电镜观察两相混合效果很好。"},{"english":"Two men suddenly elbowed a passage through the shoppers.","chinese":"两名男子突然用肘在购物者中挤出一条路。"},{"english":"You can against your nature and make up some smile.","chinese":"你可以正面违逆自己的本性强挤出一些笑颜。"},{"english":"The results show that the rising trend of housing price has a significant crowding-out effect on aggregate consumption.","chinese":"结果表明，房价持续上涨对消费具有明显的挤出效应。"},{"english":"The driving system is an important part of twin-screw extruder.","chinese":"传动系统是双螺杆挤出机的一个重要部分。"}],"related":[{"definition":["to extrude"],"pinyin":["ji3 ya1 chu1"],"word":"挤压出"},{"definition":["to crowd in\/to cram in\/to force others aside\/to press\/to squeeze\/to find (time in one's busy schedule)"],"pinyin":["ji3"],"word":"挤"},{"definition":["to squeeze in\/to force oneself into\/to cram into\/to intrude"],"pinyin":["ji3 ru4"],"word":"挤入"},{"definition":["to swallow\/to suppress"],"pinyin":["yan4 xia4"],"word":"咽下"},{"definition":["to break into\/to force one's way into\/to barge into"],"pinyin":["ji3 jin4"],"word":"挤进"},{"definition":["to wipe","to plaster\/to go around\/to skirt","to smear\/to wipe\/to erase\/classifier for wisps of cloud, light-beams etc"],"pinyin":["ma1","mo4","mo3"],"word":"抹"},{"definition":["to overflow\/to spill over\/(computing) overflow"],"pinyin":["yi4 chu1"],"word":"溢出"},{"definition":["to wipe"],"pinyin":["ca1 diao4"],"word":"擦掉"},{"definition":["to press down\/to crush down\/to restrain (anger)\/to keep down (voice)"],"pinyin":["ya1 zhu4"],"word":"压住"},{"definition":["gap between teeth"],"pinyin":["ya2 feng4"],"word":"牙缝"},{"definition":["to squeeze\/to press\/to extrude"],"pinyin":["ji3 ya1"],"word":"挤压"},{"definition":["to exert all one's strength"],"pinyin":["shi3 jin4"],"word":"使劲"},{"definition":["to wipe\/to erase\/rubbing (brush stroke in painting)\/to clean\/to polish"],"pinyin":["ca1"],"word":"擦"},{"definition":["to float\/to emerge"],"pinyin":["fu2 qi3"],"word":"浮起"},{"definition":["to get rid of\/to exclude\/to eliminate\/to remove\/to delete\/to strip out\/to extract"],"pinyin":["qu4 diao4"],"word":"去掉"},{"definition":["to seep out\/to exude"],"pinyin":["shen4 chu1"],"word":"渗出"}]}