{"definition":["to exchange (sth) for (sth else)\/to replace with\/to convert into"],"pinyin":["huan4 cheng2"],"traditional":["換成"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"换成","characters":[{"definition":["to exchange\/to change (clothes etc)\/to substitute\/to switch\/to convert (currency)"],"pinyin":["huan4"],"word":"换"},{"definition":["to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth","surname Cheng"],"pinyin":["cheng2","Cheng2"],"word":"成"}],"containing_words":[],"sentences":[{"english":"It is transformed into visible light image through optical correlator.","chinese":"它通过光学相关器转换成可见光图像信息。"},{"english":"Smiling at the Dornish knights, she switched back to the Common Tongue.","chinese":"边对多恩骑士微笑，她边转换成通用语。"},{"english":"He wanted to convert his dollars into Japanese yen.","chinese":"他想将美元换成日币。"},{"english":"The other professor was replaced by two teachers.","chinese":"另一个班的教授换成了两名教师。"},{"english":"This is an open top outrigger kayak that converts into a tent with ease.","chinese":"这是一个开放前支腿皮艇可以转换成轻松帐篷。"},{"english":"Just got done setting up a few new computer to send down to our Georgia facility to replace some 6 year old computers.","chinese":"把一些在乔治亚州用了六年的旧电脑换成新的。"},{"english":"I would like to change the room to a double, not single.","chinese":"我想换成双人房，而不要单人房。"},{"english":"We substituted red balls for blue balls, to see if the baby could notice.","chinese":"我们把蓝球换成了红球以观察婴儿是否注意到了。"},{"english":"I'm sorry, May I have it changed the small plate?","chinese":"对不起，我把它换成小盘子好吗？"},{"english":"After the earlier invasion, Celtic had been replaced with English.","chinese":"早期的侵略后，凯尔特语被替换成英语。"},{"english":"All you have to do is simply switch the salt shaker with sugar!","chinese":"在这个恶作剧里，你所做的仅仅是把盐罐换成糖罐。"},{"english":"I'd some coins for this hundred yuan note.","chinese":"我想把这一百元纸币换成硬币。"},{"english":"Some parents do not want to make the switch for even their school-age children.","chinese":"有些家长甚至不愿让开始上学的孩子换成电子书。"},{"english":"Let me change the dollar bill for coins.","chinese":"让我把这张美元的纸钞换成硬币。"},{"english":"By default, all packages are transformed to folders.","chinese":"默认条件下，所有的包都被转换成了文件夹。"},{"english":"Next station, Hongshan Square, interchange station for the Line 2.","chinese":"下一站，洪山广场，乘客可以换成2号线。"}],"related":[{"definition":["to convert\/to turn into (sth else)\/to adapt (a story to another medium)"],"pinyin":["gai3 cheng2"],"word":"改成"},{"definition":["to exchange\/to replace\/to substitute for\/to switch"],"pinyin":["ti4 huan4"],"word":"替换"},{"definition":["to exchange\/to change (clothes etc)\/to substitute\/to switch\/to convert (currency)"],"pinyin":["huan4"],"word":"换"},{"definition":["to replace\/to take the place of"],"pinyin":["dai4 ti4"],"word":"代替"},{"definition":["to replace\/to supersede\/to supplant\/(chemistry) substitution"],"pinyin":["qu3 dai4"],"word":"取代"},{"definition":["to stop using\/to abandon\/abandoned\/deprecated"],"pinyin":["qi4 yong4"],"word":"弃用"},{"definition":["only\/merely\/nothing but\/no more than\/it's just that ..."],"pinyin":["zhi3 bu5 guo4"],"word":"只不过"},{"definition":["originally\/original\/former"],"pinyin":["yuan2 xian1"],"word":"原先"},{"definition":["compared with"],"pinyin":["bi3 qi3"],"word":"比起"},{"definition":["to bring\/to fetch\/to get"],"pinyin":["na2 lai2"],"word":"拿来"},{"definition":["(coll.) if"],"pinyin":["yao4 shi5"],"word":"要是"},{"definition":["if (coming after a conditional clause)"],"pinyin":["de5 hua4"],"word":"的话"},{"definition":["to join\/to fit\/to mate\/to mix\/to match\/to deserve\/to make up (a prescription)\/to allocate"],"pinyin":["pei4"],"word":"配"},{"definition":["to replace (a worn-out tire etc)\/to change (one's address etc)"],"pinyin":["geng1 huan4"],"word":"更换"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不过"},{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"}]}