{"definition":["to lift\/to raise in height\/to begin\/upsurge\/to set off (a campaign)"],"pinyin":["xian1 qi3"],"traditional":["掀起"],"rank":4459.0,"normalized_rank":0.06238719516460761,"fraction":0.000028536144431851088,"cumulative_fraction":0.8448143347883137,"word":"掀起","characters":[{"definition":["to lift (a lid)\/to rock\/to convulse"],"pinyin":["xian1"],"word":"掀"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"Hot summer days are coming while the high-grade summer goods will raise another heat wave.","chinese":"伏天将临，夏日精晶将掀起又一个热季狂潮。"},{"english":"How come, the branches irritated the jealous wind and messed up the pond?","chinese":"何以会有，那树枝，掀起了妒火中烧的秋风？"},{"english":"A lift your veil, once touched many hearts.","chinese":"一首掀起你的盖头来，曾打动了多少美好的心灵。"},{"english":"The evidence was flimsy, and a campaign was launched to secure a re-trial.","chinese":"由于证据不足，掀起了一场为取得复审的运动。"},{"english":"In a piece titled \"How Did England Mount the Green Wave?","chinese":"在一篇名为“英国是如何掀起绿色变革的？”"},{"english":"Among lolich the material is always the one to start the fashion reform.","chinese":"而每一次掀起服装改革浪潮的都是面料。"},{"english":"This event caused a wave of indignation in Sweden.","chinese":"此事件在瑞典掀起了怒涛。"},{"english":"Was not the love we found worth the tempest that it boomed?","chinese":"难道我们的爱不值得它所掀起的轩然风暴？"},{"english":"Apparently, the article has inspired heated back-and-forths on industry e-mail lists.","chinese":"显然，文章在业内的电邮名单中掀起了惊涛骇浪。"},{"english":"Her straight sets victory in Paris also set off a wave of exuberant patriotism in the press at home.","chinese":"她在巴黎直落三盘的胜利也掀起了家乡的一波。"},{"english":"President Rogge’s interview on Weibo also created waves offline.","chinese":"罗格主席的在线访谈也在线下掀起了高潮。"},{"english":"A strong head wind lashed the river into waves.","chinese":"一股顶头风在河中掀起了波浪。"},{"english":"Musharraf has unilaterally amended the constitution at the beginning of the week and caused strong objections and noises.","chinese":"穆夏拉夫本周初片面修改宪法，掀起极大的反弹声浪。"},{"english":"Thus the whole society should endeavor to promote a new fashion of simple weddings.","chinese":"因此，全社会都应该掀起简单婚礼的新时尚。"},{"english":"A metal probe lifts the septum secundum and reveals the opening.","chinese":"一根金属探针将房间隔掀起以显示未闭开放。"},{"english":"The wind that blows the dry steppe dust. Stirs the curtains in your tower.","chinese":"大风卷袭着草原的尘土，掀起塔楼上的窗帘。"}],"related":[{"definition":["upsurge\/popular craze"],"pinyin":["re4 chao2"],"word":"热潮"},{"definition":["tempest\/wave (of popular sentiment etc)\/craze or fad"],"pinyin":["feng1 chao2"],"word":"风潮"},{"definition":["surging tide\/(fig.) tide\/craze\/rage\/spree"],"pinyin":["kuang2 chao2"],"word":"狂潮"},{"definition":["wave\/tides"],"pinyin":["lang4 chao2"],"word":"浪潮"},{"definition":["to engulf\/to sweep\/to carry away everything"],"pinyin":["xi2 juan3"],"word":"席卷"},{"definition":["storm\/violent commotion\/fig. crisis (e.g. revolution, uprising, financial crisis etc)"],"pinyin":["feng1 bao4"],"word":"风暴"},{"definition":["huge waves\/(fig.) ruckus\/controversy\/sensation"],"pinyin":["xuan1 ran2 da4 bo1"],"word":"轩然大波"},{"definition":["to lift (a lid)\/to rock\/to convulse"],"pinyin":["xian1"],"word":"掀"},{"definition":["to arouse\/to evoke\/to cause\/to stir up"],"pinyin":["ji1 qi3"],"word":"激起"},{"definition":["spring tide\/(fig.) momentous social change"],"pinyin":["da4 chao2"],"word":"大潮"},{"definition":["lit. foul wind and bloody rain (idiom)\/fig. reign of terror\/carnage"],"pinyin":["xing1 feng1 xue4 yu3"],"word":"腥风血雨"},{"definition":["to surge like a gathering storm (idiom)\/to grow by leaps and bounds"],"pinyin":["feng1 qi3 yun2 yong3"],"word":"风起云涌"},{"definition":["billows\/great waves (fig. of a story with great momentum)"],"pinyin":["bo1 lan2"],"word":"波澜"},{"definition":["to cause a sensation\/to create a stir in (a place)\/commotion\/controversy"],"pinyin":["hong1 dong4"],"word":"轰动"},{"definition":["to lead to\/to trigger\/to initiate\/to cause\/to evoke (emotions)"],"pinyin":["yin3 fa1"],"word":"引发"},{"definition":["tide\/current\/damp\/moist\/humid"],"pinyin":["chao2"],"word":"潮"}]}