{"definition":["to reject\/to exclude\/to eliminate\/to remove\/to repel"],"pinyin":["pai2 chi4"],"traditional":["排斥"],"rank":9725.0,"normalized_rank":0.1360653673415136,"fraction":0.000008633846740748979,"cumulative_fraction":0.9273765001055612,"word":"排斥","characters":[{"definition":["a row\/a line\/to set in order\/to arrange\/to line up\/to eliminate\/to drain\/to push open\/platoon\/raft\/classifier for lines, rows etc"],"pinyin":["pai2"],"word":"排"},{"definition":["to blame\/to reprove\/to reprimand\/to expel\/to oust\/to reconnoiter\/(of territory) to expand\/saline marsh"],"pinyin":["chi4"],"word":"斥"}],"containing_words":[],"sentences":[{"english":"It is, essentially, a rejection of Hellenic intellectualism by the sentimentalism of the North.","chinese":"它在本质上是北方的重情主义对希腊尚知主义的排斥。"},{"english":"Minor Circle is the circle formed by the innermost surface of the spline.","chinese":"小圆是花键的最小齿形面的排斥圆。"},{"english":"I have been an outcast my entire life.","chinese":"我的一生都是在受人排斥的。"},{"english":"Objective To explore the mechanism of immuno- rejection for the swine allogenic chondrocytes in transplantation.","chinese":"目的探讨猪软骨细胞同种异体移植的免疫排斥机制。"},{"english":"Desensitized patients are at high risk of developing acute antibody-mediated rejection.","chinese":"致敏患者有发生急性抗体介导的排斥反应的高度危险。"},{"english":"You should consider settings and options to be mutually exclusive .","chinese":"你应该考虑设置和选项的相互排斥性。"},{"english":"Which country if have to repels this kind of progress, indicate that they are abnormal.","chinese":"如果有哪个国家排斥这种进步，就表明他们不正常。"},{"english":"Now, you might find this sort of project in the end to be repellant.","chinese":"现在，你可以发现这类目标最后是被排斥的。"},{"english":"She's rejected in class because of he clumsiness.","chinese":"她因为行动笨拙而被班上同学排斥。"},{"english":"You reject positive experiences by insisting they don’t count.","chinese":"你拒不接受积极的体验，坚持把他们排斥在外。"},{"english":"And at a distance of 2 r naught, I have a positive repulsive term.","chinese":"在这2r圈的距离上，这里有一个不可忽略的排斥场。"},{"english":"In proportion therefore, as the repulsiveness of the work increases, the wage decreases.","chinese":"因此，当劳动的排斥增加，工资就减少。"},{"english":"Certainly the phenomenon of sexuality-in-flux is by no means exclusive to women.","chinese":"当然性倾向在同量的情况下绝非排斥女性。"},{"english":"The void is always elusive, having no opposite, there is nothing which excludes or opposes.","chinese":"虚无包含一切，无所不容，不存在对立与排斥。"},{"english":"School remains a place where intellect is mistrusted.","chinese":"学校仍在排斥对智力的培养。"},{"english":"Ostracized by the community for immoral activities.","chinese":"因为道德败坏的行为被社会所排斥。"}],"related":[{"definition":["to conflict\/to contradict"],"pinyin":["di3 chu4"],"word":"抵触"},{"definition":["to resist\/to defy\/to oppose"],"pinyin":["kang4 ju4"],"word":"抗拒"},{"definition":["to be disgusted with\/to dislike\/bad reaction\/antipathy"],"pinyin":["fan3 gan3"],"word":"反感"},{"definition":["to crowd out\/to push aside\/to supplant"],"pinyin":["pai2 ji3"],"word":"排挤"},{"definition":["to discriminate against\/discrimination"],"pinyin":["qi2 shi4"],"word":"歧视"},{"definition":["to loathe\/to hate\/disgusted with sth"],"pinyin":["yan4 wu4"],"word":"厌恶"},{"definition":["hostile\/malevolence\/antagonism\/to view as enemy\/to stand against"],"pinyin":["di2 shi4"],"word":"敌视"},{"definition":["prejudice"],"pinyin":["pian1 jian4"],"word":"偏见"},{"definition":["external\/foreign\/outside"],"pinyin":["wai4 lai2"],"word":"外来"},{"definition":["to approve of\/to endorse\/to acknowledge\/to recognize\/to identify oneself with"],"pinyin":["ren4 tong2"],"word":"认同"},{"definition":["to view sb as an enemy\/to be hateful towards"],"pinyin":["chou2 shi4"],"word":"仇视"},{"definition":["assimilation (cultural, digestive, phonemic etc)"],"pinyin":["tong2 hua4"],"word":"同化"},{"definition":["to admit (to membership)"],"pinyin":["jie1 na4"],"word":"接纳"},{"definition":["to fight against\/to oppose\/to be opposed to\/opposition"],"pinyin":["fan3 dui4"],"word":"反对"},{"definition":["to look down upon\/to despise"],"pinyin":["kan4 bu5 qi3"],"word":"看不起"},{"definition":["to be afraid"],"pinyin":["ju4 pa4"],"word":"惧怕"}]}