{"definition":["to examine\/to probe\/to scout out\/to nose around"],"pinyin":["tan4 cha2"],"traditional":["探查"],"rank":33168.0,"normalized_rank":0.4640633525946861,"fraction":7.117869085787813e-7,"cumulative_fraction":0.9928445860524951,"word":"探查","characters":[{"definition":["to explore\/to search out\/to scout\/to visit\/to stretch forward"],"pinyin":["tan4"],"word":"探"},{"definition":["surname Zha","to research\/to check\/to investigate\/to examine\/to refer to\/to look up (e.g. a word in a dictionary)","see 山查[shan1 zha1]"],"pinyin":["Zha1","cha2","zha1"],"word":"查"}],"containing_words":[],"sentences":[{"english":"Conclusion The above procedure is necessary for the ankle sprains with the injury of the common peroneal nerve.","chinese":"结论踝扭伤出现腓总神经损伤者应作探查松解减压术。"},{"english":"This is China\"s first exploration depth of the documentary work marriage asexual.\"","chinese":"这是中国第一部深度探查无性婚姻的纪实作品。"},{"english":"Using cues, clues and hints to detect the hidden relationships.","chinese":"运用各种暗示点对隐藏的事理逻辑线索进行探查。"},{"english":"She want to prob my hurt, want to know I think.","chinese":"她试图探查我的心意，想知道我在想什么。"},{"english":"Standing in front of a mirror will help in looking for any possible swelling on the scrotum.","chinese":"照著镜子检查会有助于探查阴囊上任何可能的肿大。"},{"english":"At the right is a probe patent foramen ovale in an adult.","chinese":"右为成年人卵圆孔未闭的探查。"},{"english":"But this is often limited to small probing manoeuvres.","chinese":"但是，这往往局限于小的探查演练。"},{"english":"A laparotomy was performed and the tumor was resected.","chinese":"遂行剖腹探查及肿瘤切除。"},{"english":"Methylene blue injection into breast duct in operation could help surgeons to explore and resect lesions.","chinese":"病变乳管内置管美兰注射有助于病灶的探查和切除。"},{"english":"Remote debugging increases the total surface area that can be probed.","chinese":"远端侦错会增加能够探查的整体表面范围。"},{"english":"Their task is exploring oil mines in the west.","chinese":"他们的任务是在西部探查油矿。"},{"english":"Conclusion Operations research should be done immediately for the cases with early diagnosis or high …","chinese":"结论对明确诊断或有高度怀疑时，应积极行手术探查。"},{"english":"Currently, the exit probe point is supported for system calls only.","chinese":"当前，对于系统调用，只支持出口探查点。"},{"english":"After the teaching intervention, ascertains the situation of student's conceptual understanding.","chinese":"而后探查了教学干预后学生的化学概念理解情况。"},{"english":"The fist part is about the research on probability of Zhao's misreading.","chinese":"文章第一个部分对造成赵孟𫖯误读的可能性进行探查。"},{"english":"Today the principal tools for prospecting the brain are electrical.","chinese":"当今探查人脑的主要工具是用电的。"}],"related":[{"definition":["to investigate\/to observe\/to scout\/to seek out and examine\/to explore"],"pinyin":["tan4 cha2"],"word":"探察"},{"definition":["to check\/to investigate\/to probe (into)"],"pinyin":["cha2 tan4"],"word":"查探"},{"definition":["to find out\/to ascertain\/to get an idea of"],"pinyin":["tan4 zhi1"],"word":"探知"},{"definition":["to make inquiries\/to try to find out\/to pry"],"pinyin":["tan4 ting1"],"word":"探听"},{"definition":["to make discreet inquiries\/to scout out"],"pinyin":["da3 tan4"],"word":"打探"},{"definition":["to search\/to look for"],"pinyin":["sou1 xun2"],"word":"搜寻"},{"definition":["response\/reaction\/interaction\/irritability (biol.)\/induction (elec.)\/inductance"],"pinyin":["gan3 ying4"],"word":"感应"},{"definition":["to pry into\/to spy on\/to probe into"],"pinyin":["ci4 tan4"],"word":"刺探"},{"definition":["to monitor\/to keep a close watch over\/surveillance"],"pinyin":["jian1 shi4"],"word":"监视"},{"definition":["to peep at\/to spy on\/to peek"],"pinyin":["kui1 shi4"],"word":"窥视"},{"definition":["to investigate a crime\/to scout\/to reconnoiter\/reconnaissance\/detection\/a scout"],"pinyin":["zhen1 cha2"],"word":"侦察"},{"definition":["to detect\/to sense"],"pinyin":["zhen1 ce4"],"word":"侦测"},{"definition":["to submerge\/to infiltrate\/to steal into"],"pinyin":["qian2 ru4"],"word":"潜入"},{"definition":["to pry into or spy on\/to snoop\/to peep\/to poke one's nose into\/to peer\/to get a glimpse of"],"pinyin":["kui1 tan4"],"word":"窥探"},{"definition":["to watch\/to look carefully at"],"pinyin":["cha2 kan4"],"word":"察看"},{"definition":["secret\/hidden"],"pinyin":["yin3 mi4"],"word":"隐秘"}]}