{"definition":["to investigate\/to probe"],"pinyin":["tan4 tao3"],"traditional":["探討"],"rank":3774.0,"normalized_rank":0.052803156436696384,"fraction":0.00003583575566308201,"cumulative_fraction":0.8228545818573542,"word":"探讨","characters":[{"definition":["to explore\/to search out\/to scout\/to visit\/to stretch forward"],"pinyin":["tan4"],"word":"探"},{"definition":["to invite\/to provoke\/to demand or ask for\/to send armed forces to suppress\/to denounce or condemn\/to marry (a woman)\/to discuss or study"],"pinyin":["tao3"],"word":"讨"}],"containing_words":[],"sentences":[{"english":"Objective To investigate the antiproliferative effects of folate on ovarian cancer cells.","chinese":"目的探讨叶酸对卵巢癌细胞增殖的影响及作用机制。"},{"english":"Objective To investigate the value of ultrasound in the diagnosis of theca cell tumor.","chinese":"目的探讨超声检查在卵泡膜细胞瘤诊断中的价值。"},{"english":"Objective To research the LISREL and its application in the biomedical studies.","chinese":"目的探讨线性结构模型理论及其在医学中的应用。"},{"english":"Objective To explore the diagnosis and treatment features of pulmonary heart disease caused by tuberculosis.","chinese":"目的探讨肺结核所致肺心病的诊断和治疗特点。"},{"english":"Objectives To explore the training method of comprehensive competence for junior nurses in burn department.","chinese":"目的探讨烧伤科新护士综合护理能力的培养方法。"},{"english":"Objective To study the clinical diagnosis of B-mode ultrasound to gynecologic acute abdomen.","chinese":"目的探讨B型超声对妇科急腹症的临床诊断价值。"},{"english":"Aim To investigate the treatment and clinical diagnosis of right lower-abdominal mass.","chinese":"目的探讨右下腹包块的临床诊断与治疗。"},{"english":"Objective To study the clinical features and treatment of traumatic cerebral intraventricular hemorrhage(TIVH).","chinese":"目的探讨外伤性脑室出血的临床特点和治疗方法。"},{"english":"Objective To make new approach of the interventional radiology in the treatment of ischemic necrosis of caput femoris in children.","chinese":"目的探讨介入治疗儿童股骨头缺血性坏死的价值。"},{"english":"Objective To investigate the anatomical structures of the posterior column of the acetabulum and the related clinical significance.","chinese":"目的探讨髋臼后柱的解剖学结构及其相关临床意义。"},{"english":"To investigate clinical feature and therapeutic approach of traumatic dural sinus.","chinese":"探讨外伤性颅内静脉窦损伤的临床特点及治疗。"},{"english":"Objective To study the anti-inflammatory and analgesic effects of Aralia echinocaulis Foot bark.","chinese":"目的探讨刺茎楤木根皮的抗炎镇痛作用。"},{"english":"Objective To evaluate the treatment of cooperative care of patients with IVP.","chinese":"目的探讨静脉肾盂造影的护理配合。"},{"english":"Objective To evaluate the clinical value of supraglottic horizontal partial laryngectomy.","chinese":"目的探讨喉声门上水平部分切除术的临床应用价值。"},{"english":"Objective To evaluate the value of high frequency ultrasound in diagnosis of trauma of tendo calcaneus.","chinese":"目的探讨高频超声对跟腱损伤的诊断价值。"},{"english":"Objective To further discuss the indexes which can be used to objectively appraise the rat myocardial ischemia models.","chinese":"目的进一步探讨客观评价大鼠心肌缺血模型的指标。"}],"related":[{"definition":["to discuss\/to talk over\/CL:個|个[ge4]"],"pinyin":["tao3 lun4"],"word":"讨论"},{"definition":["to expound (a position)\/to elaborate (on a topic)\/to treat (a subject)"],"pinyin":["chan3 shu4"],"word":"阐述"},{"definition":["to discuss\/to have a chat"],"pinyin":["tan2 tan2"],"word":"谈谈"},{"definition":["discussion"],"pinyin":["yan2 tao3"],"word":"研讨"},{"definition":["to analyze\/to dissect"],"pinyin":["pou1 xi1"],"word":"剖析"},{"definition":["to investigate\/to delve\/to probe\/to enquire into\/to look into"],"pinyin":["tan4 jiu1"],"word":"探究"},{"definition":["to discuss\/to talk about"],"pinyin":["tan2 lun4"],"word":"谈论"},{"definition":["topic of discussion\/topic\/subject\/issue (under discussion)\/CL:項|项[xiang4]"],"pinyin":["yi4 ti2"],"word":"议题"},{"definition":["to reflect on\/to ponder over"],"pinyin":["si1 kao3"],"word":"思考"},{"definition":["to explain\/to expound\/to interpret\/elucidation"],"pinyin":["chan3 shi4"],"word":"阐释"},{"definition":["to exchange\/exchange\/communication\/interaction\/to have social contact (with sb)"],"pinyin":["jiao1 liu2"],"word":"交流"},{"definition":["to decipher\/to decode\/to interpret"],"pinyin":["jie3 du2"],"word":"解读"},{"definition":["treatise\/discourse\/exposition"],"pinyin":["lun4 shu4"],"word":"论述"},{"definition":["opinion\/view\/understanding"],"pinyin":["jian4 jie3"],"word":"见解"},{"definition":["answer\/explanation\/solution (to a math equation)"],"pinyin":["jie3 da2"],"word":"解答"},{"definition":["to argue\/to debate\/to contend\/argument\/contention\/controversy\/debate\/CL:次[ci4],場|场[chang3]"],"pinyin":["zheng1 lun4"],"word":"争论"}]}