{"definition":["to take over (duties etc)\/catcher (baseball etc)"],"pinyin":["jie1 shou3"],"traditional":["接手"],"rank":8395.0,"normalized_rank":0.11745694178221144,"fraction":0.000011048754621925923,"cumulative_fraction":0.9143354041481522,"word":"接手","characters":[{"definition":["to receive\/to answer (the phone)\/to meet or welcome sb\/to connect\/to catch\/to join\/to extend\/to take one's turn on duty\/to take over for sb"],"pinyin":["jie1"],"word":"接"},{"definition":["hand\/(formal) to hold\/person engaged in certain types of work\/person skilled in certain types of work\/personal(ly)\/convenient\/classifier for skill\/CL:雙|双[shuang1],隻|只[zhi1]"],"pinyin":["shou3"],"word":"手"}],"containing_words":[],"sentences":[{"english":"There are many cases of human rights violations filed before the police.","chinese":"警方接手许多人权侵犯案件，往往牵连到高级官员。"},{"english":"The catcher was dinged on the head by a wild throw.","chinese":"那个凶猛的投球打在接手的头上。"},{"english":"At that price everybody who wanted to buy yen for dollars would find someone who was willing to sell him yen for dollars.","chinese":"只有在这种兑换价位时，美元出手了才有人愿意接手。"},{"english":"Work on projects after other programmers.","chinese":"接手别的程序员完成项目。"},{"english":"I'm feeling too tired to drive any more; will you take over?","chinese":"我累得开不动车了，你来接手好吗？"},{"english":"Like all the short guys would become receivers, right?","chinese":"就象让所有矮个儿都当外接手，对吧？"},{"english":"The team has made much progress since Lucy coached it.","chinese":"自从露西接手训练以来，那支队伍进步非常大。"},{"english":"If you want to take over the task, you must burn your boats.","chinese":"如果你想接手这项工作，就必须干到底。"},{"english":"And then when I graduated, he suggested I take over his class.","chinese":"后来我毕业了，他提议我接手他的课程。"},{"english":"How does that differ from the brand strategy before Converse was acquired by Nike?","chinese":"在被耐克接手之前，匡威的品牌战略有何不同？"},{"english":"After the items of the project and decided, the engineering team will take over.","chinese":"报价的各项内容一旦确定，工程队就正式接手。"},{"english":"Its first challenge with Guangdong will be to improve operations.","chinese":"改善经营将是花旗接手广发银行后面临的首要问题。"},{"english":"First: It hired a team from Gray Robinson to start working on the case.","chinese":"第一，从格雷罗宾森雇佣了一支团队接手这个案子。"},{"english":"The house and contents were left to the National Trust.","chinese":"萧的住宅和宅内物什由国民托管组织接手。"},{"english":"In the past three years she has taken on 50 or 60 cases.","chinese":"这三年来，她已经接手了五六十个任务。"},{"english":"After this human beings take over and defuse and remove the mine.","chinese":"然后便由人类接手，拆去雷管并移除地雷。"}],"related":[{"definition":["to wield (power etc)"],"pinyin":["zhi2 zhang3"],"word":"执掌"},{"definition":["to take over (as minister, manager etc)"],"pinyin":["jie1 ren4"],"word":"接任"},{"definition":["to take office\/previous (incumbent)\/predecessor"],"pinyin":["shang4 ren4"],"word":"上任"},{"definition":["to take over\/to take control"],"pinyin":["jie1 zhang3"],"word":"接掌"},{"definition":["to replace\/to take over (a position or post)"],"pinyin":["jie1 ti4"],"word":"接替"},{"definition":["to take up a post\/to start in a new job"],"pinyin":["chu1 ren4"],"word":"出任"},{"definition":["to take over\/to assume control"],"pinyin":["jie1 guan3"],"word":"接管"},{"definition":["to ride to take up an official appointment (idiom); to take on a job with alacrity\/to undertake a task"],"pinyin":["zou3 ma3 shang4 ren4"],"word":"走马上任"},{"definition":["(of property) to change owners\/(of sovereignty, political power etc) to change hands"],"pinyin":["yi4 zhu3"],"word":"易主"},{"definition":["newly-appointed\/newly elected\/new (in a political office)"],"pinyin":["xin1 ren4"],"word":"新任"},{"definition":["to succeed sb in a job\/successor"],"pinyin":["ji4 ren4"],"word":"继任"},{"definition":["to discuss a matter with sb\/to get in touch with\/to arrange"],"pinyin":["jie1 qia4"],"word":"接洽"},{"definition":["to remain in office\/to hold on to one's job"],"pinyin":["liu2 ren4"],"word":"留任"},{"definition":["to resign\/to quit"],"pinyin":["ci2 qu4"],"word":"辞去"},{"definition":["troops\/subordinates\/(honorific appellation for a general)"],"pinyin":["hui1 xia4"],"word":"麾下"},{"definition":["to give\/to deliver\/to hand over"],"pinyin":["jiao1 gei3"],"word":"交给"}]}