{"definition":["to touch\/to contact\/access\/in touch with"],"pinyin":["jie1 chu4"],"traditional":["接觸"],"rank":1771.0,"normalized_rank":0.02477858771843913,"fraction":0.00008866754044407191,"cumulative_fraction":0.7115863661207522,"word":"接触","characters":[{"definition":["to receive\/to answer (the phone)\/to meet or welcome sb\/to connect\/to catch\/to join\/to extend\/to take one's turn on duty\/to take over for sb"],"pinyin":["jie1"],"word":"接"},{"definition":["to touch\/to make contact with sth\/to stir up sb's emotions"],"pinyin":["chu4"],"word":"触"}],"containing_words":[{"definition":["contactor"],"pinyin":["jie1 chu4 qi4"],"word":"接触器"},{"definition":["sexual encounter"],"pinyin":["xing4 jie1 chu4"],"word":"性接触"},{"definition":["loose or defective contact (elec.)"],"pinyin":["jie1 chu4 bu4 liang2"],"word":"接触不良"},{"definition":["heterosexual sex"],"pinyin":["yi4 xing4 xing4 jie1 chu4"],"word":"异性性接触"},{"definition":["contact lens"],"pinyin":["jiao3 mo2 jie1 chu4 jing4"],"word":"角膜接触镜"}],"sentences":[{"english":"Corneal ulcers occur most often in patients who use extended-wear soft contact lenses.","chinese":"角膜溃疡最常发生于长期使用软性角膜接触镜的病人。"},{"english":"Both men had direct contact with dead chickens when feeding carcasses to their dogs.","chinese":"这两名男子均在将死鸡尸体喂狗时直接接触了死鸡。"},{"english":"You must prevent the children from touching the dangerous things.","chinese":"你们务必不要让孩子接触危险物品。"},{"english":"The second is that a systematic error exists, resulting from the attrition voltage and contact electric potential difference.","chinese":"存在一个由消耗电压与接触电势差导致的系统误差。"},{"english":"A new type of continuous contact model was developed for a spatial revolute joint.","chinese":"提出了一种新型空间间隙转动副的连续接触模型。"},{"english":"Sense only the \"maleficent contacts\" and shut them out.","chinese":"只感知“有害接触”并拒之门外。"},{"english":"So who made the machines? That's who we want to contact.","chinese":"那谁造的这种机器？我们要和他接触。"},{"english":"Eye contact is sometimes the key to communication.","chinese":"目光接触是交流中的一个重要环节。"},{"english":"The control of contactor with a new type of permanent magnet actuator is studied in this thesis.","chinese":"本文对一种新型永磁机构接触器的控制进行了研究。"},{"english":"\"We have already been in contact about Lugano, \" said Figer.","chinese":"“我们已经同卢加诺进行了接触，”费戈说。"},{"english":"Like all drugs，Miacalcic should be kept out of reach of children.","chinese":"与其他药物一样，密钙息应妥善保存，勿让儿童接触。"},{"english":"For hydrophilic materials, the contact angle will be lower than 90 degrees.","chinese":"亲水性材料的接触角度会低于90度。"},{"english":"From that day after, brocade the lotus then don't dare to easily privately get in touch with with route son again.","chinese":"从那日之后，锦莲便不敢再轻易和小路子私下接触。"},{"english":"Europeanization is the output of language contact between the English and Chinese language.","chinese":"汉语的欧化现象是鸦片战争以来英汉语言接触的产物。"},{"english":"Serum TC level is a sensitive contacting biomarker of excessive iodine.","chinese":"血脂为高碘接触的最敏感指标。"},{"english":"So far, a total of 327 contacts have been identified.","chinese":"迄今确定的接触者总人数为327人。"}],"related":[{"definition":["to come into contact with\/to have dealings"],"pinyin":["da3 jiao1 dao4"],"word":"打交道"},{"definition":["to know\/to recognize\/to be familiar with\/to get acquainted with sb\/knowledge\/understanding\/awareness\/cognition"],"pinyin":["ren4 shi5"],"word":"认识"},{"definition":["to exchange\/exchange\/communication\/interaction\/to have social contact (with sb)"],"pinyin":["jiao1 liu2"],"word":"交流"},{"definition":["to understand\/to realize\/to find out","to understand\/to realize\/to find out"],"pinyin":["liao3 jie3","liao3 jie3"],"word":"了解"},{"definition":["to associate (with)\/to have contact (with)\/to hang out (with)\/to date\/(interpersonal) relationship\/association\/contact"],"pinyin":["jiao1 wang3"],"word":"交往"},{"definition":["to arise\/to come into being\/to come about\/to give rise to\/to bring into being\/to bring about\/to produce\/to engender\/to generate\/to appear\/appearance\/emergence\/generation\/production\/yield"],"pinyin":["chan3 sheng1"],"word":"产生"},{"definition":["to touch\/(fig.) to touch on (a matter)"],"pinyin":["chu4 peng4"],"word":"触碰"},{"definition":["to join\/to connect\/to link up\/to communicate"],"pinyin":["gou1 tong1"],"word":"沟通"},{"definition":["friction\/rubbing\/chafing\/fig. disharmony\/conflict\/also written 磨擦"],"pinyin":["mo2 ca1"],"word":"摩擦"},{"definition":["to touch"],"pinyin":["peng4 chu4"],"word":"碰触"},{"definition":["to touch"],"pinyin":["chu4 mo1"],"word":"触摸"},{"definition":["to try\/to attempt\/CL:次[ci4]"],"pinyin":["chang2 shi4"],"word":"尝试"},{"definition":["to come across\/to run into\/to meet\/to hit"],"pinyin":["peng4 dao4"],"word":"碰到"},{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有关"},{"definition":["first\/primary\/initial\/original\/at first\/initially\/originally"],"pinyin":["zui4 chu1"],"word":"最初"},{"definition":["to be interested"],"pinyin":["gan3 xing4 qu4"],"word":"感兴趣"}]}