{"definition":["derivation\/to deduce"],"pinyin":["tui1 dao3"],"traditional":["推導"],"rank":31541.0,"normalized_rank":0.4412995117037203,"fraction":8.225839273669876e-7,"cumulative_fraction":0.9915991783668546,"word":"推导","characters":[{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"},{"definition":["to transmit\/to lead\/to guide\/to conduct\/to direct"],"pinyin":["dao3"],"word":"导"}],"containing_words":[],"sentences":[{"english":"In the second chapter, the forward scattering series methods have been deducted.","chinese":"第二章推导了逆散射级数法的正演过程。"},{"english":"The transfer function of piezoelectric transducers has been deduced in the paper.","chinese":"推导出压电式传感器的传递函数。"},{"english":"According to this assumption, a formula to calculate the amount of shells in one hail suppression operation at a site has been deduced.","chinese":"推导出每个炮点一次防雹作业用弹量的计算公式。"},{"english":"Jeff's hardheaded analysis does not stop at why and how to do all this.","chinese":"萨克斯无懈可击的分析，并不止步于推导和建议。"},{"english":"The relationship between the rock impedance and the measured impedance is derived. The validity and feasibilty of the correction method isp…","chinese":"从理论上推导出了岩心复阻抗与测量阻抗之间的关系。"},{"english":"Mathematical model of space robots based on twist denotations is deduced.","chinese":"推导了旋量表示的空间机器人数学模型。"},{"english":"And finally, the relation between cutset voltage and independent node voltage is derived.","chinese":"推导出割集电压与独立节点电压之间的关系。"},{"english":"In the paper, the frequency response of strainmeter is derived.","chinese":"本文推导了应变仪的频率特性。"},{"english":"Applying the method of mathematical regression analysis, one regression equation was found.","chinese":"用一元回归分析的方法推导出了一个回归方程。"},{"english":"There are some means to solve D'Alembert Solution, one of them is eigenvalue means.","chinese":"该公式的推导方法中一个最基本方法是特征线法。"},{"english":"A restoration algorithm based on the mathematical models of point-spread function was proposed and a Wiener filter algorithm avoiding the.","chinese":"并通过建立相应的数学模型推导了系统的点扩展函数。"},{"english":"Derivation of a formula for determination of proportion of paternal trisomy 21 is presented.","chinese":"推导公式确定比例的父亲是21三体。"},{"english":"A universal model for calculation of gland seal system has been deduced using matrix method.","chinese":"应用矩阵推导出了轴封系统的通用计算模型。"},{"english":"So, let's try to figure it out from these formulas.","chinese":"所以，我们试着从这些式子推导。"},{"english":"Consequently, people may get the relation between seismic interval velocity and displacement pressure.","chinese":"由此可以推导出地震层速度与排替压力的关系式。"},{"english":"Stem derivation is not applied to out-of-vocabulary words.","chinese":"词干推导不会应用到词汇表之外的词汇。"}],"related":[{"definition":["to infer\/inference\/corollary\/reasoned conclusion"],"pinyin":["tui1 lun4"],"word":"推论"},{"definition":["formula"],"pinyin":["gong1 shi4"],"word":"公式"},{"definition":["mathematical model"],"pinyin":["shu4 xue2 mo2 xing2"],"word":"数学模型"},{"definition":["to deduce\/to infer\/to derive\/an implication"],"pinyin":["tui1 yan3"],"word":"推演"},{"definition":["to fit (data to a model)\/a (close) fit"],"pinyin":["ni3 he2"],"word":"拟合"},{"definition":["inductive reasoning"],"pinyin":["gui1 na4 tui1 li3"],"word":"归纳推理"},{"definition":["to sum up\/to summarize\/to conclude from facts\/induction (method of deduction in logic)"],"pinyin":["gui1 na4"],"word":"归纳"},{"definition":["mathematical equation"],"pinyin":["fang1 cheng2"],"word":"方程"},{"definition":["recursion\/recursive (calculation)\/recurrence"],"pinyin":["di4 tui1"],"word":"递推"},{"definition":["to deduce\/to infer\/an implication\/same as 推演"],"pinyin":["tui1 yan3"],"word":"推衍"},{"definition":["lemma (math.)"],"pinyin":["yin3 li3"],"word":"引理"},{"definition":["formula"],"pinyin":["shu4 xue2 gong1 shi4"],"word":"数学公式"},{"definition":["to calculate\/to perform calculations"],"pinyin":["yan3 suan4"],"word":"演算"},{"definition":["rules of calculation (addition, subtraction, multiplication and division)\/algorithm\/fig. to scheme\/to calculate (i.e. plot)"],"pinyin":["yun4 suan4 fa3 ze2"],"word":"运算法则"},{"definition":["to suppose\/to presume\/to assume\/supposing that ...\/if\/hypothesis\/conjecture"],"pinyin":["jia3 she4"],"word":"假设"},{"definition":["the analytic method\/analytic reasoning"],"pinyin":["fen1 xi1 fa3"],"word":"分析法"}]}