{"definition":["to push out\/to release\/to launch\/to publish\/to recommend"],"pinyin":["tui1 chu1"],"traditional":["推出"],"rank":517.0,"normalized_rank":0.00723350076252571,"fraction":0.000286879611637875,"cumulative_fraction":0.517397659333391,"word":"推出","characters":[{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"There are new spin-off products aimed at older girls and women, such as sun screen and cosmetics.","chinese":"该集团还推出了太阳镜和化妆品等新的副产品。"},{"english":"E-Gold used for now BUT their own payment processor soon!","chinese":"虽然现在用eg，但是马上就推出自己的网银。"},{"english":"However, Intel constantly introduces correctives in its plans.","chinese":"然而，英特尔不断推出纠偏，在其计划。"},{"english":"Let's wheel the rubbish out.","chinese":"咱们把垃圾推出去吧。"},{"english":"Nokia will introduce the service in Britain. The price has not been decided.","chinese":"诺基亚将在英国首先推出这项功能，其价格尚未确定。"},{"english":"Have you ever played games launched by Shanda?","chinese":"您玩过盛大网络推出的游戏吗？"},{"english":"Wash protect furniture will be pushed off as a new function in Rejoice series.","chinese":"洗护二合一将会是飘柔推出的产品中新的功能。"},{"english":"FamilyMart is expected to launch a coffee delivery service this coming winter.","chinese":"全家超商则预计在今年冬天推出咖啡外送服务。"},{"english":"As Jen Grant pointed out to us, these are usually small to medium-sized businesses, or groups within larger enterprises. The new features in Box.","chinese":"新推出的功能将帮助中小企业更好地开展业务。"},{"english":"A series of extractive lectures have been held by the institute for 10 times.","chinese":"该学院推出的精品系列讲座已举办10场。"},{"english":"Based on the concept of quality first, the company refined products are not expensive and more expensive.","chinese":"基于品质第一的理念，公司推出的产品贵精不贵多。"},{"english":"My shop is newest promoted portable trades the clothes awning, completely has solved these difficult problems.","chinese":"我店最新推出的便携式换衣棚，完全解决了这些难题。"},{"english":"He thrust the employer out of his office.","chinese":"他把那个雇员推出办公室。"},{"english":"Everyone, especially the civilians (the common people) should vote against him and push him out.","chinese":"请大家，尤其是水民一起把他推出去，不要跑票。"},{"english":"IR2172 is a current sensing IC presented by International Rectifier Company.","chinese":"IR2172是国际整流器公司推出的电流传感芯片。"},{"english":"Star of securities by the introduction of a new generation of market analysis software.","chinese":"由证券之星推出的新一代行情分析软件。"}],"related":[{"definition":["to be published (of art, literary works etc)\/to come out\/to take shape\/to see the light of day"],"pinyin":["mian4 shi4"],"word":"面世"},{"definition":["to hit the market (of a new product)"],"pinyin":["mian4 shi4"],"word":"面市"},{"definition":["to be published\/to come out"],"pinyin":["wen4 shi4"],"word":"问世"},{"definition":["to sell"],"pinyin":["fa1 shou4"],"word":"发售"},{"definition":["under the banner of"],"pinyin":["qi2 xia4"],"word":"旗下"},{"definition":["all new\/completely new"],"pinyin":["quan2 xin1"],"word":"全新"},{"definition":["series\/set"],"pinyin":["xi4 lie4"],"word":"系列"},{"definition":["new product"],"pinyin":["xin1 chan3 pin3"],"word":"新产品"},{"definition":["to put sth on the market"],"pinyin":["tou2 fang4 shi4 chang3"],"word":"投放市场"},{"definition":["to confess one's crime\/first model, version, kind etc (of gadgets, software, cars etc)"],"pinyin":["shou3 kuan3"],"word":"首款"},{"definition":["to release\/to issue\/to announce\/to distribute\/also written 發布|发布[fa1 bu4]","to release\/to issue\/to announce\/to distribute"],"pinyin":["fa1 bu4","fa1 bu4"],"word":"发布"},{"definition":["to exploit (a resource)\/to open up (for development)\/to develop"],"pinyin":["kai1 fa1"],"word":"开发"},{"definition":["to sell strongly\/to be in great demand"],"pinyin":["re4 mai4"],"word":"热卖"},{"definition":["to draw into\/to pull into\/to introduce"],"pinyin":["yin3 ru4"],"word":"引入"},{"definition":["to emerge to meet a historic destiny (idiom)\/to arise at an opportune time\/able to take advantage of an opportunity\/to rise to the occasion"],"pinyin":["ying4 yun4 er2 sheng1"],"word":"应运而生"},{"definition":["goods\/merchandise\/product\/CL:個|个[ge4]"],"pinyin":["chan3 pin3"],"word":"产品"}]}