{"definition":["to extend\/to spread\/to popularize\/generalization\/promotion (of a product etc)"],"pinyin":["tui1 guang3"],"traditional":["推廣"],"rank":1654.0,"normalized_rank":0.023141605921117064,"fraction":0.0000960109449633614,"cumulative_fraction":0.7008282545596619,"word":"推广","characters":[{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"},{"definition":["surname Guang","\"house on a cliff\" radical in Chinese characters (Kangxi radical 53), occurring in 店, 序, 底 etc","wide\/numerous\/to spread"],"pinyin":["Guang3","yan3","guang3"],"word":"广"}],"containing_words":[],"sentences":[{"english":"The South Korean government spends millions promoting contemporary Korean culture abroad.","chinese":"韩国政府花了数百万的钱推广当代韩国文化。"},{"english":"This face-protecting structure has remarkable advantages and is worthy of popularizing.","chinese":"该护面结构优点显著，有推广应用的价值。"},{"english":"The Hamiltonian solution system is generalized to the Reissner-Mindlin thick plate problems.","chinese":"将哈密顿求解体系推广应用于薄板弯曲问题。"},{"english":"Conception of agricultural technology popularization system at the new stage of China;","chinese":"健全的农业推广体系是实现科技兴农的组织保证。"},{"english":"F. Other the promotion behavior of all lawbreaking code.","chinese":"其他一切违反法律法规的推广行为。"},{"english":"In this speech, Dean Ching-yun Chuang promotes the importance of happiness.","chinese":"本讲座我们邀请庄景云主任来推广快乐的重要性。"},{"english":"You are tired, do you still have time to popularize a website?","chinese":"你累不累啊，你还有时间去推广网站吗？"},{"english":"It is worth popularizing as a new type undersurface layer gradation of asphalt pavement.","chinese":"是一种值得推广的新型沥青路面下面层级配。"},{"english":"The image method of conductor is popularized.","chinese":"将导体镜象法推广应用到介质。"},{"english":"The method is simple to implement, has high accuracy, and can be widely used.","chinese":"该方法实现过程简单，分类准确，可推广性较强。"},{"english":"The communication mechanism in this paper can be extended to other communication mechanism besides serial devices in VxWorks.","chinese":"本文的方案可以推广到串行设备以外的其它通信机制。"},{"english":"Promoting literacy is one of Laura Bush's main projects as first lady.","chinese":"推广读写能力是萝拉身为第一夫人的主要计画。"},{"english":"Aim To study dynamical behavior and travelling solutions of generalized BBM equation.","chinese":"目的研究了推广的BBM方程的动力学行为和行波解。"},{"english":"Clever uses of shopping bags in advertising campaigns by various companies.","chinese":"许多商家巧妙地利用购物袋来推广自己的品牌。"},{"english":"This assess standard has achieved remarkable results after its wide spread and application at the whole Inc.","chinese":"经在全公司普及推广运用，取得了显著效果。"},{"english":"Later, aristocrats and literary figures helped expand the ceremony to common people.","chinese":"后来，贵族和文人学士把中秋祭月的传统推广到民间。"}],"related":[{"definition":["to disseminate\/to give publicity to\/propaganda\/CL:個|个[ge4]"],"pinyin":["xuan1 chuan2"],"word":"宣传"},{"definition":["to spread extensively\/to generalize\/widespread\/popular\/universal\/ubiquitous\/pervasive"],"pinyin":["pu3 ji2"],"word":"普及"},{"definition":["to disseminate\/to propagate\/to spread"],"pinyin":["chuan2 bo1"],"word":"传播"},{"definition":["to put into effect\/to carry out"],"pinyin":["tui1 xing2"],"word":"推行"},{"definition":["marketing"],"pinyin":["ying2 xiao1"],"word":"营销"},{"definition":["to exploit (a resource)\/to open up (for development)\/to develop"],"pinyin":["kai1 fa1"],"word":"开发"},{"definition":["to commercialize"],"pinyin":["shang1 ye4 hua4"],"word":"商业化"},{"definition":["vigorous expansion\/rapid development"],"pinyin":["da4 li4 fa1 zhan3"],"word":"大力发展"},{"definition":["to expand"],"pinyin":["tuo4 zhan3"],"word":"拓展"},{"definition":["to be in operation\/to do business\/(of train, bus etc) to be in service\/operation\/service"],"pinyin":["yun4 ying2"],"word":"运营"},{"definition":["research and development\/to develop"],"pinyin":["yan2 fa1"],"word":"研发"},{"definition":["to advocate\/to initiate\/to propose\/to be a proponent of (an idea or school of thought)"],"pinyin":["chang4 dao3"],"word":"倡导"},{"definition":["to pay\/to cover the costs"],"pinyin":["fu4 fei4"],"word":"付费"},{"definition":["to industrialize\/industrialization"],"pinyin":["chan3 ye4 hua4"],"word":"产业化"},{"definition":["to cultivate\/to train\/to groom\/training"],"pinyin":["pei2 xun4"],"word":"培训"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推动"}]}