{"definition":["to think over"],"pinyin":["tui1 qiao1"],"traditional":["推敲"],"rank":19613.0,"normalized_rank":0.2744113161613476,"fraction":0.000002489356470876529,"cumulative_fraction":0.9738926136605816,"word":"推敲","characters":[{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"},{"definition":["to hit\/to strike\/to tap\/to rap\/to knock\/to rip sb off\/to overcharge"],"pinyin":["qiao1"],"word":"敲"}],"containing_words":[],"sentences":[{"english":"Hence, sometimes I try to figure out myself through horoscopes, zodiacs, etc by hoping they can help me in understanding myself.","chinese":"所以，有时会通过星座生肖等，去推敲自己的性格。"},{"english":"They went through the details of the plan over and over again to make sure that there was no possibility of failure.","chinese":"为了保证不出岔子，他们把计划的细节反复作了推敲。"},{"english":"We should reconsider it and weight the wording.","chinese":"我们应该对此条重新考虑，推敲一下措词。"},{"english":"He turned the matter over in his mind slowly and deliberately .","chinese":"他把这问题在心上慢慢地审慎地反复推敲。"},{"english":"He hashed a phrase in order to colour the sentence.","chinese":"他反复推敲一个习语以使该句增色。"},{"english":"Good writers usually strike a balance between revising and completion.","chinese":"优秀的作家总在成稿之前反复推敲。"},{"english":"Therefore own look up, deliberates is very good.","chinese":"所以自己多查，多推敲是很好的。"},{"english":"Second-guessing is what gets in the way of a writer’s ability to write faster.","chinese":"“推敲”是阻碍作者写得更快的绊脚石。"},{"english":"Game has gone, who will care about weigh and a plate of CanQi in addition to the world of mortals?","chinese":"对弈的人已走，谁还在意推敲红尘之外的一盘残棋？"},{"english":"But the growing scrutiny of the village guard system is fueling calls for its disbandment.","chinese":"但是对卫队体系的不断推敲更助长了要求解散的声音。"},{"english":"The West has no grounds to monopolize the rights of speech in terms of human rights.","chinese":"西方国家的人权话语垄断是完全经不起推敲的。"}],"related":[{"definition":["to analyze\/to try to figure out\/to try to fathom"],"pinyin":["chuai3 mo2"],"word":"揣摩"},{"definition":["to consider\/to deliberate\/to fill up a cup to the brim"],"pinyin":["zhen1 zhuo2"],"word":"斟酌"},{"definition":["to ponder\/to mull over\/to think through\/Taiwan pr. [zhuo2 mo2]","to carve and polish (jade)\/to polish and refine a literary work"],"pinyin":["zuo2 mo5","zhuo2 mo2"],"word":"琢磨"},{"definition":["weighing every word"],"pinyin":["zi4 zhen1 ju4 zhuo2"],"word":"字斟句酌"},{"definition":["to study\/to examine\/to probe\/to study the underlying principles"],"pinyin":["tui1 jiu1"],"word":"推究"},{"definition":["to design\/to plot\/to plan out\/to compose\/to draw a mental sketch\/conception\/plan\/idea\/composition"],"pinyin":["gou4 si1"],"word":"构思"},{"definition":["to study attentively (a book)\/to delve into"],"pinyin":["yan2 du2"],"word":"研读"},{"definition":["to look into (a matter)"],"pinyin":["xi4 jiu1"],"word":"细究"},{"definition":["(dialect) to savor\/to test the taste of\/(fig.) to ponder upon\/to mull over"],"pinyin":["za1 mo5"],"word":"咂摸"},{"definition":["to discuss\/to bring up various ideas for discussion"],"pinyin":["shang1 que4"],"word":"商榷"},{"definition":["to perform an in-depth investigation"],"pinyin":["shen1 jiu1"],"word":"深究"},{"definition":["add and delete"],"pinyin":["zeng1 shan1"],"word":"增删"},{"definition":["careful thought"],"pinyin":["shu2 lu:4"],"word":"熟虑"},{"definition":["to be able to withstand\/to be able to endure"],"pinyin":["jing1 de5 qi3"],"word":"经得起"},{"definition":["literal\/word by word and phrase by phrase"],"pinyin":["zhu2 zi4 zhu2 ju4"],"word":"逐字逐句"},{"definition":["words\/expressions\/writing"],"pinyin":["zi4 ju4"],"word":"字句"}]}