{"definition":["promoter\/advocate\/driving force\/pushing hands (two-person training routine esp. in t'ai chi)"],"pinyin":["tui1 shou3"],"traditional":["推手"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"推手","characters":[{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"},{"definition":["hand\/(formal) to hold\/person engaged in certain types of work\/person skilled in certain types of work\/personal(ly)\/convenient\/classifier for skill\/CL:雙|双[shuang1],隻|只[zhi1]"],"pinyin":["shou3"],"word":"手"}],"containing_words":[],"sentences":[{"english":"These issues will be prime movers in the currency markets as unrest expands.","chinese":"随着动荡局面加剧，这些问题将是汇市的主推手。"},{"english":"Taichi Sanshou is the extension of Taichi push-hands exercise.","chinese":"太极散手是太极推手技法的延伸。"},{"english":"Fry Everyman on the network red, it is the one share that the network pushs handiwork to make only.","chinese":"把普通人在网络上炒红，只是网络推手工作的一部分。"},{"english":"We must watch out some ill-intentioned Internet planners who are trying to mislead public opinion.","chinese":"我们要警惕某些恶意网路推手企图误导舆论。"},{"english":"Fixed and restricted step Push Hands can be described in the following way.","chinese":"定步推手用以下的步骤和方法。"},{"english":"Ideology was a big part of what drove the war.","chinese":"意识形态在很大程度上成为了战争的推手。"},{"english":"The two taijiquan boxers were practising hand-pushing exercise in the yard.","chinese":"这两名太极拳手正在院子里练习推手。"},{"english":"Chinese and English Introductions Taichi Sanshou is the extension of Taichi push-hands exercise.","chinese":"太极散手是太极推手技法的延伸。"},{"english":"Taichi Push-hands Exercise is a duel event between two bare-handed people, and therefore has a feature of duel between two opponents.","chinese":"太极推手是太极拳运动一项两人徒手对练的项目。"},{"english":"The government is, in some respects, the architect of this mess.","chinese":"从某些角度看，政府正是制造这场混乱的幕后推手。"},{"english":"Who is Zhang Xinming driving force behind the exodus?","chinese":"谁是张新明出逃的幕后推手？"},{"english":"Ren is one of the marketing brains behind Old Boys.","chinese":"任就是老男孩的幕后推手之一。"},{"english":"The question then becomes, what’s behind all this extreme weather?","chinese":"那么，问题成了什么是所有这些极端天气背后的推手？"}],"related":[{"definition":["driving force"],"pinyin":["tui1 dong4 li4"],"word":"推动力"},{"definition":["to push the wave and add to the billows (idiom); to add momentum\/to encourage sth to get bigger\/to add fuel to the fire"],"pinyin":["tui1 bo1 zhu4 lan2"],"word":"推波助澜"},{"definition":["motivation\/moving force\/underlying force\/agent"],"pinyin":["dong4 yin1"],"word":"动因"},{"definition":["to borrow sb's authority\/to seize an opportunity"],"pinyin":["jie4 shi4"],"word":"借势"},{"definition":["to bolster\/to give a boost to (the economy etc)"],"pinyin":["tui1 zhu4"],"word":"推助"},{"definition":["behind the scenes"],"pinyin":["mu4 hou4"],"word":"幕后"},{"definition":["behind\/at the back\/in the rear\/behind sb's back"],"pinyin":["bei4 hou4"],"word":"背后"},{"definition":["lit. four ounces can move a thousand catties (idiom)\/fig. to achieve much with little effort"],"pinyin":["si4 liang3 bo1 qian1 jin1"],"word":"四两拨千斤"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推动"},{"definition":["to boost support or interest\/to campaign\/to promote"],"pinyin":["zao4 shi4"],"word":"造势"},{"definition":["(aerospace) to boost\/booster (rocket)\/(behavioral economics) to nudge"],"pinyin":["zhu4 tui1"],"word":"助推"},{"definition":["in the final analysis\/ultimately"],"pinyin":["gui1 gen1 jie2 di3"],"word":"归根结底"},{"definition":["winner"],"pinyin":["ying2 jia1"],"word":"赢家"},{"definition":["beneficiary"],"pinyin":["huo4 yi4 zhe3"],"word":"获益者"},{"definition":["lit. the first person to bury funerary dolls (idiom)\/fig. the originator of an evil practice"],"pinyin":["shi3 zuo4 yong3 zhe3"],"word":"始作俑者"},{"definition":["power\/influence\/potential\/momentum\/tendency\/trend\/situation\/conditions\/outward appearance\/sign\/gesture\/male genitals"],"pinyin":["shi4"],"word":"势"}]}