{"definition":["server push (computing)"],"pinyin":["tui1 song4"],"traditional":["推送"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"推送","characters":[{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"},{"definition":["to deliver\/to carry\/to give (as a present)\/to present (with)\/to see off\/to send"],"pinyin":["song4"],"word":"送"}],"containing_words":[],"sentences":[{"english":"Applications can subscribe to push notifications.","chinese":"应用可以订阅推送通知。"},{"english":"Unwinding of jumbo roll is pushed by step-less speed-regulator to stable material tension during unwinding.","chinese":"原材料放卷配装无级调速推送，放卷材料张力恒定。"},{"english":"Push creates the opportunity for repeated touchpoints.","chinese":"推送在各接触点上产生机会。"},{"english":"Jumbo Roll Paper unwinding roll adopts flat belt for pushing.","chinese":"原纸放卷采用平皮带推送。"},{"english":"Messages sent between Boxcar users will be pushed out immediately.","chinese":"Boxcar用户之间的消息会被即时推送。"},{"english":"All configuration changes are pushed out to the other cluster members when they are submitted.","chinese":"所有配置更改都将在提交时推送到其他集群成员那里。"},{"english":"Now, new submissions are pushed to the app, resulting in virtually no delay.","chinese":"现在，新提交直接推送给应用程序，实际没有了延迟。"},{"english":"Unwinding roll of raw material is equipped with stepless speed-adjustment pushing, the tension for unwinding material is constant.","chinese":"原材料放卷配装无级调速推送，放卷材料张力恒定。"},{"english":"\"We are working on push,\" Hewitt said last night.","chinese":"“我们正在研发推送式通知，”休伊特昨晚说。"},{"english":"The service offers apps and push notifications for all of these platforms.","chinese":"这项服务在全平台上提供了应用程序和推送提醒。"},{"english":"Instruction computes the bitwise complement of an integer value and pushes the result onto the stack.","chinese":"指令计算整数值的按位求补并将结果推送到堆栈上。"},{"english":"This simulates the data being pushed from the server.","chinese":"这么做就模拟了从服务器端推送数据的过程。"}],"related":[{"definition":["tweet (on Twitter)\/(HK, Tw) to \"bump\" a forum thread to raise its profile\/to reply to original poster (or recommend a post) on PTT bulletin board"],"pinyin":["tui1 wen2"],"word":"推文"},{"definition":["to replace the old with new\/to renew\/to renovate\/to upgrade\/to update\/to regenerate"],"pinyin":["geng1 xin1"],"word":"更新"},{"definition":["article\/essay\/literary works\/writings\/hidden meaning\/CL:篇[pian1],段[duan4],頁|页[ye4]"],"pinyin":["wen2 zhang1"],"word":"文章"},{"definition":["to sticky (an Internet forum thread etc)"],"pinyin":["zhi4 ding3"],"word":"置顶"},{"definition":["to transmit\/to dispatch\/to issue (an official document or credential)"],"pinyin":["fa1 song4"],"word":"发送"},{"definition":["to share (let others have some of sth good)"],"pinyin":["fen1 xiang3"],"word":"分享"},{"definition":["to leave a message\/to leave one's comments\/message"],"pinyin":["liu2 yan2"],"word":"留言"},{"definition":["regular column or segment (in a publication or broadcast program)\/program (TV or radio)"],"pinyin":["lan2 mu4"],"word":"栏目"},{"definition":["to transmit\/to forward (mail, SMS, packets of data)\/to pass on\/to republish (an article from another publication)"],"pinyin":["zhuan3 fa1"],"word":"转发"},{"definition":["content\/substance\/details\/CL:個|个[ge4],項|项[xiang4]"],"pinyin":["nei4 rong2"],"word":"内容"},{"definition":["private correspondence\/personal letter\/(computing) personal message (PM)\/to message sb"],"pinyin":["si1 xin4"],"word":"私信"},{"definition":["dried food (including dried fruits, mushrooms and seafoods such as shrimp and abalone)\/(fig.) (coll.) knowledge presented in readily assimilable form\/just what you want to know: no more, no less (no 水分[shui3 fen1])"],"pinyin":["gan1 huo4"],"word":"干货"},{"definition":["title\/heading\/headline\/caption\/subject"],"pinyin":["biao1 ti2"],"word":"标题"},{"definition":["lead story (on the news)","Toutiao, personalized content recommendation app (abbr. for 今日頭條|今日头条[Jin1 ri4 Tou2 tiao2])"],"pinyin":["tou2 tiao2","Tou2 tiao2"],"word":"头条"},{"definition":["to release\/to issue\/to announce\/to distribute\/also written 發布|发布[fa1 bu4]","to release\/to issue\/to announce\/to distribute"],"pinyin":["fa1 bu4","fa1 bu4"],"word":"发布"},{"definition":["to submit articles for publication\/to contribute (writing)"],"pinyin":["tou2 gao3"],"word":"投稿"}]}