{"definition":["lit. to cover one's ears whilst stealing a bell\/to deceive oneself\/to bury one's head in the sand (idiom)"],"pinyin":["yan3 er3 dao4 ling2"],"traditional":["掩耳盜鈴"],"rank":40948.0,"normalized_rank":0.5729156464678969,"fraction":3.502003268417753e-7,"cumulative_fraction":0.9968372630422204,"word":"掩耳盗铃","characters":[{"definition":["to cover up\/to close\/to surprise"],"pinyin":["yan3"],"word":"掩"},{"definition":["ear\/handle (archaeology)\/and that is all (Classical Chinese)"],"pinyin":["er3"],"word":"耳"},{"definition":["to steal\/to rob\/to plunder\/thief\/bandit\/robber"],"pinyin":["dao4"],"word":"盗"},{"definition":["(small) bell\/CL:隻|只[zhi1]"],"pinyin":["ling2"],"word":"铃"}],"containing_words":[],"sentences":[{"english":"So I can make believe I have everything.","chinese":"纵然我可以掩耳盗铃的以为自己拥有了一切。"},{"english":"Ungrateful people are actually cheating themselves, scientists believe.","chinese":"科学家们以为，不知感恩的人理论上是掩耳盗铃。"},{"english":"You nosl do not stay; I for soon for more why a self-deception for soon for more.","chinese":"迩终究没有一句挽留，我又何必再掩耳盗铃。"}],"related":[{"definition":["to deceive others and to deceive oneself\/to believe one's own lies"],"pinyin":["zi4 qi1 qi1 ren2"],"word":"自欺欺人"},{"definition":["trying to hide it makes it more conspicuous (idiom); A cover up only makes matters worse."],"pinyin":["yu4 gai4 mi2 zhang1"],"word":"欲盖弥彰"},{"definition":["to pass the misfortune on to sb else (idiom); to blame others\/to pass the buck"],"pinyin":["jia4 huo4 yu2 ren2"],"word":"嫁祸于人"},{"definition":["to pretend that everything is going well"],"pinyin":["fen3 shi4 tai4 ping2"],"word":"粉饰太平"},{"definition":["to cover up one's faults (idiom)\/to whitewash"],"pinyin":["wen2 guo4 shi4 fei1"],"word":"文过饰非"},{"definition":["lit. 300 silver taels not hidden here (idiom); fig. to reveal what one intends to hide"],"pinyin":["ci3 di4 wu2 yin2 san1 bai3 liang3"],"word":"此地无银三百两"},{"definition":["to play deaf-mute"],"pinyin":["zhuang1 long2 zuo4 ya3"],"word":"装聋作哑"},{"definition":["a mantis trying to stop a chariot (idiom)\/to overrate oneself and attempt sth impossible\/also written 螳臂擋車|螳臂挡车[tang2 bi4 dang3 che1]"],"pinyin":["tang2 bi4 dang1 che1"],"word":"螳臂当车"},{"definition":["lit. a thief crying \"Stop the thief!\" (idiom)\/fig. to accuse sb of a theft and try to sneak away oneself\/to cover up one's misdeeds by shifting the blame onto others"],"pinyin":["zei2 han3 zhuo1 zei2"],"word":"贼喊捉贼"},{"definition":["making a deer out to be a horse (idiom); deliberate misrepresentation"],"pinyin":["zhi3 lu4 wei2 ma3"],"word":"指鹿为马"},{"definition":["ostrich policy (sticking one's head in the sand, failing to acknowledge danger)"],"pinyin":["tuo2 niao3 zheng4 ce4"],"word":"鸵鸟政策"},{"definition":["the one who has retreated 50 steps laughs at the one who has retreated 100 steps (idiom)\/the pot calls the kettle black"],"pinyin":["wu3 shi2 bu4 xiao4 bai3 bu4"],"word":"五十步笑百步"},{"definition":["to obscure the facts (idiom); to mislead the public with prevarication and deliberate falsehoods"],"pinyin":["hun4 xiao2 shi4 ting1"],"word":"混淆视听"},{"definition":["to buy a wooden box and return the pearls inside\/to show poor judgment (idiom)"],"pinyin":["mai3 du2 huan2 zhu1"],"word":"买椟还珠"},{"definition":["to confuse right and wrong (idiom)"],"pinyin":["hun4 xiao2 shi4 fei1"],"word":"混淆是非"},{"definition":["to crush one's own foot while trying to maneuver a rock (to a cliff edge, to drop on one's enemy) (idiom)\/hoisted by one's own petard"],"pinyin":["ban1 qi3 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬起石头砸自己的脚"}]}