{"definition":["to withdraw (money)\/to collect (left luggage)\/to extract\/to refine"],"pinyin":["ti2 qu3"],"traditional":["提取"],"rank":5782.0,"normalized_rank":0.08089768164201866,"fraction":0.000019505676478918242,"cumulative_fraction":0.8758476732298275,"word":"提取","characters":[{"definition":["to carry (hanging down from the hand)\/to lift\/to put forward\/to mention\/to raise (an issue)\/upwards character stroke\/lifting brush stroke (in painting)\/scoop for measuring liquid"],"pinyin":["ti2"],"word":"提"},{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"}],"containing_words":[],"sentences":[{"english":"Text analysis is the process of enabling computers to extract meaning from text.","chinese":"文本分析是指使计算机能够从文本中提取意义的过程。"},{"english":"The main difficulty of off-line handwritten signature verification is feature extraction.","chinese":"离线手写签名鉴别的主要困难在于签名特征的提取。"},{"english":"The process of phytosterol extraction from soybean oil deodorizer distillate was studied.","chinese":"对脱臭馏出物中提取植物甾醇的工艺进行了研究。"},{"english":"ObjectiveTo obtain the best extraction process of Xiaocuoyin.","chinese":"目的优选消痤饮的最佳提取工艺。"},{"english":"This study demonstrated A. pseudoalhagi extract has no significant side effects on rats.","chinese":"本研究证明骆驼刺提取物对大鼠无明显毒副作用。"},{"english":"ObjectiveTo investigate the in vitro antitumor action of the different extracts of different solvents from Ganoderma lipsiense.","chinese":"目的探讨树舌灵芝各溶剂提取物的抗癌作用。"},{"english":"C has no therapeutic action on AA mouse.","chinese":"菝葜提取物C组分对AA小鼠没有治疗作用。"},{"english":"Using this function, we can get more representational eigenvector from email.","chinese":"利用此函数可提取到更具有代表性的邮件特征向量。"},{"english":"Alterna Professional Haircare uses caviar extract in its Caviar Anti-Aging collection.","chinese":"替代专业护发品使用鱼子酱提取的鱼子酱抗衰老收集。"},{"english":"Oil \"is\" extracted from wheat germ bacteria of wheat.","chinese":"小麦胚芽油是从细菌中提取的小麦籽粒。"},{"english":"Tussah pupa oil was extracted from tussah pupa.","chinese":"以柞蚕蛹为原料进行柞蚕蛹油提取的研究。"},{"english":"The inhibitory effect on tumor effect of three extracts of D.","chinese":"本实验研究迭鞘石斛三种提取物的抗肿瘤作用。"},{"english":"Along with the extending of time, the contact toxicity of A. wormwood extracts on drosophila increased.","chinese":"随着时间的延长，艾草提取液对果蝇的触杀效果增强。"},{"english":"The watery fluid in the central cavity of the coconut, used chiefly as a beverage.","chinese":"从椰子果肉中提取的奶状液体，用于食物或作为饮料。"},{"english":"Extract for use by accessibility dev.","chinese":"提取以用于无障碍设备。"},{"english":"OBJECTIVE To optimize the conditions for the extraction process of Dioscorea cirrhosa .","chinese":"目的优选薯莨的最佳提取工艺条件。"}],"related":[{"definition":["to gather\/to collect\/to harvest"],"pinyin":["cai3 ji2"],"word":"采集"},{"definition":["to extract (ore, minerals etc)\/to refine\/to purify\/to process"],"pinyin":["ti2 lian4"],"word":"提炼"},{"definition":["to generate\/to produce\/generated\/produced"],"pinyin":["sheng1 cheng2"],"word":"生成"},{"definition":["to purify"],"pinyin":["ti2 chun2"],"word":"提纯"},{"definition":["(chemistry) liquid-liquid extraction (aka solvent extraction)\/to extract"],"pinyin":["cui4 qu3"],"word":"萃取"},{"definition":["to extract\/to remove\/to draw (a sales commission, venom from a snake etc)"],"pinyin":["chou1 qu3"],"word":"抽取"},{"definition":["sample\/specimen"],"pinyin":["yang4 ben3"],"word":"样本"},{"definition":["comparison\/to verify by comparing"],"pinyin":["bi3 dui4"],"word":"比对"},{"definition":["to compose\/to constitute\/compound\/synthesis\/mixture\/synthetic"],"pinyin":["he2 cheng2"],"word":"合成"},{"definition":["to gather\/to collect"],"pinyin":["shou1 ji2"],"word":"收集"},{"definition":["stockpile\/to store\/to stockpile\/storage"],"pinyin":["chu3 cun2"],"word":"储存"},{"definition":["to change\/to transform\/isomerization (chemistry)"],"pinyin":["zhuan3 hua4"],"word":"转化"},{"definition":["to store up\/to stockpile\/(computer) to save\/to store\/memory\/storage"],"pinyin":["cun2 chu3"],"word":"存储"},{"definition":["to retrieve (data)\/to look up\/retrieval\/search"],"pinyin":["jian3 suo3"],"word":"检索"},{"definition":["to keep\/to preserve\/extant\/to remain (from the past)"],"pinyin":["liu2 cun2"],"word":"留存"},{"definition":["to choose"],"pinyin":["xuan3 qu3"],"word":"选取"}]}