{"definition":["to gather\/to collect"],"pinyin":["sou1 ji2"],"traditional":["搜集"],"rank":7962.0,"normalized_rank":0.11139871000237853,"fraction":0.000012057022090661287,"cumulative_fraction":0.9093424794085576,"word":"搜集","characters":[{"definition":["to search"],"pinyin":["sou1"],"word":"搜"},{"definition":["to gather\/to collect\/collected works\/classifier for sections of a TV series etc: episode"],"pinyin":["ji2"],"word":"集"}],"containing_words":[],"sentences":[{"english":"The students collected a bag of bark for their science project.","chinese":"学生为进行科学计画搜集了一袋树皮。"},{"english":"Chapter four makes a collection and arrangement in terms of Ho Group Hunting Oracle.","chinese":"第四章对何组田猎卜辞进行搜集和整理。"},{"english":"It can change material roller and collect materials automatically.","chinese":"它可以改变材料的压路机和搜集材料不攻自破。"},{"english":"The children love to collect the colorful Hsiang Bao.","chinese":"小孩喜欢搜集鲜艳的香包。"},{"english":"She collected many writing materials through a series of investigations and surveys.","chinese":"一系列内查外访，她搜集到了许多写作素材。"},{"english":"He showed his friends the precious stamps which he has collected these years.","chinese":"他把这些年来所搜集的珍贵邮票拿给朋友看。"},{"english":"She began working when she was 4, collecting grasses that her father wove into mats.","chinese":"当她只有四岁时，便为编制草席的父亲搜集青草。"},{"english":"He is a man of ex-plays (criminal record).","chinese":"他是一个搜集犯罪证据的人。"},{"english":"He asked someone else to do all the legwork of gathering information.","chinese":"他叫了别人来做所有搜集资料的跑腿活。"},{"english":"The material collected from a number of websites, and edited by a lawyer.","chinese":"本文素材搜集自多家网站，由佳和律师编辑整理。"},{"english":"Book I gleans nearly seventy tales of the art of management.","chinese":"第一册搜集了近七十个有关管理艺术的故事。"},{"english":"The port scanning also is the hacker collects the goal main engine information one commonly used method.","chinese":"端口扫描也是黑客搜集目标主机信息的一种常用方法。"},{"english":"Since last week, police have interviewed members of the polygamist sect looking for evidence.","chinese":"警方自上周起询问了一夫多妻组织的成员，搜集证据。"},{"english":"These pictures are collected without choice.","chinese":"这些画是不分好坏搜集来的。"},{"english":"The underneath is the standpoint that the water demon takes a wide view some movie review a collection editor.","chinese":"下面是水妖纵观一些影评搜集编辑的观点。"},{"english":"It’s not straightforward to compare oil spilled on an open sea with garbage picked up on beaches.","chinese":"要比较外海的油污与在海滩上搜集到的垃圾并非易事。"}],"related":[{"definition":["to gather\/to collect"],"pinyin":["shou1 ji2"],"word":"收集"},{"definition":["to search\/to look for"],"pinyin":["sou1 xun2"],"word":"搜寻"},{"definition":["material\/resources\/data\/information\/profile (Internet)\/CL:份[fen4],個|个[ge4]"],"pinyin":["zi1 liao4"],"word":"资料"},{"definition":["to gather\/to collect\/to harvest"],"pinyin":["cai3 ji2"],"word":"采集"},{"definition":["to consult\/to refer to\/to look sth up in a reference source"],"pinyin":["cha2 yue4"],"word":"查阅"},{"definition":["information\/intelligence"],"pinyin":["qing2 bao4"],"word":"情报"},{"definition":["summary\/to summarize\/to collect (data, receipts etc)\/to gather and report\/also written 匯總|汇总","summary\/to summarize\/to collect (data, receipts etc)\/to gather and report"],"pinyin":["hui4 zong3","hui4 zong3"],"word":"汇总"},{"definition":["to find\/to search out"],"pinyin":["zhao3 chu1"],"word":"找出"},{"definition":["to arrange\/to tidy up\/to sort out\/to straighten out\/to list systematically\/to collate (data, files)\/to pack (luggage)"],"pinyin":["zheng3 li3"],"word":"整理"},{"definition":["to thumb through\/to flip through (a book)"],"pinyin":["fan1 yue4"],"word":"翻阅"},{"definition":["thorough and detailed\/exhaustive\/the tedious details in full"],"pinyin":["xiang2 jin4"],"word":"详尽"},{"definition":["huge volume"],"pinyin":["hai3 liang4"],"word":"海量"},{"definition":["to screen\/to discriminate\/to reexamine a case\/screening (of applicants etc)"],"pinyin":["zhen1 bie2"],"word":"甄别"},{"definition":["database"],"pinyin":["zi1 liao4 ku4"],"word":"资料库"},{"definition":["to search for\/to look up"],"pinyin":["cha2 zhao3"],"word":"查找"},{"definition":["to infer\/to deduce\/to predict\/to extrapolate"],"pinyin":["tui1 duan4"],"word":"推断"}]}