{"definition":["to move out (vacate)\/to shift sth out"],"pinyin":["ban1 chu1 qu4"],"traditional":["搬出去"],"rank":32550.0,"normalized_rank":0.4554167307934465,"fraction":7.513468454583649e-7,"cumulative_fraction":0.9923927082211688,"word":"搬出去","characters":[{"definition":["to move (i.e. relocate oneself)\/to move (sth relatively heavy or bulky)\/to shift\/to copy indiscriminately"],"pinyin":["ban1"],"word":"搬"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"Well, I'm gonna move out anyway.","chinese":"额，无论怎样，我都要搬出去。"},{"english":"Some day I vill paint a masterpiece, and ve shall all go away.","chinese":"总有一天我要画一幅杰作，我们就可以都搬出去了。"},{"english":"He told me I had to start paying rent, or move out.","chinese":"他说我得开始付房租，要么就搬出去。"},{"english":"The present householder will move out by this weekend and I'll move in by next Wednesday.","chinese":"目前的住户本周未搬出去，我下星期三搬进去。"},{"english":"At present, the householder doesn't move out, so I am about to move in next Wednesday.","chinese":"目前的住户本周未搬出去，我下星期三搬进去。"},{"english":"I’m still hoping, planning, to move out.","chinese":"但我仍希望着有一天我可以搬出去。"},{"english":"When I reached my senior year, I decided to move away for college.","chinese":"升读高三时，我决定读大学后从家里搬出去。"},{"english":"A: So, are you going to move out?","chinese":"那你打算搬出去了？"},{"english":"Kim asks her mother why Jack had moved out.","chinese":"金姆问她母亲，为何杰克搬出去住过。"},{"english":"Otherwise, he might as well move out of the White House, and hand the keys over to the Tea Party.","chinese":"不然，他还不如从白宫搬出去，将大权交给茶会党。"},{"english":"So, are you going to move out?","chinese":"那你打算搬出去了？"},{"english":"The present owner will move out this weekend ,so I will move in next wednesday .","chinese":"目前的住户本周未搬出去，我下星期三搬进去。"},{"english":"She had a fight with her family and moved out.","chinese":"她跟家人大吵一架就搬出去住。"},{"english":"Then everything just started up again. Normaden was moved out, and Andy was living in solitary splendour again.","chinese":"诺曼登搬出去后，安迪又再度享受到独居的优惠。"},{"english":"The couple moved out and Mr. Tan moved in. Mr.","chinese":"那对男女搬出去之后又住进来一位潭先生。"},{"english":"He is going to move out, do not always say uncle sister-in-law, the family man.","chinese":"他要搬出去住，大嫂不依，说二叔永远是这个家的人。"}],"related":[]}