{"definition":["to move a stone and stub one's toe\/to shoot oneself in the foot (idiom)"],"pinyin":["ban1 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"traditional":["搬石頭砸自己的腳"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"搬石头砸自己的脚","characters":[{"definition":["to move (i.e. relocate oneself)\/to move (sth relatively heavy or bulky)\/to shift\/to copy indiscriminately"],"pinyin":["ban1"],"word":"搬"},{"definition":["dry measure for grain equal to ten dou 斗\/ten pecks\/one hundred liters","surname Shi","rock\/stone\/stone inscription\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["dan4","Shi2","shi2"],"word":"石"},{"definition":["suffix for nouns","head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]"],"pinyin":["tou5","tou2"],"word":"头"},{"definition":["to smash\/to pound\/to fail\/to muck up\/to bungle"],"pinyin":["za2"],"word":"砸"},{"definition":["self\/oneself\/from\/since\/naturally\/surely"],"pinyin":["zi4"],"word":"自"},{"definition":["self\/oneself\/sixth of the ten Heavenly Stems 十天干[shi2 tian1 gan1]\/sixth in order\/letter \"F\" or Roman \"VI\" in list \"A, B, C\", or \"I, II, III\" etc\/hexa"],"pinyin":["ji3"],"word":"己"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["foot\/leg (of an animal or an object)\/base (of an object)\/CL:雙|双[shuang1],隻|只[zhi1]\/classifier for kicks","variant of 角[jue2]\/role"],"pinyin":["jiao3","jue2"],"word":"脚"}],"containing_words":[],"sentences":[],"related":[{"definition":["to crush one's own foot while trying to maneuver a rock (to a cliff edge, to drop on one's enemy) (idiom)\/hoisted by one's own petard"],"pinyin":["ban1 qi3 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬起石头砸自己的脚"},{"definition":["to dig one's own grave"],"pinyin":["zi4 jue2 fen2 mu4"],"word":"自掘坟墓"},{"definition":["lit. to try to steal a chicken only to end up losing the rice used to lure it (idiom)\/fig. to try to gain an advantage only to end up worse off\/to go for wool and come back shorn"],"pinyin":["tou1 ji1 bu4 cheng2 shi2 ba3 mi3"],"word":"偷鸡不成蚀把米"},{"definition":["to bring trouble on oneself"],"pinyin":["zi4 zhao3 ku3 chi1"],"word":"自找苦吃"},{"definition":["to ask for trouble (idiom)\/to make a rod for one's own back"],"pinyin":["zi4 tao3 ku3 chi1"],"word":"自讨苦吃"},{"definition":["to eat one's own fruit (idiom); fig. suffering the consequences of one's own action\/to reap what one has sown"],"pinyin":["zi4 shi2 qi2 guo3"],"word":"自食其果"},{"definition":["to confess without being pressed\/to make a confession without duress"],"pinyin":["bu4 da3 zi4 zhao1"],"word":"不打自招"},{"definition":["to follow the path to one's own doom (idiom)\/to bring about one's own destruction"],"pinyin":["zi4 xun2 si3 lu4"],"word":"自寻死路"},{"definition":["to ask for trouble\/to invite difficulties"],"pinyin":["zi4 zhao3 ma2 fan5"],"word":"自找麻烦"},{"definition":["having given away a bride, to lose one's army on top of it (idiom)\/to suffer a double loss after trying to trick the enemy"],"pinyin":["pei2 le5 fu1 ren2 you4 zhe2 bing1"],"word":"赔了夫人又折兵"},{"definition":["to reap what one has sown (idiom)\/to stew in one's own juice"],"pinyin":["zi4 zuo4 zi4 shou4"],"word":"自作自受"},{"definition":["to use (sb) as a tool"],"pinyin":["dang1 qiang1 shi3"],"word":"当枪使"},{"definition":["if you ride a tiger, it's hard to get off (idiom); fig. impossible to stop halfway"],"pinyin":["qi2 hu3 nan2 xia4"],"word":"骑虎难下"},{"definition":["lit. a thief crying \"Stop the thief!\" (idiom)\/fig. to accuse sb of a theft and try to sneak away oneself\/to cover up one's misdeeds by shifting the blame onto others"],"pinyin":["zei2 han3 zhuo1 zei2"],"word":"贼喊捉贼"},{"definition":["lit. to strike with a muckrake (idiom), cf Pigsy 豬八戒|猪八戒 in Journey to the West 西遊記|西游记; fig. to counterattack\/to make bogus accusations (against one's victim)"],"pinyin":["dao4 da3 yi1 pa2"],"word":"倒打一耙"},{"definition":["to spin a cocoon around oneself (idiom); enmeshed in a trap of one's own devising\/hoist by his own petard"],"pinyin":["zuo4 jian3 zi4 fu4"],"word":"作茧自缚"}]}