{"definition":["to hit on someone\/to strike up a conversation\/to start talking to end an awkward silence or embarrassing situation"],"pinyin":["da1 shan4"],"traditional":["搭訕"],"rank":23631.0,"normalized_rank":0.3306283491668182,"fraction":0.0000016790346641659438,"cumulative_fraction":0.9821299134917604,"word":"搭讪","characters":[{"definition":["to put up\/to build (scaffolding)\/to hang (clothes on a pole)\/to connect\/to join\/to arrange in pairs\/to match\/to add\/to throw in (resources)\/to take (boat, train)\/variant of 褡[da1]"],"pinyin":["da1"],"word":"搭"},{"definition":["to mock\/to ridicule\/to slander"],"pinyin":["shan4"],"word":"讪"}],"containing_words":[],"sentences":[{"english":"A stranger accosted him on the bus.","chinese":"一位陌生人在公共汽车上同他搭讪。"},{"english":"Mr White likes chatting up the girls.","chinese":"怀特先生喜欢跟姑娘们搭讪。"},{"english":"They also accused Heathfield of chatting up someone who worked at a U.S. nuclear facility.","chinese":"他们还指控希思菲尔德与美国核设施的工作人员搭讪。"},{"english":"A friendly man came and talked to him.","chinese":"一个看似面善的男人走向他跟他搭讪。"},{"english":"Don't have a chat with unknown men, and don't answer any accosts .","chinese":"不要和陌生男人聊天和接受他们的搭讪。"},{"english":"She detests having to talk to people at parties.","chinese":"在宴会上她不喜欢同别人搭讪。"},{"english":"You will always win using pick-up lines that are humorous and tasteful.","chinese":"用这样幽默和高雅的搭讪语你总能成功的。"},{"english":"Diarmuid : Some people use chat-up lines to start a conversation with someone they like.","chinese":"有些人用搭讪的话与他们同类的人开始对话。"},{"english":"Feeling embarrassed, he muttered a few words and walked off.","chinese":"他很尴尬，搭讪着走开了。"},{"english":"It is forbidden to accost others while chewing.","chinese":"决不可嚼着东西跟别人搭讪。"},{"english":"Forget witty chat-up lines and splashing on the aftershave .","chinese":"忘了那些风趣的搭讪和须后水吧。"},{"english":"If I were good at French, I would go and flirt with him.","chinese":"要是我会说法语的话，我就会去找他搭讪了。"},{"english":"No one likes to hear the same joke twice and the same goes for pick-up lines.","chinese":"没有人喜欢听同一个笑话两次，搭讪语也是一样。"},{"english":"Long story short, she was hitting on me all night and acting like a complete skank.","chinese":"长话短说，她整晚都在和我搭讪，这让人感觉恶心。"},{"english":"Most pick-up lines are just stale closed-ended statements.","chinese":"大多数的搭讪语都是老掉牙的封闭的陈述。"},{"english":"A meeting had immediately taken place between the Countess and Mr. Rosier .","chinese":"伯爵夫人和罗齐尔先生已经搭讪上了。"}],"related":[{"definition":["to talk\/to get into conversation with\/to send word"],"pinyin":["da1 hua4"],"word":"搭话"},{"definition":["to ask for directions\/to ask the way (to some place)"],"pinyin":["wen4 lu4"],"word":"问路"},{"definition":["appointment\/engagement\/date\/CL:次[ci4],個|个[ge4]\/to arrange to meet"],"pinyin":["yue1 hui4"],"word":"约会"},{"definition":["to gang up\/to fool around with\/to make up to"],"pinyin":["gou1 da5"],"word":"勾搭"},{"definition":["to worm one's way into being friends with sb (usually derogatory)"],"pinyin":["tao4 jin4 hu1"],"word":"套近乎"},{"definition":["to flirt"],"pinyin":["tiao2 qing2"],"word":"调情"},{"definition":["(slang) to hook up for a one night stand\/booty call"],"pinyin":["yue1 pao4"],"word":"约炮"},{"definition":["to take liberties with a woman\/to dally\/to assail a woman with obscenities"],"pinyin":["tiao2 xi4"],"word":"调戏"},{"definition":["to woo"],"pinyin":["qiu2 ai4"],"word":"求爱"},{"definition":["to ask sb out (on a date etc)"],"pinyin":["yue1 chu1"],"word":"约出"},{"definition":["to chat\/to gossip"],"pinyin":["liao2 tian1"],"word":"聊天"},{"definition":["partner for dating\/a date (boyfriend or girlfriend)"],"pinyin":["yue1 hui4 dui4 xiang4"],"word":"约会对象"},{"definition":["to pick up girls\/to play around with girls\/to chase after girls"],"pinyin":["pao4 niu1"],"word":"泡妞"},{"definition":["handsome guy\/lady-killer\/handsome (form of address)"],"pinyin":["shuai4 ge1"],"word":"帅哥"},{"definition":["to take advantage of sb\/to freeload"],"pinyin":["kai1 you2"],"word":"揩油"},{"definition":["to throw oneself in sb's arms\/to throw oneself at sb"],"pinyin":["tou2 huai2 song4 bao4"],"word":"投怀送抱"}]}