{"definition":["to play tricks on\/to make a fool of"],"pinyin":["bai3 le5 yi1 dao4"],"traditional":["擺了一道"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"摆了一道","characters":[{"definition":["to arrange\/to exhibit\/to move to and fro\/a pendulum"],"pinyin":["bai3"],"word":"摆"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"}],"containing_words":[],"sentences":[],"related":[{"definition":["to use (sb) as a tool"],"pinyin":["dang1 qiang1 shi3"],"word":"当枪使"},{"definition":["lit. to try to steal a chicken only to end up losing the rice used to lure it (idiom)\/fig. to try to gain an advantage only to end up worse off\/to go for wool and come back shorn"],"pinyin":["tou1 ji1 bu4 cheng2 shi2 ba3 mi3"],"word":"偷鸡不成蚀把米"},{"definition":["variant of 蒙在鼓裡|蒙在鼓里[meng2 zai4 gu3 li3]","lit. kept inside a drum (idiom)\/fig. completely in the dark"],"pinyin":["meng2 zai4 gu3 li3","meng2 zai4 gu3 li3"],"word":"蒙在鼓里"},{"definition":["to make a false countercharge"],"pinyin":["fan3 yao3 yi1 kou3"],"word":"反咬一口"},{"definition":["lit. to strike with a muckrake (idiom), cf Pigsy 豬八戒|猪八戒 in Journey to the West 西遊記|西游记; fig. to counterattack\/to make bogus accusations (against one's victim)"],"pinyin":["dao4 da3 yi1 pa2"],"word":"倒打一耙"},{"definition":["to reckon\/to calculate\/to plan\/to expect\/to scheme"],"pinyin":["suan4 ji5"],"word":"算计"},{"definition":["to play with\/to engage in\/to resort to\/to dally with"],"pinyin":["shua3 nong4"],"word":"耍弄"},{"definition":["lit. to pour dog's blood on (idiom)\/fig. torrent of abuse"],"pinyin":["gou3 xue4 lin2 tou2"],"word":"狗血淋头"},{"definition":["to miscalculate\/miscalculation"],"pinyin":["shi1 suan4"],"word":"失算"},{"definition":["to play tricks on\/to make fun of\/to tease"],"pinyin":["xi4 nong4"],"word":"戏弄"},{"definition":["to frame sb (by planting sth on them)"],"pinyin":["zai1 zang1"],"word":"栽赃"},{"definition":["to crush one's own foot while trying to maneuver a rock (to a cliff edge, to drop on one's enemy) (idiom)\/hoisted by one's own petard"],"pinyin":["ban1 qi3 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬起石头砸自己的脚"},{"definition":["to entrap\/to set up\/to frame (up)\/to make false charges against"],"pinyin":["xian4 hai4"],"word":"陷害"},{"definition":["to meet with unexpected failure (idiom)\/to fail miserably (where failure was not expected)"],"pinyin":["yin1 gou1 li3 fan1 chuan2"],"word":"阴沟里翻船"},{"definition":["lit. to pull sb into the water\/to involve sb in a messy business\/to get sb into trouble"],"pinyin":["tuo1 xia4 shui3"],"word":"拖下水"},{"definition":["the guilty party files the suit\/the thief cries thief"],"pinyin":["e4 ren2 xian1 gao4 zhuang4"],"word":"恶人先告状"}]}