{"definition":["can't touch\/can't reach\/(fig.) unable to get a grasp of"],"pinyin":["mo1 bu5 zhao2"],"traditional":["摸不著"],"rank":32215.0,"normalized_rank":0.4507296461600884,"fraction":7.74995221009998e-7,"cumulative_fraction":0.9921370568733576,"word":"摸不着","characters":[{"definition":["to feel with the hand\/to touch\/to stroke\/to grope\/to steal\/to abstract","variant of 摹[mo2]"],"pinyin":["mo1","mo2"],"word":"摸"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"}],"containing_words":[{"definition":["to be unable to make any sense of the matter\/to be at a loss"],"pinyin":["mo1 bu5 zhao2 tou2 nao3"],"word":"摸不着头脑"},{"definition":["irrelevant\/can't make head or tail of"],"pinyin":["mo1 bu5 zhao2 bian1"],"word":"摸不着边"},{"definition":["lit. like a three-meter high monk, you can't rub his head (idiom)\/fig. at a total loss"],"pinyin":["zhang4 er4 he2 shang5 , mo1 bu5 zhao2 tou2 nao3"],"word":"丈二和尚，摸不着头脑"},{"definition":["see 丈二和尚，摸不著頭腦|丈二和尚，摸不着头脑[zhang4 er4 he2 shang5 , mo1 bu5 zhao2 tou2 nao3]"],"pinyin":["zhang4 er4 Jin1 gang1 mo1 bu5 zhao2 tou2 nao3"],"word":"丈二金刚摸不着头脑"}],"sentences":[{"english":"Facts and figures starting to blend together in a horrible haze?","chinese":"事实和数字开始混淆在一起让你摸不着头脑？"},{"english":"The purpose of this enclosure remains as mysterious as this whole structure.","chinese":"这种包围的意图正如整个结构一样让人摸不着头脑。"},{"english":"Yet this end-of-December madness makes no sense to me.","chinese":"可他们这12月底的疯狂却始终让我摸不着头脑。"},{"english":"And of course, the cultural references are likely to boggle your mind.","chinese":"当然，里面的文化内容可能会让你摸不着头脑。"},{"english":"And yesterday's Huanshuai was so sudden, people have been speaking Greek.","chinese":"而昨日的换帅又是如此突然，让人摸不着头脑。"},{"english":"This bizarre episode left us civil servants scratching our heads.","chinese":"光怪陆离的剧情让我们公务员丈二和尚摸不着头脑。"},{"english":"I will not confuse my master by throwing snowballs for him to fetch.","chinese":"我不会把雪球扔出去让主人捡，弄的他摸不着头脑。"},{"english":"Who are they talking to, I wondered?","chinese":"他们在和谁说话，我丈二和尚摸不着头脑。"},{"english":"China's domestic bond market is a murky work-in-progress.","chinese":"国国内债券市场是个让人摸不着头脑的“在建工程”。"},{"english":"We are talking about, Joji monks scratching their heads.","chinese":"大家都议论纷纷，丈二的和尚摸不着头脑。"},{"english":"People can contract the budget table Lee touched minds.","chinese":"可合同中的预算表让人丈二和尚摸不着头脑。"},{"english":"Other conspiracy theories about Mr Obama are even loopier.","chinese":"其他版本的奥巴马阴谋论更让人摸不着头脑。"},{"english":"LeiZiFengs abnormal behavior let monkeys people confused the two monks.","chinese":"雷子枫的反常举动让猴子等人丈二和尚摸不着头脑。"},{"english":"Andof course, the cultural referencesarelikely boggle your mind.","chinese":"当然，里面的文化内容可能会让你摸不着头脑。"},{"english":"She just stared vacantly and said things that made no sense.","chinese":"她只是呆望着，嘴里说的东西也常常让人摸不着头脑。"},{"english":"One diet that continues to confound nutritionists is the French diet.","chinese":"更让营养学家摸不着头脑的饮食习惯是法国。"}],"related":[]}