{"definition":["the end\/an ending\/to wind down\/to conclude"],"pinyin":["shou1 chang3"],"traditional":["收場"],"rank":19851.0,"normalized_rank":0.2777412449456438,"fraction":0.000002434468883176443,"cumulative_fraction":0.9744784693199084,"word":"收场","characters":[{"definition":["to receive\/to accept\/to collect\/to put away\/to restrain\/to stop\/in care of (used on address line after name)"],"pinyin":["shou1"],"word":"收"},{"definition":["threshing floor\/classifier for events and happenings: spell, episode, bout","large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","variant of 場|场[chang2]","variant of 場|场[chang3]"],"pinyin":["chang2","chang3","chang2","chang3"],"word":"场"}],"containing_words":[{"definition":["to rush to conclude a matter\/to end up abruptly"],"pinyin":["cao3 cao3 shou1 chang3"],"word":"草草收场"}],"sentences":[{"english":"One survey found that 60 percent of marriage that occur in old age end in divorce.","chinese":"一项大众调查表明，60%的晚婚都以离婚收场。"},{"english":"MESSY end to Greece's debt crisis seems ever more plausible.","chinese":"希腊债务危机草草收场似乎比以往来得更有理有据。"},{"english":"She spoke amiably, yet with the least hint of dismissal in her voice.","chinese":"她亲切地说，但话音里有一点收场的暗示。"},{"english":"Why the backpedaling on more and more scientific research?","chinese":"为什么越来越多的科学论文以撤销为收场？"},{"english":"The World Cup opening game ends in a tie\/draw .","chinese":"世界杯揭幕战以平局收场。"},{"english":"Cowperwood was in no way pleased by this rough denouement.","chinese":"这样草草收场，柯帕乌绝不会高兴的。"},{"english":"Our exhiBition centre provides sites free of rent for exhiBition and sale of products.","chinese":"本展览中心提供展销场地，不收场地租借费。"},{"english":"The tragedy is the majority of such attempts fail.","chinese":"可悲的是，这种努力大多以失败收场。"},{"english":"Do half of all marriages really end in divorce?","chinese":"世上一半的婚姻最终会以离婚收场？"},{"english":"Italian way for celebrating everything ends up with a cup of coffee.","chinese":"义大利式的任何庆祝活动都会以一杯咖啡收场。"},{"english":"At the same time you will probably end up hating yourself.","chinese":"与此同时，你可能将以恨你自己收场。"},{"english":"This phase relates to the process of escalating, isolating and closing.","chinese":"这个阶段和升级，隔离和收场相关联。"},{"english":"The weakest students can end up with a negative score.","chinese":"最差的学生可能会以负分收场。"},{"english":"At the end, there still need ending after bustling, the organizers still have a lot of work.","chinese":"曲终人散，繁华过后还得收场，组织者仍有许多工作。"},{"english":"How many Frenchmen does it take to defend Paris?","chinese":"愿意守护巴黎的法国人收场有几多人呢？"},{"english":"The play got terrible reviews and quickly died a death.","chinese":"这出戏被批得一无是处，很快就收场了。"}],"related":[{"definition":["to rush to conclude a matter\/to end up abruptly"],"pinyin":["cao3 cao3 shou1 chang3"],"word":"草草收场"},{"definition":["to end\/to reach an end"],"pinyin":["gao4 zhong1"],"word":"告终"},{"definition":["conclusion\/ending"],"pinyin":["jie2 ju2"],"word":"结局"},{"definition":["to part on bad terms\/(of a meeting etc) to break up in discord"],"pinyin":["bu4 huan1 er2 san4"],"word":"不欢而散"},{"definition":["ending up as\/leading to\/resulting in\/in total"],"pinyin":["luo4 de5"],"word":"落得"},{"definition":["farce\/CL:場|场[chang3],齣|出[chu1],幕[mu4]"],"pinyin":["nao4 ju4"],"word":"闹剧"},{"definition":["to settle a matter by leaving it unsettled\/to end up with nothing definite"],"pinyin":["bu4 liao3 liao3 zhi1"],"word":"不了了之"},{"definition":["dark\/gloomy\/dismal\/by painstaking effort"],"pinyin":["can3 dan4"],"word":"惨淡"},{"definition":["failed and wiped over the floor (idiom); to fail utterly\/a crushing defeat\/beaten and in a hopeless position"],"pinyin":["yi1 bai4 tu2 di4"],"word":"一败涂地"},{"definition":["(literary) to be routed (in a war)\/to suffer defeat (in sports etc)"],"pinyin":["bai4 bei3"],"word":"败北"},{"definition":["both sides suffer (idiom)\/neither side wins"],"pinyin":["liang3 bai4 ju4 shang1"],"word":"两败俱伤"},{"definition":["to die peacefully\/(fig.) to result in failure (without any outside interference)\/to come to nothing\/to fizzle out"],"pinyin":["wu2 ji2 er2 zhong1"],"word":"无疾而终"},{"definition":["lit. to take different roads and urge the horses on (idiom)\/fig. to part ways"],"pinyin":["fen1 dao4 yang2 biao1"],"word":"分道扬镳"},{"definition":["lost game\/losing battle"],"pinyin":["bai4 ju2"],"word":"败局"},{"definition":["(of marriage or business partners) to break up (idiom)\/to separate"],"pinyin":["yi1 pai1 liang3 san4"],"word":"一拍两散"},{"definition":["see 撕破臉|撕破脸[si1 po4 lian3]"],"pinyin":["si1 po4 lian3 pi2"],"word":"撕破脸皮"}]}