{"definition":["to recover (illegally obtained property)\/to seize\/to capture\/to force sb to hand over sth\/to levy"],"pinyin":["shou1 jiao3"],"traditional":["收繳"],"rank":8876.0,"normalized_rank":0.12418675583786885,"fraction":0.000010148072664187801,"cumulative_fraction":0.919421904196006,"word":"收缴","characters":[{"definition":["to receive\/to accept\/to collect\/to put away\/to restrain\/to stop\/in care of (used on address line after name)"],"pinyin":["shou1"],"word":"收"},{"definition":["to hand in\/to hand over\/to seize"],"pinyin":["jiao3"],"word":"缴"}],"containing_words":[],"sentences":[{"english":"It found and captured TROJAN, the pilferer .","chinese":"它发现了木马程序，并将这窃贼收缴。"},{"english":"The scooters were part of the cargo confiscated by Israeli troops from the Gaza-bound flotilla that sailed from Turkey.","chinese":"这些滑板车是以军收缴来自土耳其船只货物的一部分。"},{"english":"Taking over the reasonable premium is the key to the surviving of such a company.","chinese":"收缴合理的保费是保险公司生存的关键。"},{"english":"And the delegation will try to reunite the venders with their seized merchandise.","chinese":"代表团将竭力磋商，争取让商人们领回被收缴的货物。"},{"english":"British troops marched to Concord to destroy military supplies.","chinese":"英国军队进军康科德意图收缴当地的军用物资。"},{"english":"Work hard to improve collection procedures.","chinese":"要努力提高收缴率。"},{"english":"MemberExtra! magazine is a quarterly publication of the association sent to all dues-paying members.","chinese":"杂志是协会向所有会员收缴会费的季刊。"},{"english":"The police has disfurnished them of their illegal firearms.","chinese":"警察收缴了他们的非法枪支。"},{"english":"Music Association book be able to how Taibaodalan all of the collection?","chinese":"音著协怎么能大包大揽全部收缴？"},{"english":"Authorities also seized several luxury vehicles from Wren when he was arrested.","chinese":"警方在逮捕雷恩时还收缴了多部豪华汽车。"},{"english":"Material fee, if any, is due along with tuition at the time of registration.","chinese":"有材料费之选课，其费用将于注册时一并收缴。"},{"english":"Some whites thought the government was coming to get their guns next.","chinese":"一些白人认为，政府下一步会收缴他们的枪支。"},{"english":"The law enforcement officer closes to pay to the all of the adulterating of hunt down and seize mattress undertakes.","chinese":"执法人员对查获的假冒床垫进行全部收缴。"},{"english":"They have confiscated and destroyed the pirated goods and levied administrative sanctions on the infringers .","chinese":"收缴销毁了侵权复制品，并对侵权者作出了行政处罚。"},{"english":"In 1998, the total number of seized counterfeit notes of all denominations was 807.","chinese":"1998年收缴的所有面额假币总量为807张。"}],"related":[{"definition":["to capture\/to seize"],"pinyin":["jiao3 huo4"],"word":"缴获"},{"definition":["to recover (stolen property)\/to pursue and force sb to give back the spoils"],"pinyin":["zhui1 jiao3"],"word":"追缴"},{"definition":["to detain\/to hold in custody\/to distrain\/to seize property"],"pinyin":["kou4 ya1"],"word":"扣押"},{"definition":["to seize\/to confiscate"],"pinyin":["cha2 kou4"],"word":"查扣"},{"definition":["to track down and seize (a criminal suspect, contraband etc)"],"pinyin":["cha2 huo4"],"word":"查获"},{"definition":["to detain\/to arrest\/to hold\/to confiscate"],"pinyin":["kou4 liu2"],"word":"扣留"},{"definition":["to destroy (by melting or burning)\/to obliterate"],"pinyin":["xiao1 hui3"],"word":"销毁"},{"definition":["to investigate thoroughly\/to carefully inspect\/to verify\/to ferret out (undesirable elements)"],"pinyin":["qing1 cha2"],"word":"清查"},{"definition":["to transfer (income, profits etc) to higher authorities"],"pinyin":["shang4 jiao3"],"word":"上缴"},{"definition":["to investigate and handle (a criminal case)"],"pinyin":["cha2 chu3"],"word":"查处"},{"definition":["booty\/stolen property"],"pinyin":["zang1 wu4"],"word":"赃物"},{"definition":["money to gamble with"],"pinyin":["du3 zi1"],"word":"赌资"},{"definition":["booty\/stolen goods"],"pinyin":["zang1 kuan3"],"word":"赃款"},{"definition":["to destroy\/to smash\/sabotage"],"pinyin":["dao3 hui3"],"word":"捣毁"},{"definition":["to find\/to capture (after search)\/to uncover (evidence)"],"pinyin":["sou1 huo4"],"word":"搜获"},{"definition":["to sequester\/to seize (assets)\/to seal up\/to close down"],"pinyin":["cha2 feng1"],"word":"查封"}]}