{"definition":["to gather\/to collect"],"pinyin":["shou1 ji2"],"traditional":["收集"],"rank":3788.0,"normalized_rank":0.0529990346004785,"fraction":0.00003571328043414484,"cumulative_fraction":0.8233553337280405,"word":"收集","characters":[{"definition":["to receive\/to accept\/to collect\/to put away\/to restrain\/to stop\/in care of (used on address line after name)"],"pinyin":["shou1"],"word":"收"},{"definition":["to gather\/to collect\/collected works\/classifier for sections of a TV series etc: episode"],"pinyin":["ji2"],"word":"集"}],"containing_words":[],"sentences":[{"english":"The garbage collection pause times are the most significant delays any threads encounter.","chinese":"垃圾收集停顿时间是任何线程遇到的最显著的延迟。"},{"english":"Cell suspension was collected, and then stained after hypotonic treatment.","chinese":"收集细胞悬液，再经低渗处理后滴片染色。"},{"english":"Alterna Professional Haircare uses caviar extract in its Caviar Anti-Aging collection.","chinese":"替代专业护发品使用鱼子酱提取的鱼子酱抗衰老收集。"},{"english":"Or you can have a form to collect visitors' comments about your site.","chinese":"或者可以创建表格收集访问者对网站的评论。"},{"english":"A dual-channel instantaneous soil radon measurement instrument based on the method of electrostatic collection is designed.","chinese":"设计一套基于静电收集法的双道瞬时土壤测氡仪。"},{"english":"For non-batch programs, stopping the collector forever is not an option.","chinese":"对于非批处理程序，永久停止收集器并非好的选择。"},{"english":"Research your topic and learn as much background information as you can.","chinese":"研究你的选题，尽可能多的收集背景资料。"},{"english":"So the good spirit collected wood every night.","chinese":"于是这位善良的神仙每天晚上收集木柴。"},{"english":"With open shop for inheritance award-winning uncomplicated, full-time immersed collection.","chinese":"以开网店为业的林强游手好闲，全日沉浸收集。"},{"english":"Cooking water is recaptured to flush toilets, for instance.","chinese":"比如，厨房用水可收集起来冲洗厕所。"},{"english":"All three are stop-the-world copying collectors.","chinese":"所有这三种都是拷贝收集器。"},{"english":"Slip away to innocent days with this fantastically fun collection of jigsaws with a nostalgic theme.","chinese":"溜掉无辜天这个亲密乐趣收集灵感与怀旧主题。"},{"english":"The Chinese gather intelligence differently from Western nations, Wise writes.","chinese":"怀斯写道，中国收集情报的方法与西方国家不同。"},{"english":"Gathering them unemotionally will help those facts come out.","chinese":"非情绪化地收集事实会帮助那些事实浮出水面。"},{"english":"Analyze the information you've collected to identify patterns and insights.","chinese":"分析你收集的信息，来识别模式和见识。"},{"english":"But a collection of facts is no more a science than a heap of stones is a house.","chinese":"但收集的事实没有更多的科学比礧是一个房子。"}],"related":[{"definition":["to gather\/to collect"],"pinyin":["sou1 ji2"],"word":"搜集"},{"definition":["to gather\/to collect\/to harvest"],"pinyin":["cai3 ji2"],"word":"采集"},{"definition":["material\/resources\/data\/information\/profile (Internet)\/CL:份[fen4],個|个[ge4]"],"pinyin":["zi1 liao4"],"word":"资料"},{"definition":["to search\/to look for"],"pinyin":["sou1 xun2"],"word":"搜寻"},{"definition":["to arrange\/to tidy up\/to sort out\/to straighten out\/to list systematically\/to collate (data, files)\/to pack (luggage)"],"pinyin":["zheng3 li3"],"word":"整理"},{"definition":["stockpile\/to store\/to stockpile\/storage"],"pinyin":["chu3 cun2"],"word":"储存"},{"definition":["to consult\/to refer to\/to look sth up in a reference source"],"pinyin":["cha2 yue4"],"word":"查阅"},{"definition":["reception (of transmitted signal)\/to receive\/to accept\/to admit\/to take over (e.g. a factory)\/to expropriate"],"pinyin":["jie1 shou1"],"word":"接收"},{"definition":["huge volume"],"pinyin":["hai3 liang4"],"word":"海量"},{"definition":["summary\/to summarize\/to collect (data, receipts etc)\/to gather and report\/also written 匯總|汇总","summary\/to summarize\/to collect (data, receipts etc)\/to gather and report"],"pinyin":["hui4 zong3","hui4 zong3"],"word":"汇总"},{"definition":["to withdraw (money)\/to collect (left luggage)\/to extract\/to refine"],"pinyin":["ti2 qu3"],"word":"提取"},{"definition":["classification"],"pinyin":["fen1 lei4"],"word":"分类"},{"definition":["to keep\/to preserve\/extant\/to remain (from the past)"],"pinyin":["liu2 cun2"],"word":"留存"},{"definition":["to deposit\/to store\/to leave in sb's care"],"pinyin":["cun2 fang4"],"word":"存放"},{"definition":["to conserve\/to preserve\/to keep\/to save (a file etc) (computing)"],"pinyin":["bao3 cun2"],"word":"保存"},{"definition":["to store up\/to stockpile\/(computer) to save\/to store\/memory\/storage"],"pinyin":["cun2 chu3"],"word":"存储"}]}