{"definition":["to adjust one's head and turn one's face (idiom); cosmetic changes\/Despite superficially new policies, the substance remains unchanged."],"pinyin":["gai3 tou2 huan4 mian4"],"traditional":["改頭換面"],"rank":21716.0,"normalized_rank":0.3038350146209058,"fraction":0.00000201419929544094,"cumulative_fraction":0.9786021253192434,"word":"改头换面","characters":[{"definition":["to change\/to alter\/to transform\/to correct"],"pinyin":["gai3"],"word":"改"},{"definition":["suffix for nouns","head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]"],"pinyin":["tou5","tou2"],"word":"头"},{"definition":["to exchange\/to change (clothes etc)\/to substitute\/to switch\/to convert (currency)"],"pinyin":["huan4"],"word":"换"},{"definition":["flour\/noodles\/(of food) soft (not crunchy)\/(slang) (of a person) ineffectual\/spineless","variant of 麵|面[mian4]","face\/side\/surface\/aspect\/top\/classifier for flat surfaces such as drums, mirrors, flags etc"],"pinyin":["mian4","mian4","mian4"],"word":"面"}],"containing_words":[],"sentences":[{"english":"Venture capital transmogrified into speculative fever.","chinese":"风险资本改头换面进入投机热。"},{"english":"As the face of America has changed, so has the face of American racism.","chinese":"随着美国的面貌改变，美国种族主义也改头换面了。"},{"english":"My duff transcript did not faze the schools I applied to.","chinese":"我那份改头换面的成绩单，并没有引起商学院的疑虑。"},{"english":"The company intends to re-fashion itself as AIU Holdings.","chinese":"公司打算改头换面作为美亚保险公司控股有限公司。"},{"english":"In debt restructuring, the existing debt is metaphorically torn up and replaced by new debt.","chinese":"在债务重组方面，旧债改头换面被新债取代。"},{"english":"What this suggests is that education and healthcare are ripe for disruptive innovation.","chinese":"以上现象表明教育和医疗正亟待一场改头换面的革新。"},{"english":"They are being shown at the Reinventing Shoe exhibition at La Capella dels Angels.","chinese":"这场奇异鞋展的名字叫作“改头换面的鞋子”。"},{"english":"He was believed to have altered his appearance and traveled throughout Europe, Mexico, Canada and the United States.","chinese":"他改头换面后流窜到过欧洲，墨西哥，加拿大和美国。"},{"english":"An official revision of history was quietly taking place.","chinese":"官方历史就这样不声不响地改头换面了。"},{"english":"A few simple techniques can make a big difference when your PC's performance slows to a crawl.","chinese":"只要一些简单的技巧就能让你的龟速电脑改头换面了。"},{"english":"I’m most excited about the innovation of Phones That Don’t Suck.","chinese":"让我最兴奋的是改头换面的手机的发明。"}],"related":[{"definition":["to shed one's mortal body and exchange one's bones (idiom); born again Daoist\/to turn over a new leaf\/fig. to change wholly\/to create from other material (story, artwork etc)"],"pinyin":["tuo1 tai1 huan4 gu3"],"word":"脱胎换骨"},{"definition":["to change shape in a single shake\/fig. to take on a new lease of life"],"pinyin":["yao2 shen1 yi1 bian4"],"word":"摇身一变"},{"definition":["to start over from scratch (idiom)"],"pinyin":["chong2 qi3 lu2 zao4"],"word":"重起炉灶"},{"definition":["different broth but the same old medicine (idiom); a change in name only\/a change in form but not in substance"],"pinyin":["huan4 tang1 bu4 huan4 yao4"],"word":"换汤不换药"},{"definition":["(of a person) to return to the fray after a period of inactivity\/to jump back into the thick of things\/(of sth that was once popular) to be resurrected\/to make a comeback"],"pinyin":["chong2 chu1 jiang1 hu2"],"word":"重出江湖"},{"definition":["to look completely new (idiom); brand new\/changed beyond recognition"],"pinyin":["huan4 ran2 yi1 xin1"],"word":"焕然一新"},{"definition":["bird shotgun replaced by cannon (idiom); equipment improved enormously"],"pinyin":["niao3 qiang1 huan4 pao4"],"word":"鸟枪换炮"},{"definition":["complete change (idiom); facelift\/We're in a wholly new situation."],"pinyin":["mian4 mu4 yi1 xin1"],"word":"面目一新"},{"definition":["lit. to shake one's body\/refers to abrupt transformation\/same as 搖身一變|摇身一变"],"pinyin":["yao2 shen1"],"word":"摇身"},{"definition":["to vanish without trace (idiom)\/to lie low"],"pinyin":["xiao1 sheng1 ni4 ji4"],"word":"销声匿迹"},{"definition":["bold and decisive"],"pinyin":["da4 dao1 kuo4 fu3"],"word":"大刀阔斧"},{"definition":["to dress up in disguise (idiom); to pretend for the purpose of deceit"],"pinyin":["qiao2 zhuang1 da3 ban4"],"word":"乔装打扮"},{"definition":["lit. from head to tail (idiom); thoroughgoing\/through and through\/out and out\/from top to bottom"],"pinyin":["che4 tou2 che4 wei3"],"word":"彻头彻尾"},{"definition":["(lit. and fig.) overnight"],"pinyin":["yi1 ye4 zhi1 jian1"],"word":"一夜之间"},{"definition":["to sink down to\/to be reduced to (sth inferior)"],"pinyin":["lun2 wei2"],"word":"沦为"},{"definition":["to resume one's old trade (idiom)"],"pinyin":["chong2 cao1 jiu4 ye4"],"word":"重操旧业"}]}