{"definition":["to change profession"],"pinyin":["gai3 hang2"],"traditional":["改行"],"rank":20082.0,"normalized_rank":0.2809732346480489,"fraction":0.0000023738881680287412,"cumulative_fraction":0.975033521510302,"word":"改行","characters":[{"definition":["to change\/to alter\/to transform\/to correct"],"pinyin":["gai3"],"word":"改"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"}],"containing_words":[],"sentences":[{"english":"Many teachers have switched to business because of the temptation of the high returns.","chinese":"在高薪的利诱之下，许多教师都改行经商了。"},{"english":"And the king said, What honour and dignity hath been done to Mordecai for this?","chinese":"王说，末底改行了这事，赐他什么尊荣爵位没有。"},{"english":"In 1994 I took all these acquired skills, headed in a new direction, and changed careers.","chinese":"在掌握了所有这些技能后，我于1994年跳槽改行。"},{"english":"After the liberation of Li Luo Huai died, his son diverted, the industry has no mass.","chinese":"解放后李洛怀过世，其子改行，其业遂不传。"},{"english":"At first he studied architecture, but later he switched to geology.","chinese":"他原是学建筑的，中途改行搞地质了。"},{"english":"I should have listened to my friends and become an oil producer instead.","chinese":"看来我早应该听朋友们的劝告，改行做石油生产商。"},{"english":"After the bleaching ended, the chamber was temporarily sealed for two weeks.","chinese":"治疗结束后，暂时充填髓腔，两周后改行光固化充填。"},{"english":"Many teachers quit their jobs and go into business under the temptation of high salary .","chinese":"在高薪的利诱之下，许多教师都改行经商了。"},{"english":"To just become firemen and short-order cooks?","chinese":"改行当消防员和快餐厨师？"},{"english":"Having said that, shall we all change our careers and become a writer?","chinese":"这么说，难道我们要改行成为作家了吗？"},{"english":"She was trained as a doctor but diverted to diplomacy.","chinese":"她是学医的，但是改行做外交工作了。"},{"english":"This line has four commands in it already. Let's crlf.","chinese":"这一行里已经有四个命令句了，改改行吧。"},{"english":"Because of this, Xiao decided not to become an artist, but a director.","chinese":"正因如此，肖央决定不当画家改行当导演。"},{"english":"Higher salaries are seducing many teachers into business.","chinese":"在高薪的利诱之下，许多教师都改行经商了。"}],"related":[{"definition":["to change profession"],"pinyin":["zhuan3 hang2"],"word":"转行"},{"definition":["sideline\/side occupation"],"pinyin":["fu4 ye4"],"word":"副业"},{"definition":["profession\/role (acting)"],"pinyin":["hang2 dang5"],"word":"行当"},{"definition":["to switch from one major or faculty to another (at a university)"],"pinyin":["gai3 xue2"],"word":"改学"},{"definition":["switch to a job one was not trained for"],"pinyin":["ban4 lu4 chu1 jia1"],"word":"半路出家"},{"definition":["second job"],"pinyin":["di4 er4 zhi2 ye4"],"word":"第二职业"},{"definition":["to totally stop doing something\/to reform one's ways"],"pinyin":["xi3 shou3 bu4 gan4"],"word":"洗手不干"},{"definition":["to resume one's old trade (idiom)"],"pinyin":["chong2 cao1 jiu4 ye4"],"word":"重操旧业"},{"definition":["one's line\/one's own profession"],"pinyin":["ben3 hang2"],"word":"本行"},{"definition":["to come off sentry duty\/to lay off (a worker)\/laid-off"],"pinyin":["xia4 gang3"],"word":"下岗"},{"definition":["to seek one's livelihood\/to work to support oneself\/to earn a living"],"pinyin":["mou2 sheng1"],"word":"谋生"},{"definition":["(of a slave or servant) to be given one's freedom\/(of a prostitute) to marry and leave one's trade"],"pinyin":["cong2 liang2"],"word":"从良"},{"definition":["to go for\/to engage in\/to undertake\/to deal with\/to handle\/to do"],"pinyin":["cong2 shi4"],"word":"从事"},{"definition":["lit. to wash one's hands in a gold basin (idiom)\/fig. to abandon the life of an outlaw"],"pinyin":["jin1 pen2 xi3 shou3"],"word":"金盆洗手"},{"definition":["to support one's family (idiom); to have difficulty feeding a family"],"pinyin":["yang3 jia1 hu2 kou3"],"word":"养家糊口"},{"definition":["to resign"],"pinyin":["ci2 zhi2"],"word":"辞职"}]}