{"definition":["to reform and open to the outside world\/refers to Deng Xiaoping's policies from around 1980"],"pinyin":["gai3 ge2 kai1 fang4"],"traditional":["改革開放"],"rank":3830.0,"normalized_rank":0.053586669091824884,"fraction":0.00003516294478087536,"cumulative_fraction":0.8248442780782383,"word":"改革开放","characters":[{"definition":["to change\/to alter\/to transform\/to correct"],"pinyin":["gai3"],"word":"改"},{"definition":["animal hide\/leather\/to reform\/to remove\/to expel (from office)"],"pinyin":["ge2"],"word":"革"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"开"},{"definition":["to put\/to place\/to release\/to free\/to let go\/to let out\/to set off (fireworks)"],"pinyin":["fang4"],"word":"放"}],"containing_words":[],"sentences":[{"english":"It is a fore-runner of China's reform and opening-up.","chinese":"众所周知，深圳是中国改革开放的先驱和样板。"},{"english":"China was a society with high equality before the reform and opening-up.","chinese":"改革开放以前我国是一个均等化程度较高的社会。"},{"english":"China's foreign trade agency system initiated at the beginning of the reform and opening.","chinese":"中国的外贸代理制始于改革开放之初。"},{"english":"Non - public - owned organizations in China have achieved great development since the reform and opening up.","chinese":"改革开放以来，我国的非公有制经济有了快速的发展。"},{"english":"The most salient feature of the new period is reform and opening up.","chinese":"新时期最鲜明的特点是改革开放。"},{"english":"Before the economic reforms, Beijing's largest department store was the Wangfujing Hundred Goods Emporium.","chinese":"改革开放以前，北京最大的商店就是王府井百货大楼。"},{"english":"Since China' s reform and opening policy, the non-state running enterprises of Wenzhou have made great progress.","chinese":"改革开放以来，温州民营经济取得了长足的进展。"},{"english":"Shenzhen's success gave a further push to continue reforms and opening up.","chinese":"深证的成功进一步推动了改革开放的继续实行。"},{"english":"Troops is that China reforms open convoying person.","chinese":"军队是中国改革开放的护航者。"},{"english":"This year marks the 30th anniversary of reform and opening-up in China.","chinese":"今年是中国改革开放30周年。"},{"english":"The nuclear industry tactic transferred and the nuclear power grew up rapidly since the reform and opening of China.","chinese":"改革开放以来，核工业战略转移，核电产业迅速崛起。"},{"english":"The fundamental way out lies in reform and openness.","chinese":"根本出路在于改革开放。"},{"english":"With the deepening of reform and opening-up of our country, many people dream of going abroad for further study.","chinese":"随着我国改革开放的加深，很多人梦想着出国深造。"},{"english":"China has scored notable achievements over the past 30-odd years since reform and opening-up.","chinese":"中国改革开放30多年来，取得举世瞩目的发展成就。"},{"english":"Therefore, emancipation of the mind is the direct motive force of reform and opening-up.","chinese":"因此，解放思想是中国改革开放的直接动力。"},{"english":"Young cadre is national future, it is the brunt of our country reforming and opening.","chinese":"青年干部是国家的未来，是我国改革开放的主力。"}],"related":[{"definition":["economic reform"],"pinyin":["jing1 ji4 gai3 ge2"],"word":"经济改革"},{"definition":["market economy"],"pinyin":["shi4 chang3 jing1 ji4"],"word":"市场经济"},{"definition":["economic development"],"pinyin":["jing1 ji4 fa1 zhan3"],"word":"经济发展"},{"definition":["rural household contract responsibility system, PRC government policy linking rural income to productivity"],"pinyin":["nong2 cun1 jia1 ting2 lian2 chan3 cheng2 bao1 ze2 ren4 zhi4"],"word":"农村家庭联产承包责任制"},{"definition":["to work in the fields (esp. young school-leavers)\/forced agricultural experience for city intellectuals"],"pinyin":["shang4 shan1 xia4 xiang1"],"word":"上山下乡"},{"definition":["to change track"],"pinyin":["zhuan3 gui3"],"word":"转轨"},{"definition":["planned economy"],"pinyin":["ji4 hua4 jing1 ji4"],"word":"计划经济"},{"definition":["economic system"],"pinyin":["jing1 ji4 ti3 zhi4"],"word":"经济体制"},{"definition":["land reform"],"pinyin":["tu3 di4 gai3 ge2"],"word":"土地改革"},{"definition":["national industry\/industry run by Chinese nationals or ethnic Chinese"],"pinyin":["min2 zu2 gong1 ye4"],"word":"民族工业"},{"definition":["commodity economy"],"pinyin":["shang1 pin3 jing1 ji4"],"word":"商品经济"},{"definition":["Cultural Revolution (1966-76)\/abbr. for 文化大革命[Wen2 hua4 Da4 ge2 ming4]"],"pinyin":["Wen2 ge2"],"word":"文革"},{"definition":["Great Leap Forward (1958-1960), Mao's attempt to modernize China's economy, which resulted in economic devastation, and millions of deaths from famine caused by misguided policies"],"pinyin":["Da4 yue4 jin4"],"word":"大跃进"},{"definition":["fixing of farm output quotas for each household"],"pinyin":["bao1 chan3 dao4 hu4"],"word":"包产到户"},{"definition":["modernization of industry, one of Deng Xiaoping's Four Modernizations"],"pinyin":["gong1 ye4 xian4 dai4 hua4"],"word":"工业现代化"},{"definition":["collectivization of agriculture (in Marxist theory)"],"pinyin":["nong2 ye4 he2 zuo4 hua4"],"word":"农业合作化"}]}