{"definition":["to force entrance into\/to score a goal (sport)"],"pinyin":["gong1 ru4"],"traditional":["攻入"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"攻入","characters":[{"definition":["to attack\/to accuse\/to study"],"pinyin":["gong1"],"word":"攻"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"}],"containing_words":[],"sentences":[{"english":"The former Danubio youngster then reflected on his goal against Juventus.","chinese":"这位前达努比奥的年轻人谈到了对尤文时攻入的进球。"},{"english":"Diego Milito with a goal five minutes before half-time.","chinese":"迭戈米利托在半场结束五分钟前攻入了全场唯一入球。"},{"english":"And then he gave the assist for the third goal by Inzaghi.","chinese":"此外，他还助攻因扎吉攻入了第三粒进球。"},{"english":"He had performed brilliantly and capped it off with the clinching goal.","chinese":"他在决赛中表现出色，并攻入决定性的进球。"},{"english":"He scored 33 goals in 35 appearances in his first season at the Bernabeu.","chinese":"在伯纳乌的处子赛季，他便出场35次攻入33球。"},{"english":"In the lane he scored on power drop steps and right handed jump hooks over his left shoulder.","chinese":"在他攻入了对权力的下降和右撇子步跳投了他的左肩。"},{"english":"I hope I can score my first goal at Olimpico infront of our tifosi.","chinese":"我希望我可以在球迷面前攻入我的首粒奥林匹克进球。"},{"english":"He has played 51 games for Sampdoria, scoring 1 goal.","chinese":"他为桑普出场51次并攻入一球。"},{"english":"Caricola is trying to clear the danger only succeeded in putting the ball in his own net.","chinese":"卡里科拉试图解除威胁，结果将球攻入了本方网内。"},{"english":"Most of the goals I have scored are down to the words of advice from Rodolfo.","chinese":"我攻入的大部分入球都得益于博雷尔的忠告。"},{"english":"Protestersbuilt barricades and tried to use garbage cans as battering rams tobreak their way into thenational palace.","chinese":"抗议者堆起路障，试着用垃圾桶当槌以攻入总统府。"},{"english":"The Uruguayan striker Diego Forlan scored the decisive goal in the 116th minute.","chinese":"乌拉圭前锋弗兰在第116分钟攻入了制胜的一球。"},{"english":"The doctor is still red blood transfusion, the Japanese army invaded, refused to Sheshang parasitic red.","chinese":"医生为尚红输血时，日军攻入，寄生拒绝舍尚红而去。"},{"english":"Baggio scored 17 goals in 32 league matches this season.","chinese":"这个赛季他在32场联赛中攻入17球。"},{"english":"It was the second time this year Hucles scored an injury-time winner.","chinese":"这是胡可思今年内第二次在补时阶段攻入制胜球。"},{"english":"Davor made 39 appearances over the following season, scoring 11 goals.","chinese":"在那个赛季中，苏克共出场39次，攻入11球。"}],"related":[{"definition":["to make a breakthrough\/to break through\/to breach (military)"],"pinyin":["gong1 po4"],"word":"攻破"},{"definition":["to breach\/to invade"],"pinyin":["da3 jin4"],"word":"打进"},{"definition":["to score a goal\/goal"],"pinyin":["ru4 qiu2"],"word":"入球"},{"definition":["to score a goal\/goal (sport)"],"pinyin":["jin4 qiu2"],"word":"进球"},{"definition":["hat trick (when one player scores three goals)"],"pinyin":["mao4 zi5 xi4 fa3"],"word":"帽子戏法"},{"definition":["to march straight in unchallenged (military) (idiom)\/(fig.) to push deep into the heart of sth\/to flood in"],"pinyin":["chang2 qu1 zhi2 ru4"],"word":"长驱直入"},{"definition":["to overcome\/to take (a fortress)\/to fall (to an attack)\/to surrender"],"pinyin":["gong1 xian4"],"word":"攻陷"},{"definition":["own goal (ball sports)"],"pinyin":["wu1 long2 qiu2"],"word":"乌龙球"},{"definition":["to burst or force open a door\/to excommunicate sb (from the Roman Catholic Church)\/to score a goal (in football, hockey etc)"],"pinyin":["po4 men2"],"word":"破门"},{"definition":["to defeat decisively\/to win decisively\/great victory\/triumph"],"pinyin":["da4 sheng4"],"word":"大胜"},{"definition":["to storm (a city etc)\/to raid"],"pinyin":["sha1 jin4"],"word":"杀进"},{"definition":["to defeat\/to smash\/to rout"],"pinyin":["ji1 kui4"],"word":"击溃"},{"definition":["to defeat\/to beat"],"pinyin":["ji1 bai4"],"word":"击败"},{"definition":["to attack violently\/to storm"],"pinyin":["meng3 gong1"],"word":"猛攻"},{"definition":["defensive line or perimeter\/CL:道[dao4]"],"pinyin":["fang2 xian4"],"word":"防线"},{"definition":["to attack\/to assault\/to go on the offensive\/attack\/assault\/offense (sports)"],"pinyin":["jin4 gong1"],"word":"进攻"}]}