{"definition":["to make a breakthrough\/to break through\/to breach (military)"],"pinyin":["gong1 po4"],"traditional":["攻破"],"rank":14030.0,"normalized_rank":0.1962979027045178,"fraction":0.000004645883952507853,"cumulative_fraction":0.954778435455011,"word":"攻破","characters":[{"definition":["to attack\/to accuse\/to study"],"pinyin":["gong1"],"word":"攻"},{"definition":["broken\/damaged\/worn out\/lousy\/rotten\/to break, split or cleave\/to get rid of\/to destroy\/to break with\/to defeat\/to capture (a city etc)\/to expose the truth of"],"pinyin":["po4"],"word":"破"}],"containing_words":[],"sentences":[{"english":"The kingdom was conquered by the Mongol and Chinese armies of Kublai Khan .","chinese":"大理王国后来被忽必烈率领的蒙古族和汉族军队攻破。"},{"english":"But in the 59th minute, Corradi attacks the worn-out host front door tying score.","chinese":"而在第59分钟，科拉迪攻破旧主大门追平比分。"},{"english":"A lair of illegal activities conducting forged documents was destroyed by the police.","chinese":"一个办理假证件的黑户被警方攻破。"},{"english":"And he shall set engines of war against thy walls, and with his axes he shall break down thy towers.","chinese":"他必安设撞城锤攻破你的墙垣，用铁器拆毁你的城楼。"},{"english":"God and pull down the strongholds.","chinese":"然后用神话语的宝剑攻破这些营垒。"},{"english":"The easiest way to capture a fortress is from within.","chinese":"堡垒是最容易从内部攻破的。"},{"english":"The Chinese rice sends 4 vanguards finally, but is unable to attack the Genoa gate.","chinese":"国米最后派上4名前锋，但就是无法攻破热那亚球门。"},{"english":"The toyaku line should be breached .","chinese":"远役防线应该被攻破。"},{"english":"Soon be breached, a surname city Song Xiangxian died.","chinese":"东莱城很快被攻破，宋象贤战死。"},{"english":"They kept bringing pressure on Lot and moved forward to break down the door.","chinese":"众人就向前拥挤罗得，要攻破房门。"},{"english":"Your heart's tall city, when I can break.","chinese":"你心里的那座城池，我什么时候能攻破。"},{"english":"Hleb could slip a pass to the Spaniard who lashed his shot past Schmeichel.","chinese":"赫莱布传球，西班牙人射门攻破了舒梅切尔的十指关。"},{"english":"When their flags and pennants are in chaos, their men and horses frequently shifting about, then strike into them.","chinese":"敌人旌旗紊乱，人马不断调动，就来机攻破它。"},{"english":"It is below the offensive with my powerful army, xu water city is very fast by breach.","chinese":"在我军强大的攻势下，徐水城很快就被攻破。"},{"english":"One option a thief might try to crack your password is a brute-force dictionary attack .","chinese":"一个选项一个小偷可能企图攻破密码是强力字典攻击。"},{"english":"Chelsea had a close call when the bottom-placed Portsmouth almost scored.","chinese":"英超排名垫底的朴茨茅斯险些攻破切尔西的球门。"}],"related":[{"definition":["to overcome\/to take (a fortress)\/to fall (to an attack)\/to surrender"],"pinyin":["gong1 xian4"],"word":"攻陷"},{"definition":["to defeat\/to smash\/to rout"],"pinyin":["ji1 kui4"],"word":"击溃"},{"definition":["to force entrance into\/to score a goal (sport)"],"pinyin":["gong1 ru4"],"word":"攻入"},{"definition":["secure as a city protected by a wall of metal and a moat of boiling water (idiom)\/well fortified\/invulnerable to attack"],"pinyin":["gu4 ruo4 jin1 tang1"],"word":"固若金汤"},{"definition":["to capture\/to take\/to overcome\/to solve"],"pinyin":["gong1 ke4"],"word":"攻克"},{"definition":["to seize control of (an enemy position)\/(fig.) to take by storm\/to gain (awards, control of a market etc)"],"pinyin":["gong1 zhan4"],"word":"攻占"},{"definition":["defensive line or perimeter\/CL:道[dao4]"],"pinyin":["fang2 xian4"],"word":"防线"},{"definition":["city"],"pinyin":["cheng2 chi2"],"word":"城池"},{"definition":["to march straight in unchallenged (military) (idiom)\/(fig.) to push deep into the heart of sth\/to flood in"],"pinyin":["chang2 qu1 zhi2 ru4"],"word":"长驱直入"},{"definition":["to besiege\/to beleaguer\/to attack from all sides\/to jointly speak or write against sb"],"pinyin":["wei2 gong1"],"word":"围攻"},{"definition":["to attack violently\/to storm"],"pinyin":["meng3 gong1"],"word":"猛攻"},{"definition":["to attack (the enemy)"],"pinyin":["gong1 da3"],"word":"攻打"},{"definition":["to occupy (a territory)\/to hold"],"pinyin":["zhan4 ling3"],"word":"占领"},{"definition":["to seize\/to capture\/to wrest control of"],"pinyin":["duo2 qu3"],"word":"夺取"},{"definition":["to sally\/to attack"],"pinyin":["chu1 ji1"],"word":"出击"},{"definition":["to attack for a long time without success"],"pinyin":["jiu3 gong1 bu4 xia4"],"word":"久攻不下"}]}