{"definition":["to let off\/to let slip by\/to let sb get away with sth"],"pinyin":["fang4 guo4"],"traditional":["放過"],"rank":8987.0,"normalized_rank":0.12573978985071285,"fraction":0.000009942390187939336,"cumulative_fraction":0.9205360524490116,"word":"放过","characters":[{"definition":["to put\/to place\/to release\/to free\/to let go\/to let out\/to set off (fireworks)"],"pinyin":["fang4"],"word":"放"},{"definition":["surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-","(experienced action marker)"],"pinyin":["Guo4","guo4","guo5"],"word":"过"}],"containing_words":[],"sentences":[{"english":"Position the hose at a downspout drain to discharge then let go of the crimp.","chinese":"位置处于降排水软管燃放然后放过了卷曲。"},{"english":"Kunlunfaction will let us do the small disciple?","chinese":"昆仑派会不会放过我们这些小弟子呢？"},{"english":"Be able to be alone. Lose not the advantage of solitude.","chinese":"要有零丁自处的能力，不要放过孤寂的好处。"},{"english":"To this day, countless cover versions of the song are played in clubs and at parties.","chinese":"到今天，俱乐部和派对上放过不计其数的翻唱版。"},{"english":"They never ignore any tatters, even an iron piece would bring them crazy joyous.","chinese":"破布烂衫不放过，碰上铁器喜如狂。"},{"english":"The law prefers to let off for one's past wrongdoings.","chinese":"法律有时宁愿放过一个人过去的罪行。"},{"english":"Major network operators naturally not miss this rare opportunity.","chinese":"各大网商自然不会放过这个难得的商机。"},{"english":"Just kidding. I'll let you off the hook.","chinese":"开玩笑的，我放过你。"},{"english":"The batter took the pitch.","chinese":"击球手放过这个投球没打。"},{"english":"But evanescence has never let go of fantasy.","chinese":"破灭却从不把幻想放过。"},{"english":"We should rectify the undesirable tendencies in time.","chinese":"不良倾向一冒尖儿就不要放过它。"},{"english":"You way ambition the square novel Ling dictator pass us?","chinese":"你道方小说陵皇帝会放过我们？"},{"english":"Therefore he that speaketh unjust things cannot be hid, neither shall the chastising judgment pass him by.","chinese":"执行报复的正义，也决不会将他放过。"},{"english":"Jane fear neither feel easy Zhou Han they would not miss.","chinese":"珍婶害怕觉得易周汉不会轻易放过她们。"},{"english":"The young reporter muckrakes at every opportunity.","chinese":"这位年轻的记者不放过揭发贪污腐化现象的任何机会。"},{"english":"Bardo's jealous ear was alive to the slight movement.","chinese":"巴尔多审慎的耳朵是不会放过任何轻微的响动的。"}],"related":[{"definition":["to give up\/to abandon (a goal etc)\/to let sth go\/forget it\/let the matter drop"],"pinyin":["ba4 xiu1"],"word":"罢休"},{"definition":["to leave the matter at that\/to be prepared to let go\/to be willing to take things lying down"],"pinyin":["shan4 ba4 gan1 xiu1"],"word":"善罢甘休"},{"definition":["to pardon\/to excuse\/to forgive"],"pinyin":["rao2 guo4"],"word":"饶过"},{"definition":["to kill to the last one (idiom)\/to exterminate\/to eradicate\/ruthless"],"pinyin":["gan3 jin4 sha1 jue2"],"word":"赶尽杀绝"},{"definition":["to give up"],"pinyin":["ba4 shou3"],"word":"罢手"},{"definition":["to release\/to set free\/to allow (a person or an animal) to go\/to liberate"],"pinyin":["fang4 zou3"],"word":"放走"},{"definition":["to forgive easily\/to let off lightly (often with negative: you won't get away with it)"],"pinyin":["qing1 rao2"],"word":"轻饶"},{"definition":["lit. start off leniently (idiom); please do not be too strict with me\/Do not judge me too harshly.\/Look favorably on my humble efforts."],"pinyin":["shou3 xia4 liu2 qing2"],"word":"手下留情"},{"definition":["old variant of 肯[ken3]","to agree\/to consent\/to be ready (to do sth)\/willing"],"pinyin":["ken3","ken3"],"word":"肯"},{"definition":["to start\/to put one's hand to\/to set about\/the seat to the right of the main guest"],"pinyin":["xia4 shou3"],"word":"下手"},{"definition":["easily\/lightly\/rashly"],"pinyin":["qing1 yi4"],"word":"轻易"},{"definition":["to excuse\/to forgive\/to pardon"],"pinyin":["yuan2 liang4"],"word":"原谅"},{"definition":["to relent (to spare sb's feelings)\/to show mercy or forgiveness\/to forbear\/lenient"],"pinyin":["liu2 qing2"],"word":"留情"},{"definition":["lit. to eat one's words\/to break a promise\/to go back on one's word\/to renege\/unsworn testimony"],"pinyin":["shi2 yan2"],"word":"食言"},{"definition":["to let go of sth held in one's mouth\/(fig.) to relent\/to yield"],"pinyin":["song1 kou3"],"word":"松口"},{"definition":["to kill\/to beat to death"],"pinyin":["da3 si3"],"word":"打死"}]}