{"definition":["use a long line to catch a big fish (idiom); a long-term plan for major returns"],"pinyin":["fang4 chang2 xian4 diao4 da4 yu2"],"traditional":["放長線釣大魚"],"rank":48795.0,"normalized_rank":0.6827053572677795,"fraction":1.6364091971222596e-7,"cumulative_fraction":0.998774565703157,"word":"放长线钓大鱼","characters":[{"definition":["to put\/to place\/to release\/to free\/to let go\/to let out\/to set off (fireworks)"],"pinyin":["fang4"],"word":"放"},{"definition":["length\/long\/forever\/always\/constantly","chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance"],"pinyin":["chang2","zhang3"],"word":"长"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)","variant of 線|线[xian4]"],"pinyin":["xian4","xian4"],"word":"线"},{"definition":["to fish with a hook and bait"],"pinyin":["diao4"],"word":"钓"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["surname Yu","fish\/CL:條|条[tiao2],尾[wei3]"],"pinyin":["Yu2","yu2"],"word":"鱼"}],"containing_words":[],"sentences":[{"english":"Put long term angle big fish, this is a kind of method that is used by most forum.","chinese":"放长线钓大鱼，这是被大多数论坛采用的一种方法。"},{"english":"First, investors have to develop a longer time horizon.","chinese":"首先，投资者需要拥有放长线钓大鱼的能力。"},{"english":"As over Bushehr, Iran plays a long game.","chinese":"至于布什尔，伊朗可以说是放长线钓大鱼。"},{"english":"Misaki Sato wanted to go fishing, he practices on the horse Xiaoqie some doubts.","chinese":"佐藤想放长线钓大鱼，他对马小茄的做法有些疑惑。"}],"related":[{"definition":["In order to capture, one must let loose.\/to loosen the reins only to grasp them better"],"pinyin":["yu4 qin2 gu4 zong4"],"word":"欲擒故纵"},{"definition":["lit. to pull a snake from its hole\/to expose a malefactor (idiom)"],"pinyin":["yin3 she2 chu1 dong4"],"word":"引蛇出洞"},{"definition":["to take the bait"],"pinyin":["shang4 gou1"],"word":"上钩"},{"definition":["you don't release the hawk until you've seen the hare (idiom)\/one doesn't act before one is sure to succeed"],"pinyin":["bu4 jian4 tu4 zi5 bu4 sa1 ying1"],"word":"不见兔子不撒鹰"},{"definition":["to beat sb at their own game (idiom)"],"pinyin":["jiang1 ji4 jiu4 ji4"],"word":"将计就计"},{"definition":["one who is not prepared to risk his child will never catch the wolf (proverb)\/(fig.) one who is unwilling to take risks will not achieve great things"],"pinyin":["she3 bu4 de5 hai2 zi5 tao4 bu4 zhu4 lang2"],"word":"舍不得孩子套不住狼"},{"definition":["rigorous schemes and deep foresight (idiom); astute and circumspect"],"pinyin":["lao3 mou2 shen1 suan4"],"word":"老谋深算"},{"definition":["bait"],"pinyin":["you4 er3"],"word":"诱饵"},{"definition":["lit. to toss a stone to find out what's ahead (idiom)\/fig. to test the waters"],"pinyin":["tou2 shi2 wen4 lu4"],"word":"投石问路"},{"definition":["to quit while one is ahead (idiom)\/to know when to stop"],"pinyin":["jian4 hao3 jiu4 shou1"],"word":"见好就收"},{"definition":["lit. please Sir, get into the boiling pot (idiom)\/fig. to give sb a taste of his own medicine"],"pinyin":["qing3 jun1 ru4 weng4"],"word":"请君入瓮"},{"definition":["lit. a crafty rabbit has three burrows\/a sly individual has more than one plan to fall back on (idiom)"],"pinyin":["jiao3 tu4 san1 ku1"],"word":"狡兔三窟"},{"definition":["to lure the tiger from its domain in the mountains (idiom)\/to lure an enemy away from his territory"],"pinyin":["diao4 hu3 li2 shan1"],"word":"调虎离山"},{"definition":["to threaten the east and strike to the west (idiom)\/to create a diversion"],"pinyin":["sheng1 dong1 ji1 xi1"],"word":"声东击西"},{"definition":["lit. to guard a tree-stump, waiting for rabbits (idiom)\/to wait idly for opportunities\/to trust to chance rather than show initiative"],"pinyin":["shou3 zhu1 dai4 tu4"],"word":"守株待兔"},{"definition":["delaying tactics\/stalling\/measures to stave off an attack\/stratagem to win a respite"],"pinyin":["huan3 bing1 zhi1 ji4"],"word":"缓兵之计"}]}