{"definition":["to disseminate"],"pinyin":["san4 bu4"],"traditional":["散佈"],"rank":14037.0,"normalized_rank":0.19639584178640884,"fraction":0.0000046356655186275184,"cumulative_fraction":0.9548109115355918,"word":"散布","characters":[{"definition":["scattered\/loose\/to come loose\/to fall apart\/leisurely\/powdered medicine","to scatter\/to break up (a meeting etc)\/to disperse\/to disseminate\/to dispel\/(coll.) to sack","variant of 散[san4]"],"pinyin":["san3","san4","san4"],"word":"散"},{"definition":["cloth\/to declare\/to announce\/to spread\/to make known","variant of 布[bu4]\/to announce\/to spread"],"pinyin":["bu4","bu4"],"word":"布"}],"containing_words":[],"sentences":[{"english":"They disseminated anti-French propaganda.","chinese":"他们散布了反法资料。"},{"english":"Commercial press-release distribution services are also used to distribute news releases.","chinese":"商业新闻发布分销服务也被用来散布新闻稿。"},{"english":"Stars create these elements and spew them into space.","chinese":"恒星产生这些元素并将其散布到太空中。"},{"english":"A string of tiny islands scattered off the Croatian coast are up for sale.","chinese":"一群散布在克罗地亚沿海的小岛正在出售中。"},{"english":"The error estimates for scattered data interpolants on spheres are discussed.","chinese":"讨论球面上散布数据点插值的误差估计问题。"},{"english":"Coffee retailer becomes latest food and beverage company to spread the wealth to investors.","chinese":"咖啡零售商最近成为散布投资者财富的餐饮公司。"},{"english":"Spread his word for non-believers left on earth.","chinese":"散布他的言词，使得非信徒离开地球。"},{"english":"the gossiper mates with the man herself.","chinese":"散布谣言的人自己就可以跟那个男人交配。"},{"english":"Opposite the islet, the beach consisted first of sand, covered with black stones, which were now appearing little by little above the retreating tide.","chinese":"小岛对面海滩的最低层是沙砾，上面散布着黑石头。"},{"english":"Several Chinese dairies are suspected of negligence in allowing the distribution of tainted milk products.","chinese":"几个中国牛奶场被怀疑在有毒乳制品散布上的有疏漏。"},{"english":"Besides computers, film and TV also spread vicious information.","chinese":"除了电脑，电影电视也在散布不良信息。"},{"english":"Rickety metal tables dotted the treed square.","chinese":"佝偻的金属桌子散布在有树的广场。"},{"english":"On the east side of the building, there is a promenade with an old growth poplar forest which acts as a windbreaker.","chinese":"在建筑的东边，由散布的原始白杨林充当防护林。"},{"english":"Small tan sesame seed-sized lice are seen scattered amongst the hairs of the head.","chinese":"芝麻大小黝黑小虱在头发中散布。"},{"english":"A fifty-six-year-old woman accused of spreading rumors.","chinese":"一位五十六岁的老妇人，罪名是散布谣言。"},{"english":"The tissue can effectively block the spread of droplets containing germs.","chinese":"面纸可有效阻隔含菌小水珠的散布。"}],"related":[{"definition":["to spread\/to disperse\/to disseminate"],"pinyin":["san4 bo1"],"word":"散播"},{"definition":["every place"],"pinyin":["ge4 chu4"],"word":"各处"},{"definition":["to cover the whole (area)\/to be found throughout"],"pinyin":["bian4 bu4"],"word":"遍布"},{"definition":["to spread\/to proliferate\/to diffuse\/spread\/proliferation\/diffusion"],"pinyin":["kuo4 san4"],"word":"扩散"},{"definition":["to cover densely"],"pinyin":["mi4 bu4"],"word":"密布"},{"definition":["to disperse\/to fall scattered\/to sprinkle"],"pinyin":["san4 luo4"],"word":"散落"},{"definition":["to make up\/to fabricate"],"pinyin":["nie1 zao4"],"word":"捏造"},{"definition":["to scatter\/to disperse\/to distribute"],"pinyin":["fen1 san4"],"word":"分散"},{"definition":["to compile\/to draw up\/to fabricate\/to invent\/to concoct\/to make up\/to cook up"],"pinyin":["bian1 zao4"],"word":"编造"},{"definition":["to cover up\/to conceal\/to go into hiding"],"pinyin":["cang2 ni4"],"word":"藏匿"},{"definition":["to extend\/to spread"],"pinyin":["man4 yan2"],"word":"蔓延"},{"definition":["to roam all over the place\/to go into every nook and corner\/to infiltrate\/(of criminals, enemies etc) to be on the run\/to flee and try to hide"],"pinyin":["liu2 cuan4"],"word":"流窜"},{"definition":["to purge"],"pinyin":["su4 qing1"],"word":"肃清"},{"definition":["to hide\/to go into hiding\/to take refuge"],"pinyin":["cang2 shen1"],"word":"藏身"},{"definition":["to conceal oneself\/to go into hiding\/to take cover"],"pinyin":["duo3 cang2"],"word":"躲藏"},{"definition":["rumor"],"pinyin":["yao2 yan2"],"word":"谣言"}]}