{"definition":["mixed martial arts"],"pinyin":["san4 da3"],"traditional":["散打"],"rank":20488.0,"normalized_rank":0.2866537013977306,"fraction":0.000002274039471255179,"cumulative_fraction":0.9759772592771262,"word":"散打","characters":[{"definition":["scattered\/loose\/to come loose\/to fall apart\/leisurely\/powdered medicine","to scatter\/to break up (a meeting etc)\/to disperse\/to disseminate\/to dispel\/(coll.) to sack","variant of 散[san4]"],"pinyin":["san3","san4","san4"],"word":"散"},{"definition":["to beat\/to strike\/to hit\/to break\/to type\/to mix up\/to build\/to fight\/to fetch\/to make\/to tie up\/to issue\/to shoot\/to calculate\/to play (a game)\/since\/from","dozen (loanword)"],"pinyin":["da3","da2"],"word":"打"}],"containing_words":[],"sentences":[{"english":"One of the classic comedies of Sichuanese comedian, Li Boqing…","chinese":"四川话评书人李伯清的经典散打评书之一。"},{"english":"Elite Sanshou players were more pliable than the general players.","chinese":"优秀散打运动员比一般运动员的坚韧性与总分更好。"},{"english":"There are different sorts of strength of Sanda .","chinese":"武术散打力量有不同的分类。"},{"english":"In 2002, Qianlong Budokan was hired as head coach of Sanda.","chinese":"2002年被潜龙武道馆聘为散打主教练。"},{"english":"The winter training result is evaluated by monitoring multi-indicators of Sanda sportsmen.","chinese":"通过监测散打运动员身体多项指标评定冬训训练效果。"},{"english":"Sanda of the origin and development of the Chinese nation and a long history of sync.","chinese":"散打的起源与发展，和中华民族的悠久历史同步。"},{"english":"Correlate costume of sport of Sanda look simple and not individual.","chinese":"散打运动的相关服装显得简单，没有个性。"},{"english":"Proposed that the martial arts kick boxing movement takes road of the popular is its development steady road.","chinese":"武术散打运动走大众化之路，才是其发展的平稳之道。"},{"english":"The rule of free combat has been gone through from scratch, is revising the perfect course constantly.","chinese":"散打规则经历了从无到有，不断修改完善的过程。"},{"english":"Lily: She also like free combat and Muay Thai.","chinese":"她也喜欢散打和泰拳。"},{"english":"Athletic injury is the main factor impact on professional Sanda athlete's life of athletics.","chinese":"运动损伤是影响专业散打运动员运动寿命的主要因素。"},{"english":"With the development of Sanda, physical attention by more and more people.","chinese":"随着散打运动的发展，身体素质越来越被人们所重视。"},{"english":"The competition will be conducted in accordance with the latest edition of the Rules for the International Wushu Sanshou Competition.","chinese":"比赛采用国际武联审定的最新《武术散打竞赛规则》。"},{"english":"Tactical awareness is a major factor influencing the Sanshou players performances.","chinese":"战术意识是影响散打运动员获取优异成绩的重要因素。"},{"english":"She also like free combat and Muay Thai.","chinese":"她也喜欢散打和泰拳。"}],"related":[{"definition":["Muay Thai - \"Thai fist\" - Martial Art"],"pinyin":["Tai4 quan2"],"word":"泰拳"},{"definition":["taekwondo (Korean martial art)"],"pinyin":["tai2 quan2 dao4"],"word":"跆拳道"},{"definition":["judo"],"pinyin":["rou2 dao4"],"word":"柔道"},{"definition":["jujitsu\/contortion (performance art)"],"pinyin":["rou2 shu4"],"word":"柔术"},{"definition":["to fight, esp. with hands\/wrestling (as a sport)\/to wrestle\/to wrestle (against fate, with a problem etc)\/to capture prey"],"pinyin":["bo2 ji1"],"word":"搏击"},{"definition":["military skill or technique (in former times)\/all kinds of martial art sports (some claiming spiritual development)\/self-defense\/tradition of choreographed fights from opera and film (recent usage)\/also called kungfu 功夫\/CL:種|种[zhong3]"],"pinyin":["wu3 shu4"],"word":"武术"},{"definition":["Yongchun - \"Singing Spring Fist\" (Chinese martial art)"],"pinyin":["yong3 chun1 quan2"],"word":"咏春拳"},{"definition":["Ba Ji Quan \"Eight Extremes Fist\" - Martial Art"],"pinyin":["ba1 ji2 quan2"],"word":"八极拳"},{"definition":["boxing"],"pinyin":["quan2 ji1"],"word":"拳击"},{"definition":["Changquan - Northern Shaolin (北少林) - Longfist - Martial Art"],"pinyin":["chang2 quan2"],"word":"长拳"},{"definition":["karate"],"pinyin":["kong1 shou3 dao4"],"word":"空手道"},{"definition":["Jeet Kun Do or Way of the Intercepting Fist, a fusion of Eastern and Western martial arts led by Bruce Lee 李小龍|李小龙[Li3 Xiao3 long2]"],"pinyin":["jie2 quan2 dao4"],"word":"截拳道"},{"definition":["Wing Chun\/same as 詠春拳|咏春拳[yong3 chun1 quan2]\/Yongchun - \"Singing Spring Fist\" (Chinese martial art)"],"pinyin":["yong3 chun1"],"word":"咏春"},{"definition":["to wrestle"],"pinyin":["ge2 dou4"],"word":"格斗"},{"definition":["Chinese boxing\/fisticuffs"],"pinyin":["quan2 shu4"],"word":"拳术"},{"definition":["aikido (Japanese martial art)\/hapkido (Korean martial art)"],"pinyin":["he2 qi4 dao4"],"word":"合气道"}]}