{"definition":["entire set"],"pinyin":["zheng3 tao4"],"traditional":["整套"],"rank":10201.0,"normalized_rank":0.14272522491010592,"fraction":0.000008039133888913466,"cumulative_fraction":0.9313345897402852,"word":"整套","characters":[{"definition":["exactly\/in good order\/whole\/complete\/entire\/in order\/orderly\/to repair\/to mend\/to renovate\/(coll.) to fix sb\/to give sb a hard time\/to mess with sb"],"pinyin":["zheng3"],"word":"整"},{"definition":["to cover\/to encase\/cover\/sheath\/to overlap\/to interleave\/to model after\/to copy\/formula\/harness\/loop of rope\/(fig.) to fish for\/to obtain slyly\/classifier for sets, collections\/bend (of a river or mountain range, in place names)\/tau (Greek letter Ττ)"],"pinyin":["tao4"],"word":"套"}],"containing_words":[],"sentences":[{"english":"The whole suit took 600 man hours to make. (Click on the above link to see the bejeweled suit.)","chinese":"整套西装用了600个工时。"},{"english":"They worked out a whole set of advanced cotton cultivation techniques which suited local conditions.","chinese":"他们发展了一整套适合当地情况的先进植棉技术。"},{"english":"The entire set of medallions is furnished with an organic glass plate.","chinese":"整套纪念章以有机玻璃牌进行装祯。"},{"english":"The four- Toed statue WILL be explained before the series ends.","chinese":"在整套剧集完结前，四只脚趾像会得到解释。"},{"english":"It's a question of getting the right mix of policies to appeal to the electorate.","chinese":"问题是要有能投合选民心意的一整套相配得当的政策。"},{"english":"Three minifigures are included: one male and one female astronaut as well as a service crew member.","chinese":"整套模型还有一男一女两名航天员及一个地勤人员。"},{"english":"This design is best for displaying product information and portfolios.","chinese":"这种设计最适宜于展示产品信息和整套作品组合。"},{"english":"Upmarket dyeing machine and the40- odd set of finishing facilities.","chinese":"高档染色机40余台及一整套后整理配套设施。"},{"english":"This article provides a comparative accurate foundation about the recover of the protolith in Baoyintu Group.","chinese":"为整套宝音图群的原岩恢复提供了较精确的依据。"},{"english":"Don Lucho has created an entire apartment out of cardboard and paper.","chinese":"唐卢乔用硬纸板和纸做了一整套公寓。"},{"english":"Cardigan A snazzy sweater instantly dresses up any outfit.","chinese":"开襟毛衣一件时髦的毛衣可以立即打亮整套造型。"},{"english":"The entire copy of the Great Britain Encyclopedia can be stored on several CD-ROMs ( compact discs-read only memory).","chinese":"整套的大英百科全书可以存储在几张CD盘中。"},{"english":"Breakthroughs have been made possible through integration of molecular and whole-plant aspects.","chinese":"突破已经被可能透过分子和整套设备方面的综合。"},{"english":"Also, set up a set of decision models under different decision rule.","chinese":"进一步建立了一整套在不同决策准则下的决策模型。"},{"english":"A bride's parents often buy a whole set of white goods as a dowry.","chinese":"新娘的父母通常都买一整套的家用电器作为嫁妆陪嫁。"},{"english":"So this is our main GM glasshouse, this suite.","chinese":"这里是我们主要的转基因温室，这一整套都是。"}],"related":[{"definition":["an entire set\/full complement"],"pinyin":["quan2 tao4"],"word":"全套"},{"definition":["suit\/a set\/a collection\/of the same kind\/the same old stuff\/set pattern of behavior"],"pinyin":["yi1 tao4"],"word":"一套"},{"definition":["forming a complete set\/complementing one another"],"pinyin":["cheng2 tao4"],"word":"成套"},{"definition":["to cover\/to encase\/cover\/sheath\/to overlap\/to interleave\/to model after\/to copy\/formula\/harness\/loop of rope\/(fig.) to fish for\/to obtain slyly\/classifier for sets, collections\/bend (of a river or mountain range, in place names)\/tau (Greek letter Ττ)"],"pinyin":["tao4"],"word":"套"},{"definition":["to have a skill\/to be savvy\/to know how to do sth"],"pinyin":["you3 yi1 tao4"],"word":"有一套"},{"definition":["faultless\/complete\/perfect\/to leave nothing to be desired"],"pinyin":["wan2 bei4"],"word":"完备"},{"definition":["outfit or suit (of clothes)\/set of coordinated items\/kit"],"pinyin":["tao4 zhuang1"],"word":"套装"},{"definition":["system\/setup\/CL:個|个[ge4]"],"pinyin":["ti3 xi4"],"word":"体系"},{"definition":["complete\/intact"],"pinyin":["wan2 zheng3"],"word":"完整"},{"definition":["to form a complete set\/compatible\/matching\/complementary"],"pinyin":["pei4 tao4"],"word":"配套"},{"definition":["to be effective (idiom)"],"pinyin":["xing2 zhi1 you3 xiao4"],"word":"行之有效"},{"definition":["(of systems, facilities etc) comprehensive\/well-developed\/excellent\/to refine\/to improve"],"pinyin":["wan2 shan4"],"word":"完善"},{"definition":["series\/set"],"pinyin":["xi4 lie4"],"word":"系列"},{"definition":["rigorous\/strict\/careful\/cautious\/compact\/well-knit"],"pinyin":["yan2 jin3"],"word":"严谨"},{"definition":["complete\/comprehensive"],"pinyin":["qi2 quan2"],"word":"齐全"},{"definition":["to unify\/to unite\/to integrate"],"pinyin":["tong3 yi1"],"word":"统一"}]}