{"definition":["to bring under control\/to regulate\/to restore to good condition\/(coll.) to fix (a person)\/to prepare (a meal etc)"],"pinyin":["zheng3 zhi4"],"traditional":["整治"],"rank":2244.0,"normalized_rank":0.03139647139479244,"fraction":0.00006666754425496384,"cumulative_fraction":0.7479351804443295,"word":"整治","characters":[{"definition":["exactly\/in good order\/whole\/complete\/entire\/in order\/orderly\/to repair\/to mend\/to renovate\/(coll.) to fix sb\/to give sb a hard time\/to mess with sb"],"pinyin":["zheng3"],"word":"整"},{"definition":["to rule\/to govern\/to manage\/to control\/to harness (a river)\/to treat (a disease)\/to wipe out (a pest)\/to punish\/to research"],"pinyin":["zhi4"],"word":"治"}],"containing_words":[],"sentences":[{"english":"So what happens in the very likely event they find more tainted products?","chinese":"那么，如果在整治中发现了更加有害的产品呢？"},{"english":"With special renovation, Beijing will again take on the scene it once had, complete with its historical rivers and classical gardens.","chinese":"通过专项整治，再现京城水系和古典园林的历史风貌。"},{"english":"This is in addition to the seven villages that have now been remediated.","chinese":"这一数字不包括现在正采取整治措施的七个村庄。"},{"english":"Another 690 were ordered to renovate their plants and improve product quality, it said.","chinese":"另外690家企业被勒令整治以提高产品质量。"},{"english":"The transport sector will Silverstrand Fu Xian Xianyang paragraph to carry out special maintenance training.","chinese":"交通部门将对福银线西安至咸阳段进行专项维修整治。"},{"english":"The paper introduced the renovation plan of dangerous bridges along the local narrow track railway in Henan Province.","chinese":"本文介绍了河南省窄轨地方铁路危桥整治方案。"},{"english":"Geological explor(?)tion is regarded by the author as a basis for pre-phase programming and management of natural resource.","chinese":"本文认为地质勘查是国土规划和整治的前期基础工作。"},{"english":"Fifth, we will launch an extensive campaign to solve production safety problems.","chinese":"第五，深入开展安全生产专项整治。"},{"english":"In the process of certain west lake dredging and rectification, large amount of lakebed mud is used to fill pond.","chinese":"某市西湖整治清淤过程中，大量湖底淤泥被用于填塘。"},{"english":"Based on the experience of Wujiang River waterway regulation, Wujiang River waterway rapids are classified.","chinese":"根据乌江航道整治经验，对乌江航道滩险进行分类。"},{"english":"The responsible editor is the key factor of governing academic corrupt.","chinese":"责任编辑是整治学术腐败环节中的关键。"},{"english":"The Chinese government is continuing to tackle the problem of child trafficking.","chinese":"中国政府正继续整治拐卖儿童的问题。"},{"english":"Hill slopes within the railway line's right-of-way shall be conditioned by the railway transport enterprise.","chinese":"铁路地界以内的山坡地由铁路运输企业进行整治。"},{"english":"The ecosystem service value of the regulated river is greatly elevated.","chinese":"整治后的张家浜体现出较高的生态系统服务价值。"},{"english":"The paper states the design of the trestle protection of foundation pit of intercepting trunk in Longhugou regulation in Santou City.","chinese":"阐述汕头市龙湖沟整治中截污干管的基坑支护设计。"},{"english":"This provided reference for the treatment of the same kind of belt along the shore-land of reservoir in Loess Plateau, north of Shanxi Province.","chinese":"为晋北高原其他同类水库库滨带整治提供一些借鉴。"}],"related":[{"definition":["to govern\/to administer\/to manage\/to control\/governance"],"pinyin":["zhi4 li3"],"word":"治理"},{"definition":["to tidy up\/to reorganize\/to consolidate\/to rectify"],"pinyin":["zheng3 dun4"],"word":"整顿"},{"definition":["to investigate strictly"],"pinyin":["yan2 cha2"],"word":"严查"},{"definition":["to suppress\/to crack down on\/to prohibit"],"pinyin":["qu3 di4"],"word":"取缔"},{"definition":["to reform\/to rectify and improve"],"pinyin":["zheng3 gai3"],"word":"整改"},{"definition":["to investigate and handle (a criminal case)"],"pinyin":["cha2 chu3"],"word":"查处"},{"definition":["to strike a severe blow\/to crack down\/to take strong measures"],"pinyin":["yan2 li4 da3 ji1"],"word":"严厉打击"},{"definition":["to investigate thoroughly\/to carefully inspect\/to verify\/to ferret out (undesirable elements)"],"pinyin":["qing1 cha2"],"word":"清查"},{"definition":["chaos\/madness"],"pinyin":["luan4 xiang4"],"word":"乱象"},{"definition":["to crack down on\/to take severe measures against"],"pinyin":["yan2 da3"],"word":"严打"},{"definition":["to patrol"],"pinyin":["xun2 cha2"],"word":"巡查"},{"definition":["to inspect\/to run through a checklist\/to take stock\/to audit"],"pinyin":["pai2 cha2"],"word":"排查"},{"definition":["abbr. for 違章建築|违章建筑, illegal construction"],"pinyin":["wei2 jian4"],"word":"违建"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"监管"},{"definition":["strict\/serious\/solemn\/dignified\/to tidy up\/to clean up\/to purge\/to adjust"],"pinyin":["zheng3 su4"],"word":"整肃"},{"definition":["to try harder\/to redouble one's efforts"],"pinyin":["jia1 da4 li4 du4"],"word":"加大力度"}]}