{"definition":["to reform\/to rectify and improve"],"pinyin":["zheng3 gai3"],"traditional":["整改"],"rank":3569.0,"normalized_rank":0.04993494046702951,"fraction":0.00003854086706646047,"cumulative_fraction":0.8152610943068288,"word":"整改","characters":[{"definition":["exactly\/in good order\/whole\/complete\/entire\/in order\/orderly\/to repair\/to mend\/to renovate\/(coll.) to fix sb\/to give sb a hard time\/to mess with sb"],"pinyin":["zheng3"],"word":"整"},{"definition":["to change\/to alter\/to transform\/to correct"],"pinyin":["gai3"],"word":"改"}],"containing_words":[],"sentences":[{"english":"II. 199 foreign business invested commercial enterprises need to make rectifications after sorting out.","chinese":"经过清理需要进行整改的外商投资商业企业199家。"},{"english":"France's Gendarmerie Nationale recently decided to review its IT infrastructure policies.","chinese":"法国国家宪兵队最近决定整改它的IT基建设施政策。"},{"english":"China is set to reshape its government-funded public institutions to improve public services.","chinese":"为提高公共服务质量，我国将对事业单位进行整改。"},{"english":"Some concrete and effective measures for rectifying above status was put forward.","chinese":"提出了具体有效的整改措施。"},{"english":"The administration says these changes will have no cost to taxpayers.","chinese":"联邦政府表示这些整改计划不会对纳税人增加负担。"},{"english":"Safety Committee will register the potential risks and improvement.","chinese":"安委会将有关隐患及整改结果登记存档。"},{"english":"To supervise the self-examination and periodically service industry.","chinese":"还要督促服务行业定期开展自查和整改。"},{"english":"Complete self-inspection report, and follow up the actions related to self-inspection findings.","chinese":"完成自检报告，并跟进整改行动。"},{"english":"The causes for deterioration of heat conducting oil were analyzed, and the countermeasures and its effects were introduced.","chinese":"分析了焦化厂导热油变质原因，介绍整改措施与效果。"},{"english":"Supplier Xinge has sent its corrective measures and proofs back.","chinese":"供应商新格已将整改措施及证据回传给过来。"},{"english":"In order to address these problems, Shengwen immediately adopted three rectifications and reforms.","chinese":"针对这些情况，盛文迅速进行了三项整改。"},{"english":"Finally some suggestions and reform measures to prevent this kind of accidents are proposed.","chinese":"最后提出了避免该类事故发生的相关建议和整改措施。"},{"english":"After receipt of the letter of non-compliance the operator will be given the opportunity to implement corrective measures.","chinese":"收到不符合通知后，操作者有机会实施整改措施。"},{"english":"The schedule of refits , refreshes, extensions and new store openings.","chinese":"整改，装修，扩张和新开店计划。"},{"english":"China wants to show that it is serious about improving the image of its food and drug products.","chinese":"中国想要表现出对整改药监局非常重视的样子。"},{"english":"To review and verify the reports on the rectification of related financial institutions.","chinese":"负责审核有关金融机构整改报告的具体工作。"}],"related":[{"definition":["to bring under control\/to regulate\/to restore to good condition\/(coll.) to fix (a person)\/to prepare (a meal etc)"],"pinyin":["zheng3 zhi4"],"word":"整治"},{"definition":["(of a power plant, refinery etc) to shut down"],"pinyin":["guan1 ting2"],"word":"关停"},{"definition":["to suppress\/to crack down on\/to prohibit"],"pinyin":["qu3 di4"],"word":"取缔"},{"definition":["to order\/to enjoin\/to charge\/to instruct sb to finish sth"],"pinyin":["ze2 ling4"],"word":"责令"},{"definition":["to tear down\/to demolish\/to dismantle\/to remove"],"pinyin":["chai1 chu2"],"word":"拆除"},{"definition":["to tidy up\/to reorganize\/to consolidate\/to rectify"],"pinyin":["zheng3 dun4"],"word":"整顿"},{"definition":["to violate (rules)\/irregular\/illegal\/corrupt"],"pinyin":["wei2 gui1"],"word":"违规"},{"definition":["abbr. for 違章建築|违章建筑, illegal construction"],"pinyin":["wei2 jian4"],"word":"违建"},{"definition":["to set a time limit\/time limit\/deadline"],"pinyin":["xian4 qi1"],"word":"限期"},{"definition":["to charge (an entity) with (a task)\/to assign (sb) the task of"],"pinyin":["ze2 cheng2"],"word":"责成"},{"definition":["to hold accountable\/to blame\/to censure\/to apportion blame"],"pinyin":["wen4 ze2"],"word":"问责"},{"definition":["responsible person\/coordinator"],"pinyin":["ze2 ren4 ren2"],"word":"责任人"},{"definition":["to investigate and handle (a criminal case)"],"pinyin":["cha2 chu3"],"word":"查处"},{"definition":["to inspect\/to run through a checklist\/to take stock\/to audit"],"pinyin":["pai2 cha2"],"word":"排查"},{"definition":["to be overdue\/to fail to meet a deadline\/to be behind in doing sth"],"pinyin":["yu2 qi1"],"word":"逾期"},{"definition":["to take down from the shelves (e.g. a contaminated product)"],"pinyin":["xia4 jia4"],"word":"下架"}]}