{"definition":["to tidy up\/to reorganize\/to consolidate\/to rectify"],"pinyin":["zheng3 dun4"],"traditional":["整頓"],"rank":4264.0,"normalized_rank":0.05965889216907084,"fraction":0.000030544066689336966,"cumulative_fraction":0.8390532159253452,"word":"整顿","characters":[{"definition":["exactly\/in good order\/whole\/complete\/entire\/in order\/orderly\/to repair\/to mend\/to renovate\/(coll.) to fix sb\/to give sb a hard time\/to mess with sb"],"pinyin":["zheng3"],"word":"整"},{"definition":["to stop\/to pause\/to arrange\/to lay out\/to kowtow\/to stamp (one's foot)\/at once\/classifier for meals, beatings, scoldings etc: time, bout, spell, meal"],"pinyin":["dun4"],"word":"顿"}],"containing_words":[],"sentences":[{"english":"The reorganization plan of the enterprise shall be discussed by the congress of the staff and workers of the enterprise.","chinese":"企业整顿方案应当经过企业职工代表大会讨论。"},{"english":"Best straighten up for a longer legacy.","chinese":"最好的整顿较长的遗产。"},{"english":"Roy:Apparently, getting your ass kicked is now a part of this complete breakfast.","chinese":"看起来，被打得稀里哗啦会是你整顿早饭的一部分了。"},{"english":"Never clear off your desk by randomly throwing things in a drawer.","chinese":"不要为了收拾整顿你的桌子而随便把东西扔进抽斗里。"},{"english":"Cameroon Ministry of Communications has also ordered three companies of informal long-distance passenger business for rectification.","chinese":"喀交通部还勒令三家非正规长途客运公司停业整顿。"},{"english":"We should put the society in order.","chinese":"我们必须整顿社会秩序。"},{"english":"To rectify the Party's style of work and improve social conduct, we should start with the senior cadres.","chinese":"为了整顿党风，搞好民风，先要从我们高级干部整起。"},{"english":"The next day, the unit will be ordered to suspend business for reorganization.","chinese":"第二天，该单位将被勒令停业整顿业务。"},{"english":"With adim triumph, she trims the swimming-suit rim at the swimming-pool brim.","chinese":"她带着暗淡的喜悦在泳池边整顿泳装的边沿。"},{"english":"The government decided to neaten the real estate market.","chinese":"国家下决心整顿房产市场。"},{"english":"Chinese Premier Wen Jiabao said, \"We will work to rectify and standarize the real estate market.","chinese":"他还说，我们将整顿规范房地产市场。"},{"english":"A number of securities companies were closed or temporary closed for reorganizing because of irregular operations.","chinese":"部分证券公司因违规经营被撤销或停业整顿。"},{"english":"To be responsible for the rectification and closure of coal mines.","chinese":"负责指导煤矿整顿关闭工作。"},{"english":"Supervising market orders is at the same time to supervise the government.","chinese":"治理整顿市场秩序的同时也要治理整顿政府自身。"},{"english":"Supervising market orders is at the same time to supervise the government.","chinese":"治理整顿市场秩序的同时也要治理整顿政府自身。"},{"english":"We will rectify and standardize the market order.","chinese":"整顿和规范市场经济秩序。"}],"related":[{"definition":["strict\/serious\/solemn\/dignified\/to tidy up\/to clean up\/to purge\/to adjust"],"pinyin":["zheng3 su4"],"word":"整肃"},{"definition":["to bring under control\/to regulate\/to restore to good condition\/(coll.) to fix (a person)\/to prepare (a meal etc)"],"pinyin":["zheng3 zhi4"],"word":"整治"},{"definition":["to investigate thoroughly\/to carefully inspect\/to verify\/to ferret out (undesirable elements)"],"pinyin":["qing1 cha2"],"word":"清查"},{"definition":["to purge"],"pinyin":["su4 qing1"],"word":"肃清"},{"definition":["to suppress\/to crack down on\/to prohibit"],"pinyin":["qu3 di4"],"word":"取缔"},{"definition":["to reform\/to rectify and improve"],"pinyin":["zheng3 gai3"],"word":"整改"},{"definition":["to investigate strictly"],"pinyin":["yan2 cha2"],"word":"严查"},{"definition":["chaos\/madness"],"pinyin":["luan4 xiang4"],"word":"乱象"},{"definition":["to investigate thoroughly"],"pinyin":["che4 cha2"],"word":"彻查"},{"definition":["to issue (a memorandum etc) to lower levels\/to distribute (e.g. disaster relief to victims)"],"pinyin":["xia4 fa1"],"word":"下发"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"监管"},{"definition":["to restructure\/to reorganize\/to revamp"],"pinyin":["chong2 zheng3"],"word":"重整"},{"definition":["to govern\/to administer\/to manage\/to control\/governance"],"pinyin":["zhi4 li3"],"word":"治理"},{"definition":["to try harder\/to redouble one's efforts"],"pinyin":["jia1 da4 li4 du4"],"word":"加大力度"},{"definition":["to incorporate into one's troops\/to weave in"],"pinyin":["shou1 bian1"],"word":"收编"},{"definition":["to clear up\/to tidy up\/to dispose of"],"pinyin":["qing1 li3"],"word":"清理"}]}