{"definition":["power cut\/electric power failure"],"pinyin":["duan4 dian4"],"traditional":["斷電"],"rank":15943.0,"normalized_rank":0.22306325465560425,"fraction":0.000003698051221293328,"cumulative_fraction":0.962729923938822,"word":"断电","characters":[{"definition":["to break\/to snap\/to cut off\/to give up or abstain from sth\/to judge\/(usu. used in the negative) absolutely\/definitely\/decidedly"],"pinyin":["duan4"],"word":"断"},{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"电"}],"containing_words":[],"sentences":[{"english":"Millions of residences remain without power and water.","chinese":"数百万户家庭依然断水断电。"},{"english":"Residents of many major urban areas complain of 20-hour-long daily blackouts.","chinese":"很多大城市的居民抱怨每天断电时间长达20小时。"},{"english":"With integral manual override, tubing is pinched closed in de-energized state.","chinese":"随着积分手动装置，油管是捏在封闭状态断电。"},{"english":"Power loss in the inducer would trigger the deck's playback circuit.","chinese":"一旦引导器断电，终端的回放电路就会被触发。"},{"english":"We haudio-videoe an auxiliary generator in case of power cuts.","chinese":"我们有一台万一断电时运用的备用发电机。"},{"english":"When changing the inductor, the power must be cut off making the equipment under the state of power off.","chinese":"更换感应器时，必须切断电源应使设备处于断电状态。"},{"english":"For fare that the electricity will cut off, people storm into convenience store to grab candles.","chinese":"为了勉于断电之苦，人们踊进便利商店抢购蜡烛。"},{"english":"The wires in circuits are kept from heating by either fuses or circuit breakers.","chinese":"保险丝或断电器可以保护电路中的电线不致过热。"},{"english":"It has breakpoint memory and power-off protection function.","chinese":"断点记忆和断电保护功能。"},{"english":"I took candles to the Xinhua bookstore on Zhongshan Rd . so I could look for books when the power failed.","chinese":"我到中山路的新华书店都自带蜡烛，以备断电后使用。"},{"english":"Huge swaths of the capital remained in darkness as a result of widespread power failures.","chinese":"由于大面积断电，医院的大多数地方都漆黑一团。"},{"english":"What happens if my computer suddenly loses power while I am in the middle of playing? Does my donation still count?","chinese":"如果在玩游戏时电脑突然断电，我的捐赠还算数吗？"},{"english":"When some phase breaks, it can give an alarm with sound and light.","chinese":"当某相线路断电时，可进行声光报警。"},{"english":"Since Mr Yang ignored the order, the school’s water and electricity have been cut off.","chinese":"因为杨校长无视政府关停令，该校目前已被断水断电。"},{"english":"In addition, the prosthetic hand has the feature of auto power-off to save the energy.","chinese":"此外并具有自动断电机制，可达到节能省电之目标。"},{"english":"At least one person was killed in Fukushimaprefecture, north of Tokyowhere four million homes were without power.","chinese":"福岛有1人死亡，东京北部400万户家庭断电。"}],"related":[{"definition":["electric power source"],"pinyin":["dian4 yuan2"],"word":"电源"},{"definition":["(of a circuit breaker or switch) to trip"],"pinyin":["tiao4 zha2"],"word":"跳闸"},{"definition":["(of a circuit breaker or switch) to trip"],"pinyin":["tiao4 dian4"],"word":"跳电"},{"definition":["electric switch\/circuit breaker"],"pinyin":["dian4 zha2"],"word":"电闸"},{"definition":["electric (apparatus)\/electrified\/having electricity supply (of a house)"],"pinyin":["you3 dian4"],"word":"有电"},{"definition":["to supply electricity"],"pinyin":["gong1 dian4"],"word":"供电"},{"definition":["short circuit"],"pinyin":["duan3 lu4"],"word":"短路"},{"definition":["to leak electricity\/(fig.) (coll.) to unintentionally arouse romantic interest (by being solicitous etc)\/cf. 放電|放电[fang4 dian4]"],"pinyin":["lou4 dian4"],"word":"漏电"},{"definition":["discharged\/flat\/dead (of batteries)"],"pinyin":["mei2 dian4"],"word":"没电"},{"definition":["to set up an electric circuit\/to electrify\/to switch on\/to be connected to an electricity grid\/open telegram"],"pinyin":["tong1 dian4"],"word":"通电"},{"definition":["to have a power failure\/power cut"],"pinyin":["ting2 dian4"],"word":"停电"},{"definition":["to turn off (a machine or device)\/to finish shooting a film"],"pinyin":["guan1 ji1"],"word":"关机"},{"definition":["to switch off\/to shut off"],"pinyin":["guan1 diao4"],"word":"关掉"},{"definition":["to close\/to shut"],"pinyin":["guan1 bi4"],"word":"关闭"},{"definition":["power cable (of an appliance etc)"],"pinyin":["dian4 yuan2 xian4"],"word":"电源线"},{"definition":["to catch fire\/to cook\/to get angry"],"pinyin":["qi3 huo3"],"word":"起火"}]}