{"definition":["(of a newly appointed official) to make bold changes on assuming office (idiom)"],"pinyin":["xin1 guan1 shang4 ren4 san1 ba3 huo3"],"traditional":["新官上任三把火"],"rank":46979.0,"normalized_rank":0.6572971611657549,"fraction":1.9575599762185105e-7,"cumulative_fraction":0.9984485896336032,"word":"新官上任三把火","characters":[{"definition":["abbr. for Xinjiang 新疆[Xin1 jiang1] or Singapore 新加坡[Xin1 jia1 po1]\/surname Xin","new\/newly\/meso- (chemistry)"],"pinyin":["Xin1","xin1"],"word":"新"},{"definition":["surname Guan","government official\/governmental\/official\/public\/organ of the body\/CL:個|个[ge4]"],"pinyin":["Guan1","guan1"],"word":"官"},{"definition":["on top\/upon\/above\/upper\/previous\/first (of multiple parts)\/to climb\/to get onto\/to go up\/to attend (class or university)","see 上聲|上声[shang3 sheng1]"],"pinyin":["shang4","shang3"],"word":"上"},{"definition":["surname Ren\/Ren County 任縣|任县[Ren2 Xian4] in Hebei","to assign\/to appoint\/to take up a post\/office\/responsibility\/to let\/to allow\/to give free rein to\/no matter (how, what etc)\/classifier for terms served in office, or for spouses, girlfriends etc (as in 前任男友)"],"pinyin":["Ren2","ren4"],"word":"任"},{"definition":["surname San","three\/3"],"pinyin":["San1","san1"],"word":"三"},{"definition":["handle","to hold\/to contain\/to grasp\/to take hold of\/handle\/particle marking the following noun as a direct object\/classifier for objects with handle\/classifier for small objects: handful"],"pinyin":["ba4","ba3"],"word":"把"},{"definition":["fire\/urgent\/ammunition\/fiery or flaming\/internal heat (Chinese medicine)\/hot (popular)\/classifier for military units (old)\/Kangxi radical 86","surname Huo"],"pinyin":["huo3","Huo3"],"word":"火"}],"containing_words":[],"sentences":[{"english":"Daintry'the brigadier explained'is our new broom . '","chinese":"“邓粹是新官上任三把火，”旅长解释道。"},{"english":"A new broom sweeps clean Lately, the gym has a \"new\" trainer manager, who is promoted from one of the trainers.","chinese":"新官上任三把火最近健身房里的教练换了一个经理。"},{"english":"There is an old saying in China, whose English equivalent is “a new broom sweeps clean”.","chinese":"中国俗话说“新官上任三把火”。"}],"related":[{"definition":["to ride to take up an official appointment (idiom); to take on a job with alacrity\/to undertake a task"],"pinyin":["zou3 ma3 shang4 ren4"],"word":"走马上任"},{"definition":["new emperor, new officials (idiom)\/a new chief brings in new aides"],"pinyin":["yi1 chao2 tian1 zi3 yi1 chao2 chen2"],"word":"一朝天子一朝臣"},{"definition":["to take office\/previous (incumbent)\/predecessor"],"pinyin":["shang4 ren4"],"word":"上任"},{"definition":["working hand\/member of a work team\/participant\/(short form of 第一把手[di4 yi1 ba3 shou3]) the boss"],"pinyin":["yi1 ba3 shou3"],"word":"一把手"},{"definition":["lit. to kill a chicken in front of a monkey; fig. to make an example of sb (by punishment) to frighten others"],"pinyin":["sha1 ji1 gei3 hou2 kan4"],"word":"杀鸡给猴看"},{"definition":["lit. to kill the donkey when the grinding is done (idiom)\/to get rid of sb once he has ceased to be useful"],"pinyin":["xie4 mo4 sha1 lu:2"],"word":"卸磨杀驴"},{"definition":["don't meddle in affairs that are not part of your position (Confucius)"],"pinyin":["bu4 zai4 qi2 wei4 bu4 mou4 qi2 zheng4"],"word":"不在其位不谋其政"},{"definition":["lit. killing the chicken to warn the monkey (idiom)\/fig. to punish an individual as an example to others\/pour encourager les autres"],"pinyin":["sha1 ji1 jing3 hou2"],"word":"杀鸡儆猴"},{"definition":["the shot hits the bird that pokes its head out (idiom)\/nonconformity gets punished"],"pinyin":["qiang1 da3 chu1 tou2 niao3"],"word":"枪打出头鸟"},{"definition":["bold and decisive"],"pinyin":["da4 dao1 kuo4 fu3"],"word":"大刀阔斧"},{"definition":["to make a mess of sth"],"pinyin":["tong3 lou2 zi5"],"word":"捅娄子"},{"definition":["to be in a position of power"],"pinyin":["da4 quan2 zai4 wo4"],"word":"大权在握"},{"definition":["deputy leader\/the second-in-command"],"pinyin":["er4 ba3 shou3"],"word":"二把手"},{"definition":["to wave a chicken feather as a token of authority (idiom); to assume unwarranted authority on the basis of some pretext"],"pinyin":["na2 zhe5 ji1 mao2 dang4 ling4 jian4"],"word":"拿着鸡毛当令箭"},{"definition":["lit. If the upper beam is not straight, the lower beam will be crooked (idiom); fig. subordinates imitate their superiors' vices"],"pinyin":["shang4 liang2 bu4 zheng4 xia4 liang2 wai1"],"word":"上梁不正下梁歪"},{"definition":["to appoint people by favoritism (idiom); nepotism\/corrupt appointment"],"pinyin":["ren4 ren2 wei2 qin1"],"word":"任人唯亲"}]}