{"definition":["one of three fabled islands in Eastern sea, abode of immortals","square zhang (i.e. unit of area 10 feet square)\/monastic room 10 feet square\/Buddhist or Daoist abbot\/abbot's chamber"],"pinyin":["Fang1 zhang5","fang1 zhang5"],"traditional":["方丈","方丈"],"rank":23322.0,"normalized_rank":0.32630503826619844,"fraction":0.0000017293969454333102,"cumulative_fraction":0.981602972358949,"word":"方丈","characters":[{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["fang1","Fang1"],"word":"方"},{"definition":["measure of length, ten Chinese feet (3.3 m)\/to measure\/husband\/polite appellation for an older male"],"pinyin":["zhang4"],"word":"丈"}],"containing_words":[],"sentences":[{"english":"In ancient times, when there is a Shaolin abbot of appealing to the field.","chinese":"在古代的时候，有一个少林寺的方丈到外地化缘。"},{"english":"Behind the hall is the residence of the abbot and monks.","chinese":"正殿后面是方丈和僧人的住处。"},{"english":"Yet the abbot sad tears.","chinese":"听言方丈悲痛流泪。"},{"english":"Abbot see this old instrument out of the ordinary, they invited him to To the temple to drink tea.","chinese":"方丈见这老人仪表不凡，便邀他到寺里喝茶。"},{"english":"My master was Abbot Xingzheng. I was born to a devout Buddhist family of several generations of believers.","chinese":"我师父是当时少林寺的住持，方丈行正老和尚。"},{"english":"Mr. Qian relayed Shaolin Temple abbot Shi as saying.","chinese":"钱先生转述少林寺方丈释永信的话说。"},{"english":"The monk had someone served them first and walked Lord Guan to abbot's chamber.","chinese":"普净教取茶先奉夫人，然后请关公入方丈。"},{"english":"Abbot see body scar, confirmation is made by omega supreme palm of shaolin.","chinese":"方丈查看尸体伤痕时，确认是少林的大力金刚掌所为。"},{"english":"Warned him abbot thought for a long time, mont forget to beginners mind, he went down the mountain.","chinese":"方丈思虑许久，告诫他不忘初心，准他下山了。"},{"english":"The Master Jin Chengze pass three big ordination and the followers more than 1000.","chinese":"金诚泽方丈连传三坛大戒，戒子超过千余人。"},{"english":"Monk of deficient is Shaolin Temple abbot, law order nocturnal emission.","chinese":"贫僧乃少林寺方丈，法号梦遗。"},{"english":"The Jingshan abbot chair in Southern Song Dynasty is discovered to be a new kind of circular chair.","chinese":"研究表明径山方丈椅是新发现的又一种宋代圈椅。"},{"english":"The Abbot sent him to plant vegetable fields as a start of kungfu skill practice.","chinese":"方丈把他送到工厂菜地作为功夫技能实践的开始。"},{"english":"Abbot is informed this matter, censure wide kind as hutch head not this Wu portion.","chinese":"方丈得知此事，指责广慈身为厨头不务本份。"},{"english":"Smell the way to the abbot, begged the abbot to save because of them.","chinese":"闻道找来方丈，恳求方丈救正因他们。"},{"english":"Smell the way to the abbot, begged the abbot to save because of them.","chinese":"闻道找来方丈，恳求方丈救正因他们。"}],"related":[{"definition":["Buddhist monk"],"pinyin":["he2 shang5"],"word":"和尚"},{"definition":["a senior monk"],"pinyin":["gao1 seng1"],"word":"高僧"},{"definition":["name in religion (of Buddhist or Daoist within monastery)"],"pinyin":["fa3 hao4"],"word":"法号"},{"definition":["Buddhist hall"],"pinyin":["chan2 yuan4"],"word":"禅院"},{"definition":["poor monk (humble term used by monk of himself)"],"pinyin":["pin2 seng1"],"word":"贫僧"},{"definition":["Taoist priest\/Daoist priest"],"pinyin":["Dao4 Zhang3"],"word":"道长"},{"definition":["to administer a monastery Buddhist or Daoist\/abbot\/head monk"],"pinyin":["zhu4 chi2"],"word":"住持"},{"definition":["Taoist or Buddhist rite\/abbr. for 菩提道場|菩提道场[Pu2 ti2 dao4 chang3]"],"pinyin":["dao4 chang3"],"word":"道场"},{"definition":["benefactor (term used by a monk to address a layperson)\/donor (semiconductor)"],"pinyin":["shi1 zhu3"],"word":"施主"},{"definition":["Buddhist temple\/mosque\/government office (old)"],"pinyin":["si4"],"word":"寺"},{"definition":["(Buddhism) benefactor (designation of a lay person by a monk)"],"pinyin":["tan2 yue4"],"word":"檀越"},{"definition":["monk"],"pinyin":["seng1 ren2"],"word":"僧人"},{"definition":["the Shaolin monastery and martial arts school"],"pinyin":["Shao4 lin2"],"word":"少林"},{"definition":["used for 師傅|师傅 (in Taiwan)\/master\/qualified worker"],"pinyin":["shi1 fu5"],"word":"师父"},{"definition":["monk\/Sangha, the Buddhist monastic order"],"pinyin":["seng1"],"word":"僧"},{"definition":["a Buddhist temple"],"pinyin":["chan2 lin2"],"word":"禅林"}]}