{"definition":["to exert (effort or pressure)"],"pinyin":["shi1 jia1"],"traditional":["施加"],"rank":12794.0,"normalized_rank":0.17900465910203853,"fraction":0.000005487444971366892,"cumulative_fraction":0.948526246979413,"word":"施加","characters":[{"definition":["surname Shi","to grant\/to give\/to bestow\/to act\/to carry out"],"pinyin":["Shi1","shi1"],"word":"施"},{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"}],"containing_words":[],"sentences":[{"english":"Does water exert the same pressure in all directions?","chinese":"水向各个方向所施加的压力相同吗？"},{"english":"Do not misconstrue it as an effort to exert force or pressure.","chinese":"不要把它误解为需要卯尽全力或施加压力的苦差事。"},{"english":"In this study, various coupling agents were also used to improve strength of particleboard.","chinese":"施加偶联剂也可以提高玻璃纤维布增强刨花板的强度。"},{"english":"The green budget measure turns the pressure back on his critics.","chinese":"这些绿色预算措施将压力施加给陆先生的批评家们。"},{"english":"They also said they would pressure some members who have been overproducing.","chinese":"他们还表示要向超产的一些成员国施加压力。"},{"english":"We now have more public opinion exerting pressure on politics than ever before.","chinese":"现在对政治施加压力的公众舆论比以前增多了。"},{"english":"Pressure on the underside of the thighs from an incorrect (too high) seat position makes this worse.","chinese":"对大腿下面施加压力的不正确坐姿会使情况更糟。"},{"english":"Pre-stress must be inflicted during the cable net construction.","chinese":"索网在建设时必须施加预应力。"},{"english":"It also seeks to influence the decisions being made in Tehran.","chinese":"同时也是在试图对德黑兰的决定施加影响。"},{"english":"It was reported that a certain statesman had exercised great political influence over you.","chinese":"据传某政治家曾对你施加过巨大的政治影响。"},{"english":"The factories have pressurized the farmers into producing more milk.","chinese":"工厂对农民施加压力，要他们生产更多的牛奶。"},{"english":"The Pureland Wheel mantra sheet can be offered on the altar or burned to grant blessings.","chinese":"此净土咒轮可以供在佛桌上或焚化以施加持。"},{"english":"He tells us how to cross the barriers that we impose on our lives.","chinese":"他告诉我们如何跨越我们自己施加于生命的障碍。"},{"english":"The elastic nature of the condom also adds pressure to the mix.","chinese":"套套的弹性还可以在这些碎布上施加压力。"},{"english":"Compliances is the deflection resulting from the application of force.","chinese":"弹性运动性是对因外力的施加产生挠曲运动的研究。"},{"english":"Don’t give into pressure.","chinese":"不要施加压力，不要受制于人。"}],"related":[{"definition":["to counteract\/to cancel out\/to offset"],"pinyin":["di3 xiao1"],"word":"抵消"},{"definition":["to pressure"],"pinyin":["shi1 ya1"],"word":"施压"},{"definition":["to oppress\/to repress\/to constrict\/oppression\/stress (physics)"],"pinyin":["ya1 po4"],"word":"压迫"},{"definition":["to fire\/to discharge\/to release (fireworks, smokescreen, poison gas, virus etc)"],"pinyin":["shi1 fang4"],"word":"施放"},{"definition":["external force\/pressure from outside"],"pinyin":["wai4 li4"],"word":"外力"},{"definition":["to restrict\/to limit to\/to constrain\/restriction\/constraint"],"pinyin":["yue1 shu4"],"word":"约束"},{"definition":["buffer\/to cushion\/to adjust to sharp changes"],"pinyin":["huan3 chong1"],"word":"缓冲"},{"definition":["to weaken\/to impair\/to cripple"],"pinyin":["xue1 ruo4"],"word":"削弱"},{"definition":["to release\/to set free\/to liberate (a prisoner)\/to discharge"],"pinyin":["shi4 fang4"],"word":"释放"},{"definition":["to remove\/to sack\/to get rid of\/to relieve (sb of their duties)\/to free\/to lift (an embargo)\/to rescind (an agreement)"],"pinyin":["jie3 chu2"],"word":"解除"},{"definition":["high pressure\/bearing a heavy weight"],"pinyin":["zhong4 ya1"],"word":"重压"},{"definition":["effort\/active force\/applied force"],"pinyin":["zuo4 yong4 li4"],"word":"作用力"},{"definition":["to bear\/to support\/to inherit"],"pinyin":["cheng2 shou4"],"word":"承受"},{"definition":["pressure"],"pinyin":["ya1 li4"],"word":"压力"},{"definition":["to impose\/to force upon"],"pinyin":["qiang2 jia1"],"word":"强加"},{"definition":["to bind\/to restrict\/to tie\/to commit\/fetters"],"pinyin":["shu4 fu4"],"word":"束缚"}]}