{"definition":["to put in place\/to put into practice\/to take effect"],"pinyin":["shi1 xing2"],"traditional":["施行"],"rank":6265.0,"normalized_rank":0.08765547829250206,"fraction":0.00001732915006240683,"cumulative_fraction":0.8847508173069463,"word":"施行","characters":[{"definition":["surname Shi","to grant\/to give\/to bestow\/to act\/to carry out"],"pinyin":["Shi1","shi1"],"word":"施"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"}],"containing_words":[],"sentences":[{"english":"Chapter three is the problems in carrying out the two institutions.","chinese":"第三章为两种制度在施行中存在的问题。"},{"english":"One of the heads of the beast seemed to have had a fatal wound, but the fatal wound had been healed.","chinese":"它在头一个兽面前，施行头一个兽所有的权柄。"},{"english":"Conscience warns us as a friend before it punishes us as a judge.","chinese":"良心如同法曹施行惩罚之前，已如良友一般先行提醒。"},{"english":"When the aura of birth or plan to dismantle suture cesarean section.","chinese":"当出现了临产先兆或计划施行剖宫产时再拆除缝线。"},{"english":"Malaysia hascomfirmedconfirmed it plans to install Chinese-style controls on the internet.","chinese":"马来西亚证实其计划施行中国风格的网络控制。"},{"english":"Political corruption, questions and so on famine relief measures difficult line.","chinese":"政治腐败，致使荒政难以施行等问题。"},{"english":"The doctor is doing a minor surgery on Mr. Wang's mouth.","chinese":"医生正在给王先生的口部施行小手术。"},{"english":"I that speak in righteousness, mighty to save.","chinese":"就是我，是凭公义说话，以大能施行拯救。"},{"english":"Promotion and package should be planned as part of the hotel's annual marketing plan.","chinese":"酒店年度的市场销售计划中应包括促销价的施行计划。"},{"english":"Dominion and fear are with him, he maketh peace in his high places.","chinese":"神有治理之权，威严可畏，他在高天之处施行和平。"},{"english":"The implementation of the system of the Dala chieftain is also typically discussed.","chinese":"并以此为典型反映土司制度在羌族地区的施行状况。"},{"english":"Certain media have suggested the implementation of a property declaration system.","chinese":"某些媒体已经建议施行一个财产申报体系。"},{"english":"The LORD executeth righteousness and judgment for all that are oppressed.","chinese":"耶和华施行公义，为一切受屈的人伸冤。"},{"english":"To evaluate the feasibility of applying choledochofiberoscope in less-invasive operation for biliary diseases.","chinese":"目的探讨应用纤维胆道镜施行低创胆道手术的可行性。"},{"english":"Surgery in a Chemically Protected Environment.","chinese":"在防化环境下施行外科手术。"},{"english":"Similarly, I will not give to a woman a pessary to cause abortion.","chinese":"尤其不施行给妇女堕胎的手术。"}],"related":[{"definition":["to issue\/to proclaim\/to enact (laws, decrees etc)"],"pinyin":["ban1 bu4"],"word":"颁布"},{"definition":["to implement\/to carry out"],"pinyin":["shi2 shi1"],"word":"实施"},{"definition":["regulations\/rules\/code of conduct\/ordinances\/statutes"],"pinyin":["tiao2 li4"],"word":"条例"},{"definition":["to try out\/to test"],"pinyin":["shi4 xing2"],"word":"试行"},{"definition":["to repeal (a law)\/to put an end to\/abolition\/annulled"],"pinyin":["fei4 zhi3"],"word":"废止"},{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"实行"},{"definition":["to put into effect\/to carry out"],"pinyin":["tui1 xing2"],"word":"推行"},{"definition":["to revise"],"pinyin":["xiu1 ding4"],"word":"修订"},{"definition":["to officially launch (a policy, program etc)\/to appear on stage\/to appear publicly\/(of a bar girl) to leave with a client"],"pinyin":["chu1 tai2"],"word":"出台"},{"definition":["decree\/ordinance"],"pinyin":["fa3 ling4"],"word":"法令"},{"definition":["to abolish\/to abrogate\/to repeal"],"pinyin":["fei4 chu2"],"word":"废除"},{"definition":["system (e.g. political, adminstrative etc)\/institution\/CL:個|个[ge4]"],"pinyin":["zhi4 du4"],"word":"制度"},{"definition":["detailed rules and regulations\/bylaws"],"pinyin":["xi4 ze2"],"word":"细则"},{"definition":["to draw up\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制定"},{"definition":["new policy\/New Deal (Roosevelt's 1933 policy to deal with the Great Depression)"],"pinyin":["xin1 zheng4"],"word":"新政"},{"definition":["provision\/to fix\/to set\/to formulate\/to stipulate\/to provide\/regulation\/rule\/CL:個|个[ge4]"],"pinyin":["gui1 ding4"],"word":"规定"}]}