{"definition":["lit. to win a victory on raising the flag (idiom); fig. to start on sth and have immediate success\/success in a single move"],"pinyin":["qi2 kai1 de2 sheng4"],"traditional":["旗開得勝"],"rank":40971.0,"normalized_rank":0.5732374463083961,"fraction":3.494704387074656e-7,"cumulative_fraction":0.99684530830717,"word":"旗开得胜","characters":[{"definition":["flag\/variant of 旗[qi2]","banner\/flag\/(in Qing times) Manchu (cf. 八旗[Ba1 qi2])\/administrative subdivision in inner Mongolia equivalent to 縣|县[xian4] county\/CL:面[mian4]"],"pinyin":["qi2","qi2"],"word":"旗"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"开"},{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["victory\/success\/to beat\/to defeat\/to surpass\/victorious\/superior to\/to get the better of\/better than\/surpassing\/superb (of vista)\/beautiful (scenery)\/wonderful (view)\/(Taiwan pr. [sheng1]) able to bear\/equal to (a task)"],"pinyin":["sheng4"],"word":"胜"}],"containing_words":[],"sentences":[{"english":"Our army won victory in the first battle.","chinese":"这个战役，我军旗开得胜。"},{"english":"Congratulations on your success in the National College Entrance Examination.","chinese":"祝贺您今年高考旗开得胜，金榜题名。"},{"english":"Yeah you're right we're both totally striking out.","chinese":"耶，你是对的，我们旗开得胜了。"},{"english":"One time, I took on the whole class and won.","chinese":"有一次，我代表全班出战，并且旗开得胜。"},{"english":"\"Well, \" he said, \"I had a great trip. \"","chinese":"“你知道吗？”他说，“我这一趟旗开得胜。”"},{"english":"Congratulations on your success in the national college entrance examination. I beg you to take this little gift as a souvenir.","chinese":"恭贺高考旗开得胜，奉上礼物以作纪念。"},{"english":"Ultimately, he says, his law will prevail.","chinese":"最后，他说道他的法案会旗开得胜的。"},{"english":"Hoover’s indecisiveness handed his successor a triumph at the very start of his presidency.","chinese":"胡佛的优柔寡断让他的继任得以在履新伊始旗开得胜。"},{"english":"My degree enabled me to hit the ground running as soon as I graduated.","chinese":"我的学位让我一毕业就旗开得胜。"}],"related":[{"definition":["to win instant success (idiom)"],"pinyin":["ma3 dao4 cheng2 gong1"],"word":"马到成功"},{"definition":["to congratulate beforehand\/to offer best wishes for"],"pinyin":["yu4 zhu4"],"word":"预祝"},{"definition":["to win top marks in the imperial examinations"],"pinyin":["jin1 bang3 ti2 ming2"],"word":"金榜题名"},{"definition":["to win\/to be victorious\/to report a victory"],"pinyin":["gao4 jie2"],"word":"告捷"},{"definition":["victory reports pour in (idiom); news of success in an endless stream"],"pinyin":["jie2 bao4 pin2 chuan2"],"word":"捷报频传"},{"definition":["to seize total victory (idiom); an overwhelming victory\/to win by a landslide (in election)"],"pinyin":["da4 huo4 quan2 sheng4"],"word":"大获全胜"},{"definition":["lit. plucking a branch of osmanthus from the Toad Palace (i.e. the moon)\/fig. to succeed in the imperial examination"],"pinyin":["chan2 gong1 zhe2 gui4"],"word":"蟾宫折桂"},{"definition":["to triumph over an opponent"],"pinyin":["de2 sheng4"],"word":"得胜"},{"definition":["surname Zhu","to wish\/to express good wishes\/to pray\/(old) wizard"],"pinyin":["Zhu4","zhu4"],"word":"祝"},{"definition":["to return in triumph\/to return victorious"],"pinyin":["kai3 xuan2"],"word":"凯旋"},{"definition":["brimming with confidence (idiom)"],"pinyin":["xin4 xin1 bai3 bei4"],"word":"信心百倍"},{"definition":["the fabled roc flies ten thousand miles (idiom)\/one's future prospects are brilliant"],"pinyin":["peng2 cheng2 wan4 li3"],"word":"鹏程万里"},{"definition":["to continue the struggle (idiom); to persist\/unremitting efforts"],"pinyin":["zai4 jie1 zai4 li4"],"word":"再接再厉"},{"definition":["to have a pleasant journey (idiom)"],"pinyin":["yi1 lu4 shun4 feng1"],"word":"一路顺风"},{"definition":["to have one's wishes come true\/wish you the best!"],"pinyin":["xin1 xiang3 shi4 cheng2"],"word":"心想事成"},{"definition":["report of success\/report of a victory"],"pinyin":["jie2 bao4"],"word":"捷报"}]}