{"definition":["to have no opportunity\/no way (of doing sth)\/no chance\/no connection\/not placed (in a competition)\/(in pop lyrics) no chance of love, no place to be together etc"],"pinyin":["wu2 yuan2"],"traditional":["無緣"],"rank":6426.0,"normalized_rank":0.08990807717599653,"fraction":0.000016756041899346884,"cumulative_fraction":0.8874973756999858,"word":"无缘","characters":[{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"无"},{"definition":["cause\/reason\/karma\/fate\/predestined affinity\/margin\/hem\/edge\/along"],"pinyin":["yuan2"],"word":"缘"}],"containing_words":[{"definition":["no cause, no reason (idiom); completely uncalled for"],"pinyin":["wu2 yuan2 wu2 gu4"],"word":"无缘无故"}],"sentences":[{"english":"It could be just a memory that floats into your head for no reason.","chinese":"它可以只是一些无缘由的飘过脑海中的记忆罢了。"},{"english":"The cake maker shakes a naked snake with the qusimilarg rake without sake.","chinese":"蛋糕制造者无缘无故地用寒战的耙子摆一条赤裸的蛇。"},{"english":"April and Corinnehad been gone from home for some time, so I had no way of knowing what they looked like.","chinese":"阿普里尔和科琳已离家多时，我无缘一睹她们的芳容。"},{"english":"Eto 'o's goal just Pobai but missed the first accident.","chinese":"刚刚进球破百的埃托奥却意外无缘首发。"},{"english":"This can cause tests to fail gratuitously.","chinese":"这会导致测试无缘无故地失败。"},{"english":"The cake dor shakes a naked snake dawn the quaking rake lacking sake.","chinese":"蛋糕制造者无缘无故地用抖动的耙子摇一条赤的蛇。"},{"english":"She sometimes angers with little or no provocation.","chinese":"她有时无缘无故就生气。"},{"english":"I think starvation takes priority over hotwheels and barbies.","chinese":"我觉得饥饿使穷人无缘接触到赛车和芭比娃娃。"},{"english":"My report of resignation was fall into abeyance without sake.","chinese":"我的辞职报告无缘无故被搁置了。"},{"english":"The desensitisation of young men to gratuitously violent sexual acts is happening.","chinese":"年轻人正对无缘由的性暴力行为脱敏。"},{"english":"Africa will not reach the semifinals this time.","chinese":"非洲国家这次终与半决赛无缘。"},{"english":"The west will not thrive in this “new normal” economy.","chinese":"在这种“新常态”经济下，西方将与繁荣无缘。"},{"english":"It has the power to bring a state of causeless love and limitless joy.","chinese":"它有这个力量带来无缘由的爱与无限喜悦的状态。"},{"english":"Books were beyond her interest--knowledge a sealed book.","chinese":"她对书本不感兴趣，书本知识和她无缘。"},{"english":"See Wang Wenfang paintings, and classical people draw near miss.","chinese":"看王文芳的画，和古文人画近乎无缘。"},{"english":"Ray did not live to see the summer of year 2000, he passed away that spring at the age of fourteen.","chinese":"暐颂在他十四岁时去世，无缘见到公元二千年的夏天。"}],"related":[{"definition":["(sports) top eight\/quarterfinals"],"pinyin":["ba1 qiang2"],"word":"八强"},{"definition":["to fail to be chosen (or elected)\/to lose an election"],"pinyin":["luo4 xuan3"],"word":"落选"},{"definition":["the top four"],"pinyin":["si4 qiang2"],"word":"四强"},{"definition":["no match for\/cannot beat"],"pinyin":["bu4 di2"],"word":"不敌"},{"definition":["to lose to (sb)\/to be outdone by"],"pinyin":["shu1 gei3"],"word":"输给"},{"definition":["to miss narrowly\/to let a great opportunity slip"],"pinyin":["shi1 zhi1 jiao1 bi4"],"word":"失之交臂"},{"definition":["to suffer a defeat\/to fail\/to fall behind"],"pinyin":["luo4 bai4"],"word":"落败"},{"definition":["to halt\/to stop\/to go no farther"],"pinyin":["zhi3 bu4"],"word":"止步"},{"definition":["to lose\/to suffer defeat"],"pinyin":["shi1 li4"],"word":"失利"},{"definition":["(literary) to be routed (in a war)\/to suffer defeat (in sports etc)"],"pinyin":["bai4 bei3"],"word":"败北"},{"definition":["(sports) to go out of bounds\/to go over the line\/to qualify for the next round of competition\/(Tw) (fig.) to make the grade\/to achieve success"],"pinyin":["chu1 xian4"],"word":"出线"},{"definition":["absence\/absent"],"pinyin":["que1 xi2"],"word":"缺席"},{"definition":["semifinals"],"pinyin":["ban4 jue2 sai4"],"word":"半决赛"},{"definition":["second place (in a sports contest)\/runner-up"],"pinyin":["ya4 jun1"],"word":"亚军"},{"definition":["to advance in rank\/promotion\/advancement"],"pinyin":["jin4 ji2"],"word":"晋级"},{"definition":["to compete\/competition\/match\/to surpass\/better than\/superior to\/to excel"],"pinyin":["sai4"],"word":"赛"}]}