{"definition":["already fixed\/set\/established"],"pinyin":["ji4 ding4"],"traditional":["既定"],"rank":11329.0,"normalized_rank":0.1585074083919802,"fraction":0.000006732050217991726,"cumulative_fraction":0.9396161266315072,"word":"既定","characters":[{"definition":["already\/since\/both... (and...)"],"pinyin":["ji4"],"word":"既"},{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"}],"containing_words":[],"sentences":[{"english":"You may be accountable to complete projects to deadline and under budget.","chinese":"你可能要负责在期限之内以既定的预算完成各项任务。"},{"english":"Maintain Health Club facilities accding to set stards of der cleanliness.","chinese":"按照既定次序和清洁标准来维护健身俱乐部设施。"},{"english":"To retrofit an established mold would be almost impossible.","chinese":"加装一个既定的模具就几乎是不可能的。"},{"english":"Some defined set of criteria determines where a router sends the message.","chinese":"某些既定的标准决定路由器将把信息发送到哪里。"},{"english":"Is there a defined strategy for the sunset of legacy applications or functions?","chinese":"是否存在针对遗留应用程序或功能子集的既定策略？"},{"english":"This is a consistent guideline of Albania and will never change.","chinese":"这是阿的既定方针，不会改变。"},{"english":"Don’t just be a follower who adapts his or her self to the conditions that already exist.","chinese":"不要只做一个跟风者去适应业已既定的环境。"},{"english":"Do you worry about implementation of this declared policy?","chinese":"你担心这项既定政策的实施吗？"},{"english":"They laid the sails aback so as to stay on course in the storm wind.","chinese":"他们使帆成为逆风向以便在暴风中保持既定航道。"},{"english":"The Austrian took more than two hours to get up to the jump altitude.","chinese":"鲍姆加特纳花费了两个多小时才升到既定高度。"},{"english":"Railway ballast will be loaded onto ballast trains at an established ballast siding.","chinese":"铁路道碴，将载入碴列车在一个既定的镇流器偏袒。"},{"english":"His knee locked towards the end of training and he could not complete the session.","chinese":"他的膝伤使他没有能够完成既定的训练科目。"},{"english":"They laid the sails aback to stay on course in that wind.","chinese":"他们在吹这种风的情况下，换成逆帆来保持既定航线。"},{"english":"We will cut the buck and insist on advancing along our set goal.","chinese":"我们将不负重望，坚持不移按着既定目标，走下去。"},{"english":"As such, I delete questions that do not fall within the set guidelines of this thread.","chinese":"因此，我删除问题，不属于该线程的既定方针。"},{"english":"This recorded the voltage that each model made over a period of time.","chinese":"这个仪器记录每一个模型在既定时间段产生的电压。"}],"related":[{"definition":["to follow the prescribed order; to keep to the working routine (idiom)"],"pinyin":["an4 bu4 jiu4 ban1"],"word":"按部就班"},{"definition":["to presuppose\/to predispose\/to preset\/presupposition\/predisposition\/default (value etc)"],"pinyin":["yu4 she4"],"word":"预设"},{"definition":["to comply with\/to follow (directives)\/to defer (to the judgment of superiors)"],"pinyin":["zun1 cong2"],"word":"遵从"},{"definition":["intrinsic to sth\/inherent\/native"],"pinyin":["gu4 you3"],"word":"固有"},{"definition":["according to\/in accordance with\/in the light of\/on the basis of"],"pinyin":["an4 zhao4"],"word":"按照"},{"definition":["in accordance with\/to follow (the rules)"],"pinyin":["zun1 zhao4"],"word":"遵照"},{"definition":["to deviate\/to diverge\/to wander"],"pinyin":["pian1 li2"],"word":"偏离"},{"definition":["to draw up\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制定"},{"definition":["originally planned\/originally determined"],"pinyin":["yuan2 ding4"],"word":"原定"},{"definition":["nothing much changes (idiom); always the same\/stuck in a rut"],"pinyin":["yi1 cheng2 bu4 bian4"],"word":"一成不变"},{"definition":["to set\/to set up\/to install\/setting\/preferences"],"pinyin":["she4 ding4"],"word":"设定"},{"definition":["to follow the compass and go with the set square (idiom); to follow the rules inflexibly\/to act according to convention"],"pinyin":["xun2 gui1 dao3 ju3"],"word":"循规蹈矩"},{"definition":["to follow\/to abide by\/to comply with\/compliance"],"pinyin":["zun1 xun2"],"word":"遵循"},{"definition":["fixed framework (idiom); restriction of social conventions and taboos (usually derogatory)\/regulations and restrictions"],"pinyin":["tiao2 tiao2 kuang4 kuang4"],"word":"条条框框"},{"definition":["usual\/customary"],"pinyin":["guan4 chang2"],"word":"惯常"},{"definition":["gait\/marching order\/step\/pace"],"pinyin":["bu4 diao4"],"word":"步调"}]}