{"definition":["to have as its purpose\/to be intended to\/to aim to (do sth)"],"pinyin":["zhi3 zai4"],"traditional":["旨在"],"rank":4372.0,"normalized_rank":0.06116995228967584,"fraction":0.000029405879132694482,"cumulative_fraction":0.8422896099821354,"word":"旨在","characters":[{"definition":["imperial decree\/purport\/aim\/purpose"],"pinyin":["zhi3"],"word":"旨"},{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"}],"containing_words":[],"sentences":[{"english":"They are currently in the process of piloting two programs aimed at getting families outdoors.","chinese":"他们最近还在实施另两个旨在让家庭走向户外的项目。"},{"english":"The aim of this thesis is to compare and study the differences of phatic language between English and Chinese.","chinese":"本论文旨在对比研究应酬语在英汉语中的区别。"},{"english":"The book aims at the social problem caused by drug-taking.","chinese":"这本书旨在讨论吸毒引起的社会问题。"},{"english":"The idea of an edit box, of course, is to allow users to type something in.","chinese":"编辑框旨在允许用户键入某些内容。"},{"english":"The site isdesigned to provide consumers with practical information on healthful eating.","chinese":"该网站旨在为消费者提供有关健康饮食的实用信息。"},{"english":"The Zebrafish DVD Exchange Project is aimed at by-passing these limitations.","chinese":"斑马鱼DVD交换计划旨在绕过这些限制。"},{"english":"This study aims on the spectral features and sensitive spectrum wave band in the apple florescence .","chinese":"旨在探索苹果花期的光谱特征和敏感波段。"},{"english":"This is to exercise your eye muscles and increase their flexibility.","chinese":"这种方法旨在锻炼眼肌，增强其灵活性。"},{"english":"Obedience is the aim of supporting parents. No why and no reason to speak of.","chinese":"养亲旨在顺意，不问为什么，也不能讲什么大道理。"},{"english":"This study was aimed to establish a mouse bioassay for ciguatoxin detection.","chinese":"旨在建立西加毒素小鼠生物学检测法。"},{"english":"1To define the requirements and procedures of surface resistivity test.","chinese":"本文旨在定义表面电阻测量的要求和步骤。"},{"english":"This dissertation is to develop a late-model sewer system named vacuum sewer system.","chinese":"本文旨在开发一套新型真空下水道系统。"},{"english":"Are there any policies that are intended to improve the life of the poor?","chinese":"有什么旨在改善穷人生活的政策吗？"},{"english":"The VME bus data collecting system is studied in the paper.","chinese":"本论文旨在研究VME总线数据采集系统。"},{"english":"It also aims to reduce risk and improve visibility into business operations.","chinese":"它还旨在降低风险和提高对业务操作的可见性。"},{"english":"Alternately, new international agreements will surface that attempt curb leaking and punish leakers.","chinese":"旨在控制泄密和惩罚泄密者的新国际协议也会出现。"}],"related":[{"definition":["to work for\/to devote one's efforts to"],"pinyin":["zhi4 li4"],"word":"致力"},{"definition":["in order to\/hoping to\/attempting to\/waiting for"],"pinyin":["yi3 qi1"],"word":"以期"},{"definition":["objective\/aim\/goal"],"pinyin":["zong1 zhi3"],"word":"宗旨"},{"definition":["to try hard to\/to strive to"],"pinyin":["li4 tu2"],"word":"力图"},{"definition":["with this\/thereby\/thus\/because of this"],"pinyin":["yi3 ci3"],"word":"以此"},{"definition":["to advocate\/to initiate\/to propose\/to be a proponent of (an idea or school of thought)"],"pinyin":["chang4 dao3"],"word":"倡导"},{"definition":["to launch\/to develop\/to unfold\/(of an exhibition etc) to open"],"pinyin":["kai1 zhan3"],"word":"开展"},{"definition":["common\/joint\/jointly\/together\/collaborative"],"pinyin":["gong4 tong2"],"word":"共同"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推动"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通过"},{"definition":["to combine\/to join\/unite\/alliance"],"pinyin":["lian2 he2"],"word":"联合"},{"definition":["many-sided\/versatile\/various aspects\/all-round\/multidirectional"],"pinyin":["duo1 fang1 wei4"],"word":"多方位"},{"definition":["because of\/on the basis of\/in view of\/on account of"],"pinyin":["ji1 yu2"],"word":"基于"},{"definition":["to suggest\/to initiate\/proposal\/initiative"],"pinyin":["chang4 yi4"],"word":"倡议"},{"definition":["to promote (an idea or cause)\/to advance\/boost"],"pinyin":["cu4 jin4"],"word":"促进"},{"definition":["to make every effort to\/striving to do one's best"],"pinyin":["li4 qiu2"],"word":"力求"}]}