{"definition":["lit. repair the plank road by day while secretly crossing the Wei River 渭河[Wei4 He2] at Chencang (idiom, refers to a stratagem used by Liu Bang 劉邦|刘邦[Liu2 Bang1] in 206 BC against Xiang Yu 項羽|项羽[Xiang4 Yu3] of Chu)\/fig. to feign one thing while doing another\/to cheat under cover of a diversion"],"pinyin":["ming2 xiu1 zhan4 dao4 , an4 du4 Chen2 cang1"],"traditional":["明修棧道，暗渡陳倉"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"明修栈道，暗渡陈仓","characters":[{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"},{"definition":["dried meat\/private teacher's remuneration\/withered\/variant of 修[xiu1]","surname Xiu","to decorate\/to embellish\/to repair\/to build\/to write\/to cultivate\/to study\/to take (a class)"],"pinyin":["xiu1","Xiu1","xiu1"],"word":"修"},{"definition":["a wooden or bamboo pen for sheep or cattle\/wood or bamboo trestlework\/a warehouse"],"pinyin":["zhan4"],"word":"栈"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"},{"word":"，"},{"definition":["variant of 暗[an4]","to close (a door)\/to eclipse\/muddled\/stupid\/ignorant\/variant of 暗[an4]","dark\/gloomy\/hidden\/secret\/muddled\/obscure\/in the dark"],"pinyin":["an4","an4","an4"],"word":"暗"},{"definition":["to cross\/to pass through\/to ferry"],"pinyin":["du4"],"word":"渡"},{"definition":["surname Chen\/Chen (c. 1045 - 479 BC), a Zhou dynasty state\/Chen (557-589), one of the Southern Dynasties 南朝[Nan2 Chao2]","to lay out\/to exhibit\/to display\/to narrate\/to state\/to explain\/to tell\/old\/stale"],"pinyin":["Chen2","chen2"],"word":"陈"},{"definition":["barn\/granary\/storehouse\/cabin\/hold (in ship)"],"pinyin":["cang1"],"word":"仓"}],"containing_words":[],"sentences":[],"related":[]}