{"definition":["evident\/clear\/undoubted"],"pinyin":["ming2 bai3 zhe5"],"traditional":["明擺著"],"rank":27050.0,"normalized_rank":0.3784645950218964,"fraction":0.0000012321971483415695,"cumulative_fraction":0.987061016706381,"word":"明摆着","characters":[{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"},{"definition":["to arrange\/to exhibit\/to move to and fro\/a pendulum"],"pinyin":["bai3"],"word":"摆"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"}],"containing_words":[],"sentences":[{"english":"And so that clearly is a significant enough incentive for people to seek out those kinds of opportunities.","chinese":"驱使人们寻找此类机会的动机也是明摆着的。"},{"english":"Clearly a rifle is the weapon of cowards.","chinese":"明摆着，来复枪是怂人的武器。"},{"english":"I retorted, showing a decided purple witness to refute her.","chinese":"我回嘴，指着我明摆着的紫斑作为见证来驳倒她。"},{"english":"By Monday morning, it was clear we were bankrupt.","chinese":"直到周一早晨，明摆着的，我们破产了。"},{"english":"In retrospect, the causes of today's woes seem obvious.","chinese":"回想起来，造成如今痛苦处境的理由明摆着。"},{"english":"Obviously we need to put those guys back to work; they need to have man-hours out there.","chinese":"我们明摆着要让这些人重新工作，他们需要有工作量。"},{"english":"It is an obvious fact.","chinese":"这是明摆着的事实。"},{"english":"Given Reed's track record, why does anyone take him seriously?","chinese":"里德的记录明摆着，为什么还是有人信以为真呢？"}],"related":[]}