{"definition":["to appear\/to come out in the open"],"pinyin":["xian3 lu4 chu1"],"traditional":["顯露出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"显露出","characters":[{"definition":["to make visible\/to reveal\/prominent\/conspicuous\/(prefix) phanero-"],"pinyin":["xian3"],"word":"显"},{"definition":["to show\/to reveal\/to betray\/to expose","dew\/syrup\/nectar\/outdoors (not under cover)\/to show\/to reveal\/to betray\/to expose","surname Lu"],"pinyin":["lou4","lu4","Lu4"],"word":"露"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"Diazinon and chlorpyrifos, too, were eventually revealed to be hazardous.","chinese":"二嗪农和毒死蜱也逐渐显露出危险性。"},{"english":"I could not show fear.","chinese":"我不能把恐惧显露出来。"},{"english":"Even as a child he showed an unusual aptitude for mathematics.","chinese":"甚至孩童时他就显露出非统一般的数学才能。"},{"english":"This tax inspector was demonstrating one of the most common of human frailties .","chinese":"这位稽查员，显露出一种最常见到的人性的弱点。"},{"english":"Only when doing things alone can he show his paces.","chinese":"只有单干的时候他才能显露出自己的真本事。"},{"english":"Stay calm and avoid the appearance of hostility or personal rejection.","chinese":"保持沉著和避免显露出敌视或个人的鄙弃。"},{"english":"His silence threw out his real intention.","chinese":"他的沉默显露出了他的真实意图。"},{"english":"For those who are saved and washed by His blood, faith will become sight.","chinese":"对这些得救且用宝血洗过的人，信仰会显露出来。"},{"english":"He says that he hasn't ever shown his paces.","chinese":"他说他从来没有显露出自己的真本事。"},{"english":"He keeps back the streams from flowing, and makes the secret things come out into the light.","chinese":"他封闭水不得滴流，使隐藏的物显露出来。"},{"english":"The clouds that comprise the Southern Equatorial Belt were gone when Jupiter emerged from its hiding place behind the sun last month.","chinese":"上个月在木星从太阳背后隐藏处显露出来的时候。"},{"english":"She was beginning to show a little edge, but she obviously still could drive.","chinese":"她开始显露出几分醉意了，但很明显她还能开车。"},{"english":"He paused and suddenly all the frailty and fatigue showed.","chinese":"他顿住了，虚弱与疲惫一下子显露出来。"},{"english":"Roads had appeared again and gradually I saw that there was a town.","chinese":"公路再次显露出来，小城的轮廓渐渐明晰。"},{"english":"Daylight disclosed a chain of lakes and rivers in the distance.","chinese":"晨曦中显露出远处一连串的江河湖泊。"},{"english":"He bindeth the floods from overflowing; and the thing that is hid bringeth he forth to light.","chinese":"他封闭水不得滴流，使隐藏的物显露出来。"}],"related":[{"definition":["to become visible\/to reveal"],"pinyin":["xian3 lu4"],"word":"显露"},{"definition":["to express\/to exhibit"],"pinyin":["xian3 chu1"],"word":"显出"},{"definition":["to expose\/to reveal"],"pinyin":["zhan3 lu4"],"word":"展露"},{"definition":["to reveal (indirectly, implicitly)\/to show (interest, contempt etc) by means of one's actions, tone of voice etc"],"pinyin":["liu2 lu4"],"word":"流露"},{"definition":["appearance\/to appear"],"pinyin":["xian3 xian4"],"word":"显现"},{"definition":["glimpse (of something hidden)"],"pinyin":["yin3 xian4"],"word":"隐现"},{"definition":["to take off (one's clothes)\/(fig.) to shed (one's former image etc)\/(of a fad or the after-effects of a disaster etc) to subside\/also pr. [tun4 qu4]"],"pinyin":["tui4 qu4"],"word":"褪去"},{"definition":["completely\/fully\/without omission"],"pinyin":["wu2 yi2"],"word":"无遗"},{"definition":["to expose\/to show\/also pr. [lou4 chu1]"],"pinyin":["lu4 chu1"],"word":"露出"},{"definition":["to show in full light\/to be revealed in its entirety"],"pinyin":["biao3 lu4 wu2 yi2"],"word":"表露无遗"},{"definition":["hidden\/covered\/concealed"],"pinyin":["yan3 cang2"],"word":"掩藏"},{"definition":["to cover\/to mask\/to cover up or conceal (the truth etc)"],"pinyin":["zhe1 yan3"],"word":"遮掩"},{"definition":["to obliterate completely\/to vanish from the face of the earth"],"pinyin":["dang4 ran2 wu2 cun2"],"word":"荡然无存"},{"definition":["to come to prominence\/to appear clearly\/to stick out"],"pinyin":["tu1 xian4"],"word":"凸现"},{"definition":["to lay bare\/to come to light"],"pinyin":["bao4 lu4 wu2 yi2"],"word":"暴露无遗"},{"definition":["to show\/to reveal (one's feelings etc)"],"pinyin":["biao3 lu4"],"word":"表露"}]}