{"definition":["lit. a wise person reflecting a thousand times can still make a mistake (idiom); fig. nobody is infallible"],"pinyin":["zhi4 zhe3 qian1 lu:4 , bi4 you3 yi1 shi1"],"traditional":["智者千慮，必有一失"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"智者千虑，必有一失","characters":[{"definition":["wisdom\/knowledge"],"pinyin":["zhi4"],"word":"智"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"},{"definition":["see 鞦韆|秋千[qiu1 qian1]","thousand"],"pinyin":["qian1","qian1"],"word":"千"},{"definition":["to think over\/to consider\/anxiety"],"pinyin":["lu:4"],"word":"虑"},{"word":"，"},{"definition":["certainly\/must\/will\/necessarily"],"pinyin":["bi4"],"word":"必"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to lose\/to miss\/to fail"],"pinyin":["shi1"],"word":"失"}],"containing_words":[],"sentences":[],"related":[{"definition":["even the wisest can have a momentary lapse in judgment (idiom)\/every man has a fool in his sleeve"],"pinyin":["cong1 ming5 yi1 shi4 , hu2 tu5 yi1 shi2"],"word":"聪明一世，糊涂一时"},{"definition":["planning is with man, accomplishing with heaven (idiom); Man proposes but God disposes."],"pinyin":["mou2 shi4 zai4 ren2 , cheng2 shi4 zai4 tian1"],"word":"谋事在人，成事在天"},{"definition":["a clever person may become the victim of his own ingenuity (idiom); cleverness may overreach itself\/too smart for one's own good"],"pinyin":["cong1 ming2 fan3 bei4 cong1 ming2 wu4"],"word":"聪明反被聪明误"},{"definition":["there can never be too much deception in war\/in war nothing is too deceitful\/all's fair in war"],"pinyin":["bing1 bu4 yan4 zha4"],"word":"兵不厌诈"},{"definition":["lit. easy to dodge the spear in the open, hard to avoid a stab in the dark (idiom); it is hard to guard against secret conspiracies"],"pinyin":["ming2 qiang1 yi4 duo3 , an4 jian4 nan2 fang2"],"word":"明枪易躲，暗箭难防"},{"definition":["How do you catch the tiger cub without entering the tiger's lair? (idiom); Nothing ventured, nothing gained."],"pinyin":["bu4 ru4 hu3 xue2 , yan1 de2 hu3 zi3"],"word":"不入虎穴，焉得虎子"},{"definition":["God's plans supersede our own\/Man proposes but God disposes"],"pinyin":["ren2 suan4 bu4 ru2 tian1 suan4"],"word":"人算不如天算"},{"definition":["lit. a crafty rabbit has three burrows\/a sly individual has more than one plan to fall back on (idiom)"],"pinyin":["jiao3 tu4 san1 ku1"],"word":"狡兔三窟"},{"definition":["lit. an arrogant army is bound to lose (idiom)\/fig. pride goes before a fall"],"pinyin":["jiao1 bing1 bi4 bai4"],"word":"骄兵必败"},{"definition":["to prophesy with supernatural accuracy (idiom)\/to have an incredible foresight"],"pinyin":["liao4 shi4 ru2 shen2"],"word":"料事如神"},{"definition":["to lose at sunrise but gain at sunset (idiom)\/to compensate later for one's earlier loss\/what you lose on the swings you gain on the roundabouts"],"pinyin":["shi1 zhi1 dong1 yu2 , shou1 zhi1 sang1 yu2"],"word":"失之东隅，收之桑榆"},{"definition":["the mantis stalks the cicada, unaware of the oriole behind (idiom, from Daoist classic Zhuangzi 莊子|庄子); to pursue a narrow gain while neglecting a greater danger"],"pinyin":["tang2 lang2 bu3 chan2 , huang2 que4 zai4 hou4"],"word":"螳螂捕蝉，黄雀在后"},{"definition":["the old man lost his mare, but it all turned out for the best (idiom); fig. a blessing in disguise\/it's an ill wind that blows nobody any good"],"pinyin":["sai4 weng1 shi1 ma3 yan1 zhi1 fei1 fu2"],"word":"塞翁失马焉知非福"},{"definition":["lit. the birds are over, the bow is put away (idiom); fig. to get rid of sb once he has served his purpose"],"pinyin":["niao3 jin4 gong1 cang2"],"word":"鸟尽弓藏"},{"definition":["lit. for some things a foot may be too short, and for the other an inch will suffice (proverb)\/fig. everyone has their strong and weak points\/everything has its advantages and disadvantages"],"pinyin":["chi3 you3 suo3 duan3 , cun4 you3 suo3 chang2"],"word":"尺有所短，寸有所长"},{"definition":["an outsider can see things more clearly or objectively than those involved (idiom)"],"pinyin":["dang1 ju2 zhe3 mi2 , pang2 guan1 zhe3 qing1"],"word":"当局者迷，旁观者清"}]}