{"definition":["to have or have not\/surplus and shortfall\/tangible and intangible\/corporeal and incorporeal"],"pinyin":["you3 wu2"],"traditional":["有無"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"有无","characters":[{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"无"}],"containing_words":[{"definition":["mutual exchange of assistance (idiom)\/to benefit from each other's strengths and make up each other's shortfalls\/to reciprocate with material assistance\/scratch each other's back"],"pinyin":["hu4 tong1 you3 wu2"],"word":"互通有无"},{"definition":["mutual exchange of assistance (idiom)\/to reciprocate with material assistance"],"pinyin":["you3 wu2 xiang1 tong1"],"word":"有无相通"}],"sentences":[{"english":"This would be a valid passing opportunity regardless of whether there was pre-existing overlap.","chinese":"这时后车有权超越，无论有无预先存在“重叠”。"},{"english":"Second only to God on their flagships , admirals are unreceptive to orders from anyone.","chinese":"海军司令在旗舰上有无上权威，不听任何人命令。"},{"english":"You will have to re-submit your Request List but the ticket availability may have changed in the new round.","chinese":"重新提交时，门票的有无情况可能会有所变化。"},{"english":"Whether the cementless prosthesis has collar or not has no influence on the stem's initial stability.","chinese":"非骨水泥假体有无肩托对初始稳定性影响不大。"},{"english":"Check for junk inside shoe joint.","chinese":"检查浮鞋内有无落物。"},{"english":"Frontogenesis and frontolysis have decisive effect on the precipitation near Meiyu front.","chinese":"锋生锋消对于梅雨锋附近有无降水起到了重要的作用。"},{"english":"Object The aim of the study was to reveal any personality deviation of female sexual offender.","chinese":"目的了解女性性罪错者有无人格偏移。"},{"english":"It is a debatable issue in academic circles whether the Han nationality had epic in its early stage of history.","chinese":"学术界在汉民族有无史诗的问题上一直聚讼纷纭。"},{"english":"Its normal reaction depends on the existence of blastocysts in the uteri.","chinese":"对子宫里有无胚泡存在的反应也显然不同。"},{"english":"This evening clutch has an allure of timelessness.","chinese":"传动器今晚有无时间限制魅力。"},{"english":"If the air fan rotates stably and if anything is abnormal.","chinese":"所有风机转动是否平稳，有无异常。"},{"english":"Objective To explore mental health state of patients with blepharospasm and hemifacial spasm.","chinese":"目的探讨睑肌及面肌痉挛病人有无异常心理健康状态。"},{"english":"Measuring the levels of urinary catecholamine can monitor the recurrence or metastasis of the tumor.","chinese":"术后监测尿儿茶酚胺含量，可以了解有无转移或复发。"},{"english":"Loss rate of the system with or without implementing multi-sided control are compared.","chinese":"数值验证不同情况下，有无实施多边控制效果的对比。"},{"english":"The coating morphology of T10 after glow discharge is compared with that without glow discharge.","chinese":"对T10钢渗层组织进行了有无辉光放电作用的对比。"},{"english":"Damp area should be checked more hang a picture to have because rustily or what decayed falls is dangerous, do not have.","chinese":"潮湿的地区应多检查挂画有无因锈蚀或朽落的危险。"}],"related":[{"definition":["to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)","number\/figure\/several\/CL:個|个[ge4]","frequently\/repeatedly"],"pinyin":["shu3","shu4","shuo4"],"word":"数"},{"definition":["whether (or not)\/if\/is or isn't"],"pinyin":["shi4 fou3"],"word":"是否"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"无"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["(before a noun) Do (you, they etc) have ...?\/Is there a ...?\/(before a verb) Did (you, they etc) (verb, infinitive)?\/Have (you, they etc) (verb, past participle)?"],"pinyin":["you3 mei2 you3"],"word":"有没有"},{"definition":["numerous types\/many kinds"],"pinyin":["shu4 zhong3"],"word":"数种"},{"definition":["exceptional\/abnormal\/an anomaly"],"pinyin":["yi4 chang2"],"word":"异常"},{"definition":["whether or not (at the end of a phrase)"],"pinyin":["yu3 fou3"],"word":"与否"},{"definition":["necessary\/essential\/indispensable\/required"],"pinyin":["bi4 yao4"],"word":"必要"},{"definition":["to look at\/to regard\/to inspect","old variant of 視|视[shi4]","variant of 視|视[shi4]\/variant of 示[shi4]"],"pinyin":["shi4","shi4","shi4"],"word":"视"},{"definition":["not to be present\/to be out\/(euphemism) to pass away\/to be deceased"],"pinyin":["bu4 zai4"],"word":"不在"},{"definition":["to observe\/to watch\/to survey\/to examine\/observation\/view\/perspective\/CL:個|个[ge4]"],"pinyin":["guan1 cha2"],"word":"观察"},{"definition":["to exist\/to be\/existence"],"pinyin":["cun2 zai4"],"word":"存在"},{"definition":["each and every\/every\/all\/any"],"pinyin":["fan2 shi4"],"word":"凡是"},{"definition":["to confirm\/to verify\/confirmation"],"pinyin":["que4 ren4"],"word":"确认"},{"definition":["to agree (to do sth)\/should\/ought to\/must\/(legal) shall","surname Ying","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["ying1","Ying4","ying4"],"word":"应"}]}