{"definition":["capable"],"pinyin":["you3 cai2 gan4"],"traditional":["有才幹"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"有才干","characters":[{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["ability\/talent\/sb of a certain type\/a capable individual\/only\/only then\/just now","a moment ago\/just now\/(indicating sth happening later than expected)\/(preceded by a clause of condition or reason) not until\/(followed by a numerical clause) only"],"pinyin":["cai2","cai2"],"word":"才"},{"definition":["dry\/clean\/in vain\/dried food\/foster\/adoptive\/to ignore","variant of 乾|干[gan1]","old variant of 乾|干[gan1]","to concern\/to interfere\/shield\/stem","surname Gan","tree trunk\/main part of sth\/to manage\/to work\/to do\/capable\/cadre\/to kill (slang)\/to fuck (vulgar)"],"pinyin":["gan1","gan1","gan1","gan1","Gan1","gan4"],"word":"干"}],"containing_words":[],"sentences":[{"english":"Many Japanese regarded him as the ablest Chinese strategist alive.","chinese":"许多日本人都认为他是中国现有的最有才干的战略家。"},{"english":"In old society many talented young people were too often ploughed under.","chinese":"在旧社会许多有才干的青年常被埋没。"},{"english":"She is the ablest girl I've ever met.","chinese":"她是我见到过的最有才干的姑娘。"},{"english":"Many optimists I know are quick to point out that others have talents superior to theirs.","chinese":"我认识的许多乐观主义者会很快指出其他人更有才干。"},{"english":"The most brilliant leadership can be mired in detail.","chinese":"最有才干的领导也会陷于拘泥琐事的困境中。"},{"english":"Her talents are well known.","chinese":"人人都知道她很有才干。"},{"english":"He was a very competent lawyer.","chinese":"他是一位很有才干的法学家。"},{"english":"Their attitude was that a guy with talent could climb any mountain .","chinese":"他们的想法是，一个有才干的人，什么山都能爬上去。"},{"english":"The Chinese nation has brought forth a lot of competent national heroes and revolutionary leaders.","chinese":"中华民族孕育了许多有才干的民族英雄和革命领袖。"},{"english":"He is the ablest man I know.","chinese":"他是我所认识的最有才干的人。"},{"english":"The great wealth of Clavius's family easily attracted the highest caliber of warriors.","chinese":"克莱文思家的巨额财富能轻易吸引到最有才干的战士。"}],"related":[]}