{"definition":["rich person\/the rich"],"pinyin":["you3 qian2 ren2"],"traditional":["有錢人"],"rank":13800.0,"normalized_rank":0.1930799042995257,"fraction":0.000004800766214608363,"cumulative_fraction":0.9536935910427764,"word":"有钱人","characters":[{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["surname Qian","coin\/money\/CL:筆|笔[bi3]\/unit of weight, one tenth of a tael 兩|两[liang3]"],"pinyin":["Qian2","qian2"],"word":"钱"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"}],"containing_words":[],"sentences":[{"english":"We didn't like him, as he always fawned on the rich.","chinese":"我们不喜欢他，因为他老是巴结有钱人。"},{"english":"Filthy rich people are not not necessarily good-respected unless you possess noble characters.","chinese":"有钱人未必受人尊敬，除非有高尚的品格。"},{"english":"I wish I were cout out to be a millionaire.","chinese":"真希望我以后会成为有钱人。"},{"english":"The building of this house in the shape of the temple was a rich man's vagary.","chinese":"这个建筑物的格局以有钱人的奇想为形式。"},{"english":"If rich people buy food abuse, that and no difference also fish in troubled waters.","chinese":"如果有钱人买粮食糟蹋，那和趁火打劫也没有差别。"},{"english":"She will wed her daughter to a rich man.","chinese":"她准备把女儿嫁给有钱人。"},{"english":"I don't like Toby, as he always fawns on the rich.","chinese":"我不喜欢托比，因为他老是向有钱人献殷勤。"},{"english":"Everyday, Wang Mian go out very early in the morning to feed the cattle for the toff.","chinese":"每天早上，王冕很早就出门给有钱人放牛。"},{"english":"We really should try and get her married off to a wealthy businessman.","chinese":"我们真该试试找个有钱人把她嫁出去才对。"},{"english":"He betrothed his daughter to a rich man.","chinese":"他把他的女儿许配给一个有钱人。"},{"english":"The view that all wealthy people are evil will result in hatred for wealth.","chinese":"有钱人都是黑心肠的观点，会导致仇富心理的产生。"},{"english":"To well-to-do people higer prices mean better quality.","chinese":"对这些有钱人来说，高价位意味着高品质。"},{"english":"The building of this house in the shape of the temple was a rich man's vagary.","chinese":"建设这栋寺庙形状的房子是一个有钱人的奇思妙想。"},{"english":"Rich people never buy cheap goods from vendors at the roadside.","chinese":"有钱人从来不买路边摊子上的贱物。"},{"english":"They were rich men. They were also nasty men.","chinese":"他们都是有钱人，但也都是卑鄙龌龊的家伙。"},{"english":"Wealthy men gave fancy balls to honor their valentines.","chinese":"有钱人用花球充当自己的情人节礼物。"}],"related":[]}