{"definition":["to make frequent or unpredictable changes in policy (idiom)"],"pinyin":["zhao1 ling4 xi1 gai3"],"traditional":["朝令夕改"],"rank":38715.0,"normalized_rank":0.5416730793446476,"fraction":4.3340757415307654e-7,"cumulative_fraction":0.9959637794899386,"word":"朝令夕改","characters":[{"definition":["abbr. for 朝鮮|朝鲜[Chao2 xian3] Korea","imperial or royal court\/government\/dynasty\/reign of a sovereign or emperor\/court or assembly held by a sovereign or emperor\/to make a pilgrimage to\/facing\/towards","morning"],"pinyin":["Chao2","chao2","zhao1"],"word":"朝"},{"definition":["see 令狐[Ling2 hu2]","classifier for a ream of paper","see 脊令[ji2 ling2]","to order\/to command\/an order\/warrant\/writ\/to cause\/to make sth happen\/virtuous\/honorific title\/season\/government position (old)"],"pinyin":["Ling2","ling3","ling2","ling4"],"word":"令"},{"definition":["dusk\/evening\/Taiwan pr. [xi4]"],"pinyin":["xi1"],"word":"夕"},{"definition":["to change\/to alter\/to transform\/to correct"],"pinyin":["gai3"],"word":"改"}],"containing_words":[],"sentences":[{"english":"Has the devious Beijing government been massaging the numbers, as communist planners are wont to do?","chinese":"是朝令夕改的北京政府像往常一样在修正数据吗？"},{"english":"Even longtime investors complain that the rules seem to keep shifting.","chinese":"即使长期投资者也抱怨朝令夕改。"},{"english":"Yet sometimes you are filled with cranky ideas which people find hard to follow.","chinese":"但是有时候你会朝令夕改而让人们很难适应你。"},{"english":"It cannot happen that within a week, first they decide one way and then in the exact opposite.","chinese":"一周内不应该发生两次，有点朝令夕改的味道。"},{"english":"The retirement system should be continuity and the government should avoid about-face.","chinese":"退休制度应该有其延续性，避免朝令夕改，造成不安。"}],"related":[{"definition":["outward devotion but inner opposition (idiom); to pay lip service\/to agree overtly, but oppose in secret"],"pinyin":["yang2 feng4 yin1 wei2"],"word":"阳奉阴违"},{"definition":["to act as one thinks fit\/to have one's own way"],"pinyin":["zi4 xing2 qi2 shi4"],"word":"自行其是"},{"definition":["lit. say three in the morning but four in the evening (idiom); to change sth that is already settled upon\/indecisive\/to blow hot and cold"],"pinyin":["zhao1 san1 mu4 si4"],"word":"朝三暮四"},{"definition":["(idiom) to say one thing and do another"],"pinyin":["yan2 xing2 bu4 yi1"],"word":"言行不一"},{"definition":["lit. if he orders you go, he forbids you stop (idiom); fig. to demand exact compliance with instructions\/to ensure strictly obedience"],"pinyin":["ling4 xing2 jin4 zhi3"],"word":"令行禁止"},{"definition":["government decree"],"pinyin":["zheng4 ling4"],"word":"政令"},{"definition":["old: to reap the consequences of one's words (idiom, from Mencius); modern: to go back on one's word\/to blow hot and cold\/to contradict oneself\/inconsistent"],"pinyin":["chu1 er3 fan3 er3"],"word":"出尔反尔"},{"definition":["to decide and act alone (idiom); to take arbitrary action\/a law unto oneself"],"pinyin":["du2 duan4 zhuan1 xing2"],"word":"独断专行"},{"definition":["to lack foresight"],"pinyin":["duan3 shi4"],"word":"短视"},{"definition":["not to enjoy popular support\/to be unpopular"],"pinyin":["bu4 de2 ren2 xin1"],"word":"不得人心"},{"definition":["to appoint people by favoritism (idiom); nepotism\/corrupt appointment"],"pinyin":["ren4 ren2 wei2 qin1"],"word":"任人唯亲"},{"definition":["to skimp on the job\/to work half-heartedly\/not to take the job seriously"],"pinyin":["fu1 yan3 se4 ze2"],"word":"敷衍塞责"},{"definition":["major policy of the national government"],"pinyin":["da4 zheng4 fang1 zhen1"],"word":"大政方针"},{"definition":["serve Qin in the morning Chu in the evening (idiom); quick to switch sides"],"pinyin":["zhao1 Qin2 mu4 Chu3"],"word":"朝秦暮楚"},{"definition":["to go back on one's word\/to break one's promise\/to be unfaithful\/to be untrustworthy"],"pinyin":["yan2 er2 wu2 xin4"],"word":"言而无信"},{"definition":["seeking instant benefit (idiom); shortsighted vision, looking only for fast return"],"pinyin":["ji2 gong1 jin4 li4"],"word":"急功近利"}]}