{"definition":["this text\/article\/the main body of a book"],"pinyin":["ben3 wen2"],"traditional":["本文"],"rank":9123.0,"normalized_rank":0.1276426062988821,"fraction":0.000009679484481961,"cumulative_fraction":0.9218712801684597,"word":"本文","characters":[{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"},{"definition":["language\/culture\/writing\/formal\/literary\/gentle\/(old) classifier for coins\/Kangxi radical 67","surname Wen"],"pinyin":["wen2","Wen2"],"word":"文"}],"containing_words":[],"sentences":[{"english":"The influence of electromagnetic wave on biologic respiratory process is demonstrated by an experiment.","chinese":"本文用实验证实了电磁波对生物呼吸过程的影响。"},{"english":"The first part: to discuss the main concepts and characteristics of commercial subject.","chinese":"本文第一章，主要介绍商主体的概念和特征。"},{"english":"In this paper, we propose a mathematical model of planar reflector on the Solar pond.","chinese":"本文提出了太阳池反射板的数学模型，并进行了计算。"},{"english":"The paper studied 7 case Masked civet of dystocia in farm condition.","chinese":"本文对7例在养殖条件下难产的花面狸进行了研究。"},{"english":"Post-simulation shows that the deserializer meets the design requirements.","chinese":"后仿真结果表明，本文设计的串并转换电路满足要求。"},{"english":"The geology effect of 3-D seismic exploration in HK area, Jianghan region is presented in this paper.","chinese":"本文主要介绍江汉HK地区三维地震勘探的地质效果。"},{"english":"This paper talks about related problems with campus culture construction in higher institutes .","chinese":"本文对高校校园文化建设的相关问题加以论述。"},{"english":"The dispersion influence in networks of ultrahigh -speed optical fiber communication is researched in this paper.","chinese":"本文研究了光纤通信网中的色散及其补偿方法。"},{"english":"This paper described a novel thermopile detector for infrared horizon sensors.","chinese":"本文报道了试用于红外地平仪的新型热堆传感器。"},{"english":"This paper presents a traditional Chinese medical expert consultation system named ZRK82.","chinese":"本文介绍了一个名为ZRK82的中医专家咨询系统。"},{"english":"A new type of two-branch diversity reception system is presented.","chinese":"本文提出了一种新的两支路分集接收系统。"},{"english":"This article helps you to add a chat system to your environment.","chinese":"本文帮助您向您的环境添加了一个聊天系统。"},{"english":"In this paper , the structure of macromaterialogy is discussed and the branching of technological sciences is considered.","chinese":"本文讨论宏观材料学的结构，并思考技术科学的分支。"},{"english":"Follow the approach outlined in this article to avoid this pitfall.","chinese":"通过遵循本文给出的方法可以避免这个失误。"},{"english":"Analysis of harmonic response of unconstrained damped plate based on randomness of viscoelastic damping layer;","chinese":"本文用谐波增量平衡法分析纵横向耦合梁的谐波响应。"},{"english":"The block decoupling problem for linear time-invariant systems is discussed.","chinese":"本文讨论线性时不变系统的块解耦问题。"}],"related":[{"definition":["to forward (a shipment)\/to reprint sth published elsewhere\/Taiwan pr. [zhuan3 zai4]"],"pinyin":["zhuan3 zai3"],"word":"转载"},{"definition":["author\/writer\/CL:個|个[ge4]"],"pinyin":["zuo4 zhe3"],"word":"作者"},{"definition":["originality\/creativity\/innovation"],"pinyin":["yuan2 chuang4"],"word":"原创"},{"definition":["disclaimer"],"pinyin":["mian3 ze2 sheng1 ming2"],"word":"免责声明"},{"definition":["copyright"],"pinyin":["ban3 quan2"],"word":"版权"},{"definition":["source (of information etc)\/origin"],"pinyin":["lai2 yuan2"],"word":"来源"},{"definition":["image\/picture\/photograph\/CL:張|张[zhang1]"],"pinyin":["tu2 pian4"],"word":"图片"},{"definition":["to edit\/to compile\/editor\/compiler"],"pinyin":["bian1 ji2"],"word":"编辑"},{"definition":["to infringe the rights of\/to violate\/infringement"],"pinyin":["qin1 quan2"],"word":"侵权"},{"definition":["piece of writing submitted for publication\/manuscript\/article"],"pinyin":["gao3 jian4"],"word":"稿件"},{"definition":["to inject\/to pour into\/to concentrate\/to pay attention\/stake (gambling)\/classifier for sums of money\/variant of 註|注[zhu4]","to register\/to annotate\/note\/comment"],"pinyin":["zhu4","zhu4"],"word":"注"},{"definition":["to translate and edit\/translator-editor\/(computing) to compile (source code)"],"pinyin":["bian1 yi4"],"word":"编译"},{"definition":["article\/essay\/literary works\/writings\/hidden meaning\/CL:篇[pian1],段[duan4],頁|页[ye4]"],"pinyin":["wen2 zhang1"],"word":"文章"},{"definition":["only for"],"pinyin":["jin3 gong1"],"word":"仅供"},{"definition":["exclusive"],"pinyin":["du2 jia1"],"word":"独家"},{"definition":["editor\/compiler"],"pinyin":["bian1 zhe3"],"word":"编者"}]}