{"definition":["the current period\/this term (usually in finance)"],"pinyin":["ben3 qi1"],"traditional":["本期"],"rank":3750.0,"normalized_rank":0.05246736529878416,"fraction":0.00003609676365991114,"cumulative_fraction":0.82199130170326,"word":"本期","characters":[{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"},{"definition":["variant of 期[qi1]\/period\/cycle","a period of time\/phase\/stage\/classifier for issues of a periodical, courses of study\/time\/term\/period\/to hope\/Taiwan pr. [qi2]"],"pinyin":["qi1","qi1"],"word":"期"}],"containing_words":[],"sentences":[{"english":"Thank you for joining us.","chinese":"感谢您收看本期节目。"},{"english":"The feature in this section seems to set up a round-table conversation.","chinese":"本期的“注目”专题，更像是试图搭建一次圆桌对话。"},{"english":"It should be noted that all the articles published in this issue are contributed by the DTTTIG, to which we owe our acknowledgement.","chinese":"本期所刊论文均由大唐集团提供，在此特表谢意。"},{"english":"The programme looks at useful phrases for structuring answers in a job interview.","chinese":"答案在本期节目文字稿的最后一页。"},{"english":"In today's program, celebrity, Yang Lan talks about rainforest protection with Kathy Yin.","chinese":"在本期节目中，杨澜与尹畅面对面，倾谈雨林保护。"},{"english":"In this volume, Ajiao looks for a job over the summer to pay for her student loans.","chinese":"本期轻喜剧，阿娇要趁暑假当家教赚钱还助学贷款。"},{"english":"Here are some entertainments that enable to you have a good time at home.","chinese":"本期我们就来推荐一些在家也能很开心的娱乐项目。"},{"english":"Talents are required in HUEYA Energy for this Job Advertisement.","chinese":"本期招聘，仅包括华扬能源和华扬电信两个业务板块。"},{"english":"This episode is called \"Giving Warnings and Cautions.\"","chinese":"本期节目题目是“警诫。”"},{"english":"A letter from a reader in the feedback section of this issue noted how he likes to print out parts of the digital PC World.","chinese":"在本期杂志中，有读者来信反馈称想打印某些内容。"},{"english":"The special double-issue of People hits news stands on Friday.","chinese":"《人物》杂志本期特刊将于本周五上架。"},{"english":"From this period case, this print will introduce these setting an example in succession door successful example.","chinese":"从本期起，本刊将陆续介绍这些示范户的成功事例。"},{"english":"At this time, Erlitou Culture displayed a trend of decline and fall.","chinese":"二里头文化势力在本期呈现的是一种衰亡趋势。"},{"english":"Next the net income of this period is added to the beginning retained earnings.","chinese":"接下来是把本期的净收益与期初留存收益相加。"},{"english":"An expense may have been incurred in the current accounting period even though no bill has yet been received.","chinese":"本期即使没有收到账单，费用也有可能已经发生。"},{"english":"The magazines are shown with the date of issue and the name of the article.","chinese":"所列出的期刊都注有发行日期和本期上的文章的题目。"}],"related":[{"definition":["to edit\/to compile\/editor\/compiler"],"pinyin":["bian1 ji2"],"word":"编辑"},{"definition":["editor in charge (abbr. for 責任編輯|责任编辑[ze2 ren4 bian1 ji2])"],"pinyin":["ze2 bian1"],"word":"责编"},{"definition":["to copy-edit\/copy editor"],"pinyin":["bian1 shen3"],"word":"编审"},{"definition":["see 豎筆|竖笔[shu4 bi3]","radical in Chinese characters (Kangxi radical 2)"],"pinyin":["shu4","gun3"],"word":"丨"},{"definition":["editor in charge"],"pinyin":["ze2 ren4 bian1 ji2"],"word":"责任编辑"},{"definition":["(publishing) (abbr. for 美術編輯|美术编辑[mei3 shu4 bian1 ji2]) layout and graphics\/graphic design\/art editor\/graphic designer"],"pinyin":["mei3 bian1"],"word":"美编"},{"definition":["regular column or segment (in a publication or broadcast program)\/program (TV or radio)"],"pinyin":["lan2 mu4"],"word":"栏目"},{"definition":["source (of information etc)\/origin"],"pinyin":["lai2 yuan2"],"word":"来源"},{"definition":["this text\/article\/the main body of a book"],"pinyin":["ben3 wen2"],"word":"本文"},{"definition":["typesetting"],"pinyin":["pai2 ban3"],"word":"排版"},{"definition":["proofreader\/to proofread\/to calibrate"],"pinyin":["jiao4 dui4"],"word":"校对"},{"definition":["specially engaged\/employed or commissioned for a special task"],"pinyin":["te4 yue1"],"word":"特约"},{"definition":["special invitation"],"pinyin":["te4 yao1"],"word":"特邀"},{"definition":["to weave\/to plait\/to organize\/to group\/to arrange\/to edit\/to compile\/to write\/to compose\/to fabricate"],"pinyin":["bian1"],"word":"编"},{"definition":["to listen to (a radio broadcast)"],"pinyin":["shou1 ting1"],"word":"收听"},{"definition":["to supervise the manufacture of\/to supervise the shooting of films\/executive producer (film)"],"pinyin":["jian1 zhi4"],"word":"监制"}]}