{"definition":["weight (i.e. importance attached to sth)"],"pinyin":["quan2 zhong4"],"traditional":["權重"],"rank":7463.0,"normalized_rank":0.10441705259328696,"fraction":0.000013355639059225035,"cumulative_fraction":0.9030100825040376,"word":"权重","characters":[{"definition":["surname Quan","authority\/power\/right\/(literary) to weigh\/expedient\/temporary"],"pinyin":["Quan2","quan2"],"word":"权"},{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["zhong4","chong2"],"word":"重"}],"containing_words":[],"sentences":[{"english":"A weight in percentage represents the degree of similarity.","chinese":"百分比形式的权重代表的是相似度。"},{"english":"Bismarck was enormously powerful in his 26 years as Prussia's political leader.","chinese":"在担任普鲁士政治领袖的26年间，俾斯麦位高权重。"},{"english":"The blending weights can be painted per-vertex and are normalized automatically.","chinese":"权重的混合，可画每个顶点，并自动归。"},{"english":"Also disturbute a weighting factor among 5 projects.","chinese":"而每一个项目都要算出其权重值。"},{"english":"Selection of weighting and use of a complex regression equation should be justified.","chinese":"权重选择和使用复杂的回归方程应合理。"},{"english":"You need other ways to estimate the weight of such use cases.","chinese":"您需要其他的方式来估算这种用例的权重。"},{"english":"Weight of index is made by AHP and Delphi.","chinese":"指标权重的确定采用了特尔斐法和层次分析法。"},{"english":"Then use the following subroutine to load the field weights into memory.","chinese":"然后使用以下子例程将字段权重装入内存。"},{"english":"The address is its location in the weight array.","chinese":"地址是它在权重数组中的位置。"},{"english":"You can then update relative weights to each policy by simply moving the sliders.","chinese":"要更新每个策略的相对权重，只需移动滑块。"},{"english":"And then, we put forward the dispatch-based weight algorithm.","chinese":"在设计过程中提出了基于调度经验的权重算法。"},{"english":"Oscillation heavyweights also fell, dragged down part of the index.","chinese":"权重股也振荡回落，部分拖累了指数。"},{"english":"An index in which greater weight is given to shares that have a larger market capitalization.","chinese":"指市场总值较高的股票占较大权重的指数。"},{"english":"The spectral characteristics of pure reagent are displayed by the plot of weight of the principal component vs wave-length.","chinese":"在主成分权重图上体现了纯试剂的光谱特征。"},{"english":"Statistical analysis for continuous data was done by weighted mean difference or standardised mean difference.","chinese":"连续数据以权重平均差或标准化平均差作统计分析。"},{"english":"The weight of sentence is calculated based on a multi-feature method.","chinese":"基于这些特征使用了多特征的句子权重计算方法。"}],"related":[{"definition":["blue chip stock"],"pinyin":["lan2 chou2 gu3"],"word":"蓝筹股"},{"definition":["(numerical, statistical) index\/(math.) exponent\/index\/exponential (function, growth)"],"pinyin":["zhi3 shu4"],"word":"指数"},{"definition":["gilt-edged securities"],"pinyin":["bai2 ma3 gu3"],"word":"白马股"},{"definition":["stock market index\/share price index\/abbr. for 股票指數|股票指数[gu3 piao4 zhi3 shu4]"],"pinyin":["gu3 zhi3"],"word":"股指"},{"definition":["Shanghai Stock Exchange (SSE), abbr. for 上海證券交易所|上海证券交易所[Shang4 hai3 Zheng4 quan4 Jiao1 yi4 suo3]"],"pinyin":["Shang4 Zheng4"],"word":"上证"},{"definition":["(Tw) to pull sth up\/(fig.) to give a boost to\/to support"],"pinyin":["la1 tai2"],"word":"拉抬"},{"definition":["slab\/(geology) tectonic plate\/(fig.) sector (of the stock market or of industry)\/(economic) bloc"],"pinyin":["ban3 kuai4"],"word":"板块"},{"definition":["(math.) to weight\/weighting\/weighted (average, index etc)"],"pinyin":["jia1 quan2"],"word":"加权"},{"definition":["(of sales, prices etc) to fall\/to drop\/decline\/slump"],"pinyin":["xia4 cuo4"],"word":"下挫"},{"definition":["(of a stock price or market index) currently higher than at the previous day's close"],"pinyin":["hong2 pan2"],"word":"红盘"},{"definition":["to split apart\/differentiation"],"pinyin":["fen1 hua4"],"word":"分化"},{"definition":["tendency\/trend\/path"],"pinyin":["zou3 shi4"],"word":"走势"},{"definition":["vulnerable\/weak"],"pinyin":["ruo4 shi4"],"word":"弱势"},{"definition":["large fall"],"pinyin":["da4 die1"],"word":"大跌"},{"definition":["to shake up\/to jolt\/to vibrate\/to oscillate\/to fluctuate","to vibrate\/to shake\/to shudder"],"pinyin":["zhen4 dang4","zhen4 dang4"],"word":"震荡"},{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"word":"反弹"}]}