{"definition":["eucommia (a kind of rubber tree)"],"pinyin":["du4 zhong4"],"traditional":["杜仲"],"rank":44833.0,"normalized_rank":0.6272718369174374,"fraction":2.429067710982551e-7,"cumulative_fraction":0.9979795956335769,"word":"杜仲","characters":[{"definition":["surname Du","birchleaf pear (tree)\/to stop\/to prevent\/to restrict"],"pinyin":["Du4","du4"],"word":"杜"},{"definition":["second month of a season\/middle\/intermediate\/second amongst brothers","surname Zhong"],"pinyin":["zhong4","Zhong4"],"word":"仲"}],"containing_words":[],"sentences":[{"english":"The procedure of DuzhongCola was determined on the basis of results of single factor experiments.","chinese":"研究了利用杜仲叶生产杜仲可乐的工艺。"},{"english":"The procedure of DuzhongCola was determined on the basis of results of single factor experiments.","chinese":"研究了利用杜仲叶生产杜仲可乐的工艺。"},{"english":"Genetic Parameter Estimation and Analysis on Improvement Effect of High-Yielding Guttapercha Clones Associate with Eucommia ulmoides Oliv.","chinese":"杜仲高产胶无性系遗传参数估计与改良效果分析。"},{"english":"Then, the material obtained after removing cellulose was utilized to extract guttapercha.","chinese":"脱除纤维素后的杜仲材料用石油醚为溶剂提取杜仲胶。"},{"english":"Then, the material obtained after removing cellulose was utilized to extract guttapercha.","chinese":"脱除纤维素后的杜仲材料用石油醚为溶剂提取杜仲胶。"},{"english":"The Difference and Its Pertinence Analysis of the Guttapercha Content in Organs of Eucommia ulmoides Oliv.","chinese":"杜仲不同器官含胶率的差异及其相关性分析。"},{"english":"The eucommia leaves are processed for later use.","chinese":"加工好的杜仲叶备用。"},{"english":"Objective:Overview the development of modern preparation of Eucommia ulmoides Oliver.","chinese":"目的对杜仲现代炮制的研究进展作一综述。"},{"english":"The sedative and hypnotic effects of ethyl acetate extracts of eucommia male flowers were studied.","chinese":"研究杜仲雄花乙酸乙酯提取物的抗惊厥作用。"},{"english":"Conclusion Scrape the coarsed cortex is necessary of Eucommia ulmodies processing in planting.","chinese":"结论杜仲在原产地加工中“去粗皮”是必要的。"},{"english":"Pinoresinol diglucoside (PDG) has been known as the most important component contributing to descending blood pressure in Eucommia ulmoides Oliver.","chinese":"松脂醇二葡萄糖苷是杜仲中主要的降血压成分。"},{"english":"This paper investigated effects of lowering blood pressure and acute toxicity of Viscum coloratum (Kom. ) Nakai and Eucommia ulmoides Oliv.","chinese":"研究了槲寄生和杜仲的降血压作用和急性毒性。"},{"english":"Objective To observe the extraction and purification of chlorogenic acid from leaves of Eucommia ulmoides.","chinese":"对杜仲叶绿原酸的提取进行研究。"},{"english":"The extraction of eucommia seed oil was studied using eucommia seeds as raw material and supercritical CO2 as solvent.","chinese":"以杜仲籽为原料，超临界CO2为溶剂萃取杜仲籽油。"},{"english":"The extraction of eucommia seed oil was studied using eucommia seeds as raw material and supercritical CO2 as solvent.","chinese":"以杜仲籽为原料，超临界CO2为溶剂萃取杜仲籽油。"},{"english":"An HPLC method for the quantitative determination of chlorogenic acid in Eucommia leaf was investigated.","chinese":"采用高效液相色谱法测定杜仲叶中绿原酸的含量。"}],"related":[{"definition":["Epimedium, genus of herbaceous flowering plant, cultivated in the Far East as aphrodisiac\/also called barrenwort or horny goatweed (said to resemble crushed goat's testicles)"],"pinyin":["yin2 yang2 huo4"],"word":"淫羊藿"},{"definition":["King Solomon's seal (plant of genus Polygonatum)"],"pinyin":["huang2 jing1"],"word":"黄精"},{"definition":["dodder (Cuscuta sinensis, a parasitic vine with seeds used in medicine)"],"pinyin":["tu4 si1 zi3"],"word":"菟丝子"},{"definition":["Angelica sinensis"],"pinyin":["dang1 gui1"],"word":"当归"},{"definition":["schizandra (Schisandra chinensis)\/Magnolia vine"],"pinyin":["wu3 wei4 zi3"],"word":"五味子"},{"definition":["huangqi\/milk vetch root (used in TCM)\/Astragalus membranaceus or Astragalus mongholicus"],"pinyin":["huang2 qi2"],"word":"黄芪"},{"definition":["golden eye-grass (Curculigo orchioides)\/Curculigo rhizome (used in TCM)"],"pinyin":["xian1 mao2"],"word":"仙茅"},{"definition":["Achyranthes bidentata (root used in Chinese medicine)"],"pinyin":["niu2 xi1"],"word":"牛膝"},{"definition":["Salvia miltiorrhiza"],"pinyin":["dan1 shen1"],"word":"丹参"},{"definition":["chuanxiong rhizome"],"pinyin":["chuan1 xiong1"],"word":"川芎"},{"definition":["Wolfiporia extensa (a wood-decay fungus)\/fu ling\/tuckahoe"],"pinyin":["fu2 ling2"],"word":"茯苓"},{"definition":["Gastrodia elata (botany)"],"pinyin":["tian1 ma2"],"word":"天麻"},{"definition":["the rhizome of large-headed atractylodes (Atractylodes macrocephaia)"],"pinyin":["bai2 zhu2"],"word":"白术"},{"definition":["root of herbaceous peony (Paeonia lactiflora), used in TCM"],"pinyin":["bai2 shao2"],"word":"白芍"},{"definition":["Ningpo figwort (Scrophularia ningpoensis)\/root of Ningpo figwort (used in TCM)"],"pinyin":["xuan2 shen1"],"word":"玄参"},{"definition":["tuber of the kudzu vine (Pueraria lobata), used in Chinese medicine"],"pinyin":["ge2 gen1"],"word":"葛根"}]}