{"definition":["lit. to have one's hands bound and be unable to do anything about it (idiom); fig. helpless in the face of a crisis"],"pinyin":["shu4 shou3 wu2 ce4"],"traditional":["束手無策"],"rank":19919.0,"normalized_rank":0.2786926531697284,"fraction":0.0000024159297245649768,"cumulative_fraction":0.9746433624357042,"word":"束手无策","characters":[{"definition":["surname Shu","to bind\/bunch\/bundle\/classifier for bunches, bundles, beams of light etc\/to control"],"pinyin":["Shu4","shu4"],"word":"束"},{"definition":["hand\/(formal) to hold\/person engaged in certain types of work\/person skilled in certain types of work\/personal(ly)\/convenient\/classifier for skill\/CL:雙|双[shuang1],隻|只[zhi1]"],"pinyin":["shou3"],"word":"手"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"无"},{"definition":["surname Ce","variant of 策[ce4]","policy\/plan\/scheme\/bamboo slip for writing (old)\/to whip (a horse)\/to encourage\/riding crop with sharp spines (old)\/essay written for the imperial examinations (old)\/upward horizontal stroke in calligraphy","variant of 策[ce4]"],"pinyin":["Ce4","ce4","ce4","ce4"],"word":"策"}],"containing_words":[],"sentences":[{"english":"To face the reality, we often do nothing, the flag to surrender.","chinese":"面对现实，我们常常束手无策，举旗投降。"},{"english":"Modern Western medicine has had little impact in staying the disease's deadly hand.","chinese":"现代西医技术对这种疾病的死亡之手基本束手无策。"},{"english":"But then the White House staff is several steps removed from a negotiating process.","chinese":"但白宫官员随后却在谈判过程中感到了一些束手无策。"},{"english":"Q. Berdych was having some problem with your slice and change of speed.","chinese":"贝尔蒂奇对你的削球和速度变化束手无策。"},{"english":"Tne new code baffled the enemy agents.","chinese":"这套新密码使敌特机关束手无策。"},{"english":"He lives only by his pen and could do nothing when running into a problem.","chinese":"他光会耍笔杆，碰到实际问题就束手无策。"},{"english":"The new code baffled the enemy agents.","chinese":"这套新密码使敌特机关束手无策。"},{"english":"And anti-pollution measures and regulations are falling far short of getting to grips with it.","chinese":"而反污染措施及规章则鞭长莫及，束手无策。"},{"english":"And if the keypad is metal, fuhgeddaboudit.","chinese":"如果是金属键盘，那就束手无策了。"},{"english":"His family members were at a loss, gathering around his bed and crying.","chinese":"子来的家人围在床的四周束手无策，大家哭成一团。"},{"english":"We don't have to feel stuck anywhere.","chinese":"我们不会在任何地方感到束手无策。"},{"english":"Like a new dog owner who's unsure what to do about her puppy barking all night.","chinese":"新主人因为狗狗整夜叫个不停而束手无策。"},{"english":"and they do not know how to fix the tire.","chinese":"而车上的人对此束手无策。"},{"english":"But many small and middle starch factories have no idea of washing the screening surface.","chinese":"但多数中小型淀粉厂对筛面的清洗束手无策。"}],"related":[{"definition":["no strategy left to try (idiom); at one's wit's end\/at the end of one's tether\/powerless"],"pinyin":["wu2 ji4 ke3 shi1"],"word":"无计可施"},{"definition":["to be unable to find a solution\/to be at wits' end"],"pinyin":["yi1 chou2 mo4 zhan3"],"word":"一筹莫展"},{"definition":["impotent (idiom)\/powerless\/helpless"],"pinyin":["wu2 neng2 wei2 li4"],"word":"无能为力"},{"definition":["at a loss to know what to do (idiom); bewildered"],"pinyin":["shou3 zu2 wu2 cuo4"],"word":"手足无措"},{"definition":["deeply worried and sick at heart (idiom)"],"pinyin":["you1 xin1 chong1 chong1"],"word":"忧心忡忡"},{"definition":["have no way out\/have no alternative\/abbr. to 無奈|无奈[wu2 nai4]"],"pinyin":["wu2 ke3 nai4 he2"],"word":"无可奈何"},{"definition":["out of one's wits (idiom)\/distracted\/stunned"],"pinyin":["liu4 shen2 wu2 zhu3"],"word":"六神无主"},{"definition":["unable to turn around a hopeless situation (idiom)\/to fail to save the situation"],"pinyin":["hui2 tian1 fa2 shu4"],"word":"回天乏术"},{"definition":["to no avail\/of no use"],"pinyin":["wu2 ji4 yu2 shi4"],"word":"无济于事"},{"definition":["to worry helplessly"],"pinyin":["gan1 zhao2 ji2"],"word":"干着急"},{"definition":["see 百思不解[bai3 si1 bu4 jie3]"],"pinyin":["bai3 si1 bu4 de2 qi2 jie3"],"word":"百思不得其解"},{"definition":["in imminent peril (idiom)\/on the brink of crisis"],"pinyin":["wei1 zai4 dan4 xi1"],"word":"危在旦夕"},{"definition":["lit. to turn to any doctor one can find when critically ill (idiom); fig. to try anyone or anything in a crisis"],"pinyin":["bing4 ji2 luan4 tou2 yi1"],"word":"病急乱投医"},{"definition":["not knowing what to do (idiom); at one's wits' end\/embarrassed and at a complete loss"],"pinyin":["bu4 zhi1 suo3 cuo4"],"word":"不知所措"},{"definition":["no room to advance or to retreat (idiom); without any way out of a dilemma\/trapped\/in an impossible situation"],"pinyin":["jin4 tui4 liang3 nan2"],"word":"进退两难"},{"definition":["anxious\/panicky"],"pinyin":["huang2 kong3 bu4 an1"],"word":"惶恐不安"}]}