{"definition":["all roads lead to Rome\/use different means to obtain the same result (idiom)"],"pinyin":["tiao2 tiao2 da4 lu4 tong1 Luo2 ma3"],"traditional":["條條大路通羅馬"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"条条大路通罗马","characters":[{"definition":["strip\/item\/article\/clause (of law or treaty)\/classifier for long thin things (ribbon, river, road, trousers etc)"],"pinyin":["tiao2"],"word":"条"},{"definition":["strip\/item\/article\/clause (of law or treaty)\/classifier for long thin things (ribbon, river, road, trousers etc)"],"pinyin":["tiao2"],"word":"条"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["surname Lu","road\/CL:條|条[tiao2]\/journey\/route\/line (bus etc)\/sort\/kind"],"pinyin":["Lu4","lu4"],"word":"路"},{"definition":["to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc","classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)"],"pinyin":["tong1","tong4"],"word":"通"},{"definition":["gauze\/to collect\/to gather\/to catch\/to sift","surname Luo"],"pinyin":["luo2","Luo2"],"word":"罗"},{"definition":["horse\/CL:匹[pi3]\/horse or cavalry piece in Chinese chess\/knight in Western chess","surname Ma\/abbr. for Malaysia 馬來西亞|马来西亚[Ma3 lai2 xi1 ya4]"],"pinyin":["ma3","Ma3"],"word":"马"}],"containing_words":[],"sentences":[{"english":"You should not give up though you failed the exam. All roads lead to Rome.","chinese":"即使你考试失败，也不要气馁，条条大路通罗马。"},{"english":"They say all roads lead to Rome.","chinese":"都说“条条大路通罗马”。"},{"english":"Or, simply said, \"All roads lead to Rome\", the world is one dollar.","chinese":"或者简单说，“条条大路通罗马”，世界是一元的。"},{"english":"Just as a popular saying goes all roads lead to Rome.","chinese":"成语“条条大路通罗马”，就是这个意思。"},{"english":"Let bygones be bygones. Snap out of it, all roads lead to Rome.","chinese":"过去的就让他过去吧，别再想了，条条大路通罗马。"},{"english":"We have the enough reason to believe that all roads lead to Rome.","chinese":"我们有足够的理由相信条条大路通罗马。"}],"related":[{"definition":["shortcut"],"pinyin":["jie2 jing4"],"word":"捷径"},{"definition":["(lit.) the road through Yangguan 陽關|阳关[Yang2 guan1]\/(fig.) wide open road\/bright future"],"pinyin":["Yang2 guan1 Da4 dao4"],"word":"阳关大道"},{"definition":["lit. in every trade, a master appears (idiom); fig. You can produce outstanding achievements in any task, provided you put it enough love and diligence"],"pinyin":["hang2 hang2 chu1 zhuang4 yuan2"],"word":"行行出状元"},{"definition":["the matter depends on the individual (idiom); it is a matter for your own effort\/With effort, one can achieve anything."],"pinyin":["shi4 zai4 ren2 wei2"],"word":"事在人为"},{"definition":["this road is blocked\/fig. This method does not work.\/Doing this is no good."],"pinyin":["ci3 lu4 bu4 tong1"],"word":"此路不通"},{"definition":["broad and open road (idiom); fig. brilliant future prospects"],"pinyin":["kang1 zhuang1 da4 dao4"],"word":"康庄大道"},{"definition":["lit. Mt Zhongnan is a shortcut to a ministerial job (idiom); fig. to take a shortcut to promotion"],"pinyin":["zhong1 nan2 jie2 jing4"],"word":"终南捷径"},{"definition":["different routes to the same destination (idiom); fig. different means of achieve the same end"],"pinyin":["shu1 tu2 tong2 gui1"],"word":"殊途同归"},{"definition":["Heaven never bars one's way (idiom); don't despair and you will find a way through.\/Never give up hope.\/Never say die."],"pinyin":["tian1 wu2 jue2 ren2 zhi1 lu4"],"word":"天无绝人之路"},{"definition":["a really determined person will find a solution (idiom); where there's a will, there's a way"],"pinyin":["you3 zhi4 zhe3 shi4 jing4 cheng2"],"word":"有志者事竟成"},{"definition":["lit. When we get to the mountain, there'll be a way through. (idiom)\/fig. Everything will turn out for the best.\/Let's worry about it when it happens.\/It will be all right on the night.\/cf couplet 車到山前必有路，船到橋頭自然直|车到山前必有路，船到桥头自然直"],"pinyin":["che1 dao4 shan1 qian2 bi4 you3 lu4"],"word":"车到山前必有路"},{"definition":["all walks of life (idiom)\/every trade"],"pinyin":["san1 bai3 liu4 shi2 hang2"],"word":"三百六十行"},{"definition":["there is nothing the determined person can't accomplish (idiom)\/persistence will overcome"],"pinyin":["shi4 shang4 wu2 nan2 shi4 , zhi3 pa4 you3 xin1 ren2"],"word":"世上无难事，只怕有心人"},{"definition":["to become rich\/enrichment"],"pinyin":["fa1 cai2 zhi4 fu4"],"word":"发财致富"},{"definition":["to stick to one's ways\/to cling to one's course"],"pinyin":["yi1 tiao2 dao4 zou3 dao4 hei1"],"word":"一条道走到黑"},{"definition":["lit. a thousand mile journey begins with the first step\/fig. big accomplishments come from an accumulation of little achievements made one by one"],"pinyin":["qian1 li3 zhi1 xing2 , shi3 yu2 zu2 xia4"],"word":"千里之行，始于足下"}]}