{"definition":["to come and go\/to have dealings with\/to be in relation with"],"pinyin":["lai2 wang3"],"traditional":["來往"],"rank":8685.0,"normalized_rank":0.12151441803198412,"fraction":0.00001045623143449334,"cumulative_fraction":0.9174531732818914,"word":"来往","characters":[{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"来"},{"definition":["old variant of 往[wang3]","to go (in a direction)\/to\/towards\/(of a train) bound for\/past\/previous"],"pinyin":["wang3","wang3"],"word":"往"}],"containing_words":[],"sentences":[{"english":"A girl in Yao minority dress warmly greeting customers.","chinese":"穿着民族服装的瑶家姑娘，热情地招呼来往市民。"},{"english":"We had been doing business with each other for years before we quarrelled.","chinese":"在吵翻之前，我们多年来在业务上一直来往。"},{"english":"We sat down on the park bench and watched the people as they passed.","chinese":"我们坐在公园的长凳上，把稳考察着来往的行人。"},{"english":"The clamour of the heavy traffic gave you a headache.","chinese":"来往车辆嘈杂的声浪使人头痛。"},{"english":"He insinuated his cat through traffic.","chinese":"他驾车慢慢地行进于来往车辆中。"},{"english":"Hanhan's neighbor, usually didn't socialize much and scholar.","chinese":"憨憨与秀才是邻居，平时来往不多。"},{"english":"No respectable citizen in town had anything to do with Mad Henry","chinese":"市镇里没有哪个正派人与其有任何来往。"},{"english":"He has learned English for only one year, yet he can communicate with people in English.","chinese":"他才教一年英文，但未能用英文与己来往了。"},{"english":"Although China and Saudi is thousands of kilometers away, the people in both countries have intercourse since long ago.","chinese":"中国和沙特虽相距数千公里，但两国人民早有来往。"},{"english":"Watch out for cars when you cross the street.","chinese":"过街时要注意来往车辆。"},{"english":"Deal with all correspondences of department.","chinese":"处理部门全部来往通信。"},{"english":"Description: Operates flights between Hong Kong and destinations in Mainland China.","chinese":"营运来往香港及中国内地航点的航班。"},{"english":"Big anniversaries come and go, but moments like this arise only rarely.","chinese":"大型年度庆典来来往往，但像这样的时刻很出现。"},{"english":"The port is crowded with ships coming and going.","chinese":"港口一片繁忙景象，来往船只风樯林立。"},{"english":"Traveling time among the three cities will be shortened to 15 to 20 minutes.","chinese":"来往三市之间的时间将缩短到15至20分钟。"},{"english":"A record of financial transactions kept in a ledger.","chinese":"在分成类帐中保存的财务来往记录。"}],"related":[{"definition":["dealings\/contacts\/to go back and forth"],"pinyin":["wang3 lai2"],"word":"往来"},{"definition":["to enter or exit\/to go through"],"pinyin":["jin4 chu1"],"word":"进出"},{"definition":["to go out and come in\/entrance and exit\/expenditure and income\/discrepancy\/inconsistent"],"pinyin":["chu1 ru4"],"word":"出入"},{"definition":["to walk around\/to move about\/to stretch one's legs\/to go for a walk\/to be mobile (e.g. after an illness)\/to visit one another\/to pay a visit (go to the toilet)"],"pinyin":["zou3 dong4"],"word":"走动"},{"definition":["to travel back and forth\/to shuttle"],"pinyin":["chuan1 suo1"],"word":"穿梭"},{"definition":["to visit frequently\/to have frequent dealings (with)\/to see each other often"],"pinyin":["chang2 lai2 chang2 wang3"],"word":"常来常往"},{"definition":["to associate (with)\/to have contact (with)\/to hang out (with)\/to date\/(interpersonal) relationship\/association\/contact"],"pinyin":["jiao1 wang3"],"word":"交往"},{"definition":["the stream flows without stopping (idiom); unending flow"],"pinyin":["chuan1 liu2 bu4 xi1"],"word":"川流不息"},{"definition":["to discuss\/to converse\/chat\/discussion"],"pinyin":["jiao1 tan2"],"word":"交谈"},{"definition":["to get in touch with\/to contact\/to stay in contact (with)\/liaison\/(math.) connection"],"pinyin":["lian2 luo4"],"word":"联络"},{"definition":["bustling with activity (idiom)"],"pinyin":["xi1 xi1 rang3 rang3"],"word":"熙熙攘攘"},{"definition":["intersection (symbol ∩) (set theory)"],"pinyin":["jiao1 ji2"],"word":"交集"},{"definition":["close\/familiar\/intimate\/closely (related)\/to foster close ties\/to pay close attention"],"pinyin":["mi4 qie4"],"word":"密切"},{"definition":["to go back and forth\/to go to and fro\/round trip"],"pinyin":["wang3 fan3"],"word":"往返"},{"definition":["to be well acquainted with\/to know well"],"pinyin":["shu2 shi5"],"word":"熟识"},{"definition":["lit. to meet those arriving, to send of those departing (idiom); busy entertaining guests\/all time taken over with social niceties"],"pinyin":["ying2 lai2 song4 wang3"],"word":"迎来送往"}]}