{"definition":["rifle (loanword)\/also written 來福槍|来福枪"],"pinyin":["lai2 fu4 qiang1"],"traditional":["來復槍"],"rank":47010.0,"normalized_rank":0.6577308913855582,"fraction":1.9517208711440328e-7,"cumulative_fraction":0.9984546503327152,"word":"来复枪","characters":[{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"来"},{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out","to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4","fu4","fu4"],"word":"复"},{"definition":["gun\/firearm\/rifle\/spear\/thing with shape or function similar to a gun\/CL:支[zhi1],把[ba3],桿|杆[gan3],條|条[tiao2],枝[zhi1]\/to substitute for another person in a test\/to knock\/classifier for rifle shots","surname Qiang","variant of 槍|枪[qiang1]\/rifle\/spear"],"pinyin":["qiang1","Qiang1","qiang1"],"word":"枪"}],"containing_words":[],"sentences":[{"english":"Sharks cruised toward her lone figure, only to be driven away by rifle shots.","chinese":"鲨鱼游向她孤单的身躯，只能靠来复枪来击退。"},{"english":"Riflemen at the embankment also had cut holes through which they could aim and fire.","chinese":"堤岸上来复枪手开好了瞄准射击的射孔。"},{"english":"The ribbon of the rifle is fabricated with fiber.","chinese":"来复枪的带子是用纤维制作的。"},{"english":"This rifle can chamber short or long cartridges.","chinese":"这种来复枪的枪膛可以装短弹或长弹。"},{"english":"We honored the fallen police officer with a rifle salute.","chinese":"我们鸣来复枪向那名殒落的警官致意。"},{"english":"He heard small arms and some rifle fire.","chinese":"他听到一些小型武器和来复枪交火的声音。"},{"english":"Clearly a rifle is the weapon of cowards.","chinese":"明摆着，来复枪是怂人的武器。"},{"english":"The rifle is able to throw a bullet about 4 miles.","chinese":"这把来复枪可以把子弹射出大约4英里。"}],"related":[]}