{"definition":["to originate in"],"pinyin":["lai2 yuan2 yu2"],"traditional":["來源於"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"来源于","characters":[{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"来"},{"definition":["root\/source\/origin"],"pinyin":["yuan2"],"word":"源"},{"definition":["surname Yu","to go\/to take\/sentence-final interrogative particle\/variant of 於|于[yu2]","in\/at\/to\/from\/by\/than\/out of"],"pinyin":["Yu2","yu2","yu2"],"word":"于"}],"containing_words":[],"sentences":[{"english":"This paper based on the boiler rebuild project of DaLian Maritime University.","chinese":"本课题来源于大连海事大学的锅炉房改建工程。"},{"english":"Many of these can be derived from the schematics or the memory configuration of your target hardware.","chinese":"许多这些可以来源于图表或对内存配置的目标硬件。"},{"english":"Some argue that it originates from the Zulu for 'making a loud noise'.","chinese":"有人说是来源于祖鲁语中“制造噪音”的说法。"},{"english":"They say part of their income comes from the registration fee.","chinese":"他们称他们部分收入来源于挂号费。"},{"english":"When you take the test, you will be presented with two Issue topics from this pool.","chinese":"所有的机考考试题目都来源于它给出的这些？"},{"english":"The ore-forming materials were derived from the mantle.","chinese":"成矿物质初始来源于地幔。"},{"english":"He dismisses the theory that Etna is from a Greek source meaning “I burn.”","chinese":"他否定了埃特纳来源于希腊语“我在燃烧”的说法。"},{"english":"These readings are obtained from a Japanese magnetosphere simulator.","chinese":"这些读数来源于“日本磁气圈模拟器”。"},{"english":"It's from the argument about self-ownership.","chinese":"而是来源于自我拥有论的观点。"},{"english":"All that stress is caused by fear. Fear of the unknown.","chinese":"所有的压力都来源于畏惧，对未知的恐惧。"},{"english":"This topic from fibreglass plant transformation projects of Jiujiang Changjiang fiberglass factory.","chinese":"本次课题来源于九江长江玻璃纤维厂改造工程。"},{"english":"Ground waters originating in different beds commingle.","chinese":"来源于不同层位的地下水相互混合。"},{"english":"The blood group antigens in the spermatozoa are inherent, not from the seminal plasma.","chinese":"精子血型抗原为本身所固有，并非来源于精浆。"},{"english":"Fear arises out of this inner insufficiency, poverty and emptiness.","chinese":"恐惧来源于这种内在的不足，贫乏和空虚。"},{"english":"The source of pipe line secondary stress check condition is the stability condition.","chinese":"管道二次应力校核条件来源于结构的安定性条件。"},{"english":"Antinomianism is derived from two Greek words (\"anti\" and \"nomos\") that literally mean \"against the law.","chinese":"反律法主义来源于两个希腊词语，义为“反对律法”。"}],"related":[]}