{"definition":["slab\/(geology) tectonic plate\/(fig.) sector (of the stock market or of industry)\/(economic) bloc"],"pinyin":["ban3 kuai4"],"traditional":["板塊"],"rank":1970.0,"normalized_rank":0.027562855903627944,"fraction":0.00007821919180142911,"cumulative_fraction":0.7281556435144035,"word":"板块","characters":[{"definition":["to catch sight of in a doorway (old)","see 老闆|老板, boss","board\/plank\/plate\/shutter\/table tennis bat\/clappers (music)\/CL:塊|块[kuai4]\/accented beat in Chinese music\/hard\/stiff\/to stop smiling or look serious"],"pinyin":["pan4","ban3","ban3"],"word":"板"},{"definition":["lump (of earth)\/chunk\/piece\/classifier for pieces of cloth, cake, soap etc\/(coll.) classifier for money and currency units"],"pinyin":["kuai4"],"word":"块"}],"containing_words":[{"definition":["plate tectonics"],"pinyin":["ban3 kuai4 gou4 zao4"],"word":"板块构造"},{"definition":["plate tectonics"],"pinyin":["ban3 kuai4 li3 lun4"],"word":"板块理论"}],"sentences":[{"english":"Oops. They were one of the best-performing sectors in 2012.","chinese":"但银行股却是2012年表现最佳的板块之一。"},{"english":"Furthermore, the rotation of the earth is another factor responsible for earth plate motion.","chinese":"除此之外，自转的影响也是使板块运动的力源。"},{"english":"Characteristics and correlation of fluctuating pressure in instability area were specially analyzed.","chinese":"重点分析了失稳区底板块动水压力特性及相关特性。"},{"english":"But Shenzhen Stock Cheng Zhi, because is implicated the bank tectonic plate is small, bounce dynamics is slightly big.","chinese":"而深证成指由于受银行板块拖累较小，反弹力度稍大。"},{"english":"When the plates move, the continents move with them.","chinese":"当板块移动的时候，陆地也会跟着移动。"},{"english":"They occurred under the tectonic setting ranging from post collision uplift to late orogenesis.","chinese":"产生于板块碰撞后隆起到造山晚期的构造背景。"},{"english":"Square slabs were cut from cubes cast with various aggregate sizes .","chinese":"从具有不同骨料粒度的立方浇注块中切出方形板块。"},{"english":"Mining stocks, which are especially sensitive to economic growth prospects led the gains.","chinese":"对各国经济增长预期业尤为敏感的矿业板块涨幅居前。"},{"english":"The wiring inside the individual sections is effected with flexible PVC wires.","chinese":"单个板块内部的配线是通过灵活的PVC线进行执行。"},{"english":"Nations cannot act and stand alone when tectonic plates are shifting.","chinese":"地质板块正在漂移，国家再也不可能独自行动。"},{"english":"Bingdaban fault is boundary, each other belong to hyperplasia belt of two plates.","chinese":"以冰达坂断裂为分界线，分别属于两大板块的增生带。"},{"english":"The plate activity in Tianshan can be traced back to Middle and Late proterozoic.","chinese":"天山地区的板块活动可以追溯到中晚元古代。"},{"english":"The Sunda Plate noses into the curve, and tilts India.","chinese":"巽他板块插入了曲线并使得印度倾斜。"},{"english":"The theory of plate tectonics is the division of palaeo-plates.","chinese":"板块构造理论是古板块分区的基础。"},{"english":"The theory of plate tectonics is the division of palaeo-plates.","chinese":"板块构造理论是古板块分区的基础。"},{"english":"Each year, the plates move about an inch farther apart.","chinese":"这两大板块每年都会远离一英寸。"}],"related":[{"definition":["semiconductor"],"pinyin":["ban4 dao3 ti3"],"word":"半导体"},{"definition":["printing block\/section (of a newspaper)\/board (of BBS or discussion forum)"],"pinyin":["ban3 kuai4"],"word":"版块"},{"definition":["blue chip stock"],"pinyin":["lan2 chou2 gu3"],"word":"蓝筹股"},{"definition":["share (in a listed company)"],"pinyin":["ge4 gu3"],"word":"个股"},{"definition":["gilt-edged securities"],"pinyin":["bai2 ma3 gu3"],"word":"白马股"},{"definition":["hot spot\/point of special interest"],"pinyin":["re4 dian3"],"word":"热点"},{"definition":["(of a stock price or market index) currently higher than at the previous day's close"],"pinyin":["hong2 pan2"],"word":"红盘"},{"definition":["computer chip\/microchip"],"pinyin":["xin1 pian4"],"word":"芯片"},{"definition":["decline (in value)\/extent of a drop"],"pinyin":["die1 fu2"],"word":"跌幅"},{"definition":["faucet\/water tap\/bicycle handle bar\/chief (esp. of gang)\/boss\/decision maker\/(market) leader (of companies)\/front end of mud-flow\/figurehead on prow of dragon boat 龍船|龙船"],"pinyin":["long2 tou2"],"word":"龙头"},{"definition":["colored\/non-white\/non-ferrous (metals)"],"pinyin":["you3 se4"],"word":"有色"},{"definition":["non-ferrous metals (all metals excluding iron, chromium, manganese and their alloys)"],"pinyin":["you3 se4 jin1 shu3"],"word":"有色金属"},{"definition":["securities dealer\/share broker"],"pinyin":["quan4 shang1"],"word":"券商"},{"definition":["stock market index\/share price index\/abbr. for 股票指數|股票指数[gu3 piao4 zhi3 shu4]"],"pinyin":["gu3 zhi3"],"word":"股指"},{"definition":["large fall"],"pinyin":["da4 die1"],"word":"大跌"},{"definition":["extent of a rise (in prices etc)\/amount of increase\/growth (typically expressed as a percentage)"],"pinyin":["zhang3 fu2"],"word":"涨幅"}]}