{"definition":["lit. dip one's finger in the tripod (idiom); fig. to get one's finger in the pie\/to get a share of the action"],"pinyin":["ran3 zhi3 yu2 ding3"],"traditional":["染指於鼎"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"染指于鼎","characters":[{"definition":["to dye\/to catch (a disease)\/to acquire (bad habits etc)\/to contaminate\/to add color washes to a painting"],"pinyin":["ran3"],"word":"染"},{"definition":["finger\/to point at or to\/to indicate or refer to\/to depend on\/to count on\/(of hair) to stand on end"],"pinyin":["zhi3"],"word":"指"},{"definition":["surname Yu","to go\/to take\/sentence-final interrogative particle\/variant of 於|于[yu2]","in\/at\/to\/from\/by\/than\/out of"],"pinyin":["Yu2","yu2","yu2"],"word":"于"},{"definition":["ancient cooking cauldron with two looped handles and three or four legs\/pot (dialect)\/to enter upon a period of (classical)\/Kangxi radical 206\/one of the 64 hexagrams of the Book of Changes"],"pinyin":["ding3"],"word":"鼎"}],"containing_words":[],"sentences":[],"related":[{"definition":["Mr Zhu Yun breaks the railing (idiom); to challenge and admonish boldly"],"pinyin":["Zhu1 Yun2 zhe1 kan3"],"word":"朱云折槛"},{"definition":["common saying\/folk proverb"],"pinyin":["li3 yan4"],"word":"里谚"},{"definition":["butchering one another as fish and flesh (idiom); killing one another\/internecine strife"],"pinyin":["zi4 xiang1 yu2 rou4"],"word":"自相鱼肉"},{"definition":["lit. fragrant herbs and foul herbs do not go into the same vessel (idiom)\/bad people and good people do not mix"],"pinyin":["xun1 you2 bu4 tong2 qi4"],"word":"薰莸不同器"},{"definition":["Chinese set expression, typically of 4 characters, often alluding to a story or historical quotation\/idiom\/proverb\/saying\/adage\/CL:條|条[tiao2],本[ben3],句[ju4]"],"pinyin":["cheng2 yu3"],"word":"成语"},{"definition":["that being the case\/then\/in that case"],"pinyin":["ran2 ze2"],"word":"然则"},{"definition":["burning beanstalks to cook the beans (idiom); to cause internecine strife"],"pinyin":["zhu3 dou4 ran2 qi2"],"word":"煮豆燃萁"},{"definition":["to live in luxury\/lit. to ride a solid carriage pulled by fat horses"],"pinyin":["cheng2 jian1 ce4 fei2"],"word":"乘坚策肥"},{"definition":["to kill a pig as a lesson to the children (idiom); parents must teach by example"],"pinyin":["sha1 zhi4 jiao4 zi3"],"word":"杀彘教子"},{"definition":["female chicken crows at daybreak (idiom); a woman usurps authority\/women meddle in politics\/The female wears the trousers."],"pinyin":["pin4 ji1 mu3 ming2"],"word":"牝鸡牡鸣"},{"definition":["classical story or quote from the literature\/the story behind sth"],"pinyin":["dian3 gu4"],"word":"典故"},{"definition":["lit. a short-cut to crush Guo (idiom); fig. to connive with sb to damage a third party, then turn on the partner"],"pinyin":["jia3 tu2 mie4 Guo2"],"word":"假途灭虢"},{"definition":["usurper"],"pinyin":["cuan4 zei2"],"word":"篡贼"},{"definition":["minister not afraid to give forthright criticism"],"pinyin":["zheng1 chen2"],"word":"争臣"},{"definition":["livestock\/farm animals"],"pinyin":["chu2 huan4"],"word":"刍豢"},{"definition":["to beg while playing the xiao 箫 (mouth organ)\/cf Wu Zixu 伍子胥, destitute refugee from Chu 楚, busked in Wu town c. 520 BC, then became a powerful politician"],"pinyin":["Wu2 shi4 chui1 xiao1"],"word":"吴市吹箫"}]}