{"definition":["pillar"],"pinyin":["zhu4 shi2"],"traditional":["柱石"],"rank":50916.0,"normalized_rank":0.7123808990807717,"fraction":1.3050399841456734e-7,"cumulative_fraction":0.999085574540646,"word":"柱石","characters":[{"definition":["pillar\/CL:根[gen1]"],"pinyin":["zhu4"],"word":"柱"},{"definition":["dry measure for grain equal to ten dou 斗\/ten pecks\/one hundred liters","surname Shi","rock\/stone\/stone inscription\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["dan4","Shi2","shi2"],"word":"石"}],"containing_words":[],"sentences":[{"english":"I should like to call him a pillar of society.","chinese":"我要称他为社会的柱石。"},{"english":"The thermoluminescence strengths and peak temperatures of beryls can be regarded as the typomorphic characteristics.","chinese":"绿柱石的热释光强度和峰温可作为其标型特征之一。"},{"english":"It is the next generation now in Pammal church.","chinese":"我们寄望巴玛下一代的信徒能成为教会的柱石。"},{"english":"Our army is the mainstay of the dictatorship of the proletariat in China.","chinese":"我们的军队是无产阶级专政的柱石。"},{"english":"Beryl's is after all more than just another manufacturer.","chinese":"绿柱石的毕竟是多只是另一个制造商。"},{"english":"Facts have proved that China has already become a strong pillar of maintaining world peace.","chinese":"事实证明，中国已成为维护世界和平的坚强柱石。"},{"english":"Self-confidence and self-reliance are the mainstays of a strong character.","chinese":"自信与自力是坚强品格的柱石。"},{"english":"Ilvaite is a rare mineral of calcium-iron-bearing silicate.","chinese":"黑柱石是一种少见的含钙铁硅酸盐矿物。"},{"english":"You might not even realize that beryl comes in other colors.","chinese":"你可能不知道，即使是在其他绿柱石颜色。"},{"english":"Andalusite is a polymorph with two other minerals, Kyanite and Sillimanite.","chinese":"红柱石属多晶型物，含蓝晶石和硅线石两种不同矿物。"},{"english":"In the paper, the distribution of mineral resources, properties, and prospect of application about andalusite were introduced .","chinese":"简述了红柱石的矿产资源分布状况及其特性。"},{"english":"Beryl is, when absolutely pure, totally devoid of color.","chinese":"绝对纯净的绿柱石完全无色。"},{"english":"Second, The Times are the mainstays of a paper.","chinese":"第二，时期是一篇论文的柱石。"},{"english":"God's family is the church of the living God, the pillar and foundation of the truth.","chinese":"这家就是永生神的教会，真理的柱石和根基。"}],"related":[{"definition":["trusted aide"],"pinyin":["gu3 gong1"],"word":"股肱"},{"definition":["ridgepole\/ridgepole and beams\/person able to bear heavy responsibility\/mainstay (of organization)\/pillar (of state)"],"pinyin":["dong4 liang2"],"word":"栋梁"},{"definition":["loyal and brave"],"pinyin":["zhong1 yong3"],"word":"忠勇"},{"definition":["secure as a city protected by a wall of metal and a moat of boiling water (idiom)\/well fortified\/invulnerable to attack"],"pinyin":["gu4 ruo4 jin1 tang1"],"word":"固若金汤"},{"definition":["to display utter loyalty\/to be loyal to the end"],"pinyin":["jin4 zhong1"],"word":"尽忠"},{"definition":["state\/country\/the Gods of earth and grain"],"pinyin":["she4 ji4"],"word":"社稷"},{"definition":["to bring peace and stability to the country"],"pinyin":["an1 bang1 ding4 guo2"],"word":"安邦定国"},{"definition":["to meet with disaster\/killed\/in the clutches of the enemy\/to fall foul of\/in danger"],"pinyin":["meng2 nan4"],"word":"蒙难"},{"definition":["to collapse\/to topple\/to capsize"],"pinyin":["qing1 tui2"],"word":"倾颓"},{"definition":["to inspire awe throughout the empire (idiom)"],"pinyin":["wei1 zhen4 tian1 xia4"],"word":"威震天下"},{"definition":["in danger of collapse\/in a parlous state\/(of person) treacherous"],"pinyin":["qing1 wei1"],"word":"倾危"},{"definition":["precarious as pile of eggs (idiom); ready to fall and break at any moment\/in a dangerous state"],"pinyin":["wei1 ru2 lei3 luan3"],"word":"危如累卵"},{"definition":["lit. red-bellied devotion (idiom); wholehearted loyalty\/to serve sb with body and soul"],"pinyin":["chi4 dan3 zhong1 xin1"],"word":"赤胆忠心"},{"definition":["to suppress rebellion and quell unrest\/to bring calm and order to\/calm and peaceful\/tranquil"],"pinyin":["ping2 jing4"],"word":"平靖"},{"definition":["to cast in metal\/(fig.) to forge\/to fashion"],"pinyin":["zhu4 cheng2"],"word":"铸成"},{"definition":["to guard\/to protect"],"pinyin":["wei4 hu4"],"word":"卫护"}]}