{"definition":["lit. the willow trees make the shade, the flowers give the light (idiom); at one's darkest hour, a glimmer of hope\/light at the end of the tunnel"],"pinyin":["liu3 an4 hua1 ming2"],"traditional":["柳暗花明"],"rank":34452.0,"normalized_rank":0.4820281784729898,"fraction":6.370463636254718e-7,"cumulative_fraction":0.9937086667478932,"word":"柳暗花明","characters":[{"definition":["old variant of 柳[liu3]","old variant of 柳[liu3]","surname Liu","willow"],"pinyin":["liu3","liu3","Liu3","liu3"],"word":"柳"},{"definition":["variant of 暗[an4]","to close (a door)\/to eclipse\/muddled\/stupid\/ignorant\/variant of 暗[an4]","dark\/gloomy\/hidden\/secret\/muddled\/obscure\/in the dark"],"pinyin":["an4","an4","an4"],"word":"暗"},{"definition":["flower\/blossom\/CL:朵[duo3],支[zhi1],束[shu4],把[ba3],盆[pen2],簇[cu4]\/fancy pattern\/florid\/to spend (money, time)\/(coll.) lecherous\/lustful","surname Hua","old variant of 花[hua1]","variant of 花[hua1]\/flower\/blossom\/also pr. [wei3]"],"pinyin":["hua1","Hua1","hua1","hua1"],"word":"花"},{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"}],"containing_words":[],"sentences":[{"english":"I look forward to the day when the world economy returns to good health.","chinese":"我期待着，世界经济终将柳暗花明，再度繁荣。"},{"english":"But we will be alright, we just need to keep going.","chinese":"会柳暗花明的，我们要做的就是继续努力。"},{"english":"Circle back to the frustrating task later and you might just see the solution from a different vantage point.","chinese":"以后再处理难搞的任务，或许就能柳暗花明。"},{"english":"In the blink of an eye, the two sides have apparently emerged from a dark tunnel onto a sunlit plain.","chinese":"一念之转，两岸似已出现柳暗花明的新形势。"},{"english":"From despair to hope as dense willow trees and bright flowers and spring.","chinese":"从绝望中看到希望如同柳暗花明又一春。"},{"english":"However, the difficulty is the reverse side of dense willow trees and bright flowers.","chinese":"然而，困难的背面就是柳暗花明。"},{"english":"The real mountains multiply and streams double back real dense willow trees and bright flowers.","chinese":"真正的山重水复，真正的柳暗花明。"}],"related":[{"definition":["the mountain road twists around each new peak (idiom)\/(of a mountain road) twisting and turning\/fig. an opportunity has come unexpectedly\/things have taken a new turn"],"pinyin":["feng1 hui2 lu4 zhuan3"],"word":"峰回路转"},{"definition":["lit. to dispel the clouds and see the sun (idiom); fig. to restore justice"],"pinyin":["bo1 yun2 jian4 ri4"],"word":"拨云见日"},{"definition":["to come back from death's door (idiom); unexpected rescue from danger\/fig. to recover from a seemingly impossible situation\/to find a way out of a predicament"],"pinyin":["jue2 chu3 feng2 sheng1"],"word":"绝处逢生"},{"definition":["suddenly opens up to a wide panorama (idiom); to come to a wide clearing\/fig. everything becomes clear at once\/to achieve speedy enlightenment"],"pinyin":["huo4 ran2 kai1 lang3"],"word":"豁然开朗"},{"definition":["Heaven never bars one's way (idiom); don't despair and you will find a way through.\/Never give up hope.\/Never say die."],"pinyin":["tian1 wu2 jue2 ren2 zhi1 lu4"],"word":"天无绝人之路"},{"definition":["bitterness finishes, sweetness begins (idiom); the hard times are over, the good times just beginning"],"pinyin":["ku3 jin4 gan1 lai2"],"word":"苦尽甘来"},{"definition":["highway\/level road"],"pinyin":["tan3 tu2"],"word":"坦途"},{"definition":["winding\/(fig.) complicated"],"pinyin":["qu1 zhe2"],"word":"曲折"},{"definition":["the road to happiness is strewn with setbacks (idiom)"],"pinyin":["hao3 shi4 duo1 mo2"],"word":"好事多磨"},{"definition":["lit. the spring comes upon a withered tree (idiom)\/fig. to get a new lease on life\/to be revived\/(of a difficult situation) to suddenly improve"],"pinyin":["ku1 mu4 feng2 chun1"],"word":"枯木逢春"},{"definition":["broad and open road (idiom); fig. brilliant future prospects"],"pinyin":["kang1 zhuang1 da4 dao4"],"word":"康庄大道"},{"definition":["extreme sorrow turns to joy (idiom)"],"pinyin":["pi3 ji2 tai4 lai2"],"word":"否极泰来"},{"definition":["a flash of realization\/the truth in a flash\/a moment of enlightenment (usually Buddhist)"],"pinyin":["dun4 wu4"],"word":"顿悟"},{"definition":["wide sea and sky (idiom); boundless open vistas\/the whole wide world\/chatting about everything under the sun"],"pinyin":["hai3 kuo4 tian1 kong1"],"word":"海阔天空"},{"definition":["life (one's time on earth)"],"pinyin":["ren2 sheng1"],"word":"人生"},{"definition":["no room to advance or to retreat (idiom); without any way out of a dilemma\/trapped\/in an impossible situation"],"pinyin":["jin4 tui4 wei2 gu3"],"word":"进退维谷"}]}