{"definition":["target\/aim\/objective\/what one hopes to gain"],"pinyin":["biao1 di4"],"traditional":["標的"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"标的","characters":[{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"标"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"}],"containing_words":[],"sentences":[{"english":"A Master policy covering different subject-matters insured of the same legal person.","chinese":"对于涵盖同一法人的不同保险标的的统括保单。"},{"english":"The second part is about the subject matter of Chattel Mortgage.","chinese":"第二部分研究了动产抵押标的物范围。"},{"english":"Due to variations of the targets of the mortgage rights, the legal relations are also complicated.","chinese":"因权利质权的标的多样性，其法律关系也较为复杂。"},{"english":"Cases are allocated to a regime or track by a procedural judge according to their monetary value.","chinese":"案件由程序法官根据它们的标的额划分为一个体系。"},{"english":"Eigenfunction method is applied to all kinds of group and easy to formulate.","chinese":"本征函数法提供了计算各种有限群特征标的统一方法。"},{"english":"Barrick’s shares fell sharply after the bid was revealed.","chinese":"当标的价被公开后，巴里克股价急速下跌。"},{"english":"The droit of patent application as an inpawningobject is legal and doable.","chinese":"专利申请权作为质押标的是合乎法理并且是可行的。"},{"english":"In this paper, we discuss a new method for camera self- calibration based on a plane pattem of equilateral - dodecagon.","chinese":"给出一种基于平面模板摄象机自定标的新算法。"},{"english":"NO07,3. I am looking for a safe investment.","chinese":"我在找安全的投资标的。"},{"english":"Chapter three argues about the significance of landmark to the civilization history.","chinese":"第三章，地标的人类文明史意义。"},{"english":"It makes the wiring of Non-subject equipment more standard and smoothly.","chinese":"使非标的设备配线更加标准，布线更流畅。"},{"english":"Filing charge. Prio charge shall be RMB 500 and lately charge the enforcement fee base on enforced amount.","chinese":"预先收取500元，然后按照标的收取执行费。"},{"english":"Transferring the ownership of the subject-matter is the basic obligation for seller to performance.","chinese":"出卖人移转标的物所有权系其应当履行的基本义务。"},{"english":"Regard right as the settlement hypothec marked, has already had very remote history so far.","chinese":"以权利为标的设定抵押权，迄今已有十分久远的历史。"},{"english":"Then the robber, with a heavy axe, broke the chain that held the buoy.","chinese":"那强盗用一把大斧子砍断了拴着漂标的链子。"},{"english":"Three of fraccions attacked them at the same time, but their movement was hauled.","chinese":"三只破面同时攻击，但行动标的目的俄然改变。"}],"related":[{"definition":["plot of land"],"pinyin":["biao1 di4"],"word":"标地"},{"definition":["future yield (of investment)"],"pinyin":["wei4 lai2 ye4 ji4"],"word":"未来业绩"},{"definition":["listed company"],"pinyin":["shang4 shi4 gong1 si1"],"word":"上市公司"},{"definition":["gilt-edged stock\/blue chip stock"],"pinyin":["ji4 you1 gu3"],"word":"绩优股"},{"definition":["valuation\/estimation"],"pinyin":["gu1 zhi2"],"word":"估值"},{"definition":["share certificate\/stock (finance)"],"pinyin":["gu3 piao4"],"word":"股票"},{"definition":["slab\/(geology) tectonic plate\/(fig.) sector (of the stock market or of industry)\/(economic) bloc"],"pinyin":["ban3 kuai4"],"word":"板块"},{"definition":["(share trading) mid-cap"],"pinyin":["zhong1 pan2 gu3"],"word":"中盘股"},{"definition":["long term"],"pinyin":["chang2 xian4"],"word":"长线"},{"definition":["point of time (in time-based systems)"],"pinyin":["shi2 dian3"],"word":"时点"},{"definition":["investor"],"pinyin":["tou2 zi1 zhe3"],"word":"投资者"},{"definition":["faucet\/water tap\/bicycle handle bar\/chief (esp. of gang)\/boss\/decision maker\/(market) leader (of companies)\/front end of mud-flow\/figurehead on prow of dragon boat 龍船|龙船"],"pinyin":["long2 tou2"],"word":"龙头"},{"definition":["blue chip stock"],"pinyin":["lan2 chou2 gu3"],"word":"蓝筹股"},{"definition":["share (in a listed company)"],"pinyin":["ge4 gu3"],"word":"个股"},{"definition":["to buy (finance)"],"pinyin":["mai3 ru4"],"word":"买入"},{"definition":["share included in composite index"],"pinyin":["cheng2 fen4 gu3"],"word":"成份股"}]}