{"definition":["to audit and determine\/to check and ratify\/to appraise and decide\/determination\/on a deemed basis (taxation)\/to deem"],"pinyin":["he2 ding4"],"traditional":["核定"],"rank":8802.0,"normalized_rank":0.12315139982930615,"fraction":0.000010284853700557429,"cumulative_fraction":0.9186657586280198,"word":"核定","characters":[{"definition":["pit\/stone\/nucleus\/nuclear\/to examine\/to check\/to verify","variant of 核[he2]\/to investigate"],"pinyin":["he2","he2"],"word":"核"},{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"}],"containing_words":[],"sentences":[{"english":"The deemed method may not be used before an enterprise commences operations.","chinese":"要禁止在企业生产经营开始之前采取事先核定的办法。"},{"english":"From 2005, data of railways were re-approved by Lanzhou Railway Bureau.","chinese":"2005年起铁路数据由兰州铁路局重新核定划分。"},{"english":"A document evidencing the approval of the code of practices by MOTC.","chinese":"公司营业规章经交通部核定之证明文件。"},{"english":"After the adoption of the review, and so on, the two sides to begin formal cooperation.","chinese":"经本校学术交流与合作委员会审查通过后陈校长核定。"},{"english":"The duty of each agency shall be authorized by the competent education authority.","chinese":"各单位之职掌，由各该主管教育行政机关核定之。"},{"english":"Please advice us sending date of the sample for my buyer approval.","chinese":"经我方卖商核定，请告知我们样品的寄出日期。"},{"english":"It is prohibited to set up chop and seal engraving stalls outside the places checked and ratified by the License.","chinese":"禁止在《许可证》核定的地点以外设立印章刻制摊点。"},{"english":"Awards are provided for one year and must be re-applied yearly.","chinese":"奖学金每次核定一学年，须逐年申请。"},{"english":"Awards are provided for one academic year and must be re-applied yearly.","chinese":"奖学金每次核定一学年，须逐年申请。"},{"english":"If the loans exceed the surplus, the total investment in projects shall be reexamined by the original examination and approval departments.","chinese":"超出差额的，须经原审批部门重新核定项目总投资。"},{"english":"After the credit line is approved, RMB loan will be extended to you.","chinese":"核定授信额度后，我行向贵公司发放人民币贷款。"},{"english":"Checked that hospital bed 60, the Pu thoracic surgery year surgery quantity surpasses 1900.","chinese":"核定病床60张，普胸外科年手术量超过1900台。"},{"english":"The admission roster will be approved by the Admission Committee according to the recommendation of the concerned departments or institutes.","chinese":"录取名单由招生委员会依各系所审查结果核定。"},{"english":"III. Canceling the checked and ratified operation administration of the processing with imported steel.","chinese":"取消钢材进料加工的核定经营管理。"}],"related":[{"definition":["to authorize\/to investigate then ratify"],"pinyin":["he2 zhun3"],"word":"核准"},{"definition":["according to regulation"],"pinyin":["an4 gui1 ding4"],"word":"按规定"},{"definition":["to report (to the authorities)\/to declare (to customs)"],"pinyin":["shen1 bao4"],"word":"申报"},{"definition":["to calculate\/accounting"],"pinyin":["he2 suan4"],"word":"核算"},{"definition":["to report for criticism\/to submit for approval to higher authority"],"pinyin":["bao4 pi1"],"word":"报批"},{"definition":["to reconsider\/to reexamine\/to review (e.g. a report prior to accepting it)"],"pinyin":["fu4 he2"],"word":"复核"},{"definition":["fixed amount\/quota"],"pinyin":["ding4 e2"],"word":"定额"},{"definition":["according to provisions\/as stipulated in the rules"],"pinyin":["gen1 ju4 gui1 ding4"],"word":"根据规定"},{"definition":["balance (financial)\/discrepancy (in a sum or quota)\/difference"],"pinyin":["cha1 e2"],"word":"差额"},{"definition":["to grant\/to approve\/to permit"],"pinyin":["zhun3 yu3"],"word":"准予"},{"definition":["to state explicitly in writing\/to specify\/to stipulate"],"pinyin":["zai3 ming2"],"word":"载明"},{"definition":["to report, requesting approval\/written request for instructions"],"pinyin":["bao4 qing3"],"word":"报请"},{"definition":["fixed allocation"],"pinyin":["ding4 bian1"],"word":"定编"},{"definition":["maximum amount\/ceiling\/upper limit\/quota"],"pinyin":["zui4 gao1 xian4 e2"],"word":"最高限额"},{"definition":["to examine sth and make a decision\/to screen\/to evaluate\/to approve"],"pinyin":["shen3 ding4"],"word":"审定"},{"definition":["to apply (for license, visa etc)"],"pinyin":["shen1 ling3"],"word":"申领"}]}