{"definition":["to authorize\/to investigate then ratify"],"pinyin":["he2 zhun3"],"traditional":["核准"],"rank":6170.0,"normalized_rank":0.0863263050382662,"fraction":0.000017815401537483925,"cumulative_fraction":0.8830826147666042,"word":"核准","characters":[{"definition":["pit\/stone\/nucleus\/nuclear\/to examine\/to check\/to verify","variant of 核[he2]\/to investigate"],"pinyin":["he2","he2"],"word":"核"},{"definition":["to allow\/to grant\/in accordance with\/in the light of","accurate\/standard\/definitely\/certainly\/about to become (bride, son-in-law etc)\/quasi-\/para-"],"pinyin":["zhun3","zhun3"],"word":"准"}],"containing_words":[],"sentences":[{"english":"After examination and approval by the Trademark Office, a corresponding certificate shall be issued to the registrant and the change shall be published.","chinese":"经商标局核准后，发给注册人相应证明，并予以公告。"},{"english":"An enterprise as a legal person shall conduct operations within the range approved and registered.","chinese":"企业法人应当在核准登记的经营范围内从事经营。"},{"english":"Any other vehicle on which exemption is granted on the approval of the Provincial TLIA.","chinese":"经省交通征费稽查机构核准免征的其他机动车。"},{"english":"Date and reference number of the FSC approval or effective registration of offering and sale;","chinese":"经本会核准或申报生效募集及销售之日期及文号。"},{"english":"Any renewal of registration shall be published after it has been approved.","chinese":"续展注册经核准后，予以公告。"},{"english":"After the assignment of a registered trademark has been approved, it shall be publicly announced.","chinese":"转让注册商标经核准后，予以公告。"},{"english":"Some states had been approved for emergency federal aid.","chinese":"有些州已经经核准得到联邦援助。"},{"english":"Second, the Supreme Court should improve the judicial process of the final decision right to death penalty.","chinese":"其次，建议最高人民法院收回死刑核准权。"},{"english":"Without any examination and approval according to law, no entity or individual may make a public issuance of any securities.","chinese":"未经依法核准，任何单位和个人不得公开发行证券。"},{"english":"Approve of qualification of ministry of classics country construction plans to design an unit for first class.","chinese":"经国家建设部资格核准为甲级规划设计单位。"},{"english":"Does the investment scale need approval from the Central or local government?","chinese":"投资规模是否需要中国中央政府或地方政府核准？"},{"english":"Measures for charging arbitration fees shall be submitted to the price control authorities for examination and approval.","chinese":"收取仲裁费用的办法，应当报物价管理部门核准。"},{"english":"To conduct other relevant businesses which may be authorized by the Central Competent Authority.","chinese":"二二经中央主管机关核准办理之其他有关业务。"},{"english":"Any renewa1 of registration shall be published after it as been approved.","chinese":"续展注册经核准后，予以公告。"},{"english":"The assignment of registered trademark shall be announced upon its approva1.","chinese":"转让注册商标经核准后，予以公告。"},{"english":"After renewal of registration is approved, it shall be announced.","chinese":"续展注册经核准后，予以公告。"}],"related":[{"definition":["to reply officially to a subordinate"],"pinyin":["pi1 fu4"],"word":"批复"},{"definition":["to approve\/to ratify"],"pinyin":["pi1 zhun3"],"word":"批准"},{"definition":["to examine and approve\/to endorse"],"pinyin":["shen3 pi1"],"word":"审批"},{"definition":["to report for criticism\/to submit for approval to higher authority"],"pinyin":["bao4 pi1"],"word":"报批"},{"definition":["to allow\/to permit"],"pinyin":["xu3 ke3"],"word":"许可"},{"definition":["to audit and determine\/to check and ratify\/to appraise and decide\/determination\/on a deemed basis (taxation)\/to deem"],"pinyin":["he2 ding4"],"word":"核定"},{"definition":["official written ruling in response to a submission\/official approval in writing"],"pinyin":["pi1 wen2"],"word":"批文"},{"definition":["to report, requesting approval\/written request for instructions"],"pinyin":["bao4 qing3"],"word":"报请"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"审查"},{"definition":["the authorities\/higher competent body"],"pinyin":["zhu3 guan3 ji1 guan1"],"word":"主管机关"},{"definition":["to obtain permission"],"pinyin":["huo4 zhun3"],"word":"获准"},{"definition":["to put on record\/to file"],"pinyin":["bei4 an4"],"word":"备案"},{"definition":["to report (to the authorities)\/to declare (to customs)"],"pinyin":["shen1 bao4"],"word":"申报"},{"definition":["to accept to hear a case\/to handle (a service)"],"pinyin":["shou4 li3"],"word":"受理"},{"definition":["to reconsider\/to reexamine\/to review (e.g. a report prior to accepting it)"],"pinyin":["fu4 he2"],"word":"复核"},{"definition":["to apply for sth\/application (form etc)\/CL:份[fen4]"],"pinyin":["shen1 qing3"],"word":"申请"}]}