{"definition":["to calculate\/accounting"],"pinyin":["he2 suan4"],"traditional":["核算"],"rank":7310.0,"normalized_rank":0.10227638408909658,"fraction":0.000013771237362900955,"cumulative_fraction":0.9009329502099696,"word":"核算","characters":[{"definition":["pit\/stone\/nucleus\/nuclear\/to examine\/to check\/to verify","variant of 核[he2]\/to investigate"],"pinyin":["he2","he2"],"word":"核"},{"definition":["to regard as\/to figure\/to calculate\/to compute"],"pinyin":["suan4"],"word":"算"}],"containing_words":[],"sentences":[{"english":"We are independent in finance and responsible for its own financial gain or loss.","chinese":"我们是独立核算的公司，各分厂有独立的财务。"},{"english":"Choosing standard money of charge to an account is business accounting of accounting of industry of condition foreign enterprise cannot evasive problem.","chinese":"选择记账本位币是境外企业会计核算不能回避的问题。"},{"english":"Third, the basic concept and measuring methods of accounting of sustainable development.","chinese":"第三，可持续发展核算的基本概念和测度方法问题。"},{"english":"It is also shown that integral kernel operators can be expressedin terms of gradient and divergent operators.","chinese":"也证明了积分核算子可用梯度与散度算子表出。"},{"english":"Accounting centralized assessing system is one of the common practice of accounting designating system.","chinese":"会计集中核算制是会计委派制的一种常用方式。"},{"english":"A. The accurate diagnosis of postdates pregnancy can be made only by proper dating.","chinese":"过期妊娠通过正确核算孕周可做出确切诊断。"},{"english":"It is also shown that integral kernel operators can be expressedin terms of gradient and pergent operators.","chinese":"也证明了积分核算子可用梯度与散度算子表出。"},{"english":"Rigorous air-cooler model Rigorous Air Cooler design and rating.","chinese":"严格空冷器设计和核算软件。"},{"english":"The spread of economic calculation is basic to income maximization.","chinese":"推广经济核算是收入最优化的基础。"},{"english":"The competent tax authorities shall strengthen their management on the business accounting of tax deduction ledgers .","chinese":"主管税务机关应加强对税款抵扣台帐核算的管理。"},{"english":"Approved accounting methods of enterprise merger include purchase method and equity method.","chinese":"对企业合并进行会计核算主要有购买法和权益结合法。"},{"english":"Perpetual Inventory Method is the basic tool for capital stock accounting.","chinese":"永续盘存法是资本存量核算的基本工具。"},{"english":"Subsidiary accounts should be set up for prepaid expenses according to different types of expenses.","chinese":"待摊费用应按费用种类设置明细账，进行明细核算。"},{"english":"Perform recipe costing for food and beverage.","chinese":"对餐饮的食品和饮料进行成本核算。"},{"english":"The implementation of full-cost accounting is of great significance to the operation and management of hospitals.","chinese":"全成本核算的实行对医院的经营管理具有重要的意义。"},{"english":"The doubt of the profit etc. of the business was put out by the municipal assemblyman .","chinese":"从市议会议员关于事业的核算性等疑问被发出了。"}],"related":[{"definition":["balance (financial)\/discrepancy (in a sum or quota)\/difference"],"pinyin":["cha1 e2"],"word":"差额"},{"definition":["to count\/to calculate\/to compute\/CL:個|个[ge4]"],"pinyin":["ji4 suan4"],"word":"计算"},{"definition":["per book\/as recorded in the accounts"],"pinyin":["zhang4 zai3"],"word":"账载"},{"definition":["sum (result of addition)\/addition\/total\/to add up a number of items\/to accumulate"],"pinyin":["jia1 zong3"],"word":"加总"},{"definition":["final account\/to calculate the final bill\/fig. to draw up plans to deal with sth"],"pinyin":["jue2 suan4"],"word":"决算"},{"definition":["an item in accounts\/an entry"],"pinyin":["zhang4 mu4"],"word":"账目"},{"definition":["measurement\/to calculate"],"pinyin":["ji4 liang4"],"word":"计量"},{"definition":["cash flow\/financial balance\/income and expenditure"],"pinyin":["shou1 zhi1"],"word":"收支"},{"definition":["to check\/to verify\/to audit\/to examine"],"pinyin":["he2 dui4"],"word":"核对"},{"definition":["historic cost (accounting)"],"pinyin":["li4 shi3 cheng2 ben3"],"word":"历史成本"},{"definition":["to set aside\/to make provision for (capital requirements)"],"pinyin":["ji4 ti2"],"word":"计提"},{"definition":["to convert (between currencies)"],"pinyin":["zhe2 suan4"],"word":"折算"},{"definition":["weighted average"],"pinyin":["jia1 quan2 ping2 jun1"],"word":"加权平均"},{"definition":["fixed assets"],"pinyin":["gu4 ding4 zi1 chan3"],"word":"固定资产"},{"definition":["to verify accounting records\/also written 對帳|对帐[dui4 zhang4]"],"pinyin":["dui4 zhang4"],"word":"对账"},{"definition":["to deduct"],"pinyin":["kou4 chu2"],"word":"扣除"}]}