{"definition":["forms of versification\/conventions regarding set number of words and lines, choice of tonal patterns and rhyme schemes for various types of Classical Chinese poetic composition\/metrical verse"],"pinyin":["ge2 lu:4"],"traditional":["格律"],"rank":45151.0,"normalized_rank":0.6317210694947742,"fraction":2.3473202399398688e-7,"cumulative_fraction":0.9980554466303352,"word":"格律","characters":[{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"},{"definition":["law","surname Lü"],"pinyin":["lu:4","Lu:4"],"word":"律"}],"containing_words":[],"sentences":[{"english":"The modern metrical poetry together with the free verse achieved the great brilliance in one-hundred-year Chinese poetry.","chinese":"现代格律诗与自由诗共同创造了百年现代汉诗的辉煌。"},{"english":"He has composed 52 moderhythmical poems which can be classified into the styles of neat speech and mixed speech.","chinese":"他创作现代格律诗52首，分齐言体和杂言体两大类。"},{"english":"The holes in Gruyere are due to aeration.","chinese":"格律耶尔干酪气孔多是由于通风所致。"},{"english":"In the history of contemporary literature, the theory of modern metrics raised by He Qifang is of great impact.","chinese":"他提出的现代格律诗理论在现当代文学史上影响较大。"},{"english":"In other words, meter is something Frost knows how to use.","chinese":"换句话说，弗罗斯特知道怎么使用格律。"},{"english":"The central issue of modern metrical poetry is the artistic experiment.","chinese":"现代格律诗建设的中心问题是艺术实验。"},{"english":"Unlike free verse , they are traditional metrical verses and semi-metrical verses.","chinese":"不同于新诗，它们是旧体或变体的格律诗。"},{"english":"Compared with He Xun, Yin Keng s poetry was clear and fresh, and very mature in form.","chinese":"比起何逊，阴铿的诗格律非常成熟，形式浏亮新俊。"},{"english":"This time Six-character poem has completed the classical Chinese poetry rules process.","chinese":"这一时期六言诗完成了格律化过程。"},{"english":"Laws of classical Chinese poetry are invariably derived from nature, so are its forms and rules.","chinese":"中国古代诗歌的种种法则都源于自然，格律同样如此。"},{"english":"In that meter, too, we're hearing some of Frost's modernity.","chinese":"在这种格律中，我们也能感受到弗罗斯特的现代性。"}],"related":[{"definition":["a genre of poetry, developed in the Tang Dynasty, characterized by its strict form"],"pinyin":["jin4 ti3 shi1"],"word":"近体诗"},{"definition":["regular verse\/strict poetic form with eight lines of 5, 6 or 7 syllables and even lines rhyming"],"pinyin":["lu:4 shi1"],"word":"律诗"},{"definition":["level and oblique tones (technical term for Classical Chinese rhythmic poetry)"],"pinyin":["ping2 ze4"],"word":"平仄"},{"definition":["meters and forms of versification\/prosody"],"pinyin":["shi1 lu:4"],"word":"诗律"},{"definition":["a pre-Tang Dynasty genre of poetry, relatively free in form, usually having four, five, six or seven characters per line"],"pinyin":["gu3 ti3 shi1"],"word":"古体诗"},{"definition":["rhyming word ending a line of verse\/rhyme"],"pinyin":["yun4 jiao3"],"word":"韵脚"},{"definition":["poetic form or genre"],"pinyin":["shi1 ti3"],"word":"诗体"},{"definition":["syntax"],"pinyin":["ju4 fa3"],"word":"句法"},{"definition":["poetry in the old style"],"pinyin":["jiu4 ti3 shi1"],"word":"旧体诗"},{"definition":["names of the tunes to which 詞|词[ci2] poems are composed"],"pinyin":["ci2 pai2"],"word":"词牌"},{"definition":["antithesis (two lines of poetry matching in sense and sound)\/to fight\/to wage war"],"pinyin":["dui4 zhang4"],"word":"对仗"},{"definition":["long poem in lüshi form 律詩|律诗"],"pinyin":["pai2 lu:4"],"word":"排律"},{"definition":["number of sentences\/number of lines (in verse etc)"],"pinyin":["ju4 shu4"],"word":"句数"},{"definition":["abbr. for Shijing 詩經|诗经[Shi1 jing1], the Book of Songs","poem\/CL:首[shou3]\/poetry\/verse"],"pinyin":["Shi1","shi1"],"word":"诗"},{"definition":["old form of writing\/piece in the old style"],"pinyin":["jiu4 ti3"],"word":"旧体"},{"definition":["use of words"],"pinyin":["qian3 ci2"],"word":"遣词"}]}