{"definition":["style (of art or literature)\/form\/one's work style\/moral character"],"pinyin":["ge2 diao4"],"traditional":["格調"],"rank":14327.0,"normalized_rank":0.2004533180361815,"fraction":0.000004477279793482322,"cumulative_fraction":0.9561307329222776,"word":"格调","characters":[{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"},{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["tiao2","diao4"],"word":"调"}],"containing_words":[],"sentences":[{"english":"You want the party to look similar - but not like members of a choir.","chinese":"你想让婚宴有统一格调却又不像唱诗班。"},{"english":"The hotel has been redecorated, but it lost a lot of it's style.","chinese":"旅馆已重新装修，但昔日优雅格调所剩不多。"},{"english":"Perfect scale, define your official elegance.","chinese":"完美尺度，定义贵仕优雅格调。"},{"english":"A compact sitting-room of the same genre was outside.","chinese":"外面是间具有同样格调的小小的起居室。"},{"english":"The style of natural guileless, show a long time ago agrestic breath.","chinese":"自然朴实的格调，显示出悠远的乡土气息。"},{"english":"Chong Sheng Hall designs elegant and possesses Southern architectural features.","chinese":"崇圣堂设计格调高雅，具有南方建筑特色。"},{"english":"Adjusted for inflation, that’s about what I still pay.","chinese":"膨胀的价格调整后，我还要付那么多。"},{"english":"London Sophistication, Shanghai Style, Exclusively Created by Guoman.","chinese":"伦敦格调，上海风情，惟有国丰呈献。"},{"english":"Auroral style is decorous, those who communicate is a kind of romantic feelings.","chinese":"玫瑰色格调高雅，传达的是一种浪漫情怀。"},{"english":"The restaurant decor will mimic that of the flagship shop in Taipei, mixing fashion with Chinese elements.","chinese":"餐厅格调会和台北旗舰店几本一致，混合中国风元素。"},{"english":"What the traditional lines concentrate on is the variedly artistic styles.","chinese":"一贯传承的线条，倾注的是多元的艺术格调。"},{"english":"His artistic style is elegant and simple, full of poetic charm.","chinese":"他的艺术格调清丽简约，雅俗之间，充满诗情画意。"},{"english":"Featuring high quality and exclusive Hollywood movies that suits the most discerning movie buffs.","chinese":"专为爱好电影者而设，播放高格调的荷里活电影。"},{"english":"Price adaptations and programme-related assumptions contributed substantially.","chinese":"价格调整和与项目有关的假设起了很大作用。"},{"english":"Had enough of \" high-brow culture\"?","chinese":"受够了“高格调文化”吗？"},{"english":"But in Beijing today they were celebrating an opening, and doing so in some style.","chinese":"但是今天北京正在举行一场颇有格调的开业大庆。"}],"related":[{"definition":["sentiment\/tone and mood\/taste"],"pinyin":["qing2 diao4"],"word":"情调"},{"definition":["elegant\/refined\/in good taste"],"pinyin":["ya3 zhi4"],"word":"雅致"},{"definition":["sketchy\/concise\/abbreviated"],"pinyin":["jian3 yue1"],"word":"简约"},{"definition":["refined\/elegant"],"pinyin":["dian3 ya3"],"word":"典雅"},{"definition":["dainty\/elegance\/elegant"],"pinyin":["gao1 ya3"],"word":"高雅"},{"definition":["rank\/grade\/quality\/(aesthetic) taste"],"pinyin":["pin3 wei4"],"word":"品位"},{"definition":["(slang) pretentious style"],"pinyin":["bi1 ge2"],"word":"逼格"},{"definition":["to sample\/to taste\/to appreciate\/one's taste (i.e. in music, literature, fashion, food and drink etc)\/good taste"],"pinyin":["pin3 wei4"],"word":"品味"},{"definition":["variant of 別緻|别致[bie2 zhi4]","unusual\/unique"],"pinyin":["bie2 zhi4","bie2 zhi4"],"word":"别致"},{"definition":["realism (in art)\/sense of reality\/texture\/tactile quality"],"pinyin":["zhi4 gan3"],"word":"质感"},{"definition":["to return to old ways (a Confucian aspiration)\/to turn back the clock\/neoclassical school during Tang and Song associated with classical writing 古文\/retro (fashion style based on nostalgia, esp. for 1960s)"],"pinyin":["fu4 gu3"],"word":"复古"},{"definition":["grace\/graceful"],"pinyin":["you1 ya3"],"word":"优雅"},{"definition":["implicit charm in rhyme or sound\/hinted appeal\/interest"],"pinyin":["yun4 wei4"],"word":"韵味"},{"definition":["sense of beauty\/aesthetic perception"],"pinyin":["mei3 gan3"],"word":"美感"},{"definition":["to conform to no conventional pattern\/unconventional\/offbeat"],"pinyin":["bu4 luo4 su2 tao4"],"word":"不落俗套"},{"definition":["style"],"pinyin":["feng1 ge2"],"word":"风格"}]}