{"definition":["candidate who ranked 1st in imperial examination on prefecture or county level (in Ming and Qing dynasties)"],"pinyin":["an4 shou3"],"traditional":["案首"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"案首","characters":[{"definition":["(legal) case\/incident\/record\/file\/table"],"pinyin":["an4"],"word":"案"},{"definition":["head\/chief\/first (occasion, thing etc)\/classifier for poems, songs etc"],"pinyin":["shou3"],"word":"首"}],"containing_words":[],"sentences":[{"english":"Kept lookout men on forecastle and crew-nest for salvage of sea casualty.","chinese":"为海难救助坚持在案首楼和了望台派设了望人员。"},{"english":"I'll keep my head up and smile, just because I know you want to see me fall.","chinese":"我要案首挺胸，面带微笑，因为我知道你看到我倒下。"},{"english":"Just don't know, does he how elect you up this to go to the capital.","chinese":"只是不知道，他要如何接你这个案首进京。"}],"related":[{"definition":["first-placed candidate in the provincial imperial examinations (old)"],"pinyin":["jie4 yuan2"],"word":"解元"},{"definition":["prefectural exam, the 2nd of the three entry-level exams in the imperial examination system of Ming and Qing dynasties"],"pinyin":["fu3 shi4"],"word":"府试"},{"definition":["metropolitan civil service examination (held triennially in spring in imperial times)\/Crown Prince's chambers\/by extension, the Crown Prince"],"pinyin":["chun1 wei2"],"word":"春闱"},{"definition":["graduate\/successful candidate in the imperial provincial examination"],"pinyin":["ju3 ren2"],"word":"举人"},{"definition":["candidate who has not yet passed the county level imperial exam"],"pinyin":["tong2 sheng1"],"word":"童生"},{"definition":["autumn exam (triennial provincial exam during Ming and Qing)"],"pinyin":["qiu1 wei2"],"word":"秋闱"},{"definition":["the triennial provincial imperial exam during the Ming and Qing"],"pinyin":["xiang1 shi4"],"word":"乡试"},{"definition":["the last of the three entry-level exams in the imperial examination system of Ming and Qing dynasties"],"pinyin":["yuan4 shi4"],"word":"院试"},{"definition":["a person who has passed the county level imperial exam (historical)\/scholar\/skillful writer\/fine talent"],"pinyin":["xiu4 cai5"],"word":"秀才"},{"definition":["to pass the provincial level imperial examination"],"pinyin":["zhong4 ju3"],"word":"中举"},{"definition":["(old) candidate who has successfully passed the first grades of the examination system, but not yet the court examination (殿試|殿试[dian4 shi4])"],"pinyin":["gong4 shi4"],"word":"贡士"},{"definition":["court examination, the top grade imperial exam"],"pinyin":["dian4 shi4"],"word":"殿试"},{"definition":["to pass an exam"],"pinyin":["kao3 zhong4"],"word":"考中"},{"definition":["autumn exam (triennial provincial exam during Ming and Qing)"],"pinyin":["qiu1 shi4"],"word":"秋试"},{"definition":["successful candidate in the highest imperial civil service examination\/palace graduate"],"pinyin":["jin4 shi4"],"word":"进士"},{"definition":["title of the temporary position in the Hanlin Academy, conferred to meritorious candidates until the next examination"],"pinyin":["shu4 ji2 shi4"],"word":"庶吉士"}]}