{"definition":["Chu Ci, the Songs of Chu (ancient book of poems, collected during Han but esp. from country of Chu c. 500 BC)"],"pinyin":["Chu3 ci2"],"traditional":["楚辭"],"rank":45581.0,"normalized_rank":0.6377373273823682,"fraction":2.253894558748233e-7,"cumulative_fraction":0.9981544003382784,"word":"楚辞","characters":[{"definition":["distinct\/clear\/orderly\/pain\/suffering\/deciduous bush used in Chinese medicine (genus Vitex)\/punishment cane (old)","surname Chu\/abbr. for Hubei 湖北省[Hu2 bei3 Sheng3] and Hunan 湖南省[Hu2 nan2 Sheng3] provinces together\/Chinese kingdom during the Spring and Autumn and Warring States Periods (722-221 BC)"],"pinyin":["chu3","Chu3"],"word":"楚"},{"definition":["old variant of 辭|辞[ci2]","to resign\/to dismiss\/to decline\/to take leave\/ballad (archaic poetic genre)\/variant of 詞|词[ci2]"],"pinyin":["ci2","ci2"],"word":"辞"}],"containing_words":[],"sentences":[{"english":"The fifth chapter is to discuss the reception of ChuCi in Liu Xizai' poem–ode.","chinese":"第五章，论刘熙载诗赋对楚辞的接受。"},{"english":"When had been Elegies of Chu transmit into Japan?","chinese":"楚辞何时传进日本，没有明确记录。"},{"english":"The description of inhabiting environment and architecture is very romantic and various.","chinese":"“楚辞”中对人居环境与建筑的描写宏富浪漫多彩。"},{"english":"The sixth chapter is to discuss the Criterion of ChuCi about Liu Xizai reviewing Ci.","chinese":"第六章，论刘熙载评鉴词的楚辞尺度。"},{"english":"Back in Oxford Hawkes completed his doctoral dissertation on The Songs of the South.","chinese":"回到牛津后，霍克思完成了他的博士论文《论楚辞》。"},{"english":"That is the reason for Li He's acceptance of Chuci.","chinese":"李贺对楚辞的接受也包括这两个方面。"},{"english":"Elegies of Chu nourished Han Fu and had deep and lasting influence on the later literature.","chinese":"楚辞滋养了汉赋，并对后世文学产生了深远的影响。"},{"english":"The Songs of Chu\" is the essence of marvellous Chu culture.\"","chinese":"楚辞”是奇谲瑰丽的楚文化的精华。"},{"english":"Both Zhuang Zi and Chu Ci are important documents of the Warring States Period.","chinese":"《庄子》《楚辞》是战国中期两部重要文献。"},{"english":"It's difficult to understand Chuci, and there are not exact explications to some parts of it today.","chinese":"《楚辞》历来难懂，很多地方至今未有确解。"},{"english":"Songyu's Jiubian realized the change of the subject of Chuci.","chinese":"宋玉的《九辩》实现了楚辞主题的转换。"},{"english":"This series of book is the modern paraphrases by Wen Huaisha, the expert of Songs of Chu.","chinese":"诸书为楚辞专家文怀沙对屈原作品的今绎。"},{"english":"The rich witchcraft of the nation is the original religion background for the formation of the artistic characteristics of the Songs of Chu .","chinese":"楚国浓郁的巫风是楚辞艺术特征形成的原始宗教背景。"}],"related":[{"definition":["Shijing, the Book of Songs, early collection of Chinese poems and one of the Five Classics of Confucianism 五經|五经[Wu3 jing1]"],"pinyin":["Shi1 jing1"],"word":"诗经"},{"definition":["On Encountering Sorrow, poem by Qu Yuan 屈原[Qu1 Yuan2] in Songs of Chu 楚辭|楚辞[Chu3 ci2]"],"pinyin":["Li2 Sao1"],"word":"离骚"},{"definition":["pre-Qin, Chinese history up to the foundation of the Qin imperial dynasty in 221 BC"],"pinyin":["xian1 Qin2"],"word":"先秦"},{"definition":["famous piece of writing"],"pinyin":["ming2 pian1"],"word":"名篇"},{"definition":["Yuan dynasty theater, including poetry, music and comedy"],"pinyin":["Yuan2 qu3"],"word":"元曲"},{"definition":["Qu Yuan (340-278 BC), famous Warring States statesman and poet, author of Sorrow at Parting 離騷|离骚 Lisao in Songs of Chu 楚辭|楚辞"],"pinyin":["Qu1 Yuan2"],"word":"屈原"},{"definition":["poetry in the style of 離騷|离骚[Li2 Sao1]"],"pinyin":["sao1 ti3"],"word":"骚体"},{"definition":["old language\/the Classics\/Classical Chinese as a literary model, esp. in Tang and Song prose\/Classical Chinese as a school subject"],"pinyin":["gu3 wen2"],"word":"古文"},{"definition":["Records of the Grand Historian, by 司馬遷|司马迁[Si1 ma3 Qian1], first of the 24 dynastic histories 二十四史[Er4 shi2 si4 Shi3]"],"pinyin":["Shi3 ji4"],"word":"史记"},{"definition":["yuefu (Chinese style of lyric poetry)"],"pinyin":["yue4 fu3"],"word":"乐府"},{"definition":["classical literature"],"pinyin":["gu3 dian3 wen2 xue2"],"word":"古典文学"},{"definition":["the Hundred Schools of Thought, the various schools of thought and their exponents during the Spring and Autumn and Warring States Periods (770-220 BC)"],"pinyin":["zhu1 zi3 bai3 jia1"],"word":"诸子百家"},{"definition":["Classical Chinese"],"pinyin":["wen2 yan2"],"word":"文言"},{"definition":["poetry and prose\/rhetoric"],"pinyin":["ci2 zhang1"],"word":"辞章"},{"definition":["notes on poetry, an essay genre consisting of informal commentary on poems and poets and their lives (old)\/a genre of narrative literature interspersing prose with poetry, popular in the Tang and Song dynasties"],"pinyin":["shi1 hua4"],"word":"诗话"},{"definition":["to interpret and make glossaries and commentaries on classic texts"],"pinyin":["xun4 gu3"],"word":"训诂"}]}