{"definition":["to cut across\/a horizontal cut"],"pinyin":["heng2 qie1"],"traditional":["橫切"],"rank":45513.0,"normalized_rank":0.6367859191582835,"fraction":2.2684923214344253e-7,"cumulative_fraction":0.9981390223251764,"word":"横切","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng4","heng2"],"word":"横"},{"definition":["to cut\/to slice\/tangent (math)","definitely\/absolutely (not)\/(scoffing or dismissive interjection) Yeah, right.\/Tut!\/to grind\/close to\/eager\/to correspond to\/see also 反切[fan3 qie4]"],"pinyin":["qie1","qie4"],"word":"切"}],"containing_words":[],"sentences":[{"english":"Most software systems consist of several concerns that crosscut multiple modules.","chinese":"大多数软件系统由一些横切多个模块的关注点组成。"},{"english":"Results There are obvious microscopic characteristics to identify on the transverse section of the stem and leaf epidermis of Drymaria cordata.","chinese":"结果荷莲豆茎横切面及叶表皮细胞有明显的显微特征。"},{"english":"Cross section of the cell show that the internal photo synthetic membrane are present as cycloid plica spiralis shape.","chinese":"细胞横切面显示内光合膜系统呈环形复瓦状结构。"},{"english":"But what about crosscutting behavior?","chinese":"但是横切行为会怎么样呢？"},{"english":"It also provides a convenient whole-system view of the program's crosscutting structure.","chinese":"它还对程序的横切结构提供了方便的完整系统显示。"},{"english":"It provides a way of specifying and encapsulating cross-cutting concerns in a system.","chinese":"它为在系统中详细指定并封装横切点提供了方法。"},{"english":"Objective To evaluate the effect of bilateral orchidectomy using transverse incision in front of pubic symphysis.","chinese":"目的探讨耻骨联合前横切口行双侧睾丸切除术的疗效。"},{"english":"Methods Comparatively observe the tissue structure of transections of the 4 stems in microscope.","chinese":"方法光镜下比较观察茎横切面组织构造。"},{"english":"The article describes the design and calculation of air-cushion piler at the rear end of the cross-cut shear in cold rolling mills.","chinese":"简要介绍冷轧机横切机组尾部气垫垛板的设计计算。"},{"english":"Behavior that crosscuts a number of classes poses a particular problem for integration tests.","chinese":"横切数个类的行为给集成测试带来了一个特定问题。"},{"english":"So how do we implement a cross-cutting concern such as logging?","chinese":"因此，怎样才能实现一个横切关注点，例如日志？"},{"english":"It is suitable for a wide range of applications, including thin crosscuts and materials with thin-walled cross sections.","chinese":"它适用于广泛的应用，包括薄横切和薄壁切面的材料。"},{"english":"We're gonna transect the great arteries at the sino-tubular ridge.","chinese":"我们要在窦管脊上横切大动脉。"},{"english":"Avoided tying all code to particular instances of cross-cutting concern classes.","chinese":"避免将所有代码与横切关注点类的特殊实例联系起来。"},{"english":"The mouth of pants bag should replace transversely line as far as possible with straight-cut line or inclined tangent.","chinese":"裤袋的开口应尽量以纵切线或斜切线来代替横切线。"},{"english":"All are examples of what are called crosscutting concerns.","chinese":"所有这些都是所谓横切关注点的例子。"}],"related":[{"definition":["back of the knife"],"pinyin":["dao1 bei4"],"word":"刀背"},{"definition":["to cleave\/to split open\/to spread open (fingers, legs)"],"pinyin":["pi1 kai1"],"word":"劈开"},{"definition":["tangent direction"],"pinyin":["qie1 xiang4"],"word":"切向"},{"definition":["curve\/arc\/arch"],"pinyin":["hu2 xing2"],"word":"弧形"},{"definition":["slang\/argot\/private language used as secret code","incision\/notch\/slit\/gash\/margin of a page\/trimmed edge (of a page in a book)"],"pinyin":["qie4 kou3","qie1 kou3"],"word":"切口"},{"definition":["(hitting) squarely in the middle\/(slicing) across the middle\/to hold by the waist"],"pinyin":["lan2 yao1"],"word":"拦腰"},{"definition":["section\/cross-cut\/tangent plane (math.)"],"pinyin":["qie1 mian4"],"word":"切面"},{"definition":["to roll\/to turn over\/to invert\/to flip"],"pinyin":["fan1 zhuan3"],"word":"翻转"},{"definition":["diagonal line\/slanting line\/slash (punct.)\/forward slash (computing)"],"pinyin":["xie2 xian4"],"word":"斜线"},{"definition":["arc of a circle\/circular arc"],"pinyin":["yuan2 hu2"],"word":"圆弧"},{"definition":["sharp knife\/knife (weapon)"],"pinyin":["li4 dao1"],"word":"利刀"},{"definition":["horizontal\/orthogonal\/perpendicular\/lateral\/crosswise"],"pinyin":["heng2 xiang4"],"word":"横向"},{"definition":["blade\/razor blade\/tool bit"],"pinyin":["dao1 pian4"],"word":"刀片"},{"definition":["hand formed into a flat shape, as for a karate chop"],"pinyin":["shou3 dao1"],"word":"手刀"},{"definition":["to cut"],"pinyin":["qie1 ge1"],"word":"切割"},{"definition":["to slice\/to dice"],"pinyin":["hua2 qie4"],"word":"划切"}]}