{"definition":["violently\/flagrantly"],"pinyin":["heng2 jia1"],"traditional":["橫加"],"rank":40919.0,"normalized_rank":0.5725098988429197,"fraction":3.5107619260294685e-7,"cumulative_fraction":0.9968270942407332,"word":"横加","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng4","heng2"],"word":"横"},{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"}],"containing_words":[{"definition":["to blame unscrupulously"],"pinyin":["heng2 jia1 zhi3 ze2"],"word":"横加指责"}],"sentences":[{"english":"They made comments about the too-colourful waistcoats that he wore.","chinese":"他们对他色彩艳丽的马甲横加评论。"},{"english":"Though I was yet a mere child my father did not place any restriction on my wanderings.","chinese":"那时我还是个孩子，父亲对我的走动，从不横加阻拦。"},{"english":"There should be no arbitrary meddling in this process.","chinese":"在这方面，不要横加干涉。"},{"english":"Political paralysis has given rise to accusations of meddling by India.","chinese":"人们指责是印度的横加干涉导致了尼泊尔的政治瘫痪。"},{"english":"He's always making unwarranted accusations against others. His manner is intolerably aggressive.","chinese":"他动不动就对别人横加指责，气势逼人。"},{"english":"If you do anything unique, people will attack you for it.","chinese":"如果你行事很独特，人们就会对你的行为横加指责。"},{"english":"Forget the criticism about not making money with Android.","chinese":"不要再对谷歌未能利用安卓吸金而横加指责。"},{"english":"They wouldn't welcome any officious interference from the police.","chinese":"他们不会欢迎任何来自警方的横加干涉。"},{"english":"They made rude remarks about her appearance.","chinese":"他们对她的外表横加粗暴的评论。"},{"english":"That's probably better than constant meddling or overbearing behavior.","chinese":"这也许比事事横加干涉和傲慢专横的行为要好。"},{"english":"Yet they couldn't condemn the Dutch fast enough.","chinese":"然而他们却无法对荷兰横加指责。"},{"english":"Society ought to promote the exercise of virtue, not obstruct it.","chinese":"社会应让人们容易地修练德行，勿横加障碍。"},{"english":"We must not point fingers and cast blame.","chinese":"我们一定不要指指点点，横加指责。"}],"related":[{"definition":["to blame unscrupulously"],"pinyin":["heng2 jia1 zhi3 ze2"],"word":"横加指责"},{"definition":["not distinguishing red-green or black-white (idiom)\/not to distinguish between right and wrong"],"pinyin":["bu4 wen4 qing1 hong2 zao4 bai2"],"word":"不问青红皂白"},{"definition":["to stick up for a wrongdoer"],"pinyin":["hui2 hu4"],"word":"回护"},{"definition":["to gesticulate while talking (idiom); to explain by waving one's hands\/to criticize or give orders summarily\/also written 指手畫腳|指手画脚"],"pinyin":["zhi3 shou3 hua4 jiao3"],"word":"指手划脚"},{"definition":["to make thoughtless remarks (idiom)\/to criticize\/gossip"],"pinyin":["shuo1 san1 dao4 si4"],"word":"说三道四"},{"definition":["reproof\/blame"],"pinyin":["fei1 nan4"],"word":"非难"},{"definition":["to censure"],"pinyin":["ze2 nan4"],"word":"责难"},{"definition":["to shield (a miscreant) from punishment, criticism etc\/to take sb's side"],"pinyin":["tan3 hu4"],"word":"袒护"},{"definition":["to upbraid"],"pinyin":["chi4 ze2"],"word":"叱责"},{"definition":["to rebuke\/to blame\/to denounce"],"pinyin":["shen1 chi4"],"word":"申斥"},{"definition":["to neglect\/to misuse\/to mistreat\/to abuse"],"pinyin":["wang3 gu4"],"word":"枉顾"},{"definition":["to criticize"],"pinyin":["zhi3 zhai1"],"word":"指摘"},{"definition":["lit. to go beyond the sacrificial altar and take over the kitchen (idiom); fig. to exceed one's place and meddle in other people's affairs\/to take matters into one's own hands"],"pinyin":["yue4 zu3 dai4 pao2"],"word":"越俎代庖"},{"definition":["not distinguishing black or white (idiom); not to distinguish between right and wrong"],"pinyin":["bu4 fen1 zao4 bai2"],"word":"不分皂白"},{"definition":["to incite\/to stir up\/to instigate"],"pinyin":["tiao3 suo1"],"word":"挑唆"},{"definition":["to go against the tide (idiom); to do things all wrong\/to try to turn back history\/a perverse way of doing things"],"pinyin":["dao4 xing2 ni4 shi1"],"word":"倒行逆施"}]}