{"definition":["to go on the rampage\/to riot\/to run amuck"],"pinyin":["heng2 xing2"],"traditional":["橫行"],"rank":17565.0,"normalized_rank":0.24575713905950503,"fraction":0.000003077354351876392,"cumulative_fraction":0.9682155748451551,"word":"横行","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng4","heng2"],"word":"横"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"}],"containing_words":[{"definition":["to oppress\/to rule as a despot\/to tyrannize"],"pinyin":["heng2 xing2 ba4 dao4"],"word":"横行霸道"}],"sentences":[{"english":"Stage I. Transverse fracture of medial malleolus or rupture of deltoid ligament.","chinese":"度内踝的横行骨折或三角韧带断裂。"},{"english":"Be in Guangzhou, black tiger side and the North sea help two great vicious power run amuck at yellow Bu harbor.","chinese":"在广州，黑虎帮和北海帮两大恶势力横行于黄埔港。"},{"english":"Objective To evaluate the effect of one stage urethroplasty with the laterigrade preputial pedicle tube.","chinese":"目的探讨横行岛状皮瓣一期修复尿道下裂的疗效。"},{"english":"There is no law and order and motorcycle gangs terrorize the country.","chinese":"世间没有法律和秩序，只有飞车党横行霸道。"},{"english":"The transversal muscle fibre was not cut off, so the integrality of bladder neck was keeped.","chinese":"术中不切断膀胱颈横行肌纤维，保持其完整性。"},{"english":"A war that ravages our planet until it was consumed by death.","chinese":"战争在我们的星球横行，直到彻底毁灭了这个世界。"},{"english":"The transverse fibers began to appear in the middle and inferior segments of CT near epicardium.","chinese":"从界嵴的中部向下，近心外膜侧，开始出现横行纤维。"},{"english":"These evil people are still playing tyrants.","chinese":"这些腐恶的势力依旧横行乡里。"},{"english":"The more the reactionaries lash out, the more resistance they provoke.","chinese":"越是横行霸道，就越发激起更强烈的反抗。"},{"english":"Will 2011 be the year of the copycat?","chinese":"2011年会是山寨横行掂旎年吗？"},{"english":"We've (barely) lived through a 40-year period in which investment banks have imposed themselves on us.","chinese":"我们勉强在过去投行横行的40年间生存下来。"},{"english":"A new and lethal virus was on the loose.","chinese":"一种新的致命病毒正在横行无忌。"},{"english":"In July fourteen, on rampant.","chinese":"七月十四，猛鬼横行。"},{"english":"A tornado rips across the Missouri Plains.","chinese":"龙卷风在密苏里平原肆虐横行。"},{"english":"Africa's richest country, not yet free of demons, is facing a year of decision.","chinese":"非洲最富之国，尚未恶人横行，面临抉择之年。"},{"english":"Tenements spread across city landscapes, teeming with crime and filth.","chinese":"城市里到处是出租房屋，犯罪横行且污秽不堪。"}],"related":[{"definition":["to oppress\/to rule as a despot\/to tyrannize"],"pinyin":["heng2 xing2 ba4 dao4"],"word":"横行霸道"},{"definition":["to be rampant\/to run wild"],"pinyin":["chang1 jue2"],"word":"猖獗"},{"definition":["in the middle of the road\/to be in the way\/to hold power\/(fig.) to predominate\/to be in vogue"],"pinyin":["dang1 dao4"],"word":"当道"},{"definition":["savage\/furious"],"pinyin":["chang1 kuang2"],"word":"猖狂"},{"definition":["to wreak havoc\/to devastate"],"pinyin":["si4 nu:e4"],"word":"肆虐"},{"definition":["see 恣意妄為|恣意妄为[zi4 yi4 wang4 wei2]"],"pinyin":["si4 yi4 wang4 wei2"],"word":"肆意妄为"},{"definition":["to exercise sole hegemony (idiom); to dominate a whole area (market, resources etc)\/to hold as one's personal fiefdom"],"pinyin":["du2 ba4 yi1 fang1"],"word":"独霸一方"},{"definition":["to break the law and commit crimes (idiom); malefactor\/evildoer\/to perpetrate outrages"],"pinyin":["wei2 fei1 zuo4 dai3"],"word":"为非作歹"},{"definition":["to be in flood\/to overflow (the banks)\/to inundate\/to spread unchecked"],"pinyin":["fan4 lan4"],"word":"泛滥"},{"definition":["to incite trouble\/to stir up havoc"],"pinyin":["xing1 feng1 zuo4 lang4"],"word":"兴风作浪"},{"definition":["to torment the people (idiom)"],"pinyin":["tu2 du2 sheng1 ling2"],"word":"荼毒生灵"},{"definition":["as many as the hair of the ox (idiom)\/great amount of\/countless"],"pinyin":["duo1 ru2 niu2 mao2"],"word":"多如牛毛"},{"definition":["torment\/cruelty\/great suffering"],"pinyin":["tu2 du2"],"word":"荼毒"},{"definition":["regardless of the law and of natural morality (idiom); maverick\/undisciplined and out of control"],"pinyin":["wu2 fa3 wu2 tian1"],"word":"无法无天"},{"definition":["to occupy illegally\/to seize (territory)\/to entrench (oneself)"],"pinyin":["pan2 ju4"],"word":"盘踞"},{"definition":["lit. to proclaim oneself hegemon\/to take a leading role\/to build a personal fiefdom"],"pinyin":["cheng1 ba4"],"word":"称霸"}]}