{"definition":["to oppress\/to rule as a despot\/to tyrannize"],"pinyin":["heng2 xing2 ba4 dao4"],"traditional":["橫行霸道"],"rank":40736.0,"normalized_rank":0.569949491416339,"fraction":3.5808311869231965e-7,"cumulative_fraction":0.9967622598835152,"word":"横行霸道","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng4","heng2"],"word":"横"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"},{"definition":["variant of 霸[ba4]","hegemon\/tyrant\/lord\/feudal chief\/to rule by force\/to usurp\/(in modern advertising) master"],"pinyin":["ba4","ba4"],"word":"霸"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"}],"containing_words":[],"sentences":[{"english":"There is no law and order and motorcycle gangs terrorize the country.","chinese":"世间没有法律和秩序，只有飞车党横行霸道。"},{"english":"The more the reactionaries lash out, the more resistance they provoke.","chinese":"越是横行霸道，就越发激起更强烈的反抗。"},{"english":"The street was overrun by the bullies last year.","chinese":"去年那些暴徒在街上横行霸道，无恶不作。"},{"english":"The Fascists once tyrannized a large part of the world.","chinese":"法西斯曾在世界很大范围内横行霸道。"},{"english":"During the Second World War, China had been overrun by Japanese invaders.","chinese":"二战期间，日本侵略者在中国横行霸道，无恶不作。"},{"english":"For many hundreds of years, the armies of the Dark Gods had ruled triumphant over the realms.","chinese":"数百年来，黑暗之神的军队一直在诸域横行霸道。"}],"related":[{"definition":["tyrannical abuse (idiom); riding roughshod over people"],"pinyin":["zuo4 wei1 zuo4 fu2"],"word":"作威作福"},{"definition":["to break the law and commit crimes (idiom); malefactor\/evildoer\/to perpetrate outrages"],"pinyin":["wei2 fei1 zuo4 dai3"],"word":"为非作歹"},{"definition":["regardless of the law and of natural morality (idiom); maverick\/undisciplined and out of control"],"pinyin":["wu2 fa3 wu2 tian1"],"word":"无法无天"},{"definition":["to go on the rampage\/to riot\/to run amuck"],"pinyin":["heng2 xing2"],"word":"横行"},{"definition":["bossy and domineering\/throwing one's weight about"],"pinyin":["fei1 yang2 ba2 hu4"],"word":"飞扬跋扈"},{"definition":["see 恣意妄為|恣意妄为[zi4 yi4 wang4 wei2]"],"pinyin":["si4 yi4 wang4 wei2"],"word":"肆意妄为"},{"definition":["to oppress the people\/to act tyrannically"],"pinyin":["qi1 nan2 ba4 nu:3"],"word":"欺男霸女"},{"definition":["to run amok (idiom); to commit outrages"],"pinyin":["hu2 zuo4 fei1 wei2"],"word":"胡作非为"},{"definition":["to take advantage of one's position to bully people (idiom)\/to kick people around"],"pinyin":["zhang4 shi4 qi1 ren2"],"word":"仗势欺人"},{"definition":["to show off one's military strength (idiom); to strut around\/to bluff\/to bluster"],"pinyin":["yao4 wu3 yang2 wei1"],"word":"耀武扬威"},{"definition":["to exercise sole hegemony (idiom); to dominate a whole area (market, resources etc)\/to hold as one's personal fiefdom"],"pinyin":["du2 ba4 yi1 fang1"],"word":"独霸一方"},{"definition":["rampant\/unbridled\/arrogant\/aggressive"],"pinyin":["xiao1 zhang1"],"word":"嚣张"},{"definition":["to stir up trouble"],"pinyin":["re3 shi4 sheng1 fei1"],"word":"惹是生非"},{"definition":["lit. to hide the sky with one hand\/to hide the truth from the masses"],"pinyin":["yi1 shou3 zhe1 tian1"],"word":"一手遮天"},{"definition":["not to shrink from any crime (idiom); to commit any imaginable misdeed"],"pinyin":["wu2 e4 bu4 zuo4"],"word":"无恶不作"},{"definition":["to bully\/to push around"],"pinyin":["qi1 ya1"],"word":"欺压"}]}