{"definition":["horizontal traverse\/to cut across\/to cross transversally"],"pinyin":["heng2 guan4"],"traditional":["橫貫"],"rank":27687.0,"normalized_rank":0.3873770514739832,"fraction":0.0000011595002901643272,"cumulative_fraction":0.9878228803639888,"word":"横贯","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng4","heng2"],"word":"横"},{"definition":["to pierce through\/to pass through\/to be stringed together\/string of 1000 cash"],"pinyin":["guan4"],"word":"贯"}],"containing_words":[],"sentences":[{"english":"A high mountain range, the Trans–Antarctic range, runs from east to west, cutting the continent in two.","chinese":"一条横贯南极洲的山脉，从东到西将南极洲分为两半。"},{"english":"The climber traversed a long horizontal crack in the face of the mountain slope.","chinese":"登山者横贯了山脉斜坡表面一段长的水平裂缝。"},{"english":"River flows from north-east across the area to the southwest, rolling 50 Wa Lane.","chinese":"流溪河从该区东北部横贯至西南部，连绵50华里。"},{"english":"Hadrian's Wall is built across Britannia to keep out the barbarians .","chinese":"横贯大不列颠的哈德连长城被修筑用来防御野蛮人。"},{"english":"So you can imagine what the gas bill would be on a transcontinental flight.","chinese":"所以你也能想象得出横贯大陆的航线需要多少汽油钱。"},{"english":"Mr GuoWei river from east to west across the whole country.","chinese":"奥果韦河自东向西横贯全境。"},{"english":"A high mountain range, the Trans?CAntarctic range, runs from east to west, cutting the continent in two.","chinese":"一条横贯南极洲的山脉，从东到西将南极洲分为两半。"},{"english":"Take Trans-Canada Highway 1 South.","chinese":"以横贯加拿大的1号公路南。"},{"english":"It is advisable to take the trans-Atlantic liner.","chinese":"乘坐横贯大西洋的班船比较合适。"},{"english":"The start of the Central Cross-Island Highway.","chinese":"进入中部横贯公路。"},{"english":"Aurora Borealis in the distance on this beautiful night over Europe.","chinese":"在这个美丽的夜晚，横贯整个欧洲上空的极光。"},{"english":"Because of the Tropic of Cancer and the Trans-Ba Bao Tong had opened up to astronomical Park.","chinese":"因北回归线横贯八宝塘而过，开辟为天文公园。"},{"english":"The Ghan's revival on the north-south transcontinental line has been even more remarkable.","chinese":"横贯大洲南北的甘线铁路的复兴更意义非凡。"},{"english":"A hill bridges the town from east to west.","chinese":"一座山从东向西横贯全镇。"},{"english":"\"the harmony\" is one has existed since ancient times, thing yawing development idea.","chinese":"“和谐”是一个古已有之，东西横贯的发展理念。"},{"english":"I crossed the continent and joined together the seas with my great railroads .","chinese":"我们修通了横贯北美大陆连接东西海岸的铁路干线。"}],"related":[{"definition":["lit. warp string in weaving\/fig. vertical or north-south lines\/to pass through\/to cross lengthwise\/to pierce (esp. north-south or top-to-bottom)"],"pinyin":["zong4 guan4"],"word":"纵贯"},{"definition":["to run through\/a connecting thread from beginning to end\/to link"],"pinyin":["guan4 chuan1"],"word":"贯穿"},{"definition":["to cross\/to traverse"],"pinyin":["heng2 chuan1"],"word":"横穿"},{"definition":["long and narrow"],"pinyin":["xia2 chang2"],"word":"狭长"},{"definition":["to link\/to join\/link\/connection"],"pinyin":["xiang1 lian2"],"word":"相连"},{"definition":["to span\/to stretch across\/to travel across"],"pinyin":["heng2 kua4"],"word":"横跨"},{"definition":["to link up\/to thread together"],"pinyin":["guan4 tong1"],"word":"贯通"},{"definition":["to wriggle\/snaking\/winding\/to zigzag\/to meander"],"pinyin":["wan1 yan2"],"word":"蜿蜒"},{"definition":["to merge with\/interlinking\/to join with\/to interlock"],"pinyin":["xiang1 jie1"],"word":"相接"},{"definition":["to connect\/to communicate\/to relate\/(math.) connected"],"pinyin":["lian2 tong1"],"word":"连通"},{"definition":["continuous (esp. of mountain ranges)\/to stretch long and unbroken\/a continuous link\/sostenuto (sustained, in music)"],"pinyin":["mian2 yan2"],"word":"绵延"},{"definition":["to link up\/to join together\/to connect"],"pinyin":["guan4 lian2"],"word":"贯连"},{"definition":["system\/sequence\/order\/procedures"],"pinyin":["tiao2 guan4"],"word":"条贯"},{"definition":["criss-crossed (idiom)"],"pinyin":["zong4 heng2 jiao1 cuo4"],"word":"纵横交错"},{"definition":["to cross\/to pass over\/to traverse\/trans-"],"pinyin":["heng2 yue4"],"word":"横越"},{"definition":["to stretch in an unbroken chain (esp. of mountains)"],"pinyin":["mian2 gen4"],"word":"绵亘"}]}