{"definition":["second after\/second only to"],"pinyin":["ci4 yu2"],"traditional":["次於"],"rank":36844.0,"normalized_rank":0.5154953618849076,"fraction":5.14279179434587e-7,"cumulative_fraction":0.9950782040269148,"word":"次于","characters":[{"definition":["next in sequence\/second\/the second (day, time etc)\/secondary\/vice-\/sub-\/infra-\/inferior quality\/substandard\/order\/sequence\/hypo- (chemistry)\/classifier for enumerated events: time"],"pinyin":["ci4"],"word":"次"},{"definition":["surname Yu","to go\/to take\/sentence-final interrogative particle\/variant of 於|于[yu2]","in\/at\/to\/from\/by\/than\/out of"],"pinyin":["Yu2","yu2","yu2"],"word":"于"}],"containing_words":[{"definition":["second only to...\/(in second place) preceded only by..."],"pinyin":["jin3 ci4 yu2"],"word":"仅次于"}],"sentences":[{"english":"It's the next best thing to witnessing an actual blastoff.","chinese":"这是仅次于目睹火箭真实升空的最佳选择。"},{"english":"Airfoil buffet boundary is an important aerodynamic parameter which is second only to the lift-drag ratio.","chinese":"翼型抖振边界是仅次于升阻比的一项重要气动指标。"},{"english":"Background Tea which flavor is fragrant is consumed only second to water .","chinese":"茶叶气味芬芳，是世界上仅次于水的第二大饮料。"},{"english":"To the writer of real estate advertisements, the autobiographer is the most suspect of prose artists.","chinese":"自传作者是仅次于房地产广告作者的最可疑的散文家。"},{"english":"Russia is now PepsiCo's biggest market after the U.S.","chinese":"俄罗斯目前是百事公司仅次于美国的第二大市场。"},{"english":"The American men are ranked third in the world behind volleyball powerhouse Brazil and Russia.","chinese":"美国男排世界排名第三，次于排球大国巴西和俄罗斯。"},{"english":"The next-best solution is to abandon the project altogether.","chinese":"仅次于最佳的解决方法是放弃全部计划。"},{"english":"India’s economy became the world’s second fastest-growing economy, after China. Led by a thriving information-technology sector, the services sector boomed.","chinese":"印度成为世界上增长第二快的经济体，仅次于中国。"},{"english":"It is the second-smallest country in the world (after the Vatican City).","chinese":"它仅次于梵蒂冈，是世界上面积第二小国。"},{"english":"This river's flow into the sea is only second to that one.","chinese":"这条河流的入海量仅次于那条河流。"},{"english":"Fats or lipids are the second important nutrients next to carbohydrates.","chinese":"脂肪又叫脂质，它仅次于碳水化合物的第二大营养素。"},{"english":"We ourselves attract more foreign investment than any country but the U. S.","chinese":"我们所吸引的外资额仅次于美国。"},{"english":"Yale’s endowment is the second largest after Harvard, at twenty-two and a half billion dollars.","chinese":"耶鲁的捐赠基金仅次于哈佛排第二，达225亿美元。"},{"english":"India's economy became the world's second fastest-growing economy, after China.","chinese":"印度成为世界上增长第二快的经济体，仅次于中国。"},{"english":"China is the third-largest art market in the world, after the United States and Great Britain.","chinese":"中国是仅次于美国和英国的第三大艺术品市场。"},{"english":"Airfoil buffeting boundary is an important aerodynamics targets which second only to the lift-drag ratio.","chinese":"翼型抖振边界是仅次于升阻比的一项重要气动指标。"}],"related":[{"definition":["second only to...\/(in second place) preceded only by..."],"pinyin":["jin3 ci4 yu2"],"word":"仅次于"},{"definition":["inferior (often in the combination 毫無遜色|毫无逊色, not in the least inferior)"],"pinyin":["xun4 se4"],"word":"逊色"},{"definition":["equally matched\/about the same"],"pinyin":["bu4 xiang1 shang4 xia4"],"word":"不相上下"},{"definition":["not inferior in any respect"],"pinyin":["hao2 bu4 xun4 se4"],"word":"毫不逊色"},{"definition":["no less than\/not inferior to"],"pinyin":["bu4 ya4 yu2"],"word":"不亚于"},{"definition":["to compare\/to draw a parallel\/to match\/analogy\/metaphor\/comparison"],"pinyin":["bi3 ni3"],"word":"比拟"},{"definition":["surpassing by far"],"pinyin":["yuan3 yuan3 chao1 guo4"],"word":"远远超过"},{"definition":["as many as\/no less than\/not inferior to\/as good as\/on a par with"],"pinyin":["bu4 xia4 yu2"],"word":"不下于"},{"definition":["fall short by a large amount"],"pinyin":["cha4 de2 duo1"],"word":"差得多"},{"definition":["to excel\/to surpass"],"pinyin":["sheng4 guo4"],"word":"胜过"},{"definition":["lit. to have no time for civilities (idiom)\/fig. not to be outdone\/not to yield to one's opponents"],"pinyin":["bu4 huang2 duo1 rang4"],"word":"不遑多让"},{"definition":["to exceed by far\/to outclass"],"pinyin":["yuan3 chao1 guo4"],"word":"远超过"},{"definition":["rude\/impertinent"],"pinyin":["bu4 xun4"],"word":"不逊"},{"definition":["to make reference to\/to write about"],"pinyin":["lun4 ji2"],"word":"论及"},{"definition":["greater than\/to exceed"],"pinyin":["gao1 yu2"],"word":"高于"},{"definition":["to discuss two disparate things together (idiom); to mention on equal terms\/to place on a par with\/(often with negatives: impossible to mention X in the same breath as Y)"],"pinyin":["xiang1 ti2 bing4 lun4"],"word":"相提并论"}]}