{"definition":["second (in a competition)\/occupying second place"],"pinyin":["ci4 zhi1"],"traditional":["次之"],"rank":26708.0,"normalized_rank":0.3736795713066473,"fraction":0.0000012675237340421569,"cumulative_fraction":0.9866334591856238,"word":"次之","characters":[{"definition":["next in sequence\/second\/the second (day, time etc)\/secondary\/vice-\/sub-\/infra-\/inferior quality\/substandard\/order\/sequence\/hypo- (chemistry)\/classifier for enumerated events: time"],"pinyin":["ci4"],"word":"次"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"}],"containing_words":[],"sentences":[{"english":"Hypocrisy is also at play in how Bernanke and his Chinese counterparts are embroiled in a race to the bottom.","chinese":"伯南克与其中国对手的竞次之争不也是一种虚伪么。"},{"english":"Followed by evaporation platform dolomite, the reservoir ability is general.","chinese":"蒸发台地云岩次之，储集性能一般。"},{"english":"In three days, it was re-posted over 100,000 times.","chinese":"在三天内就累计发布了10万次之多。"},{"english":"The water condition of stony trough is worse than soil surface.","chinese":"石槽水分亏缺最严重，土面次之。"},{"english":"The modification effects of low-carbon ferrochromium and rare-earth ferrosilicon take second place.","chinese":"低碳铬铁和稀土硅铁的变质效果次之。"},{"english":"Sunan yak are used mainly for transport and meat production, with milk and wool production taking the second place.","chinese":"肃南牦牛以驮运和产肉为主，产奶和产毛次之。"},{"english":"Invalids bear food worst during summer and autumn, most easily in winter, and next in spring.","chinese":"夏秋两季病人饮食最差，冬季最好，春季次之。"},{"english":"The content ofp hydroxybenzoic acid in sawdust is the highest, followed by that ofp coumaric acid.","chinese":"木屑中对羟基苯甲酸含量最高，香豆酸次之。"},{"english":"The types of flooding were river torrents and mountain torrents.","chinese":"水灾类型以江洪灾为主，山洪为次之。"},{"english":"Among the mineral deposits of the province, tin occupies first place; copper comes second.","chinese":"该省矿藏，以锡最多，铜次之。"},{"english":"Breast enlargement was the most popular operation for women, while liposuction was the next most popular.","chinese":"隆胸是妇女中最常见的手术，抽脂次之。"},{"english":"The effects of mancozeb were best and triadimefon inferior.","chinese":"其中以代森锰锌防效最好，粉锈宁次之。"},{"english":"This sandstone consists of quartz primarily and feldspar secondly.","chinese":"这种砂岩的成份以石英为主，长石次之。"},{"english":"At a round table there's no dispute of place.","chinese":"圆桌上出有坐次之争。"},{"english":"Hydrocarbons produced from Pinghu structural zone are mainly of condensate gas, and then to be followed by crude oil.","chinese":"平湖构造带产出的油气以凝析气为主，原油次之。"},{"english":"In using allusions, Liu Yong emphasized events rather than language.","chinese":"柳词用典，以事典为主，语典次之。"}],"related":[{"definition":["next\/secondly"],"pinyin":["qi2 ci4"],"word":"其次"},{"definition":["to be in the majority"],"pinyin":["ju1 duo1"],"word":"居多"},{"definition":["second only to...\/(in second place) preceded only by..."],"pinyin":["jin3 ci4 yu2"],"word":"仅次于"},{"definition":["to be located at"],"pinyin":["wei4 ju1"],"word":"位居"},{"definition":["leading\/in first place\/top of the list"],"pinyin":["ju1 shou3"],"word":"居首"},{"definition":["to regard as the foremost\/to name as a prime example\/to implement for the first time"],"pinyin":["shou3 tui1"],"word":"首推"},{"definition":["to rank"],"pinyin":["wei4 lie4"],"word":"位列"},{"definition":["comparatively speaking"],"pinyin":["bi3 jiao4 er2 yan2"],"word":"比较而言"},{"definition":["second after\/second only to"],"pinyin":["ci4 yu2"],"word":"次于"},{"definition":["at most\/maximum\/greatest (amount)\/maximal"],"pinyin":["zui4 duo1"],"word":"最多"},{"definition":["relatively\/opposite\/to resist\/to oppose\/relative\/vis-a-vis\/counterpart"],"pinyin":["xiang1 dui4"],"word":"相对"},{"definition":["at least\/minimum\/lowest (amount)\/minimal"],"pinyin":["zui4 shao3"],"word":"最少"},{"definition":["secondly\/the other (usu. of two)\/the second"],"pinyin":["qi2 er4"],"word":"其二"},{"definition":["tallest\/highest\/supreme (court etc)"],"pinyin":["zui4 gao1"],"word":"最高"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"则"},{"definition":["variant of 占[zhan4]","to observe\/to divine","to take possession of\/to occupy\/to take up"],"pinyin":["zhan4","zhan1","zhan4"],"word":"占"}]}