{"definition":["to close down (temporarily or permanently)\/to go out of business"],"pinyin":["xie1 ye4"],"traditional":["歇業"],"rank":24455.0,"normalized_rank":0.3421571782351377,"fraction":0.0000015613766969152262,"cumulative_fraction":0.9834632067156974,"word":"歇业","characters":[{"definition":["to rest\/to take a break\/to stop\/to halt\/(dialect) to sleep\/a moment\/a short while"],"pinyin":["xie1"],"word":"歇"},{"definition":["surname Ye","line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already"],"pinyin":["Ye4","ye4"],"word":"业"}],"containing_words":[{"definition":["to close up shop and cease business temporarily\/closed for business"],"pinyin":["guan1 dian4 xie1 ye4"],"word":"关店歇业"}],"sentences":[{"english":"We're finding that businesses who have bedbugs oftentimes will close to remediate the problem.","chinese":"我们发现，经常闹臭虫的企业得歇业来处理这个问题。"},{"english":"He only traded for a few months and went out of business because he was undercapitalized.","chinese":"他仅经商数月，便由于投资不足而歇业。"},{"english":"The practice of new to the company plant represents municipal government of Suzhou of delegate of week person character congratulation.","chinese":"周人言代表姑苏市政府对公司新工厂的歇业暗示祝贺。"},{"english":"The firm closed business for the time of the holiday.","chinese":"该商号节日期间歇业。"},{"english":"The factory is shut down or failed to pay wages.","chinese":"关厂歇业或无法依劳动契约给付工作报酬。"},{"english":"The closeout of an enterprise means the enterprise has permanently ceased its business activities.","chinese":"企业歇业是指企业停止经营活动且不再继续。"},{"english":"The shop is closed for three weeks.","chinese":"这家店歇业三星期。"},{"english":"Sunday was known as the day of rest, when the shops were shut and businesses closed.","chinese":"听说日曜日是休息日，市肆都关门歇业。"},{"english":"Closeout of an enterprise is a form of termination of an enterprise.","chinese":"企业歇业是企业终止的一种情形。"}],"related":[{"definition":["to cease trading (temporarily or permanently)\/to close down"],"pinyin":["ting2 ye4"],"word":"停业"},{"definition":["to close shop in the evening\/also pr. [da3 yang2]"],"pinyin":["da3 yang4"],"word":"打烊"},{"definition":["to close a door\/to lock a door\/(of a shop etc) to close (for the night, or permanently)"],"pinyin":["guan1 men2"],"word":"关门"},{"definition":["to close down a business for good and put the best face on it (idiom)"],"pinyin":["guan1 men2 da4 ji2"],"word":"关门大吉"},{"definition":["to do business\/to trade"],"pinyin":["ying2 ye4"],"word":"营业"},{"definition":["to go bankrupt\/to close down"],"pinyin":["dao3 bi4"],"word":"倒闭"},{"definition":["to have a full house\/to be sold out\/no vacancy"],"pinyin":["ke4 man3"],"word":"客满"},{"definition":["to open a business\/first transaction of a business day"],"pinyin":["kai1 zhang1"],"word":"开张"},{"definition":["the people are gone and the place is empty (idiom)\/the sight of a deserted place brings old friends to mind\/the place is deserted\/the birds have flown"],"pinyin":["ren2 qu4 lou2 kong1"],"word":"人去楼空"},{"definition":["to open a business\/to open a practice\/open (for business)"],"pinyin":["kai1 ye4"],"word":"开业"},{"definition":["you can net sparrows at the door (idiom); completely deserted"],"pinyin":["men2 ke3 luo2 que4"],"word":"门可罗雀"},{"definition":["half-open door\/fig. prostitute"],"pinyin":["ban4 kai1 men2"],"word":"半开门"},{"definition":["lit. General Iron is guarding the door (idiom)\/fig. the door is padlocked — nobody inside"],"pinyin":["tie3 jiang1 jun1 ba3 men2"],"word":"铁将军把门"},{"definition":["to stop work\/to shut down\/to stop production"],"pinyin":["ting2 gong1"],"word":"停工"},{"definition":["to declare bankruptcy"],"pinyin":["xuan1 bu4 po4 chan3"],"word":"宣布破产"},{"definition":["(of a power plant, refinery etc) to shut down"],"pinyin":["guan1 ting2"],"word":"关停"}]}