{"definition":["Zhengtong Emperor, reign name of sixth Ming Emperor Zhu Qizhen 朱祁鎮|朱祁镇[Zhu1 Qi2 zhen4] (1427-1464), reigned 1435-1449, Temple name Yingzong 英宗[Ying1 zong1]","orthodox"],"pinyin":["Zheng4 tong3","zheng4 tong3"],"traditional":["正統","正統"],"rank":20791.0,"normalized_rank":0.2908930645138724,"fraction":0.000002200466747316765,"cumulative_fraction":0.9766553176170856,"word":"正统","characters":[{"definition":["first month of the lunar year","straight\/upright\/proper\/main\/principal\/to correct\/to rectify\/exactly\/just (at that time)\/right (in that place)\/(math.) positive"],"pinyin":["zheng1","zheng4"],"word":"正"},{"definition":["to gather\/to unite\/to unify\/whole"],"pinyin":["tong3"],"word":"统"}],"containing_words":[],"sentences":[{"english":"Houzhi origin of the official family, who have received formal education, and poems.","chinese":"侯芝出身儒门仕宦之家，从小受过正统教育，能诗文。"},{"english":"Berel had remained true to the old orthodoxy.","chinese":"斑瑞尔一直忠实格守古老的正统观念。"},{"english":"An Ultra Orthodox Jewish girl stands on a street in the religious neighborhood of Mea Shearim in Jerusalem.","chinese":"一名正统犹太小女孩站在耶路撒冷歇雷姆区的大街上。"},{"english":"This is something Reformed orthodoxy never allowed.","chinese":"这是改革宗正统所绝不允许的事。"},{"english":"It became clear to me early on that there was an orthodoxy afoot here.","chinese":"在很早的时候我就认识到这里有一种文学正统。"},{"english":"What was this classical pediment with a circle shape cut out of the centre?","chinese":"从中心切除一个圆形的正统山形墙是什么？"},{"english":"Confucian academic legitimacy rebuilding under the influence of political reforms and academic changes.","chinese":"政局变革与学术变迁影响下的儒学正统性建构。"},{"english":"Zhang had a desire to revive the legitimism.","chinese":"章学诚有一种正统不兴而欲续之的传统精神。"},{"english":"To the chagrin of her secular parents, she embraced Orthodox Judaism.","chinese":"出于对其世俗父母的懊恼，她皈依了犹太正统派。"},{"english":"This kind of constitutionalism is analyzed to be completely different from orthodox public finance and tax revenue theory.","chinese":"这种立宪分析与正统的公共财政和税收理论完全不同。"},{"english":"No would-be orthodoxy goes unchallenged for long.","chinese":"没有自许为正统的理论可以长时间的不受挑战。"},{"english":"More orthodox measures aimed at limiting the franc’s rise have proved ineffective.","chinese":"旨在限制法郎升值的更加正统的政策被证明是无效的。"},{"english":"DA YI XU LUE is a attempt of orthodox theory. It has important historical value.","chinese":"《大义叙略》是郑思肖正统论的实践尝试。"},{"english":"As a result of orthodoxy, then all the history of the old China of an extremely brief period of writing.","chinese":"由于正统观念作怪，旧中国史将这一段写的极其简略。"},{"english":"This suggests phylacteries, implements worn by Orthodox Jews during their morning prayers.","chinese":"这有点像正统犹太教徒在早晨祈祷时配带的护身符。"},{"english":"Since your father died, you are the natural heir… to the throne of Genovia.","chinese":"自你父亲过世后你是正统王位继承人。"}],"related":[{"definition":["successor"],"pinyin":["ji4 cheng2 zhe3"],"word":"继承者"},{"definition":["the imperial court\/the government in imperial times"],"pinyin":["huang2 chao2"],"word":"皇朝"},{"definition":["first day of the first lunar month\/(old) calendar promulgated by the first emperor of a dynasty"],"pinyin":["zheng1 shuo4"],"word":"正朔"},{"definition":["royal family\/imperial household\/member of the royal family"],"pinyin":["huang2 shi4"],"word":"皇室"},{"definition":["regent\/monarch"],"pinyin":["di4 wang2"],"word":"帝王"},{"definition":["ruler"],"pinyin":["tong3 zhi4 zhe3"],"word":"统治者"},{"definition":["Confucian orthodoxy"],"pinyin":["dao4 tong3"],"word":"道统"},{"definition":["worship\/to revere\/to venerate"],"pinyin":["zun1 feng4"],"word":"尊奉"},{"definition":["Confucianism"],"pinyin":["Ru2 jiao4"],"word":"儒教"},{"definition":["unification (of the nation)\/large scale unification"],"pinyin":["da4 yi1 tong3"],"word":"大一统"},{"definition":["state religion"],"pinyin":["guo2 jiao4"],"word":"国教"},{"definition":["the correct path\/the right way (Buddhism)"],"pinyin":["zheng4 dao4"],"word":"正道"},{"definition":["tributary (stream)\/(fig.) school (of thought)\/genre\/style"],"pinyin":["liu2 pai4"],"word":"流派"},{"definition":["old school\/conservative faction"],"pinyin":["jiu4 pai4"],"word":"旧派"},{"definition":["Celestial Empire, tributary title conferred on imperial China\/Taiping Heavenly Kingdom"],"pinyin":["Tian1 chao2"],"word":"天朝"},{"definition":["creed\/doctrine\/teachings"],"pinyin":["jiao4 yi4"],"word":"教义"}]}