{"definition":["lit. 300 silver taels not hidden here (idiom); fig. to reveal what one intends to hide"],"pinyin":["ci3 di4 wu2 yin2 san1 bai3 liang3"],"traditional":["此地無銀三百兩"],"rank":46089.0,"normalized_rank":0.6448449064681768,"fraction":2.1487906674076414e-7,"cumulative_fraction":0.9982661806623624,"word":"此地无银三百两","characters":[{"definition":["this\/these"],"pinyin":["ci3"],"word":"此"},{"definition":["earth\/ground\/field\/place\/land\/CL:片[pian4]","-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct"],"pinyin":["di4","de5"],"word":"地"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"无"},{"definition":["silver\/silver-colored\/relating to money or currency"],"pinyin":["yin2"],"word":"银"},{"definition":["surname San","three\/3"],"pinyin":["San1","san1"],"word":"三"},{"definition":["surname Bai","hundred\/numerous\/all kinds of"],"pinyin":["Bai3","bai3"],"word":"百"},{"definition":["two\/both\/some\/a few\/tael, unit of weight equal to 50 grams (modern) or 1⁄16 of a catty 斤[jin1] (old)"],"pinyin":["liang3"],"word":"两"}],"containing_words":[],"sentences":[{"english":"Four hundred taels of silver!","chinese":"此地无银三百两。"}],"related":[{"definition":["trying to hide it makes it more conspicuous (idiom); A cover up only makes matters worse."],"pinyin":["yu4 gai4 mi2 zhang1"],"word":"欲盖弥彰"},{"definition":["to confess without being pressed\/to make a confession without duress"],"pinyin":["bu4 da3 zi4 zhao1"],"word":"不打自招"},{"definition":["to feel guilty as a thief (idiom); to have sth on one's conscience"],"pinyin":["zuo4 zei2 xin1 xu1"],"word":"做贼心虚"},{"definition":["lit. the more you touch things up, the darker they get\/fig. to only make matters worse"],"pinyin":["yue4 miao2 yue4 hei1"],"word":"越描越黑"},{"definition":["lit. a thief crying \"Stop the thief!\" (idiom)\/fig. to accuse sb of a theft and try to sneak away oneself\/to cover up one's misdeeds by shifting the blame onto others"],"pinyin":["zei2 han3 zhuo1 zei2"],"word":"贼喊捉贼"},{"definition":["to have secret motives\/to have a guilty conscience"],"pinyin":["xin1 li5 you3 gui3"],"word":"心里有鬼"},{"definition":["lacking in confidence\/diffident\/to have a guilty conscience"],"pinyin":["xin1 xu1"],"word":"心虚"},{"definition":["lit. to cover one's ears whilst stealing a bell\/to deceive oneself\/to bury one's head in the sand (idiom)"],"pinyin":["yan3 er3 dao4 ling2"],"word":"掩耳盗铃"},{"definition":["to crush one's own foot while trying to maneuver a rock (to a cliff edge, to drop on one's enemy) (idiom)\/hoisted by one's own petard"],"pinyin":["ban1 qi3 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬起石头砸自己的脚"},{"definition":["to move a stone and stub one's toe\/to shoot oneself in the foot (idiom)"],"pinyin":["ban1 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬石头砸自己的脚"},{"definition":["lit. draw legs on a snake (idiom); fig. to ruin the effect by adding sth superfluous\/to overdo it"],"pinyin":["hua4 she2 tian1 zu2"],"word":"画蛇添足"},{"definition":["If you want to condemn sb, don't worry about the pretext (idiom, from Zuozhuan 左傳|左传); one can always trump up a charge against sb\/Give a dog a bad name, then hang him."],"pinyin":["yu4 jia1 zhi1 zui4 , he2 huan4 wu2 ci2"],"word":"欲加之罪，何患无辞"},{"definition":["to twist words and force logic (idiom)\/sophistry\/loud rhetoric making up for fallacious argument\/shoving false arguments down people's throats"],"pinyin":["qiang3 ci2 duo2 li3"],"word":"强词夺理"},{"definition":["to have hidden meaning\/implication\/more than just the apparent meaning\/something hinted"],"pinyin":["hua4 li3 you3 hua4"],"word":"话里有话"},{"definition":["to lie through one's teeth (idiom)\/to talk drivel"],"pinyin":["zheng1 yan3 shuo1 xia1 hua4"],"word":"睁眼说瞎话"},{"definition":["lit. to strike with a muckrake (idiom), cf Pigsy 豬八戒|猪八戒 in Journey to the West 西遊記|西游记; fig. to counterattack\/to make bogus accusations (against one's victim)"],"pinyin":["dao4 da3 yi1 pa2"],"word":"倒打一耙"}]}