{"definition":["for example\/for instance"],"pinyin":["bi3 fang5 shuo1"],"traditional":["比方說"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"比方说","characters":[{"definition":["Belgium\/Belgian\/abbr. for 比利時|比利时[Bi3 li4 shi2]","to compare\/(followed by a noun and adjective) more {adj.} than {noun}\/ratio\/to gesture\/(Taiwan pr. [bi4] in some compounds derived from Classical Chinese)","euphemistic variant of 屄[bi1]"],"pinyin":["Bi3","bi3","bi1"],"word":"比"},{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["fang1","Fang1"],"word":"方"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)","variant of 說|说[shuo1]"],"pinyin":["shui4","shuo1","shuo1"],"word":"说"}],"containing_words":[],"sentences":[{"english":"Women, for instance, make up only 13% of contributors.","chinese":"再比方说女性在参与者中，仅占了13%的比例。"},{"english":"Yeah that's right. I might be a metaphorical sock.","chinese":"对，就是这个意思我可能，比方说，就是一只袜子。"},{"english":"This room, for example, into zillions of tiny little elements.","chinese":"比方说我们可以把这间屋子，分成大量的小单元。"},{"english":"In remembering, names, for instance, a 13)rhyme association works wonders.","chinese":"对于记忆，比方说记名字，押韵联想的作用非凡。"},{"english":"In the nose, cilia help to drain mucus from the nasal cavity down to the throat.","chinese":"比方说鼻子，纤毛可以帮助粘液从鼻腔流到喉咙。"},{"english":"Let’s say you want to do a cash flow statement for the past year.","chinese":"比方说，你想建立去年的现金流量表。"},{"english":"For example, athletes cannot negotiate their [own] contracts,\" he said.","chinese":"比方说，运动员不能就他们的合同进行谈判。"},{"english":"Most likely you've worn many different hats during your career.","chinese":"比方说在你的职业生涯中有很多顶高帽子。"},{"english":"A circle, for example, is symmetrical under all rotations about the center of the circle.","chinese":"比方说，圆是中心对称的。"},{"english":"Missing authorization checks, for example, are the root cause of URL-guessing attacks.","chinese":"比方说缺少授权检查就是URL猜测攻击的根源。"},{"english":"Here, for instance, I wanted to have my girls taught the trade of paper-box makers.","chinese":"比方说，我原想让我的两个女儿去学糊纸盒子的手艺。"},{"english":"Don't just say that you want to lose weight, for instance.","chinese":"比方说，别光说要减肥。"},{"english":"In Standard Poodles , for example, size is getting out of control.","chinese":"比方说，在标准贵宾犬中，大小的问题已经趋于失控。"},{"english":"if you want to be a doctor, like Psychology major.","chinese":"例如说你想当医生，比方说专读心理学专业的。"},{"english":"For example, most of the Chinese people have black hair and eyes and yellow skins.","chinese":"比方说，大部分的中国人是黑头发黑眼睛还有黄皮肤。"},{"english":"For example, the number of elements in the list.","chinese":"比方说链表中的元素个数。"}],"related":[]}