{"definition":["semifinished products"],"pinyin":["mao2 pi1"],"traditional":["毛坯"],"rank":17147.0,"normalized_rank":0.2399087767408672,"fraction":0.00000323209063635004,"cumulative_fraction":0.966896574290664,"word":"毛坯","characters":[{"definition":["hair\/feather\/down\/wool\/mildew\/mold\/coarse or semifinished\/young\/raw\/careless\/unthinking\/nervous\/scared\/(of currency) to devalue or depreciate\/classifier for Chinese fractional monetary unit ( = 角[jiao3] , = one-tenth of a yuan or 10 fen 分[fen1])","surname Mao"],"pinyin":["mao2","Mao2"],"word":"毛"},{"definition":["blank (e.g. for a coin)\/unburnt earthenware\/semifinished product\/Taiwan pr. [pei1]"],"pinyin":["pi1"],"word":"坯"}],"containing_words":[],"sentences":[{"english":"Corrected orientating of bamboo- roughcast is a key of making bamboo chips.","chinese":"竹材毛坯定位是实现竹材定向削片的关键环节。"},{"english":"The house was roughcast I of the Housing is the original purchaser transfers out.","chinese":"我这套房子是毛坯房，是原购买人转让出来的。"},{"english":"The results indicate that the reject rate of the tire valve semifinished products are descended.","chinese":"表明所生产的气门毛坯废品率明显下降。"},{"english":"Actually, after buying semifinished product house decorate, just more bad news energy.","chinese":"其实，买了毛坯房后的装修，才更耗精力。"},{"english":"His daily work is to rough out the lenses for cameras.","chinese":"他每天的工作是制作照相机镜片的毛坯。"},{"english":"A new method to free forge the blank of case of an aircraft made of superalloy has been studied.","chinese":"本文研究了一种自由锻造耐热合金机匣毛坯的新方法。"},{"english":"Roughcast room to \"rest\" is a strong reaction.","chinese":"毛坯房要“寿终正寝”引起的反应是强烈的。"},{"english":"By this technology it can achieve rapid foundry of glass mould's roughcast.","chinese":"用这种工艺可以实现玻璃模具毛坯的快速铸造。"},{"english":"We can supply Parts as blanks, semifinished, or finished products to meet customers' requirements.","chinese":"本公司可按客户的要求供应毛坯，半成品，或成品。"},{"english":"Off the wall, reducing the semifinished materials room, full indoor demolition.","chinese":"隔断墙，还原毛坯房，室内全套拆除。"},{"english":"Yes, China carries out the hardbound room, will cancel the semifinished materials room gradually.","chinese":"是的，中国推行精装房，逐步逐步地会取消毛坯房。"},{"english":"This equipment possesses the ability to produce rapidly solidified fine alloy powders and atomizing deposition preforms.","chinese":"该装置可用于制备快速凝固合金粉末或雾化沉积毛坯。"},{"english":"Housing still can not withdraw from the market, but there will be more substantial decrease.","chinese":"毛坯房尚不能退出市场，但会有较大幅度的减少。"},{"english":"Philips again and then provide a rough room, so users can play their part.","chinese":"然后飞利浦再提供一个毛坯房，让网友自行发挥。"},{"english":"Precision mold and finished C. V. Joint, and the complete shaft.","chinese":"球笼式等速万向节精锻毛坯及成品和半轴总成。"},{"english":"On one wall there are shelves filled with roughly cut wooden bowls that are drying out.","chinese":"在一面墙上，壁橱里放满了正待晾干的毛坯木制碗盆。"}],"related":[{"definition":["finished apartment\/ready apartment"],"pinyin":["xian4 fang2"],"word":"现房"},{"definition":["configuration of rooms in a residence (e.g. 3BR 2 Bath)"],"pinyin":["hu4 xing2"],"word":"户型"},{"definition":["duplex (apartment)"],"pinyin":["yue4 ceng2"],"word":"跃层"},{"definition":["row house\/townhouse\/terrace house"],"pinyin":["pai2 wu1"],"word":"排屋"},{"definition":["building under construction\/commercial property\/real estate (for sale or rent)"],"pinyin":["lou2 pan2"],"word":"楼盘"},{"definition":["second-hand house\/house acquired indirectly through a middle-man"],"pinyin":["er4 shou3 fang2"],"word":"二手房"},{"definition":["square meter\/short for 平方米"],"pinyin":["ping2 mi3"],"word":"平米"},{"definition":["forward delivery apartment\/unfinished housing to be paid for in advance by the buyer and then completed within certain time frame"],"pinyin":["qi1 fang2"],"word":"期房"},{"definition":["hardcover (book)\/elaborately packaged\/opposite: 簡裝|简装[jian3 zhuang1]"],"pinyin":["jing1 zhuang1"],"word":"精装"},{"definition":["brand new house\/bridal chamber"],"pinyin":["xin1 fang2"],"word":"新房"},{"definition":["total price"],"pinyin":["zong3 jia4"],"word":"总价"},{"definition":["slab type building"],"pinyin":["ban3 lou2"],"word":"板楼"},{"definition":["floor"],"pinyin":["lou2 mian4"],"word":"楼面"},{"definition":["square meter"],"pinyin":["ping2 fang1 mi3"],"word":"平方米"},{"definition":["gallery seat (in theater)"],"pinyin":["lou2 zuo4"],"word":"楼座"},{"definition":["(of a building) detached"],"pinyin":["du2 dong4"],"word":"独栋"}]}