{"definition":["Han Chinese person or people"],"pinyin":["Han4 ren2"],"traditional":["漢人"],"rank":32704.0,"normalized_rank":0.4575713905950498,"fraction":7.408364563243058e-7,"cumulative_fraction":0.9925075883801576,"word":"汉人","characters":[{"definition":["man","Han ethnic group\/Chinese (language)\/the Han dynasty (206 BC-220 AD)"],"pinyin":["han4","Han4"],"word":"汉"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"}],"containing_words":[],"sentences":[{"english":"Therefore, a Han Chinese Mid-Autumn Festival subsequently overturned the anniversary of Mongolian rule predecessors.","chinese":"因此，中秋节也是推翻蒙古人统治的汉人纪念活动。"},{"english":"They express great dissatisfaction. Now some of them refer to Chinese people in a derogatory manner.","chinese":"他们都很不满，提到汉人，有些人用了贬损的态度。"},{"english":"The criminals, no matter they are Muslim Uygur or Han Chinese should be put in the prison.","chinese":"罪犯，不管他们是维人或汉人都应进监狱。"},{"english":"\"The Uyghurs will attack any Han they see, \" one man said.","chinese":"维吾尔人会攻击他们遇到的任何汉人，一个人说。"},{"english":"Yue and Hakka are both part of modern Han.","chinese":"越人和客家人都是现代汉人的族群之一。"},{"english":"We moslems also have chinese blood in us .","chinese":"我们回民中间也有汉人的血统。"},{"english":"As Tibetans they feel some kind of subtle discrimination by the Chinese.","chinese":"身为藏人，他们感受到汉人某种难以形容的歧视。"},{"english":"As the major one, the Han people make up 93% of all Chinese people.","chinese":"作为中国的主体民族，汉人占了全中国人口的93%。"},{"english":"Chaoshan if this is the ancient Chinese language in the Central Plains to wave a product of evolution.","chinese":"潮汕话本是古代中原汉人语言在潮地衍变的产物。"},{"english":"Pure-blood Chinese Han ethnicity vanishes.","chinese":"中国纯种汉人已经绝迹。"},{"english":"The most famous classical ones we read now are mainly texts of Han Dynasty.","chinese":"传世的“群经诸子”，主要是汉人的文本。"},{"english":"Still they wore their hair plaited in a queue just like all other Chinese.","chinese":"但是回回仍然像其他汉人一样留着辫子。"},{"english":"Together they had then not only fought non-Muslim Chinese but they had also massacred entire communities.","chinese":"他们不仅一起与非穆斯林汉人作战，也杀其他族的人。"},{"english":"Han Chinese nowadays usually wear Western-style clothing.","chinese":"中国汉人如今常穿西洋式服装。"}],"related":[{"definition":["Mongol"],"pinyin":["Meng3 gu3 ren2"],"word":"蒙古人"},{"definition":["ethnic groups in the north and west of China in ancient times\/foreigner\/barbarian"],"pinyin":["hu2 ren2"],"word":"胡人"},{"definition":["Qidan or Khitan, ethnic group in ancient China, a branch of the Eastern Hu people inhabiting the valley of the Xar Murun River in the upper reaches of the Liao River 遼河|辽河[Liao2 He2]"],"pinyin":["Qi4 dan1"],"word":"契丹"},{"definition":["Mongolia"],"pinyin":["Meng3 gu3"],"word":"蒙古"},{"definition":["Jurchen, a Tungus ethnic group, predecessor of the Manchu ethnic group who founded the Later Jin Dynasty 後金|后金[Hou4 Jin1] and Qing Dynasty"],"pinyin":["Nu:3 zhen1"],"word":"女真"},{"definition":["common term for non-Han peoples in former times, not exclusively derogatory\/barbarian"],"pinyin":["man2 yi2"],"word":"蛮夷"},{"definition":["Tatar (person)"],"pinyin":["Da2 da2 ren2"],"word":"鞑靼人"},{"definition":["Turkic ethnic group"],"pinyin":["Tu1 jue2"],"word":"突厥"},{"definition":["a Manchu"],"pinyin":["Man3 ren2"],"word":"满人"},{"definition":["Tangut branch of the Qiang 羌 ethnic group\/ancient ethnic group who made up the Xixia dynasty 西夏 1038-1227"],"pinyin":["Dang3 xiang4"],"word":"党项"},{"definition":["Manchurian Qing (refers to the Qing dynasty, esp. at its decline, or as an anti-Qing slogan)"],"pinyin":["Man3 Qing1"],"word":"满清"},{"definition":["Huihu, Tang dynasty name of ethnic group corresponding to modern Uighur 維吾爾|维吾尔[Wei2 wu2 er3]"],"pinyin":["Hui2 hu2"],"word":"回鹘"},{"definition":["Xianbei or Xianbi, group of northern nomadic peoples"],"pinyin":["Xian1 bei1"],"word":"鲜卑"},{"definition":["Tartar (various northern tribes in ancient China)\/Tatar (Turkic ethnic group in central Asia)"],"pinyin":["Da2 da2"],"word":"鞑靼"},{"definition":["Eight Banners, military organization of Manchu later Jin dynasty 後金|后金[Hou4 Jin1] from c. 1600, subsequently of the Qing dynasty"],"pinyin":["Ba1 qi2"],"word":"八旗"},{"definition":["Huihe, pre-Tang name of ethnic group corresponding to modern Uighur"],"pinyin":["Hui2 he2"],"word":"回纥"}]}