{"definition":["rivers and mountains are easy to change, man's character much harder"],"pinyin":["jiang1 shan1 yi4 gai3 bing3 xing4 nan2 yi2"],"traditional":["江山易改稟性難移"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"江山易改禀性难移","characters":[{"definition":["river\/CL:條|条[tiao2],道[dao4]","surname Jiang"],"pinyin":["jiang1","Jiang1"],"word":"江"},{"definition":["surname Shan","mountain\/hill\/anything that resembles a mountain\/CL:座[zuo4]\/bundled straw in which silkworms spin cocoons\/gable"],"pinyin":["Shan1","shan1"],"word":"山"},{"definition":["easy\/amiable\/to change\/to exchange\/prefix corresponding to the English adjective suffix \"-able\" or \"-ible\"","surname Yi\/abbr. for 易經|易经[Yi4 jing1], the Book of Changes"],"pinyin":["yi4","Yi4"],"word":"易"},{"definition":["to change\/to alter\/to transform\/to correct"],"pinyin":["gai3"],"word":"改"},{"definition":["to make a report (to a superior)\/to give\/to endow\/to receive\/petition"],"pinyin":["bing3"],"word":"禀"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"},{"definition":["difficult (to...)\/problem\/difficulty\/difficult\/not good","disaster\/distress\/to scold"],"pinyin":["nan2","nan4"],"word":"难"},{"definition":["to move\/to shift\/to change\/to alter\/to remove"],"pinyin":["yi2"],"word":"移"}],"containing_words":[],"sentences":[],"related":[{"definition":["It is hard to change one's essential nature (idiom). You can't change who you are.\/Can the leopard change his spots? (Jeremiah 13:23)"],"pinyin":["ben3 xing4 nan2 yi2"],"word":"本性难移"},{"definition":["lit. a dog can't stop himself from eating shit (idiom)\/fig. bad habits are hard to change"],"pinyin":["gou3 gai3 bu4 liao3 chi1 shi3"],"word":"狗改不了吃屎"},{"definition":["lit. not to shed a tear until one sees the coffin (idiom)\/fig. refuse to be convinced until one is faced with grim reality"],"pinyin":["bu4 jian4 guan1 cai5 bu4 luo4 lei4"],"word":"不见棺材不落泪"},{"definition":["doing good is like a hard climb, doing evil is like an easy fall (idiom)"],"pinyin":["cong2 shan4 ru2 deng1 , cong2 e4 ru2 beng1"],"word":"从善如登，从恶如崩"},{"definition":["old habits are hard to change (idiom)"],"pinyin":["ji1 xi2 nan2 gai3"],"word":"积习难改"},{"definition":["you can't judge a person by appearance, just as you can't measure the sea with a pint pot (idiom)"],"pinyin":["ren2 bu4 ke3 mao4 xiang4 , hai3 shui3 bu4 ke3 dou3 liang2"],"word":"人不可貌相，海水不可斗量"},{"definition":["women love bad guys"],"pinyin":["nan2 ren2 bu4 huai4 , nu:3 ren2 bu4 ai4"],"word":"男人不坏，女人不爱"},{"definition":["one may know a person for a long time without understanding his true nature (idiom)"],"pinyin":["zhi1 ren2 zhi1 mian4 bu4 zhi1 xin1"],"word":"知人知面不知心"},{"definition":["those who handle cinnabar are stained red; those who work with ink are stained black (idiom)\/you are the product of your environment"],"pinyin":["jin4 zhu1 zhe3 chi4 , jin4 mo4 zhe3 hei1"],"word":"近朱者赤，近墨者黑"},{"definition":["a prodigal son returned home is worth more than gold"],"pinyin":["lang4 zi3 hui2 tou2 jin1 bu4 huan4"],"word":"浪子回头金不换"},{"definition":["lit. persons who walk different paths cannot make plans together\/to go separate ways (idiom)"],"pinyin":["dao4 bu4 tong2 bu4 xiang1 wei2 mou2"],"word":"道不同不相为谋"},{"definition":["Look out for yourself, or heaven and earth will combine to destroy you.\/Every man for himself, and the Devil take the hindmost."],"pinyin":["ren2 bu4 wei4 ji3 , tian1 zhu1 di4 mie4"],"word":"人不为己，天诛地灭"},{"definition":["all crows are black (idiom)\/evil people are bad all over the world"],"pinyin":["tian1 xia4 wu1 ya1 yi1 ban1 hei1"],"word":"天下乌鸦一般黑"},{"definition":["hear what he says and observe what he does (idiom, from Analects); judge a person not by his words, but by his actions"],"pinyin":["ting1 qi2 yan2 er2 guan1 qi2 xing2"],"word":"听其言而观其行"},{"definition":["like father, like son (idiom)"],"pinyin":["you3 qi2 fu4 bi4 you3 qi2 zi3"],"word":"有其父必有其子"},{"definition":["Similar things group together, similar people fit together (idiom); Birds of a feather flock together."],"pinyin":["wu4 yi3 lei4 ju4 , ren2 yi3 qun2 fen1"],"word":"物以类聚，人以群分"}]}