{"definition":["Jiangjin suburban district of Chongqing municipality, formerly in Sichuan"],"pinyin":["Jiang1 jin1"],"traditional":["江津"],"rank":23248.0,"normalized_rank":0.3252696822576357,"fraction":0.0000017391774464330601,"cumulative_fraction":0.9814747261964888,"word":"江津","characters":[{"definition":["river\/CL:條|条[tiao2],道[dao4]","surname Jiang"],"pinyin":["jiang1","Jiang1"],"word":"江"},{"definition":["saliva\/sweat\/a ferry crossing\/a ford (river crossing)\/abbr. for Tianjin 天津"],"pinyin":["jin1"],"word":"津"}],"containing_words":[{"definition":["Jiangjin suburban district of Chongqing municipality, formerly in Sichuan"],"pinyin":["Jiang1 jin1 qu1"],"word":"江津区"}],"sentences":[{"english":"He had only to Jiangjin, attend to rest immediately to work.","chinese":"他只要一到江津，顾不上休息就立即投入工作。"},{"english":"The paper is a preliminary study of Liu Yingzhou who was a main representative of Jiangjing gang, Liu began his business at the age of 20.","chinese":"本文对江津帮的主要代表人物刘瀛洲做了初步的研究。"},{"english":"The third part is discussing the sustainable way of land use in Jiangjin.","chinese":"第三部分是探讨了江津区土地可持续利用的途径。"},{"english":"Part three analyzes motive mechanisms of Jiangjin.","chinese":"第三部分分析江津市城镇化动力机制。"},{"english":"The reform and open policy 30 years, the Jiangjin sweet orange development entered the industrial production new stage.","chinese":"改革开放三十年，江津柑桔发展进入了产业化新阶段。"},{"english":"Jiangjin Liquor is the representative of Chuanfa Xiaoqu (Xiaoqu produced by Sichuan techniques).","chinese":"江津白酒是川法小曲酒的代表。"},{"english":"This paper discussed the urban design scheme for the North Jiangjin District, Chongqin City, on the north bank of the Yangtze River.","chinese":"介绍了重庆市江津区北部新区的城市设计理念与方案。"}],"related":[{"definition":["Fuling suburbs of Chongqing municipality, formerly in Sichuan"],"pinyin":["Fu2 ling2"],"word":"涪陵"},{"definition":["Tongliang suburban county in Chongqing municipality, formerly in Sichuan"],"pinyin":["Tong2 liang2"],"word":"铜梁"},{"definition":["Hechuan suburban district of Chongqing municipality, formerly in Sichuan"],"pinyin":["He2 chuan1"],"word":"合川"},{"definition":["Qijiang suburban county in Chongqing municipality, formerly in Sichuan"],"pinyin":["Qi2 jiang1"],"word":"綦江"},{"definition":["Bishan suburban county in Chongqing municipality, formerly in Sichuan"],"pinyin":["Bi4 shan1"],"word":"璧山"},{"definition":["Jiangjin suburban district of Chongqing municipality, formerly in Sichuan"],"pinyin":["Jiang1 jin1 qu1"],"word":"江津区"},{"definition":["Yongchuan suburban district of Chongqing municipality, formerly in Sichuan"],"pinyin":["Yong3 chuan1"],"word":"永川"},{"definition":["Zhong county in Wanzhou suburbs of north Chongqing municipality, formerly in Sichuan"],"pinyin":["Zhong1 xian4"],"word":"忠县"},{"definition":["Banan district of central Chongqing municipality, formerly in Sichuan"],"pinyin":["Ba1 nan2"],"word":"巴南"},{"definition":["Wanzhou suburbs of north Chongqing municipality, formerly in Sichuan"],"pinyin":["Wan4 zhou1"],"word":"万州"},{"definition":["Beibei district of central Chongqing municipality, formerly in Sichuan"],"pinyin":["Bei3 bei4"],"word":"北碚"},{"definition":["Tongnan suburban county in Chongqing municipality, formerly in Sichuan"],"pinyin":["Tong2 nan2"],"word":"潼南"},{"definition":["Qianjiang suburbs of Chongqing municipality\/Qianjiang Miao and Tujia autonomous county"],"pinyin":["Qian2 jiang1"],"word":"黔江"},{"definition":["Liangping county in Wanzhou suburbs of north Chongqing municipality, formerly in Sichuan"],"pinyin":["Liang2 ping2"],"word":"梁平"},{"definition":["Dianjiang county in Fuling suburbs of Chongqing municipality, formerly in Sichuan"],"pinyin":["Dian4 jiang1"],"word":"垫江"},{"definition":["Kai county in Wanzhou suburbs of north Chongqing municipality, formerly in Sichuan"],"pinyin":["Kai1 xian4"],"word":"开县"}]}