{"definition":["Jiang Yan has exhausted his talent (idiom)\/fig. to have used up one's creative powers\/to have writer's block"],"pinyin":["Jiang1 lang2 cai2 jin4"],"traditional":["江郎才盡"],"rank":49904.0,"normalized_rank":0.6982217060988065,"fraction":1.4553969398134634e-7,"cumulative_fraction":0.9989461140849344,"word":"江郎才尽","characters":[{"definition":["river\/CL:條|条[tiao2],道[dao4]","surname Jiang"],"pinyin":["jiang1","Jiang1"],"word":"江"},{"definition":["surname Lang","(arch.) minister\/official\/noun prefix denoting function or status\/a youth"],"pinyin":["Lang2","lang2"],"word":"郎"},{"definition":["ability\/talent\/sb of a certain type\/a capable individual\/only\/only then\/just now","a moment ago\/just now\/(indicating sth happening later than expected)\/(preceded by a clause of condition or reason) not until\/(followed by a numerical clause) only"],"pinyin":["cai2","cai2"],"word":"才"},{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely","to the greatest extent\/(when used before a noun of location) furthest or extreme\/to be within the limits of\/to give priority to"],"pinyin":["jin4","jin3"],"word":"尽"}],"containing_words":[],"sentences":[{"english":"No wonder people are wondering whether Zhang Yimou is too spent after the Olympic Ceremony.","chinese":"难怪，大家怀疑张艺谋是否在奥运后已经江郎才尽。"},{"english":"This advertiser seems to have exhausted his wits.","chinese":"这个广告人似乎是江郎才尽了。"},{"english":"The productive writer cannot produce any more works now.","chinese":"此高产作家现在已经是江郎才尽了。"},{"english":"The write's recent book shows that he is at the end of his tether.","chinese":"写的最新著作，反映了他在江郎才尽。"}],"related":[{"definition":["to exhaust one's limited abilities (idiom)"],"pinyin":["Qian2 lu:2 ji4 qiong2"],"word":"黔驴技穷"},{"definition":["to stir-fry leftover rice\/fig. to rehash the same story\/to serve up the same old product"],"pinyin":["chao3 leng3 fan4"],"word":"炒冷饭"},{"definition":["lit. to use a dog's tail as a substitute for sable fur (idiom)\/fig. a worthless sequel to a masterpiece"],"pinyin":["gou3 wei3 xu4 diao1"],"word":"狗尾续貂"},{"definition":["to pick up what others say (idiom); to pass off other people's opinions as one's own\/to parrot"],"pinyin":["shi2 ren2 ya2 hui4"],"word":"拾人牙慧"},{"definition":["sensationalism\/vulgar claptrap to please the crowds\/playing to the gallery\/demagogy"],"pinyin":["hua2 zhong4 qu3 chong3"],"word":"哗众取宠"},{"definition":["to have talent but no opportunity (idiom)\/to be an unrecognized talent"],"pinyin":["huai2 cai2 bu4 yu4"],"word":"怀才不遇"},{"definition":["things are not as good as they used to be"],"pinyin":["jin1 bu4 ru2 xi1"],"word":"今不如昔"},{"definition":["(of a writing etc) to have no substance (idiom)\/to carry no weight"],"pinyin":["yan2 zhi1 wu2 wu4"],"word":"言之无物"},{"definition":["to moan about imaginary illness\/fussing like a hypochondriac\/fig. sentimental nonsense"],"pinyin":["wu2 bing4 shen1 yin2"],"word":"无病呻吟"},{"definition":["to not know what sb is driving at\/to be unintelligible"],"pinyin":["bu4 zhi1 suo3 yun2"],"word":"不知所云"},{"definition":["cliché\/commonplace\/truism\/stereotype"],"pinyin":["chen2 ci2 lan4 diao4"],"word":"陈词滥调"},{"definition":["lit. Dong Shi imitates Xi Shi's frown (idiom)\/fig. to mimick sb's idiosyncrasies but make a fool of oneself"],"pinyin":["Dong1 Shi1 xiao4 pin2"],"word":"东施效颦"},{"definition":["difficult songs find few singers (idiom)\/highbrow"],"pinyin":["qu3 gao1 he4 gua3"],"word":"曲高和寡"},{"definition":["dud movie"],"pinyin":["lan4 pian4"],"word":"烂片"},{"definition":["to try to draw a tiger but end up with a likeness of a dog (idiom)\/to try to do sth overambitious and end up botching it"],"pinyin":["hua4 hu3 bu4 cheng2 fan3 lei4 quan3"],"word":"画虎不成反类犬"},{"definition":["irrelevant\/beside the point"],"pinyin":["wen2 bu4 dui4 ti2"],"word":"文不对题"}]}