{"definition":["Shenyang subprovincial city and capital of Liaoning province 遼寧省|辽宁省 in northeast China\/old names include Fengtian 奉天, Shengjing 盛京 and Mukden"],"pinyin":["Shen3 yang2"],"traditional":["瀋陽"],"rank":2028.0,"normalized_rank":0.028374351153582476,"fraction":0.00007530927378756336,"cumulative_fraction":0.7325979886721128,"word":"沈阳","characters":[{"definition":["liquid\/to pour","surname Shen\/place name","variant of 沉[chen2]"],"pinyin":["shen3","Shen3","chen2"],"word":"沈"},{"definition":["positive (electric.)\/sun\/male principle (Taoism)\/Yang, opposite: 陰|阴[yin1]"],"pinyin":["yang2"],"word":"阳"}],"containing_words":[{"definition":["Shenyang subprovincial city and capital of Liaoning province 遼寧省|辽宁省 in northeast China\/old names include Fengtian 奉天, Shengjing 盛京 and Mukden"],"pinyin":["Shen3 yang2 shi4"],"word":"沈阳市"},{"definition":["Mukden Palace, aka Shenyang Imperial Palace, the main imperial palace during the early years of the Qing dynasty (1625-1644), a secondary palace in subsequent years, now a museum"],"pinyin":["Shen3 yang2 Gu4 gong1"],"word":"沈阳故宫"}],"sentences":[{"english":"Currently, I'm the general engineer of Shenyang Machine Tools Plant in charge of Quality control.","chinese":"目前我任沈阳机械工具厂总工程师，负责质量控制。"},{"english":"The first group of affordable public housing tenants in Shenyang moved into their new homes yesterday.","chinese":"沈阳市保障性住房第一批住户昨天喜迁新居。"},{"english":"Beiling airport is used by Shenyang Aircraft Corporation for test flights.","chinese":"北陵机场是由沈阳飞机工业公司使用的飞行试验。"},{"english":"This world of difference continues almost a year in Shenyang labour market of migrant workers.","chinese":"沈阳农民工市场的冰火两重天已持续了快一年的时间。"},{"english":"China would likely respond by mobilizing the Shenyang Military Region forces and could send forces into North Korea to control refugee flow.","chinese":"中国可能出动沈阳军区的部队进入朝鲜以控制难民潮。"},{"english":"How far is it from Shenyang Railway Station to Taiyuan Business Street?","chinese":"从沈阳站到太原街有多远的路程？"},{"english":"Traders in pet markets in Shenyang experienced the same conditions as Chen.","chinese":"和陈琦一样无奈的还有沈阳市宠物市场的摊主们。"},{"english":"Room 905, Jinli Mansion, No. 115 Beizhan Road, Shenhe District, Shenyang.","chinese":"沈阳市沈河区北站路115号金利大厦905室。"},{"english":"Shenyang Refrigerator Cars licensing unit series.","chinese":"沈阳牌冷藏车制冷机组系列。"},{"english":"The examined specimens are deposited in the Institute of Entomology, Shenyang Normal University.","chinese":"研究标本保存于沈阳师范大学昆虫研究所。"},{"english":"Students attend college entrance exam at a middle school in Shenyang, Liaoning Province.","chinese":"辽宁沈阳的一所中学内，学生们正在进行高考。"},{"english":"The picture left shows the Shenyang Tiexi new town.","chinese":"左图为沈阳铁西新城。"},{"english":"The Monday venue is the Foreign Affairs Hotel of Shenyang Normal University.","chinese":"周一的口试考场为沈阳师范大学外事宾馆。"},{"english":"It became known as Shen Prefecture in the Jin Dynasty and Shenyang Path in the Yuan Dynasty.","chinese":"它成为县被称为沉金代王朝路径和沈阳元。"},{"english":"Curious to see the changes for myself, I visited Shenyang last month.","chinese":"怀着眼见为实的好奇心，我上个月参观了沈阳。"},{"english":"Dog grain that Shenyang pet shop sells. Where does the pet articles for use toy wait to replenish stock?","chinese":"沈阳宠物店卖的狗粮。宠物用品玩具等在哪进货？"}],"related":[{"definition":["Changchun subprovincial city and capital of Jilin province 吉林省 in northeast China"],"pinyin":["Chang2 chun1"],"word":"长春"},{"definition":["Dalian subprovincial city in Liaoning province 遼寧省|辽宁省 in northeast China"],"pinyin":["Da4 lian2"],"word":"大连"},{"definition":["Anshan prefecture-level city in Liaoning province 遼寧省|辽宁省 in northeast China"],"pinyin":["An1 shan1"],"word":"鞍山"},{"definition":["Harbin, subprovincial city and capital of Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Ha1 er3 bin1"],"word":"哈尔滨"},{"definition":["Yingkou prefecture level city in Liaoning province 遼寧省|辽宁省 in northeast China"],"pinyin":["Ying2 kou3"],"word":"营口"},{"definition":["Tieling prefecture level city in Liaoning province 遼寧省|辽宁省 in northeast China\/also Tieling county"],"pinyin":["Tie3 ling3"],"word":"铁岭"},{"definition":["Dandong prefecture-level city in Liaoning province 遼寧省|辽宁省 in northeast China"],"pinyin":["Dan1 dong1"],"word":"丹东"},{"definition":["Qiqihar prefecture level city in Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Qi2 qi2 ha1 er3"],"word":"齐齐哈尔"},{"definition":["Fushun prefecture-level city in Liaoning province 遼寧省|辽宁省 in northeast China\/also Fushun county"],"pinyin":["Fu3 shun4"],"word":"抚顺"},{"definition":["Jinzhou prefecture-level city in Liaoning province 遼寧省|辽宁省 in northeast China"],"pinyin":["Jin3 zhou1"],"word":"锦州"},{"definition":["Liaoyang prefecture-level city in Liaoning province 遼寧省|辽宁省 in northeast China"],"pinyin":["Liao2 yang2"],"word":"辽阳"},{"definition":["Fuxin prefecture-level city in Liaoning province 遼寧省|辽宁省 in northeast China"],"pinyin":["Fu4 xin1"],"word":"阜新"},{"definition":["Shenyang subprovincial city and capital of Liaoning province 遼寧省|辽宁省 in northeast China\/old names include Fengtian 奉天, Shengjing 盛京 and Mukden"],"pinyin":["Shen3 yang2 shi4"],"word":"沈阳市"},{"definition":["Panjin prefecture level city in Liaoning province 遼寧省|辽宁省 in northeast China"],"pinyin":["Pan2 jin3"],"word":"盘锦"},{"definition":["Shijiazhuang prefecture level city and capital of Hebei Province 河北省[He2 bei3 Sheng3] in north China"],"pinyin":["Shi2 jia1 zhuang1"],"word":"石家庄"},{"definition":["Hohhot prefecture-level city, capital of Inner Mongolia autonomous region 內蒙古自治區|内蒙古自治区[Nei4 meng3 gu3 Zi4 zhi4 qu1]"],"pinyin":["Hu1 he2 hao4 te4"],"word":"呼和浩特"}]}