{"definition":["to settle\/to precipitate (solid sediment out of a solution)"],"pinyin":["chen2 dian4"],"traditional":["沉澱"],"rank":11793.0,"normalized_rank":0.1649993703916164,"fraction":0.0000062914897401224135,"cumulative_fraction":0.9426377065816001,"word":"沉淀","characters":[{"definition":["to submerge\/to immerse\/to sink\/to keep down\/to lower\/to drop\/deep\/profound\/heavy","see 黑沉沉[hei1 chen1 chen1]"],"pinyin":["chen2","chen1"],"word":"沉"},{"definition":["sediment\/precipitate","shallow water"],"pinyin":["dian4","dian4"],"word":"淀"}],"containing_words":[{"definition":["precipitate\/solid sediment"],"pinyin":["chen2 dian4 wu4"],"word":"沉淀物"}],"sentences":[{"english":"In male flowers, style cells containing no calcium precipitation soon began to degenerate.","chinese":"缺乏钙沉淀颗粒的雄花花柱细胞迅速解体。"},{"english":"The main factors influencing precipitation of electrophoretic coatings and their solving methods are given in this article.","chinese":"介绍了影响电泳漆沉淀的主要因素和采取的对策。"},{"english":"Commercial scale test of selective precipitation method for Mo removal from tungstate solution;","chinese":"研究了用硫酸铜沉淀法除去粗钨酸钠溶液中钼的方法。"},{"english":"Calcium precipitates in style cell and vascular tissues of male flowers was sparse and seldom seen.","chinese":"雄花花柱细胞和维管细胞中钙沉淀颗粒很少。"},{"english":"Stir the coffee to settle the grounds .","chinese":"把咖啡搅一搅好让渣滓沉淀。"},{"english":"A honey character, from lees contact, gives the wine depth.","chinese":"酒渣沉淀后获取的蜜汁，赋予了其丰富的酒体。"},{"english":"Barium carbonate was prepared by using common precipitation method.","chinese":"采用共沉淀法合成了碳酸钡粒子。"},{"english":"In this method the interference come from inorganic sulfide was removed by Copper acetate homogenous precipitation met…","chinese":"水中无机硫化物的干扰用乙酸铜均匀沉淀法去除。"},{"english":"This precipitated a syncretistic controversy that was to last for many years.","chinese":"这沉淀一融的争议，这是持续了很多年。"},{"english":"It is revealed that in double diffusion and immunoelectrophoresis the product yielded a single precipitating line.","chinese":"以双扩及免疫电泳鉴定，均呈现单一沉淀线。"},{"english":"The plasma sample was directly injected for determination after being deproteinized with perchloric acid.","chinese":"血浆样品用高氯酸沉淀蛋白后直接进样。"},{"english":"Methods Polysaccharides of Codium fragile were extracted by using hot water extraction and ethanol precipitation.","chinese":"方法采用热水浸提乙醇沉淀法制备刺松藻多糖。"},{"english":"The dregs settled and the liquid became clear.","chinese":"渣滓沉淀下来，液体变清了。"},{"english":"To forge the obscure into 2D images, while sludging through the cultural molasses.","chinese":"从模糊建立到二维图像，而通过文化糖蜜沉淀。"},{"english":"The rough extract of Pinggu mushroom PPO was obtained by ammonium sulfate precipitation method.","chinese":"采用硫酸铵沉淀法得到平菇多酚氧化酶粗提液。"},{"english":"Low spreading angles of the turbulent jet restrict the lateral dispersion of sediment particles.","chinese":"乱流小地分布规模限制啦沉淀粒子在侧面地分布。"}],"related":[{"definition":["deposits accumulated over long periods\/fig. valuable experience, accumulated wisdom"],"pinyin":["ji1 dian4"],"word":"积淀"},{"definition":["to accumulate\/accumulation\/cumulative\/cumulatively"],"pinyin":["ji1 lei3"],"word":"积累"},{"definition":["sediment\/deposit\/sedimentation (geology)"],"pinyin":["chen2 ji1"],"word":"沉积"},{"definition":["to accumulate over a long period of time"],"pinyin":["ri4 ji1 yue4 lei3"],"word":"日积月累"},{"definition":["for years\/over the years"],"pinyin":["jing1 nian2 lei3 yue4"],"word":"经年累月"},{"definition":["to be contaminated\/to be gradually influenced"],"pinyin":["jin4 ran3"],"word":"浸染"},{"definition":["years\/time"],"pinyin":["sui4 yue4"],"word":"岁月"},{"definition":["to accumulate"],"pinyin":["lei3 ji1"],"word":"累积"},{"definition":["to permeate\/to percolate\/fig. to saturate (with emotion)"],"pinyin":["jin4 run4"],"word":"浸润"},{"definition":["to cleanse\/to scrub\/to scour\/to wash down\/to erode\/to wash away"],"pinyin":["chong1 shua1"],"word":"冲刷"},{"definition":["to sharpen on grindstone\/to improve oneself by practice"],"pinyin":["mo2 li4"],"word":"磨砺"},{"definition":["to flow"],"pinyin":["liu2 tang3"],"word":"流淌"},{"definition":["to condense\/to solidify\/to coagulate\/clot (of blood)"],"pinyin":["ning2 jie2"],"word":"凝结"},{"definition":["polish\/grind"],"pinyin":["da3 mo2"],"word":"打磨"},{"definition":["to coalesce\/to gather together\/to amass"],"pinyin":["ji1 ju4"],"word":"积聚"},{"definition":["to concentrate (a liquid)\/concentration\/espresso coffee\/abbr. for 意式濃縮咖啡|意式浓缩咖啡"],"pinyin":["nong2 suo1"],"word":"浓缩"}]}