{"definition":["nothing\/it doesn't matter\/it's nothing\/never mind"],"pinyin":["mei2 shen2 me5"],"traditional":["沒什麼"],"rank":3889.0,"normalized_rank":0.054412155639192425,"fraction":0.00003439656223985022,"cumulative_fraction":0.8268955193424732,"word":"没什么","characters":[{"definition":["(negative prefix for verbs)\/have not\/not","drowned\/to end\/to die\/to inundate"],"pinyin":["mei2","mo4"],"word":"没"},{"definition":["ten (used in fractions, writing checks etc)\/assorted\/miscellaneous","what"],"pinyin":["shi2","shen2"],"word":"什"},{"definition":["variant of 麼|么[me5]","exclamatory final particle","interrogative final particle","suffix, used to form interrogative 什麼|什么[shen2 me5], what?, indefinite 這麼|这么[zhe4 me5] thus, etc"],"pinyin":["me5","ma2","ma5","me5"],"word":"么"}],"containing_words":[],"sentences":[{"english":"So he can't know, yet, that death doesn't really mean anything in comics.","chinese":"因而至今他也不知道死亡在漫画中没什么实际意义。"},{"english":"Zhou Lan did well and made no serious mistakes.","chinese":"周兰做得很好，基本上没什么差错。"},{"english":"It’s no big deal. I don’t mind helping you out.","chinese":"这没什么大不了的，我不介意帮助你摆脱困境。"},{"english":"Nothing pleased my mother more than to be told how good were her dishes.","chinese":"夸母亲的菜做得多好，没什么比这更使她高兴的了。"},{"english":"It is nothing special, it feels cold in my stomach,\" said Siti Qomariyah, who has been eating the snacks since she was a child.","chinese":"这没什么特别的，感觉胃里凉凉的。"},{"english":"The other, Albert Ho Chun-yan, is thus a no-hoper.","chinese":"如此看来，另一位参选者何俊仁是没什么希望了。"},{"english":"The front-of-house didn't think too much of it, especially the staff from overseas.","chinese":"前台都没什么感觉，特别是那些外籍员工。"},{"english":"Spring festival is over, nothing special happened. I am just sleeping, eating then eating, sleeping.","chinese":"春节假期过去了，没什么特别，只不过是吃吃睡睡。"},{"english":"No, I don't think I have any plans. Why do you ask?","chinese":"不忙，我想我没什么安排。你问来干嘛？"},{"english":"No task is beneath you when you have a servant’s heart.","chinese":"只有你有一颗仆人的心，就没什么工作你不愿作了。"},{"english":"But really there's nothing to be afraid of says Bogen.","chinese":"但是真的没什么好怕的，伯根说。"},{"english":"That will be fine, then, what about these chocolate candies.","chinese":"那就没什么关系。这些巧克力糖呢？"},{"english":"Except for the weapons and Japanese trucks, it could be 600 years ago.","chinese":"除了武器与日本卡车，它就跟600年前没什么两样。"},{"english":"He comes from a completely uncultured, lower middle-class family.","chinese":"他来自中下阶层一个根本没什么文化的家庭。"},{"english":"Nothing will be able to erase our wonderful memories, we will remember them forever.","chinese":"没什么能抹掉我们美好的记忆，我们会永远铭记在心。"},{"english":"Shen resists the frost wouldn t do him any good impression left early.","chinese":"沈傲霜对他没什么好印象早早的就走了。"}],"related":[{"definition":["to speak the truth\/truth to tell\/frankly"],"pinyin":["shuo1 shi2 hua4"],"word":"说实话"},{"definition":["(negative prefix for verbs)\/have not\/not","drowned\/to end\/to die\/to inundate"],"pinyin":["mei2","mo4"],"word":"没"},{"definition":["contrary to what one might expect\/actually\/contrariwise\/why don't you"],"pinyin":["dao4 shi5"],"word":"倒是"},{"definition":["not very\/not particularly"],"pinyin":["bu4 zen3 me5"],"word":"不怎么"},{"definition":["to be indifferent\/not to matter\/cannot be said to be"],"pinyin":["wu2 suo3 wei4"],"word":"无所谓"},{"definition":["modal particle indicating that sth is obvious\/particle indicating a pause for emphasis"],"pinyin":["ma5"],"word":"嘛"},{"definition":["a modal particle indicating (that's all, only, nothing much)","a modal particle indicating (don't mind it, ok)"],"pinyin":["ba4 le5","ba4 liao3"],"word":"罢了"},{"definition":["a little\/somewhat"],"pinyin":["you3 yi1 dian3"],"word":"有一点"},{"definition":["not in the least\/to completely lack"],"pinyin":["hao2 wu2"],"word":"毫无"},{"definition":["straight\/erect\/to stick out (a part of the body)\/to (physically) straighten up\/to support\/to withstand\/outstanding\/(coll.) quite\/very\/classifier for machine guns"],"pinyin":["ting3"],"word":"挺"},{"definition":["a little"],"pinyin":["you3 dian3"],"word":"有点"},{"definition":["it doesn't matter"],"pinyin":["mei2 guan1 xi5"],"word":"没关系"},{"definition":["to appear to be\/to seem as if"],"pinyin":["mao4 si4"],"word":"貌似"},{"definition":["anyway\/in any case\/to come over from the enemy's side"],"pinyin":["fan3 zheng4"],"word":"反正"},{"definition":["to say again\/to put off a discussion until later\/moreover\/what's more\/besides"],"pinyin":["zai4 shuo1"],"word":"再说"},{"definition":["only\/merely\/nothing but\/no more than\/it's just that ..."],"pinyin":["zhi3 bu5 guo4"],"word":"只不过"}]}