{"definition":["to decline\/to wane"],"pinyin":["mo4 luo4"],"traditional":["沒落"],"rank":19870.0,"normalized_rank":0.27800707959649096,"fraction":0.000002427899889967656,"cumulative_fraction":0.9745246484663008,"word":"没落","characters":[{"definition":["(negative prefix for verbs)\/have not\/not","drowned\/to end\/to die\/to inundate"],"pinyin":["mei2","mo4"],"word":"没"},{"definition":["to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","colloquial reading for 落[luo4] in certain compounds","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["luo4","lao4","la4"],"word":"落"}],"containing_words":[],"sentences":[{"english":"Then decline tone, she is a big mouth to fight over.","chinese":"话没落音，她就是一个大嘴巴打过来。"},{"english":"How the mighty have fallen.","chinese":"有势力的人是如何没落的。"},{"english":"The declining of \"Brand Kings\"shows the brand crisis of the business administration in China's enterprises.","chinese":"“标王”的没落说明中国企业面临着品牌危机。"},{"english":"A Brahmanic revival appears to have occurred with the fall of the Mauryas.","chinese":"婆罗门教的复兴是出现在孔雀王朝没落的时期。"},{"english":"He might not mind being placeless, but I mind.","chinese":"他也许不介意这种没着没落的状态，但是我介意。"},{"english":"The United States is consequently online chase fadeout to fall later.","chinese":"因而美国在线后来逐渐没落了。"},{"english":"The capital, Jerusalem, fell.","chinese":"首都耶路撒冷也随之没落。"},{"english":"It started to fall. In the liberation war, and was cracked down after New China was founded.","chinese":"解放战争时期哥老会走向没落，新中国成立后被摧毁。"},{"english":"Words sound's still declines, but discovering this person is Ping Jue.","chinese":"话音还没落，却发现这个人是冯爵。"},{"english":"He spent two years wandering about the country at loose ends.","chinese":"他没着没落地绕着全国到处逛游了2年。"},{"english":"To the Yuan Dynasty, Ding finally and gradually disappeared.","chinese":"到了元朝，定窑终于逐渐没落。"},{"english":"The household ruin was thus full and orbicular.","chinese":"这家就这样地完全没落了。"},{"english":"Great powers have retrenched before: Britain for instance.","chinese":"强国的没落以前有过，英国就是其中一个。"},{"english":"However this flourishing backside, the decline of many helpless?","chinese":"然而这繁华的背后，没落了几许的无奈呢？"},{"english":"Education will not, the world is full educative derelicts.","chinese":"教育不可以，受过良好教育的没落者更是随处可见。"},{"english":"Alarmists usually regard the rising generation as a falling one.","chinese":"危害耸听的人总是把新兴一代当成没落的一代。"}],"related":[{"definition":["to fall\/to drop\/to decline\/to deteriorate\/to go downhill"],"pinyin":["shuai1 luo4"],"word":"衰落"},{"definition":["to decline\/to wane\/to decay\/to deteriorate"],"pinyin":["shuai1 bai4"],"word":"衰败"},{"definition":["(literary) to decline\/to wane\/title of a section in the Book of Songs 詩經|诗经[Shi1 jing1]"],"pinyin":["shi4 wei1"],"word":"式微"},{"definition":["(of status or wealth) to decline\/(of buildings etc) to become dilapidated\/run-down\/(of plants) to wilt"],"pinyin":["bai4 luo4"],"word":"败落"},{"definition":["to flourish\/to thrive"],"pinyin":["xing1 sheng4"],"word":"兴盛"},{"definition":["to die out\/to wither away"],"pinyin":["xiao1 wang2"],"word":"消亡"},{"definition":["all the rage for a time\/grand fashion for a limited time"],"pinyin":["sheng4 ji2 yi1 shi2"],"word":"盛极一时"},{"definition":["to decline\/to wane\/weakened\/enfeebled\/in decline"],"pinyin":["shuai1 wei1"],"word":"衰微"},{"definition":["to rise abruptly (to a towering position)\/to tower over\/to spring up\/to emerge suddenly\/the emergence (e.g. of a power)"],"pinyin":["jue2 qi3"],"word":"崛起"},{"definition":["to decline\/to die out\/decline and fall"],"pinyin":["shuai1 wang2"],"word":"衰亡"},{"definition":["rivers pour away by the day (idiom); going from bad to worse\/deteriorating day by day"],"pinyin":["jiang1 he2 ri4 xia4"],"word":"江河日下"},{"definition":["to vanish without trace (idiom)\/to lie low"],"pinyin":["xiao1 sheng1 ni4 ji4"],"word":"销声匿迹"},{"definition":["uninspired\/dejected\/discouraged"],"pinyin":["shuai1 tui2"],"word":"衰颓"},{"definition":["to degenerate\/impoverished\/to fall (into poverty)\/to be reduced (to begging)"],"pinyin":["lun2 luo4"],"word":"沦落"},{"definition":["to have no qualified successors to carry on one's undertaking"],"pinyin":["hou4 ji4 wu2 ren2"],"word":"后继无人"},{"definition":["to rise\/to spring up\/to burgeon\/to be aroused\/to come into vogue"],"pinyin":["xing1 qi3"],"word":"兴起"}]}