{"definition":["to degenerate\/impoverished\/to fall (into poverty)\/to be reduced (to begging)"],"pinyin":["lun2 luo4"],"traditional":["淪落"],"rank":18669.0,"normalized_rank":0.26120353140346697,"fraction":0.0000027401460338253293,"cumulative_fraction":0.971422514120306,"word":"沦落","characters":[{"definition":["to sink (into ruin, oblivion)\/to be reduced to"],"pinyin":["lun2"],"word":"沦"},{"definition":["to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","colloquial reading for 落[luo4] in certain compounds","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["luo4","lao4","la4"],"word":"落"}],"containing_words":[],"sentences":[{"english":"They were reduced to begging along the street in the end.","chinese":"最后他们沦落到沿街乞讨。"},{"english":"China is always so hot in the summer season; once again descend into a palace otaku.","chinese":"中国的夏天永远是那么炎热，再一次沦落成深宫宅男。"},{"english":"He impecunious is demoralized, be reduced to poverty does beggar to street.","chinese":"身无分文的他意志消沉，沦落到街头做乞丐。"},{"english":"LaoJiangHu ghost uncle, is before the sword, is now home TiTouJiang descends to the porter.","chinese":"老江湖鬼叔，以前是刀家的门房，现已沦落为剃头匠。"},{"english":"This girl goes to Beijing from the driftage after this world of Hunan high mountain runs away from home.","chinese":"这名女子是从中国湖南岳阳离家外岀后沦落到首都的。"},{"english":"He will never be dishonest even though hebe reduced to poverty.","chinese":"他决不会不诚实，纵然沦落到贫困境地。"},{"english":"I never thought he would come down to begging.","chinese":"我怎么也想不到他会沦落到乞讨为生。"},{"english":"And you with a smile, let me fall in your tender.","chinese":"而你回眸一笑，让我沦落在你的温柔。"},{"english":"Miss river's clan, the grandpas all degenerated to the degree of gripping a package of elder brother amplitude.","chinese":"就想江族，爷爷都沦落到抓包哥哥的程度了。"},{"english":"The Depression reduced many to begging on street corners.","chinese":"大萧条使许多人沦落到街头乞讨。"},{"english":"Mr. zhuang, you want a \"girl\" to be your protector?","chinese":"庄先生，你已经沦落到要一个女孩子来保护你了吗？"},{"english":"A person live in love, why reduced.","chinese":"缐一个人好好过，何苦在爱情里沦落。"},{"english":"But the poet more lives, medium, but Jun.","chinese":"但是诗人多薄命，就中沦落不过君。"},{"english":"Love is not the two lovers, will have a reduced wilderness.","chinese":"爱情没能两情相悦，必然会有一个人沦落荒野。"},{"english":"The poor man was reduced to begging.","chinese":"那可怜的人沦落为乞丐。"},{"english":"As you well know, Volkswagen has given in to the Dark Side.","chinese":"就像你知道的那样，大众汽车已经沦落进了黑暗势力。"}],"related":[{"definition":["to sink down to\/to be reduced to (sth inferior)"],"pinyin":["lun2 wei2"],"word":"沦为"},{"definition":["down and out\/in dire straits\/unrestrained\/unconventional\/also pr. [luo4 tuo4]"],"pinyin":["luo4 po4"],"word":"落魄"},{"definition":["to abandon oneself (idiom)\/to let oneself go"],"pinyin":["zi4 gan1 duo4 luo4"],"word":"自甘堕落"},{"definition":["to decline\/to wane"],"pinyin":["mo4 luo4"],"word":"没落"},{"definition":["ending up as\/leading to\/resulting in\/in total"],"pinyin":["luo4 de5"],"word":"落得"},{"definition":["stage\/degree (to which a situation has evolved)\/situation\/leeway"],"pinyin":["di4 bu4"],"word":"地步"},{"definition":["to sink (into ruin, oblivion)\/to be reduced to"],"pinyin":["lun2"],"word":"沦"},{"definition":["wretched situation"],"pinyin":["can3 jing4"],"word":"惨境"},{"definition":["circumstances"],"pinyin":["jing4 di4"],"word":"境地"},{"definition":["this day and age (dialect)"],"pinyin":["jin1 shi2 jin1 ri4"],"word":"今时今日"},{"definition":["to degrade\/to degenerate\/to become depraved\/corrupt\/a fall from grace"],"pinyin":["duo4 luo4"],"word":"堕落"},{"definition":["(of status or wealth) to decline\/(of buildings etc) to become dilapidated\/run-down\/(of plants) to wilt"],"pinyin":["bai4 luo4"],"word":"败落"},{"definition":["to be penniless"],"pinyin":["yi1 wen2 bu4 ming2"],"word":"一文不名"},{"definition":["without a penny to one's name\/penniless\/stony-broke"],"pinyin":["bu4 ming2 yi1 wen2"],"word":"不名一文"},{"definition":["to be of no interest to anyone (idiom)"],"pinyin":["wu2 ren2 wen4 jin1"],"word":"无人问津"},{"definition":["to fall\/to drop\/to decline\/to deteriorate\/to go downhill"],"pinyin":["shuai1 luo4"],"word":"衰落"}]}