{"definition":["to treat the symptoms but not the root cause"],"pinyin":["zhi4 biao1 bu4 zhi4 ben3"],"traditional":["治標不治本"],"rank":32580.0,"normalized_rank":0.4558364697158368,"fraction":7.490112034285739e-7,"cumulative_fraction":0.992415211986148,"word":"治标不治本","characters":[{"definition":["to rule\/to govern\/to manage\/to control\/to harness (a river)\/to treat (a disease)\/to wipe out (a pest)\/to punish\/to research"],"pinyin":["zhi4"],"word":"治"},{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"标"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to rule\/to govern\/to manage\/to control\/to harness (a river)\/to treat (a disease)\/to wipe out (a pest)\/to punish\/to research"],"pinyin":["zhi4"],"word":"治"},{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"}],"containing_words":[],"sentences":[{"english":"But such bond-buying is a temporary palliative.","chinese":"但这种债券买法治标不治本。"},{"english":"Scotch tape may solve the problem temporarily, but it cannot take the problem away.","chinese":"胶纸或许能暂时地解决问题，但是它治标不治本。"},{"english":"A bailout will not address the fundamental causes of Greece's fiscal problems.","chinese":"金援对于希腊的财政问题来说只是治标不治本。"},{"english":"“Caring is good, but it treats the symptoms without addressing the root cause of the problem,” says Ye Jingzhong.","chinese":"叶精忠说，“关爱是好的，但这治标不治本。”"},{"english":"“Caring is good, but it treats the symptoms without addressing the root cause of the problem, ” says Ye Jingzhong.","chinese":"叶精忠说，“关爱是好的，但这治标不治本。”"},{"english":"Such actions are palliatives.","chinese":"这样的行动是治标不治本的。"},{"english":"However, these ways could not deal with the true problem.","chinese":"这些解决办法治标不治本，没有抓住问题的实质。"},{"english":"But critics say the circular only \"scratches the surface of a problem\".","chinese":"但是评论家们认为该项通知“治标不治本”。"}],"related":[{"definition":["to treat only the symptoms but not the root cause"],"pinyin":["zhi4 biao1"],"word":"治标"},{"definition":["to take radical measures\/to get to the root (of a problem etc)"],"pinyin":["zhi4 ben3"],"word":"治本"},{"definition":["to bring under permanent control\/to effect a radical cure"],"pinyin":["gen1 zhi4"],"word":"根治"},{"definition":["to eradicate"],"pinyin":["gen1 chu2"],"word":"根除"},{"definition":["to treat the symptoms\/reactive (rather than proactive)"],"pinyin":["tou2 tong4 yi1 tou2"],"word":"头痛医头"},{"definition":["to treat the symptoms rather than getting to the root of the problem (proverb)\/reactive (rather than proactive)"],"pinyin":["tou2 tong4 yi1 tou2 , jiao3 tong4 yi1 jiao3"],"word":"头痛医头，脚痛医脚"},{"definition":["lit. set up a pole and see the shadow (idiom); fig. instant effect\/quick results"],"pinyin":["li4 gan1 jian4 ying3"],"word":"立竿见影"},{"definition":["to get sth done once and for all"],"pinyin":["yi1 lao2 yong3 yi4"],"word":"一劳永逸"},{"definition":["lit. put up a pole and see the shadow (idiom); to expect instant results"],"pinyin":["li4 gan1 jian4 ying3"],"word":"立杆见影"},{"definition":["to have the desired effect"],"pinyin":["jian4 xiao4"],"word":"见效"},{"definition":["lit. drinking poison in the hope of quenching one's thirst (idiom)\/fig. a supposed remedy that only makes matters worse"],"pinyin":["yin3 zhen4 zhi3 ke3"],"word":"饮鸩止渴"},{"definition":["correct diagnosis\/to prescribe the right cure for an illness\/to suit the medicine to the illness"],"pinyin":["dui4 zheng4"],"word":"对症"},{"definition":["plan of convenience (idiom); stop-gap measure\/makeshift stratagem\/interim step"],"pinyin":["quan2 yi2 zhi1 ji4"],"word":"权宜之计"},{"definition":["ineradicable disease\/fig. deep-seated problem\/perennial problem"],"pinyin":["wan2 ji2"],"word":"顽疾"},{"definition":["to no avail\/achieving nothing\/totally ineffective\/to have no effect\/to fall flat (esp. of joke or speech that is completely ignored)"],"pinyin":["hao2 wu2 xiao4 guo3"],"word":"毫无效果"},{"definition":["efficacious\/useful"],"pinyin":["guan3 yong4"],"word":"管用"}]}