{"definition":["to take radical measures\/to get to the root (of a problem etc)"],"pinyin":["zhi4 ben3"],"traditional":["治本"],"rank":17573.0,"normalized_rank":0.2458690694388091,"fraction":0.0000030747267545928767,"cumulative_fraction":0.9682401808339388,"word":"治本","characters":[{"definition":["to rule\/to govern\/to manage\/to control\/to harness (a river)\/to treat (a disease)\/to wipe out (a pest)\/to punish\/to research"],"pinyin":["zhi4"],"word":"治"},{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"}],"containing_words":[{"definition":["to treat the symptoms but not the root cause"],"pinyin":["zhi4 biao1 bu4 zhi4 ben3"],"word":"治标不治本"},{"definition":["the Greenwich meridian"],"pinyin":["Ge2 lin2 ni2 zhi4 ben3 chu1 zi3 wu3 xian4"],"word":"格林尼治本初子午线"}],"sentences":[{"english":"But such bond-buying is a temporary palliative.","chinese":"但这种债券买法治标不治本。"},{"english":"Scotch tape may solve the problem temporarily, but it cannot take the problem away.","chinese":"胶纸或许能暂时地解决问题，但是它治标不治本。"},{"english":"A bailout will not address the fundamental causes of Greece's fiscal problems.","chinese":"金援对于希腊的财政问题来说只是治标不治本。"},{"english":"“Caring is good, but it treats the symptoms without addressing the root cause of the problem,” says Ye Jingzhong.","chinese":"叶精忠说，“关爱是好的，但这治标不治本。”"},{"english":"Therefore, to contain local protectionism system innovation is required.","chinese":"以制度创新来遏制地方保护主义是治本之举。"},{"english":"“Caring is good, but it treats the symptoms without addressing the root cause of the problem, ” says Ye Jingzhong.","chinese":"叶精忠说，“关爱是好的，但这治标不治本。”"},{"english":"Such actions are palliatives.","chinese":"这样的行动是治标不治本的。"},{"english":"But in my opinion, these stopgap measures, not cure.","chinese":"但在我看来，这些治标的措施，无法治本。"},{"english":"We need to intensify our effort to fight corruption and to prevent and eliminate its root causes.","chinese":"加大治本力度，从源头上预防和治理腐败。"},{"english":"However, these ways could not deal with the true problem.","chinese":"这些解决办法治标不治本，没有抓住问题的实质。"},{"english":"This was what Marshall had meant when he talked of \"a cure rather than a palliative, \" nothing less.","chinese":"而这正是马歇尔“要治本而不要治标”的本意。"},{"english":"But critics say the circular only \"scratches the surface of a problem\".","chinese":"但是评论家们认为该项通知“治标不治本”。"}],"related":[{"definition":["to treat only the symptoms but not the root cause"],"pinyin":["zhi4 biao1"],"word":"治标"},{"definition":["to treat the symptoms but not the root cause"],"pinyin":["zhi4 biao1 bu4 zhi4 ben3"],"word":"治标不治本"},{"definition":["to bring under permanent control\/to effect a radical cure"],"pinyin":["gen1 zhi4"],"word":"根治"},{"definition":["to eradicate"],"pinyin":["gen1 chu2"],"word":"根除"},{"definition":["to treat the symptoms\/reactive (rather than proactive)"],"pinyin":["tou2 tong4 yi1 tou2"],"word":"头痛医头"},{"definition":["to have the desired effect"],"pinyin":["jian4 xiao4"],"word":"见效"},{"definition":["correct diagnosis\/to prescribe the right cure for an illness\/to suit the medicine to the illness"],"pinyin":["dui4 zheng4"],"word":"对症"},{"definition":["lit. to prescribe the right medicine for an illness (idiom); fig. to study a problem to find the right way to solve it\/to take appropriate steps"],"pinyin":["dui4 zheng4 xia4 yao4"],"word":"对症下药"},{"definition":["to treat the symptoms rather than getting to the root of the problem (proverb)\/reactive (rather than proactive)"],"pinyin":["tou2 tong4 yi1 tou2 , jiao3 tong4 yi1 jiao3"],"word":"头痛医头，脚痛医脚"},{"definition":["to rule\/to govern\/to manage\/to control\/to harness (a river)\/to treat (a disease)\/to wipe out (a pest)\/to punish\/to research"],"pinyin":["zhi4"],"word":"治"},{"definition":["lit. set up a pole and see the shadow (idiom); fig. instant effect\/quick results"],"pinyin":["li4 gan1 jian4 ying3"],"word":"立竿见影"},{"definition":["to apply a treatment\/to undertake a therapy"],"pinyin":["shi1 zhi4"],"word":"施治"},{"definition":["good medicine\/effective prescription\/fig. good plan\/effective strategy"],"pinyin":["liang2 fang1"],"word":"良方"},{"definition":["lit. put up a pole and see the shadow (idiom); to expect instant results"],"pinyin":["li4 gan1 jian4 ying3"],"word":"立杆见影"},{"definition":["stubborn illness\/disease that is difficult to treat"],"pinyin":["wan2 zheng4"],"word":"顽症"},{"definition":["lit. the disease is cured the moment the medicine is taken (idiom)\/fig. (of a medical treatment) to give instant results\/(of a solution or method) highly effective"],"pinyin":["yao4 dao4 bing4 chu2"],"word":"药到病除"}]}