{"definition":["to govern\/to administer\/to manage\/to control\/governance"],"pinyin":["zhi4 li3"],"traditional":["治理"],"rank":1835.0,"normalized_rank":0.025674030752871717,"fraction":0.00008474614345367982,"cumulative_fraction":0.7171355926192252,"word":"治理","characters":[{"definition":["to rule\/to govern\/to manage\/to control\/to harness (a river)\/to treat (a disease)\/to wipe out (a pest)\/to punish\/to research"],"pinyin":["zhi4"],"word":"治"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"}],"containing_words":[{"definition":["corporate governance"],"pinyin":["gong1 si1 zhi4 li3"],"word":"公司治理"}],"sentences":[{"english":"This article clarifies the value of governance to application development teams.","chinese":"本文会向应用程序开发团队阐明治理的价值。"},{"english":"Frontline turnover is one of the biggest headaches for call center managers.","chinese":"对治理者来说，一线坐席辞职是最为头痛的标题。"},{"english":"Governance plays an important role in Program Management.","chinese":"治理在程序管理中扮演重要角色。"},{"english":"All sorts of commonly-used technologies for controlling Cr-containing wastewater are presented .","chinese":"介绍目前比较常用的含铬废水的种种治理技术。"},{"english":"This paper studies on the relationship between the Ma Wusu sands control and particle board′s building.","chinese":"本文论述了毛乌素沙地治理与刨花板厂建设的关系。"},{"english":"And the diversity of university institutions is deduced by the society structure which it's in.","chinese":"大学治理的多样性决定于其所嵌入的社会结构。"},{"english":"Part II The relationship between the Corporate Goverance and the protection of the minority shareholders.","chinese":"第二部分小股东利益保护与公司治理的关系。"},{"english":"China could also clean up environmental damage caused by underpricing resources.","chinese":"中国也可以治理由于资源定价过低造成的环境破坏。"},{"english":"The answer is “horizontal” and “vertical” governance approach.","chinese":"答案是“水平”和“垂直”的治理方法。"},{"english":"Governance should not be a set of static processes without any flexibility.","chinese":"治理不应该是一组没有任何灵活性的静态过程。"},{"english":"The cumulative amount of controlled soil and water loss area in Pingchang county, Sichuan province is 782.","chinese":"四川省平昌县已累计治理水土流失面积782。"},{"english":"Yangzikeng watershed began its comprehensive control and exploitation at the beginning of 1992.","chinese":"杨子坑流域是1992年初开始进行综合治理开发的。"},{"english":"This paper presents the method of treatment of waste water containing nitrophenol sodium from dye plant.","chinese":"本文研究了染料厂含硝基酚钠废水治理的方法。"},{"english":"Cholera was recognized as an indicator of how well the environment is managed.","chinese":"霍乱被视为可衡量环境治理成果的一项指标。"},{"english":"Development governance encompasses the software development lifecycle.","chinese":"开发治理围绕着软件开发生命周期。"},{"english":"Lack of stable business guidelines and governance for data quality.","chinese":"缺乏数据质量的可靠业务指导方针和治理。"}],"related":[{"definition":["to bring under control\/to regulate\/to restore to good condition\/(coll.) to fix (a person)\/to prepare (a meal etc)"],"pinyin":["zheng3 zhi4"],"word":"整治"},{"definition":["to control"],"pinyin":["guan3 kong4"],"word":"管控"},{"definition":["to supervise\/to manage\/to administer\/management\/administration\/CL:個|个[ge4]"],"pinyin":["guan3 li3"],"word":"管理"},{"definition":["to tidy up\/to reorganize\/to consolidate\/to rectify"],"pinyin":["zheng3 dun4"],"word":"整顿"},{"definition":["to put into effect\/to carry out"],"pinyin":["tui1 xing2"],"word":"推行"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"监管"},{"definition":["to punish"],"pinyin":["cheng2 zhi4"],"word":"惩治"},{"definition":["style of governing (of minor official)\/achievement in office"],"pinyin":["li4 zhi4"],"word":"吏治"},{"definition":["long-term peace and stability (of governments)"],"pinyin":["chang2 zhi4 jiu3 an1"],"word":"长治久安"},{"definition":["to eradicate"],"pinyin":["gen1 chu2"],"word":"根除"},{"definition":["chaos\/madness"],"pinyin":["luan4 xiang4"],"word":"乱象"},{"definition":["to suppress\/to crack down on\/to prohibit"],"pinyin":["qu3 di4"],"word":"取缔"},{"definition":["to prevent and control (e.g. the spread of a communicable disease)"],"pinyin":["fang2 kong4"],"word":"防控"},{"definition":["government decree"],"pinyin":["zheng4 ling4"],"word":"政令"},{"definition":["to reduce emissions"],"pinyin":["jian3 pai2"],"word":"减排"},{"definition":["to hold accountable\/to blame\/to censure\/to apportion blame"],"pinyin":["wen4 ze2"],"word":"问责"}]}