{"definition":["to continue to use (old methods)\/to apply as before\/according to usage"],"pinyin":["yan2 yong4"],"traditional":["沿用"],"rank":10938.0,"normalized_rank":0.15303681110349365,"fraction":0.000007127065676280113,"cumulative_fraction":0.9369071317853209,"word":"沿用","characters":[{"definition":["along\/to follow (a line, tradition etc)\/to carry on\/to trim (a border with braid, tape etc)\/border\/edge"],"pinyin":["yan2"],"word":"沿"},{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"}],"containing_words":[],"sentences":[{"english":"If a new strategy works, then it will be adopted and further routinized as a rule of thumb.","chinese":"如果新办法行得通，以后就会沿用而成为经验法则。"},{"english":"His policy of overseas contacts was generally followed by his successors in Ming Dyn …","chinese":"明朝后代基本上沿用了太祖的海外交往政策。"},{"english":"Some names, like 'Night Star' and 'Morning Star', are still used today.","chinese":"有些船名，就像晚星和晨星仍然沿用到现在。"},{"english":"In the project of building road , calculating the quantity of earthworkapplies approximative formulation.","chinese":"在筑路工程中，土方量的计算一直沿用近似公式。"},{"english":"The production of red pottery still needs the traditional method.","chinese":"紫砂陶器的生产，仍需沿用传统的方式。"},{"english":"The chassis beneath the car comes from an Audi RS 5, with its wheelbase shortened and roof lowered.","chinese":"底盘沿用奥迪RS5，缩短了轴距，削低了车高。"},{"english":"The phrase has been used on his day ever since.","chinese":"从那以后这句话一直被沿用至今。"},{"english":"The utility model still uses the base structure that a threshing wheel drum and a shed cover are installed on a threshing stirring barrel.","chinese":"沿用在打谷拌桶上装打谷轮鼓及棚盖的基本结构。"},{"english":"The Soviet Union introduced daylight saving in 1981 and it has continued ever since.","chinese":"苏联于1981年实施了日光节约时制，并沿用至今。"},{"english":"The word Xie (Chinese equivalent to footwear) was formally adopted as the generic name and continued to the present.","chinese":"泛指鞋履的名称正式写成“鞋”字，一直沿用至今天。"},{"english":"Guan-Li (Amenity of Manhood) customized to the formation in the Zhou Dynasty, has long been in use since then.","chinese":"冠礼至周代形成定制，此后长期被沿用。"},{"english":"Because I follow a classic pattern, the coding is almost brainless.","chinese":"因为我沿用了经典模式，因此编码几乎不用动脑子。"},{"english":"In fact, all television equipment today still uses Philo's early idea.","chinese":"事实上，如今所有的电视机仍然沿用菲罗早期的创意。"},{"english":"Most of the left has followed this confusing usage.","chinese":"多数左派迄今都是沿用的这个莫名其妙的用法。"},{"english":"This method of manufacture remains the one in use today.","chinese":"这种铅笔芯制造法沿用至今。"},{"english":"Since then, the relationship between the number of administrative changes, but the counties were still in use.","chinese":"此后，行政隶属关系多有改变，但县名沿用至今。"}],"related":[{"definition":["to carry on as before\/to follow (an old custom etc)"],"pinyin":["yan2 xi2"],"word":"沿袭"},{"definition":["to continue\/to go on\/to last"],"pinyin":["yan2 xu4"],"word":"延续"},{"definition":["to inherit\/to follow\/to adopt"],"pinyin":["cheng2 xi2"],"word":"承袭"},{"definition":["to change into"],"pinyin":["gai3 wei2"],"word":"改为"},{"definition":["to keep\/to retain\/to have reservations (about sth)\/to hold back (from saying sth)\/to put aside for later"],"pinyin":["bao3 liu2"],"word":"保留"},{"definition":["traceable to the same stock (idiom); of a common origin (of trends, ideas etc)"],"pinyin":["yi1 mai4 xiang1 cheng2"],"word":"一脉相承"},{"definition":["to convert\/to turn into (sth else)\/to adapt (a story to another medium)"],"pinyin":["gai3 cheng2"],"word":"改成"},{"definition":["tradition\/traditional\/convention\/conventional\/CL:個|个[ge4]"],"pinyin":["chuan2 tong3"],"word":"传统"},{"definition":["to imitate"],"pinyin":["fang3 zhao4"],"word":"仿照"},{"definition":["to change\/to alter\/to transform\/to correct"],"pinyin":["gai3"],"word":"改"},{"definition":["all new\/completely new"],"pinyin":["quan2 xin1"],"word":"全新"},{"definition":["to copy\/to imitate"],"pinyin":["zhao4 ban1"],"word":"照搬"},{"definition":["original\/former"],"pinyin":["yuan2 you3"],"word":"原有"},{"definition":["to replace\/to supersede\/to supplant\/(chemistry) substitution"],"pinyin":["qu3 dai4"],"word":"取代"},{"definition":["to name (sth)"],"pinyin":["ding4 ming2"],"word":"定名"},{"definition":["different broth but the same old medicine (idiom); a change in name only\/a change in form but not in substance"],"pinyin":["huan4 tang1 bu4 huan4 yao4"],"word":"换汤不换药"}]}