{"definition":["to carry on as before\/to follow (an old custom etc)"],"pinyin":["yan2 xi2"],"traditional":["沿襲"],"rank":16208.0,"normalized_rank":0.22677094847005164,"fraction":0.0000035888599564006018,"cumulative_fraction":0.9636952052297978,"word":"沿袭","characters":[{"definition":["along\/to follow (a line, tradition etc)\/to carry on\/to trim (a border with braid, tape etc)\/border\/edge"],"pinyin":["yan2"],"word":"沿"},{"definition":["to attack\/to inherit\/classifier for suits (esp. of funeral robes)"],"pinyin":["xi2"],"word":"袭"}],"containing_words":[],"sentences":[{"english":"The newly-opened store inherits South Beauty's constant features of fashion and innovation.","chinese":"新店沿袭了俏江南时尚创新的经营特色。"},{"english":"Pacheco's transfer continued a trend of teenagers leaving Barcelona for the Premier League.","chinese":"帕切科的转会沿袭了巴塞罗那青少年出走英超的传统。"},{"english":"The plug-in model we use today is largely theone inherited from the web's early days.","chinese":"我们今天使用的接插模型，主要从早期网络沿袭而来。"},{"english":"Several European countries rang in the new year in new ways.","chinese":"除了这些新鲜的庆祝方式外，一些旧传统也被沿袭。"},{"english":"The new Camry will have a lot to live up to.","chinese":"新款凯美瑞将沿袭过去的一系列优势。"},{"english":"The custom has continued from the 16th century downward.","chinese":"这种风俗自十六世纪沿袭下来。"},{"english":"Each language usually adopts the convention of one early language only.","chinese":"这些程式语言通常仅沿袭自一种早先语言的习惯。"},{"english":"Resumption of college entrance examination in 1977, the country still adhere to this provision.","chinese":"1977年恢复高考后，国家仍然沿袭了这一规定。"},{"english":"The plug-in model we use today is largely theone inherited from the web’s early days.","chinese":"我们今天使用的接插模型，主要从早期网络沿袭而来。"},{"english":"We should keep up our good traditions.","chinese":"我们应该沿袭我们的优良传统。"},{"english":"Sui and Tang dynasties, the ancient light of prevailing winds, and follow-on generations.","chinese":"隋唐以后，历代灯火之风盛行，并沿袭传于后世。"},{"english":"Albanian popular music (këngë popullore) is generally based on Italian models.","chinese":"阿尔巴尼亚流行歌曲主要是沿袭意大利的模式。"},{"english":"The distribution of the seismic deformation band coincides with that of the Chenghai fault zone.","chinese":"地震形变带沿袭程海断裂分布。"},{"english":"Park House is a column with the high ground, followed by the history of Tianzhu Weibei built.","chinese":"凭柱阁是园内的制高点，因沿袭天柱魏碑的历史而建。"},{"english":"U.S.-listed shares of some big European banks followed the same trajectory.","chinese":"一些欧洲银行的股票沿袭了大盘的走势。"},{"english":"Not the ancient, talking about the Qing Dynasty and early Qing Dynasty, followed the next system.","chinese":"远古的不说，就清朝说起，清初，沿袭明制。"}],"related":[{"definition":["to continue to use (old methods)\/to apply as before\/according to usage"],"pinyin":["yan2 yong4"],"word":"沿用"},{"definition":["to inherit\/to follow\/to adopt"],"pinyin":["cheng2 xi2"],"word":"承袭"},{"definition":["to continue\/to go on\/to last"],"pinyin":["yan2 xu4"],"word":"延续"},{"definition":["traceable to the same stock (idiom); of a common origin (of trends, ideas etc)"],"pinyin":["yi1 mai4 xiang1 cheng2"],"word":"一脉相承"},{"definition":["to follow old patterns\/to imitate existing models\/to continue along the same lines"],"pinyin":["yin1 xi2"],"word":"因袭"},{"definition":["tradition\/traditional\/convention\/conventional\/CL:個|个[ge4]"],"pinyin":["chuan2 tong3"],"word":"传统"},{"definition":["to pass on (to future generations)\/passed on (from former times)\/a continued tradition\/an inheritance"],"pinyin":["chuan2 cheng2"],"word":"传承"},{"definition":["to inherit\/to succeed to (the throne etc)\/to carry on (a tradition etc)"],"pinyin":["ji4 cheng2"],"word":"继承"},{"definition":["to take orders\/to receive commands\/to carry on (a tradition)"],"pinyin":["bing3 cheng2"],"word":"秉承"},{"definition":["lit. to fly one's banner on a solitary tree (idiom); fig. to act as a loner\/to stand out\/to develop one's own school\/to have attitude of one's own"],"pinyin":["du2 shu4 yi1 zhi4"],"word":"独树一帜"},{"definition":["passed on from generation to generation (idiom); to hand down"],"pinyin":["dai4 dai4 xiang1 chuan2"],"word":"代代相传"},{"definition":["consistent\/constant\/from start to finish\/all along\/persistent"],"pinyin":["yi1 guan4"],"word":"一贯"},{"definition":["tradition or style from the past\/old ways\/surviving tradition\/relic"],"pinyin":["yi2 feng1"],"word":"遗风"},{"definition":["established by popular usage (idiom); common usage agreement\/customary convention"],"pinyin":["yue1 ding4 su2 cheng2"],"word":"约定俗成"},{"definition":["to keep\/to retain\/to have reservations (about sth)\/to hold back (from saying sth)\/to put aside for later"],"pinyin":["bao3 liu2"],"word":"保留"},{"definition":["passed on from generation to generation (idiom); to hand down"],"pinyin":["shi4 dai4 xiang1 chuan2"],"word":"世代相传"}]}