{"definition":["Legalist School of the Warring States Period (475-221 BC) founded by Han Fei 韓非|韩非[Han2 Fei1] and Li Si 李斯[Li3 Si1], later adopted by Shang Yang 商鞅[Shang1 Yang1] whose reforms helped establish the supremacy of the Qin Dynasty 秦代[Qin1 dai4] (221-207 BC)"],"pinyin":["Fa3 jia1"],"traditional":["法家"],"rank":40160.0,"normalized_rank":0.5618905041064458,"fraction":3.796878074678856e-7,"cumulative_fraction":0.9965498716330202,"word":"法家","characters":[{"definition":["France\/French\/abbr. for 法國|法国[Fa3 guo2]\/Taiwan pr. [Fa4]","variant of 法[fa3]","old variant of 法[fa3]\/law","law\/method\/way\/to emulate\/(Buddhism) dharma\/(abbr. for 法家[Fa3 jia1]) the Legalists\/(physics) farad (abbr. for 法拉[fa3 la1])"],"pinyin":["Fa3","fa3","fa3","fa3"],"word":"法"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"}],"containing_words":[{"definition":["calligrapher"],"pinyin":["shu1 fa3 jia1"],"word":"书法家"}],"sentences":[{"english":"Students in higher grades should also learn to appreciate the works of ancient calligraphers.","chinese":"高年级学生还应学会欣赏古代书法家的作品。"},{"english":"The author was Wang Xizhi, a calligrapher in Jin Dynasty in Chinese history.","chinese":"作者王羲之，中国古代晋代书法家。"},{"english":"The calligraphers inherit and develop on the traditional ancient seal character .","chinese":"历代大篆书法家对传统的继承和创新。"},{"english":"Mr Jiang Shilu army Wu origin, is the Honorary Chairman of the Chinese calligraphers ' Association.","chinese":"姜世禄先生军武出身，是中国书法家协会名誉主席。"},{"english":"Legalist Han Fei theory and from different angles.","chinese":"法家韩非从不同角度论和。"},{"english":"The famous calligraphist old Mr. Su Shi grants the black question in order that \" the east grape in Beijing is agricultural \" for him.","chinese":"著名书法家苏适老先生为他赐墨题为“京东葡萄农”。"},{"english":"This calligrapher writes a forceful hand, with bold and vigorous strokes.","chinese":"这位书法家的书法苍劲有力，入木三分。"},{"english":"The famous calligrapher gave away some of the spring couplets he wrote.","chinese":"这位知名书法家将他写的一些春联送给别人。"},{"english":"Han Fei is the great master of legal thinking at the end of the Warring States period.","chinese":"韩非是战国末季法家思想的集大成者。"},{"english":"The Strategist School makes situation stand out; the Legalist School stresses institutionalization.","chinese":"兵家讲势，法家强调恃人不敢为非的制度化建设。"},{"english":"Legalism Han Fei is a master of the late Warring States Period were.","chinese":"韩非是战国末年法家思想的集大成者。"},{"english":"On financial management, Legalists had three main opinions.","chinese":"财政管理方面，法家的观点主要有三点。"},{"english":"They have been highly praised by calligraphers and painters through the age.","chinese":"几个世纪以来，得到书法家和画家的高度赞誉。"},{"english":"He asked, strangely enough, this is why calligrapher .","chinese":"他奇怪地问书法家这是什么原因。"},{"english":"Xianyu Shu is an outstanding calligrapher of the early Yuan Dynasty.","chinese":"鲜于枢，元代初期著名的书法家。"},{"english":"The Legalists' severe punishment thoughts has its special logic.","chinese":"法家有其独特的重刑思想的逻辑。"}],"related":[{"definition":["Confucian school, founded by Confucius 孔子[Kong3 zi3] (551-479 BC) and Mencius 孟子[Meng4 zi3] (c. 372-c. 289 BC)"],"pinyin":["Ru2 jia1"],"word":"儒家"},{"definition":["Han Feizi, book of Legalist Philosophy authored by Han Fei 韓非|韩非[Han2 Fei1] during the Warring States Period (475-220 BC)"],"pinyin":["Han2 Fei1 zi3"],"word":"韩非子"},{"definition":["School of Diplomacy of the Warring States Period (475-221 BC) whose leading advocates were Su Qin 蘇秦|苏秦[Su1 Qin2] and Zhang Yi 張儀|张仪[Zhang4 Yi2]"],"pinyin":["Zong4 heng2 jia1"],"word":"纵横家"},{"definition":["Shen Buhai (385-337 BC), legalist political thinker"],"pinyin":["Shen1 Bu4 hai4"],"word":"申不害"},{"definition":["Dong Zhongshu (179-104 BC), philosopher influential in establishing Confucianism as the established system of values of former Han dynasty"],"pinyin":["Dong3 Zhong4 shu1"],"word":"董仲舒"},{"definition":["the Hundred Schools of Thought, the various schools of thought and their exponents during the Spring and Autumn and Warring States Periods (770-220 BC)"],"pinyin":["zhu1 zi3 bai3 jia1"],"word":"诸子百家"},{"definition":["The Book of Lord Shang, Legalist text of the 4th century BC"],"pinyin":["Shang1 Jun1 Shu1"],"word":"商君书"},{"definition":["Li Kui (455-395 BC), legalist philosopher and statesman of Wei state 魏國|魏国[Wei4 guo2]"],"pinyin":["Li3 Kui1"],"word":"李悝"},{"definition":["Xun Zi or Hsun Tzu (c. 310-237 BC), Confucian philosopher and author of On learning 勸學|劝学"],"pinyin":["Xun2 zi3"],"word":"荀子"},{"definition":["Shang Yang (c. 390-338 BC), legalist philosopher and statesman of the state of Qin 秦國|秦国[Qin2 guo2], whose reforms paved the way for the eventual unification of the Chinese empire by the Qin dynasty 秦朝|秦朝[Qin2 chao2]"],"pinyin":["Shang1 Yang1"],"word":"商鞅"},{"definition":["Confucianism"],"pinyin":["Ru2 xue2"],"word":"儒学"},{"definition":["dismiss the hundred schools, revere only the Confucians (slogan of the Former Han dynasty)"],"pinyin":["du2 zun1 ru2 shu4"],"word":"独尊儒术"},{"definition":["School of Yin-Yang of the Warring States Period (475-221 BC) founded by Zou Yan 鄒衍|邹衍[Zou1 Yan3]"],"pinyin":["Yin1 yang2 jia1"],"word":"阴阳家"},{"definition":["Former Han dynasty school of Confucian scholars"],"pinyin":["jin1 wen2 jing1 xue2"],"word":"今文经学"},{"definition":["Mohist School of the Warring States Period (475-220 BC), founded by the philosopher 墨子[Mo4 zi3]"],"pinyin":["Mo4 jia1"],"word":"墨家"},{"definition":["Confucianism"],"pinyin":["Ru2 jiao4"],"word":"儒教"}]}