{"definition":["to dawdle\/to go slow deliberately\/to fizzle out\/to have all one's hopes dashed\/(Tw) to have a soak in a hot spring"],"pinyin":["pao4 tang1"],"traditional":["泡湯"],"rank":23443.0,"normalized_rank":0.3279979852531725,"fraction":0.0000017099819210606737,"cumulative_fraction":0.9818110731005638,"word":"泡汤","characters":[{"definition":["puffed\/swollen\/spongy\/small lake (esp. in place names)\/classifier for urine or feces","bubble\/foam\/blister (i.e. skin bubble)\/to soak\/to steep\/to infuse\/to dawdle\/to shilly-shally\/to hang about\/to pick up (a girl)\/to get off with (a sexual partner)\/classifier for occurrences of an action\/classifier for number of infusions"],"pinyin":["pao1","pao4"],"word":"泡"},{"definition":["surname Tang","rushing current","soup\/hot or boiling water\/decoction of medicinal herbs\/water in which sth has been boiled"],"pinyin":["Tang1","shang1","tang1"],"word":"汤"}],"containing_words":[],"sentences":[{"english":"Japanese macaque swims in a geothermal hot spring in the mountains of Japan.","chinese":"一只日本猕猴在日本某处山间温泉里泡汤。"},{"english":"The rain fucked up our plans to go on a picnic.","chinese":"下雨使我们野餐的计划泡汤了。"},{"english":"It’s not hard to imagine how such instability could sink a space mission.","chinese":"这不难想象如此的不稳定会使整个宇宙任务泡汤。"},{"english":"It rained non-stop for ten days, completely ruining our holiday.","chinese":"连续下了十天的雨，我们的度假彻底泡汤了。"},{"english":"A long soak in the bath would probably finish off your relationship.","chinese":"若在洗澡房里泡久了，可能你们的关系也泡汤了。"},{"english":"Therefore, our plan was an impossible due to the bad weather.","chinese":"因此，我们的计划因为坏天气泡汤了。"},{"english":"It rained for two weeks, completely ruining our holidays.","chinese":"雨一连下了两星期，我们的假期这下彻底泡汤了。"},{"english":"Contrary to most reports, the deal is not yet dead.","chinese":"跟多数报道所报的不同，这项交易还没有彻底泡汤。"},{"english":"If they are not elected, Than Shwe grand plan is over.","chinese":"如果他们得不到推选，那么丹瑞的重大计划就会泡汤。"},{"english":"A proposal to honor the New Orleans cocktail known as the Sazerac has gone down the drain.","chinese":"一项表彰纽奥良知名鸡尾酒萨泽拉克的提案泡汤了。"},{"english":"By the time he's done with work, their plans are ruined, so they spend the night together in the museum.","chinese":"收工后原计划泡汤，他们在博物馆度过了浪漫的一夜。"},{"english":"But federal budget cuts threaten to zero out the work.","chinese":"但是联邦预算的削减将有可能使工作泡汤。"},{"english":"The heavy rain speak of the impossibility of the picnic this afternoon.","chinese":"这场大雨显然使今天下午的野餐泡汤了。"},{"english":"A Japanese macaque swims in a geothermal hot spring in the mountains of Japan.","chinese":"一只日本猕猴在日本某处山间温泉里泡汤。"},{"english":"Bob's vacation plans went up in smoke when a crisis arose in the office.","chinese":"办公室出了问题，鲍伯的假期泡汤了。"},{"english":"The deal ended after a series of rancorous disputes.","chinese":"经过一连串充满敌意的争吵，交易泡汤了。"}],"related":[{"definition":["to come to nothing (idiom)"],"pinyin":["hua4 wei2 pao4 ying3"],"word":"化为泡影"},{"definition":["to go home (in a ceremonial procession)\/to return home"],"pinyin":["da3 dao4 hui2 fu3"],"word":"打道回府"},{"definition":["to fizzle out\/to come to nothing"],"pinyin":["gao4 chui1"],"word":"告吹"},{"definition":["lit. to ruin the enterprise for the sake of one basketful\/to fail through lack of a final effort\/to spoil the ship for a ha'penny worth of tar (idiom)"],"pinyin":["gong1 kui1 yi1 kui4"],"word":"功亏一篑"},{"definition":["having given away a bride, to lose one's army on top of it (idiom)\/to suffer a double loss after trying to trick the enemy"],"pinyin":["pei2 le5 fu1 ren2 you4 zhe2 bing1"],"word":"赔了夫人又折兵"},{"definition":["lit. to try to steal a chicken only to end up losing the rice used to lure it (idiom)\/fig. to try to gain an advantage only to end up worse off\/to go for wool and come back shorn"],"pinyin":["tou1 ji1 bu4 cheng2 shi2 ba3 mi3"],"word":"偷鸡不成蚀把米"},{"definition":["to miss an appointment"],"pinyin":["shi1 yue1"],"word":"失约"},{"definition":["(coll.) to be done for"],"pinyin":["wan2 dan4"],"word":"完蛋"},{"definition":["to skip stones (on water)\/(coll.) to squander one's money on a bad investment"],"pinyin":["da3 shui3 piao1"],"word":"打水漂"},{"definition":["to mess (sth) up\/to foul up\/to spoil"],"pinyin":["gao3 za2"],"word":"搞砸"},{"definition":["hopes are dashed"],"pinyin":["xi1 wang4 luo4 kong1"],"word":"希望落空"},{"definition":["to be finished\/to be done for\/ruined\/gone to the dogs\/oh no"],"pinyin":["wan2 le5"],"word":"完了"},{"definition":["to plan\/to intend\/to calculate\/plan\/intention\/calculation\/CL:個|个[ge4]"],"pinyin":["da3 suan4"],"word":"打算"},{"definition":["to waste all one's previous efforts (idiom)\/all that has been achieved goes down the drain"],"pinyin":["qian2 gong1 jin4 qi4"],"word":"前功尽弃"},{"definition":["to come to a decision\/to fix on (a date etc)\/to determine\/to finalize\/to nail down (a deal etc)"],"pinyin":["qiao1 ding4"],"word":"敲定"},{"definition":["lit. froth and shadows\/fig. illusion\/mirage"],"pinyin":["pao4 ying3"],"word":"泡影"}]}