{"definition":["wave band"],"pinyin":["bo1 duan4"],"traditional":["波段"],"rank":12634.0,"normalized_rank":0.17676605151595706,"fraction":0.0000056178029921545976,"cumulative_fraction":0.9476380609984896,"word":"波段","characters":[{"definition":["wave\/ripple\/storm\/surge","Poland\/Polish\/abbr. for 波蘭|波兰[Bo1 lan2]"],"pinyin":["bo1","Bo1"],"word":"波"},{"definition":["paragraph\/section\/segment\/stage (of a process)\/classifier for stories, periods of time, lengths of thread etc","surname Duan"],"pinyin":["duan4","Duan4"],"word":"段"}],"containing_words":[],"sentences":[{"english":"HF radar backscatter from the ocean surface shows nonlinearities and time variation of its spectrum.","chinese":"高频波段海洋回波信号表现了非线性和频谱时变性。"},{"english":"The thesis presents the research and design of a V-band frequency quadrupler.","chinese":"本文对V波段有源倍频器进行了设计研究。"},{"english":"The double-wave band laser was studied theoretically.","chinese":"在理论上探讨了红黄双波段激光产生的机理。"},{"english":"This study aims on the spectral features and sensitive spectrum wave band in the apple florescence .","chinese":"旨在探索苹果花期的光谱特征和敏感波段。"},{"english":"C-band pulse Doppler weather radar receiver is described in detail in this paper.","chinese":"介绍了一种C波段脉冲多普勒天气雷达接收机。"},{"english":"The two-band British EQ is famous for its warm, musical sound.","chinese":"这两个波段均衡器，是英国的热情，著名的音乐声。"},{"english":"This Paper describes data records based on C-band tracking radar and off-line processing.","chinese":"描述C波段跟踪雷达数据记录和脱机处理情况。"},{"english":"Certain waves can be used in rapid drying devices that installed in web printing presses.","chinese":"某些波段可用于卷筒纸印刷机上的快速干燥装置。"},{"english":"The invention relates to a multiband antenna device and a communication terminal device.","chinese":"本发明涉及一种多波段天线设备和通信终端装置。"},{"english":"Noble winney owned a very good all-band receiver.","chinese":"诺布尔温尼有一台非常好的全波段收音机。"},{"english":"This thesis presents the design and manufacture of a V-band frequency quadrupler.","chinese":"本文研究了V波段四倍频器的设计和研制方法。"},{"english":"Most of the invisibility cloaks that have been demonstrated to date conceal objects at frequencies that are not detectable by the human eye.","chinese":"大部分隐身斗篷都是在非可见光波段隐藏物体。"},{"english":"What if we could use other waves to surf the internet?","chinese":"要是我们可以使用其他的波段上网冲浪又会如何呢？"},{"english":"The second conductor 104 resonates in a portion of the high band.","chinese":"第二导体104在高波段的一部分内谐振。"},{"english":"The experimental results show that there exists a strong photovoltage signal at long wavelength bands.","chinese":"实验结果表明，在长波段有强的光电压信号。"},{"english":"Many chemical agent explosives show characteristic spectral features in the terahertz.","chinese":"大多数生物战剂爆炸物在此波段有特征吸收。"}],"related":[{"definition":["short term"],"pinyin":["duan3 xian4"],"word":"短线"},{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"word":"反弹"},{"definition":["market price\/quotation of market price\/the current market situation"],"pinyin":["hang2 qing2"],"word":"行情"},{"definition":["half-way line\/median line"],"pinyin":["zhong1 xian4"],"word":"中线"},{"definition":["bear market"],"pinyin":["xiong2 shi4"],"word":"熊市"},{"definition":["long term"],"pinyin":["chang2 xian4"],"word":"长线"},{"definition":["to shake up\/to jolt\/to vibrate\/to oscillate\/to fluctuate","to vibrate\/to shake\/to shudder"],"pinyin":["zhen4 dang4","zhen4 dang4"],"word":"震荡"},{"definition":["phony\/so-called\/armchair (expert)\/vain (promise)\/(finance) short-seller\/bear (market)\/short (selling)"],"pinyin":["kong1 tou2"],"word":"空头"},{"definition":["bull market (prices appear to be rising)"],"pinyin":["kan4 zhang3"],"word":"看涨"},{"definition":["poor prospects in the short term (finance)"],"pinyin":["duan3 kong1"],"word":"短空"},{"definition":["graph of average values"],"pinyin":["jun1 xian4"],"word":"均线"},{"definition":["bull market"],"pinyin":["niu2 shi4"],"word":"牛市"},{"definition":["short term\/short-term"],"pinyin":["duan3 qi1"],"word":"短期"},{"definition":["Shanghai Stock Exchange (SSE), abbr. for 上海證券交易所|上海证券交易所[Shang4 hai3 Zheng4 quan4 Jiao1 yi4 suo3]"],"pinyin":["Shang4 Zheng4"],"word":"上证"},{"definition":["good prospects in the short term (finance)"],"pinyin":["duan3 duo1"],"word":"短多"},{"definition":["to purchase\/to buy in (goods)"],"pinyin":["mai3 jin4"],"word":"买进"}]}