{"definition":["to pour water into\/to inject water into"],"pinyin":["zhu4 shui3"],"traditional":["注水"],"rank":19112.0,"normalized_rank":0.2674016761574301,"fraction":0.0000026242397980969547,"cumulative_fraction":0.9726109166667914,"word":"注水","characters":[{"definition":["to inject\/to pour into\/to concentrate\/to pay attention\/stake (gambling)\/classifier for sums of money\/variant of 註|注[zhu4]","to register\/to annotate\/note\/comment"],"pinyin":["zhu4","zhu4"],"word":"注"},{"definition":["surname Shui","water\/river\/liquid\/beverage\/additional charges or income\/(of clothes) classifier for number of washes"],"pinyin":["Shui3","shui3"],"word":"水"}],"containing_words":[],"sentences":[{"english":"Use a syringe device to gently direct water against the wall of the ear canal.","chinese":"使用注射器直接向耳孔壁注水。"},{"english":"He was also accused of forcing buyers to purchase water-injected meat.","chinese":"他还被指控迫使买家购买注水肉。"},{"english":"In order to solve this problem, the dynamic water injection balance technique is developed.","chinese":"为了解决回拖卡管问题，动态注水平衡技术应运而生。"},{"english":"Biandong Oilfield has three Conflict in waterflooding developed zone.","chinese":"卞东油田注水开发调整效果差。"},{"english":"In a word, it increased the safety degree of reinjection water.","chinese":"与化学破乳剂相比，提高了回注水的安全性。"},{"english":"The basic noise conditions of the water-flooding pump station are investigated in the oil—field.","chinese":"调查了油田注水泵房噪声的基本情况。"},{"english":"Finally I poured water into the triaxial cell through the pipeline of confining pressure and carried on the triaxial loading.","chinese":"之后再通过围压管向三轴室注水，进行三轴加载。"},{"english":"On Thursday morning, helicopters operated by Japan's self-defense forces made four passes over the plant's No. 3 reactor to dump water.","chinese":"周四早上，日本自卫队的直升机四次对3号厂房注水。"},{"english":"The key of reservoir protection is the protection of the pore throats during water injection in low permeability oilfields.","chinese":"低渗油田注水过程中储层保护的关键是保护孔喉。"},{"english":"Every miller draws water to his own mill.","chinese":"磨坊主都往自己磨里注水。"},{"english":"Otherwise, water will slip between the glass door and the walls when filling.","chinese":"否则注水时水就会在玻璃门和箱壁之间流出。"},{"english":"For the water flooding development of water sensitive reservoir, pretreatment must be carried out to prevent the clay swelling.","chinese":"对于水敏油藏注水开发，必须进行防膨预处理。"},{"english":"Waterflooding is the main development ways in oil fields at present.","chinese":"注水开发是目前我国大多数油田的主要开发方式。"},{"english":"Methods of inspectiong and calculating the efficiency of water injection system in Shengli Oilfield are introduced.","chinese":"介绍了胜利油田注水系统效率统计测试计算方法。"},{"english":"Narrated the application of gas-turbine drive water injection pump.","chinese":"叙述了燃气轮机在油田拖动注水泵的应用情况。"},{"english":"THEY SAT in the middle of a small lake fed by the waters of Brices Creek.","chinese":"他们停在一个由布赖斯小溪注水的小湖。"}],"related":[{"definition":["to dilute\/to water down\/watered down"],"pinyin":["chan1 shui3"],"word":"掺水"},{"definition":["to irrigate\/to pour water into\/to inject water into meat to increase its weight (plumping)\/to cook the books\/to post low-value messages (small talk etc) on Internet forums"],"pinyin":["guan4 shui3"],"word":"灌水"},{"definition":["to turn on the water\/to let water out\/to throw a game (sports)"],"pinyin":["fang4 shui3"],"word":"放水"},{"definition":["volume of water\/quantity of flow"],"pinyin":["shui3 liang4"],"word":"水量"},{"definition":["water inlet"],"pinyin":["jin4 shui3 kou3"],"word":"进水口"},{"definition":["water outlet\/drainage outlet"],"pinyin":["chu1 shui3 kou3"],"word":"出水口"},{"definition":["running water\/tap water"],"pinyin":["zi4 lai2 shui3"],"word":"自来水"},{"definition":["to pressurize\/to pile on pressure"],"pinyin":["jia1 ya1"],"word":"加压"},{"definition":["to heat\/to add warmth\/to raise temperature\/fig. to stimulate"],"pinyin":["jia1 wen1"],"word":"加温"},{"definition":["to churn out large quantities without regard for quality (idiom); rough and slipshod work"],"pinyin":["cu1 zhi4 lan4 zao4"],"word":"粗制滥造"},{"definition":["cooling water (in a reactor)"],"pinyin":["leng3 que4 shui3"],"word":"冷却水"},{"definition":["(of soil etc) to wash away\/to be eroded\/(fig.) (of talented staff, followers of a religious faith, investment funds etc) to go elsewhere\/to fail to be retained"],"pinyin":["liu2 shi1"],"word":"流失"},{"definition":["bubble\/blister (in metal)\/(of beverages) sparkling\/carbonated"],"pinyin":["qi4 pao4"],"word":"气泡"},{"definition":["water tank\/radiator (automobile)\/cistern\/lavabo"],"pinyin":["shui3 xiang1"],"word":"水箱"},{"definition":["cold water\/unboiled water\/fig. not yet ready (of plans)"],"pinyin":["leng3 shui3"],"word":"冷水"},{"definition":["hot water"],"pinyin":["re4 shui3"],"word":"热水"}]}