{"definition":["as rivers Jing and Wei separate clearly (idiom)\/to be entirely different"],"pinyin":["Jing1 Wei4 fen1 ming2"],"traditional":["涇渭分明"],"rank":32505.0,"normalized_rank":0.4547871224098611,"fraction":7.544123756224655e-7,"cumulative_fraction":0.9923588386381624,"word":"泾渭分明","characters":[{"definition":["Jing River"],"pinyin":["Jing1"],"word":"泾"},{"definition":["the Wei River in Shaanxi through the Guanzhong 關中|关中 plain"],"pinyin":["Wei4"],"word":"渭"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen4","fen1"],"word":"分"},{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"}],"containing_words":[],"sentences":[{"english":"There is a great divide between liberals and conservatives in the government.","chinese":"政府泾渭分明地分为了自由党和保守党两个党派。"},{"english":"Izumi and I had a strictly compartmentalised yet totally intimate relationship.","chinese":"泉和我保持着一种泾渭分明却又亲密无间的关系。"},{"english":"This is quite at odds with modern notions of absolute difference exemplified by sex and race.","chinese":"它和现代观念中泾渭分明的性和种族概念截然不同。"},{"english":"In the real world, the lifecycle is not always as clean.","chinese":"在现实世界中，该生命周期并非始终泾渭分明。"},{"english":"The two of them had entirely different attitudes towards the matter.","chinese":"两人对此的态度泾渭分明。"},{"english":"For this reason, the life of man of practice and the life of the man in the infest society is totally different worlds.","chinese":"所以修行人及一般人必定是泾渭分明的两个世界。"},{"english":"Historically, these two genres of film have remained separate.","chinese":"在历史上，这两种类型的电影可谓是泾渭分明。"},{"english":"Traditionally, such problems have caused deep divisions between development and operations teams.","chinese":"从传统上来说，这些问题使开发和操作团队泾渭分明。"}],"related":[{"definition":["completely\/sharply (differing)"],"pinyin":["jie2 ran2"],"word":"截然"},{"definition":["to oppose\/to set sth against\/to be antagonistic to\/antithetical\/relative opposite\/opposing\/diametrical"],"pinyin":["dui4 li4"],"word":"对立"},{"definition":["limits\/bounds\/dividing line"],"pinyin":["jie4 xian4"],"word":"界线"},{"definition":["classification"],"pinyin":["fen1 shu3"],"word":"分属"},{"definition":["one divides into two\/to be two-sided\/there are two sides to everything\/to see both sb's good points and shortcomings (idiom)"],"pinyin":["yi1 fen1 wei2 er4"],"word":"一分为二"},{"definition":["completely incompatible\/lit. incompatible as fire and water"],"pinyin":["shui3 huo3 bu4 rong2"],"word":"水火不容"},{"definition":["to run in parallel without hindrance\/not mutually exclusive\/two processes can be implemented without conflict"],"pinyin":["bing4 xing2 bu4 bei4"],"word":"并行不悖"},{"definition":["dividing line between distinct realms\/boundary\/field-allocation (in Chinese astrology, the association between celestial regions and corresponding terrestrial realms)"],"pinyin":["fen1 ye3"],"word":"分野"},{"definition":["to make no distinction between what's one's own and what's another's (idiom)\/to share everything\/to be on very intimate terms"],"pinyin":["bu4 fen1 bi3 ci3"],"word":"不分彼此"},{"definition":["entirely different\/different as black and white"],"pinyin":["jie2 ran2 bu4 tong2"],"word":"截然不同"},{"definition":["everyone minds their own business"],"pinyin":["jing3 shui3 bu4 fan4 he2 shui3"],"word":"井水不犯河水"},{"definition":["closely guarded\/strongly fortified\/sharply divided"],"pinyin":["bi4 lei3 sen1 yan2"],"word":"壁垒森严"},{"definition":["to crisscross\/to intertwine"],"pinyin":["jiao1 cuo4"],"word":"交错"},{"definition":["to do things each in one's own way"],"pinyin":["ge4 zi4 wei2 zheng4"],"word":"各自为政"},{"definition":["totally different"],"pinyin":["jiong3 yi4"],"word":"迥异"},{"definition":["to cut apart\/to sever\/to separate\/to isolate"],"pinyin":["ge1 lie4"],"word":"割裂"}]}