{"definition":["lit. to wash one's heart and renew one's face (idiom); to repent sincerely and mend one's mistaken ways\/to turn over a new leaf"],"pinyin":["xi3 xin1 ge2 mian4"],"traditional":["洗心革面"],"rank":41175.0,"normalized_rank":0.5760916709806501,"fraction":3.4304742312554057e-7,"cumulative_fraction":0.9969159512601372,"word":"洗心革面","characters":[{"definition":["to wash\/to bathe\/to develop (photo)"],"pinyin":["xi3"],"word":"洗"},{"definition":["heart\/mind\/intention\/center\/core\/CL:顆|颗[ke1],個|个[ge4]"],"pinyin":["xin1"],"word":"心"},{"definition":["animal hide\/leather\/to reform\/to remove\/to expel (from office)"],"pinyin":["ge2"],"word":"革"},{"definition":["flour\/noodles\/(of food) soft (not crunchy)\/(slang) (of a person) ineffectual\/spineless","variant of 麵|面[mian4]","face\/side\/surface\/aspect\/top\/classifier for flat surfaces such as drums, mirrors, flags etc"],"pinyin":["mian4","mian4","mian4"],"word":"面"}],"containing_words":[],"sentences":[{"english":"Im cleaning up and Im moving on, going straight and choosing life.","chinese":"我已经洗心革面，继续前进，一直向前，选择生活。"},{"english":"After released from prison, he was determined to turn over a new leaf.","chinese":"出狱后，他决心洗心革面，重新做人。"},{"english":"Hey, teacher, tell me how do you respawn the students?","chinese":"嘿老师，告诉我你怎样让学生洗心革面的？"},{"english":"He promised me that he would stand in front of me, a thorough new man.","chinese":"他向我保证他将洗心革面，重新做人。"},{"english":"Ceramist and designer Ole Jensen has cleaned up his act.","chinese":"陶艺家兼设计师奥利詹森已经决定洗心革面。"},{"english":"I am cleaning up and I am moving on .","chinese":"我要洗心革面，向前走，选择人生。"},{"english":"She’s a different person now, stronger and free of drugs.","chinese":"她现在洗心革面了，坚强一些了，并且已经戒了毒。"}],"related":[{"definition":["completely correcting one's former misdeeds (idiom); to repent past mistakes and turn over a new leaf\/a reformed character"],"pinyin":["tong4 gai3 qian2 fei1"],"word":"痛改前非"},{"definition":["to start a new life\/to make a fresh start"],"pinyin":["chong2 xin1 zuo4 ren2"],"word":"重新做人"},{"definition":["to mend one's ways (idiom)\/to turn over a new leaf"],"pinyin":["gai3 xie2 gui1 zheng4"],"word":"改邪归正"},{"definition":["to reform and start afresh (idiom); to turn over a new leaf"],"pinyin":["gai3 guo4 zi4 xin1"],"word":"改过自新"},{"definition":["to get back on the right path\/to mend one's ways"],"pinyin":["mi2 tu2 zhi1 fan3"],"word":"迷途知返"},{"definition":["to renounce evil and turn to virtue (idiom)"],"pinyin":["qi4 e4 cong2 shan4"],"word":"弃恶从善"},{"definition":["to repent"],"pinyin":["hui3 wu4"],"word":"悔悟"},{"definition":["the return of a prodigal son (idiom)"],"pinyin":["lang4 zi3 hui2 tou2"],"word":"浪子回头"},{"definition":["a prodigal son returned home is worth more than gold"],"pinyin":["lang4 zi3 hui2 tou2 jin1 bu4 huan4"],"word":"浪子回头金不换"},{"definition":["(of a slave or servant) to be given one's freedom\/(of a prostitute) to marry and leave one's trade"],"pinyin":["cong2 liang2"],"word":"从良"},{"definition":["to repent and start afresh (idiom); to turn over a new leaf"],"pinyin":["hui3 guo4 zi4 xin1"],"word":"悔过自新"},{"definition":["to regret\/to repent"],"pinyin":["hui3 guo4"],"word":"悔过"},{"definition":["to see the error of one's ways\/to make a clean break with one's past"],"pinyin":["fan1 ran2 hui3 wu4"],"word":"翻然悔悟"},{"definition":["lit. to renew one's face and wash one's heart (idiom); to repent sincerely and mend one's mistaken ways\/to turn over a new leaf"],"pinyin":["ge2 mian4 xi3 xin1"],"word":"革面洗心"},{"definition":["lit. to rein in the horse at the edge of the precipice (idiom)\/fig. to act in the nick of time"],"pinyin":["xuan2 ya2 le4 ma3"],"word":"悬崖勒马"},{"definition":["lit. to wash one's hands in a gold basin (idiom)\/fig. to abandon the life of an outlaw"],"pinyin":["jin1 pen2 xi3 shou3"],"word":"金盆洗手"}]}