{"definition":["to spread\/to circulate\/to hand down"],"pinyin":["liu2 chuan2"],"traditional":["流傳"],"rank":6032.0,"normalized_rank":0.08439550599527093,"fraction":0.00001840807070254337,"cumulative_fraction":0.880584292203908,"word":"流传","characters":[{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"},{"definition":["to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)","biography\/historical narrative\/commentaries\/relay station"],"pinyin":["chuan2","zhuan4"],"word":"传"}],"containing_words":[{"definition":["to pass on errors or lies (idiom); the propagation of misconceptions"],"pinyin":["miu4 zhong3 liu2 chuan2"],"word":"谬种流传"},{"definition":["widely praised (idiom); with an extensive public reputation"],"pinyin":["kou3 bei1 liu2 chuan2"],"word":"口碑流传"}],"sentences":[{"english":"A moving legend was often told around the area of Zhongxian County, Sichuan Province.","chinese":"在四川忠县一带，则流传着一则感人肺腑的传说。"},{"english":"But there also have some Warring States Period documents in the spreading process sometimes.","chinese":"但在流传过程中也间杂有一些战国史料。"},{"english":"Unfortunately, however, of great luck, it's been non-circulating Rubbings .","chinese":"然而不幸中的大幸是，它的拓本一直在民间流传。"},{"english":"The world urgently needs the ancient wisdom of the East.","chinese":"世界需要流传了数千年之久的东方智慧。"},{"english":"Because the abacus is a daily-use device made from wood, few of them have survived.","chinese":"因为算盘是一种木质的日常用具，流传下来的很少。"},{"english":"Text 1And yet the myth of controlling the waters persists.","chinese":"但是，控制洪水的神话还在流传着。"},{"english":"Most of these exclamations have survived from earlier days.","chinese":"大多数从早期流传下来的感叹词。"},{"english":"Wolf-grandam stories are in the air all aroud the world.","chinese":"狼外婆故事是广泛流传于世界各地的故事类型。"},{"english":"The third chapter is about the development and spread of late imperial mosaic.","chinese":"第三章是关于帝国晚期镶嵌画的发展和流传情况。"},{"english":"The wildest rumours were circulating in Berlin last night, adds Reuter.","chinese":"路透社还称，昨晚在柏林有几个谣言在广泛流传。"},{"english":"Market this year, what year, everyone gossips.","chinese":"市场今年，哪一年，每个人都流传。"},{"english":"The custom has been held on nowadays.","chinese":"这个习俗一直流传到现在。"},{"english":"The fourth chapter draws an outline of the influence of Florus.","chinese":"第四章评述弗罗鲁斯在后世的影响和流传情况。"},{"english":"His dictionaries, too, were wide ranging in their intended audiences and level of scholarliness.","chinese":"他的字典在其特定的读者和学术界之中广泛流传。"},{"english":"The author has investigated systematically the different versions of \"Miscellanies at Banqiao\" and their circulation.","chinese":"本文系统考察了《板桥杂记》的各种刊本与流传过程。"},{"english":"Huineng became a Buddhist sect sixth generation descendants, this story for a long.","chinese":"慧能成为佛教南宗第六代传人，这故事流传相当久远。"}],"related":[{"definition":["to bequeath (to later generations)\/a legacy"],"pinyin":["liu2 chuan2"],"word":"留传"},{"definition":["widely spread\/widely rumored\/stories abound\/(sb's exploits are) widely circulated"],"pinyin":["sheng4 chuan2"],"word":"盛传"},{"definition":["street stalls\/bookshops\/in the streets"],"pinyin":["fang1 jian1"],"word":"坊间"},{"definition":["legend\/folklore\/to repeat from mouth to mouth\/they say that..."],"pinyin":["chuan2 shuo1"],"word":"传说"},{"definition":["to eulogize\/to pass on praise"],"pinyin":["chuan2 song4"],"word":"传颂"},{"definition":["among the people\/popular\/folk\/non-governmental\/involving people rather than governments"],"pinyin":["min2 jian1"],"word":"民间"},{"definition":["(of news) to spread\/to get around"],"pinyin":["chuan2 kai1"],"word":"传开"},{"definition":["passed on from generation to generation (idiom); to hand down"],"pinyin":["dai4 dai4 xiang1 chuan2"],"word":"代代相传"},{"definition":["rumor"],"pinyin":["yao2 chuan2"],"word":"谣传"},{"definition":["widely known\/on everyone's lips"],"pinyin":["chuan2 song4"],"word":"传诵"},{"definition":["to spread\/to hand down\/to circulate"],"pinyin":["chuan2 liu2"],"word":"传流"},{"definition":["(of skills etc) to die out\/lost\/extinct"],"pinyin":["shi1 chuan2"],"word":"失传"},{"definition":["on the one hand"],"pinyin":["yi1 ze2"],"word":"一则"},{"definition":["rumor\/hearsay"],"pinyin":["chuan2 yan2"],"word":"传言"},{"definition":["to get round fast\/to spread like wildfire"],"pinyin":["bu4 jing4 er2 zou3"],"word":"不胫而走"},{"definition":["unfounded rumor\/to pass on a mistaken belief to others"],"pinyin":["e2 chuan2"],"word":"讹传"}]}