{"definition":["flotation process"],"pinyin":["fu2 xuan3"],"traditional":["浮選"],"rank":52426.0,"normalized_rank":0.7335077581744155,"fraction":1.106510411613446e-7,"cumulative_fraction":0.9992673276344154,"word":"浮选","characters":[{"definition":["to float\/superficial\/floating\/unstable\/movable\/provisional\/temporary\/transient\/impetuous\/hollow\/inflated\/to exceed\/superfluous\/excessive\/surplus"],"pinyin":["fu2"],"word":"浮"},{"definition":["to choose\/to pick\/to select\/to elect"],"pinyin":["xuan3"],"word":"选"}],"containing_words":[],"sentences":[{"english":"Gold recovery from arsenic-containing gold ore has been a major subject of flotation research.","chinese":"从含砷金矿石中回收金一直是浮选研究的重要课题。"},{"english":"The induced-flotation behavior of chalcopyrite and pyrite was investigated.","chinese":"考察了黄铜矿和黄铁矿的诱导浮选行为。"},{"english":"Therefore, the paper studies the flotation characteristic of Low-grade barite.","chinese":"因此，本文进行了低品位重晶石的浮选特性研究。"},{"english":"The CSRC would \"adjust the size and pace\" of flotations while the pilot was introduced.","chinese":"证监会将在试点期间，调整浮选的规模和节奏。"},{"english":"The key technology of coal slurry floatation automatic control was addressed in this paper.","chinese":"分析了煤泥浮选自动控制的特点和关键技术。"},{"english":"Thus, the application of flotation machine was still a considerable way of removing oil.","chinese":"所以，浮选机的应用还是一种值得考虑的除油方法。"},{"english":"The effective flotation of wolframite-slime would still be a difficult problem in need of solution.","chinese":"黑钨矿细泥的有效浮选仍是有待解决的选矿难题。"},{"english":"As a chemical intermediate in the production of plasticisers, flotation agents etc.","chinese":"作为制造增塑剂，浮选剂等之中间体。"},{"english":"The Na 2S-induced flotation behavior of chalcopyrite and pyrite has been investigated.","chinese":"本文研究了黄铜矿，黄铁矿的硫化钠诱导浮选行为。"},{"english":"Thionocarbamates are excellent flotation collectors for sulfide ore.","chinese":"硫氨酯是硫化矿石的优良浮选捕收剂。"},{"english":"Flotation is used for Florida and Kola rock.","chinese":"浮选操作法用于佛罗里达磷矿和科拉磷矿。"},{"english":"Property and slurry character of floatation tailings in Linhuan were analyzed.","chinese":"分析了临涣选煤厂浮选尾煤的性质及成浆性。"},{"english":"The invention relates to a floating and collecting agent of bertrandite beryllium ores and application thereof.","chinese":"本发明涉及一种羟硅铍石类铍矿浮选捕收剂及其应用。"},{"english":"Elimination of the interference of slimes is the key in the flotation of finlegnained hematite ores.","chinese":"排除矿泥的干扰，是浮选细粒红铁矿石成功的关键。"},{"english":"The bubble generator is the key equipment of microbubble floatation.","chinese":"气泡发生器是微泡浮选的关键。"},{"english":"Therefore, application of the floatation froth image processing was studied.","chinese":"为此，进行了浮选泡沫图像处理应用的研究。"}],"related":[{"definition":["mining waste\/waste remaining after processing ore\/tailings"],"pinyin":["wei3 kuang4"],"word":"尾矿"},{"definition":["see 球磨機|球磨机[qiu2 mo2 ji1]"],"pinyin":["qiu2 mo2"],"word":"球磨"},{"definition":["veinstone (stone containing a vein of precious metal)"],"pinyin":["mai4 shi2"],"word":"脉石"},{"definition":["ball mill"],"pinyin":["qiu2 mo2 ji1"],"word":"球磨机"},{"definition":["to remove mud\/desliming (in coal production)"],"pinyin":["tuo1 ni2"],"word":"脱泥"},{"definition":["mercury amalgam"],"pinyin":["hun4 gong3"],"word":"混汞"},{"definition":["siderite"],"pinyin":["ling2 tie3 kuang4"],"word":"菱铁矿"},{"definition":["filtrate\/solid residue produced by a filter\/mud from filtering can sugar"],"pinyin":["lu:4 bing3"],"word":"滤饼"},{"definition":["ilmenite FeTiO3\/titanium ore"],"pinyin":["tai4 tie3 kuang4"],"word":"钛铁矿"},{"definition":["refined ore\/concentrate"],"pinyin":["jing1 kuang4"],"word":"精矿"},{"definition":["waste rock (mining)\/gangue (worthless minerals mixed in with coal or ore)"],"pinyin":["gan1 shi2"],"word":"矸石"},{"definition":["lignite\/brown coal"],"pinyin":["he4 mei2"],"word":"褐煤"},{"definition":["magnetite Fe3O4"],"pinyin":["ci2 tie3 kuang4"],"word":"磁铁矿"},{"definition":["zeolite"],"pinyin":["fei4 shi2"],"word":"沸石"},{"definition":["to sinter\/to agglomerate ore by burning"],"pinyin":["shao1 jie2"],"word":"烧结"},{"definition":["to roast\/to bake (e.g. mineral ore)"],"pinyin":["bei4 shao1"],"word":"焙烧"}]}