{"definition":["to melt (e.g. an icecap)"],"pinyin":["xiao1 rong2"],"traditional":["消融"],"rank":26835.0,"normalized_rank":0.3754564660780994,"fraction":0.0000012552616133857547,"cumulative_fraction":0.9867936637919998,"word":"消融","characters":[{"definition":["to disappear\/to vanish\/to eliminate\/to spend (time)\/have to\/need"],"pinyin":["xiao1"],"word":"消"},{"definition":["to melt\/to thaw\/to blend\/to merge\/to be in harmony","old variant of 融[rong2]"],"pinyin":["rong2","rong2"],"word":"融"}],"containing_words":[],"sentences":[{"english":"Results These pathways were successfully ablated in 9 patients.","chinese":"结果本组10例患者，射频消融9条旁道成功。"},{"english":"The ice fields at the roof of the world are shrinking.","chinese":"这世界屋脊的冰原也在渐渐消融。"},{"english":"The ablation target site was the isthmus between tricuspid valve annulus and inferior vana cava.","chinese":"位于三尖瓣环和下腔静脉口间的峡部为消融部位。"},{"english":"Objective To summarize the nursing of atrial tachyarrhythmia after radiofrequency current catheter ablation(RCCA) .","chinese":"目的总结导管射频消融治疗快速房性心律失常的护理。"},{"english":"If treatment is desired, ablative or excisional modalities are appropriate.","chinese":"如确实需要治疗，可进行消融或切除。"},{"english":"The dominant mechanism by which interventional ultrasound energy dissolves thrombi is acoustic cavitation.","chinese":"超声介入消融血栓的主要作用机制是声学空化效应。"},{"english":"Some icebergs, however, drift north to warmer climates and disintegrate.","chinese":"不过，也有一些冰山会往北漂流到温带然后消融。"},{"english":"Right-sided accessory atrioventricular pathways were ablated by radiofrequency current in 6 patients with Wolff-Parkinson-White syndrome.","chinese":"以射频电流消融6例预激综合征患者的右侧旁路。"},{"english":"To investigate the outcome of radiofrequency ablation (RFA) in treatment for liver cancer located in the second hepatic portal.","chinese":"探讨第二肝门区肝癌射频消融的治疗结局。"},{"english":"The experience of RFA in the treatment of atrial flutter in children should be accumulated.","chinese":"射频消融治疗儿童心房扑动需积累经验。"},{"english":"LITT of brain tumors need exact location.","chinese":"脑部肿瘤激光消融需要精确的定位。"},{"english":"Radiofrequency ablation is used to treat many types of liver cancer. The two most common types are","chinese":"射频消融术能够用于治疗许多类型的肝癌。"},{"english":"Radiofrequency Catheter Ablation for Idiopathic Ventricular Tachycardia of Atypical Site.","chinese":"特殊部位特发性室性心动过速的射频消融。"},{"english":"The retreat of the glaciers threatens agriculture downstream.","chinese":"冰川的消融威胁着下游的农业。"},{"english":"Focal atrial fibrillation treated by circumferential radiofrequency catheter ablation of pulmonary vein orifice.","chinese":"导管射频肺静脉口环状消融治疗局灶性心房颤动。"},{"english":"Linear ablation along the isthmus between tricuspid valve and inferior vena cava was performed.","chinese":"于右房三尖瓣环与下腔静脉之间的峡部进行线性消融。"}],"related":[{"definition":["to melt\/molten\/fig. to understand thoroughly"],"pinyin":["rong2 jie3"],"word":"融解"},{"definition":["to dissipate"],"pinyin":["xiao1 san4"],"word":"消散"},{"definition":["erosion\/wearing away\/ablation"],"pinyin":["xiao1 shi2"],"word":"消蚀"},{"definition":["to melt\/to thaw\/to dissolve\/to blend into\/to combine\/to fuse"],"pinyin":["rong2 hua4"],"word":"融化"},{"definition":["ice\/(fig.) frosty relationship"],"pinyin":["jian1 bing1"],"word":"坚冰"},{"definition":["to melt\/to dissolve (of sugar etc)"],"pinyin":["rong2 hua4"],"word":"溶化"},{"definition":["to eliminate\/to obliterate"],"pinyin":["xiao1 min3"],"word":"消泯"},{"definition":["to condense\/to solidify\/to coagulate\/clot (of blood)"],"pinyin":["ning2 jie2"],"word":"凝结"},{"definition":["(literary) to eliminate\/to put an end to"],"pinyin":["xiao1 mi3"],"word":"消弭"},{"definition":["to freeze over\/to ice over\/icebound\/to shelve (a proposal etc)"],"pinyin":["bing1 feng1"],"word":"冰封"},{"definition":["to dissipate everywhere (of light, sound, gas etc)"],"pinyin":["mi2 san4"],"word":"弥散"},{"definition":["to spread out after being diluted or melted\/to dissolve into a liquid"],"pinyin":["hua4 kai1"],"word":"化开"},{"definition":["to cleanse\/to scrub\/to scour\/to wash down\/to erode\/to wash away"],"pinyin":["chong1 shua1"],"word":"冲刷"},{"definition":["ice crystals"],"pinyin":["bing1 jing1"],"word":"冰晶"},{"definition":["to burn\/to scorch\/to cauterize"],"pinyin":["shao1 zhuo2"],"word":"烧灼"},{"definition":["to wane\/to vanish gradually"],"pinyin":["xiao1 tui4"],"word":"消退"}]}