{"definition":["to eliminate\/to dispel\/resolution"],"pinyin":["xiao1 jie3"],"traditional":["消解"],"rank":24473.0,"normalized_rank":0.3424090215885719,"fraction":0.0000015581651891242642,"cumulative_fraction":0.9834912840524482,"word":"消解","characters":[{"definition":["to disappear\/to vanish\/to eliminate\/to spend (time)\/have to\/need"],"pinyin":["xiao1"],"word":"消"},{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","to transport under guard","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","surname Xie"],"pinyin":["xie4","jie4","jie3","Xie4"],"word":"解"}],"containing_words":[],"sentences":[{"english":"A procedure was carried out for digesting viscera sample with a high pressuredigester.","chinese":"本文介绍高压消解器消化脏器检材的方法。"},{"english":"But the North Koreans know how to deal with a frontal assault.","chinese":"但是朝鲜人懂得如何消解正面的攻势。"},{"english":"When performing acid digestions, the use of closed vessel digestion or the use of condensers should be considered.","chinese":"当进行酸消解时，应该考虑采用密闭消解或是冷凝器。"},{"english":"When performing acid digestions, the use of closed vessel digestion or the use of condensers should be considered.","chinese":"当进行酸消解时，应该考虑采用密闭消解或是冷凝器。"},{"english":"It emphasizes the swordman's social significance and his social value to dispel violence.","chinese":"通过强调侠客的社会意义和社会价值来消解暴力。"},{"english":"The coreference resolution is an important subtask of information extraction.","chinese":"共指消解是信息抽取中一个重要子任务。"},{"english":"At least 10 prizes will be awarded and, in addition, honorary mentions.","chinese":"至少10奖金将被授予荣誉，除此之外，指代消解。"},{"english":"Rhodium was decomposed through microwave digestion and ammonium rhodium hexachloride was dissolved with high purity water.","chinese":"利用微波消解法溶解铑，超纯水溶解氯铑酸铵。"},{"english":"MayBodhichitta flourish, and dissolve the scourge of ignorance.","chinese":"愿菩提心常在，消解愚昧之灾难。"},{"english":"Therefore, the absoluteness of meaning is deconstructed and the myth of \"faithfulness\" is terminated.","chinese":"这就消解了意义的绝对性，也终结了“忠实”的神话。"},{"english":"The hypostasis of scheduling problem is the process of conflict resolving.","chinese":"调度问题的本质是对存在的冲突进行消解的过程。"},{"english":"The article holds that health travel is the good prescription to clear up the third state.","chinese":"本文认为，健康旅游是消解第三状态的良方。"},{"english":"Did dispelling the illusion hurt your work?","chinese":"消解这些错误观念对你的工作产生负面影响了吗？"},{"english":"Post-modernity transcends modernity by the means of negating and clearing up selfhood.","chinese":"后现代超越现代性是通过否定和消解主体来实现的。"},{"english":"If liquor samples had serious impurity, microwave resolution method should be adopted firstly.","chinese":"若杂质比较严重的酒样，宜采取微波消解法。"},{"english":"Chen Ran's awareness beyond sex is dissolves the opposing principles between men and women.","chinese":"陈染创作的超性别意识是对男女二元对立原则的消解。"}],"related":[{"definition":["(literary) to eliminate\/to put an end to"],"pinyin":["xiao1 mi3"],"word":"消弭"},{"definition":["to dispel (doubts)\/to clear up (misunderstanding)"],"pinyin":["xiao1 shi4"],"word":"消释"},{"definition":["to eliminate\/to remove"],"pinyin":["xiao1 chu2"],"word":"消除"},{"definition":["to dilute"],"pinyin":["chong1 dan4"],"word":"冲淡"},{"definition":["to water down\/to play down\/to trivialize\/to weaken\/to become dull with time\/to desalinate\/desalination"],"pinyin":["dan4 hua4"],"word":"淡化"},{"definition":["to eliminate"],"pinyin":["xiao1 qu4"],"word":"消去"},{"definition":["to cause a wound to close up and heal"],"pinyin":["mi2 he2"],"word":"弥合"},{"definition":["to counteract\/to cancel out\/to offset"],"pinyin":["di3 xiao1"],"word":"抵消"},{"definition":["to mediate\/to reconcile\/to make peace\/to intervene"],"pinyin":["pai2 jie3"],"word":"排解"},{"definition":["to deconstruct"],"pinyin":["jie3 gou4"],"word":"解构"},{"definition":["weaken\/make weaker"],"pinyin":["ruo4 hua4"],"word":"弱化"},{"definition":["to dissolve\/to resolve (contradictions)\/to dispel (doubts)\/to iron out (difficulties)\/to defuse (conflicts)\/to neutralize (fears)"],"pinyin":["hua4 jie3"],"word":"化解"},{"definition":["to dissipate"],"pinyin":["xiao1 san4"],"word":"消散"},{"definition":["to collapse\/to disintegrate\/to crumble"],"pinyin":["wa3 jie3"],"word":"瓦解"},{"definition":["to eliminate\/to do away with\/to get rid of"],"pinyin":["po4 chu2"],"word":"破除"},{"definition":["to drive off\/to dispel\/to expel"],"pinyin":["qu1 chu2"],"word":"驱除"}]}