{"definition":["to silt up\/silt\/sediment\/ooze\/slurry"],"pinyin":["yu1 ji1"],"traditional":["淤積"],"rank":26227.0,"normalized_rank":0.3669497572509899,"fraction":0.0000013243090308914487,"cumulative_fraction":0.9860098831994708,"word":"淤积","characters":[{"definition":["silt\/river sludge\/to silt up\/choked with silt\/variant of 瘀[yu1]"],"pinyin":["yu1"],"word":"淤"},{"definition":["to amass\/to accumulate\/to store\/measured quantity (such as area of volume)\/product (the result of multiplication)\/to integrate (math.)\/to solve (or integrate) an ordinary differential equation (math.)\/old\/long-standing"],"pinyin":["ji1"],"word":"积"}],"containing_words":[],"sentences":[{"english":"Pooling in the pelvic cavity. Which means her heart was stillpumping.","chinese":"骨盆腔有血液淤积，说明当时她的心脏还在跳动。"},{"english":"This paper dwells the concepts of retrogressive aggradation and the datum of erosion.","chinese":"本文阐述了溯源淤积和侵蚀基准面的概念。"},{"english":"Dredging is only a temporary solution to this problem.","chinese":"疏浚解决河口淤积问题只治标。"},{"english":"In this paper, characters of up-stream extension of sedimentation in reservoirs of silt-laden stream were discussed.","chinese":"本文论述了多沙河流水库淤积上延的特点。"},{"english":"Conclusion Cholestasis probably exists in neonates with pathologic jaundice.","chinese":"结论病理性黄疸患儿可能存在胆汁淤积。"},{"english":"A by-product of this halt to blood-flow is the temporary backup of blood.","chinese":"血液暂缓流动的附带结果之一即为血液的暂时淤积。"},{"english":"The commission has succeeded in reducing flooding and sedimentation.","chinese":"委员会已经成功减轻了洪水和泥沙淤积的状况。"},{"english":"According to the measured data, the sediment deposition in the canal system of Weishan Irrigation District was analyzed.","chinese":"根据实测资料，分析位山灌区渠系泥沙淤积问题。"},{"english":"The settling process of suspended sediment is investigated by solving diffusion equation in this paper.","chinese":"本文通过求解扩散方程探讨了悬移质泥沙的淤积问题。"},{"english":"The channel had chocked up with sand so that boats couldn't use it.","chinese":"航道被沙土淤积堵塞，因此船舶不能使用它了。"},{"english":"The silting gradually weakened its intensity and transited into scouring state from nearshore to shallow sea area.","chinese":"由近岸往外，淤积强度逐渐减弱，并过渡为冲刷状态。"},{"english":"There appeared serious sedimentation in outer channel of Huanghua Port during heavy wind climate after its operation.","chinese":"黄骅港运用后，偏北大风引起外航道的泥沙淤积严重。"},{"english":"There is a serious sediment deposition in the wharf apron of an alongshore pile wharf.","chinese":"顺岸式桩基码头前沿会发生较为严重的泥沙淤积。"},{"english":"The pathogenesis of intrahepatic cholestasis of pregnancy(ICP) is unclear now.","chinese":"妊娠肝内胆汁淤积症发病原因尚不明确。"},{"english":"The evaluation on silting rate of Jing River bed in historical times.","chinese":"历史阿期荆江河床淤积速率的评估。"},{"english":"Objective To study the mechanism of rhubarb treatment on the cholestasis from gastrointestinal electrophysiology.","chinese":"目的从胃肠电生理探讨大黄治疗胆汁淤积的机制。"}],"related":[{"definition":["choked with silt\/silted up"],"pinyin":["yu1 se4"],"word":"淤塞"},{"definition":["silted up\/obstructed by silt\/variant of 瘀滯|瘀滞[yu1 zhi4]"],"pinyin":["yu1 zhi4"],"word":"淤滞"},{"definition":["sediment\/deposit\/sedimentation (geology)"],"pinyin":["chen2 ji1"],"word":"沉积"},{"definition":["silt\/river sludge\/to silt up\/choked with silt\/variant of 瘀[yu1]"],"pinyin":["yu1"],"word":"淤"},{"definition":["to stockpile"],"pinyin":["ji1 cun2"],"word":"积存"},{"definition":["to accumulate\/to collect\/to build up"],"pinyin":["ju4 ji1"],"word":"聚积"},{"definition":["(in Chinese medicine) stasis (of blood or other fluids)"],"pinyin":["yu1 zhi4"],"word":"瘀滞"},{"definition":["to pile up\/to heap\/accumulation"],"pinyin":["dui1 ji1"],"word":"堆积"},{"definition":["to coalesce\/to gather together\/to amass"],"pinyin":["ji1 ju4"],"word":"积聚"},{"definition":["to clog up\/blockage"],"pinyin":["du3 se4"],"word":"堵塞"},{"definition":["variant of 瘀血[yu1 xue4]"],"pinyin":["yu1 xue4"],"word":"淤血"},{"definition":["to block\/to clog"],"pinyin":["zu3 se4"],"word":"阻塞"},{"definition":["pent-up frustrations\/sth that has accumulated in one's mind for a long time"],"pinyin":["ji1 yu4"],"word":"积郁"},{"definition":["retention (medicine)"],"pinyin":["zhu1 liu2"],"word":"潴留"},{"definition":["clotted blood\/extravasated blood (leaking into surrounding tissue)\/thrombosis"],"pinyin":["yu1 xue4"],"word":"瘀血"},{"definition":["to unblock\/to dredge\/to clear the way\/to get things flowing\/to facilitate\/to mediate\/to lobby\/to explicate (a text)"],"pinyin":["shu1 tong1"],"word":"疏通"}]}