{"definition":["to permeate"],"pinyin":["shen4 ru4"],"traditional":["滲入"],"rank":20021.0,"normalized_rank":0.2801197655058554,"fraction":0.00000238892386359552,"cumulative_fraction":0.9748882477875568,"word":"渗入","characters":[{"definition":["to seep\/to ooze\/to horrify"],"pinyin":["shen4"],"word":"渗"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"}],"containing_words":[],"sentences":[{"english":"Be vigilant against the danger of enemy agents infiltrating the government and boring from within.","chinese":"警惕敌特渗入政府内部进行暗中破坏。"},{"english":"What happened is that a group of Jihadists managed to infiltrate the town over night.","chinese":"一股圣战组织成员在夜间得以渗入廷巴克图。"},{"english":"Let the sleeping death seep through.","chinese":"苹果醮毒，让死之沉睡渗入。"},{"english":"If still does not work, can check whether the infiltration of air wheel.","chinese":"如仍无效，可查分泵是否渗入空气。"},{"english":"The speed with which a penetrant penetrates a surface flaw is influenced to the greatest extent by which of the following properties?","chinese":"下列哪种性能对渗透剂渗入表面缺陷的速度影响最大？"},{"english":"The ministry says it believes the three civilians were killed by infiltrators.","chinese":"部长说，相信这三位市民是被渗入者杀害的。"},{"english":"Essence of winter sleep is on the night.","chinese":"冬日睡眠的凝香已渗入黑夜。"},{"english":"It has been seeping into groundwater from ­industry for years.","chinese":"多年来它已经从工业污染物里渗入到地下水。"},{"english":"Art with the powerful penetrating power infiltrates into each minute of your time.","chinese":"艺术带着强烈的穿透力渗入了人们的每一分钟时光。"},{"english":"This tendency seeps into hiring.","chinese":"这个倾向会渗入到招聘中。"},{"english":"The information technology already permeated the modern business management each quoin.","chinese":"信息技术已经渗入到现代企业管理的每个角落。"},{"english":"The significance of this decision has yet to permeate the public consciousness.","chinese":"该决定的重大意义尚未渗入公众意识。"},{"english":"The outer walls of the mounds are built to allow only eddies changing with low frequencies to penetrate deep within them.","chinese":"蚁丘的外墙设计成只让低频率的气流渗入内部的结构。"},{"english":"Water starts to spill into Padmé's mask.","chinese":"水开始渗入帕德梅的面罩中。"},{"english":"One of the main trends of lily breeding is to realize introgression between these groups.","chinese":"实现它们之间的种质渗入是百合育种的主要方向之一。"},{"english":"Knock-offs may be seeping into the market.","chinese":"所以很多仿制品可能已经渗入市场。"}],"related":[{"definition":["(lit. and fig.) to permeate\/to seep into\/(of a product, idea etc) to penetrate (in a population)\/(of hostile forces) to infiltrate\/(chemistry) osmosis"],"pinyin":["shen4 tou4"],"word":"渗透"},{"definition":["to soak\/to dip"],"pinyin":["jin4 ru4"],"word":"浸入"},{"definition":["(usually of sth intangible) to seep into\/to permeate"],"pinyin":["qin4 ru4"],"word":"沁入"},{"definition":["to soak\/to saturate\/to drench\/to permeate"],"pinyin":["jin4 tou4"],"word":"浸透"},{"definition":["to make (military) incursions\/to invade\/to intrude into\/to trespass\/to gain unauthorized access (computing)"],"pinyin":["qin1 ru4"],"word":"侵入"},{"definition":["to permeate\/to percolate\/fig. to saturate (with emotion)"],"pinyin":["jin4 run4"],"word":"浸润"},{"definition":["to absorb\/to assimilate\/to ingest\/to recruit"],"pinyin":["xi1 shou1"],"word":"吸收"},{"definition":["to erode\/to corrode"],"pinyin":["qin1 shi2"],"word":"侵蚀"},{"definition":["to overflow\/to spill over\/(computing) overflow"],"pinyin":["yi4 chu1"],"word":"溢出"},{"definition":["surface layer"],"pinyin":["biao3 ceng2"],"word":"表层"},{"definition":["corrosion\/to corrode (degrade chemically)\/to rot\/corruption"],"pinyin":["fu3 shi2"],"word":"腐蚀"},{"definition":["to seep out\/to exude"],"pinyin":["shen4 chu1"],"word":"渗出"},{"definition":["to dissolve"],"pinyin":["rong2 jie3"],"word":"溶解"},{"definition":["to melt\/to dissolve (of sugar etc)"],"pinyin":["rong2 hua4"],"word":"溶化"},{"definition":["to be contaminated\/to be gradually influenced"],"pinyin":["jin4 ran3"],"word":"浸染"},{"definition":["to melt\/to thaw\/to dissolve\/to blend into\/to combine\/to fuse"],"pinyin":["rong2 hua4"],"word":"融化"}]}