{"definition":["to wander\/to roam about\/to loaf about\/to be idle"],"pinyin":["you2 dang4"],"traditional":["遊蕩"],"rank":20116.0,"normalized_rank":0.28144893876009125,"fraction":0.000002367173197193092,"cumulative_fraction":0.9751141008683744,"word":"游荡","characters":[{"definition":["to swim\/variant of 遊|游[you2]","to walk\/to tour\/to roam\/to travel","surname You"],"pinyin":["you2","you2","You2"],"word":"游"},{"definition":["to wash\/to squander\/to sweep away\/to move\/to shake\/dissolute\/pond","variant of 蕩|荡[dang4]","variant of 燙|烫[tang4]\/variant of 趟[tang4]"],"pinyin":["dang4","dang4","tang4"],"word":"荡"}],"containing_words":[{"definition":["Ein Gespenst geht um in Europa.\/the opening sentence of Marx and Engels' \"Communist Manifesto\""],"pinyin":["Yi1 ge4 you1 ling2 zai4 Ou1 zhou1 you2 dang4"],"word":"一个幽灵在欧洲游荡"}],"sentences":[{"english":"So in the interest of helping out the next generation of thieves, I'm going to offer you a few pointers.","chinese":"所以，为了有助于下一代游荡者们，我准备教你几招。"},{"english":"We found people wandering like ghosts through the ruins .","chinese":"孤魂野鬼一样的人们在废墟里游荡。"},{"english":"People walked through the streets aimlessly with nowhere to go, carrying the few bags and possessions they had left.","chinese":"人们带着仅剩的财物包裹漫无目的游荡。"},{"english":"We need to cough up the goop and not let it just hang out in the back of the throat.).","chinese":"我们需要这种糊状物质，不让他在咽喉里游荡。"},{"english":"On average throughout all the quarter-million responses, minds were wandering 47 percent of the time.","chinese":"在25万回应中，平均下来思绪47%的时间在游荡。"},{"english":"The survivors wandered about the jungle for days before being picked up by a search party.","chinese":"幸存者在丛林中游荡了好几天，才被搜索队救出来。"},{"english":"They wandered the world and found half- made human beings.","chinese":"他们在世界上游荡并创造出人类的半成品。"},{"english":"Christlike vagrant wanders through a perverse and grotesque land filled with religious and sacrilegious imagery.","chinese":"像督流浪满宗教渎圣象异堕落游荡。"},{"english":"All love to be out by the light of the moon.","chinese":"它们都爱在月光下出来游荡。"},{"english":"When it was time for his appointment he drifted uptown to the club entrance.","chinese":"快到约会的时间，他游游荡荡地向夜总会的大门走去。"},{"english":"Drunken youths hang around outside looking for trouble.","chinese":"喝醉的年轻人在街头游荡，酗酒滋事。"},{"english":"Thin, hungry dogs roamed the streets.","chinese":"又瘦又饿的狗在街上游荡。"},{"english":"But stop and loiter all the time, to sing it in extatic songs.","chinese":"偶尔懒了游荡而已，哼着歌曲说说梦呓。"},{"english":"And there would be some strange people hanging out.","chinese":"会有一些奇奇怪怪的人在那里游荡。"},{"english":"And I am told that it is haunted by the Ghost of Might-have-Been.","chinese":"我听说这栋房子里游荡着一个叫做“没准”的鬼魂。"},{"english":"He also walked the streets by himself, observing and thinking.","chinese":"他也会一个人游荡在街头，一边观察和思考。"}],"related":[{"definition":["to rock\/to sway\/to shake"],"pinyin":["huang4 dang5"],"word":"晃荡"},{"definition":["to drift\/to wave\/to float on the waves\/to flutter in the wind"],"pinyin":["piao1 dang4"],"word":"飘荡"},{"definition":["aimless\/at random"],"pinyin":["man4 wu2 mu4 di4"],"word":"漫无目的"},{"definition":["to go sightseeing\/to spend one's leisure time wandering around"],"pinyin":["you2 guang4"],"word":"游逛"},{"definition":["wandering\/unfixed\/to migrate"],"pinyin":["you2 zou3"],"word":"游走"},{"definition":["to roll\/to wander around\/to appear repeatedly"],"pinyin":["zhuan4 you5"],"word":"转悠"},{"definition":["to go through\/to bore through\/to push one's way through"],"pinyin":["chuan1 xing2"],"word":"穿行"},{"definition":["to travel back and forth\/to shuttle"],"pinyin":["chuan1 suo1"],"word":"穿梭"},{"definition":["to cruise"],"pinyin":["you2 yi4"],"word":"游弋"},{"definition":["to drift about\/to wander\/to roam\/nomadic\/homeless\/unsettled (e.g. population)\/vagrant"],"pinyin":["liu2 lang4"],"word":"流浪"},{"definition":["to swing\/to sway\/to wobble\/to hang around\/to hover around"],"pinyin":["huang4 you5"],"word":"晃悠"},{"definition":["to stroll"],"pinyin":["xian2 guang4"],"word":"闲逛"},{"definition":["to come and go\/to roam about (mostly unseen)\/(of a ghost) to haunt (a place)\/(of a criminal) to stalk (the streets)\/(of the sun) to rise and set"],"pinyin":["chu1 mo4"],"word":"出没"},{"definition":["to flee in disarray\/to scatter"],"pinyin":["luan4 cuan4"],"word":"乱窜"},{"definition":["variant of 飄盪|飘荡[piao1 dang4]"],"pinyin":["piao1 dang4"],"word":"漂荡"},{"definition":["to float\/to hover\/to drift (also fig., to lead a wandering life)\/to rove\/showy\/superficial"],"pinyin":["piao1 fu2"],"word":"漂浮"}]}