{"definition":["lake Dianchi in Yunnan"],"pinyin":["Dian1 chi2"],"traditional":["滇池"],"rank":21649.0,"normalized_rank":0.3028975976942342,"fraction":0.000002025585550336171,"cumulative_fraction":0.9784668244960096,"word":"滇池","characters":[{"definition":["abbr. for Yunnan Province 雲南|云南[Yun2 nan2] in southwest China"],"pinyin":["Dian1"],"word":"滇"},{"definition":["pond\/reservoir\/moat","surname Chi"],"pinyin":["chi2","Chi2"],"word":"池"}],"containing_words":[],"sentences":[{"english":"The Dianchi Lake plays an important role in the industrial and agricultural production of Kunming Metropolitan and the everyday life of the people.","chinese":"滇池在昆明地区工农业生产和民人生活中起重要作用。"},{"english":"The company is located in the beautiful Dianchi Lake.","chinese":"公司座落于美丽的滇池湖畔。"},{"english":"A method of separation and determination is applied to analysis chromium species in Dianchi.","chinese":"对滇池水中铬形态化合物进行了分离和测定。"},{"english":"To investigate mental health status of different sex farmers along Dian Chi Lake of Jinning county.","chinese":"了解晋宁县滇池沿岸不同性别农民的心理健康状况。"},{"english":"Ze-chen company was founded in 2008, located in the beautiful Dianchi Lake.","chinese":"泽臣公司成立于2008年，位于美丽的滇池湖畔。"},{"english":"My name is 1990's House is also one of the Dianchi Lake to watch a good place.","chinese":"大观楼是我国名楼之一，也是观赏滇池的好地方。"},{"english":"He mentioned that the water in Dianchi of Yunnan province is heavy polluted and it might take 30 years to treat the polluted water.","chinese":"他说云南滇池的水污染严重，处理污染至少要三十年。"},{"english":"Dianchi is one of the most eutrophication lake in China.","chinese":"滇池是中国水体富营养化最严重的湖泊之一。"},{"english":"Therefore the countermeasures of Dianchi Lake protection and carps aquiculture development were put forward.","chinese":"从而提出保护滇池水体，发展鲤鱼养殖的对策和措施。"},{"english":"Third, strengthen the protection of Dianchi Lake and enhance sustainable utilization of water resources.","chinese":"三是加大滇池保护力度，促进水资源的可持续利用。"},{"english":"In five hundred Dianchi ran the fundus, Phi Lapel shore conical cap, like the vast open without boundary.","chinese":"五百里滇池奔来眼底，披襟岸帻，喜茫茫空阔无边。"},{"english":"Me and my brothers and sisters who live together in the beautiful Dianchi Lake Village.","chinese":"我和我的兄弟姐妹们共同生活在美丽的滇池里。"},{"english":"And finally the judgement of eutrophication level for Lake dianc- hi in 1988 was given.","chinese":"最终对滇池1988年度的富营养程度进行了判别。"},{"english":"Both male and female Dian people wore symmetrical pieces jackets without collar.","chinese":"滇池地区滇人男女均穿对襟无领外衣。"},{"english":"Numerical analysis on influence of topography on wind-driven current in lake;","chinese":"用二维风生流数值模型模拟滇池湖流运动。"},{"english":"By estimate, scrubable weathered ores in the Dianchi Distriet occur in large quantities.","chinese":"经计算，滇池地区赋存大量擦洗风化矿。"}],"related":[{"definition":["Caohai Lake, Guizhou"],"pinyin":["Cao3 hai3"],"word":"草海"},{"definition":["Erhai Lake"],"pinyin":["Er3 hai3"],"word":"洱海"},{"definition":["Honghe county in Honghe Hani and Yi autonomous prefecture, Yunnan\/Red River in China\/Northern Vietnam"],"pinyin":["Hong2 he2"],"word":"红河"},{"definition":["Chengjiang county in Yuxi 玉溪[Yu4 xi1], east Yunnan, famous as lower Cambrian fossil site"],"pinyin":["Cheng2 jiang1"],"word":"澄江"},{"definition":["Jinning county in Kunming 昆明[Kun1 ming2], Yunnan"],"pinyin":["Jin4 ning2"],"word":"晋宁"},{"definition":["Kunming prefecture-level city and capital of Yunnan province in southwest China"],"pinyin":["Kun1 ming2"],"word":"昆明"},{"definition":["Chenggong county in Kunming 昆明[Kun1 ming2], Yunnan"],"pinyin":["Cheng2 gong4"],"word":"呈贡"},{"definition":["Nujiang river of south Tibet and northwest Yunnan, the upper reaches of Salween river 薩爾溫江|萨尔温江, forming border of Myanmar and Thailand"],"pinyin":["Nu4 jiang1"],"word":"怒江"},{"definition":["Lancang River of Qinghai and Yunnan, the upper reaches of Mekong River 湄公河[Mei2 gong1 He2] of Southeast Asia"],"pinyin":["Lan2 cang1 Jiang1"],"word":"澜沧江"},{"definition":["Mengzi county in Honghe Hani and Yi autonomous prefecture, Yunnan"],"pinyin":["Meng2 zi4"],"word":"蒙自"},{"definition":["Xihu or West lake (place name)\/West Lake in Hangzhou 杭州, Zhejiang\/Xihu or Hsihu township in Miaoli county 苗栗縣|苗栗县[Miao2 li4 xian4], northwest Taiwan"],"pinyin":["Xi1 hu2"],"word":"西湖"},{"definition":["Dali Bai autonomous prefecture 大理白族自治州 in Yunnan","judicial officer\/justice of the peace (old)"],"pinyin":["Da4 li3","da4 li3"],"word":"大理"},{"definition":["Yingjiang county in Dehong Dai and Jingpo autonomous prefecture 德宏傣族景頗族自治州|德宏傣族景颇族自治州[De2 hong2 Dai3 zu2 Jing3 po1 zu2 zi4 zhi4 zhou1], Yunnan"],"pinyin":["Ying2 jiang1"],"word":"盈江"},{"definition":["Irrawaddy or Ayeyarwaddy River, the main river of Myanmar (Burma)"],"pinyin":["Yi1 luo4 wa3 di3 Jiang1"],"word":"伊洛瓦底江"},{"definition":["Heqing county in Dali Bai autonomous prefecture 大理白族自治州[Da4 li3 Bai2 zu2 zi4 zhi4 zhou1], Yunnan"],"pinyin":["He4 qing4"],"word":"鹤庆"},{"definition":["River Li, Guangxi"],"pinyin":["Li2 jiang1"],"word":"漓江"}]}