{"definition":["to lag behind"],"pinyin":["zhi4 hou4"],"traditional":["滯後"],"rank":6810.0,"normalized_rank":0.09528073538259203,"fraction":0.000015334219813711665,"cumulative_fraction":0.8936587612744138,"word":"滞后","characters":[{"definition":["sluggish"],"pinyin":["zhi4"],"word":"滞"},{"definition":["empress\/queen\/(archaic) monarch\/ruler","back\/behind\/rear\/afterwards\/after\/later\/post-","surname Hou"],"pinyin":["hou4","hou4","Hou4"],"word":"后"}],"containing_words":[],"sentences":[{"english":"But the development of tolerancing design in mechanical product has lagged behind them greatly.","chinese":"但是，机械产品公差设计的发展却远远地滞后于它们。"},{"english":"Behind the development of the region's biggest re GREt is not dare to break through.","chinese":"发展滞后地区的最大遗憾是不敢闯。"},{"english":"This is mainly caused by the lagging of the turbocharger.","chinese":"这主要是由于涡轮增压器的滞后所致。"},{"english":"In recent years, the growth in agriculture and the rural sector slowed and the increase in farm incomes was lagging behind that of non-agricultural incomes.","chinese":"近年来，农业和农村发展滞后，农业收入增速迟缓。"},{"english":"Upon on the basis, the free interface CMS theory was developed for hysteretic damping structure.","chinese":"在此基础上，发展了滞后阻尼结构的模态综合理论。"},{"english":"The problem was that Duan's plan was ahead of its time, while official policy at the time still lagged behind.","chinese":"段祺华的想法过于超前，而当时的政策仍然滞后。"},{"english":"Equations for polarization curve and the height of hysteric ring were derived and examined.","chinese":"推导并验证了极化曲线和滞后圈高度的方程式。"},{"english":"The teachers troop constructs the lag, lacks the high quality teacher.","chinese":"师资队伍建设滞后，缺乏高素质的教师。"},{"english":"But it failed to be applied effectively in China because of legislative lag.","chinese":"由于立法滞后，外贸代理制在我国没有得到有效推行。"},{"english":"Secondly, the delaying effect of short day length had certain characteristic of \"lag response time\".","chinese":"第二，短日延迟作用有一定的“滞后期”。"},{"english":"All these reveal the awkwardness of legal compliance and the sadness of scholarly lag of the reality.","chinese":"这一切彰显了有法不依的尴尬和学术滞后现实的悲哀。"},{"english":"Modern book editions are complicated and various, but the rules of book description are backward.","chinese":"现代图书版本类型复杂多样，而著录规则滞后。"},{"english":"In terms of construction of auxiliary police forces, China appears to be far behind and lack of standardization.","chinese":"我国在辅警建设方面显得远远滞后，不够规范。"},{"english":"The hysteretic loss keeps constant until the end of the fatigue life.","chinese":"疲劳过程中材料的滞后损失基本保持不变。"},{"english":"The development of modem storage industry in china is relatively late, and undeveloped.","chinese":"现代仓储业在我国起步较晚，发展滞后。"},{"english":"The current lags behind the voltage.","chinese":"电流滞后于电压。"}],"related":[{"definition":["imperfect"],"pinyin":["bu4 wan2 shan4"],"word":"不完善"},{"definition":["to be ahead of one's time\/to surpass or outdo one's predecessors\/to be ahead of the pack\/to take the lead\/advanced"],"pinyin":["chao1 qian2"],"word":"超前"},{"definition":["to restrict\/condition"],"pinyin":["zhi4 yue1"],"word":"制约"},{"definition":["insufficient\/lacking\/deficiency\/not enough\/inadequate\/not worth\/cannot\/should not"],"pinyin":["bu4 zu2"],"word":"不足"},{"definition":["weak\/frail"],"pinyin":["bo2 ruo4"],"word":"薄弱"},{"definition":["to come apart"],"pinyin":["tuo1 jie2"],"word":"脱节"},{"definition":["(of systems, facilities etc) comprehensive\/well-developed\/excellent\/to refine\/to improve"],"pinyin":["wan2 shan4"],"word":"完善"},{"definition":["to lack\/to be short of\/lack\/shortage"],"pinyin":["que1 fa2"],"word":"缺乏"},{"definition":["relatively\/opposite\/to resist\/to oppose\/relative\/vis-a-vis\/counterpart"],"pinyin":["xiang1 dui4"],"word":"相对"},{"definition":["to be on the low side\/to be inadequate (e.g. of a salary)"],"pinyin":["pian1 di1"],"word":"偏低"},{"definition":["to fall behind\/to lag (in technology etc)\/backward\/to retrogress"],"pinyin":["luo4 hou4"],"word":"落后"},{"definition":["to delay\/to postpone\/to keep putting sth off\/to procrastinate\/(computing) to lag"],"pinyin":["yan2 chi2"],"word":"延迟"},{"definition":["slow\/slow-moving"],"pinyin":["huan3 man4"],"word":"缓慢"},{"definition":["see 急待[ji2 dai4]"],"pinyin":["ji2 dai4"],"word":"亟待"},{"definition":["current\/today's\/modern\/present\/to be facing (us)"],"pinyin":["dang1 qian2"],"word":"当前"},{"definition":["range (the difference between the lowest and highest values)","mediocre\/rather poor\/not specially good"],"pinyin":["jiao4 cha1","jiao4 cha4"],"word":"较差"}]}