{"definition":["Manchu ethnic group of Liaoning province"],"pinyin":["Man3 zu2"],"traditional":["滿族"],"rank":22918.0,"normalized_rank":0.32065255411134275,"fraction":0.0000017961087209092133,"cumulative_fraction":0.9808912236965066,"word":"满族","characters":[{"definition":["Manchu ethnic group","to fill\/full\/filled\/packed\/fully\/completely\/quite\/to reach the limit\/to satisfy\/satisfied\/contented"],"pinyin":["Man3","man3"],"word":"满"},{"definition":["race\/nationality\/ethnicity\/clan\/by extension, social group (e.g. office workers 上班族)"],"pinyin":["zu2"],"word":"族"}],"containing_words":[{"definition":["Xinbin Manchu autonomous county in Fushun 撫順|抚顺, Liaoning"],"pinyin":["Xin1 bin1 man3 zu2 Zi4 zhi4 xian4"],"word":"新宾满族自治县"},{"definition":["Qinglong Manchu autonomous county in Qinhuangdao 秦皇島|秦皇岛[Qin2 huang2 dao3], Hebei"],"pinyin":["Qing1 long2 Man3 zu2 Zi4 zhi4 xian4"],"word":"青龙满族自治县"},{"definition":["Benxi Manchu autonomous county in Benxi 本溪, Liaoning"],"pinyin":["Ben3 xi1 Man3 zu2 Zi4 zhi4 xian4"],"word":"本溪满族自治县"},{"definition":["Fengning Manchu Autonomous County in Chengde 承德[Cheng2 de2], Hebei"],"pinyin":["Feng1 ning2 Man3 zu2 Zi4 zhi4 xian4"],"word":"丰宁满族自治县"},{"definition":["Xiuyan Manzu autonomous county in Anshan 鞍山[An1 shan1], Liaoning"],"pinyin":["Xiu4 yan2 man3 zu2 Zi4 zhi4 xian4"],"word":"岫岩满族自治县"},{"definition":["Yitong Manchurian autonomous county in Siping 四平, Jilin"],"pinyin":["Yi1 tong1 Man3 zu2 Zi4 zhi4 xian4"],"word":"伊通满族自治县"},{"definition":["Weichang Manchu and Mongol autonomous county in Chengde 承德[Cheng2 de2], Hebei"],"pinyin":["Wei2 chang3 Man3 zu2 Meng3 gu3 zu2 Zi4 zhi4 xian4"],"word":"围场满族蒙古族自治县"},{"definition":["Huanren Manchu autonomous county in Benxi 本溪, Liaoning"],"pinyin":["Huan2 ren2 Man3 zu2 Zi4 zhi4 xian4"],"word":"桓仁满族自治县"},{"definition":["Qingyuan Manchu autonomous county in Fushun 撫順|抚顺, Liaoning"],"pinyin":["Qing1 yuan2 Man3 zu2 Zi4 zhi4 xian4"],"word":"清原满族自治县"},{"definition":["Kuancheng Manchu Autonomous County in Chengde 承德[Cheng2 de2], Hebei"],"pinyin":["Kuan1 cheng2 Man3 zu2 Zi4 zhi4 xian4"],"word":"宽城满族自治县"},{"definition":["Kuandian Manchu autonomous county in Dandong 丹東|丹东[Dan1 dong1], Liaoning"],"pinyin":["Kuan1 dian4 Man3 zu2 Zi4 zhi4 xian4"],"word":"宽甸满族自治县"},{"definition":["Beizhen Manzu autonomous county in Liaoning"],"pinyin":["Bei3 zhen4 man3 zu2 Zi4 zhi4 xian4"],"word":"北镇满族自治县"}],"sentences":[{"english":"There is inevitable connection between the Manchu culture and the source of Jin culture.","chinese":"满族文化和金源文化之间存在着必然的关联。"},{"english":"But the snag was that the Manchus were outnumbered by Han troops in Beijing.","chinese":"但那时，北京的汉族军人数量已经超过了满族军人。"},{"english":"All the troops were Manchu men.","chinese":"这个军队里的士兵都是满族人。"},{"english":"Finally, a Manchu invasion ended the Ming regime.","chinese":"最终，满族的入侵结束了明朝的统治。"},{"english":"After entering Shanhai Pass the transition of Manchu material culture expressed different trend in different areas.","chinese":"入关后满族物质文化变迁具有明显的地域性差异。"},{"english":"They were Manchus and not members of China’s Han majority.","chinese":"那就是他们来自满族，而非汉族。"},{"english":"CENTURY ago it was the \"national language\" of a vast empire.","chinese":"一个世纪之前，满族语被定为大清王朝的“国语”。"},{"english":"The Manchu valued their pelage which was believed to ward off rheumatism.","chinese":"满族人重视了应该挡住风湿病的他们的毛皮。"},{"english":"But in some remote rural areas Manchu ways held out longer.","chinese":"但是在一些偏远的乡村，满族习俗得到了更好的流传。"},{"english":"In some places, Manchus were massacred.","chinese":"在某些地方，满族人遭到了屠杀。"},{"english":"The Beijing flag Manchu nationality moves to the La Lin area in the history around reaches hundred year long time.","chinese":"京旗满族向拉林地区移驻的历史前后达百年之久。"},{"english":"The Manchu narration-chant story-telling has been basically handed down generation after generation by mouth and ear.","chinese":"满族讲唱说部主要在氏族内以口耳相传，代代承继。"},{"english":"The preserved Manchu literatures are a kind of cultural wealth left over by Manchu people.","chinese":"流传于世的满文图书是满族遗留至今的一笔文化财富。"},{"english":"It is the court dialect used by many Manchu emperors and noblemen.","chinese":"这是很多满族皇帝和贵族们使用的宫廷语言。"},{"english":"Nationalism and civil rights derived ideas, especially the anti-Manchu trick.","chinese":"民族主义与民权思想的推衍，尤招满族之忌。"},{"english":"However, Manchu language education didn’t come to match its political expansion.","chinese":"然而，满族语言教育无法适应其扩大政治影响的需要。"}],"related":[{"definition":["Mongol ethnic group of north China and Inner Mongolia"],"pinyin":["Meng3 gu3 zu2"],"word":"蒙古族"},{"definition":["Manchu\/bannerman (refers to the eight Manchu banners 八旗[Ba1 qi2])"],"pinyin":["qi2 ren2"],"word":"旗人"},{"definition":["Xibo ethnic group of northeast China"],"pinyin":["Xi1 bo2 zu2"],"word":"锡伯族"},{"definition":["Manchuria"],"pinyin":["Man3 zhou1"],"word":"满洲"},{"definition":["Han ethnic group"],"pinyin":["Han4 zu2"],"word":"汉族"},{"definition":["Manchurian language"],"pinyin":["Man3 yu3"],"word":"满语"},{"definition":["Manchurian Qing (refers to the Qing dynasty, esp. at its decline, or as an anti-Qing slogan)"],"pinyin":["Man3 Qing1"],"word":"满清"},{"definition":["Korean ethnic group in China (mainly in northeast China)\/the Koreans (major ethnic group on the Korean Peninsula)"],"pinyin":["Chao2 xian3 zu2"],"word":"朝鲜族"},{"definition":["Ewenke ethnic group of Inner Mongolia"],"pinyin":["E4 wen1 ke4 zu2"],"word":"鄂温克族"},{"definition":["Manchu household register (during the Qing Dynasty)"],"pinyin":["qi2 ji2"],"word":"旗籍"},{"definition":["Bordered Yellow banner or Hövööt Shar khoshuu in Xilin Gol league 錫林郭勒盟|锡林郭勒盟[Xi1 lin2 guo1 le4 meng2], Inner Mongolia"],"pinyin":["Xiang1 huang2 qi2"],"word":"镶黄旗"},{"definition":["Russian ethnic group (of northeast China and Xinjiang etc)\/Russian nationality\/Russians (of Russia)"],"pinyin":["E2 luo2 si1 zu2"],"word":"俄罗斯族"},{"definition":["Daur ethnic group of Inner Mongolia and Heilongjiang"],"pinyin":["Da2 wo4 er3"],"word":"达斡尔"},{"definition":["Manchou township in Pingtung County 屏東縣|屏东县[Ping2 dong1 Xian4], Taiwan"],"pinyin":["Man3 zhou1"],"word":"满州"},{"definition":["Hui Islamic ethnic group living across China"],"pinyin":["Hui2 zu2"],"word":"回族"},{"definition":["national minority\/ethnic group"],"pinyin":["shao3 shu4 min2 zu2"],"word":"少数民族"}]}