{"definition":["(of tears etc) filling the eyes\/(of scenery etc) filling one's field of view"],"pinyin":["man3 yan3"],"traditional":["滿眼"],"rank":20410.0,"normalized_rank":0.2855623801995159,"fraction":0.000002290972875971164,"cumulative_fraction":0.9757991773746996,"word":"满眼","characters":[{"definition":["Manchu ethnic group","to fill\/full\/filled\/packed\/fully\/completely\/quite\/to reach the limit\/to satisfy\/satisfied\/contented"],"pinyin":["Man3","man3"],"word":"满"},{"definition":["eye\/small hole\/crux (of a matter)\/CL:隻|只[zhi1],雙|双[shuang1]\/classifier for big hollow things (wells, stoves, pots etc)"],"pinyin":["yan3"],"word":"眼"}],"containing_words":[],"sentences":[{"english":"Off the plane you see waves are green and full of trimming the lawn.","chinese":"一下飞机，满眼都是绿，到处是修整的草坪。"},{"english":"The little porch was hidden from view by a screen of yellow roses and Southern smilax.","chinese":"而那个小门廊则被满眼的黄玫瑰和南方天冬草所遮蔽。"},{"english":"Canister of basin piling a basin is placed on the balcony, kind on profusion flowers and plants has eyeful green.","chinese":"在阳台上摆堆盆盆罐罐，种上缤纷花草就有满眼绿色。"},{"english":"This dog grandma is writing with tears in my eyes.","chinese":"狗外婆现在满眼泪水。"},{"english":"Comfortable son fierce title, the eyeful tears looking at a side sits of woman.","chinese":"舒儿猛的抬头，满眼泪水的看着一旁坐着的女子。"},{"english":"He raised his mournful eyes towards the deep blue sky.","chinese":"他满眼哀伤，仰望着深兰色的天空。"},{"english":"Eyeful is fog, hallucinations, is crowded with trees and trees.","chinese":"满眼都是雾气，幻觉，是拥挤的树木和树木。"},{"english":"But I was young and foolish and now I'm full of tears .","chinese":"但我幼稚而木纳，现在我满眼泪花。"},{"english":"She looked at me with the eyes of a skeptic and shook her head.","chinese":"她满眼狐疑地看着我，然后摇了摇头。"},{"english":"East wind blows the spring, several people Huacheng Liu dark melancholy.","chinese":"东方风来满眼春，花城柳暗愁几人。"},{"english":"And at this time I have a eyeful watery tears.","chinese":"而此时的我，已是满眼水汪汪的泪水。"},{"english":"People see the lie above and go ballistic with dreamy-eyed optimism.","chinese":"人们看到这个谎言并且激动的满眼乐观。"},{"english":"In my persuasion, sweet with tears in her eyes released her hand.","chinese":"在我的劝说下，甜甜满眼含泪地松开姥姥的手。"},{"english":"Eyeful rose willow catkins foggy dissolve a corner of the sky.","chinese":"满眼柔丝飞絮雾蒙蒙的溶了一角的天空。"},{"english":"February red looked at the girl, eyeful spoil.","chinese":"二月红看着丫头，满眼宠溺。"},{"english":"When you are inside the jungle, away from the river, the trees vault out of sight.","chinese":"当你离开大河，深入丛林，满眼树木高耸入云。"}],"related":[{"definition":["fills the eyes (of a beautiful view, scene of desolation etc)"],"pinyin":["man3 mu4"],"word":"满目"},{"definition":["to be full of\/completely"],"pinyin":["jin4 shi4"],"word":"尽是"},{"definition":["across one's whole face"],"pinyin":["man3 lian3"],"word":"满脸"},{"definition":["across one's whole face\/(smiling) from ear to ear"],"pinyin":["man3 mian4"],"word":"满面"},{"definition":["to appear before one's eyes\/pleasing to the eye\/nice to look at"],"pinyin":["ru4 yan3"],"word":"入眼"},{"definition":["everywhere\/all over"],"pinyin":["bian4 di4"],"word":"遍地"},{"definition":["as far as the eye can see (idiom)"],"pinyin":["yi1 wang4 wu2 ji4"],"word":"一望无际"},{"definition":["lush green\/verdant"],"pinyin":["lu:4 you2 you2"],"word":"绿油油"},{"definition":["whole sky"],"pinyin":["man3 tian1"],"word":"满天"},{"definition":["to have one's heart filled with\/(to collide) full on\/(of farm animals) heavy with young"],"pinyin":["man3 huai2"],"word":"满怀"},{"definition":["lit. covering the mountains and the plains (idiom)\/fig. as far as the eye can see\/covering everything\/omnipresent"],"pinyin":["man4 shan1 bian4 ye3"],"word":"漫山遍野"},{"definition":["to look\/to raise one's eyes"],"pinyin":["ju3 mu4"],"word":"举目"},{"definition":["lit. to fill the whole sky\/everywhere\/as far as the eye can see"],"pinyin":["man4 tian1"],"word":"漫天"},{"definition":["covering the whole land\/over hills and dales"],"pinyin":["man3 shan1 bian4 ye3"],"word":"满山遍野"},{"definition":["eye-catching\/conspicuous\/obtrusive\/striking\/sticking out"],"pinyin":["chu4 mu4"],"word":"触目"},{"definition":["to be covered with\/to be filled with"],"pinyin":["bu4 man3"],"word":"布满"}]}