{"definition":["clear (of liquid)\/limpid\/to clarify\/to make sth clear\/to be clear (about the facts)","to settle (of liquid)\/to become clear (by precipitation of impurities)\/precipitate (chemistry)\/to put in order\/to quell disturbances"],"pinyin":["cheng2 qing1","deng4 qing1"],"traditional":["澄清","澄清"],"rank":6961.0,"normalized_rank":0.0973934212919564,"fraction":0.000014870594870798169,"cumulative_fraction":0.8959392126669506,"word":"澄清","characters":[{"definition":["(of liquid) to settle\/to become clear","variant of 澄[cheng2]","surname Cheng","clear\/limpid\/to clarify\/to purify"],"pinyin":["deng4","cheng2","Cheng2","cheng2"],"word":"澄"},{"definition":["Qing or Ch'ing dynasty of imperial China (1644-1911)\/surname Qing","clear\/distinct\/quiet\/just and honest\/pure\/to settle or clear up\/to clean up or purge"],"pinyin":["Qing1","qing1"],"word":"清"}],"containing_words":[{"definition":["to assume one's post with the aspiration of bringing about peace and order to the nation (idiom)"],"pinyin":["lan3 pei4 cheng2 qing1"],"word":"揽辔澄清"}],"sentences":[{"english":"Drache to confidential action content, therefore has not to clarify in this matter.","chinese":"卓凯为了保密行动内容，故一直没有就此事作出澄清。"},{"english":"And certain high-risk professions and hobbies usually have to be disclosed.","chinese":"某些高风险职业和业余爱好通常也必须予以说明澄清。"},{"english":"I write because I want to clear some misconceptions about Yoon Eun Hye.","chinese":"我写这席话，是因为我想澄清一些关于尹恩惠的误解。"},{"english":"I should say this, that Pat doesn't have a mink coat.","chinese":"我应该澄清的是，帕特并没有貂皮大衣。"},{"english":"Experiment study of soak juice by tartary buckwheat bran the clarification technology and store the stabilities.","chinese":"实验研究了苦荞麸浸出汁的澄清工艺及储藏稳定性。"},{"english":"Mining minister said immediately come forward to clarify earlier in the ghost story.","chinese":"采臣见状立即上前澄清早前遇鬼的说法。"},{"english":"I just want to clarify that it is an electron.","chinese":"我想澄清的是它是一个电子。"},{"english":"My fair skin didn’t help clarify matters either.","chinese":"我白皙的皮肤也于澄清事情毫无助益。"},{"english":"A discussion is made on the basic concept of rock weathering, and some fuzzy cognition is clarified.","chinese":"讨论岩体风化的基本概念，澄清一些传统的模糊认识。"},{"english":"As a community, this is the perfect time to clarify these differences.","chinese":"作为一个社区，这正是澄清所有这些区别的绝佳时机。"},{"english":"Tonight Jobs cleared up the matter once and for all.","chinese":"今晚乔布斯彻底地澄清了这个问题。"},{"english":"I will gladly share more details if you have questions or clarifications.","chinese":"我会很乐意分享更多的细节，如果您有问题或澄清。"},{"english":"Jack needed time to clear himself of burglary charges.","chinese":"杰克需要一点时间来澄清自己是强盗的指控罪名。"},{"english":"Any questions, clarifications, etc, please let us know.","chinese":"有任何疑问，澄清等，请告诉我们。"},{"english":"Therefore, it is necessary to clarify people's understanding of universality from various perspectives.","chinese":"在多样性的视域中，澄清人们对普世性的认识。"},{"english":"It takes courage to raise your hand and ask for clarification.","chinese":"它给你举手澄清问题的勇气。"}],"related":[{"definition":["to refute a rumor\/to deny"],"pinyin":["pi4 yao2"],"word":"辟谣"},{"definition":["to say a matter has no relationship with the individual referred to, to emphasise one is innocent or in the clear"],"pinyin":["pie3 qing1"],"word":"撇清"},{"definition":["to respond\/response"],"pinyin":["hui2 ying4"],"word":"回应"},{"definition":["to declare to be untrue\/to deny"],"pinyin":["fou3 ren4"],"word":"否认"},{"definition":["to start a rumor"],"pinyin":["zao4 yao2"],"word":"造谣"},{"definition":["to support\/to back"],"pinyin":["li4 ting3"],"word":"力挺"},{"definition":["to declare\/to aver\/to state formally"],"pinyin":["shen1 ming2"],"word":"申明"},{"definition":["to discredit\/to defame\/to smear sb's name\/to bring shame upon (oneself or one's family etc)\/to blacken (e.g. commando's face for camouflage)\/to black out or obliterate (e.g. censored words)"],"pinyin":["mo3 hei1"],"word":"抹黑"},{"definition":["vocal\/sound\/sound production\/to utter\/to give voice"],"pinyin":["fa1 sheng1"],"word":"发声"},{"definition":["to seek proof\/to seek confirmation"],"pinyin":["qiu2 zheng4"],"word":"求证"},{"definition":["to apologize"],"pinyin":["dao4 qian4"],"word":"道歉"},{"definition":["to claim\/to state\/to proclaim\/to assert"],"pinyin":["sheng1 cheng1"],"word":"声称"},{"definition":["to state\/to declare\/statement\/declaration\/CL:項|项[xiang4],份[fen4]"],"pinyin":["sheng1 ming2"],"word":"声明"},{"definition":["(neologism c. 2014) (slang) solid proof\/irrefutable evidence"],"pinyin":["shi2 chui2"],"word":"实锤"},{"definition":["explanation\/to explain\/to interpret\/to resolve\/CL:個|个[ge4]"],"pinyin":["jie3 shi4"],"word":"解释"},{"definition":["public\/to publish\/to make public"],"pinyin":["gong1 kai1"],"word":"公开"}]}