{"definition":["to arouse\/to excite"],"pinyin":["ji1 fa1"],"traditional":["激發"],"rank":5494.0,"normalized_rank":0.07686818798707204,"fraction":0.000020934505490642833,"cumulative_fraction":0.8700310173246966,"word":"激发","characters":[{"definition":["to arouse\/to incite\/to excite\/to stimulate\/sharp\/fierce\/violent"],"pinyin":["ji1"],"word":"激"},{"definition":["hair\/Taiwan pr. [fa3]","to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa4","fa1"],"word":"发"}],"containing_words":[{"definition":["booster shot\/booster injection"],"pinyin":["ji1 fa1 zhu4 she4"],"word":"激发注射"}],"sentences":[{"english":"Encourage her release by constructing an erotic fantasy before things heat up.","chinese":"应当在高潮激发前鼓励她通过性幻想放松自己。"},{"english":"Throughout their history, the pyramids of Giza have stimulated human imagination.","chinese":"纵观历史，吉萨金子塔激发了人类的想象。"},{"english":"Thirdly, Trammell was really a good rival.","chinese":"第三，特拉梅尔是一位可以激发刘翔潜能的对手。"},{"english":"In doing this, more people will be inspired and encouraged to write.","chinese":"如此抛砖引玉，能激发与鼓励更多人加入写作队伍。"},{"english":"Most managers attempt to influence employee motivation using both positive and negative approaches.","chinese":"大多数经理试图正负双法并举，激发员工的积极性。"},{"english":"Point blank, it increases brain function. Barlean's makes a fish oil foam called Omega Swirl that tastes like candy.","chinese":"它能够激发空白点，提高脑功能。"},{"english":"The design of the film-systems used for bio-fluorescence excitation and barrier filters were discussed in this paper.","chinese":"本文论述生物荧光激发滤光片及栅滤光片的膜系设计。"},{"english":"Let your kids rest on pillows designed to inspire musical dreams.","chinese":"让你的孩子们偎依在能激发音乐梦想的枕头上。"},{"english":"It is that quantitative difference that drives the interest in digital TV.","chinese":"正是这种质量差别激发我们对数字电视的兴趣。"},{"english":"Improve the production efficiency, improve the overall quality, potential to inspire.","chinese":"提高生产效率，提升员工整体素质，潜质激发。"},{"english":"The labor song is the oldest ballad directly originating from physical labor.","chinese":"劳动歌是由体力劳动直接激发起来的最古老的歌谣。"},{"english":"The new classification has certainly caught the imagination of Internet users.","chinese":"这种新的分类当然激发了网友们的奇思妙想。"},{"english":"According to the Law of Attraction, a powerful intent made up of clear, pure and focused thoughts will start to attract the very essence of your desires.","chinese":"根据引力定律，一个明确的想法会激发你的所有欲望。"},{"english":"The power of the mind's creativity depends on the constant stimulation and encouragements.","chinese":"心灵的创造力是需要被时时的激发的。"},{"english":"But such triggers don't seem to trouble the patients with a damaged insula.","chinese":"但是这种激发看来已不会困扰岛叶皮层损伤的患者。"},{"english":"Snow shoveling is a known trigger for heart attacks.","chinese":"铲雪是一个已知的心脏病发作激发因素。"}],"related":[{"definition":["potential\/hidden capability"],"pinyin":["qian2 neng2"],"word":"潜能"},{"definition":["to activate"],"pinyin":["ji1 huo2"],"word":"激活"},{"definition":["to burst forth"],"pinyin":["beng4 fa1"],"word":"迸发"},{"definition":["to transfer\/to maneuver (troops etc)\/movement of personnel\/to mobilize\/to bring into play"],"pinyin":["diao4 dong4"],"word":"调动"},{"definition":["to induce\/to promote\/to urge\/to impel\/to bring about\/to provoke\/to drive (sb to do sth)\/to catalyze\/to actuate\/to contribute to (some development)"],"pinyin":["cu4 shi3"],"word":"促使"},{"definition":["to release\/to set free\/to liberate (a prisoner)\/to discharge"],"pinyin":["shi4 fang4"],"word":"释放"},{"definition":["to waken (to action)\/to rouse (the masses)\/to evoke (attention, recollection etc)"],"pinyin":["huan4 qi3"],"word":"唤起"},{"definition":["to increase\/to strengthen"],"pinyin":["zeng1 qiang2"],"word":"增强"},{"definition":["creativeness\/creativity"],"pinyin":["chuang4 zao4 xing4"],"word":"创造性"},{"definition":["to burst forth\/to burst out"],"pinyin":["beng4 fa1 chu1"],"word":"迸发出"},{"definition":["to change\/to transform\/isomerization (chemistry)"],"pinyin":["zhuan3 hua4"],"word":"转化"},{"definition":["ingenuity\/creativity"],"pinyin":["chuang4 zao4 li4"],"word":"创造力"},{"definition":["to provoke\/to irritate\/to upset\/to stimulate\/to excite\/irritant"],"pinyin":["ci4 ji1"],"word":"刺激"},{"definition":["zeal\/initiative\/enthusiasm\/activity"],"pinyin":["ji1 ji2 xing4"],"word":"积极性"},{"definition":["energy\/capabilities"],"pinyin":["neng2 liang4"],"word":"能量"},{"definition":["to encourage\/to urge\/motivation\/incentive"],"pinyin":["ji1 li4"],"word":"激励"}]}