{"definition":["to arouse\/to evoke\/to cause\/to stir up"],"pinyin":["ji1 qi3"],"traditional":["激起"],"rank":9572.0,"normalized_rank":0.1339246988373232,"fraction":0.000008884344348444053,"cumulative_fraction":0.9260369438575212,"word":"激起","characters":[{"definition":["to arouse\/to incite\/to excite\/to stimulate\/sharp\/fierce\/violent"],"pinyin":["ji1"],"word":"激"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"This announcement will arouse a feeling of anger among freedom-loving people.","chinese":"这一宣告将会激起爱好自由人们的愤怒。"},{"english":"There is nothing like a long walk to arouse the appetite.","chinese":"没有什么比走很长的路更能激起食欲的了。"},{"english":"Niki's voice provoked a new bout of unreasoning anger.","chinese":"妮基一开口又激起了无名的怒火。"},{"english":"His extreme practices aroused the alarm and horror of European bloodletting physicians .","chinese":"他的极端行为激起了欧洲放血医师的警觉和恐慌。"},{"english":"The job attributed to basophils that has spurred the most discussion is presenting antigens.","chinese":"嗜碱性细胞抗原呈递的新功能激起了最为热烈的讨论。"},{"english":"Don't stir up area discrimination, or it'll trigger many disharmonious sounds.","chinese":"不要搞出地域歧视来，否则会激起很多不和谐的声音。"},{"english":"The strong gusts whipped up eddies of fallen leaves.","chinese":"强劲的阵风激起了落叶漩涡。"},{"english":"He has never expected a touch to be so mysteriously arousing.","chinese":"他从没料到一个触碰能这般神秘地激起内心的激情。"},{"english":"The intruders' tyrannical behavior led the local people to revolt.","chinese":"略者的残虐的行径，激起了当地民众的反抗。"},{"english":"Rwanda's support for the CNDP is fuelling much of the violence.","chinese":"卢旺达对CNDP的支持已经激起许多暴动。"},{"english":"It does not help asking the question once your anger has been aroused.","chinese":"一旦你的愤怒被激起，问你什么问题都是白费力气。"},{"english":"His polished oration piqued the audiences's interest.","chinese":"他精彩的演讲激起了观众的兴趣。"},{"english":"The Roma inspire fear.","chinese":"“罗马”激起了恐惧。"},{"english":"The strange round-shaped object stimulate the curiosity of chidren.","chinese":"这奇怪的圆形物体激起了孩子们的好奇心。"},{"english":"The water droplets are being sent into the air by the vibration of a male alligator's sub-sonic call.","chinese":"一只雄短吻鳄鱼哼叫时发出的亚音波激起片片水花。"},{"english":"Water seethed under the falls.","chinese":"水在瀑布下激起泡沫。"}],"related":[{"definition":["to lift\/to raise in height\/to begin\/upsurge\/to set off (a campaign)"],"pinyin":["xian1 qi3"],"word":"掀起"},{"definition":["to rage\/to dash\/to surge\/also written 激盪|激荡","to rage\/to dash\/to surge"],"pinyin":["ji1 dang4","ji1 dang4"],"word":"激荡"},{"definition":["billows\/great waves (fig. of a story with great momentum)"],"pinyin":["bo1 lan2"],"word":"波澜"},{"definition":["spray\/ocean spray\/spindrift\/fig. happenings from one's life\/CL:朵[duo3]"],"pinyin":["lang4 hua1"],"word":"浪花"},{"definition":["to well up\/to boil out\/to bubble forth\/to spurt"],"pinyin":["yong3 qi3"],"word":"涌起"},{"definition":["to entice\/to arouse\/to provoke"],"pinyin":["tiao3 dong4"],"word":"挑动"},{"definition":["to settle (a dispute)\/to quieten down\/to suppress"],"pinyin":["ping2 xi1"],"word":"平息"},{"definition":["to lead to\/to trigger\/to initiate\/to cause\/to evoke (emotions)"],"pinyin":["yin3 fa1"],"word":"引发"},{"definition":["to infuriate\/to enrage\/to exasperate"],"pinyin":["ji1 nu4"],"word":"激怒"},{"definition":["index (loanword)"],"pinyin":["yin3 de2"],"word":"引得"},{"definition":["to ignite\/to light\/fig. to spark off (hopes, controversy, flames of revolution)"],"pinyin":["ran2 qi3"],"word":"燃起"},{"definition":["to spring up everywhere\/from all around"],"pinyin":["si4 qi3"],"word":"四起"},{"definition":["to surge up violently (of ocean, river, lake etc)\/turbulent"],"pinyin":["xiong1 yong3"],"word":"汹涌"},{"definition":["intense\/(violently) strong"],"pinyin":["qiang2 lie4"],"word":"强烈"},{"definition":["to submerge\/to drown\/to flood\/to drown out (also fig.)"],"pinyin":["yan1 mo4"],"word":"淹没"},{"definition":["ripple"],"pinyin":["lian2 yi1"],"word":"涟漪"}]}