{"definition":["to pour into\/perfusion (med.)\/to concentrate one's attention on\/to teach\/to inculcate\/to instill"],"pinyin":["guan4 zhu4"],"traditional":["灌注"],"rank":31801.0,"normalized_rank":0.44493724903110266,"fraction":8.025849924869031e-7,"cumulative_fraction":0.9918103611341056,"word":"灌注","characters":[{"definition":["to irrigate\/to pour\/to install (software)\/to record (music)"],"pinyin":["guan4"],"word":"灌"},{"definition":["to inject\/to pour into\/to concentrate\/to pay attention\/stake (gambling)\/classifier for sums of money\/variant of 註|注[zhu4]","to register\/to annotate\/note\/comment"],"pinyin":["zhu4","zhu4"],"word":"注"}],"containing_words":[{"definition":["variant of 全神貫注|全神贯注[quan2 shen2 guan4 zhu4]"],"pinyin":["quan2 shen2 guan4 zhu4"],"word":"全神灌注"}],"sentences":[{"english":"Objective To investigate the protective effects of maltol(MT) on cerebral ischemia and reperfusion damages in rats.","chinese":"目的研究麦芽醇对大鼠脑缺血再灌注损伤的保护作用。"},{"english":"Normal saline in the same volume was perfused in the ischemiareperfusion group and sham operation group.","chinese":"缺血再灌注组和假手术组灌等体积的生理盐水。"},{"english":"The practice of fabricating a pile by drilling and filling pedestal is described in the discussion.","chinese":"通过工程实例介绍扩底钻孔灌注桩施工实践。"},{"english":"Results—Early 1-hour thrombolysis restored perfusion and reduced infarction.","chinese":"结果早期1小时溶栓恢复灌注降低梗塞体积。"},{"english":"After Gingival retraction, impressions were made and superhard gypsum model were finished.","chinese":"排龈后制取印模，灌注超硬石膏模型。"},{"english":"Then the labeled bladder cancer cells were implanted into the nude mice bladder by intravesical instillation.","chinese":"采用经尿道膀胱灌注法使肿瘤细胞种植于膀胱黏膜。"},{"english":"Beggared of blood to blush through lively veins.","chinese":"缺乏鲜血去灌注淡红的脉络？"},{"english":"Bore-hole cast-in-place pile was filled outside the foundation pit.","chinese":"对于基坑外的部分，采用钻孔灌注桩补桩。"},{"english":"Method of capacity of socketed piles are determined to bring together.","chinese":"归纳总结了确定嵌岩灌注桩的承载力方法。"},{"english":"Ischemia-reperfulion injury model of small bowel transplantation was established.","chinese":"建立小肠移植缺血再灌注损伤模型。"},{"english":"Myocardial perfusion scintigraphy provides complementary data for assessing ischemic burden.","chinese":"心肌灌注闪烁照相术对缺血程度估计提供辅助资料。"},{"english":"Objective To evaluate the legitimation of left gastric regional arterial infusion chemotherapy in the treatment of gastric carcinoma.","chinese":"目的探讨胃左动脉区域灌注化疗治疗胃癌的合理性。"},{"english":"The maintenance of higher aortic perfusion pressure intraoperatively must be emphasized to decrease the likelihood of air embolism.","chinese":"应强调术中保持较高的主动脉灌注压以防止空气栓塞。"},{"english":"The MR pulmonary perfusion imaging was achieved by the first-pass contrast agent method.","chinese":"利用对比剂首次通过法可进行MR肺灌注成像。"},{"english":"Objective To evaluate the safety of intraperitoneal hyperthermic chemotherapy.","chinese":"目的探讨腹腔温热灌注化疗的安全性和可行性。"},{"english":"Conclusion MRPP with 2D FSPGR without breath-hold is a feasible method to diagnose APE.","chinese":"结论MR肺灌注成像是诊断肺栓塞的可行方法。"}],"related":[{"definition":["to concentrate\/to gather\/(biology) to agglutinate"],"pinyin":["ning2 ji2"],"word":"凝集"},{"definition":["variant of 凝練|凝练[ning2 lian4]"],"pinyin":["ning2 lian4"],"word":"凝炼"},{"definition":["to condense\/to solidify\/to coagulate\/clot (of blood)"],"pinyin":["ning2 jie2"],"word":"凝结"},{"definition":["medical puncture to extract bodily fluid (a tap)\/body piercing\/puncture"],"pinyin":["chuan1 ci4"],"word":"穿刺"},{"definition":["idea\/thought"],"pinyin":["yi4 nian4"],"word":"意念"},{"definition":["concise\/compact\/condensed"],"pinyin":["ning2 lian4"],"word":"凝练"},{"definition":["to vaporize\/to dispel"],"pinyin":["yi4 san4"],"word":"逸散"},{"definition":["channel of TCM"],"pinyin":["jing1 mai4"],"word":"经脉"},{"definition":["to pour into\/to empty into"],"pinyin":["zhu4 ru4"],"word":"注入"},{"definition":["pubic region\/point two inches below the navel where one's qi resides"],"pinyin":["dan1 tian2"],"word":"丹田"},{"definition":["cyclone"],"pinyin":["qi4 xuan2"],"word":"气旋"},{"definition":["crystal"],"pinyin":["jing1 ti3"],"word":"晶体"},{"definition":["to bubble out\/to squirt"],"pinyin":["pen1 yong3"],"word":"喷涌"},{"definition":["to condense\/to concentrate\/compression\/concentration"],"pinyin":["ning2 suo1"],"word":"凝缩"},{"definition":["spiral\/helix\/screw"],"pinyin":["luo2 xuan2"],"word":"螺旋"},{"definition":["occult force\/the power of a God or spirit"],"pinyin":["shen2 li4"],"word":"神力"}]}