{"definition":["to concoct\/to invent\/to fabricate\/to produce\/to process\/processing and curing (Chinese medicine)"],"pinyin":["pao2 zhi4"],"traditional":["炮製"],"rank":19093.0,"normalized_rank":0.2671358415065829,"fraction":0.0000026278892387685032,"cumulative_fraction":0.9725610185943776,"word":"炮制","characters":[{"definition":["to prepare herbal medicine by roasting or parching (in a pan)","variant of 炮[pao4]","to sauté\/to fry\/to dry by heating","cannon\/CL:座[zuo4]\/firecracker"],"pinyin":["pao2","pao4","bao1","pao4"],"word":"炮"},{"definition":["to manufacture\/to make","system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4","zhi4"],"word":"制"}],"containing_words":[{"definition":["lit. to follow the recipe (idiom)\/fig. to follow a set pattern"],"pinyin":["ru2 fa3 pao2 zhi4"],"word":"如法炮制"}],"sentences":[{"english":"The same goes for other coddling behaviors, like pestering him to eat his vegetables.","chinese":"对于其它的溺爱也如法炮制，如劝他自己吃菜。"},{"english":"We do have a remarkable talent for cooking up crazy get-rich schemes.","chinese":"在炮制疯狂发财计划方面，我们的确有过人才华。"},{"english":"Wrestlers do it all the time to make a weight class.","chinese":"摔交选手为了达到某个重量级别总是如法炮制。"},{"english":"The lists just can't be arbitrary.","chinese":"这个清单时不能武断炮制的。"},{"english":"The possible mechanism of gastrodin formation during the crude process was also discussed.","chinese":"本文还讨论了天麻素在炮制过程中形成的可能机理。"},{"english":"Processing methods have certain influence on chemical constituents in Poria cocos herbs.","chinese":"炮制加工对茯苓饮片的化学成分有一定的影响。"},{"english":"Trust companies have churned out such products this year.","chinese":"信托公司今年炮制了大量这类产品。"},{"english":"Results showed that content of volatile oil was decreased and its quality changed after processing.","chinese":"结果表明，炮制后挥发油含量减少，质量发生变化。"},{"english":"Objective:Overview the development of modern preparation of Eucommia ulmoides Oliver.","chinese":"目的对杜仲现代炮制的研究进展作一综述。"},{"english":"The research indicated artillery methods and the content of polysaccharide has direct relations.","chinese":"研究表明炮制方法与多糖含量的多少有直接的关系。"},{"english":"It has also been confirmed that myristicin tends to decrease in varying degrees after the nutmeg has been processed.","chinese":"同时证明肉豆蔻醚在炮制后有不同程度的降低。"},{"english":"ObjectiveTo optimize the technologies of processing in Heshouwu braised.","chinese":"目的优化黑豆汁炖何首乌炮制工艺。"},{"english":"ObjectiveTo provide the basis of the technological standardization of Rubia cordifolia L.","chinese":"目的为茜草炭炮制工艺的优化提供依据。"},{"english":"Then India would follow suit, as would Pakistan.","chinese":"印度和巴基斯坦也会如法炮制。"},{"english":"Results The IR spectrometry of Ophicalcitum was different before and after calcination.","chinese":"结果炮制前后的花蕊石红外光谱图有明显差异。"},{"english":"Objective To study the effects of different preparing methods on the quality of Follum Eriobotryae.","chinese":"目的了解不同炮制方法的枇杷叶炮制品质量。"}],"related":[{"definition":["medicinal ingredient"],"pinyin":["yao4 cai2"],"word":"药材"},{"definition":["prescription"],"pinyin":["yao4 fang1"],"word":"药方"},{"definition":["to compound (medicines etc)\/to prepare (by mixing ingredients)\/to concoct"],"pinyin":["pei4 zhi4"],"word":"配制"},{"definition":["prescription\/cooking recipe\/formulation\/completing the square (to solve quadratic equation, math.)"],"pinyin":["pei4 fang1"],"word":"配方"},{"definition":["herbal medicine"],"pinyin":["cao3 yao4"],"word":"草药"},{"definition":["secret recipe"],"pinyin":["mi4 fang1"],"word":"秘方"},{"definition":["with utmost care\/fine\/meticulous\/detailed"],"pinyin":["jing1 xin1"],"word":"精心"},{"definition":["to purify"],"pinyin":["ti2 chun2"],"word":"提纯"},{"definition":["poison"],"pinyin":["du2 yao4"],"word":"毒药"},{"definition":["to make up\/to fabricate"],"pinyin":["nie1 zao4"],"word":"捏造"},{"definition":["ginseng"],"pinyin":["ren2 shen1"],"word":"人参"},{"definition":["to obscure the facts (idiom); to mislead the public with prevarication and deliberate falsehoods"],"pinyin":["hun4 xiao2 shi4 ting1"],"word":"混淆视听"},{"definition":["lit. to graft flowers onto a tree\/to surreptitiously substitute one thing for another (idiom)"],"pinyin":["yi2 hua1 jie1 mu4"],"word":"移花接木"},{"definition":["Chinese herbal medicine"],"pinyin":["zhong1 cao3 yao4"],"word":"中草药"},{"definition":["to extract (ore, minerals etc)\/to refine\/to purify\/to process"],"pinyin":["ti2 lian4"],"word":"提炼"},{"definition":["to detoxify\/to relieve fever (in Chinese medicine)"],"pinyin":["jie3 du2"],"word":"解毒"}]}