{"definition":["roll call\/to mention sb by name\/(to call or praise or criticize sb) by name"],"pinyin":["dian3 ming2"],"traditional":["點名"],"rank":13158.0,"normalized_rank":0.18409749136037384,"fraction":0.000005235925520283783,"cumulative_fraction":0.9504779966081496,"word":"点名","characters":[{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"点"},{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"}],"containing_words":[{"definition":["register of names\/attendance roll book"],"pinyin":["dian3 ming2 ce4"],"word":"点名册"},{"definition":["to attack publicly\/to stage a denunciation campaign"],"pinyin":["dian3 ming2 xiu1 ru3"],"word":"点名羞辱"}],"sentences":[{"english":"Themost common-used method is to call over.","chinese":"最常用的方法是点名。"},{"english":"Changes into the architectural style, named theme.","chinese":"变化成建筑造型，点名主题。"},{"english":"Look, there are three things for certain in life---death, taxes and count.","chinese":"生命中有三件事是逃不掉的，死亡，税收还有点名。"},{"english":"Oh god, here we go again. Count's in 15minutes. What are you doing?","chinese":"哦天啊，又来了。15分钟后就要点名了，你要干嘛？"},{"english":"The emergency ward can now call directly for the competent specialist.","chinese":"现在急诊科有了呼救权，可直接点名呼请有关专家。"},{"english":"The results surprised some of the companies named in the report.","chinese":"报告中被点名的部分公司对结果感到惊讶。"},{"english":"Yahoo, Microsoft and Cisco are also named.","chinese":"雅虎，微软和思科也被点名。"},{"english":"This public naming and shaming is a new tactic.","chinese":"这次公开点名和羞辱是一个新的战术。"},{"english":"The new soldiers were roll-called in front of their barracks.","chinese":"新兵在他们的营房前接受点名。"},{"english":"I always cut physics class on Monday because the teacher never calls roll.","chinese":"我总是逃星期一的物理课，因为老师从不点名。"},{"english":"Could you say \"yes\" for me when the teacher calls the roll?","chinese":"老师点名时帮我喊一声“到”行吗？"},{"english":"All boys will attend roll-call at 9 o'clock.","chinese":"全体男生务必参加九点钟点名。"},{"english":"Ask everybody to call him Mr. Li later, then he begins to call-over .","chinese":"请大家以后叫他李老师，接着他就开始点名。"},{"english":"At the roll call, the students answered up to their names.","chinese":"点名时学生们听到自己的名字都一一应到。"},{"english":"When others comment asking to be interviewed, you will ask them five questions.","chinese":"当别人在评论中要求被点名时，你将问他们一些问题。"},{"english":"At the evening roll call they discovered that he was AWOL.","chinese":"晚上点名时，发觉他开了小差。"}],"related":[{"definition":["to praise\/to commend"],"pinyin":["biao3 yang2"],"word":"表扬"},{"definition":["to hold a meeting\/to attend a meeting"],"pinyin":["kai1 hui4"],"word":"开会"},{"definition":["to declare one's position\/to say where one stands"],"pinyin":["biao3 tai4"],"word":"表态"},{"definition":["to give orders\/to spread news or rumors\/to leak certain information intentionally"],"pinyin":["fang4 hua4"],"word":"放话"},{"definition":["to make a speech\/statement\/utterance\/CL:個|个[ge4]"],"pinyin":["fa1 yan2"],"word":"发言"},{"definition":["to admonish subordinates"],"pinyin":["xun4 hua4"],"word":"训话"},{"definition":["to report for duty\/to check in\/to register"],"pinyin":["bao4 dao4"],"word":"报到"},{"definition":["to expel (a member of an organization)\/to fire (an employee)"],"pinyin":["kai1 chu2"],"word":"开除"},{"definition":["to take the lead\/to be the first\/to set an example"],"pinyin":["dai4 tou2"],"word":"带头"},{"definition":["to ascertain\/to act on\/to criticize\/to pass on\/classifier for batches, lots, military flights\/tier (for the ranking of universities and colleges)"],"pinyin":["pi1"],"word":"批"},{"definition":["to request leave of absence"],"pinyin":["qing3 jia4"],"word":"请假"},{"definition":["to sb's face\/in sb's presence"],"pinyin":["dang1 mian4"],"word":"当面"},{"definition":["to bombard\/to bomb\/(fig.) to criticize\/to roast","to bombard\/to bomb\/trad. also written 炮轟"],"pinyin":["pao4 hong1","pao4 hong1"],"word":"炮轰"},{"definition":["to question\/to ask\/to raise a question"],"pinyin":["fa1 wen4"],"word":"发问"},{"definition":["to take care\/to keep an eye on\/to look after\/to tell\/to remind"],"pinyin":["guan1 zhao4"],"word":"关照"},{"definition":["public\/to publish\/to make public"],"pinyin":["gong1 kai1"],"word":"公开"}]}