{"definition":["to transform gold into base metal (idiom); fig. to edit sb else's beautiful prose and ruin it"],"pinyin":["dian3 jin1 cheng2 tie3"],"traditional":["點金成鐵"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"点金成铁","characters":[{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"点"},{"definition":["surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)","gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Jin1","jin1"],"word":"金"},{"definition":["to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth","surname Cheng"],"pinyin":["cheng2","Cheng2"],"word":"成"},{"definition":["iron (metal)\/arms\/weapons\/hard\/strong\/violent\/unshakeable\/determined\/close\/tight (slang)","surname Tie"],"pinyin":["tie3","Tie3"],"word":"铁"}],"containing_words":[],"sentences":[],"related":[{"definition":["great despite minor blemishes\/a rough diamond"],"pinyin":["da4 chun2 xiao3 ci1"],"word":"大醇小疵"},{"definition":["to touch base matter and turn it to gold (idiom); fig. to turn crude writing into a literary gem"],"pinyin":["dian3 tie3 cheng2 jin1"],"word":"点铁成金"},{"definition":["florid but insubstantial remarks\/misleading way of saying sth"],"pinyin":["fu2 ci2"],"word":"浮词"},{"definition":["to be ridiculous\/to make a fool of oneself"],"pinyin":["yi2 xiao4"],"word":"贻笑"},{"definition":["lit. the heart of a sheep in the skin of a tiger (idiom)\/fig. impressive in appearance but lacking in substance\/braggart"],"pinyin":["yang2 zhi4 hu3 pi2"],"word":"羊质虎皮"},{"definition":["lit. Ying writes a letter and Yan reads it\/fig. to misinterpret the original meaning\/to pile up errors\/refers to the letter from capital 郢[Ying3] of 楚[Chu3] in which the inadvertent words \"hold up the candle\" are mistaken by the minister of 燕[Yan1] as \"promote the wise\""],"pinyin":["Ying3 shu1 Yan1 shuo1"],"word":"郢书燕说"},{"definition":["to try to draw a tiger but end up with a likeness of a dog (idiom)\/to try to do sth overambitious and end up botching it"],"pinyin":["hua4 hu3 lei4 quan3"],"word":"画虎类犬"},{"definition":["indisputable statement\/unalterable truth"],"pinyin":["bu4 kan1 zhi1 lun4"],"word":"不刊之论"},{"definition":["to aim to carve a swan and get a semblance of a duck (idiom)\/to fail utterly in trying to copy something\/to get a reasonably good, if not perfect, result"],"pinyin":["ke4 hu2 lei4 wu4"],"word":"刻鹄类鹜"},{"definition":["to draw an impossible comparison"],"pinyin":["ni3 yu2 bu4 lun2"],"word":"拟于不伦"},{"definition":["person narrow-minded and shortsighted"],"pinyin":["dou3 shao1 zhi1 qi4"],"word":"斗筲之器"},{"definition":["a slight blemish"],"pinyin":["bai2 bi4 wei1 xia2"],"word":"白璧微瑕"},{"definition":["lit. the scholar buys a donkey (idiom); fig. long-winded verbiage that never gets to the point\/idiom mocking scholastic pomposity"],"pinyin":["bo2 shi4 mai3 lu:2"],"word":"博士买驴"},{"definition":["mixed-up and superfluous"],"pinyin":["wu2 lei3"],"word":"芜累"},{"definition":["Mr Zhu Yun breaks the railing (idiom); to challenge and admonish boldly"],"pinyin":["Zhu1 Yun2 zhe1 kan3"],"word":"朱云折槛"},{"definition":["see 騎驢找驢|骑驴找驴[qi2 lu:2 zhao3 lu:2]"],"pinyin":["qi2 lu:2 mi4 lu:2"],"word":"骑驴觅驴"}]}