{"definition":["hot treatment (e.g. of metal)"],"pinyin":["re4 chu3 li3"],"traditional":["熱處理"],"rank":38958.0,"normalized_rank":0.5450729646160088,"fraction":4.23919028407051e-7,"cumulative_fraction":0.9960680520386934,"word":"热处理","characters":[{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"热"},{"definition":["to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish","place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point"],"pinyin":["chu3","chu4"],"word":"处"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"}],"containing_words":[],"sentences":[{"english":"Homogenizing treatment process of said alloy is optimized.","chinese":"优化了该合金的均匀化热处理工艺。"},{"english":"The results show that both are caused by decarburization in heat tret - ment.","chinese":"结果表明，两者均为热处理脱碳所引起。"},{"english":"HMF was produced after heating, especially in pasteurizing after filling.","chinese":"HMF是在热处理后产生，特别是灌装后巴氏杀菌。"},{"english":"A heat treatment is carried out in vacuum after the formation of the thin film.","chinese":"氮化铁薄膜形成后，在真空中进行热处理。"},{"english":"We must determine the heat-treatment technical parameters, according to its influence.","chinese":"因此，必须考虑其影响来综合制订热处理工艺参数。"},{"english":"The improvement in the heat treatment technology of the stamping die for the silicon steel sheet was introduced.","chinese":"介绍了硅钢片冲模热处理工艺的改进。"},{"english":"The most common treatments applied to proteinaceous raw materials are different heat treatments.","chinese":"应用于蛋白质原料的最普通处理是不同的热处理。"},{"english":"Appropriately increasing heat-retaining time can make MMC size fine.","chinese":"热处理保温时间的适当增长可使MMC组织变得细小。"},{"english":"However, carbon and two-step annealing can promote the precipitation of oxygen.","chinese":"但是，碳和低高温两步热处理都可以促进氧沉淀。"},{"english":"The problem studied in this paper is motivated by heat-treatment operations in the pre-casting stage of steel casting manufacturing.","chinese":"本研究源于钢铁铸造业中预铸阶段的热处理作业。"},{"english":"The long neck flange should have stress-relief heat treatment after welding.","chinese":"拼接法兰应进行焊后消除应力热处理。"},{"english":"The influence of heat-treatment on the property of electro iron has researched.","chinese":"研究了热处理工艺对电铸电工纯铁性能的影响。"},{"english":"The content of sulphides does not change with the variation of tempering temperature.","chinese":"硫化物数量基本不随热处理制度变化。"},{"english":"Low-temperature electrolytic sulphurizing is a new chemical heat-treatment processing.","chinese":"低温电解渗硫是一项新型的化学热处理工艺。"},{"english":"Objective The objective of this study was to learn the influence of crystallization on mechanical properties of DGC.","chinese":"目的探讨晶化热处理对牙用玻璃陶瓷力学性能的影响。"},{"english":"As when designing for the non-heat-treatable alloys, the designer must not use the parent material properties in design.","chinese":"当设计不可热处理合金时，不可使用母材性能。"}],"related":[{"definition":["carburization"],"pinyin":["shen4 tan4"],"word":"渗碳"},{"definition":["annealing (metallurgy)"],"pinyin":["tui4 huo3"],"word":"退火"},{"definition":["rolling steel"],"pinyin":["zha2 zhi4"],"word":"轧制"},{"definition":["casting\/foundry goods"],"pinyin":["zhu4 jian4"],"word":"铸件"},{"definition":["to straighten\/(fig.) to mend one's ways"],"pinyin":["jiao3 zhi2"],"word":"矫直"},{"definition":["to sinter\/to agglomerate ore by burning"],"pinyin":["shao1 jie2"],"word":"烧结"},{"definition":["workpiece"],"pinyin":["gong1 jian4"],"word":"工件"},{"definition":["workpiece"],"pinyin":["zhi4 jian4"],"word":"制件"},{"definition":["(steelmaking) roll\/roller\/CL:根[gen1]"],"pinyin":["zha2 gun3"],"word":"轧辊"},{"definition":["base body\/matrix\/substrate"],"pinyin":["ji1 ti3"],"word":"基体"},{"definition":["to polish\/to burnish"],"pinyin":["pao1 guang1"],"word":"抛光"},{"definition":["to process\/processing\/working (of machinery)"],"pinyin":["jia1 gong1"],"word":"加工"},{"definition":["to quench\/to temper\/to harden by quenching"],"pinyin":["cui4 huo3"],"word":"淬火"},{"definition":["to weld\/welding"],"pinyin":["han4 jie1"],"word":"焊接"},{"definition":["segregation (metallurgy)"],"pinyin":["pian1 xi1"],"word":"偏析"},{"definition":["to resist corrosion"],"pinyin":["nai4 shi2"],"word":"耐蚀"}]}