{"definition":["to feel strongly about\/to be fond of\/obsession\/deep commitment"],"pinyin":["re4 zhong1"],"traditional":["熱衷"],"rank":12358.0,"normalized_rank":0.17290445342996655,"fraction":0.000005832390103641637,"cumulative_fraction":0.9460580801829194,"word":"热衷","characters":[{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"热"},{"definition":["inner feelings"],"pinyin":["zhong1"],"word":"衷"}],"containing_words":[],"sentences":[{"english":"On Meeting the Celebrated I have always wondered at the passion many people have to meet the celebrated.","chinese":"论见名人许多人热衷于见名人，我始终不得其解。"},{"english":"Second, he pays little attentation to his cloth, food or other enjoyments but spend much money to buy law books.","chinese":"还有，他不注重衣食住行，而热衷于购买法律书籍。"},{"english":"'I'm not enthused about buying clothes. They don't interest me, ' he says.","chinese":"他说，我并不热衷买衣服，我对此不感兴趣。"},{"english":"This is thenichethattypography enthusiasts guard with fervor.","chinese":"但印刷体爱好者还是热衷此道。"},{"english":"Dehn himself was a particularly enthusiastic advocate of group diagrams.","chinese":"戴恩本人就特别热衷的群图解的倡导者。"},{"english":"Joe went enthusiastically to every lecture like a fresher.","chinese":"乔像一个大学新生一样，热衷于每一次讲座。"},{"english":"At FutureProof we are passionate about designing sustainable buildings, landscapes and communities.","chinese":"我们热衷于设计有承受力的建筑物，园艺和社区。"},{"english":"I can’t understand why everyone is so crazy about big-name brands.","chinese":"我弄不懂大家为什么这样热衷于名牌商品。"},{"english":"I am a fan of both the focusing lever and the larger attachable hood.","chinese":"我热衷于对焦杆和大的附加遮光罩。"},{"english":"He is keening on sports.","chinese":"他热衷于体育运动。"},{"english":"Skinski was a warm member with the gab.","chinese":"斯根斯基是一个热衷于神侃的人。"},{"english":"Hence, a growing number of individuals are showing incredible enthusiasm in financial comsumption and investment.","chinese":"越来越多的民众开始热衷金融消费与金融投资。"},{"english":"Sh: It seems that Australians aren't keen on education and job skills.","chinese":"好象澳大利亚人并不热衷热爱教育和职业培训。"},{"english":"Manufacturers and service providers are increasingly interested in working with Energy Star.","chinese":"制造商和服务商越来越热衷于与“能源之星”合作。"},{"english":"Fortune was keen to enumerate our progress.","chinese":"《财富杂志》热衷于枚举我们的进步。"},{"english":"I'm interested in photo-taking and traveling. I like sports very much, especially tennis and basketball.","chinese":"我非常热衷运动，特别是打网球跟篮球。"}],"related":[{"definition":["to treasure\/to be very fond of"],"pinyin":["zhong1 ai4"],"word":"钟爱"},{"definition":["to be infatuated with"],"pinyin":["zui4 xin1 yu2"],"word":"醉心于"},{"definition":["to be partial towards sth\/to favor\/to prefer\/preference\/favorite"],"pinyin":["pian1 ai4"],"word":"偏爱"},{"definition":["to be infatuated with\/to be enchanted by\/to be passionate about"],"pinyin":["mi2 lian4"],"word":"迷恋"},{"definition":["to be keen on\/to have a passion for"],"pinyin":["ku4 ai4"],"word":"酷爱"},{"definition":["to enjoy sth and never tire of it (idiom)"],"pinyin":["le4 ci3 bu4 pi2"],"word":"乐此不疲"},{"definition":["infatuated\/obsessed"],"pinyin":["chi1 mi2"],"word":"痴迷"},{"definition":["to have a special fondness (for sth)"],"pinyin":["qing2 you3 du2 zhong1"],"word":"情有独钟"},{"definition":["to like\/to be fond of"],"pinyin":["xi3 huan5"],"word":"喜欢"},{"definition":["to love ardently\/to adore"],"pinyin":["re4 ai4"],"word":"热爱"},{"definition":["to rush like ducks (idiom); the mob scrabbles madly for sth unobtainable\/an unruly crowd on a wild goose chase"],"pinyin":["qu1 zhi1 ruo4 wu4"],"word":"趋之若鹜"},{"definition":["to like\/to take pleasure in\/keen on\/fond of\/interest\/hobby\/appetite for\/CL:個|个[ge4]"],"pinyin":["ai4 hao4"],"word":"爱好"},{"definition":["to be interested"],"pinyin":["gan3 xing4 qu4"],"word":"感兴趣"},{"definition":["not to engage in honest work\/to ignore one's proper occupation\/not to attend to one's proper duties"],"pinyin":["bu4 wu4 zheng4 ye4"],"word":"不务正业"},{"definition":["to be in vogue\/to be prevalent"],"pinyin":["sheng4 xing2"],"word":"盛行"},{"definition":["to esteem\/to think highly of\/to accord importance to\/to revere"],"pinyin":["tui1 chong2"],"word":"推崇"}]}