{"definition":["after\/then (afterwards)\/after that\/afterwards"],"pinyin":["ran2 hou4"],"traditional":["然後"],"rank":700.0,"normalized_rank":0.009793908189106377,"fraction":0.0002203459288667435,"cumulative_fraction":0.5636537667360375,"word":"然后","characters":[{"definition":["correct\/right\/so\/thus\/like this\/-ly"],"pinyin":["ran2"],"word":"然"},{"definition":["empress\/queen\/(archaic) monarch\/ruler","back\/behind\/rear\/afterwards\/after\/later\/post-","surname Hou"],"pinyin":["hou4","hou4","Hou4"],"word":"后"}],"containing_words":[{"definition":["to learn is to know one's ignorance (the Book of Rites 禮記|礼记[Li3 ji4])"],"pinyin":["xue2 ran2 hou4 zhi1 bu4 zu2"],"word":"学然后知不足"}],"sentences":[{"english":"I just wanted to write down everything the professor said and memorize it.","chinese":"我就是把教授讲的话原原本本纪录下来然后记住。"},{"english":"Place the rice noodles in a large bowl, and cover with warm water.","chinese":"把米线放进一个大碗里，然后用温水浸泡。"},{"english":"Bll the boys laughed to hear the good news.","chinese":"听见这个好动静然后，所有的男孩都笑了。"},{"english":"Sit down and plan out a strategy for defeating your doubt.","chinese":"坐下来然后制定一项击败怀疑的计划。"},{"english":"And given those types of input, will get back output.","chinese":"然后鉴于输入类型返回结果输出。"},{"english":"A spectrum is then obtained and telemetered to the ground.","chinese":"然后记录它的光谱，并将数据通过遥测系统发回地面。"},{"english":"And we scheduled it and we get it and my dad and my sister would help trim it.","chinese":"先做安排然后实践，爸爸和姐姐会帮忙修剪圣诞树。"},{"english":"Then I understood.","chinese":"然后，我明白了。"},{"english":"Then slide the blade out the opposite end.","chinese":"然后从另一端将刀片滑出。"},{"english":"Blend oils and then add to a bowl of steaming water and inhale for five minutes.","chinese":"混合油，然后添加到一碗热气腾腾的水和吸入五分钟。"},{"english":"The thief walked out of the gallery with the picture underneath his painter's smock.","chinese":"他把画藏在了漆工的工作服下然后把它带出了画廊。"},{"english":"In a moment, you'll begin to feel light-headed, then drowsy.","chinese":"马上，你会开始感到头晕，然后昏昏欲睡。"},{"english":"Then he rushed into Mr Sun's kitchen to save her.","chinese":"然后他冲进孙奶奶家的厨房去救她。"},{"english":"Turn right onto Ford Road and take the first street on your left.","chinese":"右转到福特路，然后第一条街左转。"},{"english":"I would have carried him to the deepest part and dropped him in it.","chinese":"我会把他背到最深的地方然后把他丢下去。"},{"english":"Hold the mouth of a balloon filled with air. Let it go suddenly.","chinese":"捏紧一个充气的汽球口，然后突然松开手。"}],"related":[{"definition":["to catch and hold on\/to continue\/to go on to do sth\/to follow\/to carry on\/then\/after that\/subsequently\/to proceed\/to ensue\/in turn\/in one's turn"],"pinyin":["jie1 zhe5"],"word":"接着"},{"definition":["afterwards\/following\/later\/after"],"pinyin":["zhi1 hou4"],"word":"之后"},{"definition":["early\/prior\/former\/in advance\/first"],"pinyin":["xian1"],"word":"先"},{"definition":["again\/once more\/re-\/second\/another\/then (after sth, and not until then)\/no matter how ... (followed by an adjective or verb, and then (usually) 也[ye3] or 都[dou1] for emphasis)"],"pinyin":["zai4"],"word":"再"},{"definition":["empress\/queen\/(archaic) monarch\/ruler","back\/behind\/rear\/afterwards\/after\/later\/post-","surname Hou"],"pinyin":["hou4","hou4","Hou4"],"word":"后"},{"definition":["final\/last\/finally\/ultimate"],"pinyin":["zui4 hou4"],"word":"最后"},{"definition":["after\/later\/afterwards\/following\/later on\/in the future"],"pinyin":["yi3 hou4"],"word":"以后"},{"definition":["thereupon\/as a result\/consequently\/thus\/hence"],"pinyin":["yu2 shi4"],"word":"于是"},{"definition":["time\/length of time\/moment\/period"],"pinyin":["shi2 hou5"],"word":"时候"},{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["direct (opposite: indirect 間接|间接[jian4 jie1])\/immediate\/straightforward"],"pinyin":["zhi2 jie1"],"word":"直接"},{"definition":["handle","to hold\/to contain\/to grasp\/to take hold of\/handle\/particle marking the following noun as a direct object\/classifier for objects with handle\/classifier for small objects: handful"],"pinyin":["ba4","ba3"],"word":"把"},{"definition":["slowly"],"pinyin":["man4 man4"],"word":"慢慢"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"},{"definition":["can\/may\/possible\/able to\/not bad\/pretty good"],"pinyin":["ke3 yi3"],"word":"可以"},{"definition":["or\/possibly\/maybe\/perhaps"],"pinyin":["huo4 zhe3"],"word":"或者"}]}