{"definition":["to copy\/to imitate"],"pinyin":["zhao4 ban1"],"traditional":["照搬"],"rank":17189.0,"normalized_rank":0.2404964112322136,"fraction":0.000003218952649932466,"cumulative_fraction":0.9670320010925894,"word":"照搬","characters":[{"definition":["according to\/in accordance with\/to shine\/to illuminate\/to reflect\/to look at (one's reflection)\/to take (a photo)\/photo\/as requested\/as before","variant of 照[zhao4]\/to shine\/to illuminate"],"pinyin":["zhao4","zhao4"],"word":"照"},{"definition":["to move (i.e. relocate oneself)\/to move (sth relatively heavy or bulky)\/to shift\/to copy indiscriminately"],"pinyin":["ban1"],"word":"搬"}],"containing_words":[],"sentences":[{"english":"At on the market, mimicry with shine on to move the west the phenomenon of the building is always inseparable.","chinese":"在市场上，模仿与照搬西方建筑的现象始终如影随形。"},{"english":"Commercial, copying have been frequent failure of the products in the Chinese example.","chinese":"商业上，屡见照搬的产品在中国失败的例子。"},{"english":"But Tien said his commune can’t copy them.","chinese":"可阿德说自己的县没办法照搬他们的模式。"},{"english":"Never copy foreign things blindly or mechanically.","chinese":"不要盲目地或机械地照搬外国的东西。"},{"english":"Copy the spirit of the original not do it verbatim.","chinese":"要学原文的神，切不可原封不动照搬。"},{"english":"Never copy foreign things blindly or mechanically.","chinese":"决不要盲目地机械地照搬洋东西。"},{"english":"Isn't it plagiarism if copy word by word?","chinese":"若逐词照搬，岂不等于抄袭别人的译文？"},{"english":"Or, more specifically, about whether to copy it.","chinese":"或者，更具体地说，重新思考是否要照搬。"},{"english":"Asexuals , on the other hand, are genetically identical to their parent — they are clones.","chinese":"而无性繁殖就是全盘照搬父母的基因，即克隆。"},{"english":"After that, a lot of Latin American literature merely aped European models.","chinese":"从那时起，拉丁美洲的文学不过是照搬欧洲模式。"},{"english":"Some of the opposition party's policies have been appropriated by the government.","chinese":"反对党的一些政策已被政府照搬照用。"},{"english":"In those early days of opening and reform, the three-glass place setting seemed to be straight from central casting in Beijing.","chinese":"在改革开放初期，摆三只杯子似乎是照搬北京的模式。"},{"english":"Never copy foreign thing blindly or mechanically.","chinese":"决不要盲目地机械地照搬洋东西。"},{"english":"Mechanical copying of anything foreign would be disastrous.","chinese":"机械地照搬外国的东西要吃大亏的。"}],"related":[{"definition":["to copy word for word"],"pinyin":["zhao4 chao1"],"word":"照抄"},{"definition":["the attitude of mechanically borrowing (ideas etc)"],"pinyin":["na2 lai2 zhu3 yi4"],"word":"拿来主义"},{"definition":["to draw on (others' experience)\/to learn from (how others do things)\/lesson to be learned (by observing others)"],"pinyin":["jie4 jian4"],"word":"借鉴"},{"definition":["lit. to draw a dipper with a gourd as a model (idiom)\/fig. to copy slavishly"],"pinyin":["zhao4 hu2 lu5 hua4 piao2"],"word":"照葫芦画瓢"},{"definition":["to try to draw a tiger but end up with a likeness of a dog (idiom)\/to try to do sth overambitious and end up botching it"],"pinyin":["hua4 hu3 bu4 cheng2 fan3 lei4 quan3"],"word":"画虎不成反类犬"},{"definition":["to copy a set pattern mechanically\/to crib"],"pinyin":["tao4 yong4"],"word":"套用"},{"definition":["lit. drawing a tiger using a cat as a model (idiom); fig. to follow a model and get things more or less right but without capturing the spirit of the subject\/uninspired imitation"],"pinyin":["zhao4 mao1 hua4 hu3"],"word":"照猫画虎"},{"definition":["a wooden word-by-word reading"],"pinyin":["zhao4 ben3 xuan1 ke1"],"word":"照本宣科"},{"definition":["overall\/comprehensive"],"pinyin":["quan2 pan2"],"word":"全盘"},{"definition":["to reprint\/reproduction\/pirate copy\/(fig.) imitation\/carbon copy\/clone"],"pinyin":["fan1 ban3"],"word":"翻版"},{"definition":["lit. Dong Shi imitates Xi Shi's frown (idiom)\/fig. to mimick sb's idiosyncrasies but make a fool of oneself"],"pinyin":["Dong1 Shi1 xiao4 pin2"],"word":"东施效颦"},{"definition":["virtually the same\/differing only on small points"],"pinyin":["da4 tong2 xiao3 yi4"],"word":"大同小异"},{"definition":["to imitate\/to copy\/to emulate\/to mimic\/model"],"pinyin":["mo2 fang3"],"word":"模仿"},{"definition":["to copy the way they walk in Handan (idiom)\/slavishly copying others, one risks becoming a caricature"],"pinyin":["Han2 dan1 xue2 bu4"],"word":"邯郸学步"},{"definition":["lit. to build a cart behind closed doors\/to be overly subjective and disregard the outside world (idiom)"],"pinyin":["bi4 men2 zao4 che1"],"word":"闭门造车"},{"definition":["to cut the feet to fit the shoes (idiom); to force sth to fit (as to a Procrustean bed)\/impractical or inelegant solution"],"pinyin":["xue1 zu2 shi4 lu:3"],"word":"削足适履"}]}