{"definition":["the cooked duck flew away (proverb)\/(fig.) to let a sure thing slip through one's fingers"],"pinyin":["zhu3 shu2 de5 ya1 zi5 fei1 le5"],"traditional":["煮熟的鴨子飛了"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"煮熟的鸭子飞了","characters":[{"definition":["to cook\/to boil","variant of 煮[zhu3]"],"pinyin":["zhu3","zhu3"],"word":"煮"},{"definition":["cooked (of food)\/ripe (of fruit)\/mature (of seeds)\/familiar\/skilled\/done\/also pr. [shou2]"],"pinyin":["shu2"],"word":"熟"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["duck\/CL:隻|只[zhi1]\/(slang) male prostitute"],"pinyin":["ya1"],"word":"鸭"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi5","zi3"],"word":"子"},{"definition":["to fly"],"pinyin":["fei1"],"word":"飞"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"}],"containing_words":[],"sentences":[],"related":[{"definition":["lit. to try to steal a chicken only to end up losing the rice used to lure it (idiom)\/fig. to try to gain an advantage only to end up worse off\/to go for wool and come back shorn"],"pinyin":["tou1 ji1 bu4 cheng2 shi2 ba3 mi3"],"word":"偷鸡不成蚀把米"},{"definition":["having given away a bride, to lose one's army on top of it (idiom)\/to suffer a double loss after trying to trick the enemy"],"pinyin":["pei2 le5 fu1 ren2 you4 zhe2 bing1"],"word":"赔了夫人又折兵"},{"definition":["the chicken has flown the coop and the eggs are broken\/a dead loss (idiom)"],"pinyin":["ji1 fei1 dan4 da3"],"word":"鸡飞蛋打"},{"definition":["to lose Jingzhou due to carelessness (idiom)\/to suffer a major setback due to negligence"],"pinyin":["da4 yi5 shi1 Jing1 zhou1"],"word":"大意失荆州"},{"definition":["to meet with unexpected failure (idiom)\/to fail miserably (where failure was not expected)"],"pinyin":["yin1 gou1 li3 fan1 chuan2"],"word":"阴沟里翻船"},{"definition":["lit. to ruin the enterprise for the sake of one basketful\/to fail through lack of a final effort\/to spoil the ship for a ha'penny worth of tar (idiom)"],"pinyin":["gong1 kui1 yi1 kui4"],"word":"功亏一篑"},{"definition":["to fail within sight of success (idiom); last-minute failure\/to fall at the last hurdle\/snatching defeat from the jaws of victory"],"pinyin":["gong1 bai4 chui2 cheng2"],"word":"功败垂成"},{"definition":["lit. to kill the donkey when the grinding is done (idiom)\/to get rid of sb once he has ceased to be useful"],"pinyin":["xie4 mo4 sha1 lu:2"],"word":"卸磨杀驴"},{"definition":["see 偷雞不成蝕把米|偷鸡不成蚀把米[tou1 ji1 bu4 cheng2 shi2 ba3 mi3]"],"pinyin":["tou1 ji1 bu4 zhao2 shi2 ba3 mi3"],"word":"偷鸡不着蚀把米"},{"definition":["lit. Cheng Yaojin ambushes the enemy (saying)\/fig. sb shows up unexpectedly and disrupts the plan\/sb whose presence is regarded as irksome"],"pinyin":["ban4 lu4 sha1 chu1 ge4 Cheng2 Yao3 jin1"],"word":"半路杀出个程咬金"},{"definition":["avaricious and insatiable (idiom); greedy and never satisfied"],"pinyin":["tan1 xin1 bu4 zu2"],"word":"贪心不足"},{"definition":["too late for regrets"],"pinyin":["hou4 hui3 bu4 die2"],"word":"后悔不迭"},{"definition":["to crush one's own foot while trying to maneuver a rock (to a cliff edge, to drop on one's enemy) (idiom)\/hoisted by one's own petard"],"pinyin":["ban1 qi3 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬起石头砸自己的脚"},{"definition":["see 半路殺出個程咬金|半路杀出个程咬金[ban4 lu4 sha1 chu1 ge4 Cheng2 Yao3 jin1]"],"pinyin":["ban4 lu4 sha1 chu1 de5 Cheng2 Yao3 jin1"],"word":"半路杀出的程咬金"},{"definition":["to move a stone and stub one's toe\/to shoot oneself in the foot (idiom)"],"pinyin":["ban1 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬石头砸自己的脚"},{"definition":["hopes are dashed"],"pinyin":["xi1 wang4 luo4 kong1"],"word":"希望落空"}]}