{"definition":["to look for\/to seek\/to choose\/color of object\/color of fleece (of domestic animal)\/to see\/to notice\/all kinds of things\/odds and ends"],"pinyin":["wu4 se4"],"traditional":["物色"],"rank":18048.0,"normalized_rank":0.2525149357099884,"fraction":0.0000029253916423131205,"cumulative_fraction":0.9696628500277422,"word":"物色","characters":[{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"},{"definition":["color\/dice","color\/CL:種|种[zhong3]\/look\/appearance\/sex"],"pinyin":["shai3","se4"],"word":"色"}],"containing_words":[],"sentences":[{"english":"They are marching off to gyms and discovering face cream in record numbers.","chinese":"他们向健身房进军，物色到的面霜数目已创历史新高。"},{"english":"The new premier is forming his government mainly from young men.","chinese":"这位新总理主要从年轻人中物色人选组建政府。"},{"english":"I'll try my best to rout out a good goalkeeper for our football team.","chinese":"我愿尽力为我们的足球队物色一位优秀的守门员。"},{"english":"We have lined up a speaker for the meeting.","chinese":"我们已经为这个会物色到一个发言人。"},{"english":"The company is casting its net wide in its search for a new sales director.","chinese":"公司撒开大网到处物色新的销售主任。"},{"english":"So I began to look for a husband.","chinese":"因此我开始物色一个丈夫。"},{"english":"American military leaders began looking for someone to lead the attack.","chinese":"军方领导人开始物色合适人选。"},{"english":"They are beating the bushes for qualified persons in this field.","chinese":"他们正在四处物色这方面的人才。"},{"english":"We is offering a general agent for our textile in singapore.","chinese":"我公司欲在新加坡物色一名纺织品总代理。"},{"english":"I have lighted upon the book I wanted.","chinese":"我已物色到我所需要的那本书了。"},{"english":"They are hunting up the most promising candidates for the position.","chinese":"他们正在极力物色最适于这个职位的人选。"},{"english":"Eg. The company is casting its net wide in its search for a new sales director.","chinese":"公司撒开大网到处物色新的销售主任。"},{"english":"I will try and root out some good players for the basketball team.","chinese":"我将设法给篮球队物色几个优秀的选手。"},{"english":"The personnel manager has been casting about for somebody who can act as receptionist.","chinese":"人事部经理一直在到处物色接待员的人选。"},{"english":"A: I'm looking for a sleeveless blouse for my girlfriend.","chinese":"我正在为我女朋友物色一条无袖短衫。"},{"english":"The proposal came at a crucial time for Geithner, who has struggled to fill positions in his team.","chinese":"盖特纳一直在竭力为他团队中的空缺职位物色人选。"}],"related":[{"definition":["choice of person\/candidate"],"pinyin":["ren2 xuan3"],"word":"人选"},{"definition":["to act as go-between (between prospective marriage partners etc)"],"pinyin":["zuo4 mei2"],"word":"做媒"},{"definition":["to have a preference for\/to fancy\/to choose after consideration\/to settle on"],"pinyin":["kan4 zhong4"],"word":"看中"},{"definition":["to recommend sb\/to give a referral"],"pinyin":["yin3 jian4"],"word":"引荐"},{"definition":["to try to find\/to look for\/to call on sb\/to find\/to seek\/to return\/to give change"],"pinyin":["zhao3"],"word":"找"},{"definition":["to introduce (sb)\/(esp.) to present to the emperor"],"pinyin":["yin3 jian4"],"word":"引见"},{"definition":["to find to one's taste\/to pick (after looking at)\/Taiwan pr. [xiang4 zhong4]"],"pinyin":["xiang1 zhong4"],"word":"相中"},{"definition":["Mao Sui recommends himself (idiom); to offer one's services (in the style of Mao Sui offering his services to king of Chu 楚 of the Warring states)"],"pinyin":["Mao2 Sui4 zi4 jian4"],"word":"毛遂自荐"},{"definition":["to pull strings\/to manipulate (a puppet)\/to control from behind the scene\/to mediate"],"pinyin":["qian1 xian4"],"word":"牵线"},{"definition":["to act as a matchmaker"],"pinyin":["shuo1 mei2"],"word":"说媒"},{"definition":["ideal husband\/\"Mr. Right\""],"pinyin":["ru2 yi4 lang2 jun1"],"word":"如意郎君"},{"definition":["to put forward plans and ideas (also derogatory)\/to give advice (idiom)"],"pinyin":["chu1 mou2 hua4 ce4"],"word":"出谋划策"},{"definition":["to bribe\/to get (luggage) ready\/to put in order\/to organize things\/(baseball) RBI (run batted in)"],"pinyin":["da3 dian5"],"word":"打点"},{"definition":["to sound out opinions\/to get sb's views by polite or indirect questioning"],"pinyin":["tan4 kou3 feng1"],"word":"探口风"},{"definition":["to discuss a matter with sb\/to get in touch with\/to arrange"],"pinyin":["jie1 qia4"],"word":"接洽"},{"definition":["ideal son-in-law"],"pinyin":["cheng2 long2 kuai4 xu4"],"word":"乘龙快婿"}]}