{"definition":["top scorer in the palace examination (highest rank of the Imperial examination system)\/see 榜眼[bang3 yan3] and 探花[tan4 hua1]\/top scorer in college entrance examination 高考[gao1 kao3]\/(fig.) the most brilliantly talented person in the field\/leading light"],"pinyin":["zhuang4 yuan2"],"traditional":["狀元"],"rank":8039.0,"normalized_rank":0.11247603990318022,"fraction":0.000011853821234069478,"cumulative_fraction":0.9102625458813444,"word":"状元","characters":[{"definition":["accusation\/suit\/state\/condition\/strong\/great\/-shaped"],"pinyin":["zhuang4"],"word":"状"},{"definition":["surname Yuan\/the Yuan or Mongol dynasty (1279-1368)","currency unit (esp. Chinese yuan)\/first\/original\/primary\/fundamental\/constituent\/part\/era (of a reign)\/meta- (prefix)\/(math.) argument\/variable\/(Tw) (geology) eon"],"pinyin":["Yuan2","yuan2"],"word":"元"}],"containing_words":[{"definition":["lit. in every trade, a master appears (idiom); fig. You can produce outstanding achievements in any task, provided you put it enough love and diligence"],"pinyin":["hang2 hang2 chu1 zhuang4 yuan2"],"word":"行行出状元"}],"sentences":[{"english":"Griffin is the first No. 1 overall selection out of Oklahoma in school history.","chinese":"格里芬是Oklahoma大学历史上的第一个状元。"},{"english":"Mid-2001 exam, our school won the urban areas, students sail Kaozhuang Yuan.","chinese":"2001年中考，我校扬帆同学夺得了市区中考状元。"},{"english":"Can the Best Performers in Exams to Colleges Become Good Executives?","chinese":"高考状元能成为优秀经理人吗？"},{"english":"There are many sorts of hero, and most of us have more than one skill.","chinese":"行行出状元，我们大多数人都不只拥有一种技能。"},{"english":"The tea dance champion south window, given in church.","chinese":"红袖舞南窗，状元赐朝堂。"},{"english":"He was the top overall pick by the Rockets in the 2002 draft.","chinese":"他是火箭队在2002年选中的状元秀。"},{"english":"What do you think of cheating in the college entrance exam?","chinese":"你是怎么看待高考状元造假的呢？"},{"english":"Also known as the absolutely horrendous first overall pick by MJ when he was GM for the Wizards.","chinese":"大家都知道布朗是乔丹当奇才总经理时选的水货状元。"},{"english":"The Zhuangyuan Lou restaurant is located on Niutou Hill near Dongdu.","chinese":"状元楼食府是一家有着浓郁福建特色的文化餐厅。"},{"english":"No. 1 Scholar ZHANG Xie is the earliest playwright we can find up to now.","chinese":"《张协状元》是目前所能见到的最早的南戏作品。"},{"english":"Yao was the first ever NBA No. 1 pick from overseas.","chinese":"姚明是NBA历史上第一位非美籍的选秀状元。"},{"english":"He criticized the media hype over the so-called zhuangyuan.","chinese":"他对媒体对于“高考状元”的大肆宣传进行了批评。"},{"english":"The news that a winner of the College Entrance Exam sponsored for certain underwear has aroused controversy recently.","chinese":"最近，高考状元代言内裤的新闻引起了一阵争议。"}],"related":[{"definition":["candidate who came third in the Han-lin examination\/see 狀元|状元[zhuang4 yuan2]"],"pinyin":["tan4 hua1"],"word":"探花"},{"definition":["candidate who came second in the Han-lin examination\/see 狀元|状元[zhuang4 yuan2]"],"pinyin":["bang3 yan3"],"word":"榜眼"},{"definition":["successful candidate in the highest imperial civil service examination\/palace graduate"],"pinyin":["jin4 shi4"],"word":"进士"},{"definition":["graduate\/successful candidate in the imperial provincial examination"],"pinyin":["ju3 ren2"],"word":"举人"},{"definition":["to pass an exam"],"pinyin":["kao3 zhong4"],"word":"考中"},{"definition":["first-placed candidate in the provincial imperial examinations (old)"],"pinyin":["jie4 yuan2"],"word":"解元"},{"definition":["court examination, the top grade imperial exam"],"pinyin":["dian4 shi4"],"word":"殿试"},{"definition":["to pass the provincial level imperial examination"],"pinyin":["zhong4 ju3"],"word":"中举"},{"definition":["title of the temporary position in the Hanlin Academy, conferred to meritorious candidates until the next examination"],"pinyin":["shu4 ji2 shi4"],"word":"庶吉士"},{"definition":["(old) candidate who has successfully passed the first grades of the examination system, but not yet the court examination (殿試|殿试[dian4 shi4])"],"pinyin":["gong4 shi4"],"word":"贡士"},{"definition":["candidate for the Imperial Examination proposed by a tributary state"],"pinyin":["gong4 sheng1"],"word":"贡生"},{"definition":["refers to academics employed as imperial secretaries from the Tang onwards, forming the Hanlin Imperial Academy 翰林院"],"pinyin":["Han4 lin2"],"word":"翰林"},{"definition":["a person who has passed the county level imperial exam (historical)\/scholar\/skillful writer\/fine talent"],"pinyin":["xiu4 cai5"],"word":"秀才"},{"definition":["the triennial provincial imperial exam during the Ming and Qing"],"pinyin":["xiang1 shi4"],"word":"乡试"},{"definition":["court examination, the top grade imperial exam"],"pinyin":["ting2 shi4"],"word":"廷试"},{"definition":["imperial examination"],"pinyin":["ke1 ju3"],"word":"科举"}]}