{"definition":["to offer sacrifice"],"pinyin":["xian4 ji4"],"traditional":["獻祭"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"献祭","characters":[{"definition":["to offer\/to present\/to dedicate\/to donate\/to show\/to put on display\/worthy person (old)"],"pinyin":["xian4"],"word":"献"},{"definition":["surname Zhai","to offer a sacrifice to (gods or ancestors)\/memorial ceremony\/(in classical novels) to recite an incantation to activate a magic weapon\/(lit. and fig.) to wield"],"pinyin":["Zhai4","ji4"],"word":"祭"}],"containing_words":[],"sentences":[{"english":"How many offerings are listed in these first seven chapters?","chinese":"在利未记的头七章总共列出了多少种献祭？"},{"english":"In place of Isaac, God provided a ram for Abraham to sacrifice.","chinese":"神为亚伯拉罕预备了献祭的公羊，代替以撒。"},{"english":"The people, however, continued to sacrifice at the high places, but only to the Lord their God.","chinese":"百姓却仍在丘坛上献祭，只献给耶和华他们的神。"},{"english":"Nevertheless the people did sacrifice still in the high places, yet unto the LORD their God only.","chinese":"百姓却仍在邱坛上献祭，只献给耶和华他们的神。"},{"english":"Roman soldiers had killed some Galileans who had been offering sacrifices.","chinese":"罗马士兵杀害了一些献祭的加利利人。"},{"english":"Institutional social inequalities existed such as slavery and human sacrifice.","chinese":"一些社会的不平等以及存在，如奴隶和活人献祭。"},{"english":"The inmost court was where the priests alone could enter to offer sacrifices.","chinese":"至于最内部的院，只有祭司才可进到里面去献祭。"},{"english":"Since it was a big wish, it called for a big sacrifice.","chinese":"因为他许了一个大愿，所以他需要一个盛大得献祭。"},{"english":"And by reason hereof he ought, as for the people, so also for himself, to offer for sins.","chinese":"故此他理当为百姓和自己献祭赎罪。"},{"english":"Then the king and all Israel with him offered sacrifices before the Lord .","chinese":"王和以色列众民一同在耶和华面前献祭。"},{"english":"The more blood that is offered to the Gods, the more readily they are appeased .","chinese":"用于献祭鲜血愈多，诸神便会愈加愉悦。"},{"english":"A Son’s Sacrifice won the Silverdocs audience award for short films.","chinese":"《儿子的献祭》获得本届银城电影节短片观众奖。"},{"english":"The purification offering acts on the sanctuary, not on the offerer.","chinese":"净化祭是对圣所起作用，而不是对献祭者。"},{"english":"For by one offering he hath perfected for ever them that are sanctified.","chinese":"因为他一次献祭，便叫那得以成圣的人永远完全。"},{"english":"And the king, and all Israel with him, offered sacrifice before the LORD.","chinese":"王和以色列众民一同在耶和华面前献祭。"},{"english":"To the Aztecs, human sacrifice was a necessary appeasement to the gods.","chinese":"对阿芝科特来说，供奉上帝是必须用活人献祭的。"}],"related":[{"definition":["offering"],"pinyin":["ji4 pin3"],"word":"祭品"},{"definition":["blood sacrifice\/animal sacrifice (to a God or ancestral spirit)"],"pinyin":["xue4 ji4"],"word":"血祭"},{"definition":["Holy Ghost\/Holy Spirit"],"pinyin":["Sheng4 ling2"],"word":"圣灵"},{"definition":["divinity"],"pinyin":["shen2 xing4"],"word":"神性"},{"definition":["to revive\/(lit. and fig.) to come back to life\/(religion) resurrection"],"pinyin":["fu4 huo2"],"word":"复活"},{"definition":["altar"],"pinyin":["ji4 tan2"],"word":"祭坛"},{"definition":["to offer sacrifices to the gods or ancestors"],"pinyin":["ji4 si4"],"word":"祭祀"},{"definition":["priest"],"pinyin":["ji4 si1"],"word":"祭司"},{"definition":["prophet"],"pinyin":["xian1 zhi1"],"word":"先知"},{"definition":["the True God"],"pinyin":["zhen1 shen2"],"word":"真神"},{"definition":["witchcraft"],"pinyin":["wu1 shu4"],"word":"巫术"},{"definition":["god\/spirit\/demon\/occult or supernatural entities in general"],"pinyin":["shen2 ling2"],"word":"神灵"},{"definition":["to summon\/to beckon\/to call"],"pinyin":["zhao4 huan4"],"word":"召唤"},{"definition":["reincarnation (Buddhism)"],"pinyin":["zhuan3 sheng1"],"word":"转生"},{"definition":["oracle"],"pinyin":["shen2 yu4"],"word":"神谕"},{"definition":["occult force\/the power of a God or spirit"],"pinyin":["shen2 li4"],"word":"神力"}]}