{"definition":["to commit one's energy to\/to devote oneself to\/to sacrifice one's life for\/(coll.) (of a woman) to give one's virginity to"],"pinyin":["xian4 shen1"],"traditional":["獻身"],"rank":17174.0,"normalized_rank":0.24028654177101846,"fraction":0.000003222164157723428,"cumulative_fraction":0.966983691840666,"word":"献身","characters":[{"definition":["to offer\/to present\/to dedicate\/to donate\/to show\/to put on display\/worthy person (old)"],"pinyin":["xian4"],"word":"献"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"}],"containing_words":[],"sentences":[{"english":"After he graduated, he joined the army and devoted himself to making his motherland safe.","chinese":"毕业之后他参加了部队，献身于保卫祖国。"},{"english":"I will offer myself to the state as emergency arise.","chinese":"一旦发生紧急情况，我一定会为祖国献身的。"},{"english":"And those fighters seem to have been extremely dedicated.","chinese":"而这些战士似乎就是要来献身的。"},{"english":"I want to devote my life to the prayer that can bring down God's blessing.","chinese":"我要献身于祷告，好带下神的祝福。"},{"english":"What do you think about that Zhao Yazhi was nakedness for public utility?","chinese":"赵雅芝裸体出镜，晚节不保还是为公益献身？"},{"english":"He has devoted himself to teaching since he graduated from the college in 1962.","chinese":"他一九六二年大学毕业以后一直献身教学工作。"},{"english":"Everybody spoke in praise of her devotion to the cause of education.","chinese":"大家异口同声地称赞她献身教育事业的精神。"},{"english":"He weds himself to education.","chinese":"他献身于教育事业。"},{"english":"She has devoted herself unreservedly to the great cause.","chinese":"她毫无保留地献身于这伟大的事业。"},{"english":"But dedication is a must.","chinese":"但献身精神是必不可少的。"},{"english":"He wanted to honor the brave men who had died at Gettysburg.","chinese":"他想表彰那些献身于葛底斯堡战役中的勇士们。"},{"english":"Science only bestows the grandest favour on those who concentrate on it.","chinese":"科学只把最高的恩典赐给专心致志地献身于科学的人。"},{"english":"Zhou was committed to the cause of language teaching all his life.","chinese":"周教授将毕生经历都献身于语言教育事业。"},{"english":"They were asked to rededicate themselves to their country.","chinese":"他们不得已为了国家再次献身。"},{"english":"This is the day when America remembers those who died in service to their country.","chinese":"今天是美国民众纪念为国献身者的日子。"},{"english":"A hymn is also dedicated to him alone in Rig Veda.","chinese":"利俱吠陀也有一首独一无二献身于他的诗。"}],"related":[{"definition":["to offer\/to give (as tribute)\/to devote (one's life)\/to sacrifice (oneself)"],"pinyin":["xian4 chu1"],"word":"献出"},{"definition":["to meet death"],"pinyin":["fu4 si3"],"word":"赴死"},{"definition":["to sacrifice one's life"],"pinyin":["juan1 qu1"],"word":"捐躯"},{"definition":["to give up life for righteousness (idiom, from Mencius); to choose honor over life\/would rather sacrifice one's life than one's principles"],"pinyin":["she3 sheng1 qu3 yi4"],"word":"舍生取义"},{"definition":["willingly"],"pinyin":["gan1 yuan4"],"word":"甘愿"},{"definition":["to go through water and tread on fire (idiom); not afraid of any difficulty"],"pinyin":["fu4 tang1 dao3 huo3"],"word":"赴汤蹈火"},{"definition":["to die for a just cause"],"pinyin":["xun4 dao4"],"word":"殉道"},{"definition":["bravery with no thought of personal safety (idiom); risking life and limb\/undaunted by perils"],"pinyin":["she3 sheng1 wang4 si3"],"word":"舍生忘死"},{"definition":["utterly fearless"],"pinyin":["da4 wu2 wei4"],"word":"大无畏"},{"definition":["majestic\/sublime"],"pinyin":["chong2 gao1"],"word":"崇高"},{"definition":["to die without regrets (idiom); to sacrifice oneself without hesitation"],"pinyin":["yun3 shen1 bu4 xu4"],"word":"殒身不恤"},{"definition":["to abandon self for others (idiom, from Analects); to sacrifice one's own interest for other people\/altruism"],"pinyin":["she3 ji3 wei4 ren2"],"word":"舍己为人"},{"definition":["to be killed for a righteous cause\/to die a martyr"],"pinyin":["jiu4 yi4"],"word":"就义"},{"definition":["to bend to a task and spare no effort (idiom); striving to the utmost"],"pinyin":["ju1 gong1 jin4 cui4"],"word":"鞠躬尽瘁"},{"definition":["to display utter loyalty\/to be loyal to the end"],"pinyin":["jin4 zhong1"],"word":"尽忠"},{"definition":["until death puts an end (idiom); one's whole life\/unto one's dying day"],"pinyin":["si3 er2 hou4 yi3"],"word":"死而后已"}]}