{"definition":["to take the lead\/to show initiative"],"pinyin":["shuai4 xian1"],"traditional":["率先"],"rank":2495.0,"normalized_rank":0.034908287045457724,"fraction":0.00005967842743606825,"cumulative_fraction":0.763696908000427,"word":"率先","characters":[{"definition":["to lead\/to command\/rash\/hasty\/frank\/straightforward\/generally\/usually","rate\/frequency"],"pinyin":["shuai4","lu:4"],"word":"率"},{"definition":["early\/prior\/former\/in advance\/first"],"pinyin":["xian1"],"word":"先"}],"containing_words":[],"sentences":[{"english":"The first use of cemented fragmental rock filling in China was conducted atTongkeng tin mine operated by Dachang Mine Bureau.","chinese":"大厂铜坑锡矿在国内率先使用块石砂浆胶结充填法。"},{"english":"Low-alcohol Lujiu (liquors produced in Shandong) is the first to enter national market in quantities.","chinese":"低度鲁酒率先大批量地走向全国市场。"},{"english":"Guangzhou is expected to take the lead in collecting light pollution fees in the country.","chinese":"广州市将率先在全国开征光污染排污费。"},{"english":"They also called on the G-8 industrialized nations to lead the way in enforcing laws already on the books.","chinese":"他们还呼吁西方八国率先实施已制定的法律。"},{"english":"Changhong made the first step towards the goal.","chinese":"在这方面，长虹公司率先走出了第一步。"},{"english":"Fujian is the first province in the country to reform collective forest property right.","chinese":"福建省率先在全国开展集体林产权制度改革。"},{"english":"Aurora introduced one of the first cell-phone-guided walking tours offered in America.","chinese":"奥罗拉是美国率先引进电池电话导航旅游的地方。"},{"english":"The main leaders of the Party Committee in Jiangxi province proposed that Xinyu take the lead to realize the city and countryside integration.","chinese":"省委主要领导要求新余在全省率先实现城乡一体化。"},{"english":"We have pioneered research to better understand the root causes of corruption.","chinese":"我们率先开展了研究，以更好地认识腐败的根源。"},{"english":"Take the lead in Taizhou of Jiangsu Province City pilot compiled an overall land use planning.","chinese":"率先在江苏省泰州市试点编制土地利用总体规划。"},{"english":"His mother is Austrian took the lead in studying medicine, one of the women.","chinese":"他的母亲是奥国率先学习医科的妇女之一。"},{"english":"He acted as pioneer in proposing the method.","chinese":"他是率先创导这一方法的人。"},{"english":"Our company has taken the lead in establishing Harbin Zhongda Research Institute for profiles doors and windows among the same industry.","chinese":"在同行业中率先成立了哈尔滨市中大塑料门窗研究所。"},{"english":"Marx and Engels were the first socialists to support trade unions.","chinese":"率先支持工会运动的社会主义者也是马克思和恩格斯。"},{"english":"Simultaneously Our company primitively set up the special equipment liability insurance mechanism in China.","chinese":"同时我公司在国内率先设立专门的设备责任保险机制。"},{"english":"Tusk said they had been the first to offer condolences.","chinese":"图斯克表示，他们已率先吊唁。"}],"related":[{"definition":["to rush (to do sth urgent)\/to try to be the first\/to forestall"],"pinyin":["qiang3 xian1"],"word":"抢先"},{"definition":["once more\/once again\/one more time"],"pinyin":["zai4 du4"],"word":"再度"},{"definition":["in succession\/following closely"],"pinyin":["xiang1 ji4"],"word":"相继"},{"definition":["soon after"],"pinyin":["sui2 hou4"],"word":"随后"},{"definition":["(the) very first"],"pinyin":["zui4 xian1"],"word":"最先"},{"definition":["first\/first time\/for the first time"],"pinyin":["shou3 ci4"],"word":"首次"},{"definition":["one more time\/again\/one more\/once again"],"pinyin":["zai4 ci4"],"word":"再次"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推进"},{"definition":["to follow closely behind sb or sth (idiom)"],"pinyin":["jin3 sui2 qi2 hou4"],"word":"紧随其后"},{"definition":["aspect\/phase\/situation"],"pinyin":["ju2 mian4"],"word":"局面"},{"definition":["to take the lead"],"pinyin":["yi1 ma3 dang1 xian1"],"word":"一马当先"},{"definition":["all-around\/comprehensive\/total\/overall"],"pinyin":["quan2 mian4"],"word":"全面"},{"definition":["on end\/in a row\/in succession"],"pinyin":["jie1 lian2"],"word":"接连"},{"definition":["at the same time\/meanwhile"],"pinyin":["yu3 ci3 tong2 shi2"],"word":"与此同时"},{"definition":["strong\/powerful\/(linguistics) emphatic\/intensive"],"pinyin":["qiang2 shi4"],"word":"强势"},{"definition":["to take advantage\/to seize an opportunity\/in passing\/without taking extra trouble\/conveniently"],"pinyin":["shun4 shi4"],"word":"顺势"}]}