{"definition":["Yushu Tibetan autonomous prefecture (Tibetan: yus hru'u bod rigs rang skyong khul) in Qinghai"],"pinyin":["Yu4 shu4"],"traditional":["玉樹"],"rank":32239.0,"normalized_rank":0.4510654372980006,"fraction":7.736814223682404e-7,"cumulative_fraction":0.9921556392413472,"word":"玉树","characters":[{"definition":["jade"],"pinyin":["yu4"],"word":"玉"},{"definition":["tree\/CL:棵[ke1]\/to cultivate\/to set up"],"pinyin":["shu4"],"word":"树"}],"containing_words":[{"definition":["Yushu Tibetan autonomous prefecture (Tibetan: yus hru'u bod rigs rang skyong khul) in Qinghai"],"pinyin":["Yu4 shu4 zhou1"],"word":"玉树州"},{"definition":["Yushu county (Tibetan: yus hru'u rdzong) in Yushu Tibetan autonomous prefecture 玉樹藏族自治州|玉树藏族自治州[Yu4 shu4 Zang4 zu2 zi4 zhi4 zhou1], Qinghai"],"pinyin":["Yu4 shu4 xian4"],"word":"玉树县"},{"definition":["Yushu Tibetan autonomous prefecture (Tibetan: yus hru'u bod rigs rang skyong khul) in Qinghai"],"pinyin":["Yu4 shu4 Zang4 zu2 zi4 zhi4 zhou1"],"word":"玉树藏族自治州"},{"definition":["lit. orchids and jade trees (idiom); fig. a child with splendid future prospects"],"pinyin":["zhi1 lan2 yu4 shu4"],"word":"芝兰玉树"}],"sentences":[{"english":"Yushu wasn't on the list.","chinese":"玉树未列入这一名单。"},{"english":"The great will of combating the Yushu earthquake continuously inspired me.","chinese":"与玉树地震斗争的坚强意志不断地激励着我。"},{"english":"Objective To investigate the protective effects of Herba Swertiae Mussotll liver injury in mice.","chinese":"目的研究玉树獐牙菜对小鼠实验性肝损伤的保护作用。"},{"english":"China is holding a national day of mourning for victims of the powerful earthquake in Qinghai province.","chinese":"中国为青海玉树地震伤亡者举行全国哀悼日。"},{"english":"Yushu have many the miracle of life, a lot of people with you.","chinese":"玉树有很多生命的古迹，很多让人敬佩的人与事。"},{"english":"These trees are evergreen and are beautiful objects at all seasons of the year.","chinese":"这些树四季常青，有如玉树临风。"},{"english":"I suddenly thought of the people in Yushu, who are going through the threat of strong earthquakes.","chinese":"我突然想起了玉树人民，他们正在经受强地震的威胁。"},{"english":"A poem lovely as a tree.","chinese":"美如玉树的诗章。"},{"english":"Mongolia will invite 60 students from the quake-hit area in Qinghai to recuperate in Mongolia.","chinese":"蒙方邀请60名青海玉树地震灾区学生来蒙休养。"},{"english":"\"They left Qamdo in the morning and will arrive at Yushu in the afternoon,\" he said.","chinese":"他们于早晨离开昌都，将于下午抵达玉树。"},{"english":"Yushu lies at the great mountains, against a gentle hill side.","chinese":"玉树位于大山之间，偎依着一个大山的缓坡。"},{"english":"We decided to release the information on the Yushu Earthquake first.","chinese":"我们决定先公布玉树地震灾区捐赠信息。"},{"english":"Tibetan residents of Jiegu, Yushu County, in northwest China's Qinghai province have a meal outside their makeshift tents amid the rubble of demolished homes on April 15.","chinese":"玉树结古镇的藏民们在临时搭建的帐篷外就餐。"},{"english":"National flag-raising ceremony held in Yushu .","chinese":"玉树举行迎国庆升旗仪式。"},{"english":"Steward was indeed tall and handsome, with a narrow waist and gray sideburns .","chinese":"史都华确实是玉树临风，沈腰潘鬓。"},{"english":"Father was a policeman, 38-year-old, jade tree.","chinese":"爸爸是一名警察，今年38岁了，玉树临风。"}],"related":[{"definition":["Nagchu town and prefecture in central Tibet"],"pinyin":["Na3 qu1"],"word":"那曲"},{"definition":["Nangqên county (Tibetan: nang chen rdzong) in Yushu Tibetan autonomous prefecture 玉樹藏族自治州|玉树藏族自治州[Yu4 shu4 Zang4 zu2 zi4 zhi4 zhou1], Qinghai"],"pinyin":["Nang2 qian1"],"word":"囊谦"},{"definition":["Golog Tibetan autonomous prefecture in south Qinghai"],"pinyin":["Guo3 luo4"],"word":"果洛"},{"definition":["snow lotus herb\/Saussurea involucrata"],"pinyin":["xue3 lian2"],"word":"雪莲"},{"definition":["Qumarleb county (Tibetan: chu dmar leb rdzong) in Yushu Tibetan autonomous prefecture 玉樹藏族自治州|玉树藏族自治州[Yu4 shu4 Zang4 zu2 zi4 zhi4 zhou1], Qinghai"],"pinyin":["Qu3 ma2 lai2"],"word":"曲麻莱"},{"definition":["Qinghai province (Tsinghai) in west China, abbr. 青, capital Xining 西寧|西宁"],"pinyin":["Qing1 hai3"],"word":"青海"},{"definition":["Kham or Chamdo, Tibetan: Chab mdo historic capital of Kham prefecture of Tibet (Chinese Qamdo or Changdu)\/also Qamdo county"],"pinyin":["Chang1 du1"],"word":"昌都"},{"definition":["Garze or Kandze, capital of Garze Tibetan autonomous prefecture 甘孜藏族自治州[Gan1 zi1 Zang4 zu2 zi4 zhi4 zhou1], formerly in Kham province of Tibet, present Sichuan"],"pinyin":["Gan1 zi1"],"word":"甘孜"},{"definition":["Qilian county in Haibei Tibetan autonomous prefecture 海北藏族自治州[Hai3 bei3 Zang4 zu2 zi4 zhi4 zhou1], Qinghai"],"pinyin":["Qi2 lian2"],"word":"祁连"},{"definition":["Tianshan mountain range between XinJiang and Mongolia and Kyrgyzstan"],"pinyin":["Tian1 shan1"],"word":"天山"},{"definition":["Golmud or Ge'ermu city (Tibetan: na gor mo grong khyer) in Haixi Mongol and Tibetan autonomous prefecture 海西蒙古族藏族自治州[Hai3 xi1 Meng3 gu3 zu2 Zang4 zu2 zi4 zhi4 zhou1], Qinghai"],"pinyin":["Ge2 er3 mu4"],"word":"格尔木"},{"definition":["Sanjiangyuan National Nature Reserve, high plateau region of Qinghai containing the headwaters of Changjiang or Yangtze, Huanghe or Yellow River and Lancang or Mekong River"],"pinyin":["San1 jiang1 yuan2"],"word":"三江源"},{"definition":["Yushu Tibetan autonomous prefecture (Tibetan: yus hru'u bod rigs rang skyong khul) in Qinghai"],"pinyin":["Yu4 shu4 zhou1"],"word":"玉树州"},{"definition":["Hongyuan county (Tibetan: rka khog rdzong) in Ngawa Tibetan and Qiang autonomous prefecture 阿壩藏族羌族自治州|阿坝藏族羌族自治州[A1 ba4 Zang4 zu2 Qiang1 zu2 zi4 zhi4 zhou1], northwest Sichuan"],"pinyin":["Hong2 yuan2"],"word":"红原"},{"definition":["Golog Tibetan autonomous prefecture (Tibetan: Mgo-log Bod-rigs rang-skyong-khul) in south Qinghai"],"pinyin":["Guo3 luo4 zhou1"],"word":"果洛州"},{"definition":["camellia"],"pinyin":["cha2 hua1"],"word":"茶花"}]}