{"definition":["to play with fire and get burnt (idiom); fig. to play with evil and suffer the consequences\/to get one's fingers burnt"],"pinyin":["wan2 huo3 zi4 fen2"],"traditional":["玩火自焚"],"rank":53058.0,"normalized_rank":0.7423502581394372,"fraction":1.0291422693766217e-7,"cumulative_fraction":0.9993349027215728,"word":"玩火自焚","characters":[{"definition":["to play\/to have fun\/to trifle with\/toy\/sth used for amusement\/curio or antique (Taiwan pr. [wan4])\/to keep sth for entertainment","variant of 玩[wan2]\/Taiwan pr. [wan4]"],"pinyin":["wan2","wan2"],"word":"玩"},{"definition":["fire\/urgent\/ammunition\/fiery or flaming\/internal heat (Chinese medicine)\/hot (popular)\/classifier for military units (old)\/Kangxi radical 86","surname Huo"],"pinyin":["huo3","Huo3"],"word":"火"},{"definition":["self\/oneself\/from\/since\/naturally\/surely"],"pinyin":["zi4"],"word":"自"},{"definition":["to burn"],"pinyin":["fen2"],"word":"焚"}],"containing_words":[],"sentences":[{"english":"This is fire we are playing with.","chinese":"我不宜于在玩火自焚。"},{"english":"The result will be very serious and I really hope that they would stop playing with fire.","chinese":"后果将十分严重，我真心希望他们停止玩火自焚。"},{"english":"Rosicky got the thistles raked up, but did not stop to burn them.","chinese":"罗西基得到了荆棘倾斜了，但没有停下来玩火自焚。"},{"english":"To continue would be crazy, they said.","chinese":"他们认为再这样继续下去，无异于玩火自焚。"}],"related":[{"definition":["to dig one's own grave"],"pinyin":["zi4 jue2 fen2 mu4"],"word":"自掘坟墓"},{"definition":["to eat one's own fruit (idiom); fig. suffering the consequences of one's own action\/to reap what one has sown"],"pinyin":["zi4 shi2 qi2 guo3"],"word":"自食其果"},{"definition":["to court disaster (idiom)\/to dig one's own grave"],"pinyin":["zi4 qu3 mie4 wang2"],"word":"自取灭亡"},{"definition":["to invite trouble"],"pinyin":["yin3 huo3 shao1 shen1"],"word":"引火烧身"},{"definition":["to play with fire"],"pinyin":["wan2 huo3"],"word":"玩火"},{"definition":["lit. to eat one's own bitter fruit (idiom)\/fig. to suffer the consequences of one's own actions\/to stew in one's own juice"],"pinyin":["zi4 shi2 e4 guo3"],"word":"自食恶果"},{"definition":["to crush one's own foot while trying to maneuver a rock (to a cliff edge, to drop on one's enemy) (idiom)\/hoisted by one's own petard"],"pinyin":["ban1 qi3 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬起石头砸自己的脚"},{"definition":["stir up the fire and you get burnt (idiom); to get one's fingers burnt\/fig. to suffer on account of one's own meddling"],"pinyin":["re3 huo3 shao1 shen1"],"word":"惹火烧身"},{"definition":["see 自食惡果|自食恶果[zi4 shi2 e4 guo3]"],"pinyin":["zi4 shi2 ku3 guo3"],"word":"自食苦果"},{"definition":["a single slip may cause everlasting sorrow (idiom)"],"pinyin":["yi1 shi1 zu2 cheng2 qian1 gu3 hen4"],"word":"一失足成千古恨"},{"definition":["lit. to try to steal a chicken only to end up losing the rice used to lure it (idiom)\/fig. to try to gain an advantage only to end up worse off\/to go for wool and come back shorn"],"pinyin":["tou1 ji1 bu4 cheng2 shi2 ba3 mi3"],"word":"偷鸡不成蚀把米"},{"definition":["to show the wolf into the house (idiom)\/to introduce a potential source of trouble"],"pinyin":["yin3 lang2 ru4 shi4"],"word":"引狼入室"},{"definition":["to ask for trouble (idiom)\/to make a rod for one's own back"],"pinyin":["zi4 tao3 ku3 chi1"],"word":"自讨苦吃"},{"definition":["to spin a cocoon around oneself (idiom); enmeshed in a trap of one's own devising\/hoist by his own petard"],"pinyin":["zuo4 jian3 zi4 fu4"],"word":"作茧自缚"},{"definition":["to move a stone and stub one's toe\/to shoot oneself in the foot (idiom)"],"pinyin":["ban1 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬石头砸自己的脚"},{"definition":["disaster one brings on oneself\/to be reponsible for something bad that happens to oneself\/to have only oneself to blame"],"pinyin":["zi4 zuo4 nie4"],"word":"自作孽"}]}