{"definition":["to straighten out\/to sort out\/to organize"],"pinyin":["li3 shun4"],"traditional":["理順"],"rank":11585.0,"normalized_rank":0.16208918052971052,"fraction":0.0000064875376929979895,"cumulative_fraction":0.941308789183006,"word":"理顺","characters":[{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["to obey\/to follow\/to arrange\/to make reasonable\/along\/favorable"],"pinyin":["shun4"],"word":"顺"}],"containing_words":[],"sentences":[{"english":"We must rationalize our regulatory system. The regulator must have the capacity to regulate comprehensive services.","chinese":"我们必须理顺监管体制。"},{"english":"She smoothed her dishevelled hair.","chinese":"她理顺了乱蓬蓬的头发。"},{"english":"Make smooth raw material inspection and storage procedures and strengthen rechecking of samples for witness of raw material storage.","chinese":"理顺原材料进库检验及储存，加强进库见证取样复检。"},{"english":"We cannot speed up the reform without rationalizing prices.","chinese":"理顺物价，改革才能加快步伐。"},{"english":"Zoom in, out, or use colored nodes to create order out of that chaos.","chinese":"放大，缩小，或者使用色标理顺想法。"},{"english":"Eighth, consummate the system of popularizing agricultural technique.","chinese":"八是完善理顺农技推广体系。"},{"english":"A men's T-shirt should be face down and smoothed out before you fold it.","chinese":"一个男人的T恤应该是朝下并理顺之前，把它折叠。"},{"english":"Want to keep your plaster pliable a bit longer to get it all smoothed out?","chinese":"要保留你的石膏柔韧多一点的时间来把一切理顺吗？"},{"english":"One, the relation that straightens enterprise of local power supply and provincial power company.","chinese":"理顺地方供电企业与省级电力公司的关系。"},{"english":"You should straighten up your ideas first.","chinese":"你得先把你的思路理顺。"},{"english":"The government is making unprecedented efforts to stanch the bleeding.","chinese":"美国政府正在采取史无前例的行动来理顺经济。"},{"english":"The distribution of the graduates needs to be straightened out.","chinese":"毕业生分配关系没有理顺。"},{"english":"A gentle, relaxing gel, formulated to help reduce puffiness and smooth out fine lines.","chinese":"柔和轻松凝胶以帮助减少浮肿和理顺幼纹。"}],"related":[{"definition":["to comb\/fig. to sort out"],"pinyin":["shu1 li3"],"word":"梳理"},{"definition":["to clarify (the facts)\/clarification"],"pinyin":["li2 qing1"],"word":"厘清"},{"definition":["to unblock\/to dredge\/to clear the way\/to get things flowing\/to facilitate\/to mediate\/to lobby\/to explicate (a text)"],"pinyin":["shu1 tong1"],"word":"疏通"},{"definition":["to do well at\/to do a good job"],"pinyin":["gao3 hao3"],"word":"搞好"},{"definition":["clear\/well-defined\/limpid"],"pinyin":["ming2 xi1"],"word":"明晰"},{"definition":["to tidy up\/to reorganize\/to consolidate\/to rectify"],"pinyin":["zheng3 dun4"],"word":"整顿"},{"definition":["plethora of things to tackle\/multitude of loose ends\/very complicated\/chaotic"],"pinyin":["qian1 tou2 wan4 xu4"],"word":"千头万绪"},{"definition":["to transfer\/to maneuver (troops etc)\/movement of personnel\/to mobilize\/to bring into play"],"pinyin":["diao4 dong4"],"word":"调动"},{"definition":["to coordinate\/to harmonize\/to fit together\/to match (colors etc)\/harmonious\/concerted"],"pinyin":["xie2 tiao2"],"word":"协调"},{"definition":["to reverse\/to turn around (an undesirable situation)\/(mechanics) torsion"],"pinyin":["niu3 zhuan3"],"word":"扭转"},{"definition":["an overall plan taking into account all factors"],"pinyin":["tong3 chou2 jian1 gu4"],"word":"统筹兼顾"},{"definition":["slight or important, urgent or non-urgent (idiom); to deal with important matters first\/sense of priority"],"pinyin":["qing1 zhong4 huan3 ji2"],"word":"轻重缓急"},{"definition":["top priority job\/matter of vital importance"],"pinyin":["dang1 wu4 zhi1 ji2"],"word":"当务之急"},{"definition":["to scheme\/to plot\/conspiracy"],"pinyin":["mou2 hua4"],"word":"谋划"},{"definition":["(of systems, facilities etc) comprehensive\/well-developed\/excellent\/to refine\/to improve"],"pinyin":["wan2 shan4"],"word":"完善"},{"definition":["to put effort into sth\/to try really hard"],"pinyin":["zhuo2 li4"],"word":"着力"}]}