{"definition":["to use for the purpose of\/to serve as"],"pinyin":["yong4 zuo4"],"traditional":["用作"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"用作","characters":[{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"},{"definition":["worker\/workshop\/(slang) troublesome\/high-maintenance (person)","to do\/to grow\/to write or compose\/to pretend\/to regard as\/to feel\/writings or works"],"pinyin":["zuo1","zuo4"],"word":"作"}],"containing_words":[],"sentences":[{"english":"Small seashells have sometimes been used as a primitive kind of money.","chinese":"小贝壳有时用作简单的钱币。"},{"english":"The potential of oils as new types of larvicides for the control of mosquitoes are explored.","chinese":"这两种油品可开发用作防治蚊虫的新型杀幼虫药剂。"},{"english":"Knell beetles have also been known to be used as mounts by Underdark races.","chinese":"已经知道丧钟甲虫会被幽暗地域的种族用作坐骑。"},{"english":"How can digitization and technologies such as OAI be used as components of this resource?","chinese":"如何将OAI等的数码化和技术用作这新资源的元素？"},{"english":"A green variety of chrysoberyl used as a gemstone.","chinese":"一种绿色的金绿宝石，用作宝石。"},{"english":"Hammer and sickle symbols of the industrial worker and the peasant are used as the emblem of the ussr .","chinese":"代表产业工人和农民的锤子镰刀图案用作前苏联国徽。"},{"english":"Hormones have long been associated with some forms of cancer.","chinese":"激素类的药物一直被用作治疗某些癌症。"},{"english":"The data will be used for specific purposes only, and all indentifiable information would be discarded after the conference.","chinese":"这些资料只用作特定的用途，并于活动完结后销毁。"},{"english":"She used the cup for a soup bowl.","chinese":"她把那个杯子用作盛汤的碗。"},{"english":"As it is mainly for goods transportation the interior seems lousy.","chinese":"而基于它主要用作运送货物，内宠就显得凌乱。"},{"english":"The database could be used as a teaching resource in colleges.","chinese":"资料库可以用作大学里的一种教学辅导手段。"},{"english":"Jesus was born in a stable and a manger was used as his bed.","chinese":"耶稣诞生在马厩内，马秣槽被用作他的床。"},{"english":"No welding ground shall be made on the coated part of the article.","chinese":"管道涂塑的地方不允许用作焊接接地。"},{"english":"It is useful, for example, as an encapsulant for semiconductor products.","chinese":"例如，它用作半导体产品的密封剂。"},{"english":"Bone whistles, used as a type of flute, have been found dating back to 5,000 BC.","chinese":"用作笛子的骨哨早已出现在公元前5，000年。"},{"english":"Nickel-cadmium batteries are used to provide emergency back-up power on planes and trains.","chinese":"镍镉电池也用作飞机和火车的应急后备电源。"}],"related":[{"definition":["use in\/use on\/use for"],"pinyin":["yong4 yu2"],"word":"用于"},{"definition":["to be used for"],"pinyin":["yong4 lai2"],"word":"用来"},{"definition":["in order to\/so as to"],"pinyin":["yong4 yi3"],"word":"用以"},{"definition":["use\/application"],"pinyin":["yong4 tu2"],"word":"用途"},{"definition":["to use\/to employ\/to apply\/to make use of"],"pinyin":["shi3 yong4"],"word":"使用"},{"definition":["in common usage"],"pinyin":["chang2 yong4"],"word":"常用"},{"definition":["special\/dedicated"],"pinyin":["zhuan1 yong4"],"word":"专用"},{"definition":["to put"],"pinyin":["fang4 zhi4"],"word":"放置"},{"definition":["to withdraw (money)\/to collect (left luggage)\/to extract\/to refine"],"pinyin":["ti2 qu3"],"word":"提取"},{"definition":["a smidgen\/a little bit\/a few"],"pinyin":["shao3 liang4"],"word":"少量"},{"definition":["to deposit\/to store\/to leave in sb's care"],"pinyin":["cun2 fang4"],"word":"存放"},{"definition":["to borrow sth for another use\/to borrow an idea for one's own use"],"pinyin":["jie4 yong4"],"word":"借用"},{"definition":["to substitute for\/to replace\/to supersede"],"pinyin":["ti4 dai4"],"word":"替代"},{"definition":["to replace\/to take the place of"],"pinyin":["dai4 ti4"],"word":"代替"},{"definition":["maybe\/perhaps\/might\/possibly\/or"],"pinyin":["huo4"],"word":"或"},{"definition":["tool\/instrument\/utensil\/means (to achieve a goal etc)"],"pinyin":["gong1 ju4"],"word":"工具"}]}