{"definition":["not need\/have no use for"],"pinyin":["yong4 bu5 zhao2"],"traditional":["用不著"],"rank":17345.0,"normalized_rank":0.24267905362864295,"fraction":0.0000031592478005459364,"cumulative_fraction":0.9675295100702944,"word":"用不着","characters":[{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"}],"containing_words":[],"sentences":[{"english":"You don't need me to explain the luck, I guess.","chinese":"关于幸运之神眷顾，我猜完全用不着解释了。"},{"english":"I can do without your advice, if you don't mind.","chinese":"要是你不介意，我用不着你的劝告。"},{"english":"There was no use asking him to give any suggestion. he would always brag that there was nothing like leather.","chinese":"用不着让他提什么建议，他总好王婆卖瓜，自卖自夸。"},{"english":"He's a wealthy guy, doesn't have to steal a Rembrandt.","chinese":"而且他又有钱，用不着偷伦勃郎的画。"},{"english":"The windows are made of glass and there is no need to use paper or linens anymore.","chinese":"窗子改成玻璃的，也用不着再糊上纸或纱。"},{"english":"Oh, you contry bumpkin! You don't need it anyway. so don't borther asking.","chinese":"嗨，你这老土，反正你也用不着，就别问了。"},{"english":"I am going home. In the country I am not afraid.","chinese":"我要回家了，在乡下我用不着害怕。"},{"english":"I did not need an operation. Instead, I did just what the doctor ordered.","chinese":"我的病用不着手术治疗，而是只需要遵从医嘱。"},{"english":"You can keep that book - I don't need it any more.","chinese":"那本书你可以留着，我用不着了。"},{"english":"The actor is bidden to undress, and wash off his powder and paint; he will be needed no more.","chinese":"演员奉命卸装，洗去粉墨胭脂，再也用不着他了。"},{"english":"The world doesn’t need another drama about adultery.","chinese":"这个世界也用不着戏剧去表演偷鸡摸狗的勾当了。"},{"english":"Don't bother to move I think I can just brush past.","chinese":"用不着让开，我想我刚好能过得去。"},{"english":"I only feel mild pain. I don't think a pain-killer is necessary.","chinese":"我只感到有稍微的疼痛，我想用不着吃止痛片。"},{"english":"At this rate, I may not buy another pair of boots.","chinese":"按照这个穿着频率，我可能根本用不着再买远足靴了。"},{"english":"The Prince of Darkness does not condescend to such cheap drudgery.","chinese":"这种下贱的差使，根本用不着劳“黑暗之王”的大驾。"},{"english":"Yeah, you probably don't need more than that.","chinese":"对哦，可能你也用不着那么多车。"}],"related":[]}