{"definition":["to be able to use\/useable\/to have a use for sth\/(in interrogative sentence) to be necessary to"],"pinyin":["yong4 de5 zhao2"],"traditional":["用得著"],"rank":31811.0,"normalized_rank":0.4450771620052327,"fraction":8.018551043525934e-7,"cumulative_fraction":0.9918183831886122,"word":"用得着","characters":[{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"},{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"}],"containing_words":[],"sentences":[{"english":"Keep your exchange vouchers as you may need to show them when you are leaving the country.","chinese":"保留水单，以防离开这个国家时还用得着。"},{"english":"Like I need to use tricks?","chinese":"我用得着耍赖吗？"},{"english":"When organizing clothing or other items on shelves, you should use shelf dividers .","chinese":"把衣服在架子上分好后，你就用得着衣架隔板了。"},{"english":"If you feel the need, give one a try.","chinese":"如果你觉得用得着就来试试吧。"},{"english":"I should be taking notes, maybe there are some I can use myself.","chinese":"我应该记笔记，或许有些我自己还能用得着。"},{"english":"For a dog, also need short swords?","chinese":"对付一条狗，也用得着拔剑吗？"},{"english":"Your children might need to use it.","chinese":"你的孩子们可能会用得着它。"},{"english":"B: We don't need it until next month.","chinese":"我们要到下个月才用得着。"},{"english":"And if you have, there are probably a few tips below you can use.","chinese":"如果你考虑过，那么以下几点建议也许你能用得着。"}],"related":[]}