{"definition":["first party (law)\/see also 乙方[yi3 fang1]"],"pinyin":["jia3 fang1"],"traditional":["甲方"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"甲方","characters":[{"definition":["first of the ten Heavenly Stems 十天干[shi2 tian1 gan1]\/(used for an unspecified person or thing)\/first (in a list, as a party to a contract etc)\/letter \"A\" or roman \"I\" in list \"A, B, C\", or \"I, II, III\" etc\/armor plating\/shell or carapace\/(of the fingers or toes) nail\/bladed leather or metal armor (old)\/ranking system used in the Imperial examinations (old)\/civil administration unit in the baojia 保甲[bao3 jia3] system (old)\/ancient Chinese compass point: 75°"],"pinyin":["jia3"],"word":"甲"},{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["fang1","Fang1"],"word":"方"}],"containing_words":[],"sentences":[{"english":"Party B shall still have the ownership of the equipment until Party B is paid in full.","chinese":"甲方未付清全款前，设备的所有权仍归乙方所有。"},{"english":"The charge of water is settled and paid to the actual usage each month.","chinese":"乙方使用的自来水费按实结算，每月支付甲方。"},{"english":"Any losses that may occur during transportations shall be for the Party A's account .","chinese":"运输过程中发生的费用由甲方承担。"},{"english":"The undermentioned project is consigned by Party A to Party B.","chinese":"本工程由甲方委托乙方总承包及施工。"},{"english":"Party B will not transfer the lease of the premises or sub without Party A's approval.","chinese":"未经甲方同意，乙方不得将承租的房屋转租或分租。"},{"english":"Part B shall guarantee that the machines to be provided are in accordance with Part A's requirements and specifications.","chinese":"乙方保证其供给的机器符合甲方的要求和规格。"},{"english":"I. The smoke-quitting product Habit-breaking Drink for Smokers provided by Party A shall be qualified products.","chinese":"甲方确保提供的君益忘烟饮戒烟产品为行货正品。"},{"english":"III Party A shall issue invoices fulfilling with requirements of Party B and other departments.","chinese":"甲方开具满足乙方及相关部门要求的发票。"},{"english":"Party A will issue a written receipt after receiving the payment.","chinese":"甲方收到租金后予书面签收。"},{"english":"Party A violates any Law or Regulation of P. R.","chinese":"甲方违反任何中华人民共和国的法律或法规。"},{"english":"The letter of credit for each order shall reach Party A45 days before the date of shipment .","chinese":"每笔定货的信用证将在装运前45天送交甲方。"},{"english":"III. Party A guarantees that they will provide complete and high quality service, to satisfy the customers.","chinese":"甲方保证为乙方提供全面优质服务，使客人达到满意。"},{"english":"Sixth, like the second party changes for some reason, the first party does not return the rent.","chinese":"如乙方因故变动，甲方不退还租金。"},{"english":"Party B causes great loss to Party A due to its breach of duty and jobbery.","chinese":"乙方严重失职，营私舞弊，给甲方利益造成重大损失。"},{"english":"Party A should pay Part C 3 months' service fee in advance.","chinese":"甲方一次向丙方支付三个月的服务费。"},{"english":"Party A Commission Party B to contract and construct this project.","chinese":"本工程由甲方委托乙方总承包及施工。"}],"related":[{"definition":["second party (law)\/see also 甲方[jia3 fang1]"],"pinyin":["yi3 fang1"],"word":"乙方"},{"definition":["to work overtime"],"pinyin":["jia1 ban1"],"word":"加班"},{"definition":["unit in charge of construction\/builder"],"pinyin":["shi1 gong1 dan1 wei4"],"word":"施工单位"},{"definition":["contractor"],"pinyin":["cheng2 bao1 ren2"],"word":"承包人"},{"definition":["our company (polite)"],"pinyin":["wo3 si1"],"word":"我司"},{"definition":["client\/customer"],"pinyin":["ke4 hu4"],"word":"客户"},{"definition":["balance (money remaining due)"],"pinyin":["wei3 kuan3"],"word":"尾款"},{"definition":["borrower\/leaser\/the hiring side of a contract"],"pinyin":["cheng2 zu1 fang1"],"word":"承租方"},{"definition":["your company (polite)"],"pinyin":["gui4 si1"],"word":"贵司"},{"definition":["chief labor contractor"],"pinyin":["bao1 gong1 tou2"],"word":"包工头"},{"definition":["(business) company\/company\/firm\/corporation\/incorporated\/CL:家[jia1]"],"pinyin":["gong1 si1"],"word":"公司"},{"definition":["parties to a contract (law)"],"pinyin":["he2 tong5 ge4 fang1"],"word":"合同各方"},{"definition":["product manager"],"pinyin":["chan3 pin3 jing1 li3"],"word":"产品经理"},{"definition":["(business) partner"],"pinyin":["he2 zuo4 fang1"],"word":"合作方"},{"definition":["developer (of real estate, a commercial product etc)"],"pinyin":["kai1 fa1 shang1"],"word":"开发商"},{"definition":["seller (in contracts)"],"pinyin":["mai4 fang1"],"word":"卖方"}]}