{"definition":["oracle script\/oracle bone inscriptions (an early form of Chinese script)"],"pinyin":["jia3 gu3 wen2"],"traditional":["甲骨文"],"rank":12563.0,"normalized_rank":0.17577266939963346,"fraction":0.000005673858400869578,"cumulative_fraction":0.9472375137180312,"word":"甲骨文","characters":[{"definition":["first of the ten Heavenly Stems 十天干[shi2 tian1 gan1]\/(used for an unspecified person or thing)\/first (in a list, as a party to a contract etc)\/letter \"A\" or roman \"I\" in list \"A, B, C\", or \"I, II, III\" etc\/armor plating\/shell or carapace\/(of the fingers or toes) nail\/bladed leather or metal armor (old)\/ranking system used in the Imperial examinations (old)\/civil administration unit in the baojia 保甲[bao3 jia3] system (old)\/ancient Chinese compass point: 75°"],"pinyin":["jia3"],"word":"甲"},{"definition":["bone"],"pinyin":["gu3"],"word":"骨"},{"definition":["language\/culture\/writing\/formal\/literary\/gentle\/(old) classifier for coins\/Kangxi radical 67","surname Wen"],"pinyin":["wen2","Wen2"],"word":"文"}],"containing_words":[{"definition":["oracle script\/oracle bone character (an early form of Chinese script)"],"pinyin":["jia3 gu3 wen2 zi4"],"word":"甲骨文字"}],"sentences":[{"english":"But these are products that Oracle sells.","chinese":"但这些都是甲骨文公司销售的产品。"},{"english":"There has been no other contact with Oracle since then.","chinese":"从那以后，我们和甲骨文再没有任何接触。"},{"english":"The original characters are Oracle, popular in the Shang period.","chinese":"最初的汉字是甲骨文，盛行于殷商时期。"},{"english":"Oracle inscriptions are pictographs.","chinese":"甲骨文是象形文字。"},{"english":"In terms of antitrust, Oracle also seems safe.","chinese":"在反托拉斯方面甲骨文似乎也是安全的。"},{"english":"He had served as chief technology officer of Oracle's client software group.","chinese":"高斯林曾担任甲骨文客户软件部的首席技术官。"},{"english":"The question is: what exactly does the cloud mean to Oracle?","chinese":"问题是，云究竟对于甲骨文公司意味着什么？"},{"english":"Outside the bronze inscription, he also involves Oracle study.","chinese":"金文之外，孙氏又涉及甲骨文研究。"},{"english":"Oracle and Microsoft were both born in difficult economic times.","chinese":"甲骨文和微软恰恰就是产生在经济低谷期。"},{"english":"Oracle should be the first to write with a brush, then use the weapon carved.","chinese":"甲骨文也应该是先用毛笔写出，然后再用利器刻出的。"},{"english":"The symbols inscribed on pottery earlier than the Shang Dynasty bear resemblance to the Shang oracles.","chinese":"夏商以前的陶纹刻符与商代的甲骨文有相似之处。"},{"english":"But HP and Oracle reaffirmed a commitment to their partnership on Monday.","chinese":"但是，周一惠普和甲骨文重申他们的伙伴关系。"},{"english":"Simplified Chinese characters from Oracle to the evolutionary history of a continuous and verifiable.","chinese":"简体字来自于连续可证明的甲骨文的进化史。"},{"english":"Han Jia, I don't think oracle-bone inscriptions are difficult to read at all.","chinese":"韩佳，我发现这甲骨文一点也不难认。"},{"english":"Oracle does not have a tradition of playing well with others.","chinese":"甲骨文并没有一个与其他公司和睦相处的传统。"},{"english":"Third, in studying common word meaning of oracle bone inscriptions.","chinese":"二是甲骨文词目的整理。"}],"related":[{"definition":["inscription in bronze\/bell-cauldron inscription"],"pinyin":["jin1 wen2"],"word":"金文"},{"definition":["oracle script\/oracle bone character (an early form of Chinese script)"],"pinyin":["jia3 gu3 wen2 zi4"],"word":"甲骨文字"},{"definition":["tortoise shell and animal bones used in divination\/oracle bone inscriptions (an early form of Chinese script)"],"pinyin":["jia3 gu3"],"word":"甲骨"},{"definition":["pictogram\/hieroglyph"],"pinyin":["xiang4 xing2 wen2 zi4"],"word":"象形文字"},{"definition":["seal script used throughout the pre-Han period"],"pinyin":["zhou4 wen2"],"word":"籀文"},{"definition":["the great seal\/used narrowly for 籀文\/used broadly for many pre-Qin scripts"],"pinyin":["da4 zhuan4"],"word":"大篆"},{"definition":["pictogram (one of the Six Methods 六書|六书 of forming Chinese characters)\/Chinese character derived from a picture\/sometimes called hieroglyph"],"pinyin":["xiang4 xing2 zi4"],"word":"象形字"},{"definition":["the small or lesser seal, the form of Chinese character standardized by the Qin dynasty"],"pinyin":["xiao3 zhuan4"],"word":"小篆"},{"definition":["to create Chinese characters\/cf Six Methods of forming Chinese characters 六書|六书[liu4 shu1]"],"pinyin":["zao4 zi4"],"word":"造字"},{"definition":["seal script as unified by the Qin dynasty\/the small seal 小篆 and great seal 大篆"],"pinyin":["Qin2 zhuan4"],"word":"秦篆"},{"definition":["cuneiform (Babylonian script)"],"pinyin":["xie1 xing2 wen2 zi4"],"word":"楔形文字"},{"definition":["Chinese character\/CL:個|个[ge4]\/Japanese: kanji\/Korean: hanja\/Vietnamese: hán tự"],"pinyin":["han4 zi4"],"word":"汉字"},{"definition":["early form of Chinese characters inscribed in stone, a precursor of the small seal 小篆[xiao3 zhuan4]"],"pinyin":["shi2 gu3 wen2"],"word":"石鼓文"},{"definition":["Microsoft corporation"],"pinyin":["Wei1 ruan3"],"word":"微软"},{"definition":["bird writing, a calligraphic style based on seal script 篆书, but with characters decorated as birds and insects"],"pinyin":["niao3 chong2 shu1"],"word":"鸟虫书"},{"definition":["Xu Shen (-147) the compiler of the original Han dynasty dictionary Shuowen Jiezi 說文解字|说文解字[Shuo1 wen2 Jie3 zi4]"],"pinyin":["Xu3 Shen4"],"word":"许慎"}]}