{"definition":["electrophoresis"],"pinyin":["dian4 yong3"],"traditional":["電泳"],"rank":47420.0,"normalized_rank":0.6634673233248919,"fraction":1.8758125051758284e-7,"cumulative_fraction":0.9985330973955914,"word":"电泳","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"电"},{"definition":["swimming\/to swim"],"pinyin":["yong3"],"word":"泳"}],"containing_words":[],"sentences":[{"english":"Electrophoretic coating process on the aluminium alloy support used for solar energy heat unit is introduced.","chinese":"介绍了太阳能热水器铝合金托架的电泳涂漆工艺。"},{"english":"Phosphated bodies should be uniformly wet or dry when they enter the phosphate bath.","chinese":"磷化过的车身必须全湿或全干状态进入电泳槽。"},{"english":"The main factors influencing precipitation of electrophoretic coatings and their solving methods are given in this article.","chinese":"介绍了影响电泳漆沉淀的主要因素和采取的对策。"},{"english":"Electrophosresis in discontinuous buffer system was applied for the presenting patterns and fractions of the pancreatic amylase isoenzymes.","chinese":"应用不连续缓冲系统薄膜电泳法行酶谱分析。"},{"english":"Results There was a significant difference between the electrophoretograms of semen vaccariae and its adulterants.","chinese":"结果王不留行及伪品的电泳图谱存在显著差异。"},{"english":"It requires substantially less electrical consumption for deposition and, as a result, less refrigeration for cooling.","chinese":"电泳本身耗电量少，从而用于冷却的冷量也少。"},{"english":"Conclusion Polyacrylamide gel electrophoresis technology can be used for seed identification of Andrographis paniculata seeds.","chinese":"结论聚丙烯酰胺凝胶电泳手艺可用于穿心莲种子剖断。"},{"english":"Gradient gel electrophoresis determine small, dense low-density lipoprotein in plasma of patients with coronary heart disease.","chinese":"梯度胶电泳法测定冠心病患者血浆小密低密度脂蛋白。"},{"english":"After transformation, no shrinkage was found in electrophoretic paint film, and the liquidity was remarkably improved.","chinese":"转换后，电泳漆膜基本没有缩孔，流平性大大改善。"},{"english":"It is revealed that in double diffusion and immunoelectrophoresis the product yielded a single precipitating line.","chinese":"以双扩及免疫电泳鉴定，均呈现单一沉淀线。"},{"english":"Objective To study different thick agarose gel how to impact the DNA electrophoresis.","chinese":"目的研究不同厚度的琼脂糖凝胶对电泳的影响。"},{"english":"As media of electrophoresis, optimum concentration of agarose was 2%.","chinese":"用于电泳介质的琼脂糖最佳浓度为2%。"},{"english":"The polypeptide patterns of the eggs of Anopheles sinensis and An. anthropophagus were compared with two-dimensional electrophoresis in polyacrylamide gel.","chinese":"用二维电泳法比较分析两种按蚊卵的蛋白质多肽图谱。"},{"english":"Fibroin obtained from degummed raw silk was studied by sodium dodecyl sulphate polyacrylamide gel electrophoresis.","chinese":"用聚丙烯酰胺凝胶电泳研究了从生丝脱胶获得的丝素。"},{"english":"The immune effect was detected by counter immunoelectrophoresis.","chinese":"用对流免疫电泳试验检测免疫效果。"},{"english":"Granulosa cell apoptosis was detected by agarose gel electrophoresis.","chinese":"用琼脂糖凝胶电泳检测两类卵的颗粒细胞凋亡。"}],"related":[{"definition":["base body\/matrix\/substrate"],"pinyin":["ji1 ti3"],"word":"基体"},{"definition":["electroplating\/electroplated"],"pinyin":["dian4 du4"],"word":"电镀"},{"definition":["vulcanization (curing rubber using sulfur and heat)"],"pinyin":["liu2 hua4"],"word":"硫化"},{"definition":["colorimetric analysis"],"pinyin":["bi3 se4 fen1 xi1"],"word":"比色分析"},{"definition":["electrolysis"],"pinyin":["dian4 jie3"],"word":"电解"},{"definition":["ion exchange"],"pinyin":["li2 zi3 jiao1 huan4"],"word":"离子交换"},{"definition":["the coating of sth that has been chrome-plated or copper-plated etc"],"pinyin":["du4 ceng2"],"word":"镀层"},{"definition":["substrate"],"pinyin":["ji1 cai2"],"word":"基材"},{"definition":["flux (metallurgy)"],"pinyin":["zhu4 han4 ji4"],"word":"助焊剂"},{"definition":["colloid"],"pinyin":["jiao1 ti3"],"word":"胶体"},{"definition":["ferric chloride FeCl3"],"pinyin":["san1 lu:4 hua4 tie3"],"word":"三氯化铁"},{"definition":["colloid\/colloidal particles"],"pinyin":["jiao1 li4"],"word":"胶粒"},{"definition":["protective layer\/coating"],"pinyin":["tu2 ceng2"],"word":"涂层"},{"definition":["injection molding"],"pinyin":["zhu4 su4"],"word":"注塑"},{"definition":["plasmid"],"pinyin":["zhi4 li4"],"word":"质粒"},{"definition":["negative pole\/cathode"],"pinyin":["fu4 ji2"],"word":"负极"}]}