{"definition":["unimpeded\/free-flowing\/straight path\/unclogged\/move without obstruction"],"pinyin":["chang4 tong1"],"traditional":["暢通"],"rank":7095.0,"normalized_rank":0.09926825514529962,"fraction":0.000014445945954256808,"cumulative_fraction":0.8979036632250897,"word":"畅通","characters":[{"definition":["free\/unimpeded\/smooth\/at ease\/free from worry\/fluent"],"pinyin":["chang4"],"word":"畅"},{"definition":["to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc","classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)"],"pinyin":["tong1","tong4"],"word":"通"}],"containing_words":[],"sentences":[{"english":"Belling out the end of the tube will permit a freer passage of air.","chinese":"把管端做成钟口状可使气流更畅通。"},{"english":"Broad boulevards are unimpeded by traffic in the new district, called Kangbashi New Area.","chinese":"宽阔的马路畅通无阻的纵横在名叫康巴什的新城。"},{"english":"The channel of communication is smooth.","chinese":"沟通的渠道也是畅通的。"},{"english":"The path to knowledge is now unbarred.","chinese":"如今求知之路畅通无阻。"},{"english":"Secondly, to strengthen inter-organizational consultations, keep the information channels.","chinese":"其次，加强组织间的协商，保持信息渠道畅通。"},{"english":"Recommit yourself to doing all of the positive things you did to keep the lines of communication open and the relationships going.","chinese":"把所有保持交流畅通，让感情继续的事情重新做一遍。"},{"english":"The ghostly particles pass through our planet totally unimpeded.","chinese":"这如同幽灵的粒子在地球上畅通无阻。"},{"english":"Keep streets clear for the passage of  emergency vehicles.","chinese":"为使救援车辆通行无阻，要保持街道畅通。"},{"english":"Verify tube patency before and after medication administration.","chinese":"给药前后应确认饲管畅通。"},{"english":"International long distance, business fax, wireless networks unimpeded.","chinese":"国际长途，商务传真，无线网络畅通无阻。"},{"english":"Our digital communication network has been engineered so that copies flow with as little friction as possible.","chinese":"我们的数字通信网络被打造成让拷贝流尽量畅通无阻。"},{"english":"Nose drops or inhalations containing drugs that contract Blood vessels help drain the sinuses.","chinese":"含有可收缩血管帮助鼻窦畅通的药物成分。"},{"english":"Launching tracks of No. 1 lifeboat clear in 10 minutes.","chinese":"一号艇放艇滑轨在10分钟内畅通。"},{"english":"They tell the few drivers winding their way through shut-down streets which roads are open.","chinese":"他们会告知司机如何绕过关闭的街道找到畅通的道路。"},{"english":"Set up the \"sun mountain\" network, open people's appeal channels.","chinese":"搭建了《阳光秀山》网络，畅通人民群众的诉求渠道。"},{"english":"Their luck held and they were able to walk freely out of the main camp and towards the store block.","chinese":"他们很幸运，畅通无阻地出了主营区，向仓库区走去。"}],"related":[{"definition":["unobstructed\/clear"],"pinyin":["tong1 chang4"],"word":"通畅"},{"definition":["smooth and unhindered\/fluent"],"pinyin":["shun4 chang4"],"word":"顺畅"},{"definition":["to unblock\/to dredge\/to clear the way\/to get things flowing\/to facilitate\/to mediate\/to lobby\/to explicate (a text)"],"pinyin":["shu1 tong1"],"word":"疏通"},{"definition":["to open access\/to establish contact\/to remove a block\/to put through (a phone connection)"],"pinyin":["da3 tong1"],"word":"打通"},{"definition":["to clog up\/blockage"],"pinyin":["du3 se4"],"word":"堵塞"},{"definition":["to go through\/to pass through\/to be in general use"],"pinyin":["tong1 xing2"],"word":"通行"},{"definition":["regular\/orderly\/successive\/in order"],"pinyin":["you3 xu4"],"word":"有序"},{"definition":["(communications) channel\/thoroughfare\/passage","Tongdao Dong autonomous county in Huaihua 懷化|怀化[Huai2 hua4], Hunan"],"pinyin":["tong1 dao4","Tong1 dao4"],"word":"通道"},{"definition":["to ensure\/to guarantee"],"pinyin":["que4 bao3"],"word":"确保"},{"definition":["convenient and fast"],"pinyin":["bian4 jie2"],"word":"便捷"},{"definition":["safe\/secure\/safety\/security"],"pinyin":["an1 quan2"],"word":"安全"},{"definition":["to be connected\/traffic\/transportation\/communications\/liaison"],"pinyin":["jiao1 tong1"],"word":"交通"},{"definition":["to connect\/to communicate\/to relate\/(math.) connected"],"pinyin":["lian2 tong1"],"word":"连通"},{"definition":["order (orderly)\/order (sequence)\/social order\/the state (of society)\/CL:個|个[ge4]"],"pinyin":["zhi4 xu4"],"word":"秩序"},{"definition":["free-flowing\/smooth"],"pinyin":["chang4 da2"],"word":"畅达"},{"definition":["to link up\/to thread together"],"pinyin":["guan4 tong1"],"word":"贯通"}]}