{"definition":["to keep\/to preserve\/extant\/to remain (from the past)"],"pinyin":["liu2 cun2"],"traditional":["留存"],"rank":16929.0,"normalized_rank":0.2368586739048312,"fraction":0.000003309750733840588,"cumulative_fraction":0.9661837329856864,"word":"留存","characters":[{"definition":["old variant of 留[liu2]","to leave (a message etc)\/to retain\/to stay\/to remain\/to keep\/to preserve","old variant of 留[liu2]"],"pinyin":["liu2","liu2","liu2"],"word":"留"},{"definition":["to exist\/to deposit\/to store\/to keep\/to survive"],"pinyin":["cun2"],"word":"存"}],"containing_words":[{"definition":["retained earnings"],"pinyin":["liu2 cun2 shou1 yi4"],"word":"留存收益"}],"sentences":[{"english":"In the case of a company higher retained earnings will result in a lower dividend paid out to shareholders.","chinese":"在如此高的公司将被调低留存收益发放股利给股东。"},{"english":"The re-inspection will only be conducted to the sampled samples the re-inspection result shall be final.","chinese":"复验只对抽取留存的样品，复验结果为最终依据。"},{"english":"Her spirit and compassion live on today.","chinese":"她的精神和悲天悯人至今仍留存于世。"},{"english":"The new booklet is also a renewed effort to preserve WMO history for future generations.","chinese":"这个新的小册子也在努力将WMO的历史留存于后世。"},{"english":"I have seen bricks amid the oak copse there.","chinese":"我还看见过橡树林中留存着的砖头。"},{"english":"They allow the male infants to live.","chinese":"他们留存了男孩的生命。"},{"english":"The re-inspection will only be conducted to the sampled samples and the re-inspection result shall be final.","chinese":"复验只对抽取留存的样品，复验结果为最终依据。"},{"english":"Shi Shahai retained the edge of many ancient streets.","chinese":"什刹海边上留存着许多古老的街道。"},{"english":"The Testing center will preservers some samples for future reference.","chinese":"检验结束后，我中心将留存部分样品备查。"},{"english":"We feel that the longer something lasts, the more value it has.","chinese":"我们感觉留存时间越长的东西，拥有的价值就越高。"},{"english":"Our retained profits will provide capital for the planned growth next year.","chinese":"我们的留存利润将为明年的扩张计划提供资金。"},{"english":"Explain out without reserve the calligraphy magic power that China spreads fame the overseas.","chinese":"把中国名扬外洋的书法魅力绝不留存地解释进去。"},{"english":"An original Ainu house has been relocated outside the museum for preservation.","chinese":"一间原始阿依努的屋子，被迁移到博物馆外面留存。"},{"english":"Who says word of Tang poetry the Song Dynasty can keep Yu Yao's distant memory?","chinese":"谁说唐诗宋词只能留存于遥远的记忆？"},{"english":"Every household should assemble a disaster supplies kit and keep it up to date.","chinese":"每个家庭都应该备有一套灾难用品装备并一直留存。"},{"english":"But very few ancient written verdicts before Tang remain so that they were neglected.","chinese":"但唐代以前的判文留存极少，以至于被人忽略。"}],"related":[{"definition":["remaining\/extant"],"pinyin":["cun2 liu2"],"word":"存留"},{"definition":["to conserve\/to preserve\/to keep\/to save (a file etc) (computing)"],"pinyin":["bao3 cun2"],"word":"保存"},{"definition":["to keep\/to retain\/to have reservations (about sth)\/to hold back (from saying sth)\/to put aside for later"],"pinyin":["bao3 liu2"],"word":"保留"},{"definition":["to hold in storage\/to retain\/to harbor (feelings)\/to entertain (sentiments)\/(of abstract things) to exist\/there is"],"pinyin":["cun2 you3"],"word":"存有"},{"definition":["to leave behind\/to hand down"],"pinyin":["yi2 liu2"],"word":"遗留"},{"definition":["to remain in existence\/to retain"],"pinyin":["liu2 you3"],"word":"留有"},{"definition":["to receive for storage\/delivery of goods\/to gather and store\/to store safely\/safe keeping"],"pinyin":["shou1 cun2"],"word":"收存"},{"definition":["to survive (a serious accident)\/survival"],"pinyin":["cun2 huo2"],"word":"存活"},{"definition":["remainder\/fractional part (after the decimal point)\/unfinished"],"pinyin":["yu2 liu2"],"word":"余留"},{"definition":["to sequester\/to seal up (for safe keeping)\/to freeze (an account)\/to mothball"],"pinyin":["feng1 cun2"],"word":"封存"},{"definition":["material object\/concrete object\/original object\/in kind\/object for practical use\/definite thing\/reality\/matter (physics)"],"pinyin":["shi2 wu4"],"word":"实物"},{"definition":["to deposit\/to store\/to leave in sb's care"],"pinyin":["cun2 fang4"],"word":"存放"},{"definition":["to record\/record (written account)\/note-taker\/record (in sports etc)\/CL:個|个[ge4]"],"pinyin":["ji4 lu4"],"word":"记录"},{"definition":["to settle\/to precipitate (solid sediment out of a solution)"],"pinyin":["chen2 dian4"],"word":"沉淀"},{"definition":["to lose\/lost"],"pinyin":["yi2 shi1"],"word":"遗失"},{"definition":["intact\/in good condition"],"pinyin":["wan2 hao3"],"word":"完好"}]}