{"definition":["to leave in place\/to set aside (for further use)\/to retain\/to detain\/(medicine) indwelling"],"pinyin":["liu2 zhi4"],"traditional":["留置"],"rank":29110.0,"normalized_rank":0.4072866676926952,"fraction":0.0000010192157907500104,"cumulative_fraction":0.989370749313156,"word":"留置","characters":[{"definition":["old variant of 留[liu2]","to leave (a message etc)\/to retain\/to stay\/to remain\/to keep\/to preserve","old variant of 留[liu2]"],"pinyin":["liu2","liu2","liu2"],"word":"留"},{"definition":["to install\/to place\/to put\/to buy"],"pinyin":["zhi4"],"word":"置"}],"containing_words":[],"sentences":[{"english":"Objective To discuss close venous indwelling needle used in the treatment of respiratory diseases.","chinese":"目的探讨密闭式静脉留置针在呼吸内科患者的应用。"},{"english":"But, leaving buy interrogate and arrest to be passed on property is different.","chinese":"但是，留置盘问与拘传在性质上是不同的。"},{"english":"Objective To discuss application of pulse type tube in vein infusion.","chinese":"目的探讨脉冲式封管在静脉留置针输液中的应用。"},{"english":"The prisoners were left to rot in prison.","chinese":"那些囚犯被留置在牢中任其消瘦。"},{"english":"Objective To study the effect of Y integrated catheter in patients with pregnancy hypertension syndrome.","chinese":"目的观察Y型静脉留置针在妊高症患者中的应用效果。"},{"english":"The IV also allows for easier administration of Pitocin should labor need to be augmented.","chinese":"留置针还使得在临盆中需要增加催产素时便于管理。"},{"english":"You’ll definitely get an IV if an epidural is on the agenda.","chinese":"假如你选择了硬膜外麻醉的话，绝对会用到留置针。"},{"english":"Objective To study the effective remain length of nose and gastric tuber during small volume gastric lavage.","chinese":"目的探讨小儿小容量洗胃时鼻胃管留置的有效长度。"},{"english":"But there is no agreement about the nature of possessory lien on vessel.","chinese":"而船舶留置权的性质在不同国家之间也没有得到统一。"},{"english":"Cystitis and urethritis are complications of prolonged use of indwelling catheters.","chinese":"膀胱炎和尿道炎是长期应用留置导尿管的并发症。"},{"english":"Objective To explore the measures for improving the success rate of indwelling needle.","chinese":"目的提高静脉留置针穿刺困难者的一次穿刺成功率。"},{"english":"Venousindwelling needle hasbeen widely used clinically and improper application can result in phlebitis .","chinese":"静脉留置针已广泛用于临床，使用不当可引起静脉炎。"},{"english":"A lien against the property is granted to secure an obligation","chinese":"准予对财产拥有留置权以保证义务之履行。"},{"english":"This article discusses one clause in the Gencon C\/P form which might appropriately be entitled \"lien clause\".","chinese":"主要讨论金康租约及其他主要租约中的留置权条款。"},{"english":"Send mail to poster when their posting is held for approval?","chinese":"当投书遭留置移送裁决时是否要通知寄信人？"},{"english":"To adopt suggestion way in her mind to induce micturition .","chinese":"未成功者采用开塞露纳肛方法及行留置导尿术。"}],"related":[{"definition":["to detain\/to take into custody\/detention\/imprisonment"],"pinyin":["ji1 ya1"],"word":"羁押"},{"definition":["residential surveillance, a form of noncustodial house arrest"],"pinyin":["jian1 shi4 ju1 zhu4"],"word":"监视居住"},{"definition":["judicial authorities"],"pinyin":["si1 fa3 ji1 guan1"],"word":"司法机关"},{"definition":["to transfer (a case, a person, files etc)"],"pinyin":["yi2 song4"],"word":"移送"},{"definition":["criminal procedure"],"pinyin":["xing2 shi4 su4 song4 fa3"],"word":"刑事诉讼法"},{"definition":["to transfer\/to hand over"],"pinyin":["yi2 jiao1"],"word":"移交"},{"definition":["to register (to an official organism)\/to file a case (for investigation)"],"pinyin":["li4 an4"],"word":"立案"},{"definition":["to exercise (a right etc)"],"pinyin":["xing2 shi3"],"word":"行使"},{"definition":["aforestated\/stated above\/the preceding statement"],"pinyin":["qian2 shu4"],"word":"前述"},{"definition":["criminal procedure\/abbr. for 刑事訴訟法|刑事诉讼法"],"pinyin":["xing2 su4 fa3"],"word":"刑诉法"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"审查"},{"definition":["constitutionality"],"pinyin":["he2 xian4 xing4"],"word":"合宪性"},{"definition":["ordinary provision (law)"],"pinyin":["yi1 ban1 gui1 ding4"],"word":"一般规定"},{"definition":["to interrogate\/to ask about"],"pinyin":["xun4 wen4"],"word":"讯问"},{"definition":["to sequester\/to seize (assets)\/to seal up\/to close down"],"pinyin":["cha2 feng1"],"word":"查封"},{"definition":["to detain\/to hold in custody\/to distrain\/to seize property"],"pinyin":["kou4 ya1"],"word":"扣押"}]}