{"definition":["to unblock\/to dredge\/to clear the way\/to get things flowing\/to facilitate\/to mediate\/to lobby\/to explicate (a text)"],"pinyin":["shu1 tong1"],"traditional":["疏通"],"rank":15390.0,"normalized_rank":0.21532606718621014,"fraction":0.000003962854636420873,"cumulative_fraction":0.9606139777995264,"word":"疏通","characters":[{"definition":["surname Shu","variant of 疏[shu1]","to dredge\/to clear away obstruction\/thin\/sparse\/scanty\/distant (relation)\/not close\/to neglect\/negligent\/to present a memorial to the Emperor\/commentary\/annotation"],"pinyin":["Shu1","shu1","shu1"],"word":"疏"},{"definition":["to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc","classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)"],"pinyin":["tong1","tong4"],"word":"通"}],"containing_words":[{"definition":["facilitation payment\/bribe"],"pinyin":["shu1 tong1 fei4"],"word":"疏通费"}],"sentences":[{"english":"As sick patients were hospitalized, the treatment given, usually a nebulizer that could open up clogged lung passages, actually disseminated the virus further.","chinese":"在病人入院后，通常会给以雾化治疗来疏通肺部阻塞。"},{"english":"The patients with poor blood supply were pretreated with drugs to enlarge blood vessels and improve microcirculation.","chinese":"血供差者适当给予扩血管及疏通微循环药。"},{"english":"The wisdom of water makes rivers flow.","chinese":"水的智慧能疏通江河，可以自成盈满。"},{"english":"The dispute was settled by mediation.","chinese":"这场争端通过疏通而得到解决。"},{"english":"The workers are unblocking the sewer to prevent the leakage of dirty water.","chinese":"工人们正在疏通下水管道，防止脏水外泄。"},{"english":"The blackmailer will have to be bought off, or he'll ruin your good name.","chinese":"得花些钱疏通那个敲诈者，否则他会毁坏你的声誉。"},{"english":"The words by the right to the role transformation from the language appropriate to the occasion, dredge relational.","chinese":"话语由权利向词令，疏通关系的角色转变。"},{"english":"The call for the rate cut came despite the efforts by the Fed to unclog the financial system.","chinese":"尽管美联储努力疏通金融体系，但降息呼声日高。"},{"english":"This is the ventilation shaft through which air leaves a mine.","chinese":"这是煤矿上用来疏通空气的通风井。"},{"english":"Movement- rhythm and dance like anyoneifest of freedom.","chinese":"疏通，韵律和舞蹈，有自在表达的特征。"},{"english":"Where does Heze dredge a sewer going round to look for?","chinese":"菏泽疏通下水道到哪里去找？"},{"english":"The movement to stop this \"dirty oil\" has gathered momentum.","chinese":"阻碍临蓐这种“脏油”的疏通已经造成势头。"},{"english":"They say the port also needs to be dredged so larger ships can get closer for loading and unloading.","chinese":"此外，为了让大型船只停靠还得挖掘疏通这个港口。"},{"english":"Moving blood is used for places of stagnation or stasis of blood and used in menstrual problems.","chinese":"血液凝滞和月经问题时需要血液疏通。"},{"english":"Analyzing and disentangling this way is the focus of my article.","chinese":"分析并疏通这条道路，就是本文的工作。"},{"english":"You need to workout.","chinese":"你必要去疏通陶冶一下。"}],"related":[{"definition":["unobstructed\/clear"],"pinyin":["tong1 chang4"],"word":"通畅"},{"definition":["choked with silt\/silted up"],"pinyin":["yu1 se4"],"word":"淤塞"},{"definition":["to clog up\/blockage"],"pinyin":["du3 se4"],"word":"堵塞"},{"definition":["unimpeded\/free-flowing\/straight path\/unclogged\/move without obstruction"],"pinyin":["chang4 tong1"],"word":"畅通"},{"definition":["to silt up\/silt\/sediment\/ooze\/slurry"],"pinyin":["yu1 ji1"],"word":"淤积"},{"definition":["to clarify (disparate material into a coherent narrative)\/to marshal an argument"],"pinyin":["shu1 li3"],"word":"疏理"},{"definition":["to dredge\/to open up a path for\/to remove obstructions\/to clear the way\/to enlighten\/persuasion"],"pinyin":["shu1 dao3"],"word":"疏导"},{"definition":["energy channels\/meridian (TCM)\/(dialect) trick\/tactic"],"pinyin":["jing1 luo4"],"word":"经络"},{"definition":["to straighten out\/to sort out\/to organize"],"pinyin":["li3 shun4"],"word":"理顺"},{"definition":["to block\/to clog"],"pinyin":["zu3 se4"],"word":"阻塞"},{"definition":["to open access\/to establish contact\/to remove a block\/to put through (a phone connection)"],"pinyin":["da3 tong1"],"word":"打通"},{"definition":["to clear away\/to eliminate\/to get rid of"],"pinyin":["qing1 chu2"],"word":"清除"},{"definition":["silted up\/obstructed by silt\/variant of 瘀滯|瘀滞[yu1 zhi4]"],"pinyin":["yu1 zhi4"],"word":"淤滞"},{"definition":["to nurse one's health\/to recuperate\/to take care of\/to look after\/to discipline\/to educate\/to train\/to prepare food\/(dialect) to make fun of\/(medicine) to opsonize"],"pinyin":["tiao2 li3"],"word":"调理"},{"definition":["ventilation\/aeration\/to keep each other informed\/to release information"],"pinyin":["tong1 qi4"],"word":"通气"},{"definition":["to mend"],"pinyin":["xiu1 bu3"],"word":"修补"}]}