{"definition":["to go on stage\/fig. to appear on the scene\/used in advertising to mean new product"],"pinyin":["deng1 chang3"],"traditional":["登場"],"rank":6321.0,"normalized_rank":0.08843899094763058,"fraction":0.0000171532470220382,"cumulative_fraction":0.8857165352170037,"word":"登场","characters":[{"definition":["to scale (a height)\/to ascend\/to mount\/to publish or record\/to enter (e.g. in a register)\/to press down with the foot\/to step or tread on\/to put on (shoes or trousers) (dialect)\/to be gathered and taken to the threshing ground (old)"],"pinyin":["deng1"],"word":"登"},{"definition":["threshing floor\/classifier for events and happenings: spell, episode, bout","large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","variant of 場|场[chang2]","variant of 場|场[chang3]"],"pinyin":["chang2","chang3","chang2","chang3"],"word":"场"}],"containing_words":[{"definition":["to make up and go on stage (idiom); to embark on a career (esp. in politics or crime)"],"pinyin":["fen3 mo4 deng1 chang3"],"word":"粉墨登场"}],"sentences":[{"english":"Outside-left. Made United debut at 17.","chinese":"左外锋，17岁就为曼联初次登场。"},{"english":"It could be a few months before they are ready for prime time.","chinese":"距离它们准备好登场可能还有几个月的时间。"},{"english":"The Yngling will make its Olympic debut in 2004.","chinese":"英灵级作为奥运会项目将在2004年首次登场。"},{"english":"My debut in the sixth-grade class production was a failure.","chinese":"我在六年级的初次登场就以失败告终。"},{"english":"If there’s a new Avatar, that means Aang has passed on.","chinese":"既然新神通登场，那就意味着安昂已经过世。"},{"english":"Liu Chuang and Liang Wenbo are making their debut in Sheffield this year, in fact.","chinese":"事实上，今年是刘闯和梁文博在谢菲尔德的首次登场。"},{"english":"The dancing was a bit straggly in the \" London \" routine .","chinese":"伦敦的例行表演中登场的那些舞者简直就是群丑跳梁。"},{"english":"Clarion is blowing, it's time for your monodrama.","chinese":"号角吹响，独角戏登场。"},{"english":"Does that spell the end of a distinctive gay culture?","chinese":"这是否意味着卓尔不同的同志文化要粉墨登场呢。"},{"english":"Over the past years, the \"problem foods\" appeared one after another.","chinese":"这几年，问题食品像走马灯似的，你方唱罢我登场。"},{"english":"The relationship between the characters in Rasyoumonn is analyzed .","chinese":"从四个方面分析了《罗生门》中登场人物的相互关系。"},{"english":"And, white first, grow incarnadined, because.","chinese":"先是苍白，而后粉墨登场。"},{"english":"West Lake took hold of the hands of the blue sea. Monkey Lele staged a shinning debut in Cannes, France.","chinese":"西子湖牵手蔚蓝海岸，美猴乐乐闪亮登场法国戛纳。"},{"english":"Debut as a director through your MV \"Bamboo Forest\" how was that happen?","chinese":"在“竹林深处”中第一次做为导演登场，感觉如何？"},{"english":"Wherever life first flickered into being, it may have moved rapidly to occupy a wide range of environments.","chinese":"无论生命在哪里闪亮登场，都会迅即占据大片环境。"},{"english":"Larger gatherings followed Woodstock.","chinese":"继伍德斯托克音乐节之后，多个大型集会登场。"}],"related":[{"definition":["(of a performer) to come onto the stage to perform\/(of an athlete) to enter the arena to compete\/(fig.) to enter the scene (e.g. a new product)\/(of an examinee etc) to leave the venue"],"pinyin":["chu1 chang3"],"word":"出场"},{"definition":["on stage\/to go on stage\/to take the field"],"pinyin":["shang4 chang3"],"word":"上场"},{"definition":["to begin\/to open\/to start\/beginning of an event"],"pinyin":["kai1 chang3"],"word":"开场"},{"definition":["everyone present\/the whole audience\/across-the-board\/unanimously\/whole duration (of a competition or match)"],"pinyin":["quan2 chang3"],"word":"全场"},{"definition":["debut"],"pinyin":["shou3 xiu4"],"word":"首秀"},{"definition":["first issue\/first public showing"],"pinyin":["shou3 fa1"],"word":"首发"},{"definition":["to replace (a damaged component with a new one, an injured player with a substitute player, full-time workers with casual workers etc)\/a substitute\/a replacement"],"pinyin":["ti4 bu3"],"word":"替补"},{"definition":["to compete\/to take part (in a sports event)"],"pinyin":["chu1 sai4"],"word":"出赛"},{"definition":["to return to\/to retreat\/regression (statistics)"],"pinyin":["hui2 gui1"],"word":"回归"},{"definition":["to go into battle"],"pinyin":["shang4 zhen4"],"word":"上阵"},{"definition":["to come back out of retirement\/to get involved again after having withdrawn"],"pinyin":["fu4 chu1"],"word":"复出"},{"definition":["competition (sports etc)\/match\/CL:場|场[chang3],次[ci4]\/to compete"],"pinyin":["bi3 sai4"],"word":"比赛"},{"definition":["leading role\/lead"],"pinyin":["zhu3 jue2"],"word":"主角"},{"definition":["to leave a place where some event is taking place\/(of an actor) to exit\/(sports) to leave the field\/(of an audience) to leave"],"pinyin":["tui4 chang3"],"word":"退场"},{"definition":["to do battle (with sb)"],"pinyin":["dui4 zhan4"],"word":"对战"},{"definition":["to arrest\/to capture\/to seize\/to win (a set, a game etc)"],"pinyin":["na2 xia4"],"word":"拿下"}]}