{"definition":["to log out (computer)\/to publish\/to be published\/to appear (in a newspaper etc)"],"pinyin":["deng1 chu1"],"traditional":["登出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"登出","characters":[{"definition":["to scale (a height)\/to ascend\/to mount\/to publish or record\/to enter (e.g. in a register)\/to press down with the foot\/to step or tread on\/to put on (shoes or trousers) (dialect)\/to be gathered and taken to the threshing ground (old)"],"pinyin":["deng1"],"word":"登"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[{"definition":["to publish\/to appear (in print)"],"pinyin":["deng1 chu1 lai2"],"word":"登出来"}],"sentences":[{"english":"The session ends when you log out.","chinese":"当您登出时会话结束。"},{"english":"Yes. I want to apply for a job you posted on the Internet yesterday.","chinese":"我想申请你们昨天在网上登出来的职位。"},{"english":"Requests for information flooded in after the advertisement.","chinese":"广告登出之后，询问详情的信件大量涌到。"},{"english":"Being with Beckham is a guaranteed good-news story.","chinese":"和贝克汉姆在一起登出来保证是受欢迎的故事。"},{"english":"A few months later came a report on healthy women.","chinese":"几个月后，登出了一份关于健康妇女的报道。"},{"english":"Girls also had a fondness for including photos from childhood.","chinese":"女生们还爱把小时候的照片也登出来。"},{"english":"The research will appear October 20 in The Astrophysical Journal.","chinese":"该研究将在十月20号的天体物理学报上登出。"},{"english":"61—He wants it in for July, Mr Bloom said.","chinese":"“他希望七月里登出来，”布卢姆先生说。"},{"english":"Newspapers ran articles on Mr.Murong's role in alerting the police to the fraud ring.","chinese":"报纸上登出了关于慕容在通知警方抓获骗子的形象。"},{"english":"All of the following scripting commands will work in that context until the user logs out.","chinese":"所有的下述脚本命令将会运行直至用户登出。"},{"english":"The affair will come out in the newspapers.","chinese":"这件事会在报上登出来。"},{"english":"User Profile, Photo Upload, Change Password, Log-Out.","chinese":"用户个人资料，照片上传，更改密码，登出。"},{"english":"A week later, her complete report was printed in the newspaper, inclu.","chinese":"一周以后，她这篇完整的报道在报上登出来了，点。"},{"english":"She does this ahead of publication. That is a strategy.","chinese":"书出版之前她就要登出来，这是策略。"},{"english":"Likewise, automatic logouts do not terminate the entry mode in the case of variables.","chinese":"类似地，对于变量自动登出不会中止输入模式。"},{"english":"The news has been published in the newspaper.","chinese":"消息已在报上登出来了。"}],"related":[{"definition":["to carry a story\/to publish (in a newspaper or magazine)"],"pinyin":["kan1 deng1"],"word":"刊登"},{"definition":["to appear in the news\/in the papers"],"pinyin":["jian4 bao4"],"word":"见报"},{"definition":["newspapers"],"pinyin":["bao4 zhang1"],"word":"报章"},{"definition":["(newspaper's) front page"],"pinyin":["tou2 ban3"],"word":"头版"},{"definition":["Dagong Bao, popular newspaper name\/Ta Kung Pao, newspaper founded 1902 in Beijing, now published in Hong Kong"],"pinyin":["Da4 gong1 Bao4"],"word":"大公报"},{"definition":["to publish"],"pinyin":["kan1 zai3"],"word":"刊载"},{"definition":["newspaper\/newsprint\/CL:份[fen4],期[qi1],張|张[zhang1]"],"pinyin":["bao4 zhi3"],"word":"报纸"},{"definition":["to publish in the newspapers"],"pinyin":["deng1 bao4"],"word":"登报"},{"definition":["to publish (in newspapers or magazines)\/to record (bookkeeping entries)"],"pinyin":["deng1 zai3"],"word":"登载"},{"definition":["to report (in the media)\/(news) report"],"pinyin":["bao4 dao3"],"word":"报导"},{"definition":["weekly publication\/weekly"],"pinyin":["zhou1 kan1"],"word":"周刊"},{"definition":["announcement (written, on billboard, letter, newspaper or website)\/to post information\/a notice"],"pinyin":["qi3 shi4"],"word":"启事"},{"definition":["to advertise"],"pinyin":["deng1 guang3 gao4"],"word":"登广告"},{"definition":["page of a publication (e.g. newspaper or website)\/printing space (reserved for some content)\/page layout"],"pinyin":["ban3 mian4"],"word":"版面"},{"definition":["top news story"],"pinyin":["tou2 tiao2 xin1 wen2"],"word":"头条新闻"},{"definition":["website\/network station\/node"],"pinyin":["wang3 zhan4"],"word":"网站"}]}