{"definition":["Baishan prefecture-level city in Jilin province 吉林省 in northeast China"],"pinyin":["Bai2 shan1"],"traditional":["白山"],"rank":35208.0,"normalized_rank":0.4926055993172247,"fraction":5.93982963701202e-7,"cumulative_fraction":0.9941733643344084,"word":"白山","characters":[{"definition":["surname Bai","white\/snowy\/pure\/bright\/empty\/blank\/plain\/clear\/to make clear\/in vain\/gratuitous\/free of charge\/reactionary\/anti-communist\/funeral\/to stare coldly\/to write wrong character\/to state\/to explain\/vernacular\/spoken lines in opera"],"pinyin":["Bai2","bai2"],"word":"白"},{"definition":["surname Shan","mountain\/hill\/anything that resembles a mountain\/CL:座[zuo4]\/bundled straw in which silkworms spin cocoons\/gable"],"pinyin":["Shan1","shan1"],"word":"山"}],"containing_words":[{"definition":["Changbai or Baekdu mountains 白頭山|白头山, volcanic mountain range between Jilin province and North Korea, prominent in Manchu and Korean mythology"],"pinyin":["Chang2 bai2 shan1"],"word":"长白山"},{"definition":["Baishan prefecture-level city in Jilin province 吉林省 in northeast China"],"pinyin":["Bai2 shan1 shi4"],"word":"白山市"},{"definition":["Mt Taibai in Shaanxi"],"pinyin":["Tai4 bai2 Shan1"],"word":"太白山"},{"definition":["Sufi sect of Islam in central Asia"],"pinyin":["Bai2 shan1 zong1"],"word":"白山宗"},{"definition":["Sufi sect of Islam in central Asia"],"pinyin":["Bai2 shan1 pai4"],"word":"白山派"},{"definition":["Changbaishan Tianchi, volcanic crater lake on the border between China and North Korea"],"pinyin":["Chang2 bai2 shan1 Tian1 chi2"],"word":"长白山天池"}],"sentences":[{"english":"Florogeography of vascular plants in alpine tundra of the Changbai Mountain.","chinese":"长白山高山冻原维管植物区系地理。"},{"english":"It is a region inhabited by an overwhelming majority of the Korean minority nationality in China.","chinese":"长白山区，是我国朝鲜族同胞的主要聚居地。"},{"english":"There are abundant wild aromatic plant resources in Changbai Mountains, where the climate is temperate.","chinese":"长白山区属温带气候，野生芳香植物资源十分丰富。"},{"english":"Wang(Papaveraceae) is a valuable drug in Changbai Mountains.","chinese":"的干燥块茎，是长白山区珍贵药用植物之一。"},{"english":"There is abundant wild pestkilling plant resources in Changbai Mountains, where the climate is temperate.","chinese":"长白山区属温带气候，野生杀虫植物资源十分丰富。"},{"english":"The Changbai Mountain looks like a the chaotic world in prehistoric times, has a kind of mystical color.","chinese":"长白山像个混沌初开的世界，有一种神秘色彩。"},{"english":"The ancient glacial remains in Taibaishan was glacial relief area, which was remained very well in the East of China.","chinese":"太白山是我国东部古冰川地貌保存较好的山地。"},{"english":"Vegetation characteristics and functional division of Tricholoma matsutake habitat in Mt.","chinese":"研究了长白山松茸发生地的植被特征及功能分区。"},{"english":"Changchun and its majestic surroundings will put tourists on top of the world.","chinese":"长白山及其宏伟的周边将会使游客欣喜若狂。"},{"english":"The grape is a pure natural, pollution-free specialty precious Changbai Mountains.","chinese":"所用葡萄是纯天然，无污染的长白山脉珍贵特产。"},{"english":"It is said that people can see some marathons in ChangbaiMountains every year.","chinese":"据说人们每年在常白山能看到一些马拉松赛。"},{"english":"The incident took place outside a shopping mall in Baishan City.","chinese":"这个事情发生在白山市的一家购物中心外。"},{"english":"Electricity & Water Authority baishan hydroelectric power plant steel structure anti-corrosion.","chinese":"水电部白山水力发电厂钢结构防腐。"},{"english":"The climate of Changbaishan is Alpine Climate of monsoon types in the temperate zonal continent.","chinese":"长白山是温带大陆季风型高山气候。"},{"english":"This article discussed the distribution of major and trace elements of peat in Yuanchi, Changbai Mountain.","chinese":"探讨了长白山圆池泥炭常量和微量元素的分布规律。"},{"english":"The area covered by Changbai Mountains has a temperate climate and is rich in officinal plants.","chinese":"长白山区属温带气候，野生药用植物资源十分丰富。"}],"related":[{"definition":["Tonghua prefecture level city in Jilin province 吉林省 in northeast China\/also Tonghua county"],"pinyin":["Tong1 hua4"],"word":"通化"},{"definition":["Qingyuan county in Fushun 撫順|抚顺, Liaoning"],"pinyin":["Qing1 yuan2"],"word":"清原"},{"definition":["Fusong county in Baishan 白山, Jilin"],"pinyin":["Fu3 song1"],"word":"抚松"},{"definition":["Heihe prefecture-level city in Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Hei1 he2"],"word":"黑河"},{"definition":["Changbai Korean autonomous county in Baishan 白山, Jilin"],"pinyin":["Chang2 bai2"],"word":"长白"},{"definition":["Hulin county level city in Jixi 雞西|鸡西[Ji1 xi1], Heilongjiang"],"pinyin":["Hu3 lin2"],"word":"虎林"},{"definition":["Liaoyuan prefecture-level city in Jilin province 吉林省 in northeast China"],"pinyin":["Liao2 yuan2"],"word":"辽源"},{"definition":["Haicheng county level city in Anshan 鞍山[An1 shan1], Liaoning"],"pinyin":["Hai3 cheng2"],"word":"海城"},{"definition":["Muling county level city in Mudanjiang 牡丹江, Heilongjiang"],"pinyin":["Mu4 ling2"],"word":"穆棱"},{"definition":["Bayan county in Harbin 哈爾濱|哈尔滨[Ha1 er3 bin1], Heilongjiang"],"pinyin":["Ba1 yan4"],"word":"巴彦"},{"definition":["Liuhe county in Tonghua 通化, Jilin"],"pinyin":["Liu3 he2"],"word":"柳河"},{"definition":["Hegang prefecture-level city in Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["He4 gang3"],"word":"鹤岗"},{"definition":["Baicheng prefecture-level city in Jilin province 吉林省 in northeast China"],"pinyin":["Bai2 cheng2"],"word":"白城"},{"definition":["Jiaohe county level city in Jilin prefecture 吉林, Jilin province"],"pinyin":["Jiao1 he2"],"word":"蛟河"},{"definition":["Dandong prefecture-level city in Liaoning province 遼寧省|辽宁省 in northeast China"],"pinyin":["Dan1 dong1"],"word":"丹东"},{"definition":["Kuandian Manchu autonomous county in Liaoning\/abbr. for 寬甸滿族自治縣|宽甸满族自治县"],"pinyin":["Kuan1 dian4"],"word":"宽甸"}]}