{"definition":["the rhizome of large-headed atractylodes (Atractylodes macrocephaia)"],"pinyin":["bai2 zhu2"],"traditional":["白朮"],"rank":48456.0,"normalized_rank":0.6779623074447694,"fraction":1.6933404715984132e-7,"cumulative_fraction":0.9987180910466964,"word":"白术","characters":[{"definition":["surname Bai","white\/snowy\/pure\/bright\/empty\/blank\/plain\/clear\/to make clear\/in vain\/gratuitous\/free of charge\/reactionary\/anti-communist\/funeral\/to stare coldly\/to write wrong character\/to state\/to explain\/vernacular\/spoken lines in opera"],"pinyin":["Bai2","bai2"],"word":"白"},{"definition":["various genera of flowers of Asteracea family (daisies and chrysanthemums), including Atractylis lancea","method\/technique"],"pinyin":["zhu2","shu4"],"word":"术"}],"containing_words":[],"sentences":[{"english":"Objective To investigate the extraction process of polysaccharide from Atractylodes Poria soup.","chinese":"目的研究白术茯苓汤总多糖的提取工艺。"},{"english":"Results Rhizoma atractylodis macrocephalae and Fructus Aurantii were identified by the TLC.","chinese":"结果薄层色谱法可以鉴别出白术和枳壳。"},{"english":"OBJECTIVE To investigate the content of heavy metals in Actractylodes Macrocephala Koidz. (AMK).","chinese":"目的考察白术药材的重金属含量情况。"},{"english":"Location of efferent neurons of caecum in fowl;","chinese":"探讨白术对鸡离体空肠和盲肠运动张力的影响。"},{"english":"The effect of Atractylodes liposoluble components on small intestine movement function of mice was investigated, and its possible mechanism was explored.","chinese":"考察白术脂溶性成分对小鼠胃肠功能的影响。"},{"english":"Conclusion The water-soluble extract of Baizhu is of low toxicity.","chinese":"结论白术水提物属于一种低毒性物质。"},{"english":"The research aimed to discuss the effect of atractylodes macrocephala on the tension of isolated jejunum and caecum of chook.","chinese":"探讨白术对鸡离体空肠和盲肠运动张力的影响。"}],"related":[{"definition":["root of herbaceous peony (Paeonia lactiflora), used in TCM"],"pinyin":["bai2 shao2"],"word":"白芍"},{"definition":["black atractylodes rhizome (dried rhizome of any of several atractylodes species) (TCM)"],"pinyin":["cang1 zhu2"],"word":"苍术"},{"definition":["Wolfiporia extensa (a wood-decay fungus)\/fu ling\/tuckahoe"],"pinyin":["fu2 ling2"],"word":"茯苓"},{"definition":["huangqi\/milk vetch root (used in TCM)\/Astragalus membranaceus or Astragalus mongholicus"],"pinyin":["huang2 qi2"],"word":"黄芪"},{"definition":["red nut sedge (Cyperus rotundus)"],"pinyin":["xiang1 fu4"],"word":"香附"},{"definition":["chuanxiong rhizome"],"pinyin":["chuan1 xiong1"],"word":"川芎"},{"definition":["dried fruit of immature citron or trifoliate orange (used in TCM)"],"pinyin":["zhi3 shi2"],"word":"枳实"},{"definition":["common water plantain (Alisma plantago-aquatica)\/water plantain rhizome (used in TCM)"],"pinyin":["ze2 xie4"],"word":"泽泻"},{"definition":["root bark of the peony tree (used in TCM)"],"pinyin":["mu3 dan5 pi2"],"word":"牡丹皮"},{"definition":["Angelica sinensis"],"pinyin":["dang1 gui1"],"word":"当归"},{"definition":["Salvia miltiorrhiza"],"pinyin":["dan1 shen1"],"word":"丹参"},{"definition":["bitter orange (Fructus aurantii) (used in TCM)"],"pinyin":["zhi3 qiao4"],"word":"枳壳"},{"definition":["licorice root"],"pinyin":["gan1 cao3"],"word":"甘草"},{"definition":["dried ginger"],"pinyin":["gan1 jiang1"],"word":"干姜"},{"definition":["Chinese thorowax (Bupleurum chinense)\/root of Chinese thorowax (used in TCM)"],"pinyin":["chai2 hu2"],"word":"柴胡"},{"definition":["poria mushroom (Polyporus umbellatus)"],"pinyin":["zhu1 ling2"],"word":"猪苓"}]}