{"definition":["to plot\/to scheme\/to calculate"],"pinyin":["pan2 suan4"],"traditional":["盤算"],"rank":18992.0,"normalized_rank":0.265722720467869,"fraction":0.000002656062920752856,"cumulative_fraction":0.9722942260881065,"word":"盘算","characters":[{"definition":["plate\/dish\/tray\/board\/hard drive (computing)\/to build\/to coil\/to check\/to examine\/to transfer (property)\/to make over\/classifier for food: dish, helping\/to coil\/classifier for coils of wire\/classifier for games of chess"],"pinyin":["pan2"],"word":"盘"},{"definition":["to regard as\/to figure\/to calculate\/to compute"],"pinyin":["suan4"],"word":"算"}],"containing_words":[],"sentences":[{"english":"After a child's violent death, the calculations are murkier.","chinese":"在一个孩子横死之后，内心的盘算会变得更加阴晦。"},{"english":"I'm still debating with myself whether to let you go abroad alone.","chinese":"我仍在心中盘算是否让你独自出国。"},{"english":"I’ve been trying to figure out when we should have the New Year’s party.","chinese":"我正在盘算着哪天开一个新年聚会。"},{"english":"I totaled my expenses with a calculator.","chinese":"我用盘算器算出开支的总金额。"},{"english":"We hope that the next negotiation will be the last one before signing the contrhvact.","chinese":"我们盘算下一交谈判将是缔结合同前的最后一轮谈判。"},{"english":"I like to have an extra large green skirt.","chinese":"我盘算购件特大号的绿裙子。"},{"english":"I asked myself how long doing this documentary could take.","chinese":"我盘算着拍这部纪录片得花多长时间。"},{"english":"I was just toying wit the idea of marrying my daughter off with him.","chinese":"我心里正盘算着把我女儿嫁给他呢。"},{"english":"But this may not be what Marcos has in mind.","chinese":"不过，这可能与马可士心中盘算的不同。"},{"english":"The school encouraged the students to practise using the computers.","chinese":"校方激励学生练习应用盘算机。"},{"english":"Graduated from henan university of science and technology of computer network professional software college.","chinese":"毕业于河南科技大学软件学院盘算机网络专业。"},{"english":"The last time I saw her, she was planning to have a holiday.","chinese":"上次我见到她的时候，她正盘算着要休个假。"},{"english":"We are cerebration of agreement an order for your Flying Pigeon Brand bikes.","chinese":"我们正盘算订购你方的飞鸽牌自行车。"},{"english":"Thinking only of some utter destruction and disaster, he bided his time.","chinese":"他咬牙切齿，在盘算如何毁灭敌人的遐想中打发时光。"},{"english":"I was just toying wit the idea of marrying my daugusthter off with him.","chinese":"我心里正盘算着把我女儿嫁给他呢。"},{"english":"The man affirmed in assertion that he aimed to accost the accidental affirmation.","chinese":"那个人吆喝着申明说他盘算索回无目的的索赔。"}],"related":[{"definition":["to consider\/to ponder"],"pinyin":["xun2 si1"],"word":"寻思"},{"definition":["to reckon\/to consider\/to turn over in one's mind"],"pinyin":["si1 liang5"],"word":"思量"},{"definition":["to ponder\/to reckon\/to turn sth over in one's mind"],"pinyin":["si1 cun3"],"word":"思忖"},{"definition":["to ponder\/to mull over\/to think through\/Taiwan pr. [zhuo2 mo2]","to carve and polish (jade)\/to polish and refine a literary work"],"pinyin":["zuo2 mo5","zhuo2 mo2"],"word":"琢磨"},{"definition":["to reckon\/to calculate\/to plan\/to expect\/to scheme"],"pinyin":["suan4 ji5"],"word":"算计"},{"definition":["to consider\/to turn over in one's mind"],"pinyin":["si1 mou2"],"word":"思谋"},{"definition":["mental arithmetic\/to figure out"],"pinyin":["mo4 suan4"],"word":"默算"},{"definition":["hidden smile\/smirk\/to rejoice covertly\/secret satisfaction concerning one's evil plans"],"pinyin":["an4 xi3"],"word":"暗喜"},{"definition":["to weigh in the hand\/to consider\/to ponder"],"pinyin":["dian1 liang5"],"word":"掂量"},{"definition":["to think deeply\/to ponder"],"pinyin":["si1 suo3"],"word":"思索"},{"definition":["to think sth through\/to consider carefully"],"pinyin":["si1 lu:4"],"word":"思虑"},{"definition":["think to oneself"],"pinyin":["an4 xiang3"],"word":"暗想"},{"definition":["to hesitate"],"pinyin":["chou2 chu2"],"word":"踌躇"},{"definition":["to work out a strategy\/to come up with a plan for"],"pinyin":["chou2 mou2"],"word":"筹谋"},{"definition":["laugh in (up) one's sleeve\/snigger\/snicker"],"pinyin":["an4 xiao4"],"word":"暗笑"},{"definition":["to consider\/to weigh (a matter)\/to balance (pros and cons)"],"pinyin":["quan2 heng2"],"word":"权衡"}]}