{"definition":["Ming and Qing dynasty province directly administered by Beijing, including Beijing, Tianjin, most of Hebei and Henan and part of Shandong"],"pinyin":["Zhi2 li4"],"traditional":["直隸"],"rank":41332.0,"normalized_rank":0.5782883046744924,"fraction":3.3823016143909683e-7,"cumulative_fraction":0.9969694506006056,"word":"直隶","characters":[{"definition":["straight\/to straighten\/fair and reasonable\/frank\/straightforward\/(indicates continuing motion or action)\/vertical\/vertical downward stroke in Chinese characters","surname Zhi\/Zhi (c. 2000 BC), fifth of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God"],"pinyin":["zhi2","Zhi2"],"word":"直"},{"definition":["variant of 隸|隶[li4]","attached to\/scribe"],"pinyin":["li4","li4"],"word":"隶"}],"containing_words":[],"sentences":[{"english":"Chihli Qing Dynasty was the first capital of the province.","chinese":"清代曾为直隶省第一省会。"},{"english":"Improved of Zhili private schools had many specific measures.","chinese":"直隶私塾改良的具体措施有很多种。"},{"english":"Therefore, lhe-police system of the ZhiLi Province in the Late Qmg Dynasty is a valuable subject deserving researches.","chinese":"因此，清末直隶警政是一个很值得研究的课题。"},{"english":"Zhili relief bureau is the special agence of handling reliving in Zhili region.","chinese":"直隶赈抚局是清末直隶地区专门办理赈灾救济机关。"},{"english":"Zhili relief bureau is the special agence of handling reliving in Zhili region.","chinese":"直隶赈抚局是清末直隶地区专门办理赈灾救济机关。"},{"english":"Shuntian Prefecture was subordinated by central authority and had no relationship of command with Zhili viceroy.","chinese":"顺天府由中央直辖，与直隶总督并无统属关系。"},{"english":"In 1912, the County is a sea-chun Chihli Luanxian Province.","chinese":"1912年后，县地属直隶省津海道滦县。"},{"english":"These would produce the positive influence on Zhili agricultural production.","chinese":"这必将对直隶地区农业生产产生积极影响。"},{"english":"Formerly Institute was founded in 1923, the sixth of Chihli Teachers.","chinese":"学院前身为始建于1923年的直隶第六师范。"},{"english":"Zhi Li agricultural school was then the national earliest high agricultural school.","chinese":"直隶农务学堂则是全国成立最早的高等农业学堂。"},{"english":"Third, construction of water conservancy works in Zhili.","chinese":"直隶的农田水利建设。"}],"related":[{"definition":["Hubei and Hunan provinces (a Ming dynasty province)"],"pinyin":["Hu2 guang3"],"word":"湖广"},{"definition":["Nian Army, leading a peasant rebellion against the Qing dynasty in Shandong, Henan, Jiangsu and Anhui 1851-1868, at the same time as the Taiping Rebellion further south"],"pinyin":["Nian3 jun1"],"word":"捻军"},{"definition":["capital of a country (literary)"],"pinyin":["jing1 shi1"],"word":"京师"},{"definition":["army regiment at the disposal of province governor-general"],"pinyin":["du1 biao1"],"word":"督标"},{"definition":["Gyeonggi Province, South Korea, surrounding Seoul and Incheon, capital Suweon City 水原市[Shui3 yuan2 shi4]","capital city and its surrounding area"],"pinyin":["Jing1 ji1","jing1 ji1"],"word":"京畿"},{"definition":["inspector-general of province in Ming and Qing times"],"pinyin":["xun2 fu3"],"word":"巡抚"},{"definition":["old name for district of Hohhot city 呼和浩特[Hu1 he2 hao4 te4], Inner Mongolia"],"pinyin":["Sui2 yuan3"],"word":"绥远"},{"definition":["governor general 总督 and inspector general 巡抚"],"pinyin":["du1 fu3"],"word":"督抚"},{"definition":["Liaodong peninsula between Bohai 渤海 and Yellow sea\/east and south of Liaoning province\/east of Liao river 遼河|辽河"],"pinyin":["Liao2 dong1"],"word":"辽东"},{"definition":["local militia formed to suppress peasant rebellion (old)"],"pinyin":["tuan2 lian4"],"word":"团练"},{"definition":["the Qing court (as government of China)"],"pinyin":["Qing1 ting2"],"word":"清廷"},{"definition":["Rehe, Qing dynasty province abolished in 1955 and divided among Hebei, Liaoning and Inner Mongolia\/refers to the Qing imperial resort at Chengde\/see also 避暑山莊|避暑山庄[bi4 shu3 shan1 zhuang1] (history)"],"pinyin":["Re4 he2"],"word":"热河"},{"definition":["north China army, a modernizing Western-style army set up during late Qing, and a breeding ground for the Northern Warlords after the Qinghai revolution"],"pinyin":["Bei3 yang2 jun1"],"word":"北洋军"},{"definition":["Xincheng county in Hebei"],"pinyin":["Xin1 cheng2 xian4"],"word":"新城县"},{"definition":["Shaanxi and Gansu provinces"],"pinyin":["Shan3 Gan1"],"word":"陕甘"},{"definition":["the Qing Dynasty name for the coastal provinces of Liaoning, Hebei, and Shandong"],"pinyin":["Bei3 yang2"],"word":"北洋"}]}