{"definition":["to lead directly to"],"pinyin":["zhi2 tong1"],"traditional":["直通"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"直通","characters":[{"definition":["straight\/to straighten\/fair and reasonable\/frank\/straightforward\/(indicates continuing motion or action)\/vertical\/vertical downward stroke in Chinese characters","surname Zhi\/Zhi (c. 2000 BC), fifth of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God"],"pinyin":["zhi2","Zhi2"],"word":"直"},{"definition":["to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc","classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)"],"pinyin":["tong1","tong4"],"word":"通"}],"containing_words":[{"definition":["through train"],"pinyin":["zhi2 tong1 huo3 che1"],"word":"直通火车"},{"definition":["\"through train\" (refers to the idea of retaining previous legislature after transition to Chinese rule in Hong Kong or Macao)"],"pinyin":["zhi2 tong1 che1"],"word":"直通车"}],"sentences":[{"english":"The promenade ends with the stairs leading up to the museum's observation tower.","chinese":"长廊终止于直通博物馆瞭望塔的楼梯。"},{"english":"This is the power of language.","chinese":"这就是语言直通心灵的力量。"},{"english":"Above the treeline take a grassy path leading steeply towards the summit.","chinese":"过了林木线之后沿着长满青草的小道直通陡峭的山顶。"},{"english":"Lift check valves come in in-line or globe -style body patterns.","chinese":"升降式止回阀一般采用直通或球形阀体结构。"},{"english":"It is said that the underground river here can link with the East Sea.","chinese":"此处的地下暗河据说可直通东海。"},{"english":"A straight-through layout flow is best for manufacturing or freight forwarding operations.","chinese":"直通式布局流是最好的制造或货运业务。"},{"english":"A four-lane expressway runs straight to the capital.","chinese":"一条四车道的高速公路直通首都。"},{"english":"A straight-through cable is used to make this connection.","chinese":"直通缆线被用来完成此连接。"},{"english":"Straight-through one-way valves installed in a connecting thread of the pipeline.","chinese":"直通式单向阀用罗纹毗连安装在管路上。"},{"english":"A straight-through cable is the same at both ends.","chinese":"直通式电缆是相同的两端。"},{"english":"The original jacket style summer combat uniform has been replaced by a coat design with straight cut bottom.","chinese":"原始的夹克式夏季作训服由直通低的外套所代替。"},{"english":"Morecambe Bay, below the Lake District, opens into the Irish Sea.","chinese":"地势低于湖区的莫克姆湾直通爱尔兰海。"},{"english":"Entry is through a soaring four-storey-high atrium.","chinese":"入口是一个穿过四层楼高，直通屋顶的中庭。"},{"english":"A-line skirts are coming into fashion again.","chinese":"紧身直通裙从新流行起来了。"},{"english":"It is expected that this lookup yields a single entry in the pass-through server.","chinese":"这个查找应该得到直通服务器中的一个条目。"},{"english":"County 35 kilometers away from the terminal is connected to the North River arrived in Hong Kong and Macao.","chinese":"距县城35公里的北江货运码头可直通抵达港澳。"}],"related":[{"definition":["to lead to"],"pinyin":["tong1 wang3"],"word":"通往"},{"definition":["to connect\/to communicate\/to relate\/(math.) connected"],"pinyin":["lian2 tong1"],"word":"连通"},{"definition":["to lead to"],"pinyin":["tong1 xiang4"],"word":"通向"},{"definition":["to go nonstop to\/through (as in \"through train\")\/nonstop"],"pinyin":["zhi2 da2"],"word":"直达"},{"definition":["(communications) channel\/thoroughfare\/passage","Tongdao Dong autonomous county in Huaihua 懷化|怀化[Huai2 hua4], Hunan"],"pinyin":["tong1 dao4","Tong1 dao4"],"word":"通道"},{"definition":["roads open in all directions (idiom); accessible from all sides"],"pinyin":["si4 tong1 ba1 da2"],"word":"四通八达"},{"definition":["to link up\/to thread together"],"pinyin":["guan4 tong1"],"word":"贯通"},{"definition":["to open access\/to establish contact\/to remove a block\/to put through (a phone connection)"],"pinyin":["da3 tong1"],"word":"打通"},{"definition":["to link\/to join\/to attach\/connection\/a link (on web page)"],"pinyin":["lian2 jie1"],"word":"连接"},{"definition":["expansive\/wide\/width\/thickness"],"pinyin":["kuan1 kuo4"],"word":"宽阔"},{"definition":["to link\/to join\/link\/connection"],"pinyin":["xiang1 lian2"],"word":"相连"},{"definition":["door\/strategic gateway\/portal\/faction\/sect\/family status\/family\/web portal\/(old) brothel"],"pinyin":["men2 hu4"],"word":"门户"},{"definition":["to extend\/to spread"],"pinyin":["yan2 shen1"],"word":"延伸"},{"definition":["lit. warp string in weaving\/fig. vertical or north-south lines\/to pass through\/to cross lengthwise\/to pierce (esp. north-south or top-to-bottom)"],"pinyin":["zong4 guan4"],"word":"纵贯"},{"definition":["gateway"],"pinyin":["chu1 ru4 kou3"],"word":"出入口"},{"definition":["east side\/east face"],"pinyin":["dong1 ce4"],"word":"东侧"}]}