{"definition":["to be convinced (that sth is true)\/to believe\/to accept sth as true"],"pinyin":["xiang1 xin4"],"traditional":["相信"],"rank":869.0,"normalized_rank":0.012158437451904916,"fraction":0.00018392188336740795,"cumulative_fraction":0.5976026310679301,"word":"相信","characters":[{"definition":["each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang","appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)"],"pinyin":["xiang1","Xiang1","xiang4"],"word":"相"},{"definition":["letter\/mail\/CL:封[feng1]\/to trust\/to believe\/to profess faith in\/truthful\/confidence\/trust\/at will\/at random"],"pinyin":["xin4"],"word":"信"}],"containing_words":[],"sentences":[{"english":"However, Toni, who knows Ribery well, believes the Bianconeri should sign him.","chinese":"然而托尼很了解里贝里，并且相信尤文会签下他。"},{"english":"It is believed that the sperm whale dives deeper than any other cetacean.","chinese":"人们相信，抹香鲸比其他鲸类动物潜得更深。"},{"english":"I was so awful.\" Do you believe him?","chinese":"我真的非常糟糕，你相信他吗？"},{"english":"If you believe Sony it's still the best camera even without OIS.","chinese":"如果你相信索尼尽管没有光学防抖仍然是最好的相机。"},{"english":"We do this because we believe in the dignity and value of every person.","chinese":"我们这样做是因为我们相信每个人的尊严和价值。"},{"english":"I believe there is no way out of this forest.","chinese":"我相信没有戮由以从这森林走出去。"},{"english":"I send one to you eat, I believe you will like.","chinese":"我送一个给你吃口巴，相信你一定会喜欢的。"},{"english":"They believe themselves to be descendants of the Great Tree, a sacred tree in the forests.","chinese":"他们相信自己是森林里的一棵圣树“大树”的子孙。"},{"english":"Placebos work, doctors believed, because the mind is a powerful thing.","chinese":"医生们相信安慰剂起作用，是因为念力是一种力量。"},{"english":"Way back at the start of the semester when we asked,Why believe in souls?","chinese":"学期一开始的时候我们研究过为何要相信灵魂的存在？"},{"english":"Christians believe Jesus Christ was buried where the Church of the Holy Sepulchre now stands in Jerusalem.","chinese":"基督徒们相信耶稣基督就是被葬在了这座圣墓教堂下。"},{"english":"As your sense of self-trust increases, so will your sense of self-confidence.","chinese":"当你不断地相信自己，你就会感到自信。"},{"english":"This is the day of salvation, calling sinners to repent and believe the gospel.","chinese":"这是拯救的时代，呼召罪人悔改，相信福音。"},{"english":"Metaphysic is the finding of bad reasons for what we believe on instinct.","chinese":"形而上学是我们为相信直觉而找到的坏理由。"},{"english":"The hawkish Cho believed the Separatists had attacked Glid Station.","chinese":"强硬的乔相信格利德站遭到了分裂分子的进攻。"},{"english":"Because he believed success came from industry, he was very industrious.","chinese":"因为他相信成功来自勤奋，他是非常勤奋的。"}],"related":[{"definition":["presumably\/probably\/in all likelihood\/surely"],"pinyin":["xiang3 bi4"],"word":"想必"},{"definition":["to be certain\/to be positive\/assuredly\/definitely\/to give recognition\/to affirm\/affirmative (answer)"],"pinyin":["ken3 ding4"],"word":"肯定"},{"definition":["to know\/to become aware of\/also pr. [zhi1 dao5]"],"pinyin":["zhi1 dao4"],"word":"知道"},{"definition":["everyone\/influential family\/great expert"],"pinyin":["da4 jia1"],"word":"大家"},{"definition":["only natural\/as it should be\/certainly\/of course\/without doubt"],"pinyin":["dang1 ran2"],"word":"当然"},{"definition":["but\/however"],"pinyin":["dan4 shi4"],"word":"但是"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"毕竟"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或许"},{"definition":["perhaps\/maybe"],"pinyin":["ye3 xu3"],"word":"也许"},{"definition":["therefore\/as a result\/so\/the reason why"],"pinyin":["suo3 yi3"],"word":"所以"},{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["surely\/certainly\/necessarily\/fixed\/a certain (extent etc)\/given\/particular\/must"],"pinyin":["yi1 ding4"],"word":"一定"},{"definition":["actually\/in fact\/really"],"pinyin":["qi2 shi2"],"word":"其实"},{"definition":["we\/us\/ourselves\/our"],"pinyin":["wo3 men5"],"word":"我们"},{"definition":["all\/both\/entirely\/(used for emphasis) even\/already\/(not) at all","surname Du","capital city\/metropolis"],"pinyin":["dou1","Du1","du1"],"word":"都"},{"definition":["but\/however\/(used for emphasis) indeed"],"pinyin":["ke3 shi4"],"word":"可是"}]}