{"definition":["opposite\/contrary"],"pinyin":["xiang1 fan3"],"traditional":["相反"],"rank":3577.0,"normalized_rank":0.05004687084633358,"fraction":0.000038414888374478624,"cumulative_fraction":0.8155689024388747,"word":"相反","characters":[{"definition":["each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang","appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)"],"pinyin":["xiang1","Xiang1","xiang4"],"word":"相"},{"definition":["contrary\/in reverse\/inside out or upside down\/to reverse\/to return\/to oppose\/opposite\/against\/anti-\/to rebel\/to use analogy\/instead\/abbr. for 反切[fan3 qie4] phonetic system"],"pinyin":["fan3"],"word":"反"}],"containing_words":[],"sentences":[{"english":"Lincoln, in contrast, is sui generis.","chinese":"相反，林肯则是独一无二的。"},{"english":"Instead, I cheated.","chinese":"相反，我作弊了。"},{"english":"In June the equatorial trade winds reversed direction from westward to eastward.","chinese":"六月赤道信风相反的方向从西到东。"},{"english":"Instead, by mixing primary colors, all other colors can be generated.","chinese":"相反，通过混合三原色，可以生成其他所有的颜色。"},{"english":"In Hackney, by contrast, more people are both working and staying.","chinese":"与之相反，在哈克尼市，更多的人工作并定居于此。"},{"english":"Conversely, Utah has lost 10 of 13.","chinese":"相反，犹他最近13场却输了10场。"},{"english":"Instead, you're taking advantage of the tight cohesion the fixture displays.","chinese":"相反，您充分利用了该装置显示的严密内聚性。"},{"english":"Instead, they honored him, by adopting the breed as the official firehouse mascot.","chinese":"相反，他们尊敬它，用它来作为消防队的正式吉祥物。"},{"english":"Conversely, it will also upshift when engine revs are too high.","chinese":"相反的，当引擎转速过高时，系统不允许升档。"},{"english":"Widdowson ever criticized, \"Structuralism focuses on language analysis and only reflects one aspect of communicative competence.\"","chinese":"而交际法有，过于恰恰相反注重语言在语境中的运用。"},{"english":"The ailerons are moved in opposite senses to make the plane roll.","chinese":"副翼向相反的方向转动就会使得飞机翻滚。"},{"english":"Letting tax cheats run wild doesn’t exactly serve the cause of deficit reduction.","chinese":"让骗税泛滥与削减赤字的努力作用刚好相反。"},{"english":"Instead, I say piously that all I want are three things.","chinese":"相反，我很虔诚的说，我追求的只有三件事。"},{"english":"Death: for Syria is not a penalty, on the contrary is an accomplished.","chinese":"死，对于亚斯兰并非是一种惩罚，相反是一种成全。"},{"english":"Conversely, Protestants often interpret the Old Testament scriptures more literally than Catholics.","chinese":"相反，新教教徒往往用更为书面的语言解释圣经旧约。"},{"english":"But in the sandy land, the change tendency of the soil moisture content is opposite to the clay land.","chinese":"而在沙土地，土壤含水量的变化趋势与黏土地相反。"}],"related":[{"definition":["instead\/on the contrary\/contrary (to expectations)"],"pinyin":["fan3 er2"],"word":"反而"},{"definition":["on the other hand...\/conversely..."],"pinyin":["fan3 zhi1"],"word":"反之"},{"definition":["in fact\/in reality\/as a matter of fact\/in practice"],"pinyin":["shi2 ji4 shang4"],"word":"实际上"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["but on the contrary\/but expectedly"],"pinyin":["fan3 dao4"],"word":"反倒"},{"definition":["in fact\/in reality\/actually\/as a matter of fact\/de facto\/ipso facto"],"pinyin":["shi4 shi2 shang4"],"word":"事实上"},{"definition":["therefore\/as a result\/thus\/and as a result, ..."],"pinyin":["yin1 er2"],"word":"因而"},{"definition":["thus\/consequently\/as a result"],"pinyin":["yin1 ci3"],"word":"因此"},{"definition":["to incline to\/to prefer\/to be prone to"],"pinyin":["qing1 xiang4 yu2"],"word":"倾向于"},{"definition":["conversely\/in reverse order\/in an opposite direction"],"pinyin":["fan3 guo5 lai2"],"word":"反过来"},{"definition":["for the same reason","Tongli, a city in Jiangsu Province, China"],"pinyin":["tong2 li3","Tong2 li3"],"word":"同理"},{"definition":["because\/owing to\/on account of"],"pinyin":["yin1 wei4"],"word":"因为"},{"definition":["therefore\/as a result\/so\/the reason why"],"pinyin":["suo3 yi3"],"word":"所以"},{"definition":["if\/in case\/in the event that"],"pinyin":["ru2 guo3"],"word":"如果"},{"definition":["only\/merely\/nothing but\/no more than\/it's just that ..."],"pinyin":["zhi3 bu5 guo4"],"word":"只不过"},{"definition":["but\/however"],"pinyin":["dan4 shi4"],"word":"但是"}]}