{"definition":["to correspond\/answering (one another)\/to agree (among the part)\/corresponding\/relevant\/appropriate\/(modify) accordingly"],"pinyin":["xiang1 ying4"],"traditional":["相應"],"rank":1547.0,"normalized_rank":0.02164453709792509,"fraction":0.0001034460234323202,"cumulative_fraction":0.6901616368118494,"word":"相应","characters":[{"definition":["each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang","appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)"],"pinyin":["xiang1","Xiang1","xiang4"],"word":"相"},{"definition":["to agree (to do sth)\/should\/ought to\/must\/(legal) shall","surname Ying","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["ying1","Ying4","ying4"],"word":"应"}],"containing_words":[{"definition":["lit. the hammer fits the drum (idiom); appropriate relation between the different parts\/closely interrelated"],"pinyin":["fu2 gu3 xiang1 ying4"],"word":"桴鼓相应"}],"sentences":[{"english":"It's like having an array of stomp boxes ready for action.","chinese":"它有一个数组的单块效果器随时准备采取相应的行动。"},{"english":"Finally, this paper modeled the scheme using OPNET.","chinese":"最后在OPNET中对相应的方案进行了仿真验证。"},{"english":"After examination and approval by the Trademark Office, a corresponding certificate shall be issued to the registrant and the change shall be published.","chinese":"经商标局核准后，发给注册人相应证明，并予以公告。"},{"english":"What ever the accuser said, he could give corresponding refutation.","chinese":"不论控方说什么，他都能给予相应的驳斥。"},{"english":"When the rectangle's events are triggered, the text's attributes change accordingly.","chinese":"触发矩形的事件时，文本的属性就会相应地改变。"},{"english":"The table includes the appropriate number of columns and a corresponding name.","chinese":"表包括适当的列数和相应名称。"},{"english":"Developer will sign an agreement with each participant for the fee payment.","chinese":"承办方将与各投标单位签订协议，以支付相应费用。"},{"english":"Clik here to download and install the player.","chinese":"点击这里下载并安装相应播放器。"},{"english":"Correspondingly, deviation detection can be used for different tasks.","chinese":"相应地，偏差检测可用于不同的任务。"},{"english":"Sets of hyperelastic analytical solution are presented with triangular function.","chinese":"用三角级数的形式给出了一组相应的超弹性解析解答。"},{"english":"\"Creative Dream Present Arts\" & \"Artlim Media · Creative Dream\". And when the love goes on……","chinese":"没有相应的制作软件的话，那几本是个梦想而已了吧。"},{"english":"You can then execute your application logic accordingly.","chinese":"然后可以相应地执行应用程序逻辑。"},{"english":"Does Mr. Mou have the corresponding understanding on Ji Shan's thoughts?","chinese":"及牟先生对于蕺山思想是否有其相应之理解？"},{"english":"A model and its formula of 3-D 10-node mapped infinite element for intercalations in rock engineering are proposed.","chinese":"提出三维10结点映射夹层无限元模型及相应算式。"},{"english":"You only run these segments when you call the function.","chinese":"在您调用函数时，仅运行相应的片断。"},{"english":"Every project quantity applies to the corresponding quota of 《Unifying The Form of Basic Price in Hubei Province》.","chinese":"各项工程量套用《湖北省统一基价表》相应的定额。"}],"related":[{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相关"},{"definition":["to correspond\/a correspondence\/corresponding\/homologous\/matching with sth\/counterpart"],"pinyin":["dui4 ying4"],"word":"对应"},{"definition":["according to\/basis\/foundation"],"pinyin":["yi1 ju4"],"word":"依据"},{"definition":["to give a more granular level of detail\/to elaborate\/to refine\/to become more differentiated"],"pinyin":["xi4 hua4"],"word":"细化"},{"definition":["special\/specific\/designated\/particular"],"pinyin":["te4 ding4"],"word":"特定"},{"definition":["extra\/added\/additional"],"pinyin":["e2 wai4"],"word":"额外"},{"definition":["suitable\/appropriate"],"pinyin":["shi4 dang4"],"word":"适当"},{"definition":["for example\/for instance\/such as"],"pinyin":["li4 ru2"],"word":"例如"},{"definition":["rational\/reasonable\/fair"],"pinyin":["he2 li3"],"word":"合理"},{"definition":["according to\/based on\/basis\/foundation\/CL:個|个[ge4]"],"pinyin":["gen1 ju4"],"word":"根据"},{"definition":["follow-up\/(dialect) to remarry"],"pinyin":["hou4 xu4"],"word":"后续"},{"definition":["to consult a reference\/to refer to (another document)"],"pinyin":["can1 zhao4"],"word":"参照"},{"definition":["provision\/to fix\/to set\/to formulate\/to stipulate\/to provide\/regulation\/rule\/CL:個|个[ge4]"],"pinyin":["gui1 ding4"],"word":"规定"},{"definition":["aforementioned\/above-mentioned"],"pinyin":["shang4 shu4"],"word":"上述"},{"definition":["(of systems, facilities etc) comprehensive\/well-developed\/excellent\/to refine\/to improve"],"pinyin":["wan2 shan4"],"word":"完善"},{"definition":["a series of\/a string of"],"pinyin":["yi1 xi4 lie4"],"word":"一系列"}]}