{"definition":["to love each other"],"pinyin":["xiang1 lian4"],"traditional":["相戀"],"rank":15449.0,"normalized_rank":0.21615155373357767,"fraction":0.0000039378924622274826,"cumulative_fraction":0.9608469853898142,"word":"相恋","characters":[{"definition":["each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang","appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)"],"pinyin":["xiang1","Xiang1","xiang4"],"word":"相"},{"definition":["to feel attached to\/to long for\/to love"],"pinyin":["lian4"],"word":"恋"}],"containing_words":[],"sentences":[{"english":"To be in love is to enter a delicate relationship of mutual influence and attachment.","chinese":"二人相恋是一种彼此影响，互相连结的微妙关系。"},{"english":"The first, the one you should not meet, so then you may not love .","chinese":"仓央嘉措第一最好不相见，如此便可不相恋。"},{"english":"The brain areas associated with intense romantic love, still become active, 25 years later.","chinese":"在相恋25年后，大脑中与热恋的区域仍然活跃。"},{"english":"Daniel fell in love with his girlfriend 8 years of good news to the media.","chinese":"相恋8年旳吴彦祖与女友向各媒体报喜。"},{"english":"They bust up after six years of steady companionship.","chinese":"他们在相恋六年后分手了。"},{"english":"In a short time, José and Clemencia fell in love and wanted to marry as soon as possible.","chinese":"在短短的时间，何塞和克莱门相恋，并希望尽快结婚。"},{"english":"In your present life she fell in love with you just to repay the favor you had done for her in last life.","chinese":"她今生和你相恋，只为还你一个情。"},{"english":"A veteran's prosthesis: he was once in love with his doctor.","chinese":"一位退伍军人的义肢，他曾与自己的复健师相恋。"},{"english":"It's rumored recently that he's in love with 20-year-old Hong Kong singer and actress Isabella Leung.","chinese":"最近有传他与20岁的香港女星梁洛施相恋。"},{"english":"Eventually, Ran has fallen into this guardian angel.","chinese":"不知不觉地，永然与这个守护天使相恋了。"},{"english":"Tell you how much I love you, there will be some Yique fell in love.","chinese":"告诉你我有多爱你，相恋里会有些遗缺。"},{"english":"Love is the veil between lover and lover.","chinese":"爱情是一层纱布，隔在相恋的人中间。"},{"english":"Mr Key and his wife are high school sweethearts, who married in 1984.","chinese":"基与其太太是高中相恋，1984年成婚。"},{"english":"Chicagoan Upchurch began to date Michelle, then 18 or so, as her first-ever boyfriend when they were high school students.","chinese":"米歇尔约18岁时和芝加哥的高中同学大卫相恋。"}],"related":[{"definition":["to get to know each other\/acquaintance"],"pinyin":["xiang1 shi2"],"word":"相识"},{"definition":["to love each other"],"pinyin":["xiang1 ai4"],"word":"相爱"},{"definition":["romantic love"],"pinyin":["lian4 qing2"],"word":"恋情"},{"definition":["to marry\/to get married\/CL:次[ci4]"],"pinyin":["jie2 hun1"],"word":"结婚"},{"definition":["to tie the knot (idiom)\/to get married"],"pinyin":["xi3 jie2 lian2 li3"],"word":"喜结连理"},{"definition":["to fall head over heels in love\/to be passionately in love"],"pinyin":["re4 lian4"],"word":"热恋"},{"definition":["to achieve Buddhahood through one's efforts and insight\/to obtain a positive outcome after sustained efforts\/to come to fruition"],"pinyin":["xiu1 cheng2 zheng4 guo3"],"word":"修成正果"},{"definition":["(dialect) to date sb"],"pinyin":["pai1 tuo1"],"word":"拍拖"},{"definition":["to live together"],"pinyin":["tong2 ju1"],"word":"同居"},{"definition":["to part company\/to split up\/to break up"],"pinyin":["fen1 shou3"],"word":"分手"},{"definition":["to get married soon after meeting"],"pinyin":["shan3 dian4 jie2 hun1"],"word":"闪电结婚"},{"definition":["to get married"],"pinyin":["cheng2 hun1"],"word":"成婚"},{"definition":["to get married soon after meeting (abbr. for 閃電結婚|闪电结婚[shan3 dian4 jie2 hun1]) (neologism c. 2005)"],"pinyin":["shan3 hun1"],"word":"闪婚"},{"definition":["marriage arranged following a pregnancy\/marriage necessitated by an unplanned pregnancy"],"pinyin":["feng4 zi3 cheng2 hun1"],"word":"奉子成婚"},{"definition":["to associate (with)\/to have contact (with)\/to hang out (with)\/to date\/(interpersonal) relationship\/association\/contact"],"pinyin":["jiao1 wang3"],"word":"交往"},{"definition":["the shrike and the swallow fly in different directions (idiom)\/(usually of a couple) to part from each other"],"pinyin":["lao2 yan4 fen1 fei1"],"word":"劳燕分飞"}]}