{"definition":["to get to know each other\/acquaintance"],"pinyin":["xiang1 shi2"],"traditional":["相識"],"rank":8571.0,"normalized_rank":0.11991941012690105,"fraction":0.000010692423234755946,"cumulative_fraction":0.9162478281341006,"word":"相识","characters":[{"definition":["each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang","appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)"],"pinyin":["xiang1","Xiang1","xiang4"],"word":"相"},{"definition":["to know\/knowledge\/Taiwan pr. [shi4]","to record\/to write a footnote"],"pinyin":["shi2","zhi4"],"word":"识"}],"containing_words":[{"definition":["to be total strangers (idiom)"],"pinyin":["su4 bu4 xiang1 shi2"],"word":"素不相识"},{"definition":["déjà vu (the experience of seeing exactly the same situation a second time)\/seemingly familiar\/apparently already acquainted"],"pinyin":["si4 ceng2 xiang1 shi2"],"word":"似曾相识"},{"definition":["lit. don't fight, won't make friends (idiom); an exchange of blows may lead to friendship\/no discord, no concord"],"pinyin":["bu4 da3 bu4 xiang1 shi2"],"word":"不打不相识"},{"definition":["don't fight, won't make friends (idiom); an exchange of blows may lead to friendship"],"pinyin":["bu4 da3 bu4 cheng2 xiang1 shi2"],"word":"不打不成相识"}],"sentences":[{"english":"I met Akmal in Warsaw about two-and-a-half years ago on a protest organised by Polish nurses.","chinese":"两年半前，我和阿克毛在一个抗议活动中相识。"},{"english":"The acquaintances were unworthy of her.","chinese":"这些相识的人都配不上她。"},{"english":"Jordan and Prieto are reported to have met last summer.","chinese":"据悉，二人去年夏天相识。"},{"english":"I show that he had many Jewish acquaintances in Vienna, despite his writing in Mein Kampf that he was sickened by the sight of the Jews he saw there.","chinese":"我可以告诉你，他在维也纳也有许多相识的犹太人。"},{"english":"They conversed with the familiarity of a long-established acquaintance.","chinese":"他们俨然如老相识一样亲密无间地攀谈了。"},{"english":"Once we dreamt that we were strangers.","chinese":"死生契阔有一次，我们梦见大家都是不相识的。"},{"english":"From the acquaintance, to the death, he and cherishes constantly to her sympathizing .","chinese":"从相识，至死亡，他对她的体贴和爱护始终如一。"},{"english":"On that day, due to Yihe's introduction, I firstly met Haizi.","chinese":"那一天，因骆一禾引见，我与海子初次相识。"},{"english":"But the lottery of friendship could even depend on who we happen to meet first.","chinese":"但这种缘分甚至可能还取决于相识的先后顺序。"},{"english":"Komi hirose to guelph too tells the story of love he met Richard garments.","chinese":"广濑给圭太讲述了他和理衣相识相爱的故事。"},{"english":"All products are purchased from acquaintance fellow villagers so that products have high quality.","chinese":"所有产品收购于邻近相识的父老乡亲，品质有保障。"},{"english":"I met my ex in a Weight Watchers meeting, of all places.","chinese":"我和前女友偏偏是在一家减肥中心相识的。"},{"english":"I do not know you so I can not say if I have love for you in my heart.","chinese":"我们仍然素不相识，因此我还不能肯定是否真心爱你。"},{"english":"Know my husband when we are of marriageable age.","chinese":"相识我老公时我们都已经是婚龄年岁了。"},{"english":"English can help us understand⑤ many new books and movies.","chinese":"英语能帮手我们相识许多书战影戏。"},{"english":"On the other side compartments, Jenny and practicing very congenial, feel capable of deja vu.","chinese":"另边厢，珍妮与力行非常投契，感觉得力行似曾相识。"}],"related":[{"definition":["to love each other"],"pinyin":["xiang1 lian4"],"word":"相恋"},{"definition":["familiarity at first sight"],"pinyin":["yi1 jian4 ru2 gu4"],"word":"一见如故"},{"definition":["to form ties\/to become attached (to sb, sth)"],"pinyin":["jie2 yuan2"],"word":"结缘"},{"definition":["to love each other"],"pinyin":["xiang1 ai4"],"word":"相爱"},{"definition":["to get to know sb\/to meet sb for the first time"],"pinyin":["jie2 shi2"],"word":"结识"},{"definition":["to have an affinity with each other (idiom)\/to find each other congenial"],"pinyin":["qing2 tou2 yi4 he2"],"word":"情投意合"},{"definition":["to tie the knot (idiom)\/to get married"],"pinyin":["xi3 jie2 lian2 li3"],"word":"喜结连理"},{"definition":["love at first sight (idiom)"],"pinyin":["yi1 jian4 zhong1 qing2"],"word":"一见钟情"},{"definition":["to meet\/to encounter\/to come across"],"pinyin":["xiang1 yu4"],"word":"相遇"},{"definition":["to be well acquainted with\/to know well"],"pinyin":["shu2 shi5"],"word":"熟识"},{"definition":["intimate friendship\/bosom buddies"],"pinyin":["mo4 ni4 zhi1 jiao1"],"word":"莫逆之交"},{"definition":["strangers coming together by chance (idiom)"],"pinyin":["ping2 shui3 xiang1 feng2"],"word":"萍水相逢"},{"definition":["to see each other\/to meet in person"],"pinyin":["xiang1 jian4"],"word":"相见"},{"definition":["to know\/to recognize\/to be familiar with\/to get acquainted with sb\/knowledge\/understanding\/awareness\/cognition"],"pinyin":["ren4 shi5"],"word":"认识"},{"definition":["to meet together\/to assemble"],"pinyin":["xiang1 ju4"],"word":"相聚"},{"definition":["to associate (with)\/to have contact (with)\/to hang out (with)\/to date\/(interpersonal) relationship\/association\/contact"],"pinyin":["jiao1 wang3"],"word":"交往"}]}