{"definition":["careless\/any-old-how, regardless of the specific task"],"pinyin":["mei2 mao5 hu2 zi5 yi1 ba3 zhua1"],"traditional":["眉毛鬍子一把抓"],"rank":53879.0,"normalized_rank":0.7538371133155177,"fraction":9.357165881849851e-8,"cumulative_fraction":0.999415414346026,"word":"眉毛胡子一把抓","characters":[{"definition":["eyebrow\/upper margin"],"pinyin":["mei2"],"word":"眉"},{"definition":["hair\/feather\/down\/wool\/mildew\/mold\/coarse or semifinished\/young\/raw\/careless\/unthinking\/nervous\/scared\/(of currency) to devalue or depreciate\/classifier for Chinese fractional monetary unit ( = 角[jiao3] , = one-tenth of a yuan or 10 fen 分[fen1])","surname Mao"],"pinyin":["mao2","Mao2"],"word":"毛"},{"definition":["surname Hu","non-Han people, esp. from central Asia\/reckless\/outrageous\/what?\/why?\/to complete a winning hand at mahjong (also written 和[hu2])","beard\/mustache\/whiskers","see 衚衕|胡同[hu2 tong4]"],"pinyin":["Hu2","hu2","hu2","hu2"],"word":"胡"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi5","zi3"],"word":"子"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["handle","to hold\/to contain\/to grasp\/to take hold of\/handle\/particle marking the following noun as a direct object\/classifier for objects with handle\/classifier for small objects: handful"],"pinyin":["ba4","ba3"],"word":"把"},{"definition":["to grab\/to catch\/to arrest\/to snatch\/to scratch"],"pinyin":["zhua1"],"word":"抓"}],"containing_words":[],"sentences":[],"related":[{"definition":["banging away clumsily in all directions with no overall vision"],"pinyin":["dong1 yi1 lang2 tou2 xi1 yi1 bang4 zi5"],"word":"东一榔头西一棒子"},{"definition":["to speak in general terms"],"pinyin":["fan4 fan4 er2 tan2"],"word":"泛泛而谈"},{"definition":["unable to see the wood for the trees\/fig. only able to see isolated details, and not the bigger picture"],"pinyin":["zhi3 jian4 shu4 mu4 bu4 jian4 sen1 lin2"],"word":"只见树木不见森林"},{"definition":["to neglect the root and pursue the tip (idiom)\/to neglect fundamentals and concentrate on details"],"pinyin":["she3 ben3 zhu2 mo4"],"word":"舍本逐末"},{"definition":["to treat the symptoms rather than getting to the root of the problem (proverb)\/reactive (rather than proactive)"],"pinyin":["tou2 tong4 yi1 tou2 , jiao3 tong4 yi1 jiao3"],"word":"头痛医头，脚痛医脚"},{"definition":["to treat the symptoms\/reactive (rather than proactive)"],"pinyin":["tou2 tong4 yi1 tou2"],"word":"头痛医头"},{"definition":["to let go of the big prize while grabbing at trifles (idiom)"],"pinyin":["jian3 le5 zhi1 ma5 diu1 le5 xi1 gua1"],"word":"捡了芝麻丢了西瓜"},{"definition":["(idiom) take care of everything; handle everything"],"pinyin":["mian4 mian4 ju4 dao4"],"word":"面面俱到"},{"definition":["to concentrate on the main points (idiom); to bring out the essentials"],"pinyin":["ti2 gang1 qie4 ling3"],"word":"提纲挈领"},{"definition":["an overall plan taking into account all factors"],"pinyin":["tong3 chou2 jian1 gu4"],"word":"统筹兼顾"},{"definition":["if you lift the headrope the meshes spread open (idiom)\/take care of the big things and the little things will take care of themselves\/(of a piece of writing) well-structured and ordered"],"pinyin":["gang1 ju3 mu4 zhang1"],"word":"纲举目张"},{"definition":["the important and the less important\/primary and secondary"],"pinyin":["zhu3 ci4"],"word":"主次"},{"definition":["lit. to invert root and branch (idiom); fig. confusing cause and effect\/to stress the incidental over the fundamental\/to put the cart before the horse"],"pinyin":["ben3 mo4 dao4 zhi4"],"word":"本末倒置"},{"definition":["to do things in bits and pieces (idiom); piecemeal work"],"pinyin":["ling2 da3 sui4 qiao1"],"word":"零打碎敲"},{"definition":["solve one problem only to find another cropping up"],"pinyin":["an4 xia4 hu2 lu2 fu2 qi3 piao2"],"word":"按下葫芦浮起瓢"},{"definition":["book worship\/bookishness"],"pinyin":["ben3 ben3 zhu3 yi4"],"word":"本本主义"}]}