{"definition":["it would appear\/it seems (that)"],"pinyin":["kan4 shang5 qu5"],"traditional":["看上去"],"rank":4136.0,"normalized_rank":0.05786800610020568,"fraction":0.00003175830858957452,"cumulative_fraction":0.8350649030827542,"word":"看上去","characters":[{"definition":["to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)","to look after\/to take care of\/to watch\/to guard"],"pinyin":["kan4","kan1"],"word":"看"},{"definition":["on top\/upon\/above\/upper\/previous\/first (of multiple parts)\/to climb\/to get onto\/to go up\/to attend (class or university)","see 上聲|上声[shang3 sheng1]"],"pinyin":["shang4","shang3"],"word":"上"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"They don't really look like white elephants.","chinese":"看上去并不真象一群白象。"},{"english":"It looks like the drums in Drum Tower in Xi'An.","chinese":"它看上去很像西安鼓楼里的鼓。"},{"english":"Despite the clouds, the Matterhorn still was a great piece of rock to look at.","chinese":"除了云朵外，马特宏峰看上去始终是块壮观的石头。"},{"english":"Sneaking out may seem like a real option in the heat of anger.","chinese":"盛怒之下，偷偷溜出去看上去似乎是真正的解决之道。"},{"english":"A broken wood bridge, looked like was damaged by the thunderstorm.","chinese":"一个断裂的木桥，看上去象是被暴风雨冲垮的。"},{"english":"The result is a universe that now looks like a sponge.","chinese":"结果是如今的宇宙看上去就像一块海绵。"},{"english":"Police say Chin appeared fine when guards brought breakfast to his cell.","chinese":"警方称陈在狱卒给他送早餐的时候看上去一切正常。"},{"english":"Oh，they look just like live cranes.","chinese":"哦，这些仙鹤看上去就像真的一样。"},{"english":"Can you imagine how much smarter this is going to make you look?","chinese":"能想像这会让你看上去比以前聪明了多少吗？"},{"english":"Pablo looked at him through his bleary eyes.","chinese":"他看上去目光呆滞，茫然若失。"},{"english":"He looks quite normal but there's something about him that gives me the willies .","chinese":"他看上去很正常，但是他有某种特点使我感到害怕。"},{"english":"You get a lot of suspicious-looking people in this bar.","chinese":"你这个酒吧里有许多人看上去很可疑。"},{"english":"I found a serious bug in my add-on, and I really want to get the fix up there quickly.","chinese":"我的附加组件已经发布，用户看上去很喜欢。"},{"english":"You look stressed.","chinese":"你看上去心事重重的。"},{"english":"Sammy: Look like you just make some wood squares from these boxes here.","chinese":"看上去你只是用了这些箱子上的木框。"},{"english":"I look very cute.","chinese":"我看上去很可爱。"}],"related":[]}