{"definition":["to have a preference for\/to fancy\/to choose after consideration\/to settle on"],"pinyin":["kan4 zhong4"],"traditional":["看中"],"rank":6623.0,"normalized_rank":0.09266436276635932,"fraction":0.000016030095160962495,"cumulative_fraction":0.8907260984865065,"word":"看中","characters":[{"definition":["to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)","to look after\/to take care of\/to watch\/to guard"],"pinyin":["kan4","kan1"],"word":"看"},{"definition":["to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right","China\/Chinese\/surname Zhong"],"pinyin":["zhong4","zhong1","Zhong1"],"word":"中"}],"containing_words":[],"sentences":[{"english":"He took a fancy to the girl.","chinese":"他看中了这位姑娘。"},{"english":"Lazio defender Stephan Lichtsteiner is being lined up by new Inter Milan coach Rafa Benitez.","chinese":"拉齐奥后卫师太最近被传被国妓新帅贝尼特斯看中。"},{"english":"Physical aware, of the Japanese people see is the shangguan familys reputation.","chinese":"方天翼明白，这些日本人看中的是上官家族的声望。"},{"english":"A year later, the Empire expressed interest in the powerful warriors of the Calian Confederacy.","chinese":"一年后，帝国看中了强大的卡利安邦联勇士。"},{"english":"Ai Hua to white women fancy Yiming indoctrination, is your money.","chinese":"艾华向白一鸣灌输，女人看中的是你的钱。"},{"english":"The painting took his fancy, so he bought it.","chinese":"这幅画被他看中了，所以他就把他买了下来。"},{"english":"What Zhang values about working as a civil servant is also the platform it offers.","chinese":"郑芳看中公务员的另一点就是它提供的平台。"},{"english":"Should we buy their own eyes.","chinese":"要自己看中才买。"},{"english":"Large astronomical observatories also take advantage of the calm Canary Island sky.","chinese":"大型天文台也看中了加那利群岛宁静的天空。"},{"english":"Take control and before you know it you will mesmerize the person of your choice.","chinese":"保持控制权，你已经让你看中的人很着迷了。"},{"english":"Liu loach took the boat lake pearl household.","chinese":"刘泥鳅看中了湖边珍珠家用过的小舟。"},{"english":"How long did they fancy a stroll Floral Jiaao.","chinese":"没逛多久便看中一件碎花夹袄。"},{"english":"I want to add to the squad and have identified one or two targets.","chinese":"我要加强球队的阵容，而且已经看中了一两名球员。"},{"english":"Lei is the eyes on this small park before deciding moved here .","chinese":"磊就是看中了这个小公园才决定搬来这里的。"},{"english":"The younger generation longs for more personal comfort.","chinese":"年轻一代更多看中个人享乐。"},{"english":"Tan Qunzhao expresses, what take a fancy to La Gang to go up in the product grandly is deep accumulate.","chinese":"谭群钊表示，盛大看中蓝港在产品上的深厚积淀。"}],"related":[{"definition":["to look upon\/to take a fancy to\/to fall for"],"pinyin":["kan4 shang4"],"word":"看上"},{"definition":["to find to one's taste\/to pick (after looking at)\/Taiwan pr. [xiang4 zhong4]"],"pinyin":["xiang1 zhong4"],"word":"相中"},{"definition":["to regard as important\/to care about"],"pinyin":["kan4 zhong4"],"word":"看重"},{"definition":["to stand out\/outstanding"],"pinyin":["chu1 zhong4"],"word":"出众"},{"definition":["(lit.) to fix one's gaze on\/(fig.) to show interest in\/(favorable) attention\/favor"],"pinyin":["qing1 lai4"],"word":"青睐"},{"definition":["to recommend sb\/to give a referral"],"pinyin":["yin3 jian4"],"word":"引荐"},{"definition":["Sino-Italian","to take one's fancy\/to be to one's liking"],"pinyin":["Zhong1 Yi4","zhong4 yi4"],"word":"中意"},{"definition":["to pass on\/to resell\/to change hands"],"pinyin":["zhuan3 shou3"],"word":"转手"},{"definition":["to choose\/to select"],"pinyin":["tiao1 xuan3"],"word":"挑选"},{"definition":["to keep an eye on","to regard as having good prospects"],"pinyin":["kan1 hao3","kan4 hao3"],"word":"看好"},{"definition":["to appreciate\/to recognize the worth of sth\/appreciation"],"pinyin":["shang3 shi2"],"word":"赏识"},{"definition":["to make one's name\/to become famous"],"pinyin":["cheng2 ming2"],"word":"成名"},{"definition":["to select very carefully"],"pinyin":["qian1 tiao1 wan4 xuan3"],"word":"千挑万选"},{"definition":["to move (to pity)\/arousing (sympathy)\/touching"],"pinyin":["da3 dong4"],"word":"打动"},{"definition":["large sum of money"],"pinyin":["zhong4 jin1"],"word":"重金"},{"definition":["to place high hopes"],"pinyin":["ji4 yu3 hou4 wang4"],"word":"寄予厚望"}]}