{"definition":["to look after the house\/(of skill, ability) special\/outstanding"],"pinyin":["kan1 jia1"],"traditional":["看家"],"rank":26305.0,"normalized_rank":0.3680410784492046,"fraction":0.0000013162802614140423,"cumulative_fraction":0.9861128530438851,"word":"看家","characters":[{"definition":["to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)","to look after\/to take care of\/to watch\/to guard"],"pinyin":["kan4","kan1"],"word":"看"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"}],"containing_words":[],"sentences":[{"english":"The young Charlton's greatest strengths were his speed and body swerve.","chinese":"年轻时查尔顿的看家本领是快速的奔跑和身体变向。"},{"english":"As a result, most women are left to care for the home with little hope of a future.","chinese":"结果，女性只能留下来看家，前途一片渺茫。"},{"english":"They will care for the sick, collect the rubbish, guard homes and offices, and give directions on the street.","chinese":"它们会照顾病人，收集垃圾，看家护院，上街指路。"},{"english":"From my graduation, family in order to guard home he bought a dog to keep.","chinese":"从我毕业时，家人为了看家护院便买了一只狗来养。"},{"english":"She is still guarding my family.","chinese":"她依旧给我们家看家。"},{"english":"The competition is very keen but I have an ace up my sleeve .","chinese":"竞争很激烈，但我有我的看家本领。"},{"english":"Each family all have the dog guard home, this is for over a thousand years tradition.","chinese":"家家都有狗看家护院，这是上千年来的传统。"},{"english":"The host looks after it carefully every day and Bingo helps to guard the house.","chinese":"它主人每天都悉心照顾它，而宾果也会每天帮忙看家。"},{"english":"The master raised a dog to guard his house.","chinese":"主人养了一条看家狗。"},{"english":"Jet was also an efficient bug-zapper and a terrific \"watchdog.\"","chinese":"“喷气机”还是个灭虫能手和出色的“看家狗”。"},{"english":"The mastiff was generally used as a guard dog and is widely recognized as a particularly intelligent species.","chinese":"藏獒犬一般用来看家护院，也是很聪明的犬种。"},{"english":"I like dogs, 34, look after the house on the big German shepherds guarding the hospital.","chinese":"我喜欢狗，就养三四条看家护院的大狼狗。"},{"english":"This local play has been the bread and butter of the troupe.","chinese":"这出地方剧目一直是这个剧团赖以为生的看家节目。"},{"english":"The sound of heavy footsteps awoke the watchdog.","chinese":"沉重的脚步声惊醒了看家豿。"},{"english":"The specialty of this restaurant, \"Fare well, my concubine (stewed tortoise and hen)\" is the most delicious dish under heaven.","chinese":"本餐馆看家菜“霸王别姬”堪称天下第一。"},{"english":"Moreover, petscan also look after the house and when there's no one at home.","chinese":"再者，当家里没人时，宠物也能看家护院。"}],"related":[{"definition":["specialty\/unique skill"],"pinyin":["jue2 huo2"],"word":"绝活"},{"definition":["(fig.) trump card"],"pinyin":["sha1 shou3 jian3"],"word":"杀手锏"},{"definition":["expert in\/good at"],"pinyin":["na2 shou3"],"word":"拿手"},{"definition":["to look after\/to attend to\/to have in care"],"pinyin":["zhao4 kan4"],"word":"照看"},{"definition":["passed on from ancestors\/handed down from generation to generation"],"pinyin":["zu3 chuan2"],"word":"祖传"},{"definition":["oneself\/one's own family"],"pinyin":["zi4 jia1"],"word":"自家"},{"definition":["to keep up appearances\/to put up a front"],"pinyin":["cheng1 men2 mian4"],"word":"撑门面"},{"definition":["to have a skill\/to have a lot on the ball\/to have an affair"],"pinyin":["you3 yi1 shou3"],"word":"有一手"},{"definition":["the old and the young\/the youngest member of the family"],"pinyin":["lao3 xiao3"],"word":"老小"},{"definition":["self-protection\/to defend oneself"],"pinyin":["fang2 shen1"],"word":"防身"},{"definition":["to slip away\/to escape in stealth\/to skate"],"pinyin":["liu1"],"word":"溜"},{"definition":["to save one's life\/to survive"],"pinyin":["bao3 ming4"],"word":"保命"},{"definition":["consummate skill\/supreme feat\/tour-de-force\/stunt"],"pinyin":["jue2 ji4"],"word":"绝技"},{"definition":["empty-handed\/unarmed\/(painting, embroidery etc) without following a model\/(abbr. for 空手道[kong1 shou3 dao4]) karate"],"pinyin":["kong1 shou3"],"word":"空手"},{"definition":["familial property\/belongings"],"pinyin":["jia1 dang4"],"word":"家当"},{"definition":["not presentable\/not fit to be seen in company"],"pinyin":["na2 chu1 shou3"],"word":"拿出手"}]}