{"definition":["to regard as\/to look upon as"],"pinyin":["kan4 zuo4"],"traditional":["看做"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"看做","characters":[{"definition":["to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)","to look after\/to take care of\/to watch\/to guard"],"pinyin":["kan4","kan1"],"word":"看"},{"definition":["to do\/to make\/to produce\/to write\/to compose\/to act as\/to engage in\/to hold (a party)\/to be\/to become\/to function (in some capacity)\/to serve as\/to be used for\/to form (a bond or relationship)\/to pretend\/to feign\/to act a part\/to put on appearance"],"pinyin":["zuo4"],"word":"做"}],"containing_words":[],"sentences":[{"english":"So, it's hard for me not to see this as being political.","chinese":"所以对我来说，很难不把这件事看做是一个政治事件。"},{"english":"Its light and resistant gear was taken as a novelty.","chinese":"它的轻便耐磨的齿轮被看做是一个传奇。"},{"english":"It would not be wrong to say that it is a kind of traditional art of behavior.","chinese":"把它看做一种传统的“行为艺术”，也未尝不可。"},{"english":"Today, many Burmese view China as a pillager of resources.","chinese":"如今，许多缅族人都把中国看做是一个资源掠夺者。"},{"english":"The hijacking of the Alabama is believed the first pirate attack on an American-flagged merchant ship in 200 years.","chinese":"阿拉巴马被看做200年来第一艘被劫的美国船只。"},{"english":"He looked upon his wife as the better half.","chinese":"他把妻子看做是贤内助。"},{"english":"Time to move forward, I also look forward to what?","chinese":"时间向前走，我还往后看做什么？"},{"english":"Considered an attack against democracy, the assassination caused the government to _declarewar on the yakuza.","chinese":"这被看做是对民主的攻击，政府正式对暴力团宣战。"},{"english":"Nevertheless, you are OK also these message regard as bru it or it is gossip.","chinese":"不过，你也可以将这些消息看做谣传或是道听途说。"},{"english":"The moon is the 'yin' or female principle and it is a trusted friend.","chinese":"月亮代表“阴”或女性，并且被看做是可靠的朋友。"},{"english":"I could have him for my fellow worker but not for a friend.","chinese":"我可以把他看做我的同事，却不能视作朋友。"},{"english":"The business world should start to see Twitter as one of the primary consumer communication channels available.","chinese":"企业应该开始将微薄看做一个基本的客户交流平台。"},{"english":"She is reckoned a very good teacher.","chinese":"她被看做是一位优秀教师。"},{"english":"Economic envy, once seen as a European vice, is now rife.","chinese":"曾经被看做欧式恶习的经济嫉妒，如今却很盛行。"},{"english":"Well, the people of Annam certainly don't view them as traditional.","chinese":"好吧，安南的人们当然不把他们看做传统的自己人。"},{"english":"He called the prison break a disaster.","chinese":"他把这次越狱事件看做一场灾难。"}],"related":[{"definition":["to look upon as\/to regard as"],"pinyin":["kan4 zuo4"],"word":"看作"},{"definition":["to regard as"],"pinyin":["kan4 cheng2"],"word":"看成"},{"definition":["to regard as\/to treat as"],"pinyin":["shi4 zuo4"],"word":"视作"},{"definition":["to treat as\/to regard as\/to look upon as"],"pinyin":["dang4 zuo4"],"word":"当做"},{"definition":["to treat as\/to regard as"],"pinyin":["dang4 zuo4"],"word":"当作"},{"definition":["to consider as\/to take to be"],"pinyin":["dang4 cheng2"],"word":"当成"},{"definition":["to view as\/to see as\/to consider to be\/to deem"],"pinyin":["shi4 wei2"],"word":"视为"},{"definition":["to be called\/to be known as"],"pinyin":["cheng1 zuo4"],"word":"称作"},{"definition":["in fact\/in reality\/as a matter of fact\/in practice"],"pinyin":["shi2 ji4 shang4"],"word":"实际上"},{"definition":["to liken to\/to compare to"],"pinyin":["bi3 zuo4"],"word":"比作"},{"definition":["certainty\/without a doubt"],"pinyin":["hao2 wu2 yi2 wen4"],"word":"毫无疑问"},{"definition":["only\/merely\/nothing but\/no more than\/it's just that ..."],"pinyin":["zhi3 bu5 guo4"],"word":"只不过"},{"definition":["in fact\/in reality\/actually\/as a matter of fact\/de facto\/ipso facto"],"pinyin":["shi4 shi2 shang4"],"word":"事实上"},{"definition":["definition\/to define"],"pinyin":["ding4 yi4"],"word":"定义"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"认为"},{"definition":["to equate\/equal to"],"pinyin":["deng3 tong2"],"word":"等同"}]}