{"definition":["to keep an eye on","to regard as having good prospects"],"pinyin":["kan1 hao3","kan4 hao3"],"traditional":["看好","看好"],"rank":2589.0,"normalized_rank":0.03622346900228058,"fraction":0.000057250089613220005,"cumulative_fraction":0.7691915118605924,"word":"看好","characters":[{"definition":["to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)","to look after\/to take care of\/to watch\/to guard"],"pinyin":["kan4","kan1"],"word":"看"},{"definition":["to be fond of\/to have a tendency to\/to be prone to","good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello"],"pinyin":["hao4","hao3"],"word":"好"}],"containing_words":[],"sentences":[{"english":"The yuan non-deliverable forward market isn't expecting significant appreciation for the next year.","chinese":"让市场大喜过望的人民币在下一年完整不被看好。"},{"english":"Within bonds, we overweight credit versus underweight government bonds.","chinese":"具体而言，我们继续相对看好企业债，看空政府债。"},{"english":"We remain unenthused regarding near tern outlook for the company.","chinese":"我们仍旧不看好该公司的近期前景。"},{"english":"Professor Duman hailed the potential of ketamine.","chinese":"Duman教授十分看好氯胺酮的潜力。"},{"english":"Subordinates are not optimistic about Wang Jingwei to sign the agreement.","chinese":"下属不看好汪精卫要签的协议。"},{"english":"Our country's cigarette market is attractive to many foreign tobacco companies.","chinese":"我国的烟草市场被许多外国的大烟草公司看好。"},{"english":"Liu had a good feeling about Zhang even though she was an amateur actress;","chinese":"尽管张只是一位群众演员，但是啸宇很看好她。"},{"english":"The reception among food distributors and buyers for store chains has been favorable, he said.","chinese":"他说，食品批发商以及连锁店进货商对他们看好。"},{"english":"To be fair, Ellison is helping to finance some very promising films at Paramount.","chinese":"公平地说，埃利森确实在资助一些很被看好的电影。"},{"english":"\"You just don't believe in her,\" Iaccused.","chinese":"“你就是不看好她，”我反唇相讥。"},{"english":"The rental trend in the villa market will remain stable and may rise slightly in the future.","chinese":"别墅租赁市场前景看好，仍将稳中有升。"},{"english":"At the beginning of the bridge tournament, we were the under dogs and nobody thought we were going to win.","chinese":"桥牌赛一开始，我们不被看好，没有人认为我们会赢。"},{"english":"Xiangyu took the latter part of the site is promising.","chinese":"象屿拿这幅土地是对后期看好。"},{"english":"So the insurance business is good, I ask Buffett?","chinese":"我问巴菲特，这是否意味着看好保险行业的前景？"},{"english":"Check this out. Anybody need a hanky?","chinese":"看好了，有人需要手帕吗？"},{"english":"There are risks to the consensus bullish view on emerging markets.","chinese":"大多数人看好新兴市场，这种观点是有风险的。"}],"related":[{"definition":["foreground\/vista\/(future) prospects\/perspective"],"pinyin":["qian2 jing3"],"word":"前景"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"认为"},{"definition":["(lit.) to fix one's gaze on\/(fig.) to show interest in\/(favorable) attention\/favor"],"pinyin":["qing1 lai4"],"word":"青睐"},{"definition":["(of economy, business etc) flourishing\/prosperous"],"pinyin":["jing3 qi4"],"word":"景气"},{"definition":["stock that has potential to increase in value\/(fig.) sb with good prospects"],"pinyin":["qian2 li4 gu3"],"word":"潜力股"},{"definition":["to overestimate\/to overrate"],"pinyin":["gao1 gu1"],"word":"高估"},{"definition":["outlook\/prospect\/to look ahead\/to look forward to"],"pinyin":["zhan3 wang4"],"word":"展望"},{"definition":["popular\/hot\/in vogue"],"pinyin":["re4 men2"],"word":"热门"},{"definition":["future\/tomorrow\/CL:個|个[ge4]\/approaching\/coming\/pending"],"pinyin":["wei4 lai2"],"word":"未来"},{"definition":["to pay attention to\/to follow sth closely\/to follow (on social media)\/concern\/interest\/attention"],"pinyin":["guan1 zhu4"],"word":"关注"},{"definition":["to forecast\/to predict"],"pinyin":["yu4 ce4"],"word":"预测"},{"definition":["to hype\/to promote (in the media)"],"pinyin":["chao3 zuo4"],"word":"炒作"},{"definition":["to approve\/approval\/acknowledgment\/OK"],"pinyin":["ren4 ke3"],"word":"认可"},{"definition":["to have a preference for\/to fancy\/to choose after consideration\/to settle on"],"pinyin":["kan4 zhong4"],"word":"看中"},{"definition":["to come and see\/to see a topic from a certain point of view"],"pinyin":["lai2 kan4"],"word":"来看"},{"definition":["cautious\/prudent"],"pinyin":["jin3 shen4"],"word":"谨慎"}]}