{"definition":["to observe and make sure\/to check"],"pinyin":["kan4 zhun3"],"traditional":["看準"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"看准","characters":[{"definition":["to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)","to look after\/to take care of\/to watch\/to guard"],"pinyin":["kan4","kan1"],"word":"看"},{"definition":["to allow\/to grant\/in accordance with\/in the light of","accurate\/standard\/definitely\/certainly\/about to become (bride, son-in-law etc)\/quasi-\/para-"],"pinyin":["zhun3","zhun3"],"word":"准"}],"containing_words":[{"definition":["to watch for an opportunity\/to see one's chance to"],"pinyin":["kan4 zhun3 ji1 hui4"],"word":"看准机会"}],"sentences":[{"english":"Lin Lei saw the opportunity to ridicule Bai righteousness, want him to hold.","chinese":"林磊看准机会乘机奚落柏义，要他来执筹码。"},{"english":"A miracle will soon appear, \"eyes opened wide points, sights poker.\"","chinese":"奇迹即将出现，“眼睛睁大点，看准扑克牌。”"},{"english":"The Southwest Airlines was able to see the silver lines in the cloud and profit from the oil crisis.","chinese":"西南航空公司看准油价行情，变成危机中的赢家。"},{"english":"If they attack, concentrate your forces and attack his weakness.","chinese":"如果敌人进攻，就集中兵力看准敌人的破绽去打击它。"},{"english":"This allows Mahone and Michael to sneak intoTuxhorn's house and find the device.","chinese":"马宏和迈可看准机会，溜了进去，及时拿回了设备。"},{"english":"Chongqing Xidishan Days Hotel just gets hold of such an opportunity.","chinese":"而重庆喜地山戴斯大酒店，正是看准了这样一个契机。"},{"english":"Once you have decide you are going to kiss someone, choose your moment and go for it.","chinese":"一旦你决定要吻这个人，看准时机就立刻行动。"},{"english":"She watched her moment to cross the road.","chinese":"她看准时机横穿马路。"},{"english":"ICI is also targeting the housing construction market.","chinese":"ICI同时还看准了民用住宅建设市场。"},{"english":"The fighter's well-aimed blow curled his opponent up.","chinese":"那位拳击手看准目标，一拳把对手打垮了。"},{"english":"This allows Mahone and Michael to sneak into Tuxhorn's house and find the device.","chinese":"马宏和迈可看准机会，溜了进去，及时拿回了设备。"},{"english":"They saw the great opportunity to corner the market and earned a lot of money.","chinese":"他们看准了垄断市场的大好时机并赚了很多钱。"},{"english":"Qin saw the opportunity, first with Qi Lianheng, Wei introduction of large tracts of land.","chinese":"秦国看准时机，先与齐连横，攻略魏国大片土地。"},{"english":"To see in order to focus one eye on the worm .","chinese":"向看去，以便使一只眼睛能看准虫子。"}],"related":[{"definition":["strike first and gain the upper hand (idiom, martial arts term); Making the first move is an advantage."],"pinyin":["xian1 xia4 shou3 wei2 qiang2"],"word":"先下手为强"},{"definition":["to grab\/to capture"],"pinyin":["zhua1 zhu4"],"word":"抓住"},{"definition":["to make prompt decisions (idiom)"],"pinyin":["dang1 ji1 li4 duan4"],"word":"当机立断"},{"definition":["to take advantage of a favorable situation\/to seize an opportunity"],"pinyin":["chen4 shi4"],"word":"趁势"},{"definition":["fortunate timing\/occasion\/opportunity"],"pinyin":["shi2 ji1"],"word":"时机"},{"definition":["key moment\/decisive opportunity"],"pinyin":["xian1 ji1"],"word":"先机"},{"definition":["to identify clearly\/to make sure of\/to believe firmly"],"pinyin":["ren4 zhun3"],"word":"认准"},{"definition":["to judge the hour and size up the situation\/to take stock"],"pinyin":["shen3 shi2 duo2 shi4"],"word":"审时度势"},{"definition":["to zealously continue fighting"],"pinyin":["lian4 zhan4"],"word":"恋战"},{"definition":["to make a move (in martial arts or figuratively)"],"pinyin":["chu1 zhao1"],"word":"出招"},{"definition":["No time to lose! (idiom)"],"pinyin":["ji1 bu4 ke3 shi1"],"word":"机不可失"},{"definition":["to start\/to put one's hand to\/to set about\/the seat to the right of the main guest"],"pinyin":["xia4 shou3"],"word":"下手"},{"definition":["to borrow sb's authority\/to seize an opportunity"],"pinyin":["jie4 shi4"],"word":"借势"},{"definition":["to seize the opportunity\/to strike while the iron is hot"],"pinyin":["cheng2 shi4"],"word":"乘势"},{"definition":["to seize (the strategic high ground)"],"pinyin":["qiang3 zhan4"],"word":"抢占"},{"definition":["to keep cool\/to stay calm"],"pinyin":["chen2 zhu4 qi4"],"word":"沉住气"}]}