{"definition":["bull market (prices appear to be rising)"],"pinyin":["kan4 zhang3"],"traditional":["看漲"],"rank":12368.0,"normalized_rank":0.17304436640409665,"fraction":0.000005825091222298541,"cumulative_fraction":0.9461163564952494,"word":"看涨","characters":[{"definition":["to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)","to look after\/to take care of\/to watch\/to guard"],"pinyin":["kan4","kan1"],"word":"看"},{"definition":["to swell\/to distend","to rise (of prices, rivers)"],"pinyin":["zhang4","zhang3"],"word":"涨"}],"containing_words":[],"sentences":[{"english":"The overall technical backdrop remains bullish and favors another attempt to rally toward recent high.","chinese":"总体技术面仍看涨，支持再次向近期高点上攻。"},{"english":"A catch-up is imminent, say the bulls.","chinese":"看涨者认为，股市不久将奋起直追。"},{"english":"That bullish close signals a new uptrend and long entry.","chinese":"看涨行情结束标志一个新的上升趋势和买入点的出现。"},{"english":"KDJ index low to form gold forks, late call is more likely.","chinese":"KDJ指标在低位形成金叉，后期看涨的可能性更大。"},{"english":"The overall technical backdrop however, remains bullish. So, buying on market dips should be rewarding.","chinese":"不过总体技术面仍看涨，因此逢低买进应是上策。"},{"english":"Only a cross-over above the zero line of the indicator could signal bullishness again.","chinese":"只有在零线指标之上的交叉可能预示又一次看涨。"},{"english":"The more people invest in stocks, the higher the stock prices rise.","chinese":"买进的人多了，股票行情就看涨。"},{"english":"Real estate is well up, and I could afford you a pretty handsome price.","chinese":"不动产大大看涨，我可以给你个好价钱。"},{"english":"The market opened in a bullish mood.","chinese":"股市开盘时行情看涨。"},{"english":"We are fully aware of the rising tendency of this product in the world market.","chinese":"我们很清楚，这种产品在世界市场上的行情看涨。"},{"english":"The amateur buys calls and sits back to watch his money double.","chinese":"业余选手可以买看涨期权，并坐等自己的资金翻番。"},{"english":"Note that a look-ahead at the indicator shows that the oversold indicator may flip to bullish in the near-term.","chinese":"注意这个指标的前瞻显示卖空指标可能在近期看涨。"},{"english":"The goods is in short supply, consequently the market will probably rise next week.","chinese":"这种货物供应不足，因此下周市场行情可能看涨。"},{"english":"Ret market continue bullish no chance to get same rate presently.","chinese":"海运市场持续看涨，目前无法获昨相同动费率。"},{"english":"The bullishness is spreading like wildfire within China, too.","chinese":"看涨的想法如同野火般也正在中国蔓延。"},{"english":"Hammered by the plasticizer scandal, natural fruit juice becomes extremely popular, and the price of fruits continues to rise.","chinese":"受到塑化剂影响，天然果汁夯，水果价格也持续看涨。"}],"related":[{"definition":["phony\/so-called\/armchair (expert)\/vain (promise)\/(finance) short-seller\/bear (market)\/short (selling)"],"pinyin":["kong1 tou2"],"word":"空头"},{"definition":["short term"],"pinyin":["duan3 xian4"],"word":"短线"},{"definition":["market price\/quotation of market price\/the current market situation"],"pinyin":["hang2 qing2"],"word":"行情"},{"definition":["rising trend\/upward momentum (e.g. in prices)"],"pinyin":["zhang3 shi4"],"word":"涨势"},{"definition":["tendency\/trend\/path"],"pinyin":["zou3 shi4"],"word":"走势"},{"definition":["to fall\/to tumble"],"pinyin":["xia4 die1"],"word":"下跌"},{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"word":"反弹"},{"definition":["(of a market index etc) to fall below (a given level)\/to be injured or damaged as a result of a fall"],"pinyin":["die1 po4"],"word":"跌破"},{"definition":["to rise\/to go up"],"pinyin":["shang4 zhang3"],"word":"上涨"},{"definition":["many-headed\/many-layered (authority)\/devolved (as opposed to centralized)\/pluralistic\/(as classifier) number of animals\/long term (finance)\/long (investment)"],"pinyin":["duo1 tou2"],"word":"多头"},{"definition":["short term\/short-term"],"pinyin":["duan3 qi1"],"word":"短期"},{"definition":["an upturn\/an upward trend"],"pinyin":["shang4 sheng1 qu1 shi4"],"word":"上升趋势"},{"definition":["to fall back (of water level or share prices)"],"pinyin":["hui2 die1"],"word":"回跌"},{"definition":["graph of average values"],"pinyin":["jun1 xian4"],"word":"均线"},{"definition":["bull market"],"pinyin":["duo1 tou2 shi4 chang2"],"word":"多头市场"},{"definition":["to fall back\/to return to low level after a rise (in water level, price etc)"],"pinyin":["hui2 luo4"],"word":"回落"}]}