{"definition":["to visit\/to pay a call to"],"pinyin":["kan4 wang4"],"traditional":["看望"],"rank":5833.0,"normalized_rank":0.08161123781008213,"fraction":0.000019267295014252702,"cumulative_fraction":0.8768357346214299,"word":"看望","characters":[{"definition":["to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)","to look after\/to take care of\/to watch\/to guard"],"pinyin":["kan4","kan1"],"word":"看"},{"definition":["full moon\/to hope\/to expect\/to visit\/to gaze (into the distance)\/to look towards\/towards","15th day of month (lunar calendar)\/old variant of 望[wang4]"],"pinyin":["wang4","wang4"],"word":"望"}],"containing_words":[],"sentences":[{"english":"I must ask you to still visit with me. My feelings inside do not change.","chinese":"我求你一定要经常看望我，我内心的感情没有变。"},{"english":"A frend is going to visit a girl you know well.","chinese":"一个朋友正准备去看望你很熟悉的一个女孩子。"},{"english":"Professor Li is often visited by his students.","chinese":"学生们常去看望李教授。"},{"english":"I'm going to call on one of my former classmates.","chinese":"我要去看望我的一位老同学。"},{"english":"Can we ask for leave to see our roommate in the hospital?","chinese":"我们能请假去医院看望我们同寝室的同学吗？"},{"english":"Did you come to London to see your family or for business purposes?","chinese":"你来伦敦是看望家人还是公干？"},{"english":"Jane visited her mother every Sunday afternoon.","chinese":"每周日下午简都有去看望她的母亲。"},{"english":"Just pull not see his face just good sisters.","chinese":"只不过是拉不下脸看望自己的好姐妹而已。"},{"english":"One morning, several weeks later, Professor Baglioni visited Giovanni.","chinese":"几周后的一个早晨，柏格罗尼教授来看望乔凡尼。"},{"english":"Nathan finally told Father Willenborg he did not want to see him.","chinese":"内森最后告诉韦伦伯格，他不想去看望他。"},{"english":"I'm go to visit my grorpare notnts the weekend?","chinese":"这个周末我打算去看望我的外祖爸妈。"},{"english":"He went to see his parents in the country every three weeks.","chinese":"他每隔两周去看望他乡下的父母。"},{"english":"I was visiting an aunt who had always been heavy.","chinese":"我去看望一位婶娘，他的身体一直超重。"},{"english":"I’ve spent the last few days visiting my Mom in St. Louis.","chinese":"前几天，我去看望住在圣路易斯的妈妈。"},{"english":"The picture shows Wang Guoqiang \"Green Harbour\" visit the children.","chinese":"图为王国强在“绿色港湾”看望孩子们。"},{"english":"You're right. Let's just get on. I'll see you outside before you see me.","chinese":"你所言极是，好好活下去，我将在外头第一个看望你。"}],"related":[{"definition":["to visit\/to call on sb\/to look around"],"pinyin":["tan4 wang4"],"word":"探望"},{"definition":["to express sympathy, greetings, consolation etc"],"pinyin":["wei4 wen4"],"word":"慰问"},{"definition":["to pay a visit\/to call on"],"pinyin":["bai4 fang3"],"word":"拜访"},{"definition":["to visit (a patient, prisoner etc)\/to look inquiringly"],"pinyin":["tan4 shi4"],"word":"探视"},{"definition":["to visit a sick person or patient"],"pinyin":["tan4 bing4"],"word":"探病"},{"definition":["specifically\/specially (for that purpose)"],"pinyin":["zhuan1 cheng2"],"word":"专程"},{"definition":["to take care of\/to show consideration\/to attend to\/to look after"],"pinyin":["zhao4 gu5"],"word":"照顾"},{"definition":["seriously ill"],"pinyin":["bing4 zhong4"],"word":"病重"},{"definition":["to go home to visit one's family"],"pinyin":["tan4 qin1"],"word":"探亲"},{"definition":["to go back to one's roots\/to return to one's native place\/by ext. to join one's ancestors (i.e. to die)"],"pinyin":["hui2 lao3 jia1"],"word":"回老家"},{"definition":["to accompany\/to keep sb company\/to assist\/old variant of 賠|赔[pei2]"],"pinyin":["pei2"],"word":"陪"},{"definition":["to (try to) find the time to"],"pinyin":["chou1 shi2 jian1"],"word":"抽时间"},{"definition":["to accompany"],"pinyin":["pei2 tong2"],"word":"陪同"},{"definition":["to look after\/to attend to\/to have in care"],"pinyin":["zhao4 kan4"],"word":"照看"},{"definition":["to send to\/to deliver to\/to give sb a lift (e.g. in a car)"],"pinyin":["song4 qu4"],"word":"送去"},{"definition":["to be critically ill\/to be terminally ill"],"pinyin":["bing4 wei1"],"word":"病危"}]}