{"definition":["to look after"],"pinyin":["kan1 guan3"],"traditional":["看管"],"rank":15017.0,"normalized_rank":0.21010731325115775,"fraction":0.000004142261139834188,"cumulative_fraction":0.9591033448234174,"word":"看管","characters":[{"definition":["to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)","to look after\/to take care of\/to watch\/to guard"],"pinyin":["kan4","kan1"],"word":"看"},{"definition":["variant of 管[guan3]","surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["guan3","Guan3","guan3"],"word":"管"}],"containing_words":[],"sentences":[{"english":"Lock up your daughters.","chinese":"一定看管好你的女儿。"},{"english":"The guard guards the guarantee in the garden regardless of the hazard.","chinese":"卫卒不顾风险看管着花园里的典质品。"},{"english":"He took with him several of his subordinates, and amongst them Dantès' jailer.","chinese":"他带走了几个下属，看管唐太斯的狱卒也在其中。"},{"english":"The accident happened at that unattended crossroads.","chinese":"事故发生在那个无人看管的平交道。"},{"english":"Then she left the cow to the care of a hundred eyed monster, Argus.","chinese":"赫拉便将牛犊托付给百眼魔鬼阿刚斯看管。"},{"english":"He used to oversee my place on the lake, and did it capitally, too.","chinese":"他替我看管湖边那所别墅，管理得非常出色。"},{"english":"Mom needs support! An impulsive three-year-old who needs constant supervision is taxing.","chinese":"需要一直看管着一个易冲动的三岁小孩是很费力的。"},{"english":"All the items are not allowed to carry, the invigilator is not responsible for the care of teachers.","chinese":"所有不准携带的物品，监考教师不负责看管。"},{"english":"Jane is charge of the office while Mr. Smith is away.","chinese":"当史密斯先生不在时，珍看管办公室。"},{"english":"He will be the caretaker of the snowbound Overlook Hotel.","chinese":"他将成为冰封的“眺望旅馆”的看管员。"},{"english":"She wished me to look after the house, to see callers, and answer notes of condolence.","chinese":"她希望我替她看管房子，接待来客，回复唁函。"},{"english":"I’ll have to keep a close eye on Chiellini, especially at set-pieces.","chinese":"我必须好好看管基耶利尼，尤其是定位球上。"},{"english":"He must look after his bag.","chinese":"他必须看管好自己的书包。"},{"english":"Monitor compliance with the corporate code of conduct\/business practices.","chinese":"看管公司对行为规范和商业通例的遵循水平。"},{"english":"Thus, they need to be closely supervised.","chinese":"因此，他们需要得到密切看管。"},{"english":"When the warden took charge, the prison had fewer than 100 inmates.","chinese":"在典狱官看管时，监狱中有不到100个狱友。"}],"related":[{"definition":["to nurse\/to look after\/to watch over\/(old) hospital nurse"],"pinyin":["kan1 hu4"],"word":"看护"},{"definition":["to guard\/to watch over"],"pinyin":["kan1 shou3"],"word":"看守"},{"definition":["to look after\/to attend to\/to have in care"],"pinyin":["zhao4 kan4"],"word":"照看"},{"definition":["to look after\/to provide for"],"pinyin":["zhao4 guan3"],"word":"照管"},{"definition":["sternly\/strictly\/harshly\/stringently\/rigorously"],"pinyin":["yan2 jia1"],"word":"严加"},{"definition":["to detain\/to take into custody\/to imprison temporarily"],"pinyin":["kan1 ya1"],"word":"看押"},{"definition":["to hold in safekeeping\/to have in one's care\/to guarantee\/certainly\/surely\/custodian\/curator"],"pinyin":["bao3 guan3"],"word":"保管"},{"definition":["to tend\/to take care of sb"],"pinyin":["zhao4 liao4"],"word":"照料"},{"definition":["to imprison\/to lock up (in jail)"],"pinyin":["guan1 ya1"],"word":"关押"},{"definition":["to tell\/to exhort\/injunction"],"pinyin":["zhu3 fu4"],"word":"嘱咐"},{"definition":["to send under escort\/to transport a detainee"],"pinyin":["ya1 song4"],"word":"押送"},{"definition":["to keep watch\/to do sentry duty\/to be on patrol"],"pinyin":["fang4 shao4"],"word":"放哨"},{"definition":["to monitor\/to keep a close watch over\/surveillance"],"pinyin":["jian1 shi4"],"word":"监视"},{"definition":["to warn repeatedly\/to urge\/to exhort again and again"],"pinyin":["ding1 zhu3"],"word":"叮嘱"},{"definition":["variant of 交代[jiao1 dai4]"],"pinyin":["jiao1 dai4"],"word":"交待"},{"definition":["to interrogate\/to examine\/to question"],"pinyin":["shen3 wen4"],"word":"审问"}]}