{"definition":["to enjoy watching a bustling scene\/to go where the crowds are"],"pinyin":["kan4 re4 nao5"],"traditional":["看熱鬧"],"rank":19610.0,"normalized_rank":0.27436934226910864,"fraction":0.000002489940381383977,"cumulative_fraction":0.9738851452992138,"word":"看热闹","characters":[{"definition":["to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)","to look after\/to take care of\/to watch\/to guard"],"pinyin":["kan4","kan1"],"word":"看"},{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"热"},{"definition":["variant of 鬧|闹[nao4]","noisy\/cacophonous\/to make noise\/to disturb\/to vent (feelings)\/to fall ill\/to have an attack (of sickness)\/to go in (for some activity)\/to joke"],"pinyin":["nao4","nao4"],"word":"闹"}],"containing_words":[{"definition":["while the connoisseur recognizes the artistry, the layman simply enjoys the show"],"pinyin":["nei4 hang2 kan4 men2 dao5 , wai4 hang2 kan4 re4 nao5"],"word":"内行看门道，外行看热闹"}],"sentences":[{"english":"Dilettante watch the scene of bustle, adept guard the entrance.","chinese":"外行看热闹，内行看门道。"},{"english":"When they fail, bystanders rejoice.","chinese":"当这些人失败的时候，那些看热闹的旁人会感到高兴。"},{"english":"As they were wouking , a couple of older bous stopped by to watch, \"What are you doing ?\"","chinese":"他们干得正欢的时，两个大孩子停在一边看热闹。"},{"english":"A large group of citizens gathered to watch the commotion.","chinese":"一大群市民聚集起来看热闹。"},{"english":"Every quarter of an hour the railway brought fresh accessions of sightseers .","chinese":"坦帕铁路每隔一刻钟载来一批看热闹的群众。"},{"english":"Rubber-necking at accidents on the opposite side of the road seem to cause most of the senseless traffic jams.","chinese":"对向车道看热闹的人引起了最多无意义的交通堵塞。"},{"english":"I heard noise and I went outside to see what happened.","chinese":"我一听到的爆炸声，就跑到外面去看热闹。"},{"english":"Do not go sightseeing through areas of damage. You will only  hamper the relief effort.","chinese":"不要穿越受灾区域去看热闹，这样只会妨碍救援行动。"},{"english":"As the saying goes, dilettante watch the scene of bustle, expert looks at the way.","chinese":"俗话说，外行看热闹，内行看门道。"},{"english":"Do not go sightseeing through areas of damage. You will only hamper the relief effort.","chinese":"不要穿越受灾区域去看热闹，这样只会妨碍救援行动。"},{"english":"There were only the passersby on the side watching the excitement and making comments.","chinese":"只有一帮闲人帮旁边看热闹指点江山。"},{"english":"Because many of them are cuirious, and shouted the sarcastic slogans.","chinese":"因为很多人都是看热闹的心态，还大喊讥讽性的口号。"},{"english":"In no case will they look on passively.","chinese":"他们决不会在一边看热闹。"},{"english":"The road is alive with lookers on.","chinese":"路上看热闹的人熙熙攘攘。"}],"related":[{"definition":["to join in the fun\/to get in on the action\/(fig.) to butt in\/to create more trouble"],"pinyin":["cou4 re4 nao5"],"word":"凑热闹"},{"definition":["to watch a play\/to watch passively (i.e. from the sidelines, from the crowd)"],"pinyin":["kan4 xi4"],"word":"看戏"},{"definition":["to stand in a circle and watch"],"pinyin":["wei2 guan1"],"word":"围观"},{"definition":["to watch with amusement as sb makes a fool of himself"],"pinyin":["kan4 xiao4 hua5"],"word":"看笑话"},{"definition":["to heckle\/rowdy jeering\/to create a disturbance"],"pinyin":["qi3 hong4"],"word":"起哄"},{"definition":["to discuss spiritedly (idiom)\/tongues are wagging"],"pinyin":["yi4 lun4 fen1 fen1"],"word":"议论纷纷"},{"definition":["the cool eye of a bystander\/a detached point of view"],"pinyin":["leng3 yan3 pang2 guan1"],"word":"冷眼旁观"},{"definition":["lit. to take joy in calamity and delight in disaster (idiom); fig. to rejoice in other people's misfortune\/Schadenfreude"],"pinyin":["xing4 zai1 le4 huo4"],"word":"幸灾乐祸"},{"definition":["to gesticulate\/to point out\/to point the finger of blame"],"pinyin":["zhi3 zhi3 dian3 dian3"],"word":"指指点点"},{"definition":["clamorous\/noisy\/sensational\/very exciting"],"pinyin":["nao4 hong1 hong1"],"word":"闹哄哄"},{"definition":["to wish for the whole world to be in chaos (idiom)"],"pinyin":["wei2 kong3 tian1 xia4 bu4 luan4"],"word":"唯恐天下不乱"},{"definition":["to make an (unnecessary) racket (idiom)"],"pinyin":["chao3 chao3 rang3 rang3"],"word":"吵吵嚷嚷"},{"definition":["to disperse in confusion (idiom)","see 一哄而散[yi1 hong1 er2 san4]"],"pinyin":["yi1 hong1 er2 san4","yi1 hong4 er2 san4"],"word":"一哄而散"},{"definition":["not to understand the situation\/unaware of the ins and outs"],"pinyin":["bu4 ming2 jiu4 li3"],"word":"不明就里"},{"definition":["to shout and quarrel\/to make a big fuss"],"pinyin":["da4 hu1 xiao3 jiao4"],"word":"大呼小叫"},{"definition":["lively discussion with everybody talking at once"],"pinyin":["qi1 zui3 ba1 she2"],"word":"七嘴八舌"}]}