{"definition":["to give thought (to others)\/to consider (other people's needs)\/also pr. [zhao2 xiang3]"],"pinyin":["zhuo2 xiang3"],"traditional":["著想"],"rank":12310.0,"normalized_rank":0.17223287115414213,"fraction":0.000005862899427655781,"cumulative_fraction":0.9457773834536674,"word":"着想","characters":[{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"},{"definition":["to think\/to believe\/to suppose\/to wish\/to want\/to miss (feel wistful about the absence of sb or sth)"],"pinyin":["xiang3"],"word":"想"}],"containing_words":[],"sentences":[{"english":"Miss Nien always has the best interests of her students at heart.","chinese":"粘老师总是处处为她学生的利益为着想。"},{"english":"Paul wants Christians to be governed by common sense that looks out for their fellow brother or sister.","chinese":"保罗要基督徒凭着常识为他们团契的弟兄姐妹着想。"},{"english":"He gropes for a lamp, tries to turn it on, knocks it over instead.","chinese":"男人摸索着想打开台灯，却弄翻了它。"},{"english":"Eager to get home, I took a shortcut through an alley.","chinese":"因为急着想回家，我就抄近路走小巷子。"},{"english":"For your own safety, do NOT see this man.","chinese":"因此，为了你的安全着想，请不要见这个男人。"},{"english":"Yet, young Chinese struggle to think for themselves.","chinese":"然而，年轻的中国人在为自己着想时却很费力气。"},{"english":"The highest SAN DE is in the interests of others.","chinese":"最高的圣德便是为旁人着想。"},{"english":"The rulers should consider the interests of the multitude.","chinese":"统治者要为黎民的利益着想。"},{"english":"I should scarcely have known you: you look like a lady now.","chinese":"然后她就四下里望着想找希刺克厉夫。"},{"english":"For your safety, please stand back from the door.","chinese":"为您的安全着想，请不要站在车门边。"},{"english":"Please be considerate. Keep this area clean and tidy. Flush after use.","chinese":"请为他人着想，请保持地方整洁，用后冲厕。"},{"english":"Wang Yao is anxious to find out the honeysuckle lumbago again.","chinese":"王耀急着想出门找忍冬，结果腰痛的老毛病又犯了。"},{"english":"He never considers others.","chinese":"他从不为别人着想。"},{"english":"Some people are not very considerate.","chinese":"有些人就是不替别人着想。"},{"english":"I'm trying to think of one interesting case.","chinese":"我试着想个有意思的例子。"},{"english":"For your safety the Mooncup is made from a special medical grade non-allergic silicone.","chinese":"为您的安全着想采用一种特殊医用级非过敏性有机硅。"}],"related":[{"definition":["to put oneself in sb else's shoes"],"pinyin":["she4 shen1 chu3 di4"],"word":"设身处地"},{"definition":["to take the big picture into consideration (idiom)\/to work for the benefits of all"],"pinyin":["gu4 quan2 da4 ju2"],"word":"顾全大局"},{"definition":["to take into consideration\/to attend to"],"pinyin":["gu4 ji2"],"word":"顾及"},{"definition":["to put oneself in sb else's shoes (idiom)"],"pinyin":["jiang1 xin1 bi3 xin1"],"word":"将心比心"},{"definition":["heart and soul\/wholeheartedly"],"pinyin":["quan2 xin1 quan2 yi4"],"word":"全心全意"},{"definition":["to substitute for\/to take the place of\/to replace\/for\/on behalf of\/to stand in for"],"pinyin":["ti4"],"word":"替"},{"definition":["to exculpate\/to absolve\/to exonerate"],"pinyin":["kai1 tuo1"],"word":"开脱"},{"definition":["making an all-out effort (idiom); to try one's heart out\/to do one's utmost"],"pinyin":["jin4 xin1 jin4 li4"],"word":"尽心尽力"},{"definition":["genuine and sincere (idiom)\/wholehearted"],"pinyin":["zhen1 xin1 shi2 yi4"],"word":"真心实意"},{"definition":["comprehensive\/thorough\/to bring one's help\/to assist"],"pinyin":["zhou1 quan2"],"word":"周全"},{"definition":["to attach most importance to"],"pinyin":["wei2 zhong4"],"word":"为重"},{"definition":["to empathize\/to allow (for sth)\/to show understanding\/to appreciate"],"pinyin":["ti3 liang4"],"word":"体谅"},{"definition":["to throw one's life in for\/to haplessly give one's life for\/to sacrifice oneself torturously working for another or for a group\/to pour in one's utmost effort\/to shed one's last ounce of strength for"],"pinyin":["mai4 ming4"],"word":"卖命"},{"definition":["to strive one's hardest\/to spare no effort"],"pinyin":["jin4 li4"],"word":"尽力"},{"definition":["to share tribulations\/to help sb with worries and difficulties"],"pinyin":["fen1 you1"],"word":"分忧"},{"definition":["to get the desired outcome\/to win favor by fawning on sb\/to curry favor with\/a fruitful outcome to reward one's labor"],"pinyin":["tao3 hao3"],"word":"讨好"}]}