{"definition":["to brace oneself to do sth\/to put a bold face on it\/to summon up courage\/to force oneself to"],"pinyin":["ying4 zhe5 tou2 pi2"],"traditional":["硬著頭皮"],"rank":22188.0,"normalized_rank":0.3104389069998461,"fraction":0.0000019270506522043665,"cumulative_fraction":0.9795322089227622,"word":"硬着头皮","characters":[{"definition":["hard\/stiff\/strong\/firm\/resolutely\/doggedly\/good (quality)\/able (person)\/(of food) filling\/substantial"],"pinyin":["ying4"],"word":"硬"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"},{"definition":["suffix for nouns","head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]"],"pinyin":["tou5","tou2"],"word":"头"},{"definition":["leather\/skin\/fur\/CL:張|张[zhang1]\/pico- (one trillionth)\/naughty","surname Pi"],"pinyin":["pi2","Pi2"],"word":"皮"}],"containing_words":[],"sentences":[{"english":"But our boss started to talk, curassow also has upgrade of toughen one's scalp-brace oneself to rush only.","chinese":"但是俺们老板都开口了，大鸟也只有硬着头皮往上冲。"},{"english":"Helen: Well, if you do something wrong, you could say ‘I didn’t finish my work, so I have to face the music.’","chinese":"就是说“我没做完功课，所以我得硬着头皮挨训了”。"},{"english":"Helpless, shine on a demon mirror to only have crustily skin of head, skill hold bomb to arrive at before.","chinese":"无奈，照妖镜只有硬着头皮，一手托着炸弹来到阵前。"},{"english":"You simply have to bite the bullet and do it.","chinese":"你只能硬着头皮做那事儿了。"},{"english":"The following week, I bite the bullet, and tell a few people.","chinese":"接下来的一个星期，我硬着头皮告诉了几个人。"},{"english":"In order to get beat their swords into plowshares and Nian sichuan crustily skin of head participation test.","chinese":"为了拿到玉帛，鲇川硬着头皮参与测试。"},{"english":"He bite the bullet and back home.","chinese":"他硬着头皮回到家里。"},{"english":"Today, I had to be the one to break it to my daughter that WWE fighting was staged.","chinese":"今天我硬着头皮跟女儿说其实WWE格斗也是分级的。"},{"english":"Youngly willing get is tiny hesitant, later on crustily the rind of head receive orders city.","chinese":"年轻的将领微微犹豫，随后硬着头皮领命下城。"},{"english":"We're short- staffed and everybody is under the gun.","chinese":"我们人手不够，人人都在硬着头皮干。"},{"english":"I only horizontal under a heart, crustily skin of head.","chinese":"我只有横下一条心，硬着头皮上了。"},{"english":"She twisted her hands together, then drove herself on across the road.","chinese":"她拧着双手，后来硬着头皮冲过马路去。"},{"english":"Since you have not retreats, I also have to bite the bullet and joined in.","chinese":"既然已经无法全身而退了，我也只好硬着头皮参加了。"},{"english":"We have to listen to a long sermon about not wasting money.","chinese":"我们硬着头皮听了一通不要浪费钱的大道理。"},{"english":"Example:It’s time to bite the bullet and admit that you did wrong.","chinese":"是你该硬着头皮承认错误的时候了。"},{"english":"He had come to a desperate decision.","chinese":"他硬着头皮决定去试试。"}],"related":[{"definition":["without any better option\/to have to\/to be forced to"],"pinyin":["zhi3 hao3"],"word":"只好"},{"definition":["to clench one's teeth\/to grind the teeth\/gnaw"],"pinyin":["yao3 ya2"],"word":"咬牙"},{"definition":["to have no alternative but to\/to be obliged to"],"pinyin":["zhi3 de2"],"word":"只得"},{"definition":["to act against one's will\/to have no alternative but to\/to have to\/to have no choice\/must"],"pinyin":["bu4 de2 yi3"],"word":"不得已"},{"definition":["lit. to drive a duck onto a perch (idiom)\/fig. to push sb to do sth way beyond their ability"],"pinyin":["gan3 ya1 zi5 shang4 jia4"],"word":"赶鸭子上架"},{"definition":["to have no other choice"],"pinyin":["bie2 wu2 xuan3 ze2"],"word":"别无选择"},{"definition":["unwilling"],"pinyin":["bu4 qing2 yuan4"],"word":"不情愿"},{"definition":["to tackle a difficult job (idiom)\/to do sth reluctantly"],"pinyin":["mian3 wei2 qi2 nan2"],"word":"勉为其难"},{"definition":["have no way out\/have no alternative\/abbr. to 無奈|无奈[wu2 nai4]"],"pinyin":["wu2 ke3 nai4 he2"],"word":"无可奈何"},{"definition":["to summon one's courage"],"pinyin":["gu3 qi3 yong3 qi4"],"word":"鼓起勇气"},{"definition":["to drop (subject etc)"],"pinyin":["zuo4 ba4"],"word":"作罢"},{"definition":["lit. to bite the teeth tightly (idiom); fig. to grit one's teeth and bear the pain\/to bite the bullet"],"pinyin":["yao3 jin3 ya2 guan1"],"word":"咬紧牙关"},{"definition":["angry\/resentful"],"pinyin":["xing4 xing4"],"word":"悻悻"},{"definition":["to make oneself do sth in spite of adversity, pain etc"],"pinyin":["ying4 cheng1"],"word":"硬撑"},{"definition":["trembling with fear\/with fear and trepidation"],"pinyin":["zhan4 zhan4 jing1 jing1"],"word":"战战兢兢"},{"definition":["you might as well (do it)\/simply\/just"],"pinyin":["suo3 xing4"],"word":"索性"}]}