{"definition":["to establish\/to institute"],"pinyin":["que4 li4"],"traditional":["確立"],"rank":4607.0,"normalized_rank":0.06445790718173296,"fraction":0.000027091111903544823,"cumulative_fraction":0.8489230604879288,"word":"确立","characters":[{"definition":["authenticated\/solid\/firm\/real\/true","variant of 確|确[que4]\/variant of 埆[que4]"],"pinyin":["que4","que4"],"word":"确"},{"definition":["surname Li","to stand\/to set up\/to establish\/to lay down\/to draw up\/at once\/immediately"],"pinyin":["Li4","li4"],"word":"立"}],"containing_words":[],"sentences":[{"english":"Since 2003, the Tourism-based Country Strategy has been established and implemented in Japan.","chinese":"自2003年以来，日本确立并实施了观光立国战略。"},{"english":"Plan law system's establishment should consider the times character of plan.","chinese":"计划法体系确立应考虑计划的时代特征。"},{"english":"Results The standard values of indicators for maternity care quality evaluation was successfully established.","chinese":"结果确立了产科护理质量评价指标的标准值。"},{"english":"The principle of orality is established as a basic principle in modern civil Procedural law.","chinese":"言词原则是近代民事诉讼法确立的一项重要原则。"},{"english":"In order to achieve this goal TheU.S. Constitution established the following two principles.","chinese":"为了达到这一目的，美国宪法确立了以下两条原则。"},{"english":"Establishing the quality standard of total flavone extracted from Wild jujube seed.","chinese":"确立了酸枣仁总黄酮提取物的质量标准。"},{"english":"The establishment of visitation right system is a big step forward in marriage and family legislation in our country.","chinese":"探望权制度的确立，是我国婚姻家庭立法上一大进步。"},{"english":"Establish effective preventive measures and corrective action to ensure that deficiencies do not re-occur.","chinese":"确立有效的预防措施和纠正措施，避免错误再次出现。"},{"english":"Education and social demand docking, the key is to establish the scientific attitude.","chinese":"教育和社会需求对接，关键是确立科学的人才观。"},{"english":"The literati almost all agree on establishing the Principle of Directness and Verbalism in China.","chinese":"学界对于直接言词原则的确立基本都持肯定的态度。"},{"english":"The perniciousness of act brought out the theory of illegal composition.","chinese":"行为的危害性确立了违法构成理论的产生。"},{"english":"It is necessary to establish strategy of adaptability type quality within enterprise.","chinese":"企业确立适应型质量战略十分必要。"},{"english":"create protocols on monitoring adverse effects for child-specific medicines.","chinese":"确立监测儿童专用药物不良影响的方案。"},{"english":"Established that proto-oncogenes play important roles in normal cellular control.","chinese":"确立原癌基因在正常细胞调控中的重要作用。"},{"english":"Setting goals is one of the most effective character-building tools God has given us.","chinese":"确立目标是上帝给我们塑造品格最有效的工具之一。"},{"english":"Once graduated from university, the purpose is to establish a career and work-up to the top.","chinese":"一旦大学毕业，目标就是确立职业，冲击事业高峰。"}],"related":[{"definition":["to establish\/to fix\/to settle"],"pinyin":["dian4 ding4"],"word":"奠定"},{"definition":["to establish\/to set up\/to found"],"pinyin":["jian4 li4"],"word":"建立"},{"definition":["clear-cut\/definite\/explicit\/to clarify\/to specify\/to make definite"],"pinyin":["ming2 que4"],"word":"明确"},{"definition":["leading\/dominant\/prevailing\/to lead\/to direct\/to dominate"],"pinyin":["zhu3 dao3"],"word":"主导"},{"definition":["base\/foundation\/basis\/underlying\/CL:個|个[ge4]"],"pinyin":["ji1 chu3"],"word":"基础"},{"definition":["to form\/to take shape"],"pinyin":["xing2 cheng2"],"word":"形成"},{"definition":["to consolidate\/consolidation\/to strengthen"],"pinyin":["gong3 gu4"],"word":"巩固"},{"definition":["to set up\/to establish"],"pinyin":["shu4 li4"],"word":"树立"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"构建"},{"definition":["progressively\/step by step"],"pinyin":["zhu2 bu4"],"word":"逐步"},{"definition":["to draw up\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制定"},{"definition":["core\/nucleus"],"pinyin":["he2 xin1"],"word":"核心"},{"definition":["definite\/certain\/fixed\/to fix (on sth)\/to determine\/to be sure\/to ensure\/to make certain\/to ascertain\/to clinch\/to recognize\/to confirm\/OK (on computer dialog box)"],"pinyin":["que4 ding4"],"word":"确定"},{"definition":["system\/setup\/CL:個|个[ge4]"],"pinyin":["ti3 xi4"],"word":"体系"},{"definition":["stable\/steady\/firm\/to stabilize"],"pinyin":["wen3 gu4"],"word":"稳固"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引领"}]}