{"definition":["to crush or compact by means of a roller"],"pinyin":["nian3 ya1"],"traditional":["碾壓"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"碾压","characters":[{"definition":["stone roller\/roller and millstone\/to grind\/to crush\/to husk"],"pinyin":["nian3"],"word":"碾"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya4","ya1"],"word":"压"}],"containing_words":[],"sentences":[{"english":"The rubble was moving. It was pressing down, slowly crushing them.","chinese":"瓦砾还在不断地向下滚动，碾压着他们的身体。"},{"english":"Crack resistance of two gradated RCC is better than that of three gradated RCC, and Crack resistance of RCC develops with age.","chinese":"随着龄期的增加，碾压混凝土的抗裂性能将得到提高。"},{"english":"The sandy gravel was filled in earth-rock dam and rolled by vibrating machine.","chinese":"土石坝填筑采用砂砾料，振动机械碾压。"},{"english":"Deformation properties are the important aspects to study crack resistance of RCC.","chinese":"变形性能是研究和分析碾压混凝土抗裂性的重要依据。"},{"english":"Research on the crack control measures of RCC dam in the view of structure.","chinese":"本文从结构方面进行了碾压混凝土坝防裂措施的研究。"},{"english":"The spillway face are RCC benched spillway face.","chinese":"溢流坝面为碾压混凝土台阶式溢流面。"},{"english":"Research on the crack control measures in the view of material.","chinese":"本文从材料方面进行了碾压混凝土坝防裂措施的研究。"},{"english":"Roller crushed concrete is adopted first within our country in dams with bottom conduits in Guanyinge reservoir.","chinese":"观音阁水库底孔坝段采用碾压混凝土尚属国内首例。"},{"english":"Special carbon paper rolled carbon paper to transfer device on the gravure cylinder.","chinese":"专门的炭素纸转移装置将炭素纸碾压到凹印滚筒上。"},{"english":"Do you know how many Gods and Monsters have been drowned under the waves of past eras?","chinese":"知否多少神怪，被时代无情的车轮碾压而过？"},{"english":"British Sandbags can be crushed normally by light crush vehicles.","chinese":"英军沙包现在能被轻型车辆正常碾压。"},{"english":"A pile of crushed cushions remained to show where Illyrio had sprawled.","chinese":"一堆皱皱巴巴的靠枕依稀辨得出伊利里欧曾经的碾压。"},{"english":"This glass is ground under water using pestle and mortar.","chinese":"玻璃在水下被杵和臼碾压。"},{"english":"The Linhekou Hydropower Station has a RCC double-curvature arch dam.","chinese":"蔺河口水电站大坝为碾压混凝土双曲拱坝。"},{"english":"The result of braking extruded powder coating after cooling.","chinese":"对挤出的粉末涂料冷却后碾压的结果。"},{"english":"For the RCC dam of Taolinkou Reservoir, RCC was developed in the conventional concrete.","chinese":"桃林口水库碾压混凝土坝为“金包银”形式。"}],"related":[{"definition":["to hang sb up and beat him"],"pinyin":["diao4 da3"],"word":"吊打"},{"definition":["(Internet) flash sale\/(sports or online gaming) rapid dispatch of an opponent"],"pinyin":["miao3 sha1"],"word":"秒杀"},{"definition":["to sweep away\/to sweep across"],"pinyin":["heng2 sao3"],"word":"横扫"},{"definition":["to overwhelm\/to overpower\/overwhelming"],"pinyin":["ya1 dao3"],"word":"压倒"},{"definition":["unequalled\/without rival\/a paragon"],"pinyin":["wu2 di2"],"word":"无敌"},{"definition":["unsurpassed\/unparalleled"],"pinyin":["wu2 ke3 pi3 di2"],"word":"无可匹敌"},{"definition":["to shake up\/to deal a shock\/(fig.) to stir (sb's heart)"],"pinyin":["han4 dong4"],"word":"撼动"},{"definition":["to sweep everything before one\/to be invincible (idiom)"],"pinyin":["suo3 xiang4 pi1 mi3"],"word":"所向披靡"},{"definition":["to blow out\/to blow off\/(computer games) to zap\/(phone) to ring off the hook\/to be jammed\/to max out (credit card etc)"],"pinyin":["da3 bao4"],"word":"打爆"},{"definition":["see 勢不可當|势不可当[shi4 bu4 ke3 dang1]"],"pinyin":["shi4 bu4 ke3 dang3"],"word":"势不可挡"},{"definition":["to overtake"],"pinyin":["gan3 chao1"],"word":"赶超"},{"definition":["valiant"],"pinyin":["qiang2 han4"],"word":"强悍"},{"definition":["overwhelming"],"pinyin":["ya1 dao3 xing4"],"word":"压倒性"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya4","ya1"],"word":"压"},{"definition":["to defeat\/to smash\/to rout"],"pinyin":["ji1 kui4"],"word":"击溃"},{"definition":["to have the advantage overwhelmingly on one side\/to support unconditionally"],"pinyin":["yi1 bian1 dao3"],"word":"一边倒"}]}