{"definition":["mythological story\/myth"],"pinyin":["shen2 hua4 gu4 shi5"],"traditional":["神話故事"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"神话故事","characters":[{"definition":["God\/abbr. for 神舟[Shen2 zhou1]","deity\/soul\/spirit\/unusual\/mysterious\/lively\/expressive\/expression\/look\/CL:個|个[ge4]\/(slang) awesome\/amazing"],"pinyin":["Shen2","shen2"],"word":"神"},{"definition":["dialect\/language\/spoken words\/speech\/talk\/words\/conversation\/what sb said\/CL:種|种[zhong3],席[xi2],句[ju4],口[kou3],番[fan1]","old variant of 話|话[hua4]"],"pinyin":["hua4","hua4"],"word":"话"},{"definition":["happening\/instance\/reason\/cause\/intentional\/former\/old\/friend\/therefore\/hence\/(of people) to die, dead"],"pinyin":["gu4"],"word":"故"},{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"}],"containing_words":[],"sentences":[{"english":"Reading these same stories mythologically, however, can bring forth their universal qualities.","chinese":"然而，这些相同的神话故事也展示了他们的普遍特征。"},{"english":"Mythology adds a richness of detail and a concreteness to metaphorical language.","chinese":"神话故事增加了大量的细节描述和一个寓意。"},{"english":"The child devours fairy tales.","chinese":"小孩贪婪地倾听神话故事。"},{"english":"What he said sounded like a fairy-tale.","chinese":"他所说的话听起来就像神话故事。"},{"english":"It does not draw from real life, it only creates myths.","chinese":"它只是创造神话故事。"},{"english":"A nurse’s fairy-tales are accepted as the gospel truth.","chinese":"保姆的神话故事被当作福音书中的真理而接受。"},{"english":"Old Mrs. Mingott's foreign daughters had become a legend.","chinese":"老明戈特太太的两个外籍女儿成了一则神话故事。"},{"english":"MAGIC】In fairy tales witches often use magic to change persons into animals or birds.","chinese":"在神话故事中，巫婆常使用魔术将人变成动物或鸟。"},{"english":"Legend of the White Snake is one of the most famous tales spreading out among folks in ancient China.","chinese":"白蛇传是流传在古代中国非常著名的一个神话故事。"},{"english":"The teacher regaled the children with some fairy tales.","chinese":"老师讲了些神话故事，孩子们听得津津有味。"},{"english":"The legend Chang Er Flying to the Moon is a beautiful fable of ancient China.","chinese":"嫦娥奔月的传说是中国古代一个美丽的神话故事。"},{"english":"In Chapter Two, regenerationout of death is strongly implied through the religious and mythical stories embedded in the poem.","chinese":"第二章从诗歌贯穿始终的宗教和神话故事角度分析。"},{"english":"He depicted traditional Chinese folk tales or historical stories to hint obliquely at contemporary realist themes.","chinese":"都是以历史或神话故事影射现实的主题性创作。"},{"english":"Then put it like fairy tales, one angel, one demon.","chinese":"那么就像神话故事中所言，一是天使，一是魔鬼。"}],"related":[{"definition":["folk story\/folktale"],"pinyin":["min2 jian1 gu4 shi5"],"word":"民间故事"},{"definition":["popular tradition\/folk legend"],"pinyin":["min2 jian1 chuan2 shuo1"],"word":"民间传说"},{"definition":["legend\/folklore\/to repeat from mouth to mouth\/they say that..."],"pinyin":["chuan2 shuo1"],"word":"传说"},{"definition":["Classic of Mountain and Sea, probably compiled c. 500 BC-200 BC, contains wide range of geography, mythology, witchcraft, popular customs etc"],"pinyin":["Shan1 hai3 Jing1"],"word":"山海经"},{"definition":["Investiture of the Gods, major Ming dynasty vernacular novel of mythology and fantasy, very loosely based on King Wu of Zhou's 周武王[Zhou1 Wu3 wang2] overthrow of the Shang, subsequent material for opera, film, TV series, computer games etc"],"pinyin":["Feng1 shen2 Yan3 yi4"],"word":"封神演义"},{"definition":["fairy tale"],"pinyin":["tong2 hua4 gu4 shi4"],"word":"童话故事"},{"definition":["spirits and devils (usually harmful)\/demon"],"pinyin":["shen2 guai4"],"word":"神怪"},{"definition":["supernatural novel\/novel of ghosts and goblins"],"pinyin":["shen2 mo2 xiao3 shuo1"],"word":"神魔小说"},{"definition":["classical story or quote from the literature\/the story behind sth"],"pinyin":["dian3 gu4"],"word":"典故"},{"definition":["Strange Stories from a Chinese Studio, Qing dynasty book of tales by 蒲松齡|蒲松龄[Pu2 Song1 ling2]"],"pinyin":["Liao2 zhai1 Zhi4 yi4"],"word":"聊斋志异"},{"definition":["Journey to the West, Ming dynasty novel by Wu Cheng'en 吳承恩|吴承恩, one of the Four Classic Novels of Chinese literature\/also called Pilgrimage to the West or Monkey"],"pinyin":["Xi1 you2 Ji4"],"word":"西游记"},{"definition":["lit. mythical bird Jingwei tries to fill the ocean with stones (idiom); futile ambition\/task of Sisyphus\/determination in the face of impossible odds"],"pinyin":["Jing1 wei4 tian2 hai3"],"word":"精卫填海"},{"definition":["fable\/CL:則|则[ze2]"],"pinyin":["yu4 yan2"],"word":"寓言"},{"definition":["narrative\/story\/tale","old practice\/CL:個|个[ge4]"],"pinyin":["gu4 shi5","gu4 shi4"],"word":"故事"},{"definition":["historical person"],"pinyin":["li4 shi3 ren2 wu4"],"word":"历史人物"},{"definition":["In Search of the Supernatural, compilation of legends about spirits, ghosts and other supernatural phenomena, written and compiled by 干寶|干宝[Gan1 Bao3] in Jin dynasty"],"pinyin":["Sou1 shen2 Ji4"],"word":"搜神记"}]}