{"definition":["remarkable ability\/magical power"],"pinyin":["shen2 tong1"],"traditional":["神通"],"rank":36444.0,"normalized_rank":0.509898842919704,"fraction":5.313585617774331e-7,"cumulative_fraction":0.9948692322368022,"word":"神通","characters":[{"definition":["God\/abbr. for 神舟[Shen2 zhou1]","deity\/soul\/spirit\/unusual\/mysterious\/lively\/expressive\/expression\/look\/CL:個|个[ge4]\/(slang) awesome\/amazing"],"pinyin":["Shen2","shen2"],"word":"神"},{"definition":["to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc","classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)"],"pinyin":["tong1","tong4"],"word":"通"}],"containing_words":[{"definition":["to possess great magical power\/to possess remarkable abilities"],"pinyin":["shen2 tong1 guang3 da4"],"word":"神通广大"},{"definition":["to display one's remarkable skill or prowess\/to give full play to one's brilliant abilities"],"pinyin":["da4 xian3 shen2 tong1"],"word":"大显神通"},{"definition":["lit. the Eight Immortals cross the sea, each showing his own special talent (idiom)\/fig. (of each individual in a group) to give full play to one's unique capabilities"],"pinyin":["Ba1 xian1 guo4 hai3 , ge4 xian3 shen2 tong1"],"word":"八仙过海，各显神通"}],"sentences":[{"english":"Large market with small commodity is the blue-chip feature of its regional economy.","chinese":"小商品，大市场，区域经济各显神通。"},{"english":"By the evening of the 16th the subtle hand of Hurstwood had made itself apparent.","chinese":"到了16日晚上，赫斯渥已经巧妙地大显神通。"},{"english":"Nuwa not only to the day of salvation, but also in creation, work miracles.","chinese":"女娲不但补天救世，还创造万物，神通广大。"},{"english":"I was no longer Lucy who knew what was best for everyone else.","chinese":"我不再是知道那个神通广大的露西了。"},{"english":"Lee is a person who would spend money secretly to make people believe he was infinitely capable and influential.","chinese":"他背地里花钱，为要人们相信他神通广大，有权有势。"},{"english":"Dipa Ma's abbilities in this regard were once tested by a third party.","chinese":"蒂帕嬷的这方面的神通曾由第三方测试过。"},{"english":"To shake off the crisis, literary journals find their different ways.","chinese":"为摆脱生存危机，文学期刊各显神通。"},{"english":"If there’s a new Avatar, that means Aang has passed on.","chinese":"既然新神通登场，那就意味着安昂已经过世。"},{"english":"This engineer showed his magic power in his work.","chinese":"在工作中，这位工程师大显神通。"},{"english":"Developing the base of power endowed with concentration founded on intent &the fabrications of exertion.","chinese":"基于意志和勤行而开发具有定之神通基础。"},{"english":"Unless destroy a magical power rank, Grey UGG Boots, probably just can thoroughly put on Yin spirit.","chinese":"除非突破神通阶，或许才能彻底抹去阴气吧。"},{"english":"Living quite minute to finish the magical power now to make the farmland large to too feel unimaginable.","chinese":"生秋毫毕现的神通让田宏也感觉到不可思议。"},{"english":"It's the kind of dream you'd expect from a Web wunderkind .","chinese":"赚大钱的梦想，只能指望网络神通了。"},{"english":"A person whose true spirit is awakened is a being of wisdom, even though he may not have theurgies .","chinese":"没有神通的人只要元神觉醒，他的生命就是智慧生命。"},{"english":"Aryan gods were not expected to work miracles or control men's lives.","chinese":"指望雅利神什神通奇迹，者配活。"},{"english":"You're big in Naas. You haven't bought off any judges, have you?","chinese":"你在纳斯神通广大。你没有买通过什么法官吧，是吗？"}],"related":[{"definition":["gate to enlightment (Buddhism)\/Buddhism\/way\/method\/(old) south gate of a palace"],"pinyin":["fa3 men2"],"word":"法门"},{"definition":["magic power"],"pinyin":["fa3 li4"],"word":"法力"},{"definition":["primordial spirit\/fundamental essence of life"],"pinyin":["yuan2 shen2"],"word":"元神"},{"definition":["marvelous\/wondrous"],"pinyin":["shen2 miao4"],"word":"神妙"},{"definition":["time immemorial\/origin of the universe\/the world"],"pinyin":["hun4 yuan2"],"word":"混元"},{"definition":["to bid farewell\/tricks of the trade\/pithy mnemonic formula (e.g. Mao Zedong's 16-character mantra 十六字訣|十六字诀 on guerrilla warfare)"],"pinyin":["jue2"],"word":"诀"},{"definition":["(honorific appellation of a deity)"],"pinyin":["tian1 zun1"],"word":"天尊"},{"definition":["demonic\/devil"],"pinyin":["tian1 mo2"],"word":"天魔"},{"definition":["Mahayana, the Great Vehicle\/Buddhism based on the Mayahana sutras, as spread to Central Asia, China and beyond\/also pr. [Da4 cheng2]"],"pinyin":["Da4 sheng4"],"word":"大乘"},{"definition":["amazing powers\/miraculous skill"],"pinyin":["shen2 gong1"],"word":"神功"},{"definition":["skills acquired through religious practice\/(fig.) ability\/skill\/Taiwan pr. [dao4 hang5]"],"pinyin":["dao4 heng2"],"word":"道行"},{"definition":["soul"],"pinyin":["ling2 ti3"],"word":"灵体"},{"definition":["occult force\/the power of a God or spirit"],"pinyin":["shen2 li4"],"word":"神力"},{"definition":["good luck\/Nature (as the mother of all things)"],"pinyin":["zao4 hua4"],"word":"造化"},{"definition":["supreme"],"pinyin":["wu2 shang4"],"word":"无上"},{"definition":["magic"],"pinyin":["fa3 shu4"],"word":"法术"}]}