{"definition":["a learned person need not leave his home to know what's going on in the world (idiom)"],"pinyin":["xiu4 cai5 bu4 chu1 men2 , quan2 zhi1 tian1 xia4 shi4"],"traditional":["秀才不出門，全知天下事"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"秀才不出门，全知天下事","characters":[{"definition":["handsome\/refined\/elegant\/graceful\/superior\/show (loanword)\/CL:場|场[chang2]\/(literary) to grow\/to bloom\/(of crops) to produce ears"],"pinyin":["xiu4"],"word":"秀"},{"definition":["ability\/talent\/sb of a certain type\/a capable individual\/only\/only then\/just now","a moment ago\/just now\/(indicating sth happening later than expected)\/(preceded by a clause of condition or reason) not until\/(followed by a numerical clause) only"],"pinyin":["cai2","cai2"],"word":"才"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["men2","Men2"],"word":"门"},{"word":"，"},{"definition":["all\/whole\/entire\/every\/complete","surname Quan"],"pinyin":["quan2","Quan2"],"word":"全"},{"definition":["to know\/to be aware"],"pinyin":["zhi1"],"word":"知"},{"definition":["day\/sky\/heaven"],"pinyin":["tian1"],"word":"天"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"}],"containing_words":[],"sentences":[],"related":[{"definition":["an elaborate string of references\/many quotations"],"pinyin":["fan2 zheng1 bo2 yin3"],"word":"繁征博引"},{"definition":["without proof one can't believe it (idiom)"],"pinyin":["wu2 zheng1 bu4 xin4"],"word":"无征不信"},{"definition":["lit. the scholar buys a donkey (idiom); fig. long-winded verbiage that never gets to the point\/idiom mocking scholastic pomposity"],"pinyin":["bo2 shi4 mai3 lu:2"],"word":"博士买驴"},{"definition":["don't let rhetoric spoil the message (idiom); don't get carried away with flowery speech to the detriment of what you want to say"],"pinyin":["bu4 yi3 ci2 hai4 zhi4"],"word":"不以辞害志"},{"definition":["never move your four limbs, can't distinguish the five crops (idiom); living as a parasite"],"pinyin":["si4 ti3 bu4 qin2 , wu3 gu3 bu4 fen1"],"word":"四体不勤，五谷不分"},{"definition":["lit. to build a cart behind closed doors\/to be overly subjective and disregard the outside world (idiom)"],"pinyin":["bi4 men2 zao4 che1"],"word":"闭门造车"},{"definition":["To learn without thinking is confusing, to think without learning is dangerous (Confucius)"],"pinyin":["xue2 er2 bu4 si1 ze2 wang3 , si1 er2 bu4 xue2 ze2 dai4"],"word":"学而不思则罔，思而不学则殆"},{"definition":["the rich man cannot be benevolent (idiom, from Mencius). It is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of heaven (Matthew 19:24)."],"pinyin":["wei2 ren2 bu4 fu4"],"word":"为仁不富"},{"definition":["lit. to catch sparrows blindfolded (idiom)\/fig. to act blindly"],"pinyin":["bi4 se4 yan3 jing1 zhuo1 ma2 que4"],"word":"闭塞眼睛捉麻雀"},{"definition":["to alter a text indiscriminately (idiom)\/to make irresponsible criticism"],"pinyin":["wang4 xia4 ci2 huang2"],"word":"妄下雌黄"},{"definition":["to respect Gods and demons from a distance (idiom); to remain at a respectful distance"],"pinyin":["jing4 gui3 shen2 er2 yuan3 zhi1"],"word":"敬鬼神而远之"},{"definition":["If one is industrious, one will not be in want. (idiom)"],"pinyin":["qin2 ze2 bu4 kui4"],"word":"勤则不匮"},{"definition":["lit. to hear one and know ten (idiom); fig. explain one thing and (he) understands everything\/a word to the wise"],"pinyin":["wen2 yi1 zhi1 shi2"],"word":"闻一知十"},{"definition":["if it's plowing, ask the laborer (idiom); when managing a matter, consult the appropriate specialist"],"pinyin":["geng1 dang1 wen4 nu2"],"word":"耕当问奴"},{"definition":["to dig into piles of outdated writings (idiom); to study old books and papers"],"pinyin":["zuan1 gu4 zhi3 dui1"],"word":"钻故纸堆"},{"definition":["lit. Ying writes a letter and Yan reads it\/fig. to misinterpret the original meaning\/to pile up errors\/refers to the letter from capital 郢[Ying3] of 楚[Chu3] in which the inadvertent words \"hold up the candle\" are mistaken by the minister of 燕[Yan1] as \"promote the wise\""],"pinyin":["Ying3 shu1 Yan1 shuo1"],"word":"郢书燕说"}]}