{"definition":["a person who has passed the county level imperial exam (historical)\/scholar\/skillful writer\/fine talent"],"pinyin":["xiu4 cai5"],"traditional":["秀才"],"rank":23129.0,"normalized_rank":0.3236047178654877,"fraction":0.0000017609281128354873,"cumulative_fraction":0.981266452909318,"word":"秀才","characters":[{"definition":["handsome\/refined\/elegant\/graceful\/superior\/show (loanword)\/CL:場|场[chang2]\/(literary) to grow\/to bloom\/(of crops) to produce ears"],"pinyin":["xiu4"],"word":"秀"},{"definition":["ability\/talent\/sb of a certain type\/a capable individual\/only\/only then\/just now","a moment ago\/just now\/(indicating sth happening later than expected)\/(preceded by a clause of condition or reason) not until\/(followed by a numerical clause) only"],"pinyin":["cai2","cai2"],"word":"才"}],"containing_words":[{"definition":["a learned person need not leave his home to know what's going on in the world (idiom)"],"pinyin":["xiu4 cai5 bu4 chu1 men2 , quan2 zhi1 tian1 xia4 shi4"],"word":"秀才不出门，全知天下事"},{"definition":["a learned person need not leave his home to know what's going on in the world (idiom)"],"pinyin":["xiu4 cai5 bu4 chu1 men2 , neng2 zhi1 tian1 xia4 shi4"],"word":"秀才不出门，能知天下事"}],"sentences":[{"english":"Hanhan's neighbor, usually didn't socialize much and scholar.","chinese":"憨憨与秀才是邻居，平时来往不多。"},{"english":"This magnificent flower plants, where a scholar like the Poor?","chinese":"这株花富丽堂皇，那里像个落第秀才了？"},{"english":"By the Tang dynasty, the scholar is often a kind of test subjects.","chinese":"到了唐朝初年，秀才是常科考试的一种。"},{"english":"Agencies say, Heartbroken, the burden back to the shop up to go home.","chinese":"秀才一听，心灰意冷，回店收拾包袱准备回家。"},{"english":"One scholar third go to the capital sitting the imperial examinations, and live in a regular live stores.","chinese":"有位秀才第三次进京赶考，住在一个经常住的店里。"},{"english":"Zhang stayed at the Liang's for a month.","chinese":"张秀才在梁家住了一个月。"},{"english":"Sui Dynasty began to open branches to take disabilities, also taking the first scholar.","chinese":"隋朝开始开科取士，最初亦为取秀才。"},{"english":"Have place Xiucai third time to go to the capital rushing firmly having a test in, within a store who often lives.","chinese":"有位秀才第三次进京赶考，住在一个经常住的店里。"},{"english":"A scholar, disheartened, returned home ready to pack up shop.","chinese":"秀才一听，心灰意冷，回店收拾包袱准备回家。"}],"related":[{"definition":["graduate\/successful candidate in the imperial provincial examination"],"pinyin":["ju3 ren2"],"word":"举人"},{"definition":["candidate who has not yet passed the county level imperial exam"],"pinyin":["tong2 sheng1"],"word":"童生"},{"definition":["successful candidate in the highest imperial civil service examination\/palace graduate"],"pinyin":["jin4 shi4"],"word":"进士"},{"definition":["scholar preparing for imperial examinations (in former times)"],"pinyin":["sheng1 yuan2"],"word":"生员"},{"definition":["to pass an exam"],"pinyin":["kao3 zhong4"],"word":"考中"},{"definition":["candidate for the Imperial Examination proposed by a tributary state"],"pinyin":["gong4 sheng1"],"word":"贡生"},{"definition":["the triennial provincial imperial exam during the Ming and Qing"],"pinyin":["xiang1 shi4"],"word":"乡试"},{"definition":["first-placed candidate in the provincial imperial examinations (old)"],"pinyin":["jie4 yuan2"],"word":"解元"},{"definition":["to pass the provincial level imperial examination"],"pinyin":["zhong4 ju3"],"word":"中举"},{"definition":["successful military candidate in the imperial provincial examination"],"pinyin":["wu3 ju3"],"word":"武举"},{"definition":["scholar\/intellectual"],"pinyin":["du2 shu1 ren2"],"word":"读书人"},{"definition":["imperial examination"],"pinyin":["ke1 ju3"],"word":"科举"},{"definition":["title of the temporary position in the Hanlin Academy, conferred to meritorious candidates until the next examination"],"pinyin":["shu4 ji2 shi4"],"word":"庶吉士"},{"definition":["(old) candidate who has successfully passed the first grades of the examination system, but not yet the court examination (殿試|殿试[dian4 shi4])"],"pinyin":["gong4 shi4"],"word":"贡士"},{"definition":["official\/scholar (old)"],"pinyin":["shi4 zi3"],"word":"士子"},{"definition":["scholar\/intellectual\/egghead"],"pinyin":["shu1 sheng1"],"word":"书生"}]}