{"definition":["to take orders\/to receive commands\/to carry on (a tradition)"],"pinyin":["bing3 cheng2"],"traditional":["秉承"],"rank":10060.0,"normalized_rank":0.14075245197487166,"fraction":0.00000818525749340226,"cumulative_fraction":0.9301910462645137,"word":"秉承","characters":[{"definition":["surname Bing","to grasp\/to hold\/to maintain"],"pinyin":["Bing3","bing3"],"word":"秉"},{"definition":["to bear\/to carry\/to hold\/to continue\/to undertake\/to take charge\/owing to\/due to\/to receive","surname Cheng\/Cheng (c. 2000 BC), third of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God"],"pinyin":["cheng2","Cheng2"],"word":"承"}],"containing_words":[],"sentences":[{"english":"Door-to-door service is the consistent style of our shop.","chinese":"这部小说秉承了他一贯的沉抑风格。"},{"english":"Innovation is a recognized part of Motorola's 75-year heritage.","chinese":"年来，摩托罗拉一直秉承着创新的传统。"},{"english":"YanChong adhering to the idea love is omnipotent, then use their cell phones the braille.","chinese":"言重秉承爱是无所不能的想法，便用手机拍下点字。"},{"english":"This may seem at odds with the value we place on relevant text-based ads.","chinese":"这似乎和我们秉承的文本关联广告模式有些冲突。"},{"english":"Shanghang talent network adhering to the \"people-centered innovation.\"","chinese":"上杭人才网秉承“以人为中心，开拓创新。”"},{"english":"Huang Weimin's calligraphy bases on the tradition, to seek the aroma and be full of classic.","chinese":"黄卫民的书法，秉承传统，追求古韵，蕴藉经典。"},{"english":"The principle of the Olympics must be upheld, that is, the Olympic Games should not be politicized.","chinese":"我们要秉承奥运会的宗旨，就是不能把奥运会政治化。"},{"english":"LSBF enjoys a stated mission to develop students to become global leaders.","chinese":"LSBF秉承以培养全球领袖为目标的办学理念。"},{"english":"She works in theatre, following in her father's footsteps.","chinese":"她秉承父业，也从事戏剧工作。"},{"english":"In imperial times, the critical tradition was carried forward by such scholars as Huang Zongxi.","chinese":"在帝王时代，黄宗羲等学者秉承批评传统。"},{"english":"Like most of her recordings, both are issued by Sony Masterworks.","chinese":"秉承一贯传统，由索尼古典音乐录制及发行。"},{"english":"My hotel, too, had absorbed some of this ancient inertia.","chinese":"我住的旅馆也秉承了某些古老的惰性。"},{"english":"The company always adheres to the quality policy of \"superior quality\".","chinese":"公司秉承“万力优质”的质量方针。"},{"english":"He hoped that the Diet's Japan-China Friendship League could carry forward the friendly tradition and continue to play active role in this field.","chinese":"希望日中议联秉承友好传统，继续发挥积极作用。"},{"english":"We work with integrity and put our best effort into every job.","chinese":"我们秉承诚信原则，对每一件事的倾注全力。"},{"english":"Fuyuan Chemical adheres to quality policy of\"quality first, customer first\".","chinese":"富苑化工秉承“质量为本，用户至上”的经营理念。"}],"related":[{"definition":["to uphold\/to hold fast to"],"pinyin":["bing3 chi2"],"word":"秉持"},{"definition":["idea\/concept\/philosophy\/theory"],"pinyin":["li3 nian4"],"word":"理念"},{"definition":["objective\/aim\/goal"],"pinyin":["zong1 zhi3"],"word":"宗旨"},{"definition":["based on...\/in conformance with..\/taking as one's main principle"],"pinyin":["ben3 zhe5"],"word":"本着"},{"definition":["people-oriented"],"pinyin":["yi3 ren2 wei2 ben3"],"word":"以人为本"},{"definition":["to scrupulously abide by"],"pinyin":["ke4 shou3"],"word":"恪守"},{"definition":["to practice\/to put into practice"],"pinyin":["jian4 xing2"],"word":"践行"},{"definition":["to pursue (a course, a policy)"],"pinyin":["feng4 xing2"],"word":"奉行"},{"definition":["variant of 秉承[bing3 cheng2]"],"pinyin":["bing3 cheng2"],"word":"禀承"},{"definition":["consistent\/constant\/from start to finish\/all along\/persistent"],"pinyin":["yi1 guan4"],"word":"一贯"},{"definition":["traceable to the same stock (idiom); of a common origin (of trends, ideas etc)"],"pinyin":["yi1 mai4 xiang1 cheng2"],"word":"一脉相承"},{"definition":["to advocate\/to initiate\/to propose\/to be a proponent of (an idea or school of thought)"],"pinyin":["chang4 dao3"],"word":"倡导"},{"definition":["to follow\/to abide by\/to comply with\/compliance"],"pinyin":["zun1 xun2"],"word":"遵循"},{"definition":["to develop\/to make full use of"],"pinyin":["fa1 yang2"],"word":"发扬"},{"definition":["to implement\/to put into practice\/to carry out"],"pinyin":["guan4 che4"],"word":"贯彻"},{"definition":["to perfect sth that is already outstanding (idiom); constantly improving"],"pinyin":["jing1 yi4 qiu2 jing1"],"word":"精益求精"}]}