{"definition":["imperial examination system"],"pinyin":["ke1 ju3 zhi4"],"traditional":["科舉制"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"科举制","characters":[{"definition":["branch of study\/administrative section\/division\/field\/branch\/stage directions\/family (taxonomy)\/rules\/laws\/to mete out (punishment)\/to levy (taxes etc)\/to fine sb\/CL:個|个[ge4]"],"pinyin":["ke1"],"word":"科"},{"definition":["to lift\/to hold up\/to cite\/to enumerate\/to act\/to raise\/to choose\/to elect\/act\/move\/deed","variant of 舉|举[ju3]"],"pinyin":["ju3","ju3"],"word":"举"},{"definition":["to manufacture\/to make","system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4","zhi4"],"word":"制"}],"containing_words":[],"sentences":[{"english":"The imperial examination system's rise and fall, was closely related with our culture.","chinese":"科举制度的盛衰，与我国文化传统密切相关。"},{"english":"I think mainly when taking a disability from the eight-legged essay in the examination system to explore.","chinese":"我以为主要当从八股文取士的科举制度中去探寻。"},{"english":"The imperial examination system in the Tang Dynasty left a cross-age impact on the intellectual selection in China.","chinese":"唐代科举制度在中国选士制度史上有着划时代的意义。"},{"english":"The weak points of the imperial examination system cannot be regarded as the reason for negative rationality of the Eight - part Essay stylistic style.","chinese":"科举制度的弊端不能成为否定八股文体合理性的理由。"},{"english":"He was one of the innovationist against the traditional Imperial Examination System and strongly claimed the modern schooling systems.","chinese":"王韬主张改革科举制度，建立近代学校教育制度。"},{"english":"The palace examination is an important component of Tang dynasty imperial examination system.","chinese":"殿试是唐代科举制的重要组成部分。"},{"english":"The main channel of the mobility is Ke-ju system.","chinese":"流动的主要途径是科举制度。"},{"english":"It is under the imperial civil examination system that Hui people learned Han culture.","chinese":"回族对汉文化的学习基本上是在科举制下进行的。"},{"english":"Schooling education was apparently influenced by Keju in three dynasties.","chinese":"三代的学校教育普遍受到了科举制的影响。"},{"english":"Officials were selected through imperial examinations in ancient China.","chinese":"在中国古代，主要是通过科举制度选拔国家官员。"},{"english":"China invented the keju system, which used tests to select government officials.","chinese":"中国曾经发明了科举制度，以考试来选拨政府官员。"},{"english":"It also provided some profitable enlightenment for Law-construction in China at present.","chinese":"科举制度也为当代中国法治建设提供了有益的启示。"},{"english":"The Imperial Examination System of TANG Dynasty had the function of healing the society.","chinese":"唐代科举制具有匡时济俗的功能。"},{"english":"A feature of the examination system was that Confucianism, Buddhism and Taosim were united.","chinese":"儒释道三教合一，是大理国科举制度的一个特点。"},{"english":"It seems that the main testing point in Chinese ancient imperial examination system was writing capability.","chinese":"古代的科举制度，好像主要考的就是书写能力。"},{"english":"Second, the implementation of the political system and examination system of six provinces.","chinese":"第二，政治上实行三省六部制和科举制。"}],"related":[{"definition":["imperial examinations (in former times)"],"pinyin":["ke1 ju3 kao3 shi4"],"word":"科举考试"},{"definition":["imperial examination"],"pinyin":["ke1 ju3"],"word":"科举"},{"definition":["school or academic institution (old)"],"pinyin":["guan1 xue2"],"word":"官学"},{"definition":["feudal society"],"pinyin":["feng1 jian4 she4 hui4"],"word":"封建社会"},{"definition":["feudalism"],"pinyin":["feng1 jian4 zhi4 du4"],"word":"封建制度"},{"definition":["centralized state power"],"pinyin":["zhong1 yang1 ji2 quan2"],"word":"中央集权"},{"definition":["feudal times"],"pinyin":["feng1 jian4 shi2 dai4"],"word":"封建时代"},{"definition":["dismiss the hundred schools, revere only the Confucians (slogan of the Former Han dynasty)"],"pinyin":["du2 zun1 ru2 shu4"],"word":"独尊儒术"},{"definition":["the feudal system\/system of enfeoffment"],"pinyin":["fen1 feng1 zhi4"],"word":"分封制"},{"definition":["eight-part essay one had to master to pass the imperial exams in Ming and Qing dynasties"],"pinyin":["ba1 gu3 wen2"],"word":"八股文"},{"definition":["Confucianism"],"pinyin":["Ru2 xue2"],"word":"儒学"},{"definition":["Sui (581-617) and Tang dynasties (618-907)"],"pinyin":["Sui2 Tang2"],"word":"隋唐"},{"definition":["Sui dynasty (581-617)"],"pinyin":["Sui2 chao2"],"word":"隋朝"},{"definition":["scholar"],"pinyin":["shi4 ren2"],"word":"士人"},{"definition":["one who is successful in one's studies, can become an official (idiom)"],"pinyin":["xue2 er2 you1 ze2 shi4"],"word":"学而优则仕"},{"definition":["land-owning class, esp. during Wei, Jin and North-South dynasties 魏晉南北朝|魏晋南北朝"],"pinyin":["shi4 zu2"],"word":"士族"}]}