{"definition":["to pile up\/to accumulate without being dealt with"],"pinyin":["ji1 ya1"],"traditional":["積壓"],"rank":13569.0,"normalized_rank":0.18984791459712055,"fraction":0.000004943678311306195,"cumulative_fraction":0.9525688321140064,"word":"积压","characters":[{"definition":["to amass\/to accumulate\/to store\/measured quantity (such as area of volume)\/product (the result of multiplication)\/to integrate (math.)\/to solve (or integrate) an ordinary differential equation (math.)\/old\/long-standing"],"pinyin":["ji1"],"word":"积"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya4","ya1"],"word":"压"}],"containing_words":[],"sentences":[{"english":"We would rather cut down the price than keep a large quantity of goods in stock.","chinese":"我们宁肯降低价格，也不愿积压大量货物。"},{"english":"These documents all relate that how to face and address sample backlog.","chinese":"这些文献都涉及怎么面对以及处理样本的检材积压。"},{"english":"The western railroads are still trying to catch up with their delivery delays that built up this crop year.","chinese":"目前西部铁路仍在赶运本作物年度积压的迟发货物。"},{"english":"The buyer's capital will be tied up from the time of remitting it until the goods arrive and are sold.","chinese":"从汇款时起直到货物到达和销售掉，买方会积压资金。"},{"english":"Through hardships of a year, sell product of keep long in stock one sky eventually.","chinese":"经过一年的艰辛，终于将积压产品销售一空。"},{"english":"There exists a great quantity of coal resources under \"Three Unders\" in some coal mine.","chinese":"某煤矿因“三下”环境积压了大量煤炭资源。"},{"english":"For counting purposes, they consider any current case as backlogged.","chinese":"为确定其数目，他们将现有案件都看成积压案件。"},{"english":"We must be able to reduce our backlog of claims.","chinese":"我们必须有能力处理积压下来的索赔单据。"},{"english":"However, on the question of how to deal with the backlog products, financial analysis cannot answer.","chinese":"但对于如何处理积压产品，财务分析不能够回答。"},{"english":"It takes years to work through the overhanging supply of credit.","chinese":"这需要好几年的时间才能消化掉积压着的信贷。"},{"english":"It takes years to work through the overhanging supply of Jaguars.","chinese":"这需要好几年的时间才能消化掉积压着的捷豹汽车。"},{"english":"Depression is often the result of long periods of stress that have gone unrelieved.","chinese":"抑郁是没有得到释放的压力长期积压的结果。"},{"english":"Where is the feeling sitting in your body?","chinese":"这个感觉积压在你身体里哪个地方？"},{"english":"The shop decided to clear off all the old stock in the storehouse.","chinese":"该商店决定把仓库中所有积压的存货处理掉。"},{"english":"The number of backlogged cases in crime laboratories changes daily.","chinese":"犯罪实验室积压案件的数量每天都在发生变化。"},{"english":"eg. We would rather cut down the price than keep a large quantity of goods in stock.","chinese":"我们宁肯降低价格，也不愿积压大量货物。"}],"related":[{"definition":["to drain (by leading off water)\/to unburden oneself\/to divulge\/to leak a secret"],"pinyin":["xuan1 xie4"],"word":"宣泄"},{"definition":["to stockpile"],"pinyin":["ji1 cun2"],"word":"积存"},{"definition":["to save bit by bit\/to accumulate"],"pinyin":["ji1 zan3"],"word":"积攒"},{"definition":["to give vent to (one's feelings)"],"pinyin":["fa1 xie4"],"word":"发泄"},{"definition":["to coalesce\/to gather together\/to amass"],"pinyin":["ji1 ju4"],"word":"积聚"},{"definition":["to pile up like a mountain (idiom)\/a mountain of (paperwork etc)\/a large number of sth"],"pinyin":["dui1 ji1 ru2 shan1"],"word":"堆积如山"},{"definition":["to stock up\/to lay in supplies\/to hoard (for speculation)\/to corner the market in sth"],"pinyin":["tun2 ji1"],"word":"囤积"},{"definition":["grievance\/accumulated rancor"],"pinyin":["ji1 yuan4"],"word":"积怨"},{"definition":["to accumulate"],"pinyin":["lei3 ji1"],"word":"累积"},{"definition":["to relieve\/to ease (pressure)\/to alleviate\/to remove\/to get rid of"],"pinyin":["shu1 jie3"],"word":"纾解"},{"definition":["property or cash held in reserve\/stock"],"pinyin":["ku4 cun2"],"word":"库存"},{"definition":["to bury\/to hide by burying\/hidden"],"pinyin":["mai2 cang2"],"word":"埋藏"},{"definition":["to detain\/retention"],"pinyin":["zhi4 liu2"],"word":"滞留"},{"definition":["to constrain or repress emotions\/oppressive\/stifling\/depressing\/repression"],"pinyin":["ya1 yi4"],"word":"压抑"},{"definition":["stock\/inventory (of material)"],"pinyin":["cun2 huo4"],"word":"存货"},{"definition":["to shelve\/to set aside"],"pinyin":["ge1 zhi4"],"word":"搁置"}]}