{"definition":["table of scores (in exams or sports league)"],"pinyin":["ji1 fen1 bang3"],"traditional":["積分榜"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"积分榜","characters":[{"definition":["to amass\/to accumulate\/to store\/measured quantity (such as area of volume)\/product (the result of multiplication)\/to integrate (math.)\/to solve (or integrate) an ordinary differential equation (math.)\/old\/long-standing"],"pinyin":["ji1"],"word":"积"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen4","fen1"],"word":"分"},{"definition":["variant of 榜[bang3]","notice or announcement\/list of names\/public roll of successful examinees"],"pinyin":["bang3","bang3"],"word":"榜"}],"containing_words":[],"sentences":[{"english":"The Biancocelesti are the runaway leaders at the top of Serie A and confidence is high at Formello.","chinese":"目前拉齐奥正在积分榜上领跑，球队信心十足。"},{"english":"Lyon slipped to third place, three points behind PSG.","chinese":"马赛滑落至积分榜中游，7分落后第三名里尔。"},{"english":"This team ranks first on the tally with an undefeated record.","chinese":"这支球队以不败的战绩雄居积分榜首。"},{"english":"They are sitting there pretty comfortable in the league in ninth position.","chinese":"他们现在在积分榜第九的位置上呆的挺舒服的。"},{"english":"Chelsea's blistering form makes the task of overhauling their five-point lead formidable.","chinese":"切尔西的状态大勇，现在在积分榜上领先5分。"},{"english":"Now we are in a good position in the Premiership and in the Champions League.","chinese":"我们现在在积分榜上位置很好。"},{"english":"Our on line lives are just twists on the videogame leaderboards.","chinese":"我们的在线生活只是游戏积分榜上的起起伏伏。"},{"english":"His marks top the tally. He must be the champion.","chinese":"他的成绩雄踞积分榜第一名，冠军非他莫属。"}],"related":[{"definition":["hat-trick (sports)"],"pinyin":["san1 lian2 sheng4"],"word":"三连胜"},{"definition":["first place\/leader (of a race)"],"pinyin":["tou2 ming2"],"word":"头名"},{"definition":["military successes\/(fig.) success\/accomplishment"],"pinyin":["zhan4 ji4"],"word":"战绩"},{"definition":["top of the list"],"pinyin":["bang3 shou3"],"word":"榜首"},{"definition":["away-game arena\/away-game venue"],"pinyin":["ke4 chang3"],"word":"客场"},{"definition":["home ground (sports)\/home field\/main venue\/main stadium"],"pinyin":["zhu3 chang3"],"word":"主场"},{"definition":["consecutive defeats\/to lose several times in a row"],"pinyin":["lian2 bai4"],"word":"连败"},{"definition":["(sports) league\/league tournament"],"pinyin":["lian2 sai4"],"word":"联赛"},{"definition":["to rank (1st, 2nd etc)\/ranking"],"pinyin":["pai2 ming2"],"word":"排名"},{"definition":["an upset (esp. in sports)\/unexpected turn of events\/to pull off a coup\/a breakthrough"],"pinyin":["bao4 leng3"],"word":"爆冷"},{"definition":["bellwether"],"pinyin":["ling3 tou2 yang2"],"word":"领头羊"},{"definition":["to stand above\/to occupy an important position\/to rank (among the top few)"],"pinyin":["gao1 ju1"],"word":"高居"},{"definition":["victory\/success\/to beat\/to defeat\/to surpass\/victorious\/superior to\/to get the better of\/better than\/surpassing\/superb (of vista)\/beautiful (scenery)\/wonderful (view)\/(Taiwan pr. [sheng1]) able to bear\/equal to (a task)"],"pinyin":["sheng4"],"word":"胜"},{"definition":["to take the lead in a race\/to set the pace"],"pinyin":["ling3 pao3"],"word":"领跑"},{"definition":["to bear\/to carry (on one's back)\/to turn one's back on\/to be defeated\/negative (math. etc)"],"pinyin":["fu4"],"word":"负"},{"definition":["to rank"],"pinyin":["wei4 lie4"],"word":"位列"}]}