{"definition":["to accumulate\/accumulation\/cumulative\/cumulatively"],"pinyin":["ji1 lei3"],"traditional":["積累"],"rank":3156.0,"normalized_rank":0.04415653463545675,"fraction":0.000045164893840574375,"cumulative_fraction":0.7979806947867113,"word":"积累","characters":[{"definition":["to amass\/to accumulate\/to store\/measured quantity (such as area of volume)\/product (the result of multiplication)\/to integrate (math.)\/to solve (or integrate) an ordinary differential equation (math.)\/old\/long-standing"],"pinyin":["ji1"],"word":"积"},{"definition":["tired\/weary\/to strain\/to wear out\/to work hard","to accumulate\/to involve or implicate (Taiwan pr. [lei4])\/continuous\/repeated","rope\/to bind together\/to twist around","surname Lei"],"pinyin":["lei4","lei3","lei2","Lei2"],"word":"累"}],"containing_words":[{"definition":["cumulative"],"pinyin":["ji1 lei3 xing4"],"word":"积累性"},{"definition":["cumulative poison"],"pinyin":["ji1 lei3 du2 xing4"],"word":"积累毒性"}],"sentences":[{"english":"Now I am making an attempt to explain the positions of categories such as primitive accumulation and some others.","chinese":"这里，对原始积累等范畴的位置，试提出一种解释。"},{"english":"Gathering frequent flyer miles is one of the perks of OCS travel.","chinese":"积累飞行里程是商务旅行的额外补贴之一。"},{"english":"Compared with the TFP, the role of labor capital accumulation are more prominent.","chinese":"与TFP相比而言，劳均资本积累的作用更为突出。"},{"english":"When a dam is built, the accumulating water presses down upon the rock below.","chinese":"当大坝建成，逐渐积累的水压压向下方的岩石。"},{"english":"Mannitol accumulates more than other little molecular carbohydrates in A. mellea.","chinese":"甘露醇是蜜环菌体内积累较多的小分子糖类成分。"},{"english":"Yes. You can't learn these words from textbooks; you just get them from daily life.","chinese":"对，这些词课本上是学不到的，都得在生活中积累。"},{"english":"And the business department of China's largest non-Ping'an small accumulation of land.","chinese":"与中国最大的非营业部，平安的小块土地的积累。"},{"english":"Treat it gently by allowing your equity to grow steadily rather than in bursts.","chinese":"与其暴赢，不如缓进，稳扎稳打地积累资产。"},{"english":"Jason: No, I just want to accumulate some useful experience there.","chinese":"杰森:不想，我只想在那里积累一些有用的经验。"},{"english":"Books are the ever-burning lamps of accumulated wisdom the world of eternal.","chinese":"书籍是积累世人智慧的不灭的明灯。"},{"english":"According to the rumor, Sun Yue will be transfered to the low level league NBDL for the more experiences.","chinese":"据传孙悦会被下放到低一级别的NBDL去积累经验。"},{"english":"Moreover, it will help accumu-late funds for China's great cause.","chinese":"还会有助于为中国的伟大事业积累资金。"},{"english":"It is caused when water gets accumulated in the ear canal and leads to an infection.","chinese":"这是造成水时会积累的耳道，并导致感染。"},{"english":"Separate holding tanks can be installed to accumulate this slurry prior to dewatering.","chinese":"可以安装分开的接受器在脱水之前积累这泥浆。"},{"english":"It's a building-block process much like a math course.","chinese":"这就像数学课一样，是一个需要积累的过程。"},{"english":"The drug suramin, which is used to kill invading trypanosomes, is accumulated in lysosomes .","chinese":"用来杀死侵入的锥虫的药物苏拉明，在溶酶体中积累。"}],"related":[{"definition":["to accumulate"],"pinyin":["lei3 ji1"],"word":"累积"},{"definition":["to save bit by bit\/to accumulate"],"pinyin":["ji1 zan3"],"word":"积攒"},{"definition":["to settle\/to precipitate (solid sediment out of a solution)"],"pinyin":["chen2 dian4"],"word":"沉淀"},{"definition":["deposits accumulated over long periods\/fig. valuable experience, accumulated wisdom"],"pinyin":["ji1 dian4"],"word":"积淀"},{"definition":["to accumulate over a long period of time"],"pinyin":["ri4 ji1 yue4 lei3"],"word":"日积月累"},{"definition":["experience\/to experience"],"pinyin":["jing1 yan4"],"word":"经验"},{"definition":["to change\/to transform\/isomerization (chemistry)"],"pinyin":["zhuan3 hua4"],"word":"转化"},{"definition":["Many little things add up to sth great.\/Many little drops make an ocean. (idiom)"],"pinyin":["ji1 shao3 cheng2 duo1"],"word":"积少成多"},{"definition":["quantitative change"],"pinyin":["liang4 bian4"],"word":"量变"},{"definition":["lit. to have accumulated knowledge and deliver it slowly (idiom)\/good preparation is the key to success\/to be well prepared"],"pinyin":["hou4 ji1 bo2 fa1"],"word":"厚积薄发"},{"definition":["knowledge\/CL:門|门[men2]\/intellectual"],"pinyin":["zhi1 shi5"],"word":"知识"},{"definition":["reserves\/to store up"],"pinyin":["chu3 bei4"],"word":"储备"},{"definition":["see 磨練|磨练[mo2 lian4]"],"pinyin":["mo2 lian4"],"word":"磨炼"},{"definition":["to cultivate\/to raise\/to form (a habit)\/to acquire"],"pinyin":["yang3 cheng2"],"word":"养成"},{"definition":["itself\/oneself\/one's own"],"pinyin":["zi4 shen1"],"word":"自身"},{"definition":["huge volume"],"pinyin":["hai3 liang4"],"word":"海量"}]}