{"definition":["to call it...\/known as..."],"pinyin":["cheng1 zhi1 wei2"],"traditional":["稱之為"],"rank":7333.0,"normalized_rank":0.10259818392959577,"fraction":0.000013721167036887316,"cumulative_fraction":0.9012491202324374,"word":"称之为","characters":[{"definition":["variant of 秤[cheng4]\/steelyard","to weigh\/to state\/to name\/name\/appellation\/to praise","to fit\/balanced\/suitable"],"pinyin":["cheng4","cheng1","chen4"],"word":"称"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"}],"containing_words":[],"sentences":[{"english":"It symbolizes good fortune, Gangnam civil called \"the head of wealth.\"","chinese":"它象征着吉祥，江南民间称之为“富贵不断头”。"},{"english":"We may call this phenomenon catching the lion by its tail, and it is an unskillful thing to do.","chinese":"我们可以称之为抓住狮子的尾巴，这是不善巧的。"},{"english":"He called it a narrow escape. But it was really a cliff-hanger .","chinese":"他称之为侥幸逃脱，但那确实让他胆战心惊。"},{"english":"In genomic lingo, the sequences are said to \"drift.","chinese":"用基因组术语，这个序列称之为“漂移”。"},{"english":"They call vividly this plate - type tool it the capture board .","chinese":"他们将这个板状工具形象地称之为“捕获板”。"},{"english":"What God looks on as obstinate weakness, we call strength.","chinese":"神看作顽梗的软弱，我们却称之为力量。"},{"english":"The independent instigator is namely what is regarded as \"attempted instigation\" acceptedly by ChineseForeign traditional theory of criminal law.","chinese":"对独立教唆犯，中外刑法理论上称之为“教唆未遂”。"},{"english":"Diameter with no scouring fabric woven silk fabric called hygiene.","chinese":"用未径练染丝线织成的织物称之为生织物。"},{"english":"They form a topology, and it is called fuzzy stratiform topology.","chinese":"层次闭集可以形成一种拓扑，称之为模糊层次拓扑。"},{"english":"Then between the east and the west, we have what we call the City,","chinese":"然后在东西部之间是中部，我们称之为城市。"},{"english":"It's P-functioning,as we've put it at one time or another.","chinese":"我们称之为人格功能。"},{"english":"This is what I call “Realistic idealism”.","chinese":"我称之为“现实的理想主义”。"},{"english":"His speech is called \"Hip-Hop Saved My Life.\"","chinese":"他的演讲被人称之为“希普霍普拯救我的生命”。"},{"english":"The forces due to friction are called frictional forces.","chinese":"由于摩擦而产生的力称之为摩擦力。"},{"english":"We might call this the Milkman Indicator.","chinese":"我们可以将其称之为送奶工指标。"},{"english":"If a particular cargo is partially damaged, the damage is titled particular average.","chinese":"假如某批货是部份受损，咱们称之为“单独海损”。"}],"related":[]}