{"definition":["the empty city stratagem (in which Zhuge Liang presents himself as unperturbed while making it evident that his city is undefended, hoping his adversary will suspect an ambush)\/double bluff"],"pinyin":["kong1 cheng2 ji4"],"traditional":["空城計"],"rank":41130.0,"normalized_rank":0.5754620625970647,"fraction":3.4465317702102186e-7,"cumulative_fraction":0.9969004796753768,"word":"空城计","characters":[{"definition":["empty\/air\/sky\/in vain","to empty\/vacant\/unoccupied\/space\/leisure\/free time"],"pinyin":["kong1","kong4"],"word":"空"},{"definition":["city walls\/city\/town\/CL:座[zuo4],道[dao4],個|个[ge4]"],"pinyin":["cheng2"],"word":"城"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"计"}],"containing_words":[{"definition":["lit. to sing “The Empty City Stratagem” (idiom)\/fig. to put up a bluff to conceal one's weakness\/(jocularly) (of a place etc) to be empty\/(of one's stomach) to be rumbling"],"pinyin":["chang4 kong1 cheng2 ji4"],"word":"唱空城计"}],"sentences":[{"english":"The only problem I have with my mailbox lately is that it's often empty.","chinese":"最近我遇到的唯一个难题是我的邮箱常常唱空城计。"},{"english":"The only problem I have with my mailbox lately is that it’s often empty.","chinese":"最近我遇到的唯一个难题是我的邮箱常常唱空城计。"},{"english":"The most interesting episode is the Empty-town Plan of Mr.","chinese":"感触最深的是诸葛亮的空城计。"},{"english":"We can't leave no one to keep an eye on things.","chinese":"我们不能搞“空城计”。"},{"english":"The Empty City Trick presents a kind of seesaw movement between the works and the viewers.","chinese":"“空城计”上演了一场作品与观者之间的拉锯运动。"}],"related":[{"definition":["lit. using straw boats to borrow arrows (idiom, from 三國演義|三国演义[San1 guo2 Yan3 yi4])\/fig. to use others' manpower and resources for one's own ends"],"pinyin":["cao3 chuan2 jie4 jian4"],"word":"草船借箭"},{"definition":["interlocked stratagems\/CL:條|条[tiao2]"],"pinyin":["lian2 huan2 ji4"],"word":"连环计"},{"definition":["lit. to use the eastern wind (idiom)\/fig. to use sb's help"],"pinyin":["jie4 dong1 feng1"],"word":"借东风"},{"definition":["Romance of the Three Kingdoms by Luo Guanzhong 羅貫中|罗贯中[Luo2 Guan4 zhong1], one of the Four Classic Novels of Chinese literature\/a fictional account of the Three Kingdoms at the break-up of the Han around 200 AD, consistently portraying Liu Bei's Shu Han 劉備|刘备, 蜀漢|蜀汉 as virtuous heroes and Cao Cao's Wei 曹操, 魏 as tyrannical villains"],"pinyin":["San1 guo2 Yan3 yi4"],"word":"三国演义"},{"definition":["feigned surrender"],"pinyin":["zha4 xiang2"],"word":"诈降"},{"definition":["to dramatize historical events\/novel or play on historical theme"],"pinyin":["yan3 yi4"],"word":"演义"},{"definition":["Battle of Redcliff of 208 at Chibi in Huangzhou district 黃州區|黄州区 of Huanggang city 黄冈, a decisive defeat of Cao Cao 曹操 at the hands of southern kingdom of Wu\/famous episode in the Romance of the Three Kingdoms 三國演義|三国演义"],"pinyin":["Chi4 bi4 zhi1 zhan4"],"word":"赤壁之战"},{"definition":["lit. secretly crossing the Wei River 渭河[Wei4 He2] at Chencang (idiom, refers to a stratagem used by Liu Bang 劉邦|刘邦[Liu2 Bang1] in 206 BC against Xiang Yu 項羽|项羽[Xiang4 Yu3] of Chu)\/fig. to feign one thing while doing another\/to cheat under cover of a diversion"],"pinyin":["an4 du4 Chen2 cang1"],"word":"暗渡陈仓"},{"definition":["lit. to besiege 魏[Wei4] and rescue 趙|赵[Zhao4] (idiom)\/fig. to relieve a besieged ally by attacking the home base of the besiegers"],"pinyin":["wei2 Wei4 jiu4 Zhao4"],"word":"围魏救赵"},{"definition":["Zhuge Liang (181-234), military leader and prime minister of Shu Han 蜀漢|蜀汉 during the Three Kingdoms period\/the main hero of the fictional Romance of Three Kingdoms 三國演義|三国演义, where he is portrayed as a sage and military genius\/mastermind"],"pinyin":["Zhu1 ge3 Liang4"],"word":"诸葛亮"},{"definition":["Huarong Road (traditional puzzle involving sliding wooden blocks, loosely based on an episode in Three Kingdoms 三國演義|三国演义[San1 guo2 Yan3 yi4])"],"pinyin":["Hua2 rong2 Dao4"],"word":"华容道"},{"definition":["stratagem of sowing dissension\/CL:條|条[tiao2]"],"pinyin":["fan3 jian4 ji4"],"word":"反间计"},{"definition":["Sima Yi (179-251), warlord under Cao Cao and subsequently founder of the Jin dynasty"],"pinyin":["Si1 ma3 Yi4"],"word":"司马懿"},{"definition":["the trick of injuring oneself to gain the enemy's confidence\/CL:條|条[tiao2]"],"pinyin":["ku3 rou4 ji4"],"word":"苦肉计"},{"definition":["The Thirty-Six Stratagems, a Chinese essay used to illustrate a series of stratagems used in politics, war, and in civil interaction\/all the possible schemes and stratagems"],"pinyin":["san1 shi2 liu4 ji4"],"word":"三十六计"},{"definition":["to threaten the east and strike to the west (idiom)\/to create a diversion"],"pinyin":["sheng1 dong1 ji1 xi1"],"word":"声东击西"}]}