{"definition":["to go through\/to bore through\/to push one's way through"],"pinyin":["chuan1 xing2"],"traditional":["穿行"],"rank":14395.0,"normalized_rank":0.20140472626026606,"fraction":0.00000444618655896073,"cumulative_fraction":0.9564341640611594,"word":"穿行","characters":[{"definition":["to wear\/to put on\/to dress\/to bore through\/to pierce\/to perforate\/to penetrate\/to pass through\/to thread"],"pinyin":["chuan1"],"word":"穿"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"}],"containing_words":[],"sentences":[{"english":"They needled their way through a primeval forest.","chinese":"他们穿行于原始森林之中。"},{"english":"Changde-Jishou expressway goes zigzag in the mountains of Xiangxi.","chinese":"常吉高速公路在湘西绵延的大山里穿行。"},{"english":"I turned into the dirt road and followed it through encroaching trees and bushes.","chinese":"我转上土路，在蔓延至路面的树木和灌木间穿行。"},{"english":"The fingers are long and curved which suggest she might have been able to swing through trees.","chinese":"又长又弯的手指显示她可能有在树间穿行的能力。"},{"english":"On Hubin Road, I walked alongside West Lake beneath swaying willow trees.","chinese":"在湖滨路，我沿着西湖穿行在摇曳的垂柳下。"},{"english":"Marable's band played on steamboats that traveled up and down the Mississippi River.","chinese":"梅勒伯的乐队在密西西河上来回穿行的汽船上演出。"},{"english":"Arabs ride on camels which travel in deserts for days without drinking.","chinese":"阿拉伯人骑骆驼在沙漠中穿行数日可以不喝水。"},{"english":"This is a clear through the dense forest in romantic fairy tale elves in the south.","chinese":"这清楚是一个穿行在浪漫密林的南国童话精灵。"},{"english":"Though I Walk Through The Valley Of The Shadow Of Dath, I Shall Fear No Man.","chinese":"即使我穿行死亡阴影山谷，我也不惧怕任何人。"},{"english":"I twisted through a maze of narrow corridors.","chinese":"我弯弯曲曲地穿行迷宫式的狭窄走廊。"},{"english":"During the lifetime, there will always be some dark tunnels for us to go through lonely.","chinese":"没错，人生中总有几段黑暗的隧道要我们独自穿行。"},{"english":"The visible wind goes through freely in yours eye, this freedom is worth tracking down.","chinese":"看见风在你的眼里自由地穿行，这自由值得追寻。"},{"english":"Yao Li is walking, through a ceramic 's epic.","chinese":"漫步瑶里，宛如穿行在一部陶瓷的史诗中。"},{"english":"A tourist walks through snow-covered stelae at the Memorial to the Murdered Jews of Europe, also known as the Holocaust Memorial on December 2, 2010 in Berlin, Germany.","chinese":"一观光者在欧洲被害犹太人纪念碑的石柱中穿行。"},{"english":"An oil tanker drove through Hengshan County, Shaanxi Province, China, Wednesday.","chinese":"一辆油罐车穿行陕西省横山县。"},{"english":"Na’vi ride direhorses among the abandoned machines of Hell’s Gate.","chinese":"纳美人骑着重铠马在地狱之门遗弃的机器中穿行。"}],"related":[{"definition":["to travel back and forth\/to shuttle"],"pinyin":["chuan1 suo1"],"word":"穿梭"},{"definition":["to walk"],"pinyin":["xing2 zou3"],"word":"行走"},{"definition":["to speed\/to rush"],"pinyin":["fei1 chi2"],"word":"飞驰"},{"definition":["to wander\/to ramble\/recreational hiking\/to perambulate"],"pinyin":["man4 bu4"],"word":"漫步"},{"definition":["to wriggle\/snaking\/winding\/to zigzag\/to meander"],"pinyin":["wan1 yan2"],"word":"蜿蜒"},{"definition":["to advance\/forward motion"],"pinyin":["xing2 jin4"],"word":"行进"},{"definition":["to wander\/to roam about\/to loaf about\/to be idle"],"pinyin":["you2 dang4"],"word":"游荡"},{"definition":["to wander about unhurriedly\/to linger\/to loiter"],"pinyin":["chang2 yang2"],"word":"徜徉"},{"definition":["appearing and disappearing (idiom)\/intermittently visible"],"pinyin":["shi2 yin3 shi2 xian4"],"word":"时隐时现"},{"definition":["to speed along"],"pinyin":["ji2 chi2"],"word":"疾驰"},{"definition":["intermittent\/now you see it, now you don't"],"pinyin":["hu1 yin3 hu1 xian4"],"word":"忽隐忽现"},{"definition":["towering mountains and precipitous ridges (idiom)"],"pinyin":["chong2 shan1 jun4 ling3"],"word":"崇山峻岭"},{"definition":["to pass through"],"pinyin":["chuan1 guo4"],"word":"穿过"},{"definition":["wandering\/unfixed\/to migrate"],"pinyin":["you2 zou3"],"word":"游走"},{"definition":["to whistle past\/to hurtle past\/to zip by"],"pinyin":["hu1 xiao4 er2 guo4"],"word":"呼啸而过"},{"definition":["curved\/meandering\/zigzagging"],"pinyin":["wan1 wan1 qu1 qu1"],"word":"弯弯曲曲"}]}