{"definition":["to penetrate"],"pinyin":["chuan1 tou4"],"traditional":["穿透"],"rank":14396.0,"normalized_rank":0.20141871755767912,"fraction":0.000004446040581333868,"cumulative_fraction":0.9564386101017408,"word":"穿透","characters":[{"definition":["to wear\/to put on\/to dress\/to bore through\/to pierce\/to perforate\/to penetrate\/to pass through\/to thread"],"pinyin":["chuan1"],"word":"穿"},{"definition":["to penetrate\/to pass through\/thoroughly\/completely\/transparent\/to appear\/to show"],"pinyin":["tou4"],"word":"透"}],"containing_words":[{"definition":["penetrating radiation"],"pinyin":["chuan1 tou4 fu2 she4"],"word":"穿透辐射"}],"sentences":[{"english":"Tackling well and playing penetrating balls from midfield are vital.","chinese":"中场的抢断和穿透性的出球是我们需要的。"},{"english":"Globe rupture can occur secondary to blunt or penetrating trauma.","chinese":"眼球破裂可继发于钝挫伤或穿透性损伤。"},{"english":"Signals in the spectrum can penetrate walls, making it ideal for wireless broadband.","chinese":"该频段的信号可以穿透墙壁，从而非常适合无线宽带。"},{"english":"Specifically, the clarity and projection of the altissimo range.","chinese":"具体地说，可以影响高音区发音的清晰度和穿透力吗？"},{"english":"Tritium emits a weak form of radiation that does not travel very far in the air and cannot penetrate the skin.","chinese":"氚发出的辐射很弱，在空气传播不远，不能穿透皮肤。"},{"english":"Its quantity of heat and the far-infrared can rapidly penetrate the skin points deep place.","chinese":"其热量和远红外线能迅速穿透皮肤穴位深处。"},{"english":"Whatever she tries to launch at you isn't able to penetrate the protective force.","chinese":"不论她尝试对你做什么，也不能穿透这个保护的力量。"},{"english":"Last wax the incapability is over-weight and keep penetration beaded paint from peeping out ground colour.","chinese":"上蜡时不能过重，防止穿透油漆露出底色。"},{"english":"Several bullets struck the log-house, but not one entered;","chinese":"有几发子弹打中了木屋子，但是没有穿透进来。"},{"english":"Cripple's armor and magic penetration lowered to 10 from 25.","chinese":"残废的护甲与魔法穿透效果从25减少到10。"},{"english":"This forerunner of the musket is capable of firing deadly volleys that can pierce armour.","chinese":"这些火枪的先驱者可以射出穿透盔甲的致命齐射。"},{"english":"We shall need a strong light to penetrate through this mist.","chinese":"我们必须要用强光来穿透这层薄雾。"},{"english":"The penetration and deposition of the droplets increase with the gradient wind.","chinese":"而弥雾机械梯度风的存在，有利于雾滴的穿透和沉积。"},{"english":"This being looks at her with a hypnotically deep and steady gaze, as if penetrating her with its eyes.","chinese":"天使如催眠般深深凝望着她，仿佛要用目光将她穿透。"},{"english":"Easy, just see if my watch lasers can cut through the wall.","chinese":"简单，看看我的表发出的激光能不能够穿透那堵墙吧。"},{"english":"The missing becomes long-line, penetrates the thick raindrop, arrives at you.","chinese":"思念连成长线，穿透厚厚的雨点，来到你身边。"}],"related":[{"definition":["to skewer\/to impale\/to pierce through"],"pinyin":["ci4 chuan1"],"word":"刺穿"},{"definition":["to puncture\/to pierce"],"pinyin":["ci4 po4"],"word":"刺破"},{"definition":["to penetrate\/to pierce\/to see clearly\/to have an insight into"],"pinyin":["dong4 chuan1"],"word":"洞穿"},{"definition":["to wear out (clothes)\/to pierce (a membrane etc)"],"pinyin":["chuan1 po4"],"word":"穿破"},{"definition":["to rip apart\/to tear\/laceration\/rent"],"pinyin":["si1 lie4"],"word":"撕裂"},{"definition":["to separate\/to cut off"],"pinyin":["zu3 ge2"],"word":"阻隔"},{"definition":["to split\/to cut open"],"pinyin":["po4 kai1"],"word":"破开"},{"definition":["to cut open\/to rip\/to streak across (lightning, meteor etc)\/to pierce (scream, searchlight etc)"],"pinyin":["hua2 po4"],"word":"划破"},{"definition":["emission\/ejaculation"],"pinyin":["she4 chu1"],"word":"射出"},{"definition":["light beam"],"pinyin":["guang1 shu4"],"word":"光束"},{"definition":["to transmit\/transmission (of radiation through a medium)\/passage"],"pinyin":["tou4 she4"],"word":"透射"},{"definition":["scattering"],"pinyin":["san3 she4"],"word":"散射"},{"definition":["to cover\/to hide from view\/to obstruct or block\/defilade (military)"],"pinyin":["zhe1 bi4"],"word":"遮蔽"},{"definition":["to smash to pieces"],"pinyin":["ji1 sui4"],"word":"击碎"},{"definition":["to shine on\/to light up\/to irradiate"],"pinyin":["zhao4 she4"],"word":"照射"},{"definition":["to prick\/to puncture"],"pinyin":["zha1 chuan1"],"word":"扎穿"}]}