{"definition":["to advance by leaps and bounds"],"pinyin":["tu1 fei1 meng3 jin4"],"traditional":["突飛猛進"],"rank":17109.0,"normalized_rank":0.23937710743917284,"fraction":0.0000032452286227676136,"cumulative_fraction":0.96677351880066,"word":"突飞猛进","characters":[{"definition":["to dash\/to move forward quickly\/to bulge\/to protrude\/to break through\/to rush out\/sudden\/Taiwan pr. [tu2]"],"pinyin":["tu1"],"word":"突"},{"definition":["to fly"],"pinyin":["fei1"],"word":"飞"},{"definition":["ferocious\/fierce\/violent\/brave\/suddenly\/abrupt\/(slang) awesome"],"pinyin":["meng3"],"word":"猛"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"进"}],"containing_words":[],"sentences":[{"english":"With your wonderful leadership skills, your career is guided by drive, stamina and commitment.","chinese":"伴随着你杰出的领导能力，工作突飞猛进地发展。"},{"english":"The wheel of technology history turns remarkably fast.","chinese":"科技发展的历史突飞猛进。"},{"english":"Nowdays, science and technology are growing in leaps and bounds, and knowledge economy has shaped it's small form.","chinese":"当今世界，科学技术突飞猛进，知识经济已见端倪。"},{"english":"The development of two years of advance rapidly, created new start for phlogistic yellow network.","chinese":"两年突飞猛进的发展，为炎黄网络创造了新的起点。"},{"english":"Trade within the region has been growing by leaps and bounds.","chinese":"区域内贸易突飞猛进。"},{"english":"P2P networking applications have seen explosive growth in recent years.","chinese":"对等网应用在近几年内已得到突飞猛进的发展。"},{"english":"While after renaissance time, modern surgery in western medicine has been largely improved by its technologies.","chinese":"“文艺复兴”以后的西医外科学得到突飞猛进地发展。"},{"english":"With spending in check, the economy soared during his term.","chinese":"通过控制开支，美国经济在他执政期间一路突飞猛进。"},{"english":"Their business has grown by leaps and bounds.","chinese":"他们的生意突飞猛进。"},{"english":"Global trade increased enormously in the second half of the 20th century.","chinese":"20世纪后半叶，全球化贸易突飞猛进。"},{"english":"Technolgical developments in the field of genetic engineering have proceeded rapidly in recent years.","chinese":"最近以来遗传工程学技术突飞猛进。"},{"english":"Construction of postal and telecommunications facilities greatly expanded.","chinese":"邮电通信建设突飞猛进。"},{"english":"Over the past two decades, China has achieved exceptionally rapid economic growth.","chinese":"年中，中国经济突飞猛进地增长。"},{"english":"But not so radical that you think it's science fiction.","chinese":"但不会突飞猛进到你以为是科幻那样的程度。"},{"english":"Shani started out slow but dug deep on his final lap.","chinese":"沙尼起步很慢，但在最后一圈中突飞猛进。"},{"english":"We are now witnessing a period of rapid transformation in the global marketplace.","chinese":"当前，我们正目睹一个全球市场突飞猛进的时期。"}],"related":[{"definition":["lit. one day, a thousand miles (idiom); rapid progress"],"pinyin":["yi1 ri4 qian1 li3"],"word":"一日千里"},{"definition":["qualitative leap"],"pinyin":["zhi4 de5 fei1 yue4"],"word":"质的飞跃"},{"definition":["remarkable (progress, improvement, expansion etc)"],"pinyin":["chang2 zu2"],"word":"长足"},{"definition":["to take it up a notch\/to bring it up a level"],"pinyin":["geng4 shang4 yi1 ceng2 lou2"],"word":"更上一层楼"},{"definition":["rapid progress"],"pinyin":["chang2 zu2 jin4 bu4"],"word":"长足进步"},{"definition":["progress\/improvement\/to improve\/to progress\/CL:個|个[ge4]"],"pinyin":["jin4 bu4"],"word":"进步"},{"definition":["to make a breakthrough"],"pinyin":["tu1 po4 ping2 jing3"],"word":"突破瓶颈"},{"definition":["to overtake"],"pinyin":["gan3 chao1"],"word":"赶超"},{"definition":["to forge ahead vigorously\/to dedicate oneself to progress"],"pinyin":["jing1 jin4"],"word":"精进"},{"definition":["lit. like a tiger that has grown wings\/with redoubled power (idiom)"],"pinyin":["ru2 hu3 tian1 yi4"],"word":"如虎添翼"},{"definition":["breakthrough\/going beyond\/leap-forward\/unusual new development"],"pinyin":["kua4 yue4 shi4"],"word":"跨越式"},{"definition":["stuck and not moving forward (idiom); stagnant\/in a rut\/at a standstill"],"pinyin":["ting2 zhi4 bu4 qian2"],"word":"停滞不前"},{"definition":["bottleneck"],"pinyin":["ping2 jing3"],"word":"瓶颈"},{"definition":["to leap to (a higher position etc)\/to jump\/(of a plane) to ascend"],"pinyin":["yue4 sheng1"],"word":"跃升"},{"definition":["to shed one's mortal body and exchange one's bones (idiom); born again Daoist\/to turn over a new leaf\/fig. to change wholly\/to create from other material (story, artwork etc)"],"pinyin":["tuo1 tai1 huan4 gu3"],"word":"脱胎换骨"},{"definition":["to advance boldly\/to push ahead vigorously"],"pinyin":["meng3 jin4"],"word":"猛进"}]}