{"definition":["lit. set up a pole and see the shadow (idiom); fig. instant effect\/quick results"],"pinyin":["li4 gan1 jian4 ying3"],"traditional":["立竿見影"],"rank":19732.0,"normalized_rank":0.2760762805534957,"fraction":0.0000024614747441459,"cumulative_fraction":0.9741872208898532,"word":"立竿见影","characters":[{"definition":["surname Li","to stand\/to set up\/to establish\/to lay down\/to draw up\/at once\/immediately"],"pinyin":["Li4","li4"],"word":"立"},{"definition":["pole"],"pinyin":["gan1"],"word":"竿"},{"definition":["to appear\/also written 現|现[xian4]","to see\/to meet\/to appear (to be sth)\/to interview"],"pinyin":["xian4","jian4"],"word":"见"},{"definition":["picture\/image\/film\/movie\/photograph\/reflection\/shadow\/trace"],"pinyin":["ying3"],"word":"影"}],"containing_words":[],"sentences":[{"english":"Music therapy does not cure at once.","chinese":"音乐疗法并不能立竿见影。"},{"english":"This is an immediate consequence of the JOSH stack.","chinese":"这就是JOSH组合立竿见影的效果。"},{"english":"The results from repeal were both immediate and amazing.","chinese":"撤销禁酒令的结果是最立竿见影和最传奇的。"},{"english":"And it would have the advantage of an almost instant off switch.","chinese":"它的优势是将会产生立竿见影的效果。"},{"english":"A big change in an exchange rate seems at first glance that it should have an immediate impact.","chinese":"乍看之下，汇率大变似乎该有立竿见影的效果。"},{"english":"If we stop eating meat completely, the cooling effect will be almost immediate.","chinese":"如果我们彻底停止吃肉，其冷却效果几乎是立竿见影。"},{"english":"He looks for an immediate return on that ad buy.","chinese":"对于购买的广告，他寻求立竿见影的回报。"},{"english":"The lesson was crystal clear, and its effects were immediate.","chinese":"梦给他上的一课像水晶般透明，而且立竿见影。"},{"english":"If you are looking for instant-gratification, try a 5k.","chinese":"如果你寻求的是立竿见影的效果，那么试试5km吧。"},{"english":"No other diet or weight-loss approach is remotely as effective as bariatric surgery.","chinese":"没有什么节食或减肥方法比减肥手术更加立竿见影。"},{"english":"They're an on-demand group accustomed to seeing immediate results.","chinese":"他们是一个按需团体，习惯于看到立竿见影的效果。"},{"english":"Persuasion is great for immediate effect, but learning matters over the long-haul.","chinese":"劝说有立竿见影的效果，学习却是长途旅行。"}],"related":[{"definition":["lit. put up a pole and see the shadow (idiom); to expect instant results"],"pinyin":["li4 gan1 jian4 ying3"],"word":"立杆见影"},{"definition":["to have the desired effect"],"pinyin":["jian4 xiao4"],"word":"见效"},{"definition":["result\/effect\/efficacy\/(theater) sound or visual effects"],"pinyin":["xiao4 guo3"],"word":"效果"},{"definition":["effect\/result"],"pinyin":["cheng2 xiao4"],"word":"成效"},{"definition":["to treat the symptoms but not the root cause"],"pinyin":["zhi4 biao1 bu4 zhi4 ben3"],"word":"治标不治本"},{"definition":["to yield results"],"pinyin":["shou1 xiao4"],"word":"收效"},{"definition":["to show results\/effective"],"pinyin":["zou4 xiao4"],"word":"奏效"},{"definition":["to treat only the symptoms but not the root cause"],"pinyin":["zhi4 biao1"],"word":"治标"},{"definition":["half the work, twice the effect (idiom); the right approach saves effort and leads to better results\/a stitch in time saves nine"],"pinyin":["shi4 ban4 gong1 bei4"],"word":"事半功倍"},{"definition":["to show an effect\/to produce an effect\/a conspicuous effect"],"pinyin":["xian3 xiao4"],"word":"显效"},{"definition":["to take radical measures\/to get to the root (of a problem etc)"],"pinyin":["zhi4 ben3"],"word":"治本"},{"definition":["lit. to paint holding two brushes (idiom); fig. to work on two tasks at the same time\/to attack one problem from two angles at the same time"],"pinyin":["shuang1 guan3 qi2 xia4"],"word":"双管齐下"},{"definition":["lit. the disease is cured the moment the medicine is taken (idiom)\/fig. (of a medical treatment) to give instant results\/(of a solution or method) highly effective"],"pinyin":["yao4 dao4 bing4 chu2"],"word":"药到病除"},{"definition":["to produce the opposite of the desired result"],"pinyin":["shi4 de2 qi2 fan3"],"word":"适得其反"},{"definition":["very small\/very little\/scant\/minimal"],"pinyin":["shen4 wei1"],"word":"甚微"},{"definition":["to get sth done once and for all"],"pinyin":["yi1 lao2 yong3 yi4"],"word":"一劳永逸"}]}