{"definition":["rules\/regulations\/constitution\/statute\/articles of association (of company)\/articles of incorporation\/charter (of a corporation)\/by-laws"],"pinyin":["zhang1 cheng2"],"traditional":["章程"],"rank":4737.0,"normalized_rank":0.06627677584542414,"fraction":0.00002601335908442317,"cumulative_fraction":0.8523738873578542,"word":"章程","characters":[{"definition":["chapter\/section\/clause\/movement (of symphony)\/seal\/badge\/regulation\/order","surname Zhang"],"pinyin":["zhang1","Zhang1"],"word":"章"},{"definition":["surname Cheng","rule\/order\/regulations\/formula\/journey\/procedure\/sequence"],"pinyin":["Cheng2","cheng2"],"word":"程"}],"containing_words":[],"sentences":[{"english":"But Wang even did not have a girlfriend.","chinese":"而王章程连女朋友都没有。"},{"english":"The original articles of association must be marked with the certification of entry in the register and be returned.","chinese":"章程的正本必须附记登记证明，并予发还。"},{"english":"Mr. CaeHiew introduces the vacation camp for the kids and has an explanation of camp rules and the regulation.","chinese":"丘老师为我们介绍假期营，说明营的规矩和章程。"},{"english":"The first option are Crewed Charters , where you .","chinese":"第一个方案是载人的章程，在那里您。"},{"english":"Item Thirty-three The council has the full rights to explain the regulations.","chinese":"第三十三条本章程的解释权属本单位的执行委员会。"},{"english":"Each member of the committee should be familiar with the association's constitution and legal obligations.","chinese":"所有的委员必须熟悉组织章程和法律义务。"},{"english":"The question of changing the club's rules was mooted at the last meeting.","chinese":"修改俱乐部章程的问题在上次会议上提出审议了。"},{"english":"to review and verify company regulations of wholly state-owned enterprises financed by the Commission.","chinese":"承办所出资的国有独资公司章程的审核工作。"},{"english":"If there is any inadequacy in this prospectus, the Organiser reserves the right for appropriate amendments.","chinese":"本章程如有未尽善处，大会保留修改权利。"},{"english":"The Constitution of the Asia-Pacific Telecommunity was signed in Bangkok, Thailand.","chinese":"亚洲太平洋地区组织章程》在泰国曼谷签订。"},{"english":"The undersigned agrees to follow the bylaw of Monte Jade Science and Technology Association of Hong Kong Limited.","chinese":"本公司入会后将遵守香港玉山科技协会章程。"},{"english":"Someone in the meeting suggested that a 11-person committee should be appointed to constitute the new rules.","chinese":"会上有人建议任命一个11人委员会来制定新章程。"},{"english":"If there is any inadequacy in the prospectus and the above guidelines, the organiser reserves the right for appropriate amendments.","chinese":"如比赛章程及本须知有未尽善处，大会保留修改权利。"},{"english":"Many materials indicate that there was a set of explicit administrative rules.","chinese":"资料记载表明，宋代贡士庄有较为明确的管理章程。"},{"english":"Article 196 The interpretation of these Articles of Association is vested with the board of directors of the Company.","chinese":"第一百九十六条本章程由公司董事会负责解释。"},{"english":"The first type is like requiring all company charters to be pro- shareholder.","chinese":"第一种形式类似于要求所有公司章程都是亲股东的。"}],"related":[{"definition":["rule\/regulation"],"pinyin":["gui1 zhang1"],"word":"规章"},{"definition":["to reach an agreement\/to agree upon"],"pinyin":["yi4 ding4"],"word":"议定"},{"definition":["to draw up\/to draft\/to formulate"],"pinyin":["ni3 ding4"],"word":"拟定"},{"definition":["to draw up (a plan)"],"pinyin":["ni3 ding4"],"word":"拟订"},{"definition":["main content\/matter\/work\/origin of an incident\/cause\/purpose\/subject (of business letter)"],"pinyin":["shi4 you2"],"word":"事由"},{"definition":["regulations\/rules\/code of conduct\/ordinances\/statutes"],"pinyin":["tiao2 li4"],"word":"条例"},{"definition":["first draft\/to draw up (a first version)"],"pinyin":["cao3 ni3"],"word":"草拟"},{"definition":["detailed rules and regulations\/bylaws"],"pinyin":["xi4 ze2"],"word":"细则"},{"definition":["authority\/power over others"],"pinyin":["zhi2 quan2"],"word":"职权"},{"definition":["roll (of names)\/register\/CL:本[ben3]"],"pinyin":["ming2 ce4"],"word":"名册"},{"definition":["to lay out (an argument) item by item\/memorandum to a superior"],"pinyin":["tiao2 chen2"],"word":"条陈"},{"definition":["charter"],"pinyin":["xian4 zhang1"],"word":"宪章"},{"definition":["according to the regulations"],"pinyin":["zhao4 zhang1"],"word":"照章"},{"definition":["government decree"],"pinyin":["zheng4 ling4"],"word":"政令"},{"definition":["an item in accounts\/an entry"],"pinyin":["zhang4 mu4"],"word":"账目"},{"definition":["account"],"pinyin":["zhang4 mu4"],"word":"帐目"}]}