{"definition":["really\/after all\/details\/particulars"],"pinyin":["duan1 di4"],"traditional":["端的"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"端的","characters":[{"definition":["old variant of 端[duan1]\/start\/origin","end\/extremity\/item\/port\/to hold sth level with both hands\/to carry\/regular"],"pinyin":["duan1","duan1"],"word":"端"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"}],"containing_words":[],"sentences":[{"english":"The white half moon at the beginning of the nail is an indicator of good thyroid health.","chinese":"在指甲底端的白色半月形，是一个甲状腺健康的指标。"},{"english":"The knurled knob (GG) at the bottom end of the depth adjustment rod can be used to make minor adjustments.","chinese":"用深度调节杆底端的滚花柱头可以做细小调整。"},{"english":"The lug boss is completely arranged in an annular groove at the right end of the piston head.","chinese":"所述凸台全部置于所述活塞头右端的环状槽内。"},{"english":"Parallel flow through two extended length elements mounted end to end.","chinese":"通过两个平行延伸长度要素流动式端到端的。"},{"english":"The strain-fatigue-life of materials is related to the plastic strain at the crack-tip.","chinese":"材料的应变疲劳寿命与裂端的塑性应变有关。"},{"english":"While examining the cranial end of the right kidney find the caudate lobe of the liver.","chinese":"检查右肾头端的时候，可以找到肝脏的尾叶。"},{"english":"This is the role of structures called telomeres that cap the ends of chromosomes.","chinese":"这就是盖住染色体各端的端粒结构的功能。"},{"english":"A trocar obturator includes a shaft having a proximal end and a distal end.","chinese":"一种套针插塞，其包括具有近端和远端的轴。"},{"english":"Replacement sleeves are made with one flange end slightly softer than the other.","chinese":"用来更换的套管其一端的法兰比另一端稍微柔软一些。"},{"english":"AIM To further understand the antigen characteristic of the amino proximal of hantaan virus nucleoprotein.","chinese":"目的进一步了解汉滩病毒核蛋白氨基端的抗原特性。"},{"english":"The protection circuit on the input end has a gate electrode comprised of a band-like conductive film.","chinese":"输入端的保护电路有由带状导电膜组成的栅电极。"},{"english":"At the ovarian end of the oviduct is the infundibulum.","chinese":"在卵巢端的输卵管末端为漏斗部。"},{"english":"Mulan Lake surcharges Island Resort Mulan Hunan side of the \"Eight Immortals Island\" is the largest lake island.","chinese":"木兰湖南端的“八仙岛”是湖中最大的岛屿。"},{"english":"The characteristic equation of symmetrical interface end was derived .","chinese":"得到了对称界面端的特征方程。"},{"english":"Wang ended his career and academics to explore research.","chinese":"并对汪端的学者生涯进行探索研究。"},{"english":"His effort on the defensive end of the floor will make Richard Jefferson look like a sloth.","chinese":"他在防守端的努力会让杰佛森看起来就像个懒汉一样。"}],"related":[{"definition":["old variant of 端[duan1]\/start\/origin","end\/extremity\/item\/port\/to hold sth level with both hands\/to carry\/regular"],"pinyin":["duan1","duan1"],"word":"端"},{"definition":["attack and defense\/the midfield (in soccer)"],"pinyin":["gong1 fang2"],"word":"攻防"},{"definition":["to attack\/to assault\/to go on the offensive\/attack\/assault\/offense (sports)"],"pinyin":["jin4 gong1"],"word":"进攻"},{"definition":["both ends (of a stick etc)\/two extremes"],"pinyin":["liang3 duan1"],"word":"两端"},{"definition":["level (of achievement etc)\/standard\/level (surveying)"],"pinyin":["shui3 zhun3"],"word":"水准"},{"definition":["low-end"],"pinyin":["di1 duan1"],"word":"低端"},{"definition":["hardware"],"pinyin":["ying4 jian4"],"word":"硬件"},{"definition":["efficiency"],"pinyin":["xiao4 lu:4"],"word":"效率"},{"definition":["high-end"],"pinyin":["gao1 duan1"],"word":"高端"},{"definition":["mid-to-low-range"],"pinyin":["zhong1 di1 duan1"],"word":"中低端"},{"definition":["fire\/firepower"],"pinyin":["huo3 li4"],"word":"火力"},{"definition":["by contrast\/but as for this...\/viewed from another angle\/subjectively\/introspection"],"pinyin":["fan3 guan1"],"word":"反观"},{"definition":["the middle stretches of a river\/middle level\/middle echelon\/midstream"],"pinyin":["zhong1 you2"],"word":"中游"},{"definition":["remarkable\/outstanding"],"pinyin":["chu1 se4"],"word":"出色"},{"definition":["cost-performance ratio"],"pinyin":["xing4 jia4 bi3"],"word":"性价比"},{"definition":["recently\/lately"],"pinyin":["jin4 lai2"],"word":"近来"}]}