{"definition":["to wait until\/by the time when (sth is ready etc)"],"pinyin":["deng3 dao4"],"traditional":["等到"],"rank":3768.0,"normalized_rank":0.05271920865221832,"fraction":0.00003589356280331933,"cumulative_fraction":0.8226393695236912,"word":"等到","characters":[{"definition":["class\/rank\/grade\/equal to\/same as\/to wait for\/to await\/et cetera\/and so on\/et al. (and other authors)\/after\/as soon as\/once"],"pinyin":["deng3"],"word":"等"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"}],"containing_words":[],"sentences":[{"english":"He waited until he heard shots. Then he peered through the skylight, into the darkened tavern.","chinese":"他等到枪声响起，才透过天窗朝阴暗的酒馆内看去。"},{"english":"Later, at home, Zilla would accuse him of being a coward and a weakling .","chinese":"等到了家里，齐拉就数落他是个懦夫，软骨头。"},{"english":"Suppose we wait until tomorrow.","chinese":"咱们就等到明天吧。"},{"english":"I followed this kitty all around the places, and finally got this lovely shot.","chinese":"我追著它绕来绕去，最后终于等到这张可爱的照片。"},{"english":"She waited until the applause had died down, then spoke again.","chinese":"她等到掌声变小了，才又开始说话。"},{"english":"When the women reached age 40, Leupp measured their levels of depression .","chinese":"等到她们40岁时，莱普分别测试她们的抑郁程度。"},{"english":"So when we come to personal identity which we will do in later lecture.","chinese":"所以，等到我们在后面的课上讲到人格同一性时。"},{"english":"I don't know if I'm ready for round one - we'll have to wait and see!","chinese":"我不知道我是否准备好了，我们必须等到比赛再看。"},{"english":"Xiao Yang went to the bookstore and book shop, the boss told her to wait until the phone.","chinese":"杨小曼去书店订书，店老板告诉她等到了电话联系。"},{"english":"Fine, until that asset is worth less than the outstanding loan.","chinese":"等到这笔财产的价值低于未偿贷款的时候，罚款。"},{"english":"Test teams are unblocked and moving forward.","chinese":"测试团队解除了此处的等到，并继续前进。"},{"english":"Ye Lang finally wait until the old company calls, the acquisition agreement is received.","chinese":"叶朗终于等到旧公司的来电，收购协议书亦收到。"},{"english":"IF and WHEN both looked at the man and wondered what he wanted.","chinese":"“如果”和“等到”看着这个人，不知道他想干什么。"},{"english":"Or such mangling can be performed automatically after an executable is created.","chinese":"或者也可以等到可执行文件生成之后再自动化切碎。"},{"english":"Or wait until the trouble to repair, often has a very serious problem.","chinese":"否则等到出毛病才送修，往往问题已经很严重。"},{"english":"Pay him his wages each day before sunset, because he is poor and is counting on it.","chinese":"要当日给他工价，不可等到日落。"}],"related":[{"definition":["until"],"pinyin":["zhi2 dao4"],"word":"直到"},{"definition":["ability\/talent\/sb of a certain type\/a capable individual\/only\/only then\/just now","a moment ago\/just now\/(indicating sth happening later than expected)\/(preceded by a clause of condition or reason) not until\/(followed by a numerical clause) only"],"pinyin":["cai2","cai2"],"word":"才"},{"definition":["time\/length of time\/moment\/period"],"pinyin":["shi2 hou5"],"word":"时候"},{"definition":["after\/later\/afterwards\/following\/later on\/in the future"],"pinyin":["yi3 hou4"],"word":"以后"},{"definition":["afterwards\/following\/later\/after"],"pinyin":["zhi1 hou4"],"word":"之后"},{"definition":["to wait\/to wait for"],"pinyin":["deng3 dai4"],"word":"等待"},{"definition":["when?\/at what time?"],"pinyin":["shen2 me5 shi2 hou5"],"word":"什么时候"},{"definition":["to wait\/to treat\/to deal with\/to need\/going to (do sth)\/about to\/intending to","to stay"],"pinyin":["dai4","dai1"],"word":"待"},{"definition":["at once\/right away\/immediately\/on horseback (i.e. by military force)"],"pinyin":["ma3 shang4"],"word":"马上"},{"definition":["not so\/no\/or else\/otherwise\/if not\/How about ...?"],"pinyin":["bu4 ran2"],"word":"不然"},{"definition":["lasting until\/up till (the present)"],"pinyin":["zhi2 zhi4"],"word":"直至"},{"definition":["again\/once more\/re-\/second\/another\/then (after sth, and not until then)\/no matter how ... (followed by an adjective or verb, and then (usually) 也[ye3] or 都[dou1] for emphasis)"],"pinyin":["zai4"],"word":"再"},{"definition":["at this time\/at this moment"],"pinyin":["zhe4 shi2"],"word":"这时"},{"definition":["with great difficulty\/very difficult"],"pinyin":["hao3 bu4 rong2 yi4"],"word":"好不容易"},{"definition":["almost\/nearly\/almost all"],"pinyin":["kuai4 yao4"],"word":"快要"},{"definition":["until\/(used in combination with words like 到[dao4] or 至[zhi4] in constructs of the form 到...為止|到...为止)"],"pinyin":["wei2 zhi3"],"word":"为止"}]}