{"definition":["wait and see (who is right)"],"pinyin":["deng3 zhe5 qiao2"],"traditional":["等著瞧"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"等着瞧","characters":[{"definition":["class\/rank\/grade\/equal to\/same as\/to wait for\/to await\/et cetera\/and so on\/et al. (and other authors)\/after\/as soon as\/once"],"pinyin":["deng3"],"word":"等"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"},{"definition":["to look at\/to see\/to see (a doctor)\/to visit"],"pinyin":["qiao2"],"word":"瞧"}],"containing_words":[],"sentences":[{"english":"And if you thought there was an intellectual\/emotional disconnect before, wait till you see this thing.","chinese":"如果你以前认为这里有什么脱节的话，等着瞧。"},{"english":"Some of the commenters are pessimist. Wait and watch.","chinese":"从评论来看，有些人是悲观主义者，等着瞧。"},{"english":"She hugged me, and I saw her “we’ll see about that” look.","chinese":"她紧抱着我，我看见她那“我们等着瞧”的表情。"},{"english":"I don't ask you to believe me. All you have to do is wait and see.","chinese":"我不求你相信，只要你等着瞧。"},{"english":"It remains to be seen whether CAGC is a real company.","chinese":"艾瑞泰克是否是一家真实存在的公司，仍要等着瞧。"},{"english":"Stay tuned, I believe there will be a statement soon from SFA Beijing.","chinese":"等着瞧，我相信北京的国家林业局马上会发表声明。"},{"english":"Well, I'll telling you. You wait and see.","chinese":"嗯，我说的不会错，你就等着瞧吧。"},{"english":"So we shall see.","chinese":"所以我们要等着瞧。"},{"english":"Lets see about that , I will work hard to blaze a trail in this new company.","chinese":"等着瞧吧，我一定会努力工作在新公司杀出一条血路。"},{"english":"Let's wait and see what transpires.","chinese":"让我们等着瞧，看会发生什么事。"},{"english":"I just have to wait and see.","chinese":"我只有等着瞧了。"}],"related":[]}