{"definition":["bargaining chip\/gaming chip\/casino token"],"pinyin":["chou2 ma3"],"traditional":["籌碼"],"rank":8980.0,"normalized_rank":0.12564185076882178,"fraction":0.000009953630465207707,"cumulative_fraction":0.9204664192232894,"word":"筹码","characters":[{"definition":["chip (in gambling)\/token (for counting)\/ticket\/to prepare\/to plan\/to raise (funds)\/resource\/means"],"pinyin":["chou2"],"word":"筹"},{"definition":["weight\/number\/code\/to pile\/to stack\/classifier for length or distance (yard), happenings etc"],"pinyin":["ma3"],"word":"码"}],"containing_words":[],"sentences":[{"english":"Both arms folded and he'd push most of his chips into the betting circle.","chinese":"两臂折叠起来告诉他应该把大部分的筹码都押上。"},{"english":"A fifth bargaining chip could be to alter the schedule of payments.","chinese":"第五个可以用来议价的筹码是改变原订的付款日期。"},{"english":"Lin Lei saw the opportunity to ridicule Bai righteousness, want him to hold.","chinese":"林磊看准机会乘机奚落柏义，要他来执筹码。"},{"english":"He went inside and tried to buy chips to play blackjack.","chinese":"他进到里面试图要买筹码来玩黑杰克。"},{"english":"When the card game ended, he cashed in his chips and left the gambling house.","chinese":"牌局结束后，他把筹码兑换成现金离开赌场。"},{"english":"On the execution ground, gowardesh chip finally won the vitality for the treasure.","chinese":"刑场上，狗娃以宝藏为筹码终于获得了生机。"},{"english":"He will turn in his chips in exchange for money or cash.","chinese":"他会将自己的chips筹码兑换成钱或现金。"},{"english":"The stranger shoved in all his chips and followed with the deed to his plantation.","chinese":"陌生人把所有的筹码全部押上，外加那个农场的文契。"},{"english":"Under you the gambling stake, the checkup gambling house, blusters , even enhances the chip.","chinese":"你下赌注，核对牌局，虚张声势，甚至提高筹码。"},{"english":"The game is made by the blood and life of the chip, you dare to play?","chinese":"这场游戏是用鲜血和生命的作筹码的，你敢玩吗？"},{"english":"Imagine for a moment that your self-esteem is like a stack of poker chips.","chinese":"试着把你的自信心想象成一堆筹码。"},{"english":"Write a program to solve the problem with 4 counters schematically.","chinese":"写一个程序示意性地解决四个筹码转移的问题。"},{"english":"In the meantime, this also can be helped and dispatch wins more chip to appear on the market.","chinese":"同时，这也能帮助和讯为上市赢得更多的筹码。"},{"english":"And Chicago's not budging from its stance of not including Noah in a deal for Anthony.","chinese":"而芝加哥，他们似乎也坚决不肯把诺阿当做交易筹码。"},{"english":"The Los Angeles Lakers have offered a future first-round pick to Minnesota for completing the transaction.","chinese":"湖人队同森林狼交易的筹码是未来的一个首轮选秀权。"},{"english":"Before this season conclusion, the bibby will become the very good transaction chip.","chinese":"在本赛季结束之前，毕比都将成为很好的交易筹码。"}],"related":[{"definition":["farmhouse\/banker (gambling)"],"pinyin":["zhuang1 jia1"],"word":"庄家"},{"definition":["(business) transaction\/business deal\/CL:筆|笔[bi3]"],"pinyin":["jiao1 yi4"],"word":"交易"},{"definition":["main force\/main strength of an army"],"pinyin":["zhu3 li4"],"word":"主力"},{"definition":["to purchase\/to buy in (goods)"],"pinyin":["mai3 jin4"],"word":"买进"},{"definition":["to immobilize with a lasso\/to be trapped in the stock market"],"pinyin":["tao4 lao2"],"word":"套牢"},{"definition":["share certificate\/stock (finance)"],"pinyin":["gu3 piao4"],"word":"股票"},{"definition":["to buy (finance)"],"pinyin":["mai3 ru4"],"word":"买入"},{"definition":["salary\/wage"],"pinyin":["xin1 jin1"],"word":"薪金"},{"definition":["low price"],"pinyin":["di1 jia4"],"word":"低价"},{"definition":["to dump (selling abroad more cheaply than cost price at home)"],"pinyin":["pao1 shou4"],"word":"抛售"},{"definition":["(Tw) to pull sth up\/(fig.) to give a boost to\/to support"],"pinyin":["la1 tai2"],"word":"拉抬"},{"definition":["money market"],"pinyin":["tou2 cun4"],"word":"头寸"},{"definition":["to sign one's name\/visa\/variant of 籤|签[qian1]","Japanese variant of 籤|签[qian1]","inscribed bamboo stick (used in divination, gambling, drawing lots etc)\/small wood sliver\/label\/tag"],"pinyin":["qian1","qian1","qian1"],"word":"签"},{"definition":["games (such as chess, dice etc)\/gambling\/contest"],"pinyin":["bo2 yi4"],"word":"博弈"},{"definition":["to obtain (sth) in exchange\/to exchange (sth) for (sth else)"],"pinyin":["huan4 qu3"],"word":"换取"},{"definition":["stake (in a gamble)\/(what is at) stake"],"pinyin":["du3 zhu4"],"word":"赌注"}]}