{"definition":["clear and simple\/in simple terms"],"pinyin":["jian3 dan1 ming2 liao3"],"traditional":["簡單明瞭"],"rank":31392.0,"normalized_rank":0.4392148083891819,"fraction":8.330943165010468e-7,"cumulative_fraction":0.991475810046796,"word":"简单明了","characters":[{"definition":["simple\/uncomplicated\/letter\/to choose\/to select\/bamboo strips used for writing (old)"],"pinyin":["jian3"],"word":"简"},{"definition":["surname Shan","bill\/list\/form\/single\/only\/sole\/odd number\/CL:個|个[ge4]"],"pinyin":["Shan4","dan1"],"word":"单"},{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"}],"containing_words":[],"sentences":[{"english":"The command outputs should be self-explanatory.","chinese":"这些命令输出应该是非常简单明了的。"},{"english":"In the homespun wisdom of Jackie Chan, the way forward is simple.","chinese":"以成龙的朴素智慧，其前进方向也很简单明了。"},{"english":"All such memory-enhancing techniques, called mnemonics, transform new information into more easily remembered formulations.","chinese":"这种记忆强化法将新知识转化为简单明了易记的形式。"},{"english":"They were indifferent to money, wordly possesions and pleasure.","chinese":"他们认为钱无关紧要，说话简单明了和快乐。"},{"english":"In addition, the son has struggled to write legibly.","chinese":"另外，她儿子对于简单明了的写字显得很吃力。"},{"english":"The Austrian recipe for economic crisis is very simple and requires little action on the part of government.","chinese":"奥地利人的政策措施简单明了，也不需要政府做什么。"},{"english":"The code you write will be straightforward.","chinese":"您编写的代码将会简单明了。"},{"english":"Most of the book is about straight-up financial planning, though.","chinese":"书中的大部分内容都是简单明了的财务计划。"},{"english":"Their appeal lies in their utter simplicity. You do not need to understand a complex system of betting, as in craps.","chinese":"老虎机的魅力在于其彻底的简单明了。"},{"english":"Associating a page with a datapool is straightforward.","chinese":"将页面同数据池相关联是一项简单明了的操作。"},{"english":"For all roles, there's a clear, hierarchical folder structure that is intuitive to navigate.","chinese":"所有角色都有一个层次分明的目录结构，简单明了。"},{"english":"The key is to keep the report concise and simple. Avoid jargon and use Plain English.","chinese":"报告关键在于简单明了，要用大白话，不要使用行话。"},{"english":"Exploration testing the new model is fairly straightforward.","chinese":"对新模型的探察测试简单明了。"},{"english":"Agency and Partnership, by contrast, seemed straightforward enough.","chinese":"相反，“代理与合伙人”这门课则显得很简单明了。"},{"english":"Be concise and succinct in all descriptions and avoid the use pronouns and articles (a, an, the) whenever possible.","chinese":"任何描述都要简单明了，尽可能不要使用代词或冠词。"},{"english":"Critics of this system argue for the simplicity of direct election.","chinese":"不赞成这种制度的人士认为直接选举更简单明了。"}],"related":[]}