{"definition":["to control"],"pinyin":["guan3 kong4"],"traditional":["管控"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"管控","characters":[{"definition":["variant of 管[guan3]","surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["guan3","Guan3","guan3"],"word":"管"},{"definition":["to control\/to accuse\/to charge\/to sue\/to invert a container to empty it\/(suffix) (slang) buff\/enthusiast\/devotee\/-phile or -philia"],"pinyin":["kong4"],"word":"控"}],"containing_words":[],"sentences":[{"english":"Is there an evidence that black oxide thickness is well controlled?","chinese":"是否能证明黑化厚度有很好的管控？"},{"english":"The pressure in the swim bladder is regulated by a gas gland.","chinese":"鱼鳔中的压力由一个气体腺来管控。"},{"english":"With so much top line growth hitting the books they stop monitoring invoices and expense reports.","chinese":"因为收入丰厚，他们也就不再管控支出报告了。"},{"english":"Is the front-to-back registration on layers measured and controlled?","chinese":"是否测试并管控层间上下对准度？"},{"english":"The Russians asserted their intention to keep control of the airport.","chinese":"不过俄罗斯方面宣称他们的意图是为了管控机场。"},{"english":"A financial budget and other system modules to achieve procurement budget reasonable control.","chinese":"结合财务预算等系统模块，实现采购预算的合理管控。"},{"english":"Chavez last week announced an increase in the regulated prices of corn and sorghum.","chinese":"上周查韦斯刚刚宣布提高玉米和高粱的管控价格。"},{"english":"Study on Traffic Flow and its Management - control Based on Seif - organization Theory.","chinese":"基于自组织理论的交通流及其管控研究。"},{"english":"Are thermal stressed cross-sections performed as an in-process plating control?","chinese":"制程电镀管控是否有热应力切片试验？"},{"english":"Some employees need high amounts of control and encouragement.","chinese":"某些下属需要相当多的管控与鼓励。"},{"english":"Is there evidence to demonstrate that spindle run-out is well controlled?","chinese":"是否能证明钻轴偏移管控良好？"},{"english":"Are the maximum number of re-sharpens documented &controlled?","chinese":"是否有文件规定并对最大研磨次数进行管控？"},{"english":"Also, inventoried under FIFO with expired date control?","chinese":"并且，到期管控有先进先出目录？"},{"english":"Are the customer specific ENIG thickness requirements documented on the traveler?","chinese":"是否有文件规定按照客人规定的化镍金厚度进行管控？"},{"english":"Is the lay-up done in a clean room with adequate temperature and humidity control?","chinese":"叠合线无尘室是否有相应的温度与湿度管控？"},{"english":"Are cross-sections performed as an in-process plating control?","chinese":"制程电镀管控是否有进行切片确认？"}],"related":[{"definition":["to supervise\/to manage\/to administer\/management\/administration\/CL:個|个[ge4]"],"pinyin":["guan3 li3"],"word":"管理"},{"definition":["to control\/to restrict\/(PRC law) non-custodial sentence with specified restrictions on one's activities for up to 3 years (e.g. not to participate in demonstrations)"],"pinyin":["guan3 zhi4"],"word":"管制"},{"definition":["to prevent and control (e.g. the spread of a communicable disease)"],"pinyin":["fang2 kong4"],"word":"防控"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落实"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"监管"},{"definition":["to increase (e.g. one's effort)"],"pinyin":["jia1 da4"],"word":"加大"},{"definition":["micromanagement"],"pinyin":["xi4 hua4 guan3 li3"],"word":"细化管理"},{"definition":["to govern\/to administer\/to manage\/to control\/governance"],"pinyin":["zhi4 li3"],"word":"治理"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"规范"},{"definition":["to investigate strictly"],"pinyin":["yan2 cha2"],"word":"严查"},{"definition":["normalized (statistics)\/to normalize (relations etc)\/to become the norm"],"pinyin":["chang2 tai4 hua4"],"word":"常态化"},{"definition":["measure\/step\/CL:個|个[ge4]"],"pinyin":["cuo4 shi1"],"word":"措施"},{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"实行"},{"definition":["to strike a severe blow\/to crack down\/to take strong measures"],"pinyin":["yan2 li4 da3 ji1"],"word":"严厉打击"},{"definition":["to ensure\/to guarantee"],"pinyin":["que4 bao3"],"word":"确保"},{"definition":["to give a more granular level of detail\/to elaborate\/to refine\/to become more differentiated"],"pinyin":["xi4 hua4"],"word":"细化"}]}