{"definition":["to tell fox ghost stories around a bonfire and incite rebellion\/an uprising is afoot (idiom)"],"pinyin":["gou1 huo3 hu2 ming2"],"traditional":["篝火狐鳴"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"篝火狐鸣","characters":[{"definition":["bamboo frame for drying clothes\/bamboo cage"],"pinyin":["gou1"],"word":"篝"},{"definition":["fire\/urgent\/ammunition\/fiery or flaming\/internal heat (Chinese medicine)\/hot (popular)\/classifier for military units (old)\/Kangxi radical 86","surname Huo"],"pinyin":["huo3","Huo3"],"word":"火"},{"definition":["fox"],"pinyin":["hu2"],"word":"狐"},{"definition":["to cry (of birds, animals and insects)\/to make a sound\/to voice (one's gratitude, grievance etc)"],"pinyin":["ming2"],"word":"鸣"}],"containing_words":[],"sentences":[],"related":[{"definition":["Wu Guang (died 208 BC), Qin dynasty rebel, leader of the Chen Sheng Wu Guang Uprising 陳勝吳廣起義|陈胜吴广起义[Chen2 Sheng4 Wu2 Guang3 Qi3 yi4]"],"pinyin":["Wu2 Guang3"],"word":"吴广"},{"definition":["Chen Sheng (died 208 BC), Qin dynasty rebel, leader of the Chen Sheng Wu Guang Uprising 陳勝吳廣起義|陈胜吴广起义[Chen2 Sheng4 Wu2 Guang3 Qi3 yi4]"],"pinyin":["Chen2 Sheng4"],"word":"陈胜"},{"definition":["lit. secretly crossing the Wei River 渭河[Wei4 He2] at Chencang (idiom, refers to a stratagem used by Liu Bang 劉邦|刘邦[Liu2 Bang1] in 206 BC against Xiang Yu 項羽|项羽[Xiang4 Yu3] of Chu)\/fig. to feign one thing while doing another\/to cheat under cover of a diversion"],"pinyin":["an4 du4 Chen2 cang1"],"word":"暗渡陈仓"},{"definition":["lit. Xiang Zhuang performs the sword dance, but his mind is set on Liu Bang 劉邦|刘邦[Liu2 Bang1] (idiom, refers to plot to kill Liu Bang during Feast at Hongmen 鴻門宴|鸿门宴[Hong2 men2 Yan4] in 206 BC)\/fig. an elaborate deception hiding malicious intent"],"pinyin":["Xiang4 Zhuang1 wu3 jian4"],"word":"项庄舞剑"},{"definition":["lit. the birds are over, the bow is put away (idiom); fig. to get rid of sb once he has served his purpose"],"pinyin":["niao3 jin4 gong1 cang2"],"word":"鸟尽弓藏"},{"definition":["lit. Xiang Zhuang performs the sword dance, but his mind is set on Liu Bang 劉邦|刘邦[Liu2 Bang1] (idiom); refers to 206 BC plot to murder Liu Bang, aka Duke of Pei 沛公[Pei4 gong1] and the future Han emperor, during a sword dance at Feast at Hongmen 鴻門宴|鸿门宴[Hong2 men2 Yan4]\/an elaborate deception to hide malicious intent"],"pinyin":["Xiang4 Zhuang1 wu3 jian4 , yi4 zai4 Pei4 gong1"],"word":"项庄舞剑，意在沛公"},{"definition":["lit. to boil the hound once it caught the rabbit (idiom)\/fig. to get rid of sb once he has served his purpose"],"pinyin":["tu4 si3 gou3 peng1"],"word":"兔死狗烹"},{"definition":["lit. using straw boats to borrow arrows (idiom, from 三國演義|三国演义[San1 guo2 Yan3 yi4])\/fig. to use others' manpower and resources for one's own ends"],"pinyin":["cao3 chuan2 jie4 jian4"],"word":"草船借箭"},{"definition":["to leave the net open on three sides (idiom); let the caged bird fly\/to give one's opponent a way out\/lenient treatment"],"pinyin":["wang3 kai1 san1 mian4"],"word":"网开三面"},{"definition":["crowing like a cock and stealing like a dog (idiom)\/bag of tricks\/useful talents"],"pinyin":["ji1 ming2 gou3 dao4"],"word":"鸡鸣狗盗"},{"definition":["stratagem of sowing dissension\/CL:條|条[tiao2]"],"pinyin":["fan3 jian4 ji4"],"word":"反间计"},{"definition":["lit. a monkey wearing a hat (idiom)\/fig. worthless person in imposing attire"],"pinyin":["mu4 hou2 er2 guan4"],"word":"沐猴而冠"},{"definition":["Xiang Yu the Conqueror (232-202 BC), warlord defeated by first Han emperor"],"pinyin":["Xiang4 Yu3"],"word":"项羽"},{"definition":["lit. to besiege 魏[Wei4] and rescue 趙|赵[Zhao4] (idiom)\/fig. to relieve a besieged ally by attacking the home base of the besiegers"],"pinyin":["wei2 Wei4 jiu4 Zhao4"],"word":"围魏救赵"},{"definition":["to burn the Confucian classics and bury alive the Confucian scholars (acts supposedly committed by the first emperor 秦始皇[Qin2 Shi3 huang2])"],"pinyin":["fen2 shu1 keng1 ru2"],"word":"焚书坑儒"},{"definition":["the empty city stratagem (in which Zhuge Liang presents himself as unperturbed while making it evident that his city is undefended, hoping his adversary will suspect an ambush)\/double bluff"],"pinyin":["kong1 cheng2 ji4"],"word":"空城计"}]}