{"definition":["to make up and go on stage (idiom); to embark on a career (esp. in politics or crime)"],"pinyin":["fen3 mo4 deng1 chang3"],"traditional":["粉墨登場"],"rank":32477.0,"normalized_rank":0.4543953660822968,"fraction":7.564560623985324e-7,"cumulative_fraction":0.992337691297292,"word":"粉墨登场","characters":[{"definition":["powder\/cosmetic face powder\/food prepared from starch\/noodles or pasta made from any kind of flour\/whitewash\/white\/pink"],"pinyin":["fen3"],"word":"粉"},{"definition":["surname Mo\/abbr. for 墨西哥[Mo4 xi1 ge1], Mexico","ink stick\/China ink\/CL:塊|块[kuai4]\/corporal punishment consisting of tattooing characters on the victim's forehead"],"pinyin":["Mo4","mo4"],"word":"墨"},{"definition":["to scale (a height)\/to ascend\/to mount\/to publish or record\/to enter (e.g. in a register)\/to press down with the foot\/to step or tread on\/to put on (shoes or trousers) (dialect)\/to be gathered and taken to the threshing ground (old)"],"pinyin":["deng1"],"word":"登"},{"definition":["threshing floor\/classifier for events and happenings: spell, episode, bout","large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","variant of 場|场[chang2]","variant of 場|场[chang3]"],"pinyin":["chang2","chang3","chang2","chang3"],"word":"场"}],"containing_words":[],"sentences":[{"english":"Does that spell the end of a distinctive gay culture?","chinese":"这是否意味着卓尔不同的同志文化要粉墨登场呢。"},{"english":"And, white first, grow incarnadined, because.","chinese":"先是苍白，而后粉墨登场。"},{"english":"THIS spring the bad boys of British art are ★making a comeback[2].","chinese":"今春，英国艺术界的坏孩子再次粉墨登场了。"},{"english":"It didn't take long for other accoutrements of trash culture to surface.","chinese":"过后不久，其它形式的文化垃圾也纷纷粉墨登场。"},{"english":"The Tokugawa shogunate arose after over a century of civil war.","chinese":"经过了一个世纪的内战，德川幕府粉墨登场。"}],"related":[{"definition":["large-scale Chinese opera\/Beijing opera\/major dramatic production (movie, TV series etc)"],"pinyin":["da4 xi4"],"word":"大戏"},{"definition":["to display one's remarkable skill or prowess\/to give full play to one's brilliant abilities"],"pinyin":["da4 xian3 shen2 tong1"],"word":"大显神通"},{"definition":["to beat the gong to open a performance"],"pinyin":["kai1 luo2"],"word":"开锣"},{"definition":["(fig.) to raise the curtain\/to lift the curtain\/to be a curtain raiser for"],"pinyin":["la1 kai1 xu4 mu4"],"word":"拉开序幕"},{"definition":["lit. the Eight Immortals cross the sea, each showing his own special talent (idiom)\/fig. (of each individual in a group) to give full play to one's unique capabilities"],"pinyin":["Ba1 xian1 guo4 hai3 , ge4 xian3 shen2 tong1"],"word":"八仙过海，各显神通"},{"definition":["to surge like a gathering storm (idiom)\/to grow by leaps and bounds"],"pinyin":["feng1 qi3 yun2 yong3"],"word":"风起云涌"},{"definition":["brilliant and varied\/(often in the combination 精彩纷呈)"],"pinyin":["fen1 cheng2"],"word":"纷呈"},{"definition":["prologue"],"pinyin":["xu4 mu4"],"word":"序幕"},{"definition":["(of a person) to return to the fray after a period of inactivity\/to jump back into the thick of things\/(of sth that was once popular) to be resurrected\/to make a comeback"],"pinyin":["chong2 chu1 jiang1 hu2"],"word":"重出江湖"},{"definition":["evil monsters\/(fig.) bad characters\/(political) bad elements"],"pinyin":["niu2 gui3 she2 shen2"],"word":"牛鬼蛇神"},{"definition":["to come thick and fast (idiom)"],"pinyin":["fen1 zhi4 ta4 lai2"],"word":"纷至沓来"},{"definition":["unwilling to remain lonely or idle\/unwilling to be left out"],"pinyin":["bu4 gan1 ji4 mo4"],"word":"不甘寂寞"},{"definition":["next-to-last item on a program (theater)\/climax"],"pinyin":["ya1 zhou4 xi4"],"word":"压轴戏"},{"definition":["all kinds of\/all sorts of\/every (different) kind of"],"pinyin":["xing2 xing2 se4 se4"],"word":"形形色色"},{"definition":["a hundred flowers bloom (idiom); let the arts have free expression"],"pinyin":["bai3 hua1 qi2 fang4"],"word":"百花齐放"},{"definition":["to screen (a movie)\/to stage (a play)\/a screening\/a staging"],"pinyin":["shang4 yan3"],"word":"上演"}]}