{"definition":["skillful in\/proficient in\/adept at"],"pinyin":["jing1 yu2"],"traditional":["精於"],"rank":27930.0,"normalized_rank":0.3907769367453444,"fraction":0.000001135997892239556,"cumulative_fraction":0.9881016964634748,"word":"精于","characters":[{"definition":["essence\/extract\/vitality\/energy\/semen\/sperm\/mythical goblin spirit\/highly perfected\/elite\/the pick of sth\/proficient (refined ability)\/extremely (fine)\/selected rice (archaic)"],"pinyin":["jing1"],"word":"精"},{"definition":["surname Yu","to go\/to take\/sentence-final interrogative particle\/variant of 於|于[yu2]","in\/at\/to\/from\/by\/than\/out of"],"pinyin":["Yu2","yu2","yu2"],"word":"于"}],"containing_words":[{"definition":["to be proficient in the area of\/skilled in this field"],"pinyin":["jing1 yu2 ci3 dao4"],"word":"精于此道"},{"definition":["mastery of study lies in diligence (idiom). You can only master a subject by assiduous study.\/Excellence in work is only possible with diligence.\/Practice makes perfect."],"pinyin":["ye4 jing1 yu2 qin2"],"word":"业精于勤"}],"sentences":[{"english":"I hope that I can excel in anything I study.","chinese":"我希望我能专精于我所读的任何东西。"},{"english":"He was a man of much worldly wisdom, and in some ways resembled Voltaire.","chinese":"他精于人情世故，在某些方面酷似伏尔泰。"},{"english":"Mr. A is far from being good at computer software.","chinese":"先生决非精于电脑的软体。"},{"english":"Offworld Ishi Tib are known for their devotion to nature, and for their excellent managerial skills.","chinese":"离乡在外的伊希提卜人以崇拜自然，精于管理而闻名。"},{"english":"So that each man practicing his own which is one, will not become many but one.","chinese":"所以一个人可以专精于一件事，而非多件。"},{"english":"The Japanese are calculating, cunning, and wicked.","chinese":"日本人是精于算计的，狡猾的，缺德的。"},{"english":"As a result, historically SLAs have specialized in savings deposits and mortgage lending.","chinese":"因此，存贷款社长期专精于储蓄账户和抵押借贷。"},{"english":"\"Balenciaga\"Fashion has always been good at cutting and sewing.","chinese":"“巴黎世家”服装一向是精于裁剪和缝制。"},{"english":"Especially is Dennie good at swimming.","chinese":"尤其是丹尼精于游泳。"},{"english":"These lightly armed and armoured swordsmen are adept at raiding and looting.","chinese":"格温特突袭者挥舞长剑，轻装上阵，精于劫掠和突击。"},{"english":"Time is a dressmaker, specializing in alterations.","chinese":"时间是一位精于修改的裁缝。"},{"english":"Kanon, we visualize customer's marketingncept and exhibiting elements.","chinese":"卡能，精于将客户的营销理念与展示要素完美结合。"},{"english":"Dictionary writer must is skilled in the art of definition.","chinese":"编纂者必须精于给词语下定义的技巧。"},{"english":"Danny used to be a short-con artist who excelled at card tricks and pick- pocketing .","chinese":"丹尼曾是小拐小骗方面的艺术家，精于牌戏和摸包。"},{"english":"Shirov is both a representative of romantic chess and an endgame virtuoso.","chinese":"希罗夫既是浪漫派的代表又是一个精于残局的大师。"},{"english":"Proficient in the quarter of the rationale for Mr. painting paintings into books, and on natural changes in density.","chinese":"精于画理的季先生以画入书，疏密变化天成而就。"}],"related":[{"definition":["to be proficient in\/to master (a subject)"],"pinyin":["jing1 tong1"],"word":"精通"},{"definition":["without authority\/to usurp\/to arrogate to oneself\/to monopolize\/expert in\/to be good at"],"pinyin":["shan4"],"word":"擅"},{"definition":["to be good at\/to be expert in"],"pinyin":["shan4 chang2"],"word":"擅长"},{"definition":["such matters\/things like this\/this line of work\/this pursuit\/this hobby\/this endeavor"],"pinyin":["ci3 dao4"],"word":"此道"},{"definition":["to be good at\/to be adept at"],"pinyin":["shan4 yu2"],"word":"善于"},{"definition":["proficient (in sth)\/to understand sth through and through"],"pinyin":["tong1 xiao3"],"word":"通晓"},{"definition":["to be adept in\/to excel at"],"pinyin":["chang2 yu2"],"word":"长于"},{"definition":["to be proficient in"],"pinyin":["an1 shu2"],"word":"谙熟"},{"definition":["to research carefully\/to study intensively"],"pinyin":["jing1 yan2"],"word":"精研"},{"definition":["cunning\/dexterous\/ingenious"],"pinyin":["ji1 qiao3"],"word":"机巧"},{"definition":["to have a skill\/to have a lot on the ball\/to have an affair"],"pinyin":["you3 yi1 shou3"],"word":"有一手"},{"definition":["to know sth fluently\/well-versed"],"pinyin":["shu2 an1"],"word":"熟谙"},{"definition":["refined\/profound"],"pinyin":["jing1 shen1"],"word":"精深"},{"definition":["excellent\/superlative"],"pinyin":["gao1 chao1"],"word":"高超"},{"definition":["to be infatuated with"],"pinyin":["zui4 xin1 yu2"],"word":"醉心于"},{"definition":["to be adept at sth\/to be an expert in a trade or profession"],"pinyin":["zai4 hang2"],"word":"在行"}]}