{"definition":["quality goods\/premium product\/fine work (of art)"],"pinyin":["jing1 pin3"],"traditional":["精品"],"rank":3914.0,"normalized_rank":0.05476193807451765,"fraction":0.000034141977258603004,"cumulative_fraction":0.8277525043573866,"word":"精品","characters":[{"definition":["essence\/extract\/vitality\/energy\/semen\/sperm\/mythical goblin spirit\/highly perfected\/elite\/the pick of sth\/proficient (refined ability)\/extremely (fine)\/selected rice (archaic)"],"pinyin":["jing1"],"word":"精"},{"definition":["article\/commodity\/product\/goods\/kind\/grade\/rank\/character\/disposition\/nature\/temperament\/variety\/to taste sth\/to sample\/to criticize\/to comment\/to judge\/to size up\/fret (on a guitar or lute)"],"pinyin":["pin3"],"word":"品"}],"containing_words":[{"definition":["boutique"],"pinyin":["jing1 pin3 dian4"],"word":"精品店"}],"sentences":[{"english":"Quality image, brand name benefit, do the proven route, right-time & right-place development.","chinese":"树精品意识，创品牌效益，走规模道路，抢时机发展？"},{"english":"The construction of fine courses is a main component of the construction of an examplar higher vocational college.","chinese":"精品课程建设是示范院校专业建设的主要内涵。"},{"english":"For handed down your porcelain rare high-quality goods.","chinese":"为传世汝瓷罕见之精品。"},{"english":"This is a boutique project for \"karis\" in a shopping center in Hiroshima.","chinese":"这是一个“卡利斯在广岛购物中心”的精品工程。"},{"english":"The packaging and presentation you get with designer shoes gives you that whole experience.","chinese":"你买的精品鞋的包装和说明会给你一次完整经验的。"},{"english":"Temple Hall of smart structures, the resplendent, for payment of the fine on behalf of the Building.","chinese":"寺内殿堂构造灵巧，金碧辉煌，为金代建筑之精品。"},{"english":"A series of extractive lectures have been held by the institute for 10 times.","chinese":"该学院推出的精品系列讲座已举办10场。"},{"english":"I'd like to buy sone Chinese handicrafts.","chinese":"我想要中国的精品。"},{"english":"There are many upscale fashion shops and trendy boutiques in the area.","chinese":"有许多高档时装店和时髦的精品屋领域。"},{"english":"Cable tray to create a boutique supermarket industry.","chinese":"努力打造电缆桥架行业的精品超市。"},{"english":"Just recently, the station was also named the whole coal sample fine station.","chinese":"就在前不久，该站场还被评为全煤样板精品站场。"},{"english":"Dr. Liu on the returned overseas Chinese students' outstanding projects recommendation of Zhongguancun Science Park.","chinese":"参加中关村科技园区留学人员精品项目推荐会。"},{"english":"These exhibits includes some fine examples of medieval pottery.","chinese":"这些展览品中包括一些中世纪陶器精品。"},{"english":"The west garden in Liuhua Park is a famous miniascape garden and one of the excellence Lingnan Gardens.","chinese":"流花西苑是广州著名的盆景园，也是岭南园林的精品。"},{"english":"For years Young Lion worked diligently in creating high quality and industry breaking space sculpt¬ures.","chinese":"多年来雅林士达公司致力于创造高质量的精品空间。"},{"english":"Planted 300 acres of apple orchard and 500 acres of fine chestnut base.","chinese":"种植了300亩精品苹果园和500亩板栗基地。"}],"related":[{"definition":["valuable object\/curio"],"pinyin":["zhen1 pin3"],"word":"珍品"},{"definition":["masterpiece\/fine piece of writing"],"pinyin":["jia1 zuo4"],"word":"佳作"},{"definition":["character\/intrinsic quality (of a person)\/quality (of a product or service, or as in \"quality of life\", \"air quality\" etc)"],"pinyin":["pin3 zhi4"],"word":"品质"},{"definition":["delicate\/fine\/refinement"],"pinyin":["jing1 mei3"],"word":"精美"},{"definition":["to appreciate (as a connoisseur)"],"pinyin":["jian4 shang3"],"word":"鉴赏"},{"definition":["article\/commodity\/product\/goods\/kind\/grade\/rank\/character\/disposition\/nature\/temperament\/variety\/to taste sth\/to sample\/to criticize\/to comment\/to judge\/to size up\/fret (on a guitar or lute)"],"pinyin":["pin3"],"word":"品"},{"definition":["to put effort into (work, farming, writing etc)\/a masterpiece"],"pinyin":["li4 zuo4"],"word":"力作"},{"definition":["excellent quality"],"pinyin":["you1 zhi4"],"word":"优质"},{"definition":["special performance"],"pinyin":["zhuan1 chang3"],"word":"专场"},{"definition":["first-class\/best quality\/also pr. [shang4 sheng4]"],"pinyin":["shang4 cheng2"],"word":"上乘"},{"definition":["lit. to fly one's banner on a solitary tree (idiom); fig. to act as a loner\/to stand out\/to develop one's own school\/to have attitude of one's own"],"pinyin":["du2 shu4 yi1 zhi4"],"word":"独树一帜"},{"definition":["gem\/(fig.) rare and valuable item\/gem\/treasure"],"pinyin":["gui1 bao3"],"word":"瑰宝"},{"definition":["characteristic\/distinguishing feature or quality"],"pinyin":["te4 se4"],"word":"特色"},{"definition":["original and ingenious (idiom)\/to show great creativity"],"pinyin":["du2 ju4 jiang4 xin1"],"word":"独具匠心"},{"definition":["to perfect sth that is already outstanding (idiom); constantly improving"],"pinyin":["jing1 yi4 qiu2 jing1"],"word":"精益求精"},{"definition":["best quality\/item of the highest quality\/(slang) outrageous\/annoying in the extreme\/gross\/person with these qualities"],"pinyin":["ji2 pin3"],"word":"极品"}]}