{"definition":["lit. sincerity splits open metal and metal (idiom); if you put your heart to it, you can break up metal and rocks\/With a will, you can achieve anything."],"pinyin":["jing1 cheng2 suo3 zhi4 , jin1 shi2 wei4 kai1"],"traditional":["精誠所至，金石為開"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"精诚所至，金石为开","characters":[{"definition":["essence\/extract\/vitality\/energy\/semen\/sperm\/mythical goblin spirit\/highly perfected\/elite\/the pick of sth\/proficient (refined ability)\/extremely (fine)\/selected rice (archaic)"],"pinyin":["jing1"],"word":"精"},{"definition":["sincere\/authentic\/really\/truly"],"pinyin":["cheng2"],"word":"诚"},{"definition":["actually\/place\/classifier for houses, small buildings, institutions etc\/that which\/particle introducing a relative clause or passive\/CL:個|个[ge4]"],"pinyin":["suo3"],"word":"所"},{"definition":["to arrive\/most\/to\/until"],"pinyin":["zhi4"],"word":"至"},{"word":"，"},{"definition":["surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)","gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Jin1","jin1"],"word":"金"},{"definition":["dry measure for grain equal to ten dou 斗\/ten pecks\/one hundred liters","surname Shi","rock\/stone\/stone inscription\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["dan4","Shi2","shi2"],"word":"石"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"开"}],"containing_words":[],"sentences":[],"related":[{"definition":["with a will, you can achieve anything (idiom); cf 精誠所至，金石為開|精诚所至，金石为开[jing1 cheng2 suo3 zhi4 , jin1 shi2 wei4 kai1]"],"pinyin":["jing1 cheng2 suo3 zhi4"],"word":"精诚所至"},{"definition":["If you work at it hard enough, you can grind an iron bar into a needle.\/cf idiom 磨杵成針|磨杵成针, to grind an iron bar down to a fine needle (idiom); fig. to persevere in a difficult task\/to study diligently"],"pinyin":["zhi3 yao4 gong1 fu5 shen1 , tie3 chu3 mo2 cheng2 zhen1"],"word":"只要功夫深，铁杵磨成针"},{"definition":["there is nothing the determined person can't accomplish (idiom)\/persistence will overcome"],"pinyin":["shi4 shang4 wu2 nan2 shi4 , zhi3 pa4 you3 xin1 ren2"],"word":"世上无难事，只怕有心人"},{"definition":["a really determined person will find a solution (idiom); where there's a will, there's a way"],"pinyin":["you3 zhi4 zhe3 shi4 jing4 cheng2"],"word":"有志者事竟成"},{"definition":["just as distance determines the stamina of a horse, so does time reveal a person's true heart (proverb)"],"pinyin":["lu4 yao2 zhi1 ma3 li4 , ri4 jiu3 jian4 ren2 xin1"],"word":"路遥知马力，日久见人心"},{"definition":["lit. nothing is difficult on this earth, if your mind is set (idiom)"],"pinyin":["tian1 xia4 wu2 nan2 shi4 , zhi3 pa4 you3 xin1 ren2"],"word":"天下无难事，只怕有心人"},{"definition":["dripping water penetrates the stone (idiom); constant perseverance yields success\/You can achieve your aim if you try hard without giving up.\/Persistent effort overcomes any difficulty."],"pinyin":["shui3 di1 shi2 chuan1"],"word":"水滴石穿"},{"definition":["True gold fears no fire. (idiom)"],"pinyin":["zhen1 jin1 bu4 pa4 huo3 lian4"],"word":"真金不怕火炼"},{"definition":["effort will undoubtedly lead to success (idiom)"],"pinyin":["gong1 dao4 zi4 ran2 cheng2"],"word":"功到自然成"},{"definition":["the matter depends on the individual (idiom); it is a matter for your own effort\/With effort, one can achieve anything."],"pinyin":["shi4 zai4 ren2 wei2"],"word":"事在人为"},{"definition":["the road to happiness is strewn with setbacks (idiom)"],"pinyin":["hao3 shi4 duo1 mo2"],"word":"好事多磨"},{"definition":["lit. not to stop until one reaches the Yellow River (idiom)\/fig. to persevere until one reaches one's goal\/to keep going while some hope is left"],"pinyin":["bu4 dao4 Huang2 He2 xin1 bu4 si3"],"word":"不到黄河心不死"},{"definition":["you get what you put in\/you reap what you sow"],"pinyin":["yi1 fen1 geng1 yun2 , yi1 fen1 shou1 huo4"],"word":"一分耕耘，一分收获"},{"definition":["Heaven rewards the diligent. (idiom)"],"pinyin":["tian1 dao4 chou2 qin2"],"word":"天道酬勤"},{"definition":["to talk until one is blue in the face"],"pinyin":["mo2 po4 zui3 pi2"],"word":"磨破嘴皮"},{"definition":["earnestly and sincerely (idiom)\/with all sincerity"],"pinyin":["cheng2 xin1 shi2 yi4"],"word":"诚心实意"}]}