{"definition":["to be proficient in\/to master (a subject)"],"pinyin":["jing1 tong1"],"traditional":["精通"],"rank":12899.0,"normalized_rank":0.1804737453304045,"fraction":0.000005424236658935675,"cumulative_fraction":0.9490990834781096,"word":"精通","characters":[{"definition":["essence\/extract\/vitality\/energy\/semen\/sperm\/mythical goblin spirit\/highly perfected\/elite\/the pick of sth\/proficient (refined ability)\/extremely (fine)\/selected rice (archaic)"],"pinyin":["jing1"],"word":"精"},{"definition":["to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc","classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)"],"pinyin":["tong1","tong4"],"word":"通"}],"containing_words":[],"sentences":[{"english":"He's a good lecturer as he really knows his stuff.","chinese":"他是位好讲师，因为他确实精通业务。"},{"english":"Skeletal Mastery research time reduced to 30 seconds from 45 seconds.","chinese":"精通招唤骷髅的研发时间从45秒缩减为30秒。"},{"english":"Skilled in the repair and maintenance of refrigeration systems and cold rooms.","chinese":"精通冷冻系统和冷藏室的维修和保养工作。"},{"english":"You're great at sales, but I know you know something about computers too.","chinese":"你精通营销，但是我知道你也懂得一些电脑知识。"},{"english":"Formic perfectness and OK treat kind of rheumatism?","chinese":"蚁精通可以治疗类风湿吗？"},{"english":"At times like these, words can fail even the most seasoned polyglot.","chinese":"碰到这样的情况，即使精通多国语言，也会变得词穷。"},{"english":"Knowledge of production planning and ERP system is preferred.","chinese":"精通生产规划和ERP系统是首选。"},{"english":"As a child, Jaymay played the piano and violin.","chinese":"还是个孩子的时候，洁玫就精通弹钢琴和小提琴。"},{"english":"They can also be invaluable in creating a well versed cadre of NCOs and Officers.","chinese":"这样打造出精通熟练的士官和军官干部是非常宝贵的。"},{"english":"I want to be good at playing the drums.","chinese":"我想要精通打爵士鼓。"},{"english":"It takes time to learn how to apply them and become proficient with them.","chinese":"学会如何运用它们和对它们精通会花费大量的时间。"},{"english":"Della, being slender , had mastered the art.","chinese":"德拉身材苗条，已精通了这门子艺术。"},{"english":"Have many years of website building experience, masters in website code designing, UED(user experience designing).","chinese":"拥有多年建站经验，精通于网页代码及用户体验设计。"},{"english":"Many of our staff force including the consultants are multi-lingual.","chinese":"我们的员工队伍和咨询师们都精通不同语言。"},{"english":"For those of us not versed in higher mathematics, it is impossible.","chinese":"对于那些不精通高等数学的人来说，这是不可能的。"},{"english":"But they say I need to master English, too.","chinese":"但是他们说我同时也需要更加精通英语。"}],"related":[{"definition":["proficient (in sth)\/to understand sth through and through"],"pinyin":["tong1 xiao3"],"word":"通晓"},{"definition":["skillful in\/proficient in\/adept at"],"pinyin":["jing1 yu2"],"word":"精于"},{"definition":["profound"],"pinyin":["gao1 shen1"],"word":"高深"},{"definition":["to be good at\/to be expert in"],"pinyin":["shan4 chang2"],"word":"擅长"},{"definition":["level of mastery (of a skill or area of knowledge)\/(archaic) to pay a visit to sb"],"pinyin":["zao4 yi4"],"word":"造诣"},{"definition":["lit. doesn't (even) enter a single aperture (of one's head)\/I don't understand a word (idiom)\/it's all Greek to me"],"pinyin":["yi1 qiao4 bu4 tong1"],"word":"一窍不通"},{"definition":["to skim (through a book)\/to read cursorily\/to dip into"],"pinyin":["she4 lie4"],"word":"涉猎"},{"definition":["refined\/profound"],"pinyin":["jing1 shen1"],"word":"精深"},{"definition":["to be proficient in"],"pinyin":["an1 shu2"],"word":"谙熟"},{"definition":["all-rounder\/versatile"],"pinyin":["quan2 cai2"],"word":"全才"},{"definition":["such matters\/things like this\/this line of work\/this pursuit\/this hobby\/this endeavor"],"pinyin":["ci3 dao4"],"word":"此道"},{"definition":["erudite\/profound\/learned\/extremely knowledgeable"],"pinyin":["yuan1 bo2"],"word":"渊博"},{"definition":["erudite and multi-talented (idiom); versatile and able"],"pinyin":["bo2 xue2 duo1 cai2"],"word":"博学多才"},{"definition":["to major in"],"pinyin":["zhu3 xiu1"],"word":"主修"},{"definition":["excellent\/superlative"],"pinyin":["gao1 chao1"],"word":"高超"},{"definition":["dabbler\/smatterer\/tactless and impulsive person"],"pinyin":["ban4 diao4 zi5"],"word":"半吊子"}]}