{"definition":["in short supply\/scarce"],"pinyin":["jin3 que1"],"traditional":["緊缺"],"rank":9131.0,"normalized_rank":0.12775453667818618,"fraction":0.000009666200517916562,"cumulative_fraction":0.9219486491865624,"word":"紧缺","characters":[{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"紧"},{"definition":["deficiency\/lack\/scarce\/vacant post\/to run short of"],"pinyin":["que1"],"word":"缺"}],"containing_words":[],"sentences":[{"english":"Propionic acid is product heavily short of in our country.","chinese":"丙酸是目前国内十分紧缺的一种产品。"},{"english":"Second, the Mid-Autumn festival is coming, especially in the market shortage of maotai liquor.","chinese":"其次，中秋即将来临，茅台酒在市场上尤为紧缺。"},{"english":"Shacheng Harbour Basin is rich in nature resources. It has not been largely developed now, because of short of electric power.","chinese":"沙埕港流域物产丰富，目前因电力紧缺多未开发。"},{"english":"College graduates are not in short supply.","chinese":"本科毕业生也不在是紧缺资源。"},{"english":"The east Haihe River plain area is one of the regions which are short of water resources in China.","chinese":"海河平原东部地区是中国水资源最紧缺的地区之一。"},{"english":"Of course, human resources shortages are not confined to mental health alone.","chinese":"当然，人力资源紧缺并仅不局限于心理卫生。"},{"english":"Meat was scarce during the war and too expensive for ordinary people.","chinese":"战争期间肉类紧缺，贵得普通人家买不起。"},{"english":"The building plans include much needed new office accommodation.","chinese":"建筑规划包括紧缺的新办公用房在内。"},{"english":"With the scarcity of world water resources, water crisis is becoming more serious.","chinese":"由于世界水资源的紧缺，水危机日益严重。"},{"english":"However because of fuel shortages, some aircraft are clogging up the tarmac.","chinese":"然而因为燃料紧缺，许多飞机阻塞了停机坪。"},{"english":"In recent years experienced customs broker in some areas is always more shortage.","chinese":"近几年有经验的报关员在一些地区始终是比较紧缺的。"},{"english":"Municipal wastewater recycling is one of the effective methods to resolve water resource problem.","chinese":"城市污水回用是缓解我国水资源紧缺的有效途径之一。"},{"english":"There is now less movement of money between banks and therefore a shortage of available money.","chinese":"银行间越来越少的货币进入造成了可提供的货币紧缺。"},{"english":"Some regions of the country are already feeling the pinch.","chinese":"中国的部分地区已经感觉到能源紧缺了。"},{"english":"Many of the boats are sunk, along with the soldiers and desperately needed supplies.","chinese":"许多船和士兵都成了鱼食，而供给也紧缺。"},{"english":"On every continent some rivers are drying out, threatening severe water shortages.1?","chinese":"每一块大陆上都有河流枯涸，水资源紧缺日益加剧。"}],"related":[{"definition":["shortage"],"pinyin":["duan3 que1"],"word":"短缺"},{"definition":["very short of (food, clean water etc)\/extreme shortage\/deficit"],"pinyin":["qi2 que1"],"word":"奇缺"},{"definition":["(merchandise) in high demand"],"pinyin":["jin3 qiao4"],"word":"紧俏"},{"definition":["supply does not meet demand"],"pinyin":["gong1 bu4 ying4 qiu2"],"word":"供不应求"},{"definition":["scarce\/scarcity"],"pinyin":["xi1 que1"],"word":"稀缺"},{"definition":["supply exceeds demand"],"pinyin":["gong1 da4 yu2 qiu2"],"word":"供大于求"},{"definition":["to be deficient in sth\/to be short of sth (supplies, money etc)"],"pinyin":["kui4 fa2"],"word":"匮乏"},{"definition":["supply exceeds demand"],"pinyin":["gong1 guo4 yu2 qiu2"],"word":"供过于求"},{"definition":["in short supply\/dire\/tense\/critical\/hard-pressed\/important"],"pinyin":["chi1 jin3"],"word":"吃紧"},{"definition":["to furnish\/to provide\/supply (as in supply and demand)"],"pinyin":["gong1 ji3"],"word":"供给"},{"definition":["supply and demand"],"pinyin":["gong1 xu1"],"word":"供需"},{"definition":["to supply\/to provide\/to offer"],"pinyin":["gong1 ying4"],"word":"供应"},{"definition":["to urgently need\/urgent need"],"pinyin":["ji2 xu1"],"word":"急需"},{"definition":["(of goods) popular\/in great demand"],"pinyin":["qiang3 shou3"],"word":"抢手"},{"definition":["lit. many monks and not much gruel (idiom)\/fig. not enough to go around\/demand exceeds supply"],"pinyin":["seng1 duo1 zhou1 shao3"],"word":"僧多粥少"},{"definition":["property or cash held in reserve\/stock"],"pinyin":["ku4 cun2"],"word":"库存"}]}