{"definition":["to involve\/to affect"],"pinyin":["lei3 ji2"],"traditional":["累及"],"rank":40652.0,"normalized_rank":0.5687742224336463,"fraction":3.610026712295583e-7,"cumulative_fraction":0.996732048207882,"word":"累及","characters":[{"definition":["tired\/weary\/to strain\/to wear out\/to work hard","to accumulate\/to involve or implicate (Taiwan pr. [lei4])\/continuous\/repeated","rope\/to bind together\/to twist around","surname Lei"],"pinyin":["lei4","lei3","lei2","Lei2"],"word":"累"},{"definition":["and\/to reach\/up to\/in time for"],"pinyin":["ji2"],"word":"及"}],"containing_words":[],"sentences":[{"english":"A chronic fungous infection which involves the sebaceous glands and hair follicles may result in alopecia.","chinese":"累及皮脂腺和毛囊的慢性真菌性感染都会引起脱发。"},{"english":"The lumbosacral subdural space is most commonly affected.","chinese":"腰骶部的硬膜下腔是最常见的累及部位。"},{"english":"The infarction is \"transmural\" in that it extends through the full thickness of the wall.","chinese":"梗死是透壁性的即累及心肌的全层。"},{"english":"Mestatatic osteosarcomas usually involve the right side of the heart.","chinese":"转移性骨肉瘤通常累及右心。"},{"english":"It furthers these women’s isolation and social exclusion, and compromises their dignity.","chinese":"进而让这些女性被社会孤立和排斥，累及她们的尊严。"},{"english":"When the right heart was involved, it looked like \"walking stick head\" or \"snakeheads\".","chinese":"累及右心腔时可见似“拐杖头”或“蛇头”状改变。"},{"english":"It often grows through the nasal choana into the nasopharynx.","chinese":"常常可以通过后鼻孔累及鼻咽部。"},{"english":"Symptomatology depends on whether the disease involves the anterior or retrobulbar portion of the orbit.","chinese":"临床症状依靠于病变是否累及眼眶的前方或球后。"},{"english":"To observe the clinical effect of operative treatment of calcaneus fracture involved posterior articular surface.","chinese":"目的观察手术治疗累及后关节面的跟骨骨折效果。"},{"english":"During 2 year follow-up, the skin lesion progressed slowly with no other systemic involvement.","chinese":"随访2年，患者皮损进展缓慢，其他系统未累及。"},{"english":"When disease involves the sphenoid, the sinus can be penetrated either intranasally or through the posterior ethmoid.","chinese":"当病变累及蝶窦，可以经鼻内和后组筛窦进入蝶窦。"},{"english":"Approximately 7% of all tibia plateau fractures affect the posterolateral corner.","chinese":"大约7%的胫骨平台骨折累及后外侧角。"},{"english":"Constant irritability can cause your relationships to suffer and eventually even begin to wither.","chinese":"持续的易怒烦躁会累及你的人际关系并最终使之枯萎。"},{"english":"Most of enlarged nodes was in the right peritracheal and tracheobronchial region, and showed homegeneous density on plain scans.","chinese":"病变多累及右侧气管旁和气管支气管区淋巴结。"},{"english":"A coronal section through the frontal lobes reveals extensive contusions involving the inferior gyri.","chinese":"额叶冠状面显示累及下方脑回的广泛挫伤。"},{"english":"The electrophysiologic and pathologic findings indicate a pattern of axonal loss that predominantly affects large-caliber myelinated fibers.","chinese":"电生理和病理结果显示轴突丢失主要累及粗有髓纤维。"}],"related":[{"definition":["pathological changes\/lesion\/diseased (kidney, cornea etc)"],"pinyin":["bing4 bian4"],"word":"病变"},{"definition":["focal (medicine)"],"pinyin":["ju2 zao4 xing4"],"word":"局灶性"},{"definition":["to be put to a lot of trouble","to get dragged into\/to get involved (on sb else's account)"],"pinyin":["shou4 lei4","shou4 lei3"],"word":"受累"},{"definition":["necrosis"],"pinyin":["huai4 si3"],"word":"坏死"},{"definition":["blockage\/obstruction\/infarction"],"pinyin":["geng3 si3"],"word":"梗死"},{"definition":["acute"],"pinyin":["ji2 xing4"],"word":"急性"},{"definition":["mediastinum (organs and tissues in the thorax between the lungs)"],"pinyin":["zong4 ge2"],"word":"纵隔"},{"definition":["slow and patient\/chronic (disease)\/slow to take effect (e.g. a slow poison)"],"pinyin":["man4 xing4"],"word":"慢性"},{"definition":["lack of blood"],"pinyin":["que1 xue4"],"word":"缺血"},{"definition":["clinical characteristic\/diagnostic trait"],"pinyin":["lin2 chuang2 te4 zheng1"],"word":"临床特征"},{"definition":["meninx\/meninges\/membranes lining the brain"],"pinyin":["nao3 mo2"],"word":"脑膜"},{"definition":["sexually transmitted disease\/venereal disease"],"pinyin":["xing4 ji2 bing4"],"word":"性疾病"},{"definition":["serosa\/serous membrane (smooth moist delicate membranes lining body cavities)"],"pinyin":["jiang1 mo2"],"word":"浆膜"},{"definition":["parotid gland\/saliva gland in cheek"],"pinyin":["sai1 xian4"],"word":"腮腺"},{"definition":["metastasis"],"pinyin":["yuan3 duan1 zhuan3 yi2"],"word":"远端转移"},{"definition":["gangrene"],"pinyin":["huai4 ju1"],"word":"坏疽"}]}