{"definition":["to correct\/to make right"],"pinyin":["jiu1 zheng4"],"traditional":["糾正"],"rank":5493.0,"normalized_rank":0.07685419668965904,"fraction":0.000020945015879776888,"cumulative_fraction":0.8700100828192059,"word":"纠正","characters":[{"definition":["old variant of 糾|纠[jiu1]","to gather together\/to investigate\/to entangle\/to correct"],"pinyin":["jiu1","jiu1"],"word":"纠"},{"definition":["first month of the lunar year","straight\/upright\/proper\/main\/principal\/to correct\/to rectify\/exactly\/just (at that time)\/right (in that place)\/(math.) positive"],"pinyin":["zheng1","zheng4"],"word":"正"}],"containing_words":[],"sentences":[{"english":"But sometimes, ISP's and mail service businesses have no interest in righting what went wrong.","chinese":"但有时，互联网的业务和邮件服务没有兴趣纠正想歪。"},{"english":"If my little bit wrong incoming letter word disease sentence invites help correct that.","chinese":"如果我的来信有一些错词病句请帮忙纠正。"},{"english":"When nonconforming product is corrected it shall be subject to re-verification to demonstrate conformity to the requirements.","chinese":"应对纠正后的产品再次进行验证，以证实符合要求。"},{"english":"Errors are usually less expensive to correct than in implementation.","chinese":"纠正错误的成本比在实现中要低。"},{"english":"Competition can have a powerful corrective effect on market inefficiencies and mis pricings.","chinese":"竞争能够有效纠正市场的无效和错误定价。"},{"english":"This situation needs to be corrected.","chinese":"必须纠正这一状况。"},{"english":"When a mistake is discovered, it should be corrected at once.","chinese":"发现错误应立即纠正。"},{"english":"Rectification of this fault is achieved by insertion of a wedge.","chinese":"嵌入一个楔子就可纠正误差。"},{"english":"It has taken a philosophical shift for researchers to rectify this.","chinese":"研究人员为了纠正这一点已经采取哲学上的转变。"},{"english":"Inefficient uterine action should be corrected before attributing dystocia to a pelvic problem.","chinese":"在骨盆问题引起的难产前，无效的宫缩应该加以纠正。"},{"english":"In addition, the patient or surrogate may correct any historical misinformation at this time.","chinese":"病人或代诉者还可在此时纠正病史中的一些错误信息。"},{"english":"We must guard against and redress all forms of covert protectionist activities.","chinese":"要警惕和纠正形形色色的隐性保护主义行为。"},{"english":"This gives you the opportunity to correct the particular fault.","chinese":"因为，它给你一个机遇来纠正这个特别的毛病。"},{"english":"Establish effective preventive measures and corrective action to ensure that deficiencies do not re-occur.","chinese":"确立有效的预防措施和纠正措施，避免错误再次出现。"},{"english":"Any safety deficiencies or violations must be corrected immediately before proceeding with operations.","chinese":"操作前，必须纠正所有的安全隐患和违章。"},{"english":"At the same time, the error code in communication is corrected by using of repeat transmittal of data in every cycle.","chinese":"同时使用数据循环重发，来纠正数据传输中的误码。"}],"related":[{"definition":["to correct\/to amend\/to put right\/correction\/CL:個|个[ge4]"],"pinyin":["gai3 zheng4"],"word":"改正"},{"definition":["error\/mistake\/CL:個|个[ge4]\/mistaken\/false\/wrong"],"pinyin":["cuo4 wu4"],"word":"错误"},{"definition":["to correct an error"],"pinyin":["jiu1 cuo4"],"word":"纠错"},{"definition":["to correct\/to rectify (e.g. a physical defect such as hearing or vision)\/to cure\/rectification\/correction\/to straighten"],"pinyin":["jiao3 zheng4"],"word":"矫正"},{"definition":["incorrect\/erroneous"],"pinyin":["bu4 zheng4 que4"],"word":"不正确"},{"definition":["to supervise and urge completion of a task\/to urge on"],"pinyin":["du1 cu4"],"word":"督促"},{"definition":["to correct an error"],"pinyin":["jiu1 pian1"],"word":"纠偏"},{"definition":["correct\/proper"],"pinyin":["zheng4 que4"],"word":"正确"},{"definition":["to revise\/to amend"],"pinyin":["xiu1 zheng4"],"word":"修正"},{"definition":["to point out mistakes or weak points for correction\/to comment\/criticism"],"pinyin":["zhi3 zheng4"],"word":"指正"},{"definition":["bad\/harmful\/unhealthy"],"pinyin":["bu4 liang2"],"word":"不良"},{"definition":["to drop a bad habit"],"pinyin":["gai3 diao4"],"word":"改掉"},{"definition":["in addition\/moreover\/(used before a disyllabic verb to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["jia1 yi3"],"word":"加以"},{"definition":["to guide\/to lead (around)\/to conduct\/to boot\/introduction\/primer"],"pinyin":["yin3 dao3"],"word":"引导"},{"definition":["to control\/to supervise\/to inspect"],"pinyin":["jian1 du1"],"word":"监督"},{"definition":["to curb\/to put a stop to\/to stop\/to check\/to limit"],"pinyin":["zhi4 zhi3"],"word":"制止"}]}