{"definition":["to correct an error"],"pinyin":["jiu1 cuo4"],"traditional":["糾錯"],"rank":24997.0,"normalized_rank":0.3497404614329887,"fraction":0.0000014828407336635068,"cumulative_fraction":0.9842862923681686,"word":"纠错","characters":[{"definition":["old variant of 糾|纠[jiu1]","to gather together\/to investigate\/to entangle\/to correct"],"pinyin":["jiu1","jiu1"],"word":"纠"},{"definition":["mistake\/wrong\/bad\/interlocking\/complex\/to grind\/to polish\/to alternate\/to stagger\/to miss\/to let slip\/to evade\/to inlay with gold or silver","surname Cuo"],"pinyin":["cuo4","Cuo4"],"word":"错"}],"containing_words":[],"sentences":[{"english":"In teaching college English writing, its of great significance to encourage students to self-correct errors in writing.","chinese":"在大学英语写作教学中，倡导学生自我纠错非常重要。"},{"english":"Exchange your exercise books with your neighbor and correct each other's mistakes.","chinese":"把你的练习本和同桌交换，互相纠错。"},{"english":"In this paper, a digital signature scheme constructed with error-correcting codes is first presented.","chinese":"本文首次提出了一种基于纠错码的数字签名方案。"},{"english":"Finally, we use error correcting coding to improve secure algorithm.","chinese":"最后，利用纠错码理论进一步改进水印算法。"},{"english":"Teachers follow the principle of student priority in the course of error correction.","chinese":"在纠错中教师应尽量给予学生独立修正偏误的优先权。"},{"english":"A general method of automatic error detecting and correcting for spelling English words is summarized.","chinese":"概述了英文单词拼写自动侦错与纠错的一般方法。"},{"english":"It also synchronizes and establishes an agreement on procedures for error recovery and control of data integrity.","chinese":"它还对纠错和数据整合的过程进行同步并达成协议。"},{"english":"Error correcting code mainly includes block code and convolutional code.","chinese":"纠错码主要有分组码和卷积码两种。"},{"english":"An identification scheme based on a generator matrix of error-correcting codes over GF(q);","chinese":"该方案根据移动信道性能的变化自适应地选择纠错码。"},{"english":"Based oh the codes, a fast single byte-error correction scheme for main memory is proposed.","chinese":"基于最小方阵码，本文给出一种快速内存纠错方案。"},{"english":"Introduce the ECC(Error Correction Code) into the field of information hiding in binary images.","chinese":"将通信领域的纠错码技术引入到信息隐藏中。"},{"english":"To do that, switch over to the debug perspective and test your updated application from there.","chinese":"切换到纠错透视图并在此测试更新过的应用程序。"},{"english":"Once the necessary corrections are made, translated documents are finally delivered to the manufacturer.","chinese":"完成必要的纠错之后，翻译文档最后提交给制造商。"},{"english":"A digital signature Public-key cryptosystem based on error correcting codes is presented in this paper.","chinese":"本文提出了基于纠错码的一类公钥体制数字签名方案。"},{"english":"RS(Reed-Solomon)code is being used widely because of its powerful error correction capability.","chinese":"RS码由于具有优良的纠错能力而得到广泛应用。"},{"english":"At last, the relation between the capacity of subliminal channel and the parameters of the code used in the system is described.","chinese":"同时给出了容量与所采用纠错码请参数之间的关系。"}],"related":[{"definition":["to correct an error"],"pinyin":["gai3 cuo4"],"word":"改错"},{"definition":["error\/mistake\/CL:個|个[ge4]\/mistaken\/false\/wrong"],"pinyin":["cuo4 wu4"],"word":"错误"},{"definition":["to correct\/to make right"],"pinyin":["jiu1 zheng4"],"word":"纠正"},{"definition":["(abbr. for 嘗試錯誤|尝试错误) trial and error\/failure"],"pinyin":["shi4 cuo4"],"word":"试错"},{"definition":["to correct an error"],"pinyin":["jiu1 pian1"],"word":"纠偏"},{"definition":["to make a correction"],"pinyin":["ding4 zheng4"],"word":"订正"},{"definition":["to correct\/to amend\/to put right\/correction\/CL:個|个[ge4]"],"pinyin":["gai3 zheng4"],"word":"改正"},{"definition":["to revise\/to amend"],"pinyin":["xiu1 zheng4"],"word":"修正"},{"definition":["to think back over sth\/to review\/to revisit\/to rethink\/reflection\/reassessment"],"pinyin":["fan3 si1"],"word":"反思"},{"definition":["systematic"],"pinyin":["xi4 tong3 xing4"],"word":"系统性"},{"definition":["correct\/proper"],"pinyin":["zheng4 que4"],"word":"正确"},{"definition":["to screen\/to discriminate\/to reexamine a case\/screening (of applicants etc)"],"pinyin":["zhen1 bie2"],"word":"甄别"},{"definition":["to correct\/to make a correction"],"pinyin":["geng1 zheng4"],"word":"更正"},{"definition":["validity"],"pinyin":["you3 xiao4 xing4"],"word":"有效性"},{"definition":["(after completing a game of chess) to replay the game, analyzing the players' moves\/(stock market) to resume trading"],"pinyin":["fu4 pan2"],"word":"复盘"},{"definition":["iteration (math.)\/repeated substitution"],"pinyin":["die2 dai4"],"word":"迭代"}]}