{"definition":["Red Army (1928-1937), predecessor of the PLA\/(Soviet) Red Army (1917-1946)"],"pinyin":["Hong2 jun1"],"traditional":["紅軍"],"rank":3772.0,"normalized_rank":0.05277517384187036,"fraction":0.00003585779828473816,"cumulative_fraction":0.8227828891792719,"word":"红军","characters":[{"definition":["surname Hong","red\/popular\/revolutionary\/bonus"],"pinyin":["Hong2","hong2"],"word":"红"},{"definition":["(bound form) army\/military"],"pinyin":["jun1"],"word":"军"}],"containing_words":[],"sentences":[{"english":"5 the central army, save dared stand up for the reds.","chinese":"五战中央军，解救红军张敢为。"},{"english":"Lucas Levia would love to play at Wembley for Liverpool.","chinese":"卢卡斯表示，他愿意为红军在温布利球场比赛。"},{"english":"Our Red Army men fought a good battle.","chinese":"红军战士打了一场漂亮仗。"},{"english":"Snow fell all night on the mountain .","chinese":"这时红军来到大雪山。"},{"english":"The Red Army's glorious revolutionary traditions have carried over to the present day.","chinese":"红军的光荣革命传统一直发扬到今天。"},{"english":"Great all- China meetings of Party and Red Army delegates were called in May and June.","chinese":"党和红军的全国代表大会五月和六月间分别召开了。"},{"english":"It is inappropriate to advocate a \"contest of attrition \" for the Chinese Red Army today.","chinese":"“拚消耗”的主张，对于中国红军来说是不适时宜的。"},{"english":"Jamie Carragher has talked about a \"massive week\" approaching for the Reds.","chinese":"克拉格谈到过对红军来说“至关重要的一周。”"},{"english":"The Reds midfielder is undecided whether he will follow team-mate Jamie Carragher by taking his coaching badges.","chinese":"红军队长还未决定是否跟随队友卡拉格考取教练证书。"},{"english":"The Red Army men once wrote down their heroic feat here.","chinese":"中国工农红军也曾在这里的雪山草地里书写壮举。"},{"english":"After that the Red Army work-team went to talk to my father.","chinese":"之后，红军工作队就去找我父亲谈话。"},{"english":"Both he and Tord Grip gew up supporting the Reds.","chinese":"他和助手格里普从小都是红军的支持者。"},{"english":"The Red Army arrived in Haldensleben on June 1.","chinese":"红军在6月1日到达哈尔登斯莱。"},{"english":"Absolute equalitarianism became quite serious in the Red Army at one time.","chinese":"红军中的绝对平均主义，有一个时期发展得很厉害。"},{"english":"After a time the enemy was baying across all south Kiangsi, hunting for the elusive Reds.","chinese":"不久以后，敌人就在赣南到处追逐行踪不定的红军。"},{"english":"Because Du Gongjun's son longs for a mother, object Du Gongjun remarrying all the time.","chinese":"杜红军的儿子因为思念母亲，一直反对杜红军再婚。"}],"related":[{"definition":["He Long (1896-1969), important communist military leader, died from persecution during the Cultural Revolution"],"pinyin":["He4 Long2"],"word":"贺龙"},{"definition":["nationalist forces"],"pinyin":["guo2 min2 dang3 jun1 dui4"],"word":"国民党军队"},{"definition":["New Fourth army of Republic of China, set up in 1937 and controlled by the communists"],"pinyin":["Xin1 si4 jun1"],"word":"新四军"},{"definition":["communist attack against the Guomindang's encircle and annihilate campaign"],"pinyin":["fan3 wei2 jiao3"],"word":"反围剿"},{"definition":["Zhu De (1886-1976), communist leader and founder of the People's Liberation Army"],"pinyin":["Zhu1 De2"],"word":"朱德"},{"definition":["Eighth Route Army, the larger of the two major Chinese communist forces fighting the Japanese in the Second Sino-Japanese War (1937-1945)"],"pinyin":["Ba1 lu4 jun1"],"word":"八路军"},{"definition":["Peng Dehuai (1898-1974), top communist general, subsequently politician and politburo member, disgraced after attacking Mao's failed policies in 1959, and died after extensive persecution during the Cultural Revolution"],"pinyin":["Peng2 De2 huai2"],"word":"彭德怀"},{"definition":["Jinggangshan county level city in Ji'an 吉安, Jiangxi","Jinggang Mountains, in the Jiangxi-Hunan border region"],"pinyin":["Jing3 gang1 shan1","Jing3 gang1 Shan1"],"word":"井冈山"},{"definition":["to resist Japan (esp. during WW2)\/anti-Japanese (esp. wartime activities)"],"pinyin":["kang4 Ri4"],"word":"抗日"},{"definition":["Chen Yi (1901-1972), communist general and politician, Marshal of PLA from 1955, Mayor of Shanghai in 1950s, PRC foreign minister 1958-1972"],"pinyin":["Chen2 Yi4"],"word":"陈毅"},{"definition":["White Guard or White Movement, anti-communist troops fighting against the Bolsheviks during the Russian Civil War (1917-1922)"],"pinyin":["Bai2 jun1"],"word":"白军"},{"definition":["Nanchang Uprising, 1st August 1927, the beginning of military revolt by the Communists in the Chinese Civil War"],"pinyin":["Nan2 chang1 Qi3 yi4"],"word":"南昌起义"},{"definition":["Zunyi conference of January 1935 before the Long March"],"pinyin":["Zun1 yi4 hui4 yi4"],"word":"遵义会议"},{"definition":["Zhang Guotao (1897-1979), Chinese communist leader in the 1920s and 1930s, defected to Guomindang in 1938"],"pinyin":["Zhang1 Guo2 tao1"],"word":"张国焘"},{"definition":["guerrilla band"],"pinyin":["you2 ji1 dui4"],"word":"游击队"},{"definition":["Guomindang or Kuomintang (KMT)\/Nationalist Party"],"pinyin":["Guo2 min2 dang3"],"word":"国民党"}]}