{"definition":["to indulge\/to connive at"],"pinyin":["zong4 rong2"],"traditional":["縱容"],"rank":14607.0,"normalized_rank":0.20437088131182404,"fraction":0.000004343126354396206,"cumulative_fraction":0.9573658402805886,"word":"纵容","characters":[{"definition":["warp (the vertical threads in weaving)\/vertical\/longitudinal\/north-south (lines of longitude)\/lengthwise\/to release\/to indulge\/even if"],"pinyin":["zong4"],"word":"纵"},{"definition":["surname Rong","to hold\/to contain\/to allow\/to tolerate\/appearance\/look\/countenance"],"pinyin":["Rong2","rong2"],"word":"容"}],"containing_words":[],"sentences":[{"english":"These lunches, though, are where the pampering begins and ends.","chinese":"这些午餐，虽然，是纵容开始和结束的地方。"},{"english":"Let's not mollycoddle our students!","chinese":"我们不能纵容学生。"},{"english":"However, I found that it just connived PTB.","chinese":"但是，我发现这样恰恰纵容了PTB。"},{"english":"\"I decided it was better for me to break that promise than to endorse the lie, \" he says.","chinese":"“我认为宁肯我食言也不能纵容撒谎，”他说。"},{"english":"The Chinese government is deliberately or not condoned by the mob and prevent fragmentation mutilations?","chinese":"或者是中国政府故意不出来阻止而纵容暴徒虐杀不成？"},{"english":"\" The wise man, humoring him, said, \"Be a cutter.","chinese":"智者纵容着他说，“去做采石匠吧。”"},{"english":"He connived at letting the prisoner escape from prison.","chinese":"他纵容那个囚犯越狱。"},{"english":"The general is accused of conniving in a plot to topple the government.","chinese":"将军被指控纵容一个颠覆政府的阴谋。"},{"english":"Society as a whole also connives in the denial.","chinese":"社会上普遍存在纵容剥夺权利的现象。"},{"english":"He indulges his son with plenty of pocket money.","chinese":"他纵容他的儿子，给他许多零用钱。"},{"english":"The Asians’ parsimony made the Anglo-Saxons’ profligacy possible.","chinese":"亚洲人的节俭纵容了欧美人的挥霍。"},{"english":"And Parents should tolerant such wrong behaviors, but not indulge them.","chinese":"父母对孩子犯错应抱宽容的态度，但不能纵容。"},{"english":"Don't pamper damp scamp tramp s that camp under ramp lamps.","chinese":"不能纵容在斜坡灯下践踏潮湿露营地的流氓。"},{"english":"Too low a credit-loss cost may connive \"the spoilt children\".","chinese":"失信成本过低会纵容“坏孩子”。"},{"english":"Instead of badgering him about why he's so busy, try pampering him a bit.","chinese":"与其和他争吵为什么他怎么忙，不如多纵容他一下。"},{"english":"Nevertheless, forgiving need not equal to conniving the mistake either.","chinese":"然而，原谅也并不等于纵容一个错误。"}],"related":[{"definition":["see 恣意妄為|恣意妄为[zi4 yi4 wang4 wei2]"],"pinyin":["si4 yi4 wang4 wei2"],"word":"肆意妄为"},{"definition":["to shield (a miscreant) from punishment, criticism etc\/to take sb's side"],"pinyin":["tan3 hu4"],"word":"袒护"},{"definition":["excessively tolerant\/to overindulge (sb)\/overly conciliatory\/to seek appeasement at any price"],"pinyin":["gu1 xi1"],"word":"姑息"},{"definition":["to run amok (idiom); to commit outrages"],"pinyin":["hu2 zuo4 fei1 wei2"],"word":"胡作非为"},{"definition":["to ignore\/to let alone\/to indulge"],"pinyin":["fang4 ren4"],"word":"放任"},{"definition":["to put up with\/to tolerate"],"pinyin":["rong2 ren3"],"word":"容忍"},{"definition":["regardless of the law and of natural morality (idiom); maverick\/undisciplined and out of control"],"pinyin":["wu2 fa3 wu2 tian1"],"word":"无法无天"},{"definition":["to accept tacitly\/acquiescence"],"pinyin":["mo4 xu3"],"word":"默许"},{"definition":["to shield\/to harbor\/to cover up"],"pinyin":["bao1 bi4"],"word":"包庇"},{"definition":["to behave unscrupulously"],"pinyin":["zi4 yi4 wang4 wei2"],"word":"恣意妄为"},{"definition":["to turn a blind eye"],"pinyin":["zheng1 yi1 zhi1 yan3 bi4 yi1 zhi1 yan3"],"word":"睁一只眼闭一只眼"},{"definition":["lit. win an inch, want a foot (idiom); fig. not satisfied with small gains\/give him an inch, and he'll want a mile"],"pinyin":["de2 cun4 jin4 chi3"],"word":"得寸进尺"},{"definition":["to indulge\/to pamper\/to connive at\/permissive\/indulgent\/self-indulgent\/unrestrained\/undisciplined\/uncultured\/boorish"],"pinyin":["fang4 zong4"],"word":"放纵"},{"definition":["to tolerate is to nurture an evildoer (idiom); spare the rod and spoil the child"],"pinyin":["gu1 xi1 yang3 jian1"],"word":"姑息养奸"},{"definition":["unprincipled"],"pinyin":["wu2 yuan2 ze2"],"word":"无原则"},{"definition":["with no regard for law or discipline (idiom); flouting the law and disregarding all rules\/in complete disorder"],"pinyin":["mu4 wu2 fa3 ji4"],"word":"目无法纪"}]}