{"definition":["lit. warp string in weaving\/fig. vertical or north-south lines\/to pass through\/to cross lengthwise\/to pierce (esp. north-south or top-to-bottom)"],"pinyin":["zong4 guan4"],"traditional":["縱貫"],"rank":32956.0,"normalized_rank":0.4610971975431282,"fraction":7.25070872623217e-7,"cumulative_fraction":0.9926922535816024,"word":"纵贯","characters":[{"definition":["warp (the vertical threads in weaving)\/vertical\/longitudinal\/north-south (lines of longitude)\/lengthwise\/to release\/to indulge\/even if"],"pinyin":["zong4"],"word":"纵"},{"definition":["to pierce through\/to pass through\/to be stringed together\/string of 1000 cash"],"pinyin":["guan4"],"word":"贯"}],"containing_words":[],"sentences":[{"english":"Longitudinalcheng he solid throughout, folding fighting snake river, tortuous.","chinese":"固城河纵贯全境，河道斗折蛇行，迂回曲折。"},{"english":"The new main north-south road in Belize was cut through the forest only four or five miles away.","chinese":"一条纵贯伯利兹南北的路就在四五英里外横穿森林。"},{"english":"The meandering River Yi, such as the inlaid jade belt, that runs its length throughout, with Aura.","chinese":"蜿蜒的沂河，如镶嵌的玉带，纵贯全境，充满灵气。"},{"english":"A colorful history of coins and currency from their very beginnings.","chinese":"一部图文并茂的钱币史，纵贯古今，精彩纷呈。"},{"english":"Dnieper north-south central part of the shipping lines and major industrial and agricultural water.","chinese":"第聂伯河纵贯中部，是航运干线和工农业主要水源。"},{"english":"Since ancient times, there are floods, droughts and the pier, Beijing-Hangzhou Grand Canal longitudinal throughout.","chinese":"自古有水旱码头之称，京杭大运河纵贯全境。"},{"english":"The city is cut by the Beijing-Hangzhou Grand Canal from north to south.","chinese":"京杭大运河纵贯苏州南北，交通十分方便。"},{"english":"Kindly make the shipment by cross fast freight , and charge the cost to our account .","chinese":"恳请采用纵贯铁路快车货运，费由敝公司负担。"}],"related":[{"definition":["horizontal traverse\/to cut across\/to cross transversally"],"pinyin":["heng2 guan4"],"word":"横贯"},{"definition":["to span\/to stretch across\/to travel across"],"pinyin":["heng2 kua4"],"word":"横跨"},{"definition":["to cross\/to traverse"],"pinyin":["heng2 chuan1"],"word":"横穿"},{"definition":["to run through\/a connecting thread from beginning to end\/to link"],"pinyin":["guan4 chuan1"],"word":"贯穿"},{"definition":["overall length\/span"],"pinyin":["quan2 chang2"],"word":"全长"},{"definition":["southern end or extremity"],"pinyin":["nan2 duan1"],"word":"南端"},{"definition":["continuous (esp. of mountain ranges)\/to stretch long and unbroken\/a continuous link\/sostenuto (sustained, in music)"],"pinyin":["mian2 yan2"],"word":"绵延"},{"definition":["to link up\/to thread together"],"pinyin":["guan4 tong1"],"word":"贯通"},{"definition":["trunk line (of road, network etc)\/backbone (cable)"],"pinyin":["zhu3 gan4 xian4"],"word":"主干线"},{"definition":["northern extremity"],"pinyin":["bei3 duan1"],"word":"北端"},{"definition":["to stretch in an unbroken chain (esp. of mountains)"],"pinyin":["mian2 gen4"],"word":"绵亘"},{"definition":["to connect\/to communicate\/to relate\/(math.) connected"],"pinyin":["lian2 tong1"],"word":"连通"},{"definition":["variant of 交匯|交汇\/to flow together\/confluence (of rivers, airflow, roads)\/(international) cooperation","to flow together\/confluence (of rivers, airflow, roads)\/(international) cooperation"],"pinyin":["jiao1 hui4","jiao1 hui4"],"word":"交汇"},{"definition":["to extend continuously"],"pinyin":["yan2 mian2"],"word":"延绵"},{"definition":["to wriggle\/snaking\/winding\/to zigzag\/to meander"],"pinyin":["wan1 yan2"],"word":"蜿蜒"},{"definition":["to merge with\/interlinking\/to join with\/to interlock"],"pinyin":["xiang1 jie1"],"word":"相接"}]}