{"definition":["detailed rules and regulations\/bylaws"],"pinyin":["xi4 ze2"],"traditional":["細則"],"rank":5389.0,"normalized_rank":0.07539910175870608,"fraction":0.000021579288668491987,"cumulative_fraction":0.867798098729085,"word":"细则","characters":[{"definition":["thin or slender\/finely particulate\/thin and soft\/fine\/delicate\/trifling\/(of a sound) quiet\/frugal"],"pinyin":["xi4"],"word":"细"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"则"}],"containing_words":[],"sentences":[{"english":"All above offers are bound by relevant terms and conditions.","chinese":"以上所有优惠须受有关条款及细则约束。"},{"english":"Environmental protection departments under the State Council shall be held responsible for the interpretation of This Bylaw .","chinese":"本细则由国务院环境保护部门负责解释。"},{"english":"Article 32. Environmental protection departments under the State Council shall be held responsible for the interpretation of This Bylaw .","chinese":"第三十二条本细则由国务院环境保护部门负责解释。"},{"english":"Other Royal Supermarket terms and conditions apply (Available in Traditional Chinese only ).","chinese":"须受其他来来超级市场条款及细则约束。"},{"english":"Could we discuss the terms and conditions of the new job?","chinese":"我们能不能谈一下新工作的条款和细则？"},{"english":"The explanation rights of the above details belongs to our company and the cruise company.","chinese":"以上细则的解释权归属我公司及游船公司。"},{"english":"Article 50 These rules shall come into effect from the day they are promulgated.","chinese":"第五十条本实施细则自发布之日起施行。"},{"english":"This company reserves the right to interpret the Scoring Rules.","chinese":"积分细则解释权归本公司所有。"},{"english":"Article 58 The detailed rules shall come into effect from the date of promulgation.","chinese":"第五十八条本实施细则自发布之日起施行。"},{"english":"Please retain the Terms and Conditions for future reference.","chinese":"申请人须保留此条款及细则以作日后参考之用。"},{"english":"Article 57 The present Rules shall be implemented from the date of their promulgation.","chinese":"第五十七条本实施细则自发布之日起施行。"},{"english":"This Code of Practice and its revisions will be implemented after being passed at the Academic Affairs Meeting.","chinese":"本细则经教务会议通过后实施，修正时亦同。"},{"english":"C12.07 Duties of congregation committees shall be specified in the bylaws.","chinese":"各委员会的职责在细则及延伸议案中阐明。"},{"english":"The enquiry is clearly stated with all relevant details at this stage.","chinese":"有关询价项目和细则，均清楚列明。"},{"english":"Pine Valley pay system developed implementation details.","chinese":"制定华彬庄园薪酬体系实施细则。"},{"english":"Article 114 These Implementation Rules shall go into effect as of the date of promulgation.","chinese":"第一百一十四条本细则自发布之日起施行。"}],"related":[{"definition":["regulations\/rules\/code of conduct\/ordinances\/statutes"],"pinyin":["tiao2 li4"],"word":"条例"},{"definition":["to officially launch (a policy, program etc)\/to appear on stage\/to appear publicly\/(of a bar girl) to leave with a client"],"pinyin":["chu1 tai2"],"word":"出台"},{"definition":["legislation\/statute"],"pinyin":["fa3 gui1"],"word":"法规"},{"definition":["to revise"],"pinyin":["xiu1 ding4"],"word":"修订"},{"definition":["provision\/to fix\/to set\/to formulate\/to stipulate\/to provide\/regulation\/rule\/CL:個|个[ge4]"],"pinyin":["gui1 ding4"],"word":"规定"},{"definition":["penal provision\/penalty"],"pinyin":["fa2 ze2"],"word":"罚则"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"规范"},{"definition":["rule\/regulation"],"pinyin":["gui1 zhang1"],"word":"规章"},{"definition":["policy\/CL:個|个[ge4]"],"pinyin":["zheng4 ce4"],"word":"政策"},{"definition":["new policy\/New Deal (Roosevelt's 1933 policy to deal with the Great Depression)"],"pinyin":["xin1 zheng4"],"word":"新政"},{"definition":["to issue\/to proclaim\/to enact (laws, decrees etc)"],"pinyin":["ban1 bu4"],"word":"颁布"},{"definition":["to try out\/to test"],"pinyin":["shi4 xing2"],"word":"试行"},{"definition":["to give a more granular level of detail\/to elaborate\/to refine\/to become more differentiated"],"pinyin":["xi4 hua4"],"word":"细化"},{"definition":["to put in place\/to put into practice\/to take effect"],"pinyin":["shi1 xing2"],"word":"施行"},{"definition":["access\/admittance"],"pinyin":["zhun3 ru4"],"word":"准入"},{"definition":["system (e.g. political, adminstrative etc)\/institution\/CL:個|个[ge4]"],"pinyin":["zhi4 du4"],"word":"制度"}]}