{"definition":["to give a more granular level of detail\/to elaborate\/to refine\/to become more differentiated"],"pinyin":["xi4 hua4"],"traditional":["細化"],"rank":8595.0,"normalized_rank":0.12025520126481327,"fraction":0.000010629506877578453,"cumulative_fraction":0.916503668085006,"word":"细化","characters":[{"definition":["thin or slender\/finely particulate\/thin and soft\/fine\/delicate\/trifling\/(of a sound) quiet\/frugal"],"pinyin":["xi4"],"word":"细"},{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua4","hua1"],"word":"化"}],"containing_words":[{"definition":["micromanagement"],"pinyin":["xi4 hua4 guan3 li3"],"word":"细化管理"}],"sentences":[{"english":"This paper tries to explore the application of fine powder technology to Chinese medicinal herbs and insoluble medicines.","chinese":"本文就难溶药物与中草药微细化技术作出探索性研究。"},{"english":"Studying primarily conditions for super-fine comminution of rice bran.","chinese":"初步考察了影响米糠超微细化工艺的因素。"},{"english":"Starting from the map, the business processes of interest are then further detailed.","chinese":"从此图开始，将对所关心的业务流程进一步细化。"},{"english":"SAFC is considered a top 10 fine chemical company.","chinese":"SAFC被认为是前10个精细化工公司。"},{"english":"Fingerprint identification procedures, including binarization, thinning, such as extraction of feature points.","chinese":"指纹识别的程序，包括二值化，细化，提取特征点等。"},{"english":"Pose to pose involves defining the extremes and then filling in the spaces inbetween.","chinese":"姿势对应法是指先做出关键帧然后逐渐细化的方式。"},{"english":"The magnetic properties and the domain refining effect of laser grooving are investigated.","chinese":"研究取向硅钢板磁性及激光刻痕细化磁畴的效果。"},{"english":"Drawing the spot arranges the thin turning the diagram, and personnel's line enters the circuit diagram.","chinese":"绘制现场布置细化图，及人员行进线路图。"},{"english":"Develop the dynamic model while refining the static model.","chinese":"在细化静态模型时开发动态模型。"},{"english":"The size reduction process of fly ash with grinding aids has been studied.","chinese":"研究了助磨剂作用下粉煤灰的微细化过程。"},{"english":"Experiments show that adding the RE element refines the grain of aluminum alloy.","chinese":"实验表明，加入稀土细化了铝合金晶粒组织。"},{"english":"The mechanism of laser hardening is martensitic hardening and grain refining.","chinese":"激光相变硬化机理主要是马氏体强化和晶粒细化。"},{"english":"The Industrial Revolution was characterized by specialization of individuals in their work tasks.","chinese":"工业革命的特点是个体劳动者劳动内容的细化。"},{"english":"A new method for fining grain size has been developed in this peper.","chinese":"本文提出一种细化柘榴石磁光膜晶粒的有效方法。"},{"english":"Way. In this step , I went over every single highlight and defined it further.","chinese":"在这一步，我将每一条高光都单独处理并细化。"},{"english":"Methylphenidate extended-release tablets exert different effects on different detailed function.","chinese":"其对各种细化功能改善的效果有所不同。"}],"related":[{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落实"},{"definition":["subdivision\/segmentation"],"pinyin":["xi4 fen1"],"word":"细分"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"规范"},{"definition":["micromanagement"],"pinyin":["xi4 hua4 guan3 li3"],"word":"细化管理"},{"definition":["to concretize"],"pinyin":["ju4 ti3 hua4"],"word":"具体化"},{"definition":["to draw up\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制定"},{"definition":["(of systems, facilities etc) comprehensive\/well-developed\/excellent\/to refine\/to improve"],"pinyin":["wan2 shan4"],"word":"完善"},{"definition":["clear\/well-defined\/limpid"],"pinyin":["ming2 xi1"],"word":"明晰"},{"definition":["clear-cut\/definite\/explicit\/to clarify\/to specify\/to make definite"],"pinyin":["ming2 que4"],"word":"明确"},{"definition":["to correspond\/answering (one another)\/to agree (among the part)\/corresponding\/relevant\/appropriate\/(modify) accordingly"],"pinyin":["xiang1 ying4"],"word":"相应"},{"definition":["detailed rules and regulations\/bylaws"],"pinyin":["xi4 ze2"],"word":"细则"},{"definition":["optimization\/to optimize\/to make superior"],"pinyin":["you1 hua4"],"word":"优化"},{"definition":["to deepen\/to intensify"],"pinyin":["shen1 hua4"],"word":"深化"},{"definition":["definition\/to delimit"],"pinyin":["jie4 ding4"],"word":"界定"},{"definition":["to strengthen\/to intensify"],"pinyin":["qiang2 hua4"],"word":"强化"},{"definition":["step by step\/one step at a time"],"pinyin":["fen1 bu4 zhou4"],"word":"分步骤"}]}