{"definition":["to be able to withstand\/to be able to endure"],"pinyin":["jing1 de5 qi3"],"traditional":["經得起"],"rank":18152.0,"normalized_rank":0.2539700306409413,"fraction":0.000002894736340672115,"cumulative_fraction":0.9699654761000118,"word":"经得起","characters":[{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["jing1","Jing1"],"word":"经"},{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"Accepted and run, let love stand the fleeting time.","chinese":"接纳与磨合，让爱经得起流年。"},{"english":"Haba toys are a great choice that will stand the test of time.","chinese":"哈巴玩具是一个不错的选择，经得起时间的考验。"},{"english":"A name is like a boat which stands the strong wind and striking wave in the sea.","chinese":"名字的含义是像小船一样在大海里经得起风吹浪打。"},{"english":"Will your tax statement stand up to detailed examination?","chinese":"你的有关税收的报告经得起详细审查吗？"},{"english":"I believe it will stand the test of time.","chinese":"我相信这份报告会经得起时间考验。"},{"english":"But would such a sleight of hand really stand up to legal scrutiny in the aftermath of Armageddon?","chinese":"但这种戏法真的经得起末日审判的法律审查吗？"},{"english":"Practice has proven that the bilateral relations have withstood the tests of time.","chinese":"实践证明中塞黑关系是经得起时间考验的。"},{"english":"A accumulated backbone of a archful of animal hair is able of acknowledging a counterbalancet agnate to that of 99 humans.","chinese":"满头头发合在一起的力气可经得起99个人的分量。"},{"english":"Turth is the daughter of time.","chinese":"真理经得起时间的考验。"},{"english":"Her claim can bear close examination.","chinese":"她的要求经得起仔细检查。"},{"english":"The packing must be able to withstand rough handling.","chinese":"包装必须经得起野蛮搬运。"},{"english":"Its four-dimensional beauty can stand up0 time.","chinese":"建筑的美是四维的，他能经得起时间的磨移。"},{"english":"Children’s furniture must withstand kicks and blows.","chinese":"孩子用的家具必须经得起拳打脚踢。"},{"english":"Metal can bear beating with a hammer, which a stone can't.","chinese":"金属能经得起锤子的敲打，但石头却不行。"},{"english":"Cars and girls go perfectly well together, it is tested by time.","chinese":"香车美女的绝配，是经得起时间的考验的。"},{"english":"WHO can withstand this scrutiny.","chinese":"世卫组织经得起这一审查。"}],"related":[{"definition":["can't stand it\/to be unable to bear\/to be unable to resist"],"pinyin":["jing1 bu5 qi3"],"word":"经不起"},{"definition":["to undergo (hardship)\/to endure\/to withstand"],"pinyin":["jing1 shou4"],"word":"经受"},{"definition":["after hard work and numerous revisions (idiom)\/the vicissitudes of life"],"pinyin":["qian1 chui2 bai3 lian4"],"word":"千锤百炼"},{"definition":["to test\/to put to the test\/trial\/ordeal"],"pinyin":["kao3 yan4"],"word":"考验"},{"definition":["to become more resolute with the passing of time (idiom)"],"pinyin":["li4 jiu3 mi2 jian1"],"word":"历久弥坚"},{"definition":["to experience\/to go through"],"pinyin":["li4 jing1"],"word":"历经"},{"definition":["to go through thick and thin (idiom)"],"pinyin":["jing1 li4 feng1 yu3"],"word":"经历风雨"},{"definition":["to inspect\/to examine\/to test"],"pinyin":["jian3 yan4"],"word":"检验"},{"definition":["baptism (lit. or fig.)"],"pinyin":["xi3 li3"],"word":"洗礼"},{"definition":["to sharpen on grindstone\/to improve oneself by practice"],"pinyin":["mo2 li4"],"word":"磨砺"},{"definition":["True gold fears no fire. (idiom)"],"pinyin":["zhen1 jin1 bu4 pa4 huo3 lian4"],"word":"真金不怕火炼"},{"definition":["unswerving from start to finish (idiom)"],"pinyin":["shi3 zhong1 ru2 yi1"],"word":"始终如一"},{"definition":["capable of enduring\/able to tolerate\/patient\/durable\/hardy\/resistant"],"pinyin":["nai4"],"word":"耐"},{"definition":["not to let sb down\/to treat sb fairly\/be worthy of"],"pinyin":["dui4 de5 qi3"],"word":"对得起"},{"definition":["to ravage\/to ruin"],"pinyin":["cui1 can2"],"word":"摧残"},{"definition":["touchstone\/fig. test that sth is genuine"],"pinyin":["shi4 jin1 shi2"],"word":"试金石"}]}