{"definition":["energy channels\/meridian (TCM)\/(dialect) trick\/tactic"],"pinyin":["jing1 luo4"],"traditional":["經絡"],"rank":31393.0,"normalized_rank":0.43922879968659495,"fraction":8.329483388741848e-7,"cumulative_fraction":0.9914766429951348,"word":"经络","characters":[{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["jing1","Jing1"],"word":"经"},{"definition":["small net","net-like object\/to hold sth in place with a net\/to wind\/to twist\/(TCM) channels in the human body"],"pinyin":["lao4","luo4"],"word":"络"}],"containing_words":[],"sentences":[{"english":"The magnetic line can be extended to the channels and collaterals acupoints of people's vola.","chinese":"更将磁力线延伸到人们足底的经络穴位。"},{"english":"The light will move through the meridians and cells allowing for the act of regeneration.","chinese":"光将会通过经络和细胞运作，从而允许再生行为发生。"},{"english":"Qi and blood in the body are the material basis for the physiological activities of the zang-fu and meridians.","chinese":"人体气血是脏腑经络生理活动的物质基础。"},{"english":"How did people discover the invisible “jingluo” in human body?","chinese":"人们是怎么发现人体中那无形的“经络”的呢？"},{"english":"The basis of acupuncture is the theory of meridians and acupoints.","chinese":"针灸的理论基础就是经络腧穴理论。"},{"english":"There was meridian theoretical basis kidney protecting foetus.","chinese":"肾固胞胎也有其经络理论基础。"},{"english":"Be familiar with physiological functions and pathological changes of meridians and collaterals.","chinese":"熟悉经络的生理功能，病理变化。"},{"english":"The large intestine has close relationship with the brain through body fluid and meridians and collaterals in TCM.","chinese":"在生理上中医认为大肠与脑通过津液和经络密切相联。"},{"english":"Clinical general the stroke divides into the internal organs and the channels and collaterals, but dialectical treats.","chinese":"临床上将中风分为中脏腑和中经络而辨证施治。"},{"english":"ObjectiveTo investigate the structure of micro vessel in Houhai point and its relationship with meridians and collaterals.","chinese":"目的探索穴区内微血管构筑及与经络腧穴的关系。"},{"english":"Our specialist offers traditional Chinese massage to relax your channels and collaterals.","chinese":"专家门诊，传统手法推拿，按摩，舒展经络。"},{"english":"Results This theory is used for meridian diagnosis and acupoint selection with the best therapeutic effects.","chinese":"结果该理论运用于经络诊断和取穴治疗效果甚佳。"},{"english":"The New York stock exchange is the world biggest stock market.","chinese":"对于交易所证券市场的经络，那她更是“渊源有自”。"},{"english":"This study provided a data to clarify the essence of meridian and the mechanism of referred pain.","chinese":"为阐明经络生理实质及牵涉痛机理提供了可靠的证据。"},{"english":"Asking about locality of the pain helps understand pathological changes of internal organs and meridians;","chinese":"问疼痛的部位可以帮助了解脏腑经络的病理改变。"},{"english":"Western medicine thinks all-diseases can be refll cted in the abnormality of bioelectricity ofaody.","chinese":"所有疾病都是人体经络不通。"}],"related":[{"definition":["inner organs"],"pinyin":["zang4 fu3"],"word":"脏腑"},{"definition":["twelve channels of TCM"],"pinyin":["shi2 er4 jing1 mai4"],"word":"十二经脉"},{"definition":["channel of TCM"],"pinyin":["jing1 mai4"],"word":"经脉"},{"definition":["acupuncture point"],"pinyin":["xue2 wei4"],"word":"穴位"},{"definition":["veins"],"pinyin":["jin1 mai4"],"word":"筋脉"},{"definition":["qi and blood (two basic bodily fluids of Chinese medicine)"],"pinyin":["qi4 xue4"],"word":"气血"},{"definition":["tendons and muscles"],"pinyin":["jin1 luo4"],"word":"筋络"},{"definition":["acupuncture point (any point on any meridian)\/category of 12 specific acupuncture points near the wrist or ankle, each lying on a different meridian (one of five categories collectively termed 五輸穴|五输穴)"],"pinyin":["jing1 xue2"],"word":"经穴"},{"definition":["acupuncture point"],"pinyin":["shu4 xue2"],"word":"腧穴"},{"definition":["(TCM) the three truncal cavities (thoracic, abdominal and pelvic), known as the \"triple heater\" or \"San Jiao\""],"pinyin":["san1 jiao1"],"word":"三焦"},{"definition":["(TCM) six bowels (hollow organs), namely: gall bladder 膽|胆[dan3], stomach 胃[wei4], large intestine 大腸|大肠[da4 chang2], small intestine 小腸|小肠[xiao3 chang2], triple heater 三焦[san1 jiao1], bladder 膀胱[pang2 guang1]"],"pinyin":["liu4 fu3"],"word":"六腑"},{"definition":["acupuncture point"],"pinyin":["shu4 xue2"],"word":"俞穴"},{"definition":["twelve channels of TCM"],"pinyin":["shi2 er4 jing1"],"word":"十二经"},{"definition":["(in Chinese medicine) stasis (of blood or other fluids)"],"pinyin":["yu1 zhi4"],"word":"瘀滞"},{"definition":["node (center of energy)\/acupuncture point\/Chakra"],"pinyin":["xue2 mai4"],"word":"穴脉"},{"definition":["silted up\/obstructed by silt\/variant of 瘀滯|瘀滞[yu1 zhi4]"],"pinyin":["yu1 zhi4"],"word":"淤滞"}]}