{"definition":["Operations Administration and Maintenance\/OAM"],"pinyin":["jing1 ying2 guan3 li3 he2 wei2 hu4"],"traditional":["經營管理和維護"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"经营管理和维护","characters":[{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["jing1","Jing1"],"word":"经"},{"definition":["camp\/barracks\/battalion\/to build\/to operate\/to manage\/to strive for"],"pinyin":["ying2"],"word":"营"},{"definition":["variant of 管[guan3]","surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["guan3","Guan3","guan3"],"word":"管"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["abbr. for Uighur 維吾爾|维吾尔[Wei2 wu2 er3]\/surname Wei","to preserve\/to maintain\/to hold together\/dimension\/vitamin (abbr. for 維生素|维生素[wei2 sheng1 su4])"],"pinyin":["Wei2","wei2"],"word":"维"},{"definition":["to protect"],"pinyin":["hu4"],"word":"护"}],"containing_words":[],"sentences":[],"related":[]}