{"definition":["structural\/structured"],"pinyin":["jie2 gou4 xing4"],"traditional":["結構性"],"rank":7763.0,"normalized_rank":0.10861444181718972,"fraction":0.000012564148366379641,"cumulative_fraction":0.9068927516300228,"word":"结构性","characters":[{"definition":["knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)","(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]"],"pinyin":["jie2","jie1"],"word":"结"},{"definition":["to construct\/to form\/to make up\/to compose\/literary composition\/paper mulberry (Broussonetia papyrifera)","variant of 構|构[gou4]\/(Tw) (coll.) variant of 夠|够[gou4]\/to reach by stretching"],"pinyin":["gou4","gou4"],"word":"构"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"The structure variance of soil nutrient is bigger than the random variance.","chinese":"毛竹林土壤养分的结构性变异大于随机变异。"},{"english":"The aggregate quantity contradiction and the structural contradiction interlaces each other in the employment in China at present.","chinese":"当前我国就业中总量性矛盾与结构性矛盾相互交织。"},{"english":"Collagen (type IV in basement membrane and types V and VI as fine fibrils ) comprises the structural component of ECM that provides shape and stability.","chinese":"胶原是细胞外基质的结构性成份，维持形状和稳定性。"},{"english":"But might the problem be structural rather than cyclical?","chinese":"但有没有可能这是结构性问题而非周期性问题？"},{"english":"To be sure, the administration inherited this structural mess from the other guys.","chinese":"当然，新政府是从其他人那里继承了这种结构性混乱。"},{"english":"Structured bag with double short handles and a spring-action etched logo lock.","chinese":"双短手柄和弹簧行动蚀刻标识锁的结构性袋。"},{"english":"Programmers with a shred of architectural sensibility shun these quagmires.","chinese":"拥有结构性嗅觉的程序员避开了这片沼泽。"},{"english":"\"But there is something more structural going on, \" he added.","chinese":"“但是会有一些更加结构性的变动，”他补充道。"},{"english":"It perceives tectonic shifts in the distribution of global power as ultimately favourable to its prospects.","chinese":"它认为全球实力分布的结构性转变最终将有利于自己。"},{"english":"The transaction match risk also in reliefs in the partial constitutive product.","chinese":"交易对手风险也在部分结构性产品中凸现。"},{"english":"Marine soft soil is a kind of structured soil with strength of structural connection.","chinese":"海积软土是一种结构性土，具有结构连结强度。"},{"english":"The structural properties of this soft clay are evaluated by the sensitivity test.","chinese":"文中通过灵敏度试验，评价闽南地区软粘土的结构性。"},{"english":"There are certain structural conditions that increase the probability of performative ties occurring.","chinese":"有一些结构性条件可以增加主动性联系的可能性。"},{"english":"First, public speaking is more highly structured than conversation.","chinese":"首先，公开演讲比扳谈要有更高的组织结构性。"},{"english":"Powerful structural factors will continue to reinforce the relative strength of the emerging world.","chinese":"强大的结构性因素会继续加强新兴国家的相对实力。"},{"english":"Fiscal policy strategies need to be complemented by growth-enhancing structural reforms.","chinese":"财政政策战略需要辅以促进增长的结构性改革措施。"}],"related":[{"definition":["local"],"pinyin":["ju2 bu4 xing4"],"word":"局部性"},{"definition":["short term\/short-term"],"pinyin":["duan3 qi1"],"word":"短期"},{"definition":["systematic"],"pinyin":["xi4 tong3 xing4"],"word":"系统性"},{"definition":["to re-evaluate"],"pinyin":["chong2 gu1"],"word":"重估"},{"definition":["turning point\/breaking point\/inflexion point (math., a point of a curve at which the curvature changes sign)"],"pinyin":["guai3 dian3"],"word":"拐点"},{"definition":["to split apart\/differentiation"],"pinyin":["fen1 hua4"],"word":"分化"},{"definition":["determinacy"],"pinyin":["que4 ding4 xing4"],"word":"确定性"},{"definition":["completely\/totally\/total\/entire\/overall\/population (statistics)"],"pinyin":["zong3 ti3"],"word":"总体"},{"definition":["global"],"pinyin":["quan2 ju2 xing4"],"word":"全局性"},{"definition":["directionality (molecular biology)"],"pinyin":["fang1 xiang4 xing4"],"word":"方向性"},{"definition":["whole entity\/entire body\/synthesis\/as a whole (situation, construction, team etc)\/global\/macrocosm\/integral\/holistic\/whole"],"pinyin":["zheng3 ti3"],"word":"整体"},{"definition":["periodic\/periodicity (math)\/cyclicity"],"pinyin":["zhou1 qi1 xing4"],"word":"周期性"},{"definition":["trend\/tendency"],"pinyin":["qu1 shi4"],"word":"趋势"},{"definition":["specific to a particular stage (of a project etc)\/interim (policy etc)\/occurring in stages\/phased"],"pinyin":["jie1 duan4 xing4"],"word":"阶段性"},{"definition":["macroeconomic"],"pinyin":["hong2 guan1 jing1 ji4"],"word":"宏观经济"},{"definition":["to shake up\/to jolt\/to vibrate\/to oscillate\/to fluctuate","to vibrate\/to shake\/to shudder"],"pinyin":["zhen4 dang4","zhen4 dang4"],"word":"震荡"}]}