{"definition":["concluding remarks"],"pinyin":["jie2 yu3"],"traditional":["結語"],"rank":33117.0,"normalized_rank":0.4633497964266226,"fraction":7.151443939966056e-7,"cumulative_fraction":0.9928081874071032,"word":"结语","characters":[{"definition":["knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)","(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]"],"pinyin":["jie2","jie1"],"word":"结"},{"definition":["to tell to","dialect\/language\/speech"],"pinyin":["yu4","yu3"],"word":"语"}],"containing_words":[],"sentences":[{"english":"The conclusion part explained the status and the trend of the Mulao Minority's Yifan festival.","chinese":"结语部分说明依饭节在仫佬族文化中的地位及走向。"},{"english":"Besides the preface and conclusion, the paper has six chapters.","chinese":"除了序言和结语外，论文共有六章。"},{"english":"Besides the introduction and peroration, this article contains 5 chapters.","chinese":"本文除了引言和结语外，在结构上分为五章。"},{"english":"At the conclusion, the inflexion of the narrative perspective was supplemented.","chinese":"结语，补叙了严格的叙事角度分类之外的变音。"},{"english":"Besides preface and final words, the thesis consists of 3 chapters, about 50,000 Chinese characters.","chinese":"除序言和结语外，全文共三章，计5万余字。"},{"english":"It is composed of two parts with five chapters apart from the preface and the conclusion.","chinese":"除前言和结语外，分上下两篇共五章。"},{"english":"The conclusion sums up the whole thesis and makes an overall statement about the characteristics of the vocabulary of Baoying dialect.","chinese":"结语部分对正文进行概述，总述宝应方言词汇的特点。"},{"english":"The sixth chapter is a conclusion, the summary of the entire study.","chinese":"第六章结语，是对整项研究的一个总结。"},{"english":"In the closing statement, the author re-state his opinions on hedge fund.","chinese":"在结语部分，笔者重申了对对冲基金看法。"},{"english":"This thesis consists of five chapters of the introduction and main text plus the conclusion totaling about fifty thousand words.","chinese":"本论文分为绪论及正文共五章和结语，全文约5万字。"},{"english":"The concluding part chiefly discusses the promotion of sexual harmony by sexual rights.","chinese":"结语主要讲以性权利促进性和谐。"},{"english":"And the conclusion part summarizes Liansky's character.","chinese":"结语部分对歌剧中连斯基这个人物进行总结。"},{"english":"This paper has about 35,000 words, it consists of four chapters except for the introduction and conclusion.","chinese":"全文三万五千余字，除前言和结语外，分为四章。"},{"english":"The last part outline the value and position of Wu' literature creation.","chinese":"结语部分简述了吴兆骞文学创作的价值与地位。"},{"english":"In the conclusion, the author restates her views in the previous part of the paper.","chinese":"在结语部分，对全文进行了概括，重申了本文的观点。"},{"english":"The conclusion is to summarize the academic point of view of the thesis.","chinese":"结语部分是对本文学术观点的归纳。"}],"related":[{"definition":["summary\/short\/brief\/wrap-up"],"pinyin":["xiao3 jie2"],"word":"小结"},{"definition":["concluding remarks"],"pinyin":["jie2 shu4 yu3"],"word":"结束语"},{"definition":["like that\/in that way\/or so\/so\/so very much\/about\/in that case"],"pinyin":["na4 me5"],"word":"那么"},{"definition":["we\/us\/ourselves\/our"],"pinyin":["wo3 men5"],"word":"我们"},{"definition":["to sum up\/to conclude\/summary\/résumé\/CL:個|个[ge4]"],"pinyin":["zong3 jie2"],"word":"总结"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["to comment\/a point by point commentary"],"pinyin":["dian3 ping2"],"word":"点评"},{"definition":["ought to\/should\/must"],"pinyin":["ying1 gai1"],"word":"应该"},{"definition":["indeed\/true! (I agree with you)"],"pinyin":["cheng2 ran2"],"word":"诚然"},{"definition":["to summarize\/a round-up\/in summary ..."],"pinyin":["zong1 shang4 suo3 shu4"],"word":"综上所述"},{"definition":["to be capable of\/to be able to\/can"],"pinyin":["neng2 gou4"],"word":"能够"},{"definition":["now\/at present\/at the moment\/modern\/current\/nowadays"],"pinyin":["xian4 zai4"],"word":"现在"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或许"},{"definition":["actually\/in fact\/really"],"pinyin":["qi2 shi2"],"word":"其实"},{"definition":["woolen material","particle indicating that a previously asked question is to be applied to the preceding word (\"What about ...?\", \"And ...?\")\/particle for inquiring about location (\"Where is ...?\")\/particle signaling a pause, to emphasize the preceding words and allow the listener time to take them on board (\"ok?\", \"are you with me?\")\/(at the end of a declarative sentence) particle indicating continuation of a state or action\/particle indicating strong affirmation"],"pinyin":["ni2","ne5"],"word":"呢"},{"definition":["(question particle for \"yes-no\" questions)","see 嗎啡|吗啡, morphine"],"pinyin":["ma5","ma3"],"word":"吗"}]}