{"definition":["to break off relations\/to break with sb"],"pinyin":["jue2 jiao1"],"traditional":["絕交"],"rank":45872.0,"normalized_rank":0.6418087949295538,"fraction":2.191124179197602e-7,"cumulative_fraction":0.9982191060892064,"word":"绝交","characters":[{"definition":["to cut short\/extinct\/to disappear\/to vanish\/absolutely\/by no means","variant of 絕|绝[jue2]"],"pinyin":["jue2","jue2"],"word":"绝"},{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"}],"containing_words":[],"sentences":[{"english":"Beck went plain crazy with anger on the day when he received his Dear John from his exgirlfriend.","chinese":"贝克收到他女朋友的绝交信的那天简直都气疯了。"},{"english":"Inom gonna make him a suggestion he cannot refuse.","chinese":"我预备向他提出一个他不可能绝交的条件。"},{"english":"I have heard from my girlfriend , which makes me sad to death.","chinese":"我收到女友来的绝交信，令我伤心欲绝。"},{"english":"Since I found he cheated me , I finished with him.","chinese":"自从我发现他欺骗我，我就和他绝交了。"},{"english":"One hates to break with an old friend.","chinese":"人都不喜欢跟老朋友绝交。"},{"english":"I received a dear John letter from my girl friend which broke my heart.","chinese":"我收到了女友写来的令我心碎的绝交信。"},{"english":"It was a “Dear John” letter.","chinese":"这是一封绝交信。"},{"english":"I received a dear John Letter from my boy friend which broke my heart.","chinese":"我收到男友的绝交信，令我伤心愈绝。"},{"english":"Beck went plain crazy with anger on the day when he received his Dear John from his girlfriend.","chinese":"贝克收到他女朋友的绝交信的那天简直都气疯了。"},{"english":"I received a dear john letter from my girl friend which broke my heart.","chinese":"我收到女友寄来的绝交信，今我伤心欲绝。"},{"english":"Jane gave Tom a Dear John letter.","chinese":"简给汤姆写了一封绝交信。"},{"english":"I received a dear John letter from my girl friend which broke m heart .","chinese":"我受到女友来的绝交信，令我伤心欲绝。"},{"english":"He just got a Dear John letter from his girlfriend, so he went to drown his sorrows in drink.","chinese":"他刚刚收到他女朋友的一封绝交信，因此他借酒消愁。"},{"english":"In this episode, we’ll focus on the negotiation phase.","chinese":"在这节课中，我们将要绝交协商阶段。"},{"english":"Poor Tim received a Dear John letter while in Sweden.","chinese":"可怜的蒂姆在瑞典时收到了一封绝交信。"},{"english":"Henceforth the Queen of Scots and the Countess of Shrewsbury were no longer friends.","chinese":"于是苏格兰女王和什鲁斯伯里伯爵夫人就此绝交。"}],"related":[{"definition":["(Internet slang) end of friendship\/friendship over!"],"pinyin":["you3 jin4"],"word":"友尽"},{"definition":["to rip one's robe as a sign of repudiating a sworn brotherhood (idiom)\/to break all friendly ties"],"pinyin":["ge1 pao2 duan4 yi4"],"word":"割袍断义"},{"definition":["to be estranged"],"pinyin":["xing2 tong2 mo4 lu4"],"word":"形同陌路"},{"definition":["to rupture\/to burst open\/to break\/to break off relations with\/a rupture"],"pinyin":["jue2 lie4"],"word":"决裂"},{"definition":["to add sb to one's blacklist (on a cellphone, or in instant messaging software etc)\/abbr. for 拉到黑名單|拉到黑名单"],"pinyin":["la1 hei1"],"word":"拉黑"},{"definition":["to fall out with sb\/to become hostile"],"pinyin":["fan1 lian3"],"word":"翻脸"},{"definition":["to have an acrimonious falling-out\/to shed all pretense of cordiality\/to tear into each other"],"pinyin":["si1 po4 lian3"],"word":"撕破脸"},{"definition":["to part company\/to split up\/to break up"],"pinyin":["fen1 shou3"],"word":"分手"},{"definition":["to be difficult with sb\/to provoke disagreement\/at loggerheads\/to fall out with"],"pinyin":["nao4 bie4 niu5"],"word":"闹别扭"},{"definition":["to split up\/to break all ties"],"pinyin":["en1 duan4 yi4 jue2"],"word":"恩断义绝"},{"definition":["lit. two segments with a single cut (idiom)\/fig. to make a clean break (idiom)"],"pinyin":["yi1 dao1 liang3 duan4"],"word":"一刀两断"},{"definition":["unable to get along together\/incompatible"],"pinyin":["he2 bu4 lai2"],"word":"合不来"},{"definition":["to be at loggerheads\/to have a falling out"],"pinyin":["nao4 mao2 dun4"],"word":"闹矛盾"},{"definition":["to part without hard feelings (idiom)\/to cut the knot as smoothly as you tied it"],"pinyin":["hao3 ju4 hao3 san4"],"word":"好聚好散"},{"definition":["to quarrel\/to have a row\/quarrel\/CL:頓|顿[dun4]"],"pinyin":["chao3 jia4"],"word":"吵架"},{"definition":["to drift apart\/to become estranged\/to alienate\/estrangement"],"pinyin":["shu1 yuan3"],"word":"疏远"}]}