{"definition":["to come back from death's door (idiom); unexpected rescue from danger\/fig. to recover from a seemingly impossible situation\/to find a way out of a predicament"],"pinyin":["jue2 chu3 feng2 sheng1"],"traditional":["絕處逢生"],"rank":40467.0,"normalized_rank":0.5661858324122396,"fraction":3.683015525726549e-7,"cumulative_fraction":0.9966646177845484,"word":"绝处逢生","characters":[{"definition":["to cut short\/extinct\/to disappear\/to vanish\/absolutely\/by no means","variant of 絕|绝[jue2]"],"pinyin":["jue2","jue2"],"word":"绝"},{"definition":["to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish","place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point"],"pinyin":["chu3","chu4"],"word":"处"},{"definition":["to meet by chance\/to come across\/(of a calendar event) to come along\/(of an event) to fall on (a particular day)\/to fawn upon"],"pinyin":["feng2"],"word":"逢"},{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"}],"containing_words":[],"sentences":[{"english":"He was unexpectedly rescued from the desert.","chinese":"他绝处逢生，从沙漠被救了回来。"},{"english":"Xiaoping always has luck and ability to be unexpected rescued from a desperate situation.","chinese":"小萍从来有绝处逢生的本领和运气。"},{"english":"Desperate villagers who tried to force their way into the towns were greeted with machine-gun fire .","chinese":"以为逃到城镇可以绝处逢生的农民被机枪扫射。"},{"english":"Ah, don't you understand the reason of be unexpected rescued from a desperate situation?","chinese":"呵呵，难道你不明白绝处逢生的道理吗？"}],"related":[{"definition":["lit. the willow trees make the shade, the flowers give the light (idiom); at one's darkest hour, a glimmer of hope\/light at the end of the tunnel"],"pinyin":["liu3 an4 hua1 ming2"],"word":"柳暗花明"},{"definition":["desperate straits"],"pinyin":["jue2 jing4"],"word":"绝境"},{"definition":["to turn peril into safety (idiom); to avert disaster"],"pinyin":["hua4 xian3 wei2 yi2"],"word":"化险为夷"},{"definition":["place sb on a field of death and he will fight to live (idiom based on Sunzi's \"The Art of War\" 孫子兵法|孙子兵法[Sun1 zi3 Bing1 fa3]); to fight desperately when confronting mortal danger\/fig. to find a way out of an impasse"],"pinyin":["zhi4 zhi1 si3 di4 er2 hou4 sheng1"],"word":"置之死地而后生"},{"definition":["to turn defeat into victory (idiom); to turn the tide"],"pinyin":["fan3 bai4 wei2 sheng4"],"word":"反败为胜"},{"definition":["the mountain road twists around each new peak (idiom)\/(of a mountain road) twisting and turning\/fig. an opportunity has come unexpectedly\/things have taken a new turn"],"pinyin":["feng1 hui2 lu4 zhuan3"],"word":"峰回路转"},{"definition":["lit. to upend heaven and earth (idiom)\/fig. to change the course of events\/to turn things around"],"pinyin":["niu3 zhuan3 qian2 kun1"],"word":"扭转乾坤"},{"definition":["to turn defeat into victory (idiom); snatching victory from the jaws of defeat"],"pinyin":["zhuan4 bai4 wei2 sheng4"],"word":"转败为胜"},{"definition":["mortal danger, escape alive (idiom); a narrow escape\/to survive by the skin of one's teeth"],"pinyin":["si3 li3 tao2 sheng1"],"word":"死里逃生"},{"definition":["Heaven never bars one's way (idiom); don't despair and you will find a way through.\/Never give up hope.\/Never say die."],"pinyin":["tian1 wu2 jue2 ren2 zhi1 lu4"],"word":"天无绝人之路"},{"definition":["to rise from the dead (idiom); fig. an unexpected recovery"],"pinyin":["qi3 si3 hui2 sheng1"],"word":"起死回生"},{"definition":["adversity\/predicament"],"pinyin":["ni4 jing4"],"word":"逆境"},{"definition":["lit. to dispel the clouds and see the sun (idiom); fig. to restore justice"],"pinyin":["bo1 yun2 jian4 ri4"],"word":"拨云见日"},{"definition":["perilous situation"],"pinyin":["wei1 ju2"],"word":"危局"},{"definition":["to just escape from calamity"],"pinyin":["da4 nan4 bu4 si3"],"word":"大难不死"},{"definition":["nine deaths and still alive (idiom); a narrow escape\/new lease of life"],"pinyin":["jiu3 si3 yi1 sheng1"],"word":"九死一生"}]}