{"definition":["to establish (a unit or department)\/staffing structure (excluding temporary and casual staff)","to weave\/to plait\/to compile\/to put together (a lesson plan, budget etc)"],"pinyin":["bian1 zhi4","bian1 zhi4"],"traditional":["編制","編製"],"rank":2026.0,"normalized_rank":0.02834636855875645,"fraction":0.00007532708305804051,"cumulative_fraction":0.7324473606359919,"word":"编制","characters":[{"definition":["to weave\/to plait\/to organize\/to group\/to arrange\/to edit\/to compile\/to write\/to compose\/to fabricate"],"pinyin":["bian1"],"word":"编"},{"definition":["to manufacture\/to make","system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4","zhi4"],"word":"制"}],"containing_words":[{"definition":["having a permanent post\/part of the official staff"],"pinyin":["you3 bian1 zhi4"],"word":"有编制"}],"sentences":[{"english":"Both sets of columns may be indexed, but by different indexes.","chinese":"这两组列都可以编制索引，但是使用不同的索引。"},{"english":"Now the workout method of pretender is a norm and practical method.","chinese":"目前，标底编制主要采用定额法和实物量法。"},{"english":"Budgeting is something that people either love or hate to do.","chinese":"编制预算对很多人来说是又爱又恨的事情。"},{"english":"A new table of axial capacity parameter of driven pile has been compiled.","chinese":"在此基础上编制了新的打入桩竖向承载力参数表。"},{"english":"Listing species is the beginning of that essential process, \" Attenborough said in a statement accompanying the report.","chinese":"编制物种名录是保护物种这一重要进程的开始。"},{"english":"Commercial documents of company is inculcated.","chinese":"公司商业文件的编制。"},{"english":"The computer programs are compiled for statistic program of meteorologic data and the infiltration dynamic energy consumption.","chinese":"编制了气象数据统计程序和渗风动态能耗计算程序。"},{"english":"A shortcut route has been provided for working out the post-process program of parallel-link machine tools.","chinese":"为编制虚拟轴机床数控后处理程序提供一条捷径。"},{"english":"Objective To develop a self-rating scale of quality of life for convalescent cancer patients.","chinese":"目的编制康复期癌症患者生存质量自评量表。"},{"english":"The paper also expresses its view on a couple of issues concerning the quotation of price preparation for track - laying …","chinese":"笔者就编制铺轨架梁报价的几个具体问题提出了看法。"},{"english":"The system hardware circuity and software programming concept are presented in detail.","chinese":"较详细地叙述了系统硬件电路构成和软件编制思路。"},{"english":"Information is captured in text and produced in document form.","chinese":"以文字形式获取信息并编制成文档形式。"},{"english":"Manageability is the ability to manipulate the communication system.","chinese":"处置性是操息通讯编制的本领。"},{"english":"And \"change\" refers to unleashing staff potential through deepening reform.","chinese":"改，就是通过深化改革推动机构编制释放潜力。"},{"english":"Single form site index table was constructed after derived curve was expanded by differential method.","chinese":"用差分法展开导向曲线，编制了单形立地指数表。"},{"english":"She began working when she was 4, collecting grasses that her father wove into mats.","chinese":"当她只有四岁时，便为编制草席的父亲搜集青草。"}],"related":[{"definition":["organizational structure"],"pinyin":["jian4 zhi4"],"word":"建制"},{"definition":["fixed allocation"],"pinyin":["ding4 bian1"],"word":"定编"},{"definition":["to be on the regular payroll\/to be on the permanent staff"],"pinyin":["zai4 bian1"],"word":"在编"},{"definition":["to organize\/to put together\/to edit"],"pinyin":["bian1 cheng2"],"word":"编成"},{"definition":["to expand (esp. by new recruitment)\/to increase the army\/to augment"],"pinyin":["kuo4 bian1"],"word":"扩编"},{"definition":["to organize\/to set up\/to establish"],"pinyin":["zu3 jian4"],"word":"组建"},{"definition":["directly subordinate"],"pinyin":["zhi2 shu3"],"word":"直属"},{"definition":["to include (in a list etc)\/to assign (to a class, a work unit etc)"],"pinyin":["bian1 ru4"],"word":"编入"},{"definition":["to draw up (a plan)"],"pinyin":["ni3 ding4"],"word":"拟订"},{"definition":["function\/role"],"pinyin":["zhi2 neng2"],"word":"职能"},{"definition":["to report for criticism\/to submit for approval to higher authority"],"pinyin":["bao4 pi1"],"word":"报批"},{"definition":["to organize into groups\/marshalling"],"pinyin":["bian1 zu3"],"word":"编组"},{"definition":["to transfer (personnel or material)"],"pinyin":["chou1 diao4"],"word":"抽调"},{"definition":["to simplify\/to reduce"],"pinyin":["jing1 jian3"],"word":"精简"},{"definition":["to work out\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制订"},{"definition":["diaphysis (long segment of a bone)\/fig. backbone"],"pinyin":["gu3 gan4"],"word":"骨干"}]}