{"definition":["origin"],"pinyin":["yuan2 qi3"],"traditional":["緣起"],"rank":25357.0,"normalized_rank":0.3547773285016721,"fraction":0.0000014340842062916216,"cumulative_fraction":0.9848106536383802,"word":"缘起","characters":[{"definition":["cause\/reason\/karma\/fate\/predestined affinity\/margin\/hem\/edge\/along"],"pinyin":["yuan2"],"word":"缘"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"Its origin in the tax system in the financial management system implementation.","chinese":"其缘起于分税制财政管理体制改革的实施。"},{"english":"The origin of the cabinet system of Ming Dynasty could be traced back to the conflicting process between the premier power and the monarchic power.","chinese":"明代内阁制的缘起可追溯至相权与君权的斗争过程。"},{"english":"Please tell us about your film, and how the initial idea come about.","chinese":"请谈下你们的这部电影，以及缘起吧。"},{"english":"Part one is about the origin and significance of the personal property register.","chinese":"第一部分为动产物权登记制度的缘起与意义。"},{"english":"In introduction, the author puts forward the reason of the topic and the topical contents.","chinese":"引言部分，提出论文选题的缘起与论题大旨。"},{"english":"The first chapter in the main body elaborates the origin of the United States' Yugoslavian policy.","chinese":"正文的第一章，论述美国的南斯拉夫政策的缘起。"},{"english":"Originated, some waiting to no end.","chinese":"缘起缘灭，有些等待注定没有结局。"},{"english":"Chapter 1 provides the origin and motive of the study.","chinese":"第一章说明本论文的缘起以及研究动机和目的。"},{"english":"The females procreation adoration is the origin and return of ancient goddess.","chinese":"女性生殖崇拜是上古女神的缘起和皈依。"},{"english":"This essay discusses the evolution background of the researches on political development.","chinese":"本文意在讨论政治发展研究缘起的学科沿革背景。"},{"english":"Chapter 1 concerns the origin and planning for the practice of civil right thoughts in Guangxi.","chinese":"第一部分为民权主义在广西实践的缘起与筹划。"},{"english":"The second part of the system of free proof for the origin and evolution.","chinese":"第二章为自由心证制度的缘起与沿革。"},{"english":"The case originated in complaint launched by Irish Music Rights Organization (IMRO).","chinese":"本案例缘起于“爱尔兰音乐权利组织”的一起上诉。"},{"english":"Empires have been created on the basis of a good idea.","chinese":"伟大的帝国的创建常常缘起于一个想法。"},{"english":"The five geographical and Xinyuan, a Tantric On the Origin of the six.","chinese":"这五缘和心缘，构成密宗的六大缘起论。"},{"english":"I like that touch of Youlan horizon, like looking at the sky to see the origins edge off.","chinese":"我喜欢天边那一抹幽蓝，喜欢仰望天空看缘起缘落。"}],"related":[{"definition":["chance\/opportunity\/predestined relationship\/(Buddhist) principal and secondary causes\/chain of cause and effect"],"pinyin":["yin1 yuan2"],"word":"因缘"},{"definition":["to originate"],"pinyin":["yuan2 qi3"],"word":"源起"},{"definition":["(Buddhism) predestined relationship"],"pinyin":["su4 yuan2"],"word":"宿缘"},{"definition":["to originate from\/to come from the fact that\/owing to\/because of"],"pinyin":["yuan2 yu2"],"word":"缘于"},{"definition":["to form ties\/to become attached (to sb, sth)"],"pinyin":["jie2 yuan2"],"word":"结缘"},{"definition":["cause\/reason\/karma\/fate\/predestined affinity\/margin\/hem\/edge\/along"],"pinyin":["yuan2"],"word":"缘"},{"definition":["karma\/cause and effect"],"pinyin":["yin1 guo3"],"word":"因果"},{"definition":["opportunity\/chance"],"pinyin":["ji4 hui4"],"word":"际会"},{"definition":["beginning\/origin\/to originate\/to initiate"],"pinyin":["fa1 duan1"],"word":"发端"},{"definition":["to initiate\/to start\/the start"],"pinyin":["zhao4 shi3"],"word":"肇始"},{"definition":["related\/brought together by fate"],"pinyin":["you3 yuan2"],"word":"有缘"},{"definition":["so I have heard (idiom)\/the beginning clause of Buddha's quotations as recorded by his disciple, Ananda (Buddhism)"],"pinyin":["ru2 shi4 wo3 wen2"],"word":"如是我闻"},{"definition":["previous life"],"pinyin":["su4 shi4"],"word":"宿世"},{"definition":["all living things"],"pinyin":["zhong4 sheng1"],"word":"众生"},{"definition":["fate or chance that brings people together\/predestined affinity or relationship\/(Budd.) destiny"],"pinyin":["yuan2 fen4"],"word":"缘分"},{"definition":["the ways of the world"],"pinyin":["shi4 xiang4"],"word":"世相"}]}