{"definition":["defective\/defect"],"pinyin":["que1 sun3"],"traditional":["缺損"],"rank":24393.0,"normalized_rank":0.3412897177955312,"fraction":0.0000015698433992732183,"cumulative_fraction":0.983366123127132,"word":"缺损","characters":[{"definition":["deficiency\/lack\/scarce\/vacant post\/to run short of"],"pinyin":["que1"],"word":"缺"},{"definition":["to decrease\/to lose\/to damage\/to harm\/(coll.) to speak sarcastically\/to deride\/caustic\/mean\/one of the 64 hexagrams of the Book of Changes (䷨)"],"pinyin":["sun3"],"word":"损"}],"containing_words":[],"sentences":[{"english":"HIV stands for human immunodeficiency virus.","chinese":"艾滋病病毒是指人体免疫缺损病毒。"},{"english":"PHB is one of the ideal scaffold material in bone tissue engineering.","chinese":"PHB可以作为组织工程材料中的一种来修复骨缺损。"},{"english":"Objective To investigate the method for the treatment of soft tissue defect on the heel.","chinese":"目的探讨足跟部软组织缺损的治疗方法。"},{"english":"Tissue engineered bone had good ability to repair large segment tibia defect of Caprine.","chinese":"组织工程骨具有良好的修复山羊大段骨缺损的能力。"},{"english":"Objective To investigate the relationship between tooth occlusive contact in the laterotrusion and wedge-shaped defects.","chinese":"目的研究牙颈部楔状缺损与牙齿咬合接触的关系。"},{"english":"Conclusion The gingival recession and the wedge shaped defect are common dental diseases in the elderly.","chinese":"结论牙龈退缩与楔状缺损是中老年人常见的牙病。"},{"english":"Objective To probe the enlargement of using range of vascularized fibular transferring.","chinese":"目的探索扩大吻合血管腓骨移植修复骨缺损的范围。"},{"english":"The results of removal alone were dependent on the size of the defect in the capitellum .","chinese":"而骨片切除的效果取决于肱骨小头缺损的大小。"},{"english":"Objective To evaluate clinical effect of composite inlays in the defective molars.","chinese":"目的观察复合树脂嵌体修复磨牙缺损的临床疗效。"},{"english":"To evaluate the effectiveness of self-etching bond system in repair of sphenoid defects.","chinese":"目的评价自酸蚀粘接修复楔状缺损的效果。"},{"english":"Barium radiography showed there were filling defect, niche, bridging fold, etc.","chinese":"钡剂造影表现是充盈缺损，龛影和桥形皱襞等。"},{"english":"AIDS is an acronym for\"Acquired Immune Deficiency Syndrome.\"","chinese":"艾滋病的全称是“获得性免疫缺损综合征”。"},{"english":"In case of big defect, anterior rectus sheath flap was placed in addition.","chinese":"腹直肌前鞘翻转成形可补充修补巨大缺损。"},{"english":"To reconstruct the osseous defect, we prefer the fibula as the emphasis is on compression strength.","chinese":"为重建骨性缺损，我们更喜欢用腓骨作为抗压的重点。"},{"english":"At 2 weeks after fresh autogenous bone grafted, there was some new callus in bone defection.","chinese":"新鲜骨块植入后第2周，骨缺损处可见新生骨。"},{"english":"The flap is suitable to repair tissue defect of sole of the foot.","chinese":"手术操作简便，是修复足跟部皮肤缺损的理想皮瓣。"}],"related":[{"definition":["to become damaged"],"pinyin":["po4 sun3"],"word":"破损"},{"definition":["to mend"],"pinyin":["xiu1 bu3"],"word":"修补"},{"definition":["pathological changes\/lesion\/diseased (kidney, cornea etc)"],"pinyin":["bing4 bian4"],"word":"病变"},{"definition":["scar"],"pinyin":["ban1 hen2"],"word":"瘢痕"},{"definition":["to shift\/shift\/translocation\/displacement\/(medicine) dislocation"],"pinyin":["yi2 wei4"],"word":"移位"},{"definition":["soft tissue"],"pinyin":["ruan3 zu3 zhi1"],"word":"软组织"},{"definition":["to punch or bore a hole\/to perforate\/perforation"],"pinyin":["chuan1 kong3"],"word":"穿孔"},{"definition":["to fill (gap, hole, area, blank)\/to pad out\/to complement\/(dental) filling\/filled"],"pinyin":["chong1 tian2"],"word":"充填"},{"definition":["wear and tear\/wearing out by friction"],"pinyin":["mo2 hao4"],"word":"磨耗"},{"definition":["base of the skull"],"pinyin":["lu2 di3"],"word":"颅底"},{"definition":["filling material\/stuffing\/lining\/filling"],"pinyin":["chong1 tian2 wu4"],"word":"充填物"},{"definition":["hematoma\/swelling of soft tissue due to internal hemorrhage"],"pinyin":["xue4 zhong3"],"word":"血肿"},{"definition":["to excise\/to cut out (a tumor)"],"pinyin":["qie1 chu2"],"word":"切除"},{"definition":["mastoid antrum (bones at the back of tympanic chamber)"],"pinyin":["ru3 tu1 dou4"],"word":"乳突窦"},{"definition":["to harm\/to damage\/to injure\/impairment\/loss\/disability"],"pinyin":["sun3 shang1"],"word":"损伤"},{"definition":["necrosis"],"pinyin":["huai4 si3"],"word":"坏死"}]}