{"definition":["to leave the net open on three sides (idiom); let the caged bird fly\/to give one's opponent a way out\/lenient treatment"],"pinyin":["wang3 kai1 san1 mian4"],"traditional":["網開三面"],"rank":68785.0,"normalized_rank":0.9623913925538315,"fraction":5.255194567029558e-9,"cumulative_fraction":0.9999915438080204,"word":"网开三面","characters":[{"definition":["net\/network"],"pinyin":["wang3"],"word":"网"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"开"},{"definition":["surname San","three\/3"],"pinyin":["San1","san1"],"word":"三"},{"definition":["flour\/noodles\/(of food) soft (not crunchy)\/(slang) (of a person) ineffectual\/spineless","variant of 麵|面[mian4]","face\/side\/surface\/aspect\/top\/classifier for flat surfaces such as drums, mirrors, flags etc"],"pinyin":["mian4","mian4","mian4"],"word":"面"}],"containing_words":[],"sentences":[{"english":"The king was very lenient towards his error, and decided to give him the lightest punishment.","chinese":"国王对他的错误网开三面，决定从宽发落。"}],"related":[{"definition":["Mr Zhu Yun breaks the railing (idiom); to challenge and admonish boldly"],"pinyin":["Zhu1 Yun2 zhe1 kan3"],"word":"朱云折槛"},{"definition":["to call sth a cow or a horse (idiom); it doesn't matter what you call it\/Insult me if you want, I don't care what you call me."],"pinyin":["hu1 niu2 hu1 ma3"],"word":"呼牛呼马"},{"definition":["Men of Zheng fighting over their respective ages (idiom)\/a futile quarrel"],"pinyin":["Zheng4 ren2 zheng1 nian2"],"word":"郑人争年"},{"definition":["Jiang Ziya is fishing, if you want take the hook (idiom, refers to early sage 姜子牙 fishing with no bait and the hook above the water); to put one's head in the noose"],"pinyin":["tai4 gong1 diao4 yu2 , yuan4 zhe3 shang4 gou1"],"word":"太公钓鱼，愿者上钩"},{"definition":["to kill a pig as a lesson to the children (idiom); parents must teach by example"],"pinyin":["sha1 zhi4 jiao4 zi3"],"word":"杀彘教子"},{"definition":["if it's plowing, ask the laborer (idiom); when managing a matter, consult the appropriate specialist"],"pinyin":["geng1 dang1 wen4 nu2"],"word":"耕当问奴"},{"definition":["respect for the wise"],"pinyin":["li3 xian2 xia4 shi4"],"word":"礼贤下士"},{"definition":["crowing like a cock and stealing like a dog (idiom)\/bag of tricks\/useful talents"],"pinyin":["ji1 ming2 gou3 dao4"],"word":"鸡鸣狗盗"},{"definition":["lit. to let the tiger return to the mountain; fig. to store up future calamities"],"pinyin":["zong4 hu3 gui1 shan1"],"word":"纵虎归山"},{"definition":["to tell fox ghost stories around a bonfire and incite rebellion\/an uprising is afoot (idiom)"],"pinyin":["gou1 huo3 hu2 ming2"],"word":"篝火狐鸣"},{"definition":["ravenous wolves hold the road (idiom); wicked people in power\/a vicious tyranny rules the land"],"pinyin":["chai2 lang2 dang1 lu4"],"word":"豺狼当路"},{"definition":["a true gentleman will sacrifice his life for a friend who understands him, as a woman makes herself beautiful for her sweetheart"],"pinyin":["shi4 wei4 zhi1 ji3 zhe3 si3 , nu:3 wei4 yue4 ji3 zhe3 rong2"],"word":"士为知己者死，女为悦己者容"},{"definition":["lit. the birds are over, the bow is put away (idiom); fig. to get rid of sb once he has served his purpose"],"pinyin":["niao3 jin4 gong1 cang2"],"word":"鸟尽弓藏"},{"definition":["lit. Ying writes a letter and Yan reads it\/fig. to misinterpret the original meaning\/to pile up errors\/refers to the letter from capital 郢[Ying3] of 楚[Chu3] in which the inadvertent words \"hold up the candle\" are mistaken by the minister of 燕[Yan1] as \"promote the wise\""],"pinyin":["Ying3 shu1 Yan1 shuo1"],"word":"郢书燕说"},{"definition":["to console the people by punishing the tyrants (idiom)"],"pinyin":["diao4 min2 fa2 zui4"],"word":"吊民伐罪"},{"definition":["tyrannical government is fiercer than a tiger (idiom)"],"pinyin":["ke1 zheng4 meng3 yu2 hu3"],"word":"苛政猛于虎"}]}