{"definition":["to place\/to put (at or in a position)\/to be located"],"pinyin":["zhi4 yu2"],"traditional":["置于"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"置于","characters":[{"definition":["to install\/to place\/to put\/to buy"],"pinyin":["zhi4"],"word":"置"},{"definition":["surname Yu","to go\/to take\/sentence-final interrogative particle\/variant of 於|于[yu2]","in\/at\/to\/from\/by\/than\/out of"],"pinyin":["Yu2","yu2","yu2"],"word":"于"}],"containing_words":[],"sentences":[{"english":"The inclusion of any link to other websites does not imply endorsement by the Nestlé Group.","chinese":"将其他网站置于连结内不代表雀巢集团对其认可。"},{"english":"Turn the dc meters switch to TR1.","chinese":"将直流表开关置于TR1位。"},{"english":"Typically, intracardiac catheters are positioned in the right atrium and in the coronary sinus.","chinese":"通常上是把心脏内导管置于右心房和冠状静脉窦内。"},{"english":"The lug boss is completely arranged in an annular groove at the right end of the piston head.","chinese":"所述凸台全部置于所述活塞头右端的环状槽内。"},{"english":"Clears the Clipboard and then places nonpersistent data on it.","chinese":"清除剪贴簿，然后将非永续性资料置于其中。"},{"english":"It represents the Dharmakaya of Buddha, so one can put it on altar and worship.","chinese":"此代表法身佛，故可置于佛堂上供奉。"},{"english":"The upper section of a classical building, resting on the columns and constituting the architrave, frieze, and cornice.","chinese":"柱顶盘，上横梁一座古典的建筑的上部，置于。"},{"english":"I myself urge you to put friendship before all human affairs.","chinese":"我自己奉劝你们将友谊置于人类事务之首。"},{"english":"Please Keep out of the reach of children.","chinese":"请将本品置于少儿不宜接触的地方。"},{"english":"At brush to bite to match, brush the hair to move after placing in bit to match come forward.","chinese":"在刷咬合面时，刷毛置于咬合面上前后移动。"},{"english":"I establish my lucidity in the midst of what negates it.","chinese":"我将我的清醒置于了对它的否定之中。"},{"english":"We must put the arguments of the past behind us.","chinese":"我们必须把过去的争论置于脑后。"},{"english":"The animal imaged deity of the nether world buried in the tomb was surposed to have the fu…","chinese":"土伯后土神兽形象置于墓中有辟邪镇墓作用。"},{"english":"Modals go in front of the subject in questions.","chinese":"情态动词置于主语之前构成疑问句。"},{"english":"This type of storage box above in the collector.","chinese":"此种型式的储存箱置于收集器上方。"},{"english":"This week we put these issues under the spotlight in a series of articles.","chinese":"本周，我们把这些问题置于一系列文章的聚光灯下。"}],"related":[{"definition":["to put"],"pinyin":["fang4 zhi4"],"word":"放置"},{"definition":["to invert"],"pinyin":["dao4 zhi4"],"word":"倒置"},{"definition":["to insert\/to implant\/to embed\/to introduce (a new element) into"],"pinyin":["zhi4 ru4"],"word":"置入"},{"definition":["to load"],"pinyin":["zhuang1 ru4"],"word":"装入"},{"definition":["to lay\/to place\/to put in a certain place"],"pinyin":["an1 fang4"],"word":"安放"},{"definition":["to insert\/to stick\/to thrust"],"pinyin":["cha1 ru4"],"word":"插入"},{"definition":["to insert\/to embed"],"pinyin":["qian4 ru4"],"word":"嵌入"},{"definition":["to lead to\/to draw to\/to steer towards"],"pinyin":["yin3 xiang4"],"word":"引向"},{"definition":["to stick close to\/to press up against"],"pinyin":["jin3 tie1"],"word":"紧贴"},{"definition":["to soak\/to dip"],"pinyin":["jin4 ru4"],"word":"浸入"},{"definition":["to immerse\/to swamp"],"pinyin":["jin4 mo4"],"word":"浸没"},{"definition":["to roll\/to turn over\/to invert\/to flip"],"pinyin":["fan1 zhuan3"],"word":"翻转"},{"definition":["to set up\/to arrange\/to lay out"],"pinyin":["bai3 fang4"],"word":"摆放"},{"definition":["to take out\/to extract\/to draw out"],"pinyin":["qu3 chu1"],"word":"取出"},{"definition":["yawing (of a boat)"],"pinyin":["ping2 bai3"],"word":"平摆"},{"definition":["handle","to hold\/to contain\/to grasp\/to take hold of\/handle\/particle marking the following noun as a direct object\/classifier for objects with handle\/classifier for small objects: handful"],"pinyin":["ba4","ba3"],"word":"把"}]}