{"definition":["to permute\/permutation (math.)\/to displace\/displacement\/to replace\/replacement"],"pinyin":["zhi4 huan4"],"traditional":["置換"],"rank":6797.0,"normalized_rank":0.09509884851622293,"fraction":0.000015374509638725558,"cumulative_fraction":0.8934591494237561,"word":"置换","characters":[{"definition":["to install\/to place\/to put\/to buy"],"pinyin":["zhi4"],"word":"置"},{"definition":["to exchange\/to change (clothes etc)\/to substitute\/to switch\/to convert (currency)"],"pinyin":["huan4"],"word":"换"}],"containing_words":[{"definition":["missense mutation"],"pinyin":["zhi4 huan4 tu1 bian4"],"word":"置换突变"},{"definition":["permutation group (math.)"],"pinyin":["zhi4 huan4 qun2"],"word":"置换群"}],"sentences":[{"english":"The Rapid Displacement Heating (RDH) cooking process has been developed by Beloit Corporation as an energy efficient pulping system.","chinese":"阐述了快速置换加热间歇蒸煮化学和技术的原理。"},{"english":"A substitution matrix lets you assign match scores individually to each pair of symbols.","chinese":"使用置换矩阵能够根据每对符号单独分配匹配得分。"},{"english":"Objective To investigate the application of continuous suture in aortic valve replacement.","chinese":"目的探讨主动脉瓣置换中连续缝合方法的应用。"},{"english":"Conclusion Sufentanil can safe for heart valve replacement surgery.","chinese":"结论舒芬太尼可安全的用于心脏瓣膜置换手术。"},{"english":"In this paper, we have studied the permutation formed by multiple-valued logical function group.","chinese":"研究了由多值逻辑函数组构成的置换。"},{"english":"The second-stage arthroplasty was technically challenging.","chinese":"第二阶段的关节置换术极具技术挑战性。"},{"english":"How many money does the special material that makes art of complete coxa displacement need?","chinese":"做全髋置换术的特殊材料需要多少钱？"},{"english":"An ant colony optimization based algorithm for permutation flow shop scheduling was proposed.","chinese":"提出了一种求解置换流水车间调度的蚁群优化算法。"},{"english":"The displacer piston now moves, shunting the gas to the cold end of the cylinder.","chinese":"活塞的置换现在动作，调气，以冷战结束缸。"},{"english":"Equity swap between shareholders of the listed company and shareholders of Huixin Futures.","chinese":"上市公司股东与汇鑫期货股东进行股权置换。"},{"english":"Thermostability of enzymes can be altered by single amino acid substitution.","chinese":"单一氨基酸的置换可以改变酶的热稳定性。"},{"english":"Instead of stagehands, the actors will move the scenery right in front of the audience.","chinese":"演员们将替代舞台工作人员，当着观众的面置换布景。"},{"english":"The precipitating reaction of the system is controlled by diffusion.","chinese":"体系的置换反应机理符合扩散控制机理。"},{"english":"But the inversion is inevitably incomplete. This is, after all, Rogen's film.","chinese":"但是这种置换却并不彻底，毕竟，这是罗根的电影。"},{"english":"The results show that Cu solubilizes in W and the substitutional solid solution is formed.","chinese":"结果发现，铜固溶在钨中，并形成了置换固溶体。"},{"english":"Objective To study the method of the artificial thigh bone permutation perioperatively for advanced age.","chinese":"目的探讨高龄人工股骨头置换术围手术期的治疗方法。"}],"related":[{"definition":["to swap\/to exchange\/to transpose\/to replace"],"pinyin":["huan4 zhi4"],"word":"换置"},{"definition":["reserves"],"pinyin":["cun2 liang4"],"word":"存量"},{"definition":["to recycle\/to reclaim\/to retrieve\/to recover\/to recall (a defective product)"],"pinyin":["hui2 shou1"],"word":"回收"},{"definition":["to leave sth unused\/to lie idle"],"pinyin":["xian2 zhi4"],"word":"闲置"},{"definition":["to transfer (ownership, rights etc)"],"pinyin":["zhuan3 rang4"],"word":"转让"},{"definition":["to transform\/to reform\/to remodel\/to remold"],"pinyin":["gai3 zao4"],"word":"改造"},{"definition":["to peel\/to strip\/to peel off\/to come off (of tissue, skin, covering etc)"],"pinyin":["bo1 li2"],"word":"剥离"},{"definition":["to rent\/to lease\/to hire"],"pinyin":["zu1 lin4"],"word":"租赁"},{"definition":["to sell\/to offer for sale\/to put on the market"],"pinyin":["chu1 shou4"],"word":"出售"},{"definition":["in surplus"],"pinyin":["fu4 yu5"],"word":"富余"},{"definition":["to furnish\/to provide\/supply (as in supply and demand)"],"pinyin":["gong1 ji3"],"word":"供给"},{"definition":["to insert\/to implant\/to embed\/to introduce (a new element) into"],"pinyin":["zhi4 ru4"],"word":"置入"},{"definition":["to supply\/to provide\/to offer"],"pinyin":["gong1 ying4"],"word":"供应"},{"definition":["to compensate\/to make up"],"pinyin":["bu3 chang2"],"word":"补偿"},{"definition":["to rotate\/to circulate (cash, stock etc)\/turnover\/circulation\/cash flow"],"pinyin":["zhou1 zhuan3"],"word":"周转"},{"definition":["equal\/equal in value\/equivalent"],"pinyin":["deng3 jia4"],"word":"等价"}]}