{"definition":["to sticky (an Internet forum thread etc)"],"pinyin":["zhi4 ding3"],"traditional":["置頂"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"置顶","characters":[{"definition":["to install\/to place\/to put\/to buy"],"pinyin":["zhi4"],"word":"置"},{"definition":["apex\/crown of the head\/top\/roof\/most\/to carry on the head\/to push to the top\/to go against\/to replace\/to substitute\/to be subjected to (an aerial bombing, hailstorm etc)\/(slang) to \"bump\" a forum thread to raise its profile\/classifier for headwear, hats, veils etc"],"pinyin":["ding3"],"word":"顶"}],"containing_words":[],"sentences":[{"english":"That block of time you just scheduled has to be given the utmost priority.","chinese":"你安排出来的时间应该置顶为首要任务。"},{"english":"Look at the top post, and you will find the information about our party venue.","chinese":"看看“置顶”，你会找到关于聚会地点的信息。"},{"english":"Specifies whether the sticky notes are visible on ALL workspaces on the desktop, or not.","chinese":"指定置顶便笺是否在所有工作空间中可见。"},{"english":"How to Unstick Your Button Maker Machine.","chinese":"如何取消置顶你的按钮制造机。"},{"english":"Plz keep this thread up… It is soo sweet to read this article here.","chinese":"让这帖子继续置顶吧，读这些评论，太有意思了。"},{"english":"Default width for new sticky notes in pixels.","chinese":"以像素为单位的新置顶便笺默认宽度。"},{"english":"Why do not see new posts List?","chinese":"现在只能看到置顶贴，没有帖子列表？"}],"related":[{"definition":["to transmit\/to forward (mail, SMS, packets of data)\/to pass on\/to republish (an article from another publication)"],"pinyin":["zhuan3 fa1"],"word":"转发"},{"definition":["server push (computing)"],"pinyin":["tui1 song4"],"word":"推送"},{"definition":["to leave a message\/to leave one's comments\/message"],"pinyin":["liu2 yan2"],"word":"留言"},{"definition":["private correspondence\/personal letter\/(computing) personal message (PM)\/to message sb"],"pinyin":["si1 xin4"],"word":"私信"},{"definition":["to share (let others have some of sth good)"],"pinyin":["fen1 xiang3"],"word":"分享"},{"definition":["to like (an online post on Weibo, Facebook etc)"],"pinyin":["dian3 zan4"],"word":"点赞"},{"definition":["tweet (on Twitter)\/(HK, Tw) to \"bump\" a forum thread to raise its profile\/to reply to original poster (or recommend a post) on PTT bulletin board"],"pinyin":["tui1 wen2"],"word":"推文"},{"definition":["to reply\/to recover\/to return (to a previous condition)\/Re: in reply to (email)"],"pinyin":["hui2 fu4"],"word":"回复"},{"definition":["article\/essay\/literary works\/writings\/hidden meaning\/CL:篇[pian1],段[duan4],頁|页[ye4]"],"pinyin":["wen2 zhang1"],"word":"文章"},{"definition":["to comment on\/to discuss\/comment\/commentary\/CL:篇[pian1]"],"pinyin":["ping2 lun4"],"word":"评论"},{"definition":["Moments (social networking function of smartphone app WeChat 微信[Wei1 xin4])"],"pinyin":["Peng2 you5 quan1"],"word":"朋友圈"},{"definition":["home page"],"pinyin":["zhu3 ye4"],"word":"主页"},{"definition":["dialog box (computing)"],"pinyin":["dui4 hua4 kuang4"],"word":"对话框"},{"definition":["to pay attention to\/to follow sth closely\/to follow (on social media)\/concern\/interest\/attention"],"pinyin":["guan1 zhu4"],"word":"关注"},{"definition":["Sina Weibo, Chinese microblogging website"],"pinyin":["Xin1 lang4 Wei1 bo2"],"word":"新浪微博"},{"definition":["Weixin or WeChat (mobile text and voice messaging service developed by Tencent 騰訊|腾讯[Teng2 xun4])"],"pinyin":["Wei1 xin4"],"word":"微信"}]}