{"definition":["to detain\/to take into custody\/detention\/imprisonment"],"pinyin":["ji1 ya1"],"traditional":["羈押"],"rank":14222.0,"normalized_rank":0.19898423180781555,"fraction":0.000004526182298481068,"cumulative_fraction":0.9556581102104,"word":"羁押","characters":[{"definition":["variant of 羈|羁[ji1]","bridle\/halter\/to restrain\/to detain\/to lodge\/inn"],"pinyin":["ji1","ji1"],"word":"羁"},{"definition":["to mortgage\/to pawn\/to detain in custody\/to escort and protect\/(literary) to sign"],"pinyin":["ya1"],"word":"押"}],"containing_words":[{"definition":["noncustodial (sentence)"],"pinyin":["fei1 ji1 ya1 xing4"],"word":"非羁押性"}],"sentences":[{"english":"The detention house is the main place for the implementation of pre-trial detention.","chinese":"看守所是我国审前羁押的主要执行场所。"},{"english":"Detaining suspects to prevent collusion or the destruction of evidence is also plagued with problems.","chinese":"串供或灭证羁押的制度也不大有问题。"},{"english":"Part III makes an investigation and evaluation on pre-sentence custody mechanism abroad.","chinese":"第三部分域外未决羁押机制的考察与评析。"},{"english":"Thirdly, to define the term of detaining after arrestment according to be law.","chinese":"第三，相应地明确规定逮捕后的羁押期限。"},{"english":"Extended custody is a difficult law-implementing problem which has worried us over a long period of time.","chinese":"超期羁押是一个长期困扰我们的执法难题。"},{"english":"Suspensive detention system is the importance part of the modern legal system.","chinese":"未决羁押制度是现代化法治建设的重要组成部分。"},{"english":"Yet the arrest of a Taiwanese general on charges of spying for China shows how hostilities still simmer.","chinese":"然而，台方对“将军共谍”羁押表明双方敌意仍在。"},{"english":"Part II makes an investigation on China's status pre-sentence custody mechanism.","chinese":"第二部分我国未决羁押机制的现状考察。"},{"english":"Detained persons may request such assistance in all of the island's subbureaus.","chinese":"被羁押人员在岛内所有分局均可要求这种援助。"},{"english":"The first part tells about what'sthe precise meaning of the pretrial detaining.","chinese":"第一部分，审前羁押体制的限定及其研究意义。"},{"english":"III. Establishing a system of timely circulating notices and informing the court of the period of custody.","chinese":"建立及时通报制度，告知法院羁押期限。"},{"english":"The judicial organs have adopted vigorous measures to prevent and contain extended detention.","chinese":"司法机关采取有力措施预防和遏制超期羁押。"},{"english":"Fourthly, to establish the detention inspecting system after arrest.","chinese":"四是建立逮捕以后的羁押审查复核制度。"},{"english":"The power of custody also shows its contradiction in its function of protecting human rights.","chinese":"羁押权在其人权保障功能上也体现出它的悖论性。"},{"english":"The Taipei court will decide this week whether Chen will be released or not.","chinese":"据悉，台北地院本周将裁定是否继续羁押陈水扁。"},{"english":"Unconvicted Detention has been an important system under the criminal procedural law over the world.","chinese":"未决羁押制度是各国刑事诉讼中的一项重要制度。"}],"related":[{"definition":["residential surveillance, a form of noncustodial house arrest"],"pinyin":["jian1 shi4 ju1 zhu4"],"word":"监视居住"},{"definition":["to imprison\/to take into custody"],"pinyin":["shou1 jian1"],"word":"收监"},{"definition":["to arrest\/to take into custody"],"pinyin":["ju1 ya1"],"word":"拘押"},{"definition":["in custody\/to keep sb in detention"],"pinyin":["shou1 ya1"],"word":"收押"},{"definition":["release from custody, subject to provision of a surety, pending investigation (PRC)"],"pinyin":["qu3 bao3 hou4 shen3"],"word":"取保候审"},{"definition":["awaiting trial"],"pinyin":["hou4 shen3"],"word":"候审"},{"definition":["to serve a prison sentence"],"pinyin":["fu2 xing2"],"word":"服刑"},{"definition":["to commit sb for trial\/to bring sb for interrogation"],"pinyin":["ti2 shen3"],"word":"提审"},{"definition":["prison term"],"pinyin":["xing2 qi1"],"word":"刑期"},{"definition":["to authorize an arrest"],"pinyin":["pi1 bu3"],"word":"批捕"},{"definition":["to imprison\/to lock up (in jail)"],"pinyin":["guan1 ya1"],"word":"关押"},{"definition":["to serve (a sentence) outside prison (law)"],"pinyin":["jian1 wai4 zhi2 xing2"],"word":"监外执行"},{"definition":["to arrest\/to apprehend\/an arrest"],"pinyin":["dai4 bu3"],"word":"逮捕"},{"definition":["detention center"],"pinyin":["kan1 shou3 suo3"],"word":"看守所"},{"definition":["to imprison\/to jail\/to take into custody"],"pinyin":["jian1 jin4"],"word":"监禁"},{"definition":["inquest\/trial\/interrogation\/to try\/to interrogate"],"pinyin":["shen3 xun4"],"word":"审讯"}]}