{"definition":["to turn over (when lying)\/(fig.) to free oneself\/to emancipate oneself\/to bring about a change of one's fortunes"],"pinyin":["fan1 shen1"],"traditional":["翻身"],"rank":14032.0,"normalized_rank":0.1963258852993438,"fraction":0.000004642088534209442,"cumulative_fraction":0.9547877224056543,"word":"翻身","characters":[{"definition":["variant of 翻[fan1]","to turn over\/to flip over\/to overturn\/to rummage through\/to translate\/to decode\/to double\/to climb over or into\/to cross"],"pinyin":["fan1","fan1"],"word":"翻"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"}],"containing_words":[{"definition":["to work hard towards a turnaround\/to fight to reverse sth"],"pinyin":["da3 fan1 shen1 zhang4"],"word":"打翻身仗"},{"definition":["(Tw) (coll.) earthquake (According to a folk tale, earthquakes are caused by the occasional movements of an ox that lives under the earth.)"],"pinyin":["di4 niu2 fan1 shen1"],"word":"地牛翻身"},{"definition":["lit. the salted fish turns over (idiom)\/fig. to experience a reversal of fortune"],"pinyin":["xian2 yu2 fan1 shen1"],"word":"咸鱼翻身"}],"sentences":[{"english":"Use rollovers to submit or reset a form.","chinese":"使用翻身递交或者重新设置一张表格。"},{"english":"It is difficult to turn over in a hammock.","chinese":"在吊床上翻身很困难。"},{"english":"Abduction stabilizer bar between legs is never used as a handle to turn the child.","chinese":"千万不能用两腿之间保持外展的支持棒给小儿翻身。"},{"english":"Have client practice turning and sitting up.","chinese":"病人练习翻身和起坐。"},{"english":"The opportunity for Fannie Mae and Freddie Mac to recover has gone.","chinese":"“两房”想咸鱼翻身的机会已经没有了。"},{"english":"Liberated farmers measure the field during the land reform in northeast China in 1948.","chinese":"1948年，东北土地改革中，翻身农民在丈量土地。"},{"english":"A few days later, I was in urine emergency too, so I jumped up the bed and walked to the washroom.","chinese":"后来有一次我也突然尿急，我翻身起床去卫生间。"},{"english":"Robots can do housework, cooking, washing clothes, rolled over and feed the drug.","chinese":"机器人可以做家务，烧饭，洗衣服，翻身，喂药。"},{"english":"For the poor people not always be poor, be bullied, and be slaved.","chinese":"只为穷人要翻身哪，不受欺负喂，不做牛和羊。"},{"english":"Fanshen is also an unchallengeable classic.","chinese":"《翻身》也不容置疑是一部经典著作。"},{"english":"What, babe, what you hear in the bed does not stop turning?","chinese":"怎么了，贝贝，怎么听到你在床上不停的翻身啊？"},{"english":"Rapidly, Zhou Yu managed to rein back, but he was shot in the left rib and fell to the ground.","chinese":"周瑜急勒马回时，被一弩箭，正射中左肋，翻身落马。"},{"english":"If you think they're just going to roll over - you've got another thing coming. \" - Kobe Bryant.\"","chinese":"如果你认为他们只是想翻身，那么将有你好受的。"},{"english":"Right away, then obviously my company turned around.","chinese":"我的公司当即就翻身了。"},{"english":"Can Mr Brown reverse the dynamics?","chinese":"布朗能咸鱼翻身吗？"},{"english":"It would be a mistake, however, to think that Mr McCain will be static for ever.","chinese":"然而认为麦肯恩永无翻身，这就错了。"}],"related":[{"definition":["to jump up suddenly\/to bound up\/to rise up in one bound"],"pinyin":["yi1 yue4 er2 qi3"],"word":"一跃而起"},{"definition":["to get on a horse\/to mount"],"pinyin":["shang4 ma3"],"word":"上马"},{"definition":["lit. the salted fish turns over (idiom)\/fig. to experience a reversal of fortune"],"pinyin":["xian2 yu2 fan1 shen1"],"word":"咸鱼翻身"},{"definition":["to stand up"],"pinyin":["zhan4 qi3 lai5"],"word":"站起来"},{"definition":["to reverse\/to turn around (an undesirable situation)\/(mechanics) torsion"],"pinyin":["niu3 zhuan3"],"word":"扭转"},{"definition":["from now on\/in the future\/time to come"],"pinyin":["wang3 hou4"],"word":"往后"},{"definition":["heel"],"pinyin":["jiao3 gen1"],"word":"脚跟"},{"definition":["to take advantage\/to seize an opportunity\/in passing\/without taking extra trouble\/conveniently"],"pinyin":["shun4 shi4"],"word":"顺势"},{"definition":["powerful\/vigorous\/pungent\/towards\/in view of","thoroughfare\/to go straight ahead\/to rush\/to clash","(of water) to dash against\/to mix with water\/to infuse\/to rinse\/to flush\/to develop (a film)\/to rise in the air\/to clash\/to collide with"],"pinyin":["chong4","chong1","chong1"],"word":"冲"},{"definition":["luckily\/fortunately"],"pinyin":["hao3 zai4"],"word":"好在"},{"definition":["to get up\/to leave\/to set forth"],"pinyin":["qi3 shen1"],"word":"起身"},{"definition":["to take advantage of a favorable situation\/to seize an opportunity"],"pinyin":["chen4 shi4"],"word":"趁势"},{"definition":["to get up on hind legs (esp. of horse)\/to stand\/to spring up"],"pinyin":["zhan4 qi3"],"word":"站起"},{"definition":["to gasp for breath\/to take a breather"],"pinyin":["chuan3 xi1"],"word":"喘息"},{"definition":["to stand firm"],"pinyin":["zhan4 wen3"],"word":"站稳"},{"definition":["to go down to the fields\/to get up from bed\/to leave one's sickbed\/to be born"],"pinyin":["xia4 di4"],"word":"下地"}]}