{"definition":["fellow townsman\/fellow villager\/sb from the same hometown"],"pinyin":["lao3 xiang1"],"traditional":["老鄉"],"rank":7106.0,"normalized_rank":0.09942215941684272,"fraction":0.000014417918249899316,"cumulative_fraction":0.8980623696630812,"word":"老乡","characters":[{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["country or countryside\/native place\/home village or town\/township (PRC administrative unit)"],"pinyin":["xiang1"],"word":"乡"}],"containing_words":[],"sentences":[{"english":"All products are purchased from acquaintance fellow villagers so that products have high quality.","chinese":"所有产品收购于邻近相识的父老乡亲，品质有保障。"},{"english":"The villagers also filmed this Tianshan snow crab specimens made of snow crab.","chinese":"我们的老乡还拍了这只天山雪蟹做成标本的雪蟹。"},{"english":"Hazy darkness, Yu-ming, another fellow from \"The Fat Man, \" the phone.","chinese":"朦胧夜色中，于得明接到另一位老乡“胖子”的电话。"},{"english":"Hereby he is presenting the fellows in Northeast China.","chinese":"在这里他向我们呈现的是东北的父老乡亲。"},{"english":"It wasn't good. They must have thought I have joined them.","chinese":"那样不好，他们一定以为我和那老乡是一伙的。"},{"english":"Thanks to those guys who have ever supported me and my family. Thanks indeed.","chinese":"谢谢各位父老乡亲对我的关心和支持。"},{"english":"Marita Lindahl, after winning the Miss World title, married a fellow Finn, a publicity manager.","chinese":"夺冠之后嫁给一位从事公关经理工作的芬兰老乡。"},{"english":"From then on all the villagers talked about\"our Doctor Mei\".","chinese":"从那时起，老乡们都在谈”我们的梅大夫”了。"},{"english":"But he wanted to see the old folk again and to visit my mother's grave.","chinese":"但是，他想看一看家乡父老乡亲，为我的母亲扫墓。"},{"english":"Confucius awoke and knew his compatriot was not an ordinary person.","chinese":"孔子这时才惊醒过来，知道这位老乡，实非等闲之辈。"},{"english":"At that time, there are well-intentioned fellow remind him that prostitutes infected with AIDS care.","chinese":"当时，有老乡善意提醒他，小心嫖娼染上艾滋病。"},{"english":"Blue is a claim with the Laoxiang Xiaofang, and is willing to help her.","chinese":"蓝某自称与小芳是老乡，并愿意帮助她。"},{"english":"Villagers say, hope for how many years, our immigration as a officer.","chinese":"老乡们说，盼了多少年，总算盼到我们的移民当了官。"},{"english":"No person of hometown, working pressure also big, sometimes will also be colleagues bullying.","chinese":"没有老乡，工作压力也大，有时也会被同事欺负。"}],"related":[{"definition":["person from the same village, town, or province"],"pinyin":["tong2 xiang1"],"word":"同乡"},{"definition":["a relative (i.e. family relation)\/CL:門|门[men2],個|个[ge4],位[wei4]"],"pinyin":["qin1 qi5"],"word":"亲戚"},{"definition":["native place\/place of origin\/home state or region"],"pinyin":["lao3 jia1"],"word":"老家"},{"definition":["fellow countryman (from the same village)\/local people\/villager\/the folks back home"],"pinyin":["xiang1 qin1"],"word":"乡亲"},{"definition":["brothers\/younger brother\/CL:個|个[ge4]\/I, me (humble term used by men in public speech)\/brotherly\/fraternal"],"pinyin":["xiong1 di4"],"word":"兄弟"},{"definition":["workmate"],"pinyin":["gong1 you3"],"word":"工友"},{"definition":["hometown\/native place\/CL:個|个[ge4]"],"pinyin":["jia1 xiang1"],"word":"家乡"},{"definition":["(dialect) close childhood friend whom one grew up with\/a couple who grew up as childhood friends"],"pinyin":["fa4 xiao3"],"word":"发小"},{"definition":["young man\/young guy\/lad\/youngster\/CL:個|个[ge4]"],"pinyin":["xiao3 huo3 zi5"],"word":"小伙子"},{"definition":["a stranger\/out-of-towner"],"pinyin":["wai4 xiang1 ren2"],"word":"外乡人"},{"definition":["acquaintance\/friend"],"pinyin":["shu2 ren2"],"word":"熟人"},{"definition":["eldest brother\/big brother (polite address for a man of about the same age as oneself)\/gang leader\/boss"],"pinyin":["da4 ge1"],"word":"大哥"},{"definition":["younger male cousin via female line"],"pinyin":["biao3 di4"],"word":"表弟"},{"definition":["comrade-in-arms\/battle companion"],"pinyin":["zhan4 you3"],"word":"战友"},{"definition":["native person (of a country)"],"pinyin":["ben3 di4 ren2"],"word":"本地人"},{"definition":["another part of the country\/some other place"],"pinyin":["wai4 xiang1"],"word":"外乡"}]}