{"definition":["lit. old general\/commander-in-chief 將帥|将帅, the equivalent of king in Chinese chess\/fig. old-timer\/veteran"],"pinyin":["lao3 jiang4"],"traditional":["老將"],"rank":4543.0,"normalized_rank":0.06356246414730038,"fraction":0.000027634878563605516,"cumulative_fraction":0.8471730326704688,"word":"老将","characters":[{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])","general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead"],"pinyin":["qiang1","jiang1","jiang4"],"word":"将"}],"containing_words":[],"sentences":[{"english":"I had to listen to the manager and players like Giggsy – he gives me advice all the time.","chinese":"我请教过经理和老将，他们总是给我建议。"},{"english":"One night, Zhou Yu was thinking hard in his tent about how to defeat Cao Cao's army, when Huang Gai came in .","chinese":"一日深夜，老将黄盖来到帐中，商议破曹以火攻为好。"},{"english":"The old veteran could tire out the most robust sportsman.","chinese":"这位久经沙场的老将能把最强壮的运动员拖得筋疲力。"},{"english":"The performance also secured a raft of records for veteran Wu.","chinese":"这一成绩也让老将吴敏霞创造了一系列纪录。"},{"english":"Finley is expected to sign for the prorated veteran minimum.","chinese":"芬利可能在几天内签一份老将底薪合约。"},{"english":"This is a story from Three Kingdoms. Huang Zhong, a veteran in the army of Shu, was one of its top five generals.","chinese":"黄忠是蜀军中有名的老将。"},{"english":"This is a story from Three Kingdoms. Huang Zhong， a veteran in the army of Shu， was one of its top five generals.","chinese":"黄忠是蜀军中有名的老将。"},{"english":"He navigates celebrity dinner galas like a seasoned politician.","chinese":"他游刃有余地参加名流晚宴，宛如政坛老将。"},{"english":"The world by tomorrow tired, spring bitter autumn comes after veteran to.","chinese":"世人苦被明日累，春去秋来老将至。"},{"english":"All mortals are tired for the sake of tomorrow","chinese":"世人若被明日累，春来秋去老将至。"},{"english":"Rock and roll veteran Keith Richards has a cameo as Captain Jack's father.","chinese":"摇滚老将基思理查兹拥有作为杰克船长的父亲客串。"},{"english":"However, the United manager insists his longest-serving player still has an important job to do at Old Trafford.","chinese":"不过，曼联经理说这位老将还是要在曼联工作。"}],"related":[{"definition":["(in classical literature) young military officer of high rank for his age\/(during the Cultural Revolution) young militant in the Red Guard\/(in modern usage) rising star (in sport, politics etc)"],"pinyin":["xiao3 jiang4"],"word":"小将"},{"definition":["to replace (a damaged component with a new one, an injured player with a substitute player, full-time workers with casual workers etc)\/a substitute\/a replacement"],"pinyin":["ti4 bu3"],"word":"替补"},{"definition":["sports club member\/footballer, golfer etc"],"pinyin":["qiu2 yuan2"],"word":"球员"},{"definition":["a general or admiral"],"pinyin":["da4 jiang4"],"word":"大将"},{"definition":["campaign\/expedition"],"pinyin":["zheng1 zhan4"],"word":"征战"},{"definition":["(sports) member of the national team\/national representative\/(medicine, chess etc) one of the most highly skilled practitioners in one's country"],"pinyin":["guo2 shou3"],"word":"国手"},{"definition":["rear guard\/backfield\/fullback"],"pinyin":["hou4 wei4"],"word":"后卫"},{"definition":["athlete\/contestant"],"pinyin":["xuan3 shou3"],"word":"选手"},{"definition":["(military) commander-in-chief\/(sports) team manager\/coach"],"pinyin":["zhu3 shuai4"],"word":"主帅"},{"definition":["to leave one's post"],"pinyin":["li2 dui4"],"word":"离队"},{"definition":["sports team (basketball, soccer, football etc)"],"pinyin":["qiu2 dui4"],"word":"球队"},{"definition":["veteran general"],"pinyin":["su4 jiang4"],"word":"宿将"},{"definition":["troop arrangement\/battle formation\/lineup (of a sports team etc)"],"pinyin":["zhen4 rong2"],"word":"阵容"},{"definition":["famous general"],"pinyin":["ming2 jiang4"],"word":"名将"},{"definition":["vanguard\/front line\/a forward (sports)"],"pinyin":["qian2 feng1"],"word":"前锋"},{"definition":["a playoff"],"pinyin":["ji4 hou4 sai4"],"word":"季后赛"}]}