{"definition":["capital\/assets\/savings\/nest egg\/(fig.) reputation\/laurels (to rest upon)\/old edition of a book\/(tree) trunk"],"pinyin":["lao3 ben3"],"traditional":["老本"],"rank":37086.0,"normalized_rank":0.5188812558588558,"fraction":5.021630364050467e-7,"cumulative_fraction":0.9952012193730712,"word":"老本","characters":[{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"}],"containing_words":[],"sentences":[{"english":"Then it would seem that the disciples went back to their fishing for a short period.","chinese":"之后，门徒似乎有一段短时间回去作捕鱼的老本行。"},{"english":"This did not yet tempt them to adventures staking Soviet assets.","chinese":"这还没有促使他们把苏联的老本拿来孤注一掷。"},{"english":"There is little evidence that America is resting on its laurels, according to RAND.","chinese":"兰德公司指出，没有证据表明美国正在吃老本。"},{"english":"You should go on studying instead of resting on your laurels.","chinese":"你应该继续努力学习而不能吃老本。"},{"english":"And so she returned to her old trade of catching flies again.","chinese":"于是，她又干起老本行，捉苍蝇去了。"},{"english":"He does no business but lives on his capital.","chinese":"他不做生意光吃老本。"},{"english":"He was back on familiar ground, dealing with the customers.","chinese":"他又干起了与顾客打交道的老本行。"},{"english":"So now I'm happy to go back to my usual work.","chinese":"所以，我很高兴现在能又回到我的老本行。"},{"english":"It seems that we can no longer afford to rest on our Laurels .","chinese":"看来我们再也不能靠吃老本过曰子了。"},{"english":"It's my line.","chinese":"这是我的老本行。"},{"english":"The guy with just this one song.","chinese":"吃一首歌老本的家伙。"},{"english":"Therefore, those who live off their past gains will be looked down upon and won't have a prospect.","chinese":"所以吃老本的人是会被人瞧不起或没有前途的。"},{"english":"Lovers in like manner live on their capital from failure of income.","chinese":"恋人在收入有限时也以类似的方式以他们的老本为生。"}],"related":[{"definition":["lit. just sitting and eating, one can deplete even a mountain of wealth (idiom)\/fig. to spend one's money without generating any income"],"pinyin":["zuo4 chi1 shan1 kong1"],"word":"坐吃山空"},{"definition":["deficiency\/deficit\/luckily\/it's lucky that...\/(often ironically) fancy that..."],"pinyin":["kui1"],"word":"亏"},{"definition":["capital\/(fig.) asset\/advantage\/the means (to do sth)"],"pinyin":["ben3 qian2"],"word":"本钱"},{"definition":["family property\/patrimony"],"pinyin":["jia1 di3"],"word":"家底"},{"definition":["to squander one's fortune\/to dissipate one's wealth"],"pinyin":["bai4 guang1"],"word":"败光"},{"definition":["familial property\/belongings"],"pinyin":["jia1 dang4"],"word":"家当"},{"definition":["painstakingly\/with great trouble"],"pinyin":["xin1 xin1 ku3 ku3"],"word":"辛辛苦苦"},{"definition":["to make a loss"],"pinyin":["kui1 ben3"],"word":"亏本"},{"definition":["to save\/to put aside\/savings"],"pinyin":["ji1 xu4"],"word":"积蓄"},{"definition":["loss\/to sustain losses"],"pinyin":["pei2 ben3"],"word":"赔本"},{"definition":["lit. drink the northwest wind (idiom); cold and hungry"],"pinyin":["he1 xi1 bei3 feng1"],"word":"喝西北风"},{"definition":["hard-earned capital"],"pinyin":["xue4 ben3"],"word":"血本"},{"definition":["lit. even a scrawny camel is bigger than a horse (idiom)\/fig. even after suffering a loss, a rich person is still better off than ordinary people\/a cultured person may come down in the world, but he is still superior to the common people"],"pinyin":["shou4 si3 de5 luo4 tuo5 bi3 ma3 da4"],"word":"瘦死的骆驼比马大"},{"definition":["income does not cover expenditure\/unable to make ends meet"],"pinyin":["ru4 bu4 fu1 chu1"],"word":"入不敷出"},{"definition":["to save on food and clothing (idiom); to live frugally"],"pinyin":["jie2 yi1 suo1 shi2"],"word":"节衣缩食"},{"definition":["to lose everything one invested (idiom)\/to lose one's shirt"],"pinyin":["xue4 ben3 wu2 gui1"],"word":"血本无归"}]}