{"definition":["to play the same old tune (idiom); unoriginal"],"pinyin":["lao3 diao4 chong2 tan2"],"traditional":["老調重彈"],"rank":44119.0,"normalized_rank":0.6172820505645489,"fraction":2.599861534411012e-7,"cumulative_fraction":0.9978002340912736,"word":"老调重弹","characters":[{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["tiao2","diao4"],"word":"调"},{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["zhong4","chong2"],"word":"重"},{"definition":["to pluck (a string)\/to play (a string instrument)\/to spring or leap\/to shoot (e.g. with a catapult)\/(of cotton) to fluff or tease\/to flick\/to flip\/to accuse\/to impeach\/elastic (of materials)","crossball\/bullet\/shot\/shell\/ball"],"pinyin":["tan2","dan4"],"word":"弹"}],"containing_words":[],"sentences":[{"english":"You've been getting the fourth, the fifth, and the sixth implementation of a good idea funded.","chinese":"而是第四手甚至更后的，一个新想法都被老调重弹了。"},{"english":"Now he's started on his hobbyhorse.","chinese":"现在他又开始老调重弹了。"},{"english":"That spokesman is striking up the same old tune.","chinese":"那个发言人又在老调重弹。"},{"english":"Was this just more of the same or something new?","chinese":"这究竟是老调重弹还是一种新情况呢？"},{"english":"Don't get him started on his hobbyhorse.","chinese":"不要让他又开始他的老调重弹。"},{"english":"That's a string that's been harped on many times before.","chinese":"这是一种老调重弹。"},{"english":"A renewal of those worries isn't the only problem currently facing Huawei.","chinese":"华为目前面对的问题不单只这个老调重弹的担忧。"},{"english":"The opposition ridiculed the government's proposals, saying they often have nothing new.","chinese":"反对派揶揄政府的建议，说成是老调重弹。"}],"related":[{"definition":["an old observation (idiom)\/a truism\/banal comments"],"pinyin":["lao3 sheng1 chang2 tan2"],"word":"老生常谈"},{"definition":["replaying the same old tunes (idiom); conservative, unoriginal and discredited\/to keep harping on about the same old stuff"],"pinyin":["jiu4 diao4 chong2 tan2"],"word":"旧调重弹"},{"definition":["cliché\/commonplace\/truism\/stereotype"],"pinyin":["chen2 ci2 lan4 diao4"],"word":"陈词滥调"},{"definition":["to raise the same topic"],"pinyin":["chong2 ti2"],"word":"重提"},{"definition":["to stir-fry leftover rice\/fig. to rehash the same story\/to serve up the same old product"],"pinyin":["chao3 leng3 fan4"],"word":"炒冷饭"},{"definition":["old wine in a new bottle (idiom)"],"pinyin":["xin1 ping2 zhuang1 jiu4 jiu3"],"word":"新瓶装旧酒"},{"definition":["the same old stuff"],"pinyin":["lao3 yi1 tao4"],"word":"老一套"},{"definition":["argument\/view (sometimes derogatory)"],"pinyin":["lun4 diao4"],"word":"论调"},{"definition":["to avoid the important and dwell on the trivial\/to keep silent about major charges while admitting minor ones"],"pinyin":["bi4 zhong4 jiu4 qing1"],"word":"避重就轻"},{"definition":["to use the current topic to put over one's own ideas\/to use sth as a pretext to make a fuss"],"pinyin":["jie4 ti2 fa1 hui1"],"word":"借题发挥"},{"definition":["polite phrase\/conventional greetings\/cliché\/to try to worm facts out of sb"],"pinyin":["tao4 hua4"],"word":"套话"},{"definition":["to digress\/to get sidetracked\/to go off on a tangent"],"pinyin":["che3 yuan3"],"word":"扯远"},{"definition":["(Tw) unoriginal\/hackneyed\/(of a joke) old"],"pinyin":["lao3 geng3"],"word":"老梗"},{"definition":["political correctness\/politically correct"],"pinyin":["zheng4 zhi4 zheng4 que4"],"word":"政治正确"},{"definition":["to replay string instrument\/fig. to harp on the same string\/to raise the same old topic again"],"pinyin":["chong2 tan2"],"word":"重弹"},{"definition":["(of a writing etc) to have no substance (idiom)\/to carry no weight"],"pinyin":["yan2 zhi1 wu2 wu4"],"word":"言之无物"}]}