{"definition":["to pass entrance exam\/to enter college after a competitive exam"],"pinyin":["kao3 ru4"],"traditional":["考入"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"考入","characters":[{"definition":["to beat\/to hit\/variant of 考[kao3]\/to inspect\/to test\/to take an exam","to check\/to verify\/to test\/to examine\/to take an exam\/to take an entrance exam for\/deceased father"],"pinyin":["kao3","kao3"],"word":"考"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"}],"containing_words":[],"sentences":[{"english":"In 2007 Pan entered the School of Geography and Planning.","chinese":"2007年，潘文伟考入中大地理科学与规划学院。"},{"english":"He admitted his grandfather used to work at the university.","chinese":"他想考入他爷爷过去工作的那所大学。"},{"english":"After he was admitted to comply with the wishes of Beijing Union Medical College parents.","chinese":"后遵从父母意愿考入北京协和医科大学。"},{"english":"It is to hope to take an examination of Beijing philharmonic, 2 it is meet again of Chen Ya of become reconciled brother.","chinese":"一是希望考入北京交响乐团，二是和好兄弟陈亚重逢。"},{"english":"After graduation, was admitted to the Beijing eight.","chinese":"毕业后，考入北京八中。"},{"english":"Every fall hundreds of thousands of young people matriculate in colleges and universities.","chinese":"每年秋季成千上万的青年考入高等院校。"},{"english":"Although admitted to the two classes, but can not prove that learn English well.","chinese":"虽然考入了二级班，但并不能证明英语学得有很好。"},{"english":"Although they have been admitted to the high school, but their virtual rating not synchronization.","chinese":"尽管他们考入了高中，但是他们的实际能力并不同步。"},{"english":"The proportion of students entering universities and colleges is revving up in recent years.","chinese":"近几年来考入大专院校的升学率正在不断提高。"},{"english":"My sister is enrolled in the Central Academy of Art to study western painting.","chinese":"姐姐考入中央美术学院学习西洋画。"},{"english":"She has been in the China Opera and Ballet Theater Troupe since 1997.","chinese":"年毕业后考入中国歌剧舞剧院至今。"},{"english":"Xiao Ming has been admitted by Shanghai University to study genetic engineering.","chinese":"小明考入了上海大学的遗传工程专业。"},{"english":"My dream is to enter Beijing University.","chinese":"我的梦想是考入北京大学。"},{"english":"In 1993, I got into the best high school in Wroclaw.","chinese":"1993年我考入弗罗茨瓦夫最好的高中。"},{"english":"Entrance to an elite college like Peking or Tsinghua University.","chinese":"考入类似北京大学或清华大学这样的精英大学。"},{"english":"Andrew is getting a lot heat from his parents to get into a good university.","chinese":"安德鲁的父母给他很大的压力，让他考入一个好大学。"}],"related":[{"definition":["to gain entry by passing an exam\/to be admitted to (a college etc)"],"pinyin":["kao3 jin4"],"word":"考进"},{"definition":["to pass a university entrance exam"],"pinyin":["kao3 shang4"],"word":"考上"},{"definition":["to pass an entrance exam\/to be admitted to"],"pinyin":["kao3 qu3"],"word":"考取"},{"definition":["Central Academy of Drama"],"pinyin":["Zhong1 yang1 Xi4 ju4 Xue2 yuan4"],"word":"中央戏剧学院"},{"definition":["Shanghai Theatrical Institute"],"pinyin":["Shang4 hai3 Xi4 ju4 Xue2 yuan4"],"word":"上海戏剧学院"},{"definition":["graduation\/to graduate\/to finish school"],"pinyin":["bi4 ye4"],"word":"毕业"},{"definition":["Beijing Film Academy"],"pinyin":["Bei3 jing1 Dian4 ying3 Xue2 yuan4"],"word":"北京电影学院"},{"definition":["to go to school"],"pinyin":["jiu4 du2"],"word":"就读"},{"definition":["to sign up for an examination\/to apply for admission (to a university etc)\/to apply (for a position)"],"pinyin":["tou2 kao3"],"word":"投考"},{"definition":["to pursue one's studies"],"pinyin":["shen1 zao4"],"word":"深造"},{"definition":["to major (in a field)\/to study a specialty to obtain a higher degree"],"pinyin":["gong1 du2"],"word":"攻读"},{"definition":["undergraduate course\/undergraduate (attributive)"],"pinyin":["ben3 ke1"],"word":"本科"},{"definition":["to attend (a school)\/to drop out (of college etc)"],"pinyin":["yi4 ye4"],"word":"肄业"},{"definition":["to accept an applicant (prospective student, employee etc) who passes an entrance exam\/to admit (a student)\/to hire (a job candidate)"],"pinyin":["lu4 qu3"],"word":"录取"},{"definition":["student of great ability"],"pinyin":["gao1 cai2 sheng1"],"word":"高材生"},{"definition":["to enter oneself for an examination"],"pinyin":["bao4 kao3"],"word":"报考"}]}