{"definition":["to inhabit a region (esp. ethnic group)\/to congregate"],"pinyin":["ju4 ju1"],"traditional":["聚居"],"rank":18268.0,"normalized_rank":0.2555930211408504,"fraction":0.0000028604315983595606,"cumulative_fraction":0.9702993299981753,"word":"聚居","characters":[{"definition":["to congregate\/to assemble\/to mass\/to gather together\/to amass\/to polymerize"],"pinyin":["ju4"],"word":"聚"},{"definition":["to reside\/to be (in a certain position)\/to store up\/to be at a standstill\/residence\/house\/restaurant\/classifier for bedrooms","(archaic) sentence-final particle expressing a doubting attitude","surname Ju"],"pinyin":["ju1","ji1","Ju1"],"word":"居"}],"containing_words":[{"definition":["inhabited land\/habitat"],"pinyin":["ju4 ju1 di4"],"word":"聚居地"}],"sentences":[{"english":"The second part is about the machine-processd components of settlement form in the ancient towns of Bayu.","chinese":"第二部分为巴渝古镇聚居形态的构成机制研究。"},{"english":"The old house our clan had lived in for so many years had already been sold.","chinese":"我们多年聚居的老屋，已经卖给别姓了。"},{"english":"It is a region inhabited by an overwhelming majority of the Korean minority nationality in China.","chinese":"长白山区，是我国朝鲜族同胞的主要聚居地。"},{"english":"This is the first time that the outbreak of demonstrations in cities and towns inhabited by Arabs.","chinese":"今次亦是首次有阿拉伯人聚居城镇爆发示威。"},{"english":"Western Guizhou is inhabited by many minority nationalities living in compact communities.","chinese":"黔西是一个少数民族聚居地。"},{"english":"These communities still exist today.","chinese":"时至今日，这些聚居区依然如故。"},{"english":"Shangqiu is the original settlement of the Shang Tribe.","chinese":"商丘是商族的起源和聚居地。"},{"english":"The forth part is the considers and exploration about integration of settlement form in the ancient towns of Bayu.","chinese":"第四部分为对古镇聚居形态的整合思考与探索。"},{"english":"Village refers to the homes habitation for the living and various productions of the villagers.","chinese":"村庄是指农村村民居住和从事各种生产的聚居点。"},{"english":"Hongyuan:Hongyuan is the only complete grassland farming county in A Ba which is Tibet's habitation.","chinese":"红原红原是阿坝州唯一的以藏族聚居为主的纯牧业县。"},{"english":"The Mai Po Marshes form one of the most important wildlife conservation sites in Hong Kong.","chinese":"米埔沼泽区是本港野生动物的主要聚居地之一。"},{"english":"New York is a vast melting-pot of different nationalities.","chinese":"纽约是不同国籍的人的聚居地。"},{"english":"Tujia ethnic group in Hubei mainly lives in the compact communities of Wuling mountain area.","chinese":"湖北土家族长期聚居在鄂西武陵山区。"},{"english":"The She Nationality is a main minority in Fujian, which mostly inhabits in Ningde, East Fujian.","chinese":"畲族大多聚居于福建省东部的宁德市。"},{"english":"This shows that by the late primitive society, Jingxing territory has been inhabited by human beings.","chinese":"这表明最迟在原始社会晚期，井陉境内已有人类聚居。"},{"english":"Seventeen thousand Indians live in Arizona on a reservation .","chinese":"一万七千名印第安人居住在亚利桑那州的聚居地。"}],"related":[{"definition":["inhabited land\/habitat"],"pinyin":["ju4 ju1 di4"],"word":"聚居地"},{"definition":["cohabitation (of different populations or races)\/to coexist"],"pinyin":["za2 ju1"],"word":"杂居"},{"definition":["community\/living together"],"pinyin":["ji2 ju1"],"word":"集居"},{"definition":["(of a group of people) to live scattered over an area"],"pinyin":["san3 ju1"],"word":"散居"},{"definition":["settlement\/dwelling place\/town\/village"],"pinyin":["ju4 luo4"],"word":"聚落"},{"definition":["to migrate\/to move"],"pinyin":["qian1 xi3"],"word":"迁徙"},{"definition":["village"],"pinyin":["cun1 luo4"],"word":"村落"},{"definition":["indigenous peoples\/aborigine"],"pinyin":["yuan2 zhu4 min2"],"word":"原住民"},{"definition":["to settle (in some city, country etc)\/to take up residence"],"pinyin":["ding4 ju1"],"word":"定居"},{"definition":["ethnic group\/community"],"pinyin":["zu2 qun2"],"word":"族群"},{"definition":["descendant"],"pinyin":["hou4 yi4"],"word":"后裔"},{"definition":["to reside\/to dwell\/to live in a place\/resident in"],"pinyin":["ju1 zhu4"],"word":"居住"},{"definition":["to multiply\/to reproduce\/to increase gradually in number or quantity"],"pinyin":["fan2 yan3"],"word":"繁衍"},{"definition":["(of disparate elements) to mix in with one another\/(of diverse groups of people) to live in the same area\/to coexist"],"pinyin":["za2 chu3"],"word":"杂处"},{"definition":["branch or subdivision of a family"],"pinyin":["zhi1 xi4"],"word":"支系"},{"definition":["clan"],"pinyin":["shi4 zu2"],"word":"氏族"}]}