{"definition":["to focus"],"pinyin":["ju4 jiao1"],"traditional":["聚焦"],"rank":8659.0,"normalized_rank":0.12115064429924588,"fraction":0.000010515644328626146,"cumulative_fraction":0.9171805605016594,"word":"聚焦","characters":[{"definition":["to congregate\/to assemble\/to mass\/to gather together\/to amass\/to polymerize"],"pinyin":["ju4"],"word":"聚"},{"definition":["surname Jiao","burnt\/scorched\/charred\/worried\/anxious\/coke\/abbr. for 焦耳[jiao1 er3], joule"],"pinyin":["Jiao1","jiao1"],"word":"焦"}],"containing_words":[{"definition":["microfocus x-ray computed tomography (microCT)"],"pinyin":["wei1 ju4 jiao1"],"word":"微聚焦"}],"sentences":[{"english":"However, the present studies focus on the successes of Yong-Cheng.","chinese":"然而，综观目前研究，学者多聚焦于雍正帝的功业。"},{"english":"Our primary focus is getting the feature code completed on time.","chinese":"我们的主要聚焦点是使重要的代码按时完成。"},{"english":"He seemed to relish the pressure and focus that had eclipsed his predecessors.","chinese":"安帅对压力和聚焦的把握能力让他的前任黯然失色。"},{"english":"which is definitely focusing on the business crowd, on people with their careers.","chinese":"这里主要聚焦的是商业人群，更适合相关行业人士。"},{"english":"Doesn`t reading in poor light make the eyes focus more and cause myopia to increase?","chinese":"在暗光下阅读，不会使双眼过度聚焦，引起近视加重？"},{"english":"A. But no matter. The Lakers were relevant once again.","chinese":"但是无论如何，湖人又一次成为聚焦点。"},{"english":"Consider whether you want the background in focus or nice and blurry.","chinese":"然后考虑景深深浅让背景聚焦清晰或模糊虚化。"},{"english":"In the waking state it focuses in physical reality.","chinese":"它在清醒状态时聚焦于物质实相。"},{"english":"The material polymerizes and solidifies at the focused spots.","chinese":"该材料聚合并固化的聚焦点。"},{"english":"The extra wobble and zoomed-in focusing would make a viewfinder very welcome here.","chinese":"额外的摆动和放大的聚焦会使取景器非常欢迎。"},{"english":"The algorithm reduces mountain climbing steps, and enhances auto-focus speed.","chinese":"该算法能够减少爬山步数，可提高自动聚焦速度。"},{"english":"It focused on exploring the impacts from the family-of-origin on the intimate relationship and rebuilding the Self.","chinese":"聚焦在原生家庭对亲密关系的影响和重建自我。"},{"english":"It's my pleasure to stand here and give all of you a speech concetrate on the English name of our country.","chinese":"我很荣幸站在这里发表聚焦我们祖国英文名的演讲。"},{"english":"The United States imports focusing mirrors and metal mirrors, cutting and strong.","chinese":"采用美国进口聚焦镜和金属反射镜，切割力强。"},{"english":"Focus on relationship-building.","chinese":"聚焦于关系构建。"},{"english":"There is one immolation and it focuses its attention in various dimensions.","chinese":"有一个自卧冬它将其留意力聚焦于不同的维度。"}],"related":[{"definition":["to concentrate\/to centralize\/to focus\/centralized\/concentrated\/to put together"],"pinyin":["ji2 zhong1"],"word":"集中"},{"definition":["to revolve around\/to center on (an issue)"],"pinyin":["wei2 rao4"],"word":"围绕"},{"definition":["to put effort into sth\/to try really hard"],"pinyin":["zhuo2 li4"],"word":"着力"},{"definition":["to take aim at\/to target"],"pinyin":["miao2 zhun3"],"word":"瞄准"},{"definition":["to stick closely to (a topic or theme etc)"],"pinyin":["jin3 kou4"],"word":"紧扣"},{"definition":["to be oriented towards\/orientation"],"pinyin":["dao3 xiang4"],"word":"导向"},{"definition":["important point\/main point\/focus\/key (project etc)\/to focus on\/to put the emphasis on","to recount (e.g. results of election)\/to re-evaluate"],"pinyin":["zhong4 dian3","chong2 dian3"],"word":"重点"},{"definition":["to put emphasis on\/to stress"],"pinyin":["zhuo2 zhong4"],"word":"着重"},{"definition":["to focus\/to concentrate\/to give one's full attention"],"pinyin":["zhuan1 zhu4"],"word":"专注"},{"definition":["to face\/to turn towards\/to incline to\/geared towards\/catering for\/-oriented\/facial feature\/appearance\/aspect\/facet"],"pinyin":["mian4 xiang4"],"word":"面向"},{"definition":["viewpoint\/angle on sth\/perspective"],"pinyin":["shi4 jiao3"],"word":"视角"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推动"},{"definition":["to create\/to build\/to develop\/to forge (of metal)"],"pinyin":["da3 zao4"],"word":"打造"},{"definition":["to extend\/to stretch out\/ductable\/to scale\/scalable"],"pinyin":["yan2 zhan3"],"word":"延展"},{"definition":["deep plowing\/thorough penetration\/thorough development (of a market segment etc)"],"pinyin":["shen1 geng1"],"word":"深耕"},{"definition":["convergence\/to come together"],"pinyin":["hui4 ju4"],"word":"汇聚"}]}