{"definition":["stock market index\/share price index\/abbr. for 股票指數|股票指数[gu3 piao4 zhi3 shu4]"],"pinyin":["gu3 zhi3"],"traditional":["股指"],"rank":2695.0,"normalized_rank":0.03770654652805955,"fraction":0.00005446731811235099,"cumulative_fraction":0.7750972431676563,"word":"股指","characters":[{"definition":["thigh\/part of a whole\/portion of a sum\/(stock) share\/strand of a thread\/low-level administrative unit, translated as \"section\" or \"department\" etc, ranked below 科[ke1]\/classifier for long winding things like ropes, rivers etc\/classifier for smoke, smells etc: thread, puff, whiff\/classifier for bands of people, gangs etc\/classifier for sudden forceful actions"],"pinyin":["gu3"],"word":"股"},{"definition":["finger\/to point at or to\/to indicate or refer to\/to depend on\/to count on\/(of hair) to stand on end"],"pinyin":["zhi3"],"word":"指"}],"containing_words":[],"sentences":[{"english":"If without critical bad news, the index will continue to rise up next week.","chinese":"如果没有重大利空消息，下周股指延续上行趋势不变。"},{"english":"Asian shares were mixed while U. S. stock futures were pointing to mild gains on Wall Street.","chinese":"亚洲股市涨跌互现，美国股指期货开盘后小幅走高。"},{"english":"Even so, the comments sent stocks into a late-afternoon dive.","chinese":"即便如此，此番言论还是令股指在尾盘跳水。"},{"english":"Johnson & Johnson and Merck Sharp & Dohme down the impact of the performance of the Dow to lag behind other indexes.","chinese":"强生与默沙东下跌影响，道指表现落后于其它股指。"},{"english":"Asian shares lost ground while U.S. stock futures were pointing to a steady open on Wall Street.","chinese":"亚洲股市纷纷失守，美国股指期货开盘走稳。"},{"english":"I discuss the function which Index Future downsizes risks of the stock market in the paper.","chinese":"本文研究了股指期货对股市风险的防范。"},{"english":"Owning heavyweight stocks will give institutions more control of the index futures.","chinese":"拥有权重股将增加机构投资者对股指期货的控制力。"},{"english":"The local shares index has dropped sharply towards the 3000 mark.","chinese":"本地股指骤降，直逼3000点大关。"},{"english":"Stocks have risen from their lows of a week ago.","chinese":"股指已经从一周前的低点开始上涨。"},{"english":"The red digital in the stock exchange indicates that the stock index has risen slightly.","chinese":"证券交易所的红盘显示，股指略有上涨。"},{"english":"As the index goes up, there is more and more pressure on cash flows.","chinese":"随着股指的走高，获利盘的套现压力越来越大。"},{"english":"Major European indexes erased early morning losses.","chinese":"欧洲几大股指早盘收复失地。"},{"english":"Other major stock indexes also fell heavily.","chinese":"其他主要股指同样严重下跌。"},{"english":"On the same day, two other major European stock indexes have suffered various magnitudes .","chinese":"当日，欧洲其他两大主要股指却遭受不同程度的跌幅。"},{"english":"U.S. stock-index futures climbed while Asian shares retreated.","chinese":"美国股指期货上涨，亚洲股市下滑。"}],"related":[{"definition":["Shanghai Stock Exchange (SSE), abbr. for 上海證券交易所|上海证券交易所[Shang4 hai3 Zheng4 quan4 Jiao1 yi4 suo3]"],"pinyin":["Shang4 Zheng4"],"word":"上证"},{"definition":["Shanghai composite index (stock market index)"],"pinyin":["Hu4 zong1 zhi3"],"word":"沪综指"},{"definition":["market close"],"pinyin":["shou1 pan2"],"word":"收盘"},{"definition":["(of sales, prices etc) to fall\/to drop\/decline\/slump"],"pinyin":["xia4 cuo4"],"word":"下挫"},{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"word":"反弹"},{"definition":["blue chip stock"],"pinyin":["lan2 chou2 gu3"],"word":"蓝筹股"},{"definition":["to shake up\/to jolt\/to vibrate\/to oscillate\/to fluctuate","to vibrate\/to shake\/to shudder"],"pinyin":["zhen4 dang4","zhen4 dang4"],"word":"震荡"},{"definition":["to fall\/to tumble"],"pinyin":["xia4 die1"],"word":"下跌"},{"definition":["(numerical, statistical) index\/(math.) exponent\/index\/exponential (function, growth)"],"pinyin":["zhi3 shu4"],"word":"指数"},{"definition":["tendency\/trend\/path"],"pinyin":["zou3 shi4"],"word":"走势"},{"definition":["(of a stock price or market index) currently higher than at the previous day's close"],"pinyin":["hong2 pan2"],"word":"红盘"},{"definition":["short term"],"pinyin":["duan3 xian4"],"word":"短线"},{"definition":["to fall back\/to return to low level after a rise (in water level, price etc)"],"pinyin":["hui2 luo4"],"word":"回落"},{"definition":["large fall"],"pinyin":["da4 die1"],"word":"大跌"},{"definition":["to fall back (of water level or share prices)"],"pinyin":["hui2 die1"],"word":"回跌"},{"definition":["market price\/quotation of market price\/the current market situation"],"pinyin":["hang2 qing2"],"word":"行情"}]}