{"definition":["to break faith"],"pinyin":["bei4 xin4"],"traditional":["背信"],"rank":44100.0,"normalized_rank":0.6170162159137017,"fraction":2.604240863216869e-7,"cumulative_fraction":0.997795288953186,"word":"背信","characters":[{"definition":["variant of 背[bei1]","the back of a body or object\/to turn one's back\/to hide something from\/to learn by heart\/to recite from memory\/unlucky (slang)\/hard of hearing","to be burdened\/to carry on the back or shoulder"],"pinyin":["bei1","bei4","bei1"],"word":"背"},{"definition":["letter\/mail\/CL:封[feng1]\/to trust\/to believe\/to profess faith in\/truthful\/confidence\/trust\/at will\/at random"],"pinyin":["xin4"],"word":"信"}],"containing_words":[{"definition":["breaking faith and abandoning right (idiom); to betray\/treachery\/perfidy"],"pinyin":["bei4 xin4 qi4 yi4"],"word":"背信弃义"},{"definition":["(bird species of China) Laysan albatross (Phoebastria immutabilis)"],"pinyin":["hei1 bei4 xin4 tian1 weng1"],"word":"黑背信天翁"}],"sentences":[{"english":"Mr Nogaideli claims that the Kremlin is backsliding[5].","chinese":"诺盖杰利声称是克里姆林宫背信弃义的。"},{"english":"America's betrayal of the democratic parties was the main reason for the disbandment of Democratic League.","chinese":"美国对民主党派的背信弃义，是民盟解散的一大原因。"},{"english":"I'm tired of you ratting on me.","chinese":"我厌倦了你对我的背信弃义。"},{"english":"If you break faith and try to take advantage, I'll find someone else to work with.","chinese":"若你背信或相占便宜，我就会找别人。"},{"english":"He is the ultimate symbol of treachery.","chinese":"犹大成为了背信弃义的终极形象。"},{"english":"Mystery, and perhaps treachery, surrounds the couple’s death.","chinese":"缠绕这对情侣的死因的是神秘，也许是背信弃义。"},{"english":"A Seoul court ruled former Samsung Chairman Lee Kun-hee was guilty of breach of trust .","chinese":"三星前董事长李健熙因背信被首尔法庭判定有罪。"},{"english":"Can you think I would be so heartlessly treacherous?","chinese":"难道你认为我会那样残酷地背信弃义？"},{"english":"Crook had resigned his post rather than be party to such treachery.","chinese":"克鲁克已经辞职了，不愿参与这种背信弃义的行为。"},{"english":"Whatever be the reasons for it, we cannot tolerate this disloyalty.","chinese":"无论是何原因，我们都不能容忍这种背信弃义的行为。"},{"english":"As devotion unites lovers, perfidy estranges friends.","chinese":"忠心团结爱人，背信弃义疏离朋友。"},{"english":"V 4 I'm tired of you ratting on me.","chinese":"我厌倦了你对我的背信弃义。"},{"english":"He is an apostate from Christianity.","chinese":"他是一个基督教的背信者。"},{"english":"Are card slaves compulsory victims or voluntary credit abusers?","chinese":"例句卡奴究竟是被迫的受害者抑或自主的背信者？"},{"english":"Marlowe was killed by a man whom he was treacherously trying to stab.","chinese":"马洛背信弃义正想捅死一人，结果被那人所杀。"},{"english":"As devotion unites lovers, so perfidy estranges friends.","chinese":"投入使得爱人更亲密，背信能疏远朋友。"}],"related":[{"definition":["breaking faith and abandoning right (idiom); to betray\/treachery\/perfidy"],"pinyin":["bei4 xin4 qi4 yi4"],"word":"背信弃义"},{"definition":["to go back on one's word\/to break one's promise\/to be unfaithful\/to be untrustworthy"],"pinyin":["yan2 er2 wu2 xin4"],"word":"言而无信"},{"definition":["lit. to grow fat eating one's words (idiom)\/fig. not to live up to one's promises"],"pinyin":["shi2 yan2 er2 fei2"],"word":"食言而肥"},{"definition":["injustice"],"pinyin":["bu4 yi4"],"word":"不义"},{"definition":["old: to reap the consequences of one's words (idiom, from Mencius); modern: to go back on one's word\/to blow hot and cold\/to contradict oneself\/inconsistent"],"pinyin":["chu1 er3 fan3 er3"],"word":"出尔反尔"},{"definition":["to see profit and forget morality (idiom); to act from mercenary considerations\/to sell one's soul for gain"],"pinyin":["jian4 li4 wang4 yi4"],"word":"见利忘义"},{"definition":["to abandon\/to desert\/to renounce"],"pinyin":["bei4 qi4"],"word":"背弃"},{"definition":["to take advantage of sb's precarious position"],"pinyin":["cheng2 ren2 zhi1 wei1"],"word":"乘人之危"},{"definition":["treason"],"pinyin":["pan4 guo2"],"word":"叛国"},{"definition":["to bite the hand that feeds one (idiom)"],"pinyin":["en1 jiang1 chou2 bao4"],"word":"恩将仇报"},{"definition":["to break a promise"],"pinyin":["shi1 xin4"],"word":"失信"},{"definition":["to forget favors and violate justice (idiom); ingratitude to a friend\/to kick a benefactor in the teeth"],"pinyin":["wang4 en1 fu4 yi4"],"word":"忘恩负义"},{"definition":["to neglect\/to misuse\/to mistreat\/to abuse"],"pinyin":["wang3 gu4"],"word":"枉顾"},{"definition":["to act as accomplice to the tiger\/to help a villain do evil (idiom)"],"pinyin":["wei4 hu3 zuo4 chang1"],"word":"为虎作伥"},{"definition":["lit. helping tyrant Zhou 商紂王|商纣王[Shang1 Zhou4 wang2] in his oppression (idiom)\/fig. to take the side of the evildoer\/giving succor to the enemy"],"pinyin":["zhu4 Zhou4 wei2 nu:e4"],"word":"助纣为虐"},{"definition":["lit. to destroy the bridge after crossing the river (idiom)\/fig. to abandon one's benefactor upon achieving one's goal"],"pinyin":["guo4 he2 chai1 qiao2"],"word":"过河拆桥"}]}