{"definition":["rear view\/figure seen from behind\/view of the back (of a person or object)"],"pinyin":["bei4 ying3"],"traditional":["背影"],"rank":14682.0,"normalized_rank":0.20542022861779974,"fraction":0.000004299187088710763,"cumulative_fraction":0.9576900027241044,"word":"背影","characters":[{"definition":["variant of 背[bei1]","the back of a body or object\/to turn one's back\/to hide something from\/to learn by heart\/to recite from memory\/unlucky (slang)\/hard of hearing","to be burdened\/to carry on the back or shoulder"],"pinyin":["bei1","bei4","bei1"],"word":"背"},{"definition":["picture\/image\/film\/movie\/photograph\/reflection\/shadow\/trace"],"pinyin":["ying3"],"word":"影"}],"containing_words":[{"definition":["erhua variant of 背影[bei4 ying3]"],"pinyin":["bei4 ying3 'r"],"word":"背影儿"},{"definition":["(slang) (usu. of a woman) sb who looks stunning from behind\/sb who has a great figure but not necessarily an attractive face\/abbr. to 背殺|背杀[bei4 sha1]"],"pinyin":["bei4 ying3 sha1 shou3"],"word":"背影杀手"}],"sentences":[{"english":"The \"girlfriend startled has stayed, is looking boyfriend's back, felt extremely despairs.\"","chinese":"女友惊呆了，望着男友的背影，感到非常绝望。"},{"english":"He was sitting in front of me and I fell in love with the back of his neck.","chinese":"他就坐在我的前面，我一下子爱上了他脖子的背影。"},{"english":"Ahsoka looked up shortly, her gaze bouncing back from the white armoured back like a thief.","chinese":"阿索卡将视线转回白甲背影，小偷似的瞄了一下。"},{"english":"Looking to flee the you, that person back, just from his back to reality.","chinese":"看着远走的你，那伊人的背影，才从麻木中回到现实。"},{"english":"I can see only their backs, there was a yellow awn.","chinese":"我见到的只是他们的背影，还有那一片黄色的麦芒。"},{"english":"I gaze after teacher, vanishes until she that beautiful back in the dim light of night.","chinese":"我目送老师，直到她那美丽的背影消失在夜色中。"},{"english":"The women in red shirts are with necked-back and dotting in the classical garden.","chinese":"红裙女子，赤裸背影，散落在古典的庭院里。"},{"english":"The figure just like the charming cloud stops the wind from singing.","chinese":"背影，如同一朵迷情的云，让多少风停止歌唱。"},{"english":"Pass silver, laughing seeing by Ya of the service leaves of figure.","chinese":"递上银子，笑着的看着衙役离开的背影。"},{"english":"Against this backdrop, it is highly necessary to enhance exchanges between leaders of the two countries.","chinese":"在这一背影下，加强中缅领导人的相互交往十分必要。"},{"english":"The dynasty figure changes again and again, from the academy of Sung set out through the defense line of the gold.","chinese":"王朝背影频频换，从宋的书院出发经过了金的防线。"},{"english":"In the boundless huge crowd, find the old familiar figure.","chinese":"在茫茫人海中，找着往日熟悉的背影。"},{"english":"You disappeared at that Lane head, I never see you some background.","chinese":"你消失在那个巷头，我再也看不到你的背影。"},{"english":"Yeye posed with the back the Statue of Liberty.","chinese":"和自由女神合影是必不可少的，哪怕是背影呢。"},{"english":"Watching the Trustees'' shadows as they left, Jerusha''s heart once again became filled with visions.","chinese":"望着他们离去的背影，洁茹的心里再一次涌起了幻想。"},{"english":"They got backgrounds. I just got a back.","chinese":"人家有背景，我只有背影。"}],"related":[{"definition":["profile\/silhouette"],"pinyin":["ce4 ying3"],"word":"侧影"},{"definition":["silhouette\/figure"],"pinyin":["shen1 ying3"],"word":"身影"},{"definition":["to follow with one's eyes (a departing guest etc)"],"pinyin":["mu4 song4"],"word":"目送"},{"definition":["expression or emotion showing in one's eyes\/meaningful glance\/wink\/eyesight (dialect)"],"pinyin":["yan3 shen2"],"word":"眼神"},{"definition":["to gaze at\/to stare fixedly at"],"pinyin":["ning2 wang4"],"word":"凝望"},{"definition":["shadow\/reflection\/(fig.) hint\/indication\/influence\/CL:個|个[ge4]"],"pinyin":["ying3 zi5"],"word":"影子"},{"definition":["lonely\/desolate"],"pinyin":["luo4 mo4"],"word":"落寞"},{"definition":["face"],"pinyin":["lian3 pang2"],"word":"脸庞"},{"definition":["appearance\/facial features"],"pinyin":["mian4 rong2"],"word":"面容"},{"definition":["to turn round\/to turn one's head\/later\/by and by"],"pinyin":["hui2 tou2"],"word":"回头"},{"definition":["smile\/smiling expression\/CL:副[fu4]"],"pinyin":["xiao4 rong2"],"word":"笑容"},{"definition":["to gaze at\/to fix one's eyes on"],"pinyin":["ning2 shi4"],"word":"凝视"},{"definition":["beautiful image of a woman"],"pinyin":["qian4 ying3"],"word":"倩影"},{"definition":["a glance\/a quick look\/a glimpse"],"pinyin":["yi1 yan3"],"word":"一眼"},{"definition":["foolish\/stupid\/lost in thought\/in a daze"],"pinyin":["chi1 chi1"],"word":"痴痴"},{"definition":["(of a person) to turn round\/to face about\/(of a widow) to remarry (archaic)"],"pinyin":["zhuan3 shen1"],"word":"转身"}]}