{"definition":["to run in the opposite direction (idiom); to run counter to"],"pinyin":["bei4 dao4 er2 chi2"],"traditional":["背道而馳"],"rank":19061.0,"normalized_rank":0.2666881199893666,"fraction":0.0000026357720306190466,"cumulative_fraction":0.9724768114003224,"word":"背道而驰","characters":[{"definition":["variant of 背[bei1]","the back of a body or object\/to turn one's back\/to hide something from\/to learn by heart\/to recite from memory\/unlucky (slang)\/hard of hearing","to be burdened\/to carry on the back or shoulder"],"pinyin":["bei1","bei4","bei1"],"word":"背"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["to run fast\/to speed\/to gallop\/to disseminate\/to spread"],"pinyin":["chi2"],"word":"驰"}],"containing_words":[],"sentences":[{"english":"That's antithetic al to effective prevention programs.","chinese":"这和有效的防治计划背道而驰。"},{"english":"The problem occurs where theory and reality run orthogonal to one another.","chinese":"该问题发生在理论和实际彼此背道而驰的情况下。"},{"english":"This was contrary to Matsuoka's theme.","chinese":"这是同松冈的主见背道而驰的。"},{"english":"The new Irish constitution was going against the spirit of this approach.","chinese":"新爱尔兰宪法对这一手段的精神背道而驰。"},{"english":"It is counterproductive to our efforts to resume direct negotiations between the parties.","chinese":"这与我们恢复以巴双方直接谈判的努力是背道而驰。"},{"english":"Just because you are pregnant doesn't mean you have to diverge from your vegetarian diet.","chinese":"仅仅因为你怀孕并不意味着你要与素餐背道而驰。"},{"english":"With the new retail runs counter to, and back to the previous supply and marketing cooperatives era.","chinese":"与新零售背道而驰，又回到以前的供销合作社时代。"},{"english":"Thisthinking is totally at odds with those who believe in free accessandthe democratisation of journalism.","chinese":"这与新闻免费接入，新闻业民主化完全背道而驰。"},{"english":"It is true that the products of science have been put sometimes to illiberal uses.","chinese":"科技产品的用途有时也与自由背道而驰。"},{"english":"That's antithetical to effective prevention programs.","chinese":"这和有效的防治计划背道而驰。"},{"english":"They can also run counter-rotation for installation in twins.","chinese":"他们还可以在双胞胎背道而驰安装旋转。"},{"english":"Soapy followed the man with a presentiment that luck would again run against him.","chinese":"索皮跟随着那个人，预感到幸运将再次与他背道而驰。"},{"english":"This goes against our instincts, which have made the conscious mind the arbiter mundi.","chinese":"这与我们的本能背道而驰，让意识沦成为仲裁者。"},{"english":"It's almost the opposite of what is taught in business school.","chinese":"这几乎与商学院所教授内容背道而驰。"}],"related":[{"definition":["to act in a way that defeats one's purpose (idiom)"],"pinyin":["nan2 yuan2 bei3 zhe2"],"word":"南辕北辙"},{"definition":["to go against\/to be contrary to\/to violate"],"pinyin":["wei2 bei4"],"word":"违背"},{"definition":["as different as can be (idiom)\/poles apart"],"pinyin":["da4 xiang1 jing4 ting2"],"word":"大相径庭"},{"definition":["to agree without prior consultation\/to happen to hold the same view"],"pinyin":["bu4 mou2 er2 he2"],"word":"不谋而合"},{"definition":["contrary\/opposite"],"pinyin":["xiang1 bei4"],"word":"相背"},{"definition":["to deviate\/to diverge\/to wander"],"pinyin":["pian1 li2"],"word":"偏离"},{"definition":["original intention"],"pinyin":["chu1 zhong1"],"word":"初衷"},{"definition":["to oppose\/to set sth against\/to be antagonistic to\/antithetical\/relative opposite\/opposing\/diametrical"],"pinyin":["dui4 li4"],"word":"对立"},{"definition":["to depart from\/to deviate from\/deviation"],"pinyin":["bei4 li2"],"word":"背离"},{"definition":["to run in parallel without hindrance\/not mutually exclusive\/two processes can be implemented without conflict"],"pinyin":["bing4 xing2 bu4 bei4"],"word":"并行不悖"},{"definition":["obstinately clinging to one's course (idiom)\/willful\/one's own way\/dogmatic"],"pinyin":["yi1 yi4 gu1 xing2"],"word":"一意孤行"},{"definition":["different routes to the same destination (idiom); fig. different means of achieve the same end"],"pinyin":["shu1 tu2 tong2 gui1"],"word":"殊途同归"},{"definition":["to contradict oneself\/self-contradictory\/inconsistent"],"pinyin":["zi4 xiang1 mao2 dun4"],"word":"自相矛盾"},{"definition":["to abandon\/to discard\/to spurn\/to forsake"],"pinyin":["bing4 qi4"],"word":"摒弃"},{"definition":["to converge"],"pinyin":["qu1 tong2"],"word":"趋同"},{"definition":["inconsistent\/not in agreement with\/not agree or tally with\/not conform to"],"pinyin":["bu4 fu2"],"word":"不符"}]}