{"definition":["qualified\/competent (professionally)\/to be up to a task"],"pinyin":["sheng4 ren4"],"traditional":["勝任"],"rank":11609.0,"normalized_rank":0.16242497166762274,"fraction":0.000006466370937103009,"cumulative_fraction":0.94146423900612,"word":"胜任","characters":[{"definition":["victory\/success\/to beat\/to defeat\/to surpass\/victorious\/superior to\/to get the better of\/better than\/surpassing\/superb (of vista)\/beautiful (scenery)\/wonderful (view)\/(Taiwan pr. [sheng1]) able to bear\/equal to (a task)"],"pinyin":["sheng4"],"word":"胜"},{"definition":["surname Ren\/Ren County 任縣|任县[Ren2 Xian4] in Hebei","to assign\/to appoint\/to take up a post\/office\/responsibility\/to let\/to allow\/to give free rein to\/no matter (how, what etc)\/classifier for terms served in office, or for spouses, girlfriends etc (as in 前任男友)"],"pinyin":["Ren2","ren4"],"word":"任"}],"containing_words":[{"definition":["not to be up to the task (idiom)\/incompetent"],"pinyin":["li4 bu4 sheng4 ren4"],"word":"力不胜任"},{"definition":["competency"],"pinyin":["sheng4 ren4 neng2 li4"],"word":"胜任能力"}],"sentences":[{"english":"I: What experience have you had that qualifies you for this position?","chinese":"你有什么样的经验能使你胜任这个职位？"},{"english":"It was evident that her physical strength could not support her strenuous task.","chinese":"繁重的工作显然使她有些力不胜任。"},{"english":"It works in everything.","chinese":"它可以胜任任何情况。"},{"english":"The second part is the concrete research for the university student class cadre's competence.","chinese":"第二部分是对高校学生班干部胜任力的具体研究。"},{"english":"I am afraid that his attitude to authority unfits him for work on this project.","chinese":"我但心他对当局的态度使他不能胜任这个项目。"},{"english":"I:  What experience have you had that qualifies you for this position?","chinese":"你有什么样的经验能使你胜任这个职位？"},{"english":"A: With my strong academic background, I am capable and competent.","chinese":"依我的良好学术背景，我是胜任愉快的。"},{"english":"I don't feel up to such a long journey.","chinese":"我不能胜任这样的长途旅行。"},{"english":"The instructor has competent knowledge of and experience in this course.","chinese":"教师对课程本身的专业知识与技能颇能胜任。"},{"english":"Chapter iii indicates the establishment of R&D competency model approach and the steps.","chinese":"第三章为建立研发人员胜任特征模型的方法和步骤等。"},{"english":"Do  your business carefully, tust yourself that you can competent for your job.","chinese":"做好你的工作，相信自己能胜任。"},{"english":"I'm honored, but I'm not sure I'm the right person.","chinese":"很荣幸，不过我是否胜任，可没把握。"},{"english":"For testing purposes an multi-core development machine can be sufficient for reasonably small workloads.","chinese":"如果用于测试，那么多核开发机足以胜任小的工作量。"},{"english":"After the accident, he recognized that he was not fit for the work.","chinese":"事故发生后，他认识到不能胜任这项工作。"},{"english":"Secondly, an interviewee must demonstrate his skills for the job.","chinese":"其次，应聘者要证明自己能胜任这份工作。"},{"english":"With my lusty knowledge of computers, I am learned and able.","chinese":"我有深厚的计算机知识，我可以胜任这份工作。"}],"related":[{"definition":["multi-talented person\/versatile person\/all-rounder"],"pinyin":["duo1 mian4 shou3"],"word":"多面手"},{"definition":["to assume personal responsibility (idiom); to take charge of a section"],"pinyin":["du2 dang1 yi1 mian4"],"word":"独当一面"},{"definition":["handling a butcher's cleaver with ease (idiom); to do sth skillfully and easily"],"pinyin":["you2 ren4 you3 yu2"],"word":"游刃有余"},{"definition":["to handle matters with ease (idiom)\/to hold one's own"],"pinyin":["ying4 fu5 zi4 ru2"],"word":"应付自如"},{"definition":["to urge on (of horse)\/to drive\/to steer\/to handle\/to manage\/to master\/to dominate"],"pinyin":["jia4 yu4"],"word":"驾驭"},{"definition":["able to pass muster\/qualified\/apt\/presentable"],"pinyin":["gou4 ge2"],"word":"够格"},{"definition":["to replace\/to take over (a position or post)"],"pinyin":["jie1 ti4"],"word":"接替"},{"definition":["heavy responsibility"],"pinyin":["zhong4 ren4"],"word":"重任"},{"definition":["to take upon oneself\/to assume"],"pinyin":["dan1 dang1"],"word":"担当"},{"definition":["to waste talent"],"pinyin":["qu1 cai2"],"word":"屈才"},{"definition":["choice of person\/candidate"],"pinyin":["ren2 xuan3"],"word":"人选"},{"definition":["qualifications\/experience\/seniority"],"pinyin":["zi1 li4"],"word":"资历"},{"definition":["post\/office\/position"],"pinyin":["zhi2 wei4"],"word":"职位"},{"definition":["lit. an easy drive on a familiar path (idiom); fig. experience makes progress easy\/a task that is so familiar one can do it with one's hand tied behind one's back"],"pinyin":["jia4 qing1 jiu4 shu2"],"word":"驾轻就熟"},{"definition":["to replace"],"pinyin":["ding3 ti4"],"word":"顶替"},{"definition":["lit. what the heart wishes, the hand accomplishes (idiom) skilled at the job\/entirely in one's element\/going smoothly and easily"],"pinyin":["de2 xin1 ying4 shou3"],"word":"得心应手"}]}