{"definition":["odds of success\/stratagem that ensures success\/to be sure of success"],"pinyin":["sheng4 suan4"],"traditional":["勝算"],"rank":19705.0,"normalized_rank":0.2756985155233445,"fraction":0.000002466875916339792,"cumulative_fraction":0.9741206799082008,"word":"胜算","characters":[{"definition":["victory\/success\/to beat\/to defeat\/to surpass\/victorious\/superior to\/to get the better of\/better than\/surpassing\/superb (of vista)\/beautiful (scenery)\/wonderful (view)\/(Taiwan pr. [sheng1]) able to bear\/equal to (a task)"],"pinyin":["sheng4"],"word":"胜"},{"definition":["to regard as\/to figure\/to calculate\/to compute"],"pinyin":["suan4"],"word":"算"}],"containing_words":[{"definition":["to be assured of success"],"pinyin":["wen3 cao1 sheng4 suan4"],"word":"稳操胜算"}],"sentences":[{"english":"Night-before cramming requires playing the odds, and your best bet is on the big stuff.","chinese":"夜前恶补要有胜算，你最好的赌注应该放在重点上。"},{"english":"Coyett was now truly on his own, against impossible odds.","chinese":"揆一这一次真的只有靠自己，毫无胜算。"},{"english":"And while they often have great promise at the beginning of the season, they usually disappoint their loyal fans in the end.","chinese":"就算在球季一开始很有胜算，但最终还是让球迷失望。"},{"english":"The odds, Si Ma Ping Bang says, are stacked against Xinhua.","chinese":"司马平邦认为，新华社的胜算不大。"},{"english":"The odds against this sentence having ever being typed, much less the odds against you reading it were inconceivable.","chinese":"打出这句子的胜算比被这句子你所读是不可理解的。"},{"english":"There are still enough doubts about Obama to allow McCain to win.","chinese":"奥巴马还是有足够的疑问，多到让麦凯恩还有胜算。"},{"english":"Have you ever been in a no win situation?","chinese":"你有没有经历过一种毫无胜算的局面？"},{"english":"Counting on Chinese consumers, however, may not be a sure bet.","chinese":"然而，寄希望于国内消费者也许是个胜算难说的赌局。"},{"english":"We're in a no-win situation.","chinese":"我们正处在一个毫无胜算的情形。"},{"english":"So what are Johnson's odds at JCPenney?","chinese":"那么，约翰逊在JCPenney有多少胜算？"},{"english":"Every part of me is blessed with elegance. A low-level spirit like you has no chance of winning.","chinese":"我的一切受优雅所祝福，像妳这样的低等灵毫无胜算。"},{"english":"And exactly how much share does News Corp hold in the search engine news v. old-guard media battle?","chinese":"新闻集团在新老媒体之争中的胜算几何呢？"},{"english":"I think you have fifty percent of odds-on to reach your destination.","chinese":"我认为，贵司在这个问题上有百分之五十的胜算。"},{"english":"Perhaps you’re in a ‘no win situation’ right now.","chinese":"也许你正处在一个毫无胜算的景况当中。"},{"english":"There are many things you can do to improve your success against bear form.","chinese":"又很多事情可以提高你对熊德德胜算。"}],"related":[{"definition":["to be certain of victory\/to be bound to prevail"],"pinyin":["bi4 sheng4"],"word":"必胜"},{"definition":["to beat comfortably\/to win easily\/abbr. for 穩操勝券|稳操胜券, to have victory within one's grasp"],"pinyin":["wen3 sheng4"],"word":"稳胜"},{"definition":["grasp it and victory is assured\/to have success within one's grasp (idiom)"],"pinyin":["wen3 cao1 sheng4 quan4"],"word":"稳操胜券"},{"definition":["military strength\/military power\/military capability"],"pinyin":["zhan4 li4"],"word":"战力"},{"definition":["to fit one into the other\/to bring two things into contact"],"pinyin":["dui4 shang4"],"word":"对上"},{"definition":["to put one's all into the fight"],"pinyin":["fang4 shou3 yi1 bo2"],"word":"放手一搏"},{"definition":["opponent\/substantial adversary\/worthy match\/antagonist\/in the enemy's hands"],"pinyin":["di2 shou3"],"word":"敌手"},{"definition":["to be assured of success"],"pinyin":["wen3 cao1 sheng4 suan4"],"word":"稳操胜算"},{"definition":["to draw (a competition)\/to fight to a standstill"],"pinyin":["da3 cheng2 ping2 shou3"],"word":"打成平手"},{"definition":["cards in one's hand\/(fig.) undisclosed strength or information\/hidden trump"],"pinyin":["di3 pai2"],"word":"底牌"},{"definition":["to wait at one's ease for the exhausted enemy\/to nurture one's strength and bide one's time (idiom)"],"pinyin":["yi3 yi4 dai4 lao2"],"word":"以逸待劳"},{"definition":["leeway\/latitude\/room for freedom of action"],"pinyin":["hui2 xuan2 yu2 di4"],"word":"回旋余地"},{"definition":["to escape unscathed\/to get through in one piece"],"pinyin":["quan2 shen1 er2 tui4"],"word":"全身而退"},{"definition":["everything bodes ill, no positive signs (idiom); inauspicious\/everything points to disaster"],"pinyin":["xiong1 duo1 ji2 shao3"],"word":"凶多吉少"},{"definition":["margin\/leeway"],"pinyin":["yu2 di4"],"word":"余地"},{"definition":["powerful enemy"],"pinyin":["qiang2 di2"],"word":"强敌"}]}