{"definition":["to blurt out\/to let slip (an indiscreet remark)"],"pinyin":["tuo1 kou3 er2 chu1"],"traditional":["脫口而出"],"rank":20458.0,"normalized_rank":0.28623396247534033,"fraction":0.0000022822142183594474,"cumulative_fraction":0.9759089105085428,"word":"脱口而出","characters":[{"definition":["to shed\/to take off\/to escape\/to get away from"],"pinyin":["tuo1"],"word":"脱"},{"definition":["mouth\/classifier for things with mouths (people, domestic animals, cannons, wells etc)\/classifier for bites or mouthfuls"],"pinyin":["kou3"],"word":"口"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"If you can blurt out 300 sentences, you can make a living in America.","chinese":"脱口而出300句英语，你可以在美国工作。"},{"english":"If we had another name for this meat, people wouldn't even think twice.","chinese":"你若问起这种肉的别名，人们想都不想就会脱口而出。"},{"english":"The whole idea evolved from a casual remark.","chinese":"整个想法是由一句脱口而出的话演变而来的。"},{"english":"Every day I am blurting out more sentences.","chinese":"每一天，我都在脱口而出更多的句子。"},{"english":"Emotional when the mirror will be almost blurted out the true identity of the Ming house.","chinese":"情绪激动之时，明镜险些将明楼的真实身份脱口而出。"},{"english":"Julia blurted out by accident. “I never imagined you being a doctor!”","chinese":"茱莉亚脱口而出，“我还真不知道你还是个医生。”"},{"english":"The world is tired of the death blurting out or muttering again and again.","chinese":"世界厌倦透了脱口而出或再三沉吟的死亡。"},{"english":"HATE liver and cheese, \" blurts the Golden Retriever.\"","chinese":"我恨肝脏和奶酪，“脱口而出的金毛寻回犬。"},{"english":"If you can blurt out 500 sentences, you can be a successful international businessman.","chinese":"脱口而出500句英语，你可以成为成功的国际商人。"},{"english":"I blurted out unthinkingly.","chinese":"我不假思索地脱口而出。"},{"english":"Finally I blurted my name out.","chinese":"最后，我的名字脱口而出。"},{"english":"If you can blurt out 100 sentences, you can survive in America.","chinese":"脱口而出100句英语，你可以在美国生活。"},{"english":"\" he burst out, exasperatedly.\"Do you expect me to drag him back?","chinese":"他怒气冲冲地脱口而出，”你想我把它拖回去？"},{"english":"Can you answer without hesitation?","chinese":"你能不假思索的脱口而出吗？"},{"english":"B： I just practiced blurting out useful sentences every day for one year.","chinese":"我只是用了一年的时间每天练习脱口而出有用的句子。"},{"english":"The excuses pop out of their mouth non-stop.","chinese":"理由总是不断脱口而出。"}],"related":[{"definition":["to blurt out"],"pinyin":["tuo1 kou3"],"word":"脱口"},{"definition":["to blurt out without thinking (idiom)"],"pinyin":["chong1 kou3 er2 chu1"],"word":"冲口而出"},{"definition":["to speak out\/to declare (one's view)"],"pinyin":["shuo1 chu1"],"word":"说出"},{"definition":["to act without taking time to think (idiom); to react instantly\/to fire from the hip"],"pinyin":["bu4 jia3 si1 suo3"],"word":"不假思索"},{"definition":["to ask (a question) in reply\/to answer a question with a question\/rhetorical question"],"pinyin":["fan3 wen4"],"word":"反问"},{"definition":["to be at a loss for words\/speechless"],"pinyin":["yu3 se4"],"word":"语塞"},{"definition":["(speak) without thinking the matter through"],"pinyin":["sui2 kou3"],"word":"随口"},{"definition":["to change one's tune\/to modify one's previous remark\/to change the way one addresses sb (as when one marries and starts to call one's husband's parents 爸爸[ba4 ba5] and 媽媽|妈妈[ma1 ma5])"],"pinyin":["gai3 kou3"],"word":"改口"},{"definition":["to read smoothly (of text)\/to blurt out (without thinking)\/to suit one's taste (of food)"],"pinyin":["shun4 zui3"],"word":"顺嘴"},{"definition":["to open one's mouth (to speak, esp. to make a request)\/to gape"],"pinyin":["zhang1 zui3"],"word":"张嘴"},{"definition":["to read smoothly (of text)\/to blurt out (without thinking)\/to suit one's taste (of food)"],"pinyin":["shun4 kou3"],"word":"顺口"},{"definition":["to lose one's voice\/(to cry out) involuntarily"],"pinyin":["shi1 sheng1"],"word":"失声"},{"definition":["a line of verse\/a sentence"],"pinyin":["yi1 ju4"],"word":"一句"},{"definition":["to open one's mouth (to eat, speak etc)\/to gape\/to start talking (esp. to make a request)"],"pinyin":["zhang1 kou3"],"word":"张口"},{"definition":["to crop up\/to pop up\/to emerge abruptly"],"pinyin":["beng4 chu1 lai5"],"word":"蹦出来"},{"definition":["to utter\/to give voice"],"pinyin":["chu1 sheng1"],"word":"出声"}]}