{"definition":["to break away\/to extricate\/to escape\/to leave the confines of"],"pinyin":["tuo1 chu1"],"traditional":["脫出"],"rank":34725.0,"normalized_rank":0.4858478026667413,"fraction":6.205508917900737e-7,"cumulative_fraction":0.993880305051894,"word":"脱出","characters":[{"definition":["to shed\/to take off\/to escape\/to get away from"],"pinyin":["tuo1"],"word":"脱"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"We need to stop letting our Congress and the President get away withthe crimes their getting away with.","chinese":"不要再让国会和总统逃脱出他们该受到的制裁。"},{"english":"Old pitons should not be reused once they fall out.","chinese":"老旧的岩钉一旦脱出之后，就不得重新加以使用。"},{"english":"He had won his first release from the fences of home.","chinese":"他第一次成功地脱出家庭的樊笼。"},{"english":"Objective To evaluate treatment of the bleeding and prolapse of hemorrhoids by copper ion electrochemistry.","chinese":"目的利用铜离子电化学疗法治疗痔出血及痔脱出。"},{"english":"Sometimes external hemorrhoids prolapse, or anal penetration is now outside.","chinese":"外痔有时会脱出或突现于肛管口外。"},{"english":"I slip my arm out from under his sleep head.","chinese":"我从他沈睡的头颅脱出手臂。"},{"english":"How this can be done depends on the circumstances.","chinese":"如何脱出法，须依情况而定。"},{"english":"They could have escaped right out of a Jane Austen novel.","chinese":"他们可以逃脱出一个简奥斯汀的小说。"},{"english":"The release of infectious nuclear acid from the viral coat is called uncoating.","chinese":"病毒的感染性核酸从外壳中脱出，叫做脱壳。"}],"related":[{"definition":["to withdraw"],"pinyin":["tuo1 kai1"],"word":"脱开"},{"definition":["to separate oneself from\/to break away from\/diastasis (medicine)\/abscission\/abjunction (botany)"],"pinyin":["tuo1 li2"],"word":"脱离"},{"definition":["to throw off\/to struggle free of\/Taiwan pr. [zheng1 tuo1]"],"pinyin":["zheng4 tuo1"],"word":"挣脱"},{"definition":["shackles\/to shackle\/(fig.) restraint\/yoke"],"pinyin":["zhi4 gu4"],"word":"桎梏"},{"definition":["to bind\/to restrict\/to tie\/to commit\/fetters"],"pinyin":["shu4 fu4"],"word":"束缚"},{"definition":["to roll\/to turn over\/to invert\/to flip"],"pinyin":["fan1 zhuan3"],"word":"翻转"},{"definition":["to confine\/to imprison\/prohibition\/shackles\/fetters"],"pinyin":["jin4 gu4"],"word":"禁锢"},{"definition":["to get away from\/to withdraw\/to free oneself"],"pinyin":["chou1 shen1"],"word":"抽身"},{"definition":["to break away from\/to cast off (old ideas etc)\/to get rid of\/to break away (from)\/to break out (of)\/to free oneself from\/to extricate oneself"],"pinyin":["bai3 tuo1"],"word":"摆脱"},{"definition":["to fly out"],"pinyin":["fei1 chu1"],"word":"飞出"},{"definition":["to reverse\/to turn around (an undesirable situation)\/(mechanics) torsion"],"pinyin":["niu3 zhuan3"],"word":"扭转"},{"definition":["to redouble a siege"],"pinyin":["chong2 wei2"],"word":"重围"},{"definition":["to split\/to cut open"],"pinyin":["po4 kai1"],"word":"破开"},{"definition":["to shift\/shift\/translocation\/displacement\/(medicine) dislocation"],"pinyin":["yi2 wei4"],"word":"移位"},{"definition":["to make an about-turn\/to reverse one's direction, policy, sequence etc\/to turn things on their head"],"pinyin":["dao4 zhuan3"],"word":"倒转"},{"definition":["to escape\/to disappear"],"pinyin":["tao2 dun4"],"word":"逃遁"}]}