{"definition":["to reveal one's talent (idiom)\/to rise above others\/to distinguish oneself"],"pinyin":["tuo1 ying3 er2 chu1"],"traditional":["脫穎而出"],"rank":7708.0,"normalized_rank":0.1078449204594742,"fraction":0.00001268881325971973,"cumulative_fraction":0.90619824321727,"word":"脱颖而出","characters":[{"definition":["to shed\/to take off\/to escape\/to get away from"],"pinyin":["tuo1"],"word":"脱"},{"definition":["head of grain\/husk\/tip\/point\/clever\/gifted\/outstanding"],"pinyin":["ying3"],"word":"颖"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"Contract after rent in the countryside la nd circulation practice blooming.","chinese":"反租倒包在农村土地流转的实践中脱颖而出。"},{"english":"Chen was selected from nearly 300 professors in the country.","chinese":"陈炜教授从全美近300名教授中脱颖而出获得此奖。"},{"english":"How can the complexity of today look forward to ad-fan competition does?","chinese":"又如何在今天盼繁复杂的广告竞争中脱颖而出呢？"},{"english":"We make sure your business stays ahead of the competition and leads the pack.","chinese":"我们确保你的业务在竞争中脱颖而出，并独占鳌头。"},{"english":"It’s that liberal license and the site’s mouthwatering photography that really make Nibbledish special.","chinese":"自由许可和令人垂涎的美图使得这个网站脱颖而出。"},{"english":"His brilliance raised him above the ruck .","chinese":"他的才华使他从普通人群中脱颖而出。"},{"english":"Those specifics are what will make your brand stand out from your competition.","chinese":"这些具体的东西才是在竞争中脱颖而出的法宝。"},{"english":"If your CV has these keywords you could be considered.","chinese":"你的简历中有这些关键词，你将会脱颖而出。"},{"english":"A music goes well in the competition, become a propaganda section chief.","chinese":"一乐顺利在竞聘中脱颖而出，成了宣传科长。"},{"english":"The granddaddy of all gaming mice is back by popular demand.","chinese":"这个游戏鼠标的前身从普通需求中脱颖而出。"},{"english":"He'd stand out in any crowd.","chinese":"他会在任何人群中脱颖而出。"},{"english":"On silk and porcelains, phoenix patterns distinguish themselves from others with their unique styles.","chinese":"在丝织品和瓷器上，凤纹更以其独特的风采脱颖而出。"},{"english":"But her admissions essay set her apart from the multitudes of privileged Harvard kids.","chinese":"可是，她的入学作文使她从众多哈佛学子中脱颖而出。"},{"english":"New surface effects and treatments have emerged from the tie-dye trend.","chinese":"新表面效果与处理从扎染潮流中脱颖而出。"},{"english":"Therefore, the nine fort towns were set up to defend the frontier, where some defending talents showed themselves.","chinese":"明设九镇防边，一批戍边干才脱颖而出。"},{"english":"Success comes from standing out, not fitting in.","chinese":"成功来自脱颖而出，而非曲意迎合。"}],"related":[{"definition":["head of grain\/husk\/tip\/point\/clever\/gifted\/outstanding"],"pinyin":["ying3"],"word":"颖"},{"definition":["to tussle\/to contend\/to contest"],"pinyin":["jue2 zhu2"],"word":"角逐"},{"definition":["to force one's way out of encirclement\/to break through"],"pinyin":["sha1 chu1 chong2 wei2"],"word":"杀出重围"},{"definition":["well-known figure\/excellent (person, company etc)"],"pinyin":["jiao3 jiao3 zhe3"],"word":"佼佼者"},{"definition":["to reveal outstanding talent (idiom); to stand out as conspicuously brilliant"],"pinyin":["zhan3 lu4 tou2 jiao3"],"word":"崭露头角"},{"definition":["to compete\/competition"],"pinyin":["jing4 zheng1"],"word":"竞争"},{"definition":["to rise (in society)"],"pinyin":["ji1 shen1"],"word":"跻身"},{"definition":["to come first in triennial palace examinations (idiom, refers to the carved stone turtle head in front of the imperial palace, next to which the most successful candidate in the imperial examinations was entitled to stand)\/to be the champion\/to be the very best in any field"],"pinyin":["du2 zhan4 ao2 tou2"],"word":"独占鳌头"},{"definition":["(acknowledged) place\/a role to play\/niche"],"pinyin":["yi1 xi2 zhi1 di4"],"word":"一席之地"},{"definition":["winning\/superior"],"pinyin":["you1 sheng4"],"word":"优胜"},{"definition":["most outstanding\/par excellence"],"pinyin":["du2 ling3 feng1 sao1"],"word":"独领风骚"},{"definition":["direct, winner-takes-all system of election in use for village committees\/preselection for a competition"],"pinyin":["hai3 xuan3"],"word":"海选"},{"definition":["to amaze the world with a single brilliant feat (idiom); an overnight celebrity"],"pinyin":["yi1 ming2 jing1 ren2"],"word":"一鸣惊人"},{"definition":["outstanding\/excellent"],"pinyin":["you1 xiu4"],"word":"优秀"},{"definition":["to stand out\/outstanding"],"pinyin":["chu1 zhong4"],"word":"出众"},{"definition":["(lit.) to fix one's gaze on\/(fig.) to show interest in\/(favorable) attention\/favor"],"pinyin":["qing1 lai4"],"word":"青睐"}]}