{"definition":["intervertebral disk"],"pinyin":["yao1 zhui1 jian1 pan2"],"traditional":["腰椎間盤"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"腰椎间盘","characters":[{"definition":["waist\/lower back\/pocket\/middle\/loins"],"pinyin":["yao1"],"word":"腰"},{"definition":["a hammer","spine"],"pinyin":["chui2","zhui1"],"word":"椎"},{"definition":["gap\/to separate\/to thin out (seedlings)\/to sow discontent","between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms"],"pinyin":["jian4","jian1"],"word":"间"},{"definition":["plate\/dish\/tray\/board\/hard drive (computing)\/to build\/to coil\/to check\/to examine\/to transfer (property)\/to make over\/classifier for food: dish, helping\/to coil\/classifier for coils of wire\/classifier for games of chess"],"pinyin":["pan2"],"word":"盘"}],"containing_words":[{"definition":["slipped disk\/vertebral herniation\/prolapsed disk"],"pinyin":["yao1 zhui1 jian1 pan2 tu1 chu1"],"word":"腰椎间盘突出"},{"definition":["herniated lumbar disk"],"pinyin":["yao1 zhui1 jian1 pan2 tu1 chu1 zheng4"],"word":"腰椎间盘突出症"}],"sentences":[{"english":"Objective To study the diagnosis and treatment of the intervertebral space infection after lumbar operation.","chinese":"目的探讨腰椎间盘术后椎间隙感染的诊断和治疗。"},{"english":"Results One of important causes is thecervical and lumbar herniated disc.","chinese":"结果发现颈腰椎间盘突出症是本病的重要原因。"},{"english":"Objective:To discuss clinical characteristic and treatment of silent lumbar disc herniation.","chinese":"目的探讨隐匿型腰椎间盘突出症的诊断与治疗。"},{"english":"Objective To investigate the double-interventional therapy of lumbar intervertebral disc herniation (LIDH) in the aged.","chinese":"目的探讨双介入方法对老年腰椎间盘突出症的疗效。"},{"english":"Objective To evaluate the value of far-infrared thermal graphs for the diagnosis of lumbar disc herniation(LDH).","chinese":"目的探讨用远红外热像图诊断腰椎间盘突出症的价值。"},{"english":"Objective To study the diagnosis and treatment of lumbar disc herniation with lumbar instability.","chinese":"目的探讨腰椎间盘突出症合并腰椎不稳的诊断和治疗。"},{"english":"Objective To study the diagnosis and treatment of intervertebral space infection after lumbar operation.","chinese":"目的探讨腰椎间盘术后椎间隙感染的诊断和治疗。"},{"english":"Enough of diagnosing lumbar muscle strain lumbar disc herniation and pathological changes.","chinese":"解晰腰肌劳损及腰椎间盘突出的病因诊断及病理改变。"},{"english":"Objective To explore the CT features of lumbar intervertebral disc degenerations a nd its diagnostic value.","chinese":"目的探讨腰椎间盘退变的CT表现及诊断价值。"},{"english":"Objective To investigate the results of conservative treatments of lumbar disc herniation in communities.","chinese":"目的探讨在社区非手术治疗腰椎间盘突出症的效果。"},{"english":"Objective To analyze the curative effect of conservative treatment for prolapse of lumbar intervertebral disc.","chinese":"目的分析保守疗法治疗腰椎间盘突出症的疗效。"},{"english":"Lumbar disc arthroplasty, however, engenders a separate set of concerns.","chinese":"然而，人们对腰椎间盘成形术产生了一系列的担忧。"},{"english":"Interventional therapy should be the first choice for the treatment of the postoperative lumbar discitis.","chinese":"可作为腰椎间盘炎治疗时优先考虑的方法。"},{"english":"ObjectiveTo study the necessity of treating prolapse of lumbar intervertebral disc by active movement treatment.","chinese":"目的探讨主动运动治疗腰椎间盘突出症的临床疗效。"},{"english":"The Biomechanical Relation ship Between Prolapse of Lumbar Intervertebral Disc and Spondylolisthesis and Operative Treatment.","chinese":"腰椎间盘突出与脊椎滑脱的力学关系和手术选择。"},{"english":"The clinical analysis of vertebral posterior marginal osseous mass-typedisease concomitantprolapse of lumbar intervertebral disc.","chinese":"椎体后缘骨块类疾病伴腰椎间盘突出临床分析。"}],"related":[{"definition":["intervertebral disk"],"pinyin":["zhui1 jian1 pan2"],"word":"椎间盘"},{"definition":["lumbar vertebra (lower backbone)"],"pinyin":["yao1 zhui1"],"word":"腰椎"},{"definition":["slipped disk\/vertebral herniation\/prolapsed disk"],"pinyin":["yao1 zhui1 jian1 pan2 tu1 chu1"],"word":"腰椎间盘突出"},{"definition":["herniated lumbar disk"],"pinyin":["yao1 zhui1 jian1 pan2 tu1 chu1 zheng4"],"word":"腰椎间盘突出症"},{"definition":["cervical vertebra\/the seven cervical vertebrae in the neck of humans and most mammals"],"pinyin":["jing3 zhui1"],"word":"颈椎"},{"definition":["strain (medicine)"],"pinyin":["lao2 sun3"],"word":"劳损"},{"definition":["spinal column\/columna vertebralis"],"pinyin":["ji3 zhu4"],"word":"脊柱"},{"definition":["pelvis\/hip joint"],"pinyin":["kuan1 guan1 jie2"],"word":"髋关节"},{"definition":["thoracic vertebra\/the twelve thoracic vertebras behind the ribcage of humans and most mammals"],"pinyin":["xiong1 zhui1"],"word":"胸椎"},{"definition":["articular capsule (of joint such as knee in anatomy)"],"pinyin":["guan1 jie2 nang2"],"word":"关节囊"},{"definition":["articular facet (anatomy)\/surface in joint"],"pinyin":["guan1 jie2 mian4"],"word":"关节面"},{"definition":["sciatica"],"pinyin":["zuo4 gu3 shen2 jing1 tong4"],"word":"坐骨神经痛"},{"definition":["soft tissue"],"pinyin":["ruan3 zu3 zhi1"],"word":"软组织"},{"definition":["sciatic nerve"],"pinyin":["zuo4 gu3 shen2 jing1"],"word":"坐骨神经"},{"definition":["pelvis\/pelvic"],"pinyin":["kuan1"],"word":"髋"},{"definition":["scoliosis","scoliosis"],"pinyin":["ji3 zhu4 ce4 wan1","ji3 zhui1 ce4 wan1"],"word":"脊椎侧弯"}]}