{"definition":["Tengchong county in Baoshan 保山[Bao3 shan1], Yunnan"],"pinyin":["Teng2 chong1"],"traditional":["騰沖"],"rank":33061.0,"normalized_rank":0.4625662837714941,"fraction":7.185018794144302e-7,"cumulative_fraction":0.9927680439976492,"word":"腾冲","characters":[{"definition":["to soar\/to gallop\/to prance\/to turn over\/to vacate\/to clear"],"pinyin":["teng2"],"word":"腾"},{"definition":["powerful\/vigorous\/pungent\/towards\/in view of","thoroughfare\/to go straight ahead\/to rush\/to clash","(of water) to dash against\/to mix with water\/to infuse\/to rinse\/to flush\/to develop (a film)\/to rise in the air\/to clash\/to collide with"],"pinyin":["chong4","chong1","chong1"],"word":"冲"}],"containing_words":[{"definition":["Tengchong county in Baoshan 保山[Bao3 shan1], Yunnan"],"pinyin":["Teng2 chong1 xian4"],"word":"腾冲县"}],"sentences":[{"english":"The most famous hot spring in Tengchong, quantity, water temperature high, sulfur-rich quality.","chinese":"腾冲的温泉最著名，数量多，水温高，富含硫质。"},{"english":"Britain once set up its consulate in Tengchong in 1899.","chinese":"英国曾于1899年在腾冲设立领事馆。"},{"english":"Gaoligong Museum of Handcraft Paper, Yunnan, China.","chinese":"高黎贡手工造纸博物馆，腾冲，云南。"},{"english":"Tengchong County is in the west of Yunnan Province.","chinese":"腾冲县位于云南省西部。"},{"english":"Tengchong has been conferred the title of \"the First Emerald City in China\" by Asian Federeation of Jewellery.","chinese":"腾冲被亚洲珠宝联合会授予“中国翡翠第一城”称号。"},{"english":"This stress state is consistent with activity nature of earthquake faulting in Tengchong area.","chinese":"这与腾冲地区的地震断层活动性质一致。"},{"english":"In the Tengchong region, there exist two kinds of active geothermal fluids.","chinese":"腾冲地区存在两类地热流体活动。"},{"english":"Korea home and segmented retirement county magistrate zhang asked DE but ShiJiao.","chinese":"韩家与腾冲的退休县长张问德乃是世交。"},{"english":"There is a eruption risk of Tengchong volcano in our country.","chinese":"腾冲火山群是我国目前仍具喷发危险的火山群。"},{"english":"Tengchong has turned itself into a new tourist highlight in Yunnan Province.","chinese":"腾冲已成为云南旅游的新亮点。"},{"english":"So far as the railway project is concerned, it is more advantageous to choose Tengchong route than Ruili route.","chinese":"从铁路线看，选择腾冲线比瑞丽线更为有利。"},{"english":"A forest fire in Myanmar has spread to Tengchong County, Yunnan, Sunday.","chinese":"22日，缅甸森林火灾蔓延到我国云南省腾冲县境内。"},{"english":"Japanese resistance to the north, at Teng-chung, proved especially stubborn.","chinese":"日军在战场北部腾冲的抵抗就特别的顽强。"},{"english":"Tengchong's main points are the Thermal Sea Scenic Area and the Volcano Park Scenic Area.","chinese":"腾冲县最主要的风景区是热海景区和火山公园景区。"}],"related":[{"definition":["Baoshan prefecture-level city in Yunnan"],"pinyin":["Bao3 shan1"],"word":"保山"},{"definition":["Tengchong county in Baoshan 保山[Bao3 shan1], Yunnan"],"pinyin":["Teng2 chong1 xian4"],"word":"腾冲县"},{"definition":["Longling county in Baoshan 保山[Bao3 shan1], Yunnan"],"pinyin":["Long2 ling2"],"word":"龙陵"},{"definition":["Yingjiang county in Dehong Dai and Jingpo autonomous prefecture 德宏傣族景頗族自治州|德宏傣族景颇族自治州[De2 hong2 Dai3 zu2 Jing3 po1 zu2 zi4 zhi4 zhou1], Yunnan"],"pinyin":["Ying2 jiang1"],"word":"盈江"},{"definition":["Shidian county in Baoshan 保山[Bao3 shan1], Yunnan"],"pinyin":["Shi1 dian4"],"word":"施甸"},{"definition":["Dehong prefecture in Yunnan (Dai and Jingpo autonomous prefecture)"],"pinyin":["De2 hong2"],"word":"德宏"},{"definition":["Mengzi county in Honghe Hani and Yi autonomous prefecture, Yunnan"],"pinyin":["Meng2 zi4"],"word":"蒙自"},{"definition":["Xishuangbanna Dai Autonomous Prefecture in southern Yunnan"],"pinyin":["Xi1 shuang1 ban3 na4"],"word":"西双版纳"},{"definition":["Lincang prefecture-level city in Yunnan"],"pinyin":["Lin2 cang1"],"word":"临沧"},{"definition":["Wanding town Dehong Dai and Jingpo autonomous prefecture 德宏傣族景頗族自治州|德宏傣族景颇族自治州, Yunnan, on border with Myanmar (Burma)"],"pinyin":["Wan3 ding1"],"word":"畹町"},{"definition":["Jinghong county level city in Xishuangbanna Dai autonomous prefecture 西雙版納傣族自治州|西双版纳傣族自治州[Xi1 shuang1 ban3 na4 Dai3 zu2 zi4 zhi4 zhou1], Yunnan"],"pinyin":["Jing3 hong2"],"word":"景洪"},{"definition":["Kunming prefecture-level city and capital of Yunnan province in southwest China"],"pinyin":["Kun1 ming2"],"word":"昆明"},{"definition":["Heqing county in Dali Bai autonomous prefecture 大理白族自治州[Da4 li3 Bai2 zu2 zi4 zhi4 zhou1], Yunnan"],"pinyin":["He4 qing4"],"word":"鹤庆"},{"definition":["Dali Bai autonomous prefecture 大理白族自治州 in Yunnan","judicial officer\/justice of the peace (old)"],"pinyin":["Da4 li3","da4 li3"],"word":"大理"},{"definition":["Lijiang prefecture-level city in northwest Yunnan"],"pinyin":["Li4 jiang1"],"word":"丽江"},{"definition":["Nujiang river of south Tibet and northwest Yunnan, the upper reaches of Salween river 薩爾溫江|萨尔温江, forming border of Myanmar and Thailand"],"pinyin":["Nu4 jiang1"],"word":"怒江"}]}