{"definition":["lit. to fly upwards swiftly\/fig. rapid advance\/rapidly developing (situation)"],"pinyin":["teng2 fei1"],"traditional":["騰飛"],"rank":12609.0,"normalized_rank":0.17641626908063185,"fraction":0.000005631232933825896,"cumulative_fraction":0.9474974535965648,"word":"腾飞","characters":[{"definition":["to soar\/to gallop\/to prance\/to turn over\/to vacate\/to clear"],"pinyin":["teng2"],"word":"腾"},{"definition":["to fly"],"pinyin":["fei1"],"word":"飞"}],"containing_words":[],"sentences":[{"english":"The courage to go off is dedicated to each person.","chinese":"腾飞是献给每位勇于进取的人。"},{"english":"Is that a niche that will finally take off this year?","chinese":"这会不会是一个在今年完成腾飞的利基市场？"},{"english":"The Chinese like to compare China to a giant dragon flying over the east of the world.","chinese":"中国人喜欢把中国比喻成”东方腾飞的巨龙”。"},{"english":"That is why suddenly Yuan Tengfei quickly became popular reasons.","chinese":"这就是袁腾飞为什么会突然迅速窜红的原因。"},{"english":"Without such documents a market could not take off.","chinese":"没有这种文件市场是无法腾飞的。"},{"english":"Is fragrant peaches and plums, tomorrow are the pillars of society, to set off the waves.","chinese":"是桃李芬芳，明天是社会的栋梁，要掀起腾飞的巨浪。"},{"english":"Wipe the cream off by softly patting with a tissue.","chinese":"擦拭霜腾飞，由悄悄拍同一个组织。"},{"english":"From which above you may see this is a modern town in China which is equipped already with a good human living environment.","chinese":"这些都为张家窝镇的腾飞提供了良好的人文生活环境。"},{"english":"Japan has been called the lead goose in that V-formation.","chinese":"日本过去被称作这个腾飞的人字型群体中的领头羊。"},{"english":"Singapore's fledgling art scene may finally be taking off.","chinese":"新加坡艺术市场羽翼渐丰，或将迎来腾飞之日。"},{"english":"Reform and opening up a market economy, so that the plug Huifeng to take off.","chinese":"改革开放，市场经济，使惠丰插上了腾飞的翅膀。"},{"english":"Two clay-sculptured dragons spiralling up the columns seem to fly up with the head high.","chinese":"两条盘柱泥塑蟠龙，生动矫健，似欲昂首腾飞。"},{"english":"Science and technology strategy, so that enterprises with today's takeoff .","chinese":"科技兴厂的战略，使企业有了今天的腾飞。"},{"english":"There was a economic blast-off of Southeast Asian countries in the 1970s.","chinese":"七十年代东南亚国家经历了一次经济腾飞。"},{"english":"Teng Fei insists he never had a problem in the first place and does not believe that internet addiction exists.","chinese":"腾飞坚持说自己本来没有问题，并认为自己没有网瘾。"},{"english":"I pen down the spirit of God cool dragon poems are off.","chinese":"吾落神笔精神爽，巨龙腾飞诗篇现。"}],"related":[{"definition":["to leap"],"pinyin":["fei1 yue4"],"word":"飞跃"},{"definition":["to spread one's wings and soar (idiom)\/to develop one's abilities freely"],"pinyin":["zhan3 chi4 gao1 fei1"],"word":"展翅高飞"},{"definition":["lit. the giant Peng bird spreads its wings and begins to fly\/displaying awesome power and momentum at the outset\/to have the world at one's feet"],"pinyin":["kun1 peng2 zhan3 chi4"],"word":"鲲鹏展翅"},{"definition":["to rise abruptly (to a towering position)\/to tower over\/to spring up\/to emerge suddenly\/the emergence (e.g. of a power)"],"pinyin":["jue2 qi3"],"word":"崛起"},{"definition":["major undertaking\/vast plan\/grand prospect"],"pinyin":["hong2 tu2"],"word":"宏图"},{"definition":["to spread wings and fly"],"pinyin":["fen4 fei1"],"word":"奋飞"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"发展"},{"definition":["to expand\/to strengthen"],"pinyin":["zhuang4 da4"],"word":"壮大"},{"definition":["to skyrocket\/to get quick promotion in one's career"],"pinyin":["fu2 yao2 zhi2 shang4"],"word":"扶摇直上"},{"definition":["becoming more prosperous with each passing day"],"pinyin":["zheng1 zheng1 ri4 shang4"],"word":"蒸蒸日上"},{"definition":["vigorous\/flourishing\/full of vitality"],"pinyin":["peng2 bo2"],"word":"蓬勃"},{"definition":["to soar\/to wheel about in the sky"],"pinyin":["ao2 xiang2"],"word":"翱翔"},{"definition":["(aerospace) to boost\/booster (rocket)\/(behavioral economics) to nudge"],"pinyin":["zhu4 tui1"],"word":"助推"},{"definition":["lit. to have accumulated knowledge and deliver it slowly (idiom)\/good preparation is the key to success\/to be well prepared"],"pinyin":["hou4 ji1 bo2 fa1"],"word":"厚积薄发"},{"definition":["(idiom) flourishing\/thriving"],"pinyin":["xin1 xin1 xiang4 rong2"],"word":"欣欣向荣"},{"definition":["lit. contribute bricks and tiles for a building (idiom)\/fig. to do one's bit to help"],"pinyin":["tian1 zhuan1 jia1 wa3"],"word":"添砖加瓦"}]}