{"definition":["to form one's own group or school of thought\/to set up one's own business\/to establish oneself"],"pinyin":["zi4 li4 men2 hu4"],"traditional":["自立門戶"],"rank":36278.0,"normalized_rank":0.5075762875491444,"fraction":5.404091746428729e-7,"cumulative_fraction":0.9947803016446732,"word":"自立门户","characters":[{"definition":["self\/oneself\/from\/since\/naturally\/surely"],"pinyin":["zi4"],"word":"自"},{"definition":["surname Li","to stand\/to set up\/to establish\/to lay down\/to draw up\/at once\/immediately"],"pinyin":["Li4","li4"],"word":"立"},{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["men2","Men2"],"word":"门"},{"definition":["a household\/door\/family"],"pinyin":["hu4"],"word":"户"}],"containing_words":[],"sentences":[{"english":"Remember that God sets us to our (His) tasks, and we dare not presume to arrogate any tasks to ourselves apart from Him.","chinese":"记住是神给我们分配任务，我们怎敢离开神自立门户。"},{"english":"Projects which create forks should be thinking about merging back from the outset.","chinese":"自立门户的项目也应该想着要合并回去。"},{"english":"One of the big assumptions brought into this debate is that forking is a bad thing.","chinese":"这场讨论的一个重大假设是，自立门户是一件坏事。"},{"english":"He encouraged his apprentices to set themselves up in business, and a culture of watchmaking developed.","chinese":"他鼓励他的学徒自立门户，从而发展出制表文化。"},{"english":"Projects which create forks also need to think about their processes.","chinese":"自立门户的项目也需要思考他们的流程。"}],"related":[{"definition":["to live apart from parents (of married couple)\/to achieve independence"],"pinyin":["du2 li4 men2 hu4"],"word":"独立门户"},{"definition":["lit. to set up a separate kitchen (idiom); to start from scratch\/back to square one\/to start of on a new path"],"pinyin":["ling4 qi3 lu2 zao4"],"word":"另起炉灶"},{"definition":["to work on one's own\/to work single-handed\/individual farming"],"pinyin":["dan1 gan4"],"word":"单干"},{"definition":["to seek shelter\/to seek asylum"],"pinyin":["tou2 ben4"],"word":"投奔"},{"definition":["to rely on help from sb"],"pinyin":["tou2 kao4"],"word":"投靠"},{"definition":["to improve one's family's social status by moving up in the world\/to switch one's allegiance to a new patron"],"pinyin":["gai3 huan4 men2 ting2"],"word":"改换门庭"},{"definition":["to get a better job somewhere else (idiom)\/to seek alternative employment"],"pinyin":["ling4 mou2 gao1 jiu4"],"word":"另谋高就"},{"definition":["to exercise sole hegemony (idiom); to dominate a whole area (market, resources etc)\/to hold as one's personal fiefdom"],"pinyin":["du2 ba4 yi1 fang1"],"word":"独霸一方"},{"definition":["to take up sb's mantle\/to follow in sb's steps"],"pinyin":["ji4 cheng2 yi1 bo1"],"word":"继承衣钵"},{"definition":["to have a falling out\/to have a big argument"],"pinyin":["nao4 fan1"],"word":"闹翻"},{"definition":["to lay down a family fortune\/to get rich\/to become prosperous"],"pinyin":["fa1 jia1"],"word":"发家"},{"definition":["to take over\/to take control"],"pinyin":["jie1 zhang3"],"word":"接掌"},{"definition":["to recruit soldiers and buy horses (idiom); to raise a large army\/fig. to expand business\/to recruit new staff"],"pinyin":["zhao1 bing1 mai3 ma3"],"word":"招兵买马"},{"definition":["to separate and live apart\/division of a large family into smaller groups"],"pinyin":["fen1 jia1"],"word":"分家"},{"definition":["to leave home to make one's way in the world\/to leave the life one knows to seek success"],"pinyin":["chuang3 dang4"],"word":"闯荡"},{"definition":["to leave home\/to go off\/to run away"],"pinyin":["chu1 zou3"],"word":"出走"}]}