{"definition":["one who does not fear the death of thousand cuts will dare to unhorse the emperor (proverb)\/to a fearless person, no fence is high enough"],"pinyin":["she3 de5 yi1 shen1 gua3 , gan3 ba3 huang2 di4 la1 xia4 ma3"],"traditional":["捨得一身剮，敢把皇帝拉下馬"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"舍得一身剐，敢把皇帝拉下马","characters":[{"definition":["residence","old variant of 捨|舍[she3]","surname She","to give up\/to abandon\/to give alms"],"pinyin":["she4","she3","She4","she3"],"word":"舍"},{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"},{"definition":["cut off the flesh as punishment"],"pinyin":["gua3"],"word":"剐"},{"word":"，"},{"definition":["to dare\/daring\/(polite) may I venture"],"pinyin":["gan3"],"word":"敢"},{"definition":["handle","to hold\/to contain\/to grasp\/to take hold of\/handle\/particle marking the following noun as a direct object\/classifier for objects with handle\/classifier for small objects: handful"],"pinyin":["ba4","ba3"],"word":"把"},{"definition":["emperor\/old variant of 惶[huang2]","surname Huang"],"pinyin":["huang2","Huang2"],"word":"皇"},{"definition":["emperor"],"pinyin":["di4"],"word":"帝"},{"definition":["to pull\/to play (a bowed instrument)\/to drag\/to draw\/to chat"],"pinyin":["la1"],"word":"拉"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["horse\/CL:匹[pi3]\/horse or cavalry piece in Chinese chess\/knight in Western chess","surname Ma\/abbr. for Malaysia 馬來西亞|马来西亚[Ma3 lai2 xi1 ya4]"],"pinyin":["ma3","Ma3"],"word":"马"}],"containing_words":[],"sentences":[],"related":[{"definition":["Better broken jade than intact tile.\/Death is preferable to dishonor. (idiom)"],"pinyin":["ning4 wei2 yu4 sui4 , bu4 wei2 wa3 quan2"],"word":"宁为玉碎，不为瓦全"},{"definition":["How do you catch the tiger cub without entering the tiger's lair? (idiom); Nothing ventured, nothing gained."],"pinyin":["bu4 ru4 hu3 xue2 , yan1 de2 hu3 zi3"],"word":"不入虎穴，焉得虎子"},{"definition":["no poison, no great man (idiom); A great man has to be ruthless."],"pinyin":["wu2 du2 bu4 zhang4 fu5"],"word":"无毒不丈夫"},{"definition":["not to be crushed (idiom)\/to be determined to have one's revenge"],"pinyin":["bu4 zheng1 man2 tou5 zheng1 kou3 qi4"],"word":"不蒸馒头争口气"},{"definition":["to view death as a return home\/to not be afraid of dying\/to face death with equanimity (idiom)"],"pinyin":["shi4 si3 ru2 gui1"],"word":"视死如归"},{"definition":["to brave it out\/to the bitter end"],"pinyin":["pin1 dao4 di3"],"word":"拼到底"},{"definition":["to stop at nothing (idiom)\/to dare to do anything"],"pinyin":["gan3 zuo4 gan3 wei2"],"word":"敢作敢为"},{"definition":["hot-tempered\/rash\/hot-tempered person"],"pinyin":["er4 gan1 zi5"],"word":"二杆子"},{"definition":["submit to me and prosper, or oppose me and perish"],"pinyin":["shun4 wo3 zhe3 chang1 ni4 wo3 zhe3 wang2"],"word":"顺我者昌逆我者亡"},{"definition":["to give up life for righteousness (idiom, from Mencius); to choose honor over life\/would rather sacrifice one's life than one's principles"],"pinyin":["she3 sheng1 qu3 yi4"],"word":"舍生取义"},{"definition":["to succeed or die trying (idiom)"],"pinyin":["bu4 cheng2 gong1 bian4 cheng2 ren2"],"word":"不成功便成仁"},{"definition":["give me liberty or give me death"],"pinyin":["bu4 zi4 you2 , wu2 ning4 si3"],"word":"不自由，毋宁死"},{"definition":["lit. to break the cauldrons and sink the boats (idiom); fig. to cut off one's means of retreat\/to burn one's boats"],"pinyin":["po4 fu3 chen2 zhou1"],"word":"破釜沉舟"},{"definition":["driven to join the Liangshan Mountain rebels\/to drive to revolt\/to force sb to desperate action"],"pinyin":["bi1 shang4 liang2 shan1"],"word":"逼上梁山"},{"definition":["Only an outstanding talent can recognize current trends (idiom). A wise man submits to circumstances."],"pinyin":["shi2 shi2 wu4 zhe3 wei4 jun4 jie2"],"word":"识时务者为俊杰"},{"definition":["daring to act and courageous enough to take responsibility for it (idiom)\/a true man has the courage to accept the consequences of his actions\/the buck stops here"],"pinyin":["hao3 han4 zuo4 shi4 hao3 han4 dang1"],"word":"好汉做事好汉当"}]}