{"definition":["to neglect the root and pursue the tip (idiom)\/to neglect fundamentals and concentrate on details"],"pinyin":["she3 ben3 zhu2 mo4"],"traditional":["捨本逐末"],"rank":43718.0,"normalized_rank":0.6116715403019322,"fraction":2.703505649482984e-7,"cumulative_fraction":0.9976938936234542,"word":"舍本逐末","characters":[{"definition":["residence","old variant of 捨|舍[she3]","surname She","to give up\/to abandon\/to give alms"],"pinyin":["she4","she3","She4","she3"],"word":"舍"},{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"},{"definition":["to pursue\/to chase\/individually\/one by one"],"pinyin":["zhu2"],"word":"逐"},{"definition":["tip\/end\/final stage\/latter part\/inessential detail\/powder\/dust\/opera role of old man"],"pinyin":["mo4"],"word":"末"}],"containing_words":[],"sentences":[{"english":"It's also likely that the whole thing will be a boondoggle.","chinese":"也有可能整个行动会是一种舍本逐末的做法。"},{"english":"I think that they are not worth the candle.","chinese":"我认为他们是舍本逐末。"},{"english":"Who cares? What was she doing out of the kitchen?!","chinese":"再者，这怎么就是舍本逐末了？"},{"english":"Many people today are trying to put the cart before the horse.","chinese":"今天很多人都在舍本逐末。"}],"related":[{"definition":["lit. to invert root and branch (idiom); fig. confusing cause and effect\/to stress the incidental over the fundamental\/to put the cart before the horse"],"pinyin":["ben3 mo4 dao4 zhi4"],"word":"本末倒置"},{"definition":["lit. climb a tree to catch a fish (idiom); fig. to attempt the impossible"],"pinyin":["yuan2 mu4 qiu2 yu2"],"word":"缘木求鱼"},{"definition":["to let go of the big prize while grabbing at trifles (idiom)"],"pinyin":["jian3 le5 zhi1 ma5 diu1 le5 xi1 gua1"],"word":"捡了芝麻丢了西瓜"},{"definition":["seeking instant benefit (idiom); shortsighted vision, looking only for fast return"],"pinyin":["ji2 gong1 jin4 li4"],"word":"急功近利"},{"definition":["to buy a wooden box and return the pearls inside\/to show poor judgment (idiom)"],"pinyin":["mai3 du2 huan2 zhu1"],"word":"买椟还珠"},{"definition":["blindly\/invariably"],"pinyin":["yi1 wei4"],"word":"一味"},{"definition":["to spoil things through excessive enthusiasm (idiom)"],"pinyin":["ba2 miao2 zhu4 zhang3"],"word":"拔苗助长"},{"definition":["anxious for quick results (idiom); to demand instant success\/impatient for result\/impetuous"],"pinyin":["ji2 yu2 qiu2 cheng2"],"word":"急于求成"},{"definition":["twice the effort for half the result"],"pinyin":["shi4 bei4 gong1 ban4"],"word":"事倍功半"},{"definition":["lit. to want sth in haste, but cannot get there (idiom, from Analects); more haste, less speed\/also written 欲速則不達|欲速则不达"],"pinyin":["yu4 su4 er2 bu4 da2"],"word":"欲速而不达"},{"definition":["to lack foresight"],"pinyin":["duan3 shi4"],"word":"短视"},{"definition":["lit. eyes obscured by a single leaf (idiom)\/fig. not seeing the wider picture\/can't see the wood for the trees"],"pinyin":["yi1 ye4 zhang4 mu4"],"word":"一叶障目"},{"definition":["careless\/any-old-how, regardless of the specific task"],"pinyin":["mei2 mao5 hu2 zi5 yi1 ba3 zhua1"],"word":"眉毛胡子一把抓"},{"definition":["to try to draw a tiger but end up with a likeness of a dog (idiom)\/to try to do sth overambitious and end up botching it"],"pinyin":["hua4 hu3 bu4 cheng2 fan3 lei4 quan3"],"word":"画虎不成反类犬"},{"definition":["to copy the way they walk in Handan (idiom)\/slavishly copying others, one risks becoming a caricature"],"pinyin":["Han2 dan1 xue2 bu4"],"word":"邯郸学步"},{"definition":["lit. to drain the pond to get at the fish (idiom)\/fig. to kill the goose that lays the golden eggs"],"pinyin":["jie2 ze2 er2 yu2"],"word":"竭泽而渔"}]}