{"definition":["to ease (tension)\/to relax\/to cause sth to relax\/to alleviate\/relaxed\/easy and unhurried\/leisurely\/soothing\/mild (slope)"],"pinyin":["shu1 huan3"],"traditional":["舒緩"],"rank":14453.0,"normalized_rank":0.20221622151022065,"fraction":0.000004416991033588343,"cumulative_fraction":0.9566912575219468,"word":"舒缓","characters":[{"definition":["surname Shu","to stretch\/to unfold\/to relax\/leisurely"],"pinyin":["Shu1","shu1"],"word":"舒"},{"definition":["slow\/unhurried\/sluggish\/gradual\/not tense\/relaxed\/to postpone\/to defer\/to stall\/to stave off\/to revive\/to recuperate"],"pinyin":["huan3"],"word":"缓"}],"containing_words":[],"sentences":[{"english":"You need be for balance and contrast, for prayer and inner peace","chinese":"你需我来趋于衡平，寻求对照，潜心祝祷，舒缓内心。"},{"english":"Over there, a man performed the slow-motion dance of tai chi.","chinese":"那边，一个男人在练习动作舒缓的太极。"},{"english":"Before going into the room, take three DEEP breaths!","chinese":"进考场前的深呼吸可以帮你舒缓压力及紧张情绪。"},{"english":"A soothing delicate unscented amber for use on sensitive, dry or irritated complexions . Men love its calming effects after shaving.","chinese":"用于敏感的皮肤，调节肤色，带来惬意的舒缓感觉。"},{"english":"The upward and downward motion of your tongue should be done repeatedly and unhurriedly.","chinese":"温柔舒缓的反复上下活动你的舌头。"},{"english":"It eases dry skin and helps to heal cracked and chapped skin quickly.","chinese":"它能很快的舒缓干燥的皮肤，辅助治疗龟裂的皮肤。"},{"english":"Rub or touch lightly onto skin to soothe and promote healing.","chinese":"揉擦轻触在皮肤表面，来舒缓和促进皮肤的治愈。"},{"english":"The spring water comes out gently and euphoniously.","chinese":"泉水叮咚，弹一曲心中舒缓的歌。"},{"english":"Market fears of bank insolvency, particularly, have been assuaged.","chinese":"市场对银行资不抵债的担忧，尤其得到了舒缓。"},{"english":"Gargling with warm saltwater helps relieve a soar throat, according to WebMD.","chinese":"用温盐水漱口有助于舒缓喉咙痒痛，据中央社报道。"},{"english":"Tones and soothes normal and problem skin.","chinese":"滋润和舒缓正常及问题皮肤。"},{"english":"Peppermint is frequently used to allay nausea and vomiting and will relieve the pain of colic.","chinese":"欧薄荷常被用作缓和反胃和呕吐，亦舒缓绞痛。"},{"english":"In aromatherapy, natural rose oil helps soothing and stabilizing your skin.","chinese":"在芳香疗法中，天然玫瑰油有助于舒缓和镇静肌肤。"},{"english":"When David was invited to King Saul's court, he soothed the king's nerves by playing on his lyre.","chinese":"大卫应邀进入扫罗王的宫廷，弹琴舒缓王的情绪。"},{"english":"Either way hearing your voice can be soothing to the little peanut.","chinese":"不管怎样，能听到你的声音都会让小不点心情舒缓。"},{"english":"Some people like listening to soothing music.","chinese":"有人喜欢听一些舒缓的音乐。"}],"related":[{"definition":["to calm\/to appease\/to quieten"],"pinyin":["ping2 fu3"],"word":"平抚"},{"definition":["to stretch taut\/(of muscles etc) taut\/strained\/tense"],"pinyin":["jin3 beng1"],"word":"紧绷"},{"definition":["to loosen\/to relax"],"pinyin":["fang4 song1"],"word":"放松"},{"definition":["soft\/gentle\/pliable"],"pinyin":["qing1 rou2"],"word":"轻柔"},{"definition":["mild\/gentle\/to ease up\/to relax"],"pinyin":["he2 huan3"],"word":"和缓"},{"definition":["calm\/cool"],"pinyin":["zhen4 jing4"],"word":"镇静"},{"definition":["to pacify\/to calm down\/to be cured\/to be healed"],"pinyin":["ping2 fu4"],"word":"平复"},{"definition":["to roll out\/to extend\/to smooth out\/to unfold"],"pinyin":["shu1 zhan3"],"word":"舒展"},{"definition":["level\/almost flat\/not strongly sloping\/fig. moderate\/mild-mannered\/gentle"],"pinyin":["ping2 huan3"],"word":"平缓"},{"definition":["to bring relief\/to alleviate (a crisis)\/to dull (a pain)"],"pinyin":["huan3 jie3"],"word":"缓解"},{"definition":["to console\/to comfort\/to soothe"],"pinyin":["fu3 wei4"],"word":"抚慰"},{"definition":["gentle\/soft"],"pinyin":["rou2 he2"],"word":"柔和"},{"definition":["massage\/to massage"],"pinyin":["an4 mo2"],"word":"按摩"},{"definition":["joyful\/cheerful\/delighted\/joy\/delight"],"pinyin":["yu2 yue4"],"word":"愉悦"},{"definition":["moist\/humid\/to moisten\/to provide moisture\/comfortably off"],"pinyin":["zi1 run4"],"word":"滋润"},{"definition":["light and quick\/brisk\/spry\/lively\/effortless\/relaxed\/agile\/blithe"],"pinyin":["qing1 kuai4"],"word":"轻快"}]}