{"definition":["to gain\/to get\/to acquire"],"pinyin":["huo4 qu3"],"traditional":["獲取"],"rank":3559.0,"normalized_rank":0.04979502749289941,"fraction":0.00003869093206687453,"cumulative_fraction":0.8148752182158029,"word":"获取","characters":[{"definition":["to catch\/to obtain\/to capture","to reap\/to harvest"],"pinyin":["huo4","huo4"],"word":"获"},{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"}],"containing_words":[],"sentences":[{"english":"What we would really like to do is get the image descriptor from the image registry.","chinese":"我们真正想做的是从图像注册表获取图像描述符。"},{"english":"Make a self-development plan to acquire the skills and experiences you need.","chinese":"制定一个获取技能和经验的自我提升计划。"},{"english":"CTD Profiling System is the principal instrument for acquiring hydrographic data in situ.","chinese":"CTD剖面仪是现场获取水文数据的主要仪器。"},{"english":"Yes, the messages were obtained illegally.","chinese":"是的，这些信息是通过非法手段获取的。"},{"english":"An algorithm fOr producing minimum spanning trees of undirected networks is provided.","chinese":"本文提出一个获取连通网络是小生成树的算法。"},{"english":"Reading informational texts for pleasure or to learn new information.","chinese":"以获得乐趣或获取信息为目地阅读说明文。"},{"english":"How, then, did Mr Slim make his fortune?","chinese":"那么斯利姆是如何获取财富的？"},{"english":"The outcome is decisions that feed the acquisition process, or reassignment of resources.","chinese":"结果是依靠获取过程或者是资源的再分配的决定。"},{"english":"A honey character, from lees contact, gives the wine depth.","chinese":"酒渣沉淀后获取的蜜汁，赋予了其丰富的酒体。"},{"english":"The information acquisition technique of intersected primitive based on combined relationship is provided.","chinese":"提出了基于形体组合关系的相交基元体信息获取技术。"},{"english":"Get to download the latest version of files that you do not have in your local workspace.","chinese":"“获取”，下载本地工作区中没有的文件的最新版本。"},{"english":"And this is the value currently obtained.","chinese":"而这是现在获取的总价值。"},{"english":"Reading is an important way to acquire knowledge as well as a basic of intelligence skill.","chinese":"阅读是获取知识的重要途径，也是基本的智力技能。"},{"english":"As the report states, \"Among these were five solo divers who could not get help.\"","chinese":"根据报告陈述，其中有5个独自潜水者无法获取帮助。"},{"english":"Please see the user's manual for a more thorough explanation.","chinese":"请看用户使用手册来获取更多信息。"},{"english":"Can a project remain at variance after a harvest or propagation?","chinese":"项目在获取或者传播之后是否能够保持差异性？"}],"related":[{"definition":["to transmit\/to dispatch\/to issue (an official document or credential)"],"pinyin":["fa1 song4"],"word":"发送"},{"definition":["information\/news\/message"],"pinyin":["xin4 xi1"],"word":"信息"},{"definition":["to learn of (an event)\/to hear about (sth)"],"pinyin":["huo4 zhi1"],"word":"获知"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通过"},{"definition":["strategy\/tactics\/crafty\/adroit"],"pinyin":["ce4 lu:e4"],"word":"策略"},{"definition":["to obtain\/to receive\/to get"],"pinyin":["huo4 de2"],"word":"获得"},{"definition":["to receive\/to draw\/to get"],"pinyin":["ling3 qu3"],"word":"领取"},{"definition":["to offer\/to supply\/to provide\/to furnish"],"pinyin":["ti2 gong1"],"word":"提供"},{"definition":["to search (a place)\/to search (a database etc)"],"pinyin":["sou1 suo3"],"word":"搜索"},{"definition":["to consult\/to refer to\/to look sth up in a reference source"],"pinyin":["cha2 yue4"],"word":"查阅"},{"definition":["to grasp (often fig.)\/to control\/to seize (initiative, opportunity, destiny)\/to master\/to know well\/to understand sth well and know how to use it\/fluency"],"pinyin":["zhang3 wo4"],"word":"掌握"},{"definition":["to check\/to inquire\/to consult (a document etc)\/inquiry\/query"],"pinyin":["cha2 xun2"],"word":"查询"},{"definition":["huge volume"],"pinyin":["hai3 liang4"],"word":"海量"},{"definition":["equivalent to 就可以\/can then (do sth)\/can immediately (do sth)\/(do sth) and that will suffice"],"pinyin":["ji2 ke3"],"word":"即可"},{"definition":["to import\/to input"],"pinyin":["shu1 ru4"],"word":"输入"},{"definition":["to extract\/to remove\/to draw (a sales commission, venom from a snake etc)"],"pinyin":["chou1 qu3"],"word":"抽取"}]}