{"definition":["to throw stones at sb who fell down a well (idiom); to hit a person who is down"],"pinyin":["luo4 jing3 xia4 shi2"],"traditional":["落井下石"],"rank":37252.0,"normalized_rank":0.5212038112294153,"fraction":4.950101326888121e-7,"cumulative_fraction":0.9952839450401926,"word":"落井下石","characters":[{"definition":["to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","colloquial reading for 落[luo4] in certain compounds","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["luo4","lao4","la4"],"word":"落"},{"definition":["Jing, one of the 28 constellations of Chinese astronomy\/surname Jing","a well\/CL:口[kou3]\/neat\/orderly"],"pinyin":["Jing3","jing3"],"word":"井"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["dry measure for grain equal to ten dou 斗\/ten pecks\/one hundred liters","surname Shi","rock\/stone\/stone inscription\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["dan4","Shi2","shi2"],"word":"石"}],"containing_words":[],"sentences":[{"english":"Let me help you with…","chinese":"让我助你落井下石。"},{"english":"Are Chinese reporters really so eager to flog their British peers?","chinese":"中国传媒真的这么渴望对他们的英国同行落井下石吗？"},{"english":"On the right, that gangsters and anti-social elements are taking advantage of tragedy.","chinese":"右翼则认为，抢匪和反社会分子乘此机会落井下石。"},{"english":"Las Vegas handicapped the underdogs by a large margin.","chinese":"拉斯维加斯对失败者落井下石。"},{"english":"To demand money from a person who has just lost his job is hitting a man who is down.","chinese":"向一个刚刚失业的人讨债等于落井下石。"}],"related":[{"definition":["lit. to destroy the bridge after crossing the river (idiom)\/fig. to abandon one's benefactor upon achieving one's goal"],"pinyin":["guo4 he2 chai1 qiao2"],"word":"过河拆桥"},{"definition":["to loot a burning house\/to profit from sb's misfortune (idiom)"],"pinyin":["chen4 huo3 da3 jie2"],"word":"趁火打劫"},{"definition":["to forget favors and violate justice (idiom); ingratitude to a friend\/to kick a benefactor in the teeth"],"pinyin":["wang4 en1 fu4 yi4"],"word":"忘恩负义"},{"definition":["to bite the hand that feeds one (idiom)"],"pinyin":["en1 jiang1 chou2 bao4"],"word":"恩将仇报"},{"definition":["to make a false countercharge"],"pinyin":["fan3 yao3 yi1 kou3"],"word":"反咬一口"},{"definition":["harboring unfathomable motives (idiom)"],"pinyin":["ju1 xin1 po3 ce4"],"word":"居心叵测"},{"definition":["lit. to kill the donkey when the grinding is done (idiom)\/to get rid of sb once he has ceased to be useful"],"pinyin":["xie4 mo4 sha1 lu:2"],"word":"卸磨杀驴"},{"definition":["lit. to strike with a muckrake (idiom), cf Pigsy 豬八戒|猪八戒 in Journey to the West 西遊記|西游记; fig. to counterattack\/to make bogus accusations (against one's victim)"],"pinyin":["dao4 da3 yi1 pa2"],"word":"倒打一耙"},{"definition":["to sow dissension (idiom); to drive a wedge between"],"pinyin":["tiao3 bo1 li2 jian4"],"word":"挑拨离间"},{"definition":["to entrap\/to set up\/to frame (up)\/to make false charges against"],"pinyin":["xian4 hai4"],"word":"陷害"},{"definition":["breaking faith and abandoning right (idiom); to betray\/treachery\/perfidy"],"pinyin":["bei4 xin4 qi4 yi4"],"word":"背信弃义"},{"definition":["frigid irony and scorching satire (idiom); to mock and ridicule"],"pinyin":["leng3 chao2 re4 feng3"],"word":"冷嘲热讽"},{"definition":["to watch with folded arms (idiom); to look on without lifting a finger"],"pinyin":["xiu4 shou3 pang2 guan1"],"word":"袖手旁观"},{"definition":["two-faced, three knives (idiom); double-cross\/double dealing and back stabbing"],"pinyin":["liang3 mian4 san1 dao1"],"word":"两面三刀"},{"definition":["to speak out for justice (idiom); to take a stand on a matter of principle"],"pinyin":["zhang4 yi4 zhi2 yan2"],"word":"仗义执言"},{"definition":["lit. see the wind and set the helm (idiom); fig. to act pragmatically\/to be flexible and take advantage of the situation"],"pinyin":["jian4 feng1 shi3 duo4"],"word":"见风使舵"}]}