{"definition":["to fall into"],"pinyin":["luo4 ru4"],"traditional":["落入"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"落入","characters":[{"definition":["to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","colloquial reading for 落[luo4] in certain compounds","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["luo4","lao4","la4"],"word":"落"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"}],"containing_words":[{"definition":["to fall into the net of justice (idiom); finally arrested"],"pinyin":["luo4 ru4 fa3 wang3"],"word":"落入法网"}],"sentences":[{"english":"At the mean time, the vulture went by. The potion was polluted by the unexpectedly fallen hair.","chinese":"同时，秃鹰正巧经过，秃鹰的头发无意间落入魔药内。"},{"english":"The Moon's sunlit crescent is sinking into the colorful twilight glow just left of Mercury.","chinese":"新月形的月亮正在落入水星左侧的彩色晨曦之中。"},{"english":"Som boon leelathitikul slowly fall into the trap.","chinese":"李大山慢慢落入了圈套。"},{"english":"This eclipse falls on a fixed star Alhena, and that indicates some difficulty in travel.","chinese":"月食落入双子座意味着旅行中遭遇的困难。"},{"english":"Here the socket of the candle dropped, and the wick went out.","chinese":"这时残烛落入了烛台孔中，烛芯熄灭了。"},{"english":"But they're often falling into the hands of unscrupulous labor brokers.","chinese":"但他们往往落入黑心的劳工中介手中。"},{"english":"Clear under the dust fall into the ash bucket from the body by the ash discharge system.","chinese":"清下粉尘落入灰斗，经排灰系统排出机体。"},{"english":"Whether a planet is in good or bad state, it will realize the affairs of the house.","chinese":"行星态势的好坏，会影响到其落入宫位所代表的领域。"},{"english":"They drop into the background, and that quiets the mind.","chinese":"它们落入背景中，这样就能让头脑安静。"},{"english":"Xia was betrayed and fell into enemy hands.","chinese":"阿霞被出卖，落入敌人手中。"},{"english":"Ideally, we should have one planet in every sign, and in the RIGHT sign as well.","chinese":"从理想上来说，每个行星都该落入一个合适的宫位。"},{"english":"False bottoms and bear market rallies have trapped investors since time immemorial .","chinese":"投资者落入谷底假象和熊市止跌回升的陷阱久已有之。"},{"english":"Into a bottomless vale I fall - O, I give myself away…","chinese":"落入一个无底的山谷，噢，我放弃了生命。"},{"english":"Hydrates are formed as the condensate and water fall to the lower liquid section.","chinese":"在凝析液和水落入分离器下部液体段时形成水合物。"},{"english":"From now on Wei Force the military authority political power will fall in the Sima hand. (A.","chinese":"自此曹魏军权政权落入司马氏手中。"},{"english":"The earth would give a long sigh before sliding into darkness.","chinese":"地球在落入夜幕之前，会长长地叹一口气。"}],"related":[{"definition":["to drop into\/to fall into"],"pinyin":["zhui4 ru4"],"word":"坠入"},{"definition":["to fall\/to drop"],"pinyin":["die1 luo4"],"word":"跌落"},{"definition":["to fall\/to drop"],"pinyin":["zhui4 luo4"],"word":"坠落"},{"definition":["to surrender (of a fortress)\/to fall (to the enemy)\/subsidence (of land)"],"pinyin":["xian4 luo4"],"word":"陷落"},{"definition":["to snatch away"],"pinyin":["duo2 zou3"],"word":"夺走"},{"definition":["to fly out"],"pinyin":["fei1 chu1"],"word":"飞出"},{"definition":["to go up in smoke\/to vanish"],"pinyin":["hua4 wei2 wu1 you3"],"word":"化为乌有"},{"definition":["to fall into enemy hands\/to be occupied\/to degenerate\/to submerge"],"pinyin":["lun2 xian4"],"word":"沦陷"},{"definition":["to run away\/to escape"],"pinyin":["tao2 tuo1"],"word":"逃脱"},{"definition":["to bury a corpse\/to be buried\/(fig.) to die (at sea, in a fire etc)"],"pinyin":["zang4 shen1"],"word":"葬身"},{"definition":["to pull into\/to draw in"],"pinyin":["la1 ru4"],"word":"拉入"},{"definition":["to be drawn into\/to be involved in"],"pinyin":["juan3 ru4"],"word":"卷入"},{"definition":["to sink into\/to get caught up in\/to land in (a predicament)"],"pinyin":["xian4 ru4"],"word":"陷入"},{"definition":["to lose one's life"],"pinyin":["sang4 ming4"],"word":"丧命"},{"definition":["to die\/to perish"],"pinyin":["yun3 ming4"],"word":"殒命"},{"definition":["to fail to achieve something\/to be fruitless","to fail\/to fall through\/to come to nothing","to omit\/to neglect"],"pinyin":["lao4 kong1","luo4 kong1","luo4 kong4"],"word":"落空"}]}