{"definition":["to stay for a time\/to stop over\/to lodge\/to sink down (into soft ground)\/leftovers"],"pinyin":["luo4 jiao3"],"traditional":["落腳"],"rank":21456.0,"normalized_rank":0.3001972772935234,"fraction":0.000002065875375350064,"cumulative_fraction":0.9780721925209472,"word":"落脚","characters":[{"definition":["to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","colloquial reading for 落[luo4] in certain compounds","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["luo4","lao4","la4"],"word":"落"},{"definition":["foot\/leg (of an animal or an object)\/base (of an object)\/CL:雙|双[shuang1],隻|只[zhi1]\/classifier for kicks","variant of 角[jue2]\/role"],"pinyin":["jiao3","jue2"],"word":"脚"}],"containing_words":[],"sentences":[{"english":"I have got on this light-speed train to explore my destination.","chinese":"我已踏上这辆超光速列车，去探索我的落脚点。"},{"english":"Chapter four is the end-result and focal point of this thesis.","chinese":"第四章是本文的落脚点，也是重点。"},{"english":"I find the whole slant of this article pejorative and misleading.","chinese":"我发现，文章的落脚点是偏激的且具有误导性的。"},{"english":"Butterfly disappearance of the day, if there is a settled, I would like to hide.","chinese":"蝴蝶消失的那天，如果有一个落脚处，我想隐藏起来。"},{"english":"The owner of \"New Store\" Stationery Store came to Hengshan Township from other county.","chinese":"新店文具印刷行的老板是从外地到横山乡落脚。"},{"english":"At what unknown Keya-forest-wharf will they anchor?","chinese":"会到哪个无名的柯亚森林码头落脚？"},{"english":"When a story is Done, it needs a home.","chinese":"当一个故事“完成”后，它需要有一个落脚之处。"},{"english":"Stayin' in a big hotel.","chinese":"他落脚在一家大旅馆内。"},{"english":"Automatic Block and Footing keys for material estimates .","chinese":"自动闭塞和落脚点钥匙材料估计。"},{"english":"Student is the starting point and end-result of campus culture construction of independent colleges.","chinese":"独立学院校园文化建设的出发点和落脚点是学生。"},{"english":"Among those nations you will find no repose, no resting place for the sole of your foot.","chinese":"在那些国中，你必不得安逸，也不得落脚之地。"},{"english":"The stone village have become all footing.","chinese":"石头村成了众人落脚的地方。"},{"english":"Both return to the boat because they can't find a place to land.","chinese":"它们都飞回了穿上，因为它们找不到落脚之处。"},{"english":"Flamingos use this particular wetland as a resting place during their migration south in the winter Photograph: Evangelos Bougiotis\/EPA","chinese":"它们将此独特的湿地当成一个南迁越冬的临时落脚地。"},{"english":"There are many stationery shops and publishing house business department here.","chinese":"许多文具店和出版社商业部门也在这里落脚。"},{"english":"Thus specifically in China, those evolve to the construction and perfection of credit institution .","chinese":"落脚到中国，就演变成中国的信用制度的构建与完善。"}],"related":[{"definition":["to stay at\/to live in (temporarily)"],"pinyin":["qi1 shen1"],"word":"栖身"},{"definition":["to make one's home\/to take shelter"],"pinyin":["an1 shen1"],"word":"安身"},{"definition":["to stop on the way for a rest"],"pinyin":["xie1 jiao3"],"word":"歇脚"},{"definition":["to hide\/to go into hiding\/to take refuge"],"pinyin":["cang2 shen1"],"word":"藏身"},{"definition":["to settle down\/to set up a home"],"pinyin":["an1 jia1"],"word":"安家"},{"definition":["to find a place where one can fit in\/to make one's home\/to seek shelter"],"pinyin":["rong2 shen1"],"word":"容身"},{"definition":["residence\/dwelling\/dwelling place"],"pinyin":["zhu4 chu4"],"word":"住处"},{"definition":["hiding place\/hideout"],"pinyin":["cang2 shen1 zhi1 chu4"],"word":"藏身之处"},{"definition":["to settle (in some city, country etc)\/to take up residence"],"pinyin":["ding4 ju1"],"word":"定居"},{"definition":["remote\/desolate\/far from the city"],"pinyin":["pian1 pi4"],"word":"偏僻"},{"definition":["to conceal oneself\/to go into hiding\/to take cover"],"pinyin":["duo3 cang2"],"word":"躲藏"},{"definition":["here\/this place"],"pinyin":["ci3 di4"],"word":"此地"},{"definition":["to lodge\/to stay (for the night)"],"pinyin":["tou2 su4"],"word":"投宿"},{"definition":["to find a place for\/to help settle down\/to arrange for\/undisturbed\/peaceful"],"pinyin":["an1 dun4"],"word":"安顿"},{"definition":["lonely\/secluded"],"pinyin":["pi4 jing4"],"word":"僻静"},{"definition":["to lodge"],"pinyin":["jie4 zhu4"],"word":"借住"}]}