{"definition":["to fail to be chosen (or elected)\/to lose an election"],"pinyin":["luo4 xuan3"],"traditional":["落選"],"rank":14422.0,"normalized_rank":0.20178249129041734,"fraction":0.0000044340704159311895,"cumulative_fraction":0.9565540588435868,"word":"落选","characters":[{"definition":["to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","colloquial reading for 落[luo4] in certain compounds","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["luo4","lao4","la4"],"word":"落"},{"definition":["to choose\/to pick\/to select\/to elect"],"pinyin":["xuan3"],"word":"选"}],"containing_words":[],"sentences":[{"english":"He himself is a perennial Nobel also-ran.","chinese":"他自己就长年是诺贝尔和平奖落选者。"},{"english":"They qualified for the qualifying tourney by their finish in last year's regional tournaments.","chinese":"他们通过去年的地区选拔赛获得了落选锦标赛的资格。"},{"english":"Chen Zhonghe, mostly favored, was elected out unexpectedly and lost the election for another term.","chinese":"呼声最高的陈忠和意外落选，失去了连任的机会。"},{"english":"People can argue about why Mayor Fenty lost after one term.","chinese":"人们对芬蒂在一届任期后便落选可能会有所争议。"},{"english":"She ran as a pro-choice Republican and lost narrowly.","chinese":"她以亲共和党的身份参选，以微弱差距落选。"},{"english":"Jermaine Pennant has revealed his disappointment after being overlooked for England once again.","chinese":"再次落选英格兰队，彭南特难以掩饰失望之情。"},{"english":"I bet her ￡200 that she would lose the vote.","chinese":"我拿200英镑和她打赌，说她在选举中肯定落选。"},{"english":"The Company will dispose personal data of all unsuccessful applicants.","chinese":"所有落选者之个人资料将被本公司弃除。"},{"english":"At the second year's examination, he was not classed at all.","chinese":"他在第二年的考试中落选了，不能被编班。"},{"english":"More than half will end up losers on election night.","chinese":"而超过一半将会在竞选之夜落选。"},{"english":"Troops to school recruiting, fine sister, lily but was rejected.","chinese":"部队来学校招兵，细妹入选，莉莉却落选。"},{"english":"He has already lost two general elections and his party, unsurprisingly, seethes with barely contained rebellion.","chinese":"他已经两度落选，人民党也无疑叛念中烧。"}],"related":[{"definition":["to fail the imperial exams\/to flunk"],"pinyin":["luo4 bang3"],"word":"落榜"},{"definition":["to get past the qualifying round\/to make it to the finals"],"pinyin":["ru4 wei2"],"word":"入围"},{"definition":["lit. to fall behind Sun Shan 孫山|孙山[Sun1 Shan1] (who came last in the imperial examination) (idiom)\/fig. to fail an exam\/to fall behind (in a competition)"],"pinyin":["ming2 luo4 Sun1 Shan1"],"word":"名落孙山"},{"definition":["to be a candidate in an election or other selection process\/to run for office\/to turn out to vote"],"pinyin":["can1 xuan3"],"word":"参选"},{"definition":["to have no opportunity\/no way (of doing sth)\/no chance\/no connection\/not placed (in a competition)\/(in pop lyrics) no chance of love, no place to be together etc"],"pinyin":["wu2 yuan2"],"word":"无缘"},{"definition":["to suffer a defeat\/to fail\/to fall behind"],"pinyin":["luo4 bai4"],"word":"落败"},{"definition":["candidate (attributive)"],"pinyin":["hou4 xuan3"],"word":"候选"},{"definition":["list of names"],"pinyin":["ming2 dan1"],"word":"名单"},{"definition":["to be chosen\/to be elected as"],"pinyin":["ru4 xuan3"],"word":"入选"},{"definition":["primary election"],"pinyin":["chu1 xuan3"],"word":"初选"},{"definition":["to be elected\/to be selected"],"pinyin":["dang1 xuan3"],"word":"当选"},{"definition":["to nominate"],"pinyin":["ti2 ming2"],"word":"提名"},{"definition":["to win a prize"],"pinyin":["de2 jiang3"],"word":"得奖"},{"definition":["candidate\/CL:名[ming2]"],"pinyin":["hou4 xuan3 ren2"],"word":"候选人"},{"definition":["to lose\/to suffer defeat"],"pinyin":["shi1 li4"],"word":"失利"},{"definition":["(literary) to be routed (in a war)\/to suffer defeat (in sports etc)"],"pinyin":["bai4 bei3"],"word":"败北"}]}