{"definition":["Chinese yam (Dioscorea polystachya)"],"pinyin":["shu3 yu4"],"traditional":["薯蕷"],"rank":63241.0,"normalized_rank":0.884823639696109,"fraction":2.350239792477108e-8,"cumulative_fraction":0.9999190267943,"word":"薯蓣","characters":[{"definition":["variant of 薯[shu3]","potato\/yam"],"pinyin":["shu3","shu3"],"word":"薯"},{"definition":["see 薯蕷|薯蓣[shu3 yu4]"],"pinyin":["yu4"],"word":"蓣"}],"containing_words":[],"sentences":[{"english":"Objective To determine diosgenin content in Jingangteng soft capsule by RP-HPLC.","chinese":"目的建立金刚藤软胶囊中薯蓣皂苷元的含量测定方法。"},{"english":"Objective To study water-soluble constituents of Dioscorea zingiberensis in order to seek active components.","chinese":"目的研究盾叶薯蓣的水溶性化学成分，寻找活性物质。"},{"english":"Objective To study the therapeutic effects of methyl protodioscin on myocardial infarction in rats.","chinese":"目的研究薯蓣皂苷元对大鼠急性心肌缺血的治疗作用。"},{"english":"A study on numerical taxonomy of Dioscoreaceae plants in Zhejiang Province.","chinese":"浙江省薯蓣科植物的数量分类研究。"},{"english":"Tropical american yam with small yellow-skinned edible tubers .","chinese":"热带美洲薯蓣科植物，有黄皮的可食块茎。"},{"english":"In botany, Barbasco (Lonchocarpus urucu) is part of the Fabaceae (or Leguminosae) family.","chinese":"在植物学里，多花薯蓣属于豆科。"},{"english":"Dioscorea zingiberensis Wright CH, as a special species of Chinese plant, is an important source of steroid hormones.","chinese":"盾叶薯蓣是中国特有的植物，是甾体激素的重要来源。"},{"english":"Potato is a tropical American yam with small yellow- skinned edible tubers.","chinese":"马铃薯是热带美洲薯蓣科植物，有黄皮的可食块茎。"},{"english":"Methods To identify diosgenin in Jidesheng antivenornous tablets by TLC.","chinese":"方法用TLC法鉴别季德胜蛇药片中的薯蓣皂苷元。"},{"english":"Objective To introduce the extraction, isolation and analysis of diosgenin.","chinese":"目的介绍薯蓣皂苷元主要的提取和分离分析方法。"},{"english":"The Dioscorea zingiberensis Wright is an important medicine source plant, having the higher economy value.","chinese":"盾叶薯蓣是重要药源植物，具有较高的经济价值。"},{"english":"Objective To study the liposoluble components from the aerial parts of Dioscorea nipponica. Makino.","chinese":"目的研究穿龙薯蓣地上部分油状物的化学成分。"}],"related":[{"definition":["Dioscorea polystachya\/yam"],"pinyin":["shan1 yao5"],"word":"山药"},{"definition":["Job's tears plant (Coix lacryma-jobi)\/Chinese pearl barley"],"pinyin":["yi4 yi3"],"word":"薏苡"},{"definition":["asparagus"],"pinyin":["tian1 men2 dong1"],"word":"天门冬"},{"definition":["Wolfiporia extensa (a wood-decay fungus)\/fu ling\/tuckahoe"],"pinyin":["fu2 ling2"],"word":"茯苓"},{"definition":["root bark of the peony tree (used in TCM)"],"pinyin":["mu3 dan5 pi2"],"word":"牡丹皮"},{"definition":["Epimedium, genus of herbaceous flowering plant, cultivated in the Far East as aphrodisiac\/also called barrenwort or horny goatweed (said to resemble crushed goat's testicles)"],"pinyin":["yin2 yang2 huo4"],"word":"淫羊藿"},{"definition":["King Solomon's seal (plant of genus Polygonatum)"],"pinyin":["huang2 jing1"],"word":"黄精"},{"definition":["legume\/leguminous plant"],"pinyin":["dou4 ke1 zhi2 wu4"],"word":"豆科植物"},{"definition":["Gorgon fruit\/Semen euryales (botany)\/see also 雞頭米|鸡头米[ji1 tou2 mi3]"],"pinyin":["qian4 shi2"],"word":"芡实"},{"definition":["dodder (Cuscuta sinensis, a parasitic vine with seeds used in medicine)"],"pinyin":["tu4 si1 zi3"],"word":"菟丝子"},{"definition":["fenugreek leaves\/methi leaves"],"pinyin":["hu2 lu2 ba1"],"word":"葫芦巴"},{"definition":["common water plantain (Alisma plantago-aquatica)\/water plantain rhizome (used in TCM)"],"pinyin":["ze2 xie4"],"word":"泽泻"},{"definition":["the rhizome of large-headed atractylodes (Atractylodes macrocephaia)"],"pinyin":["bai2 zhu2"],"word":"白术"},{"definition":["Indian gooseberry (Phyllanthus emblica)"],"pinyin":["yu2 gan1 zi3"],"word":"余甘子"},{"definition":["dwarf lilyturf (Ophiopogon japonicus), its tuber used in TCM"],"pinyin":["mai4 men2 dong1"],"word":"麦门冬"},{"definition":["Jerusalem artichoke"],"pinyin":["ju2 yu4"],"word":"菊芋"}]}