{"definition":["Sichuan\/the state of Shu in Sichuan at different periods\/the Shu Han dynasty (214-263) of Liu Bei 劉備|刘备 during the Three Kingdoms"],"pinyin":["Shu3 guo2"],"traditional":["蜀國"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"蜀国","characters":[{"definition":["short name for Sichuan 四川[Si4 chuan1] province\/one of the Three Kingdoms 三國|三国[San1 guo2] after the Han dynasty, also called 蜀漢|蜀汉[Shu3 Han4], situated around what is now Sichuan province"],"pinyin":["Shu3"],"word":"蜀"},{"definition":["surname Guo","country\/nation\/state\/national\/CL:個|个[ge4]"],"pinyin":["Guo2","guo2"],"word":"国"}],"containing_words":[],"sentences":[{"english":"Chengdu was the capital of Shu during the Three Kingdoms.","chinese":"成都是三国时期蜀国的首都。"},{"english":"Therefore, Wu and Shu united to defend his attack.","chinese":"因此吴国和蜀国联合起来抗曹。"},{"english":"In ancient times, Sichuan was called Shu Kingdom, and the transportation wasn’t good at that time.","chinese":"古时候，四川成为蜀国，交通十分不便。"},{"english":"At the end of Shang dynasty and the beginning of Zhou dynasty, the ancient Shu entered the Duyu dynasty.","chinese":"商末周初，古蜀国由鱼凫王朝跨入了杜宇王朝。"},{"english":"The river system in Wenjiang has given birth to the ancient Shu Kingdom culture.","chinese":"温江河系孕育了古蜀国的文化。"},{"english":"He was so great that everyone in the state of Shu loved him.","chinese":"他是一个好丞相，所有的蜀国人都很爱戴他。"},{"english":"If Shu rule all the land, chopping and not cut is right.","chinese":"若是蜀国一统天下了，斩与不斩就都是对的了。"},{"english":"The Jinsha Ruins may have been the political and cultural centre of the ancient Shu Kingdom.","chinese":"金沙遗址可能是古代蜀国的政治和文化中心。"},{"english":"Completed all of the Shu Alliance Battles in Conquest Mode.","chinese":"在无双模式中完成所有蜀国的联盟战役。"}],"related":[{"definition":["Shu Han (c. 200-263), Liu Bei's kingdom in Sichuan during the Three Kingdoms, claiming legitimacy as successor of Han"],"pinyin":["Shu3 Han4"],"word":"蜀汉"},{"definition":["Cao Wei, the most powerful of the Three Kingdoms, established as a dynasty in 220 by Cao Pi 曹丕, son of Cao Cao, replaced by Jin dynasty in 265"],"pinyin":["Cao2 Wei4"],"word":"曹魏"},{"definition":["Wei State (407-225 BC), one of the Seven Hero States of the Warring States 戰國七雄|战国七雄\/Wei State or Cao Wei 曹魏 (220-265), the most powerful of the Three Kingdoms"],"pinyin":["Wei4 guo2"],"word":"魏国"},{"definition":["Eastern Wu (222-280)\/the southern state of Wu during the Three Kingdoms period, founded by Sun Quan 孫權|孙权"],"pinyin":["Dong1 Wu2"],"word":"东吴"},{"definition":["name of old state in modern Sichuan"],"pinyin":["Yi4 zhou1"],"word":"益州"},{"definition":["Liu Bei (161-223), warlord at the end of the Han dynasty and founder of the Han kingdom of Shu 蜀漢|蜀汉 (c. 200-263), later the Shu Han dynasty"],"pinyin":["Liu2 Bei4"],"word":"刘备"},{"definition":["Liu Chan 劉禪|刘禅 (207-271), son of Liu Bei, reigned as Shu Han emperor 233-263"],"pinyin":["Liu2 Chan2"],"word":"刘禅"},{"definition":["Zhuge Liang (181-234), military leader and prime minister of Shu Han 蜀漢|蜀汉 during the Three Kingdoms period\/the main hero of the fictional Romance of Three Kingdoms 三國演義|三国演义, where he is portrayed as a sage and military genius\/mastermind"],"pinyin":["Zhu1 ge3 Liang4"],"word":"诸葛亮"},{"definition":["Wu state (in south China, in different historical periods)\/Wu state 220-280, founded by Sun Quan 孫權|孙权 the southernmost of the three Kingdoms"],"pinyin":["Wu2 guo2"],"word":"吴国"},{"definition":["Sun Quan (reigned 222-252), southern warlord and king of state of Wu 吳|吴 in the Three Kingdoms period"],"pinyin":["Sun1 Quan2"],"word":"孙权"},{"definition":["Sima Zhao (211-265), military general and statesman of Cao Wei 曹魏[Cao2 Wei4]"],"pinyin":["Si1 ma3 Zhao1"],"word":"司马昭"},{"definition":["Sima Yi (179-251), warlord under Cao Cao and subsequently founder of the Jin dynasty"],"pinyin":["Si1 ma3 Yi4"],"word":"司马懿"},{"definition":["Battle of Redcliff of 208 at Chibi in Huangzhou district 黃州區|黄州区 of Huanggang city 黄冈, a decisive defeat of Cao Cao 曹操 at the hands of southern kingdom of Wu\/famous episode in the Romance of the Three Kingdoms 三國演義|三国演义"],"pinyin":["Chi4 bi4 zhi1 zhan4"],"word":"赤壁之战"},{"definition":["Cao Cao (155-220), famous statesman and general at the end of Han, noted poet and calligrapher, later warlord, founder and first king of Cao Wei 曹魏, father of Emperor Cao Pi 曹丕\/the main villain of novel the Romance of Three Kingdoms 三國演義|三国演义"],"pinyin":["Cao2 Cao1"],"word":"曹操"},{"definition":["Liu Biao (142-208), warlord"],"pinyin":["Liu2 Biao3"],"word":"刘表"},{"definition":["the state of Qin, one of the seven states of the Warring States Period (475-220 BC)"],"pinyin":["Qin2 guo2"],"word":"秦国"}]}