{"definition":["harmonious\/friendly relations\/on good terms with one another"],"pinyin":["rong2 qia4"],"traditional":["融洽"],"rank":12166.0,"normalized_rank":0.1702181243266688,"fraction":0.000005974718289832021,"cumulative_fraction":0.9449244658133716,"word":"融洽","characters":[{"definition":["to melt\/to thaw\/to blend\/to merge\/to be in harmony","old variant of 融[rong2]"],"pinyin":["rong2","rong2"],"word":"融"},{"definition":["accord\/to make contact\/to agree\/to consult with\/extensive"],"pinyin":["qia4"],"word":"洽"}],"containing_words":[],"sentences":[{"english":"The minute she is hooked youwant to break rapport.","chinese":"她迷上你的那一刻就会想打破融洽。"},{"english":"Do you click well with your colleagues and boss?","chinese":"你和同事上司相处得融洽吗？"},{"english":"In the opinion of some lofty experts they never quite cohered again.","chinese":"在某些玄虚的专家看来，他们没有再完全融洽统一过。"},{"english":"I have a good relationship with the Juve public.","chinese":"而我和尤文蒂尼的关系一直都很融洽。"},{"english":"Things for the Chinese people and selfless advocate, it is interpersonal harmony.","chinese":"中国人崇尚天下为公和心底无私，故人际关系融洽。"},{"english":"My bridesmaids just cannot get along.","chinese":"我的伴娘们就是不能融洽地相处。"},{"english":"The matey relation between the doctors and patients has active effect on preventing medical disputes.","chinese":"融洽的医患关系对防范医疗纠纷起着积极的作用。"},{"english":"We sympathized with each other when we lived in  Europe.","chinese":"在欧洲居住期间，我们之间的关系十分融洽。"},{"english":"Their partnership gelled and scriptwriting for television followed.","chinese":"他们的合作关系融洽，接着又一起为电视剧写剧本。"},{"english":"We share everything between and relate well to each other regardless of chinchin or ceremony.","chinese":"我们不分彼此，相处融洽，不必拘泥客套礼节。"},{"english":"In some cases, the relationship might go downhill after having spent a couple of blissful years together.","chinese":"有时候，融洽生活多年的夫妇也会劳燕分飞。"},{"english":"This is a harmony between man and nature Rongcheng fishing village.","chinese":"这是一个人与自然和谐融洽的荣成渔村。"},{"english":"This neutral-rapport process lasts for a minute or two at most.","chinese":"这个中性的融洽过程要保持1分钟或者最多两分钟。"},{"english":"An interviewer hosts the meeting in an office setting where a friendly conversation takes place between two people.","chinese":"在一间办公室里，面试官和应聘者进行融洽的交流。"},{"english":"His tastes were in harmony with hers, which brought them into harmony.","chinese":"他的爱好同她的爱好协调，这使得他们很融洽。"},{"english":"If it is in a harmonious communication atmo here, which can bring pleasure to the two sides.","chinese":"如果交际氛围融洽，会带来交际双方的愉悦。"}],"related":[{"definition":["peaceful relations\/harmonious"],"pinyin":["he2 mu4"],"word":"和睦"},{"definition":["to be in contact (with sb)\/to associate\/to interact\/to get along (well, poorly)"],"pinyin":["xiang1 chu3"],"word":"相处"},{"definition":["close relation, no gap (idiom); intimate and nothing can come between"],"pinyin":["qin1 mi4 wu2 jian1"],"word":"亲密无间"},{"definition":["intimate\/close"],"pinyin":["qin1 mi4"],"word":"亲密"},{"definition":["(of relations) joyous and harmonious"],"pinyin":["qi2 le4 rong2 rong2"],"word":"其乐融融"},{"definition":["intimate\/to get close to"],"pinyin":["qin1 jin4"],"word":"亲近"},{"definition":["cheerful\/cheerily\/delightful\/pleasant\/pleasantly\/pleasing\/happy\/delighted"],"pinyin":["yu2 kuai4"],"word":"愉快"},{"definition":["intimate\/friendly\/warm\/active\/lively (interaction, participation etc)"],"pinyin":["re4 luo4"],"word":"热络"},{"definition":["familiar\/close"],"pinyin":["shu2 luo4"],"word":"熟络"},{"definition":["to live in harmony\/to get along with each other"],"pinyin":["he2 mu4 xiang1 chu3"],"word":"和睦相处"},{"definition":["family-like close relationship (idiom)"],"pinyin":["qin1 ru2 yi1 jia1"],"word":"亲如一家"},{"definition":["to get along well (with sb)\/congenial\/to speculate (on financial markets)"],"pinyin":["tou2 qi4"],"word":"投契"},{"definition":["tacit understanding\/mutual understanding\/rapport\/connected at a deep level with each other\/(of team members) well coordinated\/tight"],"pinyin":["mo4 qi4"],"word":"默契"},{"definition":["friendly\/amicable\/close friend","Youhao district of Yichun city 伊春市[Yi1 chun1 shi4], Heilongjiang"],"pinyin":["you3 hao3","You3 hao3"],"word":"友好"},{"definition":["amiable\/easy-going"],"pinyin":["sui2 he2"],"word":"随和"},{"definition":["to treat each other as an honored guest (idiom)\/mutual respect between husband and wife"],"pinyin":["xiang1 jing4 ru2 bin1"],"word":"相敬如宾"}]}