{"definition":["to practice medicine (esp. in private practice)"],"pinyin":["xing2 yi1"],"traditional":["行醫"],"rank":13323.0,"normalized_rank":0.18640605543352035,"fraction":0.000005122208948958338,"cumulative_fraction":0.9513326033555664,"word":"行医","characters":[{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"},{"definition":["medical\/medicine\/doctor\/to cure\/to treat"],"pinyin":["yi1"],"word":"医"}],"containing_words":[],"sentences":[{"english":"She has been doctoring since before you were born.","chinese":"从你们出生前至今，她一直在行医。"},{"english":"He was the first one graduated in China medical school and became a practitioner i…","chinese":"他还是第一个取得香港行医执照的中国医学堂毕业生。"},{"english":"He doctored in Chinatown for many years.","chinese":"他在华埠行医多年。"},{"english":"He was licensed to practice as a doctor．","chinese":"他获得了行医执照。"},{"english":"She practised medicine in Xiamen, Fujian Province.","chinese":"首先在福建厦门行医。"},{"english":"It is learnt that the pilot Zuotang practise in our province will also start.","chinese":"据悉，坐堂行医试点也将在我省启动。"},{"english":"It is they who encourage me not only to practice medicine but also study life.","chinese":"不但行医，也鼓励着我研究人生。"},{"english":"He is a Chinese medical practitioner with 70 years of working experiences.","chinese":"民间草医，年青时拜许多名师，行医70多年。"},{"english":"Practitioners may not be certified or licensed.","chinese":"传统医务人员可能未获认证，或无照行医。"},{"english":"Hopefully they've cleared it up a little bit.","chinese":"现在的行医政策。"},{"english":"Once someone was certified they could be a doctor for 50 years, the way the current system works.","chinese":"按照现行制度，行医执照的有效期为50年。"},{"english":"The author proposed that the crime of illegal medical practice is also an non-statutory offence to intent.","chinese":"分析了非法行医罪也是一种非法定目的犯。"},{"english":"For this reason I have decided to take practicing medicine as my future career.","chinese":"基于这个理由，我已决订把行医作为未来的职业。"},{"english":"No. 336, Section l of our country's penal code set up illegal practice medicine crime newly.","chinese":"我国现行刑法典336条第一款新设了非法行医罪。"},{"english":"Last year the GMC struck off a total of 60 doctors.","chinese":"去年，医疗委员会共取消了60名医生的行医资格。"},{"english":"She practiced medicine in Xiamen, Fujian Province.","chinese":"先是在福建厦门行医。"}],"related":[{"definition":["practice medicine or pharmacy to help the people or public"],"pinyin":["xuan2 hu2 ji4 shi4"],"word":"悬壶济世"},{"definition":["to treat the disease to save the patient\/to criticize a person in order to help him"],"pinyin":["zhi4 bing4 jiu4 ren2"],"word":"治病救人"},{"definition":["medical expertise\/art of healing"],"pinyin":["yi1 shu4"],"word":"医术"},{"definition":["medical ethics"],"pinyin":["yi1 de2"],"word":"医德"},{"definition":["famous doctor"],"pinyin":["ming2 yi1"],"word":"名医"},{"definition":["art of healing\/medical skill","Hur Jun (TV series)"],"pinyin":["yi1 dao4","Yi1 dao4"],"word":"医道"},{"definition":["to help the dying and heal the injured"],"pinyin":["jiu4 si3 fu2 shang1"],"word":"救死扶伤"},{"definition":["to visit a patient at home (of a doctor)\/house call"],"pinyin":["chu1 zhen3"],"word":"出诊"},{"definition":["to seek medical treatment\/to see a doctor"],"pinyin":["qiu2 yi1"],"word":"求医"},{"definition":["barefoot doctor\/farmer with paramedical training (PRC)"],"pinyin":["chi4 jiao3 yi1 sheng1"],"word":"赤脚医生"},{"definition":["medical expertise"],"pinyin":["yi1 liao2 jing1 yan4"],"word":"医疗经验"},{"definition":["kindness\/benevolence\/to govern in humanitarian way"],"pinyin":["ren2 shu4"],"word":"仁术"},{"definition":["benevolent heart and skillful execution (idiom, from Mencius); charitable in thought and deed"],"pinyin":["ren2 xin1 ren2 shu4"],"word":"仁心仁术"},{"definition":["good doctor\/skilled doctor"],"pinyin":["liang2 yi1"],"word":"良医"},{"definition":["(literary) to practice medicine\/to work as a pharmacist"],"pinyin":["xuan2 hu2"],"word":"悬壶"},{"definition":["to treat an illness"],"pinyin":["zhi4 bing4"],"word":"治病"}]}