{"definition":["lit. in every trade, a master appears (idiom); fig. You can produce outstanding achievements in any task, provided you put it enough love and diligence"],"pinyin":["hang2 hang2 chu1 zhuang4 yuan2"],"traditional":["行行出狀元"],"rank":45988.0,"normalized_rank":0.6434317854294629,"fraction":2.1677677588996925e-7,"cumulative_fraction":0.9982443918957984,"word":"行行出状元","characters":[{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"},{"definition":["accusation\/suit\/state\/condition\/strong\/great\/-shaped"],"pinyin":["zhuang4"],"word":"状"},{"definition":["surname Yuan\/the Yuan or Mongol dynasty (1279-1368)","currency unit (esp. Chinese yuan)\/first\/original\/primary\/fundamental\/constituent\/part\/era (of a reign)\/meta- (prefix)\/(math.) argument\/variable\/(Tw) (geology) eon"],"pinyin":["Yuan2","yuan2"],"word":"元"}],"containing_words":[],"sentences":[{"english":"There are many sorts of hero, and most of us have more than one skill.","chinese":"行行出状元，我们大多数人都不只拥有一种技能。"}],"related":[{"definition":["all walks of life (idiom)\/every trade"],"pinyin":["san1 bai3 liu4 shi2 hang2"],"word":"三百六十行"},{"definition":["different trades, worlds apart (idiom); to sb outside the profession, it is a closed book"],"pinyin":["ge2 hang2 ru2 ge2 shan1"],"word":"隔行如隔山"},{"definition":["proficiency in a particular field (idiom)\/skill in a specialized area (idiom)"],"pinyin":["yi1 ji4 zhi1 chang2"],"word":"一技之长"},{"definition":["it's always good to have more skills (idiom)"],"pinyin":["yi4 duo1 bu4 ya1 shen1"],"word":"艺多不压身"},{"definition":["see 藝多不壓身|艺多不压身[yi4 duo1 bu4 ya1 shen1]"],"pinyin":["yi4 bu4 ya1 shen1"],"word":"艺不压身"},{"definition":["the matter depends on the individual (idiom); it is a matter for your own effort\/With effort, one can achieve anything."],"pinyin":["shi4 zai4 ren2 wei2"],"word":"事在人为"},{"definition":["all roads lead to Rome\/use different means to obtain the same result (idiom)"],"pinyin":["tiao2 tiao2 da4 lu4 tong1 Luo2 ma3"],"word":"条条大路通罗马"},{"definition":["a really determined person will find a solution (idiom); where there's a will, there's a way"],"pinyin":["you3 zhi4 zhe3 shi4 jing4 cheng2"],"word":"有志者事竟成"},{"definition":["one cannot achieve glory and wealth without having been through trials and tribulations (proverb)\/no pain, no gain"],"pinyin":["chi1 de2 ku3 zhong1 ku3 , fang1 wei2 ren2 shang4 ren2"],"word":"吃得苦中苦，方为人上人"},{"definition":["there is nothing the determined person can't accomplish (idiom)\/persistence will overcome"],"pinyin":["shi4 shang4 wu2 nan2 shi4 , zhi3 pa4 you3 xin1 ren2"],"word":"世上无难事，只怕有心人"},{"definition":["If you work at it hard enough, you can grind an iron bar into a needle.\/cf idiom 磨杵成針|磨杵成针, to grind an iron bar down to a fine needle (idiom); fig. to persevere in a difficult task\/to study diligently"],"pinyin":["zhi3 yao4 gong1 fu5 shen1 , tie3 chu3 mo2 cheng2 zhen1"],"word":"只要功夫深，铁杵磨成针"},{"definition":["mastery of study lies in diligence (idiom). You can only master a subject by assiduous study.\/Excellence in work is only possible with diligence.\/Practice makes perfect."],"pinyin":["ye4 jing1 yu2 qin2"],"word":"业精于勤"},{"definition":["A famous teacher trains a fine student (idiom). A cultured man will have a deep influence on his successors."],"pinyin":["ming2 shi1 chu1 gao1 tu2"],"word":"名师出高徒"},{"definition":["lit. for some things a foot may be too short, and for the other an inch will suffice (proverb)\/fig. everyone has their strong and weak points\/everything has its advantages and disadvantages"],"pinyin":["chi3 you3 suo3 duan3 , cun4 you3 suo3 chang2"],"word":"尺有所短，寸有所长"},{"definition":["you get what you put in\/you reap what you sow"],"pinyin":["yi1 fen1 geng1 yun2 , yi1 fen1 shou1 huo4"],"word":"一分耕耘，一分收获"},{"definition":["lit. nothing is difficult on this earth, if your mind is set (idiom)"],"pinyin":["tian1 xia4 wu2 nan2 shi4 , zhi3 pa4 you3 xin1 ren2"],"word":"天下无难事，只怕有心人"}]}