{"definition":["to join together\/to combine"],"pinyin":["xian2 jie1"],"traditional":["銜接"],"rank":7959.0,"normalized_rank":0.11135673611013948,"fraction":0.000012064320972004385,"cumulative_fraction":0.9093063041089344,"word":"衔接","characters":[{"definition":["bit (of a bridle)\/to hold in the mouth\/to harbor (feelings)\/to link\/to accept\/rank\/title","variant of 銜|衔[xian2]","variant of 銜|衔[xian2]"],"pinyin":["xian2","xian2","xian2"],"word":"衔"},{"definition":["to receive\/to answer (the phone)\/to meet or welcome sb\/to connect\/to catch\/to join\/to extend\/to take one's turn on duty\/to take over for sb"],"pinyin":["jie1"],"word":"接"}],"containing_words":[],"sentences":[{"english":"However, a participant took the view that the number of seats should dovetail with the future constitutional system.","chinese":"但有嘉宾认为，议席数目须与未来的政制衔接。"},{"english":"Punctuation marks are an integrant sign of cohesion and coherence in modern writing.","chinese":"标点符号是现代书面语中不可缺少的衔接和连贯标志。"},{"english":"I think me and Alex alternate quite well.","chinese":"我觉得我和阿莱克斯转换衔接的还算不错。"},{"english":"The continuous transformation connects smoothly to the unit operator .","chinese":"连续变换光滑地衔接到单位算符。"},{"english":"Individual gutter sections can be connected or joined with snap-in-place connectors.","chinese":"水沟局部能够零丁或与衔接单位当场衔接器参加。"},{"english":"Individual gutter sections can be connected or joined with snap-in-place connectors.","chinese":"水沟局部能够零丁或与衔接单位当场衔接器参加。"},{"english":"In helping the sub-menu is the convergence of the system related presentations.","chinese":"在帮助的子菜单就是衔接该系统的相关介绍。"},{"english":"With over 30 points of articulation, you can create incredible yet subtle poses.","chinese":"拥有超过30点的衔接，可以创造难以置信的姿势。"},{"english":"Finally, the cohesion and coherence of discourse also have an impact on the translation of polysemic words.","chinese":"同时，语篇的衔接与连贯也作用于多义词的翻译。"},{"english":"The trolleybus connects here with a bus for the airport.","chinese":"这辆无轨电车与开往机场的公共汽车衔接。"},{"english":"The electronic translator can also be interfaced to other communications devices, such as telephones.","chinese":"电子翻译也可以衔接到其他通信设备，例如电话。"},{"english":"To the Strait of Hormuz and the Gulf of Oman and the Arabian Sea converge.","chinese":"以霍尔木兹海峡和阿曼湾与阿拉伯海衔接。"},{"english":"The arch died away against the towers.","chinese":"弓形结构与塔状结构相衔接。"},{"english":"Strictly implement production plan to ensure the balanced production and the linkage between different working orders.","chinese":"严格执行生产计划，保证均衡生产和工序间的衔接。"},{"english":"The two space vehicles locked on to each other.","chinese":"那两只航天器衔接起来了。"},{"english":"Articulation includes ball-jointed neck, shoulders, elbows, wrists, and swivel waist.","chinese":"衔接包括球体关节颈，肩，肘，手腕，腰和旋转。"}],"related":[{"definition":["seamless connection"],"pinyin":["wu2 feng4 lian2 jie1"],"word":"无缝连接"},{"definition":["to link up\/to thread together"],"pinyin":["guan4 tong1"],"word":"贯通"},{"definition":["to link\/to join\/to attach\/connection\/a link (on web page)"],"pinyin":["lian2 jie1"],"word":"连接"},{"definition":["to link up (disparate elements)\/coherent (narrative, argument etc)"],"pinyin":["lian2 guan4"],"word":"连贯"},{"definition":["longitudinal\/vertical"],"pinyin":["zong4 xiang4"],"word":"纵向"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推进"},{"definition":["to extend\/to spread"],"pinyin":["yan2 shen1"],"word":"延伸"},{"definition":["to run through\/a connecting thread from beginning to end\/to link"],"pinyin":["guan4 chuan1"],"word":"贯穿"},{"definition":["to establish ties or contact\/in series connection (electricity)"],"pinyin":["chuan4 lian2"],"word":"串联"},{"definition":["matching\/fitting in with\/compatible with\/to correspond\/to fit\/to conform to\/rapport\/to coordinate with\/to act in concert with\/to cooperate\/to become man and wife\/to combine parts of machine"],"pinyin":["pei4 he2"],"word":"配合"},{"definition":["horizontal\/orthogonal\/perpendicular\/lateral\/crosswise"],"pinyin":["heng2 xiang4"],"word":"横向"},{"definition":["to cross\/to intersect\/to overlap"],"pinyin":["jiao1 cha1"],"word":"交叉"},{"definition":["(of systems, facilities etc) comprehensive\/well-developed\/excellent\/to refine\/to improve"],"pinyin":["wan2 shan4"],"word":"完善"},{"definition":["to connect\/to communicate\/to relate\/(math.) connected"],"pinyin":["lian2 tong1"],"word":"连通"},{"definition":["to coordinate\/to harmonize\/to fit together\/to match (colors etc)\/harmonious\/concerted"],"pinyin":["xie2 tiao2"],"word":"协调"},{"definition":["to complement one another (idiom)"],"pinyin":["xiang1 fu3 xiang1 cheng2"],"word":"相辅相成"}]}