{"definition":["tonic"],"pinyin":["bu3 pin3"],"traditional":["補品"],"rank":28296.0,"normalized_rank":0.3958977515985057,"fraction":0.0000010964379553599724,"cumulative_fraction":0.9885099710696098,"word":"补品","characters":[{"definition":["to repair\/to patch\/to mend\/to make up for\/to fill (a vacancy)\/to supplement"],"pinyin":["bu3"],"word":"补"},{"definition":["article\/commodity\/product\/goods\/kind\/grade\/rank\/character\/disposition\/nature\/temperament\/variety\/to taste sth\/to sample\/to criticize\/to comment\/to judge\/to size up\/fret (on a guitar or lute)"],"pinyin":["pin3"],"word":"品"}],"containing_words":[{"definition":["tonic\/invigorant"],"pinyin":["zi1 bu3 pin3"],"word":"滋补品"}],"sentences":[{"english":"Chicken soup is often thought to be a healthy dish (prepared by a family member) and (given to us) when we are sick.","chinese":"鸡汤常被认为是我们生病时，家人为我们准备的补品。"},{"english":"To use this skill you need Concentration tonics which can be bought at item store.","chinese":"要使用此技能需要浓度滋补品，可买的物品存储。"},{"english":"This tonic, strengthening the loins and invigorating the kidney , is the first choice for the nephrotics.","chinese":"本补膏健肾壮腰，肾亏病人的首选补品。"},{"english":"When it comes to supplements, you should ask the same questions. Those things apply -- talk to your physician.","chinese":"一旦说到补品，你也应该问同样的问题。"},{"english":"But supplements do offer an easy, just-in-case form of health insurance.","chinese":"但是，补品的确很方便地为您的健康增加了一道保险。"},{"english":"Debate has raged over whether taking supplements might provide the body with an extra boost.","chinese":"摄取补品是否能够增强体质的争论已经炽热化。"},{"english":"Strictly speaking, \"tonic\" has the sub-tonic and tonic.","chinese":"严格地讲，“补药”有补药和补品之分。"},{"english":"She advised consulting with doctors first about taking supplements.","chinese":"她劝服用补品的人应首先咨询医生。"},{"english":"It may also interact with some medications or supplements.","chinese":"它也可能会与一些药物或补品相互作用。"},{"english":"Cordyceps sinensis (Berk. ) Sacc. , a parasitic fungus, is highly valued in China as a tonic food and herbal medicine for centuries.","chinese":"冬虫夏草是一种药食两用的珍贵滋补品和中药材。"},{"english":"This shop has for sale every kind of tonic that helps stimulate appetite and digestion.","chinese":"各种开胃消食的补品，本店应有尽有。"},{"english":"Ginseng is a powerful adaptogen.","chinese":"人参是一种强力的补品。"},{"english":"Sea air is Nature's best tonic for mind and body.","chinese":"海上的空气是大自然赋予的对人们身心的最佳补品。"},{"english":"Or take a bilberry supplement every morning.","chinese":"或者每天吃越桔补品。"},{"english":"As with any vitamin or supplement, please consult your doctor before taking.","chinese":"正如任何一种维生素或补品，服用前请咨询你的医生。"},{"english":"The whales need the nourishment, particularly when nursing their newborn calves.","chinese":"鲸需要滋补品，特别是喂养他们的幼崽时。"}],"related":[{"definition":["tonic"],"pinyin":["bu3 yao4"],"word":"补药"},{"definition":["tonic\/invigorant"],"pinyin":["zi1 bu3 pin3"],"word":"滋补品"},{"definition":["nourishing\/nutritious"],"pinyin":["zi1 bu3"],"word":"滋补"},{"definition":["nourishment\/nutrient"],"pinyin":["ying2 yang3 pin3"],"word":"营养品"},{"definition":["to take a tonic or nourishing food to build up one's health"],"pinyin":["bu3 yang3"],"word":"补养"},{"definition":["tonic food (food considered to be particularly healthful)\/to eat such foods"],"pinyin":["shi2 bu3"],"word":"食补"},{"definition":["medicinal dietary supplement that helps build up one's health"],"pinyin":["yao4 bu3"],"word":"药补"},{"definition":["benefit\/help"],"pinyin":["bu3 yi4"],"word":"补益"},{"definition":["to take a tonic (for one's health)"],"pinyin":["jin4 bu3"],"word":"进补"},{"definition":["(TCM) to build up one's kidney yang\/to boost male sex drive"],"pinyin":["zhuang4 yang2"],"word":"壮阳"},{"definition":["the benefits of medicine are not as great as those of good nutrition"],"pinyin":["yao4 bu3 bu4 ru2 shi2 bu3"],"word":"药补不如食补"},{"definition":["a person who is in poor health cannot handle sth so strong as a tonic"],"pinyin":["xu1 bu4 shou4 bu3"],"word":"虚不受补"},{"definition":["to nourish one's skin\/to maintain a youthful appearance"],"pinyin":["yang3 yan2"],"word":"养颜"},{"definition":["effective cure, miracle medicine (idiom); fig. wonder-cure for all problems\/panacea\/elixir"],"pinyin":["ling2 dan1 miao4 yao4"],"word":"灵丹妙药"},{"definition":["medicinal cuisine"],"pinyin":["yao4 shan4"],"word":"药膳"},{"definition":["young deer antler prior to ossification (used in TCM)"],"pinyin":["lu4 rong2"],"word":"鹿茸"}]}