{"definition":["to show\/to show off\/to display\/to manifest\/expression\/manifestation\/show\/display\/performance (at work etc)\/behavior"],"pinyin":["biao3 xian4"],"traditional":["表現"],"rank":325.0,"normalized_rank":0.0045471716592279604,"fraction":0.0004099069279598279,"cumulative_fraction":0.4526580858276136,"word":"表现","characters":[{"definition":["wrist or pocket watch","exterior surface\/family relationship via females\/to show (one's opinion)\/a model\/a table (listing information)\/a form\/a meter (measuring sth)"],"pinyin":["biao3","biao3"],"word":"表"},{"definition":["to appear\/present\/now\/existing\/current"],"pinyin":["xian4"],"word":"现"}],"containing_words":[{"definition":["phenotype"],"pinyin":["biao3 xian4 xing2"],"word":"表现型"},{"definition":["expressive power"],"pinyin":["biao3 xian4 li4"],"word":"表现力"}],"sentences":[{"english":"They found that the higher their level of social interaction, the better their cognitive functioning.","chinese":"他们发现，社会交往越多的人认知表现越好。"},{"english":"Ads close to top-of-the-page headlines did well.","chinese":"靠近页顶标题的广告表现良好。"},{"english":"The quite demeanor of the Capricorn is easily misinterpreted as cold and hard hearted.","chinese":"摩羯的这种表现很容易让人误解为冷漠和硬心肠。"},{"english":"Objective To improve the performance level and awareness of CT imaging with brain abscess .","chinese":"目的提高对脑脓肿CT影像学表现的认识和诊断水平。"},{"english":"In such a case, a lapse of memory will represent directly the un-invoiced services.","chinese":"在这种情况下，失误的储存表现为“不”一开单服务。"},{"english":"I am speaking English but you are acting like sheep, only looking wide-eyed.","chinese":"我讲的是英语，但你表现的像只绵羊，只是睁大眼睛。"},{"english":"Human Factors is the discipline of optimising human performance in the workplace.","chinese":"人的因素，是优化人在工作场所的表现纪律。"},{"english":"Diagnosis was established on clinical findings and the barium enema examination.","chinese":"诊断主要依靠临床表现和钡剂灌肠透视。"},{"english":"The cardinal clinical manifestation was painless solid enlargement of the testis.","chinese":"睾丸无痛性肿大为其主要临床表现。"},{"english":"Fuxin Mongolian drama has a unique form of expression and the cultural charm.","chinese":"阜新蒙古剧有着独特的表现形式和文化魅力。"},{"english":"HF radar backscatter from the ocean surface shows nonlinearities and time variation of its spectrum.","chinese":"高频波段海洋回波信号表现了非线性和频谱时变性。"},{"english":"The Fund's selection in Capital Goods and Energy detracted performance.","chinese":"我们于资本财货及能源行业的选股表现影响基金价值。"},{"english":"New employees are undependable or do not perform to expectations.","chinese":"新来的员工不可靠，或表现的不如预期。"},{"english":"The odds are that the US would stay flattish for years to come.","chinese":"在未来若干年，美国经济都会表现平平。"},{"english":"There is a raise after three months probation period according to your performance.","chinese":"三个月的试用期过后，将根据工作表现加薪。"},{"english":"Next, must display sincerely, avoids speaking insincerely.","chinese":"其次，要表现出真诚，避免言不由衷。"}],"related":[{"definition":["to display\/to exhibit\/to bring out implicit or innate qualities\/to express (a thought or moral)\/to develop (an idea)\/to elaborate (on a theme)"],"pinyin":["fa1 hui1"],"word":"发挥"},{"definition":["remarkable (performance, achievement etc)\/worthy of praise"],"pinyin":["ke3 quan1 ke3 dian3"],"word":"可圈可点"},{"definition":["eye-catching"],"pinyin":["qiang3 yan3"],"word":"抢眼"},{"definition":["remarkable\/outstanding"],"pinyin":["chu1 se4"],"word":"出色"},{"definition":["state of affairs\/state\/mode\/situation\/CL:個|个[ge4]"],"pinyin":["zhuang4 tai4"],"word":"状态"},{"definition":["not good"],"pinyin":["bu4 jia1"],"word":"不佳"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["respect\/aspect\/field\/side\/CL:個|个[ge4]"],"pinyin":["fang1 mian4"],"word":"方面"},{"definition":["clear\/distinct\/obvious"],"pinyin":["ming2 xian3"],"word":"明显"},{"definition":["same\/equal\/equivalent"],"pinyin":["tong2 yang4"],"word":"同样"},{"definition":["but\/yet\/however\/only\/merely\/still"],"pinyin":["dan4"],"word":"但"},{"definition":["despite\/although\/even though\/in spite of\/unhesitatingly\/do not hesitate (to ask, complain etc)\/(go ahead and do it) without hesitating"],"pinyin":["jin3 guan3"],"word":"尽管"},{"definition":["but\/however"],"pinyin":["dan4 shi4"],"word":"但是"},{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["to come and see\/to see a topic from a certain point of view"],"pinyin":["lai2 kan4"],"word":"来看"}]}