{"definition":["to set off"],"pinyin":["chen4 tuo1"],"traditional":["襯托"],"rank":13607.0,"normalized_rank":0.19037958389881493,"fraction":0.0000049157965845755656,"cumulative_fraction":0.952756157611722,"word":"衬托","characters":[{"definition":["(of garments) against the skin\/to line\/lining\/to contrast with\/to assist financially"],"pinyin":["chen4"],"word":"衬"},{"definition":["prop\/support (for weight)\/rest (e.g. arm rest)\/thanks to\/to hold in one's hand\/to support in one's palm\/to give\/to base\/to commit\/to set\/torr (unit of pressure)","to trust\/to entrust\/to be entrusted with\/to act as trustee"],"pinyin":["tuo1","tuo1"],"word":"托"}],"containing_words":[],"sentences":[{"english":"Light colours provide an effective backdrop for pictures or a mirror.","chinese":"浅色是挂放图画或镜子很有效果的衬托。"},{"english":"Shadows on the hills, sketch the trees and the daffodils.","chinese":"山上的阴影，衬托出树和水仙的轮廓。"},{"english":"Our classroom building stood out clearly against the blue sky.","chinese":"蓝天清晰地衬托出我们的教学大楼。"},{"english":"The color scheme was brown, with the mouldings picked out in orange.","chinese":"整个图案是棕色的，用桔黄色的壁线来加以衬托。"},{"english":"An aromatic bouquet of red fruit on a base of Viennese pastry.","chinese":"维也纳甜糕衬托出红色水果的香醇。"},{"english":"The dark-coloured frame shows off the painting well.","chinese":"深色的画框图衬托得很好看。"},{"english":"A charming flushed cheeks, contrasts with the girl is far from mind.","chinese":"一抹娇羞映红了脸颊，衬托着少女渐浓渐远的心思。"},{"english":"The bleakness is with strong red and green background, dispersing after a grand feast.","chinese":"这是一片大红大绿衬托出的苍凉，盛宴后的散席。"},{"english":"Beautifully balanced with red fruit and plum flavors followed by a wood sensation.","chinese":"红果与李子的口味在橡木味道衬托下颇为平衡。"},{"english":"Delicate banquet, return so that tableware foils .","chinese":"美味筵席，还得餐具衬托。"},{"english":"Set off by two gardens, the three European style building look elegant and magnificent.","chinese":"三幢欧式建筑在两座花园的衬托下尽显高贵典雅之气。"},{"english":"The black tree was clearly defined against a yellow sky.","chinese":"那棵黑色的树在黄色天空的衬托下显得轮廓分明。"},{"english":"Red flags stand out against the blue sky.","chinese":"红旗在蓝旗的衬托下很显眼。"},{"english":"However, it must be acknowledged, she had faults to foil her gifts.","chinese":"可是必须承认她也有缺点来衬托她的优点。"},{"english":"The beauty of the girl's face is matched only by the incredible richness of her dress.","chinese":"女孩漂亮的脸蛋也只有身上的华服才能衬托出。"},{"english":"The fashion sets her figure off to advantage.","chinese":"那件时装把她的身段衬托得更加优美。"}],"related":[{"definition":["to set off by contrast\/antithesis\/analogy parallelism (linguistics)"],"pinyin":["ying4 chen4"],"word":"映衬"},{"definition":["background (of a painting)\/backdrop\/a foil (to set off something to advantage)\/to offset (something to advantage)"],"pinyin":["hong1 tuo1"],"word":"烘托"},{"definition":["(of garments) against the skin\/to line\/lining\/to contrast with\/to assist financially"],"pinyin":["chen4"],"word":"衬"},{"definition":["to enhance by contrast\/to set off\/to serve as a background in order to bring out the subject with greater brilliance\/to serve as a prop\/a foil"],"pinyin":["pei2 chen4"],"word":"陪衬"},{"definition":["conspicuous\/to make sth stand out\/make sth prominent"],"pinyin":["tu1 xian3"],"word":"突显"},{"definition":["to decorate\/to adorn\/sprinkled\/studded\/only for show"],"pinyin":["dian3 zhui4"],"word":"点缀"},{"definition":["to contrast\/to set off one another\/to go well with"],"pinyin":["xiang1 chen4"],"word":"相衬"},{"definition":["to decorate\/to dress up\/to deck"],"pinyin":["zhuang1 dian3"],"word":"装点"},{"definition":["to set off\/to highlight by contrast"],"pinyin":["hong1 chen4"],"word":"烘衬"},{"definition":["to decorate"],"pinyin":["zhuang1 dian3"],"word":"妆点"},{"definition":["to present clearly\/to give prominence to\/to magnify\/clear and obvious"],"pinyin":["tu1 xian3"],"word":"凸显"},{"definition":["fascinating\/enchanting\/charming\/tempting"],"pinyin":["mi2 ren2"],"word":"迷人"},{"definition":["to come to prominence\/to appear clearly\/to stick out"],"pinyin":["tu1 xian4"],"word":"凸现"},{"definition":["to decorate\/to adorn\/to dress up\/to polish (a written piece)\/to qualify or modify (grammar)"],"pinyin":["xiu1 shi4"],"word":"修饰"},{"definition":["to shine upon\/to reflect"],"pinyin":["ying4 zhao4"],"word":"映照"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰显"}]}