{"definition":["see the opportunity and act (idiom); to act according to circumstances\/to play it by ear\/to use one's discretion"],"pinyin":["jian4 ji1 xing2 shi4"],"traditional":["見機行事"],"rank":47611.0,"normalized_rank":0.6661396611307766,"fraction":1.842237650997584e-7,"cumulative_fraction":0.9985686267442146,"word":"见机行事","characters":[{"definition":["to appear\/also written 現|现[xian4]","to see\/to meet\/to appear (to be sth)\/to interview"],"pinyin":["xian4","jian4"],"word":"见"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["ji1","Ji1"],"word":"机"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"},{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"}],"containing_words":[],"sentences":[{"english":"I have no idea what they are going to say, so I'll have to play it by ear.","chinese":"我一点不知道他们将会说什么，所以我只好见机行事。"},{"english":"Opportunity must be seized and acted upon in order to have value.","chinese":"必须抓住机会，见机行事才能创造佳绩。"},{"english":"I’ve had no time to prepare for this meeting,so I’ll have to play it by ear.","chinese":"我没有时间来准备这次会议，所以我只好见机行事。"},{"english":"He is a man who knows the time of day.","chinese":"他是一个能见机行事的人。"},{"english":"Since you don't know the language, I can only suggest that you follow your nose.","chinese":"你既然不会这门语言，我只能建议你见机行事。"},{"english":"I am not prepared the speech, so I have to play it by ear.","chinese":"我没准备演讲稿，到时只好见机行事。"},{"english":"We have no set plans, We're just going to do AS we see fit.","chinese":"我们没有即定的计划，我们将见机行事。"},{"english":"I don't know what they'll want when they arrive─we'll have to play it by ear.","chinese":"我不知道他们到达时需要什么我们只有见机行事了。"},{"english":"He learned to pick up on his superior's moods and act accordingly.","chinese":"他学会了注意上级的情绪并见机行事。"},{"english":"John decided to play it by ear when he went for his interview.","chinese":"约翰决定面试的时候见机行事。"},{"english":"When using loudspeakers , be sure to use your discretion. You can't teach others with a cudgel.","chinese":"使用高音喇叭，千万要见机行事，不能授人以柄。"},{"english":"We don't know what to do now, so we must play by ear.","chinese":"我们不知怎么做，所以必须见机行事。"}],"related":[{"definition":["to act as circumstances dictate (idiom)"],"pinyin":["xiang4 ji1 xing2 shi4"],"word":"相机行事"},{"definition":["to change according to the situation (idiom); pragmatic"],"pinyin":["sui2 ji1 ying4 bian4"],"word":"随机应变"},{"definition":["to wait for the opportune moment before taking action (idiom)"],"pinyin":["xiang4 ji1 er2 dong4"],"word":"相机而动"},{"definition":["to take one's time making a decision (idiom)\/to consider at length"],"pinyin":["cong2 chang2 ji4 yi4"],"word":"从长计议"},{"definition":["to defeat the enemy by capturing their chief (idiom)"],"pinyin":["qin2 zei2 qin2 wang2"],"word":"擒贼擒王"},{"definition":["to beat sb at their own game (idiom)"],"pinyin":["jiang1 ji4 jiu4 ji4"],"word":"将计就计"},{"definition":["to keep cool\/to stay calm"],"pinyin":["chen2 zhu4 qi4"],"word":"沉住气"},{"definition":["to take by ruse\/to outwit\/to outsmart"],"pinyin":["zhi4 qu3"],"word":"智取"},{"definition":["to have a clear view of things\/to adapt to circumstances"],"pinyin":["shi2 shi2 wu4"],"word":"识时务"},{"definition":["lit. to pull a snake from its hole\/to expose a malefactor (idiom)"],"pinyin":["yin3 she2 chu1 dong4"],"word":"引蛇出洞"},{"definition":["to look for an opportunity"],"pinyin":["xun2 ji1"],"word":"寻机"},{"definition":["strike first and gain the upper hand (idiom, martial arts term); Making the first move is an advantage."],"pinyin":["xian1 xia4 shou3 wei2 qiang2"],"word":"先下手为强"},{"definition":["counter soldiers with arms, water with an earth weir (idiom); different situations call for different action\/to adopt measures appropriate to the actual situation"],"pinyin":["bing1 lai2 jiang4 dang3 , shui3 lai2 tu3 yan3"],"word":"兵来将挡，水来土掩"},{"definition":["Only an outstanding talent can recognize current trends (idiom). A wise man submits to circumstances."],"pinyin":["shi2 shi2 wu4 zhe3 wei4 jun4 jie2"],"word":"识时务者为俊杰"},{"definition":["a wise man knows better than to fight when the odds are against him (idiom)"],"pinyin":["hao3 han4 bu4 chi1 yan3 qian2 kui1"],"word":"好汉不吃眼前亏"},{"definition":["a wise man looks after his own hide (idiom)\/to put one's own safety before matters of principle"],"pinyin":["ming2 zhe2 bao3 shen1"],"word":"明哲保身"}]}