{"definition":["to regulate\/rules and regulations\/regulatory\/style and structure (esp. of building)"],"pinyin":["gui1 zhi4"],"traditional":["規制"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"规制","characters":[{"definition":["compass\/a rule\/regulation\/to admonish\/to plan\/to scheme","variant of 規|规[gui1]"],"pinyin":["gui1","gui1"],"word":"规"},{"definition":["to manufacture\/to make","system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4","zhi4"],"word":"制"}],"containing_words":[],"sentences":[{"english":"Based on this theory, many countries carried out anti-monopoly reform and legal regulation on the electricity industry.","chinese":"这正是各国电力行业改革与反垄断法律规制的依据。"},{"english":"Again, analysis of government non-tax revenue into the feasibility of legal regulation.","chinese":"再次，浅析浅析了政府非税收入法律规制的可行性。"},{"english":"V. How can Anti-monopoly Law Regulate the Court of Law for Abuse of Power?","chinese":"反垄断法如何规制法院权力滥用？"},{"english":"Part three makes a study on the costs and gains of current system of electrical utility regulation.","chinese":"第三部分分析了现行电业规制制度成本与绩效。"},{"english":"Chapter II, analysis the current experience of legal regulation on patent pool abuse.","chinese":"第三部分，阐述了我国专利池运用及规制现状。"},{"english":"Chapter two is about the integration principles of standard terms.","chinese":"第二章主要分析规制格式条款的订入规则。"},{"english":"So it is necessary for our country to regulate the behavior of public enterprises restricting competition.","chinese":"为此，有必要对公用企业限制竞争行为进行规制。"},{"english":"The U. S. Plan reaffirmed the nature of financial law lies in regulation and supervision.","chinese":"方案再次和反复证明了规制与监管是金融法的品性。"},{"english":"Chapter two is the comparative research on regulations governing unmarried cohabitation in foreign countries.","chinese":"第二章是对非婚同居法律规制的比较研究。"},{"english":"Therefore, this article providessomething valuable to regulating one-man company in our country at the legal level.","chinese":"从而为我国如何在法律层面上规制一人公司提供参考。"},{"english":"The corporation laws of each states are similar but not identical .","chinese":"美国没有单一法典或法规规制商务企业法。"},{"english":"Chapter two discusses the justifiability of Antimonopoly regulatory law for abuse of IPRs.","chinese":"第二章提出反垄断法规制知识产权滥用的正当性命题。"},{"english":"The regulation of enterprises merger is an important part of Anti-monopoly Law.","chinese":"对企业合并进行规制是反垄断法的重要内容之一。"},{"english":"There are two types of model in the legislation of anti-takeover England model and American model.","chinese":"在反收购的法律规制中，可资借鉴的有英美两种模式。"},{"english":"The second part mainly approaches the problem of the controlling form term made into the contracts.","chinese":"第二部分研究格式条款之订入合同及其规制。"},{"english":"The third issue of the thesis is the theoretical analysis of anti-monopoly regulation on the Business Franchise.","chinese":"第三部分是商业特许经营领域反垄断规制的理论分析。"}],"related":[{"definition":["etiquette\/system of rites"],"pinyin":["li3 zhi4"],"word":"礼制"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"规范"},{"definition":["a law"],"pinyin":["lu:4 tiao2"],"word":"律条"},{"definition":["to usurp\/to overstep one's authority"],"pinyin":["jian4 yue4"],"word":"僭越"},{"definition":["rule\/regulation"],"pinyin":["gui1 zhang1"],"word":"规章"},{"definition":["(political) legitimacy"],"pinyin":["zheng4 dang4 xing4"],"word":"正当性"},{"definition":["private law"],"pinyin":["si1 fa3"],"word":"私法"},{"definition":["legislation\/statute"],"pinyin":["fa3 gui1"],"word":"法规"},{"definition":["statute"],"pinyin":["cheng2 wen2 fa3"],"word":"成文法"},{"definition":["an established precedent\/a convention"],"pinyin":["cheng2 li4"],"word":"成例"},{"definition":["criminal law"],"pinyin":["xing2 lu:4"],"word":"刑律"},{"definition":["expressly stipulated (in writing)"],"pinyin":["ming2 wen2 gui1 ding4"],"word":"明文规定"},{"definition":["to state in writing (laws, rules etc)"],"pinyin":["ming2 wen2"],"word":"明文"},{"definition":["provision\/to fix\/to set\/to formulate\/to stipulate\/to provide\/regulation\/rule\/CL:個|个[ge4]"],"pinyin":["gui1 ding4"],"word":"规定"},{"definition":["criminal law"],"pinyin":["xing2 fa3"],"word":"刑法"},{"definition":["to build\/to construct"],"pinyin":["ying2 jian4"],"word":"营建"}]}