{"definition":["to come to understand\/to realize\/consciousness\/awareness\/Buddhist enlightenment (Sanskrit: cittotpāda)"],"pinyin":["jue2 wu4"],"traditional":["覺悟"],"rank":19936.0,"normalized_rank":0.2789305052257496,"fraction":0.0000024100906194905,"cumulative_fraction":0.974684377623546,"word":"觉悟","characters":[{"definition":["a nap\/a sleep\/CL:場|场[chang2]","to feel\/to find that\/thinking\/awake\/aware"],"pinyin":["jiao4","jue2"],"word":"觉"},{"definition":["to comprehend\/to apprehend\/to become aware"],"pinyin":["wu4"],"word":"悟"}],"containing_words":[],"sentences":[{"english":"With the benefit of hindsight, what different steps would you have taken?","chinese":"有事后觉悟的帮助，你会采取哪些不同的步骤呢？"},{"english":"This will raise their awareness of words.","chinese":"这样可以提升他们对单词的觉悟。"},{"english":"The people of our country have a high level of political consciousness.","chinese":"我们国家的人民是有高度的政治觉悟的人民。"},{"english":"That slogan is simply a call for conscious reflection on national unity.","chinese":"这一口号仅仅是号召人民提高民族团结的觉悟。"},{"english":"We hope she'll come to her senses and correct her mistakes.","chinese":"我们希望她能觉悟过来，改正错误。"},{"english":"Aterm used to describe the level of knowledge and consciousness that thepublic has regarding the environment, environmental issues, etc.","chinese":"公众所具备的有关环境及环境问题的觉悟水平。"},{"english":"He has published five individual albums like the \"Consciousness and Confirmation\".","chinese":"出版有《觉悟与印证》等个人画集五部。"},{"english":"It cannot be cut off or destroyed, right up to the attainment of Buddhahood.","chinese":"它不能被去除或破坏，正好获得佛境界的觉悟。"},{"english":"They belonged to the Chan school of Buddhism, the basis of whose creed was abstract meditation.","chinese":"他们都属于佛教禅院，其教义的实质是透彻觉悟。"},{"english":"The class consciousness of the workers make them unite in the struggle.","chinese":"工人们的阶级觉悟使他们在斗争中团结起来。"},{"english":"The Buddha only teaches Nyana and Jhana that give rise to the divine eye and the divine ear.","chinese":"佛陀只教导能获得圣眼及圣耳的觉悟及禅定之法。"},{"english":"This is the heightened state of awareness we hope to communicate.","chinese":"这是我们希望传达的更高境界的觉悟。"},{"english":"Since unknowingly being suddenly in this study to be a trend of consciousness, which is Shijue.","chinese":"在这不觉之中忽然起了一念要趋向觉悟，这是始觉。"},{"english":"Is it true that my lips are candied like the aperture bud of the aboriginal acquainted love?","chinese":"我的唇儿，是真像觉悟的初恋的蓓蕾那样香甜么？"},{"english":"Jamie a consciousness to find SaiLin not in my side.","chinese":"杰米一觉悟来，发现赛琳不在本人的身边。"},{"english":"Consciousness naturally see the sky, people empty the which things?","chinese":"觉悟人生性空见，长天万里哪东西？"}],"related":[{"definition":["knowing oneself (idiom)\/self-knowledge"],"pinyin":["zi4 zhi1 zhi1 ming2"],"word":"自知之明"},{"definition":["a flash of realization\/the truth in a flash\/a moment of enlightenment (usually Buddhist)"],"pinyin":["dun4 wu4"],"word":"顿悟"},{"definition":["to achieve supreme enlightenment or nirvana (Buddhism)"],"pinyin":["da4 che4 da4 wu4"],"word":"大彻大悟"},{"definition":["innate sense of right and wrong\/conscience\/bosom friend"],"pinyin":["liang2 zhi1"],"word":"良知"},{"definition":["faith\/belief\/conviction"],"pinyin":["xin4 nian4"],"word":"信念"},{"definition":["unyielding character\/courageous spirit\/integrity\/moral backbone"],"pinyin":["gu3 qi4"],"word":"骨气"},{"definition":["ambition\/resolve\/backbone\/drive\/spirit"],"pinyin":["zhi4 qi4"],"word":"志气"},{"definition":["thought\/thinking\/idea\/ideology\/CL:個|个[ge4]"],"pinyin":["si1 xiang3"],"word":"思想"},{"definition":["sense of responsibility"],"pinyin":["ze2 ren4 gan3"],"word":"责任感"},{"definition":["dignity\/sanctity\/honor\/majesty"],"pinyin":["zun1 yan2"],"word":"尊严"},{"definition":["ambition\/goal\/ideal\/aspiration"],"pinyin":["zhi4 xiang4"],"word":"志向"},{"definition":["will\/willpower\/determination\/CL:個|个[ge4]"],"pinyin":["yi4 zhi4"],"word":"意志"},{"definition":["to devote oneself to spiritual development (esp. Buddhism or Daoism)\/to devote oneself to perfecting one's art or craft"],"pinyin":["xiu1 xing2"],"word":"修行"},{"definition":["courage\/boldness\/guts"],"pinyin":["dan3 liang4"],"word":"胆量"},{"definition":["to believe in (a religion)\/firm belief\/conviction"],"pinyin":["xin4 yang3"],"word":"信仰"},{"definition":["to give up life for righteousness (idiom, from Mencius); to choose honor over life\/would rather sacrifice one's life than one's principles"],"pinyin":["she3 sheng1 qu3 yi4"],"word":"舍生取义"}]}