{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","to transport under guard","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","surname Xie"],"pinyin":["xie4","jie4","jie3","Xie4"],"traditional":["解","解","解","解"],"rank":3786.0,"normalized_rank":0.05297105200565248,"fraction":0.00003571707585244325,"cumulative_fraction":0.8232839068752169,"word":"解","components":{"unicode":"U+89E3","character":"解","decomposition":"⿰角𭷔","decomposition_definitions":[{"word":"⿰"},{"definition":["surname Jue","role (theater)\/to compete\/ancient three legged wine vessel\/third note of pentatonic scale","angle\/corner\/horn\/horn-shaped\/unit of money equal to 0.1 yuan, or 10 cents (a dime)\/CL:個|个[ge4]"],"pinyin":["Jue2","jue2","jiao3"],"word":"角"},{"word":"𭷔"}]},"containing_words":[{"definition":["to understand\/to realize\/to find out","to understand\/to realize\/to find out"],"pinyin":["liao3 jie3","liao3 jie3"],"word":"了解"},{"definition":["to understand\/to realize\/to find out","to understand\/to realize\/to find out"],"pinyin":["liao3 jie3","liao3 jie3"],"word":"了解"},{"definition":["to settle (a dispute)\/to resolve\/to solve\/to dispose of\/to dispatch"],"pinyin":["jie3 jue2"],"word":"解决"},{"definition":["explanation\/to explain\/to interpret\/to resolve\/CL:個|个[ge4]"],"pinyin":["jie3 shi4"],"word":"解释"},{"definition":["to comprehend\/to understand\/comprehension\/understanding"],"pinyin":["li3 jie3"],"word":"理解"},{"definition":["to bring relief\/to alleviate (a crisis)\/to dull (a pain)"],"pinyin":["huan3 jie3"],"word":"缓解"},{"definition":["to liberate\/to emancipate\/liberation\/refers to the Communists' victory over the Nationalists in 1949\/CL:次[ci4]"],"pinyin":["jie3 fang4"],"word":"解放"},{"definition":["to remove\/to sack\/to get rid of\/to relieve (sb of their duties)\/to free\/to lift (an embargo)\/to rescind (an agreement)"],"pinyin":["jie3 chu2"],"word":"解除"},{"definition":["to mediate\/to bring parties to an agreement"],"pinyin":["tiao2 jie3"],"word":"调解"},{"definition":["to dissolve\/to resolve (contradictions)\/to dispel (doubts)\/to iron out (difficulties)\/to defuse (conflicts)\/to neutralize (fears)"],"pinyin":["hua4 jie3"],"word":"化解"},{"definition":["to explain\/to comment"],"pinyin":["jie3 shuo1"],"word":"解说"},{"definition":["to decipher\/to decode\/to interpret"],"pinyin":["jie3 du2"],"word":"解读"}],"sentences":[{"english":"This weight of evidence is something mystical and unanalyzable .","chinese":"证据的重要性是神秘不可解的。"},{"english":"He started to unbutton his pants.","chinese":"他开始解裤子上的纽扣。"},{"english":"The block decoupling problem for linear time-invariant systems is discussed.","chinese":"本文讨论线性时不变系统的块解耦问题。"},{"english":"A low-solids mud in which there is no clay deflocculant chemical.","chinese":"不含粘土解絮凝化学剂的低固相泥浆。"},{"english":"It realizes self-tuning decoupling control for multivariable systems with arbitary delay time structure.","chinese":"实现了对具有任意延时结构的多变量系统的解耦控制。"},{"english":"The periodic solution can be bifurcated from equilibrium point with the variation of parameters.","chinese":"系统随着参数的变化，从平衡点分岔出周期解。"},{"english":"And thus, we solve, for this class of nonlinear systems, the open loop decoupling problem.","chinese":"由此，对于这类系统，解决了开环控制解耦问题。"},{"english":"The decoupling controller design method based on the output shaping is presented in this paper.","chinese":"提出了一种基于输出拟形的解耦控制器设计方法。"},{"english":"Decoupling of interface protocols from an implementation strategy.","chinese":"接口协议和实现策略之间的解耦。"},{"english":"Mulan sat beneath the blossoming magnolia tree and removed her hail comb.","chinese":"木兰坐在开满红花的木兰树下，解下自己的发髻。"},{"english":"B:I took off my shirt and my watch and jumped into the water.","chinese":"我脱掉上衣，解下手表，跳进水里。"},{"english":"Generally, a linear least squares problem leads to ihc solution of the so called normal equation.","chinese":"解线性最小二乘问题时，通常都要解所谓正规方程。"},{"english":"The weighted functions are obtained based on the use of completed systems of general solution of the corresponding homogeneous equations .","chinese":"权函数是得自对应的齐次微分方程的一般解和完备系。"},{"english":"A numerical study is reported on the flow over a backward-facing step.","chinese":"本文研究单边放大台阶流的数值解。"},{"english":"Or, if a matrix is not invertible, then you have infinitely many solutions.","chinese":"或者矩阵不可逆时，有无穷解。"},{"english":"The demultiplexor plays a key role in set top box(STB).","chinese":"解复用器在机顶盒中扮演了一个关键的角色。"}],"related":[{"definition":["soluble (i.e. can be solved)"],"pinyin":["ke3 jie3"],"word":"可解"},{"definition":["to explain\/to release\/Buddha (abbr. for 釋迦牟尼|释迦牟尼[Shi4 jia1 mou2 ni2])\/Buddhism"],"pinyin":["shi4"],"word":"释"},{"definition":["hard to solve\/hard to dispel\/hard to understand\/hard to undo"],"pinyin":["nan2 jie3"],"word":"难解"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["to mediate (in a conflict)\/to pacify"],"pinyin":["jie3 he2"],"word":"解和"},{"definition":["correct\/right\/so\/thus\/like this\/-ly"],"pinyin":["ran2"],"word":"然"},{"definition":["to dispel doubts\/to clear up confusion"],"pinyin":["jie3 huo4"],"word":"解惑"},{"definition":["to dispel doubts\/to clear up difficulties"],"pinyin":["shi4 yi2"],"word":"释疑"},{"definition":["to confuse\/to be puzzled"],"pinyin":["huo4"],"word":"惑"},{"definition":["to know\/to be aware"],"pinyin":["zhi1"],"word":"知"},{"definition":["to seek\/to look for\/to request\/to demand\/to beseech"],"pinyin":["qiu2"],"word":"求"},{"definition":["knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)","(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]"],"pinyin":["jie2","jie1"],"word":"结"},{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out","to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4","fu4","fu4"],"word":"复"},{"definition":["words\/speech\/to say\/to talk"],"pinyin":["yan2"],"word":"言"},{"definition":["insoluble (i.e. impossible to solve)"],"pinyin":["bu4 ke3 jie3"],"word":"不可解"},{"definition":["(literary) why\/how"],"pinyin":["he2 yi3"],"word":"何以"}]}