{"definition":["to untie\/to free\/to absolve of\/to get free of\/to extirpate oneself\/(Buddhism) to free oneself of worldly worries"],"pinyin":["jie3 tuo1"],"traditional":["解脫"],"rank":13581.0,"normalized_rank":0.1900158101660767,"fraction":0.000004936817362843684,"cumulative_fraction":0.952628115234029,"word":"解脱","characters":[{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","to transport under guard","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","surname Xie"],"pinyin":["xie4","jie4","jie3","Xie4"],"word":"解"},{"definition":["to shed\/to take off\/to escape\/to get away from"],"pinyin":["tuo1"],"word":"脱"}],"containing_words":[],"sentences":[{"english":"She freed herself of worry.","chinese":"她使自己从烦恼中解脱出来。"},{"english":"Disentangle the person's feet from the wreckage and bring the feet foward to exit.","chinese":"将伤者的脚从残骸中解脱出来，并移至靠近出口处。"},{"english":"Nirvana brings the joy of liberation.","chinese":"寂灭离苦解脱乐。"},{"english":"Absence from those we love is self from self a deadly banishment.","chinese":"脱离情人就是自我解脱，极度地放纵。"},{"english":"Liberation and awakened understanding can’t be found by devoting ourselves to the study of the Buddhist scriptures.","chinese":"解脱和觉醒无法从钻研佛经中获得。"},{"english":"He cut desperately at the rope in an attempt to free his foot.","chinese":"他拼命砍绳子，试图把自己的脚解脱开。"},{"english":"Maharaj: What do you mean by realisation and liberation?","chinese":"你所说的开悟和解脱是什么意思？"},{"english":"We want you to begin reaching for that ensuing sense of relief.","chinese":"我们希望你能够体会得到那种解脱后的轻松感。"},{"english":"Soldiers would find that a welcome relief.","chinese":"士兵们会发现他们从笨重的防护服中终得解脱。"},{"english":"But now, I can see that this is liberating.","chinese":"但是现在，我开始懂了，这是一种解脱。"},{"english":"Advocating free soul, Yebao such as reincarnation and non-violence.","chinese":"主张灵魂解脱，业报轮回和非暴力等。"},{"english":"Chapter III is about the freedom from the material pressure.","chinese":"第三章从物质环境压力的解脱谈起。"},{"english":"In one of right knowledge, right release comes into being.","chinese":"有正智的人，正解脱产生。"},{"english":"Perhaps he knew that, own iscaught instead is in kind of spiritual extricating.","chinese":"或许他知道，自己的落网反而是种精神上的解脱。"},{"english":"As your birthday month gets under way, you’ll feel a great sense of relief.","chinese":"随着蝎子们诞辰月的启动，你会感到一种解脱。"},{"english":"You have to get up and take breaks from sitting.","chinese":"帕特说“你需要站起来从久坐中解脱出来。”"}],"related":[{"definition":["to escape from the abyss of suffering\/to shed off a wretched plight"],"pinyin":["tuo1 li2 ku3 hai3"],"word":"脱离苦海"},{"definition":["pain\/suffering\/painful\/CL:個|个[ge4]"],"pinyin":["tong4 ku3"],"word":"痛苦"},{"definition":["to achieve supreme enlightenment or nirvana (Buddhism)"],"pinyin":["da4 che4 da4 wu4"],"word":"大彻大悟"},{"definition":["lit. sea of bitterness\/abyss of worldly suffering (Buddhist term)\/depths of misery"],"pinyin":["ku3 hai3"],"word":"苦海"},{"definition":["to stand aloof\/to be detached from\/to transcend worldliness\/untrammeled\/unconventional"],"pinyin":["chao1 tuo1"],"word":"超脱"},{"definition":["pain\/suffering"],"pinyin":["ku3 tong4"],"word":"苦痛"},{"definition":["fully aware\/to recognize fully"],"pinyin":["che4 wu4"],"word":"彻悟"},{"definition":["all living things"],"pinyin":["zhong4 sheng1"],"word":"众生"},{"definition":["to release (tension)\/relief (from suspense)\/to dispel (usu. with negative, unable to forget)"],"pinyin":["shi4 huai2"],"word":"释怀"},{"definition":["to abandon suffering and obtain happiness (Buddhism)"],"pinyin":["li2 ku3 de2 le4"],"word":"离苦得乐"},{"definition":["to become enlightened (Buddhism)"],"pinyin":["kai1 wu4"],"word":"开悟"},{"definition":["a flash of realization\/the truth in a flash\/a moment of enlightenment (usually Buddhist)"],"pinyin":["dun4 wu4"],"word":"顿悟"},{"definition":["to despair\/to give up all hope\/desperate\/desperation"],"pinyin":["jue2 wang4"],"word":"绝望"},{"definition":["to devote oneself to spiritual development (esp. Buddhism or Daoism)\/to devote oneself to perfecting one's art or craft"],"pinyin":["xiu1 xing2"],"word":"修行"},{"definition":["mercy"],"pinyin":["ci2 bei1"],"word":"慈悲"},{"definition":["Mara (the demon of temptation)"],"pinyin":["Mo2 zhang4"],"word":"魔障"}]}