{"definition":["to become reconciled\/to bury the hatchet"],"pinyin":["yan2 gui1 yu2 hao3"],"traditional":["言歸於好"],"rank":54089.0,"normalized_rank":0.7567752857722496,"fraction":9.12360167887076e-8,"cumulative_fraction":0.9994348020725816,"word":"言归于好","characters":[{"definition":["words\/speech\/to say\/to talk"],"pinyin":["yan2"],"word":"言"},{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"归"},{"definition":["surname Yu","to go\/to take\/sentence-final interrogative particle\/variant of 於|于[yu2]","in\/at\/to\/from\/by\/than\/out of"],"pinyin":["Yu2","yu2","yu2"],"word":"于"},{"definition":["to be fond of\/to have a tendency to\/to be prone to","good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello"],"pinyin":["hao4","hao3"],"word":"好"}],"containing_words":[],"sentences":[{"english":"He decided to square himself with his wife after their quarrel.","chinese":"争吵之后，他决定与他的妻子言归于好。"},{"english":"He even reconciled with a classmate with whom he had had trouble several years ago.","chinese":"他甚至和一位积怨多年的同学言归于好。"},{"english":"They quarrelled but now they're completely reconciled.","chinese":"他们争吵过，但现在已经完全言归于好了。"},{"english":"Miguel:I think a good friendship deserves a second chance.","chinese":"我认为深厚的友情应该有言归于好的机会。"},{"english":"He and his wife usually make up their quarrel the same day.","chinese":"他和妻子吵架通常当天就言归于好。"},{"english":"After quarrelling, the young couple did their best to make it up.","chinese":"吵过架以后，这对年青夫妇便尽力弥合，言归于好。"},{"english":"What have I done to you? I declare that I am perplexed.","chinese":"我声明要翻脸了，你得和我言归于好。"},{"english":"Can you make peace with someone after they're dead?","chinese":"在人死后你就能和他言归于好吗？"},{"english":"I'm glad that the brothers have been brought together after all their quarrels.","chinese":"我高兴地看到这兄弟俩在争吵之后言归于好了。"},{"english":"B:Do you think they'll patch things up?","chinese":"你认为他们会言归于好吗？"},{"english":"The best part of fighting is making up afterwards!","chinese":"吵架最精彩的部分就是过后言归于好。"},{"english":"We decided to patch up our differences and become friends again.","chinese":"我们决定消除我们之间的分歧，言归于好。"},{"english":"They exchanged angry words before the meeting but were finally persuaded to agree.","chinese":"他们在会议前争吵起来，经劝说非常后言归于好。"},{"english":"After dinner, I went to his area, hoping to attain it up with him.","chinese":"晚饭后我去了他那里，希望和他言归于好。"},{"english":"Marry and John quarreled, but made up after a while.","chinese":"玛丽和约翰吵架了，但过了一会儿又言归于好。"}],"related":[{"definition":["to forget former enmity (idiom)"],"pinyin":["jin4 shi4 qian2 xian2"],"word":"尽释前嫌"},{"definition":["to forget previous differences\/to bury the hatchet"],"pinyin":["bing1 shi4 qian2 xian2"],"word":"冰释前嫌"},{"definition":["to make friends again\/to renew old cordial relations"],"pinyin":["chong2 xiu1 jiu4 hao3"],"word":"重修旧好"},{"definition":["to convert an enemy into a friend (idiom)"],"pinyin":["hua4 di2 wei2 you3"],"word":"化敌为友"},{"definition":["lit. to exchange weapons of war for gifts of jade and silk (idiom)\/fig. to turn hostility into friendship"],"pinyin":["hua4 gan1 ge1 wei2 yu4 bo2"],"word":"化干戈为玉帛"},{"definition":["to become enemies (idiom); to fall out with sb"],"pinyin":["fan3 mu4 cheng2 chou2"],"word":"反目成仇"},{"definition":["to change one's mind (idiom)"],"pinyin":["hui2 xin1 zhuan3 yi4"],"word":"回心转意"},{"definition":["to settle (a dispute out of court)\/to reconcile\/settlement\/conciliation\/to become reconciled"],"pinyin":["he2 jie3"],"word":"和解"},{"definition":["to part on bad terms\/(of a meeting etc) to break up in discord"],"pinyin":["bu4 huan1 er2 san4"],"word":"不欢而散"},{"definition":["to quarrel\/to fall out with sb"],"pinyin":["fan3 mu4"],"word":"反目"},{"definition":["to quarrel\/dispute"],"pinyin":["zheng1 chao3"],"word":"争吵"},{"definition":["to dispel (enmity, misunderstandings etc)\/to vanish (of misgivings, differences of opinion)\/thaw (in relations)"],"pinyin":["bing1 shi4"],"word":"冰释"},{"definition":["lit. to take different roads and urge the horses on (idiom)\/fig. to part ways"],"pinyin":["fen1 dao4 yang2 biao1"],"word":"分道扬镳"},{"definition":["to be difficult with sb\/to provoke disagreement\/at loggerheads\/to fall out with"],"pinyin":["nao4 bie4 niu5"],"word":"闹别扭"},{"definition":["to meet on the battlefield (idiom)"],"pinyin":["bing1 rong2 xiang1 jian4"],"word":"兵戎相见"},{"definition":["to become reconciled\/on good terms with each other"],"pinyin":["he2 hao3"],"word":"和好"}]}