{"definition":["to be alert"],"pinyin":["jing3 xing3"],"traditional":["警醒"],"rank":19330.0,"normalized_rank":0.2704517789934661,"fraction":0.0000025690602551431444,"cumulative_fraction":0.9731772256299256,"word":"警醒","characters":[{"definition":["to alert\/to warn\/police"],"pinyin":["jing3"],"word":"警"},{"definition":["to wake up\/to be awake\/to become aware\/to sober up\/to come to"],"pinyin":["xing3"],"word":"醒"}],"containing_words":[],"sentences":[{"english":"In the past seven years, we've also seen images that have sobered us.","chinese":"在过去七年时间里，我们也看到令人警醒的画面。"},{"english":"Littleness and glory are the choices open to your striving and your vigilance.","chinese":"你究竟愿为卑微或为荣耀而警醒奋斗，完全操之于你。"},{"english":"The result is both realistic and hallucinatory.","chinese":"《和巴什尔跳华尔兹》也是警醒观众的噩梦。"},{"english":"Callista again stirred, after so long a slumber.","chinese":"卡莉斯塔在漫长的休眠后再次警醒。"},{"english":"At the same time I prescribed minor tranquillizers tolower her arousal levels.","chinese":"同时我给她开一些弱安定药以降低她的警醒水平。"},{"english":"Hence, as the organizers explained, books burning of this time aimed to raise the social awareness, and declare war on \"spirit rubbish\".","chinese":"公开烧书就是为了警醒社会，向“心灵垃圾”宣战。"},{"english":"This trend alarms non-tech firms.","chinese":"这个趋势警醒了非科技类公司。"},{"english":"Her family can hand out all of her professional publications at the wake.","chinese":"这也警醒她的家人尽快整理出版她的专著。"},{"english":"He enjoined me to be alert all the way for fear to catch a cold at night.","chinese":"他嘱我路上小心，夜里要警醒些，不要受凉。"},{"english":"These examples are meant to caution you, not to deter you.","chinese":"这些例子是要你警醒，而非阻拦你。"},{"english":"YET EVEN IN his deathless state, the Emperor continues his eternal vigilance.","chinese":"即使在他的假死状态中，帝皇的警醒亘古依然。"},{"english":"He then told me to be watchful all the time, and not catching cold at night.","chinese":"他嘱咐我路上小心，夜里要警醒些，不要受凉。"},{"english":"In an effort to stay alert, she drank several cups of coffee.","chinese":"在努力保持警醒的过程中，她喝了几杯咖啡。"},{"english":"Watch ye therefore, for ye know not when the master of the house cometh.","chinese":"所以汝当警醒，因不知屋主何时到来。"},{"english":"Andy: \"Watch ye, therefore, for ye know not when the master of the house cometh.\"","chinese":"所以汝当警醒，因不知屋主何时到来。"},{"english":"Besides, the pastors of the Church are here reminded of their duty.","chinese":"除此之外，这里也提醒教会的牧师们警醒。"}],"related":[{"definition":["to warn\/to alert\/warning\/cautionary"],"pinyin":["jing3 shi4"],"word":"警示"},{"definition":["alarm bell"],"pinyin":["jing3 zhong1"],"word":"警钟"},{"definition":["to warn\/to admonish"],"pinyin":["gao4 jie4"],"word":"告诫"},{"definition":["lesson\/moral\/to chide sb\/to lecture sb"],"pinyin":["jiao4 xun5"],"word":"教训"},{"definition":["to think back over sth\/to review\/to revisit\/to rethink\/reflection\/reassessment"],"pinyin":["fan3 si1"],"word":"反思"},{"definition":["to think of danger in times of safety\/to be vigilant in peacetime (idiom)"],"pinyin":["ju1 an1 si1 wei1"],"word":"居安思危"},{"definition":["to reflect upon oneself\/to examine one's conscience\/to question oneself\/to search one's soul"],"pinyin":["fan3 xing3"],"word":"反省"},{"definition":["to examine oneself\/to reflect on one's shortcomings\/introspection\/self-awareness\/self-criticism"],"pinyin":["zi4 xing3"],"word":"自省"},{"definition":["to ponder\/to consider"],"pinyin":["shen1 si1"],"word":"深思"},{"definition":["to exhort\/to admonish"],"pinyin":["quan4 jie4"],"word":"劝诫"},{"definition":["to realize suddenly\/to wake up to the truth\/to suddenly awake from sleep"],"pinyin":["meng3 xing3"],"word":"猛醒"},{"definition":["clear-headed\/sober\/awake"],"pinyin":["qing1 xing3"],"word":"清醒"},{"definition":["lit. the cart in front overturns, a warning to the following cart (idiom); fig. draw lesson from the failure of one's predecessor\/learn from past mistake\/once bitten twice shy"],"pinyin":["qian2 che1 zhi1 fu4 , hou4 che1 zhi1 jian4"],"word":"前车之覆，后车之鉴"},{"definition":["to reveal\/to enlighten\/enlightenment\/revelation\/illumination\/moral (of a story etc)\/lesson"],"pinyin":["qi3 shi4"],"word":"启示"},{"definition":["to keep in mind\/to remember"],"pinyin":["lao2 ji4"],"word":"牢记"},{"definition":["to be on the alert\/vigilant\/alert\/on guard\/to warn"],"pinyin":["jing3 ti4"],"word":"警惕"}]}