{"definition":["to concede\/to admit defeat"],"pinyin":["ren4 shu1"],"traditional":["認輸"],"rank":20371.0,"normalized_rank":0.2850167196004085,"fraction":0.0000023049867281499093,"cumulative_fraction":0.9757095657969423,"word":"认输","characters":[{"definition":["to recognize\/to know\/to admit"],"pinyin":["ren4"],"word":"认"},{"definition":["to lose\/to transport\/to donate\/to enter (a password)"],"pinyin":["shu1"],"word":"输"}],"containing_words":[],"sentences":[{"english":"There are difficulties, but being defeatist can't help.","chinese":"困难总会有，但是认输气馁却于事无补。"},{"english":"Let the heaven know my gameness.","chinese":"让苍天知道我不认输。"},{"english":"Afterwards, they have to admit defeat and make an unserious self-criticism.","chinese":"随后就是认输，做一点自我批评。"},{"english":"1970 – Biafra capitulates, ending the Nigerian civil war.","chinese":"1970年的今天，比夫拉认输，尼日利亚内战结束。"},{"english":"Fu strong woman will admit defeat, but will not admit defeat.","chinese":"乀坚强的女人会认输，但不会服输。"},{"english":"Everyone has to bow before the selfless time.","chinese":"在大公无私的时间前面，谁也不能不低头认输。"},{"english":"The project was ridiculous. Time to admit defeat.","chinese":"看来我的计划不切实际，是认输的时候了。"},{"english":"Yet perhaps it is too early for the English-speaking democracies to throw in the towel.","chinese":"然而，或许以英语为母语的民主国家认输还言之过早。"},{"english":"Claud quickened up, a man wouldn't give the battle.","chinese":"克劳德加快了速度，男子汉是不会认输的。"},{"english":"I stood aside, so I hauled down my colours.","chinese":"我退出竞选，我认输投降。"},{"english":"Never accept failure, no matter how offten it visits you. Keep on going. never give up. Never.","chinese":"即使再多失败也不能认输，坚持不懈，永不放弃。"},{"english":"They had to quit when they became aware of the fact that they could not win the game.","chinese":"他们在觉察到不可能打赢这场比赛时，只好认输。"},{"english":"Do not think for a minute that power concedes.","chinese":"一时一刻都不要以为执政党认输了。"},{"english":"With that said, companies cannot afford to throw up their hands and give up in the face of unpredictably.","chinese":"因此，公司不能在无法预知的事态前就认输甚至放弃。"},{"english":"Later they admit defeat and do a little self-criticism.","chinese":"随后就是认输，做一点自我批评。"},{"english":"I give up. Tell me the answer.","chinese":"我认输了，告诉我答案吧。"}],"related":[{"definition":["to concede\/to admit defeat\/to admit sth is wrong after insisting it is right"],"pinyin":["fu2 shu1"],"word":"服输"},{"definition":["to admit defeat\/to give in\/to acknowledge a mistake\/to apologize\/to be amenable to persuasion"],"pinyin":["fu2 ruan3"],"word":"服软"},{"definition":["to give up"],"pinyin":["ba4 shou3"],"word":"罢手"},{"definition":["lit. if you agree to bet you must accept to lose\/fig. you bet, you pay"],"pinyin":["yuan4 du3 fu2 shu1"],"word":"愿赌服输"},{"definition":["to surrender\/to succumb\/to yield\/(as a transitive verb) to defeat\/to prevail over"],"pinyin":["qu1 fu2"],"word":"屈服"},{"definition":["to stop\/to pull back"],"pinyin":["shou1 shou3"],"word":"收手"},{"definition":["to take up a challenge\/to face an attack and meet it"],"pinyin":["ying4 zhan4"],"word":"应战"},{"definition":["to take defeat with bad grace\/to be a sore loser\/cannot afford to lose"],"pinyin":["shu1 bu4 qi3"],"word":"输不起"},{"definition":["hands tied and waiting to be captured"],"pinyin":["shu4 shou3 jiu4 qin2"],"word":"束手就擒"},{"definition":["to beg forgiveness"],"pinyin":["qiu2 rao2"],"word":"求饶"},{"definition":["to move aside\/to get out of the way\/to back down\/to concede"],"pinyin":["tui4 rang4"],"word":"退让"},{"definition":["to wait helplessly for death (idiom)\/to resign oneself to extinction"],"pinyin":["shu4 shou3 dai4 bi4"],"word":"束手待毙"},{"definition":["lit. start off leniently (idiom); please do not be too strict with me\/Do not judge me too harshly.\/Look favorably on my humble efforts."],"pinyin":["shou3 xia4 liu2 qing2"],"word":"手下留情"},{"definition":["to accept misfortunes as decreed by fate\/to be resigned to sth"],"pinyin":["ren4 ming4"],"word":"认命"},{"definition":["to shrink back\/to cower"],"pinyin":["tui4 suo1"],"word":"退缩"},{"definition":["not to fight back\/to take it lying down\/to show weakness\/to show one's softer side"],"pinyin":["shi4 ruo4"],"word":"示弱"}]}