{"definition":["to get the desired outcome\/to win favor by fawning on sb\/to curry favor with\/a fruitful outcome to reward one's labor"],"pinyin":["tao3 hao3"],"traditional":["討好"],"rank":15880.0,"normalized_rank":0.22218180291858464,"fraction":0.000003725203059889647,"cumulative_fraction":0.9624960698242758,"word":"讨好","characters":[{"definition":["to invite\/to provoke\/to demand or ask for\/to send armed forces to suppress\/to denounce or condemn\/to marry (a woman)\/to discuss or study"],"pinyin":["tao3"],"word":"讨"},{"definition":["to be fond of\/to have a tendency to\/to be prone to","good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello"],"pinyin":["hao4","hao3"],"word":"好"}],"containing_words":[{"definition":["arduous and thankless task (idiom); strenuous and unrewarding"],"pinyin":["chi1 li4 bu4 tao3 hao3"],"word":"吃力不讨好"},{"definition":["arduous and thankless task (idiom); strenuous and unrewarding"],"pinyin":["fei4 li4 bu4 tao3 hao3"],"word":"费力不讨好"},{"definition":["to curry favor by showing obeisance (idiom)"],"pinyin":["tao3 hao3 mai4 guai1"],"word":"讨好卖乖"},{"definition":["to curry favor\/to get the desired outcome by flattery"],"pinyin":["feng4 cheng5 tao3 hao3"],"word":"奉承讨好"},{"definition":["to throw oneself at sb or sth\/to bend over backwards to help"],"pinyin":["pin1 ming4 tao3 hao3"],"word":"拼命讨好"}],"sentences":[{"english":"I was married at 19 in Spanish Town to a bride already courted for me.","chinese":"我19岁在西班牙城结了婚，娶了一个讨好我的妻子。"},{"english":"I used to be upset by these attempts to ingratiate .","chinese":"我以前常常对这样的“讨好”感到厌烦。"},{"english":"She tried to brownnose the boss by staying after work and helping him clean the room.","chinese":"她企图在下班后呆下来帮老板清扫房间以讨好他。"},{"english":"\"This is often a very thankless job, \" Legge says.","chinese":"莱格博士说“饭馆服务员是个费力不讨好的工作。"},{"english":"A fat gray cat rubs against her leg. It meows.","chinese":"一只肥大的灰猫讨好地抓她的腿，喵喵地叫唤着。"},{"english":"He charmed Olivia and Abby by making pancakes on Sunday mornings.","chinese":"他还在星期天早晨下厨做煎饼来讨好奥丽维娅和艾碧。"},{"english":"Is Russia cozying up to China?","chinese":"俄罗斯在讨好中国吗？"},{"english":"And it's kind of fun. They're sucking up to you.","chinese":"这挺有趣儿的，他们讨好你。"},{"english":"Less of Mr Bush's Manichaean arrogance would be welcome.","chinese":"少一些布什先生那种摩尼教徒式的傲慢将更为讨好。"},{"english":"Some said yes just to flatter him.","chinese":"有的说是，以讨好赵高。"},{"english":"The party also walks a fine line in its proposed policies toward business.","chinese":"日本民主党所提出的商业政策也是两面不讨好。"},{"english":"If you're a people pleaser, learn to say \"no\" to people this year.","chinese":"如果你总是讨好别人，今年请试着学会说“不”吧。"},{"english":"Tom was throwing himself at your sister at the party last night.","chinese":"汤姆在晚会上极力向你妹妹讨好。"},{"english":"It is a no-win dilemma.","chinese":"这可是一个两头不能讨好的难题。"},{"english":"Susch parts are often considered to be thankless, unrewarding.","chinese":"这种角色通常被变为是吃力不讨好的。"},{"english":"Ep688 - Yingming fawns on Mingming's father as he plans to woo Mingming.","chinese":"英明百般讨好明明的父亲，希望他帮忙追求明明。"}],"related":[{"definition":["to ingratiate oneself with\/to pander to"],"pinyin":["xian4 mei4"],"word":"献媚"},{"definition":["to fawn on\/to curry favor with\/to make up to"],"pinyin":["ba1 jie5"],"word":"巴结"},{"definition":["favor\/liking\/love\/jubilation\/joy"],"pinyin":["huan1 xin1"],"word":"欢心"},{"definition":["to fawn on\/to flatter\/to ingratiate oneself\/flattery"],"pinyin":["feng4 cheng5"],"word":"奉承"},{"definition":["to try to please"],"pinyin":["qu3 yue4"],"word":"取悦"},{"definition":["to express goodwill\/to be friendly"],"pinyin":["shi4 hao3"],"word":"示好"},{"definition":["to bow and bend the knee (idiom); fawning\/bending and scraping to curry favor"],"pinyin":["bei1 gong1 qu1 xi1"],"word":"卑躬屈膝"},{"definition":["to bow down to everything sb says or does\/to act submissively in order to ingratiate oneself"],"pinyin":["qu1 yi4 feng2 ying2"],"word":"曲意逢迎"},{"definition":["to flatter"],"pinyin":["chan3 mei4"],"word":"谄媚"},{"definition":["to be particularly attentive to (an attractive young lady or man etc)\/to fawn upon (an influential politician etc)\/to court sb's favor\/to ingratiate oneself"],"pinyin":["xian4 yin1 qin2"],"word":"献殷勤"},{"definition":["to flatter\/to fawn on\/to butter sb up\/toadying\/bootlicking"],"pinyin":["pai1 ma3 pi4"],"word":"拍马屁"},{"definition":["to accept a compromise"],"pinyin":["wei3 qu1 qiu2 quan2"],"word":"委曲求全"},{"definition":["servile"],"pinyin":["di1 san1 xia4 si4"],"word":"低三下四"},{"definition":["to worm one's way into being friends with sb (usually derogatory)"],"pinyin":["tao4 jin4 hu1"],"word":"套近乎"},{"definition":["to rack one's brains (idiom); to take great pains to think sth through"],"pinyin":["fei4 jin4 xin1 si5"],"word":"费尽心思"},{"definition":["to smooth whiskers and pat a horse's bottom (idiom); to use flatter to get what one wants\/to toady\/boot-licking"],"pinyin":["liu1 xu1 pai1 ma3"],"word":"溜须拍马"}]}