{"definition":["to concede\/to give in\/to yield\/a concession\/(linguistics) concessive"],"pinyin":["rang4 bu4"],"traditional":["讓步"],"rank":9392.0,"normalized_rank":0.13140626530298155,"fraction":0.000009196736469928587,"cumulative_fraction":0.9244096873116262,"word":"让步","characters":[{"definition":["to yield\/to permit\/to let sb do sth\/to have sb do sth\/to make sb (feel sad etc)\/by (indicates the agent in a passive clause, like 被[bei4])"],"pinyin":["rang4"],"word":"让"},{"definition":["surname Bu","a step\/a pace\/walk\/march\/stages in a process\/situation"],"pinyin":["Bu4","bu4"],"word":"步"}],"containing_words":[],"sentences":[{"english":"We are now in no way to make any further concession in price.","chinese":"我们应经无法再在价格方面做出让步了。"},{"english":"He had to hit the bullet and give into his boss's unreasonable demands.","chinese":"是他勉为其难，让步接受了老板的苛刻要求。"},{"english":"Or maybe it is because trees, in the scheme of development, provide an easy compromise.","chinese":"又或许是在发展的进程表中，树让人更容易让步。"},{"english":"Looking back on it, I wish we hadn t been given in so easily.","chinese":"回过头来看，我希望我们没有这样轻易让步。"},{"english":"He wanted to stare me down on the price.","chinese":"他想让我在价格上做出让步。"},{"english":"The government refused to budge.","chinese":"但政府拒绝作出让步。"},{"english":"Unprincipled concessions in diplomacy led to a crushing failure in real politics.","chinese":"外交上无原则的让步导致政治上一场毁灭性的失败。"},{"english":"In case there is a collision of characters Libra should concede.","chinese":"当出现性格上的碰撞时，天秤需要做出让步。"},{"english":"We must make some concession to the weakness of old age .","chinese":"我们要向老年虚弱者让步。"},{"english":"But he and others stressed that these concessions did not affect the overall targets.","chinese":"但是他和其他的议员强调这些让步并不影响整个大局。"},{"english":"Are the concessions by both sides an even trade?","chinese":"这种双边的让步是一个相等的交易吗？"},{"english":"At last, the Americans threw ih the towel on the television programming and film issue.","chinese":"最后，美国在电视节目和电影问题上作出了让步。"},{"english":"He gave in only at the last moment because he had no alternative .","chinese":"他只是在最后一刻因为没有选择才作了让步。"},{"english":"After being confronted with our evidence, the other side had to back down.","chinese":"面对我们摆出来的证据，对方只得作出让步。"},{"english":"We may consider making some concession in our price.","chinese":"在价格上，我们可以考虑作一些让步。"},{"english":"The Chinese media have dubbed her \"the stubborn nail\" for her refusal to give up.","chinese":"中国媒体将她拒绝让步的行为戏称为“钉子户”。"}],"related":[{"definition":["to move aside\/to get out of the way\/to back down\/to concede"],"pinyin":["tui4 rang4"],"word":"退让"},{"definition":["to compromise\/to reach terms\/a compromise"],"pinyin":["tuo3 xie2"],"word":"妥协"},{"definition":["to admit defeat\/to give in\/to acknowledge a mistake\/to apologize\/to be amenable to persuasion"],"pinyin":["fu2 ruan3"],"word":"服软"},{"definition":["to express goodwill\/to be friendly"],"pinyin":["shi4 hao3"],"word":"示好"},{"definition":["to contend on strong grounds\/to argue strongly for what is right"],"pinyin":["ju4 li3 li4 zheng1"],"word":"据理力争"},{"definition":["to settle (a dispute out of court)\/to reconcile\/settlement\/conciliation\/to become reconciled"],"pinyin":["he2 jie3"],"word":"和解"},{"definition":["unyielding attitude"],"pinyin":["qiang2 ying4 tai4 du4"],"word":"强硬态度"},{"definition":["to negotiate\/negotiation\/talks\/conference\/CL:個|个[ge4]"],"pinyin":["tan2 pan4"],"word":"谈判"},{"definition":["to declare one's position\/to say where one stands"],"pinyin":["biao3 tai4"],"word":"表态"},{"definition":["to surrender\/to succumb\/to yield\/(as a transitive verb) to defeat\/to prevail over"],"pinyin":["qu1 fu2"],"word":"屈服"},{"definition":["to bare one shoulder\/(fig.) to side with\/to discriminate in favor of"],"pinyin":["pian1 tan3"],"word":"偏袒"},{"definition":["to pressure"],"pinyin":["shi1 ya1"],"word":"施压"},{"definition":["to exercise forbearance\/patient and accommodating"],"pinyin":["ren3 rang4"],"word":"忍让"},{"definition":["peace talks"],"pinyin":["he2 tan2"],"word":"和谈"},{"definition":["to put up with\/to tolerate"],"pinyin":["rong2 ren3"],"word":"容忍"},{"definition":["divergent\/difference (of opinion, position)\/disagreement\/bifurcation (math.)"],"pinyin":["fen1 qi2"],"word":"分歧"}]}