{"definition":["to preach\/a sermon"],"pinyin":["jiang3 dao4"],"traditional":["講道"],"rank":38980.0,"normalized_rank":0.5453807731590951,"fraction":4.2275120739215543e-7,"cumulative_fraction":0.9960773668710636,"word":"讲道","characters":[{"definition":["to speak\/to explain\/to negotiate\/to emphasise\/to be particular about\/as far as sth is concerned\/speech\/lecture"],"pinyin":["jiang3"],"word":"讲"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"}],"containing_words":[{"definition":["present the facts and reason things out"],"pinyin":["bai3 shi4 shi2 jiang3 dao4 li3"],"word":"摆事实讲道理"}],"sentences":[{"english":"Reasoning does not seem to work with them.","chinese":"跟他们讲道理似乎不管用。"},{"english":"This is the glory of expository preaching, we were told.","chinese":"有人说，这是释经讲道的荣耀。"},{"english":"Even though you are fairily beautiful you need to be logical with others.","chinese":"即使你美若天仙，做什么事情还是要讲道理的。"},{"english":"Pray for Pastor Don Baron who was sick and felt dizzy on last Sunday while he was preaching.","chinese":"为柏大恩牧师祷告，上主日讲道时他感到身体不适。"},{"english":"A bully is not reasonable - he is persuaded only by threats.","chinese":"跟恶棍无法讲道理，恶棍只能以威吓劝说。"},{"english":"But he that prophesieth speaketh unto men to edification, and exhortation, and comfort.","chinese":"但作先知讲道的，是对人说，要造就，安慰，劝勉人。"},{"english":"Conviction of preacher passes into truth of hearers .","chinese":"讲道者的信念，使听者扎心知罪，认识真理。"},{"english":"We need to lay the facts bare, be reasonable and more so, the numbers to talk about.","chinese":"我们需要摆事实，讲道理，更需要数字来说话。"},{"english":"\"Some were thrilled that Caesar had died, and some were horrified, \" he said.","chinese":"“对于凯撒的死，有人激动，有人惊悸，”他讲道。"},{"english":"My Dad scribbles a few words on a piece of paper, he calls it a sermon.","chinese":"我的父亲在一张纸上随便写，他称这是讲道。"},{"english":"China has long been one of the most strait-laced nations around.","chinese":"中国长久以来是世界各国里最讲道德礼貌的国家。"},{"english":"He blew the trumpet and used drum to let people hear him before he started preaching.","chinese":"在他开始讲道之前，他会吹喇叭并打鼓来让人听见。"},{"english":"Of course, when engaging in criticism we should present facts, reason things out and guard against being one-sided.","chinese":"当然，批判的时候要摆事实，讲道理，防止片面性。"},{"english":"He thought of his paper as a pulpit.","chinese":"他当初把这份报纸当做一个讲道坛。"},{"english":"Who teaches a sermon series on Habakkuk?","chinese":"谁会关于哈巴谷进行一系列的讲道？"},{"english":"Do not preach the Lord a sermon in your long prayers.","chinese":"切莫在你冗长的祷告中向主作一番讲道。"}],"related":[{"definition":["sermon\/to sermonize\/to preach\/to evangelize","to preach (the Christian gospel)"],"pinyin":["bu4 dao4","bu4 dao4"],"word":"布道"},{"definition":["to interrupt (sb talking)\/to butt in\/to cut into a conversation"],"pinyin":["cha1 zui3"],"word":"插嘴"},{"definition":["Christian priest or clergyman\/(spiritual) father"],"pinyin":["shen2 fu5"],"word":"神父"},{"definition":["to interrupt (sb speaking)\/interruption\/digression"],"pinyin":["cha1 hua4"],"word":"插话"},{"definition":["Holy Ghost\/Holy Spirit"],"pinyin":["Sheng4 ling2"],"word":"圣灵"},{"definition":["High Priest"],"pinyin":["da4 ji4 si1"],"word":"大祭司"},{"definition":["prophet"],"pinyin":["xian1 zhi1"],"word":"先知"},{"definition":["paraphernalia of a guard of honor","to perform one's job\/attendant\/job\/duties\/(respectful appellation for the addressee) you\/your Excellency\/(Church) deacon"],"pinyin":["zhi2 shi5","zhi2 shi4"],"word":"执事"},{"definition":["pope"],"pinyin":["jiao4 zong1"],"word":"教宗"},{"definition":["priest"],"pinyin":["ji4 si1"],"word":"祭司"},{"definition":["to discuss\/reason (behind sth)","to state\/to say (the quoted words)"],"pinyin":["shuo1 dao5","shuo1 dao4"],"word":"说道"},{"definition":["to talk to oneself\/to think aloud\/to soliloquize"],"pinyin":["zi4 yan2 zi4 yu3"],"word":"自言自语"},{"definition":["to refine with fire"],"pinyin":["shi4 lian4"],"word":"试炼"},{"definition":["temple"],"pinyin":["sheng4 dian4"],"word":"圣殿"},{"definition":["human sympathy\/humanitarianism\/humane\/the \"human way\", one of the stages in the cycle of reincarnation (Buddhism)\/sexual intercourse"],"pinyin":["ren2 dao4"],"word":"人道"},{"definition":["to curl one's lip\/to twitch one's mouth"],"pinyin":["pie3 zui3"],"word":"撇嘴"}]}