{"definition":["to extort under false pretenses\/to blackmail\/to bluff\/to defraud"],"pinyin":["e2 zha4"],"traditional":["訛詐"],"rank":37964.0,"normalized_rank":0.5311656149874778,"fraction":4.6566862968956356e-7,"cumulative_fraction":0.9956261450631936,"word":"讹诈","characters":[{"definition":["variant of 訛|讹[e2]","error\/false\/to extort"],"pinyin":["e2","e2"],"word":"讹"},{"definition":["to cheat\/to swindle\/to pretend\/to feign\/to draw sb out\/to try to extract information by deceit or bluff"],"pinyin":["zha4"],"word":"诈"}],"containing_words":[],"sentences":[{"english":"Chinais incapable of, and does not wish to protect itself from nuclear blackmail.","chinese":"中国无力，同时也不希望保护自己免受核讹诈。"},{"english":"That woman is wanted in 5 states for credit-card fraud.","chinese":"那位妇女因信誉卡讹诈而被5个州通缉。"},{"english":"Their policy of nuclear blackmail has fallen through.","chinese":"他们的核讹诈政策破产了。"},{"english":"America and the world will not be blackmailed . Applause.","chinese":"美国和整个世界是不会接受这种讹诈的。"},{"english":"The Chinese government has from the beginning opposed nuclear blackmail and the nuclear deterrent policy.","chinese":"中国政府历来反对核讹诈和核威慑政策。"},{"english":"And finally, the Madoff scandal continues to provoke extreme horror.","chinese":"最后，马多夫讹诈案阴霾未散，恐惧的气氛依然存在。"},{"english":"I don't believe the policy of power politics can blackmail us into submission.","chinese":"我们不信实力政策能够讹诈我们屈服。"},{"english":"The thieves bride-kidnapping sunflower blackmail to tokugawa, but get away but met are dragon.","chinese":"小偷们欲掳走葵花讹诈德川，但逃走时却遇上正龙。"},{"english":"He extorted money from poor farmers under false pretences.","chinese":"他讹诈穷苦农民的钱财。"},{"english":"I feel like I've been gypped.","chinese":"我觉得我好像被讹诈了。"},{"english":"I'm never prepared to surrender to blackmail.","chinese":"我根本不准备向讹诈屈服。"},{"english":"The strange man tried to blackmail the clerk into helping him draw the money, but he failed.","chinese":"陌生人想讹诈职员迫使他帮他取出钱，但未能得逞。"},{"english":"The foreign minister declared in a statement to the press that he would never submit to blackmail.","chinese":"外长在向新闻界发表的声明中宣称他决不屈服于讹诈。"},{"english":"He in the name of the security bureau, a sinner, eight gold bar.","chinese":"他以保安局的名义，讹诈了八根金条。"}],"related":[{"definition":["to blackmail\/to extort"],"pinyin":["e2 ren2"],"word":"讹人"},{"definition":["to rip off\/to extort (money)\/extortion\/blackmail"],"pinyin":["qiao1 zha4"],"word":"敲诈"},{"definition":["to blackmail\/to extort"],"pinyin":["le4 suo3"],"word":"勒索"},{"definition":["extortion by taking advantage of sb's weakness"],"pinyin":["qiao1 zhu2 gang4"],"word":"敲竹杠"},{"definition":["variant of 訛|讹[e2]","error\/false\/to extort"],"pinyin":["e2","e2"],"word":"讹"},{"definition":["to make a false countercharge"],"pinyin":["fan3 yao3 yi1 kou3"],"word":"反咬一口"},{"definition":["extortion and blackmail (idiom)"],"pinyin":["qiao1 zha4 le4 suo3"],"word":"敲诈勒索"},{"definition":["to renege on a debt"],"pinyin":["lai4 zhang4"],"word":"赖账"},{"definition":["lit. to strike with a muckrake (idiom), cf Pigsy 豬八戒|猪八戒 in Journey to the West 西遊記|西游记; fig. to counterattack\/to make bogus accusations (against one's victim)"],"pinyin":["dao4 da3 yi1 pa2"],"word":"倒打一耙"},{"definition":["to loot a burning house\/to profit from sb's misfortune (idiom)"],"pinyin":["chen4 huo3 da3 jie2"],"word":"趁火打劫"},{"definition":["to settle privately\/to solve behind closed doors\/to settle out of court"],"pinyin":["si1 liao3"],"word":"私了"},{"definition":["to accuse falsely"],"pinyin":["wu1 lai4"],"word":"诬赖"},{"definition":["to entrap\/to frame\/to plant false evidence against sb"],"pinyin":["wu1 xian4"],"word":"诬陷"},{"definition":["to frame sb (by planting sth on them)"],"pinyin":["zai1 zang1"],"word":"栽赃"},{"definition":["to swindle\/to defraud"],"pinyin":["zha4 qu3"],"word":"诈取"},{"definition":["(coll.) to scam sb by setting up an \"accident\" in which one appears to have sustained damage or injury caused by the scam victim, then demanding compensation (variations include putting \"expensive\" porcelain in a place where it is likely to be knocked over by passers-by, and stepping into the path of a slow-moving car)"],"pinyin":["peng4 ci2"],"word":"碰瓷"}]}