{"definition":["to grumble\/to complain\/grievance"],"pinyin":["su4 ku3"],"traditional":["訴苦"],"rank":19723.0,"normalized_rank":0.27595035887677866,"fraction":0.000002463664408548829,"cumulative_fraction":0.9741650584205656,"word":"诉苦","characters":[{"definition":["variant of 訴|诉[su4]","to complain\/to sue\/to tell"],"pinyin":["su4","su4"],"word":"诉"},{"definition":["bitter\/hardship\/pain\/to suffer\/to bring suffering to\/painstakingly"],"pinyin":["ku3"],"word":"苦"}],"containing_words":[],"sentences":[{"english":"She start complaining and m aunts, said m blue too have an idea.","chinese":"罗梅开始和米婶诉苦，说米蓝“太”有主意了。"},{"english":"Tassels on the horns of a dilemma, back to the husbands family and no steps, had to find treasure complex complaint.","chinese":"流苏进退两难，回婆家又没台阶，只得找宝络诉苦。"},{"english":"Workers complain to the boss of their overwork.","chinese":"因为工作过度，工人向老板诉苦。"},{"english":"But I would not sadden you by the mortal plaint.","chinese":"但是我不会用这致命的诉苦来使你忧伤。"},{"english":"He sat in a corner of the room canting and whining.","chinese":"他坐在房间的一个角落里一边哀求一边诉苦。"},{"english":"The old woman bleated (out) her complaints.","chinese":"老妇人以颤抖的声音诉苦。"},{"english":"He who makes constish complaint gets little compbuttion.","chinese":"时常诉苦衔恨，难以取得怜悯。"},{"english":"Mmuch people complain that computers take over their jobaloney.","chinese":"许多人诉苦说计算机正在收受人的作事。"},{"english":"A tramp came and made a poor mouth to Mrs Robeson.","chinese":"一流浪汉走来向罗伯逊夫人叫穷诉苦。"},{"english":"Bing and argue, honor with customers, we appealed to grasp bitterness toward refers to a third party.","chinese":"秉又与客户争执，荣劝解秉，秉向荣诉苦指有第三者。"},{"english":"Palmer the temple to find their own lover complaining of elder sister Ann.","chinese":"帕巴坦去找自己的相好颂安大姐诉苦。"},{"english":"Naomi gets into God's story by complaining.","chinese":"拿俄米在神的故事中以诉苦出场。"},{"english":"Then don’t complain to me when Spanish gets boring.","chinese":"当你觉得西班牙语令你厌烦的时候，别向我诉苦。"},{"english":"His amiability condemns him to being a constant listener to other people's troubles.","chinese":"他的和蔼可亲使他经常处于倾听他人诉苦的地位。"},{"english":"Meaning : (Informal) To complain naggingly or constantly; grumble.","chinese":"诉苦，发牢骚之意。"},{"english":"Her constant complaining just sticks in my craw .","chinese":"她那不断的诉苦真使我受不了。"}],"related":[{"definition":["to lament\/to complain tearfully\/to wail accusingly"],"pinyin":["ku1 su4"],"word":"哭诉"},{"definition":["to have bitter digestive fluids rising to the mouth\/fig. to complain bitterly\/to pour out one's sufferings"],"pinyin":["tu3 ku3 shui3"],"word":"吐苦水"},{"definition":["to pour out one's grievances"],"pinyin":["dao4 ku3 shui3"],"word":"倒苦水"},{"definition":["to whine\/to be grouchy"],"pinyin":["fa1 lao2 sao1"],"word":"发牢骚"},{"definition":["to complain\/to grumble\/to harbor a complaint\/to feel dissatisfied"],"pinyin":["bao4 yuan4"],"word":"抱怨"},{"definition":["to recount\/to tell of\/to relate\/(fig.) (of a thing) to stand as testament to (some past history)"],"pinyin":["su4 shuo1"],"word":"诉说"},{"definition":["to tell on sb\/to complain (to a teacher, a superior etc)\/to bring a lawsuit"],"pinyin":["gao4 zhuang4"],"word":"告状"},{"definition":["to pour forth (one's opinions)"],"pinyin":["tu3 su4"],"word":"吐诉"},{"definition":["to bewail one's poverty\/to complain about being hard up\/to pretend to be poor"],"pinyin":["ku1 qiong2"],"word":"哭穷"},{"definition":["lit. belly full of complaints (idiom)\/discontent\/always moaning and complaining"],"pinyin":["man3 fu4 lao2 sao1"],"word":"满腹牢骚"},{"definition":["bitter water (e.g. mineral water containing sulfates)\/suffering\/digestive fluids rising from stomach to the mouth\/fig. bitter complaint"],"pinyin":["ku3 shui3"],"word":"苦水"},{"definition":["to comfort\/to console\/CL:個|个[ge4]"],"pinyin":["an1 wei4"],"word":"安慰"},{"definition":["to feel wronged\/to cause sb to feel wronged\/grievance"],"pinyin":["wei3 qu5"],"word":"委屈"},{"definition":["sighing voice, wailing breath (idiom)\/to heave deep sighs\/to sigh in despair"],"pinyin":["ai1 sheng1 tan4 qi4"],"word":"唉声叹气"},{"definition":["to complain\/to grumble (about)\/to reproach\/to blame"],"pinyin":["man2 yuan4"],"word":"埋怨"},{"definition":["to accuse\/to denounce\/to make a complaint against\/denunciation"],"pinyin":["kong4 su4"],"word":"控诉"}]}