{"definition":["diagnosis\/to diagnose"],"pinyin":["zhen3 duan4"],"traditional":["診斷"],"rank":4339.0,"normalized_rank":0.06070823947504653,"fraction":0.000029727029911790728,"cumulative_fraction":0.841313861219448,"word":"诊断","characters":[{"definition":["to examine or treat medically"],"pinyin":["zhen3"],"word":"诊"},{"definition":["to break\/to snap\/to cut off\/to give up or abstain from sth\/to judge\/(usu. used in the negative) absolutely\/definitely\/decidedly"],"pinyin":["duan4"],"word":"断"}],"containing_words":[],"sentences":[{"english":"Objective To investigate the value of ultrasound in the diagnosis of theca cell tumor.","chinese":"目的探讨超声检查在卵泡膜细胞瘤诊断中的价值。"},{"english":"Investigations led to the diagnosis and treatment of subclavian artery stenosis.","chinese":"检查明确锁骨下动脉狭窄的诊断和治疗。"},{"english":"Objective To explore the diagnosis and treatment features of pulmonary heart disease caused by tuberculosis.","chinese":"目的探讨肺结核所致肺心病的诊断和治疗特点。"},{"english":"Objective To study the clinical diagnosis of B-mode ultrasound to gynecologic acute abdomen.","chinese":"目的探讨B型超声对妇科急腹症的临床诊断价值。"},{"english":"Aim To investigate the treatment and clinical diagnosis of right lower-abdominal mass.","chinese":"目的探讨右下腹包块的临床诊断与治疗。"},{"english":"Objective To explain the diagnosis and treatment of retrobulbar hematoma after baggy eye-plasty.","chinese":"目的介绍眼袋成形术并发球后血肿的诊断和治疗。"},{"english":"Objective To improve the performance level and awareness of CT imaging with brain abscess .","chinese":"目的提高对脑脓肿CT影像学表现的认识和诊断水平。"},{"english":"Objective To evaluate the value of high frequency ultrasound in diagnosis of trauma of tendo calcaneus.","chinese":"目的探讨高频超声对跟腱损伤的诊断价值。"},{"english":"The downside is that you won't get a formal diagnosis nor prescription.","chinese":"不足之处是你无法得到正式的诊断书及处方。"},{"english":"Demonstrate ability to diagnose and discuss the etiologies of vesicular and bullous skin lesions.","chinese":"学习诊断及探讨水疱及大疱皮肤病变之病因。"},{"english":"Diagnosis was established on clinical findings and the barium enema examination.","chinese":"诊断主要依靠临床表现和钡剂灌肠透视。"},{"english":"Objective To review the experience of diagnosis and surgical treatment for giant tumor of mediastinum.","chinese":"目的探讨巨大纵隔肿瘤的诊断和外科治疗经验。"},{"english":"ABSTRACT OBJECTIVE:To determine the value of color Doppler ultrasound examination in diagnosis of testis and epididymis diseases.","chinese":"探讨彩色多普勒超声检查诊断睾丸附睾疾病的价值。"},{"english":"Objective To study the diagnostic value of diaphragm activity range to foreign body transmitted X-rays in bronchus.","chinese":"目的评价横膈动度对透X线性支气管异物的诊断价值。"},{"english":"Objective To discuss the diagnosis and treatment of the upper urinary tract calculi in pregnant woman.","chinese":"目的探讨妊娠期上尿路结石的诊断和治疗方法。"},{"english":"Objective To explore the clinical value of B-Type ultrasonic diagnosis of clonorchiosis.","chinese":"目的探讨利用B型超声诊断华支睾吸虫病的临床价值。"}],"related":[{"definition":["to make a definite diagnosis\/confirmed (case of a specific disease)"],"pinyin":["que4 zhen3"],"word":"确诊"},{"definition":["to diagnose and treat"],"pinyin":["zhen3 zhi4"],"word":"诊治"},{"definition":["to treat (an illness)\/medical treatment\/therapy"],"pinyin":["zhi4 liao2"],"word":"治疗"},{"definition":["consultation (medical)\/to meet for diagnosis\/(by extension) consultation of different specialists"],"pinyin":["hui4 zhen3"],"word":"会诊"},{"definition":["cause of disease\/pathogen"],"pinyin":["bing4 yin1"],"word":"病因"},{"definition":["doctor\/CL:個|个[ge4],位[wei4],名[ming2]"],"pinyin":["yi1 sheng1"],"word":"医生"},{"definition":["to receive hospital treatment\/to be hospitalized"],"pinyin":["zhu4 yuan4 zhi4 liao2"],"word":"住院治疗"},{"definition":["state of an illness\/patient's condition"],"pinyin":["bing4 qing2"],"word":"病情"},{"definition":["to enter hospital\/to be hospitalized"],"pinyin":["ru4 yuan4"],"word":"入院"},{"definition":["medical history"],"pinyin":["bing4 shi3"],"word":"病史"},{"definition":["(medical) case\/occurrence of illness"],"pinyin":["bing4 li4"],"word":"病例"},{"definition":["pathology"],"pinyin":["bing4 li3"],"word":"病理"},{"definition":["disease\/illness"],"pinyin":["bing4 zheng4"],"word":"病症"},{"definition":["diagnosis and treatment"],"pinyin":["zhen3 liao2"],"word":"诊疗"},{"definition":["to contract (an illness)\/to be afflicted with\/to suffer from"],"pinyin":["huan4 you3"],"word":"患有"},{"definition":["to see a doctor\/to seek medical advice"],"pinyin":["jiu4 zhen3"],"word":"就诊"}]}