{"definition":["unable to say"],"pinyin":["shuo1 bu5 chu1"],"traditional":["說不出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"说不出","characters":[{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)","variant of 說|说[shuo1]"],"pinyin":["shui4","shuo1","shuo1"],"word":"说"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[{"definition":["having unspeakable bitter suffering\/(often used after 啞巴吃黃連|哑巴吃黄连[ya3 ba5 chi1 huang2 lian2])"],"pinyin":["you3 ku3 shuo1 bu5 chu1"],"word":"有苦说不出"},{"definition":["to be forced to suffer in silence (idiom)\/unable to speak of one's bitter suffering\/sometimes written 啞子吃黃連，有苦說不出|哑子吃黄连，有苦说不出"],"pinyin":["ya3 ba5 chi1 huang2 lian2 , you3 ku3 shuo1 bu5 chu1"],"word":"哑巴吃黄连，有苦说不出"},{"definition":["speechless"],"pinyin":["shuo1 bu4 chu1 hua4 lai2"],"word":"说不出话来"}],"sentences":[{"english":"On my first day of school, I didn't speak a word of English.","chinese":"当我第一天上学时，我连一个英文单词都说不出口。"},{"english":"In the process, what must be spoken meets what cannot be said.","chinese":"其间，非说不可的遇到了说不出来的。"},{"english":"But the little squirrel too tired to say a word.","chinese":"可是小松鼠累得说不出一句话来了。"},{"english":"Cora tried to speak, but the words wouldn't come out.","chinese":"柯拉想要说话，但是话说不出来。"},{"english":"Why did she have the kind of unspeakable loneliness?","chinese":"为什么她会有那种说不出的孤寂感？"},{"english":"The who was mute with shock was Safiyah, the other one was her cousin.","chinese":"害怕的说不出话的是索菲娅，另一个是她的表姐妹。"},{"english":"He tried to say something, butgulp, and no word come.","chinese":"他想说什么，但哽住了，什么话都说不出来。"},{"english":"That is one of the unsayable truths of our time.","chinese":"这就是我们这个时代说不出口的事实。"},{"english":"She was too angry to say a word.","chinese":"她太生气了以致于说不出一句话。"},{"english":"Jill was so shocked by the bad news that she couldn't say a single word.","chinese":"杰尔听到这个坏消息震惊得一个字都说不出来。"},{"english":"I suddenly felt very worried, but could not say anything.","chinese":"我突然非常着急起来，但却什么也说不出来。"},{"english":"Groanings which cannot be uttered are often prayers which cannot be refused.","chinese":"说不出来的叹息，常是不能拒绝的祷告。"},{"english":"I can’t tell what will happen.","chinese":"我可说不出将会发生什么事。"},{"english":"Listening to sad songs, singing is not for me to say the mood.","chinese":"听着忧伤的歌，唱的全是我说不出的心情。"},{"english":"Too proud of me to speak!","chinese":"过于为我“骄傲”而说不出话。"},{"english":"She was silent, and I guessed at her unutterable depression.","chinese":"她不说话了，但我猜她有满腔说不出的郁闷。"}],"related":[]}