{"definition":["it's easier to invite the devil in than to send him away"],"pinyin":["qing3 shen2 rong2 yi4 song4 shen2 nan2"],"traditional":["請神容易送神難"],"rank":60427.0,"normalized_rank":0.8454521287759014,"fraction":3.897602637213589e-8,"cumulative_fraction":0.9998321039784412,"word":"请神容易送神难","characters":[{"definition":["to ask\/to invite\/please (do sth)\/to treat (to a meal etc)\/to request"],"pinyin":["qing3"],"word":"请"},{"definition":["God\/abbr. for 神舟[Shen2 zhou1]","deity\/soul\/spirit\/unusual\/mysterious\/lively\/expressive\/expression\/look\/CL:個|个[ge4]\/(slang) awesome\/amazing"],"pinyin":["Shen2","shen2"],"word":"神"},{"definition":["surname Rong","to hold\/to contain\/to allow\/to tolerate\/appearance\/look\/countenance"],"pinyin":["Rong2","rong2"],"word":"容"},{"definition":["easy\/amiable\/to change\/to exchange\/prefix corresponding to the English adjective suffix \"-able\" or \"-ible\"","surname Yi\/abbr. for 易經|易经[Yi4 jing1], the Book of Changes"],"pinyin":["yi4","Yi4"],"word":"易"},{"definition":["to deliver\/to carry\/to give (as a present)\/to present (with)\/to see off\/to send"],"pinyin":["song4"],"word":"送"},{"definition":["God\/abbr. for 神舟[Shen2 zhou1]","deity\/soul\/spirit\/unusual\/mysterious\/lively\/expressive\/expression\/look\/CL:個|个[ge4]\/(slang) awesome\/amazing"],"pinyin":["Shen2","shen2"],"word":"神"},{"definition":["difficult (to...)\/problem\/difficulty\/difficult\/not good","disaster\/distress\/to scold"],"pinyin":["nan2","nan4"],"word":"难"}],"containing_words":[],"sentences":[],"related":[{"definition":["lit. strong dragon cannot repress a snake (idiom); fig. a local gangster who is above the law"],"pinyin":["qiang2 long2 bu4 ya1 di4 tou2 she2"],"word":"强龙不压地头蛇"},{"definition":["lit. to nurture a tiger invites calamity\/fig. to indulge one's enemy is asking for trouble (idiom)"],"pinyin":["yang3 hu3 wei2 huan4"],"word":"养虎为患"},{"definition":["to show the wolf into the house (idiom)\/to introduce a potential source of trouble"],"pinyin":["yin3 lang2 ru4 shi4"],"word":"引狼入室"},{"definition":["lit. to kill the donkey when the grinding is done (idiom)\/to get rid of sb once he has ceased to be useful"],"pinyin":["xie4 mo4 sha1 lu:2"],"word":"卸磨杀驴"},{"definition":["lit. to destroy the bridge after crossing the river (idiom)\/fig. to abandon one's benefactor upon achieving one's goal"],"pinyin":["guo4 he2 chai1 qiao2"],"word":"过河拆桥"},{"definition":["to crush one's own foot while trying to maneuver a rock (to a cliff edge, to drop on one's enemy) (idiom)\/hoisted by one's own petard"],"pinyin":["ban1 qi3 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬起石头砸自己的脚"},{"definition":["He who comes is surely ill-intentioned, no-one well-meaning will come (idiom).\/Be careful not to trust foreigners.\/Beware of Greeks bearing gifts!"],"pinyin":["lai2 zhe3 bu4 shan4 , shan4 zhe3 bu4 lai2"],"word":"来者不善，善者不来"},{"definition":["lit. to try to steal a chicken only to end up losing the rice used to lure it (idiom)\/fig. to try to gain an advantage only to end up worse off\/to go for wool and come back shorn"],"pinyin":["tou1 ji1 bu4 cheng2 shi2 ba3 mi3"],"word":"偷鸡不成蚀把米"},{"definition":["a centipede dies but never falls down\/old institutions die hard"],"pinyin":["bai3 zu2 zhi1 chong2 si3 er2 bu4 jiang1"],"word":"百足之虫死而不僵"},{"definition":["lit. easy to dodge the spear in the open, hard to avoid a stab in the dark (idiom); it is hard to guard against secret conspiracies"],"pinyin":["ming2 qiang1 yi4 duo3 , an4 jian4 nan2 fang2"],"word":"明枪易躲，暗箭难防"},{"definition":["lit. a lamb in a tiger's den (idiom)\/fig. to tread dangerous ground"],"pinyin":["yang2 ru4 hu3 kou3"],"word":"羊入虎口"},{"definition":["Beware of suspicious folk bearing gifts, they are sure to be ill-intentioned. (idiom)"],"pinyin":["huang2 shu3 lang2 gei3 ji1 bai4 nian2"],"word":"黄鼠狼给鸡拜年"},{"definition":["a man who is never content is like a snake trying to swallow an elephant (idiom)"],"pinyin":["ren2 xin1 bu4 zu2 she2 tun1 xiang4"],"word":"人心不足蛇吞象"},{"definition":["if you ride a tiger, it's hard to get off (idiom); fig. impossible to stop halfway"],"pinyin":["qi2 hu3 nan2 xia4"],"word":"骑虎难下"},{"definition":["to fall out with sb and become hostile"],"pinyin":["fan1 lian3 bu4 ren4 ren2"],"word":"翻脸不认人"},{"definition":["one who is not prepared to risk his child will never catch the wolf (proverb)\/(fig.) one who is unwilling to take risks will not achieve great things"],"pinyin":["she3 bu4 de5 hai2 zi5 tao4 bu4 zhu4 lang2"],"word":"舍不得孩子套不住狼"}]}