{"definition":["feudal vassal\/feudal princes, esp. the monarchs (dukes or princes) of the several vassal states 諸侯國|诸侯国 of Zhou during Western Zhou and Spring and Autumn periods 11th-5th century BC\/subordinate warlord\/local official"],"pinyin":["zhu1 hou2"],"traditional":["諸侯"],"rank":21453.0,"normalized_rank":0.3001553034012844,"fraction":0.0000020663133082306496,"cumulative_fraction":0.9780659948948214,"word":"诸侯","characters":[{"definition":["surname Zhu","all\/various"],"pinyin":["Zhu1","zhu1"],"word":"诸"},{"definition":["marquis, second of the five orders of ancient Chinese nobility 五等爵位[wu3 deng3 jue2 wei4]\/nobleman or high official","surname Hou"],"pinyin":["hou2","Hou2"],"word":"侯"}],"containing_words":[{"definition":["vassal state"],"pinyin":["zhu1 hou2 guo2"],"word":"诸侯国"},{"definition":["(expr.) hold the feudal overlord and you control his vassals"],"pinyin":["xie2 tian1 zi3 yi3 ling4 zhu1 hou2"],"word":"挟天子以令诸侯"}],"sentences":[{"english":"The following year, the six countries entered into a vassal of the Union combined vertical.","chinese":"第二年，六国诸侯订立了合纵的联盟。"},{"english":"Before that, China was a confederation of states, called \"the middle kingdoms\".","chinese":"统一之前，中国是诸侯国的邦联，叫做“中央王国”。"},{"english":"Small kingdom built huge walls aiming at protecting their territories.","chinese":"诸侯国修起城墙，借以保护他们的领土。"},{"english":"So the territory of Shang should include these states into it.","chinese":"商代国家疆域应包括这些诸侯国在内。"},{"english":"When monarch and states vanished, like a sigh.","chinese":"帝王和诸侯们也都消失，像一声叹惋。"},{"english":"On account of me you will stand before governors and kings as witnesses to them.","chinese":"又为我的缘故站在诸侯与君王面前，对他们作见证。"},{"english":"Diplomacy had much function in each development process of various states.","chinese":"邦交在各诸侯国的发展过程中起着非常重要的作用。"},{"english":"Wang will be closed for his vassal to the west of Shaanxi Qishan land grant him.","chinese":"平王便封他为诸侯，将陕西岐山以西的土地赐予他。"},{"english":"Ducal states at that time built walls to defend their own territories.","chinese":"当时的各个诸侯国为了保护自己的领地而修建城墙。"},{"english":"Chau conferred great gifts, and the good were enriched.","chinese":"周朝大封诸侯，使善人都富贵起来。"},{"english":"Ying State was a feudal princedom in Central Plains in the Western Zhou period.","chinese":"应国是我国西周时期中原地区的一个小诸侯国。"},{"english":"The five ranks of nobility were the legal status of the monarchs under the system of enfeoffment.","chinese":"五等爵是分封制度下诸侯的法定身份。"},{"english":"Thou act, that is, cut feudatory invasion, sparse human osteosarcoma.","chinese":"汝用事，即侵削诸侯，疏人骨肉。"},{"english":"History has enabled the five governors called \"spring and autumn five bully\".","chinese":"历史上把先后称霸的五个诸侯叫做“春秋五霸”。"},{"english":"Zhou was then the most powerful principality playing the role of hegemonic.","chinese":"当时，周是所有诸侯的最高权力统领。"},{"english":"Every time Fengdao princes to him for help, he always refused.","chinese":"每回逢到诸侯向他求救，他总是拒绝。"}],"related":[{"definition":["vassal state"],"pinyin":["zhu1 hou2 guo2"],"word":"诸侯国"},{"definition":["to divide and confer (property on one's descendants)"],"pinyin":["fen1 feng1"],"word":"分封"},{"definition":["the state of Chu, one of the most important of the small states contending for power in China between 770 and 223 BC, located around present-day Hubei"],"pinyin":["Chu3 guo2"],"word":"楚国"},{"definition":["the Zhou dynasty from 1027 BC"],"pinyin":["Zhou1 wang2 chao2"],"word":"周王朝"},{"definition":["Qi state of Western Zhou and the Warring states (1122-265 BC), centered in Shandong"],"pinyin":["Qi2 guo2"],"word":"齐国"},{"definition":["monarch"],"pinyin":["guo2 jun1"],"word":"国君"},{"definition":["the state of Qin, one of the seven states of the Warring States Period (475-220 BC)"],"pinyin":["Qin2 guo2"],"word":"秦国"},{"definition":["vassal state"],"pinyin":["feng1 guo2"],"word":"封国"},{"definition":["Wei State (407-225 BC), one of the Seven Hero States of the Warring States 戰國七雄|战国七雄\/Wei State or Cao Wei 曹魏 (220-265), the most powerful of the Three Kingdoms"],"pinyin":["Wei4 guo2"],"word":"魏国"},{"definition":["Yan, a vassal state of Zhou in modern Hebei and Liaoning\/north Hebei\/the four Yan kingdoms of the Sixteen Kingdoms, namely: Former Yan 前燕 (337-370), Later Yan 後燕|后燕 (384-409), Southern Yan 南燕 (398-410), Northern Yan 北燕 (409-436)"],"pinyin":["Yan1 guo2"],"word":"燕国"},{"definition":["country\/state"],"pinyin":["bang1 guo2"],"word":"邦国"},{"definition":["Wu state (in south China, in different historical periods)\/Wu state 220-280, founded by Sun Quan 孫權|孙权 the southernmost of the three Kingdoms"],"pinyin":["Wu2 guo2"],"word":"吴国"},{"definition":["Zhou Dynasty\/Western Zhou 西周 (1046-771 BC) and Eastern Zhou 東周|东周 (770-221 BC)"],"pinyin":["Zhou1 chao2"],"word":"周朝"},{"definition":["various countries"],"pinyin":["lie4 guo2"],"word":"列国"},{"definition":["to go on or send a punitive expedition"],"pinyin":["zheng1 fa2"],"word":"征伐"},{"definition":["official in feudal court\/subject"],"pinyin":["chen2 shu3"],"word":"臣属"}]}