{"definition":["to dispatch (vehicles, staff etc)\/to schedule\/to manage\/dispatcher\/scheduler"],"pinyin":["diao4 du4"],"traditional":["調度"],"rank":7798.0,"normalized_rank":0.10910413722664504,"fraction":0.000012479481342799719,"cumulative_fraction":0.9073309357381046,"word":"调度","characters":[{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["tiao2","diao4"],"word":"调"},{"definition":["to pass\/to spend (time)\/measure\/limit\/extent\/degree of intensity\/degree (angles, temperature etc)\/kilowatt-hour\/classifier for events and occurrences","to estimate\/Taiwan pr. [duo4]"],"pinyin":["du4","duo2"],"word":"度"}],"containing_words":[],"sentences":[{"english":"The scheme is mainly composed of center station and substation.","chinese":"方案由调度中心站和子站组成。"},{"english":"Using schedules and user groups enables control over how the tests run.","chinese":"使用测试调度和用户组能够控制测试的运行。"},{"english":"Imprecise computation model was introduced to rotational scheduling algorithm.","chinese":"方法将非精确计算模型引入到轮转式调度算法中。"},{"english":"Primary coverage of urban water distribution system is introduced.","chinese":"现介绍了城市给水系统优化调度的主要内容。"},{"english":"\"The fire has jumped I-15, \" the dispatcher said.","chinese":"“这个火从1跳到15”调度员说。"},{"english":"It also makes it much easier to do instruction scheduling for unrolled loops.","chinese":"它还简化了对于展开循环进行的指令调度。"},{"english":"The majority of users are mine production dispatching users except a few administrative users.","chinese":"除少数行政用户外外，大部分留给矿生产调度用户。"},{"english":"The Shipper and the Chief Officer are discussing the torn bags of castor seeds at the Dispatch Office.","chinese":"发货人跟大副正在调度室谈论蓖麻籽袋子破损的事。"},{"english":"Ask your administrator for the dispatcher location that should be used.","chinese":"向您的系统管理员询问应该使用的调度程序位置。"},{"english":"Modulo scheduling is a state-of-art scheme in the literature of software pipelining.","chinese":"模调度是一类重要的软件流水调度算法。"},{"english":"Modulo scheduling is a state-of-art scheme in the literature of software pipelining.","chinese":"模调度是一类重要的软件流水调度算法。"},{"english":"An ant colony optimization based algorithm for permutation flow shop scheduling was proposed.","chinese":"提出了一种求解置换流水车间调度的蚁群优化算法。"},{"english":"For the increase of employees and equipment, the production dispatch department.","chinese":"关于设备人手，生产调度部做个计划交给财务部审核。"},{"english":"The article presents a new meta- task scheduling algorithm.","chinese":"提出一种新的元任务调度算法。"},{"english":"The use of emergent flood dispatching is under the conditions of the water level in Shashi Hydrological Station.","chinese":"启用非常调度方式是以沙市水位作为控制判定条件的。"},{"english":"Submits the task to the scheduler instance for creation.","chinese":"将任务提交给调度程序实例以进行创建。"}],"related":[{"definition":["to cooperate\/in coordination with\/coordinated\/collaborate\/collaboration\/collaborative"],"pinyin":["xie2 tong2"],"word":"协同"},{"definition":["to conduct\/to command\/to direct\/conductor (of an orchestra)\/CL:個|个[ge4]"],"pinyin":["zhi3 hui1"],"word":"指挥"},{"definition":["to allocate\/to deploy","to blend (colors, herbs)\/to mix"],"pinyin":["diao4 pei4","tiao2 pei4"],"word":"调配"},{"definition":["to transfer\/to maneuver (troops etc)\/movement of personnel\/to mobilize\/to bring into play"],"pinyin":["diao4 dong4"],"word":"调动"},{"definition":["to send on assignment\/to deploy (troops)"],"pinyin":["diao4 pai4"],"word":"调派"},{"definition":["to summon\/to muster\/to assemble"],"pinyin":["diao4 ji2"],"word":"调集"},{"definition":["overall situation"],"pinyin":["quan2 ju2"],"word":"全局"},{"definition":["to sow discord","to send (products)\/to allocate\/to commit (funds)\/to channel (goods)"],"pinyin":["tiao2 bo1","diao4 bo1"],"word":"调拨"},{"definition":["to transfer (for a specific purpose)\/to allocate\/(computing) to invoke (a command, an application etc)"],"pinyin":["diao4 yong4"],"word":"调用"},{"definition":["to transfer (personnel or material)"],"pinyin":["chou1 diao4"],"word":"抽调"},{"definition":["(of a security guard etc) to be on duty, keeping an eye on things\/to keep watch"],"pinyin":["zhi2 shou3"],"word":"值守"},{"definition":["variant of 部署[bu4 shu3]"],"pinyin":["bu4 shu3"],"word":"布署"},{"definition":["to dispose\/to deploy\/deployment"],"pinyin":["bu4 shu3"],"word":"部署"},{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"word":"协助"},{"definition":["to handle\/to take care of\/to punish"],"pinyin":["chu3 zhi4"],"word":"处置"},{"definition":["to supervise\/to manage\/to administer\/management\/administration\/CL:個|个[ge4]"],"pinyin":["guan3 li3"],"word":"管理"}]}