{"definition":["to allocate\/to deploy","to blend (colors, herbs)\/to mix"],"pinyin":["diao4 pei4","tiao2 pei4"],"traditional":["調配","調配"],"rank":11909.0,"normalized_rank":0.16662236089152546,"fraction":0.000006188575513184753,"cumulative_fraction":0.9433613646827504,"word":"调配","characters":[{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["tiao2","diao4"],"word":"调"},{"definition":["to join\/to fit\/to mate\/to mix\/to match\/to deserve\/to make up (a prescription)\/to allocate"],"pinyin":["pei4"],"word":"配"}],"containing_words":[],"sentences":[{"english":"Such results could be used to guide ginger liquor production and ginger liquor blending.","chinese":"该结果可用于姜酒的调配和生产。"},{"english":"If can consider to allocate from other floors if there is not have enough staff.","chinese":"人员不足可以考虑从其他楼层调配。"},{"english":"At the same time put forward the technology flow of today's browing sauce production.","chinese":"同时提出了现代酿造酱油调配生产的工艺流程。"},{"english":"They supply cheap wow power leveling service to loyal and reliable customers.","chinese":"哇，他们提供廉价电力调配服务忠诚可靠的客户。"},{"english":"Ingredient compounding, uniformization and sterilization are involved in the process.","chinese":"处理过程采用了材料调配，均质和杀菌等工艺。"},{"english":"Tongyi has three lube oil blending plants in China with a total annual capacity of 600,000 tons.","chinese":"统一在中国有三家润滑油调配厂，年产能达60万吨。"},{"english":"Moreover, Googles' connection with the CIA and its venture capital firm extends to sharing at least one key member of personnel.","chinese":"此外，谷狗和中情局的合作还体现在人事调配方面。"},{"english":"Color match file corrupt; re-install driver.","chinese":"颜色调配文件损坏，请重新安装驱动程序。"},{"english":"The tea is made up of several different types.","chinese":"这茶是由几种不同的茶调配成的。"},{"english":"Studies have been undertaken on the processing and formulation of waxy maize beverage.","chinese":"对糯玉米饮料的生产工艺及调配方法进行了研究。"},{"english":"Objective Dynamic administration of nursing human resources of all wards in the hospital.","chinese":"目的动态调配全院各病区的护理人力资源。"},{"english":"The use of non- polluting products coolant and antiFushiji, science and technology from the deployment.","chinese":"本产品采用无污染冷却剂与防腐蚀剂，科技调配而成。"},{"english":"When the new shunting procedures had been made effective, however.","chinese":"新的调配车间工作流程是开始发挥效用了，然而。"},{"english":"The establishment of water resources optimal dispatching model.","chinese":"叶河流域水资源最优调配模型建立。"},{"english":"I am hoping he'd eventually stumble into margarita .","chinese":"我希望他最终能碰巧调配出玛格丽塔酒。"},{"english":"What if the initial emergency deployment turns out to be inadequate?","chinese":"如果初期紧急调配不够充分怎么办？"}],"related":[{"definition":["to concoct by mixing ingredients\/to prepare according to a recipe\/to make (a salad, a cocktail, cosmetics etc)","to modulate\/modulation"],"pinyin":["tiao2 zhi4","tiao2 zhi4"],"word":"调制"},{"definition":["to compound (medicines etc)\/to prepare (by mixing ingredients)\/to concoct"],"pinyin":["pei4 zhi4"],"word":"配制"},{"definition":["to dispatch (vehicles, staff etc)\/to schedule\/to manage\/dispatcher\/scheduler"],"pinyin":["diao4 du4"],"word":"调度"},{"definition":["to mix\/to blend\/hybrid\/composite"],"pinyin":["hun4 he2"],"word":"混合"},{"definition":["harmonious\/to mediate\/to reconcile\/to compromise\/mediation\/to mix\/to blend\/blended\/to season\/seasoning\/to placate"],"pinyin":["tiao2 he2"],"word":"调和"},{"definition":["to ration\/to allocate"],"pinyin":["pei4 ji3"],"word":"配给"},{"definition":["to transfer\/to maneuver (troops etc)\/movement of personnel\/to mobilize\/to bring into play"],"pinyin":["diao4 dong4"],"word":"调动"},{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["tiao2","diao4"],"word":"调"},{"definition":["necessary (for)\/required"],"pinyin":["suo3 xu1"],"word":"所需"},{"definition":["prescription\/cooking recipe\/formulation\/completing the square (to solve quadratic equation, math.)"],"pinyin":["pei4 fang1"],"word":"配方"},{"definition":["to transport\/to carry"],"pinyin":["yun4 song4"],"word":"运送"},{"definition":["to distribute\/to assign\/to allocate\/to partition (a hard drive)"],"pinyin":["fen1 pei4"],"word":"分配"},{"definition":["geological survey, abbr. for 地質調查|地质调查[di4 zhi4 diao4 cha2]"],"pinyin":["di4 diao4"],"word":"地调"},{"definition":["to blend various types of wine (or spirits, or fruit juices etc)"],"pinyin":["gou1 dui4"],"word":"勾兑"},{"definition":["reserves\/to store up"],"pinyin":["chu3 bei4"],"word":"储备"},{"definition":["to summon\/to muster\/to assemble"],"pinyin":["diao4 ji2"],"word":"调集"}]}