{"definition":["to compose (a piece of music)\/(fig.) to create, by one's actions, a narrative (generally one that can be recounted with pride)"],"pinyin":["pu3 xie3"],"traditional":["譜寫"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"谱写","characters":[{"definition":["chart\/list\/table\/register\/score (music)\/spectrum (physics)\/to set to music"],"pinyin":["pu3"],"word":"谱"},{"definition":["to write"],"pinyin":["xie3"],"word":"写"}],"containing_words":[],"sentences":[{"english":"The Chinese side would like to work together with Arab states to compose a new chapter of China-Arab friendly cooperation.","chinese":"中方愿与阿方共同努力，谱写中阿友好合作的新篇章。"},{"english":"Phoenix patterns together with the other traditional patterns write a history of the Chinese patterns.","chinese":"凤纹样和其它传统纹样一起，共同谱写着中国纹样史。"},{"english":"With our practical action to write a song and a hymn in the spring.","chinese":"用我们实际行动来谱写一曲又一曲春天里的赞歌。"},{"english":"The song am composed by a youth stayer.","chinese":"这首歌是一位年青务工佣人谱写的。"},{"english":"Sincerely look forward to your cooperation, to co-creating a glorious future, and composing new writings.","chinese":"真诚期待和您的合作，共创美好未来，谱写新的篇章。"},{"english":"You will do much better starting a relationship with someone who has common interests.","chinese":"你会和有着共同兴趣的某人谱写一段更加浪漫的恋曲。"},{"english":"This musical composition was especially written by him for her.","chinese":"这支琴曲是他专门为她谱写的。"},{"english":"The music for this dance.","chinese":"为孔雀舞谱写的舞曲。"},{"english":"I can sign the preposition song in my sleep.","chinese":"我可以在我睡觉的时候谱写介词之歌。"},{"english":"Together, we will help write the next chapter of the great American story.","chinese":"让我们一起谱写美国历史新一页的华章。"},{"english":"The tune was composed at the beginning of the War of Liberation.","chinese":"这支曲子是在解放战争初期谱写的。"},{"english":"The composition is in the manner of German folk songs.","chinese":"这首曲子是以德国民歌的风格谱写成的。"},{"english":"We are the architects of our own fate.","chinese":"命运都是由我们自己谱写的。"},{"english":"Of course, there are also part of the exotic marriage successfully wrote another.","chinese":"当然，也有一部分异国婚姻成功地谱写了别样的恋曲。"},{"english":"Music written in duple time for dancing the tango .","chinese":"为探戈谱写的一种双拍子乐曲。"},{"english":"Botou compose a long history of the development of China Zhang.","chinese":"泊头悠久的历史谱写出发展的华章。"}],"related":[{"definition":["to express (emotions in prose)\/a written description (of emotions)"],"pinyin":["shu1 xie3"],"word":"抒写"},{"definition":["movement (of a symphony)"],"pinyin":["yue4 zhang1"],"word":"乐章"},{"definition":["writing\/sections and chapters"],"pinyin":["pian1 zhang1"],"word":"篇章"},{"definition":["lit. you can sing or you can cry (idiom); fig. deeply moving\/happy and sad\/inspiring and tragic"],"pinyin":["ke3 ge1 ke3 qi4"],"word":"可歌可泣"},{"definition":["to sing the praises of\/to extol\/to eulogize"],"pinyin":["ge1 song4"],"word":"歌颂"},{"definition":["to advance bravely\/to endeavor"],"pinyin":["fen4 jin4"],"word":"奋进"},{"definition":["carol"],"pinyin":["song4 ge1"],"word":"颂歌"},{"definition":["to interpret\/to comment and explain\/to annotate\/to perform (i.e. interpret a theatrical role)\/to decode\/interpretation\/annotation"],"pinyin":["quan2 shi4"],"word":"诠释"},{"definition":["overture"],"pinyin":["xu4 qu3"],"word":"序曲"},{"definition":["to walk hand in hand\/to cooperate"],"pinyin":["xie2 shou3 tong2 xing2"],"word":"携手同行"},{"definition":["a poem\/a composition in verse\/fig. epic (compared with historical epic)\/the biblical Book of Psalms"],"pinyin":["shi1 pian1"],"word":"诗篇"},{"definition":["symphony"],"pinyin":["jiao1 xiang3 qu3"],"word":"交响曲"},{"definition":["to offer respectfully\/to consecrate\/to dedicate\/to devote"],"pinyin":["feng4 xian4"],"word":"奉献"},{"definition":["to write"],"pinyin":["shu1 xie3"],"word":"书写"},{"definition":["hand in hand and shoulder to shoulder"],"pinyin":["xie2 shou3 bing4 jian1"],"word":"携手并肩"},{"definition":["journey\/expedition\/voyage"],"pinyin":["zheng1 cheng2"],"word":"征程"}]}