{"definition":["realism (in art)\/sense of reality\/texture\/tactile quality"],"pinyin":["zhi4 gan3"],"traditional":["質感"],"rank":7821.0,"normalized_rank":0.10942593706714424,"fraction":0.000012418754650025155,"cumulative_fraction":0.9076172764003442,"word":"质感","characters":[{"definition":["character\/nature\/quality\/plain\/to pawn\/pledge\/hostage\/to question\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"质"},{"definition":["to feel\/to move\/to touch\/to affect\/feeling\/emotion\/(suffix) sense of ~"],"pinyin":["gan3"],"word":"感"}],"containing_words":[],"sentences":[{"english":"We think we don’t need to explain how paper and card textures are being used in web designing and give the design a very rough cut-and-paste and unpolished style.","chinese":"如何在网页中模仿纸张的质感无需我们赘述了。"},{"english":"Really experience it — the taste, the texture.","chinese":"去真正地感受它的味道和质感。"},{"english":"No matter what from clairvoyance and character feel aspect say is incomparable and its simple alive.","chinese":"无论从透视学或质感来说是无与匹敌的简直是活了。"},{"english":"Imitate a Buddha to have very and decorous texture to generally want the Qing Tui is from the open space yet afterward.","chinese":"仿佛有着极其厚重的质感一般要从天幕间倾颓而下。"},{"english":"The texture of this kind of leather is really smooth.","chinese":"这种皮革的质感特别腻滑。"},{"english":"The light of humanity shines brightly on this quality grounding.","chinese":"在这片质感的底色之上，人文的性灵之光熠熠生辉。"},{"english":"Four sides of holes, high light effect, enhancing the metal texture.","chinese":"四边孔位，采用高光效果，增强金属质感。"},{"english":"Enhance the texture of your hair by adding curves with a hair straightener.","chinese":"通过用夹直板给头发加一些曲线，提升头发的质感。"},{"english":"The ST is water drop shape design , The Seat Post clamp design is special and high feeling.","chinese":"中管水滴管型设计，并搭配特殊且高质感的座管束套。"},{"english":"Part white with aluminium alloy and fuselage Bamboo fibre, simple sense and halfback.","chinese":"机身部分用铝合金和白色竹纤维构成，超质感和前卫。"},{"english":"Thin is a term used to describe a wine lacking in body, almost watery.","chinese":"形容红酒缺乏质感，很稀薄，几乎是水状的。"},{"english":"To achieve better texture of the shrimps, put them in refrigerator freezing a while after boiling.","chinese":"虾灼熟后放冰箱冷藏一会，能令质感更佳。"},{"english":"There is a gauzy , ghostly quality to this painting.","chinese":"在这幅油画中有一种如纱般的，诡异的质感。"},{"english":"The quality of final product shape is determined directly by the fairness of the B-spline curve.","chinese":"曲线的光顺性对最终产品的外观质感有着直接影响。"},{"english":"It looks and feels like ordinary black, hard roadway.","chinese":"它的外观和质感都象是普通的黑色坚硬柏油路。"},{"english":"In texture, a breast cyst usually feels like a soft grape or a water-filled balloon, but sometimes a breast cyst feels firm.","chinese":"质感像软葡萄或水囊，但有时囊肿感觉发硬。"}],"related":[{"definition":["to feel\/to move\/to touch\/to affect\/feeling\/emotion\/(suffix) sense of ~"],"pinyin":["gan3"],"word":"感"},{"definition":["texture of timber\/quality of material\/material (that sth is made of)"],"pinyin":["cai2 zhi4"],"word":"材质"},{"definition":["sketchy\/concise\/abbreviated"],"pinyin":["jian3 yue1"],"word":"简约"},{"definition":["sense of beauty\/aesthetic perception"],"pinyin":["mei3 gan3"],"word":"美感"},{"definition":["tactile sensation\/touch\/feel"],"pinyin":["chu4 gan3"],"word":"触感"},{"definition":["hue\/tone"],"pinyin":["se4 diao4"],"word":"色调"},{"definition":["style (of art or literature)\/form\/one's work style\/moral character"],"pinyin":["ge2 diao4"],"word":"格调"},{"definition":["cortex\/cerebral cortex"],"pinyin":["pi2 zhi4"],"word":"皮质"},{"definition":["delicate\/fine\/exquisite\/refined"],"pinyin":["jing1 zhi4"],"word":"精致"},{"definition":["to return to old ways (a Confucian aspiration)\/to turn back the clock\/neoclassical school during Tang and Song associated with classical writing 古文\/retro (fashion style based on nostalgia, esp. for 1960s)"],"pinyin":["fu4 gu3"],"word":"复古"},{"definition":["line (in drawing, calligraphy etc)\/the lines or contours of a three-dimensional object (hairstyle, clothing, car etc)"],"pinyin":["xian4 tiao2"],"word":"线条"},{"definition":["vein lines (in marble or fingerprint)\/grain (in wood etc)"],"pinyin":["wen2 li3"],"word":"纹理"},{"definition":["texture\/background (texture)\/grain\/quality\/character\/disposition"],"pinyin":["zhi4 di4"],"word":"质地"},{"definition":["exquisite\/meticulous"],"pinyin":["xi4 ni4"],"word":"细腻"},{"definition":["able to withstand careful appreciation\/well worth a second look"],"pinyin":["nai4 kan4"],"word":"耐看"},{"definition":["to model\/to shape\/appearance\/style\/design\/form\/pose"],"pinyin":["zao4 xing2"],"word":"造型"}]}