{"definition":["examination of the evidence of the opposing party in a court of law"],"pinyin":["zhi4 zheng4"],"traditional":["質證"],"rank":25331.0,"normalized_rank":0.3544135547689337,"fraction":0.0000014365658259482745,"cumulative_fraction":0.9847733280350572,"word":"质证","characters":[{"definition":["character\/nature\/quality\/plain\/to pawn\/pledge\/hostage\/to question\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"质"},{"definition":["to admonish\/variant of 證|证[zheng4]","certificate\/proof\/to prove\/to demonstrate\/to confirm\/variant of 症[zheng4]"],"pinyin":["zheng4","zheng4"],"word":"证"}],"containing_words":[],"sentences":[{"english":"Other circumstances in which the experts' conclusion cannot be as the evidence upon the cross-examination.","chinese":"经过质证认定不能作为证据使用的其他情形。"},{"english":"Strengthening the function of court trial requires more of Cross - examination and Attestation.","chinese":"强化庭审功能必然也对质证和认证提出了新的要求。"},{"english":"The grade-b qualification certificate to engage in the consulting of capital expenditure issued by the construction committee of shandong province.","chinese":"山东省建设委员会颁发的工程造价咨询乙级资质证书。"},{"english":"The second part is its characteristics and effects of the cross-examination.","chinese":"论文第二部分是“质证的性质及其效力”。"},{"english":"Commensurate with the quality of inspection certificate grading operations.","chinese":"与资质证书等级相适应的勘察业务。"},{"english":"The evidence shall be exhibited in court, and be cross-examined by the parties concerned.","chinese":"证据应当在法庭上出示，由当事人质证。"},{"english":"Article 45 The evidence shall be presented during the hearings and may be examined by the parties.","chinese":"第45条证据应当在开庭时出示，当事人可以质证。"},{"english":"Article 47 Evidences shall be presented at court and be cross-examined by the parties concerned.","chinese":"第四十七条证据应当在法庭上出示，由当事人质证。"},{"english":"The expertise report should be cross-examined by both parties and advice should be given.","chinese":"鉴定意见书应当经双方当事人质证，发表意见。"},{"english":"The copy of the sheet above and certificate are given to regional manager.","chinese":"上述申请表格与资质证书复印件交四春公司区域经理。"},{"english":"It is concluded that the Abnormal Savda is the main syndrome of depression in the traditional Uighur Medicine.","chinese":"由此得出，异常黑胆质证是抑郁症的维医主要证型。"},{"english":"During this trial, there are many doubtable pieces of evidence which must be re-verified.","chinese":"这次审判中，有许多证据有质证，需要重新核实。"},{"english":"Prethrombosis state is more obvious in Abnormal Savda syndrome than that of non Abnormal Savda syndrome.","chinese":"复杂性疾病异常黑胆质证患者血栓前状态改变明显。"},{"english":"The evidence shall be displayed and cross-examined by the litigants at the court.","chinese":"证据应当在法庭上出示，并由当事人互相质证。"},{"english":"The parties concerned may request for cross-examining the evidences collected by the arbitration panel on its own initiative.","chinese":"当事人可以对仲裁庭自行收集的证据提出质证意见。"}],"related":[{"definition":["(law) collegiate bench\/panel of judges"],"pinyin":["he2 yi4 ting2"],"word":"合议庭"},{"definition":["district attorney\/public prosecutor\/procurator"],"pinyin":["gong1 su4 ren2"],"word":"公诉人"},{"definition":["to offer evidence"],"pinyin":["ju3 zheng4"],"word":"举证"},{"definition":["the prosecution and the defense (law)"],"pinyin":["kong4 bian4"],"word":"控辩"},{"definition":["defender\/defending counsel"],"pinyin":["bian4 hu4 ren2"],"word":"辩护人"},{"definition":["plaintiff and defendant\/prosecution and defense (lawyers)"],"pinyin":["yuan2 bei4 gao4"],"word":"原被告"},{"definition":["probative value\/strength of evidence in legal proof\/relevance"],"pinyin":["zheng4 ming2 li4"],"word":"证明力"},{"definition":["written evidence"],"pinyin":["shu1 zheng4"],"word":"书证"},{"definition":["court hearing"],"pinyin":["ting2 shen3"],"word":"庭审"},{"definition":["to hear a case again\/review\/retrial"],"pinyin":["zai4 shen3"],"word":"再审"},{"definition":["first instance (law)"],"pinyin":["yi1 shen3"],"word":"一审"},{"definition":["to protest against a verdict\/to lodge an appeal"],"pinyin":["kang4 su4"],"word":"抗诉"},{"definition":["persons involved or implicated\/party (to an affair)"],"pinyin":["dang1 shi4 ren2"],"word":"当事人"},{"definition":["to retract testimony\/to withdraw a confession"],"pinyin":["fan1 gong4"],"word":"翻供"},{"definition":["judge (in court)"],"pinyin":["fa3 guan1"],"word":"法官"},{"definition":["to appear in court"],"pinyin":["chu1 ting2"],"word":"出庭"}]}