{"definition":["to adjust closely\/to fit"],"pinyin":["tie1 he2"],"traditional":["貼合"],"rank":27426.0,"normalized_rank":0.3837253228491878,"fraction":0.0000011903015694321949,"cumulative_fraction":0.987516145459456,"word":"贴合","characters":[{"definition":["to stick\/to paste\/to post (e.g. on a blog)\/to keep close to\/to fit snugly\/to subsidize\/allowance (e.g. money for food or housing)\/sticker\/classifier for sticking plaster: strip"],"pinyin":["tie1"],"word":"贴"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]","variant of 合[he2]"],"pinyin":["ge3","he2","he2"],"word":"合"}],"containing_words":[{"definition":["faying surface"],"pinyin":["tie1 he2 mian4"],"word":"贴合面"}],"sentences":[{"english":"Blush can be poured through a hidden semi-transparent cover, very fitting skin.","chinese":"腮红可透过隐藏的半透明罩倒出，极度贴合肌肤。"},{"english":"Lace-up closure provides a secure and snug fit.","chinese":"花边关闭提供一个安全和舒适的贴合。"},{"english":"The utility model relates to a ginning and roll structure of plastic joint machine.","chinese":"本实用新型涉及一种塑料贴合机的轧花轧辊的结构。"},{"english":"The intelligent drill pipe samples whose internal pipes expanded successfully have the excellent insulation.","chinese":"经内管膨胀贴合成功的智能钻杆样件的绝缘性能良好。"},{"english":"The plan of the Master bedroom space is true to the axial layout of the house.","chinese":"主卧的布局很明显贴合整个房子的对称布局。"},{"english":"When a load is being applied, the loading bar shall be in contact with the full width of the specimen.","chinese":"在负载状态下时，承重条应能和试件全宽贴合。"},{"english":"Safe-Fit design fits closer to you and be better protected.","chinese":"中央立体设计，更贴合体型，倍感安心。"},{"english":"The cover body can rotate towards the groove until being attached to the casing body, so as to hold the telephone set.","chinese":"盖体可朝向凹槽转动至贴合壳体以夹持电话机。"},{"english":"Removable liquid push-up-pads that form fit to your bust.","chinese":"液体状衬垫可贴合胸型，若不要也可移除。"},{"english":"The dynamite drill holes are still apparent and tie the building to the area of excavation.","chinese":"炸药钻孔仍然明显，也使建筑贴合开采区。"},{"english":"Washington, DC, looks a more plausible candidate for that.","chinese":"在这一层面上，同为候选的华盛顿更为贴合。"},{"english":"Paper procrastinates on board, leading edge two side should have joined, want joint fingernail outspread 5.","chinese":"上纸拖板，前缘两侧要衔接好，要贴合指甲延伸5。"},{"english":"Fuse the shoulder piece to the interfacing; then stitch the darts.","chinese":"将肩片贴合到实布上，然后缉缝省道。"},{"english":"Synthesizers addabright and lapidary quality that doesn't always fit the lyrics.","chinese":"合成器明亮而优雅的音质并不总那么贴合歌词。"},{"english":"It will help to secure the paper block to the cover and reenforce the spine. Yay!","chinese":"这将保证书与书脊能够充分地贴合。"},{"english":"All basis materials double-layer lamination rewinding, wide range of application.","chinese":"各种基材双层贴合复卷，适用范围广。"}],"related":[{"definition":["to press close to\/to snuggle close\/intimate"],"pinyin":["tie1 jin4"],"word":"贴近"},{"definition":["to stick close to\/to press up against"],"pinyin":["jin3 tie1"],"word":"紧贴"},{"definition":["ergonomics"],"pinyin":["ren2 ti3 gong1 xue2"],"word":"人体工学"},{"definition":["realism (in art)\/sense of reality\/texture\/tactile quality"],"pinyin":["zhi4 gan3"],"word":"质感"},{"definition":["to fit tightly (idiom)\/to join seamlessly\/to fit snugly"],"pinyin":["yan2 si1 he2 feng4"],"word":"严丝合缝"},{"definition":["cozy\/snug"],"pinyin":["shu1 shi4"],"word":"舒适"},{"definition":["agreement\/to agree\/to get on with\/congenial\/agreeing with\/to ally oneself with sb"],"pinyin":["qi4 he2"],"word":"契合"},{"definition":["light (weight)\/frivolous\/a philanderer\/to scorn\/disrespectful"],"pinyin":["qing1 bo2"],"word":"轻薄"},{"definition":["plan\/design\/to design\/to plan\/CL:個|个[ge4]"],"pinyin":["she4 ji4"],"word":"设计"},{"definition":["three-dimensional\/solid\/stereoscopic"],"pinyin":["li4 ti3"],"word":"立体"},{"definition":["ductability"],"pinyin":["yan2 zhan3 xing4"],"word":"延展性"},{"definition":["moderate\/reasonable\/conveniently situated"],"pinyin":["shi4 zhong1"],"word":"适中"},{"definition":["conspicuous\/to make sth stand out\/make sth prominent"],"pinyin":["tu1 xian3"],"word":"突显"},{"definition":["line (in drawing, calligraphy etc)\/the lines or contours of a three-dimensional object (hairstyle, clothing, car etc)"],"pinyin":["xian4 tiao2"],"word":"线条"},{"definition":["tactile sensation\/touch\/feel"],"pinyin":["chu4 gan3"],"word":"触感"},{"definition":["soft"],"pinyin":["rou2 ruan3"],"word":"柔软"}]}