{"definition":["to be at an impasse (idiom)\/in a tight spot\/at the end of one's rope\/desperate"],"pinyin":["zou3 tou2 wu2 lu4"],"traditional":["走投無路"],"rank":23605.0,"normalized_rank":0.33026457543408005,"fraction":0.000001685019746867283,"cumulative_fraction":0.9820861809303948,"word":"走投无路","characters":[{"definition":["to walk\/to go\/to run\/to move (of vehicle)\/to visit\/to leave\/to go away\/to die (euph.)\/from\/through\/away (in compound verbs, such as 撤走[che4 zou3])\/to change (shape, form, meaning)"],"pinyin":["zou3"],"word":"走"},{"definition":["to cast\/to send\/to throw oneself (into the river etc)\/to seek refuge\/to place oneself into the hands of"],"pinyin":["tou2"],"word":"投"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"无"},{"definition":["surname Lu","road\/CL:條|条[tiao2]\/journey\/route\/line (bus etc)\/sort\/kind"],"pinyin":["Lu4","lu4"],"word":"路"}],"containing_words":[],"sentences":[{"english":"Advocate cornered, so heart a horizontal, allow to stay.","chinese":"雅乐走投无路，于是把心一横，容许留下。"},{"english":"Pure literature in this era of almost no way out, still cling to.","chinese":"在这个纯文学几乎已经走投无路的年代，仍然固守。"},{"english":"Veterans of the war were desperate for relief.","chinese":"一战老兵们走投无路，急需救济。"},{"english":"Revolutionary forces have fought Gadhafi's men street by street, cornering the last vestiges of the old regime to that last district.","chinese":"卡扎菲旧政权的残存势力也在这个城市最终走投无路。"},{"english":"We must not make him desperate.","chinese":"我们千万不要弄得他走投无路。"},{"english":"Oh, you and I dancing slow, and we got nowhere to go.","chinese":"哦，你和我缓慢的舞动着，我们走投无路。"},{"english":"Very often the bandits are hard pressed by gendarmes or carbineers;","chinese":"强盗常常让宪兵和马枪兵逼得走投无路。"},{"english":"Pumas will not attack a human being unless it is cornered.","chinese":"美洲狮除非被逼得走投无路，是绝不会伤人的。"},{"english":"The remainder, referred to as displaced persons, or DPs, were people who literally had no place to go.","chinese":"其余被称为流离失所的人是那些完全走投无路的难民。"},{"english":"They had to escape to the home of Chiron.","chinese":"人马族被逼的走投无路，只好逃到了奇伦的家中。"},{"english":"He saw no way of eluding Featherstone's stupid demand.","chinese":"费瑟斯通的愚蠢要求使他走投无路。"},{"english":"If you're desperate for money, what are some things you can do to make money fast?","chinese":"如果你缺钱到走投无路的地步，怎样才能赚点快钱呢？"},{"english":"Mr Jones is a good chess player, and he soon had me beat coming and going.","chinese":"琼斯先生是个象棋高手，他一下子攻得我走投无路。"},{"english":"They were desperate people in a place where it hadn't rained.","chinese":"天已经好久不下雨了，他们被逼得走投无路。"}],"related":[{"definition":["lit. the path exhausted, the end of the road (idiom); an impasse\/in a plight with no way out\/things have reached a dead end"],"pinyin":["qiong2 tu2 mo4 lu4"],"word":"穷途末路"},{"definition":["mountain and river exhausted (idiom); at the end of the line\/nowhere to go"],"pinyin":["shan1 qiong2 shui3 jin4"],"word":"山穷水尽"},{"definition":["nowhere to go\/at the end of one's tether"],"pinyin":["wu2 lu4 ke3 zou3"],"word":"无路可走"},{"definition":["to have no alternative (idiom); compelled by circumstances\/forced into sth"],"pinyin":["po4 bu4 de2 yi3"],"word":"迫不得已"},{"definition":["lit. there is no road to the sky, nor door into the earth (idiom)\/fig. to be at the end of one's rope\/to be trapped in a hopeless situation"],"pinyin":["shang4 tian1 wu2 lu4 , ru4 di4 wu2 men2"],"word":"上天无路，入地无门"},{"definition":["to act against one's will\/to have no alternative but to\/to have to\/to have no choice\/must"],"pinyin":["bu4 de2 yi3"],"word":"不得已"},{"definition":["lit. people rebelling and friends deserting (idiom)\/fig. to find oneself utterly isolated"],"pinyin":["zhong4 pan4 qin1 li2"],"word":"众叛亲离"},{"definition":["desperate straits"],"pinyin":["jue2 jing4"],"word":"绝境"},{"definition":["penniless (idiom)"],"pinyin":["shen1 wu2 fen1 wen2"],"word":"身无分文"},{"definition":["to have no way out\/to have no alternative"],"pinyin":["wan4 ban1 wu2 nai4"],"word":"万般无奈"},{"definition":["no strategy left to try (idiom); at one's wit's end\/at the end of one's tether\/powerless"],"pinyin":["wu2 ji4 ke3 shi1"],"word":"无计可施"},{"definition":["no room to advance or to retreat (idiom); without any way out of a dilemma\/trapped\/in an impossible situation"],"pinyin":["jin4 tui4 liang3 nan2"],"word":"进退两难"},{"definition":["impossible to make a living"],"pinyin":["huo2 bu4 xia4 qu5"],"word":"活不下去"},{"definition":["isolated and without help"],"pinyin":["gu1 li4 wu2 yuan2"],"word":"孤立无援"},{"definition":["out of ammunition and no food left (idiom); in desperate straits"],"pinyin":["dan4 jin4 liang2 jue2"],"word":"弹尽粮绝"},{"definition":["to press for payment of debts\/to dun"],"pinyin":["bi1 zhai4"],"word":"逼债"}]}