{"definition":["to go through water and tread on fire (idiom); not afraid of any difficulty"],"pinyin":["fu4 tang1 dao3 huo3"],"traditional":["赴湯蹈火"],"rank":45499.0,"normalized_rank":0.6365900409945014,"fraction":2.272871650240284e-7,"cumulative_fraction":0.9981358432244184,"word":"赴汤蹈火","characters":[{"definition":["to go\/to visit (e.g. another country)\/to attend (a banquet etc)"],"pinyin":["fu4"],"word":"赴"},{"definition":["surname Tang","rushing current","soup\/hot or boiling water\/decoction of medicinal herbs\/water in which sth has been boiled"],"pinyin":["Tang1","shang1","tang1"],"word":"汤"},{"definition":["to tread on\/to trample\/to stamp\/to fulfill\/Taiwan pr. [dao4]"],"pinyin":["dao3"],"word":"蹈"},{"definition":["fire\/urgent\/ammunition\/fiery or flaming\/internal heat (Chinese medicine)\/hot (popular)\/classifier for military units (old)\/Kangxi radical 86","surname Huo"],"pinyin":["huo3","Huo3"],"word":"火"}],"containing_words":[],"sentences":[{"english":"I would to anything for your love in the coming year.","chinese":"在新的一年里，为了你的爱，我愿赴汤蹈火。"},{"english":"In order to achieve our goal, we should be ready to go through fire and water.","chinese":"为了实现梦想，我们应该做好赴汤蹈火的准备。"},{"english":"I wouldn't hesitate to go through fire and water for the just cause.","chinese":"为了正义事业赴汤蹈火在所不辞。"},{"english":"Mary; he would go through fire and water for her.","chinese":"吉姆恋慕玛丽，愿为她赴汤蹈火。"},{"english":"They went through fire and water together in the war , making them the best friends.","chinese":"他们在战争中赴汤蹈火，这使他们成了最好的朋友。"},{"english":"I'd go through fire and water for my good friend.","chinese":"我愿为我的好朋友赴汤蹈火。"},{"english":"This formidable battle, will threes wild heart clingy one place.","chinese":"这次赴汤蹈火之战，将三颗狂野的心紧贴一处。"},{"english":"He went through fire and flood to save his mother.","chinese":"他赴汤蹈火去救他母亲。"},{"english":"Jack is ready to go through hell to help his friend.","chinese":"为了帮助朋友，杰克准备赴汤蹈火。"},{"english":"They were always ready to go through fire and water for the sake of the Chinese people's liberation.","chinese":"他们随时准备为中国人民的解放而赴汤蹈火。"},{"english":"They would through fire and water to serve the people.","chinese":"为人民服务，他们愿意赴汤蹈火。"},{"english":"They would go through fire and water to serve the people.","chinese":"为人民服务他们甘愿赴汤蹈火。"},{"english":"I would do anything for you, baby, you know that.","chinese":"我愿为你赴汤蹈火，宝贝，你是知道的。"},{"english":"As you go through fire and water is not impossible.","chinese":"为你赴汤蹈火并非不可能。"},{"english":"The different heights that I go to just to make sure she is happy.","chinese":"我赴汤蹈火的原因只是为了让她开心。"},{"english":"He said he would go through fire and water for me.","chinese":"他说为了我他愿意赴汤蹈火。"}],"related":[{"definition":["not to refuse to (idiom)\/not to hesitate to"],"pinyin":["zai4 suo3 bu4 ci2"],"word":"在所不辞"},{"definition":["ten thousand deaths will not prevent me (idiom); ready to risk life and limb to help out"],"pinyin":["wan4 si3 bu4 ci2"],"word":"万死不辞"},{"definition":["to offer one's life in sacrifice"],"pinyin":["gan1 nao3 tu2 di4"],"word":"肝脑涂地"},{"definition":["lit. mountains of daggers and seas of flames\/fig. extreme danger (idiom)"],"pinyin":["dao1 shan1 huo3 hai3"],"word":"刀山火海"},{"definition":["bravery with no thought of personal safety (idiom); risking life and limb\/undaunted by perils"],"pinyin":["she3 sheng1 wang4 si3"],"word":"舍生忘死"},{"definition":["to spare no effort (idiom); to do one's utmost"],"pinyin":["jin4 xin1 jie2 li4"],"word":"尽心竭力"},{"definition":["to display utter loyalty\/to be loyal to the end"],"pinyin":["jin4 zhong1"],"word":"尽忠"},{"definition":["not to be shirked without dishonor (idiom)\/incumbent\/bounden (duty)"],"pinyin":["yi4 bu4 rong2 ci2"],"word":"义不容辞"},{"definition":["to risk one's life"],"pinyin":["she3 ming4"],"word":"舍命"},{"definition":["to follow everywhere\/to always be there for sb at their beck and call"],"pinyin":["an1 qian2 ma3 hou4"],"word":"鞍前马后"},{"definition":["to dash on bravely with no thought of personal safety (idiom); undaunted by dangers\/regardless of perils"],"pinyin":["fen4 bu4 gu4 shen1"],"word":"奋不顾身"},{"definition":["to serve (in some capacity)\/to work for"],"pinyin":["xiao4 lao2"],"word":"效劳"},{"definition":["no complaints\/to have no regrets"],"pinyin":["wu2 yuan4 wu2 hui3"],"word":"无怨无悔"},{"definition":["to bend to a task and spare no effort (idiom); striving to the utmost"],"pinyin":["ju1 gong1 jin4 cui4"],"word":"鞠躬尽瘁"},{"definition":["until death puts an end (idiom); one's whole life\/unto one's dying day"],"pinyin":["si3 er2 hou4 yi3"],"word":"死而后已"},{"definition":["lit. to open one's liver and drip gall (idiom); wholehearted loyalty"],"pinyin":["pi1 gan1 li4 dan3"],"word":"披肝沥胆"}]}