{"definition":["to drive away"],"pinyin":["gan3 chu1"],"traditional":["趕出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"赶出","characters":[{"definition":["to overtake\/to catch up with\/to hurry\/to rush\/to try to catch (the bus etc)\/to drive (cattle etc) forward\/to drive (sb) away\/to avail oneself of (an opportunity)\/until"],"pinyin":["gan3"],"word":"赶"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"He had cleared them out three years ago but they had all come back in again.","chinese":"祂三年前曾经把他们赶出去，但不久又回复旧观。"},{"english":"The enemy are in the forest and must be dislodged .","chinese":"敌人在丛林里，必须将他们赶出来。"},{"english":"The hecklers were banished from the courtroom.","chinese":"捣乱分子被赶出法庭。"},{"english":"I asked your disciples to drive out the spirit, but they could not.","chinese":"我请过你的门徒把鬼赶出去，他们却是不能。"},{"english":"I was obliged to confess, and in recompense for my cowardice and inhumanity was sent out of the house.","chinese":"作为对我的懦弱和不友好的赏罚，我被赶出了房子。"},{"english":"So they drove Boner out of the door.","chinese":"因此，他们把邦德赶出了家门。"},{"english":"I know we were moved because of the World Cup.","chinese":"我知道我们被赶出来是因为世界杯。"},{"english":"He hunted his pet dog out of his house.","chinese":"他把爱犬赶出了家门。"},{"english":"Small qian to block has angered the master yoda, more is out of the clear temple.","chinese":"小倩欲阻止却惹怒了尤达大师，更被赶出导明寺。"},{"english":"So, she used her magic and kept the villagers out of the forest; the two love birds were hence well protected.","chinese":"于是，施法将村民们赶出了森林，保护了这对恋人。"},{"english":"I kicked him out. Now he wants in the house.","chinese":"我把他赶出去了，现在他想进屋里来。"},{"english":"Do you think he ought to be taken out of his school and sent to the penitentiary ?","chinese":"你们难道认为他应该被赶出校门，送进教养院？"},{"english":"Following the man's release, Christ went straight back across the lake.","chinese":"基督赶出污鬼之后，又直接渡海回去。"},{"english":"They unharnessed the horses and turned them out to grass.","chinese":"他们解下马具，把马赶出去吃草。"},{"english":"I had a relatively large report due that I was too busy to start until the last minute, but it looks like I got it all squared away.","chinese":"你是说虽然等到最后一分钟，但还是赶出来了？"},{"english":"On only 10% of occasions were queue-jumpers physically ejected from the line.","chinese":"只有10%的场合，“插队者”被从队列中赶出来。"}],"related":[{"definition":["to expel\/to drive out\/to oust"],"pinyin":["nian3 chu1"],"word":"撵出"},{"definition":["to drive out\/to turn back"],"pinyin":["gan3 zou3"],"word":"赶走"},{"definition":["to expel\/to evict\/to drive out"],"pinyin":["zhu2 chu1"],"word":"逐出"},{"definition":["to drive out\/to oust"],"pinyin":["nian3 zou3"],"word":"撵走"},{"definition":["to drive away"],"pinyin":["hong1 zou3"],"word":"轰走"},{"definition":["to expel\/to deport\/banishment"],"pinyin":["qu1 zhu2"],"word":"驱逐"},{"definition":["to drive away\/to force out\/to repel"],"pinyin":["gan3 pao3"],"word":"赶跑"},{"definition":["to defeat\/to strike down\/to destroy"],"pinyin":["da3 kua3"],"word":"打垮"},{"definition":["to occupy by force"],"pinyin":["qiang2 zhan4"],"word":"强占"},{"definition":["to run off rebuffed\/to fend off\/(to fight off and make sb) run off"],"pinyin":["da3 pao3"],"word":"打跑"},{"definition":["to drive (vehicle)\/to drive out\/to chase away\/to herd (people towards a gate)"],"pinyin":["qu1 gan3"],"word":"驱赶"},{"definition":["to drag in"],"pinyin":["tuo1 jin4"],"word":"拖进"},{"definition":["to arrest"],"pinyin":["zhua1 zou3"],"word":"抓走"},{"definition":["to flatten\/to level\/to raze to the ground"],"pinyin":["chan3 ping2"],"word":"铲平"},{"definition":["to hate bitterly"],"pinyin":["hen4 tou4"],"word":"恨透"},{"definition":["to retire\/to remove\/to withdraw\/to evacuate"],"pinyin":["che4 zou3"],"word":"撤走"}]}