{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"traditional":["起"],"rank":156.0,"normalized_rank":0.0021826423964294212,"fraction":0.0007290699297110997,"cumulative_fraction":0.3646256752069042,"word":"起","components":{"unicode":"U+8D77","character":"起","decomposition":"⿺走巳","decomposition_definitions":[{"word":"⿺"},{"definition":["to walk\/to go\/to run\/to move (of vehicle)\/to visit\/to leave\/to go away\/to die (euph.)\/from\/through\/away (in compound verbs, such as 撤走[che4 zou3])\/to change (shape, form, meaning)"],"pinyin":["zou3"],"word":"走"},{"definition":["6th earthly branch: 9-11 a.m., 4th solar month (5th May-5th June), year of the Snake\/ancient Chinese compass point: 150°"],"pinyin":["si4"],"word":"巳"}]},"containing_words":[{"definition":["in the same place\/together\/with\/altogether (in total)"],"pinyin":["yi1 qi3"],"word":"一起"},{"definition":["to stand up\/to get up\/also pr. [qi3 lai2]","(after a verb) indicating the beginning and continuation of an action or a state\/indicating an upward movement (e.g. after 站[zhan4])\/indicating completion\/(after a perception verb, e.g. 看[kan4]) expressing preliminary judgment\/also pr. [qi3 lai5]"],"pinyin":["qi3 lai5","qi5 lai5"],"word":"起来"},{"definition":["to stand up\/to get up\/also pr. [qi3 lai2]","(after a verb) indicating the beginning and continuation of an action or a state\/indicating an upward movement (e.g. after 站[zhan4])\/indicating completion\/(after a perception verb, e.g. 看[kan4]) expressing preliminary judgment\/also pr. [qi3 lai5]"],"pinyin":["qi3 lai5","qi5 lai5"],"word":"起来"},{"definition":["to give rise to\/to lead to\/to cause\/to arouse"],"pinyin":["yin3 qi3"],"word":"引起"},{"definition":["to sue\/to bring a lawsuit against\/to prosecute"],"pinyin":["qi3 su4"],"word":"起诉"},{"definition":["to mention\/to speak of\/to lift\/to pick up\/to arouse\/to raise (a topic, a heavy weight, one's fist, one's spirits etc)"],"pinyin":["ti2 qi3"],"word":"提起"},{"definition":["to originate\/to initiate\/to launch (an attack, an initiative etc)\/to start\/to propose sth (for the first time)"],"pinyin":["fa1 qi3"],"word":"发起"},{"definition":["seemingly\/apparently\/looks as if\/appear to be\/gives the impression that\/seems on the face of it to be"],"pinyin":["kan4 qi3 lai5"],"word":"看起来"},{"definition":["to rise abruptly (to a towering position)\/to tower over\/to spring up\/to emerge suddenly\/the emergence (e.g. of a power)"],"pinyin":["jue2 qi3"],"word":"崛起"},{"definition":["to recall\/to think of\/to call to mind"],"pinyin":["xiang3 qi3"],"word":"想起"},{"definition":["to lift\/to raise in height\/to begin\/upsurge\/to set off (a campaign)"],"pinyin":["xian1 qi3"],"word":"掀起"},{"definition":["to set out\/to set in motion\/the start (of some activity)"],"pinyin":["qi3 bu4"],"word":"起步"},{"definition":["starting point"],"pinyin":["qi3 dian3"],"word":"起点"},{"definition":["(of an aircraft) to take off"],"pinyin":["qi3 fei1"],"word":"起飞"},{"definition":["at the minimum\/at the very least"],"pinyin":["qi3 ma3"],"word":"起码"}],"sentences":[{"english":"Who make you mushroom so late, the whole ruddy blood temple you this hour equitable obtain up.","chinese":"谁让你起得这么晚，整个赤血宫就你这个时辰才起床。"},{"english":"The sun blistered the paint on the wall.","chinese":"在阳光下墙上的油漆起气泡了。"},{"english":"How can I rebuild my trust in him?","chinese":"怎样才能重新建立起我对他的信任？"},{"english":"Dr. Stevens has worked at the language institute since 1982.","chinese":"史蒂文斯从1982年起就一直在语言学院工作。"},{"english":"A white light flashed, lit the sky in silver.","chinese":"一道白光闪起，夜空亮起银辉。"},{"english":"He is antipathetic to new ideas.","chinese":"他天生就封新观念起反感。"},{"english":"The bird flew up from the grass.","chinese":"鸟从草地上飞起。"},{"english":"Because of how you reacted in the morning.","chinese":"一切皆由你早上的反应而起。"},{"english":"Luo city have door and the high-rise.","chinese":"例句与用法罗城的四面修有城门，上起高楼。"},{"english":"Suddenly the hero's son picked up a knife and killed the dragon.","chinese":"突然英雄的儿子拿起刀杀了龙。"},{"english":"The sky light thin mist, cricket that month.","chinese":"天边浅淡薄雾起，蛐蛐叫月。"},{"english":"Placebos work, doctors believed, because the mind is a powerful thing.","chinese":"医生们相信安慰剂起作用，是因为念力是一种力量。"},{"english":"Overseas chinese are bring into foreigners since 2000.","chinese":"从2000年起，华侨并入外国人统计。"},{"english":"He is a greto football player, from all accounts.","chinese":"外传他是个很不了起的足球运带动。"},{"english":"After, at together while just wanting to elected up a cosmetics to make up for farmland dream Jean Jean.","chinese":"之后，在齐珍珍刚要拿起化妆品帮田梦化妆的时候。"},{"english":"Santiago drank sparingly from his water bottle during the hot afternoon.","chinese":"在炽热的下午，桑提亚哥节省地喝起水壶里的水。"}],"related":[{"definition":["to begin\/beginning\/to start\/initial\/CL:個|个[ge4]"],"pinyin":["kai1 shi3"],"word":"开始"},{"definition":["self\/oneself\/from\/since\/naturally\/surely"],"pinyin":["zi4"],"word":"自"},{"definition":["in the same place\/together\/with\/altogether (in total)"],"pinyin":["yi1 qi3"],"word":"一起"},{"definition":["to stand up\/to get up\/also pr. [qi3 lai2]","(after a verb) indicating the beginning and continuation of an action or a state\/indicating an upward movement (e.g. after 站[zhan4])\/indicating completion\/(after a perception verb, e.g. 看[kan4]) expressing preliminary judgment\/also pr. [qi3 lai5]"],"pinyin":["qi3 lai5","qi5 lai5"],"word":"起来"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["surname Cong","from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor"],"pinyin":["Cong2","cong2"],"word":"从"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["outset\/beginning"],"pinyin":["yi1 shi3"],"word":"伊始"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"},{"definition":["after\/later\/afterwards\/following\/later on\/in the future"],"pinyin":["yi3 hou4"],"word":"以后"},{"definition":["plain\/informal\/suitable\/convenient\/opportune\/to urinate or defecate\/equivalent to 就[jiu4]: then\/in that case\/even if\/soon afterwards","see 便宜|便宜[pian2 yi5]"],"pinyin":["bian4","pian2"],"word":"便"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"点"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["again\/once more\/re-\/second\/another\/then (after sth, and not until then)\/no matter how ... (followed by an adjective or verb, and then (usually) 也[ye3] or 都[dou1] for emphasis)"],"pinyin":["zai4"],"word":"再"}]}