{"definition":["to start out by\/to grow an enterprise beginning with\/to begin one's career by"],"pinyin":["qi3 jia1"],"traditional":["起家"],"rank":14353.0,"normalized_rank":0.20081709176891974,"fraction":0.000004466477449094538,"cumulative_fraction":0.9562470149044175,"word":"起家","characters":[{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"}],"containing_words":[{"definition":["to build up from nothing\/to start from scratch"],"pinyin":["bai2 shou3 qi3 jia1"],"word":"白手起家"},{"definition":["to rise up by thrift and hard work (idiom)"],"pinyin":["qin2 jian3 qi3 jia1"],"word":"勤俭起家"},{"definition":["to start from scratch (idiom)"],"pinyin":["ping2 di4 qi3 jia1"],"word":"平地起家"}],"sentences":[{"english":"And therein lies the problem for this self-made billionaire.","chinese":"这个白手起家的亿万富翁也面临着问题。"},{"english":"A lot of rock stars started out playing in garage bands before they got big.","chinese":"许多著名的摇滚乐手是从车库乐队起家的。"},{"english":"Samsung began as a small noodle business in 1938.","chinese":"早在1938年，三星干面粉行业起家。"},{"english":"Cai says his Horatio Alger story is “typical of Wenzhou.","chinese":"蔡说，他的白手起家的故事是一个”温州的典型“。"},{"english":"National Pingtung University of Science and Technology (NPUST) was first founded in 1924 as an agricultural high school.","chinese":"国立屏东科技大学创校于1924年，以农校起家。"},{"english":"That was how my style got started.","chinese":"我的风格就是这样起家的。"},{"english":"She came to this country, and she started a laundry business from nothing.","chinese":"她来到这个国家，白手起家，办起洗衣店。"},{"english":"She started off making gowns and lingerie in her home.","chinese":"罗莎丽亚靠制造睡衣和内衣起家。"},{"english":"He baked the torte from scratch.","chinese":"他从烤果子奶油蛋糕白手起家。"},{"english":"Both firms' founders were early practitioners of the lean startup method.","chinese":"两家公司的创办者是薄本起家方法的早期实践者。"},{"english":"Wong Kwong Yu about how to start their own has been a closely-guarded secret.","chinese":"黄光裕对于自己如何起家，一直讳莫如深。"},{"english":"Smith has worked the firm up from almost nothing.","chinese":"史密斯几乎是白手起家，搞起了这家公司。"},{"english":"Inventing such a camera wouldn't be easy, but Cameron said he wasreadyto break new ground.","chinese":"发明这种像机绝非易事，但卡梅隆决定白手起家。"},{"english":"They've been created from scratch and they're very successful.","chinese":"他们是白手起家的，现在很成功。"},{"english":"The beauty of starting a Web business is that you can do it on a shoestring.","chinese":"创办网络的好处在于你可以白手起家。"},{"english":"Before liberation few workers could support their families.","chinese":"解放前几乎没有工人能养得起家。"}],"related":[{"definition":["to lay down a family fortune\/to get rich\/to become prosperous"],"pinyin":["fa1 jia1"],"word":"发家"},{"definition":["to make one's mark\/to go up in the world\/to make one's fortune"],"pinyin":["fa1 ji4"],"word":"发迹"},{"definition":["to seize power\/to conquer the world\/to establish and expand a business\/to carve out a career for oneself"],"pinyin":["da3 tian1 xia4"],"word":"打天下"},{"definition":["to set foot in\/to step into\/to become involved for the first time"],"pinyin":["she4 zu2"],"word":"涉足"},{"definition":["to build up from nothing\/to start from scratch"],"pinyin":["bai2 shou3 qi3 jia1"],"word":"白手起家"},{"definition":["to establish\/to set up\/to found"],"pinyin":["chuang4 li4"],"word":"创立"},{"definition":["big boss\/leader of a group\/dominant (position)"],"pinyin":["long2 tou2 lao3 da4"],"word":"龙头老大"},{"definition":["to be born of\/to come from\/family background\/class origin"],"pinyin":["chu1 shen1"],"word":"出身"},{"definition":["to march\/to advance"],"pinyin":["jin4 jun1"],"word":"进军"},{"definition":["early years\/adolescence"],"pinyin":["zao3 nian2"],"word":"早年"},{"definition":["the first pot of gold\/the initial profits from an economic endeavour"],"pinyin":["di4 yi1 tong3 jin1"],"word":"第一桶金"},{"definition":["arrogant\/to put on airs\/(business etc) to expand\/to enlarge\/to do sth on a big scale"],"pinyin":["zuo4 da4"],"word":"做大"},{"definition":["business\/CL:筆|笔[bi3]","life force\/vitality"],"pinyin":["sheng1 yi5","sheng1 yi4"],"word":"生意"},{"definition":["main business"],"pinyin":["zhu3 ye4"],"word":"主业"},{"definition":["nouveau riche\/upstart\/new appointee"],"pinyin":["xin1 gui4"],"word":"新贵"},{"definition":["to form one's own group or school of thought\/to set up one's own business\/to establish oneself"],"pinyin":["zi4 li4 men2 hu4"],"word":"自立门户"}]}