{"definition":["to originate"],"pinyin":["qi3 shi3"],"traditional":["起始"],"rank":15191.0,"normalized_rank":0.21254179900102133,"fraction":0.000004053652720328995,"cumulative_fraction":0.9598165423138044,"word":"起始","characters":[{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"},{"definition":["to begin\/to start\/then\/only then"],"pinyin":["shi3"],"word":"始"}],"containing_words":[],"sentences":[{"english":"This is the starting value for the two data sets.","chinese":"这是两个数据集的起始值。"},{"english":"Uncover the starting and ending points and start filling in the blanks one at a time.","chinese":"找到起始点，然后开始填补空白。"},{"english":"The server part of the channel is located at the start of the server context sink chain.","chinese":"通道的伺服器部分位在伺服器内容接收链结的起始端。"},{"english":"Write the words in front of, summing up the work starting.","chinese":"即写在前面的话，工作总结起始的段落。"},{"english":"Gets the starting column of a script block in the generated source file.","chinese":"获取生成资源文件中某个脚本块的起始列。"},{"english":"You create a new project that deals with requirements for a new starship generation.","chinese":"您需要为一个新的起始代，创建一个新项目。"},{"english":"Take a look at the start page for an example of the inclusion.","chinese":"在起始页中可看到包含的示例。"},{"english":"The appointment form must have a start date field.","chinese":"约会表单必须有一个起始日期字段。"},{"english":"He stood there at the starting line with a regular piece of paper.","chinese":"他那这一张普通的纸站在起始线上。"},{"english":"A melancholy fold, which resembled the beginning of irony, wrinkled her right cheek.","chinese":"一条含愁的皱痕横在她的右脸上，仿佛是冷笑的起始。"},{"english":"Attributes are always added to the start tag of an HTML element.","chinese":"属性应该添加在HTML元素里的起始标签中。"},{"english":"There is a hypermethylation sequential basis in the upstream region from the transcriptional start site of IRX1 gene.","chinese":"IRX1基因转录起始点上游存在高甲基化结构基础。"},{"english":"This is regarded as the beginning of barehanded martial arts and healthcare martial arts.","chinese":"以上是徒手武术而后保健武术的起始。"},{"english":"Ancona now starts as a rebel region.","chinese":"安科纳现在起始是叛乱地区。"},{"english":"“For us the starting point is always the science,” Dr. McGill said.","chinese":"“对我们来说，科学就是起始点，”麦克吉尔博士说。"},{"english":"Designates the start or destination of a hypertext link.","chinese":"表示超链接的起始或目的位置。"}],"related":[{"definition":["initial\/starting (point)"],"pinyin":["chu1 shi3"],"word":"初始"},{"definition":["beginning\/origin\/to originate\/to initiate"],"pinyin":["fa1 duan1"],"word":"发端"},{"definition":["starting point\/initial point"],"pinyin":["shi3 dian3"],"word":"始点"},{"definition":["to initiate\/to start\/the start"],"pinyin":["zhao4 shi3"],"word":"肇始"},{"definition":["to increase by degrees\/in increasing order\/incremental\/progressive"],"pinyin":["di4 zeng1"],"word":"递增"},{"definition":["to be considered to be\/to be defined to be\/to be called"],"pinyin":["ji2 wei2"],"word":"即为"},{"definition":["midpoint\/half-way point"],"pinyin":["zhong1 dian3"],"word":"中点"},{"definition":["namely\/that is\/i.e.\/prompt\/at once\/at present\/even if\/prompted (by the occasion)\/to approach\/to come into contact\/to assume (office)\/to draw near"],"pinyin":["ji2"],"word":"即"},{"definition":["to begin\/beginning\/to start\/initial\/CL:個|个[ge4]"],"pinyin":["kai1 shi3"],"word":"开始"},{"definition":["the end\/end point\/finishing line (in a race)\/destination\/terminus\/CL:個|个[ge4]"],"pinyin":["zhong1 dian3"],"word":"终点"},{"definition":["progressively decreasing\/gradually falling\/in descending order"],"pinyin":["di4 jian3"],"word":"递减"},{"definition":["icon (computing)"],"pinyin":["tu2 shi4"],"word":"图示"},{"definition":["to correspond\/a correspondence\/corresponding\/homologous\/matching with sth\/counterpart"],"pinyin":["dui4 ying4"],"word":"对应"},{"definition":["groundbreaking\/to lay foundation"],"pinyin":["dian4 ji1"],"word":"奠基"},{"definition":["sequence\/order"],"pinyin":["shun4 xu4"],"word":"顺序"},{"definition":["norm\/standard\/standard of reference\/base\/base point\/base line\/benchmark\/reference point\/reference frame\/criterion\/data"],"pinyin":["ji1 zhun3"],"word":"基准"}]}