{"definition":["to rise from the dead (idiom); fig. an unexpected recovery"],"pinyin":["qi3 si3 hui2 sheng1"],"traditional":["起死回生"],"rank":24703.0,"normalized_rank":0.345627019993564,"fraction":0.0000015210868719013331,"cumulative_fraction":0.9838451587821364,"word":"起死回生","characters":[{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"},{"definition":["to die\/impassable\/uncrossable\/inflexible\/rigid\/extremely\/damned"],"pinyin":["si3"],"word":"死"},{"definition":["to curve\/to return\/to revolve","to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)","variant of 迴|回[hui2]"],"pinyin":["hui2","hui2","hui2"],"word":"回"},{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"}],"containing_words":[],"sentences":[{"english":"She set off on a journey to obtain a potent medicinal herb, which could revive her husband.","chinese":"因此白蛇外出寻找能使许仙起死回生的强效药草。"},{"english":"Can the Pakistani government's web of deceit survive the death of Osama bin Laden?","chinese":"巴基斯坦政府的谎言之网能让拉登起死回生吗？"},{"english":"A good teacher is good luck of a student.","chinese":"好老师有起死回生的力量，是学生的幸运之星。"},{"english":"The old witch said she could raise the dead.","chinese":"老巫婆说她能起死回生。"},{"english":"It is said that this medicine can resurrect the dead.","chinese":"据说这种药能起死回生。"},{"english":"A while ago Gles was a well-known witch-doctor capable of curing even the most horrible wounds.","chinese":"格雷丝在过去是一位能起死回生的知名巫医。"},{"english":"We buy insurance for just about everything including our life but money can never bring life back.","chinese":"我们买所有的保险包括人生保险，但钱不能起死回生。"}],"related":[{"definition":["to bring back to life"],"pinyin":["jiu4 huo2"],"word":"救活"},{"definition":["magical hands bring the dying back to life (idiom); miracle cure\/brilliant doctor"],"pinyin":["miao4 shou3 hui2 chun1"],"word":"妙手回春"},{"definition":["lit. to upend heaven and earth (idiom)\/fig. to change the course of events\/to turn things around"],"pinyin":["niu3 zhuan3 qian2 kun1"],"word":"扭转乾坤"},{"definition":["to come back from death's door (idiom); unexpected rescue from danger\/fig. to recover from a seemingly impossible situation\/to find a way out of a predicament"],"pinyin":["jue2 chu3 feng2 sheng1"],"word":"绝处逢生"},{"definition":["to be reborn\/rebirth"],"pinyin":["chong2 sheng1"],"word":"重生"},{"definition":["lit. to change something rotten into something magical (idiom)"],"pinyin":["hua4 fu3 xiu3 wei2 shen2 qi2"],"word":"化腐朽为神奇"},{"definition":["effective cure, miracle medicine (idiom); fig. wonder-cure for all problems\/panacea\/elixir"],"pinyin":["ling2 dan1 miao4 yao4"],"word":"灵丹妙药"},{"definition":["to return from the grave\/(old) to recycle (waste products)"],"pinyin":["huan2 hun2"],"word":"还魂"},{"definition":["return of spring"],"pinyin":["hui2 chun1"],"word":"回春"},{"definition":["lit. reincarnated in sb else's body (idiom); fig. a discarded or discredited idea returns in another guise"],"pinyin":["jie4 shi1 huan2 hun2"],"word":"借尸还魂"},{"definition":["to touch base matter and turn it to gold (idiom); fig. to turn crude writing into a literary gem"],"pinyin":["dian3 shi2 cheng2 jin1"],"word":"点石成金"},{"definition":["to rise from the ashes (idiom)\/to thrive again after surviving an ordeal"],"pinyin":["yu4 huo3 chong2 sheng1"],"word":"浴火重生"},{"definition":["to revive\/(lit. and fig.) to come back to life\/(religion) resurrection"],"pinyin":["fu4 huo2"],"word":"复活"},{"definition":["to save\/to remedy\/to rescue"],"pinyin":["wan3 jiu4"],"word":"挽救"},{"definition":["place sb on a field of death and he will fight to live (idiom based on Sunzi's \"The Art of War\" 孫子兵法|孙子兵法[Sun1 zi3 Bing1 fa3]); to fight desperately when confronting mortal danger\/fig. to find a way out of an impasse"],"pinyin":["zhi4 zhi1 si3 di4 er2 hou4 sheng1"],"word":"置之死地而后生"},{"definition":["to save\/to rescue"],"pinyin":["zheng3 jiu4"],"word":"拯救"}]}