{"definition":["to set out\/to set in motion\/the start (of some activity)"],"pinyin":["qi3 bu4"],"traditional":["起步"],"rank":4807.0,"normalized_rank":0.06725616666433479,"fraction":0.000025363612667260716,"cumulative_fraction":0.8541736084411177,"word":"起步","characters":[{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"},{"definition":["surname Bu","a step\/a pace\/walk\/march\/stages in a process\/situation"],"pinyin":["Bu4","bu4"],"word":"步"}],"containing_words":[],"sentences":[{"english":"Yeah, but it's all starting, a lot of work.","chinese":"是的，但它已经全面起步了，有大量的工作要做。"},{"english":"Birding is a fun, rewarding hobby that is easy to get started with.","chinese":"观鸟是一种有趣而有益的爱好，也也很容易起步。"},{"english":"So I'm on the road a bit, and I hold meetings, sometimes at the client's place.","chinese":"我才刚刚起步，有时候我在客户提供的地点开会。"},{"english":"Nearly all U.S. professional baseball players start their careers in the minor leagues.","chinese":"几乎所有美国职业棒球球员都是从小联盟起步的。"},{"english":"The driving wheel may slip while starting or speeding up.","chinese":"在起步或加速时，驱动轮可能会打滑。"},{"english":"The fifth right traffic right in China has started to open up to the outside world.","chinese":"我国第五航权的开放刚开始起步。"},{"english":"China's aircraft leasing business has an experience of more than 20 years, but still in its infancy.","chinese":"中国的飞机租赁业历经20余年，仍处于起步阶段。"},{"english":"Wireless trading in Korea predates its introduction in Japan.","chinese":"无线交易在韩国的起步要早于日本。"},{"english":"The investment of China in Asia started late but developed rapidly.","chinese":"中国对亚洲地区投资起步晚，发展迅猛。"},{"english":"Driving a vehicle should be a smooth start, quickly shifting action.","chinese":"驾驶车辆时应做到起步平稳，换挡动作迅速。"},{"english":"The sample above is a trivial variation of the QuickStart app.","chinese":"上面的例子是《快速起步》应用的一个简单的变体。"},{"english":"Five-year high vocational education in medical college starts late.","chinese":"医学院校的五年制高职起步晚。"},{"english":"Our tele-medicine start late, but it develops fast.","chinese":"我军远程医疗起步较晚，但发展较快。"},{"english":"Since the community service industry in Quanzhou city starts late, it develops rapidly.","chinese":"泉州市的社区服务业起步较迟，但发展很快。"},{"english":"Q. Off the start line into the first corner and the incident with Vettel?","chinese":"在起步线之后的第一个弯角你与瓦特尔有一个小事故？"},{"english":"Releasing Tenzin Delek and his supporters would be a good start.","chinese":"释放丹增德勒和他的支持者是一个很好的起步。"}],"related":[{"definition":["entrance door\/to enter a door\/introduction (to a subject)"],"pinyin":["ru4 men2"],"word":"入门"},{"definition":["to increase the specified cruising speed\/to pick up speed\/to speed up"],"pinyin":["ti2 su4"],"word":"提速"},{"definition":["to brake (when driving)\/to stop\/to switch off\/to check (bad habits)\/a brake"],"pinyin":["sha1 che1"],"word":"刹车"},{"definition":["manual gear change\/shift stick"],"pinyin":["shou3 dong4 dang3"],"word":"手动挡"},{"definition":["to overtake (another car)"],"pinyin":["chao1 che1"],"word":"超车"},{"definition":["automatic transmission\/auto gear shift"],"pinyin":["zi4 dong4 dang3"],"word":"自动挡"},{"definition":["to change gear"],"pinyin":["huan4 dang3"],"word":"换挡"},{"definition":["accelerator (pedal)\/gas pedal\/throttle"],"pinyin":["you2 men2"],"word":"油门"},{"definition":["to speed up\/to expedite"],"pinyin":["jia1 su4"],"word":"加速"},{"definition":["downhill"],"pinyin":["xia4 po1"],"word":"下坡"},{"definition":["vehicle speed"],"pinyin":["che1 su4"],"word":"车速"},{"definition":["uphill\/upslope\/to move upwards\/to climb a slope"],"pinyin":["shang4 po1"],"word":"上坡"},{"definition":["to start up (a motor)\/to launch (a computer application)"],"pinyin":["qi3 dong4"],"word":"起动"},{"definition":["speed\/rate\/velocity\/(music) tempo\/CL:個|个[ge4]"],"pinyin":["su4 du4"],"word":"速度"},{"definition":["initial stage\/beginning period"],"pinyin":["chu1 qi1"],"word":"初期"},{"definition":["to put into gear\/to engage the gear\/gear change"],"pinyin":["gua4 dang3"],"word":"挂挡"}]}