{"definition":["to stand up\/to get up\/also pr. [qi3 lai2]","(after a verb) indicating the beginning and continuation of an action or a state\/indicating an upward movement (e.g. after 站[zhan4])\/indicating completion\/(after a perception verb, e.g. 看[kan4]) expressing preliminary judgment\/also pr. [qi3 lai5]"],"pinyin":["qi3 lai5","qi5 lai5"],"traditional":["起來","起來"],"rank":480.0,"normalized_rank":0.006715822758244372,"fraction":0.0002985851196030527,"cumulative_fraction":0.5066047309404738,"word":"起来","characters":[{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"来"}],"containing_words":[{"definition":["seemingly\/apparently\/looks as if\/appear to be\/gives the impression that\/seems on the face of it to be"],"pinyin":["kan4 qi3 lai5"],"word":"看起来"},{"definition":["to stand up"],"pinyin":["zhan4 qi3 lai5"],"word":"站起来"},{"definition":["to sound like"],"pinyin":["ting1 qi5 lai5"],"word":"听起来"},{"definition":["to remember\/to recall"],"pinyin":["xiang3 qi5 lai5"],"word":"想起来"},{"definition":["to get better\/to improve\/to get well"],"pinyin":["hao3 qi3 lai5"],"word":"好起来"},{"definition":["Proletarier aller Länder, vereinigt euch!\/Workers of the world, unite!"],"pinyin":["quan2 shi4 jie4 wu2 chan3 zhe3 lian2 he2 qi3 lai5"],"word":"全世界无产者联合起来"},{"definition":["to put together"],"pinyin":["pin1 qi5 lai5"],"word":"拼起来"},{"definition":["to calculate\/to estimate\/in total\/all told\/(fig.) if you think about it"],"pinyin":["suan4 qi3 lai2"],"word":"算起来"},{"definition":["to get enthusiastic\/to put in all one's energy"],"pinyin":["mao3 qi3 lai5"],"word":"铆起来"},{"definition":["lit. like tofu strung on horsetail, you can't lift it\/fig. let's not talk of this (pun on 提[ti2])"],"pinyin":["ma3 wei3 chuan1 dou4 fu5 , ti2 bu5 qi3 lai5"],"word":"马尾穿豆腐，提不起来"}],"sentences":[{"english":"His talking is full of speculative thinking, it sounds quite logical.","chinese":"讲话的思辨性极强，听起来很有逻辑。"},{"english":"Anne closed her book and stood up.","chinese":"安尼合上书，站了起来。"},{"english":"It sounds like the crying of a baby.","chinese":"听起来像小孩的哭泣声。"},{"english":"What did these tattoos look like?","chinese":"这些纹身看起来像什么？"},{"english":"It is often combined with elements of numerology .","chinese":"通常，风水还与占数学的原理结合起来使用。"},{"english":"The boys are seen with some style changes and dramatic smoky eye make up.","chinese":"男孩们看起来造型有了些变化，而且还化了烟熏妆。"},{"english":"The breath of Jehovah, like a stream of brimstone , Sets it on fire.","chinese":"耶和华的气如一股硫磺火，使它着起来。"},{"english":"There was a roar of anger from his fellows: Scabior drew his wand.","chinese":"他的同伙们怒吼起来，斯卡比奥拔出魔杖。"},{"english":"The controls line up so that they can be read like an English sentence.","chinese":"控件整队排列，使它们读起来像一个英语句子。"},{"english":"VOICE: So it sounds as if anabolic steroids can be very destructive.","chinese":"所以，听起来合成代谢类固醇的破坏性会很大。"},{"english":"Presently she started up, exclaiming that they wouldbe late for breakfast;","chinese":"不一会儿她跳了起来，嚷着他们要耽误早饭了。"},{"english":"You and your agent are looking like hogs about now.","chinese":"你跟你的经纪人现在看起来就像肥猪。"},{"english":"We have our enemy almost surrounded.","chinese":"我们差不多把敌人包围起来了。"},{"english":"This gives you the feeling of flying when you cum.","chinese":"这样你高潮的时候会有一种飞起来的感觉。"},{"english":"Xiaowen looks just like all her classmates.","chinese":"小文看起来就像她所有的同学一样。"},{"english":"The people jumped up and cried.","chinese":"人们惊跳起来大哭。"}],"related":[{"definition":["(after a verb, indicates coming out, completion of an action, or ability to discern or detect)","to come out\/to appear\/to arise"],"pinyin":["chu5 lai5","chu1 lai2"],"word":"出来"},{"definition":["to go up"],"pinyin":["shang4 qu4"],"word":"上去"},{"definition":["to become"],"pinyin":["bian4 de5"],"word":"变得"},{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["to come down\/(completed action marker)\/(after verb of motion, indicates motion down and towards us, also fig.)\/(indicates continuation from the past towards us)\/to be harvested (of crops)\/to be over (of a period of time)\/to go among the masses (said of leaders)"],"pinyin":["xia4 lai5"],"word":"下来"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"},{"definition":["to begin\/beginning\/to start\/initial\/CL:個|个[ge4]"],"pinyin":["kai1 shi3"],"word":"开始"},{"definition":["to be fond of\/to have a tendency to\/to be prone to","good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello"],"pinyin":["hao4","hao3"],"word":"好"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["more (than sth else)\/even more"],"pinyin":["geng4 jia1"],"word":"更加"},{"definition":["to come over\/to manage\/to handle\/to be able to take care of","see 過來|过来[guo4 lai2]"],"pinyin":["guo4 lai2","guo4 lai5"],"word":"过来"},{"definition":["to go down\/to descend\/to go on\/to continue\/(of a servant) to withdraw"],"pinyin":["xia4 qu4"],"word":"下去"},{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["together"],"pinyin":["zai4 yi1 qi3"],"word":"在一起"},{"definition":["this kind of\/so\/this way\/like this\/such"],"pinyin":["zhe4 yang4"],"word":"这样"}]}