{"definition":["to explode\/to set off an explosion\/to detonate"],"pinyin":["qi3 bao4"],"traditional":["起爆"],"rank":31510.0,"normalized_rank":0.440865781483917,"fraction":8.247735917699169e-7,"cumulative_fraction":0.991573649361536,"word":"起爆","characters":[{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"},{"definition":["to explode or burst\/to quick fry or quick boil"],"pinyin":["bao4"],"word":"爆"}],"containing_words":[{"definition":["\"fizzle\" (atomic bomb misfire)\/preinitiation"],"pinyin":["ti2 qian2 qi3 bao4"],"word":"提前起爆"},{"definition":["preinitiation"],"pinyin":["guo4 zao3 qi3 bao4"],"word":"过早起爆"}],"sentences":[{"english":"It can be the most advanced initiation system with development of information technology.","chinese":"随着信息技术的发展，它将成为最先进的起爆系统。"},{"english":"The fragment impact initiation of the charge covered with a thin plate was researched.","chinese":"研究破片对薄盖板装药的冲击起爆问题。"},{"english":"The calculation and the analysis of reliability which dupication crossover initiation network of Nonel are introduced.","chinese":"介绍了导爆管复式交叉起爆网路可靠性的计算与分析。"},{"english":"A large amount of amorce was needed.","chinese":"需要大量的起爆剂。"},{"english":"There is a box of blasting caps in the shed over there, so be careful.","chinese":"那边的小屋里有一箱起爆雷管，当心点儿。"},{"english":"A safe initiation system is of great importance to engineering blasting.","chinese":"安全起爆系统对于工程爆破是极为重要的。"},{"english":"The regularity of fragments dispersion of the warhead under asymmetrical multi spots initiation is studied.","chinese":"研究战斗部偏心多点起爆条件下破片径向飞散规律。"},{"english":"The shock-to-detonation transition (SDT) of insensitive high explosives (IHE) is researched in this paper.","chinese":"本文主要介绍了钝感炸药的冲击起爆过程。"},{"english":"A new non primary explosive electric detonator with only high explosive adopted was introduced in this paper.","chinese":"介绍了一种只采用猛炸药的非起爆药电雷管。"},{"english":"The thesis aims to study on safety design of transportation devices for primary explosive powder.","chinese":"设计了起爆药运输装置，并完善附属结构。"},{"english":"The function of omnidirectional contact detonation is required in contact fuzes used on many ammunitions.","chinese":"许多弹药配用的触发引信要求具有万向触发起爆功能。"},{"english":"Without the detonator codes, those older nukes were no more dangerous than paperweights.","chinese":"没有起爆编码，这些老式的核弹头还不如镇纸危险。"},{"english":"The re-initiation phenomenon of gaseous detonation in a heart-shape tube was numerically studied.","chinese":"针对心形管内气相爆轰二次起爆过程进行了数值研究。"},{"english":"Right to save less left little, controlled the initiators, but has not been seen less left.","chinese":"右少为救左少，控制了起爆器，但左少己不见踪影。"}],"related":[{"definition":["a detonator"],"pinyin":["yin3 xin4"],"word":"引信"},{"definition":["landmine\/CL:顆|颗[ke1]\/(fig.) sore point\/weak spot"],"pinyin":["di4 lei2"],"word":"地雷"},{"definition":["to blow up\/to demolish (using explosives)\/dynamite\/blast"],"pinyin":["bao4 po4"],"word":"爆破"},{"definition":["detonator"],"pinyin":["yin3 bao4 zhuang1 zhi4"],"word":"引爆装置"},{"definition":["bomb\/CL:枚[mei2],顆|颗[ke1]"],"pinyin":["zha4 dan4"],"word":"炸弹"},{"definition":["to ignite\/to light a fire\/to agitate\/to start an engine\/ignition\/fig. to stir up trouble"],"pinyin":["dian3 huo3"],"word":"点火"},{"definition":["grenade"],"pinyin":["shou3 lei2"],"word":"手雷"},{"definition":["pulse (physics)"],"pinyin":["mai4 chong1"],"word":"脉冲"},{"definition":["an impact detonator"],"pinyin":["chu4 fa1 yin3 xin4"],"word":"触发引信"},{"definition":["explosive (material)"],"pinyin":["zha4 yao4"],"word":"炸药"},{"definition":["firing pin"],"pinyin":["zhuang4 zhen1"],"word":"撞针"},{"definition":["fuse (for an explosive device)\/electrical lead\/intermediary\/catalyst\/(dialect) sewing needle"],"pinyin":["yin3 xian4"],"word":"引线"},{"definition":["bomb\/explosion"],"pinyin":["bao4 dan4"],"word":"爆弹"},{"definition":["high explosive shell\/grenade"],"pinyin":["liu2 dan4"],"word":"榴弹"},{"definition":["(military) fragmentation (grenade, bomb etc)"],"pinyin":["po4 pian4 sha1 shang1"],"word":"破片杀伤"},{"definition":["to shoot (a projectile)\/to fire (a rocket)\/to launch\/to emit (a particle)\/to discharge\/emanation\/emission"],"pinyin":["fa1 she4"],"word":"发射"}]}