{"definition":["to follow after\/immediately afterwards"],"pinyin":["gen1 zhe5"],"traditional":["跟著"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"跟着","characters":[{"definition":["heel\/to follow closely\/to go with\/(of a woman) to marry sb\/with\/compared with\/to\/towards\/and (joining two nouns)"],"pinyin":["gen1"],"word":"跟"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"}],"containing_words":[],"sentences":[{"english":"A ghost is following your girlfriend.","chinese":"有鬼跟着你的女朋友。"},{"english":"When the chicken crow, follow the chicken.","chinese":"鸡叫的时候，你就跟着鸡走。"},{"english":"His old legs and shoulders pivoted with the swinging of the pulling.","chinese":"他一把把地拉着，两条老迈的腿儿和肩膀跟着转动。"},{"english":"Red back home, light fire make life.","chinese":"红色跟着回家，人间烟火。"},{"english":"I holdopen the door and he walks in.","chinese":"我开了门，他跟着走进来。"},{"english":"The boys and girls danced to the disco music.","chinese":"少男少女们跟着迪斯科音乐跳舞。"},{"english":"But it’s hard, a bit like learning to sing by watching MTV.","chinese":"但这很困难，有点类似于跟着MTV学唱歌。"},{"english":"The hunter wnosked slowly in the forest! followed by his wolf-dog.","chinese":"猎人在森林里逐渐地走着，后背跟着一只狼狗。"},{"english":"I just followed his lead. But what was that?","chinese":"我就是跟着领舞的那个人。但这是什么舞？"},{"english":"The wire snapped at the wall plug and the light fused.","chinese":"墙上插座的电线短路烧断了保险丝，电灯跟着灭了。"},{"english":"Now, follow me. please. All right. Can you sing it now?","chinese":"现在，请跟着我。好的。你们现在能唱这首歌了吗？"},{"english":"Doctor zhao old kang to xing full hospital, also let go Li Zhongping followed.","chinese":"赵医生安排老康去兴满医院，还让黎仲平跟着一起走。"},{"english":"The students trooped behind the teacher into the museum.","chinese":"学生列队跟着老师走进博物馆。"},{"english":"I could only spare two or three hours, from my numerous diurnal occupations, to follow her footsteps .","chinese":"我只能从无数的日常工作中挤出两三个小时来跟着她。"},{"english":"He drives his own car everywhere and does not have a driver or security people around him.","chinese":"他都自己开车出门，也没有请司机或保全人员跟着他。"},{"english":"Samboy did the same as he had learned too.","chinese":"山博也学过，也跟着这样做。"}],"related":[{"definition":["to follow"],"pinyin":["gen1 sui2"],"word":"跟随"},{"definition":["heel\/to follow closely\/to go with\/(of a woman) to marry sb\/with\/compared with\/to\/towards\/and (joining two nouns)"],"pinyin":["gen1"],"word":"跟"},{"definition":["(onom.) smack!","(modal particle indicating suggestion or surmise)\/...right?\/...OK?\/...I presume.","bar (loanword) (serving drinks, or providing Internet access etc)\/to puff (on a pipe etc)\/(onom.) bang\/abbr. for 貼吧|贴吧[tie1 ba1]"],"pinyin":["bia1","ba5","ba1"],"word":"吧"},{"definition":["in the same place\/together\/with\/altogether (in total)"],"pinyin":["yi1 qi3"],"word":"一起"},{"definition":["to take a look at\/to examine\/to survey\/(coll.) pretty soon"],"pinyin":["kan4 kan5"],"word":"看看"},{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["to walk\/to go\/to run\/to move (of vehicle)\/to visit\/to leave\/to go away\/to die (euph.)\/from\/through\/away (in compound verbs, such as 撤走[che4 zou3])\/to change (shape, form, meaning)"],"pinyin":["zou3"],"word":"走"},{"definition":["we or us (including both the speaker and the person(s) spoken to)\/(dialect) I or me\/(dialect) (in a coaxing or familiar way) you\/also pr. [za2 men5]"],"pinyin":["zan2 men5"],"word":"咱们"},{"definition":["hurriedly\/without delay"],"pinyin":["gan3 jin3"],"word":"赶紧"},{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"带"},{"definition":["to accompany\/to keep sb company\/to assist\/old variant of 賠|赔[pei2]"],"pinyin":["pei2"],"word":"陪"},{"definition":["thereupon\/as a result\/consequently\/thus\/hence"],"pinyin":["yu2 shi4"],"word":"于是"},{"definition":["to catch up with\/to keep pace with"],"pinyin":["gen1 shang4"],"word":"跟上"},{"definition":["but\/however\/(used for emphasis) indeed"],"pinyin":["ke3 shi4"],"word":"可是"},{"definition":["to know\/to become aware of\/also pr. [zhi1 dao5]"],"pinyin":["zhi1 dao4"],"word":"知道"},{"definition":["(of an animal) to paw (the ground)","to run\/to run away\/to escape\/to run around (on errands etc)\/(of a gas or liquid) to leak or evaporate\/(verb complement) away\/off"],"pinyin":["pao2","pao3"],"word":"跑"}]}