{"definition":["lit. even jumping into the Yellow River can't get you clean\/fig. to become inexorably mixed up\/mired in controversy\/in deep trouble"],"pinyin":["tiao4 jin4 Huang2 He2 xi3 bu4 qing1"],"traditional":["跳進黃河洗不清"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"跳进黄河洗不清","characters":[{"definition":["to jump\/to hop\/to skip over\/to bounce\/to palpitate"],"pinyin":["tiao4"],"word":"跳"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"进"},{"definition":["surname Huang or Hwang","yellow\/pornographic\/to fall through"],"pinyin":["Huang2","huang2"],"word":"黄"},{"definition":["river\/CL:條|条[tiao2],道[dao4]"],"pinyin":["he2"],"word":"河"},{"definition":["to wash\/to bathe\/to develop (photo)"],"pinyin":["xi3"],"word":"洗"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["Qing or Ch'ing dynasty of imperial China (1644-1911)\/surname Qing","clear\/distinct\/quiet\/just and honest\/pure\/to settle or clear up\/to clean up or purge"],"pinyin":["Qing1","qing1"],"word":"清"}],"containing_words":[],"sentences":[],"related":[{"definition":["lit. the more you touch things up, the darker they get\/fig. to only make matters worse"],"pinyin":["yue4 miao2 yue4 hei1"],"word":"越描越黑"},{"definition":["lit. 300 silver taels not hidden here (idiom); fig. to reveal what one intends to hide"],"pinyin":["ci3 di4 wu2 yin2 san1 bai3 liang3"],"word":"此地无银三百两"},{"definition":["If you want to condemn sb, don't worry about the pretext (idiom, from Zuozhuan 左傳|左传); one can always trump up a charge against sb\/Give a dog a bad name, then hang him."],"pinyin":["yu4 jia1 zhi1 zui4 , he2 huan4 wu2 ci2"],"word":"欲加之罪，何患无辞"},{"definition":["to confess without being pressed\/to make a confession without duress"],"pinyin":["bu4 da3 zi4 zhao1"],"word":"不打自招"},{"definition":["lit. public opinion is powerful enough to melt metal (idiom)\/fig. public clamor can obscure the actual truth\/mass spreading of rumors can confuse right and wrong"],"pinyin":["zhong4 kou3 shuo4 jin1"],"word":"众口铄金"},{"definition":["lit. to strike with a muckrake (idiom), cf Pigsy 豬八戒|猪八戒 in Journey to the West 西遊記|西游记; fig. to counterattack\/to make bogus accusations (against one's victim)"],"pinyin":["dao4 da3 yi1 pa2"],"word":"倒打一耙"},{"definition":["driven to join the Liangshan Mountain rebels\/to drive to revolt\/to force sb to desperate action"],"pinyin":["bi1 shang4 liang2 shan1"],"word":"逼上梁山"},{"definition":["lit. a lamb in a tiger's den (idiom)\/fig. to tread dangerous ground"],"pinyin":["yang2 ru4 hu3 kou3"],"word":"羊入虎口"},{"definition":["three men talking makes a tiger (idiom); repeated rumor becomes a fact"],"pinyin":["san1 ren2 cheng2 hu3"],"word":"三人成虎"},{"definition":["to crush one's own foot while trying to maneuver a rock (to a cliff edge, to drop on one's enemy) (idiom)\/hoisted by one's own petard"],"pinyin":["ban1 qi3 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬起石头砸自己的脚"},{"definition":["lit. not to stop until one reaches the Yellow River (idiom)\/fig. to persevere until one reaches one's goal\/to keep going while some hope is left"],"pinyin":["bu4 dao4 Huang2 He2 xin1 bu4 si3"],"word":"不到黄河心不死"},{"definition":["lit. without wind there cannot be waves (idiom); there must be a reason\/no smoke without fire"],"pinyin":["wu2 feng1 bu4 qi3 lang4"],"word":"无风不起浪"},{"definition":["lit. the dog that bites does not show its fangs (idiom)\/fig. You can't tell the really dangerous enemy from his external appearance."],"pinyin":["yao3 ren2 gou3 'r bu4 lu4 chi3"],"word":"咬人狗儿不露齿"},{"definition":["lit. a thief crying \"Stop the thief!\" (idiom)\/fig. to accuse sb of a theft and try to sneak away oneself\/to cover up one's misdeeds by shifting the blame onto others"],"pinyin":["zei2 han3 zhuo1 zei2"],"word":"贼喊捉贼"},{"definition":["a fire in the city gates is also a calamity for the fish in the moat (idiom); the bystander will also suffer\/fig. you can't escape responsibility for your actions\/ask not for whom the bell tolls - it tolls for thee"],"pinyin":["cheng2 men2 shi1 huo3 , yang1 ji2 chi2 yu2"],"word":"城门失火，殃及池鱼"},{"definition":["lit. flies do not attack an intact egg (idiom)\/fig. no smoke without a fire"],"pinyin":["cang1 ying5 bu4 ding1 wu2 feng4 dan4"],"word":"苍蝇不叮无缝蛋"}]}