{"definition":["to rise (in society)"],"pinyin":["ji1 shen1"],"traditional":["躋身"],"rank":8601.0,"normalized_rank":0.12033914904929136,"fraction":0.000010624543638265147,"cumulative_fraction":0.9165674248353812,"word":"跻身","characters":[{"definition":["to go up (esp. in rank)\/to rise\/to ascend"],"pinyin":["ji1"],"word":"跻"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"}],"containing_words":[],"sentences":[{"english":"Yao also is near the top of another, more unfortunate leaderboard.","chinese":"在另一个更令人遗憾的排行榜上，姚明也跻身前列。"},{"english":"Near Mohammed Sultan, Clarke Quay, Great World City, Orchard Road, Killinery.","chinese":"穆罕默德苏丹，克拉码头，跻身世界大都会，乌节路。"},{"english":"Annika's achievements rank her among the most successful golfers.","chinese":"安尼卡的成就使她跻身于最成功的高尔夫运动员之列。"},{"english":"Near Mohammed Sultan, Clarke Quay, Great World City, Orchard Road, Killiney.","chinese":"穆罕默德苏丹，克拉码头，跻身世界大都会，乌节路。"},{"english":"That might make Brazil a top-five source of oil .","chinese":"届时巴西将跻身于全球前五大石油产地。"},{"english":"Ling said female students really don't have much choice if they want to secure employment in the competitive white-collar job market.","chinese":"凌说女毕业生要想跻身白领市场就比无他法。"},{"english":"The time has passed for five-years, Oushennuo has been about one of the top brands list.","chinese":"时过五年，欧神诺已跻身顶尖品牌之列。"},{"english":"China will be at the forefront of combating climate change.","chinese":"中国将跻身于对抗气候变化的前沿。"},{"english":"Queen Elizabeth II was in the top 10 for a record 41st time.","chinese":"英国女王伊丽莎白二世今年第41次跻身前十名。"},{"english":"By 2001, they had made their way onto the Forbes rich list.","chinese":"到2001年，他们已经跻身福布斯财富榜。"},{"english":"Johnson and Aouita blazed their way to the top of track and field .","chinese":"约翰逊和阿乌伊塔各辟蹊径，跻身田径比赛榜首。"},{"english":"This part let young Maliya score a success, ascend body distinguished personages.","chinese":"这个角色让年轻的玛利亚获得了成功，跻身名流。"},{"english":"Its 1, 000 megabits-per-second capability makes it one of the fastest in the world.","chinese":"每秒千兆的传输能力使其跻身全球最快的网络行列。"},{"english":"In a short time it became one of Israel's leading folklore groups.","chinese":"此后不久，它就跻身为以色列一支主要的民间艺术团。"},{"english":"And why was he among the kal online geons foremost liberal thinkers of the age?","chinese":"为何他能跻身那个时代最重要的自由主义思想家之列？"},{"english":"You will be counted among the few, who actually change.","chinese":"你会跻身与少数真正可以改变的精英之列。"}],"related":[{"definition":["to vault"],"pinyin":["yue4 ju1"],"word":"跃居"},{"definition":["ranks\/procession"],"pinyin":["hang2 lie4"],"word":"行列"},{"definition":["to be located at"],"pinyin":["wei4 ju1"],"word":"位居"},{"definition":["top three"],"pinyin":["qian2 san1 jia3"],"word":"前三甲"},{"definition":["to rank"],"pinyin":["wei4 lie4"],"word":"位列"},{"definition":["to leap to (a higher position etc)\/to jump\/(of a plane) to ascend"],"pinyin":["yue4 sheng1"],"word":"跃升"},{"definition":["to aspire to the throne\/to aim at (the first place etc)"],"pinyin":["wen4 ding3"],"word":"问鼎"},{"definition":["to continue in a post\/(to hold a post) several times in succession\/(to win a title) in successive years\/to stay at number one\/to defend a championship"],"pinyin":["chan2 lian2"],"word":"蝉联"},{"definition":["to rank (number 1, or third last etc)\/to be among (those who are in a particular group)"],"pinyin":["ming2 lie4"],"word":"名列"},{"definition":["(of a list, music chart etc) to reach the top"],"pinyin":["rong2 deng1"],"word":"荣登"},{"definition":["to break into\/to force one's way into\/to barge into"],"pinyin":["ji3 jin4"],"word":"挤进"},{"definition":["3rd rank of candidates who passed the imperial examination"],"pinyin":["san1 jia3"],"word":"三甲"},{"definition":["to overtake"],"pinyin":["gan3 chao1"],"word":"赶超"},{"definition":["to rank (1st, 2nd etc)\/ranking"],"pinyin":["pai2 ming2"],"word":"排名"},{"definition":["lit. late-comer lives above (idiom); the up-and-coming youngster outstrips the older generation\/the pupil surpasses the master"],"pinyin":["hou4 lai2 ju1 shang4"],"word":"后来居上"},{"definition":["to come first in triennial palace examinations (idiom, refers to the carved stone turtle head in front of the imperial palace, next to which the most successful candidate in the imperial examinations was entitled to stand)\/to be the champion\/to be the very best in any field"],"pinyin":["du2 zhan4 ao2 tou2"],"word":"独占鳌头"}]}