{"definition":["in the capacity of\/as"],"pinyin":["shen1 wei2"],"traditional":["身為"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"身为","characters":[{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"}],"containing_words":[{"definition":["lit. teacher for one day, father for ever (idiom)"],"pinyin":["yi1 ri4 wei2 shi1 , zhong1 shen1 wei2 fu4"],"word":"一日为师，终身为父"}],"sentences":[{"english":"Waterproof jacket that transforms into a one person sleeping bag.","chinese":"这是一件防水夹克，可以变身为单人睡袋哦。"},{"english":"Promoting literacy is one of Laura Bush's main projects as first lady.","chinese":"推广读写能力是萝拉身为第一夫人的主要计画。"},{"english":"I have long prided myself on being a good teacher.","chinese":"我一向以身为一名好老师而自豪。"},{"english":"They both bewailed their misfortune at being young, unmarried returned students.","chinese":"两人慨叹不幸身为青年未婚留学生的麻烦。"},{"english":"As a coach, you need great patience.","chinese":"身为教练，你要有极大的耐心。"},{"english":"As for being adopted, I have no desire to find my real parents.","chinese":"身为养女，我并不想找到自己的生身父母。"},{"english":"Just a rookie lawyer, Wright as he solves a variety of puzzling cases.","chinese":"身为新人律师，成步堂解决了众多谜题般的案件。"},{"english":"It would seem that Wizarding folk aren't injured as quickly by things like this.","chinese":"大概身为巫师，这些寻常的事故不会造成伤害。"},{"english":"Mr. Oddsson, a lawyer, doesn't have that credential.","chinese":"而身为律师的奥德松不符合这项要求。"},{"english":"Some are lovers. Blind to the consequences of their actions.","chinese":"有些身为情人，无视她们的行为后果。"},{"english":"Although you are identical twins, what are your differences?","chinese":"身为同卵双生儿，你们有什么差别？"},{"english":"With girl change as handsome, toward become idols march.","chinese":"以少女变身为帅男，朝成为偶像进军。"},{"english":"As the star of a circus, Boog has lived a luxurious life.","chinese":"身为马戏团的大明星，布榖过着十分奢华的生活。"},{"english":"Makgatho, a lawyer, had been receiving treatment for several months.","chinese":"身为律师的马克贾托已接受了几个月的治疗。"},{"english":"As a student, you need to study hard.","chinese":"你身为一位学生，必须用功读书。"},{"english":"A Beijing native, Ulrich earned an Ivy-studded education in the United States.","chinese":"身为北京人的李晶在美国常春藤名校接受过高等教育。"}],"related":[{"definition":["to act as\/used erroneously for 作為|作为"],"pinyin":["zuo4 wei2"],"word":"做为"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作为"},{"definition":["to take up duty as\/to assume a position\/to assume\/to take on (an office)"],"pinyin":["dang1 shang5"],"word":"当上"},{"definition":["to be born of\/to come from\/family background\/class origin"],"pinyin":["chu1 shen1"],"word":"出身"},{"definition":["identity\/status\/capacity\/dignity\/position\/rank"],"pinyin":["shen1 fen4"],"word":"身份"},{"definition":["to know well\/to be fully aware of"],"pinyin":["shen1 zhi1"],"word":"深知"},{"definition":["holding two jobs simultaneously"],"pinyin":["shen1 jian1"],"word":"身兼"},{"definition":["to take upon oneself\/to assume"],"pinyin":["dan1 dang1"],"word":"担当"},{"definition":["to believe (sth in relation to oneself)\/to regard oneself as\/to acknowledge (sth in relation to oneself)\/to resign oneself to"],"pinyin":["zi4 ren4"],"word":"自认"},{"definition":["to consider oneself as\/to believe oneself to be"],"pinyin":["zi4 ju1"],"word":"自居"},{"definition":["to pose as\/to flaunt oneself as\/to boast of\/to brag"],"pinyin":["zi4 xu3"],"word":"自诩"},{"definition":["let alone\/to say nothing of\/besides\/what's more"],"pinyin":["he2 kuang4"],"word":"何况"},{"definition":["seat of honor\/person in a high-ranking position\/to be promoted to a more senior role\/(genetics) epistatic"],"pinyin":["shang4 wei4"],"word":"上位"},{"definition":["title\/rank\/appellation"],"pinyin":["tou2 xian2"],"word":"头衔"},{"definition":["always (previously)\/a period of time in the recent past"],"pinyin":["yi1 xiang4"],"word":"一向"},{"definition":["this (person)"],"pinyin":["zhe4 wei4"],"word":"这位"}]}