{"definition":["posthumous\/one's social background\/behind the body"],"pinyin":["shen1 hou4"],"traditional":["身後"],"rank":5175.0,"normalized_rank":0.07240496411232214,"fraction":0.000022871044688593217,"cumulative_fraction":0.8630524665124112,"word":"身后","characters":[{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"},{"definition":["empress\/queen\/(archaic) monarch\/ruler","back\/behind\/rear\/afterwards\/after\/later\/post-","surname Hou"],"pinyin":["hou4","hou4","Hou4"],"word":"后"}],"containing_words":[],"sentences":[{"english":"After leaving the smell of land behind him, he set his lines.","chinese":"在把陆地的气息抛在身后之后，他放下了钓丝。"},{"english":"I'm still a bit of a behind-the-striker player when possible.","chinese":"如果有机会，我仍然会更接近前锋身后的位置。"},{"english":"Bartender and a few bold people who followed him out.","chinese":"酒保和几个大胆的人跟在他身后走了出去。"},{"english":"Father and Son go home with the tree, not knowing that they are followed by the animals.","chinese":"爷儿俩带着树回家，不知道动物们跟在身后。"},{"english":"The blind man is bound to find the grindstone behind him.","chinese":"盲人一定会发现他身后的磨石。"},{"english":"Ben turned his head to look behind him. The skeleton was only a few feet away.","chinese":"本转过头朝身后看了看，那骷髅离自己只有几英尺了。"},{"english":"Install behind, was beautiful and charming and add seductive charm.","chinese":"成装上身后，既漂亮妩媚，又倍添诱人魅力。"},{"english":"The small expensive son doesn't know when seem in June after necrosis, certainly make a noise.","chinese":"小贵子不知何时出现在六月身后，悠然出声。"},{"english":"What may count for more is that Mr Castro is increasingly preoccupied by his legacy.","chinese":"更重要的是卡斯特罗越来越关心他的身后事。"},{"english":"Each man must not think only of himself, but also of his buddy fighting beside him.","chinese":"每个人不能仅仅想着他自己，还有他身后战斗的同伴。"},{"english":"Enter the portal behind you.","chinese":"进入你身后的传送门。"},{"english":"The butler turned and hurried into the house, slamming the door behind him.","chinese":"看门人拔脚朝屋里跑去，门在他身后砰的一声关上了。"},{"english":"Lunge past your foes with preternatural speed to attack them from behind.","chinese":"你冲到敌人身后，以不可思议的速度从后面攻击他们。"},{"english":"And, during Feiler's battle with cancer, they would fight alongside him.","chinese":"在费勒与癌症斗争时，他们也在身后支持他。"},{"english":"Who can tell him what will happen under the sun after he is gone?","chinese":"谁能告诉他身后在日光之下有什么事呢？"},{"english":"I am a tree with many branches, with fewer and fewer leaves on those branchlets each time you pass.","chinese":"一棵枝繁的树，在你悄然的身后，叶子片片凋零。"}],"related":[{"definition":["(of a person) to turn round\/to face about\/(of a widow) to remarry (archaic)"],"pinyin":["zhuan3 shen1"],"word":"转身"},{"definition":["back\/rear\/behind"],"pinyin":["hou4 bian5"],"word":"后边"},{"definition":["distant place"],"pinyin":["yuan3 chu4"],"word":"远处"},{"definition":["under the foot"],"pinyin":["jiao3 xia4"],"word":"脚下"},{"definition":["front\/the front side\/in front of"],"pinyin":["qian2 bian5"],"word":"前边"},{"definition":["lateral\/side\/to the side\/beside"],"pinyin":["pang2 bian1"],"word":"旁边"},{"definition":["behind\/the back\/the rear\/later\/afterwards\/(in) the future"],"pinyin":["hou4 tou5"],"word":"后头"},{"definition":["aside\/to the side of"],"pinyin":["yi1 pang2"],"word":"一旁"},{"definition":["outside the door"],"pinyin":["men2 wai4"],"word":"门外"},{"definition":["(of children, parents etc) at one's side\/living with one","the front (of)\/(in) front\/(in) sb's presence\/just before (a date)"],"pinyin":["gen1 qian5","gen1 qian2"],"word":"跟前"},{"definition":["in front\/at the head\/ahead\/above"],"pinyin":["qian2 tou5"],"word":"前头"},{"definition":["to turn one's head\/to turn around"],"pinyin":["niu3 tou2"],"word":"扭头"},{"definition":["top of the head"],"pinyin":["tou2 ding3"],"word":"头顶"},{"definition":["to turn one's head\/to change direction\/U-turn\/volte face\/to repent","nutation (plants turning to face the sun)"],"pinyin":["zhuan3 tou2","zhuan4 tou2"],"word":"转头"},{"definition":["to turn round\/to turn one's head\/later\/by and by"],"pinyin":["hui2 tou2"],"word":"回头"},{"definition":["suddenly\/all of a sudden"],"pinyin":["hu1 ran2"],"word":"忽然"}]}