{"definition":["metro\/rapid transit\/subway"],"pinyin":["gui3 dao4 jiao1 tong1"],"traditional":["軌道交通"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"轨道交通","characters":[{"definition":["course\/path\/track\/rail"],"pinyin":["gui3"],"word":"轨"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"},{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"},{"definition":["to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc","classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)"],"pinyin":["tong1","tong4"],"word":"通"}],"containing_words":[{"definition":["light rail\/transit system (underground, at street level or elevated)\/streetcar\/metro\/abbr. to 輕軌|轻轨[qing1 gui3]"],"pinyin":["qing1 xing2 gui3 dao4 jiao1 tong1"],"word":"轻型轨道交通"}],"sentences":[{"english":"This paper also discusses the framework of forecasting the induced passenger flow volume in URT.","chinese":"给出了城市轨道交通诱增交通量预测框架。"},{"english":"Finally, this paper forecasts the urban railway transport demand and rectifies the result according to the remainder of traffic demand.","chinese":"最后根据剩余交通需求进行轨道交通规划。"},{"english":"Positively going in for urban rail transportation equipment manufacture domestically.","chinese":"积极研究城市轨道交通设备的国产化问题等等。"},{"english":"It has a very broad prospect for the application of the technology in Guangzhou urban mass transit syste…","chinese":"该技术在广州市轨道交通领域具有广阔应用前景。"},{"english":"While an additional 60 billion, one third will be used for rail transit construction.","chinese":"而追加的60亿元中，三分之一将用于轨道交通建设。"},{"english":"Shanghai Urban Rail Transit (SURT) system has entered a new era of networking operation.","chinese":"上海城市轨道交通已经进入网络化运营时代。"},{"english":"If disagrees with the reply, the passenger may appeal to the MCRCAS.","chinese":"乘客对答复有异议的，可以向市轨道交通处申诉。"},{"english":"In this paper, the United States the re-development of rail transportation focal point for research.","chinese":"本文以美国轨道交通的再次发展为中心点进行研究。"},{"english":"The Beijing urban rail transit network plan was revised in 2002.","chinese":"北京城市轨道交通规划线网于2002年进行了修订。"},{"english":"This paper also discusses the framework of forecasting the induced passenger flow volume…","chinese":"给出了城市轨道交通诱增交通量预测框架。"},{"english":"but, this city has a long way to go in railway transportation.","chinese":"但这座城市在轨道交通上还有很长的路要走。"},{"english":"The development situations of rail transit in large-scale airport are introduced.","chinese":"介绍了国外大型机场中轨道交通的发展现状。"},{"english":"Ballasted track is the most used track type in ground track of urban mass transit in existing \"Code for the Design of Metro\".","chinese":"有碴轨道是城市轨道交通地面线最常采用的轨道结构。"},{"english":"Pantograph is one of the most important parts of urban rail vehicles.","chinese":"受电弓是城市轨道交通车辆的重要部件之一。"},{"english":"Knorr-Bremse Group is a famous group in railway & truck industry.","chinese":"克诺尔集团是轨道交通行业的领先者。"},{"english":"China has entered the golden age of large-scale construction of Urban Railway Transport.","chinese":"我国已进入大规模城市轨道交通建设的黄金时期。"}],"related":[{"definition":["streetcar\/tramcar\/tram"],"pinyin":["you3 gui3 dian4 che1"],"word":"有轨电车"},{"definition":["public transport\/mass transit"],"pinyin":["gong1 gong4 jiao1 tong1"],"word":"公共交通"},{"definition":["light rail\/transit system (underground, at street level or elevated)\/streetcar\/metro\/abbr. for 輕型軌道交通|轻型轨道交通[qing1 xing2 gui3 dao4 jiao1 tong1]"],"pinyin":["qing1 gui3"],"word":"轻轨"},{"definition":["subway\/metro"],"pinyin":["di4 tie3"],"word":"地铁"},{"definition":["tracked (tramcar)"],"pinyin":["you3 gui3"],"word":"有轨"},{"definition":["high speed rail"],"pinyin":["gao1 tie3"],"word":"高铁"},{"definition":["transport infrastructure"],"pinyin":["jiao1 tong1 jian4 she4"],"word":"交通建设"},{"definition":["to change train (plane, bus etc)\/transfer between modes of transport"],"pinyin":["huan4 cheng2"],"word":"换乘"},{"definition":["to access\/to transfer passengers between two railway lines"],"pinyin":["jie1 bo2"],"word":"接驳"},{"definition":["traffic hub"],"pinyin":["jiao1 tong1 shu1 niu3"],"word":"交通枢纽"},{"definition":["railroad\/railway\/CL:條|条[tiao2]"],"pinyin":["tie3 lu4"],"word":"铁路"},{"definition":["rapid transit system\/urban railway"],"pinyin":["cheng2 tie3"],"word":"城铁"},{"definition":["to be connected\/traffic\/transportation\/communications\/liaison"],"pinyin":["jiao1 tong1"],"word":"交通"},{"definition":["public transportation\/mass transit\/abbr. for 公共交通[gong1 gong4 jiao1 tong1]"],"pinyin":["gong1 jiao1"],"word":"公交"},{"definition":["maglev (type of train)\/magnetic levitation"],"pinyin":["ci2 fu2"],"word":"磁浮"},{"definition":["ring road\/circle line (e.g. rail or subway)"],"pinyin":["huan2 xian4"],"word":"环线"}]}