{"definition":["improvement\/turnaround (for the better)"],"pinyin":["zhuan3 hao3"],"traditional":["轉好"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"转好","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan4","zhuan3"],"word":"转"},{"definition":["to be fond of\/to have a tendency to\/to be prone to","good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello"],"pinyin":["hao4","hao3"],"word":"好"}],"containing_words":[],"sentences":[{"english":"Concise, after receipt of the g frequently reply in turn good mood.","chinese":"简洁收到克勤的回复后，心情转好。"},{"english":"“The economy will get better very soon” around the world, Mr. Liu said.","chinese":"刘先生称，全球经济“很快将转好”。"},{"english":"A few days later the weather finally cleared, revealing a completely white north face.","chinese":"数日后，天气转好，白雪皑皑的整个北壁一览无余。"},{"english":"Part of getting better is to face the fears and sensations.","chinese":"部分患者再起作用下逐渐转好，直面恐惧和情感。"},{"english":"One thing I’d like to point out here is that it does get better in time.","chinese":"这里我向指出的一点是，它真的能使你及时转好。"},{"english":"Because of this, the economic numbers are likely to get worse before they get better.","chinese":"正因为如此，这些经济数字在转好之前会变得更糟。"},{"english":"The weather has cleared up; we can go out.","chinese":"天气转好了，我们可以出去了。"},{"english":"In the Telegraph interview, the chancellor said the British economy was \"on the mend\".","chinese":"在电讯报的采访中，该大臣说英国经济“正在转好”。"},{"english":"Highlights after know, immediately turn in a good mood.","chinese":"拔萃知道后，心情立即转好。"},{"english":"Your mood and your brain will thank you.","chinese":"你的大脑会放松，心情也会转好。"},{"english":"And here I thought Nick Cage was turning his life around.","chinese":"我原以为小尼克凯奇的人生转好了。"},{"english":"Forecasters said the tides are expected to subside in the next few days as the weather improves.","chinese":"天气预报称随着天气转好，潮水将在几天内退去。"},{"english":"\"The labor market is not turning around, and that's key to the overall recovery, \" said David Semmens, a U.","chinese":"劳动力市场并未转好，而它才是经济整体复苏的关键。"},{"english":"Receive GuEn brings money mistress, was turned for the better.","chinese":"情妇收到达谷恩带来的钱，面色转好。"},{"english":"At the present, the water quality of Lake Biwa becomes better.","chinese":"目前，该湖水质呈现转好趋势。"},{"english":"I haven't seen any improvement at all over the past few years.","chinese":"这几年来我丝毫没看到一点转好的起色。"}],"related":[{"definition":["to slip (e.g. of clutch)\/slippage\/also used of economic indicators, statistical discrepancies etc"],"pinyin":["zhuan3 cha1"],"word":"转差"},{"definition":["to improve\/to take a turn for the better\/improvement"],"pinyin":["hao3 zhuan3"],"word":"好转"},{"definition":["to rise again after a fall\/to pick up\/rally (stock market etc)"],"pinyin":["hui2 sheng1"],"word":"回升"},{"definition":["(of the weather) to warm up again"],"pinyin":["hui2 nuan3"],"word":"回暖"},{"definition":["to weaken\/to fall off"],"pinyin":["jian3 ruo4"],"word":"减弱"},{"definition":["to slow down\/to ease up\/to abate\/slowdown\/downturn"],"pinyin":["qu1 huan3"],"word":"趋缓"},{"definition":["steadily\/a steady pace"],"pinyin":["wen3 bu4"],"word":"稳步"},{"definition":["to become cooler\/to lower the temperature\/cooling\/(of interest, activity etc) to decline"],"pinyin":["jiang4 wen1"],"word":"降温"},{"definition":["specific to a particular stage (of a project etc)\/interim (policy etc)\/occurring in stages\/phased"],"pinyin":["jie1 duan4 xing4"],"word":"阶段性"},{"definition":["smooth\/steady"],"pinyin":["ping2 wen3"],"word":"平稳"},{"definition":["to decline\/to drop\/to fall\/to go down\/to decrease"],"pinyin":["xia4 jiang4"],"word":"下降"},{"definition":["to become hot\/temperature rise\/(fig.) to intensify\/to hot up\/to escalate\/to get a boost"],"pinyin":["sheng1 wen1"],"word":"升温"},{"definition":["to go down\/to decline"],"pinyin":["zou3 di1"],"word":"走低"},{"definition":["to get better\/to improve\/to get well"],"pinyin":["hao3 qi3 lai5"],"word":"好起来"},{"definition":["air temperature\/CL:個|个[ge4]"],"pinyin":["qi4 wen1"],"word":"气温"},{"definition":["progressively\/step by step"],"pinyin":["zhu2 bu4"],"word":"逐步"}]}