{"definition":["to shift one's eyes\/(fig.) to shift one's attention\/to divert attention"],"pinyin":["zhuan3 yi2 shi4 xian4"],"traditional":["轉移視線"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"转移视线","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan4","zhuan3"],"word":"转"},{"definition":["to move\/to shift\/to change\/to alter\/to remove"],"pinyin":["yi2"],"word":"移"},{"definition":["to look at\/to regard\/to inspect","old variant of 視|视[shi4]","variant of 視|视[shi4]\/variant of 示[shi4]"],"pinyin":["shi4","shi4","shi4"],"word":"视"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)","variant of 線|线[xian4]"],"pinyin":["xian4","xian4"],"word":"线"}],"containing_words":[],"sentences":[{"english":"Looking away from people or yawning will, in most cases, make me appear to be uninterested .","chinese":"转移视线或不停地打哈欠大多说明这个人不感兴趣。"},{"english":"He averts his eyes from the terrible sight.","chinese":"他转移视线不看那可怕的景象。"},{"english":"Casino at's Western media for you, diverting attention.","chinese":"这就是西方的媒体，在转移视线。"},{"english":"After the demonstration, as Israel accused Syria to divert attention.","chinese":"示威发生后，以色列指责叙利亚以此转移视线。"},{"english":"From time to time, she would take her eyes' off the book and reach up to touch his wrinkled cheek.","chinese":"她时不时的从书上转移视线抬起头来碰到他褶皱的脸。"},{"english":"That's Western media for you, diverting attention.","chinese":"这就是西方的媒体，在转移视线。"},{"english":"Honest people sometimes avert their gaze when they are telling the truth.","chinese":"诚实的人有时候会在说真话的时候转移视线。"},{"english":"The political instability that results from depression makes war an attractive option to divert attention.","chinese":"由萧条导致的政治上的不稳定将引发战争以转移视线。"}],"related":[{"definition":["trying to hide it makes it more conspicuous (idiom); A cover up only makes matters worse."],"pinyin":["yu4 gai4 mi2 zhang1"],"word":"欲盖弥彰"},{"definition":["to use the current topic to put over one's own ideas\/to use sth as a pretext to make a fuss"],"pinyin":["jie4 ti2 fa1 hui1"],"word":"借题发挥"},{"definition":["to avoid the important and dwell on the trivial\/to keep silent about major charges while admitting minor ones"],"pinyin":["bi4 zhong4 jiu4 qing1"],"word":"避重就轻"},{"definition":["bad habit (e.g. nose-picking)\/petty maneuver\/dirty trick\/gamesmanship"],"pinyin":["xiao3 dong4 zuo4"],"word":"小动作"},{"definition":["to obscure the facts (idiom); to mislead the public with prevarication and deliberate falsehoods"],"pinyin":["hun4 xiao2 shi4 ting1"],"word":"混淆视听"},{"definition":["to cover up\/to conceal\/to mask\/to gloss over"],"pinyin":["yan3 shi4"],"word":"掩饰"},{"definition":["to have an ulterior motive (idiom)"],"pinyin":["bie2 you3 yong4 xin1"],"word":"别有用心"},{"definition":["to exculpate\/to absolve\/to exonerate"],"pinyin":["kai1 tuo1"],"word":"开脱"},{"definition":["to say a matter has no relationship with the individual referred to, to emphasise one is innocent or in the clear"],"pinyin":["pie3 qing1"],"word":"撇清"},{"definition":["deliberately\/on purpose"],"pinyin":["gu4 yi4"],"word":"故意"},{"definition":["lit. the more you touch things up, the darker they get\/fig. to only make matters worse"],"pinyin":["yue4 miao2 yue4 hei1"],"word":"越描越黑"},{"definition":["lit. 300 silver taels not hidden here (idiom); fig. to reveal what one intends to hide"],"pinyin":["ci3 di4 wu2 yin2 san1 bai3 liang3"],"word":"此地无银三百两"},{"definition":["lit. the voice of the guest overwhelms that of the host (idiom)\/fig. a minor player upstages the main attraction\/minor details obscure the main point\/the sauce is better than the fish"],"pinyin":["xuan1 bin1 duo2 zhu3"],"word":"喧宾夺主"},{"definition":["to seduce\/to lead into sex"],"pinyin":["se4 you4"],"word":"色诱"},{"definition":["to overreach oneself\/to try to be clever and end up with egg on one's face"],"pinyin":["nong4 qiao3 cheng2 zhuo1"],"word":"弄巧成拙"},{"definition":["to confess without being pressed\/to make a confession without duress"],"pinyin":["bu4 da3 zi4 zhao1"],"word":"不打自招"}]}