{"definition":["(of a person) to turn round\/to face about\/(of a widow) to remarry (archaic)"],"pinyin":["zhuan3 shen1"],"traditional":["轉身"],"rank":6037.0,"normalized_rank":0.08446546248233598,"fraction":0.000018382086684961947,"cumulative_fraction":0.8806762677433543,"word":"转身","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan4","zhuan3"],"word":"转"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"}],"containing_words":[],"sentences":[{"english":"Young scene seize turned separate yeongjo, want to notice him about plucking exceedingly senti-mental secrets.","chinese":"幼景抓住转身分开的英祖，要通知他关于寒星的机密。"},{"english":"Before I could answer, she had turned around and started back out onto the field.","chinese":"我还未来得及回话，她已经转身向足球场上走去了。"},{"english":"Then Tom turned coolly away, still talking, and took Amy with him.","chinese":"汤姆冷冰冰地转身带着艾美走了，边走边和她谈着。"},{"english":"He turned to look. He saw a 7-foot grizzly bear charge towards him.","chinese":"他转身一看，看见一只7英尺高的灰熊向他冲来。"},{"english":"Jade bead met Liu Wenkai when we were waiting for the car, she turned and walked.","chinese":"玉珠在等车的时候遇到刘文凯，她转身就走。"},{"english":"Turned free and easy of go away, let figure burger in your mind.","chinese":"转身洒脱的走开，让你的头脑中留下美图汉堡的印象。"},{"english":"Just as I start to turn back home I hear it: the soft, two-toned whistle of chickadees .","chinese":"就在我转身要回去时，我听到了两声轻轻的山雀啼叫。"},{"english":"Fatso took offense to this, spun around and bit the 36-year-old man on his right leg.","chinese":"胖子采取攻击并且转身咬了这位36岁男子的右腿。"},{"english":"Our instructor turned around to go back and turn the lights back on.","chinese":"我们的老师转身过去走到后面想把灯都打开。"},{"english":"They turned and ran towards him as he came trotting to meet them.","chinese":"她们转身向熊跑去，熊也小跑着来迎接她俩。"},{"english":"Otis asked, and turned to see three dizzy bullfrogs. 'Well, of course I did!","chinese":"奥蒂斯问道，并转身看着三只晕乎乎的牛蛙。"},{"english":"There isn’t much room left to turn and move, and there is less amniotic fluid.","chinese":"没有充足的空间让婴儿转身和移动了，羊水也少了。"},{"english":"Rather than flashily smash against the wall, why not elegantly turn a corner? Give yourself the space to make a turnaround.","chinese":"要华丽撞墙不如优雅转身，给自己一个迂回的空间。"},{"english":"Then Zhao Gao turned to other officials and asked them whether it was a horse.","chinese":"赵高转身问其他官员这是马还是鹿。"},{"english":"I turned in alarm as the wind blew the door open.","chinese":"当风把窗吹开的时候我惊慌地转身。"},{"english":"She turned and went back towards her house, and I walked on to Baskerville Hall.","chinese":"她转身往回走往，我便继续向巴斯克维尔庄园走往。"}],"related":[{"definition":["to get up\/to leave\/to set forth"],"pinyin":["qi3 shen1"],"word":"起身"},{"definition":["to turn round\/to turn one's head\/later\/by and by"],"pinyin":["hui2 tou2"],"word":"回头"},{"definition":["to leave\/to walk away\/to beat it\/to move aside"],"pinyin":["zou3 kai1"],"word":"走开"},{"definition":["to turn one's head\/to turn around"],"pinyin":["niu3 tou2"],"word":"扭头"},{"definition":["to turn one's head\/to change direction\/U-turn\/volte face\/to repent","nutation (plants turning to face the sun)"],"pinyin":["zhuan3 tou2","zhuan4 tou2"],"word":"转头"},{"definition":["directly"],"pinyin":["jing4 zhi2"],"word":"径直"},{"definition":["quick step"],"pinyin":["kuai4 bu4"],"word":"快步"},{"definition":["posthumous\/one's social background\/behind the body"],"pinyin":["shen1 hou4"],"word":"身后"},{"definition":["at a stride\/taking large steps (while walking)"],"pinyin":["da4 bu4 liu2 xing1"],"word":"大步流星"},{"definition":["to move quickly\/to vault\/flying tackle"],"pinyin":["fei1 shen1"],"word":"飞身"},{"definition":["large strides"],"pinyin":["da4 bu4"],"word":"大步"},{"definition":["to wave (one's hand)"],"pinyin":["hui1 shou3"],"word":"挥手"},{"definition":["to break into a run"],"pinyin":["ba2 tui3"],"word":"拔腿"},{"definition":["to walk over (to)"],"pinyin":["zou3 qu4"],"word":"走去"},{"definition":["to turn around"],"pinyin":["fan3 shen1"],"word":"反身"},{"definition":["to stand up"],"pinyin":["zhan4 qi3 lai5"],"word":"站起来"}]}