{"definition":["to turn defeat into victory (idiom); snatching victory from the jaws of defeat"],"pinyin":["zhuan4 bai4 wei2 sheng4"],"traditional":["轉敗為勝"],"rank":58790.0,"normalized_rank":0.8225483749108055,"fraction":4.9924348386780796e-8,"cumulative_fraction":0.9997595528059352,"word":"转败为胜","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan4","zhuan3"],"word":"转"},{"definition":["to defeat\/to damage\/to lose (to an opponent)\/to fail\/to wither"],"pinyin":["bai4"],"word":"败"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"},{"definition":["victory\/success\/to beat\/to defeat\/to surpass\/victorious\/superior to\/to get the better of\/better than\/surpassing\/superb (of vista)\/beautiful (scenery)\/wonderful (view)\/(Taiwan pr. [sheng1]) able to bear\/equal to (a task)"],"pinyin":["sheng4"],"word":"胜"}],"containing_words":[],"sentences":[{"english":"What was the turning point for Israelites to turn from defeat to victory in the Ark lost event?","chinese":"约柜被掳事件以色列转败为胜的关键何在？"},{"english":"It is used especially when it can turn failure into success.","chinese":"尤其是用在可以转败为胜的时候。"},{"english":"A chance to blot out our mistakes and chance failure into winning.","chinese":"一次抹掉我们的错误转败为胜的机会。"},{"english":"Nevertheless, he immediately turned defeat into victory.","chinese":"但他立刻转败为胜了。"},{"english":"The team was behind, but at the last minute Sam saved the day with a touchdown.","chinese":"队落后了，但在最后时刻塞姆底线得分转败为胜。"},{"english":"Thus one can turn failure into success.","chinese":"如此就可以转败为胜。"}],"related":[{"definition":["to turn defeat into victory (idiom); to turn the tide"],"pinyin":["fan3 bai4 wei2 sheng4"],"word":"反败为胜"},{"definition":["lit. to upend heaven and earth (idiom)\/fig. to change the course of events\/to turn things around"],"pinyin":["niu3 zhuan3 qian2 kun1"],"word":"扭转乾坤"},{"definition":["to win by a surprise move"],"pinyin":["chu1 qi2 zhi4 sheng4"],"word":"出奇制胜"},{"definition":["using the weak to defeat the strong (idiom); to win from a position of weakness"],"pinyin":["yi3 ruo4 sheng4 qiang2"],"word":"以弱胜强"},{"definition":["to turn peril into safety (idiom); to avert disaster"],"pinyin":["hua4 xian3 wei2 yi2"],"word":"化险为夷"},{"definition":["failed and wiped over the floor (idiom); to fail utterly\/a crushing defeat\/beaten and in a hopeless position"],"pinyin":["yi1 bai4 tu2 di4"],"word":"一败涂地"},{"definition":["to seek life in death (idiom); to fight for one's life"],"pinyin":["si3 zhong1 qiu2 sheng1"],"word":"死中求生"},{"definition":["to seize total victory (idiom); an overwhelming victory\/to win by a landslide (in election)"],"pinyin":["da4 huo4 quan2 sheng4"],"word":"大获全胜"},{"definition":["lost game\/losing battle"],"pinyin":["bai4 ju2"],"word":"败局"},{"definition":["troops in defeat like a landslide (idiom); a beaten army in total collapse"],"pinyin":["bing1 bai4 ru2 shan1 dao3"],"word":"兵败如山倒"},{"definition":["to defeat\/to inflict a defeat on sb"],"pinyin":["da4 bai4"],"word":"大败"},{"definition":["grasp it and victory is assured\/to have success within one's grasp (idiom)"],"pinyin":["wen3 cao1 sheng4 quan4"],"word":"稳操胜券"},{"definition":["using the few to defeat the many (idiom); to win from a position of weakness"],"pinyin":["yi3 shao3 sheng4 duo1"],"word":"以少胜多"},{"definition":["to triumph over an opponent"],"pinyin":["de2 sheng4"],"word":"得胜"},{"definition":["to fail within sight of success (idiom); last-minute failure\/to fall at the last hurdle\/snatching defeat from the jaws of victory"],"pinyin":["gong1 bai4 chui2 cheng2"],"word":"功败垂成"},{"definition":["perilous situation"],"pinyin":["wei1 ju2"],"word":"危局"}]}