{"definition":["to rotate\/to take turns\/to switch"],"pinyin":["lun2 huan4"],"traditional":["輪換"],"rank":13532.0,"normalized_rank":0.18933023659283926,"fraction":0.00000496294735805197,"cumulative_fraction":0.9523854966227664,"word":"轮换","characters":[{"definition":["wheel\/disk\/ring\/steamship\/to take turns\/to rotate\/by turn\/classifier for big round objects: disk, or recurring events: round, turn"],"pinyin":["lun2"],"word":"轮"},{"definition":["to exchange\/to change (clothes etc)\/to substitute\/to switch\/to convert (currency)"],"pinyin":["huan4"],"word":"换"}],"containing_words":[],"sentences":[{"english":"Event cards represent shifts in the world order of Vigil.","chinese":"将代表着祈夜世界秩序的轮换。"},{"english":"If we do the work turn and turn about, we can finish it quickly.","chinese":"如果我们轮换着做这个工作，我们能很快地把它完成。"},{"english":"Arrigoni: Against Milan A Great Result \"The turnover is working well.\"","chinese":"对阵米兰这是一个伟大的结果“轮换制工作的不错。”"},{"english":"The soldiers posted abroad in 2001 rotated home last year.","chinese":"2001年派驻国外的士兵去年轮换调防回国。"},{"english":"Working as a journalist at ITN meant regular two-week spells of night shifts.","chinese":"在ITN当记者意味着有规律的为期两周的夜班轮换。"},{"english":"Everyone will be able to rest in turns, including Pato .","chinese":"每个人都可能会轮换，包括帕托。"},{"english":"The troops stationed along the border three years ago have been rotated back to their original positions.","chinese":"三年前派驻在边境的部队现已轮换调防原地。"},{"english":"Pairing and switching requires discipline.","chinese":"结对编程并且经常轮换结对伙伴是需要纪律性的。"},{"english":"Depending on the toggle element selected, the content is rotated in the desired direction.","chinese":"当进行切换时，内容就向所选的方向轮换了。"},{"english":"The workers in this workshop do day and night shifts in weekly rotation.","chinese":"这个车间的工人上白班和上夜班每周轮换一次。"},{"english":"Many of the divisions have been continuously in action since the landing without any spell of relief.","chinese":"许多师团在登陆后连续作战，而没有任何轮换的机会。"},{"english":"Each team plays each other once, with home advantage alternating on a yearly basis.","chinese":"每年各队互相交手一次，主场则是每年轮换一次。"},{"english":"Perhaps the biggest intrigue will center on how Krzyzewski constructs the rotation.","chinese":"也许，最大的秘密还在于沙舍夫斯基的轮换阵容。"},{"english":"Detroit Pistons Stuckey and Maxiell should become bigger part of the rotation.","chinese":"斯塔基贺贺麦克希尔应该成为轮换阵容重的重要部分。"},{"english":"In state-controlled companies, senior managers are rotated at the behest of government.","chinese":"国家控股公司的高层听从政府命令进行轮换。"},{"english":"He was so excited, he hopped from foot to foot.","chinese":"他兴奋地两只脚轮换着单脚跳。"}],"related":[{"definition":["holiday roster"],"pinyin":["lun2 xiu1"],"word":"轮休"},{"definition":["to replace sb (personnel, sports team player etc)\/substitution"],"pinyin":["huan4 ren2"],"word":"换人"},{"definition":["to replace (a damaged component with a new one, an injured player with a substitute player, full-time workers with casual workers etc)\/a substitute\/a replacement"],"pinyin":["ti4 bu3"],"word":"替补"},{"definition":["troop arrangement\/battle formation\/lineup (of a sports team etc)"],"pinyin":["zhen4 rong2"],"word":"阵容"},{"definition":["main force\/main strength of an army"],"pinyin":["zhu3 li4"],"word":"主力"},{"definition":["to stop using\/to abandon\/abandoned\/deprecated"],"pinyin":["qi4 yong4"],"word":"弃用"},{"definition":["formation (of a sports team, troops etc)"],"pinyin":["zhen4 xing2"],"word":"阵型"},{"definition":["to replace"],"pinyin":["ding3 ti4"],"word":"顶替"},{"definition":["first issue\/first public showing"],"pinyin":["shou3 fa1"],"word":"首发"},{"definition":["tactics"],"pinyin":["zhan4 shu4"],"word":"战术"},{"definition":["on stage\/to go on stage\/to take the field"],"pinyin":["shang4 chang3"],"word":"上场"},{"definition":["(coll.) panties"],"pinyin":["nei4 nei5"],"word":"内内"},{"definition":["to alternate\/to take turns"],"pinyin":["lun2 liu2"],"word":"轮流"},{"definition":["Zhongwei prefecture level city in Ningxia"],"pinyin":["Zhong1 wei4"],"word":"中卫"},{"definition":["to rotate"],"pinyin":["lun2 zhuan4"],"word":"轮转"},{"definition":["casualties\/wounded soldiers"],"pinyin":["shang1 hao4"],"word":"伤号"}]}