{"definition":["easily\/lightly\/rashly"],"pinyin":["qing1 yi4"],"traditional":["輕易"],"rank":4715.0,"normalized_rank":0.06596896730233795,"fraction":0.000026190721901060426,"cumulative_fraction":0.8517997755986095,"word":"轻易","characters":[{"definition":["light\/easy\/gentle\/soft\/reckless\/unimportant\/frivolous\/small in number\/unstressed\/neutral\/to disparage"],"pinyin":["qing1"],"word":"轻"},{"definition":["easy\/amiable\/to change\/to exchange\/prefix corresponding to the English adjective suffix \"-able\" or \"-ible\"","surname Yi\/abbr. for 易經|易经[Yi4 jing1], the Book of Changes"],"pinyin":["yi4","Yi4"],"word":"易"}],"containing_words":[],"sentences":[{"english":"Keeping our military and using them when we have to, but not as our first instrument.","chinese":"保存军事力量，不到非不得已绝不轻易动武。"},{"english":"I was impressed with his skills in the backhand smash, the forehand smash, and the drop shot.","chinese":"霍尔比较喜欢横拍，因为他可以轻易地用反手扣球。"},{"english":"From that day after, brocade the lotus then don't dare to easily privately get in touch with with route son again.","chinese":"从那日之后，锦莲便不敢再轻易和小路子私下接触。"},{"english":"Even before that, they treaded lightly in Basra.","chinese":"甚至在此以前，他们就轻易处理巴士拉。"},{"english":"Are we so uninformed about issues that we can be bought so easily?","chinese":"我们真的这么愚昧无知到不知道自己可以被轻易收买？"},{"english":"Looking back on it, I wish we hadn t been given in so easily.","chinese":"回过头来看，我希望我们没有这样轻易让步。"},{"english":"The clients could easily swallow the cleaner wrasse while it is going about its job.","chinese":"清洁鱼干活的时候宿主可以轻易地把它吞下去。"},{"english":"In my mind in river\"s lake, very easy.\"","chinese":"相忘于江湖，好轻易。"},{"english":"In this story, Tom was easy to kill two of Chinese innocent safeguard.","chinese":"在里面，阿汤哥轻易杀了，无辜的中国保安。"},{"english":"What do the devs want them to be \"easily\" killed by?","chinese":"恶魔们希望他们可以“轻易的”被杀死？"},{"english":"The placement of dollies on carrier pallets can also easily be carried out after the palletizing process.","chinese":"安置承运人托盘推车上也可以轻易地进行后码垛进程。"},{"english":"I would wish not to be hasty in censuring anyone.","chinese":"我总希望不要轻易责难一个人。"},{"english":"However, I was still too careless with my units and lost my main troop too easily.","chinese":"尽管如此，我还是轻易的损失了的主力部队。"},{"english":"With his defenses stripped, Windu was easily overpowered by Chancellor Palpatine.","chinese":"失去防御力的温杜被帕尔帕廷议长轻易击败。"},{"english":"It should be easy to see the history of an insurance policy.","chinese":"应该可以轻易地看到保险政策的历史。"},{"english":"This but is her heartfelt words, afterward rarely being wine, easily and then vomited out.","chinese":"这却是她的肺腑之言，难得是酒后，轻易便吐了出来。"}],"related":[{"definition":["only if (..., or otherwise, ...)\/only when\/only in the case that\/unless"],"pinyin":["chu2 fei1"],"word":"除非"},{"definition":["easy\/with no difficulty"],"pinyin":["qing1 er2 yi4 ju3"],"word":"轻而易举"},{"definition":["impossible\/cannot\/not able"],"pinyin":["bu4 ke3 neng2"],"word":"不可能"},{"definition":["improbable\/unlikely\/will not (act, happen etc)\/not able\/not having learned to do sth\/(coll.) (Tw) don't mention it\/not at all"],"pinyin":["bu4 hui4"],"word":"不会"},{"definition":["in case (sth happens)\/if\/once (sth happens, then...)\/when\/in a short time\/in one day"],"pinyin":["yi1 dan4"],"word":"一旦"},{"definition":["to dare\/daring\/(polite) may I venture"],"pinyin":["gan3"],"word":"敢"},{"definition":["even if\/even though"],"pinyin":["ji2 shi3"],"word":"即使"},{"definition":["as one wishes\/as one pleases\/at random\/negligent\/casual\/wanton"],"pinyin":["sui2 bian4"],"word":"随便"},{"definition":["as one wishes\/according to one's wishes\/at will\/voluntary\/conscious"],"pinyin":["sui2 yi4"],"word":"随意"},{"definition":["granted that\/even if"],"pinyin":["jiu4 suan4"],"word":"就算"},{"definition":["if not\/otherwise\/else\/or else"],"pinyin":["fou3 ze2"],"word":"否则"},{"definition":["to touch\/(fig.) to touch on (a matter)"],"pinyin":["chu4 peng4"],"word":"触碰"},{"definition":["cavalier\/offhand\/reckless"],"pinyin":["qing1 shuai4"],"word":"轻率"},{"definition":["whatever the case\/in any event\/no matter what\/by all possible means"],"pinyin":["wu2 lun4 ru2 he2"],"word":"无论如何"},{"definition":["not so\/no\/or else\/otherwise\/if not\/How about ...?"],"pinyin":["bu4 ran2"],"word":"不然"},{"definition":["treat sth lightly\/to lower one's guard"],"pinyin":["diao4 yi3 qing1 xin1"],"word":"掉以轻心"}]}