{"definition":["severity (of the case)\/degree of seriousness\/whether sth is slight or serious"],"pinyin":["qing1 zhong4"],"traditional":["輕重"],"rank":18056.0,"normalized_rank":0.2526268660892925,"fraction":0.0000029232019779101916,"cumulative_fraction":0.9696862446941784,"word":"轻重","characters":[{"definition":["light\/easy\/gentle\/soft\/reckless\/unimportant\/frivolous\/small in number\/unstressed\/neutral\/to disparage"],"pinyin":["qing1"],"word":"轻"},{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["zhong4","chong2"],"word":"重"}],"containing_words":[{"definition":["to play a critical role (idiom)\/influential"],"pinyin":["ju3 zu2 qing1 zhong4"],"word":"举足轻重"},{"definition":["insignificant"],"pinyin":["wu2 zu2 qing1 zhong4"],"word":"无足轻重"},{"definition":["slight or important, urgent or non-urgent (idiom); to deal with important matters first\/sense of priority"],"pinyin":["qing1 zhong4 huan3 ji2"],"word":"轻重缓急"},{"definition":["lit. not knowing what's important (idiom); no appreciation of the gravity of things\/naive\/doesn't know who's who\/no sense of priorities"],"pinyin":["bu4 zhi1 qing1 zhong4"],"word":"不知轻重"},{"definition":["to invert the importance of things (i.e. stress the unimportant and neglect the important)\/lacking a sense of perspective\/to put the cart before the horse"],"pinyin":["qing1 zhong4 dao4 zhi4"],"word":"轻重倒置"},{"definition":["slight or important, urgent or non-urgent (idiom); to deal with important matters first\/sense of priority\/also written 輕重緩急|轻重缓急"],"pinyin":["huan3 ji2 qing1 zhong4"],"word":"缓急轻重"},{"definition":["lit. to inquire whether the tripods are light or heavy (idiom); a laughable attempt to seize power"],"pinyin":["wen4 ding3 qing1 zhong4"],"word":"问鼎轻重"},{"definition":["to invert the importance of things (i.e. stress the incidental and neglect the main point)\/lacking a sense of perspective\/to put the cart before the horse"],"pinyin":["qing1 zhong4 zhu3 ci4"],"word":"轻重主次"}],"sentences":[{"english":"The level of calcification was positive correlation with time of clinical symptom.","chinese":"钙化的轻重与临床表现出现的早晚成正相关。"},{"english":"City and urban agglomeration are playing a key role in a regional economic development.","chinese":"城市和城市群在一个区域发展中起着举足轻重的作用。"},{"english":"The other two members of the committee are just featherweight .","chinese":"委员会的其他两个成员只是无足轻重的人。"},{"english":"Clouds play an important role in the global climate system.","chinese":"云在全球气候系统中扮演着举足轻重的角色。"},{"english":"Electrocardiographic abnormality was associated with the degree of clinical condition and prognosis.","chinese":"心电图异常与病情轻重及预后密切相关。"},{"english":"Research and application of such master models are prevailing in the industry now.","chinese":"主模型的研制和应用已日益显示出举足轻重的地位。"},{"english":"These young people do not know the proper way to act.","chinese":"这些年轻人做事情不知轻重。"},{"english":"Here's just some lame extra footy.","chinese":"这里的只是一些跛脚的额外无足轻重。"},{"english":"The new Baiyun Airport takes an important role in the Guangzhou municipal construction.","chinese":"新白云机场在广州城市建设中具有举足轻重的地位。"},{"english":"In this prison he is a heavy hitter.","chinese":"在这个监狱里，他可是个举足轻重的人物。"},{"english":"Serve the citizens in order of priority and urgency on practical affair, take the easiest the first .","chinese":"我们为市民办实事要分轻重缓急，先易后难。"},{"english":"He just laughed, and dismissed the question as unimportant.","chinese":"他只是笑了笑，认为问题无足轻重而不予考虑。"},{"english":"South-Pearl was playing a decisive role in our country′s pearl industry.","chinese":"在我国珍珠产业中，南珠具有举足轻重的地位。"},{"english":"The medical ethics construction has the pivotal function in the hospital management work.","chinese":"医德建设在医院管理工作中具有举足轻重的作用。"},{"english":"When collective security is at stake, public opinion can carry great weight.","chinese":"当涉及集体的安全时，舆论是举足轻重的。"},{"english":"When this book first came out, critics called her a lightweight.","chinese":"当她出版了第一本书时评论家们说她无足轻重。"}],"related":[{"definition":["slight or important, urgent or non-urgent (idiom); to deal with important matters first\/sense of priority"],"pinyin":["qing1 zhong4 huan3 ji2"],"word":"轻重缓急"},{"definition":["priority\/whether sth is urgent"],"pinyin":["huan3 ji2"],"word":"缓急"},{"definition":["slight or important, urgent or non-urgent (idiom); to deal with important matters first\/sense of priority\/also written 輕重緩急|轻重缓急"],"pinyin":["huan3 ji2 qing1 zhong4"],"word":"缓急轻重"},{"definition":["deep or shallow\/depth (of the sea)\/limits of decorum"],"pinyin":["shen1 qian3"],"word":"深浅"},{"definition":["to advance or retreat\/knowing when to come and when to leave\/a sense of propriety"],"pinyin":["jin4 tui4"],"word":"进退"},{"definition":["propriety\/appropriate behavior\/proper speech or action\/within the norms"],"pinyin":["fen1 cun5"],"word":"分寸"},{"definition":["lit. crooked and straight\/fig. right and wrong, good and evil"],"pinyin":["qu1 zhi2"],"word":"曲直"},{"definition":["number\/amount"],"pinyin":["duo1 gua3"],"word":"多寡"},{"definition":["length\/duration\/accident\/right and wrong\/good and bad\/long and short"],"pinyin":["chang2 duan3"],"word":"长短"},{"definition":["strong or weak\/intensity\/amount of force or pressure"],"pinyin":["qiang2 ruo4"],"word":"强弱"},{"definition":["to grasp\/(dialect) affecting shyness\/coy\/to create difficulties"],"pinyin":["na2 nie1"],"word":"拿捏"},{"definition":["the important and the less important\/primary and secondary"],"pinyin":["zhu3 ci4"],"word":"主次"},{"definition":["what is true and what is false\/(to get to know) the real situation"],"pinyin":["xu1 shi2"],"word":"虚实"},{"definition":["to distinguish (between different things)\/to make distinctions clear"],"pinyin":["fen1 qing1"],"word":"分清"},{"definition":["to choose\/to accept or reject"],"pinyin":["qu3 she3"],"word":"取舍"},{"definition":["close and distant (relatives)"],"pinyin":["qin1 shu1"],"word":"亲疏"}]}