{"definition":["comparatively\/relatively\/fairly"],"pinyin":["jiao4 wei2"],"traditional":["較為"],"rank":2139.0,"normalized_rank":0.02992738516642648,"fraction":0.00007087856085704999,"cumulative_fraction":0.7407110776003696,"word":"较为","characters":[{"definition":["to compare\/to dispute\/compared to\/(before adj.) relatively\/comparatively\/rather\/also pr. [jiao3]"],"pinyin":["jiao4"],"word":"较"},{"definition":["variant of 為|为[wei4], because of\/for\/to","because of\/for\/to","variant of 為|为[wei2]\/as (i.e. in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do","as (in the capacity of)\/to take sth as\/to act as\/to serve as\/to behave as\/to become\/to be\/to do\/by (in the passive voice)"],"pinyin":["wei4","wei4","wei2","wei2"],"word":"为"}],"containing_words":[],"sentences":[{"english":"While thiol method was simple but much more time costing for reaction.","chinese":"巯基法操作较为简单，但所需的反应时间较长。"},{"english":"His latest biographer, Mr. More, has been more candid.","chinese":"他最近的传记作者，莫尔先生则较为坦诚一些。"},{"english":"Collapse distribution centres on the intensive runoff zones.","chinese":"在地下水强径流带，塌陷分布较为密集。"},{"english":"The ratio of foam concentrate is accurate because of the balance valve's dynamic adjusting.","chinese":"压力平衡阀的动态调节保证了较为精确的混合比。"},{"english":"For this reason, the researches on opening up wasteland were always hot.","chinese":"为此，有关屯垦的研究历来较为活跃。"},{"english":"Financial instruments accounting standards (FIAS) are more complex and special than other accounting standards.","chinese":"金融工具准则在企业会计准则体系中较为特殊和复杂。"},{"english":"But there’s another, darker kind of nontraditional power China is currently amassing.","chinese":"但中国目前在积聚另一种较为黑暗的非传统力量。"},{"english":"Piao Neng in tender latter two stores the year to be pregnant again is more ideal.","chinese":"朴能在娇后两屯年再怀孕较为理想。"},{"english":"The result showed that nanoscale silver has evidently inhibitory effects on testing bacteria.","chinese":"结果表明，纳米银对供试菌种有较为明显的抑制作用。"},{"english":"The Early Palaeozoic strata of the upper-Yangtze region are fully developed in Guizhou Province and its adjacent areas.","chinese":"上扬子区下古生界在贵州及其邻区发育较为完整。"},{"english":"Space Shuttle's reentry is one of the relatively complicated procedure of the entire flight procedure.","chinese":"航天飞机再入段是整个飞行过程中较为复杂的阶段。"},{"english":"The admin console is the simpler of these two tools.","chinese":"在这两种工具中，管理控制台较为简单。"},{"english":"It was an effective alternative to treat condylar osteoma.","chinese":"该术式是治疗髁突骨瘤较为理想的方式。"},{"english":"What are some of the most commonly used phrasal verbs?","chinese":"那么有哪些是较为常用的短语动词表达呢？"},{"english":"It will be an ideal rice transplanting machine at present.","chinese":"水稻钵苗行栽机是目前较为理想的一种水稻移栽机械。"},{"english":"Abstract; Determinations of the major nutrient components of wild Bombax malabaricum DC.","chinese":"对攀枝花的基本营养成分作了较为全面的分析测定。"}],"related":[{"definition":["relatively\/opposite\/to resist\/to oppose\/relative\/vis-a-vis\/counterpart"],"pinyin":["xiang1 dui4"],"word":"相对"},{"definition":["to compare\/to contrast\/comparatively\/relatively\/quite\/comparison"],"pinyin":["bi3 jiao4"],"word":"比较"},{"definition":["even more"],"pinyin":["geng4 wei2"],"word":"更为"},{"definition":["extremely\/exceedingly"],"pinyin":["ji2 wei2"],"word":"极为"},{"definition":["extremely"],"pinyin":["ji2 qi2"],"word":"极其"},{"definition":["equivalent to\/appropriate\/considerably\/to a certain extent\/fairly\/quite"],"pinyin":["xiang1 dang1"],"word":"相当"},{"definition":["the most"],"pinyin":["zui4 wei2"],"word":"最为"},{"definition":["and\/moreover\/yet\/for the time being\/to be about to\/both (... and...)"],"pinyin":["qie3"],"word":"且"},{"definition":["especially"],"pinyin":["you2 wei2"],"word":"尤为"},{"definition":["very\/very much\/unusual\/extraordinary"],"pinyin":["fei1 chang2"],"word":"非常"},{"definition":["better"],"pinyin":["jiao4 hao3"],"word":"较好"},{"definition":["completely\/totally\/total\/entire\/overall\/population (statistics)"],"pinyin":["zong3 ti3"],"word":"总体"},{"definition":["whole entity\/entire body\/synthesis\/as a whole (situation, construction, team etc)\/global\/macrocosm\/integral\/holistic\/whole"],"pinyin":["zheng3 ti3"],"word":"整体"},{"definition":["more (than sth else)\/even more"],"pinyin":["geng4 jia1"],"word":"更加"},{"definition":["range (the difference between the lowest and highest values)","mediocre\/rather poor\/not specially good"],"pinyin":["jiao4 cha1","jiao4 cha4"],"word":"较差"},{"definition":["comparatively large"],"pinyin":["jiao4 da4"],"word":"较大"}]}