{"definition":["petroleum pipeline"],"pinyin":["shu1 you2 guan3"],"traditional":["輸油管"],"rank":27827.0,"normalized_rank":0.3893358331118045,"fraction":0.0000011457783932393056,"cumulative_fraction":0.9879841942543516,"word":"输油管","characters":[{"definition":["to lose\/to transport\/to donate\/to enter (a password)"],"pinyin":["shu1"],"word":"输"},{"definition":["oil\/fat\/grease\/petroleum\/to apply tung oil, paint or varnish\/oily\/greasy\/glib\/cunning"],"pinyin":["you2"],"word":"油"},{"definition":["variant of 管[guan3]","surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["guan3","Guan3","guan3"],"word":"管"}],"containing_words":[],"sentences":[{"english":"The deal was agreed last year and construction is expected to begin soon.","chinese":"这项输油管道协议去年达成，修筑工程预计很快开工。"},{"english":"Through this pipeline, crude oil flows from Daqing to Beijing in a steady stream.","chinese":"大庆石油通过这条输油管源源不断地流往北京。"},{"english":"The operation actualities of Mahuining oil pipeline is introduced.","chinese":"介绍了马惠宁输油管道的施工和投产后的运行现状。"},{"english":"An oil company plans to construct a east to west from the main pipeline.","chinese":"某石油公司计划建造一条由东向西的主输油管道。"},{"english":"In this paper, we set up a mathematical model on decorating the best oil pipelines routes.","chinese":"如何使输油管线建设费用最省，并对此建立数学模型。"},{"english":"This article covers a brief introduction about the test of overall heat transfer coefficient of Dongxin oil pipeline.","chinese":"介绍了东辛输油管道总传热系数的测试情况。"},{"english":"Water hammer is a sort of phenomenon of unsteady flow.","chinese":"水击是输油管道系统中经常出现的一种不稳定流现象。"},{"english":"The system has been widely applied in petroleum pipeline.","chinese":"该系统在输油管线上已得到广泛应用。"},{"english":"This paper deals with the optimization and automation of line-up in piping systems of petroleum refinery.","chinese":"本文讨论炼油厂输油管网调线的最优化与自动问题。"},{"english":"Fatigue any part of the pipeline wall thinning oil spills are likely to break.","chinese":"输油管管壁的任何部位疲劳变薄都有可能断裂漏油。"},{"english":"US will probably get rights to the oil pipeline from the Caspian sea though. The Great Game begins anew.","chinese":"不过，美国将有可能从里海的输油管道上获得好处。"},{"english":"The pipeline about Tie-in technology is the key to the entire oil and gas exploitation.","chinese":"其中，输油管道的回接技术又是整个油气开发的关键。"},{"english":"Villagers scavenging for fuel in Nigeria are blamed for setting off an inferno as gasoline gushing from a ruptured pipeline exploded.","chinese":"在尼日利亚，由于村民偷油，不慎引起输油管道爆炸。"},{"english":"Daqing-Harbin Pipeline passing Songhua River project has applied horizontal oriental drilling technology.","chinese":"庆哈输油管道工程穿越松花江应用了水平定向钻技术。"},{"english":"The lift-up and lie-down are the key operations during installation procedure of seabed pipeline.","chinese":"海底输油管线在敷设过程中需进行管线吊放作业。"},{"english":"Palm trees are everywhere but the country is riddled with oil pipelines, snaking down the roadside inches away from homes.","chinese":"到处有棕榈树，但是在这个国家输油管无处不在。"}],"related":[{"definition":["oil refinery"],"pinyin":["lian4 you2 chang3"],"word":"炼油厂"},{"definition":["tubing\/pipeline\/(fig.) channel\/means"],"pinyin":["guan3 dao4"],"word":"管道"},{"definition":["oil tank"],"pinyin":["you2 xiang1"],"word":"油箱"},{"definition":["fuel depot\/fuel farm"],"pinyin":["you2 ku4"],"word":"油库"},{"definition":["fuel oil"],"pinyin":["ran2 liao4 you2"],"word":"燃料油"},{"definition":["oil pump"],"pinyin":["you2 beng4"],"word":"油泵"},{"definition":["gasoline"],"pinyin":["qi4 you2"],"word":"汽油"},{"definition":["oil spill\/oil leak\/(fig.) boo! (opposite of 加油[jia1 you2])"],"pinyin":["lou4 you2"],"word":"漏油"},{"definition":["oil and gas"],"pinyin":["you2 qi4"],"word":"油气"},{"definition":["diesel fuel"],"pinyin":["chai2 you2"],"word":"柴油"},{"definition":["oil well"],"pinyin":["you2 jing3"],"word":"油井"},{"definition":["oil\/petroleum"],"pinyin":["shi2 you2"],"word":"石油"},{"definition":["oil tanker truck\/fuel tanker"],"pinyin":["you2 guan4 che1"],"word":"油罐车"},{"definition":["pipeline\/general term for pipes, cables etc"],"pinyin":["guan3 xian4"],"word":"管线"},{"definition":["oil sand (mining)"],"pinyin":["you2 sha1"],"word":"油砂"},{"definition":["tanker (ship)\/CL:艘[sou1]"],"pinyin":["you2 lun2"],"word":"油轮"}]}