{"definition":["to investigate"],"pinyin":["bian4 zheng4"],"traditional":["辨證"],"rank":35679.0,"normalized_rank":0.49919550039875205,"fraction":5.706265434032928e-7,"cumulative_fraction":0.9944477942441404,"word":"辨证","characters":[{"definition":["to distinguish\/to recognize"],"pinyin":["bian4"],"word":"辨"},{"definition":["to admonish\/variant of 證|证[zheng4]","certificate\/proof\/to prove\/to demonstrate\/to confirm\/variant of 症[zheng4]"],"pinyin":["zheng4","zheng4"],"word":"证"}],"containing_words":[{"definition":["diagnosis and treatment based on an overall analysis of the illness and the patient's condition"],"pinyin":["bian4 zheng4 shi1 zhi4"],"word":"辨证施治"},{"definition":["holistic diagnosis and treatment (TCM)"],"pinyin":["bian4 zheng4 lun4 zhi4"],"word":"辨证论治"},{"definition":["pattern-syndrome identification based on the eight principles (TCM)"],"pinyin":["ba1 gang1 bian4 zheng4"],"word":"八纲辨证"}],"sentences":[{"english":"At level seven, one would experience unconditional love and no judgmental thoughts.","chinese":"在第七级别，人就会获得自由的爱和辨证的思想。"},{"english":"Objective To investigate the effectiveness of treatment based syndrome differentiation for bronchial asthma.","chinese":"目的观察中医疗法辨证治疗支气管哮喘的疗效。"},{"english":"Or, whether it fits for all diseases of internal medicine, not only those caused by exogenous pathogenic agents?","chinese":"六经辨证是否同时既适用于伤寒病又适用于杂病？"},{"english":"This article introduces the clinical experience in the treatment of androgenic alopecia.","chinese":"介绍中医辨证治疗雄激素源性脱发的临床经验。"},{"english":"Methods:360 plums he spirit the sufferer presses Chinese medicine dialectics the cent type proceed treatment.","chinese":"方法将360例梅核气患者按中医辨证分型进行治疗。"},{"english":"Combine the industry and markets actual, did the analysis of the dialectics .","chinese":"结合产业与市场实际，做了辨证的分析。"},{"english":"To choose different drugs based on different stages of arthralgia syndrome.","chinese":"根据痹证不同时期的病理特点，提出分期辨证用药。"},{"english":"The inner treatment pays attention to whole body in accordance and starts from syndrome differentiation and treatment method.","chinese":"内治法从整体观念著手，以辨证论治为依归。"},{"english":"Three problems of treatment based on syndrome differentiation, TBSD are discussed here.","chinese":"着重探讨了有关辨证论治的三大问题。"},{"english":"The dialectical materialism philosophic thought is generally implied in theory and practice of accounting.","chinese":"会计理论和实践中普遍渗透着辨证唯物主义哲学思想。"},{"english":"To evaluate the usability of endoscopy for the diagnosis of rhinorrhea.","chinese":"评价鼻内窥镜应用于鼻渊辨证施治中的价值。"},{"english":"Objectives To discuss the methods of treating acute cerebral infarction with differentiating cold and heat syndromes.","chinese":"目的探讨运用寒热辨证治疗急性脑梗死的方法。"},{"english":"It is indicated that treatment of amenia based on differentiation of syndromes and the endometrial thickness have close correlativity.","chinese":"说明闭经的辨证论治与子宫内膜厚度有密切的相关性。"},{"english":"Objective:Observe dialectics cent the type cures the clinical curative effect of the plum he spirit.","chinese":"目的观察辨证分型治疗梅核气的临床疗效。"},{"english":"Therefore it was important to emphasize the role of wind-evil in the pathogenesis of palmus in the syndrome differentiation.","chinese":"在辨证论治的前提下，重视风邪为患在发病中的作用。"},{"english":"The theoretic system of traditional Chinese medicine is characterized by the concept of organic wholeness and treatment based on syndrome differentiation.","chinese":"中医学理论体系的基本特点是整体观和辨证论治。"}],"related":[{"definition":["holistic diagnosis and treatment (TCM)"],"pinyin":["bian4 zheng4 lun4 zhi4"],"word":"辨证论治"},{"definition":["diagnosis and treatment based on an overall analysis of the illness and the patient's condition"],"pinyin":["bian4 zheng4 shi1 zhi4"],"word":"辨证施治"},{"definition":["to investigate\/dialectical"],"pinyin":["bian4 zheng4"],"word":"辩证"},{"definition":["interpretation of the cause\/onset and process of an illness\/pathogenesis"],"pinyin":["bing4 ji1"],"word":"病机"},{"definition":["pattern-syndrome identification based on the eight principles (TCM)"],"pinyin":["ba1 gang1 bian4 zheng4"],"word":"八纲辨证"},{"definition":["to apply a treatment\/to undertake a therapy"],"pinyin":["shi1 zhi4"],"word":"施治"},{"definition":["(TCM) the four methods of diagnosis, namely 望診|望诊[wang4 zhen3] (observation), 聞診|闻诊[wen2 zhen3] (auscultation and olfaction), 問診|问诊[wen4 zhen3] (interrogation), 切診|切诊[qie4 zhen3] (pulse feeling and palpation)"],"pinyin":["si4 zhen3"],"word":"四诊"},{"definition":["prescription\/recipe (Chinese medicine)"],"pinyin":["fang1 ji4"],"word":"方剂"},{"definition":["\"eight principles,\" a method of giving a general description and syndrome differentiation (TCM)"],"pinyin":["ba1 gang1"],"word":"八纲"},{"definition":["(TCM) diagnosis based on the patient's pulse\/to make such a diagnosis"],"pinyin":["mai4 zhen3"],"word":"脉诊"},{"definition":["reinforcing and reducing methods (in acupuncture)"],"pinyin":["bu3 xie4"],"word":"补泻"},{"definition":["traditional Chinese medical science\/a doctor trained in Chinese medicine"],"pinyin":["Zhong1 yi1"],"word":"中医"},{"definition":["medicine made from a single herb\/drug made from a single substance"],"pinyin":["dan1 wei4 yao4"],"word":"单味药"},{"definition":["correct diagnosis\/to prescribe the right cure for an illness\/to suit the medicine to the illness"],"pinyin":["dui4 zheng4"],"word":"对症"},{"definition":["Western medicine\/a doctor trained in Western medicine"],"pinyin":["xi1 yi1"],"word":"西医"},{"definition":["to blend two or more medicines\/compatibility (of herbal remedies, medicines)"],"pinyin":["pei4 wu3"],"word":"配伍"}]}