{"definition":["holistic diagnosis and treatment (TCM)"],"pinyin":["bian4 zheng4 lun4 zhi4"],"traditional":["辨證論治"],"rank":56508.0,"normalized_rank":0.7906202342143187,"fraction":6.802557411766039e-8,"cumulative_fraction":0.9996258635757094,"word":"辨证论治","characters":[{"definition":["to distinguish\/to recognize"],"pinyin":["bian4"],"word":"辨"},{"definition":["to admonish\/variant of 證|证[zheng4]","certificate\/proof\/to prove\/to demonstrate\/to confirm\/variant of 症[zheng4]"],"pinyin":["zheng4","zheng4"],"word":"证"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"论"},{"definition":["to rule\/to govern\/to manage\/to control\/to harness (a river)\/to treat (a disease)\/to wipe out (a pest)\/to punish\/to research"],"pinyin":["zhi4"],"word":"治"}],"containing_words":[],"sentences":[{"english":"The inner treatment pays attention to whole body in accordance and starts from syndrome differentiation and treatment method.","chinese":"内治法从整体观念著手，以辨证论治为依归。"},{"english":"Three problems of treatment based on syndrome differentiation, TBSD are discussed here.","chinese":"着重探讨了有关辨证论治的三大问题。"},{"english":"It is indicated that treatment of amenia based on differentiation of syndromes and the endometrial thickness have close correlativity.","chinese":"说明闭经的辨证论治与子宫内膜厚度有密切的相关性。"},{"english":"Therefore it was important to emphasize the role of wind-evil in the pathogenesis of palmus in the syndrome differentiation.","chinese":"在辨证论治的前提下，重视风邪为患在发病中的作用。"},{"english":"The theoretic system of traditional Chinese medicine is characterized by the concept of organic wholeness and treatment based on syndrome differentiation.","chinese":"中医学理论体系的基本特点是整体观和辨证论治。"},{"english":"TCM is characterized by the concept of organic wholeness and treatment based on syndrome differentiation.","chinese":"中医理论体系的基本特点是整体观念和辨证论治。"},{"english":"The treatment group were given TCM treatment, and external deposited Reticulitermes external application.","chinese":"治疗组采用传统中医辨证论治，并配合敷胸散外敷。"},{"english":"Treatment for liver cancer mainly by drying dampness and resolving phlegm.","chinese":"治疗肝癌以燥湿化痰为主进行辨证论治。"},{"english":"This article presents the authors clinical experience int he treatment of diarrhea on syndrome differentiation.","chinese":"结合临床经验论述泄泻辨证论治的体会。"},{"english":"Clarifying the treatment method to tension-type headache by differentiation of TCM.","chinese":"阐述紧张型头痛的中医辨证论治的方法。"},{"english":"To combine treatment based on differentiation of syndromes and specific treatment.","chinese":"辨证论治与独殊治疗相结合。"},{"english":"Syndrome differentiation and treatment should be form five viscera.","chinese":"治疗上宜从五脏辨证论治。"}],"related":[{"definition":["diagnosis and treatment based on an overall analysis of the illness and the patient's condition"],"pinyin":["bian4 zheng4 shi1 zhi4"],"word":"辨证施治"},{"definition":["to investigate"],"pinyin":["bian4 zheng4"],"word":"辨证"},{"definition":["interpretation of the cause\/onset and process of an illness\/pathogenesis"],"pinyin":["bing4 ji1"],"word":"病机"},{"definition":["pattern-syndrome identification based on the eight principles (TCM)"],"pinyin":["ba1 gang1 bian4 zheng4"],"word":"八纲辨证"},{"definition":["to use the same method to treat different diseases (TCM)"],"pinyin":["yi4 bing4 tong2 zhi4"],"word":"异病同治"},{"definition":["traditional Chinese medical science\/a doctor trained in Chinese medicine"],"pinyin":["Zhong1 yi1"],"word":"中医"},{"definition":["prescription\/recipe (Chinese medicine)"],"pinyin":["fang1 ji4"],"word":"方剂"},{"definition":["Western medicine\/a doctor trained in Western medicine"],"pinyin":["xi1 yi1"],"word":"西医"},{"definition":["\"eight principles,\" a method of giving a general description and syndrome differentiation (TCM)"],"pinyin":["ba1 gang1"],"word":"八纲"},{"definition":["to apply a treatment\/to undertake a therapy"],"pinyin":["shi1 zhi4"],"word":"施治"},{"definition":["to investigate\/dialectical"],"pinyin":["bian4 zheng4"],"word":"辩证"},{"definition":["(TCM) the four methods of diagnosis, namely 望診|望诊[wang4 zhen3] (observation), 聞診|闻诊[wen2 zhen3] (auscultation and olfaction), 問診|问诊[wen4 zhen3] (interrogation), 切診|切诊[qie4 zhen3] (pulse feeling and palpation)"],"pinyin":["si4 zhen3"],"word":"四诊"},{"definition":["(TCM) diagnosis based on the patient's pulse\/to make such a diagnosis"],"pinyin":["mai4 zhen3"],"word":"脉诊"},{"definition":["Chinese and Western medicine\/a doctor trained in Chinese and Western medicine"],"pinyin":["zhong1 xi1 yi1"],"word":"中西医"},{"definition":["traditional Chinese medicine\/TCM"],"pinyin":["Zhong1 yi1 xue2"],"word":"中医学"},{"definition":["reinforcing and reducing methods (in acupuncture)"],"pinyin":["bu3 xie4"],"word":"补泻"}]}