{"definition":["border station\/strategic defensive position on frontier"],"pinyin":["bian1 guan1"],"traditional":["邊關"],"rank":36802.0,"normalized_rank":0.5149077273935612,"fraction":5.160309109569303e-7,"cumulative_fraction":0.9950565695587038,"word":"边关","characters":[{"definition":["suffix of a noun of locality","side\/edge\/margin\/border\/boundary\/CL:個|个[ge4]\/simultaneously"],"pinyin":["bian5","bian1"],"word":"边"},{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["guan1","Guan1"],"word":"关"}],"containing_words":[],"sentences":[{"english":"Since ancient times, many colorful banditry commotions more unprecedented.","chinese":"自古边关多匪患，骚动年代更空前。"},{"english":"Sino-American relations belong  to the  complicatedest  bilateral   relations.","chinese":"中美关系是最为复杂的一对双边关系。"},{"english":"The Chinese premier also expressed the hope that the 60th anniversary of the establishment of the Sino-Indian diplomatic ties would become a new starting point for the development of the relations.","chinese":"我希望中印建交60周年成为双边关系发展的新起点。"},{"english":"Qarase fully agreed with Wen's comments on bilateral relations.","chinese":"恩加拉塞完全赞同温家宝对双边关系的评价。"},{"english":"Both sides exchanged views on bilateral ties and issues of common interest.","chinese":"双方就双边关系及共同关心的问题交换了意见。"},{"english":"Both competition and co-operation will feature in U.S.-China bilateral ties in the 21st century.","chinese":"21世纪的美中双边关系既有竞争又有合作。"},{"english":"Tang expressed satisfaction over the recent steady development of Sino-Mexican relations.","chinese":"唐外长对近年来中墨双边关系持续发展表示满意。"},{"english":"Kilman agrees on the comment of the Chinese side on the bilateral ties.","chinese":"基尔曼赞同中方对双边关系的评价。"},{"english":"Tang Jiaxuan pointed out that relations between China and Bosnia-Herzegovina have been developing smoothly since the establishment of diplomatic relations.","chinese":"唐家璇指出，中波两国建交以来，双边关系发展平稳。"},{"english":"China and Russia should continue viewing and addressing our bilateral ties from a strategic perspective.","chinese":"中俄两国应继续从战略高度来看待和处理双边关系。"},{"english":"Contradictions and differences are inevitable in the development course of bilateral relations.","chinese":"在双边关系发展中，出现一些矛盾和分歧在所难免。"},{"english":"It's the silly season in India-China relations.","chinese":"在印度与中国双边关系上，目前是一个新闻饥渴期。"},{"english":"Li extended a welcome to Kabila for his visit and spoke highly of Sino-DRC relations.","chinese":"李鹏欢迎卡比拉来华访问，并积极评价中刚双边关系。"},{"english":"He said that since the establishment of diplomatic ties between China and Mauritius, bilateral relations have been growing smoothly.","chinese":"他说，中毛两国建交以来，双边关系发展顺利。"},{"english":"The two heads of state exchanged in-depth views on pushing forward bilateral ties.","chinese":"两国元首就推动双边关系进一步发展深入交换意见。"},{"english":"Trong said that he fully agreed with Hu's proposal on developing bilateral relations.","chinese":"阮富仲表示完全赞同胡锦涛关于发展双边关系的建议。"}],"related":[{"definition":["to garrison the border\/to guard the frontier\/exile to a border garrison post"],"pinyin":["shu4 bian1"],"word":"戍边"},{"definition":["border area\/borderland\/frontier\/frontier region"],"pinyin":["bian1 jiang1"],"word":"边疆"},{"definition":["frontier fortress"],"pinyin":["bian1 sai4"],"word":"边塞"},{"definition":["to guard"],"pinyin":["shu4 shou3"],"word":"戍守"},{"definition":["beyond the Great Wall"],"pinyin":["sai4 wai4"],"word":"塞外"},{"definition":["North of Xinjiang"],"pinyin":["Bei3 Jiang1"],"word":"北疆"},{"definition":["Liaodong peninsula between Bohai 渤海 and Yellow sea\/east and south of Liaoning province\/east of Liao river 遼河|辽河"],"pinyin":["Liao2 dong1"],"word":"辽东"},{"definition":["Outer Mongolia (lit. north of the Gobi Desert)"],"pinyin":["Mo4 bei3"],"word":"漠北"},{"definition":["border area\/frontier"],"pinyin":["bian1 chui2"],"word":"边陲"},{"definition":["Youzhou, ancient province in north Hebei and Liaoning\/Fanyang 範陽|范阳 ancient city near modern Beijing"],"pinyin":["You1 zhou1"],"word":"幽州"},{"definition":["Anxi county, former name of Guazhou county 瓜州縣|瓜州县[Gua1 zhou1 xian4] in Jiuquan 酒泉[Jiu3 quan2], Gansu"],"pinyin":["An1 xi1"],"word":"安西"},{"definition":["beyond the pass, i.e. the region north and east of Shanhai Pass 山海關|山海关[Shan1 hai3 guan1] or the region west of Jiayu Pass 嘉峪關|嘉峪关[Jia1 yu4 guan1] or both"],"pinyin":["Guan1 wai4"],"word":"关外"},{"definition":["old place name (up to Tang), in Hengshan county 橫山縣|横山县, Yulin, Shaanxi"],"pinyin":["Xia4 zhou1"],"word":"夏州"},{"definition":["frontier defense"],"pinyin":["bian1 fang2"],"word":"边防"},{"definition":["Gyeonggi Province, South Korea, surrounding Seoul and Incheon, capital Suweon City 水原市[Shui3 yuan2 shi4]","capital city and its surrounding area"],"pinyin":["Jing1 ji1","jing1 ji1"],"word":"京畿"},{"definition":["capital of a country (literary)"],"pinyin":["jing1 shi1"],"word":"京师"}]}