{"definition":["Liaodong peninsula between Bohai 渤海 and Yellow sea\/east and south of Liaoning province\/east of Liao river 遼河|辽河"],"pinyin":["Liao2 dong1"],"traditional":["遼東"],"rank":40076.0,"normalized_rank":0.560715235123753,"fraction":3.827533376319862e-7,"cumulative_fraction":0.9965178545060988,"word":"辽东","characters":[{"definition":["short name for Liaoning 遼寧|辽宁[Liao2 ning2] province\/Liao or Khitan dynasty (907-1125)"],"pinyin":["Liao2"],"word":"辽"},{"definition":["surname Dong","east\/host (i.e. sitting on east side of guest)\/landlord"],"pinyin":["Dong1","dong1"],"word":"东"}],"containing_words":[{"definition":["Liaodong Peninsula"],"pinyin":["Liao2 dong1 Ban4 dao3"],"word":"辽东半岛"}],"sentences":[{"english":"Moreover, it is one of the locations opening to the outside world on the Liaodong Peninsula.","chinese":"同时，它也是辽东半岛对外开放的窗口之一。"},{"english":"Dongshi Shu is a historical book that records how the Ming Dynasty managed Liaotung.","chinese":"《东事书》是一部记述明代经营辽东的史籍。"},{"english":"The method of home-made red wine processing in Liaodong region (the eastern side of Liaoning Province) is introduced.","chinese":"介绍了辽东地区家庭自酿红葡萄酒的具体方法。"},{"english":"Qin and Han dynasties, Dalian jurisdiction of Liaodong county.","chinese":"秦汉时期，大连地区属辽东郡辖区。"},{"english":"The fishery has always been an important prehistoric mode of subsistence in Liaodong Peninsula.","chinese":"渔业始终是史前时期辽东半岛重要生业之一。"},{"english":"The uranium-bearing vonsenite deposit in Liaodong (eastern Liaoning) is a unique and superlarge deposit.","chinese":"辽东硼铁矿床是一处类型独特的超大型矿床。"},{"english":"Dalian is a beautiful seaside city on the southern tip of Liaodong Peninsular.","chinese":"大连是辽东半岛南端的一个美丽的海滨城市。"},{"english":"My hometown is Dalian which locates in the Liaotong Peninsula.","chinese":"我的家乡是大连，位于辽东半岛。"},{"english":"Lüshun is a city and port in the northeast of China at the tip of Liaodong Peninsula.","chinese":"旅顺是中国东北辽东半岛顶端的一个城市和港口。"},{"english":"Conclusion:Aralia elata(Miq) seem has prominent anti-response to stimulation effect.","chinese":"结论辽东楤木具有突出的抗应激作用。"},{"english":"Ground in the Dalian City Eurasia is big six east coastses, Chinese northeast, Liaotung Peninsula is the most south to carry.","chinese":"大连市地处欧亚大陆东岸，中国东北辽东半岛最南端。"},{"english":"My hometown dalian is located in the liaodong peninsula.","chinese":"我的家乡大连坐落于辽东半岛。"},{"english":"During the winter, the male inflorescences of Alnus mandshurica and Alnus sibirica were naked.","chinese":"东北桤木和辽东桤木的雄花序均裸露越冬。"},{"english":"Some management advices are proposed according to the regeneration and structure characters of the forests.","chinese":"依据辽东栎林分的天然更新和结构特征提出经营建议。"},{"english":"Panjin, China: A man walks on the frozen sea near Liaodong Bay.","chinese":"盘锦辽东湾，一名男子在冰冻的海面上行走。"},{"english":"My hometown is the dalian city which locate at the front of the peninsula of liaodong in liaoning province.","chinese":"我的家乡是大连，它位于中国辽宁辽东半岛的最前端。"}],"related":[{"definition":["Youzhou, ancient province in north Hebei and Liaoning\/Fanyang 範陽|范阳 ancient city near modern Beijing"],"pinyin":["You1 zhou1"],"word":"幽州"},{"definition":["west of Liaoning"],"pinyin":["liao2 xi1"],"word":"辽西"},{"definition":["Outer Mongolia (lit. north of the Gobi Desert)"],"pinyin":["Mo4 bei3"],"word":"漠北"},{"definition":["beyond the pass, i.e. the region north and east of Shanhai Pass 山海關|山海关[Shan1 hai3 guan1] or the region west of Jiayu Pass 嘉峪關|嘉峪关[Jia1 yu4 guan1] or both"],"pinyin":["Guan1 wai4"],"word":"关外"},{"definition":["Korean Goryeo dynasty, 918-1392\/Korea, esp. in context of art and culture"],"pinyin":["Gao1 li2"],"word":"高丽"},{"definition":["capital of a country (literary)"],"pinyin":["jing1 shi1"],"word":"京师"},{"definition":["border station\/strategic defensive position on frontier"],"pinyin":["bian1 guan1"],"word":"边关"},{"definition":["prisoner of war\/to capture\/to take prisoner\/(old) northern barbarian\/slave"],"pinyin":["lu3"],"word":"虏"},{"definition":["beyond the Great Wall"],"pinyin":["sai4 wai4"],"word":"塞外"},{"definition":["court\/imperial household\/dynasty"],"pinyin":["chao2 ting2"],"word":"朝廷"},{"definition":["Ningyuan county in Yongzhou 永州[Yong3 zhou1], Hunan"],"pinyin":["Ning2 yuan3"],"word":"宁远"},{"definition":["North of Xinjiang"],"pinyin":["Bei3 Jiang1"],"word":"北疆"},{"definition":["Qidan or Khitan, ethnic group in ancient China, a branch of the Eastern Hu people inhabiting the valley of the Xar Murun River in the upper reaches of the Liao River 遼河|辽河[Liao2 He2]"],"pinyin":["Qi4 dan1"],"word":"契丹"},{"definition":["punitive expedition to the north"],"pinyin":["bei3 zheng1"],"word":"北征"},{"definition":["Jishou county level city in Hengshui 衡水[Heng2 shui3], Hebei"],"pinyin":["Ji4 zhou1"],"word":"冀州"},{"definition":["Shanhai Pass in Hebei, at the eastern terminus of the Ming dynasty Great Wall\/Shanhaiguan district of Qinhuangdao city 秦皇島市|秦皇岛市[Qin2 huang2 dao3 shi4], Hebei"],"pinyin":["Shan1 hai3 guan1"],"word":"山海关"}]}