{"definition":["Dharma, the teaching of Buddha\/Bodhidharma"],"pinyin":["Da2 mo2"],"traditional":["達摩"],"rank":32541.0,"normalized_rank":0.4552908091167294,"fraction":7.517847783389506e-7,"cumulative_fraction":0.9923859442018506,"word":"达摩","characters":[{"definition":["surname Da","to attain\/to reach\/to amount to\/to communicate\/eminent"],"pinyin":["Da2","da2"],"word":"达"},{"definition":["to rub"],"pinyin":["mo2"],"word":"摩"}],"containing_words":[{"definition":["Bodhidharma"],"pinyin":["Pu2 ti2 da2 mo2"],"word":"菩提达摩"}],"sentences":[{"english":"Meditating without food does not prove that he is reincarnation of Buddha.","chinese":"能冥想而不禁食不能证明他是达摩转世。"},{"english":"SEE Sword of Damocles Subforum for more information.","chinese":"进入达摩克利斯之剑的子论坛获取更多信息。"},{"english":"That's Gotama the contemplative, sitting surrounded by a large assembly, teaching the Dhamma.","chinese":"那是沙门乔达摩为众人围绕，正端坐说法。"},{"english":"Bodhidharma channel-changing Scripture is one of the earliest exercise method that were practiced by Shaolin Buddhist monks.","chinese":"达摩易筋经是少林寺众僧演练的最早功法之一。"},{"english":"The cave is now called Damo Cave.","chinese":"这个洞穴是现在被称为达摩洞。"},{"english":"So what does Damodaran think Alibaba's share should be worth?","chinese":"那么，达摩达兰认为阿里巴巴的股票价值几何呢？"},{"english":"This has been a general discussion of Patriarch Bodhidharma's life in China.","chinese":"这是达摩祖师一生到中国的大概经过。"},{"english":"These bills now hang over people like the Sword of Damocles.","chinese":"现在这些债务就像达摩克利斯之剑一样悬在人们头上。"},{"english":"A-3. None of the judges realized that they had this sword of Damocles hanging over them.","chinese":"没有一位法官认识到这把达摩利剑正悬在他们的头上。"},{"english":"and her earrings dangle like Damocles' sword.","chinese":"她的耳环危悬如达摩克利斯之剑。"},{"english":"The sea is now a sword of Damocles over the head of the Japanese people.","chinese":"海正一把达摩克利斯剑头上的日本人。"},{"english":"Damocles looked up and saw that the sword when alarmed.","chinese":"达摩克利斯抬头望见这把利剑时，大惊失色。"},{"english":"Night smell before came to DaMaDong kneeling begged the master save copper people outside the hole.","chinese":"晚上闻道来到达摩洞前，跪在洞外祈求大师救铜人们。"},{"english":"Vajrayana thus attempts to recapture the enlightenment experience of the gautama buddha .","chinese":"从而金刚乘是尝试去再体验乔达摩佛的启迪体验。"},{"english":"It is Damo, an Indian monk, who introduced the traditional Dhyana in India into China.","chinese":"印度僧人达摩东渡来华，带来了印度传统的禅法。"},{"english":"More than sixty years passed; for three years Bodhidharma drifted across the ocean until he arrived in China.","chinese":"六十多年之后，达摩远泛重洋，经过三年，达到中国。"}],"related":[{"definition":["Sun Bin (-316 BC), political strategist of the School of Diplomacy 縱橫家|纵横家[Zong4 heng2 jia1] during the Warring States Period (425-221 BC)"],"pinyin":["Sun1 Bin4"],"word":"孙膑"},{"definition":["秦越人[Qin2 Yue4 ren2] (407-310 BC), Warring States physician known for his medical skills, nicknamed Bian Que after the earliest known Chinese physician allegedly from the 黃帝|黄帝[Huang2 di4] era"],"pinyin":["Bian3 Que4"],"word":"扁鹊"},{"definition":["Marco Polo (1254-c. 1324), Venetian trader and explorer who traveled the Silk road to China, author of Il Milione (Travels of Marco Polo)"],"pinyin":["Ma3 ke3 Bo1 luo2"],"word":"马可波罗"},{"definition":["Ying Zheng (260-210 BC), personal name of the first emperor 秦始皇[Qin2 Shi3 huang2]"],"pinyin":["Ying2 Zheng4"],"word":"嬴政"},{"definition":["Diaochan (-192), one of the four legendary beauties 四大美女[si4 da4 mei3 nu:3], in fiction a famous beauty at the break-up of Han dynasty, given as concubine to usurping warlord Dong Zhuo 董卓[Dong3 Zhuo2] to ensure his overthrow by fighting hero Lü Bu 呂布|吕布[Lu:3 Bu4]"],"pinyin":["Diao1 Chan2"],"word":"貂蝉"},{"definition":["Han Xin (-196 BC), famous general of first Han emperor Liu Bang 劉邦|刘邦[Liu2 Bang1]"],"pinyin":["Han2 Xin4"],"word":"韩信"},{"definition":["Cheng Yaojin (589-665), aka 程知節|程知节[Cheng2 Zhi1 jie2], Chinese general of the Tang dynasty"],"pinyin":["Cheng2 Yao3 jin1"],"word":"程咬金"},{"definition":["armor"],"pinyin":["kai3"],"word":"铠"},{"definition":["Zhong Kui (mythological figure, supposed to drive away evil spirits)\/(fig.) a person with the courage to fight against evil"],"pinyin":["Zhong1 Kui2"],"word":"钟馗"},{"definition":["Jiang Ziya (c. 1100 BC, dates of birth and death unknown), partly mythical sage advisor to King Wen of Zhou 周文王[Zhou1 Wen2 wang2] and purported author of “Six Secret Strategic Teachings” 六韜|六韬[Liu4 tao1], one of the Seven Military Classics of ancient China 武經七書|武经七书[Wu3 jing1 Qi1 shu1]"],"pinyin":["Jiang1 Zi3 ya2"],"word":"姜子牙"},{"definition":["Miyamoto (Japanese surname)"],"pinyin":["Gong1 ben3"],"word":"宫本"},{"definition":["Lu Ban, legendary master craftsman, called the father of Chinese carpentry"],"pinyin":["Lu3 Ban1"],"word":"鲁班"},{"definition":["Hua Mulan, legendary woman warrior (c. fifth century), Northern dynasties folk hero recorded in Sui and Tang literature"],"pinyin":["Hua1 Mu4 lan2"],"word":"花木兰"},{"definition":["Guan Yu (-219), general of Shu and blood-brother of Liu Bei in Romance of the Three Kingdoms, fearsome fighter famous for virtue and loyalty\/posthumously worshipped and identified with the guardian Bodhisattva Sangharama"],"pinyin":["Guan1 Yu3"],"word":"关羽"},{"definition":["Nezha, protection deity"],"pinyin":["Ne2 zha5"],"word":"哪吒"},{"definition":["same as Zhuangzi 莊子|庄子 (369-286 BC), Daoist author"],"pinyin":["Zhuang1 Zhou1"],"word":"庄周"}]}