{"definition":["to step out\/to take a (first) step"],"pinyin":["mai4 chu1"],"traditional":["邁出"],"rank":7366.0,"normalized_rank":0.1030598967442251,"fraction":0.00001362336202688982,"cumulative_fraction":0.9017001105197909,"word":"迈出","characters":[{"definition":["to take a step\/to stride"],"pinyin":["mai4"],"word":"迈"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"It starts with that deep breath of confidence you take before the first step.","chinese":"千里之行，开始于迈出第一步前那口自信的深呼吸。"},{"english":"The third improvement is audio quality, which has taken a gigantic step forward.","chinese":"第三个改进是音质，这一点相较以前迈出了一大步。"},{"english":"You will make long strides in your career this year - as long as you keep faith in yourself.","chinese":"只要相信自己双子就会在职业生涯中会迈出一大步。"},{"english":"If you have done this, you have taken the first step for success.","chinese":"假如你已经这么做了，那么你已向成功迈出了第一步。"},{"english":"The study benefits ultra-sound quantitative diagnosis.","chinese":"在超声定量诊断研究上迈出了一步。"},{"english":"Abe told reporters after the talks that the countries made a \"first step\" toward reconciliation.","chinese":"会谈后，安倍对记者说，两国朝和解迈出了第一步。"},{"english":"And this year is as good as any to do that.","chinese":"而今年，跟任何一年一样，都是迈出新步伐的好时机。"},{"english":"But keep in mind this is a baby step on a long road to a truly market-determined yuan exchange rate.","chinese":"但是要记住，漫漫长路我们才迈出了一小步。"},{"english":"This initiative is an important step toward reversing the resource curse.","chinese":"这个动议是朝着扭转资源诅咒迈出的重要一步。"},{"english":"It is a small step in reducing the bigotry of monocultures.","chinese":"这位减少单一文化的偏执迈出了一小步。"},{"english":"This is an important step in the right direction.","chinese":"“这是朝着正确方向迈出的重要一步”。"},{"english":"And the above points are a great step forward for SNDA.","chinese":"上述各点是SNDA向前迈出的一大步。"},{"english":"This hearing was a major step forward in getting the bill passed.","chinese":"这场听证会向法案的最终通过迈出了重要的一步。"},{"english":"Take just 1 step forward today. What will it be?","chinese":"今天只向前迈出1步，将会是什么样的状况呢？"},{"english":"Torquato et. al. paper thus represents the first step towards a similar approach.","chinese":"的论文代表了纳米科技中向类似途径迈出的第一步。"},{"english":"She's the one who helps you for the first step, she's the one who bares all the mishap.","chinese":"她帮助你迈出第一步，她会帮你承受所有的不幸。"}],"related":[{"definition":["surname Bu","a step\/a pace\/walk\/march\/stages in a process\/situation"],"pinyin":["Bu4","bu4"],"word":"步"},{"definition":["to step in\/to stride forward\/to forge ahead"],"pinyin":["mai4 jin4"],"word":"迈进"},{"definition":["large strides"],"pinyin":["da4 bu4"],"word":"大步"},{"definition":["to stride toward (success)\/to march toward\/to take a step toward"],"pinyin":["mai4 xiang4"],"word":"迈向"},{"definition":["step\/pace"],"pinyin":["bu4 zi5"],"word":"步子"},{"definition":["pace\/(measured) step\/march"],"pinyin":["bu4 fa2"],"word":"步伐"},{"definition":["to take a step\/to stride"],"pinyin":["mai4"],"word":"迈"},{"definition":["firm and substantial\/solid"],"pinyin":["jian1 shi2"],"word":"坚实"},{"definition":["to surmount\/to cross over"],"pinyin":["kua4 guo4"],"word":"跨过"},{"definition":["in big strides\/(fig.) in giant steps"],"pinyin":["da4 ta4 bu4"],"word":"大踏步"},{"definition":["to set foot in\/to tread (in or on)\/to walk into"],"pinyin":["ta4 jin4"],"word":"踏进"},{"definition":["forward\/onward"],"pinyin":["xiang4 qian2"],"word":"向前"},{"definition":["footstep\/step"],"pinyin":["jiao3 bu4"],"word":"脚步"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推进"},{"definition":["to fall to the ground\/to be set on the ground\/to reach to the ground\/to be born\/(of a plane) to land"],"pinyin":["luo4 di4"],"word":"落地"},{"definition":["to go forward\/to forge ahead\/to advance\/onward"],"pinyin":["qian2 jin4"],"word":"前进"}]}