{"definition":["to stride toward (success)\/to march toward\/to take a step toward"],"pinyin":["mai4 xiang4"],"traditional":["邁向"],"rank":13833.0,"normalized_rank":0.193541617114155,"fraction":0.000004773614376012044,"cumulative_fraction":0.9538515308062716,"word":"迈向","characters":[{"definition":["to take a step\/to stride"],"pinyin":["mai4"],"word":"迈"},{"definition":["surname Xiang","towards\/to face\/to turn towards\/direction\/to support\/to side with\/shortly before\/formerly\/always\/all along\/(suffix) suitable for ...\/oriented to ...","to tend toward\/to guide\/variant of 向[xiang4]","variant of 向[xiang4]\/direction\/orientation\/to face\/to turn toward\/to\/towards\/shortly before\/formerly"],"pinyin":["Xiang4","xiang4","xiang4","xiang4"],"word":"向"}],"containing_words":[],"sentences":[{"english":"The obvious one is the move towards the architecture that are by and large loosely coupled distributed systems.","chinese":"最明显的一个是迈向架构，是对大松耦合分布式系统。"},{"english":"Failure is an essential step towards success.","chinese":"失败是迈向成功之路所必不可少的。"},{"english":"Dr. Sun Yat-sen led the Chinese people to a free country.","chinese":"孙逸仙博士带领中国人民迈向自由。"},{"english":"There are many ways to avoid success in life, but the most sure-fire just might be procrastination.","chinese":"在我们的人生道路中有许多事情牵拌着我们迈向成功。"},{"english":"We are reaching out for a new and boundless frontier.","chinese":"我们现在正迈向一个没有边际的新境界。"},{"english":"They have often raise a man from mediocrity to success.","chinese":"它们常常使一个平庸之辈迈向成功。"},{"english":"In fact, one may pay for frustration on the way to success.","chinese":"挫折其实就是迈向成功所应缴的学费。"},{"english":"Look at life through the wind-shield.","chinese":"透过档风玻璃迈向人生。"},{"english":"Your habits alone determine who you become. Your habits alone determine if you succeed.","chinese":"仅仅你的习惯就能决定你能成为谁，是否迈向成功。"},{"english":"It was, for a brief time, a brisk stroll into the future.","chinese":"在一个短暂时间内，它是一次迈向未来的轻快漫步。"},{"english":"The march to China's cities is part of a global sea change.","chinese":"迈向中国城市的行军是全球大变化的一部分。"},{"english":"Yu of the Xia Dynasty exploited the road towards civilization in the Huanghe River Basin.","chinese":"夏禹的功业，据说开辟了黄河流域迈向文明的道路。"},{"english":"Xing to eat at home, cattle father and mother to encourage them to advance to marriage.","chinese":"邢致在一一家吃饭，牛父牛母鼓励他俩早点迈向婚姻。"},{"english":"Striver itself more to being a success means a group of people.","chinese":"奋斗者本身也更多的是指那群正在迈向成功的人。"},{"english":"We should work to maintain a medium-high rate of growth and promote the development of industries toward the medium-high end.","chinese":"保持经济中高速增长，推动产业迈向中高端水平。"},{"english":"Zhanhaoju is sincerely willing to hand by hand stride with the vast consumers and customers in the new century.","chinese":"展灏居愿真诚与广大客户及消费者携手迈向新的世纪。"}],"related":[{"definition":["to step in\/to stride forward\/to forge ahead"],"pinyin":["mai4 jin4"],"word":"迈进"},{"definition":["to step into\/to enter"],"pinyin":["bu4 ru4"],"word":"步入"},{"definition":["new level\/higher plane"],"pinyin":["xin1 jie1 duan4"],"word":"新阶段"},{"definition":["direction\/strike (i.e. angle of inclination in geology)\/inclination\/trend\/to move towards\/to head for"],"pinyin":["zou3 xiang4"],"word":"走向"},{"definition":["to step out\/to take a (first) step"],"pinyin":["mai4 chu1"],"word":"迈出"},{"definition":["the road one must follow or take\/the only way"],"pinyin":["bi4 you2 zhi1 lu4"],"word":"必由之路"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引领"},{"definition":["new age"],"pinyin":["xin1 shi2 dai4"],"word":"新时代"},{"definition":["to walk into"],"pinyin":["zou3 ru4"],"word":"走入"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推动"},{"definition":["start\/beginning"],"pinyin":["kai1 duan1"],"word":"开端"},{"definition":["journey\/expedition\/voyage"],"pinyin":["zheng1 cheng2"],"word":"征程"},{"definition":["broad and open road (idiom); fig. brilliant future prospects"],"pinyin":["kang1 zhuang1 da4 dao4"],"word":"康庄大道"},{"definition":["(aerospace) to boost\/booster (rocket)\/(behavioral economics) to nudge"],"pinyin":["zhu4 tui1"],"word":"助推"},{"definition":["fast lane"],"pinyin":["kuai4 che1 dao4"],"word":"快车道"},{"definition":["a helping hand\/help\/assistance"],"pinyin":["zhu4 li4"],"word":"助力"}]}