{"definition":["in the past few days\/recently\/in the last few days"],"pinyin":["jin4 ri4"],"traditional":["近日"],"rank":816.0,"normalized_rank":0.011416898689015431,"fraction":0.00019475050372802605,"cumulative_fraction":0.5875569422939616,"word":"近日","characters":[{"definition":["near\/close to\/approximately"],"pinyin":["jin4"],"word":"近"},{"definition":["abbr. for 日本[Ri4 ben3], Japan","sun\/day\/date, day of the month"],"pinyin":["Ri4","ri4"],"word":"日"}],"containing_words":[{"definition":["perihelion, the nearest point of a planet in elliptic orbit to the sun\/lower apsis"],"pinyin":["jin4 ri4 dian3"],"word":"近日点"}],"sentences":[{"english":"Recently, also identified specific procedures and the purchase of \"three table\" vetting .","chinese":"近日，又确定了具体的购买程序和“三表”审核办法。"},{"english":"The current vegetable price slump has taken its toll on Chinese farmers.","chinese":"近日蔬菜价格暴跌使广大的中国菜农损失惨重。"},{"english":"It is reported that the temperature will decline sharply in one or two days.","chinese":"据报告近日气温将明显下降。"},{"english":"The anomalistic year is the time between successive transits of the Earth through the perihelion.","chinese":"近点年是地球连续两次通过近日点之间的时间。"},{"english":"Rafael Benitez has today been boosted by the return to fitness of defender Daniel Agger.","chinese":"贝尼特斯今天表示，阿格将在近日正式复出。"},{"english":"Raw materials, the Ministry of Industry, Deputy Secretary Song was recently revealed long beads.","chinese":"工信部原材料司副司长宋显珠近日透露。"},{"english":"We shall have the pleasure of welcoming your visiting soon.","chinese":"倘于近日能欢迎您来访，我们将感到快乐。"},{"english":"China to launch fifth orbiter for its own 'GPS' .","chinese":"我国近日将择机发射第五颗北斗导航卫星。"},{"english":"It is a pity because recently rumours that female the ghost begging meters of water, avoid gossip mirror hung the boss.","chinese":"可惜因为近日盛传女鬼乞米水，老板挂着八卦镜防避。"},{"english":"I have just received your letter telling me your recent marriage.","chinese":"顷接来函，承你告我近日结婚。"},{"english":"Scientists discovered recently that men could live longer if they did more chores.","chinese":"科学家近日发现，爱做家务活的男性寿命更长。"},{"english":"Recently, Wu, chairman of the hotel, the more-accepted an exclusive interview with our reporter.","chinese":"近日，该酒店董事长吴愈勇接受了本报记者的专访。"},{"english":"The recruiting result of UNNC Art Troupe Performance Team, 2011 will be published recently. Please check on time.","chinese":"艺术团表演队伍招新结果会在近日公布，请及时查收。"},{"english":"Recently, websites such as sohu.com, set up special sections for people to \"divulge their salaries\".","chinese":"近日，搜狐等网站设立了一些所谓的“晒工资”专区。"},{"english":"This reporter recently received information from the City Planning Board.","chinese":"这是记者近日从市规划局获得的信息。"},{"english":"Heavy rains have fallen on Ankang Permanent Way Depot for 7 straight days.","chinese":"近日，安康工务段管内连续出现7天强降雨。"}],"related":[{"definition":["the other day\/a few days ago"],"pinyin":["ri4 qian2"],"word":"日前"},{"definition":["not long ago\/not long before"],"pinyin":["qian2 bu4 jiu3"],"word":"前不久"},{"definition":["not long ago"],"pinyin":["bu4 jiu3 qian2"],"word":"不久前"},{"definition":["recently"],"pinyin":["qian2 duan4 shi2 jian1"],"word":"前段时间"},{"definition":["a few days before"],"pinyin":["qian2 ji3 tian1"],"word":"前几天"},{"definition":["recently\/soon\/nearest"],"pinyin":["zui4 jin4"],"word":"最近"},{"definition":["near in time\/in the near future\/very soon\/recent"],"pinyin":["jin4 qi1"],"word":"近期"},{"definition":["late last year\/the end of last year"],"pinyin":["qu4 nian2 di3"],"word":"去年底"},{"definition":["according to reports\/it is reported (that)"],"pinyin":["ju4 xi1"],"word":"据悉"},{"definition":["to report (news)\/report\/CL:篇[pian1],份[fen4]"],"pinyin":["bao4 dao4"],"word":"报道"},{"definition":["not alone but in pairs (idiom, usually derog.); not a unique occurrence\/it's not the only case"],"pinyin":["wu2 du2 you3 ou3"],"word":"无独有偶"},{"definition":["yesterday"],"pinyin":["zuo2 ri4"],"word":"昨日"},{"definition":["to learn of sth\/to find out\/to get news"],"pinyin":["huo4 xi1"],"word":"获悉"},{"definition":["last month"],"pinyin":["shang4 ge4 yue4"],"word":"上个月"},{"definition":["to expose (photography)\/(fig.) to expose (a scandal)\/(advertising) exposure\/Taiwan pr. [pu4 guang1]"],"pinyin":["bao4 guang1"],"word":"曝光"},{"definition":["(of video clips, rumors etc) to circulate on the Internet"],"pinyin":["wang3 chuan2"],"word":"网传"}]}