{"definition":["this (person)"],"pinyin":["zhe4 wei4"],"traditional":["這位"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"这位","characters":[{"definition":["this\/these\/(commonly pr. [zhei4] before a classifier, esp. in Beijing)"],"pinyin":["zhe4"],"word":"这"},{"definition":["position\/location\/place\/seat\/classifier for people (honorific)\/classifier for binary bits (e.g. 十六位 16-bit or 2 bytes)\/(physics) potential"],"pinyin":["wei4"],"word":"位"}],"containing_words":[],"sentences":[{"english":"The pity of it is that an intelligent man appears to have been seduced by the sound of his own voice.","chinese":"不幸的是，这位智者似乎被自己的声音误导了。"},{"english":"The leader had joined the army much earlier after graduating from high school.","chinese":"这位班长自打高中毕业后就入伍了。"},{"english":"Mengsk approached the smaller man and stood before him, an intimidating presence.","chinese":"蒙克斯以威迫的姿态靠近并站在这位小矮人前面。"},{"english":"All the old lady did was quote a scripture to you.","chinese":"这位剩女所做的就是念了一段经。"},{"english":"The new premier is forming his government mainly from young men.","chinese":"这位新总理主要从年轻人中物色人选组建政府。"},{"english":"This congressman is clever at making scores off hecklers at public meetings.","chinese":"这位国会议员擅长在公众集会上驳倒诘难者。"},{"english":"Duggan, a father of four, died of a single gunshot wound to the chest, an inquest at north London Coroner's Court heard on Tuesday.","chinese":"验尸报告称，这位四岁小孩的父亲被枪击中胸腔致死。"},{"english":"Entirely devoted to the Party, the young soldier gave his life for his country.","chinese":"对党无限忠诚，这位年轻的士兵为祖国献出了生命。"},{"english":"My acquaintance confirmed that his fellow postmen were neither terribly nice nor terribly nasty.","chinese":"我这位熟人证明，他的同事们既不太好，也不太差。"},{"english":"The guy in blue told me they were teasing the silk.","chinese":"穿蓝衣的这位老哥告诉我他们正梳理的是Silk。"},{"english":"Rachel, this is Michael Lee.","chinese":"瑞秋，这位是李迈可。"},{"english":"The young boxer has copped the prize of the first round.","chinese":"这位年轻的拳击手已获得了第一回合的胜利。"},{"english":"The lawyer has been appointed to mediate between the employers and the union leaders.","chinese":"这位律师被指定在雇主和工会领导人之间进行调解。"},{"english":"So the widow one day entreated me to sing it to her thus.","chinese":"因此这位寡妇有一天请求我用这调子唱给她听。"},{"english":"The actress is dressed by the best-known designer in Paris.","chinese":"这位女明星的衣服是由巴黎最知名的设计师提供的。"},{"english":"Nothing can beguile the old man.","chinese":"什么也欺骗不了这位老人。"}],"related":[{"definition":["position\/location\/place\/seat\/classifier for people (honorific)\/classifier for binary bits (e.g. 十六位 16-bit or 2 bytes)\/(physics) potential"],"pinyin":["wei4"],"word":"位"},{"definition":["he or him\/(used for either sex when the sex is unknown or unimportant)\/(used before sb's name for emphasis)\/(used as a meaningless mock object)\/other\/another"],"pinyin":["ta1"],"word":"他"},{"definition":["this\/this one"],"pinyin":["zhe4 ge5"],"word":"这个"},{"definition":["plural marker for pronouns, and nouns referring to individuals"],"pinyin":["men5"],"word":"们"},{"definition":["however\/yet\/but"],"pinyin":["ran2 er2"],"word":"然而"},{"definition":["young man\/young guy\/lad\/youngster\/CL:個|个[ge4]"],"pinyin":["xiao3 huo3 zi5"],"word":"小伙子"},{"definition":["to call oneself\/to claim to be\/to profess\/to claim a title"],"pinyin":["zi4 cheng1"],"word":"自称"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["oneself\/one's own"],"pinyin":["zi4 ji3"],"word":"自己"},{"definition":["unexpectedly\/to one's surprise\/in spite of everything\/in that crazy way\/actually\/to go as far as to"],"pinyin":["jing4 ran2"],"word":"竟然"},{"definition":["that one\/that thing\/that (as opposed to this)\/(used before a verb or adjective for emphasis)\/(used to humorously or indirectly refer to sth embarrassing, funny etc, or when one can't think of the right word)\/(used in speech as a filler, similar to \"umm\", \"you know\" etc)\/(euph.) menstruation\/sex\/also pr. [nei4 ge5]"],"pinyin":["na4 ge5"],"word":"那个"},{"definition":["eldest of father's younger brothers\/uncle (term used to address a man about the age of one's father)"],"pinyin":["da4 shu1"],"word":"大叔"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不过"},{"definition":["but\/however\/(used for emphasis) indeed"],"pinyin":["ke3 shi4"],"word":"可是"},{"definition":["in the capacity of\/as"],"pinyin":["shen1 wei2"],"word":"身为"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","unofficial variant of 瞭[liao4]","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly","(of eyes) bright\/clear-sighted\/to understand clearly"],"pinyin":["le5","liao4","liao3","liao3"],"word":"了"}]}