{"definition":["thus\/if this happens then"],"pinyin":["zhe4 yang4 yi1 lai2"],"traditional":["這樣一來"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"这样一来","characters":[{"definition":["this\/these\/(commonly pr. [zhei4] before a classifier, esp. in Beijing)"],"pinyin":["zhe4"],"word":"这"},{"definition":["manner\/pattern\/way\/appearance\/shape\/classifier: kind, type"],"pinyin":["yang4"],"word":"样"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"来"}],"containing_words":[],"sentences":[{"english":"As a result, it is not necessary to maintain a positive ketosis test long term.","chinese":"这样一来，就没有必要坚持长期测试积极酮症了。"},{"english":"As a result, significantly impact on the stability of the solder.","chinese":"这样一来，就大大影响了焊锡的稳定性。"},{"english":"He closed a head gate so that the moat dried up and she could walk through.","chinese":"这样一来，壕中的水干了，姑娘就可以走到果园去了。"},{"english":"We should thus subordinate the prevention of first offences to the prevention of recidivism .","chinese":"这样一来，我们便会让预防初犯屈从于预防累犯。"},{"english":"As a result, the stability of the county began to peace.","chinese":"这样一来，安定郡开始太平起来。"},{"english":"because that way a lot of different groups can use the same space.","chinese":"因为这样一来很多不同的团队可以用同一个空间。"},{"english":"Photography cannot escape the issues that arise when taking into consideration the standpoint of the observer.","chinese":"这样一来，摄影人就无法逃脱观察立场的问题了。"},{"english":"For this reason, they believed in Fei Changfang even more firmly than before.","chinese":"这样一来，他们愈发相信起费长房的话来。"},{"english":"Because it would follow then, that when I'm asleep, I'm dead.","chinese":"因为这样一来我睡觉时，我是死的。"},{"english":"At this point, advertising on Bing becomes far more interesting.","chinese":"这样一来，Bing的广告业务便更有看头了。"},{"english":"That created a constant military presence in the streets.","chinese":"这样一来在街道上始终有军事存在。"},{"english":"This removes it at once beyond the special care of the founder.","chinese":"这样一来，它立即就可以摆脱创业人的特殊照料。"},{"english":"Thus actual power had shifted still more in Bormann's favor.","chinese":"这样一来，就更有利于博尔曼操纵实权了。"},{"english":"And that may lead to more effective treatments or preventive measures.","chinese":"这样一来，我们就能提供更有效的治疗或预防措施。"},{"english":"This way, I can share my summer vacation with them.","chinese":"这样一来，我就能跟他们一同分享我的暑假了。"},{"english":"The personality theory must be false.","chinese":"这样一来人格理论一定是错误的了。"}],"related":[]}