{"definition":["to enter or exit\/to go through"],"pinyin":["jin4 chu1"],"traditional":["進出"],"rank":6652.0,"normalized_rank":0.0930701103913366,"fraction":0.0000159096636188014,"cumulative_fraction":0.8911891822903573,"word":"进出","characters":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"进"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc","variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1","chu1"],"word":"出"}],"containing_words":[{"definition":["import and export"],"pinyin":["jin4 chu1 kou3"],"word":"进出口"},{"definition":["The Export-Import Bank of China (state-owned bank)"],"pinyin":["Zhong1 guo2 Jin4 chu1 kou3 Yin2 hang2"],"word":"中国进出口银行"},{"definition":["entering and leaving a country"],"pinyin":["jin4 chu1 jing4"],"word":"进出境"},{"definition":["China Precision Machinery Import-Export Corporation (CPMIEC)"],"pinyin":["Zhong1 guo2 Jing1 mi4 Ji1 xie4 Jin4 Chu1 kou3 Gong1 si1"],"word":"中国精密机械进出口公司"},{"definition":["China National Aero-Technology Import & Export Corporation (CATIC)"],"pinyin":["Zhong1 hang2 ji4 Jin4 chu1 kou3 You3 xian4 Ze2 ren4 Gong1 si1"],"word":"中航技进出口有限责任公司"}],"sentences":[{"english":"We also do import and export business in chemicals and agricultural products.","chinese":"我公司还经营化学产品和家产品进出口的业务。"},{"english":"Our company is an enterprise which is invested by Hong Kong investor only and manages businesses independently.","chinese":"我公司是港商独资企业，自主经营进出口业务。"},{"english":"Your company is a leading dealer in import and export of hi-tech instruments in China.","chinese":"贵公司是中国最大的高科技设备进出口商。"},{"english":"Perhaps an import-export situation will need all your tender loving care.","chinese":"可能是一个需要你全部细致照料的进出口买卖。"},{"english":"Objective To discuss the techniques and methods of rodents killing in in-and-out small - scale ships.","chinese":"目的探讨进出境小型船舶灭鼠的技术和方法。"},{"english":"Several inlet and oytlet methods and specifications.","chinese":"进出线口有多种方式及规格。"},{"english":"NO deliver rights, must through the third party to do trade and import or export.","chinese":"没有总销权，必须通过第三方来干贸易和进出口。"},{"english":"Over the past few seasons, they've been linked to nearly every big star and transfer story around.","chinese":"过去几个赛季里大牌球员进进出出。"},{"english":"And a by-pass pipe with check valve is set between the inlet and outlet of circulating pump.","chinese":"在循环泵进出口之间设置带止回阀的旁通管。"},{"english":"Loading and unloading inbound and outbound means of transport may be subject to supervision and control of the Customs.","chinese":"海关可以对进出境运输工具装卸货物实施监装监卸。"},{"english":"Goods in the bonded warehouse with offshorely passes in and out freely.","chinese":"货物在保税仓库与境外之间自由进出。"},{"english":"We have the best surveyor， China Import and Export Commodity Inspection Bureau.","chinese":"我们有最好的公证行，即中国进出口商品检验局。"},{"english":"The first half of 2006 flights per week to 780 sorties .","chinese":"2006年上半年每周进出港航班为780架次。"},{"english":"The bank would like to expand further into rural markets.","chinese":"进出口银行希望进一步拓展到农村市场。"},{"english":"Criminals can use the \" streetscape\" to find the path out of housing.","chinese":"犯罪人员可以利用“街景”，找到进出房屋的路径。"},{"english":"Qingdao Hengshilong Tranding Co. Ltd. has many years' experience in import and export business.","chinese":"青岛恒世隆贸易有限公司有多年的进出口经验。"}],"related":[{"definition":["to go out and come in\/entrance and exit\/expenditure and income\/discrepancy\/inconsistent"],"pinyin":["chu1 ru4"],"word":"出入"},{"definition":["to come and go\/to have dealings with\/to be in relation with"],"pinyin":["lai2 wang3"],"word":"来往"},{"definition":["(communications) channel\/thoroughfare\/passage","Tongdao Dong autonomous county in Huaihua 懷化|怀化[Huai2 hua4], Hunan"],"pinyin":["tong1 dao4","Tong1 dao4"],"word":"通道"},{"definition":["gateway"],"pinyin":["chu1 ru4 kou3"],"word":"出入口"},{"definition":["dealings\/contacts\/to go back and forth"],"pinyin":["wang3 lai2"],"word":"往来"},{"definition":["to go through\/to pass through\/to be in general use"],"pinyin":["tong1 xing2"],"word":"通行"},{"definition":["to lead to"],"pinyin":["tong1 wang3"],"word":"通往"},{"definition":["to blockade\/to seal off"],"pinyin":["feng1 suo3"],"word":"封锁"},{"definition":["to connect\/to communicate\/to relate\/(math.) connected"],"pinyin":["lian2 tong1"],"word":"连通"},{"definition":["to let pass"],"pinyin":["fang4 xing2"],"word":"放行"},{"definition":["to seal\/to close\/to confine\/to seal off\/to close down\/sealed\/confined\/closed\/unreceptive"],"pinyin":["feng1 bi4"],"word":"封闭"},{"definition":["to guard"],"pinyin":["ba3 shou3"],"word":"把守"},{"definition":["the back door\/fig. under the counter (indirect way for influence or pressure)\/anus"],"pinyin":["hou4 men2"],"word":"后门"},{"definition":["roads open in all directions (idiom); accessible from all sides"],"pinyin":["si4 tong1 ba1 da2"],"word":"四通八达"},{"definition":["(of a car, ship, train etc) to enter"],"pinyin":["shi3 ru4"],"word":"驶入"},{"definition":["to leave port\/to put off"],"pinyin":["shi3 chu1"],"word":"驶出"}]}