{"definition":["to enter the venue\/to enter the arena\/(aviation) to approach the airfield\/(investing) to get into the market"],"pinyin":["jin4 chang3"],"traditional":["進場"],"rank":8036.0,"normalized_rank":0.1124340660109412,"fraction":0.000011858784473382786,"cumulative_fraction":0.9102269794544028,"word":"进场","characters":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"进"},{"definition":["threshing floor\/classifier for events and happenings: spell, episode, bout","large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","variant of 場|场[chang2]","variant of 場|场[chang3]"],"pinyin":["chang2","chang3","chang2","chang3"],"word":"场"}],"containing_words":[],"sentences":[{"english":"It tries to shoo the finches away, but a gruesome kind of artistry comes into play here.","chinese":"它试图决定离开，但是加拉的可怕的艺术性进场。"},{"english":"Ryan snuck into the movie after it started.","chinese":"雷恩在电影开演后偷溜进场。"},{"english":"Come over here and get ready to go in.","chinese":"请你们出来，到集合地点，准备进场。"},{"english":"The fee for the admittance of commodities to shopping malls is even higher than that for supermarkets.","chinese":"相比较超市，百货商场的进场费还要高。"},{"english":"What is that like to see Yao carry the flag.","chinese":"你看到姚明在开幕式举旗进场时感觉怎样？"},{"english":"Woolly Razorback comes into play with three ice counters on it.","chinese":"粗茸刃背猪进场时上面有三个寒冰指示物。"},{"english":"When Grave Defiler comes into play, reveal the top four cards of your library.","chinese":"当墓场污者进场时，展示你牌库顶上的四张牌。"},{"english":"When Mind Maggots comes into play, choose and discard any number of creature cards.","chinese":"当心灵蛆进场时，选择弃掉任意数量的生物牌。"},{"english":"Reporters wishing to attend the conference in-person must have a valid press credential for access.","chinese":"想要到现场报道的记者必须有一个有效记者证来进场。"},{"english":"He watched as the brothers completed their entrance and positioned themselves before polished oak pews.","chinese":"他看着武士们全部进场安坐在擦亮的橡木长凳上。"},{"english":"When Booby Trap comes into play, name a card other than a basic land.","chinese":"当诡雷进场时，说出一张基本地之外的牌名称。"},{"english":"This ticket admits two persons.","chinese":"这张票可让两人进场。"},{"english":"When Roc Hatchling comes into play, put four shell counters on it.","chinese":"当雏巨鸟进场时，放四个蛋壳指示物在上面。"},{"english":"Search your library for an artifact card and put that artifact into play. Shuffle your library afterward.","chinese":"从你的牌库中搜寻任一张神器牌，并将其放置进场。"},{"english":"At the beginning of a ceremonial parade,he gives the order to march on.","chinese":"阅兵仪式开始时，他下令部队进场。"},{"english":"Organize constructors to enter the field and build infrastructures before construction according to the plan.","chinese":"按计划组织施工人员进场，搞好临建设施。"}],"related":[{"definition":["to enter the venue for a meeting\/to enter into an examination\/to enter a stadium, arena etc"],"pinyin":["ru4 chang3"],"word":"入场"},{"definition":["preceding period\/early stage"],"pinyin":["qian2 qi1"],"word":"前期"},{"definition":["to work\/to operate\/to manipulate"],"pinyin":["cao1 zuo4"],"word":"操作"},{"definition":["to purchase\/to buy in (goods)"],"pinyin":["mai3 jin4"],"word":"买进"},{"definition":["to send off (player for a foul)\/to knock out (i.e. to beat in a knock-out tournament)\/to eliminate\/to call out\/to kill off\/to pull out of (a competition)\/to retire (a runner in baseball)\/out (i.e. man out in baseball)"],"pinyin":["chu1 ju2"],"word":"出局"},{"definition":["market price\/quotation of market price\/the current market situation"],"pinyin":["hang2 qing2"],"word":"行情"},{"definition":["poor prospects in the short term (finance)"],"pinyin":["duan3 kong1"],"word":"短空"},{"definition":["bull market (prices appear to be rising)"],"pinyin":["kan4 zhang3"],"word":"看涨"},{"definition":["to wait and see\/to watch from the sidelines\/to look around\/to survey"],"pinyin":["guan1 wang4"],"word":"观望"},{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"word":"反弹"},{"definition":["short term"],"pinyin":["duan3 xian4"],"word":"短线"},{"definition":["good prospects in the short term (finance)"],"pinyin":["duan3 duo1"],"word":"短多"},{"definition":["phony\/so-called\/armchair (expert)\/vain (promise)\/(finance) short-seller\/bear (market)\/short (selling)"],"pinyin":["kong1 tou2"],"word":"空头"},{"definition":["stop-loss point, a point at which you make a small loss to limit your losses"],"pinyin":["zhi3 sun3 dian3"],"word":"止损点"},{"definition":["to close a position (finance)"],"pinyin":["ping2 cang1"],"word":"平仓"},{"definition":["to do sth in batches or groups"],"pinyin":["fen1 pi1"],"word":"分批"}]}