{"definition":["to feed (a machine)\/foreign goods (abbr. of 進口資料|进口资料)"],"pinyin":["jin4 liao4"],"traditional":["進料"],"rank":35529.0,"normalized_rank":0.4970968057868006,"fraction":5.782173800001134e-7,"cumulative_fraction":0.99436155752314,"word":"进料","characters":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"进"},{"definition":["material\/stuff\/grain\/feed\/to expect\/to anticipate\/to guess"],"pinyin":["liao4"],"word":"料"}],"containing_words":[],"sentences":[{"english":"Both size and related position of the manhole and the feeding port are variable upon necessity.","chinese":"入孔与进料口的大小和相对位置，可根据需求改变。"},{"english":"It can also reach pre-screening purpose to increase feeding efficiency.","chinese":"给料机还可以进行预筛分，从而增加有效进料。"},{"english":"Optimum Design of Plastic Injection Mould Gate Based on MoldFlow;","chinese":"对透明塑料罩壳注射模结构，采用点浇口进料。"},{"english":"Auto settling & feeding, single layer or double layer packing film.","chinese":"自动理糖进料，单层或双层包装膜包装。"},{"english":"The higher the pressure became, the more apparente the action of flow rate became.","chinese":"而压力差提高，进料速率将起到明显作用。"},{"english":"On the other hand, at high cell temperature, OCV is higher with low feed of methanol concentration.","chinese":"在高温下，低浓度的甲醇进料拥有较高的开路电位。"},{"english":"For on-road diesel, judicious selection of easy-to-treat feedstock is a potential strategy.","chinese":"生产低硫柴油时，选择容易脱硫之进料是上策之一。"},{"english":"It is the first time that end - charging has been adopted on a walking -beam type steel tube reheating, furnace in China.","chinese":"步进梁式钢管再加热炉端部进料在国内尚属首例。"},{"english":"To melt the charge radio frequency induction heating or resistance heating have been used.","chinese":"为了熔化进料，可用射频感应加热或电阻加热法。"},{"english":"The combined stream then flows to the surge section of the Feed Reactor Drum .","chinese":"合并后的物流然后流入进料反应罐的缓冲段。"},{"english":"The most complex part of RFCC is in the feed injection zone.","chinese":"提升管的进料段是裂化反应最复杂的区域。"},{"english":"The check list is styourdard of incoming quality check for 1st portion raw material for rrev up.","chinese":"这个检查表是爬坡坐蓐原资料进料检验的依据。"},{"english":"For the injection mold structure of transparent plastic cover shell, point gate feeding is adopted.","chinese":"对透明塑料罩壳注射模结构，采用点浇口进料。"},{"english":"Examples of parts our feeder systems process are molded parts, electrical contacts, diagnostic membranes, pallets, Tyvek sheets.","chinese":"我们进料系统进包括电气接触，诊断膜，托盘。"},{"english":"Article 3. The bonded factory shall be placed under Customs control.","chinese":"第三条进料加工保税工厂受海关监管。"},{"english":"Materials will be mixed, respectively, after the three-tier co-extrusion blown film line to feed the population.","chinese":"将混合后的物料分别送到三层共挤吹膜设备的进料口。"}],"related":[{"definition":["cattle feeder\/hopper (wicker basket)"],"pinyin":["liao4 dou3"],"word":"料斗"},{"definition":["granary\/storehouse"],"pinyin":["liao4 cang1"],"word":"料仓"},{"definition":["material"],"pinyin":["wu4 liao4"],"word":"物料"},{"definition":["sluice\/chute"],"pinyin":["liu1 cao2"],"word":"溜槽"},{"definition":["screw"],"pinyin":["luo2 gan3"],"word":"螺杆"},{"definition":["filtrate\/solid residue produced by a filter\/mud from filtering can sugar"],"pinyin":["lu:4 bing3"],"word":"滤饼"},{"definition":["receiving materials"],"pinyin":["ling3 liao4"],"word":"领料"},{"definition":["continuous casting (metallurgy)"],"pinyin":["lian2 zhu4"],"word":"连铸"},{"definition":["semifinished materials\/CL:塊|块[kuai4]"],"pinyin":["pi1 liao4"],"word":"坯料"},{"definition":["ball mill"],"pinyin":["qiu2 mo2 ji1"],"word":"球磨机"},{"definition":["rolling steel"],"pinyin":["zha2 zhi4"],"word":"轧制"},{"definition":["vacuum pump"],"pinyin":["zhen1 kong1 beng4"],"word":"真空泵"},{"definition":["stripping (chemistry)"],"pinyin":["qi4 ti2"],"word":"汽提"},{"definition":["a device for concentrating (a liquid)\/a condenser"],"pinyin":["nong2 suo1 ji1"],"word":"浓缩机"},{"definition":["steel rolling mill"],"pinyin":["zha2 ji1"],"word":"轧机"},{"definition":["flowmeter"],"pinyin":["liu2 liang4 ji4"],"word":"流量计"}]}