{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"traditional":["進行"],"rank":54.0,"normalized_rank":0.0007555300603024919,"fraction":0.0016529810152565068,"cumulative_fraction":0.2563664781915805,"word":"进行","characters":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"进"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"}],"containing_words":[{"definition":["progressive\/gradual"],"pinyin":["jin4 xing2 xing4"],"word":"进行性"},{"definition":["march (musical)"],"pinyin":["jin4 xing2 qu3"],"word":"进行曲"},{"definition":["primary progressive aphasia (PPA), speech disorder (sometimes related to dementia)"],"pinyin":["yuan2 fa1 xing4 jin4 xing2 xing4 shi1 yu3"],"word":"原发性进行性失语"},{"definition":["March of the Volunteer Army (PRC National Anthem)"],"pinyin":["Yi4 yong3 jun1 Jin4 xing2 qu3"],"word":"义勇军进行曲"},{"definition":["to carry out a transaction"],"pinyin":["jin4 xing2 jiao1 yi4"],"word":"进行交易"},{"definition":["to have sex\/to have sexual intercourse"],"pinyin":["jin4 xing2 xing4 jiao1"],"word":"进行性交"},{"definition":["progressive aphasia\/gradual loss of speech"],"pinyin":["jin4 xing2 xing4 shi1 yu3"],"word":"进行性失语"},{"definition":["executable program"],"pinyin":["jin4 xing2 bian1 cheng2"],"word":"进行编程"},{"definition":["to communicate\/to carry out communications"],"pinyin":["jin4 xing2 tong1 xin4"],"word":"进行通信"}],"sentences":[{"english":"Jia-wen Luo do the experimental investigation and make a research summary and finish the research report.","chinese":"由罗家文进行实验探究并将成果汇总并制成研究报告。"},{"english":"He transacts business with a large number of stores.","chinese":"他与很多商店进行交易。"},{"english":"Wants efficient changeovers between products with minimum downtime.","chinese":"用最少时间进行产品间转换。"},{"english":"Some problems concerned with the mast cells in the cardiac wall were discussed in this paper.","chinese":"文中对心壁内这种细胞的有关问题进行了讨论。"},{"english":"In this paper, we propose a mathematical model of planar reflector on the Solar pond.","chinese":"本文提出了太阳池反射板的数学模型，并进行了计算。"},{"english":"The paper studied 7 case Masked civet of dystocia in farm condition.","chinese":"本文对7例在养殖条件下难产的花面狸进行了研究。"},{"english":"The paper compares the economical efficiency of the VRV heat pump air condition system to the traditional heating systems.","chinese":"对VRV热泵空调系统采暖的经济性进行了分析比较。"},{"english":"The process of phytosterol extraction from soybean oil deodorizer distillate was studied.","chinese":"对脱臭馏出物中提取植物甾醇的工艺进行了研究。"},{"english":"At the same time, the use of coal exhaustive method to optimize selection.","chinese":"同时利用穷举法对配煤进行优化选取。"},{"english":"The next step is to desaturate the layer that will take on the bloom effect.","chinese":"下一步是对图层进行去饱和，图层将获得辉光效果。"},{"english":"The act expressly provides for injunctive relief.","chinese":"刑事救济规定对受害人进行充分补偿。"},{"english":"The epidemic was stopped before the annual pilgrimage to Mecca got under way.","chinese":"这传染病在一年一度进行麦加朝圣之前停止。"},{"english":"No junketing activity would be conducted on official expenses without permission of the company.","chinese":"在未得到公司授权情况下，不得以公费进行宴请活动。"},{"english":"You work on your muscle groups in a certain order.","chinese":"对各个肌肉群，你是在按照一个特定的顺序进行。"},{"english":"I also worked at an insurance company for my graduate field work.","chinese":"并且我在一家保险公司进行了我的毕业设计。"},{"english":"The type of surgery is the first to be conducted on an infant.","chinese":"这是首次在初生婴儿身上进行的同类型手术。"}],"related":[{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通过"},{"definition":["to adopt or carry out (measures, policies, course of action)\/to take"],"pinyin":["cai3 qu3"],"word":"采取"},{"definition":["to target\/to focus on\/to be aimed at or against\/in response to"],"pinyin":["zhen1 dui4"],"word":"针对"},{"definition":["to launch\/to develop\/to unfold\/(of an exhibition etc) to open"],"pinyin":["kai1 zhan3"],"word":"开展"},{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge","to combine\/to amalgamate","variant of 並|并[bing4]"],"pinyin":["bing4","bing4","bing4"],"word":"并"},{"definition":["to unfold\/to carry out\/to be in full swing\/to launch"],"pinyin":["zhan3 kai1"],"word":"展开"},{"definition":["to use\/to employ\/to apply\/to make use of"],"pinyin":["shi3 yong4"],"word":"使用"},{"definition":["to implement\/to carry out"],"pinyin":["shi2 shi1"],"word":"实施"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["to give\/to impose\/to apply"],"pinyin":["yu3 yi3"],"word":"予以"},{"definition":["to pass\/to go through\/process\/course\/CL:個|个[ge4]"],"pinyin":["jing1 guo4"],"word":"经过"},{"definition":["in addition\/moreover\/(used before a disyllabic verb to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["jia1 yi3"],"word":"加以"},{"definition":["to reinforce\/to strengthen\/to increase"],"pinyin":["jia1 qiang2"],"word":"加强"},{"definition":["way\/manner\/style\/mode\/pattern\/CL:個|个[ge4]"],"pinyin":["fang1 shi4"],"word":"方式"},{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"对"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同时"}]}