{"definition":["progressive\/gradual"],"pinyin":["jin4 xing2 xing4"],"traditional":["進行性"],"rank":23276.0,"normalized_rank":0.3256614385852,"fraction":0.0000017340682294928922,"cumulative_fraction":0.9815233295933304,"word":"进行性","characters":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"进"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[{"definition":["primary progressive aphasia (PPA), speech disorder (sometimes related to dementia)"],"pinyin":["yuan2 fa1 xing4 jin4 xing2 xing4 shi1 yu3"],"word":"原发性进行性失语"},{"definition":["to have sex\/to have sexual intercourse"],"pinyin":["jin4 xing2 xing4 jiao1"],"word":"进行性交"},{"definition":["progressive aphasia\/gradual loss of speech"],"pinyin":["jin4 xing2 xing4 shi1 yu3"],"word":"进行性失语"}],"sentences":[{"english":"But that does not mean earlier sex education might not be justified for other reasons.","chinese":"但是这并不意味着提前进行性教育是毫无理由的。"},{"english":"The authors reported 5 cases of myositis ossificans progressiva.","chinese":"报告了5例进行性骨化性肌炎。"},{"english":"Is the inchoate expression of esophagus cancer to have sexual deglutition difficulty?","chinese":"食管癌的早期表现是进行性吞咽困难？"},{"english":"The major symptoms of the patients were progressive dysphagia and pain behind sternum.","chinese":"主要症状为进行性吞咽困难和胸骨后疼痛。"},{"english":"The major symptoms of the patients were progressive dysphagia and pain behind the sternum.","chinese":"主要症状为进行性吞咽困难和胸骨后疼痛。"},{"english":"Objective The clinical observation of treatment with acupuncture and herbs for muscular pseudohypertrophy and progressive myodystrophy.","chinese":"目的针药综合治疗进行性肌营养不良症的临床观察。"},{"english":"In patients with lymphoma, the development of symptoms tends to be indolent and progressive.","chinese":"淋巴瘤的患者，临床发展通常是无痛性的和进行性的。"},{"english":"To discuss the clinical features and diagnosis of Myositis Ossificans Progressiva.","chinese":"目的探讨进行性骨化性肌炎的临床特征和诊断要点。"},{"english":"The kids who ask for OCPs have already decided to have sex.","chinese":"要求避孕药的孩子已经决定进行性活动。"},{"english":"This progressive brain disease can lead to acute and selected memory loss.","chinese":"这种进行性脑部疾病可以导致急性病导致记忆力丧失。"},{"english":"Bureau of lesions can be limited or diffuse, static or progressive.","chinese":"病变可以是限局性或弥漫性，静止性或进行性。"},{"english":"Why and how do therapists conduct a sexological examination?","chinese":"性治疗师为何与如何进行性科学检查？"},{"english":"It is universal that rodents use pheromones or odors to recognize sexes.","chinese":"啮齿动物普遍利用外激素进行性识别。"}],"related":[]}