{"definition":["and then (what follows next)"],"pinyin":["jin4 er2"],"traditional":["進而"],"rank":5020.0,"normalized_rank":0.07023631301330573,"fraction":0.000023925879020297545,"cumulative_fraction":0.8594238374331922,"word":"进而","characters":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"进"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"}],"containing_words":[],"sentences":[{"english":"Moreover, the existence of absorbing sets was achieved in the non-homogeneous case.","chinese":"进而，也得到了对非齐次问题吸收集的存在性。"},{"english":"This, in turn, may cause more page breaks than are strictly necessary.","chinese":"这进而会导致一些严格说来不必要的换页。"},{"english":"It could aggravate the symptoms by amplifying the very inflammatory agents that cause them.","chinese":"这会增加引发这些症状的炎性因子进而加剧症状。"},{"english":"The paper ends up with a summary on the intercoordination between the cold high intensity and air-sea int…","chinese":"进而概括出冷高压强度与海气系统变化的相互关系。"},{"english":"Moreover, the rate-dependent deformation could also be explained from the point of grain boundary energy.","chinese":"进而从晶界能量角度解释率相关变形的原因。"},{"english":"The viscosity breaker selected through experiment is SB-2. Process parameters of pump production are designed for each well in the reservoir.","chinese":"进而对该油藏各井电泵生产的工艺参数进行了设计。"},{"english":"Further, the paper expounds the judicious method used to determine errors of right-angle prism.","chinese":"进而阐明了直角棱镜误差给定的合理方法。"},{"english":"The paper ends up with a summary on the intercoordination between the cold high intensity and air-sea interaction variations.","chinese":"进而概括出冷高压强度与海气系统变化的相互关系。"},{"english":"Guo and her colleagues found more interesting curriculums online.","chinese":"进而，郭蕾和同事又在网上找到更多的精彩课程。"},{"english":"On the basis mentioned above, the corresponding Boolean functions with second order and with third order correlation immunities are given.","chinese":"进而给出了相应的二阶和三阶相关免疫函数。"},{"english":"They raise the monitor slightly byelevatingthe back edge of the computer.","chinese":"它们抬高了电脑的后缘，进而略微升高了显示器。"},{"english":"The author of this paper also gives an analysis on the causes of this diversified painting style.","chinese":"进而指出，该墓壁画是由一个规范的画工组织完成的。"},{"english":"It can be a psychological boost by providing peace of mind and companionship.","chinese":"借由火所带来的心灵平静与陪伴，可以进而振奋精神。"},{"english":"Then plane reflection blazed gratings are discussed theoretically.","chinese":"进而从理论上讨论了平面反射闪耀光栅。"},{"english":"Image causes the tourists have one feeling of pursuing, then actuates to go.","chinese":"形象使旅游者产生一种追求感，进而驱动旅游者前往。"},{"english":"Finally, the model may be applied to forecast the complicated degree of small structure in unmined u…","chinese":"进而，对未采单元小构造复杂程度进行预测。"}],"related":[{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"从而"},{"definition":["to induce\/to promote\/to urge\/to impel\/to bring about\/to provoke\/to drive (sb to do sth)\/to catalyze\/to actuate\/to contribute to (some development)"],"pinyin":["cu4 shi3"],"word":"促使"},{"definition":["then\/afterwards"],"pinyin":["ji4 er2"],"word":"继而"},{"definition":["hereby\/from this"],"pinyin":["you2 ci3"],"word":"由此"},{"definition":["usable\/workable\/feasible\/doable\/to make\/to cause"],"pinyin":["shi3 de5"],"word":"使得"},{"definition":["to make\/to cause\/to enable\/to use\/to employ\/to send\/to instruct sb to do sth\/envoy\/messenger"],"pinyin":["shi3"],"word":"使"},{"definition":["therefore\/as a result\/thus\/and as a result, ..."],"pinyin":["yin1 er2"],"word":"因而"},{"definition":["to lead to\/to create\/to cause\/to bring about"],"pinyin":["dao3 zhi4"],"word":"导致"},{"definition":["itself\/oneself\/one's own"],"pinyin":["zi4 shen1"],"word":"自身"},{"definition":["conversely\/in reverse order\/in an opposite direction"],"pinyin":["fan3 guo5 lai2"],"word":"反过来"},{"definition":["on the other hand\/another aspect"],"pinyin":["ling4 yi1 fang1 mian4"],"word":"另一方面"},{"definition":["to arise\/to come into being\/to come about\/to give rise to\/to bring into being\/to bring about\/to produce\/to engender\/to generate\/to appear\/appearance\/emergence\/generation\/production\/yield"],"pinyin":["chan3 sheng1"],"word":"产生"},{"definition":["with this\/thereby\/thus\/because of this"],"pinyin":["yi3 ci3"],"word":"以此"},{"definition":["to cause\/to result in"],"pinyin":["zhi4 shi3"],"word":"致使"},{"definition":["thus\/consequently\/as a result"],"pinyin":["yin1 ci3"],"word":"因此"},{"definition":["inevitable\/certain\/necessity"],"pinyin":["bi4 ran2"],"word":"必然"}]}