{"definition":["to enter and garrison\/(fig.) to establish a presence in"],"pinyin":["jin4 zhu4"],"traditional":["進駐"],"rank":6791.0,"normalized_rank":0.09501490073174486,"fraction":0.000015393048797337024,"cumulative_fraction":0.8933668419311862,"word":"进驻","characters":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"进"},{"definition":["to halt\/to stay\/to be stationed (of troops, diplomats etc)"],"pinyin":["zhu4"],"word":"驻"}],"containing_words":[],"sentences":[{"english":"So far, 3772 establishments have found home in these quarters.","chinese":"目前已有3772家企业进驻园区。"},{"english":"In areas occupied by the army, the landlords also go under easily.","chinese":"在八路军进驻的地区，地主也不难制服。"},{"english":"Third, UPP presence may bring new problems.","chinese":"第三，UPP进驻可能带来新的问题。"},{"english":"This is a hefty deterrent to doing business in poor countries, some studies have found.","chinese":"有研究发现，这成了企业进驻穷国的极大障碍。"},{"english":"For starters, DreamWorks pays Universal hefty rent.","chinese":"作为进驻的工作室，梦工厂付了高额租金。"},{"english":"What kind of pixy could enter there?","chinese":"什么样的精灵能够进驻在其中？"},{"english":"but now JP Morgan are moving into their building.","chinese":"但是现在摩根大通公司进驻他们的大楼了。"},{"english":"In order to destroy the AA emplacements , you'll need to first deal with the anti-tank fortifications.","chinese":"为了破坏机管局进驻，你需要先与反坦克防御工事。"},{"english":"Then the opposition Nepali Congress Party expects to move into government to oversee elections.","chinese":"反对党尼泊尔大会党则希望能进驻政府监督选举。"},{"english":"Now, just like the MARV, the Redeemer can be garrisoned with infantry.","chinese":"和MARV类似，救赎者也可以进驻步兵。"},{"english":"Do the companies receive any incentives for being located in the park?","chinese":"公司进驻中张江高科技园区时，是否收到任何奖励？"},{"english":"When Obama moved into the White House, he brought the narrative with him.","chinese":"当奥巴马进驻白宫的时候，它把这篇叙述体也带上了。"},{"english":"From there you can then move into the professional world with confidence.","chinese":"从那里开始，你以后就可以自信地进驻职业世界。"},{"english":"This year the firm entered the Balkans and Mongolia.","chinese":"今年，该公司进驻巴尔干半岛各国和蒙古国。"},{"english":"Actually, the real is the second in the individual speculators.","chinese":"其实，真正的炒家是第二批进驻的散客。"},{"english":"Currently, the rules have been formally entered hospital project team to work in our city.","chinese":"目前，中规院项目组已正式进驻我市开展工作。"}],"related":[{"definition":["to make an amphibious assault\/to seize a beachhead\/to gain a foothold in (a new market)"],"pinyin":["qiang3 tan1"],"word":"抢滩"},{"definition":["to dispatch (sb) in an official capacity\/to be posted (as an ambassador, foreign correspondent etc)"],"pinyin":["pai4 zhu4"],"word":"派驻"},{"definition":["to withdraw\/to leave\/to retreat\/to pull out"],"pinyin":["che4 chu1"],"word":"撤出"},{"definition":["general headquarters"],"pinyin":["zong3 bu4"],"word":"总部"},{"definition":["(do sth) on a large scale"],"pinyin":["da4 ju3"],"word":"大举"},{"definition":["to prepare to build sth"],"pinyin":["chou2 jian4"],"word":"筹建"},{"definition":["to station\/to garrison (troops)"],"pinyin":["zhu4 zha1"],"word":"驻扎"},{"definition":["to occupy (a territory)\/to hold"],"pinyin":["zhan4 ling3"],"word":"占领"},{"definition":["to open a business\/to open a practice\/open (for business)"],"pinyin":["kai1 ye4"],"word":"开业"},{"definition":["to assemble\/to concentrate\/to mass\/to build up\/to marshal"],"pinyin":["ji2 jie2"],"word":"集结"},{"definition":["to start out on a trip\/to dispatch troops"],"pinyin":["chu1 dong4"],"word":"出动"},{"definition":["to march\/to advance"],"pinyin":["jin4 jun1"],"word":"进军"},{"definition":["to retire\/to remove\/to withdraw\/to evacuate"],"pinyin":["che4 zou3"],"word":"撤走"},{"definition":["to establish\/to set up\/to be tenable\/to hold water"],"pinyin":["cheng2 li4"],"word":"成立"},{"definition":["station\/encampment"],"pinyin":["zhu4 di4"],"word":"驻地"},{"definition":["to dispose\/to deploy\/deployment"],"pinyin":["bu4 shu3"],"word":"部署"}]}