{"definition":["to be related\/to entail\/to involve\/joint (liability etc)"],"pinyin":["lian2 dai4"],"traditional":["連帶"],"rank":6807.0,"normalized_rank":0.09523876149035301,"fraction":0.000015347795733009823,"cumulative_fraction":0.89361273540453,"word":"连带","characters":[{"definition":["to link\/to join\/to connect\/continuously\/in succession\/including\/(used with 也[ye3], 都[dou1] etc) even\/company (military)","surname Lian"],"pinyin":["lian2","Lian2"],"word":"连"},{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"带"}],"containing_words":[{"definition":["to bear joint responsibility for sth\/joint liability (law)"],"pinyin":["lian2 dai4 ze2 ren4"],"word":"连带责任"}],"sentences":[{"english":"Precise and predictable patterns of this MEFP design allow the agile LAM to use aim point selection for precision effects and minimum collateral damage.","chinese":"在选择当中自主估算精确效果和最小量连带损害值。"},{"english":"This tutorial window, with the original search box, should still be here.","chinese":"教程的窗口，连带原来的搜索框，应该还在这。"},{"english":"The partners shall assume unlimited joint liability for the debts of the enterprise.","chinese":"合伙人对企业债务负连带无穷责任。"},{"english":"The new partner shall bear unlimited joint and several liability for the debts of the partnership incurred before he enters into the partnership.","chinese":"新合伙人对入伙前合伙企业的债务承担无限连带责任。"},{"english":"This is connected, obviously, with Hobbes's denial of free will.","chinese":"这说法跟霍布士否定自由意志明显有连带关系。"},{"english":"There are internal and external validity and effectiveness of untruthful joint and several debt.","chinese":"不真正连带债务分为对内效力和对外效力。"},{"english":"He was the collateral damage.","chinese":"他是连带被株连的牺牲品。"},{"english":"Such tort-feasors are jointly and severally liable.","chinese":"此种侵权行为为要承担共同和连带责任。"},{"english":"The hotel has a pool with bar and spacious sun terrace with loungers and umbrellas.","chinese":"酒店设有一个游泳池和一间连带迷人海景露台的餐厅。"},{"english":"But in spite of these associations, home and house are in reality very different.","chinese":"但尽管有这些连带的关系，家与屋事实是很不相同的。"},{"english":"Overrule a plaintiff to require the other respondent the litigation solicit that the assumption connects to take liability to pay compensation.","chinese":"驳回原告要求其他被告承担连带赔偿责任的诉讼请求。"},{"english":"Their home was destroyed — along with three puppies that were inside.","chinese":"最终这家人的屋子付之一炬，连带屋中的三只小狗。"},{"english":"He should undertake the duty of indemnity to the right spouse.","chinese":"应当承担对受害配偶的连带损害赔偿责任。"},{"english":"Otherwise the original obligor and the new obligor are collectively and bisectally liable.","chinese":"其余情况下，原债务人和新债务人承担连带责任。"},{"english":"In case there are two or more guarantors, they shall undertake guaranty liabilities jointly and severally.","chinese":"保证人为二人以上的，相互之间负连带保证责任。"},{"english":"All of the obligations of the Guarantor hereunder shall be joint several.","chinese":"担保人在本担保书项下承担的义务均应是连带的。"}],"related":[{"definition":["together with\/along with"],"pinyin":["lian2 tong2"],"word":"连同"},{"definition":["so much (that)\/even (to the extent that)"],"pinyin":["shen4 zhi4 yu2"],"word":"甚至于"},{"definition":["more than half\/greater part\/most\/probably\/most likely"],"pinyin":["da4 ban4"],"word":"大半"},{"definition":["to lump together\/to treat along with all the others","variant of 一併|一并, to lump together\/to treat along with all the others"],"pinyin":["yi1 bing4","yi1 bing4"],"word":"一并"},{"definition":["thereupon\/subsequently\/accordingly"],"pinyin":["sui2 zhi1"],"word":"随之"},{"definition":["the entire sum\/the whole amount"],"pinyin":["quan2 shu4"],"word":"全数"},{"definition":["everything"],"pinyin":["jin4 shu4"],"word":"尽数"},{"definition":["imperceptibly\/virtually"],"pinyin":["wu2 xing2 zhong1"],"word":"无形中"},{"definition":["not the only\/not merely\/not simply"],"pinyin":["bu4 dan1"],"word":"不单"},{"definition":["not only that, but ..."],"pinyin":["bu4 jin3 ru2 ci3"],"word":"不仅如此"},{"definition":["in an instant"],"pinyin":["qing3 ke4 jian1"],"word":"顷刻间"},{"definition":["(do sth) in passing\/incidentally (while doing sth else)"],"pinyin":["shun4 dai4"],"word":"顺带"},{"definition":["to bear the brunt"],"pinyin":["shou3 dang1 qi2 chong1"],"word":"首当其冲"},{"definition":["(coll.) maybe\/perhaps"],"pinyin":["gao3 bu5 hao3"],"word":"搞不好"},{"definition":["this time"],"pinyin":["zhe4 xia4 zi5"],"word":"这下子"},{"definition":["originally\/original\/former"],"pinyin":["yuan2 xian1"],"word":"原先"}]}