{"definition":["to add something extra\/an additional increment\/addendum\/to append\/an additional posthumous title"],"pinyin":["zhui1 jia1"],"traditional":["追加"],"rank":8093.0,"normalized_rank":0.11323156996348273,"fraction":0.000011750615051878093,"cumulative_fraction":0.9108998577782728,"word":"追加","characters":[{"definition":["to sculpt\/to carve\/musical instrument (old)","to chase after\/to seek\/to do one's utmost to seek or procure sth\/to recall"],"pinyin":["dui1","zhui1"],"word":"追"},{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"}],"containing_words":[],"sentences":[{"english":"Does tax preference transition period exist when foreign-funded enterprises deposit additional funds.","chinese":"外商投资企业追加投资是否存在税收优惠过渡期？"},{"english":"The new US$100 million funding is subject to approval by the World Bank's Board of Directors.","chinese":"1亿美元追加资金需经世行董事会审批。"},{"english":"With a view to that, toler can be set to guarantee the success in stop loss.","chinese":"故此透过追加点数，以确保用家能成功止损。"},{"english":"You can send in an ad dition al order later.","chinese":"你可以以后再下追加订单。"},{"english":"This will mean additional demand for domestic bank credit in the near term.","chinese":"这意味着近期内国内银行信贷将追加需求。"},{"english":"While an additional 60 billion, one third will be used for rail transit construction.","chinese":"而追加的60亿元中，三分之一将用于轨道交通建设。"},{"english":"A stock dividend is a prorata distribution of additional shares of a corporation's stock to the stockholders.","chinese":"红股是按照比例分配给持股人的公司股本的追加股份。"},{"english":"Ketamine produced a dose-dependent reduction in the \"rescue\" opioid requirements.","chinese":"氯胺酮可剂量依赖性地减少追加阿片类药物的需要量。"},{"english":"If it does not, consider supplemental insurance.","chinese":"如果无效或不包含则要考虑追加保险。"},{"english":"square metres of land in the rst quarter;Wanke also acquired 5.62 million square metres of additional land reserves in the rst half of this year.","chinese":"万科在今年上半年也追加了562万平米的土地储备。"},{"english":"If you are prepared to increase the commi ion, we will order extra 3000 sets.","chinese":"如果你们增加佣金，我们将追加定购3000套。"},{"english":"The reordering newsboy problem was researched under the uncertainty circumstances.","chinese":"研究模糊环境下可追加订购的报童问题。"},{"english":"Besides the capital equipment investment, what other areas will require investment?","chinese":"除了资本性的设备投资之外，还需要哪些追加投资？"},{"english":"Clearly, the need to fund an additional supplementary budget for disaster reconstruction is fueling these worries some more.","chinese":"显然，灾后重建的额外追加预算带来更多的忧虑。"},{"english":"I have to superadd the budget expenses, in my opinion.","chinese":"看来，我得追加预算开支啦。"},{"english":"Power is generated from the hips and torso.","chinese":"用髋部和躯干发力，用双肩还原为手臂追加速度。"}],"related":[{"definition":["extra\/added\/additional"],"pinyin":["e2 wai4"],"word":"额外"},{"definition":["ruling"],"pinyin":["cai2 ding4"],"word":"裁定"},{"definition":["to reject\/to turn down\/to overrule"],"pinyin":["bo2 hui2"],"word":"驳回"},{"definition":["to appeal (a judicial case)\/appeal"],"pinyin":["shang4 su4"],"word":"上诉"},{"definition":["to deduct"],"pinyin":["kou4 chu2"],"word":"扣除"},{"definition":["to delay\/to extend\/to postpone\/to defer"],"pinyin":["yan2 qi1"],"word":"延期"},{"definition":["to penalize\/to punish"],"pinyin":["chu3 fa2"],"word":"处罚"},{"definition":["follow-up\/(dialect) to remarry"],"pinyin":["hou4 xu4"],"word":"后续"},{"definition":["to give\/to impose\/to apply"],"pinyin":["yu3 yi3"],"word":"予以"},{"definition":["to take effect\/to go into effect"],"pinyin":["sheng1 xiao4"],"word":"生效"},{"definition":["to compensate\/to make up"],"pinyin":["bu3 chang2"],"word":"补偿"},{"definition":["to replenish\/to supplement\/to complement\/additional\/supplementary\/CL:個|个[ge4]"],"pinyin":["bu3 chong1"],"word":"补充"},{"definition":["judgment (by a court of law)\/to pass judgment on\/to sentence"],"pinyin":["pan4 jue2"],"word":"判决"},{"definition":["to use discretion\/to take circumstances into account\/to make allowances pertinent to a situation"],"pinyin":["zhuo2 qing2"],"word":"酌情"},{"definition":["to amend\/to alter\/to modify"],"pinyin":["xiu1 gai3"],"word":"修改"},{"definition":["to compensate"],"pinyin":["pei2 chang2"],"word":"赔偿"}]}