{"definition":["to recognize sth after the event\/posthumous recognition\/to ratify\/to endorse retroactively"],"pinyin":["zhui1 ren4"],"traditional":["追認"],"rank":31960.0,"normalized_rank":0.4471618653197711,"fraction":7.925125362334298e-7,"cumulative_fraction":0.9919371662054328,"word":"追认","characters":[{"definition":["to sculpt\/to carve\/musical instrument (old)","to chase after\/to seek\/to do one's utmost to seek or procure sth\/to recall"],"pinyin":["dui1","zhui1"],"word":"追"},{"definition":["to recognize\/to know\/to admit"],"pinyin":["ren4"],"word":"认"}],"containing_words":[],"sentences":[{"english":"The obligee's ratification of unauthorized disposition can validate the disposition behavior.","chinese":"权利人对无权处分的追认可以使处分行为有效。"},{"english":"If the act is not so recognized, the performer shall bear civil liability for it.","chinese":"未经追认的行为，由行为人承担民事责任。"},{"english":"Provided that nothing in this section shall affect the ratification of an unauthorized signature not amounting to a forgery.","chinese":"但本条对追认未经授权但不属伪冒之签名，并无影响。"},{"english":"Where the legal agent does not respond, the non-response shall be deemed a refusal of ratification.","chinese":"法定代理人未作表示的，视为拒绝追认。"},{"english":"There is a fourth case with subsequently …","chinese":"可追认合同还有第四种情形。"},{"english":"Where the principal does not respond, the non-response shall be deemed a refusal of ratification.","chinese":"被代理人未作表示的，视为拒绝追认。"},{"english":"It shall be regarded as a refusal of ratification that the statutory agent does not make any expression.","chinese":"法定代理人未作表示的，视为拒绝追认。"},{"english":"A subsequent ratification has a retrospective effect, and is equivalent to a prior command.","chinese":"事后的追认具有溯及力，与先前同意具有同等效果。"},{"english":"But this section does not affect the right, without authorization, non-ratification of the forged signatures.","chinese":"但本条并不影响对未经授权但非伪造签名之追认。"},{"english":"A subsequent ratification, which has a retrospective effect, is equivalent to a prior command.","chinese":"事后追认有溯及力，等同先前命令。"}],"related":[{"definition":["to report, requesting approval\/written request for instructions"],"pinyin":["bao4 qing3"],"word":"报请"},{"definition":["to discipline sb\/to punish\/disciplinary action\/to deal with (a matter)\/CL:個|个[ge4]"],"pinyin":["chu3 fen4"],"word":"处分"},{"definition":["to infer\/to consider and come to a judgment\/to recommend\/to estimate\/deduced to be"],"pinyin":["tui1 ding4"],"word":"推定"},{"definition":["to award\/to confer"],"pinyin":["shou4 yu3"],"word":"授予"},{"definition":["to receive"],"pinyin":["shou4 ling3"],"word":"受领"},{"definition":["to rehabilitate\/to regain one's good name"],"pinyin":["hui1 fu4 ming2 yu4"],"word":"恢复名誉"},{"definition":["to repeal\/to revoke\/(computing) to undo"],"pinyin":["che4 xiao1"],"word":"撤销"},{"definition":["to agree\/to consent\/to approve"],"pinyin":["tong2 yi4"],"word":"同意"},{"definition":["testament\/will"],"pinyin":["yi2 zhu3"],"word":"遗嘱"},{"definition":["to reject\/to turn down\/to overrule"],"pinyin":["bo2 hui2"],"word":"驳回"},{"definition":["the beneficiary\/the person who benefits"],"pinyin":["shou4 yi4 ren2"],"word":"受益人"},{"definition":["restitution\/return of something to its original owner\/remittance"],"pinyin":["fan3 huan2"],"word":"返还"},{"definition":["to submit (to superiors)"],"pinyin":["cheng2 qing3"],"word":"呈请"},{"definition":["to conclude (treaty, contract, agreement etc)\/to set up (a rule etc)"],"pinyin":["ding4 li4"],"word":"订立"},{"definition":["to maintain (that sth is true)\/to determine (a fact)\/determination (of an amount)\/of the firm opinion\/to believe firmly\/to set one's mind on\/to identify with"],"pinyin":["ren4 ding4"],"word":"认定"},{"definition":["to bequeath"],"pinyin":["yi2 zeng4"],"word":"遗赠"}]}