{"definition":["to question closely\/to investigate in detail\/to examine minutely\/to get to the heart of the matter"],"pinyin":["zhui1 wen4"],"traditional":["追問"],"rank":7738.0,"normalized_rank":0.10826465938186447,"fraction":0.000012619765842214034,"cumulative_fraction":0.90657806868164,"word":"追问","characters":[{"definition":["to sculpt\/to carve\/musical instrument (old)","to chase after\/to seek\/to do one's utmost to seek or procure sth\/to recall"],"pinyin":["dui1","zhui1"],"word":"追"},{"definition":["to ask"],"pinyin":["wen4"],"word":"问"}],"containing_words":[],"sentences":[{"english":"Examining Wu shows that Lanai is metaphysics.","chinese":"对“无”的追问表明《老子》是形而上学。"},{"english":"“Well, what is disconnection?” Roberts said again.","chinese":"“好吧，‘断开’到底是什么？”罗伯茨再次追问。"},{"english":"Jupiter, to stop questions, replied that it was a fresh creation from the earth.","chinese":"朱庇特唯恐她再追问下去就答说这是大地的新造物。"},{"english":"According to Professor Tu, one should first question: what is religion?","chinese":"杜维明教授表示，这首先需要追问何为宗教？"},{"english":"Zhang mother ask for ten thousand money?","chinese":"张母追问要一万钱干什么？"},{"english":"Through these questions, Mencius put forward the ultimate basis of goodness.","chinese":"通过对善的不断追问，孟子为善建构了形上学的根据。"},{"english":"Therefore, We should not keep asking who on earth is my Mr.","chinese":"所以不要去追问到底谁才是我的Mr。"},{"english":"The second part goes on to question and examine whether this tiger is ever in existence.","chinese":"第二部分追问和考查老虎是否确然存在。"},{"english":"The husband is cross-examined thereupon no longer.","chinese":"老公于是不再追问。"},{"english":"Eu non-success panic ask what happened, but no answer.","chinese":"薇芸惊慌追问发生什么事，却得不到答案。"},{"english":"The king of jin ask what gift.","chinese":"晋王追问是什么大礼。"},{"english":"To clamour to win by questioning with a duel truth, again and to win the competition.","chinese":"至嚣被追问与至嬴决斗的真相，要再与至嬴竞赛。"},{"english":"So, I should not ask who on earth is my Mr.","chinese":"所以不要去追问到底谁才是我的Mr。"},{"english":"Tana met, ask her why she want to marry western watts.","chinese":"塔纳碰到帕莱，追问她为什么要嫁给西瓦。"},{"english":"But allowance must be made for those who, without concluding, continue questioning.","chinese":"我们必须允许那些还没有下结论的人继续追问。"},{"english":"ROBINSON I want to push you one more time on the environment- air.","chinese":"我想再一次追问环境的问题，即空气这个话题。"}],"related":[{"definition":["to question\/to ask\/to raise a question"],"pinyin":["fa1 wen4"],"word":"发问"},{"definition":["to inquire"],"pinyin":["xun2 wen4"],"word":"询问"},{"definition":["to ask (a question) in reply\/to answer a question with a question\/rhetorical question"],"pinyin":["fan3 wen4"],"word":"反问"},{"definition":["to question intensely\/to interrogate\/to demand information"],"pinyin":["bi1 wen4"],"word":"逼问"},{"definition":["to question\/to ask questions\/to inquire\/to bring to account\/to interrogate"],"pinyin":["zhi4 wen4"],"word":"质问"},{"definition":["to ask"],"pinyin":["wen4"],"word":"问"},{"definition":["questioning (a suspect)\/interrogation"],"pinyin":["wen4 hua4"],"word":"问话"},{"definition":["to reply\/to answer\/the answer\/CL:個|个[ge4]"],"pinyin":["hui2 da2"],"word":"回答"},{"definition":["to conceal\/to hide (a taboo subject)\/to cover up the truth"],"pinyin":["yin3 man2"],"word":"隐瞒"},{"definition":["to perform an in-depth investigation"],"pinyin":["shen1 jiu1"],"word":"深究"},{"definition":["to think deeply\/to ponder"],"pinyin":["si1 suo3"],"word":"思索"},{"definition":["lit. to examine roots and inquire at the base (idiom); to get to the bottom of sth"],"pinyin":["zhui1 gen1 wen4 di3"],"word":"追根问底"},{"definition":["to ask about\/to make some inquiries\/to ask around"],"pinyin":["da3 ting5"],"word":"打听"},{"definition":["explanation\/to explain\/to interpret\/to resolve\/CL:個|个[ge4]"],"pinyin":["jie3 shi4"],"word":"解释"},{"definition":["to make insinuations\/to take an indirect approach (in making inquiries) (idiom)"],"pinyin":["pang2 qiao1 ce4 ji1"],"word":"旁敲侧击"},{"definition":["to dig up roots and inquire at the base (idiom); to get to the bottom of sth"],"pinyin":["pao2 gen1 wen4 di3"],"word":"刨根问底"}]}