{"definition":["to produce the opposite of the desired result"],"pinyin":["shi4 de2 qi2 fan3"],"traditional":["適得其反"],"rank":20674.0,"normalized_rank":0.2892560827165503,"fraction":0.0000022292243398085663,"cumulative_fraction":0.9763961594487434,"word":"适得其反","characters":[{"definition":["to fit\/suitable\/proper\/just (now)\/comfortable\/well\/to go\/to follow or pursue","see 李适[Li3 Kuo4]","surname Shi"],"pinyin":["shi4","kuo4","Shi4"],"word":"适"},{"definition":["to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished","structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["contrary\/in reverse\/inside out or upside down\/to reverse\/to return\/to oppose\/opposite\/against\/anti-\/to rebel\/to use analogy\/instead\/abbr. for 反切[fan3 qie4] phonetic system"],"pinyin":["fan3"],"word":"反"}],"containing_words":[],"sentences":[{"english":"But Messrs Kasich and Walker, in particular, seem to have stirred unusually fierce opposition.","chinese":"不过对于卡斯奇和沃克尔两位来说，似乎适得其反。"},{"english":"It's kind of an obsession. That seems unnecessary and counterproductive.'","chinese":"这是一种执迷，看起来没有必要，而且适得其反。"},{"english":"We have to pay for the mistakes, but also to be overkill.","chinese":"我们必须支付的错误，而且会适得其反。"},{"english":"The effort comes just a year after a crackdown on pedophilia backfired.","chinese":"努力仅仅一年后，在打击恋童了适得其反的。"},{"english":"But the heavy hand of the government can be stifling here.","chinese":"但是政府这种大刀阔斧的做法可能会适得其反。"},{"english":"But to not practice, to not get an injury would be counterproductive.","chinese":"但为了躲避伤病而因噎废食的做法只能是适得其反。"},{"english":"Children are life renewing itself, Captain Butler.","chinese":"钱是延长生命的，我的挣法适得其反。"},{"english":"Indeed, half-hearted human-rights diplomacy can backfire nastily.","chinese":"心术不正的人权外交可能适得其反。"},{"english":"I believe that exerting pressure cannot solve the problem but rather may lead to the contrary.","chinese":"我想施压不仅解决不了问题，反而可能会适得其反。"},{"english":"Some, like last year's infamous Buzz, backfired and were scrapped.","chinese":"像去年臭名昭著的巴兹，结果适得其反，最后被销毁。"},{"english":"Canvassing is considered to be bad form and is therefore counter—productive.","chinese":"游说拉票被认为是不好的形式，只会适得其反。"},{"english":"So far, though, Mr Obama's lamentable salesmanship has pushed harder the other way.","chinese":"然仍，知道目前，奥巴马令人惋惜的推销术适得其反。"},{"english":"I think this is almost always counter-productive.","chinese":"不过我觉得这几乎总是适得其反的。"},{"english":"If what you’re saying is not compelling, it could backfire.","chinese":"如果你说的话本身就不具可信性，就只能适得其反了。"},{"english":"It may seem counterproductive to those of you trying to lose weight to eat before a work-out.","chinese":"在工作时如果你努力地想要减肥，可能会适得其反。"},{"english":"The un skilled novice can misuse the principle and get himself fired quite easily.","chinese":"拍得技巧不够可能会适得其反，很容易引火烧身。"}],"related":[{"definition":["to overreach oneself\/to try to be clever and end up with egg on one's face"],"pinyin":["nong4 qiao3 cheng2 zhuo1"],"word":"弄巧成拙"},{"definition":["the gains do not make up for the losses (idiom)"],"pinyin":["de2 bu4 chang2 shi1"],"word":"得不偿失"},{"definition":["too far is as bad as not enough (idiom, from the Analects)"],"pinyin":["guo4 you2 bu4 ji2"],"word":"过犹不及"},{"definition":["opposite reaction"],"pinyin":["fan3 zuo4 yong4"],"word":"反作用"},{"definition":["twice the effort for half the result"],"pinyin":["shi4 bei4 gong1 ban4"],"word":"事倍功半"},{"definition":["harmful and without benefit (idiom); more harm than good"],"pinyin":["you3 hai4 wu2 li4"],"word":"有害无利"},{"definition":["lit. to want sth in haste, but cannot get there (idiom, from Analects); more haste, less speed\/also written 欲速則不達|欲速则不达"],"pinyin":["yu4 su4 er2 bu4 da2"],"word":"欲速而不达"},{"definition":["blindly\/invariably"],"pinyin":["yi1 wei4"],"word":"一味"},{"definition":["lit. to want sth in haste, but cannot get there (idiom, from Analects); more haste, less speed\/don't try to run before you can walk"],"pinyin":["yu4 su4 ze2 bu4 da2"],"word":"欲速则不达"},{"definition":["anxious for quick results (idiom); to demand instant success\/impatient for result\/impetuous"],"pinyin":["ji2 yu2 qiu2 cheng2"],"word":"急于求成"},{"definition":["to spoil things through excessive enthusiasm (idiom)"],"pinyin":["ba2 miao2 zhu4 zhang3"],"word":"拔苗助长"},{"definition":["reverse psychology"],"pinyin":["ni4 fan3 xin1 li3"],"word":"逆反心理"},{"definition":["to act with undue haste (idiom); eager and impatient\/overhasty"],"pinyin":["cao1 zhi1 guo4 ji2"],"word":"操之过急"},{"definition":["to overcorrect (idiom)\/to overcompensate"],"pinyin":["jiao3 wang3 guo4 zheng4"],"word":"矫枉过正"},{"definition":["to neglect the root and pursue the tip (idiom)\/to neglect fundamentals and concentrate on details"],"pinyin":["she3 ben3 zhu2 mo4"],"word":"舍本逐末"},{"definition":["excessive\/over-\/excess\/going too far\/extravagant\/intemperate\/overdue"],"pinyin":["guo4 du4"],"word":"过度"}]}