{"definition":["like rowing a boat upstream, if you stop moving forward you fall back (idiom)"],"pinyin":["ni4 shui3 xing2 zhou1 , bu4 jin4 ze2 tui4"],"traditional":["逆水行舟，不進則退"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"逆水行舟，不进则退","characters":[{"definition":["contrary\/opposite\/backwards\/to go against\/to oppose\/to betray\/to rebel"],"pinyin":["ni4"],"word":"逆"},{"definition":["surname Shui","water\/river\/liquid\/beverage\/additional charges or income\/(of clothes) classifier for number of washes"],"pinyin":["Shui3","shui3"],"word":"水"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"},{"definition":["boat"],"pinyin":["zhou1"],"word":"舟"},{"word":"，"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"进"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"则"},{"definition":["to retreat\/to decline\/to move back\/to withdraw"],"pinyin":["tui4"],"word":"退"}],"containing_words":[{"definition":["study is like rowing upstream – if you don't keep pushing forward, you fall behind"],"pinyin":["xue2 ru2 ni4 shui3 xing2 zhou1 , bu4 jin4 ze2 tui4"],"word":"学如逆水行舟，不进则退"}],"sentences":[],"related":[{"definition":["lit. navigating a boat against the current (idiom)\/fig. in a tough environment (one needs to work hard)"],"pinyin":["ni4 shui3 xing2 zhou1"],"word":"逆水行舟"},{"definition":["stuck and not moving forward (idiom); stagnant\/in a rut\/at a standstill"],"pinyin":["ting2 zhi4 bu4 qian2"],"word":"停滞不前"},{"definition":["time and tide wait for no man (idiom)"],"pinyin":["shi2 bu4 wo3 dai4"],"word":"时不我待"},{"definition":["to be at the highest level of enlightenment (Buddhist expression)"],"pinyin":["bai3 chi3 gan1 tou2"],"word":"百尺竿头"},{"definition":["to try hard to catch up"],"pinyin":["ying2 tou2 gan3 shang4"],"word":"迎头赶上"},{"definition":["lit. the rear waves of the Yangtze River drive on those before (idiom)\/fig. the new is constantly replacing the old\/each new generation excels the previous\/(of things) to be constantly evolving"],"pinyin":["Chang2 Jiang1 hou4 lang4 tui1 qian2 lang4"],"word":"长江后浪推前浪"},{"definition":["to guard against pride and impatience (idiom); to remain modest and keep cool"],"pinyin":["jie4 jiao1 jie4 zao4"],"word":"戒骄戒躁"},{"definition":["no end to learning (idiom); There's always something new to study.\/You live and learn."],"pinyin":["xue2 wu2 zhi3 jing4"],"word":"学无止境"},{"definition":["lit. to want sth in haste, but cannot get there (idiom, from Analects); more haste, less speed\/don't try to run before you can walk"],"pinyin":["yu4 su4 ze2 bu4 da2"],"word":"欲速则不达"},{"definition":["He who gives no thought to far-flung problems soon finds suffering nearby (idiom, from Analects).\/Smug concentration on the here and now will lead to future sorrow."],"pinyin":["ren2 wu2 yuan3 lu:4 , bi4 you3 jin4 you1"],"word":"人无远虑，必有近忧"},{"definition":["to strive for mastery (idiom); aiming for the best result\/to have high ambitions"],"pinyin":["li4 zheng1 shang4 you2"],"word":"力争上游"},{"definition":["lit. as if walking on thin ice (idiom)\/fig. to be extremely cautious\/to be skating on thin ice"],"pinyin":["ru2 lu:3 bo2 bing1"],"word":"如履薄冰"},{"definition":["the river flows thirty years to the East, thirty years to the West (proverb)\/change is the only constant"],"pinyin":["san1 shi2 nian2 he2 dong1 , san1 shi2 nian2 he2 xi1"],"word":"三十年河东，三十年河西"},{"definition":["lit. one day, a thousand miles (idiom); rapid progress"],"pinyin":["yi1 ri4 qian1 li3"],"word":"一日千里"},{"definition":["to mark time (military)\/to make no headway"],"pinyin":["yuan2 di4 ta4 bu4"],"word":"原地踏步"},{"definition":["to seize every minute (idiom)\/to make the best use of one's time"],"pinyin":["zhi3 zheng1 zhao1 xi1"],"word":"只争朝夕"}]}