{"definition":["to go the wrong way\/to go against one-way traffic regulation"],"pinyin":["ni4 xing2"],"traditional":["逆行"],"rank":20439.0,"normalized_rank":0.2859681278244932,"fraction":0.000002285571703777272,"cumulative_fraction":0.9758655176371149,"word":"逆行","characters":[{"definition":["contrary\/opposite\/backwards\/to go against\/to oppose\/to betray\/to rebel"],"pinyin":["ni4"],"word":"逆"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"}],"containing_words":[{"definition":["to go against the tide (idiom); to do things all wrong\/to try to turn back history\/a perverse way of doing things"],"pinyin":["ni4 xing2 dao3 shi1"],"word":"逆行倒施"}],"sentences":[{"english":"Ok, having discussed Mercury retrograde, now let's go on to other things.","chinese":"好了，说完水星逆行，我们现在继续磋议其他的。"},{"english":"Venus rarely goes out of phase, but fortunately, this will only be retrograde for six weeks.","chinese":"金星很少异相，不过幸运的是，这次逆行只有六周。"},{"english":"Mercury is still retrograding so you may run into some delays.","chinese":"但水星仍然在逆行，因此你可能会遭遇延误。"},{"english":"Venus will turn Retrograde in Scorpio, putting a strong focus on sexuality and intimate relationships.","chinese":"金星会在天蝎座逆行转，强烈关注性和亲密关系。"},{"english":"On retrograde pyelography the catheter is curved as\"S\"shape.","chinese":"逆行肾盂造影时输尿管导管弯曲，呈“S”形。"},{"english":"Objective To investigate the repair of forefoot cutaneous defect with retrograde foot vascularized flap.","chinese":"目的探讨足逆行血管蒂皮瓣修复前足皮肤缺损的效果。"},{"english":"When an artist deserts to the side of the angels it is the most odious of treasons.","chinese":"艺术家投合传统派的观点，便是最可恶的叛逆行为。"},{"english":"You may be able to get paid before Mercury retrogrades.","chinese":"这样就可能在水星逆行之前要回欠债。"},{"english":"Thankfully, Venus only retrogrades for a few weeks every two years.","chinese":"幸运的是，几个星期只每两年金星逆行。"},{"english":"You never want to schedule anything too close to the day a planet turns retrograde or even on the days when it turns direct.","chinese":"你千万不要在一个行星正行或逆行的那天做什么计划。"},{"english":"Prograde orbits are more vulnerable than retrograde ones.","chinese":"因此顺行的轨道会比逆行轨道更加脆弱。"},{"english":"Objective To introduce a novel suturing method in valve replacement.","chinese":"目的介绍一种心脏瓣膜手术的逆行缝合方法。"},{"english":"Bile duct stones can be diagnosed and removed with an ERCP.","chinese":"内镜逆行胰胆管造影可以诊断并清除胆管结石。"},{"english":"Objective To investigate results of the treatment of distal femoral fracture with retrograde interlocking intramedullary nail.","chinese":"目的评价逆行交锁髓内钉治疗股骨远端骨折的疗效。"},{"english":"Wait for Mercury to stop retrograding.","chinese":"停止等待水星逆行。"},{"english":"Ah, it's part of the Mercury retrograde process.","chinese":"啊，这是水星逆行的一部份影响。"}],"related":[{"definition":["circular motion in the same sense as the sun\/clockwise"],"pinyin":["shun4 xing2"],"word":"顺行"},{"definition":["to run a red light\/failing to stop at a red traffic light\/(slang) to have sex with a girl while she is menstruating"],"pinyin":["chuang3 hong2 deng1"],"word":"闯红灯"},{"definition":["to exceed the speed limit\/to speed\/high-speed"],"pinyin":["chao1 su4"],"word":"超速"},{"definition":["backwards\/reverse direction"],"pinyin":["ni4 xiang4"],"word":"逆向"},{"definition":["to pass by\/menstruation"],"pinyin":["xing2 jing1"],"word":"行经"},{"definition":["to change lanes"],"pinyin":["bian4 dao4"],"word":"变道"},{"definition":["to go straight\/straight forward\/fig. to do right"],"pinyin":["zhi2 xing2"],"word":"直行"},{"definition":["to turn\/to go around a corner"],"pinyin":["zhuan3 wan1"],"word":"转弯"},{"definition":["one-way road"],"pinyin":["dan1 xing2 xian4"],"word":"单行线"},{"definition":["to avoid\/to yield (in traffic)\/to get out of the way"],"pinyin":["bi4 rang4"],"word":"避让"},{"definition":["traffic police\/abbr. for 交通警察"],"pinyin":["jiao1 jing3"],"word":"交警"},{"definition":["to change buses, trains etc","to reverse (a vehicle)\/to drive backwards"],"pinyin":["dao3 che1","dao4 che1"],"word":"倒车"},{"definition":["to cross (a street)"],"pinyin":["chuan1 ma3 lu4"],"word":"穿马路"},{"definition":["to travel along a route (of vehicles etc)"],"pinyin":["xing2 shi3"],"word":"行驶"},{"definition":["to break the rules\/to violate regulations"],"pinyin":["wei2 zhang1"],"word":"违章"},{"definition":["to turn one's head\/to turn round\/to turn about"],"pinyin":["diao4 tou2"],"word":"掉头"}]}