{"definition":["to select the best"],"pinyin":["xuan3 ba2"],"traditional":["選拔"],"rank":3647.0,"normalized_rank":0.05102626166524422,"fraction":0.00003718619468918174,"cumulative_fraction":0.8182194993733678,"word":"选拔","characters":[{"definition":["to choose\/to pick\/to select\/to elect"],"pinyin":["xuan3"],"word":"选"},{"definition":["to pull up\/to pull out\/to draw out by suction\/to select\/to pick\/to stand out (above level)\/to surpass\/to seize"],"pinyin":["ba2"],"word":"拔"}],"containing_words":[],"sentences":[{"english":"But Mr Shu says surprises like the one for Ms Zhang are good tests of bureaucratic talent.","chinese":"但小张认为这种测试是选拔做官人才的良好方式。"},{"english":"They qualified for the qualifying tourney by their finish in last year's regional tournaments.","chinese":"他们通过去年的地区选拔赛获得了落选锦标赛的资格。"},{"english":"Meanwhile selects the male nurse for the hospital to provide the theoretically basis.","chinese":"同时为医院选拔男护士提供理论上的参考。"},{"english":"It is also the quickest and the most effi way to choose the top students.","chinese":"考试也是选拔好学生唯一的办法。"},{"english":"How and when will I know if I have passed through the audition?","chinese":"我要如何知道我已通过选拔赛？"},{"english":"The state lays special stress on training and promoting women cadres.","chinese":"国家重视培养和选拔妇女干部。"},{"english":"Did you get a place in the ballot?","chinese":"你在这场选拔中是否占有占有一席之位？"},{"english":"How to Keep Fit A healthy body is very important to every one of us.","chinese":"招警考试是公务员选拔体系中非常特殊的一类考试。"},{"english":"Of course, the cadres we select should also include those who are around 50.","chinese":"当然，选拔干部也要包括五十岁内外的。"},{"english":"A trial game was arranged between possibles and probables.","chinese":"在可能入选和希望较大选手之间安排了一场选拔赛。"},{"english":"She is selected by the number one pick.","chinese":"她在队员选拔时以第一位被选上。"},{"english":"These teams are going to try out for the Olympic Games.","chinese":"这些队伍要参加奥林匹克运动会的选拔赛。"},{"english":"NVIDIA World Cup for E-sports contest , the grand FITA round will be adopted.","chinese":"NVIDIA世界杯电子竞技大赛，选拔赛是淘汰制。"},{"english":"Moral assessment is difficult to carry out in the process of selecting the Party and Government cadres in China.","chinese":"品德测评是我国党政干部选拔中的难点问题。"},{"english":"Jack gave the tryouts the business but he failed to make the team.","chinese":"杰克在选拔赛中全力以赴，但他没有被选进代表队。"},{"english":"Nor will there be any change to the eligibility standards for military benefits.","chinese":"以及关乎部队利益的选拔合格标准也不会改变。"}],"related":[{"definition":["direct, winner-takes-all system of election in use for village committees\/preselection for a competition"],"pinyin":["hai3 xuan3"],"word":"海选"},{"definition":["to pick\/to choose\/to select"],"pinyin":["lin2 xuan3"],"word":"遴选"},{"definition":["to recruit\/to enlist"],"pinyin":["zhao1 mu4"],"word":"招募"},{"definition":["preliminary contest\/initial heats of a competition"],"pinyin":["chu1 sai4"],"word":"初赛"},{"definition":["to examine\/to check up on\/to assess\/to review\/appraisal\/review\/evaluation"],"pinyin":["kao3 he2"],"word":"考核"},{"definition":["to select\/to detail\/to set apart\/to appoint"],"pinyin":["xuan3 pai4"],"word":"选派"},{"definition":["to select\/to pick"],"pinyin":["zhen1 xuan3"],"word":"甄选"},{"definition":["winning\/superior"],"pinyin":["you1 sheng4"],"word":"优胜"},{"definition":["to hire\/to recruit"],"pinyin":["zhao1 shou1"],"word":"招收"},{"definition":["(sports) semifinal or quarterfinal\/to compete in a semifinal (or a quarterfinal)"],"pinyin":["fu4 sai4"],"word":"复赛"},{"definition":["to cultivate\/to breed\/to foster\/to nurture\/to educate\/to groom (for a position)\/education\/fostering\/culture (biology)"],"pinyin":["pei2 yang3"],"word":"培养"},{"definition":["race\/competition\/CL:個|个[ge4]"],"pinyin":["jing4 sai4"],"word":"竞赛"},{"definition":["to compete\/to take part in a competition"],"pinyin":["can1 sai4"],"word":"参赛"},{"definition":["to select sb for a position without announcing the decision until later\/to decide behind closed doors\/all cut and dried"],"pinyin":["nei4 ding4"],"word":"内定"},{"definition":["cream\/elite\/essence\/quintessence"],"pinyin":["jing1 ying1"],"word":"精英"},{"definition":["evaluation\/to investigate and evaluate"],"pinyin":["kao3 ping2"],"word":"考评"}]}