{"definition":["progressively\/step by step"],"pinyin":["zhu2 bu4"],"traditional":["逐步"],"rank":1332.0,"normalized_rank":0.01863640815412813,"fraction":0.00012098465138927388,"cumulative_fraction":0.6660932926783474,"word":"逐步","characters":[{"definition":["to pursue\/to chase\/individually\/one by one"],"pinyin":["zhu2"],"word":"逐"},{"definition":["surname Bu","a step\/a pace\/walk\/march\/stages in a process\/situation"],"pinyin":["Bu4","bu4"],"word":"步"}],"containing_words":[{"definition":["escalation"],"pinyin":["zhu2 bu4 sheng1 ji2"],"word":"逐步升级"}],"sentences":[{"english":"This requirement will gradually expand to include smaller public companies in the future.","chinese":"这一要求将在未来逐步扩展到包含更小的国有公司。"},{"english":"The state prohibits the damage to farm land for brick-making, and gradually bans the production and use of solid clay brick.","chinese":"国家禁止毁田烧砖，逐步禁止生产和使用实心粘土砖。"},{"english":"Gradually push forward the controls over the total amount and quota management of agricultural water consumption.","chinese":"逐步推行农业用水总量控制与定额管理。"},{"english":"He's getting along hand over hand; he'll soon be convalescent.","chinese":"他的情况逐步有了起色，不久就会康复的。"},{"english":"The early adopters and trend setters are moving away.","chinese":"早期的采用者和趋势制定者正在逐步流失。"},{"english":"Taking time out from their heartbreak, they get back to nature.","chinese":"逐步从心碎的爱情中走出来后，他们复归自然。"},{"english":"But after that period, the tea economy is in the recession.","chinese":"但自唐中后期以后，茶业经济逐步呈现出衰退趋势。"},{"english":"Aid to living according to our capability, step-by-step, and gradually increase.","chinese":"生活救助要量力而行，循序渐进，逐步提高。"},{"english":"The plan to phase down environmental pollution is progressing successfully.","chinese":"逐步减少环境污染的计划正在顺利进行。"},{"english":"However, it can be incrementally applied.","chinese":"不过，它可以逐步应用。"},{"english":"Lianyungang has gradually become the research base of the continental bridge economy throughout the country.","chinese":"连云港市已经逐步成为全国的陆桥经济研究基地。"},{"english":"For major reforms, we will first experiment with projects and gradually expand to other areas only after gaining useful experience.","chinese":"重大改革措施坚持先行试点，取得经验后再逐步推开。"},{"english":"He presented with complaints of quadriparesis that had progressed over the course of 2 years.","chinese":"患者出现四肢轻瘫，在两年病程中逐步加剧。"},{"english":"Conclusion Network reporting system in Quzhou City is gradually improving and operating well overall.","chinese":"结论衢州市网络直报工作逐步完善，总体运行良好。"},{"english":"Next, I build a state machine, step by step.","chinese":"接下来，我将逐步构建一个状态机。"},{"english":"The papers of ideological trend about modern literature are increasing now.","chinese":"目前在现代文学方面研究文学思潮的文章逐步增多。"}],"related":[{"definition":["gradually"],"pinyin":["zhu2 jian4"],"word":"逐渐"},{"definition":["to tend towards"],"pinyin":["qu1 yu2"],"word":"趋于"},{"definition":["steadily\/a steady pace"],"pinyin":["wen3 bu4"],"word":"稳步"},{"definition":["along with\/in the wake of\/following"],"pinyin":["sui2 zhe5"],"word":"随着"},{"definition":["a big margin\/substantially"],"pinyin":["da4 fu2"],"word":"大幅"},{"definition":["to slow down\/to ease up\/to abate\/slowdown\/downturn"],"pinyin":["qu1 huan3"],"word":"趋缓"},{"definition":["direction\/trend\/to incline"],"pinyin":["qu1 xiang4"],"word":"趋向"},{"definition":["day by day\/more and more\/increasingly\/more and more with each passing day"],"pinyin":["ri4 yi4"],"word":"日益"},{"definition":["one step further\/to move forward a step\/further onwards"],"pinyin":["jin4 yi1 bu4"],"word":"进一步"},{"definition":["to increase gradually\/to build up"],"pinyin":["zhu2 jian4 zeng1 jia1"],"word":"逐渐增加"},{"definition":["(increasing) day by day\/(more critical) with every passing day\/gradually"],"pinyin":["ri4 qu1"],"word":"日趋"},{"definition":["to increase (e.g. one's effort)"],"pinyin":["jia1 da4"],"word":"加大"},{"definition":["to progress (or increase, change etc) day by day\/more (or better etc) with each passing day"],"pinyin":["ri4 jian4"],"word":"日渐"},{"definition":["to become more and more\/to gradually become"],"pinyin":["jian4 qu1"],"word":"渐趋"},{"definition":["thereupon\/subsequently\/accordingly"],"pinyin":["sui2 zhi1"],"word":"随之"},{"definition":["specific to a particular stage (of a project etc)\/interim (policy etc)\/occurring in stages\/phased"],"pinyin":["jie1 duan4 xing4"],"word":"阶段性"}]}