{"definition":["gradual progress\/to go forward one stage at a time"],"pinyin":["di4 jin4"],"traditional":["遞進"],"rank":31098.0,"normalized_rank":0.4351013669497573,"fraction":8.549909605303367e-7,"cumulative_fraction":0.9912277911392064,"word":"递进","characters":[{"definition":["to hand over\/to pass on sth\/to gradually increase or decrease\/progressively"],"pinyin":["di4"],"word":"递"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"进"}],"containing_words":[],"sentences":[{"english":"The paper is made up by four parts which gradually and deep-going introduce consumer credit laws.","chinese":"论文分四个部分逐步深入递进的介绍消费者信用法。"},{"english":"Uses in the analysis from the surface to the spot, is thorough by the level, layer upon layer progressives principle.","chinese":"分析采用了由面到点，逐层深入，层层递进的原则。"},{"english":"Traditions and modernism boost each other and the structure of art will remain its Multi-Format.","chinese":"传统与现代是互动递进的，艺术格局总是多元化的。"},{"english":"The context body is the analysis of climactic relation using eulerian graph.","chinese":"本文的主体部分是对递进关系进行欧拉图分析。"},{"english":"These are the new results in age structure parity progressive population operator.","chinese":"这些都是年龄结构人口胎次递进算子新的结果。"},{"english":"In addition to meaning \"otherwise\", \"yaoburan\" can also be used to give a suggestion.","chinese":"表示递进关系，通常用于给别人提建议的时候。"},{"english":"This paper adopts the structure of advance by degrees, including five parts altogether.","chinese":"本文采用递进式结构，共分五部分。"}],"related":[{"definition":["to ascend progressively"],"pinyin":["di4 sheng1"],"word":"递升"},{"definition":["to arrange\/to spread out\/to narrate in detail\/to describe at great length\/to elaborate"],"pinyin":["pu1 chen2"],"word":"铺陈"},{"definition":["closely linked with one another\/interlocked\/to interrelate"],"pinyin":["huan2 huan2 xiang1 kou4"],"word":"环环相扣"},{"definition":["in sequence, step by step (idiom); to make steady progress incrementally"],"pinyin":["xun2 xu4 jian4 jin4"],"word":"循序渐进"},{"definition":["to link up (disparate elements)\/coherent (narrative, argument etc)"],"pinyin":["lian2 guan4"],"word":"连贯"},{"definition":["to cross over (by ferry)\/transition\/interim\/caretaker (administration)"],"pinyin":["guo4 du4"],"word":"过渡"},{"definition":["progressively decreasing\/gradually falling\/in descending order"],"pinyin":["di4 jian3"],"word":"递减"},{"definition":["level\/hierarchy"],"pinyin":["ceng2 ji2"],"word":"层级"},{"definition":["progress step by step\/gradual progress\/to move forward (slowly)"],"pinyin":["jian4 jin4"],"word":"渐进"},{"definition":["gradually\/one after another\/little by little"],"pinyin":["zhu2 ci4"],"word":"逐次"},{"definition":["to extend\/to stretch out\/ductable\/to scale\/scalable"],"pinyin":["yan2 zhan3"],"word":"延展"},{"definition":["to increase by degrees\/in increasing order\/incremental\/progressive"],"pinyin":["di4 zeng1"],"word":"递增"},{"definition":["chronological narrative"],"pinyin":["shun4 xu4"],"word":"顺叙"},{"definition":["sequence\/order"],"pinyin":["shun4 xu4"],"word":"顺序"},{"definition":["to flash back\/flashback (in a novel, movie etc)"],"pinyin":["dao4 xu4"],"word":"倒叙"},{"definition":["top-down"],"pinyin":["zi4 shang4 er2 xia4"],"word":"自上而下"}]}