{"definition":["unobstructed\/clear"],"pinyin":["tong1 chang4"],"traditional":["通暢"],"rank":15414.0,"normalized_rank":0.2156618583241224,"fraction":0.000003952928157794261,"cumulative_fraction":0.9607089366837328,"word":"通畅","characters":[{"definition":["to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc","classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)"],"pinyin":["tong1","tong4"],"word":"通"},{"definition":["free\/unimpeded\/smooth\/at ease\/free from worry\/fluent"],"pinyin":["chang4"],"word":"畅"}],"containing_words":[],"sentences":[{"english":"Eat fat food less, no-noSmokeWine, answer to often maintain defecate unobstructed .","chinese":"少吃油腻食物，禁忌烟酒，并应经常保持大便通畅。"},{"english":"The little-known Elwha River in Washington State is set to be free flowing within 3 years.","chinese":"华盛顿州鲜为人知的尔瓦河将在三年之后通畅无阻。"},{"english":"The bloodflow in the graft was patent without abnormal peripheral circulation.","chinese":"移植物内血流通畅，周围无异常血流。"},{"english":"They supported the communics of the Allied Forces.","chinese":"这些卫星保证了多国部队的通讯通畅无阻。"},{"english":"The explanation of Qin Luofui identity as corpse daughter make the whole poem understood unobstructodly and reasonably.","chinese":"罗敷作为尸女身份，用来解读全诗也是通畅的。"},{"english":"The patency of the eustachian tube is compromised.","chinese":"咽鼓管的通畅被损害。"},{"english":"They were to protect the sides of the main landing area, and close off the beaches.","chinese":"他们的任务是保护主登陆场的通道通畅，并封锁海滩。"},{"english":"May adjust the endocrine disorders, will maintain the bowel movement unobstructed will reduce the mammary gland painfully swollen.","chinese":"可调节内分泌失调，保持大便通畅会减轻乳腺胀痛。"},{"english":"All patients had got normal voiding after removal of catheter 6 days postoperatively.","chinese":"术后平均6天拔管，自行排尿通畅。"},{"english":"Connect the water pump, make sure that the water flow is smooth without leakage.","chinese":"接通水泵，确保水流通畅，并无渗漏现象。"},{"english":"Clear river transport plays an important role in the municipal development.","chinese":"河运通畅是城市发展的重要因素。"},{"english":"It will unblock a stuffy nose and can help alleviate asthma and hay fever.","chinese":"它能够通畅鼻塞，并能帮助缓解哮喘和花粉症。"},{"english":"Helps balance histamine release and clears stuffy noses in three days or less.","chinese":"有助于平衡组胺释放，三天或三天内时噢你鼻腔通畅。"},{"english":"Writing that does not sound right will not read right.","chinese":"念出来不流畅的文章读起来也不会通畅。"},{"english":"In addition, you give children pacifiers check whether patency .","chinese":"另外，你要给孩子检查一下奶嘴，是否通畅。"},{"english":"All aneurysms were not visualized and all bypasses remained patent in postoperative angiograms.","chinese":"术后脑血管造影证实吻合口通畅，动脉瘤未见显影。"}],"related":[{"definition":["unimpeded\/free-flowing\/straight path\/unclogged\/move without obstruction"],"pinyin":["chang4 tong1"],"word":"畅通"},{"definition":["smooth and unhindered\/fluent"],"pinyin":["shun4 chang4"],"word":"顺畅"},{"definition":["to unblock\/to dredge\/to clear the way\/to get things flowing\/to facilitate\/to mediate\/to lobby\/to explicate (a text)"],"pinyin":["shu1 tong1"],"word":"疏通"},{"definition":["to clog up\/blockage"],"pinyin":["du3 se4"],"word":"堵塞"},{"definition":["to block\/to clog"],"pinyin":["zu3 se4"],"word":"阻塞"},{"definition":["free-flowing\/smooth"],"pinyin":["chang4 da2"],"word":"畅达"},{"definition":["smooth\/clear and coherent"],"pinyin":["tong1 shun4"],"word":"通顺"},{"definition":["silted up\/obstructed by silt\/variant of 瘀滯|瘀滞[yu1 zhi4]"],"pinyin":["yu1 zhi4"],"word":"淤滞"},{"definition":["to understand clearly\/to be sensible or reasonable\/understanding"],"pinyin":["tong1 da2"],"word":"通达"},{"definition":["to open access\/to establish contact\/to remove a block\/to put through (a phone connection)"],"pinyin":["da3 tong1"],"word":"打通"},{"definition":["to link up\/to thread together"],"pinyin":["guan4 tong1"],"word":"贯通"},{"definition":["choked with silt\/silted up"],"pinyin":["yu1 se4"],"word":"淤塞"},{"definition":["ventilation\/aeration\/to keep each other informed\/to release information"],"pinyin":["tong1 qi4"],"word":"通气"},{"definition":["energy channels\/meridian (TCM)\/(dialect) trick\/tactic"],"pinyin":["jing1 luo4"],"word":"经络"},{"definition":["blood circulation"],"pinyin":["xue4 ye4 xun2 huan2"],"word":"血液循环"},{"definition":["to donate blood"],"pinyin":["gong1 xue4"],"word":"供血"}]}