{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"traditional":["通過"],"rank":113.0,"normalized_rank":0.0015810166076700293,"fraction":0.0009645503809980078,"cumulative_fraction":0.3284153121957021,"word":"通过","characters":[{"definition":["to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc","classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)"],"pinyin":["tong1","tong4"],"word":"通"},{"definition":["surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-","(experienced action marker)"],"pinyin":["Guo4","guo4","guo5"],"word":"过"}],"containing_words":[{"definition":["off-line"],"pinyin":["tong1 guo4 shi4 hou4"],"word":"通过事后"}],"sentences":[{"english":"Encourage her release by constructing an erotic fantasy before things heat up.","chinese":"应当在高潮激发前鼓励她通过性幻想放松自己。"},{"english":"Perhaps he earned the money through ill means.","chinese":"或许他的钱是通过卑劣的手段挣来的。"},{"english":"The script could be improved by displaying the picks in a Keno-style board.","chinese":"可以通过在基诺样式板中显示选择结果来改进脚本。"},{"english":"Fourth, solve problems through consultation on an equal footing, instead of imposing restriction at will.","chinese":"通过平等协商解决问题，不要动辄设限和制裁。"},{"english":"These are usually associated with a major publisher and a strong brand.","chinese":"他们通过与一个大型的发行商和很强的品牌相关联。"},{"english":"The tolls, which include a government passage tax, varied from $4 to $30 per vehicle.","chinese":"隧道收费连政府通过税，每程由4元至30元不等。"},{"english":"A spectrum is then obtained and telemetered to the ground.","chinese":"然后记录它的光谱，并将数据通过遥测系统发回地面。"},{"english":"By means of high - temperature curing, the curing period of lime - fly ash stabilized bound macadam is shortened.","chinese":"通过高温养生手段缩短二灰稳定碎石的养生龄期。"},{"english":"Has passed 3C certification.","chinese":"目前已经通过3C认证。"},{"english":"With special renovation, Beijing will again take on the scene it once had, complete with its historical rivers and classical gardens.","chinese":"通过专项整治，再现京城水系和古典园林的历史风貌。"},{"english":"Through the trial, was initially arrested the two men and Lim Yang.","chinese":"通过审讯，最初被抓获的两男子为任某和杨某。"},{"english":"The copolymer was wet spun to get flame-retardant fiber.","chinese":"将共聚物通过湿法纺丝，得到了阻燃纤维。"},{"english":"The secondary screens receive the coal from the crushers and remove the fines.","chinese":"经压碎后的煤通过第二道筛，筛出细粉。"},{"english":"Larger vessels are not allowed.","chinese":"不允许更大的船通过。"},{"english":"Most global transactions are carried out by a letter of credit (LC).","chinese":"大多数全球交易都是通过信用证白勺方式完成。"},{"english":"He and his family will also be getting food from the charity.","chinese":"他和他的家人也将通过慈善组织获得食物。"}],"related":[{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"进行"},{"definition":["to draw support from\/with the help of"],"pinyin":["jie4 zhu4"],"word":"借助"},{"definition":["way\/manner\/style\/mode\/pattern\/CL:個|个[ge4]"],"pinyin":["fang1 shi4"],"word":"方式"},{"definition":["to exploit\/to make use of\/to use\/to take advantage of\/to utilize"],"pinyin":["li4 yong4"],"word":"利用"},{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge","to combine\/to amalgamate","variant of 並|并[bing4]"],"pinyin":["bing4","bing4","bing4"],"word":"并"},{"definition":["with this\/thereby\/thus\/because of this"],"pinyin":["yi3 ci3"],"word":"以此"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"从而"},{"definition":["to achieve\/to implement\/to realize\/to bring about"],"pinyin":["shi2 xian4"],"word":"实现"},{"definition":["outer appearance\/form\/shape\/formality\/CL:個|个[ge4]"],"pinyin":["xing2 shi4"],"word":"形式"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同时"},{"definition":["as well as\/too\/and"],"pinyin":["yi3 ji2"],"word":"以及"},{"definition":["see 的士[di1 shi4]","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","aim\/clear","really and truly"],"pinyin":["di1","de5","di4","di2"],"word":"的"},{"definition":["to pass\/to go through\/process\/course\/CL:個|个[ge4]"],"pinyin":["jing1 guo4"],"word":"经过"},{"definition":["and then (what follows next)"],"pinyin":["jin4 er2"],"word":"进而"},{"definition":["method\/means (of doing sth)\/strategy\/trick\/CL:個|个[ge4]"],"pinyin":["shou3 duan4"],"word":"手段"}]}