{"definition":["flexible\/to accommodate\/to stretch or get around regulations\/a short-term loan"],"pinyin":["tong1 rong2"],"traditional":["通融"],"rank":38612.0,"normalized_rank":0.5402319757111077,"fraction":4.382248358395204e-7,"cumulative_fraction":0.995918889034037,"word":"通融","characters":[{"definition":["to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc","classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)"],"pinyin":["tong1","tong4"],"word":"通"},{"definition":["to melt\/to thaw\/to blend\/to merge\/to be in harmony","old variant of 融[rong2]"],"pinyin":["rong2","rong2"],"word":"融"}],"containing_words":[],"sentences":[{"english":"Be understanding if you or your loved one is upset.","chinese":"你或者你的挚爱焦躁时，要学着理解通融。"},{"english":"I accorded it, deeming that i did well in showing pliability on the point .","chinese":"我同意了，认为自己在这一点上表示通融是做得对的。"},{"english":"We are sorry to say that we can't accommodate you with D\/P payment terms.","chinese":"我方很遗憾地说，无法通融付款交单的支付条件。"},{"english":"We extend you this accommodation in view of our friendly relations.","chinese":"鉴于我们的友好关系，我们特作此项通融。"},{"english":"And of course, you need a hospital administration that is accommodating, \" she said.","chinese":"当然你也需要医院行政部门的通融，”她说道。"},{"english":"As much as we would like to accommodate you, Miss Roffe.","chinese":"我们是尽可能地通融迁就你的。"},{"english":"The so-called \"accommodation\" is the money for the director acquiescence .","chinese":"所谓的“通融”就是用金钱换取房产商的默许。"}],"related":[{"definition":["open the net on one side (idiom); let the caged bird fly\/to give one's opponent a way out\/lenient treatment"],"pinyin":["wang3 kai1 yi1 mian4"],"word":"网开一面"},{"definition":["to extend (a deadline etc)"],"pinyin":["kuan1 xian4"],"word":"宽限"},{"definition":["to intercede\/to plead for sb else"],"pinyin":["shuo1 qing2"],"word":"说情"},{"definition":["to let (sb) off\/to let (sb) get away with sth"],"pinyin":["fang4 yi1 ma3"],"word":"放一马"},{"definition":["to give a favor (used of Christian God)"],"pinyin":["kai1 en1"],"word":"开恩"},{"definition":["to be generous (idiom)\/to be magnanimous\/Give me a break!"],"pinyin":["gao1 tai2 gui4 shou3"],"word":"高抬贵手"},{"definition":["to introduce (sb)\/(esp.) to present to the emperor"],"pinyin":["yin3 jian4"],"word":"引见"},{"definition":["to ask for instructions"],"pinyin":["qing3 shi4"],"word":"请示"},{"definition":["to beg\/to beseech\/to entreat\/entreaty"],"pinyin":["ken3 qiu2"],"word":"恳求"},{"definition":["to do things in a strictly businesslike manner (idiom)"],"pinyin":["gong1 shi4 gong1 ban4"],"word":"公事公办"},{"definition":["to plea for leniency\/to ask for a favor"],"pinyin":["qiu2 qing2"],"word":"求情"},{"definition":["to feel embarrassed or awkward\/to make things difficult (for someone)\/to find things difficult (to do or manage)"],"pinyin":["wei2 nan2"],"word":"为难"},{"definition":["excuse me"],"pinyin":["lao2 jia4"],"word":"劳驾"},{"definition":["conducting business impartially (idiom); to act justly"],"pinyin":["bing3 gong1 ban4 li3"],"word":"秉公办理"},{"definition":["to inconvenience\/to trouble (sb with a request)"],"pinyin":["lao2 fan2"],"word":"劳烦"},{"definition":["to put sb to trouble (of doing sth)\/vexation\/inconvenience"],"pinyin":["fan2 lao2"],"word":"烦劳"}]}