{"definition":["to bring about\/to create\/to cause"],"pinyin":["zao4 cheng2"],"traditional":["造成"],"rank":395.0,"normalized_rank":0.005526562478138598,"fraction":0.0003550838623708144,"cumulative_fraction":0.4793178131149585,"word":"造成","characters":[{"definition":["to make\/to build\/to manufacture\/to invent\/to fabricate\/to go to\/party (in a lawsuit or legal agreement)\/crop\/classifier for crops"],"pinyin":["zao4"],"word":"造"},{"definition":["to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth","surname Cheng"],"pinyin":["cheng2","Cheng2"],"word":"成"}],"containing_words":[{"definition":["to create an issue\/to cause a problem"],"pinyin":["zao4 cheng2 wen4 ti2"],"word":"造成问题"}],"sentences":[{"english":"Is it true that lack of iodine really causes brain damage?","chinese":"缺碘是否真的会造成脑损伤？"},{"english":"Not enough cooling power could mean heatstroke or dehydration.","chinese":"冷却能力不足会造成中暑脱水。"},{"english":"In other words, it wreaks havoc on our memory.","chinese":"换句话说，它对我们的记忆力造成了严重的破坏。"},{"english":"This new technology is sure to make waves in the cellular phone.","chinese":"最新的科技一定会在手机的领域中造成哄动。"},{"english":"CCS will not be liable for any loss due to any error of the applicant or any other person.","chinese":"本社对因申请方或他人的过错造成的损失不负责。"},{"english":"If it is caused by anaemia you might have to start taking iron tablets.","chinese":"如果是所造成的贫血，你也可能开始采取铁片。"},{"english":"Heavy rainfall has caused water levels of the Liujiang River to rise. (ChinaFotoPress\/Getty Images)","chinese":"强降雨已造成了柳江的水位上升。"},{"english":"But formaldehyde is virulent, that must do a great harm to the persons.","chinese":"因为甲醛有剧毒，会对人体造成很大的伤害。"},{"english":"The mistake is caused by the situation today, Sheng Maolin too late to regret.","chinese":"当年的误以为是造成了今天的局面，盛茂林追悔莫及。"},{"english":"The global recession has hit Kumi's hometown hard.","chinese":"全球的经济衰退给木村的家乡造成了很大的冲击。"},{"english":"Use of expired drugs can be dangerous for patients' health.","chinese":"使用过期药物可能对病人的健康造成危害。"},{"english":"The anomalies of the political system have contributed to the governance crisis since the handover.","chinese":"畸型的政治制度造成回归后的管治危机。"},{"english":"This sequence of function calls shows you the path to the crash.","chinese":"这个函数调用序列显示了造成崩溃的代码路径。"},{"english":"Repeated hitting raised a large bruise.","chinese":"反复击打造成一大块青肿。"},{"english":"However, Inte can make some problems at the same time.","chinese":"然而，网络同时也会造成一些问题。"},{"english":"Dr Sivak said this might be due to height difference between the sexes.","chinese":"西瓦克博士说，这可能是由男女身高的差异造成的。"}],"related":[{"definition":["to lead to\/to create\/to cause\/to bring about"],"pinyin":["dao3 zhi4"],"word":"导致"},{"definition":["to cause\/to result in"],"pinyin":["zhi4 shi3"],"word":"致使"},{"definition":["to arise\/to come into being\/to come about\/to give rise to\/to bring into being\/to bring about\/to produce\/to engender\/to generate\/to appear\/appearance\/emergence\/generation\/production\/yield"],"pinyin":["chan3 sheng1"],"word":"产生"},{"definition":["grave\/serious\/severe\/critical"],"pinyin":["yan2 zhong4"],"word":"严重"},{"definition":["to lead to\/to trigger\/to initiate\/to cause\/to evoke (emotions)"],"pinyin":["yin3 fa1"],"word":"引发"},{"definition":["influence\/effect\/to influence\/to affect (usually adversely)\/to disturb\/CL:股[gu3]"],"pinyin":["ying3 xiang3"],"word":"影响"},{"definition":["to give rise to\/to lead to\/to cause\/to arouse"],"pinyin":["yin3 qi3"],"word":"引起"},{"definition":["harm\/to damage\/to impair"],"pinyin":["sun3 hai4"],"word":"损害"},{"definition":["destruction\/damage\/to wreck\/to break\/to destroy"],"pinyin":["po4 huai4"],"word":"破坏"},{"definition":["to intensify\/to sharpen\/to accelerate\/to aggravate\/to exacerbate\/to embitter"],"pinyin":["jia1 ju4"],"word":"加剧"},{"definition":["consequences\/aftermath"],"pinyin":["hou4 guo3"],"word":"后果"},{"definition":["to avert\/to prevent\/to avoid\/to refrain from"],"pinyin":["bi4 mian3"],"word":"避免"},{"definition":["to induce\/to cause\/to elicit\/to trigger"],"pinyin":["you4 fa1"],"word":"诱发"},{"definition":["due to\/as a result of\/thanks to\/owing to\/since\/because"],"pinyin":["you2 yu2"],"word":"由于"},{"definition":["to harm\/to damage\/to injure\/impairment\/loss\/disability"],"pinyin":["sun3 shang1"],"word":"损伤"},{"definition":["to lessen\/to decrease\/to reduce\/to lower"],"pinyin":["jian3 shao3"],"word":"减少"}]}