{"definition":["to build up public opinion\/to create a fuss"],"pinyin":["zao4 yu2 lun4"],"traditional":["造輿論"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"造舆论","characters":[{"definition":["to make\/to build\/to manufacture\/to invent\/to fabricate\/to go to\/party (in a lawsuit or legal agreement)\/crop\/classifier for crops"],"pinyin":["zao4"],"word":"造"},{"definition":["carriage\/sedan chair\/world"],"pinyin":["yu2"],"word":"舆"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"论"}],"containing_words":[],"sentences":[{"english":"but at the same time it was really just a buildup in my mind.","chinese":"但是同时我觉得这只是制造舆论。"},{"english":"The gig was given a big buildup on both press and TV.","chinese":"爵士演唱会被报刊和电视大造舆论。"},{"english":"Uruguayan football has never failed to generate opinion over the years.","chinese":"乌拉圭足球这些年来并没有少制造舆论。"},{"english":"It was just a buildup of consumer expectations, you know, people were expecting more","chinese":"就是给消费者预期制造舆论，人们期望更多。"}],"related":[{"definition":["to agitate for\/to enthusiastically promote"],"pinyin":["gu3 chui1"],"word":"鼓吹"},{"definition":["to start rumours and create trouble"],"pinyin":["zao4 yao2 sheng1 shi4"],"word":"造谣生事"},{"definition":["to use the current topic to put over one's own ideas\/to use sth as a pretext to make a fuss"],"pinyin":["jie4 ti2 fa1 hui1"],"word":"借题发挥"},{"definition":["lit. to wave a banner as if it were a tiger skin (idiom)\/fig. to borrow sb's prestige\/to take the name of a great cause as a shield"],"pinyin":["la1 da4 qi2 zuo4 hu3 pi2"],"word":"拉大旗作虎皮"},{"definition":["lit. to have sufficient reason to send troops (idiom)\/to do something with good reason\/to have just cause"],"pinyin":["shi1 chu1 you3 ming2"],"word":"师出有名"},{"definition":["to vilify sb wantonly\/unrestrained attack (on sb)"],"pinyin":["da4 si4 gong1 ji1"],"word":"大肆攻击"},{"definition":["to discredit\/to defame\/to smear sb's name\/to bring shame upon (oneself or one's family etc)\/to blacken (e.g. commando's face for camouflage)\/to black out or obliterate (e.g. censored words)"],"pinyin":["mo3 hei1"],"word":"抹黑"},{"definition":["to sing sb's praises (mostly derogatory)"],"pinyin":["ge1 gong1 song4 de2"],"word":"歌功颂德"},{"definition":["to confuse right and wrong (idiom)"],"pinyin":["hun4 xiao2 shi4 fei1"],"word":"混淆是非"},{"definition":["to reverse a verdict\/to present different views on a historical person or verdict"],"pinyin":["fan1 an4"],"word":"翻案"},{"definition":["lit. Sima Zhao's intentions are obvious to everyone (idiom)\/fig. an open secret"],"pinyin":["Si1 ma3 Zhao1 zhi1 xin1 lu4 ren2 jie1 zhi1"],"word":"司马昭之心路人皆知"},{"definition":["to push the wave and add to the billows (idiom); to add momentum\/to encourage sth to get bigger\/to add fuel to the fire"],"pinyin":["tui1 bo1 zhu4 lan2"],"word":"推波助澜"},{"definition":["lit. to invert black and white (idiom); to distort the truth deliberately\/to misrepresent the facts\/to invert right and wrong"],"pinyin":["dian1 dao3 hei1 bai2"],"word":"颠倒黑白"},{"definition":["to obscure the facts (idiom); to mislead the public with prevarication and deliberate falsehoods"],"pinyin":["hun4 xiao2 shi4 ting1"],"word":"混淆视听"},{"definition":["(of a piece of writing) long and tedious (idiom)\/verbose"],"pinyin":["lian2 pian1 lei3 du2"],"word":"连篇累牍"},{"definition":["lit. chasing the wind and clutching at shadows (idiom); fig. groundless accusations\/to act on hearsay evidence"],"pinyin":["bu3 feng1 zhuo1 ying3"],"word":"捕风捉影"}]}