{"definition":["to comply with\/to follow (directives)\/to defer (to the judgment of superiors)"],"pinyin":["zun1 cong2"],"traditional":["遵從"],"rank":20178.0,"normalized_rank":0.2823163991996978,"fraction":0.000002352283479253175,"cumulative_fraction":0.9752603853402076,"word":"遵从","characters":[{"definition":["to observe\/to obey\/to follow\/to comply with"],"pinyin":["zun1"],"word":"遵"},{"definition":["surname Cong","from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor"],"pinyin":["Cong2","cong2"],"word":"从"}],"containing_words":[],"sentences":[{"english":"They are adhering to what society expects and internalising behaviours。","chinese":"他们遵从社会期望，并在行为上把这些期望内在化。"},{"english":"The result show that all the natural amino-acids will follow the rule of helix theory.","chinese":"结果表明，氨基酸类化合物也遵从螺旋理论的规律。"},{"english":"Employees don't have your typical 9-to-5 schedule.","chinese":"员工无须遵从典型的朝9晚5工作制。"},{"english":"Up to then, US artists tended to defer to their heroes in Paris.","chinese":"直到那时，美国都倾向于遵从他们在巴黎的英雄们。"},{"english":"That means well-known names and obedience to genre conventions.","chinese":"这意味着清楚明白的名称和遵从流派惯例。"},{"english":"Some laws obeyed by the beam expanding by use of the thin lens are discussed.","chinese":"讨论了用薄透镜扩束时应遵从的规律。"},{"english":"The following table generalizes some of the security requirements from common regulatory compliances.","chinese":"下面的表格归纳了常见法规遵从性的一些安全需求。"},{"english":"They are adhering to what society expects and internalising behaviours.","chinese":"他们遵从社会期望，并在行为上把这些期望内在化。"},{"english":"The statement deferred to a change in policy.","chinese":"这声明书是遵从政策的改变。"},{"english":"Even when she was angry, she observed the proprieties.","chinese":"甚至当她发怒的时候，都要遵从礼节。"},{"english":"What control mechanisms are required to ensure compliance.","chinese":"需要什么控制机制来确保遵从性。"},{"english":"Tailstock 's design also complies with a body modelling, coordinates front's fashionable outward appearance.","chinese":"车尾的设计也遵从一体造型，配合车头的时尚外观。"},{"english":"I will certainly honor your family's ways.","chinese":"既然鲍家的规矩这样，我当然会遵从。"},{"english":"For though the past it does not speak, its voiceless words all must abide.","chinese":"历史虽不能言，但它无声的话语必须遵从。"},{"english":"I did not need an operation. Instead, I did just what the doctor ordered.","chinese":"我的病用不着手术治疗，而是只需要遵从医嘱。"},{"english":"After he was admitted to comply with the wishes of Beijing Union Medical College parents.","chinese":"后遵从父母意愿考入北京协和医科大学。"}],"related":[{"definition":["in accordance with\/to follow (the rules)"],"pinyin":["zun1 zhao4"],"word":"遵照"},{"definition":["to listen and obey\/to comply with\/to heed\/to hearken"],"pinyin":["ting1 cong2"],"word":"听从"},{"definition":["to obey\/to observe\/to follow"],"pinyin":["zun1 cong2"],"word":"尊从"},{"definition":["to go against\/to be contrary to\/to violate"],"pinyin":["wei2 bei4"],"word":"违背"},{"definition":["to follow\/to abide by\/to comply with\/compliance"],"pinyin":["zun1 xun2"],"word":"遵循"},{"definition":["to obey (an order)\/to comply\/to defer"],"pinyin":["fu2 cong2"],"word":"服从"},{"definition":["to disobey\/to defy an edict\/to violate\/to go against\/to run counter to"],"pinyin":["wei2 ni4"],"word":"违逆"},{"definition":["to comply with\/to abide by\/to respect (an agreement)"],"pinyin":["zun1 shou3"],"word":"遵守"},{"definition":["to disobey"],"pinyin":["wei2 kang4"],"word":"违抗"},{"definition":["obedient\/to comply\/to submit\/to defer"],"pinyin":["shun4 cong2"],"word":"顺从"},{"definition":["to comply with\/to obey"],"pinyin":["yi1 cong2"],"word":"依从"},{"definition":["to scrupulously abide by"],"pinyin":["ke4 shou3"],"word":"恪守"},{"definition":["to restrict\/to limit to\/to constrain\/restriction\/constraint"],"pinyin":["yue1 shu4"],"word":"约束"},{"definition":["to execute\/to handle\/behavior\/action\/conduct"],"pinyin":["xing2 shi4"],"word":"行事"},{"definition":["to strictly maintain"],"pinyin":["yan2 shou3"],"word":"严守"},{"definition":["to follow the compass and go with the set square (idiom); to follow the rules inflexibly\/to act according to convention"],"pinyin":["xun2 gui1 dao3 ju3"],"word":"循规蹈矩"}]}