{"definition":["to avoid a taboo word or topic","to avoid a taboo word or topic\/to refrain from\/to avoid"],"pinyin":["bi4 hui4","bi4 hui5"],"traditional":["避諱","避諱"],"rank":21391.0,"normalized_rank":0.2992878429616778,"fraction":0.000002078867384140776,"cumulative_fraction":0.9779374846588345,"word":"避讳","characters":[{"definition":["to avoid\/to shun\/to flee\/to escape\/to keep away from\/to leave\/to hide from"],"pinyin":["bi4"],"word":"避"},{"definition":["to avoid mentioning\/taboo word\/name of deceased emperor or superior"],"pinyin":["hui4"],"word":"讳"}],"containing_words":[],"sentences":[{"english":"I confess, gestational surrogacy is a topic that I have steered clear of until now.","chinese":"老实说，代孕的话题到现在都令我避讳。"},{"english":"For I have not shunned to declare unto you all the counsel of God.","chinese":"因为神的旨意，我并没有一样避讳不传给你们的。"},{"english":"And labour-market reforms are not all that he is shying away from.","chinese":"他也不那么避讳谈及劳动力市场的改革。"},{"english":"A man should taboo bad hobbies, and cultivate good habits.","chinese":"作为男人应该避讳不良嗜好，培养良好的习惯。"},{"english":"In the weeks following childbirth, women should not avoid any nutritious foods.","chinese":"分娩之后的几周，妇女不该避讳有营养的食物。"},{"english":"However that Guo's surname is four elder brothers' persons, three sisters-in-law still a forbid are some is good.","chinese":"不过那郭氏可是四哥的人，三嫂还是避讳一些为好。"},{"english":"Japan's ancient myth, no taboo on sex.","chinese":"日本的古代神话，对性就毫不避讳。"},{"english":"But the Chinese don't even pretend this is the case.","chinese":"但是中国人甚至不避讳承认这就是事实。"}],"related":[{"definition":["to avoid as taboo"],"pinyin":["bi4 ji4"],"word":"避忌"},{"definition":["to avoid arousing suspicion"],"pinyin":["bi4 xian2"],"word":"避嫌"},{"definition":["to hold back from saying precisely what is on one's mind"],"pinyin":["yin3 hui4"],"word":"隐讳"},{"definition":["taboo\/to avoid as taboo\/to abstain from"],"pinyin":["ji4 hui4"],"word":"忌讳"},{"definition":["to be secretive; to try to cover up (idiom)"],"pinyin":["zhe1 zhe1 yan3 yan3"],"word":"遮遮掩掩"},{"definition":["important matter that must be kept secret (idiom); don't breathe a word of it to anyone!"],"pinyin":["hui4 mo4 ru2 shen1"],"word":"讳莫如深"},{"definition":["to refuse to say anything about (idiom)\/to remain tight-lipped\/to avoid mentioning"],"pinyin":["bi4 kou3 bu4 tan2"],"word":"闭口不谈"},{"definition":["to address sb directly by name (idiom)\/to address sb by name without using an honorific title (indicating either familiarity or overfamiliarity)"],"pinyin":["zhi2 hu1 qi2 ming2"],"word":"直呼其名"},{"definition":["lips sealed and not saying anything (idiom); fig. to omit mention (of a non-person or embarrassing topic)\/to censor"],"pinyin":["jue2 kou3 bu4 ti2"],"word":"绝口不提"},{"definition":["to conceal\/to hide (a taboo subject)\/to cover up the truth"],"pinyin":["yin3 man2"],"word":"隐瞒"},{"definition":["confident\/calm\/natural\/poised"],"pinyin":["da4 da4 fang1 fang1"],"word":"大大方方"},{"definition":["to have misgivings\/apprehension\/worry\/qualm\/scruple"],"pinyin":["gu4 ji4"],"word":"顾忌"},{"definition":["all taboos are off (idiom); anything goes\/nothing is taboo"],"pinyin":["bai3 wu2 jin4 ji4"],"word":"百无禁忌"},{"definition":["lit. going round the curves and skirting the corners (idiom)\/fig. to speak in a roundabout way\/to equivocate\/to beat about the bush"],"pinyin":["guai3 wan1 mo4 jiao3"],"word":"拐弯抹角"},{"definition":["to care about\/to take offense\/to mind"],"pinyin":["jie4 yi4"],"word":"介意"},{"definition":["to discuss\/to talk about"],"pinyin":["tan2 lun4"],"word":"谈论"}]}