{"definition":["matching\/fitting in with\/compatible with\/to correspond\/to fit\/to conform to\/rapport\/to coordinate with\/to act in concert with\/to cooperate\/to become man and wife\/to combine parts of machine"],"pinyin":["pei4 he2"],"traditional":["配合"],"rank":1319.0,"normalized_rank":0.018454521287759013,"fraction":0.00012203393857115747,"cumulative_fraction":0.6645134333161623,"word":"配合","characters":[{"definition":["to join\/to fit\/to mate\/to mix\/to match\/to deserve\/to make up (a prescription)\/to allocate"],"pinyin":["pei4"],"word":"配"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]","variant of 合[he2]"],"pinyin":["ge3","he2","he2"],"word":"合"}],"containing_words":[{"definition":["to coordinate closely\/to act in close partnership with"],"pinyin":["jin3 mi4 pei4 he2"],"word":"紧密配合"}],"sentences":[{"english":"Under the match of dark set, once one day inside sweep two records of counties.","chinese":"在暗组的配合下，曾有一天之内横扫两个县的记录。"},{"english":"Objective To evaluate the treatment of cooperative care of patients with IVP.","chinese":"目的探讨静脉肾盂造影的护理配合。"},{"english":"Wang Lei's sharp break in the Moco and the formation of the basket with even 4 hours.","chinese":"王磊犀利的突破和莫科在篮下形成配合连得4分。"},{"english":"Miami ran plays and the Mavs played defense.","chinese":"热火打出了配合，而小牛祭出了防守。"},{"english":"A new method has been used for calculation stability constants of metal com-plexes.","chinese":"提出了配合物稳定常数的一种新计算方法。"},{"english":"Able to work under pressure, working independently, willingness to work overtime or work with shift.","chinese":"具抗压性，能独立作业，并配合加班及轮班。"},{"english":"Particularly suitable for people with to do aerobic exercise to Dietary Fat Reduction.","chinese":"特别适合人们配合做有氧运动来减脂。"},{"english":"Some will try to get you to think they are super-adaptable and would fit into any type of situation.","chinese":"有些会尝试你觉得自己超能配合适应任何类型的情况。"},{"english":"Objective To observe the curative effect of Liyan Ice Bar on bulbar paralysis.","chinese":"目的观察利咽冰棒配合针刺治疗球麻痹的临床疗效。"},{"english":"Removes gently with Revlon ColorStay Eye& Lip Makeup Remover .","chinese":"卸妆时请配合使用露华浓不脱色眼唇部卸妆乳。"},{"english":"Conclusion Balancing acupuncture is superior to conventional acupuncture in treating stiff neck.","chinese":"目的观察平衡针配合运动疗法治疗落枕临床疗效。"},{"english":"To observe the effects of needling combined with function training on the balance function of stroke patients.","chinese":"探讨针刺配合功能训练对脑卒中患者平衡功能的影响。"},{"english":"We accommodate differences of students, adapt our work to meet individual needs and group differences.","chinese":"我们坚信有教无类，以配合学生个体需要和群体差异。"},{"english":"These days I am practicing it with my casette tape recorder at home.","chinese":"这几天，我正在家里配合录音机练习。"},{"english":"The geometry of the sans serif, all-caps typography provided that tie.","chinese":"几何形状的无衬，全帽印刷术提供配合。"},{"english":"Use stain removal spray gun with stain removal agent to do pre-wash preparation.","chinese":"利用去渍枪，配合预处理剂完成洗前预处理。"}],"related":[{"definition":["to assist\/to aid\/supplementary\/auxiliary\/subsidiary"],"pinyin":["fu3 zhu4"],"word":"辅助"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同时"},{"definition":["preceding period\/early stage"],"pinyin":["qian2 qi1"],"word":"前期"},{"definition":["control\/to exercise control over\/to contain"],"pinyin":["kong4 zhi4"],"word":"控制"},{"definition":["to join together\/to combine"],"pinyin":["xian2 jie1"],"word":"衔接"},{"definition":["perfect\/perfection\/perfectly"],"pinyin":["wan2 mei3"],"word":"完美"},{"definition":["to catch up with\/to keep pace with"],"pinyin":["gen1 shang4"],"word":"跟上"},{"definition":["late stage\/later period"],"pinyin":["hou4 qi1"],"word":"后期"},{"definition":["to start on a journey\/to be on one's way"],"pinyin":["shang4 lu4"],"word":"上路"},{"definition":["to reinforce\/to strengthen\/to increase"],"pinyin":["jia1 qiang2"],"word":"加强"},{"definition":["rhythm\/tempo\/musical pulse\/cadence\/beat"],"pinyin":["jie2 zou4"],"word":"节奏"},{"definition":["and\/besides\/moreover\/furthermore\/in addition"],"pinyin":["bing4 qie3"],"word":"并且"},{"definition":["to exploit\/to make use of\/to use\/to take advantage of\/to utilize"],"pinyin":["li4 yong4"],"word":"利用"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推进"},{"definition":["result\/effect\/efficacy\/(theater) sound or visual effects"],"pinyin":["xiao4 guo3"],"word":"效果"}]}