{"definition":["to compound (medicines etc)\/to prepare (by mixing ingredients)\/to concoct"],"pinyin":["pei4 zhi4"],"traditional":["配製"],"rank":19785.0,"normalized_rank":0.2768178193163852,"fraction":0.000002448920668235774,"cumulative_fraction":0.9743173146911366,"word":"配制","characters":[{"definition":["to join\/to fit\/to mate\/to mix\/to match\/to deserve\/to make up (a prescription)\/to allocate"],"pinyin":["pei4"],"word":"配"},{"definition":["to manufacture\/to make","system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4","zhi4"],"word":"制"}],"containing_words":[],"sentences":[{"english":"The confection of the nutritious liquid is a important technical problem in the hydroponics .","chinese":"营养液配制是无土栽培一个关键的技术问题。"},{"english":"The regulations also ban unregulated health practitioners from commissioning or formulating their own medicines.","chinese":"法规还严禁不合格的中医医生从业或配制自己的药方。"},{"english":"The preparation of beverages such as betel nut, to prevent the occurrence of severe malaria disease.","chinese":"如用槟榔配制饮料，可预防瘴气重而发生的疾病。"},{"english":"Lime water may be bought at any druggist's, or easily prepared at home.","chinese":"石灰水可从药店购得，不过在家里配制也很容易。"},{"english":"Kava is also the name of the pungent beverage prepared from the plant's roots.","chinese":"卡瓦根也是由植物根配制的辛辣饮料的名字。"},{"english":"After washing the feeding and preparation equipment, rinse thoroughly in safe water.","chinese":"在清洗喂养和配制器具后，再用安全饮水彻底冲洗。"},{"english":"Stock standard solutions are used to prepare primary dilution standards.","chinese":"储备标准溶液是用于配制第一稀释标准溶液。"},{"english":"The total floating wage system for the staff is a great development of the income and allocation system.","chinese":"劳动工资制度是收入分配制度的主要内容。"},{"english":"Introduced the preparation of color glaze used in unglazed ware altering to green body.","chinese":"介绍了素烧坯改素坯施釉用色釉的配制。"},{"english":"One of the coolest things about 4Food is the ability to save the burgers you’ve made to the food system.","chinese":"它最酷的功能之一是把你个人配制的汉堡存入系统。"},{"english":"This paper introduces a method of preparing and using a new room-temperature quick phosphating solution.","chinese":"介绍一种新型常温快速磷化液的配制和使用方法。"},{"english":"Post allowance system (PAS) is an innovation method of distribution system in college and university.","chinese":"高校岗位津贴制度是高校分配制度的创新之举。"},{"english":"Application of special fine sand concrete to the construction of Dongxiguan Hydropower Station;","chinese":"东西关水电站采用特细砂配制水工混凝土。"},{"english":"We will reform the income distribution system.","chinese":"改革收入分配制度。"},{"english":"Several lower alkalinity and small addition concrete expansion agents were prepared with different raw materials.","chinese":"利用不同的原料配制了多组低碱低掺型混凝土膨胀剂。"},{"english":"The research supplied theoretical way to confect electrostatic spraying preparation.","chinese":"这些规律为以后静电喷雾制剂的配制提供了理论依据。"}],"related":[{"definition":["to concoct by mixing ingredients\/to prepare according to a recipe\/to make (a salad, a cocktail, cosmetics etc)","to modulate\/modulation"],"pinyin":["tiao2 zhi4","tiao2 zhi4"],"word":"调制"},{"definition":["medicine\/medicament\/drug\/chemical compound"],"pinyin":["yao4 ji4"],"word":"药剂"},{"definition":["(chemistry) to refine"],"pinyin":["lian4 zhi4"],"word":"炼制"},{"definition":["prescription\/cooking recipe\/formulation\/completing the square (to solve quadratic equation, math.)"],"pinyin":["pei4 fang1"],"word":"配方"},{"definition":["liquid\/fluid\/Taiwan pr. [yi4]"],"pinyin":["ye4"],"word":"液"},{"definition":["to brew\/to infuse\/to pickle"],"pinyin":["pao4 zhi4"],"word":"泡制"},{"definition":["to allocate\/to deploy","to blend (colors, herbs)\/to mix"],"pinyin":["diao4 pei4","tiao2 pei4"],"word":"调配"},{"definition":["to purify"],"pinyin":["ti2 chun2"],"word":"提纯"},{"definition":["medicinal ingredient"],"pinyin":["yao4 cai2"],"word":"药材"},{"definition":["dose (medicine)"],"pinyin":["ji4"],"word":"剂"},{"definition":["to dispense (drugs)\/to prescribe"],"pinyin":["pei4 yao4"],"word":"配药"},{"definition":["solution (chemistry)"],"pinyin":["rong2 ye4"],"word":"溶液"},{"definition":["legendary magic potion of immortals\/panacea\/fig. wonder solution to a problem"],"pinyin":["ling2 yao4"],"word":"灵药"},{"definition":["fine powder\/dust"],"pinyin":["fen3 mo4"],"word":"粉末"},{"definition":["raw material\/CL:個|个[ge4]"],"pinyin":["yuan2 liao4"],"word":"原料"},{"definition":["medicinal herb"],"pinyin":["yao4 cao3"],"word":"药草"}]}