{"definition":["to take action\/to adopt policies\/to move on some issue"],"pinyin":["cai3 qu3 xing2 dong4"],"traditional":["採取行動"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"采取行动","characters":[{"definition":["to pick\/to pluck\/to collect\/to select\/to choose\/to gather","color\/complexion\/looks\/variant of 彩[cai3]\/variant of 採|采[cai3]","allotment to a feudal noble"],"pinyin":["cai3","cai3","cai4"],"word":"采"},{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"动"}],"containing_words":[],"sentences":[{"english":"And these various feedback mechanisms quickly facilitate jumpstarting the necessary people into action.","chinese":"这些反馈机制能够及时协助有关人员迅速采取行动。"},{"english":"In order for these techniques to be effective, you have to act on them.","chinese":"要想让这些方法变得有效，你必须据此采取行动。"},{"english":"We'd better get everything straight before taking any action.","chinese":"我们最好把所有相关事宜都捋顺再采取行动。"},{"english":"The Secretary-General has taken action in all areas of reform under his authority.","chinese":"秘书长已在受其管辖的全部改革领域采取行动。"},{"english":"No longer like puppet, not as acted upon a puppet.","chinese":"不再像木偶，不采取行动作为一个傀儡。"},{"english":"As the market slumps, homeowners are taking action to stop the build-up of boards.","chinese":"随着市场的低迷，房主正在采取行动，制止集结板。"},{"english":"So be slow to take action or to make statements you might later regret...","chinese":"因此，别急着采取行动，或发表声明，免得日后后悔。"},{"english":"There will be no retrospective global agreement to undo the damage we have caused.","chinese":"全球一致采取行动治理我们已经造成的损害刻不容缓。"},{"english":"Requires operator to re-enter user name and password before an action is taken.","chinese":"运营商需要重新输入用户名和密码之前采取行动。"},{"english":"Red tape encumbered all our attempts at action.","chinese":"繁文缛节阻碍了我们为采取行动而作的所有努力。"},{"english":"We are moving to replace mutually assured destruction with mutual cooperation.","chinese":"我们正在采取行动，以共同合作代替同归于尽。"},{"english":"Actions must be taken promptly and order be restored as soon as possible.","chinese":"必须迅速采取行动，尽快恢复秩序。"},{"english":"A:I think it's time for the govemment to take action.","chinese":"我认为政府该采取行动了。"},{"english":"Management and union rank and filer alike hoped congress would act quickly.","chinese":"资方与工会会员都希望国会迅速采取行动。"},{"english":"More often than not, your fear will go away once you take action.","chinese":"一旦你采取行动，恐惧自然就灰飞烟灭了。"},{"english":"So plan a little and then take action.","chinese":"所以还是把计划定小一些，然后采取行动吧。"}],"related":[{"definition":["to adopt measures\/to take steps"],"pinyin":["cai3 qu3 cuo4 shi1"],"word":"采取措施"},{"definition":["operation\/action\/CL:個|个[ge4]\/to move about\/mobile"],"pinyin":["xing2 dong4"],"word":"行动"},{"definition":["to press\/to urge\/to hasten"],"pinyin":["dun1 cu4"],"word":"敦促"},{"definition":["to gain the initiative by striking first (idiom); to preempt\/to anticipate\/preemptive"],"pinyin":["xian1 fa1 zhi4 ren2"],"word":"先发制人"},{"definition":["course of events"],"pinyin":["shi4 tai4 fa1 zhan3"],"word":"事态发展"},{"definition":["situation\/existing state of affairs"],"pinyin":["shi4 tai4"],"word":"事态"},{"definition":["to withdraw\/to leave\/to retreat\/to pull out"],"pinyin":["che4 chu1"],"word":"撤出"},{"definition":["to put into practice\/to carry out (idiom)"],"pinyin":["fu4 zhu1 shi2 shi1"],"word":"付诸实施"},{"definition":["to change positions\/to shift one's ground"],"pinyin":["zhuan3 bian4 li4 chang3"],"word":"转变立场"},{"definition":["to declare one's position\/to say where one stands"],"pinyin":["biao3 tai4"],"word":"表态"},{"definition":["to withdraw from\/to evacuate"],"pinyin":["che4 li2"],"word":"撤离"},{"definition":["seriousness"],"pinyin":["yan2 zhong4 xing4"],"word":"严重性"},{"definition":["to hold back one's troops without moving (idiom); to bide one's time"],"pinyin":["an4 bing1 bu4 dong4"],"word":"按兵不动"},{"definition":["to retire\/to remove\/to withdraw\/to evacuate"],"pinyin":["che4 zou3"],"word":"撤走"},{"definition":["to warn\/to admonish"],"pinyin":["jing3 gao4"],"word":"警告"},{"definition":["to use force\/to come to blows"],"pinyin":["dong4 wu3"],"word":"动武"}]}