{"definition":["Chongqing city, formerly in Sichuan province, a municipality since 1997, short name 渝[Yu2]"],"pinyin":["Chong2 qing4 shi4"],"traditional":["重慶市"],"rank":5537.0,"normalized_rank":0.07746981377583144,"fraction":0.00002068123430803738,"cumulative_fraction":0.8709266340047603,"word":"重庆市","characters":[{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["zhong4","chong2"],"word":"重"},{"definition":["to celebrate"],"pinyin":["qing4"],"word":"庆"},{"definition":["market\/city\/CL:個|个[ge4]"],"pinyin":["shi4"],"word":"市"}],"containing_words":[],"sentences":[{"english":"Part IV is to discuss how to strengthenpsychology health education to suit teachers school graduates needs in ChongqingMunicipality.","chinese":"第四部分是加强重庆市中师生心理健康教育。"},{"english":"My town is called Yihe in Kaixian County in Chongqing.","chinese":"我家住在重庆市开县义和镇。"},{"english":"The fourth part analyses economic losses of the mid-summer drought of Chongqing in 2001.","chinese":"第四部分为2001年重庆市伏旱经济损失分析。"},{"english":"Companies located in China Yuzhong District Bund mall.","chinese":"公司位于中国重庆市渝中区外滩商城。"},{"english":"Chongqing, a metropolis in the southwest of China, has set up an Anti-Cult Federation of Chongqing.","chinese":"中国西南的大都市重庆成立了重庆市反邪教联合会。"},{"english":"During the anti-bombing struggle, the provisional council of Chongqing city played a very important role.","chinese":"在反轰炸斗争中，重庆市临时参议会起到了重要作用。"},{"english":"Chongqing Kefa Company is making efforts on cleanliness experimental unit according to Chongqing Finance Affairs Committee.","chinese":"按重庆市经委要求正在进行清洁生产试点工作。"},{"english":"Lin Yan was born in 1927 in Chongqing.","chinese":"林彦，1927年出生，重庆市人。"},{"english":"In recent months, the streets of the city of Chongqing have been ringing with song.","chinese":"近几个月来，重庆市的大街小巷歌声嘹亮。"},{"english":"The company was founded in year 2000 and registered in Yuzhong District of Chongqing Municipality.","chinese":"公司创建于2000年，注册于重庆市渝中区。"},{"english":"He is a member of culture and history research center of Chongqing City.","chinese":"现任重庆市文史研究馆馆员。"},{"english":"Under the pressure of population aging, it is urgent to explore community old-age care system in Chongqing.","chinese":"重庆市在人口老龄化压力下，探索社区养老日益迫切。"},{"english":"Dazu County, located in the southeast of Sichuan province, is 271 kilometres away from Chengdu and 163 kilometres away from Chongqing.","chinese":"大足县在重庆市的西北，县城距重庆百余公里。"},{"english":"When applied at a few inspection points in Jiangbei District of Chongqing, this method proved to be feasible.","chinese":"以重庆市江北区部分监测点为例证明此方法的可行性。"},{"english":"Liudianzi Primary School of Yuzhong District, Chongqing City …","chinese":"重庆市渝中区解放西路小学校怎么样？"},{"english":"Tang Chuan, director of law enforcement in the Chongqing Bureau of Inspection and Enforcement, disagrees.","chinese":"重庆市工商局执法局一处处长唐川并不同意上述观点。"}],"related":[{"definition":["Fuling suburban district of Chongqing municipality, formerly in Sichuan"],"pinyin":["Fu2 ling2 qu1"],"word":"涪陵区"},{"definition":["Jiangjin suburban district of Chongqing municipality, formerly in Sichuan"],"pinyin":["Jiang1 jin1 qu1"],"word":"江津区"},{"definition":["Wanzhou suburban district of north Chongqing municipality, formerly in Sichuan"],"pinyin":["Wan4 zhou1 qu1"],"word":"万州区"},{"definition":["Hechuan suburban district of Chongqing municipality, formerly in Sichuan"],"pinyin":["He2 chuan1 qu1"],"word":"合川区"},{"definition":["Jiulongpo district of central Chongqing municipality, formerly in Sichuan"],"pinyin":["Jiu3 long2 po1 qu1"],"word":"九龙坡区"},{"definition":["Yongchuan suburban district of Chongqing municipality, formerly in Sichuan"],"pinyin":["Yong3 chuan1 qu1"],"word":"永川区"},{"definition":["Sichuan province (Szechuan) in southwest China, abbr. 川[Chuan1] or 蜀[Shu3], capital Chengdu 成都[Cheng2 du1]"],"pinyin":["Si4 chuan1 Sheng3"],"word":"四川省"},{"definition":["Shapingba district of central Chongqing municipality, formerly in Sichuan"],"pinyin":["Sha1 ping2 ba4 qu1"],"word":"沙坪坝区"},{"definition":["Banan district of central Chongqing municipality, formerly in Sichuan"],"pinyin":["Ba1 nan2 qu1"],"word":"巴南区"},{"definition":["Dadukou district of central Chongqing municipality, formerly in Sichuan"],"pinyin":["Da4 du4 kou3 qu1"],"word":"大渡口区"},{"definition":["Qianjiang suburban district of Chongqing municipality"],"pinyin":["Qian2 jiang1 qu1"],"word":"黔江区"},{"definition":["Nananqu district of central Chongqing municipality, formerly in Sichuan"],"pinyin":["Nan2 an4 qu1"],"word":"南岸区"},{"definition":["Beibei district of central Chongqing municipality, formerly in Sichuan"],"pinyin":["Bei3 bei4 qu1"],"word":"北碚区"},{"definition":["Shizhu Tujia autonomous county in Qianjiang suburbs of Chongqing municipality"],"pinyin":["Shi2 zhu4 xian4"],"word":"石柱县"},{"definition":["Yunyang county in Wanzhou suburbs of north Chongqing municipality, formerly in Sichuan"],"pinyin":["Yun2 yang2 xian4"],"word":"云阳县"},{"definition":["Yuzhong (or central Chongqing) district of central Chongqing municipality, formerly in Sichuan"],"pinyin":["Yu2 zhong1 qu1"],"word":"渝中区"}]}