{"definition":["to raise the same topic"],"pinyin":["chong2 ti2"],"traditional":["重提"],"rank":27845.0,"normalized_rank":0.3895876764652386,"fraction":0.0000011441726393438244,"cumulative_fraction":0.9880048033757121,"word":"重提","characters":[{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["zhong4","chong2"],"word":"重"},{"definition":["to carry (hanging down from the hand)\/to lift\/to put forward\/to mention\/to raise (an issue)\/upwards character stroke\/lifting brush stroke (in painting)\/scoop for measuring liquid"],"pinyin":["ti2"],"word":"提"}],"containing_words":[{"definition":["to raise the same old topic again\/to hark back"],"pinyin":["chong2 ti2 jiu4 shi4"],"word":"重提旧事"}],"sentences":[{"english":"\"Emotion and molding\" was very similar to the old topic of emotion and art.","chinese":"“情感与造型”，似是重提了情感与艺术的老话题。"},{"english":"This harks back to something I mentioned in my first tip.","chinese":"这又重提了我在第一点里说到的。"},{"english":"Now, the most tenuous of news reports has ramped the talk up again.","chinese":"目前这则最飘渺的新闻报道再一次被重提。"},{"english":"Heidegger revealed the necessity for explicitly restating the question of Being.","chinese":"海德格的诠释现象学揭露了重提存有问题的必要性。"},{"english":"The proposed repeat of the corporate tax repatriation holiday is one such wolf in sheep's clothing.","chinese":"重提回流资金减税就是这种批着羊皮的狼。"},{"english":"Their redux reopens old wounds.","chinese":"他们旧事重提，揭开了旧的伤痕。"},{"english":"However, we can wait for better again this matter.","chinese":"然而一等情况好转，我们自当重提此事。"},{"english":"She dare not mention the subject again.","chinese":"她不敢重提那个话题。"},{"english":"Then, all of a sudden, some people insisted on bringing the subject up again.","chinese":"然后，突然之间，一些人又坚持重提旧事。"},{"english":"We are seeing signs of success, which I will turn to later.","chinese":"我们正在看到成功的迹象，我稍后将重提这个问题。"},{"english":"Scotland shelved its proposals for a charge, but they could yet be revived.","chinese":"苏格兰搁置了收费的提议，但仍有可能被重提。"},{"english":"You're always harking back to how things were50 years ago.","chinese":"你老是喜欢重提五十年前的境况。"},{"english":"For as the sun is daily new and old, So ism love still telling what is told.","chinese":"太阳每天有新久的交替，我的爱也就永远把旧话重提。"},{"english":"It was right there in front of you. Why do you want to talk about that again?","chinese":"自由就在你眼前，你为何不愿再旧事重提？"},{"english":"Don't beat the dead horse. We cleared up that misunderstanding long ago.","chinese":"不要在重提旧事，很久之前我们就澄清那误会了。"},{"english":"Bringing up a matter of the past, only in order to promote today's introspection.","chinese":"旧事重提，只为促进今天的反省。"}],"related":[{"definition":["to raise the same old topic again\/to hark back"],"pinyin":["chong2 ti2 jiu4 shi4"],"word":"重提旧事"},{"definition":["to play the same old tune (idiom); unoriginal"],"pinyin":["lao3 diao4 chong2 tan2"],"word":"老调重弹"},{"definition":["old affair\/former matter"],"pinyin":["jiu4 shi4"],"word":"旧事"},{"definition":["to mention\/to raise (a subject)\/to bring to sb's attention"],"pinyin":["ti2 ji2"],"word":"提及"},{"definition":["to use the current topic to put over one's own ideas\/to use sth as a pretext to make a fuss"],"pinyin":["jie4 ti2 fa1 hui1"],"word":"借题发挥"},{"definition":["lips sealed and not saying anything (idiom); fig. to omit mention (of a non-person or embarrassing topic)\/to censor"],"pinyin":["jue2 kou3 bu4 ti2"],"word":"绝口不提"},{"definition":["words still ringing in one's ears (idiom)"],"pinyin":["yan2 you2 zai4 er3"],"word":"言犹在耳"},{"definition":["not to mention (idiom); to say not one word\/fig. to omit mention (of a non-person or embarrassing topic)\/to censor"],"pinyin":["zhi1 zi4 bu4 ti2"],"word":"只字不提"},{"definition":["The issue is in the past, and the situation has changed (idiom).\/It is water under the bridge."],"pinyin":["shi4 guo4 jing4 qian1"],"word":"事过境迁"},{"definition":["to turn over old accounts\/fig. to revive old quarrels\/to reopen old wounds"],"pinyin":["fan1 jiu4 zhang4"],"word":"翻旧账"},{"definition":["to refuse to say anything about (idiom)\/to remain tight-lipped\/to avoid mentioning"],"pinyin":["bi4 kou3 bu4 tan2"],"word":"闭口不谈"},{"definition":["to reaffirm\/to reiterate"],"pinyin":["chong2 shen1"],"word":"重申"},{"definition":["lit. old account\/old debt\/fig. old scores to settle\/old quarrels\/old grudge"],"pinyin":["jiu4 zhang4"],"word":"旧账"},{"definition":["old anecdote\/stories passed on from former times"],"pinyin":["jiu4 wen2"],"word":"旧闻"},{"definition":["repeatedly"],"pinyin":["yi1 zai4"],"word":"一再"},{"definition":["an old observation (idiom)\/a truism\/banal comments"],"pinyin":["lao3 sheng1 chang2 tan2"],"word":"老生常谈"}]}