{"definition":["large sum of money"],"pinyin":["zhong4 jin1"],"traditional":["重金"],"rank":13063.0,"normalized_rank":0.182768318106138,"fraction":0.000005294024615774832,"cumulative_fraction":0.9499778245605974,"word":"重金","characters":[{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["zhong4","chong2"],"word":"重"},{"definition":["surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)","gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Jin1","jin1"],"word":"金"}],"containing_words":[{"definition":["heavy metal"],"pinyin":["zhong4 jin1 shu3"],"word":"重金属"}],"sentences":[{"english":"It is the heavy metals contained in the waste effluent that can cause an environmental or disposal problem.","chinese":"就是流出废液中的重金属能导致环境或处理问题。"},{"english":"Objective To establish the method for determining controlled contents of As, Pb and Hg in Chinese medicinal materials.","chinese":"目的建立测定中药材中重金属砷铅汞的控制含量方法。"},{"english":"The effect of plant ash on decreasing the content of heavy metals in plants were not obvious.","chinese":"草木灰对降低作物体内重金属含量的效果不明显。"},{"english":"Vermilion contains heavy metal arsenic and mercury.","chinese":"朱砂含有重金属砷和汞。"},{"english":"Study on the inhibitory effect of heavy metals.","chinese":"研究了重金属的抑制效应。"},{"english":"Meanwhile, the content of heavy metals in Nephrolepis cordifolia increased significantly.","chinese":"同时肾蕨对各种重金属离子吸收总量也显著提高。"},{"english":"Further research on how to control the content of heavy metal in Bombyx Batryticatus should be well developed.","chinese":"如何控制僵蚕中的重金属含量有待深入研究。"},{"english":"Heavy metal and mullets its how we were raised.","chinese":"重金属及如何提高其尾乌鱼。"},{"english":"The correlation of heavy metals content between Seleng wormwood and soil was not significant.","chinese":"芦蒿样品与土壤中重金属含量相关性不显著。"},{"english":"I used to listen to a lot of hip-hop music and heavy metal when I was younger.","chinese":"我年轻的时候，我常常听一些嘻哈和重金属音乐。"},{"english":"Objective To investigate the effects of metal exposure on defecation behavior in nematode Caenorhabditis elegans.","chinese":"目的研究重金属暴露对秀丽线虫排泄行为的影响。"},{"english":"This paper summarized the resent knowledge on heavy metal and pathogenic organisms in sludge.","chinese":"文章概述了有关污泥中重金属及病源体的研究状况。"},{"english":"We describe the influence of heavy metal pollution on the morphological and internal structural changes of aquatic Dipteral insects.","chinese":"水生双翅目昆虫是监测水体重金属污染的理想对象。"},{"english":"It is very heavy and chemically resembles arsenic and antimony.","chinese":"像砷和锑一样，铋也是重金属和重化学元素。"},{"english":"After burning the flat coal waste rock pile of the heavy metals pollution levels for light pollution.","chinese":"经过燃烧的平排矸石山重金属污染等级为轻污染。"},{"english":"This model will provide valuable reference for the heavy metal pollution forecast about Le'an R…","chinese":"此模型对乐安河重金属污染预测有一定的参考价值。"}],"related":[{"definition":["huge investment\/vast sum"],"pinyin":["ju4 zi1"],"word":"巨资"},{"definition":["to spare no effort\/to devote all one's energies"],"pinyin":["bu4 xi1 xue4 ben3"],"word":"不惜血本"},{"definition":["hard-earned capital"],"pinyin":["xue4 ben3"],"word":"血本"},{"definition":["to spend\/to allocate funds"],"pinyin":["chi4 zi1"],"word":"斥资"},{"definition":["lit. stake a thousand pieces of gold on one throw (idiom); to throw away money recklessly\/extravagant"],"pinyin":["yi1 zhi4 qian1 jin1"],"word":"一掷千金"},{"definition":["to hire at a high salary"],"pinyin":["gao1 xin1 pin4 qing3"],"word":"高薪聘请"},{"definition":["high price"],"pinyin":["gao1 jia4"],"word":"高价"},{"definition":["rich and imposing\/rich and overbearing"],"pinyin":["cai2 da4 qi4 cu1"],"word":"财大气粗"},{"definition":["financial backer\/bankroller"],"pinyin":["jin1 zhu3"],"word":"金主"},{"definition":["to intend\/intentionally\/interested in"],"pinyin":["you3 yi4"],"word":"有意"},{"definition":["to engage\/to hire (a lawyer etc)"],"pinyin":["pin4 qing3"],"word":"聘请"},{"definition":["sth written or painted in one's own hand\/(of a writer, calligrapher or painter) skill\/style\/hand\/(fig.) style shown in spending money, handling business etc\/scale"],"pinyin":["shou3 bi3"],"word":"手笔"},{"definition":["not stint\/not spare\/not hesitate (to do sth)\/not scruple (to do sth)"],"pinyin":["bu4 xi1"],"word":"不惜"},{"definition":["to pay"],"pinyin":["chu1 qian2"],"word":"出钱"},{"definition":["considerable (cost etc)\/bountiful (crop etc)\/high (social status etc)"],"pinyin":["bu4 fei3"],"word":"不菲"},{"definition":["to spend\/expenditure\/to cost"],"pinyin":["hao4 zi1"],"word":"耗资"}]}