{"definition":["lit. to wash one's hands in a gold basin (idiom)\/fig. to abandon the life of an outlaw"],"pinyin":["jin1 pen2 xi3 shou3"],"traditional":["金盆洗手"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"金盆洗手","characters":[{"definition":["surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)","gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Jin1","jin1"],"word":"金"},{"definition":["basin\/flower pot\/unit of volume equal to 12 斗[dou3] and 8 升[sheng1], approx 128 liters\/CL:個|个[ge4]"],"pinyin":["pen2"],"word":"盆"},{"definition":["to wash\/to bathe\/to develop (photo)"],"pinyin":["xi3"],"word":"洗"},{"definition":["hand\/(formal) to hold\/person engaged in certain types of work\/person skilled in certain types of work\/personal(ly)\/convenient\/classifier for skill\/CL:雙|双[shuang1],隻|只[zhi1]"],"pinyin":["shou3"],"word":"手"}],"containing_words":[],"sentences":[{"english":"Ju Feng trained Jin Sheng, let his gain want gain money to wash his hands with respect to golden basin.","chinese":"鞠枫训练了金胜，让他赚到想要赚到钱就金盆洗手。"},{"english":"On the YouJunDa says he is innocent, since after wash.","chinese":"尤俊达当场表示自己是清白的，自从金盆洗手之后。"},{"english":"Gray represents non-involvement, giving it a formal authority.","chinese":"灰色代表金盆洗手，放弃形式上的权力。"},{"english":"You said you got out when we met in France.","chinese":"你说我们在法国相遇之后你就金盆洗手了。"}],"related":[{"definition":["to totally stop doing something\/to reform one's ways"],"pinyin":["xi3 shou3 bu4 gan4"],"word":"洗手不干"},{"definition":["(of a person) to return to the fray after a period of inactivity\/to jump back into the thick of things\/(of sth that was once popular) to be resurrected\/to make a comeback"],"pinyin":["chong2 chu1 jiang1 hu2"],"word":"重出江湖"},{"definition":["to resume one's old trade (idiom)"],"pinyin":["chong2 cao1 jiu4 ye4"],"word":"重操旧业"},{"definition":["to mend one's ways (idiom)\/to turn over a new leaf"],"pinyin":["gai3 xie2 gui1 zheng4"],"word":"改邪归正"},{"definition":["lit. to wash one's heart and renew one's face (idiom); to repent sincerely and mend one's mistaken ways\/to turn over a new leaf"],"pinyin":["xi3 xin1 ge2 mian4"],"word":"洗心革面"},{"definition":["(of a slave or servant) to be given one's freedom\/(of a prostitute) to marry and leave one's trade"],"pinyin":["cong2 liang2"],"word":"从良"},{"definition":["to retire (from society, esp. from politics)\/to vanish"],"pinyin":["yin3 tui4"],"word":"隐退"},{"definition":["to form one's own group or school of thought\/to set up one's own business\/to establish oneself"],"pinyin":["zi4 li4 men2 hu4"],"word":"自立门户"},{"definition":["rivers and lakes\/all corners of the country\/remote areas to which hermits retreat\/section of society operating independently of mainstream society, out of reach of the law\/the milieu in which wuxia tales play out (cf. 武俠|武侠[wu3 xia2])\/(in late imperial times) world of traveling merchants, itinerant doctors, fortune tellers etc\/demimonde\/(in modern times) triads\/secret gangster societies\/underworld"],"pinyin":["jiang1 hu2"],"word":"江湖"},{"definition":["dark road\/criminal ways\/the underworld\/see also 白道[bai2 dao4]"],"pinyin":["hei1 dao4"],"word":"黑道"},{"definition":["to remove armor and return to the farm\/to return to civilian life"],"pinyin":["jie3 jia3 gui1 tian2"],"word":"解甲归田"},{"definition":["to be released from prison"],"pinyin":["chu1 yu4"],"word":"出狱"},{"definition":["to roam far and wide\/to drift with the wind"],"pinyin":["lang4 ji4 jiang1 hu2"],"word":"浪迹江湖"},{"definition":["completely correcting one's former misdeeds (idiom); to repent past mistakes and turn over a new leaf\/a reformed character"],"pinyin":["tong4 gai3 qian2 fei1"],"word":"痛改前非"},{"definition":["to improve one's family's social status by moving up in the world\/to switch one's allegiance to a new patron"],"pinyin":["gai3 huan4 men2 ting2"],"word":"改换门庭"},{"definition":["to win success and recognition (idiom)"],"pinyin":["gong1 cheng2 ming2 jiu4"],"word":"功成名就"}]}