{"definition":["Ministry of Railways (MOR), disbanded in 2013 with its regulatory functions taken over by the Ministry of Transport 交通運輸部|交通运输部[Jiao1 tong1 Yun4 shu1 bu4]"],"pinyin":["Tie3 dao4 bu4"],"traditional":["鐵道部"],"rank":7672.0,"normalized_rank":0.10734123375260587,"fraction":0.000012780633187015884,"cumulative_fraction":0.9057398939057916,"word":"铁道部","characters":[{"definition":["iron (metal)\/arms\/weapons\/hard\/strong\/violent\/unshakeable\/determined\/close\/tight (slang)","surname Tie"],"pinyin":["tie3","Tie3"],"word":"铁"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"},{"definition":["ministry\/department\/section\/part\/division\/troops\/board\/classifier for works of literature, films, machines etc"],"pinyin":["bu4"],"word":"部"}],"containing_words":[],"sentences":[{"english":"The Railway Ministry has also ordered a two-month safety review of railway operations.","chinese":"铁道部长也已经下令将开展为期两个月的安全检查。"},{"english":"I commend the indian railways for thier strong and positive stand.","chinese":"我很赞同印度铁道部这种坚定的立场。"},{"english":"It told the news agency Xinhua the ministry still enjoys strong government support.","chinese":"大公对新华社说，铁道部依然享有政府的强有力支持。"},{"english":"China's railway minister, Sheng Guangzu, was reported to have rushed to the scene.","chinese":"据报道，中国铁道部部长盛光祖已经火速赶往现场。"},{"english":"Online demands abound that the railway minister, Sheng Guangzu, lose his job too.","chinese":"网络热呼铁道部长盛光祖引咎辞职。"},{"english":"Mr. Ghulam Muhammad Bilor Pakistani Railways Minister, should be sent to China for some times only.","chinese":"巴基斯坦铁道部长应当去中国待一段时间。"},{"english":"Railways ministry spokesman dismissed from office.","chinese":"铁道部发言人王勇平离任。"},{"english":"Cafe bikes are not operated on trains by the Railways.","chinese":"列车上有吸烟休息室的餐车由铁道部门经营。"},{"english":"Will the railway minister introduce a train that would travel in 5 hours?","chinese":"铁道部是否能引进一种能在5小时内跑完的火车？"},{"english":"The Ministry of Railways said train T195 derailed from the track before the collision.","chinese":"铁道部称T195次列车在相撞前已出轨。"},{"english":"Ministry of Railways relevant departments and units directly under the charge of people take part in the meeting.","chinese":"铁道部有关司局和直属单位负责人参加了会议。"},{"english":"Joint Venture Division of Development and Planning.","chinese":"铁道部发展计划司合资处。"},{"english":"Article 3 The connection of special railway lines with national railways must be approved by the Ministry of Railways.","chinese":"第三条铁路专用线与国铁接轨必须经铁道部批准。"},{"english":"The official state media took Mr. Wen’s broadside as a pass to keep digging into Railways Ministry incompetence.","chinese":"官方国家媒体借此继续调查铁道部的失职。"},{"english":"After a meeting sponsored by the people from the ministry, all of us attended an exam.","chinese":"会后，全体报名的人员参加了铁道部派员举行的考试。"},{"english":"The leaders of the ministry of railway put forward a request again for high railway service quality.","chinese":"铁道部门领导再次向全体职工提出了端正路风的要求。"}],"related":[{"definition":["Ministry of Transport\/Transport Department"],"pinyin":["Jiao1 tong1 bu4"],"word":"交通部"},{"definition":["PRC State Planning Committee, abbr. for 國家計劃委員會|国家计划委员会[Guo2 jia1 Ji4 hua4 Wei3 yuan2 hui4]"],"pinyin":["Guo2 jia1 Ji4 Wei3"],"word":"国家计委"},{"definition":["parent company\/head office"],"pinyin":["zong3 gong1 si1"],"word":"总公司"},{"definition":["locomotive depot"],"pinyin":["ji1 wu4 duan4"],"word":"机务段"},{"definition":["China earthquake administration (CEA)\/State seismological bureau"],"pinyin":["Guo2 jia1 di4 zhen4 ju2"],"word":"国家地震局"},{"definition":["(military) General Logistics Department"],"pinyin":["Zong3 hou4 qin2 bu4"],"word":"总后勤部"},{"definition":["PRC State Planning Committee, set up in 1952, replaced in 1998 by State Development and Planning Committee 國家發展計劃委員會|国家发展计划委员会[Guo2 jia1 Fa1 zhan3 Ji4 hua4 Wei3 yuan2 hui4] then in 2003 by National Development and Reform Commission 國家發展和改革委員會|国家发展和改革委员会[Guo2 jia1 Fa1 zhan3 he2 Gai3 ge2 Wei3 yuan2 hui4]"],"pinyin":["Guo2 jia1 Ji4 hua4 Wei3 yuan2 hui4"],"word":"国家计划委员会"},{"definition":["Beijing-Shanghai High-Speed Railway, completed in 2010\/abbr. for 京滬高速鐵路|京沪高速铁路"],"pinyin":["Jing1 Hu4 gao1 tie3"],"word":"京沪高铁"},{"definition":["Ministry of Nuclear Industry"],"pinyin":["He2 gong1 ye4 bu4"],"word":"核工业部"},{"definition":["Commission for Science, Technology and Industry for National Defense (COSTIND)\/abbr. to 國防科工委|国防科工委[Guo2 fang2 Ke1 Gong1 Wei3]"],"pinyin":["Guo2 fang2 Ke1 xue2 Ji4 shu4 Gong1 ye4 Wei3 yuan2 hui4"],"word":"国防科学技术工业委员会"},{"definition":["All-China Federation of Trade Unions (ACFTU)"],"pinyin":["Zhong1 hua2 Quan2 guo2 Zong3 gong1 hui4"],"word":"中华全国总工会"},{"definition":["Military Commission of the Communist Party Central Committee"],"pinyin":["jun1 wei3"],"word":"军委"},{"definition":["nationalized industry"],"pinyin":["guo2 ying2 qi3 ye4"],"word":"国营企业"},{"definition":["Ministry of Supervision (MOS)"],"pinyin":["Jian1 cha2 bu4"],"word":"监察部"},{"definition":["PRC State Development and Planning Committee, set up 1998 to replace State Planning Committee 國家計劃委員會|国家计划委员会, replaced in 2003 by National Development and Reform Commission 國家發展和改革委員會|国家发展和改革委员会"],"pinyin":["Guo2 jia1 Fa1 zhan3 Ji4 hua4 Wei3 yuan2 hui4"],"word":"国家发展计划委员会"},{"definition":["General Armaments Department (GAD)"],"pinyin":["Zong3 Zhuang1 bei4 bu4"],"word":"总装备部"}]}