{"definition":["to destroy (by melting or burning)\/to obliterate"],"pinyin":["xiao1 hui3"],"traditional":["銷毀"],"rank":8626.0,"normalized_rank":0.12068893148461655,"fraction":0.000010580604372579706,"cumulative_fraction":0.91683251173906,"word":"销毁","characters":[{"definition":["to melt (metal)\/to cancel or annul\/to sell\/to spend\/to fasten with a bolt\/bolt or pin"],"pinyin":["xiao1"],"word":"销"},{"definition":["variant of 毀|毁[hui3]\/to destroy by fire\/a blaze","to destroy\/to damage\/to ruin\/to defame\/to slander","variant of 毀|毁[hui3]\/to defame\/to slander"],"pinyin":["hui3","hui3","hui3"],"word":"毁"}],"containing_words":[],"sentences":[{"english":"Entry form will be destroyed before the commencement of next Music Festival.","chinese":"报名表将于来届音乐节开始前销毁。"},{"english":"The data will be used for specific purposes only, and all indentifiable information would be discarded after the conference.","chinese":"这些资料只用作特定的用途，并于活动完结后销毁。"},{"english":"It may be destroyed and recreated.","chinese":"它可能被销毁并重新创建。"},{"english":"They returned in turn to bury the luxuries burnt in the burst.","chinese":"他们顺次返返来埋躲在爆炸中销毁的豪侈品。"},{"english":"According to Thoman, food waste and yard waste are currently all dumped in a pile together.","chinese":"托曼说，此刻食物垃圾和庭院销毁物都堆放在一路。"},{"english":"Some 44 million antipersonnel mines have been destroyed from stockpiles.","chinese":"库存的杀伤人员地雷已有4400万个被销毁了。"},{"english":"Illegal weapons are set aflame in Nairobi, Kenya.","chinese":"在内罗毕非法枪支被销毁，肯尼亚。"},{"english":"An ordinary video camera can be confiscated and its tape destroyed.","chinese":"一架普通的摄相机可能被没收或磁带被销毁。"},{"english":"China has all along supported and advocated complete prohibition and thorough destruction of nuclear weapons.","chinese":"中国一贯主张并积极倡导全面禁止和彻底销毁核武器。"},{"english":"Whether to ask for confirmation when expunging appointments and tasks.","chinese":"销毁约会和任务时是否要求确认。"},{"english":"My bad habits must be destroyed and new furrows prepared for good seed.","chinese":"我的坏习惯必须销毁，新沟准备好种子。"},{"english":"The principle and merits of which thermite is used for combustion destruction of ammunition are expatiated.","chinese":"阐述了高热剂燃烧销毁弹药的原理和优点。"},{"english":"The marijuana he carried was confiscated and destroyed, according to police. (Chris Hondros\/Getty Images)","chinese":"根据警方的消息，他携带的大麻被已没收和销毁。"},{"english":"Scope memory areas can be created and destroyed under programmer control.","chinese":"程序员可以控制作用域内存区域的创建和销毁。"},{"english":"Illegal firearms are displayed before being destroyed in Panama City.","chinese":"巴拿马城，非法枪支在销毁之前被摆在地上。"},{"english":"On the seventh day, I had to destroy those unsent letters which might serve as evidence of my crime.","chinese":"第七天，未寄出去的信，如犯罪的证据必须销毁。"}],"related":[{"definition":["to recover (illegally obtained property)\/to seize\/to capture\/to force sb to hand over sth\/to levy"],"pinyin":["shou1 jiao3"],"word":"收缴"},{"definition":["to detain\/to hold in custody\/to distrain\/to seize property"],"pinyin":["kou4 ya1"],"word":"扣押"},{"definition":["to sequester\/to seal up (for safe keeping)\/to freeze (an account)\/to mothball"],"pinyin":["feng1 cun2"],"word":"封存"},{"definition":["to detain\/to arrest\/to hold\/to confiscate"],"pinyin":["kou4 liu2"],"word":"扣留"},{"definition":["to discard\/to abandon"],"pinyin":["diu1 qi4"],"word":"丢弃"},{"definition":["to tear up\/to rip up\/too shred"],"pinyin":["si1 hui3"],"word":"撕毁"},{"definition":["to smuggle"],"pinyin":["tou1 yun4"],"word":"偷运"},{"definition":["to cause damage to\/to ruin\/to destroy"],"pinyin":["sun3 hui3"],"word":"损毁"},{"definition":["to sequester\/to seize (assets)\/to seal up\/to close down"],"pinyin":["cha2 feng1"],"word":"查封"},{"definition":["to remove\/to take away"],"pinyin":["qu3 zou3"],"word":"取走"},{"definition":["to transfer\/to hand over"],"pinyin":["yi2 jiao1"],"word":"移交"},{"definition":["to intercept\/to cut off and capture"],"pinyin":["jie2 huo4"],"word":"截获"},{"definition":["to capture\/to seize"],"pinyin":["jiao3 huo4"],"word":"缴获"},{"definition":["to investigate thoroughly\/to carefully inspect\/to verify\/to ferret out (undesirable elements)"],"pinyin":["qing1 cha2"],"word":"清查"},{"definition":["to damage\/to devastate\/to vandalize\/damage\/destruction"],"pinyin":["hui3 huai4"],"word":"毁坏"},{"definition":["meltdown\/(of nuclear fuel) to melt down"],"pinyin":["rong2 hui3"],"word":"熔毁"}]}