{"definition":["Changbai Korean autonomous county in Baishan 白山, Jilin"],"pinyin":["Chang2 bai2"],"traditional":["長白"],"rank":24642.0,"normalized_rank":0.3447735508513705,"fraction":0.0000015292616190056013,"cumulative_fraction":0.9837521565820401,"word":"长白","characters":[{"definition":["length\/long\/forever\/always\/constantly","chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance"],"pinyin":["chang2","zhang3"],"word":"长"},{"definition":["surname Bai","white\/snowy\/pure\/bright\/empty\/blank\/plain\/clear\/to make clear\/in vain\/gratuitous\/free of charge\/reactionary\/anti-communist\/funeral\/to stare coldly\/to write wrong character\/to state\/to explain\/vernacular\/spoken lines in opera"],"pinyin":["Bai2","bai2"],"word":"白"}],"containing_words":[{"definition":["Changbai or Baekdu mountains 白頭山|白头山, volcanic mountain range between Jilin province and North Korea, prominent in Manchu and Korean mythology"],"pinyin":["Chang2 bai2 shan1"],"word":"长白山"},{"definition":["Changbai Korean autonomous county in Baishan 白山, Jilin"],"pinyin":["Chang2 bai2 xian4"],"word":"长白县"},{"definition":["Changbai Korean autonomous county in Baishan 白山[Bai2 shan1], Jilin"],"pinyin":["Chang2 bai2 Chao2 xian3 zu2 Zi4 zhi4 xian4"],"word":"长白朝鲜族自治县"},{"definition":["Changbaishan Tianchi, volcanic crater lake on the border between China and North Korea"],"pinyin":["Chang2 bai2 shan1 Tian1 chi2"],"word":"长白山天池"},{"definition":["Changbai township, capital of Changbai Korean autonomous county in Baishan 白山, Jilin"],"pinyin":["Chang2 bai2 zhen4"],"word":"长白镇"}],"sentences":[{"english":"Florogeography of vascular plants in alpine tundra of the Changbai Mountain.","chinese":"长白山高山冻原维管植物区系地理。"},{"english":"It is a region inhabited by an overwhelming majority of the Korean minority nationality in China.","chinese":"长白山区，是我国朝鲜族同胞的主要聚居地。"},{"english":"There are abundant wild aromatic plant resources in Changbai Mountains, where the climate is temperate.","chinese":"长白山区属温带气候，野生芳香植物资源十分丰富。"},{"english":"Wang(Papaveraceae) is a valuable drug in Changbai Mountains.","chinese":"的干燥块茎，是长白山区珍贵药用植物之一。"},{"english":"There is abundant wild pestkilling plant resources in Changbai Mountains, where the climate is temperate.","chinese":"长白山区属温带气候，野生杀虫植物资源十分丰富。"},{"english":"OBJECTIVE To identify the best technique of extraction process of whole alkaloid from Aralia continentalis Kitagwa.","chinese":"目的确定长白楤木中总生物碱提取的最佳工艺。"},{"english":"The Changbai Mountain looks like a the chaotic world in prehistoric times, has a kind of mystical color.","chinese":"长白山像个混沌初开的世界，有一种神秘色彩。"},{"english":"Large Yorkshire had highly significant differences with Landrace pig.","chinese":"外来猪种间只有大约克和长白间差异显著。"},{"english":"Vegetation characteristics and functional division of Tricholoma matsutake habitat in Mt.","chinese":"研究了长白山松茸发生地的植被特征及功能分区。"},{"english":"Changchun and its majestic surroundings will put tourists on top of the world.","chinese":"长白山及其宏伟的周边将会使游客欣喜若狂。"},{"english":"I have a long way to go.","chinese":"我有很长白勺路要走。"},{"english":"The grape is a pure natural, pollution-free specialty precious Changbai Mountains.","chinese":"所用葡萄是纯天然，无污染的长白山脉珍贵特产。"},{"english":"The climate of Changbaishan is Alpine Climate of monsoon types in the temperate zonal continent.","chinese":"长白山是温带大陆季风型高山气候。"},{"english":"This article discussed the distribution of major and trace elements of peat in Yuanchi, Changbai Mountain.","chinese":"探讨了长白山圆池泥炭常量和微量元素的分布规律。"},{"english":"The area covered by Changbai Mountains has a temperate climate and is rich in officinal plants.","chinese":"长白山区属温带气候，野生药用植物资源十分丰富。"},{"english":"This is a little pretty girl, named Lele, who went to the Changbai Mountain together with me.","chinese":"这是同去长白山游玩的一位小美女，名叫乐乐。"}],"related":[{"definition":["Baishan prefecture-level city in Jilin province 吉林省 in northeast China"],"pinyin":["Bai2 shan1"],"word":"白山"},{"definition":["Kongtong district of Pingliang city 平涼市|平凉市[Ping2 liang2 shi4], Gansu"],"pinyin":["Kong1 tong2"],"word":"崆峒"},{"definition":["Penglai county level city in Yantai 煙台|烟台, Shandong\/Penglai, one of three fabled islands in Eastern sea, abode of immortals\/by extension, fairyland"],"pinyin":["Peng2 lai2"],"word":"蓬莱"},{"definition":["Tianshan mountain range between XinJiang and Mongolia and Kyrgyzstan"],"pinyin":["Tian1 shan1"],"word":"天山"},{"definition":["Kunlun (Karakorum) mountain range in Xinjiang"],"pinyin":["Kun1 lun2"],"word":"昆仑"},{"definition":["Qingyuan county in Fushun 撫順|抚顺, Liaoning"],"pinyin":["Qing1 yuan2"],"word":"清原"},{"definition":["black bamboo (Phyllostachys nigra)"],"pinyin":["zi3 zhu2"],"word":"紫竹"},{"definition":["Shushan district of Hefei city 合肥市[He2 fei2 shi4], Anhui"],"pinyin":["Shu3 shan1"],"word":"蜀山"},{"definition":["manor house\/villa\/(used in hotel names)"],"pinyin":["shan1 zhuang1"],"word":"山庄"},{"definition":["\"heavenly lake\", lake situated on a mountain\/used as the name of numerous lakes, such as 長白山天池|长白山天池[Chang2 bai2 shan1 Tian1 chi2]","Lake Tianchi in Xinjiang"],"pinyin":["tian1 chi2","Tian1 chi2"],"word":"天池"},{"definition":["Dragon mountain\/Longshan district of Liaoyuan city 遼源市|辽源市, Jilin\/Longshan county in Xiangxi Tujia and Miao autonomous prefecture 湘西土家族苗族自治州[Xiang1 xi1 Tu3 jia1 zu2 Miao2 zu2 zi4 zhi4 zhou1]"],"pinyin":["Long2 shan1"],"word":"龙山"},{"definition":["Lianyun district of Lianyungang city 連雲港市|连云港市[Lian2 yun2 gang3 shi4], Jiangsu"],"pinyin":["Lian2 yun2"],"word":"连云"},{"definition":["Polaris\/North Star"],"pinyin":["Bei3 chen2"],"word":"北辰"},{"definition":["Ziyun Hmong and Buyei autonomous county in Anshun 安順|安顺[An1 shun4], Guizhou"],"pinyin":["Zi3 yun2"],"word":"紫云"},{"definition":["Mt Song in Henan, central mountain of the Five Sacred Mountains 五嶽|五岳[Wu3 yue4]"],"pinyin":["Song1 Shan1"],"word":"嵩山"},{"definition":["Jinyang county in Liangshan Yi autonomous prefecture 涼山彞族自治州|凉山彝族自治州[Liang2 shan1 Yi2 zu2 zi4 zhi4 zhou1], south Sichuan"],"pinyin":["Jin1 yang2"],"word":"金阳"}]}