{"definition":["Changbai or Baekdu mountains 白頭山|白头山, volcanic mountain range between Jilin province and North Korea, prominent in Manchu and Korean mythology"],"pinyin":["Chang2 bai2 shan1"],"traditional":["長白山"],"rank":22692.0,"normalized_rank":0.31749052089600266,"fraction":0.000001837712344564864,"cumulative_fraction":0.9804804638212729,"word":"长白山","characters":[{"definition":["length\/long\/forever\/always\/constantly","chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance"],"pinyin":["chang2","zhang3"],"word":"长"},{"definition":["surname Bai","white\/snowy\/pure\/bright\/empty\/blank\/plain\/clear\/to make clear\/in vain\/gratuitous\/free of charge\/reactionary\/anti-communist\/funeral\/to stare coldly\/to write wrong character\/to state\/to explain\/vernacular\/spoken lines in opera"],"pinyin":["Bai2","bai2"],"word":"白"},{"definition":["surname Shan","mountain\/hill\/anything that resembles a mountain\/CL:座[zuo4]\/bundled straw in which silkworms spin cocoons\/gable"],"pinyin":["Shan1","shan1"],"word":"山"}],"containing_words":[{"definition":["Changbaishan Tianchi, volcanic crater lake on the border between China and North Korea"],"pinyin":["Chang2 bai2 shan1 Tian1 chi2"],"word":"长白山天池"}],"sentences":[{"english":"Florogeography of vascular plants in alpine tundra of the Changbai Mountain.","chinese":"长白山高山冻原维管植物区系地理。"},{"english":"It is a region inhabited by an overwhelming majority of the Korean minority nationality in China.","chinese":"长白山区，是我国朝鲜族同胞的主要聚居地。"},{"english":"There are abundant wild aromatic plant resources in Changbai Mountains, where the climate is temperate.","chinese":"长白山区属温带气候，野生芳香植物资源十分丰富。"},{"english":"Wang(Papaveraceae) is a valuable drug in Changbai Mountains.","chinese":"的干燥块茎，是长白山区珍贵药用植物之一。"},{"english":"There is abundant wild pestkilling plant resources in Changbai Mountains, where the climate is temperate.","chinese":"长白山区属温带气候，野生杀虫植物资源十分丰富。"},{"english":"The Changbai Mountain looks like a the chaotic world in prehistoric times, has a kind of mystical color.","chinese":"长白山像个混沌初开的世界，有一种神秘色彩。"},{"english":"Vegetation characteristics and functional division of Tricholoma matsutake habitat in Mt.","chinese":"研究了长白山松茸发生地的植被特征及功能分区。"},{"english":"Changchun and its majestic surroundings will put tourists on top of the world.","chinese":"长白山及其宏伟的周边将会使游客欣喜若狂。"},{"english":"The grape is a pure natural, pollution-free specialty precious Changbai Mountains.","chinese":"所用葡萄是纯天然，无污染的长白山脉珍贵特产。"},{"english":"The climate of Changbaishan is Alpine Climate of monsoon types in the temperate zonal continent.","chinese":"长白山是温带大陆季风型高山气候。"},{"english":"This article discussed the distribution of major and trace elements of peat in Yuanchi, Changbai Mountain.","chinese":"探讨了长白山圆池泥炭常量和微量元素的分布规律。"},{"english":"The area covered by Changbai Mountains has a temperate climate and is rich in officinal plants.","chinese":"长白山区属温带气候，野生药用植物资源十分丰富。"},{"english":"This is a little pretty girl, named Lele, who went to the Changbai Mountain together with me.","chinese":"这是同去长白山游玩的一位小美女，名叫乐乐。"},{"english":"Roads: Chang Bai Shan Road connects Shuang Yuan Road.","chinese":"长白山路连接双元路。"},{"english":"From the snow-capped Changbai Mountains down to the vast South China Sea frontier.","chinese":"从白雪皑皑的长白山下到辽阔的南海边疆。"},{"english":"The legal representative has engaged in wild ginseng of Changbai Mountain for forty years.","chinese":"企业法人从事长白山山参研究有四十多年的实践。"}],"related":[{"definition":["Changbaishan Tianchi, volcanic crater lake on the border between China and North Korea"],"pinyin":["Chang2 bai2 shan1 Tian1 chi2"],"word":"长白山天池"},{"definition":["Wudalianchi county level city in Heihe 黑河[Hei1 he2], Heilongjiang"],"pinyin":["Wu3 da4 lian2 chi2"],"word":"五大连池"},{"definition":["Arxan county level city, Mongolian Rashaant xot, in Hinggan league 興安盟|兴安盟[Xing1 an1 meng2], east Inner Mongolia"],"pinyin":["A1 er3 shan1"],"word":"阿尔山"},{"definition":["Daxing'anling mountain range in northwest Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China\/Daxing'anling prefecture"],"pinyin":["Da4 xing1 an1 ling3"],"word":"大兴安岭"},{"definition":["Chinese name for Sichote-Alin mountain range in Russia's Primorsky Krai around Vladivostok"],"pinyin":["Lao3 ye5 ling3"],"word":"老爷岭"},{"definition":["Mohe county in Daxing'anling prefecture 大興安嶺地區|大兴安岭地区, Heilongjiang"],"pinyin":["Mo4 he2"],"word":"漠河"},{"definition":["Fusong county in Baishan 白山, Jilin"],"pinyin":["Fu3 song1 xian4"],"word":"抚松县"},{"definition":["\"heavenly lake\", lake situated on a mountain\/used as the name of numerous lakes, such as 長白山天池|长白山天池[Chang2 bai2 shan1 Tian1 chi2]","Lake Tianchi in Xinjiang"],"pinyin":["tian1 chi2","Tian1 chi2"],"word":"天池"},{"definition":["Huanren Manchu autonomous county in Benxi 本溪, Liaoning"],"pinyin":["Huan2 ren2"],"word":"桓仁"},{"definition":["Jiagedaqi district of Daxing'anling prefecture 大興安嶺地區|大兴安岭地区, in northwest Heilongjiang and northeast Inner Mongolia"],"pinyin":["Jia1 ge2 da2 qi2"],"word":"加格达奇"},{"definition":["Tonghua prefecture level city in Jilin province 吉林省 in northeast China\/also Tonghua county"],"pinyin":["Tong1 hua4"],"word":"通化"},{"definition":["Songling district of Daxing'anling prefecture 大興安嶺地區|大兴安岭地区, Heilongjiang"],"pinyin":["Song1 ling3"],"word":"松岭"},{"definition":["Daxing'anling prefecture in northwest Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Da4 xing1 an1 ling3 di4 qu1"],"word":"大兴安岭地区"},{"definition":["Hulunbuir prefecture-level city in Inner Mongolia"],"pinyin":["Hu1 lun2 bei4 er3"],"word":"呼伦贝尔"},{"definition":["Tangwanghe district of Yichun city 伊春市[Yi1 chun1 shi4], Heilongjiang"],"pinyin":["Tang1 wang4 he2"],"word":"汤旺河"},{"definition":["Changbai Korean autonomous county in Baishan 白山[Bai2 shan1], Jilin"],"pinyin":["Chang2 bai2 Chao2 xian3 zu2 Zi4 zhi4 xian4"],"word":"长白朝鲜族自治县"}]}