{"definition":["immortality"],"pinyin":["chang2 sheng1 bu4 lao3"],"traditional":["長生不老"],"rank":39660.0,"normalized_rank":0.5548948553999412,"fraction":3.9705914506445545e-7,"cumulative_fraction":0.9963558099977142,"word":"长生不老","characters":[{"definition":["length\/long\/forever\/always\/constantly","chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance"],"pinyin":["chang2","zhang3"],"word":"长"},{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"}],"containing_words":[],"sentences":[{"english":"Houyi some magic pills that could make him live forever.","chinese":"他给了后羿一些能使他长生不老的仙丹。"},{"english":"It is said that drinking the water of Heaven Spring Waterfall will make one long-lived.","chinese":"据说常喝天泉瀑的水能长生不老。"},{"english":"Elixirs are concentrated alcohol extractions that are similar to both teas and tinctures .","chinese":"长生不老药是浓缩的酒精萃取物，类似于茶和酊剂。"},{"english":"And\" tender is the way to make your life and keep the love ever-young of medicine.\"","chinese":"而且“温柔是使人生和爱情保持长生不老的仙药。”"},{"english":"People in ancient times spent a fortune on elixirs for fear of dying.","chinese":"古时候的人因为怕死，因此花很多钱在长生不老药。"},{"english":"She ascended from earth to live on the moon as a celestial being after drinking an elixir.","chinese":"她吃下长生不老药后化作仙女，从地球升到了月球上。"},{"english":"Accompanied Chang, and ramming system elixir.","chinese":"陪同嫦娥，并捣制长生不老药。"},{"english":"I have developed a new product that is the fountain of youth.","chinese":"我研发出了一种长生不老泉。"},{"english":"She’d want to know how doctors ended up curing cancer and senility.","chinese":"她会想知道医生们是如何治愈癌症并使人长生不老。"},{"english":"Kombucha can be traced back to ancient China where it was worshipped as a remedy for immortality.","chinese":"康普茶可追溯到古代中国，它作为长生不老药被崇拜。"},{"english":"All you have to do is stay down there and sniff it and you can live forever.","chinese":"你只要呆在井里闻闻它，你就可以长生不老了。"},{"english":"Chang'e and her husband Houyi were immortals who lived in Heaven.","chinese":"嫦娥和她的丈夫后羿长生不老的生活在天上。"},{"english":"Enthusiasm is that long-sought-after fountain of eternal life.","chinese":"热忱是古今中外人们所追求的长生不老之泉。"},{"english":"Who's to say they couldn't eat of that and just live forever?","chinese":"有谁说过不要吃生命树，吃了便能长生不老？"},{"english":"Are if you have 2 elixirs, you met to who to eat?","chinese":"如果你有2颗长生不老药你会把给谁吃？"},{"english":"But Chu was an old man, and nobody lives forever.","chinese":"老楚年纪大了，没人能长生不老。"}],"related":[{"definition":["immortality"],"pinyin":["chang2 sheng1 bu4 si3"],"word":"长生不死"},{"definition":["legendary magic potion of immortals\/panacea\/fig. wonder solution to a problem"],"pinyin":["xian1 yao4"],"word":"仙药"},{"definition":["to become immortal"],"pinyin":["cheng2 xian1"],"word":"成仙"},{"definition":["long life"],"pinyin":["chang2 sheng1"],"word":"长生"},{"definition":["to grow old with unfailing eyes and ears (idiom)"],"pinyin":["chang2 sheng1 jiu3 shi4"],"word":"长生久视"},{"definition":["to make life longer\/to promise longevity\/(this product will) extend your life"],"pinyin":["yan2 nian2 yi4 shou4"],"word":"延年益寿"},{"definition":["Daoist immortal\/supernatural entity\/(in modern fiction) fairy, elf, leprechaun etc\/fig. lighthearted person"],"pinyin":["shen2 xian1"],"word":"神仙"},{"definition":["to stay young forever"],"pinyin":["qing1 chun1 yong3 zhu4"],"word":"青春永驻"},{"definition":["elixir\/magic potion"],"pinyin":["xian1 dan1"],"word":"仙丹"},{"definition":["prescription of elixir\/potion of immortality\/potion prescribed by an immortal"],"pinyin":["xian1 fang1"],"word":"仙方"},{"definition":["flat peach (aka Saturn peach or donut peach)\/the peaches of immortality kept by Xi Wangmu 西王母"],"pinyin":["pan2 tao2"],"word":"蟠桃"},{"definition":["Xu Fu (3rd century BC), Qin dynasty court necromancer"],"pinyin":["Xu2 Fu2"],"word":"徐福"},{"definition":["to recover one's youthful vigor\/to feel rejuvenated (idiom)"],"pinyin":["fan3 lao3 huan2 tong2"],"word":"返老还童"},{"definition":["to achieve the Dao\/to become an immortal"],"pinyin":["de2 dao4"],"word":"得道"},{"definition":["alchemist\/necromancer"],"pinyin":["fang1 shi4"],"word":"方士"},{"definition":["to maintain a youthful appearance"],"pinyin":["zhu4 yan2"],"word":"驻颜"}]}