{"definition":["to close by coming together (like the lips of a wound, the doors of an elevator, the walls of a channel)\/to close by connecting in a loop (like a circuit)\/closed-loop"],"pinyin":["bi4 he2"],"traditional":["閉合"],"rank":26796.0,"normalized_rank":0.3749108054789921,"fraction":0.0000012592030093110269,"cumulative_fraction":0.9867446354542868,"word":"闭合","characters":[{"definition":["to close\/to stop up\/to shut\/to obstruct"],"pinyin":["bi4"],"word":"闭"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]","variant of 合[he2]"],"pinyin":["ge3","he2","he2"],"word":"合"}],"containing_words":[],"sentences":[{"english":"Breathe out through pursed lips as if you were whistling.","chinese":"从闭合嘴唇中呼气，就好像在吹口哨。"},{"english":"The racquet face is a bit closed, so she'll generate some topspin.","chinese":"她现在的拍面是闭合的，因此她就可以加上点上旋。"},{"english":"Behindher, the first gate closed, trapping them like a ship in a lock.","chinese":"第一个门缓缓地合上了，就像一道闭合的船闸。"},{"english":"Hold the fingers straight and then close them against the thumb.","chinese":"将四只手指竖直并拢并向大拇指方向闭合即可。"},{"english":"Inside the plastic clip are pieces of metal that close a circuit when the jumper is in place.","chinese":"塑料夹套内部是金属线，当跳线就位时可以闭合电路。"},{"english":"Ray shielding can play a role when Xray room is completely closed.","chinese":"光室必须完全闭合才能起到屏蔽射线的作用。"},{"english":"The hinges are self-closing the last few centimetres, leaving the door fully closed.","chinese":"合页在最后的几厘米自动关闭，使门完全闭合。"},{"english":"Adjustable hook-and-loop closure strap keeps shoes secure.","chinese":"可调的钩环闭合背带保持鞋的安全。"},{"english":"This makes a close circuit.","chinese":"这就构成了一个闭合电路。"},{"english":"The contact that closes when the coil is energized is called normally open.","chinese":"当线圈充电时触点闭合，称为常开触点。"},{"english":"Relay which uses the electromagnetic field of a coil to attract an armature and close the contact points.","chinese":"利用吸引线圈产生磁场，吸引衔铁并闭合触点。"},{"english":"Hook-and-loop closure for a customizable fit.","chinese":"一个可定制的适合的钩环闭合。"},{"english":"Ensure that the pack is properly resealed to prevent wipes drying out.","chinese":"确保包装封口闭合，防止净肤棉脱水变干。"},{"english":"The full extent of the form is visible when the lid is closed.","chinese":"当盖被闭合时，能看到形体的整个范围。"},{"english":"Main deck E. R. entrance door port-door closer missing.","chinese":"主甲板机舱左舷入口门没有闭合器。"},{"english":"Receptiveness was regarded as the time between flower opening and closure.","chinese":"自花朵开放到闭合的时间被看成是可受期。"}],"related":[{"definition":["to close (flower, eyes, suitcase etc)\/to bring together\/(insect or bird when not flying) to fold (its wings)"],"pinyin":["he2 long3"],"word":"合拢"},{"definition":["to lock"],"pinyin":["bi4 suo3"],"word":"闭锁"},{"definition":["to break\/to sever\/to turn off (electric switch)"],"pinyin":["duan4 kai1"],"word":"断开"},{"definition":["(of uneven surfaces) to fit together\/(of gear wheels) to mesh\/(dentistry) occlusion\/bite"],"pinyin":["yao3 he2"],"word":"咬合"},{"definition":["to open and close"],"pinyin":["kai1 he2"],"word":"开合"},{"definition":["to drop off\/to come off\/to lose (hair etc)\/to omit (a character when writing)"],"pinyin":["tuo1 luo4"],"word":"脱落"},{"definition":["to droop\/to sag\/to hang down\/sagging\/drooping\/prolapse (medicine)"],"pinyin":["xia4 chui2"],"word":"下垂"},{"definition":["close-fitting\/tightly sealed"],"pinyin":["mi4 he2"],"word":"密合"},{"definition":["to seal\/to close\/to confine\/to seal off\/to close down\/sealed\/confined\/closed\/unreceptive"],"pinyin":["feng1 bi4"],"word":"封闭"},{"definition":["fontanel (gap between the bones of an infant's skull)"],"pinyin":["xin4 men2"],"word":"囟门"},{"definition":["small crack\/chink"],"pinyin":["feng4 xi4"],"word":"缝隙"},{"definition":["window\/chimney"],"pinyin":["cong1 men2"],"word":"囱门"},{"definition":["to clog up\/blockage"],"pinyin":["du3 se4"],"word":"堵塞"},{"definition":["annular\/toroidal\/loop-shaped\/ring-like"],"pinyin":["huan2 zhuang4"],"word":"环状"},{"definition":["to rotate (about an axis)\/to revolve\/to turn\/to move in a circle\/to gyrate","to turn sth around\/to swivel"],"pinyin":["zhuan4 dong4","zhuan3 dong4"],"word":"转动"},{"definition":["ovary"],"pinyin":["luan3 chao2 wo1"],"word":"卵巢窝"}]}