{"definition":["to hold accountable\/to blame\/to censure\/to apportion blame"],"pinyin":["wen4 ze2"],"traditional":["問責"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"问责","characters":[{"definition":["to ask"],"pinyin":["wen4"],"word":"问"},{"definition":["duty\/responsibility\/to reproach\/to blame"],"pinyin":["ze2"],"word":"责"}],"containing_words":[{"definition":["accountability"],"pinyin":["wen4 ze2 xing4"],"word":"问责性"}],"sentences":[{"english":"You need oversight and accountability.","chinese":"你们需要监管和问责。"},{"english":"We set up a mechanism to inspect and establish accountability for the implementation of major government policies and introduced third-party evaluations.","chinese":"建立重大政策落实督查问责机制，开展第三方评估。"},{"english":"Mattil said the Office of Accountability and Transparency was dismantled last December.","chinese":"马蒂尔说，问责与透明办公室去年12月解散了。"},{"english":"Accountability is the practice of administrative accountability system development and improvement of the social infrastructure.","chinese":"问责实践是行政问责轨制发铺与完美的社会基本。"},{"english":"The establishment of administrative accountability system in our country soon, And accountability is still in the consubstantial Accountability stage.","chinese":"我国行政问责制度建立不久，尚处于同体问责阶段。"},{"english":"Wuhan punishes 109 officials for neglecting their duties.","chinese":"武汉公务员治庸行动问责109名干部。"},{"english":"Third, we will establish sound evaluation and accountability mechanisms.","chinese":"三是建立健全考核问责机制。"},{"english":"It also means accountability mechanisms and voice of public and citizens groups.","chinese":"它也意味着问责机制和公众及公民组织的话语权。"},{"english":"Why are we using different wordings to measure the support rates of CE and the principal officials?","chinese":"为什么特首和问责官员的支持率采用不同提问方式？"},{"english":"Maybe he should resign in the spirit of accountability in Hong Kong.","chinese":"也许他应该辞职以体现香港的问责精神。"},{"english":"How does the accountability he champions apply to those foreign-policy intellectuals?","chinese":"对这部分知识分子又应该如何问责？"},{"english":"Where it really lags is in measures of responsiveness and accountability.","chinese":"而这也是埃及最缺乏反应能力和问责机制的部门。"},{"english":"Social rights, rights for the people, welfare among the people and the state, participatory welfare, responsible government for the Society.","chinese":"社会权权泽于民家国福祉福祉参享为福利而问责。"},{"english":"The GAO’s very first recommendation is that this report be released to the public.","chinese":"政府问责总署的第一个建议是，向公众公布这一报告。"},{"english":"Fifth, we must strengthen supervision and oversight and improve the accountability mechanism in order to seriously put it into practice.","chinese":"五要加强督促检查，完善问责机制，严肃责任追究。"},{"english":"Compared to one month ago, the popularity of practically all Principal Officials has increased.","chinese":"与一个月前相比，问责官员的民望差不多全部上升。"}],"related":[{"definition":["responsible person\/coordinator"],"pinyin":["ze2 ren4 ren2"],"word":"责任人"},{"definition":["breach of responsibility\/failure to carry out one's duty"],"pinyin":["shi1 ze2"],"word":"失责"},{"definition":["wrongdoing\/failure to do one's duty"],"pinyin":["du2 zhi2"],"word":"渎职"},{"definition":["to punish\/to administer justice"],"pinyin":["cheng2 chu3"],"word":"惩处"},{"definition":["to supervise\/to superintend\/inspector\/censorship"],"pinyin":["du1 cha2"],"word":"督察"},{"definition":["to investigate and handle (a criminal case)"],"pinyin":["cha2 ban4"],"word":"查办"},{"definition":["to relieve sb of his post\/to sack\/to demote\/dismissal\/sacking"],"pinyin":["mian3 zhi2"],"word":"免职"},{"definition":["to skimp on the job\/to work half-heartedly\/not to take the job seriously"],"pinyin":["fu1 yan3 se4 ze2"],"word":"敷衍塞责"},{"definition":["rules for political staff\/political discipline"],"pinyin":["zheng4 ji4"],"word":"政纪"},{"definition":["to eliminate\/to sack\/to remove from office"],"pinyin":["che4 zhi2"],"word":"撤职"},{"definition":["to neglect one's duty\/dereliction of duty\/malpractice"],"pinyin":["wan2 hu1 zhi2 shou3"],"word":"玩忽职守"},{"definition":["to punish"],"pinyin":["cheng2 zhi4"],"word":"惩治"},{"definition":["not to do one's best\/not to exert oneself"],"pinyin":["bu4 li4"],"word":"不力"},{"definition":["to direct\/to oversee"],"pinyin":["du1 dao3"],"word":"督导"},{"definition":["to reform\/to rectify and improve"],"pinyin":["zheng3 gai3"],"word":"整改"},{"definition":["strict\/rigorous\/severely"],"pinyin":["cong2 yan2"],"word":"从严"}]}