{"definition":["to expound (a position)\/to elaborate (on a topic)\/to treat (a subject)"],"pinyin":["chan3 shu4"],"traditional":["闡述"],"rank":7058.0,"normalized_rank":0.09875057714101827,"fraction":0.000014578493639447442,"cumulative_fraction":0.8973670836275098,"word":"阐述","characters":[{"definition":["to express\/to disclose\/to enlighten\/to open"],"pinyin":["chan3"],"word":"阐"},{"definition":["to state\/to tell\/to narrate\/to relate"],"pinyin":["shu4"],"word":"述"}],"containing_words":[],"sentences":[{"english":"The Rapid Displacement Heating (RDH) cooking process has been developed by Beloit Corporation as an energy efficient pulping system.","chinese":"阐述了快速置换加热间歇蒸煮化学和技术的原理。"},{"english":"Objective To review the recent developments in the research of oxazolidinone antibacterial drugs.","chinese":"目的阐述恶唑烷酮类抗菌药物的最新研究进展。"},{"english":"The application principles and methods are demonstrated of nuclear radiation technique in gemmology.","chinese":"阐述了核辐照技术在宝石学中的应用原理和方法。"},{"english":"In the first part, the author explain the meaning of medium-small investor.","chinese":"论文第一章首先阐述了投资者和中小投资者的内涵。"},{"english":"This article Legionella disease related to recent research carried out on the preliminary.","chinese":"本文就军团菌病有关研究近况进行了初步阐述。"},{"english":"The water feed whole-course control system used in China-bult 300MW unit is described.","chinese":"阐述了国产300MW机组的锅炉给水全程控制系统。"},{"english":"The illumination energy saving on Dayaowan container stack yard is dismissed based on the illumination theory.","chinese":"从照明原理阐述大窑湾集装箱堆场高杆灯照明节能。"},{"english":"Finally, elaborated the tax revenue drafts accepts relational the concept and the characteristic.","chinese":"最后，阐述了税收征纳关系的概念和特征。"},{"english":"The fourth chapter focuses on the apocalypse and a second think of patent pools.","chinese":"第四章阐述了专利池所带来的启示的反思。"},{"english":"Elaborated in the industrialization production the steamed bun anti-aging engineering research present situation.","chinese":"阐述了工业化生产中馒头抗老化技术研究现状。"},{"english":"It elaborates the factors influencing forestland value.","chinese":"阐述了影响林地价值的因素。"},{"english":"Chapter four sum up the basic characteristic and the last sum up great meaning of Ren Bishi's Party building thought.","chinese":"第五章主要阐述任弼时的党建思想的重大意义。"},{"english":"And it detailedly expatiates the frame synchronization and the network synchronization methods.","chinese":"详细阐述了帧同步和网同步方法。"},{"english":"The innovations of my thesis are generalized in the fifth part.","chinese":"在第五部分中，概括性地阐述了发生额法的创新之处。"},{"english":"Infliximab and its side-effect profile are discussed, along with other associated complications.","chinese":"针对英利昔单抗的副作用和相关并发症进行了阐述。"},{"english":"This paper dwells the concepts of retrogressive aggradation and the datum of erosion.","chinese":"本文阐述了溯源淤积和侵蚀基准面的概念。"}],"related":[{"definition":["to explain\/to expound\/to interpret\/elucidation"],"pinyin":["chan3 shi4"],"word":"阐释"},{"definition":["treatise\/discourse\/exposition"],"pinyin":["lun4 shu4"],"word":"论述"},{"definition":["to elucidate\/to explain clearly\/to expound"],"pinyin":["chan3 ming2"],"word":"阐明"},{"definition":["to analyze\/to dissect"],"pinyin":["pou1 xi1"],"word":"剖析"},{"definition":["to formulate\/enunciation\/to explain sth precisely"],"pinyin":["biao3 shu4"],"word":"表述"},{"definition":["to investigate\/to probe"],"pinyin":["tan4 tao3"],"word":"探讨"},{"definition":["to recount"],"pinyin":["xiang2 shu4"],"word":"详述"},{"definition":["to summarize\/to generalize\/briefly\/CL:個|个[ge4]"],"pinyin":["gai4 kuo4"],"word":"概括"},{"definition":["concise\/brief"],"pinyin":["jian3 yao4"],"word":"简要"},{"definition":["to comment on\/commentary"],"pinyin":["ping2 shu4"],"word":"评述"},{"definition":["to describe\/description"],"pinyin":["miao2 shu4"],"word":"描述"},{"definition":["to relate (a story or information)\/to tell or talk about\/to recount\/narration\/telling\/narrative\/account"],"pinyin":["xu4 shu4"],"word":"叙述"},{"definition":["to show\/to make known"],"pinyin":["jie1 shi4"],"word":"揭示"},{"definition":["explanation\/to explain\/to interpret\/to resolve\/CL:個|个[ge4]"],"pinyin":["jie3 shi4"],"word":"解释"},{"definition":["a list\/to list\/to enumerate"],"pinyin":["lie4 ju3"],"word":"列举"},{"definition":["to prove a point\/to expound on\/to demonstrate or prove (through argument)\/proof"],"pinyin":["lun4 zheng4"],"word":"论证"}]}