{"definition":["to prevent and control (e.g. the spread of a communicable disease)"],"pinyin":["fang2 kong4"],"traditional":["防控"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"防控","characters":[{"definition":["to protect\/to defend\/to guard against\/to prevent"],"pinyin":["fang2"],"word":"防"},{"definition":["to control\/to accuse\/to charge\/to sue\/to invert a container to empty it\/(suffix) (slang) buff\/enthusiast\/devotee\/-phile or -philia"],"pinyin":["kong4"],"word":"控"}],"containing_words":[{"definition":["green pest prevention and control\/environmentally friendly methods of pest control and prevention"],"pinyin":["bing4 chong2 hai4 lu:4 se4 fang2 kong4"],"word":"病虫害绿色防控"}],"sentences":[{"english":"The first part introduces the outline of our traffic developing in Changde.","chinese":"第三部分为常德市交通违法的防控策略。"},{"english":"Efforts are now focused on preventing the spread of the parasites.","chinese":"防控举措如今集中在防止寄生虫的传播上。"},{"english":"Finally, establishing the international cooperation mechanism of anti-network spy.","chinese":"最后着手建立防控网络间谍窃密的国际合作机制。"},{"english":"Wang Longde said that AIDS prevention and control of the Government's efforts alone are not enough.","chinese":"王陇德说，防控艾滋病单靠政府的力量是远远不够的。"},{"english":"In chapter 4, some consideration was given to the crime prevention, control and defeat in Tanggu district.","chinese":"第四章是对塘沽区的犯罪打防控展开思考。"},{"english":"AIDS prevention and control of the situation is changing, Fang Yi countermeasures are \"frequent new tactics.\"","chinese":"艾滋病防控形势在变，防艾对策也在“频出新招”。"},{"english":"The prevention and control of pick-pocketing is a social system project.","chinese":"扒窃行为的防控是一项社会系统工程。"},{"english":"Are there better methods of monitoring MRSA control than bacteraemia surveillance? An observational database study.","chinese":"有没有比菌血症监测更好的监督MRSA防控的方法？"},{"english":"Lower-income countries generally have lower capacity for the prevention and control of noncommunicable diseases.","chinese":"一般而言，低收入国家防控非传染性疾病的能力较低。"},{"english":"Reporting any signs of disease is key for surveillance and control measures.","chinese":"对任何疫病迹象进行报告是监测和防控措施的关键。"},{"english":"Tangkou Security Control efforts to increase coal companies.","chinese":"唐口煤业公司加大治安防控力度。"},{"english":"Third, further enhance entry-exit health inspection and quarantine measures based upon the epidemic situation development.","chinese":"加严检疫措施，进一步加大口岸疫病防控力度。"},{"english":"The third part studies the control system of crime by passion.","chinese":"第三部分为激情犯罪防控机制研究。"},{"english":"In public security, continued improvements were made in the crime prevention and control system and extensive efforts were made to promote peace and security.","chinese":"社会治安防控体系不断完善，平安创建活动广泛开展。"},{"english":"China Centers for Disease Control and Prevention already had delivered 10000 plague prevention leaflets to the quake zone.","chinese":"中国疾控中心已经往震区运了1万份疫情防控宣传单。"},{"english":"Preventing and controlling operation risks is a long-term and demanding task faced by bank industry.","chinese":"防控操作风险是银行业面临的一项长期而艰巨的任务。"}],"related":[{"definition":["to prevent and cure\/prevention and cure"],"pinyin":["fang2 zhi4"],"word":"防治"},{"definition":["to prevent\/to take precautions against\/to protect\/to guard against\/precautionary\/prophylactic"],"pinyin":["yu4 fang2"],"word":"预防"},{"definition":["to control"],"pinyin":["guan3 kong4"],"word":"管控"},{"definition":["to be on guard\/wariness\/to guard against\/preventive"],"pinyin":["fang2 fan4"],"word":"防范"},{"definition":["risk management"],"pinyin":["feng1 xian3 guan3 li3"],"word":"风险管理"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"监管"},{"definition":["protective step\/protective measure"],"pinyin":["yu4 fang2 cuo4 shi1"],"word":"预防措施"},{"definition":["(of diseases, accidents) to occur with a high incidence\/(old) to score highly in the imperial exams"],"pinyin":["gao1 fa1"],"word":"高发"},{"definition":["effective\/in effect\/valid"],"pinyin":["you3 xiao4"],"word":"有效"},{"definition":["feasible\/realistic\/practical\/earnestly\/conscientiously"],"pinyin":["qie4 shi2"],"word":"切实"},{"definition":["to take strict precautions\/on your guard"],"pinyin":["yan2 fang2"],"word":"严防"},{"definition":["risk\/hazard"],"pinyin":["feng1 xian3"],"word":"风险"},{"definition":["vector (epidemiology)"],"pinyin":["bing4 mei2"],"word":"病媒"},{"definition":["to strike a severe blow\/to crack down\/to take strong measures"],"pinyin":["yan2 li4 da3 ji1"],"word":"严厉打击"},{"definition":["see 防患未然[fang2 huan4 wei4 ran2]"],"pinyin":["fang2 huan4 yu2 wei4 ran2"],"word":"防患于未然"},{"definition":["to govern\/to administer\/to manage\/to control\/governance"],"pinyin":["zhi4 li3"],"word":"治理"}]}