{"definition":["deficiency of yin 陰|阴[yin1] in TCM"],"pinyin":["yin1 xu1"],"traditional":["陰虛"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"阴虚","characters":[{"definition":["variant of 陰|阴[yin1]","surname Yin","overcast (weather)\/cloudy\/shady\/Yin (the negative principle of Yin and Yang)\/negative (electric.)\/feminine\/moon\/implicit\/hidden\/genitalia"],"pinyin":["yin1","Yin1","yin1"],"word":"阴"},{"definition":["emptiness\/void\/abstract theory or guiding principles\/empty or unoccupied\/diffident or timid\/false\/humble or modest\/(of health) weak\/virtual\/in vain"],"pinyin":["xu1"],"word":"虚"}],"containing_words":[{"definition":["an excess of heat caused by a deficiency in Yin energy (idiom)"],"pinyin":["yin1 xu1 huo3 wang4"],"word":"阴虚火旺"}],"sentences":[{"english":"Objective To investigate the curative effect of a moxibustion ball on cough of yin-deficiency and fire-excess type.","chinese":"目的观察灸疗球治疗阴虚火旺型咳嗽的疗效。"},{"english":"Emphasizes in the chronic nephritis albuminuria pathogenesis the hepatorenal Yin deficient crucial nature.","chinese":"强调慢性肾炎蛋白尿病机中肝肾阴虚的关键性。"},{"english":"The prescription medication is mainly the solution holds the hot question Yin deficient.","chinese":"处方用药主要是解决阴虚操热问题。"},{"english":"Then becomes the Yin deficient positive weak card.","chinese":"则成阴虚阳弱之证。"},{"english":"Objective To establish a better experimental model of kidney-yin deficiency and depression syndrome.","chinese":"目的建立肾阴虚抑郁症大鼠模型。"},{"english":"Use caution in patients with yinxu (yin deficient) and excessive heat.","chinese":"阴虚有热者须小心应用。"},{"english":"In the deficiency of both Qi and Yin, there are backache more;","chinese":"肝肾阴虚中多见高血压，气阴两虚中多有腰痛。"},{"english":"Use with caution in case of yinxu (yin deficient).","chinese":"阴虚者小心应用。"},{"english":"The basic pathogenesis of diabetes is dryness-heat due to deficiency of yin.","chinese":"消渴病的基本病机是阴虚燥热。"},{"english":"The modern TCM believes that Yin deficiency and dryness-heat is the basic pathogenesis of wasting thirst.","chinese":"现代中医学认为，“阴虚燥热”是消渴病的基本病机。"},{"english":"Chinese medicine is believed Yin Brilliant Fire, which is often attributed to the get angry.","chinese":"中医上认为是阴虚火旺，也就是人们常说的上火。"}],"related":[{"definition":["an excess of heat caused by a deficiency in Yin energy (idiom)"],"pinyin":["yin1 xu1 huo3 wang4"],"word":"阴虚火旺"},{"definition":["deficiency of 氣|气[qi4] (TCM)"],"pinyin":["qi4 xu1"],"word":"气虚"},{"definition":["depletion of the spleen (Chinese medicine)"],"pinyin":["pi2 xu1"],"word":"脾虚"},{"definition":["night sweats"],"pinyin":["dao4 han4"],"word":"盗汗"},{"definition":["stomach cold (TCM)"],"pinyin":["wei4 han2"],"word":"胃寒"},{"definition":["stagnation of 氣|气[qi4] (TCM)"],"pinyin":["qi4 zhi4"],"word":"气滞"},{"definition":["excess of internal heat due to poor general condition (TCM)\/the prestige of another person, which one borrows for oneself"],"pinyin":["xu1 huo3"],"word":"虚火"},{"definition":["a person who is in poor health cannot handle sth so strong as a tonic"],"pinyin":["xu1 bu4 shou4 bu3"],"word":"虚不受补"},{"definition":["spleen and stomach (digestive organs in TCM)\/preferences\/one's taste (e.g. in literature)"],"pinyin":["pi2 wei4"],"word":"脾胃"},{"definition":["(TCM) consumptive disease, chronic deficiency disorder due to impaired function of inner organs, deficiency of qi, blood, yin and yang\/asthenia"],"pinyin":["xu1 sun3"],"word":"虚损"},{"definition":["loose bowels\/diarrhea\/to have the runs","diarrhea"],"pinyin":["xie4 xie4","xie4 xie4"],"word":"泄泻"},{"definition":["excess of yang 陽|阳[yang2] in TCM"],"pinyin":["yang2 sheng4"],"word":"阳盛"},{"definition":["condition characterized by thirst, hunger, frequent urination and weight loss, identified in TCM with type 2 diabetes"],"pinyin":["xiao1 ke3"],"word":"消渴"},{"definition":["constipated"],"pinyin":["da4 bian4 gan1 zao4"],"word":"大便干燥"},{"definition":["irascibility\/irritability\/(TCM) inflammation of the liver"],"pinyin":["gan1 huo3"],"word":"肝火"},{"definition":["four-substance decoction (si wu tang), tonic formula used in Chinese medicine"],"pinyin":["si4 wu4 tang1"],"word":"四物汤"}]}