{"definition":["to block\/to obstruct\/to intercept\/to interdict"],"pinyin":["zu3 duan4"],"traditional":["阻斷"],"rank":16360.0,"normalized_rank":0.228897625676829,"fraction":0.000003532220637178172,"cumulative_fraction":0.9642365077875176,"word":"阻断","characters":[{"definition":["to hinder\/to block\/to obstruct"],"pinyin":["zu3"],"word":"阻"},{"definition":["to break\/to snap\/to cut off\/to give up or abstain from sth\/to judge\/(usu. used in the negative) absolutely\/definitely\/decidedly"],"pinyin":["duan4"],"word":"断"}],"containing_words":[],"sentences":[{"english":"The medicine works by blocking new blood-vessel growth and leakiness.","chinese":"该药通过阻断新血管形成和渗漏其治疗作用。"},{"english":"Results The blood supply of uterine myoma was occluded while both uterine arteries were embolized.","chinese":"结果栓塞双侧子宫动脉后，子宫肌瘤血供可完全阻断。"},{"english":"Objective To promote the intervention for preventing the mother-to-infant transmission of HIV among HIV infected pregnant women.","chinese":"目的促进艾滋病感染孕产妇母婴阻断干预措施的实施。"},{"english":"It can block and relieve forenamed variety by disbranching vagus nerve and depressor nerve.","chinese":"切断迷走神经和减压神经可以阻断或减轻上述变化。"},{"english":"The infraction of the corresponding cerebral areas undergoing temporary arterial occlusion occurred in 3 patients.","chinese":"被阻断动脉供血区出现脑梗塞者3例。"},{"english":"So we'll continue to do the best we can to interdict supplies.","chinese":"并且我们会继续尽我们所能来阻断毒品来源。"},{"english":"But this did not block the scalpers pour road of the goods.","chinese":"但这并未阻断“黄牛”的倒货之路。"},{"english":"The results indicated that PQS may affect calcium channel block.","chinese":"初步观察表明，该药可能具有钙通道阻断作用。"},{"english":"The ranolazine works by blocking what is called delayed inward sodium current.","chinese":"雷诺嗪的作用机制是阻断迟发性钠离子内流。"},{"english":"The bovine hearts blocked at the left anterior descending artery for 45 minutes are made as an ischemic model.","chinese":"阻断牛心脏前降支动脉45分钟作为缺血心肌模型。"},{"english":"LEEP is an effective way to prevent the generation of cervical carcinoma.","chinese":"LEEP是阻断宫颈癌发生的有效手段。"},{"english":"And the drug methylnaltrexone seems to inhibit cancer growth and invasion.","chinese":"而药物甲基纳曲酮看起来能够阻断肿瘤的生长和入侵。"},{"english":"Can you program daydreaming and spacing out in your day planner?","chinese":"你会允许白日梦而阻断了你一天的计划吗？"},{"english":"Ninety-two atrioventricular (AV) accessory pathways in 90 patients were abolished by catheter radiofrequency current ab-lation.","chinese":"以射频电流阻断90例预激综合征患者的房室旁路。"},{"english":"But we also know that stopping the bleeding isn’t nearly enough.","chinese":"但我们同时也很清楚，现在还不足以完全阻断失血。"},{"english":"This device blocks steam supply immediately if an emergency occurs.","chinese":"一旦发生紧急状况，这些装置立刻阻断蒸汽。"}],"related":[{"definition":["to cut off\/to sever"],"pinyin":["qie1 duan4"],"word":"切断"},{"definition":["thoroughfare\/passage\/pathway\/channel"],"pinyin":["tong1 lu4"],"word":"通路"},{"definition":["to separate\/to cut off"],"pinyin":["zu3 ge2"],"word":"阻隔"},{"definition":["to break or cut in two\/to sever\/to cut off\/(fig.) to cut off (a conversation, a flow etc)\/to interrupt\/(math.) to truncate"],"pinyin":["jie2 duan4"],"word":"截断"},{"definition":["to inhibit\/to keep down\/to suppress"],"pinyin":["yi4 zhi4"],"word":"抑制"},{"definition":["to prevent\/to block"],"pinyin":["zu3 zhi3"],"word":"阻止"},{"definition":["to defer\/to postpone\/to put off\/to retard\/to slow sth down"],"pinyin":["yan2 huan3"],"word":"延缓"},{"definition":["barrier"],"pinyin":["ping2 zhang4"],"word":"屏障"},{"definition":["to prevent\/to guard against\/to take precautions"],"pinyin":["fang2 zhi3"],"word":"防止"},{"definition":["to impede\/to hold sb back"],"pinyin":["zu3 e4"],"word":"阻遏"},{"definition":["to clear away\/to eliminate\/to get rid of"],"pinyin":["qing1 chu2"],"word":"清除"},{"definition":["to eliminate\/to remove"],"pinyin":["xiao1 chu2"],"word":"消除"},{"definition":["to slow down\/to retard"],"pinyin":["jian3 huan3"],"word":"减缓"},{"definition":["to prevent\/to take precautions against\/to protect\/to guard against\/precautionary\/prophylactic"],"pinyin":["yu4 fang2"],"word":"预防"},{"definition":["effective\/in effect\/valid"],"pinyin":["you3 xiao4"],"word":"有效"},{"definition":["medicaments\/pharmaceuticals\/medication\/medicine\/drug"],"pinyin":["yao4 wu4"],"word":"药物"}]}