{"definition":["Ferula resin (used in TCM)\/Resina Ferulae"],"pinyin":["a1 wei4"],"traditional":["阿魏"],"rank":61144.0,"normalized_rank":0.8554838890210289,"fraction":3.459669756627792e-8,"cumulative_fraction":0.9998584373204856,"word":"阿魏","characters":[{"definition":["flatter","prefix used before monosyllabic names, kinship terms etc to indicate familiarity\/used in transliteration\/also pr. [a4]","abbr. for Afghanistan 阿富汗[A1 fu4 han4]"],"pinyin":["e1","a1","A1"],"word":"阿"},{"definition":["surname Wei\/name of vassal state of Zhou dynasty from 661 BC in Shanxi, one of the Seven Hero Warring States\/Wei state, founded by Cao Cao 曹操[Cao2 Cao1], one of the Three Kingdoms after the Han dynasty\/the Wei dynasty 221-265\/Wei prefecture and Wei county at different historical periods","tower over a palace gateway (old)"],"pinyin":["Wei4","wei4"],"word":"魏"}],"containing_words":[],"sentences":[{"english":"AimTo observe the inhibitory effect of germanium ferulic acid on the tumor U_(14 ).","chinese":"目的观察阿魏酸锗对小鼠子宫颈癌14号的作用。"},{"english":"Objective To prepare the sodium ferulate single-layer osmotic pump controlled release tablets.","chinese":"目的制备阿魏酸钠单层渗透泵控释片。"},{"english":"The content of ferulic acid was determined by HPLC.","chinese":"以HPLC法测定样品阿魏酸含量。"},{"english":"Study on standard of Ferula fukanensis K.","chinese":"阜康阿魏种子质量分级标准初步研究。"},{"english":"Sodium hydroxide was used to release ferulic acid from wheat bran in the paper.","chinese":"该文研究以麦麸为原料制备阿魏酸技术路线。"},{"english":"Objective To investigate the absorption kinetics of ferulic acid at different intestine segments in rats.","chinese":"目的研究阿魏酸在大鼠各肠各段的吸收动力学特征。"},{"english":"Objective To appraises clinical application value of sodium ferulate for injection in treating chronic nephritis.","chinese":"目的评价阿魏酸钠在慢性肾炎治疗中的临床价值。"},{"english":"Objective To set up a method for determining the content of ferulic acid in Qianggan syrup.","chinese":"目的建立强肝糖浆中阿魏酸含量的测定方法。"},{"english":"Ultrasonography and extracting a short time, Angelica in the basic ferulic acid can be extracted completely.","chinese":"且超声提取时间短，当归中的阿魏酸基本能提取完全。"},{"english":"Objective To study the compositions of resin and basilar leaves of Ferula lehmanni Boiss.","chinese":"目的对大果阿魏树脂和基生叶成分进行研究。"},{"english":"Objective To investigate the protective effects of sodium ferulate on experimental hepatic injury in rats.","chinese":"目的研究阿魏酸钠对大鼠实验性肝损伤的保护作用。"},{"english":"Added antioxidants to the alkine hydrolysis system was able to reduce loss of ferulic acid caused by oxidation.","chinese":"碱水解体系中添加抗氧化剂能减少阿魏酸的氧化破坏。"},{"english":"The synthesis of feruloylated monoacylglycerol catalyzed by P-Toluene sulfonic acid was investigated.","chinese":"研究对甲基苯磺酸催化合成阿魏酸单甘油酯的工艺。"},{"english":"Objective To make a rapid determination of ferulic acid and identification of its structure in rhizome of Phragmites communis (RPC).","chinese":"目的对芦根中阿魏酸含量和结构进行快速测定和分析。"},{"english":"The taxonomic studies on Xinjiang Ferula and its close genera.","chinese":"新疆阿魏属及其相近属间的分类学研究。"},{"english":"OBJECTIVE To synthesize and identify the artificial antigen of ferulic acid(FA).","chinese":"目的合成阿魏酸全抗原并加以鉴别。"}],"related":[{"definition":["Thai ginger\/lesser galangale (Kaempferia galanga)\/cyanide (loanword)\/same as 氰化"],"pinyin":["shan1 nai4"],"word":"山奈"},{"definition":["fennel\/fennel seed"],"pinyin":["xiao3 hui2 xiang1"],"word":"小茴香"},{"definition":["alum"],"pinyin":["bai2 fan2"],"word":"白矾"},{"definition":["musk"],"pinyin":["she4 xiang1"],"word":"麝香"},{"definition":["liquorice (Sophora flavescens), with roots used in TCM"],"pinyin":["ku3 shen1"],"word":"苦参"},{"definition":["brown marmorated stink bug (BMSB)"],"pinyin":["jiu3 xiang1 chong2"],"word":"九香虫"},{"definition":["cardamom (Elettaria cardamomum)"],"pinyin":["bai2 dou4 kou4"],"word":"白豆蔻"},{"definition":["Amomom (fructus Amomi), plant used in Chinese medicine"],"pinyin":["sha1 ren2"],"word":"砂仁"},{"definition":["borneol"],"pinyin":["bing1 pian4"],"word":"冰片"},{"definition":["Chinese anise\/star anise\/Fructus Anisi Stellati"],"pinyin":["ba1 jiao3 hui2 xiang1"],"word":"八角茴香"},{"definition":["wrinkled giant hyssop\/Agastache rugosa (botany)"],"pinyin":["huo4 xiang1"],"word":"藿香"},{"definition":["dragon's blood (bright red tree resin)"],"pinyin":["xue4 jie2"],"word":"血竭"},{"definition":["schizonepeta, herb used in Chinese medicine"],"pinyin":["jing1 jie4"],"word":"荆芥"},{"definition":["licorice root"],"pinyin":["gan1 cao3"],"word":"甘草"},{"definition":["Chinese cinnamon (Cinnamomum cassia)\/also written 肉桂[rou4 gui4]"],"pinyin":["guan1 gui4"],"word":"官桂"},{"definition":["Manchurian wild ginger (family Asarum)"],"pinyin":["xi4 xin1"],"word":"细辛"}]}