{"definition":["to enhance by contrast\/to set off\/to serve as a background in order to bring out the subject with greater brilliance\/to serve as a prop\/a foil"],"pinyin":["pei2 chen4"],"traditional":["陪襯"],"rank":27274.0,"normalized_rank":0.3815986456424104,"fraction":0.0000012062131307601455,"cumulative_fraction":0.9873340364722364,"word":"陪衬","characters":[{"definition":["to accompany\/to keep sb company\/to assist\/old variant of 賠|赔[pei2]"],"pinyin":["pei2"],"word":"陪"},{"definition":["(of garments) against the skin\/to line\/lining\/to contrast with\/to assist financially"],"pinyin":["chen4"],"word":"衬"}],"containing_words":[],"sentences":[{"english":"The frame sets off your painting very well.","chinese":"这个框把你的画陪衬得很美。"},{"english":"Such loves are always accompanied by such friendships.","chinese":"那种爱情总是有那种友谊陪衬着的。"},{"english":"To spend to have handsome foil, foil look.","chinese":"好花要有帅哥陪衬，陪衬一下。"},{"english":"To spend to have handsome foil, foil look.","chinese":"好花要有帅哥陪衬，陪衬一下。"},{"english":"But there is a political subplot here that we simply can't ignore.","chinese":"但是这里有一个我们不能忽视的政治陪衬情节。"},{"english":"People take it for granted that fatties are born to make slender people look good.","chinese":"人们想当然的认为胖子就是给美女做陪衬的。"},{"english":"Her yellow swimsuit serves as a perfect foil to her bronzed skin.","chinese":"黄色的泳衣与她铜色的肌肤是完美的陪衬。"},{"english":"The main melody is very clear, and the supporting voice simply throws it into relief.","chinese":"它的主要特征是主调鲜明突出，支声仅起陪衬作用。"},{"english":"Let hime solo, and you go along.","chinese":"让他一个人演独角戏吧，你就陪衬一下。"},{"english":"In the blue sky there are many white clouds. So nice!","chinese":"蓝莹莹的天空陪衬着雪白的云，煞是好看。"}],"related":[{"definition":["to set off"],"pinyin":["chen4 tuo1"],"word":"衬托"},{"definition":["supporting role (in play, film etc)\/minor role\/to play a secondary role (in business etc)\/to play second fiddle"],"pinyin":["pei4 jue2"],"word":"配角"},{"definition":["background (of a painting)\/backdrop\/a foil (to set off something to advantage)\/to offset (something to advantage)"],"pinyin":["hong1 tuo1"],"word":"烘托"},{"definition":["to decorate\/to adorn\/sprinkled\/studded\/only for show"],"pinyin":["dian3 zhui4"],"word":"点缀"},{"definition":["lit. the voice of the guest overwhelms that of the host (idiom)\/fig. a minor player upstages the main attraction\/minor details obscure the main point\/the sauce is better than the fish"],"pinyin":["xuan1 bin1 duo2 zhu3"],"word":"喧宾夺主"},{"definition":["the brush stroke that dots in the eyes (idiom); fig. to add the vital finishing touch\/the crucial point that brings the subject to life\/a few words to clinch the point"],"pinyin":["dian3 jing1 zhi1 bi3"],"word":"点睛之笔"},{"definition":["lit. on brocade, add flowers (idiom); to decorate sth already perfect\/gilding the lily"],"pinyin":["jin3 shang4 tian1 hua1"],"word":"锦上添花"},{"definition":["to steal the show\/to grab the limelight"],"pinyin":["qiang3 feng1 tou2"],"word":"抢风头"},{"definition":["to lose one's splendor\/to lose luster\/to be eclipsed\/to be overshadowed"],"pinyin":["an4 ran2 shi1 se4"],"word":"黯然失色"},{"definition":["to set off by contrast\/antithesis\/analogy parallelism (linguistics)"],"pinyin":["ying4 chen4"],"word":"映衬"},{"definition":["to contrast\/to set off one another\/to go well with"],"pinyin":["xiang1 chen4"],"word":"相衬"},{"definition":["to decorate\/to dress up\/to deck"],"pinyin":["zhuang1 dian3"],"word":"装点"},{"definition":["not essential\/dispensable"],"pinyin":["ke3 you3 ke3 wu2"],"word":"可有可无"},{"definition":["to decorate"],"pinyin":["zhuang1 dian3"],"word":"妆点"},{"definition":["to paint a dragon and dot in the eyes (idiom); fig. to add the vital finishing touch\/the crucial point that brings the subject to life\/a few words to clinch the point"],"pinyin":["hua4 long2 dian3 jing1"],"word":"画龙点睛"},{"definition":["dazzling\/brilliant"],"pinyin":["guang1 cai3 duo2 mu4"],"word":"光彩夺目"}]}