{"definition":["to entrap\/to set up\/to frame (up)\/to make false charges against"],"pinyin":["xian4 hai4"],"traditional":["陷害"],"rank":21358.0,"normalized_rank":0.29882613014704856,"fraction":0.000002083100735319772,"cumulative_fraction":0.977868816199248,"word":"陷害","characters":[{"definition":["pitfall\/trap\/to get stuck\/to sink\/to cave in\/to frame (false charge)\/to capture (a city in battle)\/to fall (to the enemy)\/defect"],"pinyin":["xian4"],"word":"陷"},{"definition":["to do harm to\/to cause trouble to\/harm\/evil\/calamity"],"pinyin":["hai4"],"word":"害"}],"containing_words":[{"definition":["unjust accusation\/miscarriage of justice"],"pinyin":["pan1 wu1 xian4 hai4"],"word":"攀诬陷害"}],"sentences":[{"english":"The one eyed Wang Huaie directs the truth of how he framed and disc for Jing kui.","chinese":"独眼龙将王怀锷指使他如何陷害景逵的实情和盘供出。"},{"english":"Chan Fuquan designs circumvent, make Dong Shaohua get killed.","chinese":"单福全设计陷害，使得董邵华丧命。"},{"english":"One who gives false witness against his neighbour is a hammer and a sword and a sharp arrow.","chinese":"作假见证陷害邻舍的，就是大槌，是利刀，是快箭。"},{"english":"Later Sun Bin was framed by Pang Juan and the Prince of Wei had his kneecaps cut out .","chinese":"后来，孙膑受庞涓陷害，被魏王剜掉了两个膝盖骨。"},{"english":"When you are being maligned falsely, don't retaliate. Leave it with Him.","chinese":"当你被人陷害时，不要报复，而是交托给主。"},{"english":"But, she told the jury, that doesn't mean there was a frame-up.","chinese":"但是她告诉陪审团，那并不意味着有什么陷害。"},{"english":"I know she is the woman who knifed me in the back.","chinese":"我知道是她在背后陷害了我。"},{"english":"I do not wish to see someone of you do bad things to the other campains.","chinese":"我不希望看到有谁故意设局陷害别的选手。"},{"english":"Peter tells us that, when we are being hated and maligned by the world.","chinese":"彼得告诉我们，当我们被这个世界憎恨和陷害时。"},{"english":"Harry gets put in the Triwizard Tournament. With dragons and mermaids.","chinese":"哈利被陷害参加了三强争霸赛，关卡中有龙有人鱼。"},{"english":"Like a club or a sword or a sharp arrow is the man who gives false testimony against his neighbor.","chinese":"作假见证陷害邻舍的，就是大磓，是利刀，是快箭。"},{"english":"The accused man siad that he had been framed.","chinese":"被告说他被人陷害了。"},{"english":"In desperation, he decided to throw the helve after the hatchet, in tribute tea against Hu poisoned.","chinese":"情急之下，他决定孤注一掷，在贡茶里下毒陷害胡家。"},{"english":"A man that beareth false witness against his neighbour [is] a maul, and a sword, and a sharp arrow.","chinese":"作假见证陷害邻舍的，就是大槌，是利刀，是快箭。"},{"english":"Peter seems toh ave set a cunning tr ap for you.","chinese":"皮特好像设了狡猾的圈套要陷害你。"},{"english":"I don't want to find out about anyone having any design to kick out his .","chinese":"我不希望看到有谁故意设局陷害别的选手。"}],"related":[{"definition":["to entrap\/to frame\/to plant false evidence against sb"],"pinyin":["wu1 xian4"],"word":"诬陷"},{"definition":["to kill secretly\/to stab in the back"],"pinyin":["an4 hai4"],"word":"暗害"},{"definition":["to conspire to murder\/to plot against sb's life"],"pinyin":["mou2 hai4"],"word":"谋害"},{"definition":["to frame\/to bring false charges against"],"pinyin":["gou4 xian4"],"word":"构陷"},{"definition":["to frame sb (by planting sth on them)"],"pinyin":["zai1 zang1"],"word":"栽赃"},{"definition":["to kill\/to cause death\/to do sb to death"],"pinyin":["hai4 si3"],"word":"害死"},{"definition":["to impute\/to shift the blame onto someone else"],"pinyin":["jia4 huo4"],"word":"嫁祸"},{"definition":["to frame sb\/to accuse falsely"],"pinyin":["wu1 gao4"],"word":"诬告"},{"definition":["to damage by calumny"],"pinyin":["wu1 hai4"],"word":"诬害"},{"definition":["to sow dissension (idiom); to drive a wedge between"],"pinyin":["tiao3 bo1 li2 jian4"],"word":"挑拨离间"},{"definition":["to use public office to avenge private wrongs"],"pinyin":["gong1 bao4 si1 chou2"],"word":"公报私仇"},{"definition":["to incite\/to stir up\/to instigate"],"pinyin":["tiao3 suo1"],"word":"挑唆"},{"definition":["to lodge an accusation\/accusation (law)"],"pinyin":["gao4 fa1"],"word":"告发"},{"definition":["to plot against"],"pinyin":["an4 suan4"],"word":"暗算"},{"definition":["crafty scoundrel\/villain"],"pinyin":["jian1 ren2"],"word":"奸人"},{"definition":["to expose\/to bring to light\/to disclose\/revelation"],"pinyin":["jie1 fa1"],"word":"揭发"}]}