{"definition":["to drift with the waves and go with the flow (idiom); to follow the crowd blindly"],"pinyin":["sui2 bo1 zhu2 liu2"],"traditional":["隨波逐流"],"rank":30374.0,"normalized_rank":0.4249716676227385,"fraction":9.12360167887076e-7,"cumulative_fraction":0.9905886136482056,"word":"随波逐流","characters":[{"definition":["surname Sui","to follow\/to comply with\/varying according to...\/to allow\/subsequently"],"pinyin":["Sui2","sui2"],"word":"随"},{"definition":["wave\/ripple\/storm\/surge","Poland\/Polish\/abbr. for 波蘭|波兰[Bo1 lan2]"],"pinyin":["bo1","Bo1"],"word":"波"},{"definition":["to pursue\/to chase\/individually\/one by one"],"pinyin":["zhu2"],"word":"逐"},{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"}],"containing_words":[],"sentences":[{"english":"Waves to slash one of the ship, Adventures of a funeral procession for the drift.","chinese":"海浪为劈风斩浪的航船饯行，为随波逐流的轻舟送葬。"},{"english":"He is the kind of person who swims with the tide.","chinese":"他是那种随波逐流的人。"},{"english":"On the way to the island, he would pull in the oars and just let the boat drift where it wished, for hours at a time.","chinese":"在去荒岛的途中，他会撤了浆任由小舟随波逐流。"},{"english":"The leading boat fell away when the wind grew too strong.","chinese":"在风刮得太猛时，领头的船只能随波逐流了。"},{"english":"Fogbound, with no compass, and adrift, I started trying things.","chinese":"迷失雾中，没有方向，随波逐流，我开始了新的尝试。"},{"english":"So Billy just went along with them.","chinese":"所以比利也只是随波逐流。"},{"english":"Don't be like a sheep, following the herd.","chinese":"别像小绵羊那样，随波逐流。"},{"english":"I didn't wear mascara in Just Go WithIt.","chinese":"在随波逐流里面，我没涂睫毛膏。"},{"english":"Unfortunately, those who follow the crowd usually get lost in it.","chinese":"很可惜的是，那些随波逐流的人最后往往迷失其中。"},{"english":"A man without aspirations is like an unpowered boat which has to go with the waves.","chinese":"没有志向的人，就好比没有动力的船，只能随波逐流。"},{"english":"He insisted that his political views, and never follow the crowd.","chinese":"他坚持自己的政治主张，决不随波逐流。"},{"english":"You now have censors and surveillance coercing your conformity and soliciting submission.","chinese":"你现在有了传感器和监视系统强迫你随波逐流。"},{"english":"The one who follows the crowd will usually go no further than the crowd.","chinese":"随波逐流的人通常走不出泯然众人之中。"},{"english":"I still was a Taoist priest, a small drift priests.","chinese":"我依旧是一个道士，一个随波逐流的小道士。"},{"english":"Only dead fish follow the flow.","chinese":"只有死鱼才随波逐流。"},{"english":"When he listened to yvonne, he could coast contentedly.","chinese":"在听伊冯唠叨时，他可以不费心思地随波逐流。"}],"related":[{"definition":["to follow the crowd\/going with the tide"],"pinyin":["sui2 da4 liu2"],"word":"随大流"},{"definition":["to say what everyone says (idiom)\/to conform to what one perceives to be the majority view\/to follow the herd"],"pinyin":["ren2 yun2 yi4 yun2"],"word":"人云亦云"},{"definition":["to take things as they are (idiom)\/to leave a situation as it is\/to be happy with the status quo"],"pinyin":["an1 yu2 xian4 zhuang4"],"word":"安于现状"},{"definition":["satisfied just to get through (idiom); to muddle through\/without high ambitions, but getting by"],"pinyin":["de2 guo4 qie3 guo4"],"word":"得过且过"},{"definition":["to sail against the current\/(fig.) to go against the flow"],"pinyin":["ni4 liu2 er2 shang4"],"word":"逆流而上"},{"definition":["to follow blindly\/to conform slavishly\/unthinking obedience"],"pinyin":["mang2 cong2"],"word":"盲从"},{"definition":["ordinary\/mediocre"],"pinyin":["yong1 yong1 lu4 lu4"],"word":"庸庸碌碌"},{"definition":["at home wherever one is (idiom); ready to adapt\/flexible\/to accept circumstances with good will"],"pinyin":["sui2 yu4 er2 an1"],"word":"随遇而安"},{"definition":["lit. navigating a boat against the current (idiom)\/fig. in a tough environment (one needs to work hard)"],"pinyin":["ni4 shui3 xing2 zhou1"],"word":"逆水行舟"},{"definition":["a pool of stagnant water\/stagnant or listless condition"],"pinyin":["yi1 tan2 si3 shui3"],"word":"一潭死水"},{"definition":["(idiom) to blame the gods and accuse others"],"pinyin":["yuan4 tian1 you2 ren2"],"word":"怨天尤人"},{"definition":["mediocre\/indifferent\/commonplace"],"pinyin":["ping2 yong1"],"word":"平庸"},{"definition":["to abandon oneself (idiom)\/to let oneself go"],"pinyin":["zi4 gan1 duo4 luo4"],"word":"自甘堕落"},{"definition":["to feel contented with"],"pinyin":["an1 yu2"],"word":"安于"},{"definition":["mediocre"],"pinyin":["yong1 lu4"],"word":"庸碌"},{"definition":["to look forward and back\/to consider prudently\/overcautious"],"pinyin":["zhan1 qian2 gu4 hou4"],"word":"瞻前顾后"}]}