{"definition":["along with\/in the wake of\/following"],"pinyin":["sui2 zhe5"],"traditional":["隨著"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"随着","characters":[{"definition":["surname Sui","to follow\/to comply with\/varying according to...\/to allow\/subsequently"],"pinyin":["Sui2","sui2"],"word":"随"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","to wear (clothes)\/to contact\/to use\/to apply","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","aspect particle indicating action in progress"],"pinyin":["zhao1","zhuo2","zhao2","zhe5"],"word":"着"}],"containing_words":[],"sentences":[{"english":"With BladeSystem, server organization is not tied to function.","chinese":"随着刀片服务器组织无关的功能。"},{"english":"The disagreement among the family members healed over with time.","chinese":"家庭成员之间的不和随着时间的流逝而消失。"},{"english":"The temperature of cold-blooded animals change with the temperature of the surroundings .","chinese":"冷血动物的体温随着周围的环境的改变而变化。"},{"english":"It soon turned into black smog as the smoke of the city poured into the air.","chinese":"随着城市的烟排入天空，白雾很快变成了黑色烟雾。"},{"english":"As the police moved in, the hostages were running out, he said.","chinese":"随着警方进入该区域，人质也都四散跑出。"},{"english":"Jung's concept of the ego evolved over time.","chinese":"容格关于自我的概念是随着时间而发展。"},{"english":"As time gose by, man is making the earth sike .","chinese":"随着时间的推移，人类正在令地球受到破坏。"},{"english":"Bond, comes with the war, is my understanding after read this chapter.","chinese":"债券，随着战争来临时，是我阅读本章后的理解。"},{"english":"With the oil prices up, people would rather to use E-bike.","chinese":"随着石油价格的上涨，人们更加愿意使用电单车。"},{"english":"With the development of detective methods, the concept of transdifferentiation is being accepted by people.","chinese":"随着检测手段的进步，转分化正逐渐被人们认同。"},{"english":"The prevalence rates increased with increasing gravidity or parity.","chinese":"出生缺陷发生率随着孕产次的增加而明显提高。"},{"english":"And, that radius rotates around the wheel as the wheel is moving forward.","chinese":"这条半径随着车轮的向前移动在旋转着。"},{"english":"But just as quickly as new members come, they also go.","chinese":"随着新成员的加入，老队员也很快离去。"},{"english":"Following the roar, out rushed a lion from among the bushes.","chinese":"随着一声吼叫，呼地从树林里窜出一只狮子来。"},{"english":"If you pivot in another direction, the app follows.","chinese":"如果你转向另一个方向，它也会随着变化。"},{"english":"How ungrateful then that, as the talks limp towards collapse, accusing fingers are being pointed at America.","chinese":"随着对话走向破裂，大家非常不领情面得指责美国。"}],"related":[{"definition":["thereupon\/subsequently\/accordingly"],"pinyin":["sui2 zhi1"],"word":"随之"},{"definition":["gradually"],"pinyin":["zhu2 jian4"],"word":"逐渐"},{"definition":["day by day\/more and more\/increasingly\/more and more with each passing day"],"pinyin":["ri4 yi4"],"word":"日益"},{"definition":["progressively\/step by step"],"pinyin":["zhu2 bu4"],"word":"逐步"},{"definition":["to progress (or increase, change etc) day by day\/more (or better etc) with each passing day"],"pinyin":["ri4 jian4"],"word":"日渐"},{"definition":["to break\/to snap\/to cut off\/to give up or abstain from sth\/to judge\/(usu. used in the negative) absolutely\/definitely\/decidedly"],"pinyin":["duan4"],"word":"断"},{"definition":["unceasing\/uninterrupted\/continuous\/constant"],"pinyin":["bu4 duan4"],"word":"不断"},{"definition":["(increasing) day by day\/(more critical) with every passing day\/gradually"],"pinyin":["ri4 qu1"],"word":"日趋"},{"definition":["gradually"],"pinyin":["jian4 jian4"],"word":"渐渐"},{"definition":["in succession\/following closely"],"pinyin":["xiang1 ji4"],"word":"相继"},{"definition":["more and more"],"pinyin":["yue4 lai2 yue4"],"word":"越来越"},{"definition":["to increase\/to grow in number"],"pinyin":["zeng1 duo1"],"word":"增多"},{"definition":["(of time) to elapse or pass\/(of a situation) to develop or evolve"],"pinyin":["tui1 yi2"],"word":"推移"},{"definition":["surname Ye","also\/too\/(in Classical Chinese) final particle implying affirmation"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["to accompany\/to follow\/to occur together with\/concomitant"],"pinyin":["ban4 sui2"],"word":"伴随"},{"definition":["at the same time\/meanwhile"],"pinyin":["yu3 ci3 tong2 shi2"],"word":"与此同时"}]}