{"definition":["to accompany"],"pinyin":["sui2 xing2"],"traditional":["隨行"],"rank":12918.0,"normalized_rank":0.18073957998125167,"fraction":0.0000054033618582944195,"cumulative_fraction":0.9492019438393028,"word":"随行","characters":[{"definition":["surname Sui","to follow\/to comply with\/varying according to...\/to allow\/subsequently"],"pinyin":["Sui2","sui2"],"word":"随"},{"definition":["to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense","row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column"],"pinyin":["xing2","hang2"],"word":"行"}],"containing_words":[{"definition":["entourage\/retinue"],"pinyin":["sui2 xing2 ren2 yuan2"],"word":"随行人员"},{"definition":["(of a price) to fluctuate according to the market\/to sell at the market price"],"pinyin":["sui2 hang2 jiu4 shi4"],"word":"随行就市"}],"sentences":[{"english":"This form is to be completed in English and Chinese by non-travelling parents of minors under 18 years of age.","chinese":"此表格由十八岁以下申请人的不随行父母填写。"},{"english":"Cissokho's entourage are also in Milan and they are concerned.","chinese":"西索霍的随行人员也一直米兰，他们对此忧心忡忡。"},{"english":"A chef who was traveling with the group was also hurt, so everyone started cooking, Mr. Dhao said.","chinese":"随行而来的厨师也受了伤，所以每个人都成了厨子。"},{"english":"He discover two same, so he ask retinue .","chinese":"他发现两个相同的，所以他要求随行人员。"},{"english":"The idea is to compact distances between lead and following cars.","chinese":"其实就是要缩短领头车和随行车辆的距离。"},{"english":"This system is a friction-free alternative to trailing cables, such as with high-bay stackers.","chinese":"该系统无摩擦，是替随行电缆的良好替代品。"},{"english":"The party entered holy Benares by boat along the Ganges .","chinese":"随行人员乘小舟延着恒河进入神圣的贝拿勒斯。"},{"english":"On this splendid season, let dazzle colour with you all the way accompanying.","chinese":"在这个灿烂的季节，让炫彩伴你一路随行。"},{"english":"The images moonlight, frost, moon are much more than arbitrary symbols.","chinese":"月光，白霜，明月的意象，比象征更加随行。"},{"english":"A number of experienced staff went with the students on both Shanghai and Beijing trips.","chinese":"随行的还包括我校几位有丰富面试经验的教职工。"},{"english":"An example of an advanced body signal is seen during heeling.","chinese":"一个高级身体信号的例子就是随行训练中的目光。"},{"english":"Scientists also went with their experiments, engineers with their screwdrivers.","chinese":"科学家和工程师也会各自带着实验设备和螺丝刀随行。"},{"english":"Market regulations of foreign exchange quotas and cash remittances are permitted, and prices are e changeable according t changes of the market.","chinese":"允许外汇额度和现汇进行市场调节，价格随行就市。"},{"english":"Peasants now sell vegetables at moving prices determined by their supply and their customer's demand.","chinese":"现在农民出售蔬菜，价格都是随行就市。"},{"english":"Within a year, he had acquired several oceangoing vessels.","chinese":"一年之内，他吸引“捕获”了好几艘远洋航行船随行。"},{"english":"Another path bit golden couple also accompanying.","chinese":"另外程咬金夫妇亦随行。"}],"related":[{"definition":["accompanying"],"pinyin":["sui2 tong2"],"word":"随同"},{"definition":["to guard\/to protect\/bodyguard (for officials in ancient times)"],"pinyin":["hu4 wei4"],"word":"护卫"},{"definition":["to escort\/to accompany"],"pinyin":["hu4 song4"],"word":"护送"},{"definition":["entourage\/retinue"],"pinyin":["sui2 xing2 ren2 yuan2"],"word":"随行人员"},{"definition":["attendant"],"pinyin":["sui2 yuan2"],"word":"随员"},{"definition":["to accompany"],"pinyin":["pei2 tong2"],"word":"陪同"},{"definition":["to accompany\/to follow\/to attend\/entourage\/attendant"],"pinyin":["sui2 cong2"],"word":"随从"},{"definition":["to lead a group\/leader of a group\/captain (of sports squad)"],"pinyin":["ling3 dui4"],"word":"领队"},{"definition":["one's wife and children"],"pinyin":["jia1 juan4"],"word":"家眷"},{"definition":["to serve (an important personage)\/attendant\/retainer"],"pinyin":["shi4 cong2"],"word":"侍从"},{"definition":["diplomatic mission"],"pinyin":["shi3 tuan2"],"word":"使团"},{"definition":["to send under escort\/to transport a detainee"],"pinyin":["ya1 song4"],"word":"押送"},{"definition":["to stay behind to take care of things"],"pinyin":["liu2 shou3"],"word":"留守"},{"definition":["to stand guard over\/(security) guard"],"pinyin":["jing3 wei4"],"word":"警卫"},{"definition":["trusted aide"],"pinyin":["qin1 xin4"],"word":"亲信"},{"definition":["guard (i.e. group of soldiers)"],"pinyin":["wei4 dui4"],"word":"卫队"}]}