{"definition":["dew point\/(coll.) (of a woman) to expose one of the three areas (nipples and genitals)"],"pinyin":["lu4 dian3"],"traditional":["露點"],"rank":31333.0,"normalized_rank":0.4383893218418144,"fraction":8.367437571725951e-7,"cumulative_fraction":0.9914265599690676,"word":"露点","characters":[{"definition":["to show\/to reveal\/to betray\/to expose","dew\/syrup\/nectar\/outdoors (not under cover)\/to show\/to reveal\/to betray\/to expose","surname Lu"],"pinyin":["lou4","lu4","Lu4"],"word":"露"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"点"}],"containing_words":[],"sentences":[{"english":"Showing the arm a little bit is going to make you look taller and leaner.","chinese":"露点胳膊出来将使你看起来苗条修长。"},{"english":"Lowers compressed air dewpoints for better equipment efficiency.","chinese":"降低压缩空气露点，使设备的效率更高。"},{"english":"I weep–the dew twinkles white on the green mosses.","chinese":"相思黄叶落，白露点青苔。"},{"english":"The operation condition of the dryer to any pressure points, not with the control flow.","chinese":"干燥器的工况决定了压力凝露点，而非用其调节流量。"},{"english":"Desalination by dewvaporation process is a novel brackish and seawater desalination method.","chinese":"露点蒸发淡化技术是一种新的苦咸水和海水淡化方法。"},{"english":"Surface temperature is 3℃ less than Dew-point.","chinese":"表面温度低于露点温度3℃。"},{"english":"Cooling after the air pressure dew point is the minimum to 2 degrees.","chinese":"经降温后的空气压力露点最低可达2℃。"},{"english":"Apply west Japan technology in dehumidifying wheel, dew Points are stable.","chinese":"采用日本西部技研除湿轮，露点稳定。"},{"english":"The practice proves that the dewpoint transmitter is an effective measuring means in the measurement of the humidity of pressurized air.","chinese":"实践证明露点仪是检测压缩空气湿度的有效计量手段。"},{"english":"Polymerization of any unconverted styrene and diolefins is accelerated at the dew point condition.","chinese":"在露点条件下苯乙烯和二烯烃的聚合反应会加速进行。"},{"english":"Describes the general configuration and work principle of the dew point indirect evaporative cooler.","chinese":"描述露点间接蒸发冷却器的一般结构和工作原理。"},{"english":"It also adopts double condenser structure to ensure the lower return air temperature and dew point .","chinese":"采用双冷凝器结构，确保更低的回风温度及露点。"},{"english":"This temperature adjustment is necessary to ensure that the dewpoint is not reached.","chinese":"为了确保不达到露点，温度调整是必要的。"},{"english":"When the pressure of condensate gas falls to dew point below, its phase will change.","chinese":"压力降低到露点以下时凝析气会发生相态变化。"},{"english":"The apparatus is suitable for calibrating dew point meters and moisture analysis instrument.","chinese":"装置适合于各类露点仪和水分分析仪器的计量校正。"},{"english":"The lithium chloride dew-point hygrometer has many advantages over other types of hygrometer.","chinese":"氯化锂露点湿度计较其它型式的湿度计，有很多优点。"}],"related":[{"definition":["protruding nipples or bulging penis (contours of intimate body parts visible through clothing)"],"pinyin":["ji1 tu1"],"word":"激凸"},{"definition":["(slang) naked\/nude"],"pinyin":["san1 dian3 quan2 lou4"],"word":"三点全露"},{"definition":["to let out a secret"],"pinyin":["lou4 di3"],"word":"露底"},{"definition":["to censor an image\/to pixelate"],"pinyin":["da3 ma3 sai4 ke4"],"word":"打马赛克"},{"definition":["sex scene (in a movie etc)"],"pinyin":["chuang2 xi4"],"word":"床戏"},{"definition":["nude scene (in a movie)"],"pinyin":["luo3 xi4"],"word":"裸戏"},{"definition":["to show one's face\/to make one's good name\/to become successful and well known\/to shine"],"pinyin":["lou4 lian3"],"word":"露脸"},{"definition":["to pixelate an image\/to key in captcha authentication codes"],"pinyin":["da3 ma3"],"word":"打码"},{"definition":["low-cut (dress)\/plunging (neckline)"],"pinyin":["di1 xiong1"],"word":"低胸"},{"definition":["unpixelated or uncensored (of video)"],"pinyin":["wu2 ma3"],"word":"无码"},{"definition":["to expose oneself\/to be completely gone"],"pinyin":["zou3 guang1"],"word":"走光"},{"definition":["nude picture"],"pinyin":["yan4 zhao4"],"word":"艳照"},{"definition":["swimsuit"],"pinyin":["yong3 zhuang1"],"word":"泳装"},{"definition":["see-through clothing"],"pinyin":["tou4 shi4 zhuang1"],"word":"透视装"},{"definition":["bikini (loanword)"],"pinyin":["bi3 ji1 ni2"],"word":"比基尼"},{"definition":["to strip naked\/to strip nude\/(coll.) to find oneself a partner"],"pinyin":["tuo1 guang1"],"word":"脱光"}]}