{"definition":["a powerful chief of the princes of the Spring and Autumn Period (770-476 BC)\/overlord\/hegemon"],"pinyin":["ba4 zhu3"],"traditional":["霸主"],"rank":11912.0,"normalized_rank":0.1666643347837645,"fraction":0.000006182736408110275,"cumulative_fraction":0.9433799197529229,"word":"霸主","characters":[{"definition":["variant of 霸[ba4]","hegemon\/tyrant\/lord\/feudal chief\/to rule by force\/to usurp\/(in modern advertising) master"],"pinyin":["ba4","ba4"],"word":"霸"},{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"}],"containing_words":[],"sentences":[{"english":"Oslash; Starscream, Overlord, Scorponok and Onslaught agree to follow Megatron.","chinese":"红蜘蛛，霸主，萨克巨人与袭击同谋共保威震天。"},{"english":"Anor hoped to strike back at Overlord Shimrra in revenge for his misfortune.","chinese":"阿诺希望对希姆拉霸主发动反击，为自己的不幸报仇。"},{"english":"There are plenty of reasons to doubt the dollar's dethronement.","chinese":"有大量的理由让人怀疑美元会失去霸主地位。"},{"english":"Later overlords were mostly derived from these great states.","chinese":"后来霸主大多来自这些伟大的国家。"},{"english":"The Chinese men dominated on their home soil, as expected.","chinese":"中国男子体操队不负众望在本土取得霸主地位。"},{"english":"We need to do this before China becomes a hegemon","chinese":"我们需要在中国成为霸主之前做这件事。"},{"english":"Creative slogans throughout the years have kept Coca-Cola \"king of hill.\"","chinese":"历年充满创意的口号使可口可乐一直保持霸主地位。"},{"english":"American universities took all 5 top places and have 72 entries in the top 200.","chinese":"美国一共有72所高校入围200强，彰显霸主地位。"},{"english":"That early cultivation has ensured diving supremacy for the People's Republic.","chinese":"早期培养为人民共和国确保了跳水的霸主地位。"},{"english":"Hence superpowerdom is Beijing's for the taking, in this decade or the next.","chinese":"因此这个十年，或下个十年，中国必是世界的霸主。"},{"english":"This is what economic hegemony will look like.","chinese":"这才是经济霸主应有的规模。"},{"english":"TOYOTA becomes the new dominator in global automobile industry as impetuous development.","chinese":"丰田正以凶猛的声势成为全球汽车业新一轮的霸主。"},{"english":"In the 1980’s, Japan seemed to be becoming the new economic hegemon.","chinese":"在1980年代，日本好像变成了一个新的经济霸主。"},{"english":"Is your immediate plan to emulate Sir Alex with Molde and transform the club into a dominant force in Norway?","chinese":"你打算学习爵爷好榜样，让莫尔德也成为挪威霸主吗？"},{"english":"China plans to take over from Britain in ruling the Olympic waves.","chinese":"中国打算接替英国成为海上霸主弄潮新秀。"},{"english":"The males fight for the title of dominant beach master.","chinese":"公象海豹争夺海滩霸主的头衔。"}],"related":[{"definition":["lit. to proclaim oneself hegemon\/to take a leading role\/to build a personal fiefdom"],"pinyin":["cheng1 ba4"],"word":"称霸"},{"definition":["to contend for hegemony\/a power struggle"],"pinyin":["zheng1 ba4"],"word":"争霸"},{"definition":["formidable opponent"],"pinyin":["jing4 di2"],"word":"劲敌"},{"definition":["old, well-known brand\/old style\/old school\/an old hand\/experienced veteran"],"pinyin":["lao3 pai2"],"word":"老牌"},{"definition":["hegemony\/supremacy"],"pinyin":["ba4 quan2"],"word":"霸权"},{"definition":["ruler"],"pinyin":["zhu3 zai3 zhe3"],"word":"主宰者"},{"definition":["Big Mac (McDonald's hamburger)","giant\/leviathan"],"pinyin":["Ju4 wu2 ba4","ju4 wu2 ba4"],"word":"巨无霸"},{"definition":["superpower"],"pinyin":["chao1 ji2 qiang2 guo2"],"word":"超级强国"},{"definition":["big boss\/leader of a group\/dominant (position)"],"pinyin":["long2 tou2 lao3 da4"],"word":"龙头老大"},{"definition":["to aspire to the throne\/to aim at (the first place etc)"],"pinyin":["wen4 ding3"],"word":"问鼎"},{"definition":["to sweep away\/to sweep across"],"pinyin":["heng2 sao3"],"word":"横扫"},{"definition":["to dominate (a market etc)\/to monopolize"],"pinyin":["du2 ba4"],"word":"独霸"},{"definition":["old foe\/long-standing enemy"],"pinyin":["su4 di2"],"word":"夙敌"},{"definition":["great heroes pursue deer in the central plains (idiom); fig. many vie for supremacy"],"pinyin":["qun2 xiong2 zhu2 lu4"],"word":"群雄逐鹿"},{"definition":["to rule (a country)\/to govern\/rule\/regime"],"pinyin":["tong3 zhi4"],"word":"统治"},{"definition":["to unify\/unified"],"pinyin":["yi1 tong3"],"word":"一统"}]}