{"definition":["(lit.) to fix one's gaze on\/(fig.) to show interest in\/(favorable) attention\/favor"],"pinyin":["qing1 lai4"],"traditional":["青睞"],"rank":4507.0,"normalized_rank":0.06305877744043205,"fraction":0.000027988728331118842,"cumulative_fraction":0.8461718675971907,"word":"青睐","characters":[{"definition":["abbr. for 青海[Qing1 hai3], Qinghai Province","green\/blue\/black\/youth\/young (of people)"],"pinyin":["Qing1","qing1"],"word":"青"},{"definition":["to glance\/to look askance at"],"pinyin":["lai4"],"word":"睐"}],"containing_words":[],"sentences":[{"english":"This eclipse will work to your favor.","chinese":"这次月偏食将您的青睐。"},{"english":"What is the number of real estate tycoons Zhujiaokuai favor of a plus?","chinese":"到底是什么让众多的地产巨子对住交会青睐有加呢？"},{"english":"It is greatly welcomed with a mass of enterprises and has built up a good company credit standing within and outside food industry.","chinese":"深受广大企业的青睐，在业内外享有良好的企业信誉。"},{"english":"Analysts seem to like the new pricing model.","chinese":"分析师们似乎很青睐新的定价模式。"},{"english":"I company produces the hubei type finely machine also quite broad new old customer's favour.","chinese":"我公司所生产鄂式细碎机也颇广大新老用户的青睐。"},{"english":"Rather, they strongly preferred the infected ones.","chinese":"相反，它们对感染植株青睐有加。"},{"english":"It's for these reasons that the MP5 is the favorite among counter-terrorists and police forces worldwide.","chinese":"因此MP5受到世界范围内的反恐和警力部队的青睐。"},{"english":"It gets a really nice reception at a very good publisher.","chinese":"受到颇有名气的出版商的青睐。"},{"english":"His eloquent speech has won him the favor of the .","chinese":"他的好口才为他赢得了选民的青睐。"},{"english":"Microsatellites are now favoured by developing countries, with the notable exception of India.","chinese":"微卫星如今受到除印度之外的发展中国家的青睐。"},{"english":"We have a wealth of imagination and association, and we hope to get the employer's favor.","chinese":"我们有丰富的想象力和联想力，希望得到雇主的青睐。"},{"english":"But some say the charts are slanted in favor of the stars who make the most small-screen appearances.","chinese":"而有人说排行榜十分青睐那些电视露面率很高的歌星。"},{"english":"\"Jin Pin the spring\" the brand, has won the general consumer's favor.","chinese":"“金品春”品牌，赢得了广大消费者的青睐。"},{"english":"The Toyota Prius is the best-selling model.","chinese":"丰田的普锐斯是其中最受青睐的车型。"},{"english":"It is typically favored by large industrial SCR operators.","chinese":"这是典型的青睐大型工业可控硅运营商。"},{"english":"Eyelid surgery was second most popular at 29 percent. A face shaped like a goose egg and double eyelids were favorite, it showed.","chinese":"鹅蛋脸和双眼皮最受青睐。"}],"related":[{"definition":["to chase after (a popular person or item)\/to pursue\/popularity"],"pinyin":["zhui1 peng3"],"word":"追捧"},{"definition":["a craze\/a popular wave\/a hit with the public"],"pinyin":["re4 peng3"],"word":"热捧"},{"definition":["to like\/to love\/to be fond of\/favorite"],"pinyin":["xi3 ai4"],"word":"喜爱"},{"definition":["to be partial towards sth\/to favor\/to prefer\/preference\/favorite"],"pinyin":["pian1 ai4"],"word":"偏爱"},{"definition":["to approve\/approval\/acknowledgment\/OK"],"pinyin":["ren4 ke3"],"word":"认可"},{"definition":["to receive in no small measure"],"pinyin":["shen1 shou4"],"word":"深受"},{"definition":["to fully experience (good or bad)"],"pinyin":["bei4 shou4"],"word":"备受"},{"definition":["to treasure\/to be very fond of"],"pinyin":["zhong1 ai4"],"word":"钟爱"},{"definition":["pet\/favorite\/darling"],"pinyin":["chong3 er2"],"word":"宠儿"},{"definition":["to rush like ducks (idiom); the mob scrabbles madly for sth unobtainable\/an unruly crowd on a wild goose chase"],"pinyin":["qu1 zhi1 ruo4 wu4"],"word":"趋之若鹜"},{"definition":["to esteem\/to think highly of\/to accord importance to\/to revere"],"pinyin":["tui1 chong2"],"word":"推崇"},{"definition":["current favorite\/the latest thing\/darling (of the market or the media etc)"],"pinyin":["xin1 chong3"],"word":"新宠"},{"definition":["to show appreciation for sb\/to look upon sb with favor"],"pinyin":["chui2 qing1"],"word":"垂青"},{"definition":["numerous"],"pinyin":["zhong4 duo1"],"word":"众多"},{"definition":["to regard as important\/to care about"],"pinyin":["kan4 zhong4"],"word":"看重"},{"definition":["favorable criticism\/positive evaluation"],"pinyin":["hao3 ping2"],"word":"好评"}]}