{"definition":["Qinghai-Tibetan plateau"],"pinyin":["Qing1 Zang4 gao1 yuan2"],"traditional":["青藏高原"],"rank":11404.0,"normalized_rank":0.15955675569795588,"fraction":0.000006659937270321931,"cumulative_fraction":0.9401186400142164,"word":"青藏高原","characters":[{"definition":["abbr. for 青海[Qing1 hai3], Qinghai Province","green\/blue\/black\/youth\/young (of people)"],"pinyin":["Qing1","qing1"],"word":"青"},{"definition":["storehouse\/depository\/Buddhist or Taoist scripture","Tibet\/Xizang 西藏","to conceal\/to hide away\/to harbor\/to store\/to collect"],"pinyin":["zang4","Zang4","cang2"],"word":"藏"},{"definition":["high\/tall\/above average\/loud\/your (honorific)","surname Gao"],"pinyin":["gao1","Gao1"],"word":"高"},{"definition":["Hara (Japanese surname)","former\/original\/primary\/raw\/level\/cause\/source"],"pinyin":["Yuan2","yuan2"],"word":"原"}],"containing_words":[],"sentences":[{"english":"Global warming caused a dryer and warmer climate in the centeral part of Qinghai-Tibet plateau.","chinese":"受全球变暖影响，青藏高原气候呈现出暖干趋势。"},{"english":"Feng Yongfeng reports from the village of Cuochi on the Qinghai-Tibet plateau.","chinese":"冯永锋来自青藏高原措池村的报道。"},{"english":"The plateau is the world's third largest store of ice.","chinese":"青藏高原是世界第三大的冰储藏地。"},{"english":"Sichuan is bordered by the Tibetan Plateau in the west and by the Three Gorges and the Yangtze River in the east.","chinese":"四川西临青藏高原而东接三峡和长江。"},{"english":"The muscid biogeography of Qinghai-Xizang Plateau is studied.","chinese":"对青藏高原蝇科昆虫进行了生物地理学研究。"},{"english":"The result suggests that the Himalayas and the Qinghai-Tibet Plateau will not continue to move up indefinitely.","chinese":"测量结果表明，喜马拉雅山和青藏高原不会无限升高。"},{"english":"Kangding County is located in the transition area between the west hilly edge of Sichuan Basin and the Tibetan Plateau.","chinese":"康定县地处四川盆地西缘山地及青藏高原过渡地带。"},{"english":"A lot of observational data on the atmospheric boundary layer over the plateau were obtained.","chinese":"获得了大量的关于青藏高原大气边界层的宝贵资料。"},{"english":"The crust and lithosphere of the Tibet is very thick, and the LVZ is not obvious.","chinese":"青藏高原地壳岩石圈巨厚，上地幔低速带不明显。"},{"english":"By the 13th century, Islam spread as far as to Tibet.","chinese":"13世纪，伊斯兰已推进到青藏高原的四缘。"},{"english":"The authority also forecast light to moderate snow or sleet in the eastern Qinghai-Tibetan Plateau.","chinese":"有关部门预报青藏高原东部地区将有小到中雪或冻雨。"},{"english":"The Tibetan plateau has in the past been the scene of ethnic conflict.","chinese":"青藏高原和过去一样出现了种族冲突的场景。"},{"english":"Conclusions The tested strain has a strong virulence and belongs to Qinghai-Tibet plateau in biotype.","chinese":"结论该菌株毒力较强，其生化型为青藏高原生物型。"},{"english":"Qinghai-Tibet Plateau dry and cold climatic change has the characteristics that advance from east to west.","chinese":"青藏高原的干冷气候变化具有由东向西推进的特点。"},{"english":"The origin of Changjiang River is Qingzang High Land . …","chinese":"长江发源于青藏高原用英文怎么说？"},{"english":"Zabuye saline lake, situated in the hinterland of Tibet plateau, is a contemparysaline lake deposit.","chinese":"扎布耶盐湖位于青藏高原腹地，是一个现代盐湖矿床。"}],"related":[{"definition":["the roof of the world\/usually refers to Tibet or Qinghai-Tibetan Plateau 青藏高原[Qing1 Zang4 gao1 yuan2]"],"pinyin":["shi4 jie4 wu1 ji3"],"word":"世界屋脊"},{"definition":["plateau\/CL:片[pian4]"],"pinyin":["gao1 yuan2"],"word":"高原"},{"definition":["Himalayas"],"pinyin":["Xi3 ma3 la1 ya3 shan1 mai4"],"word":"喜马拉雅山脉"},{"definition":["Himalayas"],"pinyin":["Xi3 ma3 la1 ya3 shan1"],"word":"喜马拉雅山"},{"definition":["Pamir high plateau on the border between Xinjiang and Tajikistan"],"pinyin":["Pa4 mi3 er3 Gao1 yuan2"],"word":"帕米尔高原"},{"definition":["Dangla or Tanggula mountain range on the Qinhai-Tibet plateau"],"pinyin":["Tang2 gu3 la1 shan1"],"word":"唐古拉山"},{"definition":["Dangla or Tanggula mountain range on the Qinhai-Tibet plateau"],"pinyin":["Tang2 gu3 la1 shan1 mai4"],"word":"唐古拉山脉"},{"definition":["Yunnan and Guizhou plateau in southwest China, covering east Yunnan, whole of Guizhou, west of Guangxi and southern margins of Sichuan, Hubei and Hunan"],"pinyin":["Yun2 Gui4 gao1 yuan2"],"word":"云贵高原"},{"definition":["Hengduan mountains, several parallel mountain ranges on the border between west Yunnan and Sichuan and east Tibet"],"pinyin":["Heng2 duan4 shan1 mai4"],"word":"横断山脉"},{"definition":["Tsaidam or Qaidam basin (Mongolian: salt marsh), depression northeast of the Plateau of Tibet, located between the Qilian Shan and the Kunlun Shan at the northern margin of the Tibetan Plateau."],"pinyin":["Chai2 da2 mu4 pen2 di4"],"word":"柴达木盆地"},{"definition":["Mt Gangdisê (6656m) in southwest Tibet, revered by Tibetans as the center of the universe"],"pinyin":["Gang1 di3 si1 shan1"],"word":"冈底斯山"},{"definition":["Karakorum mountain range in west Xinjiang"],"pinyin":["Ka1 la3 kun1 lun2 Shan1"],"word":"喀喇昆仑山"},{"definition":["Yarlung Tsangpo River, Tibet"],"pinyin":["Ya3 lu3 Zang4 bu4 Jiang1"],"word":"雅鲁藏布江"},{"definition":["Gangdisê mountain range in southwest Tibet"],"pinyin":["Gang1 di3 si1 shan1 mai4"],"word":"冈底斯山脉"},{"definition":["Loess Plateau of northwest China"],"pinyin":["Huang2 tu3 Gao1 yuan2"],"word":"黄土高原"},{"definition":["former Kham province of Tibet, now split between Tibet and Sichuan"],"pinyin":["Kang1 ba1 Zang4 qu1"],"word":"康巴藏区"}]}