{"definition":["to want absolutely\/to insist on (doing something)"],"pinyin":["fei1 yao4"],"traditional":["非要"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"非要","characters":[{"definition":["abbr. for 非洲[Fei1 zhou1], Africa","to not be\/not\/wrong\/incorrect\/non-\/un-\/in-\/to reproach or blame\/(colloquial) to insist on\/simply must"],"pinyin":["Fei1","fei1"],"word":"非"},{"definition":["to demand\/to request\/to coerce","important\/vital\/to want\/to ask for\/will\/going to (as future auxiliary)\/may\/must\/(used in a comparison) must be\/probably\/if"],"pinyin":["yao1","yao4"],"word":"要"}],"containing_words":[],"sentences":[{"english":"Come and look round our shop without commitment to buy anything.","chinese":"请随时来我们商店转转，不一定非要买东西。"},{"english":"Figg made him look at photographs of all the cats she'd ever owned.","chinese":"费格太太还非要他看她过去养过的几只猫咪的照片。"},{"english":"Rich client development doesn't have to come at your code's expense.","chinese":"富客户机开发并不一定非要以复杂的代码为代价。"},{"english":"Why use plastic when you can use wood?","chinese":"既然能用朔料，何必非要用木料呢？"},{"english":"So that there's no one rule this way or that way.","chinese":"因此，没有一个固定的规则说非要这样不可。"},{"english":"Dang, Cletus, why'd you have to park by my parents?","chinese":"克莱特斯，你为什么非要停在我爸妈家门口？"},{"english":"But that year the Spring Festival, wrapped around his death, hard grind, she must go back with him.","chinese":"可那年的春节，他死缠硬磨，非要她随他一起回去。"},{"english":"Do bathroom cleaners need to be so harsh that the fumes make me choke?","chinese":"浴室清洁剂的气味非要搞得弄浓烈的让人窒息吗？"},{"english":"If the buyer had insisted back, then take at least one postage.","chinese":"如果买家非要退得话，那至少得承担一次邮费。"},{"english":"Non-driving me crazy it?","chinese":"非要把我逼疯吗？"},{"english":"No you dnt have to marry a girl if u get them pregnant.","chinese":"不，即使你让她们怀孕了你也不一定非要娶那个女孩。"},{"english":"If you have to give a time-limit to this love, I hope it is 10 thousand years.","chinese":"如果非要在这段感情上加一个期限，我希望是一万年。"},{"english":"Why should it be put off till next month?","chinese":"为什么非要挨到下个月不可？"},{"english":"If there must have a time frame to that love, I hope it will strech ten thousands years!","chinese":"如果非要给这段爱加一个期限，我希望是一万年。"},{"english":"He always comes and tells Betram that he must stop his wife from getting married again.","chinese":"缠着他非要其阻止自己妻子再婚不可。"},{"english":"Why to don't want the whole body covered with wounds that ego move.","chinese":"为什么非要把自己动的遍体鳞伤。"}],"related":[{"definition":["(followed by a verb phrase, then – optionally – 不可, or 不行 etc) must"],"pinyin":["fei1 dei3"],"word":"非得"},{"definition":["firmly set on doing sth\/to insist on doing\/determined in one's course of action"],"pinyin":["ying4 yao4"],"word":"硬要"},{"definition":["to insist on doing sth\/must do it, despite everything"],"pinyin":["pian1 yao4"],"word":"偏要"},{"definition":["to be determined to\/to insist on"],"pinyin":["zhi2 yi4"],"word":"执意"},{"definition":["(coll.) if"],"pinyin":["yao4 shi5"],"word":"要是"},{"definition":["(indicates that sth turns out just the opposite of what one would wish) unfortunately\/as it happened\/(indicates that sth is the opposite of what would be normal or reasonable) stubbornly\/contrarily\/against reason\/(indicates that sb or a group is singled out) precisely\/only\/of all people"],"pinyin":["pian1 pian1"],"word":"偏偏"},{"definition":["otherwise\/or else\/or"],"pinyin":["yao4 bu4 ran2"],"word":"要不然"},{"definition":["since\/as\/this being the case"],"pinyin":["ji4 ran2"],"word":"既然"},{"definition":["there is nothing to be done\/one can't do anything about it"],"pinyin":["mei2 ban4 fa3"],"word":"没办法"},{"definition":["there is no need\/why should"],"pinyin":["he2 bi4"],"word":"何必"},{"definition":["otherwise\/or else\/how about...?\/either... (or...)"],"pinyin":["yao4 bu4"],"word":"要不"},{"definition":["not so\/no\/or else\/otherwise\/if not\/How about ...?"],"pinyin":["bu4 ran2"],"word":"不然"},{"definition":["what are you doing?\/whatever for?\/why on earth?"],"pinyin":["gan4 ma2"],"word":"干嘛"},{"definition":["won't do\/be out of the question\/be no good\/not work\/not be capable"],"pinyin":["bu4 xing2"],"word":"不行"},{"definition":["to say again\/to put off a discussion until later\/moreover\/what's more\/besides"],"pinyin":["zai4 shuo1"],"word":"再说"},{"definition":["obviously\/plainly\/undoubtedly\/definitely"],"pinyin":["ming2 ming2"],"word":"明明"}]}