{"definition":["near\/to approach"],"pinyin":["kao4 jin4"],"traditional":["靠近"],"rank":4791.0,"normalized_rank":0.06703230590572662,"fraction":0.00002554739849947989,"cumulative_fraction":0.8537665620907338,"word":"靠近","characters":[{"definition":["to lean against or on\/to stand by the side of\/to come near to\/to depend on\/to trust\/to fuck (vulgar)\/traditional military costume drama where the performers wear armor (old)"],"pinyin":["kao4"],"word":"靠"},{"definition":["near\/close to\/approximately"],"pinyin":["jin4"],"word":"近"}],"containing_words":[],"sentences":[{"english":"Lie on your back with your legs spread or raise your knees to your head.","chinese":"平躺，张开双腿或者把膝盖抬到靠近头部的地方。"},{"english":"Mengsk approached the smaller man and stood before him, an intimidating presence.","chinese":"蒙克斯以威迫的姿态靠近并站在这位小矮人前面。"},{"english":"Make sure none of the audio components are positioned too close to the TV set.","chinese":"确认各声频设备是否太靠近电视机。"},{"english":"Ads close to top-of-the-page headlines did well.","chinese":"靠近页顶标题的广告表现良好。"},{"english":"While the White Swan comes easily to Nina, the dark mysteries of the Black Swan evade her.","chinese":"当白天鹅靠近妮娜的时候，黑天鹅的隐秘躲在暗处。"},{"english":"Birds fly over oil on the water near Breton Sound Island.","chinese":"一大群鸟飞越靠近布莱顿水声岛的油渍水域。"},{"english":"A girl passed close to him, and Lieutenant Blandford started.","chinese":"一个女孩靠近他走过，布兰佛德中尉吃惊地动了一下。"},{"english":"Project is located in the former Central New Film Factory near North Third Ring Road area.","chinese":"项目选址在原中央新影厂靠近北三环的区域。"},{"english":"The Lord is close to the brokenhearted and saves those who are crushed in spirit.","chinese":"耶和华靠近伤心的人，拯救灵性痛悔的人。"},{"english":"Rajin-Sonbong (or Rason, for short) lies by the Sea of Japan in the country’s north-east, near the border with Russia.","chinese":"罗津靠近日本海，在北韩的东北部，接近俄国边界。"},{"english":"Don't put the fermentation container close to potting plants.","chinese":"发酵容器不能靠近盆栽植物放置。"},{"english":"Lie face down on the floor with your elbows bent and your palms next to your shoulders.","chinese":"脸朝地板向下，肘关节弯曲，手心靠近肩膀。"},{"english":"Iron at temperatures close to and above its critical temperature has an affinity for carbon.","chinese":"铁在靠近并高于其临界温度时对碳具有亲合力。"},{"english":"The staggering totals indicate why McGrady needed to get to the hoop.","chinese":"摇摆不定的数据表明了为什么麦迪需要更靠近篮圈。"},{"english":"I'll walk, trot , canter or gallop to be near you.","chinese":"我会步行，小跑，慢跑或驰骋在靠近你。"},{"english":"Meanwhile, Seret had inched along the car toward Stephen.","chinese":"与此同时，塞里特沿着汽车一点一点地靠近了史蒂芬。"}],"related":[{"definition":["to be right next to\/to lean closely against"],"pinyin":["jin3 kao4"],"word":"紧靠"},{"definition":["to touch\/(fig.) to touch on (a matter)"],"pinyin":["chu4 peng4"],"word":"触碰"},{"definition":["surroundings\/environment\/to encompass"],"pinyin":["zhou1 wei2"],"word":"周围"},{"definition":["to be far from\/to keep away from"],"pinyin":["yuan3 li2"],"word":"远离"},{"definition":["to press close to\/to snuggle close\/intimate"],"pinyin":["tie1 jin4"],"word":"贴近"},{"definition":["area\/region\/district"],"pinyin":["qu1 yu4"],"word":"区域"},{"definition":["mythical beast (archaic)","to leave\/to part from\/to be away from\/(in giving distances) from\/without (sth)\/independent of\/one of the Eight Trigrams 八卦[ba1 gua4], symbolizing fire\/☲","surname Li"],"pinyin":["chi1","li2","Li2"],"word":"离"},{"definition":["(in the) vicinity\/nearby\/neighboring\/next to"],"pinyin":["fu4 jin4"],"word":"附近"},{"definition":["distance\/CL:個|个[ge4]\/to be apart from"],"pinyin":["ju4 li2"],"word":"距离"},{"definition":["to cross over\/to transcend\/to cover distance\/to overcome\/to rise above"],"pinyin":["yue4 guo4"],"word":"越过"},{"definition":["outer side"],"pinyin":["wai4 ce4"],"word":"外侧"},{"definition":["out\/outward"],"pinyin":["xiang4 wai4"],"word":"向外"},{"definition":["to detour\/to bypass\/to circumvent\/to avoid\/to wind around (of a road etc)"],"pinyin":["rao4 guo4"],"word":"绕过"},{"definition":["to pass through"],"pinyin":["chuan1 guo4"],"word":"穿过"},{"definition":["to touch"],"pinyin":["peng4 chu4"],"word":"碰触"},{"definition":["to draw close to"],"pinyin":["kao4 long3"],"word":"靠拢"}]}