{"definition":["to flog\/to lash\/to whip\/to urge or goad along"],"pinyin":["bian1 chi1"],"traditional":["鞭笞"],"rank":46662.0,"normalized_rank":0.652861919885831,"fraction":2.02324990830638e-7,"cumulative_fraction":0.9983855538667292,"word":"鞭笞","characters":[{"definition":["whip or lash\/to flog\/to whip\/conductor's baton\/segmented iron weapon (old)\/penis (of animal, served as food)"],"pinyin":["bian1"],"word":"鞭"},{"definition":["to whip with bamboo strips"],"pinyin":["chi1"],"word":"笞"}],"containing_words":[],"sentences":[{"english":"Nowadays，it is an inhumane punishment to flog the disobedient soldiers of sailors.","chinese":"今天，鞭笞抗命士兵或水手是不人道的惩罚。"},{"english":"TYPICAL USE:Nowadays, it is an inhumane punishment to flog the disobedient soldiers or sailers.","chinese":"先进，鞭笞不服从的兵士或水手是不人道的惩罚。"},{"english":"Judgments are prepared for scorners: and striking hammers for the bodies of fools.","chinese":"体刑是为轻狂人而设，鞭笞是为愚人背而备。"},{"english":"That succeeded in whipping-up some ugly elements in the Republican party.","chinese":"这些指控成功的鞭笞了共和党中一些丑恶的元素。"},{"english":"If Ross fell asleep, the baby's mother whipped her.","chinese":"假如萝丝不慎睡著了，婴儿的妈妈会鞭笞她。"},{"english":"Outside, waves pound the white sand beach, a hot wind whips the water.","chinese":"外面，波涛拍打着白砂沙滩，热风鞭笞着海水。"},{"english":"Any animal caught singing it was given a flogging on the spot.","chinese":"任何唱这歌的动物都会当场受到鞭笞。"},{"english":"I want the beating palms to cry out for Samson.","chinese":"我要那鞭笞用的棕榈，来为参孙放声痛哭。"},{"english":"Nowadays, it is an inpeoplee punishment to flog the disobedient soldiers ofsailors.","chinese":"当今，鞭笞抗命士兵或水手是不人道的惩罚。"},{"english":"Do you fear the  slash of the rain?","chinese":"你是否畏惧雨的鞭笞？"},{"english":"And let him who would lash the offender look unto the spirit of the offended.","chinese":"让鞭笞犯罪者的人也审视那受害者的灵魂。"},{"english":"Improved Lash of Pain (Destruction) and Improved Firebolt (Destruction) have been merged into one talent, Demonic Power.","chinese":"强化痛苦鞭笞以及强化小鬼合并，更名为恶魔之力。"},{"english":"In old days, teachers were used to cane the pupils as a punishment.","chinese":"从前，教师常鞭笞学生作惩罚。"},{"english":"It is enough for me to recall the flogging of peasants.","chinese":"只要回忆起农民被鞭笞的事就叫我够受的了。"},{"english":"For example, a false start of a running event might have been followed by a whipping of the violator.","chinese":"例如，赛跑比赛的偷跑者可能会受到鞭笞的惩罚。"},{"english":"You can't just whip them around and go in another direction.","chinese":"你不能只是依靠不断鞭笞他们来走上另一个方向。"}],"related":[{"definition":["to lash\/to castigate"],"pinyin":["bian1 ta4"],"word":"鞭挞"},{"definition":["to whip\/to lash\/to flog\/to thrash"],"pinyin":["bian1 da3"],"word":"鞭打"},{"definition":["to beat a prisoner (to obtain confessions)\/to give sb the third degree\/to torture"],"pinyin":["kao3 da3"],"word":"拷打"},{"definition":["to punish by flogging"],"pinyin":["ze2 da3"],"word":"责打"},{"definition":["to maltreat\/to tyrannize"],"pinyin":["ling2 nu:e4"],"word":"凌虐"},{"definition":["to question via torture"],"pinyin":["kao3 wen4"],"word":"拷问"},{"definition":["the lingering death\/the death of a thousand cuts (old form of capital punishment)"],"pinyin":["ling2 chi2"],"word":"凌迟"},{"definition":["beating with wooden staves (as corporal punishment)"],"pinyin":["zhang4 xing2"],"word":"杖刑"},{"definition":["beat up\/CL:頓|顿[dun4]"],"pinyin":["du2 da3"],"word":"毒打"},{"definition":["to injure"],"pinyin":["qiang1 hai4"],"word":"戕害"},{"definition":["to insult\/to humiliate\/to bully"],"pinyin":["ling2 ru3"],"word":"凌辱"},{"definition":["strict law\/cruel punishment\/to carry out cruel law rigorously"],"pinyin":["yan2 xing2"],"word":"严刑"},{"definition":["to beat sb soundly"],"pinyin":["tong4 da3"],"word":"痛打"},{"definition":["to criticize harshly\/to denounce\/to attack viciously"],"pinyin":["tong4 chi4"],"word":"痛斥"},{"definition":["to parade (a prisoner) through the streets"],"pinyin":["you2 jie1 shi4 zhong4"],"word":"游街示众"},{"definition":["in order to warn against following bad examples (idiom)\/as a warning to others"],"pinyin":["yi3 jing3 xiao4 you2"],"word":"以儆效尤"}]}