{"definition":["Han Xin (-196 BC), famous general of first Han emperor Liu Bang 劉邦|刘邦[Liu2 Bang1]"],"pinyin":["Han2 Xin4"],"traditional":["韓信"],"rank":34537.0,"normalized_rank":0.4832174387530956,"fraction":6.313532361778566e-7,"cumulative_fraction":0.9937625675268364,"word":"韩信","characters":[{"definition":["Han, one of the Seven Hero States of the Warring States 戰國七雄|战国七雄\/Korea from the fall of the Joseon dynasty in 1897\/Korea, esp. South Korea 大韓民國|大韩民国\/surname Han"],"pinyin":["Han2"],"word":"韩"},{"definition":["letter\/mail\/CL:封[feng1]\/to trust\/to believe\/to profess faith in\/truthful\/confidence\/trust\/at will\/at random"],"pinyin":["xin4"],"word":"信"}],"containing_words":[],"sentences":[{"english":"When Han arrived, there is no pot of rice.","chinese":"当韩信赶来，锅里已经没有饭了。"},{"english":"Hong Hyun-ik is a North Korea researcher at the Sejong Institute in Seoul.","chinese":"韩信一是首尔世宗研究所的北韩问题研究员。"},{"english":"Thinking of his ambition, Han Xin swallowed the insult and crawled between the rascal's legs.","chinese":"向到自己的远大志向，韩信忍辱爬了过去。"},{"english":"Han Xin made a kite with cowherd.","chinese":"当时是韩信用牛皮做一只风筝。"},{"english":"Finally, we should also consider Han Kin's notion of fate in order to assess him comprehensively.","chinese":"最后，要全面看待韩信还要对他的天命观有所认识。"},{"english":"Then the king called letter to him.","chinese":"于是汉王召见韩信拜他为大将。"},{"english":"Han Xin made his living by fishing in his early days but he was very ambitious . He kept a sword with him everyday.","chinese":"韩信早年靠钓鱼为生，但他志向远大，每天剑不离身。"},{"english":"The third message tells us that the Hanshin good with swords.","chinese":"第三个信息告诉我们，韩信好带刀剑。"},{"english":"Conclusion The methods developed in this experiment can be used for the quality control of Herba Scutellaria indica.","chinese":"结论所用方法可用于韩信草的质量控制。"},{"english":"Later, Han Xin became a general of Han Dynasty and achieved fame.","chinese":"后来，韩信成为汉朝大将，成就了一代英名。"},{"english":"Then added, Hanshin can not \"rule of Health merchants.\"","chinese":"然后又说，韩信不能“治生商贾”。"}],"related":[{"definition":["Liu Bang (256 or 247-195 BC), bandit leader who became first Han emperor Han Gaozu 漢高祖|汉高祖 (reigned 202-195 BC)"],"pinyin":["Liu2 Bang1"],"word":"刘邦"},{"definition":["Ying Zheng (260-210 BC), personal name of the first emperor 秦始皇[Qin2 Shi3 huang2]"],"pinyin":["Ying2 Zheng4"],"word":"嬴政"},{"definition":["Guan Yu (-219), general of Shu and blood-brother of Liu Bei in Romance of the Three Kingdoms, fearsome fighter famous for virtue and loyalty\/posthumously worshipped and identified with the guardian Bodhisattva Sangharama"],"pinyin":["Guan1 Yu3"],"word":"关羽"},{"definition":["Xiang Yu the Conqueror (232-202 BC), warlord defeated by first Han emperor"],"pinyin":["Xiang4 Yu3"],"word":"项羽"},{"definition":["Sun Bin (-316 BC), political strategist of the School of Diplomacy 縱橫家|纵横家[Zong4 heng2 jia1] during the Warring States Period (425-221 BC)"],"pinyin":["Sun1 Bin4"],"word":"孙膑"},{"definition":["Zhuge Liang (181-234), military leader and prime minister of Shu Han 蜀漢|蜀汉 during the Three Kingdoms period\/the main hero of the fictional Romance of Three Kingdoms 三國演義|三国演义, where he is portrayed as a sage and military genius\/mastermind"],"pinyin":["Zhu1 ge3 Liang4"],"word":"诸葛亮"},{"definition":["Cao Cao (155-220), famous statesman and general at the end of Han, noted poet and calligrapher, later warlord, founder and first king of Cao Wei 曹魏, father of Emperor Cao Pi 曹丕\/the main villain of novel the Romance of Three Kingdoms 三國演義|三国演义"],"pinyin":["Cao2 Cao1"],"word":"曹操"},{"definition":["Zhang Fei (168-221), general of Shu and blood-brother of Liu Bei in Romance of the Three Kingdoms, famous as fearsome fighter and lover of wine"],"pinyin":["Zhang1 Fei1"],"word":"张飞"},{"definition":["Jiang Ziya (c. 1100 BC, dates of birth and death unknown), partly mythical sage advisor to King Wen of Zhou 周文王[Zhou1 Wen2 wang2] and purported author of “Six Secret Strategic Teachings” 六韜|六韬[Liu4 tao1], one of the Seven Military Classics of ancient China 武經七書|武经七书[Wu3 jing1 Qi1 shu1]"],"pinyin":["Jiang1 Zi3 ya2"],"word":"姜子牙"},{"definition":["Diaochan (-192), one of the four legendary beauties 四大美女[si4 da4 mei3 nu:3], in fiction a famous beauty at the break-up of Han dynasty, given as concubine to usurping warlord Dong Zhuo 董卓[Dong3 Zhuo2] to ensure his overthrow by fighting hero Lü Bu 呂布|吕布[Lu:3 Bu4]"],"pinyin":["Diao1 Chan2"],"word":"貂蝉"},{"definition":["Lü Bu (-198), general and warlord"],"pinyin":["Lu:3 Bu4"],"word":"吕布"},{"definition":["Bai Qi (-258 BC), famous general of Qin 秦國|秦国, the victor at 長平|长平 in 260 BC\/same as 公孫起|公孙起"],"pinyin":["Bai2 Qi3"],"word":"白起"},{"definition":["Huang Zhong (-220), general of Shu in Romance of the Three Kingdoms, portrayed as an old fighter"],"pinyin":["Huang2 Zhong1"],"word":"黄忠"},{"definition":["Jing Ke (-227 BC), celebrated in verse and fiction as would-be assassin of King Ying Zheng of Qin 秦嬴政 (later the First Emperor 秦始皇)"],"pinyin":["Jing1 Ke1"],"word":"荆轲"},{"definition":["Zhao Yun (-229), general of Shu in Romance of the Three Kingdoms"],"pinyin":["Zhao4 Yun2"],"word":"赵云"},{"definition":["Lian Po (327-243 BC), famous general of Zhao 趙國|赵国, repeatedly victorious over Qin 秦國|秦国 and Qi 齊國|齐国"],"pinyin":["Lian2 Po1"],"word":"廉颇"}]}