{"definition":["Han Fei, also known as Han Feizi 韓非子|韩非子[Han2 Fei1 zi3] (c. 280-233 BC), Legalist philosopher of the Warring States Period (475-220 BC)"],"pinyin":["Han2 Fei1"],"traditional":["韓非"],"rank":43806.0,"normalized_rank":0.612902774474277,"fraction":2.6786894529164553e-7,"cumulative_fraction":0.9977175936750864,"word":"韩非","characters":[{"definition":["Han, one of the Seven Hero States of the Warring States 戰國七雄|战国七雄\/Korea from the fall of the Joseon dynasty in 1897\/Korea, esp. South Korea 大韓民國|大韩民国\/surname Han"],"pinyin":["Han2"],"word":"韩"},{"definition":["abbr. for 非洲[Fei1 zhou1], Africa","to not be\/not\/wrong\/incorrect\/non-\/un-\/in-\/to reproach or blame\/(colloquial) to insist on\/simply must"],"pinyin":["Fei1","fei1"],"word":"非"}],"containing_words":[{"definition":["Han Feizi, book of Legalist Philosophy authored by Han Fei 韓非|韩非[Han2 Fei1] during the Warring States Period (475-220 BC)"],"pinyin":["Han2 Fei1 zi3"],"word":"韩非子"}],"sentences":[{"english":"Hanfeizi has reflected Hanfei's political viewpoint in a concentrated way.","chinese":"《韩非子》集中反映了韩非的政治观点。"},{"english":"Hanfeizi has reflected Hanfei's political viewpoint in a concentrated way.","chinese":"《韩非子》集中反映了韩非的政治观点。"},{"english":"Recognizing Han Fei, in particular its law philosophy is a responsibility.","chinese":"认识韩非，尤其是其法哲学思想是一种责任。"},{"english":"Hanfeizi is one of the most important writings in warring states period.","chinese":"《韩非子》是我国战国末期的一部重要文献。"},{"english":"Han Fei inherited and developed the perspectives of reason and desire of Huan-Law Teachings.","chinese":"韩非继承和发展了黄老之学的理欲观。"},{"english":"Today my aunt took me to Happy Land.","chinese":"今天我的姑姑带我去韩非乐园。"},{"english":"Legalist Han Fei theory and from different angles.","chinese":"法家韩非从不同角度论和。"},{"english":"But I'm sure that Han Fei the design is presented.","chinese":"但可以肯定的是韩非的设计思想比较坚决。"},{"english":"Han Fei is the great master of legal thinking at the end of the Warring States period.","chinese":"韩非是战国末季法家思想的集大成者。"},{"english":"Legalism Han Fei is a master of the late Warring States Period were.","chinese":"韩非是战国末年法家思想的集大成者。"},{"english":"The second chapter \"Han Feizi\" cites the historical facts reflection the thought.","chinese":"第二章是《韩非子》称引故实反映的思想。"},{"english":"Han Fei-tzu sat in lotus position on the bare wooden floor beside his wife's sickbed.","chinese":"韩非子坐在她妻子的病床旁，光木地板上的莲座里。"},{"english":"The Comparison of Mind Theory from Shyun Tze and Han Fei …","chinese":"荀子论心和韩非子所蕴涵的心论之比较研究。"},{"english":"In Part One, Han Fei advocated that the principles of benefits be drive of ruling the country.","chinese":"第一部分，韩非提出用利益原则来作为治国的驱动力。"},{"english":"Han Fei and the rule of law is based on the reality that exists.","chinese":"韩非的法治主义的基础是对现实存在的相信。"},{"english":"Rebelliously, Han Fei-tzu gave her the most false answer to her question.","chinese":"韩非子难以控制的给了她最错误的答案。"}],"related":[{"definition":["Li Si (c. 280-208 BC), Legalist philosopher, calligrapher and prime minister of Qin kingdom and Qin dynasty from 246 to 208 BC"],"pinyin":["Li3 Si1"],"word":"李斯"},{"definition":["Su Qin (340-284 BC), political strategist of the School of Diplomacy 縱橫家|纵横家[Zong4 heng2 jia1] during the Warring States Period (475-220 BC)"],"pinyin":["Su1 Qin2"],"word":"苏秦"},{"definition":["Wei Lao (c. 450 BC, dates of birth and death unknown), advisor to the first Qin emperor Qin Shihuang 秦始皇[Qin2 Shi3 huang2], possible author of the Wei Liaozi 尉繚子|尉缭子[Wei4 Liao2 zi5] text on military strategy"],"pinyin":["Wei4 Liao2"],"word":"尉缭"},{"definition":["Zhang Yi (-309 BC), political strategist of the School of Diplomacy 縱橫家|纵横家[Zong4 heng2 jia1] during the Warring States Period (475-221 BC)"],"pinyin":["Zhang1 Yi2"],"word":"张仪"},{"definition":["Lü Buwei (?291-235 BC), merchant and politician of the State of Qin 秦國|秦国[Qin2 guo2], subsequent Qin Dynasty 秦代[Qin2 dai4] Chancellor, allegedly the father of Ying Zheng 嬴政[Ying2 Zheng4], who subsequently became the first emperor Qin Shihuang 秦始皇[Qin2 Shi3 huang2]"],"pinyin":["Lu:3 Bu4 wei2"],"word":"吕不韦"},{"definition":["Shang Yang (c. 390-338 BC), legalist philosopher and statesman of the state of Qin 秦國|秦国[Qin2 guo2], whose reforms paved the way for the eventual unification of the Chinese empire by the Qin dynasty 秦朝|秦朝[Qin2 chao2]"],"pinyin":["Shang1 Yang1"],"word":"商鞅"},{"definition":["Han Feizi, book of Legalist Philosophy authored by Han Fei 韓非|韩非[Han2 Fei1] during the Warring States Period (475-220 BC)"],"pinyin":["Han2 Fei1 zi3"],"word":"韩非子"},{"definition":["Zhao Gao (?-207 BC), one of the most vile, corrupt and powerful eunuchs in Chinese history, responsible for the fall of Qin Dynasty"],"pinyin":["Zhao4 Gao1"],"word":"赵高"},{"definition":["Shen Buhai (385-337 BC), legalist political thinker"],"pinyin":["Shen1 Bu4 hai4"],"word":"申不害"},{"definition":["Qin general Meng Tian (-210 BC), involved in 215 BC in fighting the Northern Xiongnu 匈奴 and building the great wall"],"pinyin":["Meng2 Tian2"],"word":"蒙恬"},{"definition":["Prince Dan of Yan (-226 BC), commissioned the attempted assassination of King Ying Zheng of Qin 秦嬴政 (later the First Emperor 秦始皇) by Jing Ke 荆轲 in 227 BC"],"pinyin":["Tai4 zi3 Dan1"],"word":"太子丹"},{"definition":["Zou Yan (305-240 BC), founder of the School of Yin-Yang of the Warring States Period (475-221 BC)"],"pinyin":["Zou1 Yan3"],"word":"邹衍"},{"definition":["Jing Ke (-227 BC), celebrated in verse and fiction as would-be assassin of King Ying Zheng of Qin 秦嬴政 (later the First Emperor 秦始皇)"],"pinyin":["Jing1 Ke1"],"word":"荆轲"},{"definition":["Duke Xiao of Qin, 秦國|秦国[Qin2 guo2], ruled 361-338 BC during the Warring States Period"],"pinyin":["Qin2 Xiao4 gong1"],"word":"秦孝公"},{"definition":["the state of Qin, one of the seven states of the Warring States Period (475-220 BC)"],"pinyin":["Qin2 guo2"],"word":"秦国"},{"definition":["Grand Scribe, the title by which Sima Qian 司馬遷|司马迁[Si1 ma3 Qian1] refers to himself in Records of the Historian 史記|史记[Shi3 ji4]"],"pinyin":["Tai4 shi3 gong1"],"word":"太史公"}]}