{"definition":["top floor\/the top of a building"],"pinyin":["ding3 ceng2"],"traditional":["頂層"],"rank":17228.0,"normalized_rank":0.2410420718313209,"fraction":0.000003202749133350792,"cumulative_fraction":0.9671572334009648,"word":"顶层","characters":[{"definition":["apex\/crown of the head\/top\/roof\/most\/to carry on the head\/to push to the top\/to go against\/to replace\/to substitute\/to be subjected to (an aerial bombing, hailstorm etc)\/(slang) to \"bump\" a forum thread to raise its profile\/classifier for headwear, hats, veils etc"],"pinyin":["ding3"],"word":"顶"},{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"层"}],"containing_words":[],"sentences":[{"english":"Top-design is very important for information resource management system in e-government.","chinese":"实例证明电子政务信息资源管理系统需要顶层设计。"},{"english":"The top-level design of micro turbine Jet-engine is presented in the paper.","chinese":"对微型涡轮喷气发动机的顶层设计问题进行了研究。"},{"english":"A top layer is coextensive with and secured to the first side of the synthetic rubber layer.","chinese":"顶层与合成橡胶层的第一侧同延并固定到该第一侧。"},{"english":"At the top is the super-hot corona, which is made of structures such as loops and streams of ionized gas.","chinese":"最顶层的是超热日冕，由日冕环和电离气体流组成。"},{"english":"In 1, the top of the plant room in direct sunlight, poor ventilation.","chinese":"机房在厂房的最顶层阳光直照，通风不良。"},{"english":"The 10% share has gone from 35 to 48.","chinese":"10%的顶层的份额从35增加至48。"},{"english":"In summer the sun beats down on the roof, so that the upper rooms become unbearably hot.","chinese":"夏天炎日照射屋顶，顶层的房间热得受不了。"},{"english":"It is one of the common engineering accidents that temperature crevice arises in the top coat vertical wall of a brick concrete building.","chinese":"砖混房屋顶层纵墙出现温度裂缝是常见工程事故之一。"},{"english":"Qatari prime minister Sheikh Hamad bin Jassim, who recently purchased another penthouse in the same development.","chinese":"他于最近在同一地方购买了另一栋顶层公寓。"},{"english":"Can be circled and the wooden ladder to the top, look around Pingliang city scenery.","chinese":"可以木梯盘旋而上至顶层，举目四望平凉城市风光。"},{"english":"Around the veranda paved with stepping Ishidan, leading to the top.","chinese":"四周廊子铺有踏磴，可通顶层。"},{"english":"And it's that strong support layer that evens out the top layer and wards off wrinkles.","chinese":"它的这一强有力的支持层，文思了顶层和病房了皱纹。"},{"english":"The buddha's tooth installs in a golden box, puts in a temple top layer darkroom.","chinese":"佛牙装在一个金盒子中，搁在庙的顶层一个暗室里。"},{"english":"Long before any code is written. This is top-level section is going to change the fundamentals of how your site functions.","chinese":"这一顶层部分将会改变形成你的网站功能的基础。"},{"english":"The suite occupies the entire top floor of the hotel.","chinese":"这个套房占据了整个酒店的顶层。"},{"english":"You need to reach the absolute top of the building to get to the proper Vantage point.","chinese":"你需要上到建筑物的最顶层来占取有利地形。"}],"related":[{"definition":["top floor\/attic\/loft\/garret\/penthouse\/(flat) rooftop (often used as an outdoor living area etc)"],"pinyin":["ding3 lou2"],"word":"顶楼"},{"definition":["upper layer"],"pinyin":["shang4 ceng2"],"word":"上层"},{"definition":["underlayer\/lower class\/lower strata\/substrate"],"pinyin":["xia4 ceng2"],"word":"下层"},{"definition":["story\/floor"],"pinyin":["lou2 ceng2"],"word":"楼层"},{"definition":["top of a building"],"pinyin":["lou2 ding3"],"word":"楼顶"},{"definition":["building (a relatively large, multi-storey one)\/CL:幢[zhuang4],座[zuo4]"],"pinyin":["da4 lou2"],"word":"大楼"},{"definition":["summit\/peak"],"pinyin":["ding3 duan1"],"word":"顶端"},{"definition":["spire\/peak of a pagoda"],"pinyin":["ta3 jian1"],"word":"塔尖"},{"definition":["garret\/loft\/attic"],"pinyin":["ge2 lou2"],"word":"阁楼"},{"definition":["tower (of building)"],"pinyin":["ta3 lou2"],"word":"塔楼"},{"definition":["ground or first floor\/bottom (of a pile)\/lowest rung (of society)"],"pinyin":["di3 ceng2"],"word":"底层"},{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"层"},{"definition":["surname Lou","house with more than 1 story\/storied building\/floor\/CL:層|层[ceng2],座[zuo4],棟|栋[dong4]"],"pinyin":["Lou2","lou2"],"word":"楼"},{"definition":["(used in the names of grand buildings such as 百老匯大廈|百老汇大厦 Broadway Mansions (in Shanghai) or 帝國大廈|帝国大厦 Empire State Building etc)"],"pinyin":["da4 sha4"],"word":"大厦"},{"definition":["low level"],"pinyin":["di1 ceng2"],"word":"低层"},{"definition":["basement\/cellar"],"pinyin":["di4 xia4 shi4"],"word":"地下室"}]}