{"definition":["to replace"],"pinyin":["ding3 ti4"],"traditional":["頂替"],"rank":11547.0,"normalized_rank":0.16155751122801618,"fraction":0.000006531185003429708,"cumulative_fraction":0.9410614084895998,"word":"顶替","characters":[{"definition":["apex\/crown of the head\/top\/roof\/most\/to carry on the head\/to push to the top\/to go against\/to replace\/to substitute\/to be subjected to (an aerial bombing, hailstorm etc)\/(slang) to \"bump\" a forum thread to raise its profile\/classifier for headwear, hats, veils etc"],"pinyin":["ding3"],"word":"顶"},{"definition":["to substitute for\/to take the place of\/to replace\/for\/on behalf of\/to stand in for"],"pinyin":["ti4"],"word":"替"}],"containing_words":[{"definition":["to assume sb's name and take his place (idiom); to impersonate\/to pose under a false name"],"pinyin":["mao4 ming2 ding3 ti4"],"word":"冒名顶替"},{"definition":["impersonator\/impostor"],"pinyin":["mao4 ming2 ding3 ti4 zhe3"],"word":"冒名顶替者"}],"sentences":[{"english":"That would pave the way for newlywed Odom to start in his place.","chinese":"那就为新婚燕尔的奥多姆顶替他首发铺平了道路。"},{"english":"They rang in a player in the game under a false name.","chinese":"他们偷偷塞进一名运动员冒名顶替参加比赛。"},{"english":"Two dogs for Guo cut prisoners, also to take eight finger blood hacked joe.","chinese":"二狗顶替郭割掳，同样就要担下砍死乔八指的血债。"},{"english":"Righty is an imposter.","chinese":"小右是冒名顶替的。"},{"english":"Mira Wang, to recognize his own daughter to college impostor fact.","chinese":"王峥嵘承认自己的女儿冒名顶替上大学的事实。"},{"english":"We'll have to find someone to fill in for Francis tonight as he's ill.","chinese":"费朗西斯病了，我们得找个什么人今晚顶替他。"},{"english":"Typically, these can masquerade as a conventional mouse or keyboard.","chinese":"这些可以顶替常规的鼠标或键盘。"},{"english":"It was only a question of a trifling substitution of names.","chinese":"那不过是一件小小的冒名顶替的事罢了。"},{"english":"Then they're both imposters.","chinese":"那他们就都是冒名顶替者了。"},{"english":"The presidential impersonator has not been found.","chinese":"总统的冒名顶替者尚未被找到。"},{"english":"Don't be fooled by impostors and copycats whose feeds keep getting disabled. This is the only offici…","chinese":"不要被愚弄的冒名顶替者和抄袭的饲料不断得到禁用。"},{"english":"Off you go, have a nice life, there's plenty of people to replace you.","chinese":"再见，祝你愉快，多的是人顶替你。"},{"english":"Remove the likes of the imposter.","chinese":"除去冒名顶替者喜欢。"},{"english":"And blights with plague the Marriage hearse.","chinese":"更带来瘟疫，将灵车顶替了婚床。"},{"english":"The representative of register.com then sent the imposter a security code that he had to provide.","chinese":"的人员随后请冒名顶替者提供所需的安全码。"},{"english":"But for now, Harrison and Perry and Jared offer a pretty good substitute.","chinese":"不过眼下，哈里森佩里贾里德们顶替得相当不错。"}],"related":[{"definition":["to replace\/to take over (a position or post)"],"pinyin":["jie1 ti4"],"word":"接替"},{"definition":["vacancy"],"pinyin":["kong4 que1"],"word":"空缺"},{"definition":["choice of person\/candidate"],"pinyin":["ren2 xuan3"],"word":"人选"},{"definition":["to appear on stage in an amateur capacity\/(of a professional) to make a guest appearance\/(fig.) to assume a role outside one's usual duties\/to substitute for"],"pinyin":["ke4 chuan4"],"word":"客串"},{"definition":["to replace sb (personnel, sports team player etc)\/substitution"],"pinyin":["huan4 ren2"],"word":"换人"},{"definition":["to exchange\/to replace\/to substitute for\/to switch"],"pinyin":["ti4 huan4"],"word":"替换"},{"definition":["(idiom) to take on a leadership role at a time of crisis"],"pinyin":["lin2 wei1 shou4 ming4"],"word":"临危受命"},{"definition":["to replace (a damaged component with a new one, an injured player with a substitute player, full-time workers with casual workers etc)\/a substitute\/a replacement"],"pinyin":["ti4 bu3"],"word":"替补"},{"definition":["first issue\/first public showing"],"pinyin":["shou3 fa1"],"word":"首发"},{"definition":["to take up a post\/to start in a new job"],"pinyin":["chu1 ren4"],"word":"出任"},{"definition":["(of a performer) to come onto the stage to perform\/(of an athlete) to enter the arena to compete\/(fig.) to enter the scene (e.g. a new product)\/(of an examinee etc) to leave the venue"],"pinyin":["chu1 chang3"],"word":"出场"},{"definition":["initial\/arising first\/same as 首先發起|首先发起"],"pinyin":["xian1 fa1"],"word":"先发"},{"definition":["to rotate\/to take turns\/to switch"],"pinyin":["lun2 huan4"],"word":"轮换"},{"definition":["to stop using\/to abandon\/abandoned\/deprecated"],"pinyin":["qi4 yong4"],"word":"弃用"},{"definition":["to come back out of retirement\/to get involved again after having withdrawn"],"pinyin":["fu4 chu1"],"word":"复出"},{"definition":["substitute"],"pinyin":["dai4 ti4 zhe3"],"word":"代替者"}]}