{"definition":["to have misgivings\/apprehension\/worry\/qualm\/scruple"],"pinyin":["gu4 ji4"],"traditional":["顧忌"],"rank":17741.0,"normalized_rank":0.2482196074041946,"fraction":0.0000030144379946988994,"cumulative_fraction":0.9687515686345176,"word":"顾忌","characters":[{"definition":["surname Gu","to look after\/to take into consideration\/to attend to"],"pinyin":["Gu4","gu4"],"word":"顾"},{"definition":["to be jealous of\/fear\/dread\/scruple\/to avoid or abstain from\/to quit\/to give up sth"],"pinyin":["ji4"],"word":"忌"}],"containing_words":[],"sentences":[{"english":"Do you think the news media in Hong Kong have any scruple about criticizing the XX Government?","chinese":"你觉得香港新闻传媒系批评XX政府既时候有冇顾忌？"},{"english":"Can you explain why you’re not in a position to say?","chinese":"能解释一下为什么你们不能说么，是有所顾忌么？"},{"english":"So every person on the earth can enjoy abundance without any scruple.","chinese":"所以，地球上的每个人都可以毫无顾忌地享受充裕。"},{"english":"He would have no qualms about using missiles to unleash a nuclear war.","chinese":"他会毫无顾忌地利用火箭发动一场核战争。"},{"english":"\"Do you have scruples about that old headman in the temple?\"The sea pumice disagrees a way.","chinese":"“你顾忌宫里那个老头子？”海浮石不以为然道。"},{"english":"The insolence and brutality of anger, in the same manner, when we indulge its fury without check or restraint, is, of all objects, the most detestable.","chinese":"以此类推，无所顾忌傲慢粗鲁的愤怒是最令人憎恶的。"},{"english":"I felt entirely free and unconcerned.","chinese":"我感到完全自由，毫无顾忌。"},{"english":"Dog day zhen see night come and dont begin, can not help but have scruples.","chinese":"天贞见夜犬来了又不动手，不禁有所顾忌。"},{"english":"The nonage can not enter bar to not have scruples about inside the scope by them.","chinese":"未成年人不能进酒吧可不在他们顾忌范围内。"},{"english":"Chen MengFei feeling, no scruple of supplication.","chinese":"陈超顾忌孟菲感受，没有再同意欣儿的恳求。"},{"english":"The frank espousal of a policy of annihilating opponents and the murders committed in the pursuance of it have given rise to an opposition movement.","chinese":"毫无顾忌地灭绝反对派，以执行公务的名义进行谋杀。"},{"english":"But the Japanese government did not dare to take any further action for fear of reaction from China.","chinese":"由于顾忌中国的反应，日本政府未敢轻举妄动。"},{"english":"There are no limits;you just have to know what would excite her.","chinese":"你不用顾忌什么，只要知晓什么能让她兴奋就好。"},{"english":"The Chinese actually have a great hesitance in general to face death as it is.","chinese":"中国人一般在谈及死亡的时候有很多顾忌。"},{"english":"Actually i as soon as put out a hand may hug you, but i have too much scruples.","chinese":"事实上我一伸出手就可以揽住你，但系我有太多顾忌。"},{"english":"People feel no qualms about pushing whenever it becomes crowded.","chinese":"人们在感到拥挤时毫无顾忌地乱推乱搡。"}],"related":[{"definition":["misgivings\/apprehensions"],"pinyin":["gu4 lu:4"],"word":"顾虑"},{"definition":["to be afraid of the consequences\/restraining fear"],"pinyin":["ji4 dan4"],"word":"忌惮"},{"definition":["to take into consideration\/to attend to"],"pinyin":["gu4 ji2"],"word":"顾及"},{"definition":["to count on\/to rely on"],"pinyin":["yi1 zhang4"],"word":"依仗"},{"definition":["to fear\/to dread\/foreboding"],"pinyin":["wei4 ju4"],"word":"畏惧"},{"definition":["to guard against"],"pinyin":["fang2 bei4"],"word":"防备"},{"definition":["an obstruction\/barrier\/ill-feeling\/grudge"],"pinyin":["jie4 di4"],"word":"芥蒂"},{"definition":["to lean on\/to rely on"],"pinyin":["yi3 zhang4"],"word":"倚仗"},{"definition":["to bother about\/to haggle\/to bicker\/to argue\/plan\/stratagem"],"pinyin":["ji4 jiao4"],"word":"计较"},{"definition":["lit. to refrain from shooting at the rat for fear of breaking the vases (idiom)\/to not act against an evil so as to prevent harm to innocents"],"pinyin":["tou2 shu3 ji4 qi4"],"word":"投鼠忌器"},{"definition":["to stop\/to obstruct"],"pinyin":["zu3 lan2"],"word":"阻拦"},{"definition":["to get involved in\/to meddle\/interference"],"pinyin":["cha1 shou3"],"word":"插手"},{"definition":["to be secretive; to try to cover up (idiom)"],"pinyin":["zhe1 zhe1 yan3 yan3"],"word":"遮遮掩掩"},{"definition":["to understand\/to pay attention to\/to take notice of"],"pinyin":["li3 hui4"],"word":"理会"},{"definition":["to be afraid"],"pinyin":["ju4 pa4"],"word":"惧怕"},{"definition":["vigilance\/wariness"],"pinyin":["jie4 xin1"],"word":"戒心"}]}