{"definition":["preliminary hearing\/interrogation (of a suspect)\/preliminary examination (of a project etc)"],"pinyin":["yu4 shen3"],"traditional":["預審"],"rank":20020.0,"normalized_rank":0.28010577420844235,"fraction":0.00000238892386359552,"cumulative_fraction":0.9748858588636932,"word":"预审","characters":[{"definition":["to advance\/in advance\/beforehand\/to prepare"],"pinyin":["yu4"],"word":"预"},{"definition":["to examine\/to investigate\/carefully\/to try (in court)"],"pinyin":["shen3"],"word":"审"}],"containing_words":[],"sentences":[{"english":"Only the Pre-Trial Chamber has the authority to issue arrest warrants or summonses.","chinese":"只有预审庭有权力发布拘捕证或传票。"},{"english":"After the user selects the cost, the next level of appropriate preapprovers is displayed.","chinese":"用户选择成本之后，将显示下一级别的相应预审批人。"},{"english":"Prequalification enables the employer to establish, in advance, the competence of firms.","chinese":"资格预审能使雇主提前确定公司的实力。"},{"english":"Being pre-qualified gives you a general idea of how much you can afford to borrow.","chinese":"参加资格预审可以让你大致了解自己能够贷款多少。"},{"english":"WHO pre-qualified the vaccine.","chinese":"世卫组织对疫苗进行了资格预审。"},{"english":"Subsequent to indictments and arrests, the examining magistrate deals with the individual cases.","chinese":"继起诉和逮捕之后，预审法官开始处理个案。"},{"english":"Each buyer is pre-qualified.","chinese":"每个买家通过资格预审的。"},{"english":"What factors does the Pre-Trial Chamber consider in making its decision on the arrest warrant?","chinese":"在做拘捕证决定时，预审庭考虑什么因素？"},{"english":"Now, we are seeing both parties being involved even at the pre-transaction stage.","chinese":"目前，即使在预审阶段，我们都是双方共同参与。"},{"english":"Why does WHO run the Prequalification of Medicines Programme?","chinese":"为什么世卫组织要实施药品资格预审规划？"},{"english":"Abstract: Prequalification is the first key step that the construction enterprises strive for project implementation.","chinese":"资格预审是施工企业争取项目实施权的的“入门仗”。"},{"english":"A vaccine for Japanese encephalitis which will be submitted shortly to WHO for prequalification.","chinese":"一种日本脑炎的疫苗，它即将提交世界卫生组织预审。"},{"english":"Only products included in an EOI are eligible for prequalification.","chinese":"只有列入意向书的产品才有资格接受资格预审。"},{"english":"Pre-trial judge system does not fit China.","chinese":"我国不宜引进预审法官制度。"},{"english":"Bidder pre-qualification inquiry is adopted in this bidding process.","chinese":"本次招标采用资格预审方式。"}],"related":[{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"审查"},{"definition":["preliminary trial"],"pinyin":["chu1 shen3"],"word":"初审"},{"definition":["to report for judgment\/to submit for approval"],"pinyin":["bao4 shen3"],"word":"报审"},{"definition":["to bring sb to trial"],"pinyin":["ti2 xun4"],"word":"提讯"},{"definition":["to examine and approve\/to endorse"],"pinyin":["shen3 pi1"],"word":"审批"},{"definition":["to reconsider\/to reexamine\/to review (e.g. a report prior to accepting it)"],"pinyin":["fu4 he2"],"word":"复核"},{"definition":["to report for criticism\/to submit for approval to higher authority"],"pinyin":["bao4 pi1"],"word":"报批"},{"definition":["to accept to hear a case\/to handle (a service)"],"pinyin":["shou4 li3"],"word":"受理"},{"definition":["to commit sb for trial\/to bring sb for interrogation"],"pinyin":["ti2 shen3"],"word":"提审"},{"definition":["joint hearing\/to review jointly (i.e. with other checkers)"],"pinyin":["hui4 shen3"],"word":"会审"},{"definition":["bid inviting and bid offering\/bidding\/auction"],"pinyin":["zhao1 tou2 biao1"],"word":"招投标"},{"definition":["to register (to an official organism)\/to file a case (for investigation)"],"pinyin":["li4 an4"],"word":"立案"},{"definition":["Tax Bureau\/Inland Revenue Department (Hong Kong)"],"pinyin":["Shui4 wu4 ju2"],"word":"税务局"},{"definition":["to review a judicial case\/to reexamine"],"pinyin":["fu4 shen3"],"word":"复审"},{"definition":["to collect evidence"],"pinyin":["qu3 zheng4"],"word":"取证"},{"definition":["to handle a case"],"pinyin":["ban4 an4"],"word":"办案"}]}