{"definition":["beforehand\/in advance"],"pinyin":["yu4 xian1"],"traditional":["預先"],"rank":10773.0,"normalized_rank":0.15072824703034712,"fraction":0.000007314500949170835,"cumulative_fraction":0.9357154456180976,"word":"预先","characters":[{"definition":["to advance\/in advance\/beforehand\/to prepare"],"pinyin":["yu4"],"word":"预"},{"definition":["early\/prior\/former\/in advance\/first"],"pinyin":["xian1"],"word":"先"}],"containing_words":[],"sentences":[{"english":"It's much cheaper to anticipate rather than respond.","chinese":"因为预先做出反应远比事后补救便宜的多。"},{"english":"The molecular sieve pretreated by alkali can improve the stability of catalysts obviously.","chinese":"分子筛预先经碱处理，能够明显改善催化剂稳定性。"},{"english":"Used to set the track pre-gap for all tracks in sectors globally.","chinese":"用来设置为所有全域磁区内轨道的轨道预先间隙。"},{"english":"Eating utensils and food trays are cleaned at the hygiene station with premoistened towelettes.","chinese":"就餐器具和食物盘在卫生站用预先弄湿的小毛巾清理。"},{"english":"This would be a valid passing opportunity regardless of whether there was pre-existing overlap.","chinese":"这时后车有权超越，无论有无预先存在“重叠”。"},{"english":"Thus, network issues are supposed to be detected and pro-actively addressed.","chinese":"因此，网络故障将会被探测并预先解决。"},{"english":"Randomisation assignments were generated by the medical coordinating centre by a pre-decided schedule.","chinese":"医疗协调中心根据预先制订的计划生成随机化分配。"},{"english":"Such advance studies can greatly expedite regulatory approval.","chinese":"这种预先研究可以大大加快管制审批。"},{"english":"You can also pick from a list of pre-defined ABG types.","chinese":"你还可以从一个预先定义的ABG类型当中进行挑选。"},{"english":"Investment is all upfront. There is no insurance available.","chinese":"投资都是预先支付，买不到任何保险服务。"},{"english":"Anyone who would like to request teachings from Rinpoche, kindly register early for a private interview.","chinese":"如需向仁波切请法，请预先报名以便通知。"},{"english":"You can include additional files in your pre-deployment or post-deployment script.","chinese":"可在预先部署脚本或后期部署脚本中包含其他文件。"},{"english":"The computer then calls back at a certain preauthorized number.","chinese":"计算机随后会回叫某个预先授权的号码。"},{"english":"The surprises will be announced once we are prepositioned to accomplish them.","chinese":"的惊喜将公布一次，我们预先实现这些目标。"},{"english":"Or, at least a series of foods that have previously been programmed into the machine.","chinese":"或者，至少是那些被预先编到机器程序里的食物。"},{"english":"Predetermine the rest positions on a route and only chalk up and rest there.","chinese":"预先设定好一条路线的休息点并且只在那一点上休息。"}],"related":[{"definition":["in advance\/before the event\/beforehand\/prior"],"pinyin":["shi4 xian1"],"word":"事先"},{"definition":["in advance\/before the event"],"pinyin":["shi4 qian2"],"word":"事前"},{"definition":["to presuppose\/to predispose\/to preset\/presupposition\/predisposition\/default (value etc)"],"pinyin":["yu4 she4"],"word":"预设"},{"definition":["to shift to an earlier date\/to do sth ahead of time\/in advance"],"pinyin":["ti2 qian2"],"word":"提前"},{"definition":["ahead of schedule\/sooner than planned\/to bring forward (to an earlier time)"],"pinyin":["ti2 zao3"],"word":"提早"},{"definition":["so that\/so as to\/in order to"],"pinyin":["yi3 bian4"],"word":"以便"},{"definition":["to select\/to choose\/to settle on"],"pinyin":["xuan3 ding4"],"word":"选定"},{"definition":["accurate\/precise"],"pinyin":["jing1 que4"],"word":"精确"},{"definition":["special\/specific\/designated\/particular"],"pinyin":["te4 ding4"],"word":"特定"},{"definition":["to precede others\/in advance"],"pinyin":["xian1 xing2"],"word":"先行"},{"definition":["to correspond\/answering (one another)\/to agree (among the part)\/corresponding\/relevant\/appropriate\/(modify) accordingly"],"pinyin":["xiang1 ying4"],"word":"相应"},{"definition":["according to\/in light of"],"pinyin":["yi1 zhao4"],"word":"依照"},{"definition":["to appoint\/to assign\/to indicate clearly and with certainty\/designated"],"pinyin":["zhi3 ding4"],"word":"指定"},{"definition":["procedures\/sequence\/order\/computer program"],"pinyin":["cheng2 xu4"],"word":"程序"},{"definition":["necessary (for)\/required"],"pinyin":["suo3 xu1"],"word":"所需"},{"definition":["easy to\/convenient for"],"pinyin":["bian4 yu2"],"word":"便于"}]}