{"definition":["dummy run\/to run through sth\/to rehearse"],"pinyin":["yu4 yan3"],"traditional":["預演"],"rank":20077.0,"normalized_rank":0.2809032781609839,"fraction":0.00000237534794429736,"cumulative_fraction":0.9750216481280658,"word":"预演","characters":[{"definition":["to advance\/in advance\/beforehand\/to prepare"],"pinyin":["yu4"],"word":"预"},{"definition":["to develop\/to evolve\/to practice\/to perform\/to play\/to act"],"pinyin":["yan3"],"word":"演"}],"containing_words":[],"sentences":[{"english":"The Green Book was an exercise, if a daft one, in utopian totalitarianism.","chinese":"绿皮书就是乌托邦式的极权主义的拙劣预演。"},{"english":"The earlier protests had just been dress rehearsals for full-scale revolution.","chinese":"早期的抗议仅仅是大革命开始前的预演。"},{"english":"Previews for the play began on Thursday but the official opening is October 16.","chinese":"预演于周四开始，但正式的演出在10月16日。"},{"english":"The rehearsal ended with jumps by parachute teams.","chinese":"最后，八一跳伞队为本次预演画上了句号。"},{"english":"The complex logistical preparations will serve as a dry run for future efforts.","chinese":"综合的后勤准备会是未来实战的预演。"},{"english":"Role-play possible situations with the child.","chinese":"和孩子预演可能出现的险情。"},{"english":"His symphony was laughed off the stage at its first rehear sal.","chinese":"他的交响曲在第一次预演时就受到嘲笑而不能上演。"},{"english":"The Screen Designer is no longer a technology preview.","chinese":"界面设计器不再是一个技术上的预演。"},{"english":"So far, the mostly young audiences at the preview performances seem impressed.","chinese":"到目前为止，以年轻人为主的观众似乎被预演打动了。"},{"english":"We rehearsed for days before the speech contest.","chinese":"我们在演讲比赛前预演了好几天。"},{"english":"They see the result they want clearly and rehearse it over and over again.","chinese":"他们可以清楚地看到想要的结果，一遍又一遍地预演。"},{"english":"Liu Yan, a dancer from Inner Mongolia, was paralyzed after falling when rehearsing for the opening ceremony of the Olympics.","chinese":"内蒙舞蹈演员刘岩在奥运开幕式预演时因摔伤而残废。"},{"english":"Liu's magicis one of the most anticipated shows during the night.","chinese":"在春晚当天，刘谦将表演最先预演的魔术。"},{"english":"Trenberth regards extreme weather as an analogue, a dry run to the future.","chinese":"川伯斯认为，极端性天气是未来气候的类比和预演。"}],"related":[{"definition":["to plan a military mission on a sand table (idiom)\/to rehearse a planned action or activity\/to conduct a dry run"],"pinyin":["sha1 pan2 tui1 yan3"],"word":"沙盘推演"},{"definition":["to do a drill\/to practice\/training\/drill"],"pinyin":["yan3 lian4"],"word":"演练"},{"definition":["dress rehearsal"],"pinyin":["cai3 pai2"],"word":"彩排"},{"definition":["to screen (a movie)\/to stage (a play)\/a screening\/a staging"],"pinyin":["shang4 yan3"],"word":"上演"},{"definition":["to deduce\/to infer\/to derive\/an implication"],"pinyin":["tui1 yan3"],"word":"推演"},{"definition":["threshing floor\/classifier for events and happenings: spell, episode, bout","large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","variant of 場|场[chang2]","variant of 場|场[chang3]"],"pinyin":["chang2","chang3","chang2","chang3"],"word":"场"},{"definition":["opera (or role) involving much singing and action\/(fig.) highlight\/main feature\/major activity"],"pinyin":["zhong4 tou2 xi4"],"word":"重头戏"},{"definition":["interlude\/to cross the stage\/to do sth as a mere formality\/to go through the motions"],"pinyin":["guo4 chang3"],"word":"过场"},{"definition":["the eve\/the night before"],"pinyin":["qian2 ye4"],"word":"前夜"},{"definition":["a genius in retrospect (idiom); hindsight is 20-20"],"pinyin":["shi4 hou4 Zhu1 ge3 Liang4"],"word":"事后诸葛亮"},{"definition":["large-scale Chinese opera\/Beijing opera\/major dramatic production (movie, TV series etc)"],"pinyin":["da4 xi4"],"word":"大戏"},{"definition":["to shift to an earlier date\/to do sth ahead of time\/in advance"],"pinyin":["ti2 qian2"],"word":"提前"},{"definition":["item (on a program)"],"pinyin":["xi4 ma3"],"word":"戏码"},{"definition":["to recur (of events, esp. adverse ones)\/to repeat (a performance)"],"pinyin":["chong2 yan3"],"word":"重演"},{"definition":["to imagine\/to assume\/to envisage\/tentative plan\/to have consideration for"],"pinyin":["she4 xiang3"],"word":"设想"},{"definition":["war\/to wage war"],"pinyin":["da4 zhan4"],"word":"大战"}]}