{"definition":["to take the lead in a race\/to set the pace"],"pinyin":["ling3 pao3"],"traditional":["領跑"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"领跑","characters":[{"definition":["neck\/collar\/to lead\/to receive\/classifier for clothes, mats, screens etc"],"pinyin":["ling3"],"word":"领"},{"definition":["(of an animal) to paw (the ground)","to run\/to run away\/to escape\/to run around (on errands etc)\/(of a gas or liquid) to leak or evaporate\/(verb complement) away\/off"],"pinyin":["pao2","pao3"],"word":"跑"}],"containing_words":[],"sentences":[{"english":"The Biancocelesti are the runaway leaders at the top of Serie A and confidence is high at Formello.","chinese":"目前拉齐奥正在积分榜上领跑，球队信心十足。"},{"english":"The head of the school has since gone on to lead marketing for the whole group.","chinese":"自此，新东方的校长就带领他们的团队领跑培训市场。"},{"english":"Jabari Parker was leading the ROY race before he got injured…","chinese":"帕克在受伤前可是领跑最佳新秀的竞争啊。"},{"english":"In the second quarter, China once again was the nation that led IPO issuance globally.","chinese":"二季度，中国再次成为全球IPO领跑者。"},{"english":"Strauss-Kahn was once considered a frontrunner for the French presidential nomination.","chinese":"卡恩曾被认为是法国总统提名人选的领跑者。"},{"english":"Beyonce leads the nominees with 10 nominations.","chinese":"歌后碧昂斯以10项提名领跑提名榜。"},{"english":"I happen to be a fan of both best-picture front-runners.","chinese":"很凑巧的是我同时是这两部最佳影片奖领跑者的粉丝。"},{"english":"Everyone leads at least once.","chinese":"每人至少领跑一次。"},{"english":"CEEVIN, new materials technology leader.","chinese":"京能恒基，新材料科技领跑者。"},{"english":"None of the competitors could catch up with the untiring runner who was in the lead.","chinese":"没有一个参赛者能追上那个不知疲倦的领跑者。"},{"english":"Hey guys, remember class 1, remember the days when we stayed together.","chinese":"高二的时候，希望我们1班的人还能一直领跑。"},{"english":"He is Real Madrid's top assist-man and he currently leads the assists ranking in the Champions League.","chinese":"他是皇马的助攻王同时在助攻榜上领跑西甲。"}],"related":[{"definition":["top of the list"],"pinyin":["bang3 shou3"],"word":"榜首"},{"definition":["a long way in front\/to lead by a wide margin"],"pinyin":["yao2 yao2 ling3 xian1"],"word":"遥遥领先"},{"definition":["to be located at"],"pinyin":["wei4 ju1"],"word":"位居"},{"definition":["lit. only one branch of the tree is thriving (idiom)\/fig. to be in a league of one's own\/outstanding"],"pinyin":["yi1 zhi1 du2 xiu4"],"word":"一枝独秀"},{"definition":["to rank"],"pinyin":["wei4 lie4"],"word":"位列"},{"definition":["to continue in a post\/(to hold a post) several times in succession\/(to win a title) in successive years\/to stay at number one\/to defend a championship"],"pinyin":["chan2 lian2"],"word":"蝉联"},{"definition":["bellwether"],"pinyin":["ling3 tou2 yang2"],"word":"领头羊"},{"definition":["to come first in triennial palace examinations (idiom, refers to the carved stone turtle head in front of the imperial palace, next to which the most successful candidate in the imperial examinations was entitled to stand)\/to be the champion\/to be the very best in any field"],"pinyin":["du2 zhan4 ao2 tou2"],"word":"独占鳌头"},{"definition":["to advance singing loudly (idiom); triumphant progress"],"pinyin":["gao1 ge1 meng3 jin4"],"word":"高歌猛进"},{"definition":["to stand above\/to occupy an important position\/to rank (among the top few)"],"pinyin":["gao1 ju1"],"word":"高居"},{"definition":["lit. late-comer lives above (idiom); the up-and-coming youngster outstrips the older generation\/the pupil surpasses the master"],"pinyin":["hou4 lai2 ju1 shang4"],"word":"后来居上"},{"definition":["top three"],"pinyin":["qian2 san1 jia3"],"word":"前三甲"},{"definition":["to lead\/to be in front"],"pinyin":["ling3 xian1"],"word":"领先"},{"definition":["the very front"],"pinyin":["qian2 lie4"],"word":"前列"},{"definition":["to vault"],"pinyin":["yue4 ju1"],"word":"跃居"},{"definition":["lead(ing) position"],"pinyin":["ling3 xian1 di4 wei4"],"word":"领先地位"}]}