{"definition":["Summer Palace in Beijing"],"pinyin":["Yi2 he2 yuan2"],"traditional":["頤和園"],"rank":17879.0,"normalized_rank":0.25015040644718983,"fraction":0.000002971958505282077,"cumulative_fraction":0.9691645977319606,"word":"颐和园","characters":[{"definition":["cheek\/lower cheek\/chin\/jaw\/to nourish"],"pinyin":["yi2"],"word":"颐"},{"definition":["to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","old variant of 和[he2]\/harmonious","surname He\/Japanese (food, clothes etc)","old variant of 和[he2]","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs","to complete a set in mahjong or playing cards","and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\""],"pinyin":["huo2","he4","he2","He2","he2","huo4","hu2","he2"],"word":"和"},{"definition":["surname Yuan","land used for growing plants\/site used for public recreation\/abbr. for a place ending in 園|园, such as a botanical garden 植物園|植物园, kindergarten 幼兒園|幼儿园 etc"],"pinyin":["Yuan2","yuan2"],"word":"园"}],"containing_words":[],"sentences":[{"english":"From which dynasty was the blue---flower porcelain plate in the Hall of Happiness and Longevity left?","chinese":"颐和园乐寿堂内的青花大磁盘是哪个朝代的遗物？"},{"english":"Please tell me on which days students in primary schools and high schools can visit the summer palace for free.","chinese":"请告诉我在哪天小学和高中生可以免费参观颐和园？"},{"english":"north-west \/ north-west; The Summer Palace is north-west of Beijing. \/ The Summer Palace is north-west of Beijing.","chinese":"颐和园在北京的西北部。"},{"english":"Tourists walk in the Summer Palace with deliberate steps.","chinese":"游人款步漫游颐和园。"},{"english":"Yesterday I visited the Summer Palance, where I had not been for a long while.","chinese":"昨天我到颐和园参观，我很久没到那里去了。"},{"english":"That was the fourth time that Mr Smoth has visited the Summer Palace.","chinese":"这是史密斯先生第三次游览颐和园。"},{"english":"Longevity Hill is the focal point of the Summer Palace.","chinese":"万寿山是颐和园的视觉中心。"},{"english":"The Summer Palace is the most beautiful park in Beijing. The Temple of Heaven and the Great Wall are worth visiting.","chinese":"颐和园是北京最美丽的公园，天坛和长城都值得一去。"},{"english":"Colin: Oh yes, I’m very interested in Chinese history so I’d like to visit the Summer Palace.","chinese":"当然，我对中国历史很有兴趣，所以我很想去颐和园。"},{"english":"We visited the Summer Place, the Forbidden City, Ming Tombs and many parks there.","chinese":"我们参观了颐和园，故宫，明十三陵还有好多公园。"},{"english":"To go to both the Ming Tombs and the Summer Palace?","chinese":"明十三陵和颐和园皆能去吗？"},{"english":"Only the Lobgevity Hill remains inside the Summer Palace.","chinese":"只有这万寿山在颐和园里边。"},{"english":"The Summer Palace covers an area of 290 hectares, including the areas of Kuming Lake and Longevity Hill.","chinese":"颐和园占地290公顷，包括昆明湖和万寿山。"},{"english":"The visitors were transported to the Summer Palace by a wooden boat.","chinese":"游客们坐着木船被送到了颐和园。"},{"english":"Mr Smoth has visited the Summer Palace.","chinese":"这是史密斯先生第三次游览颐和园。"},{"english":"The summer Palace is the largest and the best pre - served of the imperial gardens in China.","chinese":"颐和园是中国最大也是保存得最好的皇家花园。"}],"related":[{"definition":["Yuanmingyuan, the Old Summer Palace, destroyed by the British and French army in 1860"],"pinyin":["Yuan2 ming2 yuan2"],"word":"圆明园"},{"definition":["Jingshan Park (park in Beijing)"],"pinyin":["Jing3 shan1 Gong1 yuan2"],"word":"景山公园"},{"definition":["Kunming Lake"],"pinyin":["Kun1 ming2 Hu2"],"word":"昆明湖"},{"definition":["Jingshan (name of a hill in Jingshan park)"],"pinyin":["Jing3 shan1"],"word":"景山"},{"definition":["the Forbidden City\/the Imperial Palace in Beijing\/same as 故宮|故宫[Gu4 gong1]"],"pinyin":["Zi3 jin4 cheng2"],"word":"紫禁城"},{"definition":["Shichahai, scenic area of northwest Beijing with three lakes"],"pinyin":["shi2 cha4 hai3"],"word":"什刹海"},{"definition":["Tower of Buddhist Incense in the Summer Palace 頤和園|颐和园[Yi2 he2 yuan2], Beijing"],"pinyin":["Fo2 xiang1 ge2"],"word":"佛香阁"},{"definition":["Temple of Heaven (in Beijing)"],"pinyin":["Tian1 tan2"],"word":"天坛"},{"definition":["the Ming tombs (mausoleum park of the Ming emperors in Changping district of Beijing)"],"pinyin":["Ming2 shi2 san1 ling2"],"word":"明十三陵"},{"definition":["mountain resort\/Qing imperial summer residence at Chengde, a world heritage site"],"pinyin":["bi4 shu3 shan1 zhuang1"],"word":"避暑山庄"},{"definition":["former imperial palace","the Forbidden City\/abbr. for 故宮博物院|故宫博物院[Gu4 gong1 Bo2 wu4 yuan4]"],"pinyin":["gu4 gong1","Gu4 gong1"],"word":"故宫"},{"definition":["Tiananmen Gate, entrance of the Imperial City in Beijing"],"pinyin":["Tian1 an1 men2"],"word":"天安门"},{"definition":["Fragrant Hills Park, Beijing"],"pinyin":["Xiang1 shan1 Gong1 yuan2"],"word":"香山公园"},{"definition":["Mukden Palace, aka Shenyang Imperial Palace, the main imperial palace during the early years of the Qing dynasty (1625-1644), a secondary palace in subsequent years, now a museum"],"pinyin":["Shen3 yang2 Gu4 gong1"],"word":"沈阳故宫"},{"definition":["Houhai, a lake and the area surrounding it in central Beijing"],"pinyin":["Hou4 hai3"],"word":"后海"},{"definition":["Badaling, a particular section of the Great Wall that is a favorite tourist destination"],"pinyin":["Ba1 da2 ling3"],"word":"八达岭"}]}