{"definition":["tempest\/wave (of popular sentiment etc)\/craze or fad"],"pinyin":["feng1 chao2"],"traditional":["風潮"],"rank":10562.0,"normalized_rank":0.1477760832762022,"fraction":0.000007564560623985326,"cumulative_fraction":0.9341463468506996,"word":"风潮","characters":[{"definition":["wind\/news\/style\/custom\/manner\/CL:陣|阵[zhen4],絲|丝[si1]"],"pinyin":["feng1"],"word":"风"},{"definition":["tide\/current\/damp\/moist\/humid"],"pinyin":["chao2"],"word":"潮"}],"containing_words":[],"sentences":[{"english":"Currently, a wave of enthusiasm personality household domestic kitchen cabinet industry and also try dance.","chinese":"目前，个性家居风潮正劲，国内厨柜业也闻风而舞。"},{"english":"It didn't take very long for the latest fashion trend to catch on.","chinese":"这个最新的时尚潮流没多久就蔚为一股风潮。"},{"english":"It looks like reality TV shows are here to stay.","chinese":"看来真人真事的电视节目已成为风潮。"},{"english":"The two trends of overthrowing Sun Yat-sen were merely a fuse of reorganization Restoration League.","chinese":"二次“倒孙风潮”不过是光复会重组的导火线而已。"},{"english":"After Chongqing opened the port, \"modern agitation \" poured into Sichuan Basin along the course of the Changjiang River.","chinese":"重庆开埠后，“近代风潮”沿长江航线涌进四川盆地。"},{"english":"Television shows were blacked out as the union trouble spread.","chinese":"由于工会风潮蔓延，电视停止了播放。"},{"english":"Shi Guobao was considered a folk usurious agitation\" claw king\".","chinese":"石国豹被认为是民间高利贷风潮的“爪王”。"},{"english":"The vinegar-drinking trend gained momentum in 2004, when black vinegar became all the rage.","chinese":"2004年黑醋风靡一时之际，饮醋风潮开始盛行。"},{"english":"And this whole cloud computing fad?","chinese":"这场云计算风潮又怎样呢？"},{"english":"But a wave of consolidation seems to be driven this year by French private equity house AXA.","chinese":"法国的私募股权公司AXA似乎引领了一股并购风潮。"},{"english":"Don't lose more by joining the stampede of buy-high, sell-low market timers.","chinese":"不要应为参与高买低卖的抢购风潮而亏损更多。"},{"english":"For collage students, it is encouraging to travel abroad during summer or winder vacation.","chinese":"大学生利用寒暑假出国游学俨然形成一种风潮。"},{"english":"Lunzan style evolvement in pre-four history works is closely contacted with the era disputation vogue.","chinese":"前四史论赞文体演变与时代论议风潮密切相关。"},{"english":"A decade-long run of mergers in the banking industry has concentrated power in fewer hands.","chinese":"十年的银行业购并风潮让权力集中于少数人之手。"},{"english":"Rumor spread the prices would go up, many peopel stampeded into a wave of panic buying.","chinese":"谣传物价要上涨，很多人卷入了抢购的风潮中。"},{"english":"Behind the transformation are myriad forms of government intervention.","chinese":"在这风潮的背后是满是政府干预的影子。"}],"related":[{"definition":["upsurge\/popular craze"],"pinyin":["re4 chao2"],"word":"热潮"},{"definition":["tide\/current\/trend"],"pinyin":["chao2 liu2"],"word":"潮流"},{"definition":["to lift\/to raise in height\/to begin\/upsurge\/to set off (a campaign)"],"pinyin":["xian1 qi3"],"word":"掀起"},{"definition":["wave\/tides"],"pinyin":["lang4 chao2"],"word":"浪潮"},{"definition":["to rise\/to spring up\/to burgeon\/to be aroused\/to come into vogue"],"pinyin":["xing1 qi3"],"word":"兴起"},{"definition":["to be in vogue\/to be prevalent"],"pinyin":["sheng4 xing2"],"word":"盛行"},{"definition":["rampant\/very popular"],"pinyin":["da4 xing2 qi2 dao4"],"word":"大行其道"},{"definition":["spring tide\/(fig.) momentous social change"],"pinyin":["da4 chao2"],"word":"大潮"},{"definition":["fashionable\/popular"],"pinyin":["feng1 mi3"],"word":"风靡"},{"definition":["surging tide\/(fig.) tide\/craze\/rage\/spree"],"pinyin":["kuang2 chao2"],"word":"狂潮"},{"definition":["to engulf\/to sweep\/to carry away everything"],"pinyin":["xi2 juan3"],"word":"席卷"},{"definition":["tide\/current\/damp\/moist\/humid"],"pinyin":["chao2"],"word":"潮"},{"definition":["(of a contagious disease etc) to spread\/to propagate\/(of a style of clothing, song etc) popular\/fashionable"],"pinyin":["liu2 xing2"],"word":"流行"},{"definition":["fashionable for a while (idiom); all the rage"],"pinyin":["feng1 mi3 yi1 shi2"],"word":"风靡一时"},{"definition":["ever more critical\/problems get more and more intense"],"pinyin":["yu4 yan3 yu4 lie4"],"word":"愈演愈烈"},{"definition":["flourishing and still in the ascendant (idiom); rapidly expanding\/still growing strong\/on the up"],"pinyin":["fang1 xing1 wei4 ai4"],"word":"方兴未艾"}]}