{"definition":["fortunes rise and fall\/times change"],"pinyin":["feng1 shui3 lun2 liu2 zhuan4"],"traditional":["風水輪流轉"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"风水轮流转","characters":[{"definition":["wind\/news\/style\/custom\/manner\/CL:陣|阵[zhen4],絲|丝[si1]"],"pinyin":["feng1"],"word":"风"},{"definition":["surname Shui","water\/river\/liquid\/beverage\/additional charges or income\/(of clothes) classifier for number of washes"],"pinyin":["Shui3","shui3"],"word":"水"},{"definition":["wheel\/disk\/ring\/steamship\/to take turns\/to rotate\/by turn\/classifier for big round objects: disk, or recurring events: round, turn"],"pinyin":["lun2"],"word":"轮"},{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"},{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan4","zhuan3"],"word":"转"}],"containing_words":[],"sentences":[],"related":[{"definition":["see 風水輪流轉|风水轮流转[feng1 shui3 lun2 liu2 zhuan4]"],"pinyin":["feng1 shui3 lun2 liu2"],"word":"风水轮流"},{"definition":["the river flows thirty years to the East, thirty years to the West (proverb)\/change is the only constant"],"pinyin":["san1 shi2 nian2 he2 dong1 , san1 shi2 nian2 he2 xi1"],"word":"三十年河东，三十年河西"},{"definition":["No flower can bloom for a hundred days.\/Good times do not last long. (idiom)"],"pinyin":["hua1 wu2 bai3 ri4 hong2"],"word":"花无百日红"},{"definition":["appropriate retribution (idiom)"],"pinyin":["bao4 ying4 bu4 shuang3"],"word":"报应不爽"},{"definition":["extreme sorrow turns to joy (idiom)"],"pinyin":["pi3 ji2 tai4 lai2"],"word":"否极泰来"},{"definition":["if you live a life of crime, sooner or later you'll pay for it"],"pinyin":["chu1 lai2 hun4 chi2 zao3 yao4 huan2 de5"],"word":"出来混迟早要还的"},{"definition":["the old man lost his mare, but it all turned out for the best (idiom); fig. a blessing in disguise\/it's an ill wind that blows nobody any good"],"pinyin":["sai4 weng1 shi1 ma3 yan1 zhi1 fei1 fu2"],"word":"塞翁失马焉知非福"},{"definition":["lit. the salted fish turns over (idiom)\/fig. to experience a reversal of fortune"],"pinyin":["xian2 yu2 fan1 shen1"],"word":"咸鱼翻身"},{"definition":["flushed with success\/proud of one's success (in exams, promotion etc)\/as pleased as punch"],"pinyin":["chun1 feng1 de2 yi4"],"word":"春风得意"},{"definition":["bitterness finishes, sweetness begins (idiom); the hard times are over, the good times just beginning"],"pinyin":["ku3 jin4 gan1 lai2"],"word":"苦尽甘来"},{"definition":["to win power\/to get authority\/to become dominant"],"pinyin":["de2 shi4"],"word":"得势"},{"definition":["When the tree topples the monkeys scatter. (idiom); fig. an opportunist abandons an unfavorable cause\/Rats leave a sinking ship."],"pinyin":["shu4 dao3 hu2 sun1 san4"],"word":"树倒猢狲散"},{"definition":["to the end (of)\/at the end of\/in the end\/to come to an end"],"pinyin":["dao4 tou2"],"word":"到头"},{"definition":["lit. when people leave, the tea cools (idiom)\/fig. when sb is no longer in a position of power, others cease to care about him"],"pinyin":["ren2 zou3 cha2 liang2"],"word":"人走茶凉"},{"definition":["to amass wealth while keeping a low profile (idiom)"],"pinyin":["men1 sheng1 fa1 da4 cai2"],"word":"闷声发大财"},{"definition":["lit. the rear waves of the Yangtze River drive on those before (idiom)\/fig. the new is constantly replacing the old\/each new generation excels the previous\/(of things) to be constantly evolving"],"pinyin":["Chang2 Jiang1 hou4 lang4 tui1 qian2 lang4"],"word":"长江后浪推前浪"}]}