{"definition":["to bear the brunt"],"pinyin":["shou3 dang1 qi2 chong1"],"traditional":["首當其衝"],"rank":16378.0,"normalized_rank":0.2291494690302632,"fraction":0.0000035253596887156616,"cumulative_fraction":0.964300010536822,"word":"首当其冲","characters":[{"definition":["head\/chief\/first (occasion, thing etc)\/classifier for poems, songs etc"],"pinyin":["shou3"],"word":"首"},{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","(onom.) dong\/ding dong (bell)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang4","dang1","dang1"],"word":"当"},{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["powerful\/vigorous\/pungent\/towards\/in view of","thoroughfare\/to go straight ahead\/to rush\/to clash","(of water) to dash against\/to mix with water\/to infuse\/to rinse\/to flush\/to develop (a film)\/to rise in the air\/to clash\/to collide with"],"pinyin":["chong4","chong1","chong1"],"word":"冲"}],"containing_words":[],"sentences":[{"english":"It appears that in the face of chemical or biological warfare, a woman's primary job is to doff her clothes.","chinese":"若爆发生化战争，女人首当其冲要做的就是脱掉衣服。"},{"english":"Low self-esteem has become the number-one issue plaguing women.","chinese":"较低的自尊是折磨女性首当其冲的因素。"},{"english":"This unit always bears the brunt of any danger.","chinese":"出现险情时，这支部队总是首当其冲。"},{"english":"Disappointed pirates continued to sail together and harass throughout Carolinas .","chinese":"失望的海盗船继续骚扰，并在整个首当其冲。"},{"english":"As a result, the laid-off workers have to bear the brunt of the negative impact of market behavior.","chinese":"结果住房的市场行为首当其冲的是下岗人员。"},{"english":"Among the four pollutions, fake report comes first.","chinese":"在新闻的“四大公害”中，首当其冲的是虚假新闻。"},{"english":"To change this situation, the most important move is to re-establish investors' confidence.","chinese":"要改变现状，首当其冲的是重拾投资者的信心。"},{"english":"Bear the brunt of the financial system in Europe, the European Union country on its guard.","chinese":"欧洲的金融系统首当其冲，欧盟国家如临大敌。"},{"english":"The fair was rich and colorful in content, of which trading was the most important.","chinese":"赶场的内容可谓丰富多彩，生意买卖自然首当其冲。"},{"english":"Forgiveness stands first of all other natural remedies.","chinese":"在所有自然疗法中，原谅首当其冲。"},{"english":"The fisrt and foremost one is no basis in reality, such as net love.","chinese":"首当其冲的是缺少现实基础，譬如网恋。"},{"english":"Indian troops bore the brunt of the Burma campaigns.","chinese":"在缅甸战役中，印军首当其冲。"},{"english":"Base metals in particular have borne the brunt of investors de-risking portfolios.","chinese":"在投资者消除资产风险时，贱金属首当其冲。"},{"english":"In the Enviromental systems effected by climate change, cryosphere is on the first place.","chinese":"在气候变化影响的诸环境系统中，冰冻圈首当其冲。"},{"english":"And who will bear the brunt of these cuts?","chinese":"那么，哪些人将成为首当其冲的受害者？"},{"english":"The first is the house rent! effectively as the second is the cat food.","chinese":"首当其冲的是房租，其次就是猫粮。"}],"related":[{"definition":["(the) very first"],"pinyin":["zui4 xian1"],"word":"最先"},{"definition":["to spread to\/to involve\/to affect"],"pinyin":["bo1 ji2"],"word":"波及"},{"definition":["to be bound to\/undoubtedly will"],"pinyin":["shi4 bi4"],"word":"势必"},{"definition":["certainty\/without a doubt"],"pinyin":["hao2 wu2 yi2 wen4"],"word":"毫无疑问"},{"definition":["of the utmost importance\/of highest priority"],"pinyin":["zhong4 zhong1 zhi1 zhong4"],"word":"重中之重"},{"definition":["chain reaction"],"pinyin":["lian2 suo3 fan3 ying4"],"word":"连锁反应"},{"definition":["criminal ringleader, main offender (idiom); main culprit\/fig. main cause of a disaster"],"pinyin":["zui4 kui2 huo4 shou3"],"word":"罪魁祸首"},{"definition":["to follow closely behind sb or sth (idiom)"],"pinyin":["jin3 sui2 qi2 hou4"],"word":"紧随其后"},{"definition":["the most important\/of chief importance"],"pinyin":["shou3 yao4"],"word":"首要"},{"definition":["area particularly hard-hit by a disaster\/disaster area"],"pinyin":["zhong4 zai1 qu1"],"word":"重灾区"},{"definition":["rapid\/sudden"],"pinyin":["ji2 ju4"],"word":"急剧"},{"definition":["to engulf\/to sweep\/to carry away everything"],"pinyin":["xi2 juan3"],"word":"席卷"},{"definition":["moreover\/besides"],"pinyin":["zai4 zhe3"],"word":"再者"},{"definition":["variant of 衝擊|冲击[chong1 ji1]","to attack\/to batter\/(of waves) to pound against\/shock\/impact"],"pinyin":["chong1 ji1","chong1 ji1"],"word":"冲击"},{"definition":["it goes without saying\/it is self-evident"],"pinyin":["bu4 yan2 er2 yu4"],"word":"不言而喻"},{"definition":["unavoidably"],"pinyin":["bu4 ke3 bi4 mian3"],"word":"不可避免"}]}