{"definition":["first (hotel of its type, store of its type etc)"],"pinyin":["shou3 jia1"],"traditional":["首家"],"rank":6289.0,"normalized_rank":0.08799126943041427,"fraction":0.000017261416443542888,"cumulative_fraction":0.8851657722872205,"word":"首家","characters":[{"definition":["head\/chief\/first (occasion, thing etc)\/classifier for poems, songs etc"],"pinyin":["shou3"],"word":"首"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]","see 傢伙|家伙[jia1 huo5]"],"pinyin":["jia1","jia1"],"word":"家"}],"containing_words":[],"sentences":[{"english":"It is the first domestic enterprise manufacturing top-grade fog-proof dressing mirrors cabinet .","chinese":"是国内首家生产高档防雾化妆镜柜企业。"},{"english":"Among them, Kang force lifts are A shares is the first private enterprises lift.","chinese":"其中，康力升降机是A股首家的民营升降机企业。"},{"english":"PUMA is the first sports shoe manufacture to offer Velcro fasteners.","chinese":"PUMA是首家采用粘扣带的运动鞋生产商。"},{"english":"Xiangtan Humanity Hospital is China's first men's brand hospital.","chinese":"上湘潭博爱医院是我国首家男科品牌医院。"},{"english":"Settle of hotel of east of first case forest at Beijing on the west the square austral passenger station.","chinese":"首家格林东方酒店落户于北京西客运站南广场。"},{"english":"This is the first Zhangjiajie was listed on the five-star hotel.","chinese":"这是张家界首家获得挂牌的五星级酒店。"},{"english":"China Southern Airlines will become the first Boeing 787 operators.","chinese":"南航将成为国内首家波音787运营商。"},{"english":"Baosteel Corporation is the first enterprise to issue environmental report in the iron and steel industry in China.","chinese":"宝钢股份是我国钢铁行业首家发布环境报告的企业。"},{"english":"Just imagine his joy when he met me – the first \"corozo supplier\" in China at that time !","chinese":"那时我还是内地首家引进果实扣的供应商而已。"},{"english":"Our company is the first Coordinated Process Company to supply and manufacture rinks in China.","chinese":"本公司是国内首家真冰滑冰场供应制作一条龙企业。"},{"english":"It is the first domestic specialized is engaged in the glassware production of large private enterprises.","chinese":"是国内首家专业从事玻璃仪器生产的大型民营企业。"},{"english":"The first sub-branch in Shenyang has recently opened.","chinese":"最近我们在沈阳的首家支行开业。"},{"english":"Singapore Air is the first airline in the world to receive and operate the A380.","chinese":"新航是全球首家使用A380的航空公司。"},{"english":"The company is China's first development and production of non-friable chimney professional manufacturers.","chinese":"本公司是中国首家开发生产不易碎灯罩的专业厂家。"},{"english":"The country's first biological pharmaceutical professional bank opens in Changsha.","chinese":"全国首家生物医药专业银行长沙挂牌。"},{"english":"He established 1st private law office, Yongsen law Office, in the Province in 1994.","chinese":"1994年创办广东首家个体制永森律师事务所。"}],"related":[{"definition":["to open a business\/to open a practice\/open (for business)"],"pinyin":["kai1 ye4"],"word":"开业"},{"definition":["to create\/original creation\/to be the first to do sth"],"pinyin":["shou3 chuang4"],"word":"首创"},{"definition":["first case\/first instance"],"pinyin":["shou3 li4"],"word":"首例"},{"definition":["the whole family\/the same family\/the family ... (when preceded by a family name)\/group"],"pinyin":["yi1 jia1"],"word":"一家"},{"definition":["to prepare to build sth"],"pinyin":["chou2 jian4"],"word":"筹建"},{"definition":["one-stop (service, shop etc)"],"pinyin":["yi1 zhan4 shi4"],"word":"一站式"},{"definition":["to enter and garrison\/(fig.) to establish a presence in"],"pinyin":["jin4 zhu4"],"word":"进驻"},{"definition":["flagship (store)"],"pinyin":["qi2 jian4 dian4"],"word":"旗舰店"},{"definition":["test point\/to carry out trial\/pilot scheme"],"pinyin":["shi4 dian3"],"word":"试点"},{"definition":["to offer (goods or services)\/to open (for business etc)"],"pinyin":["kai1 she4"],"word":"开设"},{"definition":["to establish\/to set up\/to be tenable\/to hold water"],"pinyin":["cheng2 li4"],"word":"成立"},{"definition":["to continue\/to follow after\/to go on with\/to succeed\/to inherit\/then\/afterwards"],"pinyin":["ji4"],"word":"继"},{"definition":["general headquarters"],"pinyin":["zong3 bu4"],"word":"总部"},{"definition":["to interlock\/to be linked\/chain (store etc)"],"pinyin":["lian2 suo3"],"word":"连锁"},{"definition":["to blossom everywhere\/to spring up all over the place\/to flourish on a large scale"],"pinyin":["bian4 di4 kai1 hua1"],"word":"遍地开花"},{"definition":["to draw into\/to pull into\/to introduce"],"pinyin":["yin3 ru4"],"word":"引入"}]}