{"definition":["to regard as the foremost\/to name as a prime example\/to implement for the first time"],"pinyin":["shou3 tui1"],"traditional":["首推"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"首推","characters":[{"definition":["head\/chief\/first (occasion, thing etc)\/classifier for poems, songs etc"],"pinyin":["shou3"],"word":"首"},{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"}],"containing_words":[],"sentences":[{"english":"Nowadays, out-of-step oscillation is still considered as the most serious stability accident.","chinese":"其中最严重的稳定性事故仍首推失步振荡。"},{"english":"What's more, Thursday's scene enrolling attracted the most number of students.","chinese":"此外，人气最旺的首推星期四的现场报名。"},{"english":"Girtim, British artist, created watercolour with a modern meaning.","chinese":"具有现代意义的水彩画，始点当首推英国画家格尔丁。"},{"english":"To entrepreneurs, the most obvious effect of resources are the most important career resources.","chinese":"对创业者来说，效用最明显首推职业资源。"},{"english":"Conclusion Clinical optometry should science norm, the medical optometry, the head to push.","chinese":"结论临床验光应科学规范，医学验光首推。"}],"related":[{"definition":["first choice\/premium\/to come first in the imperial examinations"],"pinyin":["shou3 xuan3"],"word":"首选"},{"definition":["to recommend\/recommendation"],"pinyin":["tui1 jian4"],"word":"推荐"},{"definition":["the earliest ancestor\/originator (of a tradition, school of thought etc)"],"pinyin":["bi2 zu3"],"word":"鼻祖"},{"definition":["to create\/original creation\/to be the first to do sth"],"pinyin":["shou3 chuang4"],"word":"首创"},{"definition":["one of (sth)\/one out of a multitude\/one (third, quarter, percent etc)"],"pinyin":["zhi1 yi1"],"word":"之一"},{"definition":["to be known as\/to be nicknamed\/to be purportedly\/to claim (often exaggeratedly or falsely)"],"pinyin":["hao4 cheng1"],"word":"号称"},{"definition":["to optimize\/preferred"],"pinyin":["you1 xuan3"],"word":"优选"},{"definition":["founder"],"pinyin":["kai1 shan1 bi2 zu3"],"word":"开山鼻祖"},{"definition":["popular\/hot\/in vogue"],"pinyin":["re4 men2"],"word":"热门"},{"definition":["lit. to fly one's banner on a solitary tree (idiom); fig. to act as a loner\/to stand out\/to develop one's own school\/to have attitude of one's own"],"pinyin":["du2 shu4 yi1 zhi4"],"word":"独树一帜"},{"definition":["second (in a competition)\/occupying second place"],"pinyin":["ci4 zhi1"],"word":"次之"},{"definition":["every voice gives praise (idiom); with an extensive public reputation"],"pinyin":["you3 kou3 jie1 bei1"],"word":"有口皆碑"},{"definition":["to push out\/to release\/to launch\/to publish\/to recommend"],"pinyin":["tui1 chu1"],"word":"推出"},{"definition":["to esteem\/to think highly of\/to accord importance to\/to revere"],"pinyin":["tui1 chong2"],"word":"推崇"},{"definition":["can be rated as\/can be said to be"],"pinyin":["kan1 cheng1"],"word":"堪称"},{"definition":["fully deserving, without any reservations (idiom); entirely worthy (of a title, honor etc)"],"pinyin":["dang1 zhi1 wu2 kui4"],"word":"当之无愧"}]}