{"definition":["lit. an easy drive on a familiar path (idiom); fig. experience makes progress easy\/a task that is so familiar one can do it with one's hand tied behind one's back"],"pinyin":["jia4 qing1 jiu4 shu2"],"traditional":["駕輕就熟"],"rank":29064.0,"normalized_rank":0.4066430680116968,"fraction":0.0000010228652314215587,"cumulative_fraction":0.9893237817416016,"word":"驾轻就熟","characters":[{"definition":["surname Jia","to harness\/to draw (a cart etc)\/to drive\/to pilot\/to sail\/to ride\/your good self\/prefixed word denoting respect (polite 敬辞)"],"pinyin":["Jia4","jia4"],"word":"驾"},{"definition":["light\/easy\/gentle\/soft\/reckless\/unimportant\/frivolous\/small in number\/unstressed\/neutral\/to disparage"],"pinyin":["qing1"],"word":"轻"},{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["cooked (of food)\/ripe (of fruit)\/mature (of seeds)\/familiar\/skilled\/done\/also pr. [shou2]"],"pinyin":["shu2"],"word":"熟"}],"containing_words":[],"sentences":[{"english":"Li Busu was familiar with the route so they made rapid progress. He turned this way and that through open crevices .","chinese":"李不俗驾轻就熟，在那些嵌裂透漏的缝隙中钻来转去。"},{"english":"Some people have a facility for driving and others do not.","chinese":"一些人驾轻就熟，其他人则否。"},{"english":"The more you create the better you become at making your ideas a reality.","chinese":"创造得越多，在实现想法上面你就会更驾轻就熟。"}],"related":[{"definition":["lit. to drive a lightweight chariot on a familiar road (idiom)\/fig. to do sth routinely and with ease\/a walk in the park"],"pinyin":["qing1 che1 shu2 lu4"],"word":"轻车熟路"},{"definition":["lit. what the heart wishes, the hand accomplishes (idiom) skilled at the job\/entirely in one's element\/going smoothly and easily"],"pinyin":["de2 xin1 ying4 shou3"],"word":"得心应手"},{"definition":["handling a butcher's cleaver with ease (idiom); to do sth skillfully and easily"],"pinyin":["you2 ren4 you3 yu2"],"word":"游刃有余"},{"definition":["adept\/skilled"],"pinyin":["xian2 shu2"],"word":"娴熟"},{"definition":["skillful\/proficient"],"pinyin":["chun2 shu2"],"word":"纯熟"},{"definition":["practiced\/proficient\/skilled\/skillful"],"pinyin":["shu2 lian4"],"word":"熟练"},{"definition":["familiar"],"pinyin":["shu2 men2 shu2 lu4"],"word":"熟门熟路"},{"definition":["to handle matters with ease (idiom)\/to hold one's own"],"pinyin":["ying4 fu5 zi4 ru2"],"word":"应付自如"},{"definition":["lit. to stretch a hand and grab it (idiom)\/fig. easy to do"],"pinyin":["shou3 dao4 nian1 lai2"],"word":"手到拈来"},{"definition":["quite familiar with sth"],"pinyin":["shu2 ren3"],"word":"熟稔"},{"definition":["stretch a hand and grab it (idiom); very easy"],"pinyin":["shou3 dao4 qin2 lai2"],"word":"手到擒来"},{"definition":["lit. the stove fire has turned bright green (allusion to Daoist alchemy) (idiom)\/fig. (of an art, a technique etc) brought to the point of perfection"],"pinyin":["lu2 huo3 chun2 qing1"],"word":"炉火纯青"},{"definition":["a small appetizer\/a piece of cake; very easy (idiom)"],"pinyin":["xiao3 cai4 yi1 die2"],"word":"小菜一碟"},{"definition":["seasoned\/experienced"],"pinyin":["lao3 lian4"],"word":"老练"},{"definition":["experienced person\/an old hand at sth"],"pinyin":["lao3 shou3"],"word":"老手"},{"definition":["like a fish back in water (idiom); glad to be back in one's proper surroundings"],"pinyin":["ru2 yu2 de2 shui3"],"word":"如鱼得水"}]}