{"definition":["relative superiority (better or worse, stronger or weaker, above or below etc)"],"pinyin":["gao1 xia4"],"traditional":["高下"],"rank":14612.0,"normalized_rank":0.20444083779888908,"fraction":0.000004340790712366415,"cumulative_fraction":0.957387549051412,"word":"高下","characters":[{"definition":["high\/tall\/above average\/loud\/your (honorific)","surname Gao"],"pinyin":["gao1","Gao1"],"word":"高"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[{"definition":["to compete against\/to measure oneself against\/to go head to head (see who is best)"],"pinyin":["yi1 jiao4 gao1 xia4"],"word":"一较高下"},{"definition":["equally matched\/not much to distinguish who is stronger"],"pinyin":["bu4 fen1 gao1 xia4"],"word":"不分高下"}],"sentences":[{"english":"The candidates are running neck and neck in this election.","chinese":"这场选举中候选人难分高下。"},{"english":"Iron young tiger excited, but finally to compete with small, turn.","chinese":"铁彪激动，但终于对小高下不了手，转身而去。"},{"english":"Comparing something head-to-head with a pre-determined standard to ascertain success or failure.","chinese":"将某件事与原告制定的标准逐一对比，论成败高下。"},{"english":"They decided to settle the argument with a race. They agreed on a route and started off the race.","chinese":"它们决定来一场比赛分高下，选定了路线，就此起跑。"},{"english":"I bet you could give him a run for his money.","chinese":"我认为你可以跟他一比高下。"},{"english":"Past civilizations were measured by how they treated their elderly and disabled.","chinese":"古代文明的高下以人们如何尊老助残为衡量标准。"},{"english":"Its new government is grappling with a deficit that rivals Spain's.","chinese":"英国新政府面临着与西班牙“难分高下”的赤字困境。"},{"english":"Most of the central province is forested undulating plateau.","chinese":"省中部的尽大局部是被森林笼罩的高下讫伏的高本。"},{"english":"The GOP might win a showdown if it came to that in the current Congress.","chinese":"共和党可能赢得一决高下的话那在本届国会的。"},{"english":"He rivals his brother in his skill as a pianist.","chinese":"他和他的兄弟在弹钢琴的技巧上难分高下。"},{"english":"The game was closer than the score suggests.","chinese":"实际的比赛与所得的分数相比难分高下。"},{"english":"The understanding that the mobility of culture and individuals perse bears no hierarchal set of value judgments is proposed and reiterated.","chinese":"文化或人的移动方向本身也不包含价值高下的区别。"}],"related":[{"definition":["height\/altitude (aviation)\/pitch (music)\/ups and downs (success or failure)\/whether sth is right or wrong\/comparative strength, weight, depth, stature\/(spoken interjection) anyway, whatever\/eventually, in the end"],"pinyin":["gao1 di1"],"word":"高低"},{"definition":["good and bad\/merits and drawbacks"],"pinyin":["you1 lie4"],"word":"优劣"},{"definition":["not to know one's place"],"pinyin":["bu4 fen1 shang4 xia4"],"word":"不分上下"},{"definition":["victory or defeat\/the outcome of a battle"],"pinyin":["sheng4 fu4"],"word":"胜负"},{"definition":["length\/duration\/accident\/right and wrong\/good and bad\/long and short"],"pinyin":["chang2 duan3"],"word":"长短"},{"definition":["lit. unable to distinguish eldest brother from second brother (idiom); they are all equally excellent\/nothing to choose between them"],"pinyin":["bu4 fen1 bo2 zhong4"],"word":"不分伯仲"},{"definition":["lit. you die, I live (idiom); irreconcilable adversaries\/two parties cannot coexist"],"pinyin":["ni3 si3 wo3 huo2"],"word":"你死我活"},{"definition":["victory or defeat\/result"],"pinyin":["sheng4 bai4"],"word":"胜败"},{"definition":["to strive for\/to vie for\/to argue or debate\/deficient or lacking (dialect)\/how or what (literary)"],"pinyin":["zheng1"],"word":"争"},{"definition":["strong or weak\/intensity\/amount of force or pressure"],"pinyin":["qiang2 ruo4"],"word":"强弱"},{"definition":["a tie-break\/to determine the winner"],"pinyin":["jue2 sheng4 fu4"],"word":"决胜负"},{"definition":["well-matched\/equally matched"],"pinyin":["bu4 fen1 xuan1 zhi4"],"word":"不分轩轾"},{"definition":["the result (becomes apparent)\/now one understands"],"pinyin":["fen1 xiao3"],"word":"分晓"},{"definition":["the result becomes apparent\/(after) the dust has settled"],"pinyin":["yi3 jian4 fen1 xiao3"],"word":"已见分晓"},{"definition":["equally matched\/about the same"],"pinyin":["bu4 xiang1 shang4 xia4"],"word":"不相上下"},{"definition":["to compete fiercely\/contest"],"pinyin":["bi3 pin1"],"word":"比拼"}]}