{"definition":["high voltage"],"pinyin":["gao1 ya1 dian4"],"traditional":["高壓電"],"rank":28485.0,"normalized_rank":0.3985421068095645,"fraction":0.000001078628684882817,"cumulative_fraction":0.9887153871366896,"word":"高压电","characters":[{"definition":["high\/tall\/above average\/loud\/your (honorific)","surname Gao"],"pinyin":["gao1","Gao1"],"word":"高"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya4","ya1"],"word":"压"},{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"电"}],"containing_words":[],"sentences":[{"english":"Under such a disadvantage, Chang An was hit by a security high voltage electric shock device.","chinese":"在这样的劣势下，常安被保安的高压电击器击中。"},{"english":"Never suppose low voltage cannot quite possibly be dfuryous.","chinese":"决不能以为高压电没危境。"},{"english":"When using high voltage electron microscopes (HVEM), a large increase in section thickness is then possible.","chinese":"运用高压电镜使得观察的切片厚度大大增加成为可能。"},{"english":"A group of guards emerge from the door and shoot Jack with a Taser dart.","chinese":"一队警卫从门内现身，用高压电击枪射中了杰克。"},{"english":"The experiment was designed to study the condition of rabbit myocardium after 10 000-Volt high tension electricity injury by using light and electron microscopes.","chinese":"应用光镜和电镜观察家兔在高压电损伤后的心肌变化。"},{"english":"A new type high accuracy high voltage D. C. power supply used for electron beam exposure sysfem is described.","chinese":"本文介绍一种电子束曝光机用新型精密高压电源。"},{"english":"System uses high voltage generated by its own DC─Voltage multiplier instead of commercial high voltage supply.","chinese":"系统采用直流倍压器产生的高压代替市售高压电源。"},{"english":"The article explains a high-power high frequency and high voltage power supply which is used in X-ray Radial Diffraction instrument.","chinese":"介绍了一种用于X射线衍射仪的大功率高频高压电源。"},{"english":"To avoid the dangers of people or animals, High-Voltage usually adopts high-line transmission.","chinese":"为防止人畜触电，高压电一般采用高架线传送。"},{"english":"He noticed the remains of a snake which was would round the electric wires of a 16,000- volt power line.","chinese":"他看到一条死蛇缠在一根一万六千伏的高压电线上。"},{"english":"It is a new ligh voltage apparatus product for city transformation and construction.","chinese":"是适合城市改造和建设的新一代高压电器产品。"},{"english":"The first stationary contact may be connected to a phase of a high-voltage power source.","chinese":"第一静接点可以与高压电源的一个相连接。"},{"english":"It is also used as a semiconductor in high-voltage applications.","chinese":"它也被当作半导体用在高压电器中。"},{"english":"The result of the study demonstrated that organic injury occurred in myocardium after high tension electricity injury.","chinese":"实验结果证实高压电损伤后心肌可发生器质性损害。"},{"english":"High-voltage commonly take overhead line send to prevent man and animal get an electric shock.","chinese":"为防止人畜触电，高压电一般采用高架线传送。"},{"english":"The circuit schematic diagram of the high voltage pulse power supply is designed by author.","chinese":"作者设计了脉冲高压电源的电路原理图。"}],"related":[{"definition":["to electrify\/to charge\/electrification\/live (as in \"live wire\")"],"pinyin":["dai4 dian4"],"word":"带电"},{"definition":["to electrocute\/to die from an electric shock"],"pinyin":["dian4 si3"],"word":"电死"},{"definition":["to leak electricity\/(fig.) (coll.) to unintentionally arouse romantic interest (by being solicitous etc)\/cf. 放電|放电[fang4 dian4]"],"pinyin":["lou4 dian4"],"word":"漏电"},{"definition":["high tension power line"],"pinyin":["gao1 ya1 xian4"],"word":"高压线"},{"definition":["electric spark"],"pinyin":["dian4 huo3 hua1"],"word":"电火花"},{"definition":["electric current"],"pinyin":["dian4 liu2"],"word":"电流"},{"definition":["electrical lead"],"pinyin":["dao3 xian4"],"word":"导线"},{"definition":["voltage"],"pinyin":["dian4 ya1"],"word":"电压"},{"definition":["alternating current"],"pinyin":["jiao1 liu2 dian4"],"word":"交流电"},{"definition":["wire\/power cord\/CL:根[gen1]"],"pinyin":["dian4 xian4"],"word":"电线"},{"definition":["electric shock"],"pinyin":["dian4 ji1"],"word":"电击"},{"definition":["earth (wire)\/ground"],"pinyin":["di4 xian4"],"word":"地线"},{"definition":["to get an electric shock\/to be electrocuted\/electric shock"],"pinyin":["chu4 dian4"],"word":"触电"},{"definition":["to conduct electricity"],"pinyin":["dao3 dian4"],"word":"导电"},{"definition":["electric power source"],"pinyin":["dian4 yuan2"],"word":"电源"},{"definition":["short circuit"],"pinyin":["duan3 lu4"],"word":"短路"}]}