{"definition":["Wei State (407-225 BC), one of the Seven Hero States of the Warring States 戰國七雄|战国七雄\/Wei State or Cao Wei 曹魏 (220-265), the most powerful of the Three Kingdoms"],"pinyin":["Wei4 guo2"],"traditional":["魏國"],"rank":36504.0,"normalized_rank":0.5107383207644844,"fraction":5.281470539864705e-7,"cumulative_fraction":0.9949010181351632,"word":"魏国","characters":[{"definition":["surname Wei\/name of vassal state of Zhou dynasty from 661 BC in Shanxi, one of the Seven Hero Warring States\/Wei state, founded by Cao Cao 曹操[Cao2 Cao1], one of the Three Kingdoms after the Han dynasty\/the Wei dynasty 221-265\/Wei prefecture and Wei county at different historical periods","tower over a palace gateway (old)"],"pinyin":["Wei4","wei4"],"word":"魏"},{"definition":["surname Guo","country\/nation\/state\/national\/CL:個|个[ge4]"],"pinyin":["Guo2","guo2"],"word":"国"}],"containing_words":[],"sentences":[{"english":"Shang Yang's most contemptible acts of fraud should be defeated Wei.","chinese":"商鞅最令人不齿的行为应当是诈败魏国。"},{"english":"John wei Gu Andi will, not directly to tell what happened.","chinese":"魏国强不顾安迪意愿，直接将当初发生的事情说出。"},{"english":"Andy saw John wei, know that he is her father Wei Wei mouth.","chinese":"安迪见到魏国强，知道他就是魏渭口中她的生父。"},{"english":"The Li family have their origins back hundreds of years to the kingdom of Wei during the warring states period.","chinese":"李氏家族的血统来自几百年以前，战国时期的魏国。"},{"english":"A minister, Pang Cong, was to accompany him.","chinese":"魏国大臣庞聪，将要陪魏太子到赵国去作人质。"},{"english":"During the Warring States Period (475-221BC), there was a man called Yue Yangzi in State Yue.","chinese":"战国时期，魏国有个叫乐羊子的人。"},{"english":"In the warring States Period, a man called Yue Yangzi lived in the State of Wei.","chinese":"战国时期，魏国有个叫乐羊子的人。"},{"english":"The king of the State of Wei appreciates his archery very much and often goes hunting with him.","chinese":"魏国国王很欣赏他的射箭技术经常和他一起去打猎。"},{"english":"The current cold weather, it is better first went to the south of Wei and Chu Shou Fu .","chinese":"目前天冷，不如先去收服南方的魏国和楚国。"},{"english":"When Panggong came back from Handan, the Emperor Wei never interviewed him.","chinese":"当庞恭从邯郸回魏国时，魏王再也不愿意召见他了。"},{"english":"During the Warring States Period , there was a man called Yue Yangzi in State Yue.","chinese":"战国时期，魏国有个叫乐羊子的人。"},{"english":"Qin saw the opportunity, first with Qi Lianheng, Wei introduction of large tracts of land.","chinese":"秦国看准时机，先与齐连横，攻略魏国大片土地。"}],"related":[{"definition":["the state of Qin, one of the seven states of the Warring States Period (475-220 BC)"],"pinyin":["Qin2 guo2"],"word":"秦国"},{"definition":["Zhao, one of the seven states during the Warring States Period of Chinese history (475-220 BC)"],"pinyin":["Zhao4 Guo2"],"word":"赵国"},{"definition":["Qi state of Western Zhou and the Warring states (1122-265 BC), centered in Shandong"],"pinyin":["Qi2 guo2"],"word":"齐国"},{"definition":["the state of Chu, one of the most important of the small states contending for power in China between 770 and 223 BC, located around present-day Hubei"],"pinyin":["Chu3 guo2"],"word":"楚国"},{"definition":["Cao Wei, the most powerful of the Three Kingdoms, established as a dynasty in 220 by Cao Pi 曹丕, son of Cao Cao, replaced by Jin dynasty in 265"],"pinyin":["Cao2 Wei4"],"word":"曹魏"},{"definition":["Yan, a vassal state of Zhou in modern Hebei and Liaoning\/north Hebei\/the four Yan kingdoms of the Sixteen Kingdoms, namely: Former Yan 前燕 (337-370), Later Yan 後燕|后燕 (384-409), Southern Yan 南燕 (398-410), Northern Yan 北燕 (409-436)"],"pinyin":["Yan1 guo2"],"word":"燕国"},{"definition":["Wu state (in south China, in different historical periods)\/Wu state 220-280, founded by Sun Quan 孫權|孙权 the southernmost of the three Kingdoms"],"pinyin":["Wu2 guo2"],"word":"吴国"},{"definition":["Sichuan\/the state of Shu in Sichuan at different periods\/the Shu Han dynasty (214-263) of Liu Bei 劉備|刘备 during the Three Kingdoms"],"pinyin":["Shu3 guo2"],"word":"蜀国"},{"definition":["Eastern Wu (222-280)\/the southern state of Wu during the Three Kingdoms period, founded by Sun Quan 孫權|孙权"],"pinyin":["Dong1 Wu2"],"word":"东吴"},{"definition":["Shu Han (c. 200-263), Liu Bei's kingdom in Sichuan during the Three Kingdoms, claiming legitimacy as successor of Han"],"pinyin":["Shu3 Han4"],"word":"蜀汉"},{"definition":["the Qin army (model for the terracotta warriors)"],"pinyin":["Qin2 jun1"],"word":"秦军"},{"definition":["Lu, vassal state at the time of the Zhou Dynasty 周朝|周朝[Zhou1 chao2], located in the southwest of present-day Shandong 山東|山东[Shan1 dong1], birthplace of Confucius"],"pinyin":["Lu3 guo2"],"word":"鲁国"},{"definition":["Yuan Shao (153-202), general during late Han, subsequently warlord"],"pinyin":["Yuan2 Shao4"],"word":"袁绍"},{"definition":["Sun Quan (reigned 222-252), southern warlord and king of state of Wu 吳|吴 in the Three Kingdoms period"],"pinyin":["Sun1 Quan2"],"word":"孙权"},{"definition":["King Min of Qi (reigned 323-284 BC)"],"pinyin":["Qi2 Min3 wang2"],"word":"齐湣王"},{"definition":["King Huiwen of Zhao 趙國|赵国, reigned 298-266 BC during the Warring States Period"],"pinyin":["Zhao4 Hui4 wen2 Wang2"],"word":"赵惠文王"}]}