{"definition":["Chinese goldthread (Coptis chinensis), rhizome used in medicine"],"pinyin":["huang2 lian2"],"traditional":["黃連"],"rank":30585.0,"normalized_rank":0.4279238313768836,"fraction":8.952807855442301e-7,"cumulative_fraction":0.9907793125429009,"word":"黄连","characters":[{"definition":["surname Huang or Hwang","yellow\/pornographic\/to fall through"],"pinyin":["Huang2","huang2"],"word":"黄"},{"definition":["to link\/to join\/to connect\/continuously\/in succession\/including\/(used with 也[ye3], 都[dou1] etc) even\/company (military)","surname Lian"],"pinyin":["lian2","Lian2"],"word":"连"}],"containing_words":[{"definition":["no choice but to suffer in silence (idiom)\/also written 啞巴吃黃蓮|哑巴吃黄莲\/(often precedes 有苦說不出|有苦说不出[you3 ku3 shuo1 bu5 chu1])"],"pinyin":["ya3 ba5 chi1 huang2 lian2"],"word":"哑巴吃黄连"},{"definition":["to be forced to suffer in silence (idiom)\/unable to speak of one's bitter suffering\/sometimes written 啞子吃黃連，有苦說不出|哑子吃黄连，有苦说不出"],"pinyin":["ya3 ba5 chi1 huang2 lian2 , you3 ku3 shuo1 bu5 chu1"],"word":"哑巴吃黄连，有苦说不出"}],"sentences":[{"english":"Quantitative analysis on different proportions of couple of Coptis and Scute.","chinese":"对黄连与黄芩的不同比例配伍进行定量研究。"},{"english":"ObjectiveTo optimize the extraction technology of Huanglian Jiedu Decoction.","chinese":"目的选择黄连解毒汤方药的提取工艺。"},{"english":"Objective To investigate the allergic reaction of Shuanghuanglian Injection(SI)and chlorogenic acid.","chinese":"目的观察绿原酸和注射用双黄连的致敏性。"},{"english":"Rhizoma coptidis was extracted with water, and silk fabrics were dyed with the extract.","chinese":"用水提取黄连并用该提取液对丝绸进行染色。"},{"english":"OBJECTIVE To determine the chlorogenic acid contents in Shuanghuanglian oral solution.","chinese":"目的测定双黄连口服液中绿原酸的含量。"},{"english":"The content of oil in the seeds is high, which is good material for bio-diesel oil.","chinese":"黄连木种子含油率高，是生产生物柴油的好原料。"},{"english":"The primary active ingredienn are berberine and hydrastine alkaloids, among others.","chinese":"非洲防已碱是一种与黄连素联系密切的生物碱。"},{"english":"Conclusion Berberine has good cure effect on metabolism syndrome.","chinese":"结论黄连素治疗代谢综合症有较好的疗效。"},{"english":"To optimize the best technique for preparation of Shuanghuanglian(double coptis chinensis) Dripping Pill and to determine its dissolution limit.","chinese":"优选双黄连滴丸的最佳制备工艺并进行溶出时限检查。"},{"english":"The method can be used for quality control of Huanglian Yanggan Pills.","chinese":"可用于控制黄连羊肝丸的质量。"},{"english":"Objectiv To evaluate the effect of the Shuang Huanglian inhaled in the gasping pneumonia.","chinese":"目的评价双黄连雾化吸入对喘憋性肺炎的疗效。"},{"english":"Berberine (Ber), an isoquinoline-type alkaloid, has significant antibacterial effect.","chinese":"黄连素属于异喹啉生物碱，具有显著的抗菌作用。"},{"english":"The experimental group was treated with coptis chinensis compound while the control group was only perfused with sterile water.","chinese":"实验组灌喂复方黄连，对照组裸鼠仅灌喂无菌水。"},{"english":"SYNOPSIS: Guyanling is a composite Chinese medicine made up of Coptis chinensis Franch, and some other herbs.","chinese":"骨炎灵是由黄连等中药组成的复方制剂。"},{"english":"The seeds of Coptis chinensis need stratification to break dormancy.","chinese":"黄连种子需要在低温条件下才能解除休眠。"},{"english":"Sister is already dumb, and it still fails I eat Coptis?","chinese":"姐经已系哑巴咗，唔通还得食黄连唔成？"}],"related":[{"definition":["Ningpo figwort (Scrophularia ningpoensis)\/root of Ningpo figwort (used in TCM)"],"pinyin":["xuan2 shen1"],"word":"玄参"},{"definition":["variant of 黃檗|黄檗[huang2 bo4]"],"pinyin":["huang2 bo4"],"word":"黄柏"},{"definition":["dried fruit of immature citron or trifoliate orange (used in TCM)"],"pinyin":["zhi3 shi2"],"word":"枳实"},{"definition":["bitter orange (Fructus aurantii) (used in TCM)"],"pinyin":["zhi3 qiao4"],"word":"枳壳"},{"definition":["licorice root"],"pinyin":["gan1 cao3"],"word":"甘草"},{"definition":["liquorice (Sophora flavescens), with roots used in TCM"],"pinyin":["ku3 shen1"],"word":"苦参"},{"definition":["Manchurian wild ginger (family Asarum)"],"pinyin":["xi4 xin1"],"word":"细辛"},{"definition":["the root bark of the peony tree"],"pinyin":["dan1 pi2"],"word":"丹皮"},{"definition":["Wolfiporia extensa (a wood-decay fungus)\/fu ling\/tuckahoe"],"pinyin":["fu2 ling2"],"word":"茯苓"},{"definition":["Chinese thorowax (Bupleurum chinense)\/root of Chinese thorowax (used in TCM)"],"pinyin":["chai2 hu2"],"word":"柴胡"},{"definition":["reed rhizome (used in TCM)"],"pinyin":["lu2 gen1"],"word":"芦根"},{"definition":["Anemarrhena asphodeloides\/rhyzome of Anemarrhena (used in TCM)"],"pinyin":["zhi1 mu3"],"word":"知母"},{"definition":["blackberry lily (Belamcanda chinensis)\/leopard lily"],"pinyin":["she4 gan1"],"word":"射干"},{"definition":["dwarf lilyturf (Ophiopogon japonicus), its tuber used in TCM"],"pinyin":["mai4 dong1"],"word":"麦冬"},{"definition":["root bark of the peony tree (used in TCM)"],"pinyin":["mu3 dan5 pi2"],"word":"牡丹皮"},{"definition":["honeysuckle"],"pinyin":["jin1 yin2 hua1"],"word":"金银花"}]}