{"definition":["Heilongjiang Province (Heilungkiang) in northeast China, abbr. 黑, capital Harbin 哈爾濱|哈尔滨[Ha1 er3 bin1]"],"pinyin":["Hei1 long2 jiang1 Sheng3"],"traditional":["黑龍江省"],"rank":6419.0,"normalized_rank":0.08981013809410547,"fraction":0.000016789324798271406,"cumulative_fraction":0.8873799905649197,"word":"黑龙江省","characters":[{"definition":["abbr. for Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1]","black\/dark\/sinister\/secret\/shady\/illegal\/to hide (sth) away\/to vilify\/(loanword) to hack (computing)"],"pinyin":["Hei1","hei1"],"word":"黑"},{"definition":["dragon\/CL:條|条[tiao2]\/imperial","surname Long"],"pinyin":["long2","Long2"],"word":"龙"},{"definition":["river\/CL:條|条[tiao2],道[dao4]","surname Jiang"],"pinyin":["jiang1","Jiang1"],"word":"江"},{"definition":["to save\/to economize\/to do without\/to omit\/to leave out\/province\/(archaic) central government department","to inspect\/to examine\/to be aware\/to pay a visit (to one's parents or elders)"],"pinyin":["sheng3","xing3"],"word":"省"}],"containing_words":[],"sentences":[{"english":"Introduce the famous historical and cultural city in Hei Long jiang ?","chinese":"请介绍一下黑龙江省的国家及省级历史文化名城？"},{"english":"Heilongjiang province science department three forms enter take a fraction be?","chinese":"黑龙江省理科三表入取分数是？"},{"english":"Poplar crinkle disease is a new discovered in artificial poplar forest in Heilongjiang province.","chinese":"杨树皱叶病是在黑龙江省杨树人工林中新发现的病害。"},{"english":"The production level of rice is positive correlation with the active accumulated temperature apparently in Heilongjiang province.","chinese":"黑龙江省稻谷产量水平与活动积温呈显著正相关。"},{"english":"The use of grounding wires in the Heilongjiang electric power system is described.","chinese":"介绍了黑龙江省电力系统接地线使用的状况。"},{"english":"Only a couple of hours later, the blaze had quickly spread to the neighboring Heilongjiang Province.","chinese":"仅仅几小时后，火舌便迅速窜到了临近的黑龙江省。"},{"english":"Sanxing, the ancient place name, is Yilan County of Heilongjiang Province today.","chinese":"三姓，古地名，今黑龙江省依兰县。"},{"english":"Heilongjiang province, locating the northest of china is a big province of consuming beer.","chinese":"位于我国最北部的黑龙江省是我国啤酒消费的大省。"},{"english":"Introduce the climate and precipitation in Hei Long jiang ?","chinese":"简介黑龙江省气温及降水情况？"},{"english":"The company is located in the western outskirt of Boli county in Heilongjiang province.","chinese":"公司座落于黑龙江省东部勃利县城西郊。"},{"english":"Objective To study the tissue characteristics of radix and rhizome of Acanthopanax senticosus(Rupr et Maxim) Harms in Heilongjiang province.","chinese":"目的研究黑龙江省刺五加根及根茎的组织特征。"},{"english":"This article discussed the historical relations between toponymy and ancient nationality in HeiLongJiang Province.","chinese":"本文论述了黑龙江省地名学与古代民族的历史关系。"},{"english":"The article introduces the new drilling experiment table manufactured by Heilongjiang Institute of Agricultural Mechanical Engineering Science in a systematic way.","chinese":"系统介绍了黑龙江省农机院研制的新型排种器试验台。"},{"english":"Using time series analysis methods, in this paper the prediction model of the epidemic encephalomyelitis in Heilongjiang Province were given.","chinese":"本文用时间序列分析法建立了黑龙江省流脑预测模型。"},{"english":"Spring wheat is one of the major crops in Heilongjiang province.","chinese":"小麦是黑龙江省主要粮食作物之一。"},{"english":"Moreover the dissertation carries on study the establishment of big enterprise groups of Heiiongjiang province.","chinese":"并对黑龙江省组建煤炭企业大集团进行了实证研究。"}],"related":[{"definition":["Jilin Province (Kirin) in northeast China, abbr. 吉, capital Changchun 長春|长春[Chang2 chun1]"],"pinyin":["Ji2 lin2 Sheng3"],"word":"吉林省"},{"definition":["Mudanjiang prefecture level city in Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Mu3 dan5 jiang1 shi4"],"word":"牡丹江市"},{"definition":["Liaoning province in northeast China, short name 遼|辽[Liao2], capital Shenyang 瀋陽|沈阳[Shen3 yang2]"],"pinyin":["Liao2 ning2 sheng3"],"word":"辽宁省"},{"definition":["Harbin, subprovincial city and capital of Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Ha1 er3 bin1 shi4"],"word":"哈尔滨市"},{"definition":["Qiqihar prefecture level city in Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Qi2 qi2 ha1 er3 shi4"],"word":"齐齐哈尔市"},{"definition":["Kiamusze or Jiamusi prefecture-level city in Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Jia1 mu4 si1 shi4"],"word":"佳木斯市"},{"definition":["Jixi prefecture-level city in Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Ji1 xi1 shi4"],"word":"鸡西市"},{"definition":["Suihua prefecture level city in Heilongjiang Province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Sui2 hua4 Shi4"],"word":"绥化市"},{"definition":["Inner Mongolia autonomous region, abbr. 內蒙古|内蒙古[Nei4 meng3 gu3], capital Hohhot 呼和浩特市[Hu1 he2 hao4 te4 Shi4]"],"pinyin":["Nei4 meng3 gu3 Zi4 zhi4 qu1"],"word":"内蒙古自治区"},{"definition":["Heihe prefecture-level city in Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Hei1 he2 shi4"],"word":"黑河市"},{"definition":["Heilongjiang province (Heilungkiang) in northeast China, abbr. 黑, capital Harbin 哈尔滨\/Heilongjiang river forming the border between northeast China and Russia\/Amur river"],"pinyin":["Hei1 long2 jiang1"],"word":"黑龙江"},{"definition":["Daqing prefecture-level city in Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Da4 qing4 shi4"],"word":"大庆市"},{"definition":["Yanbian Korean autonomous prefecture 延邊朝鮮族自治州|延边朝鲜族自治州 in Jilin province 吉林省 in northeast China, capital Yanji city 延吉市"],"pinyin":["Yan2 bian1 zhou1"],"word":"延边州"},{"definition":["Yichun prefecture level city in Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Yi1 chun1 shi4"],"word":"伊春市"},{"definition":["Heihe prefecture, Heilongjiang"],"pinyin":["Hei1 he2 di4 qu1"],"word":"黑河地区"},{"definition":["Daxing'anling prefecture in northwest Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Da4 xing1 an1 ling3 di4 qu1"],"word":"大兴安岭地区"}]}