{"definition":["lit. to stand like the three legs of a tripod\/tripartite confrontation or balance of forces"],"pinyin":["ding3 li4"],"traditional":["鼎立"],"rank":26706.0,"normalized_rank":0.3736515887118213,"fraction":0.0000012681076445496047,"cumulative_fraction":0.986630923992178,"word":"鼎立","characters":[{"definition":["ancient cooking cauldron with two looped handles and three or four legs\/pot (dialect)\/to enter upon a period of (classical)\/Kangxi radical 206\/one of the 64 hexagrams of the Book of Changes"],"pinyin":["ding3"],"word":"鼎"},{"definition":["surname Li","to stand\/to set up\/to establish\/to lay down\/to draw up\/at once\/immediately"],"pinyin":["Li4","li4"],"word":"立"}],"containing_words":[{"definition":["separation of powers"],"pinyin":["san1 quan2 ding3 li4"],"word":"三权鼎立"}],"sentences":[{"english":"Changsha Dingli drives with you to achieve win-win development.","chinese":"长沙鼎立愿与您实现共赢发展。"},{"english":"Was Sun Quan the emperor of the State of Wu during the Three Kingdom Period?","chinese":"那么孙权就是三国鼎立时的吴国皇帝是吗？"},{"english":"The formation of the Three Kingdoms, the Wei who is it?","chinese":"形成三国鼎立，那么谁是魏呢？"},{"english":"Don’t worry about your expense to go to college, we will try our best to help you.","chinese":"不要担心你上大学的费用，我们会鼎立相助。"},{"english":"In fact, besides the apparent cause of the opportune, the talents, especially the advisors had a pivotal role in the Three Kingdoms.","chinese":"谋士集团在三国鼎立中有着举足轻重的作用。"},{"english":"The empire was once again divided into three.","chinese":"罗马帝国又一次形成了三足鼎立的局面。"},{"english":"Our factory is well organized, fast parts leave time . we will offer professional support all the new and old customers.","chinese":"我们会对新老客户鼎立提供专业的技术支持。"}],"related":[{"definition":["competition between three rivals\/tripartite confrontation"],"pinyin":["ding3 zu2 zhi1 shi4"],"word":"鼎足之势"},{"definition":["lit. the three legs of a tripod\/fig. three competing rivals"],"pinyin":["ding3 zu2"],"word":"鼎足"},{"definition":["to exist side by side\/to exist simultaneously"],"pinyin":["bing4 li4"],"word":"并立"},{"definition":["to be perched high\/to be located prominently\/to be preeminent"],"pinyin":["xiong2 ju4"],"word":"雄踞"},{"definition":["a tripartite balance\/compromise between three rivals"],"pinyin":["ding3 zhi4"],"word":"鼎峙"},{"definition":["(honorific) your kind efforts\/thanks to your help"],"pinyin":["ding3 li4"],"word":"鼎力"},{"definition":["peer competition\/to function as rivals\/to make claims as an equal"],"pinyin":["fen1 ting2 kang4 li3"],"word":"分庭抗礼"},{"definition":["to contend for supremacy"],"pinyin":["zheng1 xiong2"],"word":"争雄"},{"definition":["to unify\/unified"],"pinyin":["yi1 tong3"],"word":"一统"},{"definition":["to contend for hegemony\/a power struggle"],"pinyin":["zheng1 ba4"],"word":"争霸"},{"definition":["to plan to seize power of the whole country (idiom)"],"pinyin":["wen4 ding3 Zhong1 yuan2"],"word":"问鼎中原"},{"definition":["two tigers fighting (idiom); fierce contest between evenly matched adversaries"],"pinyin":["liang3 hu3 xiang1 zheng1"],"word":"两虎相争"},{"definition":["to run neck and neck\/to keep pace with\/to keep abreast of\/on a par with one another"],"pinyin":["bing4 jia4 qi2 qu1"],"word":"并驾齐驱"},{"definition":["to exercise sole hegemony (idiom); to dominate a whole area (market, resources etc)\/to hold as one's personal fiefdom"],"pinyin":["du2 ba4 yi1 fang1"],"word":"独霸一方"},{"definition":["to set up an independent regime\/to secede\/segmentation\/division\/fragmentation"],"pinyin":["ge1 ju4"],"word":"割据"},{"definition":["lit. hunting deer in the Central Plain (idiom)\/fig. to attempt to seize the throne"],"pinyin":["zhu2 lu4 Zhong1 yuan2"],"word":"逐鹿中原"}]}