{"definition":["Qi state of Western Zhou and the Warring states (1122-265 BC), centered in Shandong"],"pinyin":["Qi2 guo2"],"traditional":["齊國"],"rank":32443.0,"normalized_rank":0.4539196619702545,"fraction":7.590836596820473e-7,"cumulative_fraction":0.9923119221587772,"word":"齐国","characters":[{"definition":["(name of states and dynasties at several different periods)\/surname Qi","neat\/even\/level with\/identical\/simultaneous\/all together\/to even sth out"],"pinyin":["Qi2","qi2"],"word":"齐"},{"definition":["surname Guo","country\/nation\/state\/national\/CL:個|个[ge4]"],"pinyin":["Guo2","guo2"],"word":"国"}],"containing_words":[],"sentences":[{"english":"The king of Zhao accpeted the gifts gladly and sent a hundred thousand troops to help Qi.","chinese":"赵王见了礼物十分高兴，派了十万士兵去援助齐国。"},{"english":"One year, there was a great famine in the State of Qi.","chinese":"有一年，齐国发生了特大的饥荒。"},{"english":"Later when the state of qi guanzhong ruler, and cao foam did lu general.","chinese":"后来管仲当了齐国的宰相，而曹沫做了鲁国的将军。"},{"english":"Chu and Qi were only able to compete with them.","chinese":"当时只有楚国和齐国能与之抗衡。"},{"english":"Qi began to  launch the second round of attacks. They beat the drums again.","chinese":"齐国开始发动第二轮进攻，他们重新擂起战鼓。"},{"english":"The Ji-xia academy was a famous institution of Qi in the Warring States Period.","chinese":"稷下学宫是战国时期齐国的一所著名学府。"},{"english":"A carpenter called Shijun someday passed by Quyuan, a place in the State of Qi.","chinese":"木匠石君有一天路过齐国一个叫曲辕的地方。"},{"english":"After the foundation of the Qi, salt economy was paid attention to.","chinese":"齐国建立之后，盐业经济受到了重点关注。"},{"english":"He uttered the hardship of the mission to Confucius as soon as talk started.","chinese":"沈先生一见面就向孔子倾述这回出使齐国的艰难之处。"},{"english":"There is a big bird which has lived in the palace for three years.","chinese":"齐国有一只大鸟，栖在王宫的庭院里依然整整三年了。"},{"english":"Qi is the main currency of the country to use a knife.","chinese":"齐国是使用刀币的主要国家。"},{"english":"Duke Huan appointed Guan Zhong the chief minister, and yet the state of Qi was not peaceful and orderly.","chinese":"桓公任命管仲作上卿，可是齐国还不太平。"},{"english":"As you know, it is well known how Qi treats missioner.","chinese":"可是你知道齐国对待使节阳奉阴违是出了名的。"},{"english":"Duke Huan bestowed on him the revenues from the commodity tax of Qi for one year, yet the state was not peaceful and orderly.","chinese":"桓公赐给他齐国一年的货物税，可是齐国还不太平。"},{"english":"Duke Huan bestowed on him the revenues from the commodity tax of Qi for one year, yet the state was not peaceful and orderly.","chinese":"桓公赐给他齐国一年的货物税，可是齐国还不太平。"},{"english":"Recently there appeared two works that mentioned the so-called Qi State bird-worm inscription existing in the Qi bronze wares.","chinese":"近来有两种论著提到所谓齐国铜器中的鸟虫书。"}],"related":[{"definition":["the state of Qin, one of the seven states of the Warring States Period (475-220 BC)"],"pinyin":["Qin2 guo2"],"word":"秦国"},{"definition":["Zhao, one of the seven states during the Warring States Period of Chinese history (475-220 BC)"],"pinyin":["Zhao4 Guo2"],"word":"赵国"},{"definition":["the state of Chu, one of the most important of the small states contending for power in China between 770 and 223 BC, located around present-day Hubei"],"pinyin":["Chu3 guo2"],"word":"楚国"},{"definition":["Lu, vassal state at the time of the Zhou Dynasty 周朝|周朝[Zhou1 chao2], located in the southwest of present-day Shandong 山東|山东[Shan1 dong1], birthplace of Confucius"],"pinyin":["Lu3 guo2"],"word":"鲁国"},{"definition":["Yan, a vassal state of Zhou in modern Hebei and Liaoning\/north Hebei\/the four Yan kingdoms of the Sixteen Kingdoms, namely: Former Yan 前燕 (337-370), Later Yan 後燕|后燕 (384-409), Southern Yan 南燕 (398-410), Northern Yan 北燕 (409-436)"],"pinyin":["Yan1 guo2"],"word":"燕国"},{"definition":["Wei State (407-225 BC), one of the Seven Hero States of the Warring States 戰國七雄|战国七雄\/Wei State or Cao Wei 曹魏 (220-265), the most powerful of the Three Kingdoms"],"pinyin":["Wei4 guo2"],"word":"魏国"},{"definition":["King Min of Qi (reigned 323-284 BC)"],"pinyin":["Qi2 Min3 wang2"],"word":"齐湣王"},{"definition":["Yue state\/generic term for states in south China or southeast Asia at different historical periods"],"pinyin":["Yue4 guo2"],"word":"越国"},{"definition":["Wu state (in south China, in different historical periods)\/Wu state 220-280, founded by Sun Quan 孫權|孙权 the southernmost of the three Kingdoms"],"pinyin":["Wu2 guo2"],"word":"吴国"},{"definition":["Duke Huan of Qi (reigned 685-643 BC), one of the Five Hegemons 春秋五霸"],"pinyin":["Qi2 Huan2 gong1"],"word":"齐桓公"},{"definition":["vassal state"],"pinyin":["zhu1 hou2 guo2"],"word":"诸侯国"},{"definition":["Duke Mu of Qin, the first substantial king of Qin (ruled 659-621 BC), sometimes considered one of the Five Hegemons 春秋五霸"],"pinyin":["Qin2 Mu4 gong1"],"word":"秦穆公"},{"definition":["Duke Wen of Jin (697-628 BC, reigned 636-628 BC), one of the Five Hegemons 春秋五霸"],"pinyin":["Jin4 Wen2 gong1"],"word":"晋文公"},{"definition":["the state of Ju, ancient Dongyi state"],"pinyin":["Ju3 guo2"],"word":"莒国"},{"definition":["King Huiwen of Zhao 趙國|赵国, reigned 298-266 BC during the Warring States Period"],"pinyin":["Zhao4 Hui4 wen2 Wang2"],"word":"赵惠文王"},{"definition":["to defend one's country","state of Wei (c. 1040-209 BC), vassal of Zhou"],"pinyin":["wei4 guo2","Wei4 guo2"],"word":"卫国"}]}