{"definition":["intellectual property (in China, esp. since 2015, often used as an entertainment industry term for a creative work used as the basis of a new product, such as a manga adapted as a tv series, or the image of a cartoon character appearing on merchandise)"],"pinyin":["I P"],"simplified":["IP"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"IP","characters":[{"word":"I"},{"definition":["(slang) femme (lesbian stereotype)\/to photoshop"],"pinyin":["P"],"word":"P"}],"containing_words":[{"definition":["screen adaptation (TV series or movie based on an online novel or video game etc)"],"pinyin":["I P ju4"],"word":"IP劇"}],"sentences":[{"english":"Packets in the IP layer are called datagrams.","chinese":"IP層中的數據包稱爲“數據報”。"},{"english":"Zinc alloy plating watchcase IP black strap.","chinese":"鋅合金錶殼錶帶電鍍IP黑色。"},{"english":"This paper discusses the design and implementation of a broadband IP Metropolitan Area Network in a city for a telecommunication provider.","chinese":"介紹了一個電信寬帶IP城域網的設計與實現。"},{"english":"Discovery algorithms usually go from high layer (IP layer) to low layer (data-link layer).","chinese":"拓撲發現算法的發現通常是從IP層到鏈路層。"},{"english":"The principles for the construction of IP MAN of CTT's Shandong Branch were presented.","chinese":"提出了山東鐵通IP城域網組網建設的原則。"},{"english":"The article sets forth wideband IP access technique and relevant systems.","chinese":"本文闡述寬帶IP接入技術，以及相關係統。"},{"english":"Multi-Protocol Label Switching is a very important technology for IP networks.","chinese":"多協議標籤交換是IP網絡中的重要技術。"},{"english":"Conclusion IP is a proliferous benign tumor.","chinese":"結論IP是有一定增殖活性的良性腫瘤。"},{"english":"For IP voice risers , ethernet backgrond shall be provided.","chinese":"對於IP聲音豎板，需要提供以太線路。"},{"english":"A novel 43-bit floating-point pipelined multiplier IP chip-core is presented.","chinese":"提出一種浮點流水線乘法器IP芯核。"},{"english":"What are Netease Mail Server's IP addresses?","chinese":"網易公司郵件任職器的IP是幾多？"},{"english":"IP is connectionless, best-effort delivery protocol.","chinese":"IP是無連接，盡力傳輸的協議。"},{"english":"Use the following IP address as the source address in outgoing packets.","chinese":"使用下面的IP位址作爲來源位址的封包輸出。"},{"english":"With IP addresses , it can help you organize your network.","chinese":"藉由IP位址，他能幫助你組織你的網絡。"},{"english":"The customization of a IP Boards forum.","chinese":"一個IP板卡論壇定製。"},{"english":"Mixed transmission of SDH \/ATM \/ IP is a sort of advisable transmission mode of metropolitan area optical network.","chinese":"IP混合傳輸是城域光網絡中一種常見的傳輸方式。"}],"related":[]}