{"definition":["lit. when a man achieves the Dao, his poultry and dogs rise to Heaven (idiom)\/fig. to ride on sb else's success\/Once one man gets a government position, all his cronies get in too\/Once sb has cracked the problem, every Tom, Dick and Harry can do it"],"pinyin":["yi1 ren2 de2 dao4 , ji1 quan3 sheng1 tian1"],"simplified":["一人得道，鸡犬升天"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"一人得道，雞犬升天","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"},{"word":"，"},{"definition":["fowl\/chicken\/CL:隻|只[zhi1]\/(slang) prostitute"],"pinyin":["ji1"],"word":"雞"},{"definition":["dog\/Kangxi radical 94"],"pinyin":["quan3"],"word":"犬"},{"definition":["to ascend\/to rise to the rank of\/to promote\/to hoist\/liter\/measure for dry grain equal to one-tenth dou 斗[dou3]"],"pinyin":["sheng1"],"word":"升"},{"definition":["day\/sky\/heaven"],"pinyin":["tian1"],"word":"天"}],"containing_words":[],"sentences":[],"related":[]}