{"definition":["to lump together\/to treat along with all the others"],"pinyin":["yi1 bing4"],"simplified":["一并"],"rank":9933.0,"normalized_rank":0.13897555720341948,"fraction":0.000008353569697174068,"cumulative_fraction":0.929140764829014,"word":"一併","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to combine\/to amalgamate"],"pinyin":["bing4"],"word":"併"}],"containing_words":[],"sentences":[{"english":"In this dictionary both spelling is show when both is possible.","chinese":"在兩種拼法皆可時，本詞典將之一併列出。"},{"english":"The other side is also for sale.","chinese":"另一半連體房也一併出售。"},{"english":"Mortuary later picked up 40 people survived Gai, also a Canadian and bandit buried in tombs edge.","chinese":"後人殮拾40人遺賅時，亦一併將強盜屍首葬於墓邊。"},{"english":"Please complete the enclosed form and return it with the appropriate fee. Thanks again for your business.","chinese":"煩表填妥隨附表格，連同廣告費用一併寄回。"},{"english":"Please complete the enclosed form. and return it with the appropriate fee.","chinese":"煩表填妥隨附表格，連同廣告費用一併寄回。"},{"english":"Carrying on a research to it, we must investigate the name and the material object together, and clarify the source and course.","chinese":"對之進行研究，必須名實同步考察，源流一併弄清。"},{"english":"Have you paid the review fee together with the completed application form?","chinese":"閣下有否把已填妥之申請表連同覆檢費用一併遞交？"},{"english":"Other cards in tricks and tools used in conjunction.","chinese":"其它牌技千術手法和用具一併使用。"},{"english":"We brought all of them to settlements.","chinese":"我們把它們一併解決。"},{"english":"Fried in the pan, add Minced meat.","chinese":"放入油鍋炒熟，加入絞肉泥一併炒熟。"},{"english":"The novel features of the invention is a varistor that is connected in parallel with the capacitor.","chinese":"本發明的新穎特點在於有一併聯在電容上的變阻器。"},{"english":"A mortgagor may at the same time mortgage all the property listed in the preceding paragraph.","chinese":"抵押人可以將前款所列財產一併抵押。"},{"english":"Make sure that the Field History Sheet is filled in accurately and submitted together with this application form.","chinese":"確保田塊歷史記錄填寫正確並且和本申請表一併提交。"},{"english":"Please submit the filled form with applicant's AYP record book.","chinese":"請填妥本表格，連同獎勵計劃紀錄簿一併遞交。"},{"english":"All eligible transactions made by the Principal and Supplementary Cardholders of Designated Credit Card will be counted collectively.","chinese":"指定信用卡之主卡及附屬卡之合資格籤賬將一併計算。"},{"english":"The new law would criminalise oblivious as well.","chinese":"這一新法案將有可能連不知情者也一併法辦了。"}],"related":[]}