{"definition":["for a time\/at one time\/one time\/once"],"pinyin":["yi1 du4"],"simplified":["一度"],"rank":2147.0,"normalized_rank":0.030039315545730555,"fraction":0.00007058003661011733,"cumulative_fraction":0.7412768528692993,"word":"一度","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to estimate\/Taiwan pr. [duo4]","to pass\/to spend (time)\/measure\/limit\/extent\/degree of intensity\/degree (angles, temperature etc)\/kilowatt-hour\/classifier for events and occurrences"],"pinyin":["du4","duo2"],"word":"度"}],"containing_words":[{"definition":["to have sexual intercourse (once)"],"pinyin":["chun1 feng1 yi1 du4"],"word":"春風一度"},{"definition":["once a year (every year)"],"pinyin":["mei3 nian2 yi1 du4"],"word":"每年一度"}],"sentences":[{"english":"The epidemic was stopped before the annual pilgrimage to Mecca got under way.","chinese":"這傳染病在一年一度進行麥加朝聖之前停止。"},{"english":"The one hundred and first meridian was passed.","chinese":"現在已經越過了經線一百零一度了。"},{"english":"He was invited to present the prizes at the annual flower show.","chinese":"他受邀在一年一度的花展上頒獎。"},{"english":"Lijiashan once housed 600 families.","chinese":"李家山一度曾有600戶居民。"},{"english":"The Shuanglong Lake is a shallow and urban lake, it had been a serious typical eutrophic lake.","chinese":"雙龍湖是淺水型城市湖泊，一度爲重富營養化湖泊。"},{"english":"The typewriter rescued him, at least for a time.","chinese":"打字機挽救了他，起碼一度挽救過他。"},{"english":"At one point, he even demanded to know who was behind the killing of JFK.","chinese":"他甚至一度要求知道是誰策劃謀殺了肯尼迪總統。"},{"english":"The first prize was awarded to the best competitor of the annual sports meeting .","chinese":"頭獎頒給了這一年一度的運動會上最優秀的運動員。"},{"english":"Police suspect the girls were taken by their father.","chinese":"警方一度懷疑孩子們曾被其父親協持。"},{"english":"The novel I had thrown away was chosen by the Book Society.","chinese":"我一度扔掉的那部小說後來被書社選中了。"},{"english":"The uterus contracted well with bleeding of 200ml, lst degree perineal was repaired.","chinese":"子宮收縮好，出血200毫升，會陰一度撕裂被修復。"},{"english":"The day after tomorrow, we will be celebrating the traditional Chinese holiday, the Mid-Autumn Festival.","chinese":"再過兩天，就是一年一度的中國傳統佳節中秋節。"},{"english":"York is the capital city of Yorkshire and was once known as England's \"second\" city.","chinese":"約克城是約克郡的首府，曾一度爲英格蘭第二大城市。"},{"english":"But how the human body is able to sense a one-degree change in temperature has remained a mystery.","chinese":"但人體如何感知一度的溫度變化仍是個謎。"},{"english":"It is possible that at one time John was a member of the Judean Desert sect.","chinese":"有可能約翰曾經一度是那個小教派的成員。"},{"english":"After the explosion, Cheney said he was briefly moved to a bomb shelter.","chinese":"爆炸發生後，錢尼說，他一度被轉移到防彈設施內。"}],"related":[{"definition":["once more\/once again\/one more time"],"pinyin":["zai4 du4"],"word":"再度"},{"definition":["after this\/afterwards\/hereafter"],"pinyin":["ci3 hou4"],"word":"此後"},{"definition":["even\/so much so that"],"pinyin":["shen4 zhi4"],"word":"甚至"},{"definition":["once\/already\/former\/previously\/ever\/(past tense marker used before verb or clause)"],"pinyin":["ceng2 jing1"],"word":"曾經"},{"definition":["repeatedly\/time and again"],"pinyin":["lu:3 ci4"],"word":"屢次"},{"definition":["old variant of 卻|却[que4]"],"pinyin":["que4"],"word":"㕁"},{"definition":["soon after"],"pinyin":["sui2 hou4"],"word":"隨後"},{"definition":["also\/too\/(in Classical Chinese) final particle implying affirmation","surname Ye"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["one more time\/again\/one more\/once again"],"pinyin":["zai4 ci4"],"word":"再次"},{"definition":["to sink into\/to get caught up in\/to land in (a predicament)"],"pinyin":["xian4 ru4"],"word":"陷入"},{"definition":["to be on the brink of\/to be on the verge of"],"pinyin":["ji1 jin4"],"word":"幾近"},{"definition":["despite\/although\/even though\/in spite of\/unhesitatingly\/do not hesitate (to ask, complain etc)\/(go ahead and do it) without hesitating"],"pinyin":["jin3 guan3"],"word":"儘管"},{"definition":["straight (in a straight line)\/continuously\/always\/from the beginning of ... up to ...\/all along"],"pinyin":["yi1 zhi2"],"word":"一直"},{"definition":["before this\/before then\/previously"],"pinyin":["ci3 qian2"],"word":"此前"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不過"},{"definition":["a good thing doesn't last forever (idiom)"],"pinyin":["hao3 jing3 bu4 chang2"],"word":"好景不長"}]}