{"definition":["continuously\/persistently\/incessantly"],"pinyin":["yi1 ge4 jin4"],"simplified":["一个劲"],"rank":16792.0,"normalized_rank":0.2349418661592489,"fraction":0.000003363908433406365,"cumulative_fraction":0.9657266339725818,"word":"一個勁","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["individual\/this\/that\/size\/classifier for people or objects in general"],"pinyin":["ge4"],"word":"個"},{"definition":["stalwart\/sturdy\/strong\/powerful","strength\/energy\/enthusiasm\/spirit\/mood\/expression\/interest\/CL:把[ba3]\/Taiwan pr. [jing4]"],"pinyin":["jin4","jing4"],"word":"勁"}],"containing_words":[{"definition":["erhua variant of 一個勁|一个劲[yi1 ge4 jin4]"],"pinyin":["yi1 ge4 jin4 'r"],"word":"一個勁兒"}],"sentences":[{"english":"His mouth continued to twitch unspeaking in nervous curls of disdain.","chinese":"嘴脣卻一個勁兒地抽搐着，顯示出神經質的嘲諷。"},{"english":"Oh, the deficit's a rising.","chinese":"赤字還在一個勁地漲。"},{"english":"It took me a long time to answer that I really had no idea and kept shaking my head.","chinese":"我想了好久，最後一個勁地搖頭說，真不知道先救誰。"},{"english":"That young girl Hun however don't feel, waving hand of a strength son.","chinese":"那少女渾然未覺，一個勁兒的揮手。"},{"english":"One of the children was pawing at my sleeve.","chinese":"有個孩子一個勁地拽我的袖子。"},{"english":"Even now her self-command is invariable.","chinese":"直到如今，她還一個勁地剋制自己。"},{"english":"But Michelle still coped every word Adam said.","chinese":"可是雯馨還一個勁學嘉輝說話。"},{"english":"Bow The waiter showed us to our table with much bowingand scraping.","chinese":"服務員一個勁地點頭哈腰領我們就座。"},{"english":"The startled horse charged about blindly, upsetting a row of ped1ars' stalls AT the side of the street.","chinese":"那匹驚馬一個勁亂跑，把街旁一排小販的貨攤撞翻了。"},{"english":"The child was able to filter out the noises surrounding him, as he was so busy in his play.","chinese":"這個小孩一個勁地玩耍，全然沒有注意周圍的鬧聲。"},{"english":"He said it was him at first, and then he kept saying he had the wrong number.","chinese":"他開始說是他，可是後來他又一個勁兒說撥錯號碼了。"},{"english":"The last call, he features a move in that he Hao Fan.","chinese":"最後一次通話時，他一個勁在說他好煩。"},{"english":"We all had colds and couldn't stop sniffing and sneezing.","chinese":"我們都感冒了，一個勁地抽鼻子，打噴嚏。"},{"english":"He was just kind of blinking.","chinese":"他只是一個勁的眨眼睛。"},{"english":"Daniel, don't just walk on with a lowered head.","chinese":"大牛，你別隻顧着低着頭一個勁兒地往前走啊。"},{"english":"Zi brought mine, 78-year-old Uncle Wang features a move Shutaimuzhi.","chinese":"提起淄礦，78歲的王大爺一個勁豎大拇指。"}],"related":[]}