{"definition":["to skate around\/to skip over\/to skimp"],"pinyin":["yi1 dai4 er2 guo4"],"simplified":["一带而过"],"rank":49019.0,"normalized_rank":0.6858394078882935,"fraction":1.6013745666753958e-7,"cumulative_fraction":0.9988108407054996,"word":"一帶而過","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"帶"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"}],"containing_words":[],"sentences":[{"english":"Usually only does not treat seriously to the cultural context knowledge.","chinese":"通常只對文化背景知識一帶而過。"},{"english":"The chairman slurred over the problem at the meeting.","chinese":"會議主席在會上對這個問題一帶而過。"},{"english":"He skated over the mistakes he made.","chinese":"他對他所犯的錯誤一帶而過。"},{"english":"Every time we came to that delicate problem, the chairman skates over it.","chinese":"每次我們談到這個微妙的問題時主席都一帶而過。"},{"english":"And there was just 1 line, that I blazed past, probably too quickly.","chinese":"總共只有一行語句，我上次是一帶而過了。"},{"english":"Specific those things that should learn later, just be taken in the book and pass.","chinese":"具體以後該學的那些東西，書中只是一帶而過。"},{"english":"You can skate on this one , John.","chinese":"你可以巧妙地一帶而過，約翰。"}],"related":[]}