{"definition":["erhua variant of 一塊|一块[yi1 kuai4]"],"pinyin":["yi1 kuai4 'r"],"simplified":["一块儿"],"rank":16147.0,"normalized_rank":0.2259174793278581,"fraction":0.0000036138221305939933,"cumulative_fraction":0.9634755566360546,"word":"一塊兒","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["lump (of earth)\/chunk\/piece\/classifier for pieces of cloth, cake, soap etc\/(coll.) classifier for money and currency units"],"pinyin":["kuai4"],"word":"塊"},{"definition":["child\/son","non-syllabic diminutive suffix\/retroflex final"],"pinyin":["'r","er2"],"word":"兒"}],"containing_words":[],"sentences":[{"english":"PUGILISTS and aesthetes are not necessarily in opposing corners.","chinese":"拳擊家和美學家未必就湊不到一塊兒。"},{"english":"If you combine all that effort into one, you should have a lot more effect.","chinese":"如果你把它們都捏到一塊兒，你就會有大得多的影響。"},{"english":"It's not like I have 180 friends that I can go hang out with.","chinese":"不象有180個可以一塊兒出去玩的朋友。"},{"english":"One of the biggest disrupters of sleep is the pulling and tugging of sheets and blankets.","chinese":"倆人一塊兒睡的時候，最煩的就是拉被單和揪毯子了。"},{"english":"All the colors were running together and becoming mud brown!","chinese":"所有的顏色都跑一塊兒，變成泥巴一般的棕色了。"},{"english":"Please bring your wife along next time.","chinese":"請你下次帶你夫人一塊兒來。"},{"english":"I have lunch at a restaurant with my colleagues.","chinese":"我跟同事一塊兒在一家餐館喫午飯。"},{"english":"Come, Fernand, won't you return to Marseilles with us?","chinese":"走，弗爾南多，你不和我們一塊兒回馬賽嗎？"},{"english":"Families would go to church and return home to eat together around the table.","chinese":"全家人會去教堂，然後回家圍聚在餐桌旁一塊兒進餐。"},{"english":"This is to learn Chinese together.","chinese":"就是跟大家一塊兒學漢語。"},{"english":"The cars telescoped after the train crashed.","chinese":"火車相撞後，車廂疊擠到一塊兒了。"},{"english":"It's O. K. I can come with my friend.","chinese":"沒問題，我可以和我的朋友一塊兒來。"},{"english":"Don’t let your spiritual beliefs interfere with your work.","chinese":"別讓精神信仰跟工作混到一塊兒。"},{"english":"I have a cake, then I eat it.","chinese":"我有一塊兒蛋糕，然後把它喫掉。"},{"english":"I'd like to go with you; however, my hands are full.","chinese":"我很想和你一塊兒去，可是我忙不過來。"},{"english":"But, luckily, he came back again in ten minutes' time, and then we all set out.","chinese":"幸虧他不到十分鐘就回來了，於是我們一塊兒動身。"}],"related":[]}