{"definition":["one and a half"],"pinyin":["yi1 ge5 ban4"],"simplified":["一个半"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"一個半","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["individual\/this\/that\/size\/classifier for people or objects in general"],"pinyin":["ge4"],"word":"個"},{"definition":["half\/semi-\/incomplete\/(after a number) and a half"],"pinyin":["ban4"],"word":"半"}],"containing_words":[],"sentences":[{"english":"Luckily, it's very straight-forward and takes less than half an hour.","chinese":"幸運的是，這是非常直接的，並考慮不到一個半小時。"},{"english":"The High Line is almost two–and-one-half-kilometers long.","chinese":"高線是近兩年一個半公里長。"},{"english":"He trained for one-and-a-half hours with the reserves in a very competitive situation.","chinese":"他在預備隊進行了一個半小時高對抗的訓練。"},{"english":"Toshio leaned down to look at photos in a plastic album half-buried in the mud before realizing they were of another family.","chinese":"彎下腰看一個半埋在泥裏的塑料照相框。"},{"english":"Mr Lee spends about one-and-a-half hours a day updating his own microblog.","chinese":"李先生每天用一個半小時左右的時間來更新他的微博。"},{"english":"Transfer one hemisphere,the patient wakes up.","chinese":"移植一個半腦的時候，病人也會醒來。"},{"english":"you would probably spend at least an hour or an hour and a half on each floor.","chinese":"每層樓你大概要看一個或者一個半小時。"},{"english":"Then they removed the cancer. The operation took only a half hour.","chinese":"這次手術只用時一個半小時。"},{"english":"We show that all fuzzy congruence relations on a semigroup is a lattice.","chinese":"證明了一個半羣上所有模糊同餘關係作成一個格。"},{"english":"It took Mabel nearly one and a half hours to choose a suit of proper clothes .","chinese":"梅布爾花了一個半小時的時間選了一套合適的衣服。"},{"english":"My dad was an athlete who played semi-pro soccer.","chinese":"我的父親是一個半職業的足球運動員。"},{"english":"He is a semi-invalid now and can't get about as wall as he used to.","chinese":"他現在是一個半殘廢的人，不能象過去那樣走動。"},{"english":"And there's the ropery in a building that's a half-kilometer long.","chinese":"同時還有一個建築，是一個半公里長的羅佩裏。"},{"english":"In the last 1.5 months, Trojan dropped four thousand or five thousand Yuan per ton.","chinese":"最近一個半月內，累計每噸下跌了四五千元。"},{"english":"After having to wait nearly an hour and a half, she was foaming.","chinese":"等了將近一個半小時之後，她氣得七竅生煙。"},{"english":"Under the table was lying a half-conscious young man.","chinese":"在桌子下面躺着一個半昏迷的年輕人。"}],"related":[]}