{"definition":["motionless"],"pinyin":["yi1 dong4 bu4 dong4"],"simplified":["一动不动"],"rank":17382.0,"normalized_rank":0.2431967316329243,"fraction":0.0000031452339483671904,"cumulative_fraction":0.9676461120353926,"word":"一動不動","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"}],"containing_words":[],"sentences":[{"english":"He had become very still. Saliva was at the corners of his mouth.","chinese":"爸爸已經一動不動了，嘴角上還淌着口水。"},{"english":"The fish was silvery and still and floated with the waves.","chinese":"那魚是銀色的，一動不動地隨着波浪浮動着。"},{"english":"He was rooted to the spot by surprise.","chinese":"他驚訝得一動不動地站在原地。"},{"english":"Not a breath of fresh air stirred the long white curtains.","chinese":"連一絲風也沒有，白色的長窗簾一動不動。"},{"english":"It then lies still, waiting for prey to pass by.","chinese":"變色完成後，它就一動不動，等獵物經過。"},{"english":"Jane stood froze from head to toe and watched the car accelerate down the street.","chinese":"簡一動不動地站在那兒，看着那輛車沿街急馳而去。"},{"english":"The fish was silvery and till and floated with the waves.","chinese":"那魚是銀色的，一動不動地隨着波浪浮動着。"},{"english":"And she continued to look at him fixedly all the time.","chinese":"她仍然一動不動地望着他。"},{"english":"They may just sit in front of the computer and ask for this and that without moving.","chinese":"他們可能只是坐在電腦前，一動不動地要這要那。"},{"english":"Barkis lay silently there, not moving.","chinese":"巴克斯靜靜地躺着，一動不動。"},{"english":"He sat on the bench without movement.","chinese":"他坐在長凳上，一動不動。"},{"english":"Fache never flinched, his eyes riveted on the second agent.","chinese":"法希毫不畏縮，他的眼睛一動不動地注視着那名特工。"},{"english":"He made no move to get up or take his eyes off the page.","chinese":"他依然一動不動的坐在那兒，盯着網頁看。"},{"english":"But he himself got to sleep in the footsteps, stilly .","chinese":"他自己則在“唰唰唰”的腳步中睡着了，一動不動。"},{"english":"It is suppose to be working now but it remains like a log.","chinese":"它應該可以打印的，但是現在它像木頭一樣一動不動。"},{"english":"When I punted him in the head, he went limp and his hands fell to the concrete.","chinese":"我踢了踢他的頭，他一動不動，雙手落在水泥地上。"}],"related":[]}