{"definition":["(of a group of people) to rush into action"],"pinyin":["yi1 hong1 er2 qi3"],"simplified":["一哄而起"],"rank":45414.0,"normalized_rank":0.6354007807143957,"fraction":2.291848741732335e-7,"cumulative_fraction":0.9981164442575848,"word":"一哄而起","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["roar of laughter (onom.)\/hubbub\/to roar (as a crowd)","to deceive\/to coax\/to amuse (a child)"],"pinyin":["hong1","hong3"],"word":"哄"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"During the Great Leap Forward in 1958, people rushed headlong into mass action to establish people's communes.","chinese":"一九五八年“大躍進”，一哄而起搞人民公社化。"}],"related":[{"definition":["like a swarm of bees\/everyone swarms around pushing and shouting\/a hornet's nest"],"pinyin":["yi1 wo1 feng1"],"word":"一窩蜂"},{"definition":["Great Leap Forward (1958-1960), Mao's attempt to modernize China's economy, which resulted in economic devastation, and millions of deaths from famine caused by misguided policies"],"pinyin":["Da4 yue4 jin4"],"word":"大躍進"},{"definition":["solve one problem only to find another cropping up"],"pinyin":["an4 xia4 hu2 lu2 fu2 qi3 piao2"],"word":"按下葫蘆浮起瓢"},{"definition":["careless\/any-old-how, regardless of the specific task"],"pinyin":["mei2 mao5 hu2 zi5 yi1 ba3 zhua1"],"word":"眉毛鬍子一把抓"},{"definition":["each one does what he thinks is right (idiom)\/each goes his own way"],"pinyin":["ge4 xing2 qi2 shi4"],"word":"各行其是"},{"definition":["when radishes are selling fast, one doesn't take the time to wash the soil off them (idiom)\/fig. when business is booming, merchants tend to offer goods of inferior quality"],"pinyin":["luo2 bo5 kuai4 le5 bu4 xi3 ni2"],"word":"蘿蔔快了不洗泥"},{"definition":["to respond instantly\/to act at once on hearing the news"],"pinyin":["wen2 feng1 er2 dong4"],"word":"聞風而動"},{"definition":["to launch a satellite\/(fig.) (neologism during the Great Leap Forward, c. 1958) to achieve prominent success\/(later used sarcastically) to make exaggerated claims\/to talk big"],"pinyin":["fang4 wei4 xing1"],"word":"放衛星"},{"definition":["lit. straggling and disbanded soldiers (idiom); fig. disorganized uncoordinated action"],"pinyin":["san3 bing1 you2 yong3"],"word":"散兵遊勇"},{"definition":["to act as one thinks fit\/to have one's own way"],"pinyin":["zi4 xing2 qi2 shi4"],"word":"自行其是"},{"definition":["lit. to cut all at one stroke (idiom); to impose uniformity\/one solution fits a diversity of problems\/one size fits all"],"pinyin":["yi1 dao1 qie1"],"word":"一刀切"},{"definition":["(idiom) to freely air one's views\/to be heard far and wide\/to attract a lot of attention"],"pinyin":["da4 ming2 da4 fang4"],"word":"大鳴大放"},{"definition":["to do things each in one's own way"],"pinyin":["ge4 zi4 wei2 zheng4"],"word":"各自為政"},{"definition":["harmful trend"],"pinyin":["bu4 liang2 qing1 xiang4"],"word":"不良傾向"},{"definition":["to make frequent or unpredictable changes in policy (idiom)"],"pinyin":["zhao1 ling4 xi1 gai3"],"word":"朝令夕改"},{"definition":["the wolf runs and the wild boar rushes (idiom); crowds of evil-doers mill around like wild beasts"],"pinyin":["lang2 ben1 shi3 tu1"],"word":"狼奔豕突"}]}