{"definition":["(acknowledged) place\/a role to play\/niche"],"pinyin":["yi1 xi2 zhi1 di4"],"simplified":["一席之地"],"rank":13907.0,"normalized_rank":0.19457697312271768,"fraction":0.000004719164721192543,"cumulative_fraction":0.9542026018896574,"word":"一席之地","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["surname Xi","woven mat\/seat\/banquet\/place in a democratic assembly\/classifier for banquets, conversations etc"],"pinyin":["Xi2","xi2"],"word":"席"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct","earth\/ground\/field\/place\/land\/CL:片[pian4]"],"pinyin":["de5","di4"],"word":"地"}],"containing_words":[],"sentences":[{"english":"Still, low-cost airlines have established a special place in Asia's travel industry.","chinese":"如此，廉價航空在亞洲的旅遊市場了的一席之地。"},{"english":"\"Gong Xi Poetry, \" which is also a place.","chinese":"《鞏溪詩話》在其中也佔有一席之地。"},{"english":"To choose the catchword of 2008, Simulated Culture must be included.","chinese":"評選2008年流行語，“山寨”當有一席之地。"},{"english":"Self-help books have carved quite a niche out of it.","chinese":"自我剖析的書籍佔有一席之地。"},{"english":"Tools have their place, but there's no substitute for skill and experience.","chinese":"工具有自己的一席之地，但不能替代技能和經驗。"},{"english":"Congratulations. You have just qualified for a place on the play group committee.","chinese":"恭喜你，現在你有資格在遊戲同盟中擁有一席之地了。"},{"english":"Might war games deserve a greater role in business?","chinese":"實戰演習是否能夠在商業中佔有一席之地呢？"},{"english":"He's keeping his place in the team because he deserves to keep his place in the team.","chinese":"我將會在球隊中保有一席之地，因爲他值得。"},{"english":"The Bianconeri can also help me to win back my place in the Selecao.","chinese":"尤文圖斯可以幫我在巴西國家隊贏得一席之地。"},{"english":"Overseas Chinese scholars should possess a position in Chinese modern academic history.","chinese":"海外華裔學人在中國現代學術史上應占有一席之地。"},{"english":"By her hard work she won a place for herself.","chinese":"她靠工作努力贏得一席之地。"},{"english":"And nationally, blending learning has already caught on in some areas.","chinese":"而在全國範圍內，混合教學法早就佔據了一席之地。"},{"english":"In the Scottish army the kilts are used as part of the ceremonial uniform.","chinese":"在蘇格蘭軍隊的儀式制服中，方格裙也佔有一席之地。"},{"english":"In 1999, Michael earned a spot on the U. S. National B Team.","chinese":"1999年，邁克爾在美國國家二隊佔得了一席之地。"},{"english":"Deeply did I feel privileged in having a place in your heart.","chinese":"我能在你心中佔有一席之地使我感到深爲榮幸。"},{"english":"So there is a niche for science in the UN system.","chinese":"因此科學在這個聯合國系統裏有一席之地。"}],"related":[{"definition":["to have\/to own\/to hold\/to occupy\/to possess\/to account for (a high proportion etc)"],"pinyin":["zhan4 you3"],"word":"佔有"},{"definition":["position\/status\/place\/CL:個|个[ge4]"],"pinyin":["di4 wei4"],"word":"地位"},{"definition":["to stand firmly\/to gain a foothold\/to establish oneself"],"pinyin":["zhan4 wen3 jiao3 gen1"],"word":"站穩腳跟"},{"definition":["to play a critical role (idiom)\/influential"],"pinyin":["ju3 zu2 qing1 zhong4"],"word":"舉足輕重"},{"definition":["most outstanding\/par excellence"],"pinyin":["du2 ling3 feng1 sao1"],"word":"獨領風騷"},{"definition":["half of the country (esp. when half the country has fallen into enemy hands)\/vast swathe of territory"],"pinyin":["ban4 bi4 jiang1 shan1"],"word":"半壁江山"},{"definition":["to occupy\/to hold"],"pinyin":["zhan4 ju4"],"word":"佔據"},{"definition":["well-known figure\/excellent (person, company etc)"],"pinyin":["jiao3 jiao3 zhe3"],"word":"佼佼者"},{"definition":["to come first in triennial palace examinations (idiom, refers to the carved stone turtle head in front of the imperial palace, next to which the most successful candidate in the imperial examinations was entitled to stand)\/to be the champion\/to be the very best in any field"],"pinyin":["du2 zhan4 ao2 tou2"],"word":"獨佔鰲頭"},{"definition":["to reveal one's talent (idiom)\/to rise above others\/to distinguish oneself"],"pinyin":["tuo1 ying3 er2 chu1"],"word":"脫穎而出"},{"definition":["lit. a cup of soup\/fig. to get part of the profits\/one's share of the action"],"pinyin":["yi1 bei1 geng1"],"word":"一杯羹"},{"definition":["to reveal outstanding talent (idiom); to stand out as conspicuously brilliant"],"pinyin":["zhan3 lu4 tou2 jiao3"],"word":"嶄露頭角"},{"definition":["lit. to fly one's banner on a solitary tree (idiom); fig. to act as a loner\/to stand out\/to develop one's own school\/to have attitude of one's own"],"pinyin":["du2 shu4 yi1 zhi4"],"word":"獨樹一幟"},{"definition":["an up-and-coming youngster\/new talent\/a brilliant younger generation"],"pinyin":["hou4 qi3 zhi1 xiu4"],"word":"後起之秀"},{"definition":["lit. late-comer lives above (idiom); the up-and-coming youngster outstrips the older generation\/the pupil surpasses the master"],"pinyin":["hou4 lai2 ju1 shang4"],"word":"後來居上"},{"definition":["key moment\/decisive opportunity"],"pinyin":["xian1 ji1"],"word":"先機"}]}