{"definition":["in a fit of pique\/in a fury"],"pinyin":["yi1 qi4 zhi1 xia4"],"simplified":["一气之下"],"rank":18655.0,"normalized_rank":0.2610076532396849,"fraction":0.000002744963295511773,"cumulative_fraction":0.9713841147055601,"word":"一氣之下","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[{"english":"Black ant cant stand stimulation in a pet like the giant killer.","chinese":"黑蟻受不了激，一氣之下就想對擎天下殺手。"},{"english":"In his flay, he screwed up her letter and threw it into the wastepaper basket.","chinese":"他一氣之下，把她寫來的信揉成一團，扔進了。"},{"english":"So, I got the refrigerator and pushed it over the balcony and it crushed him.","chinese":"一氣之下，我搬出冰箱，推下陽臺，砸到了他身上。"},{"english":"Finally the captain still did not agree. He was so angry that he went to find the bureau director.","chinese":"最後大隊長還是不同意，他一氣之下又去找。"},{"english":"Cao, infuriated, ordered him to the battle front, hoping the enemy's sword would kill him.","chinese":"曹操一氣之下，命他立即出征，借敵人的刀殺了禰衡。"},{"english":"Cao， infuriated， ordered him to the battle front， hoping the enemy's sword would kill him.","chinese":"曹操一氣之下，命他立即出征，借敵人的刀殺了禰衡。"},{"english":"Yifan throws a necklace that was given to her by Yiguan into a lake.","chinese":"一帆一氣之下將一官送給她的項鍊丟進小溪裏。"},{"english":"He clawed a hole in my shirt in his temper.","chinese":"他一氣之下把我的襯衫撕了一個口子。"},{"english":"Tian Juhua think iron tiger abandon her, in a pet tiger boom to the iron door.","chinese":"田菊華以爲鐵虎嫌棄她，一氣之下把鐵虎轟出門去。"},{"english":"Nixon gave his angry “last press conference.”","chinese":"尼克松一氣之下召開了他的“最後一次新聞發佈會”。"},{"english":"In his anger he hit the man and a fight ensued.","chinese":"一氣之下，他打了那個人，接着是一場搏鬥。"},{"english":"Wife angrily, ready to pull the dog to go out.","chinese":"妻子一氣之下，準備牽狗出門了。"}],"related":[]}