{"definition":["at one go\/at a stretch\/for a period of time\/forming a gang"],"pinyin":["yi1 qi4"],"simplified":["一气"],"rank":25796.0,"normalized_rank":0.3609195080659829,"fraction":0.0000013768609765617442,"cumulative_fraction":0.9854273644427174,"word":"一氣","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"}],"containing_words":[{"definition":["in a fit of pique\/in a fury"],"pinyin":["yi1 qi4 zhi1 xia4"],"word":"一氣之下"},{"definition":["to do something at one go\/to flow smoothly"],"pinyin":["yi1 qi4 he1 cheng2"],"word":"一氣呵成"},{"definition":["to act in collusion (idiom); in cahoots with\/villains will look after one another"],"pinyin":["hang4 xie4 yi1 qi4"],"word":"沆瀣一氣"},{"definition":["to act in collusion (idiom)"],"pinyin":["chuan4 tong1 yi1 qi4"],"word":"串通一氣"}],"sentences":[{"english":"Like an animal at bay, the bandit chieftain laid about in desperation.","chinese":"土匪頭子困獸猶鬥，在絕望中向四面八方亂打一氣。"},{"english":"Black ant cant stand stimulation in a pet like the giant killer.","chinese":"黑蟻受不了激，一氣之下就想對擎天下殺手。"},{"english":"In his flay, he screwed up her letter and threw it into the wastepaper basket.","chinese":"他一氣之下，把她寫來的信揉成一團，扔進了。"},{"english":"So, I got the refrigerator and pushed it over the balcony and it crushed him.","chinese":"一氣之下，我搬出冰箱，推下陽臺，砸到了他身上。"},{"english":"The boy doesn't like music at all, so he often strummed on the piano.","chinese":"那男孩根本不愛好音樂，所以他常在鋼琴上亂彈一氣。"},{"english":"Finally the captain still did not agree. He was so angry that he went to find the bureau director.","chinese":"最後大隊長還是不同意，他一氣之下又去找。"},{"english":"Cao, infuriated, ordered him to the battle front, hoping the enemy's sword would kill him.","chinese":"曹操一氣之下，命他立即出征，借敵人的刀殺了禰衡。"},{"english":"Those people collaborated in evildoing.","chinese":"那些人沆瀣一氣做壞事。"},{"english":"FAW's HQD Concept is a scary-looking Chinese-style Rolls-Royce Phantom!","chinese":"一氣紅旗盛事是一款嚇人的中國版勞斯萊斯幻影。"},{"english":"Cao， infuriated， ordered him to the battle front， hoping the enemy's sword would kill him.","chinese":"曹操一氣之下，命他立即出征，借敵人的刀殺了禰衡。"},{"english":"\"This lousy pen\", whisper, again in the old newspaper top in disorder uniform spirit.","chinese":"“這破筆”，嘀咕着，又在舊報紙上亂劃一氣。"},{"english":"Several companies gang up to raise prices.","chinese":"幾家公司串通一氣擡高物價。"},{"english":"After him vomiting and being blinded for a few hours, he was fine!","chinese":"他大吐一氣，眼睛瞎了幾個小時之後，跟沒事人一樣。"},{"english":"Yifan throws a necklace that was given to her by Yiguan into a lake.","chinese":"一帆一氣之下將一官送給她的項鍊丟進小溪裏。"},{"english":"People always conspire to keep the truth from me.","chinese":"人們總是串通一氣不把真情告訴我。"},{"english":"Like an animal at bay, the bandit chieftain laid about him in desperation.","chinese":"土匪頭子困獸猶鬥，在絕望中向四面八方亂打一氣。"}],"related":[{"definition":["yin and yang"],"pinyin":["yin1 yang2"],"word":"陰陽"},{"definition":["what is true and what is false\/(to get to know) the real situation"],"pinyin":["xu1 shi2"],"word":"虛實"},{"definition":["muddy\/to mix"],"pinyin":["hun2"],"word":"渾"},{"definition":["to turn upside down\/to reverse\/back to front\/confused\/deranged\/crazy"],"pinyin":["dian1 dao3"],"word":"顛倒"},{"definition":["(detectable) movement\/(sign of) activity\/movement and stillness"],"pinyin":["dong4 jing4"],"word":"動靜"},{"definition":["all living things"],"pinyin":["wan4 wu4"],"word":"萬物"},{"definition":["to bid farewell\/tricks of the trade\/pithy mnemonic formula (e.g. Mao Zedong's 16-character mantra 十六字訣|十六字诀 on guerrilla warfare)"],"pinyin":["jue2"],"word":"訣"},{"definition":["to work\/to operate\/to revolve\/to turn around"],"pinyin":["yun4 zhuan3"],"word":"運轉"},{"definition":["mystery known only to heaven (archaic)\/inscrutable twist of fate\/fig. top secret"],"pinyin":["tian1 ji1"],"word":"天機"},{"definition":["lit. warp and weft in weaving; vertically and horizontal\/length and breadth\/criss-crossed\/able to move unhindered\/abbr. for 合縱連橫|合纵连横[He2 zong4 Lian2 heng2], School of Diplomacy during the Warring States Period (475-221 BC)"],"pinyin":["zong4 heng2"],"word":"縱橫"},{"definition":["to advance or retreat\/knowing when to come and when to leave\/a sense of propriety"],"pinyin":["jin4 tui4"],"word":"進退"},{"definition":["nothingness"],"pinyin":["xu1 wu2"],"word":"虛無"},{"definition":["(name of states and dynasties at several different periods)\/surname Qi","neat\/even\/level with\/identical\/simultaneous\/all together\/to even sth out"],"pinyin":["Qi2","qi2"],"word":"齊"},{"definition":["in confusion or disorder\/in a confused state of mind\/disorder\/upheaval\/riot\/illicit sexual relations\/to throw into disorder\/to mix up\/indiscriminate\/random\/arbitrary"],"pinyin":["luan4"],"word":"亂"},{"definition":["unintentionally\/not in the mood to"],"pinyin":["wu2 xin1"],"word":"無心"},{"definition":["The Yellow Emperor's Internal Canon, medical text c. 300 BC"],"pinyin":["Huang2 di4 Nei4 jing1"],"word":"黃帝內經"}]}