{"definition":["all\/every"],"pinyin":["yi1 ying1"],"simplified":["一应"],"rank":39166.0,"normalized_rank":0.5479831544779148,"fraction":4.15306348422197e-7,"cumulative_fraction":0.9961552640362208,"word":"一應","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"}],"containing_words":[{"definition":["with everything needed available"],"pinyin":["yi1 ying1 ju4 quan2"],"word":"一應俱全"}],"sentences":[{"english":"State-of-the-art fine dining and all-day dining restaurant overlook the skylobby and pool.","chinese":"藝術和美食餐廳一應而全，俯瞰着空中大堂和泳池。"},{"english":"All kinds of testing equipments ensure the ility of duct quality.","chinese":"檢測設備一應俱全，確保穩定的產品質量。"},{"english":"Covers everything from Shakespeare to Steinbeck, \" the site teases.\"","chinese":"從莎士比亞，到斯坦貝克，一應俱全。"},{"english":"Please send us the Receipt of Goods and we shall responsible for all charges involved.","chinese":"一應有關存倉費用，本公司將負全責。"},{"english":"She was dressed in rich materials-satins, and lace, and silks-all of white.","chinese":"她穿的都是貴重料子，綢緞花邊一應俱全，全身雪白。"},{"english":"There are dozens of workers, 2 production kilns, over 20 rolling cars, hollow grouting and pipe etc. equipment.","chinese":"滾壓車20多部，空心注漿及管道設備一應俱全。"},{"english":"anything, all the comforts of home.","chinese":"什麼都有，所有家居的舒適設施一應俱全。"},{"english":"At the roll call, the students answered up to their names.","chinese":"點名時學生們聽到自己的名字都一一應到。"},{"english":"Covers everything from Shakespeare to Steinbeck, ” the site teases.","chinese":"從莎士比亞，到斯坦貝克，一應俱全。"},{"english":"Our restaurant serves a feast of delicacies.","chinese":"本飯店山珍海味，一應俱全。"},{"english":"That quack doctor for the clap used to be stuck up in all the greenhouses.","chinese":"每一應公用廁所都有治淋病的庸醫的招貼。"},{"english":"Covers everything from Shakespeare to Steinbeck,” the site teases.","chinese":"從莎士比亞，到斯坦貝克，一應俱全。"},{"english":"All varieties of goods for daily use are available.","chinese":"日用百貨一應俱全。"},{"english":"The sorting box and bag.","chinese":"整理箱以及編織袋一應俱全。"},{"english":"Factory original, black, chrome, everything is gray.","chinese":"工廠原來，鉻，黑，灰一應俱全。"},{"english":"We appointed the house with all the latest devices.","chinese":"我們爲房子提供一應俱全的最新設備。"}],"related":[]}