{"definition":["not one good point\/everything about it is wrong"],"pinyin":["yi1 wu2 shi4 chu4"],"simplified":["一无是处"],"rank":29649.0,"normalized_rank":0.41482797699830704,"fraction":9.68707531855782e-7,"cumulative_fraction":0.9899062320348472,"word":"一無是處","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["is\/are\/am\/yes\/to be"],"pinyin":["shi4"],"word":"是"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"If nothing else though, it gave us the honey scene.","chinese":"儘管其他一無是處，但它給我們帶來了甜蜜的場景。"},{"english":"The Knesset has been debased by the executive's greater clout.","chinese":"而國會也在執政官的更大的影響下被貶的一無是處。"},{"english":"You can't be a basketcase, a girl who causes a scene or a girl who drinks too much.","chinese":"你不能一無是處，只知道大吵大鬧或喝得爛醉。"},{"english":"The young men had nothing better to do than fracas in the streets.","chinese":"這個年輕人除了在街上吵鬧，一無是處。"},{"english":"The film was rubbished by the critics.","chinese":"影評家把這部影片貶得一無是處。"},{"english":"They thought I was an otaku and good for nothing.","chinese":"例句他們覺得我就是個御宅男，一無是處。"},{"english":"I find it close to useless for everyone except HR.","chinese":"我發現它對於大家來說都近乎一無是處，除了人力部。"},{"english":"He rubbished most of the novels written by contemporary writers.","chinese":"他把大多數當代作家寫的小說貶得一無是處。"},{"english":"The new editor picked her manuscript to pieces.","chinese":"新編輯把她的原稿批得一無是處。"},{"english":"These new smartphone platforms are nothing without a capable AppStore.","chinese":"這些智能手機平臺如果沒有應用程序存儲則一無是處。"},{"english":"We (USA) are now in a position of impotency, only complaining and nibbling around the edges withfeble sanctions.","chinese":"我們美國現在一無是處，只會抱怨和實施一些小制裁。"},{"english":"Her father was dead set against her marrying that no-good Fitch.","chinese":"她父親堅決反對她嫁給那個一無是處的菲奇。"},{"english":"I consider that their claims are worthless.","chinese":"我認爲，他們的調查一無是處。"},{"english":"It was about time that Jessica got rid of that no-good boyfriend!","chinese":"也該是潔西卡甩掉一無是處的男友的時候了。"},{"english":"Early winter on the merit it?","chinese":"初冬就一無是處了嗎？"},{"english":"Her boyfriend is a good - for - nothing layabout.","chinese":"她的男友是一個一無是處的懶漢。"}],"related":[{"definition":["to think highly of oneself (idiom); giving oneself airs\/arrogant and self-important"],"pinyin":["zi4 shi4 shen4 gao1"],"word":"自視甚高"},{"definition":["self-taught\/to learn without a teacher (idiom)"],"pinyin":["wu2 shi1 zi4 tong1"],"word":"無師自通"},{"definition":["to play deaf-mute"],"pinyin":["zhuang1 long2 zuo4 ya3"],"word":"裝聾作啞"},{"definition":["to speak without thinking (idiom)\/to blurt sth out"],"pinyin":["xin4 kou3 kai1 he2"],"word":"信口開河"},{"definition":["lit. one body two sides (idiom)\/fig. a situation with two sides to it"],"pinyin":["yi1 ti3 liang3 mian4"],"word":"一體兩面"},{"definition":["to rack one's brains for schemes (idiom)\/to beat one's brains out"],"pinyin":["fei4 jin4 xin1 ji1"],"word":"費盡心機"},{"definition":["to disdain as beneath contempt (idiom)"],"pinyin":["bu4 xie4 yi1 gu4"],"word":"不屑一顧"},{"definition":["to force someone to do something"],"pinyin":["qiang3 ren2 suo3 nan2"],"word":"強人所難"},{"definition":["hard power (i.e. military and economic power)"],"pinyin":["ying4 shi2 li4"],"word":"硬實力"},{"definition":["dumbstruck and unable to reply (idiom); left speechless\/at a loss for words"],"pinyin":["ya3 kou3 wu2 yan2"],"word":"啞口無言"},{"definition":["lit. chasing the wind and clutching at shadows (idiom); fig. groundless accusations\/to act on hearsay evidence"],"pinyin":["bu3 feng1 zhuo1 ying3"],"word":"捕風捉影"},{"definition":["to obstinately persist in going about things the wrong way (idiom)"],"pinyin":["zhi2 mi2 bu4 wu4"],"word":"執迷不悟"},{"definition":["to love ease and comfort and hate work (idiom)"],"pinyin":["hao4 yi4 wu4 lao2"],"word":"好逸惡勞"},{"definition":["to be chivalrous"],"pinyin":["xing2 xia2 zhang4 yi4"],"word":"行俠仗義"},{"definition":["to be unable to withstand a single blow\/to collapse at the first blow"],"pinyin":["bu4 kan1 yi1 ji1"],"word":"不堪一擊"},{"definition":["to contend on strong grounds\/to argue strongly for what is right"],"pinyin":["ju4 li3 li4 zheng1"],"word":"據理力爭"}]}