{"definition":["like a swarm of bees\/everyone swarms around pushing and shouting\/a hornet's nest"],"pinyin":["yi1 wo1 feng1"],"simplified":["一窝蜂"],"rank":26267.0,"normalized_rank":0.36750940914751024,"fraction":0.0000013202216573393144,"cumulative_fraction":0.9860627739592132,"word":"一窩蜂","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["nest\/pit or hollow on the human body\/lair\/den\/place\/to harbor or shelter\/to hold in check\/to bend\/classifier for litters and broods"],"pinyin":["wo1"],"word":"窩"},{"definition":["bee\/wasp"],"pinyin":["feng1"],"word":"蜂"}],"containing_words":[],"sentences":[{"english":"Farmers didn't have to scrambled to plant common vegetables this year.","chinese":"今年農民不再一窩蜂似的種大路菜了。"},{"english":"Uber-rich Mainland Chinese business owners have been flocking to Hong Kong, and it's not just because it's the world's business and trade center.","chinese":"中國內地的鉅富們正在一窩蜂地擁向香港。"},{"english":"People rushed into the bus when it came.","chinese":"公共汽車到站時，人們都一窩蜂地往上擠。"},{"english":"When public figures die we mourn them en-masse.","chinese":"每當有公衆人物去世，我們總是一窩蜂地進行哀悼。"},{"english":"They attacked the circus like a hive of bees and arrested all involved.","chinese":"於是一窩蜂似地突襲了馬戲團，逮捕了所有涉案人員。"},{"english":"The ferrets rush wildly for the fireplace.","chinese":"小鼬子一窩蜂似地跑向壁爐。"}],"related":[{"definition":["striving to be first and fearing to be last (idiom); outdoing one another"],"pinyin":["zheng1 xian1 kong3 hou4"],"word":"爭先恐後"},{"definition":["gongs and drums overture to a Chinese opera\/to create a disturbance"],"pinyin":["nao4 chang3"],"word":"鬧場"},{"definition":["one falls, the next follows (idiom); stepping into the breach to replace fallen comrades\/advancing wave upon wave"],"pinyin":["qian2 pu1 hou4 ji4"],"word":"前仆後繼"},{"definition":["to oppose each other with equal harshness (idiom); tit for tat\/measure for measure"],"pinyin":["zhen1 feng1 xiang1 dui4"],"word":"針鋒相對"},{"definition":["desolate and uninhabited (idiom)"],"pinyin":["huang1 wu2 ren2 yan1"],"word":"荒無人煙"},{"definition":["to fawn on\/to curry favor with\/to make up to"],"pinyin":["ba1 jie5"],"word":"巴結"},{"definition":["to incite trouble\/to stir up havoc"],"pinyin":["xing1 feng1 zuo4 lang4"],"word":"興風作浪"},{"definition":["resolute\/definitive\/categorically\/absolutely"],"pinyin":["duan4 ran2"],"word":"斷然"},{"definition":["to remain unmoved"],"pinyin":["bu4 wei2 suo3 dong4"],"word":"不為所動"},{"definition":["to show off one's military strength (idiom); to strut around\/to bluff\/to bluster"],"pinyin":["yao4 wu3 yang2 wei1"],"word":"耀武揚威"},{"definition":["to rack one's brains (idiom); to take great pains to think sth through"],"pinyin":["fei4 jin4 xin1 si5"],"word":"費盡心思"},{"definition":["lit. to see a gap and stick in a needle (idiom); fig. to make use of every second and every inch"],"pinyin":["jian4 feng4 cha1 zhen1"],"word":"見縫插針"},{"definition":["to strut\/swaggering"],"pinyin":["da4 yao2 da4 bai3"],"word":"大搖大擺"},{"definition":["to fight back\/to return fire\/to counterattack"],"pinyin":["hui2 ji1"],"word":"回擊"},{"definition":["to throw one's life in for\/to haplessly give one's life for\/to sacrifice oneself torturously working for another or for a group\/to pour in one's utmost effort\/to shed one's last ounce of strength for"],"pinyin":["mai4 ming4"],"word":"賣命"},{"definition":["to harbor evil designs\/to harbor malicious intentions"],"pinyin":["bu4 huai2 hao3 yi4"],"word":"不懷好意"}]}