{"definition":["an expression of opinion\/according to some"],"pinyin":["yi1 shuo1"],"simplified":["一说"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"一說","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"}],"containing_words":[],"sentences":[{"english":"He said so, just let a person remember, originally he is really a soldier.","chinese":"他這樣一說，才讓人想起，原來他真的是一個軍人。"},{"english":"This department staff denied flatly the instant noodles card to have exchange a prize saying.","chinese":"該部門工作人員一口否認了方便麪卡片有兌獎一說。"},{"english":"So there is no separation.","chinese":"所以沒有割裂一說。"},{"english":"Let me say something about public finance here.","chinese":"來說一說公共財政學。"},{"english":"Listen to ZhaoRongSheng said, tiger also for his induction capable grief.","chinese":"聽趙榮生一說，虎一帆也爲他感應悲痛。"},{"english":"Greek logician, possibly author ofthe liar paradox.","chinese":"希臘邏輯學家，一說是檄譴者悖論的作者。"},{"english":"At this revelation, I started sobbing hysterically, my face turning bright red.","chinese":"聽他這麼一說，我立馬泣不成聲，臉也漲得通紅。"},{"english":"Another show says Shala is the husband of Mieyan.","chinese":"一說沙拉是梅煙的丈夫。"},{"english":"Star one says death occurs when personality stops functioning.","chinese":"星號一說，死亡在人格功能停止時發生。"},{"english":"As soon as the employer ask for money, you can go without hovering.","chinese":"只要用人單位一說要你交錢，你掉頭就走便是了。"},{"english":"So on saying, the chapter pure station also feels some facts.","chinese":"這樣一說，章清亭也覺得有些道理。"},{"english":"Dial get online to say, begin since thenceforth faddish.","chinese":"撥號上網一說，從那時起開始風行。"},{"english":"Yes. He agreed at once.","chinese":"租下來了，一說他就同意了。"},{"english":"After listening to what he said, everyone became overcautious .","chinese":"經他這麼一說，大家都變得謹小慎微了。"},{"english":"There is no such thing as failure just Feedforward.","chinese":"在前饋中，沒有“失敗”一說。"},{"english":"Did I mention that Gretchen is also in the slammer?","chinese":"順帶一說格雷琴也蹲在班房裏哦。"}],"related":[]}