{"definition":["first round or stage (of a match, election, talks, planned policy etc)"],"pinyin":["yi1 lun2"],"simplified":["一轮"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"一輪","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["wheel\/disk\/ring\/steamship\/to take turns\/to rotate\/by turn\/classifier for big round objects: disk, or recurring events: round, turn"],"pinyin":["lun2"],"word":"輪"}],"containing_words":[{"definition":["first round (of match, or election)"],"pinyin":["di4 yi1 lun2"],"word":"第一輪"}],"sentences":[{"english":"A full moon hung in the sky on Mid-autumn Day.","chinese":"中秋那天，一輪圓月掛在天空。"},{"english":"The launch of the iPad in 2010 triggered a new round of innovation in the startup community.","chinese":"2010年iPad的問市推動了新一輪的創新浪潮。"},{"english":"The fear is that the next election, due next year, will follow the same course.","chinese":"恐怕明年的下一輪選舉也難逃相同的厄運。"},{"english":"In a matrix, or \"round robin\" competition, a round allows all contestants in a pool to fight once.","chinese":"在循環賽中，每一輪允許所有選手均比賽一次。"},{"english":"The Moon whispers in your heart like an old soul everywhere.","chinese":"那一輪清月，卻似神祕的心靈低語，如影隨形。"},{"english":"We are anxious that the same mistake is not repeated in the current round of negotiations.","chinese":"我們殷切希望在新一輪談判中不要重犯同樣的錯誤。"},{"english":"The target paladin loses his Divine Grace bonuses for one round.","chinese":"目標聖武士將在這一輪內失去他的神恩獎勵。"},{"english":"The latest round of storms also battered Zhengzhou, capital of Henan Province.","chinese":"最新一輪的暴風雨還襲擊了河南省會鄭州。"},{"english":"The sky a bright moon, video card two Bingxin.","chinese":"天上一輪明月，映證兩顆冰心。"},{"english":"Love, is the youth frenzy years round of apricot yellow months, fine but hazy.","chinese":"愛情，是青春迷亂歲月裏的一輪杏黃月，美好而朦朧。"},{"english":"According to party rules, they could have fought a further round.","chinese":"儘管根據黨章他們可以進行更深一輪的競爭。"},{"english":"Explanation: On February 2nd, a first quarter Moon shone in planet Earth's early evening sky.","chinese":"2月2日，一輪上弦月閃爍在地球夜晚的天空中。"},{"english":"The sun goes down and a cold moon comes creeping up the sky.","chinese":"太陽落山了，天空升起了一輪冷月。"},{"english":"This is their first institutional round.","chinese":"這是他們的第一輪籌資。"},{"english":"But the latest boom has proved a curse as well as a blessing.","chinese":"然而，最新一輪的經濟繁榮將會是福禍並存。"},{"english":"The Duha Round is a new round of WTO multi-trade negotiation rounds.","chinese":"多哈回合是WTO的新一輪多邊貿易談判回合。"}],"related":[]}