{"definition":["to flash past\/to flit by"],"pinyin":["yi1 shan3 er2 guo4"],"simplified":["一闪而过"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"一閃而過","characters":[{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["surname Shan","to dodge\/to duck out of the way\/to beat it\/shaken (by a fall)\/to sprain\/to pull a muscle\/lightning\/spark\/a flash\/to flash (across one's mind)\/to leave behind\/(Internet slang) (of a display of affection) \"dazzlingly\" saccharine"],"pinyin":["Shan3","shan3"],"word":"閃"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"}],"containing_words":[],"sentences":[{"english":"When was the last time you flashed a fake smile at the office?","chinese":"你在辦公室的最近一次假笑一閃而過是什麼時候呢？"},{"english":"A small brilliant bird flashed into view.","chinese":"一隻色彩斑瀾的小鳥從眼前一閃而過。"},{"english":"It almost seems like a flash to heaven.","chinese":"這看起來幾乎就像是天堂一閃而過。"},{"english":"Kong Jue, one flashing red star.","chinese":"孔厥，一閃而過的紅色星斗。"},{"english":"Many of those dashed hopes I shared.","chinese":"我體會過許多一閃而過的希望。"},{"english":"Her quick smile guttered away.","chinese":"她臉上的笑容一閃而過。"},{"english":"I glimpsed Amber among the crowd just now.","chinese":"我剛纔在人羣中看到採潔一閃而過。"},{"english":"Their heads and shoulders slid across the view through the windowpanes.","chinese":"他們的頭和肩膀在窗玻璃前一閃而過。"},{"english":"I saw a flash of kingfisher blue. A monitor lizard paddled away through the reeds.","chinese":"我看見一隻翠鳥一閃而過，一頭巨蜥在蘆葦叢中走過。"},{"english":"Sometimes we don't take the time to appreciate the beauty that is quickly passing us by.","chinese":"有時候我們不會花時間去欣賞車窗外一閃而過的美景。"},{"english":"Occasionally, a tiny flicker of light passes quickly by , its source a mystery.","chinese":"偶爾有一個來路不明的微小光點一閃而過。"},{"english":"The cars flashed by; I could not count them.","chinese":"汽車一閃而過，我無法數清數目。"}],"related":[]}