{"definition":["Romance of the Three Kingdoms by Luo Guanzhong 羅貫中|罗贯中[Luo2 Guan4 zhong1], one of the Four Classic Novels of Chinese literature\/a fictional account of the Three Kingdoms at the break-up of the Han around 200 AD, consistently portraying Liu Bei's Shu Han 劉備|刘备, 蜀漢|蜀汉 as virtuous heroes and Cao Cao's Wei 曹操, 魏 as tyrannical villains"],"pinyin":["San1 guo2 Yan3 yi4"],"simplified":["三国演义"],"rank":21018.0,"normalized_rank":0.29406908902662543,"fraction":0.000002152586085706052,"cumulative_fraction":0.9771492894109156,"word":"三國演義","characters":[{"definition":["surname San","three\/3"],"pinyin":["San1","san1"],"word":"三"},{"definition":["country\/nation\/state\/national\/CL:個|个[ge4]","surname Guo"],"pinyin":["Guo2","guo2"],"word":"國"},{"definition":["to develop\/to evolve\/to practice\/to perform\/to play\/to act"],"pinyin":["yan3"],"word":"演"},{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["Yi4","yi4"],"word":"義"}],"containing_words":[],"sentences":[{"english":"\" The romance of the Three Kingdoms \" in figure on each side of its state, long or short.","chinese":"《三國演義》中的人物各具其態，有長有短。"},{"english":"My favorite book is the romance of The Three Kingdoms by luo guanzhong in Ming dynasty.","chinese":"我最喜愛的書是明代羅貫中所著《三國演義》了。"},{"english":"Historical Pinghua has much bearing on the novel Romance of the Three Kingdoms.","chinese":"講史平話與《三國演義》成書的關係十分密切。"},{"english":"Some teachers even ask little children to read Romance of the Three Kingdoms.","chinese":"有的老師甚至叫小孩子去讀《三國演義》。"},{"english":"The game was designed with the novel Romance of the Three Kingdoms in mind.","chinese":"這款遊戲的設計理念源自小說《三國演義》。"},{"english":"The lengthy historical novel\" the Romance of the Three Kingdoms\" inside, displays obviously censures Cao.","chinese":"長篇歷史小說《三國演義》裏面，表現出明顯的貶曹。"},{"english":"Tentative analysis of ambitious scoundrel Caocao figure in Romance of the Three kingdoms.","chinese":"試析三國演義裏曹操的奸雄形象。"},{"english":"That day you were reading the Chinese classics \"Romance of the 3 kingdom\".","chinese":"那一天你在讀中國古典名著三國演義。"}],"related":[{"definition":["Water Margin or Outlaws of the Marsh by Shi Nai'an 施耐庵[Shi1 Nai4 an1], one of the Four Classic Novels of Chinese literature"],"pinyin":["Shui3 hu3 Zhuan4"],"word":"水滸傳"},{"definition":["historical drama"],"pinyin":["li4 shi3 ju4"],"word":"歷史劇"},{"definition":["biography\/CL:篇[pian1],部[bu4]"],"pinyin":["zhuan4 ji4"],"word":"傳記"},{"definition":["historical person"],"pinyin":["li4 shi3 ren2 wu4"],"word":"歷史人物"},{"definition":["subheading\/subtitle"],"pinyin":["fu4 biao1 ti2"],"word":"副標題"},{"definition":["A New Account of the Tales of the World, collection of anecdotes, conversations, remarks etc of historic personalities, compiled and edited by Liu Yiqing 劉義慶|刘义庆[Liu2 Yi4 qing4]"],"pinyin":["Shi4 shuo1 Xin1 yu3"],"word":"世說新語"},{"definition":["edge of the water\/shore or sea, lake or river\/seashore"],"pinyin":["shui3 hu3"],"word":"水滸"},{"definition":["Three Kingdoms period (220-280) in Chinese history\/several Three Kingdoms periods in Korean history, esp. from 1st century AD to unification under Silla 新羅|新罗[Xin1 luo2] in 658"],"pinyin":["San1 guo2"],"word":"三國"},{"definition":["folk art consisting of storytelling to music"],"pinyin":["shuo1 shu1"],"word":"說書"},{"definition":["Journey to the West, Ming dynasty novel by Wu Cheng'en 吳承恩|吴承恩, one of the Four Classic Novels of Chinese literature\/also called Pilgrimage to the West or Monkey"],"pinyin":["Xi1 you2 Ji4"],"word":"西遊記"},{"definition":["Sima Qian (145-86 BC), Han Dynasty historian, author of Records of the Grand Historian 史記|史记[Shi3 ji4], known as the father of Chinese historiography"],"pinyin":["Si1 ma3 Qian1"],"word":"司馬遷"},{"definition":["Guwen Guanzhi, an anthology of essays written in Literary Chinese, compiled and edited by Wu Chucai and Wu Diaohou of Qing dynasty"],"pinyin":["Gu3 wen2 Guan1 zhi3"],"word":"古文觀止"},{"definition":["Zhuge Liang (181-234), military leader and prime minister of Shu Han 蜀漢|蜀汉 during the Three Kingdoms period\/the main hero of the fictional Romance of Three Kingdoms 三國演義|三国演义, where he is portrayed as a sage and military genius\/mastermind"],"pinyin":["Zhu1 ge3 Liang4"],"word":"諸葛亮"},{"definition":["lit. to quote the classics\/to quote chapter and verse (idiom)"],"pinyin":["yin3 jing1 ju4 dian3"],"word":"引經據典"},{"definition":["trivia"],"pinyin":["leng3 zhi1 shi5"],"word":"冷知識"},{"definition":["Three Hundred Tang Poems, an anthology collected around 1763 by Sun Zhu 孫誅"],"pinyin":["Tang2 shi1 San1 bai3 Shou3"],"word":"唐詩三百首"}]}