{"definition":["trigonometric function"],"pinyin":["san1 jiao3 han2 shu4"],"simplified":["三角函数"],"rank":49985.0,"normalized_rank":0.6993550011892603,"fraction":1.4422589533958898e-7,"cumulative_fraction":0.9989578426573648,"word":"三角函數","characters":[{"definition":["surname San","three\/3"],"pinyin":["San1","san1"],"word":"三"},{"definition":["angle\/corner\/horn\/horn-shaped\/unit of money equal to 0.1 yuan, or 10 cents (a dime)\/CL:個|个[ge4]","role (theater)\/to compete\/ancient three legged wine vessel\/third note of pentatonic scale","surname Jue"],"pinyin":["Jue2","jiao3","jue2"],"word":"角"},{"definition":["envelope\/case\/letter"],"pinyin":["han2"],"word":"函"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[],"sentences":[{"english":"Advanced Physics is an algebra-based course and includes trigonometry.","chinese":"此課程基於代數課程，包括三角函數。"},{"english":"Each kind of wave may use the trigonometric function equation to express.","chinese":"各種波形曲線均可以用三角函數方程式來表示。"},{"english":"We might prefer to stick to trigonometric functions.","chinese":"我們可能寧願拘泥於使用三角函數。"},{"english":"Trigonometric functions use radian mode for angles.","chinese":"三角函數的角度使用弧度模式。"},{"english":"And trigonometrical function table checking method is referenced to reduce large arithmetic amount in the unwrapping process.","chinese":"並使用三角函數查表法減少了展開過程的運算量。"},{"english":"Orthonormal basis in L2, Legendre polynomials, basis of trigonometric functions.","chinese":"正交基在L2，勒讓德多項式，三角函數的基礎。"},{"english":"Google can even work with trigonometric functions, including sine and cosine. Google.","chinese":"甚至能用三角函數計算，包括正弦和餘弦。"},{"english":"By means of variable substitution, a triangular function solution of the equation has been developed.","chinese":"對方程進行變量替換的演變得到了方程的三角函數解。"},{"english":"What do I mean by easy trigonometrics?","chinese":"簡單三角函數的積分是什麼意思呢？"}],"related":[]}