{"definition":["heaven"],"pinyin":["shang4 cang1"],"simplified":["上苍"],"rank":34602.0,"normalized_rank":0.4841268730849412,"fraction":6.279957507600322e-7,"cumulative_fraction":0.9938034948361468,"word":"上蒼","characters":[{"definition":["on top\/upon\/above\/upper\/previous\/first (of multiple parts)\/to climb\/to get onto\/to go up\/to attend (class or university)","see 上聲|上声[shang3 sheng1]"],"pinyin":["shang3","shang4"],"word":"上"},{"definition":["dark blue\/deep green\/ash-gray","surname Cang"],"pinyin":["Cang1","cang1"],"word":"蒼"}],"containing_words":[],"sentences":[{"english":"Don’t forget God always keeps an alternative door open for every one.","chinese":"別忘了，上蒼隨時都在爲我們準備着另一扇門。"},{"english":"Some even seem to have an incredible appreciation for everyday they have left.","chinese":"更有甚者，他們天天爲仍然擁有這一天而感謝上蒼。"},{"english":"As long last love has arrived. And I thanks God that I am alive.","chinese":"一旦尋到最後的真愛，我會感謝上蒼讓我還活著。"},{"english":"For the past 18 years I have begged for your forgiveness.","chinese":"十八年來，朕一直在祈求上蒼的寬恕。"},{"english":"The seeming punishment of winter is providing, in reality, invaluable aid.","chinese":"風霜雪凍看似上蒼的懲罰，而實際卻爲生命注入洪福。"},{"english":"Starbuck sees it as a gloomy religious warning.","chinese":"斯達巴克把它看作是冥冥上蒼的一個陰森森的警告。"},{"english":"God gave you a gift of 86,400 seconds today.","chinese":"上蒼給你一件禮物，就是今天有八萬六千四百秒。"},{"english":"Meg thanked God for a neighbor as forgiving as He was.","chinese":"梅格感激上蒼將如此寬宏大度的鄰居賜給了她。"},{"english":"Then I pray, thanking God for another day.","chinese":"然後，我開始祈禱，感謝上蒼給了我新的一天。"},{"english":"And it teaches us to rely more on the fellowship of others and on strength from God.","chinese":"並且它幫教我們更多依賴團體中的他人與上蒼的力量。"},{"english":"Many Chinese believe it is the gods who grant good fortune and opportunities.","chinese":"許多中國人相信福祿乃是上蒼所賜。"},{"english":"Fists high above his head, Lim shouted his victory to heaven.","chinese":"林奮高舉起拳頭，向着上蒼吼出他的勝利。"}],"related":[]}