{"definition":["to come down\/(completed action marker)\/(after verb of motion, indicates motion down and towards us, also fig.)\/(indicates continuation from the past towards us)\/to be harvested (of crops)\/to be over (of a period of time)\/to go among the masses (said of leaders)"],"pinyin":["xia4 lai5"],"simplified":["下来"],"rank":1174.0,"normalized_rank":0.016425783162872694,"fraction":0.00013760697778241523,"cumulative_fraction":0.6456829027775705,"word":"下來","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"}],"containing_words":[{"definition":["to accept\/to take\/next\/following"],"pinyin":["jie1 xia4 lai2"],"word":"接下來"},{"definition":["to stop"],"pinyin":["ting2 xia4 lai2"],"word":"停下來"}],"sentences":[{"english":"Blaine stopped to chat with a friend and Guiteau saw his chance.","chinese":"布萊恩停下來跟一位朋友聊天，吉特奧看到了機會。"},{"english":"He won a few headers and calmed things down.","chinese":"贏得了幾次頭球爭頂並且使情況穩定下來。"},{"english":"I just wanted to write down everything the professor said and memorize it.","chinese":"我就是把教授講的話原原本本紀錄下來然後記住。"},{"english":"Two jockeys were thrown in the second race.","chinese":"有兩個騎師在第二場賽馬時摔了下來。"},{"english":"Sit down and plan out a strategy for defeating your doubt.","chinese":"坐下來然後制定一項擊敗懷疑的計劃。"},{"english":"Yu from East Jiangzhou down to the Three Gorges, Three Gorges will begin dredging project.","chinese":"禹從江州東下來到了三峽，便開始疏浚三峽的工程。"},{"english":"The preserved Sugar Railway Chi-Shan Station.","chinese":"被保存下來的糖鐵旗山車站。"},{"english":"The four-letter words were always edited out of radio scripts until quite recently.","chinese":"直到最近廣播稿中的庸俗詞語才讓保留下來。"},{"english":"After that, everybody pelted snowballs at anybody who was riding the sled.","chinese":"那之後，每個人都對著坐雪橇滑下來的人砸雪球。"},{"english":"The little rain drop slipt from the umbrella to my glasses.","chinese":"從她傘骨滑下來的小雨點濺在我眼鏡玻璃上。"},{"english":"The ground is covered with stiff, dry branches which have rotted off as the trees die.","chinese":"地上全是硬而乾的樹枝，都是因樹死而凋落下來的。"},{"english":"Cut it down now.","chinese":"現在把它剪下來。"},{"english":"Andrew's face fell when he was told he couldn' t go on the trip.","chinese":"安德魯聽說他不能去旅遊時臉沉了下來。"},{"english":"The name of the eclipsing girl, whatever it was, has not been handed down.","chinese":"壓倒羣芳的少女，姓名並未留傳下來。"},{"english":"The child lived but had major medical problems including oxygen deprivation and bleeding in the brain.","chinese":"小孩存活了下來，但患有缺氧及腦出血等嚴重病症。"},{"english":"Spots of rain had begun to fall.","chinese":"稀稀拉拉的雨點開始落下來。"}],"related":[{"definition":["(after a verb, indicates coming out, completion of an action, or ability to discern or detect)","to come out\/to appear\/to arise"],"pinyin":["chu1 lai2","chu5 lai5"],"word":"出來"},{"definition":["(after a verb) indicating the beginning and continuation of an action or a state\/indicating an upward movement (e.g. after 站[zhan4])\/indicating completion\/(after a perception verb, e.g. 看[kan4]) expressing preliminary judgment\/also pr. [qi3 lai5]","to stand up\/to get up\/also pr. [qi3 lai2]"],"pinyin":["qi3 lai5","qi5 lai5"],"word":"起來"},{"definition":["original\/originally\/at first\/it goes without saying\/of course"],"pinyin":["ben3 lai2"],"word":"本來"},{"definition":["to return\/to come back"],"pinyin":["hui2 lai5"],"word":"回來"},{"definition":["to come up\/to approach\/(verb complement indicating success)"],"pinyin":["shang4 lai2"],"word":"上來"},{"definition":["to stop"],"pinyin":["ting2 xia4 lai2"],"word":"停下來"},{"definition":["to accept\/to take\/next\/following"],"pinyin":["jie1 xia4 lai2"],"word":"接下來"},{"definition":["see 過來|过来[guo4 lai2]","to come over\/to manage\/to handle\/to be able to take care of"],"pinyin":["guo4 lai2","guo4 lai5"],"word":"過來"},{"definition":["this kind of\/so\/this way\/like this\/such"],"pinyin":["zhe4 yang4"],"word":"這樣"},{"definition":["at long last\/finally\/on the whole"],"pinyin":["zong3 suan4"],"word":"總算"},{"definition":["to be dead\/not to be, or cease to exist"],"pinyin":["mei2 le5"],"word":"沒了"},{"definition":["after\/then (afterwards)\/after that\/afterwards"],"pinyin":["ran2 hou4"],"word":"然後"},{"definition":["a moment\/a while\/in a moment\/also pr. [yi1 hui3]"],"pinyin":["yi1 hui4"],"word":"一會"},{"definition":["afterwards\/later"],"pinyin":["hou4 lai2"],"word":"後來"},{"definition":["not bad\/tolerable\/fortunately"],"pinyin":["hai2 hao3"],"word":"還好"},{"definition":["one side\/either side\/on the one hand\/on the other hand\/doing while"],"pinyin":["yi1 bian1"],"word":"一邊"}]}