{"definition":["awkward\/embarrassed\/cannot be accomplished"],"pinyin":["xia4 bu4 lai2"],"simplified":["下不来"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"下不來","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"}],"containing_words":[{"definition":["to be put on the spot\/to find oneself in an awkward situation"],"pinyin":["xia4 bu4 lai2 tai2"],"word":"下不來臺"}],"sentences":[{"english":"Marty: He says Santa is too fat to come down our Chimney.","chinese":"他說聖誕老人太胖了，下不來我們的煙囪。"},{"english":"Watching movies is fun, but the ticket prices never go down.","chinese":"看電影真愉快，可惜票價下不來。"},{"english":"Because Fang Qiong cheated money, face on Monday, a hunger strike at home.","chinese":"方瓊因爲被騙了錢，面子上下不來，在家絕食抗議。"},{"english":"Your question stopped him in his tracks, ie disconcerted him.","chinese":"你提的問題讓他當場下不來臺。"},{"english":"Are you worried we beat her to make her galling?","chinese":"我是擔心我們打敗她令她下不來臺嗎？"},{"english":"The temperature won't fall these days.","chinese":"這兩天溫度下不來。"},{"english":"He is in that tree. He can't get down.","chinese":"他在那棵樹上，下不來了。"},{"english":"Jim can't get down from the tree. Can you help him?","chinese":"吉姆從樹上下不來了。你能幫幫忙嗎？"},{"english":"He says Santa is too fat to come down our Chimney.","chinese":"他說聖誕老人太胖了，下不來我們的煙囪。"},{"english":"I have just received a phone call, 3 months prior to the application of the loans years ago can't get down.","chinese":"我剛接到電話，3個月之前申請的貸款年前下不來了。"},{"english":"'But then we couldn't get down again be-cause the door was locked.","chinese":"西里爾說，“可是我們下不來了，因爲門被鎖上了。”"},{"english":"What goes up never comes down.","chinese":"上去的就永遠下不來。"},{"english":"The kitten climbed the tree and couldn't get down.","chinese":"那隻小貓爬上樹但下不來了。"},{"english":"Your remarks were much too harsh for him to swallow with good grace.","chinese":"你的話說得太重，弄得他下不來臺了。"},{"english":"Thee boy climbed up the tree and couldn't get down.","chinese":"小男孩爬上樹，卻下不來了。"},{"english":"Her temperature won't come down.","chinese":"她的體溫降下不來。"}],"related":[]}