{"definition":["underscore _\/underline"],"pinyin":["xia4 hua4 xian4"],"simplified":["下划线"],"rank":56146.0,"normalized_rank":0.7855553845508094,"fraction":7.123708190862289e-8,"cumulative_fraction":0.999600686814404,"word":"下劃線","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["to cut\/to slash\/to scratch (cut into the surface of sth)\/to strike (a match)","to delimit\/to transfer\/to assign\/to plan\/to draw (a line)\/stroke of a Chinese character"],"pinyin":["hua2","hua4"],"word":"劃"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"}],"containing_words":[],"sentences":[{"english":"Note: the heat shock consensus sequences are indicated by underscores.","chinese":"下劃線表示熱激保守序列。"},{"english":"Note that, here, the lifeline name is underlined.","chinese":"這裏注意一點，生命線名稱帶下劃線。"},{"english":"Hover the mouse over a section underlined in red.","chinese":"將鼠標停在紅色下劃線部分上。"},{"english":"By default, the separator is an underscore character.","chinese":"在默認情況下，分隔符是下劃線字符。"},{"english":"Note the underlining of the validity error.","chinese":"注意打了下劃線的有效性錯誤。"},{"english":"Would you change the boldface terms, perhaps using italic or underlining?","chinese":"你會改變黑體字方面，可能使用斜體或下劃線？"},{"english":"Keep the red color, but get rid of the underlining and hover state.","chinese":"保持紅色不變，但去除下劃線和懸浮狀態。"},{"english":"The user points out that php adds a '_' to your prefixes.","chinese":"前綴和數組鍵名之間會自動加上一個下劃線。"},{"english":"Hover the mouse over a section underlined in blue.","chinese":"將鼠標停在藍色下劃線部分上。"},{"english":"The underline is a hint that the named file exists.","chinese":"下劃線表示指定的文件存在。"},{"english":"Underline, bold face, and use bullets to emphasize your credentials.","chinese":"下劃線，加粗，並使用重點突出強調你的榮譽。"},{"english":"The underscores were the sites for restriction digest.","chinese":"下劃線是限制性酶切位點。"},{"english":"You can separate words within the probe name using a double underscore.","chinese":"可以用雙下劃線分隔探測名中的單詞。"},{"english":"A file name component is the portion of a file name between backslashes.","chinese":"文件名組成部分即下劃線之間的文件名。"},{"english":"What do Horvath's underlined words in Para 10 imply?","chinese":"第十段中，下劃線的霍瓦特所說的話意味着什麼？"},{"english":"All other characters in an identifier must be letters, digits, or the underscore.","chinese":"標識符的其他字符必須是字母，數字或下劃線。"}],"related":[]}