{"definition":["underneath\/below\/the underside\/world of mortals\/to descend to the world of mortals (of Gods)"],"pinyin":["xia4 fang1"],"simplified":["下方"],"rank":6473.0,"normalized_rank":0.09056566815440796,"fraction":0.000016569482492217332,"cumulative_fraction":0.8882806863905324,"word":"下方","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["Fang1","fang1"],"word":"方"}],"containing_words":[{"definition":["beneath"],"pinyin":["zai4 xia4 fang1"],"word":"在下方"}],"sentences":[{"english":"The pain may also be felt beneath the precordium.","chinese":"也可在胸前區下方有疼痛感覺。"},{"english":"The Soyuz spacecraft appears at the bottom left.","chinese":"聯盟號宇宙飛船出現在圖片的左下方。"},{"english":"When a dam is built, the accumulating water presses down upon the rock below.","chinese":"當大壩建成，逐漸積累的水壓壓向下方的岩石。"},{"english":"In open-pit mines, the problem of underground mining under the slope is usually encountered.","chinese":"邊坡下方井工開採是一個露天煤礦普遍存在的問題。"},{"english":"Please select all the photos you request for the high-resolution version, and then click the bottom button.","chinese":"請在選中所有所需高像素圖片後，點擊下方按鈕。"},{"english":"If you may have any question, please leave them below.","chinese":"西蒙妮有任何問題，請在預告下方留言。"},{"english":"A large complete bottom note LOGO.","chinese":"右下方注有大運完整LOGO。"},{"english":"Label each picture the appropriate style of cooking potatoes.","chinese":"請把正確的土豆烹飪方法填到相應的圖片下方。"},{"english":"The bottom part of each separation container unit is provided with water outlet passage pointed back and downward.","chinese":"各分離容器單元的底部均有指向後下方的出水通道。"},{"english":"The Nike shox has a slot beneath the cushion that lines the shoe.","chinese":"耐克彈力柱鞋在鞋墊下方有一個狹縫。"},{"english":"Fuk golden words below to apply the same process for \"Fu as the East China Sea water\" font.","chinese":"金色福字下方採用同樣的工藝作“福如東海水”字體。"},{"english":"Set this option to show the file size below the image thumbnail.","chinese":"設定此選項以在圖像縮略圖下方顯示文件大小。"},{"english":"The inferior and lateral convex border of the stomach is the greater curvature .","chinese":"胃的下方及側面凸緣是胃大彎。"},{"english":"A light tube hangs below the shelves on four leather straps.","chinese":"燈管用四條皮革帶掛在架子的下方。"},{"english":"It's an image that will be displayed below the drawings, like a frame for example.","chinese":"這是顯示在桌面小程式下方的圖形，就像是相框一樣。"},{"english":"The slope mine under the town was slowly filled with salt brine making the surface subside.","chinese":"小鎮下方的傾斜巷道慢慢被鹽水充滿以致地表下沉。"}],"related":[{"definition":["bottom"],"pinyin":["di3 bu4"],"word":"底部"},{"definition":["under\/the underside\/below"],"pinyin":["xia4 bian5"],"word":"下邊"},{"definition":["end\/tip\/extremity"],"pinyin":["mo4 wei3"],"word":"末尾"},{"definition":["to boil noodles"],"pinyin":["xia4 mian4"],"word":"下麵"},{"definition":["to leave a message\/to leave one's comments\/message"],"pinyin":["liu2 yan2"],"word":"留言"},{"definition":["two-dimensional barcode\/QR code"],"pinyin":["er4 wei2 ma3"],"word":"二維碼"},{"definition":["down\/downward"],"pinyin":["xiang4 xia4"],"word":"向下"},{"definition":["bottom\/bottom side\/end part"],"pinyin":["di3 duan1"],"word":"底端"},{"definition":["to scan"],"pinyin":["sao3 miao2"],"word":"掃描"},{"definition":["the top\/above\/overhead\/upwards\/the top margin\/above-mentioned\/those higher up"],"pinyin":["shang4 bian5"],"word":"上邊"},{"definition":["roof\/topmost part\/top (of tree, wall etc)\/apex"],"pinyin":["ding3 bu4"],"word":"頂部"},{"definition":["left side"],"pinyin":["zuo3 ce4"],"word":"左側"},{"definition":["left\/the left side\/to the left of"],"pinyin":["zuo3 bian5"],"word":"左邊"},{"definition":["to pay attention to\/to follow sth closely\/to follow (on social media)\/concern\/interest\/attention"],"pinyin":["guan1 zhu4"],"word":"關注"},{"definition":["oh (interjection indicating doubt or surprise)","oh (interjection indicating that one has just learned sth)","sentence-final particle that conveys informality, warmth, friendliness or intimacy\/may also indicate that one is stating a fact that the other person is not aware of","to chant"],"pinyin":["e2","o2","o4","o5"],"word":"哦"},{"definition":["on top of\/above-mentioned\/also pr. [shang4 mian5]"],"pinyin":["shang4 mian4"],"word":"上面"}]}