{"definition":["to take down from the shelves (e.g. a contaminated product)"],"pinyin":["xia4 jia4"],"simplified":["下架"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"下架","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["to support\/frame\/rack\/framework\/classifier for planes, large vehicles, radios etc"],"pinyin":["jia4"],"word":"架"}],"containing_words":[],"sentences":[{"english":"Authorities said hair dye containing lentine will be pulled off the shelves soon.","chinese":"相關人員表示，這些染髮劑將很快下架。"},{"english":"Wan also said the company will not take the product off shelves or accept any returns.","chinese":"萬玉華說，不會對產品進行下架或退貨處理。"},{"english":"They were shipped all over the country but should be off store shelves by now.","chinese":"這些蜜瓜運抵全國各地，但目前應該都下架了。"},{"english":"Taobao will take the product off the shelves immediately, a manager said.","chinese":"淘寶網某經理表示將對該產品立即進行下架處理。"},{"english":"Instead, in an unpublicised recall, powder was withdrawn from shops.","chinese":"得到的結果卻是非公開召回，奶粉在商店下架。"},{"english":"The government last week started emergency inspections to get contaminated goods off store shelves.","chinese":"政府上週開始緊急調查，將受污染產品下架。"},{"english":"The Russian authorities say any European vegetables already on sale in shops in Russia will be seized. Here's Foreign Ministry Spokesman Alexander Lukashevich.","chinese":"俄羅斯官員說，所有正在銷售的歐洲蔬菜必須下架。"},{"english":"Millions of bottled drinks and tons of juice powder have already been pulled from the shelves.","chinese":"成千上萬的瓶裝飲料和大量的果汁粉已經被下架了。"},{"english":"Products without supporting documents will be pulled off shelves.","chinese":"沒有證明文件的產品將被下架。"}],"related":[{"definition":["to shut out\/to block\/to smother"],"pinyin":["feng1 sha1"],"word":"封殺"},{"definition":["to reform\/to rectify and improve"],"pinyin":["zheng3 gai3"],"word":"整改"},{"definition":["to put goods on shelves\/(of a product) to be available for sale"],"pinyin":["shang4 jia4"],"word":"上架"},{"definition":["to return merchandise\/to withdraw a product"],"pinyin":["tui4 huo4"],"word":"退貨"},{"definition":["(of a power plant, refinery etc) to shut down"],"pinyin":["guan1 ting2"],"word":"關停"},{"definition":["poor evaluation\/adverse criticism"],"pinyin":["cha4 ping2"],"word":"差評"},{"definition":["to refund\/refund"],"pinyin":["tui4 kuan3"],"word":"退款"},{"definition":["to run out of (stock)"],"pinyin":["duan4 huo4"],"word":"斷貨"},{"definition":["to cease trading (temporarily or permanently)\/to close down"],"pinyin":["ting2 ye4"],"word":"停業"},{"definition":["to withdraw\/to remove (from a place)\/to remove from office"],"pinyin":["che4 xia4"],"word":"撤下"},{"definition":["State Administration of Press, Publication, Radio, Film and Television (SAPPRFT), est. 2013 (abbr. for 國家新聞出版廣電總局|国家新闻出版广电总局[Guo2 jia1 Xin1 wen2 Chu1 ban3 Guang3 dian4 Zong3 ju2])\/(prior to 2013) State Administration of Radio, Film, and Television (SARFT)"],"pinyin":["Guang3 dian4 Zong3 ju2"],"word":"廣電總局"},{"definition":["to delete"],"pinyin":["shan1 diao4"],"word":"刪掉"},{"definition":["to go bankrupt\/to close down"],"pinyin":["dao3 bi4"],"word":"倒閉"},{"definition":["to cut the price\/to drive down the price\/to get cheaper"],"pinyin":["jiang4 jia4"],"word":"降價"},{"definition":["to order\/to enjoin\/to charge\/to instruct sb to finish sth"],"pinyin":["ze2 ling4"],"word":"責令"},{"definition":["to eject (media player)"],"pinyin":["tui4 pian4"],"word":"退片"}]}