{"definition":["(of trains) down (i.e. away from the capital)\/(of river boats) to travel downstream\/to issue (a document) to lower bureaucratic levels\/(of writing on the page) vertical, proceeding from top to bottom"],"pinyin":["xia4 xing2"],"simplified":["下行"],"rank":7933.0,"normalized_rank":0.11099296237740124,"fraction":0.000012122858000376019,"cumulative_fraction":0.9089919528217196,"word":"下行","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"}],"containing_words":[],"sentences":[{"english":"In order for you to succeed in this business, your downline must succeed first.","chinese":"你要想在這生意方面成功，你的下行線一定首先成功。"},{"english":"The decending branch was anastomosed with the anterior medial malleolar artery.","chinese":"降支下行與內踝前動脈吻合。"},{"english":"Aim To improve the performance of layered space-time coding (LSTC) for wideband downlink transmission.","chinese":"目的提高無線寬帶下行傳輸中分層空時編碼的性能。"},{"english":"The down escalator is not running today.","chinese":"今天下行的自動樓梯不開。"},{"english":"Its function is to route a downlink by means of the most efficient air-ground subnetwork .","chinese":"它的職能是路線下行的手段最有效的空地子網。"},{"english":"After a few months, cotton prices by cow go bears, entering the downlink channel.","chinese":"數月後，棉價由牛轉熊，進入下行通道。"},{"english":"In computer terms, this rule is also known as recursive tree descent.","chinese":"以計算機術語表述，這條規則也可以稱作遞歸樹下行。"},{"english":"Ling was a style of official documents, with its concise and simple stylistic features.","chinese":"令是下行公文中的一種，以簡煉樸實爲風格特徵。"},{"english":"The speed limiter is to limit the installation of the elevator car speeding down devices.","chinese":"而限速器是限制電梯轎廂超速下行的安裝裝置。"},{"english":"Cases of neolarynx reconstruction under acupuncture anesthesia combining with drugs were performed from 1992 to 1995.","chinese":"本文介紹50例針藥結合麻醉下行新喉再造術。"},{"english":"Looking ahead, there are two sources of downside risk to the outlook.","chinese":"展望未來，這種前景具有兩個下行的風險源。"},{"english":"Returning to the right kidney find the descending duodenum and the pancreas.","chinese":"回到右腎，找到下行十二指腸，與胰臟。"},{"english":"For a Chinese version, please click the link below.","chinese":"請點按下行連結鍵文以觀讀中文版。"},{"english":"The steps are evaluated from left to right and generally descend the model's tree as they do so.","chinese":"從左向右估算步，如果這樣做，通常會下行模型樹。"},{"english":"In China, the down trains are given odd numbers.","chinese":"在中國，下行列車編號用奇數。"},{"english":"ObjectiveTo explore the projections of the long descending propriospinal tracts to lumbar enlargement.","chinese":"目的探討脊髓長下行固有束在腰膨大的分佈。"}],"related":[{"definition":["(of trains) up (i.e. towards the capital)\/(of river boats) to go against the current\/to submit (a document) to higher authorities"],"pinyin":["shang4 xing2"],"word":"上行"},{"definition":["to fall back\/to return to low level after a rise (in water level, price etc)"],"pinyin":["hui2 luo4"],"word":"回落"},{"definition":["to slow down\/to ease up\/to abate\/slowdown\/downturn"],"pinyin":["qu1 huan3"],"word":"趨緩"},{"definition":["down\/downward"],"pinyin":["xiang4 xia4"],"word":"向下"},{"definition":["to go down\/to decline"],"pinyin":["zou3 di1"],"word":"走低"},{"definition":["short term\/short-term"],"pinyin":["duan3 qi1"],"word":"短期"},{"definition":["phony\/so-called\/armchair (expert)\/vain (promise)\/(finance) short-seller\/bear (market)\/short (selling)"],"pinyin":["kong1 tou2"],"word":"空頭"},{"definition":["to vibrate\/to shake\/to shudder"],"pinyin":["zhen4 dang4"],"word":"震蕩"},{"definition":["(of sales, prices etc) to fall\/to drop\/decline\/slump"],"pinyin":["xia4 cuo4"],"word":"下挫"},{"definition":["to fall back (of water level or share prices)"],"pinyin":["hui2 die1"],"word":"回跌"},{"definition":["to fall\/to tumble"],"pinyin":["xia4 die1"],"word":"下跌"},{"definition":["exchange rate"],"pinyin":["hui4 jia4"],"word":"匯價"},{"definition":["stock market index\/share price index\/abbr. for 股票指數|股票指数[gu3 piao4 zhi3 shu4]"],"pinyin":["gu3 zhi3"],"word":"股指"},{"definition":["rising trend\/upward momentum (e.g. in prices)"],"pinyin":["zhang3 shi4"],"word":"漲勢"},{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"word":"反彈"},{"definition":["to continue to fall (of share prices)"],"pinyin":["xu4 die1"],"word":"續跌"}]}