{"definition":["next week"],"pinyin":["xia4 zhou1"],"simplified":["下周"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"下週","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["week\/weekly\/variant of 周[zhou1]"],"pinyin":["zhou1"],"word":"週"}],"containing_words":[],"sentences":[{"english":"We are going to have a test on Lesson Two next Monday.","chinese":"我們下週星期一要考第二課。"},{"english":"I'd like to drop by and see you sometime next week.","chinese":"我想在下週某個時候順便來看看你。"},{"english":"Please send them to this address before twelve o'clock next Monday.","chinese":"請於下週一12點前把它們送到這個地址。"},{"english":"If you are busy at all, we might come to talk to you sometime next week.","chinese":"如果你確實很忙，我們在下週某個時候來跟你說。"},{"english":"I am writing to find out the possibility of our having a brief meeting some time next week…","chinese":"我去信詢問一下我們能否在下週某個時間見面。"},{"english":"For the interest class date felt on a public holiday, the lesson will be proponed to a week later.","chinese":"凡課當日爲公衆假期，當日興趣班順延至下週舉行。"},{"english":"My next door neighbour is moving out next week.","chinese":"下週我隔壁的鄰居就要搬走了。"},{"english":"So, that's where we'll start when we think about Morrison next week.","chinese":"這是我們下週將Morrison時要先說的。"},{"english":"I'd like to drop in and see you sometime next week.","chinese":"我想在下週什麼時候順便來看看你。"},{"english":"I'll have a room free next week.","chinese":"下週我這裏會有一個房間可租。"},{"english":"In Washington, D. C. next week, I'm giving a talk about the Happiness Project.","chinese":"下週，華盛頓，我將進行一次快樂計劃的討論。"},{"english":"I will be working with Mr. Bai to complete the paper work this work or early next week.","chinese":"我將與白先生完成這項工作的文件工作或下週初。"},{"english":"I think I'm going to buy one, maybe next week.","chinese":"我打算去買下那一頂，也許下週就去。"},{"english":"Will those old schools be pulled down next week?","chinese":"那些老校是在下週拆除嗎？"},{"english":"The new economic policy will be made public early next week.","chinese":"新經濟政策將在下週初公佈。"},{"english":"Or,to put it more straightforwardly, next week the person that's me is the person with my soul.","chinese":"或更直接地說，下週是我的那個人，帶着我的靈魂。"}],"related":[{"definition":["on the eve of\/to be about to\/to be on the verge of"],"pinyin":["ji2 jiang1"],"word":"即將"},{"definition":["weekend"],"pinyin":["zhou1 mo4"],"word":"週末"},{"definition":["next month"],"pinyin":["xia4 ge4 yue4"],"word":"下個月"},{"definition":["Friday"],"pinyin":["Zhou1 wu3"],"word":"週五"},{"definition":["week\/weekly\/variant of 周[zhou1]"],"pinyin":["zhou1"],"word":"週"},{"definition":["foundation of a University or College\/school opening\/the start of a new term"],"pinyin":["kai1 xue2"],"word":"開學"},{"definition":["several days"],"pinyin":["ji3 tian1"],"word":"幾天"},{"definition":["fortnight"],"pinyin":["liang3 xing1 qi1"],"word":"兩星期"},{"definition":["termination\/to finish\/to end\/to conclude\/to close"],"pinyin":["jie2 shu4"],"word":"結束"},{"definition":["preparation\/to prepare\/to intend\/to be about to\/reserve (fund)"],"pinyin":["zhun3 bei4"],"word":"準備"},{"definition":["will\/shall\/to be going to"],"pinyin":["jiang1 yao4"],"word":"將要"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"},{"definition":["Monday"],"pinyin":["Zhou1 yi1"],"word":"週一"},{"definition":["slot within a schedule\/timeslot (for a TV program, a session with a photographer etc)\/range of dates in which an event is to be held (film screening, exhibition etc)"],"pinyin":["dang4 qi1"],"word":"檔期"},{"definition":["week\/religious service\/worship\/CL:個|个[ge4]"],"pinyin":["li3 bai4"],"word":"禮拜"},{"definition":["to begin\/beginning\/to start\/initial\/CL:個|个[ge4]"],"pinyin":["kai1 shi3"],"word":"開始"}]}