{"definition":["below\/under\/next\/the following\/also pr. [xia4 mian5]"],"pinyin":["xia4 mian4"],"simplified":["下面"],"rank":2283.0,"normalized_rank":0.031942131993899794,"fraction":0.00006512996191122711,"cumulative_fraction":0.7505058499568309,"word":"下面","characters":[{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"},{"definition":["face\/side\/surface\/aspect\/top\/classifier for flat surfaces such as drums, mirrors, flags etc"],"pinyin":["mian4"],"word":"面"}],"containing_words":[{"definition":["underneath"],"pinyin":["zai4 xia4 mian4"],"word":"在下面"}],"sentences":[{"english":"Shown below are specific features of edge-to-edge holographic CD's.","chinese":"下面介紹邊到邊全息圖像光盤的具體特徵。"},{"english":"The cat under the table is Tama.","chinese":"桌子下面的那隻貓叫塔瑪。"},{"english":"Suffice it to say that the following responses of some umbelliferous plants have been observed .","chinese":"下面僅就已觀察到的幾種傘形科植物的反應予以說明。"},{"english":"Your lifejacket is located under your seat or beneath your central arm rest.","chinese":"你的救生衣裝在座位下或者中央扶手下面。"},{"english":"Below, you can see the result with each Anti-aliased method.","chinese":"下面，你可以看到每個反走樣方法的結果。"},{"english":"The rest of the story is what she told me happened.","chinese":"下面的故事是她告訴我的那天所發生的事情。"},{"english":"The carpenter working on the rafter passed his axe down to his mate below.","chinese":"在椽子上幹活的木匠將斧子傳給下面的夥伴。"},{"english":"Consider the following two versions of a method, which end up doing the same thing. The version in Listing 2 uses cached field IDs","chinese":"考慮下面兩個版本的方法，它們的作用是相同的。"},{"english":"This method is shown in the following listing.","chinese":"這種方法如下面的清單所示。"},{"english":"A charter is a mask; the lie lurks beneath it.","chinese":"憲章是個假面具，蓋在那下面的是謊話。"},{"english":"Listen to the interview with Mr. Malcolm Lang Land and answer the following questions.","chinese":"聽下面的對馬克姆朗蘭德的彩旗，回答下列問題。"},{"english":"But below are the six basic elements you hope to include in your strategy.","chinese":"但是下面六個基本要素你或許希望包括在你的策略裏。"},{"english":"Documenting and defending these decisions depends on the communication skills discussed below.","chinese":"證明和維護這些決策依賴於下面討論的交流技能。"},{"english":"Now I'd like to brief you on the 106th Canton Fair.","chinese":"下面我向大家介紹本屆廣交會的主要情況。"},{"english":"They should combine the comprehensive land using situation to develop the two types of residences, tog…","chinese":"這兩種類型各具優劣，下面我們將二者進行對比分析。"},{"english":"The specifications of the files are listed below and the file names should match the activity name.","chinese":"這些文件的規範在下面列示，文件名必須匹配活動名。"}],"related":[{"definition":["on top of\/above-mentioned\/also pr. [shang4 mian5]"],"pinyin":["shang4 mian4"],"word":"上面"},{"definition":["editor or creator of online content (diminutive term, often used to refer to oneself: I, me, this writer)"],"pinyin":["xiao3 bian1"],"word":"小編"},{"definition":["to take a look at\/to examine\/to survey\/(coll.) pretty soon"],"pinyin":["kan4 kan5"],"word":"看看"},{"definition":["to accept\/to take\/next\/following"],"pinyin":["jie1 xia4 lai2"],"word":"接下來"},{"definition":["(modal particle indicating suggestion or surmise)\/...right?\/...OK?\/...I presume.","(onom.) smack!","bar (loanword) (serving drinks, or providing Internet access etc)\/to puff (on a pipe etc)\/(onom.) bang\/abbr. for 貼吧|贴吧[tie1 ba1]"],"pinyin":["ba1","ba5","bia1"],"word":"吧"},{"definition":["(used after a verb) give it a go\/to do (sth for a bit to give it a try)\/one time\/once\/in a while\/all of a sudden\/all at once"],"pinyin":["yi1 xia4"],"word":"一下"},{"definition":["everyone\/influential family\/great expert"],"pinyin":["da4 jia1"],"word":"大家"},{"definition":["particle indicating that a previously asked question is to be applied to the preceding word (\"What about ...?\", \"And ...?\")\/particle for inquiring about location (\"Where is ...?\")\/particle signaling a pause, to emphasize the preceding words and allow the listener time to take them on board (\"ok?\", \"are you with me?\")\/(at the end of a declarative sentence) particle indicating continuation of a state or action\/particle indicating strong affirmation","woolen material"],"pinyin":["ne5","ni2"],"word":"呢"},{"definition":["under\/the underside\/below"],"pinyin":["xia4 bian5"],"word":"下邊"},{"definition":["please see ...\/vide"],"pinyin":["qing3 kan4"],"word":"請看"},{"definition":["we or us (including both the speaker and the person(s) spoken to)\/(dialect) I or me\/(dialect) (in a coaxing or familiar way) you\/also pr. [za2 men5]"],"pinyin":["zan2 men5"],"word":"咱們"},{"definition":["that level or lower\/that amount or less\/the following"],"pinyin":["yi3 xia4"],"word":"以下"},{"definition":["today\/at the present\/now"],"pinyin":["jin1 tian1"],"word":"今天"},{"definition":["to say sth"],"pinyin":["shuo1 shuo5"],"word":"說說"},{"definition":["as follows"],"pinyin":["ru2 xia4"],"word":"如下"},{"definition":["first (of all)\/in the first place"],"pinyin":["shou3 xian1"],"word":"首先"}]}