{"definition":["no less than\/not inferior to"],"pinyin":["bu4 ya4 yu2"],"simplified":["不亚于"],"rank":13971.0,"normalized_rank":0.19547241615715025,"fraction":0.000004677853052790616,"cumulative_fraction":0.9545034057232112,"word":"不亞於","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["Asia\/Asian\/Taiwan pr. [Ya3]","second\/next to\/inferior\/sub-\/Taiwan pr. [ya3]"],"pinyin":["Ya4","ya4"],"word":"亞"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[],"sentences":[{"english":"In fact, the world of friendship there are jealous, that nothing less than love.","chinese":"其實，友情世界裏也存在着喫醋，那滋味不亞於愛情。"},{"english":"He is second to none in physics.","chinese":"他在物理學方面絕不亞於任何人。"},{"english":"Though it was winter , the charm was not less excellent as that in spring, summer and autumn.","chinese":"雖是冬季，景色的美妙絕倫不亞於春季，夏季和秋季。"},{"english":"Berlioz compared him favorably to Beethoven and Gluck.","chinese":"柏遼茲認爲他並不亞於貝多芬和格魯克。"},{"english":"Though he is over50, he is as adaptable as the young.","chinese":"儘管已經50多歲了，他的適應能力並不亞於年輕人。"},{"english":"Its danger allows the degree not to be inferior to hypertension.","chinese":"其危容程度不亞於高血壓。"},{"english":"My father, no less than I, is a base-ball fan.","chinese":"我的父親不亞於我也是個棒球迷。"},{"english":"Investors care about people as well as numbers.","chinese":"投資者對於人的關注不亞於數字。"},{"english":"A sub-clerk in the post office is the equal of a conqueror if consciousness is common to them.","chinese":"如果意識思維相同，郵局的下等職員不亞於一個皇帝。"},{"english":"And as much as I want her, I can't let it run my whole life.","chinese":"並不亞於我想她，我不能讓它運行我的整個生命。"},{"english":"His pare notnts are not no less glad over his engagement dawn he is (glad over his engagement).","chinese":"他的雙親對他訂婚的高興並不亞於他自己。"},{"english":"This old car of mine compares favourably with Blake's new one.","chinese":"我的這輛舊車並不亞於布萊克的新車。"},{"english":"Help to make earth happy, like the heaven above.","chinese":"小小的善舉，細微的愛語，使地球快樂，不亞於天堂。"},{"english":"Rivaling the impact of the personal computer was another epochal breakthrough.","chinese":"另一項劃時代技術突破的影響力不亞於個人計算機。"}],"related":[]}