{"definition":["to be awfully (busy etc)"],"pinyin":["bu4 ke3 kai1 jiao1"],"simplified":["不可开交"],"rank":20989.0,"normalized_rank":0.2936633414016482,"fraction":0.0000021600309446760103,"cumulative_fraction":0.9770867615002028,"word":"不可開交","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["can\/may\/able to\/to approve\/to permit\/to suit\/(particle used for emphasis) certainly\/very","see 可汗[ke4 han2]"],"pinyin":["ke3","ke4"],"word":"可"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"}],"containing_words":[],"sentences":[{"english":"I've been as busy as a bee all day doing my spring - cleaning.","chinese":"大掃除使得我一整天一直忙得不可開交。"},{"english":"I would have laughed in different circumstances.","chinese":"換了是別的場合，她這麼說我會笑得不可開交。"},{"english":"Between the planning of the wedding and SOUTHLAND, I'm pretty busy.","chinese":"在婚禮跟《南國》之間，我有點忙得不可開交了。"},{"english":"Just when I was busiest, he must come worrying.","chinese":"我正忙得不可開交，他偏要帶麻煩的事。"},{"english":"Beihai pavilion every day, from early in the morning is always so busy.","chinese":"北海亭每逢這一天，總是從一大早就忙得不可開交。"},{"english":"Domestic robots keep busy at the Korea Institute of Science and Technology.","chinese":"在韓國科技研究中心，家用機器人忙得不可開交。"},{"english":"This week meanwhile, both parties have been pre-occupied with picking their leaders.","chinese":"同時，本週兩黨都爲安排各自領導人忙的不可開交。"},{"english":"We cannot accept new orders since we have already got our hands full.","chinese":"我們不能再接受新訂單，因爲已經忙得不可開交了。"},{"english":"The last week of September 2009 was very busy for Oxfam.","chinese":"2009年9月最後一個星期，樂施會忙得不可開交。"},{"english":"With the new baby , my daughter really has her hands full.","chinese":"我女兒新添嬰兒後，忙得不可開交。"},{"english":"She came bustling out, wiping her hands on her apron.","chinese":"她忙的不可開交，把手放在圍裙上擦了又擦。"},{"english":"I don't want to see our two neighbours engaged in a brawl.","chinese":"我不希望我們兩家吵架吵得不可開交。"},{"english":"Pumping that water up to her neck.","chinese":"抽水抽得不可開交。"},{"english":"We used to fight like cats and dogs .","chinese":"我們過去常打得不可開交。"},{"english":"Tomorrow will be their wedding day. Both their families are busy today preparing for the wedding ceremony.","chinese":"他們兩個明天就要拜天地了，家裏人忙得不可開交。"},{"english":"The planners were busy bypassing the Gordian knot.","chinese":"計劃者爲迴避這個棘手的問題，忙得不可開交。"}],"related":[]}