{"definition":["no longer\/no more"],"pinyin":["bu4 fu4"],"simplified":["不复"],"rank":28474.0,"normalized_rank":0.3983882025380214,"fraction":0.0000010793585730171265,"cumulative_fraction":0.98870351827976,"word":"不復","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out"],"pinyin":["fu4"],"word":"復"}],"containing_words":[{"definition":["gone forever"],"pinyin":["yi1 qu4 bu4 fu4 fan3"],"word":"一去不復返"},{"definition":["consigned to eternal damnation\/with no hope of reprieve"],"pinyin":["wan4 jie2 bu4 fu4"],"word":"萬劫不復"}],"sentences":[{"english":"The devastated old China is gone for ever.","chinese":"瘡痍滿目的舊中國一去不復返了。"},{"english":"I am certain, after 14 years of encounters with the Taliban, that they are not beyond redemption.","chinese":"遭遇塔利班14年，我知道他們並沒有萬劫不復。"},{"english":"I'm sure Marr's right that newspapers as we know them are not going to survive.","chinese":"我可以肯定馬爾的正確，如我們所知報紙將不復存在。"},{"english":"The golden school-time days have gone down in youth history and will not come back again.","chinese":"金色的學生時代，已載入了青春史冊，一去不復還。"},{"english":"The good old days of “Our Friend the Atom” were gone for good.","chinese":"過去“原子是我們的朋友”美好時光也一去不復返了。"},{"english":"Gone are the days when the farmers were looked down upon.","chinese":"農民被人瞧不起的日子一去不復返了。"},{"english":"Gone are the days when the working people suffered from cold and hunger.","chinese":"勞動人民挨凍受餓的日子一去不復返了。"},{"english":"He understands that the days are gone when the party can maintain political stability with the muzzle of a gun.","chinese":"他知道一個政黨靠槍桿子出政權的日子一去不復返了。"},{"english":"Or will MMV just cease to exist.","chinese":"抑或摩托羅拉移動風險投資將不復存在？"},{"english":"Easy money has turned into heavy debt.","chinese":"現在緩衝作用不復存在，快錢變成了沉重的債務。"},{"english":"10th, Meng Xiangbin The wind whinny, the river water is cold, the brave soldier never to returns.","chinese":"風蕭蕭，江水寒，壯士一去不復返。"},{"english":"If on Candlemas day it be shower and rain, winter is gone, and will not come again.","chinese":"如果聖燭節下冰雹和雨水，冬天已經一去不復返。"},{"english":"This effect would be absent if the sley dwelt during the period of shuttle flight.","chinese":"如果梭子飛行期間筘座停頓，這種效果便不復存在了。"},{"english":"Gone are the days when we used foreign oil.","chinese":"咱們利用洋油的日子一去不復返了。"},{"english":"Anika_Wu: Life is like a one way street, none of them leads back.","chinese":"人生就像一條單行道，一去不復返。"},{"english":"Caesar is no more.","chinese":"愷撒已不復存在了。"}],"related":[]}