{"definition":["day and night\/round-the-clock"],"pinyin":["bu4 fen1 zhou4 ye4"],"simplified":["不分昼夜"],"rank":34597.0,"normalized_rank":0.4840569165978762,"fraction":6.282877060137561e-7,"cumulative_fraction":0.9938003542734826,"word":"不分晝夜","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["daytime"],"pinyin":["zhou4"],"word":"晝"},{"definition":["night"],"pinyin":["ye4"],"word":"夜"}],"containing_words":[],"sentences":[{"english":"I think about you day and night.","chinese":"我不分晝夜的想着你。"},{"english":"Good programmers think about their work 24\/7.","chinese":"好的程序員不分晝夜在思考完善自己的項目。"},{"english":"In principle a volcano can erupt at any time, day and night.","chinese":"原則上說，火山隨時都會爆發，不分晝夜。"},{"english":"They've been there around the clock for 10 consecutive days.","chinese":"他們已經連續10天不分晝夜地聚集在那裏。"},{"english":"The green food all day and night canned trust to take.","chinese":"不分晝夜都可以放心攝取的綠色食品。"},{"english":"Who vows to fight like a man for what's right night and day?","chinese":"是誰宣誓爲了正義不分晝夜的戰鬥？"},{"english":"Doctors and health workers are working around the clock to cope.","chinese":"醫生和保健工作者正在不分晝夜地工作。"},{"english":"Mutta-matutta nursed him night and day, with the sourest monkey-physic.","chinese":"瑪特瑪不分晝夜地照顧他，給他服下最酸的猴藥。"},{"english":"In the center of the hut a fire burned night and day from the beginning to the end of the year.","chinese":"在小茅屋的中間終年不分晝夜地燃燒着爐火。"},{"english":"I was young, single, and willing to work all hours of the day and night.","chinese":"我年紀輕，又是單身一人，我願意不分晝夜的工作。"},{"english":"During the days in Shengzhen, Zhong Lijun went all out, working round the clock.","chinese":"在深圳的日子裏鍾麗君不分晝夜的奮力打拼。"}],"related":[]}