{"definition":["countless\/innumerable"],"pinyin":["bu4 ke3 sheng4 shu3"],"simplified":["不可胜数"],"rank":52290.0,"normalized_rank":0.7316049417262462,"fraction":1.1240277268368776e-7,"cumulative_fraction":0.9992521449393791,"word":"不可勝數","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["can\/may\/able to\/to approve\/to permit\/to suit\/(particle used for emphasis) certainly\/very","see 可汗[ke4 han2]"],"pinyin":["ke3","ke4"],"word":"可"},{"definition":["victory\/success\/to beat\/to defeat\/to surpass\/victorious\/superior to\/to get the better of\/better than\/surpassing\/superb (of vista)\/beautiful (scenery)\/wonderful (view)\/(Taiwan pr. [sheng1]) able to bear\/equal to (a task)"],"pinyin":["sheng4"],"word":"勝"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[],"sentences":[{"english":"thousands and thousands of people got infected with flu every year.","chinese":"每年不可勝數的人遭到風行性感冒感染。"},{"english":"Many people benefited from his countless generosities.","chinese":"很多人從他的不可勝數的慷慨大方里受益。"},{"english":"Today, the uses of aluminum are innumerable.","chinese":"今天鋁的用途多得不可勝數。"},{"english":"Thousands of English words are derived from Latin. ;","chinese":"英語中有不可勝數的詞源於拉丁文。"},{"english":"For many Chinese, there are big advantages to shopping online.","chinese":"對很多中國人來說，網上購物的好處不可勝數。"},{"english":"And the angel of the LORD said unto her, I will multiply thy seed exceedingly, that it shall not be numbered for multitude.","chinese":"又說，我必使你的後裔極其繁多，甚至不可勝數。"},{"english":"The military equipment captured was beyond counting.","chinese":"繳獲的武器裝備不可勝數。"},{"english":"Chinese gardens are well known in the world and beautiful Chinese landscapes are too numerous to count.","chinese":"中國園林世界聞名，山水風景更是不可勝數。"},{"english":"There was no counting the number of birds that had died before his barrel.","chinese":"去世在他槍筒裏的鳥兒不可勝數。"},{"english":"Your servant is here among the people you have chosen, a great people, too numerous to count or number.","chinese":"僕人住在你所揀選的民中，這民多得不可勝數。"}],"related":[]}