{"definition":["keep silent\/not say a word"],"pinyin":["bu4 zuo4 sheng1"],"simplified":["不做声"],"rank":43416.0,"normalized_rank":0.6074461684832034,"fraction":2.7852531205256663e-7,"cumulative_fraction":0.9976110749685844,"word":"不做聲","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to do\/to make\/to produce\/to write\/to compose\/to act as\/to engage in\/to hold (a party)\/to be\/to become\/to function (in some capacity)\/to serve as\/to be used for\/to form (a bond or relationship)\/to pretend\/to feign\/to act a part\/to put on appearance"],"pinyin":["zuo4"],"word":"做"},{"definition":["sound\/voice\/tone\/noise\/reputation\/classifier for sounds"],"pinyin":["sheng1"],"word":"聲"}],"containing_words":[],"sentences":[{"english":"As often as I praised him for his hard work, he kept silent.","chinese":"每當我表揚他工作勤奮時，他總是默不做聲。"},{"english":"Now they were sullen.","chinese":"而現在，他們悶不做聲了。"},{"english":"He was silent, lowering his head.","chinese":"他這才低下頭不做聲了。"},{"english":"As I lay on the floor, I realized everyone was silent.","chinese":"當我躺在地板上時，我意識到大家都不做聲了。"},{"english":"His silence (signified) that he was unaware of what had happened.","chinese":"他的默不做聲就表明他沒有意識到發生了什麼。"},{"english":"They laughed,then fell silent abruptly.","chinese":"他們大笑了一陣，接着突然不做聲了。"},{"english":"Elizabeth said no more -- but her mind could not acquiesce.","chinese":"伊麗莎白不做聲了，可是她心裏依舊不敢贊同。"},{"english":"He looked at me in silent wonder.","chinese":"他驚訝地默不做聲地看着我。"},{"english":"The Vice President sits quietly.","chinese":"副總統坐在椅上，默不做聲。"},{"english":"34But they kept quiet because on the way they had argued about who was the greatest.","chinese":"門徒不做聲，因爲他們在路上彼此爭論誰爲大。"},{"english":"Messenger quietly silent, the answer is correct.","chinese":"使者默不做聲，答案是正確的。"},{"english":"Michael hears them and immediately becomes silent.","chinese":"Michael聽到了他們的聲音馬上不做聲了。"},{"english":"Elizabeth said no more -- but her mind could not  acquiesce.","chinese":"伊麗莎白不做聲了，可是她心裏依舊不敢贊同。"},{"english":"The mother is still not say a word, but more rocking sound of textile machines.","chinese":"這位老母仍不做聲，只不過紡織機搖得更響。"},{"english":"As she was putting on her earrings, though, I looked down and stopped short.","chinese":"妻子戴耳墜時，我有意向下看，不做聲。"},{"english":"They set up camp without saying much, picketed the horses in the meadow.","chinese":"他們默不做聲地安營紮寨，然後把馬牽到坡上去喫草。"}],"related":[]}