{"definition":["not only that, but ..."],"pinyin":["bu4 jin3 ru2 ci3"],"simplified":["不仅如此"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"不僅如此","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["barely\/only\/merely"],"pinyin":["jin3"],"word":"僅"},{"definition":["as\/as if\/such as"],"pinyin":["ru2"],"word":"如"},{"definition":["this\/these"],"pinyin":["ci3"],"word":"此"}],"containing_words":[],"sentences":[{"english":"It doesn’t matter who you are either. Jaydee always has a way of relating to you.","chinese":"不僅如此，不管你是誰，傑迪總有方法與你交往。"},{"english":"Not just that, it’s transformed the relationship with myself.","chinese":"不僅如此，也改善我自己與他人的關係。"},{"english":"But there is more to it than this. Marriage itself is a wealth-generating institution.","chinese":"不僅如此，婚姻本身就是一種產生財富的機制。"},{"english":"Moreover, his book had great historiography value yet.","chinese":"不僅如此，《說文引經考》還具有重要的史學價值。"},{"english":"Not only this, you also get the advantage of knowing whether the water is cold or hot.","chinese":"不僅如此，你還可以通過這款水龍頭知道水的冷熱。"},{"english":"Not only that, she is unable to walk and in a wheelchair.","chinese":"不僅如此，她還無法行走，只能坐輪椅。"},{"english":"Not only that, I realized that there is more for me when I saw the following hadith .","chinese":"不僅如此，當我看到以下聖訓時，發現它的意義更大。"},{"english":"What's more, Hanzhong is full of green and vitalities.","chinese":"不僅如此，漢中更是充滿的綠色，充滿了活力。"},{"english":"You’ll also save lots of money in storage and maintenance.","chinese":"不僅如此，你還在儲藏和維修上省了一筆不少的錢。"},{"english":"Not only that, but we are doing our heads in.","chinese":"不僅如此，我們還拖垮了我們的腦袋。"},{"english":"Close your eyes and you'll see more than that.","chinese":"合上秋水你會看到不僅如此。"},{"english":"Not only that, the infrastructure is extremely well managed.","chinese":"不僅如此，基礎設施的管理都相當地出色。"},{"english":"Also, you run the risk of becoming an addict.","chinese":"不僅如此，你還會冒着成爲癮君子的危險。"},{"english":"More than that, we create games around the law of gravity.","chinese":"不僅如此，我們利用定律發明遊戲。"},{"english":"Not only that, but they are also special friends to me.","chinese":"不僅如此，他們還是我特別親密的朋友。"},{"english":"Not only that, but your parents.","chinese":"不僅如此，還要孝敬父母。"}],"related":[]}