{"definition":["not very\/not particularly"],"pinyin":["bu4 zen3 me5"],"simplified":["不怎么"],"rank":12627.0,"normalized_rank":0.17666811243406602,"fraction":0.000005621160477572422,"cumulative_fraction":0.9475987290786632,"word":"不怎麼","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["how"],"pinyin":["zen3"],"word":"怎"},{"definition":["exclamatory final particle","interrogative final particle","suffix, used to form interrogative 什麼|什么[shen2 me5], what?, indefinite 這麼|这么[zhe4 me5] thus, etc","tiny\/insignificant"],"pinyin":["ma2","ma5","me5","mo2"],"word":"麼"}],"containing_words":[{"definition":["not up to much\/very indifferent\/nothing great about it\/nothing good to be said about it"],"pinyin":["bu4 zen3 me5 yang4"],"word":"不怎麼樣"}],"sentences":[{"english":"Patty minded his ridiculing less when her mother was the butt of it.","chinese":"如果她爸的嘲笑對象是她媽，帕蒂就不怎麼介意了。"},{"english":"Not very nice , goof lens and more.","chinese":"不怎麼好看，穿幫鏡頭多。"},{"english":"It didn't look very modern; the houses were huge and old looking.","chinese":"那看起來不怎麼現代，房子很大很古舊。"},{"english":"but with, you know, less cost, and probably even quality is not that high.","chinese":"卻只要更少的成本，雖然產品的質量可能不怎麼高。"},{"english":"It’s not appropriate to leave queues of taxpayers and go for lunch.","chinese":"放下排長隊的納稅人去喫午飯這實在是不怎麼合適。"},{"english":"\"We hardly get sick at all, \" Mrs McKamey says hopefully.","chinese":"“我們根本不怎麼得病，”麥克康美太太自我安慰說。"},{"english":"I don't think Linda appreciated my wisecracks .","chinese":"我看琳達好像不怎麼喜歡我的俏皮話。"},{"english":"Some people think that coasting is less fuel-efficient because it takes up fuel to start up the engine.","chinese":"有些人認爲滑行並不怎麼省油，因爲啓動引擎耗油。"},{"english":"He said such views could cause them 'not to care much about the dead babies.'","chinese":"他說，這樣的觀念可能使他們對死嬰不怎麼關心。"},{"english":"I don't normally blame anything on the refs.","chinese":"我一般不怎麼罵裁判。"},{"english":"They were not welcomed home very  cordially by their mother.","chinese":"到家以後，母親並不怎麼熱誠地歡迎她們。"},{"english":"They achieve clarity when they are faced with two not-great options.","chinese":"面對兩個都不怎麼樣的選擇，他們的想法會清晰起來。"},{"english":"Things like a two-year non-compete clause don't work well in China.","chinese":"有關兩年內非競爭條款在中國並不怎麼適用。"},{"english":"He sings terribly, out of tune now and then, but I still have to applaud.","chinese":"他唱得真不怎麼樣，經常走調，不過我還得鼓掌叫好。"},{"english":"I think I have heard that Mr Bingley has not much idea of ever returning to Netherfield again?","chinese":"我想我聽說過，彬格萊先生不怎麼打算再回尼日斐了？"},{"english":"It must work better for Chinese than it does for foreigners.","chinese":"促銷員對中國人更有用，外國人不怎麼有用。"}],"related":[]}