{"definition":["not good\/of no use"],"pinyin":["bu4 ji4"],"simplified":["不济"],"rank":21403.0,"normalized_rank":0.29945573853063395,"fraction":0.0000020762397868572607,"cumulative_fraction":0.9779624119443748,"word":"不濟","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["only used in 濟濟|济济[ji3 ji3]","to cross a river\/to aid or relieve\/to be of help","used in place names associated with the Ji River 濟水|济水[Ji3 Shui3]\/surname Ji"],"pinyin":["Ji3","ji3","ji4"],"word":"濟"}],"containing_words":[{"definition":["fate is unfavorable (idiom); the omens are not good"],"pinyin":["shi2 yun4 bu4 ji4"],"word":"時運不濟"},{"definition":["lit. slow no aid to urgent (idiom); slow measures will not address a critical situation\/too slow to meet a pressing need"],"pinyin":["huan3 bu4 ji4 ji2"],"word":"緩不濟急"},{"definition":["to have poor eyesight"],"pinyin":["yan3 shen2 bu4 ji4"],"word":"眼神不濟"}],"sentences":[{"english":"The lot of unwilling foreigners is far worse still.","chinese":"很多心不甘情不願的外國人的命運實在不濟。"},{"english":"None of the great composers had a more unfortunate talent-to-luck ratio than Franz Schubert.","chinese":"從沒有一個偉大的作曲家像舒伯特那樣的時運不濟。"},{"english":"The moles and birthmarks in these areas can indicate good fortune, or a lack of it.","chinese":"痣或胎記落到這些區域有可能象徵好運或時運不濟。"},{"english":"Calls for ever-greater United Nations effectiveness under conditions of poor financial situation make no sense.","chinese":"在財力不濟的情況下呼籲大聯合國的效率毫無意義。"},{"english":"It worked against Forlan. It should work in favor of Suarez.","chinese":"弗蘭時運不濟，但現在的時機非常適合蘇亞雷斯。"},{"english":"Old Mr Black loved shooting bears, but his eyes were not good any more.","chinese":"布萊克老先生酷愛獵熊，只是他的眼力已經不濟事了。"},{"english":"To all appearances he was just the commonplace planter who had fallen upon evil days .","chinese":"表面上看來，他完全是個時運不濟的普通種植園主。"},{"english":"Unprofitable eloquence is like the cypress, which is GREat and tall, but bears no fruit.","chinese":"無益雄辯不濟事，猶如柏樹參天不結果。"},{"english":"Too much spoils, too little is nothing.","chinese":"過多反壞事，太少不濟事。"},{"english":"Too abundance spoils, too less is nothing.","chinese":"太多會壞事，太少不濟事。"}],"related":[]}