{"definition":["nonalignment"],"pinyin":["bu4 jie2 meng2"],"simplified":["不结盟"],"rank":46109.0,"normalized_rank":0.6451247324164371,"fraction":2.141491786064545e-7,"cumulative_fraction":0.9982704712367712,"word":"不結盟","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]","knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)"],"pinyin":["jie1","jie2"],"word":"結"},{"definition":["oath\/pledge\/union\/to ally\/league, a subdivision corresponding to prefecture in Inner Mongolia"],"pinyin":["meng2"],"word":"盟"}],"containing_words":[{"definition":["Non-Aligned Movement (NAM)"],"pinyin":["Bu4 Jie2 meng2 Yun4 dong4"],"word":"不結盟運動"}],"sentences":[{"english":"A policy of neutrality or nonalignment in international affairs.","chinese":"國際事務中保持中立或不結盟的政策。"},{"english":"The nations of the Non-Aligned Movement were invited as well.","chinese":"不結盟運動的國家也受到邀請。"},{"english":"The new treaty embodies the aspirations of most nonaligned countries.","chinese":"新條約體現了大多數不結盟國家的願望。"},{"english":"Nonalignment is the part and parcel of that country's foreign policy.","chinese":"不結盟是那個國家外交政策的重要內容。"},{"english":"Our country pursues a policy of nonalignment.","chinese":"我國奉行不結盟政策。"},{"english":"The paper was divided into three parts to expatiate on and analyse the Chinese non-alignment foreign strategy.","chinese":"本文分三部分對中國不結盟外交戰略進行闡述和分析。"},{"english":"In sum, Myanmars foreign policy has really been neutral and nonaligned.","chinese":"總的來說，緬甸的對外政策確實是中立和不結盟的。"},{"english":"Envoys from mainly non-aligned developing nations were on the tour.","chinese":"參觀代表主要來自不結盟的發展中國家。"},{"english":"China diplomatic alliance underwent two stages from alliance to non-alliance.","chinese":"中國外交聯盟觀經歷了從結盟到不結盟兩個階段。"},{"english":"China is one advocates the nonaligned movement the country.","chinese":"中國是一個主張不結盟運動的國家。"},{"english":"The non-aligned group included countries that did not want to be tied to either the West or the East.","chinese":"包括不結盟國家集團的國家，不希望被束縛到西或東。"}],"related":[]}