{"definition":["unlikely to go so far as to\/not as bad as"],"pinyin":["bu4 zhi4 yu2"],"simplified":["不至于"],"rank":9420.0,"normalized_rank":0.1317980216305458,"fraction":0.000009146812121541808,"cumulative_fraction":0.9246665117356471,"word":"不至於","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to arrive\/most\/to\/until"],"pinyin":["zhi4"],"word":"至"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[],"sentences":[{"english":"Make sure you drink plenty to save-off dehydration .","chinese":"記得喝多點水纔不至於虛脫。"},{"english":"As the Scripture says, \"Anyone who trusts in him will never be put to shame.\"","chinese":"經上說，凡信他的人，必不至於羞愧。"},{"english":"And Nathan said unto David, The LORD also hath put away thy sin; thou shalt not die.","chinese":"拿單說，耶和華已經除掉你的罪，你必不至於死。"},{"english":"Now let me do it a second time to show you that -- I'm saying this poorly.","chinese":"還不至於如此呢，現在讓我再做一次給你們看。"},{"english":"I should know: For a few months, I was one of the suckers.","chinese":"如果早知道這些，我就不至於上他們幾個月的當了。"},{"english":"Desdemona. If you say so, I hope you will not kill me.","chinese":"苔絲狄蒙娜要是您這樣說，我希望您不至於把我殺死。"},{"english":"I am wiser than to believe what you call money talks.","chinese":"我不至於可笑到相信你所謂的金錢萬能的說法。"},{"english":"Rational fear is good - it stops us getting killed.","chinese":"合理的憂慮是好的，它讓我們不至於滅亡。"},{"english":"To avoid overfeeding, consider giving your dog low- or reduced-fat dairy products.","chinese":"爲了不至於餵過量，可以考慮使用低脂奶製品。"},{"english":"I will speak of your statutes before kings and will not be put to shame","chinese":"我也要在君王面前，論說你的法度，並不至於羞愧。"},{"english":"The kidney is in charge of the bones. Teeth are fixed, not to lose.","chinese":"腎主骨，牙齒固定，不至於擺動脫落。"},{"english":"All this I have told you so that you will not go astray.","chinese":"我已將這些事告訴你們，使你們不至於跌倒。"},{"english":"All iniquity is sin. And there is a sin unto death.","chinese":"任何的不義都是罪過，但也有不至於死的罪過。"},{"english":"Please remember that there is always a light lighting for you !","chinese":"還是買品牌的燈吧，不至於總爆管，換來換去恨麻煩。"},{"english":"Even if as for is not at a loss for words, also can only be ambiguous at least.","chinese":"即使不至於張口結舌，至少也只能含含糊糊。"},{"english":"I had a better command of English than to make such foolish mistakes.","chinese":"我的英語學得很好，不至於犯這樣愚蠢的錯誤。"}],"related":[]}