{"definition":["not to allow\/must not\/can't"],"pinyin":["bu4 xu3"],"simplified":["不许"],"rank":9512.0,"normalized_rank":0.13308522099254266,"fraction":0.00000899207583706816,"cumulative_fraction":0.9255008919690629,"word":"不許","characters":[{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["surname Xu","to allow\/to permit\/to promise\/to praise\/somewhat\/perhaps"],"pinyin":["Xu3","xu3"],"word":"許"}],"containing_words":[{"definition":["only the official is allowed to light the fire\/Gods may do what cattle may not\/quod licet Iovi, non licet bovi"],"pinyin":["zhi3 xu3 zhou1 guan1 fang4 huo3 , bu4 xu3 bai3 xing4 dian3 deng1"],"word":"只許州官放火，不許百姓點燈"}],"sentences":[{"english":"I forbid you to make a sortie today.","chinese":"你今天不許出擊。"},{"english":"No retreat is allowed, only advance.","chinese":"只許前進，不許後退。"},{"english":"No hunting is allowed in the preserve.","chinese":"在禁獵區內不許打獵。"},{"english":"It is required that nobody (should) smoke in the reading-room.","chinese":"按要求，誰都不許在閱覽室吸菸。"},{"english":"Drop the gun, and no funny stuff!","chinese":"放下槍，不許耍花樣。"},{"english":"Counseling or interjecting personal opinion is never permitted.","chinese":"翻譯過程中不許摻雜譯者的個人觀點在內。"},{"english":"This exam will last 2 hours, no one is allowed to leave until the bell rings.","chinese":"考試時間爲兩個小時，打鈴之前不許出考場。"},{"english":"I have read a sentence in an essay:Even Yangjia are put to death, please don't use any contumelious words on him.","chinese":"即使楊佳被判死刑，也不許用侮辱性的字眼。"},{"english":"The C.O.s tell them that they can’t park there.","chinese":"獄警告訴他們，這裏不許停車。"},{"english":"I will not have this slave-girl's son sharing the inheritance with my son Isaac.","chinese":"我不許這女奴的兒子分享我兒以撒的繼承權。"},{"english":"The officer allowed no soldiers to take any excuse for not carrying out his orders.","chinese":"警官不許可兵士爲不執行他地號令找任何捏詞。"},{"english":"First of all , don ' t come in here without teacher .","chinese":"首先，不許在沒有老師的情況下進入這裏。"},{"english":"The seventh day also shall be most solemn and holy unto you: you shall do no servile work therein.","chinese":"到第七日再召開聖會，一切勞工都不許做。"},{"english":"No scampering or scurrying. Understand, Little Chef?","chinese":"不許上下亂竄，懂嗎，小廚子？"},{"english":"Generally, hearsay is not permissible evidence in court.","chinese":"通常，道聽塗說在法庭上不許作爲證據。"},{"english":"She allowed him to hold her hand, but forbade him any intimacies.","chinese":"她讓他握着手，但不許他有過份親密的行動。"}],"related":[]}