{"definition":["world famous"],"pinyin":["shi4 jie4 wen2 ming2"],"simplified":["世界闻名"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"世界聞名","characters":[{"definition":["life\/age\/generation\/era\/world\/lifetime\/epoch\/descendant\/noble","surname Shi"],"pinyin":["Shi4","shi4"],"word":"世"},{"definition":["boundary\/scope\/extent\/circles\/group\/kingdom (taxonomy)"],"pinyin":["jie4"],"word":"界"},{"definition":["surname Wen","to hear\/news\/well-known\/famous\/reputation\/fame\/to smell\/to sniff at"],"pinyin":["Wen2","wen2"],"word":"聞"},{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"}],"containing_words":[],"sentences":[{"english":"There're many world-known historic in China I'd like to visit.","chinese":"中國有很多世界聞名的歷史古蹟，我想去看看。"},{"english":"The football team in frankfort is very famous in the world.","chinese":"法蘭克福的足球隊世界聞名。"},{"english":"Amsterdam has a world-famous red-light district .","chinese":"阿姆斯特丹有一個世界聞名的紅燈區。"},{"english":"The Bluenose built in Lunenburg is world famous.","chinese":"在盧嫩堡興建的布盧諾斯是世界聞名。"},{"english":"A world-famous violinist is playing at tonight's concert.","chinese":"一位世界聞名的小提琴家將在今晚的音樂會上演奏。"},{"english":"This major in my university is world famous.","chinese":"我校的這個專業世界聞名。"},{"english":"The Dazu Stone Carving is World-famous.","chinese":"大足石刻是世界聞名的。"},{"english":"Tivoli , founded in 1843, is a world-famous amusement park in downtown Copenhagen.","chinese":"建於1843年提沃利是世界聞名的娛樂公園。"},{"english":"Confucius a great thinker all over the world.","chinese":"其實，孔子是一位世界聞名的大思想家。"},{"english":"Chinese gardens are well known in the world and beautiful Chinese landscapes are too numerous to count.","chinese":"中國園林世界聞名，山水風景更是不可勝數。"},{"english":"You will see many exotic birds and of course the world famous alligators.","chinese":"你能見到很多有異國情調的鳥和世界聞名的鄂魚。"},{"english":"Get to France, see world to be known for the Ai non- Er iron pagoda.","chinese":"到法國，看看世界聞名埃非爾鐵塔。"},{"english":"He dreamed of being a world famous football player.","chinese":"他夢想成爲一名世界聞名的足球運動員。"},{"english":"There are over 20 world-famous thermal spa complexes and parks.","chinese":"現有20多家世界聞名的溫泉綜合場館和公園。"},{"english":"Do you know what Guanlan is famous for in the world?","chinese":"你知道不雅觀瀾有什麼在世界聞名？"},{"english":"They are commemorative coins, one in honour of the world famous giant pandas.","chinese":"那是紀念幣，一種是世界聞名的大熊貓命名的。"}],"related":[]}