{"definition":["thalamus"],"pinyin":["qiu1 nao3"],"simplified":["丘脑"],"rank":54558.0,"normalized_rank":0.7633372042589509,"fraction":8.583484459481612e-8,"cumulative_fraction":0.9994762842428526,"word":"丘腦","characters":[{"definition":["mound\/hillock\/grave\/classifier for fields","surname Qiu"],"pinyin":["Qiu1","qiu1"],"word":"丘"},{"definition":["brain\/mind\/head\/essence"],"pinyin":["nao3"],"word":"腦"}],"containing_words":[{"definition":["hypothalamus (anatomy)"],"pinyin":["xia4 qiu1 nao3"],"word":"下丘腦"},{"definition":["thalamic lesions"],"pinyin":["qiu1 nao3 sun3 shang1"],"word":"丘腦損傷"}],"sentences":[{"english":"Pressor response was induced by electrical stimulation of the hypothalamic defence area.","chinese":"電刺激下丘腦“防禦反應區”誘發升壓反應。"},{"english":"Objective To investigate new surgical method to treat hypertensive thalamic hematoma.","chinese":"目的探討高血壓丘腦出血外科治療的新方法。"},{"english":"The hypothalamus controls hormone secretions from the nearby pituitary gland.","chinese":"下丘腦控制附近腦下垂體分泌激素。"},{"english":"Only drink cold to stimulate the gastrointestinal tract, make the hypothalamus produces hunger.","chinese":"只能喝涼開水去刺激胃腸道，使得下丘腦產生飢餓感。"},{"english":"Objective To discuss and summarize the neuropsychological disorders of thalamic lesions.","chinese":"目的探討和總結丘腦損害的神經心理學障礙。"},{"english":"The spindles arise in the brain's sensory relay centre in the thalamus.","chinese":"這些紡錘波出現在丘腦，大腦的意識中繼站中。"},{"english":"Part of multi-angle cells labeled at the bottom of the epithalamic tetra-brain ventricle.","chinese":"下丘腦的四腦室底部標記到部分多角細胞。"},{"english":"A gliosis layer between the wall of tumor and the hypothalamus was seen.","chinese":"腫瘤與下丘腦間有膠質增生層。"},{"english":"Chen XH, Li DG. Serum gastrin level changes in patients with thalamic hemorrhage complicated with GI tract bleeding.","chinese":"目的探討丘腦出血伴消化道出血與血清胃液素的關係。"},{"english":"Objective To improve the microsurgical techniques for chiasmatic-hypothalamic glioma.","chinese":"目的提高視交叉下丘腦膠質瘤顯微手術治療水平。"},{"english":"Objective To study the clinical characteristics and effects of surgical treatment of children with thalamic tumors.","chinese":"目的研究兒童丘腦腫瘤的臨牀特徵和外科治療效果。"},{"english":"Objective To report an approach for removing the medial type of thalamic gliomas.","chinese":"目的探討一種切除內側型丘腦膠質瘤的手術入路。"},{"english":"The model of hypothalamic slices of rat in vitro was established.","chinese":"建立了大鼠下丘腦腦片培養實驗模型。"},{"english":"By being exposed to a smell all day long its tricking the hypothalamus.","chinese":"整天聞一種氣味，會使丘腦‘麻木’。"},{"english":"The anterior hypothalamus provides thermoregulation when the body is too hot.","chinese":"當人體過熱時，下丘腦前部可提供溫度調節作用。"},{"english":"By being exposed to a smell all day long it's tricking the hypothalamus.","chinese":"整天聞一種氣味，會使丘腦‘麻木’。"}],"related":[]}