{"definition":["to abandon"],"pinyin":["diu1 xia4"],"simplified":["丢下"],"rank":17017.0,"normalized_rank":0.23808990807717603,"fraction":0.000003277343700677239,"cumulative_fraction":0.9664733962446908,"word":"丟下","characters":[{"definition":["to lose\/to put aside\/to throw"],"pinyin":["diu1"],"word":"丟"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[{"english":"I would have carried him to the deepest part and dropped him in it.","chinese":"我會把他背到最深的地方然後把他丟下去。"},{"english":"Drop everything, cross that river, help your brothers.","chinese":"丟下手上的一切，越過那條河，去幫助我們的兄弟們。"},{"english":"Good mothers, I thought, do not abandon their sick children for work.","chinese":"我認爲好母親不會丟下生病的孩子去工作。"},{"english":"The boy dropped the apples he had stolen and cut away across the orchard.","chinese":"那個男孩丟下偷來的蘋果，飛快地穿過果園逃走了。"},{"english":"You will take all of your tequilas along with you, but discard me, will you?","chinese":"你會把你所有的龍舌蘭帶走，但是丟下我，是嗎？"},{"english":"The others run off in panic, leaving one of their prisoners behind.","chinese":"其餘的丟下一個俘虜倉惶逃走。"},{"english":"Where do I begin to tell the story of how my mother left me?","chinese":"我老媽丟下我的事兒該從何說起呢？"},{"english":"Thank each lit the la, not leave all the lonely people.","chinese":"感謝每一盞亮着的燈，沒有丟下所有孤寂的人。"},{"english":"No me dejes solo.","chinese":"不要丟下我一個人。"},{"english":"Several years later, Zhang Kan alas a disease, leaving a hard to make ends meet youngest.","chinese":"過了幾年，張堪一病嗚呼，丟下一家老小艱辛度日。"},{"english":"Because my father dumped me.","chinese":"我老爸嫌棄我，現在泰勒也丟下了我。"},{"english":"At that time I thought that the father is that cruel-hearted, to work, has thrown down me.","chinese":"當時我覺得父親是那麼狠心，爲了工作，丟下了我。"},{"english":"The man bunked off and left his wife with three children.","chinese":"那個男人已離家出走，丟下妻予和三個孩子。"},{"english":"She dropped the water treatment and everything else, and pinned her faith to Pain-killer .","chinese":"她丟下水療法和別的，一心把希望寄託在這止痛藥上。"},{"english":"So, I under the scorching sun, leaving the children fever is conducting home visits.","chinese":"於是，我頂着烈日，丟下正感冒發燒的孩子進行家訪。"},{"english":"If an aircraft drops a high-explosive bomb on a ship, it won't be as effective.","chinese":"如果飛機丟下高爆炸彈在一艘船上，它將不如此有效。"}],"related":[]}