{"definition":["to impose an additional penalty"],"pinyin":["bing4 chu3"],"simplified":["并处"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"並處","characters":[{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge"],"pinyin":["bing4"],"word":"並"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"those who do not make the corrections within the time limit, shall be ordered to stop construction, and can be imposed with penalty simultaneously.","chinese":"逾期不改正的，責令停止施工，可以並處罰款。"},{"english":"If the circumstances are especially serious, the offender shall be sentenced to death, and concurrently be sentenced to confiscation of property.","chinese":"情節特別嚴重的，處死刑，並處沒收財產。"},{"english":"If the circumstances are especially serious, the offender shall be sentenced to life imprisonment, and concurrently be sentenced to confiscation of property.","chinese":"情節特別嚴重的，處無期徒刑，並處沒收財產。"},{"english":"The regulator barred him from working in the fund industry and fined him 300,000 yuan.","chinese":"監管機構禁止他在基金業工作，並處罰款30萬元。"},{"english":"Whoever commits any of the crimes mentioned in thisChapter may concurrently be sentenced to confiscation of property.","chinese":"犯本章之罪的，可以並處沒收財產。"}],"related":[]}