{"definition":["to advance together"],"pinyin":["bing4 jin4"],"simplified":["并进"],"rank":27210.0,"normalized_rank":0.38070320260797785,"fraction":0.000001213803967356966,"cumulative_fraction":0.9872566040998436,"word":"並進","characters":[{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge"],"pinyin":["bing4"],"word":"並"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[{"definition":["to go forward together (idiom); to undertake simultaneous tasks\/going hand in hand"],"pinyin":["qi2 tou2 bing4 jin4"],"word":"齊頭並進"}],"sentences":[{"english":"Refactoring goes hand in hand with automated testing.","chinese":"重構與自動化測試是攜手並進的。"},{"english":"Schools and universities have been unable to keep up.","chinese":"學校的教育無法與時並進。"},{"english":"Their troops advanced by both land and water, and arrived at the front in time.","chinese":"他們的部隊水陸並進，及時抵達前線。"},{"english":"A multipronged approach could address that dilemma. Like Mr.","chinese":"或許多頭並進的手段可以化解這個難題。"},{"english":"Horse Racing and Thoroughbred Sales go hand in hand at Magic Millions.","chinese":"賽馬及良種銷售齊頭並進，在魔術數百萬人。"},{"english":"The right way to reduce our excess nuclear forces is in parallel with Russia.","chinese":"減少我們過剩核力量的正確途徑是與俄羅斯齊頭並進。"},{"english":"With its instant coffee line, Starbucks is doing both.","chinese":"伴隨着速溶咖啡生產現，星巴克正在兩腿並進。"},{"english":"Work and rest go together, hand in hand.","chinese":"工作和休息齊頭並進，相得益彰。"},{"english":"And it does not align IT and the business.","chinese":"而且它不能讓IT與業務保持齊頭並進。"},{"english":"No matter how the international landscape may evolve, China and the EU should always join hands and forge ahead like passengers in the same boat.","chinese":"不管國際風雲如何變幻，中歐要同舟共濟，攜手並進。"},{"english":"At the end of the fourth lap, Sun Mei and I were neck and neck.","chinese":"在第四圈的最後一段，孫梅和我齊頭並進。"},{"english":"We will create excellence hand in hand with you.","chinese":"福瑞人將與您攜手並進，共創佳績。"},{"english":"This invisibility effect will slowly wear off with the sim becoming more solid as time progresses.","chinese":"這個隱形效果會慢慢減弱，與時並進辛變得更加牢固。"},{"english":"They travel in tight packs, sometimes as many as 20 abreast.","chinese":"他們密集穿行，有時候多達20輛車齊頭並進。"},{"english":"Conservation and development can go hand in hand.","chinese":"保護和開發可以聯手並進。"},{"english":"Wonderful light hidden ghee factory with you hand in hand, create beautiful future.","chinese":"妙光藏酥油廠與大家攜手並進，共創美好未來。"}],"related":[{"definition":["to launch\/to develop\/to unfold\/(of an exhibition etc) to open"],"pinyin":["kai1 zhan3"],"word":"開展"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to make progress\/to do better\/fig. ambitious to improve oneself\/to move forwards"],"pinyin":["shang4 jin4"],"word":"上進"},{"definition":["one step further\/to move forward a step\/further onwards"],"pinyin":["jin4 yi1 bu4"],"word":"進一步"},{"definition":["less advanced\/underdeveloped\/lagging behind\/the younger generation\/the less experienced ones"],"pinyin":["hou4 jin4"],"word":"後進"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"},{"definition":["active\/energetic\/vigorous\/positive (outlook)\/proactive"],"pinyin":["ji1 ji2"],"word":"積極"},{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"word":"實踐"},{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"word":"協助"},{"definition":["to unfold\/to carry out\/to be in full swing\/to launch"],"pinyin":["zhan3 kai1"],"word":"展開"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落實"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引領"},{"definition":["operation\/action\/CL:個|个[ge4]\/to move about\/mobile"],"pinyin":["xing2 dong4"],"word":"行動"},{"definition":["to start (a machine)\/(fig.) to set in motion\/to launch (an operation)\/to activate (a plan)"],"pinyin":["qi3 dong4"],"word":"啟動"}]}