{"definition":["Central Plain, the middle and lower regions of the Yellow river, including Henan, western Shandong, southern Shanxi and Hebei"],"pinyin":["Zhong1 yuan2"],"simplified":["中原"],"rank":5643.0,"normalized_rank":0.0789528913016104,"fraction":0.00002015615278421501,"cumulative_fraction":0.8730929487023626,"word":"中原","characters":[{"definition":["China\/Chinese\/surname Zhong","to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right"],"pinyin":["Zhong1","zhong1","zhong4"],"word":"中"},{"definition":["Hara (Japanese surname)","former\/original\/primary\/raw\/level\/cause\/source"],"pinyin":["Yuan2","yuan2"],"word":"原"}],"containing_words":[{"definition":["Zhongyuan District of Zhengzhou City 鄭州市|郑州市[Zheng4 zhou1 Shi4], Henan"],"pinyin":["Zhong1 yuan2 Qu1"],"word":"中原區"},{"definition":["lit. hunting deer in the Central Plain (idiom)\/fig. to attempt to seize the throne"],"pinyin":["zhu2 lu4 Zhong1 yuan2"],"word":"逐鹿中原"},{"definition":["One-China principle, the official doctrine that Taiwan is a province of China"],"pinyin":["yi1 zhong1 yuan2 ze2"],"word":"一中原則"},{"definition":["Chung Yuan Christian University, in Taiwan"],"pinyin":["Zhong1 yuan2 Da4 xue2"],"word":"中原大學"},{"definition":["to plan to seize power of the whole country (idiom)"],"pinyin":["wen4 ding3 Zhong1 yuan2"],"word":"問鼎中原"}],"sentences":[{"english":"Hungarians have had the ambition of becoming the masters of the Central Plains for many years.","chinese":"北方的匈奴多年來一直有入主中原的野心。"},{"english":"The arrival of Princess Wen Cheng and promote Tibetan culture, the integration of clothing with the Central Plains.","chinese":"文成公主的到來，推動了藏族服飾同中原文化的融合。"},{"english":"After the late Tang dynasty, there were no new grottos appeared in northern China.","chinese":"晚唐以後，北方中原已經沒有石窟造像作品出現。"},{"english":"Previously, in her eyes he only China Merchants traveled in Western and other places.","chinese":"以前，在她眼裏他只是中原的茶商輾轉在西域等地。"},{"english":"Zhongyuan the time famine serious, extremely sharp class contradictions.","chinese":"其時中原災荒嚴重，階級矛盾極度尖銳。"},{"english":"Tengyue Supernatural Horse Art epitomizes the essences of the local art of the Central Plains and Yunnan Province in China.","chinese":"騰越神馬藝術集中了中原及雲南本土藝術的精華。"},{"english":"Using buffered factor could check and measure the content of fumet of passionflower juice.","chinese":"利用緩衝係數也可檢測西番蓮果汁飲料中原汁含量。"},{"english":"The hydrogeologic situation and the distribution of major oil region in Zhongyuan Oilfield are introduced.","chinese":"介紹了中原油田的水文地質概況及主要油區的分佈。"},{"english":"Before it occurs, a number of schools compete for the domination of a given field.","chinese":"在它發生之前，這一領域中有許多學派在逐鹿中原。"},{"english":"During Xia, Shang and Zhou dynasties, Central Plains lay the core of Chinese civilization.","chinese":"夏商周三代文明，中原獨領風騷，居於全國中樞地位。"},{"english":"Lisao is characteristic of Chu Culture on outside and have inside essence of Yellow River Culture on north China.","chinese":"《離騷》有楚文化的外部特徵和中原文化的內在實質。"},{"english":"\"The 7 draft\" broke our country market zhongyuan some balance.","chinese":"“第七稿”打破了我國快遞市場中原有的平衡。"},{"english":"Summer is also possible to enter from the West, then East and West converge in the Central Plains Xia and Shang.","chinese":"也有可能夏從西部進入，後來夏商東西匯合於中原。"},{"english":"\"Barbarian\" is the Chinese people on behalf of the Central Plains culture of non-denial and contempt.","chinese":"“夷”代表的是國人對非中原文化的否認與輕視。"},{"english":"Kobe, you are a big rubbish, please get into the rubbish bin.","chinese":"秦中原，你是一個大垃圾，請趕快跳進垃圾桶裏。"},{"english":"It is coarse ores sediment in cyanide leaching tank and cause much lose of gold.","chinese":"中原冶煉廠氰化槽有大粒礦沉積，造成大量金損失。"}],"related":[{"definition":["Western Regions (Han Dynasty term for regions beyond Yumen Pass 玉門關|玉门关[Yu4 men2 Guan1])"],"pinyin":["Xi1 yu4"],"word":"西域"},{"definition":["Outer Mongolia (lit. north of the Gobi Desert)"],"pinyin":["Mo4 bei3"],"word":"漠北"},{"definition":["Sino-Turkish"],"pinyin":["zhong1 tu3"],"word":"中土"},{"definition":["ethnic groups in the north and west of China in ancient times\/foreigner\/barbarian"],"pinyin":["hu2 ren2"],"word":"胡人"},{"definition":["beyond the Great Wall"],"pinyin":["sai4 wai4"],"word":"塞外"},{"definition":["Sichuan\/originally two provinces of Qin and Han"],"pinyin":["Ba1 shu3"],"word":"巴蜀"},{"definition":["Inner Mongolia (lit. south of the Gobi Desert)"],"pinyin":["Mo4 nan2"],"word":"漠南"},{"definition":["the Tang dynasty (618-907)"],"pinyin":["Da4 Tang2"],"word":"大唐"},{"definition":["common term for non-Han peoples in former times, not exclusively derogatory\/barbarian"],"pinyin":["man2 yi2"],"word":"蠻夷"},{"definition":["Youzhou, ancient province in north Hebei and Liaoning\/Fanyang 範陽|范阳 ancient city near modern Beijing"],"pinyin":["You1 zhou1"],"word":"幽州"},{"definition":["Han Chinese person or people"],"pinyin":["Han4 ren2"],"word":"漢人"},{"definition":["Guanzhong plain in Shaanxi, valley of the Wei River 渭河"],"pinyin":["Guan1 zhong1"],"word":"關中"},{"definition":["Liangzhou district of Wuwei city 武威市[Wu3 wei1 shi4], Gansu"],"pinyin":["Liang2 zhou1"],"word":"涼州"},{"definition":["beyond the pass, i.e. the region north and east of Shanhai Pass 山海關|山海关[Shan1 hai3 guan1] or the region west of Jiayu Pass 嘉峪關|嘉峪关[Jia1 yu4 guan1] or both"],"pinyin":["Guan1 wai4"],"word":"關外"},{"definition":["Qidan or Khitan, ethnic group in ancient China, a branch of the Eastern Hu people inhabiting the valley of the Xar Murun River in the upper reaches of the Liao River 遼河|辽河[Liao2 He2]"],"pinyin":["Qi4 dan1"],"word":"契丹"},{"definition":["river bend","the Great Bend of the Yellow River in Inner Mongolia"],"pinyin":["He2 tao4","he2 tao4"],"word":"河套"}]}