{"definition":["neutralizing agent\/neutralizer"],"pinyin":["zhong1 he2 ji4"],"simplified":["中和剂"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"中和劑","characters":[{"definition":["China\/Chinese\/surname Zhong","to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right"],"pinyin":["Zhong1","zhong1","zhong4"],"word":"中"},{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["dose (medicine)"],"pinyin":["ji4"],"word":"劑"}],"containing_words":[],"sentences":[{"english":"With the neutralizer and use a better effect.","chinese":"與中和劑並用效果更佳。"},{"english":"Containing fingerprint neutralising agent, which prevent corrosion from finger etching.","chinese":"含指紋中和劑，能防止因指紋印汗液所做成的腐蝕。"},{"english":"Some compound neutralizers may change in property after autoclaving.","chinese":"有的複方中和劑在壓力蒸汽滅菌後性能可發生變化。"},{"english":"The dosage of neutralizer is closely related to the dosage of disinfectant to be neutralized.","chinese":"中和劑用量與中和消毒劑量間有較密切的關係。"},{"english":"Conclusion: The results of modified neutralizer appraisal test fulfilled the design requirement.","chinese":"結論，改進的中和劑鑑定試驗結果符合設計要求。"}],"related":[]}