{"definition":["the middle stretches of a river\/middle level\/middle echelon\/midstream"],"pinyin":["zhong1 you2"],"simplified":["中游"],"rank":14550.0,"normalized_rank":0.20357337735928246,"fraction":0.0000043736356784103485,"cumulative_fraction":0.9571174701508276,"word":"中游","characters":[{"definition":["China\/Chinese\/surname Zhong","to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right"],"pinyin":["Zhong1","zhong1","zhong4"],"word":"中"},{"definition":["surname You","to swim\/variant of 遊|游[you2]"],"pinyin":["You2","you2"],"word":"游"}],"containing_words":[],"sentences":[{"english":"The survivors wandered about the jungle for days before being picked up by a search party.","chinese":"倖存者在叢林中游蕩了好幾天，才被搜索隊救出來。"},{"english":"Each rive has its upward, middle and backward part.","chinese":"每條河流都有上游，中游和下游。"},{"english":"The middle stretch of the Yangtze is a natural transportation and communications nexus.","chinese":"該地區位於長江中游，是天然的運輸與通訊會合點。"},{"english":"Lyon slipped to third place, three points behind PSG.","chinese":"馬賽滑落至積分榜中游，7分落後第三名里爾。"},{"english":"Lingered upon the pools that stand in drains.","chinese":"在腔池中游向暗溝去幹嘛。"},{"english":"Fetal DNA in maternal plasma could be regarded as the gene resource for noninvasive prenatal diagnosis.","chinese":"孕婦血漿中游離胎兒DNA可以用於無創傷產前診斷。"},{"english":"Fung is the origin of the Yangtze River middle reaches, stone house culture river phoenix.","chinese":"鳳的起源地是在長江中游，石家河文化的鳳。"},{"english":"There are at least nine physiographic cycles in the middle reaches of the Yellow River during the Late Cenozoic Era.","chinese":"在晚新生代黃河中游至少存在九個地文期旋迴。"},{"english":"The migration of this period has some characteristics, which infected the social development of the region.","chinese":"這個時期的移民影響了沅水中游地區的社會發展。"},{"english":"The grass swimming fish and shrimp, let the ducks grew fat and strong.","chinese":"草叢中游動着魚和蝦，讓鴨兒漸漸胖壯起來。"},{"english":"A sea of tourists walks passed the Shaolin Temple in Henan Province.","chinese":"河南少林寺中游人如潮。"},{"english":"The fish would swim in the seas and birds of every color and size would fly in the sky.","chinese":"於是有魚在水中游，各樣的鳥兒在空中飛。"},{"english":"It is the ravening lion roaming the earth seeking whom it may devour.","chinese":"它就像荒野中游蕩的獅子，在尋找可以吞食的獵物。"},{"english":"The influence in the upper reaches is larger than the lower stream.","chinese":"而且，上中游河段受影響大於下游。"},{"english":"Determination of total free-amino acid in tea by Nihydrin colorimetry;","chinese":"利用茚三酮比色法測定出牛肉中游離氨基酸含量。"},{"english":"Midstream means the transportation of new oil by ship routes and pipelines.","chinese":"中游是指通過船運和管道運輸新開採的石油。"}],"related":[{"definition":["lower reaches (of a river)\/lower level\/lower echelon\/downstream"],"pinyin":["xia4 you2"],"word":"下游"},{"definition":["upper reaches (of a river)\/upper level\/upper echelon\/upstream"],"pinyin":["shang4 you2"],"word":"上游"},{"definition":["western part"],"pinyin":["xi1 bu4"],"word":"西部"},{"definition":["main stream (of a river)"],"pinyin":["gan4 liu2"],"word":"幹流"},{"definition":["the east\/eastern part"],"pinyin":["dong1 bu4"],"word":"東部"},{"definition":["tributary (river)"],"pinyin":["zhi1 liu2"],"word":"支流"},{"definition":["really\/after all\/details\/particulars"],"pinyin":["duan1 di4"],"word":"端的"},{"definition":["the very front"],"pinyin":["qian2 lie4"],"word":"前列"},{"definition":["to rank (1st, 2nd etc)\/ranking"],"pinyin":["pai2 ming2"],"word":"排名"},{"definition":["to go forward together (idiom); to undertake simultaneous tasks\/going hand in hand"],"pinyin":["qi2 tou2 bing4 jin4"],"word":"齊頭並進"},{"definition":["river basin\/valley\/drainage area"],"pinyin":["liu2 yu4"],"word":"流域"},{"definition":["Nananqu district of central Chongqing municipality, formerly in Sichuan"],"pinyin":["Nan2 an4"],"word":"南岸"},{"definition":["middle section\/middle period\/middle area\/mid-"],"pinyin":["zhong1 duan4"],"word":"中段"},{"definition":["faucet\/water tap\/bicycle handle bar\/chief (esp. of gang)\/boss\/decision maker\/(market) leader (of companies)\/front end of mud-flow\/figurehead on prow of dragon boat 龍船|龙船"],"pinyin":["long2 tou2"],"word":"龍頭"},{"definition":["riverbed"],"pinyin":["he2 chuang2"],"word":"河床"},{"definition":["level (of achievement etc)\/standard\/level (surveying)"],"pinyin":["shui3 zhun3"],"word":"水準"}]}