{"definition":["Sino-Japanese relations"],"pinyin":["Zhong1 Ri4 guan1 xi4"],"simplified":["中日关系"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"中日關係","characters":[{"definition":["China\/Chinese\/surname Zhong","to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right"],"pinyin":["Zhong1","zhong1","zhong4"],"word":"中"},{"definition":["abbr. for 日本[Ri4 ben3], Japan","sun\/day\/date, day of the month"],"pinyin":["Ri4","ri4"],"word":"日"},{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["Guan1","guan1"],"word":"關"},{"definition":["to connect\/to relate to\/to tie up\/to bind\/to be (literary)"],"pinyin":["xi4"],"word":"係"}],"containing_words":[],"sentences":[{"english":"Wen said parliamentary exchanges are a vital part of Japan-China ties.","chinese":"溫家寶表示，議會交流是中日關係的重要組成部分。"},{"english":"Both sides mainly exchanged in-depth opinions on China-Japan relations.","chinese":"雙方着重就中日關係問題深入交換了意見。"},{"english":"At present, Sino-Japanese economic ties are not heating up along with cold political ties.","chinese":"當今中日關係的現狀是“政溫經不熱”。"},{"english":"Abe's resignation will have little impact on Sino-Japanese relations, Liu said.","chinese":"劉江勇認爲，安倍的辭職對中日關係的影響微乎其微。"},{"english":"What progress does China expect to get in China-Japan relations?","chinese":"中方希望中日關係取得什麼樣的進展？"},{"english":"Yang also took questions form the journalists on China-Japan relations and the Korean Peninsula nuclear issue.","chinese":"楊潔篪還就中日關係和朝核問題回答了記者提問。"},{"english":"Non-governmental exchanges have always been the driving force of Sino-Japanese relations.","chinese":"民間交流始終是中日關係發展的推動力。"},{"english":"Tang Jiaxuan expressed his welcome to Nobutaka Machimura for his visit to China at the time when China-Japan relations are falling into a plight.","chinese":"唐家璇歡迎町村在中日關係出現困難之際訪華。"},{"english":"What will happen to the relationship of CHN &JP?","chinese":"這對中日關係將帶來什麼啊？"},{"english":"But there is more than that. Jiangsu has a special association with China-Japan relations deeply rooted in history.","chinese":"特別是，江蘇與中日關係有着深厚的淵源。"},{"english":"China reiterated its positions and propositions concerning the Sino-Japanese relations.","chinese":"中方重申了對中日關係有關問題的看法和主張。"},{"english":"How will this kind of cultural exchanges help to improve and develop China-Japan relations?","chinese":"這類文化交流活動對改善和發展中日關係有何幫助？"},{"english":"Historical problems are important factors affecting Sino-Japan relations.","chinese":"歷史問題一直是影響中日關係的重要因素。"},{"english":"On the China-Japan relationship, both countries have the problem of public opinionguidance.","chinese":"在中日關係問題上，兩國同樣存在着輿論導向問題。"},{"english":"Since then, China-Japan relations have come a long way.","chinese":"從那時以來，中日關係在各個領域都取得長足發展。"},{"english":"The upshot is that traditionally strained relations between Japan and China look set for a sharp improvement.","chinese":"作爲“報李”之舉，過去緊張的中日關係迅速升溫。"}],"related":[{"definition":["Los Angeles Times"],"pinyin":["Luo4 shan1 ji1 Shi2 bao4"],"word":"洛杉磯時報"},{"definition":["fascism"],"pinyin":["fa3 xi1 si1 zhu3 yi4"],"word":"法西斯主義"},{"definition":["foreign news media"],"pinyin":["wai4 guo2 mei2 ti3"],"word":"外國媒體"},{"definition":["baker"],"pinyin":["mian4 bao1 shi1 fu4"],"word":"麵包師傅"},{"definition":["Homo economicus"],"pinyin":["jing1 ji4 ren2"],"word":"經濟人"},{"definition":["Hundred Days Reform (1898), failed attempt to reform the Qing dynasty"],"pinyin":["Wu4 xu1 Bian4 fa3"],"word":"戊戌變法"},{"definition":["Yuan T. Lee (1936-), Taiwanese-born Chemist and Nobel Prize winner in 1986"],"pinyin":["Li3 Yuan3 zhe2"],"word":"李遠哲"},{"definition":["North and South Korea\/bilateral Korean relations"],"pinyin":["Han2 Chao2"],"word":"韓朝"},{"definition":["leadership"],"pinyin":["zhu3 dao3 xing4"],"word":"主導性"},{"definition":["eugenics"],"pinyin":["you1 sheng1 xue2"],"word":"優生學"},{"definition":["political climate"],"pinyin":["zheng4 zhi4 qi4 hou4"],"word":"政治氣候"},{"definition":["Taichung or Taizhong county in central Taiwan"],"pinyin":["Tai2 zhong1 xian4"],"word":"台中縣"},{"definition":["principle of people's livelihood, the third of Dr Sun Yat-sen's 孫中山|孙中山 Three Principles of the People 三民主義|三民主义 (at the time, meaning redistribution of wealth, self-sufficiency and internal trade)"],"pinyin":["min2 sheng1 zhu3 yi4"],"word":"民生主義"},{"definition":["caseworker\/social worker"],"pinyin":["she4 hui4 gong1 zuo4 zhe3"],"word":"社會工作者"},{"definition":["Yomiuri Shimbun (Japanese newspaper)"],"pinyin":["Du2 mai4 Xin1 wen2"],"word":"讀賣新聞"},{"definition":["postcolonial"],"pinyin":["hou4 zhi2 min2"],"word":"後殖民"}]}