{"definition":["the treaty of 1923 normalizing relations between the Soviet Union and the Northern Warlord government of China"],"pinyin":["Zhong1 Su1 jie3 jue2 xuan2 an4 da4 gang1 xie2 ding4"],"simplified":["中苏解决悬案大纲协定"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"中蘇解決懸案大綱協定","characters":[{"definition":["China\/Chinese\/surname Zhong","to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right"],"pinyin":["Zhong1","zhong1","zhong4"],"word":"中"},{"definition":["Perilla frutescens (Chinese basil or wild red basil)\/place name\/to revive\/used as phonetic in transliteration","surname Su\/abbr. for Soviet Union 蘇維埃|苏维埃 or 蘇聯|苏联\/abbr. for Jiangsu province 江蘇|江苏\/abbr. for Suzhou city 蘇州|苏州"],"pinyin":["Su1","su1"],"word":"蘇"},{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","surname Xie","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","to transport under guard"],"pinyin":["Xie4","jie3","jie4","xie4"],"word":"解"},{"definition":["to decide\/to determine\/to execute (sb)\/(of a dam etc) to breach or burst\/definitely\/certainly"],"pinyin":["jue2"],"word":"決"},{"definition":["to hang or suspend\/to worry\/public announcement\/unresolved\/baseless\/without foundation"],"pinyin":["xuan2"],"word":"懸"},{"definition":["(legal) case\/incident\/record\/file\/table"],"pinyin":["an4"],"word":"案"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["head rope of a fishing net\/guiding principle\/key link\/class (taxonomy)\/outline\/program"],"pinyin":["gang1"],"word":"綱"},{"definition":["to cooperate\/to harmonize\/to help\/to assist\/to join"],"pinyin":["xie2"],"word":"協"},{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"}],"containing_words":[],"sentences":[],"related":[]}