{"definition":["Chinese and Western medicine\/a doctor trained in Chinese and Western medicine"],"pinyin":["zhong1 xi1 yi1"],"simplified":["中西医"],"rank":21729.0,"normalized_rank":0.3040169014872749,"fraction":0.000002012447563918597,"cumulative_fraction":0.9786282988157844,"word":"中西醫","characters":[{"definition":["China\/Chinese\/surname Zhong","to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right"],"pinyin":["Zhong1","zhong1","zhong4"],"word":"中"},{"definition":["the West\/abbr. for Spain 西班牙[Xi1 ban1 ya2]\/Spanish","west"],"pinyin":["Xi1","xi1"],"word":"西"},{"definition":["medical\/medicine\/doctor\/to cure\/to treat"],"pinyin":["yi1"],"word":"醫"}],"containing_words":[{"definition":["to combine traditional Chinese and Western medicine"],"pinyin":["Zhong1 Xi1 yi1 jie2 he2"],"word":"中西醫結合"}],"sentences":[{"english":"To explore traditional chinese and western medicine treatment methods anorectal prolapse.","chinese":"探討中西醫治療肛管直腸脫垂的方法。"},{"english":"However, it also encountered several problems on the way of development.","chinese":"但中西醫結合在發展的道路上也遇到了若干問題。"},{"english":"Objective To explore the treatment perscription with the method of integrated traditional and western medicine in type 2 diabetes.","chinese":"目的探討2型糖尿病中西醫結合治療方案。"},{"english":"Resultantly , the gastric cancer postoperative complications were successfully treated with the combination of Chinese and Western medicine.","chinese":"中西醫結合治療成功控制此胃癌術後併發症的案例。"},{"english":"Surgery of integrated Chinese and Western medicine is a clinical discipline that attaches great importance to practice.","chinese":"中西醫結合外科學是一門實踐性極強的臨牀學科。"},{"english":"Objective To investigate the clinical efficacy of treating tubal reghancy with combined therapy of Chinese and western medicine.","chinese":"目的探討中西醫結合治療輸卵管妊娠的臨牀療效。"},{"english":"OBJECTIVE To observe the effect of traditional Chinese medicine combined with western medicine on treatment muscular asthenopia.","chinese":"目的觀察用中西醫結合方法治療肌性視疲勞的療效。"},{"english":"Objective To observe the therapeutic effect of Banxiaxiexin decoction combined with Mosapride tablets in treating functional dyspepsia.","chinese":"目的觀察中西醫結合治療功能性消化不良的療效。"},{"english":"We observed the effect of integrative medical treatment in therapy group and simply isosorbide dinitrate treatment in control group.","chinese":"對中西醫結合方法和單純服用消心痛的療效進行觀察。"},{"english":"To explore the clinical effect of Chinese medicine combined with western medicine in treating lymphoid tuberculosis.","chinese":"目的探討中西醫治療淋巴結核的臨牀療效。"},{"english":"Objective To explore how to increase cure rate of hemorrhagic necrotizing pancreatitis.","chinese":"中西醫結合治療急性壞死性筋膜炎能取得良好的療效。"},{"english":"Conclusion There is a definite effect of combined Chinese and western medicine of primary nephrosis syndrom.","chinese":"結論中西醫結合治療原發性腎病綜合徵療效確切。"},{"english":"Objective To observe the therapeutic effects of two kinds of methods on erysipelas. Methods One hundred and four cases were arranged to two groups.","chinese":"目的觀察中西醫結合方法治療丹毒的臨牀效果。"},{"english":"Objective Treatment of Chinese and Western Medicine Chest to explore effective means of heartache.","chinese":"目的探索中西醫結合治療胸痹心痛的有效手段。"},{"english":"Objective To compare the effectiveness of integrated Chinese and Westen medicine on bed pressure with that of conventional method.","chinese":"目的比較中西醫結合方法與傳統方法治療壓瘡的療效。"},{"english":"Objective To observe the effect of Chinese and western medical film on operculitis of submaxilla wisdom tooth.","chinese":"目的觀察中西醫藥膜治療下頜智齒冠周炎的效果。"}],"related":[{"definition":["holistic diagnosis and treatment (TCM)"],"pinyin":["bian4 zheng4 lun4 zhi4"],"word":"辨證論治"},{"definition":["to investigate"],"pinyin":["bian4 zheng4"],"word":"辨證"},{"definition":["interpretation of the cause\/onset and process of an illness\/pathogenesis"],"pinyin":["bing4 ji1"],"word":"病機"},{"definition":["(TCM) the four methods of diagnosis, namely 望診|望诊[wang4 zhen3] (observation), 聞診|闻诊[wen2 zhen3] (auscultation and olfaction), 問診|问诊[wen4 zhen3] (interrogation), 切診|切诊[qie4 zhen3] (pulse feeling and palpation)"],"pinyin":["si4 zhen3"],"word":"四診"},{"definition":["prognosis"],"pinyin":["yu4 hou4"],"word":"預後"},{"definition":["symptom (of a disease)"],"pinyin":["bing4 zhuang4"],"word":"病狀"},{"definition":["minimally invasive surgery"],"pinyin":["wei1 chuang1 shou3 shu4"],"word":"微創手術"},{"definition":["(TCM) interrogation, one of the four methods of diagnosis 四診|四诊[si4 zhen3]"],"pinyin":["wen4 zhen3"],"word":"問診"},{"definition":["retort with challenging questions\/debate"],"pinyin":["bian4 nan4"],"word":"便難"},{"definition":["to treat the symptoms\/reactive (rather than proactive)"],"pinyin":["tou2 tong4 yi1 tou2"],"word":"頭痛醫頭"},{"definition":["theoretical foundation"],"pinyin":["li3 lun4 ji1 chu3"],"word":"理論基礎"},{"definition":["consultation (medical)\/to meet for diagnosis\/(by extension) consultation of different specialists"],"pinyin":["hui4 zhen3"],"word":"會診"},{"definition":["medicinal dietary supplement that helps build up one's health"],"pinyin":["yao4 bu3"],"word":"藥補"},{"definition":["benevolent heart and skillful execution (idiom, from Mencius); charitable in thought and deed"],"pinyin":["ren2 xin1 ren2 shu4"],"word":"仁心仁術"},{"definition":["dubious or hard-to-treat cases (medicine)\/hard cases"],"pinyin":["yi2 nan2 za2 zheng4"],"word":"疑難雜症"},{"definition":["micro-\/microscopic\/to make the minute visible"],"pinyin":["xian3 wei1"],"word":"顯微"}]}