{"definition":["middleware"],"pinyin":["zhong1 jian1 jian4"],"simplified":["中间件"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"中間件","characters":[{"definition":["China\/Chinese\/surname Zhong","to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right"],"pinyin":["Zhong1","zhong1","zhong4"],"word":"中"},{"definition":["between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms","gap\/to separate\/to thin out (seedlings)\/to sow discontent"],"pinyin":["jian1","jian4"],"word":"間"},{"definition":["item\/component\/classifier for events, things, clothes etc"],"pinyin":["jian4"],"word":"件"}],"containing_words":[],"sentences":[{"english":"Most of the time the data is dependent upon the middleware being used.","chinese":"在大多數情況下，數據依賴於所使用的中間件。"},{"english":"Our interest is in the process management and middleware infrastructure.","chinese":"我們的興趣在於過程管理和中間件基礎設施。"},{"english":"And this is where middleware comes in.","chinese":"這正是中間件的用武之地。"},{"english":"What is message-oriented middleware?","chinese":"什麼是面向消息的中間件？"},{"english":"Message-oriented middleware relies heavily on a perimeter security model.","chinese":"面向消息的中間件非常依賴外圍網絡安全模型。"},{"english":"It encompasses the middleware infrastructure for hosting that implementation.","chinese":"它包含用於承載該實現的中間件基礎設施。"},{"english":"But it would keep you on your current three-tier architecture with custom middle-ware.","chinese":"但它將保持你在您當前的三層架構與自定義中間件。"},{"english":"It reduces the amount of coding required to interface systems and middleware.","chinese":"它減少了定義系統和中間件的接口所需的編碼量。"},{"english":"I believed it was the way forward for enterprise middleware.","chinese":"我相信這將是企業級中間件的光明大道。"},{"english":"The messaging middleware routes the message to the destination of the service provider.","chinese":"消息傳遞中間件將消息路由到服務提供者的目的地。"},{"english":"Based on the grid middleware used by scientific computing grid, the GRM was implemented.","chinese":"以科學計算網格的中間件爲基礎，實現了GRM。"},{"english":"Messaging services are analogs of the classic middleware concept.","chinese":"消息服務類似於一流的中間件原則。"},{"english":"Many SOA patterns are implemented in commercial and open source middleware.","chinese":"許多SOA模式都有商用和開源中間件的實現。"},{"english":"Grid middlewares eliminate of the isolated information islands on the network.","chinese":"網格中間件消除了因特網內的信息資源孤島。"},{"english":"Accomplishment of middleware based on RTCC protocol.","chinese":"基於RTCC協議中間件的實現。"},{"english":"However, this tutorial focuses on the middleware tier.","chinese":"不過，本教程的重點是中間件層。"}],"related":[]}