{"definition":["lunch"],"pinyin":["zhong1 fan4"],"simplified":["中饭"],"rank":33311.0,"normalized_rank":0.4660641081247464,"fraction":7.01568474698446e-7,"cumulative_fraction":0.9929456081174328,"word":"中飯","characters":[{"definition":["China\/Chinese\/surname Zhong","to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right"],"pinyin":["Zhong1","zhong1","zhong4"],"word":"中"},{"definition":["cooked rice\/CL:碗[wan3]\/meal\/CL:頓|顿[dun4]\/(loanword) fan\/devotee"],"pinyin":["fan4"],"word":"飯"}],"containing_words":[],"sentences":[{"english":"Where do they eat lunch?","chinese":"他們在哪兒喫中飯？"},{"english":"Where shall we go to eat lunch today?","chinese":"我們該在哪兒喫中飯呢？"},{"english":"Back at Jimi’s centre we eat lunch and meet some local politicians.","chinese":"回到吉米的辦公室，我們吃了中飯並見了幾位政治家。"},{"english":"A: I‘m calling to see if you would like to have lunch tomorrow.","chinese":"我打電話給你，是想知道明天一起喫頓中飯怎樣？"},{"english":"The train won't leave for an hour. Meanwhile we can have lunch.","chinese":"火車還有小時纔開，其間可以喫中飯。"},{"english":"When after the midday meal you sat at the window reading Ramayana.","chinese":"當你喫過中飯，坐在窗前讀《羅摩衍那》。"},{"english":"What are you making us for lunch today, Mousy!","chinese":"“”今天中飯你給我們做什麼喫的，小老鼠？“”"},{"english":"Back on board, it was soon time for an early lunch.","chinese":"回到火車上已經快到早中飯的時間了。"},{"english":"Faber contemplated going into the Great Eastern Hotel for dinner.","chinese":"費伯想去“大東方飯莊”喫中飯。"},{"english":"I'm calling to see if you would like to have lunch tomorrow.","chinese":"我打電話給你，是想知道明天一起喫頓中飯怎樣？"},{"english":"In order to finish the interview manuscript, he didn't even have time for lunch.","chinese":"他爲了趕寫訪談稿，連中飯都顧不得喫。"},{"english":"We had lunch at the restaurant in the 44 South Village.","chinese":"我們在四四南村裏的一家餐廳中喫中飯。"},{"english":"Some friends over lunch suggested this word.","chinese":"一些朋友過來喫中飯的時候談到這個詞。"},{"english":"Do you want to go to lunch?","chinese":"你要不要去喫中飯？"},{"english":"After we corral the horses we'll have lunch.","chinese":"把馬關進圍欄後，我們就喫中飯。"},{"english":"We can fry up some of these pieces of cold meat for our lunch.","chinese":"我們可以把這些冷肉片煎一下作爲中飯。"}],"related":[]}