{"definition":["to advocate\/to stand for\/view\/position\/stand\/proposition\/viewpoint\/assertion\/CL:個|个[ge4]"],"pinyin":["zhu3 zhang1"],"simplified":["主张"],"rank":3687.0,"normalized_rank":0.05158591356176458,"fraction":0.000036693958131403294,"cumulative_fraction":0.8196975089774703,"word":"主張","characters":[{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["surname Zhang","to open up\/to spread\/sheet of paper\/classifier for flat objects, sheet\/classifier for votes"],"pinyin":["Zhang1","zhang1"],"word":"張"}],"containing_words":[{"definition":["to think for oneself and act accordingly (idiom); to act on one's own initiative"],"pinyin":["zi4 zuo4 zhu3 zhang1"],"word":"自作主張"}],"sentences":[{"english":"We stand for independent management of export and import transactions under unified leadership.","chinese":"我們主張分頭經營，統一領導。"},{"english":"Those opinions and propositions were agreed upon and echoed by many participating leaders.","chinese":"這些觀點和主張得到許多與會領導人的贊同和呼應。"},{"english":"They carried banners advocating religious freedom and sang “We Shall Overcome.”","chinese":"他們扛着橫幅主張宗教自由，還唱着“我們贏定了”。"},{"english":"On War\" advocates the total war.\"","chinese":"《戰爭論》主張總體戰爭。"},{"english":"Chen Duxiu was still for moderation and concessions to the Wuhan Kuomintang.","chinese":"陳獨秀卻依然主張對武漢國民黨的妥協退讓。"},{"english":"Additionally, the defendant may file a counter - claim (or cross- claim) to assert the defendant's own claims against the plaintiff.","chinese":"另外，被告可以遞交反訴狀來向原告主張自己的權利。"},{"english":"He has always been of the opinion that university students ought to have a wider range of knowledge.","chinese":"他一向主張大學生的知識面要寬一些。"},{"english":"It is claimed that nobody is to smoke at college.","chinese":"有人主張，在大學裏面誰也不應該抽菸。"},{"english":"The Syrian government launched a violent campaign against pro-democracy protesters in March.","chinese":"敘利亞政府三月份對主張民主的示威者展開暴力鎮壓。"},{"english":"We have consistently called for settling international disputes by peaceful means and opposed the use of force.","chinese":"我們一貫主張和平解決國際爭端，反對使用武力。"},{"english":"He's found out about the ruse, but his demands for an apartment haven't wavered.","chinese":"張炘煬識破了這個花招，沒有動搖自己的主張。"},{"english":"Those who have argued that this idea arose from a mistranslation of Marx and Engels's works are mistaken.","chinese":"那些主張這種觀點是對馬恩著作的誤譯的人是錯誤的。"},{"english":"The first proposing Chen Duxiu goes to Moscow was Far East Bureau.","chinese":"共產國際代表主張陳獨秀赴莫斯科目的是懲罰他。"},{"english":"Argued against king, opposed to cede territory and ask for peace.","chinese":"曾主張抗金，反對割地求和。"},{"english":"It's my position that gentlemen should reason thing out rather than resort to force.","chinese":"我主張君子動口不動手。"},{"english":"These two contestations supplement each other, and they are the way to build our native modernity.","chinese":"這兩個主張是中國生成本土現代性的相輔相成的進路。"}],"related":[{"definition":["to fight against\/to oppose\/to be opposed to\/opposition"],"pinyin":["fan3 dui4"],"word":"反對"},{"definition":["to emphasize (a statement)\/to stress"],"pinyin":["qiang2 diao4"],"word":"強調"},{"definition":["position\/standpoint\/CL:個|个[ge4]"],"pinyin":["li4 chang3"],"word":"立場"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"認為"},{"definition":["to criticize\/criticism\/CL:個|个[ge4]"],"pinyin":["pi1 ping2"],"word":"批評"},{"definition":["trend\/tendency\/orientation"],"pinyin":["qing1 xiang4"],"word":"傾向"},{"definition":["topic of discussion\/topic\/subject\/issue (under discussion)\/CL:項|项[xiang4]"],"pinyin":["yi4 ti2"],"word":"議題"},{"definition":["-ism\/ideology"],"pinyin":["zhu3 yi4"],"word":"主義"},{"definition":["political party\/CL:個|个[ge4]"],"pinyin":["zheng4 dang3"],"word":"政黨"},{"definition":["to appeal\/to demand (an answer)\/requirement\/demand\/claim\/appeal\/(marketing) message"],"pinyin":["su4 qiu2"],"word":"訴求"},{"definition":["so-called\/what is called"],"pinyin":["suo3 wei4"],"word":"所謂"},{"definition":["to approve of\/to endorse\/to acknowledge\/to recognize\/to identify oneself with"],"pinyin":["ren4 tong2"],"word":"認同"},{"definition":["to unify\/to unite\/to integrate"],"pinyin":["tong3 yi1"],"word":"統一"},{"definition":["principle\/doctrine\/CL:個|个[ge4]"],"pinyin":["yuan2 ze2"],"word":"原則"},{"definition":["expression of opinion\/views\/remarks\/arguments"],"pinyin":["yan2 lun4"],"word":"言論"},{"definition":["to expound Buddhist teachings","way of speaking\/wording\/formulation\/one's version (of events)\/statement\/theory\/hypothesis\/interpretation"],"pinyin":["shuo1 fa3","shuo1 fa5"],"word":"說法"}]}