{"definition":["the important and the less important\/primary and secondary"],"pinyin":["zhu3 ci4"],"simplified":["主次"],"rank":25155.0,"normalized_rank":0.3519510864242441,"fraction":0.0000014577325818432547,"cumulative_fraction":0.9845185804347342,"word":"主次","characters":[{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["next in sequence\/second\/the second (day, time etc)\/secondary\/vice-\/sub-\/infra-\/inferior quality\/substandard\/order\/sequence\/hypo- (chemistry)\/classifier for enumerated events: time"],"pinyin":["ci4"],"word":"次"}],"containing_words":[{"definition":["to invert the importance of things (i.e. stress the incidental and neglect the main point)\/lacking a sense of perspective\/to put the cart before the horse"],"pinyin":["qing1 zhong4 zhu3 ci4"],"word":"輕重主次"}],"sentences":[{"english":"Distinguish primary and secondary, it is more important to energy energy puts on the main operation of the website.","chinese":"分清主次，把精力放在網站的主要運營上更重要。"},{"english":"Before you start your work every day, you should differentiate what is primary and what is secondary.","chinese":"在每天工作之前，首先要區別事情的主次順序。"},{"english":"For each resource group, we will add the primary and secondary servers.","chinese":"對於每個資源組，我們將添加主次兩臺服務器。"},{"english":"The rotation speed of crank and air flow speed are the main factors.","chinese":"其主次因素順序爲曲柄轉速和風扇進風口風速。"},{"english":"In a list, prioritize the content","chinese":"列出優先考慮的內容，分清主次。"},{"english":"A great life is the result of creating priorities.","chinese":"非凡的人生源於分清主次。"},{"english":"Not clearly distinguishing between primary and secondary actions can easily lead to failure.","chinese":"不明確區分主次操作會很容易出事。"},{"english":"Active smokers tended not only to have poorer memories but also to have trouble spearating important information from insignificant details.","chinese":"吸菸成癮者往往不僅記性差，而且分不清主次信息。"},{"english":"This will help prioritize your life.","chinese":"這會幫你爲人生分清主次。"},{"english":"All things have two sides. We must distinguish the primary and secondary. We should also consider it in full-scale.","chinese":"事物都是有兩重性，要分清主次，也必須考慮全面。"},{"english":"These are in chronological order instead of rank.","chinese":"排名不分主次，只是按照時間順序列出。"},{"english":"Create Priorities. A great life is the result of creating priorities.","chinese":"非凡的人生源於分清主次。"},{"english":"In a word, prioritize.","chinese":"一句話，分清主次。"}],"related":[{"definition":["slight or important, urgent or non-urgent (idiom); to deal with important matters first\/sense of priority"],"pinyin":["qing1 zhong4 huan3 ji2"],"word":"輕重緩急"},{"definition":["to distinguish (between different things)\/to make distinctions clear"],"pinyin":["fen1 qing1"],"word":"分清"},{"definition":["careless\/any-old-how, regardless of the specific task"],"pinyin":["mei2 mao5 hu2 zi5 yi1 ba3 zhua1"],"word":"眉毛鬍子一把抓"},{"definition":["sequence\/order"],"pinyin":["ci4 xu4"],"word":"次序"},{"definition":["severity (of the case)\/degree of seriousness\/whether sth is slight or serious"],"pinyin":["qing1 zhong4"],"word":"輕重"},{"definition":["to differentiate\/to draw a distinction\/to divide into categories"],"pinyin":["qu1 fen1"],"word":"區分"},{"definition":["slight or important, urgent or non-urgent (idiom); to deal with important matters first\/sense of priority\/also written 輕重緩急|轻重缓急"],"pinyin":["huan3 ji2 qing1 zhong4"],"word":"緩急輕重"},{"definition":["arrangement\/order\/tidiness"],"pinyin":["tiao2 li3"],"word":"條理"},{"definition":["concise\/the details in brief"],"pinyin":["xiang2 lu:e4"],"word":"詳略"},{"definition":["priority\/whether sth is urgent"],"pinyin":["huan3 ji2"],"word":"緩急"},{"definition":["clear\/well-defined\/limpid"],"pinyin":["ming2 xi1"],"word":"明晰"},{"definition":["an overall plan taking into account all factors"],"pinyin":["tong3 chou2 jian1 gu4"],"word":"統籌兼顧"},{"definition":["to choose\/to accept or reject"],"pinyin":["qu3 she3"],"word":"取捨"},{"definition":["order of priority\/sequential order"],"pinyin":["xian1 hou4 shun4 xu4"],"word":"先後順序"},{"definition":["what is true and what is false\/(to get to know) the real situation"],"pinyin":["xu1 shi2"],"word":"虛實"},{"definition":["as rivers Jing and Wei separate clearly (idiom)\/to be entirely different"],"pinyin":["Jing1 Wei4 fen1 ming2"],"word":"涇渭分明"}]}