{"definition":["hostname (of a networked computer)"],"pinyin":["zhu3 ji1 ming2"],"simplified":["主机名"],"rank":48030.0,"normalized_rank":0.6720020147468275,"fraction":1.769248837566618e-7,"cumulative_fraction":0.998644366943958,"word":"主機名","characters":[{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"},{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"}],"containing_words":[],"sentences":[{"english":"One or more host names can be derived based on the node name of the system.","chinese":"可以根據系統的節點名導出一個或多個主機名。"},{"english":"We provide this service, for up to five (5) hostnames, free to the Internet community.","chinese":"你可以最多同時擁有五個主機名，免費進入在線社區。"},{"english":"Substitute your fully qualified host name for the localhost.","chinese":"請用全限定主機名替換本地主機。"},{"english":"The hostname specified needs to be fully qualified.","chinese":"指定的主機名需要是完全限定的。"},{"english":"It allows administrators to limit the hostnames to which users can connect.","chinese":"它允許管理員把主機名限制在用戶能連接的主機名上。"},{"english":"It allows administrators to limit the hostnames to which users can connect.","chinese":"它允許管理員把主機名限制在用戶能連接的主機名上。"},{"english":"The colon separates the hostname from the display name.","chinese":"冒號將主機名與顯示器名稱分隔開。"},{"english":"The hostname and port can both be configured, however.","chinese":"儘管如此，主機名和端口都可以進行配置。"},{"english":"The host name needs to be a resolvable value.","chinese":"主機名必須是一個可解析值。"},{"english":"Scripts to deal with host name changes.","chinese":"用於處理主機名變更的腳本。"},{"english":"Update the necessary source files to reflect the hostnames of your runtime environment.","chinese":"更新必要的源文件，以反映運行時環境的主機名。"},{"english":"Hostname and port of the directory server to access.","chinese":"要訪問的目錄服務器的主機名和端口。"},{"english":"This command can read or set the hostname or the NIS domainname.","chinese":"此命令可以讀取或者設置主機名或者NIS域名。"},{"english":"Remember to substitute the fully qualified host name for the localhost.","chinese":"請記住用全限定主機名替換本地主機。"},{"english":"Also, the name should not contain any blank spaces or punctuation.","chinese":"同時，主機名也不能包含空格或標點符號。"},{"english":"The hostname of the machine gets printed as well.","chinese":"機器的主機名也會被打印出來。"}],"related":[]}