{"definition":["main line (of communication)\/main thread (of a plotline or concept)\/central theme"],"pinyin":["zhu3 xian4"],"simplified":["主线"],"rank":8411.0,"normalized_rank":0.1176808025408196,"fraction":0.000011025398201628011,"cumulative_fraction":0.914511995327054,"word":"主線","characters":[{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"}],"containing_words":[],"sentences":[{"english":"“There is a common thread” among these stories, Verveer said.","chinese":"韋維爾說，所有這些故事“都有一條共同的主線”。"},{"english":"All of these callbacks happen on the main thread of the application.","chinese":"這些回調全部發生在應用程序的主線程上。"},{"english":"The main thread writes bytes read from the channel into the pipe.","chinese":"主線程把從通道讀取的數據寫到管道中。"},{"english":"There is a while loop in the thread.","chinese":"是調用主線程裏的無模式對話框吧？"},{"english":"This thesis is based on our sports public goods as of the main line.","chinese":"本篇碩士學位論文是以我國體育公共產品爲研究主線。"},{"english":"Benoni, Four pawns attack, Main line.","chinese":"別諾尼，四兵進攻，主線。"},{"english":"Terminates when the main thread has requested.","chinese":"在主線程發出請求時結束。"},{"english":"This transforms the main thread of the calling process into the control dispatcher.","chinese":"這將把調用進程的主線程轉換爲控制分派器。"},{"english":"Mainline is the codeline that has no baseline.","chinese":"主線是沒有基線的代碼線。"},{"english":"They do of course have to check that nothing else has been changed on the mainline in the meantime.","chinese":"當然，他們必須檢查同時主線上沒有發生任何變更。"},{"english":"Feng Shui is permeated with a for people to \"stay out of trouble, \" the main line.","chinese":"風水學貫穿着一條爲人們“趨吉避凶”的主線。"},{"english":"The central themes of the story are the struggle for civil rights and the Vietnam conflict.","chinese":"故事的主線是越戰和公民權之爭。"},{"english":"The plotline gives global audiences a chance to see American troops get killed.","chinese":"情節主線使得全球觀衆有機會一睹美國軍隊被殺。"},{"english":"To get this fix into the mainline, there are two options.","chinese":"想要在主線中修復它，有兩種選擇。"},{"english":"Locke's theory of knowledge runs through the thread of the truthfulness of knowledge.","chinese":"洛克知識論貫穿知識確實性主線。"},{"english":"So that Ron subplot was secondary to the central drive of the story.","chinese":"對於故事的主線的發展就是次要的了。"}],"related":[{"definition":["starting point"],"pinyin":["qi3 dian3"],"word":"起點"},{"definition":["axis\/principal axis (in mechanics, optics, botany etc)\/main axle (of engine)"],"pinyin":["zhu3 zhou2"],"word":"主軸"},{"definition":["to revolve around\/to center on (an issue)"],"pinyin":["wei2 rao4"],"word":"圍繞"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推進"},{"definition":["to run through\/a connecting thread from beginning to end\/to link"],"pinyin":["guan4 chuan1"],"word":"貫穿"},{"definition":["opportunity\/turning point\/juncture"],"pinyin":["qi4 ji1"],"word":"契機"},{"definition":["node"],"pinyin":["jie2 dian3"],"word":"節點"},{"definition":["area\/region\/district"],"pinyin":["qu1 yu4"],"word":"區域"},{"definition":["main part\/bulk\/body\/subject\/agent"],"pinyin":["zhu3 ti3"],"word":"主體"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["to unfold\/to carry out\/to be in full swing\/to launch"],"pinyin":["zhan3 kai1"],"word":"展開"},{"definition":["subject matter"],"pinyin":["ti2 cai2"],"word":"題材"},{"definition":["periphery\/rim\/surroundings\/all around\/perimeter\/peripheral (computing)\/spin-offs"],"pinyin":["zhou1 bian1"],"word":"周邊"},{"definition":["to continue\/to go on\/to last"],"pinyin":["yan2 xu4"],"word":"延續"},{"definition":["leading\/dominant\/prevailing\/to lead\/to direct\/to dominate"],"pinyin":["zhu3 dao3"],"word":"主導"}]}