{"definition":["the authorities\/higher competent body"],"pinyin":["zhu3 guan3 ji1 guan1"],"simplified":["主管机关"],"rank":27352.0,"normalized_rank":0.3826899668406251,"fraction":0.0000011976004507752917,"cumulative_fraction":0.9874277894352677,"word":"主管機關","characters":[{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["Guan3","guan3"],"word":"管"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"},{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["Guan1","guan1"],"word":"關"}],"containing_words":[],"sentences":[{"english":"To conduct other relevant businesses which may be authorized by the Central Competent Authority.","chinese":"二二經中央主管機關覈准辦理之其他有關業務。"},{"english":"The central competent authority shall determine all analysis methods in this Act.","chinese":"本法各項檢驗測定方法，由中央主管機關定之。"},{"english":"The amount of such exclusive business operation funds shall be as approved by the Competent Authority.","chinese":"其指撥營運資金之數額，應經主管機關覈准。"},{"english":"Registration certificate\/license granted by competent authority, or documents for approval of incorporation or registration.","chinese":"主管機關登記證照或覈准成立或備案之文件。"},{"english":"Capital contributed by business owners and registered with the competent authority in charge.","chinese":"業主對商業投入之資本，並向主管機關登記者。"},{"english":"Other assistance affairs designated by the central competent authority.","chinese":"六其他經中央主管機關指定之輔導事項。"},{"english":"Ship's statutory certification is the responsibility of the flag state administration.","chinese":"船舶法定證書發證是船旗國主管機關的職責。"},{"english":"The competent organ shall, without delay, inform the People's Procuratorate of how it has handled the case.","chinese":"有關主管機關應當將處理結果及時通知人民檢察院。"},{"english":"All other machinery or tools designated by the competent authority of the central government.","chinese":"六其他經中央主管機關指定之機械或器具。"},{"english":"Article 37 Enforcement Rules for this Act shall be drawn by the central competent authority.","chinese":"第37條本法施行細則，由中央主管機關定之。"},{"english":"Regulators earlier expressed concern that the bid had Chinese funding.","chinese":"稍早主管機關對投標資金來自中國表示關切。"},{"english":"The central competent authority in consultation with the relevant agencies shall determine the emissions standards in the foregoing paragraph.","chinese":"前項排放標準，由中央主管機關會商有關機關定之。"},{"english":"Please keep relevant information for future reference in case of need.","chinese":"請妥善保存相關資料，以供本院應主管機關要求備查。"},{"english":"However, in case of reports in written form that are additionally prescribed by the RACGL, the enterprise shall not be constrained with this paragraph.","chinese":"但中央主管機關另有規定以書面申報者，不在此限。"}],"related":[{"definition":["to investigate and plan forward"],"pinyin":["yan2 ni3"],"word":"研擬"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"審查"},{"definition":["administrative department\/administration\/executive (government branch)"],"pinyin":["xing2 zheng4 bu4 men2"],"word":"行政部門"},{"definition":["to set\/to designate\/to stipulate\/to provide\/to draw up\/to formulate (rules etc)\/stipulation"],"pinyin":["ding4 ding4"],"word":"訂定"},{"definition":["anti-trust legislation\/anti-monopoly"],"pinyin":["fan3 long3 duan4"],"word":"反壟斷"},{"definition":["administrative authority\/branch of government"],"pinyin":["xing2 zheng4 ji1 guan1"],"word":"行政機關"},{"definition":["to bear joint responsibility for sth\/joint liability (law)"],"pinyin":["lian2 dai4 ze2 ren4"],"word":"連帶責任"},{"definition":["to regulate"],"pinyin":["gui1 guan3"],"word":"規管"},{"definition":["proposal\/recommendation\/to draft"],"pinyin":["ni3 yi4"],"word":"擬議"},{"definition":["to consult with\/to talk things over\/agreement"],"pinyin":["xie2 shang1"],"word":"協商"},{"definition":["to repay a debt in full\/to redeem\/to clear"],"pinyin":["qing1 chang2"],"word":"清償"},{"definition":["regulations"],"pinyin":["gui1 li4"],"word":"規例"},{"definition":["commercial organization"],"pinyin":["shang1 ye4 ji1 gou4"],"word":"商業機構"},{"definition":["to reach agreement"],"pinyin":["da2 cheng2 xie2 yi4"],"word":"達成協議"},{"definition":["certificate"],"pinyin":["zheng4 ming2 shu1"],"word":"證明書"},{"definition":["to work out\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制訂"}]}