{"definition":["main part\/bulk\/body\/subject\/agent"],"pinyin":["zhu3 ti3"],"simplified":["主体"],"rank":2096.0,"normalized_rank":0.02932575937766709,"fraction":0.00007271510538059997,"cumulative_fraction":0.7376246784747328,"word":"主體","characters":[{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[{"definition":["Juche Idea (North Korean ideology of political, economic and military independence)"],"pinyin":["Zhu3 ti3 Si1 xiang3"],"word":"主體思想"}],"sentences":[{"english":"The first part: to discuss the main concepts and characteristics of commercial subject.","chinese":"本文第一章，主要介紹商主體的概念和特徵。"},{"english":"It is divided into two parts: principal structure and ecological structure.","chinese":"哭嫁歌分爲主體結構和生態結構兩個部分。"},{"english":"This paper lays stress on the fulfillment of students' initiative in English teaching.","chinese":"本文強調在英語教學中應始終發揮學生的主體作用。"},{"english":"Youth and juveniles are the main part of immoralities on web.","chinese":"青少年是互聯網上不道德行爲的重要主體。"},{"english":"The ontological character of literary understanding signifies self-understanding of interpretive subject.","chinese":"理解的本體論性質意味着闡釋主體的自我理解。"},{"english":"Only a handful of bridges have major support beams made from them.","chinese":"只有少數橋樑採用纖維增強塑料的主體支撐梁。"},{"english":"At least one row must be in a non-body element.","chinese":"必須至少有一行在非主體元素中。"},{"english":"The software is mainly programmed by C-Language, and partly by built-in Assembler-Language.","chinese":"系統軟件以C語言爲主體，結合內嵌彙編語言。"},{"english":"Thus, the inside of the body is divided into four sections.","chinese":"因此，主體的內部分成四個區部。"},{"english":"The main body sex of dress and integral sex decided the appurtenant position of shoe.","chinese":"服裝的主體性和整體性決定了鞋子的從屬地位。"},{"english":"Chapter one is the framework of multi-agent urban system.","chinese":"第一章是對城市多主體系統的理論構思。"},{"english":"I. 1 Is the subject singular or plural?","chinese":"主體是單數還是複數？"},{"english":"This thesis made a research on the transmissive subject of early Buddhism in China from the transmissive perspective.","chinese":"本文從傳播學角度對佛教早期在華傳教主體進行研究。"},{"english":"We must also discover \"others\" and the intersubjective world.","chinese":"我們必鬚髮現“他者”和主體間性的世界。"},{"english":"In the next installment(s) I'll talk about the packer application itself.","chinese":"在下面幾部分裏面我會討論加殼程序主體的製作。"},{"english":"From them we can see obviously what the compiler is emphasizing.","chinese":"從中明顯可以看出訴述主體的失重態勢。"}],"related":[{"definition":["structure\/composition\/makeup\/architecture\/CL:座[zuo4],個|个[ge4]"],"pinyin":["jie2 gou4"],"word":"結構"},{"definition":["area\/region\/district"],"pinyin":["qu1 yu4"],"word":"區域"},{"definition":["whole entity\/entire body\/synthesis\/as a whole (situation, construction, team etc)\/global\/macrocosm\/integral\/holistic\/whole"],"pinyin":["zheng3 ti3"],"word":"整體"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"規範"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"體現"},{"definition":["to construct\/to form\/to make up\/to compose\/literary composition\/paper mulberry (Broussonetia papyrifera)"],"pinyin":["gou4"],"word":"構"},{"definition":["to present clearly\/to give prominence to\/to magnify\/clear and obvious"],"pinyin":["tu1 xian3"],"word":"凸顯"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"},{"definition":["to revolve around\/to center on (an issue)"],"pinyin":["wei2 rao4"],"word":"圍繞"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["leading\/dominant\/prevailing\/to lead\/to direct\/to dominate"],"pinyin":["zhu3 dao3"],"word":"主導"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰顯"},{"definition":["individual"],"pinyin":["ge4 ti3"],"word":"個體"},{"definition":["single\/only\/sole"],"pinyin":["dan1 yi1"],"word":"單一"}]}