{"definition":["seasoned\/honed to perfection over centuries\/special reserve"],"pinyin":["jiu3 fu4 sheng4 ming2"],"simplified":["久负盛名"],"rank":29887.0,"normalized_rank":0.4181579057826032,"fraction":9.522120600203836e-7,"cumulative_fraction":0.9901348327065592,"word":"久負盛名","characters":[{"definition":["(long) time\/(long) duration of time"],"pinyin":["jiu3"],"word":"久"},{"definition":["to bear\/to carry (on one's back)\/to turn one's back on\/to be defeated\/negative (math. etc)"],"pinyin":["fu4"],"word":"負"},{"definition":["flourishing\/vigorous\/magnificent\/extensively","surname Sheng","to hold\/to contain\/to ladle\/to pick up with a utensil"],"pinyin":["Sheng4","cheng2","sheng4"],"word":"盛"},{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"}],"containing_words":[],"sentences":[{"english":"Rice noodles are the most famous snack in Guilin.","chinese":"米粉是桂林久負盛名的小喫。"},{"english":"Purple garlic of Ying county is famous with its quality.","chinese":"山西省應縣的紫皮大蒜在國內久負盛名。"},{"english":"The city has long been noted for its perfume industry. Population, 24,553.","chinese":"該市因其香水工業而久負盛名。"},{"english":"Rice noodles are the most famous snack in Guilin.","chinese":"米粉是桂林久負盛名的小喫。"},{"english":"In fact, the venerable BlackBerry is currently in a “tweener” stage.","chinese":"事實上，久負盛名的黑莓目前處在了“中間”階段。"},{"english":"The 20-year-old is a sophomore at the prestigious Royal College of Music in London.","chinese":"現在，他在久負盛名的倫敦皇家音樂學院就讀二年級。"},{"english":"Vienna is also world-renown for its coffee houses.","chinese":"當然，久負盛名的咖啡廳也令維也納聞名於世。"},{"english":"Our bean curd processing line is the most advanced and well- know in world.","chinese":"我們蹬豆腐生產線是世界上最爲先絕的，久負盛名。"},{"english":"Lichuan belonged to Ba country in ancient times and had a long history in producing green tea .","chinese":"利川古屬巴國，產茶歷史悠久，真香茶久負盛名。"},{"english":"Pome for the large, mainly white areas in Shenyang, has long enjoyed a good reputation pepper.","chinese":"梨果爲大宗，主要分佈在陽白地區，花椒也久負盛名。"}],"related":[]}