{"definition":["product (result of multiplication)"],"pinyin":["cheng2 ji1"],"simplified":["乘积"],"rank":44050.0,"normalized_rank":0.6163166510430512,"fraction":2.6173788496344435e-7,"cumulative_fraction":0.9977822366556348,"word":"乘積","characters":[{"definition":["four horse military chariot (archaic)\/four (archaic)\/generic term for history books","surname Cheng","to ride\/to mount\/to make use of\/to avail oneself of\/to take advantage of\/to multiply (math.)\/Buddhist sect or creed"],"pinyin":["Cheng2","cheng2","sheng4"],"word":"乘"},{"definition":["to amass\/to accumulate\/to store\/measured quantity (such as area of volume)\/product (the result of multiplication)\/to integrate (math.)\/to solve (or integrate) an ordinary differential equation (math.)\/old\/long-standing"],"pinyin":["ji1"],"word":"積"}],"containing_words":[],"sentences":[{"english":"Find the largest palindrome made from the product of two 3-digit numbers.","chinese":"找出兩個三位數乘積所能製造處的最大回文數。"},{"english":"The computer can multiply two 10-digit numbers in 1\/1000 second.","chinese":"計算機能在千分之一秒內算出兩個十位數數字的乘積。"},{"english":"And if you're below this temperature here, this quantity, p times v it would be negative.","chinese":"壓強與體積的乘積將變成負數，這可能嗎？"},{"english":"Multiply five by two. The product is ten.","chinese":"五乘以二，乘積是十。"},{"english":"It is the product of the volume of transactions and the cost per transaction.","chinese":"它是事務量與每事務成本的乘積。"},{"english":"You are to write a program to perform such multiplications and save the world.","chinese":"你來設計一個程序執行該乘積運算，以拯救世界。"},{"english":"And, their matrix product should be some given column vector.","chinese":"它們的矩陣乘積，等於某個已知列向量。"},{"english":"It is proved in this paper that the transposition network and the multiplicative circulant networks are superconnected.","chinese":"本文證明了對換網絡和乘積循環網絡是超連通的。"},{"english":"Every positive integer greater than 1 can be expressed as the product of prime numbers.","chinese":"每個大於1的正整數都能表示爲素數的乘積。"},{"english":"Because we have a cross between r and v, and with a cross product, you have the sine of the angle.","chinese":"因爲在r和v中，有交叉乘積，所以得到正弦值。"},{"english":"We want the maximum such product.","chinese":"我們想要得到最大的乘積。"},{"english":"The entries in the matrix product are obtained by taking dot products.","chinese":"矩陣乘積裏的元素是通過點乘得到的。"},{"english":"So, product rule is OK for taking the derivative of a dot product.","chinese":"那麼乘積法則對點乘求導沒問題。"},{"english":"I can write it as a product.","chinese":"所以可以寫成乘積形式。"},{"english":"Sevaral operation characters in the lattice L of a product arrangement have been educed.","chinese":"本文給出了乘積構形格的幾個運算性質。"},{"english":"This product makes sense.","chinese":"這個乘積是有意義的。"}],"related":[]}