{"definition":["sigmoid colon (anatomy)\/bent colon, linking the descending colon to the rectum"],"pinyin":["yi3 zhuang4 jie2 chang2"],"simplified":["乙状结肠"],"rank":59501.0,"normalized_rank":0.8324961873714549,"fraction":4.496110907347511e-8,"cumulative_fraction":0.9997933031252196,"word":"乙狀結腸","characters":[{"definition":["second of the ten Heavenly Stems 十天干[shi2 tian1 gan1]\/second in order\/letter \"B\" or Roman \"II\" in list \"A, B, C\", or \"I, II, III\" etc\/second party (in legal contract, usually 乙方[yi3 fang1], as opposed to 甲方[jia3 fang1])\/ethyl\/bent\/winding\/radical in Chinese characters (Kangxi radical 5)\/ancient Chinese compass point: 105°","turning stroke (in Chinese characters)\/see also 折[zhe2]"],"pinyin":["yi3","zhe2"],"word":"乙"},{"definition":["accusation\/suit\/state\/condition\/strong\/great\/-shaped"],"pinyin":["zhuang4"],"word":"狀"},{"definition":["(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]","knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)"],"pinyin":["jie1","jie2"],"word":"結"},{"definition":["intestines"],"pinyin":["chang2"],"word":"腸"}],"containing_words":[],"sentences":[{"english":"Sigmoid and transverse colon was the common site of perforation.","chinese":"穿孔部位常見於乙狀結腸和橫結腸。"},{"english":"Simple right sigmoid colon needn t to manage.","chinese":"單純右位乙狀結腸本身不需處理。"},{"english":"For 15 patients with unresectable lesions, colostomy of transverse colon or sigmoid colon was performed.","chinese":"腫瘤無法切除行乙狀結腸或橫結腸造瘻15例。"},{"english":"Sigmoid tumor associated with acute ileus could be treated with stage I colectomy.","chinese":"乙狀結腸腫瘤並急性腸梗阻可行I期結腸切除吻合術。"},{"english":"The ulcerations worsen and the woman eventually underwent a loop sigmoid colostomy.","chinese":"潰瘍惡化，最終該女患經受了乙狀結腸袢式造口術。"},{"english":"We performed complete wedge resection of the diverticulum and primary closure of the sigmoid colon.","chinese":"我們作憩室之楔狀切除後，其乙狀結腸作直接逢合。"},{"english":"Objective To evaluate the effect of orthotopic sigmoid colon neobladder with low pressure.","chinese":"目的探討原位低壓乙狀結腸膀胱術的療效。"},{"english":"The left kidney was multicystic dysplastic. The sigmoid colon was extremely distended.","chinese":"左腎爲多囊腎和發育不良，乙狀結腸極度擴張。"},{"english":"Dislodging entrapped fecal matter above the sigmoid colon area.","chinese":"取出包埋糞便以上乙狀結腸區。"},{"english":"Pathological examination of the bladder revealed bladder abscess and the sigmoid colon showed diverticulitis .","chinese":"組織病理檢查證實有乙狀結腸憩室並引起膀胱膿腫。"}],"related":[]}