{"definition":["lit. tangled skein\/in a tremendous muddle\/confused"],"pinyin":["luan4 ma2"],"simplified":["乱麻"],"rank":50842.0,"normalized_rank":0.7113455430722091,"fraction":1.315258418026009e-7,"cumulative_fraction":0.9990758808963336,"word":"亂麻","characters":[{"definition":["in confusion or disorder\/in a confused state of mind\/disorder\/upheaval\/riot\/illicit sexual relations\/to throw into disorder\/to mix up\/indiscriminate\/random\/arbitrary"],"pinyin":["luan4"],"word":"亂"},{"definition":["generic name for hemp, flax etc\/hemp or flax fiber for textile materials\/sesame\/CL:縷|缕[lu:3]\/(of materials) rough or coarse\/pocked\/pitted\/to have pins and needles or tingling\/to feel numb","surname Ma"],"pinyin":["Ma2","ma2"],"word":"麻"}],"containing_words":[{"definition":["lit. quick sword cuts through tangled hemp (idiom); decisive action in a complex situation\/cutting the Gordian knot"],"pinyin":["kuai4 dao1 zhan3 luan4 ma2"],"word":"快刀斬亂麻"},{"definition":["lit. quick sword cuts through tangled hemp (idiom); decisive action in a complex situation\/cutting the Gordian knot"],"pinyin":["kuai4 dao1 duan4 luan4 ma2"],"word":"快刀斷亂麻"}],"sentences":[{"english":"Optimists love to talk their way through.","chinese":"樂觀者就喜歡用他們的“快嘴”斬亂麻。"},{"english":"He never procrastinates , but always takes resolute measures to solve a complicated problem in an instant.","chinese":"他幹什麼事總是快刀斬亂麻，從不拖泥帶水。"},{"english":"I had to clean the house and the mess that you made.","chinese":"我得把房子打掃了一遍，清理你留下的一團亂麻。"},{"english":"We warned them, It’s going to become an atrocious mess.","chinese":"我們警告過他們，事情將會變成一團亂麻。"},{"english":"Is there no backbone anywhere in this mess?","chinese":"在這一團亂麻中，就沒有一個主心骨嗎？"},{"english":"Their thoughts are a tangle of unexamined impulses.","chinese":"他們的想法是沒有條理一團亂麻。"},{"english":"The manager floundered among a jumble of thoughts.","chinese":"經理腦子裏一團亂麻。"},{"english":"The knot which you thought a Gordian one, will untie itself before you.","chinese":"你以爲是死結的亂麻，將在你面前自行理清脈絡。"},{"english":"Often say \"cut the Gordian knot\" and the knife can continue, but more threads.","chinese":"常說“快刀斬亂麻”，可這一刀下去，頭緒卻更多了。"},{"english":"He could cut through disputes with the sharp knife of authority.","chinese":"他可以運用他的權威象快刀斬亂麻樣地解決糾紛。"},{"english":"He felt there was something important in his mind, but he was too numb (confused) to recall what it was(so mixed up that he can not recall what it was. )","chinese":"心裏感到有什麼要緊的事，卻又亂麻麻地總是想不起。"},{"english":"A blue knitted cap hides the cockles of his hair.","chinese":"一頂藍色針織帽遮住他亂麻般的頭髮。"},{"english":"Silk emotions such as knot not clear.","chinese":"絲絲情緒如亂麻無法理清。"},{"english":"Do you think your life is a failure?","chinese":"你覺得你的生活就是一團亂麻？"},{"english":"Politics is a muddle of moral and practical compromise.","chinese":"政治是一團道德和現實妥協的亂麻。"},{"english":"Still a chaotic mess in most ways.","chinese":"在大多數方面仍然是一團亂麻。"}],"related":[]}