{"definition":["frank\/outspoken\/ready\/settled\/in order\/(old) to deal with\/to handle"],"pinyin":["liao3 dang4"],"simplified":["了当"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"了當","characters":[{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly"],"pinyin":["le5","liao3"],"word":"了"},{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"}],"containing_words":[{"definition":["direct and plainspoken (idiom); blunt\/straightforward"],"pinyin":["zhi2 jie2 liao3 dang4"],"word":"直截了當"},{"definition":["variant of 直截了當|直截了当[zhi2 jie2 liao3 dang4]"],"pinyin":["zhi2 jie2 liao3 dang4"],"word":"直捷了當"},{"definition":["see 直截了當|直截了当[zhi2 jie2 liao3 dang4]"],"pinyin":["zhi2 jie1 liao3 dang4"],"word":"直接了當"}],"sentences":[{"english":"Yeats describes mankind's fleshly predicament as a soul fastened to a dying animal.","chinese":"描繪了當靈魂依附於瀕死的動物時人類肉體的窘境。"},{"english":"I was hoaxed into believing his lies.","chinese":"我上了當，相信他的謊言。"},{"english":"Her teeth are so yellow that traffic slows down when she smiles.","chinese":"她的牙太黃了當她笑着露出牙齒時，汽車見了就減速。"},{"english":"In fact, it is less clear-cut than that.","chinese":"但事實上並沒有這麼清晰了當。"},{"english":"The development of multi - parameter patient monitor was reviewed in this article.","chinese":"簡述了當參數病人監護儀的國內外發展概況。"},{"english":"Bugfix when comparing two or more far-field output data files.","chinese":"修正了當比較兩個或兩個以上的遠場輸出的數據文件。"},{"english":"They cooked these and served them with liquor.","chinese":"他們把這些炒了當下酒菜。"},{"english":"It describes when someone else excepts accepts responsibility to act in the interests of a child.","chinese":"它描述了當某些人同意承擔照顧兒童的責任。"},{"english":"Fix a displaying problem when song name is too long.","chinese":"修復了當歌曲名太長時的顯示問題。"},{"english":"Bugfix when selecting more than 32 var's to optimize.","chinese":"修正了當選擇超過32個變種的優化。"},{"english":"Fix line numbers space problem while folding.","chinese":"修復了當摺疊時行號空間的問題。"},{"english":"The swindlers had roped into a number of gullible persons.","chinese":"那個騙子使許多人上了當。"},{"english":"His composure threw us off.","chinese":"他的鎮靜使我們上了當。"},{"english":"Processing of the query when asynchrony is enabled is illustrated by the figure below.","chinese":"下面的圖中闡釋了當啓用異步時，查詢的處理過程。"},{"english":"At last she realized her dream of becoming an actress.","chinese":"她最終實現了當演員的夢想。"},{"english":"He was bluffed into supposing I was ill prepared.","chinese":"他上了當，以爲我準備不足。"}],"related":[]}