{"definition":["to give\/to impose\/to apply"],"pinyin":["yu3 yi3"],"simplified":["予以"],"rank":2051.0,"normalized_rank":0.02869615099408168,"fraction":0.00007442844478707847,"cumulative_fraction":0.7343183538357945,"word":"予以","characters":[{"definition":["(archaic) I\/me","to give"],"pinyin":["yu2","yu3"],"word":"予"},{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"}],"containing_words":[{"definition":["to ask sb to carefully consider a request (idiom)"],"pinyin":["yu3 yi3 zhao4 gu4"],"word":"予以照顧"}],"sentences":[{"english":"Suffice it to say that the following responses of some umbelliferous plants have been observed .","chinese":"下面僅就已觀察到的幾種傘形科植物的反應予以說明。"},{"english":"When the article arrived, the editor read the first sentence and then refused to publish it.","chinese":"稿子寄來後，編輯看第一句話就拒絕予以發表。"},{"english":"It is better to weed out the bad businesses within the group rather than cross-subsidise them to save face.","chinese":"將集團內的不良業務剔除，好過爲了面子予以挽救。"},{"english":"We will take good care and properly protect the patients vulnerable.","chinese":"並且對於易受傷害患者予以優先照顧和妥善保護。"},{"english":"I was gratified at the attendance to my talk, and the enthusiastic response.","chinese":"聽衆對我的發言予以熱烈的響應，令我深感榮幸。"},{"english":"Free bags, even under other  guises, would be banned.","chinese":"只要是免費塑料袋，不論以何形式提供都予以禁止。"},{"english":"So in found that people with tonsillitis shall be timely treatment should be.","chinese":"因此在發現患有扁桃體炎時應及時予以治療。"},{"english":"After examination and approval by the Trademark Office, a corresponding certificate shall be issued to the registrant and the change shall be published.","chinese":"經商標局覈准後，發給註冊人相應證明，並予以公告。"},{"english":"And certain high-risk professions and hobbies usually have to be disclosed.","chinese":"某些高風險職業和業餘愛好通常也必須予以說明澄清。"},{"english":"We thank you for your order, which have be putted in work at once.","chinese":"感謝您的訂單，我們立即予以執行。"},{"english":"The government's refusal was couched in unfriendly language.","chinese":"該政府以不友好的語言予以拒絕。"},{"english":"Adamaged or leaking battery should not be transported.","chinese":"已損壞或泄漏的電池不能予以運輸。"},{"english":"Once school-related fears of children was diagnosed, the treatment that given early would achieve better effects.","chinese":"一旦確診兒童學校恐怖症，早期予以治療則療效較好。"},{"english":"The deviation made by the wind could be straightened by the computer.","chinese":"由風引起的偏差可由計算機予以校正。"},{"english":"Where a crime is committed as mentioned in any Article of this Decision, all his earnings and property illegally obtained shall be confiscated;","chinese":"犯本決定各條罪的，其違法所得的一切財物予以沒收。"},{"english":"The customs may publish the failure of taxpayers to pay duty.","chinese":"海關可以對納稅義務人欠繳稅款的情況予以公告。"}],"related":[{"definition":["to withhold\/to refuse"],"pinyin":["bu4 yu2"],"word":"不予"},{"definition":["to accord\/to give\/to show (respect)"],"pinyin":["ji3 yu3"],"word":"給予"},{"definition":["legal (proceedings)\/according to law"],"pinyin":["yi1 fa3"],"word":"依法"},{"definition":["in addition\/moreover\/(used before a disyllabic verb to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["jia1 yi3"],"word":"加以"},{"definition":["to put out\/to come up with\/to make (a choice, decision, proposal, response, comment etc)\/to issue (a permit, statement, explanation, apology, reassurance to the public etc)\/to draw (conclusion)\/to deliver (speech, judgment)\/to devise (explanation)\/to extract"],"pinyin":["zuo4 chu1"],"word":"作出"},{"definition":["aforementioned\/above-mentioned"],"pinyin":["shang4 shu4"],"word":"上述"},{"definition":["to give\/to grant"],"pinyin":["gei3 yi3"],"word":"給以"},{"definition":["aforestated\/stated above\/the preceding statement"],"pinyin":["qian2 shu4"],"word":"前述"},{"definition":["to order\/to enjoin\/to charge\/to instruct sb to finish sth"],"pinyin":["ze2 ling4"],"word":"責令"},{"definition":["variant of 並|并[bing4]"],"pinyin":["bing4"],"word":"竝"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["according to\/basis\/foundation"],"pinyin":["yi1 ju4"],"word":"依據"},{"definition":["to adopt or carry out (measures, policies, course of action)\/to take"],"pinyin":["cai3 qu3"],"word":"採取"},{"definition":["(archaic) I\/me","to give"],"pinyin":["yu2","yu3"],"word":"予"},{"definition":["should\/ought to"],"pinyin":["ying1 dang1"],"word":"應當"},{"definition":["to deal with sb severely (idiom)"],"pinyin":["cong2 yan2 cheng2 chu3"],"word":"從嚴懲處"}]}