{"definition":["half the work, twice the effect (idiom); the right approach saves effort and leads to better results\/a stitch in time saves nine"],"pinyin":["shi4 ban4 gong1 bei4"],"simplified":["事半功倍"],"rank":22007.0,"normalized_rank":0.3079064821680915,"fraction":0.000001960771484009473,"cumulative_fraction":0.9791805939267388,"word":"事半功倍","characters":[{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"},{"definition":["half\/semi-\/incomplete\/(after a number) and a half"],"pinyin":["ban4"],"word":"半"},{"definition":["meritorious deed or service\/achievement\/result\/service\/accomplishment\/work (physics)"],"pinyin":["gong1"],"word":"功"},{"definition":["(two, three etc) -fold\/times (multiplier)\/double\/to increase or multiply"],"pinyin":["bei4"],"word":"倍"}],"containing_words":[{"definition":["timely handling doubles the effect and halves the effort\/the right approach saves effort and leads to better results\/a stitch in time saves nine"],"pinyin":["ji2 shi2 chu3 li3 , shi4 ban4 gong1 bei4"],"word":"及時處理，事半功倍"}],"sentences":[{"english":"Unique see-through-window & lighting device for easy monitoring.","chinese":"獨到的視明窗及照明設備，檢視功能，事半功倍。"},{"english":"When the pupil cooperates willingly， he learns twice as fast and with half the fatigue.","chinese":"一旦孩子們願意合作，學起來就事半功倍。"},{"english":"Leave metrically together, could get the result of getting twice the result with half the effort.","chinese":"多管齊下，才能達到事半功倍的效果。"},{"english":"Adopting sustainable architecture will bring China great environmental gains with little effort, writes Pan Jiahua .","chinese":"發展可持續建築可成爲中國事半功倍的環保努力。"},{"english":"Wear sunglasses, especially the darker ones.","chinese":"戴上墨鏡，特別是深色的那種，會讓你事半功倍。"},{"english":"Moreover, the Superhelper can help you to get twice the result with half the effort in learning a foreign language.","chinese":"此外，學外語超級小幫手也可助你事半功倍。"},{"english":"Choosing the right option will make your journey more efficient and more economical.","chinese":"正確的選擇會使你的求學之旅花費更少又事半功倍。"},{"english":"Good design in every field accomplishes the “antigravity” trick of accomplishing more with less.","chinese":"在任何領域，好的設計都會做到事半功倍。"},{"english":"As long as people have the same ideology, ideological and political work will yield twice the result with half the effort and more effective.","chinese":"只要人心齊，思想政治工作就會事半功倍，卓有成效。"},{"english":"Management and maintenance of computer science room would maintain most efficient and effective manner.","chinese":"科學的管理維護電腦將會使機房維護工作事半功倍。"},{"english":"Winning respect enhances all you do.","chinese":"贏得尊重有了威信會讓你事半功倍。"}],"related":[{"definition":["twice the effort for half the result"],"pinyin":["shi4 bei4 gong1 ban4"],"word":"事倍功半"},{"definition":["lit. what the heart wishes, the hand accomplishes (idiom) skilled at the job\/entirely in one's element\/going smoothly and easily"],"pinyin":["de2 xin1 ying4 shou3"],"word":"得心應手"},{"definition":["lit. set up a pole and see the shadow (idiom); fig. instant effect\/quick results"],"pinyin":["li4 gan1 jian4 ying3"],"word":"立竿見影"},{"definition":["to produce the opposite of the desired result"],"pinyin":["shi4 de2 qi2 fan3"],"word":"適得其反"},{"definition":["lit. sharpening the axe won't make the wood-splitting take longer (idiom)\/fig. time invested in preparations is not lost\/a beard well lathered is half shaved"],"pinyin":["mo2 dao1 bu4 wu4 kan3 chai2 gong1"],"word":"磨刀不誤砍柴工"},{"definition":["bringing great benefits (idiom); very useful\/of great service\/to help greatly\/to serve one well"],"pinyin":["da4 you3 bi4 yi4"],"word":"大有裨益"},{"definition":["to comprehend (new things) by analogy"],"pinyin":["chu4 lei4 pang2 tong1"],"word":"觸類旁通"},{"definition":["lit. to paint holding two brushes (idiom); fig. to work on two tasks at the same time\/to attack one problem from two angles at the same time"],"pinyin":["shuang1 guan3 qi2 xia4"],"word":"雙管齊下"},{"definition":["lit. like a tiger that has grown wings\/with redoubled power (idiom)"],"pinyin":["ru2 hu3 tian1 yi4"],"word":"如虎添翼"},{"definition":["grasp this fundamental point and all the rest will follow (idiom)"],"pinyin":["yi1 tong1 bai3 tong1"],"word":"一通百通"},{"definition":["appropriate\/suitable"],"pinyin":["de2 dang4"],"word":"得當"},{"definition":["to pursue unremittingly (idiom); to persevere"],"pinyin":["chi2 zhi1 yi3 heng2"],"word":"持之以恆"},{"definition":["to be successful in every endeavor"],"pinyin":["wu2 wang3 bu4 li4"],"word":"無往不利"},{"definition":["lit. to prescribe the right medicine for an illness (idiom); fig. to study a problem to find the right way to solve it\/to take appropriate steps"],"pinyin":["dui4 zheng4 xia4 yao4"],"word":"對症下藥"},{"definition":["to study sth to apply it\/study for practical applications"],"pinyin":["xue2 yi3 zhi4 yong4"],"word":"學以致用"},{"definition":["the one and only way\/the only proper course to take"],"pinyin":["bu4 er4 fa3 men2"],"word":"不二法門"}]}