{"definition":["position\/authority\/responsibility"],"pinyin":["shi4 quan2"],"simplified":["事权"],"rank":26295.0,"normalized_rank":0.3679011654750745,"fraction":0.0000013168641719214899,"cumulative_fraction":0.9860996870297628,"word":"事權","characters":[{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"},{"definition":["authority\/power\/right\/(literary) to weigh\/expedient\/temporary","surname Quan"],"pinyin":["Quan2","quan2"],"word":"權"}],"containing_words":[],"sentences":[{"english":"Article 105 Women enjoy equal rights with men in civil law.","chinese":"第一百零五條婦女享有同男子平等的民事權利。"},{"english":"Article 105 Women shall enjoy equal civil rights with men.","chinese":"第一百零五條婦女享有同男子平等的民事權利。"},{"english":"They don't have to pass civil-rights bills for Africans.","chinese":"因爲是非洲人，他們不能通過民事權利法案。"},{"english":"The fourth part focuses on the scope of supervision of provincial powers.","chinese":"肆爲省政府的事權監督範圍。"},{"english":"Self-help is the legal reinforcement to protect the civil right.","chinese":"自力救濟是一種強化民事權利保護的法律制度。"},{"english":"The concept of civil right is the key concept of civil law discipline.","chinese":"民事權利是民法學的核心概念。"},{"english":"The capacity for civil liability has nothing to do with the capacity for civil conduct.","chinese":"一切自然人都具有民事權利能力和民事責任能力。"},{"english":"In our country, it is still a new-style civil right.","chinese":"在中國，他還是一種新型的民事權利。"},{"english":"Civil rights means you're asking Uncle Sam to treat you right.","chinese":"民事權利意味着你要向山姆大叔討回你的公道。"},{"english":"Partners also have a say in the terms of the credit agreements.","chinese":"合夥夥伴對信用卡協議中的條款擁有話事權。"},{"english":"Water conservancy projects involve a variety of civil rights, in particular water rights.","chinese":"水工程涉及多種民事權利類型，水權只是其中一類。"},{"english":"Have the opposite and independent personnel power with the finance power.","chinese":"具有相對獨立的人事權和財務權。"},{"english":"Civil rights keeps you in his pocket.","chinese":"民事權利使你藏於他的口袋中。"}],"related":[]}