{"definition":["binary tree"],"pinyin":["er4 cha1 shu4"],"simplified":["二叉树"],"rank":60254.0,"normalized_rank":0.8430316343234509,"fraction":4.014384738703134e-8,"cumulative_fraction":0.9998252650725992,"word":"二叉樹","characters":[{"definition":["two\/2\/(Beijing dialect) stupid"],"pinyin":["er4"],"word":"二"},{"definition":["fork\/pitchfork\/prong\/pick\/cross\/intersect\/\"X\"","to cross\/be stuck","to diverge\/to open (as legs)"],"pinyin":["cha1","cha2","cha3"],"word":"叉"},{"definition":["tree\/CL:棵[ke1]\/to cultivate\/to set up"],"pinyin":["shu4"],"word":"樹"}],"containing_words":[],"sentences":[{"english":"Because the red-black tree is a binary tree, the time complexities of lookup operations are logarithmic.","chinese":"由於紅黑樹是二叉樹，查找操作的時間複雜度爲對數。"},{"english":"In this paper, a new general binary tree drawing algorithm frame is designed by using genetic algorithms.","chinese":"用遺傳算法設計了一種通用二叉樹畫樹算法框架。"},{"english":"Write a function to find the depth of a binary tree.","chinese":"寫個程序找到一個二叉樹的深度。"},{"english":"Given a binary tree, find its maximum depth.","chinese":"給定一個二叉樹，找到他的深度。"},{"english":"Given a binary tree, return the postorder traversal of its nodes' values. For exampl …","chinese":"原始題目如下，意爲後序遍歷二叉樹，不要用遞歸。"},{"english":"Instead we will use a data structure called a binary tree.","chinese":"我們可以使用一種稱爲二叉樹的數據結構來取而代之。"},{"english":"The multiclass SVM methods based on binary tree are proposed.","chinese":"基於二叉樹的多類SVM方法的建議。"},{"english":"At last, its approximate solution is seeked by the binomial tree.","chinese":"隨後又運用了二叉樹方法求出其近似解。"},{"english":"Given a binary tree, return the bottom-up level order traversal of its nodes' values. (ie, from left to right, level by level from leaf to root).","chinese":"給出一棵二叉樹，返回其節點值的後序遍歷。"},{"english":"The binomial tree is one of the numerical methods in common use.","chinese":"二叉樹方法就是比較常用的數值方法之一。"},{"english":"Binary trees are discussed extensively in the sections of this chapter.","chinese":"這一節大概說一下二叉樹。"},{"english":"The point is that polygons are stored in a binary tree.","chinese":"多邊形是以點的形式在二叉樹中存儲的。"},{"english":"Ohe of the important advantages of representing 2-D shape by binary tree its clear hierarchy.","chinese":"用二叉樹表示二維圖形的一個重要優點是層次分明。"},{"english":"Given the root of a tree, you are asked to find the most frequent subtree sum.","chinese":"給定一棵二叉樹，求其最頻繁子樹和。"},{"english":"Binary Tree, the operation and use.","chinese":"二叉樹的操作和使用。"},{"english":"The article presents the recursive and non-recursive algorithms of postorder -traversing binary tree.","chinese":"本文論述了後序遍歴二叉樹的遞歸算法和非遞歸算法。"}],"related":[]}