{"definition":["objection\/differing opinion"],"pinyin":["er4 hua4"],"simplified":["二话"],"rank":48175.0,"normalized_rank":0.6740307528717138,"fraction":1.74297286473147e-7,"cumulative_fraction":0.9986698223765528,"word":"二話","characters":[{"definition":["two\/2\/(Beijing dialect) stupid"],"pinyin":["er4"],"word":"二"},{"definition":["dialect\/language\/spoken words\/speech\/talk\/words\/conversation\/what sb said\/CL:種|种[zhong3],席[xi2],句[ju4],口[kou3],番[fan1]"],"pinyin":["hua4"],"word":"話"}],"containing_words":[{"definition":["not saying anything further (idiom); not raising any objection\/without demur"],"pinyin":["er4 hua4 bu4 shuo1"],"word":"二話不說"},{"definition":["see 二話不說|二话不说[er4 hua4 bu4 shuo1]"],"pinyin":["er4 hua4 mei2 shuo1"],"word":"二話沒說"}],"sentences":[{"english":"Without further ado, he took out his pen and lent it to me.","chinese":"他二話沒說，拿出筆來，把它借給了我。"},{"english":"Without saying a word, the militiamen shot and killed him.","chinese":"民兵們二話不說，開槍把他打死了。"},{"english":"Two guys two words don't say of pull me to go toward to drill in forest.","chinese":"兩個傢伙二話不說的拉着我就往森林裏鑽。"},{"english":"He took a quick look and without another word jumped into the icy water.","chinese":"他匆忙看了一眼，二話沒說，就跳進冰冷刺骨的水裏。"},{"english":"But the police just came through the gate and did this.","chinese":"但那時那些警察就是二話不說衝進來，翻箱倒櫃。"},{"english":"Suddenly, without another word, he unlocked my cell and silently led me out.","chinese":"突然，他二話不說地打開牢門，安靜地領着我向外走。"},{"english":"Without a word, the demons did exactly as the king had asked.","chinese":"兩個魔鬼二話不說就照大仁慈王的要求去做了。"},{"english":"The lawyer, without a word, wrote the butcher a check for $9.80.","chinese":"律師二話不說，給屠夫寫了張9塊8的支票。"},{"english":"Without a word , the young man rode back quickly to his home.","chinese":"年輕人二話沒說就跑回了家。"},{"english":"Coach a laugh, and the word, you pull me up.","chinese":"教練一笑，二話不說，就把我拉了起來。"},{"english":"Without a word, the larger gangster followed.","chinese":"那個大塊頭二話沒說，跟着走了過去。"},{"english":"He left the room without saying anything.","chinese":"他二話沒說離開了房間。"},{"english":"I went to a freak show and they let me in for nothing.","chinese":"我去看一場怪誕秀，他們二話不說就讓我進去了。"},{"english":"When they saw me they didn't say anything, then when they came near to me they started to beat me.","chinese":"他們看到我之後二話不說就開始走近我打我。"},{"english":"She resigned from to the manager without hesitation.","chinese":"她二話沒說，立刻向經理辭了職。"}],"related":[]}