{"definition":["Erlitou (Xia dynasty 夏朝[Xia4 chao2] archaeological site at Yanshi 偃師|偃师[Yan3 shi1] in Luoyang 洛陽|洛阳[Luo4 yang2], Henan)"],"pinyin":["Er4 li3 tou5"],"simplified":["二里头"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"二里頭","characters":[{"definition":["two\/2\/(Beijing dialect) stupid"],"pinyin":["er4"],"word":"二"},{"definition":["Li (surname)","li, ancient measure of length, approx. 500 m\/neighborhood\/ancient administrative unit of 25 families\/(Tw) borough, administrative unit between the township 鎮|镇[zhen4] and neighborhood 鄰|邻[lin2] levels"],"pinyin":["Li3","li3"],"word":"里"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"}],"containing_words":[],"sentences":[{"english":"The choice of Erlitou Site went through careful consideration.","chinese":"二里頭都城的選址經過了周密的考慮。"},{"english":"At this time, Erlitou Culture displayed a trend of decline and fall.","chinese":"二里頭文化勢力在本期呈現的是一種衰亡趨勢。"},{"english":"There are many east cultural factors in Erlitou site.","chinese":"二里頭遺址存在着濃厚的東方文化因素。"},{"english":"Dashigu Wall City of Erlitou Culture was discovered in Zhengzhou of the east.","chinese":"東邊的鄭州還出現了大師姑二里頭文化城址。"},{"english":"The period of Erlitou Culture is the time of the Chinese courtesy formation.","chinese":"二里頭文化時期也是中國禮制體系形成時期。"},{"english":"The congregativeness and pervasion effects of the city caused the quantum jump of Xia civilization.","chinese":"二里頭城市文明的聚集效應和輻射效應。"},{"english":"The later east cultural factors behind the second stage of Erlitou culture come from Yueshi culture.","chinese":"二里頭文化二期以後的東方因素，均來自嶽石文化。"},{"english":"There exists a debate as to whether or not Erlitou culture was the site of the Xia dynasty.","chinese":"存在着爭論，不論是二里頭文化遺址的夏代。"},{"english":"Erlitou Culture is the culture of Chinese bronze vessel.","chinese":"二里頭文化是中國早期青銅文化。"}],"related":[]}