{"definition":["binary system (math.)"],"pinyin":["er4 jin4 zhi4"],"simplified":["二进制"],"rank":45662.0,"normalized_rank":0.6388706224728219,"fraction":2.2392967960620393e-7,"cumulative_fraction":0.9981725879827642,"word":"二進制","characters":[{"definition":["two\/2\/(Beijing dialect) stupid"],"pinyin":["er4"],"word":"二"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"},{"definition":["system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4"],"word":"制"}],"containing_words":[{"definition":["binary code\/binary encoding"],"pinyin":["er4 jin4 zhi4 bian1 ma3"],"word":"二進制編碼"}],"sentences":[{"english":"Brita in grant her colony independence in the year after the second world war.","chinese":"二進制戰後的年代理英國准許其殖民地獨立。"},{"english":"So just as a little sanity check, number 15 in binary would be?","chinese":"再來做個測試，那麼二進制中15怎樣表達？"},{"english":"In chapter 3, it focus on the binary model of Artificial Immune System.","chinese":"第3章就集中介紹了人工免疫系統的二進制模型。"},{"english":"Binary source data must be a single-dimensioned array of unsigned char.","chinese":"二進制源數據必須是一維的無符號字符數組。"},{"english":"These notations, of course, do not change the bit representation of the value, which is always binary.","chinese":"當然這些進制不會改變其二進制位的表示形式。"},{"english":"Stuxnet is computer code, bits of binary electronic data.","chinese":"Stuxnet是電腦編碼，二進制的電腦數據。"},{"english":"It is a binary operator and can take at most two arguments.","chinese":"它是一個二進制的操作符，最多隻能接受兩個參數。"},{"english":"Figure1 gives a diagrammatic representation of the steps in analysing a binary statically for the presence of malicious behaviour.","chinese":"圖1給出靜態分析二進制代碼檢查惡意行爲的圖示。"},{"english":"The Hamming distance between two integers is the number of positions at which the corresponding bits are different.","chinese":"兩個整數的漢明距離是指其二進制不相等的位的個數。"},{"english":"Computers use a binary code, or base-2 system, to convey information.","chinese":"計算機使用二進制的代碼或基2碼系統來傳達信息。"},{"english":"Of or relating to a system of numeration having2 as its base.","chinese":"表示二進制信息的一種信道編碼方法。"},{"english":"It is source code for developers. No binaries at this time.","chinese":"這只是爲開發者提供源碼，沒有二進制文件。"},{"english":"Why is there binary incompatibility?","chinese":"爲什麼存在二進制不兼容性？"},{"english":"We use only binary protocols because they are the most efficient.","chinese":"我們只使用二進制協議，因爲它們更加有效。"},{"english":"The network design used a recursive decomposition approach and was based on the binary splitting concept.","chinese":"該網絡採用了循環重建法，以二進制擴散概念爲基礎。"},{"english":"Download the precompiled binary image.","chinese":"下載預編譯的二進制映像。"}],"related":[]}