{"definition":["Abe (short form for Abraham)\/Abel, a figure of Jewish, Christian and Muslim mythologies"],"pinyin":["Ya4 bo2"],"simplified":["亚伯"],"rank":66542.0,"normalized_rank":0.931008912456452,"fraction":1.0802344387782981e-8,"cumulative_fraction":0.9999739800719136,"word":"亞伯","characters":[{"definition":["Asia\/Asian\/Taiwan pr. [Ya3]","second\/next to\/inferior\/sub-\/Taiwan pr. [ya3]"],"pinyin":["Ya4","ya4"],"word":"亞"},{"definition":["father's elder brother\/senior\/paternal elder uncle\/eldest of brothers\/respectful form of address\/Count, third of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]","one hundred (old)","variant of 霸[ba4]"],"pinyin":["ba4","bai3","bo2"],"word":"伯"}],"containing_words":[{"definition":["Abraham (name)\/Abraham, father of Judaism and Islam in the Bible and Quran\/same as Ibrahim 易卜拉辛"],"pinyin":["Ya4 bo2 la1 han3"],"word":"亞伯拉罕"},{"definition":["Apert syndrome"],"pinyin":["Ya4 bo2 shi4 zheng4"],"word":"亞伯氏症"}],"sentences":[{"english":"Even as Abraham believed God, and it was accounted to him for righteousness.","chinese":"正如，亞伯拉罕信神，這就算爲他的義。"},{"english":"In place of Isaac, God provided a ram for Abraham to sacrifice.","chinese":"神爲亞伯拉罕預備了獻祭的公羊，代替以撒。"},{"english":"An Egyptian slave given to Abraham by the Pharaoh of Egypt.","chinese":"埃及的法老給了亞伯拉罕一個僕婢。"},{"english":"“The first was just a warning, ” Abrahim said.","chinese":"“剛纔第一次不過是警告，”亞伯拉罕說。"},{"english":"\"O Lord, God of my master, Abraham,\" he prayed.","chinese":"“耶和華我主人亞伯拉罕的神阿，”他禱告說。"},{"english":"I also. The seed of Abraham are they?","chinese":"我也是。他們是亞伯拉罕的後裔麼？"},{"english":"Albert enjoys privacy and he tends to do things on the sly.","chinese":"亞伯特注重隱私，做事總是很神祕。"},{"english":"Then the king promoted Shadrach, Meshach, and Abednego, in the province of Babylon.","chinese":"那時王在巴比倫省，高升了沙得拉，米煞，亞伯尼歌。"},{"english":"Abrahim and my father stopped going to the port at night.","chinese":"亞伯拉罕和我父親晚上不再去港口了。"},{"english":"When Abraham's servant heard what they said, he bowed down to the ground before the Lord.","chinese":"亞伯拉罕的僕人聽見他們這話，就向耶和華俯伏在地。"},{"english":"What have you learned from Abraham's first detour down to Egypt?","chinese":"亞伯拉罕第一次下埃及的經驗給你何啓示？"},{"english":"Ah, you see, Abraham knew about it… but he did.","chinese":"不錯，亞伯拉罕早知道這件事了，但是他沒。"},{"english":"Abram was seventy-five years old when he set out from Haran.","chinese":"亞伯蘭出哈蘭的時候年七十五歲。"},{"english":"In the Old Testament, the son of Abraham who was cast out after the birth of Isaac.","chinese":"以實瑪利舊約中亞伯拉罕之子，在以撒出生後被棄。"},{"english":"Abraham set apart seven ewe lambs from the flock.","chinese":"亞伯拉罕把七支母羊羔另放在一處。"},{"english":"Abraham makes his servant put his hand under his thigh while swearing to God.","chinese":"亞伯拉罕讓他的僕人把手放在他的大腿下向上帝發誓。"}],"related":[]}