{"definition":["Asa (?-870 BC), third king of Judah and fifth king of the House of David (Judaism)"],"pinyin":["Ya4 sa1"],"simplified":["亚撒"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"亞撒","characters":[{"definition":["Asia\/Asian\/Taiwan pr. [Ya3]","second\/next to\/inferior\/sub-\/Taiwan pr. [ya3]"],"pinyin":["Ya4","ya4"],"word":"亞"},{"definition":["to let go\/to cast\/to let loose\/to discharge\/to give expression to","to scatter\/to sprinkle\/to spill"],"pinyin":["sa1","sa3"],"word":"撒"}],"containing_words":[{"definition":["Eleazar (son of Eluid)"],"pinyin":["Yi3 li4 ya4 sa3"],"word":"以利亞撒"}],"sentences":[{"english":"Asa cut down her image, crushed it, and burned it at the brook Kidron.","chinese":"亞撒砍下他的偶像，搗得粉碎，燒在汲淪溪邊。"},{"english":"In the twentieth year of Jeroboam king of Israel, Asa began to reign over Judah.","chinese":"以色列王耶羅波安二十年，亞撒登基作猶大王。"},{"english":"And there was war between Asa and Baasha king of Israel all their days.","chinese":"亞撒和以色列王巴沙在世的日子常常爭戰。"},{"english":"Asa cut the pole down, broke it up and burned it in the Kidron Valley.","chinese":"亞撒砍下她的偶像，搗得粉碎，燒在汲淪溪邊。"},{"english":"Asa was angry with the seer because of this; he was so enraged that he put him in prison.","chinese":"亞撒因此惱恨先見，將他囚在監裏。"},{"english":"13 and Asa and his army pursued them as far as Gerar.","chinese":"亞撒和跟隨他的軍兵追趕他們，直到基拉耳。"},{"english":"And there was no more war until the thirty-fifth year of the reign of Asa.","chinese":"從這時直到亞撒三十五年，都沒有爭戰的事。"},{"english":"There was war between Asa and Baasha king of Israel throughout their reigns.","chinese":"亞撒和以色列王巴沙在世的日子常常爭戰。"},{"english":"Baasha killed Nadab in the third year of Asa king of Judah and succeeded him as king.","chinese":"在猶大王亞撒第三年巴沙殺了他，篡了他的位。"},{"english":"Even in the third year of Asa king of Judah did Baasha slay him, and reigned in his stead.","chinese":"在猶大王亞撒第三年巴沙殺了他，篡了他的位。"},{"english":"In the twenty and seventh year of Asa king of Judah did Zimri reign seven days in Tirzah.","chinese":"猶大王亞撒二十七年，心利在得撒作王七日。"}],"related":[]}