{"definition":["see 歐亞|欧亚[Ou1 Ya4]"],"pinyin":["Ya4 Ou1"],"simplified":["亚欧"],"rank":21287.0,"normalized_rank":0.2978327480307249,"fraction":0.000002097990453259689,"cumulative_fraction":0.9777203769516646,"word":"亞歐","characters":[{"definition":["Asia\/Asian\/Taiwan pr. [Ya3]","second\/next to\/inferior\/sub-\/Taiwan pr. [ya3]"],"pinyin":["Ya4","ya4"],"word":"亞"},{"definition":["(used for transliteration)\/old variant of 謳|讴[ou1]","Europe\/abbr. for 歐洲|欧洲[Ou1 zhou1]\/surname Ou"],"pinyin":["Ou1","ou1"],"word":"歐"}],"containing_words":[{"definition":["Eurasian land bridge (rail line linking China and Europe)"],"pinyin":["Ya4 Ou1 da4 lu4 qiao2"],"word":"亞歐大陸橋"},{"definition":["Eurasian continent"],"pinyin":["Ya4 ou1 da4 lu4"],"word":"亞歐大陸"},{"definition":["Eurasian hinterland (i.e. Central Asia including Xinjiang)"],"pinyin":["Ya4 ou1 da4 lu4 fu4 di4"],"word":"亞歐大陸腹地"}],"sentences":[{"english":"Only by being open and inclusive can a country prosper and can our continent prosper.","chinese":"只有開放兼容，國家才能富強，亞歐大陸才能興旺。"},{"english":"Economic History, History of Science and Technology, Asian-European relations.","chinese":"經濟史，科學技術史，亞歐關係。"},{"english":"Pass for the second Eurasian continental bridge an important railway crossings.","chinese":"阿拉山口爲第二座亞歐大陸橋的重要鐵路口岸。"},{"english":"Chinese Premier Li Peng attended the first Asia-Europe summit.","chinese":"李鵬總理出席了首屆亞歐首腦會議。"},{"english":"This will give a great impetus to the ASEM process.","chinese":"這將是對亞歐會議進程的一大推進。"},{"english":"Xinjiang is situated in the northwest of China and in the center of Eurasian continents.","chinese":"新疆位於中國西北部，地處亞歐大陸中心。"},{"english":"Asia and Europe must deepen their financial cooperation in this sector.","chinese":"亞歐必須深化財金合作。"},{"english":"Over the past five years, ASEM has initiated extensive dialogues and cooperation of various forms.","chinese":"五年來，亞歐會議開展了廣泛多樣的對話與合作。"},{"english":"With marine compare with photograph of the first overbridge , bridge of new Asia-Europe mainland lacks competition ability.","chinese":"與海運和第一陸橋相比，新亞歐大陸橋缺乏競爭力。"},{"english":"It is a great pleasure to meet with you and other colleagues from ASEM members in Berlin.","chinese":"很高興在柏林與亞歐會議成員的同事們相聚。"},{"english":"Did they travel across the Asia-Euro Land merely by camel caravans and on foot?","chinese":"他們真的只是靠駝隊和雙腳穿越的亞歐大陸嗎？"},{"english":"We warmly welcome the convening of Asia-Europe meeting in London.","chinese":"我們熱烈歡迎亞歐會議在倫敦召開。"},{"english":"Strong earthquakes successively occurred on the eastern and western parts of the Eurasian belt.","chinese":"亞歐帶東段和西段繼續發生強震。"},{"english":"Eurasian countries have strong economic complementarities and enjoy promising prospects of cooperation between industries and businesses.","chinese":"亞歐國家經濟互補性強，產業和企業合作前景廣闊。"},{"english":"The cooperation between Chinese and Asian-European has moved on to the new level.","chinese":"中國與亞歐各國的互利合作正在步入一個全新的階段。"},{"english":"The Eurasian seismic belt still remained in quiescence.","chinese":"亞歐帶仍保持平靜。"}],"related":[]}