{"definition":["sulfurous acid H2SO3"],"pinyin":["ya4 liu2 suan1"],"simplified":["亚硫酸"],"rank":45480.0,"normalized_rank":0.6363242063436543,"fraction":2.2757912027775226e-7,"cumulative_fraction":0.9981315222866636,"word":"亞硫酸","characters":[{"definition":["Asia\/Asian\/Taiwan pr. [Ya3]","second\/next to\/inferior\/sub-\/Taiwan pr. [ya3]"],"pinyin":["Ya4","ya4"],"word":"亞"},{"definition":["sulfur (chemistry)"],"pinyin":["liu2"],"word":"硫"},{"definition":["sour\/tart\/sick at heart\/grieved\/sore\/aching\/pedantic\/impractical\/to make sarcastic remarks about sb\/an acid"],"pinyin":["suan1"],"word":"酸"}],"containing_words":[{"definition":["sodium hyposulfide Na2S2O3 (hypo)"],"pinyin":["ci4 ya4 liu2 suan1 na4"],"word":"次亞硫酸鈉"}],"sentences":[{"english":"An indirectly determination of water content in sodium pyrosulphate is introduced.","chinese":"介紹了一種間接測定焦亞硫酸鈉中水分含量的方法。"},{"english":"Chemical wood pulp, sulphite, other than dissolving grades.","chinese":"亞硫酸鹽木漿，但溶解級的除外。"},{"english":"The dissipated sulfur dioxide was absorbed by the lime cream and applied for preparation of the calcium hydrogen sulfite.","chinese":"放出的二氧化硫經石灰乳吸收用來製備亞硫酸氫鈣。"},{"english":"When sodium dithionite is used, the effect is excellent.","chinese":"用連二亞硫酸鈉處理，效果顯著。"},{"english":"Coniferous chemical wood pulp, sulphite other than dissolving grades, unbleached.","chinese":"針葉樹亞硫酸鹽化學木漿，溶解級除外，未漂白。"},{"english":"Pretreatment with alkali before chlorination was studied in bleached acid sulfite poplar pulp production.","chinese":"對酸性亞硫酸鹽法楊木漿的氯化前鹼處理進行了研究。"},{"english":"This paper studied on the HMP bleaching for the magnesium bisulfite pulp of whole stalk kenaf.","chinese":"對紅麻亞硫酸氫鎂漿HMP三段漂白進行了研究。"},{"english":"Extraction of cobalt was masked by sulfite ion.","chinese":"鈷的萃取被亞硫酸鹽離子遮蔽。"},{"english":"3a. But wines in Europe dont have sulfites, right?","chinese":"但歐洲的葡萄酒裏不含亞硫酸鹽，對嗎？"},{"english":"The residues of sulphites in products differ owing to the different processing method and adding amounts.","chinese":"製品中亞硫酸鹽的殘留量因加工方式和添加量而異。"},{"english":"The process for removing the chromium from the silicon steel plant wastewaters was studied by using sodium sulfite as reducer.","chinese":"用亞硫酸鈉爲還原劑對硅鋼含鉻廢水進行了試驗研究。"},{"english":"No refined sugar or sulfites added.","chinese":"無糖精，無亞硫酸鹽，無化學添加。"},{"english":"Wine and other foods containing Sulfites.","chinese":"葡萄酒及其它含有亞硫酸鹽的食物。"},{"english":"Sodium pyrosulfite on the impact was not obvious.","chinese":"焦亞硫酸鈉對迷迭香酸的影響不明顯。"},{"english":"This paper describes the study of peroxide bleaching for neutro-sulfite reed pulp.","chinese":"研究了中性亞硫酸鹽葦漿的過氧化物漂白。"},{"english":"For that, we use powdered sodium metabisulfite.","chinese":"因此我們要用到粉末狀的焦亞硫酸鈉。"}],"related":[]}