{"definition":["nitrous acid"],"pinyin":["ya4 xiao1 suan1"],"simplified":["亚硝酸"],"rank":24298.0,"normalized_rank":0.3399605445412953,"fraction":0.00000158356529619824,"cumulative_fraction":0.9832162944644964,"word":"亞硝酸","characters":[{"definition":["Asia\/Asian\/Taiwan pr. [Ya3]","second\/next to\/inferior\/sub-\/Taiwan pr. [ya3]"],"pinyin":["Ya4","ya4"],"word":"亞"},{"definition":["saltpeter\/to tan (leather)"],"pinyin":["xiao1"],"word":"硝"},{"definition":["sour\/tart\/sick at heart\/grieved\/sore\/aching\/pedantic\/impractical\/to make sarcastic remarks about sb\/an acid"],"pinyin":["suan1"],"word":"酸"}],"containing_words":[{"definition":["amyl nitrite"],"pinyin":["ya4 xiao1 suan1 yi4 wu4 zhi3"],"word":"亞硝酸異戊酯"},{"definition":["sodium nitrite"],"pinyin":["ya4 xiao1 suan1 na4"],"word":"亞硝酸鈉"},{"definition":["nitrite"],"pinyin":["ya4 xiao1 suan1 yan2"],"word":"亞硝酸鹽"}],"sentences":[{"english":"The rate of decomposition was not affected by methylene blue and ethanol.","chinese":"亞甲藍和乙醇不影響過亞硝酸根的分解速率。"},{"english":"What is the safe dose of sodium nitrite ?","chinese":"什麼是安全劑量的亞硝酸鈉？"},{"english":"Do several partial water changes and test for Nitrites.","chinese":"局部換水，並測試亞硝酸含量。"},{"english":"Results There nitrite was detected from the gastric juice of the poisoning patients.","chinese":"結果在患者的洗胃液及嘔吐物中均檢出亞硝酸鹽。"},{"english":"It is possible for meat to remain pinkish-red all through the cooking if it has been exposed to nitrites.","chinese":"亞硝酸鹽處理過的肉烹飪時也能保持粉紅色。"},{"english":"It is a difficult problem to decrease the amount of nitrite in a normal limit of vegetables pickling.","chinese":"亞硝酸鹽含量超標一直是醃漬蔬菜生產中的一個難題。"},{"english":"The analytic methods of nitrite in edible salt were described.","chinese":"文章提出了食用鹽中亞硝酸鹽的測定方法。"},{"english":"The reaction of potassium periodate and orange red can be catalyzed by nitrous ions.","chinese":"高碘酸鉀與甲基紅的反應可爲亞硝酸根所催化。"},{"english":"Nitrite is used for curing meat.","chinese":"亞硝酸鹽一般用於加工肉類食品。"},{"english":"AIM To study the sodium nitrite induced DNA mutation by convolution spectrometry (CS).","chinese":"目的採用褶合光譜法考察亞硝酸鈉致DNA突變。"},{"english":"N-Nitrosamine can be formed in vivo by the interaction of nitrites with secondary amines .","chinese":"亞硝胺可由其前體物質亞硝酸鹽及二級胺在體內合成。"},{"english":"The polymerization of acrylonitrile in aqueous nitric acid solution with sodium nitrite as initiator has been studied.","chinese":"研究了亞硝酸鈉引發硝酸溶液中丙烯腈的聚合反應。"},{"english":"Instead of silver nitrite mercuric nitrite may be used.","chinese":"可以用亞硝酸汞來代替亞硝酸銀。"},{"english":"Methods The nitrite was detected from samples by N-Naphthylethylenediamine Dihydrochloride.","chinese":"方法用鹽酸萘乙二胺法檢測樣品中的亞硝酸鹽。"},{"english":"Chlorpromazine hydrochloride (CPH ) is oxidized by hydrogen peroxide under the catalyzing of nitrite.","chinese":"亞硝酸鹽催化氯丙嗪與過氧化氫的氧化反應。"},{"english":"The peak of nitrite in the supernatant was at 6 h.","chinese":"細胞上清中的亞硝酸鹽含量高峯在6小時。"}],"related":[]}