{"definition":["see 急待[ji2 dai4]"],"pinyin":["ji2 dai4"],"simplified":["亟待"],"rank":14138.0,"normalized_rank":0.1978089628251228,"fraction":0.000004573771004838058,"cumulative_fraction":0.9552760523101824,"word":"亟待","characters":[{"definition":["repeatedly\/frequently","urgent"],"pinyin":["ji2","qi4"],"word":"亟"},{"definition":["to stay","to wait\/to treat\/to deal with\/to need\/going to (do sth)\/about to\/intending to"],"pinyin":["dai1","dai4"],"word":"待"}],"containing_words":[],"sentences":[{"english":"Even with Yahoo's help, Microsoft still has its work cut out.","chinese":"即使在雅虎的幫助下，微軟仍然有大量問題亟待解決。"},{"english":"But we have to admit that the system still has a few aspects needed to be consummated immediately.","chinese":"但是毋庸諱言，該制度仍有一些方面亟待完善。"},{"english":"The issue of juvenile delinquency is pressing for our serous consideration.","chinese":"青少年犯罪問題亟待我們的認真思考。"},{"english":"Some problems to be faced during development of micro - latexes were pointed out.","chinese":"指出了目前超微膠乳研究中亟待解決的問題。"},{"english":"Retrieval in multi-library brings insistent demands for the transformation of retrieval conditions.","chinese":"檢索條件轉換是多構件庫檢索亟待解決的問題。"},{"english":"For the sake of chimpanzee survival throughout Africa, those questions urgently need to be studied.","chinese":"爲了保證所有非洲黑猩猩的生存，這些問題亟待解決。"},{"english":"Thus, in power supply and consumption system, harmonic control is the problem that needs to be solved urgently.","chinese":"因此諧波治理已成爲供用電亟待解決的問題。"},{"english":"Psychosomatic disease is an urgent issue in the medical field, nowadays.","chinese":"心身疾病是當今醫學亟待解決的課題。"},{"english":"The present Maxim's philosophical principle needs to be innovated.","chinese":"現行馬克思主義哲學原理亟待創新。"},{"english":"Therefore, it is urgently needed to reform and perfect.","chinese":"因此，我國發回重審制度亟待改革與完善。"},{"english":"The demoralization during the social conversion period is a big problem to be resolved urgently for the moral construction.","chinese":"道德失範是社會轉型期道德建設亟待解決的一大難題。"},{"english":"Work-related injury insurance for Migrant workers must be resolved.","chinese":"農民工工傷保險問題亟待解決。"},{"english":"Is this an urgent issue or an eventual one?","chinese":"這是亟待解決的問題還是最終問題？"},{"english":"Lurking behind progress, though, are oldideas waiting to be reapplied.","chinese":"不過，進步的背後，隱藏着亟待復辟的舊觀點。"},{"english":"The exploitation and utilization of potential curriculum should follow the principle of directionality, systematicity, practicality and innovation.","chinese":"潛在課程是一種巨大的教育資源，亟待開發和利用。"},{"english":"It is imperative on us to attempt a correct evaluation of esthetic fad theoretically.","chinese":"正確評價審美時尚，是當前一個亟待解決的理論課題。"}],"related":[{"definition":["to urgently need\/urgent need"],"pinyin":["ji2 xu1"],"word":"亟需"},{"definition":["pressing in on one's eyelashes (idiom); imminent"],"pinyin":["po4 zai4 mei2 jie2"],"word":"迫在眉睫"},{"definition":["not yet (done)\/pending"],"pinyin":["you3 dai4"],"word":"有待"},{"definition":["dilemma\/predicament\/difficult situation"],"pinyin":["kun4 ju2"],"word":"困局"},{"definition":["unresolved\/awaiting solution"],"pinyin":["dai4 jie3"],"word":"待解"},{"definition":["to urgently need\/urgent need"],"pinyin":["ji2 xu1"],"word":"急需"},{"definition":["circumstances require action (idiom); absolutely necessary\/imperative"],"pinyin":["shi4 zai4 bi4 xing2"],"word":"勢在必行"},{"definition":["hard to (predict, imagine etc)"],"pinyin":["nan2 yi3"],"word":"難以"},{"definition":["urgency"],"pinyin":["po4 qie4 xing4"],"word":"迫切性"},{"definition":["to brook no delay\/to demand immediate action"],"pinyin":["ke4 bu4 rong2 huan3"],"word":"刻不容緩"},{"definition":["a heavy load and a long road\/fig. to bear heavy responsibilities through a long struggle (cf Confucian Analects, 8.7)"],"pinyin":["ren4 zhong4 dao4 yuan3"],"word":"任重道遠"},{"definition":["chronic disease"],"pinyin":["gu4 ji2"],"word":"痼疾"},{"definition":["day by day\/more and more\/increasingly\/more and more with each passing day"],"pinyin":["ri4 yi4"],"word":"日益"},{"definition":["current\/today's\/modern\/present\/to be facing (us)"],"pinyin":["dang1 qian2"],"word":"當前"},{"definition":["to face sth\/to be confronted with"],"pinyin":["mian4 lin2"],"word":"面臨"},{"definition":["ineradicable disease\/fig. deep-seated problem\/perennial problem"],"pinyin":["wan2 ji2"],"word":"頑疾"}]}