{"definition":["interdisciplinary\/interdisciplinary subject (in science)"],"pinyin":["jiao1 cha1 xue2 ke1"],"simplified":["交叉学科"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"交叉學科","characters":[{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"},{"definition":["fork\/pitchfork\/prong\/pick\/cross\/intersect\/\"X\"","to cross\/be stuck","to diverge\/to open (as legs)"],"pinyin":["cha1","cha2","cha3"],"word":"叉"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"},{"definition":["branch of study\/administrative section\/division\/field\/branch\/stage directions\/family (taxonomy)\/rules\/laws\/to mete out (punishment)\/to levy (taxes etc)\/to fine sb\/CL:個|个[ge4]"],"pinyin":["ke1"],"word":"科"}],"containing_words":[],"sentences":[{"english":"Medical anthropology is a new intersectional subject.","chinese":"醫學人類學是一門新興交叉學科。"},{"english":"The tractor shape design is a highly integrated cross-disciplinary.","chinese":"拖拉機形態設計是一項高度綜合性的交叉學科。"},{"english":"This is a young and intercross subject, full of youthful spirit and expectation .","chinese":"這是一門年輕的充滿朝氣與希望的交叉學科。"},{"english":"It is a new subject.","chinese":"它是一門新興的交叉學科。"},{"english":"The research direction of Haijun Zhou Group is statistical physics and its interdisciplinary applications.","chinese":"我們的研究方向爲統計物理及其在交叉學科中的應用。"},{"english":"The second part is concerned with the study of cross-disciplinary building in colleges and universities.","chinese":"第二部分，是關於高校交叉學科建設的研究。"},{"english":"Machine vision, a cross-sciences discipline, has a wide application field.","chinese":"機器視覺是一門交叉學科，有着廣泛的應用領域。"},{"english":"Resource science is an overlapping subject.","chinese":"資源學是一門尚在發展的交叉學科。"},{"english":"Speech, as a interdiscipline subject has very profound value of research and application.","chinese":"語音作爲一個交叉學科，具有深遠的研究和應用價值。"},{"english":"ICM, the Interdisciplinary Contest in Modeling, is a part of MCM.","chinese":"交叉學科建模競賽，是MCM的一個組成部分。"},{"english":"Further cross-disciplinary research note the importance and necessity.","chinese":"也進一步說明交叉學科研究的重要性和必要性。"},{"english":"This is the website for Bio-X, Stanford University.","chinese":"這是斯坦福大學生物交叉學科研究中心的網站。"},{"english":"A number of areas are involved in the problem of collision, which is also a typical cross-disciplinary subject.","chinese":"船橋碰撞問題涉及到多個領域，是典型的交叉學科。"}],"related":[]}