{"definition":["to flow together\/confluence (of rivers, airflow, roads)\/(international) cooperation"],"pinyin":["jiao1 hui4"],"simplified":["交汇"],"rank":13098.0,"normalized_rank":0.1832580135155933,"fraction":0.000005275193501909643,"cumulative_fraction":0.950162765075845,"word":"交匯","characters":[{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"},{"definition":["to remit\/to converge (of rivers)\/to exchange"],"pinyin":["hui4"],"word":"匯"}],"containing_words":[{"definition":["confluence (of two rivers)\/junction (of roads)\/(transport) interchange"],"pinyin":["jiao1 hui4 chu4"],"word":"交匯處"}],"sentences":[{"english":"Bus routes and railways, both overground and underground, converged on the station.","chinese":"公共汽車線路和地上地下路軌都在該站交匯。"},{"english":"A September sunrise greets Mount Colden's summit.","chinese":"九月日出與冷山山峯交匯。"},{"english":"Lu Lu pattern (six black keys and six white keys) keyboard is the outcome of the syncretism of Eastern and Western civilizations.","chinese":"“律呂式鍵盤”是東西方文明交匯融合的產物。"},{"english":"The hotel is conveniently located at the junction of Jingyang Road and West Ring Road right in the center of Luyuan District.","chinese":"酒店地處於綠園區中心的景陽大路與西環城路交匯處。"},{"english":"We will seek and expand convergll1g interests with other countries.","chinese":"中國將繼續尋求和擴大同世界各國的利益交匯點。"},{"english":"The panoramic view of the Mangkang County Mangkang County is the interchange of the south and north Sichuan-Tibet lines.","chinese":"《芒康縣全景》芒康縣也是川藏南北線進藏的交匯處。"},{"english":"Mangdan Garden of Ethnic Lifestyles and Customs has been a meeting place of multi-cultural features.","chinese":"芒旦民族風情園是一個多元文化交匯的地方。"},{"english":"The traditional measurement is completed by a multiple-site joint way.","chinese":"傳統的光學測量方法是採取多站交匯方法完成測量。"},{"english":"Till the dawn break upon those mingled seas.","chinese":"直到黎明在交匯的海洋上綻迸。"},{"english":"Then move your eyes back up to meet theirs and smile demurely.","chinese":"然後再次和他們眼神交匯，正經地笑着。"},{"english":"Prions act in the place where chemistry and geometry intersect.","chinese":"普里安處於化學與幾何學交匯之處。"},{"english":"There is one bus station on the corner of Huanghe Road and Wusi Road.","chinese":"在黃河路和五四路交匯處的拐角上有一個汽車站。"},{"english":"At last they turned off the big river into a little side river that came down to join it.","chinese":"最後他們劃離主河道轉入一條與大河交匯的小支流。"},{"english":"The modern research find that the pulse at Cunkou is a multi-dimensional information convergence point.","chinese":"現代研究發現，寸口脈是一個多維信息的交匯點。"},{"english":"Main Street runs perpendicular to Pine Street, and they meet at the city library.","chinese":"梅因街和松樹街垂直交匯，路口就是市立藏書樓。"},{"english":"Meeting of cold and warm air in southern China causes heavy rain in there in spring.","chinese":"冷暖空氣的交匯，加強了華南地區春季的降水。"}],"related":[{"definition":["east and west\/east to west"],"pinyin":["dong1 xi1 fang1"],"word":"東西方"},{"definition":["to connect\/to communicate\/to relate\/(math.) connected"],"pinyin":["lian2 tong1"],"word":"連通"},{"definition":["convergence\/to come together"],"pinyin":["hui4 ju4"],"word":"匯聚"},{"definition":["to link\/to join\/to attach\/connection\/a link (on web page)"],"pinyin":["lian2 jie1"],"word":"連接"},{"definition":["to encounter\/to rendezvous\/to converge\/to meet (a payment)"],"pinyin":["jiao1 hui4"],"word":"交會"},{"definition":["node"],"pinyin":["jie2 dian3"],"word":"節點"},{"definition":["area\/region\/district"],"pinyin":["qu1 yu4"],"word":"區域"},{"definition":["hub (e.g. of traffic network)\/hinge\/pivot\/fulcrum"],"pinyin":["shu1 niu3"],"word":"樞紐"},{"definition":["to link\/to join\/link\/connection"],"pinyin":["xiang1 lian2"],"word":"相連"},{"definition":["confluence (of two rivers)\/junction (of roads)\/(transport) interchange"],"pinyin":["jiao1 hui4 chu4"],"word":"交匯處"},{"definition":["to flow\/to circulate\/to go from place to place\/to be mobile\/(of assets) liquid"],"pinyin":["liu2 dong4"],"word":"流動"},{"definition":["to crisscross\/to intertwine"],"pinyin":["jiao1 cuo4"],"word":"交錯"},{"definition":["traffic hub"],"pinyin":["jiao1 tong1 shu1 niu3"],"word":"交通樞紐"},{"definition":["neighboring\/adjacent\/near\/vicinity"],"pinyin":["lin2 jin4"],"word":"鄰近"},{"definition":["along the line (e.g. railway)\/the region near the line"],"pinyin":["yan2 xian4"],"word":"沿線"},{"definition":["to run through\/a connecting thread from beginning to end\/to link"],"pinyin":["guan4 chuan1"],"word":"貫穿"}]}