{"definition":["(telecom or network) switch"],"pinyin":["jiao1 huan4 qi4"],"simplified":["交换器"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"交換器","characters":[{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"},{"definition":["to exchange\/to change (clothes etc)\/to substitute\/to switch\/to convert (currency)"],"pinyin":["huan4"],"word":"換"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[],"sentences":[{"english":"Don't pull a vacuum on the exchanger.","chinese":"不要移動熱交換器上的真空設備。"},{"english":"The following exchange types are mentioned in the specification.","chinese":"下列交換器類型都在規範中被提及。"},{"english":"Slowly close the bypass on the hottest stream flowing through the exchanger.","chinese":"慢慢關閉流過熱交換器的溫度較低的流體上的旁通。"},{"english":"This will cause the exchange to return her messages as not routable.","chinese":"因爲交換器會將她的消息認爲不可投遞而返回。"},{"english":"Verify exchanger is completely assembled, tested, and drained.","chinese":"確認交換器完全組裝好，並經過測試與排水。"},{"english":"A experiential expressions about the effect of dehumidifying by HRV is concluded by the model at last.","chinese":"根據除溼模型推導得到顯熱交換器除溼效果經驗公式。"},{"english":"Slowly close the bypass on the coolest stream flowing through the exchanger.","chinese":"慢慢關閉流過熱交換器的溫度較低的流體上的旁通。"},{"english":"In both types of equipment, stainless steel should be used for fabricating heat exchanger surfaces.","chinese":"這兩種熱交換器都要用不鏽鋼製造換熱表面。"},{"english":"The results of evaluation indicate that the design of RCV discharging heat exchanger is satisfied with the requirement of standard.","chinese":"結果表明，RCV下泄熱交換器的設計滿足規範要求。"},{"english":"A condensing unit is a heat-exchanging device, now is radiator.","chinese":"冷凝裝置是一個熱交換器，散熱器也是。"},{"english":"Fouling also refers to the accumulation of normally inorganic deposits on heat exchanger tubing.","chinese":"污垢也指熱交換器管子上積累的無機物沉澱物。"},{"english":"The type of the exchange determines it’s interpretation of the binding.","chinese":"交換器的類型決定了它如何解釋這個連接。"},{"english":"Products through the plate heat exchanger for re-heating cycle.","chinese":"產品通過板式熱交換器循環進行再加熱。"},{"english":"The anti-freezing heat exchanger is arranged in a drain pan.","chinese":"防凍結熱交換器設置在排水盤中。"},{"english":"From time to time, it becomes necessary to place shell and tube heat exchangers in service with the unit on stream.","chinese":"應該將管殼式熱交換器在其它設備運行時投入使用。"},{"english":"a telephone line connecting two exchanges directly.","chinese":"直接聯繫兩個交換器的電話線。"}],"related":[]}