{"definition":["delivery time (time between ordering goods and receiving the delivery)\/date of delivery"],"pinyin":["jiao1 huo4 qi1"],"simplified":["交货期"],"rank":36079.0,"normalized_rank":0.5047920193639556,"fraction":5.501896756426224e-7,"cumulative_fraction":0.9946718604128272,"word":"交貨期","characters":[{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"},{"definition":["goods\/money\/commodity\/CL:個|个[ge4]"],"pinyin":["huo4"],"word":"貨"},{"definition":["a period of time\/phase\/stage\/classifier for issues of a periodical, courses of study\/time\/term\/period\/to hope\/Taiwan pr. [qi2]"],"pinyin":["qi1"],"word":"期"}],"containing_words":[],"sentences":[{"english":"I plant to high-quality, level price, short delivery time to win customers.","chinese":"我廠以高質量，平價格，交貨期短贏得客戶。"},{"english":"Your L\/C must reach us 3O days before delivery.","chinese":"你們一定要在交貨期前三十天把信用證開達我方。"},{"english":"Please make us a firm offer, indicating the earliest delivery date.","chinese":"請報實盤並說明最早交貨期。"},{"english":"Delivery date is considered as the date of Airway Bill (AWB).","chinese":"交貨期視爲航空提單的日期。"},{"english":"Please  cable offer northest soyabean most favorable price earliest delivery  promptly.","chinese":"請報東北大豆最優惠價格最快交貨期，請速電告。"},{"english":"What would be your earliest delivery date?","chinese":"你方最早交貨期是什麼時候？"},{"english":"Re : Dlvry, Pls ifm yr best dlvry time.","chinese":"關於交貨期，請告知你方最佳交貨時間。"},{"english":"Since the time of shipment can not be fixed， I can not but worry about it.","chinese":"交貨期還沒定下來，我怎麼會不着急呢？"},{"english":"We’ll do our best to advance the ship- ment to September.","chinese":"我們盡力把交貨期提前到九月份。"},{"english":"The seller will endeavor to complete all packaging within time for the delivery date.","chinese":"賣方將盡力在交貨期內包裝好所有貨物。"},{"english":"Please cable offer northest soyabean most favorable price earliest delivery promptly.","chinese":"請報東北大豆最優惠價格最快交貨期，請速電告。"},{"english":"Since the time of shipment can not be fixed, I can not but worry about it.","chinese":"交貨期還沒定下來，我怎麼會不著急呢？"},{"english":"Please inform us of your lowest price and approximate date of delivery.","chinese":"懇望告知貴方的最底價格及大約交貨期。"},{"english":"B: When is the earliest delivery date?","chinese":"最早交貨期是什麼時候？"},{"english":"We'll do our best to advance the shipment to September.","chinese":"我們盡利巴交貨期提前到九月份兒。"},{"english":"Purchase directly from the origin, cost-competitive, short delivery time.","chinese":"直接從原產地採購，價格競爭力強，交貨期短。"}],"related":[]}