{"definition":["Ministry of Transport\/Transport Department"],"pinyin":["Jiao1 tong1 bu4"],"simplified":["交通部"],"rank":9119.0,"normalized_rank":0.12758664110923007,"fraction":0.000009688973027707023,"cumulative_fraction":0.921832549676456,"word":"交通部","characters":[{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"},{"definition":["classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)","to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc"],"pinyin":["tong1","tong4"],"word":"通"},{"definition":["ministry\/department\/section\/part\/division\/troops\/board\/classifier for works of literature, films, machines etc"],"pinyin":["bu4"],"word":"部"}],"containing_words":[],"sentences":[{"english":"I was sent here by the Transportation Ministry in Beijing.","chinese":"我是北京交通部派來的。"},{"english":"North Carolina Department of Transportation (NCDOT) is using traffic-count-based VMT estimation method.","chinese":"北卡交通部目前使用的正是基於交通量的方法。"},{"english":"The super transport ministry has been established in the super ministry reform of the State Council recently.","chinese":"近期國務院實行了大部制改革，成立了大交通部。"},{"english":"Cameroon Ministry of Communications has also ordered three companies of informal long-distance passenger business for rectification.","chinese":"喀交通部還勒令三家非正規長途客運公司停業整頓。"},{"english":"Article 3 The Ministry of Communications of the PRC is the institution in charge of the nation-wide highway undertaking.","chinese":"第三條中華人民共和國交通部主管全國公路事業。"},{"english":"The transport sector will Silverstrand Fu Xian Xianyang paragraph to carry out special maintenance training.","chinese":"交通部門將對福銀線西安至咸陽段進行專項維修整治。"},{"english":"An official letter issued by MOTC or DGT to reject the application made by the applicant.","chinese":"交通部或電信總局駁回申請人之申請案之公文。"},{"english":"With regards to slicks , he suggests that DOT tires are better investments.","chinese":"對於以幹胎，他認爲，交通部輪胎更好的投資。"},{"english":"Last week, the Department of Transportation released a slew of new rules that will affect the air travel experience.","chinese":"上週，交通部出臺了一系列影響空中旅行的新規定。"},{"english":"Johnson appointed Alan S . Boyd as the first Transportation Secretary.","chinese":"約翰遜任命艾倫博伊德爲第一人交通部長。"},{"english":"German Transport Minister Wolfgang Tiefensee has rejected the idea.","chinese":"德國交通部長蒂芬謝已否決該構想。"},{"english":"But the transportation minister refused to offer any hypothesis about what happened.","chinese":"但是交通部長拒絕提供任何關於所發生事件的假說。"},{"english":"He drove quickly so he often got ticketed by the police from the Miristry of Transportation.","chinese":"有時候開車開得快一點，就會被交通部的警察開罰單。"},{"english":"A document evidencing the approval of the code of practices by MOTC.","chinese":"公司營業規章經交通部覈定之證明文件。"},{"english":"Aren't you a little young to be Secretary of Transportation?","chinese":"你當交通部長會不會太年輕了一點啊？"},{"english":"Transportation minister T.R. Baalu says there is not much leeway to reduce taxes.","chinese":"然而印度交通部長巴魯說，減少稅收的空間不大。"}],"related":[{"definition":["PRC Ministry of Transport (MOT)"],"pinyin":["Jiao1 tong1 Yun4 shu1 bu4"],"word":"交通運輸部"},{"definition":["Ministry of Railways (MOR), disbanded in 2013 with its regulatory functions taken over by the Ministry of Transport 交通運輸部|交通运输部[Jiao1 tong1 Yun4 shu1 bu4]"],"pinyin":["Tie3 dao4 bu4"],"word":"鐵道部"},{"definition":["Ministry of Finance"],"pinyin":["Cai2 zheng4 bu4"],"word":"財政部"},{"definition":["ministries and commissions"],"pinyin":["bu4 wei3"],"word":"部委"},{"definition":["abbr. for 國家發展和改革委員會|国家发展和改革委员会, PRC National Development and Reform Commission (NDRC), formed in 2003"],"pinyin":["Fa1 gai3 wei3"],"word":"發改委"},{"definition":["Ministry of Foreign Affairs\/foreign office\/Dept. of State"],"pinyin":["Wai4 jiao1 bu4"],"word":"外交部"},{"definition":["Ministry of Public Security"],"pinyin":["Gong1 an1 bu4"],"word":"公安部"},{"definition":["Ministry of Water Resources (PRC)"],"pinyin":["Shui3 li4 bu4"],"word":"水利部"},{"definition":["Department of Trade\/Department of Commerce"],"pinyin":["Shang1 wu4 bu4"],"word":"商務部"},{"definition":["PRC National Development and Reform Commission"],"pinyin":["Guo2 jia1 Fa1 zhan3 Gai3 ge2 Wei3"],"word":"國家發展改革委"},{"definition":["Civil Aviation Administration of China (CAAC)"],"pinyin":["Zhong1 guo2 Min2 yong4 Hang2 kong1 ju2"],"word":"中國民用航空局"},{"definition":["Ministry of Education"],"pinyin":["Jiao4 yu4 bu4"],"word":"教育部"},{"definition":["Ministry of Justice (PRC etc)\/Justice Department (USA etc)"],"pinyin":["Si1 fa3 bu4"],"word":"司法部"},{"definition":["PRC Maritime Safety Agency"],"pinyin":["Zhong1 guo2 hai3 shi4 ju2"],"word":"中國海事局"},{"definition":["PRC State Planning Committee, abbr. for 國家計劃委員會|国家计划委员会[Guo2 jia1 Ji4 hua4 Wei3 yuan2 hui4]"],"pinyin":["Guo2 jia1 Ji4 Wei3"],"word":"國家計委"},{"definition":["general office"],"pinyin":["ban4 gong1 ting1"],"word":"辦公廳"}]}