{"definition":["to be renowned"],"pinyin":["xiang3 yu4"],"simplified":["享誉"],"rank":15367.0,"normalized_rank":0.21500426734571096,"fraction":0.000003970591450644555,"cumulative_fraction":0.9605227451402228,"word":"享譽","characters":[{"definition":["to enjoy\/to benefit\/to have the use of"],"pinyin":["xiang3"],"word":"享"},{"definition":["to praise\/to acclaim\/reputation"],"pinyin":["yu4"],"word":"譽"}],"containing_words":[],"sentences":[{"english":"Zhijin unique karst topography, Zhijin reputation at home and abroad.","chinese":"織金縣擁有獨特的喀斯特地形，織金洞享譽國內外。"},{"english":"Today's Shanghai has become a world -famous international metropolis.","chinese":"今日之上海，已經成爲享譽中外的國際大都市。"},{"english":"Being a large university with a world-renowned music school, USC suits my needs exceptionally well.","chinese":"作爲一間享譽音樂盛名的大學，USC極其適合我。"},{"english":"It's renowned across the world.","chinese":"它是一所享譽全球的大學。"},{"english":"The whole area is reputed to be a \"huge natural air-conditioner.","chinese":"這裏的整個區域都被享譽爲巨大的天然空氣調節器。"},{"english":"The Fair in Leipzig and fine porcelain in Meissen are well known around the world.","chinese":"萊比錫的博覽會和邁森的精美瓷器更是享譽世界。"},{"english":"That author wears well.","chinese":"那位作者享譽頗久。"},{"english":"With excellent cost-performance and closely perfect after-sale service and reputation industry.","chinese":"憑藉優良的性價比，緊密完善的售後服務而享譽業內。"},{"english":"Three years later, Coltrane organized his own jazz group which became famous around the world soon.","chinese":"三年後，他組織起自己的爵士樂隊並且很快享譽全球。"},{"english":"Wan Shing Trading Co. , Ltd. management standards, service in place, the industry's reputation.","chinese":"運盛貿易有限公司管理規範，服務到位，享譽業界。"},{"english":"Cartier is synonymous the world over with excellence jewellery and watchmaking.","chinese":"卡地亞是享譽世界的著名珠寶腕錶品牌。"},{"english":"In this time, Ted has already became a famous Medical Doctor (M. d. ).","chinese":"這時，泰德已經成爲了一位享譽世界的醫學博士。"},{"english":"Chinese food is world famous for its color, smell and taste.","chinese":"中國菜以其色香味享譽世界。"},{"english":"Well-known as the Spring City domestically and around the world, Kunming is an international tourism city.","chinese":"昆明素以春城而享譽中外，是國際旅遊城市之一。"},{"english":"Federal Express, a company internationally know for excellent service to its customers.","chinese":"素以優質服務而享譽全球的聯邦快遞公司。"},{"english":"He is Asia's best known actors and singers.","chinese":"他是享譽全亞洲的優秀演員和歌手。"}],"related":[]}