{"definition":["demography"],"pinyin":["ren2 kou3 xue2"],"simplified":["人口学"],"rank":46094.0,"normalized_rank":0.6449148629552418,"fraction":2.147330891139022e-7,"cumulative_fraction":0.9982672543278076,"word":"人口學","characters":[{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"},{"definition":["mouth\/classifier for things with mouths (people, domestic animals, cannons, wells etc)\/classifier for bites or mouthfuls"],"pinyin":["kou3"],"word":"口"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"Instead, the social and demographic aspects of farming, ratherthan its productivity, may have been essential to its emergence and spread.","chinese":"農業興起與傳播的關鍵在於社會與人口學方面的優勢。"},{"english":"Who are the other important demographic players?","chinese":"誰又是處於次重要地位的人口學參與者呢？"},{"english":"Many developing countries are enjoying demographic changes.","chinese":"許多發展中國家正在經受人口學的變化。"},{"english":"Objective To investigate the related demographic and obstetrical factors of postpartum depressive symptoms.","chinese":"目的探討與產後抑鬱症相關的人口學因素及產科因素。"},{"english":"Have you studied demography?","chinese":"你研究過人口學嗎？"},{"english":"Demography, though, is not only about economics.","chinese":"不過，人口學不僅僅只包括經濟層面。"},{"english":"Multivariable regression analysis was performed to identify demographic predictors of tobacco use.","chinese":"開展了多元迴歸分析，用以確定吸菸的人口學預測值。"},{"english":"Correlation analysis of migrant workers' socio-demographic features and health status was conducted.","chinese":"社會人口學特徵與農民工健康的相關分析。"},{"english":"Because this is a demographic that has traditionally been overlooked by demographers.","chinese":"因爲這一部分人口一直以來都被人口學家忽略。"},{"english":"Demographers in America enjoy pointing out that China also will become an aging society over time.","chinese":"美國的人口學家樂於指出中國人口也正逐漸老齡化。"}],"related":[]}