{"definition":["people's government"],"pinyin":["ren2 min2 zheng4 fu3"],"simplified":["人民政府"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"人民政府","characters":[{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"},{"definition":["surname Min","the people\/nationality\/citizen"],"pinyin":["Min2","min2"],"word":"民"},{"definition":["political\/politics\/government"],"pinyin":["zheng4"],"word":"政"},{"definition":["seat of government\/government repository (archive)\/official residence\/mansion\/presidential palace\/(honorific) Your home\/prefecture (from Tang to Qing times)"],"pinyin":["fu3"],"word":"府"}],"containing_words":[{"definition":["Liaison Office of the Central People's Government in the Hong Kong Special Administrative Region"],"pinyin":["Zhong1 yang1 Ren2 min2 Zheng4 fu3 Zhu4 Xiang1 gang3 Te4 bie2 Xing2 zheng4 qu1 Lian2 luo4 Ban4 gong1 shi4"],"word":"中央人民政府駐香港特別行政區聯絡辦公室"}],"sentences":[{"english":"Deputy Mayor of Yingkou municipal government.","chinese":"營口市人民政府副市長。"},{"english":"To undertake other assignments designated by the autonomous region government.","chinese":"承辦自治區人民政府交辦的其他事項。"},{"english":"The people's government must conduct all its activities along the revolutionary mass line.","chinese":"人民政府必須按照革命羣衆路線進行一切活動。"},{"english":"The people's government controlled the nation's economy and set up a state-owned socialist economy.","chinese":"人民政府控制經濟命脈並建立了公有制社會主義經濟。"},{"english":"The people's government stands on a street in the west of Chengguan town.","chinese":"人民政府就在城關鎮靠西的那個街上。"},{"english":"To undertake other assignments designated by the autonomous government.","chinese":"承辦自治區人民政府交辦的其他事項。"},{"english":"To undertake other assignments designated by the regional government and state commerce bureau.","chinese":"承擔自治區人民政府和國家商務部交辦的其他事項。"},{"english":"The findings shall be reported to the said people's governments without delay.","chinese":"災情調查結果，應當及時報告本級人民政府。"},{"english":"Local people's governments at various levels shall place under their protection cultural relics in their respective administrative areas.","chinese":"地方各級人民政府保護本行政區域內的文物。"},{"english":"Wan Haichuan was appointed Member of Party Leadership Group of the People's Government of Xinjiang Uygur Autonomous Region.","chinese":"任命彎海川爲新疆維吾爾自治區人民政府黨組成員。"},{"english":"These Procedures apply to the Shanghai Chemical Industry Area (hereinafter referred to as the SCIA ) established under the approval of the Municipal People's Government.","chinese":"本辦法適用於市人民政府批准設立的上海化學工業區。"},{"english":"Meanwhile, it is one of the priority projects of Xiangcheng District People's Government.","chinese":"同時也是薌城區人民政府重點工程之一。"},{"english":"In case of a shortage of reserves, the people's government of the pooling region shall advance the payment.","chinese":"儲備金不足支付的，由統籌地區的人民政府墊付。"},{"english":"People's Government of Ewenke, administrative division of the county level, in the Inner Mongolia Autonomous Region.","chinese":"內蒙古自治區鄂溫克族自治旗人民政府。"},{"english":"Translated Description: edition by the City People's up, \"Mayor Hotline\" office set up.","chinese":"本版由達州市人民政府“市長熱線”辦公室開辦。"},{"english":"The posting is in areas prohibited for advertising by people's governments at and above the county level.","chinese":"當地縣級以上地方人民政府禁止設置戶外廣告的區域。"}],"related":[{"definition":["subdistrict office\/neighborhood official\/an official who works with local residents to report to higher government authorities"],"pinyin":["jie1 dao4 ban4 shi4 chu4"],"word":"街道辦事處"},{"definition":["county level"],"pinyin":["xian4 ji2"],"word":"縣級"},{"definition":["Party committee"],"pinyin":["dang3 wei3"],"word":"黨委"},{"definition":["administrative committee\/management committee"],"pinyin":["guan3 li3 wei3 yuan2 hui4"],"word":"管理委員會"},{"definition":["county administration\/county regional government"],"pinyin":["xian4 zheng4 fu3"],"word":"縣政府"},{"definition":["administrative committee\/management committee\/abbr. for 管理委員會|管理委员会[guan3 li3 wei3 yuan2 hui4]"],"pinyin":["guan3 wei3 hui4"],"word":"管委會"},{"definition":["(municipal) water authority"],"pinyin":["shui3 wu4 ju2"],"word":"水務局"},{"definition":["working committee"],"pinyin":["gong1 wei3"],"word":"工委"},{"definition":["county"],"pinyin":["xian4"],"word":"縣"},{"definition":["inspection office\/supervisory office"],"pinyin":["jian1 cha2 ju2"],"word":"監察局"},{"definition":["CCP county committee"],"pinyin":["xian4 wei3"],"word":"縣委"},{"definition":["environment protection office\/PRC National bureau of environmental protection"],"pinyin":["huan2 bao3 ju2"],"word":"環保局"},{"definition":["administrative area"],"pinyin":["xing2 zheng4 qu1 yu4"],"word":"行政區域"},{"definition":["State-owned Assets Supervision and Administration Commission SASAC"],"pinyin":["Guo2 you3 Zi1 chan3 Jian1 du1 Guan3 li3 Wei3 yuan2 hui4"],"word":"國有資產監督管理委員會"},{"definition":["leading small group (LSG), a CCP body that exercises general oversight on matters relating to a specific area (LSG for foreign affairs 外事工作, LSG for comprehensively deepening reforms 全面深化改革 etc)\/aka central leading group"],"pinyin":["ling3 dao3 xiao3 zu3"],"word":"領導小組"},{"definition":["market\/city\/CL:個|个[ge4]"],"pinyin":["shi4"],"word":"市"}]}