{"definition":["sign of human habitation"],"pinyin":["ren2 yan1"],"simplified":["人烟"],"rank":35637.0,"normalized_rank":0.4986078659074056,"fraction":5.735460959405314e-7,"cumulative_fraction":0.9944237654508934,"word":"人煙","characters":[{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"},{"definition":["cigarette or pipe tobacco\/CL:根[gen1]\/smoke\/mist\/vapour\/CL:縷|缕[lu:3]\/tobacco plant\/(of the eyes) to be irritated by smoke"],"pinyin":["yan1"],"word":"煙"}],"containing_words":[{"definition":["no sign of human habitation (idiom); desolate"],"pinyin":["ren2 yan1 xi1 shao3"],"word":"人煙稀少"},{"definition":["desolate and uninhabited (idiom)"],"pinyin":["huang1 wu2 ren2 yan1"],"word":"荒無人煙"},{"definition":["remote and uninhabited (idiom); deserted\/God-forsaken"],"pinyin":["miao3 wu2 ren2 yan1"],"word":"渺無人煙"},{"definition":["dark and uninhabited (idiom); remote and deserted\/God-forsaken"],"pinyin":["yao3 wu2 ren2 yan1"],"word":"杳無人煙"},{"definition":["uninhabited"],"pinyin":["mei2 you3 ren2 yan1"],"word":"沒有人煙"}],"sentences":[{"english":"The region is uninhabited except for a few scattered mountain villages.","chinese":"的小山村之外，這個地區杳無人煙。"},{"english":"What I remember is that this town used to be a no-man place.","chinese":"我記得這個城市過去是個荒無人煙的地方。"},{"english":"When she was dropped off on an oblong island with no other inhabitants.","chinese":"她在一個荒無人煙的長方形小島下了飛機。"},{"english":"Violence breeds in densely populated areas.","chinese":"暴行常發生在人煙稠密的地區。"},{"english":"Parts of the landscape, such as the Northeast New Territories, are still wild, beautiful, and basically uninhabited.","chinese":"新界東北岸等地現在仍是一派杳無人煙的天然美景。"},{"english":"On his way, Jada stopped for a night in a deserted place.","chinese":"在回家路上，加達在一處荒無人煙之地住了一夜。"},{"english":"Along the densely Lushui very little heavy but Lushui poisonous miasma .","chinese":"瀘水一帶人煙極少，瘴氣很重而且瀘水有毒。"},{"english":"At the heart of Afghanistan is an empty space a striking absence where the larger of the colossal Bamian Buddhas once stood.","chinese":"阿富汗的腹地是一塊空曠之地，人煙稀少。"},{"english":"Vast areas are arid or semi-desert, and virtually uninhabited.","chinese":"大片地區都是乾旱或者半沙漠，人跡罕至，渺無人煙。"},{"english":"The little village, where I spent my happy childhood, is now deserted.","chinese":"我度過快樂童年的小村莊，如今已杳無人煙。"},{"english":"Hanging out with little friends to some desolated places.","chinese":"和一兩個朋友去人煙稀少的地方。"},{"english":"km land area. Parts of the landscape, such as the Northeast New Territories, are still wild, beautiful, and basically uninhabited.","chinese":"新界東北岸等地現在仍是一派杳無人煙的天然美景。"},{"english":"Violent winds threatened2 to shove the climbers off into oblivion.","chinese":"狂暴的風幾乎要把登山者推入渺無人煙的深淵。"},{"english":"In these crowded centers, the labor movement took form.","chinese":"在這些人煙稠密的城市中，勞工運動逐漸形成。"},{"english":"No human habitation in the wetland, I use the truth to find your shadow.","chinese":"在這片荒無人煙的溼地，我用真情尋覓到了你的身影。"},{"english":"In this place ten miles around there is no signs of human habitation.","chinese":"在這一地方的十英里的周圍內杳無人煙。"}],"related":[]}