{"definition":["hereafter\/henceforth\/in the future\/from now on"],"pinyin":["jin1 hou4"],"simplified":["今后"],"rank":1143.0,"normalized_rank":0.01599205294306941,"fraction":0.0001403458100175988,"cumulative_fraction":0.6413694603896861,"word":"今後","characters":[{"definition":["now\/the present time\/current\/contemporary\/this (day, year etc)"],"pinyin":["jin1"],"word":"今"},{"definition":["back\/behind\/rear\/afterwards\/after\/later\/post-"],"pinyin":["hou4"],"word":"後"}],"containing_words":[],"sentences":[{"english":"Eventually it puts forward the focus of studying V-based solid solution type hydrogen stora…","chinese":"指出了今後釩基固溶體型貯氫材料應用研究的重點。"},{"english":"In your opinion, what is the future of the foreign-funded bank in China?","chinese":"你認爲外資銀行今後在中國的發展前景如何？"},{"english":"From now on, we need to be more mobile and flexible, carefully choosing battle opportunities.","chinese":"今後，我們要更加機動靈活，精細地尋求。"},{"english":"Hope in the day of aftertime to get along with everyone delectation.","chinese":"希望在今後的日子裏與大家相處愉快。"},{"english":"The warning is based on the latest 5-day weather forecasts.","chinese":"這項警報是以今後5天的天氣預報資料爲基礎的。"},{"english":"May the years ahead of you filled with love and joy.","chinese":"祝你們今後年年月月幸福相愛。"},{"english":"This will be one of the main impetuses of China's economic development in the future .","chinese":"這將是今後中國經濟發展的主要着力點之一。"},{"english":"In the following practice, abstract art and figural art become a \"convenient saying \".","chinese":"在今後的實踐中，“抽象和具象”就成了“方便說”。"},{"english":"Then the direction of ecological researches on Shatian pomelo is put forward.","chinese":"最後提出了今後沙田柚生態研究的方向。"},{"english":"Permanently store the new scale for future use.","chinese":"永久儲存新的比額表，供今後使用。"},{"english":"He said the two sides should make full use of the joint committee on bilateral cooperation as a platform to push forward the cooperation.","chinese":"今後雙方應充分利用雙邊聯委會平臺，推進新中合作。"},{"english":"It helped prepare Alan Shepard for an even greater danger in the future.","chinese":"這對於準備在今後更大的危險艾倫謝潑德。"},{"english":"At the end, prospect of the development of the hydrometallurgy of uranium is discussed briefly.","chinese":"對鈾水冶科學技術的今後發展作了討論。"},{"english":"He also said that if a similar incident occurs in the future, Japan will resolutely deal with it.","chinese":"今後如再次出現類似情況，日方將繼續毅然應對。"},{"english":"The scientific and technologic innovation is the strategic decision of our nation's middle and long-term development.","chinese":"走科技創新之路是我國今後中長期的戰略決策。"},{"english":"The result will provide an important evidence for the study of Khodalite lithology in the future.","chinese":"爲今後黃陵地區孔茲巖系研究提供重要參考。"}],"related":[{"definition":["sometime\/someday (in the future)"],"pinyin":["ri4 hou4"],"word":"日後"},{"definition":["after\/later\/afterwards\/following\/later on\/in the future"],"pinyin":["yi3 hou4"],"word":"以後"},{"definition":["future\/tomorrow\/CL:個|个[ge4]\/approaching\/coming\/pending"],"pinyin":["wei4 lai2"],"word":"未來"},{"definition":["in the future\/future\/the future\/CL:個|个[ge4]"],"pinyin":["jiang1 lai2"],"word":"將來"},{"definition":["after this\/afterwards\/hereafter"],"pinyin":["ci3 hou4"],"word":"此後"},{"definition":["to promise\/to undertake to do something\/commitment"],"pinyin":["cheng2 nuo4"],"word":"承諾"},{"definition":["policy\/guidelines\/CL:個|个[ge4]"],"pinyin":["fang1 zhen1"],"word":"方針"},{"definition":["auxiliary verb introducing future action: may (be able to)\/will (cause)\/should (enable)\/going to"],"pinyin":["jiang1 hui4"],"word":"將會"},{"definition":["undertaking\/project\/activity\/(charitable, political or revolutionary) cause\/publicly funded institution, enterprise or foundation\/career\/occupation\/CL:個|个[ge4]"],"pinyin":["shi4 ye4"],"word":"事業"},{"definition":["active\/energetic\/vigorous\/positive (outlook)\/proactive"],"pinyin":["ji1 ji2"],"word":"積極"},{"definition":["for this reason\/with regards to this\/in this respect\/in order to do this\/to this end"],"pinyin":["wei4 ci3"],"word":"為此"},{"definition":["situation\/existing state of affairs"],"pinyin":["shi4 tai4"],"word":"事態"},{"definition":["to be determined"],"pinyin":["jue2 yi4"],"word":"決意"},{"definition":["organic"],"pinyin":["you3 ji1"],"word":"有機"},{"definition":["to decide (to do something)\/to resolve\/decision\/CL:個|个[ge4],項|项[xiang4]\/certainly"],"pinyin":["jue2 ding4"],"word":"決定"},{"definition":["to break new ground (for agriculture)\/to open up (a new seam)\/to develop (border regions)\/fig. to open up (new horizons)"],"pinyin":["kai1 tuo4"],"word":"開拓"}]}