{"definition":["dielectric constant"],"pinyin":["jie4 dian4 chang2 shu4"],"simplified":["介电常数"],"rank":64075.0,"normalized_rank":0.8964923817385586,"fraction":1.985295725322277e-8,"cumulative_fraction":0.9999370617461838,"word":"介電常數","characters":[{"definition":["to introduce\/to lie between\/between\/shell\/armor"],"pinyin":["jie4"],"word":"介"},{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["always\/ever\/often\/frequently\/common\/general\/constant","surname Chang"],"pinyin":["Chang2","chang2"],"word":"常"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[],"sentences":[{"english":"For comparision, the results obtained by EDC-method were also given.","chinese":"爲了比較，也給出了用有效介電常數法所得的結果。"},{"english":"In wide temperature range the double-peak of dielectric constant appears.","chinese":"在很寬的溫度範圍內出現了雙介電常數峯。"},{"english":"There is the permittivity vacuum. It is all up there.","chinese":"這兒還有真空中的介電常數，看，全在這裏。"},{"english":"In chapter two, the quantitative evanescent microwave microscopy of the dielectric constant of thin films using a recursive image charge approach is described.","chinese":"第二章是近場微波顯微術對薄膜介電常數的定量表徵。"},{"english":"The effective constitutive parameters of forests at high frequency range is analyzed.","chinese":"本文分析了森林的高頻有效導磁率和有效介電常數。"},{"english":"The dielectric constant of a-C:F films is composed mainly of electron polarization and increases with increasing R.","chinese":"薄膜的介電常數取決於電子極化並隨R的增大而上升。"},{"english":"Relative permittivity of Fe powders is adjusted by adding different Al2O3 concentration.","chinese":"通過加入鐵中的氧化鋁含量可以調節鐵的復介電常數。"},{"english":"This paper mainly studies the microwave permittivity measurement techniques of dielectric materials.","chinese":"本文主要研究了微波介質材料介電常數的測試方法。"},{"english":"High dielectric constant thin films have been used in high-density dynamic random access memories widely.","chinese":"高介電常數薄膜廣泛應用於動態隨機存儲器中。"},{"english":"A cascade network decomposition method for measuring the complex dielectric constant of mushy materials is proposed.","chinese":"提出了測量糊狀物質復介電常數的級聯網絡分解法。"},{"english":"At last, the development trends of the microwave ceramics with low permittivity are indicated.","chinese":"最後展望了低介電常數微波介質陶瓷今後的發展方向。"},{"english":"In this thesis, we report the dielectric constants of different semiconductors.","chinese":"在本文中，我們報告了不同的半導體的介電常數。"},{"english":"This paper derived the relations between polarization dispersion and wave length from the dielectric constant perturbation theory.","chinese":"本文從介電常數微擾理論得到極化色散與波長的關係。"},{"english":"Epsilon zero is the permittivity of vacuum.","chinese":"0是真空中的介電常數。"}],"related":[]}