{"definition":["piglet"],"pinyin":["zi3 zhu1"],"simplified":["仔猪"],"rank":35625.0,"normalized_rank":0.4984399703384495,"fraction":5.739840288211172e-7,"cumulative_fraction":0.9944168805621,"word":"仔豬","characters":[{"definition":["meticulous\/(of domestic animals or fowls) young","see 仔肩[zi1 jian1]","variant of 崽[zai3]"],"pinyin":["zai3","zi1","zi3"],"word":"仔"},{"definition":["hog\/pig\/swine\/CL:口[kou3],頭|头[tou2]"],"pinyin":["zhu1"],"word":"豬"}],"containing_words":[],"sentences":[{"english":"Cross-fostering must be complete max. 36 hours after farrowing.","chinese":"一定要在仔豬出生36小時之內完成仔豬的寄養。"},{"english":"Cross-fostering must be complete max. 36 hours after farrowing.","chinese":"一定要在仔豬出生36小時之內完成仔豬的寄養。"},{"english":"All of above show that dextran iron can control piglets anaemia effectively.","chinese":"表明葡聚糖酐鐵對仔豬貧血有良好的防治效果。"},{"english":"You can express the milk into the mouth of the piglet.","chinese":"確保將初乳喂到仔豬的嘴中。"},{"english":"Enterotoxigenic escherichia coil (ETEC) related with diarrhoea of early-weaned piglets.","chinese":"產腸毒素性大腸桿菌與仔豬腹瀉的致病過程密切相關。"},{"english":"Table 1 shows the performance of weanling pigs fed diets supplemented with two types of feed additives.","chinese":"表1顯示了餵了兩種類型飼料添加劑仔豬的生長性能。"},{"english":"The invention discloses Chinese herbal medicine compound premix used for piglets.","chinese":"本發明公開了乳仔豬用中草藥複合預混料。"},{"english":"The weaned piglets diarrhea was a kind of disease that seriously harmed swine industry.","chinese":"斷奶仔豬腹瀉是一類嚴重危害養豬業發展的疾病。"},{"english":"Response to nutritious stress is necessary for early-weaned piglet to survive.","chinese":"營養應激反應對於早期斷乳仔豬的生存是必需的。"},{"english":"Litters were standardized to 12 piglets beyond 48 h after birth.","chinese":"於產後48小時，將每窩調整至12頭仔豬。"},{"english":"2nd and 3rd parity sows are best at accepting new small piglets.","chinese":"第二和第三胎的母豬是最易接受小仔豬的。"},{"english":"A different nursery site is used each week on an all-in, all-out basis.","chinese":"每週按全進全出的原則將仔豬轉入不同的保育場。"},{"english":"It is vitally important to encourage piglets to maintain fluid intake post-weaning.","chinese":"仔豬斷奶時維持液體攝取量極其重要。"},{"english":"We conclude the MLV is safe for piglets.","chinese":"本試驗表明弱毒疫苗對仔豬是安全的。"},{"english":"Calf, Lamb, Piglet and Foal.","chinese":"犢牛，羔羊，仔豬和馬駒。"},{"english":"Sows eat their young because they need the phosphorous.","chinese":"大母豬喫仔豬，因爲它們缺少磷質。"}],"related":[]}