{"definition":["(has been) replaced with\/(its) place has been taken by"],"pinyin":["dai4 zhi1 yi3"],"simplified":["代之以"],"rank":29587.0,"normalized_rank":0.4139605165587005,"fraction":9.744006593033971e-7,"cumulative_fraction":0.9898460056074,"word":"代之以","characters":[{"definition":["to substitute\/to act on behalf of others\/to replace\/generation\/dynasty\/age\/period\/(historical) era\/(geological) eon"],"pinyin":["dai4"],"word":"代"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"}],"containing_words":[],"sentences":[{"english":"People would be wise to abandon rash inclinations and instead try in earnest.","chinese":"人們摒棄急燥冒進並代之以嚴肅認識是明智之舉。"},{"english":"Instead of taking a bag of crisps for lunch, switch it for an apple. Get creative!","chinese":"不用酥脆的餅乾作爲午餐，代之以一個蘋果。"},{"english":"Conventional vent lines are removed and replaced with a vent loop of high strength polymer textile braids.","chinese":"該項技術去掉頂孔繩，代之以高強編織帶孔口圈。"},{"english":"That day, I quit drinking soft drink , and replaced it with water.","chinese":"那天，我戒酒軟飲料，而代之以水。"},{"english":"The aim of science is to falsify theories and to replace them by better theories.","chinese":"科學的目標在否定理論，並代之以更好的理論。"},{"english":"The Communist shoutings are not dhave, or gaudy advertising up.","chinese":"黨的標語被換了下來，代之以俗氣的宣傳。"},{"english":"Walking around instead of standing in one spot will reduce the risk of varicose veins.","chinese":"四處走動代之以站在同一處會減少靜脈疾病的危險。"},{"english":"He argued that it would be best to abandon the concept of element altogether for a corpuscular philosophy.","chinese":"他認爲最好完全取消元素這個概念而代之以微粒哲學。"},{"english":"The pointy roofs are being phased out and replaced by simple olive green facades.","chinese":"尖屋頂將逐漸取消，代之以簡單的橄欖綠門面。"},{"english":"Cross-roads will not exist on these new highways, but will be replaced by bridges and flyovers.","chinese":"新公路上將沒有十字路口，而代之以過街橋和立交橋。"},{"english":"They abolished the standing army, and instead armed the people.","chinese":"他們廢除了常備軍，代之以武裝起來的人民。"}],"related":[]}