{"definition":["algebraic equation\/polynomial equation"],"pinyin":["dai4 shu4 fang1 cheng2"],"simplified":["代数方程"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"代數方程","characters":[{"definition":["to substitute\/to act on behalf of others\/to replace\/generation\/dynasty\/age\/period\/(historical) era\/(geological) eon"],"pinyin":["dai4"],"word":"代"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["Fang1","fang1"],"word":"方"},{"definition":["rule\/order\/regulations\/formula\/journey\/procedure\/sequence","surname Cheng"],"pinyin":["Cheng2","cheng2"],"word":"程"}],"containing_words":[],"sentences":[{"english":"The algebraical equations obtained from the difference equations are solved by the line relaxation iterative method.","chinese":"差分方程形成的代數方程組用線鬆弛迭代求解。"},{"english":"Through the medium of walsh transform, the logical differential equation can be transformed into algebraic equation.","chinese":"通過沃爾什變換，邏輯微分方程能夠轉換爲代數方程。"},{"english":"The latter is concluded by Gauss's famous \"Fundamental Theorem of Algebra\".","chinese":"後者以高斯的“代數方程的基本定理”作爲結束。"},{"english":"This reduces the problem to the solution of an algebraic equation.","chinese":"這減少了問題的解決，一個代數方程。"},{"english":"This matrix defines the network algebraic equations.","chinese":"矩陣定義網路的代數方程。"},{"english":"EES can efficiently solve hundreds of coupled non-linear algebraic equations.","chinese":"它主要用於求解一系列的代數方程。"}],"related":[]}