{"definition":["admirable"],"pinyin":["ling4 ren2 qin1 pei4"],"simplified":["令人钦佩"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"令人欽佩","characters":[{"definition":["classifier for a ream of paper","see 令狐[Ling2 hu2]","see 脊令[ji2 ling2]","to order\/to command\/an order\/warrant\/writ\/to cause\/to make sth happen\/virtuous\/honorific title\/season\/government position (old)"],"pinyin":["Ling2","ling2","ling3","ling4"],"word":"令"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"},{"definition":["surname Qin","to respect\/to admire\/to venerate\/by the emperor himself"],"pinyin":["Qin1","qin1"],"word":"欽"},{"definition":["to respect\/to wear (belt etc)"],"pinyin":["pei4"],"word":"佩"}],"containing_words":[],"sentences":[{"english":"The remarkable achievements of Chinese economy are admirable.","chinese":"中國經濟發展成績斐然，令人欽佩。"},{"english":"I think he conducted himself admirably, considering the difficult circumstances.","chinese":"考慮到那種困難環境，我認爲他表現得令人欽佩。"},{"english":"Beyton is an admirable character.","chinese":"貝頓是個令人欽佩的人物。"},{"english":"Stoere said China has made admirable achievements in its reform and opening-up endeavor.","chinese":"斯特勒說，中國改革開放取得巨大成就，令人欽佩。"},{"english":"That's admirable, and exactly my own approach to life.","chinese":"那是令人欽佩的，能準確地找到自己的生活。"},{"english":"Now the communitarian would say there is something admirable in that.","chinese":"現在共同體主義者會說，其中有令人欽佩之處。"},{"english":"But Mrs Clinton was also helped by her extraordinary indomitability in the face of adversity.","chinese":"不過希拉里在困難面前的不屈不撓的精神令人欽佩。"},{"english":"Erudition is admirable, but it seldom leads to masterpieces.","chinese":"博學令人欽佩，但它很少能導致傑作的產生。"},{"english":"The results of this investment are sometimes hubristic , but often impressive.","chinese":"這種做法雖然有些狂妄自大，卻也令人欽佩。"},{"english":"This is an admirable goal, and one I wholeheartedly endorse.","chinese":"這是一個令人欽佩的目標，我非常贊同。"},{"english":"The Nishi Building also displays admirable environmental initiative.","chinese":"西大樓也表現出令人欽佩的環保倡議。"}],"related":[]}