{"definition":["for the sake of\/in order to"],"pinyin":["yi3 li4 yu2"],"simplified":["以利于"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"以利於","characters":[{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["sharp\/favorable\/advantage\/benefit\/profit\/interest\/to do good to\/to benefit","surname Li"],"pinyin":["Li4","li4"],"word":"利"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[],"sentences":[{"english":"Able to reveal weaknesses in the structure in order to optimize the structure design.","chinese":"能夠揭示出結構的薄弱環節，以利於優化結構設計。"},{"english":"Sleeps when should keep the window seam, favors lets the outdoor fresh air unceasing exile.","chinese":"睡覺時應留些窗縫，以利於讓室外新鮮空氣不斷流人。"},{"english":"The government by law and the law must become gradually suitably forgive favor the society to be harmonious.","chinese":"法治和法律要逐漸變得適當寬容以利於社會和諧。"},{"english":"Combustibility of producer gas is compared with other fuel gas to use rationally low calorific value gas.","chinese":"對其燃燒特性進行比較，以利於合理使用低熱值煤氣。"},{"english":"Endoscopes should be hung in a vertical position to facilitate drying.","chinese":"應垂直懸掛內鏡以利於乾燥。"},{"english":"A thermal relief is used on plane layers for thru-hole components to make soldering and desoldering easier.","chinese":"限熱槽通常用於直插元件的內電層以利於焊接和拆焊。"},{"english":"Harnessing emotions sothat you can take positive actions","chinese":"控制好情緒以利於你採取積極行動，哪怕是面臨困境。"},{"english":"In addition, each time measured when blood pressure the basic body posture should be same, favor the comparison.","chinese":"此外，每次測血壓時的基本體位應相同，以利於比較。"},{"english":"All the information in this form shall be correct so that Michael could arrange all the work in the right time.","chinese":"表中的各項信息必須準確，以利於黃政安排各項工作。"},{"english":"We layer the crops to make them grow better.","chinese":"我們對農作物進行壓條處理，以利於他們生長。"},{"english":"Make music to the proper density billet, for the fungus growth.","chinese":"使曲坯達到適當的密度，以利於菌類生長。"},{"english":"My legs are long with sharp claws for hanging.","chinese":"我的腿長，且帶有利爪，以利於懸掛。"}],"related":[]}