{"definition":["Esther (name)"],"pinyin":["Yi3 si1 tie3"],"simplified":["以斯帖"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"以斯帖","characters":[{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["(phonetic)\/this","Slovakia\/Slovak\/abbr. for 斯洛伐克[Si1 luo4 fa2 ke4]"],"pinyin":["Si1","si1"],"word":"斯"},{"definition":["fitting snugly\/appropriate\/suitable\/variant of 貼|贴[tie1]\/to paste\/to obey","invitation card\/notice","rubbing from incised inscription"],"pinyin":["tie1","tie3","tie4"],"word":"帖"}],"containing_words":[{"definition":["Book of Esther"],"pinyin":["Yi3 si1 tie3 ji4"],"word":"以斯帖記"}],"sentences":[{"english":"When Queen Esther heard of Mordecai's condition, she couldn't understand it.","chinese":"王后以斯帖聽聞末底改的哀慟，卻不明所以。"},{"english":"So the king and Haman came to banquet with Esther the queen.","chinese":"王帶着哈曼來赴王后以斯帖的筵席。"},{"english":"And Esther set Mordecai over the house of Haman.","chinese":"以斯帖派末底改管理哈曼的家產。"},{"english":"Then said the king unto her, What wilt thou, queen Esther? and what is thy request?","chinese":"王對她說，王后以斯帖阿，你要什麼。"},{"english":"So Mordecai went his way, and did according to all that Esther had commanded him.","chinese":"於是末底改照以斯帖一切所吩咐的去行。"},{"english":"In a few minutes he returned, only to find Haman begging Esther for his life.","chinese":"過了一會，他從御園回來，卻看見哈曼求以斯帖救命。"},{"english":"So the king and Haman came to the banquet that Esther had prepared.","chinese":"於是王帶着哈曼赴以斯帖所預備的筵席。"},{"english":"Sidney and Esther are planning a Christmas lunch for 12 people.","chinese":"西德尼和以斯帖正在規劃一頓12個人的聖誕大餐。"},{"english":"Staff from the Esther Benjamins Trust rush to stop and apprehend them.","chinese":"員工從以斯帖本傑明信託急於制止並逮捕他們。"},{"english":"Then Esther bade them return Mordecai this answer.","chinese":"以斯帖就吩咐人回報末底改說。"},{"english":"And the decree of Esther confirmed these matters of Purim ; and it was written in the book.","chinese":"以斯帖命定守普珥日，這事也記錄在書上。"},{"english":"The first-person narrative related by the orphan Esther is particularly sweet.","chinese":"第一人稱敘事的孤兒以斯帖相關的是特別的甜。"},{"english":"And they told to Mordecai Esther's words.","chinese":"人就把以斯帖這話告訴末底改。"},{"english":"Why have you come, Queen Esther?You must have some request?","chinese":"王后以斯帖啊，你一定有所求？"},{"english":"And Esther said, The adversary and enemy is this wicked Haman.","chinese":"以斯帖說，仇人敵人就是這惡人哈曼。"},{"english":"So the king and Haman came to the feast which Esther had made ready.","chinese":"於是王帶着哈曼赴以斯帖所預備的筵席。"}],"related":[]}