{"definition":["in order to\/hoping to\/attempting to\/waiting for"],"pinyin":["yi3 qi1"],"simplified":["以期"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"以期","characters":[{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["a period of time\/phase\/stage\/classifier for issues of a periodical, courses of study\/time\/term\/period\/to hope\/Taiwan pr. [qi2]"],"pinyin":["qi1"],"word":"期"}],"containing_words":[],"sentences":[{"english":"This study will help improve the management efficiency of Shiyang River, and provide a scientific reference to river basin water resource management.","chinese":"以期爲石羊河流域水資源有效管理提供科學借鑑。"},{"english":"Villagers built Ruiyuan themselves to improve their children's opportunities.","chinese":"村民們修建了瑞元小學，以期改善子女的教育境況。"},{"english":"Who would be able to steer the team forward in order to stage a comeback?","chinese":"誰會站出來帶領球隊前進以期反超？"},{"english":"However, after articling for a law firm in Toronto, his doctor advised him to work outdoors due to his health.","chinese":"另一項研究表明，囚犯，以期對戶外較少的醫生訪問。"},{"english":"So as to get inspiration from it for establishing \"Mental health law\" in the future.","chinese":"以期能對未來我國精神衛生法的制定有所啓發。"},{"english":"Through these measures, reinforcement and improvement of inner-party are possible.","chinese":"通過這些措施，以期能更好地加強和改善黨內監督。"},{"english":"The authors indicate that single stage bio-film processes have great potential for biological nitrogen removal.","chinese":"以期說明單級生物膜法的極具發展潛力的脫氮工藝。"},{"english":"It aimed to provide scientific basis for vertical greening of Jiujiang City.","chinese":"以期對九江市城市垂直綠化工作提供參考。"},{"english":"It may be a new step in theory of road night-space and nightscapes.","chinese":"以期對道路夜空間和景觀理論方面進行了新的探索。"},{"english":"I hope they can have some real impact on the frustration tolerance education.","chinese":"以期能對挫折承受力教育起到一些現實的影響。"},{"english":"or keep trading in the hope of resurrection.","chinese":"或是繼續經營，以期浴火重生。"},{"english":"Politicians show up to receive amulets for good luck at the polls.","chinese":"政客會來此求得護身符以期在選舉中獲得更多選票。"},{"english":"It can provide valuable data for studying of VA mycorrhizae in China.","chinese":"以期爲VA菌根的進一步研究提供有參考價值的資料。"},{"english":"By term , by point and by area, it provides the reference function to the Chinese countryside energy construction.","chinese":"以期以點帶面，對中國農村能源建設提供參考作用。"},{"english":"To obtain excellent flame retardant properties of halogen-free flame-retardant plastic film.","chinese":"以期獲得具有優良阻燃性能的無滷阻燃塑料薄膜。"},{"english":"It can supply effective technology guide to improve the quality of white wines.","chinese":"以期爲白葡萄酒品質的提高提供有效的枝術指導。"}],"related":[{"definition":["in order to"],"pinyin":["yi3 qiu2"],"word":"以求"},{"definition":["to try hard to\/to strive to"],"pinyin":["li4 tu2"],"word":"力圖"},{"definition":["so that\/so as to\/in order to"],"pinyin":["yi3 bian4"],"word":"以便"},{"definition":["so as to\/for the purpose of\/in order to"],"pinyin":["jie4 yi3"],"word":"借以"},{"definition":["using this as a pretext\/thereby"],"pinyin":["jie4 ci3"],"word":"藉此"},{"definition":["with this\/thereby\/thus\/because of this"],"pinyin":["yi3 ci3"],"word":"以此"},{"definition":["using this as a pretext\/thereby"],"pinyin":["jie4 ci3"],"word":"藉此"},{"definition":["to make every effort to\/striving to do one's best"],"pinyin":["li4 qiu2"],"word":"力求"},{"definition":["to have as its purpose\/to be intended to\/to aim to (do sth)"],"pinyin":["zhi3 zai4"],"word":"旨在"},{"definition":["variant of 借以[jie4 yi3]"],"pinyin":["jie4 yi3"],"word":"藉以"},{"definition":["to seek\/to look for"],"pinyin":["xun2 qiu2"],"word":"尋求"},{"definition":["as early as possible"],"pinyin":["jin3 zao3"],"word":"儘早"},{"definition":["to induce\/to promote\/to urge\/to impel\/to bring about\/to provoke\/to drive (sb to do sth)\/to catalyze\/to actuate\/to contribute to (some development)"],"pinyin":["cu4 shi3"],"word":"促使"},{"definition":["as far as possible\/to do one's utmost"],"pinyin":["jin3 ke3 neng2"],"word":"儘可能"},{"definition":["to urgently need\/urgent need"],"pinyin":["ji2 xu1"],"word":"亟需"},{"definition":["easy to\/convenient for"],"pinyin":["bian4 yu2"],"word":"便於"}]}