{"definition":["Israel"],"pinyin":["Yi3 se4 lie4"],"simplified":["以色列"],"rank":1587.0,"normalized_rank":0.022204188994445456,"fraction":0.00010075361208247873,"cumulative_fraction":0.6942457746239066,"word":"以色列","characters":[{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["color\/CL:種|种[zhong3]\/look\/appearance\/sex","color\/dice"],"pinyin":["se4","shai3"],"word":"色"},{"definition":["to arrange\/to line up\/file\/series\/(in data tables) column\/(Tw) row"],"pinyin":["lie4"],"word":"列"}],"containing_words":[{"definition":["Israelite\/Israeli"],"pinyin":["Yi3 se4 lie4 ren2"],"word":"以色列人"}],"sentences":[{"english":"I seldom oppose Israel and Israeli teams these days.","chinese":"我很少反對以色列和以色列隊這幾天。"},{"english":"I seldom oppose Israel and Israeli teams these days.","chinese":"我很少反對以色列和以色列隊這幾天。"},{"english":"The Israelites moved on and camped at Oboth.","chinese":"以色列人起行，安營在阿伯。"},{"english":"So the king and all the children of Israel dedicated the house of the LORD.","chinese":"這樣，王和以色列衆民爲耶和華的殿行奉獻之禮。"},{"english":"And Israel set liers in wait round about Gibeah.","chinese":"以色列人在基比亞的四圍設下伏兵。"},{"english":"European commissioner Chris Patten caught the mood when he suggested yesterday that Israel had dealt with a fire by pouring gasoline on the flames.","chinese":"歐盟外委會專員彭定康稱，以色列這是往火上澆油。"},{"english":"And Elisha said unto him, Take bow and arrows.","chinese":"又對以色列王說，你用手拿弓。"},{"english":"So they moved the ark of the God of Israel.","chinese":"於是將以色列神的約櫃運到那裏去。"},{"english":"Last June, Israel and Hamas agreed to a six-month truce.","chinese":"去年6月，以色列和哈馬斯同意6個月的停火協議。"},{"english":"For Israel and the Philistines had put the battle in array, army against army.","chinese":"以色列人和非利士人都擺列隊伍，彼此相對。"},{"english":"Israel says it killed at least 20 guerillas in the battle.","chinese":"以色列說，以軍在戰鬥中至少打死20名游擊隊員。"},{"english":"As for our redeemer, the LORD of hosts is his name, the Holy One of Israel.","chinese":"我們救贖主的名是萬軍之耶和華以色列的聖者。"},{"english":"32a light for revelation to the Gentiles and for glory to your people Israel.","chinese":"是照亮外邦人的光，又是你民以色列的榮耀。"},{"english":"So God subdued on that day Jabin the king of Canaan before the children of Israel.","chinese":"這樣，神使迦南王耶賓被以色列人制伏了。"},{"english":"Hezbollah fought a 34-day war with Israel in 2006.","chinese":"真主黨在2006年的時候跟以色列交火34天。"},{"english":"3Yet you are enthroned as the Holy One; you are the praise of Israel.","chinese":"但你是聖潔的，是用以色列的讚美爲寶座的。"}],"related":[]}