{"definition":["down to\/up to\/to the extent that..."],"pinyin":["yi3 zhi4 yu2"],"simplified":["以至于"],"rank":7682.0,"normalized_rank":0.10748114672673598,"fraction":0.000012755525035195634,"cumulative_fraction":0.9058675227288674,"word":"以至於","characters":[{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["to arrive\/most\/to\/until"],"pinyin":["zhi4"],"word":"至"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[],"sentences":[{"english":"I can't, I can't do this. I'm so excited that I can't eat lunch.","chinese":"我實在太興奮了，以至於我都沒法喫午餐了。"},{"english":"The wall is so short that they can climb over.","chinese":"這堵牆矮到如此程度，以至於他們可以爬過去。"},{"english":"She was so sleepy that she ran into a lamppost.","chinese":"她太困了以至於撞到了路燈杆上。"},{"english":"Transformations are so simple as to be almost trivial.","chinese":"轉換如此簡單，以至於有點微不足道。"},{"english":"It's such a heretical idea that it's not even up for discussion.","chinese":"這是一個如此異端的想法，以至於它根本不會被討論。"},{"english":"I am sorry. I was too shock to do so.","chinese":"很抱歉，我當時驚嚇過度以至於沒有留意到。"},{"english":"They should not be left lying around, they are sure to get wrinkled and soiled.","chinese":"不要隨意亂放，以至於弄得又縐又髒。"},{"english":"The movements he made were so comical that I was hard put to it not to laugh.","chinese":"他作出的動作是如此的滑稽以至於我忍不住大笑。"},{"english":"The reactions of the amygdala are so quick that they are for all intents automatic.","chinese":"杏仁核的反應是如此之快以至於它們幾乎是無意識的。"},{"english":"Answer:1. He made such rapid progress that he passed the exam. 2.","chinese":"他進步如此的快以至於通過了這次考試。"},{"english":"Water is held so tenaciously that most plant root systems cannot absorb it.","chinese":"水被牢牢地吸住以至於不能被大多數植物根系吸收。"},{"english":"She is so weak that she can't do this job.","chinese":"她身體是那麼的瘦弱以至於不能做這份工作。"},{"english":"So crowded is this bus that I can hardly breathe.","chinese":"車上如此擁擠以至於我幾乎喘不動氣。"},{"english":"It wstipuls a precious moment I didn't wish to move.","chinese":"那一刻云云珍貴以至於我沒有念挪動轉移半步。"},{"english":"There are so many bodies that undertakers want to cremate them in groups.","chinese":"屍體太多了，以至於工作人員得將他們集體火化。"},{"english":"He was such a fan of chewing tobacco that brass spittoons were installed in the White House.","chinese":"他嗜煙如命，以至於把黃銅質的痰盂都放在白宮。"}],"related":[]}