{"definition":["so that\/to the point that"],"pinyin":["yi3 zhi4 yu2"],"simplified":["以致于"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"以致於","characters":[{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["to send\/to devote\/to deliver\/to cause\/to convey"],"pinyin":["zhi4"],"word":"致"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[],"sentences":[{"english":"He is so strong that he can lift the stone .","chinese":"他如此的強壯，以致於可以舉起這塊石頭。"},{"english":"Slowly, the comfort create a rim of beer belly.","chinese":"以致於慢慢地養了一圈的脾酒肚。"},{"english":"I think we're so good that we'll be asked to play in the Olympic Games.","chinese":"我認爲我們如此棒，以致於會被邀請去奧運會打比賽。"},{"english":"There are so many works of art that some of them must be stored away.","chinese":"羅浮宮的館藏衆多，以致於有些藝術品必須收存起來。"},{"english":"Some days I was too tied to get out of bed.","chinese":"有時候我太疲勞了以致於起不了牀。"},{"english":"Our blood-sugar was falling so low that we frequently stumbled as we fought through the sucking mud.","chinese":"我們的血糖降得很低以致於我們不斷在泥濘中跌倒。"},{"english":"All the maths problems on the test paper are difficult, so that I couldn't work out them all.","chinese":"試卷上的所有數學試題都很難，以致於我都做不出來。"},{"english":"There is very little gravity so that things float around.","chinese":"引力很小以致於東西飄來飄去。"},{"english":"She was too angry to say a word.","chinese":"她太生氣了以致於說不出一句話。"},{"english":"He is too short to reach the door bell.","chinese":"他太矮以致於搆不到門鈴。"},{"english":"So much have been given to me, I have no time to ponder over that which has been denied.","chinese":"我得到的太多，以致於再無時間去思考哪個是不好的。"},{"english":"The box is so heavy which I can'; t lift it.","chinese":"這個箱子太沉以致於我無法擡起來。"},{"english":"She smiled in such a way that Bob couldn't help liking heR.","chinese":"她如此的微笑，以致於包伯忍不住喜歡她。"},{"english":"He came so late that he missed the class.","chinese":"他來得如此晚，以致於誤了一節課。"},{"english":"So beautiful is Xi Shi that we all like her。","chinese":"西施是如此美麗，以致於我們都喜歡她。"},{"english":"He is like a fool which he can't boil an egg.","chinese":"他是那樣一個笨蛋，以致於連雞蛋都不會煮。"}],"related":[]}