{"definition":["to guard against the unexpected (idiom); just in case\/prepared for any eventualities"],"pinyin":["yi3 fang2 wan4 yi1"],"simplified":["以防万一"],"rank":33516.0,"normalized_rank":0.4689323240944133,"fraction":6.904741750569393e-7,"cumulative_fraction":0.9930883446030452,"word":"以防萬一","characters":[{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["to protect\/to defend\/to guard against\/to prevent"],"pinyin":["fang2"],"word":"防"},{"definition":["surname Wan","ten thousand\/a great number"],"pinyin":["Wan4","wan4"],"word":"萬"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"}],"containing_words":[],"sentences":[{"english":"Raj :Oh, we should have a plan in case one of us gets lucky.","chinese":"噢，我們得制定個計劃以防萬一我們中有誰走桃花運。"},{"english":"But she kept overfeeding her cat just in case.","chinese":"但是她一直過量地喂着她的貓，以防萬一。"},{"english":"These were extra wedges in case they should be needed.","chinese":"這些額外的木楔是以防萬一的。"},{"english":"I took the precaution of locking money in the safe.","chinese":"我把所有的錢都鎖在保險箱裏以防萬一。"},{"english":"You pay the money just case. ( in )","chinese":"你花錢購買保險只是以防萬一。"},{"english":"Even the ring was attached to a rope, just in case.","chinese":"甚至戒指都綁上了繩子，以防萬一。"},{"english":"I took the precaution of locking everything in the safe.","chinese":"我把一切東西都鎖在保險箱裏以防萬一。"},{"english":"You'd bring along the invincible spear-head with you to be safe.","chinese":"那你要記得帶着這隻鐵槍頭以防萬一。"},{"english":"We make sure we're always well stocked up with candles just in case.","chinese":"我們要確保時刻備足蠟燭，以防萬一。"},{"english":"Residents along the coast were evacuated as a precaution.","chinese":"爲了以防萬一，沿海居民們均被隔離。"},{"english":"It is fine, but I carried an umbrella just in case.","chinese":"天氣晴朗，但我還是帶了一把傘以防萬一。"},{"english":"We bought salt ines by the case.","chinese":"爲了以防萬一我們還買了鹹鹽餅乾。"},{"english":"Ignore that red string, that is just a safety.","chinese":"先別理紅色細繩，那是以防萬一。"},{"english":"As a precaution, put them in an airtight freezer bag.","chinese":"以防萬一，將它們儲存在密閉冷藏袋吧。"},{"english":"Crits and comments welcome. I'll get my asbestos gear out just in case .","chinese":"我將得到我的石綿以齒輪連起出僅僅以防萬一。"},{"english":"I always carry some medicine with me whenever I’m traveling, just to be on the safe side.","chinese":"旅行時，我總是隨身帶着藥，以防萬一。"}],"related":[]}