{"definition":["since (some point in the past)"],"pinyin":["yi3 jiang4"],"simplified":["以降"],"rank":34450.0,"normalized_rank":0.4820001958781638,"fraction":6.371923412523339e-7,"cumulative_fraction":0.9937073925091884,"word":"以降","characters":[{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["to drop\/to fall\/to come down\/to descend","to surrender\/to capitulate\/to subdue\/to tame"],"pinyin":["jiang4","xiang2"],"word":"降"}],"containing_words":[],"sentences":[{"english":"Starting with Socrates, philosophers have been searching for the eternal verities.","chinese":"自蘇格拉底以降，哲學家一直在追尋永恆的真理。"},{"english":"Modernization has been the topic in the course of a century's Chinese history since the end of Oing Dynasty.","chinese":"“現代化”是清末以降百年中國歷史進程的主題。"},{"english":"These resulted from the gradual intensification of imperial power starting from the middle period of Song Dynasty.","chinese":"諸如此者，皆與皇權自劉宋中葉以降漸趨強化有關。"},{"english":"After Tang and Song Dynasty, the style of landscape-painting represented by the two Lis weakened gradually.","chinese":"唐宋以降，以“二李”爲代表的青綠山水逐漸式微。"},{"english":"The emperors of past dynasties have imitated the example since the appearance of it in the Western Han Dynasty.","chinese":"據文獻記載，鐵券出現於西漢，魏晉以降多有頒賜。"},{"english":"With the introduction of the concept of immortals from the Han dynasty on, the mountain god gradually became defined as Lord Lu.","chinese":"隨着漢代以降神仙說的傳入，山神逐漸確定爲廬君。"},{"english":"From the mid-Ching onwards, large numbers of emigrants went abroad from Fujian and Guangdong.","chinese":"清中葉以降，大量的閩粵移民出洋。"},{"english":"In addition, annexing warfare pricked up the occurence of flood since the Spring and Autumn period.","chinese":"春秋以降兼併戰爭加劇了水災的發生。"},{"english":"Since the later period of Ching Dynasty, western missionary appeared in China as the stars in multitude.","chinese":"清季以降，西方傳教士現身於中國者，可謂不絕於途。"},{"english":"During Chunqiu period, Fatality Order declined and Zhou Rite was faced with legitimacy crises.","chinese":"春秋以降，天命隕落，周禮出現嚴重的合法性危機。"}],"related":[{"definition":["to begin\/to start\/then\/only then"],"pinyin":["shi3"],"word":"始"},{"definition":["to decline\/to wane\/weakened\/enfeebled\/in decline"],"pinyin":["shuai1 wei1"],"word":"衰微"},{"definition":["the starting point"],"pinyin":["zhao4 duan1"],"word":"肇端"},{"definition":["scholar"],"pinyin":["shi4 ren2"],"word":"士人"},{"definition":["vestigial residue\/a throwback (to a former age)"],"pinyin":["yu2 xu4"],"word":"餘緒"},{"definition":["to propose\/to put forward (an idea)\/to initiate"],"pinyin":["chang4 yan2"],"word":"倡言"},{"definition":["to esteem\/to revere\/to think highly of sb"],"pinyin":["tui1 zun1"],"word":"推尊"},{"definition":["Confucian"],"pinyin":["Ru2 zhe3"],"word":"儒者"},{"definition":["first day of the first lunar month\/(old) calendar promulgated by the first emperor of a dynasty"],"pinyin":["zheng1 shuo4"],"word":"正朔"},{"definition":["the whole world\/throughout the land\/everything under the sun"],"pinyin":["hai3 nei4"],"word":"海內"},{"definition":["dividing line between distinct realms\/boundary\/field-allocation (in Chinese astrology, the association between celestial regions and corresponding terrestrial realms)"],"pinyin":["fen1 ye3"],"word":"分野"},{"definition":["to change\/to modify"],"pinyin":["gai3 yi4"],"word":"改易"},{"definition":["to believe in (a deity or other supernatural being)\/to worship"],"pinyin":["chong2 feng4"],"word":"崇奉"},{"definition":["to bear in mind"],"pinyin":["fu2 ying1"],"word":"服膺"},{"definition":["tragic disaster\/disturbance and bloodshed"],"pinyin":["sang1 luan4"],"word":"喪亂"},{"definition":["the multitude of common people (in highbrow literature)\/plebeian"],"pinyin":["shu4 min2"],"word":"庶民"}]}