{"definition":["to hold a teaching position"],"pinyin":["ren4 jiao4"],"simplified":["任教"],"rank":12192.0,"normalized_rank":0.17058189805940704,"fraction":0.000005958660750877209,"cumulative_fraction":0.9450795701074424,"word":"任教","characters":[{"definition":["surname Ren\/Ren County 任縣|任县[Ren2 Xian4] in Hebei","to assign\/to appoint\/to take up a post\/office\/responsibility\/to let\/to allow\/to give free rein to\/no matter (how, what etc)\/classifier for terms served in office, or for spouses, girlfriends etc (as in 前任男友)"],"pinyin":["Ren2","ren4"],"word":"任"},{"definition":["religion\/teaching\/to make\/to cause\/to tell","surname Jiao","to teach"],"pinyin":["Jiao4","jiao1","jiao4"],"word":"教"}],"containing_words":[],"sentences":[{"english":"Later he left Simin Martial Arts Institution and was invited to Shenshahai Sports School as a teacher.","chinese":"後從四民武術研究社被邀請到什剎海體校任教。"},{"english":"He once was employed as a country school-teacher.","chinese":"他曾在鄉村小學任教。"},{"english":"She teaches in a state university.","chinese":"她在一所州立大學任教。"},{"english":"Since 1937, he had been teaching in The South-Western United University in Kunming.","chinese":"1937年抗戰開始，他在昆明西南聯大任教。"},{"english":"He dreams of the teaching job at Kabul University and of marrying a woman back home. She is the daughter of family friends a Sayed Shiite who traces her lineage to the prophet Muhammad.","chinese":"他夢想着在喀布爾大學任教，然後回老家娶媳婦。"},{"english":"After graduation, he was appointed as a teacher in Beijing Normal University in 1981.","chinese":"1981年畢業後何教授來到北師大任教。"},{"english":"Wang Li's father have taught English here since his graduation from Peking University.","chinese":"王立的父親從北大畢業後就一直在這任教。"},{"english":"Her coach at that time was Liao Zhixiong from Mingchuan University.","chinese":"教練是任教於銘傳大學的廖智雄先生。"},{"english":"She has also taught at the Ecole des Hautes Etudes en Sciences Sociales in Paris.","chinese":"她還在巴黎高等社會科學研究學校任教過。"},{"english":"It was my good fortune to teach in the Overseas Training Department of Shang- hai International Studies University (SISU).","chinese":"我有幸在上海外國語大學海外培訓部任教。"},{"english":"She teaches at Harvard's Department of Linguistics.","chinese":"她在哈佛大學語言學系任教授。"},{"english":"Li Shutong teaches at the Normal College of Zhejiang, with Feng Zikai as one of his students.","chinese":"李叔同任教於浙江兩級師範學堂，學生中包括豐子愷。"},{"english":"Professor Baglioni taught medicine at the university.","chinese":"巴格里奧尼教授任教於大學醫學院。"},{"english":"University of Science and Technology. Taught at University of Michigan.","chinese":"於香港科技大學，曾任教於美國密執安大學。"},{"english":"U. S. education experts to teach long-term stay in China.","chinese":"美國教育專家任教，長期住在中國。"},{"english":"Yen taught at the Architecture Department of Tamkang University for eight years.","chinese":"並曾在淡江大學建築系任教八年。"}],"related":[{"definition":["to teach (in a school)"],"pinyin":["jiao1 shu1"],"word":"教書"},{"definition":["to teach classes in addition to other duties\/to hold several teaching jobs"],"pinyin":["jian1 ke4"],"word":"兼課"},{"definition":["to go to school"],"pinyin":["jiu4 du2"],"word":"就讀"},{"definition":["hired (for employment)\/invited (e.g. to lecture)\/engaged (for a task)\/(in olden times) betrothal gift from the groom's family"],"pinyin":["shou4 pin4"],"word":"受聘"},{"definition":["to give classes\/to work as a teacher"],"pinyin":["ren4 ke4"],"word":"任課"},{"definition":["to hold an office or post"],"pinyin":["ren4 zhi2"],"word":"任職"},{"definition":["to pursue one's studies"],"pinyin":["shen1 zao4"],"word":"深造"},{"definition":["department of foreign languages\/modern languages (college department)"],"pinyin":["wai4 wen2 xi4"],"word":"外文係"},{"definition":["to join the faculty of one's alma mater upon graduation\/to remain at school during vacation"],"pinyin":["liu2 xiao4"],"word":"留校"},{"definition":["to pass entrance exam\/to enter college after a competitive exam"],"pinyin":["kao3 ru4"],"word":"考入"},{"definition":["PhD degree (Doctor of Philosophy)\/also abbr. to 博士學位|博士学位"],"pinyin":["zhe2 xue2 bo2 shi4 xue2 wei4"],"word":"哲學博士學位"},{"definition":["provost"],"pinyin":["jiao4 wu4 zhang3"],"word":"教務長"},{"definition":["to seek knowledge\/to study\/to attend college"],"pinyin":["qiu2 xue2"],"word":"求學"},{"definition":["graduation\/to graduate\/to finish school"],"pinyin":["bi4 ye4"],"word":"畢業"},{"definition":["to major (in a field)\/to study a specialty to obtain a higher degree"],"pinyin":["gong1 du2"],"word":"攻讀"},{"definition":["normal university\/teacher training college"],"pinyin":["shi1 fan4 da4 xue2"],"word":"師範大學"}]}