{"definition":["Illinois, US state"],"pinyin":["Yi1 li4 nuo4"],"simplified":["伊利诺"],"rank":56954.0,"normalized_rank":0.7968603528605207,"fraction":6.39382005655263e-8,"cumulative_fraction":0.9996553044894704,"word":"伊利諾","characters":[{"definition":["(old) third person singular pronoun (\"he\" or \"she\")\/second person singular pronoun (\"you\")\/(May 4th period) third person singular feminine pronoun (\"she\")\/(Classical Chinese) introductory particle with no specific meaning\/that (preceding a noun)","surname Yi\/abbr. for 伊拉克[Yi1 la1 ke4], Iraq\/abbr. for 伊朗[Yi1 lang3], Iran"],"pinyin":["Yi1","yi1"],"word":"伊"},{"definition":["sharp\/favorable\/advantage\/benefit\/profit\/interest\/to do good to\/to benefit","surname Li"],"pinyin":["Li4","li4"],"word":"利"},{"definition":["to consent\/to promise\/(literary) yes!"],"pinyin":["nuo4"],"word":"諾"}],"containing_words":[{"definition":["Illinois, US state"],"pinyin":["Yi1 li4 nuo4 yi1 zhou1"],"word":"伊利諾伊州"},{"definition":["Illinois, US state"],"pinyin":["Yi1 li4 nuo4 yi1"],"word":"伊利諾伊"},{"definition":["Illinois, US state"],"pinyin":["Yi1 li4 nuo4 zhou1"],"word":"伊利諾州"}],"sentences":[{"english":"1818- Illinois becomes the 21st U. S. state.","chinese":"1818年，伊利諾斯州成爲美國的第21州。"},{"english":"The Illinois stop was particularly important because of the primary calendar.","chinese":"鑑於初選日程安排，伊利諾伊州這一站尤顯重要。"},{"english":"Were you born in Illinois?","chinese":"你出生在伊利諾斯州嗎？"},{"english":"They did that to protect river towns in two other states, Kentucky and Illinois.","chinese":"這樣做是爲了保護肯塔基州和伊利諾斯州的河鎮。"},{"english":"She graduated with Master degree in major vocal pedagogy from Northeaster Illinois University in 2007.","chinese":"現獲得東北伊利諾州立大學聲樂教學法碩士學位。"},{"english":"HW1. The Illinois House impeaches Governor Rod Blagojevich.","chinese":"伊利諾亞州衆議院彈劾了州長羅德。"},{"english":"Even so, any skunk captured in Illinois is euthanized.","chinese":"即使這樣，伊利諾伊州內捕獲的臭鼬均實施安樂死。"},{"english":"McDonald's headquarters is in Oak Brook, Illinois。","chinese":"麥當勞的總部位於伊利諾斯州的橡樹溪。"},{"english":"Illinois was one of the states keen to win FutureGen.","chinese":"伊利諾伊是最有希望贏得“未來發電”的州之一。"},{"english":"That long summer in 1971, I was at Illinois State University of USA.","chinese":"一九七一年的夏天，我在美國伊利諾州立大學。"},{"english":"It is a non-profit organization registered with the state government of Illinois, USA.","chinese":"她是一個在美國伊利諾斯州政府註冊的非盈利性組織。"},{"english":"Smith was arrested and put in jail in Carthage, Illinois.","chinese":"史密斯被捕，並關進了伊利諾斯州迦太基的監獄。"},{"english":"A city of east-central Illinois adjoining Champaign.","chinese":"烏爾班納伊利諾伊州中東部的城市，臨近尚佩恩。"},{"english":"The suit was filed in Illinois' Circuit Court of Cook County.","chinese":"訴訟是向庫克縣伊利諾斯巡迴法院遞交的。"},{"english":"Great states like California and Illinois appear about to go belly-up. The U.","chinese":"像加利福尼亞和伊利諾斯這樣的大洲貌似快破產了。"},{"english":"The University of Illinois at Urbana-Champaign is one of them.","chinese":"伊利諾伊大學厄本那香檳分校就是其中之一。"}],"related":[]}