{"definition":["David Hume (1711-1776), Scottish Enlightenment philosopher"],"pinyin":["Xiu1 mo2"],"simplified":["休谟"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"休謨","characters":[{"definition":["surname Xiu","to rest\/to stop doing sth for a period of time\/to cease\/(imperative) don't"],"pinyin":["Xiu1","xiu1"],"word":"休"},{"definition":["plan\/to practice"],"pinyin":["mo2"],"word":"謨"}],"containing_words":[],"sentences":[{"english":"Hume referred to the latter type of axioms as \"self-evident\" truths.","chinese":"休謨提到的“不言自明的”真理公理後一種類型。"},{"english":"Hume heaps scorn on his contractarian idea.","chinese":"休謨對他的契約論不屑一顧。"},{"english":"You know what Hume said?","chinese":"你知道休謨的話麼？"},{"english":"Because they thought that his treatise of human nature was atheistic.","chinese":"因爲他們認爲休謨關於人性的理論屬於無神論體系。"},{"english":"Hume had a house in Edinburgh.","chinese":"休謨在愛丁堡有一座房子。"},{"english":"And the empiricists are Locke, Berkeley and Hume.","chinese":"經驗主義者有洛克，柏克萊和休謨。"},{"english":"Why does Hume have to be wrong?","chinese":"爲什麼休謨就得是錯的呢？"},{"english":"The conception of justice is the essential content of Hume's moral philosophy.","chinese":"正義觀是休謨道德哲學的核心內容。"},{"english":"Okay, with that background let's go back to Hume's question.","chinese":"基於那樣的背景，讓我們重新回到休謨的問題上來。"},{"english":"The Hume issue is about cause and effect and contains induction.","chinese":"休謨問題是關於因果性的問題，其中蘊含着歸納問題。"},{"english":"Hume in many ways follows Hobbes.","chinese":"休謨在很多方面都承襲於霍布斯。"},{"english":"Humes problem is a quite difficult one in the history of philosophy of logic.","chinese":"休謨問題是邏輯哲學上的一大難題。"},{"english":"So these kinds of propositions are for Hume's relations of ideas.","chinese":"這樣的命題形式就是休謨所謂的意識之間的關係。"},{"english":"Hume draws a distinction between relations of ideas and matters of fact.","chinese":"休謨對意識關係和物質事實進行了鮮明地描述。"},{"english":"Now in many ways Hume can be seen as building on Newton and Locke.","chinese":"現代很多觀點認爲休謨承襲於牛頓和洛克。"},{"english":"Hume wanted to draw as a quite general lesson of science.","chinese":"休謨想把自然科學描繪得非常一般化。"}],"related":[]}