{"definition":["estimate"],"pinyin":["gu1 ce4"],"simplified":["估测"],"rank":38913.0,"normalized_rank":0.5444433562324235,"fraction":4.259627151831181e-7,"cumulative_fraction":0.9960489263419772,"word":"估測","characters":[{"definition":["estimate","old\/second-hand (clothes)"],"pinyin":["gu1","gu4"],"word":"估"},{"definition":["to survey\/to measure\/to conjecture"],"pinyin":["ce4"],"word":"測"}],"containing_words":[],"sentences":[{"english":"A good surgical outcome depends on careful evaluation of your eye before the surgery.","chinese":"好的手術結果依靠術前對你眼睛認真地估測。"},{"english":"The bacteriophage technique was tested to enumerate the bacterial multiplication in leaf tissues of rice.","chinese":"應用噬菌體法估測了水稻葉片中白葉枯病的增殖。"},{"english":"The third part was conducted to predicting true metabolizable energy (TME) of soybean meal in ducks with enzymatic hydrolyzate gross energy (EHGE).","chinese":"酶水解物總能值可直接用於估測豆粕的鴨真代謝能值。"},{"english":"The BLUP is a better method in estimating breeding value of boar.","chinese":"估測青年公豬的育種值，用BLUP法比較好。"},{"english":"To research the availability of a non-invasive method for estimation of human baroreflex function.","chinese":"目的探討無創估測人體壓力反射功能方法的可行性。"},{"english":"The estimation of crop chlorophyll content could provide technical support for precision agriculture.","chinese":"作物葉綠素含量的估測可以爲精準農業提供技術支持。"},{"english":"It is for a discussion of area determination by transect sampling.","chinese":"這是有關截距抽樣估測面積的討論。"},{"english":"As we estimate longer stretches of time, the range of errors gets bigger as well.","chinese":"當我們估測較長的時間時，誤差往往也會隨之增大。"},{"english":"In addition, the design must also take channel estimation and equalization issues into account.","chinese":"除此之外還有通道效應的估測和資料回覆的等化問題。"},{"english":"More shelters will be designated once the government assesses the water level.","chinese":"政府一旦估測了水位，將選定更多的避難所。"},{"english":"It will be difficult to evaluate the complexities of the interactions in real diet situations.","chinese":"所以很難估測在實際飲食情況下相互作用的複雜性。"}],"related":[]}