{"definition":["flexibility"],"pinyin":["shen1 suo1 xing4"],"simplified":["伸缩性"],"rank":43128.0,"normalized_rank":0.6034166748282568,"fraction":2.86262126276249e-7,"cumulative_fraction":0.9975297502487498,"word":"伸縮性","characters":[{"definition":["to stretch\/to extend"],"pinyin":["shen1"],"word":"伸"},{"definition":["to withdraw\/to pull back\/to contract\/to shrink\/to reduce\/abbreviation\/also pr. [su4]"],"pinyin":["suo1"],"word":"縮"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"In general, the topic of hyper sclability can be challenging to address.","chinese":"總的來說，超級可伸縮性是一個極具挑戰性的主題。"},{"english":"Reinforcing sayer is two layers of braid fiber with high retractility .","chinese":"增強層爲兩層高伸縮性編織纖維。"},{"english":"Determine scalability and high-availability requirements.","chinese":"確定可伸縮性和高可用性需求。"},{"english":"And we'll provide a general rule on post-deployment scalability.","chinese":"還要提供關於部署後可伸縮性的一般規則。"},{"english":"Analyze all of these things in terms of scalability of operations.","chinese":"要從操作可伸縮性的角度分析所有這些方面。"},{"english":"There is not much stretch in this collar, I can hardly get it over my head.","chinese":"這領子沒有伸縮性，我穿衣服時頭簡直穿不進去。"},{"english":"If this is the case, then you get linear scalability.","chinese":"如果事實確實如此，那麼您就可以獲得線性可伸縮性。"},{"english":"You must achieve scalability without sacrificing ease of development or standardization.","chinese":"您必須獲得可伸縮性又不犧牲開發或標準化的方便性。"},{"english":"This product is highly elastic, and flexibility, abrasion resistance and flame resistance.","chinese":"本產品具有很強的彈力性，伸縮性，耐磨性和阻燃性。"},{"english":"Performance and scalability optimisations.","chinese":"性能和可伸縮性優化。"},{"english":"Scalability from mid-sized to large enterprises","chinese":"從中小企業到大型企業的可伸縮性。"},{"english":"If it’s a straight line, that’s quite good: “linear scalability”.","chinese":"如果它是一條直線，那就是非常好的“線性伸縮性”。"},{"english":"This edition represents the ultimate in data warehouse performance and scalability.","chinese":"此版本是數據倉庫性能和可伸縮性的最終版本。"},{"english":"The DSCM provides an effective tool for the evaluation of electrostrictive response.","chinese":"該方法爲電致伸縮性能的研究提供了一種有效的工具。"},{"english":"The major disadvantage is that this locking strategy might not be very scalable.","chinese":"但是這種鎖定策略的主要缺點就是可伸縮性較差。"},{"english":"To scale data should be duplicated  instead of being normalized.","chinese":"爲了提高可伸縮性，數據應該重複而非正規化。"}],"related":[]}