{"definition":["to wait for an opportunity\/to watch for one's chance"],"pinyin":["si4 ji1"],"simplified":["伺机"],"rank":14476.0,"normalized_rank":0.20253802135071985,"fraction":0.000004404290980051357,"cumulative_fraction":0.95679270803122,"word":"伺機","characters":[{"definition":["to wait on","to watch\/to wait\/to examine\/to spy"],"pinyin":["ci4","si4"],"word":"伺"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[],"sentences":[{"english":"Hotch: The unsubs are watching and waiting for the best target.","chinese":"不明嫌犯等候最佳的目標，伺機下手。"},{"english":"Prowl is an alternative cost that appears on some Rogue cards.","chinese":"伺機屬於替代性費用，會出現在某些浪客牌上。"},{"english":"In effect, Forlan had a free role and was always looking to keep play moving before driving forward.","chinese":"實際弗蘭的角色更爲自由，一直是在跑動中伺機前插。"},{"english":"Li Ling shamefully surrendered for the moment, planning to wait for an opportunity to strike back.","chinese":"李陵打算暫時先忍辱投降，以便伺機等待機會反擊。"},{"english":"So this is a play by ear as you ones use the term.","chinese":"所以用你們的術語說，這是一場伺機而動的計劃。"},{"english":"In a certain sense he is taking his revenge.","chinese":"從某種意義上說，他是在伺機報復。"},{"english":"They pant for an opportunity of revenging that humiliation.","chinese":"他們伺機爲自己受到的羞辱報仇。"},{"english":"One advantage is that she can play a waiting game.","chinese":"她還有一張王牌就是她可以伺機下手，枕戈待旦。"},{"english":"We thought that Egypt was a romantic country.","chinese":"我認爲比爾是想伺機撈一把。"},{"english":"Jack was hurt deeply, and he bided his time for revenge.","chinese":"傑克深受打擊，他伺機報復。"},{"english":"I thought Bill intended to be on the grab.","chinese":"我認爲比爾是想伺機撈一把。"},{"english":"One evening, the bad guy lurked in the vicinity of the girl's garden and waited.","chinese":"一天晚上，壞蛋埋伏在姑娘花園的附近並伺機行動。"},{"english":"God warned him that sin was waiting at the door of his life, looking for an opportunity to enter.","chinese":"神警示該隱，罪惡已等在生命的門口，伺機進入。"},{"english":"The sky has a few condor to circling, wait for one's chance attacks cate.","chinese":"天上有幾隻禿鷹正在盤旋，伺機撲下來美食一番。"},{"english":"Since then Reed has been waging a vendetta against Baker and Young.","chinese":"從那以後裏德就一直伺機報復貝克和楊。"},{"english":"The Green Link spider has a similar ploy, waiting in the blossoms of flowers to ambush its prey.","chinese":"綠環蜘蛛的策略也很類似，多在花間伺機伏擊獵物。"}],"related":[]}