{"definition":["displacement (vector)"],"pinyin":["wei4 yi2"],"simplified":["位移"],"rank":30806.0,"normalized_rank":0.4310159081051586,"fraction":8.76303694052179e-7,"cumulative_fraction":0.9909750686865,"word":"位移","characters":[{"definition":["position\/location\/place\/seat\/classifier for people (honorific)\/classifier for binary bits (e.g. 十六位 16-bit or 2 bytes)\/(physics) potential"],"pinyin":["wei4"],"word":"位"},{"definition":["to move\/to shift\/to change\/to alter\/to remove"],"pinyin":["yi2"],"word":"移"}],"containing_words":[],"sentences":[{"english":"This text introduces a measure system based on Single chip which can monitor displacements of the paper cutter.","chinese":"介紹了一種基於單片機的切紙機位移測量系統。"},{"english":"Results of far field displacement around a circular cavity are given.","chinese":"文中給出了圓孔周圍的遠場位移的數值結果。"},{"english":"The application of Michelson interference principle in measuring small displacement is introduced.","chinese":"介紹邁克爾遜干涉儀原理在測微小位移中的應用。"},{"english":"This makes it possible to research the polarization in a ferroelectric substance by HRTEM.","chinese":"這是利用高分辨成像研究位移型鐵電體極化的基礎。"},{"english":"And the displacement of speckle image reflects the distortion or displacement of objects.","chinese":"而激光散斑圖像的位移可以反映出物體的位移或形變。"},{"english":"And the displacement of speckle image reflects the distortion or displacement of objects.","chinese":"而激光散斑圖像的位移可以反映出物體的位移或形變。"},{"english":"When Poissons ratio is zero, tile exact solution of displacement is obtained.","chinese":"當泊桑比爲零時，求得位移的精確解。"},{"english":"Pile cap can reduce lateral displacement of pile efficiently.","chinese":"承臺能有效減小土體及樁的水平位移。"},{"english":"Here, a high level of potential optimization can be exploited through the application of displacement sensors in fork-lift trucks.","chinese":"而採用位移傳感器的叉車可以提供衆多潛在優化可能。"},{"english":"This kind of interferogram carries double informations on quantity and direction of displacement vector.","chinese":"這種干涉圖含有位移的大小和方向的雙重信息。"},{"english":"A virtual displacements are small displacements, of several different directions permitted by to the constraints.","chinese":"虛位移是在約束容許的條件下可能發生的。"},{"english":"The corresponding field state consists of two displaced Fock states.","chinese":"相應的光場態爲兩個位移福克態的疊加。"},{"english":"Then a predetermining and surpassing the rigid displacements way is developed.","chinese":"尤其是小視場時剛體位移可達幾十個像素。"},{"english":"I then used this layer as a displacement map for my main piece of footage.","chinese":"然後我用我作爲一個主要的鏡頭位移圖件這一層。"},{"english":"The micro-motion mechanism is one of key components of precision machinery and precision instrument.","chinese":"微位移機構是精密機械和精密儀器的關鍵部件之一。"},{"english":"However if the constraints are unsteady, a small real displacement is no longer a virtual one.","chinese":"而在非定常約束下，微小實位移不再是虛位移之一。"}],"related":[{"definition":["enemy"],"pinyin":["di2 fang1"],"word":"敵方"},{"definition":["to flash"],"pinyin":["shan3 xian4"],"word":"閃現"},{"definition":["to reduce speed\/to slow down\/to take it easy"],"pinyin":["jian3 su4"],"word":"減速"},{"definition":["enemy\/CL:個|个[ge4]"],"pinyin":["di2 ren2"],"word":"敵人"},{"definition":["flexibility"],"pinyin":["ji1 dong4 xing4"],"word":"機動性"},{"definition":["to export\/to output"],"pinyin":["shu1 chu1"],"word":"輸出"},{"definition":["hook"],"pinyin":["gou1 zi5"],"word":"鉤子"},{"definition":["ashes\/embers"],"pinyin":["jin4"],"word":"燼"},{"definition":["to assist\/to aid\/supplementary\/auxiliary\/subsidiary"],"pinyin":["fu3 zhu4"],"word":"輔助"},{"definition":["vertigo\/dizziness\/fainting\/feeling of swaying, head spinning, lack of balance or floating (e.g. from a stroke)\/Taiwan pr. [xuan4 yun1]"],"pinyin":["xuan4 yun4"],"word":"眩暈"},{"definition":["linear velocity"],"pinyin":["xian4 su4 du4"],"word":"線速度"},{"definition":["playing card"],"pinyin":["ka3 pai2"],"word":"卡牌"},{"definition":["burpee (loanword)"],"pinyin":["bo1 bi3"],"word":"波比"},{"definition":["to fire\/to discharge\/to release (fireworks, smokescreen, poison gas, virus etc)"],"pinyin":["shi1 fang4"],"word":"施放"},{"definition":["trajectory (of a projectile)\/ballistic curve"],"pinyin":["dan4 dao4"],"word":"彈道"},{"definition":["straight or circular throwing-knife used by ninja and samurai (loanword from Japanese 手裏剣 shuriken)"],"pinyin":["shou3 li3 jian4"],"word":"手裡劍"}]}