{"definition":["to predominate\/to occupy a dominant position"],"pinyin":["zhan4 you1 shi4"],"simplified":["占优势"],"rank":16379.0,"normalized_rank":0.22916346032767615,"fraction":0.0000035250677334619384,"cumulative_fraction":0.9643035356045556,"word":"佔優勢","characters":[{"definition":["variant of 占[zhan4]"],"pinyin":["zhan4"],"word":"佔"},{"definition":["excellent\/superior"],"pinyin":["you1"],"word":"優"},{"definition":["power\/influence\/potential\/momentum\/tendency\/trend\/situation\/conditions\/outward appearance\/sign\/gesture\/male genitals"],"pinyin":["shi4"],"word":"勢"}],"containing_words":[],"sentences":[{"english":"“In families, the competitive element is in ascendancy, ” he said.","chinese":"在家裏，競爭因素是佔優勢的。"},{"english":"Foreign hostility to China’s export dominance is growing.","chinese":"外國對於中國佔優勢出口的敵意在增加。"},{"english":"The income superiority of the urban natives among unrelated individuals held for both men and women.","chinese":"原住黑人無論男女，在收入上都佔優勢。"},{"english":"From Zheng cotton high low open view of the situation, short is more dominant.","chinese":"而從鄭棉高開低走的態勢來看，空頭更佔優勢。"},{"english":"Applying in Arkansas was a big advantage.","chinese":"在阿肯色州提出申請很佔優勢。"},{"english":"Israel itself has long been superior in weaponry and manpower.","chinese":"以色列本身一直在武器裝備和人力資源上佔優勢。"},{"english":"The form of ammonium N dominated over the inorganic N in the root-layer soils.","chinese":"銨態氮在根系層土壤的無機態氮總量中佔優勢。"},{"english":"France was predominant on land, Britain at sea.","chinese":"法國在陸地上佔優勢，英國則在海上。"},{"english":"At half-time the advantage lay with them.","chinese":"上半場結束時他們佔優勢。"},{"english":"Tom m's college education gave him an advantage over boys who had not been to a university.","chinese":"湯姆的大學髧教育使他比沒上過大學的男孩們佔優勢。"},{"english":"They predominate and are of greatest concentration in the central part of the retina.","chinese":"它們在網膜中部佔優勢，具有最大的濃度。"},{"english":"G. podophylla was the dominant species in the shrub layer.","chinese":"黑桫欏在灌木層中佔優勢地位。"},{"english":"The higher had more advantages then the latter of reading score at speed-reading strategies;","chinese":"閱讀成績高分者比低分者在快速閱讀策略上更佔優勢。"},{"english":"An outstanding feature of ancient Chinese is that the monosyllabic words prevail.","chinese":"古代漢語一個突出特徵是單音詞佔優勢。"},{"english":"But, he pointed out, the dollar is just too dominant for the time being.","chinese":"他指出，但是美元只是在眼下過於佔優勢。"},{"english":"By the life type analysis, the annual plant gain advantage.","chinese":"生活型分析表明一年生植物佔優勢。"}],"related":[]}