{"definition":["what course to follow\/what path to take"],"pinyin":["he2 qu4 he2 cong2"],"simplified":["何去何从"],"rank":18230.0,"normalized_rank":0.2550613518391561,"fraction":0.0000028718178532547922,"cumulative_fraction":0.9701904108355788,"word":"何去何從","characters":[{"definition":["surname He","what\/how\/why\/which\/carry"],"pinyin":["He2","he2"],"word":"何"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"},{"definition":["surname He","what\/how\/why\/which\/carry"],"pinyin":["He2","he2"],"word":"何"},{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"}],"containing_words":[],"sentences":[{"english":"What do we do in times of moral upheaval?","chinese":"在道德淪亡的時代，我們該何去何從？"},{"english":"In this critical time of a toss-up, she will be where to go?","chinese":"在這難以取捨的關鍵時刻，她將何去何從？"},{"english":"If a face could launch a thousand ships, then where am I go ?","chinese":"倘若花容能揚起千艘船隻，我將何去何從？"},{"english":"James's destination has been the subject of ramped-up speculation for two years.","chinese":"過去兩年中詹姆斯將何去何從一直是人們猜測的中心。"},{"english":"Three generations. Where are they heading?","chinese":"三代同堂。何去何從？"},{"english":"Had this been a real life you would have been instructed where to go and what to do.","chinese":"你要是真能直麪人生，你便早會被告知何去何從。"},{"english":"Cause this battle between sisters confidential director leaves GongJin again?","chinese":"引起姐妹之間這場廝殺的保密處長葉公瑾又何去何從？"},{"english":"Do you think that the proliferation of standards may be confusing people about where to go?","chinese":"您認爲標準的增長會使人們對何去何從感到困惑嗎？"},{"english":"Where then does that pantomime villain, globalisation, fit in?","chinese":"那麼，“全球化”這個反面角色又該何去何從呢？"},{"english":"But who could tame the tide away and tell it where to go?","chinese":"而誰又能平復暗潮，告訴它何去何從？"},{"english":"And now you do. The question now is, where are you gonna go from here?","chinese":"現在你知道了阿。接下來的問題是你將要何去何從？"},{"english":"So what does an entrepreneur do when caught in this predicament?","chinese":"一旦遭遇這種困境，企業家該何去何從？"},{"english":"What will they do when the music stops?","chinese":"樂聲戛然而止時，他們又將何去何從？"},{"english":"So where will we all be, language-wise, ten years from now?","chinese":"那麼，十年後我們的語言將何去何從？"},{"english":"Where will all the martyrs go when the virus cures itself?","chinese":"當病毒治癒着它自己時，所有那些殉難者何去何從？"},{"english":"What would they do if this child queen bestowed it on them?","chinese":"若小女王將自由賜予了他們他們又何去何從？"}],"related":[{"definition":["to choose (literary)"],"pinyin":["jue2 ze2"],"word":"抉擇"},{"definition":["not knowing which course to follow (idiom); at a loss what to do"],"pinyin":["wu2 suo3 shi4 cong2"],"word":"無所適從"},{"definition":["things turn out contrary to the way one wishes (idiom)"],"pinyin":["shi4 yu3 yuan4 wei2"],"word":"事與願違"},{"definition":["to worry\/to fret\/to be anxious\/to become sad"],"pinyin":["fa1 chou2"],"word":"發愁"},{"definition":["to leave a place where some event is taking place\/(of an actor) to exit\/(sports) to leave the field\/(of an audience) to leave"],"pinyin":["tui4 chang3"],"word":"退場"},{"definition":["an unforeseen event\/accident\/misfortune"],"pinyin":["bian4 gu4"],"word":"變故"},{"definition":["not knowing anything at all (idiom); completely ignorant\/without an inkling"],"pinyin":["yi1 wu2 suo3 zhi1"],"word":"一無所知"},{"definition":["fatigued\/exhausted\/poverty-stricken\/in straitened circumstances"],"pinyin":["kun4 dun4"],"word":"困頓"},{"definition":["tossed about by the wind and rain (idiom)\/(of a situation) unstable"],"pinyin":["feng1 yu3 piao1 yao2"],"word":"風雨飄搖"},{"definition":["thus and so\/such and such"],"pinyin":["ru2 ci3 zhe4 ban1"],"word":"如此這般"},{"definition":["dense fog\/fig. completely misleading"],"pinyin":["mi2 wu4"],"word":"迷霧"},{"definition":["circumstances"],"pinyin":["jing4 kuang4"],"word":"境況"},{"definition":["to change profession"],"pinyin":["zhuan3 hang2"],"word":"轉行"},{"definition":["great changes"],"pinyin":["ju4 bian4"],"word":"巨變"},{"definition":["to follow the track of an overturned cart\/to repeat a disastrous policy"],"pinyin":["chong2 dao3 fu4 zhe2"],"word":"重蹈覆轍"},{"definition":["lit. to have one's hands bound and be unable to do anything about it (idiom); fig. helpless in the face of a crisis"],"pinyin":["shu4 shou3 wu2 ce4"],"word":"束手無策"}]}