{"definition":["to put out\/to come up with\/to make (a choice, decision, proposal, response, comment etc)\/to issue (a permit, statement, explanation, apology, reassurance to the public etc)\/to draw (conclusion)\/to deliver (speech, judgment)\/to devise (explanation)\/to extract"],"pinyin":["zuo4 chu1"],"simplified":["作出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"作出","characters":[{"definition":["to do\/to grow\/to write or compose\/to pretend\/to regard as\/to feel\/writings or works","worker\/workshop\/(slang) troublesome\/high-maintenance (person)"],"pinyin":["zuo1","zuo4"],"word":"作"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[{"definition":["to do sth under oath (idiom)"],"pinyin":["yi3 zuo4 chu1 bao3"],"word":"已作出保"}],"sentences":[{"english":"Drache to confidential action content, therefore has not to clarify in this matter.","chinese":"卓凱爲了保密行動內容，故一直沒有就此事作出澄清。"},{"english":"Watching from the boat, Mr Kirkconnell is sure Mr Clasen the right decision.","chinese":"事發時在船上的卡梅倫稱，克拉森作出了正確的決定。"},{"english":"The instantmessaging feature appears to be one part of Microsoft's response.","chinese":"即時通服務似乎是微軟對此舉動作出迴應的一部分。"},{"english":"Using a grease pencil or equivalent, make alignment marks on the glass and body.","chinese":"使用油筆或其它等同物，在玻璃與車體上作出標記。"},{"english":"This paper tries to explore the application of fine powder technology to Chinese medicinal herbs and insoluble medicines.","chinese":"本文就難溶藥物與中草藥微細化技術作出探索性研究。"},{"english":"You\"ve made a good decision, and you should stick to it.\"","chinese":"你們作出了好的決定，就應該堅決執行下去。"},{"english":"Paley's friends and advisers told him that he had made a huge mistake.","chinese":"佩利的朋友和顧問告訴他，他作出了巨大的錯誤。"},{"english":"Such an act of cowardice by an officer shames his whole regiment.","chinese":"一個軍官作出如此膽怯的行爲使整個團都蒙受羞辱。"},{"english":"His greatest contributions came when he was a \"senior citizen.\"","chinese":"他作出最大了貢獻的時候已是垂暮之年了。"},{"english":"And here I am ranting against somebody that doesn't have a chance to respond.","chinese":"並且在這裏我還要痛斥那些此時無法作出迴應的人。"},{"english":"We await your decision.; We are expecting you to make a decision.","chinese":"我們期待你作出決定。"},{"english":"But a definitive decision on the form of struggle to be pursued had not yet been made.","chinese":"但是對於所從事的鬥爭的明確方式還沒有作出規定。"},{"english":"With his team of workers, he invented an electric light bulb, the phonograph.","chinese":"他作出了六千項發明，包括電燈泡，留聲機和油印機。"},{"english":"Every decision to act is an intuitive one .","chinese":"每一個行動決策都是憑直覺作出的。"},{"english":"he modern, anatomically correct definition of the clitoris was developed by the FFWHCs.","chinese":"現代解剖學上正確的陰蒂定義爲FFWHCs所作出。"},{"english":"That means when the judge decided how the property would be divided in the divorce.","chinese":"那就是說離婚時當法官作出決定財產是如何劃分的。"}],"related":[{"definition":["to put out\/to issue"],"pinyin":["zuo4 chu1"],"word":"做出"},{"definition":["to give\/to impose\/to apply"],"pinyin":["yu3 yi3"],"word":"予以"},{"definition":["ruling"],"pinyin":["cai2 ding4"],"word":"裁定"},{"definition":["judgment (by a court of law)\/to pass judgment on\/to sentence"],"pinyin":["pan4 jue2"],"word":"判決"},{"definition":["to raise (an issue)\/to propose\/to put forward\/to suggest\/to post (on a website)\/to withdraw (cash)"],"pinyin":["ti2 chu1"],"word":"提出"},{"definition":["to respond\/response"],"pinyin":["hui2 ying4"],"word":"回應"},{"definition":["to repeal\/to revoke\/(computing) to undo"],"pinyin":["che4 xiao1"],"word":"撤銷"},{"definition":["to accord\/to give\/to show (respect)"],"pinyin":["ji3 yu3"],"word":"給予"},{"definition":["according to\/basis\/foundation"],"pinyin":["yi1 ju4"],"word":"依據"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["in view of\/seeing that\/considering\/whereas"],"pinyin":["jian4 yu2"],"word":"鑒於"},{"definition":["legal (proceedings)\/according to law"],"pinyin":["yi1 fa3"],"word":"依法"},{"definition":["constitutionality"],"pinyin":["he2 xian4 xing4"],"word":"合憲性"},{"definition":["to declare one's position\/to say where one stands"],"pinyin":["biao3 tai4"],"word":"表態"},{"definition":["to maintain (that sth is true)\/to determine (a fact)\/determination (of an amount)\/of the firm opinion\/to believe firmly\/to set one's mind on\/to identify with"],"pinyin":["ren4 ding4"],"word":"認定"},{"definition":["ruling\/adjudication"],"pinyin":["cai2 jue2"],"word":"裁決"}]}