{"definition":["valid\/counting (as valid)"],"pinyin":["zuo4 shu4"],"simplified":["作数"],"rank":56812.0,"normalized_rank":0.7948735886278735,"fraction":6.539797683414561e-8,"cumulative_fraction":0.9996461290657336,"word":"作數","characters":[{"definition":["to do\/to grow\/to write or compose\/to pretend\/to regard as\/to feel\/writings or works","worker\/workshop\/(slang) troublesome\/high-maintenance (person)"],"pinyin":["zuo1","zuo4"],"word":"作"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[],"sentences":[{"english":"All assignment operators return the value that is assigned to the left operand.","chinese":"所有的賦值運算符都返回賦給左操作數的值。"},{"english":"The operator must have anl-value as its left operand.","chinese":"該運算符必須將左值作爲其左操作數。"},{"english":"If the character is an operand, push it onto the stack.","chinese":"如果字符是一個操作數，把它壓入堆棧。"},{"english":"The result of the operation is the value of the operand \"before\" it has been decremented.","chinese":"該運算的結果是操作數減小“之前”的值。"},{"english":"We can't even elect a president and have every vote count.","chinese":"我們選總統，不能保證沒張投票都作數。"},{"english":"In postfix notation, the operator comes after its operands.","chinese":"在後綴表示法中，操作符位於操作數後面。"},{"english":"If the character is an operand, append it to the result string.","chinese":"如果字符是操作數，將它添加到結果字符串。"},{"english":"But if what you bought is a poisonous apple, this experience doesn't count to admire.","chinese":"但如果你本身買的就是毒蘋果，此經驗不作數哈。"},{"english":"The expressions created are a combination of arithmetic and logical operators, plus operands.","chinese":"表達式包含算術和邏輯運算符以及操作數。"},{"english":"Those will be signs of signs of a turnaround, not the real thing.","chinese":"那些都是預示經濟復甦的信號的信號，不能作數。"},{"english":"The result of the operation is the value of the operand \"after\" it has been decremented.","chinese":"該運算的結果是操作數減小“之後”的值。"},{"english":"The compiler supplies the appropriate operand in the assembly language code it generates.","chinese":"編譯器在自己生成的彙編語言中提供了適當的操作數。"},{"english":"Get operands and perform the operation.","chinese":"獲取操作數並執行運算。"},{"english":"In prefix notation, the operator is written before its operands.","chinese":"前綴表示法中，操作符寫在操作數的前面。"},{"english":"High volume also counts for a lot.","chinese":"高容積很多時候同樣作數。"},{"english":"Often, the order of operand evaluation has no impact on the result of the expression.","chinese":"通常，操作數的求值順序不會影響表達式的結果。"}],"related":[]}