{"definition":["to take notes"],"pinyin":["zuo4 bi3 ji4"],"simplified":["作笔记"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"作筆記","characters":[{"definition":["to do\/to grow\/to write or compose\/to pretend\/to regard as\/to feel\/writings or works","worker\/workshop\/(slang) troublesome\/high-maintenance (person)"],"pinyin":["zuo1","zuo4"],"word":"作"},{"definition":["pen\/pencil\/writing brush\/to write or compose\/the strokes of Chinese characters\/classifier for sums of money, deals\/CL:支[zhi1],枝[zhi1]"],"pinyin":["bi3"],"word":"筆"},{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"記"}],"containing_words":[],"sentences":[{"english":"Hand in hand with reading, he has developed the habit of making notes.","chinese":"他養成了一邊讀書一邊作筆記的習慣。"},{"english":"We are taking notes in our English class.","chinese":"我們在英語課堂上作筆記。"},{"english":"I find it necessary to take down notes while listening. 20. It is time since…","chinese":"我覺得作聽力時有必要作筆記。"},{"english":"I find it necessary to take down notes while listening.","chinese":"我覺得作聽力時有必要作筆記。"},{"english":"For example, the technique of interviewing requires the skills of note-taking and active listening.","chinese":"例如，訪談技術需要作筆記和主動傾聽的技巧。"},{"english":"Some students didn't like to take notes.","chinese":"一些學生不愛作筆記。"},{"english":"One of the best ways of absorbing knowledge is to make notes in the margin while you are reading.","chinese":"獲取知識的最佳途徑之一是讀書時在頁邊作筆記。"},{"english":"When I took notes, I left every other line on my notepaper blank.","chinese":"我作筆記時是隔一行寫一行。"},{"english":"Read, take notes, jot down ideas, develop a thesis.","chinese":"閱讀，作筆記，記下想法，寫總結。"},{"english":"It is helpful for us to take notes in class.","chinese":"對我們來說，在課上作筆記很有幫助。"},{"english":"Notes should be made whenever we study any book.","chinese":"無論學習什麼，我們都要作筆記。"},{"english":"I need to take down notes for the class.","chinese":"我必須爲同學們作筆記。"}],"related":[]}