{"definition":["to be complicated by\/to erupt simultaneously"],"pinyin":["bing4 fa1"],"simplified":["并发"],"rank":22705.0,"normalized_rank":0.3176724077623718,"fraction":0.000001835522680161935,"cumulative_fraction":0.980504340505833,"word":"併發","characters":[{"definition":["to combine\/to amalgamate"],"pinyin":["bing4"],"word":"併"},{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"}],"containing_words":[{"definition":["complications (undesired side-effect of medical procedure)"],"pinyin":["bing4 fa1 zheng4"],"word":"併發症"}],"sentences":[{"english":"Direct fetal injury is an infrequent complication of blunt trauma.","chinese":"胎兒直接損傷是鈍器傷的罕見併發症。"},{"english":"Objective To explain the diagnosis and treatment of retrobulbar hematoma after baggy eye-plasty.","chinese":"目的介紹眼袋成形術併發球后血腫的診斷和治療。"},{"english":"Postoperative hemorrhage was main side effect for conization.","chinese":"宮頸錐切術主要的併發症是術後出血。"},{"english":"He turned to the audience with an embarrassed sigh.","chinese":"他轉向聽衆併發出了窘迫的嘆息聲。"},{"english":"Infliximab and its side-effect profile are discussed, along with other associated complications.","chinese":"針對英利昔單抗的副作用和相關併發症進行了闡述。"},{"english":"The Concurrent GC allocates memory while running but in the current segment which is 16 MB on a workstation.","chinese":"併發GC只在當前段上分配內存，通常是16M。"},{"english":"Appendicitis can cause serious complications, such as","chinese":"闌尾炎可能引起嚴重的併發症。"},{"english":"Postoperative septic arthritis is an uncommon complication after anterior cruciate ligament reconstruction.","chinese":"前叉重建後感染性關節炎是一種罕見的併發症。"},{"english":"Endoscopic examination is indicated in cases of reflux esophagitis or other complications.","chinese":"有反流性食管炎或其他併發症時應行內鏡檢查。"},{"english":"They do not have the capabilities to treat this complication here.","chinese":"而在這個地方，醫生沒有能力治療這種併發症。"},{"english":"Ethmoid sinusitis is frequently complicated in children by orbital cellulitis and abscess.","chinese":"篩竇炎在兒童中常併發眼眶蜂窩織炎及膿腫。"},{"english":"Objective To study clinical presentations and complications of prolapse of gastric mucosa.","chinese":"目的探討胃黏膜脫垂症的臨牀表現及其併發症。"},{"english":"The cause was complications of cancer, his family said.","chinese":"其家人稱，楊向中博士死於癌症併發症。"},{"english":"Measles can cause temporary complications, such as convulsions (fits) and diarrhoea.","chinese":"麻疹能引起暫時併發症，如驚厥和腹瀉。"},{"english":"At the 6th month of treatment, the complications and prognosis of patients in all groups were evaluated.","chinese":"並於6個月對各組患者的併發症及預後進行評定。"},{"english":"There were no nonunion and other complications.","chinese":"無骨不連和其他併發症發生。"}],"related":[]}