{"definition":["there's not enough time (to do sth)\/it's too late (to do sth)"],"pinyin":["lai2 bu5 ji2"],"simplified":["来不及"],"rank":8602.0,"normalized_rank":0.12035314034670434,"fraction":0.000010622937884369666,"cumulative_fraction":0.9165780477732656,"word":"來不及","characters":[{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["and\/to reach\/up to\/in time for"],"pinyin":["ji2"],"word":"及"}],"containing_words":[],"sentences":[{"english":"It's too late to change it now. What's done is done.","chinese":"現在再改變已經來不及了，木已成舟。"},{"english":"I'm afraid it's too late to catch the first bus.","chinese":"趕頭班車恐怕來不及了。"},{"english":"In fact, you might fall asleep immediately upon switching off the light.","chinese":"事實上，你可能還來不及關燈就已進入了夢鄉。"},{"english":"Some speakers go so fast, the audience has no time to process the information they're hearing.","chinese":"有些講者太快了，聽衆來不及消化。"},{"english":"In life we rub shoulders with some people, but it was too late to meet.","chinese":"生命中有一些人與我們擦肩了，卻來不及遇見。"},{"english":"Drinks water without enough time, the backgammon supermarket's staff then proposed looks at the pear.","chinese":"來不及喝口水，步步高超市的工作人員便提議去看梨。"},{"english":"I didn’t stop to thank her; I just seized the bread and sank my teeth in it.","chinese":"我來不及感謝她，搶過麪包就喫上了。"},{"english":"Sorry this meal isn't much, John. We didn't have time to kill the fatted calf.","chinese":"約翰，很抱歉，飯菜不多，我們來不及設宴歡迎你。"},{"english":"There wasn't even time for making a surgical entry into Herring's brain.","chinese":"甚至來不及在海嶺的腦部做一個進行外科手術的通道。"},{"english":"Little Ruthie told Father everything before Mother could shut her up.","chinese":"母親還來不及阻止小露絲，她就把什麼都告訴了父親。"},{"english":"Becasue i was afraid it's too late to apply for Germany Schengen Visa.","chinese":"因爲怕德意志共合國申根簽證來不及。"},{"english":"Without stopping to think, he darted out of the cupboard, grabbed the hen and scrambled down the beanstalk.","chinese":"來不及多想，他衝出碗廚，抓起母雞，爬下了豆莖。"},{"english":"No time to manage own mood, I have to continue working.","chinese":"來不及收拾自己的情緒，繼續埋頭工作。"},{"english":"With no time to think the yearnings gave up everything for a shot.","chinese":"來不及細想思念從此孤注一擲。"},{"english":"General Fu Rong attempted to give a counterattack, but it was too late.","chinese":"大將苻融試圖反擊卻已經來不及了。"},{"english":"If I send them now they won't be ready for tomorrow,will they?","chinese":"如果現在才送去洗，明天就來不及了，對嗎？"}],"related":[{"definition":["there's still time\/able to do sth in time"],"pinyin":["lai2 de5 ji2"],"word":"來得及"},{"definition":["hurriedly\/without delay"],"pinyin":["gan3 jin3"],"word":"趕緊"},{"definition":["to overtake\/to catch up with\/to hurry\/to rush\/to try to catch (the bus etc)\/to drive (cattle etc) forward\/to drive (sb) away\/to avail oneself of (an opportunity)\/until"],"pinyin":["gan3"],"word":"趕"},{"definition":["at once\/immediately"],"pinyin":["gan3 kuai4"],"word":"趕快"},{"definition":["at once\/right away\/immediately\/on horseback (i.e. by military force)"],"pinyin":["ma3 shang4"],"word":"馬上"},{"definition":["there is nothing to be done\/one can't do anything about it"],"pinyin":["mei2 ban4 fa3"],"word":"沒辦法"},{"definition":["at once\/immediately\/promptly\/swiftly"],"pinyin":["li4 ma3"],"word":"立馬"},{"definition":["(of a person) to turn round\/to face about\/(of a widow) to remarry (archaic)"],"pinyin":["zhuan3 shen1"],"word":"轉身"},{"definition":["haven't\/hasn't\/doesn't exist\/to not have\/to not be"],"pinyin":["mei2 you3"],"word":"沒有"},{"definition":["(negative prefix for verbs)\/have not\/not","drowned\/to end\/to die\/to inundate"],"pinyin":["mei2","mo4"],"word":"沒"},{"definition":["at that time"],"pinyin":["na4 shi2 hou5"],"word":"那時候"},{"definition":["to stop"],"pinyin":["ting2 xia4 lai2"],"word":"停下來"},{"definition":["time\/length of time\/moment\/period"],"pinyin":["shi2 hou5"],"word":"時候"},{"definition":["to be dead\/not to be, or cease to exist"],"pinyin":["mei2 le5"],"word":"沒了"},{"definition":["to say again\/to put off a discussion until later\/moreover\/what's more\/besides"],"pinyin":["zai4 shuo1"],"word":"再說"},{"definition":["to forget"],"pinyin":["wang4 ji4"],"word":"忘記"}]}