{"definition":["to come\/to arrive"],"pinyin":["lai2 dao4"],"simplified":["来到"],"rank":687.0,"normalized_rank":0.009612021322737255,"fraction":0.0002237688122614021,"cumulative_fraction":0.560764087790248,"word":"來到","characters":[{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"}],"containing_words":[],"sentences":[{"english":"The couple arrived at a plain first.","chinese":"這對夫婦先來到一個平原。"},{"english":"Now here’s Charlie, he’s come to the crossroads.","chinese":"那麼現在查理，他也來到了十字路口。"},{"english":"Loves had arrived place, was keeping yesterday's fragrance according to the past.","chinese":"愛曾經來到過的地方，依昔留着昨天的芬芳。"},{"english":"While Charles was in prison, Sydney Carton had also arrived in Paris.","chinese":"當查爾斯在坐牢時，悉尼卡爾登也來到了巴黎。"},{"english":"Welcome to Yunlin airport.","chinese":"歡迎你們來到雲林機場。"},{"english":"The Chu general Zhuang Jiao entered the region from the upper Yangtze River and set himself up as \"King of Dian\".","chinese":"楚國的將軍莊郊從長江上游來到這裏自稱滇王。"},{"english":"Then, with the moon sister Xiaotu to its home.","chinese":"接着，月亮姐姐帶着小兔來到了它的家。"},{"english":"They returned to the store with other protesters day after day.","chinese":"他們與其他抗議者日復一日的來到這個餐館。"},{"english":"Choose came to Beijing, began to north bleaching gens.","chinese":"選擇來到北京，開始北漂一族。"},{"english":"Few friends has she made since she came into this school last year.","chinese":"自從去年她來到這個學校，沒交幾個朋友。"},{"english":"He who does good comes to the temple gate, he who loves reaches the shrine.","chinese":"行善的人來到廟門口，兼愛的人走進大殿堂。"},{"english":"They probably arrived in the United States with settlers and traders from Europe.","chinese":"它們可能是與定居者和商人一起從歐洲來到美國的。"},{"english":"Yangyang arrived in Hefei from Guinea, Africa in 2009.","chinese":"“陽陽”來自非洲幾內亞，是2009年來到合肥的。"},{"english":"And welcome to the Curlicue Restaurant, how are you guys doing?","chinese":"歡迎來到花飾餐館，你們大家好嗎？"},{"english":"On October 12 two sick children arrived at the hospital in a vehicle from a nomad encampment.","chinese":"在10月12日有兩名患病兒童從牧區乘車來到醫院。"},{"english":"Welcome to the Evangelical Formosan Church of Philadelphia resource link repository.","chinese":"歡迎來到費城臺服基督教會網路資源鏈接庫。"}],"related":[]}