{"definition":["there's still time\/able to do sth in time"],"pinyin":["lai2 de5 ji2"],"simplified":["来得及"],"rank":9743.0,"normalized_rank":0.13631721069494773,"fraction":0.0000086023155733468,"cumulative_fraction":0.9275315222142281,"word":"來得及","characters":[{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["and\/to reach\/up to\/in time for"],"pinyin":["ji2"],"word":"及"}],"containing_words":[],"sentences":[{"english":"Before I could answer, she had turned around and started back out onto the field.","chinese":"我還未來得及回話，她已經轉身向足球場上走去了。"},{"english":"Hardly had I had time to say 'Goodbye' to the last year when the new year came here.","chinese":"還沒有來得及辭舊歲，新年就已經來到了。"},{"english":"He had pressed the button before we could stop him.","chinese":"我們還沒來得及阻止他，他已經按了電鈕。"},{"english":"I got up late this morning and went to school without feeding my cats.","chinese":"我早上起牀晚了，所以沒來得及喂貓就上學去了。"},{"english":"Anyway, if he leaves before I see him, then tell him I said hello.","chinese":"要是我沒來得及見他，他就走了，幫我問候他。"},{"english":"The old fellow croaked before he could tell us who shot him.","chinese":"那老人沒來得及告訴我們是誰向他開的槍就斷氣了。"},{"english":"Hehad run out of the room before I could stop him.","chinese":"我還沒來得及攔住他，他就跑出了屋子。"},{"english":"And before I could even smile, I suddenly sneezed.","chinese":"還沒來得及笑出來，我突然打了個噴嚏。"},{"english":"The enemy aircraft plunged down in flames before the pilot had time to bail out.","chinese":"敵飛行員還沒來得及跳傘，飛機就冒着火栽下來了。"},{"english":"Decorations. If you have yet to decorate there is still time for that as well.","chinese":"如果你還在進行裝飾，那麼也是來得及的。"},{"english":"He had rushed out before I could stop him.","chinese":"我還沒來得及攔住他他就衝出去了。"},{"english":"They were whirled away before they could say anything.","chinese":"他們還沒來得及說什麼，就被帶走了。"},{"english":"He tore off before we said goodbye to him.","chinese":"我們還沒來得及向他道別他就匆匆走了。"},{"english":"Perhaps there was still time to intervene in behalf of that man.","chinese":"可能還來得及由他出面說一下情？"},{"english":"The thief had jumped out of the window before the police broke in.","chinese":"警察還沒來得及破門進入，小偷就已跳窗逃竄了。"},{"english":"The last post is at 7 p.m. You can still make it if you go by bike.","chinese":"最後的郵遞時間是晚上七點，你現在騎車去還來得及。"}],"related":[{"definition":["there's not enough time (to do sth)\/it's too late (to do sth)"],"pinyin":["lai2 bu5 ji2"],"word":"來不及"},{"definition":["hurriedly\/without delay"],"pinyin":["gan3 jin3"],"word":"趕緊"},{"definition":["at once\/immediately\/promptly\/swiftly"],"pinyin":["li4 ma3"],"word":"立馬"},{"definition":["at once\/immediately"],"pinyin":["gan3 kuai4"],"word":"趕快"},{"definition":["just recently\/just a moment ago"],"pinyin":["gang1 gang5"],"word":"剛剛"},{"definition":["at once\/right away\/immediately\/on horseback (i.e. by military force)"],"pinyin":["ma3 shang4"],"word":"馬上"},{"definition":["to do sth more quickly\/Hurry up!\/Get a move on!"],"pinyin":["kuai4 dian3"],"word":"快點"},{"definition":["to say again\/to put off a discussion until later\/moreover\/what's more\/besides"],"pinyin":["zai4 shuo1"],"word":"再說"},{"definition":["just now\/a moment ago"],"pinyin":["gang1 cai2"],"word":"剛才"},{"definition":["suddenly"],"pinyin":["tu1 ran2 jian1"],"word":"突然間"},{"definition":["to overtake\/to catch up with\/to hurry\/to rush\/to try to catch (the bus etc)\/to drive (cattle etc) forward\/to drive (sb) away\/to avail oneself of (an opportunity)\/until"],"pinyin":["gan3"],"word":"趕"},{"definition":["to be dead\/not to be, or cease to exist"],"pinyin":["mei2 le5"],"word":"沒了"},{"definition":["see 過來|过来[guo4 lai2]","to come over\/to manage\/to handle\/to be able to take care of"],"pinyin":["guo4 lai2","guo4 lai5"],"word":"過來"},{"definition":["(negative prefix for verbs)\/have not\/not","drowned\/to end\/to die\/to inundate"],"pinyin":["mei2","mo4"],"word":"沒"},{"definition":["here"],"pinyin":["zhe4 'r"],"word":"這兒"},{"definition":["(of a person) to turn round\/to face about\/(of a widow) to remarry (archaic)"],"pinyin":["zhuan3 shen1"],"word":"轉身"}]}