{"definition":["to emerge (from a comparison)\/to come out as\/to be competent or equal to"],"pinyin":["lai2 de5"],"simplified":["来得"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"來得","characters":[{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[{"definition":["there's still time\/able to do sth in time"],"pinyin":["lai2 de5 ji2"],"word":"來得及"},{"definition":["Easy come, easy go. (idiom)"],"pinyin":["lai2 de5 rong2 yi4 , qu4 de5 kuai4"],"word":"來得容易，去得快"},{"definition":["arriving early can't beat coming at the right time\/perfect timing"],"pinyin":["lai2 de5 zao3 bu4 ru2 lai2 de5 qiao3"],"word":"來得早不如來得巧"},{"definition":["arriving early can't beat coming at the right time\/perfect timing"],"pinyin":["lai2 de5 zao3 bu4 ru2 lai2 de5 qiao3"],"word":"來得早不如來得巧"}],"sentences":[{"english":"Compassion for other living things is more important than pleasure.","chinese":"對其他生命的惻隱之心比自身的享樂來得重要。"},{"english":"Before I could answer, she had turned around and started back out onto the field.","chinese":"我還未來得及回話，她已經轉身向足球場上走去了。"},{"english":"Results will usually be better than if you spend 2 hours lolly-gagging around the gym. But be warned.","chinese":"而且效果通常比你在健身房晃盪兩小時來得好。"},{"english":"She said she'd get up earlier than I.","chinese":"她說她今天一定比我來得早。"},{"english":"Hardly had I had time to say 'Goodbye' to the last year when the new year came here.","chinese":"還沒有來得及辭舊歲，新年就已經來到了。"},{"english":"In school teach him it is far more honourable to fail than to cheat.","chinese":"教他求學時不及格比作弊來得剛正。"},{"english":"He had pressed the button before we could stop him.","chinese":"我們還沒來得及阻止他，他已經按了電鈕。"},{"english":"I got up late this morning and went to school without feeding my cats.","chinese":"我早上起牀晚了，所以沒來得及喂貓就上學去了。"},{"english":"An art student from Hong Kong on Nanluoguxiang.","chinese":"香港來得藝術學生在垃圾桶旁邊抽菸。"},{"english":"This tender, juicy steak really hits the ot.","chinese":"這片多汁香嫩的牛排真是來得正是時候。"},{"english":"Anyway, if he leaves before I see him, then tell him I said hello.","chinese":"要是我沒來得及見他，他就走了，幫我問候他。"},{"english":"She encourages them to join the Birdwatching Club to get more information .","chinese":"她鼓勵他們加入觀鳥俱樂部來得到更多的信息。"},{"english":"The old fellow croaked before he could tell us who shot him.","chinese":"那老人沒來得及告訴我們是誰向他開的槍就斷氣了。"},{"english":"I'll wait for you at the school gate whether you come early or late.","chinese":"無論你來得早還是遲我都會在校門口等你。"},{"english":"It is better late than never.","chinese":"但遲做總比不做來得好。"},{"english":"Chadian President Idriss Deby says help is not coming soon enough.","chinese":"乍得總統代比說，協助來得不夠快。"}],"related":[]}