{"definition":["momentum of sth approaching"],"pinyin":["lai2 shi4"],"simplified":["来势"],"rank":26047.0,"normalized_rank":0.36443132371664827,"fraction":0.0000013482493616968056,"cumulative_fraction":0.9857691980618756,"word":"來勢","characters":[{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["power\/influence\/potential\/momentum\/tendency\/trend\/situation\/conditions\/outward appearance\/sign\/gesture\/male genitals"],"pinyin":["shi4"],"word":"勢"}],"containing_words":[],"sentences":[{"english":"The rain came down with a vengeance.","chinese":"這場雨來勢很兇。"},{"english":"Rip currents are so strong that they can carry swimmers away from shore before they know what's happening.","chinese":"強流來勢兇猛，會在不知不覺問把游泳者捲走。"},{"english":"So what exactly are the culprits that make insomnia one menacing sleeping problem ?","chinese":"究竟兇徒使失眠問題之一來勢洶洶睡覺？"},{"english":"Relapses can come on quickly and many different things can trigger them.","chinese":"復發可能來勢很迅速，很多不同的事會引發復發。"},{"english":"These trumpets represent a two-phase invasion by fierce armies, the forces of Islam.","chinese":"這兩枝號代表伊斯蘭兩回來勢洶洶的武裝侵略。"},{"english":"The invaders attacked in full fury, and we must think out a strategy to deal with them.","chinese":"侵略者來勢洶洶，我們要儘快想好應敵之策。"},{"english":"The pulmonary tuberculosis big hemoptysis is one of lung branch acute diseases, the condition oncoming force .","chinese":"肺結核大咯血是肺科的急症之一，病情來勢兇猛。"},{"english":"An intense storm cloud forms over South Africa's Highveld.","chinese":"南非高原的天空正在形成來勢洶洶的暴風雲。"},{"english":"When he saw the mountain torrents rushing down with a devastating force, he was consternated.","chinese":"看到山洪來勢兇猛時，他驚慌失色。"},{"english":"The stronger-than-expected results come despite the impact of cabin crew strikes and the Icelandic ash cloud.","chinese":"儘管結果來勢頭超出的影響罷工和機組的冰島灰雲。"},{"english":"Though its developing history is not long, very fast, break with tremendous force.","chinese":"雖然其發展歷史不長，但速度很快，來勢兇猛。"}],"related":[]}