{"definition":["to originate in"],"pinyin":["lai2 yuan2 yu2"],"simplified":["来源于"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"來源於","characters":[{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["root\/source\/origin"],"pinyin":["yuan2"],"word":"源"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[],"sentences":[{"english":"This paper based on the boiler rebuild project of DaLian Maritime University.","chinese":"本課題來源於大連海事大學的鍋爐房改建工程。"},{"english":"Many of these can be derived from the schematics or the memory configuration of your target hardware.","chinese":"許多這些可以來源於圖表或對內存配置的目標硬件。"},{"english":"Some argue that it originates from the Zulu for 'making a loud noise'.","chinese":"有人說是來源於祖魯語中“製造噪音”的說法。"},{"english":"They say part of their income comes from the registration fee.","chinese":"他們稱他們部分收入來源於掛號費。"},{"english":"When you take the test, you will be presented with two Issue topics from this pool.","chinese":"所有的機考考試題目都來源於它給出的這些？"},{"english":"The ore-forming materials were derived from the mantle.","chinese":"成礦物質初始來源於地幔。"},{"english":"He dismisses the theory that Etna is from a Greek source meaning “I burn.”","chinese":"他否定了埃特納來源於希臘語“我在燃燒”的說法。"},{"english":"These readings are obtained from a Japanese magnetosphere simulator.","chinese":"這些讀數來源於“日本磁氣圈模擬器”。"},{"english":"It's from the argument about self-ownership.","chinese":"而是來源於自我擁有論的觀點。"},{"english":"All that stress is caused by fear. Fear of the unknown.","chinese":"所有的壓力都來源於畏懼，對未知的恐懼。"},{"english":"This topic from fibreglass plant transformation projects of Jiujiang Changjiang fiberglass factory.","chinese":"本次課題來源於九江長江玻璃纖維廠改造工程。"},{"english":"Ground waters originating in different beds commingle.","chinese":"來源於不同層位的地下水相互混合。"},{"english":"The blood group antigens in the spermatozoa are inherent, not from the seminal plasma.","chinese":"精子血型抗原爲本身所固有，並非來源於精漿。"},{"english":"Fear arises out of this inner insufficiency, poverty and emptiness.","chinese":"恐懼來源於這種內在的不足，貧乏和空虛。"},{"english":"The source of pipe line secondary stress check condition is the stability condition.","chinese":"管道二次應力校覈條件來源於結構的安定性條件。"},{"english":"Antinomianism is derived from two Greek words (\"anti\" and \"nomos\") that literally mean \"against the law.","chinese":"反律法主義來源於兩個希臘詞語，義爲“反對律法”。"}],"related":[]}