{"definition":["to come to China"],"pinyin":["lai2 Hua2"],"simplified":["来华"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"來華","characters":[{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["Mt Hua 華山|华山 in Shaanxi\/surname Hua","abbr. for China","magnificent\/splendid\/flowery","old variant of 花[hua1]\/flower"],"pinyin":["Hua2","Hua4","hua1","hua2"],"word":"華"}],"containing_words":[],"sentences":[{"english":"Jia welcomed King Gyanendra to the annual conference of the forum.","chinese":"賈慶林歡迎賈南德拉國王來華出席博鰲亞洲論壇年會。"},{"english":"Princess Anne visited China on September 20 at the invitation of the Foreign Ministry of China.","chinese":"安妮公主是應外交部邀請於20日來華訪問的。"},{"english":"Come and see for yourself at Huangxing Clothes store!","chinese":"來華興服裝店爲你自己來看一下。"},{"english":"Peter has experience in assisting foreign enterprises to invest in China.","chinese":"龔永德在協助國外企業來華投資的經驗豐富。"},{"english":"Yang expressed welcome for Baird's visit and congratulated him for assuming his new office.","chinese":"楊潔篪歡迎貝爾德來華訪問並祝賀其履新。"},{"english":"Li extended a welcome to Kabila for his visit and spoke highly of Sino-DRC relations.","chinese":"李鵬歡迎卡比拉來華訪問，並積極評價中剛雙邊關係。"},{"english":"Mr. Wi Sung Lac, chief of the ROK delegation to the Six-Party Talks came to visit China today.","chinese":"六方會談韓方代表團團長魏聖洛今天來華訪問。"},{"english":"Chao acted as interpreter when Bertrand Russell took a lecture tour of China.","chinese":"當年英國哲學家羅素來華巡迴講學，趙元任擔任翻譯。"},{"english":"Days ago, there was a question about the itinerary of Guinean President Condé's visit to China.","chinese":"前幾天有記者問及幾內亞總統孔戴來華行程安排。"},{"english":"Cosgrove has been in China since last week on his first state visit.","chinese":"上週，科斯格羅夫來華進行首次國事訪問。"},{"english":"Robert Morrison was the first missionary of Protestant Church to do missionary work in China.","chinese":"馬禮遜是基督教新教來華傳教的開山鼻祖。"},{"english":"The delegation pays the visit to China at the invitation of the Information Office of the State Council of China.","chinese":"代表團是應國新辦邀請來華訪問的。"},{"english":"To carry above-mentioned target is the purpose of Stilwell's arrival.","chinese":"史迪威來華是爲實現上述目標服務。"},{"english":"Students resuming study should apply for X visa to come to China.","chinese":"來華自費留學生完成學業後由外事處頒發在學證明。"},{"english":"Applicants must have physical checkup before registration as a student in Guangxi Medical University.","chinese":"留學生來華前應認真進行體格檢查。"},{"english":"It is Damo, an Indian monk, who introduced the traditional Dhyana in India into China.","chinese":"印度僧人達摩東渡來華，帶來了印度傳統的禪法。"}],"related":[]}