{"definition":["to confess\/confession"],"pinyin":["gong4 ren4"],"simplified":["供认"],"rank":10984.0,"normalized_rank":0.15368041078449204,"fraction":0.000007081520656699191,"cumulative_fraction":0.9372338892731096,"word":"供認","characters":[{"definition":["sacrificial offering\/to confess","to provide\/to supply"],"pinyin":["gong1","gong4"],"word":"供"},{"definition":["to recognize\/to know\/to admit"],"pinyin":["ren4"],"word":"認"}],"containing_words":[{"definition":["to make a full confession\/to plead guilty"],"pinyin":["gong4 ren4 bu4 hui4"],"word":"供認不諱"}],"sentences":[{"english":"Both boys pleaded guilty to the theft charge and face sentencing at a later date.","chinese":"這兩名男孩對該偷盜指控供認不諱，並將被擇日宣判。"},{"english":"The confession was not admitted in court, because the accused claimed it had been extorted.","chinese":"因爲被告聲稱逼供，故供認未被法庭採信。"},{"english":"They confessed that employed in non-Mount extension tribe.","chinese":"他們供認，受僱於非芒延族人。"},{"english":"Bianchi had confessed to five of the murders.","chinese":"比安奇供認了其中五項謀殺。"},{"english":"Her guilty conscience made her confess to her crime.","chinese":"她的犯罪感使她供認了自己的罪行。"},{"english":"Currently, Lin Moulong facts of their crimes confession.","chinese":"目前，林某龍對自己的犯罪事實已供認。"},{"english":"Life is not really a fairy tale, you must admit to live with it.","chinese":"生活並不總是像美麗的童話，你得供認這點。"},{"english":"The chess professor confessed his professioning advishage in the confession.","chinese":"象棋教授在供狀中供認了其職業福氣。"},{"english":"MATSUI admits that he heard that foreign governments were protesting against the commission of these atrocities.","chinese":"松井供認，他知道本國政府對這些暴行的抗議。"},{"english":"He admitted to the murder.","chinese":"他供認犯了謀殺罪。"},{"english":"Michael Devlin has been sentenced to life in prison after pleading guilty to kidnapping Ben Ownby.","chinese":"邁克戴夫林在供認綁架本歐文拜後被判處終生監禁。"},{"english":"He also confessed he had committed about 10 similar thefts because of financial problems.","chinese":"他還供認自己因經濟拮据曾犯下約10起類似盜竊案。"},{"english":"The criminal was confined in a prison and soon he confessed his crime.","chinese":"罪犯被禁閉在監獄，很快他供認了罪行。"},{"english":"By inquest , he fessed that he was the chief instigator of this crime group.","chinese":"經過審訊，他供認了他是這個犯罪團伙的主謀。"},{"english":"Even if you gave me some gold.","chinese":"使你給我金子，我也不會供認，”胡蘭回答說。"},{"english":"Kong diverts the company large amount fund to it the delinquent account to confess fully.","chinese":"孔某對其挪用公司鉅額資金的犯罪事實供認不諱。"}],"related":[]}