{"definition":["invading army"],"pinyin":["qin1 lu:e4 jun1"],"simplified":["侵略军"],"rank":33121.0,"normalized_rank":0.4634057616162746,"fraction":7.149984163697438e-7,"cumulative_fraction":0.9928110475467464,"word":"侵略軍","characters":[{"definition":["to invade\/to encroach\/to infringe\/to approach"],"pinyin":["qin1"],"word":"侵"},{"definition":["plan\/strategy\/outline\/summary\/slightly\/rather\/to rob\/to plunder\/to summarize\/to omit"],"pinyin":["lu:e4"],"word":"略"},{"definition":["(bound form) army\/military"],"pinyin":["jun1"],"word":"軍"}],"containing_words":[],"sentences":[{"english":"They demanded that all the aggressor troops be pulled out from their country.","chinese":"他們要求所有侵略軍都應撤出他們的國家。"},{"english":"He declared his country's firm support for the African people's resistance to foreign aggressor troops.","chinese":"他宣佈他的國家堅決支持非洲人民抵抗外國侵略軍。"},{"english":"Consternation spread throughout the city as the invading army approached.","chinese":"當侵略軍逼近時恐慌蔓延了整個城市。"},{"english":"We would never forgive the Japanese invaders their crimes.","chinese":"我們永遠不會寬恕日本侵略軍的滔天罪行。"},{"english":"The invading army had massacred many of the garrison after capitulation.","chinese":"侵略軍在守軍投降後仍將多人屠殺了。"},{"english":"They demanded that the aggressor troops should be withdrawn immediately.","chinese":"他們要求侵略軍立即撤出。"},{"english":"The invading troops tore down the people's houses by force.","chinese":"侵略軍強行拆毀民房。"},{"english":"The task of their regiment was to pin down one of the flanks of the invading army.","chinese":"他們團的任務是牽制侵略軍的側翼。"},{"english":"They delivered their prisoner over to the invading army.","chinese":"他們把俘虜交給了侵略軍。"},{"english":"The invaders burned, killed and looted wherever they went.","chinese":"侵略軍到處燒殺搶掠。"},{"english":"They demanded that all the aggressor troops be pulled out from the country.","chinese":"他們要求把侵略軍從這個國家撤出來。"},{"english":"In time of war, many atrocities are committed by invading armies.","chinese":"戰爭時期，侵略軍幹了很多暴行。"},{"english":"aggressor troops held the capital of the country.","chinese":"侵略軍佔領了該國的首都。"}],"related":[]}