{"definition":["to invade\/to assail\/onslaught"],"pinyin":["qin1 xi2"],"simplified":["侵袭"],"rank":14660.0,"normalized_rank":0.20511242007471356,"fraction":0.0000043155365829193005,"cumulative_fraction":0.9575952603247184,"word":"侵襲","characters":[{"definition":["to invade\/to encroach\/to infringe\/to approach"],"pinyin":["qin1"],"word":"侵"},{"definition":["to attack\/to inherit\/classifier for suits (esp. of funeral robes)"],"pinyin":["xi2"],"word":"襲"}],"containing_words":[],"sentences":[{"english":"Invasive molar pregnancy is extremely rare, but is one of te pre-cancer stage for choriocarcinoma .","chinese":"侵襲性葡萄胎非常罕見，但卻是絨癌的一種癌前病變。"},{"english":"To let base clouds o'ertake me in my way.","chinese":"讓鄙賤的烏雲中途把我侵襲。"},{"english":"The city was affected with plagues.","chinese":"這個城市受到時疫的侵襲。"},{"english":"Sometimes, bone is affected causing gross deformities.","chinese":"有時候骨骼受到侵襲，造成嚴重畸形。"},{"english":"And there is yet another possibility that Isidore could head toward the Yucatan Peninsula.","chinese":"還有一種可能就是颶風伊西多爾會侵襲尤卡坦半島。"},{"english":"It is worrisome that there maybe invasive component. I wou …","chinese":"擔心可能存在侵襲性部分。"},{"english":"The dreaded wood-eating shipworm is invading northern Europe's Baltic Sea.","chinese":"可怕的喫木頭的船蛆正在侵襲北歐的波羅的海。"},{"english":"This colonic mucosal surface is erythematous because of the enormous infestation by Trichuris organisms ( whipworms ).","chinese":"鞭蟲大量侵襲使結腸粘膜表面出現紅斑。"},{"english":"We're facing a medium-strength typhoon.","chinese":"我們面臨中度颱風的侵襲。"},{"english":"This article reviews and gives summary of current research on integrin and the metastasis of ovarian cancer invasion.","chinese":"本文將就整合素和卵巢癌侵襲轉移研究現狀進行綜述。"},{"english":"May be associated with proctitis and a variety of pathogenic microorganisms on the invasion of the intestinal tract.","chinese":"可能與直腸炎及多種病原微生物對腸道的侵襲有關。"},{"english":"I stood there awhile and tried not to let the cold get to me.","chinese":"我在那站了一會，試圖抵擋嚴寒的侵襲。"},{"english":"The boundary of malignant osteoblastoma was obscure, and adjacent tissue could be invaded.","chinese":"侵襲性骨母細胞瘤邊界不清，可侵犯周圍組織。"},{"english":"And dinkum and powerful colour appears directer the soul that attacks a person.","chinese":"而純粹的並且濃烈的色彩似乎更直接侵襲人的靈魂。"},{"english":"Dermoscopy is a non-invasive and in vivo method for early diagnosis and differential diagnosis of pigmented skin lesions.","chinese":"皮膚鏡是一種非侵襲性的在體診斷和鑑別診斷方法。"},{"english":"Objective To investigate the expression of pituitary tumor transforming gene (PTTG) in pituitary macroadenomas and its relationships with tumor invasiveness.","chinese":"在垂體大腺瘤中的表達，探討其與腫瘤侵襲性的關係。"}],"related":[{"definition":["to inflict heavy losses\/to inflict serious damage"],"pinyin":["zhong4 chuang1"],"word":"重創"},{"definition":["hidden beneath the surface\/buried and concealed"],"pinyin":["qian2 cang2"],"word":"潛藏"},{"definition":["attack (esp. surprise attack)\/raid\/to attack"],"pinyin":["xi2 ji1"],"word":"襲擊"},{"definition":["to be on guard\/wariness\/to guard against\/preventive"],"pinyin":["fang2 fan4"],"word":"防範"},{"definition":["violent\/acute\/severe\/fierce"],"pinyin":["ju4 lie4"],"word":"劇烈"},{"definition":["to spread\/to proliferate\/to diffuse\/spread\/proliferation\/diffusion"],"pinyin":["kuo4 san4"],"word":"擴散"},{"definition":["to resist\/to withstand"],"pinyin":["di3 yu4"],"word":"抵禦"},{"definition":["wind chill\/cold weather\/common cold (medicine)"],"pinyin":["feng1 han2"],"word":"風寒"},{"definition":["to induce\/to cause\/to elicit\/to trigger"],"pinyin":["you4 fa1"],"word":"誘發"},{"definition":["low temperature"],"pinyin":["di1 wen1"],"word":"低溫"},{"definition":["mediocre\/rather poor\/not specially good","range (the difference between the lowest and highest values)"],"pinyin":["jiao4 cha1","jiao4 cha4"],"word":"較差"},{"definition":["stream of air\/airflow\/slipstream\/draft\/breath\/turbulence (of aircraft)"],"pinyin":["qi4 liu2"],"word":"氣流"},{"definition":["to stop\/to resist\/to obstruct"],"pinyin":["zu3 dang3"],"word":"阻擋"},{"definition":["to resist\/to hold back\/to stop\/to ward off\/to withstand"],"pinyin":["di3 dang3"],"word":"抵擋"},{"definition":["to oppress\/to repress\/to constrict\/oppression\/stress (physics)"],"pinyin":["ya1 po4"],"word":"壓迫"},{"definition":["to harm\/to damage\/to injure\/impairment\/loss\/disability"],"pinyin":["sun3 shang1"],"word":"損傷"}]}