{"definition":["an ordinary meal\/simple home cooking"],"pinyin":["bian4 fan4"],"simplified":["便饭"],"rank":49441.0,"normalized_rank":0.6917437353965833,"fraction":1.5327650820502874e-7,"cumulative_fraction":0.9988769974740354,"word":"便飯","characters":[{"definition":["plain\/informal\/suitable\/convenient\/opportune\/to urinate or defecate\/equivalent to 就[jiu4]: then\/in that case\/even if\/soon afterwards","see 便宜|便宜[pian2 yi5]"],"pinyin":["bian4","pian2"],"word":"便"},{"definition":["cooked rice\/CL:碗[wan3]\/meal\/CL:頓|顿[dun4]\/(loanword) fan\/devotee"],"pinyin":["fan4"],"word":"飯"}],"containing_words":[{"definition":["simple home-style meal\/common occurrence\/nothing out of the ordinary"],"pinyin":["jia1 chang2 bian4 fan4"],"word":"家常便飯"}],"sentences":[{"english":"Over-night fame has become a common phenomenon in our modern society.","chinese":"一夜成名成了現代社會的家常便飯。"},{"english":"Peter, you should have told them it’s only a little supper.","chinese":"彼得，你應該告訴他們這只是一頓家常便飯。"},{"english":"We have the old system during rewrite, so chaos is constant.","chinese":"我們重寫舊的系統，因此混亂是家常便飯。"},{"english":"Nowadays you have a game Saturday, Tuesday, Saturday, Tuesday.","chinese":"現在一週雙賽是家常便飯。"},{"english":"He said he would come and dine with me, sans facon.","chinese":"他說他今晚來和我一起喫個便飯。"},{"english":"We've had a lot of coups in my country too.","chinese":"在我的國家裏政變也是家常便飯。"},{"english":"The pre-race inquiries have become as routine as the postrace drug screens.","chinese":"賽前質詢已經像賽後藥檢一樣是家常便飯了。"},{"english":"Put on the table, it is a common practice in the ordinary vegetables.","chinese":"擺在飯桌上，則是家常便飯中的普通菜。"},{"english":"Of course disciplining our children is a given in any home.","chinese":"當然了，教導孩子在任何家庭中都是家常便飯了。"},{"english":"Yet Miss Politkovskaya was often threatened with death.","chinese":"然而，死亡威脅對安娜而言是家常便飯。"},{"english":"Being stopped by militsiya was a regular occurrence.","chinese":"被警察攔住問話是家常便飯。"},{"english":"In the streets of Athens, demonstrations have become everyday occurrences.","chinese":"在雅典街頭，遊行示威已成爲家常便飯。"},{"english":"Come along and take potluck with us.","chinese":"跟我們一塊兒喫頓便飯吧。"},{"english":"In India, recriminations after the Mumbai attacks have been rife.","chinese":"在印度，孟買襲擊以後的互相指責成了家常便飯。"},{"english":"Come along and take potluck.","chinese":"請來喫頓家常便飯。"},{"english":"Come alonge and take potluck with us.","chinese":"跟我們一塊兒喫頓便飯吧。"}],"related":[]}