{"definition":["as the proverb says\/as they say..."],"pinyin":["su2 hua4 shuo1"],"simplified":["俗话说"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"俗話說","characters":[{"definition":["custom\/convention\/popular\/common\/coarse\/vulgar\/secular"],"pinyin":["su2"],"word":"俗"},{"definition":["dialect\/language\/spoken words\/speech\/talk\/words\/conversation\/what sb said\/CL:種|种[zhong3],席[xi2],句[ju4],口[kou3],番[fan1]"],"pinyin":["hua4"],"word":"話"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"}],"containing_words":[],"sentences":[{"english":"As the saying goes, the devil often appears in the subtle.","chinese":"俗話說，魔鬼常出現在細微處。"},{"english":"Kate: As the saying goes,\"Interest is the best teacher.\"Right?","chinese":"俗話說得好，興趣是最好的老師，對吧？"},{"english":"An old saying goes that a near neighbor is better than a distant cousin. Having a good neighbor is lucky.","chinese":"俗話說“遠親不如近鄰”，有個好鄰居是件幸運的事。"},{"english":"As the saying is \"Male afraid the wrong line, female afraid married the wrong lang\".","chinese":"俗話說“男怕入錯行，女怕嫁錯郎”。"},{"english":"As the saying goes, there is honour among thieves.","chinese":"俗話說的好，盜亦有道。"},{"english":"As the saying goes, taking money, especially disaster.","chinese":"俗話說，拿人錢財，替人消災。"},{"english":"As the saying goes, “A fall into the pit, a gain in your wit.”","chinese":"俗話說，“喫一塹，長一智”。"},{"english":"As the saying goes, \"those are not high, no long-life air-chi.\"","chinese":"俗話說得好，“有志不在年高，無志空長百歲。”"},{"english":"The fatherland is our family, but now many students abroad cannot go back.","chinese":"俗話說祖國是家，如今有家卻不能回。"},{"english":"In fact, non-verbal communication can, as the saying goes, speak volumes.","chinese":"事實非言語交際，正如俗話說，此時無聲勝有聲。"},{"english":"People say that the only naturally air-conditioned place in summer is a big cave.","chinese":"俗話說大大的洞穴是夏天裏唯一的天然空調房。"},{"english":"We have the saw to the effect that many a true word is spoken in jest.","chinese":"俗話說的好，許多真相都是開着玩笑說出來的。"},{"english":"As the saying goes well, to stay in the Castle Peak, not afraid of firewood.","chinese":"俗話說得好，留在青山在，不怕沒柴燒。"},{"english":"As the saying goes, wives have to find a woman Chaoshan.","chinese":"俗話說，找老婆就要找潮汕女人。"},{"english":"There is a saying that the common people are too clever to be fooled by crooks.","chinese":"俗話說的好，老百姓太聰明而被騙子愚弄。"},{"english":"Common saying says, \"Jie Ling fastens a bell to enter even \" .","chinese":"俗話說，“解鈴還要系鈴入”。"}],"related":[]}