{"definition":["to preserve\/to save"],"pinyin":["bao3 zhu4"],"simplified":["保住"],"rank":8096.0,"normalized_rank":0.11327354385572175,"fraction":0.000011732951759027796,"cumulative_fraction":0.9109350725451112,"word":"保住","characters":[{"definition":["Bulgaria\/Bulgarian\/abbr. for 保加利亞|保加利亚[Bao3 jia1 li4 ya4]","to defend\/to protect\/to keep\/to guarantee\/to ensure\/civil administration unit in the baojia 保甲[bao3 jia3] system (old)"],"pinyin":["Bao3","bao3"],"word":"保"},{"definition":["to live\/to dwell\/to stay\/to reside\/to stop\/(suffix indicating firmness, steadiness, or coming to a halt)"],"pinyin":["zhu4"],"word":"住"}],"containing_words":[],"sentences":[{"english":"The utility model thoroughly solves the wind-proof problem and the slide-proof problem; heavy equipment can not be damaged by the utility model.","chinese":"徹底解決了防風抗滑問題，保住重大設備不受損失。"},{"english":"Arsenal goalkeeper Wojciech Szczesny is determined to hold on to his Arsenal place next season.","chinese":"什琴斯尼下定決心要在下賽季保住他的首發地位。"},{"english":"This not only saves face it could save your job!","chinese":"這不僅能幫你挽回顏面，甚至還能幫你保住工作。"},{"english":"After that it was quiet for me and I managed to hold position.","chinese":"從那以後一切都正常，而且我設法保住了我的位置。"},{"english":"Only children homeschooled like Sylvie had the chance to live.","chinese":"只有那些像茜爾維這樣在家學習的孩子才保住了命。"},{"english":"Being able to call a manicurist to your apartment would be the first step in guaranteeing yourself the job.","chinese":"爲了保住這份工作，把修甲師約到你家將成爲第一步。"},{"english":"Doing the job WRONG fourteen times gives you job security.","chinese":"連續十四次把工作做錯讓你保住工作。"},{"english":"The U.K. wasn't the only country that struggled to keep its ranking.","chinese":"英國並非唯一一個沒有保住名次的國家。"},{"english":"Such discretion allowed him to retain his standing as the Empire rose to power.","chinese":"謹言慎行使他在帝國掌權時保住了自己的地位。"},{"english":"He builds a sand hill to save Grandma's house.","chinese":"他堆起了一座沙山來保住奶奶的房子。"},{"english":"However, there are also some leaders who dare not to talk much in order that their official position are safe.","chinese":"當然，也有部分領袖爲了保住本身的官位而不敢嗆聲。"},{"english":"Captain Louie Perea says one twin died while the other survived with a single gunshot wound to her head, The Denver Post reports.","chinese":"警員說一人死亡，另一人頭部中彈但是保住了性命。"},{"english":"Your best bet to win the first game in this matchup is just to do everything you can to maintain your life total.","chinese":"你首盤獲勝的唯一賭注，就是儘可能地保住你的小命。"},{"english":"He swung the car to the left and that swerve saved Malone's life.","chinese":"他猛地將車頭轉向左邊，這才保住了馬隆的性命。"},{"english":"Stop the child or he will be falling over.","chinese":"保住孩子，他要臉朝下跌倒。"},{"english":"Protect state property, and the end is glorious Comrade sacrificed.","chinese":"國家財產保住了，尾生同志卻光榮的犧牲了。"}],"related":[{"definition":["to save from damage\/to preserve\/to maintain\/to keep in good repair\/(Tw) security guard"],"pinyin":["bao3 quan2"],"word":"保全"},{"definition":["to save\/to remedy\/to rescue"],"pinyin":["wan3 jiu4"],"word":"挽救"},{"definition":["to hold on to\/to defend\/to keep\/to guard"],"pinyin":["shou3 zhu5"],"word":"守住"},{"definition":["cannot maintain (sth)\/unable to keep\/more likely than not\/may well"],"pinyin":["bao3 bu5 zhu4"],"word":"保不住"},{"definition":["life"],"pinyin":["xing4 ming4"],"word":"性命"},{"definition":["to escape unscathed\/to get through in one piece"],"pinyin":["quan2 shen1 er2 tui4"],"word":"全身而退"},{"definition":["life\/to survive\/to save a life\/to scrape a living"],"pinyin":["huo2 ming4"],"word":"活命"},{"definition":["to take back (forcibly)\/to recapture\/to win back"],"pinyin":["duo2 hui2"],"word":"奪回"},{"definition":["imminent danger (idiom); approaching a crisis"],"pinyin":["ji2 ji2 ke3 wei1"],"word":"岌岌可危"},{"definition":["to lose\/to throw away\/to discard\/to cast away"],"pinyin":["diu1 diao4"],"word":"丟掉"},{"definition":["to withstand\/to stand up to"],"pinyin":["ding3 zhu4"],"word":"頂住"},{"definition":["to bring back to life"],"pinyin":["jiu4 huo2"],"word":"救活"},{"definition":["to pay for sth with the loss of (one's health etc)\/to have sth come at the cost of (one's reputation etc)"],"pinyin":["pei2 shang4"],"word":"賠上"},{"definition":["luckily\/by a fluke"],"pinyin":["jiao3 xing4"],"word":"僥倖"},{"definition":["to seek to protect\/to ensure\/to maintain\/to guard"],"pinyin":["li4 bao3"],"word":"力保"},{"definition":["to save one's life\/to survive"],"pinyin":["bao3 ming4"],"word":"保命"}]}