{"definition":["(idiom) to safeguard (sth)\/to protect (sth)"],"pinyin":["bao3 jia4 hu4 hang2"],"simplified":["保驾护航"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"保駕護航","characters":[{"definition":["Bulgaria\/Bulgarian\/abbr. for 保加利亞|保加利亚[Bao3 jia1 li4 ya4]","to defend\/to protect\/to keep\/to guarantee\/to ensure\/civil administration unit in the baojia 保甲[bao3 jia3] system (old)"],"pinyin":["Bao3","bao3"],"word":"保"},{"definition":["surname Jia","to harness\/to draw (a cart etc)\/to drive\/to pilot\/to sail\/to ride\/your good self\/prefixed word denoting respect (polite 敬辞)"],"pinyin":["Jia4","jia4"],"word":"駕"},{"definition":["to protect"],"pinyin":["hu4"],"word":"護"},{"definition":["boat\/ship\/craft\/to navigate\/to sail\/to fly"],"pinyin":["hang2"],"word":"航"}],"containing_words":[],"sentences":[{"english":"Teachers to do a guide, students can learn self-protect.","chinese":"教師要做一個領路人，爲學生的自能學習保駕護航。"},{"english":"Too big a risk, even with Mr. Eastwood at the wheel.","chinese":"縱使有伊斯特伍德保駕護航，冒的險也忒大了吧。"},{"english":"Ghosts of Lost Souls at Sea to be Shepherded Through the Watery Passageway.","chinese":"海上死難者的靈魂將乘着水路被保駕護航。"},{"english":"Select Jinxing Central Asia, to protect you, the user first choice.","chinese":"選擇金興中亞，爲您保駕護航，用戶第一首選。"},{"english":"In short courageous love is the love of weapons escort.","chinese":"總之勇敢就是愛情的武器爲愛情保駕護航。"},{"english":"Wish Jin Shengyuan science and technology escorts the Emperor for your career progress convoy.","chinese":"願金聖元科技爲您事業發展保駕護航。"},{"english":"They arrive on foreign shores with the security of a job and a salary.","chinese":"爲他們踏上異國領土保駕護航的是穩定的工作和薪水。"},{"english":"The construction of new socialist countryside needs to be escorted and convoyed by law.","chinese":"社會主義新農村建設，需要法治保駕護航。"}],"related":[]}