{"definition":["shelf life\/freshness date"],"pinyin":["bao3 xian1 qi1"],"simplified":["保鲜期"],"rank":45152.0,"normalized_rank":0.6317350607921872,"fraction":2.3473202399398688e-7,"cumulative_fraction":0.9980556813623592,"word":"保鮮期","characters":[{"definition":["Bulgaria\/Bulgarian\/abbr. for 保加利亞|保加利亚[Bao3 jia1 li4 ya4]","to defend\/to protect\/to keep\/to guarantee\/to ensure\/civil administration unit in the baojia 保甲[bao3 jia3] system (old)"],"pinyin":["Bao3","bao3"],"word":"保"},{"definition":["few\/rare","fresh\/bright (in color)\/delicious\/tasty\/delicacy\/aquatic foods"],"pinyin":["xian1","xian3"],"word":"鮮"},{"definition":["a period of time\/phase\/stage\/classifier for issues of a periodical, courses of study\/time\/term\/period\/to hope\/Taiwan pr. [qi2]"],"pinyin":["qi1"],"word":"期"}],"containing_words":[],"sentences":[{"english":"Canned foods and dry mixes will remain fresh for about 2 years.","chinese":"罐裝食物和無水處理過的食物保鮮期大概2年。"},{"english":"The result of storing experiments illustrated that polydextrose also could postpone the shelf life of bread.","chinese":"麪包貯藏實驗表明聚葡萄糖有延長麪包保鮮期的功效。"},{"english":"The organic berries also had a longer shelf-life.","chinese":"同時有機草莓的保鮮期也長一些。"},{"english":"Hence they must be refrigerated and last only a month.","chinese":"因此月餅必須冷藏和只有一個月的保鮮期。"},{"english":"Canned goods have a normal shelflife of one year for maximum freshness.","chinese":"罐裝食品一般有一年的保鮮期。"},{"english":"And the keeping period of cut flowers was not influenced.","chinese":"經處理之切花其保鮮期不受影響。"},{"english":"As for the preservation period, it is another matter, it later planned to.","chinese":"至於保鮮期，那是另一回事呢，以後再作打算。"},{"english":"How to extend the minimal become anxiously meat to solve the problems.","chinese":"如何延長冷卻肉的保鮮期成爲急待解決的問題。"},{"english":"Want to prolong the life of those beautiful roses from you sweetie?","chinese":"您想要延長您的戀人送您的美麗玫瑰花的保鮮期？"}],"related":[]}