{"definition":["car bumper"],"pinyin":["bao3 xian3 gang4"],"simplified":["保险杠"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"保險槓","characters":[{"definition":["Bulgaria\/Bulgarian\/abbr. for 保加利亞|保加利亚[Bao3 jia1 li4 ya4]","to defend\/to protect\/to keep\/to guarantee\/to ensure\/civil administration unit in the baojia 保甲[bao3 jia3] system (old)"],"pinyin":["Bao3","bao3"],"word":"保"},{"definition":["danger\/dangerous\/rugged"],"pinyin":["xian3"],"word":"險"},{"definition":["thick pole\/bar\/rod\/thick line\/to mark with a thick line\/to sharpen (knife)\/(old) coffin-bearing pole"],"pinyin":["gang4"],"word":"槓"}],"containing_words":[],"sentences":[{"english":"See the picture, this PT Cruiser has chrome front bumper and hubcaps.","chinese":"這輛車的前保險槓和輪蓋都是電鍍的。"},{"english":"The fenders had fallen off that old bus.","chinese":"保險槓已從那輛破舊的汽車上脫落下來。"},{"english":"Lamp, Bumper, Mirror, Hood, Fender, Frame of water tank.","chinese":"大燈，保險槓，倒車鏡，機蓋，葉子板，水箱框架。"},{"english":"Remove 2 Philips screws on each side of the bumper in wheel wells.","chinese":"刪除2飛利浦螺絲釘，每邊的保險槓在車輪水井。"},{"english":"The Zenki front bumper was replaced by a smoother, more modern-looking front bumper cover.","chinese":"其前保險槓變得更加圓潤更具現代感。"},{"english":"Yet, we have taken that phrase, and we have made bumper stickers out of it and t-shirts and everything else.","chinese":"我們把它製作成汽車保險槓貼紙，T恤衫和其他東西。"},{"english":"Larger air intakes and odd - shaped fog lights are built into the front bumper.","chinese":"更大的進氣口和奇形霧燈，內置的前保險槓。"},{"english":"Flat-fronted chassis with twin mini- bumpers for impact-damage resistance.","chinese":"平板門前底盤與孿生小保險槓影響損傷的阻力。"},{"english":"The bumper sticker, if you want peace work for justice,that's where James is.","chinese":"汽車保險槓貼紙，雅各的觀點是讓和平爲公正效力。"},{"english":"Can you straighten out the dent in the bumper?","chinese":"你能將保險槓上的凹處修理好嗎？"},{"english":"Tin cans are often tied to the bumper.","chinese":"保險槓上常吊着一些錫質的罐頭瓶。"},{"english":"Our bumpers just grazed (ie touched each other)as we passed.","chinese":"我們錯車時保險槓互相蹭了一下。"},{"english":"The crashworthiness of truck bumper in a low velocity crash was discussed.","chinese":"針對某重型載重汽車保險槓開展低速碰撞安全性研究。"},{"english":"So he backed Benny up and hitched Benny to the man's car bumper.","chinese":"於是農夫讓班尼後退，並把它拴到車的保險槓上。"},{"english":"A vehicle two-body bumper belongs to a vehicle component.","chinese":"汽車兩體保險槓屬於汽車部件。"},{"english":"Bumpers play a very important role during a low-velocity crash.","chinese":"在低速碰撞過程中，保險槓發揮了舉足輕重的地位。"}],"related":[]}