{"definition":["to restore\/to renovate\/restoration\/(computing) to fix (a bug)"],"pinyin":["xiu1 fu4"],"simplified":["修复"],"rank":5036.0,"normalized_rank":0.07046017377191388,"fraction":0.00002381610384489737,"cumulative_fraction":0.8598056086333508,"word":"修復","characters":[{"definition":["surname Xiu","to decorate\/to embellish\/to repair\/to build\/to write\/to cultivate\/to study\/to take (a class)"],"pinyin":["Xiu1","xiu1"],"word":"修"},{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out"],"pinyin":["fu4"],"word":"復"}],"containing_words":[],"sentences":[{"english":"Swelling the fundamental law is one common kind of pressure processes in restoring parts.","chinese":"脹大法是壓力加工修復常用的一種方法。"},{"english":"Fix of the console output, resp.","chinese":"修復控制檯的輸出，分別。"},{"english":"They're perfect for closing open plastic bags, such as rice bags.","chinese":"它們也是修復塑料袋開口的完美選擇，比如米袋。"},{"english":"Ceramic restorative material is the best living substitutive material for natural tooth.","chinese":"陶瓷修復材料是最自然逼真的牙體組織人工替代材料。"},{"english":"The upper eyelid scar was repaired by concealing it in the supratarsal fold naturally.","chinese":"修復上瞼瘢痕，使瘢痕自然隱蔽在上瞼皺襞中。"},{"english":"Danburite is also useful in the repair of the will centers in ascension.","chinese":"賽黃晶在提升中對意願中心的修復也有幫助。"},{"english":"During that project, the new torch was carefully covered with thin sheets of 24k gold.","chinese":"在修復工程中，新的火炬由24K純金薄片仔細覆蓋。"},{"english":"Bi-pedicle muscular flap were used to reconstruct the larynx.","chinese":"殘喉創面修復用雙蒂肌軟骨膜瓣重建喉功能。"},{"english":"The present invention also provides a method for making a removable prosthodontic device.","chinese":"本發明還提供了製備可移動的口腔修復裝置的方法。"},{"english":"PHB is one of the ideal scaffold material in bone tissue engineering.","chinese":"PHB可以作爲組織工程材料中的一種來修復骨缺損。"},{"english":"The emergency repair diskette was saved successfully.","chinese":"急修復磁盤已成功保存了。"},{"english":"Oils and acrylics can be repaired.","chinese":"油畫顏料和丙烯酸都可以得到修復。"},{"english":"Homes, for small minor quick fix on most soft plastics.","chinese":"用於居家，爲小較小快速修復在多數軟的塑料。"},{"english":"There were no changes in hemo-dynamics, so they were not repaired again.","chinese":"因不構成血流動力學的改變，未行二次修復。"},{"english":"Regenerative and reparative body oil that helps tissue elasticity, treating and preventing the appearance of stretch marks.","chinese":"再生和修復身體組織彈性，治療和預防妊娠紋的出現。"},{"english":"Designed to: Keep your PC safe, error-free, and running at top speed.","chinese":"保護系統安全，修復錯誤，以較高的速度運行。"}],"related":[{"definition":["to mend"],"pinyin":["xiu1 bu3"],"word":"修補"},{"definition":["to restore (sth) to (its) former condition\/to recover from illness\/recovery"],"pinyin":["fu4 yuan2"],"word":"復原"},{"definition":["to protect\/to defend\/to safeguard\/protection\/CL:種|种[zhong3]"],"pinyin":["bao3 hu4"],"word":"保護"},{"definition":["clean\/to clean"],"pinyin":["qing1 jie2"],"word":"清潔"},{"definition":["destruction\/damage\/to wreck\/to break\/to destroy"],"pinyin":["po4 huai4"],"word":"破壞"},{"definition":["to maintain\/to conserve\/curing (concrete etc)"],"pinyin":["yang3 hu4"],"word":"養護"},{"definition":["to reappear"],"pinyin":["chong2 xian4"],"word":"重現"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["to renovate\/to repair (a building)"],"pinyin":["xiu1 shan4"],"word":"修繕"},{"definition":["to restore to the original state\/to reconstruct (an event)\/reduction (chemistry)"],"pinyin":["huan2 yuan2"],"word":"還原"},{"definition":["to reinstate\/to resume\/to restore\/to recover\/to regain\/to rehabilitate"],"pinyin":["hui1 fu4"],"word":"恢復"},{"definition":["to take good care of (or conserve) one's health\/to keep in good repair\/to maintain\/maintenance"],"pinyin":["bao3 yang3"],"word":"保養"},{"definition":["structure\/composition\/makeup\/architecture\/CL:座[zuo4],個|个[ge4]"],"pinyin":["jie2 gou4"],"word":"結構"},{"definition":["to start (a machine)\/(fig.) to set in motion\/to launch (an operation)\/to activate (a plan)"],"pinyin":["qi3 dong4"],"word":"啟動"},{"definition":["to recreate\/to reconstruct (a historical relic)"],"pinyin":["zai4 xian4"],"word":"再現"},{"definition":["follow-up\/(dialect) to remarry"],"pinyin":["hou4 xu4"],"word":"後續"}]}