{"definition":["to overthrow\/downfall\/to fall from power\/to go bankrupt"],"pinyin":["dao3 tai2"],"simplified":["倒台"],"rank":25209.0,"normalized_rank":0.3527066164845466,"fraction":0.0000014511635886344675,"cumulative_fraction":0.984597120923292,"word":"倒臺","characters":[{"definition":["to fall\/to collapse\/to lie horizontally\/to overthrow\/to fail\/to go bankrupt\/to change (trains or buses)\/to move around\/to resell at a profit","to place upside down\/to invert\/to pour\/to throw out\/to move backwards\/however\/actually\/as a matter of fact\/contrary to expectation"],"pinyin":["dao3","dao4"],"word":"倒"},{"definition":["Taiwan (abbr.)","platform\/stage\/terrace\/stand\/support\/station\/broadcasting station\/classifier for vehicles or machines"],"pinyin":["Tai2","tai2"],"word":"臺"}],"containing_words":[],"sentences":[{"english":"The American authorities decided to let Lehman fail pour encourager les autres.","chinese":"美國當局決定殺一儆百讓雷曼兄弟倒臺。"},{"english":"Education has been revitalized after the fall of the Taliban.","chinese":"教育在塔利班倒臺之後重生。"},{"english":"Many Cubans welcomed the fall of the Batista government.","chinese":"很多古巴人對巴蒂斯塔政權倒臺表示歡迎。"},{"english":"so I am campaigning for the downfall of evil throughout the universe. Yeah.","chinese":"所以我在爭取全宇宙邪惡勢力的倒臺，是的。"},{"english":"The junta fell less than a year later.","chinese":"不到一年後，軍政府即告倒臺。"},{"english":"It comes amid concern about the possibility of fragmentation of rebel forces after toppling Col Gaddafi.","chinese":"此言是爲了平抑大家對於卡倒臺後義軍分裂的憂慮。"},{"english":"Various factors contributed to his downfall.","chinese":"多種因素的作用導致了他的倒臺。"},{"english":"The Prodi government has fallen in this chamber.","chinese":"在這個議院裏，普羅迪政府已經倒臺了。"},{"english":"In the wake of Lehman Brothers' failure, emerging markets have suffered one of their biggest sell-offs in years.","chinese":"隨着雷曼的倒臺，新興市場經歷了今年最大的拋售。"},{"english":"The Taliban's overthrow in 2001 seemed to open the door to new opportunity.","chinese":"2001年塔利班的倒臺似乎爲巴米揚開了機會之門。"},{"english":"The government eventually collapsed in 1970.","chinese":"該政府終於在一九七零年倒臺了。"}],"related":[]}