{"definition":["to borrow money"],"pinyin":["jie4 zhai4"],"simplified":["借债"],"rank":31472.0,"normalized_rank":0.4403341121822227,"fraction":8.278391219340174e-7,"cumulative_fraction":0.991542247384333,"word":"借債","characters":[{"definition":["to lend\/to borrow\/by means of\/to take (an opportunity)"],"pinyin":["jie4"],"word":"借"},{"definition":["debt\/CL:筆|笔[bi3]"],"pinyin":["zhai4"],"word":"債"}],"containing_words":[{"definition":["debtor\/borrower"],"pinyin":["jie4 zhai4 ren2"],"word":"借債人"}],"sentences":[{"english":"Rather than borrow, he went without food.","chinese":"他寧肯不喫，也不願借債。"},{"english":"It was unwise of you to get into debt.","chinese":"你借債是不明智的。"},{"english":"A writ allowing a creditor to assume temporary ownership of a debtor's property.","chinese":"令許可債權人臨時佔有借債人的財產的一種書面命令。"},{"english":"The lender has a better memory than the borrower.","chinese":"放債的比借債記性好。"},{"english":"Number one is that we got a -- we had a system in which there was huge amounts of leverage that banks could take.","chinese":"第一是我們有一個體系，銀行可在從中取得鉅額借債。"},{"english":"He that goes a borrowing, goes a sorrowing .","chinese":"向人借債，陷入悲哀。"},{"english":"It’s not like an overdrawn bank account which can be made up later.","chinese":"這不象銀行借債，以後可還。"},{"english":"And yet during that period, America's borrowing costs have fallen.","chinese":"但是，在那一段時間內，美國的借債成本卻是下降的。"},{"english":"He that goes a borrowing, goes a sorrowing.","chinese":"借債是不幸的開始。"},{"english":"The fellows having the land or extending loan to others are the loser.","chinese":"有土地或者借債給別人的人就是輸家。"},{"english":"Now suddenly Americans can't borrow in order to spend.","chinese":"然後突然之間美國人不能借債消費了。"},{"english":"A debt was, to him, the beginning of slavery.","chinese":"他感到借債便是奴役的開始。"},{"english":"The first is the borrower's ability to repay the loan and the second is the market value of the property.","chinese":"首先是借債人了償貸款的能力，其次是財富的市值。"},{"english":"The borrowers may use cash or deposits with the Bank of China for debt service.","chinese":"借債人可用現金或其在中國銀行的存款了償貸課本息。"}],"related":[]}