{"definition":["to advocate\/to initiate\/to propose\/to be a proponent of (an idea or school of thought)"],"pinyin":["chang4 dao3"],"simplified":["倡导"],"rank":4847.0,"normalized_rank":0.06781581856085515,"fraction":0.00002507384707793978,"cumulative_fraction":0.8551819725470419,"word":"倡導","characters":[{"definition":["to initiate\/to instigate\/to introduce\/to lead"],"pinyin":["chang4"],"word":"倡"},{"definition":["to transmit\/to lead\/to guide\/to conduct\/to direct"],"pinyin":["dao3"],"word":"導"}],"containing_words":[{"definition":["proponent\/advocate\/pioneer"],"pinyin":["chang4 dao3 zhe3"],"word":"倡導者"}],"sentences":[{"english":"May, who took office earlier this month, is the starkest proponent of this.","chinese":"本月初就職的梅是這種觀念最鮮明的倡導者。"},{"english":"Even so, many activists say they are packing their bags and heading to Washington.","chinese":"即便這樣，許多倡導者說他們要收拾行裝上華盛頓。"},{"english":"The advocates of tele-education give their arguments as follows.","chinese":"遠程教育的倡導者給出了他們的論點如下。"},{"english":"Sakura always advocate that every one on the staff is the host of the business.","chinese":"櫻花公司始終倡導，每一位員工都是企業的主人。"},{"english":"He hopes that the mechanism for Asian cooperation dialogue proposed by Thailand will make progress.","chinese":"中方希望泰方倡導的亞洲合作對話機制能取得進展。"},{"english":"The low-salt advocates suggest that all 300 million Americans be subjected to a low-salt diet.","chinese":"低鹽倡導者們建議全美3億人都加入到低鹽飲食中來。"},{"english":"Second, advocate inclusive growth and increase the endogenous dynamic of economic development.","chinese":"倡導包容性增長，增強經濟發展內生動力。"},{"english":"The virtue of comity is Chinese nation's fine tradition.","chinese":"反對爭利，倡導謙讓，這是中華民族的優良傳統。"},{"english":"Dehn himself was a particularly enthusiastic advocate of group diagrams.","chinese":"戴恩本人就特別熱衷的羣圖解的倡導者。"},{"english":"In teaching college English writing, its of great significance to encourage students to self-correct errors in writing.","chinese":"在大學英語寫作教學中，倡導學生自我糾錯非常重要。"},{"english":"The principle proponent of the Deep Operations theory, Marshal of the Soviet Union, Mikhail Tukhachevsky.","chinese":"大縱深戰略理論的倡導者，蘇聯元帥，圖哈切夫斯基。"},{"english":"China has all along supported and advocated complete prohibition and thorough destruction of nuclear weapons.","chinese":"中國一貫主張並積極倡導全面禁止和徹底銷燬核武器。"},{"english":"Confucianism, the bore Qiu initiated the lofty spirit of morals docile.","chinese":"儒家，孔丘倡導了道德善良的崇高精神。"},{"english":"Dharma Master not only emphasizes the support of every person's path, he also energetically promotes the transmission of the Precepts.","chinese":"法師不僅重視個人的行持，還積極倡導戒法的弘傳。"},{"english":"In liberal education punishment no longer exists. Teachers and students are just like friends.","chinese":"開明教育也將懲戒體罰拒之門外，倡導師生如友。"},{"english":"Finally, Liang Qichao also advocated to modernizing the principles and methods of our education.","chinese":"最後，梁啓超還大力倡導教育原則與方法的現代化。"}],"related":[{"definition":["to extend\/to spread\/to popularize\/generalization\/promotion (of a product etc)"],"pinyin":["tui1 guang3"],"word":"推廣"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to construct (often sth abstract, such as good relations)\/to set up\/to develop\/construction (abstract)\/architecture"],"pinyin":["jian4 gou4"],"word":"建構"},{"definition":["sustainable development"],"pinyin":["ke3 chi2 xu4 fa1 zhan3"],"word":"可持續發展"},{"definition":["to practice\/to put into practice"],"pinyin":["jian4 xing2"],"word":"踐行"},{"definition":["notion\/thought\/concept\/sense\/views\/ideology\/general impressions"],"pinyin":["guan1 nian4"],"word":"觀念"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["model\/example\/paragon"],"pinyin":["dian3 fan4"],"word":"典範"},{"definition":["to build (housing)\/to construct\/to make"],"pinyin":["ying2 zao4"],"word":"營造"},{"definition":["general mood\/atmosphere\/common practice"],"pinyin":["feng1 qi4"],"word":"風氣"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引領"},{"definition":["to practice what one preaches (idiom)"],"pinyin":["shen1 ti3 li4 xing2"],"word":"身體力行"},{"definition":["to found\/to establish"],"pinyin":["chuang4 jian4"],"word":"創建"},{"definition":["active\/energetic\/vigorous\/positive (outlook)\/proactive"],"pinyin":["ji1 ji2"],"word":"積極"},{"definition":["sustainable"],"pinyin":["ke3 chi2 xu4"],"word":"可持續"},{"definition":["to hope\/to expect\/expectation(s)"],"pinyin":["qi1 xu3"],"word":"期許"}]}