{"definition":["rumba (loanword)"],"pinyin":["lun2 ba1"],"simplified":["伦巴"],"rank":36088.0,"normalized_rank":0.5049179410406727,"fraction":5.497517427620367e-7,"cumulative_fraction":0.9946768099302432,"word":"倫巴","characters":[{"definition":["human relationship\/order\/coherence"],"pinyin":["lun2"],"word":"倫"},{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"}],"containing_words":[],"sentences":[{"english":"Two Italian regions, Lombardy and Emilia Romagna, have already requested that a state of emergency be declared.","chinese":"意大利的倫巴第和羅馬涅兩個地區已經發布緊急狀態。"},{"english":"Learn the Cucaracha steps in rumba dancing in this free dance lesson video.","chinese":"學習倫巴舞的蟑螂在這個自由舞蹈課視頻步驟。"},{"english":"Now solo for Rumba.","chinese":"現在倫巴舞踩點。"},{"english":"The follower's role in rumba dance entails straight posture and supporting the leader.","chinese":"跟隨者的角色需要在倫巴舞的姿態，支持直接領導。"},{"english":"Learn the basic box step for rumba dancing in this free Latin dance lesson on video.","chinese":"倫巴舞學習的基本框在這個自由的拉丁舞蹈課踩視頻。"},{"english":"He was shaking like the lead singer in a rumba band.","chinese":"他顫抖得像是個倫巴樂隊的主唱歌手。"},{"english":"Learn how to combine cross body lead steps in rumba dancing in this free dance lesson video.","chinese":"瞭解如何結合本免費舞蹈課視頻交叉體倫巴舞鉛步驟。"},{"english":"I like rumba and jitterbug very much.","chinese":"我很喜歡倫巴舞和吉特巴舞。"},{"english":"Will you dance this rumba with me?","chinese":"可以請你跟我跳這支倫巴舞嗎？"},{"english":"The cha cha dance evolved from the rumba and includes three steps and a shuffle.","chinese":"恰恰恰舞演變而來的倫巴和包括三個步驟和洗牌。"},{"english":"I like to rumba .","chinese":"我喜歡跳倫巴舞。"},{"english":"I like rumba and jitterbug very much.","chinese":"我很喜好倫巴舞和吉特巴舞。"},{"english":"My teacher told us that the rumba is a Latin-American dance.","chinese":"老師告訴我們倫巴舞是拉丁美洲的舞蹈。"},{"english":"We were in Lombard street west.","chinese":"我們住在倫巴德西街。"},{"english":"Thee rumba is a Latin- American dance.","chinese":"倫巴舞是拉丁美洲的舞蹈。"},{"english":"I had one like that when we lived in Lombard street west.","chinese":"當我們住在倫巴德西街時，我也有過這樣的一套。"}],"related":[]}