{"definition":["commendable"],"pinyin":["zhi2 de5 cheng1 zan4"],"simplified":["值得称赞"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"值得稱讚","characters":[{"definition":["value\/(to be) worth\/to happen to\/to be on duty"],"pinyin":["zhi2"],"word":"值"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"},{"definition":["variant of 贊|赞[zan4]\/to praise"],"pinyin":["zan4"],"word":"讚"}],"containing_words":[],"sentences":[{"english":"His good conduct deserves applause.","chinese":"他的優良品行值得稱讚。"},{"english":"History abounds with great men worthy of adulation and emulation.","chinese":"歷史上有很多值得稱讚和效法的偉人。"},{"english":"They took a commendable anti-ageist policy to extremes.","chinese":"他們將反年齡歧視這一值得稱讚的政策推向了極致。"},{"english":"Her good behavior(u)r deserves praise.","chinese":"她的好品行值得稱讚。"},{"english":"It said its porfolio of brands continued to show commendable performance.","chinese":"它說，它的品牌組合繼續顯示出值得稱讚的表現。"},{"english":"His action in rescuing the drowning child was most creditable.","chinese":"他搶救溺水孩子的行爲是很值得稱讚的。"},{"english":"The irony is that nothing is particularly great in the Palmetto State at the moment.","chinese":"諷刺的是這一刻的玲瓏棕櫚州沒有什麼是值得稱讚的。"},{"english":"His painstaking to attain his goal in life is praiseworthy .","chinese":"他爲實現人生目標所下的苦功是值得稱讚的。"},{"english":"Karygiannis doesn't believe the Conservatives' record deserves praise.","chinese":"不過，詹嘉禮卻不認爲保守黨的紀錄值得稱讚。"},{"english":"Obviously, this is done with high precision to compliment the set.","chinese":"很顯然，這種高精度的做法值得稱讚。"},{"english":"The action this government has taken against smoking has been very welcome and it deserves credit for that.","chinese":"政府對吸菸所採取的舉措深得民心並值得稱讚。"},{"english":"It does her credit that she managed not to get angry .","chinese":"她沉住氣沒發脾氣，這是值得稱讚的。"},{"english":"His aim is honorable and praiseworthy.","chinese":"他的目的是高尚的，值得稱讚的。"},{"english":"Considering these two points, she is praiseworthy.","chinese":"從這兩點來說她是值得稱讚的。"}],"related":[]}