{"definition":["notable\/noteworthy\/merit attention"],"pinyin":["zhi2 de5 zhu4 yi4"],"simplified":["值得注意"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"值得注意","characters":[{"definition":["value\/(to be) worth\/to happen to\/to be on duty"],"pinyin":["zhi2"],"word":"值"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["to inject\/to pour into\/to concentrate\/to pay attention\/stake (gambling)\/classifier for sums of money\/variant of 註|注[zhu4]"],"pinyin":["zhu4"],"word":"注"},{"definition":["Italy\/Italian\/abbr. for 意大利[Yi4 da4 li4]","idea\/meaning\/thought\/to think\/wish\/desire\/intention\/to expect\/to anticipate"],"pinyin":["Yi4","yi4"],"word":"意"}],"containing_words":[],"sentences":[{"english":"It is worth noting that the report also found the American border to be atr isk.","chinese":"值得注意的是，報告同時發現，美國邊界亦岌岌可危。"},{"english":"The choice of officers also deserves serious attention.","chinese":"現在軍隊裏的幹部問題很值得注意。"},{"english":"As to the subjective and objective conditions in Kiangsi, they well deserve our attention.","chinese":"至於江西的主觀客觀條件是很值得注意的。"},{"english":"The update of the user experience is probably the most noticeable update.","chinese":"其中用戶體驗的更新也許是最值得注意的更新。"},{"english":"The other thing you'll notice from the chart, again, is the quality of the comparables.","chinese":"表格中另一個值得注意的事項是這項對比的含金量。"},{"english":"Of interest is the plate upon which the divisional insignia has been painted.","chinese":"值得注意的是塗有該師臨時師徽的鐵片。"},{"english":"The request is notable for its size.","chinese":"這個需求值得注意的是它的大小。"},{"english":"Another noteworthy enhancement is the introduction of plug-in architecture.","chinese":"另一個值得注意的改進是插件架構的引入。"},{"english":"You did it in a way that made us take note.","chinese":"要讓我們覺得值得注意，值得記下來。"},{"english":"On these points, the Upper Permian reef limestones in Liuqiao area would be of significance for the future exploration of oil and natural gas.","chinese":"研究區上二疊統礁灰巖是值得注意的油氣勘探遠景區。"},{"english":"Note the tall, pink, columnar nature of the epithelial cells.","chinese":"值得注意的是上皮細胞呈現其原本的粉紅色高柱狀。"},{"english":"It can be noted that the concept of reasonable foreseeability is used often by the law.","chinese":"值得注意的是法律上經常使用合理預見這一概念。"},{"english":"His bad behaviour rewards attention.","chinese":"他的惡劣行爲值得注意。"},{"english":"There are a few notable limitations to the above approach.","chinese":"上面這種方法中有幾個值得注意的侷限性。"},{"english":"Remarkably, the total lunar eclipse coincided with the date of the December Solstice.","chinese":"值得注意的是，這次月全食恰好發生在冬至日。"},{"english":"In addition to, the entertainment women by singing songs appeared largely was also a very important phenomenon.","chinese":"還值得注意的是詩歌中歌伎形象大量出現。"}],"related":[{"definition":["to be worth mentioning"],"pinyin":["zhi2 de5 yi1 ti2"],"word":"值得一提"},{"definition":["besides\/in addition\/moreover\/furthermore"],"pinyin":["ci3 wai4"],"word":"此外"},{"definition":["additional\/in addition\/besides\/separate\/other\/moreover\/furthermore"],"pinyin":["ling4 wai4"],"word":"另外"},{"definition":["next\/secondly"],"pinyin":["qi2 ci4"],"word":"其次"},{"definition":["before this\/before then\/previously"],"pinyin":["ci3 qian2"],"word":"此前"},{"definition":["aforementioned\/above-mentioned"],"pinyin":["shang4 shu4"],"word":"上述"},{"definition":["apart from this\/in addition to this"],"pinyin":["chu2 ci3 zhi1 wai4"],"word":"除此之外"},{"definition":["among\/in\/included among these"],"pinyin":["qi2 zhong1"],"word":"其中"},{"definition":["outside\/excluding"],"pinyin":["zhi1 wai4"],"word":"之外"},{"definition":["same\/equal\/equivalent"],"pinyin":["tong2 yang4"],"word":"同樣"},{"definition":["besides\/apart from (... also...)\/in addition to\/except (for)"],"pinyin":["chu2 le5"],"word":"除了"},{"definition":["from this, it can be seen that..."],"pinyin":["you2 ci3 ke3 jian4"],"word":"由此可見"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["to get rid of\/to remove\/to exclude\/to eliminate\/to wipe out\/to divide\/except\/not including"],"pinyin":["chu2"],"word":"除"},{"definition":["in fact\/in reality\/actually\/as a matter of fact\/de facto\/ipso facto"],"pinyin":["shi4 shi2 shang4"],"word":"事實上"},{"definition":["aim\/clear","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","really and truly","see 的士[di1 shi4]"],"pinyin":["de5","di1","di2","di4"],"word":"的"}]}