{"definition":["to feign\/to pretend"],"pinyin":["jia3 zhuang1"],"simplified":["假装"],"rank":13565.0,"normalized_rank":0.18979194940746852,"fraction":0.000004945721998082262,"cumulative_fraction":0.9525490541892536,"word":"假裝","characters":[{"definition":["fake\/false\/artificial\/to borrow\/if\/suppose","see 假掰[gei1 bai1]","vacation"],"pinyin":["gei1","jia3","jia4"],"word":"假"},{"definition":["adornment\/to adorn\/dress\/clothing\/costume (of an actor in a play)\/to play a role\/to pretend\/to install\/to fix\/to wrap (sth in a bag)\/to load\/to pack"],"pinyin":["zhuang1"],"word":"裝"}],"containing_words":[],"sentences":[{"english":"Tutti executed a fabulous fake faint, swooning cartoonishly right to the floor.","chinese":"圖蒂假裝暈倒，像卡通人物似的昏倒在地。"},{"english":"I just told him to pretend like I'd done a really bad fart.","chinese":"我就告訴他假裝我剛放了一個很醜的屁。"},{"english":"He deceived me by pretending to be a famous movie star.","chinese":"他假裝成電影明星，騙了我。"},{"english":"XuanZu pretends to zen to light the sea king, to test the courtiers faithfulness.","chinese":"宣祖假裝要禪位給光海君，以此試探臣子們的忠心。"},{"english":"I just went to an online marriage site and pretended Alice was human.","chinese":"我剛纔到網上婚姻的網站和假裝雅麗氏是人類。"},{"english":"Ann: Honestly, there are so many beggars who are pretended to cheat the passerby.","chinese":"老實說，很多乞丐都是假裝的，以此來騙路人的錢。"},{"english":"On stage, she bleeds from simulated stab wounds.","chinese":"在舞臺上，她假裝自己戳出一處傷口然後噴血。"},{"english":"You’re like a fake, ’’ she said, “faking being well.","chinese":"“你就像一個騙子，”她說，“假裝自己很好。"},{"english":"It would be idle to pretend the system is perfect.","chinese":"假裝系統完美無疵是徒勞的。"},{"english":"Pretending to offer help, so that he could find out what Malfoy's up to?","chinese":"假裝要幫忙，以便發現馬爾福在幹什麼？"},{"english":"Just pretend, ” I told them, and they did.","chinese":"只須假裝就行了，”我告訴他們，他們照做了。"},{"english":"His attendants pretended to pick up the long train at the back of his cloak.","chinese":"侍從們假裝拾起皇帝披風后那長長的後裾。"},{"english":"Lincoln was very surprised, but he pretended to be calm.","chinese":"林肯非常驚訝，但是他假裝鎮靜自若。"},{"english":"Jack asks the Palmers to pretend that the Senator was killed.","chinese":"傑克向帕默一家人請求，假裝帕默在爆炸中喪生了。"},{"english":"Pretending to understand what you actually did not may just bring yourself embarrassment or even disgrace.","chinese":"沒有聽懂而假裝聽懂，可能會讓你尷尬甚至丟醜。"},{"english":"He went to Madame Carp's shop and pretended to help Anneliese.","chinese":"他到了卡帕女士的商店，假裝來幫助安妮絲。"}],"related":[{"definition":["perhaps\/maybe"],"pinyin":["ye3 xu3"],"word":"也許"},{"definition":["sometimes\/now and then"],"pinyin":["you3 shi2"],"word":"有時"},{"definition":["actually\/in fact\/really"],"pinyin":["qi2 shi2"],"word":"其實"},{"definition":["this kind of\/so\/this way\/like this\/such"],"pinyin":["zhe4 yang4"],"word":"這樣"},{"definition":["counterpart\/other person involved\/opposite side\/other side\/receiving party"],"pinyin":["dui4 fang1"],"word":"對方"},{"definition":["to play a joke\/to make fun of\/to joke"],"pinyin":["kai1 wan2 xiao4"],"word":"開玩笑"},{"definition":["but\/yet\/however\/while\/to go back\/to decline\/to retreat\/nevertheless\/even though"],"pinyin":["que4"],"word":"卻"},{"definition":["occasionally\/once in a while\/sometimes"],"pinyin":["ou3 er3"],"word":"偶爾"},{"definition":["lit. that person\/fig. the person you have been looking for\/Mr Right\/the girl of one's dreams"],"pinyin":["na4 ge4 ren2"],"word":"那個人"},{"definition":["once\/already\/former\/previously\/ever\/(past tense marker used before verb or clause)"],"pinyin":["ceng2 jing1"],"word":"曾經"},{"definition":["to think (i.e. to take it to be true that ...) (Usually there is an implication that the notion is mistaken – except when expressing one's own current opinion.)"],"pinyin":["yi3 wei2"],"word":"以為"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不過"},{"definition":["don't tell me ...\/could it be that...?"],"pinyin":["nan2 dao4"],"word":"難道"},{"definition":["they\/them (for females)"],"pinyin":["ta1 men5"],"word":"她們"},{"definition":["to admit\/to concede\/to recognize\/recognition (diplomatic, artistic etc)\/to acknowledge"],"pinyin":["cheng2 ren4"],"word":"承認"},{"definition":["only\/merely\/nothing but\/no more than\/it's just that ..."],"pinyin":["zhi3 bu5 guo4"],"word":"只不過"}]}