{"definition":["partial\/biased\/prejudiced\/eccentric"],"pinyin":["pian1 xin1"],"simplified":["偏心"],"rank":35434.0,"normalized_rank":0.4957676325325647,"fraction":5.830346416865571e-7,"cumulative_fraction":0.9943063963733658,"word":"偏心","characters":[{"definition":["to lean\/to slant\/oblique\/prejudiced\/to deviate from average\/to stray from the intended line\/stubbornly\/contrary to expectations"],"pinyin":["pian1"],"word":"偏"},{"definition":["heart\/mind\/intention\/center\/core\/CL:顆|颗[ke1],個|个[ge4]"],"pinyin":["xin1"],"word":"心"}],"containing_words":[{"definition":["bias\/partiality\/to be partial"],"pinyin":["pian1 xin1 yan3"],"word":"偏心眼"},{"definition":["(math.) eccentricity"],"pinyin":["pian1 xin1 lu:4"],"word":"偏心率"},{"definition":["axis of eccentricity"],"pinyin":["pian1 xin1 ju3"],"word":"偏心矩"}],"sentences":[{"english":"Sometimes a lack of information can lead workers to misperceive that there's preferential treatment, says Mr. Reed.","chinese":"裏德說，有時候信息的缺乏會讓員工誤以爲老闆偏心。"},{"english":"Accentric block vibrating mechanism is applied to break the earth for pile sinking pipe to set down.","chinese":"採用偏心塊振動式機構，強迫振動土壤破裂下沉樁管。"},{"english":"Eccentricity and spiral angle have different effects on pressure.","chinese":"偏心率和螺旋角對油膜壓力有不同程度的影響。"},{"english":"Pump inlet pipe diameter changes when level, should choose eccentric different-diameter pipe.","chinese":"泵的水平入口管變徑時，應選用偏心異徑管。"},{"english":"Favouritism is certainly a controversial topic.","chinese":"偏心確實是一個備受爭議的話題。"},{"english":"The massage device is mainly composed of a micromotor, an eccentric wheel, etc.","chinese":"按摩裝置主要由微電機和偏心輪等構成。"},{"english":"V-TYPE eccentrically braced frame has well resistant-seismic behavior.","chinese":"型偏心支撐鋼框架具有很好的抗震性能。"},{"english":"The hand folder is easy to operate and adopts a ; ock structure for the eccentricity wheel.","chinese":"本手動折邊機採用偏心輪鎖緊結構，操作方便快速。"},{"english":"A robust repetitive controller for roll eccentricity compensation of cold mill is designed.","chinese":"設計了用於冷軋機的軋輥偏心補償的魯棒重複控制器。"},{"english":"This paper introduces some new developments concerning orbital eccentricity in stratigraphic and paleoclimatic studies.","chinese":"介紹了偏心率週期在地層和古氣候研究方面的新發展。"},{"english":"This pump design operates by means of an eccentric (an off-center section) on the engine camshaft.","chinese":"這種泵是由發動機凸輪軸上的偏心輪驅動。"},{"english":"Through a big eccentricity will result in a long cycle of this star system movement, the cycle is a finite value.","chinese":"即使繞轉偏心率越大，週期越長，也總會有個週期吧。"},{"english":"The vibration generated by the eccentric weights makes the engine to be balanced state.","chinese":"偏心重塊所產生的振動力使發動機獲得平衡的狀態。"},{"english":"The static steam force changes linearly with rotor offset in a moderate eccentricity range.","chinese":"在一定範圍內汽流力隨偏心量的改變而線性改變。"},{"english":"A vibration motor with a eccentric wheel is also installed in the soft rubber loop.","chinese":"在軟膠套內還裝有帶偏心輪的振動馬達。"},{"english":"The thermal stress of the circular region with an eccentric circular hole is then derived.","chinese":"求出了具有偏心圓孔的圓形平板的熱應力。"}],"related":[{"definition":["bias\/partiality\/to be partial"],"pinyin":["pian1 xin1 yan3"],"word":"偏心眼"},{"definition":["to favor a junior\/to show favoritism to some juniors"],"pinyin":["pian1 teng2"],"word":"偏疼"},{"definition":["to bare one shoulder\/(fig.) to side with\/to discriminate in favor of"],"pinyin":["pian1 tan3"],"word":"偏袒"},{"definition":["to favor\/to prefer\/to show favoritism"],"pinyin":["pian1 chong3"],"word":"偏寵"},{"definition":["lit. both the palm and the back of the hand are made of flesh (idiom)\/fig. to both be of equal importance\/to value both equally"],"pinyin":["shou3 xin1 shou3 bei4 dou1 shi4 rou4"],"word":"手心手背都是肉"},{"definition":["lit. to hold a bowl of water level (idiom)\/fig. to be impartial"],"pinyin":["yi1 wan3 shui3 duan1 ping2"],"word":"一碗水端平"},{"definition":["to love dearly"],"pinyin":["teng2 ai4"],"word":"疼愛"},{"definition":["(of a woman) to be fiercely protective of one's children"],"pinyin":["hu4 du2 zi5"],"word":"護犢子"},{"definition":["to defend sb (a relative, friend or oneself) despite knowing that that person is in the wrong"],"pinyin":["hu4 duan3"],"word":"護短"},{"definition":["one's own (child) (i.e. one's child by birth)\/biological (parents)\/birth (parents)"],"pinyin":["qin1 sheng1"],"word":"親生"},{"definition":["to spoil\/to pamper\/to dote on"],"pinyin":["ni4 ai4"],"word":"溺愛"},{"definition":["to complain\/to grumble (about)\/to reproach\/to blame"],"pinyin":["man2 yuan4"],"word":"埋怨"},{"definition":["to pamper\/to coddle\/to spoil"],"pinyin":["jiao1 guan4"],"word":"嬌慣"},{"definition":["stingy\/miserly\/narrow-minded\/petty"],"pinyin":["xiao3 qi4"],"word":"小氣"},{"definition":["to blame\/to rebuke"],"pinyin":["ze2 guai4"],"word":"責怪"},{"definition":["not improving\/backward\/below par"],"pinyin":["bu4 zhang3 jin4"],"word":"不長進"}]}