{"definition":["paralysis of one side of the body\/hemiplegia"],"pinyin":["pian1 tan1"],"simplified":["偏瘫"],"rank":33834.0,"normalized_rank":0.4733815566717502,"fraction":6.700373072962687e-7,"cumulative_fraction":0.9933045098786574,"word":"偏癱","characters":[{"definition":["to lean\/to slant\/oblique\/prejudiced\/to deviate from average\/to stray from the intended line\/stubbornly\/contrary to expectations"],"pinyin":["pian1"],"word":"偏"},{"definition":["paralyzed"],"pinyin":["tan1"],"word":"癱"}],"containing_words":[],"sentences":[{"english":"Object:To explore the methods of acupuncture and acupoint selection to increase the effect of head acupuncture on treatment of cerebral thrombosis hemiplegia.","chinese":"探討提高頭針治療腦血栓偏癱療效的針刺及取穴方法。"},{"english":"Cutaneous needle was used on the recessive side of spasm limbs of hemiplegia.","chinese":"梅花針輕釦偏癱肢體痙攣劣勢側。"},{"english":"The training of the athlete consiousness in the soccer technical training;","chinese":"目的探討偏癱實用訓練技術的有效性和可行性。"},{"english":"Spastic limb paralysis recovery is an important issue to be resolved.","chinese":"肢體痙攣是偏癱恢復中需要解決的重要問題。"},{"english":"ObjectiveTo observe the effect of multidisciplinary rehabilitation on prognosis of patients with stroke hemiplegia.","chinese":"目的觀察綜合康復治療對腦卒中偏癱患者預後的影響。"},{"english":"Three weeks later, his right hemiparesis worsened and motor aphasia developed.","chinese":"三星期以後右側偏癱惡化併發生運動性失語症。"},{"english":"The application of orthosis and self-help aids to hemiplegic upper extremity was summarized.","chinese":"對中風後偏癱上肢應用矯形器和自助具進行了綜述。"},{"english":"Hemiplegia occurred in 2 cases and oculomotor nerve palsy in 2 cases.","chinese":"術後2例不全偏癱，2例動眼神經麻痹，無死亡。"},{"english":"Paralysis of respiratory muscles often requires the use of mechanical ventilation.","chinese":"呼吸肌的偏癱無力常導致病患需要仰賴呼吸器。"},{"english":"Conclusion Rehabilitative training is beneficial to the recovery of function of hemiplegia patients.","chinese":"結論康復訓練有利於偏癱患者的功能恢復。"},{"english":"Objective To analyze the factors influencing acupuncture treatment of post-apoplectic hemiplegic omodynia.","chinese":"目的對針灸治療中風後偏癱肩痛的影響因素進行分析。"},{"english":"Objectives To observe the effect of rehabilitation position training of stroke - induced hemiplegia.","chinese":"目的觀察腦卒中偏癱患者進行程序化良姿位訓練療效。"},{"english":"Great attention should be paid to the evaluation and treatment of cognitive dysfunction in patients with serious hemiplegia.","chinese":"對於偏癱較重的患者應注意其認知功能的評估與治療。"},{"english":"Hemiplegia migraine is clinical and scarce, have send out gender and familial transmissibility two kinds.","chinese":"偏癱型偏頭痛臨牀少見，有散發性和家族遺傳性兩類。"},{"english":"Focal neurological features including hemiparesis, sensory loss, visual field deficits.","chinese":"局竈性神經表現，包括輕偏癱，感覺缺失，視野缺損。"},{"english":"ObjectiveTo observe the effect of acupuncture combined with rehabilitation training on hemiplegia patients with shoulder pain.","chinese":"目的觀察針刺配合康復訓練治療偏癱肩痛的療效。"}],"related":[]}