{"definition":["see 作主[zuo4 zhu3]"],"pinyin":["zuo4 zhu3"],"simplified":["做主"],"rank":16567.0,"normalized_rank":0.2317938242413219,"fraction":0.000003454998472568211,"cumulative_fraction":0.9649599783074172,"word":"做主","characters":[{"definition":["to do\/to make\/to produce\/to write\/to compose\/to act as\/to engage in\/to hold (a party)\/to be\/to become\/to function (in some capacity)\/to serve as\/to be used for\/to form (a bond or relationship)\/to pretend\/to feign\/to act a part\/to put on appearance"],"pinyin":["zuo4"],"word":"做"},{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"}],"containing_words":[],"sentences":[{"english":"When her husband was out she wore the trousers.","chinese":"當她丈夫不在時，她當家做主。"},{"english":"Don’t panic, I’m talking about just 15 minutes per day when your notebook reigns.","chinese":"別難過，我說的是每天用15分鐘讓筆記本做主。"},{"english":"The choice is yours, but be warned it could make you look a little girlish.","chinese":"你的選擇你做主，不過小心它讓你看起來有點女性化。"},{"english":"Throw in some Prosecco, and you may not even have to cook the second course.","chinese":"再加普羅塞克酒，你甚至都不用做主菜了。"},{"english":"I think I must study hard and get good grades and I maked it.","chinese":"我想我必須努力學習並取得好成績我做主。"},{"english":"She has grown up and can belong to herself.","chinese":"她已長大了，能自己做主了。"},{"english":"Finally the family, by leading from the financial sector formal debit pay blackmailers.","chinese":"最終由領導做主，正式從財務部門支款付給勒索者。"},{"english":"He completely dominates the family.","chinese":"這個家完全由他做主。"},{"english":"People always have the idea that men should wear the pants.","chinese":"人們一般覺得男人應該當家做主。"},{"english":"Creative freedom gives license to a player to do his own thing.","chinese":"自由度給了球員自做主張的許可。"},{"english":"Don't panic, I'm talking about just 15minutes per day when your notebook reigns.","chinese":"別難過，我說的是每天用15分鐘讓筆記本做主。"},{"english":"It was the age of wisdom, it was the age of foolishness.","chinese":"這是智慧做主的年代，也是愚蠢當家的年代。"},{"english":"Chinese finally wear the pants in 1949.","chinese":"1949年中國人民終於當家做主了。"},{"english":"Being your own boss is one of the attractions of owning your own business.","chinese":"擁有自己的企業，誘人處之一是自己當家做主。"},{"english":"Learning is fun, and this month the world is your oyster.","chinese":"學習是快樂的，這個月，整個世界都由你做主。"}],"related":[{"definition":["to decide\/to make decisions\/to take responsibility (for deciding)\/to be in charge\/to give sb justice"],"pinyin":["zuo4 zhu3"],"word":"作主"},{"definition":["to make a decision\/to make up one's mind"],"pinyin":["na2 zhu3 yi5"],"word":"拿主意"},{"definition":["to have the final say\/to be the one in charge"],"pinyin":["shuo1 le5 suan4"],"word":"說了算"},{"definition":["to get involved in\/to meddle\/interference"],"pinyin":["cha1 shou3"],"word":"插手"},{"definition":["to make a decision\/to determine"],"pinyin":["ding4 duo2"],"word":"定奪"},{"definition":["full powers\/total authority\/plenipotentiary powers"],"pinyin":["quan2 quan2"],"word":"全權"},{"definition":["lit. to go beyond the sacrificial altar and take over the kitchen (idiom); fig. to exceed one's place and meddle in other people's affairs\/to take matters into one's own hands"],"pinyin":["yue4 zu3 dai4 pao2"],"word":"越俎代庖"},{"definition":["to show an interest in\/to get involved with"],"pinyin":["guo4 wen4"],"word":"過問"},{"definition":["to do sth in place of sb else"],"pinyin":["dai4 lao2"],"word":"代勞"},{"definition":["to interfere\/to meddle\/interference"],"pinyin":["gan1 she4"],"word":"干涉"},{"definition":["to be in charge in one's own house (idiom)\/to be the master of one's own affairs"],"pinyin":["dang1 jia1 zuo4 zhu3"],"word":"當家作主"},{"definition":["to appear personally\/to step in\/to step forth\/to show up"],"pinyin":["chu1 mian4"],"word":"出面"},{"definition":["to think for oneself and act accordingly (idiom); to act on one's own initiative"],"pinyin":["zi4 zuo4 zhu3 zhang1"],"word":"自作主張"},{"definition":["to act arbitrarily regardless of the rules\/to mess with sth\/to make a hash of things\/to cause trouble"],"pinyin":["hu2 lai2"],"word":"胡來"},{"definition":["to make a decision\/resolution\/decisiveness\/resolute"],"pinyin":["jue2 duan4"],"word":"決斷"},{"definition":["to worry about"],"pinyin":["cao1 xin1"],"word":"操心"}]}