{"definition":["to put out\/to issue"],"pinyin":["zuo4 chu1"],"simplified":["做出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"做出","characters":[{"definition":["to do\/to make\/to produce\/to write\/to compose\/to act as\/to engage in\/to hold (a party)\/to be\/to become\/to function (in some capacity)\/to serve as\/to be used for\/to form (a bond or relationship)\/to pretend\/to feign\/to act a part\/to put on appearance"],"pinyin":["zuo4"],"word":"做"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"We are now in no way to make any further concession in price.","chinese":"我們應經無法再在價格方面做出讓步了。"},{"english":"It's much cheaper to anticipate rather than respond.","chinese":"因爲預先做出反應遠比事後補救便宜的多。"},{"english":"Boeing says it found problems in the process used to reach the decision.","chinese":"波音公司表示他在過去做出決定的過程中發現了問題。"},{"english":"It is suggested that the government should make efforts to set aside an appropriate fund for the vegetable basket program.","chinese":"人們建議政府應該做出努力，爲菜籃子工程撥出專款。"},{"english":"Still, Japan quickly suspended imports of American long-grain rice.","chinese":"日本立即做出反應，暫緩對美國長粒大米的進口。"},{"english":"The author firstly reviews the historical evolution of WTO secretariat.","chinese":"筆者首先從歷史的角度對祕書處做出了追根溯源。"},{"english":"Beveling can be done by using a coarse file or, preferably, a beveling tool.","chinese":"坡口可以用粗齒銼做出，或者更好的，用去角刀。"},{"english":"In short, they might make better ethical decisions than people.","chinese":"簡言之，它們會比人類做出更恰當的道德判斷。"},{"english":"We need to fix it when we do start eating real food.","chinese":"我們需要在喫真正的食物時做出改變。"},{"english":"You may want to make changes in your home environment.","chinese":"本週也許你會希望在你的家庭環境中做出些改變。"},{"english":"Pull the top session of the dress out for the drapery effect both in the front and in the back;","chinese":"將裙子的前後壓在裏層的部分抽出，做出褶皺的效果。"},{"english":"Today that a panel of arbitrators has decided in favor of our company.","chinese":"今天仲裁團做出了有利於我們公司的裁決。"},{"english":"The horse answered to its rider's touch.","chinese":"馬對騎馬人的輕擊做出了反應。"},{"english":"What can we do to make those cheese spread lighter and creamier , also low in fat?","chinese":"怎樣纔可以做出低脂又美味的起司抹醬呢？"},{"english":"Which areas of the site are they visiting before they make a purchase?","chinese":"他們在做出購買之前訪問了站點的哪些區域？"},{"english":"In taking such steps offenders are seeking forgiveness.","chinese":"冒犯者以這種做出悔改的方式來尋求當事人的寬恕。"}],"related":[{"definition":["to put out\/to come up with\/to make (a choice, decision, proposal, response, comment etc)\/to issue (a permit, statement, explanation, apology, reassurance to the public etc)\/to draw (conclusion)\/to deliver (speech, judgment)\/to devise (explanation)\/to extract"],"pinyin":["zuo4 chu1"],"word":"作出"},{"definition":["to do\/to make\/to produce\/to write\/to compose\/to act as\/to engage in\/to hold (a party)\/to be\/to become\/to function (in some capacity)\/to serve as\/to be used for\/to form (a bond or relationship)\/to pretend\/to feign\/to act a part\/to put on appearance"],"pinyin":["zuo4"],"word":"做"},{"definition":["aim\/clear","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","really and truly","see 的士[di1 shi4]"],"pinyin":["de5","di1","di2","di4"],"word":"的"},{"definition":["to contribute\/to dedicate\/to devote\/contribution\/CL:個|个[ge4]"],"pinyin":["gong4 xian4"],"word":"貢獻"},{"definition":["to respond\/response"],"pinyin":["hui2 ying4"],"word":"回應"},{"definition":["to decide (to do something)\/to resolve\/decision\/CL:個|个[ge4],項|项[xiang4]\/certainly"],"pinyin":["jue2 ding4"],"word":"決定"},{"definition":["act\/action\/activity\/move\/movement"],"pinyin":["ju3 dong4"],"word":"舉動"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["variant of 出[chu1] (classifier for plays or chapters of classical novels)"],"pinyin":["chu1"],"word":"齣"},{"definition":["oneself\/one's own"],"pinyin":["zi4 ji3"],"word":"自己"},{"definition":["to select\/to pick\/choice\/option\/alternative"],"pinyin":["xuan3 ze2"],"word":"選擇"},{"definition":["to adjust\/adjustment\/revision\/CL:個|个[ge4]"],"pinyin":["tiao2 zheng3"],"word":"調整"},{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["strategic decision\/decision-making\/policy decision\/to determine policy"],"pinyin":["jue2 ce4"],"word":"決策"},{"definition":["to change\/to alter\/to transform"],"pinyin":["gai3 bian4"],"word":"改變"},{"definition":["to renounce\/to abandon\/to give up"],"pinyin":["fang4 qi4"],"word":"放棄"}]}