{"definition":["to cease trading (temporarily or permanently)\/to close down"],"pinyin":["ting2 ye4"],"simplified":["停业"],"rank":11243.0,"normalized_rank":0.15730415681446142,"fraction":0.000006818031040213404,"cumulative_fraction":0.9390337996893552,"word":"停業","characters":[{"definition":["to stop\/to halt\/to park (a car)"],"pinyin":["ting2"],"word":"停"},{"definition":["line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already","surname Ye"],"pinyin":["Ye4","ye4"],"word":"業"}],"containing_words":[],"sentences":[{"english":"Cameroon Ministry of Communications has also ordered three companies of informal long-distance passenger business for rectification.","chinese":"喀交通部還勒令三家非正規長途客運公司停業整頓。"},{"english":"The next day, the unit will be ordered to suspend business for reorganization.","chinese":"第二天，該單位將被勒令停業整頓業務。"},{"english":"A number of securities companies were closed or temporary closed for reorganizing because of irregular operations.","chinese":"部分證券公司因違規經營被撤銷或停業整頓。"},{"english":"The Going-Out-of-Business Sale is, perhaps, the sale where one can get the biggest discounts.","chinese":"“停業銷貨”可能是顧客可以獲得的最大的折扣。"},{"english":"The place or the document has been closed down on the spot, the case for further processing.","chinese":"該場所無證照，已被當場停業，案件在進一步處理中。"},{"english":"Police ordered the club to close its doors for 3 months and pay a fine of RMB20000 for the illegal practice, according to Xinhua.","chinese":"警方已責令該夜總會停業整頓3個月，罰款2萬元。"},{"english":"Closed for half a day for stocktaking.","chinese":"今日盤貨，停業半天。"},{"english":"Stores were closed, franchisees filed for bankruptcy and sales continued to fall.","chinese":"商店停業，加盟商申請破產，還有銷售量的持續下跌。"},{"english":"You will be out of business if you miss the green train.","chinese":"如果錯過了這列綠色列車，你必將停業。"},{"english":"This company has been stopped for an audit because of its messy management and tolerance of misconduct.","chinese":"這家公司管理混亂藏污納垢，已經停業查辦了。"},{"english":"The small factory on the street closed down for lacking of materials.","chinese":"街道上的那家小工廠由於沒有原料而停業了。"},{"english":"The shops and warehouses are all closed.","chinese":"商店和貨棧都停業了。"},{"english":"Storefronts for exporters that have gone out of business are boarded up.","chinese":"出口商的店面因爲停業已經用木板封住。"},{"english":"He decided to close out his book store.","chinese":"他決定將他的書店停業。"},{"english":"The so-called \"construction police\" have twice disabled it by demolishing the staircases.","chinese":"所謂的“建設警察”已經兩次拆除樓梯迫使它停業。"},{"english":"The pub has been ordered to suspend business.","chinese":"涉案歌舞廳已被責令停業。"}],"related":[{"definition":["to close down (temporarily or permanently)\/to go out of business"],"pinyin":["xie1 ye4"],"word":"歇業"},{"definition":["to tidy up\/to reorganize\/to consolidate\/to rectify"],"pinyin":["zheng3 dun4"],"word":"整頓"},{"definition":["to withdraw from\/to evacuate"],"pinyin":["che4 li2"],"word":"撤離"},{"definition":["executive\/manager\/transactor"],"pinyin":["jing1 ying2 zhe3"],"word":"經營者"},{"definition":["to go bankrupt\/to close down"],"pinyin":["dao3 bi4"],"word":"倒閉"},{"definition":["stallkeeper\/street peddler"],"pinyin":["tan1 shang1"],"word":"攤商"},{"definition":["to close\/to shut"],"pinyin":["guan1 bi4"],"word":"關閉"},{"definition":["to enter and garrison\/(fig.) to establish a presence in"],"pinyin":["jin4 zhu4"],"word":"進駐"},{"definition":["to leave a place where some event is taking place\/(of an actor) to exit\/(sports) to leave the field\/(of an audience) to leave"],"pinyin":["tui4 chang3"],"word":"退場"},{"definition":["to ask sb to resign from a post"],"pinyin":["qing3 ci2"],"word":"請辭"},{"definition":["to stop classes\/to close (of school)"],"pinyin":["ting2 ke4"],"word":"停課"},{"definition":["merchant\/trader\/businessman\/firm"],"pinyin":["shang1 hu4"],"word":"商戶"},{"definition":["a building used as a factory\/factory (building)\/CL:座[zuo4],棟|栋[dong4]"],"pinyin":["chang3 fang2"],"word":"廠房"},{"definition":["store\/a business"],"pinyin":["shang1 hao4"],"word":"商號"},{"definition":["to reopen"],"pinyin":["chong2 kai1"],"word":"重開"},{"definition":["to suspend\/time-out (e.g. in sports)\/stoppage\/pause (media player)"],"pinyin":["zan4 ting2"],"word":"暫停"}]}