{"definition":["side wall"],"pinyin":["ce4 bi4"],"simplified":["侧壁"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"側壁","characters":[{"definition":["lean on one side","the side\/to incline towards\/to lean\/inclined\/lateral\/side"],"pinyin":["ce4","zhai1"],"word":"側"},{"definition":["wall\/rampart"],"pinyin":["bi4"],"word":"壁"}],"containing_words":[],"sentences":[{"english":"The incense wood is studded fixedly in the side wall and the bottom surface of the pocket respectively.","chinese":"所述的香木塊分別鑲嵌固定在袋體側壁和底面上。"},{"english":"The pair of sidewalls comprises part of the carcass ply structure.","chinese":"一對側壁包括部分胎體簾布層結構。"},{"english":"The side wall is formed by fixing decorative steel plates on a steel trunk bulkhead;","chinese":"其中，側壁通過彩飾鋼板固定在鋼圍壁上構成。"},{"english":"Up to 20 percent of the top airflow should bleed off down the sidewalls.","chinese":"高達20%的頂部氣流應由側壁向下流動。"},{"english":"The profile may be formed by including tapered sidewalls.","chinese":"該輪廓可以通過包括錐形側壁形成。"},{"english":"The ureter of kidney allograft, contained a \"J\" tube, was anastomosed with the left-top wall of bladder.","chinese":"供腎輸尿管內置“J”形管後與膀胱左頂側壁吻合。"},{"english":"The X-ray type is blue and has two walls.","chinese":"X射線掃描儀是藍色的，而且有兩個平面的側壁。"},{"english":"The displacement of the surrounding rock on the flank appears plug-style distribution, and the rate of the permanent deformation is high.","chinese":"側壁圍巖位移呈倒塞體形分佈，永久變形比例高。"},{"english":"Lightweight blown rubber sidewalls and perimeter lugs.","chinese":"輕吹橡膠側壁和周邊耳。"},{"english":"Remember, backgrounds should be flat with well defined sidewalls.","chinese":"請記住，背景應該是平坦的，有明確側壁。"},{"english":"These may be near the bottom, but sometimes alongside, the stairs.","chinese":"該按鈕一般是在底層，但有時候也在側壁臺階旁邊。"},{"english":"The medial wall of the maxillary sinus serves as a landmark for the lamina papyracea.","chinese":"上頜竇的內側壁可以做爲紙樣板的標記。"},{"english":"The refrigerator bottle rack is transparent box plastic, with anti-draft-angle wall.","chinese":"冰箱瓶架屬於透明盒類塑件，側壁具有反向拔模特徵。"},{"english":"But the side walls usually lacked callose.","chinese":"側壁通常不具胼胝質。"},{"english":"Classic toe box and sidewall trimming.","chinese":"經典腳趾盒和側壁微調。"},{"english":"The sidewall is built out of four main surfaces.","chinese":"側壁是建立了四個主要的表面。"}],"related":[]}