{"definition":["side chain (used in classifying amino acids)"],"pinyin":["ce4 lian4"],"simplified":["侧链"],"rank":67147.0,"normalized_rank":0.9394736473913226,"fraction":9.050612865439794e-9,"cumulative_fraction":0.9999799917225431,"word":"側鏈","characters":[{"definition":["lean on one side","the side\/to incline towards\/to lean\/inclined\/lateral\/side"],"pinyin":["ce4","zhai1"],"word":"側"},{"definition":["chain\/cable (unit of length: 100 fathoms, about 185 m)\/chain (unit of length: 66 feet, about 20 m)\/to chain\/to enchain"],"pinyin":["lian4"],"word":"鏈"}],"containing_words":[],"sentences":[{"english":"The chains might be side chains of proteoglycan.","chinese":"這種物質可能是蛋白多糖的側鏈。"},{"english":"The advances of side-chain polymeric liquid crystals as GLC stationary phases are described.","chinese":"介紹了側鏈高分子液晶作爲氣相色譜固定液的進展。"},{"english":"Oxidizing sidechain alkyl of benzene ring is one of the most important reactions in the organic synthesis.","chinese":"苯環側鏈氧化是有機合成反應中的重要反應類型之一。"},{"english":"Most of aromatic residues are exposed on the surface.","chinese":"側鏈芳香性氨基酸殘基大多數暴露在分子表面。"},{"english":"BCAA is sometimes used to refer to the having side-chains that are non-linear.","chinese":"支鏈氨基酸有時用來指非線性的側鏈。"},{"english":"These peaks correspond to side-chain cleavage of the ethyl and propyl groups respectively.","chinese":"這些峯分別相當於乙基和丙基的側鏈開裂。"},{"english":"The effects of the different side chains on the third-order nonlinear optical property have been studied.","chinese":"研究了不同側鏈對聚合物三階非線性性能的影響。"},{"english":"The development of molecular design of side-chain liquid crystalline polymers at home and abroad is briefly described in this paper.","chinese":"簡述了近幾年國內外側鏈液晶高分子的分子設計進展。"},{"english":"The side chain structure of the β-alkyl naphthalenes studied influences significantly their way of dehydrocyclization.","chinese":"烷基萘的烷基側鏈結構對脫氫環化反應有明顯的影響。"},{"english":"In this investigetion, NMR data also reveals the segmental motions along ester alkyl side-chain in samples.","chinese":"NMR參數還揭示了較長酯烷基側鏈鏈段運動情況。"}],"related":[]}