{"definition":["tax evasion"],"pinyin":["tou1 shui4"],"simplified":["偷税"],"rank":17976.0,"normalized_rank":0.2515075622962517,"fraction":0.0000029439308009245862,"cumulative_fraction":0.9694516274085992,"word":"偷稅","characters":[{"definition":["to steal\/to pilfer\/to snatch\/thief\/stealthily"],"pinyin":["tou1"],"word":"偷"},{"definition":["taxes\/duties"],"pinyin":["shui4"],"word":"稅"}],"containing_words":[],"sentences":[{"english":"One characteristic of Swiss law is that it distinguishes between tax evasion and tax fraud.","chinese":"瑞士法律的一個特點是，它與偷稅，騙稅區別。"},{"english":"The authorities need to prevent tax fraud.","chinese":"當局需要措施防止偷稅漏稅。"},{"english":"We should severely punish tax-dodging crime because it endangers the tax administration system seriously.","chinese":"偷稅犯罪嚴重危害稅收徵管秩序，應予以重點打擊。"},{"english":"Tax planning is different from tax avoidance and tax evasions.","chinese":"納稅籌劃不同於避稅和偷稅。"},{"english":"Therefore, it is necessary to carry out further researches about the improvement on the legislation of the crime of tax evasion.","chinese":"因此，有必要對偷稅罪的立法改進繼續深入研究。"},{"english":"There are some defects in China's law about the amount of tax dodging crime.","chinese":"我國偷稅罪數額的立法規定存在缺陷。"},{"english":"Chapter Three: The government's analysis to the anti-tax evasion.","chinese":"第三部分，政府反偷稅選擇分析。"},{"english":"And the standard for declaring someone guilty on the amount of tax evasion is too low, which lags behind the social development.","chinese":"偷稅罪數額的定罪標準過低，已不適應社會發展等等。"},{"english":"Tax evasion is also a crime.","chinese":"偷稅漏稅也是一種犯罪。"},{"english":"As tax season approaches this year, even more people may  resort to cheating.","chinese":"今年的報稅季節將近，以致更多的人會選擇偷稅漏稅。"},{"english":"It seems that some doctors doctor their accounts in order to avoid paying taxes.","chinese":"好象有些醫生爲了偷稅漏稅而篡改賬目。"},{"english":"Mr Papaconstantinou promises that “we will put people in jail for tax evasion”.","chinese":"帕帕康斯坦丁努承諾將“把偷稅漏稅的人送進監獄”。"},{"english":"Those who evade tax will be punished by the law.","chinese":"偷稅漏稅者將受到法律制裁。"},{"english":"Mr Papaconstantinou promises that \"we will put people in jail for tax evasion\".","chinese":"帕帕康斯坦丁努承諾將“把偷稅漏稅的人送進監獄”。"},{"english":"As tax season approaches this year, even more people may resort to cheating.","chinese":"今年的報稅季節將近，以致更多的人會選擇偷稅漏稅。"},{"english":"Perhaps China will also consider cracking down on tax evasion.","chinese":"也許中國還將考慮打擊偷稅漏稅的行爲。"}],"related":[]}