{"definition":["to poach"],"pinyin":["tou1 lie4"],"simplified":["偷猎"],"rank":43548.0,"normalized_rank":0.6092930197417207,"fraction":2.747298937541563e-7,"cumulative_fraction":0.9976475623683744,"word":"偷獵","characters":[{"definition":["to steal\/to pilfer\/to snatch\/thief\/stealthily"],"pinyin":["tou1"],"word":"偷"},{"definition":["hunting"],"pinyin":["lie4"],"word":"獵"}],"containing_words":[{"definition":["poacher"],"pinyin":["tou1 lie4 zhe3"],"word":"偷獵者"}],"sentences":[{"english":"That way, they wouldn’t have to worry about encountering poachers and other dangerous humans.","chinese":"這樣就不必擔心他們遭遇偷獵者和其他危險分子了。"},{"english":"The confrontation with poachers brought troubles.","chinese":"與偷獵者的對抗也帶來了麻煩。"},{"english":"Sometimes poachers are killed and occasionally scouts have been killed.","chinese":"有時是偷獵者被殺死，也有巡防隊員被害的情況發生。"},{"english":"Some species may not be able to sustain the pressure from such prevalent raids.","chinese":"一些物種無法承受這種猖撅的偷獵行爲帶來的壓力。"},{"english":"The WWF hopes to raise awareness and funds to stop thepoaching.","chinese":"WWF希望能夠增加警惕，還有組織偷獵的基金。"},{"english":"Reports the same month from Laos revealed the ongoing poaching of tiger.","chinese":"當月老撾報道稱，偷獵老虎的行徑仍沒有得到遏制。"},{"english":"Turtles caught in fishing nets were sold to poachers.","chinese":"海龜陷入漁網，被出售給偷獵者。"},{"english":"This was probably the work of a poacher.","chinese":"這很可能是一個偷獵者乾的。"},{"english":"Poaching on other's land is illegal.","chinese":"侵入他人地界偷獵是非法的。"},{"english":"The poaching of the elephants, Fay discovered, started in May.","chinese":"費伊發現，當地偷獵大象的活動是於5月份開始的。"},{"english":"To do this outside the law would be, well, poaching.","chinese":"在法律之外的行爲將被認爲是偷獵。"},{"english":"And actually, what Gelute and its colleague do so is the livelihood of poacher.","chinese":"而實際上，格魯特及其同僚原來做的是偷獵者的營生。"},{"english":"They poached red coral nearOgasawara archipelago, Tokyo.","chinese":"他們在小笠原羣島附近偷獵紅珊瑚。"},{"english":"The Heights were Heathcliff's land, and he was reproving the poacher.","chinese":"山莊是希刺克厲夫的土地，他在斥責着這個偷獵者。"},{"english":"Poaching and habitat destruction threaten African elephants throughout their range.","chinese":"偷獵和棲息地被破壞威脅着非洲象的生活範圍。"},{"english":"He thinks it is likely that much was seized from poaching.","chinese":"他認爲大部分象牙很可能是從偷獵者那裏沒收來的。"}],"related":[]}