{"definition":["Jeremy (name)"],"pinyin":["Jie2 li3 mi3"],"simplified":["杰里米"],"rank":52250.0,"normalized_rank":0.7310452898297259,"fraction":1.1313266081799743e-7,"cumulative_fraction":0.9992476332088654,"word":"傑里米","characters":[{"definition":["hero\/heroic\/outstanding person\/prominent\/distinguished"],"pinyin":["jie2"],"word":"傑"},{"definition":["Li (surname)","li, ancient measure of length, approx. 500 m\/neighborhood\/ancient administrative unit of 25 families\/(Tw) borough, administrative unit between the township 鎮|镇[zhen4] and neighborhood 鄰|邻[lin2] levels"],"pinyin":["Li3","li3"],"word":"里"},{"definition":["rice\/CL:粒[li4]\/meter (classifier)","surname Mi"],"pinyin":["Mi3","mi3"],"word":"米"}],"containing_words":[],"sentences":[{"english":"She thinks I'm going out with Jeremy but she's completely on the wrong tack .","chinese":"她認爲我準備同傑里米外出，但是她的想法完全錯了。"},{"english":"Mr Jeremy Fisher even had some Quotable Quotes which he had written down along the way.","chinese":"傑里米教師以至寫上了一些他一路所記的名言雋語。"},{"english":"Jeremy is remembered for his great sense of humour.","chinese":"人們不會忘記傑里米那絕妙的幽默感。"},{"english":"Jeremy used to have a large circle of friends, but now he likes being alone.","chinese":"傑里米以前交遊甚廣，但現在他喜歡獨處。"},{"english":"What are Michael Maker and Jeremy Short's jobs?","chinese":"邁克爾。貝克和傑里米。肖特是做什麼工作的？"},{"english":"Jeremy used to have a large circle of friends but now he likes being alone.","chinese":"傑里米以前交遊甚廣，但現在他喜歡獨處。"},{"english":"He gave me the feedback I'd been hoping for from Jeremy, \" she says.","chinese":"他給了我一直想從傑里米那裏得到的反饋”她說。"},{"english":"Company President Jeremy Faber established PC Recycler.","chinese":"麥嘉華公司總裁傑里米建立電腦回收商。"},{"english":"I did not realize that Jeremy had thrown the keys into the shrubbery.","chinese":"我不清楚傑里米已經將鑰匙扔進了灌木叢裏。"},{"english":"Jeremy never misses an opportunity to beat the drum for the Social Democrats.","chinese":"傑里米從不失去竭力支持社會民主黨人的機會。"},{"english":"Jeremy rubbed the wood with oil.","chinese":"傑里米用油漆刷木頭。"},{"english":"After a few months, Jeremitt was able to repair the Towani star cruiser.","chinese":"幾個月後，傑里米特修好了他們家的星際遊艇。"},{"english":"The fifth photo is of Jeremy and me.","chinese":"第五張是傑里米和我。"},{"english":"What was Jeremy Hampden asked to do by one of his friends recently?","chinese":"最近傑里米。漢普登的朋友們邀請他做什麼？"},{"english":"Jeremy Grantham is a highly successful investor.","chinese":"傑里米格蘭瑟姆是一個非常成功的投資者。"},{"english":"Jeremijenko is experimenting with retrofits of a building's upper two stories.","chinese":"傑里米金科正嘗試在建築最頂端的兩層裏配備新裝置。"}],"related":[]}