{"definition":["alternative (plan, arrangement, strategy etc)"],"pinyin":["bei4 xuan3"],"simplified":["备选"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"備選","characters":[{"definition":["to prepare\/get ready\/to provide or equip"],"pinyin":["bei4"],"word":"備"},{"definition":["to choose\/to pick\/to select\/to elect"],"pinyin":["xuan3"],"word":"選"}],"containing_words":[],"sentences":[{"english":"Four vaccine candidates should be at the same stage of testing.","chinese":"四個備選疫苗也應進入同樣的試驗期。"},{"english":"Knows about some alternatives to popular and standard tools.","chinese":"知道一些流行和標準工具的備選方案。"},{"english":"So what's the alternative to standalone spreadsheets?","chinese":"那麼單機版電子表格的備選方案是什麼？"},{"english":"Clothes hook is not furnished; available as optional accessory.","chinese":"不配置衣帽鉤，但可作爲備選附件選配。"},{"english":"To run the script, you have several alternatives.","chinese":"要運行腳本，您需有幾個備選方案。"},{"english":"so they don’t take inv space. but apparently you an only hold 10 you’re not using.","chinese":"他們不佔據背囊空位，但你只能攜帶10個備選。"},{"english":"Constructed of hardened materials with optional hard facing.","chinese":"有硬化材料構造而成，配置備選硬麪。"},{"english":"Certain alternative products have been very effective for many people.","chinese":"特定的備選藥物對許多患者效果顯著。"},{"english":"A short announcement on his website said the campaign was now getting underway.","chinese":"一份簡短的公告在他網站上稱備選活動正漸漸展開。"},{"english":"For vertical installations use optional elbows as shown below.","chinese":"對於垂直安裝，採用如下圖所示的備選彎頭。"},{"english":"The best advice Brady said is to devise a plan B.","chinese":"布拉迪給出的最好建議就是準備一套備選方案。"},{"english":"Should I include alternative solutions to the one I’m offering? (p.","chinese":"在提供方案的同時，是否應該提供一個備選方案？"},{"english":"Sometimes, plan B is pretty good.","chinese":"有時，備選方案也毫不遜色。"},{"english":"Goalkeeper Amelia was the third choice shot-stopper in Marcello Lippi's World Cup party.","chinese":"在裏皮的世界盃軍團中，阿梅利亞是三號備選門將。"},{"english":"And so we looked at some alternatives the other day.","chinese":"因此，幾天前我們關注了一些備選方案。"},{"english":"\"She can do as my alternative?\" Zhao asked the old stand in the door wearing.","chinese":"“她可以作爲我的備選嗎？”趙海站在房門問老戴。"}],"related":[]}