{"definition":["to induce labor\/to expedite childbirth"],"pinyin":["cui1 chan3"],"simplified":["催产"],"rank":54204.0,"normalized_rank":0.7583842849747457,"fraction":8.977624052008828e-8,"cumulative_fraction":0.9994452061900032,"word":"催產","characters":[{"definition":["to urge\/to press\/to prompt\/to rush sb\/to hasten sth\/to expedite"],"pinyin":["cui1"],"word":"催"},{"definition":["to give birth\/to reproduce\/to produce\/product\/resource\/estate\/property"],"pinyin":["chan3"],"word":"產"}],"containing_words":[],"sentences":[{"english":"They found that the more contact, the higher the oxytocin levels.","chinese":"他們發現，接觸越多，催產素越高。"},{"english":"The IV also allows for easier administration of Pitocin should labor need to be augmented.","chinese":"留置針還使得在臨盆中需要增加催產素時便於管理。"},{"english":"They plan to manufacture a dry powder containing the drug oxytocin.","chinese":"他們計劃生產含有藥物催產素乾粉。"},{"english":"Could oxytocin be the key?","chinese":"催產素是關鍵嗎？"},{"english":"When babies stay on a breast for too long, oxytocin production is disrupted.","chinese":"當嬰兒吮吸過久，後葉催產素的生成就會出現混亂。"},{"english":"This is where the vasopressin and oxytocin come in.","chinese":"抗利尿激素和催產素就是從這裏進入這個科學傳說的。"},{"english":"A. The uterine response to exogenous oxytocin administration is periodic uterine contractions.","chinese":"子宮對外源性催產素的反應是間歇性子宮收縮。"},{"english":"Vasopressin can also work to increase the levels of oxytocin.","chinese":"加壓素也可以提高催產素的水平。"},{"english":"Oxytocin is produced naturally in the bodies of humans and animals.","chinese":"催產素是人體和動物體內自然產生的一種激素。"},{"english":"Oxytocin is the hormone that induces feelings of affiliation and love.","chinese":"催產素是一種激發人類親密和愛情的荷爾蒙激素。"},{"english":"Suckling causes the release of oxytocin and prolactin in the mother.","chinese":"吮吸導致母親體內催產素和催乳素的釋放。"},{"english":"Objective To observe the effect of combination of misoprostol and oxytocin used in late gestation induced labor.","chinese":"目的米索前列醇合併催產素用於晚期妊娠引產的效果。"},{"english":"Injecting oxytocin immediately after childbirth effectively reduces the risk of bleeding.","chinese":"分娩後立即注射催產素有效地減小了出血的危險。"},{"english":"Oxytocin is a neurohormone.","chinese":"催產素是一種神經激素。"},{"english":"A pelvic examination should be performed before initiation of oxytocin infusion.","chinese":"開始進行催產素輸注前應進行骨盆檢查。"},{"english":"Oxytocin is a cardio-protective hormone.","chinese":"催產素是一種心臟保護激素。"}],"related":[]}