{"definition":["to induce labor\/to expedite childbirth"],"pinyin":["cui1 sheng1"],"simplified":["催生"],"rank":12021.0,"normalized_rank":0.1681893862017825,"fraction":0.0000060950038543662535,"cumulative_fraction":0.9440486588811836,"word":"催生","characters":[{"definition":["to urge\/to press\/to prompt\/to rush sb\/to hasten sth\/to expedite"],"pinyin":["cui1"],"word":"催"},{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"}],"containing_words":[{"definition":["midwife who induces labor"],"pinyin":["cui1 sheng1 po2"],"word":"催生婆"},{"definition":["oxytocin"],"pinyin":["cui1 sheng1 su4"],"word":"催生素"}],"sentences":[{"english":"Idless is the sail of self-pity and depression.","chinese":"懶惰是催生消沉和自憐自哀的土壤。"},{"english":"Structural linguistics gave rise to Levi-Strauss's structural anthropology.","chinese":"結構語言學催生了施特勞斯的結構人類學。"},{"english":"So what happens is that a lot of these programs have come to fruition because they are student-driven.","chinese":"所以以學生爲導向，催生了許多這類課程。"},{"english":"The development of commodity economy has given birth to the popular of Christmas and other foreign-festival.","chinese":"商品經濟的發展，催生了聖誕節等洋節的流行。"},{"english":"Under all strives for to expedite the market competition to be very intense, constructs the ceramic profession not to be exceptional.","chinese":"全求化催生下市場競爭十分激烈，建陶行業也不例外。"},{"english":"The effects of oxytocin nasal spray are not limited to those with autism either.","chinese":"催生素鼻噴霧劑的效用不僅僅限於自閉症。"},{"english":"This produces a far right that likes nationalisation and dislikes the market.","chinese":"這催生了喜好國有化，厭惡市場的極右翼主義。"},{"english":"City culture is the rich soil for hastening new writings.","chinese":"城市文化是催生文學新樣式的肥沃土壤。"},{"english":"The introduction of western concept of myth in 1902 led to the birth of Chinese mythography .","chinese":"神話概念引入中國一個世紀，催生了中國神話學。"},{"english":"And it raises the prospect of alternative methods for wastewater treatment and bio-energy production.","chinese":"而且它還催生了污水處理和生物能生產的新方法。"},{"english":"The development of commodity economy has spawned the popularity of the foreign holidays, such as Christmas etc. …","chinese":"商品經濟的發展，催生了聖誕節等洋節的流行。"},{"english":"He says student interest is driving these new programs.","chinese":"他說學生的興趣催生了這些新課程。"},{"english":"All these issues have forced an implementation of service versioning governance.","chinese":"所有這些問題催生了服務版本管理治理的實現。"},{"english":"Undoubtedly America´s fast-moving crisis has bred a quicker response.","chinese":"毫無疑問，美國快速蔓延的危機催生了快速的反應。"},{"english":"Reform of college logistic socialization has brought about college logistic entities.","chinese":"我國高校後勤社會化的改革，催生了高校後勤實體。"},{"english":"This book helped to inspire so-called ordinary language philosophy.","chinese":"此著催生所謂日常語言哲學。"}],"related":[{"definition":["to be pregnant\/to produce offspring\/to nurture (a development, school of thought, artwork etc)\/fig. replete with (culture etc)"],"pinyin":["yun4 yu4"],"word":"孕育"},{"definition":["to emerge in large numbers\/to spring up\/to emerge prominently"],"pinyin":["yong3 xian4"],"word":"湧現"},{"definition":["to give rise to\/to derive\/derivative\/derivation"],"pinyin":["yan3 sheng1"],"word":"衍生"},{"definition":["catalysis\/to catalyze (a reaction)"],"pinyin":["cui1 hua4"],"word":"催化"},{"definition":["to be born"],"pinyin":["dan4 sheng1"],"word":"誕生"},{"definition":["to bring up\/to train\/to contribute to\/achievements (usually of young people)"],"pinyin":["zao4 jiu4"],"word":"造就"},{"definition":["to emerge to meet a historic destiny (idiom)\/to arise at an opportune time\/able to take advantage of an opportunity\/to rise to the occasion"],"pinyin":["ying4 yun4 er2 sheng1"],"word":"應運而生"},{"definition":["to rise\/to spring up\/to burgeon\/to be aroused\/to come into vogue"],"pinyin":["xing1 qi3"],"word":"興起"},{"definition":["to develop rapidly"],"pinyin":["xun4 su4 fa1 zhan3"],"word":"迅速發展"},{"definition":["(oil) blowout\/surge\/gush"],"pinyin":["jing3 pen1"],"word":"井噴"},{"definition":["(aerospace) to boost\/booster (rocket)\/(behavioral economics) to nudge"],"pinyin":["zhu4 tui1"],"word":"助推"},{"definition":["flourishing and still in the ascendant (idiom); rapidly expanding\/still growing strong\/on the up"],"pinyin":["fang1 xing1 wei4 ai4"],"word":"方興未艾"},{"definition":["more and more emerge\/innumerable succession\/breeding like flies (idiom)"],"pinyin":["ceng2 chu1 bu4 qiong2"],"word":"層出不窮"},{"definition":["inevitable outcome\/inescapable consequence"],"pinyin":["bi4 ran2 jie2 guo3"],"word":"必然結果"},{"definition":["wave\/tides"],"pinyin":["lang4 chao2"],"word":"浪潮"},{"definition":["to expand\/to strengthen"],"pinyin":["zhuang4 da4"],"word":"壯大"}]}