{"definition":["hypnotism\/hypnotherapy\/mesmerism"],"pinyin":["cui1 mian2 shu4"],"simplified":["催眠术"],"rank":44976.0,"normalized_rank":0.6292725924474977,"fraction":2.389653751729829e-7,"cumulative_fraction":0.998014006209668,"word":"催眠術","characters":[{"definition":["to urge\/to press\/to prompt\/to rush sb\/to hasten sth\/to expedite"],"pinyin":["cui1"],"word":"催"},{"definition":["to sleep\/to hibernate"],"pinyin":["mian2"],"word":"眠"},{"definition":["method\/technique","various genera of flowers of Asteracea family (daisies and chrysanthemums), including Atractylis lancea"],"pinyin":["shu4","zhu2"],"word":"術"}],"containing_words":[],"sentences":[{"english":"She saw a psychiatrist who used hypnotism to help her deal with her fear.","chinese":"她去看了一位用催眠術幫她克服恐懼感的精神科醫生。"},{"english":"The top five reasons hypnotists fail to achieve success.","chinese":"名列前茅五名原因催眠術師不達到成功。"},{"english":"Objective To investigate the application of the hypnosis in the medical practice of the sanatorium .","chinese":"目的在療養院醫療工作中開展催眠術後的應用與研究。"},{"english":"She hypnotize him into do thing against his own will.","chinese":"施催眠術讓他做出違反本意的事。"},{"english":"It used to absolutely mesmerize an audience.","chinese":"它過去常常絕對地給觀衆施行催眠術。"},{"english":"This correspondence is a strong sign that neutralinos are indeed dark matter.","chinese":"催眠術中最重要的因素是暗示感應性。"},{"english":"Surprisingly, the ability to hypnotize yourself can be learnt in a single session.","chinese":"出人意料的是，自我催眠術只要上一次課就可以學會。"},{"english":"Can zetas convince someone's soul or hypnotize him to do it?","chinese":"齊塔人能否說服某人的靈魂或者用催眠術使他這麼做？"},{"english":"You shouldn't mesmerize anyone who's drinking.","chinese":"你不可能用催眠術去催眠一個正在喝酒的人。"},{"english":"The most striking example of this is hypnotism.","chinese":"最明顯的例子就是催眠術。"},{"english":"What are some of the uses of hypnotism?","chinese":"催眠術有一些什麼樣的作用呢？"},{"english":"He performed hypnotism on this patient.","chinese":"他對這個病人採用了催眠術療法。"},{"english":"Hypnotism is banned by public schools in San Diego.","chinese":"催眠術在聖迭戈的公共學校是被禁止的。"},{"english":"Singer himself learned how to hypnotise while a student at Cambridge University.","chinese":"辛格自己在劍橋讀書時，就學會了催眠術。"},{"english":"Mary knows how to hypnotize people.","chinese":"瑪麗知道如何施催眠術。"},{"english":"The downside is that some people do not respond as strongly to hypnosis as others.","chinese":"不足之處是，催眠術對某些人不起作用。"}],"related":[]}