{"definition":["to pass to the next generation"],"pinyin":["chuan2 dai4"],"simplified":["传代"],"rank":55899.0,"normalized_rank":0.7820995340897962,"fraction":7.328076868468995e-8,"cumulative_fraction":0.9995828503920872,"word":"傳代","characters":[{"definition":["biography\/historical narrative\/commentaries\/relay station","to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)"],"pinyin":["chuan2","zhuan4"],"word":"傳"},{"definition":["to substitute\/to act on behalf of others\/to replace\/generation\/dynasty\/age\/period\/(historical) era\/(geological) eon"],"pinyin":["dai4"],"word":"代"}],"containing_words":[],"sentences":[{"english":"Objective To explore a method for primary culture and subculture of human atrial myocardial cells.","chinese":"目的探索人心房肌細胞的原代及傳代培養方法。"},{"english":"The cells were passaged by mechanical methods, frozen and thawed by general procedure.","chinese":"採用機械方法傳代，常規方法凍存和復甦。"},{"english":"Therefore, ANITA is a complex group originated from different lineages.","chinese":"因此ANITA是一個源於不同傳代線的複合羣。"},{"english":"Most of them had inheritable stability after several generation.","chinese":"幾次傳代培養後，大多數具有遺傳穩定性。"},{"english":"They were passaged till monolayer cells spread to more than 80% of the bottom of the culture bottle.","chinese":"至單層細胞鋪滿近培養瓶底的80%以上時進行傳代。"},{"english":"After a series of passages, the hereditary properties of the 4 fusion strains were found to be stable. Micechallenged.","chinese":"連續傳代證明4個融合株的雙親遺傳特性是穩定的。"},{"english":"The cells could be differentiated to form EBs again, and could be re-expanded from secondary EBs.","chinese":"細胞能反覆傳代，並可在體外再次分化和殘留。"},{"english":"Sheep Fibroblast cells derived from adult sheep ear were cultivated and passaged.","chinese":"用成年綿羊耳部皮膚細胞進行培養傳代。"},{"english":"Methods The fresh human hilar cholangiocarcinoma specimen was cultured.","chinese":"方法將人肝門部膽管癌標本進行細胞培養，傳代。"},{"english":"The subculture could not be established.","chinese":"傳代培養細胞不能增生。"},{"english":"Cells well grew after 20 times of passages.","chinese":"細胞傳代20次後，仍生長良好。"},{"english":"After subculture, confluence was occurred in 1-2 weeks.","chinese":"傳代培養細胞可在1～2周匯合成片。"}],"related":[]}