{"definition":["drive shaft"],"pinyin":["chuan2 dong4 zhou2"],"simplified":["传动轴"],"rank":40926.0,"normalized_rank":0.5726078379248107,"fraction":3.509302149760849e-7,"cumulative_fraction":0.9968295508982156,"word":"傳動軸","characters":[{"definition":["biography\/historical narrative\/commentaries\/relay station","to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)"],"pinyin":["chuan2","zhuan4"],"word":"傳"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["axis\/axle\/spool (for thread)\/roller (for scrolls)\/classifier for calligraphy rolls etc","see 壓軸戲|压轴戏[ya1 zhou4 xi4]\/Taiwan pr. [zhou2]"],"pinyin":["zhou2","zhou4"],"word":"軸"}],"containing_words":[],"sentences":[{"english":"Bearings allow the shaft to turn while permitting the housing to remain still.","chinese":"軸承允許傳動軸轉動的同時允許殼體保持靜止。"},{"english":"Going into the gearbox, universal joints connect the centre drive shaft to the internal bevel gears.","chinese":"進入變速箱，萬向節連接中心傳動軸到內部錐齒輪。"},{"english":"Double joint added to the front drive shaft and the shaft made longer.","chinese":"改裝內容包括雙十字軸和加長前傳動軸。"},{"english":"The material dialing disc can drive around the drive shaft.","chinese":"撥料盤可繞傳動軸傳動。"},{"english":"Improved design of the old instrument shaft, made success through one trial-manufacture.","chinese":"改進了儀表傳動軸原設計，一次試製成功。"},{"english":"The ECS drive shaft equalizes the speed between the drive shaft and the wheel.","chinese":"精英傳動軸均衡的速度之間的傳動軸和車輪。"},{"english":"The ECS drive shaft equalizes the speed between the drive shaft and the wheel.","chinese":"精英傳動軸均衡的速度之間的傳動軸和車輪。"},{"english":"The propeller shaft is a drive shaft to carry the power from the transmission to the rear-wheel axles.","chinese":"傳動軸是將動力從變速器傳送到後橋的驅動軸上。"},{"english":"Cardan shaft with clutch.","chinese":"傳動軸帶保護離合器。"},{"english":"Abnormal noise often occurs in motor vehicle transmission system especially in propeller shaft and final reduction gear.","chinese":"汽車傳動系特別是傳動軸與主減速器常產生異常響聲。"},{"english":"Disclosed is a grate cooler drive shaft device.","chinese":"篦冷機傳動軸裝置。"},{"english":"A lubricating oil pump shaft and a cam transmission shaft are respectively sheathed in series in two inner cavities.","chinese":"兩內腔內分別串套機油泵軸和凸輪傳動軸。"},{"english":"Wanxiang sells joint bearings, Midea sells electric fans, and so on.","chinese":"萬向銷售傳動軸承，美的銷售電風扇，等等。"},{"english":"The rotor is mounted on the drive shaft of the automobile via the flange plate of the rotor.","chinese":"所述轉子通過轉子法蘭盤安裝在汽車傳動軸上。"},{"english":"The reel is supported by expansion shaft is unwinded by a motorized wheel.","chinese":"該卷盤被擴張傳動軸所支持，通過一個動力輪被展開。"},{"english":"The design of drive shaft is rational in mill system of single - pinion drives.","chinese":"邊緣傳動式磨機系統的傳動軸的設計是合理的。"}],"related":[]}