{"definition":["transmission belt"],"pinyin":["chuan2 dong4 dai4"],"simplified":["传动带"],"rank":60479.0,"normalized_rank":0.8461796762413779,"fraction":3.853809349155009e-8,"cumulative_fraction":0.9998341205133796,"word":"傳動帶","characters":[{"definition":["biography\/historical narrative\/commentaries\/relay station","to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)"],"pinyin":["chuan2","zhuan4"],"word":"傳"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"帶"}],"containing_words":[],"sentences":[{"english":"The turning disc is connected by a drive belt to an electric motor.","chinese":"轉盤由一根傳動帶與電機相連。"},{"english":"Through changes the driving gear and the driven wheel transmission belt's contact radius carries on the speed change.","chinese":"通過改變驅動輪與從動輪傳動帶的接觸半徑進行變速。"},{"english":"Open Continuously Variable Transmission with plate check and found that serious belt slipping.","chinese":"打開無級變速傳動帶罩板檢查，發現傳動帶打滑嚴重。"},{"english":"Open Continuously Variable Transmission with plate check and found that serious belt slipping.","chinese":"打開無級變速傳動帶罩板檢查，發現傳動帶打滑嚴重。"},{"english":"Put your carry-on baggage on the belt, please.","chinese":"請您把隨身攜帶的行李放在傳動帶上。"},{"english":"The nonlinear vibration of an axially moving viscoelastic belt as typical moving continua was experimentally investigated.","chinese":"利用實驗方法研究粘彈性傳動帶的非線性振動。"},{"english":"It took firemen two hours to cut through the drive belt to free him.","chinese":"消防員花了兩個小時才把傳動帶切斷，把他救了出來。"},{"english":"The engine drove the rear wheel via a belt.","chinese":"發動機通過一條傳動帶拖動後輪。"},{"english":"Conveyor or transmission belts or belting, of vulcanized rubber.","chinese":"硫化橡膠制的傳動帶或輸送帶及帶料。"}],"related":[]}