{"definition":["transmission (i.e. gears)"],"pinyin":["chuan2 dong4 zhuang1 zhi4"],"simplified":["传动装置"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"傳動裝置","characters":[{"definition":["biography\/historical narrative\/commentaries\/relay station","to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)"],"pinyin":["chuan2","zhuan4"],"word":"傳"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["adornment\/to adorn\/dress\/clothing\/costume (of an actor in a play)\/to play a role\/to pretend\/to install\/to fix\/to wrap (sth in a bag)\/to load\/to pack"],"pinyin":["zhuang1"],"word":"裝"},{"definition":["to install\/to place\/to put\/to buy"],"pinyin":["zhi4"],"word":"置"}],"containing_words":[],"sentences":[{"english":"Base from steel plate and welded into a channel for supporting the shell and gear.","chinese":"底座由鋼板與槽鋼焊成，用於支撐殼體及傳動裝置。"},{"english":"Planetary drive with double trochoid and free rollers is a new type of drive.","chinese":"雙擺線滾子行星傳動是一種新型的傳動裝置。"},{"english":"The utility model discloses an electric hydraulic baler for bank notes, which relates to a gearing device.","chinese":"電動液壓鈔票壓捆裝置，涉及一種傳動裝置。"},{"english":"The most common chart drive makes one revolution in 24 hours.","chinese":"最普遍使用的記錄紙傳動裝置24小時旋轉1圈。"},{"english":"The valve actuating device is installed in another room.","chinese":"閥門傳動裝置安裝在另一艙室。"},{"english":"Execute test procedures to qualify mechanical components in the commodities of motor, gear and fan.","chinese":"對電機，傳動裝置或者風扇等料件進行測試。"},{"english":"The micro motion drive unit is a highly refined screw-driven hydraulic jack .","chinese":"微形傳動裝置是一個極精製的螺桿用液壓作動筒。"},{"english":"The utility model relates to a driving device with a screw rod.","chinese":"本實用新型涉及一種絲槓傳動裝置。"},{"english":"The liquid-viscous driving device is a new kind of stepless speed regulation gear.","chinese":"液體黏性傳動裝置是一種新型的無級調速傳動裝置。"},{"english":"The liquid-viscous driving device is a new kind of stepless speed regulation gear.","chinese":"液體黏性傳動裝置是一種新型的無級調速傳動裝置。"},{"english":"Closeups of the tank construction, gearing and servos.","chinese":"特寫的坦克建設，傳動裝置和伺服。"},{"english":"Evidence of leak on right main landing gear.","chinese":"右側着陸主傳動裝置有裂隙跡象。"},{"english":"Design of magnetic circuit is an important link.","chinese":"磁路設計是密封傳動裝置中的重要設計環節。"},{"english":"The new type three-ring reducer can be used as drive mechanism of pumping units.","chinese":"該新型減速器可用作抽油機的傳動裝置。"},{"english":"A special type vehicle's main transmission shaft of transmission equipments fractured during test-drive.","chinese":"某特種車輛在試車過程中傳動裝置主傳動軸斷裂失效。"},{"english":"How is the powertrains market for alternative fueled vehicles performing?","chinese":"替代燃料車動力傳動裝置市場業績？"}],"related":[]}