{"definition":["to send back"],"pinyin":["chuan2 hui2"],"simplified":["传回"],"rank":21775.0,"normalized_rank":0.3046605011682733,"fraction":0.0000020042728168143287,"cumulative_fraction":0.978720668202868,"word":"傳回","characters":[{"definition":["biography\/historical narrative\/commentaries\/relay station","to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)"],"pinyin":["chuan2","zhuan4"],"word":"傳"},{"definition":["to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)"],"pinyin":["hui2"],"word":"回"}],"containing_words":[],"sentences":[{"english":"If the user is not permitted to see any child nodes, an empty collection is returned.","chinese":"如果使用者不允許檢視任何子節點，則會傳回空集合。"},{"english":"Shows how to reduce the amount of data returned through a data service query.","chinese":"說明如何減少資料服務查詢所傳回的資料量。"},{"english":"Returns the default property for the specified component with a custom type descriptor.","chinese":"使用自訂型別描述項，傳回指定元件的預設屬性。"},{"english":"The sending application specifies response queues when the application sends its messages.","chinese":"傳回至迴應佇列的訊息是應用程式指定的。"},{"english":"Is there any information from Moon rover, what was seen on moon?","chinese":"月球車是否傳回任何信息，能看到月球上的什麼嗎？"},{"english":"It transmits about 120 gigabytes of information every week.","chinese":"它每週傳回大約120吉比特的信息。"},{"english":"Arrays that are returned by properties are not write-protected, even if the property is read-only.","chinese":"即使屬性是唯讀，所傳回的陣列不會是寫入保護。"},{"english":"Returns the largest integer less than or equal to the specified decimal number.","chinese":"傳回小於或等於指定的十進位數字的最大整數。"},{"english":"Returns the type or member identified by the specified metadata token.","chinese":"傳回指定之中繼資料語彙基元所識別的型別或成員。"},{"english":"Returns the encoding associated with the specified code page name.","chinese":"傳回與指定字碼頁名稱相關聯的編碼方式。"},{"english":"Returns the encoding associated with the specified code page identifier.","chinese":"傳回與指定字碼頁識別項相關聯的編碼方式。"},{"english":"The method returns immediately if a message already exists in the queue.","chinese":"如果佇列中已有訊息，方法會立即傳回。"},{"english":"Returns an enumerable collection of file system information in the current directory.","chinese":"傳回目前目錄中檔案系統資訊的可列舉集合。"},{"english":"Returns the value of a base expression taken to a specified power.","chinese":"傳回指定乘冪值的基底運算式值。"},{"english":"Returns a filtered collection of elements that contains the ancestors of every node in the source collection.","chinese":"傳回包含來源集合中每個節點祖系的已篩選項目集合。"},{"english":"Returns a string representing the path to the known local user configuration file.","chinese":"傳回字串，表示已知本機使用者組態檔的路徑。"}],"related":[{"definition":["important matter that must be kept secret (idiom); don't breathe a word of it to anyone!"],"pinyin":["hui4 mo4 ru2 shen1"],"word":"諱莫如深"},{"definition":["peripherals"],"pinyin":["wai4 she4"],"word":"外設"},{"definition":["relay station"],"pinyin":["zhong1 ji4 zhan4"],"word":"中繼站"},{"definition":["to be determined to win (idiom)"],"pinyin":["shi4 zai4 bi4 de2"],"word":"勢在必得"},{"definition":["printer (Tw)"],"pinyin":["yin4 biao3 ji1"],"word":"印表機"},{"definition":["vocal accompaniment in some traditional Chinese operas\/to speak in support of\/to chime in"],"pinyin":["bang1 qiang1"],"word":"幫腔"},{"definition":["Taichung or Taizhong county in central Taiwan"],"pinyin":["Tai2 zhong1 xian4"],"word":"臺中縣"},{"definition":["lit. to return the jade annulus to Zhao (idiom); fig. to return something intact to its rightful owner"],"pinyin":["wan2 bi4 gui1 Zhao4"],"word":"完璧歸趙"},{"definition":["to give a small demonstration of one's impressive skills (idiom)"],"pinyin":["xiao3 shi4 niu2 dao1"],"word":"小試牛刀"},{"definition":["to beat sb at their own game (idiom)"],"pinyin":["jiang1 ji4 jiu4 ji4"],"word":"將計就計"},{"definition":["seize every minute and second (idiom); not a minute to lose\/every moment counts"],"pinyin":["fen1 miao3 bi4 zheng1"],"word":"分秒必爭"},{"definition":["to have lingering fears\/trepidation remaining after a trauma (idiom)"],"pinyin":["xin1 you3 yu2 ji4"],"word":"心有餘悸"},{"definition":["code of conduct\/standard of conduct"],"pinyin":["xing2 wei2 zhun3 ze2"],"word":"行為準則"},{"definition":["an extra (in a movie)"],"pinyin":["lin2 shi2 yan3 yuan2"],"word":"臨時演員"},{"definition":["Zhou Ji (1781-1839), Qing writer and poet","help to the needy\/emergency relief\/charity\/to give to poorer relative\/(also 賙濟|赒济)"],"pinyin":["Zhou1 Ji4","zhou1 ji4"],"word":"周濟"},{"definition":["voice-over\/background narration"],"pinyin":["hua4 wai4 yin1"],"word":"畫外音"}]}