{"definition":["to pass on (to future generations)\/passed on (from former times)\/a continued tradition\/an inheritance"],"pinyin":["chuan2 cheng2"],"simplified":["传承"],"rank":7465.0,"normalized_rank":0.104445035188113,"fraction":0.000013354763193463865,"cumulative_fraction":0.9030367924683574,"word":"傳承","characters":[{"definition":["biography\/historical narrative\/commentaries\/relay station","to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)"],"pinyin":["chuan2","zhuan4"],"word":"傳"},{"definition":["surname Cheng\/Cheng (c. 2000 BC), third of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","to bear\/to carry\/to hold\/to continue\/to undertake\/to take charge\/owing to\/due to\/to receive"],"pinyin":["Cheng2","cheng2"],"word":"承"}],"containing_words":[],"sentences":[{"english":"The legacy of their disobedience is passed down to every generation.","chinese":"他們的忤逆一代代傳承下來。"},{"english":"Entire design embodies the culture Smriti but the originality is unconventional.","chinese":"整個設計表現文化地傳承而新奇別緻。"},{"english":"Hereby, the learners of Guzheng should make great efforts to push forward the art of Guzheng music.","chinese":"箏樂藝術在習箏人數的不斷擴增中得到傳承和發展。"},{"english":"In Menzoberranzan, families were traced solely through the mother.","chinese":"在魔索布萊，家族僅僅通過母系傳承。"},{"english":"Section V, inheriting, development and prospect of Inner Mongolia-Han melody.","chinese":"蒙漢調的傳承發展與展望。"},{"english":"The inheritor is the key of traditional Wushu heritage, and to protect the inheritor is an important means to protect traditional Wushu.","chinese":"傳承人是傳統武術傳承過程中的關鍵環節。"},{"english":"The inheritor is the key of traditional Wushu heritage, and to protect the inheritor is an important means to protect traditional Wushu.","chinese":"傳承人是傳統武術傳承過程中的關鍵環節。"},{"english":"Private entrepreneur intergenerational succession is one of the livelihood problems.","chinese":"民營企業家的代際傳承是一大民生問題。"},{"english":"This effective inheritance education of the birth consciousness in Zhan Li is a quite typical and successful instance.","chinese":"佔裏生育自覺的有效傳承就是一個極爲典型的範例。"},{"english":"Wu asked relevant departments to attach great significance to the research and inheritance of this ethnic culture.","chinese":"武吉海要求，高度重視巴代文化研究與傳承。"},{"english":"The Giver went to the wall speaker and clicked the switch to ON.","chinese":"記憶傳承者走到牆上的喇叭那裏把開關切到開的位置。"},{"english":"This point of Jia Yi has a unique historical resource.","chinese":"賈誼這種思想有其獨特的思想傳承。"},{"english":"He belongs to posterity as the instructor of future generations in the principles of liberty and freedom.","chinese":"他屬於作爲下一代人的自由理念的教育者的傳承人。"},{"english":"In the ML-descended functional languages, functions have type signatures.","chinese":"傳承自ML的函數語言中，函數是類型簽名。"},{"english":"\"Call me The Giver, \" he told Jonas.","chinese":"“叫我記憶傳承者”他告訴喬納斯。"},{"english":"Old people pass down tradition to the younger generation.","chinese":"老年人把傳統傳承給下一輩。"}],"related":[{"definition":["to extend\/to spread\/to popularize\/generalization\/promotion (of a product etc)"],"pinyin":["tui1 guang3"],"word":"推廣"},{"definition":["tradition\/traditional\/convention\/conventional\/CL:個|个[ge4]"],"pinyin":["chuan2 tong3"],"word":"傳統"},{"definition":["to continue\/to go on\/to last"],"pinyin":["yan2 xu4"],"word":"延續"},{"definition":["art"],"pinyin":["yi4 shu4"],"word":"藝術"},{"definition":["to develop\/to make full use of"],"pinyin":["fa1 yang2"],"word":"發揚"},{"definition":["skill\/art"],"pinyin":["ji4 yi4"],"word":"技藝"},{"definition":["to transmit\/to pass on to sb else\/(math.) transitive"],"pinyin":["chuan2 di4"],"word":"傳遞"},{"definition":["to enhance\/to promote\/to enrich"],"pinyin":["hong2 yang2"],"word":"弘揚"},{"definition":["to learn\/to study"],"pinyin":["xue2 xi2"],"word":"學習"},{"definition":["to inherit\/to succeed to (the throne etc)\/to carry on (a tradition etc)"],"pinyin":["ji4 cheng2"],"word":"繼承"},{"definition":["to cultivate\/to breed\/to foster\/to nurture\/to educate\/to groom (for a position)\/education\/fostering\/culture (biology)"],"pinyin":["pei2 yang3"],"word":"培養"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"發展"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引領"},{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"word":"實踐"},{"definition":["to teach\/teaching and learning\/education\/CL:門|门[men2],個|个[ge4]"],"pinyin":["jiao4 xue2"],"word":"教學"}]}