{"definition":["(chemistry) mass transfer (as observed in processes like evaporation, distillation and membrane filtration)"],"pinyin":["chuan2 zhi4"],"simplified":["传质"],"rank":65823.0,"normalized_rank":0.9209491696164984,"fraction":1.2992008790711965e-8,"cumulative_fraction":0.9999654203818108,"word":"傳質","characters":[{"definition":["biography\/historical narrative\/commentaries\/relay station","to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)"],"pinyin":["chuan2","zhuan4"],"word":"傳"},{"definition":["character\/nature\/quality\/plain\/to pawn\/pledge\/hostage\/to question\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"質"}],"containing_words":[],"sentences":[{"english":"Separation processes can essentially be termed as mass transfer processes.","chinese":"分離過程本質上可以稱之爲傳質過程。"},{"english":"The axial or radial distribution of mass transfer coefficients is uniformity.","chinese":"傳質係數在軸徑向上分佈均勻。"},{"english":"The transfer rate equation is experimentally obtained and the superficial transfer energy is calculated.","chinese":"並求得初始傳質速率方程，計算了表觀傳質反應熱。"},{"english":"The transfer rate equation is experimentally obtained and the superficial transfer energy is calculated.","chinese":"並求得初始傳質速率方程，計算了表觀傳質反應熱。"},{"english":"Drop diameter distribution and mass transfer coefficient are briefly introduced.","chinese":"對滴徑分佈和傳質係數也作了簡單介紹。"},{"english":"The utility model relates to an ultra-intense turbulent current mass transfer tower.","chinese":"本實用新型涉及一種超強湍流傳質塔。"},{"english":"The influences of hydrologic condition and air pressure on oxygen transfer ability were studied.","chinese":"研究了水力條件和曝氣壓強對氧傳質能力的影響。"},{"english":"Rotating Packed Bed (RPB) is a new type of mass transfer equipment.","chinese":"旋轉牀是一種新型的傳質設備。"},{"english":"The paper introduced that the packed column influences mass transfer when it is emulsifying.","chinese":"介紹了填料塔乳化操作時對傳質的影響。"},{"english":"The thickness of the ultra-intense turbulent current mass transfer field is controlled by the maze structure.","chinese":"並通過迷宮結構控制超強湍流傳質場的厚度。"},{"english":"Through analyzing on experimental result, the mechanism of permanent magnetic field on the molecular mass-transfer process in gas phase was discussed.","chinese":"對磁場影響氣體中分子傳質過程的機理進行了探討。"},{"english":"Mass transfer mathematic model of carbon dioxide removal by sterically hindered amine has established.","chinese":"建立了空間位阻胺脫碳的傳質數學模型。"},{"english":"Smaller diameter particles was indicated for enhancing gas-liquid mass transfer as compared to larger diameter particles.","chinese":"微粒的粒徑越小，對氣液傳質增強越大。"},{"english":"This ability rests largely on a proficiency in the science of mass transfer.","chinese":"這種能力主要得益於對傳質這門學科的熟練。"},{"english":"Mass transfer model was presented and prediction value and experimental value were compared.","chinese":"建立膜接觸器傳質模型，比較預測值與實驗值。"},{"english":"The higher transfer resistance and relative unstability are the shortcomings.","chinese":"其主要缺點是膜的傳質阻力較大和不穩定性等。"}],"related":[]}