{"definition":["transmission line"],"pinyin":["chuan2 shu1 xian4"],"simplified":["传输线"],"rank":51772.0,"normalized_rank":0.7243574496663076,"fraction":1.1897176589247473e-7,"cumulative_fraction":0.9991921653600968,"word":"傳輸線","characters":[{"definition":["biography\/historical narrative\/commentaries\/relay station","to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)"],"pinyin":["chuan2","zhuan4"],"word":"傳"},{"definition":["to lose\/to transport\/to donate\/to enter (a password)"],"pinyin":["shu1"],"word":"輸"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"}],"containing_words":[],"sentences":[{"english":"It is commenced from a transmission-line analogy.","chinese":"從傳輸線比擬出發。"},{"english":"Microwave transmission line model on a cylindrical wire grid is discussed.","chinese":"討論了金屬柵網的微波傳輸線模型。"},{"english":"The front end of the TEM horn antenna is a parallel plate transmission line.","chinese":"TEM喇叭天線的前端是平行板傳輸線。"},{"english":"In addition, the output pattern in coaxial transmission line is analyzed.","chinese":"另外，對同軸傳輸線內的輸出模式進行了分析。"},{"english":"In spectral domain through the coordinate rotation, two independent equivalent transmission lines are obtained.","chinese":"在譜域中通過座標旋轉，得到兩組獨立的等效傳輸線。"},{"english":"The voltage and current waveforms and spectrums at source and load end of a transmission line.","chinese":"傳輸線輸入端與負載端電壓及電流之脈波及頻譜。"},{"english":"The major theme of this thesis focuses on the methodology for the eye-diagram prediction of lossy transmission lines.","chinese":"本文主要是針對預測傳輸線接收端眼圖的方法作探討。"},{"english":"First one-dimensional PBG microwave transmission line is studied.","chinese":"首先研究了一維微波光子晶體傳輸線。"},{"english":"Finally, the 3nd Green's Function of the transmission line is obtained by means of the scattering sup…","chinese":"最後，用散射疊加法求得傳輸線的第三類格林函數。"},{"english":"Reflection is hardly observable for line transition time much less than pulse width.","chinese":"傳輸線傳播時間甚小於脈波寬情況下不易顯示反射。"},{"english":"Given a fixed trace width, three factors heavily influence pc-board-trace impedance decisions.","chinese":"固定的傳輸線寬度，有三個因素來決定傳輸阻抗。"},{"english":"A numerical method, Boundary Element Method, is introduced to calculate the characteristic impedance of a rectangle coaxial line with round center conductor.","chinese":"利用邊界元法計算了內圓外矩同軸傳輸線的特性阻抗。"},{"english":"More and more people interest in the transmission line analysis for its simplicity.","chinese":"傳輸線分析方法的簡便性，其引起了很多學者的興趣。"},{"english":"In the transceiver, the wideband impendence match circuit is used to avoid the reflections because of impedance mismatch.","chinese":"利用寬帶阻抗匹配電路解決信號的傳輸線反射問題。"},{"english":"This is the infamous single wire transmission line .","chinese":"這就是臭名昭著的單線傳輸線。"},{"english":"The equations of zero-sequence coupling transmission lines are derived from telegraph equations.","chinese":"運用電報方程推導出零序耦合傳輸線的輸線方程。"}],"related":[]}