{"definition":["(of news) to spread\/to get around"],"pinyin":["chuan2 kai1"],"simplified":["传开"],"rank":18113.0,"normalized_rank":0.253424370041834,"fraction":0.000002906560528447932,"cumulative_fraction":0.9698523805175109,"word":"傳開","characters":[{"definition":["biography\/historical narrative\/commentaries\/relay station","to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)"],"pinyin":["chuan2","zhuan4"],"word":"傳"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"}],"containing_words":[],"sentences":[{"english":"The rumors spread throughout the school very soon.","chinese":"謠言很快就在學校裏傳開了。"},{"english":"From then on the custom of worshiping the moon spread among the people.","chinese":"從那時起，敬拜月亮的風俗就在民間流傳開來。"},{"english":"Since then, the custom of Mid-Autumn Festival worship in private spread.","chinese":"從此，中秋節拜月的風俗在民間傳開了。"},{"english":"the secret was spread among the crowd.","chinese":"奧祕在人羣傍邊流傳開來。"},{"english":"It's been bruited abroad that she's going to get married.","chinese":"她要結婚的消息四處傳開了。"},{"english":"Word of Benson's demise spread quickly among her pursuers.","chinese":"本森辭世的消息迅速在她的追求者中傳開。"},{"english":"The news that living Buddha has come got abroad in this small village.","chinese":"活佛來了的消息在這個小村莊傳開了。"},{"english":"It spread through the Internet, sparking a number of South Korean public discontent.","chinese":"這件事經互聯網傳開，激起衆多韓國民衆不滿。"},{"english":"As news of Marco's riches got about, many Venetians started for China.","chinese":"當馬可致富的消息傳開，許多威尼斯人開始出發中國。"},{"english":"Word spread about his ramen, and the restaurant was always busy.","chinese":"關於他的拉麪的消息傳開了，餐館總是很繁忙。"},{"english":"I was not go to the dance, neither did Yin Ling.","chinese":"令我們欣慰的是，謠言沒有流傳開來。"},{"english":"The campaign soon spread to other parts of the country.","chinese":"獻花行動很快在其他地區傳開。"},{"english":"Gossip about this harelipped baby has been spreading.","chinese":"關於這個兔脣嬰兒的流言已經傳開了。"},{"english":"The story of that Homeric fight got all around town.","chinese":"那場荷馬式的大戰立刻在全城鎮裏傳開了。"},{"english":"Henceforth, Paise is that a \"bright city \" praise has spread over.","chinese":"此後，佩斯是一個“光明城市”的讚譽就傳開了。"},{"english":"The news that there is going to be a wonderful concert this evening has spread.","chinese":"今天晚上將有一場精彩的音樂會的消息傳開了。"}],"related":[]}