{"definition":["tendency\/inclination\/orientation"],"pinyin":["qing1 xiang4 xing4"],"simplified":["倾向性"],"rank":24392.0,"normalized_rank":0.34127572649811816,"fraction":0.0000015698433992732183,"cumulative_fraction":0.9833645532837328,"word":"傾向性","characters":[{"definition":["to overturn\/to collapse\/to lean\/to tend\/to incline\/to pour out"],"pinyin":["qing1"],"word":"傾"},{"definition":["surname Xiang","towards\/to face\/to turn towards\/direction\/to support\/to side with\/shortly before\/formerly\/always\/all along\/(suffix) suitable for ...\/oriented to ..."],"pinyin":["Xiang4","xiang4"],"word":"向"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"First, I must disclose that I'm biased. I love my caffeine.","chinese":"首先，我必須說明，我是有傾向性的，我喜歡咖啡。"},{"english":"Chapter IV reveals another important part in the thesis: the political dominance of news English.","chinese":"第四章是關於新聞英語的政治傾向性。"},{"english":"We're going to be reading it with a theoretical spin.","chinese":"我們將帶着一種理論的傾向性來閱讀本週的內容。"},{"english":"And the individuality tendentiousness is its main aspect.","chinese":"其中個性傾向性是其一個主要的方面。"},{"english":"If the research questions you ask are biased, so are the answers.","chinese":"如果你提出的研究問題帶有傾向性，答案亦不例外。"},{"english":"There is certainly some predisposition to wellbeing, based on the research I've looked at.","chinese":"當然有一些傾向性。"},{"english":"Peripheral lesions have no lobar predilection.","chinese":"周邊性病變沒有肺葉的發病傾向性。"},{"english":"The prediction of rockbursts proneness is the basis of preventing and controlling rockbursts disaster.","chinese":"巖爆傾向性預測是防治巖爆災害的基礎。"},{"english":"This has drawn out the news tendentious question.","chinese":"這就引出了新聞的傾向性問題。"},{"english":"Their hypothesis is that crowd size and partisanship impose pressures on referees.","chinese":"他們的假設是觀衆的規模和傾向性會給裁判施加壓力。"},{"english":"If he or she is wrong, an incorrect understanding of you and your predispositions develops.","chinese":"如果猜錯了，配偶就會誇張和誤解你和你傾向性。"},{"english":"The connotation of the tendentiousness of news is a widely controversial issue.","chinese":"新聞傾向性的內涵是一個頗有爭議的問題。"},{"english":"Such tendentious statements are likely to provoke strong opposition.","chinese":"這種有傾向性的說法可能招致強烈的反對。"},{"english":"Display the words and deeds are living with emotional and tendentious .","chinese":"顯示生活的言行都是帶有情緒化和傾向性的。"},{"english":"People who are easily bored typically score highly on so-called \"dispositional measures of sensation seeking\".","chinese":"無聊者通常是伴有“尋求心靈感覺的傾向性”的人。"},{"english":"But there is a tone to proclivity too.","chinese":"但proclivity本身又具有傾向性。"}],"related":[]}