{"definition":["to throw into"],"pinyin":["qing1 zhu4"],"simplified":["倾注"],"rank":16578.0,"normalized_rank":0.23194772851286502,"fraction":0.0000034495973003743186,"cumulative_fraction":0.9649979578905084,"word":"傾注","characters":[{"definition":["to overturn\/to collapse\/to lean\/to tend\/to incline\/to pour out"],"pinyin":["qing1"],"word":"傾"},{"definition":["to inject\/to pour into\/to concentrate\/to pay attention\/stake (gambling)\/classifier for sums of money\/variant of 註|注[zhu4]"],"pinyin":["zhu4"],"word":"注"}],"containing_words":[],"sentences":[{"english":"Suddenly the storm clouds thickened， winds came in gusts， and rain poured in torrents.","chinese":"忽然間陰雲密佈，狂風怒號，大雨傾注。"},{"english":"The Yangtze disgorges its waters into the East China Sea.","chinese":"長江將它的江水傾注到中國東海。"},{"english":"After her marriage, she couldn't devote herself totally to her music.","chinese":"她結婚之後無法全力傾注於音樂。"},{"english":"Love looks like water passing east, foolishly poured in vain.","chinese":"情像水向東逝去，癡心枉傾注。"},{"english":"The Changjiang River disgorges tons of waters and muds into the ocean.","chinese":"長江把大量泥水傾注入海。"},{"english":"or pour our sentiments into measuring cups.","chinese":"好比向量杯傾注我們的情感。"},{"english":"A mountain stream pours into the rivers.","chinese":"山澗向河裏傾注。"},{"english":"We've poured our full enthusiasm.","chinese":"我們傾注了滿腔的澎湃熱情。"},{"english":"The lavas that must have poured out onto the surface had no water dissolved in them.","chinese":"熔岩必須傾注到表面並且沒有水溶解在它們裏面。"},{"english":"What the traditional lines concentrate on is the variedly artistic styles.","chinese":"一貫傳承的線條，傾注的是多元的藝術格調。"},{"english":"And he promises to pour his love into our hearts.","chinese":"他應許要將他的愛傾注於我們的心裏。"},{"english":"This is the care and attention I used to put into my kitchen work.","chinese":"這也是我曾對廚房工作傾注的那種謹慎與專注。"},{"english":"She devotes all her affection to the youngest child.","chinese":"她把感情都傾注在最小的孩子身上。"},{"english":"Suddenly the storm clouds thickened, winds came in gusts, and rain poured in torrents.","chinese":"忽然，陰雲密佈，狂風怒吼，暴雨傾注。"},{"english":"She devotes all her love to her children.","chinese":"她把全部的愛都傾注在孩子身上。"},{"english":"The autumn leaves, miss, along with the river into the sea waves.","chinese":"秋葉，思念，都隨河水的柔波傾注大海。"}],"related":[]}