{"definition":["a downpour\/rain bucketing down"],"pinyin":["qing1 pen2"],"simplified":["倾盆"],"rank":40305.0,"normalized_rank":0.5639192422313322,"fraction":3.741406576471322e-7,"cumulative_fraction":0.9966044955851262,"word":"傾盆","characters":[{"definition":["to overturn\/to collapse\/to lean\/to tend\/to incline\/to pour out"],"pinyin":["qing1"],"word":"傾"},{"definition":["basin\/flower pot\/unit of volume equal to 12 斗[dou3] and 8 升[sheng1], approx 128 liters\/CL:個|个[ge4]"],"pinyin":["pen2"],"word":"盆"}],"containing_words":[{"definition":["a downpour\/rain bucketing down\/fig. to be overwhelmed (with work or things to study)"],"pinyin":["qing1 pen2 da4 yu3"],"word":"傾盆大雨"}],"sentences":[{"english":"The rain fell in torrents, insomuch that the soldiers were often ankle-deep in water.","chinese":"大雨傾盆，因而士兵們時時需涉水而行。"},{"english":"The pelting rain soaked his clothes.","chinese":"傾盆大雨淋透了他的衣服。"},{"english":"Festivities were undeterred by the heavy downpour.","chinese":"歡慶活動在傾盆大雨下如期舉行。"},{"english":"Even when it was raining heavily, he refused to carry an umbrella.","chinese":"即使大雨傾盆，他也總是拒絕帶傘。"},{"english":"Rain opens up and douses the fire.","chinese":"大雨傾盆，澆滅了大火。"},{"english":"There they waited while the heavy rains fell.","chinese":"大雨傾盆之際，他們就在那兒等待着。"},{"english":"Sometimes a mist seemed to be falling, and sometimes there was a sudden downpour of heavy, slanting rain.","chinese":"一忽兒像是下大霧，突然間又下起傾盆大雨。"},{"english":"He met a drench of rain.","chinese":"他遇上一場傾盆大雨。"},{"english":"A heavy downpour caused the wall of his house to crumble.","chinese":"一天，一場傾盆大雨沖壞了他家的圍牆。"},{"english":"A heavy rain sudden comes, so i have to take shelter at a porch.","chinese":"突然傾盆大雨，我只好在一個門廊處避一避。"},{"english":"We just started to lay out the picnic and the heavens opened.","chinese":"我們剛剛開始擺開時餐，天就下起傾盆大雨來了。"},{"english":"The southeast wind had not let up. Suddenly torrential rains came down, soaking everyone.","chinese":"忽然大雨傾盆，溼透衣甲。"},{"english":"A rare dry-season downpour produced the thundering runoff.","chinese":"一次非常乾旱季節的傾盆大雨產生了雷鳴般的急流。"},{"english":"In the middle of the picnic it started to rain cats and dogs, and everybody got soaked.","chinese":"野餐進行中，突然大雨傾盆，每個人身上都溼透了。"},{"english":"The downpour transformed a local machinery factory into a huge pond.","chinese":"傾盆大雨將當地一個機械廠變成一個巨大的魚塘。"},{"english":"and the rain is coming down, the lightning hits and there's thunder.","chinese":"大雨傾盆，電閃雷鳴。"}],"related":[]}