{"definition":["as far as possible\/to do one's utmost"],"pinyin":["jin3 ke3 neng2"],"simplified":["尽可能"],"rank":4771.0,"normalized_rank":0.06675247995746646,"fraction":0.000025722279696460486,"cumulative_fraction":0.8532535829880441,"word":"儘可能","characters":[{"definition":["to the greatest extent\/(when used before a noun of location) furthest or extreme\/to be within the limits of\/to give priority to"],"pinyin":["jin3"],"word":"儘"},{"definition":["can\/may\/able to\/to approve\/to permit\/to suit\/(particle used for emphasis) certainly\/very","see 可汗[ke4 han2]"],"pinyin":["ke3","ke4"],"word":"可"},{"definition":["can\/to be able to\/might possibly\/ability\/(physics) energy","surname Neng"],"pinyin":["Neng2","neng2"],"word":"能"}],"containing_words":[],"sentences":[{"english":"We have to recognize it and lessen the impact best we can, \" said Gore.","chinese":"我們必須認清這一點並儘可能減輕其影響，”戈爾說。"},{"english":"Keep Transact-SQL transactions (BEGIN TRANSACTION…COMMIT\/ROLLBACK) as short as possible within a stored procedure.","chinese":"儘可能的使用短小的事務在存儲過程裏面。"},{"english":"Research your topic and learn as much background information as you can.","chinese":"研究你的選題，儘可能多的收集背景資料。"},{"english":"Gather as much money as you can by clicking on the coins.","chinese":"儘可能多地點擊硬幣來撿錢。"},{"english":"Even so, he did what he could to greet his many friends throughout the world.","chinese":"但即使這樣，他仍儘可能地向世界各地的友人問安。"},{"english":"As difficult as it may be at times, try not to take negative feedback personally.","chinese":"回覆時儘可能不牽動個人情緒，雖然有時候很難做到。"},{"english":"Try your best to sidestep for sensitive issues like this.","chinese":"你應儘可能地迴避像這類敏感的問題。"},{"english":"With regard to improving the type, use the best male you can afford.","chinese":"爲了改良品相，你需要儘可能地用最好的公貓。"},{"english":"Says captain smollett , as cool as can be.","chinese":"斯莫列特船長說，儘可能地保持着冷靜。"},{"english":"He sweats himself to earn as much money as possible.","chinese":"他拼命幹活以掙得儘可能多的錢。"},{"english":"Our teachers encouraged us to find as many ways as possible to work out this mathematics problem. 34.","chinese":"老師鼓勵我們儘可能多找出兒種方法來解這道數學題。"},{"english":"Graphics should be described textually as far as possible.","chinese":"圖形應儘可能以文字表達。"},{"english":"Avoid the Gold Digger type at all costs.","chinese":"儘可能避開拜金類型的女孩。"},{"english":"Get organic and natural animal products as much as you can.","chinese":"儘可能地多食用有機天然畜禽產品。"},{"english":"The exception is articular cartilage and the subchondral bone, which should be preserved if at all possible.","chinese":"除了關節軟骨和軟骨下骨，這些應該儘可能保留。"},{"english":"She is good at teaching and tries her best to make every lesson lively and interesting.","chinese":"她教得很好而且儘可能使每節課都上得生動有趣。"}],"related":[]}