{"definition":["as early as possible"],"pinyin":["jin3 zao3"],"simplified":["尽早"],"rank":7766.0,"normalized_rank":0.10865641570942873,"fraction":0.000012554951775887338,"cumulative_fraction":0.906930424952053,"word":"儘早","characters":[{"definition":["to the greatest extent\/(when used before a noun of location) furthest or extreme\/to be within the limits of\/to give priority to"],"pinyin":["jin3"],"word":"儘"},{"definition":["early\/morning\/Good morning!\/long ago\/prematurely"],"pinyin":["zao3"],"word":"早"}],"containing_words":[],"sentences":[{"english":"What other types of things should co-founders be discussing in the early days of a startup and getting clarity on?","chinese":"還有哪些事情是創業公司應當儘早考慮的？"},{"english":"We also urge opposition parties to present their manifestoes to voters as early as possible.","chinese":"我們還敦促在野黨儘早發佈他們對選民的政治宣言。"},{"english":"The soil pollution in this area is very serious, we should deal with it as soon as possible.","chinese":"這個地區的土壤污染非常嚴重，我們應儘早治理。"},{"english":"If you get bingo on the way, tell me in plenty of time.","chinese":"如果路上車快沒油了，要儘早告訴我。"},{"english":"Please inform us of your travel plan at the earliest date so that we can make arangements.","chinese":"請儘早告知我們您的旅遊計劃，以便我們做出安排。"},{"english":"Please make up your mind \/ make your decision as early as possible \/ you can, or you’ll miss the good \/ golden chance \/ opportunity.","chinese":"請儘早做出決定，不然你會坐失良機。"},{"english":"So I want to see my great motherland to achieve peaceful reunification as soon as possible.","chinese":"我願意看到我們的偉大祖國能夠儘早實現和平統一。"},{"english":"Dark lines beneath the nail should be investigated as soon as possible.","chinese":"科學家應該儘早對指甲之下的暗線進行調查。"},{"english":"You should go to see the doctor as soon as possible.","chinese":"你應該儘早看醫生，別讓它發展成一個嚴重的疾病。"},{"english":"It would be much appreciated if you could send me the reply as soon as possible.","chinese":"如果貴司能儘早的寄給我，我將十分感激。"},{"english":"Identify and correct problems early.","chinese":"儘早的發現和更正問題。"},{"english":"Please advise your travel plan at earliest date so we make argot acidly.","chinese":"請儘早告知旅遊計劃，以便我們做出安排。"},{"english":"A decision could come as soon as this week.","chinese":"必須在這周儘早地作出決定。"},{"english":"It was recommended that the annual maximum value method is worth to accept by the design code.","chinese":"建議《室外排水設計規範》儘早改用年最大值法選樣。"},{"english":"Conclusion Ascertaining diagnosis and doing surgical operations as soon as possible is the key to cure trau…","chinese":"結論應該儘早明確診斷和手術是治癒本病的關鍵。"},{"english":"You early reply will be highly appreciated.","chinese":"你方若能儘早答覆我方將非常感激。"}],"related":[]}