{"definition":["to surpass"],"pinyin":["you1 yu2"],"simplified":["优于"],"rank":11644.0,"normalized_rank":0.16291466707707805,"fraction":0.0000064411168076558954,"cumulative_fraction":0.9416901595286016,"word":"優於","characters":[{"definition":["excellent\/superior"],"pinyin":["you1"],"word":"優"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[],"sentences":[{"english":"The results of the isotropic model are better than that of modified Cam-clay.","chinese":"對比計算結果說明各向同性模型優於修正劍橋模型。"},{"english":"The growth performance of red tilapia cultured in freshwater was superior to other tilapia species.","chinese":"星洲紅魚在淡水中養殖生長表現優於其他羅非魚品種。"},{"english":"The operation practice proves that the DDS desulfurizer is clearly better than the tannin extract.","chinese":"運行實踐證明，DDS脫硫效果明顯優於栲膠法。"},{"english":"The result showed that tank model surpassed conceptual model of linear reservoirs.","chinese":"研究結果顯示水筒模式整體模擬均優於線性水庫。"},{"english":"The cost-effective of the controlled group showed a remarkable advantage over FDC.","chinese":"對照組藥物的成本效果分析優於FDC製劑。"},{"english":"It's obviously that corrosion-resistance and brightness are much better than those of Zn plating.","chinese":"實驗結果表明，其耐蝕性和光亮度明顯優於鍍鋅層。"},{"english":"Inositol hexaphosphate was the main form of organic P in the organic manures and paddy soils.","chinese":"肌醇六磷酸磷對水稻的營養效果明顯優於無機磷。"},{"english":"Docetaxel has demonstrated superiority compared with best supportive care.","chinese":"多西他賽證明效果優於最好的支持療法。"},{"english":"The new and trial-manufactured silencer excelled the silencer of original machine on each item of performances.","chinese":"新試製的消聲器各項性能均優於原機消聲器。"},{"english":"Attapulgite clay presented better adsorption capability than bentonite.","chinese":"凹土的吸附脫色性能優於膨潤土。"},{"english":"Polyesters exhibit better non-yellowing properties than epoxies, but not as good as aliphatic urethanes.","chinese":"聚酯的耐黃性優於環氧樹脂，但弱於脂肪族聚氨酯。"},{"english":"And it was concluded that the renewable capability of cassava-based ethanol was better than that of gasoline.","chinese":"得到木薯乙醇燃料可再生性優於汽油的結論。"},{"english":"Therefore DMU is a strategy of product development far superior to existing methods.","chinese":"因此，DMU是一種遠優於現有方法的產品開發策略。"},{"english":"The wind erosion modulus in artificial pasture was less than that in cropland.","chinese":"人工草地的風蝕模數小於農田，生態效益優於農田。"},{"english":"Relative comparison use tallying surpasses manually tallies.","chinese":"相對比較使用吻合器優於手工吻合。"},{"english":"On some strains of bacteria, it has better effect in bacteriostasis than Kandfuxin.","chinese":"該液對多種細菌有抑制作用，其抑菌作用優於康復新。"}],"related":[]}