{"definition":["tuple"],"pinyin":["yuan2 zu3"],"simplified":["元组"],"rank":62956.0,"normalized_rank":0.8808361199334014,"fraction":2.4962174193390398e-8,"cumulative_fraction":0.9999121217605924,"word":"元組","characters":[{"definition":["currency unit (esp. Chinese yuan)\/first\/original\/primary\/fundamental\/constituent\/part\/era (of a reign)\/meta- (prefix)\/(math.) argument\/variable\/(Tw) (geology) eon","surname Yuan\/the Yuan or Mongol dynasty (1279-1368)"],"pinyin":["Yuan2","yuan2"],"word":"元"},{"definition":["surname Zu","to form\/to organize\/group\/team\/classifier for sets, series, groups of people, batteries"],"pinyin":["Zu3","zu3"],"word":"組"}],"containing_words":[{"definition":["byte (computing)"],"pinyin":["wei4 yuan2 zu3"],"word":"位元組"}],"sentences":[{"english":"Gets the offset within the method body, in bytes, of this exception-handling clause.","chinese":"取得這個例外處理子句的主體長度，以位元組爲單位。"},{"english":"This sets the maximum potential size of a tuple which we will store in the cache.","chinese":"這設置了將要存儲在緩存中的元組的最大可能大小。"},{"english":"A quad amplifier contains four identical circuit units.","chinese":"一臺四元組放大器包含四個恆等電路單元。"},{"english":"Tuples have many uses.","chinese":"元組有很多用途。"},{"english":"Tuples are a composite data type and are used to store collections of items.","chinese":"元組是複合的數據類型，用於存儲數據項的集合。"},{"english":"Subsequent processing then takes the form of manipulating and querying the triples in the store.","chinese":"然後後續處理就是操作和查詢存儲中的三元組。"},{"english":"When overridden in a derived class, decodes a sequence of bytes into a set of characters.","chinese":"在衍生類別中覆寫時，將位元組序列解碼成一組字元。"},{"english":"The first byte comes from a range of codes reserved for use as lead bytes.","chinese":"第一個位元組來自保留作前置位元組用途的編碼範圍。"},{"english":"The first byte comes from a range of codes reserved for use as lead bytes.","chinese":"第一個位元組來自保留作前置位元組用途的編碼範圍。"},{"english":"It's how the triples that I mentioned earlier are identified and interpreted.","chinese":"它提供前面提到的三元組的識別和解釋方法。"},{"english":"If the expression would evaluate to a tuple, it must be parenthesized.","chinese":"如果希望表達式推導出一個元組，就必須使用括號。"},{"english":"Insert new triples to an RDF graph.","chinese":"往RDF圖中插入新的三元組。"},{"english":"Returns the specified Boolean value as an array of bytes.","chinese":"將指定的資料轉換成位元組陣列。"},{"english":"Delete triples from an RDF graph.","chinese":"從RDF圖中刪除三元組。"},{"english":"It proposes the four-tuple index structure on which the structural join based.","chinese":"針對結構化連接，設計新的四元組索引結構。"},{"english":"A wide character is a 2-byte multilingual character code.","chinese":"寬字元是兩個位元組雙語字元碼。"}],"related":[]}