{"definition":["metacognition"],"pinyin":["yuan2 ren4 zhi1"],"simplified":["元认知"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"元認知","characters":[{"definition":["currency unit (esp. Chinese yuan)\/first\/original\/primary\/fundamental\/constituent\/part\/era (of a reign)\/meta- (prefix)\/(math.) argument\/variable\/(Tw) (geology) eon","surname Yuan\/the Yuan or Mongol dynasty (1279-1368)"],"pinyin":["Yuan2","yuan2"],"word":"元"},{"definition":["to recognize\/to know\/to admit"],"pinyin":["ren4"],"word":"認"},{"definition":["to know\/to be aware"],"pinyin":["zhi1"],"word":"知"}],"containing_words":[],"sentences":[{"english":"Reciprocal teaching is a model of inactive learning's application in reading comprehension.","chinese":"交互教學就是元認知缺陷觀應用於閱讀教學的典範。"},{"english":"Re-searches has shown metacognition has direct impact on reading ability .","chinese":"研究表明元認知水平的高低直接影響閱讀能力的高低。"},{"english":"There have been some studies exploring the effect of metacognitive-strategy-based instruction.","chinese":"同時也有一些研究是基於元認知策略與教學相結合。"},{"english":"What's more, even less empirical studies especially on metacognitive variables of senior middle school students have been conducted in China.","chinese":"而在中國特別針對高中生元認知的實證研究更是罕見。"},{"english":"The meta-cognitive strategies are of utmost importance to vocabulary learning.","chinese":"元認知策略對詞彙學習至關重要。"},{"english":"Metacognitive monitoring was most effective expectant variable for state-anxiety and trait-anxiety.","chinese":"元認知監控是特質焦慮和狀態焦慮最有效的預測變量。"},{"english":"The theory of self-monitoring developed from the research on metacognition.","chinese":"自我監控理論是在元認知研究的基礎上發展起來的。"},{"english":"Second, mathematical metacognition of Zang-Han junior and senior students and mathematical achievements are positively relevant.","chinese":"第二，藏漢中學生的數學元認知與數學成績成正相關。"},{"english":"Junior play an important role in forming the habits of metacognition.","chinese":"初中是爲學生打下元認知習慣的重要階段。"},{"english":"In short, reading is both an intellectual skill and also a meta-cognitive activity.","chinese":"簡言之，閱讀既是智力技能，也是一種元認知活動。"},{"english":"During this programe, metacognitive strategy fostering was integrated into classroom teaching.","chinese":"在實驗過程中，元認知策略被融合到課堂教學中。"},{"english":"In this case, it is urgent to cultivate students' meta-cognitive level.","chinese":"在這一情況下，就迫切需要培養學生的元認知水平。"},{"english":"Metacognition is more important to success than cognition.","chinese":"元認知力比認知力更有利於成功。"},{"english":"The present paper investigated the employment of metacognitive strategies of medical students.","chinese":"本文研究了醫學類學生元認知策略的使用情況。"},{"english":"Self-awareness corresponds with the ultimate goal of metacognition.","chinese":"元認知在終極目標上與自我意識是一致的。"}],"related":[]}