{"definition":["necessary and sufficient condition"],"pinyin":["chong1 yao4 tiao2 jian4"],"simplified":["充要条件"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"充要條件","characters":[{"definition":["to fill\/to satisfy\/to fulfill\/to act in place of\/substitute\/sufficient\/full"],"pinyin":["chong1"],"word":"充"},{"definition":["important\/vital\/to want\/to ask for\/will\/going to (as future auxiliary)\/may\/must\/(used in a comparison) must be\/probably\/if","to demand\/to request\/to coerce"],"pinyin":["yao1","yao4"],"word":"要"},{"definition":["strip\/item\/article\/clause (of law or treaty)\/classifier for long thin things (ribbon, river, road, trousers etc)"],"pinyin":["tiao2"],"word":"條"},{"definition":["item\/component\/classifier for events, things, clothes etc"],"pinyin":["jian4"],"word":"件"}],"containing_words":[],"sentences":[{"english":"Some sufficient and necessary conditions are obtained.","chinese":"爲此我們得到了一些充要條件。"},{"english":"In this paper, by using a model named symmetric cutting out, a necessary and sufficient condition for interval of search tending to zero is obtained.","chinese":"本文研究了優選法中一維搜索區間趨於零的充要條件。"},{"english":"Finally, a sufficient and necessary condition of the diagonalizable block compound matrices is proved.","chinese":"最後讓明瞭塊複合矩陣可對角化的一個充要條件。"},{"english":"It is can deep - goinyly and precisely research, and decision has shift invariant sets of dynamic system.","chinese":"本文得到了緊緻系統有轉移不變集的另一個充要條件。"},{"english":"A necessary and sufficient condition of a class of non-homogeneous quadratic estimate admissible was given .","chinese":"並得到了一類非齊次二次型估計可容許的充要條件。"},{"english":"Laws are the necessary and sufficient condition for the realization and guarantee of this liberty.","chinese":"而法律則構成了實現和保證這種自由的充要條件。"},{"english":"The sufficient and necessary condition of possession justice is the both justice of acquirement and transfer.","chinese":"持有正義的充要條件是獲取與轉讓同時是正義的。"},{"english":"The quadratic curve is the necessary and sufficient condition of the noncentral curve as well as the equation's representative form.","chinese":"二次曲線爲非中心曲線的充要條件及方程表示形式。"},{"english":"It is proved that a function is Riemann integrable if and only if it is continuous almost everywhere.","chinese":"證明了函數可積的充要條件是該函數幾乎處處連續。"}],"related":[]}