{"definition":["prerequisite\/precondition"],"pinyin":["xian1 jue2"],"simplified":["先决"],"rank":47618.0,"normalized_rank":0.6662376002126678,"fraction":1.842237650997584e-7,"cumulative_fraction":0.9985699163105706,"word":"先決","characters":[{"definition":["early\/prior\/former\/in advance\/first"],"pinyin":["xian1"],"word":"先"},{"definition":["to decide\/to determine\/to execute (sb)\/(of a dam etc) to breach or burst\/definitely\/certainly"],"pinyin":["jue2"],"word":"決"}],"containing_words":[{"definition":["precondition\/prerequisite"],"pinyin":["xian1 jue2 tiao2 jian4"],"word":"先決條件"},{"definition":["preliminary question\/priority problem\/issues requiring more immediate attention"],"pinyin":["xian1 jue2 wen4 ti2"],"word":"先決問題"}],"sentences":[{"english":"The fourth part introduced the precondition of solution to objective incapability of procedure of execution.","chinese":"第四部分介紹瞭解決客觀執行不能問題的先決條件。"},{"english":"He possessed that will and purpose which are the invariable forerunners of success.","chinese":"他擁有這種意願和目標，這正是成功不變的先決條件。"},{"english":"A command of information is the necessary prerequisite to the scientific consideration of any subject.","chinese":"掌握資料是科學地思考任何問題的必要的先決條件。"},{"english":"But his theory of preliminary question is open to question.","chinese":"莫里斯關於先決問題的理論是值得商榷的。"},{"english":"Consequently it is presupposed that the order of succession is accidental.","chinese":"因此，有先決條件的順序繼承是偶然的。"},{"english":"On the other hand, can you even get into China in the first place?","chinese":"但另一方面，先決問題是，你進得了中國嗎？"},{"english":"This will cause their prerequisites to be installed, too.","chinese":"這樣也將安裝這些開發工具的先決條件。"},{"english":"The derivation of generalized variational principles with preconditions by the use of the Lagrange multiplier method.","chinese":"應用拉氏乘子法推導有先決條件的廣義變分原理。"},{"english":"This integration is a prerequisite of teleradiology .","chinese":"這種結合是遠程放射學的先決條件。"},{"english":"This assumption then is a necessary prerequisite for our framework to function faultlessly .","chinese":"這個假設是我們的框架完美地運行其倆的先決條件。"},{"english":"These two things are stipulated for the talks ot resume.","chinese":"恢復會談所需的兩項先決條件。"},{"english":"Jurisdiction is a prerequisite question of cases on electronic commerce.","chinese":"管轄權是解決電子商務爭議案件的先決問題。"},{"english":"The dynamic basic position is a pre-requisite for good skiing.","chinese":"動態的基本位置是優美滑雪的先決條件。"},{"english":"The information on which they make their pre-judgement is likely to be shared information available to everyone.","chinese":"引起他們先決的信息更容易被他人分享。"},{"english":"We will clearly advise prospective Students on pre-requisites and requirements applicable to the various courses.","chinese":"院方將清楚地告知學生課程的入學先決條件。"},{"english":"If these prerequisites are met, no further operations are performed.","chinese":"如果滿足這些先決條件，則不執行進一步的操作。"}],"related":[]}