{"definition":["phosgene COCl2, a poisonous gas\/carbonyl chloride"],"pinyin":["guang1 qi4"],"simplified":["光气"],"rank":53277.0,"normalized_rank":0.7454143522728862,"fraction":1.0014065202728546e-7,"cumulative_fraction":0.9993571562808996,"word":"光氣","characters":[{"definition":["light\/ray\/CL:道[dao4]\/bright\/only\/merely\/to use up"],"pinyin":["guang1"],"word":"光"},{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"}],"containing_words":[{"definition":["diphosgene"],"pinyin":["shuang1 guang1 qi4"],"word":"雙光氣"}],"sentences":[{"english":"The Carbonic dichloride and the Trichloromethyl carbonate are two commonly used acylating reagent to product the Iminodibenzyl carbonyl chloride.","chinese":"目前常採用光氣和三光氣作爲酰化劑合成該產物。"},{"english":"The Carbonic dichloride and the Trichloromethyl carbonate are two commonly used acylating reagent to product the Iminodibenzyl carbonyl chloride.","chinese":"目前常採用光氣和三光氣作爲酰化劑合成該產物。"},{"english":"The key equipment in polycondensation phase of non-phosgene process was emphatically introduced.","chinese":"同時，介紹了非光氣法縮聚階段的關鍵設備。"},{"english":"The reaction kinetics of synthesizing aryl isocyanate by aryl amine and phosgene was studied.","chinese":"研究了芳胺和光氣反應生成異氰酸酯的反應動力學。"},{"english":"The p-chlorophenyl isocyanate is synthesised by carbonyl chloride and p-chloroaniline.","chinese":"採用光氣與對氯苯胺合成對氯苯基異氰酸酯。"},{"english":"Objective To study clinical manifestation and remedy of acute phosgene poisoning.","chinese":"目的探討急性光氣中毒的臨牀表現與救治。"},{"english":"Research and Application of Triphosgene Instead of Phosgene for Synthesizing Compounds;","chinese":"由光氣與乙硫醇合成氯甲酸乙硫醇酯。"},{"english":"Objective To search for a phosgene free method for preparing organic isocyanates with a high yield.","chinese":"目的探討異氰酸酯的無光氣製備方法。"},{"english":"The chemical properties of the solid phosgene make it have very widespread use.","chinese":"由於固體光氣的化學性質，使其有着極廣泛的應用。"},{"english":"Objective To explore the clinical features of acute phosgene poisoning.","chinese":"目的探索急性光氣中毒的臨牀特點。"},{"english":"Objective To explore the characteristics and treatment of group acute phosgene intoxication.","chinese":"目的旨在探討羣體性急性光氣中毒的特點與救治。"}],"related":[]}