{"definition":["optical wavelength"],"pinyin":["guang1 bo1 chang2"],"simplified":["光波长"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"光波長","characters":[{"definition":["light\/ray\/CL:道[dao4]\/bright\/only\/merely\/to use up"],"pinyin":["guang1"],"word":"光"},{"definition":["Poland\/Polish\/abbr. for 波蘭|波兰[Bo1 lan2]","wave\/ripple\/storm\/surge"],"pinyin":["Bo1","bo1"],"word":"波"},{"definition":["chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance","length\/long\/forever\/always\/constantly"],"pinyin":["chang2","zhang3"],"word":"長"}],"containing_words":[],"sentences":[{"english":"However, optical internetworking directly based optical wavelength has its intrinsic defects.","chinese":"然而，基於光波長通道的直接聯網有它特有的侷限性。"},{"english":"The technology of All Optical Wavelength Converter (AOWC) is one of the key technologies in DWDM system.","chinese":"全光波長變換技術是DWDM系統中的一項關鍵技術。"},{"english":"It also describes the related optical singal processing and optical wavelength changer technology.","chinese":"再說明其相關的光信號處理和光波長轉換技術。"},{"english":"Eventually, the electromagnetic photons are shifted to optical wavelengths.","chinese":"最終，電磁光子轉化成光波長。"},{"english":"All-optical wavelength conversion based on a nonlinear optical loop mirror (NOLM) is a promising method.","chinese":"非線性光纖環鏡是一種很有前途的全光波長變換裝置。"},{"english":"Fluorescent quantum efficiency has nothing to do with the wavelength of exciting light.","chinese":"熒光量子效率不隨激發光波長而變化。"},{"english":"That is because the grating constants are magnitude large than the optical wavelength.","chinese":"這是由於使用的光柵常數與光波長不可比擬。"},{"english":"The system structure and working principle of an all-optical wavelength router were introduced.","chinese":"介紹了一種全光波長路由器的系統結構和工作原理。"},{"english":"The realization of a kind of all-optical wavelength router that is controlled by electrom was described in this paper.","chinese":"文章描述了一種電控全光波長路由器的實現。"}],"related":[]}