{"definition":["cursor (computing)"],"pinyin":["guang1 biao1"],"simplified":["光标"],"rank":33189.0,"normalized_rank":0.4643571698403593,"fraction":7.098891994295761e-7,"cumulative_fraction":0.9928595094912668,"word":"光標","characters":[{"definition":["light\/ray\/CL:道[dao4]\/bright\/only\/merely\/to use up"],"pinyin":["guang1"],"word":"光"},{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"標"}],"containing_words":[],"sentences":[{"english":"The mouse moves the pointer or cursor on the computer screen.","chinese":"將光標放在要添加新圖框的位置，然後單擊鼠標。"},{"english":"While they are visible, they move with the cursor.","chinese":"可見時，這類工具提示可以隨光標移動。"},{"english":"\" text string to the active document at the current cursor location.","chinese":"文本字符串傳遞到活動文檔中光標當前所在的位置。"},{"english":"Use cursor hinting to indicate pliancy.","chinese":"運用光標暗示來表達受範性。"},{"english":"The temperature change is displayed by the deflection degree of cursor of galvanometer.","chinese":"通過靈敏電流計光標的偏轉角度顯示溫度的變化。"},{"english":"If you want to use the direct cursor, then disable the AutoCorrect tool.","chinese":"如果要使用直接定位光標，則需要禁用自動更正工具。"},{"english":"The current cursor location must be saved first.","chinese":"必須首先保存當前的光標位置。"},{"english":"Movable splitters should always advertise their pliancy with cursor hinting.","chinese":"可移動的分割線應該藉助光標暗示顯示其受範性。"},{"english":"When the cursor is hovering over a launcher, a pin icon will appear in the top right-hand corner.","chinese":"當光標指向啓動項時，右上角會出現一個大頭針圖標。"},{"english":"Used for \"cursor\" when it needs to be distinguished from \"line cursor\".","chinese":"文本光標，用來同“行光標”作區分。"},{"english":"Used for \"cursor\" when it needs to be distinguished from \"line cursor\".","chinese":"文本光標，用來同“行光標”作區分。"},{"english":"You can use this to navigate directly to the browser address bar of firefox.","chinese":"你可以使用該快捷鍵直接把光標轉到火狐的地址欄。"},{"english":"You can insert WordArt into a document at the current cursor location.","chinese":"可以在當前的光標位置將藝術字插入文檔。"},{"english":"And a cursor around the target tells us he did it correctly.","chinese":"通過光標和目標點我們能夠確定猴子做對了。"},{"english":"Would you like to customize your flick gestures?","chinese":"你想要自定義您的光標筆勢嗎？"},{"english":"According to commentary on the video, Chen stayed in the bucket for about30 minutes.","chinese":"根據視頻解說，陳光標在大垃圾桶內呆了有30分鐘。"}],"related":[]}