{"definition":["Hanukkah (Chanukah), 8 day Jewish holiday starting on the 25th day of Kislev (can occur from late Nov up to late Dec on Gregorian calendar)\/also called 哈努卡節|哈努卡节 and simply 哈努卡"],"pinyin":["Guang1 ming2 jie2"],"simplified":["光明节"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"光明節","characters":[{"definition":["light\/ray\/CL:道[dao4]\/bright\/only\/merely\/to use up"],"pinyin":["guang1"],"word":"光"},{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"},{"definition":["festival\/holiday\/node\/joint\/section\/segment\/part\/to economize\/to save\/to abridge\/moral integrity\/classifier for segments, e.g. lessons, train wagons, biblical verses\/CL:個|个[ge4]","see 節骨眼|节骨眼[jie1 gu5 yan3]"],"pinyin":["jie1","jie2"],"word":"節"}],"containing_words":[],"sentences":[{"english":"Jewish people celebrate the holiday of Hanukkah.","chinese":"猶太人過光明節。"},{"english":"Chandler: Well, I'll stay, but only because I wanna hear about Hanukkah .","chinese":"好，我留下，不過我想聽光明節的故事。"},{"english":"It was the first night of Chanukah and the night before Ellie's last final.","chinese":"那是光明節的第一個晚上，也是艾莉期末考試的前夜。"},{"english":"Hi, Jim. Do you know about Hanukkah ?","chinese":"嗨，吉姆。你知道光明節嗎？"},{"english":"\"Joy to The World\" includes songs for Christmas and Hanukkah.","chinese":"“歡樂世界”包括聖誕節和光明節的歌。"},{"english":"And that my friends, is the true meaning of Hanukkah.","chinese":"而我的朋友們，那就是光明節的真正意涵。"},{"english":"My niece gets a small gift each night of Hanukkah and of course spins the dreidel.","chinese":"我侄女在光明節的每個晚上都能得到禮物。"},{"english":"Can you tell me something about Hanukkah?","chinese":"給我講講光明節吧。"},{"english":"Hanukkah is an eight-day Jewish holiday in December.","chinese":"光明節是一個爲時八天的猶太教節日。"},{"english":"Part of the tradition of Hanukkah is eating a lot of fried food.","chinese":"光明節的一個傳統就是喫很多油炸的食品。"},{"english":"We wish you many blessings this Christmas or Hanukkah.","chinese":"我們希望你能更多地祝福此聖誕節或光明節。"},{"english":"By Eileen GoltzIt was the first night of Chanukah and the night before Ellie's last final.","chinese":"那是光明節的第一個晚上，也是艾莉期末考試的前夜。"},{"english":"Menorah, a special candleholder, is a symbol associated with the celebration of Hanukkah.","chinese":"七分枝聖燭臺是光明節慶典的一個標誌。"}],"related":[]}