{"definition":["When you enter a village, follow the local customs (idiom); do as the natives do\/When in Rome, do as the Romans do"],"pinyin":["ru4 xiang1 sui2 su2"],"simplified":["入乡随俗"],"rank":34348.0,"normalized_rank":0.4805730835420369,"fraction":6.425935134462254e-7,"cumulative_fraction":0.993642113358142,"word":"入鄉隨俗","characters":[{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"},{"definition":["country or countryside\/native place\/home village or town\/township (PRC administrative unit)"],"pinyin":["xiang1"],"word":"鄉"},{"definition":["surname Sui","to follow\/to comply with\/varying according to...\/to allow\/subsequently"],"pinyin":["Sui2","sui2"],"word":"隨"},{"definition":["custom\/convention\/popular\/common\/coarse\/vulgar\/secular"],"pinyin":["su2"],"word":"俗"}],"containing_words":[],"sentences":[{"english":"When in Rome, do as the Romans do and take the chance to practice your English skills.","chinese":"入鄉隨俗，同時利用這個機會來練練你的英語吧。"},{"english":"Follow the customs of the new country you are in, or keep your own customs?","chinese":"入鄉隨俗還是保留自己國家的習俗？"},{"english":"They assumed that immigrants would quickly adopt the mores of their host societies.","chinese":"他們認爲，移民會很快入鄉隨俗，向主流社會靠近。"},{"english":"The best way is to not comment, do as the Romans do, as soon as possible into the team.","chinese":"最好的做法就是不加評論，入鄉隨俗，儘快融入團隊。"},{"english":"Respect other cultures. Try to blend in as much as possible.","chinese":"尊重當地文化，要入鄉隨俗。"}],"related":[{"definition":["to talk nonsense\/nonsense!"],"pinyin":["luan4 jiang3"],"word":"亂講"},{"definition":["to become visible\/to appear\/to manifest one's true nature"],"pinyin":["xian4 xing2"],"word":"現形"},{"definition":["layman"],"pinyin":["men2 wai4 han4"],"word":"門外漢"},{"definition":["to murmur endearments (idiom)\/to get into a romantic relationship"],"pinyin":["tan2 qing2 shuo1 ai4"],"word":"談情說愛"},{"definition":["to take sth for granted"],"pinyin":["xiang3 dang1 ran2"],"word":"想當然"},{"definition":["having ample food and clothing (idiom); well fed and clothed"],"pinyin":["feng1 yi1 zu2 shi2"],"word":"豐衣足食"},{"definition":["to take one's seat according to the ticket number\/(fig.) to put (things or people) in their right place\/to take a general comment as a personal attack"],"pinyin":["dui4 hao4 ru4 zuo4"],"word":"對號入座"},{"definition":["not much to choose between the two\/tweedledum and tweedledee"],"pinyin":["ban4 jin1 ba1 liang3"],"word":"半斤八兩"},{"definition":["lit. you hoodwink me and I cheat you (idiom); fig. mutual deception\/each tries to outwit the other\/dog eats dog and devil take the hindmost"],"pinyin":["er3 yu2 wo3 zha4"],"word":"爾虞我詐"},{"definition":["general\/broad\/sweeping\/lacking in detail\/vague"],"pinyin":["long3 tong3"],"word":"籠統"},{"definition":["Jyutping, one of the many Cantonese romanization systems\/abbr. of 粵語拼音|粤语拼音[Yue4 yu3 Pin1 yin1]"],"pinyin":["Yue4 pin1"],"word":"粵拼"},{"definition":["lit. to order people by pointing the chin (idiom); to signal orders by facial gesture\/arrogant and bossy"],"pinyin":["yi2 zhi3 qi4 shi3"],"word":"頤指氣使"},{"definition":["unwilling"],"pinyin":["bu4 qing2 yuan4"],"word":"不情願"},{"definition":["lit. chicken speaking with duck\/fig. talking without communicating\/people not understanding each other"],"pinyin":["ji1 tong2 ya1 jiang3"],"word":"雞同鴨講"},{"definition":["to work as a good-time girl\/to prostitute oneself"],"pinyin":["mai4 xiao4"],"word":"賣笑"},{"definition":["cheerful and optimistic\/in a good mood\/gaily"],"pinyin":["gao1 gao1 xing4 xing4"],"word":"高高興興"}]}