{"definition":["inside story\/non-public information\/behind the scenes\/internal"],"pinyin":["nei4 mu4"],"simplified":["内幕"],"rank":7889.0,"normalized_rank":0.11037734529122886,"fraction":0.000012263288477417195,"cumulative_fraction":0.9084558759710868,"word":"內幕","characters":[{"definition":["inside\/inner\/internal\/within\/interior"],"pinyin":["nei4"],"word":"內"},{"definition":["curtain or screen\/canopy or tent\/headquarters of a general\/act (of a play)"],"pinyin":["mu4"],"word":"幕"}],"containing_words":[{"definition":["insider trading\/insider dealing"],"pinyin":["nei4 mu4 jiao1 yi4"],"word":"內幕交易"}],"sentences":[{"english":"Imagine, these lowdown Southern segregationists put the Northern Democrats down.","chinese":"設想，南方隔離主義的內幕束縛北方民主黨。"},{"english":"But it is still unclear what information was actually peddled.","chinese":"但是到底兜售什麼信息纔算內幕交易還仍不明瞭。"},{"english":"Give me the lowdown what's the secret to get a job around here?","chinese":"告訴我一些內幕，要怎麼才能得到這裏的工作？"},{"english":"Also available to subscribers is IGN insider premium content, ad-free.","chinese":"也可供用戶是布圖設計內幕優質內容，無廣告。"},{"english":"Does Lei Jun let authority after all have why inside?","chinese":"雷軍讓權到底有何內幕？"},{"english":"What individual investors access to the so-called insider information?","chinese":"散戶憑什麼獲得所謂的內幕信息？"},{"english":"Chapter 3 focuses on China's regulation of cross-border insider trading.","chinese":"第三章中國對跨境內幕交易的法律監管。"},{"english":"Price-sensitive information is defined as information that is prohibited from being used in insider dealing.","chinese":"股價敏感信息定義爲禁止用於內幕交易的信息。"},{"english":"Like Helen I was once blind and deaf to the truths of the Republican Party.","chinese":"像海倫聾啞一樣，我曾經對共和黨的內幕毫不知曉。"},{"english":"In the end, we discuss the implications of the economic analysis on legislation and regulation on insider tradings.","chinese":"在此基礎上，提出了中國內幕交易立法和監管的思路。"},{"english":"There's a lot of behind-the-scenes work reported on the diplomatic cables.","chinese":"外交電報中，敘述許多幕後折衝內幕。"},{"english":"Mr. Pickwick, who had been deeply investigating the interior of the pigeon-pie, readily assented.","chinese":"深深地鑽研着鴿子餅內幕的匹克威克先生欣然首肯了。"},{"english":"Which insiders are selling and buying chunks of stocks?","chinese":"內幕人士買進賣出的大宗股票是哪些？"},{"english":"The division also provides counsel to the Insider Dealing Tribunal.","chinese":"此外，該科也爲內幕交易審裁處提供律師。"},{"english":"She was very anxious to get the lowdown in her new job.","chinese":"她急於知道新工作的內幕細節。"},{"english":"A:How can they always manage to get inside stories?","chinese":"他們怎麼總能搞到內幕消息？"}],"related":[{"definition":["unspoken rules (usually ones that codify improper behaviors such as leveraging guanxi to get favorable treatment, or coercing employees for sexual favors)"],"pinyin":["qian2 gui1 ze2"],"word":"潛規則"},{"definition":["inside story\/inside information"],"pinyin":["nei4 qing2"],"word":"內情"},{"definition":["(coll.) awesome\/stunning\/electrifying\/breathtaking\/(originally Cantonese)\/also pr. [jin4 bao4]"],"pinyin":["jing4 bao4"],"word":"勁爆"},{"definition":["to flirt"],"pinyin":["tiao2 qing2"],"word":"調情"},{"definition":["to offer for sale\/to sell\/to sell out or betray"],"pinyin":["chu1 mai4"],"word":"出賣"},{"definition":["don't tell me ...\/could it be that...?"],"pinyin":["nan2 dao4"],"word":"難道"},{"definition":["the end\/to conclude","to leave (the stage, an exam room, the playing field etc)\/to take part in some activity\/to take an examination (in the imperial examination system)"],"pinyin":["xia4 chang3","xia4 chang5"],"word":"下場"},{"definition":["\"sensational headline writers\", people who write misleading titles in order to generate clicks from Internet users\/clickbait"],"pinyin":["biao1 ti2 dang3"],"word":"標題黨"},{"definition":["to talk drivel\/to make irresponsible remarks"],"pinyin":["luan4 shuo1"],"word":"亂說"},{"definition":["openly and without fear\/brazenly"],"pinyin":["ming2 mu4 zhang1 dan3"],"word":"明目張膽"},{"definition":["to repeat a lesson\/to learn by heart\/to endorse a check"],"pinyin":["bei4 shu1"],"word":"背書"},{"definition":["to denounce\/to condemn"],"pinyin":["sheng1 tao3"],"word":"聲討"},{"definition":["to provide for\/to keep (a mistress)"],"pinyin":["bao1 yang3"],"word":"包養"},{"definition":["startled\/to frighten\/scared out of one's skin"],"pinyin":["xia4 yi1 tiao4"],"word":"嚇一跳"},{"definition":["to start a rumor"],"pinyin":["zao4 yao2"],"word":"造謠"},{"definition":["person who writes articles - newspapers, magazines, blogs (informal)\/scribe\/copyist\/a talented writer of articles or of calligraphy"],"pinyin":["xie3 shou3"],"word":"寫手"}]}