{"definition":["(medicine) esotropia\/cross-eye"],"pinyin":["nei4 xie2 shi4"],"simplified":["内斜视"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"內斜視","characters":[{"definition":["inside\/inner\/internal\/within\/interior"],"pinyin":["nei4"],"word":"內"},{"definition":["inclined\/slanting\/oblique\/tilting"],"pinyin":["xie2"],"word":"斜"},{"definition":["to look at\/to regard\/to inspect"],"pinyin":["shi4"],"word":"視"}],"containing_words":[],"sentences":[{"english":"Objective To study the surgical method and effect of nerve paralysis esotropia.","chinese":"目的探討神經麻痹性內斜視的手術治療方法與效果。"},{"english":"Objective To discuss the long term curative effect of surgical treatment for concomitant esotropia of children.","chinese":"目的探討手術矯正小兒共同性內斜視的遠期療效。"},{"english":"Objective:To study the amount of surgery for concomitant esotropia in children.","chinese":"研究兒童共同性內斜視手術量。"},{"english":"Objective To investigate the surgical optimal timing and extent for partially accommodative esotropia in children.","chinese":"目的探討兒童部分調節性內斜視的手術時機，手術量。"},{"english":"Objective To study the correcting regulation of accommodative refractive esotropia by the systematic treatment.","chinese":"目的探討與調節有關的內斜視矯正規律。"},{"english":"ObjectivesThe study was designed to approach the surgical opportunity of partially accommodative esotropia in children.","chinese":"目的探討兒童部分調節性內斜視的手術時機。"},{"english":"Objective To investigate the effects of inferior oblique muscles weakening on V pattern esotropia.","chinese":"目的探討下斜肌減弱術對內斜視V徵治療效果。"},{"english":"Objective To observe the effect of muscle union in treatment of paralytic esotropia.","chinese":"目的觀察肌聯合術治療麻痹性內斜視的作用。"},{"english":"Occasionally, children who have crossed eyes may need to have bifocals to help control the crossing.","chinese":"偶爾有內斜視的孩子會需要雙光鏡來控制內斜。"},{"english":"Objective To study the clinical effect of the Tropicamide Eye Drops to treat the esotropia.","chinese":"目的探討採用雙星明治療共同性內斜視的臨牀效果。"},{"english":"To investigate the influence of concomitant esotropia on stereovision.","chinese":"探討共同性內斜視對立體視覺的影響。"}],"related":[]}