{"definition":["Mahmoud Ahmadinejad (1956-), Iranian fundamentalist politician, president of Iran 2005-2013\/abbr. for 艾哈邁迪內賈德|艾哈迈迪内贾德"],"pinyin":["Nei4 jia3 de2"],"simplified":["内贾德"],"rank":9306.0,"normalized_rank":0.13020301372546275,"fraction":0.000009350742866267927,"cumulative_fraction":0.9236114466133148,"word":"內賈德","characters":[{"definition":["inside\/inner\/internal\/within\/interior"],"pinyin":["nei4"],"word":"內"},{"definition":["merchant\/to buy","surname Jia"],"pinyin":["Jia3","gu3"],"word":"賈"},{"definition":["Germany\/German\/abbr. for 德國|德国[De2 guo2]","virtue\/goodness\/morality\/ethics\/kindness\/favor\/character\/kind"],"pinyin":["De2","de2"],"word":"德"}],"containing_words":[{"definition":["Ahmadinejad or Ahmadinezhad (Persian name)\/Mahmoud Ahmadinejad (1956-), Iranian fundamentalist politician, president of Iran 2005-2013"],"pinyin":["Ai4 ha1 mai4 di2 nei4 jia3 de2"],"word":"艾哈邁迪內賈德"}],"sentences":[{"english":"He is due to be formally inaugurated in front of parliament on Wednesday.","chinese":"艾哈邁迪內賈德星期三將在伊朗議會上正式就任總統。"},{"english":"Ahmedinejad will nominate a new opposition leader.","chinese":"內賈德將任命一個新的反對黨領袖。"},{"english":"The Ahmadinejad camp won the largest share of seats in the Majlis, or parliament.","chinese":"艾哈邁迪內賈德陣營在議會選舉中贏得了最多的席位。"},{"english":"Ahmadinejad, who was dressed in a dark suit and white open-collared shirt, had no comment on that subject.","chinese":"身着深色西裝和白色開領襯衫的內賈德對此未置評論。"},{"english":"Have you seen the reports that Iran's president, Mahmoud Ahmadinejad, is suffering from exhaustion?","chinese":"你有沒有聽說伊朗總統艾哈麥迪內賈德累病了？"},{"english":"He was then invited by the Saudi king to visit Mecca.","chinese":"內賈德是受到沙特國王的邀請前往麥加的。"},{"english":"That Hatami composes in reply Neijiade's is different to Westpolitik style and idea.","chinese":"哈塔米和內賈德的對西方政策的風格和理念是不同的。"},{"english":"Mr Ahmadinejad taunted the Americans for their heavy-handed approach to tackling terrorism.","chinese":"內賈德嘲笑美國人對付恐怖主義的辦法笨手笨腳。"},{"english":"You can refer to the speech of Mr. Ahmadinejad.","chinese":"你可以參考內賈德先生的講話。"},{"english":"President Ahmadinejad threatens to close Strait of Hormuz.","chinese":"內賈德總統威脅關閉霍爾木茲海峽。"},{"english":"A messianic vision such as Mr. Ahmadinejad's is rife in much of the Islamic world.","chinese":"內賈德式的以救世主自居的看法在伊斯蘭世界很普遍。"},{"english":"Ahmadinejad lies in front of the whole nation on state-run TV.","chinese":"內賈德在國營的電視臺公然對整個國家撒謊。"},{"english":"He will be sworn in before parliament two days later.","chinese":"兩天後內賈德將在議會前宣誓就職。"}],"related":[]}