{"definition":["both sides\/either side"],"pinyin":["liang3 pang2"],"simplified":["两旁"],"rank":12480.0,"normalized_rank":0.17461139171435364,"fraction":0.00000574334375125586,"cumulative_fraction":0.946763984193135,"word":"兩旁","characters":[{"definition":["two\/both\/some\/a few\/tael, unit of weight equal to 50 grams (modern) or 1⁄16 of a catty 斤[jin1] (old)"],"pinyin":["liang3"],"word":"兩"},{"definition":["one side\/other\/different\/lateral component of a Chinese character (such as 刂[dao1], 亻[ren2] etc)"],"pinyin":["pang2"],"word":"旁"}],"containing_words":[],"sentences":[{"english":"There are flowers between the trees along the road .","chinese":"沿路兩旁的樹木之間都種着花草。"},{"english":"Its pale rays fled out on either hand; beautiful but grim was the vision they disclosed.","chinese":"微弱的光線向兩旁流瀉而出，照出的景象美麗而陰森。"},{"english":"The quiet streets stretched out on either side like the arms of a skeleton.","chinese":"靜靜的街道從兩旁伸出來，像骷髏伸着枯臂。"},{"english":"High willows ranged along the highway.","chinese":"高大的柳樹排列在公路兩旁。"},{"english":"On either side the river lie Long fields of barley and of rye.","chinese":"綿長的大麥與黑麥田伸延在河岸兩旁。"},{"english":"The noise which mke by crs disturbs residents living on both side of the street ll dy nd ll night.","chinese":"它所產生的噪音使街道兩旁的住民日夜不得安寧。"},{"english":"Thousands of people lined the processional mute.","chinese":"成千上萬的人站在列隊行進路線的兩旁。"},{"english":"On both sides of the seat were armrests , with a lion standing beside each of them.","chinese":"寶座兩旁有扶手，靠近扶手有兩個獅子站立。"},{"english":"The poles are to be inserted into the rings so they will be on two sides of the altar when it is carried.","chinese":"這貢要穿在壇兩旁的環子內，用以擡壇。"},{"english":"Slide access notebook compartment is lined in faux fur for optimum protection.","chinese":"幻燈片訪問筆記本車廂兩旁是人造毛皮最佳的保護。"},{"english":"Erect poplars lined both sides of the road.","chinese":"道路兩旁筆直的白楊排成行。"},{"english":"Elliptically both sides armrest, more facilitating activity.","chinese":"省略兩旁扶手，更便於活動。"},{"english":"Quite an intimating hole not just long but also with big trees on both sides of the fairway.","chinese":"幾嚇人的球洞，碼數長之外，球道兩旁都系大樹。"},{"english":"Boulevard, tree-lined, paths on both sides of flowers numerous and leafy.","chinese":"大道兩旁綠樹成蔭，小道兩邊花繁葉茂。"},{"english":"There are trees beside the road.","chinese":"大道兩旁都種着樹。"},{"english":"The path is landscaped with willows along its two sides.","chinese":"小路兩旁柳樹成行，景色宜人。"}],"related":[]}