{"definition":["amphibian\/amphibious animals"],"pinyin":["liang3 qi1 dong4 wu4"],"simplified":["两栖动物"],"rank":46893.0,"normalized_rank":0.6560939095882361,"fraction":1.972157738904704e-7,"cumulative_fraction":0.9984316886359212,"word":"兩棲動物","characters":[{"definition":["two\/both\/some\/a few\/tael, unit of weight equal to 50 grams (modern) or 1⁄16 of a catty 斤[jin1] (old)"],"pinyin":["liang3"],"word":"兩"},{"definition":["to perch\/to rest (of birds)\/to dwell\/to live\/to stay"],"pinyin":["qi1"],"word":"棲"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"}],"containing_words":[],"sentences":[{"english":"The North American Amphibian Monitoring Program is the country’s largest frog-counting system.","chinese":"北美兩棲動物監測中心是美國最大的青蛙統計機構。"},{"english":"Frogs and newts are amphibians .","chinese":"青蛙和蠑螈都是兩棲動物。"},{"english":"It is a phosphorus-free calcium supplement for reptiles and amphibians.","chinese":"這是一個磷遊離鈣補充爬行動物和兩棲動物。"},{"english":"For the arboreal reptiles and amphibians, to create a three-dimensional habitat.","chinese":"爲樹棲爬行動物和兩棲動物，創建一個三維棲息地。"},{"english":"\"We're working on amphibians now, \" says Sinervo.","chinese":"我們現在開始研究兩棲動物。"},{"english":"One reson why the number of amphibians is declining is that their habitats have been destroyed.","chinese":"兩棲動物數量減少的原因之一是棲息地遭到破壞。"},{"english":"The sealed bottom is for setting making for amphibian.","chinese":"密封式底部，可供兩棲動物造景之用。"},{"english":"Fishes having paired fins resembling limbs and regarded as ancestral to amphibians.","chinese":"有一對類似於腳的鰭且被視爲是兩棲動物祖先的魚類。"},{"english":"Why does the speaker choose that amphibian as her representative of a public creature?","chinese":"詩人爲何選擇這個兩棲動物作爲公衆人物的代表？"},{"english":"Frogs, like many amphibians, also hibernate when it gets cold.","chinese":"青蛙，像許多兩棲動物，也冬眠當天氣變冷。"},{"english":"The living space of the amphibian is much larger than that of others.","chinese":"兩棲動物的生活空間要比單棲動物大得多。"}],"related":[]}