{"definition":["both ends (of a stick etc)\/two extremes"],"pinyin":["liang3 duan1"],"simplified":["两端"],"rank":15508.0,"normalized_rank":0.21697704028094525,"fraction":0.000003902857831780618,"cumulative_fraction":0.9610782999315856,"word":"兩端","characters":[{"definition":["two\/both\/some\/a few\/tael, unit of weight equal to 50 grams (modern) or 1⁄16 of a catty 斤[jin1] (old)"],"pinyin":["liang3"],"word":"兩"},{"definition":["end\/extremity\/item\/port\/to hold sth level with both hands\/to carry\/regular"],"pinyin":["duan1"],"word":"端"}],"containing_words":[{"definition":["(idiom) to hesitate\/to remain undecided"],"pinyin":["shou3 shu3 liang3 duan1"],"word":"首鼠兩端"}],"sentences":[{"english":"Forged module, \"H\"type section, two fist-end type, drum braking.","chinese":"鍛壓成型，工字形斷面，兩端拳式，鼓式制動器。"},{"english":"The girl tied the ends of the thread.","chinese":"這女孩把線的兩端結起來。"},{"english":"They are placed on both sides of an imaginary vertical line on the page which goes through the middle of the user’s screen.","chinese":"他們都被放置在用戶屏幕中間一條虛構垂直線的兩端。"},{"english":"Under the bridge, there lies a valley between steep mountains with a rapid stream flowing through it.","chinese":"兩端之間，原隔着險峻的山谷，湍急的溪流。"},{"english":"The curved glass lenses at each end of the telescope acted like prisms.","chinese":"望遠鏡兩端的曲面玻璃鏡頭起到了三棱鏡的作用。"},{"english":"A glass or quartz tube has tungsten electrodes sealed in each end .","chinese":"兩根鎢絲電極是封在玻璃管或石英管的兩端。"},{"english":"The rifts at both installation holes of the silicon carbide rod ends shall be blocked by asbest rope.","chinese":"硅碳棒兩端安裝孔處的隙縫應用石棉繩堵塞。"},{"english":"Double-loop elastic bands and put them either side of the hanger to keep clothes from falling down.","chinese":"在衣架兩端繞兩圈橡皮筋可以防止衣服滑落。"},{"english":"The two ends of the pipeline are connected with the radiator .","chinese":"管道的兩端與暖氣片相連接。"},{"english":"The powerful design of the front and rear ends highlight the on-road stance of C5 Airscape .","chinese":"在前後兩端強大的設計上突出的碳五鳥瞰道路的立場。"},{"english":"Clean corroded battery terminals with baking soda and water.","chinese":"小蘇打水可以清洗腐蝕電池的兩端。"},{"english":"Each of these rod bearings is attached to the ends of the kingpins.","chinese":"軸承每個這些杆是連接到主銷的兩端軸承。"},{"english":"The two ends of the wire are connected to a split-ring commutator.","chinese":"導線的兩端聯接到裂環整流器。"},{"english":"Two ends explores standard hewoulszheimerwouls disease. Under tank is specifriend optimized variin the cross-section longitudinwouls glefeel.","chinese":"兩端採用尺度封頭，罐體上面是優化的變截面縱梁。"},{"english":"Spindle-shaped; broadest near the middle and tapering toward both ends.","chinese":"形如紡錘狀的，中部最寬，兩端漸細。"},{"english":"A typical fluorescent lamp is a tube with metal electrodes at each end.","chinese":"日光燈通常是一根兩端裝有金屬電極的管子。"}],"related":[{"definition":["two sides\/both sides"],"pinyin":["liang3 ce4"],"word":"兩側"},{"definition":["symmetry\/symmetrical"],"pinyin":["dui4 chen4"],"word":"對稱"},{"definition":["both ends\/both parties to a deal"],"pinyin":["liang3 tou2"],"word":"兩頭"},{"definition":["both sides"],"pinyin":["liang3 mian4"],"word":"兩面"},{"definition":["longitudinal\/vertical"],"pinyin":["zong4 xiang4"],"word":"縱向"},{"definition":["to link\/to join\/link\/connection"],"pinyin":["xiang1 lian2"],"word":"相連"},{"definition":["round\/circular"],"pinyin":["yuan2 xing2"],"word":"圓形"},{"definition":["edge\/fringe\/verge\/brink\/periphery\/marginal\/borderline"],"pinyin":["bian1 yuan2"],"word":"邊緣"},{"definition":["accusation\/suit\/state\/condition\/strong\/great\/-shaped"],"pinyin":["zhuang4"],"word":"狀"},{"definition":["form\/shape\/CL:個|个[ge4]"],"pinyin":["xing2 zhuang4"],"word":"形狀"},{"definition":["roof\/topmost part\/top (of tree, wall etc)\/apex"],"pinyin":["ding3 bu4"],"word":"頂部"},{"definition":["horizontal\/orthogonal\/perpendicular\/lateral\/crosswise"],"pinyin":["heng2 xiang4"],"word":"橫向"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"則"},{"definition":["vein lines (in marble or fingerprint)\/grain (in wood etc)"],"pinyin":["wen2 li3"],"word":"紋理"},{"definition":["deformation\/to become deformed\/to change shape\/to morph"],"pinyin":["bian4 xing2"],"word":"變形"},{"definition":["length\/duration\/accident\/right and wrong\/good and bad\/long and short"],"pinyin":["chang2 duan3"],"word":"長短"}]}