{"definition":["both sides","two-phase (physics)"],"pinyin":["liang3 xiang1","liang3 xiang4"],"simplified":["两相"],"rank":27494.0,"normalized_rank":0.3846767310732725,"fraction":0.0000011827107328353745,"cumulative_fraction":0.9875968010178502,"word":"兩相","characters":[{"definition":["two\/both\/some\/a few\/tael, unit of weight equal to 50 grams (modern) or 1⁄16 of a catty 斤[jin1] (old)"],"pinyin":["liang3"],"word":"兩"},{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"}],"containing_words":[{"definition":["both sides are willing\/by mutual consent"],"pinyin":["liang3 xiang1 qing2 yuan4"],"word":"兩相情願"}],"sentences":[{"english":"A novel two-phase model for the fluidized bed of polyethylene with condensed mode operation was proposed.","chinese":"建立了氣相法聚乙烯冷凝模式操作反應器的兩相模型。"},{"english":"The mechanical seal for light hydrocarbon pump belong to the seal for liquid and gas phases.","chinese":"輕烴泵機械密封屬於汽液兩相密封。"},{"english":"The scanning electronic microscope results showed that double screw blending was better than single screw blending.","chinese":"雙螺桿共混擠出，掃描電鏡觀察兩相混合效果很好。"},{"english":"The three-dimension gas-particle flow in a spiral cyclone is simulated numerically.","chinese":"對螺旋型旋風分離器進行了兩相流場的三維數值模擬。"},{"english":"Two-fluid model was employed to simulate two-phase phenomena of supersonic crossflow .","chinese":"對兩相超聲速橫向噴射試驗進行了數值模擬。"},{"english":"The finite difference method was used to discretize and solve the two phase energy equations.","chinese":"採用有限差分法對兩相能量方程進行離散求解。"},{"english":"City Northeast Thousand Buddha Caves, cultural and natural landscape of two-phase of its America.","chinese":"城東北有千佛洞，人文與自然景觀兩相其美。"},{"english":"With the theory of gas-solid two-phase flow, computer simulation of sandblasting process was discussed.","chinese":"運用氣固兩相流動理論對噴砂過程進行了模擬和仿真。"},{"english":"A simple phenomenological model is proposed to describe the elastic-plastic deformation of two-phase particle composites.","chinese":"提出了一種分析兩相材料塑性響應的模型。"},{"english":"The size of microchannel had a great impact on two-phase friction pressure drop.","chinese":"然後對槽道內兩相摩擦壓降進行了實驗研究和對比。"},{"english":"A novel two-phase model for the fluidize bed of polyethylene with condensed mode operation was proposed.","chinese":"建立了氣相法聚乙烯冷凝模式操作反應器的兩相模型。"},{"english":"Flow friction calculation is one of the basic problems of two phase flow in tubes.","chinese":"摩擦阻力計算是管內兩相流動中的一個基本問題。"},{"english":"Improved models regarding dense gas-particle two-phase flow are proposed.","chinese":"提出了模擬稠密氣固兩相流動的改進模型。"},{"english":"The deformation feature and the mechanism of these biphase W alloys have been also discussed.","chinese":"本文還討論了兩相鎢合金的形變特點和形變機制。"},{"english":"This numerical method is the solution of full coupled two-phase flow .","chinese":"這是一個兩相完全耦合的數值解方法。"},{"english":"L297 is a type of dedicated chip applied in control of two phase stepping motor.","chinese":"L297是一種適用於兩相步進電機控制的專用芯片。"}],"related":[]}