{"definition":["G8 (group of eight major industrialized nations)"],"pinyin":["Ba1 guo2 Ji2 tuan2"],"simplified":["八国集团"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"八國集團","characters":[{"definition":["eight\/8"],"pinyin":["ba1"],"word":"八"},{"definition":["country\/nation\/state\/national\/CL:個|个[ge4]","surname Guo"],"pinyin":["Guo2","guo2"],"word":"國"},{"definition":["to gather\/to collect\/collected works\/classifier for sections of a TV series etc: episode"],"pinyin":["ji2"],"word":"集"},{"definition":["round\/lump\/ball\/to roll into a ball\/to gather\/regiment\/group\/society\/classifier for a lump or a soft mass: wad (of paper), ball (of wool), cloud (of smoke)"],"pinyin":["tuan2"],"word":"團"}],"containing_words":[],"sentences":[{"english":"Japan is hosting the meeting of delegates from the so-called G8, or group of eight industrialized nations.","chinese":"日本主持了八國集團代表會議。"},{"english":"Is it really the case that the G8 is prepared to admit to its own stinginess?","chinese":"八國集團這一次真的要承認自己吝嗇了？"},{"english":"The influences of Group of Eight (G8) upon international legal order have been enlarged boundlessly.","chinese":"八國集團對國際法律秩序的作用和影響，無遠弗屆。"},{"english":"They should be more prominent on the G8 platform.","chinese":"他們應該在西方八國集團的平臺上更加突出。"},{"english":"Would you comment on the possibility of China's joining of G-8?","chinese":"請您談一談中國加入西方八國集團的可能性。"},{"english":"Recently the G8 encouraged patent-holders to participate in the Medicines Patent Pool.","chinese":"最近，八國集團鼓勵專利持有者參與藥物專利池。"},{"english":"Eight rules for driving on the German Autobahn .","chinese":"八國集團規則駕駛德國高速公路。"},{"english":"This critical problem illustrates the interface of the G8 themes.","chinese":"這一重要問題說明了八國集團會議主題的相關性。"},{"english":"France holds the G8 and G20 presidencies this year.","chinese":"法國是今年八國集團和20國集團的輪值主席。"},{"english":"The G8 has the leverage and the clout to shape these decisions.","chinese":"八國集團有影響這些決定的手段和力量。"}],"related":[]}