{"definition":["octahedron"],"pinyin":["ba1 mian4 ti3"],"simplified":["八面体"],"rank":62567.0,"normalized_rank":0.8753935052397409,"fraction":2.6859883342595518e-8,"cumulative_fraction":0.9999020526618212,"word":"八面體","characters":[{"definition":["eight\/8"],"pinyin":["ba1"],"word":"八"},{"definition":["face\/side\/surface\/aspect\/top\/classifier for flat surfaces such as drums, mirrors, flags etc"],"pinyin":["mian4"],"word":"面"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[],"sentences":[{"english":"Octahedron slurry pond in the upper intermittent rotation.","chinese":"八面體在漿池上方間歇性旋轉。"},{"english":"A method is proposed for the inverse displacement analysis of the dual double-octahedral variable geometry truss manipulators.","chinese":"研究了雙二重八面體變幾何桁架機器人的逆位置分析。"},{"english":"Advanced the octahedron frame model used in overall decision of manufacturing system.","chinese":"提出了製造系統的八面體總體決策框架模型。"},{"english":"The central metals was six-coordinated with octahedron geometry.","chinese":"金屬中心爲六配位略微變形的八面體幾何構型。"},{"english":"The octahedral formations drifted apart and the drones spread out in the upper atmosphere.","chinese":"八面體組合開始分離，蜂羣一樣飛出上層大氣。"},{"english":"An octahedron with eight equilateral triangles as faces.","chinese":"有八個正三角形面的八面體。"},{"english":"It's a cubic crystal inside of it!","chinese":"具有完整的立方八面體晶體，高強度和熱穩定性。"},{"english":"The main structure unit of clay minerals contains silicon-oxygen tetrahedron and aluminium-oxygen octahedron.","chinese":"其主要結構單元是硅一氧四面體和鋁一氧八面體。"},{"english":"Complete cubic octahedral crystal crystal shape, high strength and thermal stability.","chinese":"具有完整的立方八面體晶形，高強度和熱穩定性。"},{"english":"The simulation calculation for two double- octahedron variable geometry truss manipulators is given.","chinese":"並對雙二重八面體變幾何桁架機器人進行了仿真計算。"}],"related":[]}