{"definition":["Ministry of Public Security"],"pinyin":["Gong1 an1 bu4"],"simplified":["公安部"],"rank":4738.0,"normalized_rank":0.06629076714283716,"fraction":0.000026008833777990452,"cumulative_fraction":0.8523998961916323,"word":"公安部","characters":[{"definition":["public\/collectively owned\/common\/international (e.g. high seas, metric system, calendar)\/make public\/fair\/just\/Duke, highest of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/honorable (gentlemen)\/father-in-law\/male (animal)"],"pinyin":["gong1"],"word":"公"},{"definition":["content\/calm\/still\/quiet\/safe\/secure\/in good health\/to find a place for\/to install\/to fix\/to fit\/to bring (a charge against sb)\/to pacify\/to harbor (good intentions)\/security\/safety\/peace\/ampere","surname An"],"pinyin":["An1","an1"],"word":"安"},{"definition":["ministry\/department\/section\/part\/division\/troops\/board\/classifier for works of literature, films, machines etc"],"pinyin":["bu4"],"word":"部"}],"containing_words":[],"sentences":[{"english":"Article 6 The Ministry of Public Security is in charge of the nationwide safety protection work of computer information systems.","chinese":"第六條公安部主管全國計算機信息系統安全保護工作。"},{"english":"Detailed measures shall be stipulated separately by the Ministry of Public Security.","chinese":"具體辦法由公安部另行規定。"},{"english":"Li Chang worried most about his wife who was also working in the Ministry of Public Security.","chinese":"李昌說，他那時最擔心的，是同在公安部工作的老伴。"},{"english":"Is this the same case released by the Ministry of Public Security today?","chinese":"今天公安部公佈的是同一起案件嗎？"},{"english":"Why do (or do not) public security authorities engage in the innovative bandwagon of microblogging?","chinese":"爲什麼公安部門會捲入政務微博的時尚浪潮？"},{"english":"By comparison, the head of the Ministry of Public Security is a member.","chinese":"與此相比，中國的公安部部長卻是中央政治局委員。"},{"english":"Third, examine the safety inspection certificate issued by public security organs.","chinese":"三查是否有公安部門的安全檢測合格證書。"},{"english":"A Shanghai police spokeswoman declared she was unaware about the notice’s existence.","chinese":"一位上海公安部發言人聲稱她從未看到過這份文件。"},{"english":"The specific measures shall be formulated by the public security institution under the State Council.","chinese":"具體辦法由國務院公安部門規定。"},{"english":"Police chief urges tough hand on thugs in riots.","chinese":"公安部部長要求嚴厲懲治新疆騷亂暴徒。"},{"english":"Article 7 The department of public security under the State Council shall be responsible for administration of public security throughout the country.","chinese":"第七條國務院公安部門負責全國的治安管理工作。"},{"english":"Certainly is Li Meng's vice minister that public security official's part takes care of national place hall work in the bureau.","chinese":"當然是公安部分管全國地方廳局工作的李盟副部長啦。"},{"english":"The Chinese Ministry of Public Security also signed a range of cooperation documents with US departments concerned.","chinese":"中國公安部與美有關部門還簽署了一系列合作文件。"},{"english":"State Councilor and Minister of Public Security Meng Jianzhu presided over the ceremony.","chinese":"國務委員兼公安部部長孟建柱主持了典禮。"},{"english":"Qi said the Ministry of Industry and Information Technology and the Ministry of Public Security have joined in consulting regarding the dispute.","chinese":"齊向東表示，工信部和公安部已經介入這一紛爭。"},{"english":"Public Security Minister Meng Jianzhu, China's top policeman, called for an investigation into the cause of the fire.","chinese":"公安部部長孟建柱，要求詳細調查火災的原因。"}],"related":[{"definition":["PRC Supreme People's Procuratorate (prosecutor's office)"],"pinyin":["Zui4 gao1 Ren2 min2 Jian3 cha2 yuan4"],"word":"最高人民檢察院"},{"definition":["Ministry of Justice (PRC etc)\/Justice Department (USA etc)"],"pinyin":["Si1 fa3 bu4"],"word":"司法部"},{"definition":["Supreme People's Court (PRC)"],"pinyin":["Zui4 gao1 Ren2 min2 Fa3 yuan4"],"word":"最高人民法院"},{"definition":["public security bureau (government office similar in function to a police station)"],"pinyin":["gong1 an1 ju2"],"word":"公安局"},{"definition":["public security bureau"],"pinyin":["gong1 an1 ji1 guan1"],"word":"公安機關"},{"definition":["State Council (PRC)\/State Department (USA)"],"pinyin":["Guo2 wu4 yuan4"],"word":"國務院"},{"definition":["PRC Ministry of Transport (MOT)"],"pinyin":["Jiao1 tong1 Yun4 shu1 bu4"],"word":"交通運輸部"},{"definition":["PRC Ministry of State Security"],"pinyin":["Guo2 jia1 an1 quan2 bu4"],"word":"國家安全部"},{"definition":["sub-bureau"],"pinyin":["fen1 ju2"],"word":"分局"},{"definition":["Ministry of Civil Affairs (MCA) of the PRC"],"pinyin":["Min2 zheng4 bu4"],"word":"民政部"},{"definition":["(Ministry of) Public Security\/public safety\/public security"],"pinyin":["gong1 an1"],"word":"公安"},{"definition":["General Administration of Customs (GAC)"],"pinyin":["hai3 guan1 zong3 shu3"],"word":"海關總署"},{"definition":["economic crime investigation"],"pinyin":["jing1 zhen1"],"word":"經偵"},{"definition":["Ministry of Land and Resources (MLR), formed in 1998"],"pinyin":["Guo2 tu3 Zi1 yuan2 bu4"],"word":"國土資源部"},{"definition":["Ministry of Transport\/Transport Department"],"pinyin":["Jiao1 tong1 bu4"],"word":"交通部"},{"definition":["to investigate (as detective)\/to solve (crime)\/to uncover (a plot)\/to sniff out\/to break in and analyze\/detective work\/to scout"],"pinyin":["zhen1 po4"],"word":"偵破"}]}