{"definition":["to publicize\/openness (of government, PRC equivalent of \"glasnost\")"],"pinyin":["gong1 kai1 hua4"],"simplified":["公开化"],"rank":23576.0,"normalized_rank":0.32985882780910275,"fraction":0.000001690128963807451,"cumulative_fraction":0.982037254922998,"word":"公開化","characters":[{"definition":["public\/collectively owned\/common\/international (e.g. high seas, metric system, calendar)\/make public\/fair\/just\/Duke, highest of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/honorable (gentlemen)\/father-in-law\/male (animal)"],"pinyin":["gong1"],"word":"公"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"}],"containing_words":[],"sentences":[{"english":"Sceptics point out that due process requires discretion.","chinese":"懷疑派則指出應該謹慎推行公開化。"},{"english":"Although there is no small favors, but the price open, product quality is not bad.","chinese":"雖然沒有小恩小惠，但價格公開化，商品質量還不錯。"},{"english":"It typically explodes into the open at some point.","chinese":"它通常會在某個時間點上突然公開化。"},{"english":"And this semi-public link to the broader net leaves vital systems potentially open to attack.","chinese":"這種半公開化的寬帶連接讓重要的系統容易受到襲擊。"},{"english":"That opened up in public the possibility that the currency union might not be forever.","chinese":"此舉將歐元區不會永遠存續的可能性公開化了。"},{"english":"Recent developments in the area have brought latent ethnic tension out into the open .","chinese":"這個地區最近的事態發展使潛在的民族矛盾公開化了。"},{"english":"There are divisions within NATO on that that have become public.","chinese":"北約內部對此存在分歧，現在分歧已經公開化。"},{"english":"We see perestroika leading to glasnost.","chinese":"我們看到改革向公開化邁進。"}],"related":[]}