{"definition":["fair\/equitable","justice\/fairness\/public highway"],"pinyin":["gong1 dao4","gong1 dao5"],"simplified":["公道"],"rank":12540.0,"normalized_rank":0.17545086955913422,"fraction":0.000005690645827958703,"cumulative_fraction":0.9471068218464108,"word":"公道","characters":[{"definition":["public\/collectively owned\/common\/international (e.g. high seas, metric system, calendar)\/make public\/fair\/just\/Duke, highest of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/honorable (gentlemen)\/father-in-law\/male (animal)"],"pinyin":["gong1"],"word":"公"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"}],"containing_words":[],"sentences":[{"english":"Our company always values its customers’ satisfaction in taking care of every quality requirement and providing best speeding services in reasonable prices.","chinese":"本公司顧客至上，質量超卓，效率快捷，取價公道。"},{"english":"He does not want to go after the oil companies.","chinese":"他不想向石油公司討回公道。"},{"english":"I must admit that he is a pretty talented person.","chinese":"不過說句公道話，我得承認他是個很有才華的人。"},{"english":"For example, Capricorns like to eat in popular places with good prices .","chinese":"比如說，他們喜歡選擇在價格公道的大衆餐廳用餐。"},{"english":"Your unit price seems fair enough, but we're hoping for a higher discount rate.","chinese":"單價彷彿公道，但我們希看賜與更高的折扣率。"},{"english":"Oh, well let me defend this old word bench.","chinese":"哦，還是讓我來替這個單詞說兩句公道話吧。"},{"english":"The Lord restores justice and secures the rights of the oppressed.","chinese":"上主常行正義的工作，爲受壓迫者主持公道。"},{"english":"Thirdly, we must be fair and reasonable.","chinese":"第三，待人處事都要公道。"},{"english":"They are going to get back on justice.","chinese":"他們是要討回公道。"},{"english":"Then he undertaked the responsibility to return justice to the student.","chinese":"然後他承擔了幫大學生討回公道的任務。"},{"english":"But to give the devil his due, I must admit that he is a pretty talented person.","chinese":"不過說句公道話，我得承認他是個很有才華的人。"},{"english":"She hopes health care reform will allow her to buy reasonably priced health insurance.","chinese":"她希望醫改能讓她買到價格公道的醫療保險。"},{"english":"To be fair, by no means all of these were due to government policies.","chinese":"但說句公道話，並不全是由於政府政策所造成的。"},{"english":"His ultimate goal was to bring fair back to the undergraduate.","chinese":"他的最終目標是爲大學生討回公道。"},{"english":"There traveling businessmen found accommodation at moderate terms.","chinese":"旅遊的商人感到那兒的膳宿費是公道的。"},{"english":"Ought he not to treat her generously, fairly, honourably ?","chinese":"他不應該慷慨，公道而誠實地對待她嗎？"}],"related":[{"definition":["to ask for sth back\/to recover"],"pinyin":["tao3 huan2"],"word":"討還"},{"definition":["just\/fair\/equitable"],"pinyin":["gong1 zheng4"],"word":"公正"},{"definition":["arbitration (law)"],"pinyin":["gong1 duan4"],"word":"公斷"},{"definition":["conducting business impartially (idiom); to act justly"],"pinyin":["bing3 gong1 ban4 li3"],"word":"秉公辦理"},{"definition":["to right wrongs\/to redress an injustice"],"pinyin":["shen1 yuan1"],"word":"伸冤"},{"definition":["conscience"],"pinyin":["liang2 xin1"],"word":"良心"},{"definition":["to appeal for justice\/to demand redress for a grievance"],"pinyin":["shen1 yuan1"],"word":"申冤"},{"definition":["to pay with one's life"],"pinyin":["chang2 ming4"],"word":"償命"},{"definition":["to plea for leniency\/to ask for a favor"],"pinyin":["qiu2 qing2"],"word":"求情"},{"definition":["pure\/innocent"],"pinyin":["qing1 bai2"],"word":"清白"},{"definition":["to speak out for justice (idiom); to take a stand on a matter of principle"],"pinyin":["zhang4 yi4 zhi2 yan2"],"word":"仗義執言"},{"definition":["to receive unjust treatment\/injustice"],"pinyin":["yuan1 qu1"],"word":"冤屈"},{"definition":["lit. right and wrong, crooked and straight (idiom); fig. merits and demerits\/pros and cons"],"pinyin":["shi4 fei1 qu1 zhi2"],"word":"是非曲直"},{"definition":["to intercede\/to plead for sb else"],"pinyin":["shuo1 qing2"],"word":"說情"},{"definition":["guilty and deserves to be punished (idiom); entirely appropriate chastisement\/the punishment fits the crime"],"pinyin":["zui4 you3 ying1 de2"],"word":"罪有應得"},{"definition":["death cannot wipe out the crimes (idiom); dreadful crimes that rankled even after the perpetrator is dead"],"pinyin":["si3 you3 yu2 gu1"],"word":"死有餘辜"}]}