{"definition":["covalent bond (chemistry)"],"pinyin":["gong4 jia4 jian4"],"simplified":["共价键"],"rank":65605.0,"normalized_rank":0.9178990667804624,"fraction":1.3721896925021625e-8,"cumulative_fraction":0.9999624944062586,"word":"共價鍵","characters":[{"definition":["common\/general\/to share\/together\/total\/altogether\/abbr. for 共產黨|共产党[Gong4 chan3 dang3], Communist party"],"pinyin":["gong4"],"word":"共"},{"definition":["great\/good\/middleman\/servant","price\/value\/(chemistry) valence"],"pinyin":["jia4","jie5"],"word":"價"},{"definition":["key (on a piano or computer keyboard)\/button (on a mouse or other device)\/chemical bond\/linchpin"],"pinyin":["jian4"],"word":"鍵"}],"containing_words":[],"sentences":[{"english":"Alkenes have one or more double bonds between carbon atoms, where two pairs of electrons are shared.","chinese":"鏈烯有一個或多個共價鍵，即碳原子分享兩對電子。"},{"english":"That is what gets crunched down to covalent bonding.","chinese":"這就要歸結與共價鍵。"},{"english":"Antibody can be linked to liposome particles by covalent binding.","chinese":"抗體能通過共價鍵結合在脂質體顆粒上。"},{"english":"Well, with covalent bonding, it's not so simple.","chinese":"但對於共價鍵就沒這麼簡單了。"},{"english":"The ability of an atom to attract electrons, and in particular, in a covalent bond.","chinese":"原子對電子的吸引能力，特別是在共價鍵中。"},{"english":"I'm imagining something like, covalently bonded chains that have links between them.","chinese":"我想象它們的樣子，通過共價鍵結合的分子鏈。"},{"english":"What's the definition of the covalent bond?","chinese":"共價鍵的定義是什麼？"},{"english":"And so this is the H-F bond in HF.","chinese":"所以這是氟化氫中的氫氟共價鍵。"},{"english":"Just so that we are clear, this is the bond in this compound.","chinese":"所以我們明白，這是化合物中的共價鍵。"},{"english":"And then even lower down, we have our bonded hydrogen molecule.","chinese":"然後繼續降低，我們就有了通過共價鍵結合的氫分子。"},{"english":"He's famous for a lot of things, one of which is covalent bonding.","chinese":"他有許多著名的發現，其中一個便是共價鍵。"},{"english":"So specifically, today we're going to talk about covalent bonds.","chinese":"特別地，今天我們要專門講一講共價鍵。"}],"related":[]}