{"definition":["common understanding\/consensus"],"pinyin":["gong4 shi2"],"simplified":["共识"],"rank":3759.0,"normalized_rank":0.05259328697550124,"fraction":0.00003602494266749507,"cumulative_fraction":0.8223157988734744,"word":"共識","characters":[{"definition":["common\/general\/to share\/together\/total\/altogether\/abbr. for 共產黨|共产党[Gong4 chan3 dang3], Communist party"],"pinyin":["gong4"],"word":"共"},{"definition":["to know\/knowledge\/Taiwan pr. [shi4]","to record\/to write a footnote"],"pinyin":["shi2","zhi4"],"word":"識"}],"containing_words":[{"definition":["1992 Consensus, statement issued after 1992 talks between PRC and Taiwan representatives, asserting that there is only one China"],"pinyin":["Jiu3 Er4 Gong4 shi2"],"word":"九二共識"}],"sentences":[{"english":"A common vocabulary or common understanding can help all in communications.","chinese":"一套公共詞彙或共識可以全方位幫助溝通。"},{"english":"Both sides share many consensuses in international affairs.","chinese":"在國際事務中有許多共識。"},{"english":"The United States and the North Korean Government have reached understanding on the disposition of DPRK related funds frozen at Banco Delta Asia.","chinese":"美朝政府就澳門匯業銀行凍結朝鮮資金問題達成共識。"},{"english":"Can say this word condensed the consensus that entire party fluctuates.","chinese":"可以說這句話凝聚了全黨上下的共識。"},{"english":"Decisions are made by consensus at the weekly meeting.","chinese":"決議通過週會的共識產生。"},{"english":"China and the EU have many consensuses on major international and regional issues.","chinese":"中歐雙方在重大國際和地區問題上有許多共識。"},{"english":"China is ready to work with Russia to implement the consensus reached at the session.","chinese":"中方願同俄方一道，推動對話會議的共識落到實處。"},{"english":"This process provides the basis and structure to support consensus building and joint decision-making.","chinese":"整個過程建立了制定決策所需的共識和基礎。"},{"english":"Share a characteristic about yourself thatyou have in common with the audience.","chinese":"分享你和聽衆的共同點，創造和諧和共識。"},{"english":"Preparatory meetings have made considerable progress in reaching agreement on some of the key issues.","chinese":"在籌備會議中，我們已就一些關鍵項目，取得共識。"},{"english":"These and similar groups begin with a plea for budget discipline.","chinese":"這些擁有相同共識的團體請求預算的紀律性。"},{"english":"Nowadays, protection of ecology and environment has become a world consensus.","chinese":"當今生態環境保護已成爲國際社會的共識。"},{"english":"Second, consolidating consensus and jointly promoting the healthy development of multilateral trade system.","chinese":"第二，凝聚共識，共同推進多邊貿易體制健康發展。"},{"english":"Premier Wen held in-depth talks and reached wide consensus with Turkish leaders.","chinese":"溫總理同土方領導人深入交談，達成廣泛共識。"},{"english":"Presently, coordination principle of human-environment relations has become the global mutual recognition.","chinese":"當前，人地關係的協調論已成爲全球共識。"},{"english":"Mr Conti said he hoped to have agreement on a deal by June.","chinese":"孔蒂表示，他希望在6月前就協議達成共識。"}],"related":[{"definition":["topic of discussion\/topic\/subject\/issue (under discussion)\/CL:項|项[xiang4]"],"pinyin":["yi4 ti2"],"word":"議題"},{"definition":["to appeal\/to demand (an answer)\/requirement\/demand\/claim\/appeal\/(marketing) message"],"pinyin":["su4 qiu2"],"word":"訴求"},{"definition":["to consult with\/to talk things over\/agreement"],"pinyin":["xie2 shang1"],"word":"協商"},{"definition":["to reach (an agreement)\/to accomplish"],"pinyin":["da2 cheng2"],"word":"達成"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to discuss\/to talk over\/CL:個|个[ge4]"],"pinyin":["tao3 lun4"],"word":"討論"},{"definition":["to fight for\/to strive for\/to win over"],"pinyin":["zheng1 qu3"],"word":"爭取"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落實"},{"definition":["controversy\/dispute\/to dispute"],"pinyin":["zheng1 yi4"],"word":"爭議"},{"definition":["society\/CL:個|个[ge4]"],"pinyin":["she4 hui4"],"word":"社會"},{"definition":["mechanism"],"pinyin":["ji1 zhi4"],"word":"機制"},{"definition":["authorities"],"pinyin":["dang1 ju2"],"word":"當局"},{"definition":["bilateral\/both sides\/both parties involved"],"pinyin":["shuang1 fang1"],"word":"雙方"},{"definition":["current\/today's\/modern\/present\/to be facing (us)"],"pinyin":["dang1 qian2"],"word":"當前"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"}]}