{"definition":["conjugate (math.)\/conjugation"],"pinyin":["gong4 e4"],"simplified":["共轭"],"rank":56426.0,"normalized_rank":0.7894729478264519,"fraction":6.860948462510813e-8,"cumulative_fraction":0.9996202625601444,"word":"共軛","characters":[{"definition":["common\/general\/to share\/together\/total\/altogether\/abbr. for 共產黨|共产党[Gong4 chan3 dang3], Communist party"],"pinyin":["gong4"],"word":"共"},{"definition":["to restrain\/to yoke"],"pinyin":["e4"],"word":"軛"}],"containing_words":[{"definition":["conjugate surd (math.)"],"pinyin":["gong4 e4 bu4 jin4 gen1"],"word":"共軛不盡根"},{"definition":["conjugation"],"pinyin":["gong4 e4 zuo4 yong4"],"word":"共軛作用"},{"definition":["conjugate surd (math.)"],"pinyin":["gong4 e4 gen1 shi4"],"word":"共軛根式"},{"definition":["conjugate imaginary number (math)"],"pinyin":["gong4 e4 xu1 shu4"],"word":"共軛虛數"},{"definition":["complex conjugate number (math.)"],"pinyin":["gong4 e4 fu4 shu4"],"word":"共軛複數"},{"definition":["complex conjugate (math.)\/complex conjugation"],"pinyin":["fu4 gong4 e4"],"word":"複共軛"}],"sentences":[{"english":"Finally, it discusses the multiscale fractal feature of quasicrystal conjugate structure.","chinese":"最後討論了準晶共軛結構的多標度分形特徵。"},{"english":"Similar delocalization is found in other conjugated systems.","chinese":"在其他共軛體系中，也發現類似的離域。"},{"english":"In this paper, the phase conjugate nature of the nonlinear coupling forward wave has been demonstrated.","chinese":"本文論證了非線性耦合前向波的位相複共軛特性。"},{"english":"Developmentally normal 6-year-old boy with new onset behavioral changes and dysconjugate gaze.","chinese":"正常發育的6歲男孩出現動作改變和不良共軛凝視。"},{"english":"The key step was a substrate controlled asymmetric heteroatom conjugated addition.","chinese":"關鍵反應爲底物控制的不對稱雜原子共軛加成反應。"},{"english":"Conjugate gradient methods are famous for their interation simplicity and low memory requirements.","chinese":"共軛梯度法以其迭代簡單，存儲量低著稱。"},{"english":"The conditions for generating the phase conjugation in Stimulated Raman Scattering backward-wave are discussed.","chinese":"討論了受激喇曼後向波位相複共軛散射波產生的條件。"},{"english":"In the Qing Dynasty, artificially imposed development and dry cold weather and moderate dry weather affected the area together.","chinese":"清代，人類開發干預與轉爲乾冷及溫乾的氣候相共軛。"},{"english":"The conjugate ellipsograph is designed according to the characteristics of the main—diametral circle.","chinese":"共軛橢圓規是根據主徑圓的性質設計的。"},{"english":"It is shown that the proper acceleration of null geodesic with conjugate points approaches infinity.","chinese":"具有共軛點的類光測地線的固有加速度趨於無窮大。"},{"english":"This theory can be used to develop a microwave phase conjugator.","chinese":"這一理論可用於微波頻段相位共軛器的研製。"},{"english":"One is that the peak profile of rotor is circular arc and the valley is it's conjugate curve.","chinese":"其二，轉子谷形爲圓弧，而其峯形爲它的共軛曲線。"},{"english":"The prospect of CLA production by bioconversion methods on industrial scale is also elucida…","chinese":"並簡述了生物法工業化生產共軛亞油酸的前景。"},{"english":"The phase conjugate behaviours of the backward wave have been demonstrated.","chinese":"研究了後向反射波的位相複共軛特性。"},{"english":"So it is important to eliminate the zero-order diffraction light and conjugate image.","chinese":"因此，將零級亮斑和共軛像去除就顯得尤爲重要。"},{"english":"Every group can be partitioned into equivalence classes called conjugacy classes.","chinese":"所有羣都可以劃分成叫做共軛類的等價類。"}],"related":[]}