{"definition":["mutually profitable\/win-win"],"pinyin":["gong4 ying2"],"simplified":["共赢"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"共贏","characters":[{"definition":["common\/general\/to share\/together\/total\/altogether\/abbr. for 共產黨|共产党[Gong4 chan3 dang3], Communist party"],"pinyin":["gong4"],"word":"共"},{"definition":["to beat\/to win\/to profit"],"pinyin":["ying2"],"word":"贏"}],"containing_words":[],"sentences":[{"english":"It is hoped that the two nations can enhance their cooperation in key projects so as to create a win-win situation.","chinese":"希望兩國加強在重大項目上的合作，實現互利共贏。"},{"english":"Welcome to the new and old customers to seek cooperation and win-win development.","chinese":"歡迎廣大新老客戶前來謀商合作，共贏發展。"},{"english":"We welcome new and old customers work together, mutual benefit and create a better future.","chinese":"竭誠歡迎新老客戶攜手合作，相互共贏，共創未來。"},{"english":"Changsha Dingli drives with you to achieve win-win development.","chinese":"長沙鼎立願與您實現共贏發展。"},{"english":"China is also firmly committed to the win-win strategy of opening up.","chinese":"中國始終不渝奉行互利共贏的開放戰略。"},{"english":"Han Jin always treat every customer in line with win-win cooperative philosophy.","chinese":"漢金本着合作共贏的理念真誠的對待每一位客戶。"},{"english":"Second, we should pursue a well-coordinated and inter-connected approach to develop a model of open and win-win cooperation.","chinese":"第二，堅持協同聯動，打造開放共贏的合作模式。"},{"english":"Win-win-win Solutions - We believe in finding win-win-win solutions to every problem or opportunity.","chinese":"我們堅信共贏是解決問題和把握機遇的最佳方案。"},{"english":"Division Two win-win cooperation, to provide customers with comprehensive services.","chinese":"兩大事業部協作共贏，爲客戶提供全面優質服務。"},{"english":"Ultimately both public and private entities will have to work together. And soon.","chinese":"最終，公衆將和私企協作共贏，而這很快會成爲現實。"},{"english":"This is a basic prerequisite to win-win cooperation.","chinese":"這是實現合作共贏的基本前提。"},{"english":"Second, economic cooperation should be enhanced to seek innovation and realize mutual benefits.","chinese":"加強經濟合作，努力開拓創新，實現互利共贏。"},{"english":"ZOV brand factory, wisdom leads the brand, to achieve the great win-win.","chinese":"卓越品牌工廠，品牌智造，成就共贏。"},{"english":"Fourthly, China is a country that advocates win-win cooperation.","chinese":"第四，中國是一個主張互利共贏的國家。"},{"english":"On your second question, China-US economic and trade relations are essentially mutually beneficial.","chinese":"關於第二個問題，中美經貿關係的本質是互利共贏。"},{"english":"China a follows a win-win strategy of opening-up and is doing all it can to contribute to world development.","chinese":"中國奉行互利共贏的開放戰略，積極爲世界發展盡力。"}],"related":[{"definition":["profitable to both sides\/a win-win situation"],"pinyin":["shuang1 ying2"],"word":"雙贏"},{"definition":["cooperation\/coordination"],"pinyin":["xie2 zuo4"],"word":"協作"},{"definition":["ecosphere"],"pinyin":["sheng1 tai4 quan1"],"word":"生態圈"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["vision (of the future)"],"pinyin":["yuan4 jing3"],"word":"願景"},{"definition":["sustainable development"],"pinyin":["ke3 chi2 xu4 fa1 zhan3"],"word":"可持續發展"},{"definition":["integration\/incorporation\/unification"],"pinyin":["yi1 ti3 hua4"],"word":"一體化"},{"definition":["sustainable"],"pinyin":["ke3 chi2 xu4"],"word":"可持續"},{"definition":["railtrack connection\/to integrate into sth\/to dock\/to connect\/to be in step with\/to bring into line with\/to align"],"pinyin":["jie1 gui3"],"word":"接軌"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to unite\/unity\/solidarity\/united"],"pinyin":["tuan2 jie2"],"word":"團結"},{"definition":["to seek\/to strive for"],"pinyin":["mou2 qiu2"],"word":"謀求"},{"definition":["platform\/terrace\/flat-roofed building"],"pinyin":["ping2 tai2"],"word":"平臺"},{"definition":["to join up\/to dock\/a joint (between components)"],"pinyin":["dui4 jie1"],"word":"對接"},{"definition":["to cooperate\/in coordination with\/coordinated\/collaborate\/collaboration\/collaborative"],"pinyin":["xie2 tong2"],"word":"協同"},{"definition":["to construct (often sth abstract, such as good relations)\/to set up\/to develop\/construction (abstract)\/architecture"],"pinyin":["jian4 gou4"],"word":"建構"}]}