{"definition":["included\/within that"],"pinyin":["qi2 nei4"],"simplified":["其内"],"rank":24782.0,"normalized_rank":0.3467323324891917,"fraction":0.0000015089707288717928,"cumulative_fraction":0.983964839853318,"word":"其內","characters":[{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["inside\/inner\/internal\/within\/interior"],"pinyin":["nei4"],"word":"內"}],"containing_words":[],"sentences":[{"english":"The inner mechanism is the difference function of hemisphere.","chinese":"其內在機制源於大腦兩半球多種功能優勢的差異。"},{"english":"The triangles also have cuts on both sides to maximize the light refraction within them.","chinese":"這些三角形也在兩側切割，以最大化其內的光折射。"},{"english":"Process Lasso lets you do this right inside its built-in process viewer.","chinese":"拉索進程，讓你這個權利，在其內建的檢視過程。"},{"english":"The innovation of Chinese philosophy has its inner logic and succession sequence.","chinese":"中國哲學的創新有其內在的邏輯根據和演替脈絡。"},{"english":"Their innate tenacity is one of their greatest assets, though.","chinese":"其內在的韌性是他們最大的資產之一。"},{"english":"Common people enter it with the yangko team and enjoy all kinds of performances.","chinese":"羣衆隨着秧歌隊進入其內，觀賞各種秧歌表演。"},{"english":"For this reason, the present paper has placed emphasis on the analysis of its internal cause and set forward the reformatory suggestions.","chinese":"對此，本文着重分析其內在原因，提出了改革的建議。"},{"english":"If you count artificial satellites, things get chillier still.","chinese":"如果把人造衛星也算在其內，就可以使物體變得更冷。"},{"english":"Value investors look for securities with prices that are unjustifiably low based on their intrinsic worth.","chinese":"價值投資人尋找價格低於其內在價值的股票。"},{"english":"There are also comparisons between Simplified and Traditional characters, and many multimedia enhancements.","chinese":"其內有生字繁簡對照，及多媒體補充教材。"},{"english":"These links do not necessarily link to the site in the home, in their inside pages on OK.","chinese":"這些鏈接不一定在鏈接網站的首頁，在其內頁就OK。"},{"english":"Branches of learning of Shaanxi modern literature are formed with their inherent laws.","chinese":"陝西當代文學的學科構成有其內在質的規定性。"},{"english":"Emotionalism has its inherent rationality.","chinese":"主情主義有其內在的合理性。"},{"english":"They are often green and hairy and enclose and protect the flower bud.","chinese":"常爲綠色多毛的片狀包被，將花蕾保護在其內。"},{"english":"I forgive my ancestry for the dance of dishonor of earth or any kingdom therein .","chinese":"我寬恕我的祖先對地球或任何其內王國不尊重的舞蹈。"},{"english":"Due to repetition, these ideas also begin to have no intrinsic value.","chinese":"反反覆覆，這些思想觀念也開始失去了其內在價值。"}],"related":[]}