{"definition":["the rest\/the others\/remaining\/remainder\/apart from them"],"pinyin":["qi2 yu2"],"simplified":["其余"],"rank":3030.0,"normalized_rank":0.0423936311614176,"fraction":0.00004732988802456368,"cumulative_fraction":0.7921479082078352,"word":"其餘","characters":[{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["extra\/surplus\/remaining\/remainder after division\/(following numerical value) or more\/in excess of (some number)\/residue (math.)\/after\/I\/me","surname Yu","variant of 餘|余[yu2], remainder"],"pinyin":["Yu2","yu2"],"word":"餘"}],"containing_words":[],"sentences":[{"english":"But, you can perform range scans on the remaining columns in the index key.","chinese":"但是，您可以在索引鍵的其餘列上執行範圍掃面。"},{"english":"About 20 percent of the vaccine will be reserved for essential workers and the rest go to the public on a voluntary basis.","chinese":"有20%的疫苗將供收儲，其餘面向公衆自願接種。"},{"english":"But others seem content to rely on automatic stabilisers.","chinese":"而其餘國家則情願依賴自動穩定器的作用。"},{"english":"Two passengers were hospitalized in critical condition, while injuries to the 11 others were less serious.","chinese":"兩名乘客尚在搶救中，其餘11名乘客傷勢較輕。"},{"english":"This article provides the rest of the story.","chinese":"本文給出這個故事的其餘部分。"},{"english":"For example, the meridian pertaining to the kidney is named the kidney meridian, and the rest may be deduced by analogy.","chinese":"例如，屬於腎的經脈命名爲腎經，其餘由此類推。"},{"english":"As for the other resultant mental states that occur during the rest of life, they number thirty-two.","chinese":"在生命的其餘時間生起的果報心共有三十二種。"},{"english":"The rest of the men he sent back to their homes.","chinese":"其餘的人掃羅都打發各回各家去了。"},{"english":"Octagon —shapedturrets rest on the four corners of the wall.","chinese":"八角形塔樓其餘的四個角落的牆上。"},{"english":"Mash pickled plums, mix well with remaining seasoning and chopped ginger.","chinese":"壓爛梅子，拌入其餘酸梅汁材料及姜茸。"},{"english":"What follows is the rest of our conversation.","chinese":"以下是我們談話的其餘部分。"},{"english":"Ignoring those, the remaining central shape is nondescript.","chinese":"不顧這些，其餘的中央形狀是不倫不類。"},{"english":"All the rest of the Israelites were also of one mind to make David king.","chinese":"以色列其餘的人也都一心要立大衛作王。"},{"english":"It will help us recover the rest of the animal more easily and efficiently.","chinese":"這將幫助我們更容易和有效得恢復其餘的動物。"},{"english":"One third of the pawpaw is for the dish, the remainder is for you.","chinese":"這個木瓜三分之一用來做菜，其餘的都是你的啦。"},{"english":"About half of them are Chinese, and the rest are Americans from Chengdu's tightknit community of expatriates.","chinese":"當中大約一半是中國人，其餘是生活在成都的美國人。"}],"related":[{"definition":["among\/in the middle\/in the center"],"pinyin":["dang1 zhong1"],"word":"當中"},{"definition":["barely\/only\/merely"],"pinyin":["jin3"],"word":"僅"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"則"},{"definition":["majority\/most"],"pinyin":["duo1 shu4"],"word":"多數"},{"definition":["small number\/few\/minority"],"pinyin":["shao3 shu4"],"word":"少數"},{"definition":["current"],"pinyin":["xian4 shi2"],"word":"現時"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["together with\/along with"],"pinyin":["lian2 tong2"],"word":"連同"},{"definition":["to surpass\/to exceed\/to outstrip"],"pinyin":["chao1 guo4"],"word":"超過"},{"definition":["almost\/nearly\/practically"],"pinyin":["ji1 hu1"],"word":"幾乎"},{"definition":["individual\/specific\/respective\/just one or two"],"pinyin":["ge4 bie2"],"word":"個別"},{"definition":["remainder\/surplus"],"pinyin":["sheng4 yu2"],"word":"剩餘"},{"definition":["to part or leave each other\/to distinguish\/difference\/in different ways\/differently\/separately or individually"],"pinyin":["fen1 bie2"],"word":"分別"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"},{"definition":["temporary\/provisional\/for the time being"],"pinyin":["zan4 shi2"],"word":"暫時"},{"definition":["on that day","that very day\/the same day"],"pinyin":["dang1 ri4","dang4 ri4"],"word":"當日"}]}