{"definition":["to attend simultaneously to two or more things\/to balance (career and family, family and education etc)"],"pinyin":["jian1 gu4"],"simplified":["兼顾"],"rank":7564.0,"normalized_rank":0.1058301736320009,"fraction":0.000013063829783128033,"cumulative_fraction":0.904344198019946,"word":"兼顧","characters":[{"definition":["double\/twice\/simultaneous\/holding two or more (official) posts at the same time"],"pinyin":["jian1"],"word":"兼"},{"definition":["surname Gu","to look after\/to take into consideration\/to attend to"],"pinyin":["Gu4","gu4"],"word":"顧"}],"containing_words":[{"definition":["an overall plan taking into account all factors"],"pinyin":["tong3 chou2 jian1 gu4"],"word":"統籌兼顧"},{"definition":["to adequately take into account both public and private interests"],"pinyin":["gong1 si1 jian1 gu4"],"word":"公私兼顧"}],"sentences":[{"english":"Compared with other methods, this approach has better overall consideration.","chinese":"與有關方法比較，該方法具有很好的統籌兼顧性。"},{"english":"Takes a personal interest that things are done right.","chinese":"兼顧了個人興趣，事情就好辦多了。"},{"english":"\"Sudden leap\" is not only the literal quaint, but both sound and meaning.","chinese":"“趵突”不僅字面古雅，而且音義兼顧。"},{"english":"That L2 learners are instructed to notice forms feature will facilitate the acquisition of FMCs.","chinese":"如能讓學習者兼顧形式特徵，會有利於二語習得。"},{"english":"Besides, this article uses physically-based dynamic simulation method to model garment draping.","chinese":"同時兼顧到計算效率，也結合幾何方法模擬服裝褶皺。"},{"english":"Effective cash administration must take both liquidity and earning efficiency into account.","chinese":"有效的現金管理是必須兼顧其流動性與獲利性。"},{"english":"All security considerations have to exist on the spectrum between convenience and protection.","chinese":"所有安全性考慮必須兼顧方便和保護。"},{"english":"I'm a two-way player, I defend and attack.","chinese":"我相信自己能夠在防守和進攻兩方面同時兼顧。"},{"english":"Your objective should be to have good and balanced progress in all four facets.","chinese":"你的目標應當兼顧和平衡好以上的四個方面。"},{"english":"The committee found a middleground between the two proposals.","chinese":"委員會在兩方提案中採取了兩面兼顧的決定。"},{"english":"The plan of materials selection for OCTG needs to be made based on consideration of both the technical requirements and the economic benefits.","chinese":"石油管材的選擇方案應兼顧技術要求和經濟效益。"},{"english":"He juggled work with full time schooling.","chinese":"他工作的同時兼顧學業。"},{"english":"It still has to be entertaining, right?. - Yeah.","chinese":"還是要兼顧娛樂效果，對吧？"},{"english":"In addition to non-proliferation issues, attention of the GGE should also be focused on arms control and disarmament matters.","chinese":"在關注防擴散問題的同時，也應兼顧軍控和裁軍。"},{"english":"Fourth, adopt a holistic approach for comprehensive and balanced growth.","chinese":"第四，統籌兼顧，實現全面均衡發展。"},{"english":"But spending cuts must be balanced with more reforms to our tax code.","chinese":"但是削減開支必須統籌兼顧，競選更多的稅法改革。"}],"related":[{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"},{"definition":["to display\/to exhibit\/to bring out implicit or innate qualities\/to express (a thought or moral)\/to develop (an idea)\/to elaborate (on a theme)"],"pinyin":["fa1 hui1"],"word":"發揮"},{"definition":["to appeal\/to demand (an answer)\/requirement\/demand\/claim\/appeal\/(marketing) message"],"pinyin":["su4 qiu2"],"word":"訴求"},{"definition":["steady\/stable\/stability\/to stabilize\/to pacify"],"pinyin":["wen3 ding4"],"word":"穩定"},{"definition":["to coordinate\/to harmonize\/to fit together\/to match (colors etc)\/harmonious\/concerted"],"pinyin":["xie2 tiao2"],"word":"協調"},{"definition":["category"],"pinyin":["fan4 chou2"],"word":"範疇"},{"definition":["to emphasize (a statement)\/to stress"],"pinyin":["qiang2 diao4"],"word":"強調"},{"definition":["both sides"],"pinyin":["liang3 zhe3"],"word":"兩者"},{"definition":["to present clearly\/to give prominence to\/to magnify\/clear and obvious"],"pinyin":["tu1 xian3"],"word":"凸顯"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["not only (this one)\/not just (...) but also"],"pinyin":["bu4 jin3"],"word":"不僅"},{"definition":["to defend\/to safeguard\/to protect\/to uphold\/to maintain"],"pinyin":["wei2 hu4"],"word":"維護"},{"definition":["diverse\/diversity\/manifold"],"pinyin":["duo1 yang4"],"word":"多樣"},{"definition":["long-term\/long-range"],"pinyin":["chang2 yuan3"],"word":"長遠"},{"definition":["optimization\/to optimize\/to make superior"],"pinyin":["you1 hua4"],"word":"優化"},{"definition":["whole entity\/entire body\/synthesis\/as a whole (situation, construction, team etc)\/global\/macrocosm\/integral\/holistic\/whole"],"pinyin":["zheng3 ti3"],"word":"整體"}]}