{"definition":["couldn't be better\/ideal\/wonderful"],"pinyin":["zai4 hao3 bu4 guo4"],"simplified":["再好不过"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"再好不過","characters":[{"definition":["again\/once more\/re-\/second\/another\/then (after sth, and not until then)\/no matter how ... (followed by an adjective or verb, and then (usually) 也[ye3] or 都[dou1] for emphasis)"],"pinyin":["zai4"],"word":"再"},{"definition":["good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello","to be fond of\/to have a tendency to\/to be prone to"],"pinyin":["hao3","hao4"],"word":"好"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"}],"containing_words":[],"sentences":[{"english":"The creation and use of mediation policies is best described by example.","chinese":"用例子描述中介策略的創建和使用再好不過了。"},{"english":"So much the better, thought I.","chinese":"我想，那再好不過了。"},{"english":"Hollywood is the best if you want to come, have a good time, party,","chinese":"你要想來好好玩，聚會，好萊塢再好不過了。"},{"english":"It'll be just perfect with a little chili oil.","chinese":"如果再加上一點兒辣椒油就再好不過了。"},{"english":"And if the planet happens to be saved on the way, that is all to the good.","chinese":"如果在此過程中碰巧拯救了地球，那是再好不過了。"},{"english":"Thers's nothing better than looking at the sea from this place.","chinese":"在這個位置看大海再好不過了。"},{"english":"But a lark is really the best thing to get up with.","chinese":"其實跟着雲雀起牀纔是再好不過的。"},{"english":"It is far better to have several players in with you and reduce the gamble.","chinese":"讓幾個玩家和你一起玩及減少賭金是再好不過的了。"},{"english":"The weather is all one could wish for today.","chinese":"今天天氣再好不過了。"},{"english":"Having fire resistant clothing handy for you and for the family can be a good call.","chinese":"爲你和你的家人準備一件防火衣是再好不過的事情了。"},{"english":"Lake in longevity, good health movement.","chinese":"在長壽湖，養生運動再好不過。"},{"english":"If you can use \"less common\" vocabulary correctly, that's great.","chinese":"如果你可以準確地使用不太常見的詞彙，那再好不過。"},{"english":"I had expected that writing a book from home would be the best sort of work there was.","chinese":"我過去以爲，呆在家裏寫書，是再好不過的差事了。"},{"english":"It is far better that they should give us more time.","chinese":"他們給我們更多的時間，那是再好不過的。"},{"english":"I just wanted to let you know carnell's prepped for surgery.","chinese":"現在再好不過了我正準備做外科手術說吧什麼事？"},{"english":"It would be great if fish really were brain food.","chinese":"若是喫魚真有助於提升智力，那麼再好不過了。"}],"related":[]}