{"definition":["to arise again\/to make a comeback\/resurgence"],"pinyin":["zai4 qi3"],"simplified":["再起"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"再起","characters":[{"definition":["again\/once more\/re-\/second\/another\/then (after sth, and not until then)\/no matter how ... (followed by an adjective or verb, and then (usually) 也[ye3] or 都[dou1] for emphasis)"],"pinyin":["zai4"],"word":"再"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[{"definition":["lit. to return to office after living as a hermit on Mount Dongshan (idiom); fig. to make a comeback"],"pinyin":["dong1 shan1 zai4 qi3"],"word":"東山再起"}],"sentences":[{"english":"I can try again.","chinese":"我可以東山再起。"},{"english":"This is what got me fired and then hired.","chinese":"這就是爲什麼我被炒掉了能夠又東山再起。"},{"english":"Part of getting better is to face the fears and sensations.","chinese":"部分患者再起作用下逐漸轉好，直面恐懼和情感。"},{"english":"He that falls today maybe up tomorrow again.","chinese":"今日跌倒的他或許他日還能東山再起。"},{"english":"I don't believe that it will be possible to put young Cowperwood on his feet after this.","chinese":"我不相信這回能夠使年輕的柯柏烏東山再起。"},{"english":"Al-Jadaa rebounded by selling her inventory and buying the equipment needed to start over.","chinese":"賈達通過變賣庫存重新購買設備才得以東山再起。"},{"english":"The peace talks broke down completely, and the two opposing parties took up arms again.","chinese":"和平會談徹底破裂，對立雙方再起干戈。"},{"english":"After years of semi-retirement, the actressstaged a comeback.","chinese":"那位女明星在數年的半退休之後東山再起。"},{"english":"The boss lost all his money, but soon bobbed up again.","chinese":"這老闆完全虧了本，但很快東山再起。"},{"english":"If escaping from death, need equestrian desert, in the future good stage a comeback.","chinese":"大難不死的話，就需要騎馬逃跑，日後好東山再起。"},{"english":"It is difficult for Central and Southern Europe to resurge in the short term.","chinese":"中東歐經濟短期內難以東山再起。"},{"english":"We suffered a terrible blow, but we are coming back.","chinese":"我們遭受了沉重一擊，但是我們正在東山再起。"},{"english":"At first the alarmists prophesied a renewal of the war.","chinese":"起初，有一些危言聳聽的人預言戰爭會重新再起。"},{"english":"The boxer hopes to stage a come-back.","chinese":"這拳擊家希望東山再起。"},{"english":"But I fear there is to see her again so that their hearts agitatedly.","chinese":"可是我有害怕見到她讓自己的心再起勃然。"},{"english":"They didn't admit they were defeated; they began to recruit and attempted to stage a comeback.","chinese":"他們不承認失敗，他們開始招兵妄圖東山再起。"}],"related":[{"definition":["to spring up everywhere\/from all around"],"pinyin":["si4 qi3"],"word":"四起"},{"definition":["continuously arising\/to arise repeatedly"],"pinyin":["die2 qi3"],"word":"迭起"},{"definition":["to take advantage of a favorable situation\/to seize an opportunity"],"pinyin":["chen4 shi4"],"word":"趁勢"},{"definition":["lit. lay down the flag and still the drums (idiom); fig. to cease\/to give in"],"pinyin":["yan3 qi2 xi1 gu3"],"word":"偃旗息鼓"},{"definition":["to counterattack\/a counteroffensive"],"pinyin":["fan3 gong1"],"word":"反攻"},{"definition":["to settle (a dispute)\/to quieten down\/to suppress"],"pinyin":["ping2 xi1"],"word":"平息"},{"definition":["unrest (social or political)\/turmoil\/upheaval\/commotion"],"pinyin":["dong4 dang4"],"word":"動蕩"},{"definition":["could happen at any moment\/on the verge"],"pinyin":["yi1 chu4 ji2 fa1"],"word":"一觸即發"},{"definition":["weapons\/arms\/fighting\/war"],"pinyin":["bing1 ge1"],"word":"兵戈"},{"definition":["once more\/once again\/one more time"],"pinyin":["zai4 du4"],"word":"再度"},{"definition":["endlessly\/ceaselessly"],"pinyin":["bu4 xiu1"],"word":"不休"},{"definition":["to lift (a lid)\/to rock\/to convulse"],"pinyin":["xian1"],"word":"掀"},{"definition":["to provoke\/to stir up\/to incite"],"pinyin":["tiao3 qi3"],"word":"挑起"},{"definition":["lit. to return in a swirl of dust (idiom)\/fig. to regroup and come back even stronger\/to make a comeback"],"pinyin":["juan3 tu3 chong2 lai2"],"word":"卷土重來"},{"definition":["to seize the opportunity\/to strike while the iron is hot"],"pinyin":["cheng2 shi4"],"word":"乘勢"},{"definition":["(literary) to eliminate\/to put an end to"],"pinyin":["xiao1 mi3"],"word":"消弭"}]}