{"definition":["to assume sb's name and take his place (idiom); to impersonate\/to pose under a false name"],"pinyin":["mao4 ming2 ding3 ti4"],"simplified":["冒名顶替"],"rank":38107.0,"normalized_rank":0.5331663705175381,"fraction":4.596835469882244e-7,"cumulative_fraction":0.9956923114662556,"word":"冒名頂替","characters":[{"definition":["surname Mao","to emit\/to give off\/to send out (or up, forth)\/to brave\/to face\/reckless\/to falsely adopt (sb's identity etc)\/to feign\/(literary) to cover"],"pinyin":["Mao4","mao4"],"word":"冒"},{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"},{"definition":["apex\/crown of the head\/top\/roof\/most\/to carry on the head\/to push to the top\/to go against\/to replace\/to substitute\/to be subjected to (an aerial bombing, hailstorm etc)\/(slang) to \"bump\" a forum thread to raise its profile\/classifier for headwear, hats, veils etc"],"pinyin":["ding3"],"word":"頂"},{"definition":["to substitute for\/to take the place of\/to replace\/for\/on behalf of\/to stand in for"],"pinyin":["ti4"],"word":"替"}],"containing_words":[{"definition":["impersonator\/impostor"],"pinyin":["mao4 ming2 ding3 ti4 zhe3"],"word":"冒名頂替者"}],"sentences":[{"english":"They rang in a player in the game under a false name.","chinese":"他們偷偷塞進一名運動員冒名頂替參加比賽。"},{"english":"Righty is an imposter.","chinese":"小右是冒名頂替的。"},{"english":"Mira Wang, to recognize his own daughter to college impostor fact.","chinese":"王崢嶸承認自己的女兒冒名頂替上大學的事實。"},{"english":"It was only a question of a trifling substitution of names.","chinese":"那不過是一件小小的冒名頂替的事罷了。"},{"english":"Then they're both imposters.","chinese":"那他們就都是冒名頂替者了。"},{"english":"The presidential impersonator has not been found.","chinese":"總統的冒名頂替者尚未被找到。"},{"english":"Don't be fooled by impostors and copycats whose feeds keep getting disabled. This is the only offici…","chinese":"不要被愚弄的冒名頂替者和抄襲的飼料不斷得到禁用。"},{"english":"Remove the likes of the imposter.","chinese":"除去冒名頂替者喜歡。"},{"english":"The representative of register.com then sent the imposter a security code that he had to provide.","chinese":"的人員隨後請冒名頂替者提供所需的安全碼。"},{"english":"We discovered him to be an imposter.","chinese":"我們發現他是個冒名頂替的騙子。"},{"english":"The imposter is not even in the photo.","chinese":"該冒名頂替者甚至沒有在照片。"}],"related":[]}