{"definition":["(mining) roof fall\/to have the roof cave in"],"pinyin":["mao4 ding3"],"simplified":["冒顶"],"rank":35197.0,"normalized_rank":0.4924516950456816,"fraction":5.944208965817878e-7,"cumulative_fraction":0.9941668281861656,"word":"冒頂","characters":[{"definition":["surname Mao","to emit\/to give off\/to send out (or up, forth)\/to brave\/to face\/reckless\/to falsely adopt (sb's identity etc)\/to feign\/(literary) to cover"],"pinyin":["Mao4","mao4"],"word":"冒"},{"definition":["apex\/crown of the head\/top\/roof\/most\/to carry on the head\/to push to the top\/to go against\/to replace\/to substitute\/to be subjected to (an aerial bombing, hailstorm etc)\/(slang) to \"bump\" a forum thread to raise its profile\/classifier for headwear, hats, veils etc"],"pinyin":["ding3"],"word":"頂"}],"containing_words":[],"sentences":[{"english":"Roof fall in mines is one of the severe disasters in mining operation.","chinese":"礦山冒頂是礦山生產過程中嚴重災害之一。"},{"english":"Finally technological methods were brought out to prevent roof falling on bolt support mining roadway.","chinese":"最後提出了防治描杆支護煤巷冒頂的技術途徑。"},{"english":"Fault tree analysis for collapse of roadways with fractured surrounding rock and high tectonic stress in jinchuan mine no.","chinese":"金川二礦區不良岩層採場巷道片幫冒頂事故樹分析。"},{"english":"The reason and forecast of roof falling are analyzed. And the preventive measures are provided.","chinese":"分析了冒頂事故的發生原因和預兆，提出了預防措施。"},{"english":"The roof falling accident is the most commonly occurring accidents in coal mines mining process.","chinese":"礦山井下開採過程中，最常發生的事故就是冒頂事故。"},{"english":"Roof fall can not be completely avoided in construction of hydraulic tunnels.","chinese":"冒頂塌方在水工隧洞施工過程中難以完全避免。"}],"related":[]}