{"definition":["coronary\/coronary artery"],"pinyin":["guan1 mai4"],"simplified":["冠脉"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"冠脈","characters":[{"definition":["hat\/crown\/crest\/cap","surname Guan","to put on a hat\/to be first\/to dub"],"pinyin":["Guan4","guan1","guan4"],"word":"冠"},{"definition":["arteries and veins\/vein (on a leaf, insect wing etc)","see 脈脈|脉脉[mo4 mo4]"],"pinyin":["mai4","mo4"],"word":"脈"}],"containing_words":[{"definition":["coronary circulation"],"pinyin":["guan1 mai4 xun2 huan2"],"word":"冠脈循環"}],"sentences":[{"english":"Motion artifact constitutes the most important challenge to coronary artery imaging.","chinese":"運動僞影一直是冠脈成像的一個最大挑戰。"},{"english":"Objective To probe the clinical and angiographical characteristics of patients with postprandial angina.","chinese":"目的探討餐後心絞痛臨牀及冠脈病變的特點。"},{"english":"Family history of premature CHD was significantly associated with CAC in all ethnic groups.","chinese":"在所有種族中早期冠心病家族史與冠脈鈣化顯著相關。"},{"english":"For the elderly patients with the normal outcome of abnormal coronary angiography, Qi-stagnation syndrome is more.","chinese":"冠脈造影結果正常的患者氣滯證比較多見。"},{"english":"Serum interleukin 1,6,10 in patients with acute coronary syndromes.","chinese":"急性冠脈綜合徵患者血清白介素1，6，10的變化。"},{"english":"Rat models of myocardial infarction were established by ligation of coronary artery.","chinese":"以冠脈結紮法制備大鼠心肌梗死模型。"},{"english":"Background The long-term safety and efficacy of drug-eluting coronary stents have been questioned.","chinese":"藥物洗脫冠脈支架的長期安全性和有效性尚存疑問。"},{"english":"No coronary artery arising from the non-coronary sinus is found.","chinese":"未見無冠狀動脈竇發出冠脈者。"},{"english":"Acute coronary syndrome is often diagnosed in an emergency room or hospital.","chinese":"急性冠脈綜合徵常常在急診室或醫院裏被確診。"},{"english":"Conclusion OPCAB is safe and less invasive with less complications.","chinese":"結論非體外循環下冠脈搭橋術創傷小，併發症少。"},{"english":"Angioplasty uses a balloon-like device to crush the material blocking an artery.","chinese":"冠脈成形術利用一個球形的裝置擠壓阻塞動脈的物質。"},{"english":"The relation be- tween coronary stenosis and myocardial perfusion was analysed.","chinese":"分析冠脈狹窄程度與心肌灌注減少的關係。"},{"english":"What are some of the advantages or the problem of the intracoronary OCT and comparing those two techniques?","chinese":"比較這兩種技術，冠脈內OCT技術的優點有哪些？"}],"related":[]}