{"definition":["metallurgy"],"pinyin":["ye3 jin1 xue2"],"simplified":["冶金学"],"rank":63367.0,"normalized_rank":0.8865865431701482,"fraction":2.291848741732335e-8,"cumulative_fraction":0.9999219549595176,"word":"冶金學","characters":[{"definition":["to smelt\/to cast\/seductive in appearance"],"pinyin":["ye3"],"word":"冶"},{"definition":["gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)"],"pinyin":["Jin1","jin1"],"word":"金"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"Metallurgists of the time are not thought to have known about this technique.","chinese":"人們認爲當時的冶金學家並不瞭解這種技術。"},{"english":"The metallurgical principles of the above results are studied, also.","chinese":"本文對試驗結果還進行了冶金學原理的分析。"},{"english":"In 21 century, the development of metallurgy and material manufacture should be two tendency.","chinese":"21世紀中冶金學及材料製備學的發展在於兩個方向。"},{"english":"But the metallurgist uses the word in relation to a wide variety of processes.","chinese":"但是冶金學家用這個詞來表述很多過程。"},{"english":"In 1913 Harry Brearley, a metallurgist, was trying to find a metal suitable for making gun barrels.","chinese":"冶金學家是決定哪種金屬最合適於某種用途的科學家。"},{"english":"And, as an extractive metallurgist, that took the cake.","chinese":"作爲提煉冶金學家，當然會喜歡這個。"},{"english":"The metallurgist is a scientist who decides which material is most suitable for each purpose.","chinese":"冶金學家是決定哪種金屬最合適於某種用途的科學家。"},{"english":"It can be classified as process metallurgy and physical metallurgy.","chinese":"它可以分爲過程冶金學和物理冶金學。"},{"english":"It can be classified as process metallurgy and physical metallurgy.","chinese":"它可以分爲過程冶金學和物理冶金學。"}],"related":[]}