{"definition":["coolant"],"pinyin":["leng3 que4 ji4"],"simplified":["冷却剂"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"冷卻劑","characters":[{"definition":["cold","surname Leng"],"pinyin":["Leng3","leng3"],"word":"冷"},{"definition":["but\/yet\/however\/while\/to go back\/to decline\/to retreat\/nevertheless\/even though"],"pinyin":["que4"],"word":"卻"},{"definition":["dose (medicine)"],"pinyin":["ji4"],"word":"劑"}],"containing_words":[],"sentences":[{"english":"Continue to fill the system until the coolant tank is full.","chinese":"持續填注冷卻系統，直到冷卻劑貯藏箱填滿。"},{"english":"Are there other coolants besides water?","chinese":"除了水以外，還有其他的冷卻劑嗎？"},{"english":"It is possible, if you have a situation where you have exhausted that source of coolant to introduce, quote–unquote, regular water.","chinese":"如果你用完了那種冷卻劑，你也可以使用普通水。"},{"english":"The use of non- polluting products coolant and antiFushiji, science and technology from the deployment.","chinese":"本產品採用無污染冷卻劑與防腐蝕劑，科技調配而成。"},{"english":"The reactor vessel constitutes the main part of pressure boundary of primary coolant.","chinese":"反應堆壓力殼構成了主冷卻劑壓力邊界的主體。"},{"english":"He also replaced the toxic ammonia that had been the original cooling agent.","chinese":"他還更換了用作最早冷卻劑的帶毒性的氨水。"},{"english":"There are no more points or condensers to replace so we don't need tune-ups as often.","chinese":"再也不需要更換冷卻劑，所以不需要經常調校了。"},{"english":"Coolant, a mixture of water and antifreeze, circulates through these water jackets.","chinese":"冷卻劑，是水和防凍液的混合物，在這些水套中循環。"},{"english":"Restricted refrigerant flow through the condenser.","chinese":"冷卻劑流經冷凝器不暢。"},{"english":"I read an article that said that the US delivered coolant to Japan.","chinese":"我讀到一篇文章，文中說美國給日本送去了冷卻劑。"},{"english":"If the fuel rods became damaged they would release radioactive material into the remaining coolant.","chinese":"如果燃料棒損壞，放射性物質會進到剩餘的冷卻劑中。"},{"english":"At this point the coolant stops circulating in the engine and the engine overheats.","chinese":"此時，冷卻劑在引擎中的循環停止，引擎過熱。"},{"english":"How about liquid coolant? Maybe a little aquarium pump here.","chinese":"液體冷卻劑如何？也許放個玻璃鋼泵在這兒。"},{"english":"Suitable for use under the direct application of coolants and lubricants.","chinese":"適用於根據冷卻劑和潤滑劑的直接應用程序中使用。"}],"related":[]}