{"definition":["(metallurgy) cold-rolled\/cold-rolling"],"pinyin":["leng3 zha2"],"simplified":["冷轧"],"rank":20610.0,"normalized_rank":0.2883606396821177,"fraction":0.0000022449899235096547,"cumulative_fraction":0.9762529679508682,"word":"冷軋","characters":[{"definition":["cold","surname Leng"],"pinyin":["Leng3","leng3"],"word":"冷"},{"definition":["surname Ya","to crush together (in a crowd)\/to make friends\/to check (accounts)","to crush\/to knock sb down with a vehicle","to roll (steel)"],"pinyin":["Ya4","ga2","ya4","zha2"],"word":"軋"}],"containing_words":[],"sentences":[{"english":"It is fabricated from drawn or rolled sections in standard or special materials.","chinese":"它是製作標準或特殊材料的冷拔或冷軋的部分。"},{"english":"The spalling reason of the roller surface for cold rolling is complicated.","chinese":"冷軋工作輥表面發生剝落掉塊的原因是複雜的。"},{"english":"Cold-rolled steel impeller metal external rotor motors welding.","chinese":"冷軋鋼板葉輪金屬外轉子電機弧焊。"},{"english":"Cold-rolled strip compactly wound coils with anti-oxidation oil are supplied in V.","chinese":"冷軋帶鋼鋼卷卷好後塗上抗氧化油，並使用V。"},{"english":"The shearing machine is one of the most popular single unit equipment in the production of cold rolled steel strip.","chinese":"剪切機是冷軋帶鋼生產中使用最廣泛的單機設備之一。"},{"english":"Rolling force model is the crucial model for process control in cold rolling.","chinese":"軋製力數學模型是冷軋工藝控制系統的中樞模型。"},{"english":"A robust repetitive controller for roll eccentricity compensation of cold mill is designed.","chinese":"設計了用於冷軋機的軋輥偏心補償的魯棒重複控制器。"},{"english":"Ball joint rod cold rolling project of zhejiang finite bearing co. ltd.","chinese":"麗水新億特自動化技術有限公司冷軋滾珠絲桿項目。"},{"english":"One kind of speed synchronization control method for deflector roll of cold rolling mill is introduced in the paper.","chinese":"介紹一種冷軋機偏導輥的速度同步控制方式。"},{"english":"A very thin sheet of stainless steel that has either been temper rolled or passed through a cold reduction mill.","chinese":"非常薄的經過硬化冷軋或減厚冷軋處理的不鏽鋼片材。"},{"english":"A very thin sheet of stainless steel that has either been temper rolled or passed through a cold reduction mill.","chinese":"非常薄的經過硬化冷軋或減厚冷軋處理的不鏽鋼片材。"},{"english":"Practical use of the radiation tester to measuring thickness of cold_rolled sheet is also described.","chinese":"簡述了射線測厚儀在冷軋帶鋼厚度測量中的應用情況。"},{"english":"The article describes the design and calculation of air-cushion piler at the rear end of the cross-cut shear in cold rolling mills.","chinese":"簡要介紹冷軋機橫切機組尾部氣墊垛板的設計計算。"},{"english":"It shows that the cold-rolled deformed bar is a new kind of construct…","chinese":"從而表明冷軋鋼筋是一種前途廣闊的新型建築材料。"},{"english":"Application of the cold rolled ribbed steel wires and ho is introduced in the building by an example.","chinese":"通過設計實例介紹了冷軋帶肋鋼筋在工程中的應用。"},{"english":"The lamination factor is an important quality index of non-oriented silicon steel strip.","chinese":"疊片係數是冷軋無取向電工鋼的重要質量指標。"}],"related":[]}