{"definition":["to be born\/to come into being\/to withdraw from worldly affairs"],"pinyin":["chu1 shi4"],"simplified":["出世"],"rank":18366.0,"normalized_rank":0.2569641682873253,"fraction":0.0000028309441177334506,"cumulative_fraction":0.9705781336895616,"word":"出世","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["life\/age\/generation\/era\/world\/lifetime\/epoch\/descendant\/noble","surname Shi"],"pinyin":["Shi4","shi4"],"word":"世"}],"containing_words":[],"sentences":[{"english":"This gave the Chinese people a better sense of balance in regard to this-worldlincss and other- worldliness .","chinese":"這使得中國人對於入世和出世具有良好的平衡感。"},{"english":"Abide, friend, your mother bided till you were born.","chinese":"堅持啊朋友，母親善堅持，你方能出世。"},{"english":"The education there is addressed both to Sangha and lay people, in the form of human knowledge and transmundane dharmas combined.","chinese":"此基地採取世法和出世法相結合的教育形式。"},{"english":"Chapter two studied the content of Liu Chang's poem, and learnt the positive and negative thought showed in his poems.","chinese":"第二章通過劉敞詩歌內容分析其出世精神與入世情懷。"},{"english":"They were expecting their first brood of baby crocks.","chinese":"兩位正期待着他們的第一胎鱷魚寶寶出世。"},{"english":"Actually, if 35 billion years ago plants had not appeared on the earth.","chinese":"實際上，若無三十五億年前植物在地球上的橫空出世。"},{"english":"He hasn't heared of the news that his son was born.","chinese":"他還沒有聽到兒子出世的消息。"},{"english":"If the timing had been different, those children would never have been born.","chinese":"如果時機有所不同，這些孩子們就不會出世了。"},{"english":"His this-worldly idea was abundant and integrated, and the contour of the otherworldly idea was also formed.","chinese":"其入世思想豐富完整，出世思想也初具輪廓。"},{"english":"In Russia, a 73-year-old man had his 102nd grandchild.","chinese":"俄羅斯一名73歲老人的第102個孫子出世。"},{"english":"Most of them came into the world during the War of Liberation.","chinese":"他們大多數人是解放戰爭期間出世的。"},{"english":"In the first few weeks of life, a baby has no real control over its arms and legs.","chinese":"剛出世的幾周內，寶寶其實控制不了自己的四肢。"},{"english":"Like creatures that only come out in the night.","chinese":"像那些僅在夜裏出世的生靈。"},{"english":"And one year after, their first child is born.","chinese":"一年後，他們的第一個孩子出世了。"},{"english":"The cloisters still retain something of the quiet and seclusion of former days.","chinese":"迴廊一帶依然保留有幾分當年的幽靜出世之慨。"},{"english":"Except for the goose herself, Charlotte was the first to know that the goslings had at last arrived.","chinese":"除了母鵝之外，夏洛是第一個得知小鵝出世的消息的。"}],"related":[{"definition":["to be born\/arrival of newborn\/birth (of a savior or religious leader)"],"pinyin":["jiang4 sheng1"],"word":"降生"},{"definition":["this life\/to lose face\/to be disgraced"],"pinyin":["xian4 shi4"],"word":"現世"},{"definition":["lit. to descend to earth (of an immortal)\/to be born"],"pinyin":["jiang4 shi4"],"word":"降世"},{"definition":["to engage with secular society\/to involve oneself in human affairs\/to join the WTO (abbr. for 加入世界貿易組織|加入世界贸易组织[jia1 ru4 Shi4 jie4 Mao4 yi4 Zu3 zhi1])"],"pinyin":["ru4 shi4"],"word":"入世"},{"definition":["to descend\/to arrive\/to come"],"pinyin":["jiang4 lin2"],"word":"降臨"},{"definition":["to levitate heavenwards (a Daoist success)\/to take off\/to soar (of prices)"],"pinyin":["fei1 sheng1"],"word":"飛昇"},{"definition":["reincarnation or transmigration (Buddhism)"],"pinyin":["zhuan3 shi4"],"word":"轉世"},{"definition":["to reach illumination (Buddhism)"],"pinyin":["cheng2 dao4"],"word":"成道"},{"definition":["newborn\/nascent\/primary (biology)"],"pinyin":["chu1 sheng1"],"word":"初生"},{"definition":["to achieve the Dao\/to become an immortal"],"pinyin":["de2 dao4"],"word":"得道"},{"definition":["to be pregnant\/to produce offspring\/to nurture (a development, school of thought, artwork etc)\/fig. replete with (culture etc)"],"pinyin":["yun4 yu4"],"word":"孕育"},{"definition":["the world\/this world\/the world of the living"],"pinyin":["ren2 shi4"],"word":"人世"},{"definition":["to fall down\/to decay\/to fall from the sky\/to die"],"pinyin":["yun3 luo4"],"word":"隕落"},{"definition":["nirvana (Buddhism)"],"pinyin":["nie4 pan2"],"word":"涅槃"},{"definition":["the distant past\/ancient times\/antiquity\/early historical times"],"pinyin":["shang4 gu3"],"word":"上古"},{"definition":["see 隕落|陨落[yun3 luo4]"],"pinyin":["yun3 luo4"],"word":"殞落"}]}