{"definition":["to exert oneself"],"pinyin":["chu1 li4"],"simplified":["出力"],"rank":15635.0,"normalized_rank":0.2187539350523974,"fraction":0.0000038389196312150925,"cumulative_fraction":0.9615697568228591,"word":"出力","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["power\/force\/strength\/ability\/strenuously","surname Li"],"pinyin":["Li4","li4"],"word":"力"}],"containing_words":[],"sentences":[{"english":"I'm more than happy to serve this country, go and help out what's happening in...","chinese":"我很高興我可以爲祖國服務，爲國出力。"},{"english":"The China Association for Promoting Democracy offered efforts to the country's general policy formulation and implementation.","chinese":"民進爲國家大政方針的制定和實施獻計出力。"},{"english":"Using the Principle of supercharger, get high speed and large output forces.","chinese":"利用氣液增壓原理，達到動作速度快，高出力的要求。"},{"english":"It is one of the most thankless jobs in the world.","chinese":"它是世界上最出力不討好的工作。"},{"english":"The villages in order to participate in the glorious pitch in their efforts did not dare enthusiastic.","chinese":"各自然村以參加爲光榮，出錢出力莫不踊躍。"},{"english":"He's been roped in to help sell the tickets.","chinese":"他已被說服出力幫助賣票。"},{"english":"Doing our utmost for the development of agriculture is our farm machinery company's lifelong privilege.","chinese":"如能爲發展農業出力，將是本農機公司一生的榮幸。"},{"english":"And we want to contribute to our better life.","chinese":"我們要的是爲自己過上更好的生活出力。"},{"english":"In his semifinal bout Friday night, Zou showed a canny ability to work the crowd.","chinese":"在週五進行的半決賽中，鄒就顯示出力壓羣雄的實力。"},{"english":"Probably when she intervened to help save Simon Bolivar's life in 1828.","chinese":"可能是她在1828年出力拯救西蒙波利瓦爾的時刻。"},{"english":"As similar to《Fu Rong Nv Er Ji》, it is also the author pay efforts.","chinese":"它和《芙蓉女兒誄》一樣，是作者出力摹寫的文字。"},{"english":"Ying Ying Joyce Choi contributed research to this story.","chinese":"蔡盈盈爲這故事出力做研究。"},{"english":"I hope you can return home after graduation, for the home-building efforts.","chinese":"我進展你能卒業後回國，爲家鄉建設出力。"},{"english":"Volunteers helping out fundraising for the earthquake victims.","chinese":"義工們爲地震災民籌款出錢出力。"},{"english":"Central air conditioning, front drive, condition good, no accidents, no output.","chinese":"中央空調，前驅動，車況很好，無事故，沒出力。"},{"english":"Most people know the difference between an acceptable contribution and an over-share.","chinese":"大多數人懂得出力得當與走過頭的區別。"}],"related":[{"definition":["to pay"],"pinyin":["chu1 qian2"],"word":"出錢"},{"definition":["to throw one's life in for\/to haplessly give one's life for\/to sacrifice oneself torturously working for another or for a group\/to pour in one's utmost effort\/to shed one's last ounce of strength for"],"pinyin":["mai4 ming4"],"word":"賣命"},{"definition":["to share tribulations\/to help sb with worries and difficulties"],"pinyin":["fen1 you1"],"word":"分憂"},{"definition":["making an all-out effort (idiom); to try one's heart out\/to do one's utmost"],"pinyin":["jin4 xin1 jin4 li4"],"word":"盡心盡力"},{"definition":["to share (a burden, a cost, a responsibility)"],"pinyin":["fen1 dan1"],"word":"分擔"},{"definition":["to put forward plans and ideas (also derogatory)\/to give advice (idiom)"],"pinyin":["chu1 mou2 hua4 ce4"],"word":"出謀劃策"},{"definition":["to help\/to assist financially"],"pinyin":["bang1 chen4"],"word":"幫襯"},{"definition":["to watch with folded arms (idiom); to look on without lifting a finger"],"pinyin":["xiu4 shou3 pang2 guan1"],"word":"袖手旁觀"},{"definition":["contribution\/meritorious service\/credit"],"pinyin":["gong1 lao2"],"word":"功勞"},{"definition":["to help one another\/to come to sb's help"],"pinyin":["xiang1 zhu4"],"word":"相助"},{"definition":["to spare no effort (idiom); to do one's utmost"],"pinyin":["jin4 xin1 jie2 li4"],"word":"盡心竭力"},{"definition":["should\/ought"],"pinyin":["li3 dang1"],"word":"理當"},{"definition":["with all of one's heart"],"pinyin":["jin4 xin1"],"word":"盡心"},{"definition":["to be of one mind\/to work as one"],"pinyin":["qi2 xin1"],"word":"齊心"},{"definition":["to be a drag or hindrance on sb"],"pinyin":["che3 hou4 tui3"],"word":"扯後腿"},{"definition":["not to be shirked without dishonor (idiom)\/incumbent\/bounden (duty)"],"pinyin":["yi4 bu4 rong2 ci2"],"word":"義不容辭"}]}