{"definition":["to dig up\/to appear in an excavation\/unearthed\/to come up out of the ground"],"pinyin":["chu1 tu3"],"simplified":["出土"],"rank":9615.0,"normalized_rank":0.13452632462608258,"fraction":0.000008811939445520537,"cumulative_fraction":0.9264173460794952,"word":"出土","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["Tu (ethnic group)\/surname Tu","earth\/dust\/clay\/local\/indigenous\/crude opium\/unsophisticated\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Tu3","tu3"],"word":"土"}],"containing_words":[],"sentences":[{"english":"Xixia Tongguanshan India unearthed in 1983 for the objects.","chinese":"西夏銅官印1983年出土，爲一級文物。"},{"english":"Xuzhou, mausoleum of the king of Chu Country (about 2148 years ago), where Lanling Meijiu liquor was unearthed;","chinese":"徐州楚王陵出土的蘭陵美酒距今已有2148年。"},{"english":"Many exquisite funerary objects were extracted from this grave.","chinese":"這個古墓裏出土了很多精美的隨葬品。"},{"english":"The ancient books and articles in the tombs unearthed in Turpan have proved this historical fact.","chinese":"吐魯番出土的文書和隨葬品充分證明了這一歷史史實。"},{"english":"It indicated that nutrition value of native hen egg better than those of caging commercial hen's.","chinese":"結果顯示出土雞蛋的營養價值比籠養雞蛋高。"},{"english":"It seemed so delicate, so weak is the spring night it destroy unearthed.","chinese":"它顯得那麼嫩，那麼弱，是一夜春風把它摧出土的。"},{"english":"The newly unearthed copper vase is pleasing to the eye and engraved with delicate and intricate traditional designs.","chinese":"新出土的銅花瓶造型優美，刻有精細複雜的傳統圖案。"},{"english":"An archaeologically valuable ancient tomb was unearthed in the underlying soil of this corn field.","chinese":"這片玉米地下伏土層中出土了一個有考古價值的古墓。"},{"english":"The cannons were found in 2008 and recovered last year.","chinese":"這些加農炮與2008年被發現並於去年出土。"},{"english":"Some utensils were in a state of decay when they were unearthed.","chinese":"有些器皿在出土時已經殘破。"},{"english":"The scientists fixed the date of an excavation.","chinese":"科學家確定出土文物的時期。"},{"english":"The household tax system of collecting articles by the nine grades families was reflected in the Wu Bamboo Slips excavated in Zhoumalou, Changsha.","chinese":"長沙走馬樓出土的吳簡中有戶調分爲九品收物的內容。"},{"english":"The most persuasive evidence is the articles unearthed in Mawangdui Han Tomb.","chinese":"最有說服力的證據是在馬王堆漢墓中出土的。"},{"english":"A tapered pike excavated from Fanshan. The part closest to the bottom is decorated with animal faces.","chinese":"出土的錐形器，接近底部處亦有獸面紋。"},{"english":"The most ancient millstone was unearthed just nearby.","chinese":"附近曾經出土過最古老的石磨盤。"},{"english":"Many newly-unearthed cultural relics are set out in the exhibition hall.","chinese":"展覽館裏陳列着許多新出土的文物。"}],"related":[{"definition":["(archeology) grave\/tomb"],"pinyin":["mu4 zang4"],"word":"墓葬"},{"definition":["bronze implement\/refers to ancient bronze artifacts, from c. 2,000 BC"],"pinyin":["qing1 tong2 qi4"],"word":"青銅器"},{"definition":["burial complex (archaeology)"],"pinyin":["mu4 zang4 qun2"],"word":"墓葬群"},{"definition":["burial goods\/burial gifts"],"pinyin":["sui2 zang4 pin3"],"word":"隨葬品"},{"definition":["the prehistoric Shang dynasty (c. 16th-11th century BC)"],"pinyin":["Shang1 dai4"],"word":"商代"},{"definition":["a pottery figurine buried with the dead"],"pinyin":["tao2 yong3"],"word":"陶俑"},{"definition":["copper ware\/bronze ware"],"pinyin":["tong2 qi4"],"word":"銅器"},{"definition":["Neolithic Era"],"pinyin":["Xin1 shi2 qi4 Shi2 dai4"],"word":"新石器時代"},{"definition":["pottery"],"pinyin":["tao2 qi4"],"word":"陶器"},{"definition":["grave\/tomb\/mausoleum"],"pinyin":["mu4"],"word":"墓"},{"definition":["bone tool (archaeology)"],"pinyin":["gu3 qi4"],"word":"骨器"},{"definition":["ruins\/historic relics"],"pinyin":["yi2 zhi3"],"word":"遺址"},{"definition":["Qijia neolithic culture, centered around the Gansu Corridor 河西走廊[He2 xi1 Zou3 lang2] c. 2000 BC"],"pinyin":["Qi2 jia1 wen2 hua4"],"word":"齊家文化"},{"definition":["Yangshao neolithic culture from the central Yellow river basin, with red and black pottery"],"pinyin":["Yang3 shao2 wen2 hua4"],"word":"仰韶文化"},{"definition":["oracle bone\/bone used for divination, esp. animal scapula"],"pinyin":["bu3 gu3"],"word":"卜骨"},{"definition":["implement\/utensil\/article\/object"],"pinyin":["qi4 wu4"],"word":"器物"}]}