{"definition":["to go on an official or business trip"],"pinyin":["chu1 chai1"],"simplified":["出差"],"rank":7387.0,"normalized_rank":0.10335371398989827,"fraction":0.000013580736559846136,"cumulative_fraction":0.9019857653791394,"word":"出差","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["difference\/discrepancy\/to differ\/error\/to err\/to make a mistake","to differ from\/to fall short of\/lacking\/wrong\/inferior\/Taiwan pr. [cha1]","to send\/to commission\/messenger\/mission"],"pinyin":["cha1","cha4","chai1"],"word":"差"}],"containing_words":[],"sentences":[{"english":"Whenever he is on a business trip, he takes a cup with him, which is convenient and hygienic.","chinese":"他出差的時候總是自己帶一個口杯，方便也乾淨。"},{"english":"You may get the chance to travel both for work and for pleasure.","chinese":"你有出差的機會，同時也可以遊山玩水。"},{"english":"Are you working outstation in NanJing?","chinese":"你在南京出差啊？"},{"english":"I travel with my job and enjoy visiting new countries and learning new cultures.","chinese":"我經常出差，喜歡參觀沒去過的國家中，學習新文化。"},{"english":"I do not use travel as an excuse for anything.","chinese":"我不會用出差作爲任何事情的藉口。"},{"english":"I came on business before, but this time I'm here to sightsee .","chinese":"我以前是來出差的，但是這一次是來觀光的。"},{"english":"If Beijing hao's travel, work overtime and put YangManLi children home.","chinese":"假如郝京妮加班和出差，孩子就放楊曼莉家。"},{"english":"P1: It's Tom. I am in Los Angeles on business trip at the moment.","chinese":"我的Tom啊，我現在正在洛杉磯出差。"},{"english":"Q oes the frequent travel required for this work fit into your lifestyle?","chinese":"經常需要出差的工作適合你的生活方式嗎？"},{"english":"I next business trip in Wuhan.","chinese":"我接下來會在武漢出差。"},{"english":"An anonymoustrader commented that the computer might have gone ahead and processed, something of an error happened there.","chinese":"一個匿名交易人說電腦可能出差錯了。"},{"english":"When we go on a business trip, we will be faced with the choice of traveling by train orby plane.","chinese":"當我們出差，我們將面臨的選擇乘坐火車或飛機。"},{"english":"The salesman padded the bill for his travelling expenses by exaggerating his food expenses.","chinese":"推銷員誇大伙食費的開支來虛報出差費。"},{"english":"Willing and able to travel frequently to Europe and take domicile in Beihai, Guangxi.","chinese":"能夠常駐在廣西北海並能適應經常去歐洲出差。"},{"english":"Willing to travel extensively and work on a home-office base.","chinese":"適應經常出差，接受在家辦公的工作。"},{"english":"Save money on trips by staying with friends or relatives.","chinese":"出差時住在親朋好友家可以節省費用。"}],"related":[{"definition":["to go back to one's roots\/to return to one's native place\/by ext. to join one's ancestors (i.e. to die)"],"pinyin":["hui2 lao3 jia1"],"word":"回老家"},{"definition":["to go to work\/to be on duty\/to start work\/to go to the office"],"pinyin":["shang4 ban1"],"word":"上班"},{"definition":["to request leave of absence"],"pinyin":["qing3 jia4"],"word":"請假"},{"definition":["to go home to visit one's family"],"pinyin":["tan4 qin1"],"word":"探親"},{"definition":["to finish work\/to get off work"],"pinyin":["xia4 ban1"],"word":"下班"},{"definition":["to take a vacation\/to go on holiday"],"pinyin":["xiu1 jia4"],"word":"休假"},{"definition":["to work overtime"],"pinyin":["jia1 ban1"],"word":"加班"},{"definition":["to take the car, bus, train etc"],"pinyin":["zuo4 che1"],"word":"坐車"},{"definition":["colleague\/co-worker\/CL:個|个[ge4],位[wei4]"],"pinyin":["tong2 shi4"],"word":"同事"},{"definition":["parts of the country other than where one is"],"pinyin":["wai4 di4"],"word":"外地"},{"definition":["social niceties\/social interaction\/a dinner party"],"pinyin":["ying4 chou5"],"word":"應酬"},{"definition":["to make a trip home"],"pinyin":["tan4 jia1"],"word":"探家"},{"definition":["to leave early and return late (idiom)"],"pinyin":["zao3 chu1 wan3 gui1"],"word":"早出晚歸"},{"definition":["to hold a meeting\/to attend a meeting"],"pinyin":["kai1 hui4"],"word":"開會"},{"definition":["to make a telephone call"],"pinyin":["da3 dian4 hua4"],"word":"打電話"},{"definition":["to return home"],"pinyin":["hui2 jia1"],"word":"回家"}]}