{"definition":["(of a performer) to come onto the stage to perform\/(of an athlete) to enter the arena to compete\/(fig.) to enter the scene (e.g. a new product)\/(of an examinee etc) to leave the venue"],"pinyin":["chu1 chang3"],"simplified":["出场"],"rank":3154.0,"normalized_rank":0.04412855204063073,"fraction":0.00004523700678824416,"cumulative_fraction":0.7978903302563549,"word":"出場","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"}],"containing_words":[{"definition":["appearance fee"],"pinyin":["chu1 chang3 fei4"],"word":"出場費"},{"definition":["(of a referee) to send a player off the field"],"pinyin":["fa2 chu1 chang3"],"word":"罰出場"}],"sentences":[{"english":"With the formal suits but humorous gestures, the Chorale made their first appearance.","chinese":"正式的着裝，詼諧的動作，是該合唱團的出場秀。"},{"english":"In addition, with Gio arts Chiellini may not be able to play.","chinese":"除此之外，基耶利尼同吉奧文科也未必能夠出場。"},{"english":"Butler right knee injury. Will not return tonight.","chinese":"巴特勒右膝蓋受傷，今天晚上不會重新出場了。"},{"english":"Aquilani scored twice in 33 league appearances for Juventus last season.","chinese":"上賽季代表尤文聯賽出場33次，進了兩個球。"},{"english":"He spent much of last season on loan at Tottenham Hotspur (he moved to White Hart Lane when the Reds bought Dimitar Berbatov) where he made 21 appearances.","chinese":"他上賽季大部分時間都在熱刺租借，出場21次。"},{"english":"Imps ? Didn't really change at all, though they don't really need to much.","chinese":"小鬼？完全不用改變它，雖然它的出場率很低。"},{"english":"Okur and Kirilenko both fouled out in the final minute.","chinese":"在最後時刻奧庫和基裏連科雙雙被罰出場。"},{"english":"And you once fouled because of striking.","chinese":"你有一次曾因爲打人犯規而被罰出場外。"},{"english":"Oft-injured Larry Hughes should get more playing time in Pavlovic's absence.","chinese":"傷病常客休斯應該會得到更多的出場時間。"},{"english":"Checks that the starting list for the qualification round is correct.","chinese":"檢查資格賽的出場序是否正確。"},{"english":"But his past scoring record is impressive.","chinese":"但是他過去代表尤文出場的戰績卻令人印象深刻。"},{"english":"The centre forward of our school team was sent off the field by the referee for roughing.","chinese":"我們校隊的中鋒因動作粗野被裁判判罰出場。"},{"english":"Tomasz Kuszczak, meanwhile, is expected to receive a run-out against Wolverhampton Wanderers in the Carling Cup tomorrow night.","chinese":"同時，庫什薩克也將在週三的聯賽盃上得到出場機會。"},{"english":"What if an ad coes in at exactly the same time as a chat ?","chinese":"那如果廣告作爲一個新的聊天訊息出場的話呢？"},{"english":"Approves and signs the starting lists for the next round.","chinese":"認可並簽署簽名下一場比賽出場序。"},{"english":"Gareth made 45 appearances for Southampton, scoring five goals.","chinese":"貝爾爲南安普頓出場45次，並有5粒進球。"}],"related":[{"definition":["to go on stage\/fig. to appear on the scene\/used in advertising to mean new product"],"pinyin":["deng1 chang3"],"word":"登場"},{"definition":["to show oneself\/to appear\/(of a deity) to appear in the flesh"],"pinyin":["xian4 shen1"],"word":"現身"},{"definition":["to begin\/to open\/to start\/beginning of an event"],"pinyin":["kai1 chang3"],"word":"開場"},{"definition":["scene\/spectacle\/occasion\/situation"],"pinyin":["chang3 mian4"],"word":"場面"},{"definition":["gorgeous"],"pinyin":["hua2 li4"],"word":"華麗"},{"definition":["everyone present\/the whole audience\/across-the-board\/unanimously\/whole duration (of a competition or match)"],"pinyin":["quan2 chang3"],"word":"全場"},{"definition":["confrontation\/contest\/showdown"],"pinyin":["dui4 jue2"],"word":"對決"},{"definition":["public\/to publish\/to make public"],"pinyin":["gong1 kai1"],"word":"公開"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"},{"definition":["to be present\/to be on the scene"],"pinyin":["zai4 chang3"],"word":"在場"},{"definition":["competition (sports etc)\/match\/CL:場|场[chang3],次[ci4]\/to compete"],"pinyin":["bi3 sai4"],"word":"比賽"},{"definition":["to enter the venue\/to enter the arena\/(aviation) to approach the airfield\/(investing) to get into the market"],"pinyin":["jin4 chang3"],"word":"進場"},{"definition":["to hold a governmental office or post\/to assume office of\/to take charge of\/to serve as"],"pinyin":["dan1 ren4"],"word":"擔任"},{"definition":["bean vermicelli\/mung bean starch noodles\/Chinese vermicelli\/cellophane noodles\/CL:把[ba3]\/fan (loanword)\/enthusiast for sb or sth"],"pinyin":["fen3 si1"],"word":"粉絲"},{"definition":["to see"],"pinyin":["jian4 dao4"],"word":"見到"},{"definition":["the scene (of a crime, accident etc)\/(on) the spot\/(at) the site"],"pinyin":["xian4 chang3"],"word":"現場"}]}