{"definition":["to come and go\/to roam about (mostly unseen)\/(of a ghost) to haunt (a place)\/(of a criminal) to stalk (the streets)\/(of the sun) to rise and set"],"pinyin":["chu1 mo4"],"simplified":["出没"],"rank":15614.0,"normalized_rank":0.21846011780672425,"fraction":0.00000384855415458798,"cumulative_fraction":0.961489039953862,"word":"出沒","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["(negative prefix for verbs)\/have not\/not","drowned\/to end\/to die\/to inundate"],"pinyin":["mei2","mo4"],"word":"沒"}],"containing_words":[{"definition":["to appear and disappear unpredictably"],"pinyin":["chu1 mo4 wu2 chang2"],"word":"出沒無常"}],"sentences":[{"english":"Dall's sheep and mountain goats are found in the park's alpine environment.","chinese":"公園的山區還有大角羊和山羊出沒。"},{"english":"The mammoth buffalo roamed the plains.","chinese":"龐大的野牛羣出沒在這些平原上。"},{"english":"A gnome that haunts underground places in German folklore.","chinese":"地靈德國民間傳說中在地下出沒的地神。"},{"english":"For mount Sion, because it is destroyed, foxes have walked upon it.","chinese":"因爲熙雍山已經荒蕪，狐狸成羣出沒其間。"},{"english":"That pub is the haunt of all the lay– abouts in the district.","chinese":"尋家酒店是這個區所有的閒蕩的人出沒的地方。"},{"english":"It haunts the depths of the earth and the sea. It gleams from the hues of the shell and the precious stone.","chinese":"美，出沒於深海幽谷，在奇石貝殼的色彩中閃爍。"},{"english":"Any of the following situations can occur when in bear country.","chinese":"在有熊出沒的鄉村，以下任何情況都有可能發生。"},{"english":"The same is true for the bandit infested village quests .","chinese":"這同樣適用於村的土匪出沒的追求。"},{"english":"The local government closed the lido announcing that some sharks were emerging there.","chinese":"地方政府關閉了海濱浴場，宣稱海里有鯊魚出沒。"},{"english":"People say ghosts haunt that old house .","chinese":"人們說鬼常出沒於那幢古老的房子。"},{"english":"Myrtle haunts a girls' bathroom on the second floor.","chinese":"桃金娘經常出沒在二樓的一間女盥洗室。"},{"english":"Men needed to predict where and when animals would be available for hunting.","chinese":"男人需要預測動物出沒的時間與地點以便狩獵。"},{"english":"The area was forbidden for people to enter as there are a lot of wild dragons, \" Harum said.\"","chinese":"但是該地區由於許多野龍出沒並不允許人們私自闖入。"},{"english":"Crocodile-infested water, and strive to surpass themselves.","chinese":"鱷魚出沒的水，努力超越自己。"},{"english":"“Iron-clad” warships prowled up and down the coast, maintaining a Union blockade of Confederate ports.","chinese":"鐵殼戰船出沒於海灣，封鎖了南軍港口。"},{"english":"Until today, the police are still receiving reports about the emergence of Mothman.","chinese":"直至今日警察依然會接到關於蛾人出沒的消息。"}],"related":[{"definition":["to wander\/to roam about\/to loaf about\/to be idle"],"pinyin":["you2 dang4"],"word":"遊蕩"},{"definition":["everywhere"],"pinyin":["dao4 chu4"],"word":"到處"},{"definition":["surroundings\/environment\/to encompass"],"pinyin":["zhou1 wei2"],"word":"周圍"},{"definition":["downtown area\/city center"],"pinyin":["nao4 shi4"],"word":"鬧市"},{"definition":["to pass by or through"],"pinyin":["lu4 guo4"],"word":"路過"},{"definition":["all over the place\/everywhere and all directions"],"pinyin":["si4 chu4"],"word":"四處"},{"definition":["to hide oneself\/invisible (person or online status)"],"pinyin":["yin3 shen1"],"word":"隱身"},{"definition":["periphery\/rim\/surroundings\/all around\/perimeter\/peripheral (computing)\/spin-offs"],"pinyin":["zhou1 bian1"],"word":"周邊"},{"definition":["to forage\/to hunt for food\/to scavenge\/fig. to make a living"],"pinyin":["mi4 shi2"],"word":"覓食"},{"definition":["nest\/pit or hollow on the human body\/lair\/den\/place\/to harbor or shelter\/to hold in check\/to bend\/classifier for litters and broods"],"pinyin":["wo1"],"word":"窩"},{"definition":["to surround\/to encircle\/to hem in"],"pinyin":["bao1 wei2"],"word":"包圍"},{"definition":["nowhere"],"pinyin":["wu2 chu4"],"word":"無處"},{"definition":["to stand in a circle and watch"],"pinyin":["wei2 guan1"],"word":"圍觀"},{"definition":["to search\/to look for\/to seek"],"pinyin":["xun2"],"word":"尋"},{"definition":["tracks\/trail\/footprint\/trace\/vestige"],"pinyin":["zong1 ji4"],"word":"蹤跡"},{"definition":["bird\/CL:隻|只[zhi1],群[qun2]\/(dialect) to pay attention to\/(intensifier) damned\/goddam","variant of 屌[diao3]\/penis"],"pinyin":["diao3","niao3"],"word":"鳥"}]}