{"definition":["cashier\/to receive and hand over payment\/to lend and borrow books"],"pinyin":["chu1 na4"],"simplified":["出纳"],"rank":22617.0,"normalized_rank":0.316441173590027,"fraction":0.000001850558375728714,"cumulative_fraction":0.9803421488519998,"word":"出納","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["surname Na","to receive\/to accept\/to enjoy\/to bring into\/to pay (tax etc)\/nano- (one billionth)\/to reinforce sole of shoes or stockings by close sewing"],"pinyin":["Na4","na4"],"word":"納"}],"containing_words":[{"definition":["cashier\/teller\/treasurer"],"pinyin":["chu1 na4 yuan2"],"word":"出納員"}],"sentences":[{"english":"For assistance please call the Library Circulation Desk at extension 15112.","chinese":"若有疑問歡迎洽詢圖書館出納臺，分機15112。"},{"english":"And when I said hello to cashiers and clerks, I got better service.","chinese":"當我向出納員或店員問好時，能得到更優質的服務。"},{"english":"Collect bills from travel services and hand the payment to the teller.","chinese":"負責與旅行社的結帳工作，收款後交於出納。"},{"english":"The teller then takes the withdrawal slip to a bank officer for approval.","chinese":"然後出納員將此取款單交給銀行主管人以獲得批准。"},{"english":"After robbing the till for months the cashier was found out.","chinese":"那出納員從錢櫃裏偷錢偷了好幾個月後才被發現。"},{"english":"Since my graduation from the school two years ago, I ahve been employed in the Green Hotel as a cashier.","chinese":"兩年前，自從離校後，在格蘭酒店擔任出納員。"},{"english":"Mary Ann, his wife, passed by with her bookkeeping binder.","chinese":"他的妻子瑪麗安捧着出納簿從邊上走過。"},{"english":"Salaries were disbursed by the paymaster's office.","chinese":"薪金已由工薪出納員辦公室發放。"},{"english":"There's a partial list over by the cash register .","chinese":"現金出納機旁邊有張部分的進貨單。"},{"english":"Qiu Renqing, specialized accountant, presently is responsible for QIANYIl tellers work.","chinese":"邱仁慶，專業會計師，現負責千藝出納工作。"},{"english":"The letter at Counter 6will pay you against your number slip.","chinese":"六號欄櫃的出納員將根據你的號頭牌給付你錢。"},{"english":"The diligent sayer talked a tedious story about the insayigent sasayite.","chinese":"勤奮的出納講述了唯一涉及智能衛星的乏味古代事件。"},{"english":"The teller told me I need to sign these forms.","chinese":"出納員告訴我得籤這些表格。"},{"english":"The company treasurer absconded with the funds.","chinese":"公司出納攜款潛逃了。"},{"english":"Be responsible for maintaining enough coins and bank notes for cashiers' daily exchange.","chinese":"爲出納準備足夠的硬幣和小鈔以便每日的兌換。"},{"english":"Cashier was found guilty of peculation and removed from his post.","chinese":"出納員被發現犯了盜用公款罪便被解除了職務。"}],"related":[{"definition":["my limited view (lit. view through a thin tube)\/my limited understanding\/my opinion (humble)"],"pinyin":["guan3 jian4"],"word":"管見"},{"definition":["title (position within an organization)"],"pinyin":["zhi2 xian2"],"word":"職銜"},{"definition":["argumentation"],"pinyin":["lun4 fa3"],"word":"論法"},{"definition":["scholastic attainments"],"pinyin":["xue2 li4"],"word":"學力"},{"definition":["to be in overall charge\/to oversee"],"pinyin":["zong1 li3"],"word":"綜理"},{"definition":["to reconcile\/to mediate\/to bring warring parties to agreement\/to arbitrate"],"pinyin":["tiao2 ting2"],"word":"調停"},{"definition":["to denounce\/to condemn\/to call to account\/to punish"],"pinyin":["wen4 zui4"],"word":"問罪"},{"definition":["experienced\/sophisticated\/worldly-wise"],"pinyin":["lian4 da2"],"word":"練達"},{"definition":["(grammar) number plus classifier\/household (in census)"],"pinyin":["ming2 shu4"],"word":"名數"},{"definition":["see 報應|报应[bao4 ying4]"],"pinyin":["ying4 bao4"],"word":"應報"},{"definition":["high official"],"pinyin":["da4 yuan2"],"word":"大員"},{"definition":["funds and provisions for the troops\/(soldier's) pay"],"pinyin":["jun1 xiang3"],"word":"軍餉"},{"definition":["to evaluate the merit of sth"],"pinyin":["lun4 gong1"],"word":"論功"},{"definition":["plan of convenience (idiom); stop-gap measure\/makeshift stratagem\/interim step"],"pinyin":["quan2 yi2 zhi1 ji4"],"word":"權宜之計"},{"definition":["to investigate\/examination"],"pinyin":["kan1 yan4"],"word":"勘驗"},{"definition":["to become visible\/to appear\/to manifest one's true nature"],"pinyin":["xian4 xing2"],"word":"現形"}]}