{"definition":["to officially launch (a policy, program etc)\/to appear on stage\/to appear publicly\/(of a bar girl) to leave with a client"],"pinyin":["chu1 tai2"],"simplified":["出台"],"rank":1154.0,"normalized_rank":0.01614595721461251,"fraction":0.00013985328150456668,"cumulative_fraction":0.6429106470670076,"word":"出臺","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["Taiwan (abbr.)","platform\/stage\/terrace\/stand\/support\/station\/broadcasting station\/classifier for vehicles or machines"],"pinyin":["Tai2","tai2"],"word":"臺"}],"containing_words":[],"sentences":[{"english":"Farmers are revolting over a new sliding-scale increase in export taxes.","chinese":"農場主對新出臺的出口稅率浮動上調政策非常不滿。"},{"english":"They offer score systems or membership systems to consolidate the consumption group.","chinese":"積分制，會員制不斷出臺穩定消費羣。"},{"english":"A：Do you know when our governmental housing will be assigned?","chinese":"你知道政府福利房分配方案何時出臺嗎？"},{"english":"Last year, we introduced the new 36 guidelines on encouraging and guiding the non-governmental investment.","chinese":"去年我們又出臺了鼓勵和引導民營資本投資的36條。"},{"english":"The Security Administration Punishment Law being paid close attention to has been enacted recently.","chinese":"倍受矚目的《治安管理處罰法》新近出臺。"},{"english":"This should be the current policy was due inwardness.","chinese":"這應該是此次政策出臺的應有深意。"},{"english":"FDA looks to curb abuse of cough medicine.","chinese":"美國FDA計劃出臺措施，遏止濫用止咳藥。"},{"english":"The evacuation plans came against a background of mounting concern over the possibility of a nuclear catastrophe.","chinese":"這份撤離方案出臺自對核災難威脅逐步增大的考慮下。"},{"english":"Moreover, official publications have expressed caution about putting the sweeping rules into effect.","chinese":"官方出版物正在對這項“掃蕩”計劃的出臺做着辯白。"},{"english":"\"Workers paid annual leave regulations\" promulgated at the same time.","chinese":"《職工帶薪年休假條例》同時出臺。"},{"english":"\" Ballproof bust bodice \" publish the proposal that comes from a policewoman.","chinese":"“防彈胸罩”的出臺來自一名女警察的建議。"},{"english":"The development of the review has informed the Alliance`s strategy in this area. The Alliance HPSR is now initiating two new capacity development initiatives, namely","chinese":"這一文件的出臺通報了聯盟在這一領域的戰略。"},{"english":"The approval of Anti-secession Law is a leap in the process of China's rule of law.","chinese":"《反分裂國家法》的出臺是中國依法執政的新飛躍。"},{"english":"\"Let us now is about to publish the muttering about the new\" law of post.","chinese":"現在讓我們焦頭爛額的是即將出臺的新《郵政法》。"},{"english":"At present, our country has not an intact and unified antimonopoly law.","chinese":"在當前，我國沒有一部完整統一的反壟斷法出臺。"},{"english":"The refusal of the actor turned all our arrangements for the performance topsy-turvy.","chinese":"那個演員拒絕出臺把我們整個演出安排都搞亂了。"}],"related":[]}