{"definition":["source (esp. of quotation or literary allusion)\/origin\/where sth comes from"],"pinyin":["chu1 chu4"],"simplified":["出处"],"rank":19367.0,"normalized_rank":0.2709694569977474,"fraction":0.000002560009642277704,"cumulative_fraction":0.9732721017448182,"word":"出處","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"The answers to difficult problems are usually not found in the same place as the problems.","chinese":"我們不能在問題的出處找到解決疑難問題的方法。"},{"english":"would not have checked the provenance of that story?","chinese":"沒有核查那個故事的出處。"},{"english":"But did not make clear provenance and author full name in any place.","chinese":"但沒有在任何一個地方表明出處和作者姓名。"},{"english":"But Song Yu's contribution to the motif history …","chinese":"而宋玉在出處仕隱主題史上的歷史貢獻，由此奠定。"},{"english":"Tanslated by Zhu Xiaoxing. Whoever wants to quote it should note the translator and where the translation is from.","chinese":"本文由朱曉星譯出，如要轉引，請註明譯者及出處。"},{"english":"It differs from reprinted publication in that a reprint cites sources.","chinese":"與單行本出版物的不同之處在於再版引用出處。"},{"english":"But Song Yu's contribution to the motif history was es…","chinese":"而宋玉在出處仕隱主題史上的歷史貢獻，由此奠定。"},{"english":"An understanding of the provenance of the product is key.","chinese":"對產品出處的瞭解很關鍵。"},{"english":"You need not note the source of information that you paraphrased.","chinese":"你沒有必要告知你所解釋的信息的出處。"},{"english":"I asked her for the provenance.","chinese":"我問她東西的出處。"},{"english":"The article is original, writing is also the strength to live, reference please indicate the source and author.","chinese":"文章原創，寫作也是力氣活，引用請註明出處和作者。"},{"english":"The picture has since appeared on a host of blog sites, without attribution ⑫.","chinese":"這張圖片已在許多博客上出現，卻沒有註明出處。"},{"english":"Self-plagiarism involves copying from one's own work without proper attribution.","chinese":"自我剽竊涉及複製自己的作品而沒有正確註明出處。"},{"english":"Amorphous cloud source element may like clouds also free.","chinese":"浮雲出處元無定，得似浮雲也自由。"},{"english":"Analysis and commentary should be labeled and not misrepresent fact or context.","chinese":"分析語評論應該標明出處，以避免歪曲事實或語境。"},{"english":"Please indicate the source when you quote from my LIVE space. Thank you.","chinese":"引用本網誌內容時請您註明出處，謝謝合作。"}],"related":[{"definition":["to mark\/to indicate"],"pinyin":["biao1 ming2"],"word":"標明"},{"definition":["image\/picture\/photograph\/CL:張|张[zhang1]"],"pinyin":["tu2 pian4"],"word":"圖片"},{"definition":["originality\/creativity\/innovation"],"pinyin":["yuan2 chuang4"],"word":"原創"},{"definition":["copyright"],"pinyin":["ban3 quan2"],"word":"版權"},{"definition":["to plagiarize\/to copy\/to attack the flank or rear of an enemy"],"pinyin":["chao1 xi2"],"word":"抄襲"},{"definition":["to mark out\/to tag\/to put a sign on sth explaining or calling attention to\/to annotate (e.g. a character with its pinyin)"],"pinyin":["biao1 zhu4"],"word":"標注"},{"definition":["this place\/here (literary)"],"pinyin":["ci3 chu4"],"word":"此處"},{"definition":["source (of information etc)\/origin"],"pinyin":["lai2 yuan2"],"word":"來源"},{"definition":["to relate (a story or information)\/to tell or talk about\/to recount\/narration\/telling\/narrative\/account"],"pinyin":["xu4 shu4"],"word":"敘述"},{"definition":["content\/substance\/details\/CL:個|个[ge4],項|项[xiang4]"],"pinyin":["nei4 rong2"],"word":"內容"},{"definition":["editor\/compiler"],"pinyin":["bian1 zhe3"],"word":"編者"},{"definition":["to register\/to annotate\/note\/comment"],"pinyin":["zhu4"],"word":"註"},{"definition":["to edit\/to compile\/editor\/compiler"],"pinyin":["bian1 ji2"],"word":"編輯"},{"definition":["to ask\/to invite\/please (do sth)\/to treat (to a meal etc)\/to request"],"pinyin":["qing3"],"word":"請"},{"definition":["reason\/cause"],"pinyin":["yuan2 you2"],"word":"緣由"},{"definition":["to explain\/to illustrate\/to indicate\/to show\/to prove\/explanation\/directions\/caption\/CL:個|个[ge4]"],"pinyin":["shuo1 ming2"],"word":"說明"}]}