{"definition":["to fund\/to put money into sth\/to invest"],"pinyin":["chu1 zi1"],"simplified":["出资"],"rank":3658.0,"normalized_rank":0.05118016593678732,"fraction":0.00003707393789412492,"cumulative_fraction":0.8186278370418388,"word":"出資","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["resources\/capital\/to provide\/to supply\/to support\/money\/expense"],"pinyin":["zi1"],"word":"資"}],"containing_words":[],"sentences":[{"english":"It actually has a much greater chance of fulfilling our stakeholder's needs.","chinese":"實際上，它還大大增加了滿足出資方需要的機會。"},{"english":"We have decided to invest in some new video-conferencing equipment.","chinese":"我們決定出資購買一些視頻會議設備。"},{"english":"The free shares shall refer to the shares obtained without making contribution.","chinese":"乾股是指未出資而獲得的股份。"},{"english":"to review and verify company regulations of wholly state-owned enterprises financed by the Commission.","chinese":"承辦所出資的國有獨資公司章程的審覈工作。"},{"english":"When there's no profit I can't fund new projects and sign new artists.","chinese":"如果賺不到錢，我無法爲新項目出資，無法簽下新人。"},{"english":"The new dam is a major construction project, funded by the government.","chinese":"新水壩是政府出資建造的一個大工程項目。"},{"english":"Libbey, who died in 1925, endowed the Toledo Museum of Art.","chinese":"1925年逝世的利貝出資成立了託雷多藝術博物館。"},{"english":"Other guilds will offer to set p shop in your cities depending on the govenor and your actions.","chinese":"別的行會將會根據你的政府和義舉來出資建立商店。"},{"english":"For the registration of establishment of an investee company, equities shall not be used for making an initial contribution.","chinese":"被投資公司設立登記的，股權不能作爲其首期出資。"},{"english":"This is a dormitory in Thailand that my mom and dad underwrote. And every year about 30 students.","chinese":"這是在泰國的一個由我的媽媽和爸爸出資的學生寢室。"},{"english":"At the same year should a of the Japanese Jin friend meeting invite, leaving for the day to hold personal calligraphy exhibition.","chinese":"同年應日本晉友會出資邀請，赴日舉行個人書法展。"},{"english":"This study was funded by private industry, including companies that produce the compounds being studied.","chinese":"該研究有私人產業出資，包括生產這些複合物的公司。"},{"english":"Who owns it, or sponsors its development?","chinese":"誰擁有它，或誰爲它的開發出資？"},{"english":"With raid growth of the economy, human capital investment becomes the general trend.","chinese":"隨着經濟的高速發展，人力資本出資已經是大勢所趨。"},{"english":"The foundation is the sole funder of the committee.","chinese":"獨立調查委員會由該基金會獨家出資創建。"},{"english":"Section two analyzes the criterion for the objects of the non-cash contribution.","chinese":"第二部分探討作爲非貨幣出資的財產應符合哪些標準。"}],"related":[{"definition":["to set up\/to establish"],"pinyin":["she4 li4"],"word":"設立"},{"definition":["resources\/capital\/to provide\/to supply\/to support\/money\/expense"],"pinyin":["zi1"],"word":"資"},{"definition":["to inject funds\/to put money into (the market)"],"pinyin":["zhu4 zi1"],"word":"注資"},{"definition":["to purchase (from various places)\/to acquire (a company)"],"pinyin":["shou1 gou4"],"word":"收購"},{"definition":["investment\/to invest"],"pinyin":["tou2 zi1"],"word":"投資"},{"definition":["to raise resources"],"pinyin":["chou2 zi1"],"word":"籌資"},{"definition":["to subsidize\/to provide financial aid\/subsidy"],"pinyin":["zi1 zhu4"],"word":"資助"},{"definition":["equity shares\/stock right"],"pinyin":["gu3 quan2"],"word":"股權"},{"definition":["agreement\/pact\/protocol\/CL:項|项[xiang4]"],"pinyin":["xie2 yi4"],"word":"協議"},{"definition":["to build\/to construct"],"pinyin":["xing1 jian4"],"word":"興建"},{"definition":["to contribute (as a gift)\/to donate\/benefaction"],"pinyin":["juan1 zeng4"],"word":"捐贈"},{"definition":["group\/bloc\/corporation\/conglomerate"],"pinyin":["ji2 tuan2"],"word":"集團"},{"definition":["to allocate funds\/appropriation"],"pinyin":["bo1 kuan3"],"word":"撥款"},{"definition":["100 million"],"pinyin":["yi4"],"word":"億"},{"definition":["funds\/expenditure\/CL:筆|笔[bi3]"],"pinyin":["jing1 fei4"],"word":"經費"},{"definition":["large sum (of money)\/a huge amount"],"pinyin":["ju4 e2"],"word":"巨額"}]}