{"definition":["to express an opinion\/to offer advice"],"pinyin":["chu1 dian3 zi5"],"simplified":["出点子"],"rank":43760.0,"normalized_rank":0.6122591747932786,"fraction":2.6932872156026487e-7,"cumulative_fraction":0.9977052327275764,"word":"出點子","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi3","zi5"],"word":"子"}],"containing_words":[],"sentences":[{"english":"This is probably one of the hardest times to think of ideas.","chinese":"大概目前也是最難想出點子的時候。"},{"english":"How do creative people come up with their ideas?","chinese":"有創造力的人如何想出點子？"},{"english":"ChuDianZi help the Kenyan extension sea conception has herod the birthday of the gift.","chinese":"阿公出點子幫著拓海構思有希的華誕禮物。"},{"english":"They helped Edward with ideas.","chinese":"哈，他們負責幫愛德華出點子。"},{"english":"You do this by giving away free information, give great advice and generally being a nice person.","chinese":"通過提供免費信息，出點子，你逐漸成爲受歡迎的人。"},{"english":"It wants ideas for a new TV programme.","chinese":"它需要爲一個新的電視節目出點子。"}],"related":[]}