{"definition":["to excel the common (idiom); surpassing\/preeminent\/outstanding"],"pinyin":["chu1 lei4 ba2 cui4"],"simplified":["出类拔萃"],"rank":22664.0,"normalized_rank":0.31709876456843844,"fraction":0.000001842237650997584,"cumulative_fraction":0.9804289423316704,"word":"出類拔萃","characters":[{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["kind\/type\/class\/category\/similar\/like\/to resemble"],"pinyin":["lei4"],"word":"類"},{"definition":["to pull up\/to pull out\/to draw out by suction\/to select\/to pick\/to stand out (above level)\/to surpass\/to seize"],"pinyin":["ba2"],"word":"拔"},{"definition":["collect\/collection\/dense\/grassy\/thick\/assemble\/gather"],"pinyin":["cui4"],"word":"萃"}],"containing_words":[],"sentences":[{"english":"Let us have a look at New Jersey's pre-eminent University Town.","chinese":"讓我們看看新澤西出類拔萃的大學城。"},{"english":"I wish you every success in the future, You are worthysuccess.","chinese":"我祝你來日事業成功，出類拔萃，成功當之無愧。"},{"english":"For example: He [father] sent John to the university and was eager to have him distinguish himself.","chinese":"他送約翰上大學，巴望能讓兒子出類拔萃。"},{"english":"Aileen stands out for her incredible versatility as an actress.","chinese":"艾琳多才多藝，是一位出類拔萃的女演員。"},{"english":"In this field he is facile princeps, and has left all competitors behind.","chinese":"在這方面，他是出類拔萃的，使其他的競爭者。"},{"english":"Two CEO biogs stand out from the crowd.","chinese":"有兩家公司執行長的個人小傳出類拔萃。"},{"english":"Quality embodies dignity, An outstanding quality will not embrace any sort of mediocrity .","chinese":"品質體現尊嚴，出類拔萃的品質氣絕平庸。"},{"english":"Every day you have the chance to excel, to stand out, and to be exceptional.","chinese":"每天你都有機會勝人一籌，幹得出色，出類拔萃。"},{"english":"When I told him that i had superlatively technical skills, he simply gave me a horse laugh.","chinese":"當我告訴他我的技術出類拔萃時，他不相信地笑了。"},{"english":"This is for Plato, the political passion par excellence.","chinese":"那就是柏拉圖所謂的激情，出類拔萃的政治激情。"},{"english":"Reading great poets, I walked day and night in the shadow of excellence.","chinese":"常讀大詩人的作品，朝朝夕夕走在出類拔萃的影子裏。"},{"english":"From the beginning, it was evident that this boy was to be drawn to writing and the sound of words.","chinese":"這個孩子從一開始就表現出對寫作和聲韻的出類拔萃。"},{"english":"Professor Jao is also highly accomplished in the realm of the arts.","chinese":"饒教授在藝術領域亦取得出類拔萃的成就。"}],"related":[{"definition":["to envy\/to admire"],"pinyin":["yan4 xian4"],"word":"艷羨"},{"definition":["out of the ordinary"],"pinyin":["fei1 tong2 fan2 xiang3"],"word":"非同凡響"},{"definition":["after hard work and numerous revisions (idiom)\/the vicissitudes of life"],"pinyin":["qian1 chui2 bai3 lian4"],"word":"千錘百鍊"},{"definition":["rare and precious\/valuable\/remarkable"],"pinyin":["nan2 neng2 ke3 gui4"],"word":"難能可貴"},{"definition":["to make a show of being original or unconventional (idiom)"],"pinyin":["biao1 xin1 li4 yi4"],"word":"標新立異"},{"definition":["good and bad people intermingled"],"pinyin":["liang2 you3 bu4 qi2"],"word":"良莠不齊"},{"definition":["to take an alternate route (idiom)\/to find an alternative\/to take a different approach\/to blaze a new trail"],"pinyin":["ling4 pi4 xi1 jing4"],"word":"另闢蹊徑"},{"definition":["lit. only one branch of the tree is thriving (idiom)\/fig. to be in a league of one's own\/outstanding"],"pinyin":["yi1 zhi1 du2 xiu4"],"word":"一枝獨秀"},{"definition":["to have a unique style of one's own (idiom)"],"pinyin":["du2 shu4 yi1 ge2"],"word":"獨樹一格"},{"definition":["composite arts\/multi-media arts"],"pinyin":["zong1 he2 yi4 shu4"],"word":"綜合藝術"},{"definition":["creativity"],"pinyin":["chuang4 xin1 jing1 shen2"],"word":"創新精神"},{"definition":["to rush like ducks (idiom); the mob scrabbles madly for sth unobtainable\/an unruly crowd on a wild goose chase"],"pinyin":["qu1 zhi1 ruo4 wu4"],"word":"趨之若鶩"},{"definition":["original and ingenious (idiom)\/to show great creativity"],"pinyin":["du2 ju4 jiang4 xin1"],"word":"獨具匠心"},{"definition":["fan\/fanatic"],"pinyin":["yong1 dun3"],"word":"擁躉"},{"definition":["to make a contribution\/to establish\/to found\/contribution"],"pinyin":["jian4 shu4"],"word":"建樹"},{"definition":["lit. the stove fire has turned bright green (allusion to Daoist alchemy) (idiom)\/fig. (of an art, a technique etc) brought to the point of perfection"],"pinyin":["lu2 huo3 chun2 qing1"],"word":"爐火純青"}]}