{"definition":["distributed"],"pinyin":["fen1 bu4 shi4"],"simplified":["分布式"],"rank":27655.0,"normalized_rank":0.3869293299567669,"fraction":0.0000011630037532090135,"cumulative_fraction":0.987785722926892,"word":"分佈式","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["variant of 布[bu4]\/to announce\/to spread"],"pinyin":["bu4"],"word":"佈"},{"definition":["type\/form\/pattern\/style"],"pinyin":["shi4"],"word":"式"}],"containing_words":[{"definition":["distributed denial of service (DDOS) form of Internet attack"],"pinyin":["fen1 bu4 shi4 ju4 jue2 fu2 wu4"],"word":"分佈式拒絕服務"},{"definition":["distributed environment (computing)"],"pinyin":["fen1 bu4 shi4 huan2 jing4"],"word":"分佈式環境"},{"definition":["distributed architecture"],"pinyin":["fen1 bu4 shi4 jie2 gou4"],"word":"分佈式結構"},{"definition":["distributed network"],"pinyin":["fen1 bu4 shi4 wang3 luo4"],"word":"分佈式網絡"}],"sentences":[{"english":"The obvious one is the move towards the architecture that are by and large loosely coupled distributed systems.","chinese":"最明顯的一個是邁向架構，是對大松耦合分佈式系統。"},{"english":"A re-engineering framework of legacy system based on distributed environment of J2EE partition is given.","chinese":"給出基於J2EE分佈式環境的遺留系統再工程框架。"},{"english":"ZooKeeper, a coordination service for distributed applications","chinese":"針對分佈式應用程序的協調服務。"},{"english":"The nature of modern war is highly distributed coordination.","chinese":"現代戰爭的特點是高度的分佈式協同作戰。"},{"english":"This establishes entity correspondence between data that is physically distributed.","chinese":"數據之間的實體通信在物理上是分佈式的。"},{"english":"A framework for Distributed Gateway(DG) interworking with H. 323 \/SIP is described.","chinese":"SIP交互作用的分佈式網關的一種框架。"},{"english":"Can I use a non-XA driver in distributed transactions?","chinese":"我能在分佈式事務中使用非XA驅動嗎？"},{"english":"It is an evolution of distributed computing and modular programming.","chinese":"它是分佈式計算和模塊化編程的發展。"},{"english":"Improves the agent ordering strategy in concurrent search for solving distributed CSPs, and combines dynamic agent ordering with concurrent search.","chinese":"併發搜索是求解分佈式約束滿足問題的一個高效算法。"},{"english":"Anycast service is a new service model supporting distributed duplication.","chinese":"選播是一種支持分佈式服務器複製的新的服務模型。"},{"english":"A kind of area traffic control method based on distributed Q-Leaming is presented.","chinese":"提出一種基於分佈式Q學習的區域交通協調控制算法。"},{"english":"Approaches to governance range from centralized to distributed.","chinese":"採取從集中式到分佈式的控制範圍。"},{"english":"In chapter 5, distributed track-to-track fusion algorithms are discussed.","chinese":"第五章研究分佈式航跡融合算法。"},{"english":"A physically-based distributed hydrological model of forest watershed is developed.","chinese":"構建了森林流域基於物理過程的分佈式水文模型。"},{"english":"The Integrated Network Management System Platform (INMS) is a distributed application.","chinese":"綜合網管系統是典型的分佈式應用。"},{"english":"In distributed systems, there can be many servers of a particular type, e.g., multiple file servers or multiple network name servers.","chinese":"在分佈式系統裏，有多種類型的服務器。"}],"related":[]}