{"definition":["molecular sieve"],"pinyin":["fen1 zi3 shai1"],"simplified":["分子筛"],"rank":58665.0,"normalized_rank":0.8207994627341794,"fraction":5.08002141479524e-8,"cumulative_fraction":0.9997532582506654,"word":"分子篩","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi3","zi5"],"word":"子"},{"definition":["to filter\/to sift\/to sieve"],"pinyin":["shai1"],"word":"篩"}],"containing_words":[],"sentences":[{"english":"The molecular sieve pretreated by alkali can improve the stability of catalysts obviously.","chinese":"分子篩預先經鹼處理，能夠明顯改善催化劑穩定性。"},{"english":"USY zeolite was modified by HF.","chinese":"對USY分子篩進行HF改性實驗。"},{"english":"Studies on nano-zeolite membranes as well as their application are reviewed.","chinese":"概述了納米分子篩膜研究及其應用的現狀。"},{"english":"The molybdosilicate blue spectrophotometric method for the determination of silicon content in zeolite molecular sieves was proposed.","chinese":"提出了沸石分子篩中硅含量測定的硅鉬藍光度法。"},{"english":"The preparation of zeolite 4A membrane can be as follows.","chinese":"本文研究的對象是4A型分子篩膜。"},{"english":"The adsorption mechanism of 13X molecular sieve was preliminary investigated.","chinese":"初步探討了13X分子篩對鎘的吸附機理。"},{"english":"The application of VPT\/DGC in the preparation of shaped zeolite molecular sieves was also introduced.","chinese":"並且對氣相法制備分子篩成型體作了簡單介紹。"},{"english":"Absorptivity of A molecular sieve and comparision of their measurement methods.","chinese":"分子篩吸附性能及其測定方法的比較。"},{"english":"Also described in the article is MWW zeolite′s stability to heat, acid and alkali.","chinese":"介紹了MWW族分子篩的耐熱穩定性和酸鹼穩定性。"},{"english":"The invention discloses a coal-based carbon molecular sieve and a preparation method thereof.","chinese":"本發明公開了一種煤基碳分子篩及其製備方法。"},{"english":"The proposal on dealing with the residual LPG in deodorization tower and conservation of molecular sieve is given.","chinese":"對脫臭塔內殘存液的處理和分子篩的儲存提出了建議。"},{"english":"The surface of molecular sieves showed an agglomeration of pillar-shaped crystals.","chinese":"合成出的分子篩爲柱狀晶片的團狀聚集體。"},{"english":"Molecular sieving appears to contribute to the gas permeation.","chinese":"碳膜分離氣體的機理主要爲分子篩分。"},{"english":"Presently the condition of most researches about molecular- sieves work at normal temperature and ordinary pressure.","chinese":"目前對於分子篩吸附特性的研究集中在常壓環境。"},{"english":"The molecular sieve bed requires periodic regeneration with hot nitrogen.","chinese":"分子篩牀層需要定期用熱氮再生。"},{"english":"The invention silicon phosphoric acid aluminum molecular sieve which has AEL structure and the manufacturing method.","chinese":"一種具有AEL結構的硅磷酸鋁分子篩及其製備方法。"}],"related":[]}