{"definition":["to split apart\/differentiation"],"pinyin":["fen1 hua4"],"simplified":["分化"],"rank":8468.0,"normalized_rank":0.11847830649336115,"fraction":0.000010884967724586836,"cumulative_fraction":0.9151369573707722,"word":"分化","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"}],"containing_words":[{"definition":["polarization"],"pinyin":["liang3 ji2 fen1 hua4"],"word":"兩極分化"}],"sentences":[{"english":"For degree of differentiation, Shitanhu population is higher than that of Gutang population.","chinese":"分化程度石潭湖羣體高於古塘羣體。"},{"english":"The president's left-of-centre programme threatens to polarise Congress.","chinese":"總統的激進計劃使國會發生了兩極分化。"},{"english":"With the development of detective methods, the concept of transdifferentiation is being accepted by people.","chinese":"隨着檢測手段的進步，轉分化正逐漸被人們認同。"},{"english":"The spermatid differentiation can be divided into five stages.","chinese":"精細胞的分化可分爲五個時期。"},{"english":"Self-publishing these days is increasingly a tale of two cities.","chinese":"今自助出版越來越呈現兩極分化的趨勢。"},{"english":"The N6 macroelementsand the MS microelements were advantageous to callus formation.","chinese":"N6大量元素和MS微量元素有利於愈傷組織的分化。"},{"english":"There are no or faint enzyme reaction products in low differentiated adenocarcinoma.","chinese":"低分化腺癌上述酶大都無反應或反應微弱。"},{"english":"The results of RAPD analysis suggest that the genus Agkistrodon is a highly differentiated group.","chinese":"RAPD分析結果提示蝮屬是一個高度分化的類羣。"},{"english":"Usually, the plasma cells are differentiated enough to retain the function of immunoglobulin production.","chinese":"通常漿細胞分化成熟，具有產生免疫球蛋白的功能。"},{"english":"This cell differentiation process begins at about the time that the embryo settles into the uterus.","chinese":"這一細胞分化過程開始於胚胎在子宮定植的時刻。"},{"english":"Green bud was produced on the medium for differentiation.","chinese":"在分化培養基上，由愈傷組織誘導出綠芽點。"},{"english":"Serum-free hormone-supplemented medium could promote cell multiplication and differentiation.","chinese":"無血清培養基能促進細胞增殖，分化和成熟。"},{"english":"Effect of lutein on the differentiation of osteoclast induced from bone marrow were studied in vitro.","chinese":"研究葉黃素對體外破骨細胞分化的影響。"},{"english":"Both R3 and R4 had no significant effect on enhancing the growth and differentiation of D.","chinese":"R3和R4對華石斛生長和分化無明顯的促進效果。"},{"english":"Besides, the shape and size of neurons within the telencephalon are in poor differentiation.","chinese":"此外，亞成體端腦內細胞形態和大小分化較爲單一。"},{"english":"Business history split off from economic history in the U. S. A. in 1920s.","chinese":"在20年代美國又將企業史從經濟史中分化出來。"}],"related":[{"definition":["to vibrate\/to shake\/to shudder"],"pinyin":["zhen4 dang4"],"word":"震蕩"},{"definition":["to wither\/to dry up (of a plant)\/to atrophy (of muscle, social custom etc)"],"pinyin":["wei3 suo1"],"word":"萎縮"},{"definition":["vulnerable\/weak"],"pinyin":["ruo4 shi4"],"word":"弱勢"},{"definition":["weight (i.e. importance attached to sth)"],"pinyin":["quan2 zhong4"],"word":"權重"},{"definition":["posture\/situation"],"pinyin":["tai4 shi4"],"word":"態勢"},{"definition":["tired\/weak\/exhausted"],"pinyin":["pi2 ruo4"],"word":"疲弱"},{"definition":["to split up\/to divide\/to break up\/fission\/schism"],"pinyin":["fen1 lie4"],"word":"分裂"},{"definition":["to fall back\/to return to low level after a rise (in water level, price etc)"],"pinyin":["hui2 luo4"],"word":"回落"},{"definition":["short term\/short-term"],"pinyin":["duan3 qi1"],"word":"短期"},{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"word":"反彈"},{"definition":["to slow down\/to ease up\/to abate\/slowdown\/downturn"],"pinyin":["qu1 huan3"],"word":"趨緩"},{"definition":["vibration\/oscillation"],"pinyin":["zhen4 dang4"],"word":"振蕩"},{"definition":["large fall"],"pinyin":["da4 die1"],"word":"大跌"},{"definition":["expansion\/dilation\/to expand (e.g. one's power or influence)\/to broaden"],"pinyin":["kuo4 zhang1"],"word":"擴張"},{"definition":["tendency\/trend\/path"],"pinyin":["zou3 shi4"],"word":"走勢"},{"definition":["structural\/structured"],"pinyin":["jie2 gou4 xing4"],"word":"結構性"}]}