{"definition":["branch"],"pinyin":["fen1 zhi1"],"simplified":["分枝"],"rank":46453.0,"normalized_rank":0.6499377387265121,"fraction":2.068502972633579e-7,"cumulative_fraction":0.998342811179652,"word":"分枝","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["branch\/classifier for sticks, rods, pencils etc"],"pinyin":["zhi1"],"word":"枝"}],"containing_words":[],"sentences":[{"english":"Objective To explore the value of acid-fast stain test of mycobacterium tuberculosis in the diagnosis of pulmonary tuberculosis.","chinese":"目的瞭解結核分枝桿菌抗酸染色對肺結核的診斷價值。"},{"english":"The shrimp hepatopancreas consists of a lot of epithelial tubules which are symmetrical.","chinese":"肝胰腺由兩側對稱的分枝上皮小管組成。"},{"english":"The prothalli are saprophytic, irregularly branched, subterranean bodies .","chinese":"原葉體是腐生的，不規則分枝的地下體。"},{"english":"Seen here are branching hyphae of Aspergillus invading a cerebral vessel.","chinese":"圖示麴黴菌的分枝狀菌絲正侵入腦血管。"},{"english":"A branch-and bound method is developed to solve the proposed model.","chinese":"設計了基於分枝定界法的算法來求解該模型。"},{"english":"Panicle branches proximally smooth or sparsely scabrid angled.","chinese":"圓錐花序分枝下部的平滑的或疏生粗糙的有棱。"},{"english":"Plants many branched, forming a compact cushion of leafy shoots.","chinese":"植株多分枝，形成一個葉狀枝的小型墊。"},{"english":"The sputum acid-fast stain showed positive (one plus) and the culture yielded nontuberculous mycobacterium.","chinese":"痰液抗酸性塗片爲陽性且培養結果爲非結核分枝桿菌。"},{"english":"Conclusion: Among the six ingredient of Croton oil, The 5th part has the best effect on killing Mycobacterium tuberculosis in vitro.","chinese":"巴豆油抗結核分枝桿菌作用的主要成分爲第5組份。"},{"english":"In such cases suitable feathers should be retained or left unpruned .","chinese":"在這種情況下，應該保留合適的分枝不行修剪。"},{"english":"Objective To evaluate the effect of nine fluoroquinolones against mycobacteria .","chinese":"目的研究氟喹諾酮類藥物抗分枝桿菌的作用。"},{"english":"Each branch of the tree corresponds to a facet of the metadata.","chinese":"樹的每個分枝都對應於元數據的一個方面。"},{"english":"Batsch cv. Elberta) were compared with different pruning measures.","chinese":"不同母枝上的分枝模式進行了比較研究。"},{"english":"Sichuan Grain Storage Institute, Ministry of commerce The stored product mites is one of the three breaches in acarology.","chinese":"儲藏物蟎類是蜱蟎學三大分枝學科之一。"},{"english":"It is also very easy to add new information on lines anywhere in the map.","chinese":"這樣非常易於添加新的信息到思維腦圖的分枝上。"},{"english":"The cultivar has ramose crown and upright tree appearance.","chinese":"樹冠分枝形，樹姿直立。"}],"related":[{"definition":["stem\/stalk"],"pinyin":["jing1 gan1"],"word":"莖干"},{"definition":["axillary bud\/bud growing from axil of plant"],"pinyin":["ye4 ya2"],"word":"腋芽"},{"definition":["branch\/twig\/stem"],"pinyin":["zhi1 tiao2"],"word":"枝條"},{"definition":["(botany) stolon"],"pinyin":["pu2 fu2 jing1"],"word":"匍匐莖"},{"definition":["lateral root (botany)"],"pinyin":["ce4 gen1"],"word":"側根"},{"definition":["terminal bud (growing at the tip of a plant)"],"pinyin":["ding3 ya2"],"word":"頂芽"},{"definition":["petiole\/leafstalk"],"pinyin":["ye4 bing3"],"word":"葉柄"},{"definition":["aerial root (botany)"],"pinyin":["qi4 sheng1 gen1"],"word":"氣生根"},{"definition":["stem of flower"],"pinyin":["hua1 geng3"],"word":"花梗"},{"definition":["inflorescence\/flower cluster"],"pinyin":["hua1 xu4"],"word":"花序"},{"definition":["fibrous roots"],"pinyin":["xu1 gen1"],"word":"須根"},{"definition":["axillary bud"],"pinyin":["ce4 ya2"],"word":"側芽"},{"definition":["plant (horticulture)"],"pinyin":["zhi2 zhu1"],"word":"植株"},{"definition":["branches and tendrils\/fig. overcomplicated or digressive"],"pinyin":["zhi1 man4"],"word":"枝蔓"},{"definition":["stalk\/stem\/CL:條|条[tiao2]"],"pinyin":["jing1"],"word":"莖"},{"definition":["tendril"],"pinyin":["juan3 xu1"],"word":"捲鬚"}]}