{"definition":["to scatter\/to disperse\/to distribute"],"pinyin":["fen1 san4"],"simplified":["分散"],"rank":4802.0,"normalized_rank":0.06718621017726974,"fraction":0.00002539937718584189,"cumulative_fraction":0.8540467359281265,"word":"分散","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["scattered\/loose\/to come loose\/to fall apart\/leisurely\/powdered medicine","to scatter\/to break up (a meeting etc)\/to disperse\/to disseminate\/to dispel\/(coll.) to sack"],"pinyin":["san3","san4"],"word":"散"}],"containing_words":[{"definition":["distributed"],"pinyin":["fen1 san4 shi4"],"word":"分散式"},{"definition":["fiber distributed data interface\/FDDI"],"pinyin":["guang1 xian1 fen1 san4 shi4 zi1 liao4 jie4 mian4"],"word":"光纖分散式資料介面"},{"definition":["(music) arpeggio"],"pinyin":["fen1 san4 he2 xian2"],"word":"分散和弦"},{"definition":["diffused strategy"],"pinyin":["fen1 san4 de5 ce4 lu:e4"],"word":"分散的策略"}],"sentences":[{"english":"For Lutfi, we scattered his ashes in the canal.","chinese":"對於陸，我們分散他的骨灰在運河。"},{"english":"A water-base drilling fluid that contains dispersed oil or synthetic hydrocarbon as an internal phase.","chinese":"分散的油滴或合成烴爲內相的水基鑽井液。"},{"english":"Corexit 9500 was found to be one of the most toxic dispersal agents ever developed.","chinese":"被發現是有史以來生產的最具毒性的分散劑之一。"},{"english":"The existence of the particle movement, increase block medium dispersion medium viscosity.","chinese":"粒子的存在阻礙介質的運動，增加分散介質的黏度。"},{"english":"After the dam was completed, the undisturbed soil samples from the dam were non-dispersive by some experiments.","chinese":"大壩建成後的壩體原狀土樣屬於非分散性粘土。"},{"english":"This feature is highly desirable for distributed systems with fault-tolerance consideration.","chinese":"此特性是分散系統考慮容錯功能時非常重要的需求。"},{"english":"But Putin has deftly managed the windfall and spread the wealth enough so that people feel hopeful.","chinese":"普京確實致力於將財富分散，所以人們覺得有盼頭。"},{"english":"Objective To prepare apigenin (AP) solid dispersion and measure its dissolution in vitro.","chinese":"目的製備芹菜素固體分散體，並檢測其體外溶出度。"},{"english":"You cound say more fragmented for a while.","chinese":"你可以說一段時間內會更加分散。"},{"english":"Break your concentration and the ball descends.","chinese":"你注意力一旦分散，小球就會下降。"},{"english":"Remove ambition and the essential elements of society seem to fly apart .","chinese":"沒有雄心，組成社會的諸要素就會分散開來。"},{"english":"To observe and compare the antithrombotic effects of myricetin dispersible tablets and myricetin dripping pills.","chinese":"觀察並比較楊梅素滴丸與楊梅素分散片的抗血栓作用。"},{"english":"He distracted her with talk.","chinese":"他用談話分散她的注意力。"},{"english":"Unique peace and quiet dispersant and antioxidant.","chinese":"獨特的清淨分散劑和抗氧化劑。"},{"english":"The next stage of our analysis is to determine the dispersion of our dataset.","chinese":"分析的下一步是決定數據集的分散度。"},{"english":"Objective To study the antiulcer activities of almagate.","chinese":"目的研究鋁鎂加分散片的抗潰瘍作用。"}],"related":[{"definition":["to concentrate\/to centralize\/to focus\/centralized\/concentrated\/to put together"],"pinyin":["ji2 zhong1"],"word":"集中"},{"definition":["scattered"],"pinyin":["ling2 san3"],"word":"零散"},{"definition":["to shift\/to divert or distract (attention etc)\/to change\/to transform\/metastasis (medicine)\/to evacuate (people)"],"pinyin":["zhuan3 yi2"],"word":"轉移"},{"definition":["to break up the whole into pieces (idiom); dealing with things one by one\/divide and conquer"],"pinyin":["hua4 zheng3 wei2 ling2"],"word":"化整為零"},{"definition":["to scatter\/to distribute\/to be distributed (over an area etc)\/(statistical, geographic) distribution"],"pinyin":["fen1 bu4"],"word":"分佈"},{"definition":["to gather together"],"pinyin":["ju4 long3"],"word":"聚攏"},{"definition":["to assemble\/to gather"],"pinyin":["ju4 ji2"],"word":"聚集"},{"definition":["attention"],"pinyin":["zhu4 yi4 li4"],"word":"注意力"},{"definition":["to come together (to form sth)\/to assemble together\/(chemistry) to polymerize"],"pinyin":["ju4 he2"],"word":"聚合"},{"definition":["every place"],"pinyin":["ge4 chu4"],"word":"各處"},{"definition":["concentrated\/crowded together\/intensive\/compressed"],"pinyin":["mi4 ji2"],"word":"密集"},{"definition":["overwhelming majority"],"pinyin":["jue2 da4 bu4 fen5"],"word":"絕大部分"},{"definition":["to scatter\/to break sth up\/to beat (an egg)"],"pinyin":["da3 san4"],"word":"打散"},{"definition":["to compress\/compression"],"pinyin":["ya1 suo1"],"word":"壓縮"},{"definition":["to transfer\/to maneuver (troops etc)\/movement of personnel\/to mobilize\/to bring into play"],"pinyin":["diao4 dong4"],"word":"調動"},{"definition":["to spread\/to proliferate\/to diffuse\/spread\/proliferation\/diffusion"],"pinyin":["kuo4 san4"],"word":"擴散"}]}