{"definition":["branch (of company, river etc)\/to branch\/to diverge\/to ramify\/to subdivide"],"pinyin":["fen1 zhi1"],"simplified":["分支"],"rank":6634.0,"normalized_rank":0.09281826703790244,"fraction":0.000015968784557680483,"cumulative_fraction":0.8909021504240546,"word":"分支","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["surname Zhi","to support\/to sustain\/to erect\/to raise\/branch\/division\/to draw money\/classifier for rods such as pens and guns, for army divisions and for songs or compositions"],"pinyin":["Zhi1","zhi1"],"word":"支"}],"containing_words":[],"sentences":[{"english":"A blindly ending branch of the alimentary canal or other organ.","chinese":"消化道或其他器官分支的盲端。"},{"english":"This branch is obsoleted. Engineering resource will no longer be invested on this branch in general.","chinese":"此分支已淘汰，除特殊狀況人力不再投注於此版上。"},{"english":"In this paper , the structure of macromaterialogy is discussed and the branching of technological sciences is considered.","chinese":"本文討論宏觀材料學的結構，並思考技術科學的分支。"},{"english":"Its distinctly toothed leaves are carried on branching stems.","chinese":"在其分支的莖杆上，掛滿了非常顯眼的鋸齒狀樹葉。"},{"english":"For arteriosus truncus and its branches, ultrasonography detection is not difficult.","chinese":"主幹帶小分支型皮瓣軸心動脈超聲顯像不難。"},{"english":"This is the brief summary about the recent study progress on the secretion proteins of Mycobacteria .","chinese":"對近年來分支桿菌分泌蛋白研究進展進行了簡要綜述。"},{"english":"A. ussuriensis is identified as the most basal lineage of the genus Agkistrodon from China.","chinese":"烏蘇裏蝮是中國蝮屬蛇類最基部的分支。"},{"english":"Whenever necessary, an equity joint venture may set up affiliated agencies outside China.","chinese":"合營企業需要時可在中國境外設立分支機構。"},{"english":"The urban esthetics history, a branch of esthetics, whose content covers widely.","chinese":"城市美學是一門內容涵蓋面十分廣泛的美學分支。"},{"english":"Occultism is a general term referring to many branches of thought and practice.","chinese":"神祕學神祕學是對有關思維和修煉的許多分支的總稱。"},{"english":"Of, relating to, or characteristic of a hydroid.","chinese":"具有細弱分支軟水母亞目水螅體的一個屬。"},{"english":"Branch out of exception handler block.","chinese":"從例外處理常式區塊分支出來。"},{"english":"Research on trusted software is one of the branches of trusted computing.","chinese":"軟件可信性研究是可信計算的一個分支。"},{"english":"Yesterday we went to COSI, a hands on Science Center.","chinese":"昨天我們去了COSI，科技中心的一個分支。"},{"english":"But we usually mean by it the immediate, the nuclear family, with some extension.","chinese":"但通常都是指直系親屬，核心家庭，少量分支。"},{"english":"There's a branch of mathematics that is based on lunacy, and that's wonderful.","chinese":"有這麼一個基於精神失常的數學分支實在是太奇妙了。"}],"related":[{"definition":["trunk\/main\/core"],"pinyin":["zhu3 gan4"],"word":"主幹"},{"definition":["origin\/to originate\/to come from"],"pinyin":["qi3 yuan2"],"word":"起源"},{"definition":["to scatter\/to distribute\/to be distributed (over an area etc)\/(statistical, geographic) distribution"],"pinyin":["fen1 bu4"],"word":"分佈"},{"definition":["mutation\/variety\/variant"],"pinyin":["bian4 zhong3"],"word":"變種"},{"definition":["ethnic group\/community"],"pinyin":["zu2 qun2"],"word":"族群"},{"definition":["sect"],"pinyin":["jiao4 pai4"],"word":"教派"},{"definition":["to extend\/to expand\/extension\/expansion"],"pinyin":["kuo4 zhan3"],"word":"擴展"},{"definition":["pedigree"],"pinyin":["pu3 xi4"],"word":"譜系"},{"definition":["to evolve\/evolution"],"pinyin":["yan3 hua4"],"word":"演化"},{"definition":["clan"],"pinyin":["shi4 zu2"],"word":"氏族"},{"definition":["to migrate\/to move"],"pinyin":["qian1 yi2"],"word":"遷移"},{"definition":["part\/component\/ingredient\/constituent"],"pinyin":["zu3 cheng2 bu4 fen4"],"word":"組成部分"},{"definition":["to give rise to\/to derive\/derivative\/derivation"],"pinyin":["yan3 sheng1"],"word":"衍生"},{"definition":["variant"],"pinyin":["bian4 ti3"],"word":"變體"},{"definition":["secondary"],"pinyin":["ci4 ji2"],"word":"次級"},{"definition":["to be collectively called\/collective term\/general designation"],"pinyin":["tong3 cheng1"],"word":"統稱"}]}