{"definition":["horizontal line (in a fraction)\/minimum passing score"],"pinyin":["fen1 shu4 xian4"],"simplified":["分数线"],"rank":8159.0,"normalized_rank":0.11415499559274132,"fraction":0.00001155777860679348,"cumulative_fraction":0.9116689788595778,"word":"分數線","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"}],"containing_words":[],"sentences":[{"english":"Overseas Chinese Xiamen engineering college of university enrolls new students in 2009 the fractional line is many?","chinese":"華僑大學廈門工學院2009年招生分數線是多少？"},{"english":"Usually higher ranked ones need higher scores.","chinese":"一般情況下，類別較高的錄取分數線也高。"},{"english":"He just passed the university's minimum qualifications.","chinese":"他剛剛過大學的錄取分數線。"},{"english":"For those whose English is prominent, BNUZ will relax restrictions on the admission line requirements accordingly.","chinese":"對英語成績突出者，可適當放寬錄取分數線要求。"},{"english":"Is that northeast China finance and economics learns the liberal arts admission line enthusiastically in 2009 a number?","chinese":"2009年東北財經大學文科的錄取分數線是多少啊？"},{"english":"Information Engineering School in Luoyang Railway score how much?","chinese":"洛陽鐵路信息工程學校分數線多少？"},{"english":"Finally, the article discusses how to set the qualified score in criteria-reference test.","chinese":"探討了標準參照測驗合格分數線的劃分方法。"},{"english":"China University of Geosciences art college admission scores are how much?","chinese":"中國地質大學美術高考錄取分數線是多少？"},{"english":"Suzhou laboratory middle school in 2009 admission line number?","chinese":"2009年蘇州實驗中學錄取分數線多少？"},{"english":"In general, the graduate division requires a TOEFL score of at least 575.","chinese":"總的來說，研究生分數線要求託福分數至少575分。"},{"english":"Specific scores, candidates can log China Graduate Enrollment Information Network enquiries.","chinese":"具體分數線，考生可登錄中國研究生招生信息網查詢。"},{"english":"Are one three Xiang Fan City middle middle admission lines in 2009 numbers?","chinese":"襄樊一中三中2009年的錄取分數線是多少？"},{"english":"Dalian east soft information academy admission line is many?","chinese":"大連東軟信息學院的錄取分數線是多少啊？"},{"english":"How to decide the Admission (Passing) Point?","chinese":"如何劃定外國學生的錄取分數線？"},{"english":"Set the score required before a mail is considered spam.","chinese":"設定一個郵件被判定爲垃圾郵件的分數線。"}],"related":[]}