{"definition":["to divide (and give to others)"],"pinyin":["fen1 gei3"],"simplified":["分给"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"分給","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["to supply\/to provide","to\/for\/for the benefit of\/to give\/to allow\/to do sth (for sb)\/(grammatical equivalent of 被)\/(grammatical equivalent of 把)\/(sentence intensifier)"],"pinyin":["gei3","ji3"],"word":"給"}],"containing_words":[],"sentences":[{"english":"Our head teacher has shared the cake among all the students at the party.","chinese":"我們的班主任老師在晚會上把蛋糕分給每個學生。"},{"english":"He weighed out half pound of coffee beans to them.","chinese":"他稱出半斤咖啡豆分給他們。"},{"english":"Distribute it to others form dawn to duck, starting form the person closest to you.","chinese":"從早到晚地分給別人，從你身邊最近的人分起。"},{"english":"He divided the cake among the children.","chinese":"他把這個餅子分給孩子們。"},{"english":"The cook served out tins of food to all the mountaineers.","chinese":"炊事員把罐頭食品分給所有登山隊員。"},{"english":"This is my advice. Give a glittering scale to each of the other fish.","chinese":"我建議你把你的閃光鱗，分給每條魚一片。"},{"english":"He agreed to divide the prize between Tom and Ann.","chinese":"他同意把這筆獎金分給湯姆和安兩個人。"},{"english":"You can hive off some of the work to us if necessary.","chinese":"如果必要的話，你可以把部分工作分給我們做。"},{"english":"She portioned out the money equally between both children.","chinese":"她把錢均分給兩個孩子。"},{"english":"In Joppa, Dorcas distributed garments to the poor.","chinese":"在約帕，多加把衣服分給貧窮的人。"},{"english":"The general cantoned out the country to his men.","chinese":"將軍把那個國家劃分成小分給他的部下。"},{"english":"4，Enquiries are so large that we can only than allot you 200 cases.","chinese":"詢盤如此之多，我們只能分給你們200箱貨。"},{"english":"Xuan gave his ex-wife half of their property, and she got custody of their child.","chinese":"宣分給他的前妻一半財產，還把孩子的監護權給了她。"},{"english":"Mrs. Simpson gave him the first dish.","chinese":"辛普森太太第一個將湯分給了他。"},{"english":"Selling their possessions and goods, they gave to anyone as he had need.","chinese":"並且賣了田產家業，照各人所需用的分給各人。"},{"english":"The new rulers took farms from the landlords and gave them to the tenants.","chinese":"新的政府從地主手中取得了田土，並把它們分給佃戶。"}],"related":[]}