{"definition":["to explain the facts\/to defend against an accusation"],"pinyin":["fen1 bian4"],"simplified":["分辩"],"rank":44260.0,"normalized_rank":0.6192548234997831,"fraction":2.566286680232768e-7,"cumulative_fraction":0.997836626751584,"word":"分辯","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["to dispute\/to debate\/to argue\/to discuss"],"pinyin":["bian4"],"word":"辯"}],"containing_words":[],"sentences":[{"english":"Maybe she would be crying and would push him away when he tried to explain to her.","chinese":"她也許還會哭着一把將他推開，不容他分辯。"},{"english":"I believe it is important to separate good failures from bad failures.","chinese":"我認爲分辯精采的失蹤敗與欠好的失蹤敗很主要。"},{"english":"In addition, many resolution styles are provided.","chinese":"此外，還提供了許多分辯率樣式。"},{"english":"Baiyuneboite-(Ce) was studied by electron diffraction and high resolution electron microscopy.","chinese":"用電子衍射和高分辯電子顯微術研究了白雲鄂博礦。"},{"english":"Examples include the display output and resolution.","chinese":"例如顯示輸出和分辯率。"},{"english":"Now you have to set the resolution by moving the big slider.","chinese":"現在您可以拖動較大的那個滾動條開設置分辯率了。"},{"english":"The variation of FWHM of resolution function with neutron energy is discussed.","chinese":"討論了分辯函數半寬度隨中子能量變化的規律。"},{"english":"Virtuous acyions of the past produce Viveka and Vairagya.","chinese":"過往的善行使人擁有分辯智與離欲心。"}],"related":[]}