{"definition":["catabolism (biology)\/metabolic breaking down and waste disposal\/dissimilation"],"pinyin":["fen1 jie3 dai4 xie4"],"simplified":["分解代谢"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"分解代謝","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","surname Xie","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","to transport under guard"],"pinyin":["Xie4","jie3","jie4","xie4"],"word":"解"},{"definition":["to substitute\/to act on behalf of others\/to replace\/generation\/dynasty\/age\/period\/(historical) era\/(geological) eon"],"pinyin":["dai4"],"word":"代"},{"definition":["surname Xie","to thank\/to apologize\/to wither (of flowers, leaves etc)\/to decline"],"pinyin":["Xie4","xie4"],"word":"謝"}],"containing_words":[],"sentences":[{"english":"But this kind of catabolism mainly concentrates on the banana skin.","chinese":"而這種分解代謝主要集中在香蕉皮上。"},{"english":"Raise blood sugar, stimulate catabolism, the hormone that mobilizes nutriment.","chinese":"升血糖，促進分解代謝，爲營養物質動員激素。"},{"english":"Uric acid as the end-product of purine metabolism in human body is excreted through kidney.","chinese":"尿酸是人體嘌呤鹼基分解代謝終產物，經腎臟排泄。"},{"english":"Both anabolism and catabolism are necessary for survival and good health.","chinese":"合成和分解代謝在對於身體健康很重要。"},{"english":"These processes are called anabolism and catabolism.","chinese":"這些過程叫作合成代謝和分解代謝。"},{"english":"A second experiment was designed to look for signs of catabolism.","chinese":"第二個設計的實驗是企圖尋找分解代謝的跡象。"},{"english":"When the banana is mature, the chlorophyll starts to decompose, this process is called the catabolism .","chinese":"當香蕉成熟時，葉綠素開始分解，此過程叫分解代謝。"}],"related":[]}