{"definition":["cent\/penny"],"pinyin":["fen1 qian2"],"simplified":["分钱"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"分錢","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["coin\/money\/CL:筆|笔[bi3]\/unit of weight, one tenth of a tael 兩|两[liang3]","surname Qian"],"pinyin":["Qian2","qian2"],"word":"錢"}],"containing_words":[{"definition":["nothing for nothing\/you get what you pay for"],"pinyin":["yi1 fen1 qian2 yi1 fen1 huo4"],"word":"一分錢一分貨"},{"definition":["high quality at bargain price"],"pinyin":["yi1 fen1 qian2 liang3 fen1 huo4"],"word":"一分錢兩分貨"}],"sentences":[{"english":"I got bupkis for my bonus.","chinese":"我一分錢獎金也沒拿到。"},{"english":"Smile the most is the wisdom of goods does not spend a single penny for advertising.","chinese":"微笑最高明之處就是不花一分錢爲商品做廣告。"},{"english":"I have one cent, he said. It is an American coin.","chinese":"他心想，我有一分錢呢，一枚美元硬幣。"},{"english":"Her mother used to keep track of every penny she spent.","chinese":"她母親從前把自己所花的每一分錢都記下來。"},{"english":"But there is fierce competition for each movie dollar.","chinese":"但是，影片的每分錢都競爭非常激劇。"},{"english":"He turned all his pockets inside out but found no cent whatever.","chinese":"他把所有口袋都翻了出來，但一分錢都沒找到。"},{"english":"No one is a hero in the plight.","chinese":"一分錢憋倒英雄漢。"},{"english":"A man money is no man at all.","chinese":"一分錢難倒英雄漢。"},{"english":"Bill is such a penny pincher . He never gives a cent to charity.","chinese":"比爾是個吝嗇鬼，從未爲慈善事業捐過一分錢。"},{"english":"But still, you get what you pay for, as the price always reflects the quality.","chinese":"不過，一分錢一分貨，價格總是能夠反映質量。"},{"english":"He wanted to nickel me up for another hot dog.","chinese":"他想花5分錢讓我再給他一個“熱狗”喫。"},{"english":"The salesman won't bate a penny of it.","chinese":"售貨員一分錢也不肯減少。"},{"english":"I didn't get any money, but my molar is wrapped in gauze.","chinese":"我一分錢都沒得到，但我的大牙卻給紗布包起來了。"},{"english":"\"A penny for your thoughts,\" I said.","chinese":"給你一分錢，告訴我你在想什麼？"},{"english":"Without money, even a hero will be driven against the wall.","chinese":"一分錢也能難倒英雄漢。"},{"english":"Some online shop owners have admitted they have never paid taxes before.","chinese":"據悉，有些店主承認，過去從未交過一分錢的稅款。"}],"related":[]}