{"definition":["separately\/severally\/parted hair"],"pinyin":["fen1 tou2"],"simplified":["分头"],"rank":17292.0,"normalized_rank":0.2419375148657535,"fraction":0.0000031821662879632594,"cumulative_fraction":0.967361478581499,"word":"分頭","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"}],"containing_words":[{"definition":["regular men's haircut\/short back and sides"],"pinyin":["san1 fen1 tou2"],"word":"三分頭"},{"definition":["part (in one's hair)"],"pinyin":["fen1 tou2 lu4"],"word":"分頭路"}],"sentences":[{"english":"We stand for independent management of export and import transactions under unified leadership.","chinese":"我們主張分頭經營，統一領導。"},{"english":"Steve had been meeting with the bankers in separate groups .","chinese":"史蒂夫分頭去和一批批的銀行家會晤。"},{"english":"Oriental white back to the inn, Li found three in, and Tian Kui split up.","chinese":"東方白回到客棧，發現李三不在，與田奎分頭行動。"},{"english":"The race started and both men sped off in their chariots.","chinese":"比賽開始了，兩個人分頭趕着車飛快地跑着。"},{"english":"Forty people showed up. And they all had something to do.","chinese":"最後來了四十人，大家分頭忙碌着。"},{"english":"Let's go about the work separately.","chinese":"這事咱們分頭去做吧。"},{"english":"Groups of riders peel off in different directions.","chinese":"一羣羣的騎士們分頭向各個方向前進。"},{"english":"The employees dispersed for the holidays.","chinese":"僱員們都分頭度假去了。"},{"english":"Okay. I suggest we act separately.","chinese":"嗯，好，不如我們分頭行動吧。"},{"english":"Ponytails are out but side-partings and Elvis quiffs are in.","chinese":"馬尾辮“過時”，偏分頭和短髮受推崇。"},{"english":"Also separately buy a laboratory powders, films and film into a bundle of newsprint.","chinese":"又分頭去買了洗印藥粉，電影膠片和成捆的白報紙。"},{"english":"As your strike force grows you can split it into multiple groups to speed up the razing process.","chinese":"隨着你部隊的增長，你可以派部隊分頭去拆房子。"}],"related":[]}