{"definition":["lit. to take different roads and urge the horses on (idiom)\/fig. to part ways"],"pinyin":["fen1 dao4 yang2 biao1"],"simplified":["分道扬镳"],"rank":23592.0,"normalized_rank":0.3300826885677109,"fraction":0.000001686917456016488,"cumulative_fraction":0.9820642619517884,"word":"分道揚鑣","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"},{"definition":["abbr. for 揚州|扬州[Yang2 zhou1]\/surname Yang","to raise\/to hoist\/the action of tossing or winnowing\/scattering (in the wind)\/to flutter\/to propagate"],"pinyin":["Yang2","yang2"],"word":"揚"},{"definition":["horsebit\/variant of 鏢|镖[biao1]"],"pinyin":["biao1"],"word":"鑣"}],"containing_words":[],"sentences":[{"english":"From this place the party again diverged , according to their several fancies.","chinese":"這夥人根據各自的愛好，又從這裏分道揚鑣。"},{"english":"citing irreconcilable differences, one party will jilt the other sooner rather than later.","chinese":"無法調解的分歧很快就會使兩黨分道揚鑣。"},{"english":"We parted wishing each other well.","chinese":"我們雙方只能在互道祝福後分道揚鑣。"},{"english":"Later in the evolution of whale hearing, the toothed and baleen whales parted ways.","chinese":"鯨豚聽覺的演化到了後期，齒鯨與鬚鯨就分道揚鑣了。"},{"english":"Horrified , Mr Chanes de Armas first punched him, then drifted away.","chinese":"震驚之餘，阿馬斯第一次開始抨擊他，然後分道揚鑣。"},{"english":"Dodonna and Tallon parted ways, with both going into hiding.","chinese":"多登納和塔隆分道揚鑣，都轉入地下。"},{"english":"They divorced five years later.","chinese":"五年後，兩人分道揚鑣。"},{"english":"In a negatively curved, saddle-shaped universe, parallel beams would diverge.","chinese":"如果宇宙呈馬鞍形反向彎曲，平行光線就會分道揚鑣。"},{"english":"Finally, we went our separate ways.","chinese":"後來，我們分道揚鑣。"},{"english":"I guess the only thing to do now is call a halt to this negotiation and part, friend.","chinese":"我想如今專一能做的便是制止會商，然後分道揚鑣吧。"},{"english":"The two sides agreed not to criticize each other and went separate ways.","chinese":"雙方達成一致，絕不相互指責，繼而分道揚鑣。"},{"english":"But then our visions of the future began to diverge and eventually we had a falling-out.","chinese":"可是我們對未來的願景不同，最後只好分道揚鑣。"},{"english":"Sun Yat-sen and Chen Jiongming soon split over the continuation of the Northern Expedition.","chinese":"孫逸仙和陳炯明不久就因繼續北伐的事宜而分道揚鑣。"},{"english":"Its open approach will be what sets the company apart from Microsoft.","chinese":"其開放的解決方案令其與微軟分道揚鑣。"},{"english":"We may as well exchange good-by and go separate ways.","chinese":"我們還是互道再見，分道揚鑣吧。"},{"english":"Then they go their separate ways.","chinese":"然後他們就分道揚鑣了。"}],"related":[{"definition":["to rupture\/to burst open\/to break\/to break off relations with\/a rupture"],"pinyin":["jue2 lie4"],"word":"決裂"},{"definition":["to die peacefully\/(fig.) to result in failure (without any outside interference)\/to come to nothing\/to fizzle out"],"pinyin":["wu2 ji2 er2 zhong1"],"word":"無疾而終"},{"definition":["to have a falling out\/to have a big argument"],"pinyin":["nao4 fan1"],"word":"鬧翻"},{"definition":["stuck together as by glue (of lovers)\/joined at the hip"],"pinyin":["ru2 jiao1 si4 qi1"],"word":"如膠似漆"},{"definition":["fuse (for explosives)\/(fig.) proximate cause\/the last straw"],"pinyin":["dao3 huo3 xian4"],"word":"導火線"},{"definition":["close relation, no gap (idiom); intimate and nothing can come between"],"pinyin":["qin1 mi4 wu2 jian1"],"word":"親密無間"},{"definition":["to remain unmoved"],"pinyin":["bu4 wei2 suo3 dong4"],"word":"不為所動"},{"definition":["to go separate ways (idiom)\/to part ways with sb\/Taiwan pr. [ge4 ben1 dong1 xi1]"],"pinyin":["ge4 ben4 dong1 xi1"],"word":"各奔東西"},{"definition":["to disagree\/dissent"],"pinyin":["yi4 jian4 bu4 he2"],"word":"意見不合"},{"definition":["to vanish\/to disappear from the face of the earth"],"pinyin":["ren2 jian1 zheng1 fa1"],"word":"人間蒸發"},{"definition":["not to hear, not to question (idiom)\/to show no interest in sth\/uncritical\/not in the least concerned"],"pinyin":["bu4 wen2 bu4 wen4"],"word":"不聞不問"},{"definition":["ironclad evidence\/conclusive proof"],"pinyin":["tie3 zheng4"],"word":"鐵證"},{"definition":["(idiom) due to an unexpected turn of events"],"pinyin":["yin1 cha1 yang2 cuo4"],"word":"陰差陽錯"},{"definition":["to question intensely\/to interrogate\/to demand information"],"pinyin":["bi1 wen4"],"word":"逼問"},{"definition":["to part on bad terms\/(of a meeting etc) to break up in discord"],"pinyin":["bu4 huan1 er2 san4"],"word":"不歡而散"},{"definition":["bruised\/riddled with scars"],"pinyin":["shang1 hen2 lei3 lei3"],"word":"傷痕累累"}]}