{"definition":["tab window (in a web browser etc)\/paging\/pagination\/page break (computing)"],"pinyin":["fen1 ye4"],"simplified":["分页"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"分頁","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["head","page\/leaf"],"pinyin":["xie2","ye4"],"word":"頁"}],"containing_words":[],"sentences":[{"english":"Most administrators think of paging as something that is onerous.","chinese":"大多數管理員都認爲分頁是一件很麻煩的事情。"},{"english":"A column break inserted in the last column of a page will act as a page break.","chinese":"插入到頁面最後一列的分欄符會成爲分頁符。"},{"english":"What about maintaining the size of your paging space?","chinese":"那麼如何維護分頁空間的大小呢？"},{"english":"On some devices , the list will be paginated . set the.","chinese":"在一些設備上，必須對列表進行分頁。"},{"english":"We are truly happy to exchange links with relevant sites.","chinese":"本頁爲輪播交換連結，更多的連結都在各分頁。"},{"english":"A sliding sidebar on the left-hand side displays a page switcher with thumbnail previews.","chinese":"左邊欄的滑動條還可以顯示帶預覽圖的分頁切換。"},{"english":"Occurs when all document content has been paginated.","chinese":"所有的文件內容都已分頁時發生。"},{"english":"This loop will print out the page number and page headers at each page break.","chinese":"這個循環將在每一個分頁處打印出頁編號和頁眉。"},{"english":"Checksums can help to improve the reliability of the paging space.","chinese":"校驗和有助於提高分頁空間的可靠性。"},{"english":"The system-allocated virtual memory that has been charged to a process and that can be paged.","chinese":"該系統分配的虛擬內存，已被控一個過程，可以分頁。"},{"english":"Again, pagination does not support showing navigation links in a tree hierarchy.","chinese":"此外，分頁不支持在樹層次結構中顯示導航鏈接。"},{"english":"One good approach to writing better paging code is to use stored procedures.","chinese":"一個寫出更好的分頁代碼的辦法是使用存儲過程。"},{"english":"The navigation bar also understands how to page through results.","chinese":"這個導航條還知道如何根據結果進行分頁。"},{"english":"You should now have a functioning pager that provides the user a list of thumbnails.","chinese":"現在有了一個可用的分頁器爲用戶提供一些縮略圖。"},{"english":"Enter club page, select your club.","chinese":"進入棋社分頁，點選所屬的棋社。"},{"english":"The option to show a close button instead of the website icon in the left corner of the tab is configurable.","chinese":"您可設定在分頁左上角顯示關閉按鈕而非網站圖示。"}],"related":[]}