{"definition":["entry (accounting)"],"pinyin":["fen1 lu4"],"simplified":["分录"],"rank":42861.0,"normalized_rank":0.5996809984189834,"fraction":2.9399894049993137e-7,"cumulative_fraction":0.9974522647405032,"word":"分錄","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["diary\/record\/to hit\/to copy","surname Lu"],"pinyin":["Lu4","lu4"],"word":"錄"}],"containing_words":[],"sentences":[{"english":"This article deals with automatic entry method of microcomputer business accounting system.","chinese":"本文詳細介紹了微機商業會計自動化分錄登帳方法。"},{"english":"Notice that this entry is exactly the opposite of the entry as uncollectible.","chinese":"注意這個會計分錄恰好與覈銷壞賬的分錄相反。"},{"english":"Notice that this entry is exactly the opposite of the entry as uncollectible.","chinese":"注意這個會計分錄恰好與覈銷壞賬的分錄相反。"},{"english":"The cost of merchandise sold is subtracted from sales to arrive at gross profit.","chinese":"在銷貨業務發生時，對於已出售的商品成本不作分錄。"},{"english":"Such unrecorded revenue is recorded by making an adjusting entry at the end of the period.","chinese":"此類未記錄的收入在會計期末要作調整分錄加以記錄。"},{"english":"The journal is sometimes called the book of original entry.","chinese":"日記賬有時也叫原始分錄賬。"},{"english":"When the money is paid, the system will automatically generate corresponding accounting entries.","chinese":"在付款的同時，系統會自動生成相應的會計分錄。"},{"english":"The debit portion of the entry allocates this expired COST to expense.","chinese":"分錄的借記方將已使用了的成本部分分配到費用賬戶。"},{"english":"Journal entries show all sides of the transaction in one place.","chinese":"日記賬分錄可在同一個地方列示業務的所有方面。"},{"english":"At the same time of making payment, the system will automatically generate corresponding accounting entry.","chinese":"在付款的同時，系統會自動生成相應的會計分錄。"},{"english":"In a compound entry, all the credits are listed under the debits.","chinese":"在複合分錄中，所有貸方應列在借方之下。"},{"english":"Making end-of-period adjusting entries, journalizing and posting them in ledger accounts.","chinese":"作期末調整分錄，記入日記賬並過入分類賬。"},{"english":"Responsible for the accuracy of all journal entries and updating credit department on account status.","chinese":"負責所有分錄的準確性，更新信用部門的賬戶狀況。"},{"english":"For return of goods sold or refund of tax, accounting entries to the contrary shall be made.","chinese":"發生銷貨退回及退稅時作相反的會計分錄。"},{"english":"Manufacturing cost calculation , entry booking.","chinese":"生產成本覈算，分錄編制。"},{"english":"This menu allows to seek only for the entries relating to employees services.","chinese":"這個菜單允許尋找唯一關於員工服務分錄。"}],"related":[]}