{"definition":["fractional distillation"],"pinyin":["fen1 liu2"],"simplified":["分馏"],"rank":59088.0,"normalized_rank":0.8267177815398822,"fraction":4.788066161071375e-8,"cumulative_fraction":0.9997741245846028,"word":"分餾","characters":[{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["to distill\/to break a liquid substance up into components by boiling","to steam\/to cook in a steamer\/to reheat cold food by steaming it"],"pinyin":["liu2","liu4"],"word":"餾"}],"containing_words":[],"sentences":[{"english":"The technologies and processes available to manufacture these products are by fractionation, hydrogenation and interesterification .","chinese":"該技術和工藝可以生產這些產品的分餾，加氫和交換。"},{"english":"Fermentation required only a day, and fractionation was not complicated.","chinese":"發酵只需要一天，分餾並不複雜。"},{"english":"The vibration of fractionator was eliminated by decoking the oil gas line.","chinese":"對油氣線進行消焦處理後，分餾塔振動被消除。"},{"english":"This is a fractionating tower.","chinese":"這是一座分餾塔。"},{"english":"Excess organics tax ozonation and foam fractionating systems.","chinese":"多餘的有機物稅臭氧和泡沫分餾系統。"},{"english":"Noise of air seperation plant mainly comes from air compressor and fractional venting system.","chinese":"空分裝置的噪聲主要來自空壓機組和分餾放空系統。"},{"english":"Migration fractionation can form derived condensate and residual oil.","chinese":"運移分餾作用可以產生衍生凝析油和殘餘油。"},{"english":"In your fractional distillation condenser.","chinese":"或在分餾冷凝器。"},{"english":"A new method establishing models of FCC main fractionator was proposed.","chinese":"提出一種新的催化裂化主分餾塔建模方法。"},{"english":"Also, it is discussed about the role of organic acid on fractionation.","chinese":"同時，探討了弱有機酸的存在對輕重稀土分餾的影響。"},{"english":"The heavy materials are fractionated to the bottom of the column.","chinese":"重的物質被分餾至塔底。"},{"english":"This is known as vacuum fractionation .","chinese":"這就是所謂的真空分餾。"},{"english":"This article discusses the main components fractionation Tata- Tray optimal design.","chinese":"論述了分餾塔塔主要零部件一塔板的優化設計舉例。"},{"english":"Changes in contents of carbazoles and its isomers indicate that there exists an obvious migration fractionation.","chinese":"沿油氣運移方面，咔唑類化合物具有明顯的分餾效應。"}],"related":[]}