{"definition":["feasible"],"pinyin":["qie4 shi2 ke3 xing2"],"simplified":["切实可行"],"rank":16697.0,"normalized_rank":0.2336126929050131,"fraction":0.00000340054881774871,"cumulative_fraction":0.9654054131242252,"word":"切實可行","characters":[{"definition":["definitely\/absolutely (not)\/(scoffing or dismissive interjection) Yeah, right.\/Tut!\/to grind\/close to\/eager\/to correspond to\/see also 反切[fan3 qie4]","to cut\/to slice\/tangent (math)"],"pinyin":["qie1","qie4"],"word":"切"},{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"},{"definition":["can\/may\/able to\/to approve\/to permit\/to suit\/(particle used for emphasis) certainly\/very","see 可汗[ke4 han2]"],"pinyin":["ke3","ke4"],"word":"可"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"}],"containing_words":[],"sentences":[{"english":"The author hopes this research will be really helpful for the development of Baisheng town.","chinese":"希望通過本文能對百勝鎮的發展起到切實可行的作用。"},{"english":"Have you found a suitable way of making-up?","chinese":"你找到切實可行的化妝法了嗎？"},{"english":"I believe this is a viable way to resume the talks.","chinese":"我認爲這是一個切實可行的復談思路。"},{"english":"This program was proven to be applicable by site operation.","chinese":"其程序經實際運行證明切實可行。"},{"english":"This is a practical approach if you're prepared to redefine the assert macro.","chinese":"這是一個切實可行的辦法如果你是準備重新斷言巨集。"},{"english":"To manage PBSD, we should establish realistic performance objectives.","chinese":"實現性能設計，首先要提出切實可行的抗震性能目標。"},{"english":"The suggestion you made is more practicable than the one Xiao Wu made.","chinese":"你提的建議比小吳提的要切實可行。"},{"english":"Okay, I understand that this plan is not entirely practical.","chinese":"是的，我知道這個計劃並不完全切實可行。"},{"english":"There was no practicable way to involve all of us, all the time.","chinese":"沒有切實可行的辦法讓所有人都一直參與其中。"},{"english":"It was feasible to culture Anguilla marmorata in a closed recirculating aquaculture system.","chinese":"利用封閉式循環水養殖模式進行花鰻鱺養殖切實可行。"},{"english":"What might these practical steps be?","chinese":"哪些可能是切實可行的步驟？"},{"english":"From above, a feasible evaluation system for sugarcane smut resistance was established.","chinese":"本文建立的甘蔗品種抗黑穗病評價體系是切實可行的。"},{"english":"We hold a sure card to be practical.","chinese":"我們認爲萬全之策是切實可行的。"},{"english":"The result conforms to that of formation testing and proves the feasibility of this method.","chinese":"其結果與試油成果一致，證明該方法是切實可行的。"},{"english":"The fact of Yangchun city proved that the methods are feasible, can guarantee the construction quality of the land survey database.","chinese":"實踐證明，該方法切實可行，且能有效提高建庫質量。"},{"english":"We hold a sure card to be practicable.","chinese":"我們認爲萬全之策是切實可行的。"}],"related":[]}