{"definition":["contact (math.)"],"pinyin":["qie1 dian3"],"simplified":["切点"],"rank":59939.0,"normalized_rank":0.8386243756383529,"fraction":4.189557890937453e-8,"cumulative_fraction":0.9998123491181532,"word":"切點","characters":[{"definition":["definitely\/absolutely (not)\/(scoffing or dismissive interjection) Yeah, right.\/Tut!\/to grind\/close to\/eager\/to correspond to\/see also 反切[fan3 qie4]","to cut\/to slice\/tangent (math)"],"pinyin":["qie1","qie4"],"word":"切"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[],"sentences":[{"english":"The tangency portfolio is the portfolio that one should hold.","chinese":"切點投資組合就是我們應該持有的投資組合。"},{"english":"Are there any evidences about the association between the cutpoint of IFG and the cardiovascular disease?","chinese":"是否有關於IFG切點和心血管疾病之間關係的證據？"},{"english":"It provides a way of specifying and encapsulating cross-cutting concerns in a system.","chinese":"它爲在系統中詳細指定並封裝橫切點提供了方法。"},{"english":"Cut point shift bias of self-reported health was calibrated using CHOPIT model.","chinese":"用CHOPIT模型校正自報健康的切點位移偏倚。"},{"english":"The position of the intersection is determined by the thickness of the overburden.","chinese":"交切點的位置主要決定於巖上層的厚度。"},{"english":"Together, these two pointcuts define all of the join points with which we are concerned.","chinese":"合起來，這兩個切點定義了所有我們關注的連接點。"}],"related":[]}