{"definition":["interrogation under torture\/inquisition"],"pinyin":["xing2 xun4"],"simplified":["刑讯"],"rank":46081.0,"normalized_rank":0.6447329760888727,"fraction":2.150250443676261e-7,"cumulative_fraction":0.9982644616298282,"word":"刑訊","characters":[{"definition":["punishment\/penalty\/sentence\/torture\/corporal punishment","surname Xing"],"pinyin":["Xing2","xing2"],"word":"刑"},{"definition":["to question\/to ask\/to interrogate\/rapid\/speedy\/fast\/news\/information"],"pinyin":["xun4"],"word":"訊"}],"containing_words":[],"sentences":[{"english":"Extracting a confession by torture infringes the personal rights of citizens with malice.","chinese":"刑訊逼供是一種惡意侵犯公民人身權利的違法行爲。"},{"english":"I was taken to a chamber for sweating.","chinese":"我被帶到了刑訊室去進行拷問。"},{"english":"I will close the Guantanamo Bay prison and ban torture.","chinese":"我會關閉關塔那摩基地監獄，禁止刑訊拷打。"},{"english":"Extraction of confession by torture has been one of the persistent ailments in legal affairs.","chinese":"刑訊逼供一直以來是司法實務中的頑症之一。"},{"english":"Torture has consequences.","chinese":"刑訊逼供是有報應的。"},{"english":"The Criminal Law lays down a special provision on the crime of extorting confessions by torture by judicial functionaries.","chinese":"《刑法》對於司法人員的刑訊逼供罪也專門作了規定。"},{"english":"The man, She Xianglin, said he had confessed to the crime under police torture.","chinese":"佘祥林曾說他屈服於警方的刑訊逼供。"},{"english":"Inquisition by torture is hated but fails to be prohibited.","chinese":"刑訊逼供深爲人惡，但屢禁不止。"},{"english":"Spying and shoot-outs, treachery and torture, not to mention gruesome deaths.","chinese":"間諜，槍戰，背叛，刑訊，任何一條都足以致人死地。"},{"english":"They extorted a confession from him by torture.","chinese":"他們對他進行刑訊逼供。"},{"english":"Dan was taken to the torture chamber by guards.","chinese":"丹被保鏢帶到了刑訊室。"},{"english":"Many of the prisoners have been tortured.","chinese":"許多囚犯都被刑訊逼供過。"},{"english":"Abolishing this cruel punishment still has a long way to go.","chinese":"徹底廢除刑訊逼供製度，還需要一個漫長的過程。"}],"related":[]}