{"definition":["the Great Powers (history)"],"pinyin":["lie4 qiang2"],"simplified":["列强"],"rank":23064.0,"normalized_rank":0.3226952835336421,"fraction":0.0000017705626362083752,"cumulative_fraction":0.9811516885105868,"word":"列強","characters":[{"definition":["to arrange\/to line up\/file\/series\/(in data tables) column\/(Tw) row"],"pinyin":["lie4"],"word":"列"},{"definition":["strong\/powerful\/better\/slightly more than\/vigorous\/violent\/best in their category, e.g. see 百強|百强[bai3 qiang2]","stubborn\/unyielding","surname Qiang","to force\/to compel\/to strive\/to make an effort"],"pinyin":["Qiang2","jiang4","qiang2","qiang3"],"word":"強"}],"containing_words":[],"sentences":[{"english":"China was indeed humiliated by Western powers in its modern history.","chinese":"在近代史當中，中國的確受到了西方列強的侮辱。"},{"english":"The super powersattempt to redivide the world failed.","chinese":"列強企圖重新瓜分世界的計劃破滅了。"},{"english":"Christopher Columbus's voyages inspired other European powers to seek out the new world as well.","chinese":"哥倫布的航行激發了其它歐洲列強探尋新世界的慾望。"},{"english":"Africa was often parceled out among the European Powers.","chinese":"非洲曾一度被歐洲列強所瓜分。"},{"english":"European powers agree to end privateering.","chinese":"歐洲列強同意停止私掠船的行徑。"},{"english":"European powers no longer rule over great overseas dominions.","chinese":"歐洲列強再也不能統治大塊海外領地了。"},{"english":"The European powers extended their authority in Asia.","chinese":"歐洲列強在亞洲擴大他們的管轄權。"},{"english":"The invasions of the western imperialism powers shaked the legitimate foundation of this system.","chinese":"西方列強的入侵動搖了這一制度的合法性基礎。"},{"english":"The imperialist powers had pillaged lots of precious artworks.","chinese":"帝國主義列強掠奪了許多珍貴的藝術品。"},{"english":"Responses from these major powers were clearly full of indignation and discontentment.","chinese":"從列強反應來看，明顯充滿了憤怒和不滿。"},{"english":"The imperialist powers repeatedly forced the Qing government to cede territory and pay indemnities.","chinese":"帝國主義列強多次強迫清朝政府割地賠款。"},{"english":"Africa was once parcelled out among the European powers.","chinese":"非洲一度爲歐洲列強所瓜分。"},{"english":"The third one was making use of the conflict among big powers.","chinese":"三是利用列強之間的矛盾以夷制夷。"}],"related":[]}