{"definition":["criterion\/criteria"],"pinyin":["pan4 ju4"],"simplified":["判据"],"rank":61327.0,"normalized_rank":0.8580442964476096,"fraction":3.35748541782444e-8,"cumulative_fraction":0.999864663120294,"word":"判據","characters":[{"definition":["to judge\/to sentence\/to discriminate\/to discern\/obviously (different)"],"pinyin":["pan4"],"word":"判"},{"definition":["according to\/to act in accordance with\/to depend on\/to seize\/to occupy"],"pinyin":["ju4"],"word":"據"}],"containing_words":[],"sentences":[{"english":"Criteria giving the effective range of the relations are inclu…","chinese":"文中給出了這些關係式適用範圍的判據。"},{"english":"All right, well, there's our equilibrium criterion.","chinese":"這是我們的平衡判據。"},{"english":"The rotating bending fatigue strength is the criterion of resistance to propagation of hot cracks.","chinese":"旋轉彎曲疲勞強度是抗裂紋擴展能力的判據。"},{"english":"A dynamic criterion of suspended fine sand-mud is given in the paper.","chinese":"本文首先提出了一個細顆粒懸浮泥沙的動力學判據。"},{"english":"Traditional DTS is lack of effective and universal misoperation criterion and processing method.","chinese":"傳統的DTS缺乏有效統一的誤操作判據和處理方法。"},{"english":"The criterion of the form invariance for constant ma ss and variable mass systems is given.","chinese":"給出常質量系統和變質量系形式不變性的判據方程。"},{"english":"Some important indexes and criterions of hailstorm radar products are devised.","chinese":"通過分析發現了一些冰雹雷達產品的重要指標和判據。"},{"english":"A new steady state criterion of power angle is discussed.","chinese":"探討了一種新的功角特性的靜穩判據。"},{"english":"A double lines distance relay based on the zero sequence components is presented.","chinese":"提出了適用於平行雙回線路的零序距離繼電器新判據。"},{"english":"For this reason, the authors put forward a two-parameter criterion for time forecast of landslide.","chinese":"鑑於此，筆者提出了滑坡時間預報的雙參數判據。"},{"english":"Besides, a parametric dual model is established on the basis of optimality criteria result.","chinese":"另外，利用這些最優性判據建立了一個參數對偶模型。"},{"english":"As a criterion of the earth's equilibrium is taken the deviation of the geoid from the spheroid.","chinese":"地球體與球的偏差，被用來作爲地球平衡的判據。"},{"english":"The extend direction of crack tips is given by the judgment of mini-plastic zone displacement.","chinese":"根據塑性區最短距離判據分析了裂紋的擴展方向。"},{"english":"It offers the direct criteria of fire for decision-making layer.","chinese":"爲決策層提供火災的直接性判據。"},{"english":"Stability of the controller is guaranteed by Popov stability criterion.","chinese":"用波波夫穩定判據得到了控制器穩定的充分條件。"},{"english":"The result and fixed value make of protection criterion.","chinese":"結果與整定值比較構成保護判據。"}],"related":[]}