{"definition":["to sentence\/to condemn"],"pinyin":["pan4 chu3"],"simplified":["判处"],"rank":3463.0,"normalized_rank":0.048451862941250534,"fraction":0.000040173188890030593,"cumulative_fraction":0.8110908680870391,"word":"判處","characters":[{"definition":["to judge\/to sentence\/to discriminate\/to discern\/obviously (different)"],"pinyin":["pan4"],"word":"判"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"His actions led to a death sentence, which was later commuted to a prison term.","chinese":"郗浩良的行動導致被判處死刑，後來減爲有期徒刑。"},{"english":"Military courts have already sentenced four men to death.","chinese":"軍事法院判處四人死罪。"},{"english":"He advised the judge not to sentence the prisoner to death.","chinese":"他建議法官不要判處這個囚犯死刑。"},{"english":"Alex was sentenced to death for apostasy.","chinese":"亞歷克斯因叛黨而被判處死刑。"},{"english":"Jean got life imprisonment for killing the policeman.","chinese":"簡因殺害那個警察被判處無期徒刑。"},{"english":"He was sentenced to death but was reprieved by the president.","chinese":"他被判處死刑但被總統下令緩期執行。"},{"english":"But in 1986, he was sentenced to three consecutive life terms.","chinese":"但在1986年，他被判處終身監禁三連冠。"},{"english":"Prosecutors had asked for a 40-year sentence.","chinese":"檢察官要求判處他40年徒刑。"},{"english":"Meiwes was arrested a year later and sentenced to life in prison. [ guardian.co.uk ]","chinese":"一年以後Meiwes被逮捕並判處終身監禁。"},{"english":"If convicted, the violation carries a one-year jail sentence.","chinese":"若是判罪，則該人將判處一年徒刑。"},{"english":"The court in Munich sentenced him to five years in prison.","chinese":"慕尼黑的法庭判處代姆揚尤克五年監禁。"},{"english":"He was condemned to life-long exile.","chinese":"他被判處終身流放。"},{"english":"The Shavepate had urged her to put the man to death.","chinese":"剃頭之人不斷催促她判處男人死刑。"},{"english":"Many comments demanded the death penalty for anyone caught trafficking children.","chinese":"許多在線評論要求判處拐賣兒童的犯罪分子死刑。"},{"english":"He pled guilty and received a five-year sentence.","chinese":"他承認有罪，被判處五年徒刑。"},{"english":"He sentenced people to death for trying to scrape the gold off of coins.","chinese":"他將那些試圖從金幣上刮取金子的人判處死刑。"}],"related":[]}