{"definition":["see 獨具|独具[du2 ju4]"],"pinyin":["bie2 ju4"],"simplified":["别具"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"別具","characters":[{"definition":["surname Bie","to leave\/to depart\/to separate\/to distinguish\/to classify\/other\/another\/don't ...!\/to pin\/to stick (sth) in"],"pinyin":["Bie2","bie2"],"word":"別"},{"definition":["tool\/device\/utensil\/equipment\/instrument\/talent\/ability\/to possess\/to have\/to provide\/to furnish\/to state\/classifier for devices, coffins, dead bodies"],"pinyin":["ju4"],"word":"具"}],"containing_words":[{"definition":["having a unique or distinctive style"],"pinyin":["bie2 ju4 yi1 ge2"],"word":"別具一格"},{"definition":["see 獨具隻眼|独具只眼[du2 ju4 zhi1 yan3]"],"pinyin":["bie2 ju4 zhi1 yan3"],"word":"別具隻眼"}],"sentences":[{"english":"You simply cannot miss the chance for such a unique Chinese cultural tour!","chinese":"這麼一趟別具趣味的中國文化遊，你又怎能錯過呢？"},{"english":"Or you can go for an eclectic look with a shiny metal or painted cart.","chinese":"你也可以別具一格，選擇帶金屬光澤或色彩鮮豔的。"},{"english":"Here the well-known dessert will taste unusually delicate if nibbled together with the special coffee.","chinese":"這裏聞名的甜食，配上了咖啡別具一種風味。"},{"english":"I mean that the significance of the novel is more particular and more personal to Kafka.","chinese":"我指的是，對卡夫卡來說，這本小說別具深意。"},{"english":"We caring of you by the usage of the wood handle to protect you.","chinese":"別具匠心的木質的把手更是給你貼身的隔熱保護。"},{"english":"If a type has a wider purpose, it most likely should not be nested.","chinese":"如果型別具有更廣的用途，則很可能不應巢狀化。"},{"english":"Some say the Forest Service should manage it differently.","chinese":"另一些人認爲林業局應該用別具一格的方式來管理。"},{"english":"We can supply the briefly and the different unique style bending glass lamps.","chinese":"可以提供風格簡約，別具一格的烤彎玻璃燈。"},{"english":"The combination of these exclusive caviars are perfect for a caviar tasting, and make an elegant gift.","chinese":"如果把這三種魚子醬混在一起，味道更始別具一格。"},{"english":"Sincere service of \"silk-like\" familiarizes the \"Amorous feelings from Europe Continent\".","chinese":"“絲一般”的真情服務，使“歐陸風情”別具親和力。"},{"english":"Wuyi rock tea brewing, having a unique style.","chinese":"武夷巖茶的沖泡，別具一格。"},{"english":"Hainan actually does offer some cultural diversity for visitors.","chinese":"對於遊客而言，海南島還是有一些別具特色的文化的。"},{"english":"Weaving technology show ingenuity, dyeing and finishing technology advanced.","chinese":"織造工藝別具匠心，染整技術先進。"},{"english":"The writer showed ingenuity in creating a surprising ending.","chinese":"作者別具匠心地設計了一個出人意料的結尾。"},{"english":"These maps are usually influenced in style and setting by different regions of the world.","chinese":"這些貼圖通常別具一格被分到不同的地區。"},{"english":"The key is whether researchers have unique talents and the force of theory penetration.","chinese":"關鍵在於研究者是否別具慧眼，是否具有理論穿透力。"}],"related":[]}