{"definition":["don't get involved\/ignore it!\/don't have anything to do with (him, her etc)\/don't speak to"],"pinyin":["bie2 li3"],"simplified":["别理"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"別理","characters":[{"definition":["surname Bie","to leave\/to depart\/to separate\/to distinguish\/to classify\/other\/another\/don't ...!\/to pin\/to stick (sth) in"],"pinyin":["Bie2","bie2"],"word":"別"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"}],"containing_words":[],"sentences":[{"english":"“Ignore her, ” she murmured.","chinese":"“別理她，”她喃喃細語。"},{"english":"Don't mind them, she whispers to the child.","chinese":"別理他們，她輕聲對孩子說。"},{"english":"So don't pay any attention to his words. It's nothing, right?","chinese":"所以，別理他，他的話一點用也沒有，對吧？"},{"english":"Senor Dahlmann, don't pay any attention to those lads; they're half high.","chinese":"達爾曼先生，那些小夥子醉了，別理他們。"},{"english":"Don't you listen to these nitwits you hear me?","chinese":"別理別人怎麼說，你聽到嗎？"},{"english":"So what if India wants to sell , go ahead sell, why worried about China.","chinese":"所以嘛，印度要是想賣武器，雖然賣，別理中國。"},{"english":"Throw out nonessential numbers. This  includes age, weight and height.","chinese":"別理會那些不重要的數字，包括年齡，體重，身高。"},{"english":"Pay no attention to him, he's hectoring upon you.","chinese":"別理他，他在戲弄你呢。"},{"english":"Nonsense was written, but his attitude was, 'Don't talk to them or you'll never get rid of them.'","chinese":"但他總是說‘別理他們，不然你永遠擺脫不了他們。’"},{"english":"If you get a positive IgM, please disregard it, as it is not enough by itself for a conclusive diagnosis.","chinese":"如果抗原檢查爲陽性，請別理會，因爲這不足以確診。"},{"english":"Let him be he's doing no harm.","chinese":"別理他，他不要緊，沒事的。"},{"english":"Do no manage that woman, she all so.","chinese":"別理那女人，她一直這樣。"},{"english":"Ignore that red string, that is just a safety.","chinese":"先別理紅色細繩，那是以防萬一。"},{"english":"Leave her alone. She's natural crier .","chinese":"別理她，她是個天生愛哭的人。"},{"english":"Leave must alone. He must have been drunk.","chinese":"別理他，他一定是喝醉了。"},{"english":"Try to avoid strangers no matter what treats they give you.","chinese":"無論陌生人給你什麼好處都別理他們。"}],"related":[]}