{"definition":["there is no alternative"],"pinyin":["bie2 wu2 ta1 fa3"],"simplified":["别无他法"],"rank":44114.0,"normalized_rank":0.6172120940774838,"fraction":2.6013213106796305e-7,"cumulative_fraction":0.997798933576596,"word":"別無他法","characters":[{"definition":["surname Bie","to leave\/to depart\/to separate\/to distinguish\/to classify\/other\/another\/don't ...!\/to pin\/to stick (sth) in"],"pinyin":["Bie2","bie2"],"word":"別"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["he or him\/(used for either sex when the sex is unknown or unimportant)\/(used before sb's name for emphasis)\/(used as a meaningless mock object)\/other\/another"],"pinyin":["ta1"],"word":"他"},{"definition":["France\/French\/abbr. for 法國|法国[Fa3 guo2]\/Taiwan pr. [Fa4]","law\/method\/way\/to emulate\/(Buddhism) dharma\/(abbr. for 法家[Fa3 jia1]) the Legalists\/(physics) farad (abbr. for 法拉[fa3 la1])"],"pinyin":["Fa3","fa3"],"word":"法"}],"containing_words":[],"sentences":[{"english":"There was clearly nothing left to do but flop down on the shabby little couch and howl.","chinese":"除了撲到破舊的小沙發裏嚎哭顯然別無他法。"},{"english":"Machine try a part to have no other way besides much exercise.","chinese":"機試部分除了多練習別無他法。"},{"english":"We can do nothing but to love, and this makes us lonelier .","chinese":"我們別無他法，只能相愛，而這令我們更加孤獨。"},{"english":"None of this means that anxious smokers who want to stop are without recourse.","chinese":"以上這些都不能說明急切戒菸者想戒菸的話別無他法。"},{"english":"If that doesn’t make them take a step back, nothing will.","chinese":"如果這樣都不能使對方後退一點，那就別無他法了。"},{"english":"They’re all but done for unless they change their focus, Jobs said.","chinese":"喬布斯說，他們除了改變他們的重點，別無他法。"},{"english":"The rats have no choice but to let her try.","chinese":"老鼠們別無他法，只好讓她去試。"},{"english":"You can't get to the island other than by boat.","chinese":"要去那座島，除了搭船以外，別無他法。"},{"english":"Jason and Maggie had nothing to do but accepted the fact.","chinese":"詹森和麥姬別無他法，只好接受眼前的事實。"}],"related":[]}