{"definition":["egoism"],"pinyin":["li4 ji3 zhu3 yi4"],"simplified":["利己主义"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"利己主義","characters":[{"definition":["sharp\/favorable\/advantage\/benefit\/profit\/interest\/to do good to\/to benefit","surname Li"],"pinyin":["Li4","li4"],"word":"利"},{"definition":["self\/oneself\/sixth of the ten Heavenly Stems 十天干[shi2 tian1 gan1]\/sixth in order\/letter \"F\" or Roman \"VI\" in list \"A, B, C\", or \"I, II, III\" etc\/hexa"],"pinyin":["ji3"],"word":"己"},{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["Yi4","yi4"],"word":"義"}],"containing_words":[],"sentences":[{"english":"Both drives him to become an extreme egoist.","chinese":"兩者驅使他成爲一個極端的利己主義者。"},{"english":"The participant's behaviour can be explained by simple economic self-interest.","chinese":"被試的行爲可以通過經濟上的利己主義來解釋。"},{"english":"Meanwhile the national egoism had also been expanded and developed viciously.","chinese":"但同時蘇聯的民族利己主義也出現了惡性的膨脹發展。"},{"english":"That is the perfect Egoist.","chinese":"這是一個徹頭徹尾的利己主義者。"},{"english":"There remains as a third category the intolerance caused by self-interest.","chinese":"利己主義還可帶來第三種的“不容忍”。"},{"english":"Japanese politics is tainted with egoism and populism.","chinese":"日本政治帶有利己主義和民粹主義的風氣。"},{"english":"People shelve the out - of - fashion moral icon and espouse the philosophy of egoism.","chinese":"擱置了人民的時尚圖標和擁護道德哲學的利己主義。"},{"english":"So over time, we're moving towards a much more individualistic society.","chinese":"因此，我們將步入更加利己主義的社會。"},{"english":"Is their financial self-interest truly aligned with mine as a shareholder?","chinese":"他們的金融利己主義是我們股東是站在一條線上的嗎？"},{"english":"I was stubborn and egocentric.","chinese":"我是頑固的利己主義者。"}],"related":[]}