{"definition":["to delete"],"pinyin":["shan1 qu4"],"simplified":["删去"],"rank":27829.0,"normalized_rank":0.3893638157066305,"fraction":0.0000011456324156124436,"cumulative_fraction":0.9879864855191828,"word":"刪去","characters":[{"definition":["to delete"],"pinyin":["shan1"],"word":"刪"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"Any indecent advertisements need to be censored.","chinese":"任何粗鄙或有傷風化的廣告，應該刪去。"},{"english":"Lautenbacher said the program might eliminate some sensors from the orbiters.","chinese":"說，衛星上的感應器可能會刪去一部份。"},{"english":"The censors eviscerated the book to make it inoffensive to the President.","chinese":"審查員刪去了該書的精華以取悅於總統。"},{"english":"Try to prune your essay of irrelevant detail .","chinese":"儘量刪去你那文章中無關的細節。"},{"english":"Several words have been deleted from the article by the censor.","chinese":"那篇文章中有好幾個字被新聞檢查官刪去了。"},{"english":"Several words have been deleted from the report.","chinese":"那篇報道中有好幾處文字被刪去了。"},{"english":"If you could prune away the unnecessary adjectives in this essay, it would be improved.","chinese":"如果你把論文中不必要的形容詞刪去，會使文章更好。"},{"english":"Several word have is delete from the article by the censor.","chinese":"那篇文章中有好幾個字被新聞檢查官刪去了。"},{"english":"Enables you to remove a name from the list of environment variables.","chinese":"允許你從環境變量表中刪去一個名字。"},{"english":"Please erase her name from the list .","chinese":"請把她的名字從名單中刪去。"},{"english":"I cancelled many unnecessary words in my manuscript.","chinese":"我把我原稿許多不需要的字刪去了。"},{"english":"The Chinese subtitle, however, mistranslated her remarks such that the endorsement was removed.","chinese":"中文字幕卻錯譯，刪去她認同的字句。"},{"english":"You agreed obliterates all networks article?","chinese":"你是否同意刪去所有網絡文章？"},{"english":"He chopped the short story by two paragraphs.","chinese":"他把這篇短篇小說刪去了兩段。"},{"english":"INVOICE SHOWING \"E. AND O. E.\" SHOULD BE DELETED.","chinese":"發票顯示的“錯漏當查”應刪去。"},{"english":"The moral offensive remarks in the book had to be expurgated before it could be printed.","chinese":"這本書在付印前必須刪去道德上衝撞的話語。"}],"related":[]}