{"definition":["when the moment comes\/at that time"],"pinyin":["dao4 shi2 hou4"],"simplified":["到时候"],"rank":9242.0,"normalized_rank":0.1293075706910302,"fraction":0.000009453803070832452,"cumulative_fraction":0.9230097608481771,"word":"到時候","characters":[{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["o'clock\/time\/when\/hour\/season\/period","surname Shi"],"pinyin":["Shi2","shi2"],"word":"時"},{"definition":["to wait\/to inquire after\/to watch\/season\/climate\/(old) period of five days"],"pinyin":["hou4"],"word":"候"}],"containing_words":[],"sentences":[{"english":"Lets go to the cinema together, and Ill call for you.","chinese":"咱們一起去看電影吧，到時候我來叫你。"},{"english":"I should know in a couple of days. I'll get back to you.","chinese":"過幾天我應當會知談，到時候再告訴你吧。"},{"english":"Which then becomes a terrific hallucinogen.","chinese":"到時候就會變成一種可怕的迷幻劑。"},{"english":"I can't open my eyes to watch you jumping into the fiery pit, for I will shut my eyes at the time.","chinese":"我不會眼睜睜看着你往火坑裏跳，到時候我會閉上的。"},{"english":"Tell him that there will be lots of food and he will rise to the bait .","chinese":"你告訴他到時候會有很多喫的，他會上鉤的。"},{"english":"We will be getting into that when the time comes.","chinese":"到時候我們會對此進行深入探討。"},{"english":"In time, all humans will join this rhythm with nature.","chinese":"到時候，所有物種將加入這大自然的律動中。"},{"english":"I’ll keep Friday night free and we can go then.","chinese":"我將把週五晚上騰出來，到時候我們就能去了。"},{"english":"Do you wanna come back for a swim later?","chinese":"那你想回來到時候一起游泳嗎？"},{"english":"Then I will go to pick you up at the airport. I will drive you to my home.","chinese":"到時候我會去機場接你，然後再坐車到我家。"},{"english":"Failure results in a bricked computer. Don't blame me.","chinese":"要不然失敗會導致計算機崩潰，到時候別責怪我。"},{"english":"I may relent somewhat when the time comes.","chinese":"到時候我也許會仁慈一些。"},{"english":"Your replacement will, by then, need your chamber.","chinese":"你的代替到時候就要你的房間了。"},{"english":"Then I will be like a fool who can speak neither Thai nor Chinese.","chinese":"到時候我可是一個既不會泰語也不會中文的傻瓜了。"},{"english":"We'll have closed our bank accounts by then.","chinese":"我們到時候巳經把賬戶關了。"},{"english":"I was in my room, lying down, when I heard loud explosions.","chinese":"聽到大爆炸到時候，我在自己的房間裏臥倒。"}],"related":[]}