{"definition":["to the end (of)\/at the end of\/in the end\/to come to an end"],"pinyin":["dao4 tou2"],"simplified":["到头"],"rank":20478.0,"normalized_rank":0.2865137884236005,"fraction":0.000002277396956673004,"cumulative_fraction":0.9759545041386736,"word":"到頭","characters":[{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"}],"containing_words":[{"definition":["in the end\/finally\/as a result"],"pinyin":["dao4 tou2 lai2"],"word":"到頭來"},{"definition":["all year round"],"pinyin":["yi1 nian2 dao4 tou2"],"word":"一年到頭"}],"sentences":[{"english":"Mrs Rebuffed 2 people debate, o have tumbled down the stairs knocked at the end.","chinese":"太太回絕2人爭論中，阿得從樓梯上跌下來敲到頭。"},{"english":"Speculators eager to earn a fast buck often wind up in bankruptcy.","chinese":"急於想發橫財的投機者到頭來往往破產。"},{"english":"The identical concept, very possible is in the end criticism person is different.","chinese":"到頭來同一個概念，很可能是人言人殊。"},{"english":"Tis nought but making bridal clothes for other folk to wear.","chinese":"到頭來都是爲他人作嫁衣裳。"},{"english":"In his deepest depression he felt he'd arrived at a terminus.","chinese":"在他最抑鬱的時候，他感覺自己已經走到頭了。"},{"english":"It is neither too cold nor too hot in Kunming ____ ____ ____ ____.","chinese":"在昆明，天氣一年到頭都是既不太冷也不太熱。"},{"english":"The sun shines here all the year round.","chinese":"這裏一年到頭都能照到太陽。"},{"english":"Evildoers are bound to be punished in the end.","chinese":"做壞事的人到頭來總會遭報應的。"},{"english":"Dishonest people are bound to come a cropper in the end.","chinese":"不老實的人到頭來總是要栽跟頭的。"},{"english":"Go east and go all the way along Changan Avenue. The World Trade Center is on your left.","chinese":"往東沿着長安街走到頭，世貿就在你的左手邊。"},{"english":"The road seems to go on forever into the far horizon.","chinese":"這條路似乎永不到頭，一直通向天邊。"},{"english":"After all, he said to hilf, it's probably only insomnia.","chinese":"到頭來，他對說，大概又只是失眠。"},{"english":"Evildoers are bound to be punished in the end .","chinese":"做壞事的人到頭來總會遭報應的。"},{"english":"If you are not carefull, you could finish up seriously ill.","chinese":"要是不注意，你可能到頭了會大病一場。"},{"english":"She was spotted in Paris wearing one last month.","chinese":"上月她在巴黎被拍到頭戴一頂寬檐軟呢帽。"},{"english":"Its days of lending to the United States out of the goodness of its beneficent heart are just about over.","chinese":"它出於好心借給美國錢的日子就要到頭了。"}],"related":[]}