{"definition":["to work out\/to formulate"],"pinyin":["zhi4 ding4"],"simplified":["制订"],"rank":4560.0,"normalized_rank":0.06380031620332154,"fraction":0.000027467004292714296,"cumulative_fraction":0.8476413316710166,"word":"制訂","characters":[{"definition":["system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4"],"word":"制"},{"definition":["to agree\/to conclude\/to draw up\/to subscribe to (a newspaper etc)\/to order"],"pinyin":["ding4"],"word":"訂"}],"containing_words":[],"sentences":[{"english":"Yost was an engineer involved in the development of high-altitude weather balloons.","chinese":"約斯特是一名工程師參與制訂高空氣象氣球。"},{"english":"Randomisation assignments were generated by the medical coordinating centre by a pre-decided schedule.","chinese":"醫療協調中心根據預先制訂的計劃生成隨機化分配。"},{"english":"Background. The clinical history of a given pigmented lesion could in fluence the therapeutic decision.","chinese":"一個色素性皮損的臨牀病史影響其治療方案的制訂。"},{"english":"To establish a coherent and comprehensive population policy.","chinese":"制訂周全諧協的人口政策。"},{"english":"Participating in the formulation of company facility layout and adjustment plan.","chinese":"參與制訂公司設施規劃和調整計劃。"},{"english":"The rebels defiantly welcomed new allies and laid plans for unionization campaigns.","chinese":"造反派熱烈歡迎新盟友，並制訂組織工會的計劃。"},{"english":"The general ordered me to strategize.","chinese":"將軍責成我制訂戰略行動計劃。"},{"english":"We must determine the heat-treatment technical parameters, according to its influence.","chinese":"因此，必須考慮其影響來綜合制訂熱處理工藝參數。"},{"english":"The establishment of Codex guideline levels for dioxins in foods is under consideration.","chinese":"目前正在考慮制訂食品中二噁英含量規定指導原則。"},{"english":"In addition, the complexion of enacting standards for live working is described.","chinese":"另外，介紹了帶電作業標準的制訂情況。"},{"english":"Working out the company's profit distribution plans and loss recovery plans.","chinese":"制訂公司的利潤分配方案和彌補虧損方案。"},{"english":"Salvador Idal: American and Israeli defense contractors have now developed effective mind-scanning machines.","chinese":"美國和以色列國防承包商已制訂了有效的心態掃描機。"},{"english":"This article analysis the quality of lomar PW and works out analysis method.","chinese":"對進口洛碼PW進行了全分析，制訂了分析方法。"},{"english":"We can't put off making a plan. Clean-up Day is only two weeks from now.","chinese":"我們不能推遲制訂計劃，清潔日離現在只有兩週了。"},{"english":"Working-out test plan, complete hardware debugging and testing job.","chinese":"制訂測試方案，完成硬件調試和測試工作。"},{"english":"\"The central government can only start schemes and give money, \" Rebello said.","chinese":"雷貝羅說，“中央政府只能制訂計劃然後提供資金。"}],"related":[{"definition":["to set\/to designate\/to stipulate\/to provide\/to draw up\/to formulate (rules etc)\/stipulation"],"pinyin":["ding4 ding4"],"word":"訂定"},{"definition":["mechanism"],"pinyin":["ji1 zhi4"],"word":"機制"},{"definition":["legislation\/statute"],"pinyin":["fa3 gui1"],"word":"法規"},{"definition":["to regulate"],"pinyin":["gui1 guan3"],"word":"規管"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"規範"},{"definition":["optimization\/to optimize\/to make superior"],"pinyin":["you1 hua4"],"word":"優化"},{"definition":["to implement\/to carry out\/to execute\/to run"],"pinyin":["zhi2 xing2"],"word":"執行"},{"definition":["to implement\/to carry out"],"pinyin":["shi2 shi1"],"word":"實施"},{"definition":["sustainable development"],"pinyin":["ke3 chi2 xu4 fa1 zhan3"],"word":"可持續發展"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落實"},{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"實行"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"監管"},{"definition":["to move\/to act\/action\/decision\/conduct\/manner"],"pinyin":["ju3 cuo4"],"word":"舉措"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to evaluate\/to assess\/assessment\/evaluation"],"pinyin":["ping2 gu1"],"word":"評估"},{"definition":["authorities"],"pinyin":["dang1 ju2"],"word":"當局"}]}