{"definition":["to come (formal)\/before\/previously"],"pinyin":["qian2 lai2"],"simplified":["前来"],"rank":2588.0,"normalized_rank":0.03620947770486757,"fraction":0.000057256658606428795,"cumulative_fraction":0.7691342617709792,"word":"前來","characters":[{"definition":["front\/forward\/ahead\/first\/top (followed by a number)\/future\/ago\/before\/BC (e.g. 前293年)\/former\/formerly"],"pinyin":["qian2"],"word":"前"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"}],"containing_words":[],"sentences":[{"english":"And the Gunners will fund it with their windfall for ex-skipper Patrick…","chinese":"槍手將會用賣出前隊長的前來收購他。"},{"english":"At this point of time, Hanwen arrives to arrest Shouye.","chinese":"這時漢文與偉民前來拘捕守業，衆人喫驚。"},{"english":"I thought it would raise a smile with people at the exhibition.","chinese":"我想它能給前來參觀展覽的人帶來笑容。"},{"english":"Hold them steadily before Him in faith and prayer.","chinese":"用信心和禱告帶到他面前來。"},{"english":"You seem to know this place vell well. Have you been here before?","chinese":"看來你非常熟悉這個地方，你以前來過這裏嗎？"},{"english":"When Jesus had entered Capernaum, a centurion came to him, asking for help.","chinese":"耶穌進了迦百農，有一個百夫長前來求助。"},{"english":"Thank you for letting us come by.","chinese":"謝謝你允許我們前來致哀。"},{"english":"Workshop director of high-strength comrades wholeheartedly welcome customers to negotiate business.","chinese":"車間主任高強同志竭誠歡迎廣大客戶前來洽談業務。"},{"english":"And the small mangrove forests left the camp to identify reactive nakamura.","chinese":"營左押着小林澤前來指認中村功。"},{"english":"I got to the Tanghu middle school three weeks ago.","chinese":"我在三週前來到了棠湖中學。"},{"english":"Bring the tribe of Levi and present them to Aaron the priest to assist him.","chinese":"你使利未支派近前來，站在祭司亞倫面前好服事他。"},{"english":"One day, his aunt came to beg for forgiveness.","chinese":"一日，密勒日巴的姑母前來祈求原諒。"},{"english":"Steady rollin woman gonna come my way.","chinese":"穩步輥女子前來自首途中。"},{"english":"Drogon has come this way before, she realized.","chinese":"卓耿以前來過這裏，她意識到了。"},{"english":"In the first quarter, he drove, scooped the ball left-handed under Yao's arms, off the glass and into the hoop.","chinese":"在第一節的時候在姚明面突破前來了個漂亮的上籃。"},{"english":"Elijah went before the people and said, 'How long will you waver between two opinions?","chinese":"以利亞前來對衆民說，你們心持兩意要到幾時呢？"}],"related":[]}