{"definition":["predecessor\/ex-\/former\/ex (spouse etc)"],"pinyin":["qian2 ren4"],"simplified":["前任"],"rank":8676.0,"normalized_rank":0.12138849635526702,"fraction":0.000010472726906328737,"cumulative_fraction":0.9173589775687181,"word":"前任","characters":[{"definition":["front\/forward\/ahead\/first\/top (followed by a number)\/future\/ago\/before\/BC (e.g. 前293年)\/former\/formerly"],"pinyin":["qian2"],"word":"前"},{"definition":["surname Ren\/Ren County 任縣|任县[Ren2 Xian4] in Hebei","to assign\/to appoint\/to take up a post\/office\/responsibility\/to let\/to allow\/to give free rein to\/no matter (how, what etc)\/classifier for terms served in office, or for spouses, girlfriends etc (as in 前任男友)"],"pinyin":["Ren2","ren4"],"word":"任"}],"containing_words":[],"sentences":[{"english":"The former chief has got typhus fever on board.","chinese":"前任大副在船得過斑疹傷寒症。"},{"english":"Wan replaces the outgoing science minister, Xu Guanhua, who is retiring.","chinese":"萬鋼的前任徐冠華部長已經到了退休年齡。"},{"english":"Sleeping with an ex is the sexual slip-up people most commonly expect to get away with.","chinese":"與前任偷情是最多數人想抹掉的性錯誤。"},{"english":"Honey, if ex-boyfriends were dollars…you'd be loaded by now.","chinese":"如果前任男友能當錢，如今就是富婆了。"},{"english":"Her predecessor, Ricardo Lagos, was known on occasion to take the subway to work.","chinese":"而她的前任拉戈斯據說有時甚至會乘坐地鐵上班。"},{"english":"He seemed to relish the pressure and focus that had eclipsed his predecessors.","chinese":"安帥對壓力和聚焦的把握能力讓他的前任黯然失色。"},{"english":"His predecessor Bill Clinton did not escape \"criticism from Confucius\" either.","chinese":"他的前任克林頓也沒能逃脫來自孔子的“諄諄教誨”。"},{"english":"As soon as the slave got back into town, he was captured by his former master.","chinese":"奴隸一回到鎮中，馬上就被他的前任主人逮個正着。"},{"english":"The willingness of the ex-leader and the successor will also influence the results of the succession.","chinese":"前任和繼任主體的交接意願影響到繼任的效果。"},{"english":"You remind me of my ex-girlfriend.","chinese":"你使我念起我的前任女友。"},{"english":"An ex is flirting, do not entertain them please.","chinese":"你的前任開始賣弄風情，千萬別取悅他們。"},{"english":"Tom is also the creator and former project lead for the jBPM project.","chinese":"Tom還是jBPM項目的創建者和前任項目領導。"},{"english":"Mr Obama has managed to develop a political career far more lucrative than those of his predecessors.","chinese":"奧巴馬政治生涯的“錢途”遠超過他的前任們。"},{"english":"So, Penny says that her husband – her ex-husband – is paying child support.","chinese":"因此，Penny說他的前任丈夫在支付孩子撫養費。"},{"english":"China refused to deal with Ma's pro-independence predecessor.","chinese":"大陸拒絕與馬英九親獨立的前任打交道。"},{"english":"We took about 800 ornaments left over from previous administration.","chinese":"前任政府留下了800多件裝飾品。"}],"related":[{"definition":["to occupy a post currently\/current (president etc)\/incumbent\/(coll.) current boyfriend (girlfriend, spouse)"],"pinyin":["xian4 ren4"],"word":"現任"},{"definition":["newly-appointed\/newly elected\/new (in a political office)"],"pinyin":["xin1 ren4"],"word":"新任"},{"definition":["new flame\/new lover"],"pinyin":["xin1 huan1"],"word":"新歡"},{"definition":["to part company\/to split up\/to break up"],"pinyin":["fen1 shou3"],"word":"分手"},{"definition":["to leave office\/to leave one's post"],"pinyin":["li2 ren4"],"word":"離任"},{"definition":["old affection"],"pinyin":["jiu4 qing2"],"word":"舊情"},{"definition":["change of affection, shift of love (idiom); to change one's feelings to another love\/to fall in love with sb else"],"pinyin":["yi2 qing2 bie2 lian4"],"word":"移情別戀"},{"definition":["lit. lotus roots may break, but the fiber remains joined (idiom); lovers part, but still long for one another"],"pinyin":["ou3 duan4 si1 lian2"],"word":"藕斷絲連"},{"definition":["to remain in office\/to hold on to one's job"],"pinyin":["liu2 ren4"],"word":"留任"},{"definition":["lit. that person\/fig. the person you have been looking for\/Mr Right\/the girl of one's dreams"],"pinyin":["na4 ge4 ren2"],"word":"那個人"},{"definition":["ex-wife\/late wife"],"pinyin":["qian2 qi1"],"word":"前妻"},{"definition":["to turn over old accounts\/fig. to revive old quarrels\/to reopen old wounds"],"pinyin":["fan1 jiu4 zhang4"],"word":"翻舊賬"},{"definition":["to betray"],"pinyin":["bei4 pan4"],"word":"背叛"},{"definition":["shady relationship\/affair\/adulterous relationship"],"pinyin":["ai4 mei4 guan1 xi4"],"word":"曖昧關係"},{"definition":["to leave office"],"pinyin":["xie4 ren4"],"word":"卸任"},{"definition":["to do the splits (gymnastics)\/(Tw) two-timing (in romantic relationships)\/Taiwan pr. [pi1 tui3]"],"pinyin":["pi3 tui3"],"word":"劈腿"}]}