{"definition":["front-line\/forward position\/outpost\/extending ahead\/frontier (of science, technology etc)"],"pinyin":["qian2 yan2"],"simplified":["前沿"],"rank":6500.0,"normalized_rank":0.0909434331845592,"fraction":0.000016492552282861097,"cumulative_fraction":0.8887270696239817,"word":"前沿","characters":[{"definition":["front\/forward\/ahead\/first\/top (followed by a number)\/future\/ago\/before\/BC (e.g. 前293年)\/former\/formerly"],"pinyin":["qian2"],"word":"前"},{"definition":["along\/to follow (a line, tradition etc)\/to carry on\/to trim (a border with braid, tape etc)\/border\/edge"],"pinyin":["yan2"],"word":"沿"}],"containing_words":[],"sentences":[{"english":"The command post was set up in a forward position.","chinese":"指揮部設在前沿陣地上。"},{"english":"They may look like an ordinary pair of spectacles, but these glasses are at the forefront of a revolution in eyewear.","chinese":"它們看起來像普通的眼鏡，但是是眼鏡改革的最前沿。"},{"english":"The enemy attacked our foremost positions all night.","chinese":"整整一夜敵人攻打了我們的前沿陣地。"},{"english":"It has been at the forefront of eight leading industry innovations for underground trackless equipment.","chinese":"也一直走在地下無軌設備8大工業創新的最前沿。"},{"english":"Study on optical sub-wavelength structure has been a subject of great interest in recent years.","chinese":"光學亞波長結構研究是受國際重視的研究前沿。"},{"english":"The decisive attack took off fromthe foremost position.","chinese":"決定性進攻是從最前沿陣地開始的。"},{"english":"Cloned livestock are the next frontier in biotech farming.","chinese":"克隆家畜成爲生物技術農業下一個前沿。"},{"english":"The deposits are grouped close to the present-day erosional edge of Kombolgie Formation rocks.","chinese":"礦牀集中於靠近科姆波爾吉地層巖的現代侵蝕前沿。"},{"english":"How has China vaulted to the forefront in manufacturing, trade and technology?","chinese":"中國如何躍至製造，貿易和技術的前沿？"},{"english":"Do you desire to sense the contemporary first-class and vanguard prospect?","chinese":"你想感受到一種當代東西的一流前沿圖景嗎？"},{"english":"Glycobiology has been recognized as \"the last frontier\" in biochemistry.","chinese":"糖生物學被認爲是生物化學領域“最後的前沿”。"},{"english":"The investigation of the optical spatiotemporal pattern is a forward topic in nonlinear scientific field.","chinese":"光學時空斑圖也是當今非線性科學領域內的前沿課題。"},{"english":"What industry particularly appreciates is research that explores new frontiers of knowledge.","chinese":"工業界特別重視那些探索知識的新前沿的研究。"},{"english":"Latest universe research news, cosmos topics and other science discoveries & technology improvements.","chinese":"介紹宇宙的前沿研究與宇宙學進展及相關科技動態。"},{"english":"Based on today'sstate-of-the-art-science, what is your opinion?'","chinese":"根據今天的前沿科學觀念，你的看法是什麼？"},{"english":"Mr Sunstein calls it a \"frontiers question\".","chinese":"桑斯坦因稱其爲一個“前沿問題”。"}],"related":[{"definition":["depth (from front to rear)\/depth (into a territory)\/span (of time)\/(fig.) depth (of deployment, progress, development etc)"],"pinyin":["zong4 shen1"],"word":"縱深"},{"definition":["vanguard\/pioneer\/avant-garde"],"pinyin":["xian1 feng1"],"word":"先鋒"},{"definition":["position\/front"],"pinyin":["zhen4 di4"],"word":"陣地"},{"definition":["advanced (technology)\/to advance"],"pinyin":["xian1 jin4"],"word":"先進"},{"definition":["place of origin\/source (of a war or a social movement)"],"pinyin":["ce4 yuan2 di4"],"word":"策源地"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引領"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["to be ahead of one's time\/to surpass or outdo one's predecessors\/to be ahead of the pack\/to take the lead\/advanced"],"pinyin":["chao1 qian2"],"word":"超前"},{"definition":["new technology"],"pinyin":["xin1 ji4 shu4"],"word":"新技術"},{"definition":["surrounding"],"pinyin":["wai4 wei2"],"word":"外圍"},{"definition":["highland\/upland"],"pinyin":["gao1 di4"],"word":"高地"},{"definition":["lit. frontline troops\/leader\/trailblazer\/pacesetter"],"pinyin":["pai2 tou2 bing1"],"word":"排頭兵"},{"definition":["strategic"],"pinyin":["zhan4 lu:e4 xing4"],"word":"戰略性"},{"definition":["to innovate\/innovation"],"pinyin":["ge2 xin1"],"word":"革新"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推進"},{"definition":["boundary\/border"],"pinyin":["bian1 jie4"],"word":"邊界"}]}