{"definition":["front\/the front side\/in front of"],"pinyin":["qian2 bian5"],"simplified":["前边"],"rank":23943.0,"normalized_rank":0.3349936339596771,"fraction":0.0000016304241144209204,"cumulative_fraction":0.9826458830921148,"word":"前邊","characters":[{"definition":["front\/forward\/ahead\/first\/top (followed by a number)\/future\/ago\/before\/BC (e.g. 前293年)\/former\/formerly"],"pinyin":["qian2"],"word":"前"},{"definition":["side\/edge\/margin\/border\/boundary\/CL:個|个[ge4]\/simultaneously","suffix of a noun of locality"],"pinyin":["bian1","bian5"],"word":"邊"}],"containing_words":[{"definition":["erhua variant of 前邊|前边[qian2 bian5]"],"pinyin":["qian2 bian5 'r"],"word":"前邊兒"}],"sentences":[{"english":"Look, Dashan. There's a service station straight ahead.","chinese":"大山，你看，前邊有一家加油站。"},{"english":"Remove the front cover of the drawworks.","chinese":"卸掉絞車前邊的護罩。"},{"english":"And that, his father and I sat by the side of his private Diaojiao house and chatted over tea.","chinese":"他阿爸拉我在自家的吊腳樓前邊聊邊喝茶。"},{"english":"The front drawworks guard should be put back in place when the operation is completed.","chinese":"作業結束之後，要儘快把絞車前邊的護罩裝回原處。"},{"english":"Cheng's wife put her money on the table, lit joss sticks and kowtowed just like others there.","chinese":"成名的妻子把錢放在案上，象前邊的人一樣燒香跪拜。"},{"english":"And the pines above and along and beside the sea.","chinese":"上面是松樹林，前邊與旁邊是大海。"},{"english":"Remove the front guard cover of the drawworks.","chinese":"卸掉絞車前邊的護罩。"},{"english":"I went through the town hall, I saw many people standing in front of the bulletin board.","chinese":"我走過鎮公所的時候，看見許多人站在佈告牌前邊。"},{"english":"Install the front drawworks guard cover after the mast is raised.","chinese":"井架起來之後，把絞車前邊的護罩裝上。"},{"english":"You just stick a stamp on the postcard and put it in the mailbox over there.","chinese":"貼張郵花再扔到前邊那個郵筒裏就可以了。"},{"english":"Any special character preceded by an escape shall match itself.","chinese":"肆意特殊字符前邊加轉義符都般配本身。"},{"english":"At the front a blond woman is arguing with an attendant.","chinese":"排在前邊的一個金髮女士正在和一個服務員爭執什麼。"},{"english":"He forged into the lead just before the end of the race.","chinese":"在賽跑接近終點時，他突然加速前進，跑到最前邊。"},{"english":"Please avoid parking in front of an open interment site unless you are part of a funeral procession.","chinese":"請避免將車停在前邊的一處墓葬園，除非您是送葬。"},{"english":"The 2 oval plates on the right of the picture.","chinese":"湯盤是右邊最前邊那個奶壺下面那個圓形的。"},{"english":"The pillar of cloud also moved from in front and stood behind them","chinese":"雲柱也從他們前邊轉到他們後邊立住。"}],"related":[]}