{"definition":["precursor"],"pinyin":["qian2 ti3"],"simplified":["前体"],"rank":48591.0,"normalized_rank":0.6798511325955255,"fraction":1.6729036038377426e-7,"cumulative_fraction":0.9987408104206308,"word":"前體","characters":[{"definition":["front\/forward\/ahead\/first\/top (followed by a number)\/future\/ago\/before\/BC (e.g. 前293年)\/former\/formerly"],"pinyin":["qian2"],"word":"前"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[],"sentences":[{"english":"Solid-Phase Synthesis of Enyne and Diyne Precursors.","chinese":"烯炔和二炔烴前體得固相合成。"},{"english":"The research progress in the prodrugs of antiviral drugs are reviewed.","chinese":"本文對抗病毒前體藥物研究進展作介紹。"},{"english":"Scientists at the YVO closely monitor the Yellowstone region for such precursors.","chinese":"在釩酸釔科學家密切留意這類前體黃石地區。"},{"english":"N-Nitrosamine can be formed in vivo by the interaction of nitrites with secondary amines .","chinese":"亞硝胺可由其前體物質亞硝酸鹽及二級胺在體內合成。"},{"english":"Imageable elements useful as lithographic printing plate precursors are disclosed.","chinese":"公開了可用作平版印版前體的可成像元件。"},{"english":"Besides, these compounds have the same character that all can be transformed to precursors of polyketide biosynthesis.","chinese":"而且它們都具有轉化爲聚酮合成前體的共同特徵。"},{"english":"Feed stimulating experiments were used to confirm precursors of monascus pigments.","chinese":"採用刺激實驗法確定紅曲色素的合成前體。"},{"english":"Objective To investigate the relativity of thrombus precursor protein in patients with acute cerebral infarction.","chinese":"目的探過血漿前體蛋白水平與急性腦梗死的相關性。"},{"english":"We have many other cancers in the body and precursor cancers that are also called carcinoma in-situ.","chinese":"人體有許多種癌而且很多癌症前體也稱爲原位癌。"},{"english":"Cyanide can serve as precursor for the amide nitrogen of asparagine .","chinese":"氰化物可以作一個天門冬酰胺的酰胺氮前體。"},{"english":"CONCLUSION The prodrug of 4-Aminotetrahydroacridine can be synthesized by this method.","chinese":"結論該法有助於他克林前體藥物的研究。"},{"english":"Glyoxylate rather than ascorbate is an efficient precursor for oxalate biosynthesis in rice.","chinese":"乙醛酸比抗壞血酸更能作爲水稻草酸合成的前體物質。"},{"english":"IDOL can even mediate the degradation of the receptor precursor in the endoplasmic reticulum.","chinese":"甚至，IDOL能調解內質網中受體前體的降解。"}],"related":[]}