{"definition":["to be just about to\/to have just started to"],"pinyin":["gang1 yi1"],"simplified":["刚一"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"剛一","characters":[{"definition":["hard\/firm\/strong\/just\/barely\/exactly"],"pinyin":["gang1"],"word":"剛"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"}],"containing_words":[],"sentences":[{"english":"It was incredible. They reached the shore and were shivering and nervous.","chinese":"剛一上岸，他倆顯得相當緊張，並且止不住的發抖。"},{"english":"The thrush flew out as soon as the boy opened the cage.","chinese":"男孩剛一打開鳥籠，畫眉鳥就飛出去了。"},{"english":"No sooner was Bahlul seated than he winked at the prince .","chinese":"巴魯剛一坐下就對王子眨一下眼睛。"},{"english":"No sooner had the patient taken the drug than she vomited.","chinese":"風溼痛剛一減輕，醫生就囑咐病人停止服藥。"},{"english":"As I took my seat I was greeted by a dazzling array of silverware at my place setting.","chinese":"剛一落座，我就被面前擺放的銀器弄得眼花繚亂。"},{"english":"A morning to just get up, has a nap impulse.","chinese":"早上剛一起牀，就有一股睡午覺的衝動。"},{"english":"Hardly had the attenuation of rheumatic pains occurs when the doctor instructed the patient to stop medication.","chinese":"風溼痛剛一減輕，醫生就囑咐病人停止服藥。"},{"english":"This song is as old as the hills. Even my grandfather can remember when he first heard it.","chinese":"這首歌老早就有了，甚至我爺爺剛一聽就記得起來。"},{"english":"Just a fall into green bottle of inside, in the bottle sent out uncanny red light.","chinese":"剛一落進青瓶內，瓶中就發出了詭異的紅光。"},{"english":"Liuchi was faced with a lot of difficulties immediately, after he began the preparations.","chinese":"剛一開始籌備，劉馳就遇到了困難。"},{"english":"Jack rushes into the first aid room as soon as the policeman disappears.","chinese":"警察剛一離開，傑克就衝進急救室。"},{"english":"As soon as his body developed he became obscene.","chinese":"肉體剛一成熟，他就變得淫猥了。"},{"english":"He ordered his hound to hark away when the fox was scurrying out of its cave.","chinese":"狐狸剛一竄出洞，他就命令他的獵犬衝了過去。"},{"english":"The writer's new book turned out a best-seller as soon as it hit the market.","chinese":"這位作家的新書剛一上市就成了獨門熱貨。"},{"english":"This album, just a listing, it caused a sensation.","chinese":"這張唱片，剛一上市，就引起了轟動。"},{"english":"Hardly had I got to Elland Road, when the stadium came into my vision.","chinese":"剛一踏上埃蘭路，不遠處的球場就映入眼簾。"}],"related":[]}