{"definition":["exploiter (of labor)"],"pinyin":["bo1 xue1 zhe3"],"simplified":["剥削者"],"rank":59441.0,"normalized_rank":0.8316567095266744,"fraction":4.5399041954060905e-8,"cumulative_fraction":0.9997905907149348,"word":"剝削者","characters":[{"definition":["to peel\/to skin\/to flay\/to shuck","to peel\/to skin\/to shell\/to shuck"],"pinyin":["bao1","bo1"],"word":"剝"},{"definition":["to pare\/to reduce\/to remove\/Taiwan pr. [xue4]","to peel with a knife\/to pare\/to cut (a ball at tennis etc)"],"pinyin":["xiao1","xue1"],"word":"削"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[{"definition":["person suffering exploitation\/the workers in Marxist theory"],"pinyin":["bei4 bo1 xue1 zhe3"],"word":"被剝削者"}],"sentences":[{"english":"Why orb spiders are successful receiver exploiters ?","chinese":"爲何結網性蜘蛛爲成功的受訊方剝削者？"},{"english":"He always sided with the oppressed and the exploited.","chinese":"他總是站在被壓迫和被剝削者一邊。"},{"english":"The exploiters have been smashed, but not destroyed.","chinese":"剝削者已經受到重擊，但沒有被消滅。"},{"english":"This precise behavior, makes you think he is exploitative and conniving.","chinese":"那些精明的行爲讓你覺得他是個老謀深算的剝削者。"},{"english":"After an explosion the explorer restored the storage of the explosive in the exploiters storehouse.","chinese":"爆炸過後勘探者恢復了剝削者的倉庫裏炸藥的儲量。"},{"english":"He denounced all landlords and money-lenders as evil predators.","chinese":"放債者都是罪惡的剝削者。"},{"english":"The exploiter soiled the boiling oil in the toilet.","chinese":"剝削者在盥洗室裏弄髒了沸騰的油。"},{"english":"After an explosion the explorer restored the storage of the explosive in the exploiter' s storehouse.","chinese":"爆炸過後勘探者恢復了剝削者的倉庫裏炸藥的儲量。"}],"related":[]}