{"definition":["to peel off\/to strip off"],"pinyin":["bo1 diao4"],"simplified":["剥掉"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"剝掉","characters":[{"definition":["to peel\/to skin\/to flay\/to shuck","to peel\/to skin\/to shell\/to shuck"],"pinyin":["bao1","bo1"],"word":"剝"},{"definition":["to fall\/to drop\/to lag behind\/to lose\/to go missing\/to reduce\/fall (in prices)\/to lose (value, weight etc)\/to wag\/to swing\/to turn\/to change\/to exchange\/to swap\/to show off\/to shed (hair)\/(used after certain verbs to express completion, fulfillment, removal etc)"],"pinyin":["diao4"],"word":"掉"}],"containing_words":[],"sentences":[{"english":"He is going to scalp me or burn me at the stake.","chinese":"他要剝掉我的頭皮或是在火刑柱上燒我。"},{"english":"An atom is stripped of all electrons by ionization.","chinese":"一個原子由於電離而被剝掉其全部電子。"},{"english":"The next day, when his body was found with his cortex pealed from his head.","chinese":"第二天，當丹納頭皮被剝掉的屍體被人發現的時候。"},{"english":"Ya gettin stripped from ya garments, boy, run ya jewels.","chinese":"你就要剝掉自己的衣服，小子，把你的珠寶留下。"},{"english":"I can peel them with my feet.","chinese":"我可以用腳把他們剝掉。"},{"english":"The child picked at the scab on his knee.","chinese":"那個孩子用指甲剝掉了傷疤。"},{"english":"He ripped away the mask of pretence which covered their activities.","chinese":"他剝掉了遮蓋他們行動的假面具。"},{"english":"Mam peels our potatoes but Dad eats its skin and all.","chinese":"媽媽幫我們剝掉土豆皮，可爸爸連皮一塊兒都吃了。"},{"english":"The Milky Way is the edge of this peel.","chinese":"銀河就是被剝掉的皮。"},{"english":"Remove some bark from the branch before burying.","chinese":"在埋進土裏前剝掉樹枝上的一些樹皮。"},{"english":"She shucked the corn before boiling it.","chinese":"煮玉米之前她把外面的殼剝掉了。"},{"english":"She ripped off the mask of the hypocrite mercilessly.","chinese":"她毫不留情地剝掉這個僞君子的畫皮。"},{"english":"They had gone to quite enough expense as it was, stripping the old parer off.","chinese":"光是剝掉舊紙一項費用已經很可觀了。"},{"english":"First, peel the bananas and cut it up.","chinese":"首先，剝掉香蕉皮並把香蕉切碎。"},{"english":"He peeled the bark off that tree.","chinese":"他把那棵樹的皮剝掉了。"},{"english":"The statesman shears the sheep, the politician skins them .","chinese":"政治家剪羊毛，政客則連羊皮也剝掉。"}],"related":[]}