{"definition":["to peel\/to strip\/to peel off\/to come off (of tissue, skin, covering etc)"],"pinyin":["bo1 li2"],"simplified":["剥离"],"rank":10478.0,"normalized_rank":0.14660081429350946,"fraction":0.000007668642671937882,"cumulative_fraction":0.933506233351156,"word":"剝離","characters":[{"definition":["to peel\/to skin\/to flay\/to shuck","to peel\/to skin\/to shell\/to shuck"],"pinyin":["bao1","bo1"],"word":"剝"},{"definition":["surname Li","to leave\/to part from\/to be away from\/(in giving distances) from\/without (sth)\/independent of\/one of the Eight Trigrams 八卦[ba1 gua4], symbolizing fire\/☲"],"pinyin":["Li2","li2"],"word":"離"}],"containing_words":[{"definition":["asset stripping"],"pinyin":["zi1 chan3 bo1 li2"],"word":"資產剝離"}],"sentences":[{"english":"From a research standpoint, have those divestitures had any effect?","chinese":"從研究的角度看，這些剝離有效果了嗎？"},{"english":"The human remains in those caves hadn't been de-fleshed, however.","chinese":"然而那些洞穴裏的人類屍體並沒有被剝離皮肉。"},{"english":"The iliopsoas is also separated from the capsule by blunt dissection and retracted medially.","chinese":"髂腰肌也從關節囊上被鈍性剝離並向內側牽開。"},{"english":"Several studies have shown that the investment in future stars rises sharply once laggards have been dumped.","chinese":"的部門被剝離，“明日之星”得到的投資會迅速增加。"},{"english":"The Journal also pointed to other recent players in the divestiture game.","chinese":"該報同時還列舉了剝離遊戲中的其他一些玩家。"},{"english":"Failure meant a stripping away of the inessential.","chinese":"失敗將那些非本質的東西都剝離了。"},{"english":"Chapter 4 makes a positive study of divestiture performance of the listed-company.","chinese":"第四章做了一個上市公司資產剝離的市場績效分析。"},{"english":"Bioleaching experiments on the open stripe nickel ore in Jinchuan Mine of China were carried out.","chinese":"進行了金川露天剝離鎳礦的生物浸出實驗。"},{"english":"Feeding can be done automatically find all the work of stripping paper recycling collection.","chinese":"能自動完成輸紙摸切剝離收紙工作循環。"},{"english":"The invention further discloses a processing technique of the easily stripped ceramic applique;","chinese":"本發明還公開了一種易剝離陶瓷貼花加工工藝。"},{"english":"Then it is ready to be peeled off, cut and sewn.","chinese":"然後，將它剝離，裁剪及車縫。"},{"english":"Its used to determine the peeling strength between the sole and the upper of a shoe .","chinese":"本機適用於檢驗成鞋鞋底和鞋幫之間的剝離強度。"},{"english":"The lateral approach is essentially dependent upon elevation of the insertion of the gluteus medius and minimus .","chinese":"外側入路主要依賴於臀中肌和臀小肌止點的剝離。"},{"english":"That scalps your naked soul.","chinese":"把你赤裸的靈魂剝離。"},{"english":"The recent conditions of research on wheel spalling in North American Railway are reviewed.","chinese":"回顧北美鐵路研究車輪剝離的近況。"},{"english":"You can also peel peaches, plums and apricots and boil or steam them.","chinese":"您也可以剝離桃子，李子和杏和煮沸或蒸汽。"}],"related":[{"definition":["to squeeze\/to press\/to extrude"],"pinyin":["ji3 ya1"],"word":"擠壓"},{"definition":["to conduct (heat, electricity etc)"],"pinyin":["chuan2 dao3"],"word":"傳導"},{"definition":["to separate"],"pinyin":["fen1 li2"],"word":"分離"},{"definition":["violent\/acute\/severe\/fierce"],"pinyin":["ju4 lie4"],"word":"劇烈"},{"definition":["to permute\/permutation (math.)\/to displace\/displacement\/to replace\/replacement"],"pinyin":["zhi4 huan4"],"word":"置換"},{"definition":["to cut off\/to sever"],"pinyin":["qie1 duan4"],"word":"切斷"},{"definition":["to condense\/to solidify\/to coagulate\/clot (of blood)"],"pinyin":["ning2 jie2"],"word":"凝結"},{"definition":["hidden beneath the surface\/buried and concealed"],"pinyin":["qian2 cang2"],"word":"潛藏"},{"definition":["to cut off\/to chop sth in half"],"pinyin":["zhan3 duan4"],"word":"斬斷"},{"definition":["remnant\/relic\/residue\/vestige\/surplus\/to remain\/to leave surplus"],"pinyin":["can2 yu2"],"word":"殘餘"},{"definition":["incorporeal\/virtual\/formless\/invisible (assets)\/intangible"],"pinyin":["wu2 xing2"],"word":"無形"},{"definition":["fracture\/rupture\/to break apart"],"pinyin":["duan4 lie4"],"word":"斷裂"},{"definition":["expansion\/dilation\/to expand (e.g. one's power or influence)\/to broaden"],"pinyin":["kuo4 zhang1"],"word":"擴張"},{"definition":["to bring up to full strength\/to make up a deficiency\/to fill (a vacancy, gap etc)"],"pinyin":["bu3 zu2"],"word":"補足"},{"definition":["to sublimate\/sublimation (physics)\/to raise to a higher level\/to refine\/promotion"],"pinyin":["sheng1 hua2"],"word":"升華"},{"definition":["to change\/to switch\/to convert\/to transform"],"pinyin":["zhuan3 huan4"],"word":"轉換"}]}