{"definition":["subtropical (zone or climate)"],"pinyin":["fu4 re4 dai4"],"simplified":["副热带"],"rank":59933.0,"normalized_rank":0.8385404278538748,"fraction":4.204155653623647e-8,"cumulative_fraction":0.9998120973067468,"word":"副熱帶","characters":[{"definition":["secondary\/auxiliary\/deputy\/assistant\/vice-\/abbr. for 副詞|副词 adverb\/classifier for pairs, sets of things & facial expressions"],"pinyin":["fu4"],"word":"副"},{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"熱"},{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"帶"}],"containing_words":[],"sentences":[{"english":"The storm is under the influence of STR.","chinese":"風暴正受副熱帶高壓脊的影響。"},{"english":"The NW edge of the subtropical ridge retreated a bit last night.","chinese":"影響浣熊的副熱帶高壓脊西北沿於昨晚稍稍東退。"},{"english":"A dynamical model is developed to simulate the variation of subtropical high ridge-line section (SHRS).","chinese":"發展了一個描述副熱帶高壓脊面變化的動力模型。"},{"english":"SARIKA will move NNE in the northwestern periphery of the subtropical ridge.","chinese":"莎莉嘉將沿副熱帶高壓脊西北面向東北偏北移動。"},{"english":"HALONG will move NE along the NW periphery of the subtropical ridge in the rest of the forecast period.","chinese":"夏浪將於餘下時間沿副熱帶高壓脊西北部向東北移動。"},{"english":"PEIPAH is now predominantly steered by the subtropical ridge ENE of it , inducing a weak NW movement.","chinese":"琵琶正沿副熱帶高壓脊的西南部向西北方向移動。"},{"english":"It is expected that WIPHA will travel northwards along the western periphery of the steering subtropical ridge.","chinese":"韋帕將在餘下時間沿副熱帶高壓脊之西部向北移動。"},{"english":"PEIPAH is now predominantly steered by the subtropical ridge ENE of it , inducing a WNW movement.","chinese":"琵琶正沿副熱帶高壓脊的西南部向西北偏西方向移動。"},{"english":"LUPIT will move NE in the northwestern periphery of the subtropical ridge.","chinese":"盧碧將沿副熱帶高壓脊向東北移動。"},{"english":"NAKRI will traverse the ridge axis of the steering subtropical ridge and recurve.","chinese":"娜基莉將橫過副熱帶高壓脊的脊線向北後轉東北移動。"},{"english":"The winter in Nanyue is colder while the subtropical high is stronger, and vice versa.","chinese":"西太平洋副熱帶高壓與南嶽冬季氣溫密切相關。"}],"related":[]}