{"definition":["by-product (lit. and fig.)"],"pinyin":["fu4 chan3 wu4"],"simplified":["副产物"],"rank":53101.0,"normalized_rank":0.7429518839281967,"fraction":1.0247629405707637e-7,"cumulative_fraction":0.9993393205884724,"word":"副產物","characters":[{"definition":["secondary\/auxiliary\/deputy\/assistant\/vice-\/abbr. for 副詞|副词 adverb\/classifier for pairs, sets of things & facial expressions"],"pinyin":["fu4"],"word":"副"},{"definition":["to give birth\/to reproduce\/to produce\/product\/resource\/estate\/property"],"pinyin":["chan3"],"word":"產"},{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"}],"containing_words":[],"sentences":[{"english":"EA is oxidized completely and no partially oxidized side-products are formed over the catalysts.","chinese":"乙酸乙酯在催化劑上完全被氧化且無副產物生成。"},{"english":"Sweet potato residue is the by-product of sweet potato starch process.","chinese":"紅薯渣爲紅薯澱粉加工過程中的副產物。"},{"english":"The compound stabilizer of water is synthetized from the by product in production of acetyl chloride.","chinese":"採用乙酰氯副產物爲原料合成複合水質穩定劑。"},{"english":"The excess amine is employed to selectively neutralize by-product acid as the amine salt.","chinese":"使用該過量的胺將副產物酸選擇性中和爲胺鹽。"},{"english":"At present, enhanced coagulation is the best available technology to control DBPs.","chinese":"強化混凝是目前控制消毒副產物的最佳可行性技術。"},{"english":"The effluent is then sent to the separation section to remove the light by-product.","chinese":"流出物再送到分離段以脫除輕質副產物。"},{"english":"Sodium metaborate is a by-product from deoxidation of sodium borohydride.","chinese":"偏硼酸鈉是硼氫化鈉的還原副產物。"},{"english":"Up to now, there are more than 200 DBPs have been detected.","chinese":"目前已檢測出消毒副產物有200多種。"},{"english":"Sewage sludge is a by-product of the wastewater-treatment system.","chinese":"污泥是污水處理系統產生的副產物。"},{"english":"They are the byproducts of another system.","chinese":"它們是另一個機制的副產物。"},{"english":"The main by-product during the production of acrylonitrile is acetonitrile.","chinese":"乙腈是丙烯氨氧化制丙烯腈的主要副產物，用途很小。"},{"english":"Corn protein powder is the main one of by-products that produce the starch in corn wet-milling process.","chinese":"玉米蛋白粉是玉米溼法生產澱粉的主要副產物之一。"},{"english":"Skimmed milk powder is a by-product of butter production.","chinese":"脫脂奶粉是出產黃油的副產物。"},{"english":"Phthalic anhydride residue is the by product from oxidation of naphthalene oro xylene.","chinese":"苯酐渣系萘氧化或鄰二甲苯氧化的副產物。"},{"english":"From these results, it can be concluded that all the byproducts of purple potato starch extraction have a notable antihyperglycemic effect.","chinese":"提取紫薯澱粉後的副產物均有明顯降血壓作用。"},{"english":"They instead looked for a by-product of cancer.","chinese":"相反，他們關注的是癌症的副產物。"}],"related":[]}