{"definition":["to earn foreign exchange"],"pinyin":["chuang4 hui4"],"simplified":["创汇"],"rank":15420.0,"normalized_rank":0.21574580610860045,"fraction":0.00000394752698560037,"cumulative_fraction":0.9607326346916776,"word":"創匯","characters":[{"definition":["a wound\/cut\/injury\/trauma","to begin\/to initiate\/to inaugurate\/to start\/to create"],"pinyin":["chuang1","chuang4"],"word":"創"},{"definition":["to remit\/to converge (of rivers)\/to exchange"],"pinyin":["hui4"],"word":"匯"}],"containing_words":[],"sentences":[{"english":"In 2008, the company exports exceeded $ 100 million.","chinese":"2008年，公司出口創匯突破1億美元。"},{"english":"The company is one of the most valuable exporters in Sichuan province.","chinese":"公司是四川省出口創匯的重點企業之一。"},{"english":"We hope to explore overseas markets, and develop processing industries and hard –cash earning exports.","chinese":"我們希望開拓國際市場，發展加工生產和創匯產品。"},{"english":"Garment industry is an important business to earn foreign exchange through export in china.","chinese":"服裝行業是我國出口創匯的重要行業。"},{"english":"Sugar is Fiji's second biggest export earner.","chinese":"糖是斐濟第二大出口創匯產品。"},{"english":"They're mainly for export to earn foreign exchange.","chinese":"它們主要用來出口創匯。"},{"english":"This factory has several products that can earn foreign exchange through export .","chinese":"出口創匯的產品在該廠有好幾種。"},{"english":"In 2005, NCLE exported US$200 million, taking the second place in Ningbo.","chinese":"2005年公司出口創匯2億美元，列寧波市第二。"},{"english":"The agricultural extravert type enterprises are developed strongly and the ability of agricultural products export is strengthened.","chinese":"確保大力發展外向型農業，增強出口創匯的能力。"},{"english":"The nutrition is rich and economic benefits is high.","chinese":"營養豐富，經濟價值高，是出口創匯的重要產品。"},{"english":"Hebei vegetables is the main export volume of agricultural products.","chinese":"蔬菜是河北省出口創匯的主要農產品。"},{"english":"Product best-selling Japan and South Korea have repeatedly been rated as advanced units of export.","chinese":"產品暢銷日韓，多次被評爲出口創匯先進單位。"}],"related":[]}