{"definition":["to root out\/to eradicate\/to sweep away\/to abolish"],"pinyin":["chan3 chu2"],"simplified":["铲除"],"rank":16918.0,"normalized_rank":0.2367047696332881,"fraction":0.000003313984085019584,"cumulative_fraction":0.9661473049987912,"word":"剷除","characters":[{"definition":["to level off\/to root up"],"pinyin":["chan3"],"word":"剷"},{"definition":["to get rid of\/to remove\/to exclude\/to eliminate\/to wipe out\/to divide\/except\/not including"],"pinyin":["chu2"],"word":"除"}],"containing_words":[],"sentences":[{"english":"They weeded the mounds and piled fresh dirt atop.","chinese":"他們剷除墳上的雜草，再將在墳頂堆上新鮮的土。"},{"english":"Though thou shouldst bray a fool in the mortar, as when a pestle striketh upon sodden barley, his folly would not be taken from him.","chinese":"你儘可在臼中將愚人舂碎，但他的昏愚卻永不能剷除。"},{"english":"The razing of slums has added to the number of homeless, and dozens have died from exposure to the cold, literally freezing to death.","chinese":"對貧民窟的剷除也增加了無家可歸者的人數。"},{"english":"The vice-adviser advised the reviser to devise a device forgetting rid of vice.","chinese":"代辦參謀倡議校正者想出一個剷除惡習的計謀。"},{"english":"In the sphere of theory, destroy the roots of ultra-democracy.","chinese":"從理論上剷除極端民主化的根苗。"},{"english":"They did away with more than 20 local despots that year.","chinese":"那一年他們剷除了20多個惡霸。"},{"english":"And tanaka has been dried tangerine or orange peel to remove, changsha temporary calm for a period of time.","chinese":"而田中也被陳皮剷除了，長沙暫時平靜了一段時間。"},{"english":"By eliminating this ticking time-bomb, the possibility of serious accidents had been ruled out.","chinese":"剷除了一顆定時炸彈，避免了災難性事故的發生。"},{"english":"\"Father, do you think Patrick should be eliminated?\" Estelle asked.","chinese":"“父親，你也認爲帕特里克應該剷除？”埃斯特爾問。"},{"english":"Workers rake up globs of oil, which have come ashore on the beaches.","chinese":"工人以犁耙剷除已漂到海灘上岸的油水珠。"},{"english":"Abstact: Human society has entered into era that it wants to eradicate any colonist system thoroughly since 20th century.","chinese":"世紀以來，人類社會進入了徹底剷除殖民制度的時代。"},{"english":"Shortly thereafter, the Separatists arrived, determined to wipe out the Lurmen village.","chinese":"不久以後，分裂勢力抵達馬裏登，決定剷除勒明人。"},{"english":"Must it be weeded out?","chinese":"但它們必須要被剷除麼？"},{"english":"The vice-mechanic suggested the reviser to devise a computer device forgetting rid of vice.","chinese":"代理照拂建議校訂者想出一個剷除惡習的計謀。"},{"english":"Thus Yan Ying was able to remove three potential threats to the country of Qi without lifting a finger.","chinese":"於是晏嬰不費吹灰之力就剷除了齊國的三個隱患。"},{"english":"It is a great failure that China did not erased Lamaism in Tibet.","chinese":"中國一直未能剷除喇嘛教是一大敗筆。"}],"related":[{"definition":["dissident\/alien\/outsider"],"pinyin":["yi4 ji3"],"word":"異己"},{"definition":["to plot actively (idiom)\/scheming\/calculating"],"pinyin":["chu3 xin1 ji1 lu:4"],"word":"處心積慮"},{"definition":["a thorn in one's side"],"pinyin":["yan3 zhong1 ding1"],"word":"眼中釘"},{"definition":["to recover one's power or authority\/restoration (of a past regime)"],"pinyin":["fu4 bi4"],"word":"復辟"},{"definition":["to kill\/to murder"],"pinyin":["zhu1 sha1"],"word":"誅殺"},{"definition":["to purge"],"pinyin":["su4 qing1"],"word":"肅清"},{"definition":["to oppose each other with equal harshness (idiom); tit for tat\/measure for measure"],"pinyin":["zhen1 feng1 xiang1 dui4"],"word":"針鋒相對"},{"definition":["abuse of authority"],"pinyin":["lan4 quan2"],"word":"濫權"},{"definition":["to collude with\/to collaborate with\/to gang up with"],"pinyin":["gou1 jie2"],"word":"勾結"},{"definition":["to decide alone without consultation\/arbitrary\/dictatorial"],"pinyin":["du2 duan4"],"word":"獨斷"},{"definition":["to rope in\/fig. to involve sb\/to entice"],"pinyin":["la1 long3"],"word":"拉攏"},{"definition":["militarism"],"pinyin":["jun1 guo2 zhu3 yi4"],"word":"軍國主義"},{"definition":["bring order out of chaos\/set to rights things which have been thrown into disorder"],"pinyin":["bo1 luan4 fan3 zheng4"],"word":"撥亂反正"},{"definition":["racism"],"pinyin":["zhong3 zu2 zhu3 yi4"],"word":"種族主義"},{"definition":["unfettered and beyond the law (idiom); evading retribution\/getting away with it (e.g. crimes)\/still at large"],"pinyin":["xiao1 yao2 fa3 wai4"],"word":"逍遙法外"},{"definition":["to loot\/looting"],"pinyin":["qiang3 lu:e4"],"word":"搶掠"}]}