{"definition":["to top up\/to fill to the brim"],"pinyin":["jia1 man3"],"simplified":["加满"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"加滿","characters":[{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"},{"definition":["Manchu ethnic group","to fill\/full\/filled\/packed\/fully\/completely\/quite\/to reach the limit\/to satisfy\/satisfied\/contented"],"pinyin":["Man3","man3"],"word":"滿"}],"containing_words":[],"sentences":[{"english":"You drive to a gasoline station once a week, on average, and you fill up.","chinese":"你平均一週去一次加油站加滿油。"},{"english":"I fill up the tank with gasoline about once a week.","chinese":"大約每個星期我加滿一箱汽油。"},{"english":"He fille up the car with petrol.","chinese":"他給汽車加滿了油。"},{"english":"In a tactical reload, you are \"topping off\" your gun with a fresh magazine.","chinese":"在戰術換彈匣，你是用新的彈匣加滿你的槍。"},{"english":"If you are using a concentrate, top up with filtered water to 23 liters.","chinese":"如果您使用集中，用被過濾的水加滿對23公升。"},{"english":"Top up weekly with Lubrication Engineers 4090-H1 Quinplex food-grade grease.","chinese":"每週須給此係統加滿食品級潤滑脂。"},{"english":"NO. 005 BF replenisher tank is empty, add replenisher.","chinese":"漂白補充桶已空，請加滿補充液。"},{"english":"Then a waiting man comes over, he wants to fill up for me.","chinese":"接着我名男服務員走過來，他想爲我加滿水。"},{"english":"NO. 004 CD replenisher tank is empty, add replenisher.","chinese":"顯影補充桶已空，請加滿補充液。"},{"english":"Keep a water bottle at your desk when you work, and refill it regularly.","chinese":"當你工作的時候，桌子上放一個水壺，定時的加滿它。"},{"english":"The boy told the broom to fill a tub in the castle. The tub was empty.","chinese":"小夥子要掃帚把城堡裏一個空浴缸的水加滿。"},{"english":"A free gift is given with each fill-up.","chinese":"每加滿一次油都可拿到免費贈品。"},{"english":"Please. Refill it for me just this once.","chinese":"但是我還需要，拜託，幫我加滿這次就好。"},{"english":"I must get the car filled up at a gas station.","chinese":"我必須到加油站給車加滿油。"},{"english":"A jigger of cognac, and you're going to top it off with champagne or sparkling wine.","chinese":"一量杯柯納克白蘭地，然後用香檳或汽水酒加滿。"},{"english":"We tanked up at the filling station.","chinese":"我們在加油站給汽車加滿了油。"}],"related":[]}