{"definition":["Calvin (1509-1564), French protestant reformer"],"pinyin":["Jia1 er3 wen2"],"simplified":["加尔文"],"rank":62358.0,"normalized_rank":0.8724693240804219,"fraction":2.7881726730629044e-8,"cumulative_fraction":0.9998963351561092,"word":"加爾文","characters":[{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"},{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"},{"definition":["language\/culture\/writing\/formal\/literary\/gentle\/(old) classifier for coins\/Kangxi radical 67","surname Wen"],"pinyin":["Wen2","wen2"],"word":"文"}],"containing_words":[],"sentences":[{"english":"Contemporary Calvinists may sometimes be responsible for perpetuating this image.","chinese":"當代的加爾文派也許要爲延續這種印象負責。"},{"english":"1566 - Calvinists are granted rights in the Netherlands.","chinese":"1566年的今天，荷蘭承認加爾文教。"},{"english":"Calvinism was the most convenient religion since the days of the ancients.","chinese":"加爾文主義是自古以來最方便的宗教。"},{"english":"Calvinism isn't a religion of subservience to any government.","chinese":"加爾文教不爲政府服務。"},{"english":"Calvinist Christianity has a culture of phenomenal industry.","chinese":"基督教加爾文主義擁有矚目的產業文化。"},{"english":"Like the Pilgrims, they were also Calvinists.","chinese":"他們如同新教徒一樣是屬於加爾文教派。"},{"english":"He dispelled the myth that Calvinism was anti-evangelistic.","chinese":"他驅散了那種認爲加爾文主義反對傳福音的神話。"},{"english":"This is particularly true of the Calvinist tradition.","chinese":"尤其是這樣的加爾文主義的傳統。"},{"english":"But by parity of reasoning it falls upon Calvinism.","chinese":"但平價的推理，它落在加爾文。"},{"english":"Carwin was wanted in dublin for theft and murder .","chinese":"加爾文因偷盜和謀殺正受都柏林方面通輯。"},{"english":"How many Calvinists does it take to change a light bulb?","chinese":"更換一個燈泡要勞動多少個加爾文主義者？"},{"english":"I've read your stuff about the psychological realism of Calvin.","chinese":"我讀過你論加爾文心理唯實論的文章。"},{"english":"Calvin and Hodge take this view.","chinese":"加爾文與賀治都持著這看法。"},{"english":"Popery . For an account of the \"Institutes\" see CALVINISM.","chinese":"對於一個帳戶的“研究所”看到加爾文主義。"},{"english":"Too frequently this is the popular image of Calvinism.","chinese":"這往往是人們對加爾文主義的普遍印象。"},{"english":"I've read your stuff about the psychological realism of Calvin .","chinese":"我讀過你論加爾文心理唯實論的文章。"}],"related":[]}