{"definition":["Gasol (name)\/Pau Gasol (1980-), Spanish professional basketball player (NBA)\/Marc Gasol (1985-), Spanish professional basketball player (NBA)"],"pinyin":["Jia1 suo3 er3"],"simplified":["加索尔"],"rank":27852.0,"normalized_rank":0.3896856155471297,"fraction":0.0000011440266617169624,"cumulative_fraction":0.9880128120002768,"word":"加索爾","characters":[{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"},{"definition":["surname Suo\/abbr. for 索馬里|索马里[Suo3 ma3 li3], Somalia","to search\/to demand\/to ask\/to exact\/large rope\/isolated"],"pinyin":["Suo3","suo3"],"word":"索"},{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"}],"containing_words":[],"sentences":[{"english":"How are Lakers fans supposed to interpret these comments?","chinese":"湖人球迷應當這麼解讀加索爾的表態呢？"},{"english":"But make no mistake; Gasol and Bryant are totally geeked about the Olympics.","chinese":"了，加索爾和科比在奧林匹克運動會上完全沒經驗。"},{"english":"Do you put Lamar on him or Gasol?","chinese":"讓拉瑪爾或加索爾防他？"},{"english":"Biarritz, Pau and Saint-Jean-Pied-de-Port are here.","chinese":"比亞里茨，加索爾，聖讓皮耶德港也在那裏。"},{"english":"Pau and Andrew, their work on the boards tonight was sensational.","chinese":"加索爾和拜納姆在保護籃板球上是很出色的。"},{"english":"At least they have learned they can't wait for Bynum and Gasol to return and rescue them.","chinese":"至少他們學到了不能等拜納姆和加索爾來救他們。"},{"english":"Gasol hit a pair of free throws, but the Lakers could not catch up.","chinese":"加索爾兩罰全中，但是湖人還是沒能追上。"},{"english":"Gasol led the Lakers with 21 points and 11 rebounds.","chinese":"加索爾帶領湖人比賽，拿下21分11個籃板球。"},{"english":"The Grizzlies are 5-20 since trading Pau Gasol to the Lakers.","chinese":"自從交易走加索爾之後，灰熊的戰績是5勝20負。"},{"english":"The Lakers with Gasol are about 7 points better on offense than the freaking Suns.","chinese":"有了加索爾的湖人要比狂熱的太陽進攻還要高7分。"}],"related":[]}