{"definition":["a play-off\/replay"],"pinyin":["jia1 sai4"],"simplified":["加赛"],"rank":47229.0,"normalized_rank":0.6607949855190072,"fraction":1.9108471356226922e-7,"cumulative_fraction":0.9984969644294802,"word":"加賽","characters":[{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"},{"definition":["to compete\/competition\/match\/to surpass\/better than\/superior to\/to excel"],"pinyin":["sai4"],"word":"賽"}],"containing_words":[{"definition":["additional competition\/play-off\/decider"],"pinyin":["fu4 jia1 sai4"],"word":"附加賽"}],"sentences":[{"english":"I'm happy to be a part of a team that's a contender and looking forward to playoffs.","chinese":"我是快樂是一個競爭者的隊一部份而且期望延長加賽。"},{"english":"In Playoffs, if a draw occurs, MR3 will be played.","chinese":"在季後賽，如果平局出現，將會進行MR3的加賽。"},{"english":"The score was 0∶0,so they are going to play off.","chinese":"比賽打成零比零，所以他們將加賽定勝負。"},{"english":"The superiority is very small, but they are flushing at least also ultra attach fence-off the row.","chinese":"優勢很小，可他們至少還在衝超附加賽之列。"},{"english":"The last round they won 4 to 0 smoothly Malta, into the playoff.","chinese":"最後一輪他們4比0順利拿下馬耳他，進入附加賽。"},{"english":"We missed the play-offs and ended in undignified fashion.","chinese":"我們錯過了附加賽，而且以一種不體面的方式結束。"},{"english":"All the same, nobody should have been surprised at the seeding of the play-offs this year in particular.","chinese":"看看吧，今年附加賽的分檔出爐時，有誰曾感到驚訝？"},{"english":"Hiroshi Ohashi, speaking before the play-off with Mexico.","chinese":"大橋浩司在同墨西哥隊的附加賽之前說到。"},{"english":"Swindon are currently sixth in League One and in the play-off position.","chinese":"斯維頓目前排名英甲第六，擁有附加賽資格位置。"}],"related":[]}