{"definition":["to add\/to mix in\/to incorporate"],"pinyin":["jia1 jin4"],"simplified":["加进"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"加進","characters":[{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[],"sentences":[{"english":"Further Practice for Pairs ·Add a third speaker and create your own lines.","chinese":"加進圈外人，創作你們自己的對話。"},{"english":"The trick is to add that food into your meals in very small amounts.","chinese":"小竅門就是往你的飯菜中加進少量的此種食物。"},{"english":"So this is where the mixing of the solute comes in.","chinese":"這是加進來的溶質混合引起的。"},{"english":"You have added too much liquid to the mixture.","chinese":"你給這混合物加進了過多的液體。"},{"english":"She wrote in some examples in her paper.","chinese":"她在論文里加進了一些實例。"},{"english":"Centola recruited more than 1,500 participants for what was billed as a Web-based health community.","chinese":"森特拉把1500多名用戶加進了一個網絡衛生社區。"},{"english":"Can you add me in? thank.","chinese":"把我也加進去吧？謝謝老帥。"},{"english":"Fold in the beaten whites of two eggs.","chinese":"加進兩個打散的蛋清後攪勻。"},{"english":"Focus on a variety of seasonal berries and add them to plain, no-fat yogurt.","chinese":"把各種時令漿果加進清淡無脂的酸奶中，效果更好。"},{"english":"Add the egg and vanilla extract and beat to combine.","chinese":"把雞蛋和香草粉加進去，打勻。"},{"english":"Well, the woodsman was a later addition to the tale.","chinese":"其實這個樵夫是後來加進故事的。"},{"english":"They didn't add the actual new piece of information that came out yesterday.","chinese":"他們沒有把昨天剛出的真實新聞信息加進來。"},{"english":"So I included Rieann in my Powa service.","chinese":"因此我將她加進頗瓦超度之列。"},{"english":"I was worried, so I went to look for him after school. I found him running all alone. I asked him how he felt.","chinese":"毫無疑問小瓊尼看到他們玩就會馬上加進去跑啊鬧的。"},{"english":"Ugh! I already smell it. Two things go in.","chinese":"額，我已經聞到了，兩樣東西加進去。"},{"english":"Please add these names on to your list.","chinese":"請把這些名字加進你的名單裏。"}],"related":[]}