{"definition":["to make heavier\/to emphasize\/(of an illness etc) to become more serious\/to aggravate (a bad situation)\/to increase (a burden, punishment etc)"],"pinyin":["jia1 zhong4"],"simplified":["加重"],"rank":6239.0,"normalized_rank":0.08729170455976383,"fraction":0.000017458048306925915,"cumulative_fraction":0.8842988828363024,"word":"加重","characters":[{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"},{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["chong2","zhong4"],"word":"重"}],"containing_words":[{"definition":["to give emphasis\/with emphasis"],"pinyin":["jia1 zhong4 yu3 qi4"],"word":"加重語氣"}],"sentences":[{"english":"But problems within that force have put additional burdens on MONUC.","chinese":"但是該部隊內部的問題加重了MONUC的負擔。"},{"english":"Punish recidivists with increased sentences is explicitly promulgated in many countries' penal codes.","chinese":"加重處罰累犯，在很多國家的刑法典中都有明確規定。"},{"english":"Causes on the kidney the knee to abstain the response to cause the blood fine to elevate, causes the condition aggravation.","chinese":"引起腎上膝戒反應而使血精升高，使病情加重。"},{"english":"Nimodipine could prevent the calcium overload in ischemic myocyte.","chinese":"尼莫地平能阻止缺血心肌細胞鈣超載的發展和加重。"},{"english":"Conclusion The victim died suddenly after a person being untied because the cerebral e…","chinese":"結論受害者鬆綁後即死主要是腦水腫即刻加重的結果。"},{"english":"You may be adding considerably to your debt burden.","chinese":"你會大大的加重債務負擔。"},{"english":"CVR were worsen graduately with the severity of hypertension.","chinese":"隨着高血壓程度的加重。"},{"english":"But isolating yourself can only worsenthose depressive symptoms.","chinese":"但是孤立自己只會加重抑鬱症狀。"},{"english":"Dry towels and heavier cottons in a separate load from lighter-weight clothes.","chinese":"乾毛巾和加重棉花在一個單獨的負荷由輕重量的衣服。"},{"english":"With the intensification of left ventricular hypertrophy, the LVDF decreased further.","chinese":"且隨着左室肥厚的加重，舒張功能進一步減退。"},{"english":"The economic crisis has intensified the pain from all these burdens.","chinese":"而經濟危機本身加重了這些負擔帶來的痛感。"},{"english":"The ground was covered with okra paint, enhancing the redness of theplace.","chinese":"地面鋪滿秋葵的圖案，加重了祭壇內部的紅色調。"},{"english":"Merge the brain contusion and laceration more to harm or after the hair brain dropsy, the condition aggravate.","chinese":"多合併腦挫裂傷或者繼發性腦水腫，病情加重。"},{"english":"Several drugs may induce or exacerbate symptoms in acute porphyria.","chinese":"幾種藥物可能會誘發或加重症狀的急性卟啉症。"},{"english":"Symptoms are often worse while in bed or first thing in the morning.","chinese":"通常在睡前和晨起時症狀加重。"},{"english":"Doesn`t reading in poor light make the eyes focus more and cause myopia to increase?","chinese":"在暗光下閱讀，不會使雙眼過度聚焦，引起近視加重？"}],"related":[{"definition":["to intensify\/to sharpen\/to accelerate\/to aggravate\/to exacerbate\/to embitter"],"pinyin":["jia1 ju4"],"word":"加劇"},{"definition":["to induce\/to cause\/to elicit\/to trigger"],"pinyin":["you4 fa1"],"word":"誘發"},{"definition":["to lighten\/to ease\/to alleviate"],"pinyin":["jian3 qing1"],"word":"減輕"},{"definition":["to weaken\/to fall off"],"pinyin":["jian3 ruo4"],"word":"減弱"},{"definition":["burden\/to bear a burden"],"pinyin":["fu4 dan1"],"word":"負擔"},{"definition":["to worsen"],"pinyin":["e4 hua4"],"word":"惡化"},{"definition":["to harm\/to damage\/to injure\/impairment\/loss\/disability"],"pinyin":["sun3 shang1"],"word":"損傷"},{"definition":["grave\/serious\/severe\/critical"],"pinyin":["yan2 zhong4"],"word":"嚴重"},{"definition":["to lead to\/to create\/to cause\/to bring about"],"pinyin":["dao3 zhi4"],"word":"導致"},{"definition":["to bring relief\/to alleviate (a crisis)\/to dull (a pain)"],"pinyin":["huan3 jie3"],"word":"緩解"},{"definition":["to reduce\/to lower\/to bring down"],"pinyin":["jiang4 di1"],"word":"降低"},{"definition":["to ebb\/to go down\/to decline"],"pinyin":["jian3 tui4"],"word":"減退"},{"definition":["overweight (luggage)"],"pinyin":["guo4 zhong4"],"word":"過重"},{"definition":["to raise\/to ascend"],"pinyin":["sheng1 gao1"],"word":"昇高"},{"definition":["to flare up\/to break out"],"pinyin":["fa1 zuo4"],"word":"發作"},{"definition":["excessive\/over-\/excess\/going too far\/extravagant\/intemperate\/overdue"],"pinyin":["guo4 du4"],"word":"過度"}]}