{"definition":["enthusiasm\/zeal\/vigor\/strength"],"pinyin":["jin4 tou2"],"simplified":["劲头"],"rank":20105.0,"normalized_rank":0.2812950344885481,"fraction":0.000002368778951088573,"cumulative_fraction":0.9750880555401896,"word":"勁頭","characters":[{"definition":["stalwart\/sturdy\/strong\/powerful","strength\/energy\/enthusiasm\/spirit\/mood\/expression\/interest\/CL:把[ba3]\/Taiwan pr. [jing4]"],"pinyin":["jin4","jing4"],"word":"勁"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"}],"containing_words":[{"definition":["to have no strength\/to feel weak\/feeling listless"],"pinyin":["mei2 you3 jin4 tou2"],"word":"沒有勁頭"},{"definition":["erhua variant of 沒有勁頭|没有劲头[mei2 you3 jin4 tou2]"],"pinyin":["mei2 you3 jin4 tou2 'r"],"word":"沒有勁頭兒"}],"sentences":[{"english":"He gathered up his strength for the new job.","chinese":"他鼓足勁頭來開展新的工作。"},{"english":"I think we''ll have more drive under him.","chinese":"我認爲，在他的領導下我們會更有勁頭。"},{"english":"Charles is such a gasser when he gets going about himself.","chinese":"查爾斯一談到自己，就勁頭十足，滔滔不絕。"},{"english":"As for getting a feel for the life of locals, Wang Yuanyuan has more enthusiasm than me.","chinese":"要說感受市民的生活，王淵源的勁頭兒可比我要大。"},{"english":"Listening to her and seeing the way of her talking with men really turns my stomach.","chinese":"聽她講話，看她和男人講話的那股勁頭兒真讓我噁心。"},{"english":"Among the five subjects, Jiang learnt English most industriously.","chinese":"這五科當中，姜浩學英語的勁頭是最足的。"},{"english":"Over the next few years, my work gained momentum.","chinese":"隨後幾年裏，我的工作勁頭更足。"},{"english":"Good teamwork requires a group of motivated people.","chinese":"傑出的團隊工作需要有一組勁頭實足的成員。"},{"english":"He is a man of push and goes in his career.","chinese":"他對自己的事業勁頭十足。"},{"english":"But I still drive to perform the full duty, indomitable.","chinese":"但我仍然勁頭十足地履行天職，不屈不撓。"},{"english":"Old as he is, he works as energetically as young people.","chinese":"他雖然上了年紀，幹起活來跟年輕人的勁頭一樣大。"},{"english":"What is meant by \"a person full of juice\"?","chinese":"“一個充滿果汁的人”是說這個人勁頭十足。"},{"english":"Harry is such a gasbag when he gets going about himself.","chinese":"一談到自己，哈里就會誇誇其談，勁頭十足。"},{"english":"The body is revolutionary capital, healthy study energy talent is higher.","chinese":"身體是革命的本錢，身體健康學習勁頭兒才更高。"},{"english":"He always works like a tiger.","chinese":"他工作起來總是勁頭十足。"},{"english":"In turn, they disparaged our elitism and urban mores.","chinese":"相應的，他們也蔑視我們的優越勁頭和城市做派。"}],"related":[]}