{"definition":["to dare to\/to be brave enough to"],"pinyin":["yong3 yu2"],"simplified":["勇于"],"rank":9888.0,"normalized_rank":0.13834594881983406,"fraction":0.000008410063038769636,"cumulative_fraction":0.9287635349928268,"word":"勇於","characters":[{"definition":["brave"],"pinyin":["yong3"],"word":"勇"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[],"sentences":[{"english":"The principal must be hard-working, good at learning and enterprising.","chinese":"校長必須是一個勤奮學習，善於學習，勇於進取的人。"},{"english":"Serendipitous people are more fearless about trying something new.","chinese":"偶爾人們會更加勇於嘗試新鮮事物。"},{"english":"Hu calls on teachers to embrace innovation.","chinese":"胡錦濤要求教師要勇於創新。"},{"english":"Create a culture based on innovation and cooperation.","chinese":"建立以“勇於創新，精誠合作”爲基礎的企業文化。"},{"english":"The courage to go off is dedicated to each person.","chinese":"騰飛是獻給每位勇於進取的人。"},{"english":"Sanhui people will march on further for greater target.","chinese":"勇於開拓的“三惠人”將目光投向了更遠大的目標。"},{"english":"The man, who can express his apology as soon as he knows what he did just now is wrong, is a real wise.","chinese":"立即表達心中的想法，勇於認錯纔是真正的勇者。"},{"english":"A great scholar and poet, Wen Yiduo was brave in absorbing all exotic nutrition beneficial to his pursuit of poetic art.","chinese":"聞一多在詩藝追求中勇於汲納一切有益的外來營養。"},{"english":"\"Innovative, brave in exploitation\" is our persistent pursuit.","chinese":"“敢於創新，勇於開拓”是我執著的追求。"},{"english":"Dare to face the reality, have the courage to take responsibility, will progress.","chinese":"罌敢於面對現實，勇於承擔責任，纔會不斷進步。"},{"english":"Companies need to learn how to unlearn , to slough off yesterdays wisdom.","chinese":"公司要學會怎樣放棄，要勇於拋棄昨日的成就。"},{"english":"Generalists need to be versatile and open to failure.","chinese":"通才需具備多方面才能，且勇於面對失敗。"},{"english":"With self-confidence, open mind, positive and creativity.","chinese":"自信，思維開闊，積極進取並勇於創新。"},{"english":"Open your mind to new ideas and activites, and don't be afraid to try.","chinese":"勇於接受新觀點新舉措，不要害怕嘗試。"},{"english":"Woe unto them that are mighty to drink wine, and men of strength to mingle strong drink","chinese":"禍哉，那些勇於飲酒，以能力調濃酒的人。"},{"english":"The main thing is not to give way to a famous authority but courageously defend your opinion.","chinese":"關鍵要記住不要屈服於權威，要勇於保持自己的觀點。"}],"related":[]}