{"definition":["gerund"],"pinyin":["dong4 ming2 ci2"],"simplified":["动名词"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"動名詞","characters":[{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"},{"definition":["word\/statement\/speech\/lyrics\/CL:組|组[zu3],個|个[ge4]\/a form of lyric poetry, flourishing in the Song dynasty 宋朝|宋朝[Song4 chao2]\/CL:首[shou3]"],"pinyin":["ci2"],"word":"詞"}],"containing_words":[],"sentences":[{"english":"You've got mixed up by the use of participle and gerund.","chinese":"你混淆了現在分詞和動名詞的用法。"},{"english":"In english grammar the gerund have exactly the same form as the present participle.","chinese":"英語文法中，動名詞具有與現在分詞完全一樣的形式。"},{"english":"In english grammar the gerund has exactly the same form as the present participle.","chinese":"英語語法中，動名詞具有與現在分詞完全一樣的形式。"},{"english":"Voice is a property of clauses, and infinitives and gerunds form phrases.","chinese":"語態是從句的屬性，不定式和動名詞構成短語。"},{"english":"The gerund must not be confused with the present participle.","chinese":"動名詞不應與現在分詞混淆。"},{"english":"There can be a difference in meaning when the infinitive or the gerund is used after some verbs.","chinese":"某些動詞後用不定式或動名詞時，意思有不同。"},{"english":"Pick out the participles or gerunds in the following sentences and give their functions.","chinese":"區別下列句子中的分詞和動名詞，並說明它們的作用。"},{"english":"I have trouble telling the difference between a gerund and a participle.","chinese":"動名詞和分詞的區別，我分不出來。"},{"english":"Gerund is an important part of English grammar in English teaching.","chinese":"動名詞是英語教學中一項重要語法內容。"}],"related":[]}