{"definition":["to budge"],"pinyin":["dong4 tan5"],"simplified":["动弹"],"rank":15192.0,"normalized_rank":0.2125557902984344,"fraction":0.0000040533607650752715,"cumulative_fraction":0.9598205956745696,"word":"動彈","characters":[{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["crossball\/bullet\/shot\/shell\/ball","to pluck (a string)\/to play (a string instrument)\/to spring or leap\/to shoot (e.g. with a catapult)\/(of cotton) to fluff or tease\/to flick\/to flip\/to accuse\/to impeach\/elastic (of materials)"],"pinyin":["dan4","tan2"],"word":"彈"}],"containing_words":[{"definition":["to be unable to move a single step"],"pinyin":["dong4 tan5 bu5 de2"],"word":"動彈不得"}],"sentences":[{"english":"By the end of his shows, only a few iron beasts still move.","chinese":"每次表演結束，還能自己動彈的鐵武士就寥寥可數了。"},{"english":"Realizing data exchange to reflect coupling between fluid and structures is essential to solving static aeroelasticity problems.","chinese":"研究靜氣動彈性問題一大關鍵是要解決流固數據耦合。"},{"english":"You've been working hard all day and you just can't push it anymore.","chinese":"你已經用功了一整天，你累得完全不想再動彈了。"},{"english":"The animals are kept in tiny cages and can hardly move at all.","chinese":"動物們被關進小籠子裏，幾乎都不能動彈。"},{"english":"Vortex-induced vibration is one of recurring aeroelastic dynamic responses of flexible structures.","chinese":"渦激振動是柔性結構易發生的氣動彈性現象。"},{"english":"This fear confined me to a narrow comfort zone.","chinese":"恐懼心理把我侷限在狹窄的安樂窩裏動彈不得。"},{"english":"I got stuck in the elevator for twenty minutes.","chinese":"我因電梯故障二十分鐘而動彈不得。"},{"english":"They grab the immobilized Jack and drag him inside.","chinese":"他們抓住了不能動彈的傑克，把他拖進了門裏。"},{"english":"I parried; but my hands were loath and cold.","chinese":"我想躲閃，但我的雙手因寒冷已無法動彈。"},{"english":"The moxa benefit Zheng Zheng looking at her, tin not shake.","chinese":"艾利怔怔的看着她，無法動彈。"},{"english":"A wrestling hold in which the opponent's arm is held so that it cannot be moved.","chinese":"摔跤擒拿法，抓緊對手的手臂令其動彈不得。"},{"english":"We are stuck in the city traffic.","chinese":"我們在市區裏動彈不得。"},{"english":"The bus was so crowded that nobody could move.","chinese":"車裏太擠，動彈不得。"},{"english":"About an hour later, I tried to get up from a chair and couldn't move.","chinese":"一小時後，我試着從椅子上站起來卻發現已不能動彈。"},{"english":"This time he fell face downward on the pavement, and moved no more.","chinese":"這一次，他臉朝地倒下去，不再動彈了。"},{"english":"My car was stuck in the mud.","chinese":"我的汽車陷在泥裏不能動彈。"}],"related":[]}