{"definition":["easily\/readily\/frequently\/at every turn\/at the slightest pretext"],"pinyin":["dong4 zhe2"],"simplified":["动辄"],"rank":10698.0,"normalized_rank":0.14967889972437146,"fraction":0.000007396832330720966,"cumulative_fraction":0.935163498371828,"word":"動輒","characters":[{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["then\/at once\/always\/(archaic) luggage rack on a chariot"],"pinyin":["zhe2"],"word":"輒"}],"containing_words":[{"definition":["faulted at every turn (idiom); can't get anything right"],"pinyin":["dong4 zhe2 de2 jiu4"],"word":"動輒得咎"}],"sentences":[{"english":"Fourth, solve problems through consultation on an equal footing, instead of imposing restriction at will.","chinese":"通過平等協商解決問題，不要動輒設限和制裁。"},{"english":"The two sides should seek consensus on major issues while reserving differences on minor issues, instead of imposing restrictions or sanctions at every turn.","chinese":"雙方應求大同存小異，不要動輒設限和制裁。"},{"english":"One suet-jade may costs thousands of money or even priceless.","chinese":"一塊羊脂白玉的價值動輒成千上萬，甚至價值連城。"},{"english":"Nowadays a lot of startups don't want to raise multi-million dollar series A rounds.","chinese":"很多初創企業不願進行動輒上百萬的首輪資金籌集。"},{"english":"When seeing our heavy traffic jam at home, I really want to know why this rarely happens in Japan.","chinese":"看到國內動輒大塞車，很想知道日本咋回事。"},{"english":"Excessive inpatient admissions and length of stay are common problems.","chinese":"動輒住院和住院過久是常見問題。"},{"english":"She wasn’t so giggly anymore and she had never looked better.","chinese":"她不再動輒傻笑而且看上去從沒有這麼完美。"},{"english":"When they grow up they will rebel and become unfilial children.","chinese":"長大後，自然動輒忤逆反抗，成爲一個不孝子。"},{"english":"They may deny responsibility and became moody, volatile or angry.","chinese":"他們可能推卸責任，變得不快，動輒發脾氣。"},{"english":"She's frequently difficult [at odds] with me.","chinese":"她動輒跟我慪氣。"}],"related":[]}