{"definition":["variant of 勘察[kan1 cha2]"],"pinyin":["kan1 cha2"],"simplified":["勘查"],"rank":9560.0,"normalized_rank":0.13375680326836709,"fraction":0.000008907116858234514,"cumulative_fraction":0.925930216840948,"word":"勘查","characters":[{"definition":["to investigate\/to survey\/to collate"],"pinyin":["kan1"],"word":"勘"},{"definition":["see 山查[shan1 zha1]","surname Zha","to research\/to check\/to investigate\/to examine\/to refer to\/to look up (e.g. a word in a dictionary)"],"pinyin":["Zha1","cha2","zha1"],"word":"查"}],"containing_words":[],"sentences":[{"english":"The government agreed to backstop companies that invested in oil exploration.","chinese":"政府同意支持那些對石油勘查投資的公司。"},{"english":"Reconnoitring and collecting evidence is the first step to castigate such crime .","chinese":"勘查與取證是打擊計算機犯罪的第一步。"},{"english":"Tube wave detecting method is a newly developed geophysical detecting method.","chinese":"管波探測法是新興的地球物理勘查方法。"},{"english":"Geological explor(?)tion is regarded by the author as a basis for pre-phase programming and management of natural resource.","chinese":"本文認爲地質勘查是國土規劃和整治的前期基礎工作。"},{"english":"Following an on-site inspection, the surveyor prepared a written report on the property.","chinese":"勘查之後，測量員出具了這一地產的書面報告。"},{"english":"Pope turns and addresses a man investigating the door to the infirmary.","chinese":"Pope轉身與勘查醫務室門的一個男子交談。"},{"english":"At the same time, the measure of ground Radon is proved to be an effective method in geothermal field exploration.","chinese":"同時指出地表氡氣測量是熱田勘查的有效途徑。"},{"english":"The bank was carefully cased by the bandits before the robbery.","chinese":"銀行在搶劫案發生之前曾被匪徒徹底勘查過。"},{"english":"This paper describes the application of shallow seismic refraction wave method to the exploration of foundation for railway bridges.","chinese":"介紹了淺層地震折射波法在鐵路橋基礎勘查中的應用。"},{"english":"We got success at a tr ial of some geological item.","chinese":"該方法在某地質勘查項目定點實驗中取得成功。"},{"english":"Therefore, it is urgency for selenium resources to be reinforced exploration, exploitation and utilization.","chinese":"在我國加強硒礦資源的勘查和開發利用已刻不容緩。"},{"english":"The traffic accident scene investigation system based on binocular stereovision is designed.","chinese":"設計了基於雙目系統的交通事故現場勘查系統。"},{"english":"The First Party of Hydrogeology and Engineering Geology, Guangdong Bureau of Geology and Mineral Investigation.","chinese":"廣東省地質勘查局水文工程地質一大隊。"},{"english":"The scene of the investigation, Wang Guozhong saw the body spit.","chinese":"衆人勘查現場，王國忠看到屍體吐了。"},{"english":"Three British explorers are about to embark on a survey to map the Arctic Ocean's sea-ice cover.","chinese":"三位英國探險家即將啓程對北冰洋海冰進行勘查。"},{"english":"The foreground of geothermal resources and the advantageous region for exploration were provided.","chinese":"指出蘭州坳陷地熱資源的前景和勘查有利地段。"}],"related":[{"definition":["to reconnoiter\/to explore\/to survey"],"pinyin":["kan1 cha2"],"word":"勘察"},{"definition":["to investigate\/examination"],"pinyin":["kan1 yan4"],"word":"勘驗"},{"definition":["to explore\/to survey\/to prospect (for oil etc)\/prospecting"],"pinyin":["kan1 tan4"],"word":"勘探"},{"definition":["to investigate\/to survey"],"pinyin":["kan1 ce4"],"word":"勘測"},{"definition":["to obtain (information from an archive etc)"],"pinyin":["diao4 qu3"],"word":"調取"},{"definition":["to investigate"],"pinyin":["cha2 kan1"],"word":"查勘"},{"definition":["to go and inspect (a site)\/to do an on-site survey"],"pinyin":["ta4 kan1"],"word":"踏勘"},{"definition":["to detect\/to investigate"],"pinyin":["zhen1 cha2"],"word":"偵查"},{"definition":["thorough search"],"pinyin":["mo1 pai2"],"word":"摸排"},{"definition":["to collect evidence"],"pinyin":["qu3 zheng4"],"word":"取證"},{"definition":["to collect evidence"],"pinyin":["cai3 zheng4"],"word":"採證"},{"definition":["to inspect\/to run through a checklist\/to take stock\/to audit"],"pinyin":["pai2 cha2"],"word":"排查"},{"definition":["investigation\/inquiry\/to investigate\/to survey\/survey\/(opinion) poll\/CL:項|项[xiang4],個|个[ge4]"],"pinyin":["diao4 cha2"],"word":"調查"},{"definition":["to cause an accident\/to be responsible for an incident\/to provoke a disturbance"],"pinyin":["zhao4 shi4"],"word":"肇事"},{"definition":["to deploy surveillance\/to put under surveillance"],"pinyin":["bu4 kong4"],"word":"布控"},{"definition":["civil police\/PRC police\/abbr. for 人民警察"],"pinyin":["min2 jing3"],"word":"民警"}]}