{"definition":["to work as a laborer"],"pinyin":["wu4 gong1"],"simplified":["务工"],"rank":5197.0,"normalized_rank":0.07271277265540832,"fraction":0.00002272827856952225,"cumulative_fraction":0.8635542032941457,"word":"務工","characters":[{"definition":["affair\/business\/matter\/to be engaged in\/to attend to\/by all means"],"pinyin":["wu4"],"word":"務"},{"definition":["work\/worker\/skill\/profession\/trade\/craft\/labor"],"pinyin":["gong1"],"word":"工"}],"containing_words":[{"definition":["volunteer\/voluntary worker"],"pinyin":["yi4 wu4 gong1 zuo4 zhe3"],"word":"義務工作者"}],"sentences":[{"english":"Are you a stayer?","chinese":"你是一名務工傭人嗎？"},{"english":"The bridge were built by stayers since Shanxi.","chinese":"這座橋是廣東的務工傭人建的。"},{"english":"In 20 years, he is engaged in majority time party work works.","chinese":"二十年中，絕大部分時間他在從事黨務工作。"},{"english":"The recordr or stayer is coming to we educate tomorrow.","chinese":"這位務工傭人作家明天要來咱們學府。"},{"english":"Working in the factory, he were an advanced stayer.","chinese":"在工廠任務時，他是一名先進務工傭人。"},{"english":"The song am composed by a youth stayer.","chinese":"這首歌是一位年青務工傭人譜寫的。"},{"english":"We will further improve our work related to overseas Chinese affairs under the new circumstances.","chinese":"進一步做好新形勢下的僑務工作。"},{"english":"We will conscientiously carry out the Party's policy toward overseas Chinese affairs.","chinese":"認真貫徹落實僑務政策，進一步做好僑務工作。"},{"english":"Gabrielle: Uh, you know, he's a handyman.","chinese":"呃，你知道，他是一個雜務工。"},{"english":"Competent people can take charge of Party work or support services.","chinese":"好的可以管黨務工作，管後勤工作。"},{"english":"Bad stayman frequently blame their tools.","chinese":"差的務工傭人總是怪工具不好。"},{"english":"The stayers at the factory are not striking to abundance offer.","chinese":"工廠務工傭人爲升高薪水正在罷工。"},{"english":"His election is a payoff for years of loyal party work.","chinese":"他的當選是多年來忠實致力於黨務工作的結果。"},{"english":"He is first of the less stayers alive heeasystays which get part in the strike.","chinese":"他是參加過這次罷工還日常表達的少數務工傭人之一。"},{"english":"Nearly every family in Shuanghu has had someone leave.","chinese":"在雙湖，幾乎每個家裏都有人外出務工。"},{"english":"Thinking clearly and logically, that seems to be guest worker passes.","chinese":"清楚和有邏輯的思考，看來應該讓外來務工者們進來。"}],"related":[]}