{"definition":["qualified\/competent (professionally)\/to be up to a task"],"pinyin":["sheng4 ren4"],"simplified":["胜任"],"rank":11609.0,"normalized_rank":0.16242497166762274,"fraction":0.000006466370937103009,"cumulative_fraction":0.94146423900612,"word":"勝任","characters":[{"definition":["victory\/success\/to beat\/to defeat\/to surpass\/victorious\/superior to\/to get the better of\/better than\/surpassing\/superb (of vista)\/beautiful (scenery)\/wonderful (view)\/(Taiwan pr. [sheng1]) able to bear\/equal to (a task)"],"pinyin":["sheng4"],"word":"勝"},{"definition":["surname Ren\/Ren County 任縣|任县[Ren2 Xian4] in Hebei","to assign\/to appoint\/to take up a post\/office\/responsibility\/to let\/to allow\/to give free rein to\/no matter (how, what etc)\/classifier for terms served in office, or for spouses, girlfriends etc (as in 前任男友)"],"pinyin":["Ren2","ren4"],"word":"任"}],"containing_words":[{"definition":["not to be up to the task (idiom)\/incompetent"],"pinyin":["li4 bu4 sheng4 ren4"],"word":"力不勝任"},{"definition":["competency"],"pinyin":["sheng4 ren4 neng2 li4"],"word":"勝任能力"}],"sentences":[{"english":"I: What experience have you had that qualifies you for this position?","chinese":"你有什麼樣的經驗能使你勝任這個職位？"},{"english":"It was evident that her physical strength could not support her strenuous task.","chinese":"繁重的工作顯然使她有些力不勝任。"},{"english":"It works in everything.","chinese":"它可以勝任任何情況。"},{"english":"The second part is the concrete research for the university student class cadre's competence.","chinese":"第二部分是對高校學生班幹部勝任力的具體研究。"},{"english":"I am afraid that his attitude to authority unfits him for work on this project.","chinese":"我但心他對當局的態度使他不能勝任這個項目。"},{"english":"I:  What experience have you had that qualifies you for this position?","chinese":"你有什麼樣的經驗能使你勝任這個職位？"},{"english":"A: With my strong academic background, I am capable and competent.","chinese":"依我的良好學術背景，我是勝任愉快的。"},{"english":"I don't feel up to such a long journey.","chinese":"我不能勝任這樣的長途旅行。"},{"english":"The instructor has competent knowledge of and experience in this course.","chinese":"教師對課程本身的專業知識與技能頗能勝任。"},{"english":"Chapter iii indicates the establishment of R&D competency model approach and the steps.","chinese":"第三章爲建立研發人員勝任特徵模型的方法和步驟等。"},{"english":"Do  your business carefully, tust yourself that you can competent for your job.","chinese":"做好你的工作，相信自己能勝任。"},{"english":"I'm honored, but I'm not sure I'm the right person.","chinese":"很榮幸，不過我是否勝任，可沒把握。"},{"english":"For testing purposes an multi-core development machine can be sufficient for reasonably small workloads.","chinese":"如果用於測試，那麼多核開發機足以勝任小的工作量。"},{"english":"After the accident, he recognized that he was not fit for the work.","chinese":"事故發生後，他認識到不能勝任這項工作。"},{"english":"Secondly, an interviewee must demonstrate his skills for the job.","chinese":"其次，應聘者要證明自己能勝任這份工作。"},{"english":"With my lusty knowledge of computers, I am learned and able.","chinese":"我有深厚的計算機知識，我可以勝任這份工作。"}],"related":[{"definition":["main job\/day job\/steady full-time job (as opposed to temporary or casual)\/chief or principal post (as opposed to deputy)"],"pinyin":["zheng4 zhi2"],"word":"正職"},{"definition":["to promote to a higher position"],"pinyin":["jin4 sheng1"],"word":"晉升"},{"definition":["to attend simultaneously to two or more things\/to balance (career and family, family and education etc)"],"pinyin":["jian1 gu4"],"word":"兼顧"},{"definition":["making an all-out effort (idiom); to try one's heart out\/to do one's utmost"],"pinyin":["jin4 xin1 jin4 li4"],"word":"盡心盡力"},{"definition":["one's job"],"pinyin":["ben3 zhi2"],"word":"本職"},{"definition":["conscious\/aware\/on one's own initiative\/conscientious"],"pinyin":["zi4 jue2"],"word":"自覺"},{"definition":["prattle\/idle chit-chat"],"pinyin":["kong1 tan2"],"word":"空談"},{"definition":["level\/hierarchy"],"pinyin":["ceng2 ji2"],"word":"層級"},{"definition":["to possess\/to have\/equipped with\/able to fulfill (conditions or requirements)"],"pinyin":["ju4 bei4"],"word":"具備"},{"definition":["to be capable of\/to be able to\/can"],"pinyin":["neng2 gou4"],"word":"能夠"},{"definition":["to take upon oneself\/to assume"],"pinyin":["dan1 dang1"],"word":"擔當"},{"definition":["ability to make one's own decisions"],"pinyin":["zi4 zhu3 quan2"],"word":"自主權"},{"definition":["to spare no effort (idiom); to do one's utmost"],"pinyin":["jie2 jin4 quan2 li4"],"word":"竭盡全力"},{"definition":["occupation\/profession\/vocation\/professional"],"pinyin":["zhi2 ye4"],"word":"職業"},{"definition":["to change according to the situation (idiom); pragmatic"],"pinyin":["sui2 ji1 ying4 bian4"],"word":"隨機應變"},{"definition":["to obey (an order)\/to comply\/to defer"],"pinyin":["fu2 cong2"],"word":"服從"}]}