{"definition":["to be bound to\/undoubtedly will"],"pinyin":["shi4 bi4"],"simplified":["势必"],"rank":6223.0,"normalized_rank":0.08706784380115568,"fraction":0.000017543883151520733,"cumulative_fraction":0.8840189500079718,"word":"勢必","characters":[{"definition":["power\/influence\/potential\/momentum\/tendency\/trend\/situation\/conditions\/outward appearance\/sign\/gesture\/male genitals"],"pinyin":["shi4"],"word":"勢"},{"definition":["certainly\/must\/will\/necessarily"],"pinyin":["bi4"],"word":"必"}],"containing_words":[],"sentences":[{"english":"But in the end, Yang's laughs will surely drown out those of his keyboard warrior critics.","chinese":"但是在最後，孫楊的笑容勢必會蓋過鍵盤俠們的口水。"},{"english":"Feng's high-profile in entertainment industry is bound to bring into broad controversy.","chinese":"鳳姐此次高調進軍演藝界勢必會帶來爭議。"},{"english":"Paint-free door will become the first choice majority of home users.","chinese":"免漆門勢必成爲廣泛居日用戶的首位挑選。"},{"english":"Eleven long-distance travel a large number of households is bound to divert Golden Week tourists showings.","chinese":"大量家庭十一長途出遊，勢必分流黃金週看房客源。"},{"english":"To break them will definitely unleash enormous driving force for the economy.","chinese":"如果突破這些瓶頸，勢必會釋放巨大的經濟驅動力。"},{"english":"So long as we work together we can achieve great results.","chinese":"只要我們一起努力勢必能達到好的結果。"},{"english":"And one will definitely be charmed by giant plush cucumbers.","chinese":"相信每一個人都勢必會被那個巨大的毛絨黃瓜吸引住。"},{"english":"The stability of the economy and society would surely be affected, leaving people haunted.","chinese":"輪番提價勢必影響經濟和社會穩定，搞得人心惶惶。"},{"english":"Oil should remain excessively volatile as the situation unwinds in North Africa.","chinese":"從北非情況來看，原油勢必繼續極端震盪。"},{"english":"So Bouguer correction must cause much errors.","chinese":"因此，布格改正勢必造成相當大的誤差。"},{"english":"Han imperial power and the enhanced powers of the decision of the Imperial College is bound to decline.","chinese":"皇權及大族權力的增強決定了太學勢必衰落的命運。"},{"english":"Raising price again and again should affect economy and social stability, and make people nervous.","chinese":"輪番提價勢必影響經濟和社會穩定，搞得人心惶惶。"},{"english":"When the demand outnumbers the supply in the job market, there will come another high tide of unemployment.","chinese":"在僧多粥少的環境下，勢必再出現另一波失業潮。"},{"english":"If you go on like this, you'll make big mistakes some day.","chinese":"如果你繼續這樣下去勢必有一天要犯大錯誤。"},{"english":"The Culture context definitely affects the imagination about bandit.","chinese":"文化語境的形成勢必影響關於匪盜的文學想象。"},{"english":"So luscious fruit must fall when over-ripe.","chinese":"過分成熟的甜果勢必掉下樹枝。"}],"related":[{"definition":["auxiliary verb introducing future action: may (be able to)\/will (cause)\/should (enable)\/going to"],"pinyin":["jiang1 hui4"],"word":"將會"},{"definition":["to attack\/to batter\/(of waves) to pound against\/shock\/impact"],"pinyin":["chong1 ji1"],"word":"衝擊"},{"definition":["to intensify\/to sharpen\/to accelerate\/to aggravate\/to exacerbate\/to embitter"],"pinyin":["jia1 ju4"],"word":"加劇"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"},{"definition":["no doubt\/undoubtedly"],"pinyin":["wu2 yi2"],"word":"無疑"},{"definition":["maximum\/enormous"],"pinyin":["ji2 da4"],"word":"極大"},{"definition":["to trigger\/to spark"],"pinyin":["chu4 fa1"],"word":"觸發"},{"definition":["to turn back\/to reverse"],"pinyin":["ni4 zhuan3"],"word":"逆轉"},{"definition":["huge\/enormous\/tremendous"],"pinyin":["pang2 da4"],"word":"龐大"},{"definition":["to worry\/anxiety (about)"],"pinyin":["you1 lu:4"],"word":"憂慮"},{"definition":["to lead to\/to trigger\/to initiate\/to cause\/to evoke (emotions)"],"pinyin":["yin3 fa1"],"word":"引發"},{"definition":["effect (scientific phenomenon)"],"pinyin":["xiao4 ying4"],"word":"效應"},{"definition":["one step further\/to move forward a step\/further onwards"],"pinyin":["jin4 yi1 bu4"],"word":"進一步"},{"definition":["general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead","to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])"],"pinyin":["jiang1","jiang4","qiang1"],"word":"將"},{"definition":["crisis\/CL:個|个[ge4]"],"pinyin":["wei1 ji1"],"word":"危機"},{"definition":["hidden\/potential\/latent"],"pinyin":["qian2 zai4"],"word":"潛在"}]}