{"definition":["power\/momentum\/tendency\/impetus\/situation\/the look of things"],"pinyin":["shi4 tou2"],"simplified":["势头"],"rank":3201.0,"normalized_rank":0.044786143019042164,"fraction":0.00004460901103748413,"cumulative_fraction":0.8000002972980329,"word":"勢頭","characters":[{"definition":["power\/influence\/potential\/momentum\/tendency\/trend\/situation\/conditions\/outward appearance\/sign\/gesture\/male genitals"],"pinyin":["shi4"],"word":"勢"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"}],"containing_words":[],"sentences":[{"english":"It looks like the momentum is growing for a shift towards stream-oriented approach to UI.","chinese":"看起來UI轉向面向數據流方式的勢頭漸勁。"},{"english":"Now 'we just want to keep the momentum going, ' he said.","chinese":"劉海平稱，現在我們只想繼續保持這個良好勢頭。"},{"english":"Non-state-owned industries continuously maintained a fast growth tendency.","chinese":"非國有工業繼續保持較快增長勢頭。"},{"english":"The momentum to improve health outcomes has persevered.","chinese":"改善健康結果的勢頭也依舊不減。"},{"english":"Let us use it to end AIDS – once and for all.","chinese":"讓我們藉此勢頭，去消滅艾滋病，將它斬草除根。"},{"english":"The test will be whether they can continue that streak.","chinese":"但能否延續這一強勁勢頭是他們所面臨的考驗。"},{"english":"Karel De Gucht said that the Belgian side feels satisfied with the growing momentum of China-Belgium relations.","chinese":"德古特說，比方對比中關係的良好發展勢頭感到滿意。"},{"english":"The media industry is increasingly hoping it stays that way.","chinese":"傳媒業正日益盼望保持這一勢頭。"},{"english":"Still, those upward forces eventually will lose some of their oomph, he says.","chinese":"不過坦普爾說，這些上行力量最終將失去部分勢頭。"},{"english":"Of course the team expects us to get the same kind of a result from every race.","chinese":"當然，車隊希望我們在每一站都都繼續這股勢頭。"},{"english":"He said that the current Russia-China economic and trade relations enjoy a sound momentum of development.","chinese":"他表示，當前俄中兩國經貿關係呈現良好發展勢頭。"},{"english":"David Nalbandian is ready come back from injury.","chinese":"波特羅勢頭正與日俱增，納爾班迪安準備復出。"},{"english":"The growth of our business ties has slowed down in recent years, showing a lack of sustained momentum.","chinese":"中日經貿關係近年來發展勢頭趨緩，後續動力不足。"},{"english":"In Afghanistan, we must continue to degrade the Taliban.","chinese":"在阿富汗，我們一定要打掉塔利班的勢頭。"},{"english":"China-Romania relations have maintained good momentum of development.","chinese":"中羅關係保持着良好的發展勢頭。"},{"english":"Wen said that bilateral relations enjoy sound development momentum.","chinese":"溫家寶說，中捷關係發展勢頭良好。"}],"related":[]}