{"definition":["Lord (UK hereditary nobility)\/UK life peer"],"pinyin":["xun1 jue2"],"simplified":["勋爵"],"rank":32584.0,"normalized_rank":0.4558924349054888,"fraction":7.487192481748502e-7,"cumulative_fraction":0.9924182073010736,"word":"勳爵","characters":[{"definition":["variant of 勛|勋[xun1]"],"pinyin":["xun1"],"word":"勳"},{"definition":["ancient bronze wine holder with 3 legs and loop handle\/nobility"],"pinyin":["jue2"],"word":"爵"}],"containing_words":[],"sentences":[{"english":"Lord Ruthven died, and some of his friends ran away.","chinese":"結果魯斯溫勳爵死了，他的一些朋友逃走了。"},{"english":"Lord Kelvin was missing half the story.","chinese":"開爾文勳爵少算了一半。"},{"english":"Lord Mandelson extended warm welcome to Ambassador Liu for assuming his new post in the UK.","chinese":"曼德爾森勳爵熱烈歡迎劉大使來英履新。"},{"english":"Lady Furness left us and we began to talk .","chinese":"弗內斯勳爵夫人走開了，我們交談起來。"},{"english":"It was Ovett in particular who helped drive Coe on to new heights.","chinese":"科勳爵能不斷受到激勵創下新高，尤其要感謝奧維特。"},{"english":"Lord Heney stretched himself out on the divan and laughed.","chinese":"亨利勳爵伸手攤腳地躺在沙發上，笑着。"},{"english":"Lord Henry turned and looked at the duchess with his slumberous eyes .","chinese":"亨利勳爵轉過頭來，用倦怠的眼睛望着公爵夫人。"},{"english":"Then I went downstairs with Lord Bothwell.","chinese":"於是我和博思韋爾勳爵下了樓。"},{"english":"Lord Hertford’s reputation as a discerning, major collector was secured.","chinese":"赫特福德勳爵獨具慧眼的大收藏家聲譽從此開始確立。"},{"english":"Lord Henry elevated his eyebrows and looked at him in amazement.","chinese":"享利勳爵揚起眉毛，驚奇地瞧着他。"},{"english":"‘Come on, my lord, ’I said to Bothwell.‘Our","chinese":"“衝吧，我的勳爵，”我對博思韋爾說道。"},{"english":"O I fear you are poisoned, Lord Randal, my son!","chinese":"奧，倫德爾勳爵，我的兒，我恐怕你已中毒？"},{"english":"Professional photographer Lord Snowdon won its Hood Medal in 1978.","chinese":"專業攝影師斯諾頓勳爵在1978年獲得了胡德獎章。"},{"english":"Lord Swan was made a life peer in 1981.","chinese":"斯旺勳爵於1981年受封終身貴族。"},{"english":"In a scuffle that ensued, Leia killed Lord Tion.","chinese":"隨後便發生了一場混戰，萊婭殺死了蒂翁勳爵。"},{"english":"Lyra is with her uncle, Lord Asriel.","chinese":"萊拉同她的叔叔阿斯利爾勳爵在一起。"}],"related":[]}