{"definition":["cladding\/covering (on a fiber)"],"pinyin":["bao1 ceng2"],"simplified":["包层"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"包層","characters":[{"definition":["surname Bao","to cover\/to wrap\/to hold\/to include\/to take charge of\/to contract (to or for)\/package\/wrapper\/container\/bag\/to hold or embrace\/bundle\/packet\/CL:個|个[ge4],隻|只[zhi1]"],"pinyin":["Bao1","bao1"],"word":"包"},{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"層"}],"containing_words":[],"sentences":[{"english":"The effects of the optical beam width and cladding on imaging are analysed.","chinese":"分析了光束束寬和包層對成像的影響。"},{"english":"The existing vegetation is also referenced, by the spotted gum cladding on each of the buildings.","chinese":"通過每座建築上的斑桉包層，現有植被也被引用。"},{"english":"The capper comes equipped with an elevator cap feeder and with 304 stainless steel cladding as standard.","chinese":"該封口機配備電梯封蓋機和304不鏽鋼包層爲標準。"},{"english":"It had a metal skeleton and a series of gasbags inside an outer covering.","chinese":"這種飛艇在外包層裏面裝有一副金屬骨架和許多氣囊。"},{"english":"The language of the composition is enhanced by using natural local stone in claddings.","chinese":"包層使用了當地天然石材，增強了建築的自然氣息。"},{"english":"Manipulates documents in the package layer that deal with the physical storage directly.","chinese":"在包層操作文檔，直接訪問物理存儲。"},{"english":"The shift of the resonance wavelength has some difference for different kinds of metal.","chinese":"不同金屬包層，諧振波長的偏移量也有一定差別。"},{"english":"Metal coated long period fiber gratings (LPFG) can be used to change the resonance wavelength.","chinese":"金屬包層長週期光纖光柵可用於對諧振波長的調諧。"},{"english":"In Chapter 3, fiber Bragg grating fabricated with cladding mode suppression fiber is studied.","chinese":"第三章研究用包層模抑制光纖製作的光纖布拉格光柵。"},{"english":"This layer is hereafter referred to as the package layer in this article.","chinese":"後面把這一層稱爲包層。"}],"related":[]}