{"definition":["chemical analysis"],"pinyin":["hua4 xue2 fen1 xi1"],"simplified":["化学分析"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"化學分析","characters":[{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["to separate\/to divide\/to analyze"],"pinyin":["xi1"],"word":"析"}],"containing_words":[],"sentences":[{"english":"The main nutritional components of Xingtai chestnut was analyzed with chemical analysis method.","chinese":"採用化學分析法，分析了邢臺板栗的主要營養成分。"},{"english":"The aromatic hydrocarbons content in naphtha was analyzed by a chemical reaction method.","chinese":"用化學分析方法測定了工業用石腦油中芳香烴的含量。"},{"english":"Half-life of radioactive element carbon-14 is 5730 year.","chinese":"用放射性同位素碳14測定有機物年齡的化學分析。"},{"english":"The hydrochemistry verified the leakage recharge was assured.","chinese":"水化學分析證實了越流補給的存在。"},{"english":"Fume hood should be provided in each regular chemical analysis laboratory.","chinese":"每個常規化學分析室都要有通風櫥。"},{"english":"Improved methods for both in situ hybridization and in situ enzyme histochemistry were described.","chinese":"改良了組織原位雜交和原位酶組織化學分析的方法。"},{"english":"This paper mainly discusses the sensitometry and chemical analysis routine work in motion picture film processing.","chinese":"本文主要敘述以下二個題目，即感光測定和化學分析。"},{"english":"We know the compositon of the mineral by the chemical analysis.","chinese":"經過化學分析，我們知道了礦石的構成。"},{"english":"We know the constitution of mineral through chemical analysis.","chinese":"經過化學分析，我們知道了礦石的構成。"},{"english":"In some cases, the only way to detect a counterfeit drug is through chemical analysis.","chinese":"在一些案例中，探測假藥的唯一方法是通過化學分析。"},{"english":"The detection tests and chemical analysis methods for mycotoxins were discussed here.","chinese":"討論了真菌毒素的檢測和化學分析方法。"},{"english":"After chemical assay, we have known the composition of the ore.","chinese":"經過化學分析，我們知道了礦石的構成。"},{"english":"The principle and method of chemical analysis have been briefly described.","chinese":"簡述了題示化學分析法的原理和方法。"},{"english":"Trituration process would be taken of the material when chemical analysis is underway.","chinese":"這種材料在進行化學分析時將被磨成粉。"}],"related":[]}