{"definition":["chemical industry, abbr. to 化工[hua4 gong1]"],"pinyin":["hua4 xue2 gong1 ye4"],"simplified":["化学工业"],"rank":22489.0,"normalized_rank":0.31465028752116186,"fraction":0.0000018736228407728996,"cumulative_fraction":0.9801039022706618,"word":"化學工業","characters":[{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"},{"definition":["work\/worker\/skill\/profession\/trade\/craft\/labor"],"pinyin":["gong1"],"word":"工"},{"definition":["line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already","surname Ye"],"pinyin":["Ye4","ye4"],"word":"業"}],"containing_words":[{"definition":["China Petrol and Chemical Industry Association (CPCIA)"],"pinyin":["Zhong1 guo2 Shi2 you2 he2 Hua4 xue2 Gong1 ye4 Xie2 hui4"],"word":"中國石油和化學工業協會"}],"sentences":[{"english":"My company is located in Jinshan, Shanghai Chemical Industry Park, covering 61 acres.","chinese":"我公司位於上海金山化學工業區，佔地61餘畝。"},{"english":"These Procedures apply to the Shanghai Chemical Industry Area (hereinafter referred to as the SCIA ) established under the approval of the Municipal People's Government.","chinese":"本辦法適用於市人民政府批准設立的上海化學工業區。"},{"english":"Solvents and chemicals industries, plastics industry, ceramics and refractory materials.","chinese":"溶劑及化學工業，塑膠業，陶瓷及耐火材等。"},{"english":"Some of the oil and chemical industries are built almost entirely around self-acting controls.","chinese":"石油化學工業的一些生產設施，已經用機器自動控制。"},{"english":"In chemical industry, polymerization is used to produce synthetic resins and elastomers.","chinese":"在化學工業中，聚合用於生產合成樹脂和彈性體。"},{"english":"Many processes that are essential to the chemical industry use heterogeneous catalysts.","chinese":"很多重要的化學工業過程就是使用多相催化劑的。"},{"english":"Since the Panama poisonings , China is considering ways to corral the chemical industry.","chinese":"自從巴拿馬投毒，中國正在考慮如何圍欄化學工業。"},{"english":"Shell-and-tube heat exchangers are widely used in petrochemical industries.","chinese":"管殼式換熱器是石油化學工業中最常見的設備。"},{"english":"The petroleum and chemical industries use condensers for hydrocarbons and other chemical vapours.","chinese":"石油化學工業中用冷凝器使烴類及其它化學蒸氣冷凝。"},{"english":"Alginates were common raw materials in domestic chemical industry.","chinese":"海藻酸鹽是日用化學工業中常用的原料之一。"},{"english":"Q18. Why are certain groups concerned about the growing influence of the chemical industry on agriculture?","chinese":"爲什麼某些團體擔憂化學工業對農業日益增長的影響？"}],"related":[]}