{"definition":["purulent (containing pus)\/septic"],"pinyin":["hua4 nong2 xing4"],"simplified":["化脓性"],"rank":41947.0,"normalized_rank":0.5868929525834929,"fraction":3.2012893570821727e-7,"cumulative_fraction":0.9971717265429514,"word":"化膿性","characters":[{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"},{"definition":["pus"],"pinyin":["nong2"],"word":"膿"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"Objective To explore the management of pyogenic osteomyelitis of the spine.","chinese":"目的探討脊柱化膿性骨髓炎的手術治療方法。"},{"english":"Exclusively pyogenic, gas was present in 27% of the LA.","chinese":"氣體出現於肝膿瘍者佔27%，皆爲化膿性者。"},{"english":"Objective To investigate the procedure and effect on treating septic arthritis of temporomandibular joint (TMJ).","chinese":"目的探討化膿性顳下頜關節炎的治療方法及其療效。"},{"english":"A \"hot\" joint that is swollen and tender may indicate an acute suppurative arthritis.","chinese":"腫且有壓痛的“熱”關節可能提示急性化膿性關節炎。"},{"english":"Pyogenic granulomas are the most common benign vascular tumors or tumor-like lesions.","chinese":"良性病變中化膿性肉芽腫最多。"},{"english":"Pyogenic sacroiliitis is a rarely occurring disease.","chinese":"化膿性骶髂關節炎是一種很少發生的疾病。"},{"english":"Conclusion:More attention should be paid to prevention of pyogenic corneal ulcer.","chinese":"結論化膿性角膜潰瘍危害極大，應重在預防。"},{"english":"It has two distinct presentations, acute hemorrhagic enteritis and non-suppurative myocarditis.","chinese":"以急性出血性腸炎和非化膿性心肌炎爲特徵。"},{"english":"Objective To investigate the clinical efficiency and side-effect in the patients with pyogenic granuloma treated with Ho laser.","chinese":"目的觀察鈥激光治療化膿性肉芽腫的療效和不良反應。"},{"english":"When it is accompanied with secondary infection, it form acute purulent inflammation.","chinese":"霰粒腫如繼發感染而形成急性化膿性炎症。"},{"english":"Other causes of parotid swelling are suppurative parotitis .","chinese":"腮腺腫脹的其它原因是化膿性腮腺炎。"},{"english":"Presenting symptoms are usually wound site pain with cellulitis and purulent drainage.","chinese":"症狀通常是傷口疼痛和化膿性蜂窩組織炎排水。"},{"english":"Objective To investigate the diagnosis and treatment of the acute suppurative osteomyelitis of children.","chinese":"目的探討小兒急性化膿性骨髓炎的診斷和治療方法。"},{"english":"Objective To improve the treatment of acute pyogenic arthritis .","chinese":"目的改進急性化膿性關節炎的治療方法。"},{"english":"Objective To explore the clinical charactoristic of suppurative endophthalmitis, evaluate the clinical value of vitrectomy for suppurative endophthalmitis.","chinese":"目的探討玻璃體切除術治療化膿性眼內炎的臨牀價值。"},{"english":"Fine-needle aspiration cytology of thyroid nodule was suspicious of suppurative thyroiditis.","chinese":"甲狀腺細針抽吸細胞學檢查，懷疑爲化膿性甲狀腺炎。"}],"related":[]}