{"definition":["more than ten\/a dozen or more"],"pinyin":["shi2 ji3"],"simplified":["十几"],"rank":2509.0,"normalized_rank":0.03510416520923985,"fraction":0.00005920137255148346,"cumulative_fraction":0.7645291214879274,"word":"十幾","characters":[{"definition":["ten\/10"],"pinyin":["shi2"],"word":"十"},{"definition":["almost","how much\/how many\/several\/a few"],"pinyin":["ji1","ji3"],"word":"幾"}],"containing_words":[{"definition":["ten months or so\/about ten months"],"pinyin":["shi2 ji3 ge4 yue4"],"word":"十幾個月"}],"sentences":[{"english":"Only 8 of the 58 present at the uncovering of the tomb died within a dozen years.","chinese":"58人中只有8人在挖墓後的十幾年內死亡。"},{"english":"I am a divorced and have a teenaged daughter.","chinese":"我離異，有一個十幾歲的女兒。"},{"english":"Over the past 10-plus years, the booming tourist industry has stimulated the Great wall's renovation project.","chinese":"十幾年來，蓬勃發展的旅遊業促進了長城的修繕工程。"},{"english":"Inscribed with a dozen or more function scales, the slide rule symbolized the mysteries of arcane science.","chinese":"計算尺上刻著十幾種函數刻度，宛如科學奧祕的化身。"},{"english":"The unemployed engineer wrote a dozen applications for jobs but go nothing.","chinese":"失業的工程師一連寫了十幾封求職信，但一無所獲。"},{"english":"Digging endless, take endless, earn several hundred thousand a year.","chinese":"挖不盡，取不完，一年能賺十幾萬。"},{"english":"So far we've been relying on our little and a dozen kerosene lamps.","chinese":"到目前爲止，我們還是靠十幾個小小的煤油燈照明。"},{"english":"Over 20 metres or so, there's a telephone-box there.","chinese":"再走二十幾米，那裏有一個電話亭。"},{"english":"Europe accounted for a dozen cities across eight countries.","chinese":"歐洲佔在8個國家的十幾個城市。"},{"english":"Over the last decade, high-rise hybrid building was universally adopted.","chinese":"近十幾年來，我國高層建築普遍採用高層混合結構。"},{"english":"But the primary goal of the teen years is to achieve independence.","chinese":"不過，十幾歲這個年齡的首要目標就是要爭取獨立。"},{"english":"So far, over ten fishes have been studied in more than twenty count-ries.","chinese":"目前已有十多個國家對十幾種魚類進行了這一研究。"},{"english":"There are about a dozen political parties in America， only two of which are major parties.","chinese":"美國有十幾個政黨，其中只有兩個黨是主要黨。"},{"english":"Assange fathered him in his teens with his then-girlfriend.","chinese":"阿桑格與他當時的女友在十幾歲時就當上了爹媽。"},{"english":"What's the worst thing that can happen for a teenage girl?","chinese":"一個十幾歲的女孩身上能發生最壞的事情是什麼呢？"},{"english":"Teenagers like to hot-rod down our street.","chinese":"十幾歲的年輕人喜歡在我們的街道上開飛車。"}],"related":[]}