{"definition":["decimal"],"pinyin":["shi2 jin4 zhi4"],"simplified":["十进制"],"rank":54908.0,"normalized_rank":0.7682341583535042,"fraction":8.26233368038536e-8,"cumulative_fraction":0.9995057321635421,"word":"十進制","characters":[{"definition":["ten\/10"],"pinyin":["shi2"],"word":"十"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"},{"definition":["system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4"],"word":"制"}],"containing_words":[],"sentences":[{"english":"Converts the specified string representation of a number to an equivalent single-precision floating-point number.","chinese":"將指定的十進制數的值轉換爲等效的單精度浮點數。"},{"english":"Decimalization came and went with no major incidents, but that was just the beginning.","chinese":"十進制的使用並沒有引起大的事故，但這只是開始。"},{"english":"Columns 2 through 6 list the relevant material properties in metric units.","chinese":"列2至6的名單，有關材料性能在十進制單位。"},{"english":"Unless otherwise stated, all numbers in this paper are in decimal system.","chinese":"除特別指明外，本卷內的所有數均爲十進制。"},{"english":"The integer and fraction parts both consist of a sequence of decimal (base ten) digits.","chinese":"整數和小數部分都由十進制數字序列組成。"},{"english":"A base-10 integer is written as a sequence of digits.","chinese":"十進制的整數是一個數字序列。"},{"english":"Allows you to customize the decimal format pattern.","chinese":"允許您定製十進制格式的模式。"},{"english":"It consists of a floating-point literal or decimal integer followed by the lower-case letter i.","chinese":"它有浮點表和十進制整數跟隨小寫的字母i。"},{"english":"It contains symbols for decimal separator, percent character, and so forth.","chinese":"它包含了十進制分隔符，百分比字符等等之類的符號。"},{"english":"Once the position of this pattern is determined, the search looks for a decimal value.","chinese":"一旦確定了這個模式的位置，搜索便查找十進制值。"},{"english":"Area IDs can be written as a whole number or dotted decimal notation.","chinese":"區域ID可寫成整個數字或寫成點十進制記數。"},{"english":"Converts the specified string representation of a number to an equivalent decimal number.","chinese":"將指定的單精度浮點數的值轉換爲等效的十進制數。"},{"english":"Of or relating to the decimal number system.","chinese":"十進制以十爲進位的數字系統。"},{"english":"However, they nearly all counted in the same way-in tens.","chinese":"然而，他們幾乎都用相同的方式數數，都是十進制。"},{"english":"Convert the following denary numbers base 8.","chinese":"把下列各十進制換算成以8爲基值的數。"},{"english":"The country decimalized the currency in 1975.","chinese":"這個國家在1975年把貨幣改爲十進制。"}],"related":[]}