{"definition":["to boost the pressure (of a fluid)\/to boost (or step up) the voltage"],"pinyin":["sheng1 ya1"],"simplified":["升压"],"rank":47500.0,"normalized_rank":0.6645866271179326,"fraction":1.8641342950268733e-7,"cumulative_fraction":0.9985480541172614,"word":"升壓","characters":[{"definition":["to ascend\/to rise to the rank of\/to promote\/to hoist\/liter\/measure for dry grain equal to one-tenth dou 斗[dou3]"],"pinyin":["sheng1"],"word":"升"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"}],"containing_words":[{"definition":["vasopressor agent\/antihypotensive agent (medicine)"],"pinyin":["sheng1 ya1 ji4"],"word":"升壓劑"}],"sentences":[{"english":"Pressor response was induced by electrical stimulation of the hypothalamic defence area.","chinese":"電刺激下丘腦“防禦反應區”誘發升壓反應。"},{"english":"Electric power step-up substation is the important corollary engineering of Baise hydropower station.","chinese":"百色水利樞紐升壓站是電站工程的重要配套工程。"},{"english":"The structure of the circuit is the boost.","chinese":"電路結構運用了升壓斬波電路。"},{"english":"The thesis proposes a boost converter to achieve a power factor correction circuit.","chinese":"本文提出一種以升壓轉換器達成功因校正的電路。"},{"english":"In contrast, when the contralateral DM was lesioned, the Glu-induced PFTG pressor response was little affected.","chinese":"但是如果破壞異側DM，對此升壓反應並無明顯影響。"},{"english":"The amount of pressurization is called boost.","chinese":"增壓的量成爲升壓量。"},{"english":"And the stimulation of the median nerve (MN) always induced very strong pressor effects.","chinese":"刺激正中神經則引起非常強烈的升壓反應。"},{"english":"Introduces the steam boiler and booster step before the fire have those?","chinese":"介紹蒸汽鍋爐升火前與升壓步驟有那些？"},{"english":"They connect the negative going side of the tertiary step-up capacitor.","chinese":"他們連接了初級升壓電容的正要去的一面。"},{"english":"They connect the positive going side of the tertiary step-up capacitor.","chinese":"他們連接了初級升壓電容的正要去的一面。"},{"english":"In addition, the pressor effect mediated by H_1- receptors in rabbits could beantagonised by atropine.","chinese":"家兔H_1受體調節的升壓作用亦可被阿托品所阻斷。"}],"related":[]}