{"definition":["to escalate (in intensity)\/to go up by one grade\/to be promoted\/to upgrade (computing)"],"pinyin":["sheng1 ji2"],"simplified":["升级"],"rank":1808.0,"normalized_rank":0.02529626572272047,"fraction":0.00008632022020413204,"cumulative_fraction":0.7148290258292421,"word":"升級","characters":[{"definition":["to ascend\/to rise to the rank of\/to promote\/to hoist\/liter\/measure for dry grain equal to one-tenth dou 斗[dou3]"],"pinyin":["sheng1"],"word":"升"},{"definition":["level\/grade\/rank\/step (of stairs)\/CL:個|个[ge4]\/classifier: step, level"],"pinyin":["ji2"],"word":"級"}],"containing_words":[{"definition":["escalation"],"pinyin":["zhu2 bu4 sheng1 ji2"],"word":"逐步升級"}],"sentences":[{"english":"Just a few things off the top of my head regarding upgradable bags.","chinese":"一些關於揹包升級的想法一直在我腦海裏盤旋。"},{"english":"Mio Wei stressed that over the next five years is the critical period of China's industrial transformation and upgrading.","chinese":"苗圩強調，未來五年是我國工業轉型升級的攻堅時期。"},{"english":"If the system can use NESYS upgrade for the Japanese version of the arcade.","chinese":"如果利用NESYS系統能爲日本版街機升級。"},{"english":"Participate facility and equipment upgrades to improve plant productivity and throughput.","chinese":"參與升級廠房設施與設備以提高產率產量。"},{"english":"Japan's parliament has passed legislation to upgrade the country's defense agency into a full ministry.","chinese":"日本國會通過議案，將日本防衛廳升級爲省。"},{"english":"As well as a blacksmith upgrade for purchasing additional war machines.","chinese":"而且鐵匠鋪可以升級以購買額外的戰爭機器。"},{"english":"He faces an uphill battle against either Obama or Clinton.","chinese":"他將面對與奧巴馬或者希拉里的升級選戰。"},{"english":"An unresolvable problem occurred while calculating the upgrade.","chinese":"計算升級時發生不能解決的問題。"},{"english":"This mode use to recover from lost passwords and update IOS software.","chinese":"這種模式可以用來恢復密碼和升級IOS。"},{"english":"Save this change and finish the remaining steps of the upgrader.","chinese":"將此修改保存並繼續生下來的升級程序步驟。"},{"english":"The VRC PRO upgrade-refund guarantee works as follows.","chinese":"添加專業的升級退款保證工程如下。"},{"english":"Usefull to upgrade or recover your tablet.","chinese":"用於升級或恢復您的平板。"},{"english":"These changes will cost money, but they should be cheaper than decarbonization.","chinese":"升級改造需要資金，但這要比脫碳費用低。"},{"english":"Traditionally fighting escalates in Afghanistan as the weather turns warmer.","chinese":"在阿富汗，隨着氣候的轉暖，戰鬥就會升級。"},{"english":"You can upgrade from self-catering accommodation to a hotel.","chinese":"您可以將自理膳食旅店升級爲酒店。"},{"english":"Then click the Level Up button located under your character's picture.","chinese":"然後點擊人物圖片下面的升級按鈕。"}],"related":[{"definition":["optimization\/to optimize\/to make superior"],"pinyin":["you1 hua4"],"word":"優化"},{"definition":["transformation\/to transform"],"pinyin":["zhuan3 xing2"],"word":"轉型"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to exploit (a resource)\/to open up (for development)\/to develop"],"pinyin":["kai1 fa1"],"word":"開發"},{"definition":["to change\/to transform\/shift\/transformation\/CL:個|个[ge4]"],"pinyin":["zhuan3 bian4"],"word":"轉變"},{"definition":["to improve\/to make better\/CL:個|个[ge4]"],"pinyin":["gai3 jin4"],"word":"改進"},{"definition":["to introduce into\/to channel\/to lead\/to guide into\/to import (data)"],"pinyin":["dao3 ru4"],"word":"導入"},{"definition":["variant of 計劃|计划[ji4 hua4]"],"pinyin":["ji4 hua4"],"word":"計畫"},{"definition":["system\/CL:個|个[ge4]"],"pinyin":["xi4 tong3"],"word":"系統"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"發展"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["to bloom\/to open\/to be open (to the public)\/to open up (to the outside)\/to be open-minded\/unrestrained by convention\/unconstrained in one's sexuality"],"pinyin":["kai1 fang4"],"word":"開放"},{"definition":["to drive\/to propel\/drive (vehicle wheel)\/drive mechanism (tape or disk)\/device driver (computing software)"],"pinyin":["qu1 dong4"],"word":"驅動"},{"definition":["equipment\/facilities\/installations\/CL:個|个[ge4]"],"pinyin":["she4 bei4"],"word":"設備"},{"definition":["to serve\/service\/CL:項|项[xiang4]"],"pinyin":["fu2 wu4"],"word":"服務"},{"definition":["to achieve\/to implement\/to realize\/to bring about"],"pinyin":["shi2 xian4"],"word":"實現"}]}