{"definition":["half the number\/half"],"pinyin":["ban4 shu4"],"simplified":["半数"],"rank":8827.0,"normalized_rank":0.1235011822646314,"fraction":0.00001023711901657358,"cumulative_fraction":0.9189223218980666,"word":"半數","characters":[{"definition":["half\/semi-\/incomplete\/(after a number) and a half"],"pinyin":["ban4"],"word":"半"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[{"definition":["more than half"],"pinyin":["ban4 shu4 yi3 shang4"],"word":"半數以上"}],"sentences":[{"english":"Now the number has reached closely to 250, half of which have direct investment in sino-foreign joint ventures.","chinese":"其中有半數直接投資於中外合資企業。"},{"english":"By 1916, more than half the states held presidential primaries.","chinese":"到1916年，有半數以上的州舉行總統初選。"},{"english":"Almost half of children regularly breathe air polluted by tobacco smoke.","chinese":"近半數兒童經常呼吸遭受菸草煙霧污染的空氣。"},{"english":"More than half had postgraduate degrees.","chinese":"超過半數以上擁有研究生學位。"},{"english":"Women head investment banking operations at Kotak Mahindra and JPMorgan Chase and the equities division of Icici. Half of the deputy governors at the Reserve Bank of India are women.","chinese":"印度儲備銀行半數以上的副理事都是由女性擔任。"},{"english":"And, the share of the Asian test-takers who are women is fast approaching 50%.","chinese":"而且來自亞洲的考生中，女性比例正在迅速接近半數。"},{"english":"The population of Normandy, which saw most of the fighting, halved.","chinese":"經歷了大部分戰鬥的諾曼底人，半數死亡。"},{"english":"Half the garrison are on duty.","chinese":"有半數衛戍部隊在執勤。"},{"english":"Almost all of the animals and more than half of the higher plants are diploid.","chinese":"幾乎全部的動物和過半數的高等植物都是二倍體。"},{"english":"And half lethal dose was several hundred folds than the clinical dose.","chinese":"半數致死量是推薦臨牀劑量的幾百倍。"},{"english":"Nearly half Chinese multi-millionaires consider immigration, what are they afraid of?","chinese":"中國近半數千萬富豪考慮移民他們在怕些什麼？"},{"english":"More than half the workers and staff members in this mill are women.","chinese":"這個工廠過半數的職工是婦女。"},{"english":"The host threw half the amount at the driver and told him never to return.","chinese":"他把錢鈔的半數扔給司機，告訴他永遠別再回來。"},{"english":"You could put half of Trump\"s supporters into what I call the basket of deplorables.\"","chinese":"特朗普的半數支持者都是‘一籮筐可憐蟲’。"},{"english":"The board of supervisors shall have one chairman who is to be elected by more than half of all the supervisors.","chinese":"監事會設主席一人，由全體監事過半數選舉產生。"},{"english":"Half of patients have polymyalgia rheumatica.","chinese":"半數以上的病人有風溼性多肌痛。"}],"related":[]}