{"definition":["half of a lifetime"],"pinyin":["ban4 bei4 zi5"],"simplified":["半辈子"],"rank":25466.0,"normalized_rank":0.35630237991968994,"fraction":0.0000014193404659785662,"cumulative_fraction":0.9849661430214308,"word":"半輩子","characters":[{"definition":["half\/semi-\/incomplete\/(after a number) and a half"],"pinyin":["ban4"],"word":"半"},{"definition":["lifetime\/generation\/group of people\/class\/classifier for generations\/(literary) classifier for people"],"pinyin":["bei4"],"word":"輩"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi3","zi5"],"word":"子"}],"containing_words":[],"sentences":[{"english":"I was an atheist and evolutionist most of my life.","chinese":"我大半輩子都是個無神論進化論者。"},{"english":"What you know about bein bullied over half your life?","chinese":"你知道半輩子都被人欺負的滋味嗎？"},{"english":"For pretty much my entire life, she was a college math professor (and still is).","chinese":"在我的大半輩子裏，她始終是一名大學的數學教授。"},{"english":"Don't waste years of it chasing other people's goals. Take the time to decide what you want, and go after it wholeheartedly.","chinese":"不要辛苦了大半輩子結果卻是在追求別人的人生目標。"},{"english":"After roaming around nearly half his life, he finally settled down in Canada.","chinese":"半輩子的流浪生活，最後在加拿大定居了下來。"},{"english":"For much of his life he suffered from recurrent bouts of depression.","chinese":"他的大半輩子反覆發作抑鬱症。"},{"english":"Why I have spent half my life ascending upward.","chinese":"爲什麼我花了大半輩子拾級而上。"},{"english":"Most of her life was spent in caring for others.","chinese":"她大半輩子的時間都用來照顧別人了。"},{"english":"After roaming around nearly half his life, he finally settled down in Quebec.","chinese":"他過了半輩子的流浪生活，最後在魁北克定居了下來。"},{"english":"It's pathetic that human beings should be condemned to spend the greater part of their lives amid such surroundings.","chinese":"悲慘的是，人的大半輩子竟被禁錮在這種環境裏。"},{"english":"that's not what I wanted to be doing for the rest of my life.","chinese":"我不想下半輩子都做這行。"},{"english":"Then you ll spend the rest of your life looking over your shoulder.","chinese":"拮果您得花調下半輩子的時間回頭看。"},{"english":"Something tells us you’ll live to regret it.","chinese":"你要有了這些紋身，你下半輩子都會後悔的。"},{"english":"Most of her life was spent in bed.","chinese":"她的大半輩子都是在牀上度過的。"},{"english":"True love, mid-life. At last.","chinese":"真愛，半輩子了，終於找到了。"},{"english":"After roaming around nearly half his his life, he finally settled down in Canadan.","chinese":"他過了半輩子流浪生活，最後在加拿大定居下來。"}],"related":[]}