{"definition":["south side\/south face"],"pinyin":["nan2 ce4"],"simplified":["南侧"],"rank":11449.0,"normalized_rank":0.16018636408154127,"fraction":0.000006621253199203519,"cumulative_fraction":0.9404174551945592,"word":"南側","characters":[{"definition":["south","surname Nan"],"pinyin":["Nan2","nan2"],"word":"南"},{"definition":["lean on one side","the side\/to incline towards\/to lean\/inclined\/lateral\/side"],"pinyin":["ce4","zhai1"],"word":"側"}],"containing_words":[],"sentences":[{"english":"The lake is to the north, and in the south right adjacent is Song Zhuang Museum.","chinese":"湖泊位於建築北側，而南側與宋莊美術館相鄰。"},{"english":"The new structure faces south and looks towards a restored sauna built from cinder block.","chinese":"新建築朝向南側，可以看到從煤渣塊改造的蒸汽浴室。"},{"english":"I found that there was a Yamaha shop on the south side of town, past the airstrip .","chinese":"我發現，有雅馬哈店南側鎮，過去的簡易機場。"},{"english":"To the south and southeast of the campus there are bus stops.","chinese":"學校南側和東南側校園外都有公共汽車站。"},{"english":"To the south and southeast of the campus there are bus stops.","chinese":"學校南側和東南側校園外都有公共汽車站。"},{"english":"A plot of land located at the southeast point of airport charges.","chinese":"其中一幅地塊位於機場收費站東南側。"},{"english":"The positive lightning center is located to the south of the urban area.","chinese":"正電閃的空間分佈中心偏於市區的南側。"},{"english":"A new volume is destined to the garage and to the living situate to the South.","chinese":"一個新的空間作爲車庫，位於起居室南側。"},{"english":"It is located in the southwest side of the terminal of Beijing Capital Airport, in the northern part of the Airport's living area.","chinese":"坐落於首都機場航站樓西南側，位於機場生活區北端。"},{"english":"The SPC Huhang Railway Jinwei Branch in the south of the Industrial Zone is employed for the Industrial Zone railway transportation.","chinese":"依託工業區南側的石化股份公司滬杭鐵路金衛支線。"},{"english":"The structures stand on the edge of a pond at the southern end of the site.","chinese":"新籠舍位於場地南側，一個池塘的邊緣。"},{"english":"At south there is the street, traffic and passers-by whose look inside the house owners wanted to avoid.","chinese":"南側還是一條街道，交通和行人是主人想要避免的。"},{"english":"Railway trestle and railway are arranged in the southwest of the plant area according to planning requirement.","chinese":"鐵路棧橋與鐵路根據規劃要求佈置在廠區西南側。"},{"english":"Extensive siltation was caused to the south of Lingang Industrial Zone.","chinese":"臨港工業區以南側造成大面積的淤積。"},{"english":"The tidal power at the southeastern side of Baisha Island has a tiny increase.","chinese":"白沙東南側水域的潮動力仍有微幅增加。"},{"english":"The Living-dining room is south-facing for optimum light and view orientation.","chinese":"客廳南側有着最適宜的光線和景觀朝向。"}],"related":[]}