{"definition":["game theory"],"pinyin":["bo2 yi4 lun4"],"simplified":["博弈论"],"rank":36929.0,"normalized_rank":0.5166846221650133,"fraction":5.098998506287289e-7,"cumulative_fraction":0.9951217380587084,"word":"博弈論","characters":[{"definition":["extensive\/ample\/rich\/obtain\/aim\/to win\/to get\/plentiful\/to gamble"],"pinyin":["bo2"],"word":"博"},{"definition":["ancient name for go (Chinese board game)"],"pinyin":["yi4"],"word":"弈"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"論"}],"containing_words":[],"sentences":[{"english":"But they use game theory to reward good translations with badges, yes?","chinese":"不過譯言有運用博弈論，好的翻譯會得證章，對吧？"},{"english":"Using analysis method of games theory to expound the supervision and management to power supervision and management committee.","chinese":"運用博弈論分析方法闡述對電監會的監管。"},{"english":"We develop a game-theoretic model of this Effect.","chinese":"我們建立了這個效應的一個博弈論模型。"},{"english":"Chapter two comes to game-theoretical semantics.","chinese":"第二章着重討論了博弈論語義學。"},{"english":"It is like game theory.","chinese":"就像博弈論一樣。"},{"english":"This paper examines a serious attempt at a post-Gricean game theoretic account of language communication.","chinese":"時代語用研究領域裏利用博弈論解析語言交際的嘗試。"},{"english":"Game theory is a powerful weapon to decision-making of multi-person.","chinese":"博弈論是解決多人競爭決策問題的有利武器。"},{"english":"Operations Research, Game Theory, Fuzzy Decision Making, Financial Risk Management.","chinese":"運籌學，博弈論，模糊決策，金融風險管理。"},{"english":"But how, in the heat of the moment, can you remember what you learned about game theory?","chinese":"但盛怒之時，誰又會記得在博弈論裏面學過什麼？"},{"english":"He has left a legacy in things like game theory.","chinese":"博弈論便是他偉大的精神遺產之一。"},{"english":"This paper presents a multi-objective quantum Particle Swarm Optimization(PSO) based on game theory.","chinese":"提出一種基於博弈論的多目標量子粒子羣算法。"},{"english":"And the game theory and micro-economics are the primary tools.","chinese":"而博弈論和微觀經濟學的原理是本文主要的研究工具。"},{"english":"From this point of view, Quantum Game worths further research.","chinese":"由此可見，量子博弈論具有深入研究的價值。"},{"english":"This paper studies resources' distribution of agricultural sideline products (RDASP) by the method of game theory.","chinese":"用博弈論方法研究農副產品資源配置問題。"}],"related":[]}