{"definition":["Bolton (name)"],"pinyin":["Bo2 er3 dun4"],"simplified":["博尔顿"],"rank":14729.0,"normalized_rank":0.2060778195962112,"fraction":0.00000427845826569637,"cumulative_fraction":0.9578915934474722,"word":"博爾頓","characters":[{"definition":["extensive\/ample\/rich\/obtain\/aim\/to win\/to get\/plentiful\/to gamble"],"pinyin":["bo2"],"word":"博"},{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"},{"definition":["to stop\/to pause\/to arrange\/to lay out\/to kowtow\/to stamp (one's foot)\/at once\/classifier for meals, beatings, scoldings etc: time, bout, spell, meal"],"pinyin":["dun4"],"word":"頓"}],"containing_words":[],"sentences":[{"english":"It is either very good or very bad with Bolton.","chinese":"目前的博爾頓隊既說不上太好也說不上太壞。"},{"english":"Against Liverpool in the Premier League at home Bolton have won two, drawn two and lost four.","chinese":"迎戰利物浦之前，博爾頓的戰績是兩勝兩平四負。"},{"english":"I went on trial to Bolton when I was 10.","chinese":"我10歲就去參加了在博爾頓的訓練。"},{"english":"In defence, John Terry's valiant display kept Bolton out.","chinese":"特里嚴密的防守讓博爾頓啞然失色。"},{"english":"Bolton defend deep in the second-half and Chelsea run out of ideas.","chinese":"博爾頓在下半場嚴密防守，而切爾西亦無板斧破解。"},{"english":"Roy Hodgson hopes Joe Cole can kickstart his Liverpool career following his injury-time winner against Bolton on Saturday.","chinese":"霍二希望小喬可以在週六打贏博爾頓之後能夠爆發。"},{"english":"Sotirios Kyrgiakos made his Liverpool debut at Bolton back in August.","chinese":"基里亞科斯八月面對博爾頓上演他的利物浦處子秀。"},{"english":"A few years later, Boulton applied steam power to minting coins.","chinese":"幾年以後，博爾頓將蒸汽動力應用到了硬幣鑄造。"},{"english":"Daniel Sturridge was loaned to Bolton this season.","chinese":"斯圖裏奇是切爾西租借給博爾頓的。"},{"english":"Bolton are interested in bringing Barcelona youngster Thiago Alcantara in on a season-long loan.","chinese":"博爾頓很希望通過一年的租借引進蒂亞戈。"},{"english":"Once we got the first goal against Bolton the result was never in doubt.","chinese":"一旦我們在博爾頓首開紀錄，勝利是毫無疑問的。"},{"english":"Denilson is back in the squad and he will be available for Bolton.","chinese":"德尼爾森回到了球隊，他將可以在博爾頓比賽上場。"},{"english":"Merida is out because he has had an ankle injury since the first Bolton game.","chinese":"梅里達缺席，因爲他在第一場博爾頓比賽中腳踝受傷。"}],"related":[]}