{"definition":["Cagliari, Sardinia"],"pinyin":["Ka3 li4 ya4 li3"],"simplified":["卡利亚里"],"rank":32992.0,"normalized_rank":0.4616008842499965,"fraction":7.227352305934262e-7,"cumulative_fraction":0.9927183100040868,"word":"卡利亞里","characters":[{"definition":["to block\/to be stuck\/to be wedged\/customs station\/a clip\/a fastener\/a checkpost\/Taiwan pr. [ka3]","to stop\/to block\/(computing) (coll.) slow\/(loanword) card\/CL:張|张[zhang1],片[pian4]\/truck (from \"car\")\/calorie (abbr. for 卡路里[ka3 lu4 li3])\/cassette"],"pinyin":["ka3","qia3"],"word":"卡"},{"definition":["sharp\/favorable\/advantage\/benefit\/profit\/interest\/to do good to\/to benefit","surname Li"],"pinyin":["Li4","li4"],"word":"利"},{"definition":["Asia\/Asian\/Taiwan pr. [Ya3]","second\/next to\/inferior\/sub-\/Taiwan pr. [ya3]"],"pinyin":["Ya4","ya4"],"word":"亞"},{"definition":["Li (surname)","li, ancient measure of length, approx. 500 m\/neighborhood\/ancient administrative unit of 25 families\/(Tw) borough, administrative unit between the township 鎮|镇[zhen4] and neighborhood 鄰|邻[lin2] levels"],"pinyin":["Li3","li3"],"word":"里"}],"containing_words":[],"sentences":[{"english":"But it will be a goal for Cagliari.","chinese":"但這是一個爲了卡利亞里隊的進球。"},{"english":"No one thought that Cagliari could have been saved seven days before the end.","chinese":"結束前七天沒有人認爲卡利亞里將是死裏逃生的那個。"},{"english":"Roma management are discussing a move for Cagliari star David Suazo.","chinese":"羅馬的管理層增在討論要引進卡利亞里的球星蘇亞佐。"},{"english":"The game against Cagliari is really important.","chinese":"和卡利亞里的比賽十分重要。"},{"english":"Cagliari has changed coach and we don't know the identity of this team very well.","chinese":"卡利亞里換了主教練，我們不知道如何識別這支球隊。"},{"english":"However, we must be careful because Cagliari are not an easy team.","chinese":"然而，我們必須小心，卡利亞里不好對付。"},{"english":"The three points from Cagliari will be very important for us.","chinese":"從卡利亞里取得三分對我們來說將會是非常的重要。"},{"english":"The favourite is Chimenti of Cagliari who would make a return to the Old Lady.","chinese":"最有可能的是卡利亞里的奇門蒂返回“老婦人”。"},{"english":"Welcome to Cagliari.","chinese":"歡迎來卡利亞里。"},{"english":"He will be visiting four cities including Cagliari in Sardinia.","chinese":"他將會參觀四個城市，包括撒丁島的卡利亞里。"},{"english":"There are two big games coming up, against Cagliari and then Barcelona.","chinese":"和卡利亞里的比賽十分重要。"}],"related":[]}