{"definition":["carbine rifle (loanword)"],"pinyin":["ka3 bin1 qiang1"],"simplified":["卡宾枪"],"rank":48619.0,"normalized_rank":0.6802428889230898,"fraction":1.6670644987632655e-7,"cumulative_fraction":0.998745485062176,"word":"卡賓槍","characters":[{"definition":["to block\/to be stuck\/to be wedged\/customs station\/a clip\/a fastener\/a checkpost\/Taiwan pr. [ka3]","to stop\/to block\/(computing) (coll.) slow\/(loanword) card\/CL:張|张[zhang1],片[pian4]\/truck (from \"car\")\/calorie (abbr. for 卡路里[ka3 lu4 li3])\/cassette"],"pinyin":["ka3","qia3"],"word":"卡"},{"definition":["visitor\/guest\/object (in grammar)"],"pinyin":["bin1"],"word":"賓"},{"definition":["gun\/firearm\/rifle\/spear\/thing with shape or function similar to a gun\/CL:支[zhi1],把[ba3],桿|杆[gan3],條|条[tiao2],枝[zhi1]\/to substitute for another person in a test\/to knock\/classifier for rifle shots","surname Qiang"],"pinyin":["Qiang1","qiang1"],"word":"槍"}],"containing_words":[],"sentences":[{"english":"Lieutenant Hearn fingered the magazine on his carbine.","chinese":"候恩少尉用手摸了一下卡賓槍的彈盒。"},{"english":"Would you like my carbine?","chinese":"你要不要我的卡賓槍？"},{"english":"The world has enough junk rifles from Russia, thank you.","chinese":"世界上的俄羅斯垃圾卡賓槍已經夠多了，謝謝。"},{"english":"These carbines were in turn given to the Viet Cong.","chinese":"這些卡賓槍再被提供給南邊的越共遊擊隊。"},{"english":"Can some one lend me a double-barrelled rifle?","chinese":"誰能借一支雙響的卡賓槍給我？"},{"english":"At the same moment, he pressed the trigger of his rifle. The flame leaped forth.","chinese":"同時他扳動卡賓槍的扳機，噴出了一道閃光。"},{"english":"At first, the carbine rifle mainly uses for the cavalry soldier and the artillery.","chinese":"最初，卡賓槍主要供騎兵和炮兵使用。"},{"english":"As it is a cavalry carbine, it has no bayonet or socket for one.","chinese":"由於這是一個騎兵卡賓槍，它沒有一個刺刀或插座。"},{"english":"The Chinese have also exported these carbines to Central and South America.","chinese":"中國還出口這些卡賓槍到中美洲和南美洲。"},{"english":"Notheless, I do not see it is proper to carry a carbine with formal uniform.","chinese":"我不認爲它是正確的攜帶與正規制服卡賓槍。"},{"english":"The carbine rifle acquires fame from this.","chinese":"卡賓槍由此得名。"},{"english":"They sat there leisurely with their carbines on their thighs.","chinese":"他們悠閒地坐在那裏，卡賓槍放在大腿上。"},{"english":"The crack of Dalleson's carbine sounded again.","chinese":"達爾生的卡賓槍又砰地響了。"},{"english":"\"Can some one lend me a double-barrelled rifle?\" said Jean Valjean.","chinese":"“誰能借一支雙響的卡賓槍給我？”冉阿讓說道。"}],"related":[]}