{"definition":["Indo-European (language)"],"pinyin":["Yin4 Ou1 yu3"],"simplified":["印欧语"],"rank":69434.0,"normalized_rank":0.9714717445748744,"fraction":4.087373552134101e-9,"cumulative_fraction":0.99999455985177,"word":"印歐語","characters":[{"definition":["surname Yin\/abbr. for 印度[Yin4 du4]","to print\/to mark\/to engrave\/a seal\/a print\/a stamp\/a mark\/a trace\/image"],"pinyin":["Yin4","yin4"],"word":"印"},{"definition":["(used for transliteration)\/old variant of 謳|讴[ou1]","Europe\/abbr. for 歐洲|欧洲[Ou1 zhou1]\/surname Ou"],"pinyin":["Ou1","ou1"],"word":"歐"},{"definition":["dialect\/language\/speech","to tell to"],"pinyin":["yu3","yu4"],"word":"語"}],"containing_words":[{"definition":["Indo-European family of languages"],"pinyin":["Yin4 Ou1 yu3 xi4"],"word":"印歐語系"},{"definition":["Indo-European (language)"],"pinyin":["Yin4 Ou1 yu3 yan2"],"word":"印歐語言"}],"sentences":[{"english":"English and French are of the Indo-European family.","chinese":"英語和法語都屬於印歐語系。"},{"english":"They speak the Kurdish language, which is a member of the Iranian branch of Indo-European languages.","chinese":"他們的語言是庫爾德語，屬於印歐語系伊朗語族。"},{"english":"There are large differences on linguistic properties of syntax between Chinese and some Indo-European languages like German.","chinese":"漢語與德語等印歐語言在句法特性上有很大差別。"},{"english":"However, the English vocabulary is mainly derived from the IndoEuropean languages.","chinese":"不過，英語詞彙主要還是來源於印歐語系。"},{"english":"The Indo-European root that likely gave us our word number was nem.","chinese":"number這個詞的印歐語詞根可能是nem。"},{"english":"Experts say the people in that area spoke a language called Proto-Indo-European.","chinese":"專家說那個地區的人使用一種叫做古印歐語的語言。"},{"english":"Yet, Proto - Indo - European is believed to be the ancestor of most European languages.","chinese":"但是印歐語系被認爲是大多數歐洲語言的祖先。"},{"english":"English language and French language belong to Indo-European language system.","chinese":"英語和法語同屬印歐語系。"},{"english":"But the word root goes back to Indo-European.","chinese":"不過，人們得把它的詞根追溯到印歐語系了。"},{"english":"Consequently we have no written record of the common Indo-European language.","chinese":"因此，我們沒有任何印歐語言的文字記錄。"},{"english":"These are the branches of the Indo-European family tree, and we shall look briefly at each.","chinese":"這些是印歐語系分支，以下是各個語族的簡介。"}],"related":[]}