{"definition":["Indiana, US state"],"pinyin":["Yin4 di4 an1 na4 zhou1"],"simplified":["印第安纳州"],"rank":37867.0,"normalized_rank":0.5298084591384159,"fraction":4.7019393612228354e-7,"cumulative_fraction":0.9955807489407922,"word":"印第安納州","characters":[{"definition":["surname Yin\/abbr. for 印度[Yin4 du4]","to print\/to mark\/to engrave\/a seal\/a print\/a stamp\/a mark\/a trace\/image"],"pinyin":["Yin4","yin4"],"word":"印"},{"definition":["(prefix indicating ordinal number, e.g. first, number two etc)\/order\/(old) rank in the imperial examinations\/mansion\/(literary) but\/just"],"pinyin":["di4"],"word":"第"},{"definition":["content\/calm\/still\/quiet\/safe\/secure\/in good health\/to find a place for\/to install\/to fix\/to fit\/to bring (a charge against sb)\/to pacify\/to harbor (good intentions)\/security\/safety\/peace\/ampere","surname An"],"pinyin":["An1","an1"],"word":"安"},{"definition":["surname Na","to receive\/to accept\/to enjoy\/to bring into\/to pay (tax etc)\/nano- (one billionth)\/to reinforce sole of shoes or stockings by close sewing"],"pinyin":["Na4","na4"],"word":"納"},{"definition":["prefecture\/(old) province\/(old) administrative division\/state (e.g. of US)\/oblast (Russia)\/canton (Switzerland)"],"pinyin":["zhou1"],"word":"州"}],"containing_words":[],"sentences":[{"english":"So far eight people have died from flooding in Michigan and Indiana.","chinese":"至今密歇根州和印第安納州已有八人因洪水喪生。"},{"english":"Rival Hillary Clinton claimed victory in a close race in Indiana.","chinese":"他的對手克林頓參議員則在印第安納州小勝。"},{"english":"Indiana observes it on a county-by-county basis.","chinese":"印第安納州是以縣爲基礎考慮是否遵守的。"},{"english":"Welcome to Santa Claus, Indiana.","chinese":"歡迎來到印第安納州聖克勞斯。"},{"english":"A'fter grad'u. a'tion Mar'y return'ed home to her small town in In'di. an'a.","chinese":"畢業後瑪麗返回了她的家鄉，印第安納州的一個小鎮。"},{"english":"An Indiana state trooper stopped a car for a traffic violation.","chinese":"一名印第安納州州警因爲違反交通攔下一輛轎車。"},{"english":"Indiana’s shore is still lined with steel plants and refineries.","chinese":"印第安納州的湖濱仍然矗立着大量的鋼鐵廠和精煉廠。"}],"related":[]}