{"definition":["footprint"],"pinyin":["yin4 ji4"],"simplified":["印迹"],"rank":31872.0,"normalized_rank":0.4459306311474263,"fraction":7.982056636810451e-7,"cumulative_fraction":0.9918671832173164,"word":"印跡","characters":[{"definition":["surname Yin\/abbr. for 印度[Yin4 du4]","to print\/to mark\/to engrave\/a seal\/a print\/a stamp\/a mark\/a trace\/image"],"pinyin":["Yin4","yin4"],"word":"印"},{"definition":["footprint\/mark\/trace\/vestige\/sign\/indication\/Taiwan pr. [ji1]"],"pinyin":["ji4"],"word":"跡"}],"containing_words":[],"sentences":[{"english":"Witness Chengjiang People's Struggle Course And Happiness Marks.","chinese":"見證澄江人奮鬥歷程和幸福印跡。"},{"english":"If your entire foot is visible in the footprint, you have a flat foot.","chinese":"如果在印跡上雙腳清晰可見，那麼你就是平足。"},{"english":"Objective To perfect gene profile expressed in pre-implantation embryos.","chinese":"目的完善印跡基因在人類種植前胚胎的表達圖譜。"},{"english":"I can not wash out the marks from the shirt.","chinese":"我難以從襯衫上洗去印跡。"},{"english":"An improved immunoblotting method has been developed for the determination of apolipoprotein E, phenotypes.","chinese":"介紹一種免疫印跡法測定載脂蛋白E表型。"},{"english":"Bullets fired from a gun have striae based on the barrel used;","chinese":"在槍裏射出的子彈帶有槍管留下的條狀印跡。"},{"english":"Western blot showed the good immunological specificity of the IgY.","chinese":"經免疫印跡分析，具有良好的免疫學特異性。"},{"english":"Glossy colors, dried soon, could be mixed with photosensitive ink of all brands.","chinese":"顏色豔麗，印跡快乾，能與進口各品牌光敏印油混用。"},{"english":"It seems vaguely there was a red mark in Lily's neck.","chinese":"好像莉莉的脖頸間隱隱地真有一條紅色的印跡。"},{"english":"Western-blotting was used to observe the immune cross reactions.","chinese":"應用蛋白印跡觀察其與相關細菌的免疫交叉反應。"},{"english":"Objective To investigate whether genomic imprinting is involved in the etiology of tic disorder.","chinese":"目的研究遺傳印跡是否與抽動障礙的遺傳病因學有關。"},{"english":"We might find pick marks higher in the pin chambers, too.","chinese":"在珠孔的更高處，我們也可能找到印跡。"},{"english":"The content of heat shock protein 72 (HSP72) in cardiac muscle was measured by dot blot analysis.","chinese":"斑點印跡法測定心肌熱休克蛋白72含量。"},{"english":"Cell lysates were collected for Western blot analysis.","chinese":"收集到的細胞溶解液均進行免疫印跡分析。"},{"english":"The footprints blown off by the wind of Talimakan.","chinese":"塔克拉瑪干的風捲走了太多的印跡。"},{"english":"Sandwich ELISA, dot blotting and DNA sequencing methods were used for the identification of positive clones.","chinese":"通過硝酸纖維膜斑點印跡法進行陽性克隆鑑定。"}],"related":[]}