{"definition":["imminent"],"pinyin":["ji2 jiang1 lai2 lin2"],"simplified":["即将来临"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"即將來臨","characters":[{"definition":["namely\/that is\/i.e.\/prompt\/at once\/at present\/even if\/prompted (by the occasion)\/to approach\/to come into contact\/to assume (office)\/to draw near"],"pinyin":["ji2"],"word":"即"},{"definition":["general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead","to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])"],"pinyin":["jiang1","jiang4","qiang1"],"word":"將"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["to face\/to overlook\/to arrive\/to be (just) about to\/just before"],"pinyin":["lin2"],"word":"臨"}],"containing_words":[],"sentences":[{"english":"Week -long national day is coming. I'm looking forword to seeing Yun who was my good classmate at college.","chinese":"十一長假即將來臨，萬分期待着大學同學贇的到來。"},{"english":"So here's to the impending revolution in biology. Come Darwin's 300th anniversary there will be even more to celebrate.","chinese":"所以，我們預祝即將來臨的生物學革命。當達爾文誕生"},{"english":"A new world will hang about.","chinese":"一個新的世界即將來臨。"},{"english":"I feel a thunderstorm is brewing. Do you see the sheet-lightning there?","chinese":"恐怕暴雨即將來臨，您看見那邊打閃了嗎？"},{"english":"Those black clouds betoken a storm.","chinese":"那些黑雲預示著暴風雨即將來臨。"},{"english":"Second, the Mid-Autumn festival is coming, especially in the market shortage of maotai liquor.","chinese":"其次，中秋即將來臨，茅臺酒在市場上尤爲緊缺。"},{"english":"By the time that happens, a storm is imminent.","chinese":"一旦形成了雲或雨後，就意味着風暴即將來臨。"},{"english":"Leaves have already started to colour; it will soon be winter.","chinese":"樹葉已開始變色，冬季即將來臨。"},{"english":"The news of the impending storm sobered them down.","chinese":"關於暴風雨即將來臨的消息使他們冷靜下來。"},{"english":"A new millenium is approaching.","chinese":"一個新千年即將來臨。"},{"english":"The typhoon is coming, but we still decide to go picnicking anyway.","chinese":"颱風即將來臨，但不管怎樣我們仍決定去野餐。"},{"english":"To guard against the upcoming cold, you need more than just makeup to survive.","chinese":"想抵擋即將來臨的寒冷，不能只靠化妝品來過秋。"},{"english":"Gathering clouds announced the oncoming storm.","chinese":"聚雲預示了即將來臨的風暴。"},{"english":"The sailors provided against the coming storm by furling all sails .","chinese":"水手們收起全部船帆，以防備即將來臨的暴風雨。"},{"english":"We're coming up on election time, and he has been repeatedly stymied by congress.","chinese":"選舉季即將來臨，但奧巴馬總統卻一直受到國會掣肘。"},{"english":"An upcoming trip proves to be life-changing in positive ways.","chinese":"一次即將來臨的旅行，將用正面方式證明生命的改變。"}],"related":[]}