{"definition":["to wind\/to coil\/to spool\/to loop around\/winding"],"pinyin":["juan3 rao4"],"simplified":["卷绕"],"rank":60049.0,"normalized_rank":0.8401634183537839,"fraction":4.13116684019268e-8,"cumulative_fraction":0.9998169284363077,"word":"卷繞","characters":[{"definition":["scroll\/book\/volume\/chapter\/examination paper\/classifier for books, paintings: volume, scroll","to roll up\/roll\/classifier for small rolled things (wad of paper money, movie reel etc)"],"pinyin":["juan3","juan4"],"word":"卷"},{"definition":["to wind\/to coil (thread)\/to rotate around\/to spiral\/to move around\/to go round (an obstacle)\/to by-pass\/to make a detour\/to confuse\/to perplex"],"pinyin":["rao4"],"word":"繞"}],"containing_words":[],"sentences":[{"english":"The coil is a wound conductive wire having a cross-section of rectangular-shape.","chinese":"線圈是通過卷繞截面爲扁平形狀的導線而得到的。"},{"english":"Firstly, the characteristics of \"non-round\" winding is analyzed.","chinese":"首先，分析了“非圓”卷繞系統特點。"},{"english":"The products are made of metallized polypropylene film, seal with epoxy resin.","chinese":"金屬化聚丙烯膜卷繞而成，阻燃環氧樹脂封封。"},{"english":"The driving mechanism further realizes flexible winding of multi-head cords.","chinese":"也可使多頭線繩實現柔性卷繞。"},{"english":"The tin wire was spooled  after it was used.","chinese":"焊絲用完後已卷繞起來了。"},{"english":"Besides, the thread rope is respectively curled around the pollex and the middle finger and can prevent the cover body from falling off.","chinese":"且該線繩分別卷繞於姆指及中指上，可防止套體脫落。"},{"english":"Non- inductively wound with metallized polypropylene film.","chinese":"金屬化聚丙烯作介質，無感式卷繞。"},{"english":"The application prospects of spirally wound lead acid batteries were presented.","chinese":"展望了卷繞式鉛酸蓄電池的應用前景。"},{"english":"The electrode assembly is formed by winding the first and second electrode plates and the separator.","chinese":"電極組件通過卷繞第一和第二電極板以及隔板形成。"},{"english":"Complex accumulations of membranes consisting of vesicular and coiled membranous structures might develop within the plasmalemma invaginations.","chinese":"質膜內陷中的內含物以小泡和卷繞的膜結構形式存在。"},{"english":"Gradually expanding machine head, reducing energy consumption, improving the winding yarn.","chinese":"逐步擴大機臺頭數，降低能耗，完善卷繞紗筒。"},{"english":"The winding tension can be adjusted at ease in pre-take-up roller.","chinese":"卷繞張力可以在超喂羅拉上任意調節。"},{"english":"The ways to determine the wound coil number and the thickness of sectional warp were investigated.","chinese":"最後討論了條帶卷繞圈數及條帶厚度的確定方法。"},{"english":"The grooved drum is a shaped part which is widely used in bobbin winding machines.","chinese":"槽筒是自動絡筒機上用於卷繞成形的關鍵零件。"},{"english":"Due to the brittleness of fiber, the godet and wingding rollers with large diameter were used.","chinese":"由於光纖比較脆，採用了大尺寸的導絲盤和卷繞筒。"},{"english":"The skein after winding is characterized by even thickness and good form.","chinese":"卷繞後的絲片具有厚薄均勻，成形良好的特點。"}],"related":[]}