{"definition":["nevertheless\/actually\/the fact is ..."],"pinyin":["que4 shi4"],"simplified":["却是"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"卻是","characters":[{"definition":["but\/yet\/however\/while\/to go back\/to decline\/to retreat\/nevertheless\/even though"],"pinyin":["que4"],"word":"卻"},{"definition":["is\/are\/am\/yes\/to be"],"pinyin":["shi4"],"word":"是"}],"containing_words":[],"sentences":[{"english":"But that is the effect of relative dollar depreciation.","chinese":"但是，這卻是美元相對貶值的實際結果。"},{"english":"This scenery is not very beautiful, but a picture of autumn.","chinese":"這景色不見得很美，卻是一幅秋日風情畫。"},{"english":"But for property buyers are concerned, it is common snipe mussels competing and profit.","chinese":"但對於購房者來講，卻是鷸蚌相爭，漁翁得利。"},{"english":"Invasive molar pregnancy is extremely rare, but is one of te pre-cancer stage for choriocarcinoma .","chinese":"侵襲性葡萄胎非常罕見，但卻是絨癌的一種癌前病變。"},{"english":"Cyndi continued to play local clubs, but this time as a solo artist.","chinese":"她又繼續遊走於小型娛樂場所，這次卻是她一個人。"},{"english":"But through her cheek is warm tears.","chinese":"但是流過她臉頰的淚卻是溫馨的。"},{"english":"Mary teaches religion. However, she is an atheist. She has an excellent sense of humor.","chinese":"瑪麗教宗教，但她自己卻是個無神論者。"},{"english":"Oops. They were one of the best-performing sectors in 2012.","chinese":"但銀行股卻是2012年表現最佳的板塊之一。"},{"english":"But his eyes were also bleeding.","chinese":"眼中卻是一片鮮血淋漓。"},{"english":"I thought it was my brother. But instead, it was two police officers.","chinese":"我原以爲會是我的哥哥，但取而代之地卻是兩個警察。"},{"english":"The alternative, though cleaner, is leadership by wimps.","chinese":"而另一種選擇，雖然乾淨，但卻是被無能者領導。"},{"english":"I asked your disciples to drive out the spirit, but they could not.","chinese":"我請過你的門徒把鬼趕出去，他們卻是不能。"},{"english":"Instead, the fisherman drew out a copper jar.","chinese":"漁夫取出來的卻是一個銅罐。"},{"english":"One thing is certain, which is, that generally after conquerors follow thieves.","chinese":"有一點卻是確實的，就是常有小偷跟在勝利者後面。"},{"english":"But for Eikhenbaum, there's obviously a lot at stake.","chinese":"但是對艾肯鮑姆卻是生死攸關的。"},{"english":"Even with perfect viewing conditions, the lights are notoriously hit or miss.","chinese":"儘管天氣條件很好，北極光卻是來無影去無蹤。"}],"related":[]}