{"definition":["original position\/(in) the same place\/normal position\/the place where one currently is\/in situ"],"pinyin":["yuan2 wei4"],"simplified":["原位"],"rank":31346.0,"normalized_rank":0.4385712087081835,"fraction":8.358678914114236e-7,"cumulative_fraction":0.9914374307769624,"word":"原位","characters":[{"definition":["Hara (Japanese surname)","former\/original\/primary\/raw\/level\/cause\/source"],"pinyin":["Yuan2","yuan2"],"word":"原"},{"definition":["position\/location\/place\/seat\/classifier for people (honorific)\/classifier for binary bits (e.g. 十六位 16-bit or 2 bytes)\/(physics) potential"],"pinyin":["wei4"],"word":"位"}],"containing_words":[],"sentences":[{"english":"Using in situ end labelling, the authors demonstrated for the first time that this change belonged to apoptosis.","chinese":"經原位末端標記，首次證明本病的這種病變屬於凋亡。"},{"english":"Objective The in situ hybridization method was used with signal amplification system for detecting G-protein expression in taste buds.","chinese":"目的利用原位雜交檢測味細胞中G蛋白的表達。"},{"english":"In situ observation of TEM indicates that bainite nucleate by shear in solute atom's depleted regions.","chinese":"原位觀察證實貝氏體於溶質原子貧化區切變形核。"},{"english":"Objective To study advantages or disadvantages of total cystectomy and W shape orthotopic ileal neobladder.","chinese":"目的探討膀胱全切原位W形迴腸代膀胱術優缺點。"},{"english":"Myocardial apoptosis was detected with in situ end labeling and DNA ladder.","chinese":"原位末端標記法和DNA凝膠電泳檢測心肌細胞凋亡。"},{"english":"We found everything to be in place when we entered the room.","chinese":"我們走進房時發現一切都在原位。"},{"english":"The main problem is that Sagittarius does not like remaining on one place and aspires to independence.","chinese":"主要的問題在於，射手不喜歡留守原位，並渴望獨立。"},{"english":"Micro-cracks of rocks is closely related to in situ velocity variation.","chinese":"岩石微裂隙與主孔原位波速變化有密切關係。"},{"english":"Glove torn skin should be restored to thick split skin and be sutured;","chinese":"套狀撕脫皮膚可修復成中厚皮片行原位縫合。"},{"english":"Replace the tendons, repair the tendon sheaths and retinacula, and close the incision.","chinese":"將肌腱回覆原位，修補腱鞘及支持帶，然後關閉切口。"},{"english":"The patient treated for carcinoma in situ of the cervix must receive adequate follow-up.","chinese":"曾接受子宮頸原位癌治療的患者必須接受足夠的隨診。"},{"english":"The apoptosis in situ was measured by the nicking end labeling.","chinese":"凋亡原位檢測採用缺口末端標記法。"},{"english":"The spectral reflectance before and after irradiations of electrons was insitu measured.","chinese":"採用原位測量的手段記錄了輻照前後的光譜反射係數。"},{"english":"Please put the receiver back after calling.","chinese":"打完電話後，請把聽筒放回原位。"},{"english":"Hear here, Long Qi brings up of heart this just re- falls to return to family location.","chinese":"聽到這裏，龍琦提起的心這才重新落回了原位。"},{"english":"In this study, in-situ reaction technologies were used.","chinese":"在本論文研究中，使用了原位反應複合技術。"}],"related":[{"definition":["original spot\/previous place\/where it was before"],"pinyin":["yuan2 chu4"],"word":"原處"},{"definition":["original shape\/the same as before"],"pinyin":["yuan2 yang4"],"word":"原樣"},{"definition":["previous condition\/original state"],"pinyin":["yuan2 zhuang4"],"word":"原狀"},{"definition":["to put sth back where it belongs\/to return to the original position\/to return to one's seat (in a classroom)"],"pinyin":["gui1 wei4"],"word":"歸位"},{"definition":["to sit properly\/to sit up straight"],"pinyin":["zuo4 hao3"],"word":"坐好"},{"definition":["to shift\/shift\/translocation\/displacement\/(medicine) dislocation"],"pinyin":["yi2 wei4"],"word":"移位"},{"definition":["yawing (of a boat)"],"pinyin":["ping2 bai3"],"word":"平擺"},{"definition":["to move away"],"pinyin":["yi2 qu4"],"word":"移去"},{"definition":["in good condition\/undamaged\/intact"],"pinyin":["wan2 hao3 wu2 sun3"],"word":"完好無損"},{"definition":["to restore sb or sth to its original position\/to regain the throne\/to reset (a dislocated joint, an electronic device etc)\/reset"],"pinyin":["fu4 wei4"],"word":"復位"},{"definition":["(in) the original place\/the place where one currently is\/place of origin\/local (product)"],"pinyin":["yuan2 di4"],"word":"原地"},{"definition":["intact\/in good condition"],"pinyin":["wan2 hao3"],"word":"完好"},{"definition":["to roll\/to turn over\/to invert\/to flip"],"pinyin":["fan1 zhuan3"],"word":"翻轉"},{"definition":["trestle\/support\/frame\/to prop sth up"],"pinyin":["zhi1 jia4"],"word":"支架"},{"definition":["index (rotating gauge)\/cam gradation","transposition\/displacement\/inversion\/translocation\/to displace\/to transpose"],"pinyin":["zhuan3 wei4","zhuan4 wei4"],"word":"轉位"},{"definition":["backward"],"pinyin":["xiang4 hou4"],"word":"向後"}]}