{"definition":["originally\/original"],"pinyin":["yuan2 ben3"],"simplified":["原本"],"rank":2423.0,"normalized_rank":0.03390091363172107,"fraction":0.00006133352176942883,"cumulative_fraction":0.7593418694337462,"word":"原本","characters":[{"definition":["Hara (Japanese surname)","former\/original\/primary\/raw\/level\/cause\/source"],"pinyin":["Yuan2","yuan2"],"word":"原"},{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"}],"containing_words":[{"definition":["from beginning to end\/in its entirety\/in accord with fact\/literal"],"pinyin":["yuan2 yuan2 ben3 ben3"],"word":"原原本本"},{"definition":["Euclid's Elements"],"pinyin":["Ji3 he2 Yuan2 ben3"],"word":"幾何原本"}],"sentences":[{"english":"I just wanted to write down everything the professor said and memorize it.","chinese":"我就是把教授講的話原原本本紀錄下來然後記住。"},{"english":"It would have been Hefner's third marriage.","chinese":"這原本將是赫夫納的第三次婚姻。"},{"english":"Aeriform lieutenant general does group of relations intimately to be done aloof and tensely originally.","chinese":"無形中將原本親密的幹羣關係弄得疏遠而緊張了。"},{"english":"They are three times removed from the ideal forms of objects in reality.","chinese":"使現實的東西完全喪失了原本的完美造型。"},{"english":"The site of the Forbidden City was situated on the Imperial City during the Mongol Yuan Dynasty.","chinese":"紫禁城原本位於蒙元時期的都城。"},{"english":"FY : Well, if there were, You would not tell me.","chinese":"如果你喜歡他，你也不會原原本本地告訴我了。"},{"english":"It was originally designed for the pilot Clone Wars micro-series.","chinese":"它原本是爲《克隆人戰爭》微系列劇的飛行員設計的。"},{"english":"Nevertheless, Huang Jizhong translates religion and Western culture contents almost word for word out.","chinese":"黃繼忠將有關西方文化內容原原本本地翻譯了出來。"},{"english":"As the final lysis of his disease, his skin returned to its original color.","chinese":"當他的疾病終於漸退，他的皮膚恢復爲原本的顏色。"},{"english":"Originally wanted to dissolve the heart of small read slowly, and, behold, the little read away from home.","chinese":"原本想化解小念心裏的心結，不料，小念離家出走。"},{"english":"My heart ached for that part of me that was slipping away.","chinese":"原本屬於我生活的一部分正在遠去，這讓我心痛不已。"},{"english":"Wandering re-establishes the original harmony which once existed between man and the universe.","chinese":"旅行重新建立起了原本存在於人類與宇宙之間的和諧。"},{"english":"Luke’s journey to becoming a Jedi Knight would have had a lot more bumps.","chinese":"盧克成爲絕地武士的旅程原本要更加坎坷。"},{"english":"Dancing or ballroom dancing in particular, used to be very popular among universities.","chinese":"跳舞，跳交誼舞，原本在大學中是很流行的。"},{"english":"Many of our medicines originate in plants.","chinese":"許多藥物原本都是來自於植物。"},{"english":"Jiggle may make running both more difficult and injurious than it needs to be.","chinese":"最後，可能使跑步變得比原本更加具困難性和傷害性。"}],"related":[{"definition":["original\/originally\/at first\/it goes without saying\/of course"],"pinyin":["ben3 lai2"],"word":"本來"},{"definition":["originally\/original\/former"],"pinyin":["yuan2 xian1"],"word":"原先"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["however\/yet\/but"],"pinyin":["ran2 er2"],"word":"然而"},{"definition":["old variant of 卻|却[que4]"],"pinyin":["que4"],"word":"㕁"},{"definition":["because\/owing to\/on account of"],"pinyin":["yin1 wei4"],"word":"因為"},{"definition":["aim\/clear","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","really and truly","see 的士[di1 shi4]"],"pinyin":["de5","di1","di2","di4"],"word":"的"},{"definition":["original\/former\/originally\/formerly\/at first\/so, actually, as it turns out"],"pinyin":["yuan2 lai2"],"word":"原來"},{"definition":["only\/merely\/nothing but\/no more than\/it's just that ..."],"pinyin":["zhi3 bu5 guo4"],"word":"只不過"},{"definition":["originally\/at first\/at the outset"],"pinyin":["qi3 chu1"],"word":"起初"},{"definition":["in fact\/in reality\/as a matter of fact\/in practice"],"pinyin":["shi2 ji4 shang4"],"word":"實際上"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不過"},{"definition":["but on the contrary\/but expectedly"],"pinyin":["fan3 dao4"],"word":"反倒"},{"definition":["apparently\/to seem\/to appear\/as if\/seemingly"],"pinyin":["si4 hu1"],"word":"似乎"},{"definition":["also\/too\/(in Classical Chinese) final particle implying affirmation","surname Ye"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["first\/primary\/initial\/original\/at first\/initially\/originally"],"pinyin":["zui4 chu1"],"word":"最初"}]}