{"definition":["source language (linguistics)"],"pinyin":["yuan2 yu3"],"simplified":["原语"],"rank":65807.0,"normalized_rank":0.9207253088578904,"fraction":1.3137986417573894e-8,"cumulative_fraction":0.9999652110498942,"word":"原語","characters":[{"definition":["Hara (Japanese surname)","former\/original\/primary\/raw\/level\/cause\/source"],"pinyin":["Yuan2","yuan2"],"word":"原"},{"definition":["dialect\/language\/speech","to tell to"],"pinyin":["yu3","yu4"],"word":"語"}],"containing_words":[],"sentences":[{"english":"When you fly over a primitive, an information icon appears.","chinese":"移動到一個原語上時，顯示信息圖標。"},{"english":"You might also choose to externalize the routing using an endpoint lookup primitive.","chinese":"您還可能通過一個端點查找原語來具體化路由。"},{"english":"Understand how and when to use procedural primitives and level of detail.","chinese":"瞭解如何以及何時使用程序原語和詳細程度。"},{"english":"Retry support has been added, allowing a retry count to be specified on the primitive.","chinese":"增加了重試支持，允許在原語上指定重試計數。"},{"english":"The endpoint lookup primitive also supports version.","chinese":"端點查找原語也支持版本。"},{"english":"During this phase, you don't generally set properties on the primitives.","chinese":"在這個階段，一般不會對這些原語設置屬性。"},{"english":"This section introduces some of the basic graphics primitives.","chinese":"本節會簡介一些基本的圖形原語。"},{"english":"These are assigned using the BIND primitive.","chinese":"通過BIND原語可以爲套接字分配地址。"},{"english":"This primitive is going to route the inbound message to one of two possible transformations.","chinese":"此原語會將入站消息路由到兩個可能的轉換之一。"},{"english":"Which mediation flow primitives are you likely to use?","chinese":"您最有可能使用哪些中介流原語？"},{"english":"And I'm going to put those in quotes, it's a generalization.","chinese":"我將引用這些原語，這就是繼承。"},{"english":"Finally, completeness and consistence of the set of primitive are discussed briefly.","chinese":"最後討論了原語操作的完備性和一致性。"},{"english":"Wire the mediation flow primitive to the newly created import.","chinese":"將中介流原語連接到新創建的導出。"},{"english":"Prepare extra list for new primitives.","chinese":"準備新的原語表外。"},{"english":"All the required primitives have been added to the canvas.","chinese":"已將所有必要原語添加到設計圖板中。"},{"english":"At runtime, the primitive fires the output terminal three times.","chinese":"此原語在運行時將觸發輸出末端三次。"}],"related":[]}