{"definition":["original spot\/previous place\/where it was before"],"pinyin":["yuan2 chu4"],"simplified":["原处"],"rank":28965.0,"normalized_rank":0.4052579295678088,"fraction":0.0000010311859561526888,"cumulative_fraction":0.9892221062808059,"word":"原處","characters":[{"definition":["Hara (Japanese surname)","former\/original\/primary\/raw\/level\/cause\/source"],"pinyin":["Yuan2","yuan2"],"word":"原"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"He replaced the paper after reading it.","chinese":"他看完報，仍然放回原處。"},{"english":"In its place the nymphs found a beautiful flower.","chinese":"在屍體原處她們發現了一株美麗的花。"},{"english":"The front drawworks guard should be put back in place when the operation is completed.","chinese":"作業結束之後，要儘快把絞車前邊的護罩裝回原處。"},{"english":"At this also my heart trembleth, and is moved out of his place.","chinese":"因此我心戰兢，從原處移動。"},{"english":"He restored the umbrella he had taken by mistake.","chinese":"他把拿錯了的雨傘放回原處。"},{"english":"The air compressor has been repaired and fitted back in place.","chinese":"空氣壓縮機已被修復，裝回原處。"},{"english":"We should put the shoes in place before we decided which pair to buy.","chinese":"在我們確定買那一雙之前，我們應該將鞋子放回原處。"},{"english":"She restored the book she had taken by mistake.","chinese":"她把拿錯的書放回原處。"},{"english":"Children can clean up toys after playing.","chinese":"在遊戲後，能將玩具主動放回原處。"},{"english":"Replace the special tools to the original place.","chinese":"把專用工具放回原處。"},{"english":"Don't forget to put back the receiver when you've finished speaking.","chinese":"講完後別忘記把電話筒放回原處。"},{"english":"Will you please tell me how to use the card catalogue?","chinese":"請將卡片正確插回卡片箱內原處。"},{"english":"After using the telephone, please replace the handset.","chinese":"用完電話後，請把聽筒放回原處。"},{"english":"The shop-assistant dusted books and put every one in its place.","chinese":"店員把所有的書撣過灰塵，然後把每本書放回原處。"},{"english":"We have come full circle.","chinese":"我們兜了個圈子又回到原處。"},{"english":"He snatched the pistol back, jealously; shut the knife, and returned it to its concealment.","chinese":"他猜忌地把手槍奪回去，合攏刀子，又把它藏回原處。"}],"related":[]}