{"definition":["anaerobic"],"pinyin":["yan4 yang3"],"simplified":["厌氧"],"rank":42850.0,"normalized_rank":0.5995270941474403,"fraction":2.9429089575365523e-7,"cumulative_fraction":0.9974490292923814,"word":"厭氧","characters":[{"definition":["to loathe"],"pinyin":["yan4"],"word":"厭"},{"definition":["oxygen (chemistry)"],"pinyin":["yang3"],"word":"氧"}],"containing_words":[{"definition":["anaerobic bacteria"],"pinyin":["yan4 yang3 jun1"],"word":"厭氧菌"}],"sentences":[{"english":"They are anaerobic or microaerophilic, and are often found in hot springs or stagnant water.","chinese":"它們是厭氧生物，常被在硫磺泉或靜水中找到。"},{"english":"The action of effluent recycle on an upflow anaerobic filter is very complex.","chinese":"出水迴流對上流式厭氧濾器的影響非常複雜。"},{"english":"Currently, only a small percentage of U.S. dairies are equipped with anaerobic digesters.","chinese":"但是現在，只有很少的美國牛奶場配置了厭氧消化器。"},{"english":"Granulation is the core technology in high-speed anaerobic reactors .","chinese":"污泥顆粒化是高效厭氧反應器的核心技術。"},{"english":"The invention discloses a dual-channel self-cycle anaerobic bioreactor.","chinese":"本發明公開了一種雙通道自循環厭氧生物反應器。"},{"english":"The utilization of nitrite is not restricted by ammonia in the bacterium under both aerobic and anaerobic conditions.","chinese":"糞產鹼菌在厭氧條件下還具有需硝酸鹽的固氮酶活性。"},{"english":"Anaerobic ammonium oxidation(ANAMMOX)is an innovative process of biological nitrogen removal.","chinese":"厭氧氨氧化是一種全新的生物脫氮工藝。"},{"english":"The advantages of the anaerobic contact process are its easy management and wide application.","chinese":"厭氧接觸法是一種管理方便應用廣泛的厭氧處理工藝。"},{"english":"The advantages of the anaerobic contact process are its easy management and wide application.","chinese":"厭氧接觸法是一種管理方便應用廣泛的厭氧處理工藝。"},{"english":"Acetogenesis and hydrogen are an intermediate phase during the anaerobic digestion.","chinese":"產氫產酸是污泥厭氧消化過程中的一箇中間階段。"},{"english":"Disaggregated and whole anaerobic granules were taken as inoculum, respectively.","chinese":"分別以解體和完好的厭氧顆粒污泥作爲種泥進行培養。"},{"english":"It eradicates anaerobic bacteria and consequently washes them off your lips.","chinese":"它根除厭氧細菌，因此洗滌趕走你的嘴脣。"},{"english":"The effect of treatment of wet-blue waste water with the AFB is perfect.","chinese":"厭氧流化牀反應器對藍皮製革廢水處理效果較好。"},{"english":"The anaerobic treatment of bagasse wastewater by a series of experiments is studied.","chinese":"對甘蔗渣噴淋廢水進行了一系列的厭氧處理實驗研究。"},{"english":"Anaerobic bio-reactor with shock wave can produce the methane in ambient temperature.","chinese":"激波厭氧反應器可在常溫下成功實現產甲烷過程。"},{"english":"Fermentation is carried out anaerobically at a temperature below 20℃.","chinese":"發酵完成是在溫度低於20℃厭氧條件下。"}],"related":[]}