{"definition":["place\/destination"],"pinyin":["qu4 chu4"],"simplified":["去处"],"rank":14437.0,"normalized_rank":0.2019923607516125,"fraction":0.000004426041646453784,"cumulative_fraction":0.9566205214352536,"word":"去處","characters":[{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"The past is a good place to visit, but certainly not a good place to stay.","chinese":"過去，是我們偶爾到訪的好去處，但顯然不宜長留。"},{"english":"The place to see son has red flag finally relieved.","chinese":"見兒子有了去處，文紅旗終於鬆了口氣。"},{"english":"But I thought it was actually one of the better places to see a show or a game.","chinese":"但我想它真是個看錶演或比賽的好去處。"},{"english":"The best place for diving is the West Islet and the Wuzhizhou Islet in Sanya.","chinese":"潛水的最佳去處是三亞的西島和蜈支洲島。"},{"english":"So \"Moonshadow Japanese Restaunrant\" will be the best place of enjoy youself.","chinese":"“月影日本料理”將是您留戀忘返的最佳去處。"},{"english":"The arctic village is you find north, explore photography fans to play, the best place to go.","chinese":"北極村是你找北，探索遊玩，攝影愛好者的最佳去處。"},{"english":"Wherever the son went, he inquired about his father.","chinese":"每到一處，他都詢問父親的去處。"},{"english":"One lovely spot is Hembury Woods in the Dart Valley, Devon.","chinese":"一個最佳觀賞去處是德文郡達特山谷的亨百麗森林。"},{"english":"Probenecid improves the kidneys ability to remove uric acid from body.","chinese":"丙黃舒可以提高腎臟去處尿酸的能力。"},{"english":"\"Honk the golf club\" is a good whereabouts.","chinese":"“嘎那高爾夫俱樂部”就是個好去處。"},{"english":"If ability with this whereabouts matter, the whole life is happy to allow free and unfettered.","chinese":"若能以此去處事，一生安樂任逍遙。"},{"english":"It's quite a nice area to just meander and just to walk around.","chinese":"這是個遛彎散步的好去處。"},{"english":"What do you think makes Beverly Hills a unique shopping place?","chinese":"你覺得什麼讓比佛利山莊成了獨特的購物去處呢？"},{"english":"After that , what happened to the Amber Room remains a mystery .","chinese":"從那以後，琥珀屋的去處便成了一個謎。"},{"english":"Tianyuan Kui Fan Zhuang is a good place to drink coffee.","chinese":"天元奎飯莊是喝咖啡的好去處。"},{"english":"But the country's new leadership says they do not know where he is.","chinese":"但是國家新領導說他們仍然不清楚卡扎菲的去處。"}],"related":[{"definition":["in a word\/in short\/in brief"],"pinyin":["zong3 zhi1"],"word":"總之"},{"definition":["to help\/to lend a hand\/to do a favor\/to do a good turn"],"pinyin":["bang1 mang2"],"word":"幫忙"},{"definition":["means\/method\/way (of doing sth)\/CL:條|条[tiao2],個|个[ge4]"],"pinyin":["ban4 fa3"],"word":"辦法"},{"definition":["solution\/method to settle an issue"],"pinyin":["jie3 jue2 ban4 fa3"],"word":"解決辦法"},{"definition":["to strive one's hardest\/to spare no effort"],"pinyin":["jin4 li4"],"word":"盡力"},{"definition":["surname Lai","to depend on\/to hang on in a place\/bad\/to renege (on promise)\/to disclaim\/to rat (on debts)\/rascally\/to blame\/to put the blame on"],"pinyin":["Lai4","lai4"],"word":"賴"},{"definition":["willing (to do sth)\/to take pleasure in"],"pinyin":["le4 yu2"],"word":"樂於"},{"definition":["to instruct\/to teach\/guidance\/teaching"],"pinyin":["jiao4 dao3"],"word":"教導"},{"definition":["only natural\/as it should be\/certainly\/of course\/without doubt"],"pinyin":["dang1 ran2"],"word":"當然"},{"definition":["to search\/to look for\/to seek"],"pinyin":["xun2"],"word":"尋"},{"definition":["to handle\/to treat\/to deal with\/to process\/to deal with a criminal case\/to mete out punishment\/to offer for sale at a reduced price\/to punish"],"pinyin":["chu3 li3"],"word":"處理"},{"definition":["often\/constantly"],"pinyin":["shi2 shi2"],"word":"時時"},{"definition":["improbable\/unlikely\/will not (act, happen etc)\/not able\/not having learned to do sth\/(coll.) (Tw) don't mention it\/not at all"],"pinyin":["bu4 hui4"],"word":"不會"},{"definition":["to obey\/to follow\/to arrange\/to make reasonable\/along\/favorable"],"pinyin":["shun4"],"word":"順"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["to yield\/to permit\/to let sb do sth\/to have sb do sth\/to make sb (feel sad etc)\/by (indicates the agent in a passive clause, like 被[bei4])"],"pinyin":["rang4"],"word":"讓"}]}