{"definition":["frame of reference\/coordinate frame (math.)"],"pinyin":["can1 zhao4 xi4"],"simplified":["参照系"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"參照系","characters":[{"definition":["ginseng\/one of the 28 constellations","three (banker's anti-fraud numeral)","to take part in\/to participate\/to join\/to attend\/to counsel\/unequal\/varied\/irregular\/uneven\/not uniform\/abbr. for 參議院|参议院 Senate, Upper House"],"pinyin":["can1","san1","shen1"],"word":"參"},{"definition":["according to\/in accordance with\/to shine\/to illuminate\/to reflect\/to look at (one's reflection)\/to take (a photo)\/photo\/as requested\/as before"],"pinyin":["zhao4"],"word":"照"},{"definition":["system\/department\/faculty"],"pinyin":["xi4"],"word":"系"}],"containing_words":[],"sentences":[{"english":"We determined an outcome-drien reference frame for ABP measurement.","chinese":"我們確定一個結果爲嚮導的參照系測量動態血壓。"},{"english":"Its content and reference frame varies in different ages, directly impacting the content and form of historical compilation with different features of era.","chinese":"然而其內容和參照系，卻因時代不同而表現互異。"},{"english":"Answer: Bias is inside the Reference System.","chinese":"偏執就偏在參照系裏面。"},{"english":"Answer: It will be like this if the Reference System is really broken.","chinese":"如果真正能夠打破了參照系，那就是這個樣子。"},{"english":"We determined an outcome-driven reference frame for ABP measurement.","chinese":"我們確定一個結果爲嚮導的參照系測量動態血壓。"},{"english":"The measuring pattern is the content of the Reference System.","chinese":"這個衡量模式就是參照系的內容。"},{"english":"There exists in the cosmos a preferred frame of reference.","chinese":"宇宙中有一個從優參照系。"},{"english":"Quasars are so far away that they constitute the best frame of reference for measuring Earth’s rotation rate.","chinese":"到目前爲止，類星體是測量地球自轉最好的參照系。"},{"english":"The earth rotates and moves around the sun , so it is a non - inertial reference system - .","chinese":"地球既有自轉又有公轉，所以是非慣性參照系。"},{"english":"Having these paranormal capacities doesn't mean the Reference System has changed.","chinese":"有了這些超常功能不等於參照系變了。"},{"english":"Usually, the reference frame is the Earth.","chinese":"通常這個參照系就是地球。"}],"related":[]}