{"definition":["parameter (math)\/quantity used as a parameter\/modulus (math.)"],"pinyin":["can1 liang4"],"simplified":["参量"],"rank":61601.0,"normalized_rank":0.8618779119387739,"fraction":3.2115077909625084e-8,"cumulative_fraction":0.9998736581156848,"word":"參量","characters":[{"definition":["ginseng\/one of the 28 constellations","three (banker's anti-fraud numeral)","to take part in\/to participate\/to join\/to attend\/to counsel\/unequal\/varied\/irregular\/uneven\/not uniform\/abbr. for 參議院|参议院 Senate, Upper House"],"pinyin":["can1","san1","shen1"],"word":"參"},{"definition":["capacity\/quantity\/amount\/to estimate\/abbr. for 量詞|量词[liang4 ci2], classifier (in Chinese grammar)\/measure word","to measure"],"pinyin":["liang2","liang4"],"word":"量"}],"containing_words":[{"definition":["moduli space (math.)\/parameter space"],"pinyin":["can1 liang4 kong1 jian1"],"word":"參量空間"}],"sentences":[{"english":"Cold-test parameter is the premise of the beam and wave interaction calculation.","chinese":"行波管的冷參量是電磁波與電子注互作用計算的基礎。"},{"english":"The experimental results on parameters of the pressure and the angle between pump and seed beams are then presented.","chinese":"並給出斜泵浦拉曼放大下氣壓和角度參量的實驗結果。"},{"english":"Experiment analysis of correlated color temperature and distribution temperature of the source;","chinese":"顏色溫度和相關色溫是光源的重要參量。"},{"english":"Optical flux is an important parameter of polarization interference spectrometer.","chinese":"光通量是偏振干涉成像光譜儀的關鍵參量之一。"},{"english":"The dependence of the gain behavior of the system on Rabi frequency of the driving field and other parameters is also illustrated and analyzed.","chinese":"圖示並分析了系統增益對驅動場和其他參量的依賴性。"},{"english":"The property of viscoelastic interface fracture and the calculating method of fracture parameter are investigated.","chinese":"研究了粘彈性界面斷裂的性質和斷裂參量的計算方法。"},{"english":"Through scaling transform, field F and energy level E are replaced by parameter t.","chinese":"通過標度變換，引入t參量代替能級E和外電場F。"},{"english":"The parameters of equivalent four? terminal networks of the single cosine type ultrasonic horn are derived.","chinese":"推導出餘弦形單一超聲變幅杆的等效四端網絡參量。"},{"english":"Two, the arguments or parameters, and three, is the return value.","chinese":"第二個，參數和參量，還有三，是那個返回值。"},{"english":"The behaviour of passively Q-switched solid-state lasers containing intracavity optical parametric oscillators(OPOs) is described in detail.","chinese":"理論分析了被動調Q固體激光泵浦的光參量振盪器。"},{"english":"An argument or a parameter is an input to a function.","chinese":"參數或參量是一個函數的輸入。"},{"english":"The measurement function was established by defining single parameter unascertained measurement matrix.","chinese":"定義參量未確知測度矩陣，確定各測度函數。"},{"english":"The dependence of the gain behavior of the system on Rabi frequency of the driving field and other parameters is also illustrated and anal…","chinese":"圖示並分析了系統增益對驅動場和其他參量的依賴性。"},{"english":"Blackness is an important parameter in the radiometry.","chinese":"黑度是輻射學中的重要參量。"},{"english":"In recent two years, the measure of those parameters have had new progress.","chinese":"近兩年裏，這些基本參量的測定有了突破性的進展。"},{"english":"The draw-out-time is one of the most important ballistic parameters of the low-drag parachute bomb.","chinese":"減速傘拉直時間是描述低空低阻傘彈道特重要要參量。"}],"related":[]}