{"definition":["also known as\/alternative name\/to also be called"],"pinyin":["you4 ming2"],"simplified":["又名"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"又名","characters":[{"definition":["(once) again\/also\/both... and...\/and yet\/(used for emphasis) anyway"],"pinyin":["you4"],"word":"又"},{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"}],"containing_words":[],"sentences":[{"english":"Three-colored amaranth of iron of red Sangyou name, produce southern Asia archipelago formerly.","chinese":"紅桑又名鐵莧菜，原產南洋羣島。"},{"english":"Plate armour is called a \"harness\", and it requires a Master Armourer to make and fit it to a soldier.","chinese":"板甲又名全身甲，需要盔甲大師爲士兵度身定造。"},{"english":"The Bodhi tree, under which Buddha attained  enlightenment, was a banyan by another name.","chinese":"佛是在菩提樹下悟道的，菩提又名榕樹。"},{"english":"Wu Gorge, also known as Great Gorge to a beautiful deep said.","chinese":"巫峽又名大峽，以幽深秀麗著稱。"},{"english":"Alcohol, and feathers, also known as the beginning.","chinese":"飲酒器，又名羽觴。"},{"english":"The golden snub-nosed monkey are endemic to China.","chinese":"又名仰鼻猴，是中國的特有物種。"},{"english":"Vitamin C, also known as ascorbic acid, is a water-soluble vitamin.","chinese":"維他命C，又名抗壞血酸，是一種水溶性維生素。"},{"english":"Law, also known as white beans, pepper, fruit thin, long handles, light fragrance.","chinese":"豆椒又名白椒，果實皮薄，柄較長，香味淡。"},{"english":"Daisy and name the life-sustaining chrysanthemum, is a perennial herb compositae, the origin of Europe.","chinese":"雛菊又名延命菊，是菊科多年生草本植物，原產歐洲。"},{"english":"Viagra, also known as sildenafil, is manufactured by Pfizer Inc.","chinese":"偉哥，又名西地那非，由輝瑞公司生產。"},{"english":"The other name of Paifang Is Chinese Archway (Pailou), which is special type branch of Chinese ancient architecture.","chinese":"牌坊又名牌樓，是中國古代建築中的一個特殊類別。"},{"english":"The most tempting place in Yanghuo is the Slabstone Street,which has gained a new name as “The Western Street”.","chinese":"陽朔最吸引人的地方就是板石街，又名“西洋街”。"},{"english":"The Pennsylvania Dutch are actually from Germany, aka Deutschland.","chinese":"賓夕法尼亞荷蘭人實際上來自德意志，又名德國。"},{"english":"Nan bamboo shoot, also called Mao bamboo shoot or Yulanpian(dried slices of tender bamboo shoots).","chinese":"楠筍又名毛竹筍，玉蘭片。"},{"english":"Then his son Judas, called Machabeus, rose up in his stead.","chinese":"他的兒子猶大又名瑪加伯的，接了他的位。"},{"english":"The most attractive place in Yangshuo is, of course, the Slabstone Street, also known as \"the Western Street\".","chinese":"陽朔最吸引人的地方就是板石街，又名“西洋街”。"}],"related":[{"definition":["also known as"],"pinyin":["you4 cheng1"],"word":"又稱"},{"definition":["alias\/alternative name"],"pinyin":["bie2 ming2"],"word":"別名"},{"definition":["vernacular name\/lay name (of a priest)"],"pinyin":["su2 ming2"],"word":"俗名"},{"definition":["also known as\/alternative name\/to also be called"],"pinyin":["yi4 cheng1"],"word":"亦稱"},{"definition":["original name"],"pinyin":["yuan2 ming2"],"word":"原名"},{"definition":["scientific name\/Latin name (of plant or animal)\/(according to an old system of nomenclature) on entering school life, a formal personal name given to new students"],"pinyin":["xue2 ming2"],"word":"學名"},{"definition":["another name\/alternative name"],"pinyin":["bie2 cheng1"],"word":"別稱"},{"definition":["... hence the name (used at the end of a sentence)"],"pinyin":["gu4 cheng1"],"word":"故稱"},{"definition":["old term\/old way of referring to sth"],"pinyin":["jiu4 cheng1"],"word":"舊稱"},{"definition":["commonly referred to as\/common term"],"pinyin":["su2 cheng1"],"word":"俗稱"},{"definition":["to get one's name\/named (after sth)"],"pinyin":["de2 ming2"],"word":"得名"},{"definition":["to be generally referred to (as)\/generic term"],"pinyin":["tong1 cheng1"],"word":"通稱"},{"definition":["also called\/also known as\/a.k.a."],"pinyin":["huo4 cheng1"],"word":"或稱"},{"definition":["to call\/to be called"],"pinyin":["jiao4 zuo4"],"word":"叫作"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"},{"definition":["full name"],"pinyin":["quan2 cheng1"],"word":"全稱"}]}