{"definition":["also known as"],"pinyin":["you4 cheng1"],"simplified":["又称"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"又稱","characters":[{"definition":["(once) again\/also\/both... and...\/and yet\/(used for emphasis) anyway"],"pinyin":["you4"],"word":"又"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"}],"containing_words":[],"sentences":[{"english":"Having another name of Guihua temple, Songzanlin temple is a architecture group like a market town.","chinese":"松贊林寺又稱歸化寺，是一座集鎮規模的建築羣。"},{"english":"Duanwu Festival is also called Dragon Boat Festival.","chinese":"端午節又稱龍舟節。"},{"english":"Like carp, crucian carp, also known as Africa.","chinese":"形似鯽魚，又稱非洲鯽魚。"},{"english":"One legend features the Jade Emperor, also known as the Emperor of Heaven.","chinese":"有一個傳說的主角是玉皇大帝，又稱元始天尊。"},{"english":"On the left is M97 in the constellation Ursa Major, also known in the northern hemisphere as the Owl Nebula.","chinese":"左邊是M97在大熊座，又稱北半球的夜梟星雲。"},{"english":"Teng White Lotus Lake, also known as \" merciless lotus root\", characterized by lotus root is not even broken wire.","chinese":"白滕湖蓮藕又稱“無情藕”，其特點在於藕斷絲不連。"},{"english":"I like Kashi, also known as Kashgar.","chinese":"我很喜歡喀什，它又稱喀什葛爾。"},{"english":"High blood glucose levels, known as hyperglycemia, can cause serious health problems.","chinese":"高血糖症又稱多醣症，能引發嚴重的健康問題。"},{"english":"The San Jose Navigation unit, aka EB-85A.","chinese":"在聖何塞導航裝置，又稱EB病毒85A條。"},{"english":"This type of small gold \"Cube Money\" was produced by cutting segments from a larger sheet or bar of gold.","chinese":"這種又稱“印子金”的金片是自大塊或長條金版切割。"},{"english":"Constcontra -ne Tin. nosso cnosled Boss Long. Founder and owner of Drefeel.","chinese":"龍雲天，又稱龍老闆，空想公會的創辦人和具有者。"},{"english":"Also called the flag-raising mountain and penang topography top, altitude 830 metres.","chinese":"又稱升旗山，是檳城地勢最高處，海拔830米左右。"},{"english":"West Lake Water Shield Soup is also called \"Chicken, Ham and Water Shield Soup\", and it is the traditional Hangzhou famous Food.","chinese":"西湖蓴菜湯又稱雞火蓴菜湯，是杭州的傳統名菜。"},{"english":"Great pepper oil, also known as pepper, the dry goods for the red sauce, deep flavor.","chinese":"大花椒又稱油椒，其幹品爲醬紅色，香味濃厚。"},{"english":"These three factors, known as the fraud triangle, are pressure, opportunity and rationalization.","chinese":"這三個因素，又稱舞弊三角，是壓力，機會和藉口。"},{"english":"So Xuejiadao also known as \"Phoenix Islands.\"","chinese":"因此薛家島又稱“鳳凰島”。"}],"related":[{"definition":["commonly referred to as\/common term"],"pinyin":["su2 cheng1"],"word":"俗稱"},{"definition":["called\/to call sth (by a name)\/to name"],"pinyin":["cheng1 wei2"],"word":"稱為"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"},{"definition":["joint name\/combined name"],"pinyin":["bing4 cheng1"],"word":"並稱"},{"definition":["to be collectively called\/collective term\/general designation"],"pinyin":["tong3 cheng1"],"word":"統稱"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"},{"definition":["name (of a thing)\/name (of an organization)"],"pinyin":["ming2 cheng1"],"word":"名稱"},{"definition":["to be called\/to be known as"],"pinyin":["ming2 wei2"],"word":"名為"},{"definition":["to view as\/to see as\/to consider to be\/to deem"],"pinyin":["shi4 wei2"],"word":"視為"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"認為"},{"definition":["to expound Buddhist teachings","way of speaking\/wording\/formulation\/one's version (of events)\/statement\/theory\/hypothesis\/interpretation"],"pinyin":["shuo1 fa3","shuo1 fa5"],"word":"說法"},{"definition":["(various things) such as\/such as (the following)"],"pinyin":["zhu1 ru2"],"word":"諸如"},{"definition":["similar\/analogous"],"pinyin":["lei4 si4"],"word":"類似"},{"definition":["it is said that\/reportedly"],"pinyin":["ju4 shuo1"],"word":"據說"},{"definition":["person (first person, second person etc in grammar)\/called\/known as"],"pinyin":["ren2 cheng1"],"word":"人稱"},{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有關"}]}