{"definition":["anti-missile"],"pinyin":["fan3 dao3"],"simplified":["反导"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"反導","characters":[{"definition":["contrary\/in reverse\/inside out or upside down\/to reverse\/to return\/to oppose\/opposite\/against\/anti-\/to rebel\/to use analogy\/instead\/abbr. for 反切[fan3 qie4] phonetic system"],"pinyin":["fan3"],"word":"反"},{"definition":["to transmit\/to lead\/to guide\/to conduct\/to direct"],"pinyin":["dao3"],"word":"導"}],"containing_words":[{"definition":["anti-missile missile (such as the Patriot Missile)"],"pinyin":["fan3 dao3 dao3 dan4"],"word":"反導導彈"},{"definition":["anti-missile"],"pinyin":["fan3 dao3 dan4"],"word":"反導彈"},{"definition":["anti-missile system\/missile defense system"],"pinyin":["fan3 dao3 xi4 tong3"],"word":"反導系統"}],"sentences":[{"english":"The rational disposition of anti-TBM units is a precondition and a key factor to intercept TBM.","chinese":"合理部署反導兵器是攔截TBM的前提和關鍵。"},{"english":"U.S. anti-missile ships are moving into the Gulf.","chinese":"美國的反導艦艇目前正開進波斯灣。"},{"english":"And with the pros and cons of cloth guide conversion device, convenient for producing .","chinese":"並配正反導布轉換裝置，方便生產。"},{"english":"Anti-missile batteries are being deployed on the Arab shore.","chinese":"反導裝置也正被部署在阿拉伯海岸。"},{"english":"Some NATO allies remain anxious about cooperating with Russia on missile defense.","chinese":"某些北約盟國對與俄羅斯進行反導合作感到擔心。"},{"english":"Deterrence, not antimissile interceptors, is still the best defense.","chinese":"威懾而非反導攔截仍是最佳的防禦手段。"},{"english":"They will test-fire an anti-missile missile next week.","chinese":"他們將於下週試射反導彈導彈。"},{"english":"However, the NATO anti-missile system construction plan met opposition from Russia.","chinese":"然而，北約反導系統建設計劃遭到俄羅斯的反對。"},{"english":"Thus, remote setting becomes the necessary trend of short range anti-missile's development.","chinese":"因此，遙控裝定就成爲近程反導彈藥發展的必然趨勢。"},{"english":"The effort will include the deployment of four anti-ballistic-missile-equipped destroyers to the coast of Spain.","chinese":"包括在西班牙海岸設置四架反導彈驅逐艦。"}],"related":[]}