{"definition":["reactionary forces (esp. in Marxist rhetoric)"],"pinyin":["fan3 dong4 shi4 li5"],"simplified":["反动势力"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"反動勢力","characters":[{"definition":["contrary\/in reverse\/inside out or upside down\/to reverse\/to return\/to oppose\/opposite\/against\/anti-\/to rebel\/to use analogy\/instead\/abbr. for 反切[fan3 qie4] phonetic system"],"pinyin":["fan3"],"word":"反"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["power\/influence\/potential\/momentum\/tendency\/trend\/situation\/conditions\/outward appearance\/sign\/gesture\/male genitals"],"pinyin":["shi4"],"word":"勢"},{"definition":["power\/force\/strength\/ability\/strenuously","surname Li"],"pinyin":["Li4","li4"],"word":"力"}],"containing_words":[],"sentences":[{"english":"We'll never compromise with the reactionary forces.","chinese":"我們決不向反動勢力妥協。"},{"english":"His efforts were defeated by the forces of reaction .","chinese":"他的努力被反動勢力挫敗。"},{"english":"Provides reactionary force to the accelerator.","chinese":"提供了反動勢力的加速器。"},{"english":"The insurgents are too weak to overthrow the newly emerging order.","chinese":"這些反動勢力還未強大到可以推翻新政府。"},{"english":"The reactionary forces and we both have difficulties.","chinese":"反動勢力面前和我們面前都有困難。"},{"english":"The forces of reaction made reform difficult.","chinese":"反動勢力給改革造成了困難。"},{"english":"We must face down the forces of reaction.","chinese":"反動勢力面前和我們面前都有困難。"},{"english":"The revolution was defeated by the forces of reaction.","chinese":"革命被反動勢力扼殺了。"},{"english":"The Government of the Qing Dynasty collaborated with foreign reactionary forces to crush down the peasant uprising of the Taiping Heavenly Kingdom.","chinese":"清朝政府勾結外國反動勢力鎮壓太平天國農民起義。"},{"english":"The parties of the leave have forme a common front to fight the force of reaction.","chinese":"政黨的左翼組成與反動勢力鬥爭的統一戰線。"},{"english":"Right now, the progressive and status quo-ist forces should unite to defeat the regressive force.","chinese":"現在進步和中間平衡力量應該聯合起來打敗反動勢力。"},{"english":"The force of reaction made change difficult.","chinese":"反動勢力使得改革舉步維艱。"}],"related":[]}