{"definition":["reflector"],"pinyin":["fan3 she4 jing4"],"simplified":["反射镜"],"rank":49562.0,"normalized_rank":0.6934366823835574,"fraction":1.510868438020998e-7,"cumulative_fraction":0.99889541152982,"word":"反射鏡","characters":[{"definition":["contrary\/in reverse\/inside out or upside down\/to reverse\/to return\/to oppose\/opposite\/against\/anti-\/to rebel\/to use analogy\/instead\/abbr. for 反切[fan3 qie4] phonetic system"],"pinyin":["fan3"],"word":"反"},{"definition":["to shoot\/to launch\/to allude to\/radio- (chemistry)"],"pinyin":["she4"],"word":"射"},{"definition":["mirror\/lens"],"pinyin":["jing4"],"word":"鏡"}],"containing_words":[],"sentences":[{"english":"This technique suits to schlieren system which schlieren mirrors arespherical especially.","chinese":"此技術特別適用於紋影鏡爲球面反射鏡的紋影系統。"},{"english":"A curved margin of a highway was reflectorized for safety.","chinese":"爲安全起見公路的彎道邊上裝設了反射鏡。"},{"english":"SiC is a good substrate material for laser mirrors with higher therma…","chinese":"碳化硅是較優秀的反射鏡材料。"},{"english":"Separate the reflector from the rear bumper .","chinese":"從保險桿分離反射鏡。"},{"english":"The United States imports focusing mirrors and metal mirrors, cutting and strong.","chinese":"採用美國進口聚焦鏡和金屬反射鏡，切割力強。"},{"english":"An all fiber wavelength tunable loop mirror is demonstrated.","chinese":"介紹了一種全光纖波長可調諧環路反射鏡。"},{"english":"The three mirrors are directly mounted on the Silicon Carbide plates using titanium bolts.","chinese":"三塊反射鏡使用鈦制螺栓直接安裝在碳化硅的端板上。"},{"english":"The fabrication process and application of silicon carbide mirror are presented.","chinese":"綜述了碳化硅反射鏡材料常用製備方法的特點。"},{"english":"Micro-mirror is a fundamental part of micro optics adaptive system.","chinese":"微反射鏡是微光學自適應系統中的基本組成部分。"},{"english":"Experimental results show that the system is feasible for changing the surface profiles of a membrane mirror.","chinese":"實驗結果表明，該系統可有效改變薄膜反射鏡的面形。"},{"english":"Research of the surface modification for two kinds of silicon carbide mirror in common use.","chinese":"兩種常用碳化硅反射鏡基底表面改性的研究。"},{"english":"The parabolic reflector of a searchlight gives a parallel beam.","chinese":"探照燈的拋物面反射鏡發出平行光束。"},{"english":"An omnidirectional reflector based on 1D photonic crystal of heterostructures is introduced.","chinese":"研究了異質結構一維光子晶體全向反射鏡的設計方法。"},{"english":"By rotating the two mirrors, we can tune the dye-laser wavelengths.","chinese":"轉動兩個全反射鏡能同時調諧兩個激光輸出波長。"},{"english":"Thus thin mirror ( very thick mirror ) can only be used in Dobsonian design.","chinese":"因此薄身的反射鏡只可以用於多布森裝置。"},{"english":"One end is a plane mirror, the other is a metal mesh.","chinese":"諧振腔一端爲平面反射鏡，一端爲金屬柵網。"}],"related":[]}