{"definition":["unstable\/erratic\/changeable\/fickle"],"pinyin":["fan3 fu4 wu2 chang2"],"simplified":["反复无常"],"rank":38022.0,"normalized_rank":0.5319771102374323,"fraction":4.633329876597728e-7,"cumulative_fraction":0.9956530812928353,"word":"反覆無常","characters":[{"definition":["contrary\/in reverse\/inside out or upside down\/to reverse\/to return\/to oppose\/opposite\/against\/anti-\/to rebel\/to use analogy\/instead\/abbr. for 反切[fan3 qie4] phonetic system"],"pinyin":["fan3"],"word":"反"},{"definition":["to cover\/to overflow\/to overturn\/to capsize","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4"],"word":"覆"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["always\/ever\/often\/frequently\/common\/general\/constant","surname Chang"],"pinyin":["Chang2","chang2"],"word":"常"}],"containing_words":[],"sentences":[{"english":"Is disease of department of gynaecology gotten capricious ?","chinese":"婦科病一得就反覆無常嘛？"},{"english":"Then talk not of inconstancy.","chinese":"不要去談那反覆無常。"},{"english":"Some clients feel like you exist solely to cater to their every whim.","chinese":"一些客戶認爲你應該完全迎合他們的反覆無常。"},{"english":"It is given to all sorts of caprices of wind and weather.","chinese":"經常遇到各種各樣反覆無常的風和天氣。"},{"english":"It's clear that some stocks are more volatile than others.","chinese":"很明顯有一些股票會比其他股票反覆無常。"},{"english":"Volatile law and order situation also dishearten foreign tourists.","chinese":"反覆無常的法律和社會秩序也使遊客同樣感到沮喪。"},{"english":"The ground is capricious like elephantine cat, the disposition of persist one's old ways.","chinese":"象貓一樣地反覆無常，我行我素的性格。"},{"english":"It is harder to negotiate safe passage with increasingly unpredictable armed groups.","chinese":"和愈加反覆無常的武裝組織商定安全通道越發困難。"},{"english":"During inspiration plunder or in the process of creation, play fast and loose is its form of expression.","chinese":"在靈感掠取或創作過程中，反覆無常是它的表現形式。"},{"english":"A hailstorm in July is a caprice of nature.","chinese":"七月天的一場冰雹是大自然的反覆無常的變化。"},{"english":"In the tumult of battle, robots wouldn't be affected by volatile emotions.","chinese":"身處混亂的戰場，機器人不會被反覆無常的情緒左右。"},{"english":"The Jade Emperor's rule is orderly and without caprice.","chinese":"玉帝的規則是井然有序，不會反覆無常的。"},{"english":"He was rather too indulgent in humouring her caprices.","chinese":"講到容忍她的反覆無常，他實在是太遷就了。"},{"english":"Many of these assets were funded by lenders in fickle wholesale markets.","chinese":"許多這些資產來自反覆無常的批發市場。"},{"english":"He was very changeable, often blowing hot and cold.","chinese":"他朝三暮四，老是反覆無常。"},{"english":"Hermia was looking at him and wondering at his strange inconstancy.","chinese":"赫米亞望着他，對他莫名其妙的反覆無常感到很驚奇。"}],"related":[{"definition":["see 臨陣退縮|临阵退缩[lin2 zhen4 tui4 suo1]"],"pinyin":["lin2 zhen4 tuo1 tao2"],"word":"臨陣脫逃"},{"definition":["fight to the death\/desperate struggle"],"pinyin":["si3 zhan4"],"word":"死戰"},{"definition":["to have a clear view of things\/to adapt to circumstances"],"pinyin":["shi2 shi2 wu4"],"word":"識時務"},{"definition":["shameful secret"],"pinyin":["yin1 si1"],"word":"陰私"},{"definition":["lit. chasing the wind and clutching at shadows (idiom); fig. groundless accusations\/to act on hearsay evidence"],"pinyin":["bu3 feng1 zhuo1 ying3"],"word":"捕風捉影"},{"definition":["to know how to count and do sums\/numerate\/numeracy"],"pinyin":["shi2 shu4"],"word":"識數"},{"definition":["harming others for one's personal benefit (idiom); personal gain to the detriment of others"],"pinyin":["sun3 ren2 li4 ji3"],"word":"損人利己"},{"definition":["it will cause no end of trouble (idiom)"],"pinyin":["hou4 huan4 wu2 qiong2"],"word":"後患無窮"},{"definition":["to act in collusion (idiom); in cahoots with\/villains will look after one another"],"pinyin":["hang4 xie4 yi1 qi4"],"word":"沆瀣一氣"},{"definition":["lit. to point at the mulberry tree and curse the locust tree\/fig. to scold sb indirectly\/to make oblique accusations (idiom)"],"pinyin":["zhi3 sang1 ma4 huai2"],"word":"指桑罵槐"},{"definition":["outward devotion but inner opposition (idiom); to pay lip service\/to agree overtly, but oppose in secret"],"pinyin":["yang2 feng4 yin1 wei2"],"word":"陽奉陰違"},{"definition":["extreme joy turns to sorrow (idiom); Don't celebrate too soon, things could still go wrong!"],"pinyin":["le4 ji2 sheng1 bei1"],"word":"樂極生悲"},{"definition":["to make an irrelevant comparison or interpretation (idiom)"],"pinyin":["qian1 qiang3 fu4 hui4"],"word":"牽強附會"},{"definition":["lit. to use a dog's tail as a substitute for sable fur (idiom)\/fig. a worthless sequel to a masterpiece"],"pinyin":["gou3 wei3 xu4 diao1"],"word":"狗尾續貂"},{"definition":["to feel hatred\/to harbor a grudge"],"pinyin":["huai2 hen4"],"word":"懷恨"},{"definition":["to plot and kill sb for his property (idiom); to murder for money"],"pinyin":["mou2 cai2 hai4 ming4"],"word":"謀財害命"}]}