{"definition":["to replace\/to supersede\/to supplant\/(chemistry) substitution"],"pinyin":["qu3 dai4"],"simplified":["取代"],"rank":4546.0,"normalized_rank":0.06360443803953941,"fraction":0.00002758816572300969,"cumulative_fraction":0.847255880812818,"word":"取代","characters":[{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"},{"definition":["to substitute\/to act on behalf of others\/to replace\/generation\/dynasty\/age\/period\/(historical) era\/(geological) eon"],"pinyin":["dai4"],"word":"代"}],"containing_words":[{"definition":["substituent (chemistry)"],"pinyin":["qu3 dai4 ji1"],"word":"取代基"}],"sentences":[{"english":"Short-lived Sui Dynasty, Tang Dynasty, will soon be replaced.","chinese":"隋朝短暫，很快被唐朝取代。"},{"english":"Mass armies (in most societies) have been replaced by highly trained professional-technical military forces.","chinese":"數量龐大的軍隊已經被高技術軍隊取代。"},{"english":"Is no substitute for showing off the core of her unique style.","chinese":"是否展露了無可取代的獨特風格纔是核心所在。"},{"english":"The influence of reaction conditions on the degree of substitution of acetylated starche was investigated.","chinese":"研究了反應條件對產品取代度和結構的影響。"},{"english":"I'm trying to displace him in his job.","chinese":"我在試圖取代他的工作。"},{"english":"But these new techniques can not be instead of the traditional way completely.","chinese":"但目前這些新技術尚不能完全取代熔模精密鑄造技術。"},{"english":"It's even been suggested that it could replace many dedicated point-and-shoot cameras.","chinese":"甚至還有人說，它可以取代許多專業的傻瓜相機。"},{"english":"In most fields, its use has been replaced by the ‘joule’.","chinese":"在大多數領域，這個單位已經被“焦耳”取代。"},{"english":"In this article the regularity of amino acid replacement among homologues insulins was explored.","chinese":"本文研究了同源胰島素間氨基酸取代的規律性。"},{"english":"You can also set permissions using octal numbers instead of symbols.","chinese":"您還可以使用八進制取代符號設置權限。"},{"english":"It is used to thicken sauces and stews in place of flour and fat.","chinese":"它常用來勾芡醬汁，及在燉菜中取代麪粉和脂肪。"},{"english":"Dunga had been in charge of his country since 2006, succeeding Carlos Alberto Parreira.","chinese":"鄧加在06年取代佩雷拉成爲國家隊主帥至今。"},{"english":"Side mirrors are replaced by external cameras, located above the rear fenders .","chinese":"一面鏡子取代外部攝像機，上方後方墊。"},{"english":"Some people think it quite possible for network classrooms to take the place of traditional classrooms.","chinese":"有些人認爲網絡教室很可能取代傳統的教室。"},{"english":"And Iwant you to choose me instead of him.","chinese":"我希望你選擇我，取代他。"},{"english":"Moderates have displaced the extremists on the committee.","chinese":"在委員會中，穩健派人士取代了激進派人士。"}],"related":[{"definition":["to substitute for\/to replace\/to supersede"],"pinyin":["ti4 dai4"],"word":"替代"},{"definition":["to replace\/to take the place of"],"pinyin":["dai4 ti4"],"word":"代替"},{"definition":["to exchange\/to replace\/to substitute for\/to switch"],"pinyin":["ti4 huan4"],"word":"替換"},{"definition":["to substitute for sb\/to remove and replace"],"pinyin":["qu3 er2 dai4 zhi1"],"word":"取而代之"},{"definition":["to exchange (sth) for (sth else)\/to replace with\/to convert into"],"pinyin":["huan4 cheng2"],"word":"換成"},{"definition":["to stop using\/to abandon\/abandoned\/deprecated"],"pinyin":["qi4 yong4"],"word":"棄用"},{"definition":["substitute\/alternative"],"pinyin":["ti4 dai4 pin3"],"word":"替代品"},{"definition":["to replace"],"pinyin":["ding3 ti4"],"word":"頂替"},{"definition":["to abandon\/to discard\/to renounce\/to dump (sb)"],"pinyin":["pao1 qi4"],"word":"拋棄"},{"definition":["new generation"],"pinyin":["xin1 yi1 dai4"],"word":"新一代"},{"definition":["originally\/original\/former"],"pinyin":["yuan2 xian1"],"word":"原先"},{"definition":["to change over to\/to switch to\/to use (sth different)"],"pinyin":["gai3 yong4"],"word":"改用"},{"definition":["now\/nowadays\/modern"],"pinyin":["xian4 jin1"],"word":"現今"},{"definition":["to become\/to turn into"],"pinyin":["cheng2 wei2"],"word":"成為"},{"definition":["leading\/dominant\/prevailing\/to lead\/to direct\/to dominate"],"pinyin":["zhu3 dao3"],"word":"主導"},{"definition":["certainty\/without a doubt"],"pinyin":["hao2 wu2 yi2 wen4"],"word":"毫無疑問"}]}