{"definition":["to score a victory\/to prevail over one's opponents"],"pinyin":["qu3 sheng4"],"simplified":["取胜"],"rank":4816.0,"normalized_rank":0.06738208834105186,"fraction":0.000025322884909366235,"cumulative_fraction":0.8544016878267228,"word":"取勝","characters":[{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"},{"definition":["victory\/success\/to beat\/to defeat\/to surpass\/victorious\/superior to\/to get the better of\/better than\/surpassing\/superb (of vista)\/beautiful (scenery)\/wonderful (view)\/(Taiwan pr. [sheng1]) able to bear\/equal to (a task)"],"pinyin":["sheng4"],"word":"勝"}],"containing_words":[{"definition":["favorite (to win a race or championship)\/well-placed contestant"],"pinyin":["ke3 wang4 qu3 sheng4 zhe3"],"word":"可望取勝者"},{"definition":["outsider (i.e. not expected to win a race or championship)"],"pinyin":["wu2 qu3 sheng4 xi1 wang4 zhe3"],"word":"無取勝希望者"}],"sentences":[{"english":"With the iron fist against the puma vocalist, failed to win.","chinese":"鐵彪用殘拳對付紫麟，卻未能取勝。"},{"english":"Every team has their own strategy to win.","chinese":"每支隊伍都有自己的取勝之道。"},{"english":"When a war is unwinnable, why fight?","chinese":"當一場戰爭不可取勝，爲何要去戰鬥？"},{"english":"A would-be defeated troops will engage his enemy first before looking for chances of victory.","chinese":"打敗戰的軍隊先同敵人交戰，而後希望僥倖取勝。"},{"english":"We have a chance because we are at home.","chinese":"下一輪我們主場作戰，是有機會取勝的。"},{"english":"We hoped that justice would prevail.","chinese":"我們希望正義會取勝。"},{"english":"Front-court depth and perimeter defense are the keys to the Lakers' victory.","chinese":"前場的深度和外線的防守將是湖人取勝的關鍵。"},{"english":"This delay facilitated the Spanish victory in the Battle of Bailen in July.","chinese":"這耽擱有助西班牙軍隊在七月的拜倫戰役中取勝。"},{"english":"I am sorry for friends of Catania but we have to absolutely win .","chinese":"我對卡塔尼亞的朋友們感到抱歉，因爲我們必須取勝。"},{"english":"His horse won by a nose.","chinese":"他的馬以一鼻之差取勝。"},{"english":"Mr. Trump won three crucial Midwestern states by very small margins.","chinese":"特朗普以非常小的優勢在中西部三個關鍵州取勝。"},{"english":"And then I will give you some doohickeys that succeed with your image.","chinese":"下面我給大家介紹一些以形象取勝的小竅門。"},{"english":"Skunked: Won a game of Invasion in the 1st phase.","chinese":"配對清單的入侵遊戲，在第一階段即取勝。"},{"english":"It will more effectively implement the strategy of diversifying market and expanding trade on the strength of quality and through science and technology.","chinese":"更好的實施市場多元化，以質取勝和科技興貿戰略。"},{"english":"High card is the lowest possible winning hand combination.","chinese":"憑高牌取勝是在所有贏手裏可能性最小的。"},{"english":"Only carry hand-built and automatically winding mechanical watch movement can win.","chinese":"只有攜帶手工打造並自動上鍊機械手錶機芯能取勝。"}],"related":[]}