{"definition":["to prevail\/to achieve victory\/to be victorious"],"pinyin":["qu3 de2 sheng4 li4"],"simplified":["取得胜利"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"取得勝利","characters":[{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["victory\/success\/to beat\/to defeat\/to surpass\/victorious\/superior to\/to get the better of\/better than\/surpassing\/superb (of vista)\/beautiful (scenery)\/wonderful (view)\/(Taiwan pr. [sheng1]) able to bear\/equal to (a task)"],"pinyin":["sheng4"],"word":"勝"},{"definition":["sharp\/favorable\/advantage\/benefit\/profit\/interest\/to do good to\/to benefit","surname Li"],"pinyin":["Li4","li4"],"word":"利"}],"containing_words":[],"sentences":[{"english":"Had Jesus not died on the cross, Christianity would not have triumphed.","chinese":"耶穌要是不死在十字架上，基督教就無法取得勝利。"},{"english":"Once Mao had achieved victory and eliminated his enemies, what was there left for him to do?","chinese":"當毛取得勝利消滅敵人後，他應該做什麼？"},{"english":"Victory in Libya comes first in time and importance.","chinese":"在利比亞取得勝利，在時間和重要性上應排在第一。"},{"english":"Keep up the struggle till you succeed.","chinese":"繼續戰鬥直到你們取得勝利。"},{"english":"He is with what he needs to win at life.","chinese":"他的一生中，有取得勝利所需要的能力。"},{"english":"The following year saw Cossack victory at Batoh.","chinese":"第二年，哥薩克在巴託格取得勝利。"},{"english":"Cafu hopes that this will motivate the team to win the game following the draw against Ascoli in the first matchday.","chinese":"卡福希望第一場比賽的平局將激發球隊取得勝利。"},{"english":"The Reds got back to winning ways with second-half strikes from Gerrard and Yossi Benayoun.","chinese":"利物浦下半場由傑拉德和貝納永的進球取得勝利。"},{"english":"China used tough defense to contain their opponents and win the game.","chinese":"中國女籃以嚴密的防守來抑制對手，並取得勝利。"},{"english":"To get the kind of success that you want, you need to dream big.","chinese":"要想取得勝利，你必需有一個弘遠的目的。"},{"english":"The Land Reform is widely conducted in the time of war and achieves success at last.","chinese":"土改在戰爭環境中得到普遍開展，並最終取得勝利。"},{"english":"We just have to make sure we win at Goodison in a couple of weeks.","chinese":"二週後，我們仍然有信心在古迪遜公園取得勝利。"},{"english":"They diplomatized in order to win victory.","chinese":"他們施展手腕，旨在取得勝利。"},{"english":"So for us to come out with this win, it's just really unexplainable .","chinese":"所以我們最終還能取得勝利，這真的無法解釋。"},{"english":"The soldiers exulted at their victory.","chinese":"戰士們爲取得勝利而歡躍。"},{"english":"M: We must win the negotiation with the foreign businessman.","chinese":"我們必須在這場與外商的談判中取得勝利。"}],"related":[]}