{"definition":["to find amusement\/to amuse oneself"],"pinyin":["qu3 le4"],"simplified":["取乐"],"rank":35639.0,"normalized_rank":0.4986358485022317,"fraction":5.734001183136695e-7,"cumulative_fraction":0.99442491225113,"word":"取樂","characters":[{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"},{"definition":["happy\/cheerful\/to laugh","music","surname Le","surname Yue"],"pinyin":["Le4","Yue4","le4","yue4"],"word":"樂"}],"containing_words":[],"sentences":[{"english":"Walking home by the alma mater is just for seeking fun.","chinese":"經過母校步行回家僅僅爲了取樂而已。"},{"english":"The funny runner put the sun-glasses on the gun for fun.","chinese":"滑稽的賽跑者將太陽鏡戴在槍上取樂。"},{"english":"How can you defend the killing of animals for pleasure?","chinese":"你怎麼能爲殺死動物取樂的行爲辯護呢？"},{"english":"For the last 4 months, my partner and I have been recreationally using heroin.","chinese":"上4個月，我的女友和我爲了取樂而吸食了海洛因。"},{"english":"But other students often felled him at the fence class for fun.","chinese":"但其他學生常常在擊劍課上把他砍倒來取樂。"},{"english":"Throw a ball at someone's head for fun in New York.","chinese":"在紐約，不可以把皮球扔到路人的腦袋上取樂。"},{"english":"The boys amused themselves by sliding down the banister.","chinese":"男孩們從樓梯扶手滑下以取樂。"},{"english":"One day， at a banquet in honor of distinguished guests， Cao bid Mi to work as a drummer， just to insult him for fun.","chinese":"第二天，曹操大宴賓客，讓禰衡擊鼓取樂。"},{"english":"People have been kicking objects around for fun since time immemorial.","chinese":"自古以來人們爲了取樂就將身邊的東西踢來踢去。"},{"english":"Harry delighted in pulling the dog's tail.","chinese":"哈瑞拉狗尾巴取樂。"},{"english":"Families come too, to have picnics or have fun together in other ways.","chinese":"也有全家來玩的，野餐，或以其他方式一起取樂。"},{"english":"It is most often used recreationally for this effect.","chinese":"正是因爲這些作用，它經常被用來取樂。"},{"english":"Some amuse themselves in folly.","chinese":"有些人以幹荒唐事取樂。"},{"english":"Local residents have learned to adapt and have fun despite the cold weather.","chinese":"儘管天氣寒冷，但當地居民已經學會適應並從中取樂。"},{"english":"Yesterday I went to the lake because it was very hot outside.","chinese":"昨天我取樂在湖因爲外很熱。"},{"english":"Yet for disport we fawn and flatter both.","chinese":"爲了取樂，我們奉承低頭。"}],"related":[]}