{"definition":["to substitute for sb\/to remove and replace"],"pinyin":["qu3 er2 dai4 zhi1"],"simplified":["取而代之"],"rank":12735.0,"normalized_rank":0.17817917255467103,"fraction":0.000005537953230261122,"cumulative_fraction":0.9482010769983164,"word":"取而代之","characters":[{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["to substitute\/to act on behalf of others\/to replace\/generation\/dynasty\/age\/period\/(historical) era\/(geological) eon"],"pinyin":["dai4"],"word":"代"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"}],"containing_words":[],"sentences":[{"english":"Instead, they watch pirated DVDs or surf the Web.","chinese":"取而代之，他們看盜版光碟或者在網上衝浪。"},{"english":"I thought it was my brother. But instead, it was two police officers.","chinese":"我原以爲會是我的哥哥，但取而代之地卻是兩個警察。"},{"english":"Replace sb. , sometimes you can use the four Zhang Tonghua filling.","chinese":"取而代之，有時你可以用這四張同花加註。"},{"english":"Since September a new book hewing closer to the old style has replaced it.","chinese":"九月，它就被一本遵守舊樣式的教材取而代之了。"},{"english":"Instead they use materials with lattice structures for both positive and negative electrodes.","chinese":"取而代之的是在正極和負極上使用柵格結構材料。"},{"english":"The pick withdraws, replaced by Andy's peering eye.","chinese":"石錘收回，取而代之的是安迪隱現的目光。"},{"english":"Instead, some means of triggering or simulating failures is required.","chinese":"取而代之的是，需要應用一些觸發和模擬失效的手段。"},{"english":"Instead, he asked the best blacksmiths of the Duchy to fashion him a new sword.","chinese":"取而代之，他命其領內最優秀的鐵匠鑄造一把新劍。"},{"english":"Blackboards surrender to the Black Forest.","chinese":"黑板不見了，取而代之的是蔥鬱的黑森林。"},{"english":"Unlimited multi-tasking without nasty looks from the instructor.","chinese":"取而代之的是無限多任務的平臺任君馳騁。"},{"english":"In its place is the sticky, gooey, sugar-laden, American treat.","chinese":"取而代之的是糯米，粘性，甜甜的美國美食。"},{"english":"The old cinema was torn down and replaced by a restaurant.","chinese":"老電影院被拆毀，取而代之的是一個飯店。"},{"english":"Instead, the rocket uses a pneumatic separation system, which can be tested on the ground.","chinese":"取而代之的是氣動分離系統，它的測試可在地面進行。"},{"english":"And fewer teens are wearing watches now because they use their phones to tell time instead (somewhere Chester Gould is wondering how he got it backwards).","chinese":"如今很少有年輕人佩帶手錶，他們用手機取而代之。"},{"english":"Eventually, when intelligence came on the scene, Lamarckian cultural evolution took over.","chinese":"最終，智力萌芽，拉馬克的文明進化取而代之。"},{"english":"The party leader has been supplanted by his rival.","chinese":"那位黨的領導人已被其對手取而代之。"}],"related":[{"definition":["to obliterate completely\/to vanish from the face of the earth"],"pinyin":["dang4 ran2 wu2 cun2"],"word":"蕩然無存"},{"definition":["to replace\/to supersede\/to supplant\/(chemistry) substitution"],"pinyin":["qu3 dai4"],"word":"取代"},{"definition":["to take off (one's clothes)\/(fig.) to shed (one's former image etc)\/(of a fad or the after-effects of a disaster etc) to subside\/also pr. [tun4 qu4]"],"pinyin":["tui4 qu4"],"word":"褪去"},{"definition":["to appear\/to come out in the open"],"pinyin":["xian3 lu4 chu1"],"word":"顯露出"},{"definition":["no longer\/no more"],"pinyin":["bu4 fu4"],"word":"不復"},{"definition":["to sweep clean\/to clean out"],"pinyin":["yi1 sao3 er2 kong1"],"word":"一掃而空"},{"definition":["former days\/the past"],"pinyin":["wang3 ri4"],"word":"往日"},{"definition":["to vanish like smoke in thin air\/to disappear"],"pinyin":["yan1 xiao1 yun2 san4"],"word":"煙消雲散"},{"definition":["to abandon\/to discard\/to spurn\/to forsake"],"pinyin":["bing4 qi4"],"word":"摒棄"},{"definition":["to change into"],"pinyin":["bian4 wei2"],"word":"變為"},{"definition":["to disappear\/to fade away"],"pinyin":["xiao1 shi1"],"word":"消失"},{"definition":["just like\/solemn\/dignified\/neatly laid out"],"pinyin":["yan3 ran2"],"word":"儼然"},{"definition":["to substitute for\/to replace\/to supersede"],"pinyin":["ti4 dai4"],"word":"替代"},{"definition":["to wane\/to vanish gradually"],"pinyin":["xiao1 tui4"],"word":"消退"},{"definition":["to disappear without trace (idiom)"],"pinyin":["wu2 ying3 wu2 zong1"],"word":"無影無蹤"},{"definition":["with astonishment\/with a shock\/awe-inspiringly\/impressively\/furiously (angry)"],"pinyin":["he4 ran2"],"word":"赫然"}]}