{"definition":["controlled (by sb)\/to suffer under a yoke"],"pinyin":["shou4 zhi4"],"simplified":["受制"],"rank":15080.0,"normalized_rank":0.2109887649881773,"fraction":0.000004110875950058872,"cumulative_fraction":0.9593632765272034,"word":"受制","characters":[{"definition":["to receive\/to accept\/to suffer\/subjected to\/to bear\/to stand\/pleasant\/(passive marker)"],"pinyin":["shou4"],"word":"受"},{"definition":["system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4"],"word":"制"}],"containing_words":[],"sentences":[{"english":"\"low-ability individuals suffer from illusory superiority\".","chinese":"“低能力者受制於其虛幻的優越感”。"},{"english":"And also the profession is very much at the mercy of the market place","chinese":"而且這個行業在很大程度上受制於市場因素。"},{"english":"They all signed \"mutual assistance\" pacts making them virtual protectorates of the Soviet Union.","chinese":"他們都簽署了使自己幾乎受制於蘇聯的“互惠條約”。"},{"english":"They are all grappling with the same issue.","chinese":"他們都要受制於同樣的問題。"},{"english":"They prefer to discipline themselves rather than to be disciplined by others.","chinese":"他們喜歡自律而不喜歡受制於人。"},{"english":"In other words, the total performance is tied to the performance of the slowest database partition.","chinese":"換言之，整體的性能受制於最慢的數據庫分區的性能。"},{"english":"Don’t give into pressure.","chinese":"不要施加壓力，不要受制於人。"},{"english":"They are bound by, they're subservient to, this metadivine realm.","chinese":"他們受制並服從於這個超神的領域。"},{"english":"Exposing yourself in Japan would apparently come under the ambit of a public indecency crime or a misdemeanor.","chinese":"在日本暴露自己顯然受制於公開猥褻罪的範圍或輕罪。"},{"english":"I am using the push-off in China, I feel a little controlled by others.","chinese":"我現在用的推客中國的，感覺有點受制於人。"},{"english":"They prefer to discipline themselves rather than be disciplined by others.","chinese":"他們寧願自律，而不願受制於人。"},{"english":"These snippets are not subject to any code management or life-cycle process.","chinese":"這些代碼片段不受制於任何代碼管理或生命週期流程。"},{"english":"Health care workers are subject to the same human foibles as the rest of the population.","chinese":"醫療工作者和其他人一樣受制於人性的弱點。"},{"english":"If you don't run your own life, somebody else will.","chinese":"如果你不主動管理自己的一生，那麼你將受制於人。"},{"english":"Whenever you have a hope, you're never really anybody's prisoner!","chinese":"只要你有夢想，你永遠不會受制於人。"},{"english":"Ah, I'm so disorganized, so browbeaten by what I remember.","chinese":"啊，我的思緒如此雜亂無章，如此受制於回憶與往事。"}],"related":[{"definition":["not good\/of no use"],"pinyin":["bu4 ji4"],"word":"不濟"},{"definition":["to try to rouse oneself but lack the strength (idiom)"],"pinyin":["yu4 zhen4 fa2 li4"],"word":"欲振乏力"},{"definition":["to be in straitened circumstances"],"pinyin":["zuo3 zhi1 you4 chu4"],"word":"左支右絀"},{"definition":["no room to advance or to retreat (idiom); at a loss\/in a hopeless situation"],"pinyin":["jin4 tui4 shi1 ju4"],"word":"進退失據"},{"definition":["lit. to refrain from shooting at the rat for fear of breaking the vases (idiom)\/to not act against an evil so as to prevent harm to innocents"],"pinyin":["tou2 shu3 ji4 qi4"],"word":"投鼠忌器"},{"definition":["to stand still without advancing (idiom); to hesitate and hold back"],"pinyin":["guo3 zu2 bu4 qian2"],"word":"裹足不前"},{"definition":["It's hard to clap with only one hand.\/It takes two to tango\/It's difficult to achieve anything without support."],"pinyin":["gu1 zhang3 nan2 ming2"],"word":"孤掌難鳴"},{"definition":["to make progress only with great difficulty (idiom)"],"pinyin":["ju3 bu4 wei2 jian1"],"word":"舉步維艱"},{"definition":["opponent\/substantial adversary\/worthy match\/antagonist\/in the enemy's hands"],"pinyin":["di2 shou3"],"word":"敵手"},{"definition":["to clog up\/silted up"],"pinyin":["zu3 zhi4"],"word":"阻滯"},{"definition":["to rush indiscriminately into action"],"pinyin":["wang4 dong4"],"word":"妄動"},{"definition":["to seize the opportunity\/to strike while the iron is hot"],"pinyin":["cheng2 shi4"],"word":"乘勢"},{"definition":["to struggle to cope (with a situation)\/to be at one's wits' end"],"pinyin":["qiong2 yu2 ying4 fu4"],"word":"窮於應付"},{"definition":["sealed ribbon fastening correspondence (in former times)"],"pinyin":["yin4 shou4"],"word":"印綬"},{"definition":["dangerous situation\/venerable old age"],"pinyin":["wei1 jing4"],"word":"危境"},{"definition":["to force\/to oblige"],"pinyin":["qiang2 shi3"],"word":"強使"}]}