{"definition":["(fig.) punching bag"],"pinyin":["shou4 qi4 bao1"],"simplified":["受气包"],"rank":53863.0,"normalized_rank":0.7536132525569096,"fraction":9.357165881849851e-8,"cumulative_fraction":0.9994139171994839,"word":"受氣包","characters":[{"definition":["to receive\/to accept\/to suffer\/subjected to\/to bear\/to stand\/pleasant\/(passive marker)"],"pinyin":["shou4"],"word":"受"},{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"},{"definition":["surname Bao","to cover\/to wrap\/to hold\/to include\/to take charge of\/to contract (to or for)\/package\/wrapper\/container\/bag\/to hold or embrace\/bundle\/packet\/CL:個|个[ge4],隻|只[zhi1]"],"pinyin":["Bao1","bao1"],"word":"包"}],"containing_words":[],"sentences":[{"english":"Third category called\" little wife\" middle, be a yes-man, like a doormat.","chinese":"第三類叫“小媳婦型”中層，唯唯諾諾，像個受氣包。"},{"english":"She's a doormat in the company, even the green hand can wrong her.","chinese":"她在公司就是個受氣包，甚至新手也可以欺負她。"},{"english":"Speak out what you want to say, don't just like a doormat!","chinese":"她天生就是一個受氣包，什麼都不敢反抗。"},{"english":"So in the units we not only became jack, also become a doormat.","chinese":"所以在單位我們不但成了千斤頂，還成了受氣包。"},{"english":"Even if their part was to have been a doormat.","chinese":"即使是他們的錯誤就在於一直在當受氣包。"},{"english":"You are plain doormat.","chinese":"你真是個受氣包。"},{"english":"Shes born doormat, afraid of going against anything.","chinese":"她天生就是個受氣包兒，什麼事都不敢說個不字。"},{"english":"Every time there was a fight in the playground, he seemed to end up as the punchbag.","chinese":"每次操場上有人打架，最終他就好像成了受氣包。"},{"english":"You are a real punching bag before her.","chinese":"在她面前，你是個十足的受氣包。"},{"english":"You are plain doormat. Why couldn't you say \"NO\"?","chinese":"你真是個受氣包兒。你怎麼就不能說個“不”字呢？"},{"english":"If I were her, I wouldn't be her husband's doormat like that.","chinese":"她天生就是個受氣包兒，什麼事都不敢說個不字。"},{"english":"He is the opposite of most people who are sniveling bags of selfishness.","chinese":"大多數人都是自私的受氣包，而他則恰恰相反。"},{"english":"She is plain doormat.","chinese":"她真是個受氣包。"}],"related":[]}