{"definition":["authorized\/entrusted (with authority)"],"pinyin":["shou4 quan2"],"simplified":["受权"],"rank":28269.0,"normalized_rank":0.3955199865683545,"fraction":0.0000010984816421360395,"cumulative_fraction":0.9884803424286186,"word":"受權","characters":[{"definition":["to receive\/to accept\/to suffer\/subjected to\/to bear\/to stand\/pleasant\/(passive marker)"],"pinyin":["shou4"],"word":"受"},{"definition":["authority\/power\/right\/(literary) to weigh\/expedient\/temporary","surname Quan"],"pinyin":["Quan2","quan2"],"word":"權"}],"containing_words":[],"sentences":[{"english":"And if so, by whom is it so empowered?","chinese":"假若有，是誰受權他們這樣做？"},{"english":"We haudio-videoe received Certifichproposas of Authorizine for the fabdominasricine and erection of pressure vessels.","chinese":"我們具有壓力容器製造和安裝的受權認可證書。"},{"english":"At the outset there is the tentative hint of the first-due company bullying his way through midtown traffic.","chinese":"一開始他們想通過中心事故來威嚇這家被受權公司。"},{"english":"We haudio-videoe received Certifichmarketing cwaspaign of Authorizine for the fabdominingricine and erection of pressure vessels.","chinese":"我們具有壓力容器建造和安裝的受權認可證書。"},{"english":"The agent is empowered to sell the property.","chinese":"代理人受權出售該財產。"},{"english":"Only authorized personnel can access these computer files.","chinese":"只有經過受權的人才可能訪問這些打算機文件。"},{"english":"We haudio-videoe received Certificgot of Authoriz for the fstomachric and erection of pressure vessels.","chinese":"我們具有壓力容器建造和安裝的受權認可證書。"},{"english":"In witness whereof, the undersigned Plenipotentiaries, duly authorized, have signed the present Treaty.","chinese":"下列正式受權的全權代表簽署本條約以資證明。"},{"english":"Britain was mandated to govern the former colony of German East Africa .","chinese":"英國受權代管德國在東非的前殖民地。"},{"english":"We haudio-videoe received Certificgot of Authoriz for the ftummyric and erection of pressure vessels.","chinese":"我們具有壓力容器製造和安裝的受權認可證書。"},{"english":"The offer I am empowered to make is bona fide.","chinese":"我受權開的價錢是誠實無欺的。"}],"related":[]}