{"definition":["to suffer enough from\/to suffer all kinds of\/to have one's fill of"],"pinyin":["shou4 jin4"],"simplified":["受尽"],"rank":26602.0,"normalized_rank":0.3721964937808683,"fraction":0.0000012799318323254212,"cumulative_fraction":0.9864984292968652,"word":"受盡","characters":[{"definition":["to receive\/to accept\/to suffer\/subjected to\/to bear\/to stand\/pleasant\/(passive marker)"],"pinyin":["shou4"],"word":"受"},{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely"],"pinyin":["jin4"],"word":"盡"}],"containing_words":[],"sentences":[{"english":"Because of the nature of impermanence within the clouds, the river suffered very much.","chinese":"雲彩那變化無常的本性，可讓小河受盡了苦頭。"},{"english":"In old society, he was miserable from cold and hunger.","chinese":"在舊社會，他受盡飢寒交迫之苦。"},{"english":"The people groaned under injustice .","chinese":"人民受盡了不公正的壓迫。"},{"english":"He was subjected to the rod in all its rigors in this school.","chinese":"他在這所學校裏受盡了笞杖體罰之苦。"},{"english":"It is hard to bear up under affliction.","chinese":"受盡折磨仍不屈不撓是很不容易的。"},{"english":"They suffered a lot under the invader's heel.","chinese":"在侵略者的鐵蹄下，他們受盡了奴役。"},{"english":"In spite of all kinds of torture, Sister Jiang gritted her teeth without saying a word.","chinese":"儘管受盡各種刑罰，江姐咬緊牙關不開口。"},{"english":"In sociological branch system, it always suffers all kinds of abasement as second-class citizen.","chinese":"在社會學科體系中，它總是作爲二等公民受盡屈辱。"},{"english":"His family suffered all kinds of hardships during the war.","chinese":"他家在戰爭期間受盡了苦難。"},{"english":"He remained unbending under the severest of tortures.","chinese":"他受盡酷刑，仍然堅貞不屈。"},{"english":"They inflicted all kinds of indignities on their captives.","chinese":"被俘的士兵在敵人手中受盡侮辱。"},{"english":"The people were ground down by lack of food and money.","chinese":"人們受盡了缺糧少錢的折磨。"},{"english":"Other civilians say they were stripped naked, abused and photographed.","chinese":"其他平民稱，他們被剝光衣服，受盡恥辱並被拍照。"},{"english":"I would rather suffer in your arms than die without you.","chinese":"我寧願在你的懷抱受盡折磨也不願離你故去。"},{"english":"Xiao Hong was full of setbacks and frustrations in her life, suffering from all kinds of tribulation. She died in Hong Kong for illness only at 31 years old.","chinese":"蕭紅一生命途多舛，受盡磨難，31歲就在香港病故。"}],"related":[]}