{"definition":["in ancient times\/in olden days"],"pinyin":["gu3 shi2 hou5"],"simplified":["古时候"],"rank":36926.0,"normalized_rank":0.5166426482727743,"fraction":5.10045828255591e-7,"cumulative_fraction":0.9951202080672013,"word":"古時候","characters":[{"definition":["ancient\/old\/paleo-","surname Gu"],"pinyin":["Gu3","gu3"],"word":"古"},{"definition":["o'clock\/time\/when\/hour\/season\/period","surname Shi"],"pinyin":["Shi2","shi2"],"word":"時"},{"definition":["to wait\/to inquire after\/to watch\/season\/climate\/(old) period of five days"],"pinyin":["hou4"],"word":"候"}],"containing_words":[],"sentences":[{"english":"In ancient times it was etiquette to present your full-size visiting card when giving someone a gift.","chinese":"古時候，送禮物時附上自己的名帖，是一種禮儀。"},{"english":"The current leaders are just like those from ancient times.","chinese":"現在的領導人就跟來自古時候一樣。"},{"english":"In ancient times, warriors fought on horses.","chinese":"在古時候，武士都騎在馬上作戰。"},{"english":"In ancient times the messages were relayed from one place to another.","chinese":"古時候信息是用接力的方式從一地傳送到另一地。"},{"english":"In ancient China, etiquette for funerals was set by the emperor.","chinese":"喪禮在中國古時候是由皇帝制定的。"},{"english":"People in ancient times spent a fortune on elixirs for fear of dying.","chinese":"古時候的人因爲怕死，因此花很多錢在長生不老藥。"},{"english":"In ancient times, the Great Wall fortified China against barbarian invasions.","chinese":"古時候，長城保衛着中國，使之免遭蠻夷的入侵。"},{"english":"In ancient times, people didn't cook on this day and only cold food was served.","chinese":"在古時候，這一天人們不事炊火，只能喫冷食。"},{"english":"In ancient times the rulers ran copper or silver into coins.","chinese":"古時候統治者把銅或銀鑄成錢幣。"},{"english":"In ancient times, there was an old man named Yu Gong. He was nearly 90 years old.","chinese":"古時候，有一老人，名字叫愚公，快九十歲了。"},{"english":"In ancient times there was a country magistrate who took bribes and practised graft.","chinese":"古時候有一個縣官，貪污受賄，謀取私利。"},{"english":"How can I imagine that it was the Holy Land for Incan people in the ancient time?","chinese":"叫我如何想象古時候這裏曾是印加人的聖地？"},{"english":"Of the wind instruments, the flutes made of bamboo have remained as simple in construction as they were in ancient China.","chinese":"在吹奏樂器中，竹笛的結構還是同古時候一樣簡單。"},{"english":"This was the ancient time when the lamb laid beside the lion and the little child led them.","chinese":"這就是古時候，小羊羔趴在獅子旁邊，小孩引導他們。"},{"english":"Zhang Heng is a man of ancient time.","chinese":"張衡是古時候的一個人。"},{"english":"In ancient times, Sichuan was called Shu Kingdom, and the transportation wasn’t good at that time.","chinese":"古時候，四川成爲蜀國，交通十分不便。"}],"related":[]}