{"definition":["without any better option\/to have to\/to be forced to"],"pinyin":["zhi3 hao3"],"simplified":["只好"],"rank":2967.0,"normalized_rank":0.041512179424398034,"fraction":0.00004844209156362474,"cumulative_fraction":0.7891306147447772,"word":"只好","characters":[{"definition":["only\/merely\/just\/but"],"pinyin":["zhi3"],"word":"只"},{"definition":["good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello","to be fond of\/to have a tendency to\/to be prone to"],"pinyin":["hao3","hao4"],"word":"好"}],"containing_words":[],"sentences":[{"english":"The weather became so bad that they had to turn back.","chinese":"天氣變得很壞，他們只好原路而歸了。"},{"english":"She get left her key in the office or get to toce the gate open.","chinese":"她把鑰匙忘在了辦公室，只好強行把門打開。"},{"english":"I have no idea what they are going to say, so I'll have to play it by ear.","chinese":"我一點不知道他們將會說什麼，所以我只好見機行事。"},{"english":"It was raining cats and dogs outside, so we had to stay at home.","chinese":"外面大雨滂沱，我們只好呆在家裏。"},{"english":"L2. Due to the destination is an inland city, we have to arrange sea-land intermodal transportation.","chinese":"由於目的地是內陸城市，我們只好安排海陸聯運。"},{"english":"Had to wear long pants, but still hold tight the shoulders.","chinese":"只好穿上長衣長褲，卻仍然抱緊雙肩。"},{"english":"The barrel was nearly empty and I had to climb right inside to get my apple.","chinese":"蘋果桶快空了，我只好鑽進去拿蘋果。"},{"english":"Yellow to porch suffer Hong Kong police, who had to go to taking home for help.","chinese":"黃以軒遭受香港警方通緝，只好前去去晏家求助。"},{"english":"Now I have to take a later flight.","chinese":"現在我只好坐晚一般的航班了。"},{"english":"We had to abandon the car and walk the rest of the way.","chinese":"我們只好棄車，步行趕剩下的路。"},{"english":"We had to stuff the ventilator shafts up to stop the smoke entering the room.","chinese":"爲了阻止煙進入室內，我們只好把通風道堵起來。"},{"english":"But the method used to adjust kerning to adjust.","chinese":"沒辦法，只好用調整字距的方法來調整。"},{"english":"I wanted his support, so I couldn’t laugh.","chinese":"我希望得到他的支持，只好憋住笑。"},{"english":"Youll have to make do with cold meat for dinner.","chinese":"晚餐你只好將就一下用冷肉了。"},{"english":"Because before Wang Lan owes the white dragon favor, she promised to come down.","chinese":"因爲之前汪蘭欠着白龍人情，她只好答應下來。"},{"english":"So we have to bypass.","chinese":"所以我們只好繞道而行。"}],"related":[{"definition":["to have no alternative but to\/to be obliged to"],"pinyin":["zhi3 de2"],"word":"只得"},{"definition":["you might as well (do it)\/simply\/just"],"pinyin":["suo3 xing4"],"word":"索性"},{"definition":["there is nothing to be done\/one can't do anything about it"],"pinyin":["mei2 ban4 fa3"],"word":"沒辦法"},{"definition":["to act against one's will\/to have no alternative but to\/to have to\/to have no choice\/must"],"pinyin":["bu4 de2 yi3"],"word":"不得已"},{"definition":["to drop (subject etc)"],"pinyin":["zuo4 ba4"],"word":"作罷"},{"definition":["thereupon\/as a result\/consequently\/thus\/hence"],"pinyin":["yu2 shi4"],"word":"於是"},{"definition":["to have no way out\/to have no alternative"],"pinyin":["wan4 ban1 wu2 nai4"],"word":"萬般無奈"},{"definition":["to brace oneself to do sth\/to put a bold face on it\/to summon up courage\/to force oneself to"],"pinyin":["ying4 zhe5 tou2 pi2"],"word":"硬著頭皮"},{"definition":["straightforward\/clear-cut\/blunt (e.g. statement)\/you might as well\/simply"],"pinyin":["gan1 cui4"],"word":"乾脆"},{"definition":["helpless\/without choice\/for lack of better option\/grudgingly\/willy-nilly\/nolens volens\/abbr. for 無可奈何|无可奈何[wu2 ke3 nai4 he2]"],"pinyin":["wu2 nai4"],"word":"無奈"},{"definition":["to have no alternative\/to be helpless"],"pinyin":["mo4 nai4 he2"],"word":"沒奈何"},{"definition":["can't persuade\/unable to make (sb) change their mind\/unable to resist (sb)"],"pinyin":["niu4 bu5 guo4"],"word":"拗不過"},{"definition":["to settle for second best\/the next best thing"],"pinyin":["tui4 er2 qiu2 qi2 ci4"],"word":"退而求其次"},{"definition":["have no choice or option but to\/cannot but\/have to\/can't help it\/can't avoid"],"pinyin":["bu4 de2 bu4"],"word":"不得不"},{"definition":["at a loss\/unable to do anything about it\/to have no choice"],"pinyin":["mei2 fa3"],"word":"沒法"},{"definition":["to suffer\/fig. reluctantly"],"pinyin":["ren3 tong4"],"word":"忍痛"}]}