{"definition":["to have no alternative but to\/to be obliged to"],"pinyin":["zhi3 de2"],"simplified":["只得"],"rank":6840.0,"normalized_rank":0.0957004743049823,"fraction":0.000015227656146102454,"cumulative_fraction":0.8941171556929791,"word":"只得","characters":[{"definition":["only\/merely\/just\/but"],"pinyin":["zhi3"],"word":"只"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[],"sentences":[{"english":"He had such bad flu that they had to take him to the hospital.","chinese":"他得了嚴得的流感，只得被子送進醫院了。"},{"english":"If yod don't have the right tool for the job, we'll have to make do without it.","chinese":"假如你沒有幹這活的適當工具，咱們只得對付着幹。"},{"english":"We had to eat some potatoes substituted as a meal.","chinese":"我們只得吃了幾個馬鈴薯充飢。"},{"english":"We had to push the car home as it broke down half way and we couldst know how to repair it.","chinese":"半路上車拋錨了，我們又無從修理，只得將其推回。"},{"english":"Eventualy we have to adjust to the environment where fruits are always with worms.","chinese":"最終我們只得適應水果總會有蟲子的環境。"},{"english":"Golgi to school, only to pick up trash money.","chinese":"高爾基爲了上學，只得去撿垃圾換錢。"},{"english":"They had to change the date fixed to Feb. 28th.","chinese":"他們只得把約期改到2月28日。"},{"english":"So Portia had to show the three boxes to him.","chinese":"因此波西亞只得把那三隻盒子拿給他看。"},{"english":"Tassels on the horns of a dilemma, back to the husbands family and no steps, had to find treasure complex complaint.","chinese":"流蘇進退兩難，回婆家又沒臺階，只得找寶絡訴苦。"},{"english":"I told him that because of the last condition, I'd have to turn it down.","chinese":"我告訴他，由於那最後一個條件，我只得謝盡。"},{"english":"You will just have to grovel to the bank manager for a loan .","chinese":"你只得低聲下氣地向銀行經理借貸。"},{"english":"The doctor had to abort the pregnancy.","chinese":"醫生只得給孕婦墮胎。"},{"english":"I take a deep inhale, depressed at the freshness.","chinese":"但我還得深吸一口清風，只得暫存清新的愛語。"},{"english":"I was surprised; I looked down, flushing, of course.","chinese":"我很驚訝，只得低下了頭，理所當然地臉紅了。"},{"english":"When the crash came, the family was forced to dispose of most of its possessions.","chinese":"家庭破落時，這家人只得變賣大部分家產。"},{"english":"The teacher spoke in a very stern voice and Timothy had to follow her to her room.","chinese":"老師說得很嚴厲，蒂莫西只得跟她進房間。"}],"related":[{"definition":["without any better option\/to have to\/to be forced to"],"pinyin":["zhi3 hao3"],"word":"只好"},{"definition":["to drop (subject etc)"],"pinyin":["zuo4 ba4"],"word":"作罷"},{"definition":["to act against one's will\/to have no alternative but to\/to have to\/to have no choice\/must"],"pinyin":["bu4 de2 yi3"],"word":"不得已"},{"definition":["helpless\/without choice\/for lack of better option\/grudgingly\/willy-nilly\/nolens volens\/abbr. for 無可奈何|无可奈何[wu2 ke3 nai4 he2]"],"pinyin":["wu2 nai4"],"word":"無奈"},{"definition":["have no way out\/have no alternative\/abbr. to 無奈|无奈[wu2 nai4]"],"pinyin":["wu2 ke3 nai4 he2"],"word":"無可奈何"},{"definition":["you might as well (do it)\/simply\/just"],"pinyin":["suo3 xing4"],"word":"索性"},{"definition":["to brace oneself to do sth\/to put a bold face on it\/to summon up courage\/to force oneself to"],"pinyin":["ying4 zhe5 tou2 pi2"],"word":"硬著頭皮"},{"definition":["can only\/obliged to do sth\/to have no other choice"],"pinyin":["zhi3 neng2"],"word":"只能"},{"definition":["to have no way out\/to have no alternative"],"pinyin":["wan4 ban1 wu2 nai4"],"word":"萬般無奈"},{"definition":["to be compelled\/to be forced"],"pinyin":["bei4 po4"],"word":"被迫"},{"definition":["no strategy left to try (idiom); at one's wit's end\/at the end of one's tether\/powerless"],"pinyin":["wu2 ji4 ke3 shi1"],"word":"無計可施"},{"definition":["have no choice or option but to\/cannot but\/have to\/can't help it\/can't avoid"],"pinyin":["bu4 de2 bu4"],"word":"不得不"},{"definition":["straightforward\/clear-cut\/blunt (e.g. statement)\/you might as well\/simply"],"pinyin":["gan1 cui4"],"word":"乾脆"},{"definition":["to do with difficulty\/to force sb to do sth\/reluctant\/barely enough"],"pinyin":["mian3 qiang3"],"word":"勉強"},{"definition":["to do something to sb\/to deal with\/to cope\/how?\/to no avail"],"pinyin":["nai4 he2"],"word":"奈何"},{"definition":["to settle for second best\/the next best thing"],"pinyin":["tui4 er2 qiu2 qi2 ci4"],"word":"退而求其次"}]}