{"definition":["to warn repeatedly\/to urge\/to exhort again and again"],"pinyin":["ding1 zhu3"],"simplified":["叮嘱"],"rank":12701.0,"normalized_rank":0.1777034684426287,"fraction":0.000005559265963782963,"cumulative_fraction":0.9480124731745228,"word":"叮囑","characters":[{"definition":["to sting or bite (of mosquito, bee etc)\/to say repeatedly\/to urge insistently\/to ask repeatedly\/to stick to a point\/(onom.) tinkling or jingling sound"],"pinyin":["ding1"],"word":"叮"},{"definition":["to enjoin\/to implore\/to urge"],"pinyin":["zhu3"],"word":"囑"}],"containing_words":[],"sentences":[{"english":"One day I was going to my auntie's home, mom told me to bring an umbrella in case it mined.","chinese":"一天我去姑姑家，媽媽叮囑我帶把傘以防下雨。"},{"english":"Lin Yuhui once told Cheng Bijian to beware of high gold.","chinese":"林語慧曾經叮囑高金榜提防程碧劍。"},{"english":"Our parents used to remind us to put our toys away when we were done with them.","chinese":"小時候，父母總是叮囑我們玩了玩具之後要收好。"},{"english":"Gerald helped his wife into the carriage and gave orders to the coachman to drive carefully.","chinese":"傑拉爾德把妻子扶進馬車，叮囑車伕小心駕駛。"},{"english":"Jean Valjean's injunction, and the name of Madame Thenardier, had chilled her blood.","chinese":"冉阿讓的叮囑和德納第這名字早已使她麻木了。"},{"english":"At the same time told I dare stone must be a good person, the destruction of all the bad.","chinese":"同時叮囑石敢當一定要好好做人，殺盡天下壞人。"},{"english":"The doctor told him to bathe his eyes with a very dilute solution of boric acid.","chinese":"醫生叮囑他用稀釋的硼酸溶液洗他的眼睛。"},{"english":"East plant told mother no application susceptibility show.","chinese":"東株叮囑母親不準應用敏秀。"},{"english":"He had been warned not to tell anyone about it.","chinese":"曾經叮囑他不要和任何人講這事。"},{"english":"I remembered having asked you to prepare two such dresses before our leaving, didn't I?","chinese":"我記得出國前叮囑過你準備兩套這樣的禮服。"},{"english":"God tells me not to faint.","chinese":"神叮囑我不要喪膽。"},{"english":"When the researcher briefly left the room, the children were told not to look.","chinese":"研究人員叮囑小孩不要向後面看，才離開房間。"},{"english":"Bobridge told Lin Lei to allow the company to maintain growth performance, more to deal with tianlong.","chinese":"駿升叮囑林磊讓公司維持業績增長，更加要對付天龍。"},{"english":"Immediately told stone I dare to survey murderesss whereabouts.","chinese":"當即叮囑石敢當好好調查女殺手的去向。"},{"english":"Then enjoining him to keep it strictly confidential, he told him the whole story.","chinese":"叮囑他嚴守祕密，然後把這事講出來。"},{"english":"The doctor ordered you to stay in bed.","chinese":"醫生叮囑你要臥牀休息。"}],"related":[{"definition":["to tell\/to exhort\/injunction"],"pinyin":["zhu3 fu4"],"word":"囑咐"},{"definition":["to warn\/to urge\/to exhort\/to give instructions carefully and insistently"],"pinyin":["ding1 ning2"],"word":"叮嚀"},{"definition":["to warn\/to admonish"],"pinyin":["gao4 jie4"],"word":"告誡"},{"definition":["to express thanks"],"pinyin":["dao4 xie4"],"word":"道謝"},{"definition":["to blame\/to rebuke"],"pinyin":["ze2 guai4"],"word":"責怪"},{"definition":["to take care of\/to raise money\/to attend to (guests, customers etc)"],"pinyin":["zhang1 luo5"],"word":"張羅"},{"definition":["to enquire solicitously about sb's well-being (idiom)\/to pamper"],"pinyin":["xu1 han2 wen4 nuan3"],"word":"噓寒問暖"},{"definition":["to involve\/to implicate sb\/to spread to others (harm, trouble, damage etc)"],"pinyin":["lian2 lei3"],"word":"連累"},{"definition":["to persuade\/persuasion\/to advise"],"pinyin":["quan4 shuo1"],"word":"勸說"},{"definition":["to answer\/to respond\/to answer positively\/to agree\/to accept\/to promise"],"pinyin":["da1 ying5"],"word":"答應"},{"definition":["to advise\/to urge\/to exhort\/exhortation\/advice\/CL:席[xi2]"],"pinyin":["quan4 gao4"],"word":"勸告"},{"definition":["to cherish\/to treasure\/to use sparingly"],"pinyin":["ai4 xi1"],"word":"愛惜"},{"definition":["residence\/dwelling\/dwelling place"],"pinyin":["zhu4 chu4"],"word":"住處"},{"definition":["to blame\/to criticize\/condemnation\/reproach"],"pinyin":["ze2 bei4"],"word":"責備"},{"definition":["from time to time\/now and then\/occasionally\/frequently"],"pinyin":["bu4 shi2"],"word":"不時"},{"definition":["to seize an opportunity\/to take advantage of situation"],"pinyin":["chen4 ji1"],"word":"趁機"}]}