{"definition":["compressible"],"pinyin":["ke3 ya1 suo1"],"simplified":["可压缩"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"可壓縮","characters":[{"definition":["can\/may\/able to\/to approve\/to permit\/to suit\/(particle used for emphasis) certainly\/very","see 可汗[ke4 han2]"],"pinyin":["ke3","ke4"],"word":"可"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"},{"definition":["to withdraw\/to pull back\/to contract\/to shrink\/to reduce\/abbreviation\/also pr. [su4]"],"pinyin":["suo1"],"word":"縮"}],"containing_words":[],"sentences":[{"english":"A study is made on Cauchy problem of compressible Eulers equations with relaxation term.","chinese":"研究具鬆弛項可壓縮的歐拉方程組柯西問題。"},{"english":"Definition and Implications of Compressibility. Special Solutions.","chinese":"可壓縮性的定義與含意，特解。"},{"english":"The turbulence of gas phase was modeled by the gradient simulation approach.","chinese":"採用梯度模擬來考慮氣相可壓縮性對氣相湍流的影響。"},{"english":"Filtration pressure should not be too high because of the high compressibility of the filtering cake.","chinese":"形成的濾餅具有高可壓縮性，因此過濾壓力不宜過高。"},{"english":"The corrected terms of the non-equilibrium force and the incompressibility deviation are considered in the formulation.","chinese":"列式中考慮了不平衡力和不可壓縮性偏差的修正項。"},{"english":"The structure of documents significantly affects their compressibility with standard compression algorithms.","chinese":"若採用標準壓縮算法，文檔結構明顯影響其可壓縮性。"},{"english":"A class of compressible flow Mach number limit.","chinese":"一類可壓縮流的馬赫數極限。"},{"english":"Saturated porous rock performance for compressible materials, follow Biot's law.","chinese":"飽和岩石表現爲可壓縮孔隙材料，遵循比奧定律。"},{"english":"The incompressibility of the fluid is determined by introduction of a so-called particle density number.","chinese":"流體的不可壓縮性是通過引人粒子數密度概念實現的。"},{"english":"This paper uses state vector method to solve the three-dimensional consolidation problems of a poroelastic layered rock by taking into account the compressibility of pore fluid.","chinese":"採用狀態空間法求解層狀可壓縮岩基的三維固結問題。"},{"english":"Besides, the authors find that fluid compressibility has little impact on the natural frequencies of structures in shallow water.","chinese":"而流體的可壓縮性對於淺水域結構固有頻率影響不大。"},{"english":"Consider a row of guide vanes in a compressible internal flow as shown below.","chinese":"如下圖所示，考慮可壓縮內部流中的一排導流葉片。"}],"related":[]}