{"definition":["all different\/each unto his own"],"pinyin":["ge4 yi4"],"simplified":["各异"],"rank":10517.0,"normalized_rank":0.1471464748926168,"fraction":0.000007624703406252441,"cumulative_fraction":0.9338045405293578,"word":"各異","characters":[{"definition":["each\/every"],"pinyin":["ge4"],"word":"各"},{"definition":["different\/other\/hetero-\/unusual\/strange\/surprising\/to distinguish\/to separate\/to discriminate"],"pinyin":["yi4"],"word":"異"}],"containing_words":[],"sentences":[{"english":"Reports of variation in the stool pattern with certain elements of the diet suggest dietary intolerance.","chinese":"大便形態各異伴未消化食物提示爲飲食不耐受。"},{"english":"Different types of jade differ in color.","chinese":"玉質的品種繁多，顏色各異。"},{"english":"Distribution and ratio of enterococcus species among different animals were different.","chinese":"不同動物消化道腸球菌種的分佈不同，比例各異。"},{"english":"There are many schools on modern business-cycle theory, which hold different views and ideas.","chinese":"現代經濟週期理論派別林立，觀點各異。"},{"english":"In Yerevan, reaction to Mr. Gul's visit is mixed.","chinese":"在埃裏溫，對居爾的訪問反應各異。"},{"english":"The Dong Fang Hotel during the trade fair housed a motley collection of people from every corner of the globe.","chinese":"廣交會期間東方賓館的客人來自全球各地，膚色各異。"},{"english":"There are light passages, narrow ones in all different depth, like underground tunnels in limestone.","chinese":"有寬有窄，形態各異，就像是石灰岩的地下隧道。"},{"english":"Junruo concubine Yang road dust, if the turbidity cement, floating and sinking of different potential, when harmonic meet?","chinese":"君若揚路塵，妾若濁水泥，浮沈各異勢，會合何時諧？"},{"english":"The arrival of spring flower season, calla different patterns.","chinese":"在春暖花的季節，馬蹄蓮形態各異。"},{"english":"The primary ossification centers of the vertebral body could found clearly with a variform.","chinese":"椎體中心的初級骨化中心，影像清楚，外形各異。"},{"english":"Microscopically recognizable constituents of coal that can be differentiated by their morphology.","chinese":"在顯微境下可識別的煤的組分，其形態各異。"},{"english":"The Qin and Han dynasties had different bordland governance achievements.","chinese":"秦漢王朝邊地治理的功績成效各異。"},{"english":"There are many kettle holes of different size and shape on riverbeds.","chinese":"河牀底部還保存有大小不等形態各異的壺穴。"},{"english":"Different patterns, Kellett see in the show.","chinese":"形態各異，奇中見秀。"},{"english":"Fonts come in all shapes and sizes and colours.","chinese":"字體形狀千差萬別，大小不一，顏色各異。"},{"english":"There are a lot of wonderful rocks in strange shapes.","chinese":"有許多形態各異的岩石。"}],"related":[]}