{"definition":["to put one's palms together (in prayer or greeting)"],"pinyin":["he2 shi2"],"simplified":["合十"],"rank":35635.0,"normalized_rank":0.4985798833125796,"fraction":5.735460959405314e-7,"cumulative_fraction":0.9944226183587016,"word":"合十","characters":[{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["ten\/10"],"pinyin":["shi2"],"word":"十"}],"containing_words":[],"sentences":[{"english":"The Hermit crossed his brow.","chinese":"隱士舉手合十在他的額頂。"},{"english":"Practice spinning poi in a corkscrew by keeping hands together.","chinese":"實踐中的螺旋狀旋轉的POI通過保持雙手合十。"},{"english":"Cross the figer! God bless me! Perhapes the present is the happiness.","chinese":"雙手合十，祝福一下，或許現在真得是很幸福的。"},{"english":"Press feet, sitz bones, crown. If flexibility allows, bring palms together at elbow level.","chinese":"雙腳下壓，身體自頭頂向上，雙手於肘水平方向合十。"},{"english":"For example, in Thailand, people greet each other using the wai.","chinese":"比如，在泰國，人們用合十禮來相互打招呼。"},{"english":"Fold the palms together in front of the chest and rest the thumbs against the breastbone in a prayer position.","chinese":"雙手合十到胸前，大拇指置於胸骨的位置，祈禱式。"},{"english":"Lie on your back with the soles of your feet together and your knees bent and dropping toward the floor.","chinese":"首先平躺，兩腳底合十，兩膝微曲放在地板上。"},{"english":"Namaste is a basic manner in Thailand.","chinese":"雙手合十是泰國最基本的禮節。"},{"english":"He folds his hands together, waiting for your extending hand.","chinese":"牠雙手合十，等待你伸出友善的手。"},{"english":"She has her palms together, as if praying.","chinese":"她雙手合十，像在祈禱。"},{"english":"They gaze on the darkness, they kneel, and they clasp their hands.","chinese":"他們注視着黑影，他們雙膝跪下，兩手合十。"},{"english":"Salu and Namaste, I AM Mohammed.","chinese":"祝福，合十，我是穆罕默德。"}],"related":[{"definition":["to clasp hands\/to put one's palms together (in prayer)"],"pinyin":["he2 zhang3"],"word":"合掌"},{"definition":["one of the many names of Buddha"],"pinyin":["fo2 hao4"],"word":"佛號"},{"definition":["Amitabha Buddha\/the Buddha of the Western paradise\/may the lord Buddha preserve us!\/merciful Buddha!"],"pinyin":["E1 mi2 tuo2 Fo2"],"word":"阿彌陀佛"},{"definition":["to bow with hands held in front"],"pinyin":["zuo4 yi1"],"word":"作揖"},{"definition":["to return a politeness\/to present a gift in return"],"pinyin":["huan2 li3"],"word":"還禮"},{"definition":["to sit in the lotus position"],"pinyin":["fu1 zuo4"],"word":"趺坐"},{"definition":["to bow down low\/to make obeisance\/to kneel and bow"],"pinyin":["xia4 bai4"],"word":"下拜"},{"definition":["benefactor (term used by a monk to address a layperson)\/donor (semiconductor)"],"pinyin":["shi1 zhu3"],"word":"施主"},{"definition":["to kowtow\/also written 磕頭|磕头[ke1 tou2]"],"pinyin":["kou4 shou3"],"word":"叩首"},{"definition":["(Buddhism) benefactor (designation of a lay person by a monk)"],"pinyin":["tan2 yue4"],"word":"檀越"},{"definition":["poor monk (humble term used by monk of himself)"],"pinyin":["pin2 seng1"],"word":"貧僧"},{"definition":["to read out\/to recite\/to remember sb (while talking about sth else)"],"pinyin":["nian4 song4"],"word":"念誦"},{"definition":["to greet by raising clasped hands"],"pinyin":["yi1"],"word":"揖"},{"definition":["to cup one fist in the other hand (as a sign of respect)"],"pinyin":["bao4 quan2"],"word":"抱拳"},{"definition":["silent prayer\/pray in silence"],"pinyin":["mo4 dao3"],"word":"默禱"},{"definition":["to bow deeply, starting upright with arms straight out in front, one hand cupped in the other, then moving the hands down to one's knees as one bows, keeping the arms straight (a form of greeting)"],"pinyin":["chang2 yi1"],"word":"長揖"}]}