{"definition":["to get along well\/compatible\/also written 和得來|和得来[he2 de5 lai2]"],"pinyin":["he2 de5 lai2"],"simplified":["合得来"],"rank":41111.0,"normalized_rank":0.5751962279462175,"fraction":3.450911099016076e-7,"cumulative_fraction":0.9968939289293716,"word":"合得來","characters":[{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"}],"containing_words":[],"sentences":[{"english":"Tom is an easygoing type of person who gets along well with everyone.","chinese":"湯姆是那種隨和的人，跟誰都合得來。"},{"english":"I'm compatible with my partner.","chinese":"我和我的搭檔很合得來。"},{"english":"His girlfriend is hunky-dory, getting on nicely with almost everyone.","chinese":"他的女朋友挺不錯的，跟誰都合得來。"},{"english":"I think you two are gonna like each other.","chinese":"我覺得你們倆會合得來的。"},{"english":"We hit it off right from the start.","chinese":"我們從一開始就合得來。"},{"english":"Most of all, I am looking for someone who is compatible and share similar values.","chinese":"最重要的是我們要合得來，有相似的價值觀。"},{"english":"I think we two really click。","chinese":"我覺得我們兩個蠻合得來的。"},{"english":"We've hit it off ever since we knew each other.","chinese":"我們從剛認識就很合得來。"},{"english":"I am compatible with my partner.","chinese":"我和我的搭檔很合得來。"},{"english":"Ex. Sue has so strong personality that few people can stand her.","chinese":"蘇的個性太強悍以至於很少有人能和她合得來。"},{"english":"Junko and I hit it off from the start.","chinese":"純子和我從一開始就合得來。"},{"english":"His girlfriend is hunky-dory, getting on nicely ost everyone.","chinese":"他的女朋友挺不錯的，跟誰都合得來。"}],"related":[]}