{"definition":["aikido (Japanese martial art)\/hapkido (Korean martial art)"],"pinyin":["he2 qi4 dao4"],"simplified":["合气道"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"合氣道","characters":[{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"}],"containing_words":[],"sentences":[{"english":"Began training in Aikido in 2002 .","chinese":"於2002年開始練習合氣道。"},{"english":"Dai Ashi is a great exercise in Aikido to learn how to defend against multiple attackers.","chinese":"阿戴是一個很好的鍛鍊學習合氣道如何抵禦多種攻擊。"},{"english":"In Aikido martial arts Shomen Uchi is an overhead strike defense.","chinese":"在合氣道武術Shomen宇智是國防開銷罷工。"},{"english":"Changing the line of attack an attacker is crucial in advanced Aikido.","chinese":"更改攻擊線攻擊者是至關重要的先進合氣道。"},{"english":"All those, you see, like, Aikido, Korean Karate, and on.","chinese":"所有這些，你明白，像合氣道，朝鮮的空手道等等。"}],"related":[]}