{"definition":["synthetic rubber"],"pinyin":["he2 cheng2 xiang4 jiao1"],"simplified":["合成橡胶"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"合成橡膠","characters":[{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["surname Cheng","to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth"],"pinyin":["Cheng2","cheng2"],"word":"成"},{"definition":["oak\/Quercus serrata"],"pinyin":["xiang4"],"word":"橡"},{"definition":["to glue\/glue\/gum\/rubber"],"pinyin":["jiao1"],"word":"膠"}],"containing_words":[],"sentences":[{"english":"Chemists discovered how to make synthetic rubber.","chinese":"化學家發現了製造合成橡膠的方法。"},{"english":"A top layer is coextensive with and secured to the first side of the synthetic rubber layer.","chinese":"頂層與合成橡膠層的第一側同延並固定到該第一側。"},{"english":"The invention relates to a synthetic rubber material injection machine and an injection device thereof.","chinese":"本發明是有關於合成橡膠材料注射機及其注射裝置。"},{"english":"PMS cau be used for making synthetic rubber last end of styrene.","chinese":"PMS可以代替苯乙烯用於合成橡膠工業。"},{"english":"The advance of technology in functionalized organolithium initiators and their application in synthetic rubber was reviewed with 23 references.","chinese":"有機單鋰引發劑的技術進展以及在合成橡膠中的應用。"},{"english":"Isoprene needs to be extremely pure to make synthetic rubber.","chinese":"而異戊二烯必須極其純淨才能生產出合成橡膠。"},{"english":"Synthetic rubber of equal quality still cannot be practicably manufactured.","chinese":"與天然橡膠同等質量的合成橡膠仍然不能實際生產。"},{"english":"Synthetic rubber is a copolymer of butadiene and styrene.","chinese":"合成橡膠是丁二烯和苯乙烯的共聚物。"},{"english":"It shall have a Butyl diaphragm separating the air chamber from the water containing chamber.","chinese":"應該採用丁基合成橡膠將氣腔與水腔隔離開來。"},{"english":"Features synthetic rubber uppers for comfort.","chinese":"舒適性爲特點的合成橡膠鞋面。"},{"english":"Disproportionated rosin is a modified form of \"rosin, widely employed for the production of synthetic rubbers.\"","chinese":"歧化松香是一種廣泛使用於合成橡膠生產的改性松香。"},{"english":"The preparation of synthetic rubber characterized by high green strength was introduced.","chinese":"本文介紹一種具有高生膠強度的合成橡膠的製備方法。"},{"english":"By 1964 synthetic rubber made up 75% of the market.","chinese":"到1964年的時候，合成橡膠佔美國市場的75%。"},{"english":"We chose the material [neoprene] before knowing what the design was going to be.","chinese":"在我們決定設計之前，就選擇了合成橡膠這種材料。"},{"english":"Seal cover over the heat exchanger airtight with butyl adhesive.","chinese":"用丁基合成橡膠粘合膠將罩蓋密封在熱交換器上。"},{"english":"All rubber elastomers shall be of chloramine resistant material.","chinese":"所有彈性合成橡膠應該是耐氯胺腐蝕材料。"}],"related":[]}