{"definition":["to converge\/to flow together\/fig. to act alike\/to evolve together"],"pinyin":["he2 liu2"],"simplified":["合流"],"rank":38710.0,"normalized_rank":0.5416031228575826,"fraction":4.338455070336624e-7,"cumulative_fraction":0.9959616114302244,"word":"合流","characters":[{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"}],"containing_words":[],"sentences":[{"english":"Politicians use the \"right\" making money, black and white confluence, Living and sharing interests.","chinese":"政治人物藉“權”撈錢，黑白合流，利益共生互享。"},{"english":"Pollution caused by combined sewer overflows (CSOs) in wet weather has gained much attention.","chinese":"合流系統雨天溢流污染問題在全世界受到廣泛關注。"},{"english":"Presents conception of the duct confluence number and system economics number.","chinese":"提出了風管合流數和系統經濟數的概念。"},{"english":"Chapter four discusses the confluence of the bureaucratic group and social forces in the United States.","chinese":"第四章討論官僚集團與社會勢力的合流。"},{"english":"It emerges from a confluence of factors, some very subtle.","chinese":"它浮現於多因子的合流，非常微妙的。"},{"english":"It was triggered by a confluence of flaky rumours.","chinese":"搶鹽恐慌由片狀謠言合流而引發。"},{"english":"Using drainage canals in combined system to treat sewage is a new technology.","chinese":"利用合流制排水溝渠處理污水是一項新技術。"},{"english":"Thirdly, the chapter fictions had a current of confluent north and south.","chinese":"其三，19世紀中後期，章回小說有南北合流的趨勢。"},{"english":"The characters of series process are suitable for the confluence desilication.","chinese":"串聯法的工藝特點，更宜於採用合流脫硅。"},{"english":"We had converged with Western Europe to the mixed economy.","chinese":"我們和西歐一起合流成爲混合經濟。"},{"english":"The Yongding and Daqing rivers meet near Tianjin.","chinese":"永定河和大清河在天津附近合流。"}],"related":[{"definition":["(of rivers etc) to converge\/convergence"],"pinyin":["hui4 liu2"],"word":"匯流"},{"definition":["two rivers\/Mesopotamia"],"pinyin":["liang3 he2"],"word":"兩河"},{"definition":["confluence\/to converge\/to join\/to fuse\/fusion"],"pinyin":["hui4 he2"],"word":"匯合"},{"definition":["attack from two sides\/pincer movement\/converging attack\/attack on a flank\/fork in chess, with one piece making two attacks"],"pinyin":["jia1 gong1"],"word":"夾攻"},{"definition":["Heishui county (Tibetan: khro chu rdzong) in Ngawa Tibetan and Qiang autonomous prefecture 阿壩藏族羌族自治州|阿坝藏族羌族自治州[A1 ba4 Zang4 zu2 Qiang1 zu2 zi4 zhi4 zhou1], northwest Sichuan"],"pinyin":["Hei1 shui3"],"word":"黑水"},{"definition":["against the stream\/adverse current\/a countercurrent\/fig. reactionary tendency\/to go against the trend"],"pinyin":["ni4 liu2"],"word":"逆流"},{"definition":["to oppose\/to set sth against\/to be antagonistic to\/antithetical\/relative opposite\/opposing\/diametrical"],"pinyin":["dui4 li4"],"word":"對立"},{"definition":["denomination\/group\/school\/faction\/school of thought"],"pinyin":["pai4 bie2"],"word":"派別"},{"definition":["to merge together (idiom); to unify disparate elements into one whole"],"pinyin":["he2 er2 wei2 yi1"],"word":"合而為一"},{"definition":["to flow into\/to converge (of river)\/(computing) to import (data)"],"pinyin":["hui4 ru4"],"word":"匯入"},{"definition":["to advance together"],"pinyin":["bing4 jin4"],"word":"並進"},{"definition":["to combine"],"pinyin":["he2 wei2"],"word":"合為"},{"definition":["undercurrent"],"pinyin":["an4 liu2"],"word":"暗流"},{"definition":["to annihilate\/to round up and wipe out"],"pinyin":["ju4 jian1"],"word":"聚殲"},{"definition":["pincer attack\/attack from two or more sides\/converging attack\/attack on a flank\/fork in chess, with one piece making two attacks"],"pinyin":["jia1 ji1"],"word":"夾擊"},{"definition":["to pursue and eliminate\/to suppress"],"pinyin":["zhui1 jiao3"],"word":"追剿"}]}