{"definition":["to suit one's taste\/suitable\/congenial\/by mutual agreement"],"pinyin":["he2 yi4"],"simplified":["合意"],"rank":37481.0,"normalized_rank":0.5244078183369943,"fraction":4.855215869427864e-7,"cumulative_fraction":0.9953962065065346,"word":"合意","characters":[{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["Italy\/Italian\/abbr. for 意大利[Yi4 da4 li4]","idea\/meaning\/thought\/to think\/wish\/desire\/intention\/to expect\/to anticipate"],"pinyin":["Yi4","yi4"],"word":"意"}],"containing_words":[],"sentences":[{"english":"The European Economic and Monetary Union (EMU) originated from the acceptability of sovereignties in the European Community(EC).","chinese":"歐洲經貨聯盟源起於歐共體各主權國家的合意。"},{"english":"These have one mind, and shall give their power and strength unto the beast.","chinese":"他們同心合意，將自己的能力權柄給那獸。"},{"english":"Because of your partnership in the gospel from the first day until now.","chinese":"因爲頭一天直到如今，你們是同心合意的興旺福音。"},{"english":"ThisMOU shall be amended by mutual agreement in writing and dulyexecuted by the Parties.","chinese":"備忘錄應由各方合意以書面形式作出修改並依約履行。"},{"english":"That they gathered themselves together, to fight with Joshua and with Israel, with one accord.","chinese":"就都聚集，同心合意地要與約書亞和以色列人爭戰。"},{"english":"they came together to make war against Joshua and Israel.","chinese":"就都聚集，同心合意地要與約書亞和以色列人爭戰。"},{"english":"In this article we compare English and Chinese from the point of hypotaxis and parataxis .","chinese":"本文從形合意合角度對英漢兩種語言進行了對比。"},{"english":"She has the required vulnerability, coyness and delicacy that befit her character Lucky.","chinese":"她所需要的脆弱性，羞怯與細緻的合意她的性格幸運。"},{"english":"What validates a marriage is the consent of the parties, not their cohabitation.","chinese":"合法的婚姻以雙方合意爲要件，而不因同居事實成立。"},{"english":"Jesus is looking for companions of compassion.","chinese":"主耶穌盼望的是同心合意的夥伴關係。"}],"related":[{"definition":["satisfactory\/agreeable"],"pinyin":["chen4 xin1"],"word":"稱心"},{"definition":["acting together\/to one's liking"],"pinyin":["he2 xin1"],"word":"合心"},{"definition":["key document\/important condition\/criterion\/requirement\/requisite\/cornerstone"],"pinyin":["yao4 jian4"],"word":"要件"},{"definition":["to agree on sth (after discussion)\/to conclude a bargain\/to arrange\/to promise\/to stipulate\/to make an appointment\/stipulated (time, amount, quality etc)\/an arrangement\/a deal\/appointment\/undertaking\/commitment\/understanding\/engagement\/stipulation"],"pinyin":["yue1 ding4"],"word":"約定"},{"definition":["debtor"],"pinyin":["zhai4 wu4 ren2"],"word":"債務人"},{"definition":["not to one's liking"],"pinyin":["bu4 zhong4 yi4"],"word":"不中意"},{"definition":["to counter accusations\/to protest\/to remonstrate\/to retort\/to plead\/to demur\/a plea (of not guilty)\/a defense (against an allegation)\/to enter a plea to a charge (in a law court)"],"pinyin":["kang4 bian4"],"word":"抗辯"},{"definition":["positioned between (two parties)\/to mediate between"],"pinyin":["ju1 jian1"],"word":"居間"},{"definition":["Sino-Italian","to take one's fancy\/to be to one's liking"],"pinyin":["Zhong1 Yi4","zhong4 yi4"],"word":"中意"},{"definition":["to conclude (treaty, contract, agreement etc)\/to set up (a rule etc)"],"pinyin":["ding4 li4"],"word":"訂立"},{"definition":["to consult with\/to talk things over\/agreement"],"pinyin":["xie2 shang1"],"word":"協商"},{"definition":["guarantor\/bailor"],"pinyin":["bao3 zheng4 ren2"],"word":"保證人"},{"definition":["fair\/equitable"],"pinyin":["gong1 ping2 he2 li3"],"word":"公平合理"},{"definition":["equal status\/equal treatment\/parity (under the law)\/equity\/reciprocity"],"pinyin":["dui4 deng3"],"word":"對等"},{"definition":["creditor"],"pinyin":["zhai4 quan2 ren2"],"word":"債權人"},{"definition":["to conclude a treaty"],"pinyin":["di4 yue1"],"word":"締約"}]}