{"definition":["synthetic fiber"],"pinyin":["he2 cheng2 xian1 wei2"],"simplified":["合成纤维"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"合成纖維","characters":[{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["surname Cheng","to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth"],"pinyin":["Cheng2","cheng2"],"word":"成"},{"definition":["fine\/delicate\/minute"],"pinyin":["xian1"],"word":"纖"},{"definition":["abbr. for Uighur 維吾爾|维吾尔[Wei2 wu2 er3]\/surname Wei","to preserve\/to maintain\/to hold together\/dimension\/vitamin (abbr. for 維生素|维生素[wei2 sheng1 su4])"],"pinyin":["Wei2","wei2"],"word":"維"}],"containing_words":[],"sentences":[{"english":"In many ways synthetic fibers are much better than natural fibers.","chinese":"在許多方面，合成纖維比天然纖維好得很多。"},{"english":"As you know, people in the Europe and America have been tired of wearing synthetic fabrics.","chinese":"正如你所知道的，歐美人對合成纖維織物已厭倦了。"},{"english":"This paper outlines the present situation of demand-supply and main trends of development for the World's synthetic fiber industry.","chinese":"概述世界合成纖維工業的供需現狀及發展主要趨勢。"},{"english":"The clothes he wears are made of synthetic fibre.","chinese":"他身上穿的那件衣服是合成纖維的。"},{"english":"This synthetic dress material does not crush.","chinese":"這種合成纖維衣料不會皺。"},{"english":"In this study, fiber modifier CM was prepared by a tertiary amine and epichlorohydrin.","chinese":"以叔胺和環氧氯丙烷爲原料合成纖維改性劑CM。"},{"english":"Spinning box is an important part of the melt spinning machine for synthetic fibre.","chinese":"紡絲箱體是合成纖維熔融紡絲機中的一個重要部件。"},{"english":"Nylon and dacron are the names of synthetic fibers.","chinese":"尼龍和達克龍都是合成纖維的名稱。"},{"english":"The research is mainly about the performance of synthetic fibres using in high temperature flue gas filtration.","chinese":"本課題主要研究高溫煙氣過濾除塵用合成纖維的性能。"},{"english":"Mainly used as polyester catalytic in the synthetic fiber industry.","chinese":"主要用於合成纖維工業作聚脂縮聚催化劑。"},{"english":"Nylon is technically described as \"synthetic fiber-forming polymeric amides .\"","chinese":"尼龍的技術性描述是“合成纖維的聚合氨基化合物”。"},{"english":"A single strand of untwisted synthetic fiber such as nylon used especially for fishing line .","chinese":"單絲一根未捻的合成纖維，如尼龍，尤指用於釣魚線。"},{"english":"Synthetic fabric is inferior to cotton fabric.","chinese":"這塊料子是人造棉的還是合成纖維的？"},{"english":"Polysulfonamide(PSA), a kind of high temperature resistant synthetical fibers, it is explored by national researchers.","chinese":"芳碸綸是我國自主開發的一種耐高溫合成纖維。"}],"related":[]}