{"definition":["(law) collegiate bench\/panel of judges"],"pinyin":["he2 yi4 ting2"],"simplified":["合议庭"],"rank":19348.0,"normalized_rank":0.2707036223469002,"fraction":0.0000025640970158298386,"cumulative_fraction":0.9732234224396108,"word":"合議庭","characters":[{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["to comment on\/to discuss\/to suggest"],"pinyin":["yi4"],"word":"議"},{"definition":["main hall\/front courtyard\/law court"],"pinyin":["ting2"],"word":"庭"}],"containing_words":[],"sentences":[{"english":"The members of a collegial panel shall be odd in number.","chinese":"合議庭的成員人數應當是單數。"},{"english":"The deliberations shall be recorded in writing, and the transcript shall be signed by the members of the collegial panel.","chinese":"評議應當製作筆錄，由合議庭成員簽名。"},{"english":"The people's court shall form a new collegial panel for the purpose of the retrial.","chinese":"人民法院審理再審案件，應當另行組成合議庭。"},{"english":"The penalization of cases should respect the opinions of the entire court.","chinese":"案件的判罰要尊重合議庭的意見。"},{"english":"The parties concerned in the case shall be notified the change of collegiate members.","chinese":"合議庭成員的更換情況應當及時通知訴訟當事人。"},{"english":"In civil cases of second instance in the people's court, justice is administered by a collegiate bench made up of judges.","chinese":"人民法院審理第二審民事案件，由審判員組成合議庭。"},{"english":"The number of members of a collegial panel shall be an odd number of three or more.","chinese":"合議庭的成員，應當是三人以上的單數。"},{"english":"The judge states collegiate bench closes this case adjudicates choose an auspicious day after discussing.","chinese":"法官表示合議庭合議後將擇日宣判此案。"},{"english":"The collegiate bench investigates to Zhang the relative, knew that Zhang the father spirit is not normal.","chinese":"合議庭又向張某親屬調查，得知張某之父精神不正常。"}],"related":[]}