{"definition":["Jilin Province (Kirin) in northeast China, abbr. 吉, capital Changchun 長春|长春[Chang2 chun1]"],"pinyin":["Ji2 lin2 Sheng3"],"simplified":["吉林省"],"rank":7342.0,"normalized_rank":0.10272410560631287,"fraction":0.00001368832207084338,"cumulative_fraction":0.9013724685535608,"word":"吉林省","characters":[{"definition":["lucky\/giga- (meaning billion or 10^9)","surname Ji\/abbr. for Jilin Province 吉林省[Ji2 lin2 Sheng3]"],"pinyin":["Ji2","ji2"],"word":"吉"},{"definition":["surname Lin\/Japanese surname Hayashi","woods\/forest\/CL:片[pian4]\/circle(s) (i.e. specific group of people)\/a collection (of similar things)"],"pinyin":["Lin2","lin2"],"word":"林"},{"definition":["to inspect\/to examine\/to be aware\/to pay a visit (to one's parents or elders)","to save\/to economize\/to do without\/to omit\/to leave out\/province\/(archaic) central government department"],"pinyin":["sheng3","xing3"],"word":"省"}],"containing_words":[],"sentences":[{"english":"Lastly certain countermeasures to the development of higher education service industry in Jilin Province are proposed.","chinese":"最後，對吉林省發展高教服務產業提出了對策建議。"},{"english":"Conclusion Ixodes persulcatus was confirmed as Lyme disease vector.","chinese":"結論全溝硬蜱是吉林省萊姆病的主要媒介。"},{"english":"Wen made an inspection tour in Jilin Province from July 25 to 27.","chinese":"從7月25日到27日，溫總理在吉林省做一個視察。"},{"english":"In this paper, the technology of extracting gold from refractory ores in a gold mine of Jinn province is introduced.","chinese":"本文介紹了吉林省某金礦難選冶礦石提金工藝結果。"},{"english":"The Fawer Fastener Subcompany is located in Jilin City, Jilin Province.","chinese":"富奧緊固件分公司位於吉林省吉林市。"},{"english":"Second part , Introduce the pilot situation of rural reform of taxation expenses of Jilin Province.","chinese":"第二部分，介紹吉林省農村稅費改革試點情況。"},{"english":"Liu was born in 1925 in Jilin Province, in China's northeast.","chinese":"劉於1925年出生於中國東北部的吉林省。"},{"english":"The Olympic Torch starts its relay in Jilin today, with its first leg in Changchun.","chinese":"奧運火炬今天開始在吉林省境內傳遞，首站爲長春市。"},{"english":"Apart from Beijing, his delegation will also visit Jilin Province.","chinese":"除北京外，代表團還將赴吉林省參觀訪問。"},{"english":"In 1997, this 49 -year-old myoeletrical Yanji City , Jilin Province people .","chinese":"1997年，今年49歲的金淑英是吉林省延吉市人。"},{"english":"Jiapigou gold belt lies in the southeast Huadian City, Jilin Province.","chinese":"夾皮溝金礦帶位於吉林省東南部樺甸地區。"},{"english":"This house in Dawan Village, Jilin Province is about to be invaded.","chinese":"位於吉林省大灣村的這間房子快要被擠滿了。"},{"english":"Jilin is also China's key commodity grain base.","chinese":"吉林省是中國主要的商品糧生產基地。"},{"english":"Suggestion of tax and fee reform in countryside of Jilin Province.","chinese":"吉林省農村稅費改革的對策建議。"},{"english":"The problem of poverty in Jinlin Province becomes more serious as economic development of the whole country.","chinese":"吉林省的貧困問題隨着整個國家的經濟發展而加劇。"},{"english":"Coca-Cola has removed the product from store shelves in Jilin province, where the incident took place.","chinese":"事件發生後，吉林省內這一產品已被全部撤架。"}],"related":[{"definition":["Heilongjiang Province (Heilungkiang) in northeast China, abbr. 黑, capital Harbin 哈爾濱|哈尔滨[Ha1 er3 bin1]"],"pinyin":["Hei1 long2 jiang1 Sheng3"],"word":"黑龍江省"},{"definition":["Liaoning province in northeast China, short name 遼|辽[Liao2], capital Shenyang 瀋陽|沈阳[Shen3 yang2]"],"pinyin":["Liao2 ning2 sheng3"],"word":"遼寧省"},{"definition":["Baishan prefecture-level city in Jilin province 吉林省 in northeast China"],"pinyin":["Bai2 shan1 shi4"],"word":"白山市"},{"definition":["Tonghua prefecture level city in Jilin province 吉林省 in northeast China"],"pinyin":["Tong1 hua4 shi4"],"word":"通化市"},{"definition":["Yanbian Korean autonomous prefecture 延邊朝鮮族自治州|延边朝鲜族自治州 in Jilin province 吉林省 in northeast China, capital Yanji city 延吉市"],"pinyin":["Yan2 bian1 zhou1"],"word":"延邊州"},{"definition":["Mudanjiang prefecture level city in Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Mu3 dan5 jiang1 shi4"],"word":"牡丹江市"},{"definition":["Changchun subprovincial city and capital of Jilin province 吉林省 in northeast China"],"pinyin":["Chang2 chun1 shi4"],"word":"長春市"},{"definition":["Songyuan prefecture level city in Jilin province 吉林省 in northeast China"],"pinyin":["Song1 yuan2 shi4"],"word":"松原市"},{"definition":["Siping prefecture level city in Jilin province 吉林省 in northeast China"],"pinyin":["Si4 ping2 shi4"],"word":"四平市"},{"definition":["Liaoyuan prefecture-level city in Jilin province 吉林省 in northeast China"],"pinyin":["Liao2 yuan2 shi4"],"word":"遼源市"},{"definition":["Jilin prefecture-level city in Jilin province 吉林省 in northeast China"],"pinyin":["Ji2 lin2 shi4"],"word":"吉林市"},{"definition":["Meihekou county level city in Tonghua 通化, Jilin"],"pinyin":["Mei2 he2 kou3 shi4"],"word":"梅河口市"},{"definition":["Gongzhuling county level city in Siping 四平, Jilin"],"pinyin":["Gong1 zhu3 ling3 shi4"],"word":"公主嶺市"},{"definition":["Baicheng prefecture-level city in Jilin province 吉林省 in northeast China"],"pinyin":["Bai2 cheng2 shi4"],"word":"白城市"},{"definition":["Qiqihar prefecture level city in Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Qi2 qi2 ha1 er3 shi4"],"word":"齊齊哈爾市"},{"definition":["Shenyang subprovincial city and capital of Liaoning province 遼寧省|辽宁省 in northeast China\/old names include Fengtian 奉天, Shengjing 盛京 and Mukden"],"pinyin":["Shen3 yang2 shi4"],"word":"瀋陽市"}]}