{"definition":["Gilbert (name)"],"pinyin":["Ji2 er3 bo2 te4"],"simplified":["吉尔伯特"],"rank":41491.0,"normalized_rank":0.5805129209631609,"fraction":3.334128997526531e-7,"cumulative_fraction":0.9970228762223712,"word":"吉爾伯特","characters":[{"definition":["lucky\/giga- (meaning billion or 10^9)","surname Ji\/abbr. for Jilin Province 吉林省[Ji2 lin2 Sheng3]"],"pinyin":["Ji2","ji2"],"word":"吉"},{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"},{"definition":["father's elder brother\/senior\/paternal elder uncle\/eldest of brothers\/respectful form of address\/Count, third of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]","one hundred (old)","variant of 霸[ba4]"],"pinyin":["ba4","bai3","bo2"],"word":"伯"},{"definition":["special\/unique\/distinguished\/especially\/unusual\/very\/abbr. for 特克斯[te4 ke4 si1], tex"],"pinyin":["te4"],"word":"特"}],"containing_words":[{"definition":["Gilbert Islands"],"pinyin":["Ji2 er3 bo2 te4 Qun2 dao3"],"word":"吉爾伯特群島"}],"sentences":[{"english":"And this brings us to a very famous contribution of Gilbert ryle.","chinese":"吉爾伯特的著名貢獻剛好說明了這一論點。"},{"english":"Have fun watching a humorous cameo by comedian Gilbert Gottfried.","chinese":"樂趣觀看喜劇演員吉爾伯特戈特弗裏德幽默客串。"},{"english":"A Mr. Gilbert phoned and left a message for you.","chinese":"一位姓吉爾伯特的先生給您打來電話並留了言。"},{"english":"Mr. Gilbert phoned and left a message for you.","chinese":"一位姓吉爾伯特的先生給您打來電話並留了言。"},{"english":"The American forces seized the Gilbert Island Atoll from the Japanese. (AP Photo)","chinese":"美軍從日本人手中奪取了吉爾伯特島的這處環礁。"},{"english":"Gilbert excoriated him for trying to play with perfection.","chinese":"吉爾伯特訓斥他總是追求完美。"},{"english":"The lieutenant appeared at the top of the gangplank , holding Gilbert in his arms.","chinese":"中尉來到了跳板上，挽着吉爾伯特的胳膊。"},{"english":"As we said goodnight, Gilbert took my hand.","chinese":"當我說晚安時，吉爾伯特抓住我的手。"},{"english":"The lieutenant appeared at the top of the gangplank, holding Gilbert in his arms.","chinese":"父親出現在跳板處，抓住吉爾伯特的手臂。"},{"english":"Sir Humphrey Gilbert led the first English settlement efforts.","chinese":"杭佛瑞？吉爾伯特領導第一批英國殖民者去了那裏。"},{"english":"This man was Gilbert Jensen, whom she remembered as the medic from the Philippines.","chinese":"這名男子詹森吉爾伯特人，她記住作爲苜來自菲律賓。"},{"english":"When Johnson oversaw construction projects in the camp, Gilbert tagged along.","chinese":"當約翰森在營地監督建築工程時，吉爾伯特緊隨其後。"},{"english":"Was he ashamed that he hadn't fulfilled his promise? And why hadn't I helped Dad find Gilbert before he died?","chinese":"是他沒有兌現承諾所以覺得愧對吉爾伯特？"},{"english":"Why did not you ask the Gilberts to come to us today?","chinese":"你怎麼今天不請吉爾伯特夫婦來？"},{"english":"I knew he had tried to adopt Gilbert and bring him home.","chinese":"我知道他曾試圖領養吉爾伯特並將他帶回家。"}],"related":[]}