{"definition":["to die in such a way that sb (or sth) else also perishes\/to take sb down with oneself\/to end in mutual destruction"],"pinyin":["tong2 gui1 yu2 jin4"],"simplified":["同归于尽"],"rank":38213.0,"normalized_rank":0.534649448043317,"fraction":4.554501958092284e-7,"cumulative_fraction":0.9957408131166908,"word":"同歸於盡","characters":[{"definition":["like\/same\/similar\/together\/alike\/with"],"pinyin":["tong2"],"word":"同"},{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"歸"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"},{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely"],"pinyin":["jin4"],"word":"盡"}],"containing_words":[],"sentences":[{"english":"We are moving to replace mutually assured destruction with mutual cooperation.","chinese":"我們正在採取行動，以共同合作代替同歸於盡。"},{"english":"This well where drank so many of the dead was destined to die itself.","chinese":"這口被許多死人喝過水的井也該同歸於盡。"},{"english":"Finally, in order to protect her Wolf sun, end up with golden eagles.","chinese":"最後，她爲了保護自己的狼孫，與金雕同歸於盡了。"},{"english":"Buha by the go, just want to die and come to a boar's.","chinese":"布哈依這次去，就是想和公豬來個同歸於盡的。"},{"english":"Third, they would attack their adversaries, smear them and threaten to drag them down with them.","chinese":"第三步則是反咬對手，抹黑大家，威脅一起同歸於盡。"},{"english":"Tarkin never returned, having died in the explosion that consumed the Death Star.","chinese":"塔金再也沒有回來，他和死星在爆炸中同歸於盡。"}],"related":[{"definition":["to bear grudges"],"pinyin":["ji4 hen4"],"word":"記恨"},{"definition":["to fight openly and maneuver covertly (idiom)"],"pinyin":["ming2 zheng1 an4 dou4"],"word":"明爭暗鬥"},{"definition":["to come to blows\/to paw\/to grope\/to get fresh"],"pinyin":["dong4 shou3 dong4 jiao3"],"word":"動手動腳"},{"definition":["to throw one's life in for\/to haplessly give one's life for\/to sacrifice oneself torturously working for another or for a group\/to pour in one's utmost effort\/to shed one's last ounce of strength for"],"pinyin":["mai4 ming4"],"word":"賣命"},{"definition":["dumbstruck and unable to reply (idiom); left speechless\/at a loss for words"],"pinyin":["ya3 kou3 wu2 yan2"],"word":"啞口無言"},{"definition":["to submit to humiliation (idiom); to suffer in silence\/to swallow one's anger\/to grin and bear it"],"pinyin":["ren3 qi4 tun1 sheng1"],"word":"忍氣吞聲"},{"definition":["the trick of injuring oneself to gain the enemy's confidence\/CL:條|条[tiao2]"],"pinyin":["ku3 rou4 ji4"],"word":"苦肉計"},{"definition":["lit. to point at the mulberry tree and curse the locust tree\/fig. to scold sb indirectly\/to make oblique accusations (idiom)"],"pinyin":["zhi3 sang1 ma4 huai2"],"word":"指桑罵槐"},{"definition":["idle gossip"],"pinyin":["xian2 yan2 xian2 yu3"],"word":"閒言閒語"},{"definition":["vocal accompaniment in some traditional Chinese operas\/to speak in support of\/to chime in"],"pinyin":["bang1 qiang1"],"word":"幫腔"},{"definition":["red in the face\/extremely angry"],"pinyin":["lian3 hong2 bo2 zi5 cu1"],"word":"臉紅脖子粗"},{"definition":["to plot and kill sb for his property (idiom); to murder for money"],"pinyin":["mou2 cai2 hai4 ming4"],"word":"謀財害命"},{"definition":["to view death as a return home\/to not be afraid of dying\/to face death with equanimity (idiom)"],"pinyin":["shi4 si3 ru2 gui1"],"word":"視死如歸"},{"definition":["lit. dumb as a wooden chicken (idiom); fig. dumbstruck"],"pinyin":["dai1 ruo4 mu4 ji1"],"word":"呆若木雞"},{"definition":["variant of 小題大做|小题大做[xiao3 ti2 da4 zuo4]"],"pinyin":["xiao3 ti2 da4 zuo4"],"word":"小題大作"},{"definition":["calm and composed (idiom)"],"pinyin":["qi4 ding4 shen2 xian2"],"word":"氣定神閒"}]}