{"definition":["congruent (math.)\/having same residue modulo some number"],"pinyin":["tong2 yu2"],"simplified":["同余"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"同餘","characters":[{"definition":["like\/same\/similar\/together\/alike\/with"],"pinyin":["tong2"],"word":"同"},{"definition":["extra\/surplus\/remaining\/remainder after division\/(following numerical value) or more\/in excess of (some number)\/residue (math.)\/after\/I\/me","surname Yu","variant of 餘|余[yu2], remainder"],"pinyin":["Yu2","yu2"],"word":"餘"}],"containing_words":[{"definition":["congruence (math.)\/equation for residue modulo some number"],"pinyin":["tong2 yu2 shi4"],"word":"同餘式"},{"definition":["congruence class (of integers modulo n)"],"pinyin":["tong2 yu2 lei4"],"word":"同餘類"}],"sentences":[{"english":"This paper has investigated the system of congruences and given them the asymptotic formula of the number of solutions.","chinese":"給出了一類同餘方程組解數的公式或漸近公式。"},{"english":"Especially, people pay much attention to those normal subgroup.","chinese":"這些子羣中，人們特別關注那些正規的同餘子羣。"},{"english":"We show that all fuzzy congruence relations on a semigroup is a lattice.","chinese":"證明了一個半羣上所有模糊同餘關係作成一個格。"},{"english":"The algorithm for encrypting images through sequences from linear congruence generator was described.","chinese":"描述了基於該線性同餘隨機序列的圖像加解密算法。"},{"english":"On this base, some properties of fuzzy good congruences on adequate semigroups are given.","chinese":"在此基礎上，給出了適當半羣上模糊好同餘的性質。"},{"english":"Then we study the idempotent-separating congruences on the orthogroups with group kernel normal systems and give it a simple rep.","chinese":"利用羣核正規系討論了純正羣的冪等元分離同餘。"},{"english":"This paper mainly deals with structures of some quasi-completely regular semiringsand congruence on them.","chinese":"本文主要研究某些擬完全正則半環的結構與同餘。"},{"english":"In this paper, we give some study of the homomorphisms of crytogroups and the idempotentseparating congruences on orthogroups.","chinese":"本文研究了密羣的同態和純正羣的冪等元分離同餘。"},{"english":"The linear congruent generators (LCG)arc widely applied to emulation and simulation.","chinese":"線性同餘發生器使用普遍。"},{"english":"The semiring congruence on a class of generalized regular semiring S was studied.","chinese":"研究了一類廣義正則半環S上的半環同餘。"},{"english":"The congruences on a regular semigroup is completely determined by its idempotent congruence classes.","chinese":"正則半羣上的同餘是由其冪等元同餘類所完全決定的。"},{"english":"Methods—The congruence triples are constructed and its properties analyzed.","chinese":"方法構造同餘三元組，並分析其性質。"},{"english":"It is well known that congruences on regular semigroups are good.","chinese":"衆所周知，正則半羣上的同餘都是好同餘。"},{"english":"It is well known that congruences on regular semigroups are good.","chinese":"衆所周知，正則半羣上的同餘都是好同餘。"}],"related":[]}