{"definition":["similar\/same type\/alike"],"pinyin":["tong2 lei4"],"simplified":["同类"],"rank":5341.0,"normalized_rank":0.07472751948288164,"fraction":0.0000218223414172171,"cumulative_fraction":0.8667571970859989,"word":"同類","characters":[{"definition":["like\/same\/similar\/together\/alike\/with"],"pinyin":["tong2"],"word":"同"},{"definition":["kind\/type\/class\/category\/similar\/like\/to resemble"],"pinyin":["lei4"],"word":"類"}],"containing_words":[{"definition":["Like attracts like."],"pinyin":["tong2 lei4 xiang1 xi1"],"word":"同類相吸"},{"definition":["cannibalism"],"pinyin":["tong2 lei4 xiang1 shi2"],"word":"同類相食"}],"sentences":[{"english":"The quality of the diesel engine oil is equivalent to that of the foreign products.","chinese":"柴油機油的質量達到了國際同類產品的水平。"},{"english":"Is in the profession or other similar organization's average human resource flow level.","chinese":"就是所在行業或其他同類組織的平均人才流動水平。"},{"english":"A little bit of commercialism can help kids make connections with their peers.","chinese":"一點點的商業主義能幫助孩子們與同類人間建立聯繫。"},{"english":"Has the patient ever had the same or similar symptoms(s) before?","chinese":"就診者以前曾否患有同類或類似病徵？"},{"english":"Birds resort unto their like: so truth will return to them that practise her.","chinese":"鳥獸與同類相聚，真理也必歸於實行真理的人。"},{"english":"Patients retaining mandible or with skin flap repair had higher quality of life than the others.","chinese":"行下頜骨保留或皮瓣修復患者較同類病例生存質量高。"},{"english":"Your two of a kind, neither of you care about detail nor domestics.","chinese":"你們是兩個同類，都對家事和細節滿不在乎。"},{"english":"O-side focus is also related to the high southerly built during the ancient stove with similar Longyao.","chinese":"鄰側的高竈也是與南風古竈同年代建成的同類龍窯。"},{"english":"Being first in a new category is the key to success.","chinese":"成爲同類產品中的第一個是成功的關鍵。"},{"english":"As a rule competition reduces the difference in the prices on the same products to a minimum.","chinese":"一般來說，同類產品的競爭可將價格差異降至最低。"},{"english":"It is the first one of its kind that has worked so clearly.","chinese":"這也是同類試驗中第一個效果如此明顯的試驗。"},{"english":"The performance of the polarizer has reached an advanced level in the world.","chinese":"圓極化器性能達到國際同類產品的先進水平。"},{"english":"Comparing it with other works of the same genre in the history, people can find its characteristics of inheritance and improvement.","chinese":"縱觀歷史上同類題材，自能發現它的繼承和超越之處。"},{"english":"More flexible than the same products abroad with best flexibility.","chinese":"柔軟性能優秀，柔軟度比國外同類產品好得多。"},{"english":"To be similar in grade equivalent brand of rather the brand next to the counters.","chinese":"須在檔次相等的同類品牌或皮具品牌旁設櫃。"},{"english":"Emerald starlings are fairly small when compared with other such birds.","chinese":"與同類的其他鳥相比，翠輝椋鳥要小很多。"}],"related":[{"definition":["similar\/analogous"],"pinyin":["lei4 si4"],"word":"類似"},{"definition":["kind\/type\/class\/category\/similar\/like\/to resemble"],"pinyin":["lei4"],"word":"類"},{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有關"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["same\/equal\/equivalent"],"pinyin":["tong2 yang4"],"word":"同樣"},{"definition":["all categories"],"pinyin":["ge4 lei4"],"word":"各類"},{"definition":["type\/category\/genre\/form\/style"],"pinyin":["lei4 xing2"],"word":"類型"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"},{"definition":["should\/ought to\/probably\/must be\/to deserve\/to owe\/to be sb's turn to do sth\/that\/the above-mentioned"],"pinyin":["gai1"],"word":"該"},{"definition":["a case\/an individual case\/case-by-case"],"pinyin":["ge4 an4"],"word":"個案"},{"definition":["single\/only\/sole"],"pinyin":["dan1 yi1"],"word":"單一"},{"definition":["this\/this kind of\/this sort of\/this type of"],"pinyin":["zhe4 zhong3"],"word":"這種"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"}]}