{"definition":["famous painter"],"pinyin":["ming2 hua4 jia1"],"simplified":["名画家"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"名畫家","characters":[{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"},{"definition":["to draw\/picture\/painting\/CL:幅[fu2],張|张[zhang1]\/classifier for paintings etc\/variant of 劃|划[hua4]"],"pinyin":["hua4"],"word":"畫"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[],"sentences":[{"english":"The old lady has practised a lot at drawing and she is now a famous painter.","chinese":"這位老婦人刻苦練習繪畫，她現在是一名著名畫家了。"},{"english":"The valuable painting by a famous artist has been stayed up on the wall for many years.","chinese":"一位著名畫家的珍貴油畫已在牆上掛了許多年。"},{"english":"She had sat for famous painters like Rossetti.","chinese":"她爲羅塞蒂等著名畫家當過模特。"},{"english":"The picture was painted by a famous artist.","chinese":"這幅畫是由一著名畫家畫的。"},{"english":"Rembrandt is a deservedly famous artist .","chinese":"倫勃朗是個當之無愧的名畫家。"},{"english":"Helen: So, Gill gave us a run-down of the famous artists and their work on display here.","chinese":"很多各個歷史時期著名畫家的經典作品都收藏在這裏。"},{"english":"Amy drew the most beautiful pictures and wanted to be a fa mous painter one day.","chinese":"艾米會畫最漂亮的畫，她希望有一天能成爲名畫家。"},{"english":"Is a famous painter of the 20th century, and calligraphy and seal.","chinese":"是我國20世紀著名畫家和書法篆刻家。"},{"english":"Additionally, a vide variety of modern rugs are replicated from famous artist's paintings.","chinese":"此外，當天的地毯模仿各種現代著名畫家的畫作。"},{"english":"Raphael was a famous painter.","chinese":"拉斐爾是名畫家。"}],"related":[]}