{"definition":["to express\/to describe"],"pinyin":["ming2 zhuang4"],"simplified":["名状"],"rank":37059.0,"normalized_rank":0.5185034908287045,"fraction":5.036228126736659e-7,"cumulative_fraction":0.9951876418480192,"word":"名狀","characters":[{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"},{"definition":["accusation\/suit\/state\/condition\/strong\/great\/-shaped"],"pinyin":["zhuang4"],"word":"狀"}],"containing_words":[{"definition":["indescribable\/beyond description"],"pinyin":["bu4 ke3 ming2 zhuang4"],"word":"不可名狀"},{"definition":["indescribable (joy)\/inexpressible (pleasure)"],"pinyin":["mo4 ke3 ming2 zhuang4"],"word":"莫可名狀"}],"sentences":[{"english":"The view is of the nondescript building across the street.","chinese":"風景就是對面街那不可名狀的建築物。"},{"english":"Nothing can describe the peace that surrounded the country parsonage.","chinese":"鄉村的牧師住宅，四周靜謐得難以名狀。"},{"english":"Until now I have talked about the relation of dreams with the inexpressible .","chinese":"我目前已談到夢與莫可名狀的體驗的關係。"},{"english":"It is a kind of indescribable feeling of numerous cross.","chinese":"那是一種無可名狀的紛繁交叉的心情。"},{"english":"Then you have the intangible elements, which can also be quite personal.","chinese":"但是你也有一些十分私人的，無可名狀的情緒。"},{"english":"He was troubled by nameless fears.","chinese":"難以名狀的恐懼困擾着他。"},{"english":"That which cannot be given name and form, for it is without quality and beyond consciousness.","chinese":"餘下者不可名狀，因它沒有屬性且超越意識。"},{"english":"Stanley felt a nameless anxiety rising in him .","chinese":"史坦利覺得心頭湧起一股不可名狀的憂慮。"},{"english":"This is the soda green charm, indescribable, but real.","chinese":"這就是蘇打綠的魅力，無可名狀，但實實在在。"},{"english":"Concept or faith? It's difficult to name.","chinese":"觀念？信仰？難以名狀。"},{"english":"There is some indefinable want in their make-up.","chinese":"他們的本性中有某種無法名狀的需要。"},{"english":"I was seized by a nameless horror.","chinese":"我爲不可名狀的恐慌所控制。"},{"english":"They walked northward with a curious feeling of disappointment.","chinese":"他們向北行，心頭彷彿襲來一縷不可名狀的落寞之感。"},{"english":"She had an indescribably magnetic attraction to her father's world.","chinese":"父親的那個世界對她產生了一種難以名狀的磁力。"},{"english":"Everytime I look deep into your eyes, I suffer a feeling of unspeakable melancholy.","chinese":"每次凝視你的眼眸，一種難以名狀的憂鬱便攫住了我。"}],"related":[]}