{"definition":["Houyi, mythological Chinese archer whose wife was Chang'e"],"pinyin":["Hou4 Yi4"],"simplified":["后羿"],"rank":37871.0,"normalized_rank":0.5298644243280679,"fraction":4.700479584954216e-7,"cumulative_fraction":0.9955826294245812,"word":"后羿","characters":[{"definition":["empress\/queen\/(archaic) monarch\/ruler","surname Hou"],"pinyin":["Hou4","hou4"],"word":"后"},{"definition":["surname Yi\/name of legendary archer\/also written 后羿[Hou4 Yi4]"],"pinyin":["Yi4"],"word":"羿"}],"containing_words":[],"sentences":[{"english":"Houyi doesn t belong to western Yi, but eastern Yi.","chinese":"后羿屬於東夷，而非西夷。"},{"english":"Houyi some magic pills that could make him live forever.","chinese":"他給了后羿一些能使他長生不老的仙丹。"},{"english":"Houyi was the chief of the western tribe of Xia dynasty.","chinese":"后羿是生活於夏王朝西方的原始部族首領。"},{"english":"Houyi i was told what was happening in the evening when he returned home from bumper hunting.","chinese":"傍晚，后羿回到家，侍女們哭訴了白天發生的事。"},{"english":"Chang'e was the wife of Houyi in ancient Chinese myths.","chinese":"嫦娥是中國古代神話傳說中后羿的妻子。"},{"english":"Evening, Hou Yi got the home, the maidservants to complain tearfully the matter which the daytime occurred.","chinese":"傍晚，后羿回到家，侍女們哭訴了白天發生的事。"},{"english":"Jade Rabbit turns herself into Chang - e. to help the latter get Jiu - ge off her tracks.","chinese":"嫦娥在洛嬪的幫助下，終見到重傷的后羿。"},{"english":"He was so busy with his duties he became neglectful of his lovely and lonely wife.","chinese":"因忙於公務，后羿忽略了他可愛而寂寞的妻子。"},{"english":"Chang'e and her husband Houyi were immortals who lived in Heaven.","chinese":"嫦娥和她的丈夫后羿長生不老的生活在天上。"},{"english":"It's pity that he paid no attention to her advice.","chinese":"很遺憾的是后羿沒有聽從王母娘娘的建議。"},{"english":"Knowing that Hou Yi came from heaven, the people of the clans proclaimed him to be their leader.","chinese":"得知后羿是玉帝所派，部落的人民推他做首領。"},{"english":"Evening, Hou Yi returned home, the maid who had cried during the day what happened.","chinese":"傍晚，后羿回到家，侍女們哭訴了白天發生的事。"},{"english":"Someone fishes in troubled water, empress Yi bow the Lue arrived air.","chinese":"有人混水摸魚，將后羿弓掠到了空中。"},{"english":"When Ho busy firing, stealing Goose herself.","chinese":"后羿忙射日，嫦娥偷奔月。"},{"english":"Houyi shot down nine of the suns.","chinese":"后羿射下了其中的九個太陽。"},{"english":"Houyi to live forever, because he was a cruel man.","chinese":"她不想后羿長生不老，因爲他是個殘暴的人。"}],"related":[{"definition":["Nüwa (creator of humans in Chinese mythology)"],"pinyin":["Nu:3 wa1"],"word":"女媧"},{"definition":["Daji (c. 11th century BC), concubine of the last Shang dynasty king Zhou Xin 紂辛|纣辛[Zhou4 Xin1]"],"pinyin":["Da2 ji3"],"word":"妲己"},{"definition":["Diaochan (-192), one of the four legendary beauties 四大美女[si4 da4 mei3 nu:3], in fiction a famous beauty at the break-up of Han dynasty, given as concubine to usurping warlord Dong Zhuo 董卓[Dong3 Zhuo2] to ensure his overthrow by fighting hero Lü Bu 呂布|吕布[Lu:3 Bu4]"],"pinyin":["Diao1 Chan2"],"word":"貂蟬"},{"definition":["Ying Zheng (260-210 BC), personal name of the first emperor 秦始皇[Qin2 Shi3 huang2]"],"pinyin":["Ying2 Zheng4"],"word":"嬴政"},{"definition":["Athena"],"pinyin":["Ya3 dian3 na4"],"word":"雅典娜"},{"definition":["Lu Ban, legendary master craftsman, called the father of Chinese carpentry"],"pinyin":["Lu3 Ban1"],"word":"魯班"},{"definition":["Jiang Ziya (c. 1100 BC, dates of birth and death unknown), partly mythical sage advisor to King Wen of Zhou 周文王[Zhou1 Wen2 wang2] and purported author of “Six Secret Strategic Teachings” 六韜|六韬[Liu4 tao1], one of the Seven Military Classics of ancient China 武經七書|武经七书[Wu3 jing1 Qi1 shu1]"],"pinyin":["Jiang1 Zi3 ya2"],"word":"姜子牙"},{"definition":["Nezha, protection deity"],"pinyin":["Ne2 zha5"],"word":"哪吒"},{"definition":["Han Xin (-196 BC), famous general of first Han emperor Liu Bang 劉邦|刘邦[Liu2 Bang1]"],"pinyin":["Han2 Xin4"],"word":"韓信"},{"definition":["Wang Zhaojun (52-19 BC), famous beauty at the court of Han emperor Yuan 漢元帝|汉元帝[Han4 Yuan2 di4], one of the four legendary beauties 四大美女[si4 da4 mei3 nu:3]"],"pinyin":["Wang2 Zhao1 jun1"],"word":"王昭君"},{"definition":["Di Renjie (607-700), Tang dynasty politician, prime minister under Wu Zetian, subsequently hero of legends\/master sleuth Judge Dee, aka Chinese Sherlock Holmes, in novel Three murder cases solved by Judge Dee 狄公案[Di2 gong1 an4] translated by Dutch sinologist R.H. van Gulik 高羅珮|高罗佩[Gao1 Luo2 pei4]"],"pinyin":["Di2 Ren2 jie2"],"word":"狄仁傑"},{"definition":["秦越人[Qin2 Yue4 ren2] (407-310 BC), Warring States physician known for his medical skills, nicknamed Bian Que after the earliest known Chinese physician allegedly from the 黃帝|黄帝[Huang2 di4] era"],"pinyin":["Bian3 Que4"],"word":"扁鵲"},{"definition":["Zhong Kui (mythological figure, supposed to drive away evil spirits)\/(fig.) a person with the courage to fight against evil"],"pinyin":["Zhong1 Kui2"],"word":"鍾馗"},{"definition":["Yang Yuhuan or Yang Guifei 楊貴妃|杨贵妃[Yang2 Gui4 fei1] (719-756), famous Tang beauty, consort of Emperor Xuanzhong 唐玄宗[Tang2 Xuan2 zong1], blamed for extravagance and killed as a scapegoat during the An-Shi Rebellion 安史之亂|安史之乱[An1 Shi3 zhi1 Luan4]"],"pinyin":["Yang2 Yu4 huan2"],"word":"楊玉環"},{"definition":["Sun Bin (-316 BC), political strategist of the School of Diplomacy 縱橫家|纵横家[Zong4 heng2 jia1] during the Warring States Period (425-221 BC)"],"pinyin":["Sun1 Bin4"],"word":"孫臏"},{"definition":["Cheng Yaojin (589-665), aka 程知節|程知节[Cheng2 Zhi1 jie2], Chinese general of the Tang dynasty"],"pinyin":["Cheng2 Yao3 jin1"],"word":"程咬金"}]}