{"definition":["to wander as minstrel"],"pinyin":["yin2 you2"],"simplified":["吟游"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"吟遊","characters":[{"definition":["to chant\/to recite\/to moan\/to groan\/cry (of certain animals and insects)\/song (ancient poem)"],"pinyin":["yin2"],"word":"吟"},{"definition":["to walk\/to tour\/to roam\/to travel"],"pinyin":["you2"],"word":"遊"}],"containing_words":[],"sentences":[{"english":"9-2. In those days wandering minstrels were welcome everywhere.","chinese":"當時，浪跡四方的吟遊歌手到處受歡迎。"},{"english":"All creatures able to block Elvish Bard do so.","chinese":"所有能夠阻擋妖精吟遊詩人的生物皆須阻擋之。"},{"english":"Bards will not spare breath upon your pitiful empire.","chinese":"吟遊詩人將不會在你那可鄙的王朝上多費口舌。"},{"english":"Alistair: You know, I've heard about the Orlesian bards.","chinese":"其實，我是有聽過些奧爾雷西恩吟遊詩人的傳聞。"},{"english":"OK, where is the streaking Minstrel?We've got to put an end to this.","chinese":"好吧，那個裸奔的吟遊詩人在哪？我們得把這事擺平。"},{"english":"The minstrel has been to many places before he came here.","chinese":"在來到這裏之前，這個吟遊詩人已經去過很多地方。"},{"english":"He is often called England's national poet and the \"Bard of Avon\".","chinese":"他被譽爲英國的民族詩人和“吟遊詩人”。"},{"english":"The minstrel had been to many places before he came here.","chinese":"在來到這裏之前，這個吟遊詩人已經去過很多地方。"},{"english":"Cracktooth can be summoned by a Minstrel on a class quest.","chinese":"在職業任務中，通過吟遊詩人可以召喚裂牙。"},{"english":"Oh, I'm a bard that kind of stuff comes naturally.","chinese":"哦，我是個吟遊詩人，這種話很自然地就冒出來了。"},{"english":"They survived, indeed, in Europe as the minstrels into the Middle Ages.","chinese":"他們在歐洲的確是作爲吟遊詩人而留存到中世紀的。"},{"english":"In those days wandering minstrels were welcome everywhere.","chinese":"當時，浪跡天涯的吟遊歌手到處受歡迎。"},{"english":"This is Frost in old age, as an American bard from a magazine.","chinese":"這張是他年老時，一個雜誌上的吟遊詩人。"},{"english":"See Bardic Music in the bard class description.","chinese":"見吟遊詩人職業說明中吟唱能力。"},{"english":"Bards can now gain the Blade Master discipline.","chinese":"吟遊詩人現在得到劍術掌握了。"}],"related":[]}