{"definition":["to draw a lesson (from a setback)"],"pinyin":["xi1 qu3 jiao4 xun5"],"simplified":["吸取教训"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"吸取教訓","characters":[{"definition":["to breathe\/to suck in\/to absorb\/to inhale"],"pinyin":["xi1"],"word":"吸"},{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"},{"definition":["religion\/teaching\/to make\/to cause\/to tell","surname Jiao","to teach"],"pinyin":["Jiao4","jiao1","jiao4"],"word":"教"},{"definition":["to teach\/to train\/to admonish\/instruction (from superiors)\/teachings\/rule"],"pinyin":["xun4"],"word":"訓"}],"containing_words":[],"sentences":[{"english":"Draw lessons from mistake,don't make same mistakes.","chinese":"從錯誤中吸取教訓，不要重犯舊錯。"},{"english":"Our focus now should bein drawing lessons.","chinese":"我們現在的重點應當是吸取教訓。"},{"english":"A failure is a man who has blundered, but is not able to cash in on the experience. -(Elbert Hubbard)","chinese":"失敗者是犯了錯誤而不能從中吸取教訓的人。"},{"english":"We can take lessons of the successes and failures from that.","chinese":"我們可以從那些成功或失敗的例子吸取教訓。"},{"english":"The second thing to do after realizing the inevitability of it all is to learn from it.","chinese":"第二點，在意識到它的不可避免性之後，吸取教訓。"},{"english":"We should draw a moral from the startling fact.","chinese":"我們應當從這些觸目驚心的事實中吸取教訓。"},{"english":"Shriver said people should gain a lesson from the incident.","chinese":"施立弗說，人們應該從這件事中吸取教訓。"},{"english":"Failure is success if we learn from it.","chinese":"果能從失敗中吸取教訓，失敗亦是成功。"},{"english":"We should learn by the mistakes of others.","chinese":"我們應該從別人的錯誤中吸取教訓。"},{"english":"It is time we finally learned the lessons of this lost decade.","chinese":"這失去的十年，我們終於學會吸取教訓，是時候了。"},{"english":"They want to learn from our mistakes.","chinese":"他們希望從我們的錯誤中吸取教訓。"},{"english":"Mr. Wong understands something that Lakers fans found out long ago, and the lesson remains relevant to this day.","chinese":"王先生從湖人球迷那兒吸取教訓，直至今日任然受用。"},{"english":"They should learn a lesson from this incident :he who plays with fire will surely get burnt.","chinese":"他們應從這件事中吸取教訓，玩火者必自焚。"},{"english":"And President Pinera said lessons have to be learnt from the accident.","chinese":"皮涅拉總統表示，必須從這次事故中吸取教訓。"},{"english":"If you fall, get up, and learn from it.","chinese":"如果你失敗了，站起來，並吸取教訓。"},{"english":"We all learn something from doing that.","chinese":"那樣做的話，我們都會吸取教訓。"}],"related":[]}