{"definition":["heat absorption"],"pinyin":["xi1 re4"],"simplified":["吸热"],"rank":44202.0,"normalized_rank":0.6184433282498286,"fraction":2.576505114113103e-7,"cumulative_fraction":0.9978217157209106,"word":"吸熱","characters":[{"definition":["to breathe\/to suck in\/to absorb\/to inhale"],"pinyin":["xi1"],"word":"吸"},{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"熱"}],"containing_words":[],"sentences":[{"english":"Thermodynamic parameters depict the endothermic nature of adsorption and the process is spontaneous.","chinese":"熱力學參數表明，吸附過程是自發的和吸熱的。"},{"english":"Black can improve the heat-absorbing capability and speed up the spring planting.","chinese":"黑色有助吸熱及提早春天種植。"},{"english":"The second endothermic peak (T3) is caused by the hard-segment crystal.","chinese":"第二個吸熱峯爲硬鏈節結晶所致，爲T3。"},{"english":"Is Hell exothermic or endothermic?","chinese":"地獄是放熱還是吸熱？"},{"english":"Selectcracking is a highly endothermic reaction process.","chinese":"柴油非臨氫降凝是強吸熱反應過程。"},{"english":"A bottom layer of nickel catalyst was provided to promote the endothermic reaction of steam and methane.","chinese":"底層鎳催化劑促進蒸汽和甲烷的吸熱反應。"},{"english":"Go from reactants to products, that becomes endothermic.","chinese":"從反應物到生成物的過程，是吸熱的。"},{"english":"The heat receiver is a key part of SDPS.","chinese":"吸熱器是熱動力發電系統關鍵部件之一。"},{"english":"Heat of respiration generated by all fresh fruits and vegetables.","chinese":"所有的新鮮果蔬都會產生的呼吸熱。"},{"english":"Let's see. This is an endothermic, or exothermic, negative sign.","chinese":"讓我們看看這是吸熱，還是放熱負號。"},{"english":"This paper discusses in detail the problem on the mass loss and endothermic mechanism for charring material.","chinese":"詳細討論了低溫炭化材料的質量損失和吸熱機理。"},{"english":"Wider hinges also fold faster, because there is more surface area to absorb energy.","chinese":"摺痕角度越大，吸熱表面積越大，也可以摺疊的更快。"}],"related":[]}