{"definition":["sound absorption"],"pinyin":["xi1 sheng1"],"simplified":["吸声"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"吸聲","characters":[{"definition":["to breathe\/to suck in\/to absorb\/to inhale"],"pinyin":["xi1"],"word":"吸"},{"definition":["sound\/voice\/tone\/noise\/reputation\/classifier for sounds"],"pinyin":["sheng1"],"word":"聲"}],"containing_words":[],"sentences":[{"english":"We stood there listening to our own breathing.","chinese":"我們站在那裏聆聽着我們自己的呼吸聲。"},{"english":"I heard Heidi breathe deeply, but she said nothing.","chinese":"我聽見了海蒂清晰的呼吸聲，但她什麼也沒有說。"},{"english":"The sound absorption characteristics of a double layer structure with metal-rubber (MR) material were investigated.","chinese":"理論研究了金屬橡膠材料雙層結構吸聲特性。"},{"english":"Tom's breathing soothed me to sleep like a lull aby.","chinese":"湯姆的呼吸聲就像催眠曲一樣安撫我入睡。"},{"english":"The performance in low frequency can be improved by…","chinese":"通過改變空腔結構可以改善吸聲器的低頻吸聲性能。"},{"english":"The performance in low frequency can be improved by…","chinese":"通過改變空腔結構可以改善吸聲器的低頻吸聲性能。"},{"english":"Therefore, the study on non-woven sound-absorbing materials has great significance.","chinese":"因此研究非織造吸聲材料具有非常重大的意義。"},{"english":"The loser's breathing chances for now are ground into the sand.","chinese":"失敗者的微弱呼吸聲現在只有地下的沙子能夠聽到。"},{"english":"An approach is made on technical scheme of developing mineral wool acoustic tile in silence series.","chinese":"探討了研製靜音系列礦棉吸聲板的技術方案。"},{"english":"The utility model provides a sound absorption assembled plate of a wide frequency band;","chinese":"本實用新型提供一種寬頻帶組合式吸聲板。"},{"english":"Strike forces and the community as a whole are growing louder.","chinese":"全部社會寬挨烏惡權力的吸聲下漲。"},{"english":"She lay in bed, her breath rasping painfully in her throat.","chinese":"她躺在牀上，嗓子裏發出粗重而痛苦的呼吸聲。"},{"english":"Normally, bronchial breath sounds are sometimes heard over the manubrium .","chinese":"一般來講，支氣管的呼吸聲有時能在柄狀體處被聽到。"},{"english":"You can hear his labored breathing.","chinese":"你能聽到他費力的呼吸聲。"},{"english":"During the night, Pan heard slow footsteps and breathing noises outside his room.","chinese":"夜晚，潘文石聽到屋外傳來緩慢的腳步聲和呼吸聲。"},{"english":"Back wall and side wall at the rear to meet the requirements of sound absorption.","chinese":"後牆及後部側牆滿足吸聲要求。"}],"related":[]}