{"definition":["absorbent"],"pinyin":["xi1 fu4 ji4"],"simplified":["吸附剂"],"rank":56741.0,"normalized_rank":0.7938802065115498,"fraction":6.598188734159334e-8,"cumulative_fraction":0.9996414663943548,"word":"吸附劑","characters":[{"definition":["to breathe\/to suck in\/to absorb\/to inhale"],"pinyin":["xi1"],"word":"吸"},{"definition":["to add\/to attach\/to be close to\/to be attached"],"pinyin":["fu4"],"word":"附"},{"definition":["dose (medicine)"],"pinyin":["ji4"],"word":"劑"}],"containing_words":[],"sentences":[{"english":"A silicon gel, which has greater specific pore volume and stronger polarity, is the optimal adsorbent.","chinese":"硅膠是擁有大比孔容的強極性吸附劑，吸附效果較佳。"},{"english":"The absorption methods of purine compounds in beer by several kinds of absorbents had been developed.","chinese":"建立了幾種吸附劑對啤酒中嘌呤類物質吸附的方法。"},{"english":"The arsenic-containing industrial wastewater treated with fly ash as adsorbent has been studied.","chinese":"研究了以粉煤灰爲吸附劑處理含砷工業廢水。"},{"english":"Prepared adsorbents, copper-containing alumina, are effective in adsorbing mercaptan in kerosene.","chinese":"利用油乳法制備了含銅氧化鋁吸附劑。"},{"english":"Experimental Study on the Treatment of Wastewater Containing Arsenic by Polysilicate-metal Salts;","chinese":"研究了以粉煤灰爲吸附劑處理含砷工業廢水。"},{"english":"It is shown that the improved coal ash adsorbent can obviously heighten the absorptivity of ions.","chinese":"證明粉煤灰吸附劑顯著提高了對水中離子的吸附性。"},{"english":"All of these provide us with a fire-new clue to new type porous sorbent design.","chinese":"爲新型的多孔吸附劑的設計與製備提供了一種新思路。"},{"english":"Facet's FIWA absorptive cartridges perform two jobs with one cartridge.","chinese":"FIWA吸附劑過濾筒可以用一個過濾筒做兩項工作。"},{"english":"Development of new adsorbents is an important subject in research of adsorption technology.","chinese":"新型吸附劑的研製是吸附工藝研究的一個重要課題。"},{"english":"The solid on whose surface adsorption occurs is called the adsorbent.","chinese":"在表面上發生吸附作用的固體叫吸附劑。"},{"english":"Several processes and highly effective adsorbents for the recovery of ethylene from FCC dry gases are described.","chinese":"概述了回收幹氣中乙烯的幾種工藝技術和高效吸附劑。"},{"english":"Adsorbent is an important method in water treatment technology.","chinese":"吸附劑是水處理技術的一種重要手段。"},{"english":"Further developments of absorbents for producting N2 used for air separation are also prospected.","chinese":"展望了空分制氮吸附劑的進一步發展。"},{"english":"Ti -modified silica gel monolithic adsorbent was prepared by impregnation-deposition method.","chinese":"採用浸漬沉積法制得鈦改性硅膠塊體吸附劑。"},{"english":"Preparation condition of sorbent has obvious influence on the desulfuration property.","chinese":"吸附劑本身製備條件對脫硫性能影響明顯。"},{"english":"The filtration technology with adsorbent precoat for waste magnetic suspending liquid is introduced.","chinese":"主要介紹了廢磁懸液吸附劑預塗膜過濾技術工藝。"}],"related":[]}