{"definition":["a magnet\/same as 磁鐵|磁铁"],"pinyin":["xi1 tie3 shi2"],"simplified":["吸铁石"],"rank":49112.0,"normalized_rank":0.6871405985477034,"fraction":1.5867768039892027e-7,"cumulative_fraction":0.9988256680909922,"word":"吸鐵石","characters":[{"definition":["to breathe\/to suck in\/to absorb\/to inhale"],"pinyin":["xi1"],"word":"吸"},{"definition":["iron (metal)\/arms\/weapons\/hard\/strong\/violent\/unshakeable\/determined\/close\/tight (slang)","surname Tie"],"pinyin":["Tie3","tie3"],"word":"鐵"},{"definition":["dry measure for grain equal to ten dou 斗\/ten pecks\/one hundred liters","rock\/stone\/stone inscription\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Shi"],"pinyin":["Shi2","dan4","shi2"],"word":"石"}],"containing_words":[],"sentences":[{"english":"The dampened cloth makes a great dirt magnet.","chinese":"一般來說，溼布是一塊絕妙的灰塵吸鐵石。"},{"english":"These filters are dust and pollen magnets.","chinese":"這些過濾器是灰塵和花粉的“吸鐵石”。"},{"english":"Coaster has a small magnet can attract the love spoon.","chinese":"杯墊有小吸鐵石可以吸住勺子。"},{"english":"Xitie Dan found through experiments to explore the absorption of iron.","chinese":"通過實驗探索發現吸鐵石吸鐵的特性。"},{"english":"Someday we may discover how to make magnets that can point in any direction.","chinese":"有一天我們可能會造出能指向任何方向的吸鐵石。"}],"related":[{"definition":["Every family goes through its problems. (idiom)"],"pinyin":["jia1 jia1 you3 ben3 nan2 nian4 de5 jing1"],"word":"家家有本難念的經"},{"definition":["both sides are willing\/by mutual consent"],"pinyin":["liang3 xiang1 qing2 yuan4"],"word":"兩廂情願"},{"definition":["to ask a question, already knowing the answer"],"pinyin":["ming2 zhi1 gu4 wen4"],"word":"明知故問"},{"definition":["lit. a good horse doesn't turn around and graze the same patch again (idiom)\/fig. once you've moved on, don't go back again (romantic relationship, job etc)\/leave the past behind"],"pinyin":["hao3 ma3 bu4 chi1 hui2 tou2 cao3"],"word":"好馬不吃回頭草"},{"definition":["ugly people will do all kinds of weird things to get attention (idiom)"],"pinyin":["chou3 ren2 duo1 zuo4 guai4"],"word":"醜人多作怪"},{"definition":["(slang) (usu. of a woman) sb who looks stunning from behind\/sb who has a great figure but not necessarily an attractive face\/abbr. to 背殺|背杀[bei4 sha1]"],"pinyin":["bei4 ying3 sha1 shou3"],"word":"背影殺手"},{"definition":["to patch up one's lie (when inconsistencies appear)\/to cover (for sb who has lied)"],"pinyin":["yuan2 huang3"],"word":"圓謊"},{"definition":["A rabbit doesn't eat the grass by its own burrow (idiom); One shouldn't do anything to harm one's neighbors."],"pinyin":["tu4 zi5 bu4 chi1 wo1 bian1 cao3"],"word":"兔子不吃窩邊草"},{"definition":["all crows are black (idiom)\/evil people are bad all over the world"],"pinyin":["tian1 xia4 wu1 ya1 yi1 ban1 hei1"],"word":"天下烏鴉一般黑"},{"definition":["to talk nonsense\/to bullshit"],"pinyin":["shuo1 fei4 hua4"],"word":"說廢話"},{"definition":["conjoined twins"],"pinyin":["lian2 ti3 ying1"],"word":"連體嬰"},{"definition":["lit. 300 silver taels not hidden here (idiom); fig. to reveal what one intends to hide"],"pinyin":["ci3 di4 wu2 yin2 san1 bai3 liang3"],"word":"此地無銀三百兩"},{"definition":["to censor an image\/to pixelate"],"pinyin":["da3 ma3 sai4 ke4"],"word":"打馬賽克"},{"definition":["lit. to gnaw a book\/to study\/to cram"],"pinyin":["ken3 shu1"],"word":"啃書"},{"definition":["lit. firing after the horse\/fig. belated action\/giving advice in hindsight"],"pinyin":["ma3 hou4 pao4"],"word":"馬後炮"},{"definition":["when views are irreconcilable, it's a waste of breath to continue discussion (idiom)"],"pinyin":["hua4 bu4 tou2 ji1 ban4 ju4 duo1"],"word":"話不投機半句多"}]}