{"definition":["to be a good fit\/to be identical with\/to adjust oneself to\/to fit in"],"pinyin":["wen3 he2"],"simplified":["吻合"],"rank":9664.0,"normalized_rank":0.13521189819932006,"fraction":0.000008732673594134506,"cumulative_fraction":0.926847066988682,"word":"吻合","characters":[{"definition":["kiss\/to kiss\/mouth"],"pinyin":["wen3"],"word":"吻"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"}],"containing_words":[],"sentences":[{"english":"Compare the two values we found that they are anastomose essentially.","chinese":"實驗室試驗數據與仿真結果比較，二者基本吻合。"},{"english":"Conclusion Myofibroblast is the main cause to result in scar contracture of bilioenteric anastomosis.","chinese":"是導致膽腸吻合口瘢痕性攣縮的主要原因。"},{"english":"This fits with their extremely slow growth and reproduction rates.","chinese":"這一點與他們極低的成長速度和繁殖率相吻合。"},{"english":"The vessels of vascular pedicles were anastomosed to the femoral artery and the branches of saphenous vein.","chinese":"皮瓣血管蒂分刖與股動脈及大隱靜脈吻合。"},{"english":"Diagnosis of leakage was made by clinical features or abdominal CT-scans.","chinese":"吻合口瘻的診斷主要依據臨牀表現和腹部CT。"},{"english":"\"That's very consistent with a selection effect, \" she said.","chinese":"她說，“這與選擇效應非常吻合。"},{"english":"The result of proto- type test is similar to calculation.","chinese":"經樣機測試，結果與計算基本吻合。"},{"english":"The analysis on the meridional circulation also proves above view.","chinese":"經圈環流的分析結果也與此相吻合。"},{"english":"Hyoid bone and arytenoid cartilages were resected and cricoid cartilage anastomosis with the base of the tongue and submental muscles.","chinese":"常規切除舌骨將環狀軟骨與舌根及頦下肌肉吻合。"},{"english":"The network of lines now conforms closely with a regular system of stress trajectories.","chinese":"這些線所形成的網絡與規則的主應力跡線族密切吻合。"},{"english":"Postoperative joint congruency was classified into four grades.","chinese":"術後關節吻合度被分爲四個等級。"},{"english":"Aortic continuity was achieved by surgical anastomosis of artificial vessel.","chinese":"確診後做主動脈弓及降主動脈人工血管吻合術。"},{"english":"The simulation results agree with that of ground experiments.","chinese":"仿真結果與高模試驗結果相吻合。"},{"english":"Does it match up with what you’re doing?","chinese":"這和你正在做的事情相吻合嗎？"},{"english":"The decending branch was anastomosed with the anterior medial malleolar artery.","chinese":"降支下行與內踝前動脈吻合。"},{"english":"Relative comparison use tallying surpasses manually tallies.","chinese":"相對比較使用吻合器優於手工吻合。"}],"related":[{"definition":["to match\/to tally"],"pinyin":["xiang1 fu2"],"word":"相符"},{"definition":["agreement\/to agree\/to get on with\/congenial\/agreeing with\/to ally oneself with sb"],"pinyin":["qi4 he2"],"word":"契合"},{"definition":["close\/similar to"],"pinyin":["xiang1 jin4"],"word":"相近"},{"definition":["to match up\/to coincide"],"pinyin":["chong2 he2"],"word":"重合"},{"definition":["unanimous\/identical (views or opinions)"],"pinyin":["yi1 zhi4"],"word":"一致"},{"definition":["to resemble\/similar\/like\/resemblance\/similarity"],"pinyin":["xiang1 si4"],"word":"相似"},{"definition":["to fit in with\/to suit\/appropriate"],"pinyin":["qie4 he2"],"word":"切合"},{"definition":["to infer\/to deduce\/to predict\/to extrapolate"],"pinyin":["tui1 duan4"],"word":"推斷"},{"definition":["in keeping with\/in accordance with\/tallying with\/in line with\/to agree with\/to accord with\/to conform to\/to correspond with\/to manage\/to handle"],"pinyin":["fu2 he2"],"word":"符合"},{"definition":["to seal\/to confirm\/to corroborate\/to verify"],"pinyin":["yin4 zheng4"],"word":"印證"},{"definition":["speculation\/to conjecture\/to surmise\/to speculate"],"pinyin":["tui1 ce4"],"word":"推測"},{"definition":["inconsistent\/not in agreement with\/not agree or tally with\/not conform to"],"pinyin":["bu4 fu2"],"word":"不符"},{"definition":["to agree without prior consultation\/to happen to hold the same view"],"pinyin":["bu4 mou2 er2 he2"],"word":"不謀而合"},{"definition":["to resemble one another\/to be alike\/similar"],"pinyin":["xiang1 xiang4"],"word":"相像"},{"definition":["to be precisely the same\/to be no different"],"pinyin":["ru2 chu1 yi1 zhe2"],"word":"如出一轍"},{"definition":["similar"],"pinyin":["xiang1 fang3"],"word":"相仿"}]}