{"definition":["to appear\/to emerge\/to present (a certain appearance)\/to demonstrate"],"pinyin":["cheng2 xian4"],"simplified":["呈现"],"rank":1972.0,"normalized_rank":0.027590838498453958,"fraction":0.00007819641929163865,"cumulative_fraction":0.7283120529944362,"word":"呈現","characters":[{"definition":["to present to a superior\/memorial\/petition\/to present (a certain appearance)\/to assume (a shape)\/to be (a certain color)"],"pinyin":["cheng2"],"word":"呈"},{"definition":["to appear\/present\/now\/existing\/current"],"pinyin":["xian4"],"word":"現"}],"containing_words":[],"sentences":[{"english":"Global warming caused a dryer and warmer climate in the centeral part of Qinghai-Tibet plateau.","chinese":"受全球變暖影響，青藏高原氣候呈現出暖幹趨勢。"},{"english":"Fine texture, uniform color-make-up to show you natural luster, and the makeup is not easily come off.","chinese":"質地細緻，上色均勻，不易脫妝，妝效呈現自然光澤。"},{"english":"Search results will also automatically when you search in the Omnibox.","chinese":"當你在搜索框內搜索時，結果也將是自動呈現。"},{"english":"Light the degree of coloring for object is called color rendering.","chinese":"光源對於物體顏色呈現的程度稱爲顯色性。"},{"english":"The avocado shows a typical loss of green color and a reduction in vegetative growth.","chinese":"鱷梨呈現典型的葉色褪綠及營養生長減弱。"},{"english":"Images of winter trees have no leaves and white backgrounds because of the snow.","chinese":"冬天的樹圖沒有葉子，而且因爲雪呈現白色的背景。"},{"english":"But after that period, the tea economy is in the recession.","chinese":"但自唐中後期以後，茶業經濟逐步呈現出衰退趨勢。"},{"english":"Self-publishing these days is increasingly a tale of two cities.","chinese":"今自助出版越來越呈現兩極分化的趨勢。"},{"english":"After optimization your pages will appear to snap onto the screen.","chinese":"在優化之後，你的頁面會快速的呈現在屏幕上。"},{"english":"The larger the font size is, the easier it is for readers to actually read the text presented on a given web-page.","chinese":"字體越大，讀者越容易看到呈現在網頁上的內容。"},{"english":"Classic German-style flavor, a perfect cherry and strawberry cake.","chinese":"徳式傳統經典風味，酒釀櫻桃的完美呈現。"},{"english":"Several factors lead to this downward spiral of the unemployed.","chinese":"幾大因素使得失業狀況呈現螺旋形惡化。"},{"english":"Yad entrance mine market both showed a high consolidation positive trend.","chinese":"連日來進口礦市場皆呈現出高位盤整向上的趨勢。"},{"english":"Sunlight reflecting off the water’s surface gives it a pale, silvery blue color.","chinese":"水面上太陽光反射讓水面呈現出銀白藍色。"},{"english":"Each row of the dataTable represents an address.","chinese":"數據表的每一行呈現一個地址。"},{"english":"Fourth, the traditional social philosophy is pluralistic in its values.","chinese":"傳統處世哲學在價值層面呈現著多元取向。"}],"related":[{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"word":"展現"},{"definition":["appearance\/to appear"],"pinyin":["xian3 xian4"],"word":"顯現"},{"definition":["to combine\/to link\/to integrate\/binding\/CL:次[ci4]"],"pinyin":["jie2 he2"],"word":"結合"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"體現"},{"definition":["to recreate\/to reconstruct (a historical relic)"],"pinyin":["zai4 xian4"],"word":"再現"},{"definition":["to describe\/to portray"],"pinyin":["miao2 hui4"],"word":"描繪"},{"definition":["to create\/to bring about\/to produce\/to set (a record)"],"pinyin":["chuang4 zao4"],"word":"創造"},{"definition":["to use\/to put to use"],"pinyin":["yun4 yong4"],"word":"運用"},{"definition":["(of a story etc) to unfold\/to play out\/to develop (a technique etc)\/to enact\/(logic) to deduce\/to infer"],"pinyin":["yan3 yi4"],"word":"演繹"},{"definition":["diverse\/diversity\/manifold"],"pinyin":["duo1 yang4"],"word":"多樣"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰顯"},{"definition":["to show\/to show off\/to display\/to manifest\/expression\/manifestation\/show\/display\/performance (at work etc)\/behavior"],"pinyin":["biao3 xian4"],"word":"表現"},{"definition":["to present clearly\/to give prominence to\/to magnify\/clear and obvious"],"pinyin":["tu1 xian3"],"word":"凸顯"},{"definition":["whole entity\/entire body\/synthesis\/as a whole (situation, construction, team etc)\/global\/macrocosm\/integral\/holistic\/whole"],"pinyin":["zheng3 ti3"],"word":"整體"},{"definition":["shape\/form\/pattern\/morphology"],"pinyin":["xing2 tai4"],"word":"形態"},{"definition":["to restore to the original state\/to reconstruct (an event)\/reduction (chemistry)"],"pinyin":["huan2 yuan2"],"word":"還原"}]}