{"definition":["to travel around the world"],"pinyin":["zhou1 you2 shi4 jie4"],"simplified":["周游世界"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"周遊世界","characters":[{"definition":["surname Zhou\/Zhou Dynasty (1046-256 BC)","to make a circuit\/to circle\/circle\/circumference\/lap\/cycle\/complete\/all\/all over\/thorough\/to help financially"],"pinyin":["Zhou1","zhou1"],"word":"周"},{"definition":["to walk\/to tour\/to roam\/to travel"],"pinyin":["you2"],"word":"遊"},{"definition":["life\/age\/generation\/era\/world\/lifetime\/epoch\/descendant\/noble","surname Shi"],"pinyin":["Shi4","shi4"],"word":"世"},{"definition":["boundary\/scope\/extent\/circles\/group\/kingdom (taxonomy)"],"pinyin":["jie4"],"word":"界"}],"containing_words":[],"sentences":[{"english":"He spent his golden years traveling to many parts of the world.","chinese":"他通過周遊世界度過了晚年的幸福時光。"},{"english":"We'll travel round the world and we'll stay at the best hotels.","chinese":"就去周遊世界，並且往最好的旅館。"},{"english":"Thumbling, however, declined, and said he wanted to see the world first.","chinese":"大拇哥謝絕了，說自己想先周遊世界。"},{"english":"A: To retire and travel around the world.","chinese":"退休以後去周遊世界。"},{"english":"Thee Robinsons love seeing the world.","chinese":"羅賓遜一家喜歡周遊世界。"},{"english":"Help Candice as she travels the world, learning and mastering divine new recipes.","chinese":"幫助王紅，她周遊世界，學習和掌握新的神聖的食譜。"},{"english":"Where is John? He's on a trip to Shanghai. He'll make a round-the-world trip.","chinese":"約翰在哪裏？他去上海旅行楽他將周遊世界。"},{"english":"Glen spent a small fortune on a tour round the world。","chinese":"格倫花了一筆小錢周遊世界。"},{"english":"He was traveling around the world for months on end.","chinese":"幾個月來他馬不停蹄地周遊世界。"},{"english":"Hannigan, free tour to all the ports in the world.","chinese":"漢尼根，免費周遊世界上所有的港口。"},{"english":"He vainly hope to travel round the world on foot.","chinese":"他夢想步行周遊世界。"},{"english":"I'll sit in my wife's handbag and travel the world with her.","chinese":"我將坐在我的妻子的手提袋裏周遊世界與她。"},{"english":"Two years later, he did indeed go on a round-the-world tour.","chinese":"兩年以後，他果然去周遊世界了。"},{"english":"Do you dream of travelling the world and having adventures?","chinese":"你夢想周遊世界冒險闖蕩嗎？"},{"english":"Hannigan, free tour to most of the ports in the world.","chinese":"漢尼根，收費周遊世界上悉數的港口。"},{"english":"I've been making enquiries into the cost of a round-the-world ticket.","chinese":"我一直在打聽買一張周遊世界的票需花多少錢。"}],"related":[]}