{"definition":["pager"],"pinyin":["hu1 ji1"],"simplified":["呼机"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"呼機","characters":[{"definition":["to call\/to cry\/to shout\/to breath out\/to exhale"],"pinyin":["hu1"],"word":"呼"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[{"definition":["pager\/beeper"],"pinyin":["xun2 hu1 ji1"],"word":"尋呼機"},{"definition":["pager\/beeper"],"pinyin":["chuan2 hu1 ji1"],"word":"傳呼機"}],"sentences":[{"english":"The doctor asked to be paged if the patient's condition grew  worse suddenly.","chinese":"如果病人的病情突然惡化，醫生讓馬上用尋呼機叫他。"},{"english":"I have his pager number right here.","chinese":"我這兒有他的呼機號。"},{"english":"The way you feel when you see your name on the pager after you just had a big fight.","chinese":"大鬧一場後，呼機上又有她的信號時你的感受。"},{"english":"All beepers and mobile phones must be during the meeting.","chinese":"在開會過程中所有的呼機和手機必須關閉。"},{"english":"It was basically just an email pager.","chinese":"它基本上只是一個郵件呼機。"},{"english":"I found a beeper on my desk. Is that yours?","chinese":"在我桌上我發現了一個尋呼機。是你的嗎？"},{"english":"A sampling of the many cell phones and pagers are part of the exhibit.","chinese":"此次展覽抽取了一部分手機和呼機進行展出。"},{"english":"All the beepers and mobile phones must be kept off during the concert.","chinese":"在音樂演奏的過程中，所有的呼機和手機必須關掉。"},{"english":"Find a beeper and deposit it on the origin.","chinese":"找到一個尋呼機和存款它的起源。"},{"english":"It is also very rude to leave a cell phone or beeper on during a movie.","chinese":"看電影時把手機或者尋呼機開着也是不禮貌的行爲。"},{"english":"Please help! There’s a pager number.","chinese":"之後留了一個尋呼機的號碼。"},{"english":"This pager arrangement could also be used by a carer.","chinese":"本傳呼機安排也可以由一個照顧者使用。"},{"english":"And what is more, beepers and mobile phones must be off during the concert.","chinese":"另外，音樂會期間，傳呼機和手機必須關閉。"},{"english":"Please keep off your beepers and mobile phones during the meeting.","chinese":"會議期間請關上你們的呼機和手機。"},{"english":"The pager is cheap but only handles minimal amounts of information.","chinese":"傳呼機便宜但只能處置少量的信息。"},{"english":"Please close your beepers and mobile phones.","chinese":"請關閉您的傳呼機和手機。"}],"related":[]}