{"definition":["lifeline"],"pinyin":["ming4 mai4"],"simplified":["命脉"],"rank":18904.0,"normalized_rank":0.26449148629552416,"fraction":0.000002678543475289593,"cumulative_fraction":0.9720594832617676,"word":"命脈","characters":[{"definition":["life\/fate\/order or command\/to assign a name, title etc"],"pinyin":["ming4"],"word":"命"},{"definition":["arteries and veins\/vein (on a leaf, insect wing etc)","see 脈脈|脉脉[mo4 mo4]"],"pinyin":["mai4","mo4"],"word":"脈"}],"containing_words":[],"sentences":[{"english":"They firmly took hold of all the lifelines of their national economy.","chinese":"他們把國民經濟的命脈都牢牢抓到自己手中。"},{"english":"In short, it is the lifeblood of every Summoner in the League of Legends.","chinese":"總之，這是命脈中的每一個召喚聯盟的傳奇。"},{"english":"The municipal water supply network system is the city's life vein.","chinese":"城市給水管網系統，是城市的命脈。"},{"english":"He reportedly divvied up key spheres of interest, such as oil, among his 6 sons.","chinese":"據稱，他的6個兒子瓜分了石油等國家命脈產業。"},{"english":"But it likely will be the lifeblood of your career.","chinese":"但不管若何，它可能將是你整個事業的命脈。"},{"english":"The people's government controlled the nation's economy and set up a state-owned socialist economy.","chinese":"人民政府控制經濟命脈並建立了公有制社會主義經濟。"},{"english":"You see, the flow of credit is the lifeblood of our economy.","chinese":"要知道，信貸流動可是我們經濟命脈啊。"},{"english":"Politicians are the lifeblood of the Exchange as a country.","chinese":"政治家們把交易所視爲國之命脈。"},{"english":"Money-raising is the key for the survival and the development of the university.","chinese":"高校籌資是高等學校生存和發展的命脈。"},{"english":"All vitals appear to be stabilized.","chinese":"所有命脈似乎穩定下來。"},{"english":"Trade is the lifeblood of our country.","chinese":"貿易是我國的命脈。"},{"english":"Creativity is the lifeblood of a service economy.","chinese":"創意是服務型經濟的命脈。"},{"english":"Data is the lifeblood of telecommunications companies.","chinese":"數據是電信公司的命脈。"},{"english":"Energy is the lifeblood of economic development.","chinese":"動力非兒官經濟收鋪的命脈。"},{"english":"THE economy of Kuwait is exceedingly well oiled.","chinese":"科威特的經濟命脈極其依賴石油。"},{"english":"Water is the source of the life, and the lifeblood of human survival and development.","chinese":"水是生命之源，是人類生存與發展的命脈。"}],"related":[]}