{"definition":["(U.S.) Peace Corps"],"pinyin":["He2 ping2 dui4"],"simplified":["和平队"],"rank":61112.0,"normalized_rank":0.8550361675038126,"fraction":3.4742675193139865e-8,"cumulative_fraction":0.9998573277445432,"word":"和平隊","characters":[{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["flat\/level\/equal\/to tie (make the same score)\/to draw (score)\/calm\/peaceful\/see also 平聲|平声[ping2 sheng1]","surname Ping"],"pinyin":["Ping2","ping2"],"word":"平"},{"definition":["squadron\/team\/group\/CL:個|个[ge4]"],"pinyin":["dui4"],"word":"隊"}],"containing_words":[],"sentences":[{"english":"Today, 5 percent of Peace Corps volunteers work in youth development.","chinese":"今天，和平隊有5%的志願者從事青年發展工作。"},{"english":"like maybe the Peace Corps or Jesuit Volunteer Corps.","chinese":"像和平隊或耶穌會志願者之類的。"},{"english":"Peace Corps volunteers left Sierra Leone in nineteen ninety-four because of civil war.","chinese":"和平隊志願者1994年由於內戰離開了塞拉利昂。"},{"english":"Kennedy Organization alliance for progress in Latin America and the Peace Corps.","chinese":"肯尼迪組織拉丁美洲爭取進步同盟與和平隊。"},{"english":"Today, Gordy Mengel is a Peace Corps programming and training officer in Rwanda.","chinese":"現在，孟格爾是盧旺達和平隊的一名計劃及訓練主管。"},{"english":"The agency has adapted to a rapidly changing world, Tschetter said.","chinese":"切特說，和平隊也隨着迅速變化的世界進行了調整。"},{"english":"As a young man, Chris joined the Peace Corps, and taught English in Morocco.","chinese":"克里斯年輕時參加了和平隊，在摩洛哥教英語。"}],"related":[]}