{"definition":["to live in harmony\/to get along with each other"],"pinyin":["he2 mu4 xiang1 chu3"],"simplified":["和睦相处"],"rank":25988.0,"normalized_rank":0.3636058371692807,"fraction":0.0000013546723772787306,"cumulative_fraction":0.9856894573452696,"word":"和睦相處","characters":[{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["amicable\/harmonious"],"pinyin":["mu4"],"word":"睦"},{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"Mrs…has never really got on with her daughter-in-law.","chinese":"老太太從未與兒媳婦兒真正和睦相處過。"},{"english":"They can never get along with each other.","chinese":"他們永遠無法彼此和睦相處。"},{"english":"Most daughter-in-laws can get along with their mother-in-laws.","chinese":"大多數媳婦都能與婆婆和睦相處。"},{"english":"Mrs…and her daughter-in-law have never really got on.","chinese":"老太太從未與兒媳婦兒真正和睦相處過。"},{"english":"They can't  agree well.","chinese":"他們無法和睦相處。"},{"english":"Would he be comfortable and get along with the other kids and this teacher?","chinese":"他能和其他孩子及老師和睦相處嗎？"},{"english":"They tend to get along well with the average American.","chinese":"他們易於與普通美國人和睦相處。"},{"english":"Love your work, and students live in harmony.","chinese":"你熱愛勞動，與同學和睦相處。"},{"english":"Here Adam lived in peace with all the animals.","chinese":"在這裏亞當和各種動物和睦相處。"},{"english":"Xiamen has a fine tradition to respect the nature. Here man and nature are living in harmony.","chinese":"廈門人有崇尚自然的傳統，人與自然在這裏和睦相處。"},{"english":"Live in concord with sb.","chinese":"與四鄰和睦相處。"},{"english":"Oracle does not have a tradition of playing well with others.","chinese":"甲骨文並沒有一個與其他公司和睦相處的傳統。"},{"english":"He found himself in harmony with his new workmates.","chinese":"他很快發現自己與新同事能和睦相處。"},{"english":"Get along with your co-workers.","chinese":"與你的同事和睦相處。"},{"english":"Can tegus get along with other pets like dogs or cats?","chinese":"泰加能和貓貓狗西城綠錦狗和睦相處嗎？"},{"english":"I am speaking, of course, of men inclined to be in harmony with themselves.","chinese":"當然，我說的是那些傾向於與自身和睦相處的人。"}],"related":[]}