{"definition":["Hotan Prefecture in Xinjiang"],"pinyin":["He2 tian2 Di4 qu1"],"simplified":["和田地区"],"rank":44494.0,"normalized_rank":0.6225287870944273,"fraction":2.504976076950756e-7,"cumulative_fraction":0.9978959935167868,"word":"和田地區","characters":[{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["field\/farm\/CL:片[pian4]","surname Tian"],"pinyin":["Tian2","tian2"],"word":"田"},{"definition":["-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct","earth\/ground\/field\/place\/land\/CL:片[pian4]"],"pinyin":["de5","di4"],"word":"地"},{"definition":["area\/region\/district\/small\/distinguish\/CL:個|个[ge4]","surname Ou"],"pinyin":["Ou1","qu1"],"word":"區"}],"containing_words":[],"sentences":[{"english":"Chapter five , the estimation of cultivated land resource sustainable use in Hotan region.","chinese":"第五章，和田地區耕地資源利用持續性評價。"},{"english":"All four cases are from Hotan Prefecture, Xinjiang Uygur Autonomous Region, China.","chinese":"所有四個病例都來自中國新疆維吾爾自治區和田地區。"},{"english":"Hetian Prefecture belongs to extreme arid climate, The habitat is quite bitter.","chinese":"和田地區屬極端乾旱荒漠區，生境十分嚴酷。"},{"english":"Chapter three, the situation of development and land resource use in this area .","chinese":"第三章，和田地區耕地資源動態變化。"},{"english":"Media reports initially said the protests occurred over two days in Khotan prefecture.","chinese":"媒體最初報導說，抗議發生在和田地區，持續了兩天。"}],"related":[]}