{"definition":["lit. to put everything out including the tray\/to reveal everything\/to make a clean breast of it all"],"pinyin":["he2 pan2 tuo1 chu1"],"simplified":["和盘托出"],"rank":34432.0,"normalized_rank":0.4817483525247296,"fraction":6.380682070135055e-7,"cumulative_fraction":0.993695911952746,"word":"和盤托出","characters":[{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["plate\/dish\/tray\/board\/hard drive (computing)\/to build\/to coil\/to check\/to examine\/to transfer (property)\/to make over\/classifier for food: dish, helping\/to coil\/classifier for coils of wire\/classifier for games of chess"],"pinyin":["pan2"],"word":"盤"},{"definition":["prop\/support (for weight)\/rest (e.g. arm rest)\/thanks to\/to hold in one's hand\/to support in one's palm\/to give\/to base\/to commit\/to set\/torr (unit of pressure)"],"pinyin":["tuo1"],"word":"托"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"1：First, why don't you lay all your cards on the table ?","chinese":"首先你爲什麼不把你的財務情況和盤托出呢？"},{"english":"So Hillary's going to come clean for the votes.","chinese":"因此，希拉里打算爲了選票把真相和盤托出。"},{"english":"But you can't…because it's dark and there are demons.","chinese":"但又不能和盤托出，因爲室內漆黑一片，魑魅四伏。"},{"english":"In order to save her lover, Du comes to court and explains everything.","chinese":"杜麗娘爲了救他，來到官府將詳情和盤托出。"}],"related":[]}