{"definition":["affable\/genial"],"pinyin":["he2 ai3 ke3 qin1"],"simplified":["和蔼可亲"],"rank":30764.0,"normalized_rank":0.4304282736138122,"fraction":8.79807157096865e-7,"cumulative_fraction":0.9909382056862766,"word":"和藹可親","characters":[{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["friendly"],"pinyin":["ai3"],"word":"藹"},{"definition":["can\/may\/able to\/to approve\/to permit\/to suit\/(particle used for emphasis) certainly\/very","see 可汗[ke4 han2]"],"pinyin":["ke3","ke4"],"word":"可"},{"definition":["parent\/one's own (flesh and blood)\/relative\/related\/marriage\/bride\/close\/intimate\/in person\/first-hand\/in favor of\/pro-\/to kiss\/(Internet slang) dear","parents-in-law of one's offspring"],"pinyin":["qin1","qing4"],"word":"親"}],"containing_words":[],"sentences":[{"english":"He vacillates from agile, amiable, and arch to repetitive and awkward.","chinese":"他搖擺不定的敏捷，和藹可親，並拱重複和尷尬。"},{"english":"A best commendatory letter request that you have a good attitude.","chinese":"和藹可親的態度是最好的推薦信。"},{"english":"You are the most genial person I know.","chinese":"你是我認識的最和藹可親的人。"},{"english":"He kept chopping about from kindness to cruelty towards his pupils.","chinese":"他對學生們忽而和藹可親，忽而冷酷無情。"},{"english":"She parted from her young friend in the kindliest tones.","chinese":"她用最和藹可親的語調和她的年輕的朋友道了別。"},{"english":"The human affairs of the company and downstage, simpatico to the person.","chinese":"公司的人事和前臺，都對人和藹可親。"},{"english":"Personally, Bohr is one of the most amiable colleagues I have ever met.","chinese":"就我而言，玻爾是我見到的最和藹可親的同事之一。"},{"english":"I found his amiability charming.","chinese":"我覺得他和藹可親，富有魅力。"},{"english":"Edward is very amiable, and I love him tenderly.","chinese":"愛德華非常和藹可親，我也很喜愛他。"},{"english":"Forsyth said. “She was always smiling, always laughing.","chinese":"她總是笑容滿面，和藹可親。"},{"english":"She is affable to everyone.","chinese":"她對每一個人都和藹可親。"},{"english":"His amiability condemns him to being a constant listener to other people's troubles.","chinese":"他的和藹可親使他經常處於傾聽他人訴苦的地位。"},{"english":"The Amiable Robots.","chinese":"和藹可親的機器人。"},{"english":"He is a kindly teacher, mucking in with his students.","chinese":"他是一位和藹可親的教師，能與學生們打成一片。"},{"english":"She is kind and considerate, and is ready to help her students who meet with difficulties.","chinese":"她和藹可親，關心體貼，總熱心幫助有困難的學生。"},{"english":"Lady Elliot HAD been an excellent woman, sensible and amiable.","chinese":"艾略特夫人是位難得的婦女，通情達理而又和藹可親。"}],"related":[]}