{"definition":["(loanword) caliph\/also written 哈利發|哈利发[ha1 li4 fa1]"],"pinyin":["ha1 li3 fa1"],"simplified":["哈里发"],"rank":57034.0,"normalized_rank":0.7979796566535615,"fraction":6.335429005807858e-8,"cumulative_fraction":0.9996604017362442,"word":"哈里發","characters":[{"definition":["(interj.) ha!\/(onom. for laughter)\/(slang) to be infatuated with\/to adore\/abbr. for 哈士奇[ha1 shi4 qi2], husky (dog)","a Pekinese\/a pug\/(dialect) to scold","abbr. for 哈薩克斯坦|哈萨克斯坦[Ha1 sa4 ke4 si1 tan3], Kazakhstan\/abbr. for 哈爾濱|哈尔滨[Ha1 er3 bin1], Harbin"],"pinyin":["Ha1","ha1","ha3"],"word":"哈"},{"definition":["Li (surname)","li, ancient measure of length, approx. 500 m\/neighborhood\/ancient administrative unit of 25 families\/(Tw) borough, administrative unit between the township 鎮|镇[zhen4] and neighborhood 鄰|邻[lin2] levels"],"pinyin":["Li3","li3"],"word":"里"},{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"}],"containing_words":[{"definition":["Burj Khalifa, skyscraper in Dubai, 830 m high"],"pinyin":["Ha1 li3 fa1 Ta3"],"word":"哈里發塔"},{"definition":["Caliphate (Islamic empire formed after the death of the Prophet Mohammed 穆罕默德 in 632)"],"pinyin":["Ha1 li3 fa1 Di4 guo2"],"word":"哈里發帝國"}],"sentences":[{"english":"In 928 he declared himself caliph.","chinese":"928年他自立爲哈里發。"},{"english":"The Sunni caliph is the spiritual and political head of the community.","chinese":"遜尼派哈里發，是精神文明建設和政治領導社會。"},{"english":"The Dutch tried to stop their Muslim subjects deferring to the caliph in their public prayers.","chinese":"荷蘭則試圖制止它管理的穆斯林聽從哈里發的指示。"},{"english":"A machine gun obtained by Mahdi forces, now exhibiting in Al Khalifa Museum.","chinese":"陳列於喀土穆哈里發博物館的機槍。"},{"english":"The old beggar threw himself at the Caliph's feet.","chinese":"老乞丐撲倒在哈里發的腳下。"},{"english":"Saxen, now married and living in Berkeley, Calif., said after that incident, food was an escape.","chinese":"薩克森現已結婚並居住在哈里發的伯克利。"},{"english":"as mercenaries by the Baghdad caliphs.","chinese":"在那裏被巴格達哈里發僱爲僱傭軍。"},{"english":"In the 7th century, Islamic caliphs began to exert control over the area.","chinese":"在7世紀，伊斯蘭教的哈里發們開始控制這個地區。"},{"english":"Beginning with Selim, the Ottoman sultans also held the title of caliph, the spiritual head of Islam.","chinese":"自謝里姆一世，鄂圖曼蘇丹也擁有哈里發的頭銜。"},{"english":"The letter he sent to the caliph.","chinese":"這封信是他給哈里發。"}],"related":[]}