{"definition":["Cossack (people)"],"pinyin":["Ge1 sa4 ke4"],"simplified":["哥萨克"],"rank":46084.0,"normalized_rank":0.6447749499811117,"fraction":2.1487906674076414e-7,"cumulative_fraction":0.9982651062670284,"word":"哥薩克","characters":[{"definition":["elder brother"],"pinyin":["ge1"],"word":"哥"},{"definition":["Bodhisattva\/surname Sa"],"pinyin":["Sa4"],"word":"薩"},{"definition":["abbr. for 克羅地亞|克罗地亚[Ke4 luo2 di4 ya4], Croatia\/(Tw) abbr. for 克羅埃西亞|克罗埃西亚[Ke4 luo2 ai1 xi1 ya4], Croatia"],"pinyin":["Ke4"],"word":"克"}],"containing_words":[],"sentences":[{"english":"Cossack got off his horse, lifted the boy down, and came with him to Denisov.","chinese":"那個哥薩克把孩子抱下馬，把他帶到傑尼索夫跟前。"},{"english":"The following year saw Cossack victory at Batoh.","chinese":"第二年，哥薩克在巴託格取得勝利。"},{"english":"“What are you feeding that chicken?” asks the Cossack.","chinese":"“你用什麼餵雞”，有一天一個哥薩克人跑來問他。"},{"english":"The Cossack was dead, the horse was still struggling.","chinese":"哥薩克兵死去了，馬還在掙扎。"},{"english":"The esaul looked in the direction Denisov was pointing to.","chinese":"哥薩克一等上尉朝傑尼索夫所指的方向望去。"},{"english":"Together the Cossack Hetmanate and Tsardom of Moscow march on the Polish Republic.","chinese":"如今，哥薩克統領與沙皇一起向波蘭共和國進軍。"},{"english":"It was an urgent entreaty from the Cossack leader that made up his mind.","chinese":"最終是這位哥薩克領袖急切的懇求使他拿定了主意。"},{"english":"Several days later the Cossacks attacked Orenburg.","chinese":"幾天之後，哥薩克們攻打奧倫堡。"},{"english":"Every superiors, when is iron-fitting ataman?","chinese":"各位高手，鐵裝哥薩克是什麼時候的？"},{"english":"An adjutant galloped down the street, followed by a Cossack.","chinese":"一個副官帶着一名哥薩克從街上急馳而過。"},{"english":"Russian Cossack dancing is followed by break-dancing and an interpretive scarf dance.","chinese":"俄羅斯哥薩克舞蹈之後是霹靂舞和演繹過來的紗巾舞。"},{"english":"The Cossacks fight against Poland for their freedom.","chinese":"哥薩克爲獲得自由而與波蘭奮戰。"},{"english":"At the first minute both Denisov and the esaul darted back.","chinese":"槍響時，傑尼索夫和哥薩克一等上尉往後退了一點。"},{"english":"At the bridge he jostled against a Cossack who had lagged behind, and he galloped on.","chinese":"在橋上他碰見一個落在後面的哥薩克後，繼續往前衝。"},{"english":"Or maybe you'll join the brave zaporozhian Cossacks in their rebellion? Or…","chinese":"或許你會加入勇敢的札波羅熱羣哥薩克的叛亂中？"},{"english":"Or maybe you'll join the brave zaporozhian Cossacks in their rebellion?Or…","chinese":"或許你會加入勇敢的札波羅熱羣哥薩克的叛亂中？"}],"related":[]}