{"definition":["only\/just (i.e. it is only that...)\/all except\/unique"],"pinyin":["wei2 du2"],"simplified":["唯独"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"唯獨","characters":[{"definition":["-ism\/only\/alone","yes"],"pinyin":["wei2","wei3"],"word":"唯"},{"definition":["alone\/independent\/single\/sole\/only"],"pinyin":["du2"],"word":"獨"}],"containing_words":[],"sentences":[{"english":"Lord, let this your little flock, Your name alone confessing.","chinese":"哦，主啊，讓你這羣小羊，唯獨承認你的聖名。"},{"english":"The office of priest -king was reserved by God for the Messiah, the Lord Jesus alone.","chinese":"祭司兼君王的位置，上帝唯獨保留給彌賽亞主耶穌。"},{"english":"But what we can't forget are those memories we hidden in the bag.","chinese":"唯獨忘不掉的是，藏在書包裏的那些回憶。"},{"english":"But Amy appear some solitary zero point zero a person.","chinese":"唯獨艾米顯得有些孤零點零的一個人。"},{"english":"Only in China, however, did young people actually have more friends online than offline.","chinese":"但唯獨在中國，年輕人線上的好友數超過真實好友。"},{"english":"Bue one man loved the pilgrim soul in you.","chinese":"唯獨一愛你那朝聖者的心。"},{"english":"I've been touched by how much the audience, but not you.","chinese":"被我感動的聽衆何其多，卻唯獨沒有你。"},{"english":"In all of creation, only human beings are made “in God's image.","chinese":"在所有受造物中，唯獨人是按着神的形象被造的。"},{"english":"All matters could the good scabs forget to hurt, the only love was not good.","chinese":"全部旳事都能好le傷疤忘le疼，唯獨愛情不行。"},{"english":"No one hears their cries—no one but God, who hears and is merciful.","chinese":"沒有人能聽到他們的哀告，唯獨慈愛的神能聽到。"},{"english":"Let them be for yourself alone, and not for sharing with strangers.","chinese":"唯獨歸你一人，不可與外人同用。"},{"english":"Youth will break, but memory lasts forever.","chinese":"青春終將散場，唯獨記憶永垂不朽。"},{"english":"Let me be homo unius libri: \"A man of one book.\"","chinese":"讓我成爲唯獨精通這一本書的人吧。"},{"english":"Saving faith is faith which alone apprehends Christ, his righteousness, and merits.","chinese":"得救的信心是唯獨領悟基督，祂的義和功德。"},{"english":"The other people all in to have a meal, but xiaoyan run to give everybody end dish.","chinese":"別人都在喫飯，唯獨曉燕跑來跑去給大家端菜。"},{"english":"But beans and squashes don't become gods - why does maize?","chinese":"那爲什麼豆類與瓜類都成不了神，唯獨玉米可以呢？"}],"related":[]}