{"definition":["commercial invoice"],"pinyin":["shang1 ye4 fa1 piao4"],"simplified":["商业发票"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"商業發票","characters":[{"definition":["Shang Dynasty (c. 1600-1046 BC)\/surname Shang","commerce\/merchant\/dealer\/to consult\/2nd note in pentatonic scale\/quotient (as in 智商[zhi4 shang1], intelligence quotient)"],"pinyin":["Shang1","shang1"],"word":"商"},{"definition":["line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already","surname Ye"],"pinyin":["Ye4","ye4"],"word":"業"},{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"},{"definition":["ticket\/ballot\/banknote\/CL:張|张[zhang1]\/person held for ransom\/amateur performance of Chinese opera\/classifier for groups, batches, business transactions"],"pinyin":["piao4"],"word":"票"}],"containing_words":[],"sentences":[{"english":"Commercial Invoice in three originals manually signed indicating contract number.","chinese":"手籤的商業發票，三份原件，註明合同號。"},{"english":"Low Value shipments including samples should have commercial invoice attached to the shipment.","chinese":"低值貨物包括樣品應該開具商業發票，並附在貨物上。"},{"english":"Commercial Invoice in five copies, stating contract number, L\/C number and mark.","chinese":"商業發票一式五份，註明合同號，信用證號和嘜頭。"},{"english":"All taxes and charges will be charged at the issuing of the commercial invoice.","chinese":"所有的稅費和費用按照開據的商業發票收取。"},{"english":"As requested, we are sending you herewith our commercial invoice in duplicate.","chinese":"按你方要求，隨函寄去商業發票一式兩份。"},{"english":"Three copies of Signed Commercial Invoice indicating contract number.","chinese":"簽字的商業發票三份，註明合同號。"},{"english":"Commercial invoice is a document.","chinese":"商業發票是一種單證。"},{"english":"Commercial Values must have full description of contents and itemised values.","chinese":"商業發票中必須清晰顯示快件的具體描述及單件價值。"}],"related":[]}