{"definition":["mute\/muted\/a dumb person\/to be dumb"],"pinyin":["ya3 ba5"],"simplified":["哑巴"],"rank":25287.0,"normalized_rank":0.3537979376827613,"fraction":0.0000014428428639033375,"cumulative_fraction":0.984709992284158,"word":"啞巴","characters":[{"definition":["(onom.) sound of cawing\/sound of infant learning to talk\/variant of 呀[ya1]","dumb\/mute\/hoarse\/husky\/unexploded (of artillery shell etc)"],"pinyin":["ya1","ya3"],"word":"啞"},{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"}],"containing_words":[{"definition":["pent-up unspoken grievances\/suffering not willingly or possibly spoken of"],"pinyin":["ya3 ba5 kui1"],"word":"啞巴虧"},{"definition":["no choice but to suffer in silence (idiom)\/also written 啞巴吃黃蓮|哑巴吃黄莲\/(often precedes 有苦說不出|有苦说不出[you3 ku3 shuo1 bu5 chu1])"],"pinyin":["ya3 ba5 chi1 huang2 lian2"],"word":"啞巴吃黃連"},{"definition":["to be forced to suffer in silence\/unable to speak of one's bitter suffering"],"pinyin":["chi1 ya3 ba5 kui1"],"word":"吃啞巴虧"},{"definition":["no choice but to suffer in silence (idiom)\/also written 啞巴吃黃連|哑巴吃黄连\/(often precedes 有苦說不出|有苦说不出[you3 ku3 shuo1 bu5 chu1])"],"pinyin":["ya3 ba5 chi1 huang2 lian2"],"word":"啞巴吃黃蓮"},{"definition":["to be forced to suffer in silence (idiom)\/unable to speak of one's bitter suffering\/sometimes written 啞子吃黃連，有苦說不出|哑子吃黄连，有苦说不出"],"pinyin":["ya3 ba5 chi1 huang2 lian2 , you3 ku3 shuo1 bu5 chu1"],"word":"啞巴吃黃連，有苦說不出"}],"sentences":[{"english":"I'm a mute, and had been communicating with him via pen and paper during the entire checkout process.","chinese":"我是個啞巴，至始至終都在用紙筆跟他交流。"},{"english":"Most people don't dumb till they start talkin'.","chinese":"大多數人一開口便成爲啞巴。"},{"english":"The learning effect is obvious to all, there's no lack of dummy English learners.","chinese":"其效果是有目共睹的，啞巴英語不乏其人。"},{"english":"If love need to be interpretated by words, how do the dumbs fall in love then?","chinese":"如果愛需要表達，那麼啞巴怎麼談戀愛呢？"},{"english":"Later in his life he hand 3 sons-all were mute.","chinese":"後來生了三個孩子都是啞巴。"},{"english":"Working with a dumb is obviously difficult.","chinese":"和啞巴一起工作，明顯是困難的。"},{"english":"Sister is already dumb, and it still fails I eat Coptis?","chinese":"姐經已係啞巴咗，唔通還得食黃連唔成？"},{"english":"Forgive me a dumb not to tell the truth.","chinese":"原諒我是個啞巴不會說心裏話。"},{"english":"However, you should not speak at all until those mantles are made completely.","chinese":"但是在編織完之前你要成爲啞巴，無法說話。"},{"english":"All day loaded dumb, let alone eat, I am afraid, are also more likely than life.","chinese":"整天裝啞巴，別說是喫飯，恐怕連命也保不住。"},{"english":"If you have not heard off, to really become a \"dumb English.\"","chinese":"如果聽說關過不了，就真的成了“啞巴英語”。"},{"english":"And dumb, let's have some more dumb.","chinese":"又啞巴，讓我們有更多的啞口無聲。"},{"english":"However, we English and French students were like mutes .","chinese":"而我們英法專業的學生一個個像個啞巴。"},{"english":"And I drink coptis, also can't speak the bitterness.","chinese":"啞巴喫黃連，有苦說不出。"},{"english":"I have paralysed in bed for about ten years, and become to a undoubted dummy.","chinese":"我已癱瘓在牀數十載，還成了名副其實的啞巴。"},{"english":"Only the dumb envy the talkative.","chinese":"只有啞巴才妒忌多嘴的人。"}],"related":[{"definition":["offal\/mixed entrails\/trivial matters"],"pinyin":["za2 sui4"],"word":"雜碎"},{"definition":["to be made to stand still as a punishment"],"pinyin":["fa2 zhan4"],"word":"罰站"},{"definition":["Shut up!\/same as 閉上嘴巴|闭上嘴巴"],"pinyin":["bi4 zui3"],"word":"閉嘴"},{"definition":["unpleasant talk\/malicious words"],"pinyin":["huai4 hua4"],"word":"壞話"},{"definition":["to beg forgiveness"],"pinyin":["qiu2 rao2"],"word":"求饒"},{"definition":["rooster\/cock\/(slang) (Cantonese) to visit a prostitute"],"pinyin":["jiao4 ji1"],"word":"叫雞"},{"definition":["impossible\/can't be done\/no can do\/unable to accomplish"],"pinyin":["ban4 bu5 dao4"],"word":"辦不到"},{"definition":["to contradict (elders or superiors)"],"pinyin":["ding3 zhuang4"],"word":"頂撞"},{"definition":["(coll.) old man\/(said of an aging husband) my old man"],"pinyin":["lao3 tou2 zi5"],"word":"老頭子"},{"definition":["to resign oneself to adversity (idiom); to grin and bear it\/to submit meekly to insults, maltreatment, humiliation etc"],"pinyin":["ni4 lai2 shun4 shou4"],"word":"逆來順受"},{"definition":["to open one's mouth (to speak, esp. to make a request)\/to gape"],"pinyin":["zhang1 zui3"],"word":"張嘴"},{"definition":["to act shamelessly\/to refuse to acknowledge that one has lost the game, or made a promise etc\/to act dumb\/to act as if sth never happened"],"pinyin":["shua3 lai4"],"word":"耍賴"},{"definition":["to order sb about\/to use sb"],"pinyin":["shi3 huan4"],"word":"使喚"},{"definition":["deaf person"],"pinyin":["long2 zi5"],"word":"聾子"},{"definition":["in the right and self-confident (idiom); bold and confident with justice on one's side\/to have the courage of one's convictions\/just and forceful"],"pinyin":["li3 zhi2 qi4 zhuang4"],"word":"理直氣壯"},{"definition":["to fly into a rage out of humiliation\/to be ashamed into anger (idiom)"],"pinyin":["nao3 xiu1 cheng2 nu4"],"word":"惱羞成怒"}]}