{"definition":["see 咖啡廳|咖啡厅[ka1 fei1 ting1]"],"pinyin":["fei1 ting1"],"simplified":["啡厅"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"啡廳","characters":[{"definition":["(phonetic component)"],"pinyin":["fei1"],"word":"啡"},{"definition":["(reception) hall\/living room\/office\/provincial government department"],"pinyin":["ting1"],"word":"廳"}],"containing_words":[{"definition":["coffee shop"],"pinyin":["ka1 fei1 ting1"],"word":"咖啡廳"}],"sentences":[{"english":"Outside the shoe store. Near the cafe.","chinese":"但是今天我又看到他，在鞋店外面，咖啡廳附近。"},{"english":"Would you go to an English-speaking coffee house if one were available?","chinese":"如果廈門有一個全英語環境的咖啡廳，你想去嗎？"},{"english":"He falls in love with a waitress in the coffee-house.","chinese":"他愛上了咖啡廳的一個女服務員。"},{"english":"Opening the cafè would clearly attract more customers.","chinese":"開設咖啡廳顯然能吸引更多的顧客。"},{"english":"Assume, there is also that fashionable lady at the cafe.","chinese":"設想，有個時尚女性在咖啡廳。"},{"english":"A meal at the Real Café Bernabéu Restaurant.","chinese":"伯納烏飯店皇家咖啡廳的一頓餐飲。"},{"english":"Don’t miss the Seawall Café, one block up from the state beach.","chinese":"不要錯過距海灘只有一個街區的海堤咖啡廳。"},{"english":"Vienna is also world-renown for its coffee houses.","chinese":"當然，久負盛名的咖啡廳也令維也納聞名於世。"},{"english":"but you also have really good bars and cafes and restaurants around there.","chinese":"你也能看到真正好的酒吧和咖啡廳，還有餐廳在附近。"},{"english":"Inspection 12 Live at Jacksonville Florida's Freebird Cafe. out of my League (ending).","chinese":"住在佛羅里達州傑克遜維爾的自由鳥咖啡廳檢查12。"},{"english":"Mediterranean-style cafe style Southeast Asian cuisine with classic dishes.","chinese":"咖啡廳提供地中海式風情美食與經典東南亞美食。"},{"english":"The cafè would require relatively little space.","chinese":"咖啡廳所需的空間相對較小。"},{"english":"The third floor of a French cafe and the Korean barbecue restaurant.","chinese":"三樓有一家法式咖啡廳和韓國燒烤餐廳。"},{"english":"Tan, who herself works the afternoon shift at a French-style cafe in the national capital.","chinese":"譚建英自己則每天下午在北京一家法式咖啡廳打工。"},{"english":"I met Laetitia and her husband in the Shangdao Coffee House in the Maples International Shopping Centre.","chinese":"在楓蘭國際的上島咖啡廳我見到了李霽霞和她的老公。"},{"english":"Hatoyama said he came up with the idea himself.","chinese":"鳩山說開咖啡廳是他自己的點子。"}],"related":[]}