{"definition":["Kanas Lake in Xinjiang"],"pinyin":["Ka1 na4 si1 Hu2"],"simplified":["喀纳斯湖"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"喀納斯湖","characters":[{"definition":["(onom.) sound of coughing or vomiting"],"pinyin":["ka1"],"word":"喀"},{"definition":["surname Na","to receive\/to accept\/to enjoy\/to bring into\/to pay (tax etc)\/nano- (one billionth)\/to reinforce sole of shoes or stockings by close sewing"],"pinyin":["Na4","na4"],"word":"納"},{"definition":["(phonetic)\/this","Slovakia\/Slovak\/abbr. for 斯洛伐克[Si1 luo4 fa2 ke4]"],"pinyin":["Si1","si1"],"word":"斯"},{"definition":["lake\/CL:個|个[ge4],片[pian4]"],"pinyin":["hu2"],"word":"湖"}],"containing_words":[],"sentences":[{"english":"Under the sunshine, the water of Kanas Lake is resplendent with colors.","chinese":"你看，在陽光的照射下，喀納斯湖的湖水流光異彩。"},{"english":"Kanas Lake is located in Northern Xinjiang, China, forceful Johnson show, picturesque.","chinese":"喀納斯湖位於中國新疆北部，雄渾嬌秀，風景如畫。"},{"english":"Why does the color of the Kanas Lake water change?","chinese":"喀納斯湖的湖水爲什麼會變色呢？"},{"english":"But I believe this is just the mysterious part of Kanas Lake.","chinese":"不過我想這可能就是喀納斯湖的神祕之處吧。"},{"english":"Oh, I am full of expectations of Kanas Lake.","chinese":"哎呀，我對喀納斯湖可是充滿期待。"},{"english":"Kanas Lake's most salient features.","chinese":"喀納斯湖最明顯的一個神祕特徵。"},{"english":"Let's take a trip to the mysterious Kanas Lake.","chinese":"讓我們去尋訪神祕的喀納斯湖吧。"},{"english":"You thought it's all over after seeing the lake?","chinese":"你以爲看完了喀納斯湖就完事了？"},{"english":"Just wanted to share a few photos we took when we were filming in Buerjin and Kanas Lake.","chinese":"一下在布爾津和喀納斯湖錄節目時拍的照片。"},{"english":"The breathtaking landscape is located in Burerjin County of Aletai area in Xinjiang Uygur Autonomous Region.","chinese":"喀納斯湖位於新疆阿勒泰地區布爾津縣。"},{"english":"That's the first wooden bridge in the Kanas Lake area.","chinese":"那就是號稱喀納斯湖第一橋的木橋。"},{"english":"We'll reach Kanas Lake tomorrow.","chinese":"明天我們就會到達喀納斯湖。"},{"english":"This is the upstream part of the lake.","chinese":"這裏是喀納斯湖的上游。"},{"english":"That's what is so mysterious about Lake Kanas.","chinese":"這就是喀納斯湖的神祕之處。"},{"english":"After crossing over mountains and wading through rivers, Daniel and I have finally arrived at the beautiful Kanas Lake.","chinese":"我和大牛跋山涉水終於來到了美麗的喀納斯湖。"},{"english":"The formation of the Kanas Lake is closely related to the glacial erosion and dam during the Last Glacial.","chinese":"喀納斯湖的形成與末次冰期冰川作用關係密切。"}],"related":[]}