{"definition":["to deal with the aftermath (arising from an accident)\/funeral arrangements\/reparations"],"pinyin":["shan4 hou4"],"simplified":["善后"],"rank":9389.0,"normalized_rank":0.13136429141074252,"fraction":0.000009205057194659716,"cumulative_fraction":0.9243820911171338,"word":"善後","characters":[{"definition":["good (virtuous)\/benevolent\/well-disposed\/good at sth\/to improve or perfect"],"pinyin":["shan4"],"word":"善"},{"definition":["back\/behind\/rear\/afterwards\/after\/later\/post-"],"pinyin":["hou4"],"word":"後"}],"containing_words":[{"definition":["reconstruction loan provided by Great Powers to Yuan Shikai in 1913"],"pinyin":["shan4 hou4 jie4 kuan3"],"word":"善後借款"}],"sentences":[{"english":"To work with pertinent institutions to prepare funerals for deceased retired cadres and take charge of cadres' posthumous affairs.","chinese":"會同有關部門辦理離退休幹部的喪葬和善後處理事宜。"},{"english":"Unclaimed bodies of the victims, such as rehabilitation work is under way.","chinese":"遇難者遺體認領等善後工作也正在展開。"},{"english":"The two sides will keep close contacts and cooperation to appropriately handle the aftermath.","chinese":"雙方表示將就妥善處理善後事宜保持密切聯繫與合作。"},{"english":"Hygienic fight-flight reaction damage control processing.","chinese":"衛生應急反應的善後處理。"},{"english":"Fourthly, the works of rescue injured and rehabilitation dead people were done with all our strength.","chinese":"四是全力做好受傷人員搶救和遇難人員善後事宜。"},{"english":"Relevant follow-up work is underway.","chinese":"目前相關善後工作正在進行。"},{"english":"BP is hiring local fishing boats to help in oil clean-up efforts.","chinese":"英國石油公司目前亦僱用了當地漁船幫忙處理善後。"},{"english":"This old gentleman is to deal with the aftermath of the traffic accident.","chinese":"這位老先生負責處理這次車禍的善後工作。"},{"english":"Also through reading your book I've learnt things they never tell you about aftercare in the Studio.","chinese":"書中還通過閱讀我學到的東西，沒告訴你善後的畫室。"},{"english":"Although, this takes place automatically, you must still carry out the aftercare recommendations.","chinese":"雖然，這需要自動進行，您仍然必須進行善後的建議。"},{"english":"Currently, relevant departments under way deal with the aftermath.","chinese":"目前，有關部門正在進行善後處理。"},{"english":"In-centre treatment is followed by 12 months of statutory after-care supervision.","chinese":"吸毒犯獲釋後，尚須接受法定善後監管12個月。"},{"english":"Handling public crisis is an important link in crisis management.","chinese":"公共危機善後處理是危機管理的一個重要環節。"},{"english":"This way, you will be in a much better place during the end game part of your release.","chinese":"這樣，在發行版的善後工作中，您會更加輕鬆。"},{"english":"Competent Chinese authorities attach great importance to searching and rescuing the crew members and handling the aftermath.","chinese":"中方有關部門高度重視對遇險船員的搜救和善後工作。"}],"related":[{"definition":["after the event\/in hindsight\/in retrospect"],"pinyin":["shi4 hou4"],"word":"事後"},{"definition":["sometime\/someday (in the future)"],"pinyin":["ri4 hou4"],"word":"日後"},{"definition":["to evade\/to shirk"],"pinyin":["tui1 tuo1"],"word":"推脫"},{"definition":["to take care of\/to raise money\/to attend to (guests, customers etc)"],"pinyin":["zhang1 luo5"],"word":"張羅"},{"definition":["to watch with folded arms (idiom); to look on without lifting a finger"],"pinyin":["xiu4 shou3 pang2 guan1"],"word":"袖手旁觀"},{"definition":["internal affairs\/domestic affairs\/family affairs\/(trad.) affairs within the palace"],"pinyin":["nei4 wu4"],"word":"內務"},{"definition":["future events\/and what happened next... (in fiction)\/funeral arrangements"],"pinyin":["hou4 shi4"],"word":"後事"},{"definition":["appropriate\/proper\/ready"],"pinyin":["tuo3 dang5"],"word":"妥當"},{"definition":["as for\/as to\/to go so far as to"],"pinyin":["zhi4 yu2"],"word":"至於"},{"definition":["workplace overseer\/foreman"],"pinyin":["jian1 gong1"],"word":"監工"},{"definition":["to tidy up (dialect)"],"pinyin":["zhi2 shi2"],"word":"執拾"},{"definition":["to reconcile\/to mediate\/to bring warring parties to agreement\/to arbitrate"],"pinyin":["tiao2 ting2"],"word":"調停"},{"definition":["to deceive\/to conceal"],"pinyin":["man2 pian4"],"word":"瞞騙"},{"definition":["to arouse dislike\/to incur hatred"],"pinyin":["jie2 yuan4"],"word":"結怨"},{"definition":["party affairs\/work within the Communist party"],"pinyin":["dang3 wu4"],"word":"黨務"},{"definition":["to decline\/to avoid\/shirking responsibilities\/to blame others\/to pass the buck\/to unload one's responsibilities\/to try to get out of a task"],"pinyin":["tui1 wei3"],"word":"推諉"}]}