{"definition":["laryngoscope"],"pinyin":["hou2 jing4"],"simplified":["喉镜"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"喉鏡","characters":[{"definition":["throat\/larynx"],"pinyin":["hou2"],"word":"喉"},{"definition":["mirror\/lens"],"pinyin":["jing4"],"word":"鏡"}],"containing_words":[],"sentences":[{"english":"ObjectiveTo compare the effect of the normal frequency jet ventilation with the high frequency jet ventilation in suspension laryngoscopy.","chinese":"比較常頻通氣與高頻通氣在支撐喉鏡手術前應用效果。"},{"english":"I have a friend who recently underwent a laryngoscopy.","chinese":"有位朋友最近做了喉鏡檢查。"},{"english":"To investigate the value of vocal fold abduction for bilateral vocal cord paralysis through the suspension laryngoscopy.","chinese":"目的探討支撐喉鏡下聲帶外展術對聲帶麻痹的療效。"},{"english":"Objective:To explore the operating method of broad-based via fibre laryngoscope vocal polyp.","chinese":"目的探討纖維喉鏡下廣基聲帶息肉的手術方式。"},{"english":"The Laryngeal microsurgery under laryngoscope is an advanced technique.","chinese":"支撐喉鏡下很顯微手術是現代醫學的先進技術。"},{"english":"After intravenous anesthesia induction, orotracheal intubation was performed using the direct laryngoscope.","chinese":"靜脈麻醉誘導後採用直接喉鏡實施經口氣管插管。"},{"english":"CTVL is a good complementary method of laryngoscopy.","chinese":"CTVL是纖維喉鏡的很好補充手段。"},{"english":"OBJECTIVE To analyze the complications of the CO2 laser-assisted laryngeal microsurgery for laryngeal tumors.","chinese":"目的分析支撐喉鏡下CO2激光喉腫瘤手術的併發症。"},{"english":"Methods Semiconductor laser was acted with fiberoptic laryngoscope to treat 26 cses with laryngopharynx hemangioma.","chinese":"方法纖維喉鏡下半導體激光治療咽喉部血管瘤26例。"},{"english":"The nurse handed him the laryngoscope with which to visualize the vocal cords before inserting the breathing tube into the lungs.","chinese":"護士遞給他喉鏡，以便他在插入氣管導管前暴露聲帶。"}],"related":[]}