{"definition":["to waken (to action)\/to rouse (the masses)\/to evoke (attention, recollection etc)"],"pinyin":["huan4 qi3"],"simplified":["唤起"],"rank":13586.0,"normalized_rank":0.19008576665314172,"fraction":0.000004930540324888621,"cumulative_fraction":0.9526527823874386,"word":"喚起","characters":[{"definition":["to call"],"pinyin":["huan4"],"word":"喚"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"Fire insurance may be sold by appealing to fear of loss.","chinese":"火險可能是通過喚起對損失的恐懼而售出的。"},{"english":"The scene awakens reminiscences of my youth.","chinese":"這景象喚起我年輕時的往事。"},{"english":"The horse brings out human feelings the way machines cannot do.","chinese":"馬能喚起人類的情感，機械則不能。"},{"english":"He whispered something in the old man's ears to jog his memory.","chinese":"他向那位老人耳語了幾句，以喚起他的回憶。"},{"english":"And Shen who get along, aroused the feelings of the Chinese man Shen shen.","chinese":"和沈凡的相處，喚起了曼華對沈凡的情感。"},{"english":"He roused the masses with his oratory .","chinese":"他以其雄辯術喚起民衆。"},{"english":"The breath-potential gets aroused.","chinese":"氣的潛勢被喚起。"},{"english":"One is reminded of the idealized image of feudal Europe presented by latter-day conservative Catholics such as G.","chinese":"這喚起了我們對中世紀歐洲的理想化印象，它在G。"},{"english":"Liu Cixin's writing evokes the thrill of exploration and the beauty of scale.","chinese":"劉慈欣的作品喚起了人們對探索和宏觀之美的興奮感。"},{"english":"The studies of Foucault and New Historicism have aroused people's awareness of the discourse of power.","chinese":"福柯和新歷史主義批評喚起了人們對權力話語的覺醒。"},{"english":"The conscious mind is complicit in it, but a lot of sexual arousal goes on in the sympathetic nervous system.","chinese":"顯意識與此相關，但許多性喚起受交感神經系統控制。"},{"english":"Handsome architecture evokes Irish tradition and contemporary chic.","chinese":"恆順建築喚起愛爾蘭傳統與當代時尚。"},{"english":"All civilization ought to be aroused against war.","chinese":"應喚起整個文明世界來反對戰爭。"},{"english":"Does the smell of fresh-baked cookies bring you back to your childhood?","chinese":"剛出爐的麪包是否常喚起你童年的回憶？"},{"english":"Think about related words and phrases that evoke the feelings you want.","chinese":"想一想能夠喚起你想要的感覺的相關詞彙。"},{"english":"The old movie evoked the memory of his childhood.","chinese":"這部舊電影喚起他童年時的回憶。"}],"related":[{"definition":["to wake sb\/to rouse"],"pinyin":["huan4 xing3"],"word":"喚醒"},{"definition":["to arouse\/to excite"],"pinyin":["ji1 fa1"],"word":"激發"},{"definition":["resonance (physics)\/sympathetic response to sth"],"pinyin":["gong4 ming2"],"word":"共鳴"},{"definition":["to pass through\/to penetrate\/by means of\/via"],"pinyin":["tou4 guo4"],"word":"透過"},{"definition":["to promote\/to enhance\/to further\/to advance (a cause etc)"],"pinyin":["zeng1 jin4"],"word":"增進"},{"definition":["feelings\/mood"],"pinyin":["qing2 huai2"],"word":"情懷"},{"definition":["to appeal\/to demand (an answer)\/requirement\/demand\/claim\/appeal\/(marketing) message"],"pinyin":["su4 qiu2"],"word":"訴求"},{"definition":["care\/solicitude\/to show care for\/concerned about\/attentive to"],"pinyin":["guan1 huai2"],"word":"關懷"},{"definition":["consciousness\/awareness\/to be aware\/to realize"],"pinyin":["yi4 shi2"],"word":"意識"},{"definition":["to hope\/to expect\/expectation(s)"],"pinyin":["qi1 xu3"],"word":"期許"},{"definition":["to remember\/to recall\/memory\/CL:個|个[ge4]"],"pinyin":["ji4 yi4"],"word":"記憶"},{"definition":["to touch\/to stir up (trouble or emotions)\/to move (sb's emotions or worry)"],"pinyin":["chu4 dong4"],"word":"觸動"},{"definition":["to encourage\/to urge\/motivation\/incentive"],"pinyin":["ji1 li4"],"word":"激勵"},{"definition":["to express\/to convey"],"pinyin":["biao3 da2"],"word":"表達"},{"definition":["cognition\/cognitive\/understanding\/perception\/awareness\/to be cognizant of\/to recognize\/to realize"],"pinyin":["ren4 zhi1"],"word":"認知"},{"definition":["to recreate\/to reconstruct (a historical relic)"],"pinyin":["zai4 xian4"],"word":"再現"}]}