{"definition":["to have mixed feelings (about sth)"],"pinyin":["xi3 you1 can1 ban4"],"simplified":["喜忧参半"],"rank":27275.0,"normalized_rank":0.38161263693982345,"fraction":0.0000012060671531332835,"cumulative_fraction":0.9873352425393894,"word":"喜憂參半","characters":[{"definition":["to be fond of\/to like\/to enjoy\/to be happy\/to feel pleased\/happiness\/delight\/glad"],"pinyin":["xi3"],"word":"喜"},{"definition":["to worry\/to concern oneself with\/worried\/anxiety\/sorrow\/(literary) to observe mourning"],"pinyin":["you1"],"word":"憂"},{"definition":["ginseng\/one of the 28 constellations","three (banker's anti-fraud numeral)","to take part in\/to participate\/to join\/to attend\/to counsel\/unequal\/varied\/irregular\/uneven\/not uniform\/abbr. for 參議院|参议院 Senate, Upper House"],"pinyin":["can1","san1","shen1"],"word":"參"},{"definition":["half\/semi-\/incomplete\/(after a number) and a half"],"pinyin":["ban4"],"word":"半"}],"containing_words":[],"sentences":[{"english":"But this year, their homecoming has been bittersweet.","chinese":"但今年他們回家的心情卻是喜憂參半。"},{"english":"So far, China's efforts to rein in its roaring energy use have been mixed.","chinese":"目前爲止，中國節能降耗努力所取得的成效喜憂參半。"},{"english":"As a matter of fact , the result that the computer brings to the art design is both worried and glad .","chinese":"事實上，電腦對於美術設計帶來的結果是喜憂參半。"},{"english":"Some key indicators paint a mixed picture of the U.S. economy on Friday.","chinese":"星期五，美國經濟的幾個關健指標令人喜憂參半。"},{"english":"She and her counterparts had mixed feelings about the price rise.","chinese":"王春麗和她的同行對價格上漲喜憂參半。"},{"english":"Investment in mining in Africa has a mixed history and we should learn from it.","chinese":"非洲的礦業投資史喜憂參半，我們須從中汲取教訓。"},{"english":"Official efforts to lure manufacturers away from the coast have had mixed results.","chinese":"政府努力吸引製造企業遷離沿海地區，結果喜憂參半。"},{"english":"The data on how an economic downturn influences an individual’s health are surprisingly mixed.","chinese":"有關經濟衰退影響個人健康的數據竟然喜憂參半。"},{"english":"There are both strong point and week point in teacher resource for adult education in high institutes.","chinese":"當前高校成教師資隊伍的現狀是喜憂參半。"},{"english":"In Africa, too, science for development has been a mixed story.","chinese":"在非洲，科學促進發展也是一個喜憂參半的故事。"},{"english":"Real returns also appear to be mixed.","chinese":"實際收益似乎也是喜憂參半。"},{"english":"Currently, we are seeing a mixed picture in the international non-proliferation field.","chinese":"當前，國際防擴散形勢喜憂參半。"},{"english":"Like his co-star LeBlanc, Perry has something of a chequered love life.","chinese":"就象雷布朗一樣，派瑞的愛情生活也是喜憂參半。"}],"related":[]}