{"definition":["to dress up in disguise (idiom); to pretend for the purpose of deceit"],"pinyin":["qiao2 zhuang1 da3 ban4"],"simplified":["乔装打扮"],"rank":37489.0,"normalized_rank":0.5245197487162985,"fraction":4.852296316890625e-7,"cumulative_fraction":0.9954000892194538,"word":"喬裝打扮","characters":[{"definition":["surname Qiao","tall"],"pinyin":["Qiao2","qiao2"],"word":"喬"},{"definition":["adornment\/to adorn\/dress\/clothing\/costume (of an actor in a play)\/to play a role\/to pretend\/to install\/to fix\/to wrap (sth in a bag)\/to load\/to pack"],"pinyin":["zhuang1"],"word":"裝"},{"definition":["dozen (loanword)","to beat\/to strike\/to hit\/to break\/to type\/to mix up\/to build\/to fight\/to fetch\/to make\/to tie up\/to issue\/to shoot\/to calculate\/to play (a game)\/since\/from"],"pinyin":["da2","da3"],"word":"打"},{"definition":["to disguise oneself as\/to dress up\/to play (a role)\/to put on (an expression)"],"pinyin":["ban4"],"word":"扮"}],"containing_words":[],"sentences":[{"english":"Young kids often dress up and have fun at Halloween.","chinese":"萬聖節前夜，小孩子通常都喬裝打扮，玩得很開心。"},{"english":"Nobody knows me in that motorbike. I'm in disguise.","chinese":"開那車沒人認識我，我喬裝打扮了一番。"},{"english":"So the dream to disguise herself to the dreamer not understand form.","chinese":"於是夢要喬裝打扮，以夢者看不懂的形式出現。"},{"english":"So far, the distant person that disguise dresses up is bow-backed show a body eventually.","chinese":"至此，喬裝打扮的遼人駝背終於現身。"},{"english":"He even came here in disguise.","chinese":"他是喬裝打扮跟過來的。"},{"english":"The thief disguised himself as a policeman.","chinese":"那賊喬裝打扮成警察。"},{"english":"They have organized③ games and the staff dress up as④ clowns.","chinese":"他們已經組織遊戲，並且職員們也喬裝打扮成小丑。"},{"english":"He went into the ballroom in disguise.","chinese":"他喬裝打扮了一下就混進了舞廳。"},{"english":"Dress up as Monkey King.","chinese":"喬裝打扮成猴王。"},{"english":"They disguise foppery to make every effort to scare people.","chinese":"他們喬裝打扮極力去嚇唬人們。"},{"english":"He must be a prince in disguise .","chinese":"他定是個喬裝打扮的王子嘍。"},{"english":"I can make up and disguise myself here .","chinese":"我可以喬裝打扮一下。"}],"related":[]}