{"definition":["apartment"],"pinyin":["dan1 yuan2 fang2"],"simplified":["单元房"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"單元房","characters":[{"definition":["bill\/list\/form\/single\/only\/sole\/odd number\/CL:個|个[ge4]","surname Shan"],"pinyin":["Shan4","dan1"],"word":"單"},{"definition":["currency unit (esp. Chinese yuan)\/first\/original\/primary\/fundamental\/constituent\/part\/era (of a reign)\/meta- (prefix)\/(math.) argument\/variable\/(Tw) (geology) eon","surname Yuan\/the Yuan or Mongol dynasty (1279-1368)"],"pinyin":["Yuan2","yuan2"],"word":"元"},{"definition":["house\/room\/CL:間|间[jian1]\/branch of an extended family\/classifier for family members (or concubines)","surname Fang"],"pinyin":["Fang2","fang2"],"word":"房"}],"containing_words":[],"sentences":[{"english":"But developers have little incentive to build less-profitable units for low-income households.","chinese":"但開發商不願爲低收入家庭建造低利潤的單元房。"},{"english":"He's looking for a flat.","chinese":"他正在尋購一套單元房。"},{"english":"They have a comfortable flat.","chinese":"他們有一套舒服的單元房。"},{"english":"We have one or two and three bedroom apartments available.","chinese":"我們有一居或兩居和三居室的單元房。"},{"english":"Although the apartment is not big enough, it can meet the young people's need.","chinese":"那套單元房不大，但是能滿足小倆口的需要。"},{"english":"I should require that your company provide me with an apartment.","chinese":"本人要求貴公司給我提供一套單元房。"},{"english":"Mr. Wang bought a flat of five rooms.","chinese":"王先生買了一套有五間屋子的單元房。"},{"english":"Developers are currently not allowed to pre-sell units in new buildings until the roof is on.","chinese":"現在房子封頂前不允許開發商們預售單元房。"},{"english":"Units are now being marketed at heavily reduced prices.","chinese":"如今，單元房正在以大幅縮水的價格被推銷給客戶。"},{"english":"Nidal Malik Hasan went to his next-door neighbor at the rundown apartment complex where he rented a one-bedroom unit and gave her most of his belongings, saying he would not need them any more.","chinese":"他在這座破舊的公寓樓裏租有一個一居室的單元房。"},{"english":"They moved into a new apartment.","chinese":"他們搬進一套新單元房。"},{"english":"She is buying a flat close to her office.","chinese":"她正在購買一套靠近她辦公室的單元房。"},{"english":"Many large old houses have now been converted into flats.","chinese":"許多舊的大房子都己改建成了單元房。"}],"related":[]}