{"definition":["(spreadsheet) cell"],"pinyin":["dan1 yuan2 ge2"],"simplified":["单元格"],"rank":35976.0,"normalized_rank":0.5033509157304157,"fraction":5.550069373290661e-7,"cumulative_fraction":0.9946149522028156,"word":"單元格","characters":[{"definition":["bill\/list\/form\/single\/only\/sole\/odd number\/CL:個|个[ge4]","surname Shan"],"pinyin":["Shan4","dan1"],"word":"單"},{"definition":["currency unit (esp. Chinese yuan)\/first\/original\/primary\/fundamental\/constituent\/part\/era (of a reign)\/meta- (prefix)\/(math.) argument\/variable\/(Tw) (geology) eon","surname Yuan\/the Yuan or Mongol dynasty (1279-1368)"],"pinyin":["Yuan2","yuan2"],"word":"元"},{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"}],"containing_words":[],"sentences":[{"english":"Clicking a cell or a row header selects the full row.","chinese":"單擊單元格或行標題可以選擇整行。"},{"english":"Elements on your page do not have to be confined to individual grid units. In a five-column grid, 5 narrow columns of text can be hard to read.","chinese":"你無須強制你頁面上的元素都限制於單個單元格。"},{"english":"But what data does each cell hold?","chinese":"但是每個單元格存有什麼數據呢？"},{"english":"You can edit the name and type of the key by clicking on the cell.","chinese":"可以通過單擊單元格編輯鍵名和類型。"},{"english":"SetCell: Set a value into a cell on one of the workbook's sheets.","chinese":"對工作薄中某一工作表上的單元格設置值。"},{"english":"You don't have to fill every little grid unit.","chinese":"你也不需要填滿每一個小單元格。"},{"english":"In this conversion, many of the code lists have empty cells.","chinese":"在這個轉換中，許多代碼清單都具有空單元格。"},{"english":"Gets the zero-based row index of the cell.","chinese":"獲取單元格的從零開始的行索引。"},{"english":"Next, you need to fill in the remaining cells.","chinese":"接下來，需要填充餘下的單元格。"},{"english":"If you double-click a worksheet cell, the cell changes to edit mode.","chinese":"當雙擊工作表單元格時，該單元格將切換到編輯模式。"},{"english":"If you double-click a worksheet cell, the cell changes to edit mode.","chinese":"當雙擊工作表單元格時，該單元格將切換到編輯模式。"},{"english":"The modification for cells in Spreadsheet 3 was made due to my wrong fill-out.","chinese":"調整的表3中的單元格部分是由於我填錯了。"},{"english":"You can only merge two rows when number of cells and sizes are the same.","chinese":"單元格數目和大小相同時，只能合併兩行。"},{"english":"Spacing is the space between boundaries of neighboring cells.","chinese":"間隔指的是相鄰單元格間的邊界。"},{"english":"There is an experimental facility for cell-writeback.","chinese":"有一個單元格回寫的實驗工具。"},{"english":"The cell contents, both in text content and color, are reused across the matrix.","chinese":"單元格內容，包括文本內容和顏色，都在矩陣中重用。"}],"related":[]}