{"definition":["microcontroller\/one-chip computer"],"pinyin":["dan1 pian4 ji1"],"simplified":["单片机"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"單片機","characters":[{"definition":["bill\/list\/form\/single\/only\/sole\/odd number\/CL:個|个[ge4]","surname Shan"],"pinyin":["Shan4","dan1"],"word":"單"},{"definition":["disk\/sheet","thin piece\/flake\/a slice\/film\/TV play\/to slice\/to carve thin\/partial\/incomplete\/one-sided\/classifier for slices, tablets, tract of land, area of water\/classifier for CDs, movies, DVDs etc\/used with numeral 一[yi1]: classifier for scenario, scene, feeling, atmosphere, sound etc\/Kangxi radical 91"],"pinyin":["pian1","pian4"],"word":"片"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[],"sentences":[{"english":"This text introduces a measure system based on Single chip which can monitor displacements of the paper cutter.","chinese":"介紹了一種基於單片機的切紙機位移測量系統。"},{"english":"The paper applies microprocessor technology, designs the controller of return irrigation system of geothermal water.","chinese":"本文應用單片機技術，設計實現地熱水回灌控制器。"},{"english":"An MCU-based fuzzy control technique for fiber drawing machines is developed.","chinese":"文章提出一種基於單片機的光纖拉絲機模糊控制方法。"},{"english":"Single chip 16-bit CMOS microcomputer.","chinese":"單芯片16位CMOS單片機。"},{"english":"Fully digital line switching and MCU controlled service reset timing.","chinese":"全數字化線路開關和單片機控制服務復位時間。"},{"english":"Double piece single-chip computers were kept in touch with each other by the mean of wireless communication.","chinese":"兩片單片機採用無線通信的方式進行通信。"},{"english":"Touches controls the screen, Digital demonstration, Monolithic integrated circuit control.","chinese":"觸控屏，數字顯示，單片機控制。"},{"english":"The program of the microcontroller is written in C96 language.","chinese":"單片機程序採用C96語言編制。"},{"english":"Only by the single-chip CPU chip developed from the dedicated processor.","chinese":"單片機由芯片內僅有CPU的專用處理器發展而來。"},{"english":"A new gravity-flow meter under controlling of a single chip computer is introduced.","chinese":"本文介紹了單片機控制下的一種新型重量式流量計。"},{"english":"The hardware platform of low-power consumption is designed with the low-power consumption MCU (Microprogrammed Control Unit) as the hardware core.","chinese":"以微功耗單片機爲硬件核心，設計了低功耗硬件平臺。"},{"english":"Use the technology of single-chip, this article finishes the design of systematic which tests the rotational speed of the granulator.","chinese":"運用單片機技術，完成了制粒機轉速測試系統的設計。"},{"english":"In this paper, SCM to achieve the temperature control.","chinese":"本文采用單片機來實現對溫度的控制。"},{"english":"This text introduction makes use of method and its applications that a singlechip design recovers from illness the instrument.","chinese":"本文介紹利用單片機設計康復儀的方法和它的應用。"},{"english":"The design of external counterpulsation system based on singlechip is presented.","chinese":"介紹了一種基於單片機的體外反搏系統的設計。"},{"english":"An overload relay which based on PIC single-chip microcomputer was introduced.","chinese":"介紹了基於PIC單片機的過載繼電器。"}],"related":[]}