{"definition":["single chain\/refers to RNA as opposed to the double helix DNA"],"pinyin":["dan1 lian4"],"simplified":["单链"],"rank":62587.0,"normalized_rank":0.8756733311880011,"fraction":2.6713905715733586e-8,"cumulative_fraction":0.9999025882537343,"word":"單鏈","characters":[{"definition":["bill\/list\/form\/single\/only\/sole\/odd number\/CL:個|个[ge4]","surname Shan"],"pinyin":["Shan4","dan1"],"word":"單"},{"definition":["chain\/cable (unit of length: 100 fathoms, about 185 m)\/chain (unit of length: 66 feet, about 20 m)\/to chain\/to enchain"],"pinyin":["lian4"],"word":"鏈"}],"containing_words":[],"sentences":[{"english":"Mammalian cells make only the single-stranded variety.","chinese":"哺乳動物細胞只能產生單鏈RNA。"},{"english":"Structurally, RNA is a single-stranded structure.","chinese":"從結構來看，RNA是單鏈結構。"},{"english":"C-sf22 lead single node chain and the addition of data can be deleted.","chinese":"sf22帶頭結點的單鏈表，可以刪除添加數據。"},{"english":"Objective To construct a phage display library of human single-chain Fv antibodies against blood group A substance.","chinese":"目的構建人源抗紅細胞A抗原單鏈噬菌體抗體庫。"},{"english":"This part provides two efficiency methods for ssDNA immobilization.","chinese":"該研究爲單鏈DNA的固定提供了有效的新方法。"},{"english":"Chain is one of the critical parts composing the mono- chain cold- drawing pipe mill.","chinese":"鏈條是單鏈冷拔管機的關鍵部件。"},{"english":"For containers with unique keys I store the buckets in a single-linked list.","chinese":"對於唯一鍵的容器，我將桶保存在一個單鏈表中。"},{"english":"Geminiviruses are a group of single-stranded circular DNA viruses with twinned particles occurring worldwide.","chinese":"雙生病毒是一類具有孿生顆粒的單鏈環狀DNA病毒。"},{"english":"Any of a group of enteroviruses that can cause a disease resembling poliomyelitis but without paralysis.","chinese":"病毒小，由核糖核酸單鏈構成，能在植物中引起疾病。"},{"english":"Its hyperchromic effect of slowly increasing the temperature is characterestic for single-strand RNA.","chinese":"核酸溫度熔解曲線的測定證明它是一個單鏈的RNA。"},{"english":"Individual strands of ultra-pure glass conduct light from remote sources.","chinese":"單鏈的超純玻璃從遠程來源進行光。"},{"english":"Singly linked lists are a powerful abstraction that allow you to represent numerous types of data.","chinese":"單鏈表是讓您可以描述多種類型數據的一種有效抽象。"},{"english":"The base line can be set out as a single or double chain.","chinese":"基線可作爲一條單鏈系或雙鏈系。"},{"english":"The finite-time stabilization problem of single chained system is investigated in this paper.","chinese":"主要研究了單鏈鏈式系統的有限時間鎮定問題。"}],"related":[]}