{"definition":["bacteriophage\/phage\/virus that infects bacteria"],"pinyin":["shi4 jun1 ti3"],"simplified":["噬菌体"],"rank":59644.0,"normalized_rank":0.8344969429015152,"fraction":4.408524331230351e-8,"cumulative_fraction":0.9997996697934376,"word":"噬菌體","characters":[{"definition":["to devour\/to bite"],"pinyin":["shi4"],"word":"噬"},{"definition":["germ\/bacteria\/fungus\/mold\/Taiwan pr. [jun4]","mushroom"],"pinyin":["jun1","jun4"],"word":"菌"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[],"sentences":[{"english":"It is a useful method to utilize phages in selective isolation of rare actinomyces.","chinese":"利用噬菌體是一種有效分離稀有放線菌的方法。"},{"english":"These bacteria soon burst open, spilling out enzymes and new phages.","chinese":"這些細菌很快就被脹爆，釋放酶和新的噬菌體。"},{"english":"It was possible to produce phage antibody steadily in long time.","chinese":"它能在較長時間內穩定生產噬菌體抗體。"},{"english":"The bacteriophage technique was tested to enumerate the bacterial multiplication in leaf tissues of rice.","chinese":"應用噬菌體法估測了水稻葉片中白葉枯病的增殖。"},{"english":"Conclusion Phage surface display technology is a useful method to produce human monoclonal antibody against CEA.","chinese":"結論噬菌體抗體庫技術是研製人源性單抗的有效途徑。"},{"english":"Yersinia pestis phage lysis test was an important method on differentiation between Yersinia pestis and Yersinia pseudotuberculosis.","chinese":"鼠疫噬菌體是鑑別鼠疫菌和假結核菌的重要方法之一。"},{"english":"Objective To construct a phage display library of human single-chain Fv antibodies against blood group A substance.","chinese":"目的構建人源抗紅細胞A抗原單鏈噬菌體抗體庫。"},{"english":"Objective To establish a method for the measurement of relative affinity of phage antibodies.","chinese":"目的建立一種測定噬菌體抗體相對親和力的方法。"},{"english":"New phages can develop by acquiring restriction enzymes from plasmids.","chinese":"通過從質粒獲得的限制性酶，新的噬菌體能夠生長。"},{"english":"M13 bacteriophage has been extensively applied in phage surface display technique.","chinese":"M13噬菌體已被廣泛地應用於噬菌體展示技術。"},{"english":"M13 bacteriophage has been extensively applied in phage surface display technique.","chinese":"M13噬菌體已被廣泛地應用於噬菌體展示技術。"},{"english":"Bacteriophages are viruses that attack and eat bacteria.","chinese":"噬菌體是一種攻擊併吞食細菌的病毒。"},{"english":"Three pullulanase positive recombinant phages were obtained from this library using the amylopectin and pullulan plate.","chinese":"酶切分析證明這三個重組噬菌體含有相同的酶切片段。"},{"english":"Objective Screening Streptomyces erthreus antiphage strain.","chinese":"目的篩選紅黴素鏈黴菌抗噬菌體菌株。"},{"english":"Phage induction following conjugation of a lysogenic bacterium with a nonlysogenic one.","chinese":"伴隨着溶源菌與非溶源菌接合的噬菌體誘導。"},{"english":"Bacteriophage has been used to treat bacterial infections since it was discovered.","chinese":"噬菌體自發現之初就被人們應用於治療各種細菌感染。"}],"related":[]}