{"definition":["to bubble out\/to squirt"],"pinyin":["pen1 yong3"],"simplified":["喷涌"],"rank":31028.0,"normalized_rank":0.4341219761308466,"fraction":8.596622445899185e-7,"cumulative_fraction":0.9911677590079804,"word":"噴湧","characters":[{"definition":["(of a smell) strong\/peak season (of a crop)\/(classifier for the ordinal number of a crop, in the context of multiple harvests)","to puff\/to spout\/to spray\/to spurt"],"pinyin":["pen1","pen4"],"word":"噴"},{"definition":["to bubble up\/to rush forth"],"pinyin":["yong3"],"word":"湧"}],"containing_words":[],"sentences":[{"english":"Water boiled up beneath the bubble, it seethed and spouted.","chinese":"球體下的海水沸騰起來，不停攪動，噴湧。"},{"english":"The first of what would turn out to be 10.8 million gal. of oil began to spew forth into the cold waters.","chinese":"1080萬加侖的原油噴湧到冰冷的海水中。"},{"english":"And where did this insane gusher of money come from?","chinese":"這些瘋狂噴湧的錢是從哪來的？"},{"english":"Blood gushed from her wound.","chinese":"鮮血從傷口噴湧而出。"},{"english":"A large amount of joy juice gushes .","chinese":"果汁的喜悅大量噴湧而出。"},{"english":"And the unseen waters' soliloquies awe me.","chinese":"看不見的泉水的噴湧使我恐懼。"},{"english":"Water sprang from the fountain.","chinese":"那口泉眼泉水噴湧。"},{"english":"When you let go of niggles and embrace gratitude instead , love springs up.","chinese":"當你丟棄了小氣轉而擁抱感激的時候，愛會噴湧而出。"},{"english":"Baotu Spring water three strands, day and night, spewing, when water containing up to several feet.","chinese":"趵突泉水分三股，晝夜噴湧，水盛時高達數尺。"},{"english":"The power of giving leads to the fountain of receiving.","chinese":"佈施的力量給我們帶來了如泉噴湧的收穫。"},{"english":"Nine of the 10 lakes are freshwater, fed by an underwater aquifer.","chinese":"10個湖泊中有九個是淡水湖，水從地下噴湧而來。"},{"english":"She must purged and through this purgation her bowels shall spew .","chinese":"她必須被淨化，經由這淨化，她的內部將噴湧。"},{"english":"The rising sun is shining with boundless radiance and holding the Huasheng people's pioneering ideal.","chinese":"初升的太陽噴湧着萬丈光芒，托起華升人創業的理想。"}],"related":[]}