{"definition":["jet plane"],"pinyin":["pen1 qi4 ji1"],"simplified":["喷气机"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"噴氣機","characters":[{"definition":["(of a smell) strong\/peak season (of a crop)\/(classifier for the ordinal number of a crop, in the context of multiple harvests)","to puff\/to spout\/to spray\/to spurt"],"pinyin":["pen1","pen4"],"word":"噴"},{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[],"sentences":[{"english":"Another flight of jets exploded through sound .","chinese":"又一隊噴氣機雷鳴般地突破了音障。"},{"english":"At one point the company bought from Nippon Airways a 727 jet.","chinese":"有一次公司從日本航空公司買了一架727型噴氣機。"},{"english":"An aircraft takeoffaided by an auxiliary jet or rocket.","chinese":"助飛用噴氣機或火箭幫助航空器起飛。"},{"english":"They are going to put a new jet into service on the new year's day.","chinese":"他們準備在新年第一天把一架心的噴氣機投入使用。"},{"english":"They will use magnetic forces or jet engines and they will ride on air.","chinese":"他們會利用磁力或噴氣機，他們會在空氣上行駛。"},{"english":"A jet planed in from the south.","chinese":"一架噴氣機從南面飛來。"},{"english":"Jet A\/C is training for acrobatics FLT at 6000m.","chinese":"噴氣機在特技飛行訓練，高度6000米。"},{"english":"Many jets have an afterburner.","chinese":"許多噴氣機都有加力燃燒室。"},{"english":"Jets coursed the area daily .","chinese":"噴氣機每天飛經那個地區。"},{"english":"The jet was in range.","chinese":"噴氣機確實在射程以內。"},{"english":"Artest compared joining the Jets to taking a pay cut to play for the Lakers two years ago.","chinese":"阿泰斯特將加盟噴氣機隊比作兩年前降薪加盟湖人。"},{"english":"Jet was also an efficient bug-zapper and a terrific \"watchdog.\"","chinese":"“噴氣機”還是個滅蟲能手和出色的“看家狗”。"},{"english":"Make sure that the air jet tubes do not protrude from the grid face.","chinese":"切記空氣噴氣機管不從柵格面孔推出。"},{"english":"Eagles may soar, but weasels don't get sucked into jet engines.","chinese":"雄鷹可以翱翔，但黃鼠狼不會被吸到噴氣機引擎裏。"},{"english":"Replace the air jets tubes if necessary.","chinese":"如果需要，替換空氣噴氣機管。"},{"english":"Jet assumed many roles as a member of our family.","chinese":"身爲家庭一員，“噴氣機”扮演多個角色。"}],"related":[]}