{"definition":["sandblasting\/abrasive blasting"],"pinyin":["pen1 sha1"],"simplified":["喷砂"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"噴砂","characters":[{"definition":["(of a smell) strong\/peak season (of a crop)\/(classifier for the ordinal number of a crop, in the context of multiple harvests)","to puff\/to spout\/to spray\/to spurt"],"pinyin":["pen1","pen4"],"word":"噴"},{"definition":["sand\/gravel\/granule\/variant of 沙[sha1]"],"pinyin":["sha1"],"word":"砂"}],"containing_words":[],"sentences":[{"english":"Frosted slides are sandblasted for marking specimens.","chinese":"磨砂的載玻片經噴砂處理以標記標本。"},{"english":"With the theory of gas-solid two-phase flow, computer simulation of sandblasting process was discussed.","chinese":"運用氣固兩相流動理論對噴砂過程進行了模擬和仿真。"},{"english":"Hydrofluoric acid-etching and sandblasting had obvious effect on ceramic surface structure.","chinese":"氫氟酸及噴砂處理對瓷表面形態改變明顯。"},{"english":"Objective : To measure the fracture resistance of teeth restored with surface sandblasted casting posts .","chinese":"研究鑄造樁表面噴砂處理對牙根抗折性能的影響。"},{"english":"The surfaces of metal plates were made by peening with glass spheres and planer.","chinese":"金屬板的表面粗糙度通過噴砂和刨牀加工控制。"},{"english":"Star Maling Epoxy Primer can be used as a corrosion resistant primer on abrasive blasted steel.","chinese":"可作爲防鏽底漆，適用於噴砂處理的鋼材表面。"},{"english":"Double frosted slides are sandblasted on one end of both sides.","chinese":"雙磨砂面在雙面的一端經過噴砂處理。"},{"english":"All areas which are not to be coated shall be protected from abrasive blast cleaning.","chinese":"應保護好所有不準備塗敷的區域不進行噴砂處理。"},{"english":"To all our friends to provide technical guidance for sandblasting .","chinese":"爲各位朋友提供噴砂技術指導。"},{"english":"After years of efforts has developed a range of sand blasting equipment.","chinese":"經過多年的努力已開發出一系列完善的噴砂設備。"},{"english":"There are 2 new well completions, that are hydraulic sand jet perforation and hydraulic slotted liner technique.","chinese":"有2項新型完井工藝，即水力噴砂射孔和水力割縫。"},{"english":"To all our friends to provide other brands of sandblasting machine maintenance services.","chinese":"爲各位朋友提供其他廠牌的噴砂機維修服務。"},{"english":"It the function of time automatic sand-blasting and point-locating.","chinese":"具備定時自動噴砂，點動定位功能。"},{"english":"Frosted slides are sandblasted on one end of one side.","chinese":"磨砂的載玻片在一面的一端經過噴砂處理。"},{"english":"On function basically as similar as ground glass, change differently grind arenaceous for gush arenaceous .","chinese":"性能上基本上與磨砂玻璃相似，不同的改磨砂爲噴砂。"},{"english":"Sand-blasting and cleaning again.","chinese":"再次噴砂並清洗。"}],"related":[]}