{"definition":["to gush\/to squirt\/to surge\/to well out\/to overflow"],"pinyin":["pen1 bo2"],"simplified":["喷薄"],"rank":52320.0,"normalized_rank":0.7320246806486366,"fraction":1.121108174299639e-7,"cumulative_fraction":0.9992555133731184,"word":"噴薄","characters":[{"definition":["(of a smell) strong\/peak season (of a crop)\/(classifier for the ordinal number of a crop, in the context of multiple harvests)","to puff\/to spout\/to spray\/to spurt"],"pinyin":["pen1","pen4"],"word":"噴"},{"definition":["meager\/slight\/weak\/ungenerous or unkind\/frivolous\/to despise\/to belittle\/to look down on\/to approach or near","see 薄荷[bo4 he5]","surname Bo","thin\/cold in manner\/indifferent\/weak\/light\/infertile"],"pinyin":["Bo2","bao2","bo2","bo4"],"word":"薄"}],"containing_words":[{"definition":["to be on the verge of eruption (idiom)\/(of the sun) to emerge in all its brilliance"],"pinyin":["pen1 bo2 yu4 chu1"],"word":"噴薄欲出"}],"sentences":[{"english":"Inspiration might come from someplace you never imagined.","chinese":"靈感可能從任何你想也想不到的地方噴薄而發。"},{"english":"If my missing spurts out, I will not tell you.","chinese":"如果我的想念噴薄而出，我不會告訴你。"},{"english":"But in the Chu culture, life can be gushing.","chinese":"但是在楚文化裏，生命是可以噴薄的。"},{"english":"A powerful current spurted out.","chinese":"一股洪流噴薄而出。"},{"english":"Her volcano belched a staggering mount of fire, smoke, and ashes.","chinese":"她的火山噴薄出讓人害怕的火花，煙霧和灰燼。"},{"english":"This power becomes available once you have changed your way of thinking.","chinese":"一旦你換個角度思考問題，這種力量將噴薄而出。"},{"english":"I couldn't hold back, tears gushing out.","chinese":"我再也控制不住，淚水噴薄而出。"},{"english":"Eventually we'll have holographic images bursting out of your TV.","chinese":"最終，我們將使全息影像在電視屏幕上噴薄而出。"},{"english":"Who knows what creative thought might come of it?","chinese":"誰知道會有怎樣的奇思妙想噴薄而出呢？"},{"english":"The sound of water and air spraying out with one giant breath into the atmosphere.","chinese":"水和空氣的聲音噴薄而來，營造了一種特定的氛圍。"},{"english":"Blood gushing out of light, the first wisp of sunshine.","chinese":"血光噴薄之後，露出清晨第一縷陽光。"},{"english":"We are greeting the rising sunrise of the year 2008.","chinese":"我們將迎來2008年噴薄而出的朝陽。"},{"english":"The rim of the sun was blazing up over a sharp horizon .","chinese":"輪廓鮮明的地平線上，一輪旭日噴薄欲出。"},{"english":"I will it, the poison could break through, blue-black , and.","chinese":"如果我願意，毒液可噴薄而出，藍黑色。"},{"english":"We are greeting the rising sunrise of the year 2007.","chinese":"我們將迎來2007年噴薄而出的朝陽。"}],"related":[]}