{"definition":["to scare away"],"pinyin":["xia4 pao3"],"simplified":["吓跑"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"嚇跑","characters":[{"definition":["to frighten\/to scare","to scare\/to intimidate\/to threaten\/(interjection showing disapproval) tut-tut\/(interjection showing astonishment)"],"pinyin":["he4","xia4"],"word":"嚇"},{"definition":["(of an animal) to paw (the ground)","to run\/to run away\/to escape\/to run around (on errands etc)\/(of a gas or liquid) to leak or evaporate\/(verb complement) away\/off"],"pinyin":["pao2","pao3"],"word":"跑"}],"containing_words":[],"sentences":[{"english":"The guy warned me that you have to knock on the door first to scatter them away.","chinese":"店員警告我說開門前最好先敲敲門，以便把它們嚇跑。"},{"english":"Also noisemakers are thought to be used at parties as a way of scaring away the evil spirits.","chinese":"而且，在生日會上發出的歡呼聲能夠嚇跑邪惡的幽靈。"},{"english":"Entrepeneurs are afraid of doing it. They're worried they're going to scare off future investors.","chinese":"創業者們害怕這麼做，可能會嚇跑未來的投資者。"},{"english":"The courgette struck the bear on the head, scaring it away","chinese":"這就是擊中黑熊頭部，並把它嚇跑的西葫蘆。"},{"english":"The sting of her tongue has scared away many pursuers .","chinese":"她出語傷人已經嚇跑了許多追求者。"},{"english":"But the litigation with Corbis scared them away.","chinese":"不過與Corbis的訴訟還是將他們嚇跑了。"},{"english":"Hardly had the leopard cat been scared away when the tiger heard the roar and came.","chinese":"驅剛剛被虎嘯嚇跑，可是老虎卻聞聲趕到了。"},{"english":"But, second, Chinaisbecoming relaxed about spooking foreign investors.","chinese":"但是，第二，中國並不擔心會嚇跑國外的投資者。"},{"english":"Keeping too much eye-contact might creep people out.","chinese":"然而過多的眼神交流也許會把人嚇跑哦。"},{"english":"But his loud voice scared the little mouse away.","chinese":"但是他的大嗓門已把小老鼠嚇跑了。"},{"english":"They think they can scare away the soldiers because they have a couple of big guns.","chinese":"他們還以爲有幾門大傢伙就可以把士兵都嚇跑。"},{"english":"The policemans approach scared the thief away.","chinese":"警察走過來，把小偷嚇跑了。"},{"english":"he would fly low, intentionally backfiring the plane and frightening away the hunters.","chinese":"他會飛得很低，故意讓飛機尾部噴火，嚇跑獵手。"},{"english":"She follows me everywhere I go and her presence scares all the fishes.","chinese":"我走到哪裏它就跟到哪裏，把魚兒都嚇跑了。"},{"english":"Some fans of the \"beautiful game\" are balking at the cost of long-haul flights and peak-price accommodations.","chinese":"一些球迷被長途飛機的票價及高昂的住宿費嚇跑了。"},{"english":"Don't speak so rudely, or you'll scare the customers away.","chinese":"說話別這麼粗魯，不然會嚇跑顧客的。"}],"related":[]}