{"definition":["to swallow\/to suppress"],"pinyin":["yan4 xia4"],"simplified":["咽下"],"rank":32822.0,"normalized_rank":0.45922236368978503,"fraction":7.335375749812092e-7,"cumulative_fraction":0.9925945691491238,"word":"嚥下","characters":[{"definition":["to swallow"],"pinyin":["yan4"],"word":"嚥"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[{"definition":["dysphagia (medicine)"],"pinyin":["yan4 xia4 kun4 nan2"],"word":"嚥下困難"}],"sentences":[{"english":"Aunt Petunia looked as though she'd just swallowed a lemon.","chinese":"帕特尼亞看起來像剛剛嚥下了一個檸檬。"},{"english":"Jack swallowed hard as he watched the black Mercedes speed away.","chinese":"傑克艱難地嚥下一口唾沫，看着黑色奔馳車絕塵而去。"},{"english":"If a turtle ingests this, it can cause problems.","chinese":"如果龜嚥下這一點，可能會導致問題。"},{"english":"Mouth of delicious haven't swallow, dining-room free performances again.","chinese":"嘴裏的美味還沒嚥下去，餐廳的免費演出又開始了。"},{"english":"The accumulation of unswallowed saliva in the pharynx causes the sensation of choking .","chinese":"不能嚥下的唾液積聚在咽部引起窒息感。"},{"english":"We would dry the wood in the sun and eat it.","chinese":"我們會在太陽下先把木頭曬乾，再嚥下。"},{"english":"The girl swallows a lump at her throat.","chinese":"女孩嚥下哽在喉嚨裏的東西。"},{"english":"He ate the black bread with the blood.","chinese":"他用血嚥下了黑麪包。"},{"english":"He curled them between his palms at whiles and swallowed them softly.","chinese":"他不時她用雙掌把它搓成小卷兒，輕輕地嚥下去。"},{"english":"Simon Edwards stepped forward, swallowing the frog in his throat.","chinese":"愛德華茲走上前，他強嚥下沁入喉中的霧水。"},{"english":"She swallowed her briny tears.","chinese":"她嚥下自己的鹹鹹的眼淚。"},{"english":"He wandered off, sipping the last of his latte.","chinese":"伴隨着嚥下最後一口咖啡，他跑題了。"},{"english":"The child got the medicine down.","chinese":"孩子把藥嚥下去。"},{"english":"Longer course, dysphagia developed to a certain extent that is no longer aggravated .","chinese":"病程較長，嚥下困難發展至一定程度即不再加重。"},{"english":"This medicine goes down smoothly.","chinese":"這種藥物很容易嚥下去。"},{"english":"You should chew your food well before you swallow it.","chinese":"你應當先細嚼你的食物，然後再嚥下去。"}],"related":[]}