{"definition":["sternly\/strictly\/harshly\/stringently\/rigorously"],"pinyin":["yan2 jia1"],"simplified":["严加"],"rank":47019.0,"normalized_rank":0.6578568130622753,"fraction":1.9502610948754138e-7,"cumulative_fraction":0.9984564062975888,"word":"嚴加","characters":[{"definition":["surname Yan","tight (closely sealed)\/stern\/strict\/rigorous\/severe\/father"],"pinyin":["Yan2","yan2"],"word":"嚴"},{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"}],"containing_words":[],"sentences":[{"english":"The government has been trying to slow the economy, by reining in runaway lending.","chinese":"當局已經努力放慢經濟增長，嚴加管制貸款流失。"},{"english":"The country’s car industry is so strongly protected that foreign cars are rarely seen there.","chinese":"該國對汽車工業嚴加保護，外國汽車甚爲罕見。"},{"english":"The traditional law of Tong ethnic group also strictly prohibits thefts and burglaries.","chinese":"侗族的傳統法律也對偷盜行爲嚴加禁止。"},{"english":"Any information we receive from you will, of course, be held in strict confidence.","chinese":"我們從您處收到的任何信息定會嚴加保密。"},{"english":"The goddess delivered the heifer to Argus, to be strictly watched.","chinese":"那女神就把這頭小母牛交給阿爾戈斯嚴加看管。"},{"english":"Kawashima Kimi will Bai Dayi escorted successfully, on to his front to the Clssical stood maintenance.","chinese":"川島君將白大怡護送成功，上鋒令他對熹園嚴加維護。"},{"english":"That man has sinister designs. You must guard against his every move.","chinese":"這個人心懷叵測，對他的一舉一動，都要嚴加提防。"},{"english":"The policeman rapped the driver for his violation of traffic regulations.","chinese":"由於司機違反交通規則，警察對他嚴加批評。"}],"related":[]}