{"definition":["to strictly maintain"],"pinyin":["yan2 shou3"],"simplified":["严守"],"rank":26607.0,"normalized_rank":0.37226645026793337,"fraction":0.0000012794938994448354,"cumulative_fraction":0.9865048272042954,"word":"嚴守","characters":[{"definition":["surname Yan","tight (closely sealed)\/stern\/strict\/rigorous\/severe\/father"],"pinyin":["Yan2","yan2"],"word":"嚴"},{"definition":["to guard\/to defend\/to keep watch\/to abide by the law\/to observe (rules or ritual)\/nearby\/adjoining"],"pinyin":["shou3"],"word":"守"}],"containing_words":[],"sentences":[{"english":"This habit also robbed me of a chance of making easy money.","chinese":"嚴守時刻的習慣還剝奪我掙容易錢的機會。"},{"english":"I promised Sarah that I was going to keep it a secret.","chinese":"我答應Sarah我會嚴守祕密的。"},{"english":"Our leader enjoined on us the neccessity for strict secrecy.","chinese":"我們的領導要我們務必嚴守機密。"},{"english":"One should strictly obey the fourteen basic precepts and possess wisdom and compassion.","chinese":"嚴守密乘十四條根本戒，具足智慧與大悲力。"},{"english":"Pacta sunt servanda is one of the basic principias in contract law.","chinese":"“合同必須嚴守”是合同法的基本原理。"},{"english":"Are you disciplined enough to succeed in trading?","chinese":"在交易中你做到了嚴守紀律嗎？"},{"english":"The chairman warned the senator to toe the party line while running for governer.","chinese":"主席告誡議員們在競選州長時要嚴守該黨的路線。"},{"english":"So left-home people, wherever they may be, must sternly guard their precepts.","chinese":"所以，出家人處處要嚴守戒律。"},{"english":"Hard work and discipline could lead to self-improvement.","chinese":"艱苦奮鬥和嚴守紀律是改善自我的途徑。"},{"english":"Both sides held on to their positions along the outskirts of the towns of Brega and Ajdabiya.","chinese":"雙方都嚴守住各自在佈雷加和埃賈比耶郊外的陣地。"},{"english":"Strictly abide by the foreign affairs discipline, and adherence to the Party and state secrets.","chinese":"嚴格遵守外事工作紀律，嚴守黨和國家的祕密。"},{"english":"The housecarls around Harold preserved their discipline.","chinese":"哈羅德身邊的臣僕仍嚴守紀律。"},{"english":"Then enjoining him to keep it strictly confidential, he told him the whole story.","chinese":"叮囑他嚴守祕密，然後把這事講出來。"},{"english":"But Cao Gui persuaded Lu Zhuang Gong just to keep up with a good defense.","chinese":"但曹劌說服魯莊公只需嚴守防線。"},{"english":"She was the most close-mouthed female in the white House - and she had to be.","chinese":"她是白宮最嚴守祕密的女人，她必須這樣。"}],"related":[]}