{"definition":["strict\/stringent\/tight\/rigorous"],"pinyin":["yan2 ge2"],"simplified":["严格"],"rank":1094.0,"normalized_rank":0.015306479369831963,"fraction":0.00014617177710565853,"cumulative_fraction":0.6343557653177556,"word":"嚴格","characters":[{"definition":["surname Yan","tight (closely sealed)\/stern\/strict\/rigorous\/severe\/father"],"pinyin":["Yan2","yan2"],"word":"嚴"},{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"}],"containing_words":[{"definition":["strictly speaking"],"pinyin":["yan2 ge2 lai2 shuo1"],"word":"嚴格來說"},{"definition":["strictly speaking"],"pinyin":["yan2 ge2 lai2 jiang3"],"word":"嚴格來講"},{"definition":["rigorous isolation"],"pinyin":["yan2 ge2 ge2 li2"],"word":"嚴格隔離"}],"sentences":[{"english":"They are strictly vegetarian and eat all manner of deep fried food.","chinese":"他們是嚴格的食素者，喫各種各樣的油炸食品。"},{"english":"The languages were severely suppressed in education by the Japanese government.","chinese":"日本政府嚴格限制了琉球語在學校的教學和使用。"},{"english":"The fine structure parameters were calculated using a least-squares fitting procedure.","chinese":"用最小二乘法擬合技術嚴格地計算了精細結構參數。"},{"english":"Be strictly compliance with laws and regulations, and to ensure food safety from product design.","chinese":"嚴格遵守法律法規，食品安全從產品設計抓起。"},{"english":"Results The rehabilitation treatment after TKR is very satisfied.","chinese":"結果術後嚴格的康復治療取得了滿意的臨牀效果。"},{"english":"Capable of strictly abiding by the stipulations on the printing of invoices and the production and management of special products for anti-fake invoices.","chinese":"能嚴格遵守發票印製和發票防僞專用品生產管理規定。"},{"english":"The teacher is strict with his students and in his work.","chinese":"這位老師對他的學生要求嚴格，對工作要求也嚴。"},{"english":"The indicting condition of civil lawsuit is exact in our country.","chinese":"我國民事訴訟的起訴條件比較嚴格，對當事人不公平。"},{"english":"After arriving in Switzerland, the imported raw cocoa is subject to a strict quality control.","chinese":"當可可豆到達瑞士後，將要進行嚴格的質控程序。"},{"english":"The domain level focuses strictly on business interactions viewed from the perspective of the external actor.","chinese":"域層次嚴格集中在從外部演員的角度看到的業務交互。"},{"english":"The goods supplied shall only be those of best quality.","chinese":"本公司的產品製造有極嚴格的品質管制。"},{"english":"Thus, in the ordinary course of warehousing, the temptations to embezzle are strictly limited.","chinese":"所以在普通倉庫的運作中，侵佔的誘惑被嚴格限制了。"},{"english":"This, in turn, may cause more page breaks than are strictly necessary.","chinese":"這進而會導致一些嚴格說來不必要的換頁。"},{"english":"They discover that the new teacher is a martinet.","chinese":"他們發現新來的老師非常嚴格。"},{"english":"IX. Strictly stick to the handing-over system.","chinese":"第九條嚴格執行交接班制度。"},{"english":"The most stringent environmental protection measures in China's railway construction history have been introduced.","chinese":"採取鐵路建設史上最嚴格的環保措施。"}],"related":[{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"規範"},{"definition":["provision\/to fix\/to set\/to formulate\/to stipulate\/to provide\/regulation\/rule\/CL:個|个[ge4]"],"pinyin":["gui1 ding4"],"word":"規定"},{"definition":["rigorous\/strict\/careful\/cautious\/compact\/well-knit"],"pinyin":["yan2 jin3"],"word":"嚴謹"},{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"實行"},{"definition":["principle\/doctrine\/CL:個|个[ge4]"],"pinyin":["yuan2 ze2"],"word":"原則"},{"definition":["rule\/regulation\/rules and regulations"],"pinyin":["gui1 ze2"],"word":"規則"},{"definition":["to implement\/to carry out\/to execute\/to run"],"pinyin":["zhi2 xing2"],"word":"執行"},{"definition":["severe\/strict"],"pinyin":["yan2 li4"],"word":"嚴厲"},{"definition":["(an official) standard\/norm\/criterion\/CL:個|个[ge4]"],"pinyin":["biao1 zhun3"],"word":"標準"},{"definition":["compass\/a rule\/regulation\/to admonish\/to plan\/to scheme"],"pinyin":["gui1"],"word":"規"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["should\/ought to"],"pinyin":["ying1 dang1"],"word":"應當"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"審查"},{"definition":["to permit\/to allow"],"pinyin":["yun3 xu3"],"word":"允許"},{"definition":["clear-cut\/definite\/explicit\/to clarify\/to specify\/to make definite"],"pinyin":["ming2 que4"],"word":"明確"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"監管"}]}