{"definition":["the Four Classic Novels of Chinese literature, namely: A Dream of Red Mansions 紅樓夢|红楼梦[Hong2 lou2 Meng4], Romance of Three Kingdoms 三國演義|三国演义[San1 guo2 Yan3 yi4], Water Margin 水滸傳|水浒传[Shui3 hu3 Zhuan4], Journey to the West 西遊記|西游记[Xi1 you2 Ji4]"],"pinyin":["si4 da4 ming2 zhu4"],"simplified":["四大名著"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"四大名著","characters":[{"definition":["four\/4"],"pinyin":["si4"],"word":"四"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","aspect particle indicating action in progress","to make known\/to show\/to prove\/to write\/book\/outstanding","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","to wear (clothes)\/to contact\/to use\/to apply"],"pinyin":["zhao1","zhao2","zhe5","zhu4","zhuo2"],"word":"著"}],"containing_words":[],"sentences":[{"english":"Mansions\" is one of China's four famous book !\"","chinese":"大家都知道“紅樓夢”是中國的四大名著之一。"},{"english":"I heard there are four masterpieces of China.Have you read all of them?","chinese":"我聽說中國有四大名著，你都讀過嗎？"},{"english":"I heard there are four masterpieces of China.","chinese":"我聽說中國有四大名著，你都讀過嗎？"},{"english":"Lily: How's your feeling after reading the four classics?","chinese":"你讀完四大名著有什麼感受？"},{"english":"Hi! Hong. I heard there are four masterpieces of China. Have you read all of them?","chinese":"你好，林紅。我聽說中國有四大名著，你都讀過嗎？"},{"english":"We all know that \"A Dream of Red Mansions\" is one of China's four famous book !","chinese":"大家都知道“紅樓夢”是中國的四大名著之一。"},{"english":"Abstract: [to] picked: \"jinghuayuan\" is one of the four great classics of ancient Chinese ghost story.","chinese":"《鏡花緣》是我國古代神怪小說四大名著之一。"},{"english":"Works based on the Four Masters' Works appear constantly on television.","chinese":"由四大名著改編的電視作品經常被搬上熒屏。"}],"related":[{"definition":["masterpiece"],"pinyin":["ming2 zhu4"],"word":"名著"},{"definition":["Journey to the West, Ming dynasty novel by Wu Cheng'en 吳承恩|吴承恩, one of the Four Classic Novels of Chinese literature\/also called Pilgrimage to the West or Monkey"],"pinyin":["Xi1 you2 Ji4"],"word":"西遊記"},{"definition":["A Dream of Red Mansions (first completed edition 1791) by Cao Xueqin 曹雪芹[Cao2 Xue3 qin2], one of the four great novels"],"pinyin":["Hong2 lou2 Meng4"],"word":"紅樓夢"},{"definition":["Jinpingmei or the Golden Lotus (1617), Ming dynasty vernacular novel, formerly notorious and banned for its sexual content"],"pinyin":["Jin1 ping2 mei2"],"word":"金瓶梅"},{"definition":["Water Margin or Outlaws of the Marsh by Shi Nai'an 施耐庵[Shi1 Nai4 an1], one of the Four Classic Novels of Chinese literature"],"pinyin":["Shui3 hu3 Zhuan4"],"word":"水滸傳"},{"definition":["the Twenty-Four Histories (25 or 26 in modern editions), collection of books on Chinese dynastic history from 3000 BC till 17th century\/fig. a long and complicated story"],"pinyin":["Er4 shi2 si4 Shi3"],"word":"二十四史"},{"definition":["Romance of the Three Kingdoms by Luo Guanzhong 羅貫中|罗贯中[Luo2 Guan4 zhong1], one of the Four Classic Novels of Chinese literature\/a fictional account of the Three Kingdoms at the break-up of the Han around 200 AD, consistently portraying Liu Bei's Shu Han 劉備|刘备, 蜀漢|蜀汉 as virtuous heroes and Cao Cao's Wei 曹操, 魏 as tyrannical villains"],"pinyin":["San1 guo2 Yan3 yi4"],"word":"三國演義"},{"definition":["edge of the water\/shore or sea, lake or river\/seashore"],"pinyin":["shui3 hu3"],"word":"水滸"},{"definition":["Strange Stories from a Chinese Studio, Qing dynasty book of tales by 蒲松齡|蒲松龄[Pu2 Song1 ling2]"],"pinyin":["Liao2 zhai1 Zhi4 yi4"],"word":"聊齋志異"},{"definition":["Guwen Guanzhi, an anthology of essays written in Literary Chinese, compiled and edited by Wu Chucai and Wu Diaohou of Qing dynasty"],"pinyin":["Gu3 wen2 Guan1 zhi3"],"word":"古文觀止"},{"definition":["classical literature"],"pinyin":["gu3 dian3 wen2 xue2"],"word":"古典文學"},{"definition":["supernatural novel\/novel of ghosts and goblins"],"pinyin":["shen2 mo2 xiao3 shuo1"],"word":"神魔小說"},{"definition":["Sanxia wuyi (lit. Three knight-errants and five righteous one), novel edited from stories of late Qing dynasty pinghua 評話|评话 master storyteller Shi Yukun 石玉昆"],"pinyin":["San1 xia2 wu3 yi4"],"word":"三俠五義"},{"definition":["novel in chapters, main format for long novels from the Ming onwards, with each chapter headed by a summary couplet"],"pinyin":["zhang1 hui2 xiao3 shuo1"],"word":"章回小說"},{"definition":["popular fiction\/light literature"],"pinyin":["tong1 su2 xiao3 shuo1"],"word":"通俗小說"},{"definition":["Three Hundred Tang Poems, an anthology collected around 1763 by Sun Zhu 孫誅"],"pinyin":["Tang2 shi1 San1 bai3 Shou3"],"word":"唐詩三百首"}]}