{"definition":["tetracycline"],"pinyin":["si4 huan2 su4"],"simplified":["四环素"],"rank":44714.0,"normalized_rank":0.6256068725252892,"fraction":2.45388390754908e-7,"cumulative_fraction":0.9979505430203014,"word":"四環素","characters":[{"definition":["four\/4"],"pinyin":["si4"],"word":"四"},{"definition":["ring\/hoop\/loop\/(chain) link\/classifier for scores in archery etc\/to surround\/to encircle\/to hem in","surname Huan"],"pinyin":["Huan2","huan2"],"word":"環"},{"definition":["raw silk\/white\/plain, unadorned\/vegetarian (food)\/essence\/nature\/element\/constituent\/usually\/always\/ever"],"pinyin":["su4"],"word":"素"}],"containing_words":[],"sentences":[{"english":"Objective To improve the TLC identification of Unguentum tetracycline.","chinese":"目的對四環素軟膏薄層色譜鑑別法進行改進。"},{"english":"There were no serious side effects from minocycline.","chinese":"二甲胺四環素並沒有嚴重的副作用。"},{"english":"Is permanent, but now no longer a tetracycline .","chinese":"四環素牙是永久性的，但是現在已不用四環素了。"},{"english":"Is permanent, but now no longer a tetracycline .","chinese":"四環素牙是永久性的，但是現在已不用四環素了。"},{"english":"Coexisting tetracycline and anhydrochlorotetracycline do not interfere with the determination of chlorotetracycline.","chinese":"共存四環素和脫水金黴素雜質不干擾金黴素測定。"},{"english":"Drugs from the tetracycline family are the most commonly prescribed antibiotics for the treatment of severe acne.","chinese":"治療嚴重粉刺最常用的是四環素類抗生素。"},{"english":"It is regrettable that minocycline are still not completely remove the virus.","chinese":"但遺憾的是二甲胺四環素人仍不能完全去除病毒。"},{"english":"Oral tetracyclines will minimize the risk of infection.","chinese":"口服四環素可以降低感染的風險。"},{"english":"That will likely be true of minocycline.","chinese":"這纔是真實的二甲胺四環素。"},{"english":"All cases were cured after treated with chloramphenicolum or tetracycline tablets and supportive liver protection therapy.","chinese":"所有患者經氯黴素或四環素類片劑及保肝治療均痊癒。"},{"english":"Tribological properties of tetracycline stained teeth are found to be correlative with its color.","chinese":"四環素牙的摩擦學特性與其變色程度相關。"},{"english":"The drug latches onto calcium and gets deposited in bone.","chinese":"四環素類藥物會與鈣螯合，沉積在骨骼中。"},{"english":"And tetracycline are closely cross-resistance.","chinese":"與四環素有密切的交叉耐藥性。"}],"related":[]}