{"definition":["to return to one's home country"],"pinyin":["hui2 guo2"],"simplified":["回国"],"rank":4444.0,"normalized_rank":0.06217732570341247,"fraction":0.000028742264840980127,"cumulative_fraction":0.8443849915232478,"word":"回國","characters":[{"definition":["to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)"],"pinyin":["hui2"],"word":"回"},{"definition":["country\/nation\/state\/national\/CL:個|个[ge4]","surname Guo"],"pinyin":["Guo2","guo2"],"word":"國"}],"containing_words":[],"sentences":[{"english":"This is the first solo exhibition of Ding Li upon his return to home from his study at L'ecole des Beaux-Arts in France.","chinese":"這是丁力自巴黎藝術學院畢業回國後的第一個個展。"},{"english":"The soldiers posted abroad in 2001 rotated home last year.","chinese":"2001年派駐國外的士兵去年輪換調防回國。"},{"english":"He got his Master of Asian studies from Lund University in Sweden.","chinese":"沈亮在回國創業前在瑞典隆德大學獲得碩士學位。"},{"english":"Qian was immediately allowed to establish an Institute of Mechanics in Beijing, and to work within the state -established Chinese Academy of Science.","chinese":"錢回國後隨即在北京建立力學院，並創建中國科學院。"},{"english":"Both the United Nations and the United States are upset about Dostum's return.","chinese":"但聯合國和美國對杜斯塔姆的回國感到不安。"},{"english":"Canda has made some secret business deal with China in exchange for sending this man back home.","chinese":"把這人送回國去，是加拿大跟中國私底下有交易。"},{"english":"And in the studies after returning home, I will be even more full play to their ability.","chinese":"並且在學成回國後，我將更加充分的發揮自己的能力。"},{"english":"Where a diplomat stationed abroad leaves his post and returns to his country, his rank shall be terminated correspondingly.","chinese":"駐外外交人員離任回國，其銜級相應終止。"},{"english":"After returning home she held solo exhibitions many times in Shanghai.","chinese":"回國後多次在上海舉行個人油畫展。"},{"english":"After he got the Doctor's Dearee of Meteorology, he returned to China.","chinese":"獲得氣象學博士學位後，竺可楨回國。"},{"english":"But Rong Hong returned only to find a poverty-stricken country under a corrupt government.","chinese":"容閎回國後，看到了清政府的腐朽落後和國家的貧困。"},{"english":"Out organization has effectuated the return to their countries of all the political prisoners.","chinese":"我們的組織已達成遣送所有政治犯回國。"},{"english":"Gillard's Apricot Kernels will be short-lived, with Rudd due to return to Artificial Turf late Thursday.","chinese":"但吉拉德的升職只是短暫的，陸克文週四晚就會回國。"},{"english":"However, after his return, 26-year-old Wang was no better prepared to find work.","chinese":"但回國後，26歲的王建海在求職時可以說毫無準備。"},{"english":"Is ready to return in his country Marcos Assuncao (31), former midfield of Roma and Betis Sevilla.","chinese":"前羅馬和貝蒂斯中場馬克思阿松桑準備回國。"},{"english":"And Mr. Green will make another appointment when Mr. Wang comes back.","chinese":"格林先生回國後再和王經理安排另一個見面。"}],"related":[{"definition":["to go abroad\/to leave the country\/emigration"],"pinyin":["chu1 guo2"],"word":"出國"},{"definition":["to study abroad"],"pinyin":["liu2 xue2"],"word":"留學"},{"definition":["to depart\/to leave"],"pinyin":["li2 kai1"],"word":"離開"},{"definition":["to bring back"],"pinyin":["dai4 hui2"],"word":"帶回"},{"definition":["abroad\/external (affairs)\/overseas\/foreign"],"pinyin":["guo2 wai4"],"word":"國外"},{"definition":["graduation\/to graduate\/to finish school"],"pinyin":["bi4 ye4"],"word":"畢業"},{"definition":["termination\/to finish\/to end\/to conclude\/to close"],"pinyin":["jie2 shu4"],"word":"結束"},{"definition":["several days"],"pinyin":["ji3 tian1"],"word":"幾天"},{"definition":["student studying abroad\/(foreign) exchange student\/CL:個|个[ge4],位[wei4]"],"pinyin":["liu2 xue2 sheng1"],"word":"留學生"},{"definition":["domestic\/internal (to a country)\/civil"],"pinyin":["guo2 nei4"],"word":"國內"},{"definition":["to resign"],"pinyin":["ci2 zhi2"],"word":"辭職"},{"definition":["foreign (country)\/CL:個|个[ge4]"],"pinyin":["wai4 guo2"],"word":"外國"},{"definition":["see 過來|过来[guo4 lai2]","to come over\/to manage\/to handle\/to be able to take care of"],"pinyin":["guo4 lai2","guo4 lai5"],"word":"過來"},{"definition":["to read\/to study"],"pinyin":["nian4 shu1"],"word":"念書"},{"definition":["(in the) past\/former\/previous\/to go over\/to pass by","(verb suffix)"],"pinyin":["guo4 qu4","guo4 qu5"],"word":"過去"},{"definition":["to overtake\/to catch up with\/to hurry\/to rush\/to try to catch (the bus etc)\/to drive (cattle etc) forward\/to drive (sb) away\/to avail oneself of (an opportunity)\/until"],"pinyin":["gan3"],"word":"趕"}]}