{"definition":["to fight back\/to return fire\/to counterattack"],"pinyin":["hui2 ji1"],"simplified":["回击"],"rank":18264.0,"normalized_rank":0.2555370559511984,"fraction":0.000002862037352255042,"cumulative_fraction":0.9702878844763634,"word":"回擊","characters":[{"definition":["to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)"],"pinyin":["hui2"],"word":"回"},{"definition":["to hit\/to strike\/to break\/Taiwan pr. [ji2]"],"pinyin":["ji1"],"word":"擊"}],"containing_words":[],"sentences":[{"english":"Enough is enough they say - it's time to fight back.","chinese":"他們認爲惡作劇的時間已經夠了，現在是時候回擊了。"},{"english":"A composite formula for calculation of horizontal electric field generated by return stroke current is presented.","chinese":"提出了一種計算地閃回擊電流水平電場的混合法。"},{"english":"After we fired back, there was no further response from the DRPK.","chinese":"我方回擊後，朝方沒有進一步迴應。"},{"english":"We replied to the enemy's attack with a barrage.","chinese":"我軍以齊射的炮火回擊敵軍的進攻。"},{"english":"The player should learn to use a cross over step to recover from wide balls.","chinese":"選手應學習在回擊大外角球來球后，以交叉跨步回防。"},{"english":"To which there seemed no more effectual reply than to go on killing royalists.","chinese":"除了繼續殺害保王黨人，似乎沒有別的更有效的回擊。"},{"english":"The Mon Calamari and the Quarren joined together to fight back against the invaders.","chinese":"蒙卡拉馬里人與誇潤人聯手回擊了入侵者。"},{"english":"The Americans returned fire with heavy machine guns and grenade launchers.","chinese":"美國人用重機槍和榴彈發射器回擊。"},{"english":"Johnson returns it crosscourt , deep to the right baseline comer.","chinese":"約翰遜打出斜線球回擊，球打到了底線右角。"},{"english":"The Club World Cup champions cannot possibly reply to the newly-promoted Juventus.","chinese":"世俱杯冠軍也許無法回擊升班馬尤文圖斯。"},{"english":"He was out trying to turn a ball to leg.","chinese":"他想把球回擊到擊球員左後方場地，結果出局了。"},{"english":"This is a good chance to strike back your political opponent.","chinese":"這正是回擊你的政敵的好機會。"},{"english":"Srk's reply to critics that say he has only 5 expressions that he keeps repeating.","chinese":"沙沙回擊評論家批評他一直在重複五種表達方式。"},{"english":"The Gaddafi fighters hitting back with heavy weapons.","chinese":"卡扎菲的士兵用重武器回擊。"},{"english":"What made it different is that officials fought back hard for the first time.","chinese":"與以往不同的是，這次官員首次進行了有力的回擊。"},{"english":"Now and then the Nietzsches of the world have fought back.","chinese":"不時地，世界上這些尼采的追隨者正在回擊。"}],"related":[{"definition":["to use violence (against sb)\/to strong-arm sb\/to manhandle"],"pinyin":["dong4 cu1"],"word":"動粗"},{"definition":["(coll.) to tamper with\/to mess around with"],"pinyin":["dong4 shou3 jiao3"],"word":"動手腳"},{"definition":["the trick of injuring oneself to gain the enemy's confidence\/CL:條|条[tiao2]"],"pinyin":["ku3 rou4 ji4"],"word":"苦肉計"},{"definition":["dumbstruck and unable to reply (idiom); left speechless\/at a loss for words"],"pinyin":["ya3 kou3 wu2 yan2"],"word":"啞口無言"},{"definition":["lit. four ounces can move a thousand catties (idiom)\/fig. to achieve much with little effort"],"pinyin":["si4 liang3 bo1 qian1 jin1"],"word":"四兩撥千斤"},{"definition":["armed confrontation\/bust-up between gangs"],"pinyin":["xie4 dou4"],"word":"械鬥"},{"definition":["to obscure the facts (idiom); to mislead the public with prevarication and deliberate falsehoods"],"pinyin":["hun4 xiao2 shi4 ting1"],"word":"混淆視聽"},{"definition":["crafty plots and machinations (idiom)"],"pinyin":["yin1 mou2 gui3 ji4"],"word":"陰謀詭計"},{"definition":["to smash"],"pinyin":["za2 lan4"],"word":"砸爛"},{"definition":["to call loudly (idiom); to get people's attention\/to make one's views known"],"pinyin":["da4 sheng1 ji2 hu1"],"word":"大聲疾呼"},{"definition":["counting one's chickens before they are hatched"],"pinyin":["ru2 yi4 suan4 pan2"],"word":"如意算盤"},{"definition":["shield\/(fig.) excuse"],"pinyin":["dang3 jian4 pai2"],"word":"擋箭牌"},{"definition":["rude and unreasonable"],"pinyin":["man2 heng4"],"word":"蠻橫"},{"definition":["to shift one's eyes\/(fig.) to shift one's attention\/to divert attention"],"pinyin":["zhuan3 yi2 shi4 xian4"],"word":"轉移視線"},{"definition":["to bawl out\/to reprimand severely"],"pinyin":["tong4 ma4"],"word":"痛罵"},{"definition":["making a deer out to be a horse (idiom); deliberate misrepresentation"],"pinyin":["zhi3 lu4 wei2 ma3"],"word":"指鹿為馬"}]}