{"definition":["(of the weather) to warm up again"],"pinyin":["hui2 nuan3"],"simplified":["回暖"],"rank":11663.0,"normalized_rank":0.16318050172792525,"fraction":0.000006419512118880328,"cumulative_fraction":0.9418123392988218,"word":"回暖","characters":[{"definition":["to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)"],"pinyin":["hui2"],"word":"回"},{"definition":["warm\/to warm"],"pinyin":["nuan3"],"word":"暖"}],"containing_words":[],"sentences":[{"english":"Treatment can be painful and involves the gentle rewarming of the frostbitten body part.","chinese":"治療可能會很辛苦，需要使凍傷的部位逐漸回暖。"},{"english":"Markets have rallied very fast, but they fell just as quickly in the six months to March.","chinese":"市場在三月份前的的六個月裏乍然回暖又驟然降溫。"},{"english":"Potential home buyers afraid of committing to a fast- depreciating asset have been clamoring for signs of stabilization in house prices.","chinese":"潛在的購房者擔心房價回暖是大肆貶值前的虛張聲勢。"},{"english":"Hiring is starting to pick up again, recruiters and bankers say.","chinese":"招聘正在開始再度回暖，招聘者和銀行家們說。"},{"english":"Greater resilience is a shared objective.","chinese":"大範圍的回暖是共有的客觀事實。"},{"english":"The other is that financial crises usually produce weak recoveries.","chinese":"另一股則是金融危機通常會導致柔弱的回暖。"},{"english":"We love the smell of the earth warming and the sound of cattle lowing.","chinese":"我們愛聞大地回暖的氣息，愛聽牛羣哞叫。"},{"english":"After an hour, there was little sign of confidence returning, with the Footsie still 6% down at 9am.","chinese":"開盤一個小時後，倫敦市場幾乎沒有任何回暖的跡象。"},{"english":"Although the real estate market become warmer in the Spring 2009, but the future trend remains unclear.","chinese":"2009年開春市場有所回暖，但未來走勢仍未明朗。"},{"english":"At this time the earth has warmed up, Chaya very immature.","chinese":"此時大地剛剛回暖，茶芽非常稚嫩。"},{"english":"Maybe, the time when Hong Kong real estate rejuvenates is his day of fortune rising?","chinese":"或許，香港地產業回暖之時，又是他的身家大漲之日。"},{"english":"AF says the process of rewarming a person needs to be done slowly in a hospital setting.","chinese":"AF說在醫院裏，讓傷員回暖的過程要比較緩慢。"}],"related":[{"definition":["to rise again after a fall\/to pick up\/rally (stock market etc)"],"pinyin":["hui2 sheng1"],"word":"回升"},{"definition":["variant of 復甦|复苏[fu4 su1]\/to recover (health, economic)\/to resuscitate\/anabiosis"],"pinyin":["fu4 su1"],"word":"復蘇"},{"definition":["blurred (landscape etc)\/low (spirits)\/in a slump (economy)"],"pinyin":["di1 mi2"],"word":"低迷"},{"definition":["to go down\/to decline"],"pinyin":["zou3 di1"],"word":"走低"},{"definition":["to become hot\/temperature rise\/(fig.) to intensify\/to hot up\/to escalate\/to get a boost"],"pinyin":["sheng1 wen1"],"word":"升溫"},{"definition":["a cold tendency\/a freeze (in relations)"],"pinyin":["qu1 leng3"],"word":"趨冷"},{"definition":["posture\/situation"],"pinyin":["tai4 shi4"],"word":"態勢"},{"definition":["to improve\/to take a turn for the better\/improvement"],"pinyin":["hao3 zhuan3"],"word":"好轉"},{"definition":["to fall back\/to return to low level after a rise (in water level, price etc)"],"pinyin":["hui2 luo4"],"word":"回落"},{"definition":["improvement\/turnaround (for the better)"],"pinyin":["zhuan3 hao3"],"word":"轉好"},{"definition":["tired and feeble"],"pinyin":["pi2 ruan3"],"word":"疲軟"},{"definition":["to slow down\/to ease up\/to abate\/slowdown\/downturn"],"pinyin":["qu1 huan3"],"word":"趨緩"},{"definition":["sliding\/slide"],"pinyin":["xia4 hua2"],"word":"下滑"},{"definition":["to decline\/to drop\/to fall\/to go down\/to decrease"],"pinyin":["xia4 jiang4"],"word":"下降"},{"definition":["a turn for the better\/to pick up\/to improve"],"pinyin":["qi3 se4"],"word":"起色"},{"definition":["a big margin\/substantially"],"pinyin":["da4 fu2"],"word":"大幅"}]}