{"definition":["to rebuff\/to refuse\/to turn down"],"pinyin":["hui2 jue2"],"simplified":["回绝"],"rank":20423.0,"normalized_rank":0.285744267065885,"fraction":0.0000022879073458070627,"cumulative_fraction":0.9758289346219802,"word":"回絕","characters":[{"definition":["to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)"],"pinyin":["hui2"],"word":"回"},{"definition":["to cut short\/extinct\/to disappear\/to vanish\/absolutely\/by no means"],"pinyin":["jue2"],"word":"絕"}],"containing_words":[],"sentences":[{"english":"Mrs Rebuffed 2 people debate, o have tumbled down the stairs knocked at the end.","chinese":"太太回絕2人爭論中，阿得從樓梯上跌下來敲到頭。"},{"english":"Turn them away I cannot.","chinese":"我不能回絕他們。"},{"english":"This film brought good luck for him, and he got more movie appointments, but he all refused.","chinese":"這部影片給他帶來了好運，片約不斷，但他都回絕了。"},{"english":"The check with boyfriend gayle angry, flatly rejected participate in singing.","chinese":"阿帕查由於和男朋友格利生氣，斷然回絕參與演唱。"},{"english":"It wouldn't be the first time government officials have rebuffed Xiang's overseas ambitions.","chinese":"這並非政府官員第一次回絕向文波的海外併購雄心。"},{"english":"Had not all the other places refused her because she did not know something or other?","chinese":"其他那些回絕她的單位不就是因爲她這不會那不懂嗎？"},{"english":"The supervisor of the workers dismissed the salesman's claims.","chinese":"監工回絕了銷售員的要求。"},{"english":"Jeter with everyone to participate in ceremony, and inform everyone rebuffed reason.","chinese":"吉特不隨人人去參與典禮，而且回絕通知人人緣由。"},{"english":"British trillion constantly ask static grace dwell where, static grace rebuffed a reply.","chinese":"英兆不斷問靜恩住在哪裏，靜恩回絕答覆。"},{"english":"Jia generation son hope LinZhenHai pass HuXiaoYue, has been rebuffed.","chinese":"佳代子希望林振海放過胡曉月，卻遭到了回絕。"},{"english":"Mr. Papandreou rebuffed the call to resign.","chinese":"帕潘德里歐回絕了辭職要求。"},{"english":"Tian, 20, refused.","chinese":"20歲的田林回絕了這一要求。"},{"english":"Ep666 - Kexin rejects Wenqiang as she thinks that it is not the right timing. Wenqiang is disappointed.","chinese":"可欣有感時間不對而忍痛回絕文強的求婚，文強難過。"},{"english":"ChengJun and RenHui will divide the yankees find oxpoint wealth, is RenHui rebuffed.","chinese":"成俊和基俊找到仁惠要分財富，被仁惠回絕。"},{"english":"All rejected her, except Geneva Medical College in the state of New York.","chinese":"這些大學全部回絕了她，除了紐約州的日內瓦醫學院。"},{"english":"Repeated rebuffs couldn't extinguish my enthusiasm.","chinese":"我的熱情不會因屢次的回絕而熄滅。"}],"related":[{"definition":["to dispute\/to refute"],"pinyin":["bian4 bo2"],"word":"辯駁"},{"definition":["unwilling"],"pinyin":["bu4 qing2 yuan4"],"word":"不情願"},{"definition":["clumsy\/all thumbs"],"pinyin":["ben4 shou3 ben4 jiao3"],"word":"笨手笨腳"},{"definition":["to bear grudges"],"pinyin":["ji4 hen4"],"word":"記恨"},{"definition":["to explain\/to justify\/to defend (a point of view etc)\/to provide an explanation\/to try to defend oneself"],"pinyin":["bian4 jie3"],"word":"辯解"},{"definition":["lit. wading in mud and water\/a slovenly job\/sloppy"],"pinyin":["tuo1 ni2 dai4 shui3"],"word":"拖泥帶水"},{"definition":["to contend on strong grounds\/to argue strongly for what is right"],"pinyin":["ju4 li3 li4 zheng1"],"word":"據理力爭"},{"definition":["to fly into a rage out of humiliation\/to be ashamed into anger (idiom)"],"pinyin":["nao3 xiu1 cheng2 nu4"],"word":"惱羞成怒"},{"definition":["to feel grateful to sb\/to appreciate the kindness"],"pinyin":["ling3 qing2"],"word":"領情"},{"definition":["to gesticulate\/to point out\/to point the finger of blame"],"pinyin":["zhi3 zhi3 dian3 dian3"],"word":"指指點點"},{"definition":["to incite disharmony\/to instigate"],"pinyin":["tiao3 bo1"],"word":"挑撥"},{"definition":["hesitancy\/indecision\/to waver"],"pinyin":["you2 yu4 bu4 jue2"],"word":"猶豫不決"},{"definition":["to pass over\/to skip"],"pinyin":["lu:e4 guo4"],"word":"略過"},{"definition":["to open one's mouth\/to start to talk"],"pinyin":["kai1 kou3"],"word":"開口"},{"definition":["to gesticulate while talking (idiom)\/to explain by waving one's hands\/to criticize or give orders summarily"],"pinyin":["zhi3 shou3 hua4 jiao3"],"word":"指手畫腳"},{"definition":["to interrupt\/to break off\/to break (a bone)"],"pinyin":["da3 duan4"],"word":"打斷"}]}