{"definition":["to go back to one's roots\/to return to one's native place\/by ext. to join one's ancestors (i.e. to die)"],"pinyin":["hui2 lao3 jia1"],"simplified":["回老家"],"rank":14185.0,"normalized_rank":0.1984665538035342,"fraction":0.000004544137546585086,"cumulative_fraction":0.9554903115559196,"word":"回老家","characters":[{"definition":["to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)"],"pinyin":["hui2"],"word":"回"},{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[],"sentences":[{"english":"He dreams of the teaching job at Kabul University and of marrying a woman back home. She is the daughter of family friends a Sayed Shiite who traces her lineage to the prophet Muhammad.","chinese":"他夢想着在喀布爾大學任教，然後回老家娶媳婦。"},{"english":"The manager released him to return to his native town to visit his grandmother who was ill in bed.","chinese":"經理准許他休假回老家探視染病在牀的祖母。"},{"english":"They are wanting to get home again, the stupid toads!","chinese":"這些傻東西這陣兒又想回老家啦。"},{"english":"Return home today to worship grandfather.","chinese":"今天要回老家祭拜外公。"},{"english":"I actually go home each month to visit my family.","chinese":"其實俺每個月都有回老家看看家裏人。"},{"english":"According to the regulations concerned, he has only a couple of weeks (more than ten days) every four years to visit his relatives.","chinese":"期間按規定每四年纔能有十多天的時間回老家省親。"},{"english":"Later, yellow marshal be transferred to civilian work answered native place to become a 88 buses driver.","chinese":"後來，黃元帥轉業回老家當了一名88路公交車司機。"},{"english":"A native of the province, he hasn't been home for eight years.","chinese":"盧煒是湖南人，已經八年沒回老家了。"},{"english":"We sent the enemy home with their tails between their legs.","chinese":"我們把敵人打得夾着尾巴逃回老家了。"},{"english":"Every year in April to clear when, we have to drive back home early graves.","chinese":"每年四月清明的時候，我們都要起早驅車回老家掃墓。"},{"english":"Nothing special. I will go back to my hometown and stay with my family.","chinese":"沒有特別的計劃，就是回老家跟家人在一起。"}],"related":[{"definition":["native place\/place of origin\/home state or region"],"pinyin":["lao3 jia1"],"word":"老家"},{"definition":["to return home"],"pinyin":["hui2 jia1"],"word":"回家"},{"definition":["to return\/to go back"],"pinyin":["hui2 qu5"],"word":"回去"},{"definition":["(of a wife) to return to her parental home\/(fig.) to return to one's old place, job, school etc"],"pinyin":["hui2 niang2 jia1"],"word":"回娘家"},{"definition":["to celebrate the Chinese New Year"],"pinyin":["guo4 nian2"],"word":"過年"},{"definition":["to go on an official or business trip"],"pinyin":["chu1 chai1"],"word":"出差"},{"definition":["to visit relatives"],"pinyin":["zou3 qin1 qi5"],"word":"走親戚"},{"definition":["married woman's parents' home"],"pinyin":["niang2 jia5"],"word":"娘家"},{"definition":["dad and mom"],"pinyin":["ba4 ma1"],"word":"爸媽"},{"definition":["to make a trip home"],"pinyin":["tan4 jia1"],"word":"探家"},{"definition":["to go to work\/to be on duty\/to start work\/to go to the office"],"pinyin":["shang4 ban1"],"word":"上班"},{"definition":["to go home to visit one's family"],"pinyin":["tan4 qin1"],"word":"探親"},{"definition":["parts of the country other than where one is"],"pinyin":["wai4 di4"],"word":"外地"},{"definition":["countryside\/rural area\/CL:個|个[ge4]"],"pinyin":["xiang1 xia5"],"word":"鄉下"},{"definition":["wife's mother, mother-in-law"],"pinyin":["yue4 mu3"],"word":"岳母"},{"definition":["home"],"pinyin":["jia1 li3"],"word":"家裡"}]}