{"definition":["to turn round\/to turn one's head\/later\/by and by"],"pinyin":["hui2 tou2"],"simplified":["回头"],"rank":6812.0,"normalized_rank":0.09530871797741804,"fraction":0.000015331154283547566,"cumulative_fraction":0.8936894238749361,"word":"回頭","characters":[{"definition":["to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)"],"pinyin":["hui2"],"word":"回"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"}],"containing_words":[{"definition":["repeat customer"],"pinyin":["hui2 tou2 ke4"],"word":"回頭客"},{"definition":["to turn back\/to backtrack\/(fig.) to revert to the former way of doing things"],"pinyin":["zou3 hui2 tou2 lu4"],"word":"走回頭路"},{"definition":["lit. once you've shot the arrow, there's no getting it back (idiom)\/fig. once you started sth, there's no turning back\/to have to finish what one started\/to be determined to reach one's goals in spite of setbacks"],"pinyin":["kai1 gong1 mei2 you3 hui2 tou2 jian4"],"word":"開弓沒有回頭箭"},{"definition":["the return of a prodigal son (idiom)"],"pinyin":["lang4 zi3 hui2 tou2"],"word":"浪子回頭"},{"definition":["the road back to where one came from"],"pinyin":["hui2 tou2 lu4"],"word":"回頭路"},{"definition":["a prodigal son returned home is worth more than gold"],"pinyin":["lang4 zi3 hui2 tou2 jin1 bu4 huan4"],"word":"浪子回頭金不換"},{"definition":["lit. a good horse doesn't turn around and graze the same patch again (idiom)\/fig. once you've moved on, don't go back again (romantic relationship, job etc)\/leave the past behind"],"pinyin":["hao3 ma3 bu4 chi1 hui2 tou2 cao3"],"word":"好馬不吃回頭草"},{"definition":["See you!\/Bye!"],"pinyin":["hui2 tou2 jian4"],"word":"回頭見"},{"definition":["to stubbornly insist on one's own ideas (idiom)"],"pinyin":["bu4 zhuang4 nan2 qiang2 bu4 hui2 tou2"],"word":"不撞南牆不回頭"},{"definition":["return of the prodigal son"],"pinyin":["bai4 zi3 hui2 tou2"],"word":"敗子回頭"},{"definition":["The sea of bitterness has no bounds, turn your head to see the shore (idiom). Only Buddhist enlightenment can allow one to shed off the abyss of worldly suffering.\/Repent and ye shall be saved!"],"pinyin":["ku3 hai3 wu2 bian1 , hui2 tou2 shi4 an4"],"word":"苦海無邊，回頭是岸"}],"sentences":[{"english":"Bull Market Correcting or Bear Returning?","chinese":"此際是牛市調整或是熊市回頭？"},{"english":"In retrospect, I’d say that Huntington committed the Fundamental Attribution Error.","chinese":"回頭來看，我認爲亨廷頓犯了“基本的歸因錯誤”。"},{"english":"He'll do his celebrity impersonations .","chinese":"回頭他就表演套名人模仿秀。"},{"english":"When SSH jokes, he will turn hellos head and look for KTHsreaction.","chinese":"宋承憲講嘲笑話的時候回頭不雅察泰熙反映。"},{"english":"Frequently, natural go back not the most direct way.","chinese":"頻頻回頭的人，自然走不了遠路。"},{"english":"I walk slowly, but I never walk back.","chinese":"也許走得慢點兒，可我絕不會走回頭路。"},{"english":"We would lose a lot of time if we backtracked.","chinese":"如果我們倒回頭往原路開的話，會損失許多時間。"},{"english":"I made the call finally, and she thanked me gratefully and wanted to return home.","chinese":"我把電話打通了，她感激地謝了我，回頭就走。"},{"english":"But I am less interested in looking backward than I am in looking forwards.","chinese":"但是我對回頭看沒有興趣，我要朝前看。"},{"english":"Hamilton said he lost time in T9 (where Webber crashed) and on the final hairpin he lost whatever advantage he had.","chinese":"漢密爾頓說在9號彎角和最後一個回頭彎沒有跑好。"},{"english":"When SSH jokes, he will turn his head and look for KTHsreaction.","chinese":"宋承憲講冷笑話的時間回頭視察泰熙反映。"},{"english":"I noticed that he kept looking over at me. He had been doing a lot of that.","chinese":"我注意到他不斷回頭朝我這邊看，事實上他常這麼幹。"},{"english":"Don't look back, and don't stop anywhere in the plain!","chinese":"不可回頭看，也不可在平原站住。"},{"english":"Mr Bloom looked back towards the choir.","chinese":"布盧姆先生回頭望了望唱詩班。"},{"english":"As the donkey passed by, I looked back unknowingly.","chinese":"驢兒過去了，無意中回頭一看。"},{"english":"I am a slow walker, but I never walk back.","chinese":"我走的不快，但絕不走回頭路。"}],"related":[{"definition":["(of a person) to turn round\/to face about\/(of a widow) to remarry (archaic)"],"pinyin":["zhuan3 shen1"],"word":"轉身"},{"definition":["lit. that person\/fig. the person you have been looking for\/Mr Right\/the girl of one's dreams"],"pinyin":["na4 ge4 ren2"],"word":"那個人"},{"definition":["to say again\/to put off a discussion until later\/moreover\/what's more\/besides"],"pinyin":["zai4 shuo1"],"word":"再說"},{"definition":["(in the) past\/former\/previous\/to go over\/to pass by","(verb suffix)"],"pinyin":["guo4 qu4","guo4 qu5"],"word":"過去"},{"definition":["to raise one's head\/to gain ground\/account name, or space for writing the name on checks, bills etc"],"pinyin":["tai2 tou2"],"word":"抬頭"},{"definition":["to bow the head\/to yield\/to give in"],"pinyin":["di1 tou2"],"word":"低頭"},{"definition":["at that time\/originally"],"pinyin":["dang1 chu1"],"word":"當初"},{"definition":["to leave\/to exit"],"pinyin":["li2 qu4"],"word":"離去"},{"definition":["at once\/immediately\/promptly\/swiftly"],"pinyin":["li4 ma3"],"word":"立馬"},{"definition":["to renounce\/to abandon\/to give up"],"pinyin":["fang4 qi4"],"word":"放棄"},{"definition":["to depart\/to leave"],"pinyin":["li2 kai1"],"word":"離開"},{"definition":["the next one"],"pinyin":["xia4 yi1 ge5"],"word":"下一個"},{"definition":["(final particle, same as 吧)","to stop\/to cease\/to dismiss\/to suspend\/to quit\/to finish"],"pinyin":["ba4","ba5"],"word":"罷"},{"definition":["to separate\/to part"],"pinyin":["fen1 kai1"],"word":"分開"},{"definition":["to walk past\/to pass by"],"pinyin":["zou3 guo4"],"word":"走過"},{"definition":["to answer\/to respond\/to answer positively\/to agree\/to accept\/to promise"],"pinyin":["da1 ying5"],"word":"答應"}]}