{"definition":["to look back\/to review"],"pinyin":["hui2 gu4"],"simplified":["回顾"],"rank":5059.0,"normalized_rank":0.07078197361241308,"fraction":0.000023714357438974605,"cumulative_fraction":0.8603520395310792,"word":"回顧","characters":[{"definition":["to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)"],"pinyin":["hui2"],"word":"回"},{"definition":["surname Gu","to look after\/to take into consideration\/to attend to"],"pinyin":["Gu4","gu4"],"word":"顧"}],"containing_words":[{"definition":["retrospective (exhibition)"],"pinyin":["hui2 gu4 zhan3"],"word":"回顧展"},{"definition":["to look back at history"],"pinyin":["hui2 gu4 li4 shi3"],"word":"回顧歷史"}],"sentences":[{"english":"The clinical data of 36 cases of severe pulmonary contusion was reviewed.","chinese":"對36例嚴重肺挫傷患者的臨牀資料進行回顧性分析。"},{"english":"Methods To review the operative treatment of various kinds of fracture and luxation of anklebone in 60 cases.","chinese":"方法回顧60例各種踝關節骨折及脫位的手術治療。"},{"english":"Methods X-Ray films of 76 cases of ileocecal lesions were reviewed.","chinese":"方法回顧分析76例回盲部病變X線表現。"},{"english":"The end of the year is the best time to review and look ahead.","chinese":"年關是一個回顧和展望的好時機。"},{"english":"The second part recalled the Linxia's economic development model.","chinese":"第二部分是臨夏州經濟發展模式回顧。"},{"english":"In Chapter Two, theories on compensation are reviewed to form the theoretical foundation of translation of English alliteration into Chinese.","chinese":"第二章回顧了作爲頭韻漢譯理論基礎的翻譯補償理論。"},{"english":"Reviews of experience point to potential benefits and practical difficulties of such systems.","chinese":"回顧指向潛在利益與在這樣的系統中實際困難的經驗。"},{"english":"We will re-visit these a little later in the article.","chinese":"我們將在文章的後面部分再次回顧這些內容。"},{"english":"Methods The clinical data of 18 patients with SRMs were analyzed and summarized retrospectively.","chinese":"方法回顧性總結分析18例蝶骨嵴腦膜瘤的臨牀資料。"},{"english":"What does this sketchy historical record suggest for today's number one power?","chinese":"上述粗略的歷史回顧，對今天的頭號強國有何啓示呢？"},{"english":"Methods The clinical data of 33 cases of MPCDT were analysed retrospectively.","chinese":"方法回顧性分析33例消化道多原發癌的臨牀資料。"},{"english":"This paper revisits the issue of the relative advantages of improved search and knowledge.","chinese":"本論文重新回顧了高級搜索與知識相對優勢的問題。"},{"english":"Methods To analysis 46 cases with IPPV resisted to mechanical ventilation.","chinese":"方法對46例人機對抗患者進行回顧性分析。"},{"english":"Methods Retrospective study was made on 65 cases of acetabular fractures.","chinese":"方法對65例髖臼骨折進行回顧性研究。"},{"english":"Methods The imaging findings and pathologic characteristics of 31 patients with EGB were analyzed retrospectively.","chinese":"方法回顧分析31例EGB的影像表現及病理特徵。"},{"english":"This article has a brief review on Holocene climate changes in Mongolia.","chinese":"簡要地回顧了蒙古全新世氣候變化研究。"}],"related":[{"definition":["to sum up\/to conclude\/summary\/résumé\/CL:個|个[ge4]"],"pinyin":["zong3 jie2"],"word":"總結"},{"definition":["to come and go\/to have friendly relations with\/in the past\/previous"],"pinyin":["guo4 wang3"],"word":"過往"},{"definition":["experience\/CL:個|个[ge4],次[ci4]\/to experience\/to go through"],"pinyin":["jing1 li4"],"word":"經歷"},{"definition":["to learn sth over again\/to review\/to brush up\/to revive (memories, friendship etc)"],"pinyin":["chong2 wen1"],"word":"重溫"},{"definition":["to recall\/memories\/CL:個|个[ge4]"],"pinyin":["hui2 yi4"],"word":"回憶"},{"definition":["to return to\/to retreat\/regression (statistics)"],"pinyin":["hui2 gui1"],"word":"回歸"},{"definition":["to record\/record (written account)\/note-taker\/record (in sports etc)\/CL:個|个[ge4]"],"pinyin":["ji4 lu4"],"word":"記錄"},{"definition":["to investigate\/to probe"],"pinyin":["tan4 tao3"],"word":"探討"},{"definition":["to be witness to\/witness\/evidence"],"pinyin":["jian4 zheng4"],"word":"見證"},{"definition":["to introduce (sb to sb)\/to give a presentation\/to present (sb for a job etc)\/introduction"],"pinyin":["jie4 shao4"],"word":"介紹"},{"definition":["to guide\/to lead"],"pinyin":["dai4 ling3"],"word":"帶領"},{"definition":["to expound (a position)\/to elaborate (on a topic)\/to treat (a subject)"],"pinyin":["chan3 shu4"],"word":"闡述"},{"definition":["to discuss\/to talk over\/CL:個|个[ge4]"],"pinyin":["tao3 lun4"],"word":"討論"},{"definition":["lecture\/to make a speech"],"pinyin":["yan3 jiang3"],"word":"演講"},{"definition":["to talk about\/to narrate\/to give an account"],"pinyin":["jiang3 shu4"],"word":"講述"},{"definition":["theme\/subject"],"pinyin":["zhu3 ti2"],"word":"主題"}]}