{"definition":["lit. not eating for fear of choking (idiom); fig. to cut off one's nose to spite one's face\/to avoid sth essential because of a slight risk"],"pinyin":["yin1 ye1 fei4 shi2"],"simplified":["因噎废食"],"rank":35374.0,"normalized_rank":0.4949281546877842,"fraction":5.863921271043815e-7,"cumulative_fraction":0.9942713202852729,"word":"因噎廢食","characters":[{"definition":["cause\/reason\/because"],"pinyin":["yin1"],"word":"因"},{"definition":["to choke (on)\/to choke up\/to suffocate"],"pinyin":["ye1"],"word":"噎"},{"definition":["to abolish\/to abandon\/to abrogate\/to discard\/to depose\/to oust\/crippled\/abandoned\/waste"],"pinyin":["fei4"],"word":"廢"},{"definition":["to eat\/food\/animal feed\/eclipse","to feed (a person or animal)"],"pinyin":["shi2","si4"],"word":"食"}],"containing_words":[],"sentences":[{"english":"These remarks sound reasonable, yet in fact they are quite illogical.","chinese":"聽起來有理，其實是個因噎廢食的邏輯。"},{"english":"People won't stop eating just because of the risk of choking.","chinese":"人們不會因噎廢食。"},{"english":"But to not practice, to not get an injury would be counterproductive.","chinese":"但爲了躲避傷病而因噎廢食的做法只能是適得其反。"},{"english":"Theirworries and considerations are justified, but we should not give up eating for choking.","chinese":"他們的擔心和顧慮是正常的，但是我們不能因噎廢食。"},{"english":"However, he said, 'I'm trying to not freak out and just do something.","chinese":"不過他說，我努力讓自己不要因噎廢食，而是做點事。"},{"english":"But shall we stop eating for fear of choking?","chinese":"但我們是否該因噎廢食呢？"},{"english":"It sounds reasonable but it is actually a fallacy.","chinese":"聽起來有些理，其實是個因噎廢食的邏輯。"},{"english":"Though some deaths happened during the training, we should not give up eating for fear of choking.","chinese":"儘管訓練期間有出現死亡事故，但我們不能因噎廢食。"}],"related":[{"definition":["freedom of the media"],"pinyin":["mei2 ti3 zi4 you2"],"word":"媒體自由"},{"definition":["to keep on the right side of everyone (idiom)\/warm and affable"],"pinyin":["yi1 tuan2 he2 qi4"],"word":"一團和氣"},{"definition":["lit. to settle accounts after autumn\/settle scores at an opportune moment (idiom)"],"pinyin":["qiu1 hou4 suan4 zhang4"],"word":"秋後算賬"},{"definition":["lit. to assess the head and discuss the feet (idiom); minute criticism of a woman's appearance\/fig. to find fault in minor details\/to remark upon a person's appearance\/nitpicking\/overcritical\/judgmental"],"pinyin":["ping2 tou2 lun4 zu2"],"word":"評頭論足"},{"definition":["lit. to assess the head and discuss the feet (idiom); minute criticism of a woman's appearance\/fig. to find fault in minor details\/nitpicking\/overcritical"],"pinyin":["pin3 tou2 lun4 zu2"],"word":"品頭論足"},{"definition":["lit. seeing others go hunting, one is excited by memories of the thrill of the hunt (idiom)\/fig. seeing others do what one loves to do, one is inspired to try it again"],"pinyin":["jian4 lie4 xin1 xi3"],"word":"見獵心喜"},{"definition":["to refute\/to demolish (an argument, theory etc)"],"pinyin":["bo2 dao3"],"word":"駁倒"},{"definition":["lit. view a text and interpret (idiom); to interpret word by word without understanding the meaning\/a far-fetched interpretation"],"pinyin":["wang4 wen2 sheng1 yi4"],"word":"望文生義"},{"definition":["glib of tongue (idiom)\/eloquent"],"pinyin":["neng2 yan2 shan4 bian4"],"word":"能言善辯"},{"definition":["lit. to kill the chicken to get the eggs (idiom)\/fig. to kill the goose that lays the golden eggs"],"pinyin":["sha1 ji1 qu3 luan3"],"word":"殺雞取卵"},{"definition":["lit. not even the chickens and dogs are left undisturbed (idiom)\/fig. great commotion\/pandemonium"],"pinyin":["ji1 quan3 bu4 ning2"],"word":"雞犬不寧"},{"definition":["(not) a single person\/(no) one"],"pinyin":["ban4 ge5 ren2"],"word":"半個人"},{"definition":["political climate"],"pinyin":["zheng4 zhi4 qi4 hou4"],"word":"政治氣候"},{"definition":["to patch up one's lie (when inconsistencies appear)\/to cover (for sb who has lied)"],"pinyin":["yuan2 huang3"],"word":"圓謊"},{"definition":["overtones in conversation\/things indirectly implied from what is said"],"pinyin":["hua4 zhong1 you3 hua4"],"word":"話中有話"},{"definition":["lit. to swell one's face up by slapping it to look imposing (idiom); to seek to impress by feigning more than one's abilities"],"pinyin":["da3 zhong3 lian3 chong1 pang4 zi5"],"word":"打腫臉充胖子"}]}