{"definition":["state visit"],"pinyin":["guo2 shi4 fang3 wen4"],"simplified":["国事访问"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"國事訪問","characters":[{"definition":["country\/nation\/state\/national\/CL:個|个[ge4]","surname Guo"],"pinyin":["Guo2","guo2"],"word":"國"},{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"},{"definition":["to visit\/to call on\/to seek\/to inquire\/to investigate"],"pinyin":["fang3"],"word":"訪"},{"definition":["to ask"],"pinyin":["wen4"],"word":"問"}],"containing_words":[],"sentences":[{"english":"This is the second state visit to France by President Hu Jintao in the six years.","chinese":"這是時隔6年多後，胡錦濤再次對法國進行國事訪問。"},{"english":"The Prime Minister is on a three-day state visit to the US.","chinese":"目前，莫迪總理正在對美國進行爲期三天的國事訪問。"},{"english":"So the Estonian side is very glad at President Jiang's state visit to Estonia.","chinese":"因此，我們非常高興江主席來愛沙尼亞進行國事訪問。"},{"english":"Recently, Than Shwe concluded a five-day state visit to China.","chinese":"最近，丹瑞結束對中國爲期五天的國事訪問。"},{"english":"We are also busily preparing the state visit by Indian President to China.","chinese":"我們也在積極籌備印度總統對中國的國事訪問。"},{"english":"President Hu had a successful state visit to the United States in January.","chinese":"胡主席在一月份對美國進行了一次成功的國事訪問。"},{"english":"This week, President Obama makes his first state visit to China.","chinese":"奧巴馬總統即將在本週對中國進行首次國事訪問。"},{"english":"It was the first state visit in English history.","chinese":"這是英格蘭歷史上的首次國事訪問。"},{"english":"This is the first state visit to Kenya by President Hu.","chinese":"這是胡錦濤主席首次對肯尼亞進行國事訪問。"},{"english":"Cosgrove has been in China since last week on his first state visit.","chinese":"上週，科斯格羅夫來華進行首次國事訪問。"},{"english":"This state visit will be the first of the Obama administration.","chinese":"這將是奧巴馬政府接待的第一個國事訪問。"},{"english":"It is the starting point for state visits complete with red carpets and marching bands.","chinese":"作爲國事訪問的“序章”，它配有紅地毯和軍樂隊。"},{"english":"U.S. Vice President Joe Biden has wrapped up his six-day official visit to China.","chinese":"美國副總統拜登已經結束對中國爲期六天的國事訪問。"},{"english":"President Hu paid a state visit to France last time 6 years ago.","chinese":"這是時隔6年多後，胡錦濤再次對法國進行國事訪問。"}],"related":[]}