{"definition":["to surround\/to gird"],"pinyin":["wei2 zhu4"],"simplified":["围住"],"rank":14647.0,"normalized_rank":0.2049305332083444,"fraction":0.000004322105576128089,"cumulative_fraction":0.9575391237524432,"word":"圍住","characters":[{"definition":["surname Wei","to encircle\/to surround\/all around\/to wear by wrapping around (scarf, shawl)"],"pinyin":["Wei2","wei2"],"word":"圍"},{"definition":["to live\/to dwell\/to stay\/to reside\/to stop\/(suffix indicating firmness, steadiness, or coming to a halt)"],"pinyin":["zhu4"],"word":"住"}],"containing_words":[],"sentences":[{"english":"It's surrounded on three sides by council housing estates.","chinese":"它三面都被市建住宅區圍住。"},{"english":"No, though even here, the growers put plastic bags around the bunches to protect them and keep them warm.","chinese":"不，甚至在這種植者用塑料袋圍住香蕉樹使它們包暖。"},{"english":"After also sent from encirclement of the shaolin temple.","chinese":"之後還派了兵馬包圍住少林寺。"},{"english":"Could keep a chancel cool.","chinese":"可以圍住一團清涼。"},{"english":"Thick cotton padding embedded the precious vase in its box.","chinese":"厚厚的棉花填塞物緊緊圍住裝在盒子中的貴重花瓶。"},{"english":"He was besieged by reporters.","chinese":"他被記者團團圍住。"},{"english":"The celebrated violinist was mobbed by the audience.","chinese":"觀衆團團圍住了這位著名的小提琴演奏家。"},{"english":"The reactor is surrounded by a light protective shroud and steel plates.","chinese":"一個淺層的鋼板防護罩圍住了反應堆。"},{"english":"The police arrived as the hoodlums closed in on him.","chinese":"幾個惡棍逐漸將他團團圍住時，警察到了。"},{"english":"Farmers may want to put up electric fences to inclose enclose grazing areas, called productspaddocks.","chinese":"牧民可能想要電籬笆以圍住放牧區，這叫圍場。"},{"english":"Have one on the dome row the black clothes person come down and circle Yi snow.","chinese":"屋頂上就有一排黑衣人下來，圍住伊雪。"},{"english":"Packed in wooden cases iron hooped at both ends .","chinese":"木箱裝，兩端用鐵箍圍住。"},{"english":"Then he sent a unit to surround Longli southeast of Guiyang .","chinese":"於是他派遺了一支部隊去圍住貴陽東南的龍里。"},{"english":"She muffled her throat with a scarf.","chinese":"她用圍巾圍住脖子。"},{"english":"They glassed in the open porch.","chinese":"他們將門廊用玻璃圍住。"},{"english":"She was surrounded by reporters.","chinese":"她被記者包圍住了。"}],"related":[]}