{"definition":["Weichang Manchu and Mongol autonomous county in Chengde 承德[Cheng2 de2], Hebei","enclosure\/pig pen\/hunting ground exclusively kept for emperor or nobility (in former times)"],"pinyin":["Wei2 chang3","wei2 chang3"],"simplified":["围场"],"rank":28367.0,"normalized_rank":0.39689113371482937,"fraction":0.0000010892850516437378,"cumulative_fraction":0.9885875428506368,"word":"圍場","characters":[{"definition":["surname Wei","to encircle\/to surround\/all around\/to wear by wrapping around (scarf, shawl)"],"pinyin":["Wei2","wei2"],"word":"圍"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"}],"containing_words":[{"definition":["Weichang Manchu and Mongol autonomous county in Chengde 承德[Cheng2 de2], Hebei"],"pinyin":["Wei2 chang3 xian4"],"word":"圍場縣"},{"definition":["Weichang Manchu and Mongol autonomous county in Chengde 承德[Cheng2 de2], Hebei"],"pinyin":["Wei2 chang3 Man3 zu2 Meng3 gu3 zu2 Zi4 zhi4 xian4"],"word":"圍場滿族蒙古族自治縣"}],"sentences":[{"english":"At Qing Dynasty, it was a part of Shengjing Imperial Summer Resort.","chinese":"這樣一座城寨清朝時爲盛京圍場一部分。"},{"english":"The p paddocks will need water.","chinese":"圍場也需要水源。"},{"english":"I made off through harterhouse Yard into Long Lane.","chinese":"我由察忒豪斯圍場逃到長巷。"},{"english":"Built in 1938, the top-secret bunker was codenamed Paddock.","chinese":"建於1938年的最高機密地下堡壘代號“圍場”。"},{"english":"The boys were in the compound loafing .","chinese":"僱工們都在圍場上閒混。"},{"english":"Farmers may want to put up electric fences to inclose enclose grazing areas, called productspaddocks.","chinese":"牧民可能想要電籬笆以圍住放牧區，這叫圍場。"},{"english":"At the desert compound, Kimberly pleads with Rick to help her escape.","chinese":"在沙漠圍場，金伯利懇求裏克幫助她逃跑。"},{"english":"Farmers may want to put up electric fences to enclose grazing areas, called paddocks.","chinese":"農民可能想要圍繞放牧區建起電圍欄，也叫做圍場。"},{"english":"A cock crowed in the compound.","chinese":"圍場上一隻公雞啼起來了。"},{"english":"At the desert compound Kimberly pleads with Rick to help her escape.","chinese":"在沙漠圍場，金伯利懇求裏克幫助她逃跑。"},{"english":"The floor of Goat Paddock Crater is covered by sediments deposited since the Pleistocene Epoch.","chinese":"山羊圍場隕石坑的地面覆蓋着自更新世以來的沉積物。"},{"english":"Farmers may want put up electric fences to enclose grazing areas, called paddocks.","chinese":"牧民們可能想把牧區用電網圍起來，叫做圍場。"},{"english":"Rabbits cavort in the paddock at dawn and dusk.","chinese":"黎明和黃昏時，兔子在圍場裏跳躍。"},{"english":"He keeps horses in a paddock behind his house.","chinese":"他把馬養在屋後的小圍場裏。"},{"english":"The current reigning emperor is fatuous and self-indulgent, he just hunts in the hunting enclosure every day.","chinese":"現在的皇帝是個昏君，每天只知道在圍場打獵。"},{"english":"Down below, the mare paced the small enclosure and snorted nervously.","chinese":"母馬在下面的圍場裏踱步併發出緊張的哼聲。"}],"related":[]}