{"definition":["to sit in a circle\/seated around (a narrator)"],"pinyin":["wei2 zuo4"],"simplified":["围坐"],"rank":21696.0,"normalized_rank":0.30355518867264564,"fraction":0.000002017264825605041,"cumulative_fraction":0.9785618112619434,"word":"圍坐","characters":[{"definition":["surname Wei","to encircle\/to surround\/all around\/to wear by wrapping around (scarf, shawl)"],"pinyin":["Wei2","wei2"],"word":"圍"},{"definition":["surname Zuo","to sit\/to take a seat\/to take (a bus, airplane etc)\/to bear fruit\/variant of 座[zuo4]"],"pinyin":["Zuo4","zuo4"],"word":"坐"}],"containing_words":[],"sentences":[{"english":"You picture the family by the fire, the student lighting and relighting his pipe.","chinese":"想到圍坐在爐火旁的一家人，一個不斷點菸斗的學者。"},{"english":"Most of the time we sit around playing cards .","chinese":"大多數時間我們圍坐着打牌。"},{"english":"Silver-headed men sit around kerosene heaters.","chinese":"滿頭銀髮的男人圍坐在煤油暖氣機。"},{"english":"We eat chicken wings and sit by the fire.","chinese":"我們圍坐在爐火邊喫着雞翅。"},{"english":"Sit down at a table while eating.","chinese":"喫飯時應圍坐在餐桌旁邊。"},{"english":"Thirty years ago, families gathered around a radio each evening.","chinese":"三十年前，家家戶戶每天晚上圍坐着聽收音機。"},{"english":"Sit in at the knitting circle down at the yarn shop.","chinese":"在紗支小店裏圍坐一圈做做針線。"},{"english":"The three of us sat around a table on a balcony overlooking the courtyard.","chinese":"我們三人圍坐在陽臺的桌子旁，俯瞰着院子。"},{"english":"The drawing room was full of silent people, sitting at a long and ornate table. The.","chinese":"客廳裏都是人，安靜的圍坐在一張華麗的長桌邊。"},{"english":"The fondest memories are made when gathered around the table.","chinese":"最美妙的回想都是當各人圍坐在桌子當中。"},{"english":"Most sat around, waiting for instructions from an authority figure.","chinese":"當時大多數人圍坐在一起等着一個權威人物下達命令。"},{"english":"They sat round the table and made this big decision.","chinese":"他們圍坐在會議桌旁，作出了這個重大的決定。"},{"english":"They sat around the campfire telling tall tales about their hunting adventures.","chinese":"他們圍坐在篝火旁講着自己狩獵冒險的奇聞。"},{"english":"Every night we sit down at the table and have dinner together as a family (with no TV).","chinese":"每晚我們關掉電視機，一家人圍坐在桌旁喫晚飯。"},{"english":"They are gathered around a cypress tree which still stands.","chinese":"他們圍坐在一棵檜樹邊，那棵樹至今還依然屹立於此。"},{"english":"They sat together and chatted as they ate breakfast.","chinese":"一家人圍坐在一起，邊喫早飯邊聊天。"}],"related":[]}