{"definition":["to revolve around\/to center on (an issue)"],"pinyin":["wei2 rao4"],"simplified":["围绕"],"rank":2230.0,"normalized_rank":0.031200593231010314,"fraction":0.00006699395022862712,"cumulative_fraction":0.7470001441118858,"word":"圍繞","characters":[{"definition":["surname Wei","to encircle\/to surround\/all around\/to wear by wrapping around (scarf, shawl)"],"pinyin":["Wei2","wei2"],"word":"圍"},{"definition":["to wind\/to coil (thread)\/to rotate around\/to spiral\/to move around\/to go round (an obstacle)\/to by-pass\/to make a detour\/to confuse\/to perplex"],"pinyin":["rao4"],"word":"繞"}],"containing_words":[],"sentences":[{"english":"Therefore, the dissertation concentrates on the research of localization in WSNs.","chinese":"因此，本論文圍繞無線傳感器網絡定位技術展開研究。"},{"english":"The castle was embosomed in huge rocks.","chinese":"那座城堡有巨巖圍繞着。"},{"english":"Stalks of grain, representing the peasant population, surround the gate.","chinese":"圍繞着天安門的稻穗代表了中國的農民階級。"},{"english":"But the mystique that surrounded the terrorist chieftain in life is persisting in death.","chinese":"但是圍繞這位恐怖主義首領一生的謎團卻並未解開。"},{"english":"They plopped each turtle into a small pool surrounded by magnetic coils.","chinese":"他們把每個海龜放進有磁線圈圍繞的小池子裏。"},{"english":"The main topic of this paper is about steel pipe strapping machine.","chinese":"本論文主要是圍繞鋼管打捆機研製開發進行的。"},{"english":"Development governance encompasses the software development lifecycle.","chinese":"開發治理圍繞着軟件開發生命週期。"},{"english":"And this article makes a simple discussion about our Foreign Trade system.","chinese":"本文即圍繞我國外貿代理制度做出初步探討。"},{"english":"A host of misunderstanding swirls around Francis Schaeffer's reputation today.","chinese":"今天有許多錯誤的理解圍繞着薛華。"},{"english":"There are limits and acceptable behavior that surround the exercise of delegated authority.","chinese":"存在圍繞實行委託權力的限制和可接受的行爲。"},{"english":"Promotes the desired work culture around the Winning Ways of the IHG Hotels Group and the brand ethos.","chinese":"圍繞洲際酒店集團的致勝之道的企業文化和品牌理念。"},{"english":"No, you can see them by poking around Google Maps .","chinese":"不，你可以看到他們的洪學智就是圍繞谷歌地圖。"},{"english":"This thesis is to analyze his theory of journalism occupation from the before-mentioned aspects.","chinese":"本文將圍繞以上這幾個方面來討論他的新聞職業觀。"},{"english":"The tape acts as ribbing that we will be sewing around.","chinese":"這條帶子就像書的肋骨，幫助我們圍繞它進行縫訂。"},{"english":"Amid all the pomp and celebration, one of the darker aspects to the wedding was how thin she was too.","chinese":"圍繞着盛況和慶典，美中不足的一點是，新娘太瘦了。"},{"english":"The act of turning or winding or folding around a central axis .","chinese":"圍繞一箇中心軸翻或繞或疊的動作。"}],"related":[{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["main part\/bulk\/body\/subject\/agent"],"pinyin":["zhu3 ti3"],"word":"主體"},{"definition":["area\/region\/district"],"pinyin":["qu1 yu4"],"word":"區域"},{"definition":["theme\/subject"],"pinyin":["zhu3 ti2"],"word":"主題"},{"definition":["to combine\/to link\/to integrate\/binding\/CL:次[ci4]"],"pinyin":["jie2 he2"],"word":"結合"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引領"},{"definition":["and\/to give\/together with","to take part in","variant of 歟|欤[yu2]"],"pinyin":["yu2","yu3","yu4"],"word":"與"},{"definition":["change\/variation\/to change\/to vary\/CL:個|个[ge4]"],"pinyin":["bian4 hua4"],"word":"變化"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推進"},{"definition":["leading\/dominant\/prevailing\/to lead\/to direct\/to dominate"],"pinyin":["zhu3 dao3"],"word":"主導"},{"definition":["to build (housing)\/to construct\/to make"],"pinyin":["ying2 zao4"],"word":"營造"},{"definition":["ecology"],"pinyin":["sheng1 tai4"],"word":"生態"},{"definition":["site developed for a group of related enterprises\/(industrial or technology) park"],"pinyin":["yuan2 qu1"],"word":"園區"}]}