{"definition":["dome"],"pinyin":["yuan2 wu1 ding3"],"simplified":["圆屋顶"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"圓屋頂","characters":[{"definition":["circle\/round\/circular\/spherical\/(of the moon) full\/unit of Chinese currency (yuan)\/tactful\/to make consistent and whole (the narrative of a dream or a lie)"],"pinyin":["yuan2"],"word":"圓"},{"definition":["house\/room\/CL:間|间[jian1],個|个[ge4]"],"pinyin":["wu1"],"word":"屋"},{"definition":["apex\/crown of the head\/top\/roof\/most\/to carry on the head\/to push to the top\/to go against\/to replace\/to substitute\/to be subjected to (an aerial bombing, hailstorm etc)\/(slang) to \"bump\" a forum thread to raise its profile\/classifier for headwear, hats, veils etc"],"pinyin":["ding3"],"word":"頂"}],"containing_words":[],"sentences":[{"english":"Other Russian churches also have flame-shaped domes.","chinese":"俄羅斯其它教堂也有這種火焰狀的圓屋頂。"},{"english":"The sun transform the gild cupola into dazzling point of light.","chinese":"太陽將這些鍍金的圓屋頂變成了閃耀的光點。"},{"english":"He saw the round rooves of the towers.","chinese":"他看到了一座塔的圓屋頂。"},{"english":"A hole on the dome: a dove in the hole.","chinese":"圓屋頂上有個洞，洞裏有隻鴿子。"},{"english":"We lived under a dome at the bottom of the ocean.","chinese":"我們住在海底的一個圓屋頂下。"},{"english":"Other Russian churches also have flame-shaped domes.","chinese":"俄羅斯其它教堂也有火焰狀的圓屋頂。"},{"english":"So the domes of complicated system are appearing from the skies.","chinese":"像圓屋頂一樣複雜的系統從天空出現。"},{"english":"Dome:a hemispherical roof or vault.","chinese":"類似於穹隆或圓屋頂的結構或物體。"},{"english":"Quincy Market dome, Faneuil Hall Marketplace. Boston, Massachussets, USA.","chinese":"昆西市場圓屋頂，法納爾集市門廳。"},{"english":"The chestnut was in flower and the bells rang out high clear over her gables and cupola.","chinese":"慄樹開花，鐘聲清晰地高高飄過山牆和圓屋頂。"},{"english":"Lamella domes and vaults consist of inter-connecting steel or aluminium units.","chinese":"薄片圓屋頂和地下室由連結之間的鋼或者鋁單位組成。"}],"related":[]}