{"definition":["parentheses\/round brackets ( )"],"pinyin":["yuan2 kuo4 hao4"],"simplified":["圆括号"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"圓括號","characters":[{"definition":["circle\/round\/circular\/spherical\/(of the moon) full\/unit of Chinese currency (yuan)\/tactful\/to make consistent and whole (the narrative of a dream or a lie)"],"pinyin":["yuan2"],"word":"圓"},{"definition":["to enclose\/to include\/also pr. [gua1]"],"pinyin":["kuo4"],"word":"括"},{"definition":["ordinal number\/day of a month\/mark\/sign\/business establishment\/size\/ship suffix\/horn (wind instrument)\/bugle call\/assumed name\/to take a pulse\/classifier used to indicate number of people","roar\/cry\/CL:個|个[ge4]"],"pinyin":["hao2","hao4"],"word":"號"}],"containing_words":[],"sentences":[{"english":"The parentheses are empty, which indicates that the method takes no arguments.","chinese":"圓括號內是空的，表示了這種方法不包含任何參數。"},{"english":"Let's start from the innermost set of parentheses.","chinese":"讓我們從圓括號的最裏面開始。"},{"english":"The right-left rule: Start reading the declaration from the innermost parentheses, go right, and then go left.","chinese":"首先從最裏面的圓括號看起，然後往右看，再往左看。"},{"english":"It's just an input to a function, the thing inside parentheses.","chinese":"圓括號裏面的東西，只是一個函數的輸入。"},{"english":"As with a function call, you must supply parentheses.","chinese":"對於函數調用，必須提供圓括號。"},{"english":"Groupings are specified by a group of characters within parentheses.","chinese":"分組是由圓括號內的一組字符指定的。"},{"english":"The green block is gonna become a pair of parentheses.","chinese":"只需要把綠色版塊換成一對圓括號就可以了。"},{"english":"The parenthesized series of commands is called a subshell.","chinese":"命令中帶圓括號的部分稱爲subshell。"},{"english":"Groups are subpatterns in the regular expression that are surrounded by parenthesis.","chinese":"組是正則表達式中的子模式，它們包含在圓括號中。"},{"english":"It must be followed by the function name and the parenthesized list of formal parameters.","chinese":"在其後必須跟有函數名和包括形式參數的圓括號。"}],"related":[]}