{"definition":["disk"],"pinyin":["yuan2 pan2"],"simplified":["圆盘"],"rank":32223.0,"normalized_rank":0.4508415765393925,"fraction":7.747032657562741e-7,"cumulative_fraction":0.9921432550833944,"word":"圓盤","characters":[{"definition":["circle\/round\/circular\/spherical\/(of the moon) full\/unit of Chinese currency (yuan)\/tactful\/to make consistent and whole (the narrative of a dream or a lie)"],"pinyin":["yuan2"],"word":"圓"},{"definition":["plate\/dish\/tray\/board\/hard drive (computing)\/to build\/to coil\/to check\/to examine\/to transfer (property)\/to make over\/classifier for food: dish, helping\/to coil\/classifier for coils of wire\/classifier for games of chess"],"pinyin":["pan2"],"word":"盤"}],"containing_words":[],"sentences":[{"english":"The main rotary shaft can be simultaneously fixed with a plurality of circular discs with self rotation shafts.","chinese":"主轉軸上可同時固定多個帶自轉軸的圓盤。"},{"english":"And then the lake itself is like a plate which spreads before the eyes of the outlooker.","chinese":"在外來者眼前，西湖看起來就像是一個平放着的圓盤。"},{"english":"The cavitation erosion regularity of five steels of different heat treatments was studied using rotating disc testing equipment.","chinese":"在旋轉圓盤儀上對五種鋼的氣蝕破壞規律進行了研究。"},{"english":"The resulting object is a rotationally supported disk.","chinese":"結果便形成了一個由轉動所支撐的圓盤。"},{"english":"It appeared to be about 30 feet wide with a disc-shape apparent, when lights on it dimmed .","chinese":"這似乎是約30英尺寬的圓盤形狀明顯，當燈它變暗。"},{"english":"Thebalance equation of power driven disc plow is built.","chinese":"建立了旱田驅動圓盤犁機組的平衡方程式。"},{"english":"In this paper the structure and technology of disk rotor spider are discussed.","chinese":"本文主要探討圓盤式轉子支架的結構和工藝問題。"},{"english":"Now take your disk with its normal vector sticking up.","chinese":"現在我們拿這個法向量向上的圓盤。"},{"english":"An alternative method is suggested for calculating the fiber length distribution frequencies, For this purpose a special slide …","chinese":"建議用一特別設計的計算尺來代替計算圓盤。"},{"english":"It looked like a huge disc.","chinese":"它看起來像一個巨大的圓盤。"},{"english":"The study result in the paper can be for reference in designing the products of Driving disk-plow.","chinese":"文中研究結果可供驅動式圓盤犁產品設計時參考。"},{"english":"Design process of fixtures for discal lathe was discussed.","chinese":"論述了圓盤式車牀夾具的設計過程。"},{"english":"Stack of size 4, again I'm going there, so I'm going to do this initially, no I'm not, I'm going to start again.","chinese":"同樣的，移動上面四個圓盤，同樣也是。"},{"english":"A circular grid in a phototypesetting machine.","chinese":"照相排版機的圓盤字模板。"},{"english":"The disc swirl spinning is a new method of spinning.","chinese":"圓盤式旋流紡紗是一種新型紡紗方法。"},{"english":"1LYQD series drive disk plough is a new-type cultivating machine.","chinese":"1LYQD系列驅動圓盤犁是一種新型耕地機器。"}],"related":[{"definition":["oval\/ellipse\/elliptic"],"pinyin":["tuo3 yuan2"],"word":"橢圓"},{"definition":["semicircle"],"pinyin":["ban4 yuan2"],"word":"半圓"},{"definition":["sphere"],"pinyin":["qiu2 zhuang4"],"word":"球狀"},{"definition":["figure\/bodily form"],"pinyin":["ti3 xing2"],"word":"體形"},{"definition":["a bar\/a strip"],"pinyin":["tiao2 xing2"],"word":"條形"},{"definition":["unsymmetrical\/asymmetric"],"pinyin":["bu4 dui4 chen4"],"word":"不對稱"},{"definition":["shoulder strap\/shoulder harness\/shoulder belt\/baldric\/CL:條|条[tiao2]"],"pinyin":["jian1 dai4"],"word":"肩帶"},{"definition":["circular cylinder\/drum"],"pinyin":["yuan2 tong3"],"word":"圓筒"},{"definition":["oblate"],"pinyin":["bian3 yuan2"],"word":"扁圓"},{"definition":["form\/shape\/CL:個|个[ge4]"],"pinyin":["xing2 zhuang4"],"word":"形狀"},{"definition":["line\/trace\/mark\/pattern\/grain (of wood etc)"],"pinyin":["wen2"],"word":"紋"},{"definition":["great circle (in spherical geometry)"],"pinyin":["da4 yuan2"],"word":"大圓"},{"definition":["dot"],"pinyin":["yuan2 dian3"],"word":"圓點"},{"definition":["mellow and full\/suave\/smooth and round\/rich (in voice)"],"pinyin":["yuan2 run4"],"word":"圓潤"},{"definition":["to fold\/collapsible\/folding (bicycle, antenna, bed etc)"],"pinyin":["zhe2 die2"],"word":"折疊"},{"definition":["type\/style"],"pinyin":["yang4 shi4"],"word":"樣式"}]}