{"definition":["Tumen county level city in Yanbian Korean autonomous prefecture 延邊朝鮮族自治州|延边朝鲜族自治州, Jilin"],"pinyin":["Tu2 men2"],"simplified":["图们"],"rank":47341.0,"normalized_rank":0.6623620108292642,"fraction":1.8874907153247827e-7,"cumulative_fraction":0.9985182284064744,"word":"圖們","characters":[{"definition":["diagram\/picture\/drawing\/chart\/map\/CL:張|张[zhang1]\/to plan\/to scheme\/to attempt\/to pursue\/to seek"],"pinyin":["tu2"],"word":"圖"},{"definition":["plural marker for pronouns, and nouns referring to individuals"],"pinyin":["men5"],"word":"們"}],"containing_words":[{"definition":["Tumen river in Jilin province 吉林省, forming the eastern border between China and North Korea"],"pinyin":["Tu2 men2 jiang1"],"word":"圖們江"},{"definition":["Tumen county level city in Yanbian Korean autonomous prefecture 延邊朝鮮族自治州|延边朝鲜族自治州, Jilin"],"pinyin":["Tu2 men2 Shi4"],"word":"圖們市"}],"sentences":[{"english":"North Koreans keep on wading the Tumen River.","chinese":"不過朝鮮人並未被嚇阻，他們繼續涉過圖們江。"},{"english":"V. Accelerating development of the Tumen River area and promoting overall cooperation in Northeast Asia.","chinese":"加快圖們江區域開發，推進東北亞全面合作。"},{"english":"The border zone along the Tumen River became the main crossing point for refugees fleeing into China, and for smuggling Chinese goods back into North Korea.","chinese":"大批難民跨越圖們江湧向中國，或走私中國貨到朝鮮。"},{"english":"Under the new circumstances, the regional development of the Tumen River area is especially important.","chinese":"在新形勢下，圖們江區域合作開發工作尤爲重要。"},{"english":"In the near future , the Russian Tumen River Region Negotiation Conference will also be held in Vladivostok.","chinese":"近期還將在海參崴舉行俄羅斯圖們江地區招商會。"},{"english":"The State Council has approved a border development zone in the Tumen River Delta.","chinese":"國務院已同意在圖們江流域設立邊境發展區。"},{"english":"Russian Tumen River Region Negotiation Conference will also be held in Vladivostok.","chinese":"近期還將在海參崴舉行俄羅斯圖們江地區招商會。"},{"english":"Tumen Peoples Hospital has gained great changes in eight years.","chinese":"吉林省圖們市人民醫院八年來取得了巨大變化。"}],"related":[]}