{"definition":["graph theory (math.)"],"pinyin":["tu2 lun2"],"simplified":["图论"],"rank":62653.0,"normalized_rank":0.8765967568172597,"fraction":2.6421950462009714e-8,"cumulative_fraction":0.9999043430507882,"word":"圖論","characters":[{"definition":["diagram\/picture\/drawing\/chart\/map\/CL:張|张[zhang1]\/to plan\/to scheme\/to attempt\/to pursue\/to seek"],"pinyin":["tu2"],"word":"圖"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"論"}],"containing_words":[],"sentences":[{"english":"The theory of graph investigates the combination of number and graphs as well various applications.","chinese":"圖論則是着重於數形結合的描述及各種實際應用。"},{"english":"The max-cut problem is a standard NP-hard problem in graph graphic theory.","chinese":"最大割問題是圖論中的一個典型的NP困難問題。"},{"english":"Graph theory and matroid theory have witnessed an unprecedented growth in the twentieth century.","chinese":"圖論和擬陣理論在二十世紀經歷了空前的發展。"},{"english":"Bipartite graph is a special model in the Graph Theory.","chinese":"偶圖是圖論中的一種特殊模型。"},{"english":"Triangulardebt problems are studied upon the views of graphic theory and networking.","chinese":"本文用圖論和網絡的理論和方法研究三角債問題。"},{"english":"However there still exist lots of problems in the basic graph theory.","chinese":"然而在基礎圖論中仍然存在許多難題有待解決。"},{"english":"This paper has introduced how to use the graph theory method to calculate the sectorial coordinate of the variable cross-section box girder.","chinese":"介紹了用圖論法計算變截面箱梁斷面的扇性座標。"},{"english":"The minimal vertex- covering problem of graph is a NP-complete problem of graph theory.","chinese":"圖的最小頂點覆蓋問題是圖論中的一個NP完全問題。"},{"english":"The study of directed graphs(or digraphs , as we shall usually abbreviate them) arises out of the question, 'what happens if all of the roads are one-way streets?","chinese":"圖論中還將大量研究一些包含具有特徵的路的圖。"},{"english":"In this paper an algorithm based on graph theory is presented.","chinese":"提出一種基於圖論的跳步排樣優化算法。"},{"english":"A description was carried out on the complicated epicyclic gear train by adopting the functional schematic diagram and the knowledge of graph theory.","chinese":"採用功能示意圖和圖論知識對複雜週轉輪系進行描述。"},{"english":"For example, interesting work has been done in numerics and for graphs.","chinese":"比如在數值運算和圖論方面都有了許多有趣的工作。"},{"english":"Explain the basic properties of randomized algorithms and methods for analyzing them.","chinese":"解釋主要圖論演算法及對它們的分析。"},{"english":"At last, the graph-theoretical characteristic of positive transitive fuzzy matrixes is revealed.","chinese":"最後，進一步揭示了正傳遞模糊矩陣的圖論特徵。"},{"english":"The theory that the article uses graph talking and network and problem of debt of methodological research triangle.","chinese":"本文用圖論和網絡的理論和方法研究三角債問題。"},{"english":"Moreover, the graph theory method can be used to calculate other parameters.","chinese":"而且，用圖論法還可以計算其他扇性特徵參數。"}],"related":[]}