{"definition":["(criminal) gang\/gang member\/accomplice\/crony"],"pinyin":["tuan2 huo3"],"simplified":["团伙"],"rank":4198.0,"normalized_rank":0.05873546653981224,"fraction":0.00003117177048484327,"cumulative_fraction":0.837015030316146,"word":"團伙","characters":[{"definition":["round\/lump\/ball\/to roll into a ball\/to gather\/regiment\/group\/society\/classifier for a lump or a soft mass: wad (of paper), ball (of wool), cloud (of smoke)"],"pinyin":["tuan2"],"word":"團"},{"definition":["meals (abbr. for 伙食[huo3 shi2])\/variant of 夥|伙[huo3]"],"pinyin":["huo3"],"word":"伙"}],"containing_words":[{"definition":["a criminal gang"],"pinyin":["fan4 zui4 tuan2 huo3"],"word":"犯罪團伙"}],"sentences":[{"english":"The cons cover the hole and hide the concrete.","chinese":"團伙們掩蓋了洞口將混凝土藏好。"},{"english":"His headquarters are somewhere in the Everglades, his gang are a mixed-up bunch.","chinese":"其總部設在某處沼澤地，他的團伙是一個混合了一堆。"},{"english":"\"Organized gangs, maybe 50 men, are coming in on horseback,\" Tong said.","chinese":"“一個約50人的有組織團伙，都騎着馬，”唐說。"},{"english":"Drivers say migrants and people trafficking gangs have attacked their vehicles with metal bars.","chinese":"司機們稱難民和偷渡團伙用金屬桿襲擊過他們的車。"},{"english":"But the gang goes on.","chinese":"但是該團伙仍在作案。"},{"english":"He suspects young footballers from poorer nations are being targeted by criminal gangs.","chinese":"他懷疑來自貧困國家的球員是犯罪團伙的目標。"},{"english":"How did the criminal gangs of Zhang Hong and Zhang Jieliang wash their guilt in collusion with a legal practitioner?","chinese":"張虹張傑良等犯罪團伙，同法律工作者如何洗罪？"},{"english":"Many in Baltimore believe he was beaten by local criminal gangs.","chinese":"巴爾的摩的許多人認爲他被當地的犯罪團伙毆打了。"},{"english":"The wheels spin in the mud and the men jump out to push it.","chinese":"輪子在泥漿中打滑，團伙們跳出車外推車。"},{"english":"The cons move through the halls to the infirmary door.","chinese":"團伙們穿過了過道，來到醫務室門口。"},{"english":"The soldiers handcuff the ring leader and cover his head.","chinese":"士兵們拷上了團伙的頭目並蓋住他的頭。"},{"english":"Later, Joe slipped into crime to help reduce the burden of family.","chinese":"之後，喬也加入了犯罪團伙，想幫助減輕家庭負擔。"},{"english":"The band of thieves decamped in the night.","chinese":"竊賊團伙星夜潛逃了。"},{"english":"Police said the amount of money-laundering gang of up to 1 billion pounds.","chinese":"警方稱，該團伙洗錢金額高達1億英鎊。"},{"english":"The local gang forced all the residents in the neighbourhood to kick over 10 dollars a month.","chinese":"當地黑幫團伙迫使該街區內居民每月繳付10美元。"},{"english":"Mexican officials said the suspect had confessed to being a lookout for the gang.","chinese":"墨西哥官員表示，嫌疑人交待，曾爲犯罪團伙放哨。"}],"related":[]}