{"definition":["vernacular\/slang\/dialect\/patois"],"pinyin":["tu3 hua4"],"simplified":["土话"],"rank":42626.0,"normalized_rank":0.5963930435269262,"fraction":3.0071391133558026e-7,"cumulative_fraction":0.997382406563259,"word":"土話","characters":[{"definition":["Tu (ethnic group)\/surname Tu","earth\/dust\/clay\/local\/indigenous\/crude opium\/unsophisticated\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Tu3","tu3"],"word":"土"},{"definition":["dialect\/language\/spoken words\/speech\/talk\/words\/conversation\/what sb said\/CL:種|种[zhong3],席[xi2],句[ju4],口[kou3],番[fan1]"],"pinyin":["hua4"],"word":"話"}],"containing_words":[],"sentences":[{"english":"Previously also speak Mandarin, Sichuan, guests hear the words, but also with soil any more.","chinese":"先前還講普通話，聽到客人是四川話，也用土話了。"},{"english":"An American who has been short-changed would complain in the vernacular of being \"stiffed\".","chinese":"在美國土話中，常把被人愚弄形容成“僵化了。"},{"english":"The second part is about the comprehensive comparison of the consonants of Tuhua.","chinese":"第二節永州土話聲母綜合比較。"},{"english":"These writers, by representing dialects in their novels, bravely violated the boundaries between dialects and standard English as socio linguists prescribed.","chinese":"這些作家以極大的勇氣去表現爲輿論所鄙夷的土話。"},{"english":"From the third to fifth part, is to study Changshan dialect's morphology.","chinese":"第三至五部分是崇山土話的詞法研究。"},{"english":"Religious works were converted from Latin into the vernacular.","chinese":"宗教作品從拉丁文被轉化成當地的土話。"},{"english":"Forinstance, use southern jargon for someone living in the south.","chinese":"比如說，讓來自南方的人說南方土話。"},{"english":"Jiahe Tuhua used in this area has huge internal differences.","chinese":"湖南嘉禾縣屬於湘南雙方言區，其土話內部差異較大。"},{"english":"They like his slang and his brag and his blunders.","chinese":"他們很喜歡聽他說土話，吹牛皮或胡說八道。"},{"english":"Jiahe County is a bi-dialectal area in south Hunan Province. Jiahe Tuhua used in this area has huge internal differences.","chinese":"湖南嘉禾縣屬於湘南雙方言區，其土話內部差異較大。"}],"related":[]}