{"definition":["(included) in it\/among them"],"pinyin":["zai4 nei4"],"simplified":["在内"],"rank":1830.0,"normalized_rank":0.02560407426580667,"fraction":0.00008492584191234686,"cumulative_fraction":0.7167115103878313,"word":"在內","characters":[{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"},{"definition":["inside\/inner\/internal\/within\/interior"],"pinyin":["nei4"],"word":"內"}],"containing_words":[],"sentences":[{"english":"All their costs, including study and living expenses, will be covered by the fund.","chinese":"包括通信費在內的大部分支出，都會由公司支付。"},{"english":"They also take into consideration the difficulty of the shot.","chinese":"鏡頭的易度果豔也會斟酌在內。"},{"english":"In other words polarization properties are excluded.","chinese":"換句話說，偏振性質未包括在內。"},{"english":"20 the lampstands of pure gold with their lamps, to burn in front of the inner sanctuary as prescribed;","chinese":"並精金的燈臺和燈盞，可以照例點在內殿前。"},{"english":"Counseling or interjecting personal opinion is never permitted.","chinese":"翻譯過程中不許摻雜譯者的個人觀點在內。"},{"english":"There are six people in my family counting my grandfather and grandmother.","chinese":"我家裏連祖父母算在內有六口人。"},{"english":"With Meher Baba's great love in our hearts, external disasters can't harm us.","chinese":"有美赫巴巴之大戀愛藏在內心中，無外災可傷害。"},{"english":"I tend to extend the vernacular to include the owner of the software asset, such that","chinese":"我打算擴展包括軟件資源擁有者在內的這些概念。"},{"english":"Requests for essential supplies, including diagnostic reagents, are being met.","chinese":"正在滿足對包括診斷試劑在內的基本用品的要求。"},{"english":"Websites including Gawker have reported on the site.","chinese":"包括Gawker在內的多家網都對此進行了報道。"},{"english":"Do not violate third-party intellectual property rights, including copyrights and trademarks.","chinese":"請勿侵害包括版權，商標在內的第三方知識產權。"},{"english":"The dilemma is that not one single country within the EU is below the 3% limit, not even Germany.","chinese":"事實是包括德國在內，沒有一個國家刺字低於3%。"},{"english":"The men, who included four guards, were injured by rubber bullets and machetes.","chinese":"包括4名警衛在內的傷者因橡膠彈和大砍刀而受傷。"},{"english":"Sadly, video files are not on the list of accepted formats.","chinese":"遺憾的是，視頻文件不包含在內。"},{"english":"You have to take capital appreciation of the property into account.","chinese":"你必須將該處房產的資本增值考慮在內。"},{"english":"None of us, including the veteran comrades, is sufficiently capable of directing modern wars.","chinese":"指揮現代化戰爭，包括我們老同志在內，能力都不夠。"}],"related":[]}