{"definition":["after this\/afterwards\/next"],"pinyin":["zai4 ci3 zhi1 hou4"],"simplified":["在此之后"],"rank":27142.0,"normalized_rank":0.3797517943838932,"fraction":0.0000012208108934463388,"cumulative_fraction":0.9871737925978792,"word":"在此之後","characters":[{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"},{"definition":["this\/these"],"pinyin":["ci3"],"word":"此"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["back\/behind\/rear\/afterwards\/after\/later\/post-"],"pinyin":["hou4"],"word":"後"}],"containing_words":[],"sentences":[{"english":"After that you should get yourself confortable with the development team.","chinese":"在此之後你就應該能適應開發團隊了。"},{"english":"After that, determine the compliance issues which pertain to your company.","chinese":"在此之後，確定一份有關你的公司的守則。"},{"english":"But the Glass family saga that followed is the larger accomplishment.","chinese":"在此之後，格拉斯家族的傳奇取得了更大成就。"},{"english":"Almost immediately after this I wish I'd kept my mouth shut.","chinese":"幾乎是在此之後的立刻，我希望我的嘴被縫起來。"},{"english":"After this, create the workflow and the sample documents.","chinese":"在此之後，創建工作流和示例文檔。"},{"english":"After that, the installer gets the installation media from the installation server.","chinese":"在此之後，安裝程序會從安裝服務器獲得安裝介質。"},{"english":"But as time is going along, we were also kind of opportunistic.","chinese":"在此之後，我們很有幸地。"},{"english":"After this I went to Dasi as I need to head back towards Taipei.","chinese":"在此之後，我到了大溪因爲我需要回到臺北。"},{"english":"And if you notice the signs today, it would all be changed right after that.","chinese":"如果你今天注意到了標示，會發現在此之後都變了。"},{"english":"After that, your bonus is no longer redeemable.","chinese":"在此之後，你的獎金不再贖回。"},{"english":"In the aftermath, the area was drenched in water with clothes and shoes piled on the bridge.","chinese":"在此之後，該地區是衣服和鞋上的橋樁水淋溼了。"},{"english":"After this they collates all results to produce final rankings.","chinese":"在此之後，他們整理所有結果產生最終排名。"},{"english":"After that, we can chase after those other needs.","chinese":"在此之後，我們可以去追逐其它層次的需求。"},{"english":"After that, select Bevel and Emboss and just follow the image below.","chinese":"在此之後，選擇斜面和浮雕，只是按照以下的形象。"},{"english":"Russia looked menacing after the break and Dmitry Sychev twice went close.","chinese":"在此之後，俄羅斯攻勢兇猛，史切夫兩次險些破門。"},{"english":"Afterwards, however, most Quarren wanted nothing to do with Rebellion.","chinese":"然而在此之後，大多數誇潤人不想與義軍有所關聯。"}],"related":[]}