{"definition":["topographic map"],"pinyin":["di4 xing2 tu2"],"simplified":["地形图"],"rank":36009.0,"normalized_rank":0.5038126285450449,"fraction":5.535471610604469e-7,"cumulative_fraction":0.994633246119014,"word":"地形圖","characters":[{"definition":["-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct","earth\/ground\/field\/place\/land\/CL:片[pian4]"],"pinyin":["de5","di4"],"word":"地"},{"definition":["to appear\/to look\/form\/shape"],"pinyin":["xing2"],"word":"形"},{"definition":["diagram\/picture\/drawing\/chart\/map\/CL:張|张[zhang1]\/to plan\/to scheme\/to attempt\/to pursue\/to seek"],"pinyin":["tu2"],"word":"圖"}],"containing_words":[],"sentences":[{"english":"And then, the contour plot will be the topographical map for this graph.","chinese":"等高線就像是這幅圖的地形圖。"},{"english":"The perioperative EEG non-linear topographic map of approximate entropy was recorded.","chinese":"記錄圍術期近似熵腦電非線性地形圖。"},{"english":"Nexus - information on refractive and cataract surgery, corneal topography and topographers.","chinese":"屈光矯正，白內障手術，角膜地形圖的有關信息。"},{"english":"These basins are evident in the topographic image.","chinese":"這些盆地在地形圖中很明顯。"},{"english":"Map vectorization is one of primary ways to capture digital spacial information from topographic map .","chinese":"地形圖的矢量化是獲取數字地理信息的主要途徑之一。"},{"english":"Does this possibility require the topology of a four-cornered game?","chinese":"這個可能性需要一個四角形的遊戲的地形圖嗎？"},{"english":"Topographic mapping and application of an ordinary surveying one of the core content.","chinese":"地形圖的測繪和應用是普通測量學的核心內容之一。"},{"english":"The brain topography also shows that both stimuli have similar potential distribution.","chinese":"腦地形圖也顯示，這兩種刺激的引起的電位分佈相似。"},{"english":"Do you need topographic maps because you're wanting to get away into the backcountry?","chinese":"你需要的地形圖，因爲你想逃脫到窮鄉僻壤？"},{"english":"The classification and codifying of topographic map essential factors.","chinese":"地形圖要素的分類和編碼。"},{"english":"The application of brain electrical activity mapping in neuropsychology is intro-duced.","chinese":"對腦電地形圖在神經心理研究中的應用作一綜述。"},{"english":"They differ somewhat from bathymetric charts which are virtually topographic maps of the ocean floor.","chinese":"們與水深圖稍有不同，後者實際上是洋底地形圖。"},{"english":"To evaluate differences on astigmatism in corneal topography and mydriatic optometry.","chinese":"目的觀察角膜地形圖儀與散瞳驗光測得的散光差異。"}],"related":[]}