{"definition":["illegally recycled waste cooking oil"],"pinyin":["di4 gou1 you2"],"simplified":["地沟油"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"地溝油","characters":[{"definition":["-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct","earth\/ground\/field\/place\/land\/CL:片[pian4]"],"pinyin":["de5","di4"],"word":"地"},{"definition":["ditch\/gutter\/groove\/gully\/ravine\/CL:道[dao4]"],"pinyin":["gou1"],"word":"溝"},{"definition":["oil\/fat\/grease\/petroleum\/to apply tung oil, paint or varnish\/oily\/greasy\/glib\/cunning"],"pinyin":["you2"],"word":"油"}],"containing_words":[],"sentences":[{"english":"It’s from the sewer and it’s called hogwash oil.","chinese":"來自下水道，也被稱爲地溝油。"},{"english":"To be frank, big restaurants and big hotels are the main places producing drainage oil.","chinese":"說白了，大酒樓大賓館是地溝油的主要產地。"},{"english":"Others point out that alternative uses for gutter oil may hold an explanation.","chinese":"其他人指出，尋求地溝油的其他用途可能比較靠譜。"},{"english":"This factory began to process gutter cooking oil as early as 2003.","chinese":"這間工廠早在2003年就開始加工地溝油。"},{"english":"Illegal processors may then sell the oil back to restaurants.","chinese":"非法加工者再將地溝油回賣給餐廳。"},{"english":"Other critics claim that confiscating gutter oil is a violation of personal freedom.","chinese":"其它批評人士聲稱沒收地溝油侵犯了個人自由。"},{"english":"Aside from the ick factor, there are serious health concerns associated with gutter oil.","chinese":"在作嘔的同時，一些嚴重的健康問題也和地溝油有關。"},{"english":"There is a whole set of procedures for producing illegal cooking oil,\" He explained.","chinese":"地溝油產業已形成一整套的生產程序。"},{"english":"The \"illegal cooking oil\" is usually made from discarded kitchen waste that has been refined.","chinese":"廚房垃圾經過提煉，最後變成“地溝油”。"}],"related":[]}