{"definition":["the earth's magnetic field"],"pinyin":["di4 ci2 chang3"],"simplified":["地磁场"],"rank":57733.0,"normalized_rank":0.8077595735452548,"fraction":5.780714023732513e-8,"cumulative_fraction":0.9997026574419572,"word":"地磁場","characters":[{"definition":["-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct","earth\/ground\/field\/place\/land\/CL:片[pian4]"],"pinyin":["de5","di4"],"word":"地"},{"definition":["magnetic\/magnetism\/porcelain"],"pinyin":["ci2"],"word":"磁"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"}],"containing_words":[],"sentences":[{"english":"Mathematical models can not fully replace real space magnetic.","chinese":"數學模型不能完全代替真實的空間地磁場。"},{"english":"Does the interplanetary magnetic field connect with the Earth's magnetic field?","chinese":"或者，行星際磁場與地磁場有什麼聯繫嗎？"},{"english":"The first is the creation of new magnetic fields from the ambient geomagnetic field.","chinese":"第一個過程是在周圍地磁場的基礎上產生新磁場。"},{"english":"The vertical component of terrestrial magnetic field can be got with the vertical current.","chinese":"由儀器的垂直電流，計算地磁場垂直分量。"},{"english":"The derivation of the effective magnetic field expression for the ferromagnetism materials with applied stress.","chinese":"地磁場中受力鐵磁性材料有效場表達式的推導。"},{"english":"Mars has no magnetic field, so the surface is constantly bombarded by radiation from the sun.","chinese":"火星沒有地磁場，因此地表經常遭受太陽輻射的襲擊。"},{"english":"But after a period of time they reorient the dances to the earth's magnetic field .","chinese":"但過了一段時間之後，它們的飛舞重新取向於地磁場。"}],"related":[]}