{"definition":["earth's magnetic field"],"pinyin":["di4 qiu2 ci2 chang3"],"simplified":["地球磁场"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"地球磁場","characters":[{"definition":["-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct","earth\/ground\/field\/place\/land\/CL:片[pian4]"],"pinyin":["de5","di4"],"word":"地"},{"definition":["ball\/sphere\/globe\/CL:個|个[ge4]\/ball game\/match\/CL:場|场[chang3]"],"pinyin":["qiu2"],"word":"球"},{"definition":["magnetic\/magnetism\/porcelain"],"pinyin":["ci2"],"word":"磁"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"}],"containing_words":[],"sentences":[{"english":"These electrons have a property called spin which may be sensitive to Earth’s magnetic field.","chinese":"這些電子有着自旋特性，可能對地球磁場具有敏感性。"},{"english":"The measurement system of the Earth magnetic field for pico-satellites is presented.","chinese":"本文設計了一種應用於皮衛星的地球磁場測量系統。"},{"english":"It may reflect that the meteoric charged body and the Earth's magnetic field interact with each other.","chinese":"它們可能反映了流星帶電體與地球磁場的相互作用。"},{"english":"It's describing the magnetic field of Earth, \" she says.","chinese":"它正展現的是地球磁場的作用。"},{"english":"But others believe the birds are navigated by the earth's magnetic field.","chinese":"但也有人認爲，鳥類是靠地球磁場導航的。"},{"english":"Magnetars are a type of neutron star which has a magnetic field a million billion times stronger than the Earth's.","chinese":"磁力星是一種具有了一百萬億次倍地球磁場的中子星。"},{"english":"Now Jeffreys points out that, if a number of.","chinese":"只有地球磁場的約一億分之一。"}],"related":[]}