{"definition":["earth science"],"pinyin":["di4 qiu2 ke1 xue2"],"simplified":["地球科学"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"地球科學","characters":[{"definition":["-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct","earth\/ground\/field\/place\/land\/CL:片[pian4]"],"pinyin":["de5","di4"],"word":"地"},{"definition":["ball\/sphere\/globe\/CL:個|个[ge4]\/ball game\/match\/CL:場|场[chang3]"],"pinyin":["qiu2"],"word":"球"},{"definition":["branch of study\/administrative section\/division\/field\/branch\/stage directions\/family (taxonomy)\/rules\/laws\/to mete out (punishment)\/to levy (taxes etc)\/to fine sb\/CL:個|个[ge4]"],"pinyin":["ke1"],"word":"科"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"The study appears in the journal Nature  Geoscience.","chinese":"這項研究發表在《自然地球科學》期刊上。"},{"english":"Metallogeny is an applied branch of the earth sciences.","chinese":"成礦學是地球科學中一門很有應用價值的新興學科。"},{"english":"Extensive directory of earth-science data sets.","chinese":"大量廣泛的地球科學數據目錄。"},{"english":"The findings have been published in the journal Nature Geoscience.","chinese":"研究結果已在《自然地球科學》期刊上發表。"},{"english":"PIMM and JENKINS work at the Nicholas School of the Environment and Earth Sciences at Duke University.","chinese":"皮姆與簡金斯任職於杜克大學的環境與地球科學學院。"},{"english":"More than 40 years ago, a revolution in earth science arose.","chinese":"40多年以前，一場地球科學的革命發生了。"},{"english":"Their findings were recently published in Nature Geoscience.","chinese":"他們的發現最近被登上自然地球科學。"},{"english":"Precambrian geology is one of the major research fields of earth sciences.","chinese":"前寒武紀地質學是地球科學的主要研究領域之一。"},{"english":"Oth geoscience and human society are faced with the challenge of resources and environment.","chinese":"地球科學與人類社會同樣面臨資源與環境的挑戰。"},{"english":"The theory of plate tectonics is one of the highly successful theories in the geosciences.","chinese":"板塊構造學說是高度成功的地球科學理論。"},{"english":"However, if you have a strong interest in Earth science it is probably worth doing.","chinese":"閣下若對地球科學有濃厚的興趣不妨一試。"},{"english":"JENKINS and PIMM work at the Nicholas School of the Environment and Earth Sciences at Duke University.","chinese":"簡金斯與皮姆任職於杜克大學的環境與地球科學學院。"}],"related":[]}