{"definition":["seismometer"],"pinyin":["di4 zhen4 yi2"],"simplified":["地震仪"],"rank":51256.0,"normalized_rank":0.7171379402011948,"fraction":1.2554075910126168e-7,"cumulative_fraction":0.9991291266736656,"word":"地震儀","characters":[{"definition":["-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct","earth\/ground\/field\/place\/land\/CL:片[pian4]"],"pinyin":["de5","di4"],"word":"地"},{"definition":["to shake\/to vibrate\/to jolt\/to quake\/excited\/shocked\/one of the Eight Trigrams 八卦[ba1 gua4], symbolizing thunder\/☳"],"pinyin":["zhen4"],"word":"震"},{"definition":["apparatus\/rites\/appearance\/present\/ceremony"],"pinyin":["yi2"],"word":"儀"}],"containing_words":[],"sentences":[{"english":"The seismometer was invented by Zhang Heng.","chinese":"地震儀是由張衡發明的。"},{"english":"The ground motion at each seismometer is amplified and recorded electronically at a central recording site.","chinese":"每個地震儀的運動都被電子擴大並記錄在記錄中心。"},{"english":"The advantage of digital seismograph has been brought into full play.","chinese":"充分發揮了數字地震儀的優越性。"},{"english":"In order to study earthquakes, scientists deploy seismometers to measure ground motion .","chinese":"爲研究地震，科學家採用地震儀來記錄大地運動。"},{"english":"Also, who is smart like seismograph, omnipotent spy Xiao Ma.","chinese":"還有，一個如地震儀般機靈，又無所不能的特務小馬。"},{"english":"Heng invented the seismograph during the Han Dynasty.","chinese":"地震儀是由張衡發明的。"},{"english":"The most basic tool of seismologists is the seismograph network.","chinese":"地震學家最基本的工具是地震儀網。"},{"english":"Seismometers could give us a better idea about the offshore earthquake threat.","chinese":"地震儀可以讓我們更好地瞭解有關近海地震的威脅。"},{"english":"We observe earthquakes with a network of seismometers on the earth's surface.","chinese":"我們用遍佈地表的地震儀網絡來觀測地震。"},{"english":"Portable seismographs like this one are used for more detailed research.","chinese":"像這樣的便攜式地震儀是用來做更詳細研究的。"},{"english":"A small lander, equipped with a seismometer, could detect the rumblings of underground liquids.","chinese":"配備地震儀的小型登陸艇則可偵測地下液體的波動。"},{"english":"Newly installed seismometers will listen for glacial earthquakes.","chinese":"新安裝的地震儀將可監聽冰河地震的聲音。"},{"english":"The acquisition system obtains the geological information through the geophone in seism prospecting.","chinese":"地震勘探工作中，地震儀通過地震檢波器採集信號。"},{"english":"Earthquakes are measured using observations from seismometers.","chinese":"地震是使用從地震儀觀測來衡量的。"},{"english":"There was the compass, the seismograph, rockets, paper money, brandy, chopsticks and kites.","chinese":"有指南針，地震儀，火箭，紙幣，筷子和風箏。"}],"related":[]}