{"definition":["subway station"],"pinyin":["di4 tie3 zhan4"],"simplified":["地铁站"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"地鐵站","characters":[{"definition":["-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct","earth\/ground\/field\/place\/land\/CL:片[pian4]"],"pinyin":["de5","di4"],"word":"地"},{"definition":["iron (metal)\/arms\/weapons\/hard\/strong\/violent\/unshakeable\/determined\/close\/tight (slang)","surname Tie"],"pinyin":["Tie3","tie3"],"word":"鐵"},{"definition":["station\/to stand\/to halt\/to stop\/branch of a company or organization\/website"],"pinyin":["zhan4"],"word":"站"}],"containing_words":[],"sentences":[{"english":"S: Yes, you can. Bring your card and receipt to replace it at Lao Jie Station.","chinese":"可以拿收據到老街地鐵站換。"},{"english":"Each station offers an individual architectural style.","chinese":"每個地鐵站都有一種獨立的建築風格。"},{"english":"It was a short walk from the Tai Wai East Rail MTR Station, and the shopfront is impressive.","chinese":"從大圍地鐵站行走一小段路，店面可是蠻可觀的。"},{"english":"Also, it is near the metro station and only ten minutes to the Star Ferry.","chinese":"加上鄰近地鐵站，步行到天星碼頭只要大概十分鐘。"},{"english":"Passengers stand on a platform at a metro station in Kolkata.","chinese":"加爾各答一座地鐵站站臺上，乘客們正在候車。"},{"english":"The road has been closed up for building the subway station.","chinese":"那條路已被堵起來修建地鐵站。"},{"english":"Mrs Wang and Alice are going toZhongshanParkunderground station.","chinese":"王太太和愛麗絲去中山公園地鐵站。"},{"english":"It's over by Dong Zhimen subway.","chinese":"它在東直門地鐵站附近。"},{"english":"En route to the subway I slipped on heels.","chinese":"在去往地鐵站的途中，我穿上了高跟鞋。"},{"english":"I move house to a apartment on Sengkang subway station.","chinese":"我們搬家了，我們搬到了盛港地鐵站上放的公寓。"},{"english":"Old photographs of the Moscow subway stations, the city of Ufa and a steamboat cruise.","chinese":"這些是莫斯科地鐵站，烏法城以及汽艇的舊照片。"},{"english":"Their office building was a goodish distance from the subway station.","chinese":"他們的辦公大樓離地鐵站很長一段距離。"},{"english":"Convenient stores and small shops are in some stations, lined up just outside the turnstiles.","chinese":"一些地鐵站有便利店和小商店，就在出入閘機外面。"},{"english":"Our School is located close to Tiu Keng Leng MTR station. School bus service is provided.","chinese":"本校鄰近調景嶺地鐵站，設有校巴服務。"},{"english":"How to get to the nearest subway station?","chinese":"如何從金橋回到龍陽路或近處的地鐵站？"},{"english":"Right opposite Clapham North tube station, and has an outside eating area too.","chinese":"正對着北克拉彭地鐵站，店門口還有露天餐區。"}],"related":[]}