{"definition":["to be situated\/to be located (of a building)"],"pinyin":["zuo4 luo4"],"simplified":["坐落"],"rank":9603.0,"normalized_rank":0.13435842905712647,"fraction":0.000008828726872609658,"cumulative_fraction":0.9263115277736486,"word":"坐落","characters":[{"definition":["surname Zuo","to sit\/to take a seat\/to take (a bus, airplane etc)\/to bear fruit\/variant of 座[zuo4]"],"pinyin":["Zuo4","zuo4"],"word":"坐"},{"definition":["colloquial reading for 落[luo4] in certain compounds","to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["la4","lao4","luo4"],"word":"落"}],"containing_words":[],"sentences":[{"english":"The fire house is located on Main Street.","chinese":"消防站坐落在美茵大街。"},{"english":"The Rooks Holiday Hotel, Mae Hong Son is set in the midst of a fascinating valley in Northern Thailand.","chinese":"茹克思假日飯店坐落在泰國北部一處迷人的山谷之中。"},{"english":"The town lie at the end of the valley.","chinese":"這個鎮坐落於河谷的盡頭。"},{"english":"A massive sculpture of the seated Buddha rests in the yellowish sandstone cliffs at Single Pebble Village(Danzishizhen) just east of Chongqing.","chinese":"大佛坐落於重慶東部彈子石鎮附近一處黃砂岩懸崖上。"},{"english":"Xiao Hong's former residence was situated at the South Second Street located on the secluded corner of this county town.","chinese":"蕭紅故居，坐落於縣城較偏僻的南二道街。"},{"english":"Their arms factory lies in range of high mountains.","chinese":"他們的武器工廠坐落在羣山峻嶺之中。"},{"english":"It is located in the beautiful Tongxiang City, Zhejiang Province, on a rich plain praised as \"homeland of fish and rice\".","chinese":"地址坐落在環境秀美的“魚米之鄉”浙江省桐鄉市。"},{"english":"Located in the admiralty, it's more reminiscent of a hotel than a shopping mall.","chinese":"其坐落在金鐘，它更像一處酒店而非購物中心。"},{"english":"Situated in the southern part of Jiujiang City, Jiangxi Province, Lushan Mountain is on the bank of Poyang Lake (1).","chinese":"廬山坐落在潘陽湖岸邊，江西省九江市內的南部。"},{"english":"Located on a hill, a long escalator takes me up to what is actually only the ground floor.","chinese":"寶塔坐落在山上，長長的自動扶梯把我送到寶塔底層。"},{"english":"I have a house which is located on the hillside , which faces the south.","chinese":"我有一座坐落在山邊的面朝南的房子。"},{"english":"Food Machinery Co. , Ltd. Zibo Kwong building located in the famous Huantai.","chinese":"淄博廣安食品機械有限公司坐落在著名建築之鄉桓臺。"},{"english":"Yangshuo lies in the northeast of Guangxi Province and to the southeast of Guilin City.","chinese":"陽朔坐落於廣西省東北部，在桂林的東南面。"},{"english":"One is called the City Center Lofts in Salt Lake City, Utah.","chinese":"一個稱爲城市閣樓，坐落在猶他州鹽湖城。"},{"english":"The company is located in Changle city of Fuzhou, Fujian Province, the renowned \"Textile City\".","chinese":"公司坐落在有“紡織之鄉”美稱的福州長樂市。"},{"english":"Jingshan Park lies right to the north of the Palace Museum.","chinese":"景山公園坐落在故宮博物院的正北。"}],"related":[{"definition":["to be situated\/located at (of building)\/also written 坐落[zuo4 luo4]"],"pinyin":["zuo4 luo4"],"word":"座落"},{"definition":["to be located at\/to be situated at\/to lie"],"pinyin":["wei4 yu2"],"word":"位於"},{"definition":["bordering\/adjacent to"],"pinyin":["pi2 lin2"],"word":"毗鄰"},{"definition":["to tower\/standing tall and upright (of large building)"],"pinyin":["chu4 li4"],"word":"矗立"},{"definition":["to be located at\/to be situated in"],"pinyin":["di4 chu3"],"word":"地處"},{"definition":["mountains on one side and water on the other"],"pinyin":["yi1 shan1 bang4 shui3"],"word":"依山傍水"},{"definition":["to be right next to\/close neighbor"],"pinyin":["jin3 lin2"],"word":"緊鄰"},{"definition":["northern extremity"],"pinyin":["bei3 duan1"],"word":"北端"},{"definition":["to stand tall\/to tower aloft"],"pinyin":["song3 li4"],"word":"聳立"},{"definition":["to take up space\/to occupy (space)"],"pinyin":["zhan4 di4"],"word":"占地"},{"definition":["building complex"],"pinyin":["jian4 zhu4 qun2"],"word":"建築群"},{"definition":["southern end or extremity"],"pinyin":["nan2 duan1"],"word":"南端"},{"definition":["foothills"],"pinyin":["shan1 lu4"],"word":"山麓"},{"definition":["floor area\/occupied area\/footprint (of a building, piece of equipment etc)"],"pinyin":["zhan4 di4 mian4 ji5"],"word":"占地面積"},{"definition":["southwest part"],"pinyin":["xi1 nan2 bu4"],"word":"西南部"},{"definition":["neighbor\/next-door neighbor\/near\/next to"],"pinyin":["bi3 lin2"],"word":"比鄰"}]}