{"definition":["crucible"],"pinyin":["gan1 guo1"],"simplified":["坩埚"],"rank":57328.0,"normalized_rank":0.8020930980929861,"fraction":6.072669277456378e-8,"cumulative_fraction":0.9996786503993764,"word":"坩堝","characters":[{"definition":["crucible"],"pinyin":["gan1"],"word":"坩"},{"definition":["crucible"],"pinyin":["guo1"],"word":"堝"}],"containing_words":[],"sentences":[{"english":"Here I am lifting the crucible out with my new tongs that I hurriedly threw together.","chinese":"在這裏，我取消我的坩堝內，我趕緊扔起來的新堂。"},{"english":"The slag resistance of magnesia - zircon castable was investigated by crucible test.","chinese":"採用坩堝法研究了鎂鋯質澆注料的抗渣性。"},{"english":"This is the last stop on our crucible making tour.","chinese":"這是對我們的決策之行的最後一站坩堝。"},{"english":"The clamps shape need as that of crucible, Avoiding the concertrate stress destruction the crucible.","chinese":"坩堝夾鉗應與坩堝形狀相符，避免局部受力損壞。"},{"english":"The clamps shape need as that of crucible, Avoiding the concertrate stress destruction the crucible.","chinese":"坩堝夾鉗應與坩堝形狀相符，避免局部受力損壞。"},{"english":"Take the adequate distance between the furnace wall and the crucible.","chinese":"坩堝與爐壁之間應保持適當間隔，且用楔牢牢固定。"},{"english":"Many cauldrons seem to be at least partially magical.","chinese":"大多數坩堝似乎至少有部分的魔法。"},{"english":"Cauldrons are a basic item for any witch or wizard.","chinese":"不論對女巫或是男巫來說，坩堝都是一種基本的用品。"},{"english":"The Dispense Pot waits the demand signal from the P. O. U.","chinese":"配給坩堝等待從應用點發出的請求。"},{"english":"What this text design is a automatic control in temperature in melting in resistance system.","chinese":"本文設計的是坩堝熔化電阻爐溫度自動控制系統。"},{"english":"Levitation melting is used instead of graphite crucible heating.","chinese":"用懸浮熔融代替石墨坩堝加熱方法。"},{"english":"Here is the new and improved crucible .","chinese":"這是新的和改進的坩堝。"},{"english":"Then put the crucible on the balance and weigh it.","chinese":"然後把坩堝放在天平上稱一下。"},{"english":"Some places like New York City are natural melting pots.","chinese":"一些地方例如紐約是一個天然的坩堝。"},{"english":"Hospital wards have become crucibles where the forces tearing Venezuela apart have converged.","chinese":"醫院病房成了這個國家各種破壞性力量交匯的坩堝。"},{"english":"Tianfu card crucible brand has become the most graphite crucible.","chinese":"天府牌》坩堝成爲國內最有品牌的石墨坩堝。"}],"related":[]}