{"definition":["vertical line"],"pinyin":["chui2 zhi2 xian4"],"simplified":["垂直线"],"rank":55645.0,"normalized_rank":0.7785457445468918,"fraction":7.547043308761894e-8,"cumulative_fraction":0.9995639759228652,"word":"垂直線","characters":[{"definition":["to hang (down)\/droop\/dangle\/bend down\/hand down\/bequeath\/nearly\/almost\/to approach"],"pinyin":["chui2"],"word":"垂"},{"definition":["straight\/to straighten\/fair and reasonable\/frank\/straightforward\/(indicates continuing motion or action)\/vertical\/vertical downward stroke in Chinese characters","surname Zhi\/Zhi (c. 2000 BC), fifth of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God"],"pinyin":["Zhi2","zhi2"],"word":"直"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"}],"containing_words":[],"sentences":[{"english":"The nose must be clearly in front of the vertical.","chinese":"馬鼻必須明顯的在垂直線的前方。"},{"english":"They are placed on both sides of an imaginary vertical line on the page which goes through the middle of the user’s screen.","chinese":"他們都被放置在用戶屏幕中間一條虛構垂直線的兩端。"},{"english":"Or you might say this situation, mP because now we have the center of mass, mP, vertical line.","chinese":"也許你會說，由於存在重心，垂直線。"},{"english":"Horizontal lines imply tranquility and rest, whereas vertical lines imply power and strength.","chinese":"水平線表示寧靜和安定，而垂直線表明權力和力量。"},{"english":"The vertical line meets the horizontal one here.","chinese":"垂直線與水平線在此相交。"},{"english":"Emit TWO vertical line and one horizontal line, plumb below point.","chinese":"可產生二條垂直線和一條水平線，帶下對點。"},{"english":"Behind him the rain trickling down the window made verticals on the glass.","chinese":"他身後的雨滴落在窗戶上，在玻璃上劃出一道垂直線。"}],"related":[]}