{"definition":["vertical shaft\/(math.) vertical axis"],"pinyin":["chui2 zhi2 zhou2"],"simplified":["垂直轴"],"rank":68028.0,"normalized_rank":0.9517999804121836,"fraction":6.860948462510813e-9,"cumulative_fraction":0.9999869805474044,"word":"垂直軸","characters":[{"definition":["to hang (down)\/droop\/dangle\/bend down\/hand down\/bequeath\/nearly\/almost\/to approach"],"pinyin":["chui2"],"word":"垂"},{"definition":["straight\/to straighten\/fair and reasonable\/frank\/straightforward\/(indicates continuing motion or action)\/vertical\/vertical downward stroke in Chinese characters","surname Zhi\/Zhi (c. 2000 BC), fifth of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God"],"pinyin":["Zhi2","zhi2"],"word":"直"},{"definition":["axis\/axle\/spool (for thread)\/roller (for scrolls)\/classifier for calligraphy rolls etc","see 壓軸戲|压轴戏[ya1 zhou4 xi4]\/Taiwan pr. [zhou2]"],"pinyin":["zhou2","zhou4"],"word":"軸"}],"containing_words":[],"sentences":[{"english":"The device was researched and designed to confine the vertical rotary shafting of large photoelectric instrumentations.","chinese":"該限位機構用於限制大型光電設備垂直軸系的旋轉。"},{"english":"The vertical axis ranges from strategic to tactical.","chinese":"垂直軸從戰略到戰術。"},{"english":"Time labels the vertical axis of the above plot, and frequency marks the horizontal axis.","chinese":"上圖中，垂直軸表示時間，水平軸表示頻率。"},{"english":"Radiation is zero in direction along the axis normal to the plane of a loop current.","chinese":"環形電流面之垂直軸方向無輻射。"},{"english":"The two different configurations are horizontal axis and vertical access wind machines.","chinese":"兩種不同的結構是水平軸和垂直軸。"},{"english":"The CH2 vertical axis input jack.","chinese":"CH2垂直軸輸入端子。"},{"english":"Rotate the gyro ball continually along vertical axis.","chinese":"把陀螺球繞垂直軸連續地轉動。"},{"english":"Its showpiece: four power-generating vertical-axis wind turbines.","chinese":"四臺垂直軸風力渦輪機是這座大廈的一大特色。"},{"english":"It tells you it is rotating about a vertical axis.","chinese":"它是繞垂直軸旋轉的。"},{"english":"The CH1 vertical axis input jack.","chinese":"CH1垂直軸輸入端子。"},{"english":"Otherwise the perpendicular axis theorem doesn't work.","chinese":"否則垂直軸定理不能應用。"},{"english":"How does the phenomenon change when the container rotates about its vertical axis?","chinese":"如果容器繞垂直軸旋轉，這個現象會發生什麼變化呢？"},{"english":"The tower would also be powered by vertical axis wind turbines placed in between the floors of the central tower.","chinese":"放置在樓層間的垂直軸風力機也爲大廈提供電能。"}],"related":[]}