{"definition":["pituitary gland"],"pinyin":["chui2 ti3"],"simplified":["垂体"],"rank":37404.0,"normalized_rank":0.5233304884361927,"fraction":4.88587117106887e-7,"cumulative_fraction":0.9953587048541932,"word":"垂體","characters":[{"definition":["to hang (down)\/droop\/dangle\/bend down\/hand down\/bequeath\/nearly\/almost\/to approach"],"pinyin":["chui2"],"word":"垂"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[{"definition":["pituitary glands (at the base of the skull)"],"pinyin":["nao3 xia4 chui2 ti3"],"word":"腦下垂體"},{"definition":["pituitary gland"],"pinyin":["xian4 chui2 ti3"],"word":"腺垂體"},{"definition":["pituitary gland"],"pinyin":["nao3 chui2 ti3"],"word":"腦垂體"}],"sentences":[{"english":"PACAP, Rat pituitary adenylate cyclase activating polypeptide.","chinese":"大鼠垂體腺苷酸環化酶激活肽。"},{"english":"Objective To study the diagnosis of subacute pituitary apoplexy and evaluate the surgical results.","chinese":"目的探討亞急性垂體卒中的診斷及評價手術治療效果。"},{"english":"The significance of pathogenesis of Growth-hormone secreting pituitary adenomas.","chinese":"深入探討垂體生長激素腺瘤發病機制的重要性。"},{"english":"Do excision , VP contents change a hypophysis?","chinese":"垂體切除，VP含量變化？"},{"english":"The results suggested that Nujin Pill could regulate the function of pituitarium-ovary axis.","chinese":"提示女金丹對垂體卵巢軸具有興奮和調整作用。"},{"english":"The hypothalamus controls hormone secretions from the nearby pituitary gland.","chinese":"下丘腦控制附近腦下垂體分泌激素。"},{"english":"The unmyelinated nerve fibers either terminate around the blood capillaries or approach near pituicytes.","chinese":"無髓神經纖維終止於毛細血管周圍或僅貼垂體細胞。"},{"english":"All the tumors were removed by the single-nostril transsphenoidal microsurgery.","chinese":"均行單鼻腔經蝶入路顯微切除垂體腺瘤。"},{"english":"According to these examinations, can know the volume that whether has hypophysis tumour and tumour system.","chinese":"根據這些檢查，可瞭解是否有垂體瘤及瘤體的大小。"},{"english":"Objective To investigate the method of treating hypophysial dwarf by transplantation of embryonic anterior pituitary cells.","chinese":"目的探索人胚腺垂體移植治療垂體性侏儒症的新途徑。"},{"english":"Objective To investigate the method of treating hypophysial dwarf by transplantation of embryonic anterior pituitary cells.","chinese":"目的探索人胚腺垂體移植治療垂體性侏儒症的新途徑。"},{"english":"Objective To improve the diagnostic accuracy of non pituitary lesions in sphenoidal sinus and sellar area.","chinese":"目的提高蝶竇鞍區非垂體源性佔位性病變的診斷水平。"},{"english":"Transsphenoidal microsurgical removal of 104cases of GH-secreting adenoma are reported.","chinese":"報告104例經蝶竇顯微外科切除垂體生長激素腺瘤。"},{"english":"Objective To investigate the expression of pituitary tumor transforming gene (PTTG) in pituitary macroadenomas and its relationships with tumor invasiveness.","chinese":"在垂體大腺瘤中的表達，探討其與腫瘤侵襲性的關係。"},{"english":"Objective To study the effect of Iodine excess on TSH cells in postnatal Wistar rats.","chinese":"目的探討碘過量對仔鼠垂體TSH細胞的影響。"},{"english":"The patients following transsphenoidal surgery of pituitary adenoma may develop disturbances in water and electrolyte.","chinese":"垂體瘤經蝶手術後可發生水和電解質失調。"}],"related":[]}