{"definition":["form\/shape\/type\/style\/pattern"],"pinyin":["xing2 tai4"],"simplified":["型态"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"型態","characters":[{"definition":["mold\/type\/style\/model"],"pinyin":["xing2"],"word":"型"},{"definition":["(bound form)\/appearance\/shape\/form\/state\/attitude\/(grammar) voice"],"pinyin":["tai4"],"word":"態"}],"containing_words":[{"definition":["variant of 意識形態|意识形态[yi4 shi2 xing2 tai4]"],"pinyin":["yi4 shi2 xing2 tai4"],"word":"意識型態"}],"sentences":[{"english":"First, universalist view should be modified to be applied in different languages.","chinese":"首先，宇宙觀無法被直接運用到不同型態的語言中。"},{"english":"It is classically presented with continuous urinary incontinence, but a normal voiding pattern after successful toilet training.","chinese":"它的典型表徵是有正常排尿型態但卻持續的尿失禁。"},{"english":"Here the characters are listed that you have missed during the typing test.","chinese":"這裏字元是表列的那個您有缺少的在時型態中測試。"},{"english":"The purpose of this study was to explore the multiple regressions analysis dietary patterns of person who meals preparer.","chinese":"本研究旨在探討膳食製備者飲食型態的最佳預測因子。"},{"english":"An Exploratory Study of Web-based Travel Information Search Behavior …","chinese":"網際網路型態旅遊資訊搜尋行爲之初探。"},{"english":"To examine common patterns of epithelial injury and disease.","chinese":"觀察常見的上皮組織損傷與疾病的型態。"},{"english":"Chloroplasts of the two cases exhibit spatially different patterns of motion during dielectrophoresis.","chinese":"在實施介電泳時，兩者的葉綠體呈現不同型態的運動。"},{"english":"The author obtained a sufficient and necessary condition for a morphism of schemes to be locally of finite type.","chinese":"給出了概型的局部有限型態射的另一等價刻劃。"},{"english":"After researching the conjoin styles of Main and Sub, I deduce them into 13 categories.","chinese":"復考察其主體與附加體之結合型態，綜爲十三類。"},{"english":"It first examines the shape of the query and the various operators that comprise it.","chinese":"它會先檢查查詢的型態和查詢中的各種運算子。"},{"english":"For some other types of extreme weather there is a need for more research.","chinese":"至於其他類型的極端天氣型態，則需要更多研究。"},{"english":"Large and small luteal cells could be distinguished from cell morphology.","chinese":"大小黃體細胞在細胞型態上有明顯的區別。"},{"english":"When designing your investment plan, do not bother with pattern recognition.","chinese":"在擬定投資計畫時，用不著煩惱型態辨識。"},{"english":"Carnauba wax isn't exactly super reflective in natural form.","chinese":"棕梠蠟在天然型態下並不具有很高的亮度表現。"},{"english":"Many students say it was the first time they had ever done this type of project.","chinese":"許多學生說，他們都是第一次做這種型態的方案。"},{"english":"The morphologic features of open bite were documented by previous researches.","chinese":"過去有許多研究探討開咬病患的特殊顱顏型態。"}],"related":[{"definition":["shape\/form\/pattern\/morphology"],"pinyin":["xing2 tai4"],"word":"形態"},{"definition":["diverse\/diversity\/manifold"],"pinyin":["duo1 yang4"],"word":"多樣"},{"definition":["to appear\/to emerge\/to present (a certain appearance)\/to demonstrate"],"pinyin":["cheng2 xian4"],"word":"呈現"},{"definition":["(of) all kinds and sorts\/various"],"pinyin":["ge4 shi4 ge4 yang4"],"word":"各式各樣"},{"definition":["diversification\/to diversify"],"pinyin":["duo1 yang4 hua4"],"word":"多樣化"},{"definition":["space\/room\/(fig.) scope\/leeway\/(astronomy) outer space\/(physics, math.) space"],"pinyin":["kong1 jian1"],"word":"空間"},{"definition":["to combine\/to link\/to integrate\/binding\/CL:次[ci4]"],"pinyin":["jie2 he2"],"word":"結合"},{"definition":["single\/only\/sole"],"pinyin":["dan1 yi1"],"word":"單一"},{"definition":["to differentiate\/to draw a distinction\/to divide into categories"],"pinyin":["qu1 fen1"],"word":"區分"},{"definition":["to appeal\/to demand (an answer)\/requirement\/demand\/claim\/appeal\/(marketing) message"],"pinyin":["su4 qiu2"],"word":"訴求"},{"definition":["change\/variation\/to change\/to vary\/CL:個|个[ge4]"],"pinyin":["bian4 hua4"],"word":"變化"},{"definition":["kind\/genus\/type\/category\/variety\/species\/sort\/class"],"pinyin":["zhong3 lei4"],"word":"種類"},{"definition":["type\/category\/genre\/form\/style"],"pinyin":["lei4 xing2"],"word":"類型"},{"definition":["to change\/to transform\/shift\/transformation\/CL:個|个[ge4]"],"pinyin":["zhuan3 bian4"],"word":"轉變"},{"definition":["to use\/to put to use"],"pinyin":["yun4 yong4"],"word":"運用"},{"definition":["kind\/type\/class\/category\/similar\/like\/to resemble"],"pinyin":["lei4"],"word":"類"}]}