{"definition":["to fall from power\/to collapse\/demise"],"pinyin":["kua3 tai2"],"simplified":["垮台"],"rank":29657.0,"normalized_rank":0.4149399073776111,"fraction":9.681236213483344e-7,"cumulative_fraction":0.98991397935946,"word":"垮臺","characters":[{"definition":["to collapse\/to break or wear down\/to defeat"],"pinyin":["kua3"],"word":"垮"},{"definition":["Taiwan (abbr.)","platform\/stage\/terrace\/stand\/support\/station\/broadcasting station\/classifier for vehicles or machines"],"pinyin":["Tai2","tai2"],"word":"臺"}],"containing_words":[],"sentences":[{"english":"The introduction of a new tax accounted in no small measure for the downfall of the government.","chinese":"這屆政府的垮臺在很大程度上歸因於徵收一種新稅。"},{"english":"The Incan empire fell quickly 1533.","chinese":"印加帝國在1533年迅速垮臺。"},{"english":"This is what appears to have led to the bank's downfall.","chinese":"這好像就是導致該銀號垮臺的原因。"},{"english":"Gordo, I am in the middle of a fashion meltdown.","chinese":"戈多，我的時尚形象正面臨垮臺。"},{"english":"The President Richard Nixon's crumpling up has illustrated the power of the media lively.","chinese":"尼克松總統的垮臺，形象地說明了新聞報道的威力。"},{"english":"Her government's collapse ends a harried year for Ms Radicova.","chinese":"拉迪喬娃的政府在這一年不斷的煩擾下最終垮臺。"},{"english":"In the past Democrat-led governments have stumbled over corruption scandals.","chinese":"過去，民主黨領導的政府曾經因爲腐敗醜聞而垮臺。"},{"english":"His pride procured his downfall.","chinese":"他的驕傲使他垮臺了。"},{"english":"He committed suicide when the collapse of the Third Reich was imminent (1945).","chinese":"1945年德意志第三帝國垮臺時，希特勒飲彈自盡。"},{"english":"This is the typical bank coerces causes the example which the bank collapses.","chinese":"這就是典型的銀行擠對導致銀行垮臺的例子。"},{"english":"Many non- governmentally operated enterprise of our country is that such collapses.","chinese":"我國的許多民營企業就是這樣垮臺的。"},{"english":"Madoff’s fall hit Palm Beach like a hurricane.","chinese":"麥道夫的垮臺像颶風一樣襲擊了棕櫚灘。"},{"english":"The ruble and the financial markets collapsed, and Yeltsin was a spent force.","chinese":"盧布和經濟一起垮臺，葉利欽是消費者。"},{"english":"He followed him north and then the puppet regime collapsed.","chinese":"他追隨溥儀到北方直到傀儡政府垮臺。"},{"english":"The reactionary rule is doomed.","chinese":"反動統治註定要垮臺。"},{"english":"I don't think she'll burst up.","chinese":"我想她是不會垮臺的。"}],"related":[]}