{"definition":["to bury oneself in work (idiom); to be engrossed in work\/to make an all-out effort\/up to the neck in work"],"pinyin":["mai2 tou2 ku3 gan4"],"simplified":["埋头苦干"],"rank":27116.0,"normalized_rank":0.37938802065115496,"fraction":0.0000012232925131029914,"cumulative_fraction":0.9871420291800728,"word":"埋頭苦幹","characters":[{"definition":["to blame","to bury"],"pinyin":["mai2","man2"],"word":"埋"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"},{"definition":["bitter\/hardship\/pain\/to suffer\/to bring suffering to\/painstakingly"],"pinyin":["ku3"],"word":"苦"},{"definition":["tree trunk\/main part of sth\/to manage\/to work\/to do\/capable\/cadre\/to kill (slang)\/to fuck (vulgar)"],"pinyin":["gan4"],"word":"幹"}],"containing_words":[],"sentences":[{"english":"Do you plod through the day at the office?","chinese":"你是否在辦公室裏埋頭苦幹了一整天呢？"},{"english":"I like your down-to-earth and hardworking spirit.","chinese":"我就喜歡你們這股紮紮實實埋頭苦幹的勁兒。"},{"english":"Toiling away at a job you hate may eat away at your happiness over time.","chinese":"埋頭苦幹一項你痛恨的工作可能會逐漸侵蝕你的快樂。"},{"english":"Firm and steadly, guietly works hard, makes the drip contribution for the society.","chinese":"堅毅踏實，埋頭苦幹，爲社會作出點滴貢獻。"},{"english":"Your quiet hard work will command respect.","chinese":"你那埋頭苦幹的精神令人尊敬。"},{"english":"In an agricultural and industrial era, hard work was crucial.","chinese":"在農業和工業時代，埋頭苦幹是最重要的素質。"},{"english":"We have to put our nose to the grindstone if we want to finish painting the house today.","chinese":"如果我們今天想把房子漆完就得埋頭苦幹。"},{"english":"He slogged away at that report for weeks.","chinese":"他埋頭苦幹了幾個星期寫那份報告。"},{"english":"Does the thought of “buckling down” repel you?","chinese":"那種“埋頭苦幹”的想法讓你厭煩嗎？"},{"english":"I slaved away on the desk for two hours.","chinese":"我埋頭苦幹兩個小時。"},{"english":"He industriously engages in unostentatious hard work.","chinese":"他勤勤懇懇，埋頭苦幹。"},{"english":"Richy: What we need is someone who keeps his nose to the grindstone.","chinese":"我們需要任勞任怨，埋頭苦幹的人。"}],"related":[{"definition":["to be reluctant to give up a post"],"pinyin":["lian4 zhan4"],"word":"戀棧"},{"definition":["overnight until daybreak (idiom); all night long\/day and night"],"pinyin":["tong1 xiao1 da2 dan4"],"word":"通宵達旦"},{"definition":["to rack one's brains (idiom); to take great pains to think sth through"],"pinyin":["fei4 jin4 xin1 si5"],"word":"費盡心思"},{"definition":["to guide patiently and systematically (idiom)"],"pinyin":["xun2 xun2 shan4 you4"],"word":"循循善誘"},{"definition":["to fight alone (idiom)"],"pinyin":["dan1 da3 du2 dou4"],"word":"單打獨鬥"},{"definition":["smile spread across the face (idiom); beaming with pleasure\/all smiles\/joy written across one's face"],"pinyin":["xiao4 zhu2 yan2 kai1"],"word":"笑逐顏開"},{"definition":["benevolent heart and skillful execution (idiom, from Mencius); charitable in thought and deed"],"pinyin":["ren2 xin1 ren2 shu4"],"word":"仁心仁術"},{"definition":["to run this way and that (idiom); to rush about busily\/to bustle about"],"pinyin":["dong1 ben1 xi1 pao3"],"word":"東奔西跑"},{"definition":["to use up\/to exhaust"],"pinyin":["jie2 jin4"],"word":"竭盡"},{"definition":["lit. to spit out one's heart and spill blood (idiom)\/to work one's heart out\/blood, sweat and tears"],"pinyin":["ou3 xin1 li4 xue4"],"word":"嘔心瀝血"},{"definition":["lit. to sleep on brushwood and taste gall (like King Gou Jian of Yue 勾踐|勾践[Gou1 Jian4]), in order to recall one's humiliations) (idiom)\/fig. to maintain one's resolve for revenge"],"pinyin":["wo4 xin1 chang2 dan3"],"word":"臥薪嘗膽"},{"definition":["lit. to point at the mulberry tree and curse the locust tree\/fig. to scold sb indirectly\/to make oblique accusations (idiom)"],"pinyin":["zhi3 sang1 ma4 huai2"],"word":"指桑罵槐"},{"definition":["spirit weary, strength exhausted (idiom); spent\/drained\/washed out"],"pinyin":["jing1 pi2 li4 jin4"],"word":"精疲力盡"},{"definition":["the content of a conversation\/words\/remarks"],"pinyin":["yi1 xi2 hua4"],"word":"一席話"},{"definition":["to work hard"],"pinyin":["ku3 gan4"],"word":"苦幹"},{"definition":["to neglect sleep and forget about food (idiom)\/to skip one's sleep and meals\/to be completely wrapped up in one's work"],"pinyin":["fei4 qin3 wang4 shi2"],"word":"廢寢忘食"}]}