{"definition":["to immerse oneself in\/engrossed in sth\/to lower the head (e.g. to avoid rain)\/countersunk (of screws, rivets etc)"],"pinyin":["mai2 tou2"],"simplified":["埋头"],"rank":16779.0,"normalized_rank":0.23475997929287984,"fraction":0.0000033691636279733943,"cumulative_fraction":0.9656828679823396,"word":"埋頭","characters":[{"definition":["to blame","to bury"],"pinyin":["mai2","man2"],"word":"埋"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"}],"containing_words":[{"definition":["to bury oneself in work (idiom); to be engrossed in work\/to make an all-out effort\/up to the neck in work"],"pinyin":["mai2 tou2 ku3 gan4"],"word":"埋頭苦幹"}],"sentences":[{"english":"Since 2002 she has drowned herself in the study of American literature.","chinese":"從2002年以來她一直埋頭研究美國文學。"},{"english":"Jim was so engrossed in his computer games that he did not hear his mother call.","chinese":"吉姆埋頭玩電腦遊戲，一點都沒有聽到母親的叫喚聲。"},{"english":"Aster and Hoban had their heads bent over a sketch for the battle account.","chinese":"埃斯特和胡班已經在埋頭搞一份附在戰報中的略圖。"},{"english":"He thought of all the times he had gone about his work without thinking about and noticing her.","chinese":"他想起了那些埋頭工作，置愛妻子於不顧的日子。"},{"english":"Do you plod through the day at the office?","chinese":"你是否在辦公室裏埋頭苦幹了一整天呢？"},{"english":"The young man bowed his head and bent over his ledger again.","chinese":"那個年輕人點頭應諾，然後又埋頭寫起分類帳。"},{"english":"Working hard is for grown-ups.","chinese":"埋頭工作是成年人的事情。"},{"english":"She is grubbing about among the records.","chinese":"她正在埋頭查閱記錄。"},{"english":"We laid down our bikes along the round tables and dug in.","chinese":"我們把自行車靠在圓桌上，開始埋頭喫飯。"},{"english":"I was going to dive in and become a full-time healing junkie.","chinese":"我打算埋頭探究併成爲一個全職的治療狂人。"},{"english":"I like your down-to-earth and hardworking spirit.","chinese":"我就喜歡你們這股紮紮實實埋頭苦幹的勁兒。"},{"english":"They have begun the long and tiresome grind of preparing themselves for college entrance.","chinese":"他們已經開始考大學前那種長期而勞累地埋頭苦學了。"},{"english":"He is immersed in his work, in order to recovers from the pain of lossing parents.","chinese":"他埋頭工作爲的是要從失去雙親的痛苦中恢復過來。"},{"english":"With a groan he plunged back into his book.","chinese":"他哼了一聲，又埋頭讀他的書去了。"},{"english":"Working too hard will just delay that process.","chinese":"而埋頭工作只會推遲這一天的來臨。"},{"english":"At the shoe factory she put in a long day.","chinese":"她在製鞋廠埋頭工作了一整天。"}],"related":[]}