{"definition":["to teach\/to be a teacher\/to train\/to coach"],"pinyin":["zhi2 jiao4"],"simplified":["执教"],"rank":5203.0,"normalized_rank":0.07279672043988639,"fraction":0.00002268652896823974,"cumulative_fraction":0.8636904509282667,"word":"執教","characters":[{"definition":["to execute (a plan)\/to grasp"],"pinyin":["zhi2"],"word":"執"},{"definition":["religion\/teaching\/to make\/to cause\/to tell","surname Jiao","to teach"],"pinyin":["Jiao4","jiao1","jiao4"],"word":"教"}],"containing_words":[],"sentences":[{"english":"Perhaps you've always had a desire to coach Little League.","chinese":"也許你一直就渴望執教於少棒隊。"},{"english":"You wanna talk about being outcoached, just watch this game.","chinese":"你想談論沒有執教能力，就看看這場比賽吧。"},{"english":"Dr. Huang is a professor of English literature at the Beijing University.","chinese":"黃博士是英國文學教授，執教於北京大學。"},{"english":"Stefano Pioli is the new coach now, having been in charge of Modena.","chinese":"皮奧利是他們的新任主教練，執教過摩德納。"},{"english":"I thought I would start out at youth level, which I did.","chinese":"我想我將會在青少年隊開始執教，我也是這樣開始的。"},{"english":"Yes, and she teaches in Peking University after graduation there.","chinese":"是的，她從北大畢業以後還在母校執教。"},{"english":"This was the largest margin of defeat for China after Gao Hongbo took the helm.","chinese":"這是高洪波執教中國隊後的最大輸球紀錄。"},{"english":"From the team of Arrigo Sacchi, many former players are now coaching successfully.","chinese":"現在我正在通過執教青年隊積累經驗。"},{"english":"His father coached him his sophomore year of high school.","chinese":"他的父親執教了他的二年級年高中。"},{"english":"Under Mourinho's stewardship, Chelsea once became a sworn enemy of European governing body UEFA.","chinese":"切爾西在穆里尼奧執教期間曾與歐足聯不共戴天。"},{"english":"He would also prefer national teams to be coached by a countryman.","chinese":"同樣的，他也希望國家隊能由本國教練執教。"},{"english":"The coaching is going well and I sometimes join in with mini games in training.","chinese":"執教還算順利，訓練時有時候會加入訓練賽。"},{"english":"However now they are teaching in a state of the art campus, known around the world.","chinese":"然而現在他們在一個藝術院校執教，在世界都很有名。"},{"english":"He's now teaching in Zhu Hai Campus, Beijing Normal University.","chinese":"現執教於北京師範大學珠海分校。"},{"english":"Arenas had coached Onalfo at the University of Virginia.","chinese":"阿里納斯曾執教於弗吉尼亞大學Onalfo。"},{"english":"Those who wish to teach students self-study textbooks to learn more about the knowledge back.","chinese":"執教者希望學員們自學課本，瞭解有關背知識。"}],"related":[]}