{"definition":["to claim\/to insist"],"pinyin":["jian1 cheng1"],"simplified":["坚称"],"rank":16400.0,"normalized_rank":0.22945727757334936,"fraction":0.0000035180608073725645,"cumulative_fraction":0.9643775004243998,"word":"堅稱","characters":[{"definition":["strong\/solid\/firm\/unyielding\/resolute"],"pinyin":["jian1"],"word":"堅"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"}],"containing_words":[],"sentences":[{"english":"Officials insist they will not make the same mistake this time.","chinese":"政府官員堅稱，這一次他們不會重犯同樣的錯誤。"},{"english":"The Changzhou government has insisted the school's environment is normal.","chinese":"常州市政府堅稱學校的環境屬正常範疇。"},{"english":"He insisted that ingl great men hoffer feet of clay.","chinese":"他堅稱所有大人物都有些不可告人的事。"},{"english":"Both Italy and Spain insist they can service their debt.","chinese":"意大利和西班牙堅稱自己能償還債務。"},{"english":"They were never paid for the appearance, Jeyaraj insists.","chinese":"賈亞拉賈堅稱，他們從未因這次出鏡而得到報酬。"},{"english":"But the 28-year-old insists it won't bother him.","chinese":"但是這位28歲球員堅稱這不會困擾到他。"},{"english":"Israel insists it does not wish to re-occupy the Gaza Strip.","chinese":"以色列堅稱其無意重新佔領加沙地帶。"},{"english":"At the same time the official science still insists that psychotronic is mere charlatanry.","chinese":"與此同時官方科學仍然堅稱精神電子是無稽之談。"},{"english":"He averred that the whippings had made him \"one of the best artists in the world\".","chinese":"他堅稱是鞭子成就了“世界上最偉大的一名藝術家”。"},{"english":"However, the Army headquarters insisted there was no such incident in that area.","chinese":"然而，印度陸軍總部堅稱該地區並未發生此類事件。"},{"english":"Small Chen affirms he has not steal anything.","chinese":"小陳堅稱自己沒有偷竊。"},{"english":"Werder Bremen have been adamant they will not release the Brazilian, but his position is very clear.","chinese":"雲達不萊梅一直堅稱不想放走迭戈，但他去意已決。"},{"english":"He affirmed his innocence.","chinese":"他堅稱自己是無辜的。"},{"english":"The angriest of them went so far as to insist that the nation had little to celebrate.","chinese":"憤怒無比的人們堅稱，這個國家沒有任何值得慶祝的。"},{"english":"City officials, however, insist that the recent crackdown has been effective.","chinese":"而上海市政府堅稱近期的打擊行動卓有成效。"},{"english":"Michael insists he's fine.They hold each other tightly.","chinese":"邁可堅稱他好得很，他們互相緊緊地抱着。"}],"related":[]}