{"definition":["to pile up"],"pinyin":["dui1 man3"],"simplified":["堆满"],"rank":16722.0,"normalized_rank":0.2339624753403383,"fraction":0.0000033887246299728933,"cumulative_fraction":0.9654902491898968,"word":"堆滿","characters":[{"definition":["to pile up\/to heap up\/a mass\/pile\/heap\/stack\/large amount"],"pinyin":["dui1"],"word":"堆"},{"definition":["Manchu ethnic group","to fill\/full\/filled\/packed\/fully\/completely\/quite\/to reach the limit\/to satisfy\/satisfied\/contented"],"pinyin":["Man3","man3"],"word":"滿"}],"containing_words":[],"sentences":[{"english":"The room is lumbered up with useless articles.","chinese":"房間時堆滿了無用的東西。"},{"english":"The cart was piled high with fruit and vegetables.","chinese":"大車上高高地堆滿了水果和蔬菜。"},{"english":"The room was encumbered with old furniture.","chinese":"這間屋子堆滿了舊傢俱。"},{"english":"Completing the war motif, sandbags surround the outdoor seating area.","chinese":"爲了凸顯戰爭主題，店外客座區周圍都堆滿了沙袋。"},{"english":"The shelves in the supermarket is full of items before the Christmas rush.","chinese":"聖誕爭購熱潮前超市市場的貨架堆滿了商品。"},{"english":"The cloud-mussed sky turned a vague copper color.","chinese":"堆滿烏雲的天空現出一種混沌的紫銅色。"},{"english":"Puffy, plasticky packages of Doggie Depends stocked in the pantry.","chinese":"櫥櫃堆滿鼓鼓的塑料包裝狗尿布。"},{"english":"Books covered the tables and were piled up on the floor. A simple wooden bed stood in a corner.","chinese":"桌上和地板上都堆滿了書，牆角是一張簡單的木牀。"},{"english":"The room was encumbered with heavy furniture.","chinese":"房內堆滿了笨重的傢俱。"},{"english":"People posted critcisms on my blog.","chinese":"我的博客裏堆滿了人們的批評帖。"},{"english":"The vacant apartments were full of refuse that had not been carted away.","chinese":"空着的公寓裏堆滿了還沒有被運走的垃圾。"},{"english":"The archives were filled to the rafters with piles of manually labeled videocassettes.","chinese":"貼有人工手寫標籤的錄像帶堆滿了檔案櫃。"},{"english":"So, they dug a lot of the roots and pile them in the hole.","chinese":"兩人就挖了很多，堆滿半個樹洞。"},{"english":"Its rusted banks are piled with junk and trash.","chinese":"鏽跡斑斑的河岸兩邊堆滿了垃圾和廢物。"},{"english":"The room was filled with cases of liquor.","chinese":"房間裏堆滿了成箱的酒。"},{"english":"The bay (image right) is filled with slush and icebergs from the collapsed shelf.","chinese":"圖右側的海灣中堆滿了冰架崩塌後留下的積雪和冰山。"}],"related":[]}