{"definition":["worrying\/bleak"],"pinyin":["kan1 you1"],"simplified":["堪忧"],"rank":20163.0,"normalized_rank":0.28210652973850264,"fraction":0.000002356224875178447,"cumulative_fraction":0.9752250647395898,"word":"堪憂","characters":[{"definition":["to endure\/may\/can"],"pinyin":["kan1"],"word":"堪"},{"definition":["to worry\/to concern oneself with\/worried\/anxiety\/sorrow\/(literary) to observe mourning"],"pinyin":["you1"],"word":"憂"}],"containing_words":[],"sentences":[{"english":"McGill believes the city's expansion bodes ill.","chinese":"麥基爾認爲，該城市的擴張前景堪憂。"},{"english":"The second is the calibre of the candidates to become Japan’s next prime minister.","chinese":"第二，繼任首相候選人的能力令人堪憂。"},{"english":"Despite this unprepossessing outlook, the bank envisages a recovery starting by the end of the year.","chinese":"儘管前景堪憂，央行預測今年年底經濟將開始復甦。"},{"english":"Relieve inflammation or internal heat the truth now live eight teacher younger brother, also is the life is grim.","chinese":"敗火直言眼下活着的八位師弟，也是性命堪憂了。"},{"english":"The elevator suddenly fails, party day hills and TongZhiYuan life worrying.","chinese":"電梯忽然出現故障，方天丘與佟之元性命堪憂。"},{"english":"Today, \"My ugly mother\" big heat, \"Auntie Cloud\" worrying prospects.","chinese":"如今，《我的醜娘》大熱，《雲嬸》前景堪憂。"},{"english":"However, the status of internal control in our listing corporations is uneasy.","chinese":"然而，我國上市公司的內部控制狀況卻令人堪憂。"},{"english":"At present, the environment of lakes in the country is worryied.","chinese":"目前，我國湖泊水體的環境現狀令人堪憂。"},{"english":"Now just, stir-fry by heat, \" unite to appear on the market \" also is prospect can You.","chinese":"而現在正被熱炒的“聯合上市”也是前景堪憂。"},{"english":"Yet at both global and national levels, energy is poorlygoverned.","chinese":"然而在全球和國家兩個層面，能源管理問題堪憂。"},{"english":"In the second place, the growing path of the baby is worrying.","chinese":"第二，嬰兒的成長道路實在令人堪憂。"}],"related":[]}