{"definition":["can be rated as\/can be said to be"],"pinyin":["kan1 cheng1"],"simplified":["堪称"],"rank":5640.0,"normalized_rank":0.07891091740937138,"fraction":0.000020166663173349067,"cumulative_fraction":0.873032473966972,"word":"堪稱","characters":[{"definition":["to endure\/may\/can"],"pinyin":["kan1"],"word":"堪"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"}],"containing_words":[],"sentences":[{"english":"The cold overall tone in the image is brilliantly accompanied by the golden in the grass and on the towers.","chinese":"畫中整體的冷色調連同金黃的草與塔尖，堪稱完美。"},{"english":"This very issue actually renders a bit odd the debate between Qiu and Xue.","chinese":"這也是秋風與薛湧的論戰堪稱奇怪之處。"},{"english":"As self-actualization messengers, the two men are an odd couple. Mr.","chinese":"作爲自我實現的傳播者，這兩人堪稱一個奇怪的組合。"},{"english":"Jane is a fabulous cook.","chinese":"簡的烹飪技巧堪稱一絕。"},{"english":"If you are willing to adjust, it's the best computer operating system out there.","chinese":"如果你願意去適應，它堪稱當前最好的電腦操作系統。"},{"english":"She skated a perfect figure of eight.","chinese":"她的8字花式溜冰動作堪稱完美。"},{"english":"Who Are Cytologist?","chinese":"誰堪稱細胞學家？"},{"english":"RIM's reply was one of the most hamfisted PR moves in recent memory.","chinese":"RIM的迴應堪稱近來最糟糕的公關行爲之一。"},{"english":"We call it the dentist's waiting room.","chinese":"我們可以堪稱牙醫的候診室。"},{"english":"The ball Giggsy crossed for Ronaldo was a classic.","chinese":"吉格斯傳給克里斯迪亞諾的球堪稱經典。"},{"english":"The Buddhist cliff carvings on Kongwang Mountain are regarded as one the world's cultural wonders.","chinese":"孔望山佛教摩崖造像羣堪稱世界文化的奇觀。"},{"english":"She looks perfect in her wings and fairy costume.","chinese":"她長着翅膀穿着仙女服的扮相堪稱完美。"},{"english":"Coal-fired power plants are factories of death.","chinese":"燒煤的火力發電廠堪稱死亡工廠。"},{"english":"The trains carrying coal to power plants are death trains.","chinese":"將煤炭運輸到發電廠的列車堪稱死亡列車。"},{"english":"The questions arising round Zubu and Tatar may be called a puzzle of the last century.","chinese":"阻卜與韃靼之謎堪稱一道世紀難題。"},{"english":"There are many different types of drums in Yunnan and colorful tales linked to the drums.","chinese":"雲南鼓的傳說和種類堪稱中國之最。"}],"related":[]}