{"definition":["offer\/to make an offer (commerce)"],"pinyin":["bao4 pan2"],"simplified":["报盘"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"報盤","characters":[{"definition":["to announce\/to inform\/report\/newspaper\/recompense\/revenge\/CL:份[fen4],張|张[zhang1]"],"pinyin":["bao4"],"word":"報"},{"definition":["plate\/dish\/tray\/board\/hard drive (computing)\/to build\/to coil\/to check\/to examine\/to transfer (property)\/to make over\/classifier for food: dish, helping\/to coil\/classifier for coils of wire\/classifier for games of chess"],"pinyin":["pan2"],"word":"盤"}],"containing_words":[],"sentences":[{"english":"A: I've come about your offer for bristles.","chinese":"我今天來訪的目的是想聽取你方對豬鬃的報盤。"},{"english":"You are requested to renew you offer for another couple of weeks.","chinese":"請將你方報盤再展期兩星期。"},{"english":"We need not tell you that continuity of offers is very important.","chinese":"報盤的連續不斷非常重要，自不待言。"},{"english":"All offers and sales are subject to the terms and conditions printed on the reverse side hereof.","chinese":"所有報盤和銷售均應遵守本報價單背面所印的條款。"},{"english":"Please make us a fax offer.","chinese":"請給我們傳真報盤。"},{"english":"If you decide to take advantage of our offer, kindly cable your acceptance.","chinese":"如果貴方決定接受我方的報盤，請以電傳告之接受。"},{"english":"Taking the quality into consideration, we accept your offer.","chinese":"考慮到質量，我們接受你方報盤。"},{"english":"Here is our offer, 300 Euro per ton, CIF Singapore.","chinese":"我們的報盤，每噸300歐元新加坡到岸價。"},{"english":"You are cordificwisly invited to take regarding this cost effective offer.","chinese":"我們誠意約請你方利用好這個富有吸收力的報盤。"},{"english":"This offer is competitive and based on an expanding market..","chinese":"此報盤着眼於擴大銷路而且很有競爭性。"},{"english":"This offer is firm, subject to your reply reaching us by the end of this month.","chinese":"此報盤爲實盤，以你方在本月底前復到有效。"},{"english":"We’ll let you have the official offer next Monday.","chinese":"下星期就給您正式報盤。"},{"english":"3，The offer is given without engagement.","chinese":"報盤沒有約束力。"},{"english":"We offer you subject to change without notice.","chinese":"我方向你方報盤，此報盤如有變化不另行通知。"},{"english":"We offer you subject to change without notice.","chinese":"我方向你方報盤，此報盤如有變化不另行通知。"},{"english":"We can not make any headway with your offer.","chinese":"你們的報盤未得任何進展。"}],"related":[]}