{"definition":["to subside\/to sink\/to cave in"],"pinyin":["ta1 xian4"],"simplified":["塌陷"],"rank":13661.0,"normalized_rank":0.19113511395911745,"fraction":0.000004882221730397322,"cumulative_fraction":0.9530207077556674,"word":"塌陷","characters":[{"definition":["to collapse\/to droop\/to settle down"],"pinyin":["ta1"],"word":"塌"},{"definition":["pitfall\/trap\/to get stuck\/to sink\/to cave in\/to frame (false charge)\/to capture (a city in battle)\/to fall (to the enemy)\/defect"],"pinyin":["xian4"],"word":"陷"}],"containing_words":[],"sentences":[{"english":"Ground collapse is a common geological hazard in shallow buried karst area.","chinese":"地面塌陷是淺埋岩溶區常見的一種地質災害。"},{"english":"Collapse distribution centres on the intensive runoff zones.","chinese":"在地下水強徑流帶，塌陷分佈較爲密集。"},{"english":"Water inched its way up the steps as first as first-floor outside walls collapsed.","chinese":"當一樓外牆塌陷時水慢慢地沿着臺階漫了上來。"},{"english":"Collapse of mined-out area in coal mines is the chief geologic disaster in Shanxi Province.","chinese":"煤礦採空塌陷是山西省地質災害的主要災種。"},{"english":"With the technics of purdah infusion to stem water, surface sinking of large area can be prevented.","chinese":"採用帷幕注漿堵水工藝可防止大面積地表塌陷的發生。"},{"english":"In recent years, karst collapses have frequently occurred in Zaozhuang City.","chinese":"近年來棗莊市岩溶塌陷頻繁發生。"},{"english":"Collapse of mined-out area is an environmental geological hazard of the coal mining area.","chinese":"採空區塌陷屬於煤礦區的環境地質災害問題。"},{"english":"People fled toward the Sumida River, drowning by the hundreds when bridges collapsed.","chinese":"人們都逃向隅田川，當橋塌陷時淹死了幾百人。"},{"english":"Excavate coal subsided water area is the special component of the surface water in Huainan.","chinese":"採煤塌陷水域已成爲淮南市礦區一種特殊的地表水體。"},{"english":"The ground gave in under the weight of the heavy car.","chinese":"地面在沉重的汽車的重壓下塌陷了。"},{"english":"Rescue workers should know how to locate and search these voids .","chinese":"救援人員應知道如何定位和搜尋這些塌陷空腔。"},{"english":"Mining induced collapses are widely distributed at karst water filled mining areas in our country.","chinese":"採礦誘發的塌陷在我國岩溶充水礦區廣泛分佈。"},{"english":"The roadbed of a 300-metre section rail in Qianjiang city collapsed on Friday.","chinese":"星期五，潛江市300米長的鐵路路基塌陷。"},{"english":"Eventually, the necrotic bone collapses, distorting the overlying articular cartilage and producing secondary osteoarthritis.","chinese":"骨塌陷，扭曲疊壓關節軟骨從而產生繼發性骨關節炎。"},{"english":"The masonry facing of the embankment was destroyed seriously by stormy waves.","chinese":"圍壩上游幹砌石護坡在風浪淘刷下，發生嚴重塌陷。"},{"english":"Shuicheng County is one of the most serious karst collapse regions.","chinese":"水城是貴州最嚴重的岩溶塌陷區之一。"}],"related":[{"definition":["to subside\/subsidence"],"pinyin":["xia4 xian4"],"word":"下陷"},{"definition":["to collapse"],"pinyin":["tan1 ta1"],"word":"坍塌"},{"definition":["to cave in\/hollow\/sunken\/depressed"],"pinyin":["ao1 xian4"],"word":"凹陷"},{"definition":["to rupture\/to burst open\/to break up"],"pinyin":["beng1 lie4"],"word":"崩裂"},{"definition":["to crack\/cracked\/fissured\/creviced\/(of skin) chapped"],"pinyin":["jun1 lie4"],"word":"龜裂"},{"definition":["to collapse (of building, dam or bridge)"],"pinyin":["kua3 ta1"],"word":"垮塌"},{"definition":["to collapse (of building)\/to topple over"],"pinyin":["dao3 ta1"],"word":"倒塌"},{"definition":["hole\/pit\/pothole"],"pinyin":["keng1 dong4"],"word":"坑洞"},{"definition":["crack\/crevice\/CL:道[dao4]"],"pinyin":["lie4 feng4"],"word":"裂縫"},{"definition":["Shenkeng township in New Taipei City 新北市[Xin1 bei3 shi4], Taiwan"],"pinyin":["Shen1 keng1"],"word":"深坑"},{"definition":["to disintegrate\/to shatter into small pieces"],"pinyin":["sui4 lie4"],"word":"碎裂"},{"definition":["to rupture\/to burst\/to explode"],"pinyin":["bao4 lie4"],"word":"爆裂"},{"definition":["to split open"],"pinyin":["lie4 kai1"],"word":"裂開"},{"definition":["concave depression\/crater"],"pinyin":["ao1 keng1"],"word":"凹坑"},{"definition":["collapse"],"pinyin":["beng1 hui3"],"word":"崩毀"},{"definition":["talus slide\/to crumble (of scree slope)\/to collapse\/landslide"],"pinyin":["beng1 ta1"],"word":"崩塌"}]}