{"definition":["lit. the old man lost his horse, but it all turned out for the best (idiom)\/fig. a blessing in disguise\/it's an ill wind that blows nobody any good"],"pinyin":["sai4 weng1 shi1 ma3"],"simplified":["塞翁失马"],"rank":44872.0,"normalized_rank":0.6278174975165447,"fraction":2.4144699482963577e-7,"cumulative_fraction":0.9979890367365936,"word":"塞翁失馬","characters":[{"definition":["Serbia\/Serbian\/abbr. for 塞爾維亞|塞尔维亚[Sai1 er3 wei2 ya4]","strategic pass\/tactical border position","to stop up\/to squeeze in\/to stuff\/cork\/stopper","to stop up\/to stuff\/to cope with"],"pinyin":["Sai1","sai1","sai4","se4"],"word":"塞"},{"definition":["elderly man\/father\/father-in-law\/neck feathers of a bird (old)","surname Weng"],"pinyin":["Weng1","weng1"],"word":"翁"},{"definition":["to lose\/to miss\/to fail"],"pinyin":["shi1"],"word":"失"},{"definition":["horse\/CL:匹[pi3]\/horse or cavalry piece in Chinese chess\/knight in Western chess","surname Ma\/abbr. for Malaysia 馬來西亞|马来西亚[Ma3 lai2 xi1 ya4]"],"pinyin":["Ma3","ma3"],"word":"馬"}],"containing_words":[{"definition":["the old man lost his mare, but it all turned out for the best (idiom); fig. a blessing in disguise\/it's an ill wind that blows nobody any good\/also written 塞翁失馬焉知非福|塞翁失马焉知非福"],"pinyin":["sai4 weng1 shi1 ma3 an1 zhi1 fei1 fu2"],"word":"塞翁失馬安知非福"},{"definition":["the old man lost his mare, but it all turned out for the best (idiom); fig. a blessing in disguise\/it's an ill wind that blows nobody any good"],"pinyin":["sai4 weng1 shi1 ma3 yan1 zhi1 fei1 fu2"],"word":"塞翁失馬焉知非福"}],"sentences":[{"english":"Losing your job was just a blessing in disguise.","chinese":"看來失去原來的工作對你來說是“塞翁失馬”啊。"},{"english":"Disaster is blessing in disguise.","chinese":"災禍是福，塞翁失馬焉知非福。"},{"english":"Mr. Reisinger views the housing slump as a blessing in disguise.","chinese":"雷辛格認爲房市衰退可謂是塞翁失馬。"},{"english":"\"A blessing in disguise\" is a good thing that you don't recognize at first as a good thing.","chinese":"“塞翁失馬”是你不認識首先是一件好事好事。"},{"english":"His fail in the match was just a blessing in disguise.","chinese":"他在比賽中的失利只是塞翁失馬。"},{"english":"It means that a bad thing may become good thing under certain condition.","chinese":"“塞翁失馬”比喻事事多變，壞事可以變成好事。"}],"related":[{"definition":["lit. a notch on the side of a boat to locate a sword dropped overboard (idiom); fig. an action made pointless by changed circumstances"],"pinyin":["ke4 zhou1 qiu2 jian4"],"word":"刻舟求劍"},{"definition":["study tirelessly (idiom, from Analects)"],"pinyin":["xue2 er2 bu4 yan4"],"word":"學而不厭"},{"definition":["virtue has its rewards (idiom); one good turn deserves another"],"pinyin":["shan4 you3 shan4 bao4"],"word":"善有善報"},{"definition":["to enjoy the present (idiom); to live happily with no thought for the future\/make merry while you can\/carpe diem"],"pinyin":["ji2 shi2 xing2 le4"],"word":"及時行樂"},{"definition":["true sentiments are seen in hard times (idiom)\/you see who your true friends are when you go through tough times together\/you see who your true friends are when you are in difficulties"],"pinyin":["huan4 nan4 jian4 zhen1 qing2"],"word":"患難見真情"},{"definition":["wedding night"],"pinyin":["dong4 fang2 hua1 zhu2 ye4"],"word":"洞房花燭夜"},{"definition":["saying in which the second part, uttered after a pause or totally left out, is the intended meaning of the allegory presented in the first part"],"pinyin":["xie1 hou4 yu3"],"word":"歇後語"},{"definition":["to review the old and know the new (idiom, from the Analects)\/to recall the past to understand the future"],"pinyin":["wen1 gu4 er2 zhi1 xin1"],"word":"溫故而知新"},{"definition":["to achieve supreme enlightenment or nirvana (Buddhism)"],"pinyin":["da4 che4 da4 wu4"],"word":"大徹大悟"},{"definition":["to recognize one's mistakes and be able to reform oneself (idiom)"],"pinyin":["zhi1 cuo4 neng2 gai3"],"word":"知錯能改"},{"definition":["extreme joy turns to sorrow (idiom); Don't celebrate too soon, things could still go wrong!"],"pinyin":["le4 ji2 sheng1 bei1"],"word":"樂極生悲"},{"definition":["The Thirty-Six Stratagems, a Chinese essay used to illustrate a series of stratagems used in politics, war, and in civil interaction\/all the possible schemes and stratagems"],"pinyin":["san1 shi2 liu4 ji4"],"word":"三十六計"},{"definition":["lit. without wind there cannot be waves (idiom); there must be a reason\/no smoke without fire"],"pinyin":["wu2 feng1 bu4 qi3 lang4"],"word":"無風不起浪"},{"definition":["compassion\/empathetic"],"pinyin":["ce4 yin3"],"word":"惻隱"},{"definition":["see 呂洞賓|吕洞宾[Lu:3 Dong4 bin1]"],"pinyin":["Lu:3 Chun2 yang2"],"word":"呂純陽"},{"definition":["not to be repeated\/not to be taken as a precedent\/just this once"],"pinyin":["xia4 bu4 wei2 li4"],"word":"下不為例"}]}