{"definition":["to fill a gap\/to fill in a blank (on a form)\/to overcome a deficiency"],"pinyin":["tian2 bu3"],"simplified":["填补"],"rank":7831.0,"normalized_rank":0.10956585004127432,"fraction":0.000012384011974832015,"cumulative_fraction":0.9077412994300592,"word":"填補","characters":[{"definition":["to fill or stuff\/(of a form etc) to fill in"],"pinyin":["tian2"],"word":"填"},{"definition":["to repair\/to patch\/to mend\/to make up for\/to fill (a vacancy)\/to supplement"],"pinyin":["bu3"],"word":"補"}],"containing_words":[],"sentences":[{"english":"Unemployment and unfilled vacancies can exist side by side .","chinese":"失業和未填補的空額可以同時並存。"},{"english":"Unconsciously and unintentionally we fill up the gaps and supplement the dream-images.","chinese":"我們會不自覺地填補夢境中未被憶起的空白。"},{"english":"Uncover the starting and ending points and start filling in the blanks one at a time.","chinese":"找到起始點，然後開始填補空白。"},{"english":"Shea filled in for Brown at right-back.","chinese":"奧謝則填補了布朗右邊的空缺。"},{"english":"This book fills a major gap in lexicography.","chinese":"這本書填補了詞典學方面的重大缺門。"},{"english":"Nor can investment rise to fill the gap.","chinese":"依靠投資增長來填補空缺也是不可能的。"},{"english":"I have something very unique to discuss with readers- the spirituality of work.","chinese":"很少友人談論這個，因此我知道我填補了這個空白。"},{"english":"The utility model fills the blank of the special tank car for transporting the bulk dry-mixed mortar in China.","chinese":"填補了國內幹混砂漿無散裝運輸專用罐車的空白。"},{"english":"So, again, someone must fill the hole.","chinese":"因此，有人必須再一次填補這個窟窿。"},{"english":"To fill the gap left by what Gehlen called instinctual deprivation. people create social frameworks.","chinese":"爲了填補留下的空白什麼蓋倫所謂本能剝奪。"},{"english":"He legislates only between gaps. He fills the open spaces in the law.","chinese":"他只是在空白處立法，他填補着法律中的空缺地帶。"},{"english":"But the bond market and loans between companies filled some of the gap.","chinese":"但是債券市場和公司之間的貸款填補了一些空缺。"},{"english":"Fill in nail holes in drywall with  toothpaste and baking soda.","chinese":"牙膏與小蘇打混合可以用來填補牆面的釘子洞。"},{"english":"This funding gap must be filled.","chinese":"這一資助差額必須加以填補。"},{"english":"There is a small cavity to be filled.","chinese":"有個蛀齒的小洞要填補。"},{"english":"It's a cold winter day and the room is filled with the aroma of incense.","chinese":"這是一個寒冷的冬天，房間是與香香氣填補。"}],"related":[{"definition":["to complement\/to make up for a deficiency"],"pinyin":["mi2 bu3"],"word":"彌補"},{"definition":["to bring up to full strength\/to make up a deficiency\/to fill (a vacancy, gap etc)"],"pinyin":["bu3 zu2"],"word":"補足"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"},{"definition":["to seek\/to look for"],"pinyin":["xun2 qiu2"],"word":"尋求"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"},{"definition":["to transfer\/to maneuver (troops etc)\/movement of personnel\/to mobilize\/to bring into play"],"pinyin":["diao4 dong4"],"word":"調動"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["to mend"],"pinyin":["xiu1 bu3"],"word":"修補"},{"definition":["for this reason\/with regards to this\/in this respect\/in order to do this\/to this end"],"pinyin":["wei4 ci3"],"word":"為此"},{"definition":["to break away from\/to cast off (old ideas etc)\/to get rid of\/to break away (from)\/to break out (of)\/to free oneself from\/to extricate oneself"],"pinyin":["bai3 tuo1"],"word":"擺脫"},{"definition":["to overlap\/to superimpose\/to telescope\/to run together\/to duplicate\/one over another\/superposition\/an overlap\/redundancy\/reduplication (in Chinese grammar, e.g. 散散步[san4 san4 bu4] to have a stroll)"],"pinyin":["chong2 die2"],"word":"重疊"},{"definition":["labor force\/manpower"],"pinyin":["lao2 dong4 li4"],"word":"勞動力"},{"definition":["system\/organization"],"pinyin":["ti3 zhi4"],"word":"體制"},{"definition":["currently existing\/currently available"],"pinyin":["xian4 you3"],"word":"現有"},{"definition":["reserves\/to store up"],"pinyin":["chu3 bei4"],"word":"儲備"},{"definition":["response\/to answer\/to reply"],"pinyin":["ying4 dui4"],"word":"應對"}]}