{"definition":["to lower (one's voice)"],"pinyin":["ya1 di1"],"simplified":["压低"],"rank":13782.0,"normalized_rank":0.19282806094609156,"fraction":0.000004809232916966355,"cumulative_fraction":0.9536071039701448,"word":"壓低","characters":[{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"},{"definition":["low\/beneath\/to lower (one's head)\/to let droop\/to hang down\/to incline"],"pinyin":["di1"],"word":"低"}],"containing_words":[],"sentences":[{"english":"He lowered his voice to a whisper.","chinese":"他壓低了聲音悄悄地說話。"},{"english":"An experimental study to investigate bubble detachment point in the sub-cooled boiling at low pressure and velocity is introduced.","chinese":"敘述了低壓低流速下過冷沸騰汽泡脫離點的試驗研究。"},{"english":"Is my blood depress slight and anaemic can you donate blood?","chinese":"我血壓低輕微貧血能獻血麼？"},{"english":"Complete cerebral ischemia was produced by low pressure and low reperfusion.","chinese":"通過低壓低灌法造成完全性腦缺血模型。"},{"english":"She dropped her voice to a whisper.","chinese":"她壓低聲音，悄悄說話。"},{"english":"This low price is a function of over-supply in the market.","chinese":"市場上過多的供應量壓低了咖啡豆的價格。"},{"english":"You couldn't hold the cost of production down.","chinese":"你沒能壓低生產成本。"},{"english":"Well Dong Qiu5 is a wildcat well with Abnormal High Pressure.","chinese":"東秋5井是一口典型的異常高壓低滲透地層預探井。"},{"english":"He said the resulting competition has led to lower prices for trips to Hong Kong.","chinese":"他說，由此產生的競爭壓低了香港遊的價格。"},{"english":"And water vapor pressure is lower when the air is cooler, meaning sweat evaporates faster.","chinese":"涼快時水蒸發壓低，這意味着汗水能很快蒸發。"},{"english":"They dropped their voices as they entered the hall.","chinese":"他們走進大廳時就壓低了講話聲音。"},{"english":"Low Blood Pressure Risky for Heart Patients?","chinese":"心臟病患血壓低會有危險？"},{"english":"\"Rahul, \" she implores in a stifled tone.","chinese":"“拉胡爾，”她壓低聲調懇求。"},{"english":"Accountability and budgeting are key elements to drive down the deficit.","chinese":"會計責任和預算編列壓低赤字的兩大主要元素。"},{"english":"And the left is complaining because it fears it will depress low-end wages.","chinese":"左翼也在抱怨，擔心會壓低最低工資。"},{"english":"The molar had the tendency of lingual movement and distal tipping movement.","chinese":"左下頜中切牙有向舌側壓低和近中移動的趨勢。"}],"related":[]}