{"definition":["pressure vessel\/autoclave"],"pinyin":["ya1 li4 rong2 qi4"],"simplified":["压力容器"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"壓力容器","characters":[{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"},{"definition":["power\/force\/strength\/ability\/strenuously","surname Li"],"pinyin":["Li4","li4"],"word":"力"},{"definition":["surname Rong","to hold\/to contain\/to allow\/to tolerate\/appearance\/look\/countenance"],"pinyin":["Rong2","rong2"],"word":"容"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[],"sentences":[{"english":"Cryogenic liquid cylinders are insulated, vacuum-jacketed, pressure vessels.","chinese":"這是一個隔熱的有真空夾層的壓力容器。"},{"english":"Using a pressure pressure it was possible to achieve temperatures in the vicinity of 115℃.","chinese":"使用壓力容器就可以達到115℃左右的溫度。"},{"english":"Leakage is one of main technical parameter for cryo-insulation pressure vessels.","chinese":"漏率是低溫絕熱壓力容器的主要技術指標之一。"},{"english":"Today, welding is the most commonly used method of fabrication of pressure vessels.","chinese":"在當今的壓力容器打造中，燒焊時最常用的一種方法。"},{"english":"We haudio-videoe received Certifichproposas of Authorizine for the fabdominasricine and erection of pressure vessels.","chinese":"我們具有壓力容器製造和安裝的受權認可證書。"},{"english":"We haudio-videoe received Certifichmarketing cwaspaign of Authorizine for the fabdominingricine and erection of pressure vessels.","chinese":"我們具有壓力容器建造和安裝的受權認可證書。"},{"english":"We have received Certificate of Authorization for thefabrication and erection of pressure vessels.","chinese":"我們具有壓力容器製作和安裝的權力委託認可證書。"},{"english":"The quality of the head concerns the long term safe reliable operation of the pressure vessel directly.","chinese":"封頭的品質直接關係到壓力容器的長期安全可靠運行。"},{"english":"The company production and management of marine heat exchangers and pressure vessels.","chinese":"公司主要生產經營船用熱交換器和壓力容器。"},{"english":"We haudio-videoe received Certificgot of Authoriz for the fstomachric and erection of pressure vessels.","chinese":"我們具有壓力容器建造和安裝的受權認可證書。"},{"english":"Is the pipeline manufacture and the steel stove pressure vessel makes highly effective welding auxiliary engine.","chinese":"是管道製造和鋼爐壓力容器製造高效焊接輔機。"},{"english":"Wuxi Hengan Pressure Vessel Manufacturing Co. , Ltd. , was found in 1970.","chinese":"無錫恆安壓力容器製造有限公司創建於1970年。"},{"english":"We haudio-videoe received Certificgot of Authoriz for the ftummyric and erection of pressure vessels.","chinese":"我們具有壓力容器製造和安裝的受權認可證書。"},{"english":"We have received Certificate of Authorization for the fabrication and erection of pressure vessels.","chinese":"我們具有壓力容器製作和安裝的授權認可證書。"},{"english":"ASME, Boiler and Pressure Vessel, Product Certification, Code and Standards.","chinese":"鍋爐壓力容器，產品認證，規範和標準。"},{"english":"Portable Pressure Vessel with removable top head and quick open manway.","chinese":"便攜式壓力容器配有可去除頂部和快速打開艙口。"}],"related":[]}