{"definition":["to suppress\/to inhibit\/to stifle"],"pinyin":["ya1 zhi4"],"simplified":["压制"],"rank":7446.0,"normalized_rank":0.1041792005372658,"fraction":0.000013402789832701441,"cumulative_fraction":0.902782677973002,"word":"壓制","characters":[{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"},{"definition":["system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4"],"word":"制"}],"containing_words":[],"sentences":[{"english":"Cast the aluminium alloy outer cover , gushes out and moulds on the surface.","chinese":"鑄鋁合金外殼壓制成型，表面噴塑。"},{"english":"These constructional coercions account for the reversibility restrictions of some S-O reversible sentences.","chinese":"這些構式壓制爲易位的限制條件和原因提供瞭解釋。"},{"english":"No teacher shall stamp on a child's idea without considering it.","chinese":"老師不應該不加考慮就把孩子的想法壓制下去。"},{"english":"After I did the drive-through, I got stuck behind Fernando (Alonso).","chinese":"我做了處罰後，我被壓制在了阿隆索後面。"},{"english":"The most odious of all oppressions are those which mask as justice.","chinese":"最可憎的壓制總是戴着正義的面具。"},{"english":"I highly recommend laminating your perforated film with a premium optically clear film laminate.","chinese":"我強烈建議將穿孔貼膜用優質光學層壓制件捲成薄片。"},{"english":"For some, the pleasurable sensations override the terrifying images on the movie screen.","chinese":"對於有些人來說，愉悅感壓制住了影像帶來的恐懼。"},{"english":"What is called bad women is only the pressure and distortion of patriarchal society to female personality.","chinese":"所謂“惡婦”只是男權社會對女性個性的壓制與扭曲。"},{"english":"To seek to extinguish anger utterly, is but a bravery of the stoics.","chinese":"企圖完全壓制住憤怒只不過是禁慾者的勇敢表現之一。"},{"english":"After Sir Thomas comes back, he tries to control the Crawfords' force.","chinese":"托馬斯爵士歸來後，對克勞福特的氣焰有所壓制。"},{"english":"Soames made a tour of the room, to subdue his rising anger .","chinese":"索米斯在屋內兜了一圈，壓制一下心頭升起的怒火。"},{"english":"In effect, the gene for that protein had been silenced.","chinese":"實際上，產生這種蛋白質的基因被壓制了。"},{"english":"Now, China wants to tamp such nationalism down.","chinese":"現在，中國希望壓制民族主義。"},{"english":"The second feature of this setup is the interaction of pain suppression and Shamanistic rage.","chinese":"第二個好處是痛苦壓制和薩滿之怒的配合使用。"},{"english":"The relative bodhicitta thought only suppresses self-clinging, so that the defilements become inactive.","chinese":"世俗菩提心只是通過壓制我執而暫時剋制染污習氣。"},{"english":"And this dumbing down bodes ill for the nation's future.","chinese":"這種壓制對國家的未來預示着凶兆。"}],"related":[{"definition":["to suppress\/to beat down"],"pinyin":["da3 ya1"],"word":"打壓"},{"definition":["to attack\/to accuse\/to charge\/an attack (terrorist or military)"],"pinyin":["gong1 ji1"],"word":"攻擊"},{"definition":["to release\/to set free\/to liberate (a prisoner)\/to discharge"],"pinyin":["shi4 fang4"],"word":"釋放"},{"definition":["to attempt\/to try"],"pinyin":["shi4 tu2"],"word":"試圖"},{"definition":["to withstand\/to resist\/to stand off\/antagonism\/confrontation"],"pinyin":["dui4 kang4"],"word":"對抗"},{"definition":["clear\/evident\/obvious(ly)"],"pinyin":["xian3 ran2"],"word":"顯然"},{"definition":["to hit\/to strike\/to attack\/to crack down on sth\/blow\/(psychological) shock\/percussion (music)"],"pinyin":["da3 ji1"],"word":"打擊"},{"definition":["to attempt\/to try\/attempt\/CL:種|种[zhong3]"],"pinyin":["qi3 tu2"],"word":"企圖"},{"definition":["mood\/state of mind\/moodiness\/CL:種|种[zhong3]"],"pinyin":["qing2 xu4"],"word":"情緒"},{"definition":["to operate\/to control\/to rig\/to manipulate"],"pinyin":["cao1 zong4"],"word":"操縱"},{"definition":["to stop\/to resist\/to obstruct"],"pinyin":["zu3 dang3"],"word":"阻擋"},{"definition":["to strike back\/to beat back\/to counterattack"],"pinyin":["fan3 ji1"],"word":"反擊"},{"definition":["to continue\/to persist\/sustainable\/preservation"],"pinyin":["chi2 xu4"],"word":"持續"},{"definition":["to separate oneself from\/to break away from\/diastasis (medicine)\/abscission\/abjunction (botany)"],"pinyin":["tuo1 li2"],"word":"脫離"},{"definition":["to sway\/to waver\/to rock\/to rattle\/to destabilize\/to pose a challenge to"],"pinyin":["dong4 yao2"],"word":"動搖"},{"definition":["to constrain or repress emotions\/oppressive\/stifling\/depressing\/repression"],"pinyin":["ya1 yi4"],"word":"壓抑"}]}