{"definition":["to compel sb to obey\/to force into submission\/to subjugate"],"pinyin":["ya1 fu2"],"simplified":["压服"],"rank":55700.0,"normalized_rank":0.7793152659046073,"fraction":7.488652258017122e-8,"cumulative_fraction":0.999568108987415,"word":"壓服","characters":[{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"},{"definition":["classifier for medicine: dose\/Taiwan pr. [fu2]","clothes\/dress\/garment\/to serve (in the military, a prison sentence etc)\/to obey\/to be convinced (by an argument)\/to convince\/to admire\/to acclimatize\/to take (medicine)\/mourning clothes\/to wear mourning clothes"],"pinyin":["fu2","fu4"],"word":"服"}],"containing_words":[],"sentences":[{"english":"The white racists tried to keep down the Indians by force.","chinese":"白人種族主義者企圖用武力壓服印第安人。"},{"english":"We ca subull craptantial't persuadvertisemente the end-users to buy your products during this price.","chinese":"按這個價錢，我們不能壓服用戶置備你們的產品。"},{"english":"Ideological problems can be solved only through persuasion, not by coercion.","chinese":"解決思想問題只能靠說服，不能壓服。"},{"english":"She often squelches others with biting sarcasm.","chinese":"她經常用尖刻的挖苦話壓服別人。"},{"english":"Keep down seven on the roadside stalls set.","chinese":"壓服七邊在路邊擺攤設局。"},{"english":"Yong time and fortune son whitewash with my mind, the humiliations of the pressure test really son.","chinese":"勇次和幸子粉飾着本人辛酸的心境，測驗壓服真子。"},{"english":"I have talked him into agreeing.","chinese":"本人已壓服他贊成了。"},{"english":"Jinyan learned that LeiJinYi boarded wujiang, then tried to crush her to bear wujiang.","chinese":"金燕得知雷錦儀搭上了吳江，便試圖壓服她承受吳江。"},{"english":"We ca't persuoffere the end-users to buy your products with this price.","chinese":"按這個代價，我們不能壓服用戶置備你們的產品。"},{"english":"Did you finally persuade him?","chinese":"你們最後壓服他了嗎？"},{"english":"I would reaccessory appreciate your persuaadvise your administration.","chinese":"如果你能壓服經營團隊，我會很感謝。"},{"english":"Third, the academic papers have brought.","chinese":"第三，學術論文還要有壓服性。"},{"english":"Her answer finished him.","chinese":"她的回答徹底把他壓服了。"},{"english":"Ann in yong and flood little green can within the time limit ZhangCai Sally and supporting they collaborate?","chinese":"安在勇和洪小綠能否在期限內壓服張採莉與他們協作？"},{"english":"Objective To evaluate the protective function of upper-body pressure suit against arm pain.","chinese":"目的探討身體上部加壓服對臂痛防護作用的評價。"},{"english":"Gentle persuasion is more effective than force.","chinese":"溫和的說服勝於壓服。"}],"related":[]}