{"definition":["vise jaw\/press board (machine)\/see-saw"],"pinyin":["ya4 ban3"],"simplified":["压板"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"壓板","characters":[{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"},{"definition":["board\/plank\/plate\/shutter\/table tennis bat\/clappers (music)\/CL:塊|块[kuai4]\/accented beat in Chinese music\/hard\/stiff\/to stop smiling or look serious"],"pinyin":["ban3"],"word":"板"}],"containing_words":[],"sentences":[{"english":"Fit left plenum panel partition.","chinese":"安裝左充壓板管分隔板。"},{"english":"First make sure that the platen gap adjustment is set correctly.","chinese":"首先確保壓板間隙調整設置正確。"},{"english":"Combination of regulation and pressure plate of the triangular series rules.","chinese":"組合壓板的三角規及壓規系列。"},{"english":"Quality control of roll formed and curved panels.","chinese":"負責控制輥壓板和曲板的品質。"},{"english":"A new glass cloth laminate applied in embedded capacitor are prepared with the composite resin.","chinese":"並將其應用於製備內嵌式電容器用玻璃布複合層壓板。"},{"english":"The lower platen is fixed together with bottom of the connecting block and compacting the inelasticity belt tight.","chinese":"下壓板與連接塊底部固定在一起，並將無彈性帶壓緊。"},{"english":"Disconnect plug connection for bonnet wire harness in plenum panel on right.","chinese":"斷開右側充壓板中發動機罩線束的插頭。"},{"english":"The main façade has pewter details and sliding panels of perforated laminate.","chinese":"主立面採用青灰色的細節和滑動穿孔層壓板。"},{"english":"The balance valve circuit is to support the weight of platen and plunger design.","chinese":"迴路中的平衡閥是爲支撐壓板及柱塞的重量而設計的。"},{"english":"The deformation of composite laminate was studied in this paper.","chinese":"主要研究了複合材料層壓板的變形情況。"}],"related":[]}