{"definition":["compressor"],"pinyin":["ya1 suo1 qi4"],"simplified":["压缩器"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"壓縮器","characters":[{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"},{"definition":["to withdraw\/to pull back\/to contract\/to shrink\/to reduce\/abbreviation\/also pr. [su4]"],"pinyin":["suo1"],"word":"縮"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[],"sentences":[{"english":"By default, general-purpose text compressors belong to the non-queriable group of compressors.","chinese":"在默認情況下，通用文本壓縮器是非可查詢壓縮器組。"},{"english":"By default, general-purpose text compressors belong to the non-queriable group of compressors.","chinese":"在默認情況下，通用文本壓縮器是非可查詢壓縮器組。"},{"english":"Thus, they have the same trade-off as their general-purpose, back-end compressors.","chinese":"因此，它們與自己的通用後端壓縮器具有相同的權衡。"},{"english":"In this paper, a new type positive displacement compressor is advanced.","chinese":"提出一種新結構形式的變容壓縮器。"},{"english":"I have shut down my No3 engine due to compressor surge.","chinese":"我已關掉第三號發動機，因壓縮器喘振。"},{"english":"There are plenty free compressors out there.","chinese":"現在有很多免費的壓縮器。"},{"english":"Calculation of the dispersion with angular misalignment of grating pair compressor by ray-tracing method.","chinese":"壓縮器光柵不平行度對色散影響的光線追跡法研究。"},{"english":"The main focus of this group is to achieve the highest compression ratio.","chinese":"這類壓縮器主要側重於實現最高的壓縮比。"},{"english":"Which compressor settings will most accentuate the transient attack of a snare drum?","chinese":"哪一種壓縮器設定最能突出小軍鼓的瞬態？"},{"english":"They merely alter the threshold response of the compressor on a \"frequency-weighted\" basis.","chinese":"它們僅僅在頻率加重的基礎上改變壓縮器的響應閥值。"},{"english":"In this paper, a new type positive displacement compressor.","chinese":"提出一種新結構形式的變容壓縮器。"},{"english":"Dynamic processors can really help enhance a mix.","chinese":"壓縮器的確是能改善混音效果。"},{"english":"General text compressors.","chinese":"一般的文本壓縮器。"}],"related":[]}