{"definition":["gangrene"],"pinyin":["huai4 ju1"],"simplified":["坏疽"],"rank":57424.0,"normalized_rank":0.8034362626446351,"fraction":6.014278226711606e-8,"cumulative_fraction":0.9996844518422237,"word":"壞疽","characters":[{"definition":["bad\/spoiled\/broken\/to break down\/(suffix) to the utmost"],"pinyin":["huai4"],"word":"壞"},{"definition":["gangrene"],"pinyin":["ju1"],"word":"疽"}],"containing_words":[],"sentences":[{"english":"Pyomyoma is thought to result from bacterial seeding of a necrotic fibroid.","chinese":"膿肌瘤被認爲是壞疽性纖維瘤細菌播散的結果。"},{"english":"Fournier's gangrene is a rare but often fatal manifestation of rectal cancer.","chinese":"摘要福尼耳壞疽在直腸癌病患很少見卻經常致命。"},{"english":"Gangrenous ulcer infection secondary to the use of inappropriate, in order to avoid the proliferation of inflammation.","chinese":"潰瘍壞疽繼發感染時不宜使用，以免引起炎症擴散。"},{"english":"Be short of blood to lower limbs terminal, limb end happens ulcer and gangrenous .","chinese":"到下肢缺血晚期，肢端發生潰瘍和壞疽。"},{"english":"A diagnosis of pyoderma gangrenosum was established according to the clinical manifestations and histopathologic changes.","chinese":"結合臨牀表現及組織病理改變，診斷爲壞疽性膿皮病。"},{"english":"When gangrene set in, his foot have to be amputate.","chinese":"他的腳生了壞疽，必須解除。"},{"english":"Gallbladder volvulus with a gangrenous change was the definite diagnosis following a celiotomy. Cholecystectomy was performed smoothly.","chinese":"剖腹手術後的正確診斷是膽囊扭轉並有壞疽性的變化。"},{"english":"Gallbladder volvulus with a gangrenous change was the definite diagnosis following a celiotomy .","chinese":"剖腹手術後的正確診斷是膽囊扭轉並有壞疽性的變化。"},{"english":"If blood vessels are damaged, people can suffer a gangrene infection.","chinese":"如果血管受損，可能會感受到一個壞疽感染。"},{"english":"Fournier's gangrene is a rare but often fatal manifestation of rectal cancer.","chinese":"福尼耳壞疽在直腸癌病患很少見卻經常致命。"},{"english":"The week before, he amputated three dry-gangrenous, mummified toes on her left foot.","chinese":"一週前，他截肢三個幹壞疽，木乃伊腳趾在她的左腳。"},{"english":"It was not without difficulty that the chloruretted lotions and the nitrate of silver overcame the gangrene.","chinese":"好不容易纔用氯化洗劑和硝酸銀治癒了壞疽。"}],"related":[]}