{"definition":["Foreign Affairs Office (at a university)\/Foreign Affairs Department"],"pinyin":["wai4 shi4 chu4"],"simplified":["外事处"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"外事處","characters":[{"definition":["outside\/in addition\/foreign\/external"],"pinyin":["wai4"],"word":"外"},{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"Hello, this is the Foreign Affairs Police.","chinese":"您好，這裏是臺北市警局外事處。"},{"english":"The exchange students should give the meal card back to the Foreign Affairs Office.","chinese":"交換生離校時應把飯卡交回外事處留學生辦公室。"},{"english":"Post contracts from Foreign Affairs Department and confirming contract terms with foreign teachers.","chinese":"外事處寄發合同給外籍教師，確定合同條款。"},{"english":"Both the Foreign Office and the Ministry of Defence have declined to comment on the reports.","chinese":"外事處和國防部都拒絕對這些報道做出評論。"},{"english":"Good morning. We re from the Foreign Affairs Department.","chinese":"早晨好，我們是外事處的。"},{"english":"The Foreign Affairs Office is the management unit for foreign teachers.","chinese":"外事處爲外籍教師的主管部門。"},{"english":"Hello, this is the Taipei Foreign Affairs Police.","chinese":"您好，這裏是臺北市警局外事處。"},{"english":"Students resuming study should apply for X visa to come to China.","chinese":"來華自費留學生完成學業後由外事處頒發在學證明。"},{"english":"FAO will arrange physical exam or verification for new students.","chinese":"外事處將在新生入學後統一安排體檢。"},{"english":"Ask for comment from college after Foreign Affairs Department's initial review.","chinese":"外事處初審後轉二級學院，徵求二級學院意見。"}],"related":[]}