{"definition":["foreigner"],"pinyin":["wai4 lai2 ren2"],"simplified":["外来人"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"外來人","characters":[{"definition":["outside\/in addition\/foreign\/external"],"pinyin":["wai4"],"word":"外"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"}],"containing_words":[],"sentences":[{"english":"Conclusions The non-natives are the major component of TB patients in Shenzhen.","chinese":"結論外來人口是深圳市結核病疫情的主要組成部分。"},{"english":"Third, make non-native population participate in all-people body-building activities.","chinese":"三是針對外來人口全民健身活動。"},{"english":"Our foreign population is growing.","chinese":"外來人口在增長。"},{"english":"But he said that Americans are a simple people - a frequent comment among folks in China about foreigners.","chinese":"但他表示，美國人是一個經常評論中國的外來人。"},{"english":"Objective To study the characteristics of psychiatric expert testimony cases of temporary and permanent residents.","chinese":"目的研究廣州本地及外來人口精神司法鑑定案例特點。"},{"english":"In Shenzhen, the population from outside is so large; sometimes I feel scared.","chinese":"在深圳，外來人口太多，有時候我會覺得害怕。"},{"english":"Platform for private only. Parents please be seated in the spectator area.","chinese":"主席臺禁止外來人員進入，請家長在兩側觀衆席就坐。"},{"english":"No wonder that the migrants are increasingly restive.","chinese":"因此外來人員日益感到不安也就不足爲奇了。"},{"english":"Budget pressures have made them highly reluctant to spend money on helping the incomers.","chinese":"預算壓力使他們很難傾囊扶助外來人口。"},{"english":"The stranger took up the bundle which he had brought and untied it.","chinese":"這外來人拿起他帶來的那個包袱，解開了結子。"},{"english":"Next year, the smoking ban will be expanded to include visitors.","chinese":"明年禁止吸菸的規定還將擴展至進入院區的外來人員。"},{"english":"Some 90 per cent of the 1.77 million population are expats.","chinese":"迪拜總人口有177萬，但90%爲外來人口。"},{"english":"Bush emphasized the need for immigrants to enter the United States legally.","chinese":"布什總統強調外來人員必須合法入境美國。"}],"related":[]}