{"definition":["outside\/outer surface\/abroad\/place other than one's home"],"pinyin":["wai4 bian5"],"simplified":["外边"],"rank":16592.0,"normalized_rank":0.23214360667664716,"fraction":0.0000034422984190312224,"cumulative_fraction":0.965046203642164,"word":"外邊","characters":[{"definition":["outside\/in addition\/foreign\/external"],"pinyin":["wai4"],"word":"外"},{"definition":["side\/edge\/margin\/border\/boundary\/CL:個|个[ge4]\/simultaneously","suffix of a noun of locality"],"pinyin":["bian1","bian5"],"word":"邊"}],"containing_words":[{"definition":["erhua variant of 外邊|外边[wai4 bian5]"],"pinyin":["wai4 bian5 'r"],"word":"外邊兒"}],"sentences":[{"english":"That's what people are going to say.","chinese":"你說的就像瘋話，外邊的人都會這麼說的。"},{"english":"Adema cradles his one year old daughter in his arms, as he stands outside his hut.","chinese":"阿迪馬抱着他一歲的女兒，站在簡陋小屋的外邊。"},{"english":"During a phone interview the candidate flushed the toilet while talking to hiring manager.","chinese":"應聘者在一次電話面試外邊和招聘經理談話邊衝馬桶。"},{"english":"He couldn't sleep well with the noise loud outside.","chinese":"由於外邊噪聲很大，他沒睡好覺。"},{"english":"The back of your shirt has worked out of your trousers.","chinese":"你襯衫的後襬已經抻到褲子外邊來了。"},{"english":"Other officers and submachine gunners were asked to wait outside until we come back.","chinese":"其他軍官和衝鋒槍手被要求留在外邊等我們出來。"},{"english":"Exceed person ability to wear underpants outside only?","chinese":"難道只有超人才能把褲衩穿在外邊嗎？"},{"english":"And here he has laid them all out.","chinese":"這裏他將它們都擺在外邊。"},{"english":"Anthea asked Martha to bring their lunch out there.","chinese":"安西婭要馬莎把午飯拿到外邊那裏去。"},{"english":"He's frightened to stay out late in case his mother lays into him again.","chinese":"他很怕在外邊呆得太晚，唯恐母親又要把他痛打一頓。"},{"english":"Get out of your room and hang around with your room-mates.","chinese":"走出你的房間，同你的室友到外邊活動一下。"},{"english":"It’s only the bad food as keeps all that scum away.","chinese":"只有惡劣的飲食才能把那些傢伙擋在外邊。"},{"english":"The other method runs room-temperature glycol through those same iced-over tubes.","chinese":"另一個方法是讓室溫的乙二醇通過外邊結冰的管子。"},{"english":"The door flew open, and Father stormed into the room, in a very bad temper.","chinese":"門猛地開了，父親從外邊暴跳如雷地走進屋子裏來。"},{"english":"Iago. Away, I say; go out, and cry a mutiny.","chinese":"到外邊去高聲嚷叫，說是出了亂子啦。"},{"english":"The keel arranged on the board is in a radiation shape from the tube head to the outside;","chinese":"設置在上述板面上的龍骨呈從管頭向外邊的放射狀。"}],"related":[]}