{"definition":["multitasking (computing)"],"pinyin":["duo1 ren4 wu5 chu3 li3"],"simplified":["多任务处理"],"rank":39120.0,"normalized_rank":0.5473395547969163,"fraction":4.1662014706395436e-7,"cumulative_fraction":0.9961361307486678,"word":"多任務處理","characters":[{"definition":["many\/much\/often\/a lot of\/numerous\/more\/in excess\/how (to what extent)\/multi-\/Taiwan pr. [duo2] when it means \"how\""],"pinyin":["duo1"],"word":"多"},{"definition":["surname Ren\/Ren County 任縣|任县[Ren2 Xian4] in Hebei","to assign\/to appoint\/to take up a post\/office\/responsibility\/to let\/to allow\/to give free rein to\/no matter (how, what etc)\/classifier for terms served in office, or for spouses, girlfriends etc (as in 前任男友)"],"pinyin":["Ren2","ren4"],"word":"任"},{"definition":["affair\/business\/matter\/to be engaged in\/to attend to\/by all means"],"pinyin":["wu4"],"word":"務"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"}],"containing_words":[],"sentences":[{"english":"\"Financial markets are poor multi-taskers, \" Woo writes.","chinese":"“金融市場的多任務處理能力較差，”吳寫到。"},{"english":"This is a result of the quantized nature of time-shared multitasking.","chinese":"這是由分時多任務處理的量子化特性決定的。"},{"english":"In fact, the heavy multitaskers weren't even good at multitasking.","chinese":"事實上，他們還不如那些一般的多任務處理者。"}],"related":[]}