{"definition":["polyploid (multiple chromosomes)"],"pinyin":["duo1 bei4 ti3"],"simplified":["多倍体"],"rank":66134.0,"normalized_rank":0.9253004631119444,"fraction":1.1970165402678438e-8,"cumulative_fraction":0.9999693188603119,"word":"多倍體","characters":[{"definition":["many\/much\/often\/a lot of\/numerous\/more\/in excess\/how (to what extent)\/multi-\/Taiwan pr. [duo2] when it means \"how\""],"pinyin":["duo1"],"word":"多"},{"definition":["(two, three etc) -fold\/times (multiplier)\/double\/to increase or multiply"],"pinyin":["bei4"],"word":"倍"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[{"definition":["autopolyploid (polyploid with chromosomes of single species)"],"pinyin":["dan1 yuan2 duo1 bei4 ti3"],"word":"單源多倍體"},{"definition":["allopolyploid (polyploid with chromosomes of different species)"],"pinyin":["yi4 yuan2 duo1 bei4 ti3"],"word":"異源多倍體"}],"sentences":[{"english":"The Tiandan303 is a genetic monogerm polyploid sugar beet hybrid.","chinese":"甜單303是甜菜遺傳單粒型多倍體雜交種。"},{"english":"Girdling and other treatments can induce polypoid plants to flower earlier.","chinese":"用環剝樹皮等方法可以誘導多倍體無性系提早開花。"},{"english":"Autopolyploids are genetically isolated from their parental diploids .","chinese":"同源多倍體與其親本二倍體在遺傳上相隔離。"},{"english":"Now, polyploid breeding is a commonly used method in crop breeding.","chinese":"而多倍體育種是近代作物育種常採用的一種方法。"},{"english":"The main exceptions to this are hybrid and polyploid speciation.","chinese":"對於這一點，最主要的例外是雜種和多倍體物種。"},{"english":"A polyploid is a plant with more than two complete sets of chromosomes .","chinese":"多倍體是具有兩套以上染色體的植物。"},{"english":"And union of unreduced gametes is the most important mechanism.","chinese":"其中，不減數配子是多倍體形成的主要機制。"},{"english":"Sublethal temperature might be suitable for polyploid inducement of cold shocks.","chinese":"亞致死溫度是低溫誘導多倍體的合適溫度。"},{"english":"This reveled that it was reliable to use the stoma characters to identify the polyploid.","chinese":"這說明利用氣孔特徵鑑定紅掌多倍體是可靠的。"},{"english":"The other is the disorder of synapsis of odd-numbered multiple polyploids.","chinese":"二是奇數倍多倍體聯會紊亂型。"},{"english":"Allopolyploid plants have a wide distribution in the nature.","chinese":"異源多倍體植物在自然界中廣泛分佈。"},{"english":"Chromosome reductional grouping happened more frequently in polyploid cells.","chinese":"染色體減數分組較多發生於多倍體細胞中。"},{"english":"A study of inducing polyploidy of Salvia miltiorrhiza Bunge in the process of tissue culture was made.","chinese":"應用組織培養技術進行人工誘導丹蔘多倍體的研究。"},{"english":"Total 43 polyploids individuals were obtained in this study.","chinese":"試驗共獲得杜仲多倍體植株43株。"}],"related":[]}