{"definition":["multi-polarization\/multipolarization\/multi-polarity\/multipolar\/pluralization"],"pinyin":["duo1 ji2 hua4"],"simplified":["多极化"],"rank":29591.0,"normalized_rank":0.4140164817483525,"fraction":9.736707711690875e-7,"cumulative_fraction":0.9898499014583056,"word":"多極化","characters":[{"definition":["many\/much\/often\/a lot of\/numerous\/more\/in excess\/how (to what extent)\/multi-\/Taiwan pr. [duo2] when it means \"how\""],"pinyin":["duo1"],"word":"多"},{"definition":["extremely\/pole (geography, physics)\/utmost\/top"],"pinyin":["ji2"],"word":"極"},{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"}],"containing_words":[],"sentences":[{"english":"The world multi-polarization trend continues to develop in a zigzagging process.","chinese":"世界多極化趨勢在曲折中發展。"},{"english":"World multi-polarization and economic globalization keep moving deeper.","chinese":"世界多極化和經濟全球化深入發展。"},{"english":"Economic multipolarity offers stability and opportunity, just like a diversified portfolio of investments.","chinese":"與投資多樣化一樣，經濟多極化可以帶來穩定與機遇。"},{"english":"The movement towards political multi-polarity of the world will be conducive to the democratization of international relations.","chinese":"世界政治多極化的發展，有利於推動國際關係民主化。"},{"english":"The present-day world trend is globalization in economics and multi-polarization in politics.","chinese":"當今世界的趨勢是經濟全球化和政治多極化。"},{"english":"The trend towards a more multi-lateral world is getting clearer.","chinese":"世界多極化的趨勢日益清晰。"},{"english":"The reform of the international system has been accelerating and the prospects of a multi-polar world become clearer.","chinese":"國際體系變革進程加快，世界多極化更加明朗。"},{"english":"The trend toward multi-polarity continues to gain momentum throughout the world.","chinese":"多極化趨勢正在全球範圍內繼續繼續發展。"},{"english":"Today's world is in the construction of a pluralized pattern.","chinese":"當今世界正處於多極化的格局構建中。"},{"english":"We must support the rise of multiple poles of growth that can benefit all.","chinese":"我們必須支持可以惠及所有人的多極化經濟增長。"}],"related":[]}