{"definition":["long time"],"pinyin":["duo1 shi2"],"simplified":["多时"],"rank":12481.0,"normalized_rank":0.1746253830117667,"fraction":0.0000057410081092260674,"cumulative_fraction":0.9467697252012442,"word":"多時","characters":[{"definition":["many\/much\/often\/a lot of\/numerous\/more\/in excess\/how (to what extent)\/multi-\/Taiwan pr. [duo2] when it means \"how\""],"pinyin":["duo1"],"word":"多"},{"definition":["o'clock\/time\/when\/hour\/season\/period","surname Shi"],"pinyin":["Shi2","shi2"],"word":"時"}],"containing_words":[{"definition":["often"],"pinyin":["hen3 duo1 shi2"],"word":"很多時"}],"sentences":[{"english":"April and Corinnehad been gone from home for some time, so I had no way of knowing what they looked like.","chinese":"阿普里爾和科琳已離家多時，我無緣一睹她們的芳容。"},{"english":"When Bodhisattva Avalokiteshvara was practicing the profound Prajna Paramita, he illuminated the Five Skandhas and saw that they are all empty.","chinese":"觀自在菩薩行甚深般若波羅蜜多時，照見五蘊皆空。"},{"english":"Speech appeared in the little girl's second year.","chinese":"這小女孩在一歲多時開始說話。"},{"english":"Some might be surprised to hear that the Mavs haven't gotten to the rim as much as they did last season.","chinese":"有人在聽到小牛突破籃下沒有上賽季多時可能會驚訝。"},{"english":"Whevern I heared the news that someone of these friends was gone, I would be sad for a long time.","chinese":"我每當聽到一箇舊友死去的消息時候，總要惆悵多時。"},{"english":"I was expecting you. Are you NYPD or FBI?","chinese":"恭候多時了。你們是紐約警局的還是聯邦調查局的？"},{"english":"Was coursing in the deep Prajna Paramita.","chinese":"行深般若波羅蜜多時。"},{"english":"No news for a long time, and finally to an interview with Professor Kong Wei.","chinese":"記者輾轉多時，終於採訪到了孔維教授。"},{"english":"Obviously the place hadn't seen much use lately.","chinese":"很顯然，這房間已經棄置不用多時了。"},{"english":"This project has been a long time in the making and now we cannot wait to set sail .","chinese":"這個計畫已籌劃多時，現在我們等不及要啓程出海了。"},{"english":"She could reckon from 1 to 100 when she was more than one year old.","chinese":"她一歲多時就能從一數到一百。"},{"english":"It was a little after seven when he stopped and settled back into his rocking chair.","chinese":"七點多時，他停了下來，坐回了搖椅。"},{"english":"It is said that \"cat hath nine lives\", yet care would wear them all out.","chinese":"據說貓兒有九命，憂慮多時也傷身。"}],"related":[]}