{"definition":["to dream\/to sleep"],"pinyin":["meng4 mei4"],"simplified":["梦寐"],"rank":50487.0,"normalized_rank":0.7063786324905909,"fraction":1.3663505874276852e-7,"cumulative_fraction":0.9990283076636041,"word":"夢寐","characters":[{"definition":["dream\/CL:場|场[chang2],個|个[ge4]\/(bound form) to dream"],"pinyin":["meng4"],"word":"夢"},{"definition":["to sleep soundly"],"pinyin":["mei4"],"word":"寐"}],"containing_words":[{"definition":["to yearn for sth even in one's dreams (idiom)\/to long for sth day and night"],"pinyin":["meng4 mei4 yi3 qiu2"],"word":"夢寐以求"}],"sentences":[{"english":"It was powder blue and sleek[1] looking.The kind of car you dream about.","chinese":"粉藍色的車身閃着光芒，絕對是人們夢寐以求的車。"},{"english":"One superpower all psychologists would kill for is the ability to read minds.","chinese":"“讀心術”是每個心理學家都夢寐以求的超能力。"},{"english":"That might help it find a little more of the entrepreneurial vim it craves.","chinese":"這也許會助其得到一點點其夢寐以求的企業家精神。"},{"english":"When do you want to buy that dream house?","chinese":"什麼時候買你夢寐以求的房子？"},{"english":"You are a dream to work with.","chinese":"能夠與你共事，是我夢寐以求的事情。"},{"english":"It has been a long-cherished wish for the Chinese people to realize modernization.","chinese":"實現現代化是中國人民夢寐以求的夙願。"},{"english":"These are the issues the people in the region desperately need.","chinese":"這些都是本地區人民夢寐以求的。"},{"english":"I have had my “China dream” for years, now I am here to realize this dream.","chinese":"我多年夢寐以求的中國夢，竟然可以在此得以實現。"},{"english":"The simple truth is that China is hell-bent on world domination.","chinese":"事實很簡單，中國對於控制世界夢寐以求。"},{"english":"The sea Tao sound is yearning for which howmany people longs for even in dreams.","chinese":"大海的濤聲是多少人夢寐以求的嚮往。"},{"english":"Sometimes your castoff are other people's treasure.","chinese":"有時你丟棄的東西是別人夢寐以求的寶貝。"},{"english":"His long-cherished dream is to pursue his master's degree in Cambridge University.","chinese":"他夢寐以求的是去劍橋大學攻讀碩土學位。"},{"english":"The origin of OK became the Holy Grail of etymology.","chinese":"Ok的出典成了詞源學夢寐以求的聖盃。"},{"english":"Autumn sleeps in the shepherdess eyes.","chinese":"秋天夢寐在牧羊女的眼裏。"},{"english":"The lost me always dream of this tepid sheen.","chinese":"迷霧中的我，一直夢寐這亮晃晃的微溫。"},{"english":"On the back of the pack to the distance, the dream destination.","chinese":"背上行囊去遠方，那個夢寐以求的目的地。"}],"related":[]}