{"definition":["A leader can submit or can stand tall as required.\/ready to give and take\/flexible"],"pinyin":["da4 zhang4 fu5 neng2 qu1 neng2 shen1"],"simplified":["大丈夫能屈能伸"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"大丈夫能屈能伸","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["measure of length, ten Chinese feet (3.3 m)\/to measure\/husband\/polite appellation for an older male"],"pinyin":["zhang4"],"word":"丈"},{"definition":["(classical) this, that\/he, she, they\/(exclamatory final particle)\/(initial particle, introduces an opinion)","husband\/man\/manual worker\/conscripted laborer (old)"],"pinyin":["fu1","fu2"],"word":"夫"},{"definition":["can\/to be able to\/might possibly\/ability\/(physics) energy","surname Neng"],"pinyin":["Neng2","neng2"],"word":"能"},{"definition":["bent\/to feel wronged","surname Qu"],"pinyin":["Qu1","qu1"],"word":"屈"},{"definition":["can\/to be able to\/might possibly\/ability\/(physics) energy","surname Neng"],"pinyin":["Neng2","neng2"],"word":"能"},{"definition":["to stretch\/to extend"],"pinyin":["shen1"],"word":"伸"}],"containing_words":[],"sentences":[],"related":[{"definition":["can bow and submit, or can stand tall (idiom, from Book of Changes); ready to give and take\/flexible"],"pinyin":["neng2 qu1 neng2 shen1"],"word":"能屈能伸"},{"definition":["can bow and submit, or can stand tall (idiom, from Book of Changes); ready to give and take\/flexible"],"pinyin":["neng2 shen1 neng2 qu1"],"word":"能伸能屈"},{"definition":["a wise man knows better than to fight when the odds are against him (idiom)"],"pinyin":["hao3 han4 bu4 chi1 yan3 qian2 kui1"],"word":"好漢不吃眼前虧"},{"definition":["Only an outstanding talent can recognize current trends (idiom). A wise man submits to circumstances."],"pinyin":["shi2 shi2 wu4 zhe3 wei4 jun4 jie2"],"word":"識時務者為俊傑"},{"definition":["(coll.) he-man"],"pinyin":["nan2 zi3 han4 da4 zhang4 fu5"],"word":"男子漢大丈夫"},{"definition":["lit. for a nobleman to take revenge, ten years is not too long (idiom)\/fig. revenge is a dish best served cold"],"pinyin":["jun1 zi5 bao4 chou2 , shi2 nian2 bu4 wan3"],"word":"君子報仇，十年不晚"},{"definition":["a real man doesn't fight with womenfolk (idiom)"],"pinyin":["hao3 nan2 bu4 gen1 nu:3 dou4"],"word":"好男不跟女鬥"},{"definition":["a manly man\/a man of character"],"pinyin":["da4 zhang4 fu5"],"word":"大丈夫"},{"definition":["(idiom) great plans can be ruined by just a touch of impatience"],"pinyin":["xiao3 bu4 ren3 ze2 luan4 da4 mou2"],"word":"小不忍則亂大謀"},{"definition":["lit. the humiliation of having to crawl between the legs of one's adversary (as Han Xin 韓信|韩信[Han2 Xin4] supposedly did rather than engage in a sword fight) (idiom)\/fig. utter humiliation"],"pinyin":["kua4 xia4 zhi1 ru3"],"word":"胯下之辱"},{"definition":["where it is possible to let people off, one should spare them (idiom); anyone can make mistakes, forgive them when possible"],"pinyin":["de2 rao2 ren2 chu4 qie3 rao2 ren2"],"word":"得饒人處且饒人"},{"definition":["to admit defeat\/to give in\/to acknowledge a mistake\/to apologize\/to be amenable to persuasion"],"pinyin":["fu2 ruan3"],"word":"服軟"},{"definition":["to endure humiliation as part of an important mission (idiom); to suffer in silence"],"pinyin":["ren3 ru3 fu4 zhong4"],"word":"忍辱負重"},{"definition":["lit. can pick it up or put it down (idiom)\/fig. to take what comes\/to meet gains or losses with equanimity"],"pinyin":["na2 de5 qi3 fang4 de5 xia4"],"word":"拿得起放得下"},{"definition":["to go through hell for the sake of keeping up appearances (idiom)"],"pinyin":["si3 yao4 mian4 zi5 huo2 shou4 zui4"],"word":"死要面子活受罪"},{"definition":["to be spat on in the face and let it dry by itself, not wiping it off (idiom); to turn the other cheek\/to drain the cup of humiliation"],"pinyin":["tuo4 mian4 zi4 gan1"],"word":"唾面自乾"}]}