{"definition":["to shout and scream (idiom); to kick up a fuss\/to make a scene"],"pinyin":["da4 chao3 da4 nao4"],"simplified":["大吵大闹"],"rank":33422.0,"normalized_rank":0.4676171421375904,"fraction":6.960213248776926e-7,"cumulative_fraction":0.9930231549362846,"word":"大吵大鬧","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["to quarrel\/to make a noise\/noisy\/to disturb by making a noise"],"pinyin":["chao3"],"word":"吵"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["noisy\/cacophonous\/to make noise\/to disturb\/to vent (feelings)\/to fall ill\/to have an attack (of sickness)\/to go in (for some activity)\/to joke"],"pinyin":["nao4"],"word":"鬧"}],"containing_words":[],"sentences":[{"english":"And your fussing makes not a particle of difference to the offender.","chinese":"而你的大吵大鬧又不會給冒犯者造成甚麼影響。"},{"english":"You can't be a basketcase, a girl who causes a scene or a girl who drinks too much.","chinese":"你不能一無是處，只知道大吵大鬧或喝得爛醉。"},{"english":"The couple next door are at each other's throats again. Shall we do something?","chinese":"隔壁那對夫妻又在大吵大鬧了，我們要去勸勸嗎？"},{"english":"BaiLing dissatisfaction jasper come hell down her anger after her away.","chinese":"柏齡不滿碧玉到來大吵大鬧，怒摑她後將她趕走。"},{"english":"They scuffled after quarrelling.","chinese":"大吵大鬧之後他們又扭打在一起。"},{"english":"Market reopen after a cessation of business, clients because buy, be less than aquatic product roughhouse.","chinese":"菜市場開市，顧客們因爲買不到水產大吵大鬧。"},{"english":"These kids ought to feel ashamed of themselves for such a free-for-all in public.","chinese":"這些孩子在大庭廣衆這樣大吵大鬧真是該感到害臊。"},{"english":"The young salesgirl rowed fiercely with the manager yesterday morning.","chinese":"昨天上午這位年輕的女售貨員與經理大吵大鬧。"},{"english":"I got into brawls in the country saloons near my farm.","chinese":"我在離我農場不遠的鄉下沙龍里和別人大吵大鬧。"},{"english":"Please don't make a scene in public places.","chinese":"請不要在公共場合大吵大鬧出洋相。"},{"english":"She said it was like the Titanic going down—people screaming and yelling.","chinese":"她說，像泰坦尼克號正在下沉，人們大吵大鬧。"},{"english":"Remember toddlers are allowed to throw tantrums. Parents are not.","chinese":"記住，小孩子可以大吵大鬧，但是父母卻不能。"},{"english":"When playing, he could not be interrupted without a creating a fuss.","chinese":"玩耍的時候，如果被打斷，他不可能不大吵大鬧。"}],"related":[{"definition":["to use violence (against sb)\/to strong-arm sb\/to manhandle"],"pinyin":["dong4 cu1"],"word":"動粗"},{"definition":["to be furious\/to fly into a terrible rage"],"pinyin":["da4 fa1 lei2 ting2"],"word":"大發雷霆"},{"definition":["loss of love\/breakup of a relationship"],"pinyin":["qing2 bian4"],"word":"情變"},{"definition":["traitor to one's love\/heartless rat"],"pinyin":["fu4 xin1 han4"],"word":"負心漢"},{"definition":["spitting anger (idiom); in a rage"],"pinyin":["nu4 qi4 chong1 chong1"],"word":"怒氣沖沖"},{"definition":["to send (sb) away\/to change the subject\/to open (an umbrella etc)"],"pinyin":["zhi1 kai1"],"word":"支開"},{"definition":["old: to reap the consequences of one's words (idiom, from Mencius); modern: to go back on one's word\/to blow hot and cold\/to contradict oneself\/inconsistent"],"pinyin":["chu1 er3 fan3 er3"],"word":"出爾反爾"},{"definition":["to lose one's cool\/to get impatient\/unable to remain calm"],"pinyin":["chen2 bu4 zhu4 qi4"],"word":"沉不住氣"},{"definition":["to refute\/to demolish (an argument, theory etc)"],"pinyin":["bo2 dao3"],"word":"駁倒"},{"definition":["to look anxious (idiom)\/to look miserable"],"pinyin":["chou2 mei2 ku3 lian3"],"word":"愁眉苦臉"},{"definition":["to get angry"],"pinyin":["dong4 nu4"],"word":"動怒"},{"definition":["open the net on one side (idiom); let the caged bird fly\/to give one's opponent a way out\/lenient treatment"],"pinyin":["wang3 kai1 yi1 mian4"],"word":"網開一面"},{"definition":["to gesticulate\/to make lively gestures (while talking)\/also written 比手劃腳|比手划脚"],"pinyin":["bi3 shou3 hua4 jiao3"],"word":"比手畫腳"},{"definition":["proud and arrogant"],"pinyin":["xin1 gao1 qi4 ao4"],"word":"心高氣傲"},{"definition":["not recognizing one's family (idiom); self-centered and not making any allowances for the needs of one's relatives"],"pinyin":["liu4 qin1 bu4 ren4"],"word":"六親不認"},{"definition":["to ignore\/to brush off\/to dismiss\/to pay no attention to"],"pinyin":["bu4 yu3 li3 hui4"],"word":"不予理會"}]}