{"definition":["generally\/in general"],"pinyin":["da4 fan2"],"simplified":["大凡"],"rank":30254.0,"normalized_rank":0.4232927119331776,"fraction":9.219946912599637e-7,"cumulative_fraction":0.9904785371749834,"word":"大凡","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["ordinary\/commonplace\/mundane\/temporal\/of the material world (as opposed to supernatural or immortal levels)\/every\/all\/whatever\/altogether\/gist\/outline\/note of Chinese musical scale"],"pinyin":["fan2"],"word":"凡"}],"containing_words":[{"definition":["a rough acquaintance with sth"],"pinyin":["da4 fan2 cu1 zhi1"],"word":"大凡粗知"}],"sentences":[{"english":"Generally speaking , the most pianists all accepted the professional training in the year one.","chinese":"大凡鋼琴家都在早年接受過專業訓練。"},{"english":"Almost all the beautiful things people can be most exciting, heart health pleasure.","chinese":"大凡美麗的事物，均可讓人怦然心動，心生愉悅。"},{"english":"Generally write novels, and who do not want to come up with a \"great Chinese novel\"?","chinese":"大凡寫小說的，誰不想弄出一部“偉大的中國小說”？"},{"english":"May engage in the arts are generally similar Nga some good.","chinese":"也許大凡搞藝術的人都有些類似的雅好。"},{"english":"Individuals who succeed have a belief in the power of commitment.","chinese":"大凡成功者，無不相信全力以赴的力量。"},{"english":"Mostly successful cabaret, needed a large quantity to know of the private come to common construction.","chinese":"大凡成功的酒店，需要有一大批有識之士來共同建設。"},{"english":"When people die in hot weather, they usually foam at the mouth just as he did.","chinese":"大凡人死在熱天，就會冒出這種白沫來，我見過。"},{"english":"Trade generally lively when enter the arena talent is promising achieve earnings of short-term price difference .","chinese":"大凡交易熱鬧時進場，纔有希望獲得短期的差價收益。"},{"english":"Therefore, a in a media appearances in evidence chance, he never pass.","chinese":"因此，大凡有在媒體露臉留痕的機會，他都絕不放過。"},{"english":"Remember that this usually comes from doing the things that most people don't do.","chinese":"記住這大凡來自做大大都人不做的事情。"},{"english":"Left to themselves, things tend to go from bad to worse.","chinese":"大凡事物，聽其自然就會每況愈下。"},{"english":"Generally those who drink will cause traffic accidents.","chinese":"大凡酒後開車的都易出車禍。"},{"english":"In a sexist male society, that's a common illness.","chinese":"大凡男權社會的男人，都有這種通病。"}],"related":[{"definition":["since ancient times\/since times immemorial"],"pinyin":["gu3 wang3 jin1 lai2"],"word":"古往今來"},{"definition":["such things as ...\/examples including ... (etc)\/without exception\/every\/any"],"pinyin":["ju3 fan2"],"word":"舉凡"},{"definition":["one can't tell how many\/numerous similar cases"],"pinyin":["bu4 zhi1 fan2 ji3"],"word":"不知凡幾"},{"definition":["none doesn't\/there is none who isn't\/everyone"],"pinyin":["mo4 bu4"],"word":"莫不"},{"definition":["generally speaking\/by and large\/for the most part"],"pinyin":["da4 di3"],"word":"大抵"},{"definition":["so much so that\/to the extent that\/even"],"pinyin":["shen4 huo4"],"word":"甚或"},{"definition":["to be all the same way (literary)"],"pinyin":["jie1 ran2"],"word":"皆然"},{"definition":["such matters\/things like this\/this line of work\/this pursuit\/this hobby\/this endeavor"],"pinyin":["ci3 dao4"],"word":"此道"},{"definition":["since ancient times"],"pinyin":["zi4 gu3 yi3 lai2"],"word":"自古以來"},{"definition":["therefore"],"pinyin":["gu4 ci3"],"word":"故此"},{"definition":["lit. peddlers and carriers\/common people\/lower class"],"pinyin":["fan4 fu1 zou3 zu2"],"word":"販夫走卒"},{"definition":["the Three Religions (Daoism, Confucianism, Buddhism) and Nine Schools (Confucians, Daoists, Yin-Yang, Legalists, Logicians, Mohists, Political Strategists, Eclectics, Agriculturists)\/fig. people from all trades (often derog.)"],"pinyin":["san1 jiao4 jiu3 liu2"],"word":"三教九流"},{"definition":["to succeed\/successful"],"pinyin":["you3 cheng2"],"word":"有成"},{"definition":["no wonder (that...)"],"pinyin":["wu2 guai4 hu1"],"word":"無怪乎"},{"definition":["as many as the hair of the ox (idiom)\/great amount of\/countless"],"pinyin":["duo1 ru2 niu2 mao2"],"word":"多如牛毛"},{"definition":["not only"],"pinyin":["bu4 wei2"],"word":"不惟"}]}