{"definition":["David (name)"],"pinyin":["Da4 wei3"],"simplified":["大伟"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"大偉","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["big\/large\/great"],"pinyin":["wei3"],"word":"偉"}],"containing_words":[],"sentences":[{"english":"I call Li big great, Toyear 25","chinese":"我叫李大偉，今年25。"},{"english":"David about tzu chi Ming fishing, dropping in inquiry learning to protect.","chinese":"大偉約志明釣魚，順道詢問學護的表現。"},{"english":"Dave and Susan had an argument last night.","chinese":"大偉和蘇珊昨晚大吵一架。"},{"english":"Wu Dawei pointed out that there are various forms of dialogue under the Six-party Talks framework.","chinese":"武大偉指出，六方會談框架內包括多種對話方式。"},{"english":"Mr. Roth. This is David Wong from ABC Insurance Company.","chinese":"樂先生，我是ABC保險公司的王大偉。"},{"english":"Contradiction of wife and mother makes the big Wei that gets splint air suffers from went up depressed disease.","chinese":"婆媳矛盾使得受夾板氣的大偉患上了抑鬱症。"},{"english":"This is David Wong speaking from ABC Insurance Company.","chinese":"我是ABC保險公司的王大偉。"},{"english":"In return for David, and discussions with President sun his recovery plan.","chinese":"國大偉尋訪歸來，和孫院長一起研討自己的復甦計劃。"},{"english":"First, will Vice Foreign Minister Wu Dawei attend the meeting?","chinese":"第一，武大偉副部長是否與會？"},{"english":"David Dollar is World Bank country director for China and Mongolia.","chinese":"杜大偉是世界銀行中國和蒙古處處長。"},{"english":"Cong ex-boyfriend Jiang Dawei, said he is willing to accept the plexus.","chinese":"叢前男友姜大偉出面，表示自己願意接納叢。"},{"english":"When Davids tianhao people make things, immediately pie to hesitate.","chinese":"當大偉手下說是天豪的人鬧的事，頓時大餅猶豫起來。"},{"english":"Also, could you brief us on Vice Foreign Minister Wu Dawei's recent visit to Japan?","chinese":"此外，請介紹武大偉副部長近期訪日的有關情況。"},{"english":"Following the briefing, Vice Minister Wu Dawei took questions from the journalists.","chinese":"介紹情況後，武大偉副部長還回答了記者的提問。"},{"english":"He Da Dun Wei's elder sister, He Zhi Xia, that shrieks a cleverness.","chinese":"何大偉的姐姐何志霞那叫一個聰明。"},{"english":"\"These people are expected to be the very best mainland Chinese living abroad,\" said Zweig.","chinese":"“這些人有望成爲最優秀的華僑”，崔大偉認爲。"}],"related":[{"definition":["Mao Sui recommends himself (idiom); to offer one's services (in the style of Mao Sui offering his services to king of Chu 楚 of the Warring states)"],"pinyin":["Mao2 Sui4 zi4 jian4"],"word":"毛遂自薦"},{"definition":["honorable even in defeat (idiom)"],"pinyin":["sui1 bai4 you2 rong2"],"word":"雖敗猶榮"},{"definition":["lost-and-found"],"pinyin":["shi1 wu4 zhao1 ling3"],"word":"失物招領"},{"definition":["the utmost care (idiom); to look after sb in every possible way"],"pinyin":["guan1 huai2 bei4 zhi4"],"word":"關懷備至"},{"definition":["to fight openly and maneuver covertly (idiom)"],"pinyin":["ming2 zheng1 an4 dou4"],"word":"明爭暗鬥"},{"definition":["to reveal the cloven foot (idiom); to unmask one's true nature\/to give the game away"],"pinyin":["lu4 chu1 ma3 jiao3"],"word":"露出馬腳"},{"definition":["to run this way and that (idiom); to rush about busily\/to bustle about"],"pinyin":["dong1 ben1 xi1 pao3"],"word":"東奔西跑"},{"definition":["country music (country & western music genre)"],"pinyin":["xiang1 cun1 yin1 yue4"],"word":"鄉村音樂"},{"definition":["to be promoted and gain wealth (idiom)"],"pinyin":["sheng1 guan1 fa1 cai2"],"word":"升官發財"},{"definition":["the China Seas (the seas of the Western Pacific Ocean, around China: Bohai Sea, Yellow Sea, East China Sea, South China Sea)"],"pinyin":["Zhong1 guo2 Hai3"],"word":"中國海"},{"definition":["smile spread across the face (idiom); beaming with pleasure\/all smiles\/joy written across one's face"],"pinyin":["xiao4 zhu2 yan2 kai1"],"word":"笑逐顏開"},{"definition":["respectful closing to a letter"],"pinyin":["jing4 qi3"],"word":"敬啟"},{"definition":["geek (loanword) (computing)"],"pinyin":["ji2 ke4"],"word":"極客"},{"definition":["masquerade"],"pinyin":["hua4 zhuang1 wu3 hui4"],"word":"化妝舞會"},{"definition":["flippant and insincere (piece of writing or speech)\/glib-tongued\/oily"],"pinyin":["you2 qiang1 hua2 diao4"],"word":"油腔滑調"},{"definition":["Yellow Pages"],"pinyin":["huang2 ye4"],"word":"黃頁"}]}