{"definition":["to go all out\/to work energetically"],"pinyin":["da4 gan4"],"simplified":["大干"],"rank":23810.0,"normalized_rank":0.33313279140374685,"fraction":0.0000016502770716741432,"cumulative_fraction":0.9824277970428901,"word":"大幹","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["tree trunk\/main part of sth\/to manage\/to work\/to do\/capable\/cadre\/to kill (slang)\/to fuck (vulgar)"],"pinyin":["gan4"],"word":"幹"}],"containing_words":[],"sentences":[{"english":"And while you've been absent, others have flourished.","chinese":"而就在你還沒回過神來時，其他人已經大幹快上了。"},{"english":"Jo's ambition was to do something very splendid.","chinese":"裘的志向是想轟轟烈烈地大幹一番。"},{"english":"Virtue. in the great world, should be amenable.","chinese":"在這大幹世界上，需要的是一種容人悔改的美德。"},{"english":"Gabriela Dabrowski, meanwhile, is thinking big.","chinese":"與此同時，東布羅夫斯基正想着如何大幹一場。"},{"english":"Mine leadership and the cadres and workers to watch a wonderful performance.","chinese":"該礦領導班子與廣大幹部職工一同觀看了精彩的演出。"},{"english":"The large disturbance stability also depends on the rate of the reactive power between electric source and the load.","chinese":"大幹擾的穩定性還依賴於電源與負荷的無功變化速度。"},{"english":"The mouth is so dry that it is difficulty for the patient to masticate and swallow food.","chinese":"口內大幹，以致病人咀嚼和吞下食物，都有困難。"},{"english":"There are companies across India and China who say they are raring to go.","chinese":"印度和中國的製藥公司都說他們渴望放手大幹。"},{"english":"This is Whitman's for-real next big gig.","chinese":"惠特曼這次可是要真刀真槍地再大幹一場。"},{"english":"These are the results that save broad cadre masses to try hard actively completely.","chinese":"這些是全省廣大幹部羣衆積極努力的結果。"},{"english":"Team was pumped to play chicago again, being an \"up and coming team\".","chinese":"球隊再度碰到芝加哥公牛隊，大家卯足了勁大幹一番。"},{"english":"I can imagine the temptation was just to roll it out.","chinese":"我能夠想象，大家很期待大幹一場。"},{"english":"I'm going to play it if I can get somebody to go in with me.","chinese":"如果能有個人和我合夥的話，我準備大幹一場。"}],"related":[{"definition":["to be drowned (figurative and literal)"],"pinyin":["mie4 ding3"],"word":"滅頂"},{"definition":["to speak forcefully and with justice (idiom); to argue with the courage of one's convictions"],"pinyin":["zhen4 zhen4 you3 ci2"],"word":"振振有詞"},{"definition":["to throw one's life in for\/to haplessly give one's life for\/to sacrifice oneself torturously working for another or for a group\/to pour in one's utmost effort\/to shed one's last ounce of strength for"],"pinyin":["mai4 ming4"],"word":"賣命"},{"definition":["to suffer defeat in every battle (idiom)"],"pinyin":["lu:3 zhan4 lu:3 bai4"],"word":"屢戰屢敗"},{"definition":["lit. single spear and horse (idiom); fig. single-handed\/unaccompanied"],"pinyin":["dan1 qiang1 pi3 ma3"],"word":"單槍匹馬"},{"definition":["like a swarm of bees\/everyone swarms around pushing and shouting\/a hornet's nest"],"pinyin":["yi1 wo1 feng1"],"word":"一窩蜂"},{"definition":["counting one's chickens before they are hatched"],"pinyin":["ru2 yi4 suan4 pan2"],"word":"如意算盤"},{"definition":["to wave flags and shout battle cries (idiom); to egg sb on\/to give support to"],"pinyin":["yao2 qi2 na4 han3"],"word":"搖旗吶喊"},{"definition":["total defeat of an army (idiom); fig. a complete wipeout"],"pinyin":["quan2 jun1 fu4 mo4"],"word":"全軍覆沒"},{"definition":["it is everyone's duty"],"pinyin":["ren2 ren2 you3 ze2"],"word":"人人有責"},{"definition":["red in the face\/extremely angry"],"pinyin":["lian3 hong2 bo2 zi5 cu1"],"word":"臉紅脖子粗"},{"definition":["lit. lively dragon and animated tiger (idiom)\/fig. vigorous and lively"],"pinyin":["sheng1 long2 huo2 hu3"],"word":"生龍活虎"},{"definition":["lit. chasing the wind and clutching at shadows (idiom); fig. groundless accusations\/to act on hearsay evidence"],"pinyin":["bu3 feng1 zhuo1 ying3"],"word":"捕風捉影"},{"definition":["old school\/conservative faction"],"pinyin":["jiu4 pai4"],"word":"舊派"},{"definition":["to die in such a way that sb (or sth) else also perishes\/to take sb down with oneself\/to end in mutual destruction"],"pinyin":["tong2 gui1 yu2 jin4"],"word":"同歸於盡"},{"definition":["lit. dumb as a wooden chicken (idiom); fig. dumbstruck"],"pinyin":["dai1 ruo4 mu4 ji1"],"word":"呆若木雞"}]}