{"definition":["Advanced Subjects Test, university entrance exam that assesses candidates’ higher level knowledge of specific subjects and their readiness to study in their selected academic discipline (Tw)\/abbr. to 指考[Zhi3 kao3]"],"pinyin":["Da4 xue2 Ru4 xue2 Zhi3 ding4 Ke1 mu4 Kao3 shi4"],"simplified":["大学入学指定科目考试"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"大學入學指定科目考試","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"},{"definition":["finger\/to point at or to\/to indicate or refer to\/to depend on\/to count on\/(of hair) to stand on end"],"pinyin":["zhi3"],"word":"指"},{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"},{"definition":["branch of study\/administrative section\/division\/field\/branch\/stage directions\/family (taxonomy)\/rules\/laws\/to mete out (punishment)\/to levy (taxes etc)\/to fine sb\/CL:個|个[ge4]"],"pinyin":["ke1"],"word":"科"},{"definition":["eye\/item\/section\/list\/catalogue\/table of contents\/order (taxonomy)\/goal\/name\/title"],"pinyin":["mu4"],"word":"目"},{"definition":["to check\/to verify\/to test\/to examine\/to take an exam\/to take an entrance exam for\/deceased father"],"pinyin":["kao3"],"word":"考"},{"definition":["to test\/to try\/experiment\/examination\/test"],"pinyin":["shi4"],"word":"試"}],"containing_words":[],"sentences":[],"related":[]}