{"definition":["atmospheric pressure"],"pinyin":["da4 qi4 ya1 li4"],"simplified":["大气压力"],"rank":50560.0,"normalized_rank":0.7073999972017405,"fraction":1.3561321535473499e-7,"cumulative_fraction":0.9990382443606646,"word":"大氣壓力","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"},{"definition":["power\/force\/strength\/ability\/strenuously","surname Li"],"pinyin":["Li4","li4"],"word":"力"}],"containing_words":[],"sentences":[{"english":"When the pressure gets low the boiling-point becomes low.","chinese":"如果大氣壓力低，沸點就低。"},{"english":"As the vapor condenses into rain, the local atmospheric pressure drops.","chinese":"當水汽凝成雨水，會造成局域性的大氣壓力下降。"},{"english":"Atmospheric pressure acting on the downstream side of the diaphragm forces the diaphragm and seat up.","chinese":"作用於隔膜下側的大氣壓力使隔膜和閥座上升開啓。"},{"english":"The gas to be studied is admitted to the tube at a known temperature and at atmospheric pressure.","chinese":"被研究的氣體在已知溫度和大氣壓力下充入管中。"},{"english":"PRESSURE】The air pressure at sea level is nearly 15 pounds for each square inch.","chinese":"海平面上的大氣壓力每一平方英寸約有十五磅。"},{"english":"The deviation of sound above and below the atmospheric pressure levels is called Sound Pressure.","chinese":"上述偏差的聲音和大氣壓力下被稱爲聲壓水平。"},{"english":"A high vacuum in the fuel tank can cause atmospheric pressure to collapse the tank.","chinese":"燃油箱內的高真空，會引起大氣壓力壓塌油箱。"},{"english":"When a pressure is less than atmospheric pressure it is called a vacuum.","chinese":"某種壓力低於大氣壓力的狀況被稱作真空。"},{"english":"If we did not have atmospheric pressure.","chinese":"假如我們沒有大氣壓力。"},{"english":"These movements create a difference in atmospheric pressure.","chinese":"這些運動創建一個大氣壓力的差異。"},{"english":"By default, the Kestrel will record the barometric pressure and other settings hourly.","chinese":"產品默認每小時自動記錄大氣壓力和其他設置。"},{"english":"When pressure is increased, the ancroid is squeezed, so it shortens.","chinese":"當大氣壓力增加時，膜盒壓緊而縮短。"},{"english":"On Earth, the atmosphere is constantly pushing against your body.","chinese":"而在地球上，大氣壓力無處不在。"},{"english":"A barometer is used for measuring atmospheric pressure.","chinese":"氣壓計被用來測量大氣壓力。"},{"english":"Eventually, the balloon will grow from lack of atmospheric pressure, burst, and begin to fall.","chinese":"最終，氣球會因爲大氣壓力爆炸，開始降落。"},{"english":"A simple instrument for indicating changes in atmospheric pressure.","chinese":"顯示大氣壓力變化的簡單裝置。"}],"related":[]}