{"definition":["Daihatsu, Japanese car company"],"pinyin":["Da4 fa1"],"simplified":["大发"],"rank":14462.0,"normalized_rank":0.20234214318693766,"fraction":0.000004412611704782486,"cumulative_fraction":0.95673099131818,"word":"大發","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"}],"containing_words":[{"definition":["to be furious\/to fly into a terrible rage"],"pinyin":["da4 fa1 lei2 ting2"],"word":"大發雷霆"},{"definition":["the four great Chinese inventions: paper, printing, magnetic compass and gunpowder"],"pinyin":["si4 da4 fa1 ming2"],"word":"四大發明"}],"sentences":[{"english":"All the while, making both foreign and Chinese traders very wealthy.","chinese":"這讓外國和中國的商人大發橫財。"},{"english":"Many companies tapped into the cheap labor of this country to make a fortune.","chinese":"許多公司利用了這個國家便宜的人工來大發利市。"},{"english":"She raged against her husband for some household affairs.","chinese":"她爲一些家庭瑣事對丈夫大發雷霆。"},{"english":"The runup in business school applications during the recession has created a windfall for essay writers.","chinese":"衰退期間湧現的商學院申請令論文寫手大發橫財。"},{"english":"As I was going through that period of financial scarcity, I prayed that I didn’t experience a cash windfall.","chinese":"在我身無分文的那段時間，我祈禱自己不會大發橫財。"},{"english":"When Alex began to discuss, chaussures homme, Richard explosion into a rage.","chinese":"當阿列克斯開始爭論時，理查德便大發雷霆。"},{"english":"Last night, I stomped into our bedroom ready to turn on my anger at full volume.","chinese":"昨晚，我跺着腳進臥室，準備大發雷霆。"},{"english":"That man wore a new hairpiece every day and seemed to be a big wig.","chinese":"那個人每天戴着新的假髮，看起來像個大發套。"},{"english":"Example: When I told Raymand that someone has taken his candy box away, he went through the roof.","chinese":"當雷蒙德聽我說他的糖果盒被人拿走的時候大發雷霆。"},{"english":"She often hits the roof because of trifles.","chinese":"她常爲雞毛蒜皮的小事大發雷霆。"},{"english":"Things are going very badly with me, nothing but a succession of vexations and fits of rage.","chinese":"我的環境很不好，除了不絕的煩惱，就是大發性情。"},{"english":"If I remember correctly, this is the eighteenth contract I've signed with Dafa Garments.","chinese":"如果我沒記錯的話，這是我同大發籤的第十八個合同。"},{"english":"When Alex began to argue, Richard burst into a rage.","chinese":"當阿列克斯開始爭論時，理查德便大發雷霆。"},{"english":"The veteran crooner took out his anger over a leaked record on a producer.","chinese":"這位老牌歌手因唱片歌曲被泄露，向製作人大發雷霆。"},{"english":"This caused Edward's jealousy.","chinese":"這引起了愛德華的醋意大發。"},{"english":"A side-opening breach also allows quicker reloading and the use of larger rounds, said Phung.","chinese":"阿方開放違反還可以更快地裝填和使用大發，說奉。"}],"related":[{"definition":["Robam (brand)","boss\/business proprietor\/CL:個|个[ge4]"],"pinyin":["Lao3 ban3","lao3 ban3"],"word":"老闆"},{"definition":["to play a joke\/to make fun of\/to joke"],"pinyin":["kai1 wan2 xiao4"],"word":"開玩笑"},{"definition":["happy\/joyous\/delighted\/to like\/to be fond of"],"pinyin":["huan1 xi3"],"word":"歡喜"},{"definition":["the Three Precious Treasures of Buddhism, namely: the Buddha 佛, the Dharma 法 (his teaching), and the Sangha 僧 (his monastic order)"],"pinyin":["san1 bao3"],"word":"三寶"},{"definition":["(it's) no wonder (that...)\/(it's) not surprising (that)"],"pinyin":["nan2 guai4"],"word":"難怪"},{"definition":["seldom\/rare\/hard to come by"],"pinyin":["nan2 de2"],"word":"難得"},{"definition":["senior male fellow student or apprentice\/son (older than oneself) of one's teacher"],"pinyin":["shi1 xiong1"],"word":"師兄"},{"definition":["stalwart\/sturdy\/strong\/powerful","strength\/energy\/enthusiasm\/spirit\/mood\/expression\/interest\/CL:把[ba3]\/Taiwan pr. [jing4]"],"pinyin":["jin4","jing4"],"word":"勁"},{"definition":["just now\/a moment ago"],"pinyin":["gang1 cai2"],"word":"剛才"},{"definition":["can't say for sure\/maybe"],"pinyin":["shuo1 bu5 ding4"],"word":"說不定"},{"definition":["to see\/to catch sight of"],"pinyin":["kan4 jian4"],"word":"看見"},{"definition":["to talk about\/to mention\/(preposition) as for"],"pinyin":["shuo1 dao4"],"word":"說到"},{"definition":["at once\/right away\/immediately\/on horseback (i.e. by military force)"],"pinyin":["ma3 shang4"],"word":"馬上"},{"definition":["master\/qualified worker\/respectful form of address for older men\/CL:個|个[ge4],位[wei4],名[ming2]"],"pinyin":["shi1 fu5"],"word":"師傅"},{"definition":["conveniently\/in passing\/without much extra effort"],"pinyin":["shun4 bian4"],"word":"順便"},{"definition":["to let off\/to let slip by\/to let sb get away with sth"],"pinyin":["fang4 guo4"],"word":"放過"}]}