{"definition":["very far away"],"pinyin":["da4 lao3 yuan3"],"simplified":["大老远"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"大老遠","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["far\/distant\/remote\/(intensifier in a comparison) by far\/much (lower etc)","to distance oneself from (classical)"],"pinyin":["yuan3","yuan4"],"word":"遠"}],"containing_words":[],"sentences":[{"english":"But she had come this far, she wasn't going to back out now.","chinese":"不過既然大老遠跑來，絕不會此刻罷手。"},{"english":"Take airplane and greatly and from afar bring to China to this niggard.","chinese":"坐着飛機大老遠的把這個吝嗇鬼送到中國。"},{"english":"You dragged me all the way out here to watch a war movie?","chinese":"你大老遠拖我到這裏來看戰爭片？"},{"english":"I dont know why anyone would want to use their money visiting a zoo so far away.","chinese":"我不知道爲什麼會有人會花錢跑大老遠參觀動物園。"},{"english":"Thanks for coming all the way over here.","chinese":"謝謝你大老遠的來到這兒。"},{"english":"They came all the way from Brazil.","chinese":"他們大老遠的從巴西來。"},{"english":"I knew I was on the right move to come so far away from China.","chinese":"我知道大老遠從中國跑到這裏來，算是來對了。"},{"english":"I came all this way here to get stuck on the wrong and of this rock pile?","chinese":"我跑了這麼大老遠，就這樣被困在石頭堆裏？"},{"english":"\"What made you decide to move here all the way from the North-East?\" I asked.","chinese":"“怎麼想到要大老遠地從東北搬到這裏來？”我問。"},{"english":"You came all the way from to give me a lecture?","chinese":"你大老遠從倫敦來到這裏就爲了教訓我？"},{"english":"Thank you for coming to my home away from home.","chinese":"感謝你大老遠地到我這來做客。"}],"related":[]}