{"definition":["to harangue\/to yak"],"pinyin":["da4 tan2"],"simplified":["大谈"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"大談","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["surname Tan","to speak\/to talk\/to converse\/to chat\/to discuss"],"pinyin":["Tan2","tan2"],"word":"談"}],"containing_words":[{"definition":["to keep on talking about"],"pinyin":["da4 tan2 te4 tan2"],"word":"大談特談"}],"sentences":[{"english":"It talks about sex but we don't in our churches.","chinese":"這經大談性愛，人們卻不把它帶進教堂。"},{"english":"Dabao still in front of YiFan talk today send express experience.","chinese":"大寶還在一帆面前大談特談今天送快遞的經歷。"},{"english":"They talked glibly about unity but never did anything to advance it.","chinese":"他們大談團結，卻沒有作任何事來促進團結。"},{"english":"She just plunged in talking about her experience, the phone rang.","chinese":"她剛要開始大談她的經歷，電話就響了。"},{"english":"The Earth Summit is not just about problems.","chinese":"地球峯會不僅僅是大談問題之處。"},{"english":"The auto makers and the union sketched their companies' far-reaching impact.","chinese":"汽車製造商和工會也大談它們公司的深遠影響。"},{"english":"You prate of sentences having subjects, but all that sort of talk is out of date.","chinese":"你大談句子必須有主語，這種分類早就過時了。"},{"english":"Why do all these cunts talk about love so much, can you tell me that?","chinese":"爲什麼所有女人都要大談特談愛情，你能告訴我嗎？"},{"english":"The stately began to talk about success of the road, the road of life.","chinese":"便開始堂而皇之的大談成功之道，人生之道等等。"},{"english":"The younger guests were talking and eating with animation.","chinese":"年輕的客人正在大談大喫。"},{"english":"In interviews, Ive talks intensely about the tactile quality of industrial design.","chinese":"採訪中伊夫大談他對工業產品的手感的要求。"}],"related":[]}