{"definition":["Damascus, capital of Syria"],"pinyin":["Da4 ma3 shi4 ge2"],"simplified":["大马士革"],"rank":25669.0,"normalized_rank":0.3591426132945308,"fraction":0.0000013927725378896949,"cumulative_fraction":0.98525148899212,"word":"大馬士革","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["horse\/CL:匹[pi3]\/horse or cavalry piece in Chinese chess\/knight in Western chess","surname Ma\/abbr. for Malaysia 馬來西亞|马来西亚[Ma3 lai2 xi1 ya4]"],"pinyin":["Ma3","ma3"],"word":"馬"},{"definition":["member of the senior ministerial class (old)\/scholar (old)\/bachelor\/honorific\/soldier\/noncommissioned officer\/specialist worker","surname Shi"],"pinyin":["Shi4","shi4"],"word":"士"},{"definition":["animal hide\/leather\/to reform\/to remove\/to expel (from office)"],"pinyin":["ge2"],"word":"革"}],"containing_words":[{"definition":["damson (fruit)"],"pinyin":["Da4 ma3 shi4 ge2 li3"],"word":"大馬士革李"}],"sentences":[{"english":"But they leading him by the hands, brought him to Damascus.","chinese":"人們牽著他的手，領他進了大馬士革。"},{"english":"Eyes are now turning on Damascus and Aleppo.","chinese":"視線正在向大馬士革和阿勒波轉移。"},{"english":"Our reporter says fighting is continuing in Demara and that the atmosphere in Bangui is very tense.","chinese":"記者稱大馬士革的戰鬥仍在繼續，班基的氣氛很緊張。"},{"english":"Heaven ancient capital, Damascus, mysterious and old.","chinese":"天國古都，大馬士革，神祕又古老。"},{"english":"We had one last trip to make, a day excursion from Damascus by car - just.","chinese":"最後的遊程是從大馬士革乘汽車出發作一天的遠足。"},{"english":"You don'teven need a car in Damascus.","chinese":"在大馬士革遊覽甚至都不需要坐車。"},{"english":"Al-Mabhouh has lived in exile in Damascus for years.","chinese":"馬巴胡赫在大馬士革流亡多年。"},{"english":"He knew what God had done with him on that road to Damascus.","chinese":"他知道神在他回大馬士革的路上和他說了什麼。"},{"english":"Why is damask so unique then?","chinese":"爲什麼大馬士革刀如此獨特？"},{"english":"And I will kindle a fire in the wall of Damascus, and it shall consume the palaces of Benhadad.","chinese":"我必在大馬士革城中使火着起，燒滅便哈達的宮殿。"},{"english":"This would approach the opinion of the Damascene concerning the holiness of the active conception.","chinese":"這將接近輿論對大馬士革關於成聖的積極構想。"},{"english":"He wrote a lot of reports of the war in the Middle East during his stay in Damascus.","chinese":"他在大馬士革期間寫了很多報道中東戰爭的通訊。"},{"english":"He says the conflict in Syria will likely move increasingly to Damascus.","chinese":"哈林表示，敘利亞衝突可能會越來越轉向大馬士革。"},{"english":"Behold, Damascus is taken away from being a city, and it shall be a ruinous heap.","chinese":"看哪，大馬士革已被廢棄，不再爲城，必變作亂堆。"},{"english":"That was the chant from the mourners at a funeral in a Damascus suburb today.","chinese":"這是今天來自大馬士革郊區一個葬禮上悼念者的口號。"},{"english":"The burden of Damascus.","chinese":"論大馬士革的默示。"}],"related":[]}