{"definition":["in general\/more or less\/in rough terms\/basically\/on the whole\/overall situation\/the big picture\/(Tw) remains (of a dead person)"],"pinyin":["da4 ti3"],"simplified":["大体"],"rank":10860.0,"normalized_rank":0.15194548990527892,"fraction":0.000007220053424591165,"cumulative_fraction":0.9363475647988836,"word":"大體","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[{"definition":["overall\/in general terms"],"pinyin":["da4 ti3 shang4"],"word":"大體上"},{"definition":["to fail to see the larger issue (idiom)\/to fail to grasp the big picture"],"pinyin":["bu4 shi2 da4 ti3"],"word":"不識大體"}],"sentences":[{"english":"By using big VOXEL, the color or texture of a volume is rendered.","chinese":"通過大體素可顯示體的顏色與材質等屬性。"},{"english":"In general, this is even better news for developers.","chinese":"大體上，這對於開發者來說是件好事。"},{"english":"Orgasm is also likely to be similar in transgender and intersex individuals.","chinese":"而對於變性人和雌雄間性人來說也大體類似。"},{"english":"Results Macroscopically, the tumor appeared as a hard grayish-white mass.","chinese":"結果大體檢查腫瘤呈質硬灰白色腫塊。"},{"english":"The first regional demarcations followed roughly the settlement patterns of various ethnic immigrant groups.","chinese":"最初的區域界限大體沿循各族裔移民羣體的定居模式。"},{"english":"All in all, the party was pleasant.","chinese":"大體說來，這次舞會是另人愉快的。"},{"english":"The image above shows the general outline of a fixed-width website layout.","chinese":"上圖顯示了固定寬度網頁佈局大體上的實現方式。"},{"english":"This is the gross appearance of a parathyroid carcinoma.","chinese":"甲狀旁腺癌的大體外觀。"},{"english":"And the femur of course carries the body, to a large extent.","chinese":"股骨大體上，支撐着它的身體。"},{"english":"I envy you for giving such a personable and astute son gifted in both cultural and military affairs.","chinese":"朕羨慕你，有這樣識大體明事理，且文武兼備的兒子。"},{"english":"Generally speaking, the economic development in this area is not bad.","chinese":"大體說來，這個地區的經濟發展還算不錯。"},{"english":"That’s because your financial circumstances are pretty much the same as those of your classmates.","chinese":"因爲你和你同學的經濟情況大體相當。"},{"english":"On balance, dress designing appeals to me most.","chinese":"大體上說，我最喜歡服裝設計。"},{"english":"The intent of 820.130 is to add the broad conditions that are considered for a package design.","chinese":"部分規定的目的是增加包裝設計所需考慮的大體條件。"},{"english":"Large dark green lanes, there are gray stone miscellaneous flaws, resulting in the Han Dynasty.","chinese":"大體呈墨綠，雜有灰白石瑕，產生於漢代。"},{"english":"Some Heathen moralists also have taught very much the same lesson.","chinese":"一些非基督教的道德家，也說過大體相同的教言。"}],"related":[{"definition":["reality\/practice\/practical\/realistic\/real\/actual"],"pinyin":["shi2 ji4"],"word":"實際"},{"definition":["completely\/totally\/total\/entire\/overall\/population (statistics)"],"pinyin":["zong3 ti3"],"word":"總體"},{"definition":["according to\/basis\/foundation"],"pinyin":["yi1 ju4"],"word":"依據"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["relatively\/opposite\/to resist\/to oppose\/relative\/vis-a-vis\/counterpart"],"pinyin":["xiang1 dui4"],"word":"相對"},{"definition":["though\/although"],"pinyin":["sui1 shuo1"],"word":"雖說"},{"definition":["clear\/evident\/obvious(ly)"],"pinyin":["xian3 ran2"],"word":"顯然"},{"definition":["to explain\/to illustrate\/to indicate\/to show\/to prove\/explanation\/directions\/caption\/CL:個|个[ge4]"],"pinyin":["shuo1 ming2"],"word":"說明"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"畢竟"},{"definition":["to expound Buddhist teachings","way of speaking\/wording\/formulation\/one's version (of events)\/statement\/theory\/hypothesis\/interpretation"],"pinyin":["shuo1 fa3","shuo1 fa5"],"word":"說法"},{"definition":["fact\/CL:個|个[ge4]"],"pinyin":["shi4 shi2"],"word":"事實"},{"definition":["to contrast\/to compare\/to place side by side for comparison (as parallel texts)\/to check"],"pinyin":["dui4 zhao4"],"word":"對照"},{"definition":["structure\/composition\/makeup\/architecture\/CL:座[zuo4],個|个[ge4]"],"pinyin":["jie2 gou4"],"word":"結構"},{"definition":["difference\/discrepancy"],"pinyin":["cha1 yi4"],"word":"差異"},{"definition":["whole entity\/entire body\/synthesis\/as a whole (situation, construction, team etc)\/global\/macrocosm\/integral\/holistic\/whole"],"pinyin":["zheng3 ti3"],"word":"整體"},{"definition":["it can clearly be seen (that this is the case)\/it is (thus) clear\/clear\/visible"],"pinyin":["ke3 jian4"],"word":"可見"}]}