{"definition":["giant salamander (Andrias japonicus)"],"pinyin":["da4 ni2"],"simplified":["大鲵"],"rank":43835.0,"normalized_rank":0.6133085220992542,"fraction":2.672850347841978e-7,"cumulative_fraction":0.9977253548675734,"word":"大鯢","characters":[{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["Cryptobranchus japonicus\/salamander"],"pinyin":["ni2"],"word":"鯢"}],"containing_words":[],"sentences":[{"english":"The largest frog in the world is the giant salamander in China.","chinese":"最大的青蛙的世界，是在中國大鯢。"},{"english":"The axolotl, a neotenic species of salamander, a salamander that does not go through metamorphosis.","chinese":"娃娃魚，大鯢，蠑螈的一種，產自墨西哥。"},{"english":"The evolutionary position of the spinal cord is also discussed.","chinese":"文中還就大鯢脊髓在進化歷程中的位置作了討論。"},{"english":"The ultrustracture of the liver of the Chinese giant salamander, Andrias davidianus (Blanchard) was studied with transmission electron microscopy (TEM).","chinese":"應用透射電鏡對中國大鯢的肝臟進行了超微結構研究。"},{"english":"The general structural morphology of the liver of the Chinese giant salamander is also discussed in the paper.","chinese":"還討論了中國大鯢肝臟的一般形態結構特點。"},{"english":"The male reproductive system of Andrias davidianus was studied and it consisted of testis, deferent duct, efferent duct and so on.","chinese":"運用電鏡和光鏡研究了大鯢雄性生殖系統結構。"},{"english":"Andrias davidianus is a special product and one of the rare animals of China.","chinese":"中國大鯢是中國的一種特有珍稀動物。"},{"english":"We look forward to 3 years through the efforts of the industry giant salamander bigger and stronger.","chinese":"我們期望通過3年的努力，把大鯢產業做大做強。"},{"english":"17At up to six feet long, the Chinese giant salamander is the world's largest.","chinese":"最長達6英尺的中國大鯢，是世界上最大的鯢類。"}],"related":[]}