{"definition":["very good"],"pinyin":["tai4 hao3 le5"],"simplified":["太好了"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"太好了","characters":[{"definition":["highest\/greatest\/too (much)\/very\/extremely"],"pinyin":["tai4"],"word":"太"},{"definition":["good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello","to be fond of\/to have a tendency to\/to be prone to"],"pinyin":["hao3","hao4"],"word":"好"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly"],"pinyin":["le5","liao3"],"word":"了"}],"containing_words":[],"sentences":[{"english":"That's good. I was just wondering about how to spend my free time on weekends.","chinese":"太好了，我正在想怎麼打發我的週末時間呢？"},{"english":"Great, because I'm applying for my driver's license","chinese":"太好了，因爲我在申請駕照。"},{"english":"Great, what will my hours and salary be?","chinese":"太好了。我的工作時間和薪水是多少？"},{"english":"That would be great for JVG. Boost of confidence.","chinese":"太好了，老範會自信滿滿。"},{"english":"Excellent. Now what about tickets and table reservations ?","chinese":"平共處太好了。票和餐桌的預訂情況怎樣？"},{"english":"Great,we’d better make a booking. It’s quite busy this time of a day.","chinese":"太好了，我們最好先訂位，這個時間他們生意都很好。"},{"english":"\"Good, \" she said. \"Good for you.","chinese":"“太好了，”她說，“真有你的。”"},{"english":"Great. Which celebrities often participate in such events?","chinese":"這太好了。哪些名人經常參加這樣的活動？"},{"english":"The food was so good that he forgot his weight-watching program and pork himself out.","chinese":"食物太好了，他忘記了要減肥，開懷大嚼。"},{"english":"Oh, great. Dr. Johnson will be available on Friday afternoon this week.","chinese":"太好了，約翰遜大夫本週星期五下午有空。"},{"english":"'How fantastic to be up above ground again, ' said a 27-r-old survivor who was brought up.","chinese":"一名被救出的27歲倖存者說，能再回到地上太好了。"},{"english":"It's so GREat to see sunshine again after those rainy days.","chinese":"舊雨之後再見到陽光，真是太好了。"},{"english":"That's terrific. I'm really lucky you were here! How can I thank you?","chinese":"太好了，我真幸運遇到你，我該怎麼謝你呢？"},{"english":"That would be nice. Could you also get me a pillow and blanket please?","chinese":"太好了。能請你給我一個枕頭和毯子嗎？"},{"english":"I'm really glad we painted the room this color.","chinese":"我們把房間刷成這個顏色真是太好了。"},{"english":"Sichuan Restaurant is the best restaurant of Sichuan style in Beijing.","chinese":"太好了，四川飯店是北京最好的川菜館。"}],"related":[]}