{"definition":["pincer attack\/attack from two or more sides\/converging attack\/attack on a flank\/fork in chess, with one piece making two attacks"],"pinyin":["jia1 ji1"],"simplified":["夹击"],"rank":18251.0,"normalized_rank":0.25535516908482925,"fraction":0.000002865248860046005,"cumulative_fraction":0.9702506638309542,"word":"夾擊","characters":[{"definition":["Taiwan pr. used in 夾生|夹生[jia1 sheng1] and 夾竹桃|夹竹桃[jia1 zhu2 tao2]","double-layered\/lined (garment)","to press from either side\/to place in between\/to sandwich\/to carry sth under armpit\/wedged between\/between\/to intersperse\/to mix\/to mingle\/clip\/folder\/Taiwan pr. [jia2]"],"pinyin":["jia1","jia2","jia4"],"word":"夾"},{"definition":["to hit\/to strike\/to break\/Taiwan pr. [ji2]"],"pinyin":["ji1"],"word":"擊"}],"containing_words":[],"sentences":[{"english":"Japan also took the opportunity to \"go south\" on the implementation of China's \"attack\" strategy.","chinese":"而日本也藉機“南進”對中國實施“夾擊”策略。"},{"english":"Os acromiale is a rare predisposing factor of shoulder impingement syndrome.","chinese":"肩峯小骨是引起肩夾擊症候羣的罕見原因。"},{"english":"Shoulder impingement syndrome is one of the most common painful shoulder disorders.","chinese":"肩夾擊症候羣是一種常見的疼痛性肩關節疾病。"},{"english":"The Chinese film surviving in the hardship is eager to get out of the plight.","chinese":"內外夾擊中艱難生存的中國電影渴盼着走出困境。"},{"english":"It can serve as an inexpensive flanker that's more durable than a Deathjump Spider or a Mephit.","chinese":"牠可以擔任廉價的夾擊者，比死躍蜘蛛及魔蝠更耐用。"},{"english":"Between the attack of the past and the attack of the future, the establishment of July struggled.","chinese":"七月政權在來自過去和來自未來的兩面夾擊中掙扎。"},{"english":"If not, teams send quick double-team traps to get the ball out of Bryant's hands.","chinese":"或者他們會用快速夾擊來從科比的手上把球斷下。"},{"english":"To sandwich Parkistan, right.","chinese":"想夾擊巴基斯，是的。"},{"english":"Crushed between two armies, the remaining Dark Iron forces were utterly destroyed.","chinese":"剩餘的黑鐵部族部隊被兩面夾擊，全軍覆沒。"}],"related":[{"definition":["could happen at any moment\/on the verge"],"pinyin":["yi1 chu4 ji2 fa1"],"word":"一觸即發"},{"definition":["to oppose each other with equal harshness (idiom); tit for tat\/measure for measure"],"pinyin":["zhen1 feng1 xiang1 dui4"],"word":"針鋒相對"},{"definition":["utterly defeated\/routed\/crushed\/to collapse (of army)"],"pinyin":["kui4 bai4"],"word":"潰敗"},{"definition":["to inflict heavy losses\/to inflict serious damage"],"pinyin":["zhong4 chuang1"],"word":"重創"},{"definition":["to marginalize\/marginalization"],"pinyin":["bian1 yuan2 hua4"],"word":"邊緣化"},{"definition":["arrogance\/haughtiness"],"pinyin":["qi4 yan4"],"word":"氣焰"},{"definition":["axle\/(fig.) central element\/key element\/axis (alliance of nations)"],"pinyin":["zhou2 xin1"],"word":"軸心"},{"definition":["to conspire\/to plot (a rebellion, crime etc)\/to machinate\/to spur on\/to urge action"],"pinyin":["ce4 dong4"],"word":"策動"},{"definition":["to break up into components\/to disintegrate\/to collapse\/to crumble"],"pinyin":["jie3 ti3"],"word":"解體"},{"definition":["to intensify\/to sharpen\/to accelerate\/to aggravate\/to exacerbate\/to embitter"],"pinyin":["jia1 ju4"],"word":"加劇"},{"definition":["military operation"],"pinyin":["jun1 shi4 xing2 dong4"],"word":"軍事行動"},{"definition":["to control\/to curb\/to restrict\/to impede\/to pin down (enemy troops)"],"pinyin":["qian1 zhi4"],"word":"牽制"},{"definition":["to turn white-hot\/to intensify\/to reach a climax"],"pinyin":["bai2 re4 hua4"],"word":"白熱化"},{"definition":["to glare like a tiger watching his prey (idiom)\/to eye covetously"],"pinyin":["hu3 shi4 dan1 dan1"],"word":"虎視眈眈"},{"definition":["(of a pendulum) to stop swinging\/(of work, production, activities etc) to come to a halt\/to be suspended\/to be canceled\/shutdown\/(sports) lockout"],"pinyin":["ting2 bai3"],"word":"停擺"},{"definition":["lit. with swords drawn and bows bent (idiom); fig. a state of mutual hostility\/at daggers drawn"],"pinyin":["jian4 ba2 nu3 zhang1"],"word":"劍拔弩張"}]}