{"definition":["tongs"],"pinyin":["jia1 qian2"],"simplified":["夹钳"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"夾鉗","characters":[{"definition":["Taiwan pr. used in 夾生|夹生[jia1 sheng1] and 夾竹桃|夹竹桃[jia1 zhu2 tao2]","double-layered\/lined (garment)","to press from either side\/to place in between\/to sandwich\/to carry sth under armpit\/wedged between\/between\/to intersperse\/to mix\/to mingle\/clip\/folder\/Taiwan pr. [jia2]"],"pinyin":["jia1","jia2","jia4"],"word":"夾"},{"definition":["pincers\/pliers\/tongs\/claw (of animal)\/to grasp with pincers\/to pinch\/to clamp\/to restrain\/to restrict\/to gag"],"pinyin":["qian2"],"word":"鉗"}],"containing_words":[],"sentences":[{"english":"Secure all work with clamps or a vise, freeing both hands to operate tools.","chinese":"使用夾鉗或虎鉗固定工件，以便空出雙手來操作工具。"},{"english":"Bottom mount, self closing, with flange and clamp.","chinese":"底部放置，自動關閉，帶緣邊及夾鉗。"},{"english":"The clamping device of soaking-pit crane.","chinese":"夾鉗起重機的開閉機構。"},{"english":"He checked that clamp but failed to find anything wrong.","chinese":"他查看了那隻夾鉗，但是沒發現任何問題。"},{"english":"This is a crane-type horizontal plate clamp parts PDQ.","chinese":"這是起重機的配件PDQ型水平鋼板夾鉗。"},{"english":"The clamps shape need as that of crucible, Avoiding the concertrate stress destruction the crucible.","chinese":"坩堝夾鉗應與坩堝形狀相符，避免局部受力損壞。"},{"english":"God is a Lobster, or a double pincer, a double bind.","chinese":"上帝是大龍蝦，有一對鰲鉗或一對夾鉗。"},{"english":"Sturdy metal tongs measuring about 15 inches long are like having an extra set of heatproof hands.","chinese":"金屬夾鉗約有15英寸長，附有耐熱手柄。"},{"english":"Dual-action stainless swivel clamps can move many direction up and down.","chinese":"雙套不鏽鋼夾鉗，可上下多方向移動。"},{"english":"The Rotation Control Box of soaking-pit crane.","chinese":"夾鉗起重機的旋轉控制箱。"},{"english":"Microgripper technique was one of important parts in micromachine techniques.","chinese":"微夾鉗技術是微機械技術的重要內容之一。"},{"english":"This machine is a horizontal plate clamp PDQ.","chinese":"這種機器是PDQ型水平鋼板夾鉗。"},{"english":"The Auxiliary Hoist (Lifting Mechanisms) of soaking-pit crane.","chinese":"夾鉗起重機的副起升機構。"}],"related":[]}