{"definition":["overlapping\/nesting\/to interleave"],"pinyin":["tao4 die2"],"simplified":["套叠"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"套疊","characters":[{"definition":["to cover\/to encase\/cover\/sheath\/to overlap\/to interleave\/to model after\/to copy\/formula\/harness\/loop of rope\/(fig.) to fish for\/to obtain slyly\/classifier for sets, collections\/bend (of a river or mountain range, in place names)\/tau (Greek letter Ττ)"],"pinyin":["tao4"],"word":"套"},{"definition":["to fold\/to fold over in layers\/to furl\/to layer\/to pile up\/to repeat\/to duplicate"],"pinyin":["die2"],"word":"疊"}],"containing_words":[{"definition":["intussusception (medicine)"],"pinyin":["chang2 tao4 die2"],"word":"腸套疊"}],"sentences":[{"english":"Conclusion Air enema is the best methods in treat and diagnose infant intussusception.","chinese":"結論空氣灌腸是診斷與治療小兒腸套疊的最好方法。"},{"english":"Objective To approach ultrasonic diagnosis and treatment of children's intussusception.","chinese":"目的探討小兒腸套疊的超聲診斷及治療。"},{"english":"Chronic intussusception is defined as intussusception lasting for 14 days or more.","chinese":"慢性腸套疉是指腸套疊持續存在超過14天。"},{"english":"Objective To discuss the characteristics of secondary intussusceptions on ultrasonography.","chinese":"目的探討繼發性腸套疊的聲像圖特點。"},{"english":"Small bowel intussusception may require resection.","chinese":"小腸腸套疊需做腸切除術。"},{"english":"Researchers continued to study the link between vaccination and intussusception.","chinese":"於是，研究人員繼續探究疫苗接種與腸套疊的關係。"},{"english":"Upon opening the cecum, the invaginated appendix was recognized.","chinese":"打開盲腸即發現套疊的闌尾。"},{"english":"Methods A total of 302 cases with infant intussusception underwent high frequency ultrasound.","chinese":"方法對302例嬰幼兒腸套疊患兒進行高頻超聲檢查。"},{"english":"All cases were performed an operation of resection of necrotic intestine after reduction of intussusception.","chinese":"全組均行套疊復位加壞死腸段切除一期吻合術。"},{"english":"Objective To analyse different influential factors that treat pediatric intussusception with air enema.","chinese":"目的分析空氣灌腸治療小兒腸套疊的各種影響因素。"},{"english":"Small bowel intussusception may require resection .","chinese":"小腸腸套疊需做腸切除術。"},{"english":"Objective To study the feature and value of Color doppler flow imaging(CDFI) in childrens intussusception.","chinese":"目的探討彩色多普勒超聲對小兒腸套疊的診斷價值。"},{"english":"He had clinical and X-ray evidences of intussusception which were relieved by a barium enema.","chinese":"經鋇灌腸術X光攝影證明腸套疊並復原之一例。"},{"english":"Objective To evaluate the effect of anisodamine in the air reduction for child intussusception.","chinese":"目的探討山莨菪鹼在小兒腸套疊空氣整復中的作用。"},{"english":"Objective To investigate the pathogenesis, diagnosis and therapy of adult intussusception.","chinese":"目的探討腸套疊的發病機制及診斷和治療方法。"}],"related":[]}