{"definition":["sequence of movements in martial arts\/routine\/pattern\/standard method"],"pinyin":["tao4 lu4"],"simplified":["套路"],"rank":14263.0,"normalized_rank":0.1995578750017489,"fraction":0.000004508810960884499,"cumulative_fraction":0.9558432839978952,"word":"套路","characters":[{"definition":["to cover\/to encase\/cover\/sheath\/to overlap\/to interleave\/to model after\/to copy\/formula\/harness\/loop of rope\/(fig.) to fish for\/to obtain slyly\/classifier for sets, collections\/bend (of a river or mountain range, in place names)\/tau (Greek letter Ττ)"],"pinyin":["tao4"],"word":"套"},{"definition":["road\/CL:條|条[tiao2]\/journey\/route\/line (bus etc)\/sort\/kind","surname Lu"],"pinyin":["Lu4","lu4"],"word":"路"}],"containing_words":[],"sentences":[{"english":"Film-goers and television-watchers know and appreciate the format.","chinese":"看電影和電視的人都瞭解並且喜歡這個套路。"},{"english":"It is one kind of traditional long weapon routines in Eight Diagrams School.","chinese":"八卦滾手刀是八卦掌門傳統長兵器套路之一。"},{"english":"Do Katas Help You Defend Yourself or Improve Fighting Skills?","chinese":"套路有助於自衛還是能改善戰鬥技能？"},{"english":"The grampian no, completely is Hollywood like routines.","chinese":"歷史的厚重感沒有，完全是好萊塢似的套路。"},{"english":"The reform of having the Chinese meals in a western way, is only emphasizing in the aspects of health and sanitation.","chinese":"中餐西喫的改革，也只是按體學套路從衛生角度着力。"},{"english":"The most essential charm of Wushu is the consistency of Wushu and Dance.","chinese":"舞與武的一體性，是武術套路最根本的魅力所在。"},{"english":"Chum Kiu is a middle rank routine of Wing Chun.","chinese":"尋橋是詠春拳的中級套路。"},{"english":"Practice attacking and defending. The whole routine is made up of thirteen steps.","chinese":"整個套路十三步由十三個搖法的動作組成。"},{"english":"Stott Pilates uses the neutral spine position in exercise routines.","chinese":"斯托特普拉提練習套路中使用中立的立場脊柱。"},{"english":"The Chinese shadow boxing is the universal, popularized set pattern after the validation of national Wushu authority.","chinese":"此拳術是經過國家武術權威機構審定的普及推廣套路。"},{"english":"Did you practice this at training?","chinese":"你們在訓練中練過這個套路嗎？"},{"english":"The interview topic was on skill sets for academic success.","chinese":"這次的採訪內容是關於取得學術性成功的技巧套路。"},{"english":"Example of Value of Degree of Difficulty of Changquan.","chinese":"第二套國際武術競賽套路長拳難度分值個案。"},{"english":"This is the way science welcomes newcomers.","chinese":"這就是科學迎接新人的套路。"},{"english":"Shao-lin unique er-zhi-zen is the representative of hawk's claw.","chinese":"少林絕技二指禪是少林鷹派武術的代表性套路。"},{"english":"Some suggestions are offered to apply this method to the teaching of other carte and tierce repertoire extensively.","chinese":"綜合教學法也適用於其它劍術套路的教學。"}],"related":[{"definition":["trick\/deceit"],"pinyin":["pian4 shu4"],"word":"騙術"},{"definition":["fancy"],"pinyin":["hua1 shi4"],"word":"花式"},{"definition":["well-tried\/time-tested"],"pinyin":["lu:3 shi4 bu4 shuang3"],"word":"屢試不爽"},{"definition":["social connections\/stratagem\/method\/approach\/movement (martial arts)\/(sb's) background story"],"pinyin":["lu4 shu4"],"word":"路數"},{"definition":["hackneyed\/well-worn (phrase etc)\/same old story\/stereotypical fashion"],"pinyin":["lao3 tao4"],"word":"老套"},{"definition":["item (on a program)"],"pinyin":["xi4 ma3"],"word":"戲碼"},{"definition":["move (in chess, on stage, in martial arts)\/gambit\/trick\/scheme\/movement\/same as 著數|着数[zhao1 shu4]"],"pinyin":["zhao1 shu4"],"word":"招數"},{"definition":["skill\/technique"],"pinyin":["ji4 qiao3"],"word":"技巧"},{"definition":["many superficial changes but no departure from the original stand (idiom); plus ça change, plus ça reste la mème chose"],"pinyin":["wan4 bian4 bu4 li2 qi2 zong1"],"word":"萬變不離其宗"},{"definition":["(coll.) to flirt\/to hit on girls"],"pinyin":["liao2 mei4"],"word":"撩妹"},{"definition":["different broth but the same old medicine (idiom); a change in name only\/a change in form but not in substance"],"pinyin":["huan4 tang1 bu4 huan4 yao4"],"word":"換湯不換藥"},{"definition":["the same old stuff"],"pinyin":["lao3 yi1 tao4"],"word":"老一套"},{"definition":["acrobatics\/jugglery\/cheap trick\/game"],"pinyin":["ba3 xi4"],"word":"把戲"},{"definition":["to counter every move\/to be full of tricks"],"pinyin":["jian1 zhao1 chai1 zhao1"],"word":"見招拆招"},{"definition":["(Tw) unoriginal\/hackneyed\/(of a joke) old"],"pinyin":["lao3 geng3"],"word":"老梗"},{"definition":["item of storytelling or performed dialogue (folk arts)\/sketch"],"pinyin":["duan4 zi5"],"word":"段子"}]}