{"definition":["to take (after a struggle)\/to wrest\/to seize\/to capture\/to win (a trophy)"],"pinyin":["duo2 de2"],"simplified":["夺得"],"rank":2721.0,"normalized_rank":0.03807032026079778,"fraction":0.000053971870046781605,"cumulative_fraction":0.776506634528476,"word":"奪得","characters":[{"definition":["to seize\/to take away forcibly\/to wrest control of\/to compete or strive for\/to force one's way through\/to leave out\/to lose"],"pinyin":["duo2"],"word":"奪"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[],"sentences":[{"english":"The Hong Kong team also won a bronze medal in the water ski team event.","chinese":"香港隊在滑水隊際賽中同時亦奪得一面銅牌。"},{"english":"The victory was scored one day after China edged out Singapore to win the womens team title.","chinese":"一天前，中國隊擊敗新加坡隊奪得女團冠軍。"},{"english":"They were determined to win the seat back from Labor.","chinese":"他們決心從工黨手裏重新奪得這個議席。"},{"english":"China's world champion Xiao Qin won the pommel horse gold medal.","chinese":"中國的世界冠軍肖欽奪得鞍馬金牌。"},{"english":"Finally, Zhu Pingkang won the first prize in the styling contest of motorboats with a score of 4297.","chinese":"最終，朱平康以4297分奪得摩托艇花樣賽一等獎。"},{"english":"I wonder if China or America will win most medals.","chinese":"我在猜想是中國還是美國會奪得最多的金牌。"},{"english":"Lin Dan won the championship in a stunning turnaround.","chinese":"林丹驚天逆轉奪得冠軍。"},{"english":"Luna out shoot all the other rivals and won the gold medal.","chinese":"陶路娜戰勝了所有其他對手，奪得了金牌。"},{"english":"Run the water until it gets hot.","chinese":"克拉姆在賽跑中成績突出奪得金牌。"},{"english":"Congratulations on winning 2009 Taipei Golden Horse for Best Supporting Actress.","chinese":"恭喜紅姐姐，奪得2009金馬獎最佳女配角。"},{"english":"Jose Mourinho is not expecting Chelsea to stroll to another Premiership title.","chinese":"穆帥預測本賽季要奪得英超冠軍也不輕鬆。"},{"english":"Finally, Zhu Pingkang, with a score of 4297, won the first prize in the synchronized motorboat racing.","chinese":"最終，朱平康以4297分奪得摩托艇花樣賽一等獎。"},{"english":"Tao Luna out shoot all the other rivals and won the gold medal.","chinese":"陶路娜戰勝了所有其他對手，奪得了金牌。"},{"english":"He has had all-round success in his study this term.","chinese":"他這學期的學習成績奪得了滿堂紅。"},{"english":"He has already been the champion of the boat race three times.","chinese":"他已經奪得過三次賽船大會的冠軍了。"},{"english":"Mid-2001 exam, our school won the urban areas, students sail Kaozhuang Yuan.","chinese":"2001年中考，我校揚帆同學奪得了市區中考狀元。"}],"related":[]}