{"definition":["to snatch away"],"pinyin":["duo2 zou3"],"simplified":["夺走"],"rank":14681.0,"normalized_rank":0.2054062373203867,"fraction":0.000004299479043964488,"cumulative_fraction":0.9576857035370158,"word":"奪走","characters":[{"definition":["to seize\/to take away forcibly\/to wrest control of\/to compete or strive for\/to force one's way through\/to leave out\/to lose"],"pinyin":["duo2"],"word":"奪"},{"definition":["to walk\/to go\/to run\/to move (of vehicle)\/to visit\/to leave\/to go away\/to die (euph.)\/from\/through\/away (in compound verbs, such as 撤走[che4 zou3])\/to change (shape, form, meaning)"],"pinyin":["zou3"],"word":"走"}],"containing_words":[],"sentences":[{"english":"Mordo takes his power and says there's too many sorcerers in the world.","chinese":"莫度奪走了潘伯恩的法力，說世界上的魔法師太多了。"},{"english":"Komodo dragon, by the way, why does man have to take him all away?","chinese":"順便說說，科莫多龍。爲什麼人們都要奪走你的生命？"},{"english":"Experts estimate that the high-speed railway will take 30 percent of passengers from airlines.","chinese":"專家預計，高鐵將會奪走航空市場30%的客源。"},{"english":"A German grenade had taken three fingers off his left hand.","chinese":"德國人的手榴彈奪走了他左手的三根手指。"},{"english":"It cannot be taken from you, not by angels or by demons, heaven or hell.","chinese":"天使或魔鬼，天堂或地域都無法從你這裏奪走它。"},{"english":"He was carried away by the plague.","chinese":"瘟疫奪走了他的生命。"},{"english":"In 2005 the disease killed 2.1m people.","chinese":"2005年，艾滋病奪走210萬人的生命。"},{"english":"Growth is a cruel plunder, rob to naive, take pure.","chinese":"成長是一場殘忍的掠奪，搶去天真，奪走單純。"},{"english":"Cancer takes many lives.","chinese":"癌症奪走了許多人的生命。"},{"english":"Tell me, who makes me miss him every night?","chinese":"是誰奪走了我一夜夜的思念？"},{"english":"HuJi and don't want to kill him, she hated the ghost killed when my heart.","chinese":"胡姬並不想殺死問天，她恨時幽冥奪走了本人的心。"},{"english":"The thief despoiled the old man of his belongings.","chinese":"賊奪走了那老人的財物。"},{"english":"But the concrete that covered him would not, could not kill him.","chinese":"但是壓在他身上的鋼筋混凝土不會奪走他的生命。"},{"english":"Howell was in misery. She’d robbed him of whatever little thunder he had left.","chinese":"豪厄爾痛苦地聽着，她把他所剩不多的光芒都奪走了。"},{"english":"A great divide but this man held my gaze across the distance.","chinese":"人羣分割了我們，但那個男人奪走了我的凝望。"},{"english":"The man would probably seize him by the wrist and take the razor away.","chinese":"那人很可能會抓住他的手腕，把刮鬍刀奪走。"}],"related":[]}