{"definition":["crafty and evil"],"pinyin":["jian1 e4"],"simplified":["奸恶"],"rank":63824.0,"normalized_rank":0.8929805660878933,"fraction":2.08748006412563e-8,"cumulative_fraction":0.999931953113156,"word":"奸惡","characters":[{"definition":["wicked\/crafty\/traitor\/variant of 姦|奸[jian1]"],"pinyin":["jian1"],"word":"奸"},{"definition":["evil\/fierce\/vicious\/ugly\/coarse\/to harm","see 惡心|恶心[e3 xin1]","to hate\/to loathe\/ashamed\/to fear\/to slander"],"pinyin":["e3","e4","wu4"],"word":"惡"}],"containing_words":[],"sentences":[{"english":"Like a coating of glaze over earthenware are fervent lips with an evil heart.","chinese":"火熱的嘴，奸惡的心，好像銀渣包的瓦器。"},{"english":"If a ruler hearken to lies, all his servants are wicked.","chinese":"君王若聽謊言，他一切臣僕都是奸惡。"},{"english":"In whose hands is mischief, and their right hand is full of bribes.","chinese":"他們的手中有奸惡，右手滿有賄賂。"},{"english":"Woe to them that devise iniquity, and work evil upon their beds!","chinese":"禍哉，那些在牀上圖謀罪孽，造作奸惡的。"},{"english":"I look on the faithless with loathing, for they do not obey your word.","chinese":"我看見奸惡的人，就甚憎惡，因爲他們不遵守你的話。"},{"english":"If a ruler listens to lies, all his officials become wicked.","chinese":"君王若聽謊言，他一切臣僕都是奸惡。"},{"english":"Scoundrels concoct evil, and their speech is like a scorching fire.","chinese":"匪徒圖謀奸惡，嘴上彷彿有燒焦的火。"},{"english":"Which imagine mischiefs in their heart; continually are they gathered together for war.","chinese":"他們心中圖謀奸惡，常常聚集要爭戰。"},{"english":"An ungodly man diggeth up evil: and in his lips there is as a burning fire.","chinese":"匪徒圖謀奸惡，嘴上彷佛有燒焦的火。"},{"english":"I beheld the transgressors, and was grieved; because they kept not thy word.","chinese":"我看見奸惡的人，就甚憎惡，因爲他們不遵守你的話。"},{"english":"He looked upon Cowperwood now as a dark and dangerous man.","chinese":"現在他認爲柯帕烏是奸惡而危險的人物。"},{"english":"10in whose hands are wicked schemes, whose right hands are full of bribes.","chinese":"他們的手中有奸惡，右手滿有賄賂。"},{"english":"No misfortune is seen in Jacob, no misery observed in Israel.","chinese":"他未見雅各中有罪孽，也未見以色列中有奸惡。"},{"english":"If a ruler hearken to lies, all his servants [are] wicked.","chinese":"君王若聽謊言，他一切臣僕都是奸惡。"}],"related":[]}