{"definition":["good or bad\/good and bad\/standard\/quality"],"pinyin":["hao3 huai4"],"simplified":["好坏"],"rank":9790.0,"normalized_rank":0.13697480167335918,"fraction":0.00000853356011109483,"cumulative_fraction":0.9279340044281305,"word":"好壞","characters":[{"definition":["good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello","to be fond of\/to have a tendency to\/to be prone to"],"pinyin":["hao3","hao4"],"word":"好"},{"definition":["bad\/spoiled\/broken\/to break down\/(suffix) to the utmost"],"pinyin":["huai4"],"word":"壞"}],"containing_words":[],"sentences":[{"english":"We must persist in study on for good or for evil.","chinese":"無論好壞，我們都要堅持學完。"},{"english":"Whether we will go picnicking tomorrow depends on the weather.","chinese":"明天我們是否去野餐取決於天氣好壞。"},{"english":"Results sometimes you study the performance of the test.","chinese":"成績有時候是對你學習的好壞的檢驗。"},{"english":"I ordered the best wine on the menu, regardless of price or taste.","chinese":"我叫了菜單上最好的甜酒，不管價錢多少，味道好壞。"},{"english":"And dismantle the stand or fall of a contact and the perhaps sex is great.","chinese":"而拆搭的好壞與和出的或許性聯絡甚大。"},{"english":"Environment had a great effect in locusts extermination.","chinese":"社會環境的好壞對滅蝗效果有很大影響。"},{"english":"Rewards and penalties, promotions and demotions should be based on work performance.","chinese":"要根據工作成績的大孝好壞，有賞有罰，有升有降。"},{"english":"The design of impeller meridional shape influences directly efficiency of centrifugal pumps.","chinese":"葉輪軸面圖設計的好壞直接影響離心泵的效率。"},{"english":"It has already been stated that prognostically the important factor is the histological type of cell.","chinese":"已經說明，預後好壞的主要因素是細胞的組織類型。"},{"english":"The magnetic entropy changes were the benchmark for the application of the magnetocaloric materials.","chinese":"磁熵變化值是衡量磁製冷材料好壞的一項重要指標。"},{"english":"The quality of assembled spectacles directly influences the health of wearers.","chinese":"配裝眼鏡質量的好壞直接影響眼鏡配戴者的健康。"},{"english":"Whether a planet is in good or bad state, it will realize the affairs of the house.","chinese":"行星態勢的好壞，會影響到其落入宮位所代表的領域。"},{"english":"These pictures are collected without choice.","chinese":"這些畫是不分好壞蒐集來的。"},{"english":"The only judge of how good your product is is how much your users use it.","chinese":"對你的產品好壞的唯一判定來自於有多少用戶使用它。"},{"english":"But the quality of cross-section affects the rate of returning green direct.","chinese":"然而平茬斷面質量的好壞，直接影響檸條的返青率。"},{"english":"Design work fit and unfits quality direct influence entire engineering project quality.","chinese":"設計工作的優劣直接影響整個工程項目的好壞。"}],"related":[{"definition":["whether or not (at the end of a phrase)"],"pinyin":["yu3 fou3"],"word":"與否"},{"definition":["good and bad\/merits and drawbacks"],"pinyin":["you1 lie4"],"word":"優劣"},{"definition":["to judge\/to determine\/judgment"],"pinyin":["pan4 duan4"],"word":"判斷"},{"definition":["unrelated\/having nothing to do (with sth else)"],"pinyin":["wu2 guan1"],"word":"無關"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"畢竟"},{"definition":["moreover\/besides\/in addition\/furthermore"],"pinyin":["kuang4 qie3"],"word":"況且"},{"definition":["subjective"],"pinyin":["zhu3 guan1"],"word":"主觀"},{"definition":["absolute\/unconditional"],"pinyin":["jue2 dui4"],"word":"絕對"},{"definition":["to depend upon\/to hinge upon"],"pinyin":["qu3 jue2"],"word":"取決"},{"definition":["in a word\/in short\/in brief"],"pinyin":["zong3 zhi1"],"word":"總之"},{"definition":["crucial point\/crux\/CL:個|个[ge4]\/key\/crucial\/pivotal"],"pinyin":["guan1 jian4"],"word":"關鍵"},{"definition":["no matter what or how\/regardless of whether..."],"pinyin":["wu2 lun4"],"word":"無論"},{"definition":["to judge (a competition)\/to appraise"],"pinyin":["ping2 pan4"],"word":"評判"},{"definition":["whatever\/no matter what (who, how etc)\/regardless of\/not to discuss"],"pinyin":["bu4 lun4"],"word":"不論"},{"definition":["relation\/relationship\/to concern\/to affect\/to have to do with\/guanxi\/CL:個|个[ge4]"],"pinyin":["guan1 xi5"],"word":"關係"},{"definition":["only\/merely\/nothing but\/no more than\/it's just that ..."],"pinyin":["zhi3 bu5 guo4"],"word":"只不過"}]}