{"definition":["several years"],"pinyin":["hao3 ji3 nian2"],"simplified":["好几年"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"好幾年","characters":[{"definition":["good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello","to be fond of\/to have a tendency to\/to be prone to"],"pinyin":["hao3","hao4"],"word":"好"},{"definition":["almost","how much\/how many\/several\/a few"],"pinyin":["ji1","ji3"],"word":"幾"},{"definition":["surname Nian","year\/CL:個|个[ge4]"],"pinyin":["Nian2","nian2"],"word":"年"}],"containing_words":[],"sentences":[{"english":"It is years since I enjoyed myself so much.","chinese":"我好幾年沒玩得這樣痛快了。"},{"english":"Ali was the cock of the walk for many years in boxing circles .","chinese":"阿里在拳擊圈裏當了好幾年的頭號人物。"},{"english":"Work on bioartificial liver devices has been under way for several years.","chinese":"生物人工肝裝置的研究工作已經進行了好幾年。"},{"english":"The house was unoccupied for several years and went to rack and ruin.","chinese":"這所房子因爲好幾年沒有住人而荒廢了。"},{"english":"Jim: Bob, I have never walked such a long distance for several years.","chinese":"鮑勃，我已經好幾年沒走過這麼長的一段路程了。"},{"english":"He has coveted after the chairmanship for years.","chinese":"他覦議長職位好幾年了。"},{"english":"She's all thumbs, I'm afriad it's going to take her years to finish a sweater.","chinese":"她手腳好笨哪，恐怕要好幾年才能織完一件毛衣。"},{"english":"CORRESPOND】Janet and Bob corresponded for many years before they met.","chinese":"珍妮特和鮑伯在見面前已通了好幾年信。"},{"english":"Dress code challenges like these have been cropping up for years.","chinese":"像這樣的着裝規範的問題已經出現好幾年了。"},{"english":"She said she was looking forward to the concours because she had not shown the car in years.","chinese":"她說她期待參加巡展，因爲她有好幾年沒秀這車了。"},{"english":"I used to be a playgirl.","chinese":"可是一個人喫飯好幾年了。"},{"english":"He wishes one day he could marry a fortune that can help him in his career.","chinese":"他夢想有一天能倒插豪門，這樣他能少奮鬥好幾年。"},{"english":"I haven't had this much fun with an open-world game in years.","chinese":"我好幾年沒有玩到這麼牛掰的開放世界遊戲了。"},{"english":"That's actually still a viable platform. We ran for years on FCGI.","chinese":"那也是一個可用的平臺，我們用了好幾年。"},{"english":"Years have been spent in compiling this volume.","chinese":"編輯本卷花了好幾年時間。"},{"english":"I have known him quite well for several years since he first came to work in our department.","chinese":"他一到本系工作，我就認識他，已經好幾年了。"}],"related":[]}