{"definition":["a good thing doesn't last forever (idiom)"],"pinyin":["hao3 jing3 bu4 chang2"],"simplified":["好景不长"],"rank":22553.0,"normalized_rank":0.31554573055559443,"fraction":0.0000018609227872359112,"cumulative_fraction":0.9802234456849408,"word":"好景不長","characters":[{"definition":["good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello","to be fond of\/to have a tendency to\/to be prone to"],"pinyin":["hao3","hao4"],"word":"好"},{"definition":["bright\/circumstance\/scenery","surname Jing"],"pinyin":["Jing3","jing3"],"word":"景"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance","length\/long\/forever\/always\/constantly"],"pinyin":["chang2","zhang3"],"word":"長"}],"containing_words":[],"sentences":[{"english":"But Tobey again stroke, good times don't last long, no chance of recovery.","chinese":"但好景不長，託比再度中風，再無康復的可能了。"},{"english":"When I entered high school I was an A-student, but not for long. I wanted the fancy clothes.","chinese":"我進中學的時候是一個好學生，只是好景不長。"},{"english":"The cooperation may not last.","chinese":"但這種合作或許好景不長。"},{"english":"But the short-lived, long before the Mongols to fight it because it needs horse.","chinese":"但是好景不長，沒過多久，因爲和蒙古人打仗需要馬。"},{"english":"The thing is that there is always someone with better or more than you.","chinese":"但是好景不長，比較的對象最後往往變成比你強的人。"},{"english":"It doesn’t look so good now. In the last three years, the news out of Nokia has only been bad.","chinese":"可惜好景不長，近三年諾基亞頻頻傳出負面消息。"},{"english":"Again, he runs into trouble within months.","chinese":"可是，好景不長，幾個月後，他再次陷入麻煩。"},{"english":"When I entered high school I was an A-student, but not for long.","chinese":"我還記得剛入中學時，我還是個優等生，但好景不長。"},{"english":"Messrs Erdogan and Lula may not have long to savour their achievements.","chinese":"愛爾多安和盧拉可能好景不長。"}],"related":[]}