{"definition":["to be happy\/to be in a good mood"],"pinyin":["hao3 qi4"],"simplified":["好气"],"rank":41536.0,"normalized_rank":0.5811425293467464,"fraction":3.3209910111089566e-7,"cumulative_fraction":0.9970378498774468,"word":"好氣","characters":[{"definition":["good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello","to be fond of\/to have a tendency to\/to be prone to"],"pinyin":["hao3","hao4"],"word":"好"},{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"}],"containing_words":[],"sentences":[{"english":"“Don't tease, Joe,”said Nancy shortly2.","chinese":"“喬，別打趣了，”南希沒好氣地說。"},{"english":"Under aerobic or anaerobic conditions, nitrates could be used as nitrogen sources.","chinese":"在好氣或厭氣條件下可以硝酸鹽爲氮源。"},{"english":"I ask him very nicely if he'd like a cup of tea.","chinese":"我好聲好氣問他要不要來杯茶。"},{"english":"That sort of thing makes me sick, \" he said roughly .\"","chinese":"“這種事叫我噁心，”他沒好氣地說。"},{"english":"According to McKittrick, He reamed us out but good.","chinese":"按照麥克凱特里克上尉的說法，他沒好氣地挖苦我們。"},{"english":"It is a facultative aerobe and the most suitable temperature for its growth is 30 ℃.","chinese":"該菌株的最適生長溫度爲30℃，好氣生長。"},{"english":"You guys aren’t even nice to your customers.","chinese":"你們對顧客根本都沒有好氣兒。"},{"english":"He was in bad mood, and showed no humor towards anyone.","chinese":"他這幾天心情不好，對人沒好氣兒。"},{"english":"\"I don't know how,\" I sulked.","chinese":"“我不知道該怎麼做，”我沒好氣地說。"},{"english":"Looking at his confused face, I felt annoyed.","chinese":"看到他迷惑不解的臉，我又好氣又好笑。"},{"english":"Some fungi as well as bacteria can denitrify under aerobic environment.","chinese":"有些真菌和細菌能在好氣條件下進行反硝化。"},{"english":"He tends to snap at people when he gets inpatient.","chinese":"他一不耐煩的時候就對人沒有好氣。"},{"english":"\"Fine, \" I snap. \"Just feeling a little unwanted. \"","chinese":"“好，”我沒好氣地說，“只是感覺有點不受歡迎。”"},{"english":"A charged gas that is completely closed ball can airtight.","chinese":"充好氣的球可以說是完全封閉不透氣的。"},{"english":"Usually I articulate the vocabulary into the sound I want it to be, which makes you partially angry, but funny also.","chinese":"常常把單字念成自己想要的發音，讓你又好氣又好笑。"},{"english":"Aunt Chloe set a chair for her in a manner decidedly gruff and crusty.","chinese":"克羅大娘沒好氣地替她搬了把椅子。"}],"related":[]}