{"definition":["(literary) like this\/such (as this)\/so much\/so many"],"pinyin":["ru2 xu3"],"simplified":["如许"],"rank":43429.0,"normalized_rank":0.6076280553495725,"fraction":2.782333567988427e-7,"cumulative_fraction":0.9976146937539544,"word":"如許","characters":[{"definition":["as\/as if\/such as"],"pinyin":["ru2"],"word":"如"},{"definition":["surname Xu","to allow\/to permit\/to promise\/to praise\/somewhat\/perhaps"],"pinyin":["Xu3","xu3"],"word":"許"}],"containing_words":[],"sentences":[{"english":"Shakespeare do thellos, hellos wife, blame, call names Shakespeare is more fiercer, crueler.","chinese":"莎士比亞如許做，老婆叱罵莎士比亞更厲害了。"},{"english":"To not follow the truly humane will bring immeasurable harm.","chinese":"要是不親熱有仁德的人，那將帶給咱們如許大的壞處。"},{"english":"I\"ve heard of some such rumors.\"","chinese":"本人聽到過一些如許的訛傳。"},{"english":"Only then, can the group soar high and overcome any difficulties.","chinese":"只有如許，一個組合才能降服重重堅苦，展翅高飛。"},{"english":"Any specks of dirt are washed out.","chinese":"通過如許每一小點髒工具就會被清洗掉。"},{"english":"I pretended to be asleep so mum wouldnt talk to me.","chinese":"我假裝睏覺如許我媽就不會絮聒了。"},{"english":"I know it's not necessary. I want to do it.","chinese":"我知道沒必要如許，可是我願付。"},{"english":"It came from the toad which the girl had cared for with such kindness.","chinese":"它來自小女孩蛤蟆賜顧幫襯如許地仁慈。"},{"english":"We don't like the rim. The rim should be ridged.","chinese":"我們不喜好如許的盤邊，盤邊必需是脊狀的。"},{"english":"It will save you much time when you go through the customs.","chinese":"如許可以讓您在過海關時省往良多時候。"},{"english":"To capture such greatness in a single photograph is not easy at all.","chinese":"要在一幅照片上捕捉到如許的絕景，實在遠非易事。"},{"english":"I don't think a hayseed like you could appreciate such a thing.","chinese":"我不覺得一個像你如許的鄉巴佬能觀賞這種東西。"},{"english":"No one but a fool would do such a thing.","chinese":"除了傻瓜外異國人願幹如許的事。"},{"english":"Flowers bloom and wither; melodies of the flute permeate the woods.","chinese":"就這樣，林外花謝如許，林裏青笛自生。"},{"english":"How do you remain so cool in such hot weather?","chinese":"你是怎樣在如許熱的天氣下連結涼快的？"},{"english":"Early on, I hated it.","chinese":"開初我討厭如許。"}],"related":[]}