{"definition":["excellent plan\/brilliant scheme"],"pinyin":["miao4 ji4"],"simplified":["妙计"],"rank":36889.0,"normalized_rank":0.516124970268493,"fraction":5.119435374047961e-7,"cumulative_fraction":0.995101299439216,"word":"妙計","characters":[{"definition":["clever\/wonderful"],"pinyin":["miao4"],"word":"妙"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"計"}],"containing_words":[{"definition":["brocade sack of miracle plans (idiom); bag of tricks\/fiendishly cunning masterplan (written out by strategic genius of fiction, and given to the local commander in a brocade bag)"],"pinyin":["jin3 nang2 miao4 ji4"],"word":"錦囊妙計"}],"sentences":[{"english":"To get myself to actually do, my favorite trick is the 50 minutes rule.","chinese":"努力讓自己上路，我的錦囊妙計是50分鐘法則。"},{"english":"Tom had an ace up his sleeve.","chinese":"湯姆備有錦囊妙計胸有成竹。"},{"english":"E Mao as a fan, a Miaoji mind.","chinese":"鵝毛扇這麼一扇，一個妙計湧上心頭。"},{"english":"My friend Collins, therefore, undertook to manage a little for me.","chinese":"因此，我的朋友高令斯就替我想了一個小小的妙計。"},{"english":"I have a coup, I wonder if we resist you hurt?","chinese":"我有一條妙計，不知你忍得住痛嗎？"},{"english":"But even smarter tactics might not be enough to regain lost ground.","chinese":"不過，也許即使是奇策妙計也不足以挽回損失。"},{"english":"And a group of researchers in Britain think they have found one.","chinese":"英國的一組研究人員認爲他們自有錦囊妙計。"},{"english":"She is always experimenting, always attempting the coup d’eclat.","chinese":"她總是樂於嘗試，總是試圖用妙計來取得成功。"},{"english":"Unless you've got an ace up your sleeve, we are dished.","chinese":"除非你有錦囊妙計，否則，我們是輸定了。"},{"english":"At last the old Fox thought up a way to catch the little Red Hen.","chinese":"終於，老狐狸想出了一條抓小紅母雞的妙計。"},{"english":"Unless you've had ace up your sleeve, we are dished.","chinese":"除非你有錦囊妙計，否則我們是輸定了。"},{"english":"JiTie mouth after listen to, and mind.","chinese":"齊鐵嘴聽後，便心生妙計。"},{"english":"It was at this moment that Mr. Budd had his Great Idea.","chinese":"就是在這一刻，巴德先生想出了他的妙計。"},{"english":"The Evening Messenger printed the full story of his Great Idea.","chinese":"《晚間信使報》刊登了他妙計的全部細節。"},{"english":"Oh, really? And what would that ace be exactly?","chinese":"嗯，我還真不信。那你的妙計是什麼啊？"},{"english":"He pastured with the flock, beguiling the shepherd by his artifice.","chinese":"他和羊羣混在一起喫草，用這個妙計騙過了牧羊人。"}],"related":[{"definition":["stratagem\/scheme"],"pinyin":["ji4 mou2"],"word":"計謀"},{"definition":["self-taught\/to learn without a teacher (idiom)"],"pinyin":["wu2 shi1 zi4 tong1"],"word":"無師自通"},{"definition":["to avoid the important and dwell on the trivial\/to keep silent about major charges while admitting minor ones"],"pinyin":["bi4 zhong4 jiu4 qing1"],"word":"避重就輕"},{"definition":["to set a trap"],"pinyin":["she4 ju2"],"word":"設局"},{"definition":["a bright idea suddenly occurs (idiom); to hit upon an inspiration\/to be struck by a brainwave"],"pinyin":["ling2 ji1 yi1 dong4"],"word":"靈機一動"},{"definition":["to raise money"],"pinyin":["chou2 qian2"],"word":"籌錢"},{"definition":["pragmatic\/flexible\/to act differently in different situations\/to accommodate to circumstances"],"pinyin":["bian4 tong1"],"word":"變通"},{"definition":["to spend (money or time)"],"pinyin":["po4 fei4"],"word":"破費"},{"definition":["a trick\/an ingenious method\/know-how\/the knack (of doing sth)"],"pinyin":["qiao4 men2"],"word":"竅門"},{"definition":["Jyutping, one of the many Cantonese romanization systems\/abbr. of 粵語拼音|粤语拼音[Yue4 yu3 Pin1 yin1]"],"pinyin":["Yue4 pin1"],"word":"粵拼"},{"definition":["to cross the sea by a trick (idiom)\/to achieve one's aim by underhanded means"],"pinyin":["man2 tian1 guo4 hai3"],"word":"瞞天過海"},{"definition":["to boast"],"pinyin":["kua1 kou3"],"word":"誇口"},{"definition":["When you enter a village, follow the local customs (idiom); do as the natives do\/When in Rome, do as the Romans do"],"pinyin":["ru4 xiang1 sui2 su2"],"word":"入鄉隨俗"},{"definition":["stratagem"],"pinyin":["ji4 ce4"],"word":"計策"},{"definition":["move (in chess, on stage, in martial arts)\/gambit\/trick\/scheme\/movement\/same as 著數|着数[zhao1 shu4]"],"pinyin":["zhao1 shu4"],"word":"招數"},{"definition":["(loanword) tip\/hint\/suggestion\/piece of advice"],"pinyin":["tie1 shi4"],"word":"貼士"}]}