{"definition":["ideal place\/suitable location\/merit\/advantage"],"pinyin":["miao4 chu4"],"simplified":["妙处"],"rank":37181.0,"normalized_rank":0.5202104291130917,"fraction":4.976377299723268e-7,"cumulative_fraction":0.9952487127560388,"word":"妙處","characters":[{"definition":["clever\/wonderful"],"pinyin":["miao4"],"word":"妙"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"I discovered the worth of super-slow reading years ago.","chinese":"幾年前我發現了超慢速閱讀的妙處。"},{"english":"The beauty of an elastic data grid is that it scales in a linear fashion.","chinese":"彈性數據網格的妙處在於它以線性方式伸縮。"},{"english":"Qinghui Garden is one of Guangdong's four famous classical gardens.","chinese":"清暉園爲廣東四大名園之一，園中有其獨到的妙處。"},{"english":"Nevertheless, the wonder of oleander is not confined to its toughness alone.","chinese":"但是夾竹桃的妙處還不止於此。"},{"english":"Green onion pancake that a large dry branded beauty that you can let cool and eat.","chinese":"這種幹烙蔥油餅有一大妙處，那就是可以放涼了喫。"},{"english":"The beauty of the approach is the ability to selectively include only the styles that you need.","chinese":"這種處理方法的妙處在於能分揀出你需要的樣式。"},{"english":"Every part shows the inventive mind of the owner.","chinese":"每一個角落均有其妙處，足見主人的匠心獨具。"},{"english":"He explained the beauty of the music to his wife but it was casting pearls before swine.","chinese":"他向她講解那音樂的妙處，可是這無異於對牛彈琴。"},{"english":"That is the beauty of being alone. For the moment, just let me indulge in this profusion of moonlight and lotus fragrance.","chinese":"這是獨處的妙處，我且受用這無邊的荷香月色好了。"},{"english":"Qinghui Garden is one of Guangdong's four famous classical gardens. The garden was designed ingeniously.","chinese":"清暉園爲廣東四大名園之一，園中有其獨到的妙處。"}],"related":[]}