{"definition":["starting point\/initial point"],"pinyin":["shi3 dian3"],"simplified":["始点"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"始點","characters":[{"definition":["to begin\/to start\/then\/only then"],"pinyin":["shi3"],"word":"始"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[],"sentences":[{"english":"First, the starting point of marketing is wet.","chinese":"第一，營銷的始點是溼的。"},{"english":"Uncover the starting and ending points and start filling in the blanks one at a time.","chinese":"找到起始點，然後開始填補空白。"},{"english":"Perhaps because self-organised criticality is the perfect starting point for many of the brain's functions.","chinese":"可能因爲自我組織臨界是許多腦功能的完美始點。"},{"english":"There is a hypermethylation sequential basis in the upstream region from the transcriptional start site of IRX1 gene.","chinese":"IRX1基因轉錄起始點上游存在高甲基化結構基礎。"},{"english":"“For us the starting point is always the science,” Dr. McGill said.","chinese":"“對我們來說，科學就是起始點，”麥克吉爾博士說。"},{"english":"You can use the template file as starting point.","chinese":"您可以使用模板文件作爲起始點。"},{"english":"The starting point of a development project is the requirements analysis phase.","chinese":"開發項目的起始點是需求分析階段。"},{"english":"Girtim, British artist, created watercolour with a modern meaning.","chinese":"具有現代意義的水彩畫，始點當首推英國畫家格爾丁。"},{"english":"Chaos is the starting point of matters in Universe.","chinese":"混沌在我們這個宇審中是物質進行的始點。"},{"english":"The water level \"resets\" to its starting point when the bucket tips and empties itself.","chinese":"當吊桶傾倒光的時候水位線“復位”至其起始點。"},{"english":"The user must keep the original points if they are needed.","chinese":"使用者必須保留原始點，如果有需要的話。"},{"english":"The starting point of the ray in world coordinates.","chinese":"在世界座標，射線的起始點。"},{"english":"Defines the starting point offset and number of segments.","chinese":"定義起始點偏移量和段數。"},{"english":"Specify the aiming point for the reflector start point.","chinese":"爲反射器始點指定瞄準點。"},{"english":"This special report will point to where it is beginning to surface.","chinese":"這一特殊報告將指出其浮出水面的起始點。"},{"english":"Alternately, you can commission a spiritualist at your home point to revive you for a minor experience point penalty.","chinese":"可以委託起始點的縛靈者復活，帶有少量經驗懲罰。"}],"related":[]}