{"definition":["to feel wronged\/to cause sb to feel wronged\/grievance"],"pinyin":["wei3 qu5"],"simplified":["委屈"],"rank":8235.0,"normalized_rank":0.11521833419613,"fraction":0.000011378810036260753,"cumulative_fraction":0.9125404804736172,"word":"委屈","characters":[{"definition":["same as 逶 in 逶迤 winding, curved","surname Wei","to entrust\/to cast aside\/to shift (blame etc)\/to accumulate\/roundabout\/winding\/dejected\/listless\/committee member\/council\/end\/actually\/certainly"],"pinyin":["Wei3","wei1","wei3"],"word":"委"},{"definition":["bent\/to feel wronged","surname Qu"],"pinyin":["Qu1","qu1"],"word":"屈"}],"containing_words":[{"definition":["to feel aggrieved"],"pinyin":["wei3 wei3 qu1 qu1"],"word":"委委屈屈"}],"sentences":[{"english":"Both sides feeled a sense of grievance.","chinese":"雙方都覺得自己很委屈。"},{"english":"Loves you truly the girl, is being wronged time always first thinks of you.","chinese":"真正愛你的女孩，在受委屈的時候總是第一個想到你。"},{"english":"You may feel angry at times in your caregiving .","chinese":"在幫助他人的過程中，有時你會感到委屈。"},{"english":"She acted out the role of a wronged lover to make him feel guilty.","chinese":"她裝出一副受委屈的情人的樣子，以讓他感到內疚。"},{"english":"This situation if you marry purple the number is wrong each other.","chinese":"這種情況之下如果再娶紫焉就委屈對方了。"},{"english":"He is so broad-minded that he never owns anger even when suffering wrong.","chinese":"他心胸非常豁達，即使他受了委屈，也從來不生氣。"},{"english":"She used to have servants: now she finds it a come-down to have to do the work herself.","chinese":"她過去僱有傭人，現在她得自己幹活，覺得很委屈。"},{"english":"In order not to violate the mother lives, Liu Naou deliberately wronged themselves, something the mother can be described as Shiko.","chinese":"爲了不違母命，劉吶鷗刻意委屈自己，事母可謂至孝。"},{"english":"It’s entirely possible to enjoy your life without spending so much of it bent over in submission.","chinese":"享受人生而不太委屈自己是完全有可能的。"},{"english":"I blubbered for a while venting my sadness.","chinese":"我大哭大鬧一場，狠狠地發泄我的委屈。"},{"english":"I collect the sad humiliation there.","chinese":"我把最心酸的委屈匯在那裏。"},{"english":"The paratroopers are changing into their gear in the barrack, but Perconte is feeling very chagrin.","chinese":"士兵們在營房裏換制服，但是普康迪覺得很委屈。"},{"english":"They share their grievances with each other and confront many subjects they’d long avoided.","chinese":"她們傾訴了各自的委屈以及長期以來一直迴避的東西。"},{"english":"Stirringly talking was really good, didn't need to discommode oneself again.","chinese":"痛快淋漓的講話真好，不需要再委屈自己了。"},{"english":"Squat down to touch his own shadow, sorry to let you wronged.","chinese":"蹲下來撫摸自己的影子，對不起讓你受委屈了。"},{"english":"When falling into conflict with others, we are always right while the counterpart is totally wrong.","chinese":"與人發生衝突時，錯的總是對方，受委屈的纔是自己。"}],"related":[{"definition":["sinuous\/devious\/full details of a story\/to stoop"],"pinyin":["wei3 qu1"],"word":"委曲"},{"definition":["to feel sad\/to feel unwell\/(of life) to be difficult"],"pinyin":["nan2 guo4"],"word":"難過"},{"definition":["to love dearly\/to feel sorry for sb\/to regret\/to grudge\/to be distressed"],"pinyin":["xin1 teng2"],"word":"心疼"},{"definition":["to complain\/to grumble (about)\/to reproach\/to blame"],"pinyin":["man2 yuan4"],"word":"埋怨"},{"definition":["to get angry\/to take offense\/angry\/vitality\/liveliness"],"pinyin":["sheng1 qi4"],"word":"生氣"},{"definition":["suffering\/misery\/pain (esp. psychological)"],"pinyin":["ku3 chu3"],"word":"苦楚"},{"definition":["to feel guilty\/to feel ashamed of oneself\/to be remorseful"],"pinyin":["kui4 jiu4"],"word":"愧疚"},{"definition":["sullen"],"pinyin":["bie1 qu1"],"word":"憋屈"},{"definition":["to grieve\/to be broken-hearted\/to feel deeply hurt"],"pinyin":["shang1 xin1"],"word":"傷心"},{"definition":["to be mistreated\/to be bullied"],"pinyin":["shou4 qi4"],"word":"受氣"},{"definition":["to feel unwell\/to suffer pain\/to be difficult to bear"],"pinyin":["nan2 shou4"],"word":"難受"},{"definition":["guilty conscience\/to feel a twinge of guilt"],"pinyin":["nei4 jiu4"],"word":"內疚"},{"definition":["depressed\/resentful\/discontented\/indignant\/perturbed"],"pinyin":["fen4 men4"],"word":"憤懣"},{"definition":["to submit to humiliation (idiom); to suffer in silence\/to swallow one's anger\/to grin and bear it"],"pinyin":["ren3 qi4 tun1 sheng1"],"word":"忍氣吞聲"},{"definition":["angry\/indignant\/wrath\/ire"],"pinyin":["fen4 nu4"],"word":"憤怒"},{"definition":["to feel sad"],"pinyin":["xin1 suan1"],"word":"心酸"}]}