{"definition":["to appoint"],"pinyin":["wei3 pai4"],"simplified":["委派"],"rank":15981.0,"normalized_rank":0.22359492395729852,"fraction":0.0000036815557494579284,"cumulative_fraction":0.9628701517989174,"word":"委派","characters":[{"definition":["same as 逶 in 逶迤 winding, curved","surname Wei","to entrust\/to cast aside\/to shift (blame etc)\/to accumulate\/roundabout\/winding\/dejected\/listless\/committee member\/council\/end\/actually\/certainly"],"pinyin":["Wei3","wei1","wei3"],"word":"委"},{"definition":["clique\/school\/group\/faction\/to dispatch\/to send\/to assign\/to appoint\/pi (Greek letter Ππ)\/the circular ratio pi = 3.1415926\/(loanword) pie"],"pinyin":["pai4"],"word":"派"}],"containing_words":[],"sentences":[{"english":"The Premier deputed the Foreign Minister to act as his deputy.","chinese":"總理委派外交部長作爲他的代表。"},{"english":"Finally, delegating logic often leads to a cleaner separation of concerns.","chinese":"最後，委派邏輯通常會得到更乾淨的關注點分離。"},{"english":"Norman and I were deputed for the unpleasant task.","chinese":"我和諾曼被委派去幹這件苦差事。"},{"english":"Paul had assigned Timothy to carry out special duties at the church in Ephesus.","chinese":"保羅曾委派提摩太在以弗所教會中承擔特別的事工。"},{"english":"Accounting centralized assessing system is one of the common practice of accounting designating system.","chinese":"會計集中核算制是會計委派制的一種常用方式。"},{"english":"We must appoint a new teacher at once to the mountain school.","chinese":"我們必須立即委派一名新教師到那山村小學去。"},{"english":"If the master goes down, another server is delegated as master.","chinese":"如果主進程停掉，則委派其他服務器作爲主進程。"},{"english":"The system of appointing accountants is an attempt to manage accountants in China.","chinese":"會計委派制是對會計人員管理體制進行的一種嘗試。"},{"english":"The master-administrator determines which roles are delegated to the sub-administrator.","chinese":"主管理員決定將那種角色委派給次級管理員。"},{"english":"So, company burning gas also won't accreditation or precatory.","chinese":"那麼，燃氣公司亦不會委派或委託的。"},{"english":"Li Hongzhang was appointed to approach the imperialists and sue for peace.","chinese":"李鴻章被委派向帝國主義求和。"},{"english":"Delegates can be used to define callback methods.","chinese":"委派可用於定義回呼方法。"},{"english":"I repair, then, fellow-citizens, to the post you have assigned me.","chinese":"各位公民，我即將擔當起你們委派給我的職務。"},{"english":"He was gazetted to a new regiment.","chinese":"委派他赴一新團任職。"},{"english":"Fishery officials have started sending instructors to schools.","chinese":"漁業官員已經開始委派指導員到學校。"},{"english":"This Agreement and all its provisions shall be binding upon and endure to the benefit of the successors and assigns of the respective parties hereto.","chinese":"本協議及有的條款對繼承人和委派的代表都有約束力。"}],"related":[{"definition":["to assign\/to appoint\/assignment"],"pinyin":["zhi3 pai4"],"word":"指派"},{"definition":["to appoint"],"pinyin":["wei3 ren4"],"word":"委任"},{"definition":["to set apart\/to assign sb to a job"],"pinyin":["pai4 ren4"],"word":"派任"},{"definition":["to appoint\/(job) appointment\/CL:紙|纸[zhi3]"],"pinyin":["ren4 ming4"],"word":"任命"},{"definition":["to dispatch (sb) in an official capacity\/to be posted (as an ambassador, foreign correspondent etc)"],"pinyin":["pai4 zhu4"],"word":"派駐"},{"definition":["to select\/to detail\/to set apart\/to appoint"],"pinyin":["xuan3 pai4"],"word":"選派"},{"definition":["to give orders"],"pinyin":["shou4 ming4"],"word":"授命"},{"definition":["to send (on a mission)\/to dispatch"],"pinyin":["pai4 qian3"],"word":"派遣"},{"definition":["to hold several jobs at once\/concurrent post\/working part-time"],"pinyin":["jian1 ren4"],"word":"兼任"},{"definition":["to act as a substitute\/to act on sb's behalf"],"pinyin":["dai4 xing2"],"word":"代行"},{"definition":["full powers\/total authority\/plenipotentiary powers"],"pinyin":["quan2 quan2"],"word":"全權"},{"definition":["ordained or appointed to a post\/to benefit from counsel"],"pinyin":["shou4 ming4"],"word":"受命"},{"definition":["a plenipotentiary (representative)"],"pinyin":["quan2 quan2 dai4 biao3"],"word":"全權代表"},{"definition":["special appointment\/special correspondent\/task force\/sb dispatched on a mission"],"pinyin":["te4 pai4"],"word":"特派"},{"definition":["to appoint and dismiss"],"pinyin":["ren4 mian3"],"word":"任免"},{"definition":["to fill a post\/to act as"],"pinyin":["chong1 ren4"],"word":"充任"}]}