{"definition":["gynecology"],"pinyin":["fu4 ke1"],"simplified":["妇科"],"rank":12840.0,"normalized_rank":0.17964825878303695,"fraction":0.000005459417267009401,"cumulative_fraction":0.9487780690421164,"word":"婦科","characters":[{"definition":["woman"],"pinyin":["fu4"],"word":"婦"},{"definition":["branch of study\/administrative section\/division\/field\/branch\/stage directions\/family (taxonomy)\/rules\/laws\/to mete out (punishment)\/to levy (taxes etc)\/to fine sb\/CL:個|个[ge4]"],"pinyin":["ke1"],"word":"科"}],"containing_words":[],"sentences":[{"english":"Objective To study the clinical diagnosis of B-mode ultrasound to gynecologic acute abdomen.","chinese":"目的探討B型超聲對婦科急腹症的臨牀診斷價值。"},{"english":"And has also created the condition for the gynecology department disease's production.","chinese":"而且也爲婦科疾病的產生創造了條件。"},{"english":"Methods 108 gynecological patients with chronic cervicitis were chosen.","chinese":"選擇108例患有慢性宮頸炎的婦科病患者。"},{"english":"FemaleBleb of recrudescent sex genital must make department of gynaecology check in order to divide cancer of husband palace neck.","chinese":"女性複發性生殖器皰疹須作婦科檢查以除外子宮頸癌。"},{"english":"We will provide routine gynecological examinations for rural women.","chinese":"在農村婦女中開展婦科疾病定期檢查。"},{"english":"Ovarian cancer is a common gynecologic malignancy that usually can not be detected at early stage.","chinese":"卵巢惡性腫瘤是婦科常見的腫瘤，早期不易發現。"},{"english":"Assuming that the spot is a gynecological disease breeds, usually there will be very leucorrhea.","chinese":"假設此斑是婦科病惹起的，一般會出現白帶十分。"},{"english":"Conclusion: B-mode ultrasonography has a significant value in diagnosing acute gynecologic abdominal disease.","chinese":"結論B型超聲對婦科急腹症有較高的診斷價值。"},{"english":"Can you help me? I have to see Professor Liu and she is a gynecologist.","chinese":"我需要找婦科的劉醫生看病，你能幫我嗎？"},{"english":"Accomplish sales goal for gynae consumptive material and consumer maintenance work fixed.","chinese":"完成公司規定婦科耗材的銷售任務及客戶維護工作。"},{"english":"Is disease of department of gynaecology gotten capricious ?","chinese":"婦科病一得就反覆無常嘛？"},{"english":"Women need regular checkups with their gynecologist.","chinese":"女人需要定時去看婦科醫生做檢查。"},{"english":"Methods Data of 196 patients with gynecological acute abdomen were retrospectively analyzed.","chinese":"方法對196例婦科急腹症患者進行回顧性研究。"},{"english":"Objective To establish a simple sensitive HPLC method for determining hesperidin in Fuke baibai tables.","chinese":"目的建立婦科白帶片中橙皮苷的含量測定方法。"},{"english":"A novel gynecological cleaning device belongs to the technical field of medical appliances.","chinese":"新型婦科清洗器，屬於醫療用具技術領域。"},{"english":"Female's Chloasma Faciei is frequent manifestation in clinica1.","chinese":"女性顏面部黃褐斑是婦科臨牀常見病症。"}],"related":[{"definition":["vaginal infection\/inflammation of the vulva or vagina\/colpitis"],"pinyin":["yin1 dao4 yan2"],"word":"陰道炎"},{"definition":["menstrual pain\/dysmenorrhea"],"pinyin":["tong4 jing1"],"word":"痛經"},{"definition":["fibroid tumor of the uterus\/hysteromyoma"],"pinyin":["zi3 gong1 ji1 liu2"],"word":"子宮肌瘤"},{"definition":["(TCM) interrogation, one of the four methods of diagnosis 四診|四诊[si4 zhen3]"],"pinyin":["wen4 zhen3"],"word":"問診"},{"definition":["leukorrhea"],"pinyin":["bai2 dai4"],"word":"白帶"},{"definition":["Western medicine\/a doctor trained in Western medicine"],"pinyin":["xi1 yi1"],"word":"西醫"},{"definition":["food therapy\/treatment via food (TCM)"],"pinyin":["shi2 liao2"],"word":"食療"},{"definition":["department of gynecology and obstetrics\/birth clinic"],"pinyin":["fu4 chan3 ke1"],"word":"婦產科"},{"definition":["to give or have an acupuncture treatment"],"pinyin":["zha1 zhen1"],"word":"扎針"},{"definition":["doctor\/CL:個|个[ge4],位[wei4],名[ming2]"],"pinyin":["yi1 sheng1"],"word":"醫生"},{"definition":["traditional Chinese medical science\/a doctor trained in Chinese medicine"],"pinyin":["Zhong1 yi1"],"word":"中醫"},{"definition":["to fester\/to suppurate\/to be infected"],"pinyin":["hua4 nong2"],"word":"化膿"},{"definition":["(traditional) Chinese medicine\/CL:服[fu4],種|种[zhong3]"],"pinyin":["Zhong1 yao4"],"word":"中藥"},{"definition":["needle\/pin\/injection\/stitch\/CL:根[gen1],支[zhi1]"],"pinyin":["zhen1"],"word":"針"},{"definition":["to examine or treat medically"],"pinyin":["zhen3"],"word":"診"},{"definition":["pregnant\/to have conceived\/gestation\/pregnancy"],"pinyin":["huai2 yun4"],"word":"懷孕"}]}