{"definition":["to keep one's word\/trustworthy"],"pinyin":["shou3 xin4 yong4"],"simplified":["守信用"],"rank":33643.0,"normalized_rank":0.4707092188658654,"fraction":6.817155174452232e-7,"cumulative_fraction":0.9931754307678576,"word":"守信用","characters":[{"definition":["to guard\/to defend\/to keep watch\/to abide by the law\/to observe (rules or ritual)\/nearby\/adjoining"],"pinyin":["shou3"],"word":"守"},{"definition":["letter\/mail\/CL:封[feng1]\/to trust\/to believe\/to profess faith in\/truthful\/confidence\/trust\/at will\/at random"],"pinyin":["xin4"],"word":"信"},{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"}],"containing_words":[],"sentences":[{"english":"I believe whatever he says, for he always keeps his word.","chinese":"無論他說什麼我都相信，因爲他一直都守信用。"},{"english":"How could you break your promise?","chinese":"你怎麼不守信用？"},{"english":"He accused them of bad faith.","chinese":"他指責他們不守信用。"},{"english":"I’m sure they’d prefer someone who keeps his word.","chinese":"我想他們寧願要一個守信用的人。"},{"english":"To change another words, a man who often breaks his promise will be repelled everywhere.","chinese":"換句話說，不守信用的人處處都會受到排擠。"},{"english":"I always keep my words.","chinese":"我一向很守信用的。"},{"english":"I think responsibility, staidness , honest, keep wokds is principle as a person.","chinese":"我認爲有責任心，認真，誠實，守信用是做人的原則。"},{"english":"He will surely finish the work in time as he is a man of his word.","chinese":"他一定會按時做完工作，因爲他是一個守信用的人。"},{"english":"It's our principle in business to honor the contract and keep our promise.","chinese":"“重合同，守信用”是我們經營的原則。"},{"english":"Thou wilt be faithful, little Charles?","chinese":"你會守信用麼，小查爾斯？"},{"english":"Appraised as a company \"strictly abide by contracts and with punctuality \" by Zhejiang Province People's Government.","chinese":"被省人民政府評爲“浙江省重合同守信用先進單位”。"},{"english":"Prof. Luo is a man of his word.","chinese":"羅教授時一個守信用的人。"},{"english":"Yes, but a demon of my word, I should hope.","chinese":"對，但卻是個守信用的惡魔，希望如此。"},{"english":"This was the second time he let us down. We won't trust him again.","chinese":"這是他第二次不守信用，我們不能再信賴他了。"},{"english":"Xinxiang Municipal Government awarded Henan Jinhe\" the contract and trustworthy enterprise \"and so on.","chinese":"新鄉市人民政府授予“重合同守信用企業”等。"},{"english":"He has promised to do it, only he does not keep his word.","chinese":"他已答應做那件事了，只是他不守信用。"}],"related":[]}