{"definition":["to preserve one's heritage\/to defend the accomplishments of previous generations\/to carry on the good work\/to keep one's business going"],"pinyin":["shou3 ye4"],"simplified":["守业"],"rank":43878.0,"normalized_rank":0.6139101478880137,"fraction":2.662631913961643e-7,"cumulative_fraction":0.9977368257894924,"word":"守業","characters":[{"definition":["to guard\/to defend\/to keep watch\/to abide by the law\/to observe (rules or ritual)\/nearby\/adjoining"],"pinyin":["shou3"],"word":"守"},{"definition":["line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already","surname Ye"],"pinyin":["Ye4","ye4"],"word":"業"}],"containing_words":[],"sentences":[{"english":"At this point of time, Hanwen arrives to arrest Shouye.","chinese":"這時漢文與偉民前來拘捕守業，衆人喫驚。"},{"english":"Why to Start a Startup in a Bad Economy?","chinese":"爲什麼在經濟安機外守業？"},{"english":"A startup now can be just a pair of 22 year old guys.","chinese":"現在一個22歲的年青人就能守業。"},{"english":"A ward, Chang Li immediately began chasing the beam implementation of medical insurance card.","chinese":"一出病房，常麗馬上就開始追着梁守業要醫保卡。"},{"english":"Chang Lan sense something fishy about his feeling and immediately guess is beam whilst make of ghost.","chinese":"常蘭感覺事有蹊蹺並立刻猜到是梁守業搞的鬼。"},{"english":"ZhouMinZhi just and homeowners signed business contract, the beam will chase to the sovereignty.","chinese":"周敏芝剛剛和房主簽訂了買賣合同，梁守業就追來了。"},{"english":"The power to initihad and operhad independently.","chinese":"自信有守業能力，並能獨立地從業。"},{"english":"ChangLan feeling can smell a rat and immediately guess is the sovereignty of the beam have demons.","chinese":"常蘭感覺事有蹊蹺並立刻猜到是梁守業搞的鬼。"},{"english":"Shouye discovers Youqing has been kidnapped too and decided to let both of them go.","chinese":"守業發現有情也被綁來，將兩人送走。"},{"english":"Chang Li directly with beam implementation of house property card, but liang whilst dont agree.","chinese":"常麗直接跟梁守業要房產證，但是梁守業不同意。"},{"english":"Chang Li directly with beam implementation of house property card, but liang whilst dont agree.","chinese":"常麗直接跟梁守業要房產證，但是梁守業不同意。"}],"related":[]}