{"definition":["to make one's home in a place\/to settle"],"pinyin":["an1 jia1 luo4 hu4"],"simplified":["安家落户"],"rank":34121.0,"normalized_rank":0.4773970590292838,"fraction":6.555855222369375e-7,"cumulative_fraction":0.9934948089406306,"word":"安家落戶","characters":[{"definition":["content\/calm\/still\/quiet\/safe\/secure\/in good health\/to find a place for\/to install\/to fix\/to fit\/to bring (a charge against sb)\/to pacify\/to harbor (good intentions)\/security\/safety\/peace\/ampere","surname An"],"pinyin":["An1","an1"],"word":"安"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"},{"definition":["colloquial reading for 落[luo4] in certain compounds","to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["la4","lao4","luo4"],"word":"落"},{"definition":["a household\/door\/family"],"pinyin":["hu4"],"word":"戶"}],"containing_words":[],"sentences":[{"english":"Can you settle here?","chinese":"你能在這裏安家落戶嗎？"},{"english":"Now it is finding a home in China.","chinese":"於國外，現在沙畫在中國安家落戶。"},{"english":"They have settled in Hainan.","chinese":"他們已經在海南島安家落戶。"},{"english":"The state shall encourage veteran cadres to settle in the countryside or in small or medium-sized cities or towns.","chinese":"國家鼓勵離休幹部到農村或中小城鎮安家落戶。"},{"english":"He has determined to settle down in the countryside.","chinese":"他決定在農村安家落戶。"},{"english":"Many professors have made their homes in Rizhao.","chinese":"日照吸引了不少教授在這裏安家落戶。"},{"english":"He said that as early as the beginning of the 1800s, the Chinese had started settling here.","chinese":"他說，早在19世紀初，就有中國人來這裏安家落戶。"},{"english":"The art of sand painting first started abroad, Now it is finding a home in China.","chinese":"沙畫起源於國外，現在沙畫在中國安家落戶。"},{"english":"They have made it easier for rural folk to obtain permission to settle in a middle-sized city than in a large one.","chinese":"他們使農民在中型城市安家落戶比在大城市容易。"},{"english":"They settled down in the countryside to steel their wills.","chinese":"他們到農村安家落戶以鍛鍊自己的意志。"},{"english":"Men do not find it to be all smooth sailing when they settle down in a new colony.","chinese":"人們發覺到新殖民地安家落戶並非一帆風順。"}],"related":[]}