{"definition":["ammeter (loanword from \"ampere meter\")"],"pinyin":["an1 pei2 ji4"],"simplified":["安培计"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"安培計","characters":[{"definition":["content\/calm\/still\/quiet\/safe\/secure\/in good health\/to find a place for\/to install\/to fix\/to fit\/to bring (a charge against sb)\/to pacify\/to harbor (good intentions)\/security\/safety\/peace\/ampere","surname An"],"pinyin":["An1","an1"],"word":"安"},{"definition":["to bank up with earth\/to cultivate (lit. or fig.)\/to train (people)"],"pinyin":["pei2"],"word":"培"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"計"}],"containing_words":[],"sentences":[{"english":"Connect the battery and ammeter to the starter as shown in the illustration.","chinese":"按說明連接電池和安培計到起動機上。"},{"english":"The guard terminal of the electrometer ammeter or picoammeter is the LO input terminal.","chinese":"靜電計安培計和皮安計的保護端爲LO輸入端。"},{"english":"Find also the equivalent resistance of the adapted meter.","chinese":"求改裝後的安培計的電阻。"},{"english":"The ideal ammeter should read zero when its input terminals are left open.","chinese":"當輸入端開路時，理想安培計的讀數應當爲零。"},{"english":"All the LEDs are connected in parallel with a 100-ohm resistor in series with each.","chinese":"在此方法中，恆壓源與未知電阻和安培計相串聯。"},{"english":"He only had some ammeter and an ampoule.","chinese":"他只有一些安培計和一個安瓶。"},{"english":"Check that the ammeter indicates the specified current.","chinese":"檢查安培計的讀數。"},{"english":"An ammeter is a measuring instrument used to measure the electric current in a circuit.","chinese":"電流表又稱安培計，是測量電流的儀表。"},{"english":"In this method, a constant voltage source is placed in series with the unknown resistor and an ammeter.","chinese":"在此方法中，恆壓源與未知電阻和安培計相串聯。"}],"related":[]}