{"definition":["great scholar respected for learning and integrity"],"pinyin":["zong1 shi1"],"simplified":["宗师"],"rank":32547.0,"normalized_rank":0.4553747569012074,"fraction":7.514928230852269e-7,"cumulative_fraction":0.9923904540346551,"word":"宗師","characters":[{"definition":["school\/sect\/purpose\/model\/ancestor\/clan\/to take as one's model (in academic or artistic work)\/classifier for batches, items, cases (medical or legal), reservoirs","surname Zong"],"pinyin":["Zong1","zong1"],"word":"宗"},{"definition":["surname Shi","teacher\/master\/expert\/model\/army division\/(old) troops\/to dispatch troops"],"pinyin":["Shi1","shi1"],"word":"師"}],"containing_words":[],"sentences":[{"english":"My yoga guru is going to teach us about breathing today.","chinese":"我的瑜伽宗師教我們關於今天呼吸。"},{"english":"Maybe there’s a new maestro in town.","chinese":"或許，我們又將迎來一個新的一代宗師了。"},{"english":"\"Tai Chi Master\" and I've also learned a little myself.","chinese":"我看過《太極宗師》的電視劇，也自學了幾手太極拳。"},{"english":"Chinese companies share the same procedure with kungfu masters who once are disciples in the Shaolin Temples (Buddhist monastery famous for it's kungfu monks).","chinese":"中國企業都有一個從少林小子到太極宗師的過程。"},{"english":"She inherited the mantle of Ma Hong Tai Chi, Tai Chi and become a great master.","chinese":"她繼承了馬虹太極拳之衣鉢，而成爲太極一代宗師。"},{"english":"Farmboy. Pilot. Rebel. Jedi. Grand Master. Father.","chinese":"農夫，起義軍飛行員，絕地宗師，父親。"},{"english":"Guan Zhong was the master of ancient Chinese city planning and construction.","chinese":"管仲堪稱中國古代城市規劃建設的一代宗師。"},{"english":"Become a Grand Master in two professions.","chinese":"成爲兩項專業技能的宗師。"},{"english":"Mr. Shi Guangyuan is a guru in landscape photography.","chinese":"石光源先生是一位風景攝影的宗師。"},{"english":"The grand master, Gong Yutian, intended to retire from Zhong Hua President of the knights.","chinese":"一代宗師，宮羽田打算辭退中華武士會會長職位。"},{"english":"Chinese enterprises have a kid from Shaolin to tai chi master process.","chinese":"中國企業都有一個從少林小子到太極宗師的過程。"},{"english":"Frank Lloyd Wright is a great master of modern architecture.","chinese":"賴特是現代建築的一代宗師。"},{"english":"I did martial arts from a young age and studied Zen.","chinese":"我以前從一個年輕的宗師那學習武術。"},{"english":"Sen no Rikyu, a tea-master, wished to hang a flower basket on a column.","chinese":"茶道宗師千利休想把花籃掛到庭柱上。"},{"english":"You still meditate like our guru in India teach you ?","chinese":"你還會如印度宗師所教導的那樣，去冥想嗎？"}],"related":[{"definition":["painting world\/painting circles"],"pinyin":["hua4 tan2"],"word":"畫壇"},{"definition":["sect\/school (group of followers of a particular doctrine)"],"pinyin":["men2 pai4"],"word":"門派"},{"definition":["to impart\/to pass on\/to teach"],"pinyin":["chuan2 shou4"],"word":"傳授"},{"definition":["to teach\/to impart\/a disciple\/descendant"],"pinyin":["chuan2 ren2"],"word":"傳人"},{"definition":["pioneer"],"pinyin":["xian1 qu1"],"word":"先驅"},{"definition":["founder (of a craft, religious sect etc)"],"pinyin":["zu3 shi1"],"word":"祖師"},{"definition":["famous master\/great teacher"],"pinyin":["ming2 shi1"],"word":"名師"},{"definition":["the cassock and alms bowl of a Buddhist master passed on to the favorite disciple (Buddhism)\/legacy\/mantle"],"pinyin":["yi1 bo1"],"word":"衣缽"},{"definition":["to lecture on doctrine\/to expound the wisdom of ancient sages\/to preach\/a sermon"],"pinyin":["chuan2 dao4"],"word":"傳道"},{"definition":["family history (as a literary genre)","handed down in a family\/family traditions"],"pinyin":["jia1 chuan2","jia1 zhuan4"],"word":"家傳"},{"definition":["to learn a skill or art"],"pinyin":["xue2 yi4"],"word":"學藝"},{"definition":["the Absolute or Supreme Ultimate, the source of all things according to some interpretations of Chinese mythology"],"pinyin":["Tai4 ji2"],"word":"太極"},{"definition":["legendary person\/legend (i.e. person)"],"pinyin":["chuan2 qi2 ren2 wu4"],"word":"傳奇人物"},{"definition":["skill\/art"],"pinyin":["ji4 yi4"],"word":"技藝"},{"definition":["unique\/exceptional"],"pinyin":["jue2 shi4"],"word":"絕世"},{"definition":["shadowboxing or Taiji, T'aichi or T'aichichuan\/traditional form of physical exercise or relaxation\/a martial art"],"pinyin":["tai4 ji2 quan2"],"word":"太極拳"}]}