{"definition":["chief cabinet secretary (Japan)"],"pinyin":["guan1 fang2 zhang3 guan1"],"simplified":["官房长官"],"rank":17256.0,"normalized_rank":0.2414338281588852,"fraction":0.000003192676677097318,"cumulative_fraction":0.9672467514070628,"word":"官房長官","characters":[{"definition":["government official\/governmental\/official\/public\/organ of the body\/CL:個|个[ge4]","surname Guan"],"pinyin":["Guan1","guan1"],"word":"官"},{"definition":["house\/room\/CL:間|间[jian1]\/branch of an extended family\/classifier for family members (or concubines)","surname Fang"],"pinyin":["Fang2","fang2"],"word":"房"},{"definition":["chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance","length\/long\/forever\/always\/constantly"],"pinyin":["chang2","zhang3"],"word":"長"},{"definition":["government official\/governmental\/official\/public\/organ of the body\/CL:個|个[ge4]","surname Guan"],"pinyin":["Guan1","guan1"],"word":"官"}],"containing_words":[],"sentences":[{"english":"More on that news conference by Chief Cabinet Secretary Yukio Edano.","chinese":"內閣官房長官枝野幸男在新聞發佈會上還說了更多。"},{"english":"And Yasuhisa Shiozaki, a former chief cabinet secretary, has not accepted Mr Watanabe's entreaties to join him.","chinese":"前官房長官鹽崎恭久也拒絕了渡邊一同退黨的要求。"},{"english":"Branch chief Yukio Ueno said at a press conference, \"do not understand the relevant facts.\"","chinese":"官房長官枝野幸男在記者會上稱“不瞭解相關事實”。"},{"english":"The chief cabinet secretary, Takeo Kawamura, insisted Nakagawa had not been drunk.","chinese":"內閣官房長官武雄河村堅持稱中川沒有喝醉。"},{"english":"Yoshito Sengoku, the chief cabinet secretary, will serve as justice minister until a permanent appointment is made.","chinese":"法務大臣一職將暫由內閣官房長官仙谷由人兼任。"},{"english":"Japan's Chief Cabinet Secretary Yukio Ueno branch position soon.","chinese":"日本內閣官房長官枝野幸男也很快表態。"},{"english":"Japan's Chief Cabinet Secretary Yoshito Sengoku called for calm on both sides Tuesday.","chinese":"星期二日本內閣官房長官仙谷由人呼籲雙方保持冷靜。"},{"english":"Yoshito Sengoku, the chief cabinet secretary, will serve as justiceminister until a permanent appointment is made.","chinese":"法務大臣一職將暫由內閣官房長官仙谷由人兼任。"}],"related":[]}