{"definition":["to calibrate (measure or apparatus)\/fixed coefficient"],"pinyin":["ding4 biao1"],"simplified":["定标"],"rank":39782.0,"normalized_rank":0.5566017936843284,"fraction":3.923878610048737e-7,"cumulative_fraction":0.99640394320062,"word":"定標","characters":[{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"},{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"標"}],"containing_words":[{"definition":["scaler"],"pinyin":["ding4 biao1 qi4"],"word":"定標器"}],"sentences":[{"english":"Corner detection is the main task of the image processing in camera calibration.","chinese":"特徵角點的提取是攝像機定標中圖像處理的主要任務。"},{"english":"In fact, the focus of this paper is the logic verification of the Scaler chip.","chinese":"本文的重點爲定標器芯片的邏輯驗證。"},{"english":"This can be achieved by SAR Radiometric Calibration.","chinese":"這個工作是由SAR輻射定標完成的。"},{"english":"Fashion designers feel beauty should not have a legal standard.","chinese":"時尚設計師認爲美是不需要有個法定標準的。"},{"english":"A floating calibration method for resistance moisture teller is introduced.","chinese":"提出了一種基於浮動定標原理的示值標定方法。"},{"english":"Multi-wavelength intensity calibration procedure based on ICCD detector has been presented.","chinese":"給出了基於ICCD探測器的多波長強度定標方法。"},{"english":"The legal criterion of divorce is proper to resume generalization doctrine.","chinese":"離婚法定標準宜恢復爲概括主義。"},{"english":"The calibration method of automatic analysis for seawater nutrients in situ has been optimized.","chinese":"對海水營養鹽現場自動測量定標方法進行了優化研究。"},{"english":"Moreover, the calibration scheme is outlined on the basis of the characteristics of radiometry for shooting range.","chinese":"根據靶場輻射測量特點，設計了整體定標方案。"},{"english":"Followed by the statutory criteria for the completion of the land resettlement compensation for the demolition work.","chinese":"隨後按法定標準完成了徵地拆遷安置補償工作。"},{"english":"The body cavity mucosa scaling biopsy forceps includes handle with chute on its side;","chinese":"本發明公開了一種體腔粘膜定標活檢鉗。"},{"english":"Finally, the key technological problems of the calibration technologies under researching are analyzed predicatively.","chinese":"對未來需要開展研究的定標技術做了初步分析。"},{"english":"The V-shaped upper section is provided with a cut-out for the scale and the measuring capillaries.","chinese":"形的上部有一個開口用於定標和測量毛細管。"},{"english":"It has been proved that the device satisfies all requirements of the large aperture infrared opto-electric system by experiments.","chinese":"實驗表明，能滿足大口徑紅外光電系統的定標要求。"},{"english":"FPGA synthesis is employed to perform the logic verification for the front-end design of the Scaler.","chinese":"定標器芯片前端設計通過FPGA實現進行邏輯驗證。"},{"english":"Secondly, the relation between high resolution spaceborne SAR radiometric calibration and SMP is discussed.","chinese":"定標與衛星運動參數的關聯技術。"}],"related":[]}