{"definition":["set at\/scheduled at"],"pinyin":["ding4 yu2"],"simplified":["定于"],"rank":7037.0,"normalized_rank":0.0984567598953451,"fraction":0.000014633381227147529,"cumulative_fraction":0.8970605090064109,"word":"定於","characters":[{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[{"definition":["(idiom) to rely on a single authority to determine what is correct\/to regard a source (or entity or individual) as the ultimate authority"],"pinyin":["ding4 yu2 yi1 zun1"],"word":"定於一尊"}],"sentences":[{"english":"The convention starts September 1 in St. Paul, Minnesota.","chinese":"大會定於9月1日在明尼蘇達州聖保羅市開幕。"},{"english":"In this aspect, the dissemination study present is all flowers blooms together, has not decided one.","chinese":"在這方面，傳播學現在是百花齊放，沒有定於一尊。"},{"english":"You configure the transformation with the names of the relationship and the application-specific role.","chinese":"使用關係的名稱和特定於應用程序的角色配置轉換。"},{"english":"This is a business and operational decision specific to each enterprise.","chinese":"這是一個特定於每個企業的業務和運作決策。"},{"english":"A selection object takes over the definition of these application-specific events.","chinese":"選擇對象採用特定於應的事件定義。"},{"english":"Subsequent arguments are mode-specific options and their values.","chinese":"之後的參數是特定於模式的選項和它們的值。"},{"english":"The boat-race has been officially fixed for Thursday, April 2.","chinese":"划船比賽已正式定於4月2日星期四舉行。"},{"english":"Will call at 2 p.m. tomorrow.","chinese":"來條收悉，定於明天下午兩點拜訪。"},{"english":"The key point about replication conflicts is that handling the errors is domain-specific.","chinese":"關於複製衝突的關鍵點是處理錯誤是特定於域的。"},{"english":"The trial had been scheduled to take place at a Cairo convention hall Wednesday.","chinese":"該審判原定於星期三在開羅一個大會堂進行。"},{"english":"The report is scheduled for 8:30 a.m. in Washington.","chinese":"該報告定於上午8:30在華盛頓發表。"},{"english":"Provide the customer with any extra customer-specific notes, as necessary.","chinese":"根據需要向客戶提供其他特定於客戶的說明。"},{"english":"When is the train from Shanghai due in Ningbo?","chinese":"上海來的火車定於什麼時候抵達寧波？"},{"english":"ASEAN is scheduled for March 22 to discuss the Thai-Cambodian border dispute.","chinese":"東盟定於本月22日討論泰柬邊界爭端。"},{"english":"Star Citizen is a multi-player Internet video game set in outer space.","chinese":"星際公民是一款背景設定於外太空的多玩家網絡遊戲。"},{"english":"The Mid-Autumn Festival falls on the 15th day of the 8th lunar month.","chinese":"中秋節定於每年的陰曆八月十五日。"}],"related":[]}