{"definition":["to fix\/to confine to\/freeze frame\/stop motion (filmmaking)"],"pinyin":["ding4 ge2"],"simplified":["定格"],"rank":13711.0,"normalized_rank":0.19183467882976787,"fraction":0.0000048543400036666935,"cumulative_fraction":0.953264117857623,"word":"定格","characters":[{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"},{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"}],"containing_words":[],"sentences":[{"english":"We all trials and hardships to walk, past experience has stopped.","chinese":"我們一路風雨兼程地走來，過去的經歷已經定格。"},{"english":"By and by, all came to halt, the autumn in chilly night in frame frozen.","chinese":"時光停滯，漸漸地，定格在這寒夜秋塘落葉。"},{"english":"Your smile on the screen I've already got used to will be fixed to my mind forever.","chinese":"習慣了屏幕那邊你熟悉的笑，將永遠定格我的心間。"},{"english":"I love you just wishful thinking began as stop-motion.","chinese":"我愛你只是一廂情願一開始就成爲定格。"},{"english":"The method to solve Schrodinger equation with metrix function theory is presented.","chinese":"本文提出應用矩陣函數理論來解薛定格方程的方法。"},{"english":"Shanghai Automobile Museum recounts the century-long auto history.","chinese":"上海汽車博物館定格了汽車的百年曆史。"},{"english":"And critical point, it is interpretation of the numerous freeze-frame moments.","chinese":"而臨界，則是無數無常演繹中的瞬間定格。"},{"english":"Memory frames, sad like water diffuse.","chinese":"回憶定格的年間，悲傷如水般瀰漫。"},{"english":"The profound affection is sinking, unhurriedly stops, so reaches the very heart of life.","chinese":"深切的情思沉下去，從容定格，抵達生命的內蘊。"},{"english":"Stop-motion animation has the special artistic charm and the characteristic.","chinese":"定格動畫的具有特殊的藝術魅力及特性。"},{"english":"Not much, if any of the pale fingertips jump, cold, frozen at the moment of memory.","chinese":"若有若無的慘白，指尖跳躍的冰涼，定格此刻的記憶。"},{"english":"As she exhaled, her face settled into repose.","chinese":"當她呼氣的時候，臉孔定格在了安詳的表情。"},{"english":"I am a sojourner in your life, and you are my life eternal frames.","chinese":"我是你生命中的過客，而你是我這輩子永恆的定格。"},{"english":"Sometimes the form of death defines the appreciation of the beautiful modeling.","chinese":"死亡形態有時定格爲隱喻性的審美化造型。"},{"english":"Dancing is like bank robbery, it takes split-second timing.","chinese":"舞蹈好似銀行搶劫，將瞬間永遠定格。"},{"english":"But, how do you capture lightning in photographs?","chinese":"但是，你怎樣才能把閃電定格在自己的照片裏呢？"}],"related":[{"definition":["with a grunting sound it stops (idiom); to come to an end spontaneously (esp. of sound)"],"pinyin":["jia2 ran2 er2 zhi3"],"word":"戛然而止"},{"definition":["still\/immobile\/static\/stationary"],"pinyin":["jing4 zhi3"],"word":"靜止"},{"definition":["covered in dust\/dusty\/lying unused for a long time"],"pinyin":["chen2 feng1"],"word":"塵封"},{"definition":["to stay somewhere temporarily\/to stop over"],"pinyin":["ting2 liu2"],"word":"停留"},{"definition":["in an instant\/in a flash"],"pinyin":["shun4 jian1"],"word":"瞬間"},{"definition":["to take a curtain call\/(fig.) to come to an end"],"pinyin":["xie4 mu4"],"word":"謝幕"},{"definition":["the curtain drops\/the end of the show"],"pinyin":["luo4 mu4"],"word":"落幕"},{"definition":["to fade away"],"pinyin":["xiao1 shi4"],"word":"消逝"},{"definition":["to elapse\/to pass away\/to die\/demise"],"pinyin":["shi4 qu4"],"word":"逝去"},{"definition":["to come to nothing (idiom)"],"pinyin":["hua4 wei2 pao4 ying3"],"word":"化為泡影"},{"definition":["to remember\/to recall\/memory\/CL:個|个[ge4]"],"pinyin":["ji4 yi4"],"word":"記憶"},{"definition":["termination\/to finish\/to end\/to conclude\/to close"],"pinyin":["jie2 shu4"],"word":"結束"},{"definition":["(of time) to pass\/to elapse"],"pinyin":["liu2 shi4"],"word":"流逝"},{"definition":["eternal\/everlasting\/fig. to pass into eternity (i.e. to die)"],"pinyin":["yong3 heng2"],"word":"永恆"},{"definition":["one instant\/very short time\/the twinkle of an eye"],"pinyin":["yi1 shun4"],"word":"一瞬"},{"definition":["to recall\/memories\/CL:個|个[ge4]"],"pinyin":["hui2 yi4"],"word":"回憶"}]}