{"definition":["variant of 訂貨|订货[ding4 huo4]"],"pinyin":["ding4 huo4"],"simplified":["定货"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"定貨","characters":[{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"},{"definition":["goods\/money\/commodity\/CL:個|个[ge4]"],"pinyin":["huo4"],"word":"貨"}],"containing_words":[{"definition":["fiat currency"],"pinyin":["fa3 ding4 huo4 bi4"],"word":"法定貨幣"}],"sentences":[{"english":"Orders are taken by mail, and the goods are sent out from a central point where they are stored.","chinese":"定貨單是郵寄來的，貨物是從貯存中心發出去的。"},{"english":"KN :Well, you've seen the order quantities. What do you think you could manage?","chinese":"你已看到了定貨量，你認爲你能應付什麼情況？"},{"english":"I hope so. If I order now , when deliver?","chinese":"希望如此，如果現在定貨，什麼時候交貨。"},{"english":"Visitors can trade on samples.","chinese":"來賓可以看樣定貨。"},{"english":"He said it didn't pay to run such a big plant for a few orders.","chinese":"他說，爲了少量的定貨辦這麼大的工廠不上算。"},{"english":"The letter of credit for each order shall reach Party A45 days before the date of shipment .","chinese":"每筆定貨的信用證將在裝運前45天送交甲方。"},{"english":"We keep a reference sample of such special orders.","chinese":"我方保存着這種特殊定貨的一份樣品。"},{"english":"Could you please let us know what discount you can give for an order exceeding 400 sets?","chinese":"能否告知定貨超過400臺你方所能給的折扣。"},{"english":"This encourages visitor traffic and promotes client reorders .","chinese":"這些鼓勵了交易訪問者並促進了客戶再次定貨。"},{"english":"If you order in large quantity I think a discount would be possible.","chinese":"如果定貨量較大的話，我公司可以適當讓利。"},{"english":"He sent an order for groceries.","chinese":"他送了一個食品雜貨的定貨單。"},{"english":"Decisions to reorder or return goods to suppliers can then be made. (NETEM 1994, Passage 2, Paragraph 2)","chinese":"然後做出決定是再定貨還是把商品退給供應商。"},{"english":"The Acme order?I mailed it out this morning.","chinese":"艾克明的定貨嗎？我今天早上寄出去了。"},{"english":"If the goods are favorably accepted by our customers you can expect further orders from us.","chinese":"如我方客戶對你方貨物反映良好，會再向你們定貨的。"},{"english":"Could you please let us know what discount you can give for an order exceeding 00 sets?","chinese":"能否告知定貨超過00臺你方所能給的折扣。"},{"english":"Servo was swamped with rush order for the Korean war.","chinese":"塞爾伏爲了朝鮮戰爭的緊急定貨單忙得要死。"}],"related":[]}