{"definition":["to determine a location\/designated\/appointed\/specific\/fixed (time)\/fixed point (geometry)\/fixed-point (number)"],"pinyin":["ding4 dian3"],"simplified":["定点"],"rank":7057.0,"normalized_rank":0.09873658584360527,"fraction":0.000014578785594701166,"cumulative_fraction":0.8973525051338704,"word":"定點","characters":[{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[{"definition":["factory designated by the state to make a particular product"],"pinyin":["ding4 dian3 chang3"],"word":"定點廠"},{"definition":["fixed point\/calibration point"],"pinyin":["gu4 ding4 dian3"],"word":"固定點"},{"definition":["a specialized enterprise"],"pinyin":["ding4 dian3 qi3 ye4"],"word":"定點企業"}],"sentences":[{"english":"Sets the pix el at the specified point to the closest approximation of the specified color.","chinese":"設置指定點像素爲最接近指定色的近似值。"},{"english":"The first-order cancellation is one kind of classical idea for the purpose of canceling stationary target cancellation.","chinese":"一次相消技術是一種經典的固定點目標對消方法。"},{"english":"This could be achieved by relocating (or resetting) the set point to a higher value.","chinese":"這可以通過重新設置設定點到一個更高的值來達到。"},{"english":"On the cabin floor there are cargo tiedown points.","chinese":"在機艙地板上安裝有貨物固定點。"},{"english":"The company is specialized in producing various types of joint bearing structure sentinel enterprises.","chinese":"本公司是專業生產各種結構類型的關節軸承定點企業。"},{"english":"The genetic-mechanism of optimal depth and stable points was revealed.","chinese":"揭示了最佳埋深和穩定點的形成機理。"},{"english":"For floating-point and fixed-point types, M is the total number of digits that can be stored.","chinese":"對於浮點數及定點類型，M是數字存儲的總位數。"},{"english":"Its lower fixed point is absolute zero.","chinese":"其低端固定點溫度是絕對零度。"},{"english":"Is a professional manufacturer of fixed-point postal equipment and cabinet business.","chinese":"是一家專業生產郵政設備和箱櫃的定點企業。"},{"english":"\"MyObservatory\" provides location-specific weather service in Hong Kong.","chinese":"於香港境內提供定點天氣服務。"},{"english":"This paper presents a fixed-point MP3 decoding algorithm for embedded systems.","chinese":"提出了一種用於嵌入式系統的MP3定點解碼算法。"},{"english":"Juli is one of the national authorized professional crane manufacturers.","chinese":"是國家定點生產起重機的專業公司。"},{"english":"Micro-controlled system with film detection ensures high precision in sealing.","chinese":"微電腦全自動追蹤封口，膠膜定點，確保封膜準確。"},{"english":"Lugouqiao hospital is an Olympic designated hospital.","chinese":"盧溝橋醫院是奧運會定點醫院。"},{"english":"Is a company specializing in ceramic tile production and sales of fixed-point enterprise.","chinese":"是一家專業生產銷售牆地磚的定點企業。"},{"english":"These setpoints can be adjusted via control parameters P01 and P02.","chinese":"這些設定點可以通過調整控制參數P01和P02。"}],"related":[{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["to set up\/to install"],"pinyin":["she4 zhi4"],"word":"設置"},{"definition":["stronghold\/defended military base\/base for operations\/strategic point\/foothold\/(market) presence"],"pinyin":["ju4 dian3"],"word":"據點"},{"definition":["free (of charge)"],"pinyin":["mian3 fei4"],"word":"免費"},{"definition":["neighboring\/adjacent\/near\/vicinity"],"pinyin":["lin2 jin4"],"word":"鄰近"},{"definition":["to enter the venue\/to enter the arena\/(aviation) to approach the airfield\/(investing) to get into the market"],"pinyin":["jin4 chang3"],"word":"進場"},{"definition":["group\/organization\/team\/CL:個|个[ge4]"],"pinyin":["tuan2 ti3"],"word":"團體"},{"definition":["to alternate\/to take turns"],"pinyin":["lun2 liu2"],"word":"輪流"},{"definition":["facilities\/installation"],"pinyin":["she4 shi1"],"word":"設施"},{"definition":["to set up\/to arrange\/to establish\/to found\/to display"],"pinyin":["she4"],"word":"設"},{"definition":["to ratchet up\/to raise (expectations etc)\/to increase (a quota, a position in the market etc)\/to up the ante\/(computing) to encode"],"pinyin":["jia1 ma3"],"word":"加碼"},{"definition":["clinic"],"pinyin":["zhen3 suo3"],"word":"診所"},{"definition":["equipment\/facilities\/installations\/CL:個|个[ge4]"],"pinyin":["she4 bei4"],"word":"設備"},{"definition":["staff\/crew\/personnel\/CL:個|个[ge4]"],"pinyin":["ren2 yuan2"],"word":"人員"},{"definition":["space\/site\/place\/sports pitch"],"pinyin":["chang3 di4"],"word":"場地"},{"definition":["dealer\/trader\/person engaged in some industry or trade"],"pinyin":["ye4 zhe3"],"word":"業者"}]}