{"definition":["homework"],"pinyin":["jia1 ting2 zuo4 ye4"],"simplified":["家庭作业"],"rank":31156.0,"normalized_rank":0.43591286219971176,"fraction":8.507576093513406e-7,"cumulative_fraction":0.9912772654385688,"word":"家庭作業","characters":[{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"},{"definition":["main hall\/front courtyard\/law court"],"pinyin":["ting2"],"word":"庭"},{"definition":["to do\/to grow\/to write or compose\/to pretend\/to regard as\/to feel\/writings or works","worker\/workshop\/(slang) troublesome\/high-maintenance (person)"],"pinyin":["zuo1","zuo4"],"word":"作"},{"definition":["line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already","surname Ye"],"pinyin":["Ye4","ye4"],"word":"業"}],"containing_words":[],"sentences":[{"english":"Do you do homework every day?","chinese":"你們每天都做家庭作業嗎？"},{"english":"Students are heavily burdened with home assignments.","chinese":"學生家庭作業負擔過重。"},{"english":"Why didn't you hand in your homework last time?","chinese":"你上次爲什麼沒交家庭作業。"},{"english":"Wolowitz: I don't have homework.","chinese":"我沒什麼家庭作業的。"},{"english":"Just did my homework and practiced the piano.","chinese":"只是寫家庭作業，練鋼琴。"},{"english":"The teacher bracketed the mistakes in my homework.","chinese":"老師用括弧標出了我家庭作業中的錯誤。"},{"english":"Lily has already finished his homework, so has Lucy.","chinese":"同麗莉一樣，露西也完成了她的家庭作業。"},{"english":"He threw his homework aside and watched TV.","chinese":"他把家庭作業拋到一邊去看電視了。"},{"english":"I ask, is tonight part of his homework for Project Mayhem?","chinese":"我問，今夜是他大混亂行動上留的家庭作業麼？"},{"english":"Well, you ought to have (finished the home-work).","chinese":"我的家庭作業還沒有做完。"},{"english":"He usas it for his work, and I can only use it for my homework.","chinese":"他要用電腦工作，而我只能用它來做我的家庭作業。"},{"english":"We are being given too much homework,so we will take  things up with our teacher.","chinese":"我們的家庭作業太多，我們要向老師提這個問題。"},{"english":"Recent research state most of children don't have good feeling about homework..","chinese":"最近的調查顯示相當多的孩子對家庭作業沒什麼好感。"},{"english":"They can study, do their homework and take exams at online schools.","chinese":"他們可以在網絡學校裏學習，做家庭作業和考試。"},{"english":"The boy does his homework in red ink.","chinese":"男孩用紅墨水做完家庭作業。"},{"english":"I do my homework at six-thirty,and then I eat breakfast at around seven-thirty.","chinese":"我六點半做家庭作業，七點半左右喫早餐。"}],"related":[]}