{"definition":["home computer"],"pinyin":["jia1 yong4 dian4 nao3"],"simplified":["家用电脑"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"家用電腦","characters":[{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"},{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"},{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["brain\/mind\/head\/essence"],"pinyin":["nao3"],"word":"腦"}],"containing_words":[],"sentences":[{"english":"They will study at home on computers.","chinese":"他們將在家用電腦上課。"},{"english":"They kept badgering him to get a home computer.","chinese":"他們總是纏着他買一臺家用電腦。"},{"english":"I send my household computer to be repaired.","chinese":"我把我的家用電腦送去維修了。"},{"english":"Sales of home computers have taken off in recent years.","chinese":"家用電腦的銷量近年來上升很快。"},{"english":"The needs of personal computers were surging in the first half of the year.","chinese":"今年上半年，家用電腦的需求量不斷猛增。"},{"english":"This company used to specialize in producing home computers.","chinese":"這家公司過去專門生產家用電腦。"},{"english":"The price of personal computers will sink again.","chinese":"家用電腦的價格還要降。"},{"english":"Pattern recognition software on home computers would seem a perfect tool.","chinese":"家用電腦上的模式識別軟件看起來是個完美的工具。"},{"english":"The multimedia household computer is a high-tech product and a good hand AT home.","chinese":"家用電腦外設多媒體，高技術產品，家庭好助手。"},{"english":"Officers seized documents and a computer from Chan's home in Gough Hill Road on The Peak.","chinese":"檢獲的文件和從安生在歌賦山道家用電腦上山頂。"},{"english":"Why do home-schooling parents keep their children to study at home?","chinese":"在家用電腦學習的好處有什麼？"}],"related":[]}