{"definition":["family livelihood\/a household's economic situation\/family property"],"pinyin":["jia1 ji4"],"simplified":["家计"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"家計","characters":[{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"計"}],"containing_words":[{"definition":["PRC State Planning Committee, abbr. for 國家計劃委員會|国家计划委员会[Guo2 jia1 Ji4 hua4 Wei3 yuan2 hui4]"],"pinyin":["Guo2 jia1 Ji4 Wei3"],"word":"國家計委"},{"definition":["PRC State Planning Committee, set up in 1952, replaced in 1998 by State Development and Planning Committee 國家發展計劃委員會|国家发展计划委员会[Guo2 jia1 Fa1 zhan3 Ji4 hua4 Wei3 yuan2 hui4] then in 2003 by National Development and Reform Commission 國家發展和改革委員會|国家发展和改革委员会[Guo2 jia1 Fa1 zhan3 he2 Gai3 ge2 Wei3 yuan2 hui4]"],"pinyin":["Guo2 jia1 Ji4 hua4 Wei3 yuan2 hui4"],"word":"國家計劃委員會"}],"sentences":[{"english":"I was about to become the breadwinner for my family and I was 18 years old.","chinese":"18歲的我將要成爲負擔家計的男人。"},{"english":"Comrade Huang Xiaohui is researcher of institute of technology of economy of state committee of planning.","chinese":"黃小蕙同志是國家計委經濟技術研究所研究員。"},{"english":"Article 25 These Measures shall be interpreted by the State Planning Commission (SPC).","chinese":"第二十五條本辦法由國家計委負責解釋。"},{"english":"Policemen with families have to moonlight to make ends meet.","chinese":"有家室的警察必須兼差才能維持家計。"},{"english":"Eg: A transnational program for improving the economy of Europe.","chinese":"改善歐洲經濟的一項超國家計劃。"},{"english":"Households having children between the ages of 7 to 12 ate more ham.","chinese":"有7至12歲學齡兒童的家計單位消費較多後腿肉。"},{"english":"With five children in college, Steve still manages to make both ends meet.","chinese":"有五個小孩在唸大學，史蒂夫還是有辦法維持家計。"},{"english":"He toiled every day to support his family.","chinese":"他每天爲家計辛苦工作。"},{"english":"The SPDC is responsible for projects with investment surpassing the set ceiling.","chinese":"其中限額以上的項目由國家計委負責。"},{"english":"My father gained a bare livelihood of family by his own hands.","chinese":"父親靠自己的雙手勉強維持家計。"},{"english":"His father was a sickly man and his mother washed clothing for a living.","chinese":"他的父親體弱多病，而母親則靠洗衣服維持家計。"},{"english":"The life and experiences, versatility and garden creating achievements of JI Cheng, an ancient Chinese garden creator, are introduced.","chinese":"介紹了中國古代造園家計成的生平和造園成就。"}],"related":[{"definition":["(military) arms\/armaments"],"pinyin":["jun1 bei4"],"word":"軍備"},{"definition":["to foster\/to bring up\/to raise"],"pinyin":["fu2 yang3"],"word":"扶養"},{"definition":["deputy chief"],"pinyin":["ci4 zhang3"],"word":"次長"},{"definition":["business in which a company has traditionally engaged (e.g. before diversifying)\/original business\/core business\/(literary) agriculture"],"pinyin":["ben3 ye4"],"word":"本業"},{"definition":["relatives\/members of the same family, clan, tribe etc"],"pinyin":["qin1 zu2"],"word":"親族"},{"definition":["to nurse\/to look after\/to watch over\/(old) hospital nurse"],"pinyin":["kan1 hu4"],"word":"看護"},{"definition":["terms (of an agreement)"],"pinyin":["gui1 yue1"],"word":"規約"},{"definition":["compensation"],"pinyin":["pei2 chang2 jin1"],"word":"賠償金"},{"definition":["to be without a fixed residence (idiom)"],"pinyin":["ju1 wu2 ding4 suo3"],"word":"居無定所"},{"definition":["to decide (in a meeting)\/to resolve (i.e. pass a resolution)"],"pinyin":["yi4 jue2"],"word":"議決"},{"definition":["to study at school"],"pinyin":["xiu1 ye4"],"word":"修業"},{"definition":["variant of 熱衷|热衷[re4 zhong1]"],"pinyin":["re4 zhong1"],"word":"熱中"},{"definition":["poor people"],"pinyin":["pin2 min2"],"word":"貧民"},{"definition":["hairdresser\/beautician (male)"],"pinyin":["mei3 rong2 shi1"],"word":"美容師"},{"definition":["check-up (health, car safety, environment etc)"],"pinyin":["jian4 zhen3"],"word":"健診"},{"definition":["journalist"],"pinyin":["xin1 wen2 ji4 zhe3"],"word":"新聞記者"}]}