{"definition":["patriarchal system"],"pinyin":["jia1 zhang3 zhi4"],"simplified":["家长制"],"rank":46777.0,"normalized_rank":0.6544709190883271,"fraction":1.9984337117398514e-7,"cumulative_fraction":0.9984086619790832,"word":"家長制","characters":[{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"},{"definition":["chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance","length\/long\/forever\/always\/constantly"],"pinyin":["chang2","zhang3"],"word":"長"},{"definition":["system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4"],"word":"制"}],"containing_words":[],"sentences":[{"english":"Beijing's courtyard there is a hierarchy, is the patriarchal system.","chinese":"北京的四合院是有等級的，是家長制的。"},{"english":"Recognizing the child's right of participation means to challenge the paternalist.","chinese":"承認兒童的參與權也意味着對家長制作風的否定。"},{"english":"The Kentucky high court decided that in loco parentis justified that rule.","chinese":"肯塔基州高院決定家長制符合這個規則。"},{"english":"Among the women and children, a matriarchal system often prevails;","chinese":"在只有婦女和小孩時，女家長制盛行。"},{"english":"The time has come to turn away from the condescending policies of paternalism.","chinese":"如今已到了揚棄那種家長制的降格相求政策的時刻。"},{"english":"In some places, the headmaster -in -charge system has become autocracy.","chinese":"在有些地方，校長負責製成了“家長制”。"},{"english":"It was the extension of the patriarchal system to the entire nation.","chinese":"這是延長了家長制，以整個國家。"},{"english":"They are presented as patriarchal Bedouin chiefs.","chinese":"他們被描寫爲父權家長制的貝都印式酋長。"}],"related":[]}