{"definition":["domestic (animals)\/home reared"],"pinyin":["jia1 yang3"],"simplified":["家养"],"rank":23733.0,"normalized_rank":0.3320554615029452,"fraction":0.0000016619552818230975,"cumulative_fraction":0.9823002924467736,"word":"家養","characters":[{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"},{"definition":["to raise (animals)\/to bring up (children)\/to keep (pets)\/to support\/to give birth"],"pinyin":["yang3"],"word":"養"}],"containing_words":[],"sentences":[{"english":"Dobby was a house-elf who served the Malfoy family.","chinese":"多比是馬爾福家族的家養小精靈。"},{"english":"A family dog rescued a newborn boy from the jaws of death.","chinese":"一隻家養犬把一個新生男嬰從鬼門關救了回來。"},{"english":"The origin of most of our domestic animals will probably forever remain vague.","chinese":"大部分家養動物的來源，也許會永遠曖昧不明。"},{"english":"We're all going to be Japanese collaborators. Even the dogs you Fangs keep stand by justice and righteousness.","chinese":"我們全要做漢奸，只有你方家養的狗都深明大義的。"},{"english":"Gray and her team first confirmed that all domesticated dogs trace their heritage back to gray wolves.","chinese":"戈瑞及她的團隊先是確認，所有家養狗都遺傳自灰狼。"},{"english":"Of course. I have a dog at home and my girlfriend has a snake.","chinese":"那還用說？我家養了一隻狗。我女朋友養了條蛇。"},{"english":"The Schulzs have more than 30 birds in their home. Many of them are looking for new homes.","chinese":"舒茲家養了三十多隻鳥，當中有許多正在找尋新家。"},{"english":"Dogs run in packs, and domesticated dogs are grieving when separated from their owners for any length of time.","chinese":"狗喜歡成幫結夥，家養的狗被與主人隔離後就會哀傷。"},{"english":"It would appear that climate has some direct action on the hair of our domestic quadrupeds .","chinese":"氣候對於家養四足獸的毛皮，似乎是有些直接作用的。"},{"english":"The problem now extends to household(4) pets.","chinese":"這個問題現在擴沿到家養寵物身上。"},{"english":"Some people keep rare animals at home as their pets .","chinese":"有些人在家養稀有動物當他們的寵物。"},{"english":"Horse is the main tool, wood sinotrans in Sweden nearly home domestic horses.","chinese":"馬是木材外運的主要工具，在當時瑞典幾乎家家養馬。"},{"english":"It is now illegal to keep chimps as pets in Connecticut.","chinese":"現在在康涅狄克州把黑猩猩當作家養寵物是違法的。"},{"english":"Local agricultural authorities also found evidence of H5 infection in household birds.","chinese":"地方農業部門也發現了家養禽鳥中H5感染的證據。"},{"english":"Blu is a domesticated macaw from the jungles of South America.","chinese":"藍光是從南美洲叢林家養的金剛鸚鵡。"},{"english":"Somepeople assume that it's good to keep pets in the house, especially for the olds.","chinese":"有的人認爲在家養寵物是好的，特別是老人來說。"}],"related":[]}