{"definition":["to seek truth from facts (idiom)\/to be practical and realistic"],"pinyin":["shi2 shi4 qiu2 shi4"],"simplified":["实事求是"],"rank":10623.0,"normalized_rank":0.14862955241839576,"fraction":0.0000074908419224200485,"cumulative_fraction":0.9346052678105652,"word":"實事求是","characters":[{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"},{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"},{"definition":["to seek\/to look for\/to request\/to demand\/to beseech"],"pinyin":["qiu2"],"word":"求"},{"definition":["is\/are\/am\/yes\/to be"],"pinyin":["shi4"],"word":"是"}],"containing_words":[],"sentences":[{"english":"“He can eat it when he comes in to the classroom, ” she said, very matter-of-factly.","chinese":"“他可以進了教室再喫，”老師實事求是地說道。"},{"english":"Naturally measurements are only one part of the subwoofer evaluation.","chinese":"實事求是的說，測量參數也只是低音炮評估的一部分。"},{"english":"I honestly cannot think of any other variable that might be correlated with childhood intelligence than those already controlled for in the multiple regression analyses.","chinese":"實事求是的說，我個人無法想到任何其他的控制變量。"},{"english":"Being practical and realistic is the principle of using Li to explain the Book of Songs.","chinese":"以禮說《詩》應該遵循實事求是原則。"},{"english":"Unmentioned matters shall be addressed by both Parties through consultation with each other on the principle of seeking truth from facts.","chinese":"本合同未盡事項由雙方本着實事求是的原則協商解決。"},{"english":"They had to give a sober assessment of the situation.","chinese":"他們必須對情況做個實事求是的估量。"},{"english":"Article 47 The petition or complaint made by a public procurator shall be true to facts.","chinese":"第四十七條檢察官提出申訴和控告，應當實事求是。"},{"english":"As far as I know, none of their factual assertions have been refuted.","chinese":"就我所知，他們實事求是的言論沒有一條被人反駁。"},{"english":"\"Facts\" are information, \"Yes\" is the ultimate decision-making, \"seeking\" through information analysis, decision-making.","chinese":"信息運用於決策的過程就是“實事求是”的過程。"},{"english":"And the spirit pierce through Dai Zhen\"s philosophy is \"Seekingtruth from facts\".","chinese":"貫穿在戴震哲學中的精神是“實事求是”的精神。"},{"english":"She was truthful, open-hearted and cheerful.","chinese":"她實事求是，心胸開闊，快活。"},{"english":"The Egoodh element of Taurus can raise strength properly desire for solid ground form and structure.","chinese":"土相星座的特質讓金牛座願望並具有實事求是的能力。"},{"english":"We have to be realistic about our chances of wining .","chinese":"對於我們獲勝的可能性，我們要實事求是。"},{"english":"Second, persevering in emancipating the mind, seeking truth from facts and keeping up with the times.","chinese":"第二，堅持解放思想，實事求是，與時俱進。"},{"english":"Such pragmatic thinking lacks the sizzle and punch of get-rich-quick advice.","chinese":"這種實事求是的思想是不會告訴你如何賺快錢的。"},{"english":"You are absolutely right. Finally, I think we need to be critiqued in writing a resume.","chinese":"意思是實事求是的，這也是必不可少的要求。"}],"related":[]}