{"definition":["(computing) actual parameter\/argument\/abbr. for 實際參數|实际参数[shi2 ji4 can1 shu4]"],"pinyin":["shi2 can1"],"simplified":["实参"],"rank":59858.0,"normalized_rank":0.8374910805478992,"fraction":4.247948941682226e-8,"cumulative_fraction":0.9998089304681094,"word":"實參","characters":[{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"},{"definition":["ginseng\/one of the 28 constellations","three (banker's anti-fraud numeral)","to take part in\/to participate\/to join\/to attend\/to counsel\/unequal\/varied\/irregular\/uneven\/not uniform\/abbr. for 參議院|参议院 Senate, Upper House"],"pinyin":["can1","san1","shen1"],"word":"參"}],"containing_words":[],"sentences":[{"english":"The parameters are defined as arguments that have to be passed by the report.","chinese":"這些參數被定義爲必須通過報告傳遞的實參。"},{"english":"In the calling code, do not enclose the argument in parentheses in the argument list.","chinese":"在調用代碼中，不要將實參列表中的實參放在括號內。"},{"english":"In the calling code, do not enclose the argument in parentheses in the argument list.","chinese":"在調用代碼中，不要將實參列表中的實參放在括號內。"},{"english":"You need to check the arguments before proceeding with the logic of each method.","chinese":"你需要在繼續進行每一個程序的邏輯之前檢查實參。"},{"english":"There is at least one argument for which the match is better than the match provided by any other viable function.","chinese":"其每個實參的匹配都不劣於其他可行函數需要的匹配。"},{"english":"This is, of course, if the contract states the preconditions for the arguments.","chinese":"當然，前提是合同規定了實參的先決條件。"},{"english":"It can create graphs by using command-line arguments to generate them from the data it has captured.","chinese":"它可以通過使用命令行實參根據捕捉的數據生成圖形。"},{"english":"A default argument doesn't change the number of parameters.","chinese":"默認實參並沒有改變形參的個數。"},{"english":"The match for each argument is no worse than the match required by any other viable function.","chinese":"其每個實參的匹配都不劣於其他可行函數需要的匹配。"},{"english":"Passing actual arguments of a too small size to a function.","chinese":"將很小的實參傳遞給函數。"}],"related":[]}