{"definition":["sb who gets things done\/doer"],"pinyin":["shi2 gan4 jia1"],"simplified":["实干家"],"rank":48253.0,"normalized_rank":0.6751220740699285,"fraction":1.728375102045277e-7,"cumulative_fraction":0.9986833508531224,"word":"實幹家","characters":[{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"},{"definition":["tree trunk\/main part of sth\/to manage\/to work\/to do\/capable\/cadre\/to kill (slang)\/to fuck (vulgar)"],"pinyin":["gan4"],"word":"幹"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[],"sentences":[{"english":"We just need to put into practice what we already know. Be a doer of the Word.","chinese":"我們只需將所知付諸實踐，做個真正的實幹家。"},{"english":"I think the simplest definition of maturity is to be a doer of the word.You do what the Bible says.","chinese":"我認爲成熟最直接的含義就是要做個實幹家。"},{"english":"It is the unsung achiever of our prosperity.","chinese":"它可是我們的繁榮默默無聞的實幹家。"},{"english":"In every domain I can think of, the people who are the most regarded are the doers.","chinese":"在我能想到的每一領域裏，最被人看重的是實幹家。"},{"english":"They also provide a boost for you, the doer.","chinese":"他們可能會幫助你成爲一名實幹家。"},{"english":"I think I should a doer , no need to modify the beautiful words.","chinese":"我想我該當個實幹家，不需要那些美麗的詞彙來修飾。"},{"english":"Anderson is a Doer.","chinese":"安德森是一位實幹家。"},{"english":"People who hang out in courageousness are the doers of the world.","chinese":"達到無畏階段的人都是這世界的實幹家。"},{"english":"Pak may have been seen as the hands-on person to fix its problems.","chinese":"或許人民覺得朴鳳柱是解決朝鮮問題的實幹家。"},{"english":"Ten empty talkers are not worth one man of action.","chinese":"十個空談家，抵不上一個實幹家。"},{"english":"I became a Doer.","chinese":"我成爲了一個實幹家。"},{"english":"I think the simplest definition of maturity is to be a doer of the word. You do what the Bible says.","chinese":"我認爲成熟最直接的含義就是要做個實幹家。"},{"english":"I think the simplest definition of maturity is to be a doer of the word.","chinese":"我認爲成熟最直接的含義就是要做個實幹家。"},{"english":"Life is a lot more fun as a Doer than a Talker.","chinese":"做一個實幹家比當一個空談者要有趣的多。"},{"english":"I’ve become a Talker instead of a Doer.","chinese":"我成了一個空談者，而非實幹家。"}],"related":[]}