{"definition":["practice (customary action, as opposed to theory)\/practical"],"pinyin":["shi2 wu4"],"simplified":["实务"],"rank":20559.0,"normalized_rank":0.2876470835140543,"fraction":0.0000022588577980615383,"cumulative_fraction":0.9761381507082364,"word":"實務","characters":[{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"},{"definition":["affair\/business\/matter\/to be engaged in\/to attend to\/by all means"],"pinyin":["wu4"],"word":"務"}],"containing_words":[],"sentences":[{"english":"I graduated from Guilin Institute, majoring in the professional practice of international trade.","chinese":"我畢業於桂林山水學院，主修的是國際貿易實務專業。"},{"english":"Author major make substantive research damages from the point of view of the scope of compensation.","chinese":"筆者主要從損害賠償範圍的角度進行實務性研究。"},{"english":"And they improve practices in global markets.","chinese":"他們還有助於改進全球市場的實務。"},{"english":"This course is an introduction to basic metal-cutting principles and their practical applications.","chinese":"本課程介紹基本的金屬切削原理及其實務應用。"},{"english":"The degree provides the academic and practical experience to practise as a radiographer.","chinese":"該學位提供技師的學術及實務執業經驗。"},{"english":"In practice, such \"cross-selling\" is hard to pull off.","chinese":"實務上，這種”交叉銷售”不容易成功。"},{"english":"This course examines and employs a more practical approach to analyze XML problems.","chinese":"本研究將使用較爲實務性的角度來分析XML的問題。"},{"english":"However, such provisions are of evidentiary value insofar as they bear upon questions of custom and practice.","chinese":"但是，此條款具有習慣與實務上無上的價值。"},{"english":"The full-featured version of the code has additional capabilities that are not available on the Web.","chinese":"全版的內容，實務能力也沒有提供額外的網站。"},{"english":"Philosophy is an aspect of metaphysics; while management, by contrast is a practical matter.","chinese":"哲學是屬形上之學，管理則以形而下的實務加以體現。"},{"english":"Based on the research finings, several suggestions were made to practitioners.","chinese":"本研究最後提出對企業實務上建議。"},{"english":"To familiarize students with further conception of Statistics. 2. To familiarize students with application of Statistic theory and practice.","chinese":"培養學生瞭解統計分析實務在資管領域之應用與分析。"},{"english":"Extraction of confession by torture has been one of the persistent ailments in legal affairs.","chinese":"刑訊逼供一直以來是司法實務中的頑症之一。"},{"english":"There has been different viewpoint about enforcing the institution of lawyers fee payment by transmission.","chinese":"理論界和實務界對於實施律師費轉付制有不同的觀點。"},{"english":"Lifeguards have to undertake extensive1 classroom and hands-on training.","chinese":"救生員必須通過密集的課堂及實務訓練。"},{"english":"Finally, some mechatronic systems developed for the vehicles will be introduced as the design examples.","chinese":"最後以各種車輛機電整合系統爲實務介紹。"}],"related":[{"definition":["function\/role"],"pinyin":["zhi2 neng2"],"word":"職能"},{"definition":["specialty\/special knowledge or ability"],"pinyin":["zhuan1 chang2"],"word":"專長"},{"definition":["expert (in a field)"],"pinyin":["zhuan1 ye4 ren2 cai2"],"word":"專業人才"},{"definition":["to give guidance\/to mentor\/to counsel\/to coach\/to tutor"],"pinyin":["fu3 dao3"],"word":"輔導"},{"definition":["to teach\/teaching and learning\/education\/CL:門|门[men2],個|个[ge4]"],"pinyin":["jiao4 xue2"],"word":"教學"},{"definition":["to work in a profession (e.g. doctor, lawyer)\/practitioner\/professional"],"pinyin":["zhi2 ye4"],"word":"執業"},{"definition":["to cultivate\/to train\/to groom\/training"],"pinyin":["pei2 xun4"],"word":"培訓"},{"definition":["to put to use\/to apply\/practical\/applied (science, linguistics etc)\/application\/practical use\/(computing) app"],"pinyin":["ying4 yong4"],"word":"應用"},{"definition":["category"],"pinyin":["fan4 chou2"],"word":"範疇"},{"definition":["business management"],"pinyin":["qi3 ye4 guan3 li3"],"word":"企業管理"},{"definition":["learning\/science\/academic\/CL:個|个[ge4]"],"pinyin":["xue2 shu4"],"word":"學術"},{"definition":["digital"],"pinyin":["shu4 wei4"],"word":"數位"},{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"word":"實踐"},{"definition":["specific responsibility"],"pinyin":["zhuan1 ze2"],"word":"專責"},{"definition":["research area\/field of research"],"pinyin":["yan2 jiu1 ling3 yu4"],"word":"研究領域"},{"definition":["subdivision\/segmentation"],"pinyin":["xi4 fen1"],"word":"細分"}]}