{"definition":["to implement\/to carry out"],"pinyin":["shi2 shi1"],"simplified":["实施"],"rank":368.0,"normalized_rank":0.005148797447987352,"fraction":0.0003720809133321103,"cumulative_fraction":0.4695185856673024,"word":"實施","characters":[{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"},{"definition":["surname Shi","to grant\/to give\/to bestow\/to act\/to carry out"],"pinyin":["Shi1","shi1"],"word":"施"}],"containing_words":[{"definition":["to put into practice\/to carry out (idiom)"],"pinyin":["fu4 zhu1 shi2 shi1"],"word":"付諸實施"},{"definition":["(patent) implementation\/embodiment"],"pinyin":["shi2 shi1 li4"],"word":"實施例"},{"definition":["to put into effect (idiom)"],"pinyin":["jian4 zhi1 shi2 shi1"],"word":"見之實施"}],"sentences":[{"english":"Teacher is a key factor in actualizing education for quality.","chinese":"教師是實施素質教育的關鍵因素。"},{"english":"It is an inevitable choice to develop the strategy of famous brand for an enterprise in the keen market competitions.","chinese":"實施名牌戰略是企業在激烈的市場競爭中的必然選擇。"},{"english":"Just show me one county where Dr. Sun's principles have been put in practice.","chinese":"你給我指出哪一個縣實施了孫中山先生的三民主義？"},{"english":"The raid was conducted with U. S. military personnel assaulting on two helicopters.","chinese":"實施襲擊的是兩駕直升機上的美國軍方人員。"},{"english":"Implementing customer scenarios to include the flow of defect submissions expands integration coverage.","chinese":"包含缺陷交付流程的實施客戶場景擴展了集成的範圍。"},{"english":"China is implementing a family planning policy. So I'm the only child in my family.","chinese":"中國正在實施計劃生育政策，所以我是家中的獨生子。"},{"english":"In the implementation of this cross-century strategy, ethnic issues merit special attention.","chinese":"民族問題在這項跨世紀戰略的實施中具有特殊的地位。"},{"english":"This is a superb concept. It should certainly be done.","chinese":"這是一種極好的概念，當然應該實施。"},{"english":"How do these issues influence the implementation and improvement of BASIX?","chinese":"這些問題是怎樣影響BASIX的實施和改善的？"},{"english":"They are currently in the process of piloting two programs aimed at getting families outdoors.","chinese":"他們最近還在實施另兩個旨在讓家庭走向戶外的項目。"},{"english":"They (China) are mistakenly trying to impose a flawed Monroe Doctrine in their backyard.","chinese":"中國錯誤的想在自己的後院實施有缺陷的門羅主義。"},{"english":"Did their parents check up on their whereabouts and set curfews?","chinese":"他們的父母會調查他們的行蹤並實施宵禁嗎？"},{"english":"Thus, embodiments of a virtual local memory for a graphics processor are disclosed.","chinese":"這樣，公開了圖形處理器的虛擬本地存儲器的實施例。"},{"english":"After hacker attack website is procurable, carry out \" hang a horse \" .","chinese":"當黑客攻擊網站得手後，便實施“掛馬”。"},{"english":"Since 2003, the Tourism-based Country Strategy has been established and implemented in Japan.","chinese":"自2003年以來，日本確立並實施了觀光立國戰略。"},{"english":"Cross-sectoral international collaboration key to implementing IHR.","chinese":"跨部門的國際合作是實施《國際衛生條例》的關鍵。"}],"related":[{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"實行"},{"definition":["to implement\/to carry out\/to execute\/to run"],"pinyin":["zhi2 xing2"],"word":"執行"},{"definition":["to launch\/to develop\/to unfold\/(of an exhibition etc) to open"],"pinyin":["kai1 zhan3"],"word":"開展"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落實"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["authorities"],"pinyin":["dang1 ju2"],"word":"當局"},{"definition":["mechanism"],"pinyin":["ji1 zhi4"],"word":"機制"},{"definition":["optimization\/to optimize\/to make superior"],"pinyin":["you1 hua4"],"word":"優化"},{"definition":["to start (a machine)\/(fig.) to set in motion\/to launch (an operation)\/to activate (a plan)"],"pinyin":["qi3 dong4"],"word":"啟動"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推進"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"規範"},{"definition":["to set up\/to establish"],"pinyin":["she4 li4"],"word":"設立"},{"definition":["to bloom\/to open\/to be open (to the public)\/to open up (to the outside)\/to be open-minded\/unrestrained by convention\/unconstrained in one's sexuality"],"pinyin":["kai1 fang4"],"word":"開放"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"監管"}]}