{"definition":["live relay\/broadcast of actual scene\/to broadcast live"],"pinyin":["shi2 kuang4 zhuan3 bo1"],"simplified":["实况转播"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"實況轉播","characters":[{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"},{"definition":["moreover\/situation"],"pinyin":["kuang4"],"word":"況"},{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["to sow\/to scatter\/to spread\/to broadcast\/Taiwan pr. [bo4]"],"pinyin":["bo1"],"word":"播"}],"containing_words":[],"sentences":[{"english":"Nonprofits could use it to livestream video from events.","chinese":"非營利組織可以用它來進行公益事件的實況轉播。"},{"english":"The match will be broadcast live.","chinese":"這場比賽將作實況轉播。"},{"english":"We watched the football match on live show television.","chinese":"我們看了電視實況轉播的足球比賽。"},{"english":"We watched the football match on live television .","chinese":"我們看了電視實況轉播的足球賽。"},{"english":"The arrest of the two drug traffickers was broadcast live on the TV.","chinese":"緝拿兩名販毒分子的過程在電視上進行了實況轉播。"},{"english":"No. I watch live football games here, in my bar with my customers.","chinese":"不，我大總分時間在酒吧衙顧客一起看實況轉播。"},{"english":"The French Open will be transmitted live via satellite.","chinese":"法國網球公開賽會透過衛星實況轉播。"},{"english":"Invite parents to the media center to watch the in-house broadcast of morning exercises.","chinese":"邀請家長到媒體中心觀看學生的早操的實況轉播。"},{"english":"The Opening Ceremony will be televised on Cable TV.","chinese":"有線電視將實況轉播開幕式的盛況。"},{"english":"There is a live telecast of World Cup match at the moment.","chinese":"那有一場世界盃比賽的電視實況轉播。"},{"english":"It was the largest amount ever won on live TV at that time.","chinese":"在那時這是在實況轉播中贏得最大的一筆獎金。"},{"english":"Communi cation satellites have already been used for living transmission in our country.","chinese":"我國已將通訊衛星用於實況轉播。"},{"english":"Communication satellites have already been used for living transmission in our country.","chinese":"我國乙將通訊衛星用於實況轉播。"}],"related":[{"definition":["the 7th day after a person's death\/the first 7-day period after a person's death"],"pinyin":["tou2 qi1"],"word":"頭七"},{"definition":["Tun District – area of Taichung (in Taiwan) between the coastal (western) part of the city and the mountains to the east"],"pinyin":["Tun2 qu1"],"word":"屯區"},{"definition":["audition\/dress rehearsal\/preview (of a theatrical performance)\/dummy run"],"pinyin":["shi4 yan3"],"word":"試演"},{"definition":["a hit\/tremendous popularity"],"pinyin":["jia1 ping2 ru2 chao2"],"word":"佳評如潮"},{"definition":["Mao Sui recommends himself (idiom); to offer one's services (in the style of Mao Sui offering his services to king of Chu 楚 of the Warring states)"],"pinyin":["Mao2 Sui4 zi4 jian4"],"word":"毛遂自薦"},{"definition":["to be up to one's ears in work (idiom)\/to be unable to attend to other things at the same time"],"pinyin":["fen1 shen1 fa2 shu4"],"word":"分身乏術"},{"definition":["everyone present applauds\/universal acclaim\/a standing ovation\/to bring the house down"],"pinyin":["man3 tang2 cai3"],"word":"滿堂彩"},{"definition":["lit. the lioness from Hedong roars (idiom)\/fig. refers to a shrewish wife or a henpecked husband"],"pinyin":["He2 dong1 shi1 hou3"],"word":"河東獅吼"},{"definition":["alarm (e.g. burglar or fire alarm)\/warning device"],"pinyin":["bao4 jing3 qi4"],"word":"報警器"},{"definition":["top news story"],"pinyin":["tou2 tiao2 xin1 wen2"],"word":"頭條新聞"},{"definition":["sand picture"],"pinyin":["sha1 hua4"],"word":"沙畫"},{"definition":["(coll.) to tamper with\/to mess around with"],"pinyin":["dong4 shou3 jiao3"],"word":"動手腳"},{"definition":["to liven up the atmosphere"],"pinyin":["chao3 re4 qi4 fen1"],"word":"炒熱氣氛"},{"definition":["to volunteer for\/to offer to undertake"],"pinyin":["zi4 gao4 fen4 yong3"],"word":"自告奮勇"},{"definition":["the empty city stratagem (in which Zhuge Liang presents himself as unperturbed while making it evident that his city is undefended, hoping his adversary will suspect an ambush)\/double bluff"],"pinyin":["kong1 cheng2 ji4"],"word":"空城計"},{"definition":["clear and simple\/in simple terms"],"pinyin":["jian3 dan1 ming2 liao3"],"word":"簡單明瞭"}]}