{"definition":["actual situation\/the ultimate essence of things (Buddhism)"],"pinyin":["shi2 xiang4"],"simplified":["实相"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"實相","characters":[{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"},{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"}],"containing_words":[],"sentences":[{"english":"Your reality is only spirit. Therefore you are in a state of grace forever.","chinese":"你的實相是純粹屬靈的，因此你永存於恩典之境。"},{"english":"Instead of running away from the problem, we are facing reality as it is.","chinese":"我沒有逃避問題，反之我是如實地正視實相。"},{"english":"She who sends energy to the matrix that perpetuates the reality in which souls may manifest.","chinese":"向矩陣傳送能量的她使靈魂可以顯現的實相永存。"},{"english":"We must experience directly the reality of this mental-physical phenomenon.","chinese":"我們必須直接體驗這身心現象的實相。"},{"english":"In reality, though, she is none other than our own buddha nature.","chinese":"然而於實相中，伊喜措嘉與我們自己的佛性並無分別。"},{"english":"Remember, to truly understand Ultimate Reality you","chinese":"記住，要真正領會終極實相，你得走出你的心智。"},{"english":"In the waking state it focuses in physical reality.","chinese":"它在清醒狀態時聚焦於物質實相。"},{"english":"This is the Self that never sinned, nor made an image to replace reality.","chinese":"這個自性永不犯罪，也不會妄造形象來取代實相。"},{"english":"To put it differently, does the thought process discover the real?","chinese":"換句話說，思維過程是否能發現實相？"},{"english":"The awakened one is one with the what is.","chinese":"覺醒的人與如是的實相在一起。"},{"english":"Samadhi is the only stable unchanging Reality.","chinese":"三摩地唯一的穩定不變的實相。"},{"english":"What difference does the content of a dream make in reality?","chinese":"不同的夢在實相里又有何分別？"},{"english":"It is only then that we will find reality.","chinese":"只有這時，我們才能發現實相。"},{"english":"Conscious guardians seek to support the whole of the consensus reality or planet or star that they reside upon.","chinese":"者尋求去支持一致實相或所居住的行星或恆星的整體。"},{"english":"Is this part of becoming reconnected to the larger reality?","chinese":"這部分正連接到更大的實相？"},{"english":"All probable reality is based on the actualized thought forms and free will of mankind.","chinese":"所有可能的實相都是基於實現人類的自由意志與想法。"}],"related":[{"definition":["to become enlightened (Buddhism)"],"pinyin":["kai1 wu4"],"word":"開悟"},{"definition":["life and death"],"pinyin":["sheng1 mie4"],"word":"生滅"},{"definition":["all living things"],"pinyin":["zhong4 sheng1"],"word":"眾生"},{"definition":["karma\/preordained fate (Buddhism)"],"pinyin":["guo3 bao4"],"word":"果報"},{"definition":["gate to enlightment (Buddhism)\/Buddhism\/way\/method\/(old) south gate of a palace"],"pinyin":["fa3 men2"],"word":"法門"},{"definition":["to untie\/to free\/to absolve of\/to get free of\/to extirpate oneself\/(Buddhism) to free oneself of worldly worries"],"pinyin":["jie3 tuo1"],"word":"解脫"},{"definition":["void\/hollow\/empty"],"pinyin":["xu1 kong1"],"word":"虛空"},{"definition":["in other words"],"pinyin":["huan4 ju4 hua4 shuo1"],"word":"換句話說"},{"definition":["to abandon suffering and obtain happiness (Buddhism)"],"pinyin":["li2 ku3 de2 le4"],"word":"離苦得樂"},{"definition":["(of a deity) to take a material shape\/to appear"],"pinyin":["shi4 xian4"],"word":"示現"},{"definition":["nothingness"],"pinyin":["xu1 wu2"],"word":"虛無"},{"definition":["tathagata (Buddha's name for himself, having many layers of meaning - Sanskrit: thus gone, having been Brahman, gone to the absolute etc)"],"pinyin":["ru2 lai2"],"word":"如來"},{"definition":["nothing other than\/to differ in no way from\/the same as\/to amount to"],"pinyin":["wu2 yi4"],"word":"無異"},{"definition":["to reincarnate\/reincarnation (Buddhism)\/(of the seasons etc) to follow each other cyclically\/cycle\/CL:個|个[ge4]"],"pinyin":["lun2 hui2"],"word":"輪迴"},{"definition":["a flash of realization\/the truth in a flash\/a moment of enlightenment (usually Buddhist)"],"pinyin":["dun4 wu4"],"word":"頓悟"},{"definition":["to vow"],"pinyin":["fa1 yuan4"],"word":"發願"}]}