{"definition":["to achieve\/to implement\/to realize\/to bring about"],"pinyin":["shi2 xian4"],"simplified":["实现"],"rank":297.0,"normalized_rank":0.004155415331663704,"fraction":0.0004340790712366415,"cumulative_fraction":0.4408311527965463,"word":"實現","characters":[{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"},{"definition":["to appear\/present\/now\/existing\/current"],"pinyin":["xian4"],"word":"現"}],"containing_words":[{"definition":["self-actualization (psychology)\/self-realization"],"pinyin":["zi4 wo3 shi2 xian4"],"word":"自我實現"},{"definition":["hard to accomplish\/difficult to achieve"],"pinyin":["nan2 yi3 shi2 xian4"],"word":"難以實現"}],"sentences":[{"english":"Chihiro has thus been recognized by everyone to achieve their value.","chinese":"千尋也因此獲得衆人的認可，實現了自己的價值。"},{"english":"Although he passed away, he was able to experience his greatest wish.","chinese":"雖然他去世了，但他終能實現他最大的願望。"},{"english":"The 2.6.25 implementation will need to walk the retransmission queue from the start in order to find this data.","chinese":"的實現需要從起點遍歷重傳隊列以便找到數據。"},{"english":"Cold store is used to control temperature of strawberry.","chinese":"控制溫度一般通過冷藏庫實現。"},{"english":"Design and implementation of a realtime transport cascade multiplexer in SDTV are discussed.","chinese":"設計並實現了一種可級聯的實時多節目複用器。"},{"english":"The increase of gross price level is the sacrifice a country makes for exercizing its function.","chinese":"價格總水平的上漲是國家爲實現其職能所付出的代價。"},{"english":"Achieved by the stock version of the software applications on the Internet.","chinese":"實現了圖文版股票分析軟件在互聯網上的應用。"},{"english":"But unless you get paid to play videogames, you’re kind of not accomplishing stuff.","chinese":"但除非你是職業玩家，你什麼也沒實現。"},{"english":"This paper also introduces the dual-speed control system and the realization of the function.","chinese":"還詳述了雙調速系統，及所實現的功能。"},{"english":"Vaccines and even staple food crops have been modified to achieve these goals.","chinese":"疫苗及甚至主糧作物已被修改去實現這些目標。"},{"english":"An optical method of pseudocolor equidensity encoding of photographic image is described. Frequency modulating of input image is made through!","chinese":"本文用光學方法實現了圖象等密度假彩色編碼。"},{"english":"Stock company is the form of realization of state-owned enterprises at the operational level.","chinese":"股份制企業是國有企業在經營層次上的實現形式。"},{"english":"It didn't take long for Zimmer to realize he had landed on a school of crappie.","chinese":"它沒有多久齊默實現他對學校的克拉皮降落。"},{"english":"However, many young people do not seem to realize the importance of modesty.","chinese":"然而，許多年輕人似乎沒有實現謙遜的重要性。"},{"english":"The paper applies microprocessor technology, designs the controller of return irrigation system of geothermal water.","chinese":"本文應用單片機技術，設計實現地熱水回灌控制器。"},{"english":"These repetitive and necessary alterations can only be realized by the original designer.","chinese":"這些重複但必要的改動只能由原設計師來實現。"}],"related":[{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"發展"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"},{"definition":["to reach\/to achieve\/to attain"],"pinyin":["da2 dao4"],"word":"達到"},{"definition":["to create\/to bring about\/to produce\/to set (a record)"],"pinyin":["chuang4 zao4"],"word":"創造"},{"definition":["to reach (an agreement)\/to accomplish"],"pinyin":["da2 cheng2"],"word":"達成"},{"definition":["steady\/stable\/stability\/to stabilize\/to pacify"],"pinyin":["wen3 ding4"],"word":"穩定"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["to yield\/to permit\/to let sb do sth\/to have sb do sth\/to make sb (feel sad etc)\/by (indicates the agent in a passive clause, like 被[bei4])"],"pinyin":["rang4"],"word":"讓"},{"definition":["to continue\/to persist\/sustainable\/preservation"],"pinyin":["chi2 xu4"],"word":"持續"},{"definition":["future\/tomorrow\/CL:個|个[ge4]\/approaching\/coming\/pending"],"pinyin":["wei4 lai2"],"word":"未來"},{"definition":["to become\/to turn into"],"pinyin":["cheng2 wei2"],"word":"成為"},{"definition":["to fight for\/to strive for\/to win over"],"pinyin":["zheng1 qu3"],"word":"爭取"},{"definition":["to display\/to exhibit\/to bring out implicit or innate qualities\/to express (a thought or moral)\/to develop (an idea)\/to elaborate (on a theme)"],"pinyin":["fa1 hui1"],"word":"發揮"},{"definition":["to mature\/to grow\/growth"],"pinyin":["cheng2 zhang3"],"word":"成長"}]}