{"definition":["Actual practice is the sole criterion for judging truth (item from Deng Xiaoping theory, from 1978)"],"pinyin":["shi2 jian4 shi4 jian3 yan4 zhen1 li3 de5 wei2 yi1 biao1 zhun3"],"simplified":["实践是检验真理的唯一标准"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"實踐是檢驗真理的唯一標準","characters":[{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"},{"definition":["to fulfill (a promise)\/to tread\/to walk"],"pinyin":["jian4"],"word":"踐"},{"definition":["is\/are\/am\/yes\/to be"],"pinyin":["shi4"],"word":"是"},{"definition":["to check\/to examine\/to inspect\/to exercise restraint"],"pinyin":["jian3"],"word":"檢"},{"definition":["to examine\/to test\/to check"],"pinyin":["yan4"],"word":"驗"},{"definition":["really\/truly\/indeed\/real\/true\/genuine"],"pinyin":["zhen1"],"word":"真"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["aim\/clear","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","really and truly","see 的士[di1 shi4]"],"pinyin":["de5","di1","di2","di4"],"word":"的"},{"definition":["-ism\/only\/alone","yes"],"pinyin":["wei2","wei3"],"word":"唯"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"標"},{"definition":["accurate\/standard\/definitely\/certainly\/about to become (bride, son-in-law etc)\/quasi-\/para-"],"pinyin":["zhun3"],"word":"準"}],"containing_words":[],"sentences":[],"related":[]}