{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"simplified":["实践"],"rank":1895.0,"normalized_rank":0.02651350859765226,"fraction":0.00008219357867037208,"cumulative_fraction":0.7221392486121028,"word":"實踐","characters":[{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"},{"definition":["to fulfill (a promise)\/to tread\/to walk"],"pinyin":["jian4"],"word":"踐"}],"containing_words":[{"definition":["Actual practice is the sole criterion for judging truth (item from Deng Xiaoping theory, from 1978)"],"pinyin":["shi2 jian4 shi4 jian3 yan4 zhen1 li3 de5 wei2 yi1 biao1 zhun3"],"word":"實踐是檢驗真理的唯一標準"}],"sentences":[{"english":"Your shortstop will never forget about practice again.","chinese":"您的游擊手將永遠不會忘記的再實踐。"},{"english":"In our consulting practice, we reverse the procedure.","chinese":"在我們的諮詢實踐中，我們改變了程序。"},{"english":"Chapter three explores how to lead the primary school language teaching into the local culture of study in primary schools.","chinese":"第三章探究了小學語文教學引入如東地方文化的實踐。"},{"english":"And we scheduled it and we get it and my dad and my sister would help trim it.","chinese":"先做安排然後實踐，爸爸和姐姐會幫忙修剪聖誕樹。"},{"english":"Now, in practice, it depends on how good your measurement is.","chinese":"在實踐中，它取決於你的測量方法有多高明。"},{"english":"This best practice should still be followed.","chinese":"這個可靠實踐方法仍然需要遵循。"},{"english":"But how can I apply to practice?","chinese":"但是我如何才能運用於實踐呢？"},{"english":"One must learn by doing in stages, and advancing those things that work.","chinese":"人們必須在實踐中學習，再進一步讓過程工作的更好。"},{"english":"However, this is very difficult to apply in practice on actual projects.","chinese":"但是在實際的項目中，這是非常難於付諸實踐的。"},{"english":"Contract after rent in the countryside la nd circulation practice blooming.","chinese":"反租倒包在農村土地流轉的實踐中脫穎而出。"},{"english":"And through prayer, God helps me put into practice what I learn.","chinese":"藉着禱告，上帝幫助我把所明白的東西付諸實踐。"},{"english":"The advanced beginner uses best practices.","chinese":"“高級初學者”使用最佳實踐。"},{"english":"If the conclusions can not be applied in practice, better dump them when it is still early.","chinese":"如果得出結論不能在實踐中應用，趁早扔了。"},{"english":"Astrology is a trusted science and is being practiced for over 4000 years,\" said an affidavit filed by Dr R Ramakrishna, deputy drug controller (India), west zone.","chinese":"占星術是被信服的科學，已被實踐了4000多年。"},{"english":"In practice, residual values are ignored if they are not expected to be material in amount.","chinese":"在實踐中，如果殘值金額預計不大，通常被忽略。"},{"english":"The practice makes sure voice electronic mail system model based on 4-tiered architecture is viable and effective.","chinese":"實踐證實了該模型的可行性和有效性。"}],"related":[{"definition":["cognition\/cognitive\/understanding\/perception\/awareness\/to be cognizant of\/to recognize\/to realize"],"pinyin":["ren4 zhi1"],"word":"認知"},{"definition":["to learn\/to study"],"pinyin":["xue2 xi2"],"word":"學習"},{"definition":["experience\/to experience"],"pinyin":["jing1 yan4"],"word":"經驗"},{"definition":["notion\/thought\/concept\/sense\/views\/ideology\/general impressions"],"pinyin":["guan1 nian4"],"word":"觀念"},{"definition":["to teach\/teaching and learning\/education\/CL:門|门[men2],個|个[ge4]"],"pinyin":["jiao4 xue2"],"word":"教學"},{"definition":["science\/scientific knowledge\/scientific\/rational\/CL:門|门[men2],個|个[ge4],種|种[zhong3]"],"pinyin":["ke1 xue2"],"word":"科學"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["to extend\/to spread\/to popularize\/generalization\/promotion (of a product etc)"],"pinyin":["tui1 guang3"],"word":"推廣"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to practice\/to put into practice"],"pinyin":["jian4 xing2"],"word":"踐行"},{"definition":["art"],"pinyin":["yi4 shu4"],"word":"藝術"},{"definition":["to use\/to put to use"],"pinyin":["yun4 yong4"],"word":"運用"},{"definition":["to create\/to bring about\/to produce\/to set (a record)"],"pinyin":["chuang4 zao4"],"word":"創造"},{"definition":["to accumulate\/accumulation\/cumulative\/cumulatively"],"pinyin":["ji1 lei3"],"word":"積累"},{"definition":["(line of) thought\/thinking"],"pinyin":["si1 wei2"],"word":"思維"}]}