{"definition":["substantive\/substantial\/material\/considerable"],"pinyin":["shi2 zhi4 xing4"],"simplified":["实质性"],"rank":5375.0,"normalized_rank":0.07520322359492396,"fraction":0.000021631986591789137,"cumulative_fraction":0.8674956587782894,"word":"實質性","characters":[{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"},{"definition":["character\/nature\/quality\/plain\/to pawn\/pledge\/hostage\/to question\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"質"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"A small additional perturbation can have a substantial effect.","chinese":"小小的波動就能產生實質性的影響。"},{"english":"He hoped that the dialogue between the DPRK and the US will produce substantive results.","chinese":"我希望朝美對話取得實質性成果。"},{"english":"Purpose: Introducting the value of CT technique and findings in diagnosing abdominal parenchymal visceral injury.","chinese":"介紹腹部實質性臟器損傷中的CT診斷作用及其表現。"},{"english":"Creativeness is the natural features in the thought-of-singing.","chinese":"創造性是歌唱思維的實質性特徵。"},{"english":"Spelling, grammar and factual errors happen - but do they make a material impact on the success of a blogger?","chinese":"但這些錯誤會會對博客造成實質性的影響嗎？"},{"english":"Only then will there be real progress in the battle against cyclones.","chinese":"只有那時，與颶風抗爭的戰鬥才能獲得實質性的進展。"},{"english":"Introducing the optimal amino group into its branched chain, the result of after treatment has been substantially improved.","chinese":"引入最佳的氨基支鏈能使後整理效果有實質性的改進。"},{"english":"The verification has identified material misstatements in the reported emission reductions.","chinese":"覈查對報告的減排發現實質性的誤差。"},{"english":"Or is there real substance to the concept of entrepreneurship?","chinese":"還是創業這個概念裏真的有些實質性內容？"},{"english":"Professor Yang often give practical suggestions to students.","chinese":"楊教授常給學生們一些實質性寶貴建議。"},{"english":"Now let's get to the meaty stuff and write a sample shared object.","chinese":"現在我們來看實質性內容，並編寫一個樣本共享對象。"},{"english":"Such a short stoppage is not expected to have any material impact on production.","chinese":"如此短時期的罷工行動不會對生產造成實質性的影響。"},{"english":"This is tide is being released circle in the air the materiality movement after dragon plans.","chinese":"這是浪潮在發佈翔龍計劃後的實質性動作。"},{"english":"WTO-consistency had to be secured substantively as well.","chinese":"與WTO的一致性還必須獲得實質性的保證。"},{"english":"Objective Analyzing the effectiveness of puncturing biopsy for neck tumor diagnosis.","chinese":"目的分析針刺活檢在頸部實質性腫塊診斷中的作用。"},{"english":"The second constructive system is what gives meaning to the general modulation of the whole piece.","chinese":"可塑性系統使整個建築體塊有了實質性的意義。"}],"related":[{"definition":["to move\/to act\/action\/decision\/conduct\/manner"],"pinyin":["ju3 cuo4"],"word":"舉措"},{"definition":["to make headway\/to make progress"],"pinyin":["jin4 zhan3"],"word":"進展"},{"definition":["specific to a particular stage (of a project etc)\/interim (policy etc)\/occurring in stages\/phased"],"pinyin":["jie1 duan4 xing4"],"word":"階段性"},{"definition":["business model"],"pinyin":["ye4 wu4 mo2 shi4"],"word":"業務模式"},{"definition":["to seek\/to strive for"],"pinyin":["mou2 qiu2"],"word":"謀求"},{"definition":["mechanism"],"pinyin":["ji1 zhi4"],"word":"機制"},{"definition":["to transform\/to change"],"pinyin":["bian4 ge2"],"word":"變革"},{"definition":["state policy"],"pinyin":["guo2 jia1 zheng4 ce4"],"word":"國家政策"},{"definition":["business model"],"pinyin":["shang1 ye4 mo2 shi4"],"word":"商業模式"},{"definition":["to regulate"],"pinyin":["gui1 guan3"],"word":"規管"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["system\/organization"],"pinyin":["ti3 zhi4"],"word":"體制"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"監管"},{"definition":["requirement\/necessary condition (math)"],"pinyin":["bi4 yao4 tiao2 jian4"],"word":"必要條件"},{"definition":["platform\/terrace\/flat-roofed building"],"pinyin":["ping2 tai2"],"word":"平臺"},{"definition":["to put to use\/to apply\/practical\/applied (science, linguistics etc)\/application\/practical use\/(computing) app"],"pinyin":["ying4 yong4"],"word":"應用"}]}