{"definition":["Yongbyon (Ryeongbyeon), site of North Korean nuclear reactor"],"pinyin":["Ning2 bian1"],"simplified":["宁边"],"rank":39834.0,"normalized_rank":0.5573293411498048,"fraction":3.9078210710939243e-7,"cumulative_fraction":0.9964243078094549,"word":"寧邊","characters":[{"definition":["abbr. for Ningxia Hui Autonomous Region 寧夏回族自治區|宁夏回族自治区[Ning2 xia4 Hui2 zu2 Zi4 zhi4 qu1]\/abbr. for Nanjing 南京[Nan2 jing1]\/surname Ning","peaceful\/to pacify\/to visit (one's parents etc)","would rather\/to prefer\/how (emphatic)\/Taiwan pr. [ning2]"],"pinyin":["Ning2","ning2","ning4"],"word":"寧"},{"definition":["side\/edge\/margin\/border\/boundary\/CL:個|个[ge4]\/simultaneously","suffix of a noun of locality"],"pinyin":["bian1","bian5"],"word":"邊"}],"containing_words":[],"sentences":[{"english":"Yongbyon is approximately 60 miles [96 kilometers] north of the capital at Pyongyang.","chinese":"寧邊位於北韓首都平壤以北約96公里處。"},{"english":"The disruption of the Shensi-Kansu-Ningsia Border Region was part of their plot.","chinese":"陝甘寧邊區，是這種陰謀的一部分。"},{"english":"It has also destroyed the cooling tower at its reactor at Yongbyon.","chinese":"北韓還炸燬了寧邊核反應堆的冷卻塔。"},{"english":"North Korea responded by reversing earlier steps it took to disable its primary nuclear facility at Yongbyon.","chinese":"爲此，北韓停止了先前拆除寧邊核設施的工作。"},{"english":"North Korea has been building a light-water reactor at its main Yongbyon nuclear complex since last year.","chinese":"朝鮮自去年起就在寧邊核設施建造一座輕水反應堆。"},{"english":"Before the Anti-Japanese War , there almost had no modern industry in the region.","chinese":"抗戰前陝甘寧邊區幾乎沒有近代工業。"},{"english":"North Korean officials also demolished the cooling tower at the country's Yongbyon nuclear reactor.","chinese":"另外，北韓還炸燬了寧邊核設施的冷卻塔。"},{"english":"North Korea had shut down its nuclear reactor in Yongbyon in July.","chinese":"朝鮮已經在去年七月關閉了其在寧邊的核反應堆。"},{"english":"North Korea's nuclear program began with the installation of a Soviet reactor in Yongbyon.","chinese":"朝鮮的核計劃，始於蘇聯在寧邊建設核反應堆。"}],"related":[]}