{"definition":["to examine sth and make a decision\/to screen\/to evaluate\/to approve"],"pinyin":["shen3 ding4"],"simplified":["审定"],"rank":12387.0,"normalized_rank":0.17331020105494382,"fraction":0.000005810055526731763,"cumulative_fraction":0.9462268633105152,"word":"審定","characters":[{"definition":["to examine\/to investigate\/carefully\/to try (in court)"],"pinyin":["shen3"],"word":"審"},{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"}],"containing_words":[],"sentences":[{"english":"To examine and approve the annual plans of commemorative and special stamps;","chinese":"負責審定紀念郵票和特種郵票年度計劃。"},{"english":"Report the examined and approved qualified suppliers list of this project to company for record.","chinese":"將本項目審定合格的供貨商名單報公司備案。"},{"english":"In charge of organizing and carrying out aero-products' airworthiness certification and management.","chinese":"負責組織實施公司航空產品的適航審定與管理工作。"},{"english":"Second, the re-registration approval, ban or the document establishments.","chinese":"二是重新登記審定，取締無證照經營場所。"},{"english":"The content for inspection in each course will depend on the course syllabi in the department.","chinese":"各科審定內容依本系課程大綱爲準。"},{"english":"And Keyu No. 2 was examined and approved by the cultivar registration committee of Hunan province in 2006.","chinese":"於2006年通過湖南省農作物品種審定委員會審定。"},{"english":"And Keyu No. 2 was examined and approved by the cultivar registration committee of Hunan province in 2006.","chinese":"於2006年通過湖南省農作物品種審定委員會審定。"},{"english":"Early in America, the Science Society of China makes out the plan of censoring terms.","chinese":"早在美國，中國科學社就擬定了科學名詞的審定計劃。"},{"english":"She is also in charge of editing most translation works for the company.","chinese":"負責天語公司大部分中英互譯稿件的終稿審定。"},{"english":"The Chinese shadow boxing is the universal, popularized set pattern after the validation of national Wushu authority.","chinese":"此拳術是經過國家武術權威機構審定的普及推廣套路。"},{"english":"All the record attempts are assessed by adjudicators from the organisation.","chinese":"全部記錄由來自該組織的評判員審定。"},{"english":"The beliefs of history and culture may well be validated and explicated through science.","chinese":"歷史和文化的信仰很可能通過科學的審定和闡述。"},{"english":"In charge of aero-products related airworthiness certification affairs.","chinese":"負責公司航空產品適航審定事務。"},{"english":"The Provincial Department of Personnel is the competent department that examines and determines the qualifications of foreign high-level talented people.","chinese":"省人事廳是審定外國籍高層次人才資格的主管部門。"},{"english":"Gold orchid steal out ZhiXiong razors and toothbrush, please do personally authorized.","chinese":"金蘭偷出智雄的刮鬍刀和牙刷，拜託做親身審定。"},{"english":"A written decision shall be made stating the grounds for rejection, and delivered to the applicant and his trademark agent.","chinese":"並以審定書記載理由，送達申請人或其商標代理人。"}],"related":[{"definition":["revision"],"pinyin":["jiao4 ding4"],"word":"校訂"},{"definition":["to compile and print\/to publish"],"pinyin":["bian1 yin4"],"word":"編印"},{"definition":["to augment\/to supplement\/to add"],"pinyin":["zeng1 bu3"],"word":"增補"},{"definition":["to comment\/a point by point commentary"],"pinyin":["ping2 dian3"],"word":"評點"},{"definition":["collection of seal stamps"],"pinyin":["yin4 pu3"],"word":"印譜"},{"definition":["manuscript of a book"],"pinyin":["shu1 gao3"],"word":"書稿"},{"definition":["to compile"],"pinyin":["bian1 xie3"],"word":"編寫"},{"definition":["to copy\/to transcribe"],"pinyin":["chao1 xie3"],"word":"抄寫"},{"definition":["to annotate\/to add marginal comments on\/criticism\/marginalia"],"pinyin":["pi1 zhu4"],"word":"批註"},{"definition":["seal (esp. of ruler)"],"pinyin":["xi3 yin4"],"word":"璽印"},{"definition":["to adjust one's head and turn one's face (idiom); cosmetic changes\/Despite superficially new policies, the substance remains unchanged."],"pinyin":["gai3 tou2 huan4 mian4"],"word":"改頭換面"},{"definition":["to read through to evaluate\/to referee"],"pinyin":["pi1 yue4"],"word":"批閱"},{"definition":["couplet (hung on the columns of a hall)"],"pinyin":["ying2 lian2"],"word":"楹聯"},{"definition":["a sketch\/rough drawing"],"pinyin":["cao3 tu2"],"word":"草圖"},{"definition":["Chen Yun (1905-1995), communist leader and economist"],"pinyin":["Chen2 Yun2"],"word":"陳雲"},{"definition":["authentic (painting or calligraphy)\/genuine work (of famous artist)"],"pinyin":["zhen1 ji4"],"word":"真跡"}]}