{"definition":["to examine and approve\/to endorse"],"pinyin":["shen3 pi1"],"simplified":["审批"],"rank":2231.0,"normalized_rank":0.03121458452842332,"fraction":0.00006697876855543347,"cumulative_fraction":0.7470671228804412,"word":"審批","characters":[{"definition":["to examine\/to investigate\/carefully\/to try (in court)"],"pinyin":["shen3"],"word":"審"},{"definition":["to ascertain\/to act on\/to criticize\/to pass on\/classifier for batches, lots, military flights\/tier (for the ranking of universities and colleges)"],"pinyin":["pi1"],"word":"批"}],"containing_words":[],"sentences":[{"english":"They might be required information for the approval or rejection decision.","chinese":"他們在決定審批或拒絕時可能需要這些信息。"},{"english":"Replacing thiomersal in vaccines would require regulatory approval.","chinese":"替換疫苗中的硫柳汞還需要管制審批。"},{"english":"Liaising and expediting approval of the quotation with the client.","chinese":"聯繫客戶，並加快對客戶報價的審批。"},{"english":"The Shareholder shall cause the Company to report such appointment to the original examination and approval authority for the record.","chinese":"股東應責成公司將該委任報原審批機關備案。"},{"english":"Such advance studies can greatly expedite regulatory approval.","chinese":"這種預先研究可以大大加快管制審批。"},{"english":"The new US$100 million funding is subject to approval by the World Bank's Board of Directors.","chinese":"1億美元追加資金需經世行董事會審批。"},{"english":"Victor Li said that at present, have all been through the project planning approval.","chinese":"李澤鉅表示，目前項目規劃已經全部通過審批。"},{"english":"Article 21: The establishment of a branch by a company with an investment nature shall be submitted to the Ministry of Commerce for examination and approval.","chinese":"第二十一條投資性公司設立分支機構應報商務部審批。"},{"english":"Today's approval of new drugs in the international community needs to carry out the raw data transmission.","chinese":"如古舊藥的審批須要反在邦際間入行本初數據的傳輸。"},{"english":"Some 200 more are believed to be awaiting approval.","chinese":"據信，還有大約200家機構正等待審批。"},{"english":"Approval of construction of the heliport to go through and above the provincial level government, and military.","chinese":"修建直升機場的審批要經過省級以上政府，以及軍方。"},{"english":"All expenses or applications of expenses have to be approved by the budget holders.","chinese":"所有借支或費用報銷均需由預算控制人審批。"},{"english":"His application has been sent up for approval.","chinese":"他的申請已經送上去審批。"},{"english":"The approver considers and decides whether to reject the loan application or not.","chinese":"由審批人綜合判斷是否應拒絕該申請。"},{"english":"Serious efforts were made to implement Law of Administrative Licensing and deepen the reform of administrative approval system .","chinese":"認真貫徹行政許可法，深化行政審批制度改革。"},{"english":"We will continue to separate government functions from enterprise management, reduce the number of matters requiring administrative examination and approval, and standardize procedures for doing so.","chinese":"繼續推進政企分開，減少和規範行政許可和行政審批。"}],"related":[{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"審查"},{"definition":["to audit\/to investigate thoroughly"],"pinyin":["shen3 he2"],"word":"審核"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"監管"},{"definition":["to apply for sth\/application (form etc)\/CL:份[fen4]"],"pinyin":["shen1 qing3"],"word":"申請"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["to put on record\/to file"],"pinyin":["bei4 an4"],"word":"備案"},{"definition":["to register (one's name)"],"pinyin":["deng1 ji4"],"word":"登記"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落實"},{"definition":["to report (to the authorities)\/to declare (to customs)"],"pinyin":["shen1 bao4"],"word":"申報"},{"definition":["applicant"],"pinyin":["shen1 qing3 ren2"],"word":"申請人"},{"definition":["authorities"],"pinyin":["dang1 ju2"],"word":"當局"},{"definition":["mechanism"],"pinyin":["ji1 zhi4"],"word":"機制"},{"definition":["provision\/to fix\/to set\/to formulate\/to stipulate\/to provide\/regulation\/rule\/CL:個|个[ge4]"],"pinyin":["gui1 ding4"],"word":"規定"},{"definition":["to allow\/to permit"],"pinyin":["xu3 ke3"],"word":"許可"},{"definition":["to examine or inspect\/self-criticism\/review"],"pinyin":["jian3 tao3"],"word":"檢討"},{"definition":["currently existing\/currently available"],"pinyin":["xian4 you3"],"word":"現有"}]}