{"definition":["realism\/realistic portrayal\/realistic\/true to life"],"pinyin":["xie3 shi2"],"simplified":["写实"],"rank":20013.0,"normalized_rank":0.2800078351265513,"fraction":0.0000023897997293566917,"cumulative_fraction":0.9748691342069836,"word":"寫實","characters":[{"definition":["to write"],"pinyin":["xie3"],"word":"寫"},{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"}],"containing_words":[{"definition":["nonrepresentational"],"pinyin":["fei1 xie3 shi2"],"word":"非寫實"}],"sentences":[{"english":"Such realism is useful in the development of automated CCTV systems.","chinese":"這麼寫實的程度，對研發自動閉路電視系統很有益處。"},{"english":"On image, CCP emphasizes abstractness while English verse tries to depict the real world.","chinese":"從意象上講，漢詩強調抽象而英詩注重寫實。"},{"english":"A nonrepresentational style that emphasizes formal values over the representation of subject matter.","chinese":"強調形式至上，無視內容的一種非寫實主義繪畫作風。"},{"english":"This method of \"Realist Abstraction\", was named by Tan Tian as \"Macro-Far\".","chinese":"這種寫實抽象的方法，譚天稱其爲“宏遠”。"},{"english":"The art of chromatic stone carving belongs to the domain of realistic creation. Thus it demands great effort.","chinese":"彩石雕刻藝術屬於寫實創作範疇，所以很喫功力。"},{"english":"The realistic character of modern Chinese was highly strengthened in this process.","chinese":"在這一過程中，現代漢語的寫實性得到加強。"},{"english":"The movie line is a full line. The line for the movie will be broad and have multiple scales.","chinese":"寫實電影線將是一條全方位線，有多種規格的玩具。"},{"english":"The added lens-flare is a detail that also adds to the realism.","chinese":"它所添加的光暈特效也是一個增添了寫實主義的細節。"},{"english":"Advocating truthfulness and realism in writing is the overall characteristic of Zhang Dai's literary works.","chinese":"尚真寫實是張岱文學創作的總體特徵。"},{"english":"TV is a realistic lens art reproduction of real life, with verisimilitude .","chinese":"電視是寫實的鏡頭藝術，再現生活真實，具有逼真性。"},{"english":"Through his realistic paintings Boldis creates a vivid embodiment of classics in modern times.","chinese":"巴爾蒂斯的寫實油畫，集中體現了一種現代的古典性。"},{"english":"It is the most specialized element of language to display to those realism.","chinese":"它也是寫實主義繪畫最善於表現的語言要素。"},{"english":"It was a kind of procedure through self-satisfaction using the ploy of true-life .","chinese":"而是以一種寫實的手法獲得自我滿足的過程。"},{"english":"The color change will give the photo a surreal and mysterious look.","chinese":"色調的更換將給予照片一種神祕超寫實的視感。"},{"english":"A change from surrealistic legends to realistic works.","chinese":"由超現實的傳奇故事向寫實性的“天然圖畫”發展。"},{"english":"Chapter III discusses the affection of New Realism Literature on Film.","chinese":"第三章探討了新寫實文學思潮對電影的影響。"}],"related":[{"definition":["to describe\/to portray"],"pinyin":["miao2 hui4"],"word":"描繪"},{"definition":["(art) composition"],"pinyin":["gou4 tu2"],"word":"構圖"},{"definition":["to portray"],"pinyin":["ke4 hua4"],"word":"刻畫"},{"definition":["line (in drawing, calligraphy etc)\/the lines or contours of a three-dimensional object (hairstyle, clothing, car etc)"],"pinyin":["xian4 tiao2"],"word":"線條"},{"definition":["vivid\/lively"],"pinyin":["sheng1 dong4"],"word":"生動"},{"definition":["scene\/tableau\/picture\/image\/screen (displayed by a computer)\/(motion picture) frame\/field of view"],"pinyin":["hua4 mian4"],"word":"畫面"},{"definition":["subject matter"],"pinyin":["ti2 cai2"],"word":"題材"},{"definition":["to describe\/to depict\/to portray\/description"],"pinyin":["miao2 xie3"],"word":"描寫"},{"definition":["brush stroke in Chinese painting and calligraphy\/brushwork\/style of drawing or writing"],"pinyin":["bi3 chu4"],"word":"筆觸"},{"definition":["style"],"pinyin":["feng1 ge2"],"word":"風格"},{"definition":["exquisite\/meticulous"],"pinyin":["xi4 ni4"],"word":"細膩"},{"definition":["comfortable\/enjoyable\/relaxed","to suggest (rather than depict in detail)\/freehand style of Chinese painting, characterized by bold strokes rather than accurate details"],"pinyin":["xie3 yi4","xie4 yi4"],"word":"寫意"},{"definition":["painting style"],"pinyin":["hua4 feng1"],"word":"畫風"},{"definition":["fine\/meticulous\/careful"],"pinyin":["jing1 xi4"],"word":"精細"},{"definition":["pen and ink\/words\/writing"],"pinyin":["bi3 mo4"],"word":"筆墨"},{"definition":["image\/picture\/graphic"],"pinyin":["tu2 xiang4"],"word":"圖像"}]}