{"definition":["wide-ranging"],"pinyin":["kuan1 fan4"],"simplified":["宽泛"],"rank":22316.0,"normalized_rank":0.31222979306871124,"fraction":0.0000019035482542795956,"cumulative_fraction":0.9797772037578344,"word":"寬泛","characters":[{"definition":["lenient\/wide\/broad","surname Kuan"],"pinyin":["Kuan1","kuan1"],"word":"寬"},{"definition":["to float\/to be suffused with\/general\/extensive\/non-specific\/flood\/pan- (prefix)"],"pinyin":["fan4"],"word":"泛"}],"containing_words":[],"sentences":[{"english":"These ten are broad and even a bit philosophical.","chinese":"這十條貼士很寬泛，甚至有一點偏哲學。"},{"english":"The objectives set out by the resolution seem to me to broader than what is commonly thought. Para.","chinese":"依我看來，決議設定的目標遠比一般人的理解要寬泛。"},{"english":"Further the government defines unlawful content in overbroad and vague terms.","chinese":"此外，政府對非法內容的界定過於寬泛和含糊。"},{"english":"My training is very, very wide.","chinese":"我的訓練領域很寬泛。"},{"english":"That’s a broad statement that any individual or company can make.","chinese":"那是一個寬泛的陳述，任何個人和公司都可以這樣做。"},{"english":"The meaning of a broad friendship is luciferous side of a people all record.","chinese":"寬泛意義的友情是一個人全部履歷的光明面。"},{"english":"What wider impact will this decision have?","chinese":"這個判決將有什麼寬泛的影響？"},{"english":"Its wide coverage and originality are the typical traits.","chinese":"論及範圍寬泛，富於創見性，是這部著作的顯著特點。"},{"english":"A lean award is better than a fat judgment.","chinese":"精到的獎勵比寬泛的判斷好得多。"},{"english":"The subject is so sprawling that my gathering never seemed to be enough.","chinese":"這個題目是如此的寬泛以至於我收集的資料遠遠不夠。"},{"english":"But LIANG's concepts of \"history of learning\" were inaccurate and old-fashioned.","chinese":"但梁氏的“學術史”認定失於寬泛與陳舊。"},{"english":"CTCA provides these options from a wide array of therapies.","chinese":"CTCA提供寬泛的治療組合以供選擇。"},{"english":"Antarctic octopuses eat a wide variety of animals, from clams to fish.","chinese":"南極章魚的食譜寬泛，從蛤蚌到魚類皆來者不拒。"},{"english":"Avoid over-generalized or over-specific category names.","chinese":"避免過於寬泛或者過於特殊的分類名字。"},{"english":"The breadth of Austen's appeal is indeed extraordinary.","chinese":"奧斯丁的感染力着實寬泛。"},{"english":"And those positions live in the wider frame of pluralism.","chinese":"這些立場都存在於多元主義更寬泛的框架之內。"}],"related":[]}