{"definition":["feudal fiefdom\/land held as a vassal in feudal society\/enfeoffment"],"pinyin":["feng1 di4"],"simplified":["封地"],"rank":47071.0,"normalized_rank":0.6585843605277517,"fraction":1.942962213532317e-7,"cumulative_fraction":0.9984665273643918,"word":"封地","characters":[{"definition":["surname Feng","to confer\/to grant\/to bestow a title\/to seal\/classifier for sealed objects, esp. letters"],"pinyin":["Feng1","feng1"],"word":"封"},{"definition":["-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct","earth\/ground\/field\/place\/land\/CL:片[pian4]"],"pinyin":["de5","di4"],"word":"地"}],"containing_words":[{"definition":["Kaifeng prefecture in Henan"],"pinyin":["Kai1 feng1 di4 qu1"],"word":"開封地區"}],"sentences":[{"english":"Shangluo Municipality Perched on the southeast of Shaanxi, historically it was the fiefdom of Sang Yang, a reformer.","chinese":"商洛市位於陝西東南部，是歷史上商鞅的封地。"},{"english":"Rigo had confiscated Robin's ligeance so that he had to move away.","chinese":"他通過宣佈羅賓已經死亡來達到佔有其封地的目的。"},{"english":"The more fiefs Your Lords have the larger army they can have.","chinese":"更封地您上議院有較大的軍隊，他們可以擁有。"},{"english":"That is a fiefdom operated by one person and one of the most corrupt organizations working in India.","chinese":"那就是某人的封地，而它是印度最腐敗的組織之一了。"},{"english":"This had the effect however on turning areas such as Lijiang into small fiefdoms .","chinese":"在麗江這樣的邊遠小封地都是這樣。"},{"english":"And in the Yuan Dynasty, it was the fief of Genghis Khan's descendants.","chinese":"那麼元代的時候啊是成吉思汗子孫的封地。"},{"english":"In another word, the fiefs of the Zhou had no legal authority which the king had to follow.","chinese":"換句話說周的封地沒有讓國王必須跟從的法定權利。"},{"english":"But she loves his money and his lands.","chinese":"她愛的是他的錢和封地。"},{"english":"Fiefdoms need to fall and hierarchies need to give way to hyperlinks.","chinese":"封地會減少，等級制要爲超鏈接讓路。"},{"english":"Once again, Confucius was to be given land, but it did not happen.","chinese":"孔子再一次擁有得到封地的機會，但卻未能實現。"},{"english":"Where is the original feud of the Shang nationality whose ancestor established Shang Dynasty?","chinese":"曾經建立了商朝的商族，其始祖契的始封地究在何處？"},{"english":"Some localities have degenerated into private fiefdoms run by local party officials.","chinese":"一些地方已經淪爲地方黨政官員的私人封地。"},{"english":"YangGuang to yangzhou fief, farewell queen mother queen dugu.","chinese":"楊廣前往揚州封地，辭別母后獨孤皇后。"}],"related":[{"definition":["grant of territory by an emperor or monarch (old)"],"pinyin":["feng1 yi4"],"word":"封邑"},{"definition":["vassal state"],"pinyin":["feng1 guo2"],"word":"封國"},{"definition":["fief\/benefice"],"pinyin":["cai3 yi4"],"word":"採邑"},{"definition":["order of feudal nobility, namely: Duke 公[gong1], Marquis 侯[hou2], Count 伯[bo2], Viscount 子[zi3], Baron 男[nan2]"],"pinyin":["jue2 wei4"],"word":"爵位"},{"definition":["to divide and confer (property on one's descendants)"],"pinyin":["fen1 feng1"],"word":"分封"},{"definition":["to confer a title\/to ennoble\/to knight\/title of nobility"],"pinyin":["feng1 jue2"],"word":"封爵"},{"definition":["to receive fief and title\/to be enfeoffed\/(fig.) to be rewarded by the emperor"],"pinyin":["shou4 feng1"],"word":"受封"},{"definition":["succession\/inheritance\/hereditary"],"pinyin":["shi4 xi2"],"word":"世襲"},{"definition":["official ranking\/titles and honors"],"pinyin":["guan1 jue2"],"word":"官爵"},{"definition":["canton\/county\/region"],"pinyin":["jun4"],"word":"郡"},{"definition":["imperial clan\/member of the imperial clan\/clansman\/ancestral shrine"],"pinyin":["zong1 shi4"],"word":"宗室"},{"definition":["an official position\/a job in the bureaucracy"],"pinyin":["guan1 zhi2"],"word":"官職"},{"definition":["feudatory\/vassal state"],"pinyin":["fan1 guo2"],"word":"藩國"},{"definition":["capital city"],"pinyin":["du1 cheng2"],"word":"都城"},{"definition":["official in feudal court\/subject"],"pinyin":["chen2 shu3"],"word":"臣屬"},{"definition":["feudal vassal\/feudal princes, esp. the monarchs (dukes or princes) of the several vassal states 諸侯國|诸侯国 of Zhou during Western Zhou and Spring and Autumn periods 11th-5th century BC\/subordinate warlord\/local official"],"pinyin":["zhu1 hou2"],"word":"諸侯"}]}