{"definition":["to freeze over (of water or land)"],"pinyin":["feng1 dong4"],"simplified":["封冻"],"rank":38492.0,"normalized_rank":0.5385530200215466,"fraction":4.4304209752596406e-7,"cumulative_fraction":0.9958660441112691,"word":"封凍","characters":[{"definition":["surname Feng","to confer\/to grant\/to bestow a title\/to seal\/classifier for sealed objects, esp. letters"],"pinyin":["Feng1","feng1"],"word":"封"},{"definition":["to freeze\/to feel very cold\/aspic or jelly"],"pinyin":["dong4"],"word":"凍"}],"containing_words":[],"sentences":[{"english":"In short, pigs can fly, and hell really can freeze over.","chinese":"簡單點說，豬也能飛了，地獄也封凍了。"},{"english":"The lake usually ices over by mid-January.","chinese":"這個湖通常到了一月中旬就封凍了。"},{"english":"The accuracy of two-point depth-averaged flow measurement for ice-covered river is investigated.","chinese":"對冬季封凍河道的二點測流法精度進行了理論分析。"},{"english":"The season of continuous melt ends with the first freeze event of the fall.","chinese":"持續的融化一直要持續到秋天封凍期的到來。"},{"english":"The frozen water surface will have to be picked up by hand.","chinese":"封凍水面必須用鶴嘴鋤挖掘。"},{"english":"The Baltic was still frozen in May.","chinese":"波羅的海5月時仍然處在封凍狀態。"},{"english":"That port is iced in during the winter.","chinese":"那個港口一到冬季就會封凍。"},{"english":"At seven, we reached the shore of a small frozen lake.","chinese":"七點鐘，我們到達了一座封凍的小湖岸邊。"},{"english":"The ship was frozen in as the ice thickened.","chinese":"冰結得越來越厚，船被封凍在裏面。"},{"english":"Why the river is not frozen in such cold weathers still a question.","chinese":"爲什麼這條河在這麼冷的天也不封凍還是一個問題。"},{"english":"Lakes of liquid methane on a moon that resembles early Earth in deep freeze.","chinese":"衛星上有着液態沼氣湖，類似早期封凍的地球。"},{"english":"Based on the supplying resources, ground water was considered as the primary resource to the main runoff in the freezing period.","chinese":"封凍期徑流成分按補給來源分主要以地下水補給爲主。"},{"english":"At that time, the frozen period around Beijing was 50 days longer than that at present.","chinese":"當時北京附近的運河封凍期也比現在長50天左右。"},{"english":"In the city the lakes freeze over as well.","chinese":"在市內，大小湖泊也全面封凍了。"}],"related":[]}