{"definition":["to belong or be dedicated exclusively to\/proprietary\/private\/personal"],"pinyin":["zhuan1 shu3"],"simplified":["专属"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"專屬","characters":[{"definition":["for a particular person, occasion, purpose\/focused on one thing\/special\/expert\/particular (to sth)\/concentrated\/specialized"],"pinyin":["zhuan1"],"word":"專"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"}],"containing_words":[{"definition":["exclusive economic zone"],"pinyin":["zhuan1 shu3 jing1 ji4 qu1"],"word":"專屬經濟區"}],"sentences":[{"english":"Lack of specificity for an assay for release may be compensated for by impurities testing.","chinese":"缺少專屬性數據時可用雜質測試的數據來補償。"},{"english":"No more TPBs of the club comics.","chinese":"沒有出版俱樂部專屬漫畫合訂本的計劃。"},{"english":"I began trying to isolate these cancer-specific antigens.","chinese":"於是，我開始嘗試分離這些專屬於癌症的抗原。"},{"english":"The company holds exclusive rights in the intellectual property connected with its goods and services.","chinese":"公司持有貨物和服務知識產權的專屬權。"},{"english":"Results:TLC method has a better separation and specificity.","chinese":"結果薄層色譜分離度較好，專屬性強。"},{"english":"Validation criteria should include specificity, and intermediate precision.","chinese":"驗證項目應當包括專屬性和中間精密度。"},{"english":"It's a little exclusive just because you have to interview to get in.","chinese":"有一點點專屬，因爲要加入還要通過面試。"},{"english":"The provisions on the establishment and administration of special-purpose institutions will be formulated by the CIRC separately.","chinese":"專屬機構的設立和管理，由中國保監會另行規定。"},{"english":"Firms gathered data slowly and patchily, through mechanisms not built for the purpose.","chinese":"企業從非專屬渠道緩慢而零散的收集數據。"},{"english":"The idea that flirtation has become the sole province of females is erroneous;","chinese":"調情行爲的理念已經成爲女性專屬的領域是不正確的。"},{"english":"Manicures and pedicures are for women.","chinese":"修甲是女人的專屬。"},{"english":"It can be used for quality control of Carbamazepine tablets.","chinese":"本法準確可靠，專屬性強，能更好地控制其質量。"},{"english":"Each cycle of magma movement has different characteristics and metallogenic specificity.","chinese":"各旋迴的岩漿運動有著不同的特點和成礦專屬性。"},{"english":"\"Even I don't have my own desk, \" says DeHart.","chinese":"“就連我本人也沒有自己專屬的辦公桌，”德哈特稱。"},{"english":"Every decent technological meltdown deserves its own neologism","chinese":"每一次像樣的技術性崩潰事件都應該有個專屬新詞。"},{"english":"The Connectivity Lounge brings together the convenience of an exclusive mobile office and an atmosphere of complete privacy.","chinese":"互聯中心兼具移動辦公室的便利和專屬環境的幽謐。"}],"related":[{"definition":["unique and unmatched (idiom); unrivalled\/nothing compares with it"],"pinyin":["du2 yi1 wu2 er4"],"word":"獨一無二"},{"definition":["unique\/distinct\/having special characteristics"],"pinyin":["du2 te4"],"word":"獨特"},{"definition":["to own exclusively\/unique to\/specific\/there is only"],"pinyin":["du2 you3"],"word":"獨有"},{"definition":["to act as\/used erroneously for 作為|作为"],"pinyin":["zuo4 wei2"],"word":"做為"},{"definition":["free (of charge)"],"pinyin":["mian3 fei4"],"word":"免費"},{"definition":["to like\/to love\/to be fond of\/favorite"],"pinyin":["xi3 ai4"],"word":"喜愛"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["special\/dedicated"],"pinyin":["zhuan1 yong4"],"word":"專用"},{"definition":["to choose\/to select"],"pinyin":["tiao1 xuan3"],"word":"挑選"},{"definition":["to pass through\/to penetrate\/by means of\/via"],"pinyin":["tou4 guo4"],"word":"透過"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"},{"definition":["brand new"],"pinyin":["zhan3 xin1"],"word":"嶄新"},{"definition":["to stand out from the masses (idiom)"],"pinyin":["yu3 zhong4 bu4 tong2"],"word":"與眾不同"},{"definition":["plan\/design\/to design\/to plan\/CL:個|个[ge4]"],"pinyin":["she4 ji4"],"word":"設計"},{"definition":["cozy\/snug"],"pinyin":["shu1 shi4"],"word":"舒適"},{"definition":["and\/besides\/moreover\/furthermore\/in addition"],"pinyin":["bing4 qie3"],"word":"並且"}]}