{"definition":["expert system"],"pinyin":["zhuan1 jia1 xi4 tong3"],"simplified":["专家系统"],"rank":48275.0,"normalized_rank":0.6754298826130147,"fraction":1.7239957732394188e-7,"cumulative_fraction":0.9986871481691302,"word":"專家系統","characters":[{"definition":["for a particular person, occasion, purpose\/focused on one thing\/special\/expert\/particular (to sth)\/concentrated\/specialized"],"pinyin":["zhuan1"],"word":"專"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"},{"definition":["system\/department\/faculty"],"pinyin":["xi4"],"word":"系"},{"definition":["to gather\/to unite\/to unify\/whole"],"pinyin":["tong3"],"word":"統"}],"containing_words":[],"sentences":[{"english":"This paper introduces the application of second generation expert system in blanking technology ES.","chinese":"介紹了第二代專家系統在衝壓工藝設計中的應用。"},{"english":"The feature expert system which services tolerance analysis and tolerance synthesis is introduced.","chinese":"介紹了一個服務於公差分析與綜合的特徵專家系統。"},{"english":"Expert systems are another name for Classical AI.","chinese":"專家系統是古典人工智能的別稱。"},{"english":"The optimizer is equivalent in function to an expert system.","chinese":"優化器在功能上等價於一個專家系統。"},{"english":"This paper introduces the fault diagnostic expert system that includes system structure, function and self-study capacity for gas generator.","chinese":"建立了一個適用於燃氣輪機的故障診斷專家系統。"},{"english":"In expert system fields, knowledge rules are made up of premises and conclusions.","chinese":"專家系統領域中，知識規則是由前提和結論組成的。"},{"english":"We hope it will do good to develop and maintain ES.","chinese":"這種方法有利於更好地開發和維護專家系統。"},{"english":"A real-time obstacle-avoiding expert system based on a multibeam forward looking sonar is presented.","chinese":"提出了一種基於多波束前視聲納的實時避障專家系統。"},{"english":"In this thesis, an auto-control draft for jigging air-valve based on expert system is researched.","chinese":"本論文研究了基於專家系統的跳汰機風閥的自動控制。"},{"english":"The expert system for vibrating ore-drawing shaft is designed using computer.","chinese":"利用計算機手段設計實現了振動出礦溜井專家系統。"},{"english":"Therefore, an ideal frame is established for cartographic expert system of qualitative information.","chinese":"從而爲定性信息的製圖專家系統建立了一個思維框架。"},{"english":"The real-time expert system consists of two strategies of meta control layer and goal control layer.","chinese":"實時專家系統由元級控制和目標級控制組成。"},{"english":"Is missing the child association to seek the expert system the object-oriented realization.","chinese":"失蹤兒童協尋專家系統的面向對象實現。"},{"english":"This paper introduces YZMES, an expert system for die -cast mould design.","chinese":"壓鑄模設計專家系統YZMES系模塊化結構。"},{"english":"This paper carries out rese. arch in some kinds of learning functions of the design-type expert system.","chinese":"本文着重研究了設計型專家系統的學習功能。"},{"english":"In this paper, the process to develop and apply the expert system for cylindrical building blasting demolition.","chinese":"介紹了筒形建築物爆破拆除專家系統的開發與應用。"}],"related":[]}