{"definition":["special performance"],"pinyin":["zhuan1 chang3"],"simplified":["专场"],"rank":8560.0,"normalized_rank":0.11976550585535795,"fraction":0.00001070862675133762,"cumulative_fraction":0.9161301313368012,"word":"專場","characters":[{"definition":["for a particular person, occasion, purpose\/focused on one thing\/special\/expert\/particular (to sth)\/concentrated\/specialized"],"pinyin":["zhuan1"],"word":"專"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"}],"containing_words":[],"sentences":[{"english":"Theatres put on special shows for children during the Christmas season.","chinese":"聖誕節期間劇院爲兒童舉行專場演出。"},{"english":"The traditional Chinese opera competition begins today with the initial special competition of Qingyi.","chinese":"戲曲擂臺賽今日開擂，首場比賽是青衣專場。"},{"english":"Hold the integrated furred ceiling of sound if having the special performance regiment buy?","chinese":"容聲集成吊頂有沒有專場團購的？"},{"english":"An auction dedicated to master paintings by Zhang Daqian was held by Sotheby's Hong Kong on Tuesday.","chinese":"週二，香港蘇富比拍賣行舉行張大千畫專場拍賣。"},{"english":"The auction last week was the first country's first devoted to cognac.","chinese":"最近這次拍賣會是中國首次干邑白蘭地專場拍賣會。"},{"english":"He had been working in a piggery for 12 months.","chinese":"以前他曾在養豬專場工作過12個月。"},{"english":"I was very young still, but I ran my own night.","chinese":"儘管當時我還很小，但是已經做自己的專場。"},{"english":"Otherwise meaningless stunt too many special, things will be very deviated from the normal track.","chinese":"否則無意義的特技專場太多，就會顯得走火入魔。"}],"related":[]}