{"definition":["honored sir (a person of higher status or seniority, or a Buddhist monk)"],"pinyin":["zun1 zhe3"],"simplified":["尊者"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"尊者","characters":[{"definition":["senior\/of a senior generation\/to honor\/to respect\/honorific\/classifier for cannons and statues\/ancient wine vessel"],"pinyin":["zun1"],"word":"尊"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"One day, the dog fell sick and the donor asked She Li Zhi to recites sutra for it.","chinese":"有一天，母狗生病了，施主請舍利子尊者給它誦經。"},{"english":"The Venerable Ananda could only provide such answer and bid Farwell.","chinese":"尊者阿難只能做這樣的迴應，就告辭了。"},{"english":"This dhamma desana of Than Acharn Maha Boowa is a rare and special one.","chinese":"尊者阿姜摩訶布瓦這次的宣講是稀有罕見特別的一次。"},{"english":"After making this decision, on that very night, he experienced a vision of Vajra Nairatmya.","chinese":"就在已如此決定後的當晚，尊者現見了金剛無我姆。"},{"english":"For the benefit of Krishnapa, he gave the teaching known as \"Vajra Words.\"","chinese":"爲利益前者，尊者傳授了“金剛語”的教法。"},{"english":"You can play the the recording and follow Bhante's recitation in front of Buddha statue to take precepts.","chinese":"播放後自己可以在佛像前跟着尊者念戒，以求得戒體。"},{"english":"Yelu Arhat's disciples had sharp heaven eyes.","chinese":"耶律尊者的弟子天眼銳利。"},{"english":"Every night for six nights, one after another, he attained great realizations.","chinese":"此後連續六夜，尊者得到了殊勝證悟。"},{"english":"Ven. Rahula, bowing down to the Blessed One, sat to one side.","chinese":"尊者羅睺羅向薄伽梵頂禮後，坐於一邊。"},{"english":"At that time venerable Brahmadeva's mother, a Brahmin woman was steadfastly making adoration to Brahma with out stretched arms.","chinese":"五其時，尊者梵天之母婆羅門女，常以供牲供梵天。"},{"english":"Not self-sustaining as the Venerable, superior, and away from employees, from the masses.","chinese":"不能自持爲尊者，高人一等，而遠離員工，脫離羣衆。"},{"english":"Such was the Venerable Acharn's instruction regarding love.","chinese":"這就是尊者阿迦曼有關愛情的開示。"},{"english":"On one occasion Ven. Ananda was staying near Savatthi in Jeta's Grove, Anathapindika's monastery.","chinese":"一時，尊者阿難住在舍衛城附近的祇樹給孤獨精舍。"}],"related":[{"definition":["(honorific appellation of a deity)"],"pinyin":["tian1 zun1"],"word":"天尊"},{"definition":["holy one\/saint"],"pinyin":["sheng4 zhe3"],"word":"聖者"},{"definition":["Nirvana (in Buddhist scripture)\/Lord Brahma (the Hindu Creator)"],"pinyin":["Fan4 tian1"],"word":"梵天"},{"definition":["to keep the law\/to protect Buddha's teachings\/protector of Buddhist law (i.e. temple donor)"],"pinyin":["hu4 fa3"],"word":"護法"},{"definition":["elder\/term of respect for a Buddhist monk"],"pinyin":["zhang3 lao3"],"word":"長老"},{"definition":["Taoist devotee (honorific)"],"pinyin":["dao4 ren2"],"word":"道人"},{"definition":["time immemorial\/origin of the universe\/the world"],"pinyin":["hun4 yuan2"],"word":"混元"},{"definition":["head of a clan\/natural leader\/person of prestige and authority in a domain\/suzerain"],"pinyin":["zong1 zhu3"],"word":"宗主"},{"definition":["title of respect for taoists"],"pinyin":["tai4 shang4"],"word":"太上"},{"definition":["demonic\/devil"],"pinyin":["tian1 mo2"],"word":"天魔"},{"definition":["teacher\/master"],"pinyin":["shi1 zun1"],"word":"師尊"},{"definition":["monster\/devil"],"pinyin":["mo2 tou2"],"word":"魔頭"},{"definition":["Mahayana, the Great Vehicle\/Buddhism based on the Mayahana sutras, as spread to Central Asia, China and beyond\/also pr. [Da4 cheng2]"],"pinyin":["Da4 sheng4"],"word":"大乘"},{"definition":["to die out\/to fade away\/nirvana (Buddhism)"],"pinyin":["ji4 mie4"],"word":"寂滅"},{"definition":["black\/mysterious"],"pinyin":["xuan2"],"word":"玄"},{"definition":["abbr. for 梵教[Fan4 jiao4] Brahmanism\/abbr. for Sanskrit 梵語|梵语[Fan4 yu3] or 梵文[Fan4 wen2]\/abbr. for 梵蒂岡|梵蒂冈[Fan4 di4 gang1], the Vatican"],"pinyin":["Fan4"],"word":"梵"}]}