{"definition":["to address\/to search for address\/to input data into memory"],"pinyin":["xun2 zhi3"],"simplified":["寻址"],"rank":39893.0,"normalized_rank":0.5581548276971724,"fraction":3.888843979601872e-7,"cumulative_fraction":0.9964473070224996,"word":"尋址","characters":[{"definition":["to search\/to look for\/to seek"],"pinyin":["xun2"],"word":"尋"},{"definition":["location\/site"],"pinyin":["zhi3"],"word":"址"}],"containing_words":[{"definition":["addressable (computing)\/accessible via an address"],"pinyin":["ke3 xun2 zhi3"],"word":"可尋址"}],"sentences":[{"english":"No administration capability to control service addressing and naming exists.","chinese":"目前還沒有用於控制服務尋址和命名的管理功能。"},{"english":"There are actually two addressing modes that don't access memory at all.","chinese":"有兩種尋址模式實際上根本就不會訪問內存。"},{"english":"The cache occupies the same addressable memory space as the applications.","chinese":"緩存與應用程序佔用相同的可尋址內存空間。"},{"english":"The new classes allow applications to support one or both of the addressing schemes.","chinese":"新的類允許應用程序支持一種或這兩種尋址方案。"},{"english":"These different ways are called addressing modes.","chinese":"這些不同的方法就稱爲尋址模式。"},{"english":"Wood boxes, searching coding switch, Double FM channels.","chinese":"木質外箱，可尋址解碼開關機，調頻雙通道。"},{"english":"Working on a 32-bit system, you can address 4 GB of memory, out of this 2 GB is typically reserved to the Operating System and 2 GB are allowed for each user mode process, such as w3wp.exe","chinese":"工作在32位系統上，可以尋址4GB內存。"},{"english":"Addressing and flow control are also similar in both layers.","chinese":"在這兩個層上，編址和尋址以及流控制也是類似的。"},{"english":"Components expose services that can be invoked through addressable interfaces.","chinese":"組件公開了可以通過可尋址接口調用的接口。"},{"english":"So dynamic languages effectively add a level of indirection.","chinese":"所以動態語言有效地添加了一級間接尋址。"},{"english":"The most obvious addressing mode for accessing main memory is called direct addressing mode.","chinese":"訪問主存最顯而易見的尋址模式稱爲直接尋址模式。"},{"english":"The most obvious addressing mode for accessing main memory is called direct addressing mode.","chinese":"訪問主存最顯而易見的尋址模式稱爲直接尋址模式。"},{"english":"We will talk about addressable memory later.","chinese":"我們在後面會談到可尋址內存。"},{"english":"The relevant bits are extracted and used as an index to address the LUT.","chinese":"提取相關的位並將其用於尋址LUT的索引。"},{"english":"I also fixed a zero-page protecting bug along with added minor fixes.","chinese":"我還修正了0頁面尋址的BUG和一些小差池。"},{"english":"The use of other addressing modes is covered later in this article.","chinese":"本文後面討論其他尋址模式的使用方法。"}],"related":[]}