{"definition":["homing\/target-seeking (military)"],"pinyin":["xun2 di4"],"simplified":["寻的"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"尋的","characters":[{"definition":["to search\/to look for\/to seek"],"pinyin":["xun2"],"word":"尋"},{"definition":["aim\/clear","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","really and truly","see 的士[di1 shi4]"],"pinyin":["de5","di1","di2","di4"],"word":"的"}],"containing_words":[],"sentences":[{"english":"On the east, your southern boundary will start from the end of the Salt Sea","chinese":"南角要從尋的曠野，貼着以東的邊界。"},{"english":"Bai Zhou is summer dream for future husband.","chinese":"白宙是夏夢尋的未婚夫。"},{"english":"A step-by-step to their own hearts sign of that either.","chinese":"給自己一片步跡可尋的心靈。"},{"english":"We regret the four of the items enquired for in your Fax are unfortunately not available for export.","chinese":"很遺憾，貴方傳真所尋的四項商品均無貨可供。"},{"english":"They left Ezion Geber and camped at Kadesh, in the Desert of Zin.","chinese":"從以旬迦別起行，安營在尋的曠野，就是加低斯。"},{"english":"So they went up, and searched the land from the wilderness of Zin unto Rehob, as men come to Hamath.","chinese":"他們上去窺探那地，從尋的曠野到利合，直到哈馬口。"},{"english":"So they went up， and searched the land from the wilderness of Zin unto Rehob， as men come to Hamath.","chinese":"他們上去窺探那地，從尋的曠野到利合，直到哈馬口。"},{"english":"And they removed from Eziongaber， and pitched in the wilderness of Zin， which is Kadesh.","chinese":"從以旬迦別起行，安營在尋的曠野，就是加低斯。"},{"english":"That, at least, is what American history suggests.","chinese":"至少，這在美國曆史上是有跡可尋的。"},{"english":"These were the waters of Meribah Kadesh, in the Desert of Zin.","chinese":"這水，就是尋的曠野加低斯米利巴水。"},{"english":"Use a variety of weapons, from lasers to fireballs, homing missiles and bombs.","chinese":"使用各種武器，從激光器火球，尋的導彈和炸彈。"}],"related":[]}