{"definition":["(of two performers) to speak or sing alternately\/to be fit for the purposes of a job or task\/(of food) to suit sb's taste"],"pinyin":["dui4 kou3"],"simplified":["对口"],"rank":10973.0,"normalized_rank":0.15352650651294894,"fraction":0.000007090717247191493,"cumulative_fraction":0.937155948752598,"word":"對口","characters":[{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["mouth\/classifier for things with mouths (people, domestic animals, cannons, wells etc)\/classifier for bites or mouthfuls"],"pinyin":["kou3"],"word":"口"}],"containing_words":[{"definition":["lip synching"],"pinyin":["dui4 kou3 xing2"],"word":"對口型"},{"definition":["comic crosstalk\/formalized comic dialogue between two stand-up comics: funny man 逗哏[dou4 gen2] and straight man 捧哏[peng3 gen2]"],"pinyin":["dui4 kou3 xiang4 sheng1"],"word":"對口相聲"},{"definition":["dialogue (for stage performance)"],"pinyin":["dui4 kou3 ci2"],"word":"對口詞"},{"definition":["to arrange to give the same story"],"pinyin":["dui4 kou3 jing4"],"word":"對口徑"}],"sentences":[{"english":"You can often save a person's life by breathing into his mouth.","chinese":"採用口對口呼吸常能搶救一個人的生命。"},{"english":"He remembered learning mouth-to-mouth resuscitation in a scuba diving course years before.","chinese":"他想起幾年前在潛水課上學的口對口人工呼吸。"},{"english":"The lifeguard used mouth-to-mouth resuscitation to save the child's life.","chinese":"救護員使用了口對口人工呼吸法來挽救那孩子的生命。"},{"english":"Objective To discuss the curative effect of contradrainage and thread drawing method to treat high anal horseshoe fistula (HAHS).","chinese":"目的探討對口引流掛線在治療高位馬蹄瘻的效果。"},{"english":"Lip- synching happens all the time in performances.","chinese":"對口型在表演中很常見。"},{"english":"I have nothing noteworthy and my job had nothing to do with my major.","chinese":"我沒有什麼引人注目的成就，工作又和專業不對口。"},{"english":"The waiters mime to records playing on the jukebox.","chinese":"侍者們配合自動唱機裏播放的唱片對口型假唱。"},{"english":"Have you find any job that you are interested in?","chinese":"我只找到幾個職位與我的專業對口。"},{"english":"The rhymed dialogue between the two performers is very interesting.","chinese":"這兩個人說的對口詞真有意思。"},{"english":"Stand-up comedy is very popular with the public.","chinese":"對口相聲是深受人們喜愛的表演形式。"},{"english":"My favourite band were on TV last night but they just lip-synced the songs.","chinese":"我喜歡的樂隊在昨晚電視節目上對口型演唱。"},{"english":"This job does not match my specialty.","chinese":"這個工作與我的專業不對口。"},{"english":"I must try to start his breathing at once by using the mouth-to-mouth way.","chinese":"我必須立即用口對口吹氣的方法給他做人工呼吸。"},{"english":"The Shanghai public security condolences go to Dujiangyan to support the police force, I visit them with the CPPCC delegation.","chinese":"隨政協代表團，慰問上海公安赴都江堰對口支援警隊。"},{"english":"In the afternoon, Chinese business representatives hold match-making conferences with Venezuela counterparts.","chinese":"下午，中國企業代表與委方代表進行了對口洽談。"},{"english":"Some of those candidates are going to have exactly the industry experience they're looking for.","chinese":"而且，從業經驗與招聘職位對口的求職者也不乏其人。"}],"related":[{"definition":["specialty\/specialized field\/main field of study (at university)\/major\/CL:門|门[men2],個|个[ge4]\/professional"],"pinyin":["zhuan1 ye4"],"word":"專業"},{"definition":["to establish (a unit or department)\/staffing structure (excluding temporary and casual staff)"],"pinyin":["bian1 zhi4"],"word":"編制"},{"definition":["an overall plan\/to plan an entire project as a whole"],"pinyin":["tong3 chou2"],"word":"統籌"},{"definition":["to cultivate\/to train\/to groom\/training"],"pinyin":["pei2 xun4"],"word":"培訓"},{"definition":["specialized subject\/branch (of medicine)\/specialized training school"],"pinyin":["zhuan1 ke1"],"word":"專科"},{"definition":["to launch\/to develop\/to unfold\/(of an exhibition etc) to open"],"pinyin":["kai1 zhan3"],"word":"開展"},{"definition":["item\/project\/(sports) event\/CL:個|个[ge4]"],"pinyin":["xiang4 mu4"],"word":"項目"},{"definition":["teaching and administrative staff"],"pinyin":["jiao4 zhi2 gong1"],"word":"教職工"},{"definition":["to practice\/field work\/to intern\/internship"],"pinyin":["shi2 xi2"],"word":"實習"},{"definition":["lead\/leading\/to lead\/leadership\/leader\/CL:位[wei4],個|个[ge4]"],"pinyin":["ling3 dao3"],"word":"領導"},{"definition":["to organize\/organization\/(biology) tissue\/(textiles) weave\/CL:個|个[ge4]"],"pinyin":["zu3 zhi1"],"word":"組織"},{"definition":["investment promotion"],"pinyin":["zhao1 shang1 yin3 zi1"],"word":"招商引資"},{"definition":["expert (in a field)"],"pinyin":["zhuan1 ye4 ren2 cai2"],"word":"專業人才"},{"definition":["labor force\/manpower"],"pinyin":["lao2 dong4 li4"],"word":"勞動力"},{"definition":["to coordinate\/to harmonize\/to fit together\/to match (colors etc)\/harmonious\/concerted"],"pinyin":["xie2 tiao2"],"word":"協調"},{"definition":["to plan (how to do sth)\/planning\/plan\/program"],"pinyin":["gui1 hua4"],"word":"規劃"}]}