{"definition":["Ministry of Foreign Trade and Economic Cooperation (MOFTEC)"],"pinyin":["Dui4 wai4 Mao4 yi4 Jing1 ji4 He2 zuo4 bu4"],"simplified":["对外贸易经济合作部"],"rank":50170.0,"normalized_rank":0.7019433912106671,"fraction":1.4130634280235035e-7,"cumulative_fraction":0.9989842384778316,"word":"對外貿易經濟合作部","characters":[{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["outside\/in addition\/foreign\/external"],"pinyin":["wai4"],"word":"外"},{"definition":["commerce\/trade"],"pinyin":["mao4"],"word":"貿"},{"definition":["easy\/amiable\/to change\/to exchange\/prefix corresponding to the English adjective suffix \"-able\" or \"-ible\"","surname Yi\/abbr. for 易經|易经[Yi4 jing1], the Book of Changes"],"pinyin":["Yi4","yi4"],"word":"易"},{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["Jing1","jing1"],"word":"經"},{"definition":["only used in 濟濟|济济[ji3 ji3]","to cross a river\/to aid or relieve\/to be of help","used in place names associated with the Ji River 濟水|济水[Ji3 Shui3]\/surname Ji"],"pinyin":["Ji3","ji3","ji4"],"word":"濟"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["to do\/to grow\/to write or compose\/to pretend\/to regard as\/to feel\/writings or works","worker\/workshop\/(slang) troublesome\/high-maintenance (person)"],"pinyin":["zuo1","zuo4"],"word":"作"},{"definition":["ministry\/department\/section\/part\/division\/troops\/board\/classifier for works of literature, films, machines etc"],"pinyin":["bu4"],"word":"部"}],"containing_words":[],"sentences":[{"english":"Upon approval, MOFTEC shall issue a certificate of approval thereof.","chinese":"批准後，由對外貿易經濟合作部發給批准證書。"},{"english":"MOFTEC shall decide within 45 days on approval or rejection.","chinese":"對外貿易經濟合作部在45日內決定批准或不批准。"}],"related":[]}