{"definition":["internal\/national\/domestic (policy)"],"pinyin":["dui4 nei4"],"simplified":["对内"],"rank":14840.0,"normalized_rank":0.2076308536090552,"fraction":0.000004222840789861974,"cumulative_fraction":0.9583635198460696,"word":"對內","characters":[{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["inside\/inner\/internal\/within\/interior"],"pinyin":["nei4"],"word":"內"}],"containing_words":[],"sentences":[{"english":"Under this peace-seeking policy, internally, it resolutely defends national unification and oppose any intention of seperation.","chinese":"對內主張堅決維護民族統一，反對國家分裂。"},{"english":"Bayern Munich team manager Uli Hoeness has revealed the club are set to sell a number of their players in January.","chinese":"拜仁經理霍胖已透露將在明年一月賣出對內一些球員。"},{"english":"And establishes a prosperous and harmonious society in our country.","chinese":"對內建設繁榮和諧社會。"},{"english":"The present research explored the interrelation of implicit learning and explicit learning.","chinese":"對內隱與外顯學習過程的相互作用進行了探討。"},{"english":"He will then discuss the value of the Hong Kong market to these Chinese listed firms.","chinese":"此外，他將探討香港巿場對內地上巿公司的價值。"},{"english":"We attend a sneak preview of the winter fashion collection.","chinese":"我們參觀了一次對內的冬季試裝預展。"},{"english":"In particular, it gave a free hand to internal trade, instead of monopolizing it.","chinese":"對內尤不能壟斷，而應採取貿易自由的辦法。"},{"english":"Harmonious psyche is a kind of sound social psychologies that internally being coordinate and externally being adaptive.","chinese":"和諧心理是一種對內協調和對外適應的健康社會心態。"},{"english":"There are internal and external validity and effectiveness of untruthful joint and several debt.","chinese":"不真正連帶債務分爲對內效力和對外效力。"},{"english":"Analyses the internal gear tooth profile by using conjugate outline's meshing theory.","chinese":"利用共軛齒廓的齧合理論對內齒輪進行了齒形分析。"},{"english":"I feel there is a problem with China's PR policy, internally too rigid, externally too soft.","chinese":"我覺得還是黨媽的宣傳有問題，對內嚴對外松。"},{"english":"In the meantime, busy also move pacifies 9 cities internally employee group.","chinese":"同時，九城也忙着對內安撫員工團隊。"},{"english":"They attended a sneak preview of the winter fashion collection.","chinese":"他們參觀了一次對內的冬季時裝預展。"},{"english":"PCH \"hedges\" the outer-loop in order to prevent adaptation to inner-loop dynamics.","chinese":"限制外迴路以阻止對內迴路動態特性的調整。"},{"english":"Give technical training internally and externally, product evangelizing as well.","chinese":"對內和對客戶給予技術和產品方面的培訓。"},{"english":"To invigorate the domestic economy, WE began with the countryside.","chinese":"對內經濟搞活，首先從農村着手。"}],"related":[{"definition":["long-term\/long-range"],"pinyin":["chang2 yuan3"],"word":"長遠"},{"definition":["external\/foreign\/pertaining to external or foreign (affairs)"],"pinyin":["dui4 wai4"],"word":"對外"},{"definition":["financial market"],"pinyin":["jin1 rong2 shi4 chang3"],"word":"金融市場"},{"definition":["no doubt\/undoubtedly"],"pinyin":["wu2 yi2"],"word":"無疑"},{"definition":["one step further\/to move forward a step\/further onwards"],"pinyin":["jin4 yi1 bu4"],"word":"進一步"},{"definition":["hidden\/potential\/latent"],"pinyin":["qian2 zai4"],"word":"潛在"},{"definition":["capital market"],"pinyin":["zi1 ben3 shi4 chang3"],"word":"資本市場"},{"definition":["investor"],"pinyin":["tou2 zi1 zhe3"],"word":"投資者"},{"definition":["mechanism"],"pinyin":["ji1 zhi4"],"word":"機制"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"},{"definition":["economic development"],"pinyin":["jing1 ji4 fa1 zhan3"],"word":"經濟發展"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"監管"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["inland\/interior\/hinterland","mainland China (PRC excluding Hong Kong and Macau, but including islands such as Hainan)\/Japan (used in Taiwan during Japanese colonization)"],"pinyin":["Nei4 di4","nei4 di4"],"word":"內地"},{"definition":["marketplace\/market (also in abstract)"],"pinyin":["shi4 chang3"],"word":"市場"},{"definition":["to consolidate\/consolidation\/to strengthen"],"pinyin":["gong3 gu4"],"word":"鞏固"}]}