{"definition":["external\/foreign\/pertaining to external or foreign (affairs)"],"pinyin":["dui4 wai4"],"simplified":["对外"],"rank":1633.0,"normalized_rank":0.022847788675443875,"fraction":0.00009731116768582064,"cumulative_fraction":0.6987973542558871,"word":"對外","characters":[{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["outside\/in addition\/foreign\/external"],"pinyin":["wai4"],"word":"外"}],"containing_words":[{"definition":["Ministry of Foreign Trade and Economic Cooperation (MOFTEC)"],"pinyin":["Dui4 wai4 Mao4 yi4 Jing1 ji4 He2 zuo4 bu4"],"word":"對外貿易經濟合作部"},{"definition":["Chinese People's Association for Friendship with Foreign Countries (CPAFFC)"],"pinyin":["Zhong1 guo2 Ren2 min2 Dui4 wai4 You3 hao3 Xie2 hui4"],"word":"中國人民對外友好協會"},{"definition":["foreign policy"],"pinyin":["dui4 wai4 zheng4 ce4"],"word":"對外政策"},{"definition":["University of International Business and Economics"],"pinyin":["Dui4 wai4 Jing1 ji4 Mao4 yi4 Da4 xue2"],"word":"對外經濟貿易大學"},{"definition":["CCP central committee's external affairs department (i.e. Chinese communist party's foreign office)"],"pinyin":["dui4 wai4 lian2 luo4 bu4"],"word":"對外聯絡部"},{"definition":["foreign trade"],"pinyin":["dui4 wai4 mao4 yi4"],"word":"對外貿易"},{"definition":["foreign relations"],"pinyin":["dui4 wai4 guan1 xi4"],"word":"對外關係"}],"sentences":[{"english":"In opening wider to the outside world, we must pay great attention to safeguarding our national economic security.","chinese":"在擴大對外開放中，要十分注意維護國家經濟安全。"},{"english":"The part of 3th discusses the role of the theory of comparative advantage for Chinese foreign trade .","chinese":"第三部分論述了比較優勢理論對中國對外貿易的作用。"},{"english":"Moreover, it is one of the locations opening to the outside world on the Liaodong Peninsula.","chinese":"同時，它也是遼東半島對外開放的窗口之一。"},{"english":"The enterprises that have real transactions and need to pay foreign exchange to the outside shall be allowed to purchase foreign exchanges in advance.","chinese":"允許有真實交易背景需對外支付的企業提前購匯。"},{"english":"Let's look at China's history. Does China have the tradition and culture of aggression and expansion?","chinese":"歷史地看，中國有對外侵略擴張的傳統和文化嗎？"},{"english":"IX. The International Situation and Our External Work.","chinese":"國際形勢和對外工作。"},{"english":"We will promote the coordinated development of overseas Chinese investment and the utilization of foreign capital in China.","chinese":"推動對外投資和利用外資協調發展。"},{"english":"The war brought all foreign trade to a standstill .","chinese":"戰爭使所有的對外貿易停頓下來了。"},{"english":"This paper examines the theory by analyzing the practices of German foreign policy.","chinese":"本文通過分析德國對外政策的實踐評介了這一理論。"},{"english":"Lu'anzhou port under construction will be the largest gateway to the outside world of Changzhou.","chinese":"在建的常州錄安洲港，是常州最大的對外開放門戶。"},{"english":"He says his accusers are trying to discredit government foreign-aid policies.","chinese":"他說他的責難者試圖使政府的對外援助政策名聲掃地。"},{"english":"Article 67 The State encourages foreign exchange and cooperation in education.","chinese":"第六十七條國家鼓勵開展教育對外交流與合作。"},{"english":"Our company situates in Shenzhen for foreign business contact.","chinese":"公司設在深圳市，負責對外業務聯繫。"},{"english":"Fourthly, to break the blockade from the all-round opening up.","chinese":"第四，從打破封鎖到全方位對外開放。"},{"english":"Industry and trade with foreign countries became prosperous, woolen cloth was on sale in European countries.","chinese":"城市手工業和對外貿易都相當繁盛，呢絨行銷歐洲。"},{"english":"Did you know that one company is making external airbags for helicopters and rotorcraft ?","chinese":"你可知道，一個公司對外氣袋直升機和旋翼？"}],"related":[{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["active\/energetic\/vigorous\/positive (outlook)\/proactive"],"pinyin":["ji1 ji2"],"word":"積極"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"},{"definition":["to expand\/to enlarge\/to broaden one's scope"],"pinyin":["kuo4 da4"],"word":"擴大"},{"definition":["to bloom\/to open\/to be open (to the public)\/to open up (to the outside)\/to be open-minded\/unrestrained by convention\/unconstrained in one's sexuality"],"pinyin":["kai1 fang4"],"word":"開放"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["not only (this one)\/not just (...) but also"],"pinyin":["bu4 jin3"],"word":"不僅"},{"definition":["one step further\/to move forward a step\/further onwards"],"pinyin":["jin4 yi1 bu4"],"word":"進一步"},{"definition":["investment\/to invest"],"pinyin":["tou2 zi1"],"word":"投資"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["country\/nation\/state\/CL:個|个[ge4]"],"pinyin":["guo2 jia1"],"word":"國家"},{"definition":["economy\/economic"],"pinyin":["jing1 ji4"],"word":"經濟"},{"definition":["to set up\/to establish"],"pinyin":["she4 li4"],"word":"設立"},{"definition":["to pass through\/to penetrate\/by means of\/via"],"pinyin":["tou4 guo4"],"word":"透過"},{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"實行"}]}