{"definition":["antagonistic"],"pinyin":["dui4 kang4 xing4"],"simplified":["对抗性"],"rank":26709.0,"normalized_rank":0.3736935626040603,"fraction":0.0000012675237340421569,"cumulative_fraction":0.986634726709358,"word":"對抗性","characters":[{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["to resist\/to fight\/to defy\/anti-"],"pinyin":["kang4"],"word":"抗"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"Discuss the effectiveness of sexual abstinence programs in the fight against STDS.","chinese":"討論在對抗性傳播疾病中節制性活動的效力。"},{"english":"Avoid confrontational behaviour or high- pressure tactics.","chinese":"力戒對抗性的舉動或高壓策略。"},{"english":"Crystal, likes to play challenging games in lady doubles, and mixed doubles.","chinese":"喜歡打有對抗性的女雙，混雙。"},{"english":"Discuss the non-resistance Policy in the \"September Eighteenth Incident\";","chinese":"南非報紙批評美國對抗性外交政策。"},{"english":"Sanshou is one of the antagonistic events in, Wushu. Fighting is its intrinsic quality.","chinese":"散手是武術對抗性項目之一，技擊是武術的本質屬性。"},{"english":"This paper talks about the related problems with resistant term sports training through the net.","chinese":"本文對隔網對抗性項羣運動訓練的相關問題加以論析。"},{"english":"How do you respond to India's possible confrontational measures?","chinese":"印度可能對此採取對抗性措施，中方有何迴應？"},{"english":"Without opposable thumbs, or even fingers.","chinese":"無對抗性豎起大拇指，甚至手指。"},{"english":"I want to play competitive basketball this year.","chinese":"今年我想要打對抗性強烈的球賽。"}],"related":[]}