{"definition":["to be the mirror image of sth\/enantiomorphic\/antipodal\/enantiomeric (chemistry)"],"pinyin":["dui4 ying4"],"simplified":["对映"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"對映","characters":[{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["to reflect (light)\/to shine\/to project (an image onto a screen etc)"],"pinyin":["ying4"],"word":"映"}],"containing_words":[{"definition":["enantiomeric isomerism (chemistry)"],"pinyin":["dui4 ying4 yi4 gou4"],"word":"對映異構"},{"definition":["enantiomeric isomer (chemistry)"],"pinyin":["dui4 ying4 yi4 gou4 ti3"],"word":"對映異構體"},{"definition":["enantiomer (chemistry)"],"pinyin":["dui4 ying4 ti3"],"word":"對映體"}],"sentences":[{"english":"The present invention concerns enantioselective preparation of sulphoxide derivatives or their salts.","chinese":"本發明涉及亞碸衍生物或其鹽的對映選擇性製備。"},{"english":"The partially separation of benzoin and dansyl-amino acids were also achieved.","chinese":"對安息香和氨基酸衍生物對映異構體能部分分離。"},{"english":"Such molecules are known as enantiomorphs or optical isomers .","chinese":"這種分子被稱爲對映結構體或旋光異物體。"},{"english":"Furthermore, the conditions of well in which anomalies were recorded and mechanism of teleseismic effect are discussed.","chinese":"並對映震井孔的條件，遠震效應的機理進行了探討。"},{"english":"OBJECTIVE To discuss the research and control of diastereoisomeric impurities in synthetic peptide drugs development.","chinese":"目的探討多肽合成中非對映異構體雜質的研究和控制。"},{"english":"The binary operations in that ring have as domain ordered pairs of functions, and as codomain functions.","chinese":"因此定義域和對映域是函數一開始就確定的強制約束。"},{"english":"Furthermore, we discovered the recrystallization solvent for separation of the diastereomer.","chinese":"發現了分離非對映異構體的重結晶溶劑。"},{"english":"The position of bromo atoms has definite influence on the sulfoxidation of enantioselectivity.","chinese":"溴原子所在的位置對反應的對映選擇性有一定影響。"}],"related":[]}