{"definition":["(a return) equal to the capital\/100 percent profit"],"pinyin":["dui4 ben3"],"simplified":["对本"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"對本","characters":[{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"}],"containing_words":[],"sentences":[{"english":"Just your thoughts on qualifying and the race this weekend.","chinese":"你們對本週末排位賽跟比賽的想法。"},{"english":"Then do a short sum-up and prospect to this paper.","chinese":"對本論文的後續研究作了相應的總結和展望。"},{"english":"Thus it shows that the coexistence theory of slag structure is applicable to slag system Na2O-SiO2 too.","chinese":"由此證明爐渣結構的共存理論對本渣系也是適用的。"},{"english":"Be responsible for the costs of own workshop.","chinese":"對本車間成本負責。"},{"english":"Make a systemic study on the ostracode fossils which collected from the section.","chinese":"對本剖面所獲得的介形蟲化石進行了系統的研究。"},{"english":"You may not sublicense the Work.","chinese":"您不能對本著作爲再授權。"},{"english":"The right for final interpretation of the rules of this event is reserved to the Publicity Department of the CPC Jiangmen Municipal Committee.","chinese":"中共江門市委宣傳部對本活動規則有最終解釋權。"},{"english":"The practical operation also shows that the technical improvements on the SVS are successful.","chinese":"運行情況表明，對本裝置的技術改進是成功的。"},{"english":"Our company reserves right of final interpretation of this solicitation.","chinese":"我公司對本徵集活動保留最終解釋權。"},{"english":"Methods The TLC method was used to distinguish the Radix Notoginseng and the Radix Aucklandiae in this prescription.","chinese":"方法採用TLC對本處方中的三七和木香進行鑑別。"},{"english":"These Terms of Use may be amended by FanE [ TransChina ] at any time.","chinese":"翻譯中國可以隨時對本使用條款進行修改。"},{"english":"These Terms of Use may be amended by FanE. cn at any time.","chinese":"翻譯中國可以隨時對本使用條款進行修改。"},{"english":"We hold the final explanation right of this general condition.","chinese":"我方對本條款有最終解釋權。"},{"english":"Under the high pressure, kindergarten teachers have the psychology of betraying the occupation.","chinese":"高壓力之下，幼兒教師對本職業有心理叛逃的現象。"},{"english":"To accelerate regional economic integration is of great and practical significance to this region.","chinese":"加快區域經濟一體化對本地區具有重要現實意義。"},{"english":"Addition's Internation's Standards may be added to the series in the future.","chinese":"異日還能夠對本系列法式增加若干項國際法式。"}],"related":[]}