{"definition":["able to reply quickly and fluently (idiom); having a ready answer"],"pinyin":["dui4 da2 ru2 liu2"],"simplified":["对答如流"],"rank":43317.0,"normalized_rank":0.6060610300393156,"fraction":2.8129888696294326e-7,"cumulative_fraction":0.9975833665172972,"word":"對答如流","characters":[{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["reply\/answer\/return\/respond\/echo","to answer\/to agree"],"pinyin":["da1","da2"],"word":"答"},{"definition":["as\/as if\/such as"],"pinyin":["ru2"],"word":"如"},{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"}],"containing_words":[],"sentences":[{"english":"Little Tom could always answer up to every question.","chinese":"小湯姆對每個問題往往都能對答如流。"},{"english":"Others can use fluent, playing from the heart envy.","chinese":"旁人能用英語對答如流，打從心底非常羨慕。"},{"english":"Professor Wang can think on his feet; he always has an answer ready when we ask him questions.","chinese":"王教授思維敏捷，我們向他提問時，他總能對答如流。"},{"english":"Sorry, I can not speak Thai. Can you speak English?","chinese":"他對我講泰語，如果我也能對答如流多好啊。"},{"english":"The little boy could always answer up to every question.","chinese":"那小男孩對每個問題往往能對答如流。"},{"english":"The little boy answered up to all the questions except two.","chinese":"除了兩個問題外，這個孩子對答如流。"},{"english":"No matter how the reporters heckled him the speaker always had an answer to come back with.","chinese":"不論記者如何詰問，發言人總能對答如流。"},{"english":"All the candidates are able to answer the questions without any hitch.","chinese":"所有報考者都能對答如流。"}],"related":[]}