{"definition":["(policy etc) towards China"],"pinyin":["dui4 Hua2"],"simplified":["对华"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"對華","characters":[{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["Mt Hua 華山|华山 in Shaanxi\/surname Hua","abbr. for China","magnificent\/splendid\/flowery","old variant of 花[hua1]\/flower"],"pinyin":["Hua2","Hua4","hua1","hua2"],"word":"華"}],"containing_words":[],"sentences":[{"english":"Karamanlis said that Greece attaches great importance to developing relations with China.","chinese":"卡拉曼利斯說，希方重視發展對華關係。"},{"english":"Both R3 and R4 had no significant effect on enhancing the growth and differentiation of D.","chinese":"R3和R4對華石斛生長和分化無明顯的促進效果。"},{"english":"Argentina's trade balance with China swung into a deficit in 2008.","chinese":"阿根廷對華貿易差額在2008年轉爲逆差。"},{"english":"This week, he also got tough on trade with China.","chinese":"本週，他也採取了強硬的對華貿易政策。"},{"english":"What adjustment do you think the new UK Government will make to UK-China relations?","chinese":"你認爲新政府將在哪些方面調整對華關係？"},{"english":"In this context they discussed the issue of the EU arms embargo against China.","chinese":"在此背景下，雙方討論了歐盟對華軍售禁令問題。"},{"english":"This is not a time to let paranoia chart the course for U.S. policy toward China.","chinese":"現在決不能讓偏執觀念左右美國的對華政策。"},{"english":"Kaparo said to actively develop relations with China is Kenya's persistent position.","chinese":"卡帕羅說，積極發展對華關係是肯方的一貫立場。"},{"english":"The EU attaches great importance to developing relations with China and China will respond to EU's initiatives.","chinese":"歐盟重視發展對華關係，中方願對此作出積極響應。"},{"english":"Bross says American mistrust of Huawei eventually will go away.","chinese":"布羅斯說美國對華爲的不信任最終將會不復存在。"},{"english":"Ideological War is a major component of Japan's all-round war against China.","chinese":"“思想戰”是日本對華“總體戰”的重要組成部分。"},{"english":"S. America sold $92 billion in goods and services to China last year.","chinese":"去年，美國對華商品和服務銷售總額達920億美元。"},{"english":"My mother, who does not tweet, also remarked on Watson’s speed.","chinese":"我不會發推的媽媽也對華生的速度記憶猶新。"},{"english":"This is America's 2010 \"double inverse\" survey first.","chinese":"這是2010年美國對華“雙反”調查第一案。"},{"english":"Senator Kyl has been Huawei’s most vocal critic in Washington.","chinese":"參議員凱爾在華盛頓對華爲的批評最爲激烈。"},{"english":"China- bashers have introduced a dozen bills in the new Congress.","chinese":"“對華強硬派”議員已經向國會提交了十二分議案。"}],"related":[]}