{"definition":["across\/opposite\/the other side"],"pinyin":["dui4 guo4"],"simplified":["对过"],"rank":37264.0,"normalized_rank":0.5213717067983714,"fraction":4.944262221813643e-7,"cumulative_fraction":0.995289881220389,"word":"對過","characters":[{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"}],"containing_words":[],"sentences":[{"english":"Though never rebellious, he sometimes bristled at being given too many directions.","chinese":"雖然從不叛逆，但有時，他會對過多的命令發怒。"},{"english":"He indicingestedd the bar down the street when I asked where his father was.","chinese":"我問他爸爸在哪裏的時候他指了指街道對過的酒吧。"},{"english":"This feature eliminates the need for a separate temperature sensor for over-temperature monitoring.","chinese":"此功能消除了對過單獨的溫度傳感器溫度監測的需要。"},{"english":"I am here, not over there.","chinese":"我在這裏，不在那對過。"},{"english":"The fundamental problem with 50-year political predictions is that virtually no-one gets them right.","chinese":"50年政治預測根本的問題是，幾乎沒人說對過。"},{"english":"Is the new building across the street for commercial use?","chinese":"街道對過那幢新樓是商用樓嗎？"},{"english":"As a primary purpose, the effect of angle of attack and height of spoiler on the unsteady flows are investigated.","chinese":"着重探討了來流攻角和擾流片高度對過沖量的影響。"},{"english":"I think so, I set it by the radio this morning.","chinese":"我想是準的，今天早上我把表跟收音機的報時對過了。"},{"english":"Will you do me the favor of moving this couch to the other side of the room?","chinese":"你願幫我把這張長沙發移到房子對過的那一邊嗎？"},{"english":"The bus stop is just across the street.","chinese":"公共汽車站就在街對過。"}],"related":[]}