{"definition":["poised for battle\/to square up for a fight"],"pinyin":["dui4 zhen4"],"simplified":["对阵"],"rank":4049.0,"normalized_rank":0.056650763225273876,"fraction":0.00003269344126725205,"cumulative_fraction":0.832260537111543,"word":"對陣","characters":[{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["disposition of troops\/wave\/spate\/burst\/spell\/short period of time\/classifier for events or states of short duration"],"pinyin":["zhen4"],"word":"陣"}],"containing_words":[],"sentences":[{"english":"I hope to be available for the Coppa Italia match against Udinese. I remain confident.","chinese":"希望在意大利杯對陣烏迪內斯的比賽時我能復出吧。"},{"english":"It was important to get a good result before the Celtic tie.","chinese":"在對陣凱子的歐冠比賽前，獲得一場大勝是如此重要。"},{"english":"I saw the other day when Chelsea played against Leverkusen - it was not a sell-out.","chinese":"就在切爾西對陣勒沃庫森的時候，球票就沒有賣完。"},{"english":"Arrigoni: Against Milan A Great Result \"The turnover is working well.\"","chinese":"對陣米蘭這是一個偉大的結果“輪換制工作的不錯。”"},{"english":"We had a great result at Leeds, we were excellent.","chinese":"對陣利茲聯的比賽我們表現的非常出色。"},{"english":"This was taken just before Newcastle's massive home game with Middlesbrough.","chinese":"圖片攝於紐卡主場對陣米堡的生死大戰前。"},{"english":"In fact, their best method of directly contacting Chiang's troops was on the field of battle.","chinese":"其實，他們直接接觸蔣軍的最好辦法是在戰場上對陣。"},{"english":"Ozil also served an assist to Ronaldo against Atletico Madrid in the Copa del Rey.","chinese":"厄齊爾同樣在國王杯對陣馬德里競技時助工羅納爾多。"},{"english":"He was though prepared to state that Hilario would be handed the goalkeeper's gloves for the Barcelona match.","chinese":"他認爲準備讓希拉里奧對陣巴塞羅那的比賽中首發。"},{"english":"He got a different type of experience against West Brom, he actually did very well in terms of dealing with it but didn’t get protection from the referee at the time which was disappointing.","chinese":"他理應在對陣西布朗的時候獲得來自裁判的更多保護。"},{"english":"They were beaten, and battered, in their Week 2 loss to the 49ers.","chinese":"在第二週對陣49人時他們被擊敗，並擠垮。"},{"english":"You know, it will be tough. But I feel good about the way I'm playing right now.","chinese":"我覺得今天我的發球要比那天對陣科利亞時好很多。"},{"english":"But I feel this team fights. We came back again against Boro and this team will go until the end.","chinese":"對陣米堡我們成功扳平，球隊會戰鬥到最後一秒。"},{"english":"I am satisfied by the results obtained by my team-mates, \" Sissoko explained.\"","chinese":"我們對陣熱那亞表現很好，對於隊友的成績我很滿意。"},{"english":"I think David may be back for the Wolves game.","chinese":"大衛預計能在對陣狼隊的比賽迴歸。"},{"english":"Bryant is expected to play tonight against Oklahoma City at Staples Center.","chinese":"科比期望在今晚對陣雷霆的比賽中亮相斯坦普斯。"}],"related":[{"definition":["to meet the enemy head-on"],"pinyin":["ying2 zhan4"],"word":"迎戰"},{"definition":["to defeat\/to beat"],"pinyin":["ji1 bai4"],"word":"擊敗"},{"definition":["to face off against one's adversary (military, sports etc)"],"pinyin":["dui4 lei3"],"word":"對壘"},{"definition":["victorious\/to win\/to triumph"],"pinyin":["huo4 sheng4"],"word":"獲勝"},{"definition":["military successes\/(fig.) success\/accomplishment"],"pinyin":["zhan4 ji4"],"word":"戰績"},{"definition":["a playoff"],"pinyin":["ji4 hou4 sai4"],"word":"季後賽"},{"definition":["finals (sports)"],"pinyin":["zong3 jue2 sai4"],"word":"總決賽"},{"definition":["to do battle (with sb)"],"pinyin":["dui4 zhan4"],"word":"對戰"},{"definition":["to deal the fatal blow (sports, chess etc)\/to score the winning point"],"pinyin":["jue2 sha1"],"word":"絕殺"},{"definition":["home ground (sports)\/home field\/main venue\/main stadium"],"pinyin":["zhu3 chang3"],"word":"主場"},{"definition":["St Paul\/São Paulo, city in Brazil"],"pinyin":["Sheng4 bao3 luo2"],"word":"聖保羅"},{"definition":["to defeat\/to overpower\/to beat\/to be defeated"],"pinyin":["da3 bai4"],"word":"打敗"},{"definition":["exhibition game"],"pinyin":["re4 shen1 sai4"],"word":"熱身賽"},{"definition":["to advance in rank\/promotion\/advancement"],"pinyin":["jin4 ji2"],"word":"晉級"},{"definition":["to compete\/to take part (in a sports event)"],"pinyin":["chu1 sai4"],"word":"出賽"},{"definition":["to defeat decisively\/to win decisively\/great victory\/triumph"],"pinyin":["da4 sheng4"],"word":"大勝"}]}