{"definition":["to transmit\/to lead\/to guide\/to conduct\/to direct"],"pinyin":["dao3"],"simplified":["导"],"rank":2814.0,"normalized_rank":0.03937151092020763,"fraction":0.00005196876505098216,"cumulative_fraction":0.7814347643248121,"word":"導","components":{"unicode":"U+5C0E","character":"導","decomposition":"⿱道寸","decomposition_definitions":[{"word":"⿱"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"},{"definition":["a unit of length\/inch\/thumb"],"pinyin":["cun4"],"word":"寸"}]},"containing_words":[{"definition":["lead\/leading\/to lead\/leadership\/leader\/CL:位[wei4],個|个[ge4]"],"pinyin":["ling3 dao3"],"word":"領導"},{"definition":["to lead to\/to create\/to cause\/to bring about"],"pinyin":["dao3 zhi4"],"word":"導致"},{"definition":["to guide\/to give directions\/to direct\/to coach\/guidance\/tuition\/CL:個|个[ge4]"],"pinyin":["zhi3 dao3"],"word":"指導"},{"definition":["to direct\/director (film etc)"],"pinyin":["dao3 yan3"],"word":"導演"},{"definition":["leader"],"pinyin":["ling3 dao3 ren2"],"word":"領導人"},{"definition":["to guide\/to lead (around)\/to conduct\/to boot\/introduction\/primer"],"pinyin":["yin3 dao3"],"word":"引導"},{"definition":["guided missile\/cruise missile\/missile\/CL:枚[mei2]"],"pinyin":["dao3 dan4"],"word":"導彈"},{"definition":["leading\/dominant\/prevailing\/to lead\/to direct\/to dominate"],"pinyin":["zhu3 dao3"],"word":"主導"},{"definition":["to advocate\/to initiate\/to propose\/to be a proponent of (an idea or school of thought)"],"pinyin":["chang4 dao3"],"word":"倡導"},{"definition":["to be oriented towards\/orientation"],"pinyin":["dao3 xiang4"],"word":"導向"},{"definition":["navigation"],"pinyin":["dao3 hang2"],"word":"導航"},{"definition":["tutor\/teacher\/academic advisor"],"pinyin":["dao3 shi1"],"word":"導師"},{"definition":["tour guide\/guidebook\/to conduct a tour"],"pinyin":["dao3 you2"],"word":"導遊"},{"definition":["to give guidance\/to mentor\/to counsel\/to coach\/to tutor"],"pinyin":["fu3 dao3"],"word":"輔導"},{"definition":["to mislead\/to misguide\/misleading"],"pinyin":["wu4 dao3"],"word":"誤導"}],"sentences":[{"english":"Mr. Yang Dongtang, the chairman, cordial welcome personalities from all walks of life to visit our company.","chinese":"董事長楊東堂先生誠摯歡迎各界人士蒞臨導。"},{"english":"It has its own infrared seeker, guidance system, and motor.","chinese":"它也擁有自己的紅外製導頭，制導系統以及跟蹤器。"},{"english":"God to light the blue touch paper and set the universe going.","chinese":"沒必要請上帝來點燃藍色導火紙，讓宇宙誕生。"},{"english":"In this paper is mainly discussed the design of cotton-plaited polyester woven fabric of moisture transmission.","chinese":"本文就棉蓋滌導溼機織面料的設計進行探討。"},{"english":"In this paper, the analysis design of guide vane profile for radial guide apparatus has been given.","chinese":"因而，在創型設計時須進行導葉型線的構型設計。"},{"english":"The aesthetic of the living space, leading from the spiritual pursuit.","chinese":"而對生存空間的審美，導源於主體精神的追尋。"},{"english":"Import your featured image and place it over the white rectangles.","chinese":"把你選好的圖片導進來，放在白色長方形上面。"},{"english":"Formal law of Weber's comes from formal rationality directly.","chinese":"韋伯的形式法治直接導源於他的形式合理性。"},{"english":"The most excellent equations of G(subscripts), of diurnal variation to environment factors were attained by the method of stepwise multi-regression.","chinese":"經逐步多元迴歸得到了氣孔導度日變化的迴歸方程。"},{"english":"Light guide body, lighting device, liquid crystal display device, and electronic device.","chinese":"導光體，照明裝置，液晶顯示裝置以及電子設備。"},{"english":"So, it's the second derivative of a position vector.","chinese":"它是位置向量的二階導。"},{"english":"Please circle the earliest time that you can conduct tutorial sessions.","chinese":"請圈選閣可以主持導修課的最早時間。"},{"english":"Yang Dongtang, President, will give public figures a warm welcome.","chinese":"董事長楊東堂先生誠摯歡迎各界人士蒞臨導。"},{"english":"Increasing nonlinear intensity leads to a remarkable enhancement of unidirectional penetrability.","chinese":"隨着非線性強度差異的增強，單向導通性顯著提高。"},{"english":"This article outlined it from orally catharsis with drugs method and intestinal tract cleaning enema method.","chinese":"本文從口服藥物導瀉法及清潔灌腸法方面進行綜述。"},{"english":"Due to the single transmission of pure pilot-frequency, by doing so it can reduce carrier interference where pseudo-pilot lies in.","chinese":"由於只發射純導頻，對僞導頻所在的載頻的干擾減小。"}],"related":[{"definition":["to guide\/to give directions\/to direct\/to coach\/guidance\/tuition\/CL:個|个[ge4]"],"pinyin":["zhi3 dao3"],"word":"指導"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["neck\/collar\/to lead\/to receive\/classifier for clothes, mats, screens etc"],"pinyin":["ling3"],"word":"領"},{"definition":["for a particular person, occasion, purpose\/focused on one thing\/special\/expert\/particular (to sth)\/concentrated\/specialized"],"pinyin":["zhuan1"],"word":"專"},{"definition":["should\/ought to\/probably\/must be\/to deserve\/to owe\/to be sb's turn to do sth\/that\/the above-mentioned"],"pinyin":["gai1"],"word":"該"},{"definition":["to be in charge of\/to take responsibility for\/to be to blame\/conscientious"],"pinyin":["fu4 ze2"],"word":"負責"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["person\/employee\/member"],"pinyin":["yuan2"],"word":"員"},{"definition":["to examine\/to test\/to check"],"pinyin":["yan4"],"word":"驗"},{"definition":["teacher\/CL:個|个[ge4],位[wei4]"],"pinyin":["lao3 shi1"],"word":"老師"},{"definition":["to guide\/to lead (around)\/to conduct\/to boot\/introduction\/primer"],"pinyin":["yin3 dao3"],"word":"引導"},{"definition":["bill\/list\/form\/single\/only\/sole\/odd number\/CL:個|个[ge4]","surname Shan"],"pinyin":["Shan4","dan1"],"word":"單"},{"definition":["line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already","surname Ye"],"pinyin":["Ye4","ye4"],"word":"業"},{"definition":["picul (100 catties, 50 kg)\/two buckets full\/carrying pole and its load\/classifier for loads carried on a shoulder pole","to undertake\/to carry\/to shoulder\/to take responsibility"],"pinyin":["dan1","dan4"],"word":"擔"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"計"},{"definition":["(bound form) to practice\/to study\/habit\/custom","surname Xi"],"pinyin":["Xi2","xi2"],"word":"習"}]}