{"definition":["urinary catheterization"],"pinyin":["dao3 niao4"],"simplified":["导尿"],"rank":45518.0,"normalized_rank":0.6368558756453486,"fraction":2.2684923214344253e-7,"cumulative_fraction":0.9981401565713371,"word":"導尿","characters":[{"definition":["to transmit\/to lead\/to guide\/to conduct\/to direct"],"pinyin":["dao3"],"word":"導"},{"definition":["see 尿[niao4]","to urinate\/urine\/CL:泡[pao1]"],"pinyin":["niao4","sui1"],"word":"尿"}],"containing_words":[],"sentences":[{"english":"Objective To observe the success rate of urethral catheterization by telescopic saccule urinary catheter.","chinese":"目的觀察套管式球囊導尿管置管的成功率。"},{"english":"Methods Patients with neurosurgery operation were randomly distributed into 2 groups:pre-anesthesia catheterization group and post-anesthesia catheterization group.","chinese":"方法手術患者按麻醉前導尿和麻醉後導尿分爲兩組。"},{"english":"ObjectiveTo investigate the nursing management of clean intermittent catheterization (CIC) of spinal cord injured (SCI) patients.","chinese":"目的探討脊髓損傷患者清潔間歇導尿的護理管理。"},{"english":"Cystitis and urethritis are complications of prolonged use of indwelling catheters.","chinese":"膀胱炎和尿道炎是長期應用留置導尿管的併發症。"},{"english":"Accordingly, the urinary catheter should not be inserted before an examination of the rectum and genitalia .","chinese":"因此，在置導尿管前應先進行直腸及外生殖器的檢查。"},{"english":"To adopt suggestion way in her mind to induce micturition .","chinese":"未成功者採用開塞露納肛方法及行留置導尿術。"},{"english":"Catheter trays, sachets, transdermal patches.","chinese":"導尿管，香袋，貼片包裝。"},{"english":"Intermission urethral catheterization was done according to residual urine.","chinese":"依據殘餘尿量多少進行間歇導尿。"},{"english":"Approach of preoperative detaining urethral catheterization opportunity of operative patients;","chinese":"目的探討舒泰在前列腺增生患者導尿中的應用效果。"},{"english":"You are going to have urine catheterization now.","chinese":"現在您需要導尿。"}],"related":[]}