{"definition":["same as 引導|引导[yin3 dao3]\/Dao Yin, Daoist exercises involving breathing, stretching and self-massage"],"pinyin":["dao3 yin3"],"simplified":["导引"],"rank":32038.0,"normalized_rank":0.4482531865179858,"fraction":7.872573416664001e-7,"cumulative_fraction":0.9919987877410598,"word":"導引","characters":[{"definition":["to transmit\/to lead\/to guide\/to conduct\/to direct"],"pinyin":["dao3"],"word":"導"},{"definition":["to draw (e.g. a bow)\/to pull\/to stretch sth\/to extend\/to lengthen\/to involve or implicate in\/to attract\/to lead\/to guide\/to leave\/to provide evidence or justification for\/old unit of distance equal to 10 丈[zhang4], one-thirtieth of a km or 33.33 meters"],"pinyin":["yin3"],"word":"引"}],"containing_words":[{"definition":["infrared guided missile"],"pinyin":["hong2 wai4 xian4 dao3 yin3 fei1 dan4"],"word":"紅外線導引飛彈"}],"sentences":[{"english":"The analysis of the image quality on focus plate is very important in infrared seeker measurement.","chinese":"焦面上的成像質量分析是紅外導引頭測試的重要內容。"},{"english":"Interference of dual sources is an effective means of counteracting Passive Radar Seeker (PRS).","chinese":"兩點源干擾是干擾雷達導引頭的重要手段。"},{"english":"Guidance is available to you whenever you want.","chinese":"只要你需要導引對你就有用。"},{"english":"This paper discusses the direction finding characteristic of passive monopulse seeker.","chinese":"主要討論被動單脈衝導引頭對旁瓣目標的識別。"},{"english":"The wire guidance enables torpedo to close into homing contact with the target.","chinese":"有線制導能夠使魚雷接近致自導引觸及目標。"},{"english":"Operators of its secure communications system can guide friendly aircraft against enemy planes.","chinese":"其安全系統的操作者能導引友機對抗敵機。"},{"english":"Please consult the External Interfaces Guide for information on debugging MEX-files.","chinese":"請請教外部的接口針對數據的導引調試該MEX文件。"},{"english":"The aspirant must channel the fire, an unwavering commitment of intent.","chinese":"修習者需導引內力，亦即對決心毫不動搖的承諾。"},{"english":"Why does one lead to or entail the other?","chinese":"它們如何彼此導引與承繼？"},{"english":"Self-directed learning is a natural and effective learning mode for children while guided learning is formed with the instruction of the teacher.","chinese":"導引性學習是幼兒在教師引導下後天形成的學習方式。"},{"english":"The application of the electronic angle tracking technology in anti-radiation seeker was researched in this paper.","chinese":"對電子角跟蹤在反輻射導引頭中的應用進行了研究。"},{"english":"All the royal cars are fitted with electronic homing devices.","chinese":"所有的皇家轎車都裝有電子自導引裝置。"},{"english":"Therefore it can be used in design of guidance law for torpedo and anti-torpedo torpedo.","chinese":"該結果可廣泛應用於魚雷及反魚雷的導引律設計。"},{"english":"Computed tomography-guided biopsy confirmed the diagnosis of synovial sarcoma.","chinese":"經過電腦斷層導引的切片檢查，確定診斷爲滑膜肉瘤。"},{"english":"The recognition process is driven by the model graph in at…","chinese":"識別由模型樹圖導引從上至下完成。"},{"english":"The limitation of over wide-band passive radar seeker is pointed.","chinese":"指出了超寬頻帶被動雷達導引頭的侷限性。"}],"related":[{"definition":["path\/route\/method\/ways and means"],"pinyin":["lu4 jing4"],"word":"路徑"},{"definition":["to be convinced\/to accept"],"pinyin":["fu2 qi4"],"word":"服氣"},{"definition":["system\/CL:個|个[ge4]"],"pinyin":["xi4 tong3"],"word":"系統"},{"definition":["to guide\/to lead (around)\/to conduct\/to boot\/introduction\/primer"],"pinyin":["yin3 dao3"],"word":"引導"},{"definition":["to be oriented towards\/orientation"],"pinyin":["dao3 xiang4"],"word":"導向"},{"definition":["to put to use\/to apply\/practical\/applied (science, linguistics etc)\/application\/practical use\/(computing) app"],"pinyin":["ying4 yong4"],"word":"應用"},{"definition":["therapy\/treatment"],"pinyin":["liao2 fa3"],"word":"療法"},{"definition":["in sequence, step by step (idiom); to make steady progress incrementally"],"pinyin":["xun2 xu4 jian4 jin4"],"word":"循序漸進"},{"definition":["drill\/practice"],"pinyin":["cao1 lian4"],"word":"操練"},{"definition":["to go to the toilet"],"pinyin":["ru2 ce4"],"word":"如廁"},{"definition":["to teach\/teaching and learning\/education\/CL:門|门[men2],個|个[ge4]"],"pinyin":["jiao4 xue2"],"word":"教學"},{"definition":["to impart\/to pass on\/to teach"],"pinyin":["chuan2 shou4"],"word":"傳授"},{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"word":"實踐"},{"definition":["to study\/to practice"],"pinyin":["xiu1 xi2"],"word":"修習"},{"definition":["instrument\/apparatus\/CL:臺|台[tai2]"],"pinyin":["yi2 qi4"],"word":"儀器"},{"definition":["to assist\/to aid\/supplementary\/auxiliary\/subsidiary"],"pinyin":["fu3 zhu4"],"word":"輔助"}]}