{"definition":["derivative (math.)"],"pinyin":["dao3 shu4"],"simplified":["导数"],"rank":45250.0,"normalized_rank":0.6331062079386621,"fraction":2.3254235959105797e-7,"cumulative_fraction":0.9980785851060359,"word":"導數","characters":[{"definition":["to transmit\/to lead\/to guide\/to conduct\/to direct"],"pinyin":["dao3"],"word":"導"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[],"sentences":[{"english":"The content of etoposide injection was determined by first order derivative spectrophotometry.","chinese":"用一階導數光譜法測定足葉乙甙注射液的含量。"},{"english":"And this is the derivative with respect to pressure.","chinese":"這是化學勢對壓強的導數。"},{"english":"We cannot use the second derivative test.","chinese":"這裏不能用二次導數來驗證。"},{"english":"The author has made IR and UV spectroscopic assay of cyathula and its counterfeit.","chinese":"膝及其僞品進行了IR光譜及UV導數光譜的測定。"},{"english":"The point of minima value and the point of inflexion are two common concepts of derivative.","chinese":"極值點和拐點是高階導數應用中兩個常見的概念。"},{"english":"So, now, similarly, the directional derivative means, actually, we'll be slicing our graph by the vertical plane.","chinese":"類似地，方向導數的意思是，用垂直平面切開圖像。"},{"english":"Abstract: Zero-crossing edge detection method was analyzed.","chinese":"文摘:討論二階導數過零邊緣檢測方法。"},{"english":"The paper reported the determination of enoxacin in urine by second derivative spectrophotometrywithout extraction and seperation.","chinese":"本文采用二階導數光譜法測定依諾沙星的尿藥濃度。"},{"english":"So, I'm integrating the differential of a function, f.","chinese":"我積的是f的導數。"},{"english":"Somehow, when you have a partial derivative, you must resist the urge of simplifying things.","chinese":"當遇到偏導數時，一定記住，不能約分。"},{"english":"And that's basically, yes, that's the directional derivative.","chinese":"基本上是的，那就是方向導數。"},{"english":"I take the time derivative.","chinese":"我會計算時間導數。"},{"english":"With respect to n, the number of moles.","chinese":"對n的偏導數，這裏的n是摩爾數。"},{"english":"A quasilinear equation is one in which the highest-order derivative appears linearly .","chinese":"最高階導數線性地出現的那種方程是準線性方程。"},{"english":"And this is the derivative with respect to temperature.","chinese":"這是吉布斯自由能對溫度的偏導數。"},{"english":"This decomposition may give another definition of high order tensor's covariant derivative.","chinese":"這種分解可以給出高階張量協變導數的另一種定義。"}],"related":[]}