{"definition":["heat conduction"],"pinyin":["dao3 re4 xing4"],"simplified":["导热性"],"rank":56790.0,"normalized_rank":0.7945657800847873,"fraction":6.554395446100754e-8,"cumulative_fraction":0.9996446887044894,"word":"導熱性","characters":[{"definition":["to transmit\/to lead\/to guide\/to conduct\/to direct"],"pinyin":["dao3"],"word":"導"},{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"熱"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"Thermal Conductivity of CPVC can be improved obviously by powdered graphite filler.","chinese":"用石墨填充CPVC可顯著提高材料的導熱性能。"},{"english":"In addition its excellent conductivity avoids the introduction of temperature gradients.","chinese":"而碳化硅卓越的導熱性則避免了引入溫度梯度。"},{"english":"Secondly, the thermal conductivity of heatsink better.","chinese":"其次，散熱片的導熱性要好。"},{"english":"High hardness, brittleness, abrasive sharp, good thermal conductivity.","chinese":"硬度高，脆性大，磨粒鋒利，導熱性好。"},{"english":"Aluminum core is 1050 pure series with excellent heat conductivity.","chinese":"中間鋁，爲1050系列，導熱性能好。"},{"english":"In the past the crystallizer was made of a deoxidized copper with a good thermal conductivity.","chinese":"以往，結晶器是選擇導熱性良好的脫氧銅製作的。"},{"english":"Aluminum alloy has low specific electrical resistance and high thermal conductivity.","chinese":"鋁合金的電阻很低，而導熱性很高。"},{"english":"The invention has simple process, best heat conduction and environmental-friendly process.","chinese":"本發明工藝製程簡單，導熱性佳，且工藝環保。"},{"english":"The natural nonctystalline graphite sand has good thermal conductivity and thermal reservasion.","chinese":"天然無定形石墨砂具有良好的導熱性和蓄熱性。"},{"english":"And the thermal conductivity is strong and clip a go back on the food of the overheat, easily burn lips.","chinese":"而且導熱性強，夾食過熱的食物時，容易燙到嘴脣。"},{"english":"It is significant for industry to study the heat conduction function of compound material .","chinese":"研究複合材料的導熱性能對工業具有十分重要的意義。"},{"english":"Evidence also implicates the crystal structure as a thermal conductivity barrier.","chinese":"證據還表明晶體結構作爲導熱性障礙。"},{"english":"Metals are good conductors of heat.","chinese":"金屬有良好的導熱性。"}],"related":[]}