{"definition":["duct\/conduit\/vessel\/catheter"],"pinyin":["dao3 guan3"],"simplified":["导管"],"rank":24544.0,"normalized_rank":0.34340240370489555,"fraction":0.0000015454651355872758,"cumulative_fraction":0.9836014431490074,"word":"導管","characters":[{"definition":["to transmit\/to lead\/to guide\/to conduct\/to direct"],"pinyin":["dao3"],"word":"導"},{"definition":["surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["Guan3","guan3"],"word":"管"}],"containing_words":[{"definition":["vascular tissue"],"pinyin":["dao3 guan3 zu3 zhi1"],"word":"導管組織"}],"sentences":[{"english":"The most common method of supplying air to the bag is by a blowpipe.","chinese":"最常見的向風袋輸送空氣的方法便是用導管。"},{"english":"Typically, intracardiac catheters are positioned in the right atrium and in the coronary sinus.","chinese":"通常上是把心臟內導管置於右心房和冠狀靜脈竇內。"},{"english":"Cardiac catheterization with angiography is the reference standard for diagnosing CAD.","chinese":"心血管導管造影是診斷冠心病的金標準。"},{"english":"M. Obtain a chest film to identify the position of the intravenous line and a possible pneumothorax.","chinese":"拍胸片以確定靜脈內導管的位置和可能發生的氣胸。"},{"english":"With metastasis of both sides, the catheter was inserted into the main trunk of pulmonary artery.","chinese":"兩側轉移竈者，導管頭端埋於肺總動脈處。"},{"english":"Afterrapid induction all patients were intubated with a tube.","chinese":"靜脈快速誘導後經口插入氣管導管。"},{"english":"Can a catheter-related bloodstream infection be treated?","chinese":"導管相關血流感染能夠治療嗎？"},{"english":"Objective To find out the outcome of preventionchylothorax by prophylactic ligature thoracic duct in esophagealcacinoma procedure.","chinese":"目的探討結紮胸導管對防止術後乳糜胸的效果。"},{"english":"It should have been attached to a tube inserted in Rayan's nose.","chinese":"它本來應該連在插入Rayan鼻子的導管上。"},{"english":"The histologic classification of breast carcinoma into duct and lobular type lacks the basis of histogenesis.","chinese":"乳腺癌分類爲導管癌和小葉癌缺少組織發生學依據。"},{"english":"Its extendables-foils radiate heat and serve as a conduit to deflector shield energy.","chinese":"可展開的S翼既用於散熱，又是偏導護盾能量導管。"},{"english":"Poison is released through a channel in the snake's fangs.","chinese":"毒液通過蛇牙裏的一條導管被釋放出來。"},{"english":"The author used smear from Stensen, s duct aspiration to observe exfoliated cytology in order to help diagnosis of early mumps.","chinese":"作者應用腮腺導管內吸液塗片觀察脫落細胞情況。"},{"english":"The use of extra-amniotic saline infusion with a balloon catheter or a double balloon catheter (Atad ripener) also appears to be effective for cervical ripening.","chinese":"用羊膜外單或雙氣囊氏導管也是宮頸成熟的有效方法。"},{"english":"Most catheters are positioned on the chest wall.","chinese":"大多數的導管被放置在胸壁處。"},{"english":"Objective To summarize the nursing of atrial tachyarrhythmia after radiofrequency current catheter ablation(RCCA) .","chinese":"目的總結導管射頻消融治療快速房性心律失常的護理。"}],"related":[{"definition":["tampon\/sliver (textiles)"],"pinyin":["mian2 tiao2"],"word":"棉條"},{"definition":["rectum (anatomy)"],"pinyin":["zhi2 chang2"],"word":"直腸"},{"definition":["scratch (wound)\/scratch (damage to an object)"],"pinyin":["gua1 shang1"],"word":"刮傷"},{"definition":["glue"],"pinyin":["jiao1 shui3"],"word":"膠水"},{"definition":["pinhole"],"pinyin":["zhen1 kong3"],"word":"針孔"},{"definition":["vein"],"pinyin":["jing4 mai4"],"word":"靜脈"},{"definition":["nozzle\/spray-head"],"pinyin":["pen1 tou2"],"word":"噴頭"},{"definition":["smooth\/oily\/sleek\/to lubricate"],"pinyin":["run4 hua2"],"word":"潤滑"},{"definition":["to sew together\/suture (in surgery)\/to sew up (a wound)"],"pinyin":["feng2 he2"],"word":"縫合"},{"definition":["lubricating oil"],"pinyin":["run4 hua2 you2"],"word":"潤滑油"},{"definition":["dissipated\/rotten\/decaying"],"pinyin":["mi2 lan4"],"word":"糜爛"},{"definition":["to stiffen"],"pinyin":["bian4 ying4"],"word":"變硬"},{"definition":["adhesive plaster\/band-aid\/rubber tape\/rubberized fabric"],"pinyin":["jiao1 bu4"],"word":"膠布"},{"definition":["electric shock"],"pinyin":["dian4 ji1"],"word":"電擊"},{"definition":["to close by coming together (like the lips of a wound, the doors of an elevator, the walls of a channel)\/to close by connecting in a loop (like a circuit)\/closed-loop"],"pinyin":["bi4 he2"],"word":"閉合"},{"definition":["portable"],"pinyin":["bian4 xie2 shi4"],"word":"便攜式"}]}