{"definition":["(mechanics) guide rail\/slideway"],"pinyin":["dao3 gui3"],"simplified":["导轨"],"rank":40521.0,"normalized_rank":0.5669413624725421,"fraction":3.659659105428639e-7,"cumulative_fraction":0.9966844441738736,"word":"導軌","characters":[{"definition":["to transmit\/to lead\/to guide\/to conduct\/to direct"],"pinyin":["dao3"],"word":"導"},{"definition":["course\/path\/track\/rail"],"pinyin":["gui3"],"word":"軌"}],"containing_words":[],"sentences":[{"english":"For example: R1 service door upper guide and door latch on doorframe is worn.","chinese":"R1服務門上導軌和門框的門閂陳舊並且磨損。"},{"english":"The technology of circumferentially grinding the guideways of machine tools is an economical and practical way.","chinese":"周邊磨削機牀導軌工藝是一條經濟實用的途徑。"},{"english":"Drill holes on the top of the doorway according to the hole position on the guiding track. Fill in plastic plug when necessary.","chinese":"根據導軌孔位在門洞上端鑽孔，必要時打入膠塞。"},{"english":"A ratchet slider is movably mounted to the horizontal guide frame.","chinese":"棘齒滑塊被可移動地安裝於所述水平導軌框架。"},{"english":"The development of HG hydraulic slide way oil was introduced.","chinese":"介紹HG液壓導軌油的研製過程。"},{"english":"The guide rail of working table has large span and strong anti-overturn capacity.","chinese":"工作臺導軌跨距大，抗顛覆能力強。"},{"english":"Up to seven of these modular units plug into a bookshelf-style card rack.","chinese":"每個機架式插件板導軌最多可安裝7個此模塊裝置。"},{"english":"Adjustable gibs for slideways.","chinese":"導軌可調節的吉布斯。"},{"english":"Imported ball bearing leas screw and linear guide rail have ensured a repeated positioning precision of the machine tool.","chinese":"進口滾珠絲槓及直線導軌確保了機牀的重複定位精度。"},{"english":"The electric current supplied to the coils in the guideway walls is constantly alternating to change the polarity of the magnetized coils.","chinese":"供給導軌槽內線圈的電流交互變化着電磁線圈的極性。"},{"english":"High precision linear guiding pair ensured steady and long-term processing accuracy.","chinese":"高精度直線軸承導軌副，可長期保持精度。"},{"english":"Both screw rod and guide rail apply centralized time and rationed thin oil lubrication.","chinese":"絲槓和導軌均採用集中定時定量稀油潤滑。"},{"english":"At the guides there is a possibility to apply a machine balance and to align the plant over the pedestals .","chinese":"在導軌上，可以使用機械平衡和調整在基座上的位置。"},{"english":"Now, we'd like to describe details for the installation of the Blum slides.","chinese":"現在我們給大家詳細講解一下百隆導軌的安裝。"},{"english":"Germany Hafele three mute rail or DTC rail.","chinese":"採用德國海福樂三節靜音導軌或DTC導軌。"},{"english":"Germany Hafele three mute rail or DTC rail.","chinese":"採用德國海福樂三節靜音導軌或DTC導軌。"}],"related":[]}