{"definition":["society in which the material needs of most citizens are adequately met"],"pinyin":["xiao3 kang1 she4 hui4"],"simplified":["小康社会"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"小康社會","characters":[{"definition":["small\/tiny\/few\/young"],"pinyin":["xiao3"],"word":"小"},{"definition":["healthy\/peaceful\/abundant","surname Kang"],"pinyin":["Kang1","kang1"],"word":"康"},{"definition":["society\/group\/club\/agency\/(old) god of the land"],"pinyin":["she4"],"word":"社"},{"definition":["can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])","to balance an account\/accountancy\/accounting"],"pinyin":["hui4","kuai4"],"word":"會"}],"containing_words":[],"sentences":[{"english":"It remains a historical mission for China to accelerate the process of urbanization, which will enable the nation to move towards moderate prosperity.","chinese":"大力推進城市化，是中國奔向小康社會的歷史重任。"},{"english":"The most difficult and onerous tasks to build a well-off society comprehensively focus on rural area.","chinese":"全面建設小康社會，最艱鉅最繁重的任務在農村。"},{"english":"The first 20 years of the 21st century represents an important strategic period for China to achieve all-round construction of a better-off society and to speed up its socialist modernization.","chinese":"21世紀頭20年，是中國全面建設小康社會。"},{"english":"The construction of political civilization is one of the most important standards for building comfortably-off society in an all-round way.","chinese":"政治文明建設是全面建設小康社會的一個重要標準。"},{"english":"During the 16th Party Congess, the CPC put forward the goal of completely building a Well-off society.","chinese":"黨的十六大提出了全面建設小康社會的目標。"},{"english":"The current 12th Five-year Plan period is a critical stage in China's efforts to build a society of initial prosperity in all respects.","chinese":"“十二五”是中國全面建設小康社會的關鍵時期。"},{"english":"The realization of overall comfortably-off society is closely related to the coordinated development of health services.","chinese":"小康社會的全面達成離不開衛生事業的協調發展。"},{"english":"To completely build a \"Xiaokang Society \" in China, an appropriate universal-type social welfare system is a fundamental requirement.","chinese":"適度普惠型社會福利制度是全面建設小康社會的要求。"},{"english":"\"Eliminating poverty in rural areas is the most difficult challenge to building a moderately prosperous society, \" said Xi.","chinese":"農村貧困人口脫貧是全面建成小康社會最艱鉅的任務。"},{"english":"The realization of the well-off society requires people have high IQ.","chinese":"小康社會的實現需要人的高智商化。"},{"english":"To build a Xiaokang society in all respects is China's development goal by 2020.","chinese":"全面建成小康社會，是中國到2020年的發展目標。"},{"english":"Therefore, it establishes good leading foundation to build the society of comfortable standard of living all-sidedly.","chinese":"唯此，才能爲全面建設小康社會奠定良好的領導基礎。"},{"english":"China has taken another solid step towards the goal of building a well-off society in an all-round way.","chinese":"中國又向全面建設小康社會的目標邁出了堅實一步。"},{"english":"In the new century, we have come to the new strategy stage of building the whole well-off society.","chinese":"新的世紀，我國進入了建設全面小康社會的戰略階段。"},{"english":"The Chinese people are now going all out to build a well-off society in all aspects.","chinese":"中國人民正在全面建設小康社會的征程上奮勇前進。"},{"english":"In 2020, our country will be fully realize the grand goal of well-off society.","chinese":"2020年，我國將全面實現小康社會的宏偉目標。"}],"related":[]}