{"definition":["to discuss sth on its own merits\/to judge the matter as it stands"],"pinyin":["jiu4 shi4 lun4 shi4"],"simplified":["就事论事"],"rank":32488.0,"normalized_rank":0.4545492703538399,"fraction":7.554342190104991e-7,"cumulative_fraction":0.992346005744985,"word":"就事論事","characters":[{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"論"},{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"}],"containing_words":[],"sentences":[{"english":"To be respectful of one another and the relationship, you should try and keep the discussion (or argument) focused to the topic at hand.","chinese":"出於對雙方和彼此關係的尊重，你應該爭取就事論事。"},{"english":"The cops were matter-of-fact about the whole thing.","chinese":"兩個警察對整個事件抱着就事論事的態度。"},{"english":"As a matter of fact, a successful person is capable of setting goals and paving the way against all odds.","chinese":"就事論事，成功者懂得立定目標，又能排除萬難鋪路。"},{"english":"Try to look at the experience objectively.","chinese":"就事論事地看待這次經驗。"},{"english":"But perhaps they are teaching us to separate the deed from the person.","chinese":"不過可能他們在教我們就事論事吧。"},{"english":"Management deals in facts and figures, an analytical approach to a problem.","chinese":"管理側重於確定性的事實和就事論事的分析。"},{"english":"Leaders can also set aside matters of personality and make decisions based on fact.","chinese":"領導者也會排出個人成見，就事論事。"},{"english":"Just call it for what it is.","chinese":"我是就事論事而已。"},{"english":"An editorial writer should maintain a hard-eyed attitude.","chinese":"社論作者應保持就事論事的態度。"},{"english":"\"I have cerebral palsy, \" he answered matter-of-factly.","chinese":"“我患有大腦性麻痹，”他就事論事地回答說。"},{"english":"Instead, a thing should be considered on its own terms;","chinese":"但恰恰相反，我們應該就事論事地考慮一件事情。"},{"english":"Instead, a thing should be considered on its own terms; we should avoid the tendency to compare it to something else.","chinese":"我們應該就事論事，避免把它拿去和其他事物比較。"}],"related":[]}