{"definition":["employment opportunity\/job opening"],"pinyin":["jiu4 ye4 ji1 hui4"],"simplified":["就业机会"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"就業機會","characters":[{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already","surname Ye"],"pinyin":["Ye4","ye4"],"word":"業"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"},{"definition":["can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])","to balance an account\/accountancy\/accounting"],"pinyin":["hui4","kuai4"],"word":"會"}],"containing_words":[],"sentences":[{"english":"Grads get offers in grassroots-level schools teaching in Guangdong.","chinese":"廣東應屆畢業生獲得農村學校教書的就業機會。"},{"english":"There is consider-able pessimism about job opportunity.","chinese":"人們對就業機會相當悲觀。"},{"english":"You only get one opportunity like this and I had to take it.","chinese":"既然我只得到了一個就業機會，那當然要好好利用。"},{"english":"Middle and small-sized firms are job creators.","chinese":"中小型企業是製造就業機會的源泉。"},{"english":"The plan has the added advantage of bringing employment to rural areas.","chinese":"該計劃另有一個優點，就是給屯子帶來了就業機會。"},{"english":"The manufacturing sector has shed more than a million jobs.","chinese":"製造業裁掉了過百萬個就業機會。"},{"english":"I wonder how many manufacturing jobs Baird is taking with him.","chinese":"我挺想知道貝爾德帶上了多少製造業就業機會。"},{"english":"All African Americans hope that their employments will be based on EOE.","chinese":"所有美國黑人都希望他們享有平等的就業機會。"},{"english":"Employment opportunities are limited in the man's racially segregated neighborhood.","chinese":"就業機會在他所在的種族隔離區確實有限。"},{"english":"Large print buffer handles even very graphics-intensive jobs.","chinese":"大打印緩衝處理甚至非常圖形密集型的就業機會。"},{"english":"The town relies on the seasonal tourist industry for jobs.","chinese":"這個城鎮依靠季節性旅遊業提供就業機會。"},{"english":"They are dependent on Amercia for jobs and hard currency.","chinese":"他們的社會依賴美國帶來的就業機會和貨幣硬流通。"},{"english":"A favorable aspect about MNCs is that they reate jobs in foreign countries.","chinese":"跨國公司在國外提供就業機會，這是它受歡迎的一面。"},{"english":"But then, who is talking seriously about job creation these days?","chinese":"那麼，今天是誰在義正言辭地說要提供就業機會的呢？"},{"english":"There are dozens of things we could do that would create jobs.","chinese":"只要我們肯做，創造就業機會的門路有很多。"},{"english":"For a place like Quincy that's a good number of jobs.","chinese":"對於像昆西這是一個相當數量的就業機會的地方。"}],"related":[]}