{"definition":["exhaust (i.e. waste gas from engine)\/emissions"],"pinyin":["wei3 qi4"],"simplified":["尾气"],"rank":12421.0,"normalized_rank":0.17378590516698614,"fraction":0.000005782611732881718,"cumulative_fraction":0.9464238773433252,"word":"尾氣","characters":[{"definition":["horse's tail\/pointed posterior section of a locust etc","tail\/remainder\/remnant\/extremity\/sixth of the 28 constellations\/classifier for fish"],"pinyin":["wei3","yi3"],"word":"尾"},{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"}],"containing_words":[{"definition":["low emissions (from car exhaust)"],"pinyin":["di1 wei3 qi4 pai2 fang4"],"word":"低尾氣排放"}],"sentences":[{"english":"For proliferation inhibit, the effect of gasoline exhaust is slightly greater than methanol exhaust.","chinese":"汽油車尾氣對細胞增殖的抑制作用略大於甲醇車尾氣。"},{"english":"For proliferation inhibit, the effect of gasoline exhaust is slightly greater than methanol exhaust.","chinese":"汽油車尾氣對細胞增殖的抑制作用略大於甲醇車尾氣。"},{"english":"The catalyst purification is a popular means for the purification of motocycle exhaust emission in the world.","chinese":"催化淨化是國內外普遍採用的尾氣淨化法。"},{"english":"PAHs are in car or bus exhaust and emissions from residential heating and power generation.","chinese":"多環芳烴來自於汽車尾氣以及住宅供暖和發電的排放。"},{"english":"On Earth, polycyclic aromatic hydrocarbons are found on burnt toast and in automobile exhaust.","chinese":"在地球上，烤糊的麪包和汽車尾氣裏都含有稠環芳烴。"},{"english":"This is to compensate for the amount of fresh additives injected into the offgas stream.","chinese":"然後在尾氣氣流中補充一定數量的新鮮添加劑。"},{"english":"The trend of automobile exhaust in Hengshui is fluctuating in recent years.","chinese":"衡水市近幾年汽車尾氣污染呈起伏下降趨勢。"},{"english":"First of all, much tail gas released by cars harm pollutes the fresh air gravely.","chinese":"首先，汽車尾氣的釋放嚴重危害了新鮮的空氣。"},{"english":"In the paper, an experimental bench which simulating multiengine tail gas heat source is researched and built.","chinese":"研究建立了一個模擬多種發動機尾氣熱源的試驗檯。"},{"english":"More than 90% of radioiodine goes to gas-off system by sparging- air in the process of dissolution.","chinese":"以上的放射性碘隨鼓泡氣體進入尾氣系統。"},{"english":"He looked back to see the hydrocarbon count registering from the exhaust sniffer.","chinese":"他回頭看了看尾氣探測器顯示的碳氫化合物讀數。"},{"english":"The pressure-creosoted method was employed to recover the solvent in tailings.","chinese":"本文敘述了用加壓法回收尾氣中的溶劑。"},{"english":"It is shown that the recycling of residual gas can create great economic efficiency.","chinese":"結果表明含氫尾氣的回收可以創造極大的經濟效益。"},{"english":"Life's \"bloodsucker\" to the truth.","chinese":"汽車尾氣像吸血鬼殘害我們生命。"},{"english":"The tail gas chimney tower frame in Zhong county natural gas purifying project was needed to hoist.","chinese":"在忠縣天然氣淨化廠工程中要吊裝尾氣煙囪塔架。"},{"english":"Automobile exhaust tetraethyl lead is a highly toxic substance.","chinese":"汽車尾氣中的四乙基鉛是劇毒物質。"}],"related":[]}