{"definition":["outside (a group etc)\/not connected (with an event etc)\/external"],"pinyin":["ju2 wai4"],"simplified":["局外"],"rank":38459.0,"normalized_rank":0.5380913072069173,"fraction":4.442099185408596e-7,"cumulative_fraction":0.995851398029988,"word":"局外","characters":[{"definition":["office\/situation\/classifier for games: match, set, round etc"],"pinyin":["ju2"],"word":"局"},{"definition":["outside\/in addition\/foreign\/external"],"pinyin":["wai4"],"word":"外"}],"containing_words":[{"definition":["neutralism"],"pinyin":["ju2 wai4 zhong1 li4"],"word":"局外中立"}],"sentences":[{"english":"You don’t have to be the life of the party, but you can’t be a  wallflower.","chinese":"你不必是聚會的中心，但是你也不能當局外人。"},{"english":"You have the burden and the great joy of being outsiders.","chinese":"作爲一個局外者，你雖然有所揹負，但也很快樂。"},{"english":"It is unwise foranoutsider obtrude his opinions into a family quarrel.","chinese":"局外人硬把自己的想法加入一場家庭爭論中是不智的。"},{"english":"During the suspension of play, an outside agency moves the players ball.","chinese":"在比賽暫停期間，一名局外者移動了球員的球。"},{"english":"I am open to trying new things within reason. I like thinking outside the box.","chinese":"對於新事物，我勇於接受，喜歡以局外人的身份思考。"},{"english":"On Friday, we saw an 'Outside Day' in a range of over 4.00 dollars.","chinese":"週五市場出現局外日，市場有超過4美金的交易範圍。"},{"english":"So far lots of outsiders have responded by trying to become insiders.","chinese":"迄今爲止許多局外人紛紛響應企圖成爲局內人。"},{"english":"It is unwise for an outsider to obtrude his opinions into a family quarrel.","chinese":"局外人硬把自己的想法加入一場家庭爭論中是不智的。"},{"english":"The name came from the two Davids' shared love of outsider art.","chinese":"這個名字來自兩人對局外人藝術的共同的熱愛。"},{"english":"So I learn to be an outsider.","chinese":"所以我變成了一個局外人。"},{"english":"He took office as an outsider and man of the people.","chinese":"他以一個局外人和來自人民的代表身份開始任期。"},{"english":"This practice of painting an \"outgroup\" as homogeneous has a long and dangerous history.","chinese":"將局外人描述成同類的行徑有着深遠而危險的歷史。"},{"english":"Most supermarket magazines are put together by such outside agencies.","chinese":"大部分的超級市場雜誌由這樣的局外出版社進行組配。"},{"english":"Family bonds are closer than those of outsiders.","chinese":"家庭鈕帶比局外人更密切地。"},{"english":"You begin to see the societies as both an outsider and an insider.","chinese":"你開始以局外人和局內人來看待這兩個社會。"},{"english":"What does this observer ab extra represent?","chinese":"這裏置身局外的觀察人代表了什麼？"}],"related":[{"definition":["to watch the fires burning across the river\/to delay entering the fray until all others have been exhausted by fighting amongst themselves (idiom)"],"pinyin":["ge2 an4 guan1 huo3"],"word":"隔岸觀火"},{"definition":["an outsider can see things more clearly or objectively than those involved (idiom)"],"pinyin":["pang2 guan1 zhe3 qing1"],"word":"旁觀者清"},{"definition":["an outsider can see things more clearly or objectively than those involved (idiom)"],"pinyin":["dang1 ju2 zhe3 mi2 , pang2 guan1 zhe3 qing1"],"word":"當局者迷，旁觀者清"},{"definition":["observer\/spectator"],"pinyin":["pang2 guan1 zhe3"],"word":"旁觀者"},{"definition":["the person involved\/the people holding power"],"pinyin":["dang1 shi4 zhe3"],"word":"當事者"},{"definition":["participant\/protagonist\/a player (in this affair)"],"pinyin":["ju2 zhong1 ren2"],"word":"局中人"},{"definition":["clear as a flame (idiom); to see things absolutely clearly"],"pinyin":["dong4 ruo4 guan1 huo3"],"word":"洞若觀火"},{"definition":["state of play in a game of chess\/(old) chessboard"],"pinyin":["qi2 ju2"],"word":"棋局"},{"definition":["sit on the mountain and watch the tigers fight\/watch in safety whilst others fight then reap the rewards when both sides are exhausted (idiom)"],"pinyin":["zuo4 shan1 guan1 hu3 dou4"],"word":"坐山觀虎鬥"},{"definition":["a matter of no concern to oneself (idiom)"],"pinyin":["shi4 bu4 guan1 ji3"],"word":"事不關己"},{"definition":["to feel unconcerned and let matters rest (idiom)"],"pinyin":["shi4 bu4 guan1 ji3 , gao1 gao1 gua4 qi3"],"word":"事不關己，高高掛起"},{"definition":["chaotic situation"],"pinyin":["luan4 ju2"],"word":"亂局"},{"definition":["lit. right and wrong, crooked and straight (idiom); fig. merits and demerits\/pros and cons"],"pinyin":["shi4 fei1 qu1 zhi2"],"word":"是非曲直"},{"definition":["a wise man looks after his own hide (idiom)\/to put one's own safety before matters of principle"],"pinyin":["ming2 zhe2 bao3 shen1"],"word":"明哲保身"},{"definition":["(idiom) to lose one's head\/to panic\/to go to pieces"],"pinyin":["zi4 luan4 zhen4 jiao3"],"word":"自亂陣腳"},{"definition":["lit. eyes obscured by a single leaf (idiom)\/fig. not seeing the wider picture\/can't see the wood for the trees"],"pinyin":["yi1 ye4 zhang4 mu4"],"word":"一葉障目"}]}