{"definition":["unexpectedly\/to one's surprise\/go so far as to"],"pinyin":["ju1 ran2"],"simplified":["居然"],"rank":3100.0,"normalized_rank":0.04337302198032823,"fraction":0.0000462565145342479,"cumulative_fraction":0.7954200133553949,"word":"居然","characters":[{"definition":["(archaic) sentence-final particle expressing a doubting attitude","surname Ju","to reside\/to be (in a certain position)\/to store up\/to be at a standstill\/residence\/house\/restaurant\/classifier for bedrooms"],"pinyin":["Ju1","ji1","ju1"],"word":"居"},{"definition":["correct\/right\/so\/thus\/like this\/-ly"],"pinyin":["ran2"],"word":"然"}],"containing_words":[],"sentences":[{"english":"You hurt my feelings by betraying me when I'm in trouble.","chinese":"你太傷我感情了，居然在我身陷困境之時背叛了我。"},{"english":"However, soon after that, she has a relapse of breast cancer.","chinese":"但是不久，滴發現她的乳癌居然復發。"},{"english":"It' really surprises me that Xiao gives me an ticket of Olympic.","chinese":"確實比較驚喜，老肖居然送我一張奧運門票。"},{"english":"One cannot imagine mere human beings concocting such dreadful things, and one can scarcely imagine human beings bearing life in them.","chinese":"更令人想不到的是，居然還有人類在其中繁衍生息。"},{"english":"You insult the Queen of Burgund in public with these lies?","chinese":"你居然在大庭廣衆下用這種謊言侮辱勃艮的皇后？"},{"english":"I had no idea of thescale of things until I went over last year to give readings.","chinese":"我直到去年去做讀書會才知道居然賣了那麼多。"},{"english":"We choose to go to the moon and other things, not because they are easy, but because they are hard.","chinese":"好容易翻完這麼長這麼專業的東西居然沒人認領？"},{"english":"Have not missed Chen Shi to her gushed is to have a cordiality, incredibly wanted to cry in doctor for her.","chinese":"沒曾想沈氏對她倒是頗有情意，居然要爲她去請大夫。"},{"english":"After a really short explanation, the staff member who came up began to leave.","chinese":"終於上來的員工居然在超快超倉促的解釋後就要走。"},{"english":"One only knows how bloody men, even, for you to tears.","chinese":"一個是隻懂流血的男人，居然，爲你流了淚。"},{"english":"You may think it strange that anyone would live there.","chinese":"你也許感到奇怪，居然有人願意住在那兒。"},{"english":"Ichoate time , I Actually foolish foolish go believe you.","chinese":"剛開始的時候，我居然儍傻去相信禰。"},{"english":"Eyes a bright, incredibly have force monk is having a competition?","chinese":"眼睛一亮，居然有武修士在比試？"},{"english":"Late returns, people find, sammo hung the dwellings of lamp incredibly still on.","chinese":"深夜返回時，大家發現，洪金寶住處的燈居然還亮着。"},{"english":"Yang Hong interrogated in light of this that Manager Hao said unexpectedly looked Yang Hong does not look like the ordinary consumer.","chinese":"楊鴻就此質問，郝經理居然說看楊鴻不像普通消費者。"},{"english":"Wah dares to offend Our Majesty.","chinese":"華太師居然敢得罪我們皇爺。"}],"related":[{"definition":["unexpectedly\/to one's surprise\/in spite of everything\/in that crazy way\/actually\/to go as far as to"],"pinyin":["jing4 ran2"],"word":"竟然"},{"definition":["didn't expect"],"pinyin":["mei2 xiang3 dao4"],"word":"沒想到"},{"definition":["unexpectedly\/actually\/to go so far as to\/indeed"],"pinyin":["jing4"],"word":"竟"},{"definition":["indeed\/truly\/(coll.) (used to express disapproval, annoyance etc about sth)"],"pinyin":["zhen1 shi5"],"word":"真是"},{"definition":["really\/sure enough\/as expected\/if indeed"],"pinyin":["guo3 ran2"],"word":"果然"},{"definition":["unexpected\/hard to imagine\/it had not occurred to me\/who could have thought that"],"pinyin":["xiang3 bu5 dao4"],"word":"想不到"},{"definition":["don't tell me ...\/could it be that...?"],"pinyin":["nan2 dao4"],"word":"難道"},{"definition":["(it's) no wonder (that...)\/(it's) not surprising (that)"],"pinyin":["nan2 guai4"],"word":"難怪"},{"definition":["original\/former\/originally\/formerly\/at first\/so, actually, as it turns out"],"pinyin":["yuan2 lai2"],"word":"原來"},{"definition":["but\/however\/(used for emphasis) indeed"],"pinyin":["ke3 shi4"],"word":"可是"},{"definition":["no wonder!\/so that's why!"],"pinyin":["guai4 bu5 de5"],"word":"怪不得"},{"definition":["obviously\/plainly\/undoubtedly\/definitely"],"pinyin":["ming2 ming2"],"word":"明明"},{"definition":["almost\/nearly"],"pinyin":["cha4 dian3"],"word":"差點"},{"definition":["to appear to be\/to seem as if"],"pinyin":["mao4 si4"],"word":"貌似"},{"definition":["God knows...\/Who would have imagined...?"],"pinyin":["shei2 zhi1 dao4"],"word":"誰知道"},{"definition":["so much\/this much\/how much?\/this way\/like this"],"pinyin":["zhe4 me5"],"word":"這麼"}]}