{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"simplified":["展现"],"rank":2772.0,"normalized_rank":0.03878387642886125,"fraction":0.00005290754716933125,"cumulative_fraction":0.7792338425652325,"word":"展現","characters":[{"definition":["surname Zhan","to spread out\/to open up\/to exhibit\/to put into effect\/to postpone\/to prolong\/exhibition"],"pinyin":["Zhan3","zhan3"],"word":"展"},{"definition":["to appear\/present\/now\/existing\/current"],"pinyin":["xian4"],"word":"現"}],"containing_words":[],"sentences":[{"english":"Her inner male counterpart wrote the book on celebrating the body beautiful.","chinese":"她內心對應的那個男性意向對展現外在美很在行。"},{"english":"You can manifest psionic powers more powerful than the normal limits of manifestation.","chinese":"你可以展現比普通極限更強的靈能。"},{"english":"The beauty host displayed the professional with fluent English.","chinese":"主持人用流利英語開始了慶典，展現了樂其的專業性。"},{"english":"This first volume reveals the crucial initial steps for getting a short film off the ground.","chinese":"這是首卷，展現了一個上下車短片關鍵的第一步。"},{"english":"There lies a vast extension of golden crops before us.","chinese":"一望無際的金燦燦的農作物展現在我們的眼前。"},{"english":"Until then he had been afraid to expose his naked souls.","chinese":"在那之前，他一直害怕展現自己赤露的靈魂。"},{"english":"The cuisine of Singapore can indicate the ethnic diversity of the culture of Singa­pore.","chinese":"新加坡的美食展現了新加坡文化中的種族多樣性。"},{"english":"When riled , the Druids of the Claw display ferocious power and stamina.","chinese":"當被激怒時，利爪德魯依便展現出兇猛的力量和耐力。"},{"english":"We wish Nantong Zhanyang Fiber Co. , Ltd a promising future on the land of Haimen.","chinese":"我們預祝展陽公司在海門大地上展現陽光燦爛的前景。"},{"english":"Don't try to hard:the neconsumedst things come when you least expect them to.","chinese":"英語不要焦心，最好的總會在最不經意的時間展現。"},{"english":"This master model is a full-scale representation of a part design that incorporates all of the geometry for one of the part surfaces.","chinese":"原模應以同樣比例大小展現部件表面的形狀設計。"},{"english":"Yeah, it's a good time for us tinkers to show what we can do, eh ?","chinese":"是啊，可以展現我們工匠們能做些什麼，嗯。"},{"english":"Lush and mouth-filling from start to finish, there is enough acid to support the whole structure while retaining an excellent balance.","chinese":"適當的酸度不但支持了整體結構亦展現了絕佳的平衡。"},{"english":"This is your chance to show off to the people interviewing you.","chinese":"這可是你向面試考官展現你自己的好時機。"},{"english":"He has put over good final balls since the start of the season.","chinese":"從這季初開始，他漂亮的終結傳球會不斷展現。"},{"english":"if possible, demonstrate increasing complexification.","chinese":"如果可能的話，展現不斷增長的複雜性。"}],"related":[{"definition":["to appear\/to emerge\/to present (a certain appearance)\/to demonstrate"],"pinyin":["cheng2 xian4"],"word":"呈現"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"體現"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰顯"},{"definition":["to create\/to bring about\/to produce\/to set (a record)"],"pinyin":["chuang4 zao4"],"word":"創造"},{"definition":["appearance\/to appear"],"pinyin":["xian3 xian4"],"word":"顯現"},{"definition":["to present clearly\/to give prominence to\/to magnify\/clear and obvious"],"pinyin":["tu1 xian3"],"word":"凸顯"},{"definition":["to use\/to put to use"],"pinyin":["yun4 yong4"],"word":"運用"},{"definition":["to interpret\/to comment and explain\/to annotate\/to perform (i.e. interpret a theatrical role)\/to decode\/interpretation\/annotation"],"pinyin":["quan2 shi4"],"word":"詮釋"},{"definition":["(of a story etc) to unfold\/to play out\/to develop (a technique etc)\/to enact\/(logic) to deduce\/to infer"],"pinyin":["yan3 yi4"],"word":"演繹"},{"definition":["to pass on\/to convey\/to relay\/to transmit\/transmission"],"pinyin":["chuan2 da2"],"word":"傳達"},{"definition":["unique\/distinct\/having special characteristics"],"pinyin":["du2 te4"],"word":"獨特"},{"definition":["to build (housing)\/to construct\/to make"],"pinyin":["ying2 zao4"],"word":"營造"},{"definition":["conspicuous\/to make sth stand out\/make sth prominent"],"pinyin":["tu1 xian3"],"word":"突顯"},{"definition":["to display\/to exhibit\/to bring out implicit or innate qualities\/to express (a thought or moral)\/to develop (an idea)\/to elaborate (on a theme)"],"pinyin":["fa1 hui1"],"word":"發揮"},{"definition":["to combine\/to link\/to integrate\/binding\/CL:次[ci4]"],"pinyin":["jie2 he2"],"word":"結合"},{"definition":["to own exclusively\/unique to\/specific\/there is only"],"pinyin":["du2 you3"],"word":"獨有"}]}