{"definition":["more and more emerge\/innumerable succession\/breeding like flies (idiom)"],"pinyin":["ceng2 chu1 bu4 qiong2"],"simplified":["层出不穷"],"rank":10494.0,"normalized_rank":0.14682467505211758,"fraction":0.000007654482842132277,"cumulative_fraction":0.9336288120782308,"word":"層出不窮","characters":[{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"層"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["poor\/destitute\/to use up\/to exhaust\/thoroughly\/extremely\/(coll.) persistently and pointlessly"],"pinyin":["qiong2"],"word":"窮"}],"containing_words":[],"sentences":[{"english":"The century was in full flood of invention.","chinese":"這一世紀有層出不窮的創造發明。"},{"english":"New type viruses appear continuously because the nature is revenged on humans for air pollution.","chinese":"新型病毒層出不窮是自然對人類污染空氣的報復。"},{"english":"Also, much more classes of attack against the QKD system have emerged.","chinese":"各種針對密鑰分發系統的攻擊方案也層出不窮。"},{"english":"Looking at the domestic furnishings industry, product category after another, a variety of styles.","chinese":"放眼國內家飾行業，產品種類層出不窮，風格多樣。"},{"english":"Why is there never a shortage of counterfeit and poor quality products in China?","chinese":"爲什麼假冒僞劣的產品在中國層出不窮？"},{"english":"At present, the encryption technology is maturer and maturer, and new algorithm is created every day.","chinese":"當前的加密技術日趨成熟，加密算法層出不窮。"},{"english":"I've seen hundreds of misapplications and confusions spouted throughout the web and in print.","chinese":"網上和出版物中的濫用和混淆層出不窮。"},{"english":"With their unending fascination for new ideas, Geminis and Sagittarians will never get bored of one another.","chinese":"他們層出不窮的新點子使他們彼此從不會感到厭倦。"},{"english":"Numerous such stories exist, but a reliable testing method does not.","chinese":"此類案例層出不窮，但卻沒有可行地試驗方法。"}],"related":[{"definition":["a common occurrence (idiom)"],"pinyin":["lu:3 jian4 bu4 xian1"],"word":"屢見不鮮"},{"definition":["one after another (idiom)\/in quick succession"],"pinyin":["jie1 er4 lian2 san1"],"word":"接二連三"},{"definition":["to push out the old and bring in the new (idiom); to innovate"],"pinyin":["tui1 chen2 chu1 xin1"],"word":"推陳出新"},{"definition":["a succession of\/a series of"],"pinyin":["yi1 lian2 chuan4"],"word":"一連串"},{"definition":["again and again\/repeatedly"],"pinyin":["lu:3 lu:3"],"word":"屢屢"},{"definition":["(various things) such as\/such as (the following)"],"pinyin":["zhu1 ru2"],"word":"諸如"},{"definition":["you can't guard against it (idiom)\/impossible to defend effectively\/not much one can do about it\/It can't be prevented."],"pinyin":["fang2 bu4 sheng4 fang2"],"word":"防不勝防"},{"definition":["to launder money"],"pinyin":["xi3 qian2"],"word":"洗錢"},{"definition":["to rush like ducks (idiom); the mob scrabbles madly for sth unobtainable\/an unruly crowd on a wild goose chase"],"pinyin":["qu1 zhi1 ruo4 wu4"],"word":"趨之若鶩"},{"definition":["to be related\/to entail\/to involve\/joint (liability etc)"],"pinyin":["lian2 dai4"],"word":"連帶"},{"definition":["to misuse\/to abuse"],"pinyin":["lan4 yong4"],"word":"濫用"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["to involve\/implicated"],"pinyin":["qian1 she4"],"word":"牽涉"},{"definition":["to defraud\/to swindle\/to blackmail"],"pinyin":["zha4 pian4"],"word":"詐騙"},{"definition":["to plunder\/to pillage\/to forcibly take"],"pinyin":["qiang3 duo2"],"word":"搶奪"},{"definition":["to emerge in large numbers\/to spring up\/to emerge prominently"],"pinyin":["yong3 xian4"],"word":"湧現"}]}