{"definition":["laminar flow"],"pinyin":["ceng2 liu2"],"simplified":["层流"],"rank":47883.0,"normalized_rank":0.6699452940271151,"fraction":1.7969845866703852e-7,"cumulative_fraction":0.9986181530116144,"word":"層流","characters":[{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"層"},{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"}],"containing_words":[],"sentences":[{"english":"Application of laminar spray cooling system in Plate Mill of Shougang Group Co.","chinese":"層流冷卻系統在首鋼中厚板廠的應用。"},{"english":"Objector To evaluate the value of laminar flow in the treatment of bums.","chinese":"目的探索層流潔淨技術治療大面積燒傷的價值。"},{"english":"Gas flow is laminar flow, and flow resistance is low in premixing chamber.","chinese":"混合氣體流動爲層流，流動阻力較小。"},{"english":"The heat however requires molecules and grid work to flow down in association with each cell of the form.","chinese":"然而熱量需要分子和晶格層流向身體的每一個細胞。"},{"english":"The sails are adjusted to create a smooth laminar flow over the sail surfaces.","chinese":"船帆的調整，以建立一個平滑層流的帆面。"},{"english":"Are the wafers inspected in a dust-controlled area under laminar air flow equipment?","chinese":"在除塵控制區層流設備下檢驗晶片嗎？"},{"english":"An experimental study was conducted to investigate aerodynamics of group square prisms in turbulent boundary flows.","chinese":"本文中研究方柱體羣於邊界層流中之氣動力現象。"},{"english":"And the long laminar separation bubble is the time-averaged result of that phenomenon.","chinese":"所謂長層流分離泡是其時均化積分的結果。"},{"english":"The new computational models for describing streaming electrification of oil with laminar and turbulent flow states are presented.","chinese":"給出了層流和紊流條件下新的管道油流帶電計算模型。"},{"english":"OBJECTIVE To design the standardization of surroundings administration of laminar air-flow wards.","chinese":"目的設計層流病房護理環境管理標準化方案。"},{"english":"Protection cover or laminar flow could be option according to the requirement.","chinese":"可以選裝防塵罩或者層流罩。"},{"english":"The stability analysis plays a significant role in controlling the transition of the boundary layer of laminar flow.","chinese":"層流邊界層穩定性問題是預測和控制轉捩的重要環節。"},{"english":"Firstly, the steady laminar flow field of a hypersonic sharp cone boundary layer with zero angle of attack was computed.","chinese":"先計算出高超音速零攻角尖錐邊界層的定常層流流場。"},{"english":"This paper presents a detailed analysis of helical flow of Bin-gham fluid in annular space.","chinese":"本文對賓漢流體螺旋流層流流場進行了理論分析。"},{"english":"Plasma Heated Laminar Entrained Flow Reactor.","chinese":"等離子熱層流反應堆。"},{"english":"Laminar flow is characteristic of fluid flow through permeable rocks.","chinese":"流體通過可滲透岩石的流動具有層流的特徵。"}],"related":[]}