{"definition":["stratified\/bedded (geology)"],"pinyin":["ceng2 zhuang4"],"simplified":["层状"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"層狀","characters":[{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"層"},{"definition":["accusation\/suit\/state\/condition\/strong\/great\/-shaped"],"pinyin":["zhuang4"],"word":"狀"}],"containing_words":[{"definition":["unstratified"],"pinyin":["fei1 ceng2 zhuang4"],"word":"非層狀"}],"sentences":[{"english":"Hydrotalcite-like compounds are a sort of anionic clays with double-layer structure.","chinese":"水滑石類化合物是一種具有層狀結構的陰離子粘土。"},{"english":"The cristae of the mitochondria are arranged closely.","chinese":"線粒體內嵴排列緊密，呈板層狀。"},{"english":"Surface morphologies of coatings prepared by SPPS presented obvious layer structure.","chinese":"SPPS法制備的塗層表面形貌呈現明顯的層狀結構。"},{"english":"The method of preparing crystalline sodium disilicate has been studied.","chinese":"研究了合成結晶型層狀二聚硅酸鈉的方法。"},{"english":"The preparation of laminated crystalline sodium silicate from flake caustic soda was discussed.","chinese":"對用片狀燒鹼製備層狀結晶硅酸鈉進行了探討。"},{"english":"The extensional system is a \"horizontal layered\" thin-skinned tectonics at the crustal scale.","chinese":"伸展構造是一種“水平層狀的”薄皮構造。"},{"english":"The reflection peaks of XRD pattern confirmed the trioctahedral layer structure of the product.","chinese":"XRD分析表明合成產物具有典型的皁石層狀結構。"},{"english":"Usually, there are densely distributed small instable rocks in a low-angled stratofabric rock slope.","chinese":"緩傾角層狀巖質邊坡是小危巖體出露的主要坡型之一。"},{"english":"Taoyuan gossan type gold deposit occurs at the upper end of the slant layered pyrite ore body.","chinese":"桃園鐵帽型金礦產於似層狀硫鐵礦體傾斜上端。"},{"english":"Said tubular or pipe-shaped material is wrapped onto an axis.","chinese":"上述筒狀或管狀材料合攏成層狀收卷在一個軸上。"},{"english":"The small laminated pink concretions within the glandular lumens are known as corpora amylacea.","chinese":"腺腔內可見粉紅色層狀的澱粉樣小體。"},{"english":"Steel with lamellar tear resistance is used in oil drilling ships and crude oil production platforms.","chinese":"耐層狀撕裂鋼用於石油鑽井船和原油生產平臺。"},{"english":"The preparation conditions of laminar sodium silicate were discussed.","chinese":"就層狀結晶硅酸鈉的製備條件進行了探討。"},{"english":"The total energy of the layered material decreases after intercalation lithium.","chinese":"在層狀結構材料中嵌入鋰離子，體系總能量降低。"},{"english":"A time domain boundary element model (BEM) is presented for wave propagation problems in layered media.","chinese":"建立了研究層狀介質波動問題的時域邊界元計算模型。"},{"english":"Anorthosite was coeval with or slightly younger than the hosting layered gabbro.","chinese":"斜長巖與層狀輝長岩的時代相近或略晚。"}],"related":[]}