{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"simplified":["层面"],"rank":3195.0,"normalized_rank":0.04470219523456409,"fraction":0.00004467090555127359,"cumulative_fraction":0.7997324833863065,"word":"層面","characters":[{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"層"},{"definition":["face\/side\/surface\/aspect\/top\/classifier for flat surfaces such as drums, mirrors, flags etc"],"pinyin":["mian4"],"word":"面"}],"containing_words":[{"definition":["impact\/effect"],"pinyin":["ying3 xiang3 ceng2 mian4"],"word":"影響層面"}],"sentences":[{"english":"Previous research on the definite article has been conventionally confined to the sentential level of language.","chinese":"傳統的英語定冠詞研究是在句子的層面上進行的。"},{"english":"But I suppose I became interested in taking the carving to another level.","chinese":"但是我覺得我對雕刻的愛好上升到了另一層面。"},{"english":"This is the noumenon affirmation of the historical law.","chinese":"這是在本體論層面對歷史規律存在的肯定。"},{"english":"This article is the research ofluoshan puppet from cultural aspect.","chinese":"本文是從文化學的層面對羅山皮影戲進行研究。"},{"english":"One chooses one thing over another and people always think 'there could have been a better way'.","chinese":"張頤武認爲，青春更多的是一個精神層面上的概念。"},{"english":"This section gives a high-level overview on the implementation of the procedures discussed so far in this article.","chinese":"本節在較高的層面上概述本文前面討論的過程的實現。"},{"english":"The government said the agenda will be set through existing working-level contacts.","chinese":"政府表示將通過工作層面的接觸制定議程。"},{"english":"Emancipating the mind and run through the infiltration of socialism with Chinese characteristics in all levels.","chinese":"解放思想貫穿於滲透於中國特色社會主義的各個層面。"},{"english":"But there was another layer, designed for the people in the ministries.","chinese":"但演說還有另一層面，是說給部長和大臣們聽的。"},{"english":"Fourth, the traditional social philosophy is pluralistic in its values.","chinese":"傳統處世哲學在價值層面呈現著多元取向。"},{"english":"Different kinds of right to resist have different meanings.","chinese":"不同層面的抵抗權有不同的含義。"},{"english":"Imperium has its territorial basis and non-territorial implications.","chinese":"帝權以領土爲基礎，同時又有非領土層面的含義。"},{"english":"Moreover govt is doing nothing for the growth of micro level industries.","chinese":"更重要的是，政府沒有爲微觀層面行業做任何事。"},{"english":"The brand of product has two kinds of nature:function nature and emotion nature.","chinese":"產品品牌具有功能屬性和情感屬性兩個層面。"},{"english":"On one level, this is not surprising.","chinese":"從某種層面上來講這毫不足奇。"},{"english":"But I think we can only do it in a rudimentary sort of way.","chinese":"但我想我們現在只能在基本層面上了解大腦。"}],"related":[{"definition":["category"],"pinyin":["fan4 chou2"],"word":"範疇"},{"definition":["cognition\/cognitive\/understanding\/perception\/awareness\/to be cognizant of\/to recognize\/to realize"],"pinyin":["ren4 zhi1"],"word":"認知"},{"definition":["topic of discussion\/topic\/subject\/issue (under discussion)\/CL:項|项[xiang4]"],"pinyin":["yi4 ti2"],"word":"議題"},{"definition":["domain\/sphere\/field\/territory\/area"],"pinyin":["ling3 yu4"],"word":"領域"},{"definition":["society\/CL:個|个[ge4]"],"pinyin":["she4 hui4"],"word":"社會"},{"definition":["individual"],"pinyin":["ge4 ti3"],"word":"個體"},{"definition":["notion\/thought\/concept\/sense\/views\/ideology\/general impressions"],"pinyin":["guan1 nian4"],"word":"觀念"},{"definition":["to appeal\/to demand (an answer)\/requirement\/demand\/claim\/appeal\/(marketing) message"],"pinyin":["su4 qiu2"],"word":"訴求"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落實"},{"definition":["(line of) thought\/thinking"],"pinyin":["si1 wei2"],"word":"思維"},{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"word":"實踐"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"},{"definition":["knowledge\/CL:門|门[men2]\/intellectual"],"pinyin":["zhi1 shi5"],"word":"知識"},{"definition":["essence\/nature\/innate character\/intrinsic quality"],"pinyin":["ben3 zhi4"],"word":"本質"},{"definition":["stage\/section\/phase\/period\/CL:個|个[ge4]"],"pinyin":["jie1 duan4"],"word":"階段"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"}]}