{"definition":["colloquial term for 生肖[sheng1 xiao4] the animals associated with the years of a 12-year cycle"],"pinyin":["shu3 xiang4"],"simplified":["属相"],"rank":31937.0,"normalized_rank":0.4468400654792719,"fraction":7.93826334875187e-7,"cumulative_fraction":0.99191892177565,"word":"屬相","characters":[{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"},{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"}],"containing_words":[{"definition":["birth year as designated by animal symbols (mouse, ox, tiger etc)"],"pinyin":["sheng1 xiao4 shu3 xiang4"],"word":"生肖屬相"}],"sentences":[{"english":"The most venerated of Chinese zodiac deities , the dragon, has traditionally been a symbol of water.","chinese":"傳說作爲中國人最崇拜的十二屬相之一的龍代表着水。"},{"english":"Although my animal zodiac is pig, I don't want to act like one.","chinese":"儘管我的屬相是豬，我可不像表現得像它一樣。"},{"english":"The Chinese animal signs are a 12-year cycle used for dating the years.","chinese":"十二屬相就是用來紀年的一個十二年的循環。"},{"english":"With these traditions, the Chinese lunar zodiac calendar plays a big role.","chinese":"按照傳統，中國的屬相同樣也是一個重要的角色。"},{"english":"A person's animal sign is connected to his or her birth year.","chinese":"一個人的動物屬相是連接到他或她的出生年份。"},{"english":"Tigers are chiefly known for their bravery, but they also tend to be one of the flashier signs.","chinese":"屬虎的人主要以勇敢著稱，但是虎也是愛炫耀的屬相。"},{"english":"The lunar calendar designates one of 12 zodiac signs to each year.","chinese":"按陰曆的說法，每年十二屬相中的“生肖年”。"},{"english":"I got angry at first, but then I realized he was talking about my Chinese Zodiac symbol.","chinese":"一開始我很生氣，後來才知道，他說的是我的屬相。"},{"english":"Do you know which animal signs are best paired with people born in the Year of Rabbit?","chinese":"你知道屬兔的人和什麼屬相的人最配嗎？"}],"related":[{"definition":["solar calendar\/Western (Gregorian) calendar"],"pinyin":["yang2 li4"],"word":"陽曆"},{"definition":["one's fortune (in astrology)"],"pinyin":["yun4 cheng2"],"word":"運程"},{"definition":["bustling\/energetic"],"pinyin":["feng1 feng1 huo3 huo3"],"word":"風風火火"},{"definition":["one's age, according to the traditional Chinese method of reckoning (i.e. the number of Chinese calendar years in which one has lived). In this system, a person's age is one year at birth, and increases by one year at the beginning of the first solar term 立春[Li4 chun1] each year, rather than on one's birthday.\/as opposed to 足歲|足岁[zu2 sui4]\/see also 實歲|实岁[shi2 sui4]"],"pinyin":["xu1 sui4"],"word":"虛歲"},{"definition":["to err\/to get sth wrong\/to miscalculate\/to misunderstand"],"pinyin":["nong4 cuo4"],"word":"弄錯"},{"definition":["horoscope\/one's fortune"],"pinyin":["yun4 shi4"],"word":"運勢"},{"definition":["lunar calendar"],"pinyin":["yin1 li4"],"word":"陰曆"},{"definition":["to take one's seat according to the ticket number\/(fig.) to put (things or people) in their right place\/to take a general comment as a personal attack"],"pinyin":["dui4 hao4 ru4 zuo4"],"word":"對號入座"},{"definition":["natal chart (astrology)"],"pinyin":["ming4 pan2"],"word":"命盤"},{"definition":["for reference only"],"pinyin":["jin3 gong1 can1 kao3"],"word":"僅供參考"},{"definition":["all one's hopes and efforts come to nothing\/futile"],"pinyin":["yi1 chang2 kong1"],"word":"一場空"},{"definition":["time\/one of the 12 two-hour periods of the day"],"pinyin":["shi2 chen5"],"word":"時辰"},{"definition":["little mistake\/minor offense\/slightly too much"],"pinyin":["xiao3 guo4"],"word":"小過"},{"definition":["civilian post (as opposed to military)\/civil service\/administration"],"pinyin":["wen2 zhi2"],"word":"文職"},{"definition":["parentheses\/brackets"],"pinyin":["kuo4 hao4"],"word":"括號"},{"definition":["to be in a bad mood"],"pinyin":["nao4 qing2 xu4"],"word":"鬧情緒"}]}