{"definition":["Cornus officinalis\/sour mountain date\/herb associated with longevity"],"pinyin":["shan1 zhu1 yu2"],"simplified":["山茱萸"],"rank":55539.0,"normalized_rank":0.7770626670211128,"fraction":7.649227647565245e-8,"cumulative_fraction":0.99955591927166,"word":"山茱萸","characters":[{"definition":["mountain\/hill\/anything that resembles a mountain\/CL:座[zuo4]\/bundled straw in which silkworms spin cocoons\/gable","surname Shan"],"pinyin":["Shan1","shan1"],"word":"山"},{"definition":["cornelian cherry"],"pinyin":["zhu1"],"word":"茱"},{"definition":["cornelian cherry"],"pinyin":["yu2"],"word":"萸"}],"containing_words":[],"sentences":[{"english":"In this paper, a new way is indicated to the exploitation and utilization of Macrocarpiam officinale.","chinese":"本研究爲山茱萸的開發利用開闢了新的途徑。"},{"english":"Today is not one of those days. Outside, the sun is shining, birds are chirping and the dogwood tree is getting ready to bloom.","chinese":"外面，陽光明媚，鳥兒啁啾，山茱萸樹正待開花。"},{"english":"CONCLUSION The best harvesting time and quality evaluation of Cornus officinalis is to be further studied.","chinese":"結論山茱萸的質量評價及採收時間尚待進一步的研究。"},{"english":"People often gather for a party, appreciate chrysanthemums, pin the leaves of Cornus on clothes.","chinese":"人們通常聚會，賞菊，將山茱萸的葉子帶衣服上。"},{"english":"Named cultivars are grafted onto seedling dogwoods.","chinese":"指定的品種嫁接到山茱萸的幼苗上。"},{"english":"New taxa of Cornaceae from China.","chinese":"中國山茱萸科的新分類羣。"},{"english":"The dogwood bud, pale green, is inlaid with russet markings.","chinese":"山茱萸發芽了，在紅褐色的土壤下襯出淡淡的綠意。"},{"english":"Wild dogwoods are often poorly shaped and have an unevenly developed root system.","chinese":"野生的山茱萸通常形狀比較差，且根系的生長不均勻。"},{"english":"Object To study the effective portion in Cornus officinalis Sieb. et Zucc. extract (COE) for the treatment of arrhythmia.","chinese":"目的對山茱萸提取液抗心律失常有效部位進行研究。"},{"english":"Cornel is sour, but tasty and healthy berry.","chinese":"山茱萸這種漿果味酸，但好喫且有益健康。"},{"english":"Study on the ultrasonic wave extraction or solvent extraction of tgco from cornus officinal is sieb. et zucc.","chinese":"超聲波和溶劑法提取山茱萸中總皁甙的工藝研究。"},{"english":"The study aimed to control Cossus orientalis gaede with cornus officinalis as host by biological pesticides.","chinese":"研究生物農藥防治以山茱萸爲寄主的芳香木蠹蛾。"},{"english":"This is how the stuff looks after 10 days…","chinese":"這是10天后山茱萸混合物的樣子。"},{"english":"Lacking a proper environment, dogwoods are sometimes difficulty to establish.","chinese":"沒有合適的環境，山茱萸很難得以生長。"},{"english":"Pale Dogwood increases feminine energy in the air.","chinese":"淡山茱萸粉添加了女性能量。"},{"english":"Comparative pollen morphology of the Cornaceae and allies.","chinese":"山茱萸科及相關諸科之花粉粒形態比較研究。"}],"related":[{"definition":["schizandra (Schisandra chinensis)\/Magnolia vine"],"pinyin":["wu3 wei4 zi3"],"word":"五味子"},{"definition":["root bark of the peony tree (used in TCM)"],"pinyin":["mu3 dan5 pi2"],"word":"牡丹皮"},{"definition":["poria mushroom (Polyporus umbellatus)"],"pinyin":["zhu1 ling2"],"word":"豬苓"},{"definition":["Ningpo figwort (Scrophularia ningpoensis)\/root of Ningpo figwort (used in TCM)"],"pinyin":["xuan2 shen1"],"word":"玄參"},{"definition":["Epimedium, genus of herbaceous flowering plant, cultivated in the Far East as aphrodisiac\/also called barrenwort or horny goatweed (said to resemble crushed goat's testicles)"],"pinyin":["yin2 yang2 huo4"],"word":"淫羊藿"},{"definition":["the root bark of the peony tree"],"pinyin":["dan1 pi2"],"word":"丹皮"},{"definition":["Wolfiporia extensa (a wood-decay fungus)\/fu ling\/tuckahoe"],"pinyin":["fu2 ling2"],"word":"茯苓"},{"definition":["chuanxiong rhizome"],"pinyin":["chuan1 xiong1"],"word":"川芎"},{"definition":["root of herbaceous peony (Paeonia lactiflora), used in TCM"],"pinyin":["bai2 shao2"],"word":"白芍"},{"definition":["King Solomon's seal (plant of genus Polygonatum)"],"pinyin":["huang2 jing1"],"word":"黃精"},{"definition":["the rhizome of large-headed atractylodes (Atractylodes macrocephaia)"],"pinyin":["bai2 zhu2"],"word":"白朮"},{"definition":["Chinese thorowax (Bupleurum chinense)\/root of Chinese thorowax (used in TCM)"],"pinyin":["chai2 hu2"],"word":"柴胡"},{"definition":["Salvia miltiorrhiza"],"pinyin":["dan1 shen1"],"word":"丹參"},{"definition":["dodder (Cuscuta sinensis, a parasitic vine with seeds used in medicine)"],"pinyin":["tu4 si1 zi3"],"word":"菟絲子"},{"definition":["Chinese foxglove (Rehmannia glutinosa), its rhizome used in TCM"],"pinyin":["di4 huang2"],"word":"地黃"},{"definition":["bitter orange (Fructus aurantii) (used in TCM)"],"pinyin":["zhi3 qiao4"],"word":"枳殼"}]}