{"definition":["to diverge\/to branch off the road\/to change (the subject)"],"pinyin":["cha4 kai1"],"simplified":["岔开"],"rank":44499.0,"normalized_rank":0.6225987435814924,"fraction":2.504976076950756e-7,"cumulative_fraction":0.9978972460048252,"word":"岔開","characters":[{"definition":["fork in road\/bifurcation\/branch in road, river, mountain range etc\/to branch off\/to turn off\/to diverge\/to stray (from the path)\/to change the subject\/to interrupt\/to stagger (times)"],"pinyin":["cha4"],"word":"岔"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"}],"containing_words":[],"sentences":[{"english":"But sometimes DHL they will diverge parcel inspection, then their own packaging.","chinese":"但有時DHL他們會岔開包裹檢查，然後自己包裝。"},{"english":"Then you branch off and you have all these special humans.","chinese":"那麼你和你岔開這些特殊的人類。"},{"english":"The road to the coast branches off from the main road in about a mile.","chinese":"通往海邊的路從大路岔開約一英里左右。"},{"english":"The road to the museum turns off here.","chinese":"去博物館的路由這兒岔開。"},{"english":"The corrupt officials tried to sidetrack our investigation.","chinese":"這些貪官污吏企圖岔開我們的調查。"},{"english":"He managed to steer the discussion away from the subject of money.","chinese":"他設法把討論內容從錢的話題上岔開了。"},{"english":"It's difficult to head her off when she talked about her dissolute life.","chinese":"要是她談起她的風流韻事來，你就別想岔開她的話題。"},{"english":"We got side-tracked in our discussion.","chinese":"我們達到討論被岔開了。"},{"english":"The road kept descending and branching off, through meadows misty in the twilight.","chinese":"道路繼續下傾，在模糊的草地裏岔開兩支。"},{"english":"The road branches off here.","chinese":"這條路在這兒岔開了。"},{"english":"The road and railway line diverge at the bottom of the hill.","chinese":"公路和鐵路線在山腳下岔開了。"},{"english":"I gazed round for a means of diverting her thoughts.","chinese":"我向四下裏呆望着，想辦法岔開她的思想。"},{"english":"He stands with his legs wide apart.","chinese":"他岔開腿站在那裏。"}],"related":[]}