{"definition":["(army, police) patrol"],"pinyin":["xun2 luo2 dui4"],"simplified":["巡逻队"],"rank":21976.0,"normalized_rank":0.30747275194828816,"fraction":0.0000019680703653525696,"cumulative_fraction":0.9791197000895816,"word":"巡邏隊","characters":[{"definition":["to patrol\/to make one's rounds\/classifier for rounds of drinks"],"pinyin":["xun2"],"word":"巡"},{"definition":["patrol"],"pinyin":["luo2"],"word":"邏"},{"definition":["squadron\/team\/group\/CL:個|个[ge4]"],"pinyin":["dui4"],"word":"隊"}],"containing_words":[],"sentences":[{"english":"The Indian patrol suffered 25 casualties, and the Chinese 33.","chinese":"印度巡邏隊的傷亡人數是25，而中國傷亡了33人。"},{"english":"Border Patrol Special Response Team searches a hotel room-by-room in New Orleans in response to Hurricane Katrina.","chinese":"邊境特別反映巡邏隊逐屋搜索新奧爾良的一家旅館。"},{"english":"Our patrol on all our fronts contacted no enemy today.","chinese":"今天我方在各條戰線上的巡邏隊均未遭遇敵人。"},{"english":"A naval patrol was sent to reconnoitre the approaches to the bay.","chinese":"一支海軍巡邏隊奉命偵察進入海灣的路線。"},{"english":"A man asked. I'm with the Afton Alps Ski Patrol.","chinese":"一個男的問，我跟阿夫頓阿爾卑斯滑雪巡邏隊在一起。"},{"english":"Our patrols on all our fronts contacted no enemy today.","chinese":"今天我方在各條戰線上的巡邏隊均未遭遇敵人。"},{"english":"That which was directed at Jean Valjean at that moment, was the lantern of the patrol of the right bank.","chinese":"此時照着冉阿讓的，是河右岸的巡邏隊的燈籠。"},{"english":"One of the patrols discovered an arms cache.","chinese":"巡邏隊中有一人發現了一批武器的藏匿之處。"},{"english":"He sent out scouts as well, to make certain no enemy took them unawares.","chinese":"他還派出了巡邏隊，以確保沒有敵人能偷襲他們。"},{"english":"You play as an American patrol which has to go into Vietnamese villages looking for Vietcong sympathisers.","chinese":"你扮演美軍巡邏隊，要深入叢林裏尋找越共通敵者。"},{"english":"As they neared the grape hut, the patrol waded through an irrigation ditch.","chinese":"巡邏隊涉過灌溉水渠，走近葡萄園小屋。"},{"english":"Then, add random patrols inside the walls to verify people's identity.","chinese":"然後在牆內添加隨機巡邏隊，以驗證人員的身份。"}],"related":[]}