{"definition":["working memory"],"pinyin":["gong1 zuo4 ji4 yi4"],"simplified":["工作记忆"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"工作記憶","characters":[{"definition":["work\/worker\/skill\/profession\/trade\/craft\/labor"],"pinyin":["gong1"],"word":"工"},{"definition":["to do\/to grow\/to write or compose\/to pretend\/to regard as\/to feel\/writings or works","worker\/workshop\/(slang) troublesome\/high-maintenance (person)"],"pinyin":["zuo1","zuo4"],"word":"作"},{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"記"},{"definition":["to recollect\/to remember\/memory"],"pinyin":["yi4"],"word":"憶"}],"containing_words":[],"sentences":[{"english":"But the information-integration category learning is not disrupted by the dual working memory load task.","chinese":"而信息整合的類別學習不受工作記憶負荷變化的影響。"},{"english":"ObjectiveTo examine the validities of Working Memory Test Battery (WMTB) in the older adults.","chinese":"目的評估工作記憶成套測驗在中老年人羣中的效度。"},{"english":"Researchers debate the relationship between working memory and long-term memory.","chinese":"研究人員爲工作記憶和長時記憶之間的關係爭論不休。"},{"english":"This reversing is the \"working\" part of working memory.","chinese":"而這個顛倒過程就是工作記憶的“工作”部分。"},{"english":"The capacity of a 17-year-old's working memory was also correlated with allostatic load.","chinese":"一個17歲大的工作記憶狀況同樣也與負荷相關。"},{"english":"First, scientists measured the working memory of 24 police officers.","chinese":"首先，科學家們測量了24名警察的工作記憶。"},{"english":"This research is the first to show that positive mood can negatively impact working memory storage capacity.","chinese":"該研究首次說明，積極情緒有損於工作記憶容量。"},{"english":"How quickly does working memory degrade?","chinese":"工作記憶的消退有多快？"},{"english":"\"People accept that intelligence seems to be related to working memory, \" Cowan said.","chinese":"普遍認爲智力和工作記憶是相關的。"},{"english":"The secondary task was used to interfere with the subcomponents of working memory.","chinese":"結果表明，工作記憶是影響類比推理的一個重要因素。"},{"english":"This group had significantly more developed working memory.","chinese":"這一組青少年的工作記憶明顯要好一些。"}],"related":[]}