{"definition":["engineering graphics\/technical drawing"],"pinyin":["gong1 cheng2 tu2"],"simplified":["工程图"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"工程圖","characters":[{"definition":["work\/worker\/skill\/profession\/trade\/craft\/labor"],"pinyin":["gong1"],"word":"工"},{"definition":["rule\/order\/regulations\/formula\/journey\/procedure\/sequence","surname Cheng"],"pinyin":["Cheng2","cheng2"],"word":"程"},{"definition":["diagram\/picture\/drawing\/chart\/map\/CL:張|张[zhang1]\/to plan\/to scheme\/to attempt\/to pursue\/to seek"],"pinyin":["tu2"],"word":"圖"}],"containing_words":[{"definition":["engineering graphics\/technical drawing"],"pinyin":["gong1 cheng2 tu2 xue2"],"word":"工程圖學"}],"sentences":[{"english":"Layout analysis is the foundation of engineering drawing recognition.","chinese":"工程圖版面分析是實現自動讀圖的前提。"},{"english":"The design of virtual model measuring system for engineering graphics is discussed.","chinese":"研究了工程圖學課程中虛擬測繪模型的設計。"},{"english":"Can you give us the full technical specifications and engineering drawings?","chinese":"你能給我們完整的技術說明和工程圖麼？"},{"english":"The engineer taught us how to read the working drawing.","chinese":"工程師教我們如何看懂工程圖。"},{"english":"The results of the experiment show BPN can be applied to recognize character of engineering drawings.","chinese":"實驗結果表明BP網絡可應用於工程圖中的字符識別。"},{"english":"Also, individual deliverables such as engineering drawings are separate files.","chinese":"當然，二維工程圖是一個分開的文檔。"},{"english":"The paper describes a method that can creat a hole processing program automatically.","chinese":"本文介紹了利用工程圖自動生成孔加工程序的方法。"},{"english":"The recognition of scanned image of engineering drawing is very difficult in pattern recognition.","chinese":"工程圖紙掃描識別一直是模式識別中的難點問題。"},{"english":"In engineering, oblique axonometric drawing is useful.","chinese":"在工程圖中，斜軸測圖是很有用的。"},{"english":"Provide clear visibility to all engineering drawings that refer to a PSCS or CCS.","chinese":"使的所有的工程圖面有一個可視化的參照。"},{"english":"The automatic input and understanding of engineering drawings has been extensively studied for recent years.","chinese":"工程圖自動輸入技術是近年來的研究熱點之一。"},{"english":"This paper describes the present situation of the integrated system of engineering drawings processing.","chinese":"闡述了工程圖紙處理集成系統的發展現狀。"},{"english":"Make copies of engineering drawings for production other company employees as required.","chinese":"爲產品及其他公司職員所需要的工程圖紙副本。"},{"english":"The location of nameplate is specified on the engineering drawing.","chinese":"銘牌的位置在工程圖紙中指定。"},{"english":"Engineering drawings are fundamental to CAD and CAM.","chinese":"工程圖紙是索網式纜索起重機機械生產的基礎。"},{"english":"Analyzes engineering drawings to determine processes necessary to manufacture part.","chinese":"能夠解析工程圖紙，確定生產過程中的必要程序。"}],"related":[]}