{"definition":["erhua variant of 差一點|差一点[cha4 yi1 dian3]"],"pinyin":["cha4 yi1 dian3 'r"],"simplified":["差一点儿"],"rank":48467.0,"normalized_rank":0.6781162117163124,"fraction":1.691880695329794e-7,"cumulative_fraction":0.9987199531373044,"word":"差一點兒","characters":[{"definition":["difference\/discrepancy\/to differ\/error\/to err\/to make a mistake","to differ from\/to fall short of\/lacking\/wrong\/inferior\/Taiwan pr. [cha1]","to send\/to commission\/messenger\/mission"],"pinyin":["cha1","cha4","chai1"],"word":"差"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"},{"definition":["child\/son","non-syllabic diminutive suffix\/retroflex final"],"pinyin":["'r","er2"],"word":"兒"}],"containing_words":[],"sentences":[{"english":"On the quiz, my son was a bit weak on history.","chinese":"我兒子的歷史成績在測試中稍差一點兒。"},{"english":"I just avoided running over the cat.","chinese":"我差一點兒軋著貓。"},{"english":"Of course, then you were nearly crushed to death in front of my eyes.","chinese":"那天，就在我的眼皮底下你差一點兒被車軋死。"},{"english":"The boy was nearly run over by a car.","chinese":"小男孩差一點兒被汽車軋了。"},{"english":"I'm used to high quality and won't take second-best.","chinese":"我用慣高質量的東西，差一點兒的都不行。"},{"english":"The kid almost fell off the bed.","chinese":"那個小孩差一點兒從牀上跌下來。"},{"english":"Poor kid, just lack one point to gett full score.","chinese":"可憐的孩子，差一點兒滿分了。"},{"english":"which nearly got the Footlight Prize this year.","chinese":"它今年差一點兒得了最佳舞臺獎。"},{"english":"I nearly forget that I promised to take you to Shanghai.","chinese":"我差一點兒忘了我曾答應過要帶你去上海的。"},{"english":"At the on the road that go to work, he bumped the person almost.","chinese":"在上班的路上，他差一點兒撞了人。"},{"english":"Dreams of finding lost treasure almost came true recently.","chinese":"最近，找到失躊寶旅的夢想差一點兒變成現實。"}],"related":[]}