{"definition":["erhua variant of 差點|差点[cha4 dian3]"],"pinyin":["cha4 dian3 'r"],"simplified":["差点儿"],"rank":33400.0,"normalized_rank":0.4673093335945042,"fraction":6.970431682657262e-7,"cumulative_fraction":0.9930078319567479,"word":"差點兒","characters":[{"definition":["difference\/discrepancy\/to differ\/error\/to err\/to make a mistake","to differ from\/to fall short of\/lacking\/wrong\/inferior\/Taiwan pr. [cha1]","to send\/to commission\/messenger\/mission"],"pinyin":["cha1","cha4","chai1"],"word":"差"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"},{"definition":["child\/son","non-syllabic diminutive suffix\/retroflex final"],"pinyin":["'r","er2"],"word":"兒"}],"containing_words":[],"sentences":[{"english":"It was a 11)dirty trick, but it killed old Phoebe.","chinese":"這實在是種卑鄙把戲，可差點兒把老菲比笑死。"},{"english":"Ensnared in maya, I am all but dead.","chinese":"在摩耶的誘捕下，我差點兒死去。"},{"english":"She almost conked out when she caught pneumonia last year.","chinese":"她去年得了肺炎，差點兒死掉。"},{"english":"In trying to save him I nearly lost my own life, too.","chinese":"爲了救他，我差點兒把命都搭進去了。"},{"english":"Then children do not live to air almost.","chinese":"差點兒接不住氣兒來。"},{"english":"Clasping to the masts, he endured a sea that almost split the deck.","chinese":"他抓緊桅杆，頂着一陣差點兒把甲板衝成兩半的海浪。"},{"english":"At one point, she nearly died after catching pneumonia and had to undergo an emergency tracheotomy.","chinese":"她因爲肺炎差點兒喪了命，緊急氣管切開術救了她。"},{"english":"It was almost in, but it's definitely out.","chinese":"球差點兒在界內，不過它肯定是出了界。"},{"english":"In the state of Wei, he was besieged and almost killed since he was regarded mistakenly as Yanghu.","chinese":"在衛國，被人誤認爲陽虎而遭困，差點兒丟了老命。"},{"english":"I was so scared that I nearly wet myself.","chinese":"我真害怕，差點兒尿褲子。"},{"english":"I nearly made a fool of myself about the road signs here.","chinese":"這路牌差點兒讓我鬧了個大笑話。"},{"english":"She nearly collapsed and was quickly caught by Severus.","chinese":"她差點兒癱倒在地，西弗勒斯急忙扶住了她。"},{"english":"Genscher nearly bled to death but managed to call police.","chinese":"詹斯特差點兒因失血過多死亡，還好他掙扎着報了警。"},{"english":"I caught the pocket of my coat on a nail; it's nearly torn off.","chinese":"我的上衣口袋給釘子鉤住，差點兒給撕下來。"},{"english":"Snow flying almost crashed into the stone pillars, thanks to Carrie had hand blocking for her in time.","chinese":"雪飛差點兒撞向石柱，幸得嘉儀及時用手替她擋住。"},{"english":"ASHBY is a coming of age\/approaching death comedy drama.","chinese":"《大叔阿什比》是一部差點兒停拍的喜劇片。"}],"related":[]}