{"definition":["Baku, capital of Azerbaijan"],"pinyin":["Ba1 ku4"],"simplified":["巴库"],"rank":33630.0,"normalized_rank":0.4705273319994963,"fraction":6.825913832063947e-7,"cumulative_fraction":0.9931665623350706,"word":"巴庫","characters":[{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"},{"definition":["warehouse\/storehouse\/(file) library"],"pinyin":["ku4"],"word":"庫"}],"containing_words":[],"sentences":[{"english":"All glories to the devotees of the Baku Yatra.","chinese":"所有的榮耀歸於巴庫的奉獻者。"},{"english":"He was an organizer in Batum and Baku factories.","chinese":"他是巴統和巴庫工廠的組織者。"},{"english":"This has left Baku gearing up for the limelight.","chinese":"這一切讓巴庫走到了聚光燈下。"},{"english":"Moreover, corruption can add a premium to many transactions in Baku.","chinese":"此外在巴庫，腐敗是許多交易的潤滑劑。"},{"english":"Baku is a city with a special atmosphere.","chinese":"巴庫是個有着特殊氛圍的城市。"},{"english":"The towers can be seen from any part of Baku.","chinese":"從巴庫的任何一個地方都可以看到火焰大廈。"},{"english":"For several years Baku has been experiencing an incredible building boom.","chinese":"幾年以來，巴庫一直體驗着不可思議的建築狂潮。"},{"english":"She stayed on Bakura, reviving the world from the damaging invasion.","chinese":"蓋麗爾留在巴庫拉，從破壞性的入侵中復興這個世界。"},{"english":"Baku is in the desert and the government rations the water.","chinese":"巴庫處於沙漠地帶，政府對供水採取供給制。"},{"english":"An infant Bacchus or Jupiter is big with his future destiny.","chinese":"作爲嬰兒的巴庫斯或朱庇特正孕育着其未來的命運。"}],"related":[]}