{"definition":["Barents Sea"],"pinyin":["Ba1 lun2 zhi1 Hai3"],"simplified":["巴伦支海"],"rank":42690.0,"normalized_rank":0.5972884865613588,"fraction":2.988162021863752e-7,"cumulative_fraction":0.9974015767831512,"word":"巴倫支海","characters":[{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"},{"definition":["human relationship\/order\/coherence"],"pinyin":["lun2"],"word":"倫"},{"definition":["surname Zhi","to support\/to sustain\/to erect\/to raise\/branch\/division\/to draw money\/classifier for rods such as pens and guns, for army divisions and for songs or compositions"],"pinyin":["Zhi1","zhi1"],"word":"支"},{"definition":["ocean\/sea\/CL:個|个[ge4],片[pian4]\/great number of people or things\/(dialect) numerous","surname Hai"],"pinyin":["Hai3","hai3"],"word":"海"}],"containing_words":[],"sentences":[{"english":"Which had been searching the Barents Sea for weeks, was on its way home.","chinese":"在巴倫支海搜尋了幾個星期之後，正在返航途中。"},{"english":"A sea battle was fought in the Barents Sea between German and British fleets .","chinese":"德國與英國皇家海軍艦隊在巴倫支海發生戰鬥。"},{"english":"The small ship, Elkor, which had been searching the Barents Sea for weeks.","chinese":"小船“埃爾科”號在巴倫支海搜尋了幾個星期之後。"},{"english":"It splits the disputed part of the Barents Sea into two equally sized areas.","chinese":"依據協議，巴倫支海爭議海域一分爲二。"},{"english":"It will allow significant exploration of the region for the first time.","chinese":"在巴倫支海，如此重大的勘探是史無前例的。"},{"english":"Gunner had no qualms about Reno's mission of spying on Soviet submarine maneuvers in the Barents Sea.","chinese":"剛納對到巴倫支海執行監視任務並不擔心。"}],"related":[]}