{"definition":["Badong county in Enshi Tujia and Miao autonomous prefecture 恩施土家族苗族自治州[En1 shi1 Tu3 jia1 zu2 Miao2 zu2 zi4 zhi4 zhou1], Hubei"],"pinyin":["Ba1 dong1"],"simplified":["巴东"],"rank":36244.0,"normalized_rank":0.5071005834371021,"fraction":5.415769956577682e-7,"cumulative_fraction":0.9947619113832412,"word":"巴東","characters":[{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"},{"definition":["east\/host (i.e. sitting on east side of guest)\/landlord","surname Dong"],"pinyin":["Dong1","dong1"],"word":"東"}],"containing_words":[{"definition":["Badong county in Enshi Tujia and Miao autonomous prefecture 恩施土家族苗族自治州[En1 shi1 Tu3 jia1 zu2 Miao2 zu2 zi4 zhi4 zhou1], Hubei"],"pinyin":["Ba1 dong1 xian4"],"word":"巴東縣"}],"sentences":[{"english":"But given Padang's location, the much greater danger is tsunamis.","chinese":"因巴東的地理位置，更容易受海嘯的侵襲。"},{"english":"Officials in Badong have promised Deng a fair hearing.","chinese":"巴東的官員承諾給鄧玉嬌一個公正的審判。"},{"english":"The spatial pattern of Manglietia patungensis was a clumped distribution.","chinese":"巴東木蓮在羣落中呈聚集分佈格局。"},{"english":"I Badong county party secretary Chen row A.","chinese":"我是巴東縣委書記陳行甲。"},{"english":"But these leaves have a distinctive aroma which is the soul of rendang.","chinese":"這些葉有特殊的香味，是巴東味道的靈魂。"},{"english":"But people in Padang now know that means there will be a tsunami,\" said Natawidjaja. (Editing by  Sara Webb and Megan Goldin)","chinese":"但巴東人現在知道那是海嘯的前兆。"},{"english":"There were people who gathered at the gate of Court of Badong County from the early morning 7:oo.","chinese":"從早晨7時許，巴東縣法院門口就開始有人羣聚集。"},{"english":"Houzibao dangerous rock is situated at Huoyanshi village in Badong County on the right bank of Yangtse Rive.","chinese":"猴子包危巖體位於巴東縣信陵鎮火焰石村長江右岸。"}],"related":[]}