{"definition":["Panama Canal"],"pinyin":["Ba1 na2 ma3 Yun4 he2"],"simplified":["巴拿马运河"],"rank":31437.0,"normalized_rank":0.43984441677276737,"fraction":8.303207415906701e-7,"cumulative_fraction":0.991513233601106,"word":"巴拿馬運河","characters":[{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"},{"definition":["to hold\/to seize\/to catch\/to apprehend\/to take\/(used in the same way as 把[ba3]: to mark the following noun as a direct object)"],"pinyin":["na2"],"word":"拿"},{"definition":["horse\/CL:匹[pi3]\/horse or cavalry piece in Chinese chess\/knight in Western chess","surname Ma\/abbr. for Malaysia 馬來西亞|马来西亚[Ma3 lai2 xi1 ya4]"],"pinyin":["Ma3","ma3"],"word":"馬"},{"definition":["to move\/to transport\/to use\/to apply\/fortune\/luck\/fate"],"pinyin":["yun4"],"word":"運"},{"definition":["river\/CL:條|条[tiao2],道[dao4]"],"pinyin":["he2"],"word":"河"}],"containing_words":[],"sentences":[{"english":"The navigation rules and tonnage regulation of Panama Canal.","chinese":"巴拿馬運河的航行和噸位規定。"},{"english":"The Panama Canal opened almost one hundred years ago.","chinese":"巴拿馬運河開通於近100年前。"},{"english":"Alajuela is one of two artificial lakes linked to the Panama Canal (not  pictured).","chinese":"阿拉胡埃拉湖是連接着巴拿馬運河的兩個人工河之一。"},{"english":"An increasing number of ships are built to the Panamax limit to carry the maximum amount of cargo through the canal.","chinese":"此類船隻的日益增加正成爲巴拿馬運河的一大難題。"},{"english":"Navigation lights glow in the background on the Panama Canal.","chinese":"它背後是巴拿馬運河上的導航燈。"},{"english":"The Panama Canal joins two oceans.","chinese":"巴拿馬運河連通兩大洋。"},{"english":"Part of a six-reel film on the construction of the Panama Canal.","chinese":"從空中拍攝的記錄巴拿馬運河的施工的影片。"},{"english":"He travelled from New York to California via the Panama Cannel .","chinese":"他經由巴拿馬運河從紐約到加利福尼亞。"},{"english":"Houston is the closest U.S. port to the Panama Canal.","chinese":"休斯敦是美國港口中最靠近巴拿馬運河的一個。"},{"english":"Through the Panama Canal it is linked with Atlantic ports of Americas and Europe.","chinese":"通過巴拿馬運河，它與美國和歐洲的大西洋港口相連。"}],"related":[]}