{"definition":["to fawn on\/to curry favor with\/to make up to"],"pinyin":["ba1 jie5"],"simplified":["巴结"],"rank":37452.0,"normalized_rank":0.5240020707120171,"fraction":4.866894079576819e-7,"cumulative_fraction":0.9953821090091752,"word":"巴結","characters":[{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"},{"definition":["(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]","knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)"],"pinyin":["jie1","jie2"],"word":"結"}],"containing_words":[{"definition":["lymphatic node\/lymph gland"],"pinyin":["lin2 ba1 jie2"],"word":"淋巴結"},{"definition":["to manage with difficulty\/only just getting by\/in a difficult position"],"pinyin":["ba1 ba1 jie1 jie1"],"word":"巴巴結結"},{"definition":["to flatter someone in a hundred different ways\/assiduous fawning (idiom)"],"pinyin":["bai3 ban1 ba1 jie2"],"word":"百般巴結"}],"sentences":[{"english":"We didn't like him, as he always fawned on the rich.","chinese":"我們不喜歡他，因爲他老是巴結有錢人。"},{"english":"Nodal NK-cell lymphoma are quite rare.","chinese":"在淋巴結中，NK細胞淋巴瘤很少。"},{"english":"Objective:To explore CT features and diagnostic value of castleman disease.","chinese":"目的探討巨淋巴結增生症的CT表現及診斷價值。"},{"english":"Many distant relatives fawned on the rich old man.","chinese":"遠親都來巴結這位有錢的老人。"},{"english":"He tried to wriggle round the man with money,but he failed.","chinese":"他試着用錢巴結那個人，可是失敗了。"},{"english":"He fawns on his rich uncle.","chinese":"他巴結富有的叔叔。"},{"english":"We didn't like him, as he fawned on anyone in an influential position.","chinese":"我不喜歡他，因爲他愛巴結有權勢的人。"},{"english":"Many flattering relatives fawned on the rich old man.","chinese":"許多好諂媚的親戚支巴結那個富有的老人。"},{"english":"Objective To identify intraoperatively the feasibility of lymphatic mapping with methylene.","chinese":"目的研究亞甲藍術中定位胃癌前哨淋巴結的可行性。"},{"english":"Objective To investigate an effective method for detecting lymphatic micrometastasis in gastric carcinoma.","chinese":"目的探討檢測胃癌淋巴結微轉移的有效方法。"},{"english":"Large lymph node swellings must be drained.","chinese":"淋巴結腫大很可能消除。"},{"english":"Indirect sign including carotid lymphnode enlargement was found.","chinese":"同時可發現頸淋巴結腫大徵象。"},{"english":"They could also have enlarged lymph nodes, lethargy and vertigo.","chinese":"他們還可能有淋巴結腫大，嗜睡和眩暈等症狀。"},{"english":"Objective To investigate the D-limonene on the clinical impact of lymph node breast cancer and research.","chinese":"目的探討右旋檸烯對乳腺癌淋巴結轉移的影響。"},{"english":"Did cheeper get mesentery lymph node how cure?","chinese":"幼兒得了腸繫膜淋巴結怎麼醫治呢？"},{"english":"Unilateral inguinal lymphadenopathy is usually a response to infection of an ipsilateral lower extremity.","chinese":"單側腹股溝區淋巴結腫大常是單側下肢感染的反應。"}],"related":[{"definition":["to speak without thinking (idiom)\/to blurt sth out"],"pinyin":["xin4 kou3 kai1 he2"],"word":"信口開河"},{"definition":["to sow dissension (idiom); to drive a wedge between"],"pinyin":["tiao3 bo1 li2 jian4"],"word":"挑撥離間"},{"definition":["lit. to point at the mulberry tree and curse the locust tree\/fig. to scold sb indirectly\/to make oblique accusations (idiom)"],"pinyin":["zhi3 sang1 ma4 huai2"],"word":"指桑罵槐"},{"definition":["making a deer out to be a horse (idiom); deliberate misrepresentation"],"pinyin":["zhi3 lu4 wei2 ma3"],"word":"指鹿為馬"},{"definition":["to bear grudges"],"pinyin":["ji4 hen4"],"word":"記恨"},{"definition":["to think highly of oneself (idiom); giving oneself airs\/arrogant and self-important"],"pinyin":["zi4 shi4 shen4 gao1"],"word":"自視甚高"},{"definition":["to see, hear and obey (idiom); to take advice\/to take sb at his word"],"pinyin":["yan2 ting1 ji4 cong2"],"word":"言聽計從"},{"definition":["to be greedy in getting money"],"pinyin":["tan1 cai2"],"word":"貪財"},{"definition":["to watch with amusement as sb makes a fool of himself"],"pinyin":["kan4 xiao4 hua5"],"word":"看笑話"},{"definition":["old: to reap the consequences of one's words (idiom, from Mencius); modern: to go back on one's word\/to blow hot and cold\/to contradict oneself\/inconsistent"],"pinyin":["chu1 er3 fan3 er3"],"word":"出爾反爾"},{"definition":["outward devotion but inner opposition (idiom); to pay lip service\/to agree overtly, but oppose in secret"],"pinyin":["yang2 feng4 yin1 wei2"],"word":"陽奉陰違"},{"definition":["to force someone to do something"],"pinyin":["qiang3 ren2 suo3 nan2"],"word":"強人所難"},{"definition":["to have a clear view of things\/to adapt to circumstances"],"pinyin":["shi2 shi2 wu4"],"word":"識時務"},{"definition":["to have boundless prospects"],"pinyin":["qian2 tu2 wu2 liang4"],"word":"前途無量"},{"definition":["to coax\/to beguile\/to win over"],"pinyin":["long3 luo4"],"word":"籠絡"},{"definition":["spendthrift and foolish\/sb with more money than sense"],"pinyin":["yuan1 da4 tou2"],"word":"冤大頭"}]}