{"definition":["Ba Jin (1904-2005), novelist, author of the trilogy 家, 春, 秋"],"pinyin":["Ba1 Jin1"],"simplified":["巴金"],"rank":9848.0,"normalized_rank":0.1377862969233137,"fraction":0.000008449185042768634,"cumulative_fraction":0.9284265144020041,"word":"巴金","characters":[{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"},{"definition":["gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)"],"pinyin":["Jin1","jin1"],"word":"金"}],"containing_words":[{"definition":["Parkinson's disease"],"pinyin":["Ba1 jin1 sen1 shi4 zheng4"],"word":"巴金森氏症"}],"sentences":[{"english":"\"Acceptance of the present moment has nothing to do with resignation,\" writes Kabat-Zinn.","chinese":"“接受當下時刻與順從無關，”卡巴金寫道。"},{"english":"I have been reading Ba Jing lately.","chinese":"最近以來我一直在看巴金的作品。"},{"english":"Although 95 years old, Mr. Ba Jin is still hale and hearty.","chinese":"儘管巴金先生已經95歲了，但他仍然精神矍鑠。"},{"english":"Baggins is the wandering Hobbit who found the Ring.","chinese":"巴金斯是常在外遊歷的霍比特人，正是他撿到了魔戒。"},{"english":"I think Ba Jin ranks among the greatest writers.","chinese":"我認爲巴金可以被列入最偉大作家的行列。"},{"english":"Every success Ba Jin made can be considered to be a journey of self-fulfillment.","chinese":"巴金的每一次成功的創作都是一次自我實現的歷程。"},{"english":"Bajin is known as a great writer.","chinese":"巴金以一名偉大的作家而著名。"},{"english":"What was the relationship between the anarchism in Ba Jin's thoughts and the revolutionary democratism?","chinese":"巴金思想中的無政府主義與革命民主主義是什麼關係？"},{"english":"Chapter Six mainly discusses the translation of Ba Jin's works in France.","chinese":"第六章着重討論巴金在法國的譯介情況。"},{"english":"The etiology and pathogenesis of Parkinson's disease are still unknown.","chinese":"巴金森氏病的病因及致病機轉目前仍不清楚。"},{"english":"Bajin, one of the greatest writers in China, is regarded as \"People's Writer\".","chinese":"巴金，中國最著名的作家之一，被譽爲“人民作家”。"},{"english":"Jin who desire to live with the housing system reform so difficult?","chinese":"巴金的願望與住房制度改革誰令居住如此艱難？"},{"english":"Objective To assess the therapeutic effect of Depakin in intractable hiccup after stroke.","chinese":"目的觀察德巴金對卒中後頑固性呃逆的療效。"},{"english":"Tzu Chi General Hospital holds a seminar to raise awareness of Parkinson's disease.","chinese":"慈濟醫院舉辦研討會，提高各界對巴金森氏症的關注。"},{"english":"\"Acceptance of the present moment has nothing to do with resignation, \" writes Kabat-Zinn.","chinese":"“接受當下時刻與順從無關，”卡巴金寫道。"},{"english":"I understand more about the meaning of the nom through this trip.","chinese":"巴金這一次的旅行使我更瞭解一個名詞的意義。"}],"related":[{"definition":["Mao Dun (1896-1981), Chinese novelist"],"pinyin":["Mao2 Dun4"],"word":"茅盾"},{"definition":["Lu Xun (1881-1936), one of the earliest and best-known modern Chinese writers"],"pinyin":["Lu3 Xun4"],"word":"魯迅"},{"definition":["Lao She (1899-1966), Chinese novelist and dramatist"],"pinyin":["Lao3 She3"],"word":"老舍"},{"definition":["Cao Yu (1910-1997), PRC dramatist"],"pinyin":["Cao2 Yu2"],"word":"曹禺"},{"definition":["Ji Xianlin (1911-2009), Chinese linguist and Indologist"],"pinyin":["Ji4 Xian4 lin2"],"word":"季羨林"},{"definition":["Shen Congwen (1902-1988), novelist"],"pinyin":["Shen3 Cong2 wen2"],"word":"沈從文"},{"definition":["Xiao Qian (1910-1999), Mongolian-born, Cambridge-educated journalist active during Second World War in Europe, subsequently famous author and translator"],"pinyin":["Xiao1 Qian2"],"word":"蕭乾"},{"definition":["Hu Shi (1891-1962), original proponent of writing in colloquial Chinese 白話文|白话文[bai2 hua4 wen2]"],"pinyin":["Hu2 Shi4"],"word":"胡適"},{"definition":["Yu Dafu (1896-1945), poet and novelist"],"pinyin":["Yu4 Da2 fu1"],"word":"郁達夫"},{"definition":["Ivan Sergeevich Turgenev (1818-1883), Russian novelist"],"pinyin":["Tu2 ge2 nie4 fu1"],"word":"屠格涅夫"},{"definition":["Guo Moruo (1892-1978), writer, communist party intellectual and cultural apparatchik"],"pinyin":["Guo1 Mo4 ruo4"],"word":"郭沫若"},{"definition":["Zhou Zuoren (1885-1967), brother of Lu Xun 魯迅|鲁迅, academic in Japanese and Greek studies, briefly imprisoned after the war as Japanese collaborator, persecuted and died of unknown causes during the Cultural Revolution"],"pinyin":["Zhou1 Zuo4 ren2"],"word":"周作人"},{"definition":["Xiao Hong (1911-1942), prominent woman writer, originally from Heilongjiang"],"pinyin":["Xiao1 Hong2"],"word":"蕭紅"},{"definition":["Qian Zhongshu (1910-1998), literary academic and novelist, author of the 1947 novel Fortress Beseiged 圍城|围城"],"pinyin":["Qian2 Zhong1 shu1"],"word":"錢鐘書"},{"definition":["Qu Qiubai (1899-1935), politician, Soviet expert of the Chinese communists at time of Soviet influence, publisher and Russian translator, captured and executed by Guomindang at the time of the Long March"],"pinyin":["Qu2 Qiu1 bai2"],"word":"瞿秋白"},{"definition":["Zou Taofen (1895-1944), journalist, political theorist and publisher"],"pinyin":["Zou1 Tao1 fen4"],"word":"鄒韜奮"}]}