{"definition":["Boolean algebra"],"pinyin":["Bu4 er3 dai4 shu4"],"simplified":["布尔代数"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"布爾代數","characters":[{"definition":["cloth\/to declare\/to announce\/to spread\/to make known"],"pinyin":["bu4"],"word":"布"},{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"},{"definition":["to substitute\/to act on behalf of others\/to replace\/generation\/dynasty\/age\/period\/(historical) era\/(geological) eon"],"pinyin":["dai4"],"word":"代"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[],"sentences":[{"english":"Monadic Boolean algebras also have an important connection to modal logic.","chinese":"一元布爾代數還與模態邏輯有重要聯繫。"},{"english":"IDENTITY is also called Exclusive-NOR. The article also discusses operation laws and priorities in Boolean algebra.","chinese":"文中還討論了布爾代數的運算規律和運算次序。"},{"english":"The most intuitive development of boolean algebras arises from the concept of a set algebra.","chinese":"布爾代數最直覺的發展產生與集合代數的概念。"},{"english":"The maximum cut sets of this fault tree are got through the Boolean algebra simplifying method.","chinese":"使用布爾代數化簡法確定了該失效樹的最小割集。"},{"english":"These elements compare two values, producing a boolean result.","chinese":"這些元素比較兩個值，產生一個布爾代數結果。"},{"english":"Monadic Boolean algebras have an important connection to topology.","chinese":"一元布爾代數與拓撲學有重要聯繫。"},{"english":"Every Boolean algebra contains a prime ideal.","chinese":"所有布爾代數都包含一個素理想。"},{"english":"Boolean algebra is the system where electronic computer can do logical operation.","chinese":"布爾代數系是適於電子計算機作邏輯運算的系統。"},{"english":"Simple enumeration method is a convenient method to prove identities in Boolean algebra.","chinese":"簡單列舉法是證明布爾代數恆等式的簡便方法。"},{"english":"The underlying principles of the application of this technology are electrical circuits and Boolean algebra.","chinese":"對這項技術應用的基本原理是電路和布爾代數。"}],"related":[]}