{"definition":["Blackburn"],"pinyin":["Bu4 lai2 ke4 ben3"],"simplified":["布莱克本"],"rank":28341.0,"normalized_rank":0.3965273599820912,"fraction":0.000001091766671300391,"cumulative_fraction":0.988559192389746,"word":"布萊克本","characters":[{"definition":["cloth\/to declare\/to announce\/to spread\/to make known"],"pinyin":["bu4"],"word":"布"},{"definition":["name of weed plant (fat hen, goosefoot, pigweed etc)\/Chenopodium album"],"pinyin":["lai2"],"word":"萊"},{"definition":["abbr. for 克羅地亞|克罗地亚[Ke4 luo2 di4 ya4], Croatia\/(Tw) abbr. for 克羅埃西亞|克罗埃西亚[Ke4 luo2 ai1 xi1 ya4], Croatia"],"pinyin":["Ke4"],"word":"克"},{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"}],"containing_words":[],"sentences":[{"english":"At Blackburn I used to just get the ball and run at people, head down.","chinese":"在布萊克本我習慣於得球后朝人衝過去，然後被放倒。"},{"english":"They were having a laugh and watching the Stoke v Blackburn game.","chinese":"他們有說有笑，一邊看着斯托克城和布萊克本的比賽。"},{"english":"By Richard Clarke Emmanuel Eboue will miss the Premiership game with Blackburn on Saturday.","chinese":"埃布將會錯過週日英超對布萊克本的比賽。"},{"english":"Blackburn received the news in a 2am phone call.","chinese":"布萊克本在凌晨2點通過電話獲知這一喜訊。"},{"english":"I thought we did well against Blackburn's long-ball threat.","chinese":"我想我們很好的應對了布萊克本的長傳威脅。"},{"english":"Increasingly aware of the prospect emerging from Rovers Academy, Sam Allardyce soon picked Jones.","chinese":"他在布萊克本越來越出色，大山姆很快就提拔了瓊斯。"},{"english":"And that means the Addicks have all to play for according to Pardew, starting at Ewood Park next weekend.","chinese":"這意味着查爾頓將在下週的比賽中力戰布萊克本隊。"},{"english":"SEEMA: I grew up in a Muslim Asian family in Blackburn.","chinese":"我在布萊克本的一個亞洲穆斯林教徒家庭中長大的。"},{"english":"A more realistic dream was playing one day at Ewood Park.","chinese":"當時一個比較現實的夢想是進入布萊克本。"},{"english":"Blackburn boss Sam Allardyce was also keeping a close on eye on the forward's situation.","chinese":"布萊克本的教練阿勒代斯同樣對這名天才密切關注。"},{"english":"Blackburn and Greider discovered telomerase.","chinese":"布萊克本又和格萊德爾一起發現了端粒酶。"}],"related":[]}