{"definition":["the master leads you to the door, the rest is up to you\/you can lead a horse to water but you can't make him drink"],"pinyin":["shi1 fu5 ling3 jin4 men2 , xiu1 xing2 zai4 ge4 ren2"],"simplified":["师父领进门，修行在个人"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"師父領進門，修行在個人","characters":[{"definition":["surname Shi","teacher\/master\/expert\/model\/army division\/(old) troops\/to dispatch troops"],"pinyin":["Shi1","shi1"],"word":"師"},{"definition":["father"],"pinyin":["fu4"],"word":"父"},{"definition":["neck\/collar\/to lead\/to receive\/classifier for clothes, mats, screens etc"],"pinyin":["ling3"],"word":"領"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"},{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["Men2","men2"],"word":"門"},{"word":"，"},{"definition":["surname Xiu","to decorate\/to embellish\/to repair\/to build\/to write\/to cultivate\/to study\/to take (a class)"],"pinyin":["Xiu1","xiu1"],"word":"修"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"},{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"},{"definition":["individual\/this\/that\/size\/classifier for people or objects in general"],"pinyin":["ge4"],"word":"個"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"}],"containing_words":[],"sentences":[],"related":[]}