{"definition":["to spur\/to provide impetus\/to drive"],"pinyin":["dai4 dong4"],"simplified":["带动"],"rank":2242.0,"normalized_rank":0.03136848879996642,"fraction":0.00006671119156539555,"cumulative_fraction":0.7478018117809654,"word":"帶動","characters":[{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"帶"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"}],"containing_words":[],"sentences":[{"english":"He is a greto football player, from all accounts.","chinese":"外傳他是個很不了起的足球運帶動。"},{"english":"We experimented with diesel engines to drive the pumps.","chinese":"我們試着用柴油機來帶動水泵。"},{"english":"Join type to adopt bent elbow expand force organization, it is smoothly reliable to work;","chinese":"合型採用曲肘擴力機構，液壓馬達帶動齒輪調模裝置。"},{"english":"The propeller turns a small d. c. generator .","chinese":"螺旋槳帶動一個小型直流發電機。"},{"english":"It has been implicated in the Reformation, the Renaissance and the Scientific Revolution.","chinese":"文藝復新時期和科學時期帶動了印刷業的改革。"},{"english":"The development of network teaching is necessarily to drive the innovation in hist …","chinese":"網絡教學的發展與普及必將帶動高中歷史教學的改革。"},{"english":"Liu Xiang is the most hardworking sportsman that I have ever seen.","chinese":"劉翔是我所見過的最勤奮的運帶動。"},{"english":"And his clear moving tips protected me effectively from making mistakes.","chinese":"而他明顯的帶動暗示，也真的有效避免了我踏錯舞步。"},{"english":"Simultaneously the citizen's recreational action has spurred the out comers'participation.","chinese":"市民的環城遊憩活動同時又帶動了外來旅遊者的參與。"},{"english":"Chonggao crude oil fell yesterday, the US-led rebound stabilized.","chinese":"昨日原油衝高回落，帶動美豆止跌反彈。"},{"english":"An extension of the spindle shaft drives a counter for totalizing discharge.","chinese":"心軸的延長部分帶動一個累計流量的計量器。"},{"english":"This is expected to drive large private and foreign follow-up.","chinese":"這可望帶動大量民資和外資的跟進。"},{"english":"Is us, control the locomotive , drive the car case?","chinese":"是我們，駕馭了車頭，帶動着車箱？"},{"english":"The development of this country helps other satellite countries to develop.","chinese":"這個國家的發展帶動了周圍許多衛星國的發展。"},{"english":"New explorations should be made for the key fields of results-based projects drive strategy.","chinese":"在項目帶動的重點領域上實現新開拓。"},{"english":"China's sustained and rapid economic development, led to the development of freight forwarding and logistics.","chinese":"中國經濟持續高速發展，帶動了貨代和物流的發展。"}],"related":[{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["effect (scientific phenomenon)"],"pinyin":["xiao4 ying4"],"word":"效應"},{"definition":["industry\/estate\/property\/industrial"],"pinyin":["chan3 ye4"],"word":"產業"},{"definition":["to continue\/to persist\/sustainable\/preservation"],"pinyin":["chi2 xu4"],"word":"持續"},{"definition":["tourism industry"],"pinyin":["lu:3 you2 ye4"],"word":"旅遊業"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"發展"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引領"},{"definition":["to grow\/to increase"],"pinyin":["zeng1 zhang3"],"word":"增長"},{"definition":["a wound\/cut\/injury\/trauma","to begin\/to initiate\/to inaugurate\/to start\/to create"],"pinyin":["chuang1","chuang4"],"word":"創"},{"definition":["to expand\/to enlarge\/to broaden one's scope"],"pinyin":["kuo4 da4"],"word":"擴大"},{"definition":["economic development"],"pinyin":["jing1 ji4 fa1 zhan3"],"word":"經濟發展"},{"definition":["to achieve\/to implement\/to realize\/to bring about"],"pinyin":["shi2 xian4"],"word":"實現"},{"definition":["strong\/powerful\/robust"],"pinyin":["qiang2 jing4"],"word":"強勁"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["slab\/(geology) tectonic plate\/(fig.) sector (of the stock market or of industry)\/(economic) bloc"],"pinyin":["ban3 kuai4"],"word":"板塊"},{"definition":["one step further\/to move forward a step\/further onwards"],"pinyin":["jin4 yi1 bu4"],"word":"進一步"}]}