{"definition":["to take along with one"],"pinyin":["dai4 qu5"],"simplified":["带去"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"帶去","characters":[{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"帶"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"It makes sense that money can never be brought or taken, as always said.","chinese":"老生常談的錢財生不帶來死不帶去是有道理的。"},{"english":"Because it's very easy to carry.","chinese":"因爲帶來帶去很方便。"},{"english":"They have taken away Chinese nation's bright civilization for the country of residence.","chinese":"他們爲僑居國帶去了中華民族的燦爛文明。"},{"english":"Why did you not carry them away with your forks and spoons?","chinese":"您爲什麼沒有把那對燭臺和餐具一同帶去呢？"},{"english":"Living not bring death, there is no reason to care too much.","chinese":"生不帶來，死不帶去，實在沒有理由過分在意。"},{"english":"They had even taken the son of one tenant to the police station.","chinese":"他們甚至把一個住戶的孩子帶去了警察局。"},{"english":"Love this stuff, pving not bring, bring death.","chinese":"愛情這種東西，生不帶來，死不帶去的。"},{"english":"The ice cream, can always take away ice crisp cool enjoyment to the people.","chinese":"雪糕，總能給人們帶去冰爽清涼的享受。"},{"english":"Mana Ina, on the other hand, was brought to Manila by his uncles.","chinese":"而曼娜艾娜，則被她舅舅帶去了馬尼拉。"},{"english":"The jester took the gold chain to Princess Lenore.","chinese":"小丑把金項鍊帶去給麗諾兒公主。"},{"english":"He carries the picture in his wallet to this day.","chinese":"那天，他把放在錢包裏的照片帶去了。"},{"english":"The Bourbons carried away with them respect, but not regret.","chinese":"波旁家族帶去了尊敬的心，卻沒有帶走惋惜的心。"},{"english":"You can\\\\'t take your money and fame with you after you die.","chinese":"金錢和名譽都是生不帶來死不帶去的。"},{"english":"Every year we took more and more plays to court at Christmas.","chinese":"每年聖誕，我們都給宮廷帶去更多的戲劇。"},{"english":"He alone moves poetry north of Boston.","chinese":"他一個人把詩歌帶去了波士頓北部。"},{"english":"Because you can't take it with you .","chinese":"因爲錢這東西，生不帶來，死不帶去。"}],"related":[]}