{"definition":["shingles\/herpes zoster (medicine)"],"pinyin":["dai4 zhuang4 pao4 zhen3"],"simplified":["带状疱疹"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"帶狀皰疹","characters":[{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"帶"},{"definition":["accusation\/suit\/state\/condition\/strong\/great\/-shaped"],"pinyin":["zhuang4"],"word":"狀"},{"definition":["pimple\/acne\/blister\/boil\/ulcer"],"pinyin":["pao4"],"word":"皰"},{"definition":["measles\/rash"],"pinyin":["zhen3"],"word":"疹"}],"containing_words":[],"sentences":[{"english":"Conclusion The eye lesions of herpes zoster ophthalmicus were…","chinese":"結論眼部帶狀皰疹損害廣泛，及時正確治療十分重要。"},{"english":"Objective To observe the clinical efficacy of flashing-fire moxibustion for herpes zoster.","chinese":"目的觀察閃火灸法治療帶狀皰疹的療效。"},{"english":"They are usually black colored and have the appearance of normal shingles .","chinese":"他們通常都是黑色，外觀正常的帶狀皰疹。"},{"english":"Objective To observe effects of dialectical nursing combined with blood-letting puncture and cupping on herpes zoster.","chinese":"目的觀察辨證施護配合刺血拔罐治療帶狀皰疹的效果。"},{"english":"Objective To investigate the clinical manifestation and treatment of herpes zoster ophthalmicus.","chinese":"目的瞭解眼部帶狀皰疹的臨牀表現及治療情況。"},{"english":"This article misdiagnoses to 1 example belt-shaped blister measles carries on the analysis, summarizes the experience.","chinese":"本文對1例帶狀皰疹誤診進行分析，總結經驗。"},{"english":"It was controversial of using glucocorticoid in the treatment of herpes zoster.","chinese":"糖皮質激素用於帶狀皰疹的治療曾一度存在着爭議。"},{"english":"Objective To study the clinical characteristics of herpes zoster and to compare the cell-mediated immune function of patients.","chinese":"目的探討帶狀皰疹的臨牀特徵及細胞免疫功能。"},{"english":"Shingles, slates, and branches are blown off.","chinese":"帶狀皰疹，板岩，和分支吹走。"},{"english":"The different therapy was used for deferent parts of herpes zoster .","chinese":"不同部位的帶狀皰疹應用不同療法。"},{"english":"Objective To investigate the clinical efficacy of blood-letting puncture and cupping for treating acute herpes zoster.","chinese":"目的觀察刺絡拔罐治療急性期帶狀皰疹的臨牀療效。"},{"english":"Objective to evaluate the clinical effect of Longdan Xiegan decoction modified fast treating sudden-onset herpes zoster.","chinese":"目的臨牀龍膽瀉肝湯加減速治帶狀皰疹的療效。"},{"english":"Shingles (herpes zoster virus) is a painful viral infection of the nerve roots.","chinese":"帶狀皰疹是一種引起神經根疼痛的病毒感染。"},{"english":"Objective To study the effect of intradermic injection on the postherpetic neuralgia.","chinese":"目的探討皮內注射治療帶狀皰疹後神經痛的效果。"},{"english":"The different nerve block therapy was used for deferent parts of herpes zoster.","chinese":"不同部位的帶狀皰疹應用不同的神經阻滯治療方法。"},{"english":"And also a new research of anti-varicella-zoster virus drugs was reviewed, with looking into the future.","chinese":"展望治療水痘帶狀皰疹病毒的新藥研究前景。"}],"related":[]}