{"definition":["to carry a disease\/carrier\/vector"],"pinyin":["dai4 bing4"],"simplified":["带病"],"rank":20999.0,"normalized_rank":0.29380325437577826,"fraction":0.000002157841280273081,"cumulative_fraction":0.9771083518831709,"word":"帶病","characters":[{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"帶"},{"definition":["illness\/CL:場|场[chang2]\/disease\/to fall ill\/defect"],"pinyin":["bing4"],"word":"病"}],"containing_words":[{"definition":["to look unwell"],"pinyin":["mian4 dai4 bing4 rong2"],"word":"面帶病容"}],"sentences":[{"english":"Good, because I don't think my girlfriend would be too happy with sick flowers!","chinese":"很好，我想我女朋友也不會太喜歡帶病的花兒。"},{"english":"Neglected tropical diseases are a symptom of poverty and disadvantage.","chinese":"熱帶病被忽視這一現象是貧窮落後的象徵。"},{"english":"Dengue is spread through the bite of infected mosquitoes.","chinese":"登革熱是經由帶病毒的蚊蟲叮咬進行傳播的。"},{"english":"The neglected tropical diseases provide another example of our solidarity.","chinese":"被忽視的熱帶病是我們團結一致的另一個例子。"},{"english":"She says people showing up at work sick are a much bigger concern than people missing work when they're not really ill.","chinese":"她說帶病上班的人比那些裝病請假的人更令人擔憂。"},{"english":"The feasibility of sterilizing the soil and cotton seeds infected with cotton wilt fungus was discussed.","chinese":"討論了用溴甲烷處理帶病土壤和種子的可行性。"},{"english":"The grapevine viruses were serious damage in Lanzhou and some old grapevine area.","chinese":"蘭州地區和一些老的葡萄產區葡萄帶病毒病較嚴重。"},{"english":"Yes, there's a financial price to coming to work ill.","chinese":"沒錯，帶病上班是有經濟代價的，這叫做假性出席。"},{"english":"The ancestors to perform his duties back to the city hall, Confucianism, persuaded him to go home and rest.","chinese":"繼祖帶病回市政廳工作，敦儒勸他回家休息。"},{"english":"Health development includes the chronic diseases and the neglected tropical diseases.","chinese":"衛生髮展包括慢性病和被忽視的熱帶病。"},{"english":"they get sick, infect one another, then bring the disease back home.","chinese":"他們患病又感染其他人，然後又帶病回家。"}],"related":[]}