{"definition":["routine\/everyday business\/daily operation (of a company)"],"pinyin":["chang2 wu4"],"simplified":["常务"],"rank":4010.0,"normalized_rank":0.056105102626166525,"fraction":0.00003304685310188479,"cumulative_fraction":0.8309784345919059,"word":"常務","characters":[{"definition":["always\/ever\/often\/frequently\/common\/general\/constant","surname Chang"],"pinyin":["Chang2","chang2"],"word":"常"},{"definition":["affair\/business\/matter\/to be engaged in\/to attend to\/by all means"],"pinyin":["wu4"],"word":"務"}],"containing_words":[{"definition":["Standing Committee of the National People's Congress"],"pinyin":["Quan2 guo2 Ren2 min2 Dai4 biao3 Da4 hui4 Chang2 wu4 Wei3 yuan2 hui4"],"word":"全國人民代表大會常務委員會"},{"definition":["standing committee (e.g. of National People's Congress)"],"pinyin":["chang2 wu4 wei3 yuan2 hui4"],"word":"常務委員會"},{"definition":["permanent member of council"],"pinyin":["chang2 wu4 li3 shi4"],"word":"常務理事"}],"sentences":[{"english":"Member of China Korea Japan culture exchange association.","chinese":"中國名人文化藝術交流中心常務理事。"},{"english":"Barbara agreed to conduct the meeting pending the election of a permanent chairman.","chinese":"巴巴拉同意主持那個會議直到選舉出常務主席。"},{"english":"Its permanent body is the Standing Committee of the National People’s Congress.","chinese":"它的常設機關是全國人民代表大會常務委員會。"},{"english":"Once a member of the Standing Committee of the Consultative Committee for the Basic Law of MSAR.","chinese":"曾任澳門基本法諮詢委員會常務委員。"},{"english":"Jade sentimental hand can not run out, the king of the glass cup.","chinese":"玉多情手不了侮辱跑了出去，金常務摔掉杯子泄氣。"},{"english":"The establishment of adjudicatory apparatus and administrative offices of the maritime courts shall be decided by the Supreme People's Court.","chinese":"海事法院對所在地的市人民代表大會常務委員會負責。"},{"english":"His fourth wife is an executive director at SJM.","chinese":"他的第四人夫人還是SJM的常務董事。"},{"english":"Zhang is vice chairman and an executive director of the company.","chinese":"張春江是中移動的副總裁兼常務董事。"},{"english":"Sri Mulyani Indrawati is Managing Director of the World Bank Group and a former finance minister of Indonesia.","chinese":"世界銀行集團常務董事，曾任印尼財政部長。"},{"english":"Now, we welcome Mr. Zhang Xiaolin, Executive Vice Mayor of Hefei to deliver his remarks.","chinese":"下面首先請合肥市常務副市長張曉麟先生致辭。"},{"english":"Now He is the managing director of the Clinical Branch of China Acupuncture and Moxibustion Association.","chinese":"現任中國鍼灸學會臨牀分會常務理事。"},{"english":"Standing Vice President Jiang Yiman of the Red Cross Society of China (RCSC) was present at the signing ceremony.","chinese":"中國紅十字會常務副會長江亦曼參加了簽字儀式。"},{"english":"DSG receives the decorated cans already necked in, he says.","chinese":"常務副祕書長收到裝飾已領罐中，他說。"},{"english":"The advisers shall be appointed or removed by the Standing Committee of the National People's Congress.","chinese":"顧問由全國人民代表大會常務委員會任免。"},{"english":"Any law returned by the Standing Committee of the National People's Congress shall immediately be invalidated.","chinese":"經全國人民代表大會常務委員會發回的法律立即失效。"},{"english":"Executive vice president of Shanghai Conservatory of Music.","chinese":"是上海音樂學院常務副院長徐孟東先生。"}],"related":[{"definition":["deputy chair of board\/vice-president (of a university etc)"],"pinyin":["fu4 yuan4 zhang3"],"word":"副院長"},{"definition":["assistant (government) minister"],"pinyin":["fu4 bu4 zhang3"],"word":"副部長"},{"definition":["vice-secretary"],"pinyin":["fu4 mi4 shu1 zhang3"],"word":"副秘書長"},{"definition":["secretary-general"],"pinyin":["mi4 shu1 zhang3"],"word":"秘書長"},{"definition":["head of a (government etc) department\/section chief\/section head\/secretary\/minister\/CL:個|个[ge4],位[wei4],名[ming2]"],"pinyin":["bu4 zhang3"],"word":"部長"},{"definition":["department head\/section chief"],"pinyin":["chu4 zhang3"],"word":"處長"},{"definition":["the head of an institution whose name ends in 院[yuan4]\/chair of a board\/president of a university\/department head\/dean\/premier of the Republic of China\/CL:個|个[ge4]"],"pinyin":["yuan4 zhang3"],"word":"院長"},{"definition":["director general"],"pinyin":["li3 shi4 zhang3"],"word":"理事長"},{"definition":["vice-principal"],"pinyin":["fu4 xiao4 zhang3"],"word":"副校長"},{"definition":["head of provincial PRC government department"],"pinyin":["ting1 zhang3"],"word":"廳長"},{"definition":["United Front Work Department of CCP Central Committee (UFWD)\/abbr. for 統一戰線工作部|统一战线工作部[Tong3 yi1 Zhan4 xian4 Gong1 zuo4 bu4]"],"pinyin":["Tong3 Zhan4 bu4"],"word":"統戰部"},{"definition":["abbr. for 中國文學藝術界聯合會|中国文学艺术界联合会, China Federation of Literary and Art Circles (CFLAC)"],"pinyin":["Wen2 lian2"],"word":"文聯"},{"definition":["researcher"],"pinyin":["yan2 jiu1 yuan2"],"word":"研究員"},{"definition":["secretary (chief official of a branch of a socialist or communist party)\/clerk\/scribe"],"pinyin":["shu1 ji5"],"word":"書記"},{"definition":["the Communist Youth League, abbr. for 共產主義青年團|共产主义青年团[Gong4 chan3 zhu3 yi4 Qing1 nian2 tuan2]"],"pinyin":["Gong4 qing1 tuan2"],"word":"共青團"},{"definition":["Propaganda Department"],"pinyin":["Xuan1 chuan2 bu4"],"word":"宣傳部"}]}