{"definition":["interferometer (physics)"],"pinyin":["gan1 she4 yi2"],"simplified":["干涉仪"],"rank":63967.0,"normalized_rank":0.8949813216179536,"fraction":2.0290890133808568e-8,"cumulative_fraction":0.9999348960221129,"word":"干涉儀","characters":[{"definition":["to concern\/to interfere\/shield\/stem"],"pinyin":["gan1"],"word":"干"},{"definition":["to wade\/to be involved\/to concern\/to experience\/to enter (classical)"],"pinyin":["she4"],"word":"涉"},{"definition":["apparatus\/rites\/appearance\/present\/ceremony"],"pinyin":["yi2"],"word":"儀"}],"containing_words":[],"sentences":[{"english":"It has peculiar character comparing with other interferometers.","chinese":"與其它干涉儀相比，具有獨特的優點。"},{"english":"The application of Michelson interference principle in measuring small displacement is introduced.","chinese":"介紹邁克爾遜干涉儀原理在測微小位移中的應用。"},{"english":"Compared with the common Sagnac interferometers , its dynamic range is extended.","chinese":"與一般干涉儀相比其工作動態範圍可以擴大數百倍。"},{"english":"The ultrasonic interference mercury manometer of NBS represents the highest level in the world.","chinese":"NBS超聲干涉儀水銀壓力計，爲國際最高水平。"},{"english":"A method of measuring gas concentration with Michelson interferometer is presented.","chinese":"本文介紹用邁克爾遜干涉儀測量氣體濃度的一種方法。"},{"english":"Active mirror is one of the key parts in the stellar interferometer.","chinese":"主動鏡是恆星光干涉儀中的關鍵部件之一。"},{"english":"The second image is obtained by rotating the cross-grating interferometer an angle about its axis of symmetry.","chinese":"將光柵干涉儀繞其對稱軸轉過一角度，得到第二個像。"},{"english":"A multi-wavelength diode laser interferometer for the measurement of surface profiles has been developed.","chinese":"採用多波長二極管激光器干涉儀測量表面輪廓。"},{"english":"The polarization of light is not negligible in the interferometers.","chinese":"在干涉儀中，光的偏振態是不可忽視的。"},{"english":"An interferometer invented by Michelson was used by Michelson and Morely.","chinese":"邁克耳孫和莫雷使用一臺邁克耳孫發明的干涉儀。"},{"english":"A beam splitter is one of the main working parts in any interferometer.","chinese":"分束器是所有干涉儀裏主要工作元件之一。"},{"english":"A holographic three-slit interferometer is described in which the phase of one lateral slit is modulated.","chinese":"本文介紹了調製一條邊縫光路位相的全息三縫干涉儀。"},{"english":"Several kind of applications of infrared interferometer is researched.","chinese":"深入研究了紅外干涉儀的多種應用途徑。"},{"english":"This paper analyses and studies the interferometer made of self-focusing bar.","chinese":"本文分析並研究了用自聚焦棒做成的干涉儀。"},{"english":"The simulation results show that, this method is effective to obtain precise direction of LBI baseline.","chinese":"仿真表明，該算法能夠有效獲得干涉儀的空間指向。"},{"english":"The two LIGO interferometers work together as one observatory.","chinese":"這二套LIGO干涉儀在一起工作構成一個觀測所。"}],"related":[]}