{"definition":["handcart\/trolley\/flatbed truck"],"pinyin":["ping2 ban3 che1"],"simplified":["平板车"],"rank":37027.0,"normalized_rank":0.5180557693114882,"fraction":5.055205218228711e-7,"cumulative_fraction":0.9951714910293612,"word":"平板車","characters":[{"definition":["flat\/level\/equal\/to tie (make the same score)\/to draw (score)\/calm\/peaceful\/see also 平聲|平声[ping2 sheng1]","surname Ping"],"pinyin":["Ping2","ping2"],"word":"平"},{"definition":["board\/plank\/plate\/shutter\/table tennis bat\/clappers (music)\/CL:塊|块[kuai4]\/accented beat in Chinese music\/hard\/stiff\/to stop smiling or look serious"],"pinyin":["ban3"],"word":"板"},{"definition":["car\/vehicle\/CL:輛|辆[liang4]\/machine\/to shape with a lathe\/Kangxi radical 159","surname Che","war chariot (archaic)\/rook (in Chinese chess)\/rook (in chess)"],"pinyin":["Che1","che1","ju1"],"word":"車"}],"containing_words":[],"sentences":[{"english":"To clarify the weight to load and the flatbed's rated load; it can not be overloaded.","chinese":"要弄清所載物的重量和平板車的額定負荷，不能超載。"},{"english":"The railroad has been piggybacking for quite a number of years.","chinese":"許多年來鐵路上一直用火車平板車裝運。"},{"english":"It sat on top of a small flatbed with wooden wheels, drawn by the yoked oxen from the field.","chinese":"靈柩被安置在木輪的平板車上，由上了軛的水牛拉着。"},{"english":"Public works trucks line up to load sand onto their flatbeds.","chinese":"公共工程車輛成排地往平板車上裝沙子。"},{"english":"So she found a flat truck and took him to the doctor for acupuncturing every other day.","chinese":"她找來一輛平板車，每兩天就拉着他翻山去扎一次針。"},{"english":"He took away our big color television on a flatbed tricycle.","chinese":"他用平板車拉走了我家的大彩電。"},{"english":"It is unparallel that track pile driver can be transferred with a flat truck.","chinese":"步履樁機用一輛平板車轉場此爲先例。"},{"english":"Steering system is the core component of shipyard transporter.","chinese":"轉向系統是大型平板車行駛的核心部件。"}],"related":[]}