{"definition":["without good cause"],"pinyin":["ping2 bai2 wu2 gu4"],"simplified":["平白无故"],"rank":41442.0,"normalized_rank":0.5798273473899235,"fraction":3.3516463127499624e-7,"cumulative_fraction":0.9970064987004588,"word":"平白無故","characters":[{"definition":["flat\/level\/equal\/to tie (make the same score)\/to draw (score)\/calm\/peaceful\/see also 平聲|平声[ping2 sheng1]","surname Ping"],"pinyin":["Ping2","ping2"],"word":"平"},{"definition":["surname Bai","white\/snowy\/pure\/bright\/empty\/blank\/plain\/clear\/to make clear\/in vain\/gratuitous\/free of charge\/reactionary\/anti-communist\/funeral\/to stare coldly\/to write wrong character\/to state\/to explain\/vernacular\/spoken lines in opera"],"pinyin":["Bai2","bai2"],"word":"白"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["happening\/instance\/reason\/cause\/intentional\/former\/old\/friend\/therefore\/hence\/(of people) to die, dead"],"pinyin":["gu4"],"word":"故"}],"containing_words":[],"sentences":[{"english":"They quarreled for nothing.","chinese":"她們平白無故地爭吵。"},{"english":"I get twitches and shakes out of nowhere, I always lose my line of thought.","chinese":"我會平白無故地抽搐，總是忘記自己想說什麼。"},{"english":"The cake maker all-overs a naked snake with the agitation rake without account.","chinese":"蛋糕製造者平白無故地用抖動的耙子搖一條赤裸的蛇。"},{"english":"Humans, on the other hand, get angry when they are flatly told they are stupid.","chinese":"人則不同，當他們平白無故被告知是傻瓜時會很生氣。"},{"english":"After all, I can't dig a grave without reason. I'm no amateur gravedigger.","chinese":"無論如何，我不能平白無故地去挖一個墓穴。"},{"english":"Why will this tree without any reason and without cause appear again?","chinese":"這棵樹又爲什麼會平白無故的出現？"},{"english":"You are apt to be all revved up with no place to go.","chinese":"你傾向於平白無故地忙個團團轉。"},{"english":"I was criticized without any reason.","chinese":"我平白無故捱了批評。"},{"english":"But he should not be no reason to me Stories behind Olympic.","chinese":"但他也不應該平白無故地向我發飆。"},{"english":"It would be fun, Alex thought, to give Cora something for no reason at all.","chinese":"阿烈克心裏想，平白無故送點什麼給柯拉一定很好玩。"},{"english":"I don't know why he gave me money without rhyme or reason.","chinese":"我搞不懂他爲什麼平白無故給我錢。"},{"english":"People don't just disappear, Dean. Other people just stop looking for them.","chinese":"人不會平白無故失蹤，只是另一些人放棄尋找了而已。"}],"related":[]}