{"definition":["storytelling dramatic art dating back to Song and Yuan periods, single narrator without music, often historical topics with commentary"],"pinyin":["ping2 hua4"],"simplified":["平话"],"rank":64231.0,"normalized_rank":0.8986750241349879,"fraction":1.9269046745775046e-8,"cumulative_fraction":0.9999401080073004,"word":"平話","characters":[{"definition":["flat\/level\/equal\/to tie (make the same score)\/to draw (score)\/calm\/peaceful\/see also 平聲|平声[ping2 sheng1]","surname Ping"],"pinyin":["Ping2","ping2"],"word":"平"},{"definition":["dialect\/language\/spoken words\/speech\/talk\/words\/conversation\/what sb said\/CL:種|种[zhong3],席[xi2],句[ju4],口[kou3],番[fan1]"],"pinyin":["hua4"],"word":"話"}],"containing_words":[],"sentences":[{"english":"Historical Pinghua has much bearing on the novel Romance of the Three Kingdoms.","chinese":"講史平話與《三國演義》成書的關係十分密切。"},{"english":"This paper studies the phonology of the Pinghua dialect of Hunan Province's Tongdao County and lists the homophones.","chinese":"本文介紹湖南通道平話的音系，並列出同音字匯。"},{"english":"The second part is divided into the Pinghua passive tags on it.","chinese":"第二部分爲桂北平話被動標記研究。"},{"english":"The second chapter, we describe the system of verb classifiers.","chinese":"第二章，對《平話》中動量詞系統進行分類描寫。"},{"english":"The third part is researched disposal tag of the Pinghua .","chinese":"第三部分是桂北平話處置標記研究。"},{"english":"Jiangshi Pinghua in Song and Yuan Dynasty literature has always been considered as the scripts of Jiangshi.","chinese":"宋元講史平話一直被認爲是講史的話本。"},{"english":"Baise Pinhua mountain songs are an important form of folk arts for the Baise people who speak the Pinghua dialect.","chinese":"百色平話山歌是百色平話人民間文藝的一種重要形式。"},{"english":"Baise Pinhua mountain songs are an important form of folk arts for the Baise people who speak the Pinghua dialect.","chinese":"百色平話山歌是百色平話人民間文藝的一種重要形式。"},{"english":"A dialect called \"Guanxia Pinghua\" is spoken among Miao minority in Suining county of Hunan province.","chinese":"湖南綏寧縣境內關峽苗族鄉流行一種“平話”。"}],"related":[]}