{"definition":["this past year\/over the last years"],"pinyin":["nian2 lai2"],"simplified":["年来"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"年來","characters":[{"definition":["surname Nian","year\/CL:個|个[ge4]"],"pinyin":["Nian2","nian2"],"word":"年"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"}],"containing_words":[{"definition":["for the past few years"],"pinyin":["jin4 nian2 lai2"],"word":"近年來"},{"definition":["for the past many years"],"pinyin":["duo1 nian2 lai2"],"word":"多年來"},{"definition":["for the past several years"],"pinyin":["ji3 nian2 lai2"],"word":"幾年來"}],"sentences":[{"english":"Twelve months' non-stop football is doing me well. I feel that I am still growing in form.","chinese":"這是我這幾年來第一次有這樣的感受。"},{"english":"For years, the government has been buoying up cotton prices.","chinese":"多年來政府一直保持棉花高價格。"},{"english":"Gordimer's fiction has been the subject of much commentary in South Africa over the years.","chinese":"戈迪默的小說已多年來在南非引起了很大評論的話題。"},{"english":"Emerging Asia has grown by an annual average of 8% over the past three years—as fast as before the crisis.","chinese":"過去三年來以年均8%的速度增長着，和危機前一樣。"},{"english":"We had been doing business with each other for years before we quarrelled.","chinese":"在吵翻之前，我們多年來在業務上一直來往。"},{"english":"Muammar al-Qaddafi, making his first appearance despite 40 years in power.","chinese":"這也是卡扎菲執政40年來首次參加聯大會議。"},{"english":"Eg. For years he refused to associate with Stephenson's staff.","chinese":"多年來，他一直拒絕同史蒂芬森手下的人交往。"},{"english":"Over the past 10-plus years, the booming tourist industry has stimulated the Great wall's renovation project.","chinese":"十幾年來，蓬勃發展的旅遊業促進了長城的修繕工程。"},{"english":"China's rise has been on everyone's lips in recent years.","chinese":"近年來，國崛起成爲街談巷議的話題。"},{"english":"The Industrial cluster is a topic popularily concerned in the academic world either in our country or abroad in recent years.","chinese":"產業集羣是近年來國內外學術界關注的一個熱點話題。"},{"english":"Carmack said Id turned down many offers from large publishers over the years.","chinese":"卡馬克說號拒絕了許多優惠大出版商多年來。"},{"english":"Goldberg said researchers have been working with robots for 50 years.","chinese":"戈爾德貝爾格說研究人員50年來一直研究機器人。"},{"english":"So that was a more recent one.","chinese":"上面所說的是近年來遇到的挑戰。"},{"english":"For many years, he avoided lakes \"ending.\"","chinese":"多年來，他迴避《笑傲江湖》的結局。"},{"english":"Hungarians have had the ambition of becoming the masters of the Central Plains for many years.","chinese":"北方的匈奴多年來一直有入主中原的野心。"},{"english":"The importance and vulnerability of seed banks have become apparent in recent years.","chinese":"種子銀行的重要性和脆弱性近幾年來已很明顯。"}],"related":[]}