{"definition":["a few\/several\/how many"],"pinyin":["ji3 ge5"],"simplified":["几个"],"rank":719.0,"normalized_rank":0.01005974283995355,"fraction":0.00021565639760380396,"cumulative_fraction":0.5677877778043119,"word":"幾個","characters":[{"definition":["almost","how much\/how many\/several\/a few"],"pinyin":["ji1","ji3"],"word":"幾"},{"definition":["individual\/this\/that\/size\/classifier for people or objects in general"],"pinyin":["ge4"],"word":"個"}],"containing_words":[{"definition":["ten months or so\/about ten months"],"pinyin":["shi2 ji3 ge4 yue4"],"word":"十幾個月"}],"sentences":[{"english":"We were kept on tenterhooks for hours while the judges chose the winner.","chinese":"我們坐立不安了好幾個小時，等着裁判們決定獲勝者。"},{"english":"I lifted my right hand and made scissoring movements with my first two fingers.","chinese":"我擡起右手，用食指和中指做了幾個剪東西的動作。"},{"english":"Mr Green has been out of work for several months and is on his uppers.","chinese":"格林先生失業好幾個月了，現在已過得山窮水盡。"},{"english":"Accessibly several different versions, oriented to different circle of tasks.","chinese":"通俗易懂的幾個不同版本，面向不同圈子的任務。"},{"english":"Would like to see a few FB pages you have done.","chinese":"想看到你做了幾個庫務局網頁。"},{"english":"The clothes designer chose several models to try on his newly designed clothes.","chinese":"服裝設計師選了幾個模特來試穿他新設計的服裝。"},{"english":"Chinese mainland part of the film and television industry friends want to shoot some students in my class.","chinese":"中國大陸幾個影視界的朋友想讓我班部分同學拍戲。"},{"english":"We have several word letters that uses a series of forms to input into the doc.","chinese":"我們有幾個字母詞使用到文檔形式輸入一個系列。"},{"english":"Some people see this one, Aphrodite does not play on the air to one.","chinese":"一看到這幾個人，阿芙羅狄忒就氣不打一處來。"},{"english":"Only few States continue to maintain a separate chancery court.","chinese":"只有少數幾個州繼續保持獨立的衡平法院。"},{"english":"She spent hours admiring herself in the mirror.","chinese":"她用了幾個小時對着鏡子自我欣賞。"},{"english":"It rained yesterday after it had been dry for many months.","chinese":"在天旱了好幾個月之後，昨天下雨了。"},{"english":"Few friends has she made since she came into this school last year.","chinese":"自從去年她來到這個學校，沒交幾個朋友。"},{"english":"Is cursed since the insect poisons general several months once returned to?","chinese":"狗的打蟲藥一般幾個月給一回？"},{"english":"This eclipse will be difficult for a number of reasons.","chinese":"因爲幾個原因，這個月蝕將變得有些困難。"},{"english":"You may wonder how many of his peers would agree with him.","chinese":"你或許會好奇他的同行中有幾個人贊同他的觀點。"}],"related":[{"definition":["this\/this one"],"pinyin":["zhe4 ge5"],"word":"這個"},{"definition":["these"],"pinyin":["zhe4 xie1"],"word":"這些"},{"definition":["individual\/this\/that\/size\/classifier for people or objects in general"],"pinyin":["ge4"],"word":"個"},{"definition":["that one\/that thing\/that (as opposed to this)\/(used before a verb or adjective for emphasis)\/(used to humorously or indirectly refer to sth embarrassing, funny etc, or when one can't think of the right word)\/(used in speech as a filler, similar to \"umm\", \"you know\" etc)\/(euph.) menstruation\/sex\/also pr. [nei4 ge5]"],"pinyin":["na4 ge5"],"word":"那個"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不過"},{"definition":["almost","how much\/how many\/several\/a few"],"pinyin":["ji1","ji3"],"word":"幾"},{"definition":["several times"],"pinyin":["ji3 ci4"],"word":"幾次"},{"definition":["many\/multiple\/multi- (faceted, ethnic etc)"],"pinyin":["duo1 ge5"],"word":"多個"},{"definition":["else\/other"],"pinyin":["bie2 de5"],"word":"別的"},{"definition":["many\/a lot of\/much"],"pinyin":["xu3 duo1"],"word":"許多"},{"definition":["here"],"pinyin":["zhe4 li3"],"word":"這裡"},{"definition":["only natural\/as it should be\/certainly\/of course\/without doubt"],"pinyin":["dang1 ran2"],"word":"當然"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"畢竟"},{"definition":["every kind of\/all kinds of\/various kinds"],"pinyin":["ge4 zhong3"],"word":"各種"},{"definition":["a bit\/a little\/one dot\/one point"],"pinyin":["yi1 dian3"],"word":"一點"},{"definition":["this\/this kind of\/this sort of\/this type of"],"pinyin":["zhe4 zhong3"],"word":"這種"}]}