{"definition":["coordinate axis"],"pinyin":["zuo4 biao1 zhou2"],"simplified":["座标轴"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"座標軸","characters":[{"definition":["seat\/base\/stand\/CL:個|个[ge4]\/classifier for buildings, mountains and similar immovable objects"],"pinyin":["zuo4"],"word":"座"},{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"標"},{"definition":["axis\/axle\/spool (for thread)\/roller (for scrolls)\/classifier for calligraphy rolls etc","see 壓軸戲|压轴戏[ya1 zhou4 xi4]\/Taiwan pr. [zhou2]"],"pinyin":["zhou2","zhou4"],"word":"軸"}],"containing_words":[],"sentences":[{"english":"Data recorded along two geophone axes are displayed as a function of time.","chinese":"沿兩個檢波器座標軸記錄的數據顯示爲一個時間函數。"},{"english":"The coordinates x, y, and z are called the relative coordinates.","chinese":"座標軸的交叉點，所有相應值都爲零。"},{"english":"The horizontal axis was then divided into 15 spaces.","chinese":"在橫座標軸上等分成15個格。"},{"english":"Bounding Box Center - the axis passes through the center of the selection's bounding box.","chinese":"座標軸通過選擇體的邊框中心。"},{"english":"The thermal expansion coefficient of aluminum-silicon alloys is on the vertical axis.","chinese":"縱座標軸表示鋁硅合金的熱膨脹係數。"},{"english":"Now you should know what is vertical axis and horizontal axis in an axis.","chinese":"現在你應該知道一個座標軸中什麼是編縱軸和橫軸了。"},{"english":"We have two options.One is we keep the system of coordinates centers here.","chinese":"有兩種選擇，一種是仍然讓座標軸的中心在這裏。"},{"english":"And I could do the same about any axis that I want.","chinese":"我還可以對任意座標軸這麼做。"},{"english":"Assigns value series to left or right vertical axis.","chinese":"給左或右垂直座標軸分配值系列。"}],"related":[]}