{"definition":["cockpit\/cabin"],"pinyin":["zuo4 cang1"],"simplified":["座舱"],"rank":21914.0,"normalized_rank":0.3066052915086816,"fraction":0.000001977120978218009,"cumulative_fraction":0.9789974022234612,"word":"座艙","characters":[{"definition":["seat\/base\/stand\/CL:個|个[ge4]\/classifier for buildings, mountains and similar immovable objects"],"pinyin":["zuo4"],"word":"座"},{"definition":["cabin\/the hold of a ship or airplane"],"pinyin":["cang1"],"word":"艙"}],"containing_words":[{"definition":["ejection capsule (cabin)"],"pinyin":["tan2 she4 zuo4 cang1"],"word":"彈射座艙"}],"sentences":[{"english":"The pilots looked outside the cockpit window and saw that the plane was coated by a thin cloud.","chinese":"駕駛員注視座艙窗外，看到飛機被一層薄雲覆蓋。"},{"english":"Interactive 3-D virtual cockpits.","chinese":"交互式三維虛擬座艙。"},{"english":"The systems deliver moving maps and other information via cockpit displays.","chinese":"該系統通過座艙顯示器提供移動地圖和其他資料。"},{"english":"The aircraft can be fitted with a fixed aerial refuelling probe on the starboard side of the cockpit.","chinese":"戰機座艙的右舷可以安裝固定的空中加油受油頭。"},{"english":"The pilot sits in the cockpit located above the air intake and in front of the canard.","chinese":"飛行員座艙位於進氣口上方並在鴨翼前方。"},{"english":"It pierces the canopy but misses Quaritch.","chinese":"毒刺貫穿了座艙罩，但沒刺到誇裏奇。"},{"english":"Two engines are podded to the helicopter just to the rear of the cockpit.","chinese":"直升飛機上二臺發動機莢艙在駕駛員座艙的後面。"},{"english":"The GAU-8 gun system is under the cockpit and the nose.","chinese":"8火炮系統安裝在座艙和機頭的下方。"},{"english":"The rear seat cabin area can be used for hauling bulky cargo.","chinese":"後部座艙面積可用於拖運大件貨物。"},{"english":"Atlantis was chosen as the first orbiter to receive the glass cockpit.","chinese":"亞特蘭蒂斯被選爲第一個軌道器獲得的玻璃座艙。"},{"english":"Early Bell47 models had open cockpits or sheet metal cabins.","chinese":"早期的貝爾47型號座艙是開放式的。"},{"english":"We feel like in a subaquatic cockpit with delicate golden reflections.","chinese":"我們覺得好像在一個半水生的座艙裏精緻的金色反光。"},{"english":"An in-flight refuelling probe can be installed on the starboard side of the cockpit.","chinese":"可以在駕駛員座艙右側安裝一個空中加油探頭。"},{"english":"After the three-point landing gear to the cockpit for the whole open.","chinese":"起落架爲後三點式，駕駛員座艙爲全開放式。"}],"related":[]}