{"definition":["to be situated\/located at (of building)\/also written 坐落[zuo4 luo4]"],"pinyin":["zuo4 luo4"],"simplified":["座落"],"rank":25504.0,"normalized_rank":0.3568340492213843,"fraction":0.0000014143772266652609,"cumulative_fraction":0.9850199741690456,"word":"座落","characters":[{"definition":["seat\/base\/stand\/CL:個|个[ge4]\/classifier for buildings, mountains and similar immovable objects"],"pinyin":["zuo4"],"word":"座"},{"definition":["colloquial reading for 落[luo4] in certain compounds","to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["la4","lao4","luo4"],"word":"落"}],"containing_words":[],"sentences":[{"english":"The company is located in Xinzhou City Economic and Technological Development Zone.","chinese":"公司座落在忻州市經濟技術開發區內。"},{"english":"Enterprises located in Bengbu City High-tech Development Zone.","chinese":"企業座落在蚌埠市高新技術開發區內。"},{"english":"On the grounds of the Deer Garden Temple sits the Golden Pavilion.","chinese":"金閣寺座落在鹿苑寺的庭園裏。"},{"english":"Enterprises located in Bengbu City in the hi-tech zones.","chinese":"企業座落在蚌埠市高新科技技術開發區內。"},{"english":"It is a small villa with a large garden.","chinese":"老師的家是個小別墅，座落在一個大花園裏。"},{"english":"The university is located in the eastern suburbs of the city.","chinese":"這座大學座落在城市的東郊。"},{"english":"Another statue, right at the bottom of the famous Heidelberg Schloss .","chinese":"另一個雕塑，座落在海德堡有名的城堡下方。"},{"english":"It is located in the south wing of the Yangtze River Delta.","chinese":"它座落在長江三角洲的南翼。"},{"english":"The south town of Xixinan, Huizhou district, wins the title \" The First Town in Apiculture\".","chinese":"“安徽養蜂第一鎮”的西溪南鎮座落在本區。"},{"english":"Before long, though, he reached the Grand Hotel at Thirty-first Street.","chinese":"沒有多久，他就來到了座落在三十一街的宏大旅館。"},{"english":"Located in Linhai Economic Development Zone, is a combination of industry and trade company.","chinese":"座落在臨海經濟開發區，是一家工貿結合的公司。"},{"english":"The factory where my father works is in the west of the city.","chinese":"我父親工作的那家工廠座落在城西。"},{"english":"Carfax Tower is situated at the northwest corner of Carfax, which is regarded as the city centre of Oxford.","chinese":"卡法克斯塔座落在牛津市中心卡法克斯的西北角。"},{"english":"To the south of the British mainland, there lies an island that time seems to have forgotten.","chinese":"在英國本島南部座落著一個似乎被時光遺忘的島嶼。"},{"english":"The small, unspoiled village is located deep in the mountains.","chinese":"這個未受破壞的小村莊，座落在深山之中。"},{"english":"The company is located in the industrial zone of Shenzhen City Bagua Ling.","chinese":"本公司座落在深圳市八卦嶺工業區。"}],"related":[{"definition":["to be situated\/to be located (of a building)"],"pinyin":["zuo4 luo4"],"word":"坐落"},{"definition":["to tower\/standing tall and upright (of large building)"],"pinyin":["chu4 li4"],"word":"矗立"},{"definition":["to be located at\/to be situated at\/to lie"],"pinyin":["wei4 yu2"],"word":"位於"},{"definition":["mountains on one side and water on the other"],"pinyin":["yi1 shan1 bang4 shui3"],"word":"依山傍水"},{"definition":["to be located at\/to be situated in"],"pinyin":["di4 chu3"],"word":"地處"},{"definition":["bordering\/adjacent to"],"pinyin":["pi2 lin2"],"word":"毗鄰"},{"definition":["to take up space\/to occupy (space)"],"pinyin":["zhan4 di4"],"word":"占地"},{"definition":["to stand tall\/to tower aloft"],"pinyin":["song3 li4"],"word":"聳立"},{"definition":["foothills"],"pinyin":["shan1 lu4"],"word":"山麓"},{"definition":["northern extremity"],"pinyin":["bei3 duan1"],"word":"北端"},{"definition":["southern end or extremity"],"pinyin":["nan2 duan1"],"word":"南端"},{"definition":["to be right next to\/close neighbor"],"pinyin":["jin3 lin2"],"word":"緊鄰"},{"definition":["building complex"],"pinyin":["jian4 zhu4 qun2"],"word":"建築群"},{"definition":["scattered about like stars in the sky or chess pieces on a board (idiom); spread all over the place"],"pinyin":["xing1 luo2 qi2 bu4"],"word":"星羅棋布"},{"definition":["neighbor\/next-door neighbor\/near\/next to"],"pinyin":["bi3 lin2"],"word":"比鄰"},{"definition":["to tower\/to stand straight (of person's bearing)"],"pinyin":["yi4 li4"],"word":"屹立"}]}