{"definition":["to stay together\/to rely on one another"],"pinyin":["si1 shou3"],"simplified":["厮守"],"rank":35670.0,"normalized_rank":0.4990695787220349,"fraction":5.712104539107407e-7,"cumulative_fraction":0.9944426567075408,"word":"廝守","characters":[{"definition":["mutually\/with one another\/manservant\/boy servant\/guy (derog.)"],"pinyin":["si1"],"word":"廝"},{"definition":["to guard\/to defend\/to keep watch\/to abide by the law\/to observe (rules or ritual)\/nearby\/adjoining"],"pinyin":["shou3"],"word":"守"}],"containing_words":[],"sentences":[{"english":"Unlike most other fish, they are monogamous and mate for life.","chinese":"不像其他的魚類，它們是一夫一妻制並終生廝守。"},{"english":"I hope we can spend just as many as more years together.","chinese":"希望我們能天長地久，永遠廝守在一起。"},{"english":"Working is like old-time marriage, obviously you got no happiness, but still you have to live with it.","chinese":"上班就像舊時代的婚姻，明明不幸福，還得長相廝守。"},{"english":"Possession hinders enjoyment and increase annoyance whethe_r you lend or keep.","chinese":"佔有總是妨礙享受，徒增煩擾，無論你借出還是廝守。"},{"english":"Always being together is my greatest happiness.","chinese":"與你長相廝守，是我最大的幸福。"},{"english":"Find amusement when the occasion arises and sincerity, in the heart forever have clear dividing line.","chinese":"逢場作戲和真心廝守，在心裏永遠有明顯的分界線。"},{"english":"Why am I so scared of that time goes away and can not be allowed stay with you everlastingly .","chinese":"爲什麼我總害怕時光飛逝而無法與你終生廝守？"},{"english":"Yuan, let us together for a lifetime, days without edges, in which birds must dare and the king must.","chinese":"媛，讓我們廝守終生，天無棱，鳥飛絕，纔敢與君絕。"},{"english":"If we’ve made plans to get together, we’ve been looking forward to it all day.","chinese":"如果我們計劃要廝守，肯定早就整天期待了。"},{"english":"He came to your city, in the corner of the carport together for ever figure.","chinese":"他來到你的城市，在街角車棚裏廝守曾經身影。"},{"english":"Find amusement when the occasion arises and sincerity, always have a clear dividing line in the heart.","chinese":"逢場作戲和真心廝守，在心裏永遠有明顯的分界線。"},{"english":"One year of service-in exchange for a lifetime with Sabrina.","chinese":"相形之下，用一年的勞役換來與薩布萊娜廝守終生。"},{"english":"Let's say you've met a great girl, and you want to spend more time with her.","chinese":"假如你遇見了一位很棒的女孩，想與她長相廝守。"},{"english":"I can't wait to crawl in bed with you tonight.","chinese":"我快要等不及了，今天晚上要和你一起廝守。"},{"english":"I was in love and ready for a long-term commitment.","chinese":"我愛他，並準備與他長相廝守。"},{"english":"Rich or poor, we will keep together and be happy in one another.","chinese":"不論貧富，我們都要廝守一起，共享天倫之樂。"}],"related":[{"definition":["(to live together until the) white hairs of old age (idiom); to live to a ripe old age in conjugal bliss\/until death do us part"],"pinyin":["bai2 tou2 xie2 lao3"],"word":"白頭偕老"},{"definition":["good karma\/opportune connection with marriage partner"],"pinyin":["liang2 yuan2"],"word":"良緣"},{"definition":["enduring while the world lasts (idiom)\/eternal"],"pinyin":["tian1 chang2 di4 jiu3"],"word":"天長地久"},{"definition":["a beautiful woman\/young beauties\/youths\/rosy cheeks"],"pinyin":["hong2 yan2"],"word":"紅顏"},{"definition":["innocent playmates"],"pinyin":["liang3 xiao3 wu2 cai1"],"word":"兩小無猜"},{"definition":["to roam far and wide (idiom)\/to travel the world"],"pinyin":["lang4 ji4 tian1 ya2"],"word":"浪跡天涯"},{"definition":["see 有情人終成眷屬|有情人终成眷属[you3 qing2 ren2 zhong1 cheng2 juan4 shu3]"],"pinyin":["zhong1 cheng2 juan4 shu3"],"word":"終成眷屬"},{"definition":["lit. when the seas run dry and the stones go soft (idiom)\/fig. forever\/until the end of time"],"pinyin":["hai3 ku1 shi2 lan4"],"word":"海枯石爛"},{"definition":["decreed by fate (idiom)\/destined\/fated"],"pinyin":["ming4 zhong1 zhu4 ding4"],"word":"命中註定"},{"definition":["lit. heads rubbing together (idiom)\/fig. very close relationship"],"pinyin":["er3 bin4 si1 mo2"],"word":"耳鬢廝磨"},{"definition":["touching (emotions)\/lingering (illness)"],"pinyin":["chan2 mian2"],"word":"纏綿"},{"definition":["familiarity at first sight"],"pinyin":["yi1 jian4 ru2 gu4"],"word":"一見如故"},{"definition":["Cowherd and Weaving maid (characters in folk story)\/separated lovers\/Altair and Vega (stars)"],"pinyin":["niu2 lang2 zhi1 nu:3"],"word":"牛郎織女"},{"definition":["to endure humiliation as part of an important mission (idiom); to suffer in silence"],"pinyin":["ren3 ru3 fu4 zhong4"],"word":"忍辱負重"},{"definition":["in love with\/to feel deeply attached to"],"pinyin":["ai4 lian4"],"word":"愛戀"},{"definition":["rhinoceros horn, reputed to confer telepathic powers\/fig. mutual sensitivity\/tacit exchange of romantic feelings\/a meeting of minds"],"pinyin":["ling2 xi1"],"word":"靈犀"}]}