{"definition":["waste liquids"],"pinyin":["fei4 ye4"],"simplified":["废液"],"rank":39222.0,"normalized_rank":0.5487666671330432,"fraction":4.13116684019268e-7,"cumulative_fraction":0.9961784515604044,"word":"廢液","characters":[{"definition":["to abolish\/to abandon\/to abrogate\/to discard\/to depose\/to oust\/crippled\/abandoned\/waste"],"pinyin":["fei4"],"word":"廢"},{"definition":["liquid\/fluid\/Taiwan pr. [yi4]"],"pinyin":["ye4"],"word":"液"}],"containing_words":[],"sentences":[{"english":"It is the heavy metals contained in the waste effluent that can cause an environmental or disposal problem.","chinese":"就是流出廢液中的重金屬能導致環境或處理問題。"},{"english":"Any waste liquid or material shall be handled per the specific plant procedure.","chinese":"任何廢液或廢物料要根據全廠特定程序進行處理。"},{"english":"The method has been applied in the determination of Zn2+in wastewater with a satisfactory result.","chinese":"應用該方法進行了鍍鋅廢液中鋅的測定，結果滿意。"},{"english":"In addition, Large amounts of untreated industrial waste liquids find their way into rivers and lakes.","chinese":"許多末經處理的工業廢液流入河流和湖泊。"},{"english":"Trialkyphosphine oxides(TRPO) is an extractant used in the treatment of high level liquid waste.","chinese":"三烷基氧化膦是用於處理高放廢液的萃取劑。"},{"english":"The remaining liquid, which contains the leftover salts, shoots out of the system at high pressure.","chinese":"而剩下的高鹽分廢液，則用高壓從系統中抽走。"},{"english":"Studies on biochemical treatment of CTMP effluent by activated sludge process were carried out.","chinese":"介紹了活性污泥法處理雲杉CTMP廢液的試驗。"},{"english":"The new method of producing basic copper carbonate from waste etching solution containing copper.","chinese":"介紹了利用含銅蝕刻廢液合成鹼式碳酸銅的新工藝。"},{"english":"Chemical copper and nikel plating wastewater treatment techniques were recommended.","chinese":"介紹了化學鍍銅與鍍鎳老化廢液的處理技術。"},{"english":"In this paper, a new method of manufacturing cryolite from liquid waste of lithium factory was developed.","chinese":"本文介紹了一條回收鋰廠廢液製備冰晶石的新工藝。"},{"english":"Practices proof, vinasse and distillery slops close recycling all reuse is practicable.","chinese":"實踐證明，酒糟廢液閉路循環全回用是可行的。"},{"english":"Waste emulsion was treated by method of co-coagulation flotation and adsorption.","chinese":"採用共凝聚氣浮破乳吸附法處理乳化廢液。"},{"english":"The research results of recovering copper by electrowinning from concentrated cyanide solution were described.","chinese":"敘述了從富集氰化廢液中電解回收銅的試驗研究結果。"},{"english":"The source of organic waste liquid and the application status of CWM are summarized.","chinese":"對有機廢液的來源及水煤漿的應用現狀進行綜述。"},{"english":"The process conditions of reclaiming chromium from electrodeposition chromium waste liquid using hydrazine hydrate as reducing agent were studied.","chinese":"研究了用水合肼回收電沉積鉻廢液中鉻的工藝條件。"},{"english":"The component content of phosethyl-Al waste liquor is determined.","chinese":"測定了乙磷鋁廢液中各成分含量。"}],"related":[]}