{"definition":["(of an area) vast or extensive\/large-scale\/widespread\/(of people) numerous"],"pinyin":["guang3 da4"],"simplified":["广大"],"rank":1093.0,"normalized_rank":0.015292488072418956,"fraction":0.00014619527950358332,"cumulative_fraction":0.63420959354065,"word":"廣大","characters":[{"definition":["surname Guang","wide\/numerous\/to spread"],"pinyin":["Guang3","guang3"],"word":"廣"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"}],"containing_words":[{"definition":["to possess great magical power\/to possess remarkable abilities"],"pinyin":["shen2 tong1 guang3 da4"],"word":"神通廣大"}],"sentences":[{"english":"The tenet of superiority for broad hall is built and promoted the collectors.","chinese":"文博會館的宗旨也是爲廣大收藏者而倡建的。"},{"english":"The current vegetable price slump has taken its toll on Chinese farmers.","chinese":"近日蔬菜價格暴跌使廣大的中國菜農損失慘重。"},{"english":"Connaught in good faith observe the operating principle of serving the majority of users.","chinese":"本着誠信守諾的經營原則服務於廣大用戶。"},{"english":"It is the rail and commercial center for the vast northern section of the country. Population, 385, 603.","chinese":"是這個國家北部廣大地區鐵路和商業中心。"},{"english":"We warmly welcome all our customers, old and new, in and abroad, with our most sincerity.","chinese":"萬聯軸承真誠歡迎廣大國內外新老客戶。"},{"english":"Workshop director of high-strength comrades wholeheartedly welcome customers to negotiate business.","chinese":"車間主任高強同志竭誠歡迎廣大客戶前來洽談業務。"},{"english":"We welcome the broad masses of old and new customers continue to support the Company.","chinese":"竭誠歡迎廣大的新老客戶繼續支持本公司。"},{"english":"The same is very much the case in Africa's fragile post-colonial nations.","chinese":"這一點，對於非洲廣大後殖民地國家來說，同樣如此。"},{"english":"Nuwa not only to the day of salvation, but also in creation, work miracles.","chinese":"女媧不但補天救世，還創造萬物，神通廣大。"},{"english":"It is greatly welcomed with a mass of enterprises and has built up a good company credit standing within and outside food industry.","chinese":"深受廣大企業的青睞，在業內外享有良好的企業信譽。"},{"english":"Strong support of extensive customer has been cast along being popular today.","chinese":"廣大客戶的大力支持鑄就了順興的今天。"},{"english":"So, everyone. Please don’t be blaming porn on your relationship problems.","chinese":"因此，廣大羣衆，請不要因爲感情問題而責怪不雅物。"},{"english":"The priest always preaches on grace to a large congregation.","chinese":"牧師經常向廣大會衆講關於恩典的道理。"},{"english":"I company produces the hubei type finely machine also quite broad new old customer's favour.","chinese":"我公司所生產鄂式細碎機也頗廣大新老用戶的青睞。"},{"english":"Dopod counters into full operation on the vast number of consumers.","chinese":"正式全面多普達專櫃對廣大消費者營業。"},{"english":"By popular demand, the play will run for another week.","chinese":"應廣大觀衆要求，這齣戲將加演一週。"}],"related":[{"definition":["Volkswagen (automobile manufacturer)","the masses\/the great bulk of the population\/popular (of music, science etc)"],"pinyin":["Da4 zhong4","da4 zhong4"],"word":"大眾"},{"definition":["reader\/CL:個|个[ge4]"],"pinyin":["du2 zhe3"],"word":"讀者"},{"definition":["numerous"],"pinyin":["zhong4 duo1"],"word":"眾多"},{"definition":["not only (this one)\/not just (...) but also"],"pinyin":["bu4 jin3"],"word":"不僅"},{"definition":["extensive\/wide range"],"pinyin":["guang3 fan4"],"word":"廣泛"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"},{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["to extend\/to spread\/to popularize\/generalization\/promotion (of a product etc)"],"pinyin":["tui1 guang3"],"word":"推廣"},{"definition":["for this reason\/with regards to this\/in this respect\/in order to do this\/to this end"],"pinyin":["wei4 ci3"],"word":"為此"},{"definition":["to encourage"],"pinyin":["gu3 li4"],"word":"鼓勵"},{"definition":["domestic and international\/at home and abroad"],"pinyin":["guo2 nei4 wai4"],"word":"國內外"},{"definition":["to like\/to love\/to be fond of\/favorite"],"pinyin":["xi3 ai4"],"word":"喜愛"},{"definition":["to attach importance to sth\/to value"],"pinyin":["zhong4 shi4"],"word":"重視"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["mass\/multitude\/the masses"],"pinyin":["qun2 zhong4"],"word":"群眾"},{"definition":["to defend\/to safeguard\/to protect\/to uphold\/to maintain"],"pinyin":["wei2 hu4"],"word":"維護"}]}