{"definition":["broad sense\/general sense"],"pinyin":["guang3 yi4"],"simplified":["广义"],"rank":15851.0,"normalized_rank":0.2217760552936074,"fraction":0.0000037386330015609453,"cumulative_fraction":0.9623878370484812,"word":"廣義","characters":[{"definition":["surname Guang","wide\/numerous\/to spread"],"pinyin":["Guang3","guang3"],"word":"廣"},{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["Yi4","yi4"],"word":"義"}],"containing_words":[{"definition":["general relativity\/Einstein's theory of gravity"],"pinyin":["guang3 yi4 xiang1 dui4 lun4"],"word":"廣義相對論"}],"sentences":[{"english":"Bigger correlation coefficients can be obtained by the broad heritability method.","chinese":"按廣義遺傳力法選用研究性狀則相關係數大。"},{"english":"This problem can be solved by using GFT technique.","chinese":"採用廣義離散付氏變換可以解決這個問題。"},{"english":"In a wide sense of the word, criminology includes penology.","chinese":"從廣義上講，犯罪學包括刑罰學。"},{"english":"Wang Fuzhi s Shuo Wen Guang Yi focuses on changes of morphology and semantic meaning.","chinese":"王夫之《說文廣義》着眼詞的形義變化。"},{"english":"Therefore, it is very significant to study the generalized semi-infinite programming.","chinese":"因此研究廣義半無限規劃問題具有重要的實際意義。"},{"english":"In chapter 5 the analytical theory and method in generalized energy saving are put forward.","chinese":"第五章提出了廣義節能分析的理論和方法。"},{"english":"The generalized active forces of the beam are applied forces of the moving support and elastic forces of the beam.","chinese":"梁的廣義主動力取爲動支承的作用力和彈性力。"},{"english":"The generalized Riesz summability operators of Laplace series are introduced.","chinese":"引進了拉普拉斯級數的廣義黎斯可和算子。"},{"english":"In this paper, the state estimation problem for the singular discrete stochastic linear systems is dia-cussed.","chinese":"本文討論了廣義離散隨機線性系統的狀態估計問題。"},{"english":"The paper analyzed and predicted the hospital expense with generalized linear model.","chinese":"用廣義線性迴歸模型分別對住院費用進行分析和預測。"},{"english":"In physical prospecting, we need to calculate the integrals of 1th Bessel function.","chinese":"物理勘探中，需要計算含一階貝塞爾函數的廣義積分。"},{"english":"A generalized morpho interpolation method for nonrigid body motion is proposed based on morpho translation.","chinese":"提出一種基於形態變換的非剛體運動的廣義內插方法。"},{"english":"The choice of the implementer as well as broad IT platform becomes more and more important.","chinese":"對實施者和廣義IT平臺的選擇變得越來越重要。"},{"english":"This paper presents a method of compensator design of generalized systems.","chinese":"本文介紹一種廣義系統補償器的設計方法。"},{"english":"By using the concept of generalized simply supported edge together with the method of superposition, we can solve this problem.","chinese":"用廣義簡支邊這個概念及疊加法，就可以解這類問題。"},{"english":"According to general relativity, time is stitched together with space to form four-dimensional space - time.","chinese":"根據廣義相對論，時間與空間一起形成了四維時空。"}],"related":[{"definition":["narrow sense\/restricted sense"],"pinyin":["xia2 yi4"],"word":"狹義"},{"definition":["substance\/essence"],"pinyin":["shi2 zhi4"],"word":"實質"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"則"},{"definition":["content\/meaning\/connotation\/implication"],"pinyin":["han2 yi4"],"word":"涵義"},{"definition":["in other words"],"pinyin":["huan4 ju4 hua4 shuo1"],"word":"換句話說"},{"definition":["environmental impact"],"pinyin":["huan2 jing4 ying3 xiang3"],"word":"環境影響"},{"definition":["so-called\/what is called"],"pinyin":["suo3 wei4"],"word":"所謂"},{"definition":["to discuss two disparate things together (idiom); to mention on equal terms\/to place on a par with\/(often with negatives: impossible to mention X in the same breath as Y)"],"pinyin":["xiang1 ti2 bing4 lun4"],"word":"相提並論"},{"definition":["term\/terminology"],"pinyin":["shu4 yu3"],"word":"術語"},{"definition":["abbr. for 黃帝內經|黄帝内经[Huang2 di4 Nei4 jing1], The Yellow Emperor's Internal Canon, medical text c. 300 BC"],"pinyin":["Nei4 jing1"],"word":"內經"},{"definition":["macro-\/macroscopic\/holistic"],"pinyin":["hong2 guan1"],"word":"宏觀"},{"definition":["to differentiate\/to draw a distinction\/to divide into categories"],"pinyin":["qu1 fen1"],"word":"區分"},{"definition":["for example\/for instance"],"pinyin":["bi3 fang5 shuo1"],"word":"比方說"},{"definition":["to part or leave each other\/to distinguish\/difference\/in different ways\/differently\/separately or individually"],"pinyin":["fen1 bie2"],"word":"分別"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"},{"definition":["to correspond\/answering (one another)\/to agree (among the part)\/corresponding\/relevant\/appropriate\/(modify) accordingly"],"pinyin":["xiang1 ying4"],"word":"相應"}]}