{"definition":["vast"],"pinyin":["guang3 mao4"],"simplified":["广袤"],"rank":23946.0,"normalized_rank":0.3350356078519161,"fraction":0.0000016299861815403346,"cumulative_fraction":0.9826507733426147,"word":"廣袤","characters":[{"definition":["surname Guang","wide\/numerous\/to spread"],"pinyin":["Guang3","guang3"],"word":"廣"},{"definition":["length\/distance from north to south"],"pinyin":["mao4"],"word":"袤"}],"containing_words":[],"sentences":[{"english":"Proudly he beat his rays upon the earth, warming the vast landthat lay below.","chinese":"他自豪地把光輝灑向地球，溫暖着腳下廣袤的土地。"},{"english":"Becky and John enjoyed camping in our big national forests on their vacations.","chinese":"貝基和約翰喜歡假期中去我們廣袤的國家森林野營。"},{"english":"Primitive humans, clad in animal skins, trekking across vast expanses of ice in a desperate search to find food.","chinese":"穿着動物皮的原始人在廣袤的冰原上辛苦地搜尋食物。"},{"english":"It is said that pauillac flower grows in the vast desert.","chinese":"據說普雅花生長在廣袤無垠的沙漠裏。"},{"english":"They farmed, irrigated , and reclaimed vast stretches of land.","chinese":"他們耕種，灌溉，並領回的廣袤的土地。"},{"english":"At the ground level an immense lawn is only interrupted by sandboxes and low vegetation arrangements.","chinese":"地面層廣袤的草坪被零星的沙盒和低矮的植被點綴。"},{"english":"The expansive Loess Plateau shows its nimble nymphalness wherever there is a stream.","chinese":"對於廣袤的黃土高原，水就是靈秀的化身。"},{"english":"He said South Sudan has a vast territory, brilliant civilizations, industrious and brave people.","chinese":"他說，南蘇丹國土廣袤，文明燦爛，人民勤勞勇敢。"},{"english":"Vast forests with pure and fresh and green.","chinese":"廣袤的森林有着清新的翠綠色。"},{"english":"Never stepped into such a cavernous space.","chinese":"從未踏進這個廣袤淵深的宇宙。"},{"english":"Water seems the incarnation of the delicately beautiful to the expansive Loess Plateau .","chinese":"對於廣袤的黃土高原，水就是靈秀的化身。"},{"english":"Though why would you rush it when journeying through far-flung Russia?","chinese":"在廣袤的俄羅斯大地上你何必匆匆趕路？"},{"english":"But the earth of that wide , have already grown dark green farm goods again.","chinese":"而那廣袤的大地，又已生長出了油綠的莊稼。"},{"english":"I see nothing outside except the endless expanse of a steel blue sky and the broad patch of tan earth far below.","chinese":"除了無邊無際的藍天和廣袤的地表，什麼也看不見。"}],"related":[]}