{"definition":["Yeonpyeong island on Yellow Sea coast of Korea"],"pinyin":["Yan2 ping2 Dao3"],"simplified":["延坪岛"],"rank":62531.0,"normalized_rank":0.8748898185328725,"fraction":2.7005860969457454e-8,"cumulative_fraction":0.9999010846841782,"word":"延坪島","characters":[{"definition":["surname Yan","to prolong\/to extend\/to delay"],"pinyin":["Yan2","yan2"],"word":"延"},{"definition":["a plain\/ping, unit of area equal to approx. 3.3058 square meters (used in Japan and Taiwan)"],"pinyin":["ping2"],"word":"坪"},{"definition":["island\/CL:個|个[ge4],座[zuo4]"],"pinyin":["dao3"],"word":"島"}],"containing_words":[],"sentences":[{"english":"Over the years, North Korea has made many attacks near the island.","chinese":"多年以來，北韓多次向延坪島附近發動襲擊。"},{"english":"North Korea must first day the ship sank and taeyonpyong shelling incident.","chinese":"朝鮮首先要對天安艦沉沒和延坪島炮擊事件負責。"},{"english":"Outside the Yeonpyeong elementary school, crews are building small shelters.","chinese":"在延坪島小學，人們正在搭建臨時小房。"},{"english":"But Kim does not know when people will start coming back to Yeonpyeong.","chinese":"但是金三列不知道人們會在什麼時候開始返回延坪島。"},{"english":"Park is from a smaller nearby island that was also shelled.","chinese":"樸明財住在延坪島附近一個小島，這次也遭受了炮擊。"},{"english":"The North's artillery barrage Tuesday destroyed civilian homes as well as military bases on Yeonpyeong Island.","chinese":"北韓炮火星期二歲會了延坪島的民宅和軍事基地。"},{"english":"On Friday, the North conducted an apparent artillery drill within sight of Yeonpyeong island.","chinese":"星期五，北韓在延坪島進行了一次明顯的炮擊演習。"},{"english":"Jun Han plans early next week in island waters of the sea floor extension fire training.","chinese":"韓軍計劃於下週初期在延坪島海域進行海上射擊訓練。"},{"english":"Some South Koreans criticized the government for leaving Yeonpyeong inadequately protected.","chinese":"部分南韓人批評政府沒有善盡保衛延坪島的職責。"}],"related":[]}