{"definition":["organizational structure"],"pinyin":["jian4 zhi4"],"simplified":["建制"],"rank":15571.0,"normalized_rank":0.21785849201796484,"fraction":0.00000386899102234865,"cumulative_fraction":0.9613231255785891,"word":"建制","characters":[{"definition":["to establish\/to found\/to set up\/to build\/to construct"],"pinyin":["jian4"],"word":"建"},{"definition":["system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4"],"word":"制"}],"containing_words":[{"definition":["feudalism"],"pinyin":["feng1 jian4 zhi4 du4"],"word":"封建制度"}],"sentences":[{"english":"The people's war has helped crush the feudal structure in the rural areas.","chinese":"人民戰爭摧毀了農村地區的封建制度。"},{"english":"We should develop small towns on the Basis of existing county seats and of organic towns where conditions permit.","chinese":"發展小城鎮要以現有的縣城和有條件的建制鎮爲基礎。"},{"english":"But it was also a bold attack on feudalism and arranged marriage.","chinese":"但它同時也是對封建制度和包辦婚姻的一記猛擊。"},{"english":"In the architecture, the old building like Cosmological temple was built according to the idea of \"Round Sky & Square Earth\".","chinese":"在建制上，古代的建築樣式如明堂就擬天圓地方而建。"},{"english":"They are the hieroglyphics of feudalism succeeding those of theocracy .","chinese":"這是繼神權政治象形文字之後的封建制度象形文字。"},{"english":"Their victims from the feudal system, become the accomplices of the feudal rulers.","chinese":"她們由封建制度的受害者，變成封建統治者的幫兇。"},{"english":"We will improve the system for managing government investment, and accelerate implementation of the contractor system for construction projects.","chinese":"健全政府投資管理體制，加快推行代建制。"},{"english":"Feudal and monarchical maladies no longer run in our blood.","chinese":"在我們的血液裏已不再存在封建制和君主制的病害。"},{"english":"The process and driving model of institutionalization for the discipline are discussed here.","chinese":"分析了消防工程學科建制化的過程及其驅動模式。"},{"english":"The fall of the West Rome Empire marked the beginning of feudalism in Eurpoe.","chinese":"西羅馬帝國的滅亡標誌着歐洲封建制度的開始。"},{"english":"Refers to cities establish with the approval of the central government.","chinese":"指經國家批准成立的“市”建制的城市。"},{"english":"Feudal economic structure formulated in Warring States period.","chinese":"戰國秦漢時期是我國封建制度的奠基時期。"},{"english":"A number of slips record the discussion about the administrative establishment of Dongting Prefecture.","chinese":"其中還有多枚簡涉及對洞庭郡某一行政建制的討論。"},{"english":"Shi, according to records, the Xia and Shang Dynasties period began Wuqiang officially formed in the Han Dynasty.","chinese":"據史志記載，武強始於夏商時期，正式建制於兩漢。"},{"english":"Withdrawn in 1950 the establishment of Dalian University, Dalian Medical College independent.","chinese":"1950年撤消大連大學建制，大連醫學院獨立。"},{"english":"The approval for the government injection into the Community Care Fund hinged on support from pro-establishment legislators.","chinese":"關愛基金撥款獲批與否，取決於建制派議員的支持。"}],"related":[{"definition":["directly subordinate"],"pinyin":["zhi2 shu3"],"word":"直屬"},{"definition":["number of military unit"],"pinyin":["fan1 hao4"],"word":"番號"},{"definition":["administered by\/under the rule of"],"pinyin":["xia4 xia2"],"word":"下轄"},{"definition":["to incorporate\/to put under (external administration)"],"pinyin":["hua4 gui1"],"word":"劃歸"},{"definition":["large military unit\/formation\/corps\/army"],"pinyin":["bing1 tuan2"],"word":"兵團"},{"definition":["to expand (esp. by new recruitment)\/to increase the army\/to augment"],"pinyin":["kuo4 bian1"],"word":"擴編"},{"definition":["to govern directly"],"pinyin":["zhi2 xia2"],"word":"直轄"},{"definition":["regular army\/standing army"],"pinyin":["zheng4 gui1 jun1"],"word":"正規軍"},{"definition":["to merge into\/to incorporate in"],"pinyin":["bing4 ru4"],"word":"併入"},{"definition":["to weave\/to plait\/to compile\/to put together (a lesson plan, budget etc)"],"pinyin":["bian1 zhi4"],"word":"編製"},{"definition":["to govern\/to control\/having jurisdiction over\/linchpin of a wheel (archaic)\/noise of a barrow"],"pinyin":["xia2"],"word":"轄"},{"definition":["station\/encampment"],"pinyin":["zhu4 di4"],"word":"駐地"},{"definition":["to govern\/to have complete control over\/to be in command of"],"pinyin":["tong3 xia2"],"word":"統轄"},{"definition":["administrative subdivision"],"pinyin":["xing2 zheng4 qu1 hua4"],"word":"行政區劃"},{"definition":["military institution"],"pinyin":["jun1 shi4 ji1 gou4"],"word":"軍事機構"},{"definition":["to belong to (a category)\/to be attached to"],"pinyin":["li4 shu3"],"word":"隸屬"}]}