{"definition":["to construct (often sth abstract, such as good relations)\/to set up\/to develop\/construction (abstract)\/architecture"],"pinyin":["jian4 gou4"],"simplified":["建构"],"rank":19991.0,"normalized_rank":0.2797000265834651,"fraction":0.0000023946169910431354,"cumulative_fraction":0.9748165041632829,"word":"建構","characters":[{"definition":["to establish\/to found\/to set up\/to build\/to construct"],"pinyin":["jian4"],"word":"建"},{"definition":["to construct\/to form\/to make up\/to compose\/literary composition\/paper mulberry (Broussonetia papyrifera)"],"pinyin":["gou4"],"word":"構"}],"containing_words":[{"definition":["constructivist theory"],"pinyin":["jian4 gou4 zheng4 yi4 li3 lun4"],"word":"建構正義理論"}],"sentences":[{"english":"Reading comprehension is a reading process where readers can construct the meaning of version.","chinese":"讀解就是讀者建構文本意義的閱讀過程。"},{"english":"The theory of constructionism contributes to the psychology teaching.","chinese":"建構主義理論對於心理學教學改革有着重要的啓示。"},{"english":"Constructivism is a revolution of contemporary educational psychology.","chinese":"建構主義是當代教育心理學的一場革命。"},{"english":"Thus, understanding these complex factors helps to build the lexicon theory.","chinese":"瞭解這些複雜因素，有助於“詞庫”理論的建構。"},{"english":"The first one is the construction of the Oberlin Student Center.","chinese":"其一，建構奧柏林學生活動中心。"},{"english":"The fifth chapter for secondary school education career planning of curriculum system construction.","chinese":"第五章爲中職學校生涯規劃教育課程體系的建構。"},{"english":"Could you please explaining briefly on your thinking of the conflicts between ontology and constructionism?","chinese":"您是否可以對本體論和建構論之間的悖論稍作解釋？"},{"english":"I consider that we can understand essence of science throught constructural realism.","chinese":"本文試圖通過建構的實在論來理解科學的本質問題。"},{"english":"The construction of the theory plays an important role in the building of the discipline system of Redology.","chinese":"學科理論之建構，也是紅學學科體系建設的重要課題。"},{"english":"It is structured and ordered into a few basic regime types.","chinese":"它是經建構與安排成數種基本政體類型。"},{"english":"Through these questions, Mencius put forward the ultimate basis of goodness.","chinese":"通過對善的不斷追問，孟子爲善建構了形上學的根據。"},{"english":"The house construction and the view of people overlap.","chinese":"家屋的建構與人觀是疊合在一起的。"},{"english":"Students'automatic development helps to the reasonable costruction of teachers'authority .","chinese":"學生自主發展能夠促進教師權威的合理建構。"},{"english":"Individual should be re-planning geographical imagination, and construct happiness space in the heart.","chinese":"個體應該重新規劃地理想象，在內心建構幸福空間。"},{"english":"Constructivism learning theory is an important theoretical basis for contemporary researches on classroom instruction.","chinese":"建構主義學習觀是當代課堂教學研究的重要理論基礎。"},{"english":"Confucian academic legitimacy rebuilding under the influence of political reforms and academic changes.","chinese":"政局變革與學術變遷影響下的儒學正統性建構。"}],"related":[{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["to create\/to bring about\/to produce\/to set (a record)"],"pinyin":["chuang4 zao4"],"word":"創造"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to combine\/to link\/to integrate\/binding\/CL:次[ci4]"],"pinyin":["jie2 he2"],"word":"結合"},{"definition":["vision (of the future)"],"pinyin":["yuan4 jing3"],"word":"願景"},{"definition":["to build (housing)\/to construct\/to make"],"pinyin":["ying2 zao4"],"word":"營造"},{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"word":"實踐"},{"definition":["system\/setup\/CL:個|个[ge4]"],"pinyin":["ti3 xi4"],"word":"體系"},{"definition":["to use\/to put to use"],"pinyin":["yun4 yong4"],"word":"運用"},{"definition":["cognition\/cognitive\/understanding\/perception\/awareness\/to be cognizant of\/to recognize\/to realize"],"pinyin":["ren4 zhi1"],"word":"認知"},{"definition":["society\/CL:個|个[ge4]"],"pinyin":["she4 hui4"],"word":"社會"},{"definition":["to extend\/to spread\/to popularize\/generalization\/promotion (of a product etc)"],"pinyin":["tui1 guang3"],"word":"推廣"},{"definition":["to interpret\/to comment and explain\/to annotate\/to perform (i.e. interpret a theatrical role)\/to decode\/interpretation\/annotation"],"pinyin":["quan2 shi4"],"word":"詮釋"},{"definition":["sustainable development"],"pinyin":["ke3 chi2 xu4 fa1 zhan3"],"word":"可持續發展"},{"definition":["to pass through\/to penetrate\/by means of\/via"],"pinyin":["tou4 guo4"],"word":"透過"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰顯"}]}