{"definition":["to overreach oneself\/to try to be clever and end up with egg on one's face"],"pinyin":["nong4 qiao3 cheng2 zhuo1"],"simplified":["弄巧成拙"],"rank":35869.0,"normalized_rank":0.5018538469072237,"fraction":5.607000647766815e-7,"cumulative_fraction":0.99455525961555,"word":"弄巧成拙","characters":[{"definition":["lane\/alley","to do\/to manage\/to handle\/to play with\/to fool with\/to mess with\/to fix\/to toy with"],"pinyin":["long4","nong4"],"word":"弄"},{"definition":["opportunely\/coincidentally\/as it happens\/skillful\/timely"],"pinyin":["qiao3"],"word":"巧"},{"definition":["surname Cheng","to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth"],"pinyin":["Cheng2","cheng2"],"word":"成"},{"definition":["awkward\/clumsy\/dull\/inelegant\/(polite) my\/Taiwan pr. [zhuo2]"],"pinyin":["zhuo1"],"word":"拙"}],"containing_words":[],"sentences":[{"english":"Elder brother big move has intellective drawback, often outsmart oneself.","chinese":"哥哥大招有智力缺陷，往往弄巧成拙。"},{"english":"As we soon discovered, though, most people can't carry it off.","chinese":"不過，我們很快發現，其實大部分人都弄巧成拙。"},{"english":"Do not prepared to change without objects and divergent, and thus self-defeating.","chinese":"千萬不要毫無對象和準備地求變求異，從而弄巧成拙。"},{"english":"Perceiving myself in a blunder, I attempted to correct it.","chinese":"認識到自己弄巧成拙，我就試着去糾正錯誤。"}],"related":[{"definition":["to produce the opposite of the desired result"],"pinyin":["shi4 de2 qi2 fan3"],"word":"適得其反"},{"definition":["see 弄巧成拙[nong4 qiao3 cheng2 zhuo1]"],"pinyin":["nong4 qiao3 fan3 zhuo1"],"word":"弄巧反拙"},{"definition":["lit. to try to steal a chicken only to end up losing the rice used to lure it (idiom)\/fig. to try to gain an advantage only to end up worse off\/to go for wool and come back shorn"],"pinyin":["tou1 ji1 bu4 cheng2 shi2 ba3 mi3"],"word":"偷雞不成蝕把米"},{"definition":["to try to draw a tiger but end up with a likeness of a dog (idiom)\/to try to do sth overambitious and end up botching it"],"pinyin":["hua4 hu3 bu4 cheng2 fan3 lei4 quan3"],"word":"畫虎不成反類犬"},{"definition":["the gains do not make up for the losses (idiom)"],"pinyin":["de2 bu4 chang2 shi1"],"word":"得不償失"},{"definition":["to invite trouble"],"pinyin":["yin3 huo3 shao1 shen1"],"word":"引火燒身"},{"definition":["lit. draw legs on a snake (idiom); fig. to ruin the effect by adding sth superfluous\/to overdo it"],"pinyin":["hua4 she2 tian1 zu2"],"word":"畫蛇添足"},{"definition":["see 偷雞不成蝕把米|偷鸡不成蚀把米[tou1 ji1 bu4 cheng2 shi2 ba3 mi3]"],"pinyin":["tou1 ji1 bu4 zhao2 shi2 ba3 mi3"],"word":"偷雞不著蝕把米"},{"definition":["stir up the fire and you get burnt (idiom); to get one's fingers burnt\/fig. to suffer on account of one's own meddling"],"pinyin":["re3 huo3 shao1 shen1"],"word":"惹火燒身"},{"definition":["pretense that turns into reality (idiom); to play at make-believe, but accidentally make it true"],"pinyin":["nong4 jia3 cheng2 zhen1"],"word":"弄假成真"},{"definition":["to hand someone the swordhilt (idiom)\/to give someone a hold on oneself"],"pinyin":["shou4 ren2 yi3 bing3"],"word":"授人以柄"},{"definition":["to think oneself clever (idiom)"],"pinyin":["zi4 zuo4 cong1 ming2"],"word":"自作聰明"},{"definition":["a clever person may become the victim of his own ingenuity (idiom); cleverness may overreach itself\/too smart for one's own good"],"pinyin":["cong1 ming2 fan3 bei4 cong1 ming2 wu4"],"word":"聰明反被聰明誤"},{"definition":["to make a fool of oneself\/to make oneself a laughing stock"],"pinyin":["yi2 xiao4 da4 fang1"],"word":"貽笑大方"},{"definition":["a new branch grows out of a knot (idiom); fig. side issues keep arising"],"pinyin":["jie2 wai4 sheng1 zhi1"],"word":"節外生枝"},{"definition":["having given away a bride, to lose one's army on top of it (idiom)\/to suffer a double loss after trying to trick the enemy"],"pinyin":["pei2 le5 fu1 ren2 you4 zhe2 bing1"],"word":"賠了夫人又折兵"}]}