{"definition":["to draw into\/to pull into\/to introduce"],"pinyin":["yin3 ru4"],"simplified":["引入"],"rank":3817.0,"normalized_rank":0.05340478222545577,"fraction":0.000035410376858406326,"cumulative_fraction":0.8243858362169442,"word":"引入","characters":[{"definition":["to draw (e.g. a bow)\/to pull\/to stretch sth\/to extend\/to lengthen\/to involve or implicate in\/to attract\/to lead\/to guide\/to leave\/to provide evidence or justification for\/old unit of distance equal to 10 丈[zhang4], one-thirtieth of a km or 33.33 meters"],"pinyin":["yin3"],"word":"引"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"}],"containing_words":[{"definition":["to mislead\/to lead astray"],"pinyin":["yin3 ru4 mi2 tu2"],"word":"引入迷途"}],"sentences":[{"english":"Chapter three explores how to lead the primary school language teaching into the local culture of study in primary schools.","chinese":"第三章探究了小學語文教學引入如東地方文化的實踐。"},{"english":"1913 - The USA introduces an income tax.","chinese":"1913年的今天，美國引入所得稅。"},{"english":"Steven Gerrard today backed calls for the introduction of goal-line technology.","chinese":"傑拉德今天表示了他對引入球門線技術的支持。"},{"english":"You could put the content of the spinner as a third argument.","chinese":"您可將微調控制項的內容作爲第三個參數引入。"},{"english":"We need to put electricity into people's homes and do it cleanly.","chinese":"我們需要把電引入人民家中，而且要做得乾淨利索。"},{"english":"This paper examines a new concept of community-based tourism(CBET) that originated in foreign country.","chinese":"本文引入了國外基於社區的生態旅遊這一新發展理念。"},{"english":"Imprecise computation model was introduced to rotational scheduling algorithm.","chinese":"方法將非精確計算模型引入到輪轉式調度算法中。"},{"english":"The last is the introduction of disturbation to avoid local optimization.","chinese":"第四，引入擾動以避免陷入局部優化。"},{"english":"In vulcanization, a series of cross-links are introduced into an elastomer to give it strength.","chinese":"在硫化，一系列的交叉環節引入彈性體給它的實力。"},{"english":"The acetoacetyl functionality can reduce solution viscosity.","chinese":"乙酰乙酰基的引入，可降低體系溶液粘度。"},{"english":"By analyzing, this paper expounds its concrete application in Soil and Water Conservaˉtion research.","chinese":"通過分析，引入它在水土保持研究中的具體應用。"},{"english":"Substitution characters are not introduced during parsing or serialization on the server.","chinese":"在服務器上，解析或串行化不會引入替換字符。"},{"english":"The nation was led astray by a mountebank.","chinese":"這個國家被一個誇誇其談的騙子引入歧途。"},{"english":"So we need to introduce the concept of (KVC) Knowledge Value Chain.","chinese":"這就需要在政府組織中引入知識價值鏈。"},{"english":"Will make every effort to achieve will drop an intestinal juices introduction large intestine deeper spot.","chinese":"力求做到將滴腸液引入大腸更深的部位。"},{"english":"The notion of strong Q-semismoothness for a quasidifferentiable function was proposed.","chinese":"引入了擬可微函數的擬強半光滑性。"}],"related":[{"definition":["to recommend\/to introduce (from outside)"],"pinyin":["yin3 jin4"],"word":"引進"},{"definition":["currently existing\/currently available"],"pinyin":["xian4 you3"],"word":"現有"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["(of systems, facilities etc) comprehensive\/well-developed\/excellent\/to refine\/to improve"],"pinyin":["wan2 shan4"],"word":"完善"},{"definition":["to construct\/to build\/infrastructure\/architecture\/framework"],"pinyin":["jia4 gou4"],"word":"架構"},{"definition":["to blend into\/to integrate\/to assimilate\/to merge"],"pinyin":["rong2 ru4"],"word":"融入"},{"definition":["to push out\/to release\/to launch\/to publish\/to recommend"],"pinyin":["tui1 chu1"],"word":"推出"},{"definition":["to bring into\/to channel into\/to integrate into\/to incorporate"],"pinyin":["na4 ru4"],"word":"納入"},{"definition":["to start using\/(computing) to enable (a feature)"],"pinyin":["qi3 yong4"],"word":"啟用"},{"definition":["all new\/completely new"],"pinyin":["quan2 xin1"],"word":"全新"},{"definition":["to create\/to build\/to develop\/to forge (of metal)"],"pinyin":["da3 zao4"],"word":"打造"},{"definition":["to conform\/to integrate"],"pinyin":["zheng3 he2"],"word":"整合"},{"definition":["to adopt\/to employ\/to use"],"pinyin":["cai3 yong4"],"word":"採用"},{"definition":["besides\/in addition\/moreover\/furthermore"],"pinyin":["ci3 wai4"],"word":"此外"},{"definition":["system\/setup\/CL:個|个[ge4]"],"pinyin":["ti3 xi4"],"word":"體系"},{"definition":["to introduce into\/to channel\/to lead\/to guide into\/to import (data)"],"pinyin":["dao3 ru4"],"word":"導入"}]}