{"definition":["to induce labor (childbirth)"],"pinyin":["yin3 chan3"],"simplified":["引产"],"rank":30687.0,"normalized_rank":0.4293509437130105,"fraction":8.871060384399619e-7,"cumulative_fraction":0.9908701777765172,"word":"引產","characters":[{"definition":["to draw (e.g. a bow)\/to pull\/to stretch sth\/to extend\/to lengthen\/to involve or implicate in\/to attract\/to lead\/to guide\/to leave\/to provide evidence or justification for\/old unit of distance equal to 10 丈[zhang4], one-thirtieth of a km or 33.33 meters"],"pinyin":["yin3"],"word":"引"},{"definition":["to give birth\/to reproduce\/to produce\/product\/resource\/estate\/property"],"pinyin":["chan3"],"word":"產"}],"containing_words":[],"sentences":[{"english":"Induced abortion with Rivanol is still mainly choice for intermediate pregnancy (>16 weeks).","chinese":"孕期超過16周以利凡諾引產宜作宮頸準備。"},{"english":"More than 100 days if pregnant, you will can only do induced labor surgery.","chinese":"如果懷孕超過100天的話，就只能做引產手術了。"},{"english":"A big problem around the country is the rate of births that are induced.","chinese":"全國各地的一個大問題是引產率。"},{"english":"Objective To study application of rivanol in induced abortion of pregnancy with complications in the second and third trimester.","chinese":"目的研究利凡諾用於中晚期高危妊娠引產的應用。"},{"english":"Methods Chondrocytes which were obtained from aborted fetal were cultured in vitro.","chinese":"方法水囊引產胎兒的軟骨細胞體外單層培養。"},{"english":"Objective:To compare the effect of labor induced with intravenous infusion of high and low dose of oxytocin in late gestation.","chinese":"比較大小劑量縮宮素靜脈輸注對晚期妊娠引產的效果。"},{"english":"Induction at 41 weeks with cervical ripening lowers the cesarean delivery rate.","chinese":"妊娠41周，經促宮頸成熟後引產可降低剖宮產分描。"},{"english":"If labor has not begun within a reasonable time after rupture of membranes induction with oxytocin ( Pitocin ) is appropriate.","chinese":"若破膜後產程未在適當時間開始，可給予縮宮素引產。"},{"english":"She had to induced because the baby was four weeks late.","chinese":"她的孩子晚了四個星期仍未出生，因此要給她引產。"},{"english":"A cervical examination should be performed before initiating attempts at labor induction.","chinese":"開始進行引產前，應行宮頸檢查。"},{"english":"Group 3∶23 cases, Mifepristone was used for initiating midtrimester abortion with Ethacridine intra-amniotic instillation.","chinese":"第三組23例，米非司酮聯合依沙吖啶引產。"},{"english":"Clinical Observation of Rivanol Combined with Mifepristone in the Induction of Labor in Mid-pregnancy;","chinese":"目的探討依沙吖啶聯合米非司酮用於中孕引產的效果。"},{"english":"Doctors often induce labor in pregnant women with powerful drugs.","chinese":"醫生常常使用強效藥來爲孕婦引產。"},{"english":"After induced abortion, she was transferred to surgical department for surgery.","chinese":"結腸鏡診斷結腸癌，引產後轉普外科行手術治療。"},{"english":"Objective To study the effects of exogenous estrogen on fracture healing.","chinese":"目的探討外源性雌激素對利凡諾引產的影響。"},{"english":"Objective To observe the effect of combination of misoprostol and oxytocin used in late gestation induced labor.","chinese":"目的米索前列醇合併催產素用於晚期妊娠引產的效果。"}],"related":[{"definition":["at childbirth\/in labor"],"pinyin":["lin2 pen2"],"word":"臨盆"},{"definition":["abbr. for 產前檢查|产前检查[chan3 qian2 jian3 cha2]"],"pinyin":["chan3 jian3"],"word":"產檢"},{"definition":["tranquilizer\/depressant\/sedative"],"pinyin":["zhen4 ding4 ji4"],"word":"鎮定劑"},{"definition":["to help a mother give birth"],"pinyin":["zhu4 chan3"],"word":"助產"},{"definition":["the breeding season (zool.)\/oestrus (period of sexual receptivity of female mammals)"],"pinyin":["fa1 qing2 qi1"],"word":"發情期"},{"definition":["to feel apprehensive\/to be alarmed"],"pinyin":["dan1 jing1 shou4 pa4"],"word":"擔驚受怕"},{"definition":["another visit to doctor\/further diagnosis"],"pinyin":["fu4 zhen3"],"word":"復診"},{"definition":["(metaphorical) punching bag\/undeserving target of sb's wrath"],"pinyin":["chu1 qi4 tong3"],"word":"出氣筒"},{"definition":["powerless to defend oneself (idiom); helpless"],"pinyin":["zi4 shen1 nan2 bao3"],"word":"自身難保"},{"definition":["traitor to one's love\/heartless rat"],"pinyin":["fu4 xin1 han4"],"word":"負心漢"},{"definition":["visitation rights (law)"],"pinyin":["tan4 shi4 quan2"],"word":"探視權"},{"definition":["having given away a bride, to lose one's army on top of it (idiom)\/to suffer a double loss after trying to trick the enemy"],"pinyin":["pei2 le5 fu1 ren2 you4 zhe2 bing1"],"word":"賠了夫人又折兵"},{"definition":["shield\/(fig.) excuse"],"pinyin":["dang3 jian4 pai2"],"word":"擋箭牌"},{"definition":["examination room (in a doctor's office)"],"pinyin":["zhen3 jian1"],"word":"診間"},{"definition":["to reveal the cloven foot (idiom); to unmask one's true nature\/to give the game away"],"pinyin":["lu4 chu1 ma3 jiao3"],"word":"露出馬腳"},{"definition":["dumbstruck and unable to reply (idiom); left speechless\/at a loss for words"],"pinyin":["ya3 kou3 wu2 yan2"],"word":"啞口無言"}]}