{"definition":["to show the wolf into the house (idiom)\/to introduce a potential source of trouble"],"pinyin":["yin3 lang2 ru4 shi4"],"simplified":["引狼入室"],"rank":42234.0,"normalized_rank":0.5909084549410267,"fraction":3.118082109770872e-7,"cumulative_fraction":0.9972623996700116,"word":"引狼入室","characters":[{"definition":["to draw (e.g. a bow)\/to pull\/to stretch sth\/to extend\/to lengthen\/to involve or implicate in\/to attract\/to lead\/to guide\/to leave\/to provide evidence or justification for\/old unit of distance equal to 10 丈[zhang4], one-thirtieth of a km or 33.33 meters"],"pinyin":["yin3"],"word":"引"},{"definition":["wolf\/CL:匹[pi3],隻|只[zhi1],條|条[tiao2]"],"pinyin":["lang2"],"word":"狼"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"},{"definition":["room\/work unit\/grave\/scabbard\/family or clan\/one of the 28 constellations of Chinese astronomy","surname Shi"],"pinyin":["Shi4","shi4"],"word":"室"}],"containing_words":[],"sentences":[{"english":"I know I'll set a fox to keep the geese if I take him for a good friend.","chinese":"我知道要是把他當好朋友的話，等於引狼入室了。"},{"english":"Most people have a daily fight to keep the wolf from the door.","chinese":"許多人每天都在奮鬥，以免引狼入室。"},{"english":"Inviting terrorists to take part in the talks has created a hostage to fortune.","chinese":"邀請恐怖組織參加會談是引狼入室。"},{"english":"Tadatoki helpless, please come to counter-insurgency Gaochang soldiers, surprise, surprise it is asking for trouble.","chinese":"忠節無奈，請高昌兵前來平亂，想不到卻是引狼入室。"},{"english":"The Kevin's do lead the wolf into the house.","chinese":"凱文一家真是引狼入室了。"},{"english":"Asking for his help means setting the wolf the keep the sheep.","chinese":"向他尋求幫助就是引狼入室。"}],"related":[{"definition":["lit. to nurture a tiger invites calamity\/fig. to indulge one's enemy is asking for trouble (idiom)"],"pinyin":["yang3 hu3 wei2 huan4"],"word":"養虎為患"},{"definition":["leaving the door open invites the thief (idiom); to invite disaster by giving evildoers a free hand"],"pinyin":["kai1 men2 yi1 dao4"],"word":"開門揖盜"},{"definition":["lit. a lamb in a tiger's den (idiom)\/fig. to tread dangerous ground"],"pinyin":["yang2 ru4 hu3 kou3"],"word":"羊入虎口"},{"definition":["to loot a burning house\/to profit from sb's misfortune (idiom)"],"pinyin":["chen4 huo3 da3 jie2"],"word":"趁火打劫"},{"definition":["ambition of wild wolves (idiom); rapacious designs"],"pinyin":["lang2 zi3 ye3 xin1"],"word":"狼子野心"},{"definition":["to harbor evil intentions (idiom); concealing malice"],"pinyin":["bao1 cang2 huo4 xin1"],"word":"包藏禍心"},{"definition":["lit. to try to steal a chicken only to end up losing the rice used to lure it (idiom)\/fig. to try to gain an advantage only to end up worse off\/to go for wool and come back shorn"],"pinyin":["tou1 ji1 bu4 cheng2 shi2 ba3 mi3"],"word":"偷雞不成蝕把米"},{"definition":["to dig one's own grave"],"pinyin":["zi4 jue2 fen2 mu4"],"word":"自掘墳墓"},{"definition":["harboring unfathomable motives (idiom)"],"pinyin":["ju1 xin1 po3 ce4"],"word":"居心叵測"},{"definition":["lit. to let the tiger return to the mountain; fig. to store up future calamities"],"pinyin":["zong4 hu3 gui1 shan1"],"word":"縱虎歸山"},{"definition":["to bite the hand that feeds one (idiom)"],"pinyin":["en1 jiang1 chou2 bao4"],"word":"恩將仇報"},{"definition":["a cornered dog will jump over the wall (idiom)\/to be driven to desperate action"],"pinyin":["gou3 ji2 tiao4 qiang2"],"word":"狗急跳牆"},{"definition":["Rear a tiger and court disaster. (idiom); fig. if you're too lenient with sb, he will damage you later\/to cherish a snake in one's bosom"],"pinyin":["yang3 hu3 yi2 huan4"],"word":"養虎遺患"},{"definition":["lit. helping tyrant Zhou 商紂王|商纣王[Shang1 Zhou4 wang2] in his oppression (idiom)\/fig. to take the side of the evildoer\/giving succor to the enemy"],"pinyin":["zhu4 Zhou4 wei2 nu:e4"],"word":"助紂為虐"},{"definition":["to take advantage of sb's misfortune\/to loot"],"pinyin":["cheng2 huo3 da3 jie2"],"word":"乘火打劫"},{"definition":["see 窩裡鬥|窝里斗[wo1 li5 dou4]"],"pinyin":["wo1 li5 fan3"],"word":"窩裡反"}]}