{"definition":["to extend (the meaning of a word, an analogy etc)\/derivation"],"pinyin":["yin3 shen1"],"simplified":["引申"],"rank":26953.0,"normalized_rank":0.3771074391728345,"fraction":0.0000012421236269681808,"cumulative_fraction":0.9869410102510691,"word":"引申","characters":[{"definition":["to draw (e.g. a bow)\/to pull\/to stretch sth\/to extend\/to lengthen\/to involve or implicate in\/to attract\/to lead\/to guide\/to leave\/to provide evidence or justification for\/old unit of distance equal to 10 丈[zhang4], one-thirtieth of a km or 33.33 meters"],"pinyin":["yin3"],"word":"引"},{"definition":["old name for Shanghai 上海[Shang4 hai3]\/surname Shen","to extend\/to state\/to explain\/9th earthly branch: 3-5 p.m., 7th solar month (7th August-7th September), year of the Monkey\/ancient Chinese compass point: 240°"],"pinyin":["Shen1","shen1"],"word":"申"}],"containing_words":[{"definition":["extended meaning (of an expression)\/derived sense"],"pinyin":["yin3 shen1 yi4"],"word":"引申義"}],"sentences":[{"english":"“Never lie” also can be extended as “Don’t mask truths.","chinese":"“不要說謊”也可以引申爲“不掩飾真相”。"},{"english":"Many connotations are developed on the basis of this denotation in the mediaeval times.","chinese":"中古漢語時期，由此基本義產生出許多引申義。"},{"english":"The extensional meaning of compound directional complement has its cognitive basis.","chinese":"複合趨向補語的引申意義有其認知上的理據。"},{"english":"This extends naturally to the pleasures of the imagination.","chinese":"這也就很自然引申到想象的樂趣。"},{"english":"For more details on issues and does not serve to extend the scope of discussion.","chinese":"至於更多的細節性問題和引申不作爲本文的討論範疇。"},{"english":"According to the relation of sememes, a word has both original meaning and extended meaning.","chinese":"從詞義義位之間的關係看，詞有本義和引申義。"},{"english":"A word's meaning is made up of both denotation and connotation.","chinese":"一個單詞的含義是由表面義和引申義組成的。"},{"english":"This story gave rise to the idiom \"be wholeheartedly devoted to public duty.\"","chinese":"人們根據這個故事引申出“克己奉公”這句成語。"},{"english":"It is generally difficult for foreigners to grasp the extended meanings of Chinese words.","chinese":"外國人一般很難掌握中國詞語的引申義。"},{"english":"She extracted a completely personal meaning from what was said.","chinese":"她從所說的話裏引申出一個完全是個人的意思。"},{"english":"Finally, Dayu flood control extended the basic framework for the legal administration.","chinese":"最後，以大禹治水引申法治行政的基本框架。"},{"english":"Since then, from this story come out of the ghost is said Mahogany.","chinese":"此後，從這個故事中引申出了鬼怪桃木之說。"},{"english":"Furthermore, it presents a creditability problem about theorem proof in propositional logic.","chinese":"也引申出命題邏輯定理證明的一個可信性問題。"},{"english":"It has to be a two-way street.","chinese":"一條雙向道，有來有往，引申爲互相忍讓。"},{"english":"In a word, extended sememes are a result of the motion and changing of these sememes .","chinese":"引申義的形成實際上就是這些義素運動變化的結果。"},{"english":"The second kind of newly-coined words is formed by the extension of word meanings.","chinese":"第二種新造詞主要是通過詞義的引申而形成的。"}],"related":[{"definition":["extended meaning (of an expression)\/derived sense"],"pinyin":["yin3 shen1 yi4"],"word":"引申義"},{"definition":["original meaning\/literal sense"],"pinyin":["ben3 yi4"],"word":"本義"},{"definition":["to refer to\/to be used in place of"],"pinyin":["zhi3 dai4"],"word":"指代"},{"definition":["to mean\/to imply"],"pinyin":["yi4 zhi3"],"word":"意指"},{"definition":["original meaning"],"pinyin":["yuan2 yi4"],"word":"原義"},{"definition":["to give rise to\/to derive\/derivative\/derivation"],"pinyin":["yan3 sheng1"],"word":"衍生"},{"definition":["meaning of a word"],"pinyin":["ci2 yi4"],"word":"詞義"},{"definition":["to compare\/to liken to\/metaphor\/analogy\/figure of speech\/figuratively"],"pinyin":["bi3 yu4"],"word":"比喻"},{"definition":["the meaning of a phonetic loan character 假借字[jia3 jie4 zi4] acquired from a similar-sounding word (e.g. 而[er2] originally meant \"beard\" but acquired the meaning \"and\")"],"pinyin":["jia3 jie4 yi4"],"word":"假借義"},{"definition":["to sum up\/to summarize\/to conclude from facts\/induction (method of deduction in logic)"],"pinyin":["gui1 na4"],"word":"歸納"},{"definition":["to make a general reference\/to be used in a general sense"],"pinyin":["fan4 zhi3"],"word":"泛指"},{"definition":["the meaning of sth\/an explanation of the meaning of words or phrases\/definition\/an interpretation (of doctrine)\/religious doctrine"],"pinyin":["shi4 yi4"],"word":"釋義"},{"definition":["to produce (from sth else)\/to derive (from raw material)\/derivative"],"pinyin":["pai4 sheng1"],"word":"派生"},{"definition":["to explain\/to expound\/to interpret\/elucidation"],"pinyin":["chan3 shi4"],"word":"闡釋"},{"definition":["to elucidate\/to expound\/to study and explain"],"pinyin":["chan3 fa1"],"word":"闡發"},{"definition":["content\/meaning\/connotation\/implication"],"pinyin":["han2 yi4"],"word":"涵義"}]}