{"definition":["to give rise to\/to lead to\/to cause\/to arouse"],"pinyin":["yin3 qi3"],"simplified":["引起"],"rank":767.0,"normalized_rank":0.010731325115777986,"fraction":0.0002037333829746019,"cumulative_fraction":0.5777998474928809,"word":"引起","characters":[{"definition":["to draw (e.g. a bow)\/to pull\/to stretch sth\/to extend\/to lengthen\/to involve or implicate in\/to attract\/to lead\/to guide\/to leave\/to provide evidence or justification for\/old unit of distance equal to 10 丈[zhang4], one-thirtieth of a km or 33.33 meters"],"pinyin":["yin3"],"word":"引"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"E. coli O157:H7 causes abdominal cramping, vomiting and a diarrheal illness, often with bloody stools.","chinese":"H7能引起腹部絞痛，嘔吐和腹瀉，通常是血便。"},{"english":"Spontanous subarachnoid hemorrhage ( SAH) mostly arises from rupture and bleeding of intracranial aneurysms.","chinese":"自發性蛛網膜下腔出血多是由於顱內動脈瘤破裂引起。"},{"english":"Gordimer's fiction has been the subject of much commentary in South Africa over the years.","chinese":"戈迪默的小說已多年來在南非引起了很大評論的話題。"},{"english":"The explosion was caused by a burst gas pipe .","chinese":"這次爆炸是由一個爆裂的煤氣管引起的。"},{"english":"Virus-infected emails struck fear into the Microsoft Company.","chinese":"攜帶病毒的電子郵件引起了微軟公司的恐慌。"},{"english":"The small chin deformity was a common developmental deformity of the jaw.","chinese":"“地包天”牙是頜骨發育畸形或不良習慣所引起。"},{"english":"The supplies of sugar have been running low,causing a rise in the price.","chinese":"糖的供應日漸短缺，從而引起價格的上漲。"},{"english":"They may also have personality differences which can cause conflict.","chinese":"他們所具有的個性差異也可能會引起衝突。"},{"english":"All along the disease is considered to be caused by abnormal swim bladders.","chinese":"一直以來，該病都被認爲是由魚鰾異常引起的。"},{"english":"The little chicks had no more than whetted his appetite.","chinese":"那幾只小雞隻不過引起了他的食慾而已。"},{"english":"It is simply that the tactic should always respond to the rival in the way that astonishes him most.","chinese":"就是說一個戰術應該最大程度地引起對手的驚訝。"},{"english":"Why are GM foods potentially allergenic?","chinese":"爲什麼轉基因食物可能會引起過敏？"},{"english":"But external hemorrhoids usually resolve in a week or so.","chinese":"一般而言，外痔引起的不適可在一週左右解除。"},{"english":"Pod transport technology is even starting gain some stateside attention.","chinese":"豆莢車運輸技術甚至引起了美國的關注。"},{"english":"It is well-known that lung cancer is caused at least in part by smoking too much.","chinese":"衆所周知，肺癌至少部分是由於吸菸過多引起的。"},{"english":"RemoteException - Thrown when the method failed due to a system-level failure.","chinese":"方法拋出該異常表示一個由系統級錯誤引起的失敗。"}],"related":[{"definition":["to lead to\/to trigger\/to initiate\/to cause\/to evoke (emotions)"],"pinyin":["yin3 fa1"],"word":"引發"},{"definition":["to lead to\/to create\/to cause\/to bring about"],"pinyin":["dao3 zhi4"],"word":"導致"},{"definition":["to bring about\/to create\/to cause"],"pinyin":["zao4 cheng2"],"word":"造成"},{"definition":["to induce\/to cause\/to elicit\/to trigger"],"pinyin":["you4 fa1"],"word":"誘發"},{"definition":["to arise\/to come into being\/to come about\/to give rise to\/to bring into being\/to bring about\/to produce\/to engender\/to generate\/to appear\/appearance\/emergence\/generation\/production\/yield"],"pinyin":["chan3 sheng1"],"word":"產生"},{"definition":["to discuss passionately\/heated debate"],"pinyin":["re4 yi4"],"word":"熱議"},{"definition":["to recruit (followers)\/to scout for (talent etc)\/to incur\/to lead to"],"pinyin":["zhao1 zhi4"],"word":"招致"},{"definition":["to be caused by"],"pinyin":["suo3 zhi4"],"word":"所致"},{"definition":["to receive (praise, an education, punishment etc)\/to be ...ed (praised, educated, punished etc)"],"pinyin":["shou4 dao4"],"word":"受到"},{"definition":["to appear\/to arise\/to emerge\/to show up"],"pinyin":["chu1 xian4"],"word":"出現"},{"definition":["extensive\/wide range"],"pinyin":["guang3 fan4"],"word":"廣泛"},{"definition":["to happen\/to occur\/to take place\/to break out"],"pinyin":["fa1 sheng1"],"word":"發生"},{"definition":["to cause a sensation\/to create a stir in (a place)\/commotion\/controversy"],"pinyin":["hong1 dong4"],"word":"轟動"},{"definition":["cause\/triggering factor\/incentive\/inducement"],"pinyin":["you4 yin1"],"word":"誘因"},{"definition":["to intensify\/to sharpen\/to accelerate\/to aggravate\/to exacerbate\/to embitter"],"pinyin":["jia1 ju4"],"word":"加劇"},{"definition":["cause\/reason\/because"],"pinyin":["yin1"],"word":"因"}]}