{"definition":["to introduce (sb)\/(esp.) to present to the emperor"],"pinyin":["yin3 jian4"],"simplified":["引见"],"rank":37807.0,"normalized_rank":0.5289689812936353,"fraction":4.7282153340579826e-7,"cumulative_fraction":0.9955524613962587,"word":"引見","characters":[{"definition":["to draw (e.g. a bow)\/to pull\/to stretch sth\/to extend\/to lengthen\/to involve or implicate in\/to attract\/to lead\/to guide\/to leave\/to provide evidence or justification for\/old unit of distance equal to 10 丈[zhang4], one-thirtieth of a km or 33.33 meters"],"pinyin":["yin3"],"word":"引"},{"definition":["to appear\/also written 現|现[xian4]","to see\/to meet\/to appear (to be sth)\/to interview"],"pinyin":["jian4","xian4"],"word":"見"}],"containing_words":[],"sentences":[{"english":"He visited Vallombrosa when he was introduced to Galileo in Fiesole.","chinese":"他被引見給尚在菲耶索的伽利略時曾經去過那裏。"},{"english":"On that day, due to Yihe's introduction, I firstly met Haizi.","chinese":"那一天，因駱一禾引見，我與海子初次相識。"},{"english":"Director of the present to force the actors also get rid of eery salesman boasts suspicion.","chinese":"導演引見的給力，演員們也擺脫不了老王賣瓜的嫌疑。"},{"english":"I'd like to stand in if you introduce me.","chinese":"如果你給我作引見，我願意加入。"},{"english":"The example to introduce grass carp baked method of making Wanzhou.","chinese":"本幢救嗽草魚爲例引見萬州烤魚地製造辦法。"},{"english":"But if you have watched it already, I don't think it is necessary to discribe it for you.","chinese":"但是假如你看了話，我以爲我不需求再向你引見它了。"},{"english":"Could you introduce to me the man over there?","chinese":"把那邊那個人給我引見一下好嗎？"},{"english":"In a party, he introduced me to his manager.","chinese":"在聚會上，他把我引見給了司理。"},{"english":"Introduced to the warden wearing a Song Jiang Kui.","chinese":"戴監獄長把李逵引見給了宋江。"},{"english":"Then Wang Ping crossed the river and submitted to Zhao Zilong, who took the defector to Xuande.","chinese":"王平渡漢水來投趙雲，雲引見玄德。"},{"english":"Allow me, Sir, to introduce you to my fellow-travellers.","chinese":"先生，請容許我向你引見我的旅伴。"},{"english":"Introductions in advance by the enemy of the white tea NE release of radiation.","chinese":"事先經冤家引見了NE放輻射美白茶。"},{"english":"Today I will introduce you one of the wonders of the world, the Great Wall.","chinese":"今天，自己將向你引見地世界，長城地奇觀之一。"},{"english":"The following is the science and technology as the people under the present semiconductor laser.","chinese":"下面由正明科技爲大家引見下半導體激光器。"},{"english":"I met a girl who ------ you -Oh, that may be my t…","chinese":"求一篇自我引見的英語作文。"},{"english":"Only Ju must also be called on, Ju is in order to see you to Zhang Jun, please.","chinese":"就是我也能求見的，請讓我把您引見給張君。"}],"related":[]}