{"definition":["Zhangjiajie prefecture level city in Hunan, formerly Dayong 大庸[Da4 yong1]"],"pinyin":["Zhang1 jia1 jie4"],"simplified":["张家界"],"rank":13653.0,"normalized_rank":0.19102318357981332,"fraction":0.00000488966658936728,"cumulative_fraction":0.9529816293989788,"word":"張家界","characters":[{"definition":["surname Zhang","to open up\/to spread\/sheet of paper\/classifier for flat objects, sheet\/classifier for votes"],"pinyin":["Zhang1","zhang1"],"word":"張"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"},{"definition":["boundary\/scope\/extent\/circles\/group\/kingdom (taxonomy)"],"pinyin":["jie4"],"word":"界"}],"containing_words":[{"definition":["Zhangjiajie prefecture level city in Hunan"],"pinyin":["Zhang1 jia1 jie4 shi4"],"word":"張家界市"}],"sentences":[{"english":"Various orchids stand on both sides of Golden Whip Stream.","chinese":"張家界金鞭溪遊道兩邊有多種蘭花植物。"},{"english":"With your trust, Zhangjiajie China Travel Service will enjoy a better tomorrow.","chinese":"有你們的信賴，張家界市中旅的明天會更好。"},{"english":"A large crowd of plane fans collected in Zhangjiajie to watch the Russian Air Show.","chinese":"大量的飛機迷們聚集在張家界觀看俄羅斯空軍表演。"},{"english":"Objective To know the blood quality of free blood donation in Zhangjiajie City.","chinese":"目的瞭解張家界市無償獻血的血液質量。"},{"english":"After two hours, I turn off the highway to get to Zhangjiajie.","chinese":"兩個小時後，我下了高速公路，前往張家界。"},{"english":"Search Zhangjiajie tourism network, also has dozens of hundreds of tourists a wonder.","chinese":"搜索張家界旅遊網，也有幾十上百個，遊客納悶了。"},{"english":"It had nothing to say about Zhangjiajie.","chinese":"那上面沒講張家界。"},{"english":"This is the first Zhangjiajie was listed on the five-star hotel.","chinese":"這是張家界首家獲得掛牌的五星級酒店。"},{"english":"Some of them even prefer it to Guilin.","chinese":"有些旅遊者認爲張家界比桂林還要好。"},{"english":"Zhangjiajie into, as into the picture of a pair of quiet.","chinese":"走進張家界，就如同走進了一副安靜的畫卷。"},{"english":"Our family spent a pleasant week in Zhangjiajie.","chinese":"我家在張家界愉快地度過了一個禮拜。"},{"english":"Blooming azaleas in Luofeng Mountain, Zhangjiajie City.","chinese":"張家界羅峯山盛開的杜鵑花。"},{"english":"Zhangjiajie Tourism that \"smokeless industry\" in transition are faced with the pressure.","chinese":"張家界旅遊這一“無煙工業”，面臨着轉型的壓力。"},{"english":"\"Friendship Forum 2008\" was opened today in Zhangjiajie.","chinese":"“2008友好論壇”今天在張家界開幕。"},{"english":"There are mainly ground-living orchid in Zhangjiajie, growing among the wood.","chinese":"張家界的蘭花以地生蘭爲主，生長於林間。"},{"english":"I had not heard about Zhangjiajie until about a few weeks ago.","chinese":"我是一直到最近才聽說張家界的。"}],"related":[{"definition":["scenic area"],"pinyin":["jing3 qu1"],"word":"景區"},{"definition":["Yangshuo county in Guilin 桂林[Gui4 lin2], Guangxi"],"pinyin":["Yang2 shuo4"],"word":"陽朔"},{"definition":["Lushan district of Jiujiang city 九江市, Jiangxi\/Mt Lushan in Jiujiang, famous as summer holiday spot"],"pinyin":["Lu2 shan1"],"word":"廬山"},{"definition":["to walk\/to tour\/to roam\/to travel"],"pinyin":["you2"],"word":"遊"},{"definition":["to go sightseeing\/to tour\/to visit\/CL:次[ci4]"],"pinyin":["you2 lan3"],"word":"遊覽"},{"definition":["Changsha prefecture-level city and capital of Hunan province in south central China"],"pinyin":["Chang2 sha1"],"word":"長沙"},{"definition":["backpacker\/travel buddy"],"pinyin":["lu:2 you3"],"word":"驢友"},{"definition":["Fenghuang Ancient Town, in Fenghuang County, Xiangxi Prefecture, Hunan, added to the UNESCO World Heritage Tentative List in 2008 in the Cultural category"],"pinyin":["Feng4 huang2 Gu3 cheng2"],"word":"鳳凰古城"},{"definition":["tourist city"],"pinyin":["lu:3 you2 cheng2 shi4"],"word":"旅遊城市"},{"definition":["scenic spot\/place of interest (tourism)"],"pinyin":["jing3 dian3"],"word":"景點"},{"definition":["holy land (of a religion)\/sacred place\/shrine\/holy city (such as Jerusalem, Mecca etc)\/center of historic interest"],"pinyin":["sheng4 di4"],"word":"聖地"},{"definition":["Chongqing city, formerly in Sichuan province, a municipality since 1997, short name 渝[Yu2]"],"pinyin":["Chong2 qing4 shi4"],"word":"重慶市"},{"definition":["Jiuzhaigou Valley, Sichuan\/Jiuzhaigou county, Sichuan"],"pinyin":["Jiu3 zhai4 gou1"],"word":"九寨溝"},{"definition":["a place famous for its scenery or historical relics\/scenic spot\/CL:處|处[chu4]"],"pinyin":["ming2 sheng4"],"word":"名勝"},{"definition":["Guizhou province (Kweichow) in south central China, abbr. to 黔[Qian2] or 貴|贵[Gui4], capital Guiyang 貴陽|贵阳[Gui4 yang2]"],"pinyin":["Gui4 zhou1"],"word":"貴州"},{"definition":["Changbai or Baekdu mountains 白頭山|白头山, volcanic mountain range between Jilin province and North Korea, prominent in Manchu and Korean mythology"],"pinyin":["Chang2 bai2 shan1"],"word":"長白山"}]}