{"definition":["tensor (math.)"],"pinyin":["zhang1 liang4"],"simplified":["张量"],"rank":54142.0,"normalized_rank":0.7575168245351391,"fraction":9.050612865439793e-8,"cumulative_fraction":0.9994396167066709,"word":"張量","characters":[{"definition":["surname Zhang","to open up\/to spread\/sheet of paper\/classifier for flat objects, sheet\/classifier for votes"],"pinyin":["Zhang1","zhang1"],"word":"張"},{"definition":["capacity\/quantity\/amount\/to estimate\/abbr. for 量詞|量词[liang4 ci2], classifier (in Chinese grammar)\/measure word","to measure"],"pinyin":["liang2","liang4"],"word":"量"}],"containing_words":[],"sentences":[{"english":"We have dealt with effective conductivity tensor of the composites with local anisotropic components.","chinese":"我們計算了定域各向異性材料的有效電導率張量。"},{"english":"There are many great applications of the tensor analysis in survey with the magnetotelluric sounding method.","chinese":"張量分析在大地電磁測深法勘探中有許多重要的應用。"},{"english":"Finally, the essential commutant of tensor product of operator algebras is discussed.","chinese":"最後討論了張量積代數的本性換位。"},{"english":"We obtained also come results for rank of tensor product matrices.","chinese":"本文還得到了關於張量積矩陣積的某些結果。"},{"english":"This decomposition may give another definition of high order tensor's covariant derivative.","chinese":"這種分解可以給出高階張量協變導數的另一種定義。"},{"english":"The contraction may be applied to products of components, which have tensor character.","chinese":"縮並可以用於具有張量性質的分量之積。"},{"english":"Tensor algebra is tied to coordinates .","chinese":"張量代數則離不開座標系。"},{"english":"A release rate tensor of damage strain energy is derived.","chinese":"推導出損傷應變能釋放率張量。"},{"english":"The diagonal inertia tensor of mass relative to the center of mass.","chinese":"相對於重心的質量的慣性張量對角線。"},{"english":"An Isometry on Tensor Product of C~*-Algebras;","chinese":"縮並可以用於具有張量性質的分量之積。"},{"english":"In addition, the spheric tensor illustrates better angular dependence of the density function.","chinese":"而且，球張量更能反映密度函數的角分佈特性。"},{"english":"Furthermore, the semi module of fractions is represented as the extension of scalars, which is defined by a tensor product.","chinese":"證明了分式半模可用純量的擴張，即張量積來表示。"},{"english":"Vacuum solutions of conformally covariant equation for symmetric tensor field are discussed.","chinese":"本文討論了對稱張量場共形協變方程的真空解。"},{"english":"The fourth -rank tensors contain the compliance and stiffness constants.","chinese":"四秩張量包含柔量常數和剛度常數。"},{"english":"The decomposition of impedance tensors is a effective method developed in recent years.","chinese":"阻抗張量分解就是近幾年發展起來的一種有效的方法。"},{"english":"Quantities like stresses are called tensors of rank 2.","chinese":"類似於壓力的量稱爲2階的張量。"}],"related":[]}