{"definition":["superglue"],"pinyin":["qiang2 li4 jiao1"],"simplified":["强力胶"],"rank":52995.0,"normalized_rank":0.7414688064024177,"fraction":1.0364411507197184e-7,"cumulative_fraction":0.999328391097572,"word":"強力膠","characters":[{"definition":["strong\/powerful\/better\/slightly more than\/vigorous\/violent\/best in their category, e.g. see 百強|百强[bai3 qiang2]","stubborn\/unyielding","surname Qiang","to force\/to compel\/to strive\/to make an effort"],"pinyin":["Qiang2","jiang4","qiang2","qiang3"],"word":"強"},{"definition":["power\/force\/strength\/ability\/strenuously","surname Li"],"pinyin":["Li4","li4"],"word":"力"},{"definition":["to glue\/glue\/gum\/rubber"],"pinyin":["jiao1"],"word":"膠"}],"containing_words":[],"sentences":[{"english":"Glue- sniffing among Singapore's youth is making a worrying comeback after many years in decline.","chinese":"沉寂多年的青少年嗅吸強力膠現象死灰復燃。"},{"english":"Police found a gun and duct tape at the second-year medical student's Quincy, Mass., home.","chinese":"警察在其昆西的家中發現了一把手槍和強力膠帶。"},{"english":"I'm the social glue that holds this little group together.","chinese":"我可是將這個小團體黏在一起的強力膠。"},{"english":"I superglued the switch and the soldered the contacts.","chinese":"我用強力膠水粘上了開關，並焊接好了觸點。"},{"english":"New kind of source of environment-friendly glue set as hard as rock and can be washed.","chinese":"新型環保強力膠水，使粘合部位更牢固，不怕水洗。"},{"english":"Super glue makes many things stick together.","chinese":"強力膠可以將很多東西粘合到一起。"},{"english":"Wash the area with soap and water once the glue is gone.","chinese":"當強力膠被清除後，再次用肥皂水清洗被粘部位。"},{"english":"Superglue was discovered by Harry Coover during WWII.","chinese":"哈利庫弗在二戰的時候發明了強力膠。"},{"english":"My clothes used to stick together like Velcro.","chinese":"我的衣服以前都像強力膠似地黏在一塊。"},{"english":"The only thing that would do a better job of keeping these earbuds in place would be Super Glue.","chinese":"唯一能使耳塞好好的保持原位的恐怕就是強力膠了。"},{"english":"For Lord's sake you aren't supposed to use super glue on instruments. That will only spoil it.","chinese":"你不能用強力膠，這隻會加劇樂器的損壞程度。"},{"english":"Glue the mirror in with a strong adhesive.","chinese":"用強力膠將鏡子固定到位。"},{"english":"Use strong tape if a strapping machine is not available.","chinese":"如果沒有封箱機，要使用強力膠帶。"},{"english":"During the Vietnam War, super glue was used to seal minor wounds.","chinese":"越南戰爭期間，強力膠曾被用來黏住細小傷口。"}],"related":[]}