{"definition":["to enforce\/enforcement\/forcibly\/compulsory"],"pinyin":["qiang2 zhi4"],"simplified":["强制"],"rank":3185.0,"normalized_rank":0.04456228226043401,"fraction":0.000044797176198509164,"cumulative_fraction":0.7992849932045125,"word":"強制","characters":[{"definition":["strong\/powerful\/better\/slightly more than\/vigorous\/violent\/best in their category, e.g. see 百強|百强[bai3 qiang2]","stubborn\/unyielding","surname Qiang","to force\/to compel\/to strive\/to make an effort"],"pinyin":["Qiang2","jiang4","qiang2","qiang3"],"word":"強"},{"definition":["system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4"],"word":"制"}],"containing_words":[],"sentences":[{"english":"There is no mandatory paid annual leave in the U.S.","chinese":"美國沒有強制帶薪年假。"},{"english":"According to legal effect and content, our compellent technical standards should be one of technique regulations.","chinese":"按照法律效力和內容，我國強制性標準就是技術法規。"},{"english":"They didn't develop those habits of mind by following mandated curricula.","chinese":"他們沒有開發這些頭腦的思維習慣強制遵循課程。"},{"english":"The new advisory covers several towns northeast of the mandatory exclusion zone.","chinese":"新提議的疏散區包括了強制隔離區東北的幾個城鎮。"},{"english":"I also modified the code in an attempt to coerce escape analysis into working.","chinese":"我也修改過代碼，希望可以強制逸出分析運行。"},{"english":"Compulsion in the area of family welfare must be ruled out for all times to come.","chinese":"在家庭福利方面的強制必須及時廢除。"},{"english":"The wills of states are the foundation for EIL.","chinese":"國家意志是國際法強制執行的根據。"},{"english":"Labels therefore had a unique force over artists.","chinese":"所以唱片公司對藝人有獨特的強制力。"},{"english":"The big problem with writing commitment contracts is enforcing them.","chinese":"關於寫承諾書的重大困難是如何強制執行它們。"},{"english":"This month, a woman in Lijin, Shandong, died during a forced abortion on her seven-month foetus.","chinese":"就在本月，山東利津一名女子死於強制墮胎。"},{"english":"The relief the plaintiff sought was an injunction and damages.","chinese":"原告請求的救濟爲強制令和損害賠償金。"},{"english":"Section One of this dissertation is about the creation of the non-coercive means of environmental administration.","chinese":"文章第一部分，環境行政非強制性管理手段的產生。"},{"english":"Elements on your page do not have to be confined to individual grid units. In a five-column grid, 5 narrow columns of text can be hard to read.","chinese":"你無須強制你頁面上的元素都限制於單個單元格。"},{"english":"Finally, the Yang Sen's over-anxious and compulsory policy should be criticized.","chinese":"最後，對楊森的急於求成和強制政策要給予批評。"},{"english":"Article 47 The period of compulsory isolation for drug rehabilitation shall be two years.","chinese":"第四十七條強制隔離戒毒的期限爲二年。"},{"english":"Now it's time to tackle your unenforceable rule.","chinese":"該是解決你的不可強制執行法則的的時候了。"}],"related":[{"definition":["provision\/to fix\/to set\/to formulate\/to stipulate\/to provide\/regulation\/rule\/CL:個|个[ge4]"],"pinyin":["gui1 ding4"],"word":"規定"},{"definition":["to violate (a law)"],"pinyin":["wei2 fan3"],"word":"違反"},{"definition":["action\/conduct\/behavior\/activity"],"pinyin":["xing2 wei2"],"word":"行為"},{"definition":["automatic\/voluntarily"],"pinyin":["zi4 dong4"],"word":"自動"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"審查"},{"definition":["to be in effect\/in force\/current"],"pinyin":["xian4 xing2"],"word":"現行"},{"definition":["individual\/specific\/respective\/just one or two"],"pinyin":["ge4 bie2"],"word":"個別"},{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"實行"},{"definition":["to set\/to set up\/to install\/setting\/preferences"],"pinyin":["she4 ding4"],"word":"設定"},{"definition":["illegal\/to break the law"],"pinyin":["wei2 fa3"],"word":"違法"},{"definition":["to implement\/to carry out\/to execute\/to run"],"pinyin":["zhi2 xing2"],"word":"執行"},{"definition":["voluntary"],"pinyin":["zi4 yuan4"],"word":"自願"},{"definition":["to set up\/to install"],"pinyin":["she4 zhi4"],"word":"設置"},{"definition":["to penalize\/to punish"],"pinyin":["chu3 fa2"],"word":"處罰"},{"definition":["to allow\/to permit"],"pinyin":["xu3 ke3"],"word":"許可"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"規範"}]}