{"definition":["to insist on\/to demand\/to impose"],"pinyin":["qiang3 qiu2"],"simplified":["强求"],"rank":22217.0,"normalized_rank":0.31084465462482336,"fraction":0.0000019196057932344083,"cumulative_fraction":0.979587992521136,"word":"強求","characters":[{"definition":["strong\/powerful\/better\/slightly more than\/vigorous\/violent\/best in their category, e.g. see 百強|百强[bai3 qiang2]","stubborn\/unyielding","surname Qiang","to force\/to compel\/to strive\/to make an effort"],"pinyin":["Qiang2","jiang4","qiang2","qiang3"],"word":"強"},{"definition":["to seek\/to look for\/to request\/to demand\/to beseech"],"pinyin":["qiu2"],"word":"求"}],"containing_words":[],"sentences":[{"english":"It is the same with our children.","chinese":"人各有志，不必強求，對兒女也是如此。"},{"english":"We cannot impose peace.","chinese":"我們不會強求和平。"},{"english":"If feelings are hard I'd rather be alone all my life.","chinese":"如果激情是強求我寧願一生顧影自憐。"},{"english":"Don't try to make our house the neatest in the neighborhood.","chinese":"不要強求把我們的房子弄成全社區最乾淨的。"},{"english":"And you can't force happiness to happen—but you can make sure you are aware of it when it does.","chinese":"快樂無法強求，但一旦降臨，你要確信自己有所體察。"},{"english":"The love of 100% is importuned to not was necessary between husband and wife, also unlikely.","chinese":"夫妻之間強求100%的愛沒有必要，也不大可能。"},{"english":"In their game of reopened possibilities, he didn’t want to overplay his own hand.","chinese":"在他們有可能重新開始的戀愛遊戲中，雷斯不想強求。"},{"english":"Everything has it 's destiny, we cannot importune.","chinese":"萬物都有它的宿命，我們不能強求。"},{"english":"Therefore, the right attitude to fame and wealth is not to importune and not to shuffle them.","chinese":"所以，對名利的態度應該是，不強求，也不推諉。"},{"english":"Love is about wanting to be together but be okay when you are apart.","chinese":"愛情是渴望雙方在一起，但並不強求，而是好聚好散。"},{"english":"Force, will only make you more tired.","chinese":"強求了，只會讓自己更累。"},{"english":"Close to is it casual, so nothing good to eat fruit.","chinese":"合則來不合則散，強求沒啥好果子喫。"},{"english":"Not too concerned about everything, but without the need to force it all Going.","chinese":"凡事不必太在意，更不需去強求，一切隨緣。"},{"english":"You shouldn't impose your philosophy of life on others, everyone has their own way of living.","chinese":"每個人都有自己的處世哲學，你不能強求別人怎樣。"},{"english":"We are firmly opposed to the policy of a Procrustean bed.","chinese":"我們堅決反對強求一致的政策。"},{"english":"The foundation was being importuned by fundraisers to contribute to new charities.","chinese":"募捐者正強求基金會爲慈善事業捐款。"}],"related":[{"definition":["to let nature take its course (idiom)"],"pinyin":["shun4 qi2 zi4 ran2"],"word":"順其自然"},{"definition":["to bother about\/to haggle\/to bicker\/to argue\/plan\/stratagem"],"pinyin":["ji4 jiao4"],"word":"計較"},{"definition":["to delay\/to hold up\/to waste time\/to interfere with"],"pinyin":["dan1 wu5"],"word":"耽誤"},{"definition":["moreover\/besides\/in addition\/furthermore"],"pinyin":["kuang4 qie3"],"word":"況且"},{"definition":["to feel embarrassed or awkward\/to make things difficult (for someone)\/to find things difficult (to do or manage)"],"pinyin":["wei2 nan2"],"word":"為難"},{"definition":["to release (tension)\/relief (from suspense)\/to dispel (usu. with negative, unable to forget)"],"pinyin":["shi4 huai2"],"word":"釋懷"},{"definition":["easily\/lightly\/rashly"],"pinyin":["qing1 yi4"],"word":"輕易"},{"definition":["to take seriously\/serious\/No joking, really!"],"pinyin":["dang4 zhen1"],"word":"當真"},{"definition":["to yield\/to adapt to\/to accommodate to (sth)"],"pinyin":["qian1 jiu4"],"word":"遷就"},{"definition":["to get the desired outcome\/to win favor by fawning on sb\/to curry favor with\/a fruitful outcome to reward one's labor"],"pinyin":["tao3 hao3"],"word":"討好"},{"definition":["excessively\/too"],"pinyin":["tai4 guo4"],"word":"太過"},{"definition":["fate or chance that brings people together\/predestined affinity or relationship\/(Budd.) destiny"],"pinyin":["yuan2 fen4"],"word":"緣分"},{"definition":["should not\/to owe nothing"],"pinyin":["bu4 gai1"],"word":"不該"},{"definition":["to follow one's heart's desires\/to do as one pleases (idiom)"],"pinyin":["sui2 xin1 suo3 yu4"],"word":"隨心所欲"},{"definition":["to compromise\/to reach terms\/a compromise"],"pinyin":["tuo3 xie2"],"word":"妥協"},{"definition":["(reduplicated) whether... or...\/never mind\/fine (indicating acceptance or resignation)"],"pinyin":["ye3 ba4"],"word":"也罷"}]}