{"definition":["to rebound"],"pinyin":["tan2 hui2"],"simplified":["弹回"],"rank":34673.0,"normalized_rank":0.4851202552012648,"fraction":6.2405435483476e-7,"cumulative_fraction":0.9938479479430796,"word":"彈回","characters":[{"definition":["crossball\/bullet\/shot\/shell\/ball","to pluck (a string)\/to play (a string instrument)\/to spring or leap\/to shoot (e.g. with a catapult)\/(of cotton) to fluff or tease\/to flick\/to flip\/to accuse\/to impeach\/elastic (of materials)"],"pinyin":["dan4","tan2"],"word":"彈"},{"definition":["to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)"],"pinyin":["hui2"],"word":"回"}],"containing_words":[],"sentences":[{"english":"The ball will bound back when it is thrown on the pole.","chinese":"球拋在柱上會彈回來的。"},{"english":"But by the end the year, the weight usually returns.","chinese":"但是到了年底的時候，體重往往會彈回來。"},{"english":"Work is a rubber ball. If you drop it, it will bounce back.","chinese":"工作是一個橡膠球，你把它丟在地上，它還會彈回來。"},{"english":"The ball rebounded from the wall.","chinese":"球從牆壁上彈回。"},{"english":"Thus, when you hit a punching bag, it bounces right back at you.","chinese":"因此，當你擊吊袋時，它就朝着你彈回來。"},{"english":"The ball rebounded from the backboard.","chinese":"球從籃板上彈回來。"},{"english":"In the same way, when light falls on certain things it bounces back.","chinese":"同樣，光照到某些物體上時也會彈回來。"},{"english":"The stone ricocheted off the wall and hit passer-by .","chinese":"石頭擊中那面牆彈回打著了過路的人。"},{"english":"Loosen the pull rope can be automatically rebound baffle.","chinese":"鬆開拉繩擋板就可自動彈回。"},{"english":"The ball cannoned off a defender.","chinese":"球從一名防守隊員身上彈回。"},{"english":"The ball rebounded from the goalpost and Owen headed it in.","chinese":"球從門柱彈回，歐文頭球將球攻進。"},{"english":"The charge, exploded, and the knife, in springing back, closed into its owners wrist.","chinese":"槍響了，那把刀彈回去，正切着槍主的手腕。"},{"english":"The guard rebounded off the backboard.","chinese":"後衛搶到籃板彈回的球。"},{"english":"When I think about the bamboo tree's ability to bounce back or return to its original position.","chinese":"每當我想到竹子這種彈回去或者說恢復原狀的本領時。"},{"english":"The charge,exploded, and the knife, in springing back, closed into its owners wrist.","chinese":"槍響了，那把刀彈回去，正切着槍主的手腕。"},{"english":"The ball ricocheted on to the post and back into Walker's hands.","chinese":"皮球中柱彈回獲加手中。"}],"related":[]}