{"definition":["modulus of elasticity\/coefficient of restitution"],"pinyin":["tan2 xing4 mo2 liang4"],"simplified":["弹性模量"],"rank":64544.0,"normalized_rank":0.90305430022526,"fraction":1.7663292850293794e-8,"cumulative_fraction":0.9999458766051796,"word":"彈性模量","characters":[{"definition":["crossball\/bullet\/shot\/shell\/ball","to pluck (a string)\/to play (a string instrument)\/to spring or leap\/to shoot (e.g. with a catapult)\/(of cotton) to fluff or tease\/to flick\/to flip\/to accuse\/to impeach\/elastic (of materials)"],"pinyin":["dan4","tan2"],"word":"彈"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"},{"definition":["mold\/die\/matrix\/pattern","to imitate\/model\/norm\/pattern"],"pinyin":["mo2","mu2"],"word":"模"},{"definition":["capacity\/quantity\/amount\/to estimate\/abbr. for 量詞|量词[liang4 ci2], classifier (in Chinese grammar)\/measure word","to measure"],"pinyin":["liang2","liang4"],"word":"量"}],"containing_words":[],"sentences":[{"english":"The first order non-simple harmonic coefficient enhances modulus.","chinese":"第一非簡諧係數的存在使彈性模量增大。"},{"english":"In a case study on the practical engineering, the elastic modulus and Poisson′s ratio are obtained.","chinese":"結合實際工程，反演了拱壩基岩的彈性模量和泊松比。"},{"english":"For identical shapes, the stiffness is proportional to the modulus of elasticity.","chinese":"對於同樣外形的材料，剛度與彈性模量是成比例的。"},{"english":"Some numerical examples are also given by assuming an exponential gradient function.","chinese":"對彈性模量按指數函數梯度變化的算例進行了分析。"},{"english":"The ferrule effect is influenced by elastic modulus of post and core materials.","chinese":"箍效應受樁核材料彈性模量的影響。"},{"english":"As an application, the scaling exponents of elastic modulus and loss modulus are also obtained.","chinese":"作爲應用，進而得到彈性模量和損耗模量的標度指數。"},{"english":"There is a parabola correlation between the MOE and vascular bundle proportion.","chinese":"抗彎彈性模量與維管束比量有較高的拋物線關係。"}],"related":[]}