{"definition":["a snap of the fingers (idiom); in an instant\/in a short moment\/in a flash\/in the twinkling of an eye"],"pinyin":["tan2 zhi3 zhi1 jian1"],"simplified":["弹指之间"],"rank":57912.0,"normalized_rank":0.8102640157821834,"fraction":5.6347363968705824e-8,"cumulative_fraction":0.9997128801091876,"word":"彈指之間","characters":[{"definition":["crossball\/bullet\/shot\/shell\/ball","to pluck (a string)\/to play (a string instrument)\/to spring or leap\/to shoot (e.g. with a catapult)\/(of cotton) to fluff or tease\/to flick\/to flip\/to accuse\/to impeach\/elastic (of materials)"],"pinyin":["dan4","tan2"],"word":"彈"},{"definition":["finger\/to point at or to\/to indicate or refer to\/to depend on\/to count on\/(of hair) to stand on end"],"pinyin":["zhi3"],"word":"指"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms","gap\/to separate\/to thin out (seedlings)\/to sow discontent"],"pinyin":["jian1","jian4"],"word":"間"}],"containing_words":[],"sentences":[{"english":"Today the business environment is more petitive and fast-changing than ever.","chinese":"現今的商業環境，競爭愈發劇烈，變革彈指之間。"},{"english":"And your music is right at your fingertips.","chinese":"你的音樂就在彈指之間。"},{"english":"The flight of time, in a short moment, everything into the distant past.","chinese":"光陰似箭，彈指之間，一切都化爲遙遠的往昔。"},{"english":"I face difficulties at your fingertips when you retrieve it necessary to calm.","chinese":"在彈指之間找回我面對困境時那必要的冷靜。"},{"english":"Can be their own need to steal cards in the in a short moment.","chinese":"可以將自己所需要的牌在彈指之間偷過來。"}],"related":[{"definition":["lit. to return the jade annulus to Zhao (idiom); fig. to return something intact to its rightful owner"],"pinyin":["wan2 bi4 gui1 Zhao4"],"word":"完璧歸趙"},{"definition":["lit. so loud that even the deaf can hear (idiom); rousing even the apathetic"],"pinyin":["zhen4 long2 fa1 kui4"],"word":"振聾發聵"},{"definition":["lit. to sleep on brushwood and taste gall (like King Gou Jian of Yue 勾踐|勾践[Gou1 Jian4]), in order to recall one's humiliations) (idiom)\/fig. to maintain one's resolve for revenge"],"pinyin":["wo4 xin1 chang2 dan3"],"word":"臥薪嘗膽"},{"definition":["seize every minute and second (idiom); not a minute to lose\/every moment counts"],"pinyin":["fen1 miao3 bi4 zheng1"],"word":"分秒必爭"},{"definition":["equestrianism\/horsemanship"],"pinyin":["qi2 shu4"],"word":"騎術"},{"definition":["lit. to use a dog's tail as a substitute for sable fur (idiom)\/fig. a worthless sequel to a masterpiece"],"pinyin":["gou3 wei3 xu4 diao1"],"word":"狗尾續貂"},{"definition":["words still ringing in one's ears (idiom)"],"pinyin":["yan2 you2 zai4 er3"],"word":"言猶在耳"},{"definition":["lit. to share the same bed with different dreams (idiom); ostensible partners with different agendas\/strange bedfellows\/marital dissension"],"pinyin":["tong2 chuang2 yi4 meng4"],"word":"同床異夢"},{"definition":["Iron Curtain (1945-1991) (in Taiwan, 鐵幕 was used to refer to both the Iron Curtain and the Bamboo Curtain)"],"pinyin":["Tie3 mu4"],"word":"鐵幕"},{"definition":["to run this way and that (idiom); to rush about busily\/to bustle about\/to hopscotch\/also 東跑西顛|东跑西颠[dong1 pao3 xi1 dian1]"],"pinyin":["dong1 ben1 xi1 zou3"],"word":"東奔西走"},{"definition":["(idiom) (of a good outcome) unanticipated\/serendipitous\/fortuitous"],"pinyin":["wu2 xin1 cha1 liu3"],"word":"無心插柳"},{"definition":["greed\/avarice\/rapacious\/avid"],"pinyin":["tan1 yu4"],"word":"貪慾"},{"definition":["video program"],"pinyin":["shi4 pin2 jie2 mu4"],"word":"視頻節目"},{"definition":["lit. to scratch the outside of the boot (idiom)\/fig. beside the point\/ineffectual"],"pinyin":["ge2 xue1 sao1 yang3"],"word":"隔靴搔癢"},{"definition":["benevolent heart and skillful execution (idiom, from Mencius); charitable in thought and deed"],"pinyin":["ren2 xin1 ren2 shu4"],"word":"仁心仁術"},{"definition":["all black, no daylight (idiom); a world without justice"],"pinyin":["an4 wu2 tian1 ri4"],"word":"暗無天日"}]}