{"definition":["to cause a wound to close up and heal"],"pinyin":["mi2 he2"],"simplified":["弥合"],"rank":26509.0,"normalized_rank":0.3708953031214585,"fraction":0.0000012916100424743758,"cumulative_fraction":0.9863788444249394,"word":"彌合","characters":[{"definition":["full\/to fill\/completely\/more"],"pinyin":["mi2"],"word":"彌"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"}],"containing_words":[],"sentences":[{"english":"Lastly a rolling ball technique was used to remedy the crack and gap in the lung boundary.","chinese":"最後通過滾球法彌合肺邊緣的裂縫及缺口。"},{"english":"Translating Mamma Mia! into Mandarin is meant to start the long process of bridging that gap.","chinese":"將媽媽咪呀翻譯成中文就是爲了開始彌合這種隔閡。"},{"english":"What solution can be used to fill in the gaps?","chinese":"可以使用什麼解決方案來彌合這些差距？"},{"english":"Regrowth on those caught in Rain of Fire - Barkskin if you get it.","chinese":"用彌合療治中了火焰之雨的人，要是你中了就用樹皮。"},{"english":"What can leaders do to bridge the knowledge gap between themselves and their employees?","chinese":"身爲領袖，應當怎樣彌合自身和員工之間的知識差距？"},{"english":"Closing the gap in a generation - how?","chinese":"如何用一代人時間彌合差距？"},{"english":"After quarrelling, the young couple did their best to make it up.","chinese":"吵過架以後，這對年青夫婦便盡力彌合，言歸於好。"},{"english":"Still, Scheer said, there was a digital divide in Germany that needed to be bridged.","chinese":"他還說，目前德國社會存在一個需要彌合的數碼代溝。"},{"english":"Shifts in the Culture of a Constitution—Closing the Gap and Re-drawing the Map.","chinese":"憲法的文化變遷彌合差距，重新定位。"},{"english":"Amongst the impersonality of the internet, this is a way of bridging the cyber gap.","chinese":"其中客觀的因特網，這是一種彌合數碼鴻溝。"},{"english":"Both camps need to find a transitional figure who can bridge their differences.","chinese":"兩個陣營需要找出一個可以彌合分歧的過渡性人物。"},{"english":"But two people's feelings but one-the rule unceasingly.","chinese":"可是二人的感情卻不斷無法彌合。"},{"english":"Both parents and teenagers must try to bridge the generation gap between them.","chinese":"父母和青少年雙方必須盡力彌合代溝。"},{"english":"Filling the gap between model and reality may need something besides this.","chinese":"彌合模型和事實之間的差距光靠這些視乎不夠。"},{"english":"But you expect us to bridge those differences.","chinese":"但大家都期待我們彌合這些分歧。"}],"related":[]}