{"definition":["manner\/bearing\/trace\/mark\/trail\/etiquette"],"pinyin":["xing2 ji4"],"simplified":["形迹"],"rank":38920.0,"normalized_rank":0.5445412953143145,"fraction":4.256707599293942e-7,"cumulative_fraction":0.9960519066212074,"word":"形跡","characters":[{"definition":["to appear\/to look\/form\/shape"],"pinyin":["xing2"],"word":"形"},{"definition":["footprint\/mark\/trace\/vestige\/sign\/indication\/Taiwan pr. [ji1]"],"pinyin":["ji4"],"word":"跡"}],"containing_words":[],"sentences":[{"english":"Two suspicious-looking fellows were seen hanging around the campus .","chinese":"昨夜有人看見兩個形跡可疑的人在校園徘徊。"},{"english":"That man looks suspicious; keep an eye on him.","chinese":"那人形跡可疑，注意他。"},{"english":"Had they no apprehension of any thing before the elopement took place?","chinese":"他們倆私奔之前，難道看不出一點形跡可疑的地方嗎？"},{"english":"She often mouths off to the wrong person, or follows someone who looks shady.","chinese":"她總是對不該發火的人發火，還老跟蹤形跡可疑的人。"},{"english":"Thee suspicious-looking man drove up to the border, where he was greeted by a sentry.","chinese":"一個形跡可疑的人開車來到邊境，哨兵迎了上去。"},{"english":"Videos from a camera lowered into the coal mine showed no signs of the missing men.","chinese":"礦井調查獲取的錄像顯示不出任何失蹤礦工的形跡。"},{"english":"Some suspicious-looking men were loitering about near the house.","chinese":"有幾個形跡可疑的人在屋子附近盪來盪去。"},{"english":"Then one night, the suspicious-looking fellow happened to stop by for a drink.","chinese":"有天晚上，那個形跡可疑的人碰巧到哪裏喝酒。"},{"english":"Two suspicious-looking fellows were seen hanging around the campus last night.","chinese":"昨夜有人看見兩個形跡可疑的人在校園裏逡巡。"},{"english":"1The suspicious-looking man drove up to the border, where he was greeted by a sentry.","chinese":"1一個形跡可疑的人開車來到邊境，哨兵迎了上去。"},{"english":"There's a suspicious-looking man outside the house; I've had my eye on him for some time.","chinese":"門外有個形跡可疑的人，我已注意他好一會兒了。"},{"english":"The suspicious-looking man drove up to the border, where he was greeted by a sentry.","chinese":"一個形跡可疑的人開車來到邊境，哨兵迎了上去。"},{"english":"It was the spy's suspicious manner that first put us on to him.","chinese":"最初引起我們警惕的是這個間諜可疑的形跡。"},{"english":"She looked around this way and that in a dubious manner.","chinese":"她在路上東張西望的，形跡十分可疑。"},{"english":"Two suspicious-looking fellows were seen hanging around the campus last night.","chinese":"昨夜有人看見兩個形跡可疑的人在校園裏徘徊。"},{"english":"Geologic evidence shows that most faults have had repeated movement on them.","chinese":"地質形跡表明，大多數斷層有反覆運動。"}],"related":[]}