{"definition":["to seem\/as if\/alike\/similar"],"pinyin":["fang3 fu2"],"simplified":["仿佛"],"rank":4381.0,"normalized_rank":0.0612958739663929,"fraction":0.0000293651513748,"cumulative_fraction":0.8425540499129721,"word":"彷彿","characters":[{"definition":["irresolute","seemingly"],"pinyin":["fang3","pang2"],"word":"彷"},{"definition":["seemingly"],"pinyin":["fu2"],"word":"彿"}],"containing_words":[],"sentences":[{"english":"Ten nets are exquisite and regular, seemlingly having gained mercy of gods.","chinese":"網織的精巧而規矩，八卦形的張開，彷彿得到神主。"},{"english":"Depend on intuition and experience, he ases if the key that found baseball of the gold dollar that defeat solution.","chinese":"憑藉直覺和經驗，他彷彿找到了破解金元棒球的鑰匙。"},{"english":"Aloft in the air, as if from the depths of the cloud, came a confused and doubtful sound of voices.","chinese":"高空中，彷彿自雲團深處，傳來一片可疑的嘈雜人聲。"},{"english":"It seems that tourists begin a time and space travel and enter another world from there.","chinese":"遊人彷彿進入時空旅行一般，進入另一個世界。"},{"english":"The same thought came to me while trying out the upscale Italian restaurant Casa Mosaico.","chinese":"來到卡薩馬可意大利餐廳，心境彷彿又回到過去。"},{"english":"Softly press to wear make-up, as the closest comfort from the lover.","chinese":"以輕壓方式上妝，彷彿戀人最親密的愛撫。"},{"english":"It was as if the Night sang dirges with clenched teeth.","chinese":"那彷彿是夜神正在那兒咬牙切齒地唱輓歌。"},{"english":"Her delicate face flushed pink, her lips pouted softly, as if she were going to cry.","chinese":"她的臉激動的發紅，輕輕地撅着嘴，彷彿要哭似的。"},{"english":"He uttered the word indifferently, and as though his mind were on something else.","chinese":"他隨口說了這句話，彷彿他還在想着旁的事。"},{"english":"It's seems this part of the ancient text was indexical in nature!","chinese":"看彷彿這個段子的那古代的原文一次有了索引的種類。"},{"english":"Natasha looked with her big, wide eyes at Sonya as though not understanding her question.","chinese":"娜塔莎瞪大眼睛望着索尼婭，彷彿不明白她在問什麼。"},{"english":"As if unsure of where he is, she hesitated and looked around.","chinese":"她彷彿茫然不知聲身在何處，猶豫地向四周打量。"},{"english":"In this year, what my mind-mirror was my new life.","chinese":"在這一年裏，我的心鏡照出來的彷彿是我的新生。"},{"english":"Nevertheless, all these can be make one feel gentle and kind but not bustling.","chinese":"但是這樣也會給人一種溫吞的感覺，彷彿不夠熱烈。"},{"english":"Sad feeling like what's missing, sour, as if the lack of soul.","chinese":"心痛的感覺就像少了什麼，酸酸的，彷彿缺了靈魂。"},{"english":"He thought that he already distinctly perceived the brink of the bottomless abyss.","chinese":"他彷彿已清清楚楚地望見那無底深淵邊上的陡壁。"}],"related":[{"definition":["variant of 仿似[fang3 si4]"],"pinyin":["fang3 si4"],"word":"彷似"},{"definition":["like\/similar to\/as if"],"pinyin":["fang3 ru2"],"word":"仿如"},{"definition":["seemingly"],"pinyin":["fu2"],"word":"彿"},{"definition":["an instant (Sanskrit: ksana)\/split second\/the twinkling of an eye"],"pinyin":["cha4 na4"],"word":"剎那"},{"definition":["variant of 彌漫|弥漫[mi2 man4]"],"pinyin":["mi2 man4"],"word":"瀰漫"},{"definition":["to catch and hold on\/to continue\/to go on to do sth\/to follow\/to carry on\/then\/after that\/subsequently\/to proceed\/to ensue\/in turn\/in one's turn"],"pinyin":["jie1 zhe5"],"word":"接著"},{"definition":["the rear\/far behind the front line"],"pinyin":["hou4 fang1"],"word":"後方"},{"definition":["wall"],"pinyin":["qiang2 bi4"],"word":"牆壁"},{"definition":["silvery light\/bright white light\/shining white light"],"pinyin":["yin2 guang1"],"word":"銀光"},{"definition":["shout\/rallying cry\/cheering\/to shout"],"pinyin":["na4 han3"],"word":"吶喊"},{"definition":["to have one's eyes on (a goal)\/having sth in mind\/to concentrate"],"pinyin":["zhuo2 yan3"],"word":"著眼"},{"definition":["leisurely\/carefree\/relaxed"],"pinyin":["you1 xian2"],"word":"悠閒"},{"definition":["to have\/to possess"],"pinyin":["you3 zhe5"],"word":"有著"},{"definition":["barrier"],"pinyin":["lan2 zha4"],"word":"欄柵"},{"definition":["Sicily"],"pinyin":["Xi1 xi1 li3 Dao3"],"word":"西西里島"},{"definition":["lit. heads rubbing together (idiom)\/fig. very close relationship"],"pinyin":["er3 bin4 si1 mo2"],"word":"耳鬢廝磨"}]}