{"definition":["back\/rear\/behind"],"pinyin":["hou4 bian5"],"simplified":["后边"],"rank":17792.0,"normalized_rank":0.2489331635722581,"fraction":0.000002998964366251534,"cumulative_fraction":0.9689049210510886,"word":"後邊","characters":[{"definition":["back\/behind\/rear\/afterwards\/after\/later\/post-"],"pinyin":["hou4"],"word":"後"},{"definition":["side\/edge\/margin\/border\/boundary\/CL:個|个[ge4]\/simultaneously","suffix of a noun of locality"],"pinyin":["bian1","bian5"],"word":"邊"}],"containing_words":[{"definition":["erhua variant of 後邊|后边[hou4 bian5]"],"pinyin":["hou4 bian5 'r"],"word":"後邊兒"}],"sentences":[{"english":"At the centre of this wing is the famous balcony, with the Centre Room behind its glass doors.","chinese":"這個翼的中心是著名的樓廳，中央廳則在玻璃門後邊。"},{"english":"He and Wray were crouched behind a hedgerow.","chinese":"他與沃伊中尉蹲伏在一道樹籬後邊。"},{"english":"She met Oberon attended by his train of fairy courtiers.","chinese":"她遇見奧布朗，後邊還跟着仙宮的侍臣。"},{"english":"I crawled down between the gondola and the shelter of the high freight-car behind.","chinese":"我爬到“平底船”和後邊一節高高的貨車的車檐間。"},{"english":"You should use two spaces after a sentence-ending period.","chinese":"應該在句尾的句號後邊加上兩個空格。"},{"english":"I should say is in behind, and listen to come.","chinese":"我要說的重點在後邊，且聽道來。"},{"english":"I sit behind Lin Tao in the class.","chinese":"正在班上，我坐正在洪濤後邊。"},{"english":"It’s getting late, so we decide to head back to the hotel, which sits behind the barricade.","chinese":"天色已晚，我們決定迴路障後邊的旅館。"},{"english":"With woman steps she followed: the ruffian and his strolling mort .","chinese":"她邁着女性的步子跟在後邊，惡棍和共闖江湖的姘頭。"},{"english":"“It was good to see Robin, ” I continued from the back.","chinese":"“看到了羅賓真好，”我坐在後邊繼續說。"},{"english":"And on the playground behind the building, only the wind plays on the swing.","chinese":"在公寓樓後邊的遊戲場上，玩鞦韆的只有一陣陣的風。"},{"english":"I rounded the hut and saw a man's dead body sprawling in the mud.","chinese":"我繞到竹屋的後邊，看到一個男人的屍體躺在泥中。"},{"english":"Do not stand behind rig tongs while they are in use.","chinese":"上卸扣時，不能站在大鉗的後邊。"},{"english":"Let's try knocking at the back door.","chinese":"咱們敲敲後邊的門試試。"},{"english":"He’ll keep you steady by holding your hips firmly, as he thrusts from behind.","chinese":"他則牢牢托住你的臀部以讓你穩定，而從後邊進入。"},{"english":"The web is in a corner behind the toilet, connecting tile wall to tile wall.","chinese":"網是結在洗手間後邊的一個角落上，在瓷磚之間連着。"}],"related":[]}