{"definition":["directly"],"pinyin":["jing4 zhi2"],"simplified":["径直"],"rank":15028.0,"normalized_rank":0.21026121752270088,"fraction":0.0000041349622584910905,"cumulative_fraction":0.9591488740774148,"word":"徑直","characters":[{"definition":["footpath\/track\/diameter\/straight\/directly"],"pinyin":["jing4"],"word":"徑"},{"definition":["straight\/to straighten\/fair and reasonable\/frank\/straightforward\/(indicates continuing motion or action)\/vertical\/vertical downward stroke in Chinese characters","surname Zhi\/Zhi (c. 2000 BC), fifth of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God"],"pinyin":["Zhi2","zhi2"],"word":"直"}],"containing_words":[],"sentences":[{"english":"When I arrived in Yarmouth , I went straight to Barkis's house.","chinese":"到達雅茅斯後，我徑直來到了巴克斯家。"},{"english":"Disasters may come straight to you , but happiness often comes in disguise.","chinese":"災難可能是徑直走到面前，可是幸福總是化妝潛來。"},{"english":"The man ran toward the emperor before falling unconscious to the ground, where he lay groaning.","chinese":"他徑直向皇帝跑來，但終於不省人事跌倒了。"},{"english":"One must brush everything aside and go straight to the real problem.","chinese":"他必須掃開一切，徑直走向真正的問題。"},{"english":"Whatever the re might be, \" said Jukes, \"we are steaming straight into it\".","chinese":"“不管是什麼，”朱克斯說，我們都要徑直行駛進去。"},{"english":"Leaf Xiao didn't answer, but the path goes straight into a sound to be like a store.","chinese":"葉蕭並沒有回答，而是徑直走進音像店。"},{"english":"So she took the twelve shirts and went forth, and straight into the great forest.","chinese":"於是，她帶上那十二件襯衣，徑直向森林走去。"},{"english":"She rode up bold as you please, m'lord, demanding words with you.","chinese":"她膽大包天的徑直騎了過來，大人，要求和你說話。"},{"english":"Celia looked down directly at the two executive rows.","chinese":"西莉亞雙眼徑直望着坐在前兩排的顯要人物。"},{"english":"Lily ignored them and went up to Severus.","chinese":"莉莉沒理他們，徑直朝西弗勒斯走去。"},{"english":"I went straight home with my daughter and we ordered a curry.","chinese":"我和女兒徑直回家，點了一份咖喱粉。"},{"english":"Orpheus froze in place, but he didn't turn around.","chinese":"俄耳甫斯徑直就僵在了那裏，但他並沒有迴轉身。"},{"english":"I felt now or never and went right up to him.","chinese":"我感覺到機不可失，所以徑直走到他面前。"},{"english":"There is a huge living room and three bedrooms.","chinese":"請徑直往前走，那是一個大客廳和三個臥室。"},{"english":"Tang Mingxuan in the hotel lobby to see Jie Tianjun and Ke Yuan, walked straight past.","chinese":"唐明軒在酒店大廳看到解天鈞和柯媛，徑直走了過去。"},{"english":"After this nice intermezzo we drive in one go all the way to Shigatze.","chinese":"在這美妙的小插曲之後，我們徑直開往日喀則。"}],"related":[]}