{"definition":["route\/path"],"pinyin":["jing4 lu4"],"simplified":["径路"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"徑路","characters":[{"definition":["footpath\/track\/diameter\/straight\/directly"],"pinyin":["jing4"],"word":"徑"},{"definition":["road\/CL:條|条[tiao2]\/journey\/route\/line (bus etc)\/sort\/kind","surname Lu"],"pinyin":["Lu4","lu4"],"word":"路"}],"containing_words":[],"sentences":[{"english":"Objective To investigate the skin incision of the median sternotomy.","chinese":"目的探索胸骨正中劈開徑路理想的皮膚切口。"},{"english":"Objective To analysis the reduction route and fixation method of zygomatic fracture in the early stage.","chinese":"目的分析顴骨顴弓骨折早期手術復位徑路和固定方法。"},{"english":"Objective To evaluate the approaches and surgical technique for resection of the lesions occupying different parts of the caudate lobe of the liver.","chinese":"目的探討不同類型肝尾葉腫瘤手術切除的徑路和方式。"},{"english":"Surgical approach depends on the status and situation of injury.","chinese":"手術徑路主視胸腹合併傷情況選擇。"},{"english":"Conclusion ATP test has a higher value for diagnosing DAVNP.","chinese":"結論三磷酸腺苷試驗診斷房室結雙徑路有較高的價值。"},{"english":"Objective To investigate the surgical approaches of the embedded supernumerary teeth in maxilla .","chinese":"目的探討上頜前部骨內埋伏多生牙的手術徑路。"},{"english":"Objective To analyze the significance of the modified approach by per-isthmus incision for thyroidectomy.","chinese":"目的探討經峽部徑路行甲狀腺手術的臨牀應用。"},{"english":"Objective To explore the significance of electrocardiogram monitoring during the effective application of radiofrequency energy to slow atrioventricular (AV) nodal pathway ablation.","chinese":"探討房室結慢徑路消融有效放電過程心電監測的意義。"},{"english":"As a most often phenomenon of meridian, the phenomenon of perceptual extension is an abnormal sensation, its mechanism is unknown.","chinese":"是一種循徑路走行的異常感覺，機制正在探索中。"},{"english":"The median sternal incision was a better approach for the proximal injury of carotid and innominate arteries.","chinese":"頸動脈或無名動脈起始部損傷以胸骨正中徑路顯露佳。"},{"english":"The path model moderately fitted the observed data.","chinese":"本研究所建立的徑路模式適配度尚稱理想。"},{"english":"The route of virus movement from nose to brain was not determined .","chinese":"病毒由鼻移行至腦的徑路尚未確定。"},{"english":"How to Treat the Complications of Transradial Access?","chinese":"如何處理橈動脈徑路併發症？"},{"english":"Methods To treat 56 patients with hemifacial spasm by combing and partially ligating the facial nerve roots through a retrosigmoid approach.","chinese":"方法乙狀竇後徑路面神經根梳理並部分結紮。"}],"related":[{"definition":["the five impurities (Buddhism)"],"pinyin":["wu3 zhuo2"],"word":"五濁"},{"definition":["to grow old with unfailing eyes and ears (idiom)"],"pinyin":["chang2 sheng1 jiu3 shi4"],"word":"長生久視"},{"definition":["to surprise"],"pinyin":["jing1 bu4"],"word":"驚怖"},{"definition":["Nāgārjuna (c. 150-250 AD), Buddhist philosopher"],"pinyin":["Long2 shu4"],"word":"龍樹"},{"definition":["Liuying township in Tainan county 台南縣|台南县[Tai2 nan2 xian4], Taiwan"],"pinyin":["Liu3 ying2"],"word":"柳營"},{"definition":["to transmit Buddhist teaching\/chakram or chakka (throwing disk)"],"pinyin":["zhuan3 fa3 lun2"],"word":"轉法輪"},{"definition":["to collapse\/to topple\/to capsize"],"pinyin":["qing1 tui2"],"word":"傾頹"},{"definition":["extinct"],"pinyin":["yi3 mie4"],"word":"已滅"},{"definition":["upright\/straightforward"],"pinyin":["zhi4 zhi2"],"word":"質直"},{"definition":["three principles and five virtues (idiom)\/the three rules (ruler guides subject, father guides son and husband guides wife) and five constant virtues of Confucianism (benevolence 仁, righteousness 義|义, propriety 禮|礼, wisdom 智 and fidelity 信)"],"pinyin":["san1 gang1 wu3 chang2"],"word":"三綱五常"},{"definition":["work or plans left as a legacy\/the views of the departed\/posthumous orders or teachings"],"pinyin":["yi2 jiao4"],"word":"遺教"},{"definition":["see 呂洞賓|吕洞宾[Lu:3 Dong4 bin1]"],"pinyin":["Lu:3 Chun2 yang2"],"word":"呂純陽"},{"definition":["immortality"],"pinyin":["chang2 sheng1 bu4 si3"],"word":"長生不死"},{"definition":["treatment involving the use of tonics to restore the patient's health\/reinforcing method (in acupuncture)"],"pinyin":["bu3 fa3"],"word":"補法"},{"definition":["to praise\/to compliment"],"pinyin":["cheng1 yang2"],"word":"稱揚"},{"definition":["to demote\/to denounce"],"pinyin":["bian3 chi4"],"word":"貶斥"}]}