{"definition":["to get\/to obtain\/to receive"],"pinyin":["de2 dao4"],"simplified":["得到"],"rank":261.0,"normalized_rank":0.0036517286247953772,"fraction":0.000468001644122071,"cumulative_fraction":0.4246438852764731,"word":"得到","characters":[{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"}],"containing_words":[{"definition":["available"],"pinyin":["ke3 de2 dao4"],"word":"可得到"}],"sentences":[{"english":"RS_Halion_Phase2. wav - You will find only suffering within the realm of Twilight.","chinese":"在暮光的勢力範圍，你得到的只有痛苦。"},{"english":"At the end of the term, you typically get no cash back.","chinese":"固定年限到期後，你一般不會得到任何現金返還。"},{"english":"Closed laser intensity Langevin equation is got.","chinese":"得到封閉的光強朗之萬方程。"},{"english":"The verification and measurement plan of checking fixture dimension should be confirmed by YFV engineer.","chinese":"檢具的尺寸驗證測量計劃需得到延鋒工程師的確認。"},{"english":"Ten nets are exquisite and regular, seemlingly having gained mercy of gods.","chinese":"網織的精巧而規矩，八卦形的張開，彷彿得到神主。"},{"english":"The cases have been laboratory confirmed by the Institut Pasteur, Dakar.","chinese":"這些病例已得到達喀爾巴斯德研究所的實驗室確認。"},{"english":"No junketing activity would be conducted on official expenses without permission of the company.","chinese":"在未得到公司授權情況下，不得以公費進行宴請活動。"},{"english":"You can get the norwalk virus from hand to mouth activity or from contaminated food.","chinese":"你可以得到手諾瓦克病毒污染的食物或活動口。"},{"english":"So, that is how we got the diffusion equation.","chinese":"這就是得到擴散方程的過程。"},{"english":"The copolymer was wet spun to get flame-retardant fiber.","chinese":"將共聚物通過溼法紡絲，得到了阻燃纖維。"},{"english":"I always get a negative response.","chinese":"我向來都得到否定的回答。"},{"english":"I think it depends what they're offered, ' said Lupin .","chinese":"“我想這取決於他們會得到什麼好處，”盧平說。"},{"english":"After making some simplifying assumptions, this paper obtains the fatigue life of steel towers.","chinese":"在作了一些簡化假設後，得到了鋼塔架疲勞壽命。"},{"english":"How do almond-flavored liqueurs derive their flavor?","chinese":"杏味甜酒是怎樣得到這種味道的？"},{"english":"And I heard it helps to have funding in advance too.","chinese":"而且我聽說這也有助於提前得到資助。"},{"english":"Those opinions and propositions were agreed upon and echoed by many participating leaders.","chinese":"這些觀點和主張得到許多與會領導人的贊同和呼應。"}],"related":[{"definition":["to obtain\/to receive\/to get"],"pinyin":["huo4 de2"],"word":"獲得"},{"definition":["to receive (praise, an education, punishment etc)\/to be ...ed (praised, educated, punished etc)"],"pinyin":["shou4 dao4"],"word":"受到"},{"definition":["aim\/clear","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","really and truly","see 的士[di1 shi4]"],"pinyin":["de5","di1","di2","di4"],"word":"的"},{"definition":["to approve\/approval\/acknowledgment\/OK"],"pinyin":["ren4 ke3"],"word":"認可"},{"definition":["to win\/to gain"],"pinyin":["ying2 de2"],"word":"贏得"},{"definition":["to be capable of\/to be able to\/can"],"pinyin":["neng2 gou4"],"word":"能夠"},{"definition":["to contribute\/to dedicate\/to devote\/contribution\/CL:個|个[ge4]"],"pinyin":["gong4 xian4"],"word":"貢獻"},{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["to accord\/to give\/to show (respect)"],"pinyin":["ji3 yu3"],"word":"給予"},{"definition":["also\/too\/(in Classical Chinese) final particle implying affirmation","surname Ye"],"pinyin":["Ye3","ye3"],"word":"也"},{"definition":["variant of 收穫|收获[shou1 huo4]"],"pinyin":["shou1 huo4"],"word":"收獲"},{"definition":["to acquire\/to get\/to obtain"],"pinyin":["qu3 de2"],"word":"取得"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["able to\/so that sb can\/enabling\/in order to\/finally in a position to\/with sth in view"],"pinyin":["de2 yi3"],"word":"得以"},{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"},{"definition":["however\/yet\/but"],"pinyin":["ran2 er2"],"word":"然而"}]}