{"definition":["to find out\/to know\/to learn about"],"pinyin":["de2 zhi1"],"simplified":["得知"],"rank":2124.0,"normalized_rank":0.029717515705231345,"fraction":0.00007133503289624727,"cumulative_fraction":0.7396443056562734,"word":"得知","characters":[{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["to know\/to be aware"],"pinyin":["zhi1"],"word":"知"}],"containing_words":[],"sentences":[{"english":"She was thunderstruck to hear the news.","chinese":"得知消息時她大感驚訝。"},{"english":"It did my heart good to hear about your promotion to Vice President of the agency.","chinese":"得知你提升爲經銷處副總經理，我心裏特別高興。"},{"english":"An internal member leaked information, so I got to know the truth.","chinese":"內部人員的露風，我得知了事情的真相。"},{"english":"Told that his mother was ill, Li Lei hurried home quickly.","chinese":"李蕾得知母親生病了時，馬上趕回了家。"},{"english":"Peng, learned about the one from the other end failure.","chinese":"蓬勒從電話那頭得知這次某殺失敗。"},{"english":"That's according to copies of search warrants released today.","chinese":"這是根據今天公佈的搜查證的副本文件所得知的。"},{"english":"Xu master know that very angry after the second day go to teach them.","chinese":"徐老爺得知後很生氣欲第二天去去教訓他們。"},{"english":"When he heard the news, he was quite freaked out.","chinese":"當他得知這一消息時，他真是急壞了。"},{"english":"Zhang Yimei learned that the eighth route army, the next step in meter.","chinese":"張怡梅得知八路軍的下一步計劃，計上心頭。"},{"english":"It was Michael, and I quickly learned he was always like that.","chinese":"這就是邁克爾，我很快就得知他一貫如此。"},{"english":"They heard this morning that they had passed the examination, so they went out to paint the town red.","chinese":"今天上午他們得知考試及格，於是都出去狂歡一場。"},{"english":"Yang Ming learned that the story of the blue Ling, he began to sympathize with the blue ling.","chinese":"楊明得知藍凌的身世，他開始同情起藍凌。"},{"english":"Tamson leaves when word reaches him of the prince's arrival.","chinese":"塔姆森在得知王子到來後就離開了。"},{"english":"It will take further testing to find out what kind of animal bones are in the broth.","chinese":"至於這是一碗什麼動物的湯還要進一步化驗纔會得知。"},{"english":"How can people know the contact information of each survey?","chinese":"巿民大衆如何得知每次民意調查的樣本資料？"},{"english":"From the results obtained, it is evident that the crystalline lens has birefringence.","chinese":"從實驗結果得知牛眼晶狀體具有雙折射的性能。"}],"related":[{"definition":["to learn of (an event)\/to hear about (sth)"],"pinyin":["huo4 zhi1"],"word":"獲知"},{"definition":["to inquire"],"pinyin":["xun2 wen4"],"word":"詢問"},{"definition":["to ask about\/to make some inquiries\/to ask around"],"pinyin":["da3 ting5"],"word":"打聽"},{"definition":["to press charges\/to file a complaint","to tell\/to inform\/to let know"],"pinyin":["gao4 su4","gao4 su5"],"word":"告訴"},{"definition":["to hear (sth said)\/one hears (that)\/hearsay\/listening and speaking"],"pinyin":["ting1 shuo1"],"word":"聽說"},{"definition":["to receive news (of)"],"pinyin":["wen2 xun4"],"word":"聞訊"},{"definition":["to inform"],"pinyin":["gao4 zhi1"],"word":"告知"},{"definition":["to hurry (to some place)"],"pinyin":["gan3 dao4"],"word":"趕到"},{"definition":["after the event\/in hindsight\/in retrospect"],"pinyin":["shi4 hou4"],"word":"事後"},{"definition":["to know\/to become aware of\/also pr. [zhi1 dao5]"],"pinyin":["zhi1 dao4"],"word":"知道"},{"definition":["to see"],"pinyin":["jian4 dao4"],"word":"見到"},{"definition":["original\/former\/originally\/formerly\/at first\/so, actually, as it turns out"],"pinyin":["yuan2 lai2"],"word":"原來"},{"definition":["news\/information\/CL:條|条[tiao2]"],"pinyin":["xiao1 xi5"],"word":"消息"},{"definition":["to know\/to understand"],"pinyin":["zhi1 xiao3"],"word":"知曉"},{"definition":["to hurry to (somewhere)"],"pinyin":["gan3 wang3"],"word":"趕往"},{"definition":["to find\/to discover"],"pinyin":["fa1 xian4"],"word":"發現"}]}