{"definition":["from within\/therefrom"],"pinyin":["cong2 zhong1"],"simplified":["从中"],"rank":3926.0,"normalized_rank":0.054929833643473765,"fraction":0.00003402008594017329,"cumulative_fraction":0.8281615802347169,"word":"從中","characters":[{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"},{"definition":["China\/Chinese\/surname Zhong","to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right"],"pinyin":["Zhong1","zhong1","zhong4"],"word":"中"}],"containing_words":[],"sentences":[{"english":"But learn from them. They scale and serve millions of users.","chinese":"而是從中學習，他們服務於數以百萬的用戶。"},{"english":"Just keep looking at this progress of losing and regaining awareness and learn from it.","chinese":"只要保持觀照這個覺知失而復得的過程，並從中學習。"},{"english":"This is a great good deed. The people involved can all benefit from it.","chinese":"這是件大好事，只要是參與的人都可以從中獲益。"},{"english":"No wonder we feel sick at the thought of choosing just one.","chinese":"要從中選一種三明治，難怪會讓人覺得頭疼。"},{"english":"Today's Yang Lin's first day back from China.","chinese":"今天楊琳從中國回來，第一天上班。"},{"english":"Have you seen a tree where a car can drive through it?","chinese":"你看過一種樹可以讓汽車從中間穿過嗎？"},{"english":"Vicky: graduated from the Department of Administration in Chung I Hsing University.","chinese":"我從中興大學的行政管理學系畢業。"},{"english":"But we have learned from these efforts.","chinese":"但是，我們從中吸取了教訓。"},{"english":"I know that I get around 90g of protein from that.","chinese":"我知道我會從中得到90克左右的蛋白質。"},{"english":"That was transported by and dropped from an iceberg.","chinese":"系由冰山搬運而來並從中墜下的。"},{"english":"From them we can see obviously what the compiler is emphasizing.","chinese":"從中明顯可以看出訴述主體的失重態勢。"},{"english":"Most children do, from the time they go to secondary school.","chinese":"我相信大部分孩子從中學起就經常會獨自出門。"},{"english":"“From high school, ” I add.","chinese":"“從中學時起，”我又說。"},{"english":"Work with the best of intentions and gain your self respect from that.","chinese":"帶着最好的意圖工作並從中獲得你的自我尊重吧。"},{"english":"Woher kommt Herr Wang? Er kommt aus China.","chinese":"王先生從哪兒來的？他從中國來。"},{"english":"Our galaxy's core is a frenzied place, and identifying baby stars there has been difficult.","chinese":"銀心是一個混亂的區域，從中辨識出早期恆星很難。"}],"related":[]}