{"definition":["have never\/has never"],"pinyin":["cong2 lai2 mei2"],"simplified":["从来没"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"從來沒","characters":[{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["(negative prefix for verbs)\/have not\/not","drowned\/to end\/to die\/to inundate"],"pinyin":["mei2","mo4"],"word":"沒"}],"containing_words":[{"definition":["have never\/never before"],"pinyin":["cong2 lai2 mei2 you3"],"word":"從來沒有"}],"sentences":[{"english":"I have never eaten it, even heard it.","chinese":"我從來沒喫過它甚至連聽都沒聽說過。"},{"english":"The executioner had never seen anything like this!","chinese":"劊子手從來沒見過這種情形。"},{"english":"No one, he claimed, had ever seen such fans before.","chinese":"還聲稱，從來沒人見識過這樣的扇子。"},{"english":"I've never had alcohol before and was very excited.","chinese":"我之前從來沒沾過酒，所以很興奮。"},{"english":"Never having been to Switzerland before, he longs for a trip there.","chinese":"因爲從來沒去過瑞士，他期待一趟瑞士之旅。"},{"english":"Since then I have never sung by day.","chinese":"從那時開始，我就從來沒在白天唱過歌。"},{"english":"But I have never stolen from anyone else.","chinese":"不過我從來沒偷過其他人的東西。"},{"english":"Live in NYC and never been to the Statue of Liberty?","chinese":"居住在紐約市但是從來沒看過自由女神像？"},{"english":"The hatred between these two families never quite flickered out.","chinese":"這兩家人之間的仇恨從來沒真正消除。"},{"english":"Q. Why don't you see giraffes in elementary school?","chinese":"爲什麼你從來沒在小學看到過長頸鹿？"},{"english":"For 28 years, I've never come out with any picture at such standard.","chinese":"多少年來，我從來沒畫過如此水準的畫。"},{"english":"She never got caught but, once, the alarm went off.","chinese":"她從來沒被抓住過，不過有一次，警報響了。"},{"english":"Is it true that the costume never made it to Northern California?","chinese":"這件服裝從來沒去過北加州，是真的嗎？"},{"english":"I had never seen as much good food in my life, and I chowed down.","chinese":"我人生中從來沒見過這麼多好喫的東西，我吃了個飽。"},{"english":"I ve never heard such a rigmarole .","chinese":"我從來沒聽過像這樣的長篇廢話。"},{"english":"In short, the Father never denied his Son any request.","chinese":"總而言之，父神從來沒推卻祂兒子任何一個的祈求。"}],"related":[]}