{"definition":["whence?\/where from?"],"pinyin":["cong2 he2"],"simplified":["从何"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"從何","characters":[{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"},{"definition":["surname He","what\/how\/why\/which\/carry"],"pinyin":["He2","he2"],"word":"何"}],"containing_words":[{"definition":["It's a long and intricate story, I hardly know where to start."],"pinyin":["yi1 bu4 er4 shi2 si4 shi3 , bu4 zhi1 cong2 he2 shuo1 qi3"],"word":"一部二十四史，不知從何說起"}],"sentences":[{"english":"So point one, that’s what the Cross frees us from.","chinese":"因此，第一點就是“十字架將我們從何境地解放出來。"},{"english":"Set out to do something you don’t know how.","chinese":"列舉一些你不知道該從何做起的事情。"},{"english":"We do not know what led to the disaster nor who inflicted it.","chinese":"我們不知道災禍從何而起，也不知道肇事者是誰。"},{"english":"Well,how in the world could I know that?","chinese":"這我從何得知呢？"},{"english":"I was trying to find it but I did not know where I should look.","chinese":"我試圖自己找到這個銀行，但不知從何找起。"},{"english":"When I started Zen Habits, I had no idea how to start.","chinese":"當我開始學禪的時候，我完全不知從何開始。"},{"english":"And how, you might ask, do we know this?","chinese":"你可能會問，我們從何而知呢？"},{"english":"If you don't know where to start, seek help from someone who does.","chinese":"若你不知道從何開始，向那些有經驗的人尋求幫助吧。"},{"english":"I wanted to write down our story, but don't know what to start with.","chinese":"我想寫下我們的故事，但卻不知從何啓筆。"},{"english":"I have never traded FX and I do not know how to start.","chinese":"我從沒有外匯投資經驗，應該從何著手瞭解外匯？"},{"english":"Ask yourself, ? if you were founding a city, where would you begin?","chinese":"你們可以自問，如果你們創建一座城會從何開始？"},{"english":"Someone says, happiness is a feeling of love, tenderness and Si, considerate and caring.","chinese":"可如果愛人離你而去了呢，幸福又從何而去感覺？"},{"english":"I haven't been writing for a long time, so it's hard to decide where to start from.","chinese":"我已經有很長時間沒來寫了，所以很難決定從何談起。"},{"english":"The reform of enterprise of geology and exploration is one of the transformations of the state-owned enterprise.","chinese":"地勘單位改制是國企改革的一部分，從何着手？"},{"english":"Why such a frenzy of nostalgia?","chinese":"這場如癡如狂的懷舊思潮從何而起？"},{"english":"But I still don't know how to go about exporting to China.","chinese":"不過，我還是不太清楚從何入手向中國出口。"}],"related":[]}