{"definition":["never"],"pinyin":["cong2 lai2 bu4"],"simplified":["从来不"],"rank":8632.0,"normalized_rank":0.12077287926909462,"fraction":0.000010568926162430749,"cumulative_fraction":0.9168959410616184,"word":"從來不","characters":[{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"}],"containing_words":[],"sentences":[{"english":"We never made a purchase on credit.","chinese":"我們從來不賒購。"},{"english":"She was never flighty like you.","chinese":"她從來不像你這樣胡思亂想。"},{"english":"Chinese people has never regarded human beings as the hightest creature among everything else since ancient times.","chinese":"中華民族自古以來從來不把人看作高於一切。"},{"english":"Those are only our decoration, coz we never follow the money.","chinese":"那只是偶們的裝飾品，偶們從來不會被錢奴役。"},{"english":"The path has never been perfect.","chinese":"道路從來不可能總是平坦的通途。"},{"english":"Right. I have witnessed some applications that in fact rarely or never throw exceptions.","chinese":"是的，我知道有些應用程序極少或從來不會拋出異常。"},{"english":"The window is never open except in summer.","chinese":"這扇窗戶從來不開，夏季除外。"},{"english":"He has no co ectio or acce to useful information.","chinese":"他從來不運用或接觸有用的資訊。"},{"english":"The sitcom single woman is never alone for long.","chinese":"情景喜劇中的單身女人從來不會獨身很久的。"},{"english":"Such things are never talked about in businese circles.","chinese":"商業界的人士從來不談論這種事。"},{"english":"Tyler never ate in restaurants, and Marla wasn't wrinkled.","chinese":"泰勒從來不在餐館裏喫飯，而馬拉也沒有長皺紋。"},{"english":"She never uses it on workers, drones, or people.","chinese":"她從來不用她的螫針去剌工蜂，雄蜂，或人。"},{"english":"His wife never cooks for him.","chinese":"他太太從來不做飯。"},{"english":"A person that does not get online, often inspect a network to be great scourges .","chinese":"一個從來不上網的人，常常視網絡爲洪水猛獸。"},{"english":"For it is just as when I feed myself – I don't expect to be rewarded.","chinese":"就像自己給自己餵飯一樣，從來不會希求回饋或善報。"},{"english":"He is a very good husband and never runs around on his wife.","chinese":"他是個模範丈夫，從來不會瞞着妻子做一切事情。"}],"related":[]}