{"definition":["to obey an order\/to comply\/to do sb's bidding\/to do as requested"],"pinyin":["cong2 ming4"],"simplified":["从命"],"rank":47493.0,"normalized_rank":0.6644886880360416,"fraction":1.8641342950268733e-7,"cumulative_fraction":0.9985467492232551,"word":"從命","characters":[{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"},{"definition":["life\/fate\/order or command\/to assign a name, title etc"],"pinyin":["ming4"],"word":"命"}],"containing_words":[{"definition":["deference is no substitute for obedience (idiom)\/(said to accept sb's request, invitation etc)"],"pinyin":["gong1 jing4 bu4 ru2 cong2 ming4"],"word":"恭敬不如從命"},{"definition":["to not dare to disobey an order (idiom)"],"pinyin":["gan3 bu4 cong2 ming4"],"word":"敢不從命"},{"definition":["difficult to obey orders (idiom); much to my embarrassment, I am unable to comply"],"pinyin":["ai4 nan2 cong2 ming4"],"word":"礙難從命"}],"sentences":[{"english":"Roderigo defied the old gentleman and refused to stir.","chinese":"羅特克還敢公然反抗那個老紳士，拒絕從命。"},{"english":"You should get the command specifier from the command manager and, then, set.","chinese":"你應該得到的命令從命令符和管理，那麼，設置。"},{"english":"When working in a batch, we set all the parameters from the command line.","chinese":"當以批處理方式工作時，我們從命令行設置所有參數。"},{"english":"Invoke the file from a command line, or click it depending on your operating system. The script putters around for a while before outputting something like this","chinese":"從命令行調用文件，或者根據操作系統單擊文件。"},{"english":"Mechanically I obeyed, turned eastwards, and with my cutlass raised, ran round the corner of the house.","chinese":"我機械地服從命令向東轉，舉着彎刀跑步繞過屋角。"},{"english":"This section examines two techniques for running a script from the command line.","chinese":"本節介紹從命令行運行腳本的兩種方法。"},{"english":"The dispute was touched off by the dismissal of a workman for insubordination.","chinese":"這次爭端是由解僱一名不服從命令的工人引起的。"},{"english":"The drums sounded and instead of following the commands, the girls simply giggled and blushed.","chinese":"戰鼓敲響了，但女孩們沒有服從命令，只是臉紅傻笑。"},{"english":"Make sure you listen closely and follow the commands.","chinese":"你們一定要仔細聽並聽從命令。"},{"english":"Follow orders and hold your fire.","chinese":"聽從命令並停止行動。"},{"english":"You must obey orders.","chinese":"你非得服從命令不可。"},{"english":"Three of them were punished for disobeying orders.","chinese":"他們當中有三個人因爲不服從命令受到懲罰。"},{"english":"Thanks for listening. See you next time.","chinese":"你們一定要仔細聽並聽從命令。"},{"english":"The reason why officers are not afraid of war is because of following commands.","chinese":"士卒之所以不怕打仗，在於服從命令。"},{"english":"If you receive a request like this, you cannot fail to obey it.","chinese":"如不美觀你接到一種象這樣的請求，你不成能不從命。"},{"english":"It is preferable to start the capture and apply programs from the command line during testing.","chinese":"在測試期間從命令行啓動捕獲和應用程序更可取。"}],"related":[]}