{"definition":["preferential treatment\/most favored terms"],"pinyin":["cong2 you1"],"simplified":["从优"],"rank":43322.0,"normalized_rank":0.6061309865263806,"fraction":2.8115290933608136e-7,"cumulative_fraction":0.9975847725737992,"word":"從優","characters":[{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"},{"definition":["excellent\/superior"],"pinyin":["you1"],"word":"優"}],"containing_words":[],"sentences":[{"english":"It has changed from an optimization philosophy for 32-bit operands.","chinese":"它從優化哲學變成了32位運算。"},{"english":"A large quantity Congyou, free of logistics cost.","chinese":"量大從優，免物流費。"},{"english":"Factory direct sales, a large quantity of sense.","chinese":"廠家直銷，量大從優。"},{"english":"Nowadays its keystone is to treat the police with true feelings.","chinese":"現階段從優待警的側重點是以情待警。"},{"english":"The interested persons may relate with myself, price liberally.","chinese":"有意者可與本人聯繫，價格從優。"},{"english":"It is set in clear crystal pavé and dangles from an elegant rhodium-plated necklace.","chinese":"它以清晰和垂下水晶鋪平從優雅的鍍銠項鍊。"},{"english":"Quality is absolutely guaranteed, the wholesale price is reasonable, a large quantity of favorably.","chinese":"質量絕對有保證，批發價格合理，量大從優。"},{"english":"Misleading bulk sales are another retail favorite.","chinese":"量大從優的促銷誤導是零售商喜歡使用的伎倆。"},{"english":"The company strength is abundant, the treatment liberally, the payment insures.","chinese":"公司實力雄厚，待遇從優，繳納保險。"},{"english":"There exists in the cosmos a preferred frame of reference.","chinese":"宇宙中有一個從優參照系。"},{"english":"\"Love\" is a good lead from Ruili to the excellent source of strength.","chinese":"“戀家”是帶領瑞麗從優秀到卓越的力量源泉。"},{"english":"For many years the wholesale honeysuckle seedlings, prices Congyou, quality assurance.","chinese":"長年批發金銀花苗，價格從優，質量有保證。"},{"english":"Our company supply baby bib, a large quantity favorably, welcome to the consultation to discuss.","chinese":"本公司供應嬰兒圍兜，量大從優，歡迎前來諮詢洽談。"}],"related":[]}