{"definition":["from childhood\/from a young age"],"pinyin":["cong2 xiao3"],"simplified":["从小"],"rank":3864.0,"normalized_rank":0.0540623732038672,"fraction":0.00003472019463860312,"cumulative_fraction":0.82603109808127,"word":"從小","characters":[{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"},{"definition":["small\/tiny\/few\/young"],"pinyin":["xiao3"],"word":"小"}],"containing_words":[],"sentences":[{"english":"Eg. The house on the hill overlooks the village.","chinese":"從小山上的房子可以俯視村莊。"},{"english":"Boys and girls go out together from an early age.","chinese":"美國的男孩和女孩從小就可以一塊出去玩。"},{"english":"Yang Yun, her son, in his childhood, liked reading his grandfather's unopened manuscript.","chinese":"其外孫楊惲從小愛讀外公這部尚未公開的書稿。"},{"english":"I was a nervous child, and when I grew, I was a nervous young man.","chinese":"我從小膽小怯弱，長大了，仍是一個膽怯的年輕人。"},{"english":"His family was very poor, but he worked hard at his studies even in early childhood.","chinese":"孔子的家裏很窮，但是他從小就認真讀書，刻苦學習。"},{"english":"We have listened to Danish and spoken it from childhood. It is the joy of recognition we experience.","chinese":"我們從小就聽說丹麥語，這是我們經歷認同感的快樂。"},{"english":"I am a F. 5 student who is so fond of keeping pets.","chinese":"本人是一名中五學生，從小對飼養寵物有濃厚興趣。"},{"english":"The love which my parents gave me , or the lovely family I am having.","chinese":"父母從小對我無私的痛愛，他們的和諧家庭氛圍。"},{"english":"They all had, since their childhoods, a common dream and goal --- return to Shanghai.","chinese":"他們從小有個共同的夢想和目標，就是回到上海。"},{"english":"People grow up aware of the value of counting calories.","chinese":"人們從小到大也非常注意計算食物的熱量。"},{"english":"Eggs are graded from small to extra - large.","chinese":"雞蛋從小的到特大的分成了等級。"},{"english":"The male lead SooHo looses his mother as a child and lives with his father.","chinese":"男主人公才河從小失去了母親，與父親一起生活。"},{"english":"He was raised Catholic.","chinese":"他從小就是天主教徒。"},{"english":"Dad, I since the childhood to you are filled with hate, I hate you the flip-side of bad temper.","chinese":"爸爸我從小對你充滿怨恨，我討厭你那暴躁的壞脾氣。"},{"english":"My grandmamma told me when she was born she was a Christian.","chinese":"我的奶奶告訴我，她從小就是基督徒。"},{"english":"They had been indoctrinated from an early age with their parents' beliefs.","chinese":"他們從小就被滿腦子灌入他們父母的信仰。"}],"related":[]}