{"definition":["strict\/rigorous\/severely"],"pinyin":["cong2 yan2"],"simplified":["从严"],"rank":10888.0,"normalized_rank":0.15233724623284314,"fraction":0.0000071850187941443006,"cumulative_fraction":0.9365492531812836,"word":"從嚴","characters":[{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"},{"definition":["surname Yan","tight (closely sealed)\/stern\/strict\/rigorous\/severe\/father"],"pinyin":["Yan2","yan2"],"word":"嚴"}],"containing_words":[{"definition":["to deal with sb severely (idiom)"],"pinyin":["cong2 yan2 cheng2 chu3"],"word":"從嚴懲處"},{"definition":["demanding and strict (idiom)\/exacting"],"pinyin":["cong2 nan2 cong2 yan2"],"word":"從難從嚴"}],"sentences":[{"english":"In some ways I agree with those who want stricter punishments.","chinese":"我在某些方面同意那些從嚴懲處的人的意見。"},{"english":"Applied strictly, the test would knock out too wide a swath of patents.","chinese":"如從嚴適用，該檢驗方法對專利打擊面過大。"},{"english":"Strictly speaking, the answer isn't correct.","chinese":"從嚴的說，這個答案不正確。"},{"english":"On this occasion, strictness is a must.","chinese":"在這一場合，從嚴治黨，是必須進行的。"},{"english":"Food safety strictly control and care of life responsibility rushan.","chinese":"食品安全從嚴把關，關愛生命責任如山。"},{"english":"At the same time, governing the Party strictly is the constant policy of our party.","chinese":"從嚴治黨是我們黨的一貫方針。"},{"english":"Victims' associations lobby for longer prison terms for criminals.","chinese":"受害者團體則通過遊說要求對罪犯從嚴判決。"},{"english":"Strictly speaking, he had invested barely a dime of his own money all through.","chinese":"但從嚴格的意義上說，他卻始終沒有花過一分錢。"},{"english":"Insist to treat according to law sternly Jing, establishment the mechanism of scientific management.","chinese":"堅持依法從嚴治警，建立科學管理機制等。"},{"english":"The report was verified, will be severely dealt with.","chinese":"有關舉報一經覈實，將從嚴處理。"},{"english":"Technically, he had invested barely a dime of his own money all through.","chinese":"但從嚴格的意義上說，他卻始終沒有花過一分錢。"},{"english":"Jennifer Lopez went from serious actress to glamorous singer.","chinese":"洛佩斯從嚴肅的女演員成了迷人的歌星。"},{"english":"On-the-ground reports from the badly affected areas are few and incomplete.","chinese":"從嚴重受災地區發來的地面報道仍然稀少且不完整。"},{"english":"We will strictly control the number of new projects undertaken.","chinese":"從嚴控制新開工項目。"},{"english":"But a louder chorus wants the rules strictly interpreted.","chinese":"但是更多黨內人士一致認爲，應從嚴解讀這些規則。"},{"english":"In class management to strictly utilitarian, strict management.","chinese":"在班級管理中要嚴字當頭，從嚴管理。"}],"related":[]}