{"definition":["never (in the past)\/never did"],"pinyin":["cong2 mei2"],"simplified":["从没"],"rank":7384.0,"normalized_rank":0.10331174009765924,"fraction":0.00001358934923983099,"cumulative_fraction":0.9019450119291826,"word":"從沒","characters":[{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"},{"definition":["(negative prefix for verbs)\/have not\/not","drowned\/to end\/to die\/to inundate"],"pinyin":["mei2","mo4"],"word":"沒"}],"containing_words":[],"sentences":[{"english":"No one’s ever looked at the brain waves before with human-animal interaction.","chinese":"以前從沒有人就人與動物的互動來觀察人類的腦電波。"},{"english":"Nowhere in Uzhhorod have I seen things like this.","chinese":"我從沒在烏日戈羅德的其它地方見過這樣的蛋糕。"},{"english":"But, she's never achieved chart success with her music.","chinese":"但是她的音樂從沒有成功的進入過排行榜。"},{"english":"Since Rick never saw a ghost, he doesn't believe that they exist.","chinese":"瑞克從沒見過鬼，所以不相信他們的存在。"},{"english":"He lived for the day, not cumbered and mortified by his memory.","chinese":"他生活在現在，從沒受過自己的回憶的羞辱和妨礙。"},{"english":"Although had been in Shengzhou for close to ten years now, I had never been to Beizhang Mountain and passing there.","chinese":"到剡縣也有將近十年了，可從沒去過或路過北璋山。"},{"english":"Do you employ risk reduction techniques without fail?","chinese":"你是否使用風險降低技巧並從沒失手？"},{"english":"You normally have never been date-specific.","chinese":"你平常從沒有對日期特別敏感。"},{"english":"For these letters, Yan Shu never really seen.","chinese":"對於這些情書，顏姝從沒正眼看過。"},{"english":"I've not met such one ignoramus.","chinese":"我從沒見過這麼無知的人。"},{"english":"I had never written a resume before.","chinese":"我從沒有寫過簡歷。"},{"english":"Ziggy over there never even met his kid.","chinese":"那邊的茲基甚至從沒見過他的孩子。"},{"english":"It is the most impudent piece of pretension I ever heard of in my life.","chinese":"這是我一生中從沒聽說過的最厚顏無恥的一項要求了。"},{"english":"Fanny had not felt so comfortable for days and days.","chinese":"範妮多少天來從沒這樣心情舒暢過。"},{"english":"Ann: It’s said about 8 million yuan. I have never heard that any car made in China has such a high market price.","chinese":"據說是八百萬，我從沒聽過國產車有這樣高的市價。"},{"english":"Why the long face, Frank?I've never seen you look so fed up.","chinese":"弗蘭克，爲什麼板着臉？我從沒有看到你這樣不高興。"}],"related":[]}