{"definition":["accessory to a crime\/accomplice"],"pinyin":["cong2 fan4"],"simplified":["从犯"],"rank":33351.0,"normalized_rank":0.4666237600212668,"fraction":6.99378810295517e-7,"cumulative_fraction":0.9929736266251996,"word":"從犯","characters":[{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"},{"definition":["to violate\/to offend\/to assault\/criminal\/crime\/to make a mistake\/recurrence (of mistake or sth bad)"],"pinyin":["fan4"],"word":"犯"}],"containing_words":[{"definition":["induced accomplice\/coerced accomplice\/accomplice under duress"],"pinyin":["xie2 cong2 fan4"],"word":"脅從犯"}],"sentences":[{"english":"But in the our country, the accessory offender and should be a kind of to cross the relation with accomplice.","chinese":"而在我國，幫助犯和從犯應該是一種交叉關係。"},{"english":"Daniel Chan played a secondary role, the Department of accomplices .","chinese":"陳曉東起次要作用，系從犯。"},{"english":"Well , What did you geet from your mistakes during these years?","chinese":"那你這些年從犯錯中吸取了什麼經驗？"},{"english":"Mr Smith was believed to be an accessory to the murder .","chinese":"史密斯被認爲是該謀殺案的從犯。"},{"english":"New China has reclaimed many men from a life of crime.","chinese":"新中國把許多人從犯罪的道路上挽救了回來。"},{"english":"Well,what did you get from your mistakes during these years?","chinese":"那你這些年從犯錯中吸取了什麼經驗？"},{"english":"He was charged with being an accessory to the crime.","chinese":"他被認爲是該謀殺案的從犯。"},{"english":"He was just an accessory of a robbery, but he was sentenced to death.","chinese":"他只是一起搶劫案件中的從犯，卻被判處死刑。"},{"english":"Paul was made accessory to the theft.","chinese":"保羅被利用爲從犯。"},{"english":"The accessory before the fact was brought to court for trial this morning.","chinese":"那名事前從犯今天上午被提審。"},{"english":"The manacles were removed from the prisoner'swrists.","chinese":"從犯人的手腕上除去了手銬。"},{"english":"He had taken these lists from the drawer of the prisoner's desk.","chinese":"這些表冊是他從犯人的書桌的抽屜裏拿出來的。"},{"english":"JJ: This is what he looks like as a teenager.","chinese":"這就是那個少年從犯的畫像。"},{"english":"Those who have supported him will pass for his accomplices.","chinese":"那些支持他的人就要被視爲他的從犯。"},{"english":"They were charged with being accessories to the breach of copyright laws.","chinese":"他們被指控爲違反著作權法的從犯。"}],"related":[]}