{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"simplified":["从而"],"rank":1179.0,"normalized_rank":0.016495739649937738,"fraction":0.00013669928889858778,"cumulative_fraction":0.646368799094249,"word":"從而","characters":[{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"}],"containing_words":[],"sentences":[{"english":"The supplies of sugar have been running low,causing a rise in the price.","chinese":"糖的供應日漸短缺，從而引起價格的上漲。"},{"english":"Signals in the spectrum can penetrate walls, making it ideal for wireless broadband.","chinese":"該頻段的信號可以穿透牆壁，從而非常適合無線寬帶。"},{"english":"A dog with the correct proportions and angulation can thereby achieve static balance.","chinese":"擁有的正確比例和角度，從而達到犬隻的靜態平衡。"},{"english":"It's ethnocentrism that leads to failure in international business.","chinese":"它的種族優越感從而導致其在國際貿易的失敗。"},{"english":"Therefore, many notions that apply to rings and homomorphisms stem from geometric intuition.","chinese":"從而，環與同態中許多概念都源於幾何直覺。"},{"english":"So that a new way to produce high-purity manganese carbonate is opened up.","chinese":"從而爲高純度碳酸錳的製備開闢了一條新的途徑。"},{"english":"But small auctions can lead to low winning bids, and thus less profit.","chinese":"此外，小型拍賣會導致中標價過低，利潤從而減少。"},{"english":"The omission of heat straightening may save energy and thus reduces production cost.","chinese":"特別是取消熱調直可節約能源，從而降低生產成本。"},{"english":"Ocean waves move the hydraulic fluid, which spins the generator.","chinese":"海浪推動液壓油從而驅動發電機運轉。"},{"english":"This illustrates that this method has good prospect in practical positive-analysis application.","chinese":"從而說明本方法有實際正演應用的廣闊前景。"},{"english":"Feelings often stand in the way of forgiveness, veiling judgment and common sense.","chinese":"情緒總是會影響判斷和理智，從而阻礙寬恕的發生。"},{"english":"So as to avoid the operation of the strangeness players.","chinese":"從而避免了玩家操作上的陌生感。"},{"english":"Then the vortex-induced vibration response of cables is calculated.","chinese":"從而計算拖纜的渦激振動響應。"},{"english":"First, robots never get sick, so absenteeism would be reduced.","chinese":"首先，機器人從不生病，從而曠工將會減少。"},{"english":"It requires substantially less electrical consumption for deposition and, as a result, less refrigeration for cooling.","chinese":"電泳本身耗電量少，從而用於冷卻的冷量也少。"},{"english":"Thus, operations of solving the equation and inner storage capacity are greatly reduced.","chinese":"從而使解方程的計算工作量和內貯容量大爲減少。"}],"related":[{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"},{"definition":["and\/besides\/moreover\/furthermore\/in addition"],"pinyin":["bing4 qie3"],"word":"並且"},{"definition":["to be capable of\/to be able to\/can"],"pinyin":["neng2 gou4"],"word":"能夠"},{"definition":["one step further\/to move forward a step\/further onwards"],"pinyin":["jin4 yi1 bu4"],"word":"進一步"},{"definition":["to arouse\/to excite"],"pinyin":["ji1 fa1"],"word":"激發"},{"definition":["not only (this one)\/not just (...) but also"],"pinyin":["bu4 jin3"],"word":"不僅"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"},{"definition":["hidden\/potential\/latent"],"pinyin":["qian2 zai4"],"word":"潛在"},{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge"],"pinyin":["bing4"],"word":"並"},{"definition":["unceasing\/uninterrupted\/continuous\/constant"],"pinyin":["bu4 duan4"],"word":"不斷"},{"definition":["to arise\/to come into being\/to come about\/to give rise to\/to bring into being\/to bring about\/to produce\/to engender\/to generate\/to appear\/appearance\/emergence\/generation\/production\/yield"],"pinyin":["chan3 sheng1"],"word":"產生"},{"definition":["to change\/to transform\/isomerization (chemistry)"],"pinyin":["zhuan3 hua4"],"word":"轉化"},{"definition":["assistance\/aid\/to help\/to assist"],"pinyin":["bang1 zhu4"],"word":"幫助"},{"definition":["to lead to\/to create\/to cause\/to bring about"],"pinyin":["dao3 zhi4"],"word":"導致"},{"definition":["to yield\/to permit\/to let sb do sth\/to have sb do sth\/to make sb (feel sad etc)\/by (indicates the agent in a passive clause, like 被[bei4])"],"pinyin":["rang4"],"word":"讓"},{"definition":["gradually"],"pinyin":["zhu2 jian4"],"word":"逐漸"}]}