{"definition":["(to do sth) with dispatch\/as soon as possible"],"pinyin":["cong2 su4"],"simplified":["从速"],"rank":36784.0,"normalized_rank":0.5146558840401271,"fraction":5.167607990912399e-7,"cumulative_fraction":0.9950472750172236,"word":"從速","characters":[{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"},{"definition":["fast\/rapid\/quick\/velocity"],"pinyin":["su4"],"word":"速"}],"containing_words":[],"sentences":[{"english":"No one in the office promised a quick answer to the matter.","chinese":"辦公室沒人答應對此事從速作答。"},{"english":"The market is declining. we recommend your immediingested contentment.","chinese":"市場在萎縮，我們發起你方從速接受。"},{"english":"I ran to the platform quickly, but the train had already left.","chinese":"我從速跑到站臺上，可是火車已開走了。"},{"english":"He has promised his supporters that he is going to pull out as quickly as possible.","chinese":"他向支持者承諾將盡快從速從伊拉克撤軍。"},{"english":"He promised me a quick answer.","chinese":"他答應我從速答覆。"},{"english":"Since the up price is topic to alteration, we urge you to socate ywe order promptly.","chinese":"鑑於以上價格估計還有改動，咱們請您務必從速訂貨。"},{"english":"Maybe a more polite way is “at your earliest convenience.","chinese":"或許更客氣的說法是“在您方便時，務請從速回復”。"},{"english":"You'd better be pretty smart about the job.","chinese":"這項工作你最好從速去做。"},{"english":"As soon as possible to see the meteor tell how?","chinese":"從速看看流星告訴的怎麼樣了？"},{"english":"The situation comedy is going to start soon. Just switch to channel one.","chinese":"氣象笑劇從速就要先河了，快調到一頻道。"},{"english":"He has promised his supporters that he will pull out as soon and as quickly as possible.","chinese":"他向支持者承諾將盡快從速從伊拉克撤軍。"},{"english":"Network storage space, there are time constraints, please download as soon as possible.","chinese":"網絡空間存儲，有時間限制，請從速下載。"}],"related":[]}