{"definition":["to restore sb or sth to its original position\/to regain the throne\/to reset (a dislocated joint, an electronic device etc)\/reset"],"pinyin":["fu4 wei4"],"simplified":["复位"],"rank":31388.0,"normalized_rank":0.4391588431995299,"fraction":8.332402941279087e-7,"cumulative_fraction":0.9914724775235522,"word":"復位","characters":[{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out"],"pinyin":["fu4"],"word":"復"},{"definition":["position\/location\/place\/seat\/classifier for people (honorific)\/classifier for binary bits (e.g. 十六位 16-bit or 2 bytes)\/(physics) potential"],"pinyin":["wei4"],"word":"位"}],"containing_words":[],"sentences":[{"english":"Fully digital line switching and MCU controlled service reset timing.","chinese":"全數字化線路開關和單片機控制服務復位時間。"},{"english":"Objective To analysis the reduction route and fixation method of zygomatic fracture in the early stage.","chinese":"目的分析顴骨顴弓骨折早期手術復位徑路和固定方法。"},{"english":"A tipical reset technique for five transistors active pixel is proposed.","chinese":"提出了一種適用於五管有源像素的復位技術。"},{"english":"With a power-on reset functions, namely, the DAC registers reset to all zeroes.","chinese":"帶有上電覆位功能，即把DAC寄存器復位至全零。"},{"english":"Conclusions: the soft tissue in the acetabulum is one of the factors to hinder hip reduction.","chinese":"髖臼內組織的存在影響髖脫位復位的成功率。"},{"english":"The circuit employs a reset-supervisory chip with the pin and active-low output, .","chinese":"電路使用帶引腳和低有效輸出的復位管理芯片。"},{"english":"Objective Toevaluate the effect of open reduction and internal fixation for calcaneal fracture.","chinese":"目的評價開放復位內固定對跟骨骨折的治療效果。"},{"english":"Last, the anterolateral segment is internally rotated and reduced to the remaining distal tibia.","chinese":"最後，對脛骨遠端剩餘的前外側骨塊進行內旋，復位。"},{"english":"Objective To observe the effect of open reduction and internal fixation to treat clavicular fractures.","chinese":"目的觀察切開復位內固定治療鎖骨骨折的療效。"},{"english":"So, the Army has invested heavily in this ‘reset programme.","chinese":"因此，陸軍重金投入了“復位計劃”。"},{"english":"Storage function is set to realize automatic reset of backrest.","chinese":"儲存功能，是一套實現自動復位的靠背。"},{"english":"Open reduction for fracture of carpal, tarsal, meta-carpal, meta-tarsal.","chinese":"腕，跗，掌，跖骨骨折開放性復位術。"},{"english":"The reset downloads the microcode on the interface again.","chinese":"下載界面上的微碼再次復位。"},{"english":"For this reason, the \"Initialise HIP module\" service function has also been discontinued.","chinese":"因此“初始化復位模塊”的服務功能被取消了。"},{"english":"With anthropomorphized safety construction design, the machine can prevent the nonself from machine and serum the original position.","chinese":"人性化安全設計，防止異物進入機內，自動復位。"},{"english":"Computer reset circuit board was the important assembly of illumination controller.","chinese":"電腦復位電路板是照明控制儀中不可缺少的部件。"}],"related":[{"definition":["two-sided\/bilateral"],"pinyin":["shuang1 ce4"],"word":"雙側"},{"definition":["body palpation (diagnostic method in TCM)\/tactile examination"],"pinyin":["chu4 zhen3"],"word":"觸診"},{"definition":["intervertebral disk"],"pinyin":["zhui1 jian1 pan2"],"word":"椎間盤"},{"definition":["popliteal (anatomy)\/hollow at the back of the knee"],"pinyin":["guo2 wo1"],"word":"膕窩"},{"definition":["symptom (of a disease)"],"pinyin":["bing4 zhuang4"],"word":"病狀"},{"definition":["loose\/flaking"],"pinyin":["song1 tuo1"],"word":"鬆脫"},{"definition":["soft tissue"],"pinyin":["ruan3 zu3 zhi1"],"word":"軟組織"},{"definition":["kneecap"],"pinyin":["xi1 gai4 gu3"],"word":"膝蓋骨"},{"definition":["twelve channels of TCM"],"pinyin":["shi2 er4 jing1 mai4"],"word":"十二經脈"},{"definition":["to discharge pus\/to suppurate"],"pinyin":["liu2 nong2"],"word":"流膿"},{"definition":["top-heavy\/fig. unbalance in organization or political structure"],"pinyin":["tou2 zhong4 jiao3 qing1"],"word":"頭重腳輕"},{"definition":["minimally invasive surgery"],"pinyin":["wei1 chuang1 shou3 shu4"],"word":"微創手術"},{"definition":["adhesion\/to adhere\/to cohere\/to stick","to adhere\/to stick together"],"pinyin":["nian2 lian2","zhan1 lian2"],"word":"粘連"},{"definition":["brake"],"pinyin":["zhi4 dong4 qi4"],"word":"制動器"},{"definition":["hematoma\/swelling of soft tissue due to internal hemorrhage"],"pinyin":["xue4 zhong3"],"word":"血腫"},{"definition":["sciatica"],"pinyin":["zuo4 gu3 shen2 jing1 tong4"],"word":"坐骨神經痛"}]}