{"definition":["to remarry (the same person)"],"pinyin":["fu4 hun1"],"simplified":["复婚"],"rank":24479.0,"normalized_rank":0.34249296937305,"fraction":0.0000015571433457362303,"cumulative_fraction":0.9835006286642544,"word":"復婚","characters":[{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out"],"pinyin":["fu4"],"word":"復"},{"definition":["to marry\/marriage\/wedding\/to take a wife"],"pinyin":["hun1"],"word":"婚"}],"containing_words":[],"sentences":[{"english":"She re married her former husband ten year after their divorce.","chinese":"她與原來的丈夫離婚十年後又復婚了。"},{"english":"She remarried her former husband ten years after their divorce.","chinese":"她與前夫離婚十年後又復婚了。"},{"english":"He also will not tell you remarry ?","chinese":"他還會不會跟你復婚？"},{"english":"After the divorce to remarry is in the life most unforgivable stupid mistakes.","chinese":"離婚後復婚是人生中最不可原諒的愚蠢錯誤。"},{"english":"The vast majority of people who remarry live with their partner first.","chinese":"大多數人還是會和前任配偶復婚的。"},{"english":"She remarried her former husband ten year after their divorce.","chinese":"她與原來的丈夫仳離十年後又復婚了。"},{"english":"After Ding Hai went back home, clearly refused to remarry, requires each and all of life.","chinese":"丁海回家後，明確拒絕復婚，要求各過各的生活。"},{"english":"I do not want to remarry him.","chinese":"我可不希望到了白髮蒼蒼和他復婚。"}],"related":[{"definition":["Every family goes through its problems. (idiom)"],"pinyin":["jia1 jia1 you3 ben3 nan2 nian4 de5 jing1"],"word":"家家有本難念的經"},{"definition":["all crows are black (idiom)\/evil people are bad all over the world"],"pinyin":["tian1 xia4 wu1 ya1 yi1 ban1 hei1"],"word":"天下烏鴉一般黑"},{"definition":["lit. to stand with each foot in a different boat (idiom)\/fig. to have it both ways\/to run after two hares\/(especially) to have two lovers at the same time"],"pinyin":["jiao3 ta4 liang3 tiao2 chuan2"],"word":"腳踏兩條船"},{"definition":["to make a terrible scene (idiom)\/to throw a tantrum"],"pinyin":["yi1 ku1 er4 nao4 san1 shang4 diao4"],"word":"一哭二鬧三上吊"},{"definition":["the rice is cooked\/what's done is done\/it's too late to change anything now (idiom)"],"pinyin":["sheng1 mi3 zhu3 cheng2 shu2 fan4"],"word":"生米煮成熟飯"},{"definition":["having nothing better to do"],"pinyin":["chi1 bao3 cheng1 zhe5"],"word":"吃飽撐著"},{"definition":["variant of 慪氣|怄气[ou4 qi4]"],"pinyin":["ou4 qi4"],"word":"嘔氣"},{"definition":["henpecked male"],"pinyin":["qi1 guan3 yan2"],"word":"妻管嚴"},{"definition":["to follow the path to one's own doom (idiom)\/to bring about one's own destruction"],"pinyin":["zi4 xun2 si3 lu4"],"word":"自尋死路"},{"definition":["lit. a good horse doesn't turn around and graze the same patch again (idiom)\/fig. once you've moved on, don't go back again (romantic relationship, job etc)\/leave the past behind"],"pinyin":["hao3 ma3 bu4 chi1 hui2 tou2 cao3"],"word":"好馬不吃回頭草"},{"definition":["see the opportunity and act (idiom); to act according to circumstances\/to play it by ear\/to use one's discretion"],"pinyin":["jian4 ji1 xing2 shi4"],"word":"見機行事"},{"definition":["trivial matter\/a piece of cake"],"pinyin":["xiao3 shi4 yi1 zhuang1"],"word":"小事一樁"},{"definition":["lit. to swell one's face up by slapping it to look imposing (idiom); to seek to impress by feigning more than one's abilities"],"pinyin":["da3 zhong3 lian3 chong1 pang4 zi5"],"word":"打腫臉充胖子"},{"definition":["foolish talk\/nonsense"],"pinyin":["sha3 hua4"],"word":"傻話"},{"definition":["keenly felt pain\/bitter anguish"],"pinyin":["qie4 fu1 zhi1 tong4"],"word":"切膚之痛"},{"definition":["to patch up one's lie (when inconsistencies appear)\/to cover (for sb who has lied)"],"pinyin":["yuan2 huang3"],"word":"圓謊"}]}