{"definition":["to come back\/to return"],"pinyin":["fu4 fan3"],"simplified":["复返"],"rank":49828.0,"normalized_rank":0.6971583674954178,"fraction":1.4670751499624185e-7,"cumulative_fraction":0.9989350081070832,"word":"復返","characters":[{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out"],"pinyin":["fu4"],"word":"復"},{"definition":["to return (to)"],"pinyin":["fan3"],"word":"返"}],"containing_words":[{"definition":["gone forever"],"pinyin":["yi1 qu4 bu4 fu4 fan3"],"word":"一去不復返"}],"sentences":[{"english":"The devastated old China is gone for ever.","chinese":"瘡痍滿目的舊中國一去不復返了。"},{"english":"The good old days of “Our Friend the Atom” were gone for good.","chinese":"過去“原子是我們的朋友”美好時光也一去不復返了。"},{"english":"Gone are the days when the farmers were looked down upon.","chinese":"農民被人瞧不起的日子一去不復返了。"},{"english":"Gone are the days when the working people suffered from cold and hunger.","chinese":"勞動人民挨凍受餓的日子一去不復返了。"},{"english":"He understands that the days are gone when the party can maintain political stability with the muzzle of a gun.","chinese":"他知道一個政黨靠槍桿子出政權的日子一去不復返了。"},{"english":"10th, Meng Xiangbin The wind whinny, the river water is cold, the brave soldier never to returns.","chinese":"風蕭蕭，江水寒，壯士一去不復返。"},{"english":"If on Candlemas day it be shower and rain, winter is gone, and will not come again.","chinese":"如果聖燭節下冰雹和雨水，冬天已經一去不復返。"},{"english":"Gone are the days when we used foreign oil.","chinese":"咱們利用洋油的日子一去不復返了。"},{"english":"Anika_Wu: Life is like a one way street, none of them leads back.","chinese":"人生就像一條單行道，一去不復返。"},{"english":"The era when foreign goods flooded the Chinese market is gone for ever.","chinese":"洋貨充斥中國市場的時代已經一去不復返了。"},{"english":"Gone are the days when a big nation could king it over small ones.","chinese":"大國可以對小國稱王稱霸的日子已經一去不復返了。"},{"english":"The old mischaracterizations have gone away,” he said.","chinese":"舊的錯誤概念已一去不復返了。"},{"english":"The days when we were poor are gone forever.","chinese":"我們受窮的日子一去不復返了。"},{"english":"Gone are the days when we are short of food and clothing.","chinese":"我們缺衣少食的日子一去不復返了。"},{"english":"Gone are the days when a big nation could lord it over small ones.","chinese":"大國可以對小國稱王稱霸的日子已經一去不復返了。"},{"english":"The old hostel culture of camaraderie and socializing among students is gone.","chinese":"互助友愛的宿舍文化已經一去不復返了。"}],"related":[]}