{"definition":["infinitesimal disturbance\/perturbation (physics)"],"pinyin":["wei1 rao3"],"simplified":["微扰"],"rank":68870.0,"normalized_rank":0.9635806528339372,"fraction":5.109216940167626e-9,"cumulative_fraction":0.9999919815949244,"word":"微擾","characters":[{"definition":["surname Wei\/ancient Chinese state near present day Chongqing\/Taiwan pr. [Wei2]","tiny\/miniature\/slightly\/profound\/abtruse\/to decline\/one millionth part of\/micro-\/Taiwan pr. [wei2]"],"pinyin":["Wei1","wei1"],"word":"微"},{"definition":["to disturb"],"pinyin":["rao3"],"word":"擾"}],"containing_words":[{"definition":["perturbative expansion (physics)"],"pinyin":["wei1 rao3 zhan3 kai1"],"word":"微擾展開"},{"definition":["perturbation theory"],"pinyin":["wei1 rao3 lun4"],"word":"微擾論"},{"definition":["non-perturbative (physics)"],"pinyin":["fei1 wei1 rao3"],"word":"非微擾"}],"sentences":[{"english":"Chapter 1 begin with an introduction and overview of the computations of perturbative scattering amplitudes.","chinese":"第一章是關於微擾散射振幅計算的導論和概述。"},{"english":"The four-layer leaky waveguide mechanism is analyzed by perturbation method also.","chinese":"並用微擾法計算和分析了四層漏波導結構。"},{"english":"We develop a direct approach to the soliton perturbation based on the separation variables.","chinese":"發展了一種以分離變量爲基礎的孤子微擾的直接方法。"},{"english":"Moreover, influence of basis set effect upon TDHF calculation is also discussed.","chinese":"此外，還討論了基組效應對含時耦合微擾計算的影響。"},{"english":"The perturbative method for calculating the effect of imperfectly conducting walls on the propagation of electromagnetic waves in cylindrical waveguides is reformulated.","chinese":"對非理想導體腔壁柱形波導的微擾法作了重新表述。"},{"english":"Least squares and matrix perturbation problems are considered.","chinese":"最小平方法和矩陣微擾法等都列入考慮。"},{"english":"The differences root in the dressed effects of the non-perturbative vertices.","chinese":"這裏的差別起源於我們考慮了非微擾頂點的效應。"},{"english":"The convergence conditions for the perturbation procedure are also given and discussed.","chinese":"文中還討論並給出了微擾過程的收斂條件。"},{"english":"The electromagnetic scattering from Gaussian rough surface is studied by applying the SPM(small perturbation method).","chinese":"運用經典的微擾法研究了高斯粗糙面的電磁散射。"}],"related":[]}