{"definition":["microfilament"],"pinyin":["wei1 si1"],"simplified":["微丝"],"rank":64126.0,"normalized_rank":0.8972059379066221,"fraction":1.956100199949891e-8,"cumulative_fraction":0.999938068553876,"word":"微絲","characters":[{"definition":["surname Wei\/ancient Chinese state near present day Chongqing\/Taiwan pr. [Wei2]","tiny\/miniature\/slightly\/profound\/abtruse\/to decline\/one millionth part of\/micro-\/Taiwan pr. [wei2]"],"pinyin":["Wei1","wei1"],"word":"微"},{"definition":["silk\/thread\/trace\/(cuisine) shreds or julienne strips\/CL:條|条[tiao2]\/classifier: a thread (of cloud, smoke etc), a bit, an iota, a hint (of sth) etc"],"pinyin":["si1"],"word":"絲"}],"containing_words":[{"definition":["capillary blood vessels"],"pinyin":["wei1 si1 xue4 guan3"],"word":"微絲血管"}],"sentences":[{"english":"The microfilament in the microvilli and pseudopodia is the motion skeleton of cancer cells.","chinese":"微絨毛及僞足內的微絲是瘤細胞的運動骨架。"},{"english":"Microfilaments also mediated the interaction between midbody and plasma membrane.","chinese":"中體和質膜間的相互作用依賴微絲介導。"},{"english":"The microfilaments of some microvilli formed core rootlets and entered into the cytoplasm.","chinese":"細胞遊離面部分微絨毛的微絲形成中心根並深入胞質。"},{"english":"Microfilaments and microtubules are responsible for almost all major cytoplasmic movements.","chinese":"絕大部分細胞質運動由微絲和微管完成。"},{"english":"When ATP is added, the myosin motors move the actin filaments.","chinese":"加入ATP後，肌球蛋白馬達使微絲移動。"},{"english":"Microsfilaments and microtubules are responsible for almost all major cytoplasmic movements.","chinese":"微絲和微管主要負責大多數細胞質移動。"},{"english":"The microfilaments in the microvilli and pseudopodia are the skeleton of the movement.","chinese":"微絨毛及僞足內的微絲是其運動的骨架結構。"},{"english":"The microfilament is the skeletal structure of microvilli.","chinese":"微絨毛活動的支撐骨架爲微絲。"},{"english":"These medicines clear microfilariae from the bloodstream and kill most of the adult worms.","chinese":"這些藥物的作用是清除血液中的微絲蚴和殺死成蟲。"},{"english":"Main Outcome Measures The wound areas and the arrangement of microfilament cytoskeleton of wounds.","chinese":"主要指標傷口面積及細胞微絲骨架的排列。"}],"related":[]}