{"definition":["microprocessor"],"pinyin":["wei1 chu3 li3 qi4"],"simplified":["微处理器"],"rank":23800.0,"normalized_rank":0.3329928784296168,"fraction":0.000001652174780823348,"cumulative_fraction":0.9824112894549116,"word":"微處理器","characters":[{"definition":["surname Wei\/ancient Chinese state near present day Chongqing\/Taiwan pr. [Wei2]","tiny\/miniature\/slightly\/profound\/abtruse\/to decline\/one millionth part of\/micro-\/Taiwan pr. [wei2]"],"pinyin":["Wei1","wei1"],"word":"微"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[],"sentences":[{"english":"A microcontroller is very similar to a microprocessor.","chinese":"微控制器很像微處理器。"},{"english":"Does electronical computer based on microprocessors made of silicon chip come to an end?","chinese":"以硅片微處理器爲核心的電子計算機要走到盡頭了嗎？"},{"english":"Every year you can come up with microprocessor architecture.","chinese":"每年你都可以提出微處理器架構。"},{"english":"A microprocessor rests inside it which controls the magnetic field.","chinese":"在這個設備的內部，有一個控制着磁場的微處理器。"},{"english":"Center means the core of the system which is under the control of MPU.","chinese":"中心就是系統核心，由微處理器來控制整個系統工作。"},{"english":"PLC is a industry control equipment which cores on MPU.","chinese":"PLC是以微處理器爲核心的工業控制裝置。"},{"english":"Very large-scale integration (VLSI) vastly increased circuit density, giving RisE to the microprocessor.","chinese":"大規模集成電路更大的增加了微處理器的電路密度。"},{"english":"Start with microprocessors as the core component microcomputer belong to D computer.","chinese":"以微處理器爲核心組成的微型計算機屬於D計算機。"},{"english":"You can see the usage of microcontroller in the products that is sold the best.","chinese":"幾乎所有熱門產品中都能見到微處理器的身影。"},{"english":"I hope you enjoyed this first installment of the history of microprocessors.","chinese":"我希望你們可以喜歡介紹微處理器歷史的第一部分。"},{"english":"Embedded 32-bit microprocessor with integrated floating-point unit.","chinese":"嵌入式32位具有集成的浮點單元的微處理器。"},{"english":"The behavior design and simulation of a 32-bit microprocessor chip sre described in this paper.","chinese":"本文介紹32位微處理器芯片的行爲設計和行爲模擬。"},{"english":"I finally narrowed down the problem to microprocessor churning during analog-to-digital-conversion cycles.","chinese":"我最終將問題定位到微處理器在模數轉換期間的擾動。"},{"english":"The movements of the paramecia and the score are kept by a microprocessor.","chinese":"用一個微處理器來控制草履蟲的移動和得分。"},{"english":"During the procession, the microprocessor finished the processing procedure.","chinese":"在步隊前進時，微處理器實現了加工進程。"},{"english":"Each instruction may require a different sequence of operations to execute the instruction.","chinese":"當微處理器對該指令譯碼是，的操作序列來執行。"}],"related":[]}