{"definition":["fine tuning\/trimming"],"pinyin":["wei1 tiao2"],"simplified":["微调"],"rank":16939.0,"normalized_rank":0.2369985868789613,"fraction":0.000003304495539273558,"cumulative_fraction":0.9662167996917456,"word":"微調","characters":[{"definition":["surname Wei\/ancient Chinese state near present day Chongqing\/Taiwan pr. [Wei2]","tiny\/miniature\/slightly\/profound\/abtruse\/to decline\/one millionth part of\/micro-\/Taiwan pr. [wei2]"],"pinyin":["Wei1","wei1"],"word":"微"},{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["diao4","tiao2"],"word":"調"}],"containing_words":[],"sentences":[{"english":"Eachindependent cylinder's press-roller has precision micro-adjuster to guarantee the effect of sueding .","chinese":"每支獨立汽缸壓布輥精確的微調，能確保磨毛效果。"},{"english":"You could put the content of the spinner as a third argument.","chinese":"您可將微調控制項的內容作爲第三個參數引入。"},{"english":"She said my understanding of Darwinism needed some fine-tuning.","chinese":"她說我對進化論的理解需要一些微調。"},{"english":"Low-flow is stable for precision adjustment.","chinese":"低流量穩定，氣缸慢速微調更準時。"},{"english":"That takes patience, trial and error, with small adjustments to the aerial’s orientation being made as you switch from one station to another.","chinese":"換臺時得微調天線方向，那需要耐心和反覆調試。"},{"english":"Tweaked attendances in later stage cup competition matches played at neutral stadiums.","chinese":"微調在中立場地進行的杯賽後階段比賽的上座率。"},{"english":"Scribed or painted lines are not acceptable for trim or hole sight checks.","chinese":"在微調或窺孔檢測時，劃線或繪線是不可接受的。"},{"english":"Digital \"tuning\" of bias and gain eliminates the need to manipulate potentiometers or dials.","chinese":"數字“微調”的偏差和增益，無需操作電位計或撥號。"},{"english":"Carrier Drones are now able to change targets, increased speed, tweaked damage.","chinese":"艦載機現在可以切換目標，增加速度，微調傷害。"},{"english":"The greatest tweaker of his generation did not care to be tweaked.","chinese":"在自己的時代裏，最偉大的巧匠並不喜歡被微調。"},{"english":"Now we can see the values that will be used for the spinner.","chinese":"現在，我們可以看到將用於微調器的那些值。"},{"english":"On the other hand, we should continue to implement the relatively restrict monetary policy and put micro adjustment into practice timely and moderately.","chinese":"繼續實行適度從緊的貨幣政策，搞好適時適度微調。"},{"english":"ClearType Text Tuning and Display Color Calibration .","chinese":"ClearType文字微調和顯示顏色校準。"},{"english":"The wedge device and the fine regulating device for sizing the phosphor-copper thin plates are also introduced.","chinese":"同時，還介紹了楔塊裝置及磷銅薄片整形的微調裝置。"},{"english":"Why So Many Trimmer Capacitors?","chinese":"爲什麼這麼多微調電容？"},{"english":"Micro adjustment functions. Support parts of line wheel and knife wheel micro adjustment during the production.","chinese":"支持生產過程中對部分刀輪和線輪進行微調。"}],"related":[{"definition":["to adjust\/adjustment\/revision\/CL:個|个[ge4]"],"pinyin":["tiao2 zheng3"],"word":"調整"},{"definition":["to examine or inspect\/self-criticism\/review"],"pinyin":["jian3 tao3"],"word":"檢討"},{"definition":["to compress\/compression"],"pinyin":["ya1 suo1"],"word":"壓縮"},{"definition":["to adjust downwards\/to lower (prices, wages etc)","to demote\/to pass down to a lower unit"],"pinyin":["xia4 diao4","xia4 tiao2"],"word":"下調"},{"definition":["schedule\/timetable"],"pinyin":["shi2 jian1 biao3"],"word":"時間表"},{"definition":["to presuppose\/to predispose\/to preset\/presupposition\/predisposition\/default (value etc)"],"pinyin":["yu4 she4"],"word":"預設"},{"definition":["to construct\/to build\/infrastructure\/architecture\/framework"],"pinyin":["jia4 gou4"],"word":"架構"},{"definition":["individual\/specific\/respective\/just one or two"],"pinyin":["ge4 bie2"],"word":"個別"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"審查"},{"definition":["to reorganize\/to recombine\/recombination"],"pinyin":["chong2 zu3"],"word":"重組"},{"definition":["buyback\/repurchase\/to buy back"],"pinyin":["hui2 gou4"],"word":"回購"},{"definition":["to weave\/to plait\/to compile\/to put together (a lesson plan, budget etc)"],"pinyin":["bian1 zhi4"],"word":"編製"},{"definition":["to set\/to set up\/to install\/setting\/preferences"],"pinyin":["she4 ding4"],"word":"設定"},{"definition":["to revise"],"pinyin":["xiu1 ding4"],"word":"修訂"},{"definition":["to mark off\/interval\/segment (e.g. of market)\/compartment\/segmentation"],"pinyin":["qu1 ge2"],"word":"區隔"},{"definition":["to count\/reckoning"],"pinyin":["ji4 shu4"],"word":"計數"}]}