{"definition":["scanty\/meager"],"pinyin":["wei1 bo2"],"simplified":["微薄"],"rank":15415.0,"normalized_rank":0.2156758496215354,"fraction":0.000003952490224913677,"cumulative_fraction":0.9607128891739578,"word":"微薄","characters":[{"definition":["surname Wei\/ancient Chinese state near present day Chongqing\/Taiwan pr. [Wei2]","tiny\/miniature\/slightly\/profound\/abtruse\/to decline\/one millionth part of\/micro-\/Taiwan pr. [wei2]"],"pinyin":["Wei1","wei1"],"word":"微"},{"definition":["meager\/slight\/weak\/ungenerous or unkind\/frivolous\/to despise\/to belittle\/to look down on\/to approach or near","see 薄荷[bo4 he5]","surname Bo","thin\/cold in manner\/indifferent\/weak\/light\/infertile"],"pinyin":["Bo2","bao2","bo2","bo4"],"word":"薄"}],"containing_words":[],"sentences":[{"english":"My small business operates on a razor-thin profit margin.","chinese":"我的生意屬小本經營，利潤微薄。"},{"english":"I just do something to my meager to serve truth and justice services.","chinese":"我要做的只是以我微薄的綿力來爲真理和正義服務。"},{"english":"Laura, then 62, was teaching at poverty-level wages.","chinese":"當時勞拉62歲，還在教書，收入微薄。"},{"english":"His meager wage is not enough to support their five children.","chinese":"靠他一個人的微薄工資不足以養活他們的五個孩子。"},{"english":"The business world should start to see Twitter as one of the primary consumer communication channels available.","chinese":"企業應該開始將微薄看做一個基本的客戶交流平臺。"},{"english":"He seems a rich man, but is poverty in practice.","chinese":"看上去他很有錢，但實際上家資微薄。"},{"english":"He seems to be rich. Actually his family is very poor.","chinese":"看上去他很有錢，其實家資微薄。"},{"english":"He seems very rich, in fact his family is very poor.","chinese":"看上去他很有錢，其實家資微薄。"},{"english":"I enclosed a humble contribution towards the funds of your society.","chinese":"我謹爲貴會的基金奉上一筆微薄的捐款。"},{"english":"I like the hours and the people, but the pay is measly.","chinese":"我喜歡這裏的工作時間和同事，但薪水非常微薄。"},{"english":"The meager profit in the factory has vanished into thin air, due to long funds tied up.","chinese":"工廠微薄的利潤由於漫長的資金佔壓而消失殆盡。"},{"english":"He looks very rich, in fact he has a thin assets.","chinese":"看上去他很有錢，其實家資微薄。"},{"english":"For each beloved hour Sharp pittances of years.","chinese":"爲每一個可愛的時刻必償以多年的微薄薪餉。"},{"english":"Saturn helps direct us back to becoming farmers in our own humble garden plot.","chinese":"土星直接幫助我們重新回到成爲農民自己的微薄園圃。"},{"english":"The business profit is more and more scanty in the storm of the price.","chinese":"利潤在這樣的漲價之風中越顯微薄。"},{"english":"I can't support the big family on such a slim income.","chinese":"靠這點微薄的收入我是不可能養活這一大家子的。"}],"related":[{"definition":["to subsist\/to eke out a living\/to keep body and soul together"],"pinyin":["wei2 chi2 sheng1 huo2"],"word":"維持生活"},{"definition":["variant of 糊口[hu2 kou3]"],"pinyin":["hu2 kou3"],"word":"餬口"},{"definition":["my humble effort\/my meager contribution (humble)"],"pinyin":["mian2 bo2"],"word":"綿薄"},{"definition":["to live one's life\/to make a living"],"pinyin":["guo4 huo2"],"word":"過活"},{"definition":["to pass one's days\/to scratch out a difficult, meager existence"],"pinyin":["du4 ri4"],"word":"度日"},{"definition":["to support one's family (idiom); to have difficulty feeding a family"],"pinyin":["yang3 jia1 hu2 kou3"],"word":"養家糊口"},{"definition":["to give material assistance to"],"pinyin":["jie1 ji4"],"word":"接濟"},{"definition":["hard pressed for money\/in financial straits"],"pinyin":["jie2 ju1"],"word":"拮据"},{"definition":["to support one's family (idiom)"],"pinyin":["yang3 jia1 huo2 kou3"],"word":"養家活口"},{"definition":["to provide for\/to keep (animals, a family etc)\/to raise animals\/to feed and clothe\/support\/the necessities of life\/to give birth"],"pinyin":["yang3 huo5"],"word":"養活"},{"definition":["poor but upright\/destitute"],"pinyin":["qing1 pin2"],"word":"清貧"},{"definition":["lit. to eat off one's own strength (idiom)\/fig. to stand on one's own feet\/to earn one's own living"],"pinyin":["zi4 shi2 qi2 li4"],"word":"自食其力"},{"definition":["livelihood"],"pinyin":["sheng1 ji4"],"word":"生計"},{"definition":["family livelihood\/a household's economic situation\/family property"],"pinyin":["jia1 ji4"],"word":"家計"},{"definition":["income does not cover expenditure\/unable to make ends meet"],"pinyin":["ru4 bu4 fu1 chu1"],"word":"入不敷出"},{"definition":["to have enough food and warm clothes\/adequately provided"],"pinyin":["wen1 bao3"],"word":"溫飽"}]}