{"definition":["Dêgê county (Tibetan: sde dge rdzong) in Garze Tibetan autonomous prefecture 甘孜藏族自治州[Gan1 zi1 Zang4 zu2 zi4 zhi4 zhou1], Sichuan (formerly in Kham province of Tibet)"],"pinyin":["De2 ge2"],"simplified":["德格"],"rank":37186.0,"normalized_rank":0.5202803856001567,"fraction":4.973457747186029e-7,"cumulative_fraction":0.9952512000688228,"word":"德格","characters":[{"definition":["Germany\/German\/abbr. for 德國|德国[De2 guo2]","virtue\/goodness\/morality\/ethics\/kindness\/favor\/character\/kind"],"pinyin":["De2","de2"],"word":"德"},{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"}],"containing_words":[{"definition":["Dêgê county (Tibetan: sde dge rdzong) in Garze Tibetan autonomous prefecture 甘孜藏族自治州[Gan1 zi1 Zang4 zu2 zi4 zhi4 zhou1], Sichuan (formerly in Kham province of Tibet)"],"pinyin":["De2 ge2 xian4"],"word":"德格縣"},{"definition":["Martin Heidegger (1889-1976), German philosopher"],"pinyin":["Hai3 de2 ge2 er3"],"word":"海德格爾"},{"definition":["Van de Graaff (name)\/Robert J. Van de Graaff (1901-1967), American physicist"],"pinyin":["Fan4 de2 ge2 la1 fu1"],"word":"范德格拉夫"},{"definition":["Van de Graaff generator"],"pinyin":["Fan4 de2 ge2 la1 fu1 qi3 dian4 ji1"],"word":"范德格拉夫起電機"}],"sentences":[{"english":"Heidegger revealed the necessity for explicitly restating the question of Being.","chinese":"海德格的詮釋現象學揭露了重提存有問題的必要性。"},{"english":"Nonetheless he recognizes how far Heidegger’s ideas have spilled into the larger culture.","chinese":"不過他承認海德格爾思想已經波及到更大的文化。"},{"english":"Heidegger defines death as an impossible possibility while Levinas it a \"a possible impossibility\".","chinese":"海德格爾將死亡定義爲一種不可能的可能性。"},{"english":"Both Husserl and Heidegger have diagnosed the crisis of the contemporary.","chinese":"對於當代的危機，胡塞爾與海德格爾都曾做出過診斷。"},{"english":"The majority of callers asked for him to be removed.","chinese":"大多數的人現在要求解僱霍德格森。"},{"english":"This discussion also shows Satre's training in the phenomenology of Husserl and Heidegger.","chinese":"這次討論還表明薩特訓練胡塞爾與海德格爾的現象。"},{"english":"Heidegger said that people should live poetically in nature.","chinese":"海德格爾說過，人應該詩意地棲居在自然中。"},{"english":"The second chapter examines the art thought of Heidegger.","chinese":"第二章疏理了海德格爾的藝術之思。"},{"english":"Van de graaff generators are the current work horses of nuclear structure research .","chinese":"範德格喇夫加速器是研究原子結構的通用工具。"},{"english":"Heidegger has proposed that human experience in its original form is hermeneutically meaningful.","chinese":"海德格爾提出起初形式的人類存在是有解釋性意義的。"},{"english":"\"Ereignis\" is the key word of Heidegger's later philosophic thinking.","chinese":"“生成”是海德格爾後期哲學思想的主導詞語。"},{"english":"And then Heidegger says, you know what?","chinese":"然後海德格爾說，你知道嗎？"},{"english":"Passions about Heidegger have simmered for years.","chinese":"海德格爾的這種激情持續了很久。"},{"english":"Heidegger, , Buddhism, East-West-Culture, Tradition and Moderni.","chinese":"海德格爾，佛教思想，東西方文化，傳統與現代代。"},{"english":"Roy Hodgson becomes the new manager of Liverpool following the departure of Rafael Benitez.","chinese":"利物浦解僱了瘟胖，霍德格森成爲新教練。"},{"english":"We should look on human life existence as another noumenon, which is enlightened to us by Heidegger's aesthetics.","chinese":"海德格爾美學啓示我們應以人的生活存在爲本體。"}],"related":[{"definition":["Amdo county, Tibetan: A mdo rdzong, in Nagchu prefecture 那曲地區|那曲地区[Na4 qu3 di4 qu1], central Tibet"],"pinyin":["An1 duo1"],"word":"安多"},{"definition":["Lhozhag county, Tibetan: Lho brag rdzong, in Lhokha prefecture 山南地區|山南地区[Shan1 nan2 di4 qu1], Tibet"],"pinyin":["Luo4 zha1"],"word":"洛扎"},{"definition":["Gonjo county, Tibetan: Go 'jo rdzong, in Chamdo prefecture 昌都地區|昌都地区[Chang1 du1 di4 qu1], Tibet"],"pinyin":["Gong4 jue2"],"word":"貢覺"},{"definition":["Lhari county, Tibetan: Lha ri rdzong, in Nagchu prefecture 那曲地區|那曲地区[Na4 qu3 di4 qu1], central Tibet"],"pinyin":["Jia1 li2"],"word":"嘉黎"},{"definition":["to display\/to spread out\/to distribute\/old spelling of 盧布|卢布[lu2 bu4], ruble"],"pinyin":["luo2 bu4"],"word":"羅布"},{"definition":["Darlag or Dari county (Tibetan: dar lag rdzong) in Golog Tibetan autonomous prefecture 果洛州[Guo3 luo4 zhou1], Qinghai"],"pinyin":["Da2 ri4"],"word":"達日"},{"definition":["(onom.) laughing sound\/glug-glug haha!"],"pinyin":["ge2 le4"],"word":"格勒"},{"definition":["Rinbung county, Tibetan: Rin spungs rdzong, in Shigatse prefecture, Tibet"],"pinyin":["Ren2 bu4"],"word":"仁布"},{"definition":["Khampa, subdivision of Tibetan ethnic group\/former Tibetan province of Kham, now split between Tibet and Sichuan"],"pinyin":["Kang1 ba1"],"word":"康巴"},{"definition":["Zhongba county, Tibetan: 'Brong pa rdzong, in Shigatse prefecture, Tibet"],"pinyin":["Zhong4 ba1"],"word":"仲巴"},{"definition":["Madoi or Maduo county (Tibetan: rma stod rdzong) in Golog Tibetan autonomous prefecture 果洛州[Guo3 luo4 zhou1], Qinghai"],"pinyin":["Ma3 duo1"],"word":"瑪多"},{"definition":["Burang county in Ngari prefecture, Tibet, Tibetan: Spu hreng rdzong"],"pinyin":["Pu3 lan2"],"word":"普蘭"},{"definition":["Dechen county in Diqing Tibetan autonomous prefecture 迪慶藏族自治州|迪庆藏族自治州[Di2 qing4 Zang4 zu2 zi4 zhi4 zhou1], Yunnan (formerly in Kham province of Tibet)"],"pinyin":["De2 qin1"],"word":"德欽"},{"definition":["Riwoqê county, Tibetan: Ri bo che rdzong, in Chamdo prefecture 昌都地區|昌都地区[Chang1 du1 di4 qu1], Tibet"],"pinyin":["Lei4 wu1 qi2"],"word":"類烏齊"},{"definition":["Chur (city in Switzerland)"],"pinyin":["Ku4 er3"],"word":"庫爾"},{"definition":["guru (loanword)"],"pinyin":["gu3 lu3"],"word":"古魯"}]}