{"definition":["to have a clear conscience\/to have no qualms about sth"],"pinyin":["xin1 an1 li3 de2"],"simplified":["心安理得"],"rank":27250.0,"normalized_rank":0.3812628545044982,"fraction":0.0000012085487727899364,"cumulative_fraction":0.9873050572857072,"word":"心安理得","characters":[{"definition":["heart\/mind\/intention\/center\/core\/CL:顆|颗[ke1],個|个[ge4]"],"pinyin":["xin1"],"word":"心"},{"definition":["content\/calm\/still\/quiet\/safe\/secure\/in good health\/to find a place for\/to install\/to fix\/to fit\/to bring (a charge against sb)\/to pacify\/to harbor (good intentions)\/security\/safety\/peace\/ampere","surname An"],"pinyin":["An1","an1"],"word":"安"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[],"sentences":[{"english":"It was many years before Skywalker felt comfortable enough to take on students.","chinese":"很多年以後，天行者才心安理得地開始收徒。"},{"english":"Make the decision that is right for the largest number of people.","chinese":"要做對儘可能多的人心安理得的決定。"},{"english":"Mrs. Butler was sitting in rotund complacency at the foot of the table.","chinese":"巴特勒太太心安理得地坐在桌子的末端。"},{"english":"When in school, they spend their parnets'money without any execuse.","chinese":"上學時心安理得地花着家裏的錢。"},{"english":"Don't take water or “Elixir” for granted.","chinese":"不要將水或“聖泉”視爲心安理得之物。"},{"english":"Mr Aboutaam also says the statue was bought in good faith.","chinese":"雅博達姆也表示，他當時買下這尊雕塑時也心安理得。"},{"english":"If you want to be at peace with yourself, return the stolen money to the store.","chinese":"如果你想心安理得那就把偷來的前還回店家。"},{"english":"\"That was just something for evening wear, \" returned his wife complacently.","chinese":"“那套衣服是晚裝，”他妻子心安理得地說道。"},{"english":"Xiong Jiujiu to walk, and with a clear conscience go play.","chinese":"雄糾糾地走了，心安理得地玩樂去了。"}],"related":[{"definition":["delighted to (do sth, idiom)\/perfectly happy to do\/most willing to do"],"pinyin":["xin1 gan1 qing2 yuan4"],"word":"心甘情願"},{"definition":["in the right and self-confident (idiom); bold and confident with justice on one's side\/to have the courage of one's convictions\/just and forceful"],"pinyin":["li3 zhi2 qi4 zhuang4"],"word":"理直氣壯"},{"definition":["as it should be by rights (idiom); proper and to be expected as a matter of course\/inevitable and right"],"pinyin":["li3 suo3 dang1 ran2"],"word":"理所當然"},{"definition":["to reap where one has not sown (idiom)"],"pinyin":["zuo4 xiang3 qi2 cheng2"],"word":"坐享其成"},{"definition":["variant of 花招[hua1 zhao1]"],"pinyin":["hua1 zhao1"],"word":"花著"},{"definition":["to have no sense of shame"],"pinyin":["tian2 bu4 zhi1 chi3"],"word":"恬不知恥"},{"definition":["perfectly contented (idiom)\/perfectly satisfied"],"pinyin":["xin1 man3 yi4 zu2"],"word":"心滿意足"},{"definition":["calm\/undisturbed"],"pinyin":["tan3 ran2"],"word":"坦然"},{"definition":["to speak forcefully and with justice (idiom); to argue with the courage of one's convictions"],"pinyin":["zhen4 zhen4 you3 ci2"],"word":"振振有詞"},{"definition":["free and at leisure (idiom); unfettered\/outside the reach of the law (of criminal)\/at large"],"pinyin":["xiao1 yao2 zi4 zai5"],"word":"逍遙自在"},{"definition":["willingly and gladly (idiom)"],"pinyin":["gan1 xin1 qing2 yuan4"],"word":"甘心情願"},{"definition":["lit. as sweet as syrup (idiom, from Book of Songs); to endure hardship gladly\/a glutton for punishment"],"pinyin":["gan1 zhi1 ru2 yi2"],"word":"甘之如飴"},{"definition":["confident\/calm\/natural\/poised"],"pinyin":["da4 da4 fang1 fang1"],"word":"大大方方"},{"definition":["lit. heaven's law and earth's principle (idiom); fig. right and proper\/right and unalterable\/a matter of course"],"pinyin":["tian1 jing1 di4 yi4"],"word":"天經地義"},{"definition":["to find amusement in one's own way\/to enjoy oneself quietly"],"pinyin":["zi4 de2 qi2 le4"],"word":"自得其樂"},{"definition":["just and honorable"],"pinyin":["zheng4 da4 guang1 ming2"],"word":"正大光明"}]}