{"definition":["to harbor (thoughts)\/to cherish\/to entertain (illusions)"],"pinyin":["xin1 huai2"],"simplified":["心怀"],"rank":23139.0,"normalized_rank":0.3237446308396177,"fraction":0.0000017591763813131443,"cumulative_fraction":0.9812840544536324,"word":"心懷","characters":[{"definition":["heart\/mind\/intention\/center\/core\/CL:顆|颗[ke1],個|个[ge4]"],"pinyin":["xin1"],"word":"心"},{"definition":["bosom\/heart\/mind\/to think of\/to harbor in one's mind\/to conceive (a child)","surname Huai"],"pinyin":["Huai2","huai2"],"word":"懷"}],"containing_words":[{"definition":["see 居心叵測|居心叵测[ju1 xin1 po3 ce4]"],"pinyin":["xin1 huai2 po3 ce4"],"word":"心懷叵測"}],"sentences":[{"english":"The unsatisfied workers are rioting in the streets.","chinese":"心懷不滿的工人們在大街上鬧事。"},{"english":"Readhead believes that, despite their best intentions, parents can be obstacles.","chinese":"瑞德赫德相信，就算心懷好意，家長也可能成爲阻礙。"},{"english":"The purposes of a man's heart are deep waters, but a man of understanding draws them out.","chinese":"人心懷藏謀略，好像水深，惟明哲人才能汲引出來。"},{"english":"Keep only cheerful friends. The grouches pull you down.","chinese":"與快樂的人爲友，心懷不滿的人會讓你消沉。"},{"english":"Here are the young men then, a weight on their shoulders, but love in their hearts.","chinese":"就是這羣年輕人，肩負重任，心懷夢想。"},{"english":"And it shows just how prejudiced we can be about asylum-seekers.","chinese":"它顯示出我們對尋求政治避難者多麼的心懷偏見。"},{"english":"Feeling bitterness and resentment growing toward your partner?","chinese":"開始對你的另一半心懷怨恨與不平？"},{"english":"We commemorate the tough and affordable red, blue, and white bags used by workers and movers around the world.","chinese":"我們對勞動人民使用過的紅藍白膠袋心懷敬意。"},{"english":"At his wedding to Lorna, a vindictive Carver shoots the bride.","chinese":"在他與羅娜的婚禮上，心懷怨恨的卡弗射殺了新娘。"},{"english":"The trees extend their loose sleeves and open wide their hearts warm-ly to greet me.","chinese":"樹木舒展廣袖，放開心懷，熱情地向我招手致意。"},{"english":"Double-minded men are strangers to the God of truth.","chinese":"真理的上帝不與心懷二意的人相交。"},{"english":"A: Life is too short to hold grudges.","chinese":"人生苦短，何須心懷怨恨。"},{"english":"I found it hard not to regard them with awe.","chinese":"我發現自己很難不對他們心懷敬畏。"},{"english":"He grudged me my success.","chinese":"他一直對我心懷嫉妒。"},{"english":"The first scenario looks at a situation in which a disgruntled employee is the attacker.","chinese":"第一種方案研究的是攻擊者是心懷不滿的僱員的情況。"},{"english":"I harbor no malice toward him for what he has done.","chinese":"對於他所做的事，我並沒有心懷惡意。"}],"related":[]}