{"definition":["attitude (of the heart)\/state of one's psyche\/way of thinking\/mentality"],"pinyin":["xin1 tai4"],"simplified":["心态"],"rank":2534.0,"normalized_rank":0.03545394764456508,"fraction":0.0000587168728079287,"cumulative_fraction":0.7660031856087309,"word":"心態","characters":[{"definition":["heart\/mind\/intention\/center\/core\/CL:顆|颗[ke1],個|个[ge4]"],"pinyin":["xin1"],"word":"心"},{"definition":["(bound form)\/appearance\/shape\/form\/state\/attitude\/(grammar) voice"],"pinyin":["tai4"],"word":"態"}],"containing_words":[],"sentences":[{"english":"The happy and the disaster are in together at anytime, we should accept it with normal attitude.","chinese":"任何時候禍福都是並存的，我們要放平心態去接受。"},{"english":"Are there any points of resistance to this process of shifting people’s mindsets?","chinese":"有沒有對改變人們心態進程表示反對的意見呢？"},{"english":"The conflict between primitivism and anti - primitivism forms the contrary leading attitudes.","chinese":"原始和反原始構成其互爲悖反的主導心態。"},{"english":"Without them I would not have led a healthy, balanced life.","chinese":"沒有他們，我不可能過着健康的心態平衡的生活。"},{"english":"You can break through and challenge your crystallized patterns and mind-sets.","chinese":"你可以突破和挑戰你的固化模式和心態。"},{"english":"The first one probes into intellectual psychology of Sun li in liberated area of period mainly.","chinese":"第一章主要探討孫犁在解放區時期的知識分子心態。"},{"english":"It is because of this kind of optimistic, not afraid difficulty mentality.","chinese":"正是由於這種樂觀積極，不懼困難的心態。"},{"english":"Fortune and misfortune are existence together in anytime , we should accept it with our normal attitude .","chinese":"任何時候禍福都是並存的，我們要放平心態去接受。"},{"english":"That's the way we have to be in every single game.","chinese":"我們每場比賽都得保持這樣的心態。"},{"english":"Helin, with a positive attitude welcomes the European and American are welcome to Western from the east.","chinese":"賀麟以積極的心態歡迎歐風美雨，歡迎西學東來。"},{"english":"This supercilious attitude relegates me to the level of the commonplace.","chinese":"這種目空一切的心態把我歸入大路貨的檔次。"},{"english":"Joyfulness keeps the heart and face young.","chinese":"歡樂能夠讓心態和容顏保持年輕。"},{"english":"And the attachment to the country mainly manifests in patriotic like family.","chinese":"對國家的依戀集中體現在愛國如家心態上。"},{"english":"It cannot be at war with a peacetime mind-set.","chinese":"不能以和平時期的心態參戰。"},{"english":"This is an attitude where, for example, satisfaction and dissatisfaction co-exist.","chinese":"這是一種滿意與不滿共存的心態。"},{"english":"We should have the state of mind of the service, want the link that innovates with consumer.","chinese":"我們應該有服務的心態，要和消費者創新的連接。"}],"related":[{"definition":["manner\/bearing\/attitude\/approach\/CL:個|个[ge4]"],"pinyin":["tai4 du5"],"word":"態度"},{"definition":["immediately\/at once\/at that moment\/at the moment"],"pinyin":["dang1 xia4"],"word":"當下"},{"definition":["regarding\/as far as sth is concerned\/with regards to"],"pinyin":["dui4 yu2"],"word":"對於"},{"definition":["(bound form)\/appearance\/shape\/form\/state\/attitude\/(grammar) voice"],"pinyin":["tai4"],"word":"態"},{"definition":["state of affairs\/state\/mode\/situation\/CL:個|个[ge4]"],"pinyin":["zhuang4 tai4"],"word":"狀態"},{"definition":["society\/CL:個|个[ge4]"],"pinyin":["she4 hui4"],"word":"社會"},{"definition":["system of values"],"pinyin":["jia4 zhi2 guan1"],"word":"價值觀"},{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["to confront\/to face"],"pinyin":["mian4 dui4"],"word":"面對"},{"definition":["notion\/thought\/concept\/sense\/views\/ideology\/general impressions"],"pinyin":["guan1 nian4"],"word":"觀念"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"畢竟"},{"definition":["(line of) thought\/thinking"],"pinyin":["si1 wei2"],"word":"思維"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"認為"},{"definition":["relation\/relationship\/to concern\/to affect\/to have to do with\/guanxi\/CL:個|个[ge4]"],"pinyin":["guan1 xi5"],"word":"關係"},{"definition":["mood\/state of mind\/moodiness\/CL:種|种[zhong3]"],"pinyin":["qing2 xu4"],"word":"情緒"},{"definition":["in a word\/in short\/in brief"],"pinyin":["zong3 zhi1"],"word":"總之"}]}