{"definition":["atrial fibrillation"],"pinyin":["xin1 fang2 chan4 dong4"],"simplified":["心房颤动"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"心房顫動","characters":[{"definition":["heart\/mind\/intention\/center\/core\/CL:顆|颗[ke1],個|个[ge4]"],"pinyin":["xin1"],"word":"心"},{"definition":["house\/room\/CL:間|间[jian1]\/branch of an extended family\/classifier for family members (or concubines)","surname Fang"],"pinyin":["Fang2","fang2"],"word":"房"},{"definition":["to tremble\/to shiver\/to shake\/to vibrate\/Taiwan pr. [zhan4]"],"pinyin":["chan4"],"word":"顫"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"}],"containing_words":[],"sentences":[{"english":"Warfarin is the better choice in the anticoagulative treatment of atrial fibrillation.","chinese":"而華法令是目前心房顫動抗凝較好的選擇。"},{"english":"Objective To ascertain the relevance of KCNE1 gene and lone atrial fibrillation.","chinese":"目的探討KCNE1基因與孤立性心房顫動的關係。"},{"english":"The attack of AF has its fundamental cause and trigger.","chinese":"心房顫動的發生常有其基礎病因和促發因素。"},{"english":"Focal atrial fibrillation treated by circumferential radiofrequency catheter ablation of pulmonary vein orifice.","chinese":"導管射頻肺靜脈口環狀消融治療局竈性心房顫動。"},{"english":"Nonpharmacologic atrial fibrillation therapies include surgery and catheter ablation.","chinese":"心房顫動的非藥物治療包括外科手術和導管消融。"},{"english":"Conclusion The left atrium enlargement is related to atrial fibrillation.","chinese":"結論左心房增大與心房顫動有密切關係。"},{"english":"The risk of stroke in patients with atrial fibrillation is about double that in the general population.","chinese":"中風的風險在心房顫動患者約一倍，在一般人口中。"},{"english":"The study did observe a small increase in the incidence of atrial fibrillation (AF) in patients who received zoledronic acid.","chinese":"觀察到這種療法心房顫動的可能性稍有增加。"},{"english":"Methods Electrocardiograms of 100 patients with Af and wide QRS were analyzed.","chinese":"方法分析100例心房顫動伴寬QRS波羣的心電圖。"},{"english":"Studies of the Relations Between Symptoms and Ambulatory Electrocardiography in the Patients With Atiral Fibrillation.","chinese":"心房顫動患者臨牀症狀與動態心電變化的關係探討。"},{"english":"Conclusion KCNE1 gene is not related to lone atrial fibrillation.","chinese":"結論KCNE1基因與孤立性心房顫動的發病無關。"}],"related":[]}