{"definition":["inevitably"],"pinyin":["bi4 jiang1"],"simplified":["必将"],"rank":4503.0,"normalized_rank":0.06300281225078001,"fraction":0.000028023325028685118,"cumulative_fraction":0.8460598570663904,"word":"必將","characters":[{"definition":["certainly\/must\/will\/necessarily"],"pinyin":["bi4"],"word":"必"},{"definition":["general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead","to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])"],"pinyin":["jiang1","jiang4","qiang1"],"word":"將"}],"containing_words":[],"sentences":[{"english":"This process will certainly open up broad prospects for theoretical innovation.","chinese":"這一過程必將爲理論創新開闢廣闊前景。"},{"english":"The Lord your God will drive those nations out ahead of you little by little. You will not clear them away all at once .... Deuteronomy 7:22","chinese":"耶和華你們的神必將這些國的民從你面前漸漸趕出。"},{"english":"\"Cotton garment, apparels and even knitwear exports will improve, \" Mr Rajagopal said.","chinese":"印度棉質服裝出口量必將呈現上升趨勢。"},{"english":"The day necessarily will become a pillars just, don't know two how under the idea?","chinese":"日必將成爲棟樑之才，不知二位意下如何？"},{"english":"Grid-Connected PV System will be the new trend among PV applications.","chinese":"光伏併網發電系統也必將成爲光伏發展的新趨勢。"},{"english":"Thou shalt dash them in pieces like a potter's vessel .","chinese":"你必將他們如同窯匠的瓦器摔碎。"},{"english":"And the LORD said unto David, Go up: for I will doubtless deliver the Philistines into thine hand.","chinese":"耶和華說，你可以上去，我必將非利士人交在你手裏。"},{"english":"And it seemed that without a miracle, America's fight for freedom would be doomed.","chinese":"看起來不會有奇蹟了，美國的爲自由而戰必將勝利。"},{"english":"The coming of automation is bound tohave important social consequences.","chinese":"自動化的實現必將產生重大的社會影響。"},{"english":"The development of network teaching is necessarily to drive the innovation in hist …","chinese":"網絡教學的發展與普及必將帶動高中歷史教學的改革。"},{"english":"Desktop computer will be must develop toward fixable location and requirement way.","chinese":"臺式電腦也必將朝着固化位置與需求的方向發展。"},{"english":"Whoms in sin shall sink in sorrow.","chinese":"在罪惡中游泳的人，必將在悲哀中沈沒。"},{"english":"The shaft sleeve and mechanical seal can be replaced without removing the shaft from the pump.","chinese":"軸套和機封的更換不必將軸從泵上拆下來。"},{"english":"He that speaketh sophistically, is hateful: he shall be destitute of every thing.","chinese":"有的人詭辯，出言可惡，他必將缺乏各種食物。"},{"english":"The implementation of the law of brain death will pr…","chinese":"實施腦死亡法必將大大促進我國肝臟移植水平的提高。"},{"english":"He that trusts in alie shall perish in truth.","chinese":"置信謊言的人必將在過失前消亡。"}],"related":[]}