{"definition":["inevitable outcome\/inescapable consequence"],"pinyin":["bi4 ran2 jie2 guo3"],"simplified":["必然结果"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"必然結果","characters":[{"definition":["certainly\/must\/will\/necessarily"],"pinyin":["bi4"],"word":"必"},{"definition":["correct\/right\/so\/thus\/like this\/-ly"],"pinyin":["ran2"],"word":"然"},{"definition":["(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]","knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)"],"pinyin":["jie1","jie2"],"word":"結"},{"definition":["fruit\/result\/resolute\/indeed\/if really"],"pinyin":["guo3"],"word":"果"}],"containing_words":[],"sentences":[{"english":"A corollary of that is I hate flag waving.","chinese":"以上導致的必然結果是，我討厭國旗揮舞。"},{"english":"The last is centralization, which is a general trend of English development.","chinese":"五是一元化，這將是英語發展的必然結果。"},{"english":"In fact the literature of Wuzhong is the inevitable outcome of the Chinese literature.","chinese":"其實，吳中文學乃中國文學史發展之必然結果。"},{"english":"Weaponry is the crystallization of the defense-related science and technology.","chinese":"以多種方式實現技術轉移，是技術進步的必然結果。"},{"english":"The variety in retail results from the dramatical development in retail trade.","chinese":"業態多樣化是零售業迅猛發展的必然結果。"},{"english":"Educational ecologicalization is inevitable result of the development of social ecologicalization.","chinese":"教育生態化是社會生態化發展的必然結果。"},{"english":"Therefore, the phenomenon of Fang, Hui's case is an inevitable result of Nan Song stale culture.","chinese":"方回降元是陳腐的南宋文化的必然結果。"},{"english":"Again and again the final word in the development of banking is monopoly.","chinese":"實踐反覆證明，銀行業發展的必然結果是壟斷。"},{"english":"Cities and urbanization are the inevitable result of social developmet while embodying.","chinese":"城市和城市化是社會發展的必然結果。"},{"english":"The rise of the anti-utopia thoughts is the inevitable consequence of modernity.","chinese":"反烏托邦思想的出現是現代性的必然結果。"},{"english":"However, the loss of government publicity will be the inevitable outcome of powerful government and weak society.","chinese":"政府公共性的喪失是強政府弱社會的必然結果。"},{"english":"And it was also the inevitable outcome of Confucian doctrine of human nature.","chinese":"又是儒家人性論思想自身發展的必然結果。"},{"english":"Mechatronics is the inevitable result of the development of modern science and technology.","chinese":"機電一體化是現代科學技術發展的必然結果。"},{"english":"But the occurrence of the calligraphy style is also the inevitable result which the font continues to evolve.","chinese":"而書體的發生又是書風持續衍變的必然結果。"},{"english":"The appearance of interdisciplinary sciences is the necessary result of scientific development.","chinese":"交叉科學的出現是科學發展的必然結果。"},{"english":"Falling prices would be a natural outcome of China's frenetic pace of homebuilding.","chinese":"房價下跌是中國狂熱住宅建設的必然結果。"}],"related":[]}