{"definition":["to develop rapidly after abrupt turn (idiom); dramatic change"],"pinyin":["ji2 zhuan3 zhi2 xia4"],"simplified":["急转直下"],"rank":27184.0,"normalized_rank":0.3803394288752396,"fraction":0.0000012174534080285143,"cumulative_fraction":0.9872249948344114,"word":"急轉直下","characters":[{"definition":["urgent\/pressing\/rapid\/hurried\/worried\/to make (sb) anxious"],"pinyin":["ji2"],"word":"急"},{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["straight\/to straighten\/fair and reasonable\/frank\/straightforward\/(indicates continuing motion or action)\/vertical\/vertical downward stroke in Chinese characters","surname Zhi\/Zhi (c. 2000 BC), fifth of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God"],"pinyin":["Zhi2","zhi2"],"word":"直"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[{"english":"Tan said since Li took over the magazine's management, its circulation had seen a sharp drop.","chinese":"譚楷說，自從李昶執掌了雜誌之後，發行量急轉直下。"},{"english":"The credit crunch last year brought a reversal of fortune.","chinese":"但去年的信貸危機使得冰島命運急轉直下。"},{"english":"The Heavenly Famous Garden complex shows how quickly the market has run into a wall.","chinese":"天時名苑樓盤顯示了樓市是如何的急轉直下。"},{"english":"The stock market turned down sharply.","chinese":"股票市場行情急轉直下。"},{"english":"The military on the front went swiftly ahead.","chinese":"前方的軍事局勢急轉直下。"}],"related":[]}