{"definition":["nature (i.e. properties of sth)\/character"],"pinyin":["xing4 zhuang4"],"simplified":["性状"],"rank":34508.0,"normalized_rank":0.4828116911281184,"fraction":6.331049677001998e-7,"cumulative_fraction":0.9937442330288576,"word":"性狀","characters":[{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"},{"definition":["accusation\/suit\/state\/condition\/strong\/great\/-shaped"],"pinyin":["zhuang4"],"word":"狀"}],"containing_words":[],"sentences":[{"english":"By recognizing the changing characteristics of your cervical mucus, you can predict when you'll ovulate.","chinese":"通過認識到宮頸粘液性狀的改變，可以預測排卵時間。"},{"english":"A quantitative analysis of the variation pattern of characters of the Viola variegata complex.","chinese":"斑葉堇菜種宗性狀變異式樣的定量分析。"},{"english":"Correlation and path analysis for 16 traits of Kosteletzkya virginica was carried out.","chinese":"對海濱錦葵的16個數量性狀進行了相關和通徑分析。"},{"english":"Field tests of influences of working load on negative skin friction behaviors were introduced.","chinese":"進行了樁頂荷載對於負摩阻力性狀影響的現場試驗。"},{"english":"Jinhui12 is an excellent parental candidate in improving the characteristic of neck-panicle vascular bundles.","chinese":"縉恢12號是改良穗頸維管束性狀的優良親本。"},{"english":"Dwarf is one of the major target traits in soybean breeding.","chinese":"矮稈是大豆育種的重要目標性狀之一。"},{"english":"Bigger correlation coefficients can be obtained by the broad heritability method.","chinese":"按廣義遺傳力法選用研究性狀則相關係數大。"},{"english":"Preliminary inheritance results show that only one pair of recessive nuclear genes control the Pmw trait.","chinese":"經初步遺傳分析，該乳白花性狀由單隱性核基因控制。"},{"english":"The experimental procedure of the genetic analysis for endosperm qualitative-quantitative characters is presented.","chinese":"文中給出了進行此類性狀遺傳分析的實驗程序。"},{"english":"During the experiment, there were significant changes in each cell. Inoculated sludge was black.","chinese":"試驗過程中，各隔室污泥性狀發生了明顯的改變。"},{"english":"The bearing capacity behavoir of foundation is studied from different ang…","chinese":"即從不同角度探討了複合地基的承力性狀。"},{"english":"Rats of the traits that depend on the source of the nucleus.","chinese":"說明仔鼠的性狀取決於細胞核的來源。"},{"english":"Leaf inner-rolling is one of the most morphological characters in plant breeding at present.","chinese":"水稻正卷葉性狀是目前株型育種的目標之一。"},{"english":"The order of variation coefficient of phenotypic were leaf, body size, flower and fruit.","chinese":"各性狀變異係數的大小次序爲葉＞樹體＞花＞果。"},{"english":"Preliminary research indicates that genetic engineering approaches could be employed to enhance both these traits.","chinese":"初步研究表明基因工程的方法可用來增加這兩中性狀。"},{"english":"The two traits of the male sterility and brown paddy hull are inherited independently.","chinese":"雄性不育性與褐色穎殼兩個性狀屬獨立遺傳。"}],"related":[{"definition":["organism"],"pinyin":["sheng1 wu4 ti3"],"word":"生物體"},{"definition":["usable value"],"pinyin":["shi3 yong4 jia4 zhi2"],"word":"使用價值"},{"definition":["to interpret (a visual document, a medical exam, an historical event etc)\/to analyze data (from a chip, a black box etc)"],"pinyin":["pan4 du2"],"word":"判讀"},{"definition":["geometry"],"pinyin":["ji3 he2 xue2"],"word":"幾何學"},{"definition":["fruit fly"],"pinyin":["guo3 ying2"],"word":"果蠅"},{"definition":["biochemistry"],"pinyin":["sheng1 hua4 xue2"],"word":"生化學"},{"definition":["micro-\/microscopic\/to make the minute visible"],"pinyin":["xian3 wei1"],"word":"顯微"},{"definition":["specific\/specificity\/idiosyncrasy"],"pinyin":["te4 yi4 xing4"],"word":"特異性"},{"definition":["environmental factor"],"pinyin":["huan2 jing4 yin1 su4"],"word":"環境因素"},{"definition":["benign tumor"],"pinyin":["liang2 xing4 zhong3 liu2"],"word":"良性腫瘤"},{"definition":["transition"],"pinyin":["guo4 du4 shi2 qi1"],"word":"過渡時期"},{"definition":["qualified word"],"pinyin":["zhong1 xin1 yu3"],"word":"中心語"},{"definition":["tranquilizer"],"pinyin":["zhen4 jing4 ji4"],"word":"鎮靜劑"},{"definition":["complementary item"],"pinyin":["bu3 chong1 pin3"],"word":"補充品"},{"definition":["holistic diagnosis and treatment (TCM)"],"pinyin":["bian4 zheng4 lun4 zhi4"],"word":"辨證論治"},{"definition":["material evidence"],"pinyin":["wu4 zheng4"],"word":"物證"}]}