{"definition":["no wonder!\/so that's why!"],"pinyin":["guai4 bu5 de5"],"simplified":["怪不得"],"rank":24122.0,"normalized_rank":0.3374980761966057,"fraction":0.0000016063378059887015,"cumulative_fraction":0.9829356248870827,"word":"怪不得","characters":[{"definition":["bewildering\/odd\/strange\/uncanny\/devil\/monster\/to wonder at\/to blame\/quite\/rather"],"pinyin":["guai4"],"word":"怪"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[],"sentences":[{"english":"It tur out that you are Mr. Ford's son. No wonder you are the very image of him.","chinese":"原來你是福特先生的公子，怪不得長得那麼象他。"},{"english":"No wonder the banana is the number one fruit with the world\\\\\\'s leading athletes.","chinese":"怪不得香蕉能夠成爲世界頂級運動員的首選水果。"},{"english":"No wonder parents agonise over what names to give their babies.","chinese":"怪不得父母們爲給寶寶們取什麼名字而苦苦思索。"},{"english":"It turns out that you are Mr. David's son. No wonder you are the very image of him.","chinese":"原來你是大衛先生的公子，怪不得長得那麼象他。"},{"english":"It seems that cash should not be treated in that way since our disdain has nothing to do with money.","chinese":"既然看不上，與金錢無緣，好像也怪不得銅錢了。"},{"english":"No wonder Chen Damei says \"there would not be me without Mr. Tang\".","chinese":"怪不得陳大妹要說“莫得唐大爺就莫得我噻”這句話。"},{"english":"No wonder they had something in common.","chinese":"也怪不得他們會有一點點”志同道合“。"},{"english":"May be she is the stunner of the world.","chinese":"怪不得她被評爲世界上最性感的女人呢。"},{"english":"No wonder the Red Flag Canal is called the Great Water Wall of China.","chinese":"怪不得紅旗渠被稱爲中國的水長城啊。"},{"english":"I am no longer surprised at your knowing only six accomplished women.","chinese":"怪不得你只認識六個才女啦。"},{"english":"No surprise that emperor Cha Jie so of fret oneself.","chinese":"怪不得帝剎桀那樣的擔心自己。"},{"english":"It's no wonder that quality sleep is sometimes elusive.","chinese":"因此怪不得高質量的睡眠有時候很難以理解的。"},{"english":"No wonder you're so experienced you have worked here for ten years.","chinese":"怪不得你這麼有經蚜宮你在這裏已經工作10年了。"},{"english":"You wonder why the ocean is so salty…","chinese":"丫丫的，怪不得海水這麼鹹了。"},{"english":"Small wonder that Britain's market for ready-made convenience foods has doubled in the last five years.","chinese":"怪不得英國市場的便利熟食在過去五年裏增長了一倍。"},{"english":"Japan work culture for you - no wonder there's a shortage of talent.","chinese":"這就是日本的工作文化，怪不得這裏人才缺失呢。"}],"related":[{"definition":["(it's) no wonder (that...)\/(it's) not surprising (that)"],"pinyin":["nan2 guai4"],"word":"難怪"},{"definition":["really\/sure enough\/as expected\/if indeed"],"pinyin":["guo3 ran2"],"word":"果然"},{"definition":["really\/as expected\/sure enough\/if indeed...\/if it's really..."],"pinyin":["guo3 zhen1"],"word":"果真"},{"definition":["to be worthy of\/to deserve to be called\/to prove oneself to be"],"pinyin":["bu4 kui4"],"word":"不愧"},{"definition":["Is it possible that ... ?"],"pinyin":["nan2 bu4 cheng2"],"word":"難不成"},{"definition":["if it were not for\/but for"],"pinyin":["yao4 bu5 shi4"],"word":"要不是"},{"definition":["to take seriously\/serious\/No joking, really!"],"pinyin":["dang4 zhen1"],"word":"當真"},{"definition":["can it be possible that\/could it be"],"pinyin":["mo4 fei1"],"word":"莫非"},{"definition":["unexpected\/hard to imagine\/it had not occurred to me\/who could have thought that"],"pinyin":["xiang3 bu5 dao4"],"word":"想不到"},{"definition":["to click one's tongue"],"pinyin":["ze2 ze2"],"word":"嘖嘖"},{"definition":["don't tell me ...\/could it be that...?"],"pinyin":["nan2 dao4"],"word":"難道"},{"definition":["unexpectedly\/to one's surprise\/go so far as to"],"pinyin":["ju1 ran2"],"word":"居然"},{"definition":["no wonder (that...)"],"pinyin":["wu2 guai4 hu1"],"word":"無怪乎"},{"definition":["actually\/as it turns out\/indeed\/of course"],"pinyin":["gan3 qing5"],"word":"敢情"},{"definition":["hey!\/(interjection used to attract attention or to express surprise or disapprobation)"],"pinyin":["ai1"],"word":"哎"},{"definition":["otherwise\/or else\/or"],"pinyin":["yao4 bu4 ran2"],"word":"要不然"}]}