{"definition":["thermostat"],"pinyin":["heng2 wen1 qi4"],"simplified":["恒温器"],"rank":64366.0,"normalized_rank":0.9005638492857443,"fraction":1.8539158611465384e-8,"cumulative_fraction":0.9999426525433138,"word":"恆溫器","characters":[{"definition":["permanent\/constant\/fixed\/usual\/ordinary\/rule (old)\/one of the 64 hexagrams of the Book of Changes (䷟)","surname Heng"],"pinyin":["Heng2","heng2"],"word":"恆"},{"definition":["surname Wen","warm\/lukewarm\/temperature\/to warm up\/mild\/soft\/tender\/to review (a lesson etc)\/fever (TCM)\/old variant of 瘟[wen1]"],"pinyin":["Wen1","wen1"],"word":"溫"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[],"sentences":[{"english":"A dewar tube with vacuum multi-layer insulated material is described in the paper.","chinese":"介紹了一種採用真空多層絕熱材料製作的恆溫器。"},{"english":"The cam member operably connects a temperature control knob to the thermostat.","chinese":"凸輪元件把一個溫度控制旋鈕可操作地連接於恆溫器。"},{"english":"The thermostat on the balcony's doorpost?","chinese":"這條陽臺門柱上的恆溫器？"},{"english":"Spend time shopping for the right mattress and pillow, and adjust your thermostat to the best temperature for you.","chinese":"購買合適的牀墊和枕頭，將恆溫器調到最適合的溫度。"},{"english":"Yesterday, our thermostat read 59 at 1 PM.","chinese":"昨天，我們的恆溫器讀取下午1點59。"},{"english":"Consider a programmable thermostat to raise and lower the temperature at pre-set times.","chinese":"使用可編程的恆溫器以便在預設的時間自動升降溫。"},{"english":"Millions of homes are stillequipped with manual thermostats.","chinese":"數百萬家庭仍在使用手動恆溫器。"},{"english":"They\"ll quickly adjust her thermostat to high heat.","chinese":"他們會很快調整自己恆溫器到高熱量。"},{"english":"Turn off your thermostat when you’re not home.","chinese":"當你不在家的時候關掉恆溫器。"},{"english":"For energy-efficient thermal management, a thermostatic fan control option is available.","chinese":"在節能熱管理方面可以使用恆溫器風扇控制項。"},{"english":"It is, after all, a thermostat.","chinese":"因爲這畢竟只是一款恆溫器。"},{"english":"You can regulate the temperature in the house by adjusting the thermostat and radiators.","chinese":"通過調節恆溫器和散熱器你可以調節屋內溫度。"},{"english":"Carbon dioxide is the planet's thermostat.","chinese":"二氧化碳是地球的恆溫器。"},{"english":"The more advanced programmable thermostats are difficult to use and require constant adjustments.","chinese":"高級的可編程恆溫器很難使用而且需要不斷配置。"},{"english":"You should \/ ought to turn down your thermostat to save energy.","chinese":"你應該調低恆溫器來節約能源。"},{"english":"The thermostat is nothing more than an electric switch that opens and closes itself at the proper temperature.","chinese":"恆溫器只不過是一種到達適當溫度就自動開關的電閘。"}],"related":[]}