{"definition":["wishing one could do sth\/to hate to be unable\/itching to do sth"],"pinyin":["hen4 bu5 de5"],"simplified":["恨不得"],"rank":16116.0,"normalized_rank":0.2254837491080548,"fraction":0.0000036243325197280516,"cumulative_fraction":0.9633633448021068,"word":"恨不得","characters":[{"definition":["to hate\/to regret"],"pinyin":["hen4"],"word":"恨"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[],"sentences":[{"english":"Standing there in the office, miserable, I wanted to vanish into the paneling.","chinese":"我傷心地站在辦公室門口，恨不得消失在門縫裏。"},{"english":"Sam longed for the oblivion of sleep.","chinese":"薩姆恨不得一睡不醒，了無心事。"},{"english":"More over, when a woman wants to have a romantic relationship, men should come, and they would.","chinese":"想到此恨不得中國人口男女比例再失調些。"},{"english":"When I saw this tree, I wanted to kick it out of the door and down the street.","chinese":"我一看到這棵樹，就恨不得把它踹出門滾到大街上。"},{"english":"He couldn t see his girlfriend fast enough.","chinese":"他恨不得馬上見到他的女朋友。"},{"english":"Standing there in the office, miserable, I wanted to vanish into the paneling .","chinese":"我傷心地站在辦公室門口，恨不得消失在門縫裏。"},{"english":"Madam's facial expression of that Liu's mansion heaves red, quite anxious to seek a ground aperture to drill into.","chinese":"那劉府的夫人臉色漲紅，恨不得找個地洞鑽進去。"},{"english":"Soon my arm was about a mile down the heat vent.","chinese":"很快我的手臂就恨不得向暖風管裏伸進去一里地。"},{"english":"Kibo: good, Can't wait to see them.","chinese":"好的，恨不得馬上就看到。"},{"english":"How I wish I could go there right now.","chinese":"我恨不得馬上去那兒。"},{"english":"Liu Qing hates not immediately said would accept the job.","chinese":"劉清恨不得馬上就說願意接受這份工作。"},{"english":"After long journey, we wish once red-hot water bath.","chinese":"經過長途跋涉，大家恨不得立刻衝個熱水澡。"},{"english":"I plastered myself to the wall, hoping to disappear into shadow.","chinese":"我緊緊地貼着牆，恨不得能夠消失在陰影當中。"},{"english":"Sometimes I wish I was a hobo.","chinese":"哼，我真恨不得去當個流浪漢。"},{"english":"In times of need, Japanese say they can even ask the cat for help.","chinese":"在勞動力短缺時期，日本人說他們恨不得讓貓來幫忙。"},{"english":"One fell hard enough to break the glider's sturdy aluminum strut.","chinese":"人們都恨不得折斷滑翔機上那段堅硬的鋁支桿。"}],"related":[{"definition":["see 恨不得[hen4 bu5 de5]"],"pinyin":["hen4 bu5 neng2"],"word":"恨不能"},{"definition":["(coll.) to be eager for\/to long for\/to look forward to"],"pinyin":["ba1 bu5 de5"],"word":"巴不得"},{"definition":["to get really angry"],"pinyin":["huo3 mao4 san1 zhang4"],"word":"火冒三丈"},{"definition":["gnashing one's teeth (idiom); displaying extreme anger\/fuming with rage between gritted teeth"],"pinyin":["yao3 ya2 qie4 chi3"],"word":"咬牙切齒"},{"definition":["to itch\/to tickle"],"pinyin":["yang3 yang5"],"word":"癢癢"},{"definition":["to blow one's top\/to be driven mad\/to become frantic"],"pinyin":["zhua1 kuang2"],"word":"抓狂"},{"definition":["regardless of the consequences\/recklessly relying on a hopelessly optimistic forecast"],"pinyin":["bu4 guan3 san1 qi1 er4 shi2 yi1"],"word":"不管三七二十一"},{"definition":["to get angry\/to burn with rage"],"pinyin":["mao4 huo3"],"word":"冒火"},{"definition":["to throttle\/to choke to death"],"pinyin":["qia1 si3"],"word":"掐死"},{"definition":["not saying anything further (idiom); not raising any objection\/without demur"],"pinyin":["er4 hua4 bu4 shuo1"],"word":"二話不說"},{"definition":["to fear\/afraid\/extremely nervous\/for fear that\/to avoid\/so as not to"],"pinyin":["sheng1 pa4"],"word":"生怕"},{"definition":["half dead (of torment, hunger, tiredness etc)\/(tired) to death\/(terrified) out of one's wits\/(beaten) to within an inch of one's life\/(knock) the daylights out of sb"],"pinyin":["ban4 si3"],"word":"半死"},{"definition":["to hate bitterly"],"pinyin":["hen4 tou4"],"word":"恨透"},{"definition":["to hate to do sth\/to hate to part with\/to begrudge"],"pinyin":["she3 bu5 de5"],"word":"捨不得"},{"definition":["extremely\/awfully"],"pinyin":["yao4 si3"],"word":"要死"},{"definition":["to burst with joy (idiom)\/to be over the moon\/to be elated"],"pinyin":["xin1 hua1 nu4 fang4"],"word":"心花怒放"}]}