{"definition":["it's just perfect\/it's just right"],"pinyin":["qia4 dao4 hao3 chu4"],"simplified":["恰到好处"],"rank":14542.0,"normalized_rank":0.20346144697997845,"fraction":0.000004375825342813279,"cumulative_fraction":0.9570824743504296,"word":"恰到好處","characters":[{"definition":["exactly\/just"],"pinyin":["qia4"],"word":"恰"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello","to be fond of\/to have a tendency to\/to be prone to"],"pinyin":["hao3","hao4"],"word":"好"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"His speech struck a perfect balance between humor and seriousness.","chinese":"他的演說把幽默性和嚴肅性的方寸掌握得恰到好處。"},{"english":"A basin of charcoal fire of proper heat will be the key to Yao's work in the afternoon.","chinese":"一盆燒得恰到好處的炭火，是姚貴文下午工作的關鍵。"},{"english":"The first taste is almost sweet, a rush of fruit giving way to a smooth sensation with just enough acid backbone.","chinese":"初嘗口味偏甜，一抹果味賦予了她恰到好處的酸度。"},{"english":"Her little shoes now fitted her smartly.","chinese":"她的小鞋子穿來恰到好處。"},{"english":"You are the point of golden section in my life, loving me to the perfect degree.","chinese":"你是我生命中的黃金分割點，恰到好處的愛着我。"},{"english":"Learn to be mischievous and coquetry.","chinese":"學會恰到好處地撒嬌調皮。"},{"english":"Super-ripe fruit, silk-like tannins and good acidity linger on the palate.","chinese":"蘊含醇熟的果味口感，單寧絲滑，酸度恰到好處。"},{"english":"The skin fried to perfection, crispy golden and the meat is tender.","chinese":"皮炸的恰到好處，金黃色的脆皮和軟嫩的肉。"},{"english":"It is just fine to put the ellipsis at the end of the article.","chinese":"刪節號用在這篇文章的末尾，恰到好處。"},{"english":"I found his speech wholly apposite to the current debate.","chinese":"我認爲他的講話對當前的辯論是恰到好處的。"},{"english":"He often sets the table a-roaring with a well-placed bon mot.","chinese":"他經常以恰到好處的珠璣妙語使滿桌的人鬨堂大笑。"},{"english":"The situation of the house was good.","chinese":"房子的位置選得恰到好處。"},{"english":"Her eye appears small and of the correct almond shape and is set very correctly into her skull.","chinese":"小小的杏仁眼恰到好處地嵌在頭骨中。"},{"english":"It features intense fruit aromas in harmony with slight mint and anise notes.","chinese":"濃郁的果香與絲絲薄荷和茴芹味道協調得恰到好處。"},{"english":"That Caroline ran after a man was hit off by Linda.","chinese":"琳達把卡羅琳追求一名男子的情況描繪得恰到好處。"},{"english":"We approached the confluence at the perfect speed.","chinese":"我們以恰到好處的速度來到匯流處。"}],"related":[{"definition":["exquisite\/meticulous"],"pinyin":["xi4 ni4"],"word":"細膩"},{"definition":["to pay particular attention to\/carefully selected for quality\/tastefully chosen"],"pinyin":["jiang3 jiu5"],"word":"講究"},{"definition":["delicate\/fine\/careful\/meticulous\/painstaking"],"pinyin":["xi4 zhi4"],"word":"細緻"},{"definition":["appropriate\/suitable"],"pinyin":["qia4 dang4"],"word":"恰當"},{"definition":["lit. extreme saturation (idiom)\/fig. vividly and thoroughly\/in great detail\/without restraint\/(of a performance) brilliant"],"pinyin":["lin2 li2 jin4 zhi4"],"word":"淋漓盡致"},{"definition":["peak\/pinnacle\/ultimate"],"pinyin":["ji2 zhi4"],"word":"極致"},{"definition":["realism (in art)\/sense of reality\/texture\/tactile quality"],"pinyin":["zhi4 gan3"],"word":"質感"},{"definition":["full\/plump"],"pinyin":["bao3 man3"],"word":"飽滿"},{"definition":["accurate\/precise"],"pinyin":["jing1 que4"],"word":"精確"},{"definition":["fine\/meticulous\/careful"],"pinyin":["jing1 xi4"],"word":"精細"},{"definition":["implicit charm in rhyme or sound\/hinted appeal\/interest"],"pinyin":["yun4 wei4"],"word":"韻味"},{"definition":["layer\/level\/gradation\/arrangement of ideas\/(a person's) standing"],"pinyin":["ceng2 ci4"],"word":"層次"},{"definition":["strong (taste, flavor, smell)"],"pinyin":["nong2 lie4"],"word":"濃烈"},{"definition":["to fuse together (idiom)\/hypostatic union (religion)"],"pinyin":["rong2 wei2 yi1 ti3"],"word":"融為一體"},{"definition":["rich\/strong\/heavy (fragrance)\/dense\/full-bodied\/intense"],"pinyin":["nong2 yu4"],"word":"濃郁"},{"definition":["to have\/to involve"],"pinyin":["dai4 you3"],"word":"帶有"}]}