{"definition":["to overdose on supplementary medicine\/to cram too hard"],"pinyin":["e4 bu3"],"simplified":["恶补"],"rank":32013.0,"normalized_rank":0.4479034040826606,"fraction":7.894470060693293e-7,"cumulative_fraction":0.9919790849947848,"word":"惡補","characters":[{"definition":["evil\/fierce\/vicious\/ugly\/coarse\/to harm","see 惡心|恶心[e3 xin1]","to hate\/to loathe\/ashamed\/to fear\/to slander"],"pinyin":["e3","e4","wu4"],"word":"惡"},{"definition":["to repair\/to patch\/to mend\/to make up for\/to fill (a vacancy)\/to supplement"],"pinyin":["bu3"],"word":"補"}],"containing_words":[],"sentences":[{"english":"Night-before cramming requires playing the odds, and your best bet is on the big stuff.","chinese":"夜前惡補要有勝算，你最好的賭注應該放在重點上。"},{"english":"Don't cram the night before the exam.","chinese":"不要在考試前夜填鴨式惡補。"},{"english":"First of all, I rent a suit, and then I work hard at perfecting my eating manners.","chinese":"首先，我租了一套西服，然後惡補了一下就餐禮儀。"},{"english":"How bone up can be effective in the condition of the limited time and energy.","chinese":"但時間有限，精力有限，怎麼惡補才見效呢？"},{"english":"I decided to fix my Yoga Deficit Disorder.","chinese":"於是我決定惡補我的瑜伽知識。"},{"english":"The method of breaking through the bottleneck is to bone up on typical materials.","chinese":"突破這個瓶頸的辦法是惡補典型材料。"},{"english":"In fact, the holiday \" cramming Wind\" a few years ago began to prevail.","chinese":"其實，假期“惡補風”幾年前就開始盛行。"},{"english":"They feel that many undergraduates now urgently need remedial help with study skills.","chinese":"他們認爲許多本科生都需要惡補學習技能這一課。"},{"english":"The summertime may be the only time you can squeeze in some courses.","chinese":"這個夏天可能是您唯一能夠惡補這些課程的時候了。"},{"english":"You will also need to bone up on Vitamin C while you're doing the most work.","chinese":"在你開始工作以前，最好惡補下關於維生素C的知識。"},{"english":"So, he spent 30 minutes every evening catching up at home.","chinese":"因而，他每天晚上在家花30分鐘惡補這方面的消息。"},{"english":"My boss asked me to take a test, so I'm just boning up on some things I need to know.","chinese":"我老闆叫我考一個試，所以我正在惡補一些必要知識。"}],"related":[{"definition":["lit. to clasp the Buddha's feet when danger arises (idiom); fig. to profess devotion only when in trouble\/doing things at the last minute\/making a hasty last-minute effort"],"pinyin":["lin2 shi2 bao4 fo2 jiao3"],"word":"臨時抱佛腳"},{"definition":["to prepare a lesson"],"pinyin":["yu4 xi2"],"word":"預習"},{"definition":["clumsy\/all thumbs"],"pinyin":["ben4 shou3 ben4 jiao3"],"word":"笨手笨腳"},{"definition":["to murmur endearments (idiom)\/to get into a romantic relationship"],"pinyin":["tan2 qing2 shuo1 ai4"],"word":"談情說愛"},{"definition":["hard to explain in a few words (idiom); complicated and not easy to express succinctly"],"pinyin":["yi1 yan2 nan2 jin4"],"word":"一言難盡"},{"definition":["children's picture story book\/CL:本[ben3]"],"pinyin":["xiao3 ren2 shu1"],"word":"小人書"},{"definition":["to be a real headache\/to find sth a real headache\/to beat one's brains"],"pinyin":["shang1 nao3 jin1"],"word":"傷腦筋"},{"definition":["to worry\/to fret\/to be anxious\/to become sad"],"pinyin":["fa1 chou2"],"word":"發愁"},{"definition":["hard to say\/unpleasant to say\/can't be sure"],"pinyin":["bu4 hao3 shuo1"],"word":"不好說"},{"definition":["clear and logical"],"pinyin":["tou2 tou2 shi4 dao4"],"word":"頭頭是道"},{"definition":["read-only (computing)"],"pinyin":["zhi3 du2"],"word":"只讀"},{"definition":["to spend effort\/to take trouble\/May I trouble you to...? (as part of polite request)\/Please would you mind...?"],"pinyin":["fei4 shen2"],"word":"費神"},{"definition":["to read in silence"],"pinyin":["mo4 du2"],"word":"默讀"},{"definition":["talent and learning\/scholarship"],"pinyin":["cai2 xue2"],"word":"才學"},{"definition":["(idiom) (of a good outcome) unanticipated\/serendipitous\/fortuitous"],"pinyin":["wu2 xin1 cha1 liu3"],"word":"無心插柳"},{"definition":["unimportant\/not serious\/it doesn't matter\/never mind\/it looks all right, but"],"pinyin":["bu4 yao4 jin3"],"word":"不要緊"}]}