{"definition":["to think of\/to keep thinking about\/to be concerned about"],"pinyin":["dian4 ji4"],"simplified":["惦记"],"rank":18544.0,"normalized_rank":0.2594546192268409,"fraction":0.0000027794140154511883,"cumulative_fraction":0.9710774974589944,"word":"惦記","characters":[{"definition":["to think of\/to remember\/to miss"],"pinyin":["dian4"],"word":"惦"},{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"記"}],"containing_words":[],"sentences":[{"english":"With an eye out for lake deposits, I went back to get samples a few days later.","chinese":"惦記着湖泊沉積，幾天後我又回去取了樣本。"},{"english":"With seven mouths and eight tongues, all were talking together. They tried to tell how they had missed him.","chinese":"男男女女都七嘴八舌地說出他們的惦記和盼念。"},{"english":"Forget rubbing elbows with strangers at networking mixers .","chinese":"別惦記着和社交網站的陌生人拉關係。"},{"english":"In combat, one lives in the now and does not think much about yesterday or tomorrow.","chinese":"戰鬥中，此刻尚存者別想昨天，也別惦記明天。"},{"english":"She will always have something to remember you by while you are away.","chinese":"即使你不在她身邊時母親總會惦記着你。"},{"english":"Was there any use buying Dilcey if she was going to mope about the child?","chinese":"只買來迪爾茜，要是她整天惦記孩子，又有什麼用呢？"},{"english":"Mr Li is unlikely still to be thinking about this little setback.","chinese":"李先生不太可能還惦記着這個小小的挫折。"},{"english":"Once throne eyes gaze, age face a dark, remember the human into blacklist.","chinese":"皇帝眼睛一瞪，老臉一黑，就把人惦記入黑名單了。"},{"english":"My heart cared about everyone, it just couldn't take care of itself.","chinese":"我的心惦記每個人，但它就是沒能照顧好自己。"},{"english":"Though rarely seen during the election campaign, Canadians have China on their minds.","chinese":"加拿大人心頭惦記着中國，這在選舉期間是少見的。"},{"english":"LL: I'd be psyched if you left behind that new leather couch you got for Christmas last year.","chinese":"原來你在惦記我去年聖誕節買的新沙發。"},{"english":"She is dead now herself, but many still living remember her.","chinese":"她現在已經死了，卻仍爲很多在世的人所惦記。"},{"english":"We shall miss her; but SHE will be happy.","chinese":"我們會惦記她的，不過她會很幸福。"},{"english":"Kurita had one more major factor to bear in mind .","chinese":"慄田還惦記着一個重大的決勝因素。"},{"english":"But you, O my brothers, remember sometimes thy little Alex that was.","chinese":"而你們，弟兄們哪，要不時惦記小亞歷克斯哥們啊。"},{"english":"I've been thinking about that all the time.","chinese":"我一直惦記着這件事。"}],"related":[{"definition":["concerned"],"pinyin":["gua4 nian4"],"word":"掛念"},{"definition":["to take troubles to heart (idiom); brooding"],"pinyin":["geng3 geng3 yu2 huai2"],"word":"耿耿於懷"},{"definition":["to cherish the memory of\/to think of\/reminisce"],"pinyin":["huai2 nian4"],"word":"懷念"},{"definition":["to be in a tangle\/to nag"],"pinyin":["jiu1 chan2"],"word":"糾纏"},{"definition":["moreover\/besides\/in addition\/furthermore"],"pinyin":["kuang4 qie3"],"word":"況且"},{"definition":["lit. that person\/fig. the person you have been looking for\/Mr Right\/the girl of one's dreams"],"pinyin":["na4 ge4 ren2"],"word":"那個人"},{"definition":["at that time\/originally"],"pinyin":["dang1 chu1"],"word":"當初"},{"definition":["to feel sad\/to feel unwell\/(of life) to be difficult"],"pinyin":["nan2 guo4"],"word":"難過"},{"definition":["here"],"pinyin":["zhe4 'r"],"word":"這兒"},{"definition":["to worry about\/to be concerned about"],"pinyin":["qian1 gua4"],"word":"牽掛"},{"definition":["to rejoice\/to be glad"],"pinyin":["qing4 xing4"],"word":"慶幸"},{"definition":["unimportant\/not serious\/it doesn't matter\/never mind\/it looks all right, but"],"pinyin":["bu4 yao4 jin3"],"word":"不要緊"},{"definition":["always"],"pinyin":["zong3 shi4"],"word":"總是"},{"definition":["to blame\/to rebuke"],"pinyin":["ze2 guai4"],"word":"責怪"},{"definition":["can't say for sure\/maybe"],"pinyin":["shuo1 bu5 ding4"],"word":"說不定"},{"definition":["but\/yet\/however\/while\/to go back\/to decline\/to retreat\/nevertheless\/even though"],"pinyin":["que4"],"word":"卻"}]}