{"definition":["all the more\/increasingly"],"pinyin":["yu4 fa1"],"simplified":["愈发"],"rank":14300.0,"normalized_rank":0.20007555300603025,"fraction":0.000004489249958885,"cumulative_fraction":0.9560096860844192,"word":"愈發","characters":[{"definition":["the more...(the more...)\/to recover\/to heal\/better"],"pinyin":["yu4"],"word":"愈"},{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"}],"containing_words":[],"sentences":[{"english":"The landscape will get more cluttered, the air and water even dirtier.","chinese":"景色會變得更加雜亂，空氣和水也會變得愈發骯髒。"},{"english":"Today the business environment is more petitive and fast-changing than ever.","chinese":"現今的商業環境，競爭愈發劇烈，變革彈指之間。"},{"english":"The music becomes unmusical and the motions become less coordinated.","chinese":"音樂變得缺乏音樂性，而動作也變得愈發不協調。"},{"english":"For this reason, they believed in Fei Changfang even more firmly than before.","chinese":"這樣一來，他們愈發相信起費長房的話來。"},{"english":"In v. 12 Paul spoke of many expressions of thanks to God.","chinese":"保羅在第12節指出，許多人會愈發感謝神。"},{"english":"And in the night to become cool, to lady finds out the thin quilt.","chinese":"而且夜晚愈發的涼了，給婆婆找出了薄棉被。"},{"english":"While the springs to the stream of Daming Lake, nature also become more and more beautiful.","chinese":"而衆泉歸流的大明湖，自然也愈發的美麗了。"},{"english":"Linton is visibly more ill and hardly has the energy to meet her.","chinese":"小林頓看上去病情愈發嚴重，幾乎沒有去見她的力氣。"},{"english":"State-owned media Xinhua reported late-last year that the trend was rising.The U.","chinese":"國營媒體新華社去年底報道這一傾向正愈發明顯。"},{"english":"At that point they increasingly start to eat seabirds, as well as other mice.","chinese":"這時，他們愈發喫起海鳥以及其它老鼠。"},{"english":"It's growing harder and harder to concentrate.","chinese":"我愈發難以集中精神。"},{"english":"The faster-moving and more competitive the environment, the more important innovation is.","chinese":"環境的節奏越快，競爭越激烈，創新就愈發顯得重要。"},{"english":"The higher cost of overbooking means airlines will be more conservative.","chinese":"超額預訂的成本上升意味着航空公司會愈發保守。"},{"english":"Raising rates would make the struggle even worse.","chinese":"提高利率會使這場爭鬥愈發惡化。"},{"english":"The more I travel, the more I have seen how beautiful this world is.","chinese":"隨着我不斷旅行，我愈發發現這個世界是如此的美麗。"},{"english":"This type of error will increase in the last days before Christ returns.","chinese":"這類錯謬的行徑，在基督再來之前的末世會愈發加增。"}],"related":[]}