{"definition":["profound\/significant\/meaningful"],"pinyin":["yi4 wei4 shen1 chang2"],"simplified":["意味深长"],"rank":19673.0,"normalized_rank":0.2752507940061282,"fraction":0.0000024754885963246457,"cumulative_fraction":0.9740415899598552,"word":"意味深長","characters":[{"definition":["Italy\/Italian\/abbr. for 意大利[Yi4 da4 li4]","idea\/meaning\/thought\/to think\/wish\/desire\/intention\/to expect\/to anticipate"],"pinyin":["Yi4","yi4"],"word":"意"},{"definition":["taste\/smell\/(fig.) (noun suffix) feel\/quality\/sense\/(TCM) classifier for ingredients of a medicine prescription"],"pinyin":["wei4"],"word":"味"},{"definition":["deep\/depth\/deeply\/(of a color) dark\/deep\/rich"],"pinyin":["shen1"],"word":"深"},{"definition":["chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance","length\/long\/forever\/always\/constantly"],"pinyin":["chang2","zhang3"],"word":"長"}],"containing_words":[],"sentences":[{"english":"There are many meaningful long scenes in this director's films.","chinese":"這位導演的影片中有很多意味深長的長鏡頭。"},{"english":"This will speak volumes to your husband.","chinese":"這對你丈夫來說可能意味深長。"},{"english":"Once the cads are dealt, I'm looking for specific behaviors that represent meaningful tells.","chinese":"撲克牌分發之後，注意那些意味深長的特別行爲。"},{"english":"He express volumes to me smiling, eyes glitter but not flag.","chinese":"他意味深長的對我笑着，眼裏的兇光卻不減半分。"},{"english":"And the most meaningful sexual relationships begin with respect.","chinese":"並且，最意味深長的性關係都從尊重開始。"},{"english":"He exchanged dark looks with his wife, Petunia .","chinese":"他和妻子意味深長地對望一眼。"},{"english":"Or is there a more profound, philosophical explanation?","chinese":"或者還有更加理性，更加意味深長的解釋？"},{"english":"He looked at me with meaning.","chinese":"他意味深長地看着我。"},{"english":"When the seal saw Gong, it gave him along, deep look.","chinese":"當海豹看到宮凱時，便意味深長地凝視着他。"},{"english":"He raised his hands expressively .","chinese":"他意味深長地舉起了他的手。"},{"english":"This is a most profound time in my life right now.","chinese":"現在是我生命中最意味深長的時刻。"},{"english":"The new report has far-reaching implications for the future of broadcasting.","chinese":"這一新報告對廣播業的前途有些意味深長的暗示。"},{"english":"In fact, it was your playing that gave me a meaningful autumn.","chinese":"實際上，正是你的演奏給予我一個意味深長的秋天。"},{"english":"She gave the order to the waiter, using her hands very expressively.","chinese":"她意味深長地用雙手把訂單遞給了服務員。"},{"english":"Mr Luo said to physical meaning, YuMei is a good comrade.","chinese":"羅斌意味深長的對天翼說，俞梅是個好同志。"},{"english":"It saves time. \" Then he grimaced and shifted meaningfully.\"","chinese":"接着他扮了個鬼臉並且意味深長地變換了一下坐姿。"}],"related":[]}