{"definition":["inner meaning\/implication\/connotation"],"pinyin":["yi4 yun4"],"simplified":["意蕴"],"rank":34910.0,"normalized_rank":0.488436192688148,"fraction":6.098945250291526e-7,"cumulative_fraction":0.9939940487750566,"word":"意蘊","characters":[{"definition":["Italy\/Italian\/abbr. for 意大利[Yi4 da4 li4]","idea\/meaning\/thought\/to think\/wish\/desire\/intention\/to expect\/to anticipate"],"pinyin":["Yi4","yi4"],"word":"意"},{"definition":["to accumulate\/to hold in store\/to contain\/to gather together\/to collect\/depth\/inner strength\/profundity"],"pinyin":["yun4"],"word":"蘊"}],"containing_words":[],"sentences":[{"english":"Culture is in central position to Tang Poetry translation.","chinese":"質言之，文化是考察詩歌意蘊和英譯唐詩的核心。"},{"english":"He can elucidate the inner meaning of Confucius' words more specifically.","chinese":"能更爲具體地闡發孔子語的內在意蘊。"},{"english":"Chapter Three makes a detailed study of Kang\"s ideological contents and artistic achievements in his poetry.\"","chinese":"第三章具體分析康海詩歌的思想意蘊和藝術成就。"},{"english":"The image of grass is an implied aesthetic creation in ancient literature.","chinese":"古代文學中草意象是一個有深厚意蘊的審美創造物。"},{"english":"Second, discusses implication and characteristic which contained in Shi Zhecun's unique psycho-analysis novel.","chinese":"探討施蟄存小說獨特的心理分析包含的意蘊及特色。"},{"english":"Lacking lyrics, the song`s meaning is the music itself.","chinese":"沒有歌詞，這首歌的意蘊就是音樂本身了。"},{"english":"The prettiness and splendidness of language determine the connotation of the articles.","chinese":"語言的豐約質美與絢爛淡雅，決定着文章的意蘊。"},{"english":"The traditional concept of practice cannot fully reflect its inherent implication of humanity.","chinese":"傳統實踐概念未能充分體現其自身所固有的人文意蘊。"},{"english":"There is a wealth of cultural meaning of Chinese Phoenix myth.","chinese":"中華民族的鳳鳥神話包含着豐富的文化意蘊。"},{"english":"His ideas of retribution contain some special cultural implications.","chinese":"慧遠報應思想具有一些特殊的文化意蘊。"},{"english":"Behind these important features, it has substantial civil aesthetic interest and aesthetic implicatures.","chinese":"這些特徵背後包含着豐厚的民間審美趣味和審美意蘊。"},{"english":"In the traditional culture of China, leisure has some special implicates.","chinese":"休閒在我國傳統文化中有着獨特的文化意蘊。"},{"english":"Second, the emotional imagery implication of cuckoo.","chinese":"杜鵑鳥意象的情感意蘊。"},{"english":"The author mainly explores esthetic implication of symbol in the direction of aesthetics in chapter two.","chinese":"第二章主要從美學的角度探討了象徵的審美意蘊。"},{"english":"And from this and understands the Zhu Deyong cartoon profoundly the artistic implication.","chinese":"並由此而深刻理解到朱德庸漫畫的藝術意蘊。"},{"english":"This was the deep-root cause that made this novel split in meaning.","chinese":"這是造成小說在意蘊上分裂症候的深層原因。"}],"related":[]}