{"definition":["exclamation\/exclamatory phrase"],"pinyin":["gan3 tan4 ju4"],"simplified":["感叹句"],"rank":62621.0,"normalized_rank":0.8761490353000434,"fraction":2.6567928088871653e-8,"cumulative_fraction":0.999903494774798,"word":"感嘆句","characters":[{"definition":["to feel\/to move\/to touch\/to affect\/feeling\/emotion\/(suffix) sense of ~"],"pinyin":["gan3"],"word":"感"},{"definition":["to sigh\/to exclaim"],"pinyin":["tan4"],"word":"嘆"},{"definition":["sentence\/clause\/phrase\/classifier for phrases or lines of verse","variant of 勾[gou1]"],"pinyin":["gou1","ju4"],"word":"句"}],"containing_words":[],"sentences":[{"english":"Mix master it, that is mastered exclamatory point.","chinese":"掌握它的搭配，即掌握了感嘆句的重點。"},{"english":"Change it to an exclamatory sentence.","chinese":"把這句話變成感嘆句。"},{"english":"This article has over twenty exclamatory sentences in a row.","chinese":"這篇文章一連用了二十多個感嘆句。"},{"english":"This paper tries to do some research about the exclamatory sentences in Contemporary Chinese.","chinese":"本文試圖對現代漢語感嘆句作進一步的研究。"},{"english":"Thank you for sharing, but I think that some used Exclamatory sentences should be better.","chinese":"謝謝你的分享，但我認爲，有些句子用感嘆句更好。"},{"english":"This article inspected the modern Chinese sigh sentence with emphasis.","chinese":"本文重點考察了現代漢語感嘆句。"},{"english":"Distinguishing the difference between a statement, exclamation, and question.","chinese":"區分陳述句，感嘆句和疑問句的不同。"},{"english":"Using knowledge of types of sentences to discriminate between statements, exclamations, and questions.","chinese":"運用句子類型的知識區別陳述句，感嘆句和疑問句。"},{"english":"Secondly it inquires into the features of exclamatory sentences.","chinese":"探討感嘆句的一般性質特徵。"},{"english":"This article inspected the modem Mongolian sigh sentence with emphasis.","chinese":"本論文重點探討了現代蒙古語感嘆句。"},{"english":"Chapter 2 analyzes the functions of adverbs in the exclamatory sentences.","chinese":"第二章分析了副詞在感嘆句中的作用。"},{"english":"An exclamatory sentence should be followed by an exclamation mark.","chinese":"感嘆句的結尾應該使用歎號。"}],"related":[]}