{"definition":["to sense\/perception\/to feel (through the senses)\/to experience\/a feeling\/an impression\/an experience"],"pinyin":["gan3 shou4"],"simplified":["感受"],"rank":1430.0,"normalized_rank":0.020007555300603025,"fraction":0.00011265210247036794,"cumulative_fraction":0.6775791894200545,"word":"感受","characters":[{"definition":["to feel\/to move\/to touch\/to affect\/feeling\/emotion\/(suffix) sense of ~"],"pinyin":["gan3"],"word":"感"},{"definition":["to receive\/to accept\/to suffer\/subjected to\/to bear\/to stand\/pleasant\/(passive marker)"],"pinyin":["shou4"],"word":"受"}],"containing_words":[{"definition":["sensory receptor"],"pinyin":["gan3 shou4 qi4"],"word":"感受器"}],"sentences":[{"english":"Would my take you hand, would you understand Just how I feel?","chinese":"我能牽起你的手感受我的內心嗎？"},{"english":"Twelve months' non-stop football is doing me well. I feel that I am still growing in form.","chinese":"這是我這幾年來第一次有這樣的感受。"},{"english":"Feel how you are coming into s state of Balance with the Earth.","chinese":"感受你現在進入到一種與地球完全合一的全然狀態。"},{"english":"So dear friends , let's open our hearts and ears to enjoy music .","chinese":"親愛的朋友，讓我們敞開心靈和張開雙耳去感受音樂。"},{"english":"Love them enough to allow them to experience the consequences of their actions.","chinese":"愛他們足以讓他們感受到自己的行爲產生的後果。"},{"english":"Your new driving experience comes from the newly-designed car.","chinese":"新汽車給您一種新的駕駛感受。"},{"english":"Can they feel the  crackle of  electricity in the wind?","chinese":"他們能否感受到風中的電光火石？"},{"english":"I feel intimately inside myself where the role belongs.","chinese":"我能絲絲入扣地在自我當中感受角色之所在。"},{"english":"Friends worldwide are welcome to know more Tiens and experience Tiens products.","chinese":"歡迎更多海內外朋友瞭解和感受天獅產品。"},{"english":"the pervading emotion is, I'd say, just stress and hurriedness.","chinese":"這裏的人們最普遍的感受還是壓力以及慌忙感。"},{"english":"To Marc Chagall, the marriage with Bella Rosenfeld, his life, bears the best witness to love and beauty.","chinese":"與妻子蓓拉的婚姻，是夏卡爾感受愛與美最好的見證。"},{"english":"I have a complex feeling while seeing He's works.","chinese":"看何唯娜的作品，就有這種複雜的感受。"},{"english":"Its impact has been felt even in small villages in India and Africa.","chinese":"它的影響甚至連印度和非洲的小村莊裏都已經感受到。"},{"english":"Can you feel the spring in the air?","chinese":"你有沒有感受到春天的氣息？"},{"english":"QUEENIE: Everybody feels different about themselves one way or another.","chinese":"每個人對於自己的感受都不一樣。"},{"english":"Most viewers can empathize with the sense of hesitation and uncertainty embodied in such an image.","chinese":"大多數讀者都能感受到這幅畫中包含的猶豫和彷徨。"}],"related":[{"definition":["to know from experience\/to learn through experience\/to realize\/understanding\/experience"],"pinyin":["ti3 hui4"],"word":"體會"},{"definition":["to experience for oneself"],"pinyin":["ti3 yan4"],"word":"體驗"},{"definition":["body odor\/to appreciate a subtle taste"],"pinyin":["ti3 wei4"],"word":"體味"},{"definition":["to feel\/to become aware of\/feeling\/sense\/perception\/CL:個|个[ge4]"],"pinyin":["gan3 jue2"],"word":"感覺"},{"definition":["to have a taste of\/to realize\/to appreciate"],"pinyin":["ling3 lu:e4"],"word":"領略"},{"definition":["to give to\/to provide to\/to bring to\/to take to"],"pinyin":["dai4 gei3"],"word":"帶給"},{"definition":["to appreciate\/to enjoy\/to admire"],"pinyin":["xin1 shang3"],"word":"欣賞"},{"definition":["one's thoughts and feelings\/emotional stirring\/moved\/touched"],"pinyin":["gan3 chu4"],"word":"感觸"},{"definition":["(idiom) to experience it for oneself\/to actually *be* there (as opposed to reading about it etc)"],"pinyin":["shen1 lin2 qi2 jing4"],"word":"身臨其境"},{"definition":["direct\/concerning oneself\/personal"],"pinyin":["qie4 shen1"],"word":"切身"},{"definition":["to feel\/to sense\/to detect\/to perceive\/to become aware"],"pinyin":["gan3 jue2 dao4"],"word":"感覺到"},{"definition":["to come to realize\/to appreciate (feelings)"],"pinyin":["gan3 wu4"],"word":"感悟"},{"definition":["charm\/fascination\/glamor\/charisma"],"pinyin":["mei4 li4"],"word":"魅力"},{"definition":["to sample\/to taste\/to appreciate\/one's taste (i.e. in music, literature, fashion, food and drink etc)\/good taste"],"pinyin":["pin3 wei4"],"word":"品味"},{"definition":["delight\/pleasure\/joy"],"pinyin":["le4 qu4"],"word":"樂趣"},{"definition":["joyful\/cheerful\/delighted\/joy\/delight"],"pinyin":["yu2 yue4"],"word":"愉悅"}]}