{"definition":["dark\/gloomy\/dismal\/by painstaking effort"],"pinyin":["can3 dan4"],"simplified":["惨淡"],"rank":20553.0,"normalized_rank":0.2875631357295762,"fraction":0.000002259879641449572,"cumulative_fraction":0.9761245947878732,"word":"慘淡","characters":[{"definition":["miserable\/wretched\/cruel\/inhuman\/disastrous\/tragic\/dim\/gloomy"],"pinyin":["can3"],"word":"慘"},{"definition":["insipid\/diluted\/weak\/mild\/light in color\/tasteless\/indifferent\/(variant of 氮[dan4]) nitrogen"],"pinyin":["dan4"],"word":"淡"}],"containing_words":[{"definition":["to manage by painstaking effort (idiom)"],"pinyin":["can3 dan4 jing1 ying2"],"word":"慘淡經營"}],"sentences":[{"english":"February was definitely not a good month for the automobile industry in America.","chinese":"二月份鐵定是美國汽車工業銷售慘淡的一個月。"},{"english":"Today all that seems pale and thin and very far away.","chinese":"現在，一切都顯得疏落慘淡，一切都遠離我們而去。"},{"english":"The cause they contrived so painstakingly also ended in failure.","chinese":"他們慘淡經營的事業也以失敗而告終。"},{"english":"The autumn crop is far more prone to failure than the summer one.","chinese":"可以預計的是秋季票房收入比夏季還要慘淡。"},{"english":"Tourism are down and many hotels are operating in the red.","chinese":"旅遊業在走下坡路，許多酒店慘淡經營，入不敷出。"},{"english":"IT IS not difficult to be pessimistic about the future of European business.","chinese":"談及歐洲未來的經濟狀況，總是讓人覺得愁雲慘淡。"},{"english":"Hodgson's future at Liverpool has come under intense scrutiny following a disastrous start to the season.","chinese":"賽季開局慘淡，霍奇森在安菲爾德的未來備受關注。"},{"english":"Reductions in construction jobs limit growth, further depressing housing markets.","chinese":"承包工程的減少抑制了增長，進一步使得房市慘淡。"},{"english":"That winter was a hard time for most property developers.","chinese":"那年冬天，很多房地產商慘淡經營。"},{"english":"The chilly wind bleak, staged a thrilling scene of supernatural events.","chinese":"陰風慘淡的港府，上演着一幕幕驚心動魄的靈異事件。"},{"english":"What I've sketched out is the real possibility for a dim, if not dismal future for the transatlantic alliance.","chinese":"我描繪的是這個跨大西洋聯盟慘淡的未來。"},{"english":"After several years' hard work, the business finally turned around.","chinese":"幾年的慘淡經營後，生意終於出現了轉機。"},{"english":"Real macho man presume orthoptic miserably thin life.","chinese":"真正的猛男，敢於直視慘淡的人生。"},{"english":"But not all the news was bleak in the folk world in 2009.","chinese":"但2009年關於民樂界並非一片愁雲慘淡。"},{"english":"The backdrop, of course, is the economic downturn, which is hitting Ireland particularly hard. The forecasts are dire.","chinese":"這當然是因爲經濟衰退造成的，經濟預測一片慘淡。"},{"english":"The dawn came in bleakly a few minutes later.","chinese":"過了幾分鐘，新一天的黎明在慘淡的氣氛中來臨。"}],"related":[]}