{"definition":["to suffer (defeat, death etc)"],"pinyin":["can3 zao1"],"simplified":["惨遭"],"rank":11955.0,"normalized_rank":0.16726596057252388,"fraction":0.000006143614404111278,"cumulative_fraction":0.943644968264486,"word":"慘遭","characters":[{"definition":["miserable\/wretched\/cruel\/inhuman\/disastrous\/tragic\/dim\/gloomy"],"pinyin":["can3"],"word":"慘"},{"definition":["to meet by chance (usually with misfortune)\/classifier for events: time, turn, incident"],"pinyin":["zao1"],"word":"遭"}],"containing_words":[{"definition":["to meet with disaster\/to die tragically"],"pinyin":["can3 zao1 bu4 xing4"],"word":"慘遭不幸"}],"sentences":[{"english":"Many prisoners were tortured and were victims of gruesome medical experiments.","chinese":"許多囚犯慘遭蹂躪，成爲了可怕的醫學實驗的受害者。"},{"english":"With desolation shall the earth be laid waste, and it shall be utterly spoiled: for the Lord hath spoken this word.","chinese":"大地必要完全荒廢，慘遭浩劫，因爲上主這樣定了。"},{"english":"Eventually fall joinville city, the people were massacred in the city, the Ming army on the sidelines is not saved.","chinese":"最終晉州城陷落，城內百姓慘遭屠殺，明軍旁觀不救。"},{"english":"Not all malls have suffered from competition and the suburbs’ transformation.","chinese":"競爭和郊區的變革並沒有讓所有的商城都慘遭不幸。"},{"english":"Many civilians were killed in the attack on the town.","chinese":"在那次攻城中，許多平民慘遭殺害。"},{"english":"But then they dwindled and were humbled through oppression, sorrow and distress.","chinese":"其後因慘遭災患苦難，人口減少而被棄如前。"},{"english":"Many innocent blacks were slain and their homes sacked.","chinese":"許多無辜的黑人慘遭殺害，他們的家也被洗劫一空。"},{"english":"What kind of national security do we have when were robbed of our leaders?","chinese":"當我們的領袖慘遭橫禍還會有什麼樣的國家安全？"},{"english":"Others blamed the careful doe for leading him to the slaughter.","chinese":"還有些樹仙責怪那隻母鹿害他慘遭屠殺。"},{"english":"The child's misery would move even the most obdurate heart.","chinese":"這個孩子的悲慘遭遇即使最冷酷的心腸也會爲之動情。"},{"english":"On the other hand, relatively few people have had badexperiences with Apple.","chinese":"另一方面，相對較少的人在使用蘋果時慘遭不測。"},{"english":"Dr Manette realized that the sister must have been very badly treated.","chinese":"曼奈特醫生意識到這位姐姐準是慘遭虐待。"},{"english":"What was Job's understanding of God after all his miseries?","chinese":"約伯在這一切悲慘遭遇之後對上帝有何看法？"},{"english":"He told me a tale of woe about himself.","chinese":"他告訴了我一個關於他自己的悲慘遭遇。"},{"english":"Wars have been waged. Innocents have been slaughtered.","chinese":"爲此曾經戰火連天，無辜民衆慘遭屠殺。"},{"english":"A remote village in Kaohsiung was feared fully sudmerged by flood-created lake burst.","chinese":"高雄縣甲仙鄉小林村甚至有恐全村慘遭滅頂。"}],"related":[]}