{"definition":["disastrous"],"pinyin":["can3 zhong4"],"simplified":["惨重"],"rank":11415.0,"normalized_rank":0.15971065996949896,"fraction":0.00000664928090356101,"cumulative_fraction":0.9401918314445932,"word":"慘重","characters":[{"definition":["miserable\/wretched\/cruel\/inhuman\/disastrous\/tragic\/dim\/gloomy"],"pinyin":["can3"],"word":"慘"},{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["chong2","zhong4"],"word":"重"}],"containing_words":[],"sentences":[{"english":"The current vegetable price slump has taken its toll on Chinese farmers.","chinese":"近日蔬菜價格暴跌使廣大的中國菜農損失慘重。"},{"english":"The enemy warships were disengaged from the battle after suffering heavy casualties.","chinese":"在遭受慘重傷亡後，敵艦退出了海戰。"},{"english":"That was our small token of the contribution that we can provide to those who have suffered from this great tragedy.","chinese":"這是我們能向損失慘重的災區人民略表的一點心意。"},{"english":"War dozen the decade be stalemated, both parties all loss miserably heavy.","chinese":"戰爭打了十年相持不下，雙方都損失慘重。"},{"english":"The Allies take heavy casualties and eventually get stalled at the Belgian border.","chinese":"盟軍在霸王行動中傷亡慘重，最終停在比利時邊境。"},{"english":"Towns situated in the hills near Rio de Janeiro were worst hit.","chinese":"位在里約熱內盧市附近的山丘城鎮，災情最爲慘重。"},{"english":"The people that are jumping in now will lose big.","chinese":"現在跳進去的人將損失慘重。"},{"english":"That disastrous failure brought them back to reality.","chinese":"那次慘重的失敗才使他們猛然知道天高地厚。"},{"english":"Both sides suffered horrific losses, but Vietnam eventually proclaimed victory.","chinese":"雙方損失慘重，但越南最終宣佈勝利。"},{"english":"The construction industry has been badly hurt by nationalisation.","chinese":"營建業已經在收歸國有的過程受傷慘重。"},{"english":"Goldman's Investment &Banking division, which is its umbrella division for trading its own capital to make profits, took a bath.","chinese":"高盛直管自有資金交易的投行部門損失慘重。"},{"english":"Both would lose incalculably from war.","chinese":"他們也都會在戰爭中損失慘重。"},{"english":"A company that distributes electrical parts in France was hit especially hard.","chinese":"法國一家電子零部件銷售公司損失尤爲慘重。"},{"english":"Casualties were heavy for UN units too.","chinese":"聯合國軍也同樣傷亡慘重。"},{"english":"During the Anti-Japanese War period, China's rural farm animals suffered heavy losses which badly needed to be replenished.","chinese":"抗戰時期中國農村耕畜損失慘重，迫切需要補充。"},{"english":"Xinji has suffered badly from falling demand for its clothing exports.","chinese":"由於紡織品出口需求縮減，辛集損失慘重。"}],"related":[]}