{"definition":["usual\/customary"],"pinyin":["guan4 chang2"],"simplified":["惯常"],"rank":27476.0,"normalized_rank":0.38442488771983824,"fraction":0.0000011843164867308555,"cumulative_fraction":0.9875754985027624,"word":"慣常","characters":[{"definition":["accustomed to\/used to\/indulge\/to spoil (a child)"],"pinyin":["guan4"],"word":"慣"},{"definition":["always\/ever\/often\/frequently\/common\/general\/constant","surname Chang"],"pinyin":["Chang2","chang2"],"word":"常"}],"containing_words":[],"sentences":[{"english":"In former times, people used to fight with swords.","chinese":"過去，人們慣常用刀劍作戰。"},{"english":"Marx, with his usual perversity, thought it was both.","chinese":"馬克思，帶着慣常的倔強，認爲它兩者都是。"},{"english":"He had his habitual breakfast, hamburger and ham sandwich every morning.","chinese":"他每天早上都是慣常的早餐，漢堡包和火腿三明治。"},{"english":"This is a normal activity that cats find calming and reassuring.","chinese":"這是貓兒們讓自己冷靜下來的慣常行動。"},{"english":"The fountain babbled its familiar music.","chinese":"泉水發出慣常的潺潺聲。"},{"english":"The fish had slowed again and was going at his usual pace.","chinese":"魚又慢下來了，正用它慣常的速度遊着。"},{"english":"I exercise poor judgement in my decisions and my usual obsessive planning gives way to impulsiveness.","chinese":"我的判斷變差了而且我慣常的執念給衝動讓道了。"},{"english":"Which language of Foul Language will you usually use?","chinese":"那種粗口你慣常使用？"},{"english":"Examine your habitual reactions to your most common stressors.","chinese":"檢查你對最普通的緊張性刺激的慣常反應。"},{"english":"Actually this was my pattern for the past ten years.","chinese":"事實上，這是過去十年裏我的慣常動作。"},{"english":"You may be routinely skipping a step.","chinese":"你可能慣常地跳過一個步驟。"},{"english":"For once he was wrenched out of his wonted calm.","chinese":"這一次，他陡然失去了慣常的寧靜態度。"},{"english":"It is common practice to make a back-up file for our documents.","chinese":"慣常做法是爲正本另立一個後備檔案。"},{"english":"He escorted us at the customary racing-car speed to our guest villa.","chinese":"他陪同我們以慣常的賽車般的速度直奔賓館。"},{"english":"He suggests that gnosis is just another form of ordinary knowledge.","chinese":"他暗示靈知僅僅是慣常知識的另一種形式。"},{"english":"Old granny was used to cook it in the rice cooker.","chinese":"老祖母慣常用電鍋蒸茄子。"}],"related":[]}