{"definition":["inertia (mechanics)"],"pinyin":["guan4 liang4"],"simplified":["惯量"],"rank":66998.0,"normalized_rank":0.9373889440767842,"fraction":9.48854574602559e-9,"cumulative_fraction":0.9999786094603934,"word":"慣量","characters":[{"definition":["accustomed to\/used to\/indulge\/to spoil (a child)"],"pinyin":["guan4"],"word":"慣"},{"definition":["capacity\/quantity\/amount\/to estimate\/abbr. for 量詞|量词[liang4 ci2], classifier (in Chinese grammar)\/measure word","to measure"],"pinyin":["liang2","liang4"],"word":"量"}],"containing_words":[{"definition":["moment of inertia (mechanics)"],"pinyin":["zhuan3 dong4 guan4 liang4"],"word":"轉動慣量"}],"sentences":[{"english":"But it's completely different, the moment of inertia, if you rotated it about this axis.","chinese":"但它完全不同，轉動慣量，如果將其繞這軸旋轉。"},{"english":"Almost all moment of inertia is in this system.","chinese":"幾乎所有這個系統中的轉動慣量。"},{"english":"So we know the moment of inertia.","chinese":"我們得到轉動慣量。"},{"english":"the curl of a force field measures the torque per unit moment of inertia.","chinese":"力場的旋度是，描述扭轉力矩與轉動慣量比值的量。"},{"english":"You get a totally different moment of inertia.","chinese":"你會得到完全不同的轉動慣量。"},{"english":"What is the moment of inertia of that?","chinese":"它的轉動慣量是多少呢？"},{"english":"The low inertia DC drive motor is supplied by a quick thyristor unit.","chinese":"低慣量的直流傳動電動機由快速可控硅裝置供電。"},{"english":"Don't worry about moments of inertia about an arbitrary line.","chinese":"不需要對任意曲線，都找出它的轉動慣量。"},{"english":"The characters of border irrigation water flow movement of surface irrigation and its zero-inertia model have been introduced.","chinese":"介紹了地面灌溉中畦灌水流運動的特性及零慣量模型。"},{"english":"A co-inertia analysis showed that species abundance and environmental variables had significant relationship.","chinese":"協慣量分析結果表明，相對丰度與環境變量顯著相關。"},{"english":"I have four objects here, and they all have different moments of inertia.","chinese":"我這裏有四個物體，它們的轉動慣量也不同。"},{"english":"For the moment of inertia, we want the square of a distance to the axis of rotation.","chinese":"至於轉動慣量，要求的其實是到旋轉軸距離的平方。"},{"english":"That is how we define moment of inertia.","chinese":"這就是轉動慣量的定義方法。"},{"english":"Well, we will try to compute now the moment of inertia about this point.","chinese":"我們要去計算關於這個點的轉動慣量。"},{"english":"You can calculate the moment of inertia.","chinese":"可以計算其轉動慣量。"},{"english":"The application of a single-chip processor aided three wire pendulum experiment;","chinese":"介紹了一種嵌入式三線擺轉動慣量測量系統。"}],"related":[]}