{"definition":["to rely on\/to depend on\/by means of\/thanks to\/sth that one relies on\/also written 憑借|凭借[ping2 jie4]"],"pinyin":["ping2 jie4"],"simplified":["凭藉"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"憑藉","characters":[{"definition":["to lean against\/to rely on\/on the basis of\/no matter (how, what etc)\/proof"],"pinyin":["ping2"],"word":"憑"},{"definition":["sleeping mat\/to placate","surname Ji","to insult\/to walk all over (sb)","variant of 借[jie4]"],"pinyin":["Ji2","ji2","jie4"],"word":"藉"}],"containing_words":[],"sentences":[{"english":"Depend on intuition and experience, he ases if the key that found baseball of the gold dollar that defeat solution.","chinese":"憑藉直覺和經驗，他彷彿找到了破解金元棒球的鑰匙。"},{"english":"Humans are sovereign beings by virtue of their indwelling adjusters.","chinese":"人的總稱憑藉他們的內涵調節器，是至高無上的存在。"},{"english":"Ms Stefanie Sun burst onto the Chinese music scene with her eponymous debut album in 2000.","chinese":"孫燕姿在2000年憑藉同名專輯進入華語樂壇。"},{"english":"The network teaching means that the teachers and the students rely on the media to carry out the non face-to-face education.","chinese":"網絡教學是指師生憑藉媒體所進行的非面對面的教育。"},{"english":"Finally with all these hardwork and with the help of friends, this guy had set up his own company...","chinese":"憑藉着這份努力與朋友的幫助，他有了他自己的公司。"},{"english":"Chen Daoming received the Best Performance award for his role in the film.","chinese":"陳道明憑藉在此片中的演出獲最佳男演員獎。"},{"english":"Zhou has attracted a great deal of interest because of his length and polished skills.","chinese":"憑藉着身高和技術，周琦引起了很多球隊的興趣。"},{"english":"What in the name of God is going on there?","chinese":"我們憑藉着上帝的名義將要去向何處？"},{"english":"Minelli and Grey won theirs for their respective turns in Cabaret.","chinese":"明奈利和格雷分別憑藉其在《酒店》裏的角色獲獎。"},{"english":"Disclosure and herausfordern is accomplished depending on technology.","chinese":"“解蔽”或“促逼”是人類憑藉技術所達成的。"},{"english":"With its triangular shape, Kolding Campus will create a significant new landmark in Kolding.","chinese":"科靈校園將憑藉其三角形體創建出科靈的新地標。"},{"english":"The brand is fighting back with technology; one example is Kleenex Facial Tissue with Lotion.","chinese":"該品牌憑藉科技發起反擊，比如帶乳液的舒潔面巾紙。"},{"english":"Thou didst desert, with spirit-winged lightness.","chinese":"你憑藉心靈羽翼的輕盈。"},{"english":"Jiang Wenli more with Golden Eagle TV Festival The show won three awards.","chinese":"蔣雯麗更憑藉此劇在金鷹電視節包攬三項大獎。"},{"english":"He became famous for his great strength and great skill in cutting trees.","chinese":"他憑藉伐樹時強大的力量和高超的技藝變得出名。"},{"english":"He had led a cloistered existence and had little experience of ordinary life.","chinese":"除了天生的穎悟和日常舞臺經驗外，他沒有任何憑藉。"}],"related":[{"definition":["to obtain\/to receive\/to get"],"pinyin":["huo4 de2"],"word":"獲得"},{"definition":["to march\/to advance"],"pinyin":["jin4 jun1"],"word":"進軍"},{"definition":["to reveal outstanding talent (idiom); to stand out as conspicuously brilliant"],"pinyin":["zhan3 lu4 tou2 jiao3"],"word":"嶄露頭角"},{"definition":["team"],"pinyin":["tuan2 dui4"],"word":"團隊"},{"definition":["numerous"],"pinyin":["zhong4 duo1"],"word":"眾多"},{"definition":["strength"],"pinyin":["shi2 li4"],"word":"實力"},{"definition":["superiority\/dominance\/advantage"],"pinyin":["you1 shi4"],"word":"優勢"},{"definition":["champion\/CL:個|个[ge4]"],"pinyin":["guan4 jun1"],"word":"冠軍"},{"definition":["unique\/distinct\/having special characteristics"],"pinyin":["du2 te4"],"word":"獨特"},{"definition":["transformation\/to transform"],"pinyin":["zhuan3 xing2"],"word":"轉型"},{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"word":"展現"},{"definition":["to display\/to exhibit\/to bring out implicit or innate qualities\/to express (a thought or moral)\/to develop (an idea)\/to elaborate (on a theme)"],"pinyin":["fa1 hui1"],"word":"發揮"},{"definition":["to hold a governmental office or post\/to assume office of\/to take charge of\/to serve as"],"pinyin":["dan1 ren4"],"word":"擔任"},{"definition":["to focus\/to concentrate\/to give one's full attention"],"pinyin":["zhuan1 zhu4"],"word":"專注"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["to approve\/approval\/acknowledgment\/OK"],"pinyin":["ren4 ke3"],"word":"認可"}]}