{"definition":["to assent\/to comply with"],"pinyin":["ying4 cong2"],"simplified":["应从"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"應從","characters":[{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"}],"containing_words":[],"sentences":[{"english":"Wrap from the lower part of outdoor unit to the position where the duct bundle passes through the wall.","chinese":"包紮時，應從室外機下部一直包到管束入牆處。"},{"english":"We should learn from our mistakes.","chinese":"我們應從錯誤中學習。"},{"english":"He says progress towardld the eight goals should be judged nation-by-nation.","chinese":"他說這八個目標的進程應從各國的角度來裁定。"},{"english":"Draw out the cylinder liner.","chinese":"柱塞應從導套里拉出。"},{"english":"It is related to chunked Transfer-Encoding responses from the server.","chinese":"它是分塊傳輸編碼的響應從服務器。"},{"english":"It is indicated that childhood asthma should be treated through phlegm and blood-stasis.","chinese":"小兒哮喘應從痰瘀論治，以化痰通瘀爲治則。"},{"english":"These phenomenon should be eliminated based on the principle of the unbalance of information.","chinese":"我們應從信息不對稱原理出發加以研究解決。"},{"english":"And they shall be put along by the midst of the boards from one end to the other.","chinese":"在木板中間的那根橫木，應從這頭穿到那頭。"},{"english":"Antidiarrhoeal medicines, such as loperamide, are not recommended and should never be given.","chinese":"既不推薦也應從不使用洛哌丁胺等止瀉藥。"},{"english":"Logs must be hauled out of the forest.","chinese":"木材應從森林運出來。"},{"english":"To solve the above problem, we should focus on…","chinese":"對這些問題的解決，應從應然和實然兩方面着手。"},{"english":"When should vocational guidance for secondary vocational school begin?","chinese":"中等職業學校職業指導應從何時開始？"},{"english":"It is indicated that childhood asthma should he treated through phlegm and blood-stasis.","chinese":"小兒哮喘應從痰瘀論治，以化痰通瘀爲治則。"},{"english":"To solve the above problem, we should focus on two aspects of real practice and ideal condition.","chinese":"對這些問題的解決，應從應然和實然兩方面着手。"},{"english":"The concept of right should be understood from both broad sense and narrow sense .","chinese":"法權概念應從廣義及狹義層面上理解。"},{"english":"The plunger should be withdrawn from sleeve.","chinese":"柱塞應從套筒裏抽出來。"}],"related":[]}