{"definition":["stress field"],"pinyin":["ying4 li4 chang3"],"simplified":["应力场"],"rank":69642.0,"normalized_rank":0.9743819344367805,"fraction":3.649440671548304e-9,"cumulative_fraction":0.9999953732391038,"word":"應力場","characters":[{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["power\/force\/strength\/ability\/strenuously","surname Li"],"pinyin":["Li4","li4"],"word":"力"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"}],"containing_words":[],"sentences":[{"english":"The paper presents a successful try-out of using the boundary element method for the stress analysis of a steam turbine rotor.","chinese":"採用邊界元法對汽輪機轉子的應力場進行分析。"},{"english":"Thus, it is considered that crustal stress field in the area investigated are relatively stable and uniform since Neogene.","chinese":"晚第三紀以來，該區構造應力場相對穩定和統一。"},{"english":"The photoelastic method and the speckle technique are sued for measuring the stress and displacement field respectively.","chinese":"分別用光彈法及散斑法測出試件的應力場及位移場。"},{"english":"It discusses the seismic source stress field by using many kinds of force sources.","chinese":"由多種力源討論了震源應力場。"},{"english":"Analyzed end stress field of far district slight crackle under blasting dynamic.","chinese":"分析了爆破弱應力波作用下中遠區裂紋的端部應力場。"},{"english":"It is pointed out that the principal compressive stress direction of tectonic stress field in the area is nearly S - N.","chinese":"指出，該區構造應力場的主壓應力方向爲近南北向。"},{"english":"In this paper, the method and result of the measurement of ground stress field of Xin-Cheny Gold Mine are introduced.","chinese":"本文介紹新城金礦地應力場測量的方法和結果。"},{"english":"Inclusion has great influences on the distribution of elastic- plastic stress in railhead.","chinese":"夾雜物對鋼軌的彈塑性應力場有較大影響。"},{"english":"The Coulomb stress change before a hypothetical earthquake is calculated based on a simple back-slip dislocation model of the event.","chinese":"震前庫侖應力場採用地震斷層反向滑移模型計算。"},{"english":"Geostatic state of complex geometric structure is established by reading initial stress from data file.","chinese":"用讀入應力法建立複雜構形的初始應力場。"},{"english":"The orientation of the maximum principal compressional axis in this regional tectonic stress field was probably near west-east.","chinese":"其區域構造應力場最大主壓應力軸向可能爲近東西向。"},{"english":"Then the local stress field of the cermets is estimated.","chinese":"確定了金屬基體和陶瓷顆粒內的細觀應力場。"},{"english":"The in situ stress field of engineering ranges is studied in detail with actual project.","chinese":"結合工程實際深入研究了工程區域的初始地應力場。"}],"related":[]}