{"definition":["proper"],"pinyin":["ying1 you3"],"simplified":["应有"],"rank":4582.0,"normalized_rank":0.06410812474640773,"fraction":0.00002730277946249462,"cumulative_fraction":0.8482437543312148,"word":"應有","characters":[{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"}],"containing_words":[{"definition":["everything that should be here is here (idiom); all one can think of is on hand\/to have all one needs"],"pinyin":["ying1 you3 jin4 you3"],"word":"應有盡有"}],"sentences":[{"english":"That should be the attitude that we in the media should strive for.","chinese":"這是我們這些媒體人應有的正確態度。"},{"english":"Be not due on this problem any suspicion and oscillatory .","chinese":"在這個問題上是不應有任何懷疑和動搖的。"},{"english":"We think we're all ready to implement universal suffrage in 2012.","chinese":"我們認爲到2012年應有全面的民主參政權。"},{"english":"Every ground connections should have its own via, do not share vias if possible.","chinese":"每個地走線都應有自己的過孔，過孔不能共用。"},{"english":"Even if everything dictionary at hand, we can not only lead them.","chinese":"即便手頭的詞典應有盡有，也不能唯它們的馬首是瞻。"},{"english":"I guess its upto our users!","chinese":"這應有用戶決定吧，我想。"},{"english":"This should be the current policy was due inwardness.","chinese":"這應該是此次政策出臺的應有深意。"},{"english":"They think this is how authentication to the bus should work.","chinese":"他們認爲這是對總線進行身份驗證應有的工作方式。"},{"english":"Supervision by public opinion is associated with press freedom, an inner meaning of democracy.","chinese":"輿論監督是新聞自由的一種表現，是民主的應有之義。"},{"english":"Weighing mechanism shall be temperature compensating and shall have automatic dampener to reduce oscillations.","chinese":"稱重的機械裝置應有溫度修正和自動潤滑以減少震動。"},{"english":"Shouldn’t I be punished for what I have done?","chinese":"我難道不該爲我的所作所爲得到應有的懲罰麼？"},{"english":"Promoting execution is an integrant part of cadres' style building.","chinese":"提升執行力是幹部作風建設的題中應有之義。"},{"english":"With four As in the HKALE, Anthony had several options.","chinese":"陳子量在高級程度會考拿了四個甲，本應有很多選擇。"},{"english":"Most who unveil hisagendas deserve the condemnation they receive。","chinese":"大多數人，祕密計劃敗露了，得到應有的譴責。"},{"english":"For selectivity, there should be evidence that the substance being quantified is the intended analyte.","chinese":"對選擇性，應有憑證證明經定量的物質是目標分析物。"},{"english":"and in the grounds around gardens, bowers, fountains and shady nooks in profusion.","chinese":"花園，涼亭，噴泉圍繞的場地以及納涼處，應有盡有。"}],"related":[]}