{"definition":["everything that should be here is here (idiom); all one can think of is on hand\/to have all one needs"],"pinyin":["ying1 you3 jin4 you3"],"simplified":["应有尽有"],"rank":18752.0,"normalized_rank":0.2623648090887468,"fraction":0.00000272058503182583,"cumulative_fraction":0.9716491687642729,"word":"應有盡有","characters":[{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely"],"pinyin":["jin4"],"word":"盡"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"}],"containing_words":[],"sentences":[{"english":"Even if everything dictionary at hand, we can not only lead them.","chinese":"即便手頭的詞典應有盡有，也不能唯它們的馬首是瞻。"},{"english":"and in the grounds around gardens, bowers, fountains and shady nooks in profusion.","chinese":"花園，涼亭，噴泉圍繞的場地以及納涼處，應有盡有。"},{"english":"Designs are avaliable in a myriad of colours.","chinese":"各種色彩的款式應有盡有。"},{"english":"This shop has for sale every kind of tonic that helps stimulate appetite and digestion.","chinese":"各種開胃消食的補品，本店應有盡有。"},{"english":"They had everything, even riches.","chinese":"他們應有盡有，也不缺財富。"},{"english":"God, it's just so awesome there with all the like lights and everything.","chinese":"我的天，那裏真的太棒了，燈光閃亮，一切應有盡有。"},{"english":"One need never go wanting for anything in America, the snakehead says.","chinese":"蛇頭說，在美國，他們想得到的一切，應有盡有。"},{"english":"Almost everything a racing team needs can be found without leaving Oxfordshire or Northamptonshire.","chinese":"在牛津郡和北安普敦郡，車隊所需的一切都應有盡有。"}],"related":[]}