{"definition":["application layer (computing)"],"pinyin":["ying4 yong4 ceng2"],"simplified":["应用层"],"rank":40051.0,"normalized_rank":0.5603654526884277,"fraction":3.8348322576629577e-7,"cumulative_fraction":0.9965082776438888,"word":"應用層","characters":[{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"},{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"層"}],"containing_words":[],"sentences":[{"english":"Application-layer traffic identification and control is the precondition of network billing and management.","chinese":"應用層流量識別及控制是網絡計費和網絡管理的前提。"},{"english":"You should refactor the code to separate the various application layers.","chinese":"應當重構代碼以分離各個應用層。"},{"english":"This document describes a protocol for the application-layer traversal of IP network firewalls.","chinese":"本文檔描述了一個應用層上的ip網絡防火牆協議。"},{"english":"Traditionally, these rules have always been implemented on the application layer.","chinese":"一般情況下，這些規則總是在應用層實現。"},{"english":"SIP is a text-based application-layer protocol.","chinese":"IP是一個基於文本的應用層控制協議。"},{"english":"A binding is a logical link between two devices at the application layer.","chinese":"綁定是應用層上兩個設備的邏輯鏈接。"},{"english":"However, additional transformation is frequently needed both at the protocol and application levels.","chinese":"然而，在協議層和應用層常常需要其它形式的轉換。"},{"english":"In this case, a significant amount is spent in application layer.","chinese":"在本例中，大量時間花費在了應用層上。"},{"english":"This is the application layer component in the IBSS system.","chinese":"這是系統的應用層部分。"},{"english":"Application layer multicast protocol sends packets to group members by the spanning tree.","chinese":"應用層多播通過生成樹將多播分組送至每一個組成員。"},{"english":"Play an important role in application-layer analyzing, namely the requirement analyzing.","chinese":"參與對應用層，即需求問題的分析。"},{"english":"This allows to scale out application tier independent of the session replication tier.","chinese":"這還可以獨立於會話複製層擴展應用層。"},{"english":"We will focus on the application and database tiers.","chinese":"我們將主要關注於應用層和數據庫層。"},{"english":"Application-layer multicast is an important research topic for the Internet.","chinese":"應用層多播是互聯網研究的一個重要課題。"},{"english":"Application-layer framework for the definition of guardianship agreement network nodes.","chinese":"應用層框架定義監護網絡節點協議。"},{"english":"The application layer and the transport layer use end-to-end protocols.","chinese":"應用層和傳輸層使用端到端協議。"}],"related":[]}