{"definition":["person taking a job\/job applicant\/CL:位[wei4]"],"pinyin":["ying4 pin4 zhe3"],"simplified":["应聘者"],"rank":14230.0,"normalized_rank":0.1990961621871196,"fraction":0.000004522532857809522,"cumulative_fraction":0.9556943012756068,"word":"應聘者","characters":[{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["to engage (a teacher etc)\/to hire\/to betroth\/betrothal gift\/to get married (of woman)"],"pinyin":["pin4"],"word":"聘"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"Employment interview is the process of transferring information between interviewers and interviewees.","chinese":"面試是面試官與應聘者進行面對面交流的過程。"},{"english":"Xu believes that stress has become a common problem for employees.","chinese":"徐永革認爲應聘者普遍存在的問題是壓力。"},{"english":"Many employers also check whether potential hires can speak Mandarin.","chinese":"許多用人單位也會覈查應聘者是否會講普通話。"},{"english":"During a phone interview the candidate flushed the toilet while talking to hiring manager.","chinese":"應聘者在一次電話面試外邊和招聘經理談話邊衝馬桶。"},{"english":"Secondly, an interviewee must demonstrate his skills for the job.","chinese":"其次，應聘者要證明自己能勝任這份工作。"},{"english":"“This also helps you become a better interviewee, ” Richards says.","chinese":"這可以幫助你成爲一個更好的應聘者”，理查茲說。"},{"english":"The applicant smelled his armpits on the way to the interview room。","chinese":"應聘者聞着腋窩走進面試房間。"},{"english":"Some candidates don'tto spell the company's name correctly.","chinese":"一些應聘者都懶得把公司的名稱拼寫正確。"},{"english":"A friend or lover—I can see that. But an employer?","chinese":"朋友還是情人我能瞭解，但是通過一個應聘者做到呢？"},{"english":"Some candidates giggled nervously as they waited for the interview.","chinese":"一些應聘者在等待面試的時候緊張的傻笑。"},{"english":"During a phone interview the candidate flushed the toilet while talking to hiring manager。","chinese":"應聘者在一次電話面試中邊和招聘經理談話邊衝馬桶。"},{"english":"An interviewer hosts the meeting in an office setting where a friendly conversation takes place between two people.","chinese":"在一間辦公室裏，面試官和應聘者進行融洽的交流。"},{"english":"This question is one of the most tricky questions for fresh graduates.","chinese":"對於應屆生應聘者來說，對這個問題是最易陷入圈套。"},{"english":"This is particularly important if the firm is in a different industry than the one you worked in before.","chinese":"對於跨行業的應聘者來說，這一點尤其重要。"},{"english":"Candidates who don’t ask questions also come across as unprepared and unengaged.","chinese":"應聘者沒有問題同樣被看作是沒有準備和沒有事的。"},{"english":"You are now working with or within the animal health industry.","chinese":"應聘者需是動物保健行業的在業人員或相關人員。"}],"related":[]}