{"definition":["an answering voice\/to answer a voice\/to respond\/to copy a voice\/to parrot"],"pinyin":["ying4 sheng1"],"simplified":["应声"],"rank":16671.0,"normalized_rank":0.23324891917227486,"fraction":0.0000034117890950170788,"cumulative_fraction":0.9653168397393502,"word":"應聲","characters":[{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["sound\/voice\/tone\/noise\/reputation\/classifier for sounds"],"pinyin":["sheng1"],"word":"聲"}],"containing_words":[{"definition":["yes-man\/opinionless person"],"pinyin":["ying1 sheng1 chong2"],"word":"應聲蟲"}],"sentences":[{"english":"He is the boss's favourite because he is a yesman.","chinese":"他是老闆的寵愛，因爲他是應聲蟲。"},{"english":"Coach a hand, the children will go down.","chinese":"教練一出手，孩子便應聲倒下。"},{"english":"A shot rings out, blood spatters the man's shirt, and he falls to the ground.","chinese":"一聲槍響後，血跡沾滿了他的襯衣，他應聲倒地。"},{"english":"Glaucus shouted her name; but there was no answer.","chinese":"格勞克斯喊她的名字，可是沒有應聲。"},{"english":"She knocked at a door, and a boy answered it.","chinese":"她敲了敲一戶人家的門，一個男孩應聲把門打開。"},{"english":"With a swoop of his shining ax, the first tree fell.","chinese":"隨著他手上閃亮的斧頭揮下，第一棵樹應聲而倒。"},{"english":"But she came not to his call, though he called to her all day long and besought her.","chinese":"儘管他整日地呼喚懇求，她卻並未應聲出現。"},{"english":"\"Let's forget about it and move on to the good stuff, \" more voices echoed in agreement.","chinese":"甭管它，來拍賣好東西吧，“更多的聲音應聲附和道。"},{"english":"Someone knocked on the wall and he knocked back.","chinese":"有人敲了一下牆壁，他應聲回敲。"},{"english":"She has no original opinion; she's just his husband's echo.","chinese":"她沒有主見，只是她丈夫的應聲蟲。"},{"english":"Li Jia echoes to go out, alter appointment, then take manager Li to come in.","chinese":"李佳應聲出去，不一會，便帶着利經理進來。"},{"english":"The gun spat twice and he fell dead.","chinese":"乒乒兩槍，他應聲倒地身亡。"},{"english":"So saying, the young man hurled the sword to the ground, snapping it.","chinese":"如是說，青年擲之於地，劍應聲而斷。"},{"english":"With a great cry, the stone clubs descend.","chinese":"伴隨着一聲大叫，石錘應聲落下。"},{"english":"Because Arnold is a yes-man. He agrees with everything the boss says!","chinese":"因爲他是個應聲蟲，老闆說的話他都附和。"},{"english":"He answer to cheng bite gold side.","chinese":"店小二應聲來到程咬金身邊。"}],"related":[]}