{"definition":["to take an exam"],"pinyin":["ying4 shi4"],"simplified":["应试"],"rank":13987.0,"normalized_rank":0.1956962769157584,"fraction":0.000004668510484671453,"cumulative_fraction":0.9545781915212288,"word":"應試","characters":[{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["to test\/to try\/experiment\/examination\/test"],"pinyin":["shi4"],"word":"試"}],"containing_words":[{"definition":["exam-oriented education\/teaching to the test"],"pinyin":["ying4 shi4 jiao4 yu4"],"word":"應試教育"}],"sentences":[{"english":"Penalizing people for selecting wrong answers does not eliminate the guessing problem.","chinese":"因爲選錯答案而懲罰應試者並沒有減少猜答案的問題。"},{"english":"WCCC can free the students from the puzzle of examination-education and can also make the students get ideal results in exams.","chinese":"擺脫應試教育的困擾，而又能在考試中考出理想成績。"},{"english":"” “An interviewee took his bubble gum out of his mouth and held it in his hand.","chinese":"一個應試者把泡泡糖從嘴裏拿出來攥在手裏。"},{"english":"Imperial selection started at the beginning of Sui Dynasty, so the tendency of examinations began to spread.","chinese":"在隋朝開始的科舉選才，應試之風開始蔓延。"},{"english":"The fourth chapter makes an evaluation of examination-oriented poems and poetic prose in the Tang Dynasty.","chinese":"第四章對唐代應試詩賦進行了一個整體的評價。"},{"english":"Most of our nation’s leading testing experts think this is a risky path.","chinese":"我們國家多數領頭應試專家認爲這是危險的路徑。"},{"english":"So, our country decide to change exam-oriented education to quality education.","chinese":"因此，我國決定把應試教育轉向素質教育。"},{"english":"Examination-oriented education has great influence because it has formed a system.","chinese":"應試教育因其體制化而產生巨大影響。"},{"english":"In our country's basic education, the problem is clear that the competence of passing the examinations has been emphasized.","chinese":"我國基礎教育對應試的過分強調使教育的弊端漸現。"},{"english":"It will reform the exam-oriented educational mode, and widely practice quality-oriented education.","chinese":"改革應試教育模式，全面實施素質教育。"},{"english":"Our teacher of physics suggested that we(should)try to make some electronic toys ourselves .","chinese":"我們的物理老師建議我們自己應試着做一些電動玩具。"},{"english":"That's because the examination system does not allow independent thinking, \" he told local media.","chinese":"原因就在於應試教育不允許學生獨立思考。"},{"english":"Let’s look at penalizing people for guessing an answer incorrectly for example.","chinese":"讓我們來看看懲罰猜錯答案的應試者這個例子。"},{"english":"The candidate will take an oral examination.","chinese":"那個應試者將參加口試。"},{"english":"A relaxed job candidate is a confident job candidate.","chinese":"心態放鬆的應試者是自信的。"},{"english":"Chin's current educational system is still exam-oriented education.","chinese":"中國目前的教育制度依然是應試教育。"}],"related":[{"definition":["imperial examinations (in former times)"],"pinyin":["ke1 ju3 kao3 shi4"],"word":"科舉考試"},{"definition":["officialdom\/bureaucracy"],"pinyin":["guan1 chang3"],"word":"官場"},{"definition":["school inspector"],"pinyin":["du1 xue2"],"word":"督學"},{"definition":["to attend (a school)\/to drop out (of college etc)"],"pinyin":["yi4 ye4"],"word":"肄業"},{"definition":["to comment\/a point by point commentary"],"pinyin":["ping2 dian3"],"word":"評點"},{"definition":["scholastic attainments"],"pinyin":["xue2 li4"],"word":"學力"},{"definition":["pausing at the end of a phrase or sentence (in former times, before punctuation marks were used)\/punctuation\/periods and commas\/sentences and phrases"],"pinyin":["ju4 dou4"],"word":"句讀"},{"definition":["to respond to a call"],"pinyin":["ying4 zhao4"],"word":"應召"},{"definition":["to practice writing characters"],"pinyin":["xi2 zi4"],"word":"習字"},{"definition":["pragmatic\/flexible\/to act differently in different situations\/to accommodate to circumstances"],"pinyin":["bian4 tong1"],"word":"變通"},{"definition":["to practice medicine (esp. in private practice)"],"pinyin":["xing2 yi1"],"word":"行醫"},{"definition":["teacher\/one's teacher"],"pinyin":["ye4 shi1"],"word":"業師"},{"definition":["famous school\/noted school of thought"],"pinyin":["xian3 xue2"],"word":"顯學"},{"definition":["to transcribe\/to make a fair copy"],"pinyin":["teng2 xie3"],"word":"謄寫"},{"definition":["exam question\/test topic"],"pinyin":["shi4 ti2"],"word":"試題"},{"definition":["writings in the vernacular"],"pinyin":["bai2 hua4 wen2"],"word":"白話文"}]}