{"definition":["accrual (accounting)"],"pinyin":["ying1 ji4"],"simplified":["应计"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"應計","characters":[{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"計"}],"containing_words":[{"definition":["accruals basis (accounting)"],"pinyin":["ying1 ji4 ji1 chu3"],"word":"應計基礎"}],"sentences":[{"english":"Accrued income will never be taxable.","chinese":"應計收入將不予應稅的。"},{"english":"Income from government subvention is recognised on an accruals basis.","chinese":"政府補助金收入按應計制確認。"},{"english":"These are longer in term and accrued interest for the borrower.","chinese":"這些都是在較長的任期應計利息的借款。"},{"english":"Each person in each group should plan to speak for approximately 3 minutes.","chinese":"小組每個人應計畫發言約三分鐘。"},{"english":"Basically, this is the quoted price of a bond, but its correct definition is the present value of the cash flow …","chinese":"不含應計利息的債券報價，一般報價均爲除息價格。"},{"english":"The carrying amount of other payables and accruals approximates to its fair value.","chinese":"其他應付款項及應計費用的帳面值與其公平值相約。"},{"english":"Understand how accruals affect the financial statement.","chinese":"瞭解應計基礎如何影響財務報表。"},{"english":"Each day Change Cannot be bigger than your account daily accrual.","chinese":"每日變化不得大於賬戶每日應計利息。"},{"english":"Enter bonus accruals based only on completion of years of service.","chinese":"僅根據實際任職年數輸入應計獎金。"},{"english":"You are to assume that profit accrues evenly over the contract.","chinese":"你要承擔的利潤應計均勻的合同。"},{"english":"Returns the accrued interest for a security that pays interest at maturity.","chinese":"返回到期一次性付息有價證券的應計利息。"},{"english":"Importantly to Valuers, accrued depreciation is a function of the market.","chinese":"重要的是評估師，應計折舊是一個市場的功能。"},{"english":"Select to reverse accruals added to the General Ledger Interface.","chinese":"選中此複選框轉回添加到“總帳接口”中的應計額。"},{"english":"The main current liabilities are accounts payable and accrued expenses.","chinese":"主要的流動負債是應付賬款和應計費用。"},{"english":"The Corporation shall utilize the accrual method of accounting with a year ending in December of any given year.","chinese":"本公司應在五年內每一年的十二月底適用會計應計制。"}],"related":[]}