{"definition":["not to feel like (doing sth)\/disinclined to"],"pinyin":["lan3 de2"],"simplified":["懒得"],"rank":17386.0,"normalized_rank":0.2432526968225764,"fraction":0.0000031428983063373995,"cumulative_fraction":0.9676586884458795,"word":"懶得","characters":[{"definition":["lazy"],"pinyin":["lan3"],"word":"懶"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[{"definition":["not wishing to acknowledge sb\/unwilling to respond"],"pinyin":["lan3 de5 da1 li3"],"word":"懶得搭理"}],"sentences":[{"english":"Needless to say, the British made no attempt to introduce anti-racist legislation.","chinese":"不用說，英國人是懶得在香港對反種族主義立法的。"},{"english":"Even I don't feel like moving my hand which holds the mouse.","chinese":"甚至握着鼠標的手都懶得挪一下位置。"},{"english":"Multicasting requires some more coding and programmers are lazy to even look into it.","chinese":"多播需求更多甚至連程序員都懶得瀏覽檢驗的代碼。"},{"english":"Lying in a den in Bombay , with a slack jaw and not much to say.","chinese":"躺在孟買的一個密室裏，下巴都懶得動，不想說什麼。"},{"english":"Why, I'm that tired Sunday I can't even read the papers.","chinese":"唉，星期天我可是疲倦得要命，連報都懶得看的。"},{"english":"Larry is too lazy to lift a finger.","chinese":"拉里懶得不想動指頭去幫任何人。"},{"english":"He is too lazy to move but luckily he has strong toes.","chinese":"他雖然懶得不肯動，但是幸而有強壯的腳趾。"},{"english":"The main influencing factors for perceived barriers to exercise include laziness and lack of time.","chinese":"自覺運動障礙最大因素爲懶得動和時問不夠。"},{"english":"She walked into my room without bothering to ring the bell first.","chinese":"她連先按下門鈴都懶得按一下就走進了我的房間。"},{"english":"Larry is too lazy to lift a finger to help anybody.","chinese":"拉里懶得不想動指頭去幫助任何人。"},{"english":"I was too tired to think about it more so I just glanced at it and fell asleep.","chinese":"一路累乏，懶得多想，只看了它一眼，倒頭便睡。"},{"english":"And you'd rather spend an extra ten minutes in a hot shower than go out for a morning job.","chinese":"相信你寧願多花十分鐘衝熱水澡也懶得出門工作。"},{"english":"Some candidates don'tto spell the company's name correctly.","chinese":"一些應聘者都懶得把公司的名稱拼寫正確。"},{"english":"I sent them an invitation, but they didn't even bother to reply.","chinese":"我給他們寄了個請帖，但他們竟連話也懶得回。"},{"english":"You don't feel like leaving comments? Please leave your palm-print.","chinese":"懶得留言？那留下您的掌印吧。"},{"english":"Like I said, I've been feeling lazy.","chinese":"就像我說的，我覺得懶得動。"}],"related":[]}