{"definition":["idle fellow\/lazybones"],"pinyin":["lan3 han4"],"simplified":["懒汉"],"rank":38766.0,"normalized_rank":0.542386635512711,"fraction":4.3180182025759535e-7,"cumulative_fraction":0.9959858460519256,"word":"懶漢","characters":[{"definition":["lazy"],"pinyin":["lan3"],"word":"懶"},{"definition":["Han ethnic group\/Chinese (language)\/the Han dynasty (206 BC-220 AD)","man"],"pinyin":["Han4","han4"],"word":"漢"}],"containing_words":[],"sentences":[{"english":"The lazy man was a parasite on his family.","chinese":"那懶漢是家裏的寄生蟲。"},{"english":"Seryozhka is a sluggard, a drunkard.","chinese":"謝遼日卡是個懶漢，酒鬼。"},{"english":"\"Stand up and repeat\" 'This is the voice of the sluggard, 'said the gryphon.","chinese":"“站起來背《這是懶漢在說話》，”鷹首師身怪說。"},{"english":"You idler, go to the ant, watch her ways and be wise.","chinese":"懶漢，你去看看螞蟻，觀察牠的作風，便可得些智識。"},{"english":"He is a lazy man still riding on his father's coattails.","chinese":"他是一個仍然依靠父親幫助的懶漢。"},{"english":"Can you help me, you fat slob?","chinese":"你能幫我嗎，你這個肥胖的懶漢？"},{"english":"An idle brain is the devil's workshop.","chinese":"懶漢的頭腦是魔鬼的旅遊管理考研工廠。"},{"english":"His effort on the defensive end of the floor will make Richard Jefferson look like a sloth.","chinese":"他在防守端的努力會讓傑佛森看起來就像個懶漢一樣。"},{"english":"Go to the ant, O sluggard, and consider her ways, and learn wisdom.","chinese":"懶漢，你去看看螞蟻，觀察牠的作風，便可得些智識。"},{"english":"Draw a circle idlers also get a month's time.","chinese":"懶漢畫一個圓圈也得一個月的時間。"},{"english":"Plough deep, while sluggards sleep; and you have corn to sell and to keep.","chinese":"懶漢睡覺你學耕，保你糧倉滿騰騰。"},{"english":"We make the busy bee look like a lazy creature, the ant like a sluggard.","chinese":"我們令蜜蜂顯得懶惰，令螞蟻看上去像懶漢。"},{"english":"Her boyfriend is a good - for - nothing layabout.","chinese":"她的男友是一個一無是處的懶漢。"},{"english":"The rich would have spoken on the value of thrift, and the idle grown eloquent over the dignity of labour.","chinese":"富人會談論節儉的價值，懶漢則侈談勞動光榮。"},{"english":"You say slacktivism, I say economies of scale.","chinese":"有人說這是懶漢行動主義，我說它是規模經濟。"},{"english":"A learned man is an idler who kills time by study. ----Bernard Shaw.","chinese":"博學的人是用學習消磨時間的懶漢。"}],"related":[]}