{"definition":["to have in one's person (feelings, talent etc)"],"pinyin":["huai2 you3"],"simplified":["怀有"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"懷有","characters":[{"definition":["bosom\/heart\/mind\/to think of\/to harbor in one's mind\/to conceive (a child)","surname Huai"],"pinyin":["Huai2","huai2"],"word":"懷"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"}],"containing_words":[],"sentences":[{"english":"Mrs. Archer and her group felt a certain timidity concerning these persons.","chinese":"對這班人阿切爾夫人和她那個小圈子懷有某種畏怯感。"},{"english":"He didn't owe her ill will.","chinese":"他對她並非懷有惡意。"},{"english":"If you are withholding information to protect the children, you can only do that for so long.","chinese":"如果你還是懷有保護孩子的信息，你只能暫時這樣做。"},{"english":"She had a true sisterly feeling for her brother.","chinese":"她對兄長懷有真正的骨肉之情。"},{"english":"Jack distinguishes himself with the hoi polloi by his radical opinion on politics.","chinese":"傑克因懷有激進的政治觀點而不同於大衆。"},{"english":"Comrade Zhang Side had a deep love for the Party.","chinese":"張思德同志對黨懷有深厚的愛。"},{"english":"ZZ: Ya, I still have the dream.","chinese":"對，時至今日，我依然懷有這個夢想。"},{"english":"the judge has prejudice to the juicy fruit.","chinese":"法官對這類多汁生果懷有結果見。"},{"english":"Before I started traveling, I hated supermarkets.","chinese":"旅行生涯之始，我一直對超市懷有餘恨。"},{"english":"A switch-hitter in baseball should be naturally ambidextrous .","chinese":"一個開關在棒球擊球手應自然懷有二心的。"},{"english":"Untrained people with other things on their minds can make serious economic errors.","chinese":"懷有其它顧慮的非專業人士可能會犯嚴重的經濟錯誤。"},{"english":"Mrs Bruni-Sarkozy is pregnant with her second child and has been rather quiet about it.","chinese":"現正布呂尼正懷有她的第二個小孩，對此她相當淡定。"},{"english":"Their hostile looks showed that I was unwelcome.","chinese":"他們懷有敵意的表情，顯示出我不受歡迎。"},{"english":"Picture that person and hold onto that unwillingness to forgive.","chinese":"心裏想象着這個人，和那心中懷有的不情願。"},{"english":"Even then, on that snowy day, I had my doubts.","chinese":"即使那樣，在那個雪天，我對傑克仍有懷有疑慮。"},{"english":"Archer and her group felt a certain timidity concerning these persons.","chinese":"對這班人阿切爾夫人和她那個小圈子懷有某種畏怯感。"}],"related":[]}