{"definition":["widely different\/large disparity"],"pinyin":["xuan2 shu1"],"simplified":["悬殊"],"rank":11615.0,"normalized_rank":0.1625089194521008,"fraction":0.000006464473227953804,"cumulative_fraction":0.9415030306627492,"word":"懸殊","characters":[{"definition":["to hang or suspend\/to worry\/public announcement\/unresolved\/baseless\/without foundation"],"pinyin":["xuan2"],"word":"懸"},{"definition":["different\/unique\/special\/very\/(classical) to behead\/to die\/to cut off\/to separate\/to surpass"],"pinyin":["shu1"],"word":"殊"}],"containing_words":[{"definition":["the multitude against the few, a wide disparity (idiom from Mencius); heavily outnumbered\/unequally matched\/overwhelmed by weight of numbers"],"pinyin":["zhong4 gua3 xuan2 shu1"],"word":"眾寡懸殊"}],"sentences":[{"english":"Macau is affluent but not for all people.","chinese":"澳門是富裕的城市，但貧富懸殊嚴重。"},{"english":"The contrast between the war front and the back area is always startling .","chinese":"戰爭時期，前後方的對比總是非常懸殊的。"},{"english":"The signal amplitude is quite different in the different period.","chinese":"而同一個信號在不同的時期強度相差懸殊。"},{"english":"There must be a \"reason\" for the chasm between the masses of these twin particles.","chinese":"這對攣生粒子的質量相差懸殊定有“原因”。"},{"english":"Our te am beat theirs by a big score.","chinese":"我隊以懸殊比分擊敗他們的隊。"},{"english":"The strength gap is too big.","chinese":"“敵我”力量懸殊太大。"},{"english":"The gap between rich and poor has widened because of the bad economy in the past few years.","chinese":"過去幾年經濟轉壞，貧富懸殊進一步拉闊。"},{"english":"The 22-point gap between the two is nearly double the previous margin.","chinese":"二者22分的懸殊幾乎是以前的兩倍。"},{"english":"September to May the following year as the frost period, frost-free period is short, significant differences between north and south.","chinese":"九月至次年五月爲霜凍期，無霜期短，南北相差懸殊。"},{"english":"Despite being greatly outnumbered, Liu Bei and Sun Quan eventually won the battle.","chinese":"儘管兵力懸殊，劉備和孫權最後還是打贏了這場戰役。"},{"english":"It’s a far cry from the simple text and links that started it all.","chinese":"這與剛開始的簡單的文本和鏈接有太懸殊的差別。"},{"english":"In third world countries the gap between the rich and the poor is very big.","chinese":"中國城市教會的一大問題是貧富懸殊及其產生的張力。"},{"english":"Large regional differences in the distribution of the county's population, are significant differences between mountain plains.","chinese":"全縣人口分佈地區差異較大，山區平原相差懸殊。"},{"english":"The Amsterdam City Council approved the plan about two weeks ago by an overwhelming 43-2 majority.","chinese":"市議會在兩週前以43比2懸殊票距通過了這項計畫。"},{"english":"However, young but unyielding heart is more powerful at murdering love than the difference.","chinese":"其實，比貧富懸殊更能殺死愛情的是年輕而倔強的心。"},{"english":"The girl was brave enough, but as being outnumbered, she was finally knocked by the gang.","chinese":"她很英勇，但終因衆寡懸殊，被那幫人打暈從前。"}],"related":[]}