{"definition":["pending a decision\/hanging in the balance"],"pinyin":["xuan2 er2 wei4 jue2"],"simplified":["悬而未决"],"rank":21824.0,"normalized_rank":0.3053460747415108,"fraction":0.0000019946382934414408,"cumulative_fraction":0.97881864269289,"word":"懸而未決","characters":[{"definition":["to hang or suspend\/to worry\/public announcement\/unresolved\/baseless\/without foundation"],"pinyin":["xuan2"],"word":"懸"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["not yet\/did not\/have not\/not\/8th earthly branch: 1-3 p.m., 6th solar month (7th July-6th August), year of the Sheep\/ancient Chinese compass point: 210°"],"pinyin":["wei4"],"word":"未"},{"definition":["to decide\/to determine\/to execute (sb)\/(of a dam etc) to breach or burst\/definitely\/certainly"],"pinyin":["jue2"],"word":"決"}],"containing_words":[],"sentences":[{"english":"Because commercial pattern is pendent , all jobs backwater not before.","chinese":"由於商業模式懸而未決，所有的工作都停滯不前。"},{"english":"A long-running lawsuit is pending.","chinese":"一個漫長的訴訟仍懸而未決。"},{"english":"The pending debate should be placed before a larger audience.","chinese":"那個懸而未決的問題應讓更多的人來討論。"},{"english":"There is some conflict in the air.","chinese":"有些衝突懸而未決。"},{"english":"Indeed, another request from Taipei is still pending.","chinese":"實際上，臺北的另一項請求仍懸而未決。"},{"english":"The position of goalkeeper is moot.","chinese":"阿森納門將位置至今懸而未決。"},{"english":"Clinton ended up carrying Illinois, then a tossup state.","chinese":"克林頓拿下了當時懸而未決的伊利諾伊州。"},{"english":"The desynchronization attack is very difficult to tackle and still an open question.","chinese":"去同步攻擊很難對付，依然是一個懸而未決的課題。"},{"english":"Rigden asked. “That’s a really open question.","chinese":"裏格登問道，“這確實是個懸而未決的問題。”"},{"english":"One unresolved issue is how to define a \"skilled\" immigrant.","chinese":"一個懸而未決的問題是如何定義“技術”移民。"},{"english":"The transition of Chinese real estate year, a series of pendent problems need to unscramble.","chinese":"中國地產的轉型年，一系列懸而未決的問題需要解讀。"},{"english":"Yet another longstanding mystery is why Mercury has a magnetic field.","chinese":"另一個懸而未決的謎團是爲什麼水星上有磁場。"},{"english":"Young said the results of Trueheart's blood tests were pending.","chinese":"楊說，特魯哈特的血液測試的結果仍然懸而未決。"},{"english":"Several required ratifications are still outstanding.","chinese":"目前幾項法定的批准程序仍然懸而未決。"},{"english":"What happens is that both the American and European dreams hang in the balance.","chinese":"美國夢和歐洲夢都正變得懸而未決。"},{"english":"The case is still pending.","chinese":"這個案子一直懸而未決。"}],"related":[]}