{"definition":["Gorbachev\/Mikhail Sergeyevich Gorbachev (1931-), last president of the Soviet Union 1991-1995"],"pinyin":["Ge1 er3 ba1 qiao2 fu1"],"simplified":["戈尔巴乔夫"],"rank":26256.0,"normalized_rank":0.3673555048759671,"fraction":0.0000013215354559810718,"cumulative_fraction":0.9860482448060116,"word":"戈爾巴喬夫","characters":[{"definition":["dagger-axe\/abbr. for 戈瑞[ge1 rui4]\/(Tw) abbr. for 戈雷[ge1 lei2]","surname Ge"],"pinyin":["Ge1","ge1"],"word":"戈"},{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"},{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"},{"definition":["surname Qiao","tall"],"pinyin":["Qiao2","qiao2"],"word":"喬"},{"definition":["(classical) this, that\/he, she, they\/(exclamatory final particle)\/(initial particle, introduces an opinion)","husband\/man\/manual worker\/conscripted laborer (old)"],"pinyin":["fu1","fu2"],"word":"夫"}],"containing_words":[],"sentences":[{"english":"Gorbachev has pursued some more eclectic interests as well.","chinese":"此外，戈爾巴喬夫的興趣可謂不拘一格。"},{"english":"This is also not what Gorbachev hoped for.","chinese":"這也是戈爾巴喬夫始料不及之處。"},{"english":"However, his remarks also show that he has not taken a big step.","chinese":"但戈爾巴喬夫講話也表明，他的步子邁得並不大。"},{"english":"Mr Gorbachev had his own “Jan”.","chinese":"戈爾巴喬夫也認識一位“簡”先生。"},{"english":"Gorbachev had few reform-minded aides.","chinese":"戈爾巴喬夫基本沒有擁有改革思想的幫手。"},{"english":"Gorbachev’s reforms either were ignored or they were enacted with perverse consequences.","chinese":"戈爾巴喬夫的改革要麼被忽略，要麼走回頭路。"},{"english":"Mikhail Gorbachev and his wife Raisa are going to board a plane.","chinese":"戈爾巴喬夫和他的妻子賴莎準備登機。"},{"english":"Well, after Gorbachev the world will never become as it was before.","chinese":"在戈爾巴喬夫之後世界再也不會回到以前。"},{"english":"The last months before the breakup of the USSR. Gorbachev welcomes the young military man from Uzbekistan.","chinese":"戈爾巴喬夫正在歡迎來自烏茲別克斯坦的年輕士兵。"},{"english":"Gorbachev hoped that the cooperatives would be the source of entrepreneurship.","chinese":"戈爾巴喬夫希望合作社能成爲企業家精神的源泉。"},{"english":"Gorbachov was an exemplary regional party secretary.","chinese":"戈爾巴喬夫是個典型的州黨委書記。"},{"english":"Gorbachev followed the Soviet tradition to kiss the party comrades as well.","chinese":"戈爾巴喬夫也不例外，按照蘇聯傳統親吻黨內同志。"},{"english":"Gorbachev had a fundamental coevolutionary insight, says Axelrod.","chinese":"戈爾巴喬夫具有基本的共同進化洞察力。"}],"related":[]}