{"definition":["to make one's name\/to become famous"],"pinyin":["cheng2 ming2"],"simplified":["成名"],"rank":7520.0,"normalized_rank":0.1052145565458285,"fraction":0.000013186013056811473,"cumulative_fraction":0.9037666925728326,"word":"成名","characters":[{"definition":["surname Cheng","to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth"],"pinyin":["Cheng2","cheng2"],"word":"成"},{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"}],"containing_words":[{"definition":["to win success and recognition (idiom)"],"pinyin":["gong1 cheng2 ming2 jiu4"],"word":"功成名就"},{"definition":["work that makes one's name"],"pinyin":["cheng2 ming2 zuo4"],"word":"成名作"}],"sentences":[{"english":"He gloried in his winning the championship.","chinese":"她獲得冠軍，一舉成名。"},{"english":"We do know however that Susan Boyle will now get a shot at stardom.","chinese":"但我們確實知道的是波伊爾現在將一舉成名。"},{"english":"Over-night fame has become a common phenomenon in our modern society.","chinese":"一夜成名成了現代社會的家常便飯。"},{"english":"Being affected by the Super Girl Contest, many young girls dream of becoming famous.","chinese":"受超女的影響，很多花季少女都開始夢想成名。"},{"english":"Four parents all embrace for a night sudden wealth, become famous for a night of by luck mental.","chinese":"四家長都抱有一夜暴富，一夜成名的僥倖心理。"},{"english":"Cheng's wife put her money on the table, lit joss sticks and kowtowed just like others there.","chinese":"成名的妻子把錢放在案上，象前邊的人一樣燒香跪拜。"},{"english":"Edison won his spurs as an inventor while young.","chinese":"愛迪生很年輕時就因創造發明而一舉成名。"},{"english":"Where has \"one ball becomes famous \" anhydrous series Gao Qing press plate time be loaded with?","chinese":"哪裏有《一球成名》系列高清無水印版下載？"},{"english":"A lot of successful is forced out.","chinese":"很多功成名就是逼出來的。"},{"english":"Celine and the girl sang one of her hit song together hand in hand , looking into each other's eyes deeply.","chinese":"席琳迪翁和女孩手拉手，共同演唱了她的一首成名曲。"},{"english":"For Zeng, this was just the start of her life in the spotlight.","chinese":"對曾晶來說，這僅僅是她成名之路的開始。"},{"english":"That song was his first hit and marked the beginning of his career.","chinese":"那首歌是他的成名曲，標誌着他歌唱職業生涯的開始。"},{"english":"The city is famous for Robin Hood and has a University in Ningbo.","chinese":"該城市羅賓漢成名並在寧波有一個大學。"},{"english":"These are cars which show you've arrived and had a good time along the way.","chinese":"這樣的車可以顯示你已功成名就，並且一路順風順水。"},{"english":"Here are some of the latest sensations. See what it takes to become famous.","chinese":"讓我們看看以下的網絡新星都是以什麼方式成名的吧。"},{"english":"In those years he just fought for fame.","chinese":"那些年，他只是爲成名而奮鬥。"}],"related":[{"definition":["to make one's first public performance (of an entertainer etc)\/to start one's career"],"pinyin":["chu1 dao4"],"word":"出道"},{"definition":["reputation\/fame"],"pinyin":["ming2 qi4"],"word":"名氣"},{"definition":["to hit the big time"],"pinyin":["da4 hong2 da4 zi3"],"word":"大紅大紫"},{"definition":["to win instant success (idiom)\/to become an instant hit"],"pinyin":["yi1 pao4 er2 hong2"],"word":"一炮而紅"},{"definition":["well-known for sth\/to become well known\/to make one's mark"],"pinyin":["chu1 ming2"],"word":"出名"},{"definition":["to rise to fame"],"pinyin":["sheng1 ming2 da4 zao4"],"word":"聲名大噪"},{"definition":["to amaze the world with a single brilliant feat (idiom); an overnight celebrity"],"pinyin":["yi1 ming2 jing1 ren2"],"word":"一鳴驚人"},{"definition":["work that makes one's name"],"pinyin":["cheng2 ming2 zuo4"],"word":"成名作"},{"definition":["to reveal outstanding talent (idiom); to stand out as conspicuously brilliant"],"pinyin":["zhan3 lu4 tou2 jiao3"],"word":"嶄露頭角"},{"definition":["to be popular\/to be in luck\/to have good luck\/to develop smoothly"],"pinyin":["zou3 hong2"],"word":"走紅"},{"definition":["to become famous\/to become notorious"],"pinyin":["yang2 ming2"],"word":"揚名"},{"definition":["currently popular (of movie stars, singers etc)"],"pinyin":["dang1 hong2"],"word":"當紅"},{"definition":["lit. like the sun at noon (idiom)\/fig. to be at the peak of one's power, career etc"],"pinyin":["ru2 ri4 zhong1 tian1"],"word":"如日中天"},{"definition":["to achieve fame among one's contemporaries (idiom); temporary or local celebrity"],"pinyin":["ming2 zao4 yi1 shi2"],"word":"名噪一時"},{"definition":["tremendously popular for a while"],"pinyin":["hong2 ji2 yi1 shi2"],"word":"紅極一時"},{"definition":["lit. it takes a long time to make a big pot (idiom); fig. a great talent matures slowly\/in the fullness of time a major figure will develop into a pillar of the state\/Rome wasn't built in a day"],"pinyin":["da4 qi4 wan3 cheng2"],"word":"大器晚成"}]}