{"definition":["will perhaps\/may (in the future)"],"pinyin":["huo4 jiang1"],"simplified":["或将"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"或將","characters":[{"definition":["maybe\/perhaps\/might\/possibly\/or"],"pinyin":["huo4"],"word":"或"},{"definition":["general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead","to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])"],"pinyin":["jiang1","jiang4","qiang1"],"word":"將"}],"containing_words":[],"sentences":[{"english":"Zheng Mian low adjustment has 6 trading days, or choose the direction in the late.","chinese":"鄭棉在低位調整已6個交易日，後期或將選擇方向。"},{"english":"It is illegal to shake carpets in the street, or to throw orange peels on the sidewalk.","chinese":"在街上甩動地毯或將橘子皮丟在人行道上是違法的。"},{"english":"New submarines could help challenge any Chinese seaborne assault on the self-governing island, which Beijing reserves the right to take by force.","chinese":"新潛艇或將幫助臺灣挑戰中國大陸的海上進攻力量。"},{"english":"Arrange cups in medication preparation area or move medication cart to position outside client's room.","chinese":"在藥物準備區備好杯子，或將藥車推到病房外。"},{"english":"Some people burn weeds or bury them deeply or make them into mulch.","chinese":"有些人會燒掉或深埋雜草，或將它們變爲地膜。"},{"english":"He did say that further Refi-rate cuts were not to be discounted.","chinese":"他還表示，歐洲央行或將進一步下調再融資利率水平。"},{"english":"Please take either of the following methods in disposing capacitors.","chinese":"在電容器殼體上開孔或將電容器壓碎後焚燒。"},{"english":"Incinerate them after crushing capacitors or making a hole on the capacitor body.","chinese":"在電容器殼體上開孔或將電容器壓碎後焚燒。"},{"english":"Don' t tuck it into your belt or use it as a bib .","chinese":"不要把它塞在你的皮帶裏，或將其當作圍嘴兒用。"},{"english":"Yes proceeds to generate the change script or transmit the modifications to the database.","chinese":"“是”將繼續生成更改腳本或將修改傳送到數據庫。"},{"english":"Any day now, you expect to hear rumblings about bringing back the 55 mile-per-hour speed limit.","chinese":"最近美國或將重拾55英里限速規定的傳言比比皆是。"},{"english":"Or will you use them to your own devious advantage?","chinese":"或將您使用他們自己的歪理邪說優勢？"},{"english":"Never bite straight into a roll, and refrain from cutting it in half and buttering.","chinese":"不要直接咬一卷麪包或將它只切成一半就放進油鍋煎。"},{"english":"At that time, the pontiff , Pope John Paul II may attend the meeting.","chinese":"屆時教宗若望保祿二世或將參加這次會議。"},{"english":"Through stormy ablution , internet industry of China or more will mature.","chinese":"經過暴風雨的洗禮，中國的互聯網行業或將更加成熟。"},{"english":"Infineon selling cellphone chip business to Intel?","chinese":"英飛凌或將出售手機芯片業務給英特爾？"}],"related":[]}