{"definition":["also called\/also known as\/a.k.a."],"pinyin":["huo4 cheng1"],"simplified":["或称"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"或稱","characters":[{"definition":["maybe\/perhaps\/might\/possibly\/or"],"pinyin":["huo4"],"word":"或"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"}],"containing_words":[],"sentences":[{"english":"This is the essential thesis of molecular genetics, sometimes called the central dogma .","chinese":"這就是分子遺傳學的基本論點，或稱中心法則。"},{"english":"Yuzhuan, also called \"Zhuanyu\", is an important category of traditional Chinese linguistics.","chinese":"語轉，或稱“轉語”，是傳統小學中的一個重要範疇。"},{"english":"A way around the problem is something called an induced pluripotent stem cell, or iPS.","chinese":"解決此問題可藉助於誘導多能幹細胞，或稱iPS。"},{"english":"Official documents generally can be called amanuensis materials or files.","chinese":"公文又統稱文書材料，或稱文件。"},{"english":"\"A clean room\"or\"a white room\", increasingly becomes shop talk.","chinese":"“清潔室”或稱“白室”，正日益變成專家們的行話。"},{"english":"Often the latifundia are surrounded by privately-owned small plots or minifundia.","chinese":"大莊園經常被私人所有的小地塊或稱小莊園所包圍。"},{"english":"There lived a great thane, or lord, called macbeth .","chinese":"有一個顯赫的爵士，或稱貴族，名叫麥克白。"},{"english":"To achieve this qualification, you must learn Road, also known as Boy and Girl try to get enrolled.","chinese":"要取得這種資格，必須在學道或稱童子試獲得取錄。"},{"english":"Majority of proteins in organisms are existed in a modulation of glycoprotein, also named glycoconjugates.","chinese":"機體的蛋白質大多以糖蛋白或稱糖複合物的形式存在。"},{"english":"The Lenten Rose, or Helleborus orientalis.","chinese":"四旬齋玫瑰，，或稱東方嚏根草。"},{"english":"A series of collapse craters, or calderas, lie at its summit.","chinese":"其頂端有一系列崩塌的火山口，或稱火山臼。"},{"english":"The drum sieve, tamis, is used in France when one is instructed to force food through a sieve.","chinese":"篩東西的時候法國人最常用的是筒篩，或稱細網篩。"}],"related":[]}