{"definition":["strategic partner"],"pinyin":["zhan4 lu:e4 huo3 ban4"],"simplified":["战略伙伴"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"戰略伙伴","characters":[{"definition":["to fight\/fight\/war\/battle"],"pinyin":["zhan4"],"word":"戰"},{"definition":["plan\/strategy\/outline\/summary\/slightly\/rather\/to rob\/to plunder\/to summarize\/to omit"],"pinyin":["lu:e4"],"word":"略"},{"definition":["meals (abbr. for 伙食[huo3 shi2])\/variant of 夥|伙[huo3]"],"pinyin":["huo3"],"word":"伙"},{"definition":["partner\/companion\/comrade\/associate\/to accompany"],"pinyin":["ban4"],"word":"伴"}],"containing_words":[],"sentences":[{"english":"Under the new situation, both countries should continue to push forward their comprehensive strategic partnership.","chinese":"新形勢下，雙方要繼續推進全面戰略伙伴關係。"},{"english":"Brazil wishes to continuously expand and deepen bilateral strategic partnership.","chinese":"巴西希望不斷擴大和深化巴中戰略伙伴關係。"},{"english":"As strategic partners, the EU and China will contribute to world peace and stability.","chinese":"歐中作爲戰略伙伴將會對世界和平與穩定作出貢獻。"},{"english":"Over the past year the all-round China-EU strategic partnership has made important progress mainly in the following aspects","chinese":"一年來，中歐全面戰略伙伴關係取得了重要進展。"},{"english":"Yang said recent years have witnessed smooth development of bilateral strategic partnership.","chinese":"楊潔篪說，近年來，中墨戰略伙伴關係發展順利。"},{"english":"Politically, both sides attach importance to deepening the bilateral all-round strategic partnership.","chinese":"政治上，雙方都重視深化中歐全面戰略伙伴關係。"},{"english":"Both sides reached extensive consensuses on jointly pushing forward China-Italy all-round strategic partnership.","chinese":"雙方就共同推進中意全面戰略伙伴關係達成廣泛共識。"},{"english":"Of course, these strategic partnerships rarely come without friction.","chinese":"當然，這種戰略伙伴關係很少不存在摩擦。"},{"english":"China-Kazakhstan strategic partnership has experienced comprehensive, deep and rapid development in recent years.","chinese":"近年來，中哈戰略伙伴關係全面深入快速發展。"},{"english":"These suggestions and plans will lay the groundwork for a new strategic partnership.","chinese":"這些建議和計劃將爲新的戰略伙伴關係鋪墊基礎。"},{"english":"\"The decision by the government of India is not related at all to the Indo-US strategic partnership,\" said Mahapatra.","chinese":"印度政府的決定與美印戰略伙伴關係沒有關係。"},{"english":"Building up the strategic alliance with the employees, to finally achieve 'win-win'situation .","chinese":"與員工建立合作雙贏的戰略伙伴關係。"},{"english":"President Hu made a five-point proposal for further promoting the China-Pakistan strategic partnership.","chinese":"胡錦濤就深化中巴戰略伙伴關係提出5點建議。"},{"english":"All these will further promote in-depth development of the China-Africa new-type strategic partnership.","chinese":"這些將進一步促進中非新型戰略伙伴關係的深入發展。"},{"english":"Both sides also agreed to make joint efforts to open a new era in the China-Canada strategic partnership.","chinese":"雙方同意共同努力開闢中加戰略伙伴關係發展新局面。"}],"related":[]}