{"definition":["a strategist"],"pinyin":["zhan4 lu:e4 jia1"],"simplified":["战略家"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"戰略家","characters":[{"definition":["to fight\/fight\/war\/battle"],"pinyin":["zhan4"],"word":"戰"},{"definition":["plan\/strategy\/outline\/summary\/slightly\/rather\/to rob\/to plunder\/to summarize\/to omit"],"pinyin":["lu:e4"],"word":"略"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[],"sentences":[{"english":"Many Japanese regarded him as the ablest Chinese strategist alive.","chinese":"許多日本人都認爲他是中國現有的最有才幹的戰略家。"},{"english":"The unique geo-strategic position has long attracted the attention of strategists from every part of the world.","chinese":"中國獨特的地緣戰略地位歷來爲各國戰略家所重視。"},{"english":"Zhou Tieshan is the founder and strategist of a Chinese high-class website. In April 2002, Mr.","chinese":"周鐵山先生是中國高端互聯網的先行者和戰略家。"},{"english":"Illustration by Jac DepczykEVERY financial crisis involves a tug of war between the tacticians and the strategists.","chinese":"每次金融危機的處理都會有戰術家和戰略家之爭。"},{"english":"EVERY financial crisis involves a tug of war between the tacticians and the strategists.","chinese":"每次金融危機的處理都會有戰術家和戰略家之爭。"},{"english":"EU strategists are already drawing up plans for a counter-offensive.","chinese":"歐盟的戰略家們已經準備好絕地大反擊了。"},{"english":"\"The American strategists can sleep in peace, \" he writes.","chinese":"“美國戰略家可以平靜的入睡了，”他寫道。"},{"english":"For Chinese strategists, however, the threats are still America and India.","chinese":"然而，中國的戰略家們仍然認爲威脅來自美國和印度。"}],"related":[]}