{"definition":["atrial fibrillation (abbr. for 心房顫動|心房颤动[xin1 fang2 chan4 dong4])"],"pinyin":["fang2 chan4"],"simplified":["房颤"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"房顫","characters":[{"definition":["house\/room\/CL:間|间[jian1]\/branch of an extended family\/classifier for family members (or concubines)","surname Fang"],"pinyin":["Fang2","fang2"],"word":"房"},{"definition":["to tremble\/to shiver\/to shake\/to vibrate\/Taiwan pr. [zhan4]"],"pinyin":["chan4"],"word":"顫"}],"containing_words":[{"definition":["atrial fibrillation"],"pinyin":["xin1 fang2 chan4 dong4"],"word":"心房顫動"}],"sentences":[{"english":"Warfarin is the better choice in the anticoagulative treatment of atrial fibrillation.","chinese":"而華法令是目前心房顫動抗凝較好的選擇。"},{"english":"Objective To ascertain the relevance of KCNE1 gene and lone atrial fibrillation.","chinese":"目的探討KCNE1基因與孤立性心房顫動的關係。"},{"english":"The attack of AF has its fundamental cause and trigger.","chinese":"心房顫動的發生常有其基礎病因和促發因素。"},{"english":"We sought to define the tolerability of warfarin among an elderly inception cohort with atrial fibrillation.","chinese":"我們尋求界定其在老年房顫病人隊列中的耐受性。"},{"english":"Focal atrial fibrillation treated by circumferential radiofrequency catheter ablation of pulmonary vein orifice.","chinese":"導管射頻肺靜脈口環狀消融治療局竈性心房顫動。"},{"english":"Nonpharmacologic atrial fibrillation therapies include surgery and catheter ablation.","chinese":"心房顫動的非藥物治療包括外科手術和導管消融。"},{"english":"Conclusion The left atrium enlargement is related to atrial fibrillation.","chinese":"結論左心房增大與心房顫動有密切關係。"},{"english":"The risk of stroke in patients with atrial fibrillation is about double that in the general population.","chinese":"中風的風險在心房顫動患者約一倍，在一般人口中。"},{"english":"Fibrosis of atrial myocytes may be involved in the occurrence and maintenance of AF.","chinese":"心房肌的纖維化與房顫的發生及維持有關。"},{"english":"The study did observe a small increase in the incidence of atrial fibrillation (AF) in patients who received zoledronic acid.","chinese":"觀察到這種療法心房顫動的可能性稍有增加。"},{"english":"Methods Electrocardiograms of 100 patients with Af and wide QRS were analyzed.","chinese":"方法分析100例心房顫動伴寬QRS波羣的心電圖。"},{"english":"Is Severe Sepsis Associated With New-Onset Atrial Fibrillation and Stroke?","chinese":"嚴重敗血症是否與新發房顫和卒中相關？"},{"english":"Antiinflammatory therapy has the potential to decrease the incidence of AF after cardiac surgery.","chinese":"抗炎治療有可能對降低術後房顫的發生起一定作用。"},{"english":"That mortality naturally to be completely unrelated with atrial fibrillation and do entirely to co-morbid disease.","chinese":"這些與房顫無關，而完全是由於並存的疾病所致。"},{"english":"The premature beats from lower right atrium and left atrial appendage showed higher inducibility of AF.","chinese":"低位右心房及左心耳部位的期前興奮易於誘發房顫。"},{"english":"Approximately one-third of strokes in AF patients are noncardioembolic.","chinese":"房顫患者約有三分之一的中風來自非心源性栓子。"}],"related":[]}