{"definition":["wherever one goes"],"pinyin":["suo3 dao4 zhi1 chu4"],"simplified":["所到之处"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"所到之處","characters":[{"definition":["actually\/place\/classifier for houses, small buildings, institutions etc\/that which\/particle introducing a relative clause or passive\/CL:個|个[ge4]"],"pinyin":["suo3"],"word":"所"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"Everywhere they appeared they were ovations.","chinese":"他們所到之處都有人歡呼。"},{"english":"He went to strike at the hedge, but where his sword met the thorns, great roses bloomed instead.","chinese":"他開始披荊斬棘，但是他寶劍所到之處都開出了薔薇。"},{"english":"This footprint damages and depletes almost everything in its path.","chinese":"這些足跡所到之處破壞並耗盡了幾乎一切資源。"},{"english":"Wherever he went, the wound soldier left behind him a trail of blood.","chinese":"傷員所到之處，都留下道道血跡。"},{"english":"They went to meet prime minister Jospin.","chinese":"所到之處，以滿足總理若斯潘。"},{"english":"Everywhere are the collapsed buildings, such as death or injury to life, a bleak.","chinese":"所到之處，都是殘垣斷壁如死傷的生命，一片淒涼。"},{"english":"The hurricane flattered crops, uprooted trees, washed away roads and rippled off roofs.","chinese":"颶風所到之處，莊稼倒伏，樹根拔起，房頂掀飛。"},{"english":"Everywhere you turn, people are talking about trends. On a CNN news show, a Chyron runs in the corner of the screen pointing out stories that are \"trending now.\"","chinese":"你所到之處，人們都在談論潮流。"},{"english":"It will give you a whole new perspective on the place you are visiting.","chinese":"這將給你一個全新的視角來觀察你們所到之處。"},{"english":"Wherever we looked, we saw evidence of destruction.","chinese":"我們的目光所到之處，都是毀壞的跡象。"},{"english":"The leaves rustled where Tim had disappeared into the underbrush.","chinese":"蒂姆消失在灌木從裏，他所到之處樹葉沙沙作響。"},{"english":"Everywhere he went, audiences reacted with almost delirious delight.","chinese":"他所到之處，聽衆無不歡欣若狂。"},{"english":"He leads an army so massive it shakes the ground with its march.","chinese":"他率領的部隊是如此豪壯，所到之處地動山搖。"}],"related":[]}