{"definition":["there is not much left"],"pinyin":["suo3 sheng4 wu2 ji3"],"simplified":["所剩无几"],"rank":21019.0,"normalized_rank":0.2940830803240385,"fraction":0.0000021524401080791897,"cumulative_fraction":0.9771514418510236,"word":"所剩無幾","characters":[{"definition":["actually\/place\/classifier for houses, small buildings, institutions etc\/that which\/particle introducing a relative clause or passive\/CL:個|个[ge4]"],"pinyin":["suo3"],"word":"所"},{"definition":["to remain\/to be left\/to have as remainder"],"pinyin":["sheng4"],"word":"剩"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["almost","how much\/how many\/several\/a few"],"pinyin":["ji1","ji3"],"word":"幾"}],"containing_words":[],"sentences":[{"english":"This is the only home of the red Colobus monkey but there are very few left.","chinese":"這是紅色疣猴的唯一棲息地，但是現在所剩無幾了。"},{"english":"The leaves of the trees left, the car in the snow in slowly moving forward.","chinese":"樹上的葉子所剩無幾，汽車在雪地中緩慢地行駛着。"},{"english":"There aren't too many examples of this style. of architecture left nowadays.","chinese":"現今這種風格的建築已所剩無幾了。"},{"english":"But by mid-2009 he was almost out of cash.","chinese":"但是到2009年年中，他手頭已經所剩無幾。"},{"english":"Send to the director for a promotion, you I am afraid one million there is not much left.","chinese":"送點給局長謀個升遷吧，事成恐怕一百萬所剩無幾。"},{"english":"I had compassion burn-out.","chinese":"我的激情已經所剩無幾。"},{"english":"The mine once had a rich vein of silver, but it petered out.","chinese":"這礦牀原有很豐富的銀礦，但已所剩無幾了。"},{"english":"There aren’t that many obvious topics left to write about, \" he says.","chinese":"“很顯然，現在值得寫的主題已所剩無幾，”他說。"},{"english":"There are very few potential bidders in their own right.","chinese":"憑藉他們本身的實力，潛在的收購方就所剩無幾。"},{"english":"In this case, not much is left for the transformation.","chinese":"在此情況下，留給轉換的細節所剩無幾。"},{"english":"Finally, beating the strength to text.","chinese":"到最後，連發短信的力氣都所剩無幾。"}],"related":[]}