{"definition":["location\/site"],"pinyin":["suo3 zai4 di4"],"simplified":["所在地"],"rank":5746.0,"normalized_rank":0.08039399493515034,"fraction":0.000019667419689481258,"cumulative_fraction":0.8751429233187291,"word":"所在地","characters":[{"definition":["actually\/place\/classifier for houses, small buildings, institutions etc\/that which\/particle introducing a relative clause or passive\/CL:個|个[ge4]"],"pinyin":["suo3"],"word":"所"},{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"},{"definition":["-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct","earth\/ground\/field\/place\/land\/CL:片[pian4]"],"pinyin":["de5","di4"],"word":"地"}],"containing_words":[],"sentences":[{"english":"The focal point of the construction lies at the W?hringerstrasse, where the main entrance, accessible through an inviting hall, is located.","chinese":"大樓結構的焦點位於由大廳可到達的主入口所在地。"},{"english":"Zhongguanchun is home to China's hi-tech industry and more than ten famous universities.","chinese":"中關村是中國高技術產業和十多所著名大學的所在地。"},{"english":"The second place we visited was Monaco Ville with the palace.","chinese":"我們參觀的第二個地方是王宮的所在地摩納哥維爾。"},{"english":"The site of the condominium is enclosed with stakes.","chinese":"公寓所在地的四周用木椿圍了起來。"},{"english":"At the same time, it shall report to the administrative department at the provincial level where it is located.","chinese":"同時，抄報其所在地省級工商行政管理部門。"},{"english":"It was also the seat of the Chinese viceroy of the three Manchurian provinces.","chinese":"這也是東北三個省所在地的中國總督的。"},{"english":"From Xichang, we drove three hours to Zhaojue, the area's county seat.","chinese":"我們的車開了3個小時到達昭覺縣所在地。"},{"english":"It is situated from Beiyu commune about 38 kilometers.","chinese":"格薩爾達拉距白玉鄉府所在地38公里。"},{"english":"Shiyan is an emerging auto industry city, the seat of China's Second steam.","chinese":"十堰是一座新興的汽車工業城市，爲中國二汽所在地。"},{"english":"The situs test also applies in relation to tangible movable property.","chinese":"財產所在地規則同樣適用於有形動產。"},{"english":"Spring town has a long history, outstanding people, is the seat of the ancient Yue state capital.","chinese":"泉水鎮歷史悠久，人傑地靈，是古越州府所在地。"},{"english":"It is also home to the Lanxiang Vocational School, which was founded with military support.","chinese":"同樣是藍翔職業技術學校所在地。"},{"english":"Weifang is the hometown of kites as well as the headquarter of World Kite Federation.","chinese":"濰坊是風箏的故鄉，是世界風箏聯合會總部所在地。"},{"english":"The establishment of adjudicatory apparatus and administrative offices of the maritime courts shall be decided by the Supreme People's Court.","chinese":"海事法院對所在地的市人民代表大會常務委員會負責。"},{"english":"Graphic logo with the company's coat of Stuttgart where city emblem.","chinese":"圖形車標採用公司所在地斯圖加特市的盾形市徽。"},{"english":"For Wanjiazhai Yellow River Water Control Project and the location of the project leader.","chinese":"爲萬家寨水利樞紐工程和引黃工程龍頭所在地。"}],"related":[{"definition":["current address\/place of residence"],"pinyin":["ju1 zhu4 di4"],"word":"居住地"},{"definition":["station\/encampment"],"pinyin":["zhu4 di4"],"word":"駐地"},{"definition":["to administer\/to have jurisdiction (over)"],"pinyin":["guan3 xia2"],"word":"管轄"},{"definition":["place\/location\/(after a noun) place where it is located"],"pinyin":["suo3 zai4"],"word":"所在"},{"definition":["dependency\/possession\/annexed territory"],"pinyin":["shu3 di4"],"word":"屬地"},{"definition":["habitation\/dwelling place\/residence\/CL:處|处[chu4]"],"pinyin":["zhu4 suo3"],"word":"住所"},{"definition":["located at\/set up in a particular location"],"pinyin":["she4 zai4"],"word":"設在"},{"definition":["one's affiliation (i.e. the organization one is affiliated with)\/subordinate (i.e. those subordinate to oneself)\/belonging to\/affiliated\/under one's command"],"pinyin":["suo3 shu3"],"word":"所屬"},{"definition":["general headquarters"],"pinyin":["zong3 bu4"],"word":"總部"},{"definition":["capital city of an autonomous region"],"pinyin":["shou3 fu3"],"word":"首府"},{"definition":["to press down\/to calm\/to subdue\/to suppress\/to guard\/garrison\/small town\/to cool or chill (food or drinks)"],"pinyin":["zhen4"],"word":"鎮"},{"definition":["to be situated\/to be located (of a building)"],"pinyin":["zuo4 luo4"],"word":"坐落"},{"definition":["administrative district"],"pinyin":["xing2 zheng4 qu1"],"word":"行政區"},{"definition":["within the borders\/internal (to a country, province, city etc)\/domestic"],"pinyin":["jing4 nei4"],"word":"境內"},{"definition":["geographical location"],"pinyin":["di4 li3 wei4 zhi5"],"word":"地理位置"},{"definition":["former site\/old location"],"pinyin":["jiu4 zhi3"],"word":"舊址"}]}