{"definition":["affiliated unit\/subsidiary"],"pinyin":["suo3 shu3 dan1 wei4"],"simplified":["所属单位"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"所屬單位","characters":[{"definition":["actually\/place\/classifier for houses, small buildings, institutions etc\/that which\/particle introducing a relative clause or passive\/CL:個|个[ge4]"],"pinyin":["suo3"],"word":"所"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"},{"definition":["bill\/list\/form\/single\/only\/sole\/odd number\/CL:個|个[ge4]","surname Shan"],"pinyin":["Shan4","dan1"],"word":"單"},{"definition":["position\/location\/place\/seat\/classifier for people (honorific)\/classifier for binary bits (e.g. 十六位 16-bit or 2 bytes)\/(physics) potential"],"pinyin":["wei4"],"word":"位"}],"containing_words":[],"sentences":[{"english":"Neither officer nor soldier wore any insignia showing either rank or unit.","chinese":"官兵都不佩戴任何表明軍階或所屬單位的符號。"},{"english":"The head of a business unit shall be responsible for all risk management matters in the unit under management.","chinese":"業務單位主管總承其所屬單位的全部風險管理事宜。"},{"english":"This method is applicable for all employees of various departments of the company.","chinese":"本辦法適用於公司所屬單位各員工。"},{"english":"To be responsible for management of land used by Central Government institutions and their affiliated institutions.","chinese":"負責中央國家機關及所屬單位用地管理工作。"},{"english":"Most of these individuals came to the effort with the full support and assistance of the institutions with which they were affiliated.","chinese":"他們中多數人還得到所屬單位的大力支持和幫助。"}],"related":[]}