{"definition":["so-called\/what is called"],"pinyin":["suo3 wei4"],"simplified":["所谓"],"rank":1480.0,"normalized_rank":0.020707120171253483,"fraction":0.00010812694201527491,"cumulative_fraction":0.6830760000240056,"word":"所謂","characters":[{"definition":["actually\/place\/classifier for houses, small buildings, institutions etc\/that which\/particle introducing a relative clause or passive\/CL:個|个[ge4]"],"pinyin":["suo3"],"word":"所"},{"definition":["surname Wei","to speak\/to say\/to name\/to designate\/meaning\/sense"],"pinyin":["Wei4","wei4"],"word":"謂"}],"containing_words":[{"definition":["to be indifferent\/not to matter\/cannot be said to be"],"pinyin":["wu2 suo3 wei4"],"word":"無所謂"}],"sentences":[{"english":"The so-called tennis fracture is a fracture of the base of the 5. th metatarsal bone .","chinese":"所謂的網球性骨折，就是在第五跖骨基部的骨折。"},{"english":"So-called choices are just illusions which have never existed.","chinese":"所謂的選擇只是個未曾存在的虛像。"},{"english":"This is the synchronization process.","chinese":"這就是所謂的同步化過程。"},{"english":"Some called the artist brave and hardworking.","chinese":"有些所謂的藝術家勤勞勇敢的。"},{"english":"Crowning \"stars\" among literary upstarts is killing them.","chinese":"把所謂“明星”捧做文唐袈貴即是抹殺他們。"},{"english":"The so - called poet ground out some verses.","chinese":"這個所謂的詩人搜索枯腸做成幾句詩。"},{"english":"Some media reports have argued that a strong China will pursue hegemony, and have made an issue of it.","chinese":"一些媒體炒作所謂中國“國強必霸”。"},{"english":"The other is to form'core-shell'structure that releases the static charge.","chinese":"形成所謂的“芯殼結構”來泄漏靜電荷。"},{"english":"So I guess he is what they call \"natural late talker\".","chinese":"所以我猜他是他們所謂的“語遲者”。"},{"english":"Thus, the actual residence and the property was formed between a so-called lease.","chinese":"因此，實際居住和財產之間形成一個所謂的租賃。"},{"english":"Each tooth has a space, the so-called pulp cavity.","chinese":"我們每顆牙齒裏面都有一個空間，即所謂的牙髓腔。"},{"english":"The so-called \"green barriers\" cannot be completely eliminated in a short term.","chinese":"所謂的“綠色壁壘”短期內沒可能完全消除。"},{"english":"By the 20th century, views similar to Berkeley's were called phenomenalism.","chinese":"到20世紀，類似伯克利的觀點是所謂的現象論。"},{"english":"Generally, a linear least squares problem leads to ihc solution of the so called normal equation.","chinese":"解線性最小二乘問題時，通常都要解所謂正規方程。"},{"english":"This is why the so-called Swans Hadith is definitely rejected.","chinese":"這就是爲何所謂的冠鶴聖訓被完全拒絕的原因。"},{"english":"To their surprise, the so-called investor is a swindler.","chinese":"令他們喫驚的是，那個所謂的投資商是騙子。"}],"related":[{"definition":["to expound Buddhist teachings","way of speaking\/wording\/formulation\/one's version (of events)\/statement\/theory\/hypothesis\/interpretation"],"pinyin":["shuo1 fa3","shuo1 fa5"],"word":"說法"},{"definition":["actually\/in fact\/really"],"pinyin":["qi2 shi2"],"word":"其實"},{"definition":["these"],"pinyin":["zhe4 xie1"],"word":"這些"},{"definition":["only natural\/as it should be\/certainly\/of course\/without doubt"],"pinyin":["dang1 ran2"],"word":"當然"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"認為"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"},{"definition":["in a word\/in short\/in brief"],"pinyin":["zong3 zhi1"],"word":"總之"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"則"},{"definition":["this\/this kind of\/this sort of\/this type of"],"pinyin":["zhe4 zhong3"],"word":"這種"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或許"},{"definition":["this\/this one"],"pinyin":["zhe4 ge5"],"word":"這個"},{"definition":["this kind of\/so\/this way\/like this\/such"],"pinyin":["zhe4 yang4"],"word":"這樣"},{"definition":["ought to\/should\/must"],"pinyin":["ying1 gai1"],"word":"應該"},{"definition":["regarding\/as far as sth is concerned\/with regards to"],"pinyin":["dui4 yu2"],"word":"對於"}]}