{"definition":["the feel (of sth touched with the hand)\/(textiles) handle"],"pinyin":["shou3 gan3"],"simplified":["手感"],"rank":7979.0,"normalized_rank":0.11163656205839967,"fraction":0.000012005637966005887,"cumulative_fraction":0.9095469883706636,"word":"手感","characters":[{"definition":["hand\/(formal) to hold\/person engaged in certain types of work\/person skilled in certain types of work\/personal(ly)\/convenient\/classifier for skill\/CL:雙|双[shuang1],隻|只[zhi1]"],"pinyin":["shou3"],"word":"手"},{"definition":["to feel\/to move\/to touch\/to affect\/feeling\/emotion\/(suffix) sense of ~"],"pinyin":["gan3"],"word":"感"}],"containing_words":[],"sentences":[{"english":"The products made of well-selected wool feel soft (have a soft feel).","chinese":"用料上乘的羊毛製品，手感柔軟。"},{"english":"Micro-channels filled with different materials in order to increase the speed and feeling.","chinese":"微坑道填充不同的材料以提高速度和手感。"},{"english":"This paper is smooth to the touch.","chinese":"這種紙張手感平滑。"},{"english":"The GR223 grip has great flexibility with a protective membrane layer that adds softness and comfort.","chinese":"伸縮彈性好，具有護膜的握把膠，手感柔軟舒服。"},{"english":"Uncle Feel, Are you serious, or just kidding?","chinese":"叔叔手感，你是稀瑞耳屎先生還是賈斯特。雞丁？"},{"english":"Fold back the cover and read comfortably with just one hand.","chinese":"反折的覆蓋面和閱讀只有一個手感舒適。"},{"english":"The quality is superior, yet the price is very reasonable. It feels soft and smooth.","chinese":"該產品質優價廉，手感柔軟光滑。"},{"english":"This quality does have sueded face and brushed back and soft handfeel which we like.","chinese":"這個品質絨布的正面爲仿皮，背面爲拉絨，手感柔軟。"},{"english":"Because An more expensive racket only gives you more comfortable hand feelings!","chinese":"因爲貴點的球拍僅僅給你提供了更舒適的手感。"},{"english":"The proposal buys those feel exquisite, of withy function beautiful.","chinese":"建議購買那些手感細膩，柔韌性能佳的。"},{"english":"My skin texture has improved to feel soft and silky without any greasiness.","chinese":"我的皮膚紋理有改進，手感柔軟，沒有任何油膩柔滑。"},{"english":"Our TW playtesters found a comfortable response with lots of feel and control with this racquet.","chinese":"在實際使用會感受到這支球拍的良好控球及舒適手感。"},{"english":"It is cool to the touch and very absorbent .","chinese":"它的手感非常好並且非常吸汗。"},{"english":"The fibre whiteness is better and lofty, has no bast-fibre scratchiness.","chinese":"白度好，手感柔軟，無麻類纖維的刺癢感。"},{"english":"Craquelure is even and clear. Do not lose varnish. Smooth handle.","chinese":"裂紋效果明顯均勻，不掉漆，手感平整。"},{"english":"Cotton sateen fabric feels soft and smooth on the skin.","chinese":"棉緞面料手感柔軟，皮膚光滑。"}],"related":[{"definition":["hit rate\/scoring rate"],"pinyin":["ming4 zhong4 lu:4"],"word":"命中率"},{"definition":["front sight (firearms)\/the zero point indicator marked on a steelyard"],"pinyin":["zhun3 xing1"],"word":"準星"},{"definition":["somewhat\/to some degree"],"pinyin":["san1 fen1"],"word":"三分"},{"definition":["to score"],"pinyin":["de2 fen1"],"word":"得分"},{"definition":["tactile sensation\/touch\/feel"],"pinyin":["chu4 gan3"],"word":"觸感"},{"definition":["(military) line of troops encircling an enemy position\/(telephony) outside line\/(basketball) outside the three-point line"],"pinyin":["wai4 xian4"],"word":"外線"},{"definition":["to hit (a target)"],"pinyin":["ming4 zhong4"],"word":"命中"},{"definition":["to shoot for the basket (basketball)"],"pinyin":["tou2 lan2"],"word":"投籃"},{"definition":["opening (chess etc)\/early stage of game, match, work, activity etc"],"pinyin":["kai1 ju2"],"word":"開局"},{"definition":["to attack\/to assault\/to go on the offensive\/attack\/assault\/offense (sports)"],"pinyin":["jin4 gong1"],"word":"進攻"},{"definition":["half of a game or contest\/half-court"],"pinyin":["ban4 chang3"],"word":"半場"},{"definition":["not up to scratch\/subpar\/off\/gone awry\/(of an instrument) to be out of kilter\/(of a forecast) to be off the mark"],"pinyin":["shi1 zhun3"],"word":"失準"},{"definition":["to hit the target with one's throw\/(basketball) to score"],"pinyin":["tou2 zhong4"],"word":"投中"},{"definition":["penalty shot\/penalty kick (in sports)"],"pinyin":["fa2 qiu2"],"word":"罰球"},{"definition":["inessentials\/minor detail"],"pinyin":["mo4 jie2"],"word":"末節"},{"definition":["to cast\/to send\/to throw oneself (into the river etc)\/to seek refuge\/to place oneself into the hands of"],"pinyin":["tou2"],"word":"投"}]}