{"definition":["lit. to give sb a slap, then offer a sweet date (idiom)\/fig. to deal harshly with sb, then offer sth by way of consolation"],"pinyin":["da3 yi1 ba1 zhang5 , gei3 ge4 tian2 zao3"],"simplified":["打一巴掌，给个甜枣"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"打一巴掌，給個甜棗","characters":[{"definition":["dozen (loanword)","to beat\/to strike\/to hit\/to break\/to type\/to mix up\/to build\/to fight\/to fetch\/to make\/to tie up\/to issue\/to shoot\/to calculate\/to play (a game)\/since\/from"],"pinyin":["da2","da3"],"word":"打"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"},{"definition":["palm of the hand\/sole of the foot\/paw\/horseshoe\/to slap\/to hold in one's hand\/to wield"],"pinyin":["zhang3"],"word":"掌"},{"word":"，"},{"definition":["to supply\/to provide","to\/for\/for the benefit of\/to give\/to allow\/to do sth (for sb)\/(grammatical equivalent of 被)\/(grammatical equivalent of 把)\/(sentence intensifier)"],"pinyin":["gei3","ji3"],"word":"給"},{"definition":["individual\/this\/that\/size\/classifier for people or objects in general"],"pinyin":["ge4"],"word":"個"},{"definition":["sweet"],"pinyin":["tian2"],"word":"甜"},{"definition":["jujube\/dates"],"pinyin":["zao3"],"word":"棗"}],"containing_words":[],"sentences":[],"related":[]}