{"definition":["print head"],"pinyin":["da3 yin4 tou2"],"simplified":["打印头"],"rank":50489.0,"normalized_rank":0.7064066150854169,"fraction":1.3663505874276852e-7,"cumulative_fraction":0.9990285809337214,"word":"打印頭","characters":[{"definition":["dozen (loanword)","to beat\/to strike\/to hit\/to break\/to type\/to mix up\/to build\/to fight\/to fetch\/to make\/to tie up\/to issue\/to shoot\/to calculate\/to play (a game)\/since\/from"],"pinyin":["da2","da3"],"word":"打"},{"definition":["surname Yin\/abbr. for 印度[Yin4 du4]","to print\/to mark\/to engrave\/a seal\/a print\/a stamp\/a mark\/a trace\/image"],"pinyin":["Yin4","yin4"],"word":"印"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"}],"containing_words":[],"sentences":[{"english":"The 4D adjustable printer head is convenient for printing labels of different materials.","chinese":"四向位可調式打印頭，便於配合不同標籤材質的應用。"},{"english":"In most cases the printhead will come with a limited time warranty.","chinese":"在大多數情況下，打印頭會在有限的時間保證。"},{"english":"Measure the printhead gap to the platen.","chinese":"測量滾筒打印頭的差距。"},{"english":"The more pins a printhead has, the better print quality it can achieve.","chinese":"打印頭腳越有，更好的打印質量它可以實現的。"},{"english":"Yeah. But we also have a print head for printing our binder materials to solidify the particles.","chinese":"我們還有一個可以噴射膠黏劑的打印頭。"},{"english":"Squeeze the handle of the Print Head Latch and lift it to release the print heads.","chinese":"擠壓打印頭卡齒的把子，將其擡起來釋放打印頭。"},{"english":"Squeeze the handle of the Print Head Latch and lift it to release the print heads.","chinese":"擠壓打印頭卡齒的把子，將其擡起來釋放打印頭。"},{"english":"Having your old printhead rebuilt is in most cases, cheaper than buying a new one.","chinese":"改建舊有打印頭在大多數情況下，比買新的便宜。"},{"english":"The rebuilt printhead is repaired to meet the manufactures specifications.","chinese":"打印頭的修復重建，以滿足生產要求。"},{"english":"A faulty printhead cable can cause dots to be missing intermittently.","chinese":"一個打印頭電纜故障點，以可導致間歇性丟失。"},{"english":"Then realign the print head using the new values by clicking Apply.","chinese":"然後用新數值重新調整打印頭，單擊“應用”。"},{"english":"The print cartridge of chromatograph integrator is expensive and usually becomes a waste while ink is used up.","chinese":"色譜數據處理機專用噴墨打印頭是一種高值易耗品。"}],"related":[]}