{"definition":["to work hard\/to try to make a living"],"pinyin":["da3 pin1"],"simplified":["打拼"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"打拼","characters":[{"definition":["dozen (loanword)","to beat\/to strike\/to hit\/to break\/to type\/to mix up\/to build\/to fight\/to fetch\/to make\/to tie up\/to issue\/to shoot\/to calculate\/to play (a game)\/since\/from"],"pinyin":["da2","da3"],"word":"打"},{"definition":["to piece together\/to join together\/to stake all\/adventurous\/at the risk of one's life\/to spell"],"pinyin":["pin1"],"word":"拼"}],"containing_words":[],"sentences":[{"english":"Persist to work hard in her the dream that that freedom write as of oldly.","chinese":"依舊的在她的那自由撰稿的夢裏執着着打拼着呀。"},{"english":"I fight, So you don't have to, Live a better life.","chinese":"我打拼，所以你不用打拼，活得更精彩吧。"},{"english":"I fight, So you don't have to, Live a better life.","chinese":"我打拼，所以你不用打拼，活得更精彩吧。"},{"english":"We all should compete like slaves?","chinese":"我們要象奴隸一樣打拼嗎？"},{"english":"Have heber far go to Singapore to fight career.","chinese":"有希遠赴新加波打拼事業。"},{"english":"For some kinds of work, all you need is a handful of talented colleagues.","chinese":"一些工作，你只要一幫聰明的同事一起打拼就夠了。"},{"english":"At 17, she moved to Paris to try her hand at modeling.","chinese":"在17歲，她搬至巴黎一手打拼她的模特事業。"},{"english":"Fights in Shanghai they like working as eldest child's feeling.","chinese":"在上海灘打拼的他們更喜歡當老大的感覺。"},{"english":"who are just trying to, you know, make it through the, you know, through life.","chinese":"這些人試着度過難關，打拼人生。"},{"english":"There, in order to have a colony of the hut, they fight dogged.","chinese":"在那裏，爲了有一個棲居的小屋，他們頑強的打拼着。"},{"english":"When two people are really in love, they should strive to build a bright future for themselves.","chinese":"兩人真心相愛時，應努力打拼爲自己開創光明的前途。"},{"english":"Pluvial contain, news fastens one's previous experience, hit in the TV station by actual strength go all out old.","chinese":"雨涵，新聞系出身，憑實力在電視臺打拼多年。"},{"english":"All of them are now pursuing their careers in Miami.","chinese":"目前，他們中所有的人都在邁阿密爲事業打拼。"},{"english":"She Zhuyeqing from humble origin, a little hard to go today this step.","chinese":"她竹葉青從小苦出身，一點點打拼才走到今天這一步。"},{"english":"During the days in Shengzhen, Zhong Lijun went all out, working round the clock.","chinese":"在深圳的日子裏鍾麗君不分晝夜的奮力打拼。"},{"english":"They earned their own success.","chinese":"他們自己打拼成功。"}],"related":[{"definition":["to leave home to make one's way in the world\/to leave the life one knows to seek success"],"pinyin":["chuang3 dang4"],"word":"闖蕩"},{"definition":["to strive\/to struggle"],"pinyin":["fen4 dou4"],"word":"奮鬥"},{"definition":["to struggle\/to wrestle"],"pinyin":["pin1 bo2"],"word":"拼搏"},{"definition":["to work a temporary or casual job\/(of students) to have a job outside of class time, or during vacation"],"pinyin":["da3 gong1"],"word":"打工"},{"definition":["to go through challenging experiences\/to become seasoned (in one's profession etc)"],"pinyin":["mo1 pa2 gun3 da3"],"word":"摸爬滾打"},{"definition":["to leave one's native place, esp. against one's will (idiom)"],"pinyin":["bei4 jing3 li2 xiang1"],"word":"背井離鄉"},{"definition":["to make it\/to be somebody"],"pinyin":["hun4 chu1 ming2 tang5"],"word":"混出名堂"},{"definition":["stable household, established profession (idiom); settled and comfortably off"],"pinyin":["an1 jia1 li4 ye4"],"word":"安家立業"},{"definition":["to eke out a living\/to live from hand to mouth\/to drift aimlessly"],"pinyin":["tao3 sheng1 huo2"],"word":"討生活"},{"definition":["migrant worker living and working in Beijing without a residence permit"],"pinyin":["Bei3 piao1"],"word":"北漂"},{"definition":["to stand out among one's peers (idiom)\/to excel"],"pinyin":["chu1 ren2 tou2 di4"],"word":"出人頭地"},{"definition":["to build up from nothing\/to start from scratch"],"pinyin":["bai2 shou3 qi3 jia1"],"word":"白手起家"},{"definition":["to leave one's homeplace (to find work, flee disaster etc)"],"pinyin":["li2 xiang1 bei4 jing3"],"word":"離鄉背井"},{"definition":["to drift (in the tide)\/to rove\/to lead a wandering existence\/drifter\/wanderer"],"pinyin":["piao1 bo2"],"word":"漂泊"},{"definition":["to make money"],"pinyin":["zheng4 qian2"],"word":"掙錢"},{"definition":["to support one's family (idiom); to have difficulty feeding a family"],"pinyin":["yang3 jia1 hu2 kou3"],"word":"養家糊口"}]}