{"definition":["to disturb\/to trouble"],"pinyin":["da3 jiao3"],"simplified":["打搅"],"rank":35643.0,"normalized_rank":0.4986918136918837,"fraction":5.732541406868075e-7,"cumulative_fraction":0.9944272057056256,"word":"打攪","characters":[{"definition":["dozen (loanword)","to beat\/to strike\/to hit\/to break\/to type\/to mix up\/to build\/to fight\/to fetch\/to make\/to tie up\/to issue\/to shoot\/to calculate\/to play (a game)\/since\/from"],"pinyin":["da2","da3"],"word":"打"},{"definition":["to disturb\/to annoy\/to mix\/to stir"],"pinyin":["jiao3"],"word":"攪"}],"containing_words":[],"sentences":[{"english":"In circumstance of, if have what matter confuse, be a then it possible to be life it loses.","chinese":"萬一，要是有什麼事打攪了，那便可能是性命之失。"},{"english":"Money mother hope xu fei don't bother to mention.","chinese":"錢母希望許飛不要再來打攪多多。"},{"english":"When he is feeding his face the hates being bothered.","chinese":"他喫飯時，最討厭別人打攪他。"},{"english":"He evidently wished no repetition of my intrusion.","chinese":"而他顯然並不願我再來打攪。"},{"english":"Excuse meand would you tell me where I can get some ender?","chinese":"打攪一下，您能通知我黃油在哪兒賣嗎？"},{"english":"During the fifty-four years that I have inhabited this planet, I.","chinese":"我住在這個星球上五十四年以來，只被打攪過三次。"},{"english":"He's not breaking any laws, except maybe disturbing the peace.","chinese":"他並沒違背任何法律，除了或許他打攪了社區的寧靜。"},{"english":"The ringing didn't disturb Mary Jane, who was asleep on the couch, face down.","chinese":"鈴聲並沒有打攪瑪麗簡，她面朝下在沙發上睡着了。"},{"english":"Don't bother me, I'm taking notes.","chinese":"別打攪我，人家在記筆記呢。"},{"english":"Excuse me- would you tell me where I can get some remainhinder?","chinese":"打攪一下，您能通知我黃油在哪兒賣嗎？"},{"english":"I do hope that we can share some good things if I don't disturb you.","chinese":"如果不打攪大家，希望能經常貼點東西來共享。"},{"english":"I was Very discreet and didn't disturb you, just to see when you'd speak to me.","chinese":"我知趣得很，決不打攪你，看你什麼時候跟我說話。"},{"english":"We felt it best not to disturb them any further.","chinese":"我們決定最好別去打攪他們。"},{"english":"This developer would be disturbed for an entire sprint.","chinese":"這個開發人員在整個sprint中都可以被人打攪。"},{"english":"He could do nothing to disturb them.","chinese":"他做什麼都打攪不了她們。"},{"english":"Excuse me. I'm an accountant from Zhonglian Corporation.","chinese":"打攪一下，我是中聯公司的會計。"}],"related":[]}