{"definition":["to ask about\/to make some inquiries\/to ask around"],"pinyin":["da3 ting5"],"simplified":["打听"],"rank":7942.0,"normalized_rank":0.11111888405411834,"fraction":0.000012103151020749658,"cumulative_fraction":0.9091009327110088,"word":"打聽","characters":[{"definition":["dozen (loanword)","to beat\/to strike\/to hit\/to break\/to type\/to mix up\/to build\/to fight\/to fetch\/to make\/to tie up\/to issue\/to shoot\/to calculate\/to play (a game)\/since\/from"],"pinyin":["da2","da3"],"word":"打"},{"definition":["(literary pronunciation, still advocated in Taiwan) to rule\/to sentence\/to allow","to listen\/to hear\/to obey\/a can (loanword from English \"tin\")\/classifier for canned beverages"],"pinyin":["ting1","ting4"],"word":"聽"}],"containing_words":[],"sentences":[{"english":"Those busybodies always seemed to have some-thing to gossip about.","chinese":"薩拉是個好管閒事的人，老是打聽別人的事。"},{"english":"I will ask around and see if anyone can help.","chinese":"我要四處打聽一下，看有沒有人能夠幫忙。"},{"english":"The carline is fond of prying into others's things.","chinese":"這位老太婆愛打聽別人家的事。"},{"english":"Sechang go, show good notice spirit inquire of front of vibration.","chinese":"世昌不知所終，展良通知巧靈向振鋒打聽。"},{"english":"She often inquires of me about your father.","chinese":"她常常向我打聽你的父親的情況。"},{"english":"He was also not much ceremonious, returned apt ugg then hurriedly let the matchmaker base out.","chinese":"他也不多客套，回去就趕緊讓媒婆打聽了。"},{"english":"I started asking acquaintances if anyone was looking for a good sushi chef.","chinese":"我開始向熟人打聽是否有人需要一個優秀的壽司主廚。"},{"english":"Desdemona. Can you inquire him out, and be edified by report?","chinese":"苔絲狄蒙娜你可以打聽打聽他在什麼地方呀。"},{"english":"Desdemona. Can you inquire him out, and be edified by report?","chinese":"苔絲狄蒙娜你可以打聽打聽他在什麼地方呀。"},{"english":"I'll telephone him and ask him to go there to inquire about it.","chinese":"我可以打電話給他請他去劇院打聽一下。"},{"english":"I'll inquire about the price of the tickets.","chinese":"我要去打聽一下票價。"},{"english":"The porter and I looked at each other and smiled.","chinese":"我不認去留館的路，就像一個搬運工打聽。"},{"english":"And of everything that he met he made inquiry if perchance they had seen his mother.","chinese":"他向一路上遇到的所有人打聽是否遇見過他的媽媽。"},{"english":"Iwould like to know whether I can cash a cheque here.","chinese":"我想認識打聽我能否在這兌換支票。"},{"english":"You can ask all the sec 1 students, now all their classes have been changed to self-revision.","chinese":"你可以打聽一下初一年級的學生，他們的課都自習了。"},{"english":"I enquired at the porters' lodge. A middle-aged man with a kindly face came forward.","chinese":"我到門房去打聽，一位和藹善良的中年人走上前來。"}],"related":[{"definition":["to inquire"],"pinyin":["xun2 wen4"],"word":"詢問"},{"definition":["to press charges\/to file a complaint","to tell\/to inform\/to let know"],"pinyin":["gao4 su4","gao4 su5"],"word":"告訴"},{"definition":["all over the place\/everywhere and all directions"],"pinyin":["si4 chu4"],"word":"四處"},{"definition":["to help\/to lend a hand\/to do a favor\/to do a good turn"],"pinyin":["bang1 mang2"],"word":"幫忙"},{"definition":["to search\/to look for\/to seek"],"pinyin":["xun2"],"word":"尋"},{"definition":["to introduce (sb to sb)\/to give a presentation\/to present (sb for a job etc)\/introduction"],"pinyin":["jie4 shao4"],"word":"介紹"},{"definition":["to get in touch with\/to contact\/to stay in contact (with)\/liaison\/(math.) connection"],"pinyin":["lian2 luo4"],"word":"聯絡"},{"definition":["this side\/here"],"pinyin":["zhe4 bian1"],"word":"這邊"},{"definition":["to make a telephone call"],"pinyin":["da3 dian4 hua4"],"word":"打電話"},{"definition":["here"],"pinyin":["zhe4 'r"],"word":"這兒"},{"definition":["to conceal\/to hide (a taboo subject)\/to cover up the truth"],"pinyin":["yin3 man2"],"word":"隱瞞"},{"definition":["daughter-in-law\/wife (of a younger man)\/young married woman\/young woman"],"pinyin":["xi2 fu4"],"word":"媳婦"},{"definition":["to help\/to assist\/to support\/for sb (i.e. as a help)\/hired (as worker)\/side (of pail, boat etc)\/outer layer\/upper (of a shoe)\/group\/gang\/clique\/party\/secret society"],"pinyin":["bang1"],"word":"幫"},{"definition":["over there\/yonder"],"pinyin":["na4 bian5"],"word":"那邊"},{"definition":["not in good condition\/wrong\/fishy"],"pinyin":["bu4 dui4 jin4"],"word":"不對勁"},{"definition":["see 過來|过来[guo4 lai2]","to come over\/to manage\/to handle\/to be able to take care of"],"pinyin":["guo4 lai2","guo4 lai5"],"word":"過來"}]}