{"definition":["to breach\/to invade"],"pinyin":["da3 jin4"],"simplified":["打进"],"rank":4171.0,"normalized_rank":0.058357701509660985,"fraction":0.000031414093345434085,"cumulative_fraction":0.8361708847634034,"word":"打進","characters":[{"definition":["dozen (loanword)","to beat\/to strike\/to hit\/to break\/to type\/to mix up\/to build\/to fight\/to fetch\/to make\/to tie up\/to issue\/to shoot\/to calculate\/to play (a game)\/since\/from"],"pinyin":["da2","da3"],"word":"打"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[],"sentences":[{"english":"Cream the butter and sugar and beat in the eggs, one at a time.","chinese":"把黃油和白糖攪成奶油狀，把蛋打進去，一次一個。"},{"english":"He played the ball onto his wicket.","chinese":"他把球打進了自己的三柱門。"},{"english":"Organised the defence, and scored Italy’s equaliser.","chinese":"組織起了本方的防守，並且打進了扳平比分的一球。"},{"english":"Click on that and type in the name of your document.","chinese":"在它上面點一下然後把文件名打進去。"},{"english":"Leeds scored their first goal after only ten minutes.","chinese":"利茲聯隊後打進第一個球更令他們只有十分鐘。"},{"english":"For Siena Maccarone scored in the 62nd minute.","chinese":"錫耶納的馬卡羅內在第62分鐘打進了一球。"},{"english":"We use a pump to blow air into our tires.","chinese":"我們使用打氣筒把氣打進輪胎。"},{"english":"Kaka stepped up and stroked the ball past Rensing to restore Milan's lead.","chinese":"卡卡騙過倫辛將球打進，米蘭再次領先。"},{"english":"Chelsea have scored 54 goals in their last 13 Premier League fixtures, and have conceded just five.","chinese":"切爾西在13場聯賽中打進54球，只丟了5球。"},{"english":"Was Federico Macheda's winner against Villa the key moment of the season this side of Christmas?","chinese":"馬切達對維拉打進的制勝球是賽季的賽點嗎？"},{"english":"So what if Rooney isn't sending header after header into the net?","chinese":"那麼，如果魯尼在打進頭球之後沒有打入頭球。"},{"english":"It has been several years since Real Madrid have played in the quarterfinals of the Champions League.","chinese":"皇馬已經有好幾年沒能打進歐冠的四分之一決賽了。"},{"english":"Some of the goals he's scored since he's been here have been so important and tonight's was a terrific finish.","chinese":"他打進了很多關鍵球，今晚就是一個美妙的進球。"},{"english":"You should punch in any old nails or screws before attempting to lay a carpet or linoleum.","chinese":"在鋪地毯或地氈前你得先把舊釘打進去。"},{"english":"I was pleased with my second goal, \" said Edu .\"","chinese":"“我很高興能打進第二球，”埃杜表示。"},{"english":"Beyond that, you have to go all the way down to Freddie Ljungberg and Dennis Bergkamp with 4.","chinese":"此外，你馬上就數到永貝里和打進4球的博格坎普。"}],"related":[]}