{"definition":["to pull (a trigger)"],"pinyin":["kou4 dong4"],"simplified":["扣动"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"扣動","characters":[{"definition":["to fasten\/to button\/button\/buckle\/knot\/to arrest\/to confiscate\/to deduct (money)\/discount\/to knock\/to smash, spike or dunk (a ball)\/to cover (with a bowl etc)\/(fig.) to tag a label on sb\/(Tw) (loanword) code"],"pinyin":["kou4"],"word":"扣"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"}],"containing_words":[],"sentences":[{"english":"After he pulled the trigger, the rifle kicked back and the hunter lost his balance.","chinese":"獵人扣動板機，獵槍的反衝力使他的身體失去了平衡。"},{"english":"The soldier pressed the trigger of his gun.","chinese":"戰士扣動槍的板機。"},{"english":"I pulled the trigger on my mig and beaded a nut down low, and then another and another.","chinese":"我扣動電焊上的扳機一個又一個地往下焊螺母。"},{"english":"He kept aiming his gun at me, but didn't squeeze off.","chinese":"他一直用槍瞄準着我，卻沒敢扣動扳機。"},{"english":"I raised the shotgun and pulled the trigger.","chinese":"我拿起獵槍，扣動了扳機。"},{"english":"The trigger point will occur when the distortion caused by government spending is completely unveiled.","chinese":"只要政府開支造成的扭曲被完全揭露，扳機就會扣動。"},{"english":"Before he could press the trigger, the plane had gone up again.","chinese":"他還來不及扣動板機，飛機又飛高了。"},{"english":"He put his finger on the trigger and pretended to shoot a soldier on top of the hay bale.","chinese":"他用手指扣動扳機，裝着向麥垛上方的一個士兵開槍。"},{"english":"He put that bottle to his head and pulled the trigger.","chinese":"他把酒瓶放在了頭上並扣動了手槍的扳機。"},{"english":"She pulled the trigger.","chinese":"她扣動了獵槍的扳機。"}],"related":[]}