{"definition":["to pull out\/to pull a lever"],"pinyin":["ban1 dong4"],"simplified":["扳动"],"rank":45895.0,"normalized_rank":0.6421305947700531,"fraction":2.186744850391744e-7,"cumulative_fraction":0.9982241408575566,"word":"扳動","characters":[{"definition":["to pull\/to turn (sth) around\/to turn around (a situation)\/to recoup","variant of 攀[pan1]"],"pinyin":["ban1","pan1"],"word":"扳"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"}],"containing_words":[],"sentences":[{"english":"In transformational language, flipping the switch “causes” the light to turn on.","chinese":"用轉換的語言說，扳動開關“造成”了燈亮。"},{"english":"There was a click as the hunter cocked his rifle .","chinese":"咔嗒一聲，獵人扳動了槍機。"},{"english":"Campana slammed on the train's brake and blasted his air horn.","chinese":"坎帕納猛地扳動火車剎車，拉響了警報器。"},{"english":"The main strap can be tightened with a pretty simple tug on the inside lever.","chinese":"主要的束帶可以藉由簡單的扳動中央撥杆來束緊。"},{"english":"At the same moment, he pressed the trigger of his rifle. The flame leaped forth.","chinese":"同時他扳動卡賓槍的扳機，噴出了一道閃光。"},{"english":"If still invalid, can throw decompression, make the engine flameout lever decompression.","chinese":"若仍無效，可扳動減壓拉桿減壓，使發動機熄火。"},{"english":"In addition, the cover of the mobile phone is also provided with a pulling plate and a blocking plate.","chinese":"此外，手機套的蓋體還設有扳動片及擋片。"},{"english":"He reached for his empty gun , aimed, and pulled the trigger.","chinese":"他伸手摸到那支空槍，瞄準了，扳動槍機。"},{"english":"You should not be able to move the motor in the base when the locking lever is clamped.","chinese":"鎖定杆不用太過使勁就可以扳動，太用力會損壞底座。"},{"english":"He fired but his pistol failed to go off.","chinese":"他扳動了扳機，但手槍沒有發射。"},{"english":"Peter aimed the gun at the bird, but did not fire.","chinese":"他伸手摸到那支空槍，瞄準了，扳動槍機。"},{"english":"You should be able to clamp the locking lever without excessive force. Excessive force may damage the base.","chinese":"鎖定杆不用太過使勁就可以扳動，太用力會損壞底座。"}],"related":[]}