{"definition":["to pick fault with\/to spot the differences\/to nitpick\/to pick a quarrel\/to find complaint with"],"pinyin":["zhao3 cha2"],"simplified":["找茬"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"找茬","characters":[{"definition":["to try to find\/to look for\/to call on sb\/to find\/to seek\/to return\/to give change"],"pinyin":["zhao3"],"word":"找"},{"definition":["stubble land after crop has been taken\/a second crop obtained by rotation of land\/an opportunity"],"pinyin":["cha2"],"word":"茬"}],"containing_words":[],"sentences":[{"english":"He’s been completely isolated by the other inmates and they just knock him around as he walks by.","chinese":"他完全被其它犯人孤立了，他走路都會有人找茬。"},{"english":"At this time, he may find stubble to lose his temper or show a ill-favored color.","chinese":"這時他也許找茬發一通脾氣或擺出一副難看的臉色。"},{"english":"Her new boyfriend is a nit-picking lawyer.","chinese":"她現在的男朋友是個喜歡找茬兒的律師。"},{"english":"The fault finder will find faults even in paradise.","chinese":"人若愛找茬兒，天堂也能被他挑出毛病。"},{"english":"The fault-finder will faults even in paradise.","chinese":"人若愛找茬兒，天堂也能被他挑出毛病。"},{"english":"The heckler was ejected from the meeting.","chinese":"那個專找茬兒的搗蛋分子被逐出會場。"},{"english":"Rising above such cavilling and paying up would be a small step in itself.","chinese":"超越這種找茬和怨怨相報的心理本身將是一小步。"},{"english":"I just don't like people being bullied - picked on for no reason.","chinese":"我只是不喜歡有人被欺負，毫無理由地被找茬。"},{"english":"Starting today, anyone interested in giving the product a whirl can sign up.","chinese":"從今天起，任何想找茬的人都可以註冊測試。"}],"related":[{"definition":["variant of 找茬[zhao3 cha2]"],"pinyin":["zhao3 cha2"],"word":"找碴"},{"definition":["to look for employment\/to pick a quarrel"],"pinyin":["zhao3 shi4"],"word":"找事"},{"definition":["to pick a quarrel\/to find fault\/nitpicking"],"pinyin":["zhao3 cha2 'r"],"word":"找碴兒"},{"definition":["to look for trouble"],"pinyin":["zhao3 ma2 fan5"],"word":"找麻煩"},{"definition":["to carp\/nitpicking\/petty criticism"],"pinyin":["tiao1 ci4"],"word":"挑刺"},{"definition":["to look for bones in an egg\/to find fault\/to nitpick (idiom)"],"pinyin":["ji1 dan4 li5 tiao1 gu3 tou5"],"word":"雞蛋裡挑骨頭"},{"definition":["to pester endlessly (idiom)\/an annoying troublemaker"],"pinyin":["hu2 jiao3 man2 chan2"],"word":"胡攪蠻纏"},{"definition":["to disturb\/to look for trouble\/to stir up a row\/to bother sb intentionally"],"pinyin":["dao3 luan4"],"word":"搗亂"},{"definition":["to be hard on sb\/to deliberately make things difficult"],"pinyin":["diao1 nan4"],"word":"刁難"},{"definition":["to pick a quarrel\/to start a fight"],"pinyin":["xun2 xin4"],"word":"尋釁"},{"definition":["to send punitive forces against\/(fig.) to criticize violently"],"pinyin":["xing1 shi1 wen4 zui4"],"word":"興師問罪"},{"definition":["lit. to point at the mulberry tree and curse the locust tree\/fig. to scold sb indirectly\/to make oblique accusations (idiom)"],"pinyin":["zhi3 sang1 ma4 huai2"],"word":"指桑罵槐"},{"definition":["to cause trouble\/to create a disturbance"],"pinyin":["nao4 shi4"],"word":"鬧事"},{"definition":["the guilty party files the suit\/the thief cries thief"],"pinyin":["e4 ren2 xian1 gao4 zhuang4"],"word":"惡人先告狀"},{"definition":["to bicker\/to argue for the sake of arguing\/to carry on poles (together with sb else)\/to carry a coffin on poles"],"pinyin":["tai2 gang4"],"word":"抬槓"},{"definition":["to tell on sb\/to complain (to a teacher, a superior etc)\/to bring a lawsuit"],"pinyin":["gao4 zhuang4"],"word":"告狀"}]}