{"definition":["to accept (i.e. acknowledge as calling for payment) (commerce)\/to honor (a check, a promise)"],"pinyin":["cheng2 dui4"],"simplified":["承兑"],"rank":37138.0,"normalized_rank":0.5196088033243322,"fraction":4.996814167483938e-7,"cumulative_fraction":0.995227267182876,"word":"承兌","characters":[{"definition":["surname Cheng\/Cheng (c. 2000 BC), third of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","to bear\/to carry\/to hold\/to continue\/to undertake\/to take charge\/owing to\/due to\/to receive"],"pinyin":["Cheng2","cheng2"],"word":"承"},{"definition":["surname Dui","to cash\/to exchange\/to add (liquid)\/to blend\/one of the Eight Trigrams 八卦[ba1 gua4], symbolizing swamp\/☱"],"pinyin":["Dui4","dui4"],"word":"兌"}],"containing_words":[{"definition":["to present (a draft) for acceptance (commerce)"],"pinyin":["ti2 shi4 cheng2 dui4"],"word":"提示承兌"}],"sentences":[{"english":"We regret that we are unable to consider your request for payment under D\/A terms.","chinese":"對你方要求以承兌交單方式付款一事，我們謙難考慮。"},{"english":"We can't agree to draw at 30 days D\/A.","chinese":"我們不同意開具30天期的承兌交單匯票。"},{"english":"It would help us greatly if you would accept D\/A.","chinese":"若貴方能接收承兌交單方式付款，則兌偶方幫忙很大。"},{"english":"For our guests' convenience, traveler's checks cashed here.","chinese":"爲方便本店旅客，本處承兌旅行支票。"},{"english":"The payer of an ECD shall be the acceptor.","chinese":"電子商業匯票的付款人爲承兌人。"},{"english":"Our terms of payment are normally 30 - day bill of exchange, documents against acceptance.","chinese":"我們的付款方式一般是30天遠期匯票，承兌交單。"},{"english":"The obligation of the acceptor thereof arises out of the purchase of goods from the drawer.","chinese":"本匯票承兌人的義務因向出票人購買貨物而產生。"},{"english":"Could you agree to a payment by D\/A?","chinese":"你方願意接受承兌交單方式付款嗎？"},{"english":"We honored the check the overdraft was only 5 yuan.","chinese":"我們承兌這張支票的透支額唯有5元。"},{"english":"The bill of exchange was signed by the acceptor.","chinese":"匯票由承兌人簽字。"},{"english":"Could you make an exception and accept D\/A or D\/P?","chinese":"你們能不能破例接受承兌交單或付款交單？"},{"english":"We honored the check considering overdraft was only 5 yuan.","chinese":"我們承兌這張支票的透支額惟有5元。"},{"english":"Can be received within six months of bank acceptance bills of exchange.","chinese":"可收受六個月內的銀行承兌匯票。"},{"english":"We honored the check as the overdraft am only 5 yuan.","chinese":"咱們承兌這張支票的透支額只有5元。"},{"english":"Traveller's checks (are) cashed here.","chinese":"此處承兌旅行支票。"},{"english":"Acceptance to apply for the discount.","chinese":"向銀行申請承兌匯票貼現。"}],"related":[]}