{"definition":["to inherit\/to follow\/to adopt"],"pinyin":["cheng2 xi2"],"simplified":["承袭"],"rank":29163.0,"normalized_rank":0.40802820645558463,"fraction":0.0000010130847304218092,"cumulative_fraction":0.9894246146195352,"word":"承襲","characters":[{"definition":["surname Cheng\/Cheng (c. 2000 BC), third of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","to bear\/to carry\/to hold\/to continue\/to undertake\/to take charge\/owing to\/due to\/to receive"],"pinyin":["Cheng2","cheng2"],"word":"承"},{"definition":["to attack\/to inherit\/classifier for suits (esp. of funeral robes)"],"pinyin":["xi2"],"word":"襲"}],"containing_words":[],"sentences":[{"english":"The two entrances to the holy grottoreceived their present monumental form.","chinese":"而通往神聖地窟的兩個入口承襲了他們不變的形式。"},{"english":"The Wu mainly followed the institution of the Han Dynasty except that woman was limited to a certain extent.","chinese":"孫吳基本上承襲漢制，但女性受到一定程度的限制。"},{"english":"Modern men still carry the ancient legacy of being brave and showing no weaknesses.","chinese":"現代的男人依然承襲着勇敢和不示弱的古老傳統。"},{"english":"The legacy can change.","chinese":"承襲的傳統可以改變。"},{"english":"\"Liao sacrifice\"was inherited anddeveloped by Zhou clansman.","chinese":"燎祭之典後被周族人所承襲並有所增益。"},{"english":"Yan Can not only inherited the results of traditional research on The Book of Songs, but also made bold innovations.","chinese":"嚴粲不僅承襲傳統詩學成果，而且進行了大膽的創新。"},{"english":"Hume in many ways follows Hobbes.","chinese":"休謨在很多方面都承襲於霍布斯。"},{"english":"Their theory source could trace down the Lenins new economy policy.","chinese":"它們在理論上的承襲可以追溯到列寧的新經濟政策。"},{"english":"Inherited Zongshen's excellence, every gene is crowned with perfectness.","chinese":"承襲宗申優良傳統，每一個基因都有一種精堪之美。"},{"english":"Now in many ways Hume can be seen as building on Newton and Locke.","chinese":"現代很多觀點認爲休謨承襲於牛頓和洛克。"},{"english":"As you have stated, the legacy can change.","chinese":"正如你們所指出的，承襲的傳統可以改變。"},{"english":"Some calendars in Xixia state were from Song Dynasty, some had historical relationships with that in Central Plains.","chinese":"西夏曆法承襲中原曆法，與宋朝曆法有淵源關係。"},{"english":"With the traditional handmade pounding method, Heirui has preserved sixty years of good taste.","chinese":"承襲先人手工搥打古法，保存一甲子的純真美味。"},{"english":"Fonteyn represents the best traditions of ballet.","chinese":"芳廷承襲了芭蕾舞藝術的最優秀的傳統。"}],"related":[{"definition":["lit. to fly one's banner on a solitary tree (idiom); fig. to act as a loner\/to stand out\/to develop one's own school\/to have attitude of one's own"],"pinyin":["du2 shu4 yi1 zhi4"],"word":"獨樹一幟"},{"definition":["to carry on as before\/to follow (an old custom etc)"],"pinyin":["yan2 xi2"],"word":"沿襲"},{"definition":["to be precisely the same\/to be no different"],"pinyin":["ru2 chu1 yi1 zhe2"],"word":"如出一轍"},{"definition":["to create\/to come up with (an idea etc)"],"pinyin":["zi4 chuang4"],"word":"自創"},{"definition":["advanced guard\/vanguard\/avant-garde\/forward (soccer position)"],"pinyin":["qian2 wei4"],"word":"前衛"},{"definition":["to create\/to inaugurate\/to contrive\/to build (a mechanism)"],"pinyin":["chuang4 zhi4"],"word":"創製"},{"definition":["arts and crafts\/industrial arts"],"pinyin":["gong1 yi4"],"word":"工藝"},{"definition":["to push out the old and bring in the new (idiom); to innovate"],"pinyin":["tui1 chen2 chu1 xin1"],"word":"推陳出新"},{"definition":["to develop and promote\/to carry forward\/to bring to great height of development"],"pinyin":["fa1 yang2 guang1 da4"],"word":"發揚光大"},{"definition":["tradition\/traditional\/convention\/conventional\/CL:個|个[ge4]"],"pinyin":["chuan2 tong3"],"word":"傳統"},{"definition":["to inherit\/to succeed to (the throne etc)\/to carry on (a tradition etc)"],"pinyin":["ji4 cheng2"],"word":"繼承"},{"definition":["adoption (e.g. of a nephew as a son)\/to inherit"],"pinyin":["cheng2 ji4"],"word":"承繼"},{"definition":["to initiate\/to start\/to found"],"pinyin":["kai1 chuang4"],"word":"開創"},{"definition":["original and ingenious (idiom)\/to show great creativity"],"pinyin":["jiang4 xin1 du2 yun4"],"word":"匠心獨運"},{"definition":["epoch-marking"],"pinyin":["hua4 shi2 dai4"],"word":"劃時代"},{"definition":["to have a unique style of one's own (idiom)"],"pinyin":["du2 shu4 yi1 ge2"],"word":"獨樹一格"}]}