{"definition":["to bear the weight\/to sustain"],"pinyin":["cheng2 zai4"],"simplified":["承载"],"rank":7723.0,"normalized_rank":0.10805478992066933,"fraction":0.000012665602817048684,"cumulative_fraction":0.9063883941119532,"word":"承載","characters":[{"definition":["surname Cheng\/Cheng (c. 2000 BC), third of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","to bear\/to carry\/to hold\/to continue\/to undertake\/to take charge\/owing to\/due to\/to receive"],"pinyin":["Cheng2","cheng2"],"word":"承"},{"definition":["to carry\/to convey\/to load\/to hold\/to fill up\/and\/also\/as well as\/simultaneously","to record in writing\/to carry (i.e. publish in a newspaper etc)\/Taiwan pr. [zai4]\/year"],"pinyin":["zai3","zai4"],"word":"載"}],"containing_words":[{"definition":["carrying capacity"],"pinyin":["cheng2 zai4 li4"],"word":"承載力"},{"definition":["carrying capacity"],"pinyin":["cheng2 zai4 liang4"],"word":"承載量"}],"sentences":[{"english":"The estimated six to seven thousand languages spoken around the globe are the repository of our collective memory and intangible heritage.","chinese":"這六七千種語言承載者我們共同的回憶和非物質遺產。"},{"english":"Shakedown analysis is an important part of the structural design or the research on load-bearing capacity.","chinese":"安定分析是結構設計或承載能力研究的一個重要方面。"},{"english":"A new table of axial capacity parameter of driven pile has been compiled.","chinese":"在此基礎上編制了新的打入樁豎向承載力參數表。"},{"english":"Carry me on the waves to the lands Ive never seen.","chinese":"讓我承載着波浪去我從未親見的土地。"},{"english":"He explores and meditates about various meaningful questions which are being carried by human beings.","chinese":"他探求並冥想着作爲人類所承載的各種意義問題。"},{"english":"The invention relates to a rubber tube tyre jointly born by a tyre tube and a tyre cover.","chinese":"本發明是一種內外胎聯合承載的膠管輪胎。"},{"english":"Influence of loading path on axial strength of circular tubular TX-joints.","chinese":"荷載路徑對TX型圓管節點軸向承載力的影響。"},{"english":"Its advantages are simple geometry, radial load carrying capacity and high.","chinese":"它的長處是複雜的幾何體，徑向負荷承載才能和高。"},{"english":"The magnolia liliflora is ingrained, load bearing marriage structure and family member's care.","chinese":"紫玉蘭根深蒂固，承載着婚姻的結構和親人的關心。"},{"english":"The paper is accompanied with a self-developed software called LandSmart that is for facilitating calculating land demand and land-population sustainability.","chinese":"並自主設計出土地需求量和土地人口承載力預測軟件。"},{"english":"The load-carrying capacity of spherical roller bearings is high.","chinese":"承載能力，球面滾子軸承高。"},{"english":"What the artification of abnormal psychology carries is the reflection on culture and the appeal made by freedom of life.","chinese":"變態心理藝術化承載的是文化反思和生命自由的呼籲。"},{"english":"Electric furnace is major equipment of zinc powder reduction smelting.","chinese":"電爐是鋅粉工藝進行還原熔煉的承載設備。"},{"english":"Individually the energy available in each of these signals is miniscule.","chinese":"單一來看，這些信號每一種所承載的能量微乎其微。"},{"english":"Chrome steel balls have an excellent surface quality and high load bearing.","chinese":"鉻鋼球有一個極好的表面質量和高承載。"},{"english":"The bearing capacity of the cold-formed thin-walled steel which was used in combination wall.","chinese":"分析了冷彎薄壁型鋼在組合牆體中的承載力。"}],"related":[{"definition":["changes\/vicissitudes"],"pinyin":["bian4 qian1"],"word":"變遷"},{"definition":["to transmit\/to pass on to sb else\/(math.) transitive"],"pinyin":["chuan2 di4"],"word":"傳遞"},{"definition":["carrier (chemistry)\/vector (epidemiology)\/vehicle or medium"],"pinyin":["zai4 ti3"],"word":"載體"},{"definition":["to remember\/to recall\/memory\/CL:個|个[ge4]"],"pinyin":["ji4 yi4"],"word":"記憶"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"體現"},{"definition":["to assign\/to entrust (a task)\/to give\/to bestow"],"pinyin":["fu4 yu3"],"word":"賦予"},{"definition":["to recount\/to tell of\/to relate\/(fig.) (of a thing) to stand as testament to (some past history)"],"pinyin":["su4 shuo1"],"word":"訴說"},{"definition":["to create\/to bring about\/to produce\/to set (a record)"],"pinyin":["chuang4 zao4"],"word":"創造"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["to pass on\/to convey\/to relay\/to transmit\/transmission"],"pinyin":["chuan2 da2"],"word":"傳達"},{"definition":["to contain\/to accumulate"],"pinyin":["yun4 han2"],"word":"蘊含"},{"definition":["to be witness to\/witness\/evidence"],"pinyin":["jian4 zheng4"],"word":"見證"},{"definition":["to own exclusively\/unique to\/specific\/there is only"],"pinyin":["du2 you3"],"word":"獨有"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["to change\/to transform\/shift\/transformation\/CL:個|个[ge4]"],"pinyin":["zhuan3 bian4"],"word":"轉變"},{"definition":["full to capacity\/fully loaded"],"pinyin":["man3 zai4"],"word":"滿載"}]}