{"definition":["to capture (an image)\/to snap (a photo)"],"pinyin":["zhua1 pai1"],"simplified":["抓拍"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"抓拍","characters":[{"definition":["to grab\/to catch\/to arrest\/to snatch\/to scratch"],"pinyin":["zhua1"],"word":"抓"},{"definition":["to pat\/to clap\/to slap\/to swat\/to take (a photo)\/to shoot (a film)\/racket (sports)\/beat (music)"],"pinyin":["pai1"],"word":"拍"}],"containing_words":[],"sentences":[{"english":"It depends on detection equipment and Apparatus for the sensitivity and stability.","chinese":"它取決於檢測設備和抓拍設備的靈敏度和穩定性。"},{"english":"And two deer were caught on tape after breaking into a New Haven donut shop.","chinese":"兩隻鹿闖進一間新天堂甜甜圈的時候被抓拍到了。"},{"english":"This picture captures the rainbow at its brightest right before the rain started","chinese":"這張照片抓拍了雨前的最美的彩虹。"},{"english":"A wild baby snow leopard has been caught on camera.","chinese":"山地攝影機抓拍到一隻野生幼年雪豹的影像。"},{"english":"The winning photo captures the ferocity of a spring-time fight between two cock pheasants.","chinese":"獲獎照片抓拍到兩隻雄雉在春季搏鬥的激烈場面。"},{"english":"The Associated Press sent a photographer to capture the chicken's many moods.","chinese":"美聯社則派了一名攝影記者前來抓拍小雞的各種表情。"},{"english":"You can find the perfect timing by the photographers in taking these photos of the birds in action.","chinese":"看看這些攝影師在鳥類行動時的完美抓拍。"},{"english":"Recently the team captured video of the bats catching live fish.","chinese":"最近這個小組抓拍到了此種蝙蝠捕食活魚的視頻。"},{"english":"I think I'm trying to capture pictures of people that help others see what they're about.","chinese":"我嘗試抓拍一些有助於別人瞭解被拍者的照片。"},{"english":"Here is a picture that I snapped with my iPhone.","chinese":"這是我用iPhone抓拍的一張照片。"},{"english":"I managed to make two photos of this and the bird flew away with the rabbit in its bill.","chinese":"我抓拍了兩張之後蒼鷺就飛走了，兔子還含在它嘴裏。"}],"related":[{"definition":["traffic camera\/speed camera\/closed-circuit TV police surveillance"],"pinyin":["dian4 zi3 jing3 cha2"],"word":"電子警察"},{"definition":["electronic eye"],"pinyin":["dian4 zi3 yan3"],"word":"電子眼"},{"definition":["to run a red light\/failing to stop at a red traffic light\/(slang) to have sex with a girl while she is menstruating"],"pinyin":["chuang3 hong2 deng1"],"word":"闖紅燈"},{"definition":["to take a picture"],"pinyin":["pai1 zhao4"],"word":"拍照"},{"definition":["to break the rules\/to violate regulations"],"pinyin":["wei2 zhang1"],"word":"違章"},{"definition":["to exceed the speed limit\/to speed\/high-speed"],"pinyin":["chao1 su4"],"word":"超速"},{"definition":["crosswalk\/zebra crossing"],"pinyin":["ban1 ma3 xian4"],"word":"斑馬線"},{"definition":["to show consideration for (others)\/to yield to (another vehicle etc)\/courtesy\/comity"],"pinyin":["li3 rang4"],"word":"禮讓"},{"definition":["to issue an infringement notice"],"pinyin":["kai1 fa2 dan1"],"word":"開罰單"},{"definition":["traffic police\/abbr. for 交通警察"],"pinyin":["jiao1 jing3"],"word":"交警"},{"definition":["motor vehicle"],"pinyin":["ji1 dong4 che1"],"word":"機動車"},{"definition":["to deduct marks (when grading school work)\/to have marks deducted\/penalty points\/to lose points for a penalty or error"],"pinyin":["kou4 fen1"],"word":"扣分"},{"definition":["to tow\/(computing) to drag"],"pinyin":["tuo1 yi2"],"word":"拖移"},{"definition":["to take a picture or video of oneself\/to take a selfie\/selfie"],"pinyin":["zi4 pai1"],"word":"自拍"},{"definition":["to document on film the course of events\/to follow sb with a camera"],"pinyin":["gen1 pai1"],"word":"跟拍"},{"definition":["grid lines\/graticule"],"pinyin":["biao1 xian4"],"word":"標線"}]}