{"definition":["to scratch\/to mess about with\/to quarrel\/to scramble to do\/sb or sth that one can rely on"],"pinyin":["zhua1 nao5"],"simplified":["抓挠"],"rank":46714.0,"normalized_rank":0.6535894673513075,"fraction":2.010111921888806e-7,"cumulative_fraction":0.998396038417823,"word":"抓撓","characters":[{"definition":["to grab\/to catch\/to arrest\/to snatch\/to scratch"],"pinyin":["zhua1"],"word":"抓"},{"definition":["to scratch\/to thwart\/to yield"],"pinyin":["nao2"],"word":"撓"}],"containing_words":[],"sentences":[{"english":"Look for scratching or fiddling with clothing.","chinese":"關注抓撓或撥弄衣服的動作。"},{"english":"But their response was dampened, or inhibited, when the researchers subsequently scratched the itchy skin.","chinese":"當研究者隨後抓撓皮膚時，它們的反應呈抑制狀。"},{"english":"Scratching can actually trigger eczematous rashes.","chinese":"抓撓事實上可以引起溼疹性的皮疹。"},{"english":"Scratching an ordinary itch usually does no harm.","chinese":"抓撓普通騷癢通常無害。"},{"english":"But chronic itching may respond to scratching only very temporarily or not at all.","chinese":"但抓撓對慢性騷癢症只能暫時止癢，或者根本沒用。"},{"english":"Scratching by itself—that is, in the absence of an itch—had no such effect.","chinese":"而在不存在騷癢的情況下，抓撓本身並無這樣的作用。"},{"english":"I hitched up my nightgown and raked my nails across a line of mosquito bites on my leg.","chinese":"我提起睡裙，抓撓蚊子在腿上咬出的一溜兒包。"},{"english":"Every dog and cat knows that scratching relieves an itch.","chinese":"貓貓狗狗都知道抓撓可以止癢。"},{"english":"Cheese grater - To slide down a slab while scraping the knees, hands, and face.","chinese":"在抓撓膝蓋，手或者臉的時候滑倒。"},{"english":"Instead of scratching that insect bite, apply a drop or two of peppermint oil.","chinese":"不要抓撓昆蟲叮咬處，而是用一兩滴薄荷油。"},{"english":"She's tormented by their scratching at night.","chinese":"她晚上被它們的抓撓聲折磨得要命。"},{"english":"The bird's talons stopped in mid-furrow.","chinese":"鳥兒的爪子停止了抓撓。"},{"english":"\"My daughter was having nervous breakdowns, she was scratching herself on her face and thighs, \" she said.","chinese":"我女兒開始神經失常，不停地抓撓臉部和大腿。"},{"english":"I began to itch and desperately wanted to scratch.","chinese":"我開始覺得癢癢，非常想抓撓。"}],"related":[]}