{"definition":["to adapt to sb's taste\/to fit sb's fancy"],"pinyin":["tou2 qi2 suo3 hao4"],"simplified":["投其所好"],"rank":36342.0,"normalized_rank":0.508471730583577,"fraction":5.366137563444628e-7,"cumulative_fraction":0.9948147643347788,"word":"投其所好","characters":[{"definition":["to cast\/to send\/to throw oneself (into the river etc)\/to seek refuge\/to place oneself into the hands of"],"pinyin":["tou2"],"word":"投"},{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["actually\/place\/classifier for houses, small buildings, institutions etc\/that which\/particle introducing a relative clause or passive\/CL:個|个[ge4]"],"pinyin":["suo3"],"word":"所"},{"definition":["good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello","to be fond of\/to have a tendency to\/to be prone to"],"pinyin":["hao3","hao4"],"word":"好"}],"containing_words":[],"sentences":[{"english":"You have to be able to capture the interest of your readers and hold it from the beginning of your article to the end.","chinese":"你要能夠獲悉讀者的興趣，並投其所好貫穿文章始末。"},{"english":"This requires that you carefully remember, psychographic.","chinese":"這就需要你用心記憶，投其所好。"},{"english":"Many executives surround themselves with people who think like they do.","chinese":"很多總裁身邊的人都只是投其所好。"},{"english":"This county Wang Ye seems to be good at to throw it like.","chinese":"哦？這位郡王爺似乎很會投其所好。"}],"related":[{"definition":["favor\/liking\/love\/jubilation\/joy"],"pinyin":["huan1 xin1"],"word":"歡心"},{"definition":["In order to capture, one must let loose.\/to loosen the reins only to grasp them better"],"pinyin":["yu4 qin2 gu4 zong4"],"word":"欲擒故縱"},{"definition":["to get the desired outcome\/to win favor by fawning on sb\/to curry favor with\/a fruitful outcome to reward one's labor"],"pinyin":["tao3 hao3"],"word":"討好"},{"definition":["to like\/fond of\/to prefer\/to love\/one's tastes\/preference"],"pinyin":["xi3 hao4"],"word":"喜好"},{"definition":["to fawn on\/to ingratiate oneself\/(literary) to meet face to face"],"pinyin":["feng2 ying2"],"word":"逢迎"},{"definition":["to bow down to everything sb says or does\/to act submissively in order to ingratiate oneself"],"pinyin":["qu1 yi4 feng2 ying2"],"word":"曲意逢迎"},{"definition":["to dig for thoughts (idiom); to search everything for an answer\/to rack one's brains"],"pinyin":["wa1 kong1 xin1 si5"],"word":"挖空心思"},{"definition":["use a long line to catch a big fish (idiom); a long-term plan for major returns"],"pinyin":["fang4 chang2 xian4 diao4 da4 yu2"],"word":"放長線釣大魚"},{"definition":["to cater to\/to pander to"],"pinyin":["ying2 he2"],"word":"迎合"},{"definition":["to worm one's way into being friends with sb (usually derogatory)"],"pinyin":["tao4 jin4 hu1"],"word":"套近乎"},{"definition":["to smooth whiskers and pat a horse's bottom (idiom); to use flatter to get what one wants\/to toady\/boot-licking"],"pinyin":["liu1 xu1 pai1 ma3"],"word":"溜鬚拍馬"},{"definition":["to weigh up sb's words and observe their facial expression (idiom)\/to discern what sb thinks from his body language"],"pinyin":["cha2 yan2 guan1 se4"],"word":"察言觀色"},{"definition":["to fawn on\/to flatter\/to ingratiate oneself\/flattery"],"pinyin":["feng4 cheng5"],"word":"奉承"},{"definition":["to try to please"],"pinyin":["qu3 yue4"],"word":"取悅"},{"definition":["to make insinuations\/to take an indirect approach (in making inquiries) (idiom)"],"pinyin":["pang2 qiao1 ce4 ji1"],"word":"旁敲側擊"},{"definition":["to refuse nobody (idiom)\/all comers welcome"],"pinyin":["lai2 zhe3 bu4 ju4"],"word":"來者不拒"}]}