{"definition":["to throw one's energies (into an activity)\/to invest one's emotions (in sth)\/to bet\/betting"],"pinyin":["tou2 zhu4"],"simplified":["投注"],"rank":7161.0,"normalized_rank":0.10019168077455824,"fraction":0.000014238219791232276,"cumulative_fraction":0.8988500353041701,"word":"投注","characters":[{"definition":["to cast\/to send\/to throw oneself (into the river etc)\/to seek refuge\/to place oneself into the hands of"],"pinyin":["tou2"],"word":"投"},{"definition":["to inject\/to pour into\/to concentrate\/to pay attention\/stake (gambling)\/classifier for sums of money\/variant of 註|注[zhu4]"],"pinyin":["zhu4"],"word":"注"}],"containing_words":[{"definition":["live betting"],"pinyin":["xian4 chang3 tou2 zhu4"],"word":"現場投注"}],"sentences":[{"english":"This branch is obsoleted. Engineering resource will no longer be invested on this branch in general.","chinese":"此分支已淘汰，除特殊狀況人力不再投注於此版上。"},{"english":"Your bet can be for any game you chooser like.","chinese":"您的投注可以爲任何你喜歡的遊戲選擇器。"},{"english":"Billions of dollars are wagered each year on football in this country.","chinese":"數十億美元，每年投注足球在這個國家。"},{"english":"You will need a bookie to place high bettings on matches.","chinese":"你需要一個賭場工作者在比賽裏進行高投注。"},{"english":"Ultimately, the most trusted source of information is the bettor himself.","chinese":"最終，最值得信賴的信息來源是投注者本人。"},{"english":"So why do ordinary investors do it?","chinese":"那麼，爲什麼普通投資者還在投注呢？"},{"english":"Is Hanhan's \"Lottery Agency\" a talent scout or merely the commercial speculation?","chinese":"韓寒的“彩票投注站”，是伯樂相馬還是商業炒作？"},{"english":"Too much ADB money is still channeled toward fossil fuel energy.","chinese":"亞銀有太多經費投注在石化能源業。"},{"english":"You don't want to be a bettor who owes money to these individuals.","chinese":"你不想成爲一個投注者誰欠的錢給這些人。"},{"english":"After returning to the city, his first matter has soaked for one day in the bookie.","chinese":"回到城市後，他第一件事就是在投注站泡了一天。"},{"english":"Get betting lines on fast-paced, high-octane sports from around the world.","chinese":"獲得快節奏，高線投注，來自世界各地的體育辛烷值。"},{"english":"Which I'm betting is worth a lot more than anything else in here.","chinese":"這個足彩投注系統是我根據自己的經驗開發的。"},{"english":"The color people usually must purchase the lottery ticket to the nearby bookie.","chinese":"彩民們通常要到附近的投注站購買彩票。"},{"english":"He makes massive, highly- leveraged bets on the direction of the financial markets.","chinese":"他使得大規模，高槓桿金融市場的方向投注。"},{"english":"Through the current turnover ratios to estimate odds is very simple.","chinese":"要通過當前的投注額比例來估算賠率也很簡單。"},{"english":"Millions of people invest in bonds and other debt-based products.","chinese":"成千上萬的人將資金投注於債券和其他負債性產品。"}],"related":[{"definition":["lottery player"],"pinyin":["cai3 min2"],"word":"彩民"},{"definition":["to pour\/to pour down (of rain)\/to lay a bet"],"pinyin":["xia4 zhu4"],"word":"下注"},{"definition":["lottery ticket"],"pinyin":["cai3 piao4"],"word":"彩票"},{"definition":["to announce the winners in a lottery"],"pinyin":["kai1 jiang3"],"word":"開獎"},{"definition":["to win a prize\/a successful gamble"],"pinyin":["zhong4 jiang3"],"word":"中獎"},{"definition":["to try to answer a question (in a quiz, guessing game, riddle etc)\/quiz game"],"pinyin":["jing4 cai1"],"word":"競猜"},{"definition":["gambler"],"pinyin":["du3 ke4"],"word":"賭客"},{"definition":["to bet\/to wager"],"pinyin":["ya1 zhu4"],"word":"押注"},{"definition":["game of chance\/gambling party\/gambling joint"],"pinyin":["du3 ju2"],"word":"賭局"},{"definition":["large-sized (of clothes, shoes)\/(old) to give an order\/(old) to quit one's job in a store"],"pinyin":["chu1 hao4"],"word":"出號"},{"definition":["skewness (math)"],"pinyin":["pian1 tai4"],"word":"偏態"},{"definition":["(gambling) prize pool\/jackpot"],"pinyin":["jiang3 chi2"],"word":"獎池"},{"definition":["to gamble"],"pinyin":["du3 bo2"],"word":"賭博"},{"definition":["stake (in a gamble)\/(what is at) stake"],"pinyin":["du3 zhu4"],"word":"賭注"},{"definition":["gambler"],"pinyin":["du3 tu2"],"word":"賭徒"},{"definition":["the units place (or column) in the decimal system"],"pinyin":["ge4 wei4"],"word":"個位"}]}