{"definition":["to put into production\/to put into operation"],"pinyin":["tou2 chan3"],"simplified":["投产"],"rank":4604.0,"normalized_rank":0.06441593328949394,"fraction":0.00002710585564385788,"cumulative_fraction":0.8488417662774175,"word":"投產","characters":[{"definition":["to cast\/to send\/to throw oneself (into the river etc)\/to seek refuge\/to place oneself into the hands of"],"pinyin":["tou2"],"word":"投"},{"definition":["to give birth\/to reproduce\/to produce\/product\/resource\/estate\/property"],"pinyin":["chan3"],"word":"產"}],"containing_words":[],"sentences":[{"english":"If all the IZs in the province were filled up, environment pollution would be a great deal more serious.","chinese":"如果省內的工業區全部投產，環境污染將更加嚴重。"},{"english":"The field could enter production as soon as 2012.","chinese":"這座油田可能在2012年就能投產。"},{"english":"The long-distance natural gas transmission pipe of Shanxi province was operated in the 1997.","chinese":"陝西省天然氣長輸管道於1997年投產。"},{"english":"The popular Toyota Prius, for example, is not yet manufactured in the United States.","chinese":"例如，熱銷的豐田普拉斯還未在美國投產。"},{"english":"The launch of their new machines in this factory received much media coverage.","chinese":"這個工廠投產的新機器廣獲傳媒報道。"},{"english":"Microsoft's senior executives certainly hope that Rashid's latest crop of researchers come up with the goods.","chinese":"微軟的高層很希望拉希德最新的研究成果投產。"},{"english":"The operation actualities of Mahuining oil pipeline is introduced.","chinese":"介紹了馬惠寧輸油管道的施工和投產後的運行現狀。"},{"english":"The technology of well completion and putting into production for gas wells with high sulfur content is not available in China.","chinese":"高酸性氣井完井投產在國內是空白，屬一項新工藝。"},{"english":"The first CRVS will be production-ready in early 2010.","chinese":"第一套CRVS系統將在2010年初投產。"},{"english":"The Anhui-province plant, west of Shanghai, is slated to go online next year.","chinese":"該工廠位於安徽，計劃明年建成投產。"},{"english":"Transition of launch programs into volume production.","chinese":"將投產項目轉化成量產。"},{"english":"To be operated by SAC, the facility will be completed by the end of the year and will start production next year.","chinese":"由沈飛來運作，工廠將在年底完成，明年投產。"},{"english":"Mr. Chang estimated that it could be a decade before China’s stealth plane enters production.","chinese":"平先生估計，中國的隱形飛機投產可能還需十年時間。"},{"english":"In 2000, our Dongguan plant went into operation. The business expanded rapidly with products selling worldwide.","chinese":"2000年，公司在東莞廠投產，迅速取得經營規模。"},{"english":"It will definitely be produced in HVF.","chinese":"這裏將肯定會在這裏投產。"},{"english":"AISC new No3 sintering workiship since its commissioning has not reached the design capacity for many-years.","chinese":"鞍鋼新三燒投產多年，一直沒有達產。"}],"related":[{"definition":["production capacity"],"pinyin":["chan3 neng2"],"word":"產能"},{"definition":["to start (a building project)"],"pinyin":["dong4 gong1"],"word":"動工"},{"definition":["a building used as a factory\/factory (building)\/CL:座[zuo4],棟|栋[dong4]"],"pinyin":["chang3 fang2"],"word":"廠房"},{"definition":["to start using\/(computing) to enable (a feature)"],"pinyin":["qi3 yong4"],"word":"啟用"},{"definition":["running\/operation (of airport, bus service, business etc)"],"pinyin":["ying2 yun4"],"word":"營運"},{"definition":["to produce\/to manufacture\/to give birth to a child"],"pinyin":["sheng1 chan3"],"word":"生產"},{"definition":["to build\/to construct"],"pinyin":["xing1 jian4"],"word":"興建"},{"definition":["assembly line\/production line"],"pinyin":["sheng1 chan3 xian4"],"word":"生產線"},{"definition":["to mass-produce"],"pinyin":["liang4 chan3"],"word":"量產"},{"definition":["to extend (a building, an airport runway etc)"],"pinyin":["kuo4 jian4"],"word":"擴建"},{"definition":["to forecast\/to predict\/to estimate"],"pinyin":["yu4 ji4"],"word":"預計"},{"definition":["project"],"pinyin":["zhuan1 an4"],"word":"專案"},{"definition":["natural gas"],"pinyin":["tian1 ran2 qi4"],"word":"天然氣"},{"definition":["to extract (ore or other resource from a mine)\/to exploit\/to mine"],"pinyin":["kai1 cai3"],"word":"開採"},{"definition":["to expand"],"pinyin":["kuo4 chong1"],"word":"擴充"},{"definition":["to be in operation\/to do business\/(of train, bus etc) to be in service\/operation\/service"],"pinyin":["yun4 ying2"],"word":"運營"}]}