{"definition":["to compromise\/to take the middle road\/a trade-off\/eclectic"],"pinyin":["zhe2 zhong1"],"simplified":["折中"],"rank":26944.0,"normalized_rank":0.3769815174961174,"fraction":0.0000012435834032368002,"cumulative_fraction":0.9869298234016121,"word":"折中","characters":[{"definition":["to break (e.g. stick or bone)\/a loss","to break\/to fracture\/to snap\/to suffer loss\/to bend\/to twist\/to turn\/to change direction\/convinced\/to convert into (currency)\/discount\/rebate\/tenth (in price)\/classifier for theatrical scenes\/to fold\/accounts book","to turn sth over\/to turn upside down\/to tip sth out (of a container)"],"pinyin":["she2","zhe1","zhe2"],"word":"折"},{"definition":["China\/Chinese\/surname Zhong","to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right"],"pinyin":["Zhong1","zhong1","zhong4"],"word":"中"}],"containing_words":[],"sentences":[{"english":"OK, a compromise would be to change the wording.","chinese":"好吧，一個折中的方案就是修改文字措辭。"},{"english":"That's the best trade-off I can think of, given an unexpected problem occurred.","chinese":"假如發生意外問題，這是我所能想到的最佳折中方式。"},{"english":"That's what the moderates would say.","chinese":"那是折中主義者的說法。"},{"english":"There must be an inbetween here for a business sense of being.","chinese":"在商業意識中肯定會有一個“折中選擇”。"},{"english":"The said sound-controlled keyboard is a compromise design of sound-control computer and common keyboard.","chinese":"聲控鍵盤是聲控電腦與普通鍵盤的折中設計。"},{"english":"That seems an eminently reasonable middle course to me.","chinese":"對我來說那似乎是非常合理的折中辦法。"},{"english":"That's how the neutralists put it.","chinese":"這是折中主義者的觀點。"},{"english":"However, given the preparation time is too short, everyone still take compromise.","chinese":"不過，鑑於備戰時間過短，大家還是採取折中的方法。"},{"english":"Let's compromise and each pay half the damages.","chinese":"我們採取折中辦法吧，每人付一半的賠償費。"},{"english":"Mixed gold tail eclectic parrot 4 months not weaned.","chinese":"混金尾折中鸚鵡4個月大還沒斷奶。"},{"english":"The discussion eventuated in a compromise.","chinese":"討論以折中而結束。"},{"english":"It's eclectic and versatile and has some cool vocals.","chinese":"它是折中的也是多方面的而且有一些很酷的演奏樂器。"},{"english":"Let’s compromise and each pay half the damages.","chinese":"讓我們採取折中的辦法，每人各賠一半的損傷費用。"},{"english":"I think I have a really eclectic style.","chinese":"我認爲我是個折中主義者。"},{"english":"The essence of Liang Shuming's opinion of culture in his early period is eclecticism.","chinese":"梁漱溟這一早期文化觀的實質就是折中主義。"},{"english":"Finally, you will find that there is no half-measure when it comes to loving someone.","chinese":"最後，你們會發現，愛一個人沒有折中的程度。"}],"related":[{"definition":["variant of 折中[zhe2 zhong1]"],"pinyin":["zhe2 zhong1"],"word":"折衷"},{"definition":["to settle for second best\/the next best thing"],"pinyin":["tui4 er2 qiu2 qi2 ci4"],"word":"退而求其次"},{"definition":["dependable"],"pinyin":["wen3 tuo3"],"word":"穩妥"},{"definition":["(of sb who ostensibly collaborated with the Japanese during the Sino-Japanese war of 1937-1945) to secretly work for the Nationalists or against the Communists"],"pinyin":["qu1 xian4 jiu4 guo2"],"word":"曲線救國"},{"definition":["to satisfy rival demands (idiom)\/to get the best of both worlds\/to have it both ways\/to have one's cake and eat it too"],"pinyin":["liang3 quan2 qi2 mei3"],"word":"兩全其美"},{"definition":["expedient"],"pinyin":["quan2 yi2"],"word":"權宜"},{"definition":["to compromise\/to reach terms\/a compromise"],"pinyin":["tuo3 xie2"],"word":"妥協"},{"definition":["to consider\/to weigh (a matter)\/to balance (pros and cons)"],"pinyin":["quan2 heng2"],"word":"權衡"},{"definition":["pragmatic\/flexible\/to act differently in different situations\/to accommodate to circumstances"],"pinyin":["bian4 tong1"],"word":"變通"},{"definition":["feasible"],"pinyin":["ke3 xing2"],"word":"可行"},{"definition":["to concede\/to give in\/to yield\/a concession\/(linguistics) concessive"],"pinyin":["rang4 bu4"],"word":"讓步"},{"definition":["middle road (in politics)"],"pinyin":["zhong1 jian1 lu4 xian4"],"word":"中間路線"},{"definition":["to consider past cause and future effect (idiom); to think over the past and future\/to ponder over reasons and connection"],"pinyin":["si1 qian2 xiang3 hou4"],"word":"思前想後"},{"definition":["to consider\/to deliberate\/to fill up a cup to the brim"],"pinyin":["zhen1 zhuo2"],"word":"斟酌"},{"definition":["to check and balance (power)\/checks and balances"],"pinyin":["zhi4 heng2"],"word":"制衡"},{"definition":["plan of convenience (idiom); stop-gap measure\/makeshift stratagem\/interim step"],"pinyin":["quan2 yi2 zhi1 ji4"],"word":"權宜之計"}]}