{"definition":["to sell off sth"],"pinyin":["zhe2 bian4"],"simplified":["折变"],"rank":64974.0,"normalized_rank":0.9090705581128538,"fraction":1.5911561327950606e-8,"cumulative_fraction":0.9999531187012228,"word":"折變","characters":[{"definition":["to break (e.g. stick or bone)\/a loss","to break\/to fracture\/to snap\/to suffer loss\/to bend\/to twist\/to turn\/to change direction\/convinced\/to convert into (currency)\/discount\/rebate\/tenth (in price)\/classifier for theatrical scenes\/to fold\/accounts book","to turn sth over\/to turn upside down\/to tip sth out (of a container)"],"pinyin":["she2","zhe1","zhe2"],"word":"折"},{"definition":["to change\/to become different\/to transform\/to vary\/rebellion"],"pinyin":["bian4"],"word":"變"}],"containing_words":[],"sentences":[{"english":"The history and current situation of Polymeric Photorefractive Materials are Outlined.","chinese":"本文綜述了光折變聚合物材料的發展歷史和現狀。"},{"english":"Up to date, the doped lithium niobate crystal is the most ideal three dimensional storage materi…","chinese":"攙雜鈮酸鋰晶體是目前最理想的三維光折變存儲材料。"},{"english":"Nonlinear materials have been well established as photo refractive switching material.","chinese":"非線性材料已經用於光折變開關。"},{"english":"Photorefractive four wave mixing with rapidly amplitude modulated beams is studied theoretically.","chinese":"對高速調幅光束的光折變四波混頻進行了理論研究。"},{"english":"Real-time processing can be achieved if photorefractive material is used.","chinese":"若利用光致折變晶體可實現實時在線提取。"},{"english":"Photorefractive polymer is a novel functional polymer reported at beginning of 1990'.","chinese":"光折變聚合物是90年代出現的一種新型功能高分子。"},{"english":"The temporal behavior of photorefractive spatial solitons is studied in this thesis.","chinese":"本文主要對光折變空間光孤子的時間行爲進行了研究。"},{"english":"The band transport model is now a widely accepted photorefractive theory.","chinese":"帶輸運模型是目前被廣泛接受的光折變理論。"},{"english":"And we also analysis the parameters in the photorefractive two-beam coupling experiment.","chinese":"並對光折變二波耦合實驗中一些參數選擇進行了分析。"}],"related":[]}