{"definition":["to toss from side to side (e.g. sleeplessly)\/to repeat sth over and over again\/to torment sb\/to play crazy\/to squander (time, money)"],"pinyin":["zhe1 teng5"],"simplified":["折腾"],"rank":10379.0,"normalized_rank":0.14521567584962153,"fraction":0.000007788344325964667,"cumulative_fraction":0.9327410708911362,"word":"折騰","characters":[{"definition":["to break (e.g. stick or bone)\/a loss","to break\/to fracture\/to snap\/to suffer loss\/to bend\/to twist\/to turn\/to change direction\/convinced\/to convert into (currency)\/discount\/rebate\/tenth (in price)\/classifier for theatrical scenes\/to fold\/accounts book","to turn sth over\/to turn upside down\/to tip sth out (of a container)"],"pinyin":["she2","zhe1","zhe2"],"word":"折"},{"definition":["to soar\/to gallop\/to prance\/to turn over\/to vacate\/to clear"],"pinyin":["teng2"],"word":"騰"}],"containing_words":[],"sentences":[{"english":"House of flowers may have been a calamity, was it frustrating branches off Whispering.","chinese":"院中的花草可遭了殃，被它折騰的枝折花落。"},{"english":"Stop messing about – finish your work first.","chinese":"別瞎折騰了，先幹完你的工作。"},{"english":"I'm very suspicious of a man who fusses much with his hair.","chinese":"我對於一個爲了頭髮折騰個沒完的人是頗感納罕的。"},{"english":"The net effect is that you wind up with a much better proportioned working space.","chinese":"總的效果是你折騰出一個更符合比例的工作空間。"},{"english":"I should not toss approximately pupils of same master.","chinese":"我不應該折騰同門。"},{"english":"Learn the proper way to toss the birds in this free animal care video.","chinese":"學習正確的方法來折騰在這個自由的鳥動物護理視頻。"},{"english":"After two day-long of tossing about, the question solves finally.","chinese":"經過兩天的折騰，問題終於解決。"},{"english":"I just don't have time for this.","chinese":"我沒時間在這兒瞎折騰了。"},{"english":"I dont like Zheteng, but i will defend to the death your right to Zheteng.","chinese":"我不喜歡折騰，但我願意誓死捍衛你折騰的權利。"},{"english":"I dont like Zheteng, but i will defend to the death your right to Zheteng.","chinese":"我不喜歡折騰，但我願意誓死捍衛你折騰的權利。"},{"english":"Lord knows I've never seen a baby keep its mammy so sick as much as this one has.","chinese":"老天啊，我以前從來沒見過象這樣折騰媽媽的寶寶。"},{"english":"You are so restless. You've moved houses twice in six months.","chinese":"你可真能折騰，半年搬了兩次家。"},{"english":"Time spent agonizing over them is time wasted.","chinese":"把時間折騰在這上面，是浪費時間。"},{"english":"The short three-kilometer drive to the village has taken a total of three hours.","chinese":"從山路到村口不過三公里路，卻折騰了整整三個小時。"},{"english":"I can't. These high-heels are killing me.","chinese":"我沒辦法，這雙高跟鞋快把我折騰死了。"},{"english":"Pushchairs should be capable of withstanding rough treatment.","chinese":"幼兒推車必須能夠經得起劇烈折騰。"}],"related":[{"definition":["shoot!\/gosh!\/oh, no!\/(suffix) to the utmost"],"pinyin":["huai4 le5"],"word":"壞了"},{"definition":["to intertwine\/to band together (with)\/to link up (with)\/twisted\/tangled\/confused\/to be at a loss"],"pinyin":["jiu1 jie2"],"word":"糾結"},{"definition":["not bad\/tolerable\/fortunately"],"pinyin":["hai2 hao3"],"word":"還好"},{"definition":["to say again\/to put off a discussion until later\/moreover\/what's more\/besides"],"pinyin":["zai4 shuo1"],"word":"再說"},{"definition":["this kind of\/so\/this way\/like this\/such"],"pinyin":["zhe4 yang4"],"word":"這樣"},{"definition":["there is nothing to be done\/one can't do anything about it"],"pinyin":["mei2 ban4 fa3"],"word":"沒辦法"},{"definition":["to feel unwell\/to suffer pain\/to be difficult to bear"],"pinyin":["nan2 shou4"],"word":"難受"},{"definition":["almost\/nearly"],"pinyin":["cha4 dian3"],"word":"差點"},{"definition":["so much\/this much\/how much?\/this way\/like this"],"pinyin":["zhe4 me5"],"word":"這麼"},{"definition":["to go to bed\/to sleep"],"pinyin":["shui4 jiao4"],"word":"睡覺"},{"definition":["to be in a tangle\/to nag"],"pinyin":["jiu1 chan2"],"word":"糾纏"},{"definition":["to indulge in flights of fancy (idiom)\/to let one's imagination run wild"],"pinyin":["hu2 si1 luan4 xiang3"],"word":"胡思亂想"},{"definition":["to scold\/to abuse\/to curse\/CL:通[tong4],頓|顿[dun4]"],"pinyin":["ma4"],"word":"罵"},{"definition":["to delay\/to hold up\/to waste time\/to interfere with"],"pinyin":["dan1 wu5"],"word":"耽誤"},{"definition":["to take seriously\/serious\/No joking, really!"],"pinyin":["dang4 zhen1"],"word":"當真"},{"definition":["afterwards\/later"],"pinyin":["hou4 lai2"],"word":"後來"}]}