{"definition":["to reveal\/to publish\/to make public\/to announce"],"pinyin":["pi1 lu4"],"simplified":["披露"],"rank":1612.0,"normalized_rank":0.022553971429770683,"fraction":0.0000989058272816604,"cumulative_fraction":0.6967390205226733,"word":"披露","characters":[{"definition":["to drape over one's shoulders\/to open\/to unroll\/to split open\/to spread out"],"pinyin":["pi1"],"word":"披"},{"definition":["dew\/syrup\/nectar\/outdoors (not under cover)\/to show\/to reveal\/to betray\/to expose","surname Lu","to show\/to reveal\/to betray\/to expose"],"pinyin":["Lu4","lou4","lu4"],"word":"露"}],"containing_words":[],"sentences":[{"english":"The development of financial circles and strick precaution of the risk are closely linked with disclosure of financial information.","chinese":"金融業的發展及其風險的防範與信息披露息息相關。"},{"english":"An absence of the exposure of knowledge-based assets will cause a seriously underrated evaluation of enterprises.","chinese":"對知識資產披露的缺失使企業價值被嚴重低估。"},{"english":"The company shall disclose the situation of implementation of the cash dividends policy in the current reporting period.","chinese":"公司還應披露現金分紅政策在本報告期的執行情況。"},{"english":"Several concessionaires were asked to disclose their revenues and declined.","chinese":"幾個特許經營者被要求披露其收入和下降。"},{"english":"Terms of the deal were not disclosed.","chinese":"合併協議的條款沒有披露。"},{"english":"All markets should have standards for stability and a mechanism for disclosure.","chinese":"所有市場都必須建立穩定性標準和信息披露機制。"},{"english":"Greater disclosure requirements to answer to private-sector shareholders is significant.","chinese":"更大的披露要求對與私有部門的持股者來說意義重大。"},{"english":"Listed companies are not generally required to issue paid announcements in gazetted newspapers.","chinese":"上市公司毋須在憲報指定報章刊登付款公佈披露資料。"},{"english":"Guti said he was considering an offer from Turkish club Besiktas.","chinese":"古蒂披露，他正在考慮來自土耳其貝西克塔斯的邀請。"},{"english":"NEPA requires that plausible statements as to the prospective impacts be disclosed in advance.","chinese":"覃要求的陌瞻性聲明爲似是而非的關係是提前披露。"},{"english":"In addition, noncash investing and financing activities are reported in an accompanying schedule .","chinese":"另外，非現金投資和籌資活動被披露在附表中。"},{"english":"Durex sexual well being survey is an annual affair in which they reveal trends across the globe.","chinese":"杜蕾斯性福調查每年進行一次，披露的是全球趨勢。"},{"english":"The Company has a legal obligation to disclose any of the people.","chinese":"本公司有法律義務對之披露的任何人士。"},{"english":"But the rollcall of Japanese names went on.","chinese":"但日文名單仍在繼續被披露。"},{"english":"Holder did not reveal the identity of the detainees in his statement.","chinese":"霍爾德沒有在他的聲明中披露囚犯的身份。"},{"english":"The disclosure of relevant information is made by addi…","chinese":"相關信息披露主要是通過會計報表附註實現。"}],"related":[{"definition":["post\/announcement"],"pinyin":["gong1 gao4"],"word":"公告"},{"definition":["prospectus (setting out share offer)\/offering circular"],"pinyin":["zhao1 gu3 shu1"],"word":"招股書"},{"definition":["prospectus"],"pinyin":["zhao1 gu3 shuo1 ming2 shu1"],"word":"招股說明書"},{"definition":["annual report"],"pinyin":["nian2 du4 bao4 gao4"],"word":"年度報告"},{"definition":["to leak out\/to divulge\/to reveal"],"pinyin":["tou4 lu4"],"word":"透露"},{"definition":["to announce\/to make public\/to publish"],"pinyin":["gong1 bu4"],"word":"公佈"},{"definition":["public\/to publish\/to make public"],"pinyin":["gong1 kai1"],"word":"公開"},{"definition":["to report (news)\/report\/CL:篇[pian1],份[fen4]"],"pinyin":["bao4 dao4"],"word":"報道"},{"definition":["listed company"],"pinyin":["shang4 shi4 gong1 si1"],"word":"上市公司"},{"definition":["before this\/before then\/previously"],"pinyin":["ci3 qian2"],"word":"此前"},{"definition":["annual report"],"pinyin":["nian2 bao4"],"word":"年報"},{"definition":["to examine\/to inspect"],"pinyin":["he2 cha2"],"word":"核查"},{"definition":["China Securities Regulatory Commission (CSRC)\/abbr. for 中國證券監督管理委員會|中国证券监督管理委员会[Zhong1 guo2 Zheng4 quan4 Jian1 du1 Guan3 li3 Wei3 yuan2 hui4]"],"pinyin":["Zheng4 jian1 hui4"],"word":"證監會"},{"definition":["to quote\/to cite\/to recommend (one's friend's, associates etc)"],"pinyin":["yuan2 yin3"],"word":"援引"},{"definition":["to submit (a report etc)\/to refer (a problem) to sb"],"pinyin":["ti2 jiao1"],"word":"提交"},{"definition":["financial report"],"pinyin":["cai2 bao4"],"word":"財報"}]}