{"definition":["lit. to clasp the Buddha's feet (without ever having burned incense) (idiom); fig. to profess devotion only when in trouble\/panic measures in place of timely preparation"],"pinyin":["bao4 fo2 jiao3"],"simplified":["抱佛脚"],"rank":55352.0,"normalized_rank":0.7744462944048802,"fraction":7.824400799799564e-8,"cumulative_fraction":0.9995414515750396,"word":"抱佛腳","characters":[{"definition":["to hold\/to carry (in one's arms)\/to hug\/to embrace\/to surround\/to cherish"],"pinyin":["bao4"],"word":"抱"},{"definition":["Buddha\/Buddhism"],"pinyin":["Fo2"],"word":"佛"},{"definition":["foot\/leg (of an animal or an object)\/base (of an object)\/CL:雙|双[shuang1],隻|只[zhi1]\/classifier for kicks","variant of 角[jue2]\/role"],"pinyin":["jiao3","jue2"],"word":"腳"}],"containing_words":[{"definition":["lit. to clasp the Buddha's feet when danger arises (idiom); fig. to profess devotion only when in trouble\/doing things at the last minute\/making a hasty last-minute effort"],"pinyin":["lin2 shi2 bao4 fo2 jiao3"],"word":"臨時抱佛腳"},{"definition":["lit. to clasp the Buddha's feet when danger arises (idiom); fig. to profess devotion only when in trouble\/doing things at the last minute\/to make a hasty last-minute effort (often refers to cramming for exams)"],"pinyin":["ping2 shi2 bu4 shao1 xiang1 , lin2 shi2 bao4 fo2 jiao3"],"word":"平時不燒香，臨時抱佛腳"}],"sentences":[{"english":"She is cramming for tomorrow's exam.","chinese":"她正明天的考試而臨急抱佛腳。"},{"english":"She is cmp3ming for tomorrow's exam.","chinese":"她正爲明天的考試而臨急抱佛腳。"},{"english":"However it is a pity that he should always cram at the eleventh hour.","chinese":"腔而很可惜的是他總是臨時抱佛腳。"},{"english":"I only have two hours to cram for this English test!","chinese":"我只有兩個小時的時間來爲英文考試臨時抱佛腳。"},{"english":"She's cramming for her history exam.","chinese":"她考歷史之前臨時抱佛腳。"},{"english":"I need to cram for tomorrow's test.","chinese":"我得爲應付明天的測驗而臨時抱佛腳了。"},{"english":"He boned up on medieval art before the exam.","chinese":"他考試前臨時抱佛腳溫習中世紀藝術。"},{"english":"She is cramming for tomorrow\"s exam.\"","chinese":"她正爲明天的考試而臨急抱佛腳。"},{"english":"It's only used to describe studying for a test, usually college or high-school level.","chinese":"這是指中學生或大學生在考試前臨時抱佛腳。"},{"english":"Embrace Buddha's feet in one' hour of need.","chinese":"閒時不燒香，臨時抱佛腳。"},{"english":"It is impossible to get by a foreign language exam by cramming at the last minute.","chinese":"想要臨時抱佛腳來混過外語考試是不可能的。"}],"related":[]}