{"definition":["water pump"],"pinyin":["chou1 shui3 ji1"],"simplified":["抽水机"],"rank":36413.0,"normalized_rank":0.5094651126999007,"fraction":5.331102932997764e-7,"cumulative_fraction":0.9948527408523408,"word":"抽水機","characters":[{"definition":["to draw out\/to pull out from in between\/to remove part of the whole\/(of certain plants) to sprout or bud\/to whip or thrash"],"pinyin":["chou1"],"word":"抽"},{"definition":["surname Shui","water\/river\/liquid\/beverage\/additional charges or income\/(of clothes) classifier for number of washes"],"pinyin":["Shui3","shui3"],"word":"水"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[],"sentences":[{"english":"The pump was stuttering out water.","chinese":"抽水機突突地冒出了水。"},{"english":"He hopelessly approached the corner of the cottage and surprisingly found a water pump.","chinese":"他幾近絕望地走到屋角，卻意外地發現了一座抽水機。"},{"english":"The pump is actuated by a belt driven by an electric motor.","chinese":"這臺抽水機由電動機皮帶驅動。"},{"english":"Pumped hydro is the first idea.","chinese":"抽水機抽氫是首選想法。"},{"english":"In a word, I was so surprised, that I fell down in a Swoon.","chinese":"一句話，我嚇得暈倒在抽水機旁。"},{"english":"So they are using their treadle pumps again.","chinese":"所以他們重新使用踏板抽水機。"},{"english":"We use pumps to feed fresh water into the boiler.","chinese":"我們用抽水機給鍋爐加水。"},{"english":"They also carried two pumps to remove salt from ocean water.","chinese":"他們還帶了兩個抽水機，用來除去海水中的鹽。"},{"english":"How do you pump out bilge water in the engine room?","chinese":"您怎樣將機倉的污抽水機出弦外？"},{"english":"Our water comes from the pump of a private well.","chinese":"我們的水，是用抽水機從私人井裏抽出。"},{"english":"At the farm there was an old-fashioned pump for drawing water from a well.","chinese":"那個農場有一臺老式的用來從井裏抽水的抽水機。"},{"english":"At the farm there was an oldfashioned pump for drawing water from a well.","chinese":"那個農場有一臺老式的抽水機，用來從井裏抽水。"}],"related":[]}