{"definition":["Lahore (city in Pakistan)"],"pinyin":["La1 he2 er3"],"simplified":["拉合尔"],"rank":38656.0,"normalized_rank":0.5408475927972801,"fraction":4.3632712669031533e-7,"cumulative_fraction":0.9959381280093916,"word":"拉合爾","characters":[{"definition":["to pull\/to play (a bowed instrument)\/to drag\/to draw\/to chat"],"pinyin":["la1"],"word":"拉"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"}],"containing_words":[],"sentences":[{"english":"The prime minister was flying back to Islamabad from Lahore.","chinese":"吉拉尼總理當時正從拉合爾飛回伊斯蘭堡。"},{"english":"Lahore police say the U. S. diplomat was taken to a police facility and an investigation is under way.","chinese":"拉合爾市警方說，這名美國外交官被帶到警察部門。"},{"english":"A general view of the Shalimar Gardens in Lahore March 10, 2007.","chinese":"巴基斯坦拉合爾的沙莉馬花園外觀。"},{"english":"A city of west-central Pakistan west-southwest of Lahore .","chinese":"基達巴基斯坦中西部一城市，位於拉合爾西南偏西。"},{"english":"This is from the murder of 27 occurred in the eastern city of Lahore at a busy street.","chinese":"這起命案27日發生在拉合爾東部城區一處繁忙街道。"},{"english":"The police chief in Lahore called him a \"cold-blooded murderer.\"","chinese":"拉合爾的警察總監說，戴維斯是個“冷血殺手”。"},{"english":"The police chief in Lahore called him a \"cold-blooded murderer.","chinese":"拉合爾的警察總監說，戴維斯是個“冷血殺手”。"},{"english":"“Then we rode up the Karakoram Highway through northern Pakistan, ” his companion continued.","chinese":"然後我們騎上拉合爾公路穿越了北部的巴基斯坦。"},{"english":"This makeshift ring is on the outskirts of Lahore.","chinese":"這個臨時修建的摔跤場地在拉合爾郊外。"},{"english":"Take another bus or taxi the remaining 20km to Lahore.","chinese":"再搭巴士到20公里外的拉合爾。"},{"english":"The situation at JuD headquarters in Lahore was no better.","chinese":"位於拉合爾的達瓦慈善會總部的情況也好不到哪去。"},{"english":"It's very different, set in Lahore.","chinese":"非常與衆不同，開始在拉合爾。"}],"related":[]}