{"definition":["to toss\/to throw out"],"pinyin":["pao1 chu1"],"simplified":["抛出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"拋出","characters":[{"definition":["to throw\/to toss\/to fling\/to cast\/to abandon"],"pinyin":["pao1"],"word":"拋"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"RemoteException - Thrown when the method failed due to a system-level failure.","chinese":"方法拋出該異常表示一個由系統級錯誤引起的失敗。"},{"english":"Right. I have witnessed some applications that in fact rarely or never throw exceptions.","chinese":"是的，我知道有些應用程序極少或從來不會拋出異常。"},{"english":"The car stopped suddenly and I was catapulted through the windshield.","chinese":"汽車突然停下，我被拋出擋風玻璃的外面。"},{"english":"Otherwise, it should throw an exception.","chinese":"否則，它應拋出異常。"},{"english":"The collection will be empty after this call returns (unless it throws an exception).","chinese":"方法返回後集合將爲空除非拋出異常。"},{"english":"RemoteException - The EJB object could not be obtained because of a system-level failure.","chinese":"因爲系統級錯誤而不能獲得EJB對象時拋出。"},{"english":"Tang finally struck table to throw after the dragon he or she this come of true aim.","chinese":"唐繼龍最後拍着桌子拋出了自己此來的真實意圖。"},{"english":"Jack dabbed his rope on the steer.","chinese":"傑克拋出繩索套住了那頭小公牛。"},{"english":"This error is thrown during the initialization phase of class loading.","chinese":"這個錯誤在類裝入的初始化階段拋出。"},{"english":"In what direction should Tahi throw the ball so that it travels directly towards Rowena?","chinese":"球的運動方向與拋出方向關係如何？"},{"english":"If an exception is thrown, then the exception indicates the cause of the failure.","chinese":"如果拋出了異常，那麼這個異常會指出失敗的原因。"},{"english":"It is thrown as a result of incompatible types being found in a type comparison. The JVM specification says a that ClassCastException is","chinese":"它是在類型比較中發現不兼容類型的時候拋出的。"},{"english":"So it's not defined. But in fact, what this did was it threw an exception.","chinese":"這是未定義，但實際上，這裏做的就是拋出一個異常。"},{"english":"It throws an exception if it finds any nested elements.","chinese":"如果遇到嵌套的元素就會拋出異常。"},{"english":"If this library is not found, the error is thrown.","chinese":"如果找不到這個庫，就會拋出這個錯誤。"},{"english":"The under the leg forehand throw is one of the easier sidearm throws to master.","chinese":"正手腿下拋出是比較容易掌握手槍之一拋出。"}],"related":[{"definition":["to throw\/to toss\/to fling\/to cast\/to abandon"],"pinyin":["pao1"],"word":"拋"},{"definition":["right away\/quickly\/immediately"],"pinyin":["li4 shi2"],"word":"立時"},{"definition":["lit. hiding the sky and covering the earth (idiom); fig. earth-shattering\/omnipresent\/of universal importance"],"pinyin":["pu1 tian1 gai4 di4"],"word":"鋪天蓋地"},{"definition":["to toss\/to throw dice\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"擲"},{"definition":["to fly out"],"pinyin":["fei1 chu1"],"word":"飛出"},{"definition":["to wave sth\/to brandish"],"pinyin":["hui1 dong4"],"word":"揮動"},{"definition":["to hit (a target etc)\/to strike"],"pinyin":["ji1 zhong4"],"word":"擊中"},{"definition":["lit. the night-blooming cactus shows once\/flash in the pan (idiom)\/short-lived"],"pinyin":["tan2 hua1 yi1 xian4"],"word":"曇花一現"},{"definition":["to bombard\/to bomb\/(fig.) to criticize\/to roast"],"pinyin":["pao4 hong1"],"word":"炮轟"},{"definition":["to ask (a question) in reply\/to answer a question with a question\/rhetorical question"],"pinyin":["fan3 wen4"],"word":"反問"},{"definition":["to plunder\/to pillage\/to forcibly take"],"pinyin":["qiang3 duo2"],"word":"搶奪"},{"definition":["a succession of\/a series of"],"pinyin":["yi1 lian2 chuan4"],"word":"一連串"},{"definition":["to entice\/to lead astray"],"pinyin":["gu3 huo4"],"word":"蠱惑"},{"definition":["to raise one's head\/to perk up"],"pinyin":["yang2 qi3"],"word":"揚起"},{"definition":["one after another (idiom)\/in quick succession"],"pinyin":["jie1 er4 lian2 san1"],"word":"接二連三"},{"definition":["to throw off\/to struggle free of\/Taiwan pr. [zheng1 tuo1]"],"pinyin":["zheng4 tuo1"],"word":"掙脫"}]}