{"definition":["paraboloid (geometry)"],"pinyin":["pao1 wu4 mian4"],"simplified":["抛物面"],"rank":64611.0,"normalized_rank":0.9039917171519316,"fraction":1.751731522343186e-8,"cumulative_fraction":0.9999470558124496,"word":"拋物面","characters":[{"definition":["to throw\/to toss\/to fling\/to cast\/to abandon"],"pinyin":["pao1"],"word":"拋"},{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"},{"definition":["face\/side\/surface\/aspect\/top\/classifier for flat surfaces such as drums, mirrors, flags etc"],"pinyin":["mian4"],"word":"面"}],"containing_words":[{"definition":["hyperbolic paraboloid (math.)"],"pinyin":["shuang1 qu1 pao1 wu4 mian4"],"word":"雙曲拋物面"}],"sentences":[{"english":"In this paper, some new conclusions about the properties of elliptic paraboloid are introduced.","chinese":"推出橢圓拋物面的幾條性質，得到一些新的結果。"},{"english":"This method can also be used for paraboloid and hyperboloid.","chinese":"這種方法也適用於拋物面和雙曲面。"},{"english":"Offset paraboloid antenna has widely been utilized in small aperture antennas.","chinese":"偏置拋物面無線在小口徑天線中得到了廣泛的應用。"},{"english":"The third kind of solar oven is a parabolic cooker.","chinese":"第三類是太陽爐拋物面爐。"},{"english":"It is this parabola and is pointing up.","chinese":"這就是那個拋物面，它是開口向上的。"},{"english":"The design of an airborne off-set parabolic reflector antenna with low sidelobes is discussed.","chinese":"介紹了機載雷達低副瓣偏饋拋物面無線的設計。"},{"english":"The parabolic reflector of a searchlight gives a parallel beam.","chinese":"探照燈的拋物面反射鏡發出平行光束。"},{"english":"I should stop integrating where my paraboloid hits the xy plane.","chinese":"在當拋物面與xy平面相交的地方就停止積分。"},{"english":"This is the paraboloidal mirror at the bottom of the tube.","chinese":"是位於鏡筒底部的一塊拋物面鏡。"},{"english":"Of course, I didn't tell you which way I am orienting my paraboloid.","chinese":"當然這是因爲沒給出拋物面的的正方向。"},{"english":"OK, it's what you get by taking a parabola and rotating it.","chinese":"旋轉一條拋物線，就能得到這個拋物面。"}],"related":[]}