{"definition":["to throw out\/to get rid of"],"pinyin":["pao1 kai1"],"simplified":["抛开"],"rank":13625.0,"normalized_rank":0.1906314272522491,"fraction":0.000004903388486292301,"cumulative_fraction":0.9528445212267468,"word":"拋開","characters":[{"definition":["to throw\/to toss\/to fling\/to cast\/to abandon"],"pinyin":["pao1"],"word":"拋"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"}],"containing_words":[],"sentences":[{"english":"My only argument was that assuming anything at this point, is totaly wrong!","chinese":"拋開這個不談，我們是從不同的觀點來辯論一件事情。"},{"english":"We can, of course, dismiss such nonsense as superstition.","chinese":"當然，我們可以拋開這些傳言，全當它是迷信之說。"},{"english":"Sooner or later we have to put aside our denial and face the world.","chinese":"或遲或早我們終歸要拋開否認而直面這個現實的世界。"},{"english":"Leave on one side the question of whether the Geither plan is a good idea or not.","chinese":"我們姑且拋開蓋特納計劃好與壞的問題。"},{"english":"I think it is misleading to talk about success without also referencing failure.","chinese":"我認爲拋開失敗只談成功會給大家產生誤導。"},{"english":"The car put on speed and soon pulled mazy from the other vehicles.","chinese":"車加快速度，不久就拋開了其它車輛。"},{"english":"I was with people who had shed all the inconsequence of earlier life.","chinese":"我和那些拋開生命中所有矛盾的人們在一起。"},{"english":"Pull out your best jeans and most attractive tops.","chinese":"拋開你漂亮的牛仔和最好的上裝。"},{"english":"Cast your care aside.","chinese":"拋開你的憂慮吧。"},{"english":"Personally I found it difficult to dump the outrage script.","chinese":"就我個人而言，很難完全拋開義憤腳本形事。"},{"english":"I hope I can continue like this without any more hitches .","chinese":"我希望我能夠拋開傷病的困擾繼續這樣下去。"},{"english":"Finally, I decide to toss the \"loaning funds\" use case.","chinese":"最後，我決定拋開“貸款”用例。"},{"english":"February:Return to the hometown, throwing all your past cares aside.","chinese":"回一次家鄉，拋開過去的所有感傷。"},{"english":"He broke from prevailing orthodoxies and asked the awkward questions.","chinese":"他拋開盛行的正統觀念，問了一些難以回答的問題。"},{"english":"Despite that, the figures added to fears about the US economic recovery.","chinese":"拋開這些，統計數據增加了對美國經濟復甦的擔憂。"},{"english":"You cannot factor out these preconceptions.","chinese":"人們無法拋開先入之見。"}],"related":[{"definition":["preconceived idea\/bias\/prejudice"],"pinyin":["cheng2 jian4"],"word":"成見"},{"definition":["in a word\/in short\/in brief"],"pinyin":["zong3 zhi1"],"word":"總之"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或許"},{"definition":["unrelated\/having nothing to do (with sth else)"],"pinyin":["wu2 guan1"],"word":"無關"},{"definition":["to come and go\/to have friendly relations with\/in the past\/previous"],"pinyin":["guo4 wang3"],"word":"過往"},{"definition":["to separate oneself from\/to break away from\/diastasis (medicine)\/abscission\/abjunction (botany)"],"pinyin":["tuo1 li2"],"word":"脫離"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"畢竟"},{"definition":["to change\/to alter\/to transform"],"pinyin":["gai3 bian4"],"word":"改變"},{"definition":["to give up\/to abandon\/to abort"],"pinyin":["she3 qi4"],"word":"捨棄"},{"definition":["to break away from\/to cast off (old ideas etc)\/to get rid of\/to break away (from)\/to break out (of)\/to free oneself from\/to extricate oneself"],"pinyin":["bai3 tuo1"],"word":"擺脫"},{"definition":["to adapt (to an environment etc)\/to make sth suitable\/adaptation\/adjustment\/adaptive"],"pinyin":["tiao2 shi4"],"word":"調適"},{"definition":["to sway\/to waver\/to rock\/to rattle\/to destabilize\/to pose a challenge to"],"pinyin":["dong4 yao2"],"word":"動搖"},{"definition":["to bind\/to yoke\/to impede"],"pinyin":["qian1 ban4"],"word":"牽絆"},{"definition":["to return to\/to retreat\/regression (statistics)"],"pinyin":["hui2 gui1"],"word":"回歸"},{"definition":["whatever\/no matter what (who, how etc)\/regardless of\/not to discuss"],"pinyin":["bu4 lun4"],"word":"不論"},{"definition":["only\/nothing else"],"pinyin":["wu2 fei1"],"word":"無非"}]}