{"definition":["to sell at auction\/to reach a given price at auction"],"pinyin":["pai1 chu1"],"simplified":["拍出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"拍出","characters":[{"definition":["to pat\/to clap\/to slap\/to swat\/to take (a photo)\/to shoot (a film)\/racket (sports)\/beat (music)"],"pinyin":["pai1"],"word":"拍"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"The auction house estimates it to be worth as much as HK$60,000.","chinese":"蘇黎世亞洲預計這枚信封能拍出60，000港元。"},{"english":"One of the key elements in a memorable photograph may well be the quality of light.","chinese":"要拍出令人過目難忘的照片，關鍵因素之一是光線。"},{"english":"Orange Island officials said the bottles of champagne can be sold for more than 70,000 U. S. dollars of the price.","chinese":"奧蘭島官員稱每瓶香檳可拍出超過7萬美元的價格。"},{"english":"All underwater photos in this article were taken with point & shoot cameras.","chinese":"本文所有的水下照片都是用傻瓜機拍出來的。"},{"english":"You cannot take a good photograph unless the object is in focus.","chinese":"只有對準焦距纔可以拍出好照片。"},{"english":"The photos show the flossy feelings of \"Beckham's night \".","chinese":"寫真拍出了“貝克漢姆之夜”的迷情效果。"},{"english":"This helps viewers understand what they're looking at.","chinese":"這樣拍出的照片有利於給觀看者判斷拍攝對象的大小。"},{"english":"If they could make beautiful ads, I could bear.","chinese":"如果他們能拍出漂亮的廣告，我可以忍受。"},{"english":"It's the perfect accessory for getting great photos in any location. Please note, camera not included (duh! ).","chinese":"想在任何位置拍出好照片，這個附件最適合不過了。"},{"english":"Her face figure looked most distinct took photo from her right front.","chinese":"從她的右側前方拍出的女神面部輪廓最清晰。"},{"english":"Who would have thought that the person to make a movie about this would be Johnnie To?","chinese":"誰曾料想，拍出了反映這一現狀影片的人會是杜琪峯？"},{"english":"I guess we felt we had to play the story with truth.","chinese":"我想需要把故事的真實性拍出來。"},{"english":"All that I needed to make the shot that I had envisioned was for all the necessary elements to align.","chinese":"要拍出預想中的相片只需將所有必須的要素湊到一起。"},{"english":"If you don't hold that camera still, you'll get a blurred picture.","chinese":"如果你的相機沒有拿穩，拍出來的照片將會變模糊。"},{"english":"I've been amazing people for at least seven years with what I pull out Canon's compacts.","chinese":"至少七年來我的佳能小相機拍出的照片一直令人驚歎。"},{"english":"They came out really great and you can’t even tell how miserable I was.","chinese":"這些拍出來效果很好，你不知道我遭了多少罪。"}],"related":[{"definition":["to pat\/to clap\/to slap\/to swat\/to take (a photo)\/to shoot (a film)\/racket (sports)\/beat (music)"],"pinyin":["pai1"],"word":"拍"},{"definition":["to film\/to shoot (a picture)"],"pinyin":["pai1 she4"],"word":"拍攝"},{"definition":["wide expanse\/large area\/vast stretch\/extending widely\/blockbuster movie"],"pinyin":["da4 pian4"],"word":"大片"},{"definition":["to begin shooting (a movie, a scene of a movie etc)\/to start the bidding (auction)\/to start a trading session (stock market)"],"pinyin":["kai1 pai1"],"word":"開拍"},{"definition":["high price"],"pinyin":["gao1 jia4"],"word":"高價"},{"definition":["backlighting (lighting design)"],"pinyin":["ni4 guang1"],"word":"逆光"},{"definition":["camera lens\/camera shot (in a movie etc)\/scene"],"pinyin":["jing4 tou2"],"word":"鏡頭"},{"definition":["extremely expensive\/sky-high price"],"pinyin":["tian1 jia4"],"word":"天價"},{"definition":["likeness of a person (sketch, photo, sculpture etc)"],"pinyin":["ren2 xiang4"],"word":"人像"},{"definition":["background blurring (photography)"],"pinyin":["bei4 jing3 xu1 hua4"],"word":"背景虛化"},{"definition":["single-lens reflex camera (SLR)"],"pinyin":["dan1 fan3 xiang4 ji1"],"word":"單反相機"},{"definition":["(art) composition"],"pinyin":["gou4 tu2"],"word":"構圖"},{"definition":["to start shooting (a film)\/to invest in (a movie)\/to put (sth) up for auction"],"pinyin":["tou2 pai1"],"word":"投拍"},{"definition":["black and white\/right and wrong\/monochrome"],"pinyin":["hei1 bai2"],"word":"黑白"},{"definition":["photographer\/cameraman"],"pinyin":["she4 ying3 shi1"],"word":"攝影師"},{"definition":["light and shadow\/sunlight and shade"],"pinyin":["guang1 ying3"],"word":"光影"}]}