{"definition":["to refuse\/to decline\/to reject"],"pinyin":["ju4 jue2"],"simplified":["拒绝"],"rank":1556.0,"normalized_rank":0.021770458774642173,"fraction":0.00010300750664122696,"cumulative_fraction":0.6910910594286747,"word":"拒絕","characters":[{"definition":["to resist\/to repel\/to refuse"],"pinyin":["ju4"],"word":"拒"},{"definition":["to cut short\/extinct\/to disappear\/to vanish\/absolutely\/by no means"],"pinyin":["jue2"],"word":"絕"}],"containing_words":[{"definition":["distributed denial of service (DDOS) form of Internet attack"],"pinyin":["fen1 bu4 shi4 ju4 jue2 fu2 wu4"],"word":"分佈式拒絕服務"}],"sentences":[{"english":"When the article arrived, the editor read the first sentence and then refused to publish it.","chinese":"稿子寄來後，編輯看第一句話就拒絕予以發表。"},{"english":"But Mr. Viniar declined to discuss in detail the impact that the new regulations would have on Goldman, saying that it was too early to give any guidance on the subject.","chinese":"關於新法案對高盛的影響，維尼亞拒絕詳細置評。"},{"english":"Tigeress:Oogway saw darkness in his heart and refused.","chinese":"龜大仙卻認爲他心術不正，拒絕了他。"},{"english":"But Ms. Hicks resisted any suggestion that she is capitalizing on the proceedings.","chinese":"但是，希克斯女士拒絕承認，說她是借題炒作。"},{"english":"But Cho refused to accept that, not wanting to lose the protectorate .","chinese":"但喬拒絕接受這一切，他不想失去保護權。"},{"english":"The President refused to either confirm or deny this rumor.","chinese":"總統拒絕證實或否認這種傳聞。"},{"english":"But we must reject isolationism and its companion, protectionism. Retreating behind our borders would only invite danger.","chinese":"但是我們必須拒絕孤立主義及作爲其同伴的保護主義。"},{"english":"Eg. For years he refused to associate with Stephenson's staff.","chinese":"多年來，他一直拒絕同史蒂芬森手下的人交往。"},{"english":"I refuse to even use the hyphenated term Chinese-American.","chinese":"我甚至拒絕使用“美籍華裔”這個組合詞。"},{"english":"The horse was behaving fractiously and refused to jump.","chinese":"這匹馬很倔強，拒絕跳越。"},{"english":"But the prosecutor declined on the grounds that the issue should be investigated in the US.","chinese":"但檢察官拒絕的理由是，這個案子應當在美國調查。"},{"english":"I thought he was ok, but he was refused by majordomo.","chinese":"我認爲可以，但是他還是被總監拒絕了。"},{"english":"Carmack said Id turned down many offers from large publishers over the years.","chinese":"卡馬克說號拒絕了許多優惠大出版商多年來。"},{"english":"They might be required information for the approval or rejection decision.","chinese":"他們在決定審批或拒絕時可能需要這些信息。"},{"english":"They refused to provide the judge with a scale of values not contained in the positive law.","chinese":"他們拒絕爲法官提供實在法所未規定的任何價值標準。"},{"english":"It is ungenerous of you to refuse his request.","chinese":"你拒絕他的請求，這樣做並不大方。"}],"related":[{"definition":["to renounce\/to abandon\/to give up"],"pinyin":["fang4 qi4"],"word":"放棄"},{"definition":["to take the initiative\/to do sth of one's own accord\/spontaneous\/active\/opposite: passive 被動|被动[bei4 dong4]\/drive (of gears and shafts etc)"],"pinyin":["zhu3 dong4"],"word":"主動"},{"definition":["to fight against\/to oppose\/to be opposed to\/opposition"],"pinyin":["fan3 dui4"],"word":"反對"},{"definition":["unwilling\/unwillingness"],"pinyin":["bu4 yuan4"],"word":"不願"},{"definition":["to admit\/to concede\/to recognize\/recognition (diplomatic, artistic etc)\/to acknowledge"],"pinyin":["cheng2 ren4"],"word":"承認"},{"definition":["to respond\/response"],"pinyin":["hui2 ying4"],"word":"回應"},{"definition":["to persuade\/to convince\/to talk sb over\/Taiwan pr. [shui4 fu2]"],"pinyin":["shuo1 fu2"],"word":"說服"},{"definition":["to answer\/to respond\/to answer positively\/to agree\/to accept\/to promise"],"pinyin":["da1 ying5"],"word":"答應"},{"definition":["counterpart\/other person involved\/opposite side\/other side\/receiving party"],"pinyin":["dui4 fang1"],"word":"對方"},{"definition":["they"],"pinyin":["ta1 men5"],"word":"他們"},{"definition":["to wish\/to want\/ready\/willing (to do sth)"],"pinyin":["yuan4 yi4"],"word":"願意"},{"definition":["improbable\/unlikely\/will not (act, happen etc)\/not able\/not having learned to do sth\/(coll.) (Tw) don't mention it\/not at all"],"pinyin":["bu4 hui4"],"word":"不會"},{"definition":["because\/owing to\/on account of"],"pinyin":["yin1 wei4"],"word":"因為"},{"definition":["explanation\/to explain\/to interpret\/to resolve\/CL:個|个[ge4]"],"pinyin":["jie3 shi4"],"word":"解釋"},{"definition":["to approve of\/to endorse\/to acknowledge\/to recognize\/to identify oneself with"],"pinyin":["ren4 tong2"],"word":"認同"},{"definition":["in no way\/not in the least\/absolutely not"],"pinyin":["jue2 bu4"],"word":"絕不"}]}