{"definition":["topology (math.)"],"pinyin":["tuo4 pu1 xue2"],"simplified":["拓扑学"],"rank":55633.0,"normalized_rank":0.7783778489779357,"fraction":7.561641071448088e-8,"cumulative_fraction":0.9995630699857124,"word":"拓撲學","characters":[{"definition":["surname Tuo","to expand\/to push sth with the hand\/to develop\/to open up","to make a rubbing (e.g. of an inscription)"],"pinyin":["Tuo4","ta4","tuo4"],"word":"拓"},{"definition":["to throw oneself at\/to pounce on\/to devote one's energies\/to flap\/to flutter\/to dab\/to pat\/to bend over"],"pinyin":["pu1"],"word":"撲"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[{"definition":["(math.) geometric topology"],"pinyin":["ji3 he2 tuo4 pu1 xue2"],"word":"幾何拓撲學"}],"sentences":[{"english":"According to the point-set topology theory, regions with holes are redefined.","chinese":"根據點集拓撲學理論，對帶孔面域進行了定義。"},{"english":"The method of mappings and covers is a basic tool to study general topology.","chinese":"映射與覆蓋的方法是研究一般拓撲學的基本工具。"},{"english":"At is time the subject of topology was known as analysis situs .","chinese":"在這個時候，拓撲學被稱做位置幾何學。"},{"english":"See, this is kind of topology in a way.","chinese":"這有點進入拓撲學了。"},{"english":"Intopological graph theory, the surface S is a compact 2-dimensional manifold without boundary.","chinese":"曲面S是拓撲學中的無邊緣的2維緊閉流型。"},{"english":"Monadic Boolean algebras have an important connection to topology.","chinese":"一元布爾代數與拓撲學有重要聯繫。"},{"english":"Students should have some familiarity with commutative algebra and basic topology.","chinese":"學生需要對交換代數和基本拓撲學有一定的瞭解。"},{"english":"Methods Using method of the theory of set and general topology.","chinese":"方法集合論與點集拓撲學中的方法。"},{"english":"The students in a topology course should have some knowledge of mathematical analysis and abstract algebra .","chinese":"拓撲學要求學生具備一些數學分析和抽象代數的基礎。"},{"english":"The theory of generalized metric spaces is an important question of general topology.","chinese":"廣義度量空間理論是一般拓撲學研究的重要課題。"},{"english":"Separation axiom is one of the important studied content in topology.","chinese":"分離性是拓撲學中重要研究課題之一。"},{"english":"Topology is an one-semester course at the senior level.","chinese":"拓撲學應爲大學四年級一學期的課程。"}],"related":[]}