{"definition":["to drag in"],"pinyin":["tuo1 jin4"],"simplified":["拖进"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"拖進","characters":[{"definition":["to drag\/to tow\/to trail\/to hang down\/to mop (the floor)\/to delay\/to drag on"],"pinyin":["tuo1"],"word":"拖"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[],"sentences":[{"english":"We were haled into the bathroom.","chinese":"我們被強行拖進了洗漱間。"},{"english":"A pair of guards dragged a prisoner in through the tower's stone doorway.","chinese":"兩個守衛把一個囚犯拖進來，穿過塔樓的石梯入口。"},{"english":"She hauled her large box into the room.","chinese":"她把那隻大箱子拖進了房間。"},{"english":"Pull a sled into the mud, so we worse calamity.","chinese":"把雪橇拖進泥塘裏，害得我們糟了殃。"},{"english":"The terrorists dragged her into a dark room and duffed her up.","chinese":"那些恐怖分子把她拖進一間黑暗的房間毒打了一頓。"},{"english":"The tugboat tugged the freighter into the harbor.","chinese":"拖輪把貨船拖進海港了。"},{"english":"The fishermen hauled the fish into the boat.","chinese":"漁人們把魚拖進漁船。"},{"english":"They grab the immobilized Jack and drag him inside.","chinese":"他們抓住了不能動彈的傑克，把他拖進了門裏。"},{"english":"The Wizard buys the opera tickets; I drag him to the odd Chinese culture events.","chinese":"韋澤買了歌劇票，我把他拖進了奇異的中國文化。"},{"english":"He part say, part hard drag along beard spring into the front door of guest house.","chinese":"他一邊說着，一邊就硬把胡春拖進了招待所的大門。"},{"english":"Hale drags Leticia into the woods and forces her to the ground.","chinese":"Hale將她拖進了樹林，扔在地上。"},{"english":"She tugged the suitcase into her room.","chinese":"她把手提箱拖進房間裏。"},{"english":"The mice pulled the carriage into the barn.","chinese":"於是小老鼠將車拖進牲口棚。"},{"english":"My lovely cat pulled in a basket full of fish last night.","chinese":"昨晚我那可愛的小貓拖進一隻裝滿魚的籃子。"},{"english":"The yard out of the dark skin of the elderly, will land him into the room.","chinese":"院子裏走出皮膚黝黑的老人，將他拖進土房裏。"},{"english":"Five years later, many more have been drawn into Rinngo Sheena's world.","chinese":"五年過去，更多的人被拖進了椎名林檎的世界。"}],"related":[]}