{"definition":["to bow and give way (idiom)\/to surrender sth readily"],"pinyin":["gong1 shou3 xiang1 rang4"],"simplified":["拱手相让"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"拱手相讓","characters":[{"definition":["to cup one's hands in salute\/to surround\/to arch\/to dig earth with the snout\/arched"],"pinyin":["gong3"],"word":"拱"},{"definition":["hand\/(formal) to hold\/person engaged in certain types of work\/person skilled in certain types of work\/personal(ly)\/convenient\/classifier for skill\/CL:雙|双[shuang1],隻|只[zhi1]"],"pinyin":["shou3"],"word":"手"},{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"},{"definition":["to yield\/to permit\/to let sb do sth\/to have sb do sth\/to make sb (feel sad etc)\/by (indicates the agent in a passive clause, like 被[bei4])"],"pinyin":["rang4"],"word":"讓"}],"containing_words":[],"sentences":[{"english":"Re throwing away happiness with both hands. And reaching out for something that will never make you.","chinese":"你把自己的幸福拱手相讓，去追求一些根本不會。"},{"english":"I have ceded youth, and is willing to accompany you to the old.","chinese":"我早已將青春拱手相讓，願陪你到老。"},{"english":"You're throwing away happiness with both hands.","chinese":"你把自己的幸福拱手相讓。"},{"english":"Handing her my relay position on a silver platter, that's what.","chinese":"把我的接力位置拱手相讓，就是這樣。"},{"english":"Ask yourself, my love, whether you are not very cruel to have so entrammelled me, so destoryed my freedom.","chinese":"你近乎殘忍，讓我無可自拔，將自由拱手相讓。"}],"related":[]}