{"definition":["to cup one's hands in obeisance or greeting\/(fig.) submissive"],"pinyin":["gong3 shou3"],"simplified":["拱手"],"rank":19107.0,"normalized_rank":0.267331719670365,"fraction":0.000002625699574365574,"cumulative_fraction":0.9725977922562932,"word":"拱手","characters":[{"definition":["to cup one's hands in salute\/to surround\/to arch\/to dig earth with the snout\/arched"],"pinyin":["gong3"],"word":"拱"},{"definition":["hand\/(formal) to hold\/person engaged in certain types of work\/person skilled in certain types of work\/personal(ly)\/convenient\/classifier for skill\/CL:雙|双[shuang1],隻|只[zhi1]"],"pinyin":["shou3"],"word":"手"}],"containing_words":[{"definition":["to watch from the sidelines and do nothing (idiom)"],"pinyin":["gong3 shou3 pang2 guan1"],"word":"拱手旁觀"},{"definition":["to bow and give way (idiom)\/to surrender sth readily"],"pinyin":["gong1 shou3 xiang1 rang4"],"word":"拱手相讓"}],"sentences":[{"english":"You've got to hand it to the bottled water industry.","chinese":"你一定是把錢拱手交給礦泉水業。"},{"english":"Q. I know you said that you felt Blake gave that match away.","chinese":"我知道你說你感覺是Blake拱手讓出了優勢。"},{"english":"Re throwing away happiness with both hands. And reaching out for something that will never make you.","chinese":"你把自己的幸福拱手相讓，去追求一些根本不會。"},{"english":"Soon thereafter, they relinquished the town to the Soviets.","chinese":"從那以後不久，他們把這錯城鎮拱手讓給了蘇維埃。"},{"english":"It does not clasp its hands and pray to Jupiter.","chinese":"它並不拱手向朱庇特大神祈禱。"},{"english":"Qin Dynasty of\"moxa Xiao sleet is an arc hand, way, \" big Xia's returning is actually a merchant to forget more matter.","chinese":"艾曉雪一拱手，道，“秦朝大俠還真是貴人多忘事啊。"},{"english":"You don't want to give away any more of your future 4） profits than you have to.","chinese":"除非萬不得已，你不會想把更多未來的利潤拱手讓人。"},{"english":"I have ceded youth, and is willing to accompany you to the old.","chinese":"我早已將青春拱手相讓，願陪你到老。"},{"english":"Old Red-Nosed Gong lifted the bowl of yellow wine in his hand.","chinese":"紅鼻子老拱手裏擎了一碗黃酒。"},{"english":"According to this scale, chinese shift is equivalent to letting money submissively to Tecent.","chinese":"按照這個比例，中國移動相當於把錢拱手讓給騰訊。"},{"english":"Eight years ago, it was shut down in a tacit admission that the US was ceding the market to China.","chinese":"八年前，美國祕而不宣地將市場拱手讓給中國。"},{"english":"You're throwing away happiness with both hands.","chinese":"你把自己的幸福拱手相讓。"},{"english":"Why take the opportunity to hand over the left to put out the lights to others?","chinese":"幹嘛要把滅燈的機會拱手留給別人呢？"},{"english":"Handing her my relay position on a silver platter, that's what.","chinese":"把我的接力位置拱手相讓，就是這樣。"},{"english":"Ask yourself, my love, whether you are not very cruel to have so entrammelled me, so destoryed my freedom.","chinese":"你近乎殘忍，讓我無可自拔，將自由拱手相讓。"}],"related":[{"definition":["to cup one fist in the other hand (as a sign of respect)"],"pinyin":["bao4 quan2"],"word":"抱拳"},{"definition":["to salute\/to greet"],"pinyin":["shi1 li3"],"word":"施禮"},{"definition":["to bow"],"pinyin":["gong1 shen1"],"word":"躬身"},{"definition":["to return a politeness\/to present a gift in return"],"pinyin":["huan2 li3"],"word":"還禮"},{"definition":["to salute\/to make one's salutations"],"pinyin":["xing2 li3"],"word":"行禮"},{"definition":["to bow deeply, starting upright with arms straight out in front, one hand cupped in the other, then moving the hands down to one's knees as one bows, keeping the arms straight (a form of greeting)"],"pinyin":["chang2 yi1"],"word":"長揖"},{"definition":["to half rise out of one's chair (a polite gesture)"],"pinyin":["qian4 shen1"],"word":"欠身"},{"definition":["to greet by raising clasped hands"],"pinyin":["yi1"],"word":"揖"},{"definition":["to return a greeting\/to send a gift in return"],"pinyin":["hui2 li3"],"word":"回禮"},{"definition":["to bow with hands held in front"],"pinyin":["zuo4 yi1"],"word":"作揖"},{"definition":["to speak seriously\/to exaggerate"],"pinyin":["yan2 zhong4"],"word":"言重"},{"definition":["to say goodbye\/to take one's leave"],"pinyin":["gao4 ci2"],"word":"告辭"},{"definition":["to petition for retirement (old)\/to ask for leave to withdraw\/to ask to be excused"],"pinyin":["gao4 tui4"],"word":"告退"},{"definition":["to cup one's hands in salute\/to surround\/to arch\/to dig earth with the snout\/arched"],"pinyin":["gong3"],"word":"拱"},{"definition":["(polite) thank you for your trouble (used when asking a favor or after having received one)"],"pinyin":["you3 lao2"],"word":"有勞"},{"definition":["old-fashioned women's obeisance\/Taiwan pr. [lian4 ren4]"],"pinyin":["lian3 ren4"],"word":"斂衽"}]}