{"definition":["competitive product\/superior goods\/with real punch"],"pinyin":["quan2 tou5 chan3 pin3"],"simplified":["拳头产品"],"rank":28829.0,"normalized_rank":0.4033551131196396,"fraction":0.0000010449078530777106,"cumulative_fraction":0.9890809127787096,"word":"拳頭產品","characters":[{"definition":["fist\/boxing"],"pinyin":["quan2"],"word":"拳"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"},{"definition":["to give birth\/to reproduce\/to produce\/product\/resource\/estate\/property"],"pinyin":["chan3"],"word":"產"},{"definition":["article\/commodity\/product\/goods\/kind\/grade\/rank\/character\/disposition\/nature\/temperament\/variety\/to taste sth\/to sample\/to criticize\/to comment\/to judge\/to size up\/fret (on a guitar or lute)"],"pinyin":["pin3"],"word":"品"}],"containing_words":[],"sentences":[{"english":"The competitive products of our company are quality air conditioners.","chinese":"我們公司的拳頭產品是高品質的空調。"},{"english":"This product is also my fist Products unit.","chinese":"此產品也是我單位的拳頭產品。"},{"english":"Typical report has long been the most competitive product in TV propagandistic news.","chinese":"典型報道一直以來都是電視新聞宣傳的拳頭產品。"},{"english":"This is the knock-out product of our factory.","chinese":"這是我們廠的拳頭產品。"},{"english":"Jades Xiu carving products are the port exports of Dalian as the fist products.","chinese":"岫巖玉雕產品是大連口岸對外出口拳頭產品之一。"},{"english":"The current demand for our major product is very high.","chinese":"目前，我們拳頭產品的市場需求非常大。"},{"english":"Pfizer's blockbuster Viagra will face competition from generics starting next year.","chinese":"輝瑞的拳頭產品偉哥在下一年會面臨非專利藥的競爭。"},{"english":"Chopsticks are disposable sanitary products factory fist products.","chinese":"一次性衛生竹筷系列產品是本廠拳頭產品之一。"}],"related":[]}