{"definition":["to arrest\/to capture\/to seize\/to win (a set, a game etc)"],"pinyin":["na2 xia4"],"simplified":["拿下"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"拿下","characters":[{"definition":["to hold\/to seize\/to catch\/to apprehend\/to take\/(used in the same way as 把[ba3]: to mark the following noun as a direct object)"],"pinyin":["na2"],"word":"拿"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[{"english":"Unscrew the burnt ones and replace them with the good ones.","chinese":"拿下那些燒壞了的，再換上好的。"},{"english":"'There's a real small chance but it's still a must-win game.","chinese":"可能性確實不大，但是我們必須拿下。"},{"english":"Bynum had 18 points and 13 rebounds for Los Angeles.","chinese":"拜納姆拿下了18分13個籃板。"},{"english":"That the 32 points Kobe Bryant hung on them three days earlier would have been convincing enough.","chinese":"三天前拿下32分的科比已經令人心悅誠服了。"},{"english":"He was confident on their own can also win city huoshan, then ordered the attack.","chinese":"他自信靠自己的力量也能拿下霍山城，於是命令進攻。"},{"english":"Irrefutable evidence, we had the last one day every stronghold.","chinese":"鐵證如山，我方一舉拿下最後一個日僞據點。"},{"english":"Radmanovic added eight points in the third, including two 3-pointers.","chinese":"拉德馬諾維奇在第三節拿下8分，其中有兩個3分球。"},{"english":"Corey Maggette scored 23 points and Tim Thomas had 20 for the Clippers.","chinese":"馬蓋蒂，托馬斯爲快船分別拿下了23及20分。"},{"english":"Faulcon jumped up and took a pencil stub down from his shelf .","chinese":"富爾康跳了起來，從他那架子上拿下了一個鉛筆頭兒。"},{"english":"After serving out the first set, Li broke in the opening game of the second set.","chinese":"拿下第一盤之後，李娜在第二盤破發對手一個發球局。"},{"english":"Odom also had 11rebounds for his fifth consecutive double-double.","chinese":"奧多姆拿下11個籃板，連續第五個兩雙。"},{"english":"The least we can do now is win against Mainz on Saturday.","chinese":"現在我們可以做的就是本週六拿下美因茨隊。"},{"english":"He took down a dictionary from the top shelf.","chinese":"他從書架頂格拿下了一本詞典。"},{"english":"What was sweeter: winning your first title or beating Liverpool in the cup final?","chinese":"拿下第一個聯賽冠軍和刷馬桶哪個更爽一點？"},{"english":"He took down a heavy brown volume from his shelves.","chinese":"他從書架上拿下一本很厚的棕色書皮的書。"},{"english":"I could see them winning 57, 58 (games).","chinese":"我認爲他們可以拿下57勝或者58勝。"}],"related":[{"definition":["person\/number of people\/(per) capita\/(a person's) head\/(Tw) person whose identity is used by sb else (e.g. to create a bogus account)"],"pinyin":["ren2 tou2"],"word":"人頭"},{"definition":["to defeat\/to beat"],"pinyin":["ji1 bai4"],"word":"擊敗"},{"definition":["victory\/CL:個|个[ge4]"],"pinyin":["sheng4 li4"],"word":"勝利"},{"definition":["to take (after a struggle)\/to wrest\/to seize\/to capture\/to win (a trophy)"],"pinyin":["duo2 de2"],"word":"奪得"},{"definition":["highland\/upland"],"pinyin":["gao1 di4"],"word":"高地"},{"definition":["to pull back\/to regain (one's dignity etc)\/to recover from (an adverse situation)\/to turn the tables"],"pinyin":["ban1 hui2"],"word":"扳回"},{"definition":["to make a comeback\/(of a doctor's assessment of the gender of a fetus) to turn out to be wrong"],"pinyin":["fan1 pan2"],"word":"翻盤"},{"definition":["to prevail\/to achieve victory\/to be victorious"],"pinyin":["qu3 de2 sheng4 li4"],"word":"取得勝利"},{"definition":["a move\/an action\/in one move\/at a stroke\/in one go"],"pinyin":["yi1 ju3"],"word":"一舉"},{"definition":["to rely on\/to depend on\/by means of\/thanks to\/sth that one relies on"],"pinyin":["ping2 jie4"],"word":"憑借"},{"definition":["match point (tennis etc)"],"pinyin":["sai4 dian3"],"word":"賽點"},{"definition":["victorious\/to win\/to triumph"],"pinyin":["huo4 sheng4"],"word":"獲勝"},{"definition":["midway\/mediocre (quality)\/midfield (soccer)"],"pinyin":["zhong1 lu4"],"word":"中路"},{"definition":["opening (chess etc)\/early stage of game, match, work, activity etc"],"pinyin":["kai1 ju2"],"word":"開局"},{"definition":["lit. no blood on the men's swords (idiom); fig. an effortless victory"],"pinyin":["bing1 bu4 xue4 ren4"],"word":"兵不血刃"},{"definition":["to prevail over\/to defeat\/to surmount"],"pinyin":["zhan4 sheng4"],"word":"戰勝"}]}