{"definition":["indicator"],"pinyin":["zhi3 shi4 ji4"],"simplified":["指示剂"],"rank":62952.0,"normalized_rank":0.8807801547437494,"fraction":2.4962174193390398e-8,"cumulative_fraction":0.9999120219118957,"word":"指示劑","characters":[{"definition":["finger\/to point at or to\/to indicate or refer to\/to depend on\/to count on\/(of hair) to stand on end"],"pinyin":["zhi3"],"word":"指"},{"definition":["to show\/to reveal"],"pinyin":["shi4"],"word":"示"},{"definition":["dose (medicine)"],"pinyin":["ji4"],"word":"劑"}],"containing_words":[],"sentences":[{"english":"The analysis results of the method were compared with those of indicator method.","chinese":"對該方法與指示劑法分析結果進行了比較。"},{"english":"Bromoc-resol Green and Phenolphthalein-Thymolphthalein were selected as indicators.","chinese":"選擇溴甲酚綠和酚酞一百里酚酞爲指示劑。"},{"english":"Presently, Peroxidase is employed as indicator for blanching treatments of vegetables.","chinese":"目前蔬菜的熱燙終點以過氧化物酶作爲指示劑來確定。"},{"english":"The acidic concentration of the catalyst was titrated by butylamine with the method of adsorption of coloured indicator.","chinese":"用吸附指示劑正丁胺滴定法測定了催化劑的酸量。"},{"english":"Indicators are indispensable for doing chemical experiments.","chinese":"做化學實驗時，指示劑是必不可少的。"},{"english":"The fuzzy character of colour of the acid base indicator alizarin yellow R is studied in the paper.","chinese":"研究了酸鹼指示劑茜素黃R顏色的模糊特性。"},{"english":"Sterilization of healthcare products chemical indicators.","chinese":"滅菌用化學指示劑。"},{"english":"Of course, there are dangers in using nighttime lights as an indicator for economic growth.","chinese":"當然，用夜間光源作爲經濟增長的指示劑也有危險。"},{"english":"Chemical or biological indicators may also be used, but should not take the place of physical measurements.","chinese":"化學或微生物指示劑可以使用，但不能代替物理檢測。"},{"english":"Synthesis of Phthalein Indicators under Microwave Irradiation.","chinese":"微波作用下酞類指示劑的快速合成。"},{"english":"Amaranth red pigment has security and practical value.","chinese":"莧菜紅指示劑具有安全性和實用價值。"},{"english":"Phenolphthalein or indicator of such a kind is used as colour indicator.","chinese":"本發明還可加入酚酞或酚酞類酸鹼指示劑作顯色指示。"},{"english":"Choosing titration indicator is based on jump range of titration ourve.","chinese":"滴定突躍範圍是滴定反應中選擇指示劑的依據。"},{"english":"Replace the acidity of orange indicator of instructions to the end.","chinese":"基橙指示劑取代酸度計來指示終點。"}],"related":[]}