{"definition":["knuckle"],"pinyin":["zhi3 guan1 jie2"],"simplified":["指关节"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"指關節","characters":[{"definition":["finger\/to point at or to\/to indicate or refer to\/to depend on\/to count on\/(of hair) to stand on end"],"pinyin":["zhi3"],"word":"指"},{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["Guan1","guan1"],"word":"關"},{"definition":["festival\/holiday\/node\/joint\/section\/segment\/part\/to economize\/to save\/to abridge\/moral integrity\/classifier for segments, e.g. lessons, train wagons, biblical verses\/CL:個|个[ge4]","see 節骨眼|节骨眼[jie1 gu5 yan3]"],"pinyin":["jie1","jie2"],"word":"節"}],"containing_words":[],"sentences":[{"english":"Use your knuckles to briskly rub the Hoku point for thirty seconds.","chinese":"用你的指關節要輕快揉合谷穴30秒的點。"},{"english":"My knuckles whitened from my tense grip on the steering wheel.","chinese":"我的指關節從我在方向盤的緊張的夾子漂白了。"},{"english":"Vascularized joint transfer has been used for the reconstruction of traumatized finger joints.","chinese":"帶血管莖關節轉移術，可作爲指關節損傷之重建。"},{"english":"He tried to steal sugar under his aunt's very nose, and got his knuckles rapped for it.","chinese":"他當着姨媽的面偷糖喫，結果被她用指關節敲了一頓。"},{"english":"Traumatic dislocation of the metacarpophalangeal joint is a relatively uncommon injury.","chinese":"外傷性脫位的掌指關節是一種相對少見的損傷。"},{"english":"When I amfinished she sits with her head bowed, twisting her arthritic fingers intostrange shapes.","chinese":"當我解釋完，她低着頭坐着，不停地扭動着手指關節。"},{"english":"Looping a letter the wrongway resulted in a swift clip across the knuckles with a ruler.","chinese":"只要一寫錯，老師就用戒尺打指關節。"},{"english":"I bandage his knuckles, which is hard with these claws I have.","chinese":"我用繃帶包紮他被我爪子弄傷的指關節。"},{"english":"He knuckled me in the chest .","chinese":"他用指關節敲擊我的胸部。"},{"english":"I hit him with my fist and hurt my knuckles.","chinese":"我用拳頭打他，我的指關節打痛了。"},{"english":"Like Joey's constant knuckle-cracking isn't annoying?","chinese":"像喬伊，常扳指關節就不惹人厭嗎？"},{"english":"But she uses her knuckles to text on a mobile phone.","chinese":"不過，她發短信用的是指關節。"},{"english":"Skill levels are from very easy to real knuckle busters .","chinese":"技能水準是從非常容易對真正的指關節釘頭切斷機。"},{"english":"Now,the knucklebone theory of personal identity is a very stupid theory.","chinese":"這個指關節骨的個人認同感理論是愚蠢的。"},{"english":"You must knock on doors until your knuckles bleed.","chinese":"你必須去敲一扇扇的門，直到指關節流血。"},{"english":"He cracked the joints of his fingers.","chinese":"他把手指關節弄的噼啪作響。"}],"related":[]}