{"definition":["distribution according to work"],"pinyin":["an4 lao2 fen1 pei4"],"simplified":["按劳分配"],"rank":33536.0,"normalized_rank":0.4692121500426735,"fraction":6.88722443534596e-7,"cumulative_fraction":0.9931021380290072,"word":"按勞分配","characters":[{"definition":["to press\/to push\/to leave aside or shelve\/to control\/to restrain\/to keep one's hand on\/to check or refer to\/according to\/in the light of\/(of an editor or author) to make a comment"],"pinyin":["an4"],"word":"按"},{"definition":["to toil\/labor\/laborer\/to put sb to trouble (of doing sth)\/meritorious deed\/to console (Taiwan pr. [lao4] for this sense)"],"pinyin":["lao2"],"word":"勞"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["to join\/to fit\/to mate\/to mix\/to match\/to deserve\/to make up (a prescription)\/to allocate"],"pinyin":["pei4"],"word":"配"}],"containing_words":[],"sentences":[{"english":"These men and women grew up with faith in an America wherehard work and responsibility paid off.","chinese":"這些人民是在美國按勞分配的信念下成長起來。"},{"english":"Narrowing Income Gap by Reforming Income Distribution System;","chinese":"按勞分配是收入分配的主要原則。"},{"english":"The personal income puts the principle distributing according to one's performance into practice.","chinese":"社會主義社會，個人收入實行按勞分配的原則。"},{"english":"Labor-based distribution lacks fraternity while capital-based distribution has more fancy.","chinese":"按勞分配缺乏博愛精神，差別原則多有空想成分。"},{"english":"Marxist theory on labour values has no tuner relations with means of distribution according to work.","chinese":"馬克思的勞動價值論與按勞分配沒有內在聯繫。"},{"english":"Distribution according to work is one of the principles of socialism.","chinese":"“按勞分配”是社會主義的一條重要原則。"}],"related":[]}