{"definition":["a mortgage (loanword via Cantonese)\/to buy property on a mortgage"],"pinyin":["an4 jie1"],"simplified":["按揭"],"rank":5934.0,"normalized_rank":0.08302435884879605,"fraction":0.000018845273694994853,"cumulative_fraction":0.8787603400024065,"word":"按揭","characters":[{"definition":["to press\/to push\/to leave aside or shelve\/to control\/to restrain\/to keep one's hand on\/to check or refer to\/according to\/in the light of\/(of an editor or author) to make a comment"],"pinyin":["an4"],"word":"按"},{"definition":["to take the lid off\/to expose\/to unmask"],"pinyin":["jie1"],"word":"揭"}],"containing_words":[],"sentences":[{"english":"Tell your friends and relatives about Excellent's free mortgage referral and consulting services.","chinese":"告訴你的親友們有關卓譽的免費按揭轉介及諮詢服務。"},{"english":"Or find out that you're six months behind on your mortgage payment?","chinese":"或者發現你的按揭付款已經超期六個月了？"},{"english":"Reinstatement cost of the building or mortgaged loan amount required by the Bank.","chinese":"樓宇建築之重建費或銀行指定之按揭金額。"},{"english":"Also, the developer will offer another ten percent mortgage to purchasers.","chinese":"開發商可提供一成的按揭給認購者。"},{"english":"Some homeowners are delinquent, or unable to make the payments on costly, exotic mortgages they took out during the boom.","chinese":"一些屋主拖欠債務，或者無力支付高額的按揭款。"},{"english":"When you remortgage you are ending your old mortgage deal and switching to a new one.","chinese":"當你結束你的老轉你轉按揭交易和新車。"},{"english":"They have little motivation to refinance commercial real-estate loans.","chinese":"它們沒有多少動力對商業房地產貸款進行轉按揭。"},{"english":"Finally, it discusses the validity of Louhua mortgage.","chinese":"最後，討論了樓花按揭的效力問題。"},{"english":"You would choose a remortgage because it allows you to change your mortgage without moving your home.","chinese":"你會選擇，因爲它允許你轉按揭動你改變你的家。"},{"english":"It is understood that this was the first domestic - type housing mortgage finance varieties.","chinese":"據瞭解，這是國內首個理財型住房按揭品種。"},{"english":"I make people happy all day with foreclosures.","chinese":"我成天都在取消按揭回贖權，這讓人們很高興。"},{"english":"Now I am saving thousands with my new refinanced mortgage.","chinese":"現在我與我的新轉按揭節省數千。"},{"english":"The mortgage guarantee insurance of housing has been in dispute since it was adopted in China.","chinese":"住房按揭保證保險是一項備受爭議的險種。"},{"english":"The meaning and legal characteristics of mortgage; purchasing house by means of mortgage is guaranteed by hypothec of the target house.","chinese":"按揭購房是以房屋本身設立抵押權爲保證的。"},{"english":"First , for pre - sale mortgage real estate mortgage and real estate.","chinese":"第一，對於預售商品房按揭與不動產抵押。"},{"english":"Using mortgage purchases at the highest price, it is also our wage- earners .","chinese":"用按揭在最高價買房的，也恰恰正是我們的工薪階層。"}],"related":[{"definition":["down payment"],"pinyin":["shou3 fu4"],"word":"首付"},{"definition":["down payment"],"pinyin":["shou3 fu4 kuan3"],"word":"首付款"},{"definition":["to repay a loan"],"pinyin":["huan2 dai4"],"word":"還貸"},{"definition":["home loan"],"pinyin":["fang2 dai4"],"word":"房貸"},{"definition":["a loan\/CL:筆|笔[bi3]\/to provide a loan (e.g. bank)\/to raise a loan (from e.g. a bank)"],"pinyin":["dai4 kuan3"],"word":"貸款"},{"definition":["monthly loan repayment\/mortgage payment"],"pinyin":["yue4 gong1"],"word":"月供"},{"definition":["to buy a house on a mortgage\/house mortgage"],"pinyin":["gong1 fang2"],"word":"供房"},{"definition":["to buy a house"],"pinyin":["mai3 fang2"],"word":"買房"},{"definition":["mortgage loan"],"pinyin":["di3 ya1 dai4 kuan3"],"word":"抵押貸款"},{"definition":["forward delivery apartment\/unfinished housing to be paid for in advance by the buyer and then completed within certain time frame"],"pinyin":["qi1 fang2"],"word":"期房"},{"definition":["official reserves\/accumulated fund"],"pinyin":["gong1 ji1 jin1"],"word":"公積金"},{"definition":["to pay in installments\/payment in installments"],"pinyin":["fen1 qi1 fu4 kuan3"],"word":"分期付款"},{"definition":["to transfer ownership (of a vehicle, securities etc)\/(real estate) conveyancing"],"pinyin":["guo4 hu4"],"word":"過戶"},{"definition":["suite\/apartment\/flat"],"pinyin":["tao4 fang2"],"word":"套房"},{"definition":["second-hand house\/house acquired indirectly through a middle-man"],"pinyin":["er4 shou3 fang2"],"word":"二手房"},{"definition":["title deeds\/certificate of property ownership"],"pinyin":["fang2 chan3 zheng4"],"word":"房產證"}]}