{"definition":["to provoke\/to stir up\/to incite"],"pinyin":["tiao3 qi3"],"simplified":["挑起"],"rank":12308.0,"normalized_rank":0.1722048885593161,"fraction":0.000005863629315790091,"cumulative_fraction":0.9457656572168792,"word":"挑起","characters":[{"definition":["to carry on a shoulder pole\/to choose\/to pick\/to nitpick","to raise\/to dig up\/to poke\/to prick\/to incite\/to stir up"],"pinyin":["tiao1","tiao3"],"word":"挑"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"He is one of those people who always seem intent on stirring up trouble among his workmates.","chinese":"他是個有意要在工友之間挑起糾紛的那種人。"},{"english":"Chinawill not wage an offensive war now.","chinese":"中國現在不會挑起一場進攻戰。"},{"english":"Dug activists even disrupted what was to be a placid, respectful funeral for the fallen Moe.","chinese":"達格族激進分子甚至在莫的肅穆葬禮上挑起騷亂。"},{"english":"The adulterated honey can not be chosen, or can't become silks to choose either.","chinese":"摻假蜂蜜則不能被挑起，也不能挑成絲狀。"},{"english":"The flame is just there, which only needs to be enkindled.","chinese":"火焰就在那裏，只是需要挑起。"},{"english":"They’re afraid to make waves, and therefore, they avoid changes.","chinese":"他們害怕挑起風波，所以他們避免做出改變。"},{"english":"Georgian and South Ossetian officials have accused each other of initiating the hostilities.","chinese":"格魯吉亞和南奧塞梯官員相互指責對方挑起敵對行動。"},{"english":"I made shoulder strong enough to carry the weight of the world. Yet, gentle enough to give comfort.","chinese":"我使她的肩膀能挑起整個世界的重擔，並且柔情似水。"},{"english":"I made her shoulders strong enough to carry the weight of the world; yet , gentle enough to give comfort.","chinese":"我使她的肩膀能挑起整個世界的重擔，並且柔情似水。"},{"english":"They were busy canvassing and drumming up sentiment against the new government.","chinese":"他們當時正忙於遊說，挑起對新政府的不滿情緒。"},{"english":"He shouldered the loaded carrying pole and walked off with a swing.","chinese":"他挑起擔子顫悠顫悠地走了。"},{"english":"We are really working hard to start a WWIII, don't we?….","chinese":"我們在努力挑起第三次世界大戰，是嗎？"},{"english":"provoked the situation and doubled its mistakes, causing further escalation.","chinese":"日方挑起事端，又錯上加錯，導致事態進一步升級。"},{"english":"So what exactly is it about the new ball that's provoking all the controversy?","chinese":"那麼究竟這個新的比賽用球是怎麼挑起這些爭論的呢？"},{"english":"Harry raised an eyebrow.","chinese":"哈利挑起了一條眉毛。"},{"english":"One at a time, push each pin up with the paperclip.","chinese":"用回形針將鎖裏的針腳一個一個地挑起來。"}],"related":[{"definition":["to entice\/to arouse\/to provoke"],"pinyin":["tiao3 dong4"],"word":"挑動"},{"definition":["capital of Wei 魏 during Warring states\/CL:根[gen1]"],"pinyin":["Da4 liang2"],"word":"大梁"},{"definition":["to arise again\/to make a comeback\/resurgence"],"pinyin":["zai4 qi3"],"word":"再起"},{"definition":["dispute\/controversy\/conflict"],"pinyin":["zheng1 duan1"],"word":"爭端"},{"definition":["to incite disharmony\/to instigate"],"pinyin":["tiao3 bo1"],"word":"挑撥"},{"definition":["to infuriate\/to enrage\/to exasperate"],"pinyin":["ji1 nu4"],"word":"激怒"},{"definition":["to arouse\/to evoke\/to cause\/to stir up"],"pinyin":["ji1 qi3"],"word":"激起"},{"definition":["to start a war\/to make war\/to battle against"],"pinyin":["kai1 zhan4"],"word":"開戰"},{"definition":["to get involved in\/to meddle\/interference"],"pinyin":["cha1 shou3"],"word":"插手"},{"definition":["to rise in revolt\/to raise difficult questions"],"pinyin":["fa1 nan4"],"word":"發難"},{"definition":["ambition\/wild schemes\/careerism"],"pinyin":["ye3 xin1"],"word":"野心"},{"definition":["to lift (a lid)\/to rock\/to convulse"],"pinyin":["xian1"],"word":"掀"},{"definition":["to press down\/to crush down\/to restrain (anger)\/to keep down (voice)"],"pinyin":["ya1 zhu4"],"word":"壓住"},{"definition":["internal disorder\/civil strife\/civil unrest"],"pinyin":["nei4 luan4"],"word":"內亂"},{"definition":["to settle (a dispute)\/to quieten down\/to suppress"],"pinyin":["ping2 xi1"],"word":"平息"},{"definition":["to take on (a responsibility)"],"pinyin":["jie1 xia4"],"word":"接下"}]}