{"definition":["to step forward bravely"],"pinyin":["ting3 shen1 er2 chu1"],"simplified":["挺身而出"],"rank":15878.0,"normalized_rank":0.22215382032375866,"fraction":0.000003725932948023957,"cumulative_fraction":0.9624886192721788,"word":"挺身而出","characters":[{"definition":["straight\/erect\/to stick out (a part of the body)\/to (physically) straighten up\/to support\/to withstand\/outstanding\/(coll.) quite\/very\/classifier for machine guns"],"pinyin":["ting3"],"word":"挺"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"The only people who have sought physically to stop this dumping are Somali pirates.","chinese":"唯一挺身而出阻止這種傾倒行爲的人是索馬里海盜。"},{"english":"Zhang Xun , instead of following suit , fought bravely with the rebel army.","chinese":"張巡卻挺身而出，勇敢地抗擊叛軍。"},{"english":"Had Dong Cunri not belt the cat, our troop would have suffered much more.","chinese":"如果董存瑞沒有挺身而出，我們的隊伍將損失更大。"},{"english":"Stepped forward determinedly, Mr. Johnson looked at the long road ahead of him.","chinese":"約翰遜先生望着面前漫長的道路毅然挺身而出。"},{"english":"I ask the Minister of Ethnic Affairs Pansy Wong to stand up for the ethnic communities.","chinese":"請少數民族事務部黃部長爲少數族裔利益挺身而出。"},{"english":"Mr. Johnson looked at the long road ahead of him.","chinese":"約翰遜先生望着面前漫長的道路毅然挺身而出。"},{"english":"In the thin ring desire to harm someone rises, stand up suddenly stop zishu emphasize.","chinese":"在細響欲出手加害上升時，子書突然挺身而出阻止。"},{"english":"More nations have stepped forward to maintain international peace and security.","chinese":"越來越多的國家挺身而出，維護國際和平與安全。"}],"related":[{"definition":["calamity"],"pinyin":["wei1 nan4"],"word":"危難"},{"definition":["to pull strongly against a crazy tide (idiom); fig. to try hard to save a desperate crisis"],"pinyin":["li4 wan3 kuang2 lan2"],"word":"力挽狂瀾"},{"definition":["dying (from illness)\/facing death\/on one's deathbed"],"pinyin":["lin2 wei1"],"word":"臨危"},{"definition":["urgent and important moment (idiom); critical juncture"],"pinyin":["jin3 yao4 guan1 tou2"],"word":"緊要關頭"},{"definition":["(idiom) to take on a leadership role at a time of crisis"],"pinyin":["lin2 wei1 shou4 ming4"],"word":"臨危受命"},{"definition":["to give one's life"],"pinyin":["she3 shen1"],"word":"捨身"},{"definition":["to strike back\/to beat back\/to counterattack"],"pinyin":["fan3 ji1"],"word":"反擊"},{"definition":["to dash on bravely with no thought of personal safety (idiom); undaunted by dangers\/regardless of perils"],"pinyin":["fen4 bu4 gu4 shen1"],"word":"奮不顧身"},{"definition":["to abandon self for others (idiom, from Analects); to sacrifice one's own interest for other people\/altruism"],"pinyin":["she3 ji3 wei4 ren2"],"word":"捨己為人"},{"definition":["desperate straits"],"pinyin":["jue2 jing4"],"word":"絕境"},{"definition":["to rise vigorously\/a spirited start"],"pinyin":["fen4 qi3"],"word":"奮起"},{"definition":["the critical moment\/life and death crisis"],"pinyin":["sheng1 si3 guan1 tou2"],"word":"生死關頭"},{"definition":["lit. to upend heaven and earth (idiom)\/fig. to change the course of events\/to turn things around"],"pinyin":["niu3 zhuan3 qian2 kun1"],"word":"扭轉乾坤"},{"definition":["powerful enemy"],"pinyin":["qiang2 di2"],"word":"強敵"},{"definition":["isolated and without help"],"pinyin":["gu1 li4 wu2 yuan2"],"word":"孤立無援"},{"definition":["not to be shirked without dishonor (idiom)\/incumbent\/bounden (duty)"],"pinyin":["yi4 bu4 rong2 ci2"],"word":"義不容辭"}]}