{"definition":["whaling"],"pinyin":["bu3 jing1"],"simplified":["捕鲸"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"捕鯨","characters":[{"definition":["to catch\/to seize\/to capture"],"pinyin":["bu3"],"word":"捕"},{"definition":["whale"],"pinyin":["jing1"],"word":"鯨"}],"containing_words":[{"definition":["whaler\/whale catcher"],"pinyin":["bu3 jing1 chuan2"],"word":"捕鯨船"}],"sentences":[{"english":"Yet it is only recently that we have truly turned from a whaling civilization to a whale-watching one.","chinese":"但我們真正從一種捕鯨文明轉向觀鯨文明還是在最近。"},{"english":"Since then, the Japanese have been instrumental in nearly wiping out the Western grey whale population.","chinese":"從那以後，日本人開始大肆捕鯨，西部灰鯨幾近滅亡。"},{"english":"With industrial-scale whaling, cultural claims ring hollow.","chinese":"面對工業規模的捕鯨，人文呼籲顯得蒼白無力。"},{"english":"Melville incorporated in \"Moby Dick\" an exhaustive encyclopaedia of whaling lore .","chinese":"梅爾維爾在《白鯨》中彙集了各種捕鯨知識。"},{"english":"The whaling fleet began to fill away on a northerly course.","chinese":"捕鯨船隊開始向北乘風前進。"},{"english":"Japanese whale hunters plan to capture 50 humpback whales in the Antarctic in the coming months.","chinese":"日本捕鯨者計劃下月在南極捕捉50頭駝背鯨。"},{"english":"Tuskarr mainly care about fishing, whaling and protecting their villages.","chinese":"圖斯卡人基本上只關心捕魚，捕鯨和保衛他們的村落。"},{"english":"Which only makes the cruelty of the killing that much more repulsive .","chinese":"只讓捕鯨的殘酷性更讓人厭惡。"},{"english":"Brower, the grandson, still uses a heavy brass harpoon gun stamped as having been made in a very different whaling capital, New Bedford, Mass.","chinese":"這位孫子布羅爾先生還在用一根笨重的銅製捕鯨炮。"},{"english":"We are strenuously opposed to whaling and strenuously opposed to violence at sea.","chinese":"我們竭力反對捕鯨，反對海上暴力事件。"},{"english":"Populations of large baleen whales now store only 15 percent of the carbon they had before whaling.","chinese":"大長鬚鯨種羣現在所儲存的碳只有捕鯨前的15%。"},{"english":"In another series, activists go up against whaling ships.","chinese":"另一系列中，積極人士對抗捕鯨船。"},{"english":"The Pequod was a fairly small whaling ship the was sailing the next day.","chinese":"佩廓德號是一條相當小的捕鯨船，次日就要出海了。"},{"english":"They will try to interfere with or disable the Japanese whalers.","chinese":"他們將試圖干擾日籍捕鯨船的行動或令其無功而返。"},{"english":"The Antarctic, however, is a different kettle offish.","chinese":"但在南極地區捕鯨卻是另外一回事。"},{"english":"Is this particularly ferocious aspect of the anti-whale campaign justified?","chinese":"反捕鯨運動尤其猛烈的一方面是合理的嗎？"}],"related":[]}