{"definition":["to hate to do sth\/to hate to part with\/to begrudge"],"pinyin":["she3 bu5 de5"],"simplified":["舍不得"],"rank":10446.0,"normalized_rank":0.14615309277629315,"fraction":0.000007710684228474119,"cumulative_fraction":0.9332602433866009,"word":"捨不得","characters":[{"definition":["to give up\/to abandon\/to give alms"],"pinyin":["she3"],"word":"捨"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[{"definition":["one who is not prepared to risk his child will never catch the wolf (proverb)\/(fig.) one who is unwilling to take risks will not achieve great things"],"pinyin":["she3 bu4 de5 hai2 zi5 tao4 bu4 zhu4 lang2"],"word":"捨不得孩子套不住狼"}],"sentences":[{"english":"If the teacher is a lamp, I'm reluctant to burning wick.","chinese":"如果老師是一盞燈，我就是捨不得燃燒的燈芯。"},{"english":"Memory is the hour of clothes, though no longer lares and useful.","chinese":"回憶是小時後的衣服，捨不得丟棄，雖已不再有用。"},{"english":"I know you couldn’t hurt a fly.","chinese":"我知道你連只蒼蠅都捨不得殺。"},{"english":"He still lingered about after everyone else had left the exhibition room.","chinese":"別人都已經離開展覽室了，而他仍捨不得離去。"},{"english":"I know you couldn't hurt a fly.","chinese":"我知道你連只蒼蠅都捨不得殺。"},{"english":"Misers put their back and their belly into their pockets.","chinese":"守財奴寧可打赤膊餓肚皮，也捨不得掏腰包。"},{"english":"For protecting a son, the Wei is graceful beautiful only bear with, even the intravenous drops all loathe to give up a dozen.","chinese":"爲了保兒子，韋雅麗只有忍受，連點滴都捨不得打。"},{"english":"I have not hid in the bottom of my heart, that is I a person's death.","chinese":"涐把捨不得都藏在心底，那是涐一個人旳天荒地老。"},{"english":"The reluctance to go home was not confined to wayward men.","chinese":"捨不得回家的並不限於任性的男客。"},{"english":"He often reluctant to spend more won't do extravagance.","chinese":"他往往捨不得花更不會做奢侈浪費的事。"},{"english":"She will grudge a penny even to the poor beggar.","chinese":"她連給最窮的乞丐一個便士都捨不得。"},{"english":"I also want to move on, but i cannt.","chinese":"我很想不等你了，我卻捨不得走。"},{"english":"The mean man grudged the food his horse ate.","chinese":"那個吝嗇鬼捨不得餵馬。"},{"english":"Mother doesn't like to waste money and always eats her son's leftovers.","chinese":"媽媽捨不得浪費，總是自己喫掉兒子餘剩的飯。"},{"english":"Snow promised to help, but four sisters to let the child suffer.","chinese":"白雪答應幫忙，但四妹卻捨不得讓孩子受苦。"},{"english":"Many of them remind me of my childhood. I feel myself unable to throw them away.","chinese":"好多東西都讓我回想起我的童年，我捨不得扔它們。"}],"related":[{"definition":["to be willing to part with sth"],"pinyin":["she3 de5"],"word":"捨得"},{"definition":["reluctant to part with (sth or sb)\/unwilling to let go of"],"pinyin":["bu4 she3"],"word":"不捨"},{"definition":["there is nothing to be done\/one can't do anything about it"],"pinyin":["mei2 ban4 fa3"],"word":"沒辦法"},{"definition":["to grieve\/to be broken-hearted\/to feel deeply hurt"],"pinyin":["shang1 xin1"],"word":"傷心"},{"definition":["at once\/immediately"],"pinyin":["gan3 kuai4"],"word":"趕快"},{"definition":["to depart\/to leave"],"pinyin":["li2 kai1"],"word":"離開"},{"definition":["home"],"pinyin":["jia1 li3"],"word":"家裡"},{"definition":["to separate\/to part"],"pinyin":["fen1 kai1"],"word":"分開"},{"definition":["reluctant to leave\/to hate to have to go\/to recall fondly"],"pinyin":["liu2 lian4"],"word":"留戀"},{"definition":["treasured object\/treasure\/darling\/baby\/cowry\/good-for-nothing or queer character"],"pinyin":["bao3 bei4"],"word":"寶貝"},{"definition":["to renounce\/to abandon\/to give up"],"pinyin":["fang4 qi4"],"word":"放棄"},{"definition":["firm\/decisive"],"pinyin":["guo3 duan4"],"word":"果斷"},{"definition":["at once\/immediately\/promptly\/swiftly"],"pinyin":["li4 ma3"],"word":"立馬"},{"definition":["would rather\/better"],"pinyin":["ning4 yuan4"],"word":"寧願"},{"definition":["guilty conscience\/to feel a twinge of guilt"],"pinyin":["nei4 jiu4"],"word":"內疚"},{"definition":["mama\/mommy\/mother\/CL:個|个[ge4],位[wei4]"],"pinyin":["ma1 ma5"],"word":"媽媽"}]}