{"definition":["a whirlwind"],"pinyin":["juan3 yang2"],"simplified":["卷扬"],"rank":63117.0,"normalized_rank":0.8830887188168959,"fraction":2.4086308432218808e-8,"cumulative_fraction":0.9999160707473556,"word":"捲揚","characters":[{"definition":["to roll (up)\/to sweep up\/to carry on\/roll"],"pinyin":["juan3"],"word":"捲"},{"definition":["abbr. for 揚州|扬州[Yang2 zhou1]\/surname Yang","to raise\/to hoist\/the action of tossing or winnowing\/scattering (in the wind)\/to flutter\/to propagate"],"pinyin":["Yang2","yang2"],"word":"揚"}],"containing_words":[{"definition":["a capstan"],"pinyin":["juan3 yang2 ji1"],"word":"捲揚機"}],"sentences":[{"english":"The hoisting machine can work normally, the brake should be reliable.","chinese":"提升捲揚機應能正常工作，制動器應工作可靠。"},{"english":"Please read the operation instructions of hoisting machine.","chinese":"敬請用戶認真閱讀捲揚機使用說明書。"},{"english":"Test the lift hoist reducer and pour the oil according to the demands.","chinese":"檢查提升捲揚機減速器，按照要求加註規定油麪高度。"},{"english":"Small equipment like the winch shall be placed as is required by the project planning.","chinese":"捲揚機等小型機械，根據工程的需要規劃擺放位置。"},{"english":"Test if the hoisting machine is normal or not.","chinese":"檢查捲揚機工作是否正常。"},{"english":"After being used, there should be the special staff to maintain it.","chinese":"捲揚機投入使用後，應設專人負責維修保養。"},{"english":"After the installment of the hoisting machine and being tested to be qualified, the hoisting machine can be put into use.","chinese":"捲揚機安裝完畢，經過試車驗收合格，才準投入使用。"},{"english":"A rescue worker was winched into the middle of the building to look for any survivors.","chinese":"一名救援人員通過捲揚機進入樓層中部尋找倖存者。"},{"english":"Has the electric hoist and hoist's major function.","chinese":"具有電動葫蘆和捲揚機的主要功能。"},{"english":"When choose the installing position, the place should be convenient for the driver to watch.","chinese":"選擇捲揚機安裝位置時，保持司機有良好視線。"},{"english":"The winch used inside the mine was took out for displaying.","chinese":"自坑內取出之捲揚機，固定於水泥制展示臺上。"},{"english":"So the main blast furnace blast furnace iron making winch is one of the important links.","chinese":"因此高爐主捲揚是高爐鍊鐵的重要環節之一。"}],"related":[]}