{"definition":["Saul (name)\/biblical king around 1000 BC"],"pinyin":["Sao3 luo2"],"simplified":["扫罗"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"掃羅","characters":[{"definition":["broom","to sweep"],"pinyin":["sao3","sao4"],"word":"掃"},{"definition":["gauze\/to collect\/to gather\/to catch\/to sift","surname Luo"],"pinyin":["Luo2","luo2"],"word":"羅"}],"containing_words":[],"sentences":[{"english":"As for Saul, he made havock of the church, entering into every house, and haling men and women committed them to prison.","chinese":"掃羅卻殘害教會，進各人的家，拉着男女下在監裏。"},{"english":"'\" Then David crept up unnoticed and cut off a corner of Saul's robe.","chinese":"大衛就起來，悄悄地割下掃羅外袍的衣襟。"},{"english":"And it was told Saul, saying, Behold, David is at Naioth in Ramah.","chinese":"有人告訴掃羅，說大衛在拉瑪的拿約。"},{"english":"Samuel was asked by God to anoint Saul and later David as Kings of Israel.","chinese":"神吩咐撒母耳膏掃羅和大衛爲以色列的王。"},{"english":"Now the Spirit of the LORD had departed from Saul, and an evil spirit from the LORD tormented him.","chinese":"耶和華的靈離開掃羅，有惡魔從耶和華那裏來擾亂他。"},{"english":"What is your opinion about David who gave up the chances to kill Saul?","chinese":"大衛有機會殺害掃羅卻不忍下手，你對此有何看法？"},{"english":"And Saul perceived that it was Samuel, and he stooped with his face to the ground, and bowed himself.","chinese":"掃羅知道是撒母耳，就屈身，臉伏於地下拜。"},{"english":"Meanwhile, the witnesses laid their clothes at the feet of a young man named Saul.","chinese":"作見證的人，把衣裳放在一個少年人名叫掃羅的腳前。"},{"english":"He was prophesying in his house, while David was playing the harp, as he usually did. Saul had a spear in his hand","chinese":"大衛照常彈琴，掃羅手裏拿着槍。"},{"english":"Wherefore they say, Is Saul also among the prophets?","chinese":"因此有句俗語說，掃羅也列在先知中嗎。"},{"english":"Saul had his spear in his hand.","chinese":"大衛照常彈琴，掃羅手裏拿著槍。"},{"english":"First with Jonathan, and now with Michal, Saul starts to lose his own family members.","chinese":"先是約拿單然後是米甲，掃羅開始失去他親人的信任。"},{"english":"Then David crept up unnoticed and cut off a corner of Saul's robe.","chinese":"大衛就起來，悄悄地割下掃羅外袍的衣襟。"},{"english":"Saul had no heart towards God.","chinese":"掃羅不專心事奉神。"},{"english":"When Saul heard this, he went into the Desert of Maon in pursuit of David.","chinese":"掃羅聽見，便在瑪雲的曠野追趕大衛。"},{"english":"He came to the sheep pens along the way; a cave was there, and Saul went in to relieve himself.","chinese":"到了路旁的羊圈，在那裏有洞，掃羅進去大解。"}],"related":[]}