{"definition":["to turn around"],"pinyin":["diao4 zhuan3"],"simplified":["掉转"],"rank":32309.0,"normalized_rank":0.4520448281169113,"fraction":7.679882949206251e-7,"cumulative_fraction":0.9922095976814528,"word":"掉轉","characters":[{"definition":["to fall\/to drop\/to lag behind\/to lose\/to go missing\/to reduce\/fall (in prices)\/to lose (value, weight etc)\/to wag\/to swing\/to turn\/to change\/to exchange\/to swap\/to show off\/to shed (hair)\/(used after certain verbs to express completion, fulfillment, removal etc)"],"pinyin":["diao4"],"word":"掉"},{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"}],"containing_words":[],"sentences":[{"english":"The soldier turned his horse quickly and plunged into the river.","chinese":"士兵迅速掉轉馬頭，跳進河裏。"},{"english":"They turn the plane around to try again.","chinese":"他們將飛機掉轉方向重新試着着陸。"},{"english":"The dog saw it and run to his master as soon as it could.","chinese":"他的狗見了，急忙掉轉頭，追着主人狂奔。"},{"english":"The car turned round and went back again.","chinese":"小汽車掉轉頭又回去了。"},{"english":"Fred swung the wheel around to avoid hitting him.","chinese":"弗雷德掉轉方向盤避免撞到他。"},{"english":"Savoring the silence, we turned our horses around and they fell into a gallop.","chinese":"此時一片寂靜，我們掉轉馬頭，馬兒開始飛奔起來。"},{"english":"He changed his horse when he saw the ugly girl.","chinese":"他看見那個醜姑娘就掉轉馬頭。"},{"english":"This two brotherses drop to turn round and see his now and found out what things.","chinese":"這兩兄弟掉轉身來，看他現在又找到了什麼東西。"},{"english":"How did they turn around?","chinese":"他們是如何掉轉方向的？"},{"english":"I would be whipping my head around to look at him.","chinese":"我也會掉轉我的頭左右去看他。"},{"english":"It is out of pity that you do not turn away your eyes.","chinese":"你不肯掉轉頭去不看我，那是出於憐憫。"},{"english":"The boat came close to the rocks and then sheered away.","chinese":"船靠近岩石時突然掉轉航向。"},{"english":"It turned and began following us.","chinese":"它掉轉頭，開始跟着我們。"},{"english":"Suddenly he halted, turned around and ran back to the woman.","chinese":"突然他停了下來，他掉轉頭奔向女人。"},{"english":"We turned the car round and steered for home.","chinese":"我們掉轉車頭，朝家駛去。"},{"english":"She turned the nozzle and the spray concentrated down to a stream.","chinese":"她掉轉噴嘴，讓水花集中噴入小河。"}],"related":[]}