{"definition":["to reject\/to exclude\/to eliminate\/to remove\/to repel"],"pinyin":["pai2 chi4"],"simplified":["排斥"],"rank":9725.0,"normalized_rank":0.1360653673415136,"fraction":0.000008633846740748979,"cumulative_fraction":0.9273765001055612,"word":"排斥","characters":[{"definition":["a row\/a line\/to set in order\/to arrange\/to line up\/to eliminate\/to drain\/to push open\/platoon\/raft\/classifier for lines, rows etc"],"pinyin":["pai2"],"word":"排"},{"definition":["to blame\/to reprove\/to reprimand\/to expel\/to oust\/to reconnoiter\/(of territory) to expand\/saline marsh"],"pinyin":["chi4"],"word":"斥"}],"containing_words":[],"sentences":[{"english":"It is, essentially, a rejection of Hellenic intellectualism by the sentimentalism of the North.","chinese":"它在本質上是北方的重情主義對希臘尚知主義的排斥。"},{"english":"Minor Circle is the circle formed by the innermost surface of the spline.","chinese":"小圓是花鍵的最小齒形面的排斥圓。"},{"english":"I have been an outcast my entire life.","chinese":"我的一生都是在受人排斥的。"},{"english":"Objective To explore the mechanism of immuno- rejection for the swine allogenic chondrocytes in transplantation.","chinese":"目的探討豬軟骨細胞同種異體移植的免疫排斥機制。"},{"english":"Desensitized patients are at high risk of developing acute antibody-mediated rejection.","chinese":"致敏患者有發生急性抗體介導的排斥反應的高度危險。"},{"english":"You should consider settings and options to be mutually exclusive .","chinese":"你應該考慮設置和選項的相互排斥性。"},{"english":"Which country if have to repels this kind of progress, indicate that they are abnormal.","chinese":"如果有哪個國家排斥這種進步，就表明他們不正常。"},{"english":"Now, you might find this sort of project in the end to be repellant.","chinese":"現在，你可以發現這類目標最後是被排斥的。"},{"english":"She's rejected in class because of he clumsiness.","chinese":"她因爲行動笨拙而被班上同學排斥。"},{"english":"You reject positive experiences by insisting they don’t count.","chinese":"你拒不接受積極的體驗，堅持把他們排斥在外。"},{"english":"And at a distance of 2 r naught, I have a positive repulsive term.","chinese":"在這2r圈的距離上，這裏有一個不可忽略的排斥場。"},{"english":"In proportion therefore, as the repulsiveness of the work increases, the wage decreases.","chinese":"因此，當勞動的排斥增加，工資就減少。"},{"english":"Certainly the phenomenon of sexuality-in-flux is by no means exclusive to women.","chinese":"當然性傾向在同量的情況下絕非排斥女性。"},{"english":"The void is always elusive, having no opposite, there is nothing which excludes or opposes.","chinese":"虛無包含一切，無所不容，不存在對立與排斥。"},{"english":"School remains a place where intellect is mistrusted.","chinese":"學校仍在排斥對智力的培養。"},{"english":"Ostracized by the community for immoral activities.","chinese":"因爲道德敗壞的行爲被社會所排斥。"}],"related":[{"definition":["to conflict\/to contradict"],"pinyin":["di3 chu4"],"word":"抵觸"},{"definition":["to resist\/to defy\/to oppose"],"pinyin":["kang4 ju4"],"word":"抗拒"},{"definition":["to be disgusted with\/to dislike\/bad reaction\/antipathy"],"pinyin":["fan3 gan3"],"word":"反感"},{"definition":["to crowd out\/to push aside\/to supplant"],"pinyin":["pai2 ji3"],"word":"排擠"},{"definition":["to discriminate against\/discrimination"],"pinyin":["qi2 shi4"],"word":"歧視"},{"definition":["to loathe\/to hate\/disgusted with sth"],"pinyin":["yan4 wu4"],"word":"厭惡"},{"definition":["hostile\/malevolence\/antagonism\/to view as enemy\/to stand against"],"pinyin":["di2 shi4"],"word":"敵視"},{"definition":["prejudice"],"pinyin":["pian1 jian4"],"word":"偏見"},{"definition":["external\/foreign\/outside"],"pinyin":["wai4 lai2"],"word":"外來"},{"definition":["to approve of\/to endorse\/to acknowledge\/to recognize\/to identify oneself with"],"pinyin":["ren4 tong2"],"word":"認同"},{"definition":["to view sb as an enemy\/to be hateful towards"],"pinyin":["chou2 shi4"],"word":"仇視"},{"definition":["assimilation (cultural, digestive, phonemic etc)"],"pinyin":["tong2 hua4"],"word":"同化"},{"definition":["to admit (to membership)"],"pinyin":["jie1 na4"],"word":"接納"},{"definition":["to fight against\/to oppose\/to be opposed to\/opposition"],"pinyin":["fan3 dui4"],"word":"反對"},{"definition":["to look down upon\/to despise"],"pinyin":["kan4 bu5 qi3"],"word":"看不起"},{"definition":["to be afraid"],"pinyin":["ju4 pa4"],"word":"懼怕"}]}