{"definition":["to mediate\/to reconcile\/to make peace\/to intervene"],"pinyin":["pai2 jie3"],"simplified":["排解"],"rank":26528.0,"normalized_rank":0.3711611377723056,"fraction":0.000001289128422817723,"cumulative_fraction":0.9864033667685432,"word":"排解","characters":[{"definition":["a row\/a line\/to set in order\/to arrange\/to line up\/to eliminate\/to drain\/to push open\/platoon\/raft\/classifier for lines, rows etc"],"pinyin":["pai2"],"word":"排"},{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","surname Xie","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","to transport under guard"],"pinyin":["Xie4","jie3","jie4","xie4"],"word":"解"}],"containing_words":[],"sentences":[{"english":"There are many ways to dispel your pent-up fury besides drinking!","chinese":"排解自己積憤的方法有很多種，不一定要喝酒呀。"},{"english":"Don’t tell me that you have the habit of punching the wall to vent your frustration.","chinese":"你不會告訴我你只會打牆來排解你心中的挫敗感吧？"},{"english":"Who can not troubleshoot for him his father had a favorite child's thoughts.","chinese":"沒有誰能排解得了一個父親對他最愛的孩子的思念。"},{"english":"Many people, especially women, deal with stress by overeating.","chinese":"許多人，尤其是女性，以暴飲暴食來排解壓力。"},{"english":"One of the best ways to do that is to release it is through physical exercise.","chinese":"其中最好的一個方法就是通過體育運動來排解怒氣。"},{"english":"William: Don't eat for the wrong reason. This can happen when people are feeling depressed or lonely.","chinese":"不要藉助喫來排解壓抑和孤獨，那是錯誤的。"},{"english":"They rushed clamorously into the presence of the lioness and demanded of her the settlement of the dispute.","chinese":"牠們喧鬧地湧到母獅面前，請牠來排解糾紛。"},{"english":"The differences between the two parties won't be healed as they insist on their own terms.","chinese":"由於雙方固執己見，他們之間的分歧將無法予以排解。"},{"english":"Friends mediated between them in the dispute.","chinese":"排解了他們的糾紛。"},{"english":"Eat teeth and bold, how also acid is generated.","chinese":"喫的牙齒和胃酸溜溜的，怎麼也無處排解。"},{"english":"When it came to the first days at my arrival, I was so eager to watch much televesion so that I could learn a good English and get away with loneliness.","chinese":"剛到時我想多看電視，既學英文，又排解寂寞。"},{"english":"Wang Zhilan had to use martial to relieve the pain in mind.","chinese":"王芷蘭只好用練武來排解心中的苦痛。"}],"related":[{"definition":["to divert oneself from (loneliness, grief etc)\/to dispel (negative thoughts etc)"],"pinyin":["pai2 qian3"],"word":"排遣"},{"definition":["to relieve\/to ease (pressure)\/to alleviate\/to remove\/to get rid of"],"pinyin":["shu1 jie3"],"word":"紓解"},{"definition":["depressed\/dejected\/feeling low"],"pinyin":["ku3 men4"],"word":"苦悶"},{"definition":["moody\/gloomy"],"pinyin":["fan2 men4"],"word":"煩悶"},{"definition":["to straighten out\/to explain\/to ease sb's anxiety"],"pinyin":["kai1 jie3"],"word":"開解"},{"definition":["to drain (by leading off water)\/to unburden oneself\/to divulge\/to leak a secret"],"pinyin":["xuan1 xie4"],"word":"宣洩"},{"definition":["to give vent to (one's feelings)"],"pinyin":["fa1 xie4"],"word":"發洩"},{"definition":["to say everything (that is on one's mind)"],"pinyin":["qing1 su4"],"word":"傾訴"},{"definition":["depressed\/gloomy"],"pinyin":["chou2 men4"],"word":"愁悶"},{"definition":["depressed\/despondent\/gloomy\/depression"],"pinyin":["yi4 yu4"],"word":"抑鬱"},{"definition":["to suffer from pent-up frustrations\/mental knot\/emotional issue"],"pinyin":["yu4 jie2"],"word":"鬱結"},{"definition":["to talk sb round\/to straighten sth out\/to enlighten"],"pinyin":["kai1 dao3"],"word":"開導"},{"definition":["pent-up frustrations\/sth that has accumulated in one's mind for a long time"],"pinyin":["ji1 yu4"],"word":"積鬱"},{"definition":["mood\/state of mind\/moodiness\/CL:種|种[zhong3]"],"pinyin":["qing2 xu4"],"word":"情緒"},{"definition":["to express (an emotion)\/to give vent"],"pinyin":["shu1 fa1"],"word":"抒發"},{"definition":["to eliminate\/to dispel\/resolution"],"pinyin":["xiao1 jie3"],"word":"消解"}]}