{"definition":["to earn (income)\/to make (money)"],"pinyin":["zheng4 de2"],"simplified":["挣得"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"掙得","characters":[{"definition":["see 掙扎|挣扎[zheng1 zha2]","to struggle to get free\/to strive to acquire\/to make (money)"],"pinyin":["zheng1","zheng4"],"word":"掙"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[],"sentences":[{"english":"When it comes to public speaking, there are three major avenues you can take to make good money.","chinese":"在演說者方面，有三種方法可以使你掙得盆滿鉢滿。"},{"english":"He sweats himself to earn as much money as possible.","chinese":"他拼命幹活以掙得儘可能多的錢。"},{"english":"He toiled all day long but earned very little.","chinese":"他整天勞碌但掙得很少。"},{"english":"I tried my best to get some points for Toyota.","chinese":"我竭盡全力想爲豐田車隊掙得一些分數。"},{"english":"They want them to earn more, and shop til they drop.","chinese":"他們希望中國人掙得更多，然後消費掉。"},{"english":"I can't go back to the village after an M.B.A. Delhi has more money, better quality of life.","chinese":"新德里生活條件更好，錢掙得也多。"},{"english":"Hawkwood made large sums of money in this way.","chinese":"霍克沃德用這種方法掙得大筆錢。"},{"english":"They actually don’t want Chinese laborers to earn less and spend little.","chinese":"他們實際上並不希望中國勞動者掙得少，花的少。"},{"english":"In fact, if you do this, you actually earn risk points.","chinese":"實際上，這樣做也會掙得一些冒險分。"},{"english":"He just cleared the expenses.","chinese":"他掙得的錢剛夠開支。"},{"english":"Today gang members barely into their teens can earn more money than their parents.","chinese":"現在，才十幾歲的幫派成員就能比他們父母掙得多。"},{"english":"Win them over to your side and you’re almost guaranteed to be earning more.","chinese":"把他們爭取到自己這邊，你就差不多保證能掙得更多。"},{"english":"However, you may keep for your own use all overtime income that you may earn.","chinese":"不管怎樣，你所有掙得的加班費都由你自己支配。"},{"english":"Oh just calk me and I ll make your day .","chinese":"請打電話給我，我會掙得你幸運的一天。"},{"english":"Will you be required to recruit new distributors to earn your commission?","chinese":"你是否被要求要發展新的分享者來掙得你的報酬？"},{"english":"Hawkwood made large sums of money in this way.","chinese":"沃德用這種方法掙得大筆錢。"}],"related":[]}