{"definition":["lit. to hang up a plate\/to open up for business\/listed (on stock market)"],"pinyin":["gua4 pai2"],"simplified":["挂牌"],"rank":3378.0,"normalized_rank":0.04726260266114477,"fraction":0.00004155603494929368,"cumulative_fraction":0.8076220969173318,"word":"掛牌","characters":[{"definition":["to hang or suspend (from a hook etc)\/to hang up (the phone)\/(of a line) to be dead\/to be worried or concerned\/to make a phone call (dialect)\/to register or record\/classifier for sets or clusters of objects\/(slang) to kill\/to die\/to be finished\/to fail (an exam)"],"pinyin":["gua4"],"word":"掛"},{"definition":["mahjong tile\/playing card\/game pieces\/signboard\/plate\/tablet\/medal\/CL:片[pian4],個|个[ge4],塊|块[kuai4]"],"pinyin":["pai2"],"word":"牌"}],"containing_words":[],"sentences":[{"english":"Learn to Read the TicketMany times the price ticket contains the date or season the item arrived at the store.","chinese":"掛牌上通常都會包含物品進店的日期或是季節。"},{"english":"Listing period of adjustment may be based on competitive bids were increased price range.","chinese":"掛牌期間可根據競買人競價情況調整增價幅度。"},{"english":"Group of Chinese harbour construction hangs out his shingle formally hold water already two years many.","chinese":"中國港灣建設集團正式掛牌成立已經兩年多了。"},{"english":"The Changsha Chamber of Commerce American Sub-chamber was officially established in Los Angeles recently.","chinese":"近日，美國長沙商會在洛杉磯正式掛牌成立。"},{"english":"Hainan, Yunnan Rubber Group, the company officially launched operations Yunnan Jinghong City.","chinese":"海南橡膠集團雲南公司在雲南景洪市正式掛牌運營。"},{"english":"Heron is a private company and is not quoted on the Stock Market.","chinese":"赫倫公司是一傢俬營公司，沒有在股票交易市場掛牌。"},{"english":"Many times the price ticket contains the date or season the item arrived at the store.","chinese":"掛牌上通常都會包含物品進店的日期或是季節。"},{"english":"This is the first Zhangjiajie was listed on the five-star hotel.","chinese":"這是張家界首家獲得掛牌的五星級酒店。"},{"english":"\" January 2001, \"staff of shares\" in the Shang Jiaosuo listed transactions.","chinese":"2001年1月，“紅豆股份”在上交所掛牌交易。"},{"english":"Assignment System of industrial land and profit - oriented land shall be implemented strictly by means of public bidding , auction or hanging out a shingle.","chinese":"嚴格落實工業和經營性用地招標拍賣掛牌出讓制度。"},{"english":"When an energy-isolating device cannot accept multiple locks or tags, a multiple lock-out or tag-out hasp must be used.","chinese":"當有些設備即要上鎖又要掛牌時，必須又這樣的工具。"},{"english":"The listing of the 21 Tsing Ai cottages, among them, a small one Wenchuan.","chinese":"此次掛牌的二十一所青艾小屋當中，有一間汶川一小。"},{"english":"The shares change hands on the Shenzhen and Shanghai exchanges, respectively.","chinese":"這些股票分別在上海和深圳證券交易所掛牌交易。"},{"english":"Listing the past year, Jiyuan City Health appearance of the changes?","chinese":"掛牌近一年來，濟源市衛生面貌有何變化呢？"},{"english":"Tag-out will not be acceptable where lock-out provisions are available.","chinese":"能上鎖的地方掛牌是不允許的。"},{"english":"With most products, the listed price actually means something.","chinese":"對於所有的商品來說，掛牌價格其實還是意味重大。"}],"related":[{"definition":["to raise money\/to accumulate funds"],"pinyin":["ji2 zi1"],"word":"集資"},{"definition":["to undertake to purchase sth\/to subscribe (to share issue)"],"pinyin":["ren4 gou4"],"word":"認購"},{"definition":["China Securities Regulatory Commission (CSRC)\/abbr. for 中國證券監督管理委員會|中国证券监督管理委员会[Zhong1 guo2 Zheng4 quan4 Jian1 du1 Guan3 li3 Wei3 yuan2 hui4]"],"pinyin":["Zheng4 jian1 hui4"],"word":"證監會"},{"definition":["to invite bids"],"pinyin":["zhao1 biao1"],"word":"招標"},{"definition":["to reorganize\/to recombine\/recombination"],"pinyin":["chong2 zu3"],"word":"重組"},{"definition":["price competition\/bid (in an auction)\/to compete on price\/to bid against sb"],"pinyin":["jing4 jia4"],"word":"競價"},{"definition":["(of a store, stock market etc) to open for trading\/to make the first transaction of the day"],"pinyin":["kai1 shi4"],"word":"開市"},{"definition":["stock price\/share price"],"pinyin":["gu3 jia4"],"word":"股價"},{"definition":["Shenzhen Stock Exchange, abbr. to 深交所[Shen1 Jiao1 suo3]"],"pinyin":["Shen1 zhen4 Zheng4 quan4 Jiao1 yi4 suo3"],"word":"深圳證券交易所"},{"definition":["equity shares\/stock right"],"pinyin":["gu3 quan2"],"word":"股權"},{"definition":["to purchase (from various places)\/to acquire (a company)"],"pinyin":["shou1 gou4"],"word":"收購"},{"definition":["to set up\/to establish"],"pinyin":["she4 li4"],"word":"設立"},{"definition":["financing"],"pinyin":["rong2 zi1"],"word":"融資"},{"definition":["above quota"],"pinyin":["chao1 e2"],"word":"超額"},{"definition":["negotiable security (financial)\/certificate\/stocks and bonds"],"pinyin":["zheng4 quan4"],"word":"證券"},{"definition":["test point\/to carry out trial\/pilot scheme"],"pinyin":["shi4 dian3"],"word":"試點"}]}