{"definition":["to be affiliated with\/to operate under the wing of\/affiliation"],"pinyin":["gua4 kao4"],"simplified":["挂靠"],"rank":16909.0,"normalized_rank":0.23657884795657105,"fraction":0.0000033189473243328897,"cumulative_fraction":0.9661174576833148,"word":"掛靠","characters":[{"definition":["to hang or suspend (from a hook etc)\/to hang up (the phone)\/(of a line) to be dead\/to be worried or concerned\/to make a phone call (dialect)\/to register or record\/classifier for sets or clusters of objects\/(slang) to kill\/to die\/to be finished\/to fail (an exam)"],"pinyin":["gua4"],"word":"掛"},{"definition":["to lean against or on\/to stand by the side of\/to come near to\/to depend on\/to trust\/to fuck (vulgar)\/traditional military costume drama where the performers wear armor (old)"],"pinyin":["kao4"],"word":"靠"}],"containing_words":[],"sentences":[{"english":"However, there is more variability among unaffiliated individual bloggers.","chinese":"而非掛靠類的個體博客就比較多變數了。"},{"english":"Nanjing test tubes anchored in the Urban Planning Bureau, Office of the relevant Chu Shi.","chinese":"南京市測管辦掛靠在市規劃局相關處室。"},{"english":"It was linked to a government owned company, that was never in question.","chinese":"掛靠在一個政府下屬公司，毫無疑問。"},{"english":"Desert Control Institute of Inner Mongolia Agricultural University is attached in the College.","chinese":"內蒙古農業大學沙漠治理研究所掛靠在本學院。"},{"english":"Put that information on a banner and link it to your sign up page.","chinese":"把資料給你一面旗幟和掛靠公司簽訂的一頁。"},{"english":"PSCO: Captain, what is your last port of call and next port?","chinese":"船長，您的上一個和下一個掛靠港是哪裏？"}],"related":[]}