{"definition":["slope"],"pinyin":["cai3 chang3"],"simplified":["采场"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"採場","characters":[{"definition":["to pick\/to pluck\/to collect\/to select\/to choose\/to gather"],"pinyin":["cai3"],"word":"採"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"}],"containing_words":[],"sentences":[{"english":"Collapse of stope roof, is one of disasters occuring at underground mines.","chinese":"礦山採場頂板冒落是地下礦山開採中常見的災害。"},{"english":"Attachment air is one of the important characteristics of the air-flow structure in flat chamber stopes.","chinese":"附壁風流是扁平型峒室採場風流結構的重要特徵之一。"},{"english":"Analysis on the factors influencing stress-strain of mining field and mine roadway;","chinese":"採場管理是礦山井下生產工作中的一個關鍵性環節。"},{"english":"But the beam model is an approximate model in studying the roof problems.","chinese":"但用梁模型來研究採場頂板問題具有相當的近似性。"},{"english":"Stope management is one of important tasks in mining activity underground.","chinese":"採場管理是礦山井下生產工作中的一個關鍵性環節。"},{"english":"Liquid fluid system is the key part of in-site leaching.","chinese":"採場液流系統的研究是就地浸出的關鍵技術之一。"},{"english":"Fault tree analysis for collapse of roadways with fractured surrounding rock and high tectonic stress in jinchuan mine no.","chinese":"金川二礦區不良岩層採場巷道片幫冒頂事故樹分析。"},{"english":"Stability of side slope is the basic guarantee for normal production of the opencast stope.","chinese":"邊坡穩定是露天採場生產正常進行的基礎保障。"},{"english":"Stope rock-fall is the main style of safety accidents in underground metal mine.","chinese":"採場冒落是金屬礦地下開採安全事故的主要形式。"},{"english":"Collapse of stope roofs is one of disasters occurring at underground mines.","chinese":"礦山採場頂板冒落是地下礦山開採中常見的災害。"},{"english":"Based on the key stratum theory, the structure characteristics and movement laws of overlying strata with different mining height are studied.","chinese":"運用關鍵層理論研究了採場覆巖結構特徵及運動規律。"},{"english":"The liquid flow system of a stope is a key for stope leaching.","chinese":"採場液流系統的研究是就地浸出的關鍵技術之一。"},{"english":"Water drainage in hollow open pit stope is a key link of production.","chinese":"凹陷露天採場排水是一個十分重要的生產工藝環節。"}],"related":[]}