{"definition":["to examine\/to probe\/to scout out\/to nose around"],"pinyin":["tan4 cha2"],"simplified":["探查"],"rank":33168.0,"normalized_rank":0.4640633525946861,"fraction":7.117869085787813e-7,"cumulative_fraction":0.9928445860524951,"word":"探查","characters":[{"definition":["to explore\/to search out\/to scout\/to visit\/to stretch forward"],"pinyin":["tan4"],"word":"探"},{"definition":["see 山查[shan1 zha1]","surname Zha","to research\/to check\/to investigate\/to examine\/to refer to\/to look up (e.g. a word in a dictionary)"],"pinyin":["Zha1","cha2","zha1"],"word":"查"}],"containing_words":[],"sentences":[{"english":"Conclusion The above procedure is necessary for the ankle sprains with the injury of the common peroneal nerve.","chinese":"結論踝扭傷出現腓總神經損傷者應作探查鬆解減壓術。"},{"english":"This is China\"s first exploration depth of the documentary work marriage asexual.\"","chinese":"這是中國第一部深度探查無性婚姻的紀實作品。"},{"english":"Using cues, clues and hints to detect the hidden relationships.","chinese":"運用各種暗示點對隱藏的事理邏輯線索進行探查。"},{"english":"She want to prob my hurt, want to know I think.","chinese":"她試圖探查我的心意，想知道我在想什麼。"},{"english":"Standing in front of a mirror will help in looking for any possible swelling on the scrotum.","chinese":"照著鏡子檢查會有助於探查陰囊上任何可能的腫大。"},{"english":"At the right is a probe patent foramen ovale in an adult.","chinese":"右爲成年人卵圓孔未閉的探查。"},{"english":"But this is often limited to small probing manoeuvres.","chinese":"但是，這往往侷限於小的探查演練。"},{"english":"A laparotomy was performed and the tumor was resected.","chinese":"遂行剖腹探查及腫瘤切除。"},{"english":"Methylene blue injection into breast duct in operation could help surgeons to explore and resect lesions.","chinese":"病變乳管內置管美蘭注射有助於病竈的探查和切除。"},{"english":"Remote debugging increases the total surface area that can be probed.","chinese":"遠端偵錯會增加能夠探查的整體表面範圍。"},{"english":"Their task is exploring oil mines in the west.","chinese":"他們的任務是在西部探查油礦。"},{"english":"Conclusion Operations research should be done immediately for the cases with early diagnosis or high …","chinese":"結論對明確診斷或有高度懷疑時，應積極行手術探查。"},{"english":"After the teaching intervention, ascertains the situation of student's conceptual understanding.","chinese":"而後探查了教學干預後學生的化學概念理解情況。"},{"english":"The fist part is about the research on probability of Zhao's misreading.","chinese":"文章第一個部分對造成趙孟頫誤讀的可能性進行探查。"},{"english":"Today the principal tools for prospecting the brain are electrical.","chinese":"當今探查人腦的主要工具是用電的。"},{"english":"The second case, a 94-year-old male with senile dementia was arranged for exploratory laparotomy.","chinese":"第二個病例是，94歲男性一，預進行剖腹探查術。"}],"related":[{"definition":["to investigate\/to observe\/to scout\/to seek out and examine\/to explore"],"pinyin":["tan4 cha2"],"word":"探察"},{"definition":["to check\/to investigate\/to probe (into)"],"pinyin":["cha2 tan4"],"word":"查探"},{"definition":["to find out\/to ascertain\/to get an idea of"],"pinyin":["tan4 zhi1"],"word":"探知"},{"definition":["to make inquiries\/to try to find out\/to pry"],"pinyin":["tan4 ting1"],"word":"探聽"},{"definition":["to make discreet inquiries\/to scout out"],"pinyin":["da3 tan4"],"word":"打探"},{"definition":["to search\/to look for"],"pinyin":["sou1 xun2"],"word":"搜尋"},{"definition":["response\/reaction\/interaction\/irritability (biol.)\/induction (elec.)\/inductance"],"pinyin":["gan3 ying4"],"word":"感應"},{"definition":["to pry into\/to spy on\/to probe into"],"pinyin":["ci4 tan4"],"word":"刺探"},{"definition":["to monitor\/to keep a close watch over\/surveillance"],"pinyin":["jian1 shi4"],"word":"監視"},{"definition":["to peep at\/to spy on\/to peek"],"pinyin":["kui1 shi4"],"word":"窺視"},{"definition":["to investigate a crime\/to scout\/to reconnoiter\/reconnaissance\/detection\/a scout"],"pinyin":["zhen1 cha2"],"word":"偵察"},{"definition":["to detect\/to sense"],"pinyin":["zhen1 ce4"],"word":"偵測"},{"definition":["to submerge\/to infiltrate\/to steal into"],"pinyin":["qian2 ru4"],"word":"潛入"},{"definition":["to pry into or spy on\/to snoop\/to peep\/to poke one's nose into\/to peer\/to get a glimpse of"],"pinyin":["kui1 tan4"],"word":"窺探"},{"definition":["to watch\/to look carefully at"],"pinyin":["cha2 kan4"],"word":"察看"},{"definition":["secret\/hidden"],"pinyin":["yin3 mi4"],"word":"隱秘"}]}