{"definition":["to investigate\/to probe"],"pinyin":["tan4 tao3"],"simplified":["探讨"],"rank":3774.0,"normalized_rank":0.052803156436696384,"fraction":0.00003583575566308201,"cumulative_fraction":0.8228545818573542,"word":"探討","characters":[{"definition":["to explore\/to search out\/to scout\/to visit\/to stretch forward"],"pinyin":["tan4"],"word":"探"},{"definition":["to invite\/to provoke\/to demand or ask for\/to send armed forces to suppress\/to denounce or condemn\/to marry (a woman)\/to discuss or study"],"pinyin":["tao3"],"word":"討"}],"containing_words":[],"sentences":[{"english":"Objective To investigate the antiproliferative effects of folate on ovarian cancer cells.","chinese":"目的探討葉酸對卵巢癌細胞增殖的影響及作用機制。"},{"english":"Objective To investigate the value of ultrasound in the diagnosis of theca cell tumor.","chinese":"目的探討超聲檢查在卵泡膜細胞瘤診斷中的價值。"},{"english":"Objective To research the LISREL and its application in the biomedical studies.","chinese":"目的探討線性結構模型理論及其在醫學中的應用。"},{"english":"Objective To explore the diagnosis and treatment features of pulmonary heart disease caused by tuberculosis.","chinese":"目的探討肺結核所致肺心病的診斷和治療特點。"},{"english":"Objectives To explore the training method of comprehensive competence for junior nurses in burn department.","chinese":"目的探討燒傷科新護士綜合護理能力的培養方法。"},{"english":"Objective To study the clinical diagnosis of B-mode ultrasound to gynecologic acute abdomen.","chinese":"目的探討B型超聲對婦科急腹症的臨牀診斷價值。"},{"english":"Aim To investigate the treatment and clinical diagnosis of right lower-abdominal mass.","chinese":"目的探討右下腹包塊的臨牀診斷與治療。"},{"english":"Objective To study the clinical features and treatment of traumatic cerebral intraventricular hemorrhage(TIVH).","chinese":"目的探討外傷性腦室出血的臨牀特點和治療方法。"},{"english":"Objective To make new approach of the interventional radiology in the treatment of ischemic necrosis of caput femoris in children.","chinese":"目的探討介入治療兒童股骨頭缺血性壞死的價值。"},{"english":"Objective To investigate the anatomical structures of the posterior column of the acetabulum and the related clinical significance.","chinese":"目的探討髖臼後柱的解剖學結構及其相關臨牀意義。"},{"english":"To investigate clinical feature and therapeutic approach of traumatic dural sinus.","chinese":"探討外傷性顱內靜脈竇損傷的臨牀特點及治療。"},{"english":"Objective To study the anti-inflammatory and analgesic effects of Aralia echinocaulis Foot bark.","chinese":"目的探討刺莖楤木根皮的抗炎鎮痛作用。"},{"english":"Objective To evaluate the treatment of cooperative care of patients with IVP.","chinese":"目的探討靜脈腎盂造影的護理配合。"},{"english":"Objective To evaluate the clinical value of supraglottic horizontal partial laryngectomy.","chinese":"目的探討喉聲門上水平部分切除術的臨牀應用價值。"},{"english":"Objective To evaluate the value of high frequency ultrasound in diagnosis of trauma of tendo calcaneus.","chinese":"目的探討高頻超聲對跟腱損傷的診斷價值。"},{"english":"Objective To further discuss the indexes which can be used to objectively appraise the rat myocardial ischemia models.","chinese":"目的進一步探討客觀評價大鼠心肌缺血模型的指標。"}],"related":[{"definition":["to discuss\/to talk over\/CL:個|个[ge4]"],"pinyin":["tao3 lun4"],"word":"討論"},{"definition":["topic of discussion\/topic\/subject\/issue (under discussion)\/CL:項|项[xiang4]"],"pinyin":["yi4 ti2"],"word":"議題"},{"definition":["to decipher\/to decode\/to interpret"],"pinyin":["jie3 du2"],"word":"解讀"},{"definition":["dialogue\/CL:個|个[ge4]"],"pinyin":["dui4 hua4"],"word":"對話"},{"definition":["to discuss\/to talk about"],"pinyin":["tan2 lun4"],"word":"談論"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"word":"實踐"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["learning\/science\/academic\/CL:個|个[ge4]"],"pinyin":["xue2 shu4"],"word":"學術"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to expound (a position)\/to elaborate (on a topic)\/to treat (a subject)"],"pinyin":["chan3 shu4"],"word":"闡述"},{"definition":["to extend\/to spread\/to popularize\/generalization\/promotion (of a product etc)"],"pinyin":["tui1 guang3"],"word":"推廣"},{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有關"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["to combine\/to link\/to integrate\/binding\/CL:次[ci4]"],"pinyin":["jie2 he2"],"word":"結合"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"發展"}]}