{"definition":["to connect (a cable etc)\/to hook up (a device)\/to resume (a conversation)\/to set (a bone)"],"pinyin":["jie1 shang4"],"simplified":["接上"],"rank":18128.0,"normalized_rank":0.2536342395030291,"fraction":0.000002900137512866006,"cumulative_fraction":0.9698959345482392,"word":"接上","characters":[{"definition":["to receive\/to answer (the phone)\/to meet or welcome sb\/to connect\/to catch\/to join\/to extend\/to take one's turn on duty\/to take over for sb"],"pinyin":["jie1"],"word":"接"},{"definition":["on top\/upon\/above\/upper\/previous\/first (of multiple parts)\/to climb\/to get onto\/to go up\/to attend (class or university)","see 上聲|上声[shang3 sheng1]"],"pinyin":["shang3","shang4"],"word":"上"}],"containing_words":[],"sentences":[{"english":"She swipes an access fob, enters a PIN and attaches the hydrogen nozzle.","chinese":"她輸入PIN碼並接上氫氣輸氣管。"},{"english":"Connected a piece of thin wire to a dry cell.","chinese":"在一節乾電池上接上一段細鐵絲。"},{"english":"She put the big hot coffee urn on the table and plugged it in .","chinese":"她將大咖啡壺放在桌子上，接上電源。"},{"english":"My people turned to me for answers.","chinese":"接上去，我把我的百姓稱爲“辛多雷”，血精靈。"},{"english":"Nobody expects Dolly Parton to know how to plug in a microphone.","chinese":"沒有人期望桃莉巴頓知道如何接上麥克風。"},{"english":"The train connects here with a bus to the airport.","chinese":"這列火車在這裏可接上去機場的公共汽車。"},{"english":"MJ's hair \"was sparse\" and connected to a wig.","chinese":"邁克爾原本的頭髮很少很稀，所以接上了假髮。"},{"english":"Running a transformer into the wrong load will alter its high-frequency roll-off and square wave response.","chinese":"接上錯誤負載會改變其高頻產生滾降及方波形狀。"},{"english":"This is the next immedihadvertising chislenge – I believe.","chinese":"我以爲這將是接上去的尋事。"},{"english":"As Quinn finishes typing, he plugs a device into the computer.","chinese":"Quinn停止了打字，將一個設備接上電腦。"},{"english":"His leg was set at the hospital.","chinese":"他的斷腿已在醫院裏接上了。"},{"english":"This girl is wearing coat of a for military use only, he receives her got on a car.","chinese":"這個女孩只穿着一件軍用大衣，他把她接上了車。"},{"english":"As the bit drills down, pipe is added length after length .","chinese":"隨着鑽頭往下鑽，管子一段一段地加接上去。"},{"english":"That requires a specialist to either file down the bone or reattach the fingertip.","chinese":"這就需要專家來銼平骨頭或者將指頭重接上。"},{"english":"He passes via of true morale, although can not mount the area that the heart vein splits for her.","chinese":"他渡過去的真氣，雖然無法幫她接上心脈斷裂的地方。"},{"english":"Why not connect a small chassis fan or--better yet--an old GPU fan to the power supply?","chinese":"爲什麼不接上一個小風扇或是使用舊的顯卡風扇呢？"}],"related":[{"definition":["to connect\/to put through"],"pinyin":["jie1 tong1"],"word":"接通"},{"definition":["to cut off\/to sever"],"pinyin":["qie1 duan4"],"word":"切斷"},{"definition":["to break or cut in two\/to sever\/to cut off\/(fig.) to cut off (a conversation, a flow etc)\/to interrupt\/(math.) to truncate"],"pinyin":["jie2 duan4"],"word":"截斷"},{"definition":["to receive\/to answer (the phone)\/to meet or welcome sb\/to connect\/to catch\/to join\/to extend\/to take one's turn on duty\/to take over for sb"],"pinyin":["jie1"],"word":"接"},{"definition":["old variant of 插[cha1]"],"pinyin":["cha1"],"word":"揷"},{"definition":["to insert\/to stick\/to thrust"],"pinyin":["cha1 ru4"],"word":"插入"},{"definition":["to pluck\/to pull off\/to pull out\/to unplug"],"pinyin":["ba2 diao4"],"word":"拔掉"},{"definition":["to repair (sth broken)\/to restore (sth damaged)\/to establish friendly relations with\/(literary) to do meritorious deeds"],"pinyin":["xiu1 hao3"],"word":"修好"},{"definition":["to interrupt\/to break off\/to break (a bone)"],"pinyin":["da3 duan4"],"word":"打斷"},{"definition":["to insert\/to stick in\/to plug in (an electronic device)"],"pinyin":["cha1 jin4"],"word":"插進"},{"definition":["lit. to follow the recipe (idiom)\/fig. to follow a set pattern"],"pinyin":["ru2 fa3 pao2 zhi4"],"word":"如法炮製"},{"definition":["to plug into\/to insert\/to stick in"],"pinyin":["cha1 shang5"],"word":"插上"},{"definition":["to convey\/to deliver"],"pinyin":["chuan2 song4"],"word":"傳送"},{"definition":["to extract\/to draw out"],"pinyin":["yin3 chu1"],"word":"引出"},{"definition":["to push aside with the hand, foot, a stick etc\/to dial\/to allocate\/to set aside (money)\/to poke (the fire)\/to pluck (a string instrument)\/to turn round\/classifier: group, batch"],"pinyin":["bo1"],"word":"撥"},{"definition":["to link\/to join\/to attach\/connection\/a link (on web page)"],"pinyin":["lian2 jie1"],"word":"連接"}]}