{"definition":["to replace\/to take over (a position or post)"],"pinyin":["jie1 ti4"],"simplified":["接替"],"rank":9256.0,"normalized_rank":0.1295034488548123,"fraction":0.000009428402963758477,"cumulative_fraction":0.9231418898695338,"word":"接替","characters":[{"definition":["to receive\/to answer (the phone)\/to meet or welcome sb\/to connect\/to catch\/to join\/to extend\/to take one's turn on duty\/to take over for sb"],"pinyin":["jie1"],"word":"接"},{"definition":["to substitute for\/to take the place of\/to replace\/for\/on behalf of\/to stand in for"],"pinyin":["ti4"],"word":"替"}],"containing_words":[],"sentences":[{"english":"Mr. Jacob Li will take over Mr. Mong-Heng Wong's position as a guidance counselor.","chinese":"李孟斌先生將接替王孟宏先生成爲北威的訓導主任。"},{"english":"Probably Mr. Smith will succeed to the mayoralty.","chinese":"可能中密斯先生將接替市長的職位。"},{"english":"Let me seek someone to supply when you having a holiday.","chinese":"你休假期間，我設法找個人來接替一下你的工作吧。"},{"english":"But Nurse was dead and Yezzan too sick to name a successor.","chinese":"但是但是保姆死了而耶贊病到沒法指定一個接替者。"},{"english":"My replacement has already arrived from our head office.","chinese":"我的接替者已經從我們的總公司來了。"},{"english":"By the time Ben was fagged out, Tom had traded the next chance to Billy Fisher for a kite, in good repair;","chinese":"比利用一個修得很好的風箏換來接替本的機會。"},{"english":"We needed to find a replacement for Alonso, and Aquilani is a top class player.","chinese":"我們需要阿隆索的接替者，阿奎拉尼是個頂級球員。"},{"english":"Any one could supersede you as manager in my office.","chinese":"我辦公室中的任何一個人都可以接替你的經理職務。"},{"english":"He is taking over Axelrod's job as chief political adviser to the president.","chinese":"他將接替阿克塞爾羅德，成爲總統首席政治顧問。"},{"english":"54-year-old Zhou took Yongzhi Wang's place as chief designer 5 years ago.","chinese":"5年前接替王永志出任總設計師的周建平娓娓道來。"},{"english":"Late in the evening cadets on duty wash the dishes and pass their duties to other cadets.","chinese":"晚上值班學員洗完碗後，其他學員再來接替他們。"},{"english":"Her 17-year-old sister, who also wants to be a hostess, may succeed her.","chinese":"她17歲的妹妹也想成爲陪酒女，或許可能接替她。"},{"english":"It was envisioned as a possible replacement for the STEN submachinegun then in service.","chinese":"這是設想作爲司登衝鋒槍可能接替然後在服務。"},{"english":"He soon succeeded joffre as commander-in-chief .","chinese":"他不久就接替霞飛擔任總司令職務。"},{"english":"He was pensioned off and replaced with a young girl.","chinese":"他被迫退休，由一位年輕姑娘接替其職務。"},{"english":"Since the merchant's son succeeded him in business, affairs go wrong.","chinese":"自從那商人的兒子接替其父業後，事情便搞得一團糟。"}],"related":[{"definition":["to take over (as minister, manager etc)"],"pinyin":["jie1 ren4"],"word":"接任"},{"definition":["to succeed sb in a job\/successor"],"pinyin":["ji4 ren4"],"word":"繼任"},{"definition":["newly-appointed\/newly elected\/new (in a political office)"],"pinyin":["xin1 ren4"],"word":"新任"},{"definition":["to replace"],"pinyin":["ding3 ti4"],"word":"頂替"},{"definition":["to take up a post\/to start in a new job"],"pinyin":["chu1 ren4"],"word":"出任"},{"definition":["successor"],"pinyin":["ji4 ren4 zhe3"],"word":"繼任者"},{"definition":["choice of person\/candidate"],"pinyin":["ren2 xuan3"],"word":"人選"},{"definition":["to be promoted to"],"pinyin":["sheng1 ren4"],"word":"升任"},{"definition":["to take over (duties etc)\/catcher (baseball etc)"],"pinyin":["jie1 shou3"],"word":"接手"},{"definition":["to wield (power etc)"],"pinyin":["zhi2 zhang3"],"word":"執掌"},{"definition":["to appoint\/(job) appointment\/CL:紙|纸[zhi3]"],"pinyin":["ren4 ming4"],"word":"任命"},{"definition":["to take over\/to take control"],"pinyin":["jie1 zhang3"],"word":"接掌"},{"definition":["to leave office"],"pinyin":["xie4 ren4"],"word":"卸任"},{"definition":["to withdraw to the second line of duty\/to resign from a leading post (and assume an advisory post)"],"pinyin":["tui4 ju1 er4 xian4"],"word":"退居二線"},{"definition":["to hold a governmental office or post\/to assume office of\/to take charge of\/to serve as"],"pinyin":["dan1 ren4"],"word":"擔任"},{"definition":["vacancy"],"pinyin":["kong4 que1"],"word":"空缺"}]}