{"definition":["(idiom) to rudely push and pull others\/(idiom) to evade responsibility and push it to others"],"pinyin":["tui1 lai2 tui1 qu4"],"simplified":["推来推去"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"推來推去","characters":[{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"Don't let people push you around.","chinese":"不要讓人們把你推來推去。"},{"english":"It was a little too harsh to push the boy around.","chinese":"把那男孩推來推去真的有點過分。"},{"english":"Friends come by , they shake me.","chinese":"朋友們衝進來，把我推來推去。"},{"english":"I think we dont have to push everybody.","chinese":"我認爲大家沒必要推來推去。"},{"english":"Children grow up feeling unsettled as they are moved back and forth between parents.","chinese":"孩子在這種被父母推來推去的環境中感到動盪不安。"},{"english":"It seems life has been pushing you around and you have quite limited control of it.","chinese":"似乎生活一直在把你推來推去，而你卻很少能掌控它。"},{"english":"He loved to play with my sockets and rolled them around on the shop floor.","chinese":"他很喜歡玩那些插座零件，在工場裏把它們推來推去。"}],"related":[]}