{"definition":["to extend\/to spread\/to popularize\/generalization\/promotion (of a product etc)"],"pinyin":["tui1 guang3"],"simplified":["推广"],"rank":1654.0,"normalized_rank":0.023141605921117064,"fraction":0.0000960109449633614,"cumulative_fraction":0.7008282545596619,"word":"推廣","characters":[{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"},{"definition":["surname Guang","wide\/numerous\/to spread"],"pinyin":["Guang3","guang3"],"word":"廣"}],"containing_words":[],"sentences":[{"english":"The South Korean government spends millions promoting contemporary Korean culture abroad.","chinese":"韓國政府花了數百萬的錢推廣當代韓國文化。"},{"english":"This face-protecting structure has remarkable advantages and is worthy of popularizing.","chinese":"該護面結構優點顯著，有推廣應用的價值。"},{"english":"The Hamiltonian solution system is generalized to the Reissner-Mindlin thick plate problems.","chinese":"將哈密頓求解體系推廣應用於薄板彎曲問題。"},{"english":"Conception of agricultural technology popularization system at the new stage of China;","chinese":"健全的農業推廣體系是實現科技興農的組織保證。"},{"english":"F. Other the promotion behavior of all lawbreaking code.","chinese":"其他一切違反法律法規的推廣行爲。"},{"english":"In this speech, Dean Ching-yun Chuang promotes the importance of happiness.","chinese":"本講座我們邀請莊景雲主任來推廣快樂的重要性。"},{"english":"You are tired, do you still have time to popularize a website?","chinese":"你累不累啊，你還有時間去推廣網站嗎？"},{"english":"It is worth popularizing as a new type undersurface layer gradation of asphalt pavement.","chinese":"是一種值得推廣的新型瀝青路面下面層級配。"},{"english":"The image method of conductor is popularized.","chinese":"將導體鏡象法推廣應用到介質。"},{"english":"The method is simple to implement, has high accuracy, and can be widely used.","chinese":"該方法實現過程簡單，分類準確，可推廣性較強。"},{"english":"The communication mechanism in this paper can be extended to other communication mechanism besides serial devices in VxWorks.","chinese":"本文的方案可以推廣到串行設備以外的其它通信機制。"},{"english":"Promoting literacy is one of Laura Bush's main projects as first lady.","chinese":"推廣讀寫能力是蘿拉身爲第一夫人的主要計畫。"},{"english":"Aim To study dynamical behavior and travelling solutions of generalized BBM equation.","chinese":"目的研究了推廣的BBM方程的動力學行爲和行波解。"},{"english":"Clever uses of shopping bags in advertising campaigns by various companies.","chinese":"許多商家巧妙地利用購物袋來推廣自己的品牌。"},{"english":"This assess standard has achieved remarkable results after its wide spread and application at the whole Inc.","chinese":"經在全公司普及推廣運用，取得了顯著效果。"},{"english":"Later, aristocrats and literary figures helped expand the ceremony to common people.","chinese":"後來，貴族和文人學士把中秋祭月的傳統推廣到民間。"}],"related":[{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to encourage"],"pinyin":["gu3 li4"],"word":"鼓勵"},{"definition":["to sell\/marketing"],"pinyin":["xing2 xiao1"],"word":"行銷"},{"definition":["to participate (in sth)"],"pinyin":["can1 yu4"],"word":"參與"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"發展"},{"definition":["to teach\/teaching and learning\/education\/CL:門|门[men2],個|个[ge4]"],"pinyin":["jiao4 xue2"],"word":"教學"},{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"word":"協助"},{"definition":["active\/energetic\/vigorous\/positive (outlook)\/proactive"],"pinyin":["ji1 ji2"],"word":"積極"},{"definition":["to pass through\/to penetrate\/by means of\/via"],"pinyin":["tou4 guo4"],"word":"透過"},{"definition":["to conduct\/to hold"],"pinyin":["ju3 ban4"],"word":"舉辦"},{"definition":["to serve\/service\/CL:項|项[xiang4]"],"pinyin":["fu2 wu4"],"word":"服務"},{"definition":["to disseminate\/to give publicity to\/propaganda\/CL:個|个[ge4]"],"pinyin":["xuan1 chuan2"],"word":"宣傳"},{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"word":"實踐"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["to combine\/to link\/to integrate\/binding\/CL:次[ci4]"],"pinyin":["jie2 he2"],"word":"結合"},{"definition":["to disseminate\/to propagate\/to spread"],"pinyin":["chuan2 bo1"],"word":"傳播"}]}