{"definition":["to esteem\/to think highly of\/to accord importance to\/to revere"],"pinyin":["tui1 chong2"],"simplified":["推崇"],"rank":10629.0,"normalized_rank":0.1487135002028738,"fraction":0.000007485148794972433,"cumulative_fraction":0.934650194030986,"word":"推崇","characters":[{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"},{"definition":["high\/sublime\/lofty\/to esteem\/to worship","surname Chong"],"pinyin":["Chong2","chong2"],"word":"崇"}],"containing_words":[],"sentences":[{"english":"The contemporary art esteems vigorously which by US occupies the mainstream status forcefully.","chinese":"由美國極力推崇的當代藝術強行佔據主流地位。"},{"english":"He was well respected in the medical profession.","chinese":"他在醫藥界備受推崇。"},{"english":"The preference for lighter skin and prejudice against dark-skinned people is deep-rooted in Chinese tradition.","chinese":"中國根深蒂固的傳統觀念推崇白人但瞧不起黑人。"},{"english":"I’m a big fan of simple.","chinese":"我是一個極其推崇簡約的人。"},{"english":"An italophile is a perso who greatly admires italy and italian people and cultree.","chinese":"意大利迷對意大利及其國民和文化推崇備至。"},{"english":"Will tell from the appearance, its take the praise highly that expressional China traditional culture makes to the ceremony seriously.","chinese":"從外形來講，其重視表現中國傳統文化對禮制的推崇。"},{"english":"Golden cowrie shells are among the hardest shells to find and are prized by collectors.","chinese":"黃金寶螺的貝殼極難找到，它們爲收藏家所推崇。"},{"english":"The dry season is the most recommended period for a visit to the Uyuni Salt Flat.","chinese":"旱季是最被推崇的鹽沼遊覽時節。"},{"english":"The famous poet Yuan Haowen in Jin kingdom thinks highly of poet Bai Juyi of the middle Tang Dynasty.","chinese":"金源著名詩人元好問對中唐詩人白居易頗爲推崇。"},{"english":"But Confucianism revived, with its softer approach to power. Bell says that like the first emperor, the early communists struggled to consolidate their power.","chinese":"但是儒家思想因其推崇以柔克剛的權力手段得以復興。"},{"english":"After trying many moisturisers on my dry skin I was recommended this.","chinese":"在嘗試過很多保溼產品後，我極力推崇這款日霜。"},{"english":"and that's what California's always been based on.","chinese":"而且那也是加利福尼亞一直所推崇的。"},{"english":"I rate zola and george eliot more highly than he does .","chinese":"比起他來，我更加推崇左拉和喬治愛略特。"},{"english":"Philip of Beverley was venerated as a saint.","chinese":"貝弗利的菲利普被推崇爲聖人。"},{"english":"The author acclaims Liu's Styles and Construction of Chinese Architecture and shows the a deep reverence for Mr.","chinese":"對於劉先生的《中國建築類型與結構》著述推崇備至。"},{"english":"This small brothers why to nowadays angel up adore thus?","chinese":"這位小兄弟何以對當今聖上如此推崇？"}],"related":[{"definition":["to hold up (as an model)\/to hold in esteem\/to revere\/to advocate"],"pinyin":["chong2 shang4"],"word":"崇尚"},{"definition":["to promote\/to advocate"],"pinyin":["ti2 chang4"],"word":"提倡"},{"definition":["to treasure\/to be very fond of"],"pinyin":["zhong1 ai4"],"word":"鍾愛"},{"definition":["to advocate\/to initiate\/to propose\/to be a proponent of (an idea or school of thought)"],"pinyin":["chang4 dao3"],"word":"倡導"},{"definition":["to commend\/to praise"],"pinyin":["cheng1 dao4"],"word":"稱道"},{"definition":["to like\/to love\/to be fond of\/favorite"],"pinyin":["xi3 ai4"],"word":"喜愛"},{"definition":["to take as a guiding principle (idiom)"],"pinyin":["feng4 wei2 gui1 nie4"],"word":"奉為圭臬"},{"definition":["to praise\/recognition"],"pinyin":["zan4 yu4"],"word":"贊譽"},{"definition":["to receive in no small measure"],"pinyin":["shen1 shou4"],"word":"深受"},{"definition":["(lit.) to fix one's gaze on\/(fig.) to show interest in\/(favorable) attention\/favor"],"pinyin":["qing1 lai4"],"word":"青睞"},{"definition":["to regard as important\/to care about"],"pinyin":["kan4 zhong4"],"word":"看重"},{"definition":["to approve of\/to endorse\/to acknowledge\/to recognize\/to identify oneself with"],"pinyin":["ren4 tong2"],"word":"認同"},{"definition":["to revere\/to admire\/to honor\/to venerate"],"pinyin":["zun1 chong2"],"word":"尊崇"},{"definition":["to attach importance to sth\/to value"],"pinyin":["zhong4 shi4"],"word":"重視"},{"definition":["to respect deeply\/to revere\/to esteem"],"pinyin":["jing4 zhong4"],"word":"敬重"},{"definition":["to chase after (a popular person or item)\/to pursue\/popularity"],"pinyin":["zhui1 peng3"],"word":"追捧"}]}