{"definition":["tui na (form of Chinese manual therapy)"],"pinyin":["tui1 na2"],"simplified":["推拿"],"rank":25161.0,"normalized_rank":0.3520350342087222,"fraction":0.0000014571486713358069,"cumulative_fraction":0.9845273249325159,"word":"推拿","characters":[{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"},{"definition":["to hold\/to seize\/to catch\/to apprehend\/to take\/(used in the same way as 把[ba3]: to mark the following noun as a direct object)"],"pinyin":["na2"],"word":"拿"}],"containing_words":[],"sentences":[{"english":"I also do the deep breathing and self-massage mentioned above as I do so.","chinese":"在閒步中也做上文提到的深呼吸和自我推拿運動。"},{"english":"The osteopath carefully manipulated my damaged shoulder.","chinese":"整骨醫生仔細而又熟練地給我推拿受傷的肩。"},{"english":"It indicates that wrist-ankle acupuncture combinated massage ha…","chinese":"說明腕踝針配合推拿治療肩周炎療效好。"},{"english":"The masseur kneaded my back.","chinese":"那個按摩師給我推拿了背。"},{"english":"Massage the scalp, improve blood circulation, prevent hair white.","chinese":"推拿頭皮，改進血循環，防備頭髮變白。"},{"english":"Treat yourself to a massage or spa day.","chinese":"去做做推拿或者泡泡溫泉，犒勞一下自己。"},{"english":"LeEr feet like twisted, cloud crazy for her massage.","chinese":"樂兒的腳好像扭到了，雲狂給她推拿。"},{"english":"Conclusion This method might have certain effect to treat peripheral facial palsy.","chinese":"結論電針配合推拿治療周圍性面神經麻痹療效肯定。"},{"english":"Our shop is the ancestral manipulation.","chinese":"本店是祖傳推拿手法店。"},{"english":"Sensual massage and foot rub are great way to help relax her body.","chinese":"撩人地推拿和足底按摩是幫助她放鬆身體的好方法。"},{"english":"Massage is not used for dermatosis with pathologic changes and injuries, bruise and scald.","chinese":"皮膚病病變損害處，皮開肉綻及燙傷處一般不宜推拿。"},{"english":"Objective To explore the curative effect of periarthritis of shoulder with the massage and cupping.","chinese":"目的推拿配合火罐對治療肩周炎的療效。"},{"english":"It bases on biology mechanics theory and herbalist doctor's massage correctitude bone theory .","chinese":"它根據生物力學原理及中醫推拿正骨原理設計面成。"},{"english":"Conclusion Massage therapy has excellent effectiveness in the treatment of nape and back pain in lactation.","chinese":"結論推拿療法治療哺乳性頸背疼痛症療效顯著。"},{"english":"Her dislocated shoulder was carefully manipulated back into place.","chinese":"她脫臼的肩關節經小心推拿而復位。"},{"english":"If you need massage, please dail 6969.","chinese":"假如要推拿服務，請撥打6969。"}],"related":[{"definition":["acupuncture and moxibustion\/to give or have acupuncture and moxibustion"],"pinyin":["zhen1 jiu3"],"word":"針灸"},{"definition":["gua sha (technique in TCM)"],"pinyin":["gua1 sha1"],"word":"刮痧"},{"definition":["cupping glass\/fire cupping (acupressure technique of Chinese medicine, with fired vacuum cup applied to the skin)\/ventouse (vacuum method used in obstetrics)"],"pinyin":["ba2 guan4"],"word":"拔罐"},{"definition":["bonesetting\/Chinese osteopathy"],"pinyin":["zheng4 gu3"],"word":"正骨"},{"definition":["physiotherapy"],"pinyin":["li3 liao2"],"word":"理療"},{"definition":["massage\/to massage"],"pinyin":["an4 mo2"],"word":"按摩"},{"definition":["form of therapeutic massage, mainly for children, in which a roll of skin is squeezed, working from the base of the spine to the neck (TCM)"],"pinyin":["nie1 ji3"],"word":"捏脊"},{"definition":["moxibustion (TCM)"],"pinyin":["ai4 jiu3"],"word":"艾灸"},{"definition":["see 捏脊[nie1 ji3]"],"pinyin":["nie1 ji1"],"word":"捏積"},{"definition":["to give or have an acupuncture treatment"],"pinyin":["zha1 zhen1"],"word":"扎針"},{"definition":["acupuncture point"],"pinyin":["xue2 wei4"],"word":"穴位"},{"definition":["suction cup (used in Chinese medicine to draw the blood and qi 氣|气)\/detachable suction chimney to make a stove draw"],"pinyin":["ba2 huo3 guan4"],"word":"拔火罐"},{"definition":["moxibustion (TCM)"],"pinyin":["jiu3"],"word":"灸"},{"definition":["to hit a pressure point (martial arts)\/dim mak\/see also 點脈|点脉[dian3 mai4]"],"pinyin":["dian3 xue2"],"word":"點穴"},{"definition":["to nurse one's health\/to recuperate\/to take care of\/to look after\/to discipline\/to educate\/to train\/to prepare food\/(dialect) to make fun of\/(medicine) to opsonize"],"pinyin":["tiao2 li3"],"word":"調理"},{"definition":["moxibustion (TCM)"],"pinyin":["jiu3 fa3"],"word":"灸法"}]}