{"definition":["propellant\/rocket fuel"],"pinyin":["tui1 jin4 ji4"],"simplified":["推进剂"],"rank":38784.0,"normalized_rank":0.5426384788661452,"fraction":4.310719321232857e-7,"cumulative_fraction":0.995993612207652,"word":"推進劑","characters":[{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"},{"definition":["dose (medicine)"],"pinyin":["ji4"],"word":"劑"}],"containing_words":[],"sentences":[{"english":"For proper combustion it is necessary to atomize the propellants.","chinese":"爲了有效地進行燃燒，推進劑必須霧化。"},{"english":"A mechanical model of the uniaxial extension of composite solid propellants is propounded in this paper.","chinese":"本文提出了複合固體推進劑單向拉伸力學模型。"},{"english":"The influences of the agglomerated boron to the processing of boron-based fuel-rich propellants were studied.","chinese":"詳細研究聚團硼對含硼富燃推進劑工藝的影響。"},{"english":"The result shows that there is still a portion of propellant un-ignited in the front of SRM.","chinese":"計算結果顯示，發動機頭部有一部分推進劑未點燃。"},{"english":"Acceptance testing equipment for production of liquid propellant.","chinese":"生產液體推進劑用的驗收試驗設備。"},{"english":"Upon vehicle impact, a pyrotechnic propellant charge is ignited electrically.","chinese":"車輛發生碰撞時，電子點燃焰火式推進劑填料。"},{"english":"Composite solid propellant slurry is a viscous fluid with high percentage of solid particles.","chinese":"複合固體推進劑藥漿是固體粒子含量很高的粘性流體。"},{"english":"Other advantages of the propellent with a negative pressure exponent were also presented.","chinese":"還指出了負壓力指數推進劑的其它優點。"},{"english":"The combustion mechanism of boron-based fuel-rich propellant was studied.","chinese":"含硼富燃推進劑燃燒機理研究。"},{"english":"It is reasonable that this result should be generally applicable also to liquid-propellant rockets.","chinese":"這個結果通常也應適用於液體推進劑火箭。"},{"english":"For ammonium perchlorate based propellants, it is usually the former.","chinese":"爲高氯酸銨爲基礎的推進劑，它通常是前者。"},{"english":"Liquid oxygen and alcohol were used as the propellant.","chinese":"液氧和酒精被用作推進劑。"},{"english":"The main components of the solid propellant are nitrocellulose and nitroglycerin.","chinese":"固體推進劑的主要成分爲硝化棉和硝化甘油。"},{"english":"Launch capability of liquid rocket engine can be improved by propellant utilization system.","chinese":"採用推進劑利用系統可以提高運載火箭的發射能力。"},{"english":"Theoretical analysis on combustion residue of magnesium-aluminum fuel-rich propellant;","chinese":"系統研究了鋁鎂貧氧推進劑低壓燃燒特性的表徵方法。"},{"english":"Another major test is how to consume the least possible propellant while achieving rendezvous and docking.","chinese":"如何消耗最少的推進劑完成交會對接，也是重大考驗。"}],"related":[]}