{"definition":["to submit (a report etc)\/to refer (a problem) to sb"],"pinyin":["ti2 jiao1"],"simplified":["提交"],"rank":2351.0,"normalized_rank":0.032893540217984414,"fraction":0.00006313269602050213,"cumulative_fraction":0.7548634952459949,"word":"提交","characters":[{"definition":["to carry (hanging down from the hand)\/to lift\/to put forward\/to mention\/to raise (an issue)\/upwards character stroke\/lifting brush stroke (in painting)\/scoop for measuring liquid"],"pinyin":["ti2"],"word":"提"},{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"}],"containing_words":[],"sentences":[{"english":"Material evidence must also be original.","chinese":"物證應當提交原物。"},{"english":"How do I submit an expense report?","chinese":"我要怎樣提交報銷單？"},{"english":"For biological products, samples from several consecutively manufactured batches should be submitted.","chinese":"對於生物製品，應當要提交連續幾個生產批次的樣品。"},{"english":"Candidates may be required to produce medical proof of their disability.","chinese":"申請人或須提交醫生證明書，以證明他爲殘疾人士。"},{"english":"The results of the BCA consumer research project also will be presented.","chinese":"結果基本能力評估的消費者研究項目也將提交。"},{"english":"Indicate by a check mark whether the registrant has filed all reports required.","chinese":"用對鉤標記登記者是否提交了所需報告。"},{"english":"The bill, which has 31 co-sponsors, has been forwarded to the House Ways and Means Committee for consideration.","chinese":"這項法案已提交衆議院籌款委員會審議。"},{"english":"The proxy service monitors the status of each job that has been submitted.","chinese":"代理服務監視已提交的每個作業的狀態。"},{"english":"The editor contains a button that will perform the submission.","chinese":"該編輯器包含一個將執行提交的按鈕。"},{"english":"Two copies of each entry should be submitted.","chinese":"每件參賽作品需提交兩套作品予主辦機構。"},{"english":"Enter the data in the form and start the business process by submitting the form.","chinese":"在表單中輸入數據，然後通過提交表單啓動業務流程。"},{"english":"Of these assignments, at least one must be revised and resubmitted.","chinese":"這些報告至少有一篇必須修改後再提交。"},{"english":"The stub and skeleton objects also take care of beginning and committing container-managed transactions.","chinese":"存根和骨架對象還負責開始和提交容器管理的事務。"},{"english":"Enter the contact's name and then select submit.","chinese":"進入連絡人的姓名，然後選擇提交。"},{"english":"In contrast, out-of-state processors were required to submit title certificates or police certificates.","chinese":"可是州外的收集者卻要提交特許證或警察發給的證書。"},{"english":"Proofs submitted by the printer should be carefully checked to eliminate typographical errors.","chinese":"排版工人應當仔細覈對提交的校樣，避免印刷錯誤。"}],"related":[{"definition":["to present\/to give\/to hand over\/to hand in\/to lay before"],"pinyin":["di4 jiao1"],"word":"遞交"},{"definition":["to apply for sth\/application (form etc)\/CL:份[fen4]"],"pinyin":["shen1 qing3"],"word":"申請"},{"definition":["application\/application form\/petition (to higher authorities)"],"pinyin":["shen1 qing3 shu1"],"word":"申請書"},{"definition":["applicant"],"pinyin":["shen1 qing3 ren2"],"word":"申請人"},{"definition":["to issue (document, certificate etc)\/to provide"],"pinyin":["chu1 ju4"],"word":"出具"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"審查"},{"definition":["to fill in a form\/to write data in a box (on a questionnaire or web form)"],"pinyin":["tian2 xie3"],"word":"填寫"},{"definition":["application form"],"pinyin":["shen1 qing3 biao3"],"word":"申請表"},{"definition":["representation letter (law)\/a brief\/written statement\/declaration"],"pinyin":["chen2 shu4 shu1"],"word":"陳述書"},{"definition":["to report to one's superiors\/to appear in the news\/to reply to a letter"],"pinyin":["shang4 bao4"],"word":"上報"},{"definition":["to report (to the authorities)\/to declare (to customs)"],"pinyin":["shen1 bao4"],"word":"申報"},{"definition":["the original\/original document\/master copy"],"pinyin":["yuan2 jian4"],"word":"原件"},{"definition":["photocopy\/duplicate"],"pinyin":["fu4 yin4 jian4"],"word":"複印件"},{"definition":["written appeal"],"pinyin":["shen1 su4 shu1"],"word":"申訴書"},{"definition":["proposal\/draft resolution\/motion (to be debated)\/to propose a bill\/to make a proposal"],"pinyin":["ti2 an4"],"word":"提案"},{"definition":["to amend\/to alter\/to modify"],"pinyin":["xiu1 gai3"],"word":"修改"}]}