{"definition":["to raise the price"],"pinyin":["ti2 jia4"],"simplified":["提价"],"rank":10003.0,"normalized_rank":0.1399549480223301,"fraction":0.000008265399210549461,"cumulative_fraction":0.9297224325362021,"word":"提價","characters":[{"definition":["to carry (hanging down from the hand)\/to lift\/to put forward\/to mention\/to raise (an issue)\/upwards character stroke\/lifting brush stroke (in painting)\/scoop for measuring liquid"],"pinyin":["ti2"],"word":"提"},{"definition":["great\/good\/middleman\/servant","price\/value\/(chemistry) valence"],"pinyin":["jia4","jie5"],"word":"價"}],"containing_words":[],"sentences":[{"english":"The stability of the economy and society would surely be affected, leaving people haunted.","chinese":"輪番提價勢必影響經濟和社會穩定，搞得人心惶惶。"},{"english":"He put a well-reasoned case for increasing the prices.","chinese":"他提出了非常充分的提價理由。"},{"english":"Shops are no longer allowed to push up their prices whenever they want.","chinese":"再不允許商店想什麼時候提價就提價了。"},{"english":"Shops are no longer allowed to push up their prices whenever they want.","chinese":"再不允許商店想什麼時候提價就提價了。"},{"english":"Raising price again and again should affect economy and social stability, and make people nervous.","chinese":"輪番提價勢必影響經濟和社會穩定，搞得人心惶惶。"},{"english":"No mark-up would be charged for the sale of finished goods from the HK Company to T Ltd.","chinese":"香港公司出售製成品給T有限公司時不會提價。"},{"english":"The price hike brings the price of Marlboros to 7 Turkish Liras from 5 liras.","chinese":"提價使萬寶路的價格從5土耳其里拉增加到7里拉。"},{"english":"If you’ve got the power to raise prices without losing business to a competitor, you’ve got a very good business.","chinese":"如果你有本事提價還不丟客戶，你就是好公司。"},{"english":"The government beat a retreat, canceling the announced rises in food prices.","chinese":"該政府趕緊收回成命，撤消了業已宣佈的食品提價。"},{"english":"Companies from Baoshan Iron & Steel Co. to Starbucks Corp. and McDonald's Corp. have raised prices.","chinese":"從寶山鋼鐵到星巴克以及麥當勞，各公司紛紛提價。"}],"related":[]}