{"definition":["to raise (an issue)\/to propose\/to put forward\/to suggest\/to post (on a website)\/to withdraw (cash)"],"pinyin":["ti2 chu1"],"simplified":["提出"],"rank":324.0,"normalized_rank":0.004533180361814951,"fraction":0.0004135156408734817,"cumulative_fraction":0.4522481788996538,"word":"提出","characters":[{"definition":["to carry (hanging down from the hand)\/to lift\/to put forward\/to mention\/to raise (an issue)\/upwards character stroke\/lifting brush stroke (in painting)\/scoop for measuring liquid"],"pinyin":["ti2"],"word":"提"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[{"definition":["to propose\/to raise a suggestion"],"pinyin":["ti2 chu1 jian4 yi4"],"word":"提出建議"},{"definition":["to plead (not guilty)\/to enter a plea"],"pinyin":["ti2 chu1 kang4 bian4"],"word":"提出抗辯"}],"sentences":[{"english":"Now, there are some immediate bad explanations for this.","chinese":"馬上就有人提出一些錯漏百出的解釋。"},{"english":"Now I am making an attempt to explain the positions of categories such as primitive accumulation and some others.","chinese":"這裏，對原始積累等範疇的位置，試提出一種解釋。"},{"english":"In this paper, we propose a mathematical model of planar reflector on the Solar pond.","chinese":"本文提出了太陽池反射板的數學模型，並進行了計算。"},{"english":"With the chance of Universiade, Shenzhen proposes to build a voluntary city with the effort of all citizens.","chinese":"借大運會契機，深圳提出全民共建“志願之城”。"},{"english":"The government brought two hundred eighty-five charges against him, mostly for murder.","chinese":"政府對他提出二百八十五費，主要用於謀殺。"},{"english":"But recently some people presented a new algebraic diagonalization method.","chinese":"最近有人提出一種新的代數對角化方法。"},{"english":"At no time, though, did Reagan ever criticize the United Nations specifically.","chinese":"但里根從未對聯合國提出過明確的批評。"},{"english":"Transit vehicle routing problem with time intervals-constrained is considered.","chinese":"提出了具有時間窗的貨物運輸車輛路徑問題。"},{"english":"A new type of continuous contact model was developed for a spatial revolute joint.","chinese":"提出了一種新型空間間隙轉動副的連續接觸模型。"},{"english":"The lawyers dissected his claim for damages.","chinese":"律師們仔細分析了他提出的賠償要求。"},{"english":"A simple hierarchical coarse-to-fine edge detection method based on the direction of potential edge elements is given.","chinese":"提出了一種基於邊界點方向的新的邊界檢測方法。"},{"english":"A new type of two-branch diversity reception system is presented.","chinese":"本文提出了一種新的兩支路分集接收系統。"},{"english":"Finally, some advice was put forward on the research directions of FOD tolerance design technology in China.","chinese":"最後對我國外物損傷容限設計的研究方向提出了建議。"},{"english":"They will allocate funds to you if you requisition it.","chinese":"如果你提出書面申請，他們就會撥給你資金。"},{"english":"An automatic software-development technique of interactive interface for intelligent instruments is presented in this paper.","chinese":"提出一種智能儀表交互界面的軟件開發自動化技術。"},{"english":"His suggestion that Jiulong city must be a commercial port was strategic insight.","chinese":"提出了闢九龍爲商埠等有戰略眼光的建議。"}],"related":[{"definition":["to request\/to require\/requirement\/to stake a claim\/to ask\/to demand\/CL:點|点[dian3]"],"pinyin":["yao1 qiu2"],"word":"要求"},{"definition":["idea\/opinion\/suggestion\/objection\/complaint\/CL:點|点[dian3],條|条[tiao2]"],"pinyin":["yi4 jian4"],"word":"意見"},{"definition":["to indicate\/to point out"],"pinyin":["zhi3 chu1"],"word":"指出"},{"definition":["clear-cut\/definite\/explicit\/to clarify\/to specify\/to make definite"],"pinyin":["ming2 que4"],"word":"明確"},{"definition":["to propose\/to raise a suggestion"],"pinyin":["ti2 chu1 jian4 yi4"],"word":"提出建議"},{"definition":["to advocate\/to stand for\/view\/position\/stand\/proposition\/viewpoint\/assertion\/CL:個|个[ge4]"],"pinyin":["zhu3 zhang1"],"word":"主張"},{"definition":["to emphasize (a statement)\/to stress"],"pinyin":["qiang2 diao4"],"word":"強調"},{"definition":["wording (of a proposal)\/formulation\/viewpoint (on an issue)\/(one of eight methods of bonesetting in TCM) restoring the part displaced by a fracture to its correct position by lifting"],"pinyin":["ti2 fa3"],"word":"提法"},{"definition":["to expound (a position)\/to elaborate (on a topic)\/to treat (a subject)"],"pinyin":["chan3 shu4"],"word":"闡述"},{"definition":["to accept\/to adopt"],"pinyin":["cai3 na4"],"word":"採納"},{"definition":["to mention\/to raise (a subject)\/to refer to"],"pinyin":["ti2 dao4"],"word":"提到"},{"definition":["to put out\/to come up with\/to make (a choice, decision, proposal, response, comment etc)\/to issue (a permit, statement, explanation, apology, reassurance to the public etc)\/to draw (conclusion)\/to deliver (speech, judgment)\/to devise (explanation)\/to extract"],"pinyin":["zuo4 chu1"],"word":"作出"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落實"},{"definition":["to conceive\/concept"],"pinyin":["gou4 xiang3"],"word":"構想"},{"definition":["to draw up\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制定"},{"definition":["plan\/program (for action etc)\/proposal\/proposed bill\/CL:個|个[ge4],套[tao4]"],"pinyin":["fang1 an4"],"word":"方案"}]}