{"definition":["to extract (ore, minerals etc)\/to refine\/to purify\/to process"],"pinyin":["ti2 lian4"],"simplified":["提炼"],"rank":12247.0,"normalized_rank":0.17135141941712256,"fraction":0.000005918954836370764,"cumulative_fraction":0.9454062600075896,"word":"提煉","characters":[{"definition":["to carry (hanging down from the hand)\/to lift\/to put forward\/to mention\/to raise (an issue)\/upwards character stroke\/lifting brush stroke (in painting)\/scoop for measuring liquid"],"pinyin":["ti2"],"word":"提"},{"definition":["to refine\/to smelt"],"pinyin":["lian4"],"word":"煉"}],"containing_words":[],"sentences":[{"english":"The extracted oriental and occidental essence is embodied by a combination of undecorated quality and fashionable elements.","chinese":"提煉中西精華，不經裝飾的特質與時尚元素相結合。"},{"english":"This volume distills 20 years of trading and teaching experience.","chinese":"這本書提煉了20年的交易和教學經驗。"},{"english":"Is he trying to put messy lives into perfect prose?","chinese":"他是否正在嘗試將混亂的人生提煉成完美的韻文？"},{"english":"The butter is the fat which in the milk refines, the color and the taste similar edible butter.","chinese":"酥油是牛奶中提煉出來的脂肪，色與味類似食用黃油。"},{"english":"Turn the research into questions.","chinese":"把調查結論提煉成向面試官提的問題。"},{"english":"Ineos has a large traditional refinery business.","chinese":"英力士在傳統是由提煉業務中佔有很大比例。"},{"english":"Tallow alcohol can be further refined into cetyl and stearyl alcohols.","chinese":"牛脂醇可以進一步提煉成十六烷和十八烷醇。"},{"english":"My hometown Maoming is a city designed for refining oil.","chinese":"我家鄉茂名是爲了提煉石油而設計的。"},{"english":"How can you extract this information and sell it?","chinese":"你如何能夠提煉這種信息並出售它？"},{"english":"When that shall vade, my verse distills your truth.","chinese":"我筆下的詩歌卻會提煉出你的真。"},{"english":"Algae-based fuel can be added directly into existing refining and distribution systems;","chinese":"藻類燃料可以直接添加進當前的提煉和分銷系統。"},{"english":"Gulistan endeavors to seek a state and apply more precise words.","chinese":"她在尋找一種狀態，在提煉一種更加精確的語言。"},{"english":"At the same time he uses Beijing native language refined , give to personages with the life.","chinese":"同時他運用經過提煉的北京話，賦予人物以生命。"},{"english":"This medicine was extracted from the gallbladder of snakes.","chinese":"藥劑是用蛇膽提煉而成的。"},{"english":"We are all put on the potters wheel and He refines us like gold.","chinese":"我們都在他這窯匠的手中，他將我們提煉成金。"},{"english":"Scrap metal can Be recycled (turned) into \"gold and silver\".","chinese":"廢物利用，廢銅爛鐵可提煉出“金子”“銀子”。"}],"related":[{"definition":["to use\/to put to use"],"pinyin":["yun4 yong4"],"word":"運用"},{"definition":["to restore to the original state\/to reconstruct (an event)\/reduction (chemistry)"],"pinyin":["huan2 yuan2"],"word":"還原"},{"definition":["to interpret\/to comment and explain\/to annotate\/to perform (i.e. interpret a theatrical role)\/to decode\/interpretation\/annotation"],"pinyin":["quan2 shi4"],"word":"詮釋"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"體現"},{"definition":["to appear\/to emerge\/to present (a certain appearance)\/to demonstrate"],"pinyin":["cheng2 xian4"],"word":"呈現"},{"definition":["unique\/distinct\/having special characteristics"],"pinyin":["du2 te4"],"word":"獨特"},{"definition":["to decipher\/to decode\/to interpret"],"pinyin":["jie3 du2"],"word":"解讀"},{"definition":["to refine (a substance)\/to purify\/to refine (one's skills, writing etc)\/refined\/polished\/succinct\/skilled\/capable"],"pinyin":["jing1 lian4"],"word":"精煉"},{"definition":["to change\/to transform\/isomerization (chemistry)"],"pinyin":["zhuan3 hua4"],"word":"轉化"},{"definition":["to filter"],"pinyin":["shai1 xuan3"],"word":"篩選"},{"definition":["via"],"pinyin":["jing1 you2"],"word":"經由"},{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"word":"展現"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["to construct (often sth abstract, such as good relations)\/to set up\/to develop\/construction (abstract)\/architecture"],"pinyin":["jian4 gou4"],"word":"建構"},{"definition":["to combine\/to link\/to integrate\/binding\/CL:次[ci4]"],"pinyin":["jie2 he2"],"word":"結合"},{"definition":["to sum up\/to summarize\/to conclude from facts\/induction (method of deduction in logic)"],"pinyin":["gui1 na4"],"word":"歸納"}]}