{"definition":["to propose"],"pinyin":["ti2 qing3"],"simplified":["提请"],"rank":7770.0,"normalized_rank":0.10871238089908077,"fraction":0.000012544879319633866,"cumulative_fraction":0.906980618775139,"word":"提請","characters":[{"definition":["to carry (hanging down from the hand)\/to lift\/to put forward\/to mention\/to raise (an issue)\/upwards character stroke\/lifting brush stroke (in painting)\/scoop for measuring liquid"],"pinyin":["ti2"],"word":"提"},{"definition":["to ask\/to invite\/please (do sth)\/to treat (to a meal etc)\/to request"],"pinyin":["qing3"],"word":"請"}],"containing_words":[],"sentences":[{"english":"As requested by disciple Xin Ping I had written the new poem in calligraphy.","chinese":"應弟子心平之提請，我已寫了新詩之翰墨。"},{"english":"Each is brought to the ring and allowed to attack a picador who pricks them with a lance.","chinese":"每個提請環，並允許攻擊皮卡多爾誰用長矛刺破他們。"},{"english":"As requested by a disciple one poem is written in calligraphy.","chinese":"應一弟子提請，一詩作已手書成。"},{"english":"As requested by a disciple today's poem in calligraphy is attached.","chinese":"應一弟子的提請，今日的詩作寫成翰墨已附呈。"},{"english":"C. Discussion on Freshman English course for DFLL majors.","chinese":"有關檢討外文系大一英文課程案，提請討論。"},{"english":"As requested by disciple Hai Ying below I had written the name of the seal in calligraphy.","chinese":"應弟子海鸚如下的提請，我已手書一法印的名稱了。"},{"english":"I will write the Gatha you requested.","chinese":"我將寫您所提請的普賢大圓滿偈。"},{"english":"As requested by disciple Jing Xing below I had written the long mantra of Vaishravana Heavenly King in calligraphy.","chinese":"應弟子敬行以下之提請，我已手書了北方天王的長咒。"},{"english":"As requested by disciple Jing Xing below I had written one poem by Guru Chen in calligraphy.","chinese":"應弟子敬行以下的提請我己手書了陳上師的一首詩作。"},{"english":"As requested by disciple Ben Jing below I had written the calligraphy for his study.","chinese":"應弟子本敬以下之提請，我已爲他的書房寫了翰墨。"},{"english":"Then the court adjourns to deliberate onwhether any witnesses should be heard.","chinese":"隨後，法庭休庭，商討是否應該提請任何證人作證。"},{"english":"Let me draw your attention to just two.","chinese":"我僅提出兩方面，提請你們注意。"},{"english":"My unearthly hunger drew me away from you.","chinese":"我神祕的飢餓提請我離開你。"},{"english":"So Zhi Xuan's request below will be satisfied with more adornments added to the image.","chinese":"因此，智宣以下的提請將會有更多的裝飾在圖像中。"},{"english":"I. Language Instructor Christian Hein's application for change of appointment as full-time assistant professor.","chinese":"漢駿緯語言講師改聘專任助理教授申請案，提請討論。"},{"english":"Disciple Hong Fu spent 3 days to write up the request attached for these two poems.","chinese":"弟子虹福花了三天的時間寫了附呈之兩首詩的提請文。"}],"related":[]}