{"definition":["bill of lading"],"pinyin":["ti2 huo4 dan1"],"simplified":["提货单"],"rank":47508.0,"normalized_rank":0.6646985574972367,"fraction":1.8626745187582548e-7,"cumulative_fraction":0.998549545132742,"word":"提貨單","characters":[{"definition":["to carry (hanging down from the hand)\/to lift\/to put forward\/to mention\/to raise (an issue)\/upwards character stroke\/lifting brush stroke (in painting)\/scoop for measuring liquid"],"pinyin":["ti2"],"word":"提"},{"definition":["goods\/money\/commodity\/CL:個|个[ge4]"],"pinyin":["huo4"],"word":"貨"},{"definition":["bill\/list\/form\/single\/only\/sole\/odd number\/CL:個|个[ge4]","surname Shan"],"pinyin":["Shan4","dan1"],"word":"單"}],"containing_words":[],"sentences":[{"english":"BL is an essential document in international trade and shipment.","chinese":"提貨單是國際貿易和船運中一種很重要的單據。"},{"english":"Did you get the bill of lading for you last shipment?","chinese":"你們收到前一批貨的提貨單了沒有？"},{"english":"The goods don't match the bill of lading, something must have gone wrong.","chinese":"這些貨物與提貨單並不相符，一定是搞錯了。"},{"english":"BL and draft belong to the same category?","chinese":"提貨單和匯票屬於同一範疇了？"},{"english":"Please see attached a copy of the Ocean bl for you.","chinese":"請看附件中的海運提貨單副本。"},{"english":"And cover three types of inspections in the bill of lading release white chapter.","chinese":"並在白色提貨單上蓋三檢放行章。"},{"english":"Which description the carrier has no reasonable means of and is not part of the bill of lading.","chinese":"哪個描述載體沒有合理的手段和不作爲提貨單的部分。"},{"english":"Did you note the damage on the bill of lading?","chinese":"您把損壞情況註明在提貨單上了沒有？"},{"english":"A: You didn't note the damage on the bill of lading.","chinese":"你沒有在提貨單上註明損壞情況。"},{"english":"We enclose packing lists, bill of lading, invoice, certificate of origin and import licence.","chinese":"寄上包裝單，提貨單，發票，產地證和進口許可證。"},{"english":"The container number is listed in the bill of lading.","chinese":"集裝箱編號是列在提貨單裏的。"}],"related":[]}