{"definition":["commutation (electricity)"],"pinyin":["huan4 xiang4"],"simplified":["换向"],"rank":56566.0,"normalized_rank":0.7914317294642732,"fraction":6.744166361021267e-8,"cumulative_fraction":0.9996297915416924,"word":"換向","characters":[{"definition":["to exchange\/to change (clothes etc)\/to substitute\/to switch\/to convert (currency)"],"pinyin":["huan4"],"word":"換"},{"definition":["surname Xiang","towards\/to face\/to turn towards\/direction\/to support\/to side with\/shortly before\/formerly\/always\/all along\/(suffix) suitable for ...\/oriented to ..."],"pinyin":["Xiang4","xiang4"],"word":"向"}],"containing_words":[],"sentences":[{"english":"The mica between the segments.","chinese":"換向片之間的雲母。"},{"english":"Detailed analysis to the pump sending system of the concrete pump has carried on.","chinese":"混凝土泵泵送系統油缸的換向平順性問題。"},{"english":"There is a large amount of energy wasted due to the fraction of commutator.","chinese":"換向器引起的摩擦損耗了大量的能量。"},{"english":"Flame changeover is an important component in the production process of glass kiln.","chinese":"火焰換向是玻璃窯爐生產工藝中的一個重要組成部分。"},{"english":"A high-reliability air-actuated direction valve is presented in this paper.","chinese":"本文介紹了一種工作高度可靠的換向氣閥。"},{"english":"The paper analyses the commutation processes in polyphase brushless DC generators.","chinese":"本文分析了多相無刷直流發電機的換向過程。"},{"english":"Suppose that both the regulating handle and the reversing handle are at the stop position.","chinese":"假設調節手柄和換向手柄都在停止位置。"},{"english":"Each period of DC excitation and forced commutation drives is set with an external capacitor.","chinese":"直流勵磁時間和強制換向時間都由一個外部電容設定。"},{"english":"K25JD-BW series is plate fitting shut-off directional valves 5\/2 way.","chinese":"BW系列是二位五通板接截止式換向閥。"},{"english":"Move the reversing handle to the ahead side and to the astern side alternatively.","chinese":"移動換向手柄到正車側和倒車側交變地。"},{"english":"The utility model relates to an end-face sealed manual three-position four-way reversing rotary valve.","chinese":"本實用新型涉及一種端面密封手動三位四通換向轉閥。"},{"english":"K25JK-BW series is plate fitting shut-off directional valves 5\/2 way.","chinese":"BW系列是二位五通板接截止式換向閥。"},{"english":"Multi—way valve manually control, smooth movements, system reliability.","chinese":"手動多路換向閥控制，動作平穩，系統可靠。"},{"english":"And it's realized that the scraping is in continuous way and timer by two changing direction systems.","chinese":"通過兩套換向系統實現連續或定時刮泥。"},{"english":"There are sparks at the commutator. Please find out the trouble and put it right.","chinese":"換向器上有火花，請找出故障並排除它。"},{"english":"Variable magnetic pole DC motor can resolve the problem of commutator existing in the traditional DC motor.","chinese":"變磁極性直流電機解決了傳統直流電機的換向器問題。"}],"related":[]}