{"definition":["to exchange (sth) for (sth else)\/to replace with\/to convert into"],"pinyin":["huan4 cheng2"],"simplified":["换成"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"換成","characters":[{"definition":["to exchange\/to change (clothes etc)\/to substitute\/to switch\/to convert (currency)"],"pinyin":["huan4"],"word":"換"},{"definition":["surname Cheng","to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth"],"pinyin":["Cheng2","cheng2"],"word":"成"}],"containing_words":[],"sentences":[{"english":"It is transformed into visible light image through optical correlator.","chinese":"它通過光學相關器轉換成可見光圖像信息。"},{"english":"Smiling at the Dornish knights, she switched back to the Common Tongue.","chinese":"邊對多恩騎士微笑，她邊轉換成通用語。"},{"english":"He wanted to convert his dollars into Japanese yen.","chinese":"他想將美元換成日幣。"},{"english":"The other professor was replaced by two teachers.","chinese":"另一個班的教授換成了兩名教師。"},{"english":"This is an open top outrigger kayak that converts into a tent with ease.","chinese":"這是一個開放前支腿皮艇可以轉換成輕鬆帳篷。"},{"english":"Just got done setting up a few new computer to send down to our Georgia facility to replace some 6 year old computers.","chinese":"把一些在喬治亞州用了六年的舊電腦換成新的。"},{"english":"I would like to change the room to a double, not single.","chinese":"我想換成雙人房，而不要單人房。"},{"english":"We substituted red balls for blue balls, to see if the baby could notice.","chinese":"我們把藍球換成了紅球以觀察嬰兒是否注意到了。"},{"english":"I'm sorry, May I have it changed the small plate?","chinese":"對不起，我把它換成小盤子好嗎？"},{"english":"After the earlier invasion, Celtic had been replaced with English.","chinese":"早期的侵略後，凱爾特語被替換成英語。"},{"english":"All you have to do is simply switch the salt shaker with sugar!","chinese":"在這個惡作劇裏，你所做的僅僅是把鹽罐換成糖罐。"},{"english":"I'd some coins for this hundred yuan note.","chinese":"我想把這一百元紙幣換成硬幣。"},{"english":"Some parents do not want to make the switch for even their school-age children.","chinese":"有些家長甚至不願讓開始上學的孩子換成電子書。"},{"english":"Let me change the dollar bill for coins.","chinese":"讓我把這張美元的紙鈔換成硬幣。"},{"english":"By default, all packages are transformed to folders.","chinese":"默認條件下，所有的包都被轉換成了文件夾。"},{"english":"Next station, Hongshan Square, interchange station for the Line 2.","chinese":"下一站，洪山廣場，乘客可以換成2號線。"}],"related":[{"definition":["lit. a good horse doesn't turn around and graze the same patch again (idiom)\/fig. once you've moved on, don't go back again (romantic relationship, job etc)\/leave the past behind"],"pinyin":["hao3 ma3 bu4 chi1 hui2 tou2 cao3"],"word":"好馬不吃回頭草"},{"definition":["see the opportunity and act (idiom); to act according to circumstances\/to play it by ear\/to use one's discretion"],"pinyin":["jian4 ji1 xing2 shi4"],"word":"見機行事"},{"definition":["please excuse me for not complying\/to politely decline"],"pinyin":["jing4 xie4 bu4 min3"],"word":"敬謝不敏"},{"definition":["lit. firing after the horse\/fig. belated action\/giving advice in hindsight"],"pinyin":["ma3 hou4 pao4"],"word":"馬後炮"},{"definition":["melting point (of lubricating oil)"],"pinyin":["di1 dian3"],"word":"滴點"},{"definition":["conjoined twins"],"pinyin":["lian2 ti3 ying1"],"word":"連體嬰"},{"definition":["to die from excessive ejaculation"],"pinyin":["jing1 jin4 ren2 wang2"],"word":"精盡人亡"},{"definition":["A rabbit doesn't eat the grass by its own burrow (idiom); One shouldn't do anything to harm one's neighbors."],"pinyin":["tu4 zi5 bu4 chi1 wo1 bian1 cao3"],"word":"兔子不吃窩邊草"},{"definition":["to talk nonsense\/to bullshit"],"pinyin":["shuo1 fei4 hua4"],"word":"說廢話"},{"definition":["see 屎蚵螂[shi3 ke1 lang2]"],"pinyin":["shi3 ke2 lang4"],"word":"屎殼郎"},{"definition":["needlework\/sewing"],"pinyin":["zhen1 xian4 huo2"],"word":"針線活"},{"definition":["paper tape\/ticker tape\/paper streamer"],"pinyin":["zhi3 dai4"],"word":"紙帶"},{"definition":["to puff up\/to swell up\/to inflate\/to blow air into sth\/(fig.) to encourage\/to support"],"pinyin":["gu3 qi4"],"word":"鼓氣"},{"definition":["to drown sb in a wicker basket, a form of 沉潭[chen2 tan2]"],"pinyin":["jin4 zhu1 long2"],"word":"浸豬籠"},{"definition":["bull terrier"],"pinyin":["niu2 tou2 geng3"],"word":"牛頭梗"},{"definition":["to claw wildly\/to scratch frantically\/to arrest people indiscriminately"],"pinyin":["luan4 zhua1"],"word":"亂抓"}]}