{"definition":["impossible to get rid of"],"pinyin":["hui1 zhi1 bu4 qu4"],"simplified":["挥之不去"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"揮之不去","characters":[{"definition":["to wave\/to brandish\/to command\/to conduct\/to scatter\/to disperse"],"pinyin":["hui1"],"word":"揮"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"Xin qiji once said: \"young not sorrow taste\".","chinese":"年輕人，會有一些揮之不去的煩惱。"},{"english":"The danger of war is looming, and hot issues keep cropping up.","chinese":"戰爭陰雲揮之不去，熱點問題此起彼伏。"},{"english":"For any viewer, the effect is no less haunting.","chinese":"對於所有觀影者來說，這種效果也是揮之不去的。"},{"english":"This is an image that I will always keep in my head.","chinese":"而這個形象也一直保存在我的腦海中，揮之不去。"},{"english":"It's a long list and soon I can't get it off my mind.","chinese":"他的禮單挺長，且在我腦海中揮之不去。"},{"english":"When I arrived at the camp I put my bag down and just cried. That feeling still won't go.","chinese":"一到營房放下包就開始哭泣，那種感覺至今揮之不去。"},{"english":"It enveloped the story in a fog of mystification.","chinese":"籠罩這個問題的迷霧揮之不去。"},{"english":"Loneliness as a theme has been sticking to the Latin-American literature.","chinese":"孤獨是拉美文學中一個揮之不去的主題。"},{"english":"Fear is nothing more than a lingering emotion that&rsquo; s fueled by your imagination.","chinese":"恐懼不過是想象力產生的一種揮之不去的情感。"},{"english":"The puzzle niggled away in Arnold's mind.","chinese":"這個謎團在阿諾德腦海裏揮之不去。"},{"english":"It plays on every serious reader’s lingering sense of inadequacy.","chinese":"他作用於對所有認真的讀者揮之不去的不適感。"},{"english":"The name Liuyuan or Lingering Garden actually means lingering in the world.","chinese":"柳園的名稱或留園實際上意味着在世界上揮之不去。"},{"english":"But the lingering question is, Why at sea?","chinese":"但另一個揮之不去的問題是，爲什麼選擇的是海葬？"},{"english":"I do think gun nuts have a power hang-up.","chinese":"我的確認爲，槍迷們有一種揮之不去的權力慾。"}],"related":[]}