{"definition":["volatile oil (in general)\/gasoline"],"pinyin":["hui1 fa1 you2"],"simplified":["挥发油"],"rank":54792.0,"normalized_rank":0.7666111678535951,"fraction":8.34992025650252e-8,"cumulative_fraction":0.9994960932608408,"word":"揮發油","characters":[{"definition":["to wave\/to brandish\/to command\/to conduct\/to scatter\/to disperse"],"pinyin":["hui1"],"word":"揮"},{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"},{"definition":["oil\/fat\/grease\/petroleum\/to apply tung oil, paint or varnish\/oily\/greasy\/glib\/cunning"],"pinyin":["you2"],"word":"油"}],"containing_words":[],"sentences":[{"english":"Conclusion Ether soaking method can be used for the qualitative analysis of volatile oil from Lignum Santali.","chinese":"乙醚浸漬法可用於檀香揮發油的定性分析。"},{"english":"The research aimed to analyze the components and antibacterial activities of essential oils from Salvia plebeia R.","chinese":"分析荔枝草揮發油化學成分並對其抑菌活性進行研究。"},{"english":"The volatile oils of Zanthoxylum schinifolium were extracted by water vapor distillation.","chinese":"採用水蒸氣蒸餾法提取精製香椒子中的揮發油。"},{"english":"In recent years, many studies have been done in the essential oil.","chinese":"近年來關於香附的研究主要是揮發油。"},{"english":"ObjectiveTo explore the chemical components of the essential oil of Chimonanthus nitens Oliv.","chinese":"目的探討江西婺源產山蠟梅葉揮發油的化學成分。"},{"english":"OBJECTIVE To analyze the chemical constituents of essential oil from Sibiraea angustata (Rehd. ) Hand.","chinese":"目的對藏藥柳茶的揮發油進行化學成分分析。"},{"english":"ObjectiveTo study the chemical components in the volatile oil from the leaf of Epimedium wushanense T.","chinese":"目的研究巫山淫羊藿葉中揮發油的化學成分。"},{"english":"Objective To analyze the volatile constituents of Evodia lepta leaves collected in Guangzhou Conghua, Guangdong province.","chinese":"目的分析廣東從化地區三叉苦葉揮發油成分。"},{"english":"OBJECTIVE To study on the chemical components of the essential oil from Dictamnus dasyarpus Turcz.","chinese":"目的研究白鮮皮揮發油的化學成分。"},{"english":"Objective To study the chemical constituents of the volatile oil from Hedychium coronarium roots.","chinese":"目的研究姜花塊根揮發油的化學成分。"},{"english":"Objectives:to determine and analyze the content and chemical components of volatile oil in fresh flower of Apocynum venetum L.","chinese":"測定寧夏羅布麻鮮花揮發油的含量及化學成分。"},{"english":"Results showed that content of volatile oil was decreased and its quality changed after processing.","chinese":"結果表明，炮製後揮發油含量減少，質量發生變化。"},{"english":"ObjectiveTo establish a fingerprint analysis of Origanum vulgare L…","chinese":"目的建立牛至揮發油的指紋圖譜分析方法。"},{"english":"Objective To study the mechanism relating to antipruritic effect of the fructus cnidii volatile oil (FV).","chinese":"目的研究蛇牀子揮發油止癢作用的機制。"},{"english":"The essential oil was extracted from Citrus aurantium'Daidai' by steam distillation.","chinese":"採用水蒸氣蒸餾法從代代花中提取揮發油。"},{"english":"Objectives: to determine and analyze the content and chemical components of volatile oil in fresh flower of Apocynum venetum L. in Ningxia.","chinese":"測定寧夏羅布麻鮮花揮發油的含量及化學成分。"}],"related":[{"definition":["tannin"],"pinyin":["rou2 zhi4"],"word":"鞣質"},{"definition":["amylase"],"pinyin":["dian4 fen3 mei2"],"word":"澱粉酶"},{"definition":["flavonoid (biochemistry)"],"pinyin":["lei4 huang2 tong2"],"word":"類黃酮"},{"definition":["flavonoid (chemistry)"],"pinyin":["huang2 tong2 lei4 hua4 he2 wu4"],"word":"黃酮類化合物"},{"definition":["choline (amine related to vitamin B complex)"],"pinyin":["dan3 jian3"],"word":"膽鹼"},{"definition":["serine (Ser), an amino acid"],"pinyin":["si1 an1 suan1"],"word":"絲氨酸"},{"definition":["volatility"],"pinyin":["hui1 fa1 xing4"],"word":"揮發性"},{"definition":["flavone"],"pinyin":["huang2 tong2"],"word":"黃酮"},{"definition":["fibrous protein"],"pinyin":["xian1 wei2 dan4 bai2"],"word":"纖維蛋白"},{"definition":["tannic acid (loanword)"],"pinyin":["dan1 ning2 suan1"],"word":"單寧酸"},{"definition":["citric acid"],"pinyin":["ning2 meng2 suan1"],"word":"檸檬酸"},{"definition":["alkaloid"],"pinyin":["sheng1 wu4 jian3"],"word":"生物鹼"},{"definition":["potassium chloride KCl"],"pinyin":["jia3 yan2"],"word":"鉀鹽"},{"definition":["inorganic salt"],"pinyin":["wu2 ji1 yan2"],"word":"無機鹽"},{"definition":["Theophylline"],"pinyin":["cha2 jian3"],"word":"茶鹼"},{"definition":["chlorophyll"],"pinyin":["ye4 lu:4 su4"],"word":"葉綠素"}]}