{"definition":["profit and loss\/increase and decrease"],"pinyin":["sun3 yi4"],"simplified":["损益"],"rank":12173.0,"normalized_rank":0.17031606340855987,"fraction":0.000005969755050518716,"cumulative_fraction":0.9449662672367116,"word":"損益","characters":[{"definition":["to decrease\/to lose\/to damage\/to harm\/(coll.) to speak sarcastically\/to deride\/caustic\/mean\/one of the 64 hexagrams of the Book of Changes (䷨)"],"pinyin":["sun3"],"word":"損"},{"definition":["benefit\/profit\/advantage\/beneficial\/to increase\/to add\/all the more","surname Yi"],"pinyin":["Yi4","yi4"],"word":"益"}],"containing_words":[{"definition":["income statement (US)\/profit and loss account (UK)"],"pinyin":["sun3 yi4 biao3"],"word":"損益表"}],"sentences":[{"english":"It appears as a line in the profit and loss statement.","chinese":"它以損益表上的一行項目出現。"},{"english":"All exchange differences are dealt with in the profit and loss account.","chinese":"所有匯兌盈虧均計入損益賬內。"},{"english":"We’ve talked about the Income Statement and the Balance Sheet.","chinese":"我們已經談了損益表和資產負債表。"},{"english":"A P&L can only tell you so much about a business.","chinese":"一張損益表可以告訴你一家企業的很多情況。"},{"english":"The cost-benefit analysis is an important method of analyzing environmental economic gain and loss.","chinese":"費用效益分析是進行環境經濟損益分析的重要方法。"},{"english":"The income statement account usually want to be reflect by their monthly total or by the year-to-date.","chinese":"損益表賬戶通常反映月份合計或年初至今的信息。"},{"english":"A second step was to identify the drivers, benefits and obstacles in this process. This chapter will investigate these questions.","chinese":"第二步是確定這一過程中所帶來的損益值。"},{"english":"I almost never look at a profit and loss statement without also looking at a balance sheet.","chinese":"我幾乎從來不會甩開資產負債表而單獨地看損益表。"},{"english":"That’s what the income statement is designed to reveal.","chinese":"損益表的設計，用以揭示的正是盈利能力。"},{"english":"The analysis on it should base on the accruals and matching conceptions.","chinese":"用損益表進行分析時要注意權責發生制和配比原則。"},{"english":"The non-recurring gains and losses has combed the literature and commentary.","chinese":"本文對非經常性損益相關文獻進行了梳理和述評。"},{"english":"The present-value-accountancy has a direct impact on the loss-and-gain accounting of an enterprise.","chinese":"現時價值會計直接影響着企業的損益覈算。"},{"english":"The presentation Google uses is quite common.","chinese":"谷歌的損益表採用了普通的列報方式。"},{"english":"The practice of inappropriately misconstruing income statements for the purpose of pleasing investors and inflating stock prices.","chinese":"不當地編制損益表以取悅投資者及提高股價。"},{"english":"That will create a large one time expense on your profit and loss statement.","chinese":"那將在損益表上形成一次性高額費用。"},{"english":"Determines how payoff streams are altered by combining securities. Coconvenes with FIN 531.","chinese":"決定損益狀況如何隨着混合證券的變化而改變。"}],"related":[{"definition":["an item in accounts\/an entry"],"pinyin":["zhang4 mu4"],"word":"賬目"},{"definition":["reward and punishment"],"pinyin":["shang3 fa2"],"word":"賞罰"},{"definition":["my limited view (lit. view through a thin tube)\/my limited understanding\/my opinion (humble)"],"pinyin":["guan3 jian4"],"word":"管見"},{"definition":["to impair\/to degrade\/to decrease\/to reduce\/to weaken\/to detract from\/impairment (e.g. of financial assets)"],"pinyin":["jian3 sun3"],"word":"減損"},{"definition":["pragmatic\/flexible\/to act differently in different situations\/to accommodate to circumstances"],"pinyin":["bian4 tong1"],"word":"變通"},{"definition":["to decide (in a meeting)\/to resolve (i.e. pass a resolution)"],"pinyin":["yi4 jue2"],"word":"議決"},{"definition":["scholastic attainments"],"pinyin":["xue2 li4"],"word":"學力"},{"definition":["to be in overall charge\/to oversee"],"pinyin":["zong1 li3"],"word":"綜理"},{"definition":["norm\/standard\/standard of reference\/base\/base point\/base line\/benchmark\/reference point\/reference frame\/criterion\/data"],"pinyin":["ji1 zhun3"],"word":"基準"},{"definition":["priority\/whether sth is urgent"],"pinyin":["huan3 ji2"],"word":"緩急"},{"definition":["to do whatever is expedient"],"pinyin":["quan2 bian4"],"word":"權變"},{"definition":["to reduce\/to lessen (pain etc)\/to deduct (from taxes)"],"pinyin":["jian3 chu2"],"word":"減除"},{"definition":["to consider (a matter)\/to deliberate"],"pinyin":["can1 zhuo2"],"word":"參酌"},{"definition":["norm\/standard\/criterion"],"pinyin":["zhun3 ze2"],"word":"準則"},{"definition":["to attribute\/to ascribe"],"pinyin":["gui1 yin1"],"word":"歸因"},{"definition":["to make a catalogue\/catalogue\/list"],"pinyin":["bian1 mu4"],"word":"編目"}]}