{"definition":["search party"],"pinyin":["sou1 suo3 dui4"],"simplified":["搜索队"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"搜索隊","characters":[{"definition":["to search"],"pinyin":["sou1"],"word":"搜"},{"definition":["surname Suo\/abbr. for 索馬里|索马里[Suo3 ma3 li3], Somalia","to search\/to demand\/to ask\/to exact\/large rope\/isolated"],"pinyin":["Suo3","suo3"],"word":"索"},{"definition":["squadron\/team\/group\/CL:個|个[ge4]"],"pinyin":["dui4"],"word":"隊"}],"containing_words":[],"sentences":[{"english":"I wanted to tell everybody about the murderer and organize a search party. Then I thought about the story I would have to tell the police.","chinese":"我想告訴所有人關於那兇手的事情並組織一個搜索隊。"},{"english":"The survivors wandered about the jungle for days before being picked up by a search party.","chinese":"倖存者在叢林中游蕩了好幾天，才被搜索隊救出來。"},{"english":"The search party found the lost person.","chinese":"搜索隊發現了失蹤的人。"},{"english":"Imperial search teams found Dodonna's wounded body and took the officer captive.","chinese":"帝國搜索隊找到身負重傷的多登納，俘虜了這位軍官。"},{"english":"A search party was organized to look for the man trapped in the snow.","chinese":"雪中被困的人，我們成立了一個搜索隊。"},{"english":"Even if they sent out a search party, they would never catch the monster.","chinese":"就算他們派出了搜索隊，他們也不可能抓得住那怪物。"},{"english":"Search parties were sent_out to look for survivors.","chinese":"搜索隊被派出去尋找倖存者。"},{"english":"Search teams were sent to the area but struggled to get through because routes were blocked.","chinese":"搜索隊已經派出，然而由於道路阻塞，目前很難打通。"},{"english":"These antioxidants seek out cell-damaging free radicals and destroy them.","chinese":"這些抗氧化物會搜索隊細胞有害的自由基並摧毀它們。"},{"english":"The one used depended on where the search parties and slave catchers were stationed.","chinese":"取決於使用的搜索隊和奴隸捕手駐紮的地方。"},{"english":"Nevertheless, we hear of search parties going out there to find lost travellers .","chinese":"可是，聽說還是有搜索隊到那裏去尋找迷路的旅遊者。"},{"english":"The search party spread out over the moor.","chinese":"搜索隊在荒草地分散行動。"}],"related":[]}