{"definition":["to mess up\/to mismanage\/to bungle\/to confuse\/to muddle"],"pinyin":["gao3 luan4"],"simplified":["搞乱"],"rank":37174.0,"normalized_rank":0.5201124900312006,"fraction":4.979296852260507e-7,"cumulative_fraction":0.9952452288539958,"word":"搞亂","characters":[{"definition":["to do\/to make\/to go in for\/to set up\/to get hold of\/to take care of"],"pinyin":["gao3"],"word":"搞"},{"definition":["in confusion or disorder\/in a confused state of mind\/disorder\/upheaval\/riot\/illicit sexual relations\/to throw into disorder\/to mix up\/indiscriminate\/random\/arbitrary"],"pinyin":["luan4"],"word":"亂"}],"containing_words":[],"sentences":[{"english":"The refusal of the actor turned all our arrangements for the performance topsy-turvy.","chinese":"那個演員拒絕出臺把我們整個演出安排都搞亂了。"},{"english":"It's such a neat room. We'd better not mess anything up.","chinese":"這房間真是整潔，我們最好不要把東西搞亂了。"},{"english":"The system munged my whole week's work.","chinese":"這個系統把我一整週的工作都搞亂了。"},{"english":"She jumbles the words when she is supposed to write a sentence.","chinese":"將要寫句子的時候，她搞亂了字詞的次序。"},{"english":"The bank has been messing my account about again.","chinese":"這家銀行又把我的賬搞亂了。"},{"english":"But the digital trail is littered with intriguing bits of evidence.","chinese":"但是數字尾跡被有興趣查證的碎片搞亂了。"},{"english":"My son disarranged the papers on my desk.","chinese":"我兒子把我桌子上的紙張搞亂了。"},{"english":"Because it confuses the model and adds very little useful information. Compare the three models in Figure 1","chinese":"因爲它搞亂了模型，只增加了很少的有用信息。"},{"english":"The labor Party snarled up the opposition in an election.","chinese":"勞工黨工競選中搞亂了反對黨陣線。"},{"english":"Our system of appetite control is completely unpicked by the junk food diet.","chinese":"我們的食慾控制系統完全被垃圾食品搞亂了。"},{"english":"It worked well for me but If you mess up you have to cast a new faceplate .","chinese":"它運作良好，對我，但如果你搞亂你投一個新的面板。"},{"english":"This look just screams spring and is almost impossible to mess up.","chinese":"這看起來就像在春天尖叫，幾乎是不可能搞亂的。"},{"english":"If you have messed up relationships, you are a pushover for Satan.","chinese":"如果你搞亂了關係，你是撒旦容易擊敗的人。"},{"english":"Our travel arrangements have been messed up by the ticket office.","chinese":"我們的旅行安排被售票處搞亂了。"},{"english":"When speculators confuse the market, none will make money.","chinese":"投機者把市場搞亂了，誰也賺不了錢。"}],"related":[]}