{"definition":["to seize (the strategic high ground)"],"pinyin":["qiang3 zhan4"],"simplified":["抢占"],"rank":9316.0,"normalized_rank":0.13034292669959285,"fraction":0.000009339356611372696,"cumulative_fraction":0.9237048882060678,"word":"搶佔","characters":[{"definition":["see 搶風|抢风[qiang1 feng1]","to fight over\/to rush\/to scramble\/to grab\/to rob\/to snatch"],"pinyin":["qiang1","qiang3"],"word":"搶"},{"definition":["variant of 占[zhan4]"],"pinyin":["zhan4"],"word":"佔"}],"containing_words":[],"sentences":[{"english":"But they have snatched the market niche for big, heavy-duty tires.","chinese":"但國內廠家搶佔了重型輪胎市場。"},{"english":"While you're out leveling grab a quest each time you get.","chinese":"而你在外面找平搶佔追求每一次當你得到的。"},{"english":"The emergency of online media has rapidly grabbed the survival space of article-based media.","chinese":"網絡媒體出現後迅速搶佔了紙質媒體的生存空間。"},{"english":"He grabbed off the best seat.","chinese":"他搶佔了最好的座位。"},{"english":"Certain critical sections of the kernel code are locked against preemption.","chinese":"可以鎖定內核代碼的關鍵部分，不允許搶佔。"},{"english":"Preempt the application for very short deterministic periods.","chinese":"搶佔應用程序一小段確定的時間。"},{"english":"For the government, the task is to get ahead of the crisis.","chinese":"對政府來說，首要任務就是要快速反應，搶佔先機。"},{"english":"The kernel preemption case is handled by the spinlock code itself.","chinese":"內核的搶佔機制被它自己操作自旋鎖的代碼所控制。"},{"english":"The creatures devourhuge quantities of plankton, thus depriving small fish of the food they need.\"This","chinese":"水母吞食大量浮游生物，搶佔小魚小蝦的食物來源。"},{"english":"Leo sulks that Capricorn is at the head of the table.","chinese":"獅子座因被摩羯座搶佔了餐桌的主位而忿忿不平。"},{"english":"It is a sure way to grab headlines and rattle the neighborhood.","chinese":"那是一個搶佔頭條和震撼毗鄰地區最有效的方法。"},{"english":"Mike volunteered to detail your car. He also fumigated your room.","chinese":"邁克搶佔了的你小車，他用煙燻了你的房間。"},{"english":"Enterprises have to seize market share.","chinese":"企業要搶佔市場份額。"},{"english":"However, Microsoft did not timely at this time to seize the beachhead Internet.","chinese":"但微軟卻並沒有在此時及時的搶佔互聯網的灘頭。"}],"related":[]}