{"definition":["to rush (to do sth urgent)\/to try to be the first\/to forestall"],"pinyin":["qiang3 xian1"],"simplified":["抢先"],"rank":11506.0,"normalized_rank":0.1609838680340828,"fraction":0.000006559650640667784,"cumulative_fraction":0.9407930608836697,"word":"搶先","characters":[{"definition":["see 搶風|抢风[qiang1 feng1]","to fight over\/to rush\/to scramble\/to grab\/to rob\/to snatch"],"pinyin":["qiang1","qiang3"],"word":"搶"},{"definition":["early\/prior\/former\/in advance\/first"],"pinyin":["xian1"],"word":"先"}],"containing_words":[],"sentences":[{"english":"I was about to say “the biggest one” while my brother took one step ahead and said what I wanted to say.","chinese":"我剛想說要最大最紅的一個，卻被弟弟搶先說了出來。"},{"english":"The US Navy verified the information, and struck first.","chinese":"美國海軍證實了情報，搶先發起了攻擊。"},{"english":"Let's anticipate the enemy's move and occupy that city.","chinese":"我們要制敵先機搶先攻佔那個城市。"},{"english":"All previous \"devil\" can beat step, escape the net of police bs.","chinese":"歷次“魔鬼”都能搶先一步，逃離警方佈下的羅網。"},{"english":"What kind of ticket do you wish: first clbum or economy?","chinese":"您想要哪種票，甲第艙，搶先。還是經濟艙？"},{"english":"Scarlett for Duhen, the first Korean married to Melanie's brother Charles.","chinese":"郝思嘉出於妒恨，搶先嫁給了韓媚蘭的弟弟查爾斯。"},{"english":"He beat me to the punch and asked me the very same question first.","chinese":"他搶先一步問了我同樣的問題。"},{"english":"Using project progress and task assignment information proactively makes more sense.","chinese":"搶先地使用項目進展和任務分配信息是更有意義的。"},{"english":"Snapped up to four happy, however, and spittor was forced to kiss nine younger sister.","chinese":"四喜氣不過，便搶先出手，金蟾卻強行去吻九妹。"},{"english":"They have to get their name in front of these people first.","chinese":"酒店需要搶先將自己的名字顯示在這類人眼前。"},{"english":"Sure, front-running has always been a problem.","chinese":"不錯，搶先交易一直是個問題。"},{"english":"ACM-V full-automatic cementing equipment owns international advanced technical level at present.","chinese":"全自動固井設備已具備當今國際搶先的技能程度。"},{"english":"Chicago Bulls coasted home on a 20-point fat.","chinese":"芝加哥公牛隊以20分的搶先比分獲勝。"},{"english":"I left the room to forestall involvements.","chinese":"我搶先離開了這房間以免牽累。"},{"english":"But, whatever happens, the Tories have got a headstart over Labour today.","chinese":"然而不論發生什麼，保守黨已經搶先工黨取得了主動。"},{"english":"I looked everywhere for the creature Gollum but the enemy found him first.","chinese":"我四處尋找古魯姆，可敵人搶先一步找到了他。"}],"related":[{"definition":["on the eve of\/to be about to\/to be on the verge of"],"pinyin":["ji2 jiang1"],"word":"即將"},{"definition":["bean vermicelli\/mung bean starch noodles\/Chinese vermicelli\/cellophane noodles\/CL:把[ba3]\/fan (loanword)\/enthusiast for sb or sth"],"pinyin":["fen3 si1"],"word":"粉絲"},{"definition":["public\/to publish\/to make public"],"pinyin":["gong1 kai1"],"word":"公開"},{"definition":["to plan\/to lay out\/to design"],"pinyin":["qi3 hua4"],"word":"企劃"},{"definition":["meeting place\/place where people gather\/CL:個|个[ge4]"],"pinyin":["hui4 chang3"],"word":"會場"},{"definition":["to sell"],"pinyin":["fa1 shou4"],"word":"發售"},{"definition":["to go on stage\/fig. to appear on the scene\/used in advertising to mean new product"],"pinyin":["deng1 chang3"],"word":"登場"},{"definition":["poster\/playbill\/notice"],"pinyin":["hai3 bao4"],"word":"海報"},{"definition":["to ratchet up\/to raise (expectations etc)\/to increase (a quota, a position in the market etc)\/to up the ante\/(computing) to encode"],"pinyin":["jia1 ma3"],"word":"加碼"},{"definition":["to go online\/to put sth online"],"pinyin":["shang4 xian4"],"word":"上線"},{"definition":["popular\/hot\/in vogue"],"pinyin":["re4 men2"],"word":"熱門"},{"definition":["to release\/to make available\/to liberate\/disengagement"],"pinyin":["shi4 chu1"],"word":"釋出"},{"definition":["to forecast\/to predict\/advance notice"],"pinyin":["yu4 gao4"],"word":"預告"},{"definition":["in turn\/successively\/one after the other\/bit by bit"],"pinyin":["lu4 xu4"],"word":"陸續"},{"definition":["to show oneself\/to appear\/(of a deity) to appear in the flesh"],"pinyin":["xian4 shen1"],"word":"現身"},{"definition":["to buy frenetically\/to snap up (bargains, dwindling supplies etc)"],"pinyin":["qiang3 gou4"],"word":"搶購"}]}