{"definition":["to buy frenetically\/to snap up (bargains, dwindling supplies etc)"],"pinyin":["qiang3 gou4"],"simplified":["抢购"],"rank":11233.0,"normalized_rank":0.1571642438403313,"fraction":0.00000682678969782512,"cumulative_fraction":0.9389655843443226,"word":"搶購","characters":[{"definition":["see 搶風|抢风[qiang1 feng1]","to fight over\/to rush\/to scramble\/to grab\/to rob\/to snatch"],"pinyin":["qiang1","qiang3"],"word":"搶"},{"definition":["to buy\/to purchase"],"pinyin":["gou4"],"word":"購"}],"containing_words":[],"sentences":[{"english":"They are eagerly trying to buy the shoes and boots.","chinese":"她們都在急切地搶購各種鞋靴。"},{"english":"Rapid inflation and above curtailments acquired by agitation buying.","chinese":"迅猛的通貨膨脹和搶購造成重大的商品缺乏。"},{"english":"A host of government conglomerates have snapped up coal mining companies in Shanxi Province.","chinese":"一大批國有企業進入山西搶購煤礦公司。"},{"english":"For fare that the electricity will cut off, people storm into convenience store to grab candles.","chinese":"爲了勉於斷電之苦，人們踊進便利商店搶購蠟燭。"},{"english":"A rush of salt in the multilateral tide, under the rumours, gradually died down.","chinese":"一場食鹽的搶購潮，在多方闢謠之下，逐漸平息。"},{"english":"Studio flats meant for artists-in-residence get snapped up by bankers.","chinese":"藝術家們居住的單間公寓遭到銀行業者的搶購。"},{"english":"Silly city people panic buying salt, afraid that all sea salt from today on will have been exposed to radiation.","chinese":"小市民瘋狂搶購鹽，恐怕日後的海鹽受到核輻射。"},{"english":"Elsewhere supermarkets reported a surge in panic-buying as shoppers tied to stockpile food supplies.","chinese":"其他地區的超市裏，羣衆爲了搶購儲存食物一團慌亂。"},{"english":"Just 12 bottles were made and the company has already sold out.","chinese":"該公司釀製的區區12瓶“歷史終點”已經搶購一空。"},{"english":"But not all salt-buyers were looking for radiation protection.","chinese":"然而，並非所有的食鹽搶購者都是出於防輻射的目的。"},{"english":"Don't lose more by joining the stampede of buy-high, sell-low market timers.","chinese":"不要應爲參與高買低賣的搶購風潮而虧損更多。"},{"english":"The rush for rice in Hong Kong began after wholesale prices spiked in Thailand.","chinese":"泰國的大米批發價格猛漲之後，香港人開始搶購大米。"},{"english":"Food always comes in the mornings - it just gets bought up by people caught up in things.","chinese":"食品總在早上供應，而且總被搶購的人買走。"},{"english":"This is one of the factors that create unnecessary speculation and also panic buying,” he said.","chinese":"這些都是造成不必要的市場投機和搶購的因素之一。"},{"english":"Over the National Day holiday in early October, retailers say large flat-screen TVs flew off the shelves.","chinese":"國慶節當日，零售商說人們搶購大型純平電視。"},{"english":"Rumor spread the prices would go up, many peopel stampeded into a wave of panic buying.","chinese":"謠傳物價要上漲，很多人捲入了搶購的風潮中。"}],"related":[{"definition":["to rush (to do sth urgent)\/to try to be the first\/to forestall"],"pinyin":["qiang3 xian1"],"word":"搶先"},{"definition":["see 搶風|抢风[qiang1 feng1]","to fight over\/to rush\/to scramble\/to grab\/to rob\/to snatch"],"pinyin":["qiang1","qiang3"],"word":"搶"},{"definition":["to cut prices\/to discount\/to mark down\/price cutting"],"pinyin":["jian3 jia4"],"word":"減價"},{"definition":["upsurge\/popular craze"],"pinyin":["re4 chao2"],"word":"熱潮"},{"definition":["to sell well\/hot-selling"],"pinyin":["re4 xiao1"],"word":"熱銷"},{"definition":["to enter the venue\/to enter the arena\/(aviation) to approach the airfield\/(investing) to get into the market"],"pinyin":["jin4 chang3"],"word":"進場"},{"definition":["extremely expensive\/sky-high price"],"pinyin":["tian1 jia4"],"word":"天價"},{"definition":["to ratchet up\/to raise (expectations etc)\/to increase (a quota, a position in the market etc)\/to up the ante\/(computing) to encode"],"pinyin":["jia1 ma3"],"word":"加碼"},{"definition":["to flock (to see)\/to mill\/to throng"],"pinyin":["feng1 yong1"],"word":"蜂擁"},{"definition":["tempest\/wave (of popular sentiment etc)\/craze or fad"],"pinyin":["feng1 chao2"],"word":"風潮"},{"definition":["to be bound to\/undoubtedly will"],"pinyin":["shi4 bi4"],"word":"勢必"},{"definition":["to select and purchase\/to buy"],"pinyin":["xuan3 gou4"],"word":"選購"},{"definition":["meeting place\/place where people gather\/CL:個|个[ge4]"],"pinyin":["hui4 chang3"],"word":"會場"},{"definition":["to run out of (stock)"],"pinyin":["duan4 huo4"],"word":"斷貨"},{"definition":["to come pouring in\/influx"],"pinyin":["yong3 ru4"],"word":"湧入"},{"definition":["to depart as quick as a flash\/flash mob"],"pinyin":["kuai4 shan3"],"word":"快閃"}]}