{"definition":["to snatch (esp related to a robbery)"],"pinyin":["qiang3 zou3"],"simplified":["抢走"],"rank":8280.0,"normalized_rank":0.11584794257971542,"fraction":0.000011295164856068864,"cumulative_fraction":0.9130504444084244,"word":"搶走","characters":[{"definition":["see 搶風|抢风[qiang1 feng1]","to fight over\/to rush\/to scramble\/to grab\/to rob\/to snatch"],"pinyin":["qiang1","qiang3"],"word":"搶"},{"definition":["to walk\/to go\/to run\/to move (of vehicle)\/to visit\/to leave\/to go away\/to die (euph.)\/from\/through\/away (in compound verbs, such as 撤走[che4 zou3])\/to change (shape, form, meaning)"],"pinyin":["zou3"],"word":"走"}],"containing_words":[],"sentences":[{"english":"The money was ravished away from him.","chinese":"他的錢被人搶走了。"},{"english":"The robber grabbed the mobile phone away from the woman.","chinese":"搶劫犯把那名婦女的手機搶走了。"},{"english":"I feel we've been robbed of two Scudetti.","chinese":"“我感覺我們被搶走了兩個聯賽冠軍”。"},{"english":"The defeated soldiers reaved the villagers of their flocks of sheep.","chinese":"敗兵搶走了村民的羊羣。"},{"english":"Maybe it takes away from Cath 's dress.","chinese":"或許這會搶走卡西服裝的丰采。"},{"english":"When late rend away victim Li Cheng wait a student the cellular phone is three and the lump is 47 dollars.","chinese":"當晚搶走受害人李成等學生手機三部及現金47元。"},{"english":"She pulled a blaster and took Pratuhr's money before escaping through the crowded club.","chinese":"諾德拔槍搶走了普雷特的錢，然後逃出擁擠的俱樂部。"},{"english":"They took the governor's toupee at the rally.","chinese":"有人在集會上搶走了州長的假髮。"},{"english":"In the manor the squire told them that Song Jiang, head of the liangshan Marsh, had snatched his daughter away by force.","chinese":"他們聽說莊主太公說他的女兒被梁山泊首領宋江搶走。"},{"english":"I flew into a rage when another man stole my girlfriend!","chinese":"女朋友被別人搶走真氣死我了。"},{"english":"The monkey grabbed the peanut out of my hand.","chinese":"那隻猴子從我手裏搶走了花生。"},{"english":"The enemy soldiers looted the treasures of the art museum.","chinese":"敵軍士兵搶走了藝術博物館的珍藏。"},{"english":"Film day shortly, her cinematograph was reaved by thief soon.","chinese":"拍攝日子在即，她的攝影機眼看就被小偷搶走了。"},{"english":"He said they'd turn us into their slaves, they'd steal all our things.","chinese":"他說他們想把我們變成奴隸，還要搶走我們所有東西。"},{"english":"Auf wiedersehen Lost his place to Tim Howard and took his gloves to Marseille.","chinese":"被霍華德搶走位置之後就去了馬賽。"},{"english":"He nabbed away the book from my hand.","chinese":"他從我手中把書搶走了。"}],"related":[]}