{"definition":["to abandon\/to discard\/to spurn\/to forsake"],"pinyin":["bing4 qi4"],"simplified":["摒弃"],"rank":15325.0,"normalized_rank":0.21441663285436455,"fraction":0.0000039932179828081545,"cumulative_fraction":0.9603554330291728,"word":"摒棄","characters":[{"definition":["to discard\/to get rid of"],"pinyin":["bing4"],"word":"摒"},{"definition":["to abandon\/to relinquish\/to discard\/to throw away"],"pinyin":["qi4"],"word":"棄"}],"containing_words":[],"sentences":[{"english":"Hope that the United States will abandon the Cold War mentality, not in Hongkong to engage in political gamesmanship.","chinese":"希望美方摒棄冷戰思維，不在香港搞政治上的小動作。"},{"english":"We should get rid of the bad style and keep the good.","chinese":"我們應該摒棄不良作風，保持優良作風。"},{"english":"You can’t have good ideas unless you’re willing to generate a lot of bad ones.","chinese":"除非摒棄諸多不良想法纔會有好點子。"},{"english":"As to prophecies, intelligent writers gave them up long ago.","chinese":"至於預言書，明智的作家們早就將它們摒棄了。"},{"english":"Last night was a night for banishing regrets.","chinese":"昨晚是一個摒棄悔恨的晚上。"},{"english":"Abandoning or spoiling the justice will make the law become evil law or bad law.","chinese":"在法中摒棄或作賤正義，便會使法淪爲惡法或劣法。"},{"english":"People would be wise to abandon rash inclinations and instead try in earnest.","chinese":"人們摒棄急燥冒進並代之以嚴肅認識是明智之舉。"},{"english":"Now, eliminate time. You follow what we are doing?","chinese":"現在，摒棄時間。你明白我們正在做什麼嗎？"},{"english":"We must blot out the personal enmities at this time.","chinese":"此時我們必須摒棄個人之間的恩怨。"},{"english":"She put away all prejudices.","chinese":"她摒棄一切成見。"},{"english":"Well,maybe that metahphysical claim I just made should be abandoned.","chinese":"也許我剛纔提出的形而上學表述應該被摒棄。"},{"english":"From dishonour and from shame.","chinese":"摒棄污點和羞恥。"},{"english":"When a society abandons economic growth, is there any reason for favouring profit?","chinese":"當一個社會摒棄經濟增長時，還會有獲利的希望麼？"},{"english":"This site has been wholly abandoned with the Deep Pool fenced against people over the past twenty years.","chinese":"本網站已完全摒棄對人的深池圍欄，在過去的二十年。"},{"english":"Scott Gill trusted himself, let go of the outcome and lived.","chinese":"斯科特吉爾相信自己的判斷，摒棄雜念快樂生活。"},{"english":"Life is the abnegation of self to gain the bliss of Nirvana.","chinese":"生命是爲了達到極樂的涅磐而摒棄自身。"}],"related":[]}