{"definition":["to hold in one's arms\/to embrace"],"pinyin":["lou3 zhu4"],"simplified":["搂住"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"摟住","characters":[{"definition":["to draw towards oneself\/to gather\/to gather up (one's gown, sleeves etc)\/to grab (money)\/to extort","to hug\/to embrace\/to hold in one's arms"],"pinyin":["lou1","lou3"],"word":"摟"},{"definition":["to live\/to dwell\/to stay\/to reside\/to stop\/(suffix indicating firmness, steadiness, or coming to a halt)"],"pinyin":["zhu4"],"word":"住"}],"containing_words":[],"sentences":[{"english":"Mother buckled in the baby.","chinese":"母親摟住了嬰兒。"},{"english":"Guillermo put his arm around her shoulder.","chinese":"吉爾勒莫伸開胳膊摟住她的肩膀。"},{"english":"She locked her arms about his neck.","chinese":"她用手臂緊緊摟住他的脖子。"},{"english":"He circled her waist with his arm.","chinese":"他用手臂摟住她的腰。"},{"english":"People cant dead, senior around Sun Qian body plunged into grief.","chinese":"人死不能復生，老資格摟住孫謙的遺體陷入到悲痛中。"},{"english":"She grasped his waist, and so they reached the bottom.","chinese":"她把他的腰摟住了，兩人就這樣跑到了山下。"},{"english":"Mark joined her, holding her in his arms.","chinese":"馬克靠近桑德拉，用雙臂緊緊的摟住她。"},{"english":"He put his hands around her slender waist.","chinese":"他雙手摟住她纖細的腰。"},{"english":"I smiled and threw my arms around his neck.","chinese":"我笑着用雙手摟住他的脖子。"},{"english":"She held him closer round the neck, and rocked him on her breastlike a child.","chinese":"她更緊地摟住他的脖子，像搖孩子似的在胸前搖着他。"},{"english":"He draped his arms round her neck.","chinese":"他雙手摟住了她的脖子。"},{"english":"Joy held her baby tight, muttering a silent prayer of thanks.","chinese":"喬伊緊緊地摟住自己的孩子，心中默誦地祈禱感謝。"},{"english":"He put his heavy arms around me and rubbed his big hands on my back.","chinese":"他用他的粗胳膊把我摟住，大手在我背後摩挲。"},{"english":"He had twined his chubby arms around Vincent's neck.","chinese":"他胖乎乎的雙臂摟住文森特的脖子。"},{"english":"Jack enclasped her waist in his arm.","chinese":"傑克用胳膊摟住她的腰。"},{"english":"Her arms closed around her long lost relative.","chinese":"她用雙臂摟住了她失散多年的親屬。"}],"related":[]}