{"definition":["Mormon (religion)"],"pinyin":["Mo2 men2"],"simplified":["摩门"],"rank":50380.0,"normalized_rank":0.7048815636673988,"fraction":1.3824081263824976e-7,"cumulative_fraction":0.9990135970602132,"word":"摩門","characters":[{"definition":["to rub"],"pinyin":["mo2"],"word":"摩"},{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["Men2","men2"],"word":"門"}],"containing_words":[{"definition":["Book of Mormon"],"pinyin":["Mo2 men2 Jing1"],"word":"摩門經"}],"sentences":[{"english":"We young Mormon men enter the Aaronic priesthood when we're twelve.","chinese":"我們年輕的摩門男子在十二歲時就是次級傳教士了。"},{"english":"Mormons administer the sacrament of the Lord's Supper as a memorial of Christ's death.","chinese":"摩門教徒將聖餐之禮看作對基督之死的紀念。"},{"english":"The nickname is from the MormonChurchChurch's symbol for hard work.","chinese":"這一別名來摩門教會對於辛勞工作的象徵。"},{"english":"The Utah branch of Mormonism dissolves the distinctions between the priesthood and the laity.","chinese":"摩門教猶他會解除了祭司與世俗者之間的區別。"},{"english":"In the Book of Mormon there are many Anti- Christs.","chinese":"在摩門經中有很多反基督者。"},{"english":"Yet many Americans have doubts about Mormonism.","chinese":"然而許多美國人對摩門教有所懷疑。"},{"english":"Crew necks are for squares and Mormons.","chinese":"圓領衫是給“飛機場”和摩門教徒穿的。"},{"english":"We can not order you to read the Book of Mormon.","chinese":"我們不能命令你讀摩門經。"},{"english":"Others, however, laughed at some of the beliefs of the Mormons.","chinese":"然而，也有些人嘲笑摩門教的信仰。"},{"english":"The two young Mormons stared at him in amazement.","chinese":"這兩個摩門年輕人開始很喫驚地瞪着他。"},{"english":"Trust me, he's Mormon, those guys never wank.","chinese":"相信我，他是個摩門教徒，他們不會擼的。"},{"english":"This insert connects the record engraved on the Small Plates with Mormon's abridgment of the Large Plates.","chinese":"這插入連接的記錄刻在小板的摩門教徒的刪節大板。"},{"english":"Mormons are a religious group founded in USA in 1830.","chinese":"摩門教派是1830年在美國成立的一個宗教團體。"},{"english":"While this might not necessarily be madness, it was about the Mormons.","chinese":"也許這不一定是瘋狂，它說的是摩門教徒。"},{"english":"Some voters are put off by Mr Romney’s Mormonism.","chinese":"一些投票人因爲羅姆尼是摩門教而放棄投票。"},{"english":"As a Mormon, my one illicit curiosity had always been sex.","chinese":"作爲一個摩門教徒，我違規的好奇心總是圍繞着性。"}],"related":[]}