{"definition":["a pole\/a prop"],"pinyin":["cheng1 gan1"],"simplified":["撑杆"],"rank":49320.0,"normalized_rank":0.6900507884096092,"fraction":1.5532019498109582e-7,"cumulative_fraction":0.9988583367160612,"word":"撐杆","characters":[{"definition":["to support\/to prop up\/to push or move with a pole\/to maintain\/to open or unfurl\/to fill to bursting point\/brace\/stay\/support"],"pinyin":["cheng1"],"word":"撐"},{"definition":["pole\/CL:條|条[tiao2],根[gen1]"],"pinyin":["gan1"],"word":"杆"}],"containing_words":[],"sentences":[{"english":"Leonard pottered round the greenhouse, tying up canes for the tomatoes.","chinese":"倫納德在溫室裏悠然自得地給西紅柿綁上撐杆。"},{"english":"The pole vault is one of the most complicated events in track and field.","chinese":"撐杆跳高是田徑項目中技術最爲複雜的項目之一。"},{"english":"Only 32 points separated them as they competed in the pole vault.","chinese":"在進行撐杆跳高前，兩個人的分數只差32分。"},{"english":"Then they cut a tall tree for a pole and stood it upright.","chinese":"接着他們砍一棵高樹作爲撐杆再把它直立的站着。"},{"english":"The pole vaulter bettered the world's record by five inches.","chinese":"這名撐杆跳高運動員以5英寸之多超過了世界紀錄。"},{"english":"What are the poles made of in pole vaulting?","chinese":"撐杆跳高的杆是什麼材質？"},{"english":"Remove support rods from ball studs.","chinese":"從球銷上拆去支撐杆。"},{"english":"Applied for making lead, support, typing needle.","chinese":"用於製作引出線，支撐杆，打印針等。"},{"english":"I wouldn't touch it with a barge pole.","chinese":"我用一根駁船撐杆也夠不到它。"},{"english":"Would you like to watch the pole vault competition with me?","chinese":"明天跟我一起去看撐杆跳比賽吧？"},{"english":"Toughened glass cover and hydraulic stay bar.","chinese":"鋼化玻璃蓋板，液壓撐杆。"},{"english":"My company's supporting bar full range, high-quality, good performance.","chinese":"我公司的支撐杆品種齊全，質量高，性能好。"},{"english":"Remove support from under skid plate.","chinese":"從球銷上拆去支撐杆。"},{"english":"You would never have thought that pole vaulters could be sexy eh?","chinese":"也許你從沒覺得撐杆跳性感吧？"},{"english":"Dip the filled air-spring strut completely into a water bath .","chinese":"將已加註的氣動彈簧撐杆支柱完全浸入一個水槽中。"},{"english":"So he did and gently laid his pole at his feet.","chinese":"於是，他深呼吸，然後輕輕地把撐杆放在腳邊。"}],"related":[]}