{"definition":["(of an organization that has a duty of care) to give financial support to relatives of sb who has died or suffered serious injury"],"pinyin":["fu3 xu4"],"simplified":["抚恤"],"rank":25693.0,"normalized_rank":0.359478404432443,"fraction":0.0000013894150524718704,"cumulative_fraction":0.9852848800604662,"word":"撫卹","characters":[{"definition":["to comfort\/to console\/to stroke\/to caress\/an old term for province or provincial governor"],"pinyin":["fu3"],"word":"撫"},{"definition":["anxiety\/sympathy\/to sympathize\/to give relief\/to compensate"],"pinyin":["xu4"],"word":"卹"}],"containing_words":[],"sentences":[{"english":"Some local businessmen proposed to raise a comfort fund for the earthquake victims.","chinese":"當地一些商人提議向地震受害者籌集撫卹金。"},{"english":"He has a discompetency pension from the government.","chinese":"他擁有一筆政府發的傷殘撫卹金。"},{"english":"The new insurance rules speculate that the disabled FOR the public benefit are to receive more money.","chinese":"新的保險條例規定因公傷殘者將得到更多的撫卹金。"},{"english":"Your death benefit is the amount of life insurance plus the policy Account Value.","chinese":"你的死亡撫卹金是人壽保險和保險單賬價值的總量。"},{"english":"Universal allows you to raise or lower your premiums and resulting cash balance.","chinese":"萬能型允許你隨意調高或調低保費和死亡撫卹金。"},{"english":"The government ritual buries died generals and the soldiers, comforts them family member.","chinese":"政府禮葬死亡將士，撫卹其家屬。"},{"english":"A fund will be set up for the dead men's families.","chinese":"撫卹死難工家屬的基金會即將建立起來。"},{"english":"He has a disability pension from the government.","chinese":"他領有一筆政府發的傷殘撫卹金。"},{"english":"Many factories compensate their workers if they are hurt at work.","chinese":"對工人工傷，許多工廠都撫卹賠償。"}],"related":[]}