{"definition":["to announce\/to read (the news)"],"pinyin":["bo1 bao4"],"simplified":["播报"],"rank":15754.0,"normalized_rank":0.22041889944454549,"fraction":0.0000037881194170671403,"cumulative_fraction":0.9620232021619404,"word":"播報","characters":[{"definition":["to sow\/to scatter\/to spread\/to broadcast\/Taiwan pr. [bo4]"],"pinyin":["bo1"],"word":"播"},{"definition":["to announce\/to inform\/report\/newspaper\/recompense\/revenge\/CL:份[fen4],張|张[zhang1]"],"pinyin":["bao4"],"word":"報"}],"containing_words":[{"definition":["announcer"],"pinyin":["bo1 bao4 yuan2"],"word":"播報員"}],"sentences":[{"english":"Here are the headlines in today's news.","chinese":"現在播報今天的新聞提要。"},{"english":"Does Radio Beijing broadcast the news every hour on the hour?","chinese":"北京廣播臺每小時整點播報新聞嗎？"},{"english":"At six-thirty he listens to the news on the radio.","chinese":"他六點半聽收音機播報的新聞。"},{"english":"One-minute, comprehensive business updates 14 times a day.","chinese":"一分鐘綜合商業新聞，一天更新播報十四次。"},{"english":"The weatherman's forecast for today's weather certainly came true .","chinese":"氣象播報員對今天的天氣所做的預十分準確。"},{"english":"For your convenience, we will announce the time of the first and the last trains.","chinese":"爲方便您乘車，我們將播報首末車時間。"},{"english":"Later in our program, we will hear about a deadly viral disease in China.","chinese":"在隨後的節目中，我們將播報中國的一場致命病毒病。"},{"english":"From Washington, this is VOA news. I'm David DeForest reporting.","chinese":"這裏是美國之音在華盛頓播報的新聞。"},{"english":"Please make an interview in groups, and then make a report to the whole class.","chinese":"請學生以小組爲單位完成採訪和新聞播報的任務。"},{"english":"At six-thirty he accepts to the account on the radio.","chinese":"他六點半聽收音機播報的消息。"},{"english":"Use capital letters for anything your talent is going to read on-air.","chinese":"用大寫字母寫下你的播報員將要播報的任何語句。"},{"english":"Use capital letters for anything your talent is going to read on-air.","chinese":"用大寫字母寫下你的播報員將要播報的任何語句。"},{"english":"The newscaster is searching for clues and working around the clock in his affiliation.","chinese":"這新聞播報員正在找線索及在他的服務機構日夜工作。"},{"english":"On Friday nights, he announces Nucla High football games.","chinese":"在週五晚上，他負責播報紐克拉高中的美式足球比賽。"},{"english":"The B. B. C. are not often late (in) broadcasting the news.","chinese":"英國廣播公司通常能及時播報新聞。"},{"english":"You are listening to the news on Bavarian Radio.","chinese":"您現在所收聽的是巴伐利亞電臺爲你播報的新聞。"}],"related":[{"definition":["on-the-spot live broadcast"],"pinyin":["xian4 chang3 zhi2 bo1"],"word":"現場直播"},{"definition":["dramatic form consisting of historical narration\/history as jocular narrative\/to stretch history for a joking story\/amusing story with strained interpretations of history\/to make an unreasonable comparison in jest"],"pinyin":["xi4 shuo1"],"word":"戲說"},{"definition":["television program"],"pinyin":["dian4 shi4 jie2 mu4"],"word":"電視節目"},{"definition":["live (e.g. broadcast or recording)\/what is actually happening\/scene\/the real situation"],"pinyin":["shi2 kuang4"],"word":"實況"},{"definition":["to start\/to set in motion\/to move\/to march\/to dig in (eating)\/to tuck in (eating)"],"pinyin":["kai1 dong4"],"word":"開動"},{"definition":["(of a sports competition or match) to commence\/(of a war or battle) to break out\/to perform acrobatic or choreographed fighting (in Chinese opera)\/to brawl\/to come to blows"],"pinyin":["kai1 da3"],"word":"開打"},{"definition":["lit. to rush at thin air\/fig. to miss one's aim\/to have nothing to show for one's troubles"],"pinyin":["pu1 kong1"],"word":"撲空"},{"definition":["(originally) to provide assistance\/(more recently) to show one's support (for a singing idol etc)"],"pinyin":["ying4 yuan2"],"word":"應援"},{"definition":["radio station"],"pinyin":["guang3 bo1 dian4 tai2"],"word":"廣播電台"},{"definition":["to clap one's hands\/to clap each other's hands\/high five"],"pinyin":["ji1 zhang3"],"word":"擊掌"},{"definition":["forum (esp. online)\/discussion area\/feedback"],"pinyin":["tao3 lun4 qu1"],"word":"討論區"},{"definition":["dummy run\/to run through sth\/to rehearse"],"pinyin":["yu4 yan3"],"word":"預演"},{"definition":["barrage (military)\/\"bullet screen\", function which allows viewers to post on-screen comments in videos, movies etc in real time\/danmaku (video game subgenre)"],"pinyin":["dan4 mu4"],"word":"彈幕"},{"definition":["imaginative\/to have one's mind buzzing with ideas"],"pinyin":["nao3 dong4 da4 kai1"],"word":"腦洞大開"},{"definition":["to talk from one's personal experience\/to use oneself as an example"],"pinyin":["xian4 shen1 shuo1 fa3"],"word":"現身說法"},{"definition":["frightening words to scare people (idiom); alarmist talk\/reds under the beds"],"pinyin":["wei1 yan2 song3 ting1"],"word":"危言聳聽"}]}