{"definition":["lit. sth hits one in the face\/directly in one's face\/sth assaults the senses\/blatant (advertising)\/eye-catching\/(a smell) assaults the nostrils"],"pinyin":["pu1 mian4"],"simplified":["扑面"],"rank":16392.0,"normalized_rank":0.2293453471940453,"fraction":0.0000035225861138052847,"cumulative_fraction":0.9643493411942006,"word":"撲面","characters":[{"definition":["to throw oneself at\/to pounce on\/to devote one's energies\/to flap\/to flutter\/to dab\/to pat\/to bend over"],"pinyin":["pu1"],"word":"撲"},{"definition":["face\/side\/surface\/aspect\/top\/classifier for flat surfaces such as drums, mirrors, flags etc"],"pinyin":["mian4"],"word":"面"}],"containing_words":[{"definition":["lit. sth hits one in the face\/directly in one's face\/sth assaults the senses\/blatant (advertising)\/eye-catching\/(a smell) assaults the nostrils"],"pinyin":["pu1 mian4 er2 lai2"],"word":"撲面而來"}],"sentences":[{"english":"In northern Siberia, bone-chilling winds sweep down from the Pole.","chinese":"在西伯利亞之北，來自極地的刺骨寒風撲面而吹。"},{"english":"Just enter the scenic area, will have a cool breeze blowing.","chinese":"剛邁入景區，便有陣陣涼風撲面。"},{"english":"The snow was blowing in his face, but the gritted his teeth and went on.","chinese":"大雪撲面，但是他咬緊牙關，繼續前進。"},{"english":"The acrid smell of lamb kebabs and the sweet smell of cakes soaked in honey reign over everything else.","chinese":"烤羊肉串的辛香和蜜制蛋糕的甜香撲面而來。"},{"english":"Early in the morning when the sliding window, there is the smell of rain, but the thick autumn is coming.","chinese":"晨起推窗，還有雨的氣息，但那濃濃的秋涼撲面而來。"},{"english":"The Resting Area for Guests are redecorated in a festival atmosphere.","chinese":"來賓休息區裝點一新，撲面而來的喜悅氛圍。"},{"english":"Give an air kiss to the person on your opposite.","chinese":"給坐在撲面的人一個飛吻。"},{"english":"With wafts of the science book kissing me I bought it without hesitation.","chinese":"這本科技書書香撲面，我毫不猶豫地買下來了。"},{"english":"Our society is developing rapidly, economy based knowledge and society of information is coming.","chinese":"人類社會迅猛發展，知識經濟和信息化社會撲面而來。"},{"english":"Open the lid, an intense gasoline blowing.","chinese":"打開壺蓋，一股濃烈的汽油味撲面而來。"},{"english":"Opened the window, rushing toward us is a light rain started falling day.","chinese":"推開窗，撲面而來的是一個細雨霏霏的日子。"},{"english":"As soon as I walked outside, I was greeted with white shimmering blanket of cold.","chinese":"剛出門，撲面而來的是一片晶瑩雪白的冰冷。"},{"english":"I was greeted with the shimmering white blanket of cold.","chinese":"撲面而來的是一大片晶瑩雪白的冰涼。"},{"english":"The acrid smell of lamb kebabs and the sweet smell of cakes soggy in honey predominate over everything else.","chinese":"烤羊肉串的辛香和蜜制蛋糕的甜香撲面而來。"},{"english":"The rain was driving in his face.","chinese":"雨朝他撲面打來。"},{"english":"A sense of satire is strongly felt.","chinese":"強烈的諷刺味道撲面而來。"}],"related":[]}