{"definition":["to assail the nostrils (of fragrance and odors)"],"pinyin":["pu1 bi2"],"simplified":["扑鼻"],"rank":24078.0,"normalized_rank":0.3368824591104333,"fraction":0.000001611738978182593,"cumulative_fraction":0.9828648321610702,"word":"撲鼻","characters":[{"definition":["to throw oneself at\/to pounce on\/to devote one's energies\/to flap\/to flutter\/to dab\/to pat\/to bend over"],"pinyin":["pu1"],"word":"撲"},{"definition":["nose"],"pinyin":["bi2"],"word":"鼻"}],"containing_words":[{"definition":["exotic odors assail the nostrils (idiom)"],"pinyin":["yi4 xiang1 pu1 bi2"],"word":"異香撲鼻"},{"definition":["exotic odors assail the nostrils (idiom)"],"pinyin":["xiang1 wei4 pu1 bi2"],"word":"香味撲鼻"}],"sentences":[{"english":"As he looked out, a fantastic smell came to his nose.","chinese":"當他伸出頭時，一股誘人的香味撲鼻而來。"},{"english":"As long as you get closer to the nose longans , a faint scent came on smelling.","chinese":"你只要把鼻子湊近桂圓，一種淡淡的清香就撲鼻而來。"},{"english":"The food with a sharp aroma increases people's appetite consideraBly.","chinese":"香氣撲鼻的食品使人食慾大增。"},{"english":"An off white to pale yellow free-flowing powder, with tangy citrus taste.","chinese":"米黃色自活動粉沫，帶有幽香撲鼻的柑橘滋味。"},{"english":"This fragrant air freshener makes you sense a distinctive aroma all day long.","chinese":"這種芳香型空氣清潔劑使您整天感到芳香撲鼻。"},{"english":"Rounds of bread aroma directly toward the muzzle, he energetically the Yanzhao saliva.","chinese":"一陣陣麪包香味兒直撲鼻口，他使勁的嚥着口水。"},{"english":"Some flowers is tangy scent, bright color, like colourful season.","chinese":"有的花是香味撲鼻，色澤鮮豔，就像豔季。"},{"english":"The color yellow, fragrant aroma.","chinese":"其色澤嫩黃，清香撲鼻。"},{"english":"On the nose delicate aromas of vanilla, honey and pears with floral notes.","chinese":"香草，蜂蜜及梨子的芬芳伴着花香撲鼻而來。"},{"english":"Is in the classroom can also smell the fragrant come.","chinese":"就是在教室裏也能聞到香氣撲鼻而來。"},{"english":"The minute the door opened, a heady aroma of coffee drew me in.","chinese":"我一推開店門，濃郁醉人的咖啡香氣便撲鼻而來。"},{"english":"Steamer one opened, red yeast rice aroma first aroma.","chinese":"蒸籠一掀開，紅麴香味先撲鼻。"},{"english":"Nothing is packaged and there is a thick smell of raw meat and fish.","chinese":"都沒有任何包裝，而且魚肉腥味撲鼻。"},{"english":"After Hanshuang not snow, a plum blossom-Pubi.","chinese":"不經一番寒霜雪，那得梅花撲鼻香。"},{"english":"Open the case and it strikes you immediately.","chinese":"當打開吉他盒子時，香味立刻撲鼻而來。"},{"english":"Without a cold biting, nothing is tangy incense.","chinese":"未經一番寒徹骨，焉得梅花撲鼻香。"}],"related":[]}