{"definition":["joystick\/control lever"],"pinyin":["cao1 zong4 gan3"],"simplified":["操纵杆"],"rank":38340.0,"normalized_rank":0.5364263428147692,"fraction":4.4931913548102725e-7,"cumulative_fraction":0.9957982579404584,"word":"操縱桿","characters":[{"definition":["to grasp\/to hold\/to operate\/to manage\/to control\/to steer\/to exercise\/to drill (practice)\/to play\/to speak (a language)","variant of 肏[cao4]"],"pinyin":["cao1","cao4"],"word":"操"},{"definition":["warp (the vertical threads in weaving)\/vertical\/longitudinal\/north-south (lines of longitude)\/lengthwise\/to release\/to indulge\/even if"],"pinyin":["zong4"],"word":"縱"},{"definition":["stick\/pole\/lever\/classifier for long objects such as guns"],"pinyin":["gan3"],"word":"桿"}],"containing_words":[],"sentences":[{"english":"These levers were used to open the barrier inside the pond.","chinese":"這些操縱桿用來開放池子內部的遮擋板。"},{"english":"The lock stops the quick release lever from opening fully.","chinese":"安全鎖能防止快速釋放操縱桿完全打開。"},{"english":"The remaining control participants used a normal joystick.","chinese":"其餘人則使用普通的操縱桿。"},{"english":"Use the joystick or navigation keys to select the pocket.","chinese":"使用操縱桿或者導航鍵來選擇口袋。"},{"english":"Remember joysticks? Those old things you used to control your game characters?","chinese":"還記得曾經的那些遊戲操縱桿和角色操控設備嗎？"},{"english":"The Scout is operated by a joystick handset that also displays the video feed.","chinese":"這種機器人由一部有放像功能的手持操縱桿操作。"},{"english":"One was a set of shut-off rods.","chinese":"一套是一系列的切斷停止操縱桿。"},{"english":"The thumb-operated joysticks have similar mobility to the human shoulder and wrist.","chinese":"這個由拇指控制的操縱桿就好比是人的肩膀和手腕。"},{"english":"Turn the red operating lever of the battery disconnect switch anti-clockwise.","chinese":"順時針旋轉蓄電池切斷開關的紅色操縱桿。"},{"english":"There is also a Wagner joy stick system which gives auxiliary power assistance to steering and reverse.","chinese":"另外還備有瓦特納操縱桿爲轉舵和倒車提供備用動力。"}],"related":[]}