{"definition":["to arrange matters"],"pinyin":["cao1 ban4"],"simplified":["操办"],"rank":20569.0,"normalized_rank":0.28778699648818434,"fraction":0.000002256084223151162,"cumulative_fraction":0.9761607236666108,"word":"操辦","characters":[{"definition":["to grasp\/to hold\/to operate\/to manage\/to control\/to steer\/to exercise\/to drill (practice)\/to play\/to speak (a language)","variant of 肏[cao4]"],"pinyin":["cao1","cao4"],"word":"操"},{"definition":["to do\/to manage\/to handle\/to go about\/to run\/to set up\/to deal with"],"pinyin":["ban4"],"word":"辦"}],"containing_words":[],"sentences":[{"english":"An auspicious day; referring to the date of a wedding.","chinese":"今天是不容錯過的吉期，適於操辦婚事。"},{"english":"Today is an unmissable auspicious day, suitable for holding a wedding.","chinese":"今天是不容錯過的吉期，適於操辦婚事。"},{"english":"It is the first time a private company has run the ice festival.","chinese":"這是首次由私人公司操辦冰燈節。"},{"english":"The Green's spared no efforts on their daughter's wedding reception.","chinese":"格林夫婦不予餘力地操辦女兒的婚事。"},{"english":"Force 670,000 event people, this is a good time.","chinese":"力操辦大事的人來說，這是一個好時機。"},{"english":"Marriage is different in a number of ways in my country.","chinese":"操辦婚事在我的祖國有很多做法都是跟美國不同的。"},{"english":"In China, the wedding is generally hosted by the groom's family.","chinese":"在中國，婚禮一般都是由男家來操辦。"},{"english":"I've run conferences before which do do this and that's fine but this was a volunteer event.","chinese":"我已經操辦了一些會議，但是這次是一個志願項目。"},{"english":"And I had the wonderful experience last summer of working on my daughter’s wedding.","chinese":"去年夏天操辦女兒的婚禮時，我非常開心。"},{"english":"They also took part in a 1Malaysia wedding reception organised by the Federal Territory Islamic Affairs Department (Jawi).","chinese":"並且參加了聯邦伊斯蘭事務部爲他們操辦的婚宴。"}],"related":[]}