{"definition":["to shoulder\/to bear\/to undertake"],"pinyin":["dan1 fu4"],"simplified":["担负"],"rank":8415.0,"normalized_rank":0.11773676773047165,"fraction":0.000011021018872822155,"cumulative_fraction":0.9145560867014264,"word":"擔負","characters":[{"definition":["picul (100 catties, 50 kg)\/two buckets full\/carrying pole and its load\/classifier for loads carried on a shoulder pole","to undertake\/to carry\/to shoulder\/to take responsibility"],"pinyin":["dan1","dan4"],"word":"擔"},{"definition":["to bear\/to carry (on one's back)\/to turn one's back on\/to be defeated\/negative (math. etc)"],"pinyin":["fu4"],"word":"負"}],"containing_words":[],"sentences":[{"english":"Shoulder angle working face big mechanized mining captain Zhao-Bing told reporters.","chinese":"擔負大傾角工作面開採的綜採隊隊長孫兆冰告訴筆者。"},{"english":"The Mossad has a record of taking startling risks.","chinese":"摩薩德曾有擔負令人震驚的風險作案的先例。"},{"english":"A disunited nation has to incur unduly high costs of government.","chinese":"一個分裂的國家必須擔負過度高昂的政府費用。"},{"english":"Chat, carry birds existence to multiply greatly development progress of history heavy responsibility also.","chinese":"聊天乎，擔負鳥類生存繁衍發展進步之歷史重任者也。"},{"english":"The rod-shaped filaments of the microtubules are responsible for dividing the chromosomes in a cell.","chinese":"微管杆形絲擔負劃分細胞中染色體的角色。"},{"english":"The father bird also protects the nest and keeps enemies away.","chinese":"鳥爸爸還擔負護巢和保持敵人遠離的任務。"},{"english":"Teachers haudio-videoe to fill the parental role and not be aloof and cold.","chinese":"西賓們必須擔負父母的角色，而不應冷淡與不友好。"},{"english":"Shaq takes some of the press off me and allows me to chill.","chinese":"沙克擔負了我身上的一些重擔，我可以少出點汗。"},{"english":"The mortar ammo bearers should provide security to the gun team.","chinese":"迫擊炮炮彈搬運兵應擔負起炮組的保衛任務。"},{"english":"He shoulders the responsibility of high political office.","chinese":"他在擔負着高級官職的責任。"},{"english":"He'll shoulder the task.","chinese":"他將擔負那工作。"},{"english":"Jesse: A poor family like hers can not afford it.","chinese":"像她那樣的貧困家庭是擔負不了的。"},{"english":"A poor family like hers can not afford it.","chinese":"像她那樣的貧困家庭是擔負不了的。"},{"english":"Colleges and universities, being the forward positions, take on an important mission of combating the peaceful evolution from socialism back to capitalisn.","chinese":"高校是反和平演變鬥爭的前沿陣地，擔負着重要使命。"},{"english":"That is the responsibility we bear.","chinese":"這是我們擔負的責任。"},{"english":"College has the same task on pushing the media talents transformation.","chinese":"推進傳媒人才轉型，高校成教同樣擔負着重要任務。"}],"related":[]}