{"definition":["it is rumored that ...\/it is reported that ..."],"pinyin":["ju4 chuan2"],"simplified":["据传"],"rank":20994.0,"normalized_rank":0.2937332978887132,"fraction":0.0000021591550789148387,"cumulative_fraction":0.9770975591733068,"word":"據傳","characters":[{"definition":["according to\/to act in accordance with\/to depend on\/to seize\/to occupy"],"pinyin":["ju4"],"word":"據"},{"definition":["biography\/historical narrative\/commentaries\/relay station","to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)"],"pinyin":["chuan2","zhuan4"],"word":"傳"}],"containing_words":[{"definition":["data transmission"],"pinyin":["shu4 ju4 chuan2 shu1"],"word":"數據傳輸"}],"sentences":[{"english":"According to the story, the practice of hanging up stockings is connected with St. Nicholas.","chinese":"據傳，懸掛襪子的習俗與聖尼古拉有關。"},{"english":"According to the rumor, Sun Yue will be transfered to the low level league NBDL for the more experiences.","chinese":"據傳孫悅會被下放到低一級別的NBDL去積累經驗。"},{"english":"At the same time, the error code in communication is corrected by using of repeat transmittal of data in every cycle.","chinese":"同時使用數據循環重發，來糾正數據傳輸中的誤碼。"},{"english":"According to a legend the mine hides big fortune.","chinese":"據傳說礦山裏埋藏着巨大的財富。"},{"english":"A large antenna and several cameras will transmit pictures and data.","chinese":"一個巨大的天線和幾架照相機將進行照片和數據傳輸。"},{"english":"It was reported that a certain statesman had exercised great political influence over you.","chinese":"據傳某政治家曾對你施加過巨大的政治影響。"},{"english":"\"The provider detected enormous amounts of data transfers,\" Vogt said.","chinese":"“該服務商發現有大量的數據傳輸，”Vogt表示。"},{"english":"It is traditionally said to have been founded in 18 BC by the legendary leader Onjo.","chinese":"據傳於公元前18年爲傳奇人物溫祚所建。"},{"english":"This is the main passageway through which data travels.","chinese":"這是數據傳輸的主要通道。"},{"english":"It is said that his rejection letters reached a height of 5 inches if piled up.","chinese":"據傳說，他收到出版商的退稿信堆起來有五英尺高。"},{"english":"Network system, data transmission device, terminal device and multicasting method.","chinese":"網絡系統，數據傳輸設備，終端設備和組播方法。"},{"english":"The transmission is partitioned into 2 parts of data handclasp and transmission.","chinese":"其通訊分爲握手和數據傳輸兩階段。"},{"english":"Legend tells that at the time of his death Swithin was a bishop of Winchester Cathedral.","chinese":"據傳說，斯韋辛死的時候是溫切斯特大教堂的主教。"},{"english":"The saw palmetto plant is often said to help hair growth, but there is little clinical evidence concerning its efficacy.","chinese":"據傳塞潤櫚有生髮功效，但是其療效並沒有臨牀證據。"},{"english":"A more secure data-transfer format wouldn't have been accepted.","chinese":"因此更安全的數據傳輸格式未得到廣泛的接受。"},{"english":"What does \"full-duplex data transfers\" mean?","chinese":"全雙工數據傳輸是什麼意思？"}],"related":[]}