{"definition":["according to reports\/it is reported (that)"],"pinyin":["ju4 xi1"],"simplified":["据悉"],"rank":835.0,"normalized_rank":0.011682733339862606,"fraction":0.0001907832697627993,"cumulative_fraction":0.5912274214070709,"word":"據悉","characters":[{"definition":["according to\/to act in accordance with\/to depend on\/to seize\/to occupy"],"pinyin":["ju4"],"word":"據"},{"definition":["in all cases\/know"],"pinyin":["xi1"],"word":"悉"}],"containing_words":[],"sentences":[{"english":"The wildcat intruded into Chenggong's territory and was caught and killed by her.","chinese":"據悉，該野貓私闖了“成功”的領地，被抓捕並咬死。"},{"english":"Jordan and Prieto are reported to have met last summer.","chinese":"據悉，二人去年夏天相識。"},{"english":"The intelligence report is understood to have been issued to European navies.","chinese":"據悉，這份情報報告已經被分發到歐洲各國海軍。"},{"english":"The man surnamed Huo operated a private studio in Quanjiao county.","chinese":"據悉，男子姓霍，在全椒縣經營一傢俬人工作室。"},{"english":"The riot was said that it was organized by illegal organizations of outside border.","chinese":"這次暴亂據悉是由境外非法組織策劃的。"},{"english":"Consuming too much sodium cyclamate can harm the liver.","chinese":"據悉，甜蜜素食用過多會傷肝。"},{"english":"These will now be dealt with by sea-borne systems.","chinese":"據悉正被處理成由艦載系統發射的防禦導彈系統。"},{"english":"It's believed that the riot was plotted by illegal organizations abroad.","chinese":"這次暴亂據悉是由境外非法組織策劃的。"},{"english":"The restaurant held a wedding reception earlier in the night.","chinese":"據悉，頭天晚上這個餐館舉辦了一場結婚慶典。"},{"english":"He weighs just 12 kilograms, the same as a three-year-old.","chinese":"據悉，黃開全體重僅爲12公斤，和三歲幼童差不多。"},{"english":"It is reported that Suleiman had promised to Israel for its \"sweeping Sinai mountains.\"","chinese":"據悉，蘇萊曼曾向以色列許諾要爲其“清掃西奈山”。"},{"english":"It is reported that Japan Jinxing Huan will focus on nuclear and other issues.","chinese":"據悉，金星煥將與日方重點討論朝核等問題。"},{"english":"It is reported that perpetrators are Qiandongnan Sansui County, called the dragon years strong.","chinese":"據悉，行兇者是黔東南州三穗縣人，叫龍久烈。"},{"english":"Liang was the highest-ranking official to recently declare the country's need for carriers.","chinese":"據悉，梁是近來正式表態中國需要航母的最高官員。"},{"english":"The attack marked the 1st time that a ship of the Nautica's size had been targeted by pirates.","chinese":"據悉，這一級別的客輪成爲海盜襲擊目標尚屬首次。"},{"english":"It is learnt that the pilot Zuotang practise in our province will also start.","chinese":"據悉，坐堂行醫試點也將在我省啓動。"}],"related":[]}