{"definition":["according to statistics"],"pinyin":["ju4 tong3 ji4"],"simplified":["据统计"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"據統計","characters":[{"definition":["according to\/to act in accordance with\/to depend on\/to seize\/to occupy"],"pinyin":["ju4"],"word":"據"},{"definition":["to gather\/to unite\/to unify\/whole"],"pinyin":["tong3"],"word":"統"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"計"}],"containing_words":[],"sentences":[{"english":"More than 500 sea turtles died in the spill area.","chinese":"據統計，在泄露海域有超過500只海龜死亡。"},{"english":"According to statistics, the population of China's post-80s generation is over 200 million.","chinese":"據統計，中國80後一代人口數量已超過2億。"},{"english":"Statistically total direct economical losses reach over 800 million RMB.","chinese":"據統計，全校直接經濟損失達到8億餘元。"},{"english":"Statistically, most men would fail.","chinese":"據統計，大部分男人都會軟下來。"},{"english":"According to statistics, the population of China`s post-80s generation is over 200 million. The media usually refers to them as \"slaves\" to property, credit cards, children and marriage.","chinese":"據統計，中國80後一代人口數量已超過2億。"},{"english":"Official statistics also show that the first half year saw rising prices for Beijing's residential houses.","chinese":"另據統計，今年上半年住宅成交均價呈直線上揚趨勢。"},{"english":"This amounts to two reported bear-inflicted injuries per year.","chinese":"據統計每年有兩起黑熊襲人至傷的報道。"},{"english":"According to statistics, Zhi appears as much as 1,900 times.","chinese":"據統計，全書共出現“之”字一千九百多次。"},{"english":"According to statistics, yearly output yield of cranberries is something around 600 kilos per hectare.","chinese":"據統計，蔓越莓年產量每公頃大約600公斤。"},{"english":"According to statistics, \"Three Violations\" is the main criminal and disasters of accidents.","chinese":"據統計，“三違”是安全生產事故的主要罪魁禍首。"},{"english":"Coccidiosis causes economic lossess of billions of dollars annually in China.","chinese":"據統計雞球蟲每年給我國養雞業造成數十億元損失。"},{"english":"Statistics show that the mortality among abandoned children is fifty-five per cent.","chinese":"據統計，被遺棄的孩子的死亡率是百分之五十五。"},{"english":"According to statistics, the earthquake killed a total of eight people in Nepal lives.","chinese":"據統計，地震在尼泊爾共奪去8人的性命。"},{"english":"According to statistic, use a network the earliest to judge one of province that coil as the country.","chinese":"據統計，作爲國家最早使用網絡評卷的省份之一。"}],"related":[]}