{"definition":["it is said\/allegedly\/according to reports\/or so they say"],"pinyin":["ju4 cheng1"],"simplified":["据称"],"rank":5788.0,"normalized_rank":0.08098162942649671,"fraction":0.000019481444192859163,"cumulative_fraction":0.8759645999951452,"word":"據稱","characters":[{"definition":["according to\/to act in accordance with\/to depend on\/to seize\/to occupy"],"pinyin":["ju4"],"word":"據"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"}],"containing_words":[],"sentences":[{"english":"Reportedly, the Chinese people in a New Year's Eve see the old habits.","chinese":"據稱，中國民間在除夕有守歲的習慣。"},{"english":"Today Bandhavgarh claims to maintain the highest density of tigers in the country.","chinese":"如今，班達迦據稱保持着國內最高的老虎密度。"},{"english":"Jackman reportedly requested to have Luhrmann stage the Oscar number.","chinese":"據稱傑克曼竭力邀請魯爾曼執導奧斯卡舞臺。"},{"english":"His studies of volcanoes on the Fijian island of Kadavu indicated they had not been active for tens of thousands of years.","chinese":"他研究斐濟卡達屋島上據稱幾萬年未活動的火山。"},{"english":"He reportedly divvied up key spheres of interest, such as oil, among his 6 sons.","chinese":"據稱，他的6個兒子瓜分了石油等國家命脈產業。"},{"english":"It's said to be anti-capitalist, with the undertone that carries of being anti-American.","chinese":"據稱這是反資本主義，潛含有反美的意味。"},{"english":"It is said the Widsets has over 4 million users in China already.","chinese":"據稱維信在中國已經擁有400多萬的用戶。"},{"english":"This practice is difficult to confirm its alleged illegality .","chinese":"據稱這種做法還難以確認其非法性。"},{"english":"Much of the alleged bribery was connected to fund-raising efforts in recent election campaigns.","chinese":"據稱這些賄金的大部分都和近來競選活動的籌資有關。"},{"english":"The prisoners' favorites included meat Kebab and pizza, the official said.","chinese":"據稱囚犯們最喜歡的外賣是羊肉串和比薩餅。"},{"english":"Its believed to be the largest foliage in Britain with 11ft span.","chinese":"這張足有11英尺寬的葉面據稱是英國最大的葉子。"},{"english":"Formally announced in late September, the lay offs reportedly began this week.","chinese":"科特說去年九月宣佈的大裁員據稱將於這周開始。"},{"english":"DMAE is reported to increase intelligence in children.","chinese":"DMAE據稱能提高兒童智力。"},{"english":"Materazzi, meanwhile, was quoted as denying the terrorist comment.","chinese":"然而，據稱馬特拉齊否認他說過這樣的話。"},{"english":"Hundreds are alleged to have been killed or maimed.","chinese":"還有上百人據稱已被殺害或致殘。"},{"english":"He also supposedly asked state workers to ring the woman.","chinese":"據稱他也曾令政府工作人員給該名女性打電話。"}],"related":[]}