{"definition":["crowded to bursting point\/filled to overflowing\/jam-packed"],"pinyin":["ji3 man3"],"simplified":["挤满"],"rank":13265.0,"normalized_rank":0.18559456018356585,"fraction":0.000005160747042449888,"cumulative_fraction":0.9510342839152442,"word":"擠滿","characters":[{"definition":["to crowd in\/to cram in\/to force others aside\/to press\/to squeeze\/to find (time in one's busy schedule)"],"pinyin":["ji3"],"word":"擠"},{"definition":["Manchu ethnic group","to fill\/full\/filled\/packed\/fully\/completely\/quite\/to reach the limit\/to satisfy\/satisfied\/contented"],"pinyin":["Man3","man3"],"word":"滿"}],"containing_words":[],"sentences":[{"english":"The old house was soon crowded with relatives and Grandpa's friends.","chinese":"老屋裏很快擠滿了親戚和爺爺的朋友。"},{"english":"Vendors' stalls crowd the beachside road in Pattaya.","chinese":"在芭堤雅，售貨攤擠滿了海濱區的道路。"},{"english":"The plane was full of holiday-makers.","chinese":"飛機場擠滿了去度假的人。"},{"english":"Nanjing Road and Huaihai Road are always crowded with people.","chinese":"南京路和淮海路都擠滿了人。"},{"english":"The bus was so packed and I got totally squished this morning.","chinese":"公交車擠滿了人，我今天早上幾乎被壓扁了。"},{"english":"His office was swarmed with many reporters.","chinese":"他的辦公室裏擠滿了記者。"},{"english":"Marylebone Station was packed with homeward- bound commuters.","chinese":"馬裏列本火車站擠滿了要回家去的旅客。"},{"english":"I head to the heart of the islet and find the centre filled with market stalls.","chinese":"我走向小島中間，發現那裏擠滿了攤檔。"},{"english":"The temple was full of devotees wanting to pray to the god.","chinese":"當時這廟裏擠滿了要向神祈禱的信徒。"},{"english":"And there was the ferryboat full of people floating along down.","chinese":"渡船上擠滿了人，正往下游漂來。"},{"english":"Attendees registering for the meeting crowded the lobby of the Moscone Center.","chinese":"茅斯考恩中心的大廳擠滿了正準備登記的與會者。"},{"english":"It's the same every year, packed with Muggles , of course, come on.","chinese":"每年都一樣，擠滿了麻瓜，這是當然的，過來吧。"},{"english":"It was packed tight with people.","chinese":"它裏面密匝匝地擠滿了人。"},{"english":"They crowd round the tap and splash water over their faces .","chinese":"自來水龍頭邊擠滿了人，用手捧些水來澆在臉上。"},{"english":"A large crowd of customers swarmed before the counter .","chinese":"櫃檯前擠滿了一大羣顧客。"},{"english":"Court packed with 80 reporters and 25 federal special police.","chinese":"庭上擠滿80名記者及25名聯邦特警。"}],"related":[]}