{"definition":["to break into\/to force one's way into\/to barge into"],"pinyin":["ji3 jin4"],"simplified":["挤进"],"rank":17775.0,"normalized_rank":0.2486953115162369,"fraction":0.000003005679337087183,"cumulative_fraction":0.9688538780761472,"word":"擠進","characters":[{"definition":["to crowd in\/to cram in\/to force others aside\/to press\/to squeeze\/to find (time in one's busy schedule)"],"pinyin":["ji3"],"word":"擠"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[],"sentences":[{"english":"It is very difficult to become part of Mandalay's supply chain.","chinese":"想要擠進M公司供應鏈的窄門，是非常困難的一件事。"},{"english":"Two girlfriends and I piled into a car and headed to Aspen, Colo.","chinese":"我和兩個女友擠進一輛車，馳向科羅拉多的阿斯彭。"},{"english":"Sarah squeezed in beside her.","chinese":"莎拉從她身旁擠進去。"},{"english":"For he had healed many; insomuch that they pressed upon him for to touch him, as many as had plagues.","chinese":"他治好了許多人，所以凡有災病的，都擠進來要摸他。"},{"english":"Seeing the hall was crowded, he elbowed himself in.","chinese":"看到大廳裏都是人，他擠進去了。"},{"english":"He interposed himself between them to stop them fighting .","chinese":"他擠進兩人中間，阻止他們打架。"},{"english":"As more blood is forced in, the tiny cavern swells .","chinese":"當更多的血擠進來時，微小的蓄水池就脹大。"},{"english":"He bribed himself onto the committee.","chinese":"他暗通關節，鑽營投機擠進了委員會。"},{"english":"She can even squeeze herself into boxes just 50cms squared.","chinese":"她甚至可以讓自己擠進僅僅50釐米見方的盒子裏。"},{"english":"They all crowded into their small living room.","chinese":"他們都擠進了他們的小客廳。"},{"english":"Finally she was forced into a pocket formed by broken concret chunks.","chinese":"最後她被擠進一個破碎的水泥塊形成的口袋狀的地方。"},{"english":"The panic - stricken passengers tried to rush the life - boats .","chinese":"驚慌的旅客爭先恐後，想擠進救生艇。"},{"english":"So many people crammed into the bus that it was impossible to close the door.","chinese":"在高峯時間這麼多的人擠進公共汽車，連門也關不上。"},{"english":"The door has cracked open. We are all going to try to collectively crash through it.","chinese":"門已經打開了一條縫，我們將努力一起擠進去。"},{"english":"Crowds packed into the cinemas on a wet day.","chinese":"在雨天，一大羣人擠進電影院。"},{"english":"Two women tried to push their way through.","chinese":"兩個女人試圖擠進去。"}],"related":[]}