{"definition":["to fit (data to a model)\/a (close) fit"],"pinyin":["ni3 he2"],"simplified":["拟合"],"rank":38421.0,"normalized_rank":0.537559637905223,"fraction":4.4566969480947894e-7,"cumulative_fraction":0.9958344949886184,"word":"擬合","characters":[{"definition":["to plan to\/to draft (a plan)\/to imitate\/to assess\/to compare\/pseudo-"],"pinyin":["ni3"],"word":"擬"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"}],"containing_words":[{"definition":["curve fitting"],"pinyin":["qu1 xian4 ni3 he2"],"word":"曲線擬合"}],"sentences":[{"english":"The fine structure parameters were calculated using a least-squares fitting procedure.","chinese":"用最小二乘法擬合技術嚴格地計算了精細結構參數。"},{"english":"By comparing the two we finally find a suitable ellipse fitting method for the environment of sea.","chinese":"通過比較找出一種適用於海洋環境的橢圓擬合方法。"},{"english":"The silicides in the cuticle of wheat straw stem were studied by means of XPS-peak-differenating analysis.","chinese":"進行麥稈皮層硅化物的XPS測定及分峯擬合分析。"},{"english":"The authors suggest a simplified method of significant test for the compatibility of curve fitting.","chinese":"本文提出一種曲線擬合適度顯著性檢驗的簡化法。"},{"english":"A procedure for properly fitting the diaphragm is described.","chinese":"阿妥善程序擬合膜片描述。"},{"english":"This paper presents a curve-fitting method to construct Hash functions.","chinese":"本文給出一種構造哈希函數的曲線擬合法。"},{"english":"This paper proposes the flux mapping method using the higher order harmonics of the neutron equation.","chinese":"提出用中子方程的高階諧波進行通量擬合的方法。"},{"english":"And related viscous-elastic parameters were gained according to appropriate simulation model.","chinese":"並選用合適的模型擬合出有關的粘彈性參數。"},{"english":"Curve fitting and auto-regression model are common means in deformation monitoring data analysis.","chinese":"曲線擬合與自迴歸是變形監測數據分析的常用方法。"},{"english":"Gives a new curve fitting method for non linear sensor.","chinese":"介紹了非線性傳感器的一種曲線擬合方法。"},{"english":"A multi-subarray subspace fitting method, which considers mutual coupling among array elements, to estimate the directions of arrival is presented.","chinese":"提出了考慮陣元互耦的子空間擬合波達方向估計方法。"},{"english":"An algorithm for data approximation with global optimal biarc spline is presented in this article.","chinese":"提出了用整體最優雙圓弧樣條擬合離散數據點的算法。"},{"english":"The coefficient is fitted from calculating the sediment diffusion coefficient by suspended load model.","chinese":"通過懸沙模型反求泥沙擴散係數的方法來擬合係數。"},{"english":"S function was the best model in the fitting between stand density and age.","chinese":"密度與林齡的擬合以S函數爲最優模型。"},{"english":"Determine pitch contours by curve fitting.","chinese":"第二，利用曲線擬合確定調形。"},{"english":"Moreover, model CPDE interpret the long tail of RTD curves perfectly.","chinese":"CPDE模型可以很好地擬合實驗RTD曲線的拖尾。"}],"related":[]}