{"definition":["onomatopoeia"],"pinyin":["ni3 sheng1"],"simplified":["拟声"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"擬聲","characters":[{"definition":["to plan to\/to draft (a plan)\/to imitate\/to assess\/to compare\/pseudo-"],"pinyin":["ni3"],"word":"擬"},{"definition":["sound\/voice\/tone\/noise\/reputation\/classifier for sounds"],"pinyin":["sheng1"],"word":"聲"}],"containing_words":[{"definition":["scat singing"],"pinyin":["ni3 sheng1 chang4 fa3"],"word":"擬聲唱法"},{"definition":["onomatopoeia"],"pinyin":["ni3 sheng1 ci2"],"word":"擬聲詞"}],"sentences":[{"english":"Imitative words are words that sound like the thing or action they stand for.","chinese":"擬聲詞是發音像它們所代表的意思的詞。"},{"english":"There are plenty of onomatopoeias in both English and Chinese.","chinese":"在英漢兩種語言裏，擬聲詞都有着極其豐富的內容。"},{"english":"In aesthetic representation of beauty in sound, rhythm and onomatopoetic are further discussed.","chinese":"音美再現中主要討論了節奏和擬聲的再現。"},{"english":"The essay is about the onomatopoeic words and mimicry words in Japanese, discuses their use and origin.","chinese":"本文論述了日語中的擬聲詞和擬態詞的來源和用法。"},{"english":"Onomatopoeia and mimetic words are a striking feature of Japanese vocabulary.","chinese":"擬聲詞和擬態詞是日語詞彙的突出特徵。"},{"english":"There are plenty of onomatopoeia in both Chinese and Japanese .","chinese":"日語和漢語的擬聲擬態詞都極爲豐富。"},{"english":"Onomatopoeia words in Chinese and Japanese have rich syntactic functions on the whole.","chinese":"漢日擬聲詞整體上句法功能較強。"},{"english":"Do you think that onomatopoeia indicates a non-arbitrary relationship between form and meaning?","chinese":"你認爲擬聲詞是形式和意義之間的非任意的聯結嗎？"},{"english":"Includes alliteration, harmonics, onomatopoetic, parallelism, symmetry and parables, etc.","chinese":"包括頭韻，諧音，擬聲，排比，對稱和比喻等。"},{"english":"Some say that is the process of making the sound onomatopoeia.","chinese":"你認爲擬聲詞是形式和意義之間的非任意的聯結嗎？"},{"english":"Here are twenty common onomatopoeias.","chinese":"以下是二十個擬聲詞。"}],"related":[]}