{"definition":["to unscrew\/to twist off (a lid)\/to turn on (a faucet)\/to switch on (by turning a knob)\/to turn (a door handle)\/to wrench apart"],"pinyin":["ning3 kai1"],"simplified":["拧开"],"rank":33401.0,"normalized_rank":0.4673233248919173,"fraction":6.970431682657262e-7,"cumulative_fraction":0.9930085289999164,"word":"擰開","characters":[{"definition":["mistake\/to twist","stubborn","to pinch\/wring"],"pinyin":["ning2","ning3","ning4"],"word":"擰"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"}],"containing_words":[],"sentences":[{"english":"He unscrewed a jar of mustard.","chinese":"他擰開了芥子醬的瓶蓋。"},{"english":"The papers twisted everything I said.","chinese":"這個帽兒應該容易擰開。"},{"english":"He strides over to the kitchen sink and flips on the faucet.","chinese":"他大步走向廚房的水槽並擰開龍頭。"},{"english":"And Lincoln also unscrewed the pipe and unlocked himself.","chinese":"而林肯也擰開了管子並且掙脫了。"},{"english":"It requires no more preparation than turning on a tap.","chinese":"它不用置備，只要擰開水龍頭就好了。"},{"english":"I twisted off the lid and looked inside.","chinese":"我擰開蓋子往裏面看。"},{"english":"The student twisted the cap off a fountain pen.","chinese":"那個學生把自來水筆筆套擰開了。"},{"english":"Although we are knocked wing, but took the opportunity to screw McCarran opened the aircraft fuel tank.","chinese":"雖然被打落機翼，麥卡倫卻乘機擰開了飛機油箱。"},{"english":"The cap should twist off easily.","chinese":"這個帽兒應該容易擰開。"},{"english":"It's kind of like when someone opens a pickle jar and you say, \"Well, I loosened it.\"","chinese":"就好比有人擰開了一個罐頭，你說，是我把它擰鬆的。"},{"english":"This is the cap of my fountain pen.","chinese":"那個學生把自來水筆筆套擰開了。"},{"english":"The boy twisted the top off the bottle.","chinese":"男孩擰開瓶子蓋。"},{"english":"Video images showed robotic arms working to unscrew its bolts.","chinese":"電視圖像顯示了機器人擰開法蘭螺栓的工作鏡頭。"},{"english":"He used all of his efforts to loosen the screw.","chinese":"他用盡全力來擰開這個螺旋裝置。"},{"english":"The shampoo bottle head had been unscrewed completely and spilled on the floor, seeping into the mat.","chinese":"洗髮水的瓶蓋擰開了，都流到了地上，滲進地毯裏。"},{"english":"stomp up the stairs, swing the bedroom door open, and jump up on the bed.","chinese":"然後踢開前門，重重的踩着樓梯擰開臥室門，跳上牀。"}],"related":[]}