{"definition":["to extend\/to expand\/extension\/expansion"],"pinyin":["kuo4 zhan3"],"simplified":["扩展"],"rank":4012.0,"normalized_rank":0.056133085220992536,"fraction":0.000033030941540556845,"cumulative_fraction":0.8310445052336447,"word":"擴展","characters":[{"definition":["to enlarge"],"pinyin":["kuo4"],"word":"擴"},{"definition":["surname Zhan","to spread out\/to open up\/to exhibit\/to put into effect\/to postpone\/to prolong\/exhibition"],"pinyin":["Zhan3","zhan3"],"word":"展"}],"containing_words":[{"definition":["extensible markup language (XML)"],"pinyin":["ke3 kuo4 zhan3 biao1 ji4 yu3 yan2"],"word":"可擴展標記語言"},{"definition":["docking station"],"pinyin":["kuo4 zhan3 wu4"],"word":"擴展塢"}],"sentences":[{"english":"Spread foundations generally can be classified as wall and column footings.","chinese":"擴展基礎通常可分爲牆基和柱基。"},{"english":"Implementing customer scenarios to include the flow of defect submissions expands integration coverage.","chinese":"包含缺陷交付流程的實施客戶場景擴展了集成的範圍。"},{"english":"For those that are not available, should the source applications be extended?","chinese":"對於不可用的那些，是否應擴展源應用程序？"},{"english":"The Prison University Project has expanded under Ms. Lewen's leadership.","chinese":"在盧恩女士的領導下，這個監獄大學項目不斷擴展。"},{"english":"The mechanism of high temperature creep associated with the climb of extended dislocations is investigated.","chinese":"本文研究了擴展位錯攀移的高溫蠕變機制。"},{"english":"This requirement will gradually expand to include smaller public companies in the future.","chinese":"這一要求將在未來逐步擴展到包含更小的國有公司。"},{"english":"Analyzing them all is beyond the scope of this article.","chinese":"分析全部擴展超出了本文的範圍。"},{"english":"It will allow computing to expand in all directions and serve ever more users.","chinese":"計算向各方向擴展，服務於更多用戶。"},{"english":"Notice the difference between these interfaces and extension points.","chinese":"請注意這些接口和擴展點之間的區別。"},{"english":"The city sprawls for miles in each direction.","chinese":"這座城市向四面八方擴展了幾英里。"},{"english":"You should try it out on every product you claim to support.","chinese":"你應該在擴展支持的所有產品上對其進行測試。"},{"english":"As in Tadasana, lengthen and broaden the soles of both feet.","chinese":"就像在山式，延長和擴展你雙腳的腳底。"},{"english":"You can extend this pattern to create an entire group of connected nodes.","chinese":"您可以擴展這一模式，以創建已連節點的整個組。"},{"english":"You can create reusable custom components by extending this class.","chinese":"通過擴展此類可以創建可重用的定製組件。"},{"english":"Each extension point is unique and defines a contract to be adhered to.","chinese":"每個擴展點都是惟一的並且定義需要遵守的契約。"},{"english":"I tend to extend the vernacular to include the owner of the software asset, such that","chinese":"我打算擴展包括軟件資源擁有者在內的這些概念。"}],"related":[{"definition":["to expand\/to enlarge\/to broaden one's scope"],"pinyin":["kuo4 da4"],"word":"擴大"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"發展"},{"definition":["to break new ground (for agriculture)\/to open up (a new seam)\/to develop (border regions)\/fig. to open up (new horizons)"],"pinyin":["kai1 tuo4"],"word":"開拓"},{"definition":["to expand"],"pinyin":["kuo4 chong1"],"word":"擴充"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to enlarge"],"pinyin":["kuo4"],"word":"擴"},{"definition":["to exploit (a resource)\/to open up (for development)\/to develop"],"pinyin":["kai1 fa1"],"word":"開發"},{"definition":["currently existing\/currently available"],"pinyin":["xian4 you3"],"word":"現有"},{"definition":["business\/professional work\/service\/CL:項|项[xiang4]"],"pinyin":["ye4 wu4"],"word":"業務"},{"definition":["to extend\/to spread\/to popularize\/generalization\/promotion (of a product etc)"],"pinyin":["tui1 guang3"],"word":"推廣"},{"definition":["to serve\/service\/CL:項|项[xiang4]"],"pinyin":["fu2 wu4"],"word":"服務"},{"definition":["to pass through\/to penetrate\/by means of\/via"],"pinyin":["tou4 guo4"],"word":"透過"},{"definition":["one step further\/to move forward a step\/further onwards"],"pinyin":["jin4 yi1 bu4"],"word":"進一步"},{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"word":"協助"},{"definition":["to put to use\/to apply\/practical\/applied (science, linguistics etc)\/application\/practical use\/(computing) app"],"pinyin":["ying4 yong4"],"word":"應用"},{"definition":["running\/operation (of airport, bus service, business etc)"],"pinyin":["ying2 yun4"],"word":"營運"}]}