{"definition":["to assume\/to adopt (a look, pose, manner etc)\/to bring out for display"],"pinyin":["bai3 chu1"],"simplified":["摆出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"擺出","characters":[{"definition":["to arrange\/to exhibit\/to move to and fro\/a pendulum"],"pinyin":["bai3"],"word":"擺"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"Dessert silverware, if not brought out with the dessert, are placed at the top of your entrée plate.","chinese":"如果甜品沒擺出來，裝甜品的銀器就放在主菜盤。"},{"english":"I know all this sounds really bad and exaggerated when it's all laid out like this.","chinese":"我知道，把這些擺出來說明，聽起來相當嚴重和誇張。"},{"english":"Siamese dancers strike a pose in a temple courtyard.","chinese":"暹羅舞者在一座寺廟的庭院前擺出姿勢以供拍攝。"},{"english":"If a man wants to sell his turnips, he needs to set them out.","chinese":"如果有人想賣蕪菁，最好把它們擺出來。"},{"english":"The people lay out their mooncakes as an offering to her during Midautumn Festival.","chinese":"每逢中秋，世人都會擺出月餅，供奉嫦娥。"},{"english":"She postured before the camera.","chinese":"她在相機前擺出做作的姿勢。"},{"english":"After being confronted with our evidence, the other side had to back down.","chinese":"面對我們擺出來的證據，對方只得作出讓步。"},{"english":"He donned his gentlemanly attitude.","chinese":"他擺出他那副紳士派頭。"},{"english":"Ade never fetches out his best dishes even when guests arrive.","chinese":"即便來了客人，艾德也不把他最好的盤碟擺出來。"},{"english":"At this time, he may find stubble to lose his temper or show a ill-favored color.","chinese":"這時他也許找茬發一通脾氣或擺出一副難看的臉色。"},{"english":"Therefore, the best course of action is to present them.","chinese":"因此，最好的辦法就是把事實擺出來。"},{"english":"She has laid out her husband's two-piece suit.","chinese":"她已經把丈夫的兩件頭西服擺出來了。"},{"english":"Here we lay out the best ideas that our net brought in.","chinese":"在這裏，我們擺出了我們的網絡帶來的最好點子。"},{"english":"The imposing man posed as a man of good disposition and disposed of the rubbish.","chinese":"使人難忘的人擺出好脾氣的姿勢然後處理垃圾。"},{"english":"But I do believe that this question now needs to be put.","chinese":"但我確實認爲需要把問題擺出來。"},{"english":"The judge show a serious face when speaking to the criminal.","chinese":"法官對犯人說話時擺出一副嚴肅的面孔。"}],"related":[]}