{"definition":["to expel\/to drive out\/to oust"],"pinyin":["nian3 chu1"],"simplified":["撵出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"攆出","characters":[{"definition":["to expel\/to oust\/(dialect) to chase after\/to try to catch up with"],"pinyin":["nian3"],"word":"攆"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"The noisy fellow was thrown out of the hall.","chinese":"這個吵吵嚷嚷的傢伙被人從大廳裏攆出去了。"},{"english":"What did he bundle the boy out for?","chinese":"他爲什麼要把那個男孩攆出去？"},{"english":"He was supplanted out of the house by his wife.","chinese":"他被妻子攆出了家門。"},{"english":"ErNian dont want to die, grandma to her out of the gate.","chinese":"二孃不願死，奶奶將她攆出山門。"},{"english":"I think the first order of business is to get you out of here.","chinese":"我認爲，當務之急首先是得把你攆出去。"},{"english":"They were thoroughly rousted out and their camps were destroyed.","chinese":"他們被徹底攆出來了，營地也被毀了。"},{"english":"Then Moses and Aaron were driven out of Pharaoh's presence.","chinese":"於是把他們從法老面前攆出去。"},{"english":"Tom routed him out, told him the trouble he had been causing, and urged him to go home.","chinese":"湯姆把他攆出來，告訴他已惹了麻煩，要他快回家。"},{"english":"A:They wanted to kick me out of the band.","chinese":"他們想把我攆出樂隊。"},{"english":"They bounced the troublemakers out of the club.","chinese":"他們把搗亂分子攆出了俱樂部。"},{"english":"Anyone who starts picking fights is out at once.","chinese":"任何找碴打起架來的人就會立刻被攆出去。"},{"english":"The child was taken away from school .","chinese":"這孩子被攆出了校門。"},{"english":"The teacher threatened to kick the impudent pupil out of the room.","chinese":"老師威脅着要把這無禮的小學生攆出教室。"},{"english":"Let's pitch the drunkard out.","chinese":"讓我們來把那個醉漢攆出去。"},{"english":"He was backed off the bar.","chinese":"他被攆出了酒吧間。"},{"english":"The waiter threatened to chuck us out of the restaurant if we got drunk.","chinese":"侍者警告說如果我們喝醉酒，就把我們攆出飯店。"}],"related":[]}