{"definition":["bracket"],"pinyin":["zhi1 cheng1 jia4"],"simplified":["支撑架"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"支撐架","characters":[{"definition":["surname Zhi","to support\/to sustain\/to erect\/to raise\/branch\/division\/to draw money\/classifier for rods such as pens and guns, for army divisions and for songs or compositions"],"pinyin":["Zhi1","zhi1"],"word":"支"},{"definition":["to support\/to prop up\/to push or move with a pole\/to maintain\/to open or unfurl\/to fill to bursting point\/brace\/stay\/support"],"pinyin":["cheng1"],"word":"撐"},{"definition":["to support\/frame\/rack\/framework\/classifier for planes, large vehicles, radios etc"],"pinyin":["jia4"],"word":"架"}],"containing_words":[],"sentences":[{"english":"Place the support frame at the bottom of the oil storage tank.","chinese":"放置支撐架於儲油槽底下。"},{"english":"Clear the mist, water, fog set, supporting frames.","chinese":"排霧管，水箱，集霧器，支撐架等。"},{"english":"The bartender grins with his chin stuck out above the top of the white neck brace and asks, \"Is this a test?\"","chinese":"男招待戴着頸部支撐架咧嘴笑着問，“這是個測試？”"},{"english":"Remove the steering knuckle from the strut.","chinese":"拆去連接支撐架到球銷的固定夾。"},{"english":"The inner mold support of a knee pipe is composed of the semi-circular arc-shaped support frames and a bivariate arc pad mold.","chinese":"彎管內模支撐由半圓弧形支撐架與雙變弧墊模組成。"},{"english":"In these one can see the hanging knees made out of bloodwood.","chinese":"在這些人們可以看到支撐架是紅木製作。"},{"english":"Particularly suitable for erection of scaffolding and heavy support frame surfaces.","chinese":"特別適合於搭設曲面腳手架和重載支撐架。"},{"english":"Chipped off coating on holder of umbrella.","chinese":"傘的支撐架覆蓋層的缺口。"},{"english":"How would the support beams even reach to the bottom of the Pacific ocean?","chinese":"怎麼把支撐架放進太平洋底？"}],"related":[]}