{"definition":["to receive\/to accept"],"pinyin":["shou1 shou4"],"simplified":["收受"],"rank":6871.0,"normalized_rank":0.09613420452478558,"fraction":0.000015152623645895419,"cumulative_fraction":0.8945880579125469,"word":"收受","characters":[{"definition":["to receive\/to accept\/to collect\/to put away\/to restrain\/to stop\/in care of (used on address line after name)"],"pinyin":["shou1"],"word":"收"},{"definition":["to receive\/to accept\/to suffer\/subjected to\/to bear\/to stand\/pleasant\/(passive marker)"],"pinyin":["shou4"],"word":"受"}],"containing_words":[],"sentences":[{"english":"It looks like the President received illegal campaign donations.","chinese":"總統好像收受了非法的選舉賄金。"},{"english":"The banks shall accept the fines and turn them over directly to the State Treasury.","chinese":"銀行應當收受罰款，並將罰款直接上繳國庫。"},{"english":"There have even been high-ranking government officials arrested for taking bribes from drug traffickers.","chinese":"甚至有高級政府官員因涉嫌收受毒販賄賂而被捕。"},{"english":"Rub the cream, for heating, which is more easily absorbed by the skin.","chinese":"搓，給眼霜減溫，使之更隨便被肌膚收受。"},{"english":"But his sons did not walk in his ways. They turned aside after dishonest gain and accepted bribes and perverted justice.","chinese":"他兒子不行他的道，貪圖財利，收受賄賂，屈枉正直。"},{"english":"And his sons walked not in his ways, but turned aside after lucre, and took bribes, and perverted judgment.","chinese":"他兒子不行他的道，貪圖財利，收受賄賂，屈枉正直。"},{"english":"Can be received within six months of bank acceptance bills of exchange.","chinese":"可收受六個月內的銀行承兌匯票。"},{"english":"The officer ended up losing his job because he accepted a bribe.","chinese":"由於收受賄賂，這個官員最終丟掉了自己的紗帽。"},{"english":"Rwaserican denting rear endocinearionr level sensors work on the principle of electromagnetic waudio-videoe transmission and reception.","chinese":"雷達物位傳感器的處事原理是電磁波傳輸與收受。"},{"english":"Mmuch people complain that computers take over their jobaloney.","chinese":"許多人訴苦說計算機正在收受人的作事。"},{"english":"The bribes, according to the reports, helped him meet those needs.","chinese":"據該報導稱，收受的賄賂幫助他滿足了這些需要。"},{"english":"We learned lessons about humanity, about giving, about receiving, about service above self.","chinese":"我們從人性，施予，收受及超我服務等方面學習經驗。"},{"english":"Some former county officials have since been prosecuted for accepting bribes from bankers.","chinese":"該縣之前的一些官員因爲收受銀行的賄賂而被起訴。"},{"english":"A big fortune had been paid in backhanders to local officials and politicians.","chinese":"當地官員和政客收受了大筆的賄賂。"},{"english":"After collecting a large amount of hush money mr. chen fled out of china .","chinese":"收受大筆賄款後，陳先生逃出中國。"},{"english":"Solicitation, payment or receipt of bribes, gratuities or kickbacks.","chinese":"索取，支付或收受賄賂，賞金或回扣。"}],"related":[{"definition":["to bribe\/to give bribes"],"pinyin":["xing2 hui4"],"word":"行賄"},{"definition":["to bribe\/a bribe"],"pinyin":["hui4 lu4"],"word":"賄賂"},{"definition":["to exact bribes\/to solicit bribes\/to demand bribes\/to extort"],"pinyin":["suo3 hui4"],"word":"索賄"},{"definition":["to accept a bribe"],"pinyin":["shou4 hui4"],"word":"受賄"},{"definition":["public money"],"pinyin":["gong1 kuan3"],"word":"公款"},{"definition":["abuse of power"],"pinyin":["lan4 yong4 zhi2 quan2"],"word":"濫用職權"},{"definition":["to be corrupt\/corruption\/to embezzle"],"pinyin":["tan1 wu1"],"word":"貪污"},{"definition":["to make a profit\/to gain\/to get an advantage"],"pinyin":["mou2 li4"],"word":"謀利"},{"definition":["to gain by cheating"],"pinyin":["pian4 qu3"],"word":"騙取"},{"definition":["to be a guest at a dinner party\/to be wined and dined (as a bribe)"],"pinyin":["chi1 qing3"],"word":"吃請"},{"definition":["to use one's position for personal gain (idiom)"],"pinyin":["yi3 quan2 mou2 si1"],"word":"以權謀私"},{"definition":["to annex\/to swallow (up)\/to embezzle"],"pinyin":["qin1 tun1"],"word":"侵吞"},{"definition":["bribery\/to give or accept bribes"],"pinyin":["na4 hui4"],"word":"納賄"},{"definition":["lack of discipline\/to break a rule\/to violate discipline\/to breach a principle"],"pinyin":["wei2 ji4"],"word":"違紀"},{"definition":["to make restitution"],"pinyin":["tui4 jiao3"],"word":"退繳"},{"definition":["to bend the law in order to favor one's relatives or associates (idiom)"],"pinyin":["xun4 si1 wang3 fa3"],"word":"徇私枉法"}]}