{"definition":["convergence (math.)\/astringent"],"pinyin":["shou1 lian3 xing4"],"simplified":["收敛性"],"rank":58823.0,"normalized_rank":0.8230100877254348,"fraction":4.963239313305693e-8,"cumulative_fraction":0.999761196514014,"word":"收斂性","characters":[{"definition":["to receive\/to accept\/to collect\/to put away\/to restrain\/to stop\/in care of (used on address line after name)"],"pinyin":["shou1"],"word":"收"},{"definition":["to hold back\/to restrain\/to control (oneself)\/to collect\/Taiwan pr. [lian4]","variant of 殮|殓[lian4]"],"pinyin":["lian3","lian4"],"word":"斂"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"Helpful in the treatment of diarrhea due to its astringent properties.","chinese":"有用在腹瀉的治療由於它的收斂性物產。"},{"english":"Our method Possesses global convergence under nondegenerate assumption.","chinese":"在非退化假設下，本文算法具有全局收斂性。"},{"english":"Aim To research the algorithm for solving nondifferentiable programming.","chinese":"目的研究求解不可微優化問題的算法及收斂性。"},{"english":"The actual proof of convergence is generally not trivial.","chinese":"並在通常條件下證明了方法的全局收斂性。"},{"english":"At the same time, the convergence is proven for solving 4-order plate bending problem.","chinese":"證明了該單元對薄板彎曲問題的收斂性。"},{"english":"The method has good preciseness and less unknown variables and it is convenient to be used in practice.","chinese":"該方法收斂性較好，未知量少，便於實際應用。"},{"english":"Results Convergence of the method under certain conditions is discussed.","chinese":"結果在一定的條件下，收斂性得到了保證。"},{"english":"The relationship between the order M of the exponential series function and astringency was also analyzed.","chinese":"分析了冪數級函數階數M與其收斂性的關係。"},{"english":"We also prove that the method has superlinear convergence rate under some mild conditions.","chinese":"另外在較弱的條件下，證明該方法具有超線性收斂性。"},{"english":"However, at each iteration of the method, several trust region subproblems have to be solved.","chinese":"而且算法的全局收斂性不要求迭代矩陣序列的有界性。"},{"english":"The convergence with discrete parameter of set-valued supermartingale had been investigated by many scholars.","chinese":"離散參數集值上鞅的收斂性已有諸多學者研究過。"},{"english":"Moreover, we discuss the convergence for randomly weighted sums of B-valued martingale difference series.","chinese":"還進一步討論了B值鞅差序列隨機加權和的收斂性。"},{"english":"In chapter 4 we use some numerical experiments to demonstrate the convergence of our schemes.","chinese":"第四章用一些數值試驗說明所提格式的收斂性。"},{"english":"Making you feel its sweety after taste and with strong shrink ality.","chinese":"回味甘甜且帶有較強收斂性。"},{"english":"The convergence theorem of the proposed method is proved based on the exact solution of the subproblem.","chinese":"基於子問題的精確求解，該文證明了算法的收斂性。"},{"english":"The convergence properties of Newton′s method for a type of overdetermined systems of equations were studied.","chinese":"研究了一類超定非線性方程組的牛頓迭代法的收斂性。"}],"related":[]}