{"definition":["to gather\/to collect"],"pinyin":["shou1 ji2"],"simplified":["收集"],"rank":3788.0,"normalized_rank":0.0529990346004785,"fraction":0.00003571328043414484,"cumulative_fraction":0.8233553337280405,"word":"收集","characters":[{"definition":["to receive\/to accept\/to collect\/to put away\/to restrain\/to stop\/in care of (used on address line after name)"],"pinyin":["shou1"],"word":"收"},{"definition":["to gather\/to collect\/collected works\/classifier for sections of a TV series etc: episode"],"pinyin":["ji2"],"word":"集"}],"containing_words":[],"sentences":[{"english":"The garbage collection pause times are the most significant delays any threads encounter.","chinese":"垃圾收集停頓時間是任何線程遇到的最顯著的延遲。"},{"english":"Cell suspension was collected, and then stained after hypotonic treatment.","chinese":"收集細胞懸液，再經低滲處理後滴片染色。"},{"english":"Alterna Professional Haircare uses caviar extract in its Caviar Anti-Aging collection.","chinese":"替代專業護髮品使用魚子醬提取的魚子醬抗衰老收集。"},{"english":"Or you can have a form to collect visitors' comments about your site.","chinese":"或者可以創建表格收集訪問者對網站的評論。"},{"english":"A dual-channel instantaneous soil radon measurement instrument based on the method of electrostatic collection is designed.","chinese":"設計一套基於靜電收集法的雙道瞬時土壤測氡儀。"},{"english":"For non-batch programs, stopping the collector forever is not an option.","chinese":"對於非批處理程序，永久停止收集器並非好的選擇。"},{"english":"Research your topic and learn as much background information as you can.","chinese":"研究你的選題，儘可能多的收集背景資料。"},{"english":"So the good spirit collected wood every night.","chinese":"於是這位善良的神仙每天晚上收集木柴。"},{"english":"With open shop for inheritance award-winning uncomplicated, full-time immersed collection.","chinese":"以開網店爲業的林強遊手好閒，全日沉浸收集。"},{"english":"Cooking water is recaptured to flush toilets, for instance.","chinese":"比如，廚房用水可收集起來沖洗廁所。"},{"english":"All three are stop-the-world copying collectors.","chinese":"所有這三種都是拷貝收集器。"},{"english":"Slip away to innocent days with this fantastically fun collection of jigsaws with a nostalgic theme.","chinese":"溜掉無辜天這個親密樂趣收集靈感與懷舊主題。"},{"english":"The Chinese gather intelligence differently from Western nations, Wise writes.","chinese":"懷斯寫道，中國收集情報的方法與西方國家不同。"},{"english":"Gathering them unemotionally will help those facts come out.","chinese":"非情緒化地收集事實會幫助那些事實浮出水面。"},{"english":"Analyze the information you've collected to identify patterns and insights.","chinese":"分析你收集的信息，來識別模式和見識。"},{"english":"But a collection of facts is no more a science than a heap of stones is a house.","chinese":"但收集的事實沒有更多的科學比礧是一個房子。"}],"related":[{"definition":["to gather\/to collect"],"pinyin":["sou1 ji2"],"word":"搜集"},{"definition":["to gather\/to collect\/to harvest"],"pinyin":["cai3 ji2"],"word":"採集"},{"definition":["material\/resources\/data\/information\/profile (Internet)\/CL:份[fen4],個|个[ge4]"],"pinyin":["zi1 liao4"],"word":"資料"},{"definition":["to search\/to look for"],"pinyin":["sou1 xun2"],"word":"搜尋"},{"definition":["to arrange\/to tidy up\/to sort out\/to straighten out\/to list systematically\/to collate (data, files)\/to pack (luggage)"],"pinyin":["zheng3 li3"],"word":"整理"},{"definition":["stockpile\/to store\/to stockpile\/storage"],"pinyin":["chu3 cun2"],"word":"儲存"},{"definition":["to consult\/to refer to\/to look sth up in a reference source"],"pinyin":["cha2 yue4"],"word":"查閱"},{"definition":["reception (of transmitted signal)\/to receive\/to accept\/to admit\/to take over (e.g. a factory)\/to expropriate"],"pinyin":["jie1 shou1"],"word":"接收"},{"definition":["huge volume"],"pinyin":["hai3 liang4"],"word":"海量"},{"definition":["summary\/to summarize\/to collect (data, receipts etc)\/to gather and report"],"pinyin":["hui4 zong3"],"word":"匯總"},{"definition":["to withdraw (money)\/to collect (left luggage)\/to extract\/to refine"],"pinyin":["ti2 qu3"],"word":"提取"},{"definition":["classification"],"pinyin":["fen1 lei4"],"word":"分類"},{"definition":["to keep\/to preserve\/extant\/to remain (from the past)"],"pinyin":["liu2 cun2"],"word":"留存"},{"definition":["to deposit\/to store\/to leave in sb's care"],"pinyin":["cun2 fang4"],"word":"存放"},{"definition":["to conserve\/to preserve\/to keep\/to save (a file etc) (computing)"],"pinyin":["bao3 cun2"],"word":"保存"},{"definition":["to store up\/to stockpile\/(computer) to save\/to store\/memory\/storage"],"pinyin":["cun2 chu3"],"word":"存儲"}]}