{"definition":["to major (in a field)\/to study a specialty to obtain a higher degree"],"pinyin":["gong1 du2"],"simplified":["攻读"],"rank":13276.0,"normalized_rank":0.18574846445510887,"fraction":0.000005154907937375412,"cumulative_fraction":0.9510910233751187,"word":"攻讀","characters":[{"definition":["to attack\/to accuse\/to study"],"pinyin":["gong1"],"word":"攻"},{"definition":["comma\/phrase marked by pause","to read\/to study\/reading of word (i.e. pronunciation), similar to 拼音[pin1 yin1]"],"pinyin":["dou4","du2"],"word":"讀"}],"containing_words":[],"sentences":[{"english":"I am currently pursuing a PhD degree in Bioinformatics at the UofM.","chinese":"本人現在正在攻讀生物信息學博士的學位。"},{"english":"He is reading electron physics at Qinghua University.","chinese":"他現在在清華大學攻讀電子物理學。"},{"english":"She's presently working on her PhD.","chinese":"她目前在攻讀哲學博士學位。"},{"english":"She is a pre-business major and wants to study accounting or actuarial science. She heard UW-Madison’s business school had a good reputation.","chinese":"她將要進入商學院，想要攻讀會計或是精算。"},{"english":"She currently pursues her first year bachelor music degree in Haute Ecole de Musique de Genève.","chinese":"她現就讀於日內瓦國立高等音樂學院，攻讀學士學位。"},{"english":"Mr. Karras, a doctoral student in education at Ohio State.","chinese":"在俄亥俄州立大學攻讀教育學博士的卡拉斯先生。"},{"english":"She is reading for a degree in physics in Beijing University.","chinese":"她現在正在北京大學攻讀物理學位。"},{"english":"Leblanc spent some time working for his father, and later began studying law.","chinese":"勒布朗爲父親工作了一段時間，後來開始攻讀法律。"},{"english":"Kaylin will be attending University of California, Davis in the fall to study environmental science.","chinese":"黃愷琳將就讀於戴維斯加州大學攻讀環境科學。"},{"english":"Last year I studied sociology and political science in school.","chinese":"去年，我在學校攻讀了社會學和政治學課程。"},{"english":"Chen Xiadan is also studying at Harvard, for an MBA.","chinese":"陳曉丹也在哈佛上學，攻讀MBA。"},{"english":"I study astronomy because I like to look at stars.","chinese":"我攻讀天文學，因爲我喜歡看星星。"},{"english":"I have decided to study gerontology at college.","chinese":"我已經決定大學要攻讀老年病學。"},{"english":"Over there, I studied for my Master's, where I got a Master's in Electrical Aerospace Engineering.","chinese":"在那兒，我攻讀了宇航電氣工程碩士。"},{"english":"I wish to pursue an MBA degree and have contacted the Office of Admissions and Records.","chinese":"我打算攻讀企管碩士學位，並已與註冊處聯繫。"},{"english":"She is now contemplating a doctorate in clinical psychology.","chinese":"如今莉茲仍在哈佛大學攻讀臨牀心理學博士課程。"}],"related":[]}