{"definition":["to storm a strategic pass\/fig. to tackle a key problem"],"pinyin":["gong1 guan1"],"simplified":["攻关"],"rank":9729.0,"normalized_rank":0.13612133253116562,"fraction":0.000008618519089928476,"cumulative_fraction":0.9274110079027528,"word":"攻關","characters":[{"definition":["to attack\/to accuse\/to study"],"pinyin":["gong1"],"word":"攻"},{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["Guan1","guan1"],"word":"關"}],"containing_words":[],"sentences":[{"english":"We brainstormed for most of the afternoon.","chinese":"下午的大部分時間我們都在開獻策攻關會。"},{"english":"The paper introduces the solution to the problem of combing drawing-off roller licked by linen.","chinese":"介紹了對亞麻精梳機引出羅拉纏麻問題的攻關改造。"},{"english":"The Chinese database of feed is a national key problem within the 7th five-year plan.","chinese":"中國飼料數據庫是“七五”國家攻關課題。"},{"english":"Meanwhile , henry company undertake multiple province and city key scientific and technical tackle - key - problem plan project also.","chinese":"同時，亨利公司還承擔着多項省市科技攻關計劃項目。"},{"english":"These can provide useful help to west east gas transmitting project research.","chinese":"爲西氣東輸工程技術攻關課題研究提供有益的幫助。"},{"english":"The development of Gear Shaper Cutter (GSC) CAD system has been a project in the machinery manufacturing corp.","chinese":"插齒刀CAD系統一直是機械加工企業的攻關課題。"},{"english":"The nature of research evidence is the most important research objects.","chinese":"其中證本質研究又是最主要的攻關對象。"},{"english":"The canopy sample is the important and surmount subject of Hongdu Aviation Industry Group.","chinese":"座艙蓋數控樣件是洪都航空工業集團的重點攻關項目。"},{"english":"The general investigation to danger sources is one of major subjects approved by National Science Committee during period of \"Eighth Five Year's Plan .\"","chinese":"危險源普查工作是國家科委批准的“八五”攻關課題。"},{"english":"Through research and test, the self-reliance manufacturing for the core barrel of pressure water reactor internals has been realized.","chinese":"通過攻關試驗，實現了壓水堆吊籃筒體國產化。"},{"english":"Fourthly, stepping up critical SARS research and exploring effective methods of diagnosis and treatment.","chinese":"四是加強科研攻關，研究有效診治辦法。"}],"related":[]}