{"definition":["to let off\/to give out"],"pinyin":["fang4 chu1"],"simplified":["放出"],"rank":9553.0,"normalized_rank":0.13365886418647602,"fraction":0.000008914269761950752,"cumulative_fraction":0.925867842060766,"word":"放出","characters":[{"definition":["to put\/to place\/to release\/to free\/to let go\/to let out\/to set off (fireworks)"],"pinyin":["fang4"],"word":"放"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[{"definition":["to release from jail"],"pinyin":["shi4 fang4 chu1 yu4"],"word":"釋放出獄"}],"sentences":[{"english":"Nitroglycerine is discharged from the bottom of the tank and passes to the filters.","chinese":"硝化甘油可自槽底放出進入過濾器。"},{"english":"America is the country that helped liberate a continent from the march of a madman.","chinese":"美國曾幫助把一個大陸從一個狂人的鐵蹄下解放出來。"},{"english":"This therefore frees the pilot to concentrate on his intended tasks during the combat.","chinese":"這樣可以將飛行員在戰時解放出來更關注於他的任務。"},{"english":"He straightened his back, his fingers freeing nylon line from a speedily revolving reel.","chinese":"他直起腰身，用手指快速地從繞線輪上放出尼龍線。"},{"english":"It is hard to free fools from the chains they revere.","chinese":"將愚人從他們所敬拜的鎖鏈下解放出來是非常困難的。"},{"english":"Let the water out of the bathtub.","chinese":"把澡盆裏的水放出去。"},{"english":"The underlying strength of the U. S. economy is gradually re-asserting itself.","chinese":"美國經濟的內在活力又一次逐漸釋放出來了。"},{"english":"There is the promise of how he sets us free.","chinese":"希望就是他如何將我們解放出來。"},{"english":"So point one, that’s what the Cross frees us from.","chinese":"因此，第一點就是“十字架將我們從何境地解放出來。"},{"english":"It’s unlocking all this great potential that the kids have.","chinese":"機器人能把孩子們全部巨大潛力盡數釋放出來。"},{"english":"Contact with water liberates toxic, highly flammable gas.","chinese":"與水接觸釋放出有毒的，極易燃氣體。"},{"english":"Feng ghost of smoke, ready to attack.","chinese":"鬼鳳放出煙霧，準備偷襲。"},{"english":"We'll post an image of the netherwhelp, offspring of the nether drake flying mount, in the near future.","chinese":"我們將在捎後放出虛空飛龍幼崽的資料。"},{"english":"Is there some set-point which when crossed unleashes the evil?","chinese":"有沒有一個臨界點，當它被跨過之後就會釋放出邪惡？"},{"english":"Poison is released through a channel in the snake's fangs.","chinese":"毒液通過蛇牙裏的一條導管被釋放出來。"},{"english":"He opened the window to free the room of smoke.","chinese":"他打開窗戶把屋裏的煙放出去。"}],"related":[{"definition":["to burst out\/to appear unexpectedly\/to break (media story)"],"pinyin":["bao4 chu1"],"word":"爆出"},{"definition":["to expose (photography)\/(fig.) to expose (a scandal)\/(advertising) exposure\/Taiwan pr. [pu4 guang1]"],"pinyin":["bao4 guang1"],"word":"曝光"},{"definition":["government\/official (approved or issued by an authority)"],"pinyin":["guan1 fang1"],"word":"官方"},{"definition":["to brandish (a figurative weapon, i.e. some measure intended to deal with the situation)\/to resort to (some tactic)"],"pinyin":["ji4 chu1"],"word":"祭出"},{"definition":["to announce\/to make public\/to publish"],"pinyin":["gong1 bu4"],"word":"公佈"},{"definition":["public\/to publish\/to make public"],"pinyin":["gong1 kai1"],"word":"公開"},{"definition":["to toss\/to throw out"],"pinyin":["pao1 chu1"],"word":"拋出"},{"definition":["to release\/to issue\/to announce\/to distribute"],"pinyin":["fa1 bu4"],"word":"發布"},{"definition":["to transmit outwards\/to disseminate\/efferent (nerve)"],"pinyin":["chuan2 chu1"],"word":"傳出"},{"definition":["just as expected\/told you so"],"pinyin":["guo3 bu4 qi2 ran2"],"word":"果不其然"},{"definition":["to forecast\/to predict\/advance notice"],"pinyin":["yu4 gao4"],"word":"預告"},{"definition":["to explode or burst\/to quick fry or quick boil"],"pinyin":["bao4"],"word":"爆"},{"definition":["will\/shall\/to be going to"],"pinyin":["jiang1 yao4"],"word":"將要"},{"definition":["to cause to burn\/to ignite\/to detonate\/a fuse"],"pinyin":["yin3 bao4"],"word":"引爆"},{"definition":["to show one's face\/to appear (in public)"],"pinyin":["lou4 mian4"],"word":"露面"},{"definition":["to issue (an order, decree etc)\/to send out\/to dispatch\/to produce (a sound)\/to let out (a laugh)"],"pinyin":["fa1 chu1"],"word":"發出"}]}