{"definition":["radiology"],"pinyin":["fang4 she4 xue2"],"simplified":["放射学"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"放射學","characters":[{"definition":["to put\/to place\/to release\/to free\/to let go\/to let out\/to set off (fireworks)"],"pinyin":["fang4"],"word":"放"},{"definition":["to shoot\/to launch\/to allude to\/radio- (chemistry)"],"pinyin":["she4"],"word":"射"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"At present, a radiology training program lasts five years.","chinese":"目前，放射學培訓計劃爲期五年。"},{"english":"Definitive diagnosis depends upon either endoscopy or radiology .","chinese":"肯定的診斷有賴於放射學或內腔鏡檢查。"},{"english":"Objective To observe the radiological character of drinking brick-tea type fluorosis.","chinese":"目的觀察飲茶型氟骨症骨關節損害的放射學特點。"},{"english":"The above datas provides anatomical evidence for microsurgery and interventional radiology.","chinese":"研究數據爲顯微外科學和介入放射學提供解剖學依據。"},{"english":"This integration is a prerequisite of teleradiology .","chinese":"這種結合是遠程放射學的先決條件。"},{"english":"Once the prominence of the prosthesis was discovered, a lateral radiograph was performed to confirm position.","chinese":"發現假體的突起後，通過側位放射學檢查證實定位。"},{"english":"Brenner is head of the Center for Radiological Research at Columbia University.","chinese":"布倫納是哥倫比亞大學放射學研究中心的主任。"},{"english":"Objective To explore radiograph film processing in order to satisfy teleradiology.","chinese":"目的研究影像膠片處理以達到遠程放射學的要求。"},{"english":"We also investigated the association between the clinical and radiographic results.","chinese":"我們也研究了臨牀療效和放射學結果之間的關係。"},{"english":"Radiography is the use of ionizing electromagnetic radiation such as X-rays to view objects.","chinese":"放射學是利用電離電磁輻射，如X射線視圖對象。"},{"english":"Radiographic and clinical results were assessed over 3 to 5 years of follow up.","chinese":"在長達3到5年的隨訪中，評估其臨牀及放射學效果。"},{"english":"Microcalcifications are the primary radiological indicator of early breast cancers.","chinese":"鈣化點是乳腺癌早期的一個主要放射學徵象。"},{"english":"Most modern injected radiographic positive contrast media are iodine-based.","chinese":"大多數現代注射放射學陽性造影劑碘。"},{"english":"Radiologic diagnosis will be given precedence .","chinese":"將給予放射學診斷以優先。"},{"english":"Louis, he joined the University of Southern California as an Assistant Professor of Radiology.","chinese":"隨後他進入美國南加州大學任放射學助理教授。"}],"related":[]}