{"definition":["to let go one's hold\/to give up\/to have a free hand"],"pinyin":["fang4 shou3"],"simplified":["放手"],"rank":12669.0,"normalized_rank":0.1772557469254124,"fraction":0.00000559006724305083,"cumulative_fraction":0.9478340993168424,"word":"放手","characters":[{"definition":["to put\/to place\/to release\/to free\/to let go\/to let out\/to set off (fireworks)"],"pinyin":["fang4"],"word":"放"},{"definition":["hand\/(formal) to hold\/person engaged in certain types of work\/person skilled in certain types of work\/personal(ly)\/convenient\/classifier for skill\/CL:雙|双[shuang1],隻|只[zhi1]"],"pinyin":["shou3"],"word":"手"}],"containing_words":[{"definition":["to put one's all into the fight"],"pinyin":["fang4 shou3 yi1 bo2"],"word":"放手一搏"}],"sentences":[{"english":"This hands-off approach could lead to huge risks for the companies.","chinese":"這種放手不管的作法可能會給公司造成巨大風險。"},{"english":"He released his hand and sat down in the chair, fuming.","chinese":"他一把放手，氣鼓鼓坐在那張椅子裏。"},{"english":"Use agreed-upon acceptance tests to increase your confidence prior to hand-off.","chinese":"在放手之前，使用商定的驗收測試來增加您的信心。"},{"english":"The keys to success were that Carnegie Mellon gaudio-videoe us the reins.","chinese":"我們告成的關鍵是卡內基梅隆大學放手讓我們去幹。"},{"english":"When To Guide, When To Let Go Of Teenagers?","chinese":"什麼時候去指導，什麼時候放手不管青少年呢？"},{"english":"Finally, it let go5), surrendering to the pull of gravity.","chinese":"最終，露珠兒屈服於重力的牽引，放手了。"},{"english":"To let go is not to judge, but to allow another to be a human being.","chinese":"放手，就是不要多加評判，而是允許別人自行其事。"},{"english":"Let children play as they will unless they break their heads.","chinese":"放手讓孩子玩，摸爬滾打，不頭破血流就可以。"},{"english":"But if you've got guts and a sense of adventure, why not have it out with him?","chinese":"但是如果你夠膽冒險，爲什麼不放手和他一博？"},{"english":"If you have nothing to lose, you can try everything.","chinese":"如果你一無所有，反而可以放手去做。"},{"english":"The Chinese government does not care what will happen, you are not alone.","chinese":"中國不會放手不管，你孤軍奮戰。"},{"english":"Proceed with the knowledge that something much better will be there to replace it if you only let it.","chinese":"要知道只要你肯放手，還會有更好的替代者。"},{"english":"Let me let go, darlin', won't you.","chinese":"讓我放手吧，親愛的，求你了。"},{"english":"Go the wrong way to remember to love the wrong person to know how to let go.","chinese":"走錯了路饌要記得回頭愛錯了人要懂得放手。"},{"english":"We can learn to let go so that what we’re building lives on without us.","chinese":"我們可以學會放手，這樣即使我們不在生活依舊繼續。"},{"english":"There's no shortage of great ideas and no shortage of people willing to give it a go . . . for a while.","chinese":"總會有靈光一現的想法和人，在那一刻願意放手一博。"}],"related":[{"definition":["to make a decision when it's time to decide"],"pinyin":["dang1 duan4 ze2 duan4"],"word":"當斷則斷"},{"definition":["to let go of sth\/to give up"],"pinyin":["sa1 shou3"],"word":"撒手"},{"definition":["to agree\/to consent\/to be ready (to do sth)\/willing"],"pinyin":["ken3"],"word":"肯"},{"definition":["to get away from\/to withdraw\/to free oneself"],"pinyin":["chou1 shen1"],"word":"抽身"},{"definition":["to delegate power\/to decentralize"],"pinyin":["fang4 quan2"],"word":"放權"},{"definition":["to move aside\/to get out of the way\/to back down\/to concede"],"pinyin":["tui4 rang4"],"word":"退讓"},{"definition":["lit. if you have to use force to break a melon off the vine, it won't taste sweet (because it's only when the melon is ripe that it can be removed with just a slight twist) (idiom)\/fig. if sth is not meant to be, it's no use trying to force it to happen"],"pinyin":["qiang3 niu3 de5 gua1 bu4 tian2"],"word":"強扭的瓜不甜"},{"definition":["to concede\/to admit defeat"],"pinyin":["ren4 shu1"],"word":"認輸"},{"definition":["to help sb accomplish his aim\/to help sb succeed\/to complete\/to make whole\/to round off"],"pinyin":["cheng2 quan2"],"word":"成全"},{"definition":["to lay down\/to put down\/to let go of\/to relinquish\/to set aside\/to lower (the blinds etc)"],"pinyin":["fang4 xia4"],"word":"放下"},{"definition":["lit. quick sword cuts through tangled hemp (idiom); decisive action in a complex situation\/cutting the Gordian knot"],"pinyin":["kuai4 dao1 zhan3 luan4 ma2"],"word":"快刀斬亂麻"},{"definition":["to give up\/to abandon\/to abort"],"pinyin":["she3 qi4"],"word":"捨棄"},{"definition":["to accept a compromise"],"pinyin":["wei3 qu1 qiu2 quan2"],"word":"委曲求全"},{"definition":["to renounce\/to abandon\/to give up"],"pinyin":["fang4 qi4"],"word":"放棄"},{"definition":["to be willing to part with sth"],"pinyin":["she3 de5"],"word":"捨得"},{"definition":["better to just get the pain over with, rather than prolong the agony"],"pinyin":["chang2 tong4 bu4 ru2 duan3 tong4"],"word":"長痛不如短痛"}]}