{"definition":["to let pass"],"pinyin":["fang4 xing2"],"simplified":["放行"],"rank":11800.0,"normalized_rank":0.16509730947350748,"fraction":0.000006283606948271869,"cumulative_fraction":0.9426817125590609,"word":"放行","characters":[{"definition":["to put\/to place\/to release\/to free\/to let go\/to let out\/to set off (fireworks)"],"pinyin":["fang4"],"word":"放"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"}],"containing_words":[],"sentences":[{"english":"The tariff will be calculated from the date goods entered into China.","chinese":"計徵稅款的期限自貨物放行之日起計算。"},{"english":"Monitor and control serial production quality and release technical changes in QDA system.","chinese":"監視和控制序列化生產質量和放行技術變更。"},{"english":"Meet the requirements and audit staff products can only be released after the signing.","chinese":"符合要求並有審覈人員簽字後方可將產品放行。"},{"english":"I'll sign them out and gua rant ee their good behavior.","chinese":"我給他們簽字放行，保證他們行爲端正。"},{"english":"Receiving, sampling, testing, release procedures have been established to fulfill this Subpart.","chinese":"建立接收，取樣，測試與放行程序。"},{"english":"The Customs office shall let them pass after checking the Certificate of Approval for Special Articles issued by the health and quarantine organ.","chinese":"海關憑衛生檢疫機關簽發的特殊物品審批單放行。"},{"english":"Endorsement of aircraft types means the holder is qualified to issue maintenance release for such aircraft at the date of endorsement.","chinese":"持照人在機型簽署之日起具有對該機型的放行資格。"},{"english":"And cover three types of inspections in the bill of lading release white chapter.","chinese":"並在白色提貨單上蓋三檢放行章。"},{"english":"If it do need chemical test, the goods can be released after the customs get a sample.","chinese":"確需進行化驗的，海關抽樣後，貨物可先予放行。"},{"english":"The custom released the goods against payment of a fine.","chinese":"在付完罰款後海關放行貨物。"},{"english":"Dissolution data on split tablet portions should meet finished-product release requirements.","chinese":"刻痕片劑部分的溶出度數據應該滿足製劑放行要求。"},{"english":"The man explained that he was just waiting for “the green light.","chinese":"那人解釋說他只是在等待“綠燈放行”。"},{"english":"The trouble is that La Blaugrana have imposed a minimum release fee of 90 million.","chinese":"麻煩的是，巴薩實行的最低放行費爲9千萬英鎊。"},{"english":"Filled cylinders should be held in quarantine until released by the qualified person.","chinese":"充好的氣瓶應保持在待檢區，直至有資格的人員放行。"},{"english":"Endorsement of item rating means the holder is qualified to issue maintenance release for such item at the date of endorsement.","chinese":"持照人在項目簽署之日起具有對該項目的放行資格。"},{"english":"The man explained that he was just waiting for “the green light.”","chinese":"那人解釋說他只是在等待“綠燈放行”。"}],"related":[{"definition":["to go through\/to pass through\/to be in general use"],"pinyin":["tong1 xing2"],"word":"通行"},{"definition":["inspection\/to examine"],"pinyin":["cha2 yan4"],"word":"查驗"},{"definition":["to enter or exit\/to go through"],"pinyin":["jin4 chu1"],"word":"進出"},{"definition":["to allow\/to grant\/to permit"],"pinyin":["zhun3 xu3"],"word":"准許"},{"definition":["to control\/to restrict\/(PRC law) non-custodial sentence with specified restrictions on one's activities for up to 3 years (e.g. not to participate in demonstrations)"],"pinyin":["guan3 zhi4"],"word":"管制"},{"definition":["detour\/long way around"],"pinyin":["rao4 xing2"],"word":"繞行"},{"definition":["a pass (authority to enter)\/a laissez-passer or safe conduct"],"pinyin":["tong1 xing2 zheng4"],"word":"通行證"},{"definition":["to go by a roundabout route\/to take a detour\/(medicine or civil engineering) bypass"],"pinyin":["rao4 dao4"],"word":"繞道"},{"definition":["(of a car, ship, train etc) to enter"],"pinyin":["shi3 ru4"],"word":"駛入"},{"definition":["to enter a country"],"pinyin":["ru4 jing4"],"word":"入境"},{"definition":["to pass through a country's territory\/transit"],"pinyin":["guo4 jing4"],"word":"過境"},{"definition":["(of a security guard etc) to be on duty, keeping an eye on things\/to keep watch"],"pinyin":["zhi2 shou3"],"word":"值守"},{"definition":["to leave port\/to put off"],"pinyin":["shi3 chu1"],"word":"駛出"},{"definition":["to leave a country or region\/outbound (tourism)"],"pinyin":["chu1 jing4"],"word":"出境"},{"definition":["to permit\/to allow"],"pinyin":["yun3 xu3"],"word":"允許"},{"definition":["to steer (the plane) away from\/to drive away (from a place)\/to leave"],"pinyin":["shi3 li2"],"word":"駛離"}]}