{"definition":["to let blood (Chinese medicine)\/to bleed\/to stab sb (slang)"],"pinyin":["fang4 xue4"],"simplified":["放血"],"rank":39328.0,"normalized_rank":0.5502497446588223,"fraction":4.0917528809399596e-7,"cumulative_fraction":0.9962220222325822,"word":"放血","characters":[{"definition":["to put\/to place\/to release\/to free\/to let go\/to let out\/to set off (fireworks)"],"pinyin":["fang4"],"word":"放"},{"definition":["blood\/colloquial pr. [xie3]\/CL:滴[di1],片[pian4]"],"pinyin":["xue4"],"word":"血"}],"containing_words":[],"sentences":[{"english":"His extreme practices aroused the alarm and horror of European bloodletting physicians .","chinese":"他的極端行爲激起了歐洲放血醫師的警覺和恐慌。"},{"english":"A sharp skinning or boning knife is appropriate for this part of the operation.","chinese":"放血需要一把鋒利的去皮刀或剔骨刀。"},{"english":"Objective To observe the curative effect of blood-letting therapy on acne vulgaris.","chinese":"目的觀察針刺放血治療尋常痤瘡的療效。"},{"english":"In smaller operations, the pig is hoisted for bleeding.","chinese":"小型屠宰場中，生豬都是被吊起放血。"},{"english":"Their succor amounted to a blood-letting and a few cold compresses.","chinese":"他們的救助方法就是放血或用冷敷布降溫。"},{"english":"It seems keener on blood transfusions than on bloodletting.","chinese":"相比於給經濟放血，它看起來更熱衷於給它輸血。"},{"english":"Exsanguination , as long as my blood wasn't being used for something awful.","chinese":"因放血而死，只要我的血沒被用在邪門歪道上。"},{"english":"Before that bloodletting and leaches were used.","chinese":"在這之前採用的則是放血和水蛭療法。"},{"english":"But if Mars shall be in Capricorn, it makes a destroyer of men, and one that delights to shed blood.","chinese":"若火星位於魔羯，將危害人命且不利於放血者。"},{"english":"The pricking and rubbing methods is one of the collateral pricking bloodletting methods popular in the northwest Chinese folk.","chinese":"挑擦放寒方法爲西北普遍流行的民間刺絡放血法之一。"}],"related":[{"definition":["to give or have an acupuncture treatment"],"pinyin":["zha1 zhen1"],"word":"扎針"},{"definition":["acupuncture and moxibustion\/to give or have acupuncture and moxibustion"],"pinyin":["zhen1 jiu3"],"word":"針灸"},{"definition":["to pull out hair\/to pluck\/epilation"],"pinyin":["ba2 mao2"],"word":"拔毛"},{"definition":["internal organs\/viscera"],"pinyin":["nei4 zang4"],"word":"內臟"},{"definition":["to prick with a needle\/to treat by acupuncture"],"pinyin":["zhen1 ci4"],"word":"針刺"},{"definition":["acupuncture needle"],"pinyin":["hao2 zhen1"],"word":"毫針"},{"definition":["to slaughter\/to butcher\/to put down"],"pinyin":["zai3 sha1"],"word":"宰殺"},{"definition":["suction cup (used in Chinese medicine to draw the blood and qi 氣|气)\/detachable suction chimney to make a stove draw"],"pinyin":["ba2 huo3 guan4"],"word":"拔火罐"},{"definition":["to cut\/to cut apart"],"pinyin":["ge1"],"word":"割"},{"definition":["cupping glass\/fire cupping (acupressure technique of Chinese medicine, with fired vacuum cup applied to the skin)\/ventouse (vacuum method used in obstetrics)"],"pinyin":["ba2 guan4"],"word":"拔罐"},{"definition":["knife\/CL:把[ba3]"],"pinyin":["dao1 zi5"],"word":"刀子"},{"definition":["to dissect (an animal)\/to analyze\/anatomy"],"pinyin":["jie3 pou1"],"word":"解剖"},{"definition":["gua sha (technique in TCM)"],"pinyin":["gua1 sha1"],"word":"刮痧"},{"definition":["the edge of a knife\/cut\/incision"],"pinyin":["dao1 kou3"],"word":"刀口"},{"definition":["draw out pus by applying a plaster to the affected area"],"pinyin":["ba2 du2"],"word":"拔毒"},{"definition":["to cure ills with poison (TCM)\/to fight evil with evil\/set a thief to catch a thief\/to fight fire with fire"],"pinyin":["yi3 du2 gong1 du2"],"word":"以毒攻毒"}]}