{"definition":["deliberately mystifying\/to make sth unnecessarily complicated"],"pinyin":["gu4 nong4 xuan2 xu1"],"simplified":["故弄玄虚"],"rank":37646.0,"normalized_rank":0.5267163824101408,"fraction":4.790985713608613e-7,"cumulative_fraction":0.9954758083984164,"word":"故弄玄虛","characters":[{"definition":["happening\/instance\/reason\/cause\/intentional\/former\/old\/friend\/therefore\/hence\/(of people) to die, dead"],"pinyin":["gu4"],"word":"故"},{"definition":["lane\/alley","to do\/to manage\/to handle\/to play with\/to fool with\/to mess with\/to fix\/to toy with"],"pinyin":["long4","nong4"],"word":"弄"},{"definition":["black\/mysterious"],"pinyin":["xuan2"],"word":"玄"},{"definition":["emptiness\/void\/abstract theory or guiding principles\/empty or unoccupied\/diffident or timid\/false\/humble or modest\/(of health) weak\/virtual\/in vain"],"pinyin":["xu1"],"word":"虛"}],"containing_words":[],"sentences":[{"english":"No educated guesses' about what to do or chart reading.","chinese":"沒有故弄玄虛的猜測和圖表統計分析。"},{"english":"It will be my pleasure to share with you some of this double-talk so typical of our times.","chinese":"我很樂意摘錄幾則典型的故弄玄虛的評論，與君共享。"},{"english":"However, the audience will feel that the story is too hypocritical, director mystify .","chinese":"不過，也會有觀衆覺得故事太矯情，導演故弄玄虛。"},{"english":"On some level this definition may seem like quite a lot of scientific mumbo-jumbo.","chinese":"在某種程度上，這一定義可能顯得有點故弄玄虛。"},{"english":"I want to be deliberately mystifying in here neither, he does not have but courage.","chinese":"我也不想在這裏故弄玄虛，可是他沒有勇氣。"}],"related":[{"definition":["lit. chasing the wind and clutching at shadows (idiom); fig. groundless accusations\/to act on hearsay evidence"],"pinyin":["bu3 feng1 zhuo1 ying3"],"word":"捕風捉影"},{"definition":["lit. draw legs on a snake (idiom); fig. to ruin the effect by adding sth superfluous\/to overdo it"],"pinyin":["hua4 she2 tian1 zu2"],"word":"畫蛇添足"},{"definition":["to force someone to do something"],"pinyin":["qiang3 ren2 suo3 nan2"],"word":"強人所難"},{"definition":["not the least bit concerned\/completely indifferent"],"pinyin":["mo4 bu4 guan1 xin1"],"word":"漠不關心"},{"definition":["to criticize (as a matter of principle)"],"pinyin":["shang4 gang1 shang4 xian4"],"word":"上綱上線"},{"definition":["tone sandhi\/modified tone\/(music) to change key\/modulation"],"pinyin":["bian4 diao4"],"word":"變調"},{"definition":["to avoid the important and dwell on the trivial\/to keep silent about major charges while admitting minor ones"],"pinyin":["bi4 zhong4 jiu4 qing1"],"word":"避重就輕"},{"definition":["red in the face\/extremely angry"],"pinyin":["lian3 hong2 bo2 zi5 cu1"],"word":"臉紅脖子粗"},{"definition":["universally shocking\/to offend the whole of society"],"pinyin":["jing1 shi4 hai4 su2"],"word":"驚世駭俗"},{"definition":["to make thoughtless remarks (idiom)\/to criticize\/gossip"],"pinyin":["shuo1 san1 dao4 si4"],"word":"說三道四"},{"definition":["lit. to invert black and white (idiom); to distort the truth deliberately\/to misrepresent the facts\/to invert right and wrong"],"pinyin":["dian1 dao3 hei1 bai2"],"word":"顛倒黑白"},{"definition":["frightening words to scare people (idiom); alarmist talk\/reds under the beds"],"pinyin":["wei1 yan2 song3 ting1"],"word":"危言聳聽"},{"definition":["lit. you hoodwink me and I cheat you (idiom); fig. mutual deception\/each tries to outwit the other\/dog eats dog and devil take the hindmost"],"pinyin":["er3 yu2 wo3 zha4"],"word":"爾虞我詐"},{"definition":["lit. a deluge of heavenly flowers (idiom)\/fig. extravagant embellishments\/hype"],"pinyin":["tian1 hua1 luan4 zhui4"],"word":"天花亂墜"},{"definition":["to sneer"],"pinyin":["ji1 xiao4"],"word":"譏笑"},{"definition":["to quote out of context (idiom)"],"pinyin":["duan4 zhang1 qu3 yi4"],"word":"斷章取義"}]}