{"definition":["potency\/titer (measure of effective concentration in virology or chemical pathology, defined in terms of potency after dilution by titration)\/valence (perceived value in psychology)\/valency"],"pinyin":["xiao4 jia4"],"simplified":["效价"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"效價","characters":[{"definition":["effect\/efficacy\/to imitate"],"pinyin":["xiao4"],"word":"效"},{"definition":["great\/good\/middleman\/servant","price\/value\/(chemistry) valence"],"pinyin":["jia4","jie5"],"word":"價"}],"containing_words":[{"definition":["potency\/titer (measure of effective concentration in virology or chemical pathology, defined in terms of potency after dilution by titration)"],"pinyin":["xiao4 jia4 neng2"],"word":"效價能"}],"sentences":[{"english":"The immunity serum titer was mensurated by the routine ELISA.","chinese":"常規ELISA法測定免疫血清效價。"},{"english":"If you are a husband you have to do other ABO blood type antibody titer.","chinese":"如果你是O你老公是其他血型還要做ABO抗體效價。"},{"english":"Methods The titer and affinity of anti-A secreted by hybridoma were tested by tube method and slide method.","chinese":"通過試管法和玻片法檢測抗A抗體的效價和親和力。"},{"english":"OBJECTIVE To develop a diffusion method to determine the meleumycin tablets.","chinese":"目的建立麥白黴素片效價的微生物比濁法。"},{"english":"Valence considers both the goals and needs of the individual.","chinese":"效價主要關心的是個人的目標與需要。"},{"english":"OBJECTIVE To establish a turbidimetric method for the content determination of meleumycin preparations.","chinese":"目的建立比濁法測定麥白黴素製劑效價的方法。"},{"english":"OBJECTIVE To develop a method to determine the potency of Acetylspiramycin tablets.","chinese":"目的建立測定乙酰螺旋黴素片效價的方法。"},{"english":"Objective To verify the feasibility of a method for determining the titer of fosfomycin sodium by turbidimetry.","chinese":"目的驗證比濁法測定磷黴素鈉效價方法的可行性。"},{"english":"Serum titers were tested by mouse neutralization test.","chinese":"採用小鼠中和試驗測定血清效價。"},{"english":"OBJECTIVE To develop a turbidimetric method to determine Kanamycin sulfate injection.","chinese":"目的建立測定硫酸卡那黴素效價的方法。"},{"english":"The serum of the immunized ducklings were collected and the antibody titer were measured by neutralizing test.","chinese":"同時對免疫的雛鴨採血，中和試驗測定血清的效價。"},{"english":"Experiment showed that the higher the glycerol tolerant, the higher clavulanic titre is.","chinese":"試驗表明，甘油耐受量高的菌株克拉維酸效價也高。"},{"english":"Objective To establish a turbidimetric method for the contents determination of minocycline hydrochloride capsule.","chinese":"目的建立濁度法測定鹽酸米諾環素膠囊的效價。"}],"related":[]}