{"definition":["course syllabus\/class curriculum"],"pinyin":["jiao4 xue2 da4 gang1"],"simplified":["教学大纲"],"rank":31184.0,"normalized_rank":0.436304618527276,"fraction":8.484219673215498e-7,"cumulative_fraction":0.9913010501572238,"word":"教學大綱","characters":[{"definition":["religion\/teaching\/to make\/to cause\/to tell","surname Jiao","to teach"],"pinyin":["Jiao4","jiao1","jiao4"],"word":"教"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["head rope of a fishing net\/guiding principle\/key link\/class (taxonomy)\/outline\/program"],"pinyin":["gang1"],"word":"綱"}],"containing_words":[],"sentences":[{"english":"In terms of the syllabus, it's going to be online.","chinese":"至於教學大綱，網上會有。"},{"english":"So that's the piece of the syllabus that I can't tell you about.","chinese":"這就是教學大綱沒能告訴大家的。"},{"english":"I want to talk a little about the syllabus and the requirements.","chinese":"我想談一下教學大綱及要求。"},{"english":"No sections this week. Look at the syllabus.","chinese":"這周沒有討論課，請看教學大綱。"},{"english":"The information is here on the syllabus.","chinese":"書名在教學大綱上有。"},{"english":"Anybody else? Questions? Okay,look at your syllabus.","chinese":"還有其他問題嗎，好，請看教學大綱。"},{"english":"The syllabus, a gallery, and other links will be posted on the World-Wide Web.","chinese":"教學大綱，圖片庫以及其他鏈接將在網上公佈。"},{"english":"It's not--Well, we don't have a lot of English poets on this syllabus.","chinese":"我們在教學大綱上沒有很多英國詩人。"},{"english":"Take the time to look at class descriptions and syllabi.","chinese":"花點時間去了解課程內容和教學大綱。"},{"english":"An adequate syllabus is what China's undergraduate-level translation teaching needs urgently right now.","chinese":"翻譯專業本科教學的當務之急是設計一份教學大綱。"},{"english":"So, that's how we get to the syllabus.","chinese":"我們就這樣講到了教學大綱。"},{"english":"So what do you do with those on a syllabus?","chinese":"我要怎麼處理我的教學大綱呢？"},{"english":"And the figure training program in teaching program is 5%.","chinese":"形體訓練佔教學大綱的比例爲5%。"},{"english":"A version of the syllabus and calendar is also available that lists all aspects of each class together.","chinese":"亦可取得詳列每堂課程內容的教學大綱與進度表。"}],"related":[]}