{"definition":["(gun) shot\/canister shot"],"pinyin":["san3 dan4"],"simplified":["散弹"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"散彈","characters":[{"definition":["scattered\/loose\/to come loose\/to fall apart\/leisurely\/powdered medicine","to scatter\/to break up (a meeting etc)\/to disperse\/to disseminate\/to dispel\/(coll.) to sack"],"pinyin":["san3","san4"],"word":"散"},{"definition":["crossball\/bullet\/shot\/shell\/ball","to pluck (a string)\/to play (a string instrument)\/to spring or leap\/to shoot (e.g. with a catapult)\/(of cotton) to fluff or tease\/to flick\/to flip\/to accuse\/to impeach\/elastic (of materials)"],"pinyin":["dan4","tan2"],"word":"彈"}],"containing_words":[{"definition":["shotgun"],"pinyin":["san3 dan4 qiang1"],"word":"散彈槍"}],"sentences":[{"english":"The basic idea is to write a program to analyze a shotgun’s shot pattern.","chinese":"基本的想法是寫一個程序分析散彈槍的射擊模式。"},{"english":"Actually, shotguns are very good home-defense weapons.","chinese":"其實，散彈槍都是很好的家庭防禦武器。"},{"english":"Random Submachine Gun, Shotgun, and Pistol at beginning of round.","chinese":"隨機槍械組合，包含衝鋒槍，散彈槍和手槍。"},{"english":"The shotgun is a better anti-zombie strategy than cremation.","chinese":"相比火，散彈槍是更好的打殭屍武器。"},{"english":"The Chief said once no one can stare down a shotgun .","chinese":"一旦沒有人能注視下來一個散彈獵槍，領袖說。"},{"english":"Police are again using shotguns loaded with beanbags rubber bullets to disperse the crowds.","chinese":"警察再次使用裝滿橡膠彈的散彈槍來驅散人羣。"},{"english":"We incorporate a loaded shotgun in our home defense planning.","chinese":"我們納入散彈槍在我們的家防衛計劃。"},{"english":"Rationing:Kill an enemy with your shotgun while you're out of minigun ammo.","chinese":"當你機槍沒子彈時，用散彈槍解決敵人。"},{"english":"The Shot Pistol has two barrels and fires buckshot rounds creating a wider firing cone and high damage up close.","chinese":"擁有雙管的散彈手槍，範圍攻擊，越近殺傷力越高。"}],"related":[]}