{"definition":["powder medicine"],"pinyin":["san3 ji4"],"simplified":["散剂"],"rank":56015.0,"normalized_rank":0.7837225245897051,"fraction":7.225892529665643e-8,"cumulative_fraction":0.999591289504674,"word":"散劑","characters":[{"definition":["scattered\/loose\/to come loose\/to fall apart\/leisurely\/powdered medicine","to scatter\/to break up (a meeting etc)\/to disperse\/to disseminate\/to dispel\/(coll.) to sack"],"pinyin":["san3","san4"],"word":"散"},{"definition":["dose (medicine)"],"pinyin":["ji4"],"word":"劑"}],"containing_words":[],"sentences":[{"english":"Corexit 9500 was found to be one of the most toxic dispersal agents ever developed.","chinese":"被發現是有史以來生產的最具毒性的分散劑之一。"},{"english":"Unique peace and quiet dispersant and antioxidant.","chinese":"獨特的清淨分散劑和抗氧化劑。"},{"english":"The experiment shows that PAMPS is a kind of fine dispersion and scale inhibitor.","chinese":"這說明PAMPS是一種優良的阻垢分散劑。"},{"english":"Solubilization is an important property of dispersion agent.","chinese":"增溶作用是分散劑的一個重要性質。"},{"english":"Aim To establish a method for the determination of ketoconazole in compound ketoconazole powder.","chinese":"目的建立酮康唑的外用複方散劑的含量測定方法。"},{"english":"Disperse additive is advantageous to transparence .","chinese":"分散劑有利於透明改性。"},{"english":"Usually, HEDP is used together with polycarboxylic acid.","chinese":"通常與聚羧酸型阻垢分散劑配合使用。"},{"english":"To improving the gasohol's stability, dispersant was added.","chinese":"通過加入分散劑的方法改善乙醇汽油的穩定性。"},{"english":"The type of dispersant mainly influence the surface structure characteristic of coal particle.","chinese":"分散劑的種類主要影響到改性煤粒表面的結構特徵。"},{"english":"The dispersivity of carbon fibers was closely related to the category and mass fraction of dispersants.","chinese":"短碳纖維的分散性與分散劑的種類和質量分數有關。"},{"english":"The effect of dispersant on the preparation of HMX by impinging method was studied.","chinese":"研究了分散劑在撞擊法制備超細HMX中的作用。"},{"english":"Dye dispersant was synthesized using kraft lignin as raw material.","chinese":"以松木硫酸鹽木質素爲原料合成染料分散劑。"},{"english":"Adding a proper amount of calcium-containing detergent can increase the hydrolytic and thermal stabilities of the fluid.","chinese":"適量的鈣鹽清淨分散劑可提高水解安定性和熱穩定性。"},{"english":"ABSTRACT Objective To establish an HPLC method for the determination of azithromycin powder.","chinese":"目的建立HPLC法測定阿奇黴素散劑的含量。"},{"english":"The modifier is chemically configured to improve the efficacy of the naphthalene sulfonate dispersant.","chinese":"所述改性劑在化學上認爲可改善萘磺酸鹽分散劑效力。"},{"english":"Objective To observe the effect of anti-influenza virus of Shengjiang powder.","chinese":"目的觀察升降散散劑的抗流感病毒作用。"}],"related":[]}