{"definition":["to disperse\/to fall scattered\/to sprinkle"],"pinyin":["san4 luo4"],"simplified":["散落"],"rank":10602.0,"normalized_rank":0.14833573517272255,"fraction":0.0000075127385664493396,"cumulative_fraction":0.93444773649247,"word":"散落","characters":[{"definition":["scattered\/loose\/to come loose\/to fall apart\/leisurely\/powdered medicine","to scatter\/to break up (a meeting etc)\/to disperse\/to disseminate\/to dispel\/(coll.) to sack"],"pinyin":["san3","san4"],"word":"散"},{"definition":["colloquial reading for 落[luo4] in certain compounds","to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["la4","lao4","luo4"],"word":"落"}],"containing_words":[],"sentences":[{"english":"Dozens of dead cats were found in plastic bins around the house.","chinese":"從散落在屋裏的塑料箱內還發現了幾十只貓的屍體。"},{"english":"Dozens of hoses snaked through open doors or holes in the walls.","chinese":"從門洞和牆洞裏伸出許多水管，盤繞散落。"},{"english":"There were rocks underfoot and boulders about them, rough to the touch like scoria.","chinese":"粗糙的石頭散落在腳下，也矗立在身邊。"},{"english":"The hotel lobby was a mess of glass and bricks.","chinese":"酒店大廳到處是散落的碎玻璃和磚塊。"},{"english":"Are plugs of compacted soil produced through aeration of fairways loose impediments?","chinese":"球道中積水井蓋上散落的淤泥算不算散置障礙物？"},{"english":"The women in red shirts are with necked-back and dotting in the classical garden.","chinese":"紅裙女子，赤裸背影，散落在古典的庭院裏。"},{"english":"Some are strewed with peonies, bats and other auspicious patterns to bring the owner good fortune.","chinese":"一些散落的牡丹，蝙蝠等吉祥圖案帶來好運氣的人。"},{"english":"Her hair straggled over her shoulders.","chinese":"她的頭髮散落在她的肩膀上。"},{"english":"It broken up into scraps of songs and lay scattered at your feet.","chinese":"它破裂成歌的碎片，散落在你的腳下。"},{"english":"Black fragments as large as apples landed in the desert.","chinese":"蘋果一樣大的黑色碎片散落在沙漠中。"},{"english":"Today the remains of these \"ghost towns\" are scattered about Death Valley.","chinese":"而今的人去房空的“鬼城”散落在死亡谷上。"},{"english":"When he bends to pick it up, he knocks over his portfolio and papers fall out.","chinese":"當他彎身去揀時，又撞翻了公文包，文件散落一地。"},{"english":"Never said that before the separation, have been scattered in the earth.","chinese":"那些以前說着永不分離的人，早已經散落在天涯了。"},{"english":"Above me, the stars are specks of silver paint on a charcoal canvas.","chinese":"在我頭頂上方，星星如散落在木炭畫布上的銀色斑點。"},{"english":"A few minutes later, a noisy rain begins to scatter itself across the rooftops.","chinese":"幾分鐘後，一陣嘈雜的雨開始散落在屋頂。"},{"english":"There are several scattered pavilions and teahouses throughout the park.","chinese":"有幾個亭子散落其間，茶室遍佈公園。"}],"related":[{"definition":["to waft (through the air)\/to drift"],"pinyin":["piao1 san4"],"word":"飄散"},{"definition":["chip\/fragment\/splinter\/tatter"],"pinyin":["sui4 pian4"],"word":"碎片"},{"definition":["fragments\/particles"],"pinyin":["sui4 xie4"],"word":"碎屑"},{"definition":["to leave behind (inadvertently)\/to forget\/to omit\/to leave out"],"pinyin":["yi2 luo4"],"word":"遺落"},{"definition":["remains\/wreckage"],"pinyin":["can2 hai2"],"word":"殘骸"},{"definition":["to float down\/to fall gently (snowflakes, leaves etc)"],"pinyin":["piao1 luo4"],"word":"飄落"},{"definition":["in disorder\/a complete mess"],"pinyin":["ling2 luan4"],"word":"零亂"},{"definition":["fragment"],"pinyin":["sui4 kuai4"],"word":"碎塊"},{"definition":["to drift\/to wave\/to float on the waves\/to flutter in the wind"],"pinyin":["piao1 dang4"],"word":"飄盪"},{"definition":["to swirl in the air (of thickly falling snowflakes, flower petals etc)\/to flutter about"],"pinyin":["fen1 fei1"],"word":"紛飛"},{"definition":["to leave behind\/to hand down"],"pinyin":["yi2 liu2"],"word":"遺留"},{"definition":["suave\/graceful\/fluent and elegant (calligraphy)"],"pinyin":["piao1 sa3"],"word":"飄灑"},{"definition":["to disperse\/to scatter in all directions"],"pinyin":["si4 san4"],"word":"四散"},{"definition":["broken\/dilapidated"],"pinyin":["can2 po4"],"word":"殘破"},{"definition":["scattered"],"pinyin":["ling2 san3"],"word":"零散"},{"definition":["to fall down"],"pinyin":["diao4 luo4"],"word":"掉落"}]}