{"definition":["to get sth open by tapping or striking it\/(figuratively, when followed by sth like ∼的大門|∼的大门) to open the door to ~\/to gain access to ~"],"pinyin":["qiao1 kai1"],"simplified":["敲开"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"敲開","characters":[{"definition":["to hit\/to strike\/to tap\/to rap\/to knock\/to rip sb off\/to overcharge"],"pinyin":["qiao1"],"word":"敲"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"}],"containing_words":[],"sentences":[{"english":"So that day she went on her errand of mercy, and knocked at the door of Toad’s cell.","chinese":"於是有一天，她就敲開蟾蜍囚室的門，去做行善的事。"},{"english":"Crack the eggs and separate yolks from whites, very carefully.","chinese":"敲開蛋殼，然後小心地把蛋黃從蛋清中分離出來。"},{"english":"When the day came, the ugly girl knocked on the basket-maker's door.","chinese":"到約定時間時，醜女孩敲開了制籃商的門。"},{"english":"Want in the breeze of the night to marvel, knock to open lonesome heartstring for you.","chinese":"不要在晚風中驚歎，替你敲開寂寞的心絃。"},{"english":"I hope my love which is as fierce as death, can open your heart.","chinese":"願我如死般強烈的愛能敲開你愛的心扉。"},{"english":"Then, he lent to her where to pour water, gently knocking at her door.","chinese":"於是，他借去她哪裏倒水，輕輕地敲開了她的門。"},{"english":"I'll break open my bag.","chinese":"我將敲開我的箱子。"},{"english":"At that point her husband happened to knock on the door.","chinese":"就在這時她的丈夫正好回來敲開房門。"},{"english":"Flavor A quick blow to the head, and it's lights out.","chinese":"敲開它的頭，吹熄它的生命之光。"},{"english":"Otherwise you may find yourself knocking on the door of some local begging for a gas can.","chinese":"否則，你只有敲開當地人的大門乞討一罐汽油。"},{"english":"I actually tried going on movie studio lots and knocking on producer's doors.","chinese":"事實上，我一直都嘗試去電影工作室敲開製作人的門。"},{"english":"They came to Sichuan Fine Arts Institute and knocked the door of Zhang Xiaogang who taught there.","chinese":"她們來到四川美院，敲開了在那教書的張曉剛的門。"},{"english":"All these certifications became useful jetton to knock at the door of good company.","chinese":"因爲這些認證成爲敲開優秀公司大門的籌碼。"},{"english":"We realized the main barrier to entry is going to be scale.","chinese":"我們意識到，規模是敲開市場的主要壁壘。"},{"english":"He walked into town, and knocked on the tailor's door.","chinese":"他走進鎮子裏，敲開了裁縫家的門。"},{"english":"I prayed no one from school was behind those doors.","chinese":"我曾禱告我敲開的那些門後不會有我的同學。"}],"related":[]}