{"definition":["lit. a brick as a door knocker (idiom); fig. a temporary expedient\/to use sb as a stepping stone to fortune"],"pinyin":["qiao1 men2 zhuan1"],"simplified":["敲门砖"],"rank":31584.0,"normalized_rank":0.4419011374924797,"fraction":8.189344866954393e-7,"cumulative_fraction":0.9916344722535668,"word":"敲門磚","characters":[{"definition":["to hit\/to strike\/to tap\/to rap\/to knock\/to rip sb off\/to overcharge"],"pinyin":["qiao1"],"word":"敲"},{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["Men2","men2"],"word":"門"},{"definition":["brick\/CL:塊|块[kuai4]"],"pinyin":["zhuan1"],"word":"磚"}],"containing_words":[],"sentences":[{"english":"Nowadays, educational qualifications and professional competence credentials are the stepping-stone(passport) to get a good job .","chinese":"現如今學歷和專業技能證書是找到好工作的敲門磚。"},{"english":"Addresses play a rule of stepping stone in social communications.","chinese":"社會交往中，稱謂詞扮演着敲門磚的作用。"},{"english":"Meanwhile, Young people see cosmetic surgery as the key to wealth and love.\"They","chinese":"同時，年輕人把整容看作是財富與愛情的敲門磚。"},{"english":"Meanwhile, Young people see cosmetic surgery as the key to wealth and love.","chinese":"同時，年輕人把整容看作是財富與愛情的敲門磚。"},{"english":"Idleness is the key of beggary , and the root of all evil.","chinese":"懶惰是行乞的敲門磚，是萬惡的根源。"},{"english":"And you think gramma's story is your ticket?","chinese":"你認爲我奶奶的故事是你的敲門磚？"},{"english":"It is also a key to any business program.","chinese":"也是任何商業程序的敲門磚。"},{"english":"He seems to think that wealth is the open sesame to happiness.","chinese":"他似認爲財富是快樂的敲門磚。"},{"english":"Now, we have realized that Elsevier's gentleness is only one time discount for the first time meet.","chinese":"現在看來，這些只是一份見面禮，一塊敲門磚。"},{"english":"A gift is a gift, not the beginning of a transaction.","chinese":"禮物就是單純的禮物，不會是一場交易的敲門磚。"},{"english":"A good degree can be an open sesame to a good job.","chinese":"好學歷是好工作的敲門磚。"}],"related":[]}