{"definition":["Rectification or Rectifying incorrect work styles, Maoist slogan\/cf Rectification campaign 整風運動|整风运动, army purge of 1942-44 and anti-rightist purge of 1957"],"pinyin":["zheng3 feng1"],"simplified":["整风"],"rank":23629.0,"normalized_rank":0.3306003665719922,"fraction":0.0000016796185746733914,"cumulative_fraction":0.9821265551304768,"word":"整風","characters":[{"definition":["exactly\/in good order\/whole\/complete\/entire\/in order\/orderly\/to repair\/to mend\/to renovate\/(coll.) to fix sb\/to give sb a hard time\/to mess with sb"],"pinyin":["zheng3"],"word":"整"},{"definition":["wind\/news\/style\/custom\/manner\/CL:陣|阵[zhen4],絲|丝[si1]"],"pinyin":["feng1"],"word":"風"}],"containing_words":[{"definition":["Rectification campaign\/political purge\/cf Mao's 1942-44 campaign at Yanan, and his 1950 and 1957 anti-rightist purges"],"pinyin":["zheng3 feng1 yun4 dong4"],"word":"整風運動"}],"sentences":[{"english":"Rectification means the whole designer should study Originalism through criticism and self-criticism.","chinese":"整風就是設計師通過批評和自我批評來學習原創主義。"},{"english":"We are to carry out a rectification movement next year.","chinese":"我們準備在明年開展整風運動。"},{"english":"This was the anti-Rightist struggle, the rectification movement.","chinese":"這就是反右派，就是整風。"},{"english":"The chief method for dealing with this confusion remains criticism and self-criticism.","chinese":"整風的方法是批評和自我批評，擺事實，講道理。"},{"english":"And rectification Movement is the concrete emancipation way.","chinese":"整風運動是解放思想的具體形式。"},{"english":"As this term of the Party School begins, the rectification movement is commencing throughout the Taihang area.","chinese":"在這次黨校開學的同時，全太行區開始整風運動。"},{"english":"The method of rectification is to make criticism and self-criticism, present the facts and reason things out.","chinese":"整風的方法是批評和自我批評，擺事實，講道理。"},{"english":"The Yenan rectification and the sinicization of Marxism have close relationship.","chinese":"延安整風與馬克思主義中國化有着密切的關係。"},{"english":"Following rectification we shall reveal our Party membership to the public.","chinese":"我們要在整風的基礎上把黨公開。"},{"english":"This was known as the Cheng Feng (Correct Wind) Movement.","chinese":"這就是整風運動。"},{"english":"The current rectification is like a dose of alum.","chinese":"這次整風，就是放一把明礬。"},{"english":"Without it some problems may be difficult to solve.","chinese":"不搞整風，恐怕解決不了問題。"}],"related":[]}