{"definition":["enemy plane"],"pinyin":["di2 ji1"],"simplified":["敌机"],"rank":22441.0,"normalized_rank":0.3139787052453374,"fraction":0.0000018819435655040298,"cumulative_fraction":0.9800137670711568,"word":"敵機","characters":[{"definition":["enemy\/to be a match for\/to rival\/to resist\/to withstand"],"pinyin":["di2"],"word":"敵"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[],"sentences":[{"english":"The buzz droids are designed to disable, not destroy, enemy craft.","chinese":"蜂鳴機器人的設計目的是癱瘓，而非摧毀敵機。"},{"english":"The aircraft uses the Foxhunter multi-mode air-intercept radar to detect and target hostile aircraft.","chinese":"該機採用福克斯特多模空中攔截雷達探測和目標敵機。"},{"english":"The enemy planes were licked up by flames.","chinese":"敵機被火焰吞沒了。"},{"english":"Operators of its secure communications system can guide friendly aircraft against enemy planes.","chinese":"其安全系統的操作者能導引友機對抗敵機。"},{"english":"On June 24, we had a near-miss when an enemy plane dropped anti-personnel bombs near the starboard side of the ship.","chinese":"6月24日，我們的船的右側船舷遭遇敵機仍的炸彈。"},{"english":"The rice mill was wrecked by the enemy bombing.","chinese":"碾米廠遭到了敵機的轟炸。"},{"english":"Three enemy planes were disposed of by us .","chinese":"我們擊落了三架敵機。"},{"english":"The enemy bombers targeted our arsenal.","chinese":"敵機把我們的兵工廠作爲轟炸目標。"},{"english":"It is not safe for the ships to ride (at anchor) in the harbour when the enemy planes are hovering overhead.","chinese":"當敵機在上空盤旋時，船隻停泊在港內是不安全的。"},{"english":"She shielded the wounded soldier from the strafing of the enemy plane with her own body.","chinese":"在敵機掃射時，她用自己的身子護住傷員。"},{"english":"The enemy plane homed in on the arms factory and destroyed it with one bomb.","chinese":"敵機瞄準了軍工廠，用一顆炸彈把它摧毀了。"},{"english":"In this way, radar found enemy planes in the dark.","chinese":"雷達就是用這種方法在黑暗中發現敵機的。"},{"english":"Our battery accounted for three enemy planes.","chinese":"我們炮兵連擊落了三架敵機。"},{"english":"AWACS Thunderhead Bandit's in gun range.","chinese":"敵機進入機炮射程。"},{"english":"The enemy planes bombed our city.","chinese":"敵機轟炸了我市。"},{"english":"A number of enemy planes were brought down the moment they intruded into our territorial air.","chinese":"許多敵機一侵入我們的領空就被擊落。"}],"related":[]}