{"definition":["enemy"],"pinyin":["di2 fang1"],"simplified":["敌方"],"rank":13834.0,"normalized_rank":0.193555608411568,"fraction":0.000004773468398385182,"cumulative_fraction":0.9538563042746698,"word":"敵方","characters":[{"definition":["enemy\/to be a match for\/to rival\/to resist\/to withstand"],"pinyin":["di2"],"word":"敵"},{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["Fang1","fang1"],"word":"方"}],"containing_words":[],"sentences":[{"english":"The sophisticated system destroys enemy warheads through direct \"hit-to-kill\" technology. \"It's like hitting a bullet with a bullet,\" Watkins says.","chinese":"系統利用命中即摧毀技術，摧毀敵方的彈頭。"},{"english":"Saab’s ARTHUR radar system locates incoming enemy projectiles and missiles.","chinese":"ARTHUR雷達系統可定位敵方來襲炮彈和導彈。"},{"english":"Our radio communications have been intercepted by the enemy.","chinese":"我方的無線通信被敵方竊聽了。"},{"english":"Our warships bottled up the enemy fleet in the harbour.","chinese":"我方軍艦把敵方艦隊圍困在港口內。"},{"english":"If you failed to support Britain, you were assisting the enemy.","chinese":"如果你不支持英國，那你就是協助敵方。"},{"english":"Twelve enemy transport aircraft on the handstand were knocked out by mortar shells.","chinese":"停機坪上的十二架敵方運輸機被迫擊炮彈擊毀了。"},{"english":"A warship involved in a battle would encounter the assault from enemy anti-warship weapons.","chinese":"艦船在海戰時，會遭到敵方反艦武器的攻擊。"},{"english":"He wanted to see if he could catch sight of the rival submarine.","chinese":"他想看看能否掃到敵方潛水艇一眼。"},{"english":"The two armies converge on the enemy capital for the last battle of the war.","chinese":"兩軍聚集在敵方首都，準備一決勝負。"},{"english":"Strangles the soul of a target enemy unit and extracts bits and pieces of it.","chinese":"勒緊一個敵方單位的靈魂，將他壓榨出來。"},{"english":"The soldier looped a grenade into the enemy shelter trench.","chinese":"士兵將一枚手榴彈呈弧形拋進敵方掩蔽壕裏。"},{"english":"Stories like these were invented to damage enemy morale.","chinese":"這樣的消息，向壁虛構，無非是要打擊敵方士氣。"},{"english":"Seeing such a terrible sight before his eyes, he was savaged by his enemy's atrocity.","chinese":"看到眼前這可怖的場景，他被敵方的暴行激怒了。"},{"english":"Specifies frames used when the infantry unit is standing and firing at an enemy unit.","chinese":"指定當步兵單位站着向敵方單位開火的幀序列。"},{"english":"It could engage the enemy beyond the range of hostile torpedoes.","chinese":"從這可以避開敵方魚雷區對敵人發動進攻。"},{"english":"The war was carried into enemy territory.","chinese":"戰爭已伸展到敵方領土。"}],"related":[{"definition":["to confront\/to face the enemy"],"pinyin":["dui4 di2"],"word":"對敵"},{"definition":["to pursue and attack"],"pinyin":["zhui1 ji1"],"word":"追擊"},{"definition":["flexibility"],"pinyin":["ji1 dong4 xing4"],"word":"機動性"},{"definition":["Huang Zhong (-220), general of Shu in Romance of the Three Kingdoms, portrayed as an old fighter"],"pinyin":["Huang2 Zhong1"],"word":"黃忠"},{"definition":["to make a comeback\/(of a doctor's assessment of the gender of a fetus) to turn out to be wrong"],"pinyin":["fan1 pan2"],"word":"翻盤"},{"definition":["to mount a sneak attack\/to raid"],"pinyin":["tou1 xi2"],"word":"偷襲"},{"definition":["to dodge\/to sidestep"],"pinyin":["shan3 bi4"],"word":"閃避"},{"definition":["to go against the wind\/contrary wind\/a headwind"],"pinyin":["ni4 feng1"],"word":"逆風"},{"definition":["duration"],"pinyin":["chi2 xu4 shi2 jian1"],"word":"持續時間"},{"definition":["to behead"],"pinyin":["zhan3 sha1"],"word":"斬殺"},{"definition":["trajectory (of a projectile)\/ballistic curve"],"pinyin":["dan4 dao4"],"word":"彈道"},{"definition":["to control\/to curb\/to restrict\/to impede\/to pin down (enemy troops)"],"pinyin":["qian1 zhi4"],"word":"牽制"},{"definition":["remote\/long distance\/long range"],"pinyin":["yuan3 cheng2"],"word":"遠程"},{"definition":["military strategy"],"pinyin":["zhan4 fa3"],"word":"戰法"},{"definition":["to march straight in unchallenged (military) (idiom)\/(fig.) to push deep into the heart of sth\/to flood in"],"pinyin":["chang2 qu1 zhi2 ru4"],"word":"長驅直入"},{"definition":["long-range raid"],"pinyin":["ben1 xi2"],"word":"奔襲"}]}