{"definition":["enemy camp"],"pinyin":["di2 ying2"],"simplified":["敌营"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"敵營","characters":[{"definition":["enemy\/to be a match for\/to rival\/to resist\/to withstand"],"pinyin":["di2"],"word":"敵"},{"definition":["camp\/barracks\/battalion\/to build\/to operate\/to manage\/to strive for"],"pinyin":["ying2"],"word":"營"}],"containing_words":[],"sentences":[{"english":"In the army brigade drama, the \"movie eighteen years\" has a typical representative.","chinese":"在軍旅題材電視劇中，《敵營十八年》具有典型性。"},{"english":"He don't break his promise and sends back the prince to enemy's camp next day.","chinese":"胡將軍沒有食言，次日便將太子送回敵營。"},{"english":"Our troops raided the enemy camp.","chinese":"我們的部隊襲擊了敵營。"},{"english":"Two time thorough hostile camp's results are single-handedly are encircled.","chinese":"兩次單槍匹馬深入敵營的結果都是被圍剿。"},{"english":"Our troops struck the enemy camp at night.","chinese":"我們的部隊夜間襲擊了敵營。"},{"english":"The soldiers descended upon the enemy camp and destroy it.","chinese":"戰士突然襲擊並殲滅了敵營。"},{"english":"9-10. Alfred stayed in the camp a week before he returned to Athelney.","chinese":"阿爾弗雷德在敵營呆了一週後回到了阿塞爾納。"},{"english":"Alfred stayed in the camp a week before he returned to Athelney.","chinese":"阿爾弗雷德在敵營呆了一個星期後，回到了阿塞爾納。"},{"english":"Orders were received that we should make a night march and beat up the enemy's quarters.","chinese":"我們接到命令，要我們乘夜進軍偷襲敵營。"},{"english":"General Hu sticked to his promise and sent the prince back the next day.","chinese":"胡將軍沒有食言，次日便將太子送回敵營。"},{"english":"They attacked the camp by surprise.","chinese":"他們突然襲擊敵營。"},{"english":"Our troops struck the enemy camp at dawn.","chinese":"我們的部隊在黎明時分襲擊了敵營。"},{"english":"He was captured by the enemy, but escaped from prison shortly thereafter.","chinese":"他被敵人俘虜，但很快就從敵營中逃脫。"},{"english":"We beat up the enemy's quarters last night.","chinese":"昨夜我們奇襲了敵營。"},{"english":"Closer and closer, your Knight took my Pawn.","chinese":"短兵相接，馬踏敵營。"},{"english":"Our army pounded at the enemy's camp and destroyed it.","chinese":"我軍用炮向敵營連續猛轟並摧毀了它。"}],"related":[]}