{"definition":["hundreds of"],"pinyin":["shu4 yi3 bai3 ji4"],"simplified":["数以百计"],"rank":31614.0,"normalized_rank":0.44232087641487,"fraction":8.167448222925106e-7,"cumulative_fraction":0.9916590045236492,"word":"數以百計","characters":[{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["hundred\/numerous\/all kinds of","surname Bai"],"pinyin":["Bai3","bai3"],"word":"百"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"計"}],"containing_words":[],"sentences":[{"english":"The restaurant receives hundreds of customers every day.","chinese":"這家飯店每天接待數以百計的顧客。"},{"english":"Dinner-time, and still no Hundreds of people.","chinese":"晚飯時間到了，“數以百計的人”仍然沒有出現。"},{"english":"Curious sightseers rolled up in their hundreds.","chinese":"數以百計的好奇的觀光客都湧到那兒。"},{"english":"Eight years of stepping through the Gate, hundreds of trips, all leading to this attempt to reach Earth.","chinese":"穿越星門八年來，數以百計的探險，只爲回到地球。"},{"english":"In Minsk, hundreds of Jews were marched from the city.","chinese":"在明斯克，數以百計的猶太人被從城裏趕出來。"},{"english":"Hundreds of those convicts remain at large.","chinese":"數以百計的逃犯仍逍遙法外。"},{"english":"Cholera and Acute Water Diarrhea (AWD) are taking the lives of hundreds of children.","chinese":"霍亂和急性水腹瀉已經奪去數以百計兒童生命。"},{"english":"Hundreds of people are waiting there.","chinese":"數以百計的人正守在那兒。"},{"english":"Hundreds of photos were scattered higgledy -piggledy across the floor.","chinese":"數以百計的照片雜亂散佈在地板上。"},{"english":"Hundreds of Al-Shabaab fighters paraded through the streets of Mogadishu.","chinese":"數以百計的青年黨戰士在摩加迪沙的各個街道行進。"},{"english":"There are (hundreds of) things in the school Lost and Found Office.","chinese":"學校的失物招領處有數以百計的物品。"},{"english":"Select from hundreds of fund-raising and the grand prize a blank template.","chinese":"選擇從數以百計的集資和獎勵模板空白超大。"},{"english":"Hundreds of troops have been dispatched to the region to assist in the effort.","chinese":"數以百計的軍隊已經趕赴災區，幫助救援工作。"},{"english":"Hundreds of statues were beheaded and a number of bas-reliefs removed.","chinese":"數以百計的雕像被砍頭，大批的淺浮雕被運走。"},{"english":"Hundreds of sheep were corralled for sale.","chinese":"數以百計的羊被關在欄中待售。"},{"english":"It is estimated that there are hundreds of this kind building in Zhejiang Province.","chinese":"浙江現存的傳統祠堂戲場建築就數以百計。"}],"related":[]}