{"definition":["tens of thousands\/numerous"],"pinyin":["shu4 yi3 wan4 ji4"],"simplified":["数以万计"],"rank":20933.0,"normalized_rank":0.2928798287465197,"fraction":0.0000021692275351683118,"cumulative_fraction":0.976965559050194,"word":"數以萬計","characters":[{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["surname Wan","ten thousand\/a great number"],"pinyin":["Wan4","wan4"],"word":"萬"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"計"}],"containing_words":[],"sentences":[{"english":"Tens of thousands of flag-waving activists called for early elections.","chinese":"數以萬計揮舞着國旗的積極分子要求提早進行選舉。"},{"english":"There are tens of thousands of Hong Ke, or red visitors, as they are known in China.","chinese":"在中國，這些數以萬計黑客們被稱爲“紅客”。"},{"english":"Livestock in the tens of thousands has been lost.","chinese":"數以萬計的牲畜頃刻間消失。"},{"english":"That's because tens of thousands of honey bees have invaded downtown Pittsfield.","chinese":"這是因爲數以萬計的蜜蜂入侵了皮茨菲爾德市區。"},{"english":"We've had tens of thousands that will call us a wonder of the world.","chinese":"數以萬計的人都稱這裏是世界奇觀。"},{"english":"They sold in the thousands, and in the tens of thousands.","chinese":"它們的銷售成績數以千計，數以萬計。"},{"english":"Around the globe, we estimate that there are billions of news pages containing every story ever written.","chinese":"我們在全球發現了數以萬計的曾經寫過的新聞頁面。"},{"english":"The country's drama academies are \"holy lands\" to tens of thousands of showbiz hopefuls like Wang.","chinese":"國家戲劇學院是像王一樣數以萬計後選人的聖堂。"},{"english":"Millions of people need its sanctuary and protection.","chinese":"數以萬計的人們需要他的庇護。"},{"english":"The global financial melt-down is creating hardship for many people.","chinese":"全球金融危機使數以萬計人處於苦難中。"},{"english":"Special operations forces have added tens of thousands to their ranks.","chinese":"數以萬計的特種部隊被派往前線。"},{"english":"He has taught millions upon millions of young men.","chinese":"他教過數以萬計的青年男子。"},{"english":"However, the land of ten thousand lakes is written on Minnesota's vehicle license plates.","chinese":"但是，明尼蘇達州的交通圖上標有它數以萬計的湖泊。"},{"english":"It has improved the medical and surgical management of countless patients.","chinese":"它改善了數以萬計患者的內外科治療。"},{"english":"All of these businesses combined, he said, employ tens of thousands of workers.","chinese":"他說，所有這些企業加在一起僱用了數以萬計的工人。"},{"english":"Thousands cheered and waved as the pontiff entered in his popemobile.","chinese":"當教皇坐駕抵臨時，數以萬計的人振臂歡呼。"}],"related":[]}