{"definition":["several billion"],"pinyin":["shu4 shi2 yi4"],"simplified":["数十亿"],"rank":18995.0,"normalized_rank":0.265764694360108,"fraction":0.000002654603144484236,"cumulative_fraction":0.9723021920872044,"word":"數十億","characters":[{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["ten\/10"],"pinyin":["shi2"],"word":"十"},{"definition":["100 million"],"pinyin":["yi4"],"word":"億"}],"containing_words":[],"sentences":[{"english":"The prospect of billion-year storage is fascinating and a little terrifying.","chinese":"數據儲存數十億年的願景令人着迷卻又有點可怕。"},{"english":"Billions of young people want to move beyond the shackles of poverty and conflict.","chinese":"數十億年輕人想擺脫貧困和衝突的鐐銬。"},{"english":"This progress is the product of hard work and ingenuity multiplied across billions of individual lives.","chinese":"這種進步是數十億人勤奮努力和創新的結晶。"},{"english":"The company spend billions on souped-up broadband services.","chinese":"公司投資數十億用來提高寬帶網的服務質量。"},{"english":"Billions of dollars are wagered each year on football in this country.","chinese":"數十億美元，每年投注足球在這個國家。"},{"english":"The government has committed billions toward defraying the costs of the war.","chinese":"政府已承諾撥款數十億支付戰爭的開支。"},{"english":"The projects, commonly known as earmarks, cost billions of dollars.","chinese":"這些俗稱專項撥款的項目會耗費數十億美元。"},{"english":"Farmers and poultry producers have lost billions of dollars as a result.","chinese":"農牧民和家禽飼養商因此蒙受了數十億美元的損失。"},{"english":"When we had a billion people, you said we were destroying the planet.","chinese":"我們擁有數十億人民，你說我們擠佔地球。"},{"english":"Billion of dollars make many every of us swirl.","chinese":"數十億計美元的投入讓每一個人都在彷徨。"},{"english":"Paying out billions in bonuses will still look awful.","chinese":"單看支出的數十億獎金就可怕的了。"},{"english":"It is everybody's responsibility to give. If everyone gives one yuan every month, it will add up to billions of dollars.\"(3)","chinese":"若每個人一個月捐一元錢，那將會積成數十億美元。"},{"english":"These tribunals can clear the way for the imposition of sanctions running into the billions of dollars.","chinese":"這些仲裁庭可以爲累積數十億美元的審查提供便利。"},{"english":"A quarter-mile of subway can cost billions.","chinese":"建設四分之一英里的地鐵即需要投入數十億美元。"},{"english":"News Corp. has also suffered multi-billion-dollar business losses.","chinese":"新聞集團還遭受了數十億美元的商業損失。"},{"english":"He has poured billions into incentivizing innovations in green technologies.","chinese":"他已經爲激勵綠色技術創新投入數十億美元。"}],"related":[]}