{"definition":["digital circuit"],"pinyin":["shu4 zi4 dian4 lu4"],"simplified":["数字电路"],"rank":56461.0,"normalized_rank":0.7899626432359073,"fraction":6.831752937138426e-8,"cumulative_fraction":0.9996226595127776,"word":"數字電路","characters":[{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["letter\/symbol\/character\/word\/CL:個|个[ge4]\/courtesy or style name traditionally given to males aged 20 in dynastic China"],"pinyin":["zi4"],"word":"字"},{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["road\/CL:條|条[tiao2]\/journey\/route\/line (bus etc)\/sort\/kind","surname Lu"],"pinyin":["Lu4","lu4"],"word":"路"}],"containing_words":[],"sentences":[{"english":"Signal integrity analysis of high-speed digital circuit;","chinese":"在高速數字電路中，信號完整性問題至關重要。"},{"english":"The system digital circuit requirements are now reviewed and modified .","chinese":"現在需要對系統數字電路的要求進行分析和修改。"},{"english":"Fault simulation is an important part of ATPG.","chinese":"故障模擬是數字電路測試的重要組成部分。"},{"english":"Analog and digital circuits with ultra-low power consumption can be widely used in many areas of applications.","chinese":"模擬與數字電路的超低功耗設計有着廣泛的應用價值。"},{"english":"For digital circuits, \"floating effect\" can influence the speed characteristics.","chinese":"對於數字電路來說，浮體效應會影響他們的速度。"},{"english":"In most digital circuits (within  like  logic families), backward coupling of 10% or less is usually acceptable.","chinese":"大部分數字電路，10%的後端串擾是被允許的。"},{"english":"The extensive use of digital circuit has led to the development of integrated circuits .","chinese":"數字電路的廣泛使用促進了集成電路的發展。"}],"related":[]}