{"definition":["numerous types\/many kinds"],"pinyin":["shu4 zhong3"],"simplified":["数种"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"數種","characters":[{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["seed\/species\/kind\/type\/classifier for types, kinds, sorts","to plant\/to grow\/to cultivate"],"pinyin":["zhong3","zhong4"],"word":"種"}],"containing_words":[],"sentences":[{"english":"And did you know that there are really zillions of ways to prepare a great seafood meal?","chinese":"你知道嗎，準備一頓美好的海鮮大餐有無數種方法？"},{"english":"When several compounds are formed, there is the possibility of more than one peritectic point .","chinese":"當生成數種化合物時，就可能有一個以上的轉熔點。"},{"english":"The flowchart and the calculating results of seve…","chinese":"文中列有計算框圖及對數種相圖的計算結果。"},{"english":"It is structured and ordered into a few basic regime types.","chinese":"它是經建構與安排成數種基本政體類型。"},{"english":"A few amorphous alloys of Cu-Ti were prepared by mechanical alloying(MA-CuTi).","chinese":"用機械球磨方法制得了數種不同組成的鈦銅非晶合金。"},{"english":"Reading is an interrelationship of several skills.","chinese":"閱讀是數種技能的相互聯繫。"},{"english":"Very sweet and juicy , firm flesh with few seeds.","chinese":"很甜美多汁，果肉公司與數種子。"},{"english":"The picture was painted in several tints of green.","chinese":"這幅畫是用數種濃淡不同的綠色畫成的。"},{"english":"To counter the logic program design of PC, this paper expounds some software design methods.","chinese":"針對其邏輯程序設計，概述了數種軟件設計方法。"},{"english":"It is the pang of separation that spreads throughout the world and gives birth to shapes innumerable in the infinites sky.","chinese":"分離的苦痛瀰漫時間，在無盡的天際裏有無數種體現。"},{"english":"Various iodinated strong base quaternary ammonium anion exchange resins were prepared.","chinese":"製備了數種不同的強鹼型陰離子碘化樹脂。"},{"english":"Putting the soft beancurd while eating, there are several kinds of pickles , there is some flavour very much.","chinese":"喫的時候下水豆腐，還有數種泡菜，很有一番滋味。"},{"english":"The course is going to discuss different ways of the new originality development.","chinese":"本課程首先討論創意發想的數種方法。"},{"english":"There are several possible causes for the various forms and degrees of intersexuality .","chinese":"中間性的各種各樣類型和程度差異有數種可能的原因。"},{"english":"Some new pathogens include virus and pathogenic bacteria had been reported.","chinese":"新報了數種中華鱉病毒和病原菌等致病原。"},{"english":"There's an infinite number of paths you could take.","chinese":"你有無數種路徑可以選擇。"}],"related":[]}