{"definition":["mathematical logic\/symbolic logic"],"pinyin":["shu4 li3 luo2 ji2"],"simplified":["数理逻辑"],"rank":59969.0,"normalized_rank":0.8390441145607432,"fraction":4.17496012825126e-8,"cumulative_fraction":0.999813604671722,"word":"數理邏輯","characters":[{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["patrol"],"pinyin":["luo2"],"word":"邏"},{"definition":["to gather up\/to collect\/to edit\/to compile"],"pinyin":["ji2"],"word":"輯"}],"containing_words":[],"sentences":[{"english":"In mathematical logic in the study is the main target of all kinds of calculus.","chinese":"在數理邏輯中研究的主要對象是各種演算。"},{"english":"Mr. Fang, have you ever studied mathematical logic?","chinese":"方先生，你對數理邏輯用過功沒有？"},{"english":"It finds relationships and differences of all kinds of transitional complex sentences by way of mathematical logic.","chinese":"通過數理邏輯手段揭示轉折複句子類間的聯繫變化。"},{"english":"Methods Based on the semantic theory of nonclassical logic.","chinese":"方法非經典數理邏輯的語義理論。"},{"english":"Therefore, intelligence inference should not be based upon the orthodox mathematical logic.","chinese":"因此，情報推理不能以正統數理邏輯作爲推理工具。"},{"english":"Consistency is one of the most fundamental syntactic concepts in mathematical logic.","chinese":"協調性是數理邏輯中最基本的語法概念之一。"},{"english":"I don't understand the complicated mathematical logic calculation.","chinese":"我不明白這複雜的數理邏輯運算。"},{"english":"Traditional logic is utterly different from mathematic logic in principle.","chinese":"從主導思想上說，傳統邏輯和數理邏輯殊異。"}],"related":[]}