{"definition":["(computing) array"],"pinyin":["shu4 zu3"],"simplified":["数组"],"rank":48682.0,"normalized_rank":0.6811243406601094,"fraction":1.6568460648829302e-7,"cumulative_fraction":0.9987559529718206,"word":"數組","characters":[{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["surname Zu","to form\/to organize\/group\/team\/classifier for sets, series, groups of people, batteries"],"pinyin":["Zu3","zu3"],"word":"組"}],"containing_words":[],"sentences":[{"english":"It's like having an array of stomp boxes ready for action.","chinese":"它有一個數組的單塊效果器隨時準備採取相應的行動。"},{"english":"'months' returns an mirrored array with the month-numbers of the year.","chinese":"返回一年裏月份數的鏡像數組。"},{"english":"One way to combat these issues is to use Instancing and Texture Arrays.","chinese":"解決該問題的一個方法是採用實例和紋理數組。"},{"english":"Items are copied starting at the specified index of the target array.","chinese":"從目標數組的指定索引處開始複製項。"},{"english":"So, suppose I want to remove something.","chinese":"假設我想在數組中移除一些東西。"},{"english":"A two-dimensional, or 2D, array stores elements in a grid-like fashion.","chinese":"二維數組存儲類似表格形式的數據元素。"},{"english":"If it is empty, we return an empty array.","chinese":"如果它爲空，將返回一個空數組。"},{"english":"When the array goes out of scope, the C implementation automatically deallocates it.","chinese":"當數組離開作用域時，C實現自動釋放它。"},{"english":"The array brackets come after the argument name instead of after the type.","chinese":"數組括號緊接參數名之後，而非類型之後。"},{"english":"All right? Now, I'll say L 2 equals L 1.","chinese":"好，然後我新建個L2數組和L1相等。"},{"english":"It is always better to keep the design simple and use single-dimensional arrays.","chinese":"保持簡單的設計和使用一維數組總是更好的做法。"},{"english":"Just iterate over the array of property names looking for the audit fields.","chinese":"只需循環遍歷屬性名數組，尋找審計字段。"},{"english":"Find the minimum element in an array ?","chinese":"那你如何找到數組中最小值呢？"},{"english":"And now let's do one, a, two. Whoops.","chinese":"它還告訴我這個數組是迴文的？"},{"english":"Start with an array to hold the character information.","chinese":"首先建立一個數組以保存角色信息。"},{"english":"And in fact, it depends on how I store a list.","chinese":"實際上，它依賴於我怎麼存儲這個數組的。"}],"related":[]}