{"definition":["several tens of thousands\/many thousand"],"pinyin":["shu4 wan4"],"simplified":["数万"],"rank":9873.0,"normalized_rank":0.13813607935863892,"fraction":0.000008422033204172315,"cumulative_fraction":0.9286373058032372,"word":"數萬","characters":[{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["surname Wan","ten thousand\/a great number"],"pinyin":["Wan4","wan4"],"word":"萬"}],"containing_words":[],"sentences":[{"english":"But a weed plant can produce tens or even hundreds of thousands of seeds.","chinese":"但每株雜草能產生數萬甚至數十萬顆種子。"},{"english":"Big corporate logos that need to represent a brand can cost tens of thousands of dollars.","chinese":"大公司往往耗資數萬元來設計展現自己品牌的標誌。"},{"english":"In Hama, videos show tens of thousands of people in the streets.","chinese":"在哈馬，視頻顯示數萬人在街道上抗議。"},{"english":"Tens of thousands of them, like Mrs. Young, were asked for specimens.","chinese":"他們中的數萬人像楊女士一樣被徵集了唾液樣本。"},{"english":"At present, the gourd sheets of different types of works created tens of thousands of pieces.","chinese":"目前，葫蘆張已創作不同類型的作品數萬幅。"},{"english":"They are making our thousands of warriors of the PLA go hungry in the cantonment .","chinese":"他們讓數萬人民解放軍的戰士們在營房裏捱餓。"},{"english":"Paying for a college education for children can cost anywhere from the low tens of thousands of dollars to hundreds of thousands.","chinese":"子女的大學教育經費可以從數千美金到數萬美金不等。"},{"english":"We trade about a trillion dollars in goods and services each year.","chinese":"歐美每年商品服務貿易額都達數萬億美元。"},{"english":"Mount Qiqu is world famous for its tens of thousands of ancient cypresses.","chinese":"七曲山以擁有數萬株古柏而聞名於世。"},{"english":"Storage bins hold tons of wheat before being sold. (Todd Korol\/Reuters)","chinese":"數萬噸的小麥在被賣出之前被貯存在這些儲藏箱裏。"},{"english":"If our each person donates 20 yuan, we will donate tens of thousands at least.","chinese":"如果我們每個人捐贈20元，我們將至少捐贈數萬。"},{"english":"Trillions of dollars have been spent \"pump-priming\" the US economy.","chinese":"數萬億的美元花在“刺激經濟的政府投資”。"},{"english":"Hundreds of thousands of citizens are grieving over the death of this popular artist.","chinese":"數萬市民來悼唁這位人民藝術家。"},{"english":"Tens of thousands were arrested on terrorism-related charges.","chinese":"數萬人因被控告與恐怖主義有關而被捕。"},{"english":"You've still got trillions of pounds of debt around.","chinese":"你在各地仍然有數萬億英鎊的欠債。"},{"english":"In the days since the earthquake, the Bank of Japan has printed trillions of new yen.","chinese":"自地震發生以來，日本央行已經新印製了數萬億日元。"}],"related":[]}