{"definition":["order of magnitude"],"pinyin":["shu4 liang4 ji2"],"simplified":["数量级"],"rank":37938.0,"normalized_rank":0.5308018412547395,"fraction":4.668364507044591e-7,"cumulative_fraction":0.9956140194316184,"word":"數量級","characters":[{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["capacity\/quantity\/amount\/to estimate\/abbr. for 量詞|量词[liang4 ci2], classifier (in Chinese grammar)\/measure word","to measure"],"pinyin":["liang2","liang4"],"word":"量"},{"definition":["level\/grade\/rank\/step (of stairs)\/CL:個|个[ge4]\/classifier: step, level"],"pinyin":["ji2"],"word":"級"}],"containing_words":[],"sentences":[{"english":"Arsenic has a diffusion coefficient an order of magnitude lower than that of boron and phosphorous.","chinese":"砷的擴散係數比硼和磷低一個數量級。"},{"english":"But these differences was not very significant, diversed in the same order of magnitude.","chinese":"但是這些差別不顯著，都維持在同一數量級上。"},{"english":"With local indexes, the time for roll-in is reduced by orders of magnitude.","chinese":"利用本地索引，滾入時間可得到數量級的降低。"},{"english":"These figures show that the improvement of input impedance is within a factor of ten.","chinese":"這些數據表明，輸入阻抗的改進值爲一個數量級。"},{"english":"In annular space, the values of tangential, axial and radial turbulence intensity were of the same order of magnitude.","chinese":"環形空間3個速度分量的湍流度是同一個數量級的。"},{"english":"Other witnesses have reported numbers of a similar order of magnitude.","chinese":"其他見證者報告的數量級類似。"},{"english":"In the last 10 years researchers have advanced by roughly an order of magnitude.","chinese":"在過去10年中，研究人員大約前進了一個數量級。"},{"english":"We'll still get, we still do get, about the same order of magnitude.","chinese":"那麼我們會發現，平動動能貢獻相同的數量級。"},{"english":"The eventual losses could run to several hundred billion dollars.","chinese":"最終的資金損失，可能要達到千億數量級。"},{"english":"Maximum signal currents are of the order of 50 ma.","chinese":"最大信號電流是在50毫安這個數量級。"},{"english":"And the available volume is on the order of meters cubed.","chinese":"整個可用的空間體積有立方米的數量級。"},{"english":"That’s an order of magnitude higher than the tallest building in most countries.","chinese":"這一個數量級高於大多數國家最高的建築標準。"},{"english":"About 10 orders of magnitude have also been gained on the temperature scale.","chinese":"約十個數量級的溫標被用來量度。"}],"related":[]}