{"definition":["word processing"],"pinyin":["wen2 zi4 chu3 li3"],"simplified":["文字处理"],"rank":40236.0,"normalized_rank":0.5629538427098345,"fraction":3.764762996769231e-7,"cumulative_fraction":0.9965786061610468,"word":"文字處理","characters":[{"definition":["language\/culture\/writing\/formal\/literary\/gentle\/(old) classifier for coins\/Kangxi radical 67","surname Wen"],"pinyin":["Wen2","wen2"],"word":"文"},{"definition":["letter\/symbol\/character\/word\/CL:個|个[ge4]\/courtesy or style name traditionally given to males aged 20 in dynastic China"],"pinyin":["zi4"],"word":"字"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"}],"containing_words":[],"sentences":[{"english":"Their advantage is that virtually every business already has a word processing tool.","chinese":"其優勢在於，幾乎每個公司都已經有了文字處理工具。"},{"english":"If you want to do word processing on it, good luck.","chinese":"假如你想用它做文字處理，也祝你好運。"},{"english":"Yes, I know most of the word processing. presentation, spreadsheet program.","chinese":"我知道大部分文字處理，簡報，試算表程序。"},{"english":"To capture the details you to use them along with a word processing tool.","chinese":"爲了捕獲細節，需要將其與文字處理工具配合使用。"},{"english":"Enter your new document into the word-processing system.","chinese":"把你的新文件輸入文字處理系統。"},{"english":"It does word processing, spreadsheets, slideshows.","chinese":"它可以用來做文字處理，排版，幻燈片。"},{"english":"But I don't have enough word-processing skills.","chinese":"但是我沒有足夠的文字處理技術。"},{"english":"Your computer works only as a word-processor.","chinese":"你的電腦只起到了文字處理的作用。"}],"related":[]}