{"definition":["oblique bar\/slash (computing)"],"pinyin":["xie2 gang4"],"simplified":["斜杠"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"斜槓","characters":[{"definition":["inclined\/slanting\/oblique\/tilting"],"pinyin":["xie2"],"word":"斜"},{"definition":["thick pole\/bar\/rod\/thick line\/to mark with a thick line\/to sharpen (knife)\/(old) coffin-bearing pole"],"pinyin":["gang4"],"word":"槓"}],"containing_words":[],"sentences":[{"english":"Pang argues that \"slash\" careers are the best proof of that shift.","chinese":"逄錦華覺得“斜槓”職業就是這種轉型的最佳證明。"},{"english":"Without the preceding slash, the period alone means any character.","chinese":"如果前面沒有反斜槓，單獨一個句點代表任意字符。"},{"english":"Single quotation marks interpolate and see the backslashes as escape characters.","chinese":"單引號插入並將反斜槓看作是轉義符。"},{"english":"When entering the command, do not use the backslash.","chinese":"輸入命令時切勿使用反斜槓。"},{"english":"To refer to non-namespaced classes, you need to put a lone backslash.","chinese":"要想引用沒有名稱空間的類，需要加上一個反斜槓。"},{"english":"Note that we've changed from backslashes to slashes as a path separator.","chinese":"注意我們將路徑分隔號從反斜槓變成了斜槓。"},{"english":"Note that we've changed from backslashes to slashes as a path separator.","chinese":"注意我們將路徑分隔號從反斜槓變成了斜槓。"},{"english":"To escape the quote, we use a backward slash to precede it.","chinese":"爲了轉換該引用，我們在它之前使用了一個反斜槓。"},{"english":"Do not enter the backslash as not part of the command.","chinese":"因此不要在命令中輸入反斜槓。"},{"english":"For example, you might use dashes in the element and attribute names.","chinese":"例如，您可能會在元素和屬性名稱上使用斜槓。"},{"english":"Remember to use forward slashes for the pathname.","chinese":"請記住爲路徑名使用前向斜槓。"},{"english":"When entering the command, do not use the backslash characters.","chinese":"輸入命令時切勿使用反斜槓。"},{"english":"The back slash zero, right?","chinese":"是反斜槓0，對不？"},{"english":"Here the characters between the slashes form a simple pattern.","chinese":"在此，斜槓中間的字符形成了簡單的模式。"},{"english":"Regular expression addresses are always surrounded by slashes.","chinese":"規則表達式地址總是由斜槓括起。"}],"related":[]}