{"definition":["italics\/slanting typeface"],"pinyin":["xie2 ti3"],"simplified":["斜体"],"rank":56215.0,"normalized_rank":0.7865207840723071,"fraction":7.050719377431322e-8,"cumulative_fraction":0.999605577064905,"word":"斜體","characters":[{"definition":["inclined\/slanting\/oblique\/tilting"],"pinyin":["xie2"],"word":"斜"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[{"definition":["italic letter\/slanting typeface"],"pinyin":["xie2 ti3 zi4"],"word":"斜體字"}],"sentences":[{"english":"Look up the dictionary and explain the meaning of the italicized words.","chinese":"查字典然後解釋斜體詞的意思。"},{"english":"Use each of the above italicized phrases in sentences of your own.","chinese":"用以上斜體印出的短語各造一個句子。"},{"english":"Bold, Italic, and Outlined need to be added to the text part.","chinese":"粗體，斜體，並概述了需要被添加到文本的一部分。"},{"english":"There's a lot of italics.","chinese":"有很多的斜體字。"},{"english":"Change the form of these sentences. Your sentences must begin with the words in italics.","chinese":"改寫以下句子，將斜體印出的詞和詞組作主語。"},{"english":"Also, links that appear in the user interface are italicized .","chinese":"同時，在用戶界面中的鏈接也使用了斜體字。"},{"english":"Notice that an abstract class is denoted by italicized text, as are abstract methods.","chinese":"注意，抽象類和抽象方法用斜體表示。"},{"english":"Each italicized term refers to another abstract element in the grammar.","chinese":"每一個斜體的術語表示引用該語法中的一個抽象元素。"},{"english":"Would you change the boldface terms, perhaps using italic or underlining?","chinese":"你會改變黑體字方面，可能使用斜體或下劃線？"},{"english":"Bold text, italicize words, or even upload your own photos and videos.","chinese":"粗體，斜體字，甚至上傳自己的照片和錄像。"},{"english":"The code line above with its italicized pieces is an example of a syntax template.","chinese":"上面這一行包含斜體字的代碼就是一個範例。"},{"english":"But for now, keep the italic font.","chinese":"但是現在，保持斜體不變。"},{"english":"The paragraph in italic should be set in.","chinese":"斜體這一段應排進去。"},{"english":"These confirmation states are shown with italics.","chinese":"這些確認狀態用斜體表示。"},{"english":"A lot of italics. What does that connote to you?","chinese":"很多的斜體字，那對你意味着什麼？"},{"english":"Some cards with keywords also have reminder text in italics , mainly for the benefit of newer players.","chinese":"有一些卡爲了新手的方便會在牌上用斜體字進行註釋。"}],"related":[]}