{"definition":["Scandinavia"],"pinyin":["Si1 kan1 di4 na4 wei2 ya4"],"simplified":["斯堪的纳维亚"],"rank":41901.0,"normalized_rank":0.5862493529024947,"fraction":3.2115077909625074e-7,"cumulative_fraction":0.9971569759416898,"word":"斯堪的納維亞","characters":[{"definition":["(phonetic)\/this","Slovakia\/Slovak\/abbr. for 斯洛伐克[Si1 luo4 fa2 ke4]"],"pinyin":["Si1","si1"],"word":"斯"},{"definition":["to endure\/may\/can"],"pinyin":["kan1"],"word":"堪"},{"definition":["aim\/clear","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","really and truly","see 的士[di1 shi4]"],"pinyin":["de5","di1","di2","di4"],"word":"的"},{"definition":["surname Na","to receive\/to accept\/to enjoy\/to bring into\/to pay (tax etc)\/nano- (one billionth)\/to reinforce sole of shoes or stockings by close sewing"],"pinyin":["Na4","na4"],"word":"納"},{"definition":["abbr. for Uighur 維吾爾|维吾尔[Wei2 wu2 er3]\/surname Wei","to preserve\/to maintain\/to hold together\/dimension\/vitamin (abbr. for 維生素|维生素[wei2 sheng1 su4])"],"pinyin":["Wei2","wei2"],"word":"維"},{"definition":["Asia\/Asian\/Taiwan pr. [Ya3]","second\/next to\/inferior\/sub-\/Taiwan pr. [ya3]"],"pinyin":["Ya4","ya4"],"word":"亞"}],"containing_words":[],"sentences":[{"english":"The Scandinavian countries have the highest number of IPs per person.","chinese":"斯堪的納維亞國家的人均IP地址數最高。"},{"english":"And in the 9th century Old Norse was carried far westward to Iceland.","chinese":"在9世紀，古斯堪的納維亞語往西發展至冰島。"},{"english":"The latter is the largest order placed by any Scandinavian airline.","chinese":"後者是任一斯堪的納維亞定期航線的最大定單。"},{"english":"IS THERE any limit to the audacity of Scandinavians?","chinese":"這些膽大包天的斯堪的納維亞人就不知道個“度”嗎？"},{"english":"The Vikings invaded present-day Normandy in the 9th century.","chinese":"斯堪的納維亞人在第9世紀侵略了當代的諾曼底。"},{"english":"Iam writing this from Northern Scandinavia.","chinese":"我寫這篇文章的題材來自於北斯堪的納維亞半島。"},{"english":"The Scandinavian promotion of the song will be from Bonnier Music .","chinese":"斯堪的納維亞推廣這首歌會從邦尼爾音樂。"},{"english":"The Vikings make first Contact The Vikings were a group of Scandinavian warriors.","chinese":"維京海盜是一羣斯堪的納維亞士兵組成的。"},{"english":"It's clear that Stockholm's City Hall rules the city.","chinese":"顯然，斯堪的納維亞的市政大廳統治着整座城市。"},{"english":"But low-pressure weather systems are moving into Europe and Scandinavia.","chinese":"但是低氣壓天氣系統正進入歐洲和斯堪的納維亞。"},{"english":"The blade is a Scandinavian or Scandi grind.","chinese":"刀刃是斯堪的納維亞或Scandi研磨。"},{"english":"Lots of water in the Scandinavia area.","chinese":"斯堪的納維亞地區的水域較廣。"},{"english":"Then, Scandanavia, Britain, and other parts of Europe.","chinese":"然後，斯堪的納維亞，英國和歐洲其他地區。"},{"english":"In the Scandinavian countries, dollies have already been used extensively for many years.","chinese":"斯堪的納維亞國家，推車已經被廣泛使用了許多年。"},{"english":"An old Scandinavian name translates as “herring flash”.","chinese":"在古斯堪的納維亞語中，極光的意思是“鯡魚鱗光”。"}],"related":[]}