{"definition":["fracture\/rupture\/to break apart"],"pinyin":["duan4 lie4"],"simplified":["断裂"],"rank":9085.0,"normalized_rank":0.12711093699718776,"fraction":0.000009764589438421504,"cumulative_fraction":0.9215017439371194,"word":"斷裂","characters":[{"definition":["to break\/to snap\/to cut off\/to give up or abstain from sth\/to judge\/(usu. used in the negative) absolutely\/definitely\/decidedly"],"pinyin":["duan4"],"word":"斷"},{"definition":["to split\/to crack\/to break open\/to rend"],"pinyin":["lie4"],"word":"裂"}],"containing_words":[{"definition":["fault zone (geology)"],"pinyin":["duan4 lie4 dai4"],"word":"斷裂帶"},{"definition":["rupture strength\/breaking strength"],"pinyin":["duan4 lie4 qiang2 du4"],"word":"斷裂強度"},{"definition":["modulus rupture"],"pinyin":["duan4 lie4 mo2 shu4"],"word":"斷裂模數"}],"sentences":[{"english":"So it's a kind of machine which take advantage of fatigue-fracture.","chinese":"因而，它是一種化害爲利，利用疲勞斷裂下料的機械。"},{"english":"The fracture of the tie bolts of the D39 main engine has been analysed briefly.","chinese":"對D39主機底腳螺栓斷裂事故進行了簡略的分析。"},{"english":"An experimental study on the gouge along Xiaojiang fault has been carried out.","chinese":"對小江斷裂帶的斷層泥進行了實驗研究。"},{"english":"A axle of blast furnace charging wagon broke in use.","chinese":"高爐上料車車軸在使用過程中發生斷裂。"},{"english":"Banpo antimony deposit is a typical fracture-controlling and hydrothermal fluid filling deposit.","chinese":"半坡銻礦牀是典型的斷裂控礦，熱液充填型礦牀。"},{"english":"A broken wood bridge, looked like was damaged by the thunderstorm.","chinese":"一個斷裂的木橋，看上去象是被暴風雨沖垮的。"},{"english":"The infections endocarditis was a major cause of the secondary ruptures group. The repair …","chinese":"感染性心內膜炎是繼發性瓣膜腱索斷裂的主要原因。"},{"english":"The distribution of the gold deposits clings to deep big faults.","chinese":"金礦牀分佈與深大斷裂存在依附性。"},{"english":"The northeastward Xiangshui fault zone in this area is the main rock-control and ore-control structure.","chinese":"區內北東向響水斷裂帶是主要的控巖和控礦構造。"},{"english":"The above research results reflect the shock isolation effect and hanging wall effect of fractures.","chinese":"本研究結果反映斷裂的隔震效應與上盤效應。"},{"english":"Pinghu fault is the main passage for the vertical migration of oil and gas.","chinese":"平湖斷裂是天然氣垂向運移的主要通道。"},{"english":"Echocardiography demonstrated tricuspid chordae tendinae rupture with remarkable tricuspid regurgitation .","chinese":"心臟超音波證實三尖瓣腱索斷裂及明顯的三尖瓣逆流。"},{"english":"Stage I. Transverse fracture of medial malleolus or rupture of deltoid ligament.","chinese":"度內踝的橫行骨折或三角韌帶斷裂。"},{"english":"Shancheng gold ore deposit is a fault controlled quartz-vein type gold ore deposit in Shandong province.","chinese":"山城金礦爲石英脈型金礦，受斷裂構造控制。"},{"english":"The ability of the bending and cracking resistance of the steel saw blade was evaluated by bending strength and deflection.","chinese":"用彎曲強度及撓度評定鋼鋸條抗彎曲斷裂的能力。"},{"english":"Stage II. Rupture of anterior tibiofibular ligament and interosseous ligament.","chinese":"II度脛腓前韌帶和骨間膜斷裂。"}],"related":[{"definition":["to drop off\/to come off\/to lose (hair etc)\/to omit (a character when writing)"],"pinyin":["tuo1 luo4"],"word":"脫落"},{"definition":["to snap sth off\/to break"],"pinyin":["zhe2 duan4"],"word":"折斷"},{"definition":["crack\/crevice\/CL:道[dao4]"],"pinyin":["lie4 feng4"],"word":"裂縫"},{"definition":["deformation\/to become deformed\/to change shape\/to morph"],"pinyin":["bian4 xing2"],"word":"變形"},{"definition":["to strike\/to hit\/to ram"],"pinyin":["zhuang4 ji1"],"word":"撞擊"},{"definition":["to break\/to sever\/to turn off (electric switch)"],"pinyin":["duan4 kai1"],"word":"斷開"},{"definition":["to lead to\/to create\/to cause\/to bring about"],"pinyin":["dao3 zhi4"],"word":"導致"},{"definition":["to peel\/to strip\/to peel off\/to come off (of tissue, skin, covering etc)"],"pinyin":["bo1 li2"],"word":"剝離"},{"definition":["to harm\/to damage\/to injure\/impairment\/loss\/disability"],"pinyin":["sun3 shang1"],"word":"損傷"},{"definition":["to squeeze\/to press\/to extrude"],"pinyin":["ji3 ya1"],"word":"擠壓"},{"definition":["to suffer damage"],"pinyin":["shou4 sun3"],"word":"受損"},{"definition":["to damage\/to injure"],"pinyin":["sun3 huai4"],"word":"損壞"},{"definition":["to hit (a target etc)\/to strike"],"pinyin":["ji1 zhong4"],"word":"擊中"},{"definition":["to cause damage to\/to ruin\/to destroy"],"pinyin":["sun3 hui3"],"word":"損毀"},{"definition":["to cut short\/to break off\/to discontinue\/to interrupt"],"pinyin":["zhong1 duan4"],"word":"中斷"},{"definition":["violent\/acute\/severe\/fierce"],"pinyin":["ju4 lie4"],"word":"劇烈"}]}