{"definition":["line break (computing)","to carry out resolutely"],"pinyin":["duan4 hang2","duan4 xing2"],"simplified":["断行"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"斷行","characters":[{"definition":["to break\/to snap\/to cut off\/to give up or abstain from sth\/to judge\/(usu. used in the negative) absolutely\/definitely\/decidedly"],"pinyin":["duan4"],"word":"斷"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"}],"containing_words":[],"sentences":[{"english":"Non-public capital is allowed to enter the monopolized industries and fields.","chinese":"允許非公有資本進入壟斷行業和領域。"},{"english":"Sixth: No reasonable price system in the natural monopoly industry.","chinese":"第六，自然壟斷行業的價格體系不合理。"},{"english":"This practice also eliminates illnesses and purifies disturbances by evil spirits .","chinese":"斷行法也能根除疾病，斷除外界邪魔的干擾。"},{"english":"Line breaks are normalized to \"#xA\" on input, before parsing.","chinese":"解析之前輸入中的斷行規範化爲“#xA”。"},{"english":"The actual results have no line breaks, and are \"crammed\" together all on one line.","chinese":"實際的結果沒有斷行，而是連成一行。"},{"english":"Moreover, some traditional industries has introduced the competition mechanism.","chinese":"實踐中，傳統的自然壟斷行業有些已經引入競爭機制。"},{"english":"Second, we will deepen the reform of the income distribution system of monopoly industries.","chinese":"二要深化壟斷行業收入分配製度改革。"},{"english":"Use comma for a line break.","chinese":"使用逗號的斷行。"},{"english":"Lines and paragraphs break automatically.","chinese":"自動斷行和分段。"},{"english":"Monopoly industries should carry out reforms to introduce competition mechanisms.","chinese":"推進壟斷行業改革，積極引入競爭機制。"},{"english":"Substantive progress was made in restructuring the management system of monopoly industries.","chinese":"壟斷行業管理體制改革邁出實質性步伐。"},{"english":"It should be used primarily to hyphenate words in justified type.","chinese":"他應該使用於字母斷行連接時。"}],"related":[]}