{"definition":["power cut\/electric power failure"],"pinyin":["duan4 dian4"],"simplified":["断电"],"rank":15943.0,"normalized_rank":0.22306325465560425,"fraction":0.000003698051221293328,"cumulative_fraction":0.962729923938822,"word":"斷電","characters":[{"definition":["to break\/to snap\/to cut off\/to give up or abstain from sth\/to judge\/(usu. used in the negative) absolutely\/definitely\/decidedly"],"pinyin":["duan4"],"word":"斷"},{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"}],"containing_words":[],"sentences":[{"english":"Millions of residences remain without power and water.","chinese":"數百萬戶家庭依然斷水斷電。"},{"english":"Residents of many major urban areas complain of 20-hour-long daily blackouts.","chinese":"很多大城市的居民抱怨每天斷電時間長達20小時。"},{"english":"With integral manual override, tubing is pinched closed in de-energized state.","chinese":"隨着積分手動裝置，油管是捏在封閉狀態斷電。"},{"english":"Power loss in the inducer would trigger the deck's playback circuit.","chinese":"一旦引導器斷電，終端的回放電路就會被觸發。"},{"english":"We haudio-videoe an auxiliary generator in case of power cuts.","chinese":"我們有一臺萬一斷電時運用的備用發電機。"},{"english":"When changing the inductor, the power must be cut off making the equipment under the state of power off.","chinese":"更換感應器時，必須切斷電源應使設備處於斷電狀態。"},{"english":"For fare that the electricity will cut off, people storm into convenience store to grab candles.","chinese":"爲了勉於斷電之苦，人們踊進便利商店搶購蠟燭。"},{"english":"The wires in circuits are kept from heating by either fuses or circuit breakers.","chinese":"保險絲或斷電器可以保護電路中的電線不致過熱。"},{"english":"It has breakpoint memory and power-off protection function.","chinese":"斷點記憶和斷電保護功能。"},{"english":"I took candles to the Xinhua bookstore on Zhongshan Rd . so I could look for books when the power failed.","chinese":"我到中山路的新華書店都自帶蠟燭，以備斷電後使用。"},{"english":"Huge swaths of the capital remained in darkness as a result of widespread power failures.","chinese":"由於大面積斷電，醫院的大多數地方都漆黑一團。"},{"english":"What happens if my computer suddenly loses power while I am in the middle of playing? Does my donation still count?","chinese":"如果在玩遊戲時電腦突然斷電，我的捐贈還算數嗎？"},{"english":"When some phase breaks, it can give an alarm with sound and light.","chinese":"當某相線路斷電時，可進行聲光報警。"},{"english":"Since Mr Yang ignored the order, the school’s water and electricity have been cut off.","chinese":"因爲楊校長無視政府關停令，該校目前已被斷水斷電。"},{"english":"In addition, the prosthetic hand has the feature of auto power-off to save the energy.","chinese":"此外並具有自動斷電機制，可達到節能省電之目標。"},{"english":"At least one person was killed in Fukushimaprefecture, north of Tokyowhere four million homes were without power.","chinese":"福島有1人死亡，東京北部400萬戶家庭斷電。"}],"related":[{"definition":["turn out the lights\/lights out"],"pinyin":["xi1 deng1"],"word":"熄燈"},{"definition":["to have a power failure\/power cut"],"pinyin":["ting2 dian4"],"word":"停電"},{"definition":["to lock the door"],"pinyin":["suo3 men2"],"word":"鎖門"},{"definition":["(of a machine) to stop\/to shut down\/to park a plane\/to finish shooting (a TV program etc)\/to suspend a phone line\/(of a prepaid mobile phone) to be out of credit"],"pinyin":["ting2 ji1"],"word":"停機"},{"definition":["electric fan\/CL:架[jia4],臺|台[tai2]"],"pinyin":["dian4 feng1 shan4"],"word":"電風扇"},{"definition":["to stop classes\/to close (of school)"],"pinyin":["ting2 ke4"],"word":"停課"},{"definition":["out of order (of machine)\/not working properly\/a failing (of a system)"],"pinyin":["shi1 ling2"],"word":"失靈"},{"definition":["to sigh\/to heave a sigh"],"pinyin":["tan4 qi4"],"word":"嘆氣"},{"definition":["to abuse roundly"],"pinyin":["po4 kou3 da4 ma4"],"word":"破口大罵"},{"definition":["to change one's mind\/to go back on one's word"],"pinyin":["bian4 gua4"],"word":"變卦"},{"definition":["door lock"],"pinyin":["men2 suo3"],"word":"門鎖"},{"definition":["to knock on a door"],"pinyin":["qiao1 men2"],"word":"敲門"},{"definition":["electric pole\/telephone pole\/lamppost\/CL:根[gen1]"],"pinyin":["dian4 xian4 gan3"],"word":"電線桿"},{"definition":["to make up missed lesson\/to reschedule a class"],"pinyin":["bu3 ke4"],"word":"補課"},{"definition":["coach (teacher or trainer)"],"pinyin":["fu3 dao3 yuan2"],"word":"輔導員"},{"definition":["to skip class"],"pinyin":["qiao1 ke4"],"word":"蹺課"}]}