{"definition":["square brackets [ ]"],"pinyin":["fang1 kuo4 hao4"],"simplified":["方括号"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"方括號","characters":[{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["Fang1","fang1"],"word":"方"},{"definition":["to enclose\/to include\/also pr. [gua1]"],"pinyin":["kuo4"],"word":"括"},{"definition":["ordinal number\/day of a month\/mark\/sign\/business establishment\/size\/ship suffix\/horn (wind instrument)\/bugle call\/assumed name\/to take a pulse\/classifier used to indicate number of people","roar\/cry\/CL:個|个[ge4]"],"pinyin":["hao2","hao4"],"word":"號"}],"containing_words":[],"sentences":[{"english":"In both queries, the join predicate is expressed within the square brackets.","chinese":"在這兩個查詢中，方括號中表示了連接謂詞。"},{"english":"In syntax , items inside square brackets are optional.","chinese":"在語法中，方括號中的項是可選項。"},{"english":"This query uses square brackets, so what's wrong with it?","chinese":"這個查詢使用了方括號，那麼它錯在哪裏呢？"},{"english":"The first definition has no arguments, hence the empty square brackets.","chinese":"第一個定義沒有參數，因此方括號是空的。"},{"english":"How do I overload the square-bracket operator in C#?","chinese":"在C#，如何重載方括號運算符？"},{"english":"Square brackets denote a numerically indexed array.","chinese":"方括號表示數字索引數組。"},{"english":"The square brackets group the element logically.","chinese":"方括號將元素在邏輯上分組。"},{"english":"First, we create a binding using the square brackets.","chinese":"首先，我們使用一些方括號來創建一個綁定。"},{"english":"The last data type is the list, which is denoted by square brackets.","chinese":"最後一個數據類型是列表，列表用方括號表示。"},{"english":"Typing square bracket caret zero dash nine will exclude all numbers from matching.","chinese":"輸入方括號插入零九個破折號將排除所有號碼匹配。"}],"related":[]}