{"definition":["(math.) simultaneous equations\/system of equations"],"pinyin":["fang1 cheng2 zu3"],"simplified":["方程组"],"rank":57818.0,"normalized_rank":0.8089488338253606,"fraction":5.722322972987741e-8,"cumulative_fraction":0.9997075436050832,"word":"方程組","characters":[{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["Fang1","fang1"],"word":"方"},{"definition":["rule\/order\/regulations\/formula\/journey\/procedure\/sequence","surname Cheng"],"pinyin":["Cheng2","cheng2"],"word":"程"},{"definition":["surname Zu","to form\/to organize\/group\/team\/classifier for sets, series, groups of people, batteries"],"pinyin":["Zu3","zu3"],"word":"組"}],"containing_words":[{"definition":["(math.) system of polynomial equations"],"pinyin":["duo1 xiang4 shi4 fang1 cheng2 zu3"],"word":"多項式方程組"}],"sentences":[{"english":"Its optimal solution is obtained by finding a nonnegative solution of compatible equations.","chinese":"其最優解是通過求一個相容方程組的非負解而得到。"},{"english":"Chapter 5 focuses on the asymptotic analysis to a parabolic model with inner absorptions and weighted localized sources.","chinese":"第五章考慮帶有權函數和內吸收的拋物型方程組。"},{"english":"The case of regular solutions of nonlinear PDAEs is investigated.","chinese":"並研究了非線性偏微分方程組的解在正則部分的情形。"},{"english":"This paper has investigated the system of congruences and given them the asymptotic formula of the number of solutions.","chinese":"給出了一類同餘方程組解數的公式或漸近公式。"},{"english":"A study is made on Cauchy problem of compressible Eulers equations with relaxation term.","chinese":"研究具鬆弛項可壓縮的歐拉方程組柯西問題。"},{"english":"Some properties of the sub-subspaces and their applications on the systems of linear equations are studied.","chinese":"研究了次子空間的性質及其在線性方程組上的應用。"},{"english":"The correctness of the complete Euler equation set is verified with two functional examples.","chinese":"通過兩個算例驗證了完全歐拉方程組的正確性。"},{"english":"The presence of intergranular stress in the propellant bed is a key factor that determines the classification of the balance equation.","chinese":"顆粒間應力的存在是決定方程組類型的重要條件。"},{"english":"In the practical work we have to obtain the solution of the binary third-degree equation again and again for many times.","chinese":"在實際工作中爲此要多次反覆求解二元三次方程組。"},{"english":"A set of basic fluid mechanical equations is developed by the theory of functions of complex variables.","chinese":"利用複變函數的方法推導出相應的基本方程組。"},{"english":"Those are the equations we have to solve.","chinese":"這就是我們要解的方程組。"},{"english":"Otherwise, well, AX equals B has either no solution, or infinitely many solutions. Yes?","chinese":"否則，此線性方程組無解，或者無窮解？"},{"english":"The construction of solution space was given and the solution approach was offered.","chinese":"並給出方程組的形式解解空間構造和求解方法。"},{"english":"And, in fact,something that is known as Maxwell's equations.","chinese":"實際上，是講Maxwell方程組。"},{"english":"Induced a kind of convenient procedure for the solution of the linearity equational group.","chinese":"歸納出解線性方程組的簡捷程序。"},{"english":"In this paper, the non—linear differential equations of aircraft motion are simplified by the condition of steady spin.","chinese":"按穩定尾旋的條件對飛機運動方程組作了簡化。"}],"related":[]}