{"definition":["construction\/to carry out construction or large-scale repairs"],"pinyin":["shi1 gong1"],"simplified":["施工"],"rank":1549.0,"normalized_rank":0.021672519692751108,"fraction":0.00010341989343711191,"cumulative_fraction":0.6903684992252558,"word":"施工","characters":[{"definition":["surname Shi","to grant\/to give\/to bestow\/to act\/to carry out"],"pinyin":["Shi1","shi1"],"word":"施"},{"definition":["work\/worker\/skill\/profession\/trade\/craft\/labor"],"pinyin":["gong1"],"word":"工"}],"containing_words":[{"definition":["unit in charge of construction\/builder"],"pinyin":["shi1 gong1 dan1 wei4"],"word":"施工單位"}],"sentences":[{"english":"Concreting technology for the box girders and construction method for the prestressing system are dealt with as well.","chinese":"並介紹了箱梁混凝土的澆注工藝及預應力施工的方法。"},{"english":"The invention discloses a construction method for a door opening of an old structural underground wall.","chinese":"本發明公開了一種老結構地下牆開門洞施工方法。"},{"english":"In concrete construction, improvement is made to traditional suspension crossing structure.","chinese":"在具體施工中，對傳統懸索跨越結構作了改進。"},{"english":"The strengthening of Ji'nan awning construction site for electricity.","chinese":"加強濟南遮陽蓬施工現場的用電辦理。"},{"english":"Cracks are easily occurred during constructthereinforced concrete box culvert.","chinese":"鋼筋混凝土箱涵在施工過程中，易產生裂縫。"},{"english":"The technology of line reinforced by the temporary beam in the D pattern and container bridge jacking has been widely applied.","chinese":"型便梁加固線路頂進箱橋施工技術已得到廣泛應用。"},{"english":"This article aims to analyze various processing methods for groundwater excavation of the foundation ditch in earthwork construction.","chinese":"分析土方工程施工中基坑開挖地下水的各種處理辦法。"},{"english":"This paper mainly aims at the re-development of the construction drawing parts in TLJCAD.","chinese":"本文主要針對TLJCAD施工圖部分進行再開發。"},{"english":"The conclusions can provide references for the field performance of hydrau- perforating and fracturing.","chinese":"實驗結果可爲水力射孔及壓裂的現場施工提供參考。"},{"english":"This paper analyzes and summarizes the quality common faults in sinking well construction.","chinese":"本文就沉井施工中的質量通病進行了分析和總結。"},{"english":"those who do not make the corrections within the time limit, shall be ordered to stop construction, and can be imposed with penalty simultaneously.","chinese":"逾期不改正的，責令停止施工，可以並處罰款。"},{"english":"In constructing certain project, the time limit was short, so that the slip form techniques were adopted.","chinese":"在工期要求非常緊的情況下，該工程採用了滑模施工。"},{"english":"The construction technique of overlapped single tunnels is the first in China to adopt in Shenzhen subway engineering.","chinese":"單洞重疊隧道施工技術是深圳地鐵在國內第一次採用。"},{"english":"The plan and technology of skip loading chamber construction in Jining No.","chinese":"介紹了濟寧二號煤礦箕斗裝載硐室施工方案及技術。"},{"english":"The construction technology and application of rubberized asphalt concrete are introduced.","chinese":"簡單介紹橡膠瀝青混凝土的施工工藝及應用。"},{"english":"In construction site, air is thin, oxygen is lack and it is very cold.","chinese":"施工區空氣稀薄，嚴重缺氧，氣候寒冷。"}],"related":[{"definition":["unit in charge of construction\/builder"],"pinyin":["shi1 gong1 dan1 wei4"],"word":"施工單位"},{"definition":["time allocated for a project\/completion date"],"pinyin":["gong1 qi1"],"word":"工期"},{"definition":["to dig out\/to excavate\/to scoop out"],"pinyin":["kai1 wa1"],"word":"開挖"},{"definition":["foundation groove\/trench for building foundation"],"pinyin":["ji1 keng1"],"word":"基坑"},{"definition":["to construct by hoisting ready-built components into place"],"pinyin":["diao4 zhuang1"],"word":"吊裝"},{"definition":["to finish work\/to complete a project"],"pinyin":["wan2 gong1"],"word":"完工"},{"definition":["engineering\/an engineering project\/project\/undertaking\/CL:個|个[ge4],項|项[xiang4]"],"pinyin":["gong1 cheng2"],"word":"工程"},{"definition":["to backfill"],"pinyin":["hui2 tian2"],"word":"回填"},{"definition":["civil engineering\/same as 土木工程[tu3 mu4 gong1 cheng2]"],"pinyin":["tu3 jian4"],"word":"土建"},{"definition":["earthwork"],"pinyin":["tu3 fang1 gong1 cheng2"],"word":"土方工程"},{"definition":["construction site"],"pinyin":["gong1 di4"],"word":"工地"},{"definition":["to begin work (of a factory or engineering operation)\/to start a construction job"],"pinyin":["kai1 gong1"],"word":"開工"},{"definition":["to start (a building project)"],"pinyin":["dong4 gong1"],"word":"動工"},{"definition":["excavated soil and rock\/construction spoil"],"pinyin":["tu3 shi2 fang1"],"word":"土石方"},{"definition":["pipeline\/general term for pipes, cables etc"],"pinyin":["guan3 xian4"],"word":"管線"},{"definition":["flyover (road bridge)"],"pinyin":["kua4 xian4 qiao2"],"word":"跨線橋"}]}