{"definition":["to put in place\/to put into practice\/to take effect"],"pinyin":["shi1 xing2"],"simplified":["施行"],"rank":6265.0,"normalized_rank":0.08765547829250206,"fraction":0.00001732915006240683,"cumulative_fraction":0.8847508173069463,"word":"施行","characters":[{"definition":["surname Shi","to grant\/to give\/to bestow\/to act\/to carry out"],"pinyin":["Shi1","shi1"],"word":"施"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"}],"containing_words":[],"sentences":[{"english":"Chapter three is the problems in carrying out the two institutions.","chinese":"第三章爲兩種制度在施行中存在的問題。"},{"english":"One of the heads of the beast seemed to have had a fatal wound, but the fatal wound had been healed.","chinese":"它在頭一個獸面前，施行頭一個獸所有的權柄。"},{"english":"Conscience warns us as a friend before it punishes us as a judge.","chinese":"良心如同法曹施行懲罰之前，已如良友一般先行提醒。"},{"english":"When the aura of birth or plan to dismantle suture cesarean section.","chinese":"當出現了臨產先兆或計劃施行剖宮產時再拆除縫線。"},{"english":"Malaysia hascomfirmedconfirmed it plans to install Chinese-style controls on the internet.","chinese":"馬來西亞證實其計劃施行中國風格的網絡控制。"},{"english":"Political corruption, questions and so on famine relief measures difficult line.","chinese":"政治腐敗，致使荒政難以施行等問題。"},{"english":"The doctor is doing a minor surgery on Mr. Wang's mouth.","chinese":"醫生正在給王先生的口部施行小手術。"},{"english":"I that speak in righteousness, mighty to save.","chinese":"就是我，是憑公義說話，以大能施行拯救。"},{"english":"Promotion and package should be planned as part of the hotel's annual marketing plan.","chinese":"酒店年度的市場銷售計劃中應包括促銷價的施行計劃。"},{"english":"Dominion and fear are with him, he maketh peace in his high places.","chinese":"神有治理之權，威嚴可畏，他在高天之處施行和平。"},{"english":"The implementation of the system of the Dala chieftain is also typically discussed.","chinese":"並以此爲典型反映土司制度在羌族地區的施行狀況。"},{"english":"Certain media have suggested the implementation of a property declaration system.","chinese":"某些媒體已經建議施行一個財產申報體系。"},{"english":"The LORD executeth righteousness and judgment for all that are oppressed.","chinese":"耶和華施行公義，爲一切受屈的人伸冤。"},{"english":"To evaluate the feasibility of applying choledochofiberoscope in less-invasive operation for biliary diseases.","chinese":"目的探討應用纖維膽道鏡施行低創膽道手術的可行性。"},{"english":"Surgery in a Chemically Protected Environment.","chinese":"在防化環境下施行外科手術。"},{"english":"Similarly, I will not give to a woman a pessary to cause abortion.","chinese":"尤其不施行給婦女墮胎的手術。"}],"related":[{"definition":["to issue\/to proclaim\/to enact (laws, decrees etc)"],"pinyin":["ban1 bu4"],"word":"頒布"},{"definition":["to implement\/to carry out"],"pinyin":["shi2 shi1"],"word":"實施"},{"definition":["regulations\/rules\/code of conduct\/ordinances\/statutes"],"pinyin":["tiao2 li4"],"word":"條例"},{"definition":["to try out\/to test"],"pinyin":["shi4 xing2"],"word":"試行"},{"definition":["to repeal (a law)\/to put an end to\/abolition\/annulled"],"pinyin":["fei4 zhi3"],"word":"廢止"},{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"實行"},{"definition":["to put into effect\/to carry out"],"pinyin":["tui1 xing2"],"word":"推行"},{"definition":["to revise"],"pinyin":["xiu1 ding4"],"word":"修訂"},{"definition":["to officially launch (a policy, program etc)\/to appear on stage\/to appear publicly\/(of a bar girl) to leave with a client"],"pinyin":["chu1 tai2"],"word":"出臺"},{"definition":["decree\/ordinance"],"pinyin":["fa3 ling4"],"word":"法令"},{"definition":["to abolish\/to abrogate\/to repeal"],"pinyin":["fei4 chu2"],"word":"廢除"},{"definition":["system (e.g. political, adminstrative etc)\/institution\/CL:個|个[ge4]"],"pinyin":["zhi4 du4"],"word":"制度"},{"definition":["detailed rules and regulations\/bylaws"],"pinyin":["xi4 ze2"],"word":"細則"},{"definition":["to draw up\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制定"},{"definition":["new policy\/New Deal (Roosevelt's 1933 policy to deal with the Great Depression)"],"pinyin":["xin1 zheng4"],"word":"新政"},{"definition":["provision\/to fix\/to set\/to formulate\/to stipulate\/to provide\/regulation\/rule\/CL:個|个[ge4]"],"pinyin":["gui1 ding4"],"word":"規定"}]}