{"definition":["day after day"],"pinyin":["ri4 fu4 yi1 ri4"],"simplified":["日复一日"],"rank":24958.0,"normalized_rank":0.3491948008338813,"fraction":0.0000014864901743350553,"cumulative_fraction":0.9842283958896241,"word":"日復一日","characters":[{"definition":["abbr. for 日本[Ri4 ben3], Japan","sun\/day\/date, day of the month"],"pinyin":["Ri4","ri4"],"word":"日"},{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out"],"pinyin":["fu4"],"word":"復"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["abbr. for 日本[Ri4 ben3], Japan","sun\/day\/date, day of the month"],"pinyin":["Ri4","ri4"],"word":"日"}],"containing_words":[],"sentences":[{"english":"They returned to the store with other protesters day after day.","chinese":"他們與其他抗議者日復一日的來到這個餐館。"},{"english":"This is why we go on, day after day, concocting fictions with utter seriousness .","chinese":"這就是我們爲何日復一日，如此嚴肅編織小說的原因。"},{"english":"The gander circled the pond for days, and more days after that.","chinese":"那雄鵝成天圍着池塘轉，日復一日。"},{"english":"Day to day, choice by choice, we are building our future.","chinese":"日復一日，我們就在選擇中鋪墊通往未來的路。"},{"english":"It also includes day to day complaints about lack of equipment and supplies.","chinese":"它同時包括日復一日對缺少裝備以及補給的抱怨。"},{"english":"Day after day, Zhang Shanqi gradually from the effects of the promotion.","chinese":"日復一日，張善奇的推廣漸漸起了效果。"},{"english":"In turn, management activities should ensure that the organization's governance approach is carried out day-to-day.","chinese":"而管理活動應該確保日復一日地貫徹組織的治理方法。"},{"english":"Day by day, their spirits atrophy.","chinese":"日復一日，她們精神萎靡。"},{"english":"From one day to the next Inga is left alone with two younger siblings.","chinese":"英嘉和比她更小的兩個弟妹便日復一日地孤獨地生活。"},{"english":"The trial went on day after day. The decision would be close.","chinese":"針對總統的審判日復一日，裁決將非常接近。"},{"english":"Those people who live sensibly and sanely day after day.","chinese":"那些日復一日生活在機敏與理智裏的人之一。"},{"english":"Oceans apart, day after day, and I slowly go insane.","chinese":"遠隔重洋，日復一日，我慢慢地變得要失常。"},{"english":"Distress allusion begins to assume a responsibility that takes care of cattail, day after day.","chinese":"悲痛的典開始承擔起照顧蒲的責任，日復一日。"},{"english":"You can not learn to paint without endlessly painting still lifes. Math is no different.","chinese":"沒有日復一日的靜物寫生，你就不能夠學會繪畫。"},{"english":"What was it like day after day in their fetid cargo bay?","chinese":"在惡臭熏天的貨艙中日復一日的生活是什麼樣的？"},{"english":"It's simply a great contribution that you spare a drop of water day after day.","chinese":"你要是日復一日地節約水，那都算是做了大貢獻。"}],"related":[{"definition":["over the years\/year after year"],"pinyin":["nian2 fu4 yi1 nian2"],"word":"年復一年"},{"definition":["to leave early and return late (idiom)"],"pinyin":["zao3 chu1 wan3 gui1"],"word":"早出晚歸"},{"definition":["accustomed to\/used to"],"pinyin":["xi2 yi3 wei2 chang2"],"word":"習以為常"},{"definition":["ordinary and mediocre (idiom); nothing to write home about"],"pinyin":["ping2 dan4 wu2 qi2"],"word":"平淡無奇"},{"definition":["trifling\/trivial\/tedious\/inconsequential"],"pinyin":["suo3 sui4"],"word":"瑣碎"},{"definition":["to neglect sleep and forget about food (idiom)\/to skip one's sleep and meals\/to be completely wrapped up in one's work"],"pinyin":["fei4 qin3 wang4 shi2"],"word":"廢寢忘食"},{"definition":["overnight until daybreak (idiom); all night long\/day and night"],"pinyin":["tong1 xiao1 da2 dan4"],"word":"通宵達旦"},{"definition":["work\/manual labor"],"pinyin":["lao2 zuo4"],"word":"勞作"},{"definition":["nothing much changes (idiom); always the same\/stuck in a rut"],"pinyin":["yi1 cheng2 bu4 bian4"],"word":"一成不變"},{"definition":["to accumulate over a long period of time"],"pinyin":["ri4 ji1 yue4 lei3"],"word":"日積月累"},{"definition":["to leave one's homeplace (to find work, flee disaster etc)"],"pinyin":["li2 xiang1 bei4 jing3"],"word":"離鄉背井"},{"definition":["to rack one's brains (idiom); to take great pains to think sth through"],"pinyin":["fei4 jin4 xin1 si5"],"word":"費盡心思"},{"definition":["to concentrate one's attention completely (idiom)\/with rapt attention"],"pinyin":["quan2 shen2 guan4 zhu4"],"word":"全神貫注"},{"definition":["lit. firewood, rice, oil, salt, soy, vinegar, and tea\/fig. life's daily necessities"],"pinyin":["chai2 mi3 you2 yan2 jiang4 cu4 cha2"],"word":"柴米油鹽醬醋茶"},{"definition":["to bother\/to disturb\/to vex"],"pinyin":["fan2 rao3"],"word":"煩擾"},{"definition":["with single-hearted devotion (idiom)"],"pinyin":["zhuan1 xin1 zhi4 zhi4"],"word":"專心致志"}]}