{"definition":["day by day\/more and more\/increasingly\/more and more with each passing day"],"pinyin":["ri4 yi4"],"simplified":["日益"],"rank":2572.0,"normalized_rank":0.03598561694625943,"fraction":0.000057773273427893165,"cumulative_fraction":0.7682139217361197,"word":"日益","characters":[{"definition":["abbr. for 日本[Ri4 ben3], Japan","sun\/day\/date, day of the month"],"pinyin":["Ri4","ri4"],"word":"日"},{"definition":["benefit\/profit\/advantage\/beneficial\/to increase\/to add\/all the more","surname Yi"],"pinyin":["Yi4","yi4"],"word":"益"}],"containing_words":[{"definition":["to increase daily"],"pinyin":["ri4 yi4 zeng1 jia1"],"word":"日益增加"}],"sentences":[{"english":"The link is the growing strain on the world\"s sole superpower. America is locked into a draining and demoralising war.\"","chinese":"這個聯繫就是全球唯一超級大國面臨的壓力日益增加。"},{"english":"Under these conditions, ethnic family patterns were slowly broken down by an increasingly urbanized, industrialized environment.","chinese":"工業化的日益發展，種族家庭的模式緩慢地解體。"},{"english":"She says she is glad to see that the ukulele is gaining popularity.","chinese":"她說，她很高興地看到，四絃琴是日益普及。"},{"english":"Nowadays, the phenomenon of telephone harassment is becoming more and more pervasive.","chinese":"當前騷擾電話問題日益普遍。"},{"english":"Tourism is growing source of income for people in the region.","chinese":"旅遊事業是這個區域裏日益增長的收入來源。"},{"english":"Our country young people computer-related crime phenomenon is day by day prominent.","chinese":"我國的青少年計算機犯罪現象日益突出。"},{"english":"The role of city and city-region in the age of globalization is becoming increasingly important.","chinese":"在全球化時代，城市和城市地區的重要性日益提升。"},{"english":"Some countries have an ever-increasing proportion of population who are aged 15 and younger.","chinese":"有些國家已經日益增加的人口比例是十五歲年輕。"},{"english":"The media industry is increasingly hoping it stays that way.","chinese":"傳媒業正日益盼望保持這一勢頭。"},{"english":"And rising bills are enough to make even the most bath-fond switch to showers.","chinese":"日益增加的水電費甚至足以令最愛缸浴的人改爲淋浴。"},{"english":"The dietotherapy for the treatment of hypertension has been paid attention increasingly in recent years.","chinese":"近年來，高血壓病的飲食療法日益受到重視。"},{"english":"Regus also supports the growing trend of mobile and home working.","chinese":"雷格斯亦支援日益受歡迎的流動辦公及在家辦公人士。"},{"english":"So what does the size of the Internet have to do with NAT?","chinese":"那麼面對日益龐大的因特網，NAT該做什麼呢？"},{"english":"The contradiction between flood control and profit is getting increasingly serious as industry and agriculture develop.","chinese":"隨着工農業的發展，水庫防洪與興利矛盾日益突出。"},{"english":"Indeed, youth activism around environmental issues is growing in India.","chinese":"確實，印度應對環保問題的青年運動日益高漲。"},{"english":"With more and more frequent international contact, more and more Chinese are learning English.","chinese":"隨着國際交往日益頻繁，中國人學外語的也日漸增多。"}],"related":[{"definition":["(increasing) day by day\/(more critical) with every passing day\/gradually"],"pinyin":["ri4 qu1"],"word":"日趨"},{"definition":["to progress (or increase, change etc) day by day\/more (or better etc) with each passing day"],"pinyin":["ri4 jian4"],"word":"日漸"},{"definition":["all the more\/even more\/further"],"pinyin":["yu4 jia1"],"word":"愈加"},{"definition":["to increase steadily\/to grow with each passing day"],"pinyin":["yu3 ri4 ju4 zeng1"],"word":"與日俱增"},{"definition":["all the more\/increasingly"],"pinyin":["yu4 fa1"],"word":"愈發"},{"definition":["more and more"],"pinyin":["yue4 lai2 yue4"],"word":"越來越"},{"definition":["increasingly\/more and more\/ever more\/all the more"],"pinyin":["yue4 fa1"],"word":"越發"},{"definition":["along with\/in the wake of\/following"],"pinyin":["sui2 zhe5"],"word":"隨著"},{"definition":["more critical with every passing day"],"pinyin":["ri4 qu1 yan2 zhong4"],"word":"日趨嚴重"},{"definition":["gradually"],"pinyin":["zhu2 jian4"],"word":"逐漸"},{"definition":["progressively\/step by step"],"pinyin":["zhu2 bu4"],"word":"逐步"},{"definition":["to intensify\/to sharpen\/to accelerate\/to aggravate\/to exacerbate\/to embitter"],"pinyin":["jia1 ju4"],"word":"加劇"},{"definition":["to tend towards"],"pinyin":["qu1 yu2"],"word":"趨於"},{"definition":["to develop rapidly"],"pinyin":["xun4 su4 fa1 zhan3"],"word":"迅速發展"},{"definition":["to increase\/to grow in number"],"pinyin":["zeng1 duo1"],"word":"增多"},{"definition":["direction\/trend\/to incline"],"pinyin":["qu1 xiang4"],"word":"趨向"}]}