{"definition":["(increasing) day by day\/(more critical) with every passing day\/gradually"],"pinyin":["ri4 qu1"],"simplified":["日趋"],"rank":6177.0,"normalized_rank":0.08642424412015726,"fraction":0.000017754674844709367,"cumulative_fraction":0.8832070335416653,"word":"日趨","characters":[{"definition":["abbr. for 日本[Ri4 ben3], Japan","sun\/day\/date, day of the month"],"pinyin":["Ri4","ri4"],"word":"日"},{"definition":["to hasten\/to hurry\/to walk fast\/to approach\/to tend towards\/to converge"],"pinyin":["qu1"],"word":"趨"}],"containing_words":[{"definition":["more critical with every passing day"],"pinyin":["ri4 qu1 yan2 zhong4"],"word":"日趨嚴重"}],"sentences":[{"english":"L\/C Payment problem is becoming serious to each bank.","chinese":"信用證墊款問題是各銀行面對的日趨嚴重的一個問題。"},{"english":"Occurring and harming of the wheat aphids have not decreased, and there is a more serious trend instead.","chinese":"麥蚜的發生危害沒有減輕，反而有日趨嚴重的趨勢。"},{"english":"But the current spat has become much more hostile, with both sides announcing live-fire naval drills were recently held.","chinese":"但目前爭論日趨尖銳，雙方近期都宣佈進行實彈演習。"},{"english":"But the Sino-Japanese War after the increasingly conservative in their thoughts.","chinese":"但甲午戰爭以後，其思想日趨保守。"},{"english":"The old woman has been worn away by her recent illness.","chinese":"由於最近生病，老婦人的身體日趨衰弱。"},{"english":"Jiaozhou Bay and its adjacent area are getting more and more important in the economic and social development of Tsingtao city.","chinese":"膠州灣及其鄰區在青島市經濟和社會發展中日趨重要。"},{"english":"The traditional forestry shadow is desalinating day by day.","chinese":"傳統林業的影子正在日趨淡化。"},{"english":"It's increasingly a suburban issue.","chinese":"實際上郊區貧困化問題正在日趨嚴重。"},{"english":"Spa resorts have continued to develop through SE Asia. The market is increasingly competitive.","chinese":"水療度假設施在東南亞不斷髮展，市場競爭日趨激烈。"},{"english":"They learned the concept of monasticism from the Buddhists, who greatly influenced Taoism during this period.","chinese":"這一時期的道教也不斷借鑑佛教的經驗而日趨成熟。"},{"english":"It was Institutionalization and gradual perfection of the Dual-system under the control of the country.","chinese":"在國家的影響下，“雙元制”的制度化並日趨完善。"},{"english":"The ranks of teachers of the non-governmental vocational colleges are continuously growing and the sources of teachers have been diversified.","chinese":"民辦高校的師資隊伍也不斷壯大，師資來源日趨多樣。"},{"english":"Jiande investment environment better.","chinese":"建德投資環境日趨完善。"},{"english":"Cabaret expansion makes the competition between different cabarets become intensive.","chinese":"酒店數量的擴張使酒店之間的競爭日趨激烈。"},{"english":"Today, there are various cheating methods and advanced cheating skills.","chinese":"如今，作弊方式花樣繁多，作弊技術也日趨先進。"},{"english":"There is a growing trend for people to pose naked for photographs in China.","chinese":"在中國，裸體寫真日趨流行。"}],"related":[]}