{"definition":["entomology"],"pinyin":["kun1 chong2 xue2"],"simplified":["昆虫学"],"rank":57589.0,"normalized_rank":0.8057448267177816,"fraction":5.882898362535866e-8,"cumulative_fraction":0.9996942600789718,"word":"昆蟲學","characters":[{"definition":["descendant\/elder brother\/a style of Chinese poetry"],"pinyin":["kun1"],"word":"昆"},{"definition":["lower form of animal life, including insects, insect larvae, worms and similar creatures\/CL:條|条[tiao2],隻|只[zhi1]\/(fig.) person with a particular undesirable characteristic"],"pinyin":["chong2"],"word":"蟲"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"In the Entomology research, counting the individual numbers of Insects often frustrate the workers.","chinese":"昆蟲學研究中常常會遇到對昆蟲數量進行統計的工作。"},{"english":"Norwegian Journal of Entomology, with Insekt-Nytt.","chinese":"挪威昆蟲學雜誌》附《昆蟲新聞》。"},{"english":"Objective. The purposes of our work are to establish new methods of species identification in forensic entomology.","chinese":"目的本課題旨在探索新的法醫昆蟲學種屬鑑定方法。"},{"english":"This is the website of Department of Plant, Soil, and Entomological Sciences.","chinese":"這是愛達荷大學植物，土壤和昆蟲學系的網站。"},{"english":"This paper introduces the new advance in application of proteomics in entomological research.","chinese":"本文就其在昆蟲學研究中應用的一些新進展作了綜述。"},{"english":"The development of the Internet provides new tools for entomological research.","chinese":"互聯網的發展給昆蟲學的研究開闢了新的道路。"},{"english":"This is the website for Lithuanian Entomological Society.","chinese":"這是立陶宛昆蟲學學會的網站。"},{"english":"Not long ago he traveled to Thailand to attend a United Nations workshop on entomophagy.","chinese":"不久以前他到泰國加入了聯合國一個昆蟲學研究室。"},{"english":"This is the website of Department of Entomology at Iowa State University.","chinese":"這是愛荷華州立大學昆蟲學系的網站。"},{"english":"The results are published in the journal Entomology.","chinese":"這個結論已經發表在了期刊《昆蟲學》上。"},{"english":"Forest entomologists have concentrated on ecological problems.","chinese":"森林昆蟲學家所重視的是生態問題。"},{"english":"The broad prospects for the application of SPR techniques in entomological research are also discussed.","chinese":"同時，展望了該技術在昆蟲學研究中廣闊的應用前景。"},{"english":"This is the webpage of Bulletin of Entomological Research.","chinese":"這是《昆蟲學研究公告》的網頁。"},{"english":"Entomologists have tended to underestimate the importance of colonization through dispersal.","chinese":"昆蟲學家傾向於低估在擴散過程中定居現象的重要性。"},{"english":"In this paper, the entomology -related electronic journal resources were briefly introduced.","chinese":"本文着重簡述與昆蟲學相關的國內外電子期刊資源。"},{"english":"Australian Journal of Entomology.","chinese":"澳大利亞昆蟲學雜誌。"}],"related":[]}