{"definition":["The honest person does nothing underhand (idiom).\/fig. Do what you want to do openly and without dissimulation."],"pinyin":["ming2 ren2 bu4 zuo4 an4 shi4"],"simplified":["明人不做暗事"],"rank":67342.0,"normalized_rank":0.9422019503868594,"fraction":8.612679984853998e-9,"cumulative_fraction":0.9999817078355234,"word":"明人不做暗事","characters":[{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to do\/to make\/to produce\/to write\/to compose\/to act as\/to engage in\/to hold (a party)\/to be\/to become\/to function (in some capacity)\/to serve as\/to be used for\/to form (a bond or relationship)\/to pretend\/to feign\/to act a part\/to put on appearance"],"pinyin":["zuo4"],"word":"做"},{"definition":["dark\/gloomy\/hidden\/secret\/muddled\/obscure\/in the dark"],"pinyin":["an4"],"word":"暗"},{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"}],"containing_words":[],"sentences":[],"related":[{"definition":["not to mince words\/not to beat about the bush"],"pinyin":["da3 kai1 tian1 chuang1 shuo1 liang4 hua4"],"word":"打開天窗說亮話"},{"definition":["daring to act and courageous enough to take responsibility for it (idiom)\/a true man has the courage to accept the consequences of his actions\/the buck stops here"],"pinyin":["hao3 han4 zuo4 shi4 hao3 han4 dang1"],"word":"好漢做事好漢當"},{"definition":["If you don't want anyone to know, don't do it (idiom). fig. If you do something bad, people will inevitably hear about it."],"pinyin":["ruo4 yao4 ren2 bu4 zhi1 , chu2 fei1 ji3 mo4 wei2"],"word":"若要人不知，除非己莫為"},{"definition":["to do as promised\/to be as good as one's word\/to honor one's word\/to mean what one says"],"pinyin":["shuo1 hua4 suan4 hua4"],"word":"說話算話"},{"definition":["lit. not to shed a tear until one sees the coffin (idiom)\/fig. refuse to be convinced until one is faced with grim reality"],"pinyin":["bu4 jian4 guan1 cai5 bu4 luo4 lei4"],"word":"不見棺材不落淚"},{"definition":["I am who I am (and I'm not ashamed)\/fig. to be proud of one's name and stand by one's actions"],"pinyin":["xing2 bu4 geng1 ming2 , zuo4 bu4 gai3 xing4"],"word":"行不更名，坐不改姓"},{"definition":["to have secret motives\/to have a guilty conscience"],"pinyin":["xin1 li5 you3 gui3"],"word":"心裡有鬼"},{"definition":["to make false accusations against sb (idiom)"],"pinyin":["han2 xue4 pen1 ren2"],"word":"含血噴人"},{"definition":["If you want to condemn sb, don't worry about the pretext (idiom, from Zuozhuan 左傳|左传); one can always trump up a charge against sb\/Give a dog a bad name, then hang him."],"pinyin":["yu4 jia1 zhi1 zui4 , he2 huan4 wu2 ci2"],"word":"欲加之罪，何患無辭"},{"definition":["He who comes is surely ill-intentioned, no-one well-meaning will come (idiom).\/Be careful not to trust foreigners.\/Beware of Greeks bearing gifts!"],"pinyin":["lai2 zhe3 bu4 shan4 , shan4 zhe3 bu4 lai2"],"word":"來者不善，善者不來"},{"definition":["let's talk about the unpleasant things first\/let's be frank"],"pinyin":["chou3 hua4 shuo1 zai4 qian2 tou5"],"word":"醜話說在前頭"},{"definition":["a scoundrel\/a bad chap"],"pinyin":["shu3 bei4"],"word":"鼠輩"},{"definition":["lit. One doesn't visit a temple without a cause. (idiom)\/fig. to visit sb with an ulterior motive (esp. to ask for sth)\/having a hidden agenda"],"pinyin":["wu2 shi4 bu4 deng1 san1 bao3 dian4"],"word":"無事不登三寶殿"},{"definition":["for every grievance someone is responsible, for every debt there is a debtor (idiom)\/when settling disputes one should not involve third parties"],"pinyin":["yuan1 you3 tou2 , zhai4 you3 zhu3"],"word":"冤有頭，債有主"},{"definition":["no poison, no great man (idiom); A great man has to be ruthless."],"pinyin":["wu2 du2 bu4 zhang4 fu5"],"word":"無毒不丈夫"},{"definition":["to lie through one's teeth (idiom)\/to talk drivel"],"pinyin":["zheng1 zhe5 yan3 jing1 shuo1 xia1 hua4"],"word":"睜著眼睛說瞎話"}]}