{"definition":["sensible act"],"pinyin":["ming2 zhi4 zhi1 ju3"],"simplified":["明智之举"],"rank":24852.0,"normalized_rank":0.34771172330810235,"fraction":0.000001500212071260077,"cumulative_fraction":0.9840701349753505,"word":"明智之舉","characters":[{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"},{"definition":["wisdom\/knowledge"],"pinyin":["zhi4"],"word":"智"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["to lift\/to hold up\/to cite\/to enumerate\/to act\/to raise\/to choose\/to elect\/act\/move\/deed"],"pinyin":["ju3"],"word":"舉"}],"containing_words":[],"sentences":[{"english":"At this time, avoid to defeat psychological, not tired is wise.","chinese":"此時，切忌不甘失敗的心理，不戀戰是明智之舉。"},{"english":"People would be wise to abandon rash inclinations and instead try in earnest.","chinese":"人們摒棄急燥冒進並代之以嚴肅認識是明智之舉。"},{"english":"file2.txt.bak, and file3.txt.bak. Mistakes happen, so making a backup is smart.","chinese":"錯誤操作時常發生，所以建立備份是明智之舉。"},{"english":"But deciding to relocate based on statistics is not advisable.","chinese":"但是根據這些統計數據去搬遷並非明智之舉。"},{"english":"It is thus wise for the Chinese government to increase investment in technical schools.","chinese":"因此，中國政府加大對職業技校的投資時明智之舉。"},{"english":"To get a good mortgage deal and terms it would be wise to look around the internet.","chinese":"取得了良好的條件和抵押協議是明智之舉四顧互聯網。"},{"english":"It would be advisable for you to instruct a credit agency to investigate the matter.","chinese":"貴方指示信用調查機構調查這件事是明智之舉。"},{"english":"It is also wise to obtain news from more balanced news sources.","chinese":"在更多均衡的資源上獲取新聞也是種明智之舉。"},{"english":"She deemed it wise to refuse the offer.","chinese":"她認爲拒絕這個建議是明智之舉。"},{"english":"So coequal material compares the price just is advisability to lift.","chinese":"所以同等材料比較價格纔是明智之舉。"},{"english":"Putting your savings in a high-interest account is a good bet.","chinese":"把你的積蓄存進高利率儲蓄戶頭是明智之舉。"},{"english":"While spite may be a good motivator, revenge is typically a lousy use of resources.","chinese":"置之不理實乃明智之舉，報復是典型的糟蹋資源。"},{"english":"Egan acknowledges that expanding BlackBerry's enterprise services and features is a good move.","chinese":"伊根承認，擴展黑莓的企業服務和功能是明智之舉。"}],"related":[]}