{"definition":["non-secret code (such as Morse code, Chinese telegraph code, ASCII etc)\/plaintext (cryptography)\/(of prices) clearly marked"],"pinyin":["ming2 ma3"],"simplified":["明码"],"rank":48986.0,"normalized_rank":0.6853776950736642,"fraction":1.6072136717498733e-7,"cumulative_fraction":0.9988055441992646,"word":"明碼","characters":[{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"},{"definition":["weight\/number\/code\/to pile\/to stack\/classifier for length or distance (yard), happenings etc"],"pinyin":["ma3"],"word":"碼"}],"containing_words":[],"sentences":[{"english":"I'm afraid the prices are fixed in this store.","chinese":"恐怕不能講價，本店是明碼標價。"},{"english":"What's more, the price should be clearly marked.","chinese":"更重要的是，應明碼標價。"},{"english":"The input clear text is not visible on the screen.","chinese":"輸入的明碼文本在屏幕上是不可見的。"},{"english":"The price of every item on sale will be displayed.","chinese":"每一件出售商品的價格都是明碼標價。"},{"english":"Because even the smallest favors carries a price tag.","chinese":"因爲就算是最小的幫忙，都明碼標價。"},{"english":"Hamming code, a checksum error code set.","chinese":"漢明碼，一個錯誤校驗碼碼集。"},{"english":"Retailers shall clearly mark prices on the commodities provided by them.","chinese":"商店提供商品應當明碼標價。"},{"english":"Explains the basic theory and the specific construction method of the R. Hamming redundancy code.","chinese":"介紹海明碼的原理和具體的構造方法。"},{"english":"Forcing businesses to work with government to set price codes through the NRA.","chinese":"讓企業同政府合作並通過國家復興署明碼標價。"},{"english":"In most western countries store prices are fixed and people cannot bargain.","chinese":"在大部分西方國家，商店明碼實價，不能討價還價。"},{"english":"Volkswagen is not the only automaker to put a dollar amount on its brand.","chinese":"爲自身品牌明碼標價的汽車製造商並非只有大衆一家。"}],"related":[]}