{"definition":["Stars and Stripes, the flag of the United States"],"pinyin":["xing1 tiao2 qi2"],"simplified":["星条旗"],"rank":41879.0,"normalized_rank":0.5859415443594085,"fraction":3.217346896036985e-7,"cumulative_fraction":0.9971499047854449,"word":"星條旗","characters":[{"definition":["star\/heavenly body\/satellite\/small amount"],"pinyin":["xing1"],"word":"星"},{"definition":["strip\/item\/article\/clause (of law or treaty)\/classifier for long thin things (ribbon, river, road, trousers etc)"],"pinyin":["tiao2"],"word":"條"},{"definition":["banner\/flag\/(in Qing times) Manchu (cf. 八旗[Ba1 qi2])\/administrative subdivision in inner Mongolia equivalent to 縣|县[xian4] county\/CL:面[mian4]"],"pinyin":["qi2"],"word":"旗"}],"containing_words":[],"sentences":[{"english":"The evolution of the Stars and Stripes reflects the growth of the United States.","chinese":"的演變星條旗的增長反映了美國。"},{"english":"You can see the stars and stripes.","chinese":"你可以看見星條旗。"},{"english":"The song’s rousing refrain recalls the early struggles of a nation.","chinese":"《星條旗》那悠揚的副歌再現了建國初期的奮鬥史。"},{"english":"This is the pattern of our current 50-star flag.","chinese":"這種模式正在爲目前的50星條旗所使用。"},{"english":"A band, with fife and drum, played “The Star Spangled Banner.","chinese":"一個有鼓和橫笛的樂隊，演奏了“星條旗”。"},{"english":"Eventually The Star-Spangled Banner was performed and play began.","chinese":"最終，美國國歌《星條旗之歌》奏響了，比賽開始了。"},{"english":"Could the flag change again?","chinese":"星條旗是否還會再更改？"},{"english":"This only works for flags with an odd number of rows.","chinese":"這種模式只適用於行數爲奇數的星條旗。"},{"english":"And we bear the glorious stars for the Union and the right.","chinese":"爲了聯邦和正義，我們扛起光榮的星條旗。"},{"english":"America's famous flag, the Star-Spangled Banner, was at the center of the effort.","chinese":"美國著名的旗幟，星條旗，被列爲主要保護對象。"},{"english":"The Star-Spangled Banner went to a special conservation laboratory.","chinese":"星條旗被運送到特殊保存實驗室中。"},{"english":"Tis the star-spangled banner; oh, long may it wave.","chinese":"這是星條旗，哦，願它永遠飄揚。"},{"english":"Wearing stars and stripes, a cowboy watches rodeo events from the chutes.","chinese":"一位身着星條旗服裝的牛仔在斜槽後觀看着騎術表演。"},{"english":"Many patterns, like the 50-star flag, have both.","chinese":"許多模式下，像是50星條旗，則是兩者兼顧的。"},{"english":"A band, with fife and drum, played “The Star Spangled Banner.”","chinese":"一個有鼓和橫笛的樂隊，演奏了“星條旗”。"},{"english":"The flag held by the soldiers was painted in the stars and stripes of the US flag.","chinese":"士兵們高舉的旗幟也被繪成了美國的星條旗。"}],"related":[]}