{"definition":["Spring and Autumn Period (770-476 BC)"],"pinyin":["Chun1 qiu1 Shi2 dai4"],"simplified":["春秋时代"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"春秋時代","characters":[{"definition":["spring (season)\/gay\/joyful\/youthful\/love\/lust\/life","surname Chun"],"pinyin":["Chun1","chun1"],"word":"春"},{"definition":["autumn\/fall\/harvest time","surname Qiu"],"pinyin":["Qiu1","qiu1"],"word":"秋"},{"definition":["o'clock\/time\/when\/hour\/season\/period","surname Shi"],"pinyin":["Shi2","shi2"],"word":"時"},{"definition":["to substitute\/to act on behalf of others\/to replace\/generation\/dynasty\/age\/period\/(historical) era\/(geological) eon"],"pinyin":["dai4"],"word":"代"}],"containing_words":[],"sentences":[{"english":"As early as in the spring and Autumn period, the island of Zhifu is a famous place.","chinese":"早在春秋時代，芝罘島就是個有名的地方。"},{"english":"In the Spring and Autumn Period, in the State of Qi there was a man who always let his imagination run away with him.","chinese":"春秋時代，杞國有一個喜歡胡思亂想的人。"},{"english":"Writing poems was a ritual to express individual's political ideal and ambition in the Spring-and-Autumn Period.","chinese":"春秋時代，賦詩是政治理想與個人志向的表達方式。"},{"english":"In the Spring and Autumn period, copper and iron chopsticks came into being.","chinese":"在春秋時代又出現了銅製和鐵製的筷子。"},{"english":"Its origin dates back to the Spring and Autumn Period.","chinese":"清明節可以追溯到春秋時代。"},{"english":"During Spring&Autumn period, the language of Chu was quite different to the language used in Central plain.","chinese":"在春秋時代，楚語和中原語言之間有明顯的區別。"},{"english":"In the ring and Autumn period, co er and iron cho ticks came into being.","chinese":"在春秋時代又出現了銅製和鐵製的筷子。"},{"english":"In the Spring and Autumn Period, Duke Huan of Qi led an army to attack a small state in the north.","chinese":"春秋時代，齊桓公出徵攻打北方一個小國。"},{"english":"In the Spring and Autumn Period, there was an expert archer.","chinese":"春秋時代有個人射箭的技術非常高超。"},{"english":"In the Spring and Autumn Period, a man in the State of Song raised monkeys.","chinese":"春秋時代，宋國有一個人，養了一大羣猴子。"},{"english":"Having seen the crisis appearance of existence on the Spring and Autumn Period, Confucius set his mind on carrying forward Ren to benefit mankind.","chinese":"面對春秋時代的生存危機現象，孔子有志於弘道濟世。"},{"english":"Spring and Autumn Period in Chinese history is an important period of social transformation.","chinese":"春秋時代是中國歷史上社會轉型的重要時期。"},{"english":"Bole whose real name is Yang Sun, he is the person Spring and Autumn Period.","chinese":"第一個被稱作伯樂的人本名孫陽，他是春秋時代的人。"}],"related":[{"definition":["King Gou Jian of Yue (c. 470 BC), sometimes considered one of the Five Hegemons 春秋五霸"],"pinyin":["Yue4 Wang2 Gou1 Jian4"],"word":"越王勾踐"},{"definition":["Bamboo Annals, early chronicle of Chinese ancient history, written c. 300 BC"],"pinyin":["Zhu2 shu1 Ji4 nian2"],"word":"竹書紀年"},{"definition":["Former Han dynasty (206 BC-8 AD), also called 西漢|西汉[Xi1 Han4], Western Han dynasty"],"pinyin":["Qian2 Han4"],"word":"前漢"},{"definition":["Shang Tang (1646-? BC), legendary founder of the Shang Dynasty"],"pinyin":["Shang1 Tang1"],"word":"商湯"},{"definition":["Jin Dynasty (265-420)"],"pinyin":["Jin4 chao2"],"word":"晉朝"},{"definition":["School of Yin-Yang of the Warring States Period (475-221 BC) founded by Zou Yan 鄒衍|邹衍[Zou1 Yan3]"],"pinyin":["Yin1 yang2 jia1"],"word":"陰陽家"},{"definition":["lit. “Mr. Lü's Spring and Autumn (Annals)”, compendium of the philosophies of the Hundred Schools of Thought 諸子百家|诸子百家[zhu1 zi3 bai3 jia1], compiled around 239 BC under the patronage of Qin Dynasty 秦代[Qin2 dai4] Chancellor Lü Buwei 呂不韋|吕不韦[Lu:3 Bu4 wei2]"],"pinyin":["Lu:3 shi4 Chun1 qiu1"],"word":"呂氏春秋"},{"definition":["Shennong or Farmer God (c. 2000 BC), first of the legendary Flame Emperors, 炎帝[Yan2 di4] and creator of agriculture in China\/followers or clan of Shennong 神農|神农[Shen2 nong2]"],"pinyin":["Shen2 nong2 shi4"],"word":"神農氏"},{"definition":["medical scientist"],"pinyin":["yi1 xue2 jia1"],"word":"醫學家"},{"definition":["the Three Su father and sons (referring to Northern Song literati Su Xun 蘇洵|苏洵[Su1 Xun2], Su Shi 蘇軾|苏轼[Su1 Shi4] and Su Zhe 蘇轍|苏辙[Su1 Zhe2])"],"pinyin":["San1 Su1"],"word":"三蘇"},{"definition":["divination combined with mystical Confucian philosopy, prevalent during the Eastern Han Dynasty (25-220)"],"pinyin":["chen4 wei3"],"word":"讖緯"},{"definition":["to broadcast a time signal"],"pinyin":["shou4 shi2"],"word":"授時"},{"definition":["the Book of History, one of the Five Classics of Confucianism 五經|五经[Wu3 jing1], a compendium of documents which make up the oldest extant texts of Chinese history, from legendary times down to the time of Confucius, also known as 尚書經|尚书经[Shang4 shu1 jing1], 尚書|尚书[Shang4 shu1], 書|书[Shu1]"],"pinyin":["Shu1 jing1"],"word":"書經"},{"definition":["Song of the Southern dynasties 南朝宋 (420-479), with capital at Nanjing"],"pinyin":["Liu2 Song4"],"word":"劉宋"},{"definition":["Zou Yan (305-240 BC), founder of the School of Yin-Yang of the Warring States Period (475-221 BC)"],"pinyin":["Zou1 Yan3"],"word":"鄒衍"},{"definition":["the Spring and Autumn (770-476 BC) and Warring States (475-221 BC) periods"],"pinyin":["Chun1 qiu1 Zhan4 guo2"],"word":"春秋戰國"}]}