{"definition":["from time to time"],"pinyin":["shi2 bu4 shi2"],"simplified":["时不时"],"rank":12211.0,"normalized_rank":0.17084773271025422,"fraction":0.000005946252652593945,"cumulative_fraction":0.945192696199267,"word":"時不時","characters":[{"definition":["o'clock\/time\/when\/hour\/season\/period","surname Shi"],"pinyin":["Shi2","shi2"],"word":"時"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["o'clock\/time\/when\/hour\/season\/period","surname Shi"],"pinyin":["Shi2","shi2"],"word":"時"}],"containing_words":[],"sentences":[{"english":"Localised epidemics and global pandemics periodically pose a significant national and global threat.","chinese":"局部和全球的的流行病時不時的威脅着我們。"},{"english":"He was like a taut string; you can play the notes from time to time.","chinese":"他像是一根繃緊的弦，時不時可以彈奏出音符。"},{"english":"He was utterly rigid except for his hands, which were opening and closing spasmodically.","chinese":"現在，他完全僵硬了，除了手掌時不時一開一合。"},{"english":"He punctuated his remarks with thumps on the table.","chinese":"他講話時不時地捶着桌子。"},{"english":"A few children buy game currency from time to time in devoted machine.","chinese":"一些孩子時不時地買來遊戲幣投入機器中。"},{"english":"Even birds like to spend time alone and will run away from their nest sometimes.","chinese":"即使是鳥也喜歡獨處，而且時不時地會離開自己的巢。"},{"english":"Every now and then, one of us goes to the kitchen to make coffee.","chinese":"我們倆人說不定是誰，時不時去廚房沏杯咖啡。"},{"english":"Being aware, moment-by-moment, of what you are feeling.","chinese":"時不時的注意自己的情緒。"},{"english":"From time to time, Putin likes to use a dirty word or utter an obscene threat.","chinese":"時不時地，普京喜歡用髒字或者突然說出下作的恐嚇。"},{"english":"Why do things at times have to be so back breaking and soul wrenching ?","chinese":"爲什麼事情時不時地就會讓你身心交瘁呢？"},{"english":"My neighbor would drop in on me from time to time.","chinese":"鄰居們時不時到我家串串門。"},{"english":"After all, who doesn't whizz round blind corners on the wrong side of the road from time to time?","chinese":"畢竟，誰不會時不時地在盲角疾馳着打個迴轉彎呢？"},{"english":"Gazelles often hop when running.","chinese":"瞪羚在奔跑時不時地齊足跳行。"},{"english":"Trapse downstairs in your underthings to check it out?","chinese":"還是時不時穿着內衣到樓下看看。"},{"english":"Everyone enjoys a game of make-believe now and then.","chinese":"所有人時不時喜歡搞些扮裝遊戲。"},{"english":"I may listen to music from time to time, but often enjoy the silence.","chinese":"我可能時不時的聽聽音樂，但我通常享受那種安靜。"}],"related":[]}