{"definition":["Mandarin (common language)\/Putonghua (common speech of the Chinese language)\/ordinary speech"],"pinyin":["pu3 tong1 hua4"],"simplified":["普通话"],"rank":9288.0,"normalized_rank":0.1299511703720286,"fraction":0.000009381398167908933,"cumulative_fraction":0.9234428996775192,"word":"普通話","characters":[{"definition":["general\/popular\/everywhere\/universal"],"pinyin":["pu3"],"word":"普"},{"definition":["classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)","to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc"],"pinyin":["tong1","tong4"],"word":"通"},{"definition":["dialect\/language\/spoken words\/speech\/talk\/words\/conversation\/what sb said\/CL:種|种[zhong3],席[xi2],句[ju4],口[kou3],番[fan1]"],"pinyin":["hua4"],"word":"話"}],"containing_words":[{"definition":["Putonghua Proficiency Test, an official test of spoken fluency in Standard Chinese for native speakers of Chinese languages, developed in the PRC in 1994"],"pinyin":["Pu3 tong1 hua4 Shui3 ping2 Ce4 shi4"],"word":"普通話水平測試"}],"sentences":[{"english":"Many employers also check whether potential hires can speak Mandarin.","chinese":"許多用人單位也會覈查應聘者是否會講普通話。"},{"english":"Hong Kong was suffering from a shortage of high-quality Putonghua teachers.","chinese":"香港缺乏高質素的普通話教師。"},{"english":"The compartment regulars between dialect and Mandrain are the important basis of dialect correctness.","chinese":"方言與普通話語音對應規律是方音辨正的重要依據。"},{"english":"Previously also speak Mandarin, Sichuan, guests hear the words, but also with soil any more.","chinese":"先前還講普通話，聽到客人是四川話，也用土話了。"},{"english":"Locke's (Mandarin) Chinese family name is Luo.","chinese":"如果按照普通話，駱家輝的中國姓爲駱。"},{"english":"Putonghua test is a kind of standard referential test.","chinese":"普通話水平測試屬於標準參照性考試。"},{"english":"But their dialects are distinctly different from Mandarin, the most-widely spoken language in China.","chinese":"然而，他們的方言跟中國最流行的普通話有明顯不同。"},{"english":"He speaks putonghua quite correctly.","chinese":"他普通話說得很標準。"},{"english":"Tang poetry, for example, rhymes and sounds much better when read in Cantonese than in Mandarin.","chinese":"比如唐詩用粵語讀起來押韻和發音都比普通話好。"},{"english":"Fluency in Mandarin or Cantonese , well spoken English. Additional Asian language is advantage.","chinese":"能講流利普通話或粵語及英語，懂其他亞洲語言尤佳。"},{"english":"Who says Beijing dialect differences with Mandarin is not a good example to distinguish between southerners?","chinese":"誰說北京話與普通話的差異對南方人來說不太好分辨？"},{"english":"The native of Zhuzhou County have some difficulty in correctly pronouncing Standard Chinese consonants.","chinese":"株洲縣入學習普通話聲母有一些難點和失誤。"},{"english":"\"Dao\", inversion and arrival, is homophone in Mandarin Chinese.","chinese":"因爲在普通話裏“倒”和“到”是同音字。"},{"english":"Of course, these applicants must be able to communicate with other people in Chinese Putonghua, he said.","chinese":"他說當然這些候選人必須具備能用普通話交流的能力。"},{"english":"The great importance of popularizing the common spoken Chinese in Zaozhuang-Tengzhou area is to distinguish between level-lingual and cacuminal.","chinese":"在棗滕地區推廣普通話，最重要的是分清平翹舌聲母。"},{"english":"How many grades does the Putonghua testing grade certificate have?","chinese":"普通話水平測試等級證書分爲幾個等級？"}],"related":[{"definition":["Cantonese language"],"pinyin":["Yue4 yu3"],"word":"粵語"},{"definition":["Cantonese language"],"pinyin":["Guang3 dong1 hua4"],"word":"廣東話"},{"definition":["Chinese language (Mandarin), emphasizing its national nature\/Chinese as a primary or secondary school subject\/Chinese in the context of the Nationalist Government\/Guoyu, book of historical narrative c. 10th-5th century BC"],"pinyin":["Guo2 yu3"],"word":"國語"},{"definition":["English (language)"],"pinyin":["Ying1 yu3"],"word":"英語"},{"definition":["native language\/mother tongue\/(linguistics) parent language"],"pinyin":["mu3 yu3"],"word":"母語"},{"definition":["language\/CL:門|门[men2],種|种[zhong3]"],"pinyin":["yu3 yan2"],"word":"語言"},{"definition":["to pronounce\/pronunciation\/to emit sound"],"pinyin":["fa1 yin1"],"word":"發音"},{"definition":["unable to make sense of what one is hearing"],"pinyin":["ting1 bu5 dong3"],"word":"聽不懂"},{"definition":["Cantonese (people)"],"pinyin":["Guang3 dong1 ren2"],"word":"廣東人"},{"definition":["colloquial speech\/spoken language\/vernacular language\/slander\/gossip\/CL:門|门[men2]"],"pinyin":["kou3 yu3"],"word":"口語"},{"definition":["Chinese language\/CL:門|门[men2]"],"pinyin":["Han4 yu3"],"word":"漢語"},{"definition":["to speak\/to explain\/to negotiate\/to emphasise\/to be particular about\/as far as sth is concerned\/speech\/lecture"],"pinyin":["jiang3"],"word":"講"},{"definition":["dialect\/language\/speech","to tell to"],"pinyin":["yu3","yu4"],"word":"語"},{"definition":["to speak\/to say\/to talk\/to gossip\/to tell stories\/talk\/word"],"pinyin":["shuo1 hua4"],"word":"說話"},{"definition":["spoken language\/vernacular"],"pinyin":["bai2 hua4"],"word":"白話"},{"definition":["to translate\/to interpret\/translator\/interpreter\/translation\/interpretation\/CL:個|个[ge4],位[wei4],名[ming2]"],"pinyin":["fan1 yi4"],"word":"翻譯"}]}