{"definition":["crystal structure"],"pinyin":["jing1 ti3 jie2 gou4"],"simplified":["晶体结构"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"晶體結構","characters":[{"definition":["crystal"],"pinyin":["jing1"],"word":"晶"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"},{"definition":["(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]","knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)"],"pinyin":["jie1","jie2"],"word":"結"},{"definition":["to construct\/to form\/to make up\/to compose\/literary composition\/paper mulberry (Broussonetia papyrifera)"],"pinyin":["gou4"],"word":"構"}],"containing_words":[],"sentences":[{"english":"During the procedure of warm water cross-linkage, the crystalline construction is adjusting.","chinese":"在溫水交聯過程中，晶體結構也在進行調整。"},{"english":"This was the first crystal structure of a membrane protein to be determined by Chinese scientists.","chinese":"這是我國科學家測定的第一個膜蛋白的晶體結構。"},{"english":"The appearance of strong reflection bands in the polarized spectra was explained by the aid of crystal structure.","chinese":"解釋出現在偏振光譜的強反射帶的援助的晶體結構。"},{"english":"The crystal structures of alkali-earth metal dihydrogen diphthalates have been measured.","chinese":"測定了鹼土金屬鄰苯二甲酸氫鹽的晶體結構。"},{"english":"And, we knew that if we know the crystal structure we can get the Madelung constant, not a problem.","chinese":"我們都知道只要有了晶體結構，就能知道馬德隆常數。"},{"english":"Crystal structure was analyzed by wide angle X ray scattering(WAXS).","chinese":"給出了X射線衍射對ACF氈晶體結構分析結果。"},{"english":"Explain the significance of the high-resolution crystal structure of collagen.","chinese":"請解釋膠原蛋白的高解析度晶體結構的重要性。"},{"english":"Evidence also implicates the crystal structure as a thermal conductivity barrier.","chinese":"證據還表明晶體結構作爲導熱性障礙。"},{"english":"Because of its ultra-fine crystal structure and high refractive index, it make color more abundance and satiation .","chinese":"微細晶體結構特性和高折光率，使色彩更顯豐富飽滿。"},{"english":"The structure was solved by heavy-atom method.","chinese":"應用重原子法測定了晶體結構。"},{"english":"The carbon atoms then neatly arranged themselves into the crystalline structure of a diamond.","chinese":"把碳原子排列得非常整齊，而形成晶體結構的鑽石。"},{"english":"We found that its gain were improved by adding the PBG structure.","chinese":"結果表明，通過添加光子晶體結構能提高天線增益。"},{"english":"It is a kind of white extreme pure super-fine powder with cubic crystal structure.","chinese":"本產品是一種純白的超細粉末，立方晶體結構。"}],"related":[]}