{"definition":["radiator (for heating)"],"pinyin":["nuan3 qi4 pian4"],"simplified":["暖气片"],"rank":30851.0,"normalized_rank":0.43164551648874394,"fraction":8.729462086343544e-7,"cumulative_fraction":0.991014432867382,"word":"暖氣片","characters":[{"definition":["warm\/to warm"],"pinyin":["nuan3"],"word":"暖"},{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"},{"definition":["disk\/sheet","thin piece\/flake\/a slice\/film\/TV play\/to slice\/to carve thin\/partial\/incomplete\/one-sided\/classifier for slices, tablets, tract of land, area of water\/classifier for CDs, movies, DVDs etc\/used with numeral 一[yi1]: classifier for scenario, scene, feeling, atmosphere, sound etc\/Kangxi radical 91"],"pinyin":["pian1","pian4"],"word":"片"}],"containing_words":[],"sentences":[{"english":"Yang Ling can dust the desks and chairs and Wu Ying will take care of the radiators.","chinese":"楊玲擦桌椅，吳英負責暖氣片。"},{"english":"The radiator is out of control because of its long working hours.","chinese":"由於工作太長時間了，這個暖氣片已經失控了。"},{"english":"The two ends of the pipeline are connected with the radiator .","chinese":"管道的兩端與暖氣片相連接。"},{"english":"The two ends of the pipeline are connected with the radiator.","chinese":"管道的兩端與暖氣片相連接。"},{"english":"Radiator to ensure that each group has a leading international standard quality.","chinese":"確保每組暖氣片都具有領先國際水平的品質。"},{"english":"Heat radiates from the heating radiator and spreads to every corner of the room.","chinese":"熱從暖氣片散發出來並傳播到室內各個角落。"},{"english":"This room has a ra'di. a'tor.","chinese":"這間房間有一個暖氣片。"},{"english":"They put some wet towels on the radiators to humidify the room.","chinese":"他們在暖氣片上放了些溼毛巾以使房間溼潤。"},{"english":"I have got to stop sleeping next to radiator.","chinese":"我不能再挨着暖氣片睡覺了。"},{"english":"Mounted on radiator exhaust auto exhaust valve should be directed vertically upward.","chinese":"安裝於暖氣片的自動排氣閥排氣方向應垂直向上。"},{"english":"He tossed his coat on a chair and warmed his hands at a radiator.","chinese":"他把大衣扔到椅子上，把手放在暖氣片上烤了烤。"}],"related":[]}