{"definition":["unimpeded\/free-flowing\/straight path\/unclogged\/move without obstruction"],"pinyin":["chang4 tong1"],"simplified":["畅通"],"rank":7095.0,"normalized_rank":0.09926825514529962,"fraction":0.000014445945954256808,"cumulative_fraction":0.8979036632250897,"word":"暢通","characters":[{"definition":["free\/unimpeded\/smooth\/at ease\/free from worry\/fluent"],"pinyin":["chang4"],"word":"暢"},{"definition":["classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)","to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc"],"pinyin":["tong1","tong4"],"word":"通"}],"containing_words":[],"sentences":[{"english":"Belling out the end of the tube will permit a freer passage of air.","chinese":"把管端做成鐘口狀可使氣流更暢通。"},{"english":"Broad boulevards are unimpeded by traffic in the new district, called Kangbashi New Area.","chinese":"寬闊的馬路暢通無阻的縱橫在名叫康巴什的新城。"},{"english":"The channel of communication is smooth.","chinese":"溝通的渠道也是暢通的。"},{"english":"The path to knowledge is now unbarred.","chinese":"如今求知之路暢通無阻。"},{"english":"Secondly, to strengthen inter-organizational consultations, keep the information channels.","chinese":"其次，加強組織間的協商，保持信息渠道暢通。"},{"english":"Recommit yourself to doing all of the positive things you did to keep the lines of communication open and the relationships going.","chinese":"把所有保持交流暢通，讓感情繼續的事情重新做一遍。"},{"english":"The ghostly particles pass through our planet totally unimpeded.","chinese":"這如同幽靈的粒子在地球上暢通無阻。"},{"english":"Keep streets clear for the passage of  emergency vehicles.","chinese":"爲使救援車輛通行無阻，要保持街道暢通。"},{"english":"Verify tube patency before and after medication administration.","chinese":"給藥前後應確認飼管暢通。"},{"english":"International long distance, business fax, wireless networks unimpeded.","chinese":"國際長途，商務傳真，無線網絡暢通無阻。"},{"english":"Our digital communication network has been engineered so that copies flow with as little friction as possible.","chinese":"我們的數字通信網絡被打造成讓拷貝流盡量暢通無阻。"},{"english":"Nose drops or inhalations containing drugs that contract Blood vessels help drain the sinuses.","chinese":"含有可收縮血管幫助鼻竇暢通的藥物成分。"},{"english":"Launching tracks of No. 1 lifeboat clear in 10 minutes.","chinese":"一號艇放艇滑軌在10分鐘內暢通。"},{"english":"They tell the few drivers winding their way through shut-down streets which roads are open.","chinese":"他們會告知司機如何繞過關閉的街道找到暢通的道路。"},{"english":"Set up the \"sun mountain\" network, open people's appeal channels.","chinese":"搭建了《陽光秀山》網絡，暢通人民羣衆的訴求渠道。"},{"english":"Their luck held and they were able to walk freely out of the main camp and towards the store block.","chinese":"他們很幸運，暢通無阻地出了主營區，向倉庫區走去。"}],"related":[{"definition":["smooth and unhindered\/fluent"],"pinyin":["shun4 chang4"],"word":"順暢"},{"definition":["unobstructed\/clear"],"pinyin":["tong1 chang4"],"word":"通暢"},{"definition":["to dredge\/to open up a path for\/to remove obstructions\/to clear the way\/to enlighten\/persuasion"],"pinyin":["shu1 dao3"],"word":"疏導"},{"definition":["to relax\/relaxed"],"pinyin":["shu1 huan3"],"word":"紓緩"},{"definition":["to flow\/to circulate\/to go from place to place\/to be mobile\/(of assets) liquid"],"pinyin":["liu2 dong4"],"word":"流動"},{"definition":["free\/unimpeded\/smooth\/at ease\/free from worry\/fluent"],"pinyin":["chang4"],"word":"暢"},{"definition":["to operate\/operations\/workings\/activities (usu. of an organization)\/thread (computing)"],"pinyin":["yun4 zuo4"],"word":"運作"},{"definition":["to reinforce\/to strengthen\/to increase"],"pinyin":["jia1 qiang2"],"word":"加強"},{"definition":["to promote (an idea or cause)\/to advance\/boost"],"pinyin":["cu4 jin4"],"word":"促進"},{"definition":["system\/CL:個|个[ge4]"],"pinyin":["xi4 tong3"],"word":"系統"},{"definition":["dealings\/contacts\/to go back and forth"],"pinyin":["wang3 lai2"],"word":"往來"},{"definition":["to ensure\/to guarantee"],"pinyin":["que4 bao3"],"word":"確保"},{"definition":["to link\/to join\/to attach\/connection\/a link (on web page)"],"pinyin":["lian2 jie1"],"word":"連接"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"},{"definition":["qi and blood (two basic bodily fluids of Chinese medicine)"],"pinyin":["qi4 xue4"],"word":"氣血"},{"definition":["to slow down\/to retard"],"pinyin":["jian3 huan3"],"word":"減緩"}]}