{"definition":["line graph\/line diagram"],"pinyin":["qu1 xian4 tu2"],"simplified":["曲线图"],"rank":41477.0,"normalized_rank":0.5803170427993788,"fraction":3.3370485500637695e-7,"cumulative_fraction":0.9970182074199314,"word":"曲線圖","characters":[{"definition":["bent\/crooked\/wrong","surname Qu","tune\/song\/CL:支[zhi1]"],"pinyin":["Qu1","qu1","qu3"],"word":"曲"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"},{"definition":["diagram\/picture\/drawing\/chart\/map\/CL:張|张[zhang1]\/to plan\/to scheme\/to attempt\/to pursue\/to seek"],"pinyin":["tu2"],"word":"圖"}],"containing_words":[],"sentences":[{"english":"He replied to Hogan and sent him a plot of the noise.","chinese":"他回信給霍根並寄去一段噪音的曲線圖。"},{"english":"Moral behavior, however, is scattered all over the chart.","chinese":"但是道德行爲卻分散在曲線圖的每個角落。"},{"english":"See the graph above and below for the numbers.","chinese":"看看上面的曲線圖和下面的數字吧。"},{"english":"Found with the selected metering pump performance curve of the corresponding.","chinese":"找到與所選用的計量泵相應的性能曲線圖。"},{"english":"A tri-display includes a bar graph showing continuous change in acidity or alkalinity.","chinese":"一幅三視條形曲線圖顯示出物質酸鹼度的連續變化。"},{"english":"In Australia EREY is not yet at the top of the chart but it is a rising star.","chinese":"還未達到曲線圖的頂端但它是一顆正在上升的星晨。"},{"english":"Graphs give data in a two-dimensional picture.","chinese":"曲線圖可標出二維平面圖形上的數據。"},{"english":"The graph in Figure 1 shows this data for three projects.","chinese":"圖一中的曲線圖表明三個項目的數據。"},{"english":"The graph will rescale to show the region you selected.","chinese":"曲線圖將重新分度以顯示你所選的區域。"},{"english":"He tried to illustrate the fact with a diagram of curves based on rough estimates.","chinese":"他試圖以根據粗略估計做出的曲線圖來說明情況。"},{"english":"Monochrome terminals display the graphs using different kinds of lines.","chinese":"單色終端使用不同種類的線顯示曲線圖。"},{"english":"You'll also see several metrics being monitored and graphed.","chinese":"您還將看到若干度量數據正受到監視並繪製曲線圖。"}],"related":[]}