{"definition":["clerk of a law court"],"pinyin":["shu1 ji5 guan1"],"simplified":["书记官"],"rank":53875.0,"normalized_rank":0.7537811481258657,"fraction":9.357165881849851e-8,"cumulative_fraction":0.9994150400593904,"word":"書記官","characters":[{"definition":["abbr. for 書經|书经[Shu1 jing1]","book\/letter\/document\/CL:本[ben3],冊|册[ce4],部[bu4]\/to write"],"pinyin":["Shu1","shu1"],"word":"書"},{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"記"},{"definition":["government official\/governmental\/official\/public\/organ of the body\/CL:個|个[ge4]","surname Guan"],"pinyin":["Guan1","guan1"],"word":"官"}],"containing_words":[],"sentences":[{"english":"Alternatively, you may ask the Clerk for an Execution form?","chinese":"或者，你可以問書記官要一份執行表格。"},{"english":"The clerk assisted the judge by looking up related precedents.","chinese":"這位書記官協助那位法官查閱有關判例。"},{"english":"The clerk assisted the judge by looking up related precedents. Her breathing was assisted by a respirator.","chinese":"這位書記官協助那位法官查閱有關判例。"},{"english":"Registry accumulates junk files, and your computer's performance suffers.","chinese":"書記官處堆積的垃圾文件，計算機的性能受到影響。"},{"english":"The decision of the court runs counter to the advice of the clerk to the justice.","chinese":"法庭的裁決與法官書記官的意見相悖。"},{"english":"Use this number to identify your case when you contact the Clerk.","chinese":"在你聯繫書記官時可以用該號碼錶明你的案子。"},{"english":"Every court that I know of in the world has a clerk. In Canada, she’s called the registrar.","chinese":"就我所知，世界上的每一個最高法院都有一位書記官。"},{"english":"Every magistrates' court has a clerk of the court.","chinese":"每一個治安法庭配備書記官一名。"},{"english":"The clerk was gabbing over the indictment .","chinese":"書記官在喃喃誦讀起訴狀。"},{"english":"It is the Clerk's duty to ensure all parties a fair hearing.","chinese":"書記官的責任就是確保訴訟各方受到公平的審判。"},{"english":"The registry MUST remove the REGISTRY-LOCK status for the registrar to modify the domain.","chinese":"書記官處必須刪除註冊官的註冊表鎖定狀態來修改域。"}],"related":[]}