{"definition":["secretariat"],"pinyin":["shu1 ji5 chu4"],"simplified":["书记处"],"rank":16283.0,"normalized_rank":0.2278202957760273,"fraction":0.0000035618540954311446,"cumulative_fraction":0.963963322774988,"word":"書記處","characters":[{"definition":["abbr. for 書經|书经[Shu1 jing1]","book\/letter\/document\/CL:本[ben3],冊|册[ce4],部[bu4]\/to write"],"pinyin":["Shu1","shu1"],"word":"書"},{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"記"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"Cheng Donghong is the executive secretary of China Association for Science and Technology.","chinese":"程東紅是中國科學技術協會書記處書記。"},{"english":"After the congress, the secretariat moved from Shanghai to Beijing.","chinese":"代表大會召開之後，書記處由上海遷到了北京。"},{"english":"Wang Gang, member of Secretariat of the CPC Central Committee and other escorts arrived in the same plane.","chinese":"中共中央書記處書記王剛等陪同人員也同機抵達。"},{"english":"Wang Gang, member of the Secretariat of the CPC Central Committee, and other officials attended the meeting.","chinese":"中共中央書記處書記王剛等參加了會見。"},{"english":"Director Wang Gang of the Secretariat of the CPC Central Committee and other accompanying officials arrived at Chile by the same plane.","chinese":"中共中央書記處書記王剛等陪同人員同機抵達。"},{"english":"At that time, the Secretariat of the Central Committee discussed Comrade Luo Ronghuan's views and concurred with them.","chinese":"當時書記處討論，贊成羅榮桓同志的這個意見。"},{"english":"Wang Gang, Member of the Secretariat of the Central Committee and other accompanying staffs also arrived at the airport by the same plane.","chinese":"中共中央書記處書記王剛等陪同人員也同機抵達。"}],"related":[]}