{"definition":["stand-in\/substitute\/body double\/stuntman\/scapegoat\/fall guy\/to stand in for sb else"],"pinyin":["ti4 shen1"],"simplified":["替身"],"rank":16393.0,"normalized_rank":0.2293593384914583,"fraction":0.000003522002203297838,"cumulative_fraction":0.964352863196404,"word":"替身","characters":[{"definition":["to substitute for\/to take the place of\/to replace\/for\/on behalf of\/to stand in for"],"pinyin":["ti4"],"word":"替"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"}],"containing_words":[{"definition":["substitute actor (esp. in fights of theatrical stunts)\/stuntman"],"pinyin":["ti4 shen1 yan3 yuan2"],"word":"替身演員"}],"sentences":[{"english":"When he fells for love, the understudy of love you are.","chinese":"當一個人愛上了愛情，你就成了他愛情的替身。"},{"english":"The golden snake swordsman still also fell in love with double.","chinese":"金蛇郎君也還是愛上了替身。"},{"english":"Dabao to others when the body double, oneself was beaten face is swollen.","chinese":"大寶給別人當上了替身演員，自己被打得臉都腫了。"},{"english":"However, even after searching frantically, they were unable to find suitable replacements.","chinese":"然而工作人員四處拼命尋找，卻找不到合適的替身。"},{"english":"The president has started using look-alikes during some public appearances.","chinese":"這個總統開始用他的替身在許多公共場合露面。"},{"english":"\"One of mine?\" the simulagent asked, alarmed.","chinese":"“還有個我的人？”替身警覺地問着。"},{"english":"He used to stand in for the star.","chinese":"他過去一直在給明星做替身。"},{"english":"One student at Shenzhen University who identified himself as Qi works as a double.","chinese":"深圳大學的學生小齊就是一名代課替身。"},{"english":"He seldom uses a stunt man even for some dangerous thins scenes.","chinese":"他即使很危險的鏡頭也很少用替身演員。"},{"english":"Your stand-in objects will 'punch a hole' in the matte.","chinese":"你的替身對象將在影像形板中“鑽一個孔”。"},{"english":"Both Jacky Chan and Jet Li don't like to use stuntman in their films.","chinese":"成龍和李連杰在電影中都不愛用替身演員。"},{"english":"This is just a proxy for old-fashioned racism.","chinese":"這僅僅是一個老式的種族主義的替身。"}],"related":[{"definition":["substitute actor (esp. in fights of theatrical stunts)\/stuntman"],"pinyin":["ti4 shen1 yan3 yuan2"],"word":"替身演員"},{"definition":["to put on a play\/to perform\/fig. to pretend\/to feign"],"pinyin":["yan3 xi4"],"word":"演戲"},{"definition":["body double (in nude scenes)"],"pinyin":["luo3 ti4"],"word":"裸替"},{"definition":["(TV or movie) blooper\/continuity error\/(theater) to flub one's lines\/unintended exposure of a body part\/to be exposed (of a scheme or trick)\/to reveal sth one intended to conceal through a slip of the tongue\/to blow one's cover"],"pinyin":["chuan1 bang1"],"word":"穿幫"},{"definition":["cast and crew\/performers and production team"],"pinyin":["ju4 zu3"],"word":"劇組"},{"definition":["to clip (an image)\/image clipping"],"pinyin":["kou1 tu2"],"word":"摳圖"},{"definition":["to appear on stage in an amateur capacity\/(of a professional) to make a guest appearance\/(fig.) to assume a role outside one's usual duties\/to substitute for"],"pinyin":["ke4 chuan4"],"word":"客串"},{"definition":["to explode\/spontaneous detonation\/self-detonation\/suicide bombing\/to disclose private matters about oneself"],"pinyin":["zi4 bao4"],"word":"自爆"},{"definition":["supporting role (in play, film etc)\/minor role\/to play a secondary role (in business etc)\/to play second fiddle"],"pinyin":["pei4 jue2"],"word":"配角"},{"definition":["an extra (in a movie)"],"pinyin":["lin2 shi2 yan3 yuan2"],"word":"臨時演員"},{"definition":["seat of honor\/person in a high-ranking position\/to be promoted to a more senior role\/(genetics) epistatic"],"pinyin":["shang4 wei4"],"word":"上位"},{"definition":["to replace"],"pinyin":["ding3 ti4"],"word":"頂替"},{"definition":["actor or actress\/performer\/CL:個|个[ge4],位[wei4],名[ming2]"],"pinyin":["yan3 yuan2"],"word":"演員"},{"definition":["role\/character in a novel\/persona\/also pr. [jiao3 se4]"],"pinyin":["jue2 se4"],"word":"角色"},{"definition":["scene (in a movie etc)\/one's part in a movie or play\/(archaic) actor's payment"],"pinyin":["xi4 fen4"],"word":"戲份"},{"definition":["to make a movie"],"pinyin":["pai1 dian4 ying3"],"word":"拍電影"}]}