{"definition":["to meet\/to rendezvous\/to merge\/to link up\/meeting\/confluence"],"pinyin":["hui4 he2"],"simplified":["会合"],"rank":13050.0,"normalized_rank":0.18258643123976886,"fraction":0.0000053077465126998535,"cumulative_fraction":0.9499089406380335,"word":"會合","characters":[{"definition":["can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])","to balance an account\/accountancy\/accounting"],"pinyin":["hui4","kuai4"],"word":"會"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"}],"containing_words":[{"definition":["joint"],"pinyin":["hui4 he2 chu4"],"word":"會合處"}],"sentences":[{"english":"Finally he specified the particular time togather.","chinese":"最後他指定會合的特定時間。"},{"english":"The middle stretch of the Yangtze is a natural transportation and communications nexus.","chinese":"該地區位於長江中游，是天然的運輸與通訊會合點。"},{"english":"Junruo concubine Yang road dust, if the turbidity cement, floating and sinking of different potential, when harmonic meet?","chinese":"君若揚路塵，妾若濁水泥，浮沈各異勢，會合何時諧？"},{"english":"A stalagmite is below a stalactite and they both grow, eventually to meet.","chinese":"石筍在鐘乳石下面，它們二者都在增長，最終會合。"},{"english":"The road goes around in a loop and rejoins the main road about 2 kilometers past the town.","chinese":"這條路呈環狀，在城外兩公里處與幹道會合。"},{"english":"Eligible Transactions made by the Principal and Supplementary Cardholders of the same Applicable Credit Card Account will be counted collectively.","chinese":"適用信用卡主卡及附屬卡之籤賬將會合並計算。"},{"english":"B: Well, we need to meet first, then catch a taxi to the airport.","chinese":"哦，我們需要先會合，然後乘出租車去機場。"},{"english":"Ross and Rachel have to work, so they plan to come a day later.","chinese":"羅斯和瑞秋因工作安排而決定遲一天飛去會合。"},{"english":"The four Pevensie children meet Prince Caspian.","chinese":"帕文西四兄妹與凱斯賓王子會合。"},{"english":"The lane and the main road join here.","chinese":"小巷與大路在此會合。"},{"english":"Sounds good, I'll meet you back here after I go through the line.","chinese":"聽起來不錯，我排完隊後再到這兒來與你們會合。"},{"english":"A vanishing point. The illusion of convergence.","chinese":"那相交點正在消失，是對會合的幻覺。"},{"english":"We plan to join up with the other team at the top of the mountain.","chinese":"我們計劃與另外一個隊在山頂會合。"},{"english":"I meet up with another writer and we wend our way through downtown.","chinese":"我與另一位作家會合，慢慢蜿蜒穿過市中心。"},{"english":"What time is best to meet tomorrow?","chinese":"明天最好幾點會合？"},{"english":"Despite being surrounded by orcs, Sam and his master are reunited .","chinese":"儘管被半獸人重重包圍，山姆和他的主人還是會合了。"}],"related":[{"definition":["Huitong county in Huaihua 懷化|怀化[Huai2 hua4], Hunan","to handle sth jointly"],"pinyin":["Hui4 tong2","hui4 tong2"],"word":"會同"},{"definition":["one's affiliation (i.e. the organization one is affiliated with)\/subordinate (i.e. those subordinate to oneself)\/belonging to\/affiliated\/under one's command"],"pinyin":["suo3 shu3"],"word":"所屬"},{"definition":["residence\/dwelling\/dwelling place"],"pinyin":["zhu4 chu4"],"word":"住處"},{"definition":["to drive a vehicle"],"pinyin":["jia4 che1"],"word":"駕車"},{"definition":["on the way"],"pinyin":["shun4 dao4"],"word":"順道"},{"definition":["to go on a journey\/to leave"],"pinyin":["dong4 shen1"],"word":"動身"},{"definition":["to overtake\/to catch up with\/to hurry\/to rush\/to try to catch (the bus etc)\/to drive (cattle etc) forward\/to drive (sb) away\/to avail oneself of (an opportunity)\/until"],"pinyin":["gan3"],"word":"趕"},{"definition":["to negotiate\/discussion\/proposal"],"pinyin":["shang1 yi4"],"word":"商議"},{"definition":["to escort\/to accompany"],"pinyin":["hu4 song4"],"word":"護送"},{"definition":["neck\/collar\/to lead\/to receive\/classifier for clothes, mats, screens etc"],"pinyin":["ling3"],"word":"領"},{"definition":["confluence\/to converge\/to join\/to fuse\/fusion"],"pinyin":["hui4 he2"],"word":"匯合"},{"definition":["proposal\/suggestion\/to propose\/to suggest"],"pinyin":["ti2 yi4"],"word":"提議"},{"definition":["to carry\/to take along\/to bring along\/to hold (hands)\/also pr. [xi1]"],"pinyin":["xie2"],"word":"攜"},{"definition":["to take the opportunity\/to take a plane"],"pinyin":["cheng2 ji1"],"word":"乘機"},{"definition":["Malaya\/Malaysia"],"pinyin":["Ma3 lai2"],"word":"馬來"},{"definition":["visitor\/guest\/object (in grammar)"],"pinyin":["bin1"],"word":"賓"}]}