{"definition":["Huitong county in Huaihua 懷化|怀化[Huai2 hua4], Hunan","to handle sth jointly"],"pinyin":["Hui4 tong2","hui4 tong2"],"simplified":["会同"],"rank":6972.0,"normalized_rank":0.0975473255634995,"fraction":0.000014830451023411136,"cumulative_fraction":0.896102578126881,"word":"會同","characters":[{"definition":["can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])","to balance an account\/accountancy\/accounting"],"pinyin":["hui4","kuai4"],"word":"會"},{"definition":["like\/same\/similar\/together\/alike\/with"],"pinyin":["tong2"],"word":"同"}],"containing_words":[{"definition":["Huitong county in Huaihua 懷化|怀化[Huai2 hua4], Hunan"],"pinyin":["Hui4 tong2 xian4"],"word":"會同縣"}],"sentences":[{"english":"Chen's three sisters and his niece came for the ceremony from Huitong county in Hunan province.","chinese":"陳聚志的三個姐姐和侄女特意從湖南會同縣趕來。"},{"english":"I am not worried because I will talk to the supporters.","chinese":"我並不擔心，因爲我會同尤文球迷進行對話的。"},{"english":"To work with pertinent institutions to prepare funerals for deceased retired cadres and take charge of cadres' posthumous affairs.","chinese":"會同有關部門辦理離退休幹部的喪葬和善後處理事宜。"},{"english":"As a result, China’s trade surplus will shrink along with its saving rate.","chinese":"做爲加國，中國的外貿盈餘將會同儲蓄率一起縮水。"},{"english":"Usually [funders] are going to approach the women in a small city.","chinese":"一般情況下，資助者會同某一小城市的婦女接洽。"},{"english":"The specific areas shall be delimited by the Municipal City Planning Bureau together with the Municipal Greening Administration.","chinese":"具體範圍由市規劃局會同市綠化局劃定。"},{"english":"Only 10% of those surveyed said they will friend anyone.","chinese":"只有10%的受訪者表示他們會同任何人交友。"},{"english":"He hung about the entrance all day, hoping for a chance to speak to the director.","chinese":"他在門口轉悠了一整天，企望有機會同局長談談。"},{"english":"Do you think that I would argue with the next Ballon d'Or winner?","chinese":"難道你們認爲我會同下一任金球獎得主爭吵嗎？"},{"english":"For removal of extensive post-mediastinum tumors neurosurgeon should coopperate with thoracal surgeon.","chinese":"認爲胸段突入後縱隔的腫瘤必須會同胸外科聯合手術。"},{"english":"My players will shake hands and swap shirts with their opponents as normal, absolutely.","chinese":"我的球員肯定還會同往常一樣和對手握手並交換球衣。"},{"english":"The present measures shall be interpreted by the Investment Promotion Bureau of Beibei District together with relevant departments.","chinese":"本辦法由北碚區招商局會同有關部門負責解釋。"},{"english":"It is my great honor to be given the opportunity to share my experiences at AABC on behalf of the staff.","chinese":"今天非常榮幸能有機會同各位分享我在亞澳的經歷。"},{"english":"What do you talk to your partner about when you get home from work?","chinese":"當你下班回家後會同你的夥伴談些什麼呢？"},{"english":"When the painting is finished, your furniture will look as good as new.","chinese":"上過漆後這傢俱就會同新的一樣。"},{"english":"Specific measures shall be worked out by the Ministry of Machinery in conjunction with the departments concerned.","chinese":"具體辦法由機械部會同有關部門制定。"}],"related":[{"definition":["to meet\/to rendezvous\/to merge\/to link up\/meeting\/confluence"],"pinyin":["hui4 he2"],"word":"會合"},{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有關"},{"definition":["unified examination"],"pinyin":["hui4 kao3"],"word":"會考"},{"definition":["to meet with\/meeting"],"pinyin":["hui4 mian4"],"word":"會面"},{"definition":["for this reason\/with regards to this\/in this respect\/in order to do this\/to this end"],"pinyin":["wei4 ci3"],"word":"為此"},{"definition":["one's affiliation (i.e. the organization one is affiliated with)\/subordinate (i.e. those subordinate to oneself)\/belonging to\/affiliated\/under one's command"],"pinyin":["suo3 shu3"],"word":"所屬"},{"definition":["to negotiate\/discussion\/proposal"],"pinyin":["shang1 yi4"],"word":"商議"},{"definition":["to report\/to give an account of\/to collect information and report back"],"pinyin":["hui4 bao4"],"word":"匯報"},{"definition":["to get in touch with\/to contact\/to stay in contact (with)\/liaison\/(math.) connection"],"pinyin":["lian2 luo4"],"word":"聯絡"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["department\/branch\/section\/division\/CL:個|个[ge4]"],"pinyin":["bu4 men2"],"word":"部門"},{"definition":["to discuss\/to deliberate"],"pinyin":["shang1 tao3"],"word":"商討"},{"definition":["at the same time\/simultaneously"],"pinyin":["yi1 qi2"],"word":"一齊"},{"definition":["on that day","that very day\/the same day"],"pinyin":["dang1 ri4","dang4 ri4"],"word":"當日"},{"definition":["to follow\/to follow up"],"pinyin":["gen1 jin4"],"word":"跟進"},{"definition":["to coordinate\/to harmonize\/to fit together\/to match (colors etc)\/harmonious\/concerted"],"pinyin":["xie2 tiao2"],"word":"協調"}]}