{"definition":["harmful and without benefit (idiom); more harm than good"],"pinyin":["you3 hai4 wu2 yi4"],"simplified":["有害无益"],"rank":40044.0,"normalized_rank":0.5602675136065367,"fraction":3.836292033931577e-7,"cumulative_fraction":0.9965055923854426,"word":"有害無益","characters":[{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["to do harm to\/to cause trouble to\/harm\/evil\/calamity"],"pinyin":["hai4"],"word":"害"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["benefit\/profit\/advantage\/beneficial\/to increase\/to add\/all the more","surname Yi"],"pinyin":["Yi4","yi4"],"word":"益"}],"containing_words":[],"sentences":[{"english":"Avoid malcontents and pessimists. They dray you down and contribute nothing.","chinese":"避免結交不滿意者和悲觀者，他們對你有害無益。"},{"english":"Avoid malcontents and pessimists. They drag you down and contribute nothing.","chinese":"避免結交不滿意者和悲觀者，他們對你有害無益。"},{"english":"In fact, actin ring seals tight unhelpful.","chinese":"其實動環密封圈過緊有害無益。"},{"english":"There is also evidence that too much happiness can be bad for your career.","chinese":"許多證據表明，興奮過度對你的工作有害無益。"},{"english":"However, bad books be to do us lot harm dawn bad.","chinese":"然而，壞書卻對咱們有害無益。"},{"english":"Many of the behaviours that children acquire at home would be counterproductive elsewhere.","chinese":"孩子在家習得的許多行爲在別處則是有害無益的。"},{"english":"This outlook on life is psychologically harmful and physically detrimental.","chinese":"這種生活觀對心理和生理都有害無益。"},{"english":"Moreover , even the appearance of ageing can be harmful.","chinese":"而且，衰老的樣子也是有害無益的。"},{"english":"Excessive polite in family bring more harm than benefit.","chinese":"過分的客氣對於家庭有害無益。"},{"english":"However, bad books be to do us abundance harm dawn bad.","chinese":"然而，壞書卻對咱們有害無益。"},{"english":"However, bad books will do us more harm than good.","chinese":"就這樣，壞書卻對俺們有害無益喜悅。"},{"english":"I know it's bad for his health as well as mother's and mine.","chinese":"我知道吸菸有害他的健康，對我和媽媽也有害無益。"}],"related":[]}