{"definition":["limited term of imprisonment (i.e. anything less than life imprisonment)"],"pinyin":["you3 qi1 tu2 xing2"],"simplified":["有期徒刑"],"rank":4567.0,"normalized_rank":0.0638982552852126,"fraction":0.000027438976588356807,"cumulative_fraction":0.8478334615843873,"word":"有期徒刑","characters":[{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["a period of time\/phase\/stage\/classifier for issues of a periodical, courses of study\/time\/term\/period\/to hope\/Taiwan pr. [qi2]"],"pinyin":["qi1"],"word":"期"},{"definition":["disciple\/apprentice\/believer\/on foot\/bare or empty\/to no avail\/only\/prison sentence","surname Tu"],"pinyin":["Tu2","tu2"],"word":"徒"},{"definition":["punishment\/penalty\/sentence\/torture\/corporal punishment","surname Xing"],"pinyin":["Xing2","xing2"],"word":"刑"}],"containing_words":[],"sentences":[{"english":"His actions led to a death sentence, which was later commuted to a prison term.","chinese":"郗浩良的行動導致被判處死刑，後來減爲有期徒刑。"},{"english":"If the circumstances are especially serious, the offender shall be sentenced to fixed-term imprisonment of not less than ten years.","chinese":"情節特別嚴重的，處十年以上有期徒刑。"},{"english":"If the circumstances are serious, the offender shall be sentenced to fixed-term imprisonment of not less than three years and not more than seven years.","chinese":"情節嚴重的，處三年以上七年以下有期徒刑。"},{"english":"If the circumstances are serious, the offender shall be sentenced to fixed-term imprisonment of not less than seven years and not more than ten years.","chinese":"情節嚴重的，處七年以上十年以下有期徒刑。"},{"english":"And in the second instance it was eventually changed to five-year imprisonment owing to the public opposing voice.","chinese":"後終在輿論的壓力下，二審改判爲5年有期徒刑。"},{"english":"Does not commute a punishment the short-term set term of imprisonment to the malicious payment, replaces the fine the payment.","chinese":"對惡意不繳納者易科短期有期徒刑，代替罰金的繳納。"},{"english":"If the circumstances are especially serious, the offender shall be sentenced to fixed-term imprisonment of not less than five years.","chinese":"情節特別嚴重的，處五年以上有期徒刑。"},{"english":"If the circumstances are serious, the offender shall be sentenced to fixed-term imprisonment of not less than three years and not more than ten years.","chinese":"情節嚴重的，處三年以上十年以下有期徒刑。"},{"english":"Killing endangered species is punishable by a 12-year prison term and stiff fines.","chinese":"殺害瀕臨絕種物種可處12年有期徒刑及高額罰款。"},{"english":"The victim's daughter was sentenced to 17 years behind bars.","chinese":"受害人的女兒被判17年有期徒刑。"},{"english":"the ringleaders and the ones who commit major crimes shall be sentenced to fixed-term imprisonment of not less than five years.","chinese":"首要分子或者罪行重大的，處五年以上有期徒刑。"},{"english":"The court sentenced him to 9 years imprisonment on the charge of bawdry.","chinese":"法院以委瑣婦女罪判處他9年有期徒刑。"},{"english":"If the circumstances are serious, the offender shall be sentenced to fixed-term imprisonment of not less than ten years or life imprisonment.","chinese":"情節嚴重的，處十年以上有期徒刑或者無期徒刑。"},{"english":"Whoever in wartime commits the crime mentioned in the preceding paragraph shall be sentenced to fixed-term imprisonment of not less than five years.","chinese":"戰時犯前款罪的，處五年以上有期徒刑。"},{"english":"if death is caused, he shall be sentenced to fixed-term imprisonment of not less than 10 years and shall also be fined.","chinese":"造成就診人死亡的，處十年以上有期徒刑，並處罰金。"},{"english":"He is the accessory of this crime, so he is also sentences to one year.","chinese":"他是這起犯罪案的同謀，所以被判有期徒刑一年。"}],"related":[{"definition":["life imprisonment"],"pinyin":["wu2 qi1 tu2 xing2"],"word":"無期徒刑"},{"definition":["to sentence\/to condemn"],"pinyin":["pan4 chu3"],"word":"判處"},{"definition":["detention"],"pinyin":["ju1 yi4"],"word":"拘役"},{"definition":["prison sentence"],"pinyin":["tu2 xing2"],"word":"徒刑"},{"definition":["suspended sentence\/probation"],"pinyin":["huan3 xing2"],"word":"緩刑"},{"definition":["fine\/to forfeit"],"pinyin":["fa2 jin1"],"word":"罰金"},{"definition":["to impose an additional penalty"],"pinyin":["bing4 chu3"],"word":"並處"},{"definition":["fraud"],"pinyin":["zha4 pian4 zui4"],"word":"詐騙罪"},{"definition":["disorderly behavior (PRC law)"],"pinyin":["xun2 xin4 zi1 shi4 zui4"],"word":"尋釁滋事罪"},{"definition":["to be punished"],"pinyin":["huo4 xing2"],"word":"穫刑"},{"definition":["robbery"],"pinyin":["qiang1 jie2 zui4"],"word":"搶劫罪"},{"definition":["rape"],"pinyin":["qiang2 jian1 zui4"],"word":"強姦罪"},{"definition":["to sentence (to prison etc)"],"pinyin":["pan4 xing2"],"word":"判刑"},{"definition":["culpable driving causing serious damage or injury"],"pinyin":["jiao1 tong1 zhao4 shi4 zui4"],"word":"交通肇事罪"},{"definition":["to defer\/to put off (until later)\/to postpone"],"pinyin":["huan3 qi1"],"word":"緩期"},{"definition":["prison term"],"pinyin":["xing2 qi1"],"word":"刑期"}]}