{"definition":["organic chemistry"],"pinyin":["you3 ji1 hua4 xue2"],"simplified":["有机化学"],"rank":43678.0,"normalized_rank":0.6111118884054119,"fraction":2.7122643070946997e-7,"cumulative_fraction":0.9976830622295182,"word":"有機化學","characters":[{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"},{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"Basic knowledge of organic chemistry is one of the important contents in the high school chemistry course.","chinese":"有機化學基礎知識是高中化學課程的重要內容之一。"},{"english":"Grignard reagents has a wide range of applications in organic chemistry.","chinese":"格氏試劑在有機化學中的應用十分廣泛。"},{"english":"B. the whole system of sterilization alga processing and the organic chemical cleaning.","chinese":"整個系統的殺菌滅藻處理和全有機化學清洗。"},{"english":"In collage I specialize in organic chemistry.","chinese":"在學院裏我主修有機化學。"},{"english":"Text on metal organic chemical research direction for a brief discussion.","chinese":"文中就金屬有機化學的研究方向進行了簡要的論述。"},{"english":"Handbook of Environmental Data on Organic Chemicals, 5th Edition, 4 Volume Set.","chinese":"《有機化學品環境數據手冊》，第5版，4卷套。"},{"english":"Let me tell you a story about organic chemistry.","chinese":"讓我告訴你一個關於有機化學的故事。"},{"english":"The study on molecular recognition of artificial receptors is one the frontiers in Bioorganic Chemistry.","chinese":"人工分子識別是生物有機化學前沿領域之一。"},{"english":"Stereochemistry is one of the important and difficult contents in organic chemistry.","chinese":"立體化學是有機化學教學的重點和難點之一。"},{"english":"Here is where I admit I have never taken Geology or Organic Chemistry.","chinese":"坦白地說，我從來沒有學過地質學或有機化學。"},{"english":"Palladium-catalyzed reactions is also a hot topic of current research.","chinese":"鈀催化的有機化學反應也是當今研究的熱點問題。"},{"english":"This is the webpage of the Russian Journal of Bioorganic Chemistry.","chinese":"這是《俄國生物有機化學雜誌》的網頁。"}],"related":[]}