{"definition":["mitosis"],"pinyin":["you3 si1 fen1 lie4"],"simplified":["有丝分裂"],"rank":62345.0,"normalized_rank":0.8722874372140529,"fraction":2.8027704357490976e-8,"cumulative_fraction":0.9998959718177959,"word":"有絲分裂","characters":[{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["silk\/thread\/trace\/(cuisine) shreds or julienne strips\/CL:條|条[tiao2]\/classifier: a thread (of cloud, smoke etc), a bit, an iota, a hint (of sth) etc"],"pinyin":["si1"],"word":"絲"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["to split\/to crack\/to break open\/to rend"],"pinyin":["lie4"],"word":"裂"}],"containing_words":[],"sentences":[{"english":"Microtubules have dominated our think about the mitotic mechanisms.","chinese":"微管促使我的思考有絲分裂的機制。"},{"english":"After extrusion of polar body and the completion of the first cell cycle, microfilaments concentrated to the cleavage furrows.","chinese":"極體排出和第一次有絲分裂時微絲在卵裂溝處富集。"},{"english":"Microtubules have dominated our think about the mitotic mechanisms.","chinese":"例如，有絲分裂的途徑可以看到在粘菌之絨泡。"},{"english":"Mitotic cells could be seen too.","chinese":"有絲分裂細胞仍可見到。"},{"english":"Double fertilization is the type of the Premitotic syngamy .","chinese":"雙受精過程屬有絲分裂前配子融合類型。"},{"english":"Nearly half of these genes are involved in mitosis.","chinese":"這些基因的一半左右參與了有絲分裂。"},{"english":"The mitotic route is seen, for example, in the since mold Physarum.","chinese":"例如，有絲分裂的途徑可以看到在粘菌之絨泡。"},{"english":"Report About Abnormal Mitosis in Root Tip Cells of Allium sativum L.","chinese":"大蒜根尖細胞有絲分裂發生異常現象的報告。"},{"english":"I'm an advocate of mitosis.","chinese":"我主張的是有絲分裂。"},{"english":"Prophase --- The first stage of cell division, during which the chromosomes become visible as discrete structures and subsequently thicken and shorten.","chinese":"細胞有絲分裂或減數分裂的第一個階段。"},{"english":"In these groups, gametes are produced by mitosis.","chinese":"在這些種類中，配子是由有絲分裂形成的。"},{"english":"At anaphase of mitosis, the organelles in microspore cytoplasm are concentrated in the future vegetative cell pole.","chinese":"有絲分裂後期，細胞器集中於未來的營養細胞極。"},{"english":"The mitotic route can be seen.","chinese":"有絲分裂的途徑可以看到。"},{"english":"The double fertilization is the type of Premitotic syngamy.","chinese":"雙受精作用屬於有絲分裂前配子融合類型。"},{"english":"The Role of Kinetochore Protein Mitosin in Mitosis;","chinese":"有絲分裂的途徑可以看到。"},{"english":"The double fertilization is the type of the premitotic syngamy.","chinese":"玉米雙受精屬於有絲分裂前配子融合的類型。"}],"related":[]}