{"definition":["to have or have not\/surplus and shortfall\/tangible and intangible\/corporeal and incorporeal"],"pinyin":["you3 wu2"],"simplified":["有无"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"有無","characters":[{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"}],"containing_words":[{"definition":["mutual exchange of assistance (idiom)\/to benefit from each other's strengths and make up each other's shortfalls\/to reciprocate with material assistance\/scratch each other's back"],"pinyin":["hu4 tong1 you3 wu2"],"word":"互通有無"},{"definition":["mutual exchange of assistance (idiom)\/to reciprocate with material assistance"],"pinyin":["you3 wu2 xiang1 tong1"],"word":"有無相通"}],"sentences":[{"english":"This would be a valid passing opportunity regardless of whether there was pre-existing overlap.","chinese":"這時後車有權超越，無論有無預先存在“重疊”。"},{"english":"Second only to God on their flagships , admirals are unreceptive to orders from anyone.","chinese":"海軍司令在旗艦上有無上權威，不聽任何人命令。"},{"english":"You will have to re-submit your Request List but the ticket availability may have changed in the new round.","chinese":"重新提交時，門票的有無情況可能會有所變化。"},{"english":"Whether the cementless prosthesis has collar or not has no influence on the stem's initial stability.","chinese":"非骨水泥假體有無肩託對初始穩定性影響不大。"},{"english":"Check for junk inside shoe joint.","chinese":"檢查浮鞋內有無落物。"},{"english":"Frontogenesis and frontolysis have decisive effect on the precipitation near Meiyu front.","chinese":"鋒生鋒消對於梅雨鋒附近有無降水起到了重要的作用。"},{"english":"Object The aim of the study was to reveal any personality deviation of female sexual offender.","chinese":"目的瞭解女性性罪錯者有無人格偏移。"},{"english":"It is a debatable issue in academic circles whether the Han nationality had epic in its early stage of history.","chinese":"學術界在漢民族有無史詩的問題上一直聚訟紛紜。"},{"english":"Its normal reaction depends on the existence of blastocysts in the uteri.","chinese":"對子宮裏有無胚泡存在的反應也顯然不同。"},{"english":"This evening clutch has an allure of timelessness.","chinese":"傳動器今晚有無時間限制魅力。"},{"english":"If the air fan rotates stably and if anything is abnormal.","chinese":"所有風機轉動是否平穩，有無異常。"},{"english":"Objective To explore mental health state of patients with blepharospasm and hemifacial spasm.","chinese":"目的探討瞼肌及面肌痙攣病人有無異常心理健康狀態。"},{"english":"Measuring the levels of urinary catecholamine can monitor the recurrence or metastasis of the tumor.","chinese":"術後監測尿兒茶酚胺含量，可以瞭解有無轉移或復發。"},{"english":"Loss rate of the system with or without implementing multi-sided control are compared.","chinese":"數值驗證不同情況下，有無實施多邊控制效果的對比。"},{"english":"The coating morphology of T10 after glow discharge is compared with that without glow discharge.","chinese":"對T10鋼滲層組織進行了有無輝光放電作用的對比。"},{"english":"Damp area should be checked more hang a picture to have because rustily or what decayed falls is dangerous, do not have.","chinese":"潮溼的地區應多檢查掛畫有無因鏽蝕或朽落的危險。"}],"related":[{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["to know\/knowledge\/Taiwan pr. [shi4]","to record\/to write a footnote"],"pinyin":["shi2","zhi4"],"word":"識"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms","gap\/to separate\/to thin out (seedlings)\/to sow discontent"],"pinyin":["jian1","jian4"],"word":"間"},{"definition":["to examine\/to test\/to check"],"pinyin":["yan4"],"word":"驗"},{"definition":["furthermore\/in addition\/still\/also"],"pinyin":["hai2 you3"],"word":"還有"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不過"},{"definition":["every kind of\/all kinds of\/various kinds"],"pinyin":["ge4 zhong3"],"word":"各種"},{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有關"},{"definition":["(dialect) how much\/how many\/how (smart etc)\/such ..."],"pinyin":["ji3 duo1"],"word":"幾多"},{"definition":["to listen\/to hear what sb says\/news one has heard"],"pinyin":["ting1 wen2"],"word":"聽聞"},{"definition":["surname Guang","wide\/numerous\/to spread"],"pinyin":["Guang3","guang3"],"word":"廣"},{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["really\/indeed"],"pinyin":["di2 que4"],"word":"的確"},{"definition":["in a word\/in short\/in brief"],"pinyin":["zong3 zhi1"],"word":"總之"}]}