{"definition":["cable television"],"pinyin":["you3 xian4 dian4 shi4"],"simplified":["有线电视"],"rank":8900.0,"normalized_rank":0.12452254697578105,"fraction":0.000010102089711726292,"cumulative_fraction":0.9196649499378052,"word":"有線電視","characters":[{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"},{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["to look at\/to regard\/to inspect"],"pinyin":["shi4"],"word":"視"}],"containing_words":[],"sentences":[{"english":"CATV signals travel strightyly high up into the space from TV stations.","chinese":"有線電視信號從電視臺直接送入空間。"},{"english":"Introduce the idea and project of CATV fibre-optical netting in urban and rural areas in Ninghua.","chinese":"介紹寧化縣城鄉有線電視光纖聯網設計思想和方案。"},{"english":"This paper introduces a remote meter -reading system based on CATV broad band network.","chinese":"介紹了一種基於有線電視寬帶網的遠方抄表系統。"},{"english":"In this respect, think of it as cable television without the need for a set-top-box.","chinese":"在這方面，可以把它看作不需要機頂盒的有線電視。"},{"english":"He met K'naan when they worked on a cable TV show together.","chinese":"在一次爲有線電視節目工作時，他認識了克南。"},{"english":"They also face the challenge of competing against more risque fare available on cable channels, such as HBO.","chinese":"他們也面臨與有線電視頻道上更多所帶來的挑戰。"},{"english":"These people are actually proud to cancel their cable TV service.","chinese":"這些人事實上已經以退掉有線電視服務爲傲。"},{"english":"Last week, the cable service technician arrived at our door.","chinese":"上週，有線電視的技術員來上門服務。"},{"english":"Cut back on your cable.","chinese":"削減你的有線電視電纜。"},{"english":"CATV is a short way saying \"community antenna television\".","chinese":"有線電視是一小段路說“社區天線電視”。"},{"english":"Some cable TV companies offer TV5 or other French stations.","chinese":"一些有線電視公司也播出TV5臺或其他法語臺。"},{"english":"The real wild card in this battle will be the efforts of the cable and telecom companies.","chinese":"這場戰役中的百搭牌將是有線電視和電信公司。"},{"english":"Offers easy access to selected Cable TV channels to support teaching, learning and other work-related activities.","chinese":"提供部份有線電視頻道，支援教學與其他相關活動。"},{"english":"CATV worked well, and soon new uses were found for it.","chinese":"有線電視合作得很好，很快就發現了新用途。"},{"english":"Will And I'm paying good money for cable.","chinese":"威爾我還花大筆錢裝有線電視哩。"},{"english":"The Worldwide Cable Set Top Box Market: Record-Setting Growth Contin…","chinese":"全球有線電視機頂盒市場研究報告。"}],"related":[]}