{"definition":["since birth\/for one's whole life"],"pinyin":["you3 sheng1 yi3 lai2"],"simplified":["有生以来"],"rank":33736.0,"normalized_rank":0.4720104095252753,"fraction":6.763143452513318e-7,"cumulative_fraction":0.993238566821364,"word":"有生以來","characters":[{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"},{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"}],"containing_words":[],"sentences":[{"english":"Eg. For the second time in her life she made an indirect answer.","chinese":"這是她有生以來第二次說話躲躲閃閃。"},{"english":"There was nothing to do but admit that I began menstruating or the very first time in my life.","chinese":"沒辦法，我只好告訴他有生以來我第一次來月經了。"},{"english":"She had hardly ever been in a state so nearly approaching high spirts in her life.","chinese":"她有生以來還很少這樣接近過欣喜如狂的程度。"},{"english":"I believe that was the first time in my life I was angered by economic injustice.","chinese":"我相信那是我有生以來首次被如此的經濟不公所激怒。"},{"english":"This is the first time in my life that I've experienced the masses voting on rewards for cadres.","chinese":"羣衆投票給幹部發獎，這是我有生以來經歷的第一次。"},{"english":"I’m free for the first time in my life.","chinese":"有生以來我第一次感到如此自由自在。"},{"english":"He said she was the best bluffer he'd ever seen .","chinese":"父親說母親是他有生以來見到的出牌高手。"},{"english":"Sara had spent most of her young life in the hospital unit at the training school.","chinese":"薩拉有生以來的大部份時間都在這所衛生院度過。"},{"english":"For the second time in her life she made an indirect answer.","chinese":"這是她有生以來第二次說話躲躲閃閃。"},{"english":"Then she writes, \"This is the best month of my life.","chinese":"她又寫道，“這是我有生以來最美好的一個月。"},{"english":"It was the 1st time in my life to be in Huhehaote.","chinese":"我是有生以來第一次來到呼市。"},{"english":"For the first time in my life, I felt whole.","chinese":"有生以來第一次，我感到了自己是一個整體。"},{"english":"It was in fact the first time in his life that he had looked at any woman.","chinese":"實際上，這是他有生以來頭一次盯着看女人。"}],"related":[]}