{"definition":["talking and laughing\/to jest\/cheerful and lively"],"pinyin":["you3 shuo1 you3 xiao4"],"simplified":["有说有笑"],"rank":22383.0,"normalized_rank":0.3131672099953829,"fraction":0.0000018923079770112271,"cumulative_fraction":0.9799043307098286,"word":"有說有笑","characters":[{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["laugh\/smile\/CL:個|个[ge4]"],"pinyin":["xiao4"],"word":"笑"}],"containing_words":[],"sentences":[{"english":"They were having a laugh and watching the Stoke v Blackburn game.","chinese":"他們有說有笑，一邊看着斯托克城和布萊克本的比賽。"},{"english":"Everyone talking and laughing, imperceptible already to jade screen peak.","chinese":"大家有說有笑，不知不覺已到了玉屏峯。"},{"english":"Then they rode on, talking and laughing as before.","chinese":"然後，他們騎着馬繼續前行，跟原來那樣有說有笑。"},{"english":"They're talking and laughing, but the festive mood is about to come to an end.","chinese":"他們有說有笑，但是，節日氣氛即將結束。"},{"english":"She was remarkably silent when the others all talked and laughed.","chinese":"別人有說有笑時她卻沉默不語，顯得很突出。"},{"english":"We chatted for about ten minutes, laughing and friendly.","chinese":"我們有說有笑地聊了大約十分鐘。"},{"english":"Mountaineering holidays, meal Walking, I with the students in small, Weishuiweixiao.","chinese":"假日爬山，飯後散步，我與學生三五成羣，有說有笑。"},{"english":"A group of children came out of the classroom, laughing and talking.","chinese":"一羣孩子有說有笑地從教室裏走出來。"},{"english":"The students came into the classroom laughing and talking.","chinese":"學生們有說有笑地走進教室。"},{"english":"Often of a morning Babbitt came bouncing and jesting in to breakfast.","chinese":"巴比特往常總是興沖沖地，有說有笑地下樓喫早飯。"},{"english":"In the morning we bicycled to the suburbs to plant trees talking and laughing all the way.","chinese":"在早上，我們騎自行車到郊區植樹，一路上有說有笑。"},{"english":"I looked back, they are laughing and talking to zongzi.","chinese":"我回頭一看，他們正在有說有笑地包糉子。"}],"related":[]}