{"definition":["tracked (tramcar)"],"pinyin":["you3 gui3"],"simplified":["有轨"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"有軌","characters":[{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["course\/path\/track\/rail"],"pinyin":["gui3"],"word":"軌"}],"containing_words":[{"definition":["streetcar\/tramcar\/tram"],"pinyin":["you3 gui3 dian4 che1"],"word":"有軌電車"}],"sentences":[{"english":"I ride, they call it Muni, but it's the bus system here.","chinese":"我乘坐這裏人所稱的有軌電車。"},{"english":"Trams, or electric streetcars, were first introduced in New Zealand in 1905.","chinese":"有軌電車又叫電車，於1905年被首次引進新西蘭。"},{"english":"What can you see from a tram or a double-decker?","chinese":"從有軌電車和雙層電車上你能看到什麼？"},{"english":"A similar situation also prevailed in its tram service.","chinese":"它的有軌電車系統也是相似的情況。"},{"english":"He caught the streetcar to his home in Bronx .","chinese":"他搭上了去布郎克斯他家的有軌電車。"},{"english":"The history of Hong Kong trams must be very old.","chinese":"這有軌電車的歷史不短吧。"},{"english":"Have you been on a tram yet?","chinese":"你坐過有軌電車了嗎？"},{"english":"The streetcar passed one stop after another.","chinese":"有軌電車開過一站又一站。"},{"english":"He took a northbound trolley on State Street.","chinese":"他在州街登上了一輛北行的有軌電車。"},{"english":"The trams clanged their way along the streets.","chinese":"有軌電車哐啷哐啷沿街駛過。"},{"english":"Trams automatic feeding dolly is widely used in industrial automation system.","chinese":"有軌自動供料小車在工業自動化系統中應用非常廣泛。"},{"english":"And she wants me to walk with her as far as the tram.","chinese":"她想讓我陪她走到有軌電車那兒。"},{"english":"Tramcars run through the streets of the city.","chinese":"有軌電車行駛於這座城市的大街上。"},{"english":"Coaches were numerous, pedestrians many, and in Fifty-ninth Street the street cars were crowded.","chinese":"到處都是馬車和行人，五十九街的有軌電車十分擁擠。"},{"english":"Sometimes a large tram would rattle swiftly past.","chinese":"時而會有喀拉作響的大型有軌街車輕快地開過。"},{"english":"Come on, walk with me a bit, till the tram.","chinese":"來吧，和我一起走一段，到有軌電車那兒。"}],"related":[]}