{"definition":["non-ferrous metals (all metals excluding iron, chromium, manganese and their alloys)"],"pinyin":["you3 se4 jin1 shu3"],"simplified":["有色金属"],"rank":7209.0,"normalized_rank":0.10086326305038266,"fraction":0.00001404275574886415,"cumulative_fraction":0.899528866741641,"word":"有色金屬","characters":[{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["color\/CL:種|种[zhong3]\/look\/appearance\/sex","color\/dice"],"pinyin":["se4","shai3"],"word":"色"},{"definition":["gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)"],"pinyin":["Jin1","jin1"],"word":"金"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"}],"containing_words":[],"sentences":[{"english":"Single-prong solid brass square buckle in gleaming silver-colored metal.","chinese":"單管齊下閃閃發光的銀色實心黃銅方扣，有色金屬。"},{"english":"Nonferrous Metal Foundries Industry in the U. S.","chinese":"美國有色金屬鑄造業。"},{"english":"The lead is a common non-ferrous metal element in the gold concentrate.","chinese":"鉛是金精礦中常見的有色金屬元素。"},{"english":"Diamond is the best material of cutting-tools to cut nonferrous metals.","chinese":"金剛石是切削有色金屬的優選刀具材料。"},{"english":"Laos boasts nonferrous mineral resources, but is weak in development technology.","chinese":"老撾有色金屬礦源豐富，但開發技術等方面力量薄弱。"},{"english":"Baiyin Is China's largest and most varieties of non-ferrous metal industrial base.","chinese":"白銀是我國目前規模最大的多品種有色金屬工業基地。"},{"english":"Major types, characteristics and metallogeneses of gold deposits in southwest Tianshan Mountains, Xinjiang;","chinese":"西南天山是我國重要金和有色金屬礦產遠景區。"},{"english":"Welding of Carbon-Steel, Stainless-Steel and Nonferrous-Metal tube.","chinese":"普碳鋼，不鏽鋼，有色金屬管焊接。"},{"english":"Uses: cold welding of nonferrous metals such as Cu Al Ag Ni Pt Sn Zn Ta and some of their alloys.","chinese":"鉭鈮等有色金屬線材及他們部分合金線材的焊接。"},{"english":"It can be applied to determine the Brinell hardness for ferrous metal and non-ferrous metal.","chinese":"適用於黑色金屬，有色金屬的布氏硬度測定。"},{"english":"Objective To study dynamic change of pneumoconiosis cases in a nonferrous metal company over 50 years.","chinese":"探討某有色金屬公司50年來塵肺病發病的動態變化。"},{"english":"Aluminium files are primarily for filing aluminium, aluminium alloy and may be used on other non-ferrous metals.","chinese":"主要是爲了銼削鋁材，鋁合金，及其他非有色金屬上。"},{"english":"Many of these compounds are coloured and paramagnetic (see paramagnetism) and (as do the metals themselves) often act as catalysts.","chinese":"其中許多是有色金屬和順磁體，往往可用作催化劑。"},{"english":"Situation of non-ferrous metal mines is very severe.","chinese":"中國有色金屬礦山資源形勢嚴峻。"},{"english":"The Metallogenic Environments and Metallogenic Mechanism of Gold Deposits in Southwestern Tianshan Mountains;","chinese":"西南天山是我國重要金和有色金屬礦產遠景區。"},{"english":"Planning, pointed out that the non-ferrous metals industrial restructuring and revitalization of the seven major tasks.","chinese":"規劃指出了有色金屬產業調整和振興的七項主要任務。"}],"related":[]}