{"definition":["to concede\/to admit defeat\/to admit sth is wrong after insisting it is right"],"pinyin":["fu2 shu1"],"simplified":["服输"],"rank":21033.0,"normalized_rank":0.2942789584878206,"fraction":0.000002148060779273332,"cumulative_fraction":0.97718154564919,"word":"服輸","characters":[{"definition":["classifier for medicine: dose\/Taiwan pr. [fu2]","clothes\/dress\/garment\/to serve (in the military, a prison sentence etc)\/to obey\/to be convinced (by an argument)\/to convince\/to admire\/to acclimatize\/to take (medicine)\/mourning clothes\/to wear mourning clothes"],"pinyin":["fu2","fu4"],"word":"服"},{"definition":["to lose\/to transport\/to donate\/to enter (a password)"],"pinyin":["shu1"],"word":"輸"}],"containing_words":[{"definition":["lit. if you agree to bet you must accept to lose\/fig. you bet, you pay"],"pinyin":["yuan4 du3 fu2 shu1"],"word":"願賭服輸"}],"sentences":[{"english":"You always scolded by their parents but never cry out in defeat.","chinese":"你總容易被父母罵哭卻從未在外面服輸。"},{"english":"Fu strong woman will admit defeat, but will not admit defeat.","chinese":"乀堅強的女人會認輸，但不會服輸。"},{"english":"So he always optimistically, life, failed not discouraged, don't lose.","chinese":"所以他總是樂觀地面對生活，失敗了不氣餒，不服輸。"},{"english":"A true soldier does not admit defeat before the battle.","chinese":"真正的戰士是不會在戰前服輸的。"},{"english":"Because they all have admitted defeat and challenge themselves psychological.","chinese":"因爲他們都有不服輸，挑戰自我的心理。"},{"english":"But, I am not going to give up.","chinese":"但是，我就是不服輸。"},{"english":"But an emulative idea lets Liu manager decide to insist to come down.","chinese":"但一股不服輸的意念讓劉經理決定堅持下來。"},{"english":"I refused to say uncle no matter how they threatened me.","chinese":"無論他們怎樣嚇唬我，我都不肯服輸。"},{"english":"She seek to prevail over others, unyielding spirit lets me admire.","chinese":"她爭強好勝，不服輸的精神讓我佩服。"},{"english":"Can let black burning concede vanquish, Zhang Fei's real strenght naturally as anticipated assorted general.","chinese":"能夠讓黑炎服輸，張斐的實力果然不同一般。"},{"english":"If you admit defeat, frustration will take the initiative to your head.","chinese":"如果你不服輸，挫折就會主動向你低頭。"}],"related":[]}