{"definition":["entrance portal (to a palace)\/propylaeum"],"pinyin":["chao2 men2"],"simplified":["朝门"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"朝門","characters":[{"definition":["abbr. for 朝鮮|朝鲜[Chao2 xian3] Korea","imperial or royal court\/government\/dynasty\/reign of a sovereign or emperor\/court or assembly held by a sovereign or emperor\/to make a pilgrimage to\/facing\/towards","morning"],"pinyin":["Chao2","chao2","zhao1"],"word":"朝"},{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["Men2","men2"],"word":"門"}],"containing_words":[],"sentences":[{"english":"Soldiers in camouflage banged on the door, then shot at it, he said.","chinese":"他說，穿着迷彩服的士兵大聲捶門，然後朝門開槍。"},{"english":"And when the virgins were gathered together the second time, then Mordecai sat in the king's gate.","chinese":"第二次招聚處女的時候，末底改坐在朝門。"},{"english":"And all the king's servants, that were in the king's gate, bowed, and reverenced Haman: for the king had so commanded concerning him.","chinese":"在朝門的一切臣僕都跪拜哈曼，因爲王如此吩咐。"},{"english":"Then the king's servants, which were in the king's gate, said unto Mordecai, Why transgressest thou the king's commandment?","chinese":"在朝門的臣僕問末底改說，你爲何違背王的命令呢。"},{"english":"The guards, he remembered, and made a move toward the door.","chinese":"衛兵，他想起來了，於是朝門走了一步。"},{"english":"Julia rushed out of the hut, and scurried to the gates.","chinese":"茱莉亞跑出的小屋，朝門跑了出去。"},{"english":"Then he got up and walked towards the door.","chinese":"然後他站了起來，並且朝門的方向走去。"},{"english":"Everyone ran towards the door.","chinese":"所有的人都朝門跑了過去。"},{"english":"Honey twisted her head sideways and looked towards the door.","chinese":"蜜蜂把頭轉向側面，朝門望去。"},{"english":"I found my purse and headed for the door.","chinese":"我找到我的手包，朝門走去。"},{"english":"At that point, his wife rose, and stepped to the door.","chinese":"在那個時候，他的妻子站起來，朝門走去。"},{"english":"He made for the door instantly he heard the knock.","chinese":"他一聽到敲門聲，就朝門走去。"}],"related":[]}