{"definition":["North and South Korea"],"pinyin":["Chao2 Han2"],"simplified":["朝韩"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"朝韓","characters":[{"definition":["abbr. for 朝鮮|朝鲜[Chao2 xian3] Korea","imperial or royal court\/government\/dynasty\/reign of a sovereign or emperor\/court or assembly held by a sovereign or emperor\/to make a pilgrimage to\/facing\/towards","morning"],"pinyin":["Chao2","chao2","zhao1"],"word":"朝"},{"definition":["Han, one of the Seven Hero States of the Warring States 戰國七雄|战国七雄\/Korea from the fall of the Joseon dynasty in 1897\/Korea, esp. South Korea 大韓民國|大韩民国\/surname Han"],"pinyin":["Han2"],"word":"韓"}],"containing_words":[],"sentences":[{"english":"S. Korea starts massive drills near border.","chinese":"韓國將在朝韓邊境舉行最大規模軍演。"},{"english":"First, do you have any comment on the Kaesong meeting between the DPRK and the ROK?","chinese":"第一，你對朝韓開城會晤有何評論？"},{"english":"We always endorse cooperation between the DPRK and the ROK.","chinese":"關於朝韓加強合作，我們始終持積極支持態度。"},{"english":"While China would have to support Korean unification, the US wouldn't.","chinese":"中國支持朝韓統一時，美國不會。"},{"english":"Last Sept. 30, the two Koreas hold military talks in Panmunjom.","chinese":"去年9月30日，朝韓雙方曾在板門店舉行軍事會談。"},{"english":"Community of face Han economy \" it is child of assuasive of relation of Korea peninsula north and south.\"","chinese":"“朝韓經濟共同體”是朝鮮半島南北關係緩和的產物。"},{"english":"The United States has helped to mend the rift between North and South Korea since 1953.","chinese":"美國自1953年起幫助朝韓修補裂痕。"},{"english":"South Korean tourist groups no longer travel across the heavily armed inter-Korean border.","chinese":"韓國旅行團此後不曾越過重兵駐守的朝韓邊境。"},{"english":"In addition, inter-Korean relations and succession issues are not involved.","chinese":"此外朝韓關係及接班人問題等也沒有涉及。"},{"english":"I have two questions. First, do you have any comment on the Kaesong meeting between the DPRK and the ROK?","chinese":"我有兩個問題。第一，你對朝韓開城會晤有何評論？"},{"english":"Mr. Ban has also been actively involved in issues relating to inter-Korean relations.","chinese":"潘基文先生還積極參與處理朝韓關係問題。"}],"related":[]}