{"definition":["not ever\/not necessarily"],"pinyin":["wei4 chang2"],"simplified":["未尝"],"rank":20597.0,"normalized_rank":0.2881787528157486,"fraction":0.0000022476175207931696,"cumulative_fraction":0.9762237665863908,"word":"未嘗","characters":[{"definition":["not yet\/did not\/have not\/not\/8th earthly branch: 1-3 p.m., 6th solar month (7th July-6th August), year of the Sheep\/ancient Chinese compass point: 210°"],"pinyin":["wei4"],"word":"未"},{"definition":["to taste\/to try\/to experience\/already\/ever\/once"],"pinyin":["chang2"],"word":"嘗"}],"containing_words":[],"sentences":[{"english":"It would not be wrong to say that it is a kind of traditional art of behavior.","chinese":"把它看做一種傳統的“行爲藝術”，也未嘗不可。"},{"english":"Summer vacation was not fruitful, but also have a white cross.","chinese":"暑假過得不敢說收穫頗豐，倒也未嘗白過。"},{"english":"It is still fair to think of the solar system as a kind of gigantic clock.","chinese":"把太陽系當成一隻巨大的鐘，也未嘗不可。"},{"english":"Everything ready so I can tell you I didn't even notice you were gone.","chinese":"事事俱備，我可以說，未嘗留意你已經離開。"},{"english":"Man City have won none of their last five Premier league away games, losing three of these games.","chinese":"曼城近五個客場未嘗勝績，其中輸了3場。"},{"english":"But the true mingled with the false mahjong, this time to do five door is also acceptable.","chinese":"但麻將虛虛實實，這個時候堅持做五門也未嘗不可。"},{"english":"Preemptive strikes are okay when you know for sure what you're preempting.","chinese":"當你確信你所佔的先機，先發制人未嘗不可。"},{"english":"If the men of my tabernacle said not, Oh that we had of his flesh! we cannot be satisfied.","chinese":"若我帳棚的人未嘗說，誰不以主人的食物喫飽呢。"},{"english":"Although the content of \"eight part essay\" is timeworn, the form and layout can be used for reference.","chinese":"內容陳舊的八股文，其佈局形式未嘗不可借鑑。"},{"english":"Course, buying a good book to guide you through this doesn't hurt ;","chinese":"不過，你買一本好書來越過這個坎，也未嘗不可。"},{"english":"We dare to break a path unbeaten before.","chinese":"我們敢於走前人未嘗走過的新路。"},{"english":"And another dieth in the bitterness of his soul, and never eateth with pleasure.","chinese":"有人至死心中痛苦，終身未嘗福樂的滋味。"},{"english":"You might want to consider draining excess water off at this point.","chinese":"這時你可能會想把多餘的水分排出來，這也未嘗不可。"},{"english":"We may [might] just as well have a try.","chinese":"試一下未嘗不可。"},{"english":"Liverpool have drawn three and won none of the last four Premier League games against Man City.","chinese":"利物浦在近四次與曼城的交鋒中三平一負，未嘗勝績。"}],"related":[]}