{"definition":["not having undergone\/without (having gone though a certain process)"],"pinyin":["wei4 jing1"],"simplified":["未经"],"rank":4076.0,"normalized_rank":0.05702852825542513,"fraction":0.000032443819525318146,"cumulative_fraction":0.833140053189252,"word":"未經","characters":[{"definition":["not yet\/did not\/have not\/not\/8th earthly branch: 1-3 p.m., 6th solar month (7th July-6th August), year of the Sheep\/ancient Chinese compass point: 210°"],"pinyin":["wei4"],"word":"未"},{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["Jing1","jing1"],"word":"經"}],"containing_words":[{"definition":["unconfirmed"],"pinyin":["wei4 jing1 zheng4 shi2"],"word":"未經證實"}],"sentences":[{"english":"Unsolicited advice is perceived as annoying. Don’t do it.","chinese":"未經請求的建議也會令人討厭，所以不要那麼做。"},{"english":"Article 66 The trustee of a public trust must not resign without the approval of the regulatory agency of public undertakings.","chinese":"信託的受託人未經公益事業管理機構批准，不得辭任。"},{"english":"No unit or individual may have cultural relics transferred without approval.","chinese":"未經批准，任何單位或者個人不得調取文物。"},{"english":"Google this year began to automatically transfer Chinese users to an uncensored website in Hong Kong.","chinese":"今年開始將中國用戶自動跳轉到未經審查的香港網站。"},{"english":"You cannot be transferred to another employer or employment without the approval of the CLA.","chinese":"您未經勞委會許可不得轉換僱主及工作。"},{"english":"How dare you borrow it without my permission?","chinese":"你怎麼敢未經我允許把它借走呢？"},{"english":"There are unconfirmed reports that the two people have been shot in the neighboring town.","chinese":"未經證實的報道說在附近城鎮有兩個人遭到槍殺。"},{"english":"How dare you enter this building without permition .","chinese":"未經允許你怎麼敢進入這幢大樓呢？"},{"english":"It's not moral to read the personal letter without permission.","chinese":"未經允許拆閱個人信件不道德。"},{"english":"This unsolicited commercial e-mail message is sent to your domain.","chinese":"此未經請求的商業電子郵件消息被髮送到您的域。"},{"english":"Replace the mechanical devices and settings without the written approval of LCF.","chinese":"未經本公司書面批准，更改機械上裝置與設定。"},{"english":"No person shall override safety interlocks without proper authorization.","chinese":"任何人不得未經授權旁路安全聯鎖。"},{"english":"Many untreated wounds are becoming infected, leading to amputations.","chinese":"許多未經治療的傷員正遭受感染，會導致截肢。"},{"english":"Alterations to the terms of an insurance shall not be made without the approval of the Project Manager.","chinese":"未經建築師許可，不能擅自變更保險條款。"},{"english":"Characterized by an authoritative, arrogant assertion of unproved or unprovable principles.","chinese":"在爭論中作爲前提提出的未經證明的陳述。"},{"english":"Uncertified alterations or erasures shall invalidate the certificates.","chinese":"證書未經證明而塗改應屬無效。"}],"related":[]}