{"definition":["inessentials\/minor detail"],"pinyin":["mo4 jie2"],"simplified":["末节"],"rank":30188.0,"normalized_rank":0.42236928630391896,"fraction":9.268119529464071e-7,"cumulative_fraction":0.9904175335626504,"word":"末節","characters":[{"definition":["tip\/end\/final stage\/latter part\/inessential detail\/powder\/dust\/opera role of old man"],"pinyin":["mo4"],"word":"末"},{"definition":["festival\/holiday\/node\/joint\/section\/segment\/part\/to economize\/to save\/to abridge\/moral integrity\/classifier for segments, e.g. lessons, train wagons, biblical verses\/CL:個|个[ge4]","see 節骨眼|节骨眼[jie1 gu5 yan3]"],"pinyin":["jie1","jie2"],"word":"節"}],"containing_words":[{"definition":["minor details\/trifles"],"pinyin":["xi4 zhi1 mo4 jie2"],"word":"細枝末節"},{"definition":["tiny insignificant details\/niceties"],"pinyin":["xi4 wei1 mo4 jie2"],"word":"細微末節"}],"sentences":[{"english":"We describe a case of a traumatic avulsion fracture of the distal phalanx of the hallux.","chinese":"我們描述了一對拇末節撕脫骨折創傷的情況。"},{"english":"For the first half of the year, complete long-term projects and tie up loose ends.","chinese":"在今年的上半年，完成長期的計劃並處理好細枝末節。"},{"english":"The president doesn't need to involve herself with this kind of minutia.","chinese":"總統不需要管這種細枝末節的事。"},{"english":"The trimmings are soon forgotten in a hand-to-hand encounter for life or death.","chinese":"在徒手生死格鬥中，細枝末節很快就會被忘掉。"},{"english":"Tabloid gossip derives its entertainment value from subtle suggestions.","chinese":"八卦小報費盡心思，企圖從細枝末節中發現文娛價值。"},{"english":"The bill covers all of these topics, but also countless sideshows and boondoggles.","chinese":"該法案涵蓋了所有的這些問題，但也有太多細枝末節。"},{"english":"But that was widely shrugged off as a minor detail.","chinese":"但是這普遍被認爲是一個無需在意的細枝末節。"},{"english":"Men who love wisdom should acquaint themselves with a great many particulars.","chinese":"喜愛智能的人應該讓自己熟悉很多細微末節的小事。"},{"english":"You can go back and search for details of an exchange you had months ago.","chinese":"你可以回顧幾個月前的聊天記錄，具體到細枝末節。"},{"english":"Objective To report the operative technique and clinical results of distal phalanx replantation.","chinese":"目的報道末節斷指再植的手術方法及臨牀效果。"},{"english":"Men who love wisdom should acquaint themselves with a great many particulars .","chinese":"喜愛智慧的人應該讓自己熟悉很多細微末節的小事。"},{"english":"Mr Le Pen has again called the Nazi gas chambers \"a detail of history\".","chinese":"勒龐再次稱納粹毒氣室是“細枝末節”。"},{"english":"the other 80% are just excess trivialities that can be ignored.","chinese":"其他80%都是可以忽略的細枝末節。"},{"english":"Objective To review the clinical result of replantation of specially amputated fingertip.","chinese":"目的回顧性分析特殊手指末節及指尖再植的臨牀效果。"},{"english":"Your salvation lies in a moment-by-moment recounting of the minutiae.","chinese":"你的救星就是時時刻刻描述那些細枝末節。"}],"related":[]}