{"definition":["tip\/extremity"],"pinyin":["mo4 duan1"],"simplified":["末端"],"rank":19554.0,"normalized_rank":0.2735858296139801,"fraction":0.0000025038082559358605,"cumulative_fraction":0.9737453368328408,"word":"末端","characters":[{"definition":["tip\/end\/final stage\/latter part\/inessential detail\/powder\/dust\/opera role of old man"],"pinyin":["mo4"],"word":"末"},{"definition":["end\/extremity\/item\/port\/to hold sth level with both hands\/to carry\/regular"],"pinyin":["duan1"],"word":"端"}],"containing_words":[],"sentences":[{"english":"What could have caused the glacier snouts to have stopped retreating?","chinese":"是什麼引起了冰川末端停止縮退呢？"},{"english":"Using in situ end labelling, the authors demonstrated for the first time that this change belonged to apoptosis.","chinese":"經原位末端標記，首次證明本病的這種病變屬於凋亡。"},{"english":"They are usually round with short wing covers (elytra) that expose the end of the abdomen.","chinese":"蟲體一般呈圓形，鞘翅短，腹部末端露出。"},{"english":"The blunt ending of the cord is due to hypoplasia of the distal spinal cord.","chinese":"脊髓末端圓鈍是由於末梢脊髓發育不良。"},{"english":"The ends of each fibre rope were tied casually to a chain on the carrier rear-fence.","chinese":"每條纖維繩的末端均隨意地繫於車斗尾板一條鏈子上。"},{"english":"In printing, to separate continuous-form paper into discrete sheets using a burster.","chinese":"末端連在一起以使形成不間斷的整體。"},{"english":"The puff of white hair at the end of Swyft's chin quivered in outrage.","chinese":"斯威夫特下巴末端的鬍鬚因爲憤怒抖動着。"},{"english":"Church doors have been opened and you do not see the end of the Rose Trail.","chinese":"教堂門已開而你卻不在一種植物的花步道看不到末端。"},{"english":"Telomerase is an enzyme that can rebuild and lengthen telomeres.","chinese":"端粒末端轉移酶是一種可以重建並且延展端粒的酶。"},{"english":"Eurasian herb with white or pinkish flowers in a terminal corymb.","chinese":"歐亞草本植物，傘房花序末端開白色或淡紫色花。"},{"english":"The standardized ileal digestibility of amino acids in domestic double-low rapeseed meal was lower.","chinese":"國產雙低菜籽粕的氨基酸標準迴腸末端消化率較低。"},{"english":"The religiously inclined politicians obviously think it the end of humanity.","chinese":"宗教傾向的政客們顯然會認爲這是人性的末端。"},{"english":"Then it curls its trunk under, sticks the tip of its trunk into its mouth, and blows.","chinese":"然後象鼻向下捲曲，鼻子的末端插入嘴裏，吹氣。"},{"english":"Chapter 5 presents a novel approach to implement the sample rate variable pre-equalizer in the modulator.","chinese":"第四章分析了調製器末端用於採樣轉換的內插器。"},{"english":"Using a trim stick or equivalent, open the end covers to access the screws.","chinese":"用一根清潔杆或同等物，打開末端蓋去檢查螺絲。"},{"english":"Lips well developed but not pendulous giving a clean finish.","chinese":"嘴脣發達但不下垂，末端乾淨利落。"}],"related":[{"definition":["middle section\/middle period\/middle area\/mid-"],"pinyin":["zhong1 duan4"],"word":"中段"},{"definition":["bottom\/bottom side\/end part"],"pinyin":["di3 duan1"],"word":"底端"},{"definition":["front\/front end\/forward part of sth"],"pinyin":["qian2 duan1"],"word":"前端"},{"definition":["both ends (of a stick etc)\/two extremes"],"pinyin":["liang3 duan1"],"word":"兩端"},{"definition":["annular\/toroidal\/loop-shaped\/ring-like"],"pinyin":["huan2 zhuang4"],"word":"環狀"},{"definition":["summit\/peak"],"pinyin":["ding3 duan1"],"word":"頂端"},{"definition":["backend (computing)"],"pinyin":["hou4 duan1"],"word":"後端"},{"definition":["down\/downward"],"pinyin":["xiang4 xia4"],"word":"向下"},{"definition":["outer side"],"pinyin":["wai4 ce4"],"word":"外側"},{"definition":["thick\/bulky\/loud"],"pinyin":["cu1 da4"],"word":"粗大"},{"definition":["far end\/remote end\/remote\/distant"],"pinyin":["yuan3 duan1"],"word":"遠端"},{"definition":["to bend\/to curve around\/curved\/crooked\/to wind\/to warp"],"pinyin":["wan1 qu1"],"word":"彎曲"},{"definition":["sharp pointed end\/the tip\/the cusp\/tip-top\/most advanced and sophisticated\/highest peak\/the best"],"pinyin":["jian1 duan1"],"word":"尖端"},{"definition":["horizontal\/orthogonal\/perpendicular\/lateral\/crosswise"],"pinyin":["heng2 xiang4"],"word":"橫向"},{"definition":["to extend\/to spread"],"pinyin":["yan2 shen1"],"word":"延伸"},{"definition":["short\/brief\/to lack\/weak point\/fault"],"pinyin":["duan3"],"word":"短"}]}