{"definition":["this newspaper"],"pinyin":["ben3 bao4"],"simplified":["本报"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"本報","characters":[{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"},{"definition":["to announce\/to inform\/report\/newspaper\/recompense\/revenge\/CL:份[fen4],張|张[zhang1]"],"pinyin":["bao4"],"word":"報"}],"containing_words":[],"sentences":[{"english":"He got all the big scoops for the paper.","chinese":"他爲本報弄到所有的頭號獨家新聞。"},{"english":"This newspaper had renamed as Galaxy News.","chinese":"本報已正式改名爲星河新報。"},{"english":"Analyst from the second largest international assessing agency Moody said.","chinese":"國際第二大評級機構穆迪的分析師對本報記者表示。"},{"english":"The writer is an executive reporter of Lianhe Zaobao.","chinese":"作者是本報執行級記者。"},{"english":"Our reporter interviewed the Beijing university of posts and telecommunications and telecom engineering college professor Chen lei.","chinese":"本報記者採訪了北京郵電大學電信工程學院教授陳磊。"},{"english":"Our newspaper has an old-timey correspondent in New York.","chinese":"本報在紐約駐有一位資深通訊記者。"},{"english":"Recently, Wu, chairman of the hotel, the more-accepted an exclusive interview with our reporter.","chinese":"近日，該酒店董事長吳愈勇接受了本報記者的專訪。"},{"english":"This newspaper offers an unfashionably optimistic answer.","chinese":"本報給出了一個並不普遍的樂觀答案。"},{"english":"The writer was a former Lianhe Zaobaojournalist.","chinese":"作者是本報前高級記者。"},{"english":"This offer is subject to goods being unsold on receipt of your reply.","chinese":"本報盤以你方復到時，貨物未售出爲有效。"},{"english":"The offer is subject to change without notice.","chinese":"本報盤以隨時更改而勿需另作通知爲條件。"},{"english":"This reporter visited several random practice of \" one- room price .\"","chinese":"本報記者隨機走訪了幾個實行“多房一價”的項目。"},{"english":"Your correspondent spent a night with Masoud's former bodyguards in the Panjshir.","chinese":"本報記者在潘傑希爾跟馬蘇德過去的保鏢度過了一夜。"},{"english":"Reporters are trained to get the scoop on news items ahead of the competition.","chinese":"他爲本報弄到所有的頭號獨家新聞。"},{"english":"The safety control system in the building indicators can not break.","chinese":"本報訊今年建設系統安全生產的控制指標不能突破。"},{"english":"Researcher Qingguo Geng said this to a journalist from our newspaper.","chinese":"耿慶國研究員在電話裏對本報記者說。"}],"related":[]}