{"definition":["a member of the same clan\/a distant relative with the same family name"],"pinyin":["ben3 jia1"],"simplified":["本家"],"rank":38425.0,"normalized_rank":0.537615603094875,"fraction":4.4537773955575503e-7,"cumulative_fraction":0.9958362769375094,"word":"本家","characters":[{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[{"definition":["capitalist"],"pinyin":["zi1 ben3 jia1"],"word":"資本家"}],"sentences":[{"english":"Union was a tool used by the capitalists in their vain attempt to damp down the labour movement.","chinese":"那個黃色工會是資本家妄圖用來撲滅工人運動的工具。"},{"english":"I don't want anyone with factories or prostitutes or concubines.","chinese":"我不找資本家，也不要逛窯子或有小老婆的人。"},{"english":"Many students now anathematise \"Bologna\" as a capitalist plot.","chinese":"如今許多學生咒罵“博洛尼亞”是資本家的陰謀。"},{"english":"Arnie has just presented his business plan to Sabine, a venture capitalist.","chinese":"艾爾尼剛把他的商業計劃書交給風險資本家薩比娜。"},{"english":"\"I consider myself a capitalist, \" he said.","chinese":"“我把自己定位成資本家，”他說。"},{"english":"Capitalists use laborers' surplus value to make a fortune.","chinese":"資本家利用勞工的剩餘價值發家致富。"},{"english":"Aaron shall bring the bull for his own sin offering to make atonement for himself and his household, and he is to slaughter the bull for his own sin offering.","chinese":"亞倫要把贖罪祭的公牛牽來宰了，爲自己和本家贖罪。"},{"english":"That is the money capitalists, a couple of students recipients closure report letter.","chinese":"即資本家出點錢，受助學生出幾封報告信。"},{"english":"Following the seizure of capital goods, young Chiang turned to arrest the capitalists themselves.","chinese":"搶走了人家的資產以後，小蔣又進而逮捕資本家本人。"},{"english":"Venture capitalists are right to warn entrepreneurs of getting caught with their pants singed.","chinese":"風投資本家警告創業者勿“引火燒身”，這是對的。"},{"english":"So join us at the Qwest for our annual Woodstock for Capitalists.","chinese":"中心參與資本家的伍斯達克年度音樂會。"},{"english":"My maternal grandfather is a capitalist, who is a famous \"furrier\" in the Tianjin bazaar.","chinese":"外祖父是資本家，是天津勸業場有名的“皮貨商”。"},{"english":"Another section lurking in the anti-Japanese camp would also like to cross over.","chinese":"再一部分資本家，躲在抗日陣線內的，也想跑去。"},{"english":"But all venture capitalists should have to disclose their personal failure rates.","chinese":"但是所有的風險資本家必須坦白他們的失敗率。"},{"english":"The international capitalists dictate and the nation’s sovereignty becomes a sham.","chinese":"這樣國際資本家擁有支配權，而國家主權淪爲傀儡。"},{"english":"As is known to the world, capitalists are tireless in hunting for super profit.","chinese":"衆所周知，資本家對超額利潤的追求總是不知疲乏的。"}],"related":[{"definition":["(orig.) tents forming the offices of a commanding officer\/administration of a military government\/(medieval Japan) \"bakufu\", administration of the shogun"],"pinyin":["mu4 fu3"],"word":"幕府"},{"definition":["Your Highness\/Your Majesty"],"pinyin":["zhu3 gong1"],"word":"主公"},{"definition":["counselor of king or feudal warlord\/henchman"],"pinyin":["jia1 chen2"],"word":"家臣"},{"definition":["Tokugawa, the ruling clan of Japan from 1550-1850"],"pinyin":["De2 chuan1"],"word":"德川"},{"definition":["princely"],"pinyin":["wang2 jia1"],"word":"王家"},{"definition":["fence\/hedge\/screen\/barrier\/vassal state\/Taiwan pr. [fan2]"],"pinyin":["fan1"],"word":"藩"},{"definition":["wife's parents' home"],"pinyin":["yue4 jia1"],"word":"岳家"},{"definition":["ODA Nobunaga (1534-1582), Japanese shogun (warlord), played an important role in unifying Japan"],"pinyin":["Zhi1 tian2 Xin4 chang2"],"word":"織田信長"},{"definition":["father's younger brother\/uncle"],"pinyin":["shu1 fu4"],"word":"叔父"},{"definition":["head of a household"],"pinyin":["jia1 zhu3"],"word":"家主"},{"definition":["to inform\/to notify"],"pinyin":["guan1 bai2"],"word":"關白"},{"definition":["learned person\/expert in a certain field\/abbr. for 大方之家[da4 fang1 zhi1 jia1]"],"pinyin":["fang1 jia1"],"word":"方家"},{"definition":["Northeast China\/Manchuria\/lit. east of Shanhai Pass 山海關|山海关[Shan1 hai3 guan1]\/Kantō region of Japan"],"pinyin":["Guan1 dong1"],"word":"關東"},{"definition":["relatives\/members of the same family, clan, tribe etc"],"pinyin":["qin1 zu2"],"word":"親族"},{"definition":["elder brother\/term of respect for a man of about the same age"],"pinyin":["xiong1 zhang3"],"word":"兄長"},{"definition":["father-in-law (wife's father)"],"pinyin":["yue4 zhang4"],"word":"岳丈"}]}