{"definition":["Honshū, the main island of Japan"],"pinyin":["Ben3 zhou1"],"simplified":["本州"],"rank":43327.0,"normalized_rank":0.6062009430134456,"fraction":2.8115290933608136e-7,"cumulative_fraction":0.9975861783383456,"word":"本州","characters":[{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"},{"definition":["prefecture\/(old) province\/(old) administrative division\/state (e.g. of US)\/oblast (Russia)\/canton (Switzerland)"],"pinyin":["zhou1"],"word":"州"}],"containing_words":[],"sentences":[{"english":"Here too, public universities charge more for out-of-state tuition.","chinese":"同樣，公立大學收取非本州學生更多學費。"},{"english":"A city of west-central Honshu, Japan, north-northeast of Osaka.","chinese":"日本本州中西部一城市，位於大阪東北偏北。"},{"english":"Once the thief’s car passed across the state border, our state police had no jurisdiction to follow him.","chinese":"一旦竊賊的車越過州界，本州的警察便無權跟蹤他。"},{"english":"The state’s constitution demands that the state “cherish” its public schools.","chinese":"州法規要求本州要“愛護”公立學校。"},{"english":"To this caravanserai came the best of the political and social patronage of the State.","chinese":"這個大旅館，是本州政治和社會的第一流人物所住的。"},{"english":"SONGDA finally turned into an extratropical cyclone as it reached the southern coast of Honshu, Japan.","chinese":"桑達最後在到達日本本州南部時演變爲溫帶氣旋。"},{"english":"Monday, he called this a tragic time for the state.","chinese":"週一，他稱這次是本州的危難時刻。"},{"english":"Meanwhile, a wall of water surged from the fault zone toward the coast of Honshu.","chinese":"同時，一面水牆奔騰着從斷層帶向本州島沿岸湧去。"},{"english":"Before the original let wells immediately go to help escort Beijing and take over the state.","chinese":"前原讓井上幫忙押送馬上花和餘本州一起去新京。"},{"english":"Other prefectures in the northern part of Japan's main Honshu island could face similar tolls.","chinese":"日本本州島北部的其他縣亦可能是相同的情況。"},{"english":"Tokyo time and hit off Honshu, Japan’s most populous island.","chinese":"而本州是日本人口最稠密的島嶼。"},{"english":"In 33 states, voters also will be choosing U.S. senators.","chinese":"有33個州的選民還將選舉本州的聯邦參議員。"},{"english":"The suspect jumped bail and left the state.","chinese":"嫌疑犯在交保後逃出了本州。"},{"english":"Just like Nagoya and Tokyo Kanazawa is located on Honshu, Japan's main island.","chinese":"就像名古屋和東京一樣，金澤坐落於本州島。"},{"english":"The state is named after King Charles II of England, as Carolus is Latin for Charles.","chinese":"本州的名稱來自於英國國王查理一世。"},{"english":"States also have freedom of information (FOI) laws for their documents. (See “Freedom of Information Is Bedrock of Free and Open Societies.”)","chinese":"各州也針對本州的有關文件制定了信息自由的法律。"}],"related":[{"definition":["Kansai region, Japan\/Guanxi or Kuanhsi town in Hsinchu County 新竹縣|新竹县[Xin1 zhu2 Xian4], northwest Taiwan"],"pinyin":["Guan1 xi1"],"word":"關西"},{"definition":["prefecture\/(old) province\/(old) administrative division\/state (e.g. of US)\/oblast (Russia)\/canton (Switzerland)"],"pinyin":["zhou1"],"word":"州"},{"definition":["Ōita prefecture, Japan"],"pinyin":["Da4 fen1 xian4"],"word":"大分縣"},{"definition":["Qingzhou, ancient northern province\/Gyeongju City, South Korea"],"pinyin":["Qing4 zhou1"],"word":"慶州"},{"definition":["Northeast China\/Manchuria\/lit. east of Shanhai Pass 山海關|山海关[Shan1 hai3 guan1]\/Kantō region of Japan"],"pinyin":["Guan1 dong1"],"word":"關東"},{"definition":["Ryūkyū\/refers to the Ryūkyū Islands 琉球群島|琉球群岛[Liu2 qiu2 Qun2 dao3] stretching from Japan to Taiwan\/Liuchiu township in Pingtung County 屏東縣|屏东县[Ping2 dong1 Xian4], Taiwan"],"pinyin":["Liu2 qiu2"],"word":"琉球"},{"definition":["Kyōto prefecture in central Japan"],"pinyin":["Jing1 du1 fu3"],"word":"京都府"},{"definition":["Iwate prefecture in the north of Japan's main island Honshū 本州[Ben3 zhou1]"],"pinyin":["Yan2 shou3 xian4"],"word":"岩手縣"},{"definition":["Cheongju, capital of North Chungcheong Province, South Korea 忠清北道[Zhong1 qing1 bei3 dao4]"],"pinyin":["Qing1 zhou1"],"word":"清州"},{"definition":["Tsushima Island, between Japan and South Korea"],"pinyin":["Dui4 ma3 Dao3"],"word":"對馬島"},{"definition":["(orig.) tents forming the offices of a commanding officer\/administration of a military government\/(medieval Japan) \"bakufu\", administration of the shogun"],"pinyin":["mu4 fu3"],"word":"幕府"},{"definition":["canton\/county\/region"],"pinyin":["jun4"],"word":"郡"},{"definition":["Gyeongsang Province of Joseon Korea, now divided into North Gyeongsang Province 慶尚北道|庆尚北道[Qing4 shang4 bei3 dao4] and South Gyeongsang Province 慶尚南道|庆尚南道[Qing4 shang4 nan2 dao4]"],"pinyin":["Qing4 shang4 dao4"],"word":"慶尚道"},{"definition":["Ibaraki prefecture in northeast Japan"],"pinyin":["Ci2 cheng2"],"word":"茨城"},{"definition":["Hyōgo prefecture in the midwest of Japan's main island Honshū 本州[Ben3 zhou1]"],"pinyin":["Bing1 ku4"],"word":"兵庫"},{"definition":["Hawaii, US state"],"pinyin":["Xia4 wei1 yi2 zhou1"],"word":"夏威夷州"}]}