{"definition":["to localize\/localization"],"pinyin":["ben3 tu3 hua4"],"simplified":["本土化"],"rank":11958.0,"normalized_rank":0.16730793446476291,"fraction":0.0000061377752990367996,"cumulative_fraction":0.9436633850938458,"word":"本土化","characters":[{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"},{"definition":["Tu (ethnic group)\/surname Tu","earth\/dust\/clay\/local\/indigenous\/crude opium\/unsophisticated\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Tu3","tu3"],"word":"土"},{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"}],"containing_words":[],"sentences":[{"english":"Besides, Russia is also working on the localization of strategic missile research, development and manufacturing.","chinese":"此外，戰略導彈研發生產本土化也是俄努力的方向。"},{"english":"The next, cleared the definiens of culture localization and its meaning.","chinese":"其次，明確了文化本土化的含義及其意義。"},{"english":"Nativized Englishes are shown at various levels of the English language and distinct from each other.","chinese":"本土化英語表現在語言的各個層面，而且各不相同。"},{"english":"Chapter Four elaborates the Chinese Sinicized TBLT modes and structures.","chinese":"第四章探討了本土化任務型語言教學的模式結構。"},{"english":"We believe that these three perspectives will contribute to the nativization of English teaching in China.","chinese":"這三個視角有助於推動中國英語教學本土化的進程。"},{"english":"The nativization of psychology is now a problem of general concern in psychological circles.","chinese":"心理學本土化是心理學界當前普遍關心的一個問題。"},{"english":"The local phenomena of religious ritual is a very important issue in religious studies.","chinese":"宗教儀式的本土化現象是宗教學研究的主題。"},{"english":"Indigenization of law should be emphasized in legal construction in China.","chinese":"中國法制建設應重視法律的本土化問題。"},{"english":"The process of the localization of American traditional conflicts law has experienced two characteristic phases.","chinese":"美國衝突法的本土化經歷了特色鮮明的兩個階段。"},{"english":"\"agenda-setting\" theory, nationalization, content analysis, case study.","chinese":"“議題設置”理論，本土化，內容分析，個案研究。"},{"english":"The rapid internationalization of English will inevitably result in its nativization.","chinese":"英語的迅速國際化必然引起英語廣泛的本土化。"},{"english":"During this period, Roman education had been completed independent and localization of the development.","chinese":"在這一時期，羅馬教育完成了自主化和本土化的發展。"},{"english":"A series of new words from new\" Zhai\" are produced in the process of localization in China.","chinese":"“宅”詞新義在中國本土化後，出現了一批宅族詞。"},{"english":"And this paper can be considered as an alternative thinking of indigenization of the university education.","chinese":"本文可看成是大學教育本土化的另類思考。"},{"english":"Chen Xiaoming focused on the cultural study of the localization of the problem.","chinese":"陳曉明着重談了文化研究的本土化問題。"}],"related":[{"definition":["to sinicize\/to take on Chinese characteristics"],"pinyin":["Zhong1 guo2 hua4"],"word":"中國化"},{"definition":["localization\/adaptation (to foreign environment)"],"pinyin":["ben3 di4 hua4"],"word":"本地化"},{"definition":["to internationalize\/internationalization"],"pinyin":["guo2 ji4 hua4"],"word":"國際化"},{"definition":["globalization"],"pinyin":["quan2 qiu2 hua4"],"word":"全球化"},{"definition":["diversification\/pluralism\/to diversify"],"pinyin":["duo1 yuan2 hua4"],"word":"多元化"},{"definition":["target market"],"pinyin":["mu4 biao1 shi4 chang3"],"word":"目標市場"},{"definition":["the attitude of mechanically borrowing (ideas etc)"],"pinyin":["na2 lai2 zhu3 yi4"],"word":"拿來主義"},{"definition":["to commercialize"],"pinyin":["shang1 ye4 hua4"],"word":"商業化"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["abreast of modern developments\/to keep up with the times\/progressive\/timely"],"pinyin":["yu3 shi2 ju4 jin4"],"word":"與時俱進"},{"definition":["foreign market"],"pinyin":["guo2 wai4 shi4 chang3"],"word":"國外市場"},{"definition":["deep plowing\/thorough penetration\/thorough development (of a market segment etc)"],"pinyin":["shen1 geng1"],"word":"深耕"},{"definition":["positioning (marketing)"],"pinyin":["shi4 chang3 ding4 wei4"],"word":"市場定位"},{"definition":["one's native country\/native\/local\/metropolitan territory"],"pinyin":["ben3 tu3"],"word":"本土"},{"definition":["intercultural"],"pinyin":["kua4 wen2 hua4"],"word":"跨文化"},{"definition":["overseas\/abroad"],"pinyin":["hai3 wai4"],"word":"海外"}]}