{"definition":["should have\/ought to have"],"pinyin":["ben3 ying1"],"simplified":["本应"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"本應","characters":[{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"}],"containing_words":[],"sentences":[{"english":"They should be the salt of the earth, and the primary responsibility of salt should be salty.","chinese":"他們本應成爲世上的鹽，而鹽的首要責任應當有鹽味。"},{"english":"Online chatting lavishes the precious time that should have been spent on study.","chinese":"網上聊天浪費我們本應用來學習的寶貴時間。"},{"english":"This should be hot in the summer, now why can let a person feel so cool?","chinese":"本應酷熱的盛夏，此刻爲何會讓人感覺如此的微涼？"},{"english":"If investment was decisive the outcome would already be known.","chinese":"如果說投入決定一切，那麼結果本應已無需贅言。"},{"english":"She dreamt about vacation plans when she should have been working.","chinese":"她在本應工作時胡思亂想着度假計劃。"},{"english":"Police commanders have been replaced with Sandinista loyalists; the police chief is widely respected but her term will end in September, before the election.","chinese":"警察長官廣受尊敬而且任期本應到選舉前的九月。"},{"english":"The tables are supposed to be set an hour before we open.","chinese":"桌子本應在開門前一小時就擺好。"},{"english":"Yang Jia killed people, and this should have been condemned by society.","chinese":"楊佳殺人了，本應受到社會的譴責。"},{"english":"\"We probably deserved a higher score, \" the midfield player said.","chinese":"“我們本應打出一個大比分，”這位中場選手說。"},{"english":"It is up to the Chinese government to make the Chinese happier.","chinese":"讓中國人民本應是中國政府的責任啊。"},{"english":"You ought to have told me that yesterday.","chinese":"那件事你本應昨天就告訴我。"},{"english":"The Internet these days is supposed to be all about sharing.","chinese":"當今的互聯網本應是以共享爲主的。"},{"english":"The wind, should leave the piece of acacia, blew again back.","chinese":"風起，本應離去的那份相思，又吹了回來。"},{"english":"I shall call hills steep which ought to be bold.","chinese":"我會把本應被稱作嵯峨的山崗叫作陡坡。"},{"english":"Had United retained the Champions League, he'd surely have added the Ballon d'Or.","chinese":"而曼聯也衛冕冠軍，他本應再來個金球獎的。"},{"english":"It is letter you should answer last week, but it passed out of your mind.","chinese":"這封信你本應上星期回，但你忘得一乾二淨。"}],"related":[]}