{"definition":["original meaning\/literal sense"],"pinyin":["ben3 yi4"],"simplified":["本义"],"rank":39931.0,"normalized_rank":0.5586864969988667,"fraction":3.8727864406470603e-7,"cumulative_fraction":0.9964620503248796,"word":"本義","characters":[{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"},{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["Yi4","yi4"],"word":"義"}],"containing_words":[],"sentences":[{"english":"It is the essence of what I mean when I talk about eating to flourish.","chinese":"這正是當我談論食療健身時的想說的本義。"},{"english":"The saying means no matter how skillful a housewife is, she can't cook a meal without rice literally.","chinese":"本義爲再巧的主婦，要是沒有米也做不出飯來。"},{"english":"According to the relation of sememes, a word has both original meaning and extended meaning.","chinese":"從詞義義位之間的關係看，詞有本義和引申義。"},{"english":"The paper introduces a high-power detecting - device based on magnetostrictive effect for the NDT of steel pipe.","chinese":"本義介紹了大功率磁致伸縮檢測儀的研製。"},{"english":"name If we named it based on what it is, it's a name.","chinese":"如果我們基於本義來命名，它就是一個。"},{"english":"There are different interpretations for the original meaning of\" Yue\".","chinese":"對“龠”本義的解釋，古說頗多，分歧很大。"},{"english":"Yoshiaki Miyamoto hooked just one eel on his morning stint on Lake Biwa, near Kyoto.","chinese":"京都附近琵琶湖，宮本義明早上出海釣到一條鰻魚。"},{"english":"Its original meaning is that the fox borrows the tiger's ferocity to bluster other wild animals.","chinese":"本義是狐狸藉着老虎的威勢去嚇唬別的野獸。"},{"english":"'Dou', denoting food containers in ancient times, means the same thing as 'shu' did in ancient times.","chinese":"豆的本義爲古食內器，其今義在古代用“菽”表示。"},{"english":"The original meaning of inculcation is delivering, and it is a neutral concept.","chinese":"灌輸的本義是“輸送”，它是個中性的概念。"},{"english":"The sacrificial rites are not only commemoratory activities, but originally the offerings to gods.","chinese":"這種祭祀不能僅視爲紀念活動，其本義就是祀神。"},{"english":"The core of success is achieving one’s wishes.","chinese":"而成功的本義就是指達到自己的願望。"},{"english":"The notion of analogy came from music language in the West Zhou Dynasty, referring to comparison by species.","chinese":"興的概念來自西周的樂語，其本義是連類譬喻。"}],"related":[{"definition":["meaning of a character"],"pinyin":["zi4 yi4"],"word":"字義"},{"definition":["meaning of a word"],"pinyin":["ci2 yi4"],"word":"詞義"},{"definition":["phono-semantic compound character"],"pinyin":["xing2 sheng1 zi4"],"word":"形聲字"},{"definition":["Shuowen Jiezi, the original Han dynasty Chinese character dictionary with 10,516 entries, authored by Xu Shen 許慎|许慎[Xu3 Shen4] in 2nd century"],"pinyin":["Shuo1 wen2 Jie3 zi4"],"word":"說文解字"},{"definition":["phonetic change"],"pinyin":["yin1 bian4"],"word":"音變"},{"definition":["phonetic component of a Chinese character"],"pinyin":["sheng1 fu2"],"word":"聲符"},{"definition":["see 說文解字|说文解字[Shuo1 wen2 Jie3 zi4]"],"pinyin":["Shuo1 wen2"],"word":"說文"},{"definition":["ideogram plus phonetic (one of the Six Methods 六書|六书 of forming Chinese characters)\/also known as phonogram, phonetic compound or picto-phonetic character"],"pinyin":["xing2 sheng1"],"word":"形聲"},{"definition":["proper noun"],"pinyin":["zhuan1 ming2"],"word":"專名"},{"definition":["synonym"],"pinyin":["tong2 yi4 ci2"],"word":"同義詞"},{"definition":["word formation"],"pinyin":["zu3 zi4"],"word":"組字"},{"definition":["pronoun"],"pinyin":["dai4 ci2"],"word":"代詞"},{"definition":["combined ideogram (one of the Six Methods 六書|六书 of forming Chinese characters)\/Chinese character that combines the meanings of existing elements\/also known as joint ideogram or associative compounds"],"pinyin":["hui4 yi4 zi4"],"word":"會意字"},{"definition":["etymology"],"pinyin":["yu3 yuan2"],"word":"語源"},{"definition":["reading or phonetic value of a character"],"pinyin":["yin1 du2"],"word":"音讀"},{"definition":["Manchurian language"],"pinyin":["Man3 yu3"],"word":"滿語"}]}