{"definition":["ontology"],"pinyin":["ben3 ti3 lun4"],"simplified":["本体论"],"rank":54009.0,"normalized_rank":0.7556559819792089,"fraction":9.196590492301727e-8,"cumulative_fraction":0.9994274748715792,"word":"本體論","characters":[{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"論"}],"containing_words":[],"sentences":[{"english":"The ontological character of literary understanding signifies self-understanding of interpretive subject.","chinese":"理解的本體論性質意味着闡釋主體的自我理解。"},{"english":"This is the noumenon affirmation of the historical law.","chinese":"這是在本體論層面對歷史規律存在的肯定。"},{"english":"The first chapter is the literature ontology.","chinese":"第一章文學本體論。"},{"english":"I have never seen anyone die for the ontologi-cal argument.","chinese":"我從來沒有見過有人爲本體論的爭辯而死。"},{"english":"Could you please explaining briefly on your thinking of the conflicts between ontology and constructionism?","chinese":"您是否可以對本體論和建構論之間的悖論稍作解釋？"},{"english":"Monk Zhao s theory of \"Bu Zhen Kong Lun\" is to deal with the problem concerning ontology.","chinese":"僧肇的《不真空論》論述的是“空”這一本體論問題。"},{"english":"The ontological methodology is fundamental for every theol…","chinese":"本體論方法對於每一種宗教哲學都是基本的。"},{"english":"Fan Ben body-theology that is absolutely anti-utopia.","chinese":"反本體論神學即反絕對烏托邦。"},{"english":"I only tell about 25% of my customers I am building ontologies.","chinese":"大約只有25%的客戶我會告訴他們我在構建本體論。"},{"english":"This article analyses Ji Kang's ontology on musical aesthetics thought.","chinese":"文章分析了嵇康音樂美學的本體論思想。"},{"english":"Do not confuse roles with objects within the ontology","chinese":"不要將角色和本體論中的對象混淆在一起。"},{"english":"The first part is mainly about the origins of Caruthers's theory of mind.","chinese":"本文的研究重點是卡拉瑟斯的心靈本體論。"},{"english":"Later Wittgenstein's study of language is a kind of ontological reflection.","chinese":"後期維特根斯坦則是在一種本體論意義上研究語言。"},{"english":"Among them, thoughts of praxis-meta-ontology and epistemology are especially remarkable.","chinese":"其中實踐一元本體論思想和認識論思想顯得尤爲突出。"},{"english":"This text will utilize the idea of ontology to develop the technology of multi- agent.","chinese":"本文將利用本體論觀念，開發多代理人技術。"},{"english":"Built in taxonomy and an extensible ontology for semantic mediation.","chinese":"爲語義中介內置分類法和可擴展本體論。"}],"related":[]}