{"definition":["man of Qǐ fears the sky falling (idiom); groundless fears"],"pinyin":["Qi3 ren2 you1 tian1"],"simplified":["杞人忧天"],"rank":30636.0,"normalized_rank":0.4286373875449471,"fraction":8.907554791115101e-7,"cumulative_fraction":0.9908248525992424,"word":"杞人憂天","characters":[{"definition":["Chinese wolfberry shrub (Lycium chinense)\/willow","Qi, a Zhou Dynasty vassal state\/surname Qi"],"pinyin":["Qi3","qi3"],"word":"杞"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"},{"definition":["to worry\/to concern oneself with\/worried\/anxiety\/sorrow\/(literary) to observe mourning"],"pinyin":["you1"],"word":"憂"},{"definition":["day\/sky\/heaven"],"pinyin":["tian1"],"word":"天"}],"containing_words":[],"sentences":[{"english":"Fears of an invasion of \"Polish plumbers\" apparently turned out to be unfounded.","chinese":"對“波蘭水管工”湧入發達國家的憂慮可謂杞人憂天。"},{"english":"Maybe the large number of scientists who caution about impending catastrophes are worrywarts .","chinese":"也許這一大批發出警報的科學家只是杞人憂天。"},{"english":"Later, someone persuade him that his fears were groundless. This idioms satirizes those who worry unnecessary.","chinese":"成語杞人憂天譏笑那些沒有必要或毫無根據的憂慮。"},{"english":"I hate to admit it, but I'm a worrier.","chinese":"我不願意承認，但我確實常常杞人憂天。"},{"english":"Alarmists fear that South Korea—which has a much smaller population—may overtake Japan, too.","chinese":"杞人憂天者則害怕人口小國韓國也將超過日本。"},{"english":"I made that up, in the same way that alarmists have made up the threat levels.","chinese":"以上我是編造的，就像那些杞人憂天的傢伙一樣。"},{"english":"Were all those pandemic warnings just scare-mongering?","chinese":"那些流行病預警是杞人憂天嚇唬人的嗎？"},{"english":"Therefore, current fears of many employees of major United States corporations are not deemed to be a fike .","chinese":"因此，目前一些公司僱員的擔心不能說是杞人憂天的。"},{"english":"We too often borrow trouble, and  anticipate that may never appear.","chinese":"我們常常過多地自尋煩惱，杞人憂天。"},{"english":"Worrywarts need reassurance and encouragement to overcome their fears.","chinese":"杞人憂天的人需要安全感和鼓勵幫助他們克服恐懼。"},{"english":"Baby, \" I'll tell her, \"remember, your momma is a worrier.","chinese":"我會告訴她“寶貝兒，記住，你媽媽是個杞人憂天者。"}],"related":[{"definition":["when things reach an extreme, they can only move in the opposite direction (idiom)"],"pinyin":["wu4 ji2 bi4 fan3"],"word":"物極必反"},{"definition":["to spin a cocoon around oneself (idiom); enmeshed in a trap of one's own devising\/hoist by his own petard"],"pinyin":["zuo4 jian3 zi4 fu4"],"word":"作繭自縛"},{"definition":["to dabble and stop (idiom); to dip into\/to attempt half-heartedly\/content with a smattering of knowledge"],"pinyin":["qian3 chang2 zhe2 zhi3"],"word":"淺嘗輒止"},{"definition":["lit. to dispel the clouds and see the sun (idiom); fig. to restore justice"],"pinyin":["bo1 yun2 jian4 ri4"],"word":"撥雲見日"},{"definition":["to obstinately persist in going about things the wrong way (idiom)"],"pinyin":["zhi2 mi2 bu4 wu4"],"word":"執迷不悟"},{"definition":["to look forward and back\/to consider prudently\/overcautious"],"pinyin":["zhan1 qian2 gu4 hou4"],"word":"瞻前顧後"},{"definition":["one's own wishful thinking"],"pinyin":["yi1 xiang1 qing2 yuan4"],"word":"一廂情願"},{"definition":["lit. heaven's law and earth's principle (idiom); fig. right and proper\/right and unalterable\/a matter of course"],"pinyin":["tian1 jing1 di4 yi4"],"word":"天經地義"},{"definition":["lit. first impression is strongest"],"pinyin":["xian1 ru4 wei2 zhu3"],"word":"先入為主"},{"definition":["less capable than desirable (idiom); not as strong as one would wish\/the spirit is willing but the flesh is weak"],"pinyin":["li4 bu4 cong2 xin1"],"word":"力不從心"},{"definition":["to be obsessive\/to persist obstinately"],"pinyin":["zhi2 mi2"],"word":"執迷"},{"definition":["lit. heart distracted, thoughts in turmoil (idiom); distraught with anxiety"],"pinyin":["xin1 fan2 yi4 luan4"],"word":"心煩意亂"},{"definition":["lit. one body two sides (idiom)\/fig. a situation with two sides to it"],"pinyin":["yi1 ti3 liang3 mian4"],"word":"一體兩面"},{"definition":["to force someone to do something"],"pinyin":["qiang3 ren2 suo3 nan2"],"word":"強人所難"},{"definition":["lit. you hoodwink me and I cheat you (idiom); fig. mutual deception\/each tries to outwit the other\/dog eats dog and devil take the hindmost"],"pinyin":["er3 yu2 wo3 zha4"],"word":"爾虞我詐"},{"definition":["frightening words to scare people (idiom); alarmist talk\/reds under the beds"],"pinyin":["wei1 yan2 song3 ting1"],"word":"危言聳聽"}]}