{"definition":["gird\/tighten"],"pinyin":["shu4 jin3"],"simplified":["束紧"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"束緊","characters":[{"definition":["surname Shu","to bind\/bunch\/bundle\/classifier for bunches, bundles, beams of light etc\/to control"],"pinyin":["Shu4","shu4"],"word":"束"},{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"緊"}],"containing_words":[],"sentences":[{"english":"When they tighten their belts, austerity ripples out and chokes growth.","chinese":"當他們束緊褲腰帶，簡樸生活會波及到經濟增長。"},{"english":"I drew my coat around me and tightened its belt and as I did so I glanced at Parry's shoes.","chinese":"我拉緊外套，束緊腰帶，這時，我瞥了一眼帕裏的鞋。"},{"english":"The chain surrounded on the back of heel band provides perfect and tight attachment of shoe last to the band.","chinese":"後跟束緊器鏈條環抱皮套設計，充分發揮束緊力功能。"},{"english":"The chain surrounded on the back of heel band provides perfect and tight attachment of shoe last to the band.","chinese":"後跟束緊器鏈條環抱皮套設計，充分發揮束緊力功能。"},{"english":"This increases incentive costs and is a negative effect of private benefits.","chinese":"私利的存在，束緊了這一約束。"},{"english":"The main strap can be tightened with a pretty simple tug on the inside lever.","chinese":"主要的束帶可以藉由簡單的扳動中央撥杆來束緊。"},{"english":"The priest girded up his clothing and stepped into the river to show the people that he had no fear.","chinese":"祭司束緊了衣服走進河中，向人民表示他不怕死。"},{"english":"The girl girded up his clothing and stepped into the river.","chinese":"女孩束緊了衣服走進河中。"},{"english":"The band is made tighter or looser to change the size of the pouch.","chinese":"通過束緊或放鬆束胃帶來改變袋子的體積大小。"},{"english":"Further, the restraint sleeve is fine in air permeability and is favorable for dissipating heat of the forearms.","chinese":"另外，束緊套的透氣性好，利於小臂的熱量散發。"},{"english":"The coat is belted at the waist.","chinese":"上衣被束緊在腰間。"},{"english":"But not at liberty to tighten the thigh.","chinese":"大腿卻不能隨意束緊的。"}],"related":[]}