{"definition":["east side\/east face"],"pinyin":["dong1 ce4"],"simplified":["东侧"],"rank":9866.0,"normalized_rank":0.13803814027674785,"fraction":0.000008425390689590137,"cumulative_fraction":0.9285783454397476,"word":"東側","characters":[{"definition":["east\/host (i.e. sitting on east side of guest)\/landlord","surname Dong"],"pinyin":["Dong1","dong1"],"word":"東"},{"definition":["lean on one side","the side\/to incline towards\/to lean\/inclined\/lateral\/side"],"pinyin":["ce4","zhai1"],"word":"側"}],"containing_words":[],"sentences":[{"english":"It located in Pudong Expo B east axis.","chinese":"它位於浦東B片區世博軸東側。"},{"english":"Test building and book building's eastern side in new building.","chinese":"實驗樓和圖書樓在新樓的東側。"},{"english":"The Malage tin-polymetal deposit is distributed near the southeast lateral of the Baipaotai granite.","chinese":"馬拉格礦牀分佈於白炮臺花崗岩的南東側。"},{"english":"The shoe shop is on the eastside of the shopping center close to the cafeteria.","chinese":"鞋店在購物中心的東側，靠近自助餐廳。"},{"english":"Located in the south of the palace, the south east ZhengYangMen outside.","chinese":"位於故宮正南偏東的城南，正陽門外東側。"},{"english":"Jinyintan bathing place Located at Jingtang Port east side.","chinese":"金銀灘浴場位於京唐港東側。"},{"english":"Meet me at the junkyard on the east side of town, KIRO.","chinese":"會見時在鎮東側，基羅排土場我。"},{"english":"This route is cut into the eastern side of the second highest mountain range on Earth, the Andes.","chinese":"這條路是在地球第二高山脈安第斯山的東側修築的。"},{"english":"Small forest Liang Shan area is located in traverse mountain chain east side.","chinese":"小涼山地區地處橫斷山脈東側。"},{"english":"The single-arch flying Buttresses at the eastern end are notable for their Boldness and grace.","chinese":"東側的單拱飛扶垛以雄健優雅着稱。"},{"english":"Miluo River in the east of Dongting Lake, the Dongting Lake water system.","chinese":"汨羅江在洞庭湖東側，屬洞庭湖水系。"},{"english":"Set up the light well point pipe inside of east anti-extrusion ditch.","chinese":"輕型井點管佈設於場地東側的防擠溝內。"},{"english":"Police recovered their inflatable boat east of the rapids the next day.","chinese":"第二天，警察在急流東側發現他們仍未漏氣的皮划艇。"},{"english":"Nigerians court to Garden Road and North Road to traffic Tzu Link.","chinese":"大運村東側以花園路和北土城路爲交通幹線。"},{"english":"Today, Mercury reaches its greatest eastern elongation from the sun.","chinese":"此時此刻是水星在太陽的最東側。"},{"english":"Ocean-going vessels moored at the east side.","chinese":"遠洋輪停泊在其東側。"}],"related":[]}