{"definition":["lit. to return to office after living as a hermit on Mount Dongshan (idiom); fig. to make a comeback"],"pinyin":["dong1 shan1 zai4 qi3"],"simplified":["东山再起"],"rank":25083.0,"normalized_rank":0.3509437130105075,"fraction":0.0000014686809038578996,"cumulative_fraction":0.9844132334906442,"word":"東山再起","characters":[{"definition":["east\/host (i.e. sitting on east side of guest)\/landlord","surname Dong"],"pinyin":["Dong1","dong1"],"word":"東"},{"definition":["mountain\/hill\/anything that resembles a mountain\/CL:座[zuo4]\/bundled straw in which silkworms spin cocoons\/gable","surname Shan"],"pinyin":["Shan1","shan1"],"word":"山"},{"definition":["again\/once more\/re-\/second\/another\/then (after sth, and not until then)\/no matter how ... (followed by an adjective or verb, and then (usually) 也[ye3] or 都[dou1] for emphasis)"],"pinyin":["zai4"],"word":"再"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"I can try again.","chinese":"我可以東山再起。"},{"english":"This is what got me fired and then hired.","chinese":"這就是爲什麼我被炒掉了能夠又東山再起。"},{"english":"He that falls today maybe up tomorrow again.","chinese":"今日跌倒的他或許他日還能東山再起。"},{"english":"I don't believe that it will be possible to put young Cowperwood on his feet after this.","chinese":"我不相信這回能夠使年輕的柯柏烏東山再起。"},{"english":"Al-Jadaa rebounded by selling her inventory and buying the equipment needed to start over.","chinese":"賈達通過變賣庫存重新購買設備才得以東山再起。"},{"english":"After years of semi-retirement, the actressstaged a comeback.","chinese":"那位女明星在數年的半退休之後東山再起。"},{"english":"The boss lost all his money, but soon bobbed up again.","chinese":"這老闆完全虧了本，但很快東山再起。"},{"english":"If escaping from death, need equestrian desert, in the future good stage a comeback.","chinese":"大難不死的話，就需要騎馬逃跑，日後好東山再起。"},{"english":"It is difficult for Central and Southern Europe to resurge in the short term.","chinese":"中東歐經濟短期內難以東山再起。"},{"english":"We suffered a terrible blow, but we are coming back.","chinese":"我們遭受了沉重一擊，但是我們正在東山再起。"},{"english":"The boxer hopes to stage a come-back.","chinese":"這拳擊家希望東山再起。"},{"english":"They didn't admit they were defeated; they began to recruit and attempted to stage a comeback.","chinese":"他們不承認失敗，他們開始招兵妄圖東山再起。"},{"english":"After a quietus of twenty years she returned.","chinese":"二十年後又東山再起。"},{"english":"Califano said Watergate would bring a Democratic revival.","chinese":"卡利法諾說，水門事件將幫助民主黨人東山再起。"},{"english":"That fellow bobs up like a cork.","chinese":"那個人經過患難，東山再起。"},{"english":"Color PDP is just bob up like a cork, recurring in former days mien.","chinese":"彩色等離子體顯示器正在東山再起，重顯昔日風采。"}],"related":[{"definition":["to contend on strong grounds\/to argue strongly for what is right"],"pinyin":["ju4 li3 li4 zheng1"],"word":"據理力爭"},{"definition":["to have one's wish fulfilled"],"pinyin":["ru2 yuan4 yi3 chang2"],"word":"如願以償"},{"definition":["to take an alternate route (idiom)\/to find an alternative\/to take a different approach\/to blaze a new trail"],"pinyin":["ling4 pi4 xi1 jing4"],"word":"另闢蹊徑"},{"definition":["prosperous and developing\/flourishing"],"pinyin":["xing1 wang4 fa1 da2"],"word":"興旺發達"},{"definition":["reparations\/to pay reparations"],"pinyin":["pei2 kuan3"],"word":"賠款"},{"definition":["to be at the highest level of enlightenment (Buddhist expression)"],"pinyin":["bai3 chi3 gan1 tou2"],"word":"百尺竿頭"},{"definition":["lit. to upend heaven and earth (idiom)\/fig. to change the course of events\/to turn things around"],"pinyin":["niu3 zhuan3 qian2 kun1"],"word":"扭轉乾坤"},{"definition":["to be reluctant to give up a post"],"pinyin":["lian4 zhan4"],"word":"戀棧"},{"definition":["to rack one's brains (idiom); to take great pains to think sth through"],"pinyin":["fei4 jin4 xin1 si5"],"word":"費盡心思"},{"definition":["elated and excited (idiom); overjoyed"],"pinyin":["huan1 xin1 gu3 wu3"],"word":"歡欣鼓舞"},{"definition":["to assume personal responsibility (idiom); to take charge of a section"],"pinyin":["du2 dang1 yi1 mian4"],"word":"獨當一面"},{"definition":["to throw one's life in for\/to haplessly give one's life for\/to sacrifice oneself torturously working for another or for a group\/to pour in one's utmost effort\/to shed one's last ounce of strength for"],"pinyin":["mai4 ming4"],"word":"賣命"},{"definition":["to remain calm in the face of events (idiom)"],"pinyin":["chu3 bian4 bu4 jing1"],"word":"處變不驚"},{"definition":["to bury oneself in work (idiom); to be engrossed in work\/to make an all-out effort\/up to the neck in work"],"pinyin":["mai2 tou2 ku3 gan4"],"word":"埋頭苦幹"},{"definition":["supplementary cash reserve\/private fund\/private hoard\/slush fund"],"pinyin":["xiao3 jin1 ku4"],"word":"小金庫"},{"definition":["to work to no avail (idiom)"],"pinyin":["tu2 lao2 wu2 gong1"],"word":"徒勞無功"}]}