{"definition":["host"],"pinyin":["dong1 dao4"],"simplified":["东道"],"rank":64866.0,"normalized_rank":0.9075594979922488,"fraction":1.6349494208536403e-8,"cumulative_fraction":0.9999513707651212,"word":"東道","characters":[{"definition":["east\/host (i.e. sitting on east side of guest)\/landlord","surname Dong"],"pinyin":["Dong1","dong1"],"word":"東"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"}],"containing_words":[{"definition":["host\/official host (e.g. venue for games or a conference)"],"pinyin":["dong1 dao4 zhu3"],"word":"東道主"}],"sentences":[{"english":"Afghanistan's Second Vice President Abdul Karim Khalili was present at the meeting as guest of the host country.","chinese":"阿富汗第二副總統哈利利作爲東道國客人出席會議。"},{"english":"You can host all international domains with no restrictions.","chinese":"您可以在東道國的所有國際域名沒有任何限制。"},{"english":"For this to happen, the host countries need to have credible development plans.","chinese":"要實現這一目標，東道國需要有可信的發展計劃。"},{"english":"His pronouncements were cited with awe by our Chinese hosts.","chinese":"我們的中國東道主們對他的每句話都奉若神明。"},{"english":"\" asked Chile's Mercurio newspaper after Brazil had eliminated the hosts in the semi-final.","chinese":"智利《水星》報在巴西隊半決賽淘汰東道主後發問。"},{"english":"Let's bet on the final result of the match.","chinese":"咱們就以這場球賽的勝負來賭東道。"},{"english":"Li Kaimian who comes from amphitryon institution was the key compere of the workshop.","chinese":"研討會是由東道主單位的李開綿作爲總的主持人。"},{"english":"The Olympic Games shall be proclaimed open by the Head of State of the host country.","chinese":"奧運會由東道國國家元首宣佈開幕。"},{"english":"I want to thank our host Belgium for the thoughtful arrangements.","chinese":"感謝東道主比利時爲本屆會議所做的周到安排。"},{"english":"Xabi Alonso, Albert Riera and Alvaro Arbeloa will also be hoping to play against the host nation.","chinese":"阿隆索列拉阿貝羅阿也有望上場與東道主交手。"},{"english":"Qin added that China is both the host country and the participant of this round of Six-Party Talks.","chinese":"他說，中方既是本輪六方會談的東道主，也是參與者。"},{"english":"And finally I want to express our deep appreciation to our Chinese hosts.","chinese":"最後，我希望對我們的中國東道主表示誠摯的謝忱。"},{"english":"That is why I prattle and chatter lightly and hide my heart behind words.","chinese":"是以我輕鬆地說東道西，把我的心藏在說話的後面。"},{"english":"As the host, we warmly welcome all the delegations to Beijing again.","chinese":"作爲東道主，我們熱烈歡迎各方代表團的再次到來。"},{"english":"And finally, I want to express our deep appreciation to our Chinese hosts.","chinese":"末了，我志願對我們的中國東道主表示誠摯的謝忱。"},{"english":"My reply did not rise to the nobility of my host.","chinese":"我的答辭沒有滿足東道主的厚望。"}],"related":[{"definition":["to talk about this and that (idiom); to ramble incoherently"],"pinyin":["dong1 la1 xi1 che3"],"word":"東拉西扯"},{"definition":["lit. deal sincerely and fairly (idiom); frank and open-minded\/plain speaking\/Let's talk frankly and openly between ourselves.\/to put one's cards on the table"],"pinyin":["kai1 cheng2 bu4 gong1"],"word":"開誠布公"},{"definition":["to check an amount"],"pinyin":["dian3 jian4"],"word":"點見"},{"definition":["basis point (finance), abbr. to 基點|基点[ji1 dian3]"],"pinyin":["ji1 ben3 dian3"],"word":"基本點"},{"definition":["to display one's slight skill before an expert (idiom)"],"pinyin":["Ban1 men2 nong4 fu3"],"word":"班門弄斧"},{"definition":["circular finger movement (in playing plucked instrument)\/strumming"],"pinyin":["lun2 zhi3"],"word":"輪指"},{"definition":["to listen with respectful attention\/(a polite request to sb to speak)\/we are all ears"],"pinyin":["xi3 er3 gong1 ting1"],"word":"洗耳恭聽"},{"definition":["personality cult"],"pinyin":["ge4 ren2 chong2 bai4"],"word":"個人崇拜"},{"definition":["to concentrate on the main points (idiom); to bring out the essentials"],"pinyin":["ti2 gang1 qie4 ling3"],"word":"提綱挈領"},{"definition":["to praise the virtue of sb or sth while concealing their faults"],"pinyin":["yin3 e4 yang2 shan4"],"word":"隱惡揚善"},{"definition":["fight to the death\/desperate struggle"],"pinyin":["si3 zhan4"],"word":"死戰"},{"definition":["sequel\/continuation of a book"],"pinyin":["xu4 shu1"],"word":"續書"},{"definition":["proposition\/argument"],"pinyin":["li4 lun4"],"word":"立論"},{"definition":["(TCM) observation, one of the four methods of diagnosis 四診|四诊[si4 zhen3]"],"pinyin":["wang4 zhen3"],"word":"望診"},{"definition":["confused\/disorderly\/incoherent"],"pinyin":["dian1 san1 dao3 si4"],"word":"顛三倒四"},{"definition":["historical materialism (Marx's theory of history)"],"pinyin":["li4 shi3 wei2 wu4 zhu3 yi4"],"word":"歷史唯物主義"}]}