{"definition":["see 黑板報|黑板报[hei1 ban3 bao4]"],"pinyin":["ban3 bao4"],"simplified":["板报"],"rank":36763.0,"normalized_rank":0.5143620667944538,"fraction":5.176366648524113e-7,"cumulative_fraction":0.9950364129679864,"word":"板報","characters":[{"definition":["board\/plank\/plate\/shutter\/table tennis bat\/clappers (music)\/CL:塊|块[kuai4]\/accented beat in Chinese music\/hard\/stiff\/to stop smiling or look serious"],"pinyin":["ban3"],"word":"板"},{"definition":["to announce\/to inform\/report\/newspaper\/recompense\/revenge\/CL:份[fen4],張|张[zhang1]"],"pinyin":["bao4"],"word":"報"}],"containing_words":[{"definition":["blackboard bulletin with short news items written on it (can usually be found in factories, schools etc)"],"pinyin":["hei1 ban3 bao4"],"word":"黑板報"}],"sentences":[{"english":"The competition of English newsletter constructs strong atmosphere of learning English.","chinese":"英語板報的評比營造了學習英語的濃濃氛圍。"},{"english":"The postern by exquisite blackboard newspaper.","chinese":"後門邊由精緻的黑板報。"},{"english":"I think it an honour to be selected simply because editor of the wexcellentspaper.","chinese":"我以爲，被選上板報編輯是一種信用。"},{"english":"A poster at the Beijie School construction site.","chinese":"北街小學施工現場的張貼板報。"},{"english":"These were classroom decorations at KPMG Zhangqi Hope School.","chinese":"在張旗畢馬威苗圃希望小學斑房裏的板報。"},{"english":"She is good at drawing and is the producer and painter of every poster in high school.","chinese":"高中時，所有的班級板報都是她設計並參與繪製的。"},{"english":"That's our Bulletin Board, and I hope you like it.","chinese":"這就是我們班的板報設計，希望大家喜歡。"},{"english":"He is in charge of a publication in the school, and is responsible for a blackboard newspaper.","chinese":"他在學校是宣傳委員，負責出每期的黑板報。"},{"english":"Over the past few weeks the students have been working on creating a new billboard design for our classroom.","chinese":"過去幾周同學們都在忙着爲教室設計新的板報。"}],"related":[]}