{"definition":["lath"],"pinyin":["ban3 tiao2"],"simplified":["板条"],"rank":49417.0,"normalized_rank":0.6914079442586711,"fraction":1.5356846345875265e-7,"cumulative_fraction":0.9988733147504648,"word":"板條","characters":[{"definition":["board\/plank\/plate\/shutter\/table tennis bat\/clappers (music)\/CL:塊|块[kuai4]\/accented beat in Chinese music\/hard\/stiff\/to stop smiling or look serious"],"pinyin":["ban3"],"word":"板"},{"definition":["strip\/item\/article\/clause (of law or treaty)\/classifier for long thin things (ribbon, river, road, trousers etc)"],"pinyin":["tiao2"],"word":"條"}],"containing_words":[{"definition":["crate"],"pinyin":["ban3 tiao2 xiang1"],"word":"板條箱"}],"sentences":[{"english":"The aluminum light shelves are horizontal slats which have a high coefficient of reflectivity.","chinese":"鋁製光架是有高反射係數的水平板條。"},{"english":"Boxes and crates shall be steel strapped.","chinese":"木箱和板條箱應該用鋼帶捆綁。"},{"english":"She crashed the plates angrily down on the table.","chinese":"用空板條箱權充桌子。"},{"english":"The cat was sitting on an upturned crate.","chinese":"貓兒蹲坐在倒放的板條箱上。"},{"english":"A novel dual-slab laser with off-axis hybrid resonator is presented.","chinese":"報道了一種新型雙板條離軸混合腔激光器。"},{"english":"I up-ended the crate and sat on it.","chinese":"我把板條箱倒過來坐。"},{"english":"Slat washer cleans 72 or 144 slats in one hour.","chinese":"板條沖洗機一小時內可清理72或144個板條。"},{"english":"Slat washer cleans 72 or 144 slats in one hour.","chinese":"板條沖洗機一小時內可清理72或144個板條。"},{"english":"A. Work of this Section includes factory finished, strand woven bamboo strip flooring.","chinese":"這部分工作包括工廠上漆的竹地板條。"},{"english":"Fix the top lath of the curtain onto the roller with the screws and washers provided.","chinese":"用提供的螺絲釘和墊片把卷簾頂部板條固定在卷軸上。"},{"english":"Someone sticked a label on the crate.","chinese":"有人咱板條箱上貼了標籤。"},{"english":"Multiple slab discharges are established in a diffusion cooled radial electrode array.","chinese":"用擴散冷卻輻射狀電極列陣構成多通道板條放電。"},{"english":"There are trees and wood and rubble strewn everywhere.","chinese":"樹木，垃圾和板條到處都是。"},{"english":"The slats are waxed and kiln dried again.","chinese":"板條上蠟，然後再烘乾。"},{"english":"The cat was sitting on an upturned crate .","chinese":"貓兒蹲坐在倒放的板條箱上。"},{"english":"His back itched, so he leaned against the fence and rubbed against the boards.","chinese":"他的背開始發癢，所以他就靠着柵欄，在板條上磨蹭。"}],"related":[]}