{"definition":["handcart\/flatbed cart\/flatbed tricycle"],"pinyin":["ban3 che1"],"simplified":["板车"],"rank":31035.0,"normalized_rank":0.4342199152127377,"fraction":8.592243117093329e-7,"cumulative_fraction":0.991173775183916,"word":"板車","characters":[{"definition":["board\/plank\/plate\/shutter\/table tennis bat\/clappers (music)\/CL:塊|块[kuai4]\/accented beat in Chinese music\/hard\/stiff\/to stop smiling or look serious"],"pinyin":["ban3"],"word":"板"},{"definition":["car\/vehicle\/CL:輛|辆[liang4]\/machine\/to shape with a lathe\/Kangxi radical 159","surname Che","war chariot (archaic)\/rook (in Chinese chess)\/rook (in chess)"],"pinyin":["Che1","che1","ju1"],"word":"車"}],"containing_words":[{"definition":["handcart\/trolley\/flatbed truck"],"pinyin":["ping2 ban3 che1"],"word":"平板車"},{"definition":["kick scooter\/push scooter"],"pinyin":["hua2 ban3 che1"],"word":"滑板車"},{"definition":["scooter"],"pinyin":["ta4 ban3 che1"],"word":"踏板車"}],"sentences":[{"english":"But of all the presents, I like the scooter best.","chinese":"但是在所有的禮物裏，我最喜歡滑板車。"},{"english":"To clarify the weight to load and the flatbed's rated load; it can not be overloaded.","chinese":"要弄清所載物的重量和平板車的額定負荷，不能超載。"},{"english":"Would you like to ride my new scooter?","chinese":"你想不想騎我的新滑板車？"},{"english":"I came to scootering late in life.","chinese":"在我的生活中，與踏板車邂逅是很晚的事情了。"},{"english":"The scooters were part of the cargo confiscated by Israeli troops from the Gaza-bound flotilla that sailed from Turkey.","chinese":"這些滑板車是以軍收繳來自土耳其船隻貨物的一部分。"},{"english":"The trader pushing small dray is selling watermelon.","chinese":"那個推着板車的商販正在賣西瓜。"},{"english":"The children are scootering in the yard.","chinese":"孩子們在院子裏騎踏板車玩呢。"},{"english":"In order to delivery the goods I dragged the board-vehicle by my own do you know that?","chinese":"爲了運貨，我自己去拉板車，板車你知道嗎？"},{"english":"In order to delivery the goods I dragged the board-vehicle by my own do you know that?","chinese":"爲了運貨，我自己去拉板車，板車你知道嗎？"},{"english":"Does he have a scooter?","chinese":"他有一輛滑板車嗎？"},{"english":"The railroad has been piggybacking for quite a number of years.","chinese":"許多年來鐵路上一直用火車平板車裝運。"},{"english":"Win a Stella scooter while enjoying a delicious Belgium Beer.","chinese":"享受美味比利時啤酒的同時贏取一輛時代滑板車。"},{"english":"It also features a wireless electric key and alarm system.","chinese":"此外，新款滑板車還配有無線電鑰匙和警報系統。"},{"english":"It sat on top of a small flatbed with wooden wheels, drawn by the yoked oxen from the field.","chinese":"靈柩被安置在木輪的平板車上，由上了軛的水牛拉着。"},{"english":"Public works trucks line up to load sand onto their flatbeds.","chinese":"公共工程車輛成排地往平板車上裝沙子。"},{"english":"So she found a flat truck and took him to the doctor for acupuncturing every other day.","chinese":"她找來一輛平板車，每兩天就拉着他翻山去扎一次針。"}],"related":[]}