{"definition":["forestry"],"pinyin":["lin2 xue2"],"simplified":["林学"],"rank":45120.0,"normalized_rank":0.6312873392749709,"fraction":2.3531593450143465e-7,"cumulative_fraction":0.9980481607410008,"word":"林學","characters":[{"definition":["surname Lin\/Japanese surname Hayashi","woods\/forest\/CL:片[pian4]\/circle(s) (i.e. specific group of people)\/a collection (of similar things)"],"pinyin":["Lin2","lin2"],"word":"林"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[{"definition":["members of the Hanlin Imperial Academy 翰林院, employed as imperial secretaries from the Tang onwards"],"pinyin":["Han4 lin2 xue2 shi4"],"word":"翰林學士"}],"sentences":[{"english":"An introduction of the Master's Degree Program in the Forestry discipline is as follows.","chinese":"根據其設立目的，設置林學學科培養方案如下。"},{"english":"Graduate Student, Department of Forestry, National Chung Hsing University.","chinese":"國立中興大學森林學系研究生。"},{"english":"After three years he entered the College Rollin, where he started drawing classes.","chinese":"三年後他進入羅林學院，開始修繪畫課。"},{"english":"Forestry appertains to geography.","chinese":"森林學和地理學有關。"},{"english":"The type specimens are deposited in the Northwest Forestry College.","chinese":"研究標本及模式標本保存於西北林學院。"},{"english":"The type specimen are kept in NorthwesternCollege of Forestry.","chinese":"模式標本保存在西北林學院。"},{"english":"Later Jin Dynasty was also once abolished Hanlin degree, their functions and to go in the book rounding.","chinese":"後晉還一度廢除翰林學士，其職並歸中書舍人。"},{"english":"Dendrology is one foundational course in the Specialty of Forestry.","chinese":"樹木學是林學專業的專業基礎課。"},{"english":"The Han wood's bachelor's degree was a vice minister class, was a Qing further mutually.","chinese":"翰林學士就是副部長級了，進一步就是卿相。"},{"english":"HAN-Lin played a major political role in the late Tang Dynasty.","chinese":"唐代自進入中後期，翰林學士的政治角色日形重要。"},{"english":"Sherman Lin is fond of freehand abstract paintings.","chinese":"林學明畫的是抽象寫意繪畫。"},{"english":"Master, Department of Forestry, National Chung-Hsing University.","chinese":"國立中興大學森林學系碩士。"}],"related":[]}