{"definition":["green (golf) (loanword)"],"pinyin":["guo3 ling3"],"simplified":["果岭"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"果嶺","characters":[{"definition":["fruit\/result\/resolute\/indeed\/if really"],"pinyin":["guo3"],"word":"果"},{"definition":["mountain range\/mountain ridge"],"pinyin":["ling3"],"word":"嶺"}],"containing_words":[],"sentences":[{"english":"I didn't have the speed at all on the greens.","chinese":"我根本不能再果嶺上提起速度。"},{"english":"Two greens again, ask your caddy for yardage.","chinese":"呢處又繫有兩個果嶺，要碼數清楚最好問球僮。"},{"english":"The uniform of green speed on the Willow golf course was worse in Spring.","chinese":"高爾夫球場果嶺球速春季比夏季和秋季較慢。"},{"english":"Avoid stepping on adversary's ball and altering competitor's line of putt.","chinese":"在果嶺是應避免踏越對方球員的球，及進球路線。"},{"english":"The green is behind the grove.","chinese":"這是右狗腿洞，果嶺在那片樹林後面。"},{"english":"The tees, landing areas and greens are all placed away from where runoff will collect.","chinese":"發球臺，落點區，果嶺都要遠離會被沖刷的區域。"},{"english":"Multiple-level greens have their place and are quite effective when used properly.","chinese":"多層果嶺有其地位，同時用的好會讓人印象深刻。"},{"english":"It was a tough walk because the green was higher than the tee.","chinese":"他走得非常艱難，因爲果嶺要比發球處地勢高些。"},{"english":"A player plays from just off the putting green with the flagstick in the hole.","chinese":"當旗杆還在球洞裏的時候，一名球員從果嶺上打球。"},{"english":"The difficulty is heavy , especially the undulation on the green, it is easy to get three putting.","chinese":"這裏的果嶺難度很大，起伏特別大，很容易三推。"},{"english":"The green slopes upward from front to back.","chinese":"果嶺斜坡從前至後向上延伸。"},{"english":"Middle of the green will usually end up with 2 putts .","chinese":"果嶺中間是個不錯的目標，可以2推進洞。"},{"english":"Mowing height and mowing type had magnificent different on affect green speed.","chinese":"修剪高度和修剪方式對果嶺球速的影響均極顯著。"},{"english":"The green is large and well bunkered, so be sure and take aim at the right spot.","chinese":"果嶺很大，又被大沙坑包圍着，要確信朝右邊瞄準。"},{"english":"The green, pinched in the front by the penetrating bunkers, angles away from the golfers approach.","chinese":"通過滲透式沙坑擠壓在前方的果嶺進行近距離切球。"},{"english":"Also refers to one of the nine or eighteen areas between the tee and the green.","chinese":"也指球座和果嶺之間九個或十八個區域中的一個。"}],"related":[]}