{"definition":["bitter orange (Fructus aurantii) (used in TCM)"],"pinyin":["zhi3 qiao4"],"simplified":["枳壳"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"枳殼","characters":[{"definition":["(orange)\/hedge thorn"],"pinyin":["zhi3"],"word":"枳"},{"definition":["shell\/carapace\/crust (earth's crust etc)\/also pr. [ke2]"],"pinyin":["qiao4"],"word":"殼"}],"containing_words":[],"sentences":[{"english":"Objective To isolate and purify high-purity neohesperidin from Fructus Aurantii extract.","chinese":"目的從枳殼提取物中分離純化高純度新橙皮苷。"},{"english":"OBJECTIVE To establish the chemical pattern recognition method for the quality control of Fructus aurantii.","chinese":"目的初步建立中藥枳殼質量控制的模式識別方法方法。"},{"english":"ObjectiveTo establish a microwave-assisted extraction (MAE) method for the extraction of the naringin in Fructus Aurantii.","chinese":"目的建立乙醇微波輔助萃取枳殼中柚皮苷的提取方法。"},{"english":"Results Rhizoma atractylodis macrocephalae and Fructus Aurantii were identified by the TLC.","chinese":"結果薄層色譜法可以鑑別出白朮和枳殼。"},{"english":"CONCLUSION Above mentioned characters are obvious and can be used for the identification of Fructus Poncirus Trifliate.","chinese":"結論上述特徵明顯，可用於綠衣枳殼的鑑定。"},{"english":"Made from the extract of citrus aurantium, aka \"Bitter Orange\".","chinese":"從枳殼中的提取液，又稱“苦橙”。"},{"english":"Methods The volatile oil was obtained from PPFA by steam distillation.","chinese":"方法採用水蒸氣蒸餾法從枳殼中提取揮發油。"},{"english":"To explore the effect and advantage of Bupleurum Citrus Aurtantium Liqi Decoction from Laos Trauma Section on chest sprain.","chinese":"探討柴胡枳殼理氣湯對治療胸脅挫傷的療效及優勢。"},{"english":"Objective To screen out good strains for Jiangxi Fructus Aurantii.","chinese":"目的篩選地道藥材“江枳殼”優良類型。"},{"english":"Objective To establish a RP-HPLC method for the determination of naringin and neohesperidin in Fructus Aurantii.","chinese":"目的建立枳殼中柚皮苷和新橙皮苷含量測定的方法。"},{"english":"OBJECTIVE To identify Fructus Poncirus Trifliate.","chinese":"目的觀察綠衣枳殼的顯微鑑別。"}],"related":[]}