{"definition":["to sequester\/to seize (assets)\/to seal up\/to close down"],"pinyin":["cha2 feng1"],"simplified":["查封"],"rank":8409.0,"normalized_rank":0.1176528199459936,"fraction":0.000011027295910777216,"cumulative_fraction":0.91448994394674,"word":"查封","characters":[{"definition":["see 山查[shan1 zha1]","surname Zha","to research\/to check\/to investigate\/to examine\/to refer to\/to look up (e.g. a word in a dictionary)"],"pinyin":["Zha1","cha2","zha1"],"word":"查"},{"definition":["surname Feng","to confer\/to grant\/to bestow a title\/to seal\/classifier for sealed objects, esp. letters"],"pinyin":["Feng1","feng1"],"word":"封"}],"containing_words":[],"sentences":[{"english":"If you try to walk away from the mortgage, the bank will come after your personal assets.","chinese":"如果有人試圖賴賬，銀行便會查封他的個人資產。"},{"english":"They may seize and impound suspect products.","chinese":"他們可以查封並扣押可疑產品。"},{"english":"The 232-room hotel, which is almost empty, will be next.","chinese":"如今空置的有232房間的酒店也即將被查封。"},{"english":"All those underground plants that manufacture piratic CDs must be closed down.","chinese":"所有制造盜版光盤的地下工廠都必須查封。"},{"english":"What kind of evidence do you need to seize goods for patent infringement?","chinese":"在查封侵權產品時，上海海關需要什麼證據？"},{"english":"The tsarist government closed down the newspaper in December 1905.","chinese":"沙皇政府在1905年12月查封了這家報館。"},{"english":"Machine-gun posts were set up at important points, and the wireless stations were seized.","chinese":"要害地點都架設了機槍，無線電臺也被查封。"},{"english":"Did you feel that your work in those years was censored or otherwise inhibited?","chinese":"您覺得在那些年代您的作品受到審查或查封嗎？"},{"english":"They had come to repossess their goods.","chinese":"他們是來查封的。"},{"english":"Confiscate and seal income and silver gained by sale two?","chinese":"查封所得以及拍賣所得的銀兩呢？"},{"english":"Bailiffs need a certificate from the county court to seize goods for rent arrears.","chinese":"查封官需要有郡法院的證明才能沒收貨物以抵欠租。"},{"english":"This is a log of user blocking and unblocking actions .","chinese":"這裏記錄了用戶進行查封和解封的操作。"},{"english":"The new air conditioner is getting into the air, a small amount of CFCs has been sealed.","chinese":"新的空調已經進入到空氣，少量的氯氟化碳已被查封。"},{"english":"Talk The sysop ability to create range blocks is disabled.","chinese":"只有管理員才能創建禁止查封的範圍。"},{"english":"The sysop ability to create range blocks is disabled.","chinese":"只有管理員才能創建禁止查封的範圍。"}],"related":[{"definition":["to detain\/to hold in custody\/to distrain\/to seize property"],"pinyin":["kou4 ya1"],"word":"扣押"},{"definition":["to seize\/to confiscate"],"pinyin":["cha2 kou4"],"word":"查扣"},{"definition":["(of a perpetrator, victim, weapon, sum of money etc) to be involved in the case"],"pinyin":["she4 an4"],"word":"涉案"},{"definition":["to investigate thoroughly\/to carefully inspect\/to verify\/to ferret out (undesirable elements)"],"pinyin":["qing1 cha2"],"word":"清查"},{"definition":["to order\/to enjoin\/to charge\/to instruct sb to finish sth"],"pinyin":["ze2 ling4"],"word":"責令"},{"definition":["to transfer (a case, a person, files etc)"],"pinyin":["yi2 song4"],"word":"移送"},{"definition":["legal (proceedings)\/according to law"],"pinyin":["yi1 fa3"],"word":"依法"},{"definition":["subpoena\/to summon (for questioning)"],"pinyin":["ju1 chuan2"],"word":"拘傳"},{"definition":["to register (to an official organism)\/to file a case (for investigation)"],"pinyin":["li4 an4"],"word":"立案"},{"definition":["to file for investigation\/to prosecute (a case)"],"pinyin":["li4 an4 zhen1 cha2"],"word":"立案偵查"},{"definition":["to recover (stolen property)\/to pursue and force sb to give back the spoils"],"pinyin":["zhui1 jiao3"],"word":"追繳"},{"definition":["unlicensed business activity"],"pinyin":["wu2 zhao4 jing1 ying2"],"word":"無照經營"},{"definition":["to investigate and handle (a criminal case)"],"pinyin":["cha2 chu3"],"word":"查處"},{"definition":["to detain\/to arrest\/to hold\/to confiscate"],"pinyin":["kou4 liu2"],"word":"扣留"},{"definition":["person who has failed to fulfill a court order"],"pinyin":["bei4 zhi2 xing2 ren2"],"word":"被執行人"},{"definition":["to detain (a prisoner)\/to keep sb in custody"],"pinyin":["ju1 liu2"],"word":"拘留"}]}