{"definition":["to investigate and handle (a criminal case)"],"pinyin":["cha2 chu3"],"simplified":["查处"],"rank":2539.0,"normalized_rank":0.035523904131630125,"fraction":0.00005859162400408116,"cumulative_fraction":0.7662963229892773,"word":"查處","characters":[{"definition":["see 山查[shan1 zha1]","surname Zha","to research\/to check\/to investigate\/to examine\/to refer to\/to look up (e.g. a word in a dictionary)"],"pinyin":["Zha1","cha2","zha1"],"word":"查"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"Land acquisition and demolition of illegal behavior, according to the law severely punished.","chinese":"對違法違規徵地拆遷行爲，依法依規嚴肅查處。"},{"english":"The relevant department or entity shall do so in accordance with the law and give the woman a reply.","chinese":"有關部門或者單位應當依法查處，並予以答覆。"},{"english":"We will tighten oversight for production safety in accordance with the law and investigate and prosecute cases involving industrial accidents to the full extent of the law.","chinese":"要依法加強監管，嚴肅查處安全生產事故。"},{"english":"One is investigating the development and construction of the illegal acts.","chinese":"一是依法查處開發建設中的違法違規行爲。"},{"english":"We will make investigating and prosecuting major violations of the law and discipline an important task in the ?ght against corruption.","chinese":"要把查處違法違紀大案要案，作爲反腐敗的重要任務。"},{"english":"In current, the work of handle the public order was existed some problems.","chinese":"當前，治安案件查處工作存在諸多問題。"},{"english":"Officials should be shamed into stopping their friends from stealing or wasting water.","chinese":"政府高官要嚴肅查處偷水浪費水的現象。"},{"english":"After the holiday, the National Tourism Bureau released the exposure typical cases investigated.","chinese":"節後，國家旅遊局將曝光公佈典型案例查處情況。"},{"english":"Gioia says that action must now be taken to find and deal with the major West African sources of the pollutants.","chinese":"驕雅說必須採取行動查處非洲西海岸氯聯苯污染源。"},{"english":"The administrative department of industry and commerce with the ban \"black bars.\"","chinese":"積極配合工商行政管理部門查處取締“黑網吧”。"},{"english":"We will conduct in-depth investigations into cases of dereliction of duty and corruption related to production safety and severely punish the responsible parties.","chinese":"嚴肅查處安全生產領域的失職瀆職和腐敗問題。"},{"english":"Measurement of punishment in dealing with public order cases is the application of discretion.","chinese":"治安案件查處中的量罰是自由裁量權的運用。"},{"english":"Acceleromater, preamplifier and display are installed in a pocket-size vibration mete.","chinese":"前置放大器和顯示安裝在口袋大小的振動查處。"},{"english":"The police has worked out how the thieves entered that building.","chinese":"警察已經查處小偷是怎麼進入那座大樓了。"},{"english":"We should promptly investigate and prosecute major cases of sabotage against the order of the market economy.","chinese":"抓緊查處嚴重破壞市場經濟秩序的大案要案。"},{"english":"And urges the Administrative law enforcement organ to investigate the illegal management behavior legally.","chinese":"並促使行政執法機關依法查處違法經營行爲。"}],"related":[{"definition":["to violate (rules)\/irregular\/illegal\/corrupt"],"pinyin":["wei2 gui1"],"word":"違規"},{"definition":["illegal\/to break the law"],"pinyin":["wei2 fa3"],"word":"違法"},{"definition":["to enforce a law\/law enforcement"],"pinyin":["zhi2 fa3"],"word":"執法"},{"definition":["to lodge an accusation\/accusation (law)"],"pinyin":["gao4 fa1"],"word":"告發"},{"definition":["public security bureau"],"pinyin":["gong1 an1 ji1 guan1"],"word":"公安機關"},{"definition":["administrative region"],"pinyin":["xia2 qu1"],"word":"轄區"},{"definition":["to suppress\/to crack down on\/to prohibit"],"pinyin":["qu3 di4"],"word":"取締"},{"definition":["to investigate (as detective)\/to solve (crime)\/to uncover (a plot)\/to sniff out\/to break in and analyze\/detective work\/to scout"],"pinyin":["zhen1 po4"],"word":"偵破"},{"definition":["to penalize\/to punish"],"pinyin":["chu3 fa2"],"word":"處罰"},{"definition":["to discipline sb\/to punish\/disciplinary action\/to deal with (a matter)\/CL:個|个[ge4]"],"pinyin":["chu3 fen4"],"word":"處分"},{"definition":["lack of discipline\/to break a rule\/to violate discipline\/to breach a principle"],"pinyin":["wei2 ji4"],"word":"違紀"},{"definition":["to implement\/to carry out\/to execute\/to run"],"pinyin":["zhi2 xing2"],"word":"執行"},{"definition":["to track down and seize (a criminal suspect, contraband etc)"],"pinyin":["cha2 huo4"],"word":"查獲"},{"definition":["to prosecute (criminal)\/the prosecution"],"pinyin":["jian3 kong4"],"word":"檢控"},{"definition":["sudden unannounced investigation\/on-the-spot inspection\/to search without notification"],"pinyin":["tu1 ji1 jian3 cha2"],"word":"突擊檢查"},{"definition":["special\/dedicated"],"pinyin":["zhuan1 xiang4"],"word":"專項"}]}