{"definition":["to check\/to tally\/to inventory"],"pinyin":["cha2 dian3"],"simplified":["查点"],"rank":52808.0,"normalized_rank":0.738852433786185,"fraction":1.0612573472862467e-7,"cumulative_fraction":0.9993087682010586,"word":"查點","characters":[{"definition":["see 山查[shan1 zha1]","surname Zha","to research\/to check\/to investigate\/to examine\/to refer to\/to look up (e.g. a word in a dictionary)"],"pinyin":["Zha1","cha2","zha1"],"word":"查"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[],"sentences":[{"english":"This form will shut down a single database by performing a final checkpoint.","chinese":"該形式將通過執行最後的檢查點來關閉單個數據庫。"},{"english":"Research on Checking of DLG Data Quality Based on Rules;","chinese":"對更改過的數據庫進行檢查點操作。"},{"english":"When they did, it was Jonathan and his armor-bearer who were not there.","chinese":"他們一查點，就知道約拿單和拿兵器的人沒有在這裏。"},{"english":"Racers must obey rules given by the checkpoint managers.","chinese":"參賽者必須聽檢查點負責人的話。"},{"english":"When the secondary encounters a checkpoint, it enters a buffering mode.","chinese":"當次要服務器遇到檢查點時，它將進入一種緩衝模式。"},{"english":"This paper makes use of checkpoint method and profile method to evaluate the accuracy of DEM.","chinese":"本文采用檢查點法和剖面法對DEM進行精度評價。"},{"english":"Checkpoints are not blocked by the defragmenter.","chinese":"檢查點沒有被碎片整理程序阻塞。"},{"english":"We emphasize on the HA technique of Checkpoint and Process Migration.","chinese":"着重討論了檢查點和進程遷移兩大高可用技術。"},{"english":"Currently, the exit probe point is supported for system calls only.","chinese":"當前，對於系統調用，只支持出口探查點。"},{"english":"You no longer have to set any checkpoint-related parameters.","chinese":"不再需要設置任何與檢查點相關的參數。"},{"english":"A comprehensive list of project deliverables for each checkpoint.","chinese":"每個檢查點的項目可交付性的綜合列表。"},{"english":"The car won the race, but its driver came close to being killed.","chinese":"那輛車贏了比賽，但駕駛員查點被撞死。"},{"english":"The result of the stop-and-copy phase is a checkpoint in itself.","chinese":"停止與複製階段的結果本身就是一個檢查點。"},{"english":"You can also use the last checkpoint to show the complete integration scenario.","chinese":"您也可以使用最後一個檢查點來顯示整個集成場景。"},{"english":"I almost forgot to tell you about the all-day volleyball tournament going on .","chinese":"我查點忘了告訴你現在全天都在舉行排球錦標賽。"},{"english":"Several were visibly coordinating with military officers, even setting up joint military-civilian checkpoints.","chinese":"有些明顯與軍官合作，甚至設立了軍民檢查點。"}],"related":[]}