{"definition":["Tsaidam or Qaidam basin (Mongolian: salt marsh), depression northeast of the Plateau of Tibet, located between the Qilian Shan and the Kunlun Shan at the northern margin of the Tibetan Plateau."],"pinyin":["Chai2 da2 mu4"],"simplified":["柴达木"],"rank":40371.0,"normalized_rank":0.5648426678605907,"fraction":3.7151306036361743e-7,"cumulative_fraction":0.9966291100406128,"word":"柴達木","characters":[{"definition":["firewood\/lean (of meat)\/thin (of a person)","surname Chai"],"pinyin":["Chai2","chai2"],"word":"柴"},{"definition":["surname Da","to attain\/to reach\/to amount to\/to communicate\/eminent"],"pinyin":["Da2","da2"],"word":"達"},{"definition":["surname Mu","tree\/wood\/coffin\/wooden\/simple\/numb\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Mu4","mu4"],"word":"木"}],"containing_words":[{"definition":["Tsaidam or Qaidam basin (Mongolian: salt marsh), depression northeast of the Plateau of Tibet, located between the Qilian Shan and the Kunlun Shan at the northern margin of the Tibetan Plateau."],"pinyin":["Chai2 da2 mu4 pen2 di4"],"word":"柴達木盆地"}],"sentences":[{"english":"A large portion of the eastern Salt Lake, Mongolian Qaidam meaning that the salt marshes.","chinese":"東部爲大片鹽湖，蒙古語柴達木即鹽澤之意。"},{"english":"Sebei gas field at the Qaidam is a typical water loose sandstone gas reservoir.","chinese":"柴達木盆地的澀北氣田是典型的有水疏鬆砂岩氣藏。"},{"english":"Qaidam Basin undergoes multi-period tectonic deformation.","chinese":"柴達木盆地經歷了多期構造變形。"},{"english":"Aim To analyze Tertiary period sedimentary environment of Qaidamu saline lake.","chinese":"目的分析柴達木盆地第三紀鹽湖的沉積環境。"},{"english":"Widest point in between Jiuquan and the Qaidam Basin, up to 300 km.","chinese":"最寬處在酒泉與柴達木盆地之間，達300公里。"},{"english":"Changing the motion state of Tarim Basin and Qaidam Basin.","chinese":"改變了塔里木和柴達木盆地的運動狀態。"},{"english":"Qarhan Salt Lake is a typical closed lake in the dry Qaidam basin.","chinese":"柴達木盆地的察爾汗鹽湖是典型的乾旱地區封閉湖泊。"},{"english":"In the present paper, the hypoglycemic effect of fruit of Nitraria tangutorum Bobr.","chinese":"研究青海柴達木盆地唐古特白刺果實的降血糖作用。"},{"english":"Qaidam Basin as a whole, it is a desert scene.","chinese":"對於整個柴達木盆地，它是一片沙漠景象。"},{"english":"Qinghai-Tibetan Plateau, one of the dust source regions in Asia, plays an important role in long-range dust transportation.","chinese":"柴達木盆地是青藏高原粉塵源區的重要組成之一。"},{"english":"Widest point in Jiuquan City and between the Qaidam Basin, 300 km.","chinese":"最寬處在酒泉市與柴達木盆地之間，達300千米。"}],"related":[]}