{"definition":["grid\/lattice\/raster"],"pinyin":["shan1 ge2"],"simplified":["栅格"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"柵格","characters":[{"definition":["fence\/also pr. [shan1]"],"pinyin":["zha4"],"word":"柵"},{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"}],"containing_words":[],"sentences":[{"english":"Imagine a tick-tack-toe grid in your viewfinder.","chinese":"想象取景器中一點一點移動的柵格。"},{"english":"Raster-based data formats tend to behave much more like images.","chinese":"基於柵格的數據格式更類似於圖像。"},{"english":"Instead they use materials with lattice structures for both positive and negative electrodes.","chinese":"取而代之的是在正極和負極上使用柵格結構材料。"},{"english":"Change its color to a pinkish orange then rasterize all three shapes.","chinese":"改變它的顏色粉紅橙色然後柵格三種外形。"},{"english":"The comparisons between computation and experimental data are made, and the detailed flow structure near grid fin is shown and examined.","chinese":"計算與實驗數據以及柵格翼附近流場結構進行了比較。"},{"english":"New firmware for the DP1 adds composition grids for most shooting modes, too.","chinese":"DP1的新固件在大多數拍攝模式中增加了柵格結構。"},{"english":"Right-click on the layer and click Rasterize Type.","chinese":"右鍵圖層然後點擊柵格化文字。"},{"english":"Chaos grid pre-processing model (CGPM) is constructed based on chaotic theory.","chinese":"基於混沌過程理論構造混沌柵格預處理模型。"},{"english":"How to convert GIS rasters into vector polygons?","chinese":"如何將GIS柵格到矢量多邊形？"},{"english":"The high voltage difference between the two pairs of grids powerfully accelerates the extracted ions.","chinese":"兩幅柵格電壓的巨大差別可以大幅加速提取的離子。"},{"english":"Layouts based on grids are not appropriate in all cases.","chinese":"基於柵格的版式設計並非適用於一切案例。"},{"english":"Many of the pages that you see everyday have a grid.","chinese":"你日常所見的許多頁面都有柵格存在。"},{"english":"The gratings were made from boxwood.","chinese":"柵格是由黃楊製作的。"},{"english":"The overnight grid also offers a way to trade morning gaps.","chinese":"隔夜柵格同時給出了一個在早晨缺口處交易的方法。"},{"english":"Or use different grids for feature material and regular recurring departments.","chinese":"或是爲特別專題和常規內容使用不同的柵格。"},{"english":"The second structure seems to be some kind of giant targeting grid, also north of the Shule river.","chinese":"這座構造體似乎是某種瞄準柵格，也在疏勒河北面。"}],"related":[]}