{"definition":["gate\/door with grating\/turnstile\/logical gate (electronics)"],"pinyin":["zha4 men2"],"simplified":["栅门"],"rank":51444.0,"normalized_rank":0.7197683041148406,"fraction":1.2305913944460886e-7,"cumulative_fraction":0.9991525106837356,"word":"柵門","characters":[{"definition":["fence\/also pr. [shan1]"],"pinyin":["zha4"],"word":"柵"},{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["Men2","men2"],"word":"門"}],"containing_words":[],"sentences":[{"english":"A handsome grilled gateway opens to the garden of all desired things.","chinese":"通向渴望之園的那扇富麗堂皇的格柵門大敞開着。"},{"english":"Introduced the injection mold structure of the plastic products of the air chute fence gate.","chinese":"介紹了通風道柵門塑料產品的注射模結構。"},{"english":"What prints did you see by the moor gate?","chinese":"你在柵門處看到了什麼痕跡？"},{"english":"We walked through the gate of the picket fence and proceeded to look around.","chinese":"我們走過尖樁籬柵門，四處觀望。"},{"english":"She reached a turnpike-gate which stood upon the highway to the village.","chinese":"她走到了通向村子的那條大道的收稅柵門。"},{"english":"After he passed the gate, only toe prints could be seen.","chinese":"但過了柵門之後，則只能看到他腳趾的印記了。"},{"english":"Children laughed inside their gates.","chinese":"小孩在木柵門裏笑。"},{"english":"Help a lame dog over a stile.","chinese":"幫助跛足的狗越過柵門。"},{"english":"He jumped over the gate into the field.","chinese":"他跳過柵門進入田野。"},{"english":"Were they on the same side of the path as the moor gate?","chinese":"是在與開向沼地的柵門同一路邊上嗎？"},{"english":"The sheepdog rounded up the sheep and drove them through the gate.","chinese":"牧羊犬把羊攆到了一起，把它們趕過柵門。"},{"english":"I heard a voice at the turnstile I had not heard for many years.","chinese":"我聽到在旋轉柵門那兒有一個多年沒有聽到的嗓聲。"}],"related":[]}