{"definition":["suppository"],"pinyin":["shuan1 ji4"],"simplified":["栓剂"],"rank":53378.0,"normalized_rank":0.7468274733116002,"fraction":9.897283101239e-8,"cumulative_fraction":0.9993672134095016,"word":"栓劑","characters":[{"definition":["bottle stopper\/plug\/(gun) bolt\/(grenade) pin"],"pinyin":["shuan1"],"word":"栓"},{"definition":["dose (medicine)"],"pinyin":["ji4"],"word":"劑"}],"containing_words":[{"definition":["glycerine suppository"],"pinyin":["gan1 you2 shuan1 ji4"],"word":"甘油栓劑"}],"sentences":[{"english":"ObjectiveTo study the therapeutic efficacy of diclofenac sodium suppositories in renal colic caused by calculus.","chinese":"目的瞭解雙氯芬酸鈉栓劑對結石性腎絞痛的治療效果。"},{"english":"METHODS To study the preparation and establish the quality standard of the pessary .","chinese":"方法研究該栓劑的製備方法，建立質量標準和穩定性。"},{"english":"OBJECTIVE To develop the preparation of ornidazole suppository and establish the quality standard.","chinese":"目的建立奧硝唑栓劑的製備方法及質量控制標準。"},{"english":"Objective To prepare ornidazole suppository and establish the quality standard for the treatment of periodontitis.","chinese":"目的製備奧硝唑牙科用栓劑，並建立質量控制標準。"},{"english":"How do I use this suppositories?","chinese":"我怎樣用這些栓劑呢？"},{"english":"The TZGZR suppositories vacuum emulsifier is evaluated the city level technological award.","chinese":"的TZGZR栓劑真空乳化評價城市一級的技術獎。"},{"english":"Econazole nitrate in the microcapsule had a slower release rate than that in the suppository.","chinese":"與栓劑相比，硝酸益康唑微膠囊釋放速度緩慢。"},{"english":"Suppositories are known to be the most effective choice.","chinese":"栓劑是目前爲止最有效用哦。"},{"english":"OBJECTIVE The paper was studied on the production and quality management of compound ornidazole suppository .","chinese":"目的研究複方奧硝唑栓劑的製備及質量控制標準。"},{"english":"Objective To study the toxic effects of compound tinidazole suppository on domestic rabbits.","chinese":"目的研究複方替硝唑栓劑對家兔的毒性作用。"},{"english":"To prepare different bases of rifampicin(RFP) suppositories and to check its quality.","chinese":"製備不同基質的利福平栓劑並進行質量考察。"},{"english":"Objective To study the anti-diarrhea effect of Lucao suppository.","chinese":"目的研究律草栓劑的止瀉作用。"},{"english":"Conclusion Lucao suppository has obvious anti-diarrhea effect.","chinese":"結論律草栓劑有明顯的止瀉作用。"},{"english":"Objective Determine antibacterial activity and the clinical significance in vitro of compound tinidazole suppository.","chinese":"目的測定複方替硝唑栓劑的體外抗菌活性及臨牀意義。"},{"english":"How do I use this suppository?","chinese":"我怎樣用這栓劑？"},{"english":"Conclusion The standard of quality can control the quality of suppository.","chinese":"結論質量標準可以有效控制栓劑的質量。"}],"related":[]}