{"definition":["to check\/to examine"],"pinyin":["jiao4 yan4"],"simplified":["校验"],"rank":31371.0,"normalized_rank":0.4389209911435088,"fraction":8.342621375159424e-7,"cumulative_fraction":0.9914583044097828,"word":"校驗","characters":[{"definition":["school\/military officer\/CL:所[suo3]","to proofread\/to check\/to compare"],"pinyin":["jiao4","xiao4"],"word":"校"},{"definition":["to examine\/to test\/to check"],"pinyin":["yan4"],"word":"驗"}],"containing_words":[{"definition":["check digit"],"pinyin":["jiao4 yan4 ma3"],"word":"校驗碼"}],"sentences":[{"english":"Pressure gauge shall be calibrated before test and witness of owner.","chinese":"試驗用的壓力錶，試驗前應在船東的監督下校驗。"},{"english":"The current calibration status of critical equipment should be known and verifiable.","chinese":"應當知道並可證實關鍵設備的當前校驗狀態。"},{"english":"A checksum is a simple way to compute a single number representing a larger block of data.","chinese":"校驗就是基於一大塊的數據來計算出一個數字。"},{"english":"It is used to set baud rate, parity check, number of data bits, stop bit.","chinese":"它是用來設置波特率，奇偶校驗，數據位數，停止位。"},{"english":"Development of virtual instrument based calibrator for electronic current transformer.","chinese":"基於虛擬儀器的電流互感器校驗儀的研製。"},{"english":"Character type 8 digit data, no verification, 1 stop bit.","chinese":"字符格式8數據位，無校驗，1停止位。"},{"english":"The low-density parity-check codes constructed by the proposed method have a good structure.","chinese":"採用這一方法構造的低密度校驗碼具有良好的結構。"},{"english":"Verify if the checksums match the original data.","chinese":"檢查校驗和是否匹配原來的數據。"},{"english":"Check calibration strikers before using all equipment.","chinese":"使用儀器設備前檢查校驗標籤。"},{"english":"You have to pay for a company to verify who you are and to issue a certificate.","chinese":"您必須向公司支付費用來校驗和發佈證書。"},{"english":"A binary check digit; for example, a parity bit.","chinese":"一個二進位校驗位元，例如奇偶位。"},{"english":"Have all gages been dimensionally certified?","chinese":"所有量具是否都有校驗？"},{"english":"There is considerably less chance of an even-numbered error that eludes the B2 parity calculation.","chinese":"有偶數不到B2奇偶校驗計算的錯誤的機會大大減少。"},{"english":"Checksum intake valve and bypass valve.","chinese":"校驗進氣閥和旁通閥。"},{"english":"Create a simple report that lists each class file and its corresponding checksum.","chinese":"創建簡單的報告，列出每個類文件及其對應的校驗和。"},{"english":"HDLC specifies a data encapsulation method on synchronous serial links using frame characters and checksums.","chinese":"使幀特性幀校驗序連接指種數據封裝。"}],"related":[]}