{"definition":["nuclear nations"],"pinyin":["he2 guo2 jia1"],"simplified":["核国家"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"核國家","characters":[{"definition":["pit\/stone\/nucleus\/nuclear\/to examine\/to check\/to verify"],"pinyin":["he2"],"word":"核"},{"definition":["country\/nation\/state\/national\/CL:個|个[ge4]","surname Guo"],"pinyin":["Guo2","guo2"],"word":"國"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[{"definition":["nuclear weapon states"],"pinyin":["you3 he2 guo2 jia1"],"word":"有核國家"},{"definition":["civil nuclear power"],"pinyin":["min2 yong4 he2 guo2 jia1"],"word":"民用核國家"},{"definition":["non-nuclear country"],"pinyin":["fei1 he2 guo2 jia1"],"word":"非核國家"}],"sentences":[{"english":"They should play an active role in helping nuclear-armed states disarm. There are many ways for them to collaborate","chinese":"它們應發揮積極作用，幫助有核國家裁軍。"},{"english":"Several proposals call for every nuclear country to join in.","chinese":"有幾項建議號召每個核國家都加入進來。"},{"english":"Furthermore, possessors are the preferred targets for terrorism and theft.","chinese":"而且，有核國家是恐怖主義分子和盜竊者偏愛的目標。"},{"english":"Chinese Government undertakes non-use of nuclear weapons against non-nuclear countries .","chinese":"中國政府承諾不對無核國家使用核武器。"},{"english":"The Islamic Republic of Iran is determined to become the world's tenth nuclear power.","chinese":"伊朗伊斯蘭共和國決心要成爲世界上第十個有核國家。"},{"english":"The Chinese government undertakes non-use of nuclear weapons against nonnuclear countries.","chinese":"中國政府承諾不對無核國家使用核武器。"},{"english":"During this visit, will Premier Wen acknowledge India as a nuclear country?","chinese":"訪問期間，溫總理會不會承認印度的核國家地位？"},{"english":"The margin of the superpowers over non-nuclear states had been widening .","chinese":"超級大國和非核國家之間的差距逐漸擴大了。"},{"english":"The non-nuclear weapon states also have a responsibility to work to prevent further proliferation.","chinese":"無核國家也有責任爲防止進一步的擴散而進行努力。"},{"english":"By all accounts, India has been a responsible nuclear power.","chinese":"大家一致認爲，印度已是一個負責任的有核國家。"}],"related":[]}