{"definition":["core\/nucleus"],"pinyin":["he2 xin1"],"simplified":["核心"],"rank":921.0,"normalized_rank":0.012885984917381391,"fraction":0.00017155611859593365,"cumulative_fraction":0.6068296348309677,"word":"核心","characters":[{"definition":["pit\/stone\/nucleus\/nuclear\/to examine\/to check\/to verify"],"pinyin":["he2"],"word":"核"},{"definition":["heart\/mind\/intention\/center\/core\/CL:顆|颗[ke1],個|个[ge4]"],"pinyin":["xin1"],"word":"心"}],"containing_words":[],"sentences":[{"english":"Engage your core muscles, then curl your upper body towards a sitting position.","chinese":"調動人體核心部位的肌肉力量向上擡體，成坐姿。"},{"english":"Chapter 4 DC Metadata Application Projection Study It studies Nordic metadata project.","chinese":"第四章都柏林核心元數據應用項目研究。"},{"english":"Mr. Kallasvuo said maps and navigation will be at the heart of the company's connection services.","chinese":"康培凱說，地圖和導航將是公司連接服務的核心。"},{"english":"A key part of the program hasbeen to commercialize outstanding health science technologies from themedical colleges.","chinese":"專業的核心是將醫學院校的生命科學技術商品化。"},{"english":"Is no substitute for showing off the core of her unique style.","chinese":"是否展露了無可取代的獨特風格纔是核心所在。"},{"english":"But in future chips, cores’ bandwidth requirements could fluctuate wildly.","chinese":"但在未來芯片中，核心的帶寬需求會劇烈波動。"},{"english":"Capital structure is the core of financial structure.","chinese":"資本結構是企業財務結構的核心內容。"},{"english":"Permafrost problems are the core of the three principal technical difficulties in the Qinghai-Tibet railway construction.","chinese":"青藏鐵路建設三大技術難題的核心是凍土問題。"},{"english":"We should establish a customer demands value-driven distribution intellectual model.","chinese":"應建立以顧客的需求價值爲核心的營銷心智模式。"},{"english":"The scout with shoulder-straps shouted on the outermost route as a routine.","chinese":"戴肩章的偵查員按例在最核心的線路上叫嚷。"},{"english":"Of long standing, Confucianism is the core of Chinese Culture.","chinese":"儒家思想淵遠流長，構成中國民族文化的核心。"},{"english":"So the owner must pay attention to this, to control cost in construction stage consciously.","chinese":"工程結算支付是承包工程合同管理的核心。"},{"english":"Its core is formed by two hubs that have a five-ringed structure at their core.","chinese":"它的中心是由兩枚以五環結構爲核心的輪轂組成。"},{"english":"Nobility and dignity of people is the core values of humanitarian.","chinese":"人的高貴和尊嚴是人道主義的核心價值。"},{"english":"Equal competition is the core of market order.","chinese":"平等競爭是市場秩序的核心。"},{"english":"And I'm convinced self-depreciation goes right to the heart of our financial ruts.","chinese":"我確信自我貶值促成了我們理財習慣的核心。"}],"related":[{"definition":["system\/setup\/CL:個|个[ge4]"],"pinyin":["ti3 xi4"],"word":"體系"},{"definition":["cornerstone"],"pinyin":["ji1 shi2"],"word":"基石"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["important point\/main point\/focus\/key (project etc)\/to focus on\/to put the emphasis on","to recount (e.g. results of election)\/to re-evaluate"],"pinyin":["chong2 dian3","zhong4 dian3"],"word":"重點"},{"definition":["crucial point\/crux\/CL:個|个[ge4]\/key\/crucial\/pivotal"],"pinyin":["guan1 jian4"],"word":"關鍵"},{"definition":["to revolve around\/to center on (an issue)"],"pinyin":["wei2 rao4"],"word":"圍繞"},{"definition":["main\/principal\/major\/primary"],"pinyin":["zhu3 yao4"],"word":"主要"},{"definition":["base\/foundation\/basis\/underlying\/CL:個|个[ge4]"],"pinyin":["ji1 chu3"],"word":"基礎"},{"definition":["axle\/(fig.) central element\/key element\/axis (alliance of nations)"],"pinyin":["zhou2 xin1"],"word":"軸心"},{"definition":["leading\/dominant\/prevailing\/to lead\/to direct\/to dominate"],"pinyin":["zhu3 dao3"],"word":"主導"},{"definition":["carrier (chemistry)\/vector (epidemiology)\/vehicle or medium"],"pinyin":["zai4 ti3"],"word":"載體"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["part\/component\/ingredient\/constituent"],"pinyin":["zu3 cheng2 bu4 fen4"],"word":"組成部分"},{"definition":["therefore\/thus\/so"],"pinyin":["shi4 yi3"],"word":"是以"},{"definition":["to orientate\/to position\/to categorize (as)\/to characterize (as)\/positioning\/position\/niche"],"pinyin":["ding4 wei4"],"word":"定位"},{"definition":["of the utmost importance\/of highest priority"],"pinyin":["zhong4 zhong1 zhi1 zhong4"],"word":"重中之重"}]}