{"definition":["ribosome"],"pinyin":["he2 tang2 ti3"],"simplified":["核糖体"],"rank":65217.0,"normalized_rank":0.9124704433842149,"fraction":1.5181673193640945e-8,"cumulative_fraction":0.999956899229802,"word":"核糖體","characters":[{"definition":["pit\/stone\/nucleus\/nuclear\/to examine\/to check\/to verify"],"pinyin":["he2"],"word":"核"},{"definition":["sugar\/sweets\/candy\/CL:顆|颗[ke1],塊|块[kuai4]"],"pinyin":["tang2"],"word":"糖"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[],"sentences":[{"english":"If ribosomes depended on proteins to function, that would have been a paradox.","chinese":"如果核糖體依靠蛋白質起作用，那會變成一個悖論。"},{"english":"The molecular evolution of ribosome-inactivating protein gene family in Momordica charantia L.","chinese":"探討苦瓜核糖體失活蛋白基因家族分子演化之研究。"},{"english":"Here you can see a particulate organelle called the ribosome.","chinese":"在這裏您可以看到一個名爲顆粒細胞的核糖體。"},{"english":"They are the sites of action of many antibiotics that inhibit protein biosynthesis.","chinese":"細菌核糖體是許多抗生素抑制蛋白質合成的作用點。"},{"english":"The blueprints are transformed into living matter through the work of structures called ribosomes.","chinese":"這些藍圖通過被稱爲核糖體的結構轉化成生命體。"},{"english":"As a result, the ribosome produces only viral proteins.","chinese":"結果，核糖體產生了只有過濾性毒菌的蛋白質。"},{"english":"Understanding ribosomes is important for a scientific understanding of life.","chinese":"瞭解核糖體對於科學地瞭解生命之源至關重要。"},{"english":"Yonath for having showed what the ribosome looks like and how it functions at the atomic level.","chinese":"爲了彰示核糖體是什麼樣的和它在原子層次的功能。"},{"english":"Without working ribosomes, bacteria cannot survive.","chinese":"沒有正常運作的核糖體，細菌就無法生存。"},{"english":"The answer, Dr. Berg said, is that the active core of the ribosome is made of RNA.","chinese":"答案就是核糖體的起作用的核心是由RNA組成的。"}],"related":[]}