{"definition":["nuclear facility\/nuclear installation"],"pinyin":["he2 she4 shi1"],"simplified":["核设施"],"rank":12295.0,"normalized_rank":0.17202300169294701,"fraction":0.0000058753075259390465,"cumulative_fraction":0.9456893440549516,"word":"核設施","characters":[{"definition":["pit\/stone\/nucleus\/nuclear\/to examine\/to check\/to verify"],"pinyin":["he2"],"word":"核"},{"definition":["to set up\/to arrange\/to establish\/to found\/to display"],"pinyin":["she4"],"word":"設"},{"definition":["surname Shi","to grant\/to give\/to bestow\/to act\/to carry out"],"pinyin":["Shi1","shi1"],"word":"施"}],"containing_words":[],"sentences":[{"english":"The South Korean Foreign Minister Kim Sung-hwan also said that he suspected that there were additional nuclear facilities in North Korea.","chinese":"韓國外交部長金星煥也懷疑朝鮮還有另外的核設施。"},{"english":"They also accused Heathfield of chatting up someone who worked at a U.S. nuclear facility.","chinese":"他們還指控希思菲爾德與美國核設施的工作人員搭訕。"},{"english":"North Korea has stated it will resume disablement of its nuclear facilities.","chinese":"北韓已經聲明將繼續核設施的去核化工作。"},{"english":"North Korea responded by reversing earlier steps it took to disable its primary nuclear facility at Yongbyon.","chinese":"爲此，北韓停止了先前拆除寧邊核設施的工作。"},{"english":"But he said there had been no leakage of radiation or radioactive material from nuclear facilities.","chinese":"但是他說，並沒有輻射或放射性物質從核設施中泄漏。"},{"english":"Both nuclear facilities are located above the water on coastal bluffs.","chinese":"兩座核設施都位於加州沿海斷崖上。"},{"english":"North Korea has been building a light-water reactor at its main Yongbyon nuclear complex since last year.","chinese":"朝鮮自去年起就在寧邊核設施建造一座輕水反應堆。"},{"english":"North Korean officials also demolished the cooling tower at the country's Yongbyon nuclear reactor.","chinese":"另外，北韓還炸燬了寧邊核設施的冷卻塔。"},{"english":"Russia helped build the facility.","chinese":"這座核設施也是在俄羅斯的幫助下才建成的。"},{"english":"Iran's newly-revealed nuclear facility is open for inspection by UN experts, the country's president has said.","chinese":"伊朗總統稱，伊朗新建核設施對聯合國專家開放視察。"},{"english":"The White House has described as \"regrettable\" the announcement by North Korea that it is reactivating nuclear power facilities.","chinese":"美國對朝鮮重新啓動核設施的宣告表示遺憾。"}],"related":[]}