{"definition":["to bring under permanent control\/to effect a radical cure"],"pinyin":["gen1 zhi4"],"simplified":["根治"],"rank":15993.0,"normalized_rank":0.22376281952625468,"fraction":0.0000036776143535326567,"cumulative_fraction":0.9629143049218262,"word":"根治","characters":[{"definition":["root\/basis\/classifier for long slender objects, e.g. cigarettes, guitar strings\/CL:條|条[tiao2]\/radical (chemistry)"],"pinyin":["gen1"],"word":"根"},{"definition":["to rule\/to govern\/to manage\/to control\/to harness (a river)\/to treat (a disease)\/to wipe out (a pest)\/to punish\/to research"],"pinyin":["zhi4"],"word":"治"}],"containing_words":[],"sentences":[{"english":"There was no relapse after radical operation.","chinese":"行根治性手術切除後，未見覆發。"},{"english":"The first importand task in blindness prevention still is the dlimination of cataract blindness.","chinese":"防盲工作的首要任務仍是根治白內障盲。"},{"english":"Since 1990,46 patients have underwent surgical management of Tetralogy of Fallot.","chinese":"自1990年以來，共行法樂氏四聯症根治術46例。"},{"english":"The cure for triangulation is trust and intimacy.","chinese":"互相信任與親密無間是根治第三方捲入的良方。"},{"english":"Objective To investigate the clinical outcomes of total resection of lesser curvature used for radical treatment of distal gastric carcinoma.","chinese":"目的探討胃小彎全切術在遠端胃癌根治術中的應用。"},{"english":"To bring the pollution under permant coutrol, sustainable development strategy must be carried out.","chinese":"要實現淮河水污染的根治，必須實施可持續發展戰略。"},{"english":"Objective To discuss the long term curative effect of adjuvant FAM chemotherapy after radical operation of gastric carcinoma.","chinese":"目的探討胃癌根治術後應用輔助化療患者的遠期療效。"},{"english":"Objective To explore the methods and experience of radical therapy of central arteriovenous malformation of the jaw.","chinese":"目的探討下頜骨動靜脈畸形的根治性治療方法和經驗。"},{"english":"Neoadjuvant radio (chemo-) therapy is the best option in order to realize a radical resection.","chinese":"新輔助放化療是實行根治切除的最好選擇。"},{"english":"How to effect a radical cure paronychia ?","chinese":"如何根治甲溝炎？"},{"english":"The discovery of a vaccine was the turning point in the fight against smallpox.","chinese":"牛痘苗的發現是根治天花的關鍵。"},{"english":"Methods Primary radical surgical procedure was applied in the treatment of 91 cases with perianal abscess.","chinese":"方法採用一次性根治術治療肛周膿腫91例。"},{"english":"To study the effect of single lung ventilation for esophagectomy in the treatment of esophageal cancer patients.","chinese":"目的研究單肺通氣用於食管癌根治術時對病人的影響。"},{"english":"The key to rooting out corruption lies in the perfection of legal system and the strengthening of cultural construction.","chinese":"根治腐敗的關鍵在於健全法制，加強制度和文化建設。"},{"english":"How to effect a radical cure fibroma?","chinese":"如何根治纖維瘤？"},{"english":"There is no radical cure for cancer.","chinese":"現在還沒有根治癌症的辦法。"}],"related":[{"definition":["to eradicate"],"pinyin":["gen1 chu2"],"word":"根除"},{"definition":["ineradicable disease\/fig. deep-seated problem\/perennial problem"],"pinyin":["wan2 ji2"],"word":"頑疾"},{"definition":["to treat the symptoms but not the root cause"],"pinyin":["zhi4 biao1 bu4 zhi4 ben3"],"word":"治標不治本"},{"definition":["stubborn illness\/disease that is difficult to treat"],"pinyin":["wan2 zheng4"],"word":"頑症"},{"definition":["to treat only the symptoms but not the root cause"],"pinyin":["zhi4 biao1"],"word":"治標"},{"definition":["to cure"],"pinyin":["zhi4 hao3"],"word":"治好"},{"definition":["to take radical measures\/to get to the root (of a problem etc)"],"pinyin":["zhi4 ben3"],"word":"治本"},{"definition":["to recur (of a disease)\/to reappear\/to relapse (into a former bad state)"],"pinyin":["fu4 fa1"],"word":"復發"},{"definition":["effective medicine for a specific condition\/highly effective medicine"],"pinyin":["te4 xiao4 yao4"],"word":"特效藥"},{"definition":["to treat (an illness)\/medical treatment\/therapy"],"pinyin":["zhi4 liao2"],"word":"治療"},{"definition":["to rule\/to govern\/to manage\/to control\/to harness (a river)\/to treat (a disease)\/to wipe out (a pest)\/to punish\/to research"],"pinyin":["zhi4"],"word":"治"},{"definition":["illness\/CL:場|场[chang2]\/disease\/to fall ill\/defect"],"pinyin":["bing4"],"word":"病"},{"definition":["correct diagnosis\/to prescribe the right cure for an illness\/to suit the medicine to the illness"],"pinyin":["dui4 zheng4"],"word":"對症"},{"definition":["disease\/illness"],"pinyin":["bing4 zheng4"],"word":"病症"},{"definition":["cause of disease\/pathogen"],"pinyin":["bing4 yin1"],"word":"病因"},{"definition":["to treat (an illness)\/medical treatment"],"pinyin":["yi1 zhi4"],"word":"醫治"}]}