{"definition":["forms of versification\/conventions regarding set number of words and lines, choice of tonal patterns and rhyme schemes for various types of Classical Chinese poetic composition\/metrical verse"],"pinyin":["ge2 lu:4"],"simplified":["格律"],"rank":45151.0,"normalized_rank":0.6317210694947742,"fraction":2.3473202399398688e-7,"cumulative_fraction":0.9980554466303352,"word":"格律","characters":[{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"},{"definition":["law","surname Lü"],"pinyin":["Lu:4","lu:4"],"word":"律"}],"containing_words":[],"sentences":[{"english":"The modern metrical poetry together with the free verse achieved the great brilliance in one-hundred-year Chinese poetry.","chinese":"現代格律詩與自由詩共同創造了百年現代漢詩的輝煌。"},{"english":"He has composed 52 moderhythmical poems which can be classified into the styles of neat speech and mixed speech.","chinese":"他創作現代格律詩52首，分齊言體和雜言體兩大類。"},{"english":"The holes in Gruyere are due to aeration.","chinese":"格律耶爾乾酪氣孔多是由於通風所致。"},{"english":"In the history of contemporary literature, the theory of modern metrics raised by He Qifang is of great impact.","chinese":"他提出的現代格律詩理論在現當代文學史上影響較大。"},{"english":"In other words, meter is something Frost knows how to use.","chinese":"換句話說，弗羅斯特知道怎麼使用格律。"},{"english":"The central issue of modern metrical poetry is the artistic experiment.","chinese":"現代格律詩建設的中心問題是藝術實驗。"},{"english":"Unlike free verse , they are traditional metrical verses and semi-metrical verses.","chinese":"不同於新詩，它們是舊體或變體的格律詩。"},{"english":"Compared with He Xun, Yin Keng s poetry was clear and fresh, and very mature in form.","chinese":"比起何遜，陰鏗的詩格律非常成熟，形式瀏亮新俊。"},{"english":"This time Six-character poem has completed the classical Chinese poetry rules process.","chinese":"這一時期六言詩完成了格律化過程。"},{"english":"Laws of classical Chinese poetry are invariably derived from nature, so are its forms and rules.","chinese":"中國古代詩歌的種種法則都源於自然，格律同樣如此。"},{"english":"In that meter, too, we're hearing some of Frost's modernity.","chinese":"在這種格律中，我們也能感受到弗羅斯特的現代性。"}],"related":[{"definition":["a genre of poetry, developed in the Tang Dynasty, characterized by its strict form"],"pinyin":["jin4 ti3 shi1"],"word":"近體詩"},{"definition":["regular verse\/strict poetic form with eight lines of 5, 6 or 7 syllables and even lines rhyming"],"pinyin":["lu:4 shi1"],"word":"律詩"},{"definition":["level and oblique tones (technical term for Classical Chinese rhythmic poetry)"],"pinyin":["ping2 ze4"],"word":"平仄"},{"definition":["meters and forms of versification\/prosody"],"pinyin":["shi1 lu:4"],"word":"詩律"},{"definition":["a pre-Tang Dynasty genre of poetry, relatively free in form, usually having four, five, six or seven characters per line"],"pinyin":["gu3 ti3 shi1"],"word":"古體詩"},{"definition":["rhyming word ending a line of verse\/rhyme"],"pinyin":["yun4 jiao3"],"word":"韻腳"},{"definition":["poetic form or genre"],"pinyin":["shi1 ti3"],"word":"詩體"},{"definition":["syntax"],"pinyin":["ju4 fa3"],"word":"句法"},{"definition":["poetry in the old style"],"pinyin":["jiu4 ti3 shi1"],"word":"舊體詩"},{"definition":["names of the tunes to which 詞|词[ci2] poems are composed"],"pinyin":["ci2 pai2"],"word":"詞牌"},{"definition":["antithesis (two lines of poetry matching in sense and sound)\/to fight\/to wage war"],"pinyin":["dui4 zhang4"],"word":"對仗"},{"definition":["long poem in lüshi form 律詩|律诗"],"pinyin":["pai2 lu:4"],"word":"排律"},{"definition":["number of sentences\/number of lines (in verse etc)"],"pinyin":["ju4 shu4"],"word":"句數"},{"definition":["abbr. for Shijing 詩經|诗经[Shi1 jing1], the Book of Songs","poem\/CL:首[shou3]\/poetry\/verse"],"pinyin":["Shi1","shi1"],"word":"詩"},{"definition":["old form of writing\/piece in the old style"],"pinyin":["jiu4 ti3"],"word":"舊體"},{"definition":["use of words"],"pinyin":["qian3 ci2"],"word":"遣詞"}]}