{"definition":["Grant (name)"],"pinyin":["Ge2 lan2 te4"],"simplified":["格兰特"],"rank":34275.0,"normalized_rank":0.4795517188308872,"fraction":6.463889317446356e-7,"cumulative_fraction":0.9935950603896762,"word":"格蘭特","characters":[{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"},{"definition":["orchid (蘭花|兰花 Cymbidium goeringii)\/fragrant thoroughwort (蘭草|兰草 Eupatorium fortunei)\/lily magnolia (木蘭|木兰)","surname Lan\/abbr. for Lanzhou 蘭州|兰州[Lan2 zhou1], Gansu"],"pinyin":["Lan2","lan2"],"word":"蘭"},{"definition":["special\/unique\/distinguished\/especially\/unusual\/very\/abbr. for 特克斯[te4 ke4 si1], tex"],"pinyin":["te4"],"word":"特"}],"containing_words":[],"sentences":[{"english":"This tape is about Grand Turk Island.","chinese":"這盤是格蘭特島的。"},{"english":"Mr Grant dotes on his granddaughter. She's the apple of his eye.","chinese":"格蘭特先生很溺愛他的小孫女，她是他的掌上明珠。"},{"english":"Who's buried in Grant's tomb?","chinese":"誰被埋在格蘭特墓裏面？"},{"english":"The entrance of a Grants and Crawfords was a favourable epoch.","chinese":"格蘭特夫婦和克勞福特姐弟的到場是一個有力的轉折。"},{"english":"Technicolor Cheek was based on UF Grant's trick Cheek to Cheek.","chinese":"彩色印片面頰根據UF格蘭特的把戲面頰對面頰。"},{"english":"Mrs. Grant's non-attendance was sad indeed.","chinese":"格蘭特太太來不了真令人遺憾。"},{"english":"It took three weeks for Grant's men to reach the steamboat landing. The roads were very rough.","chinese":"格蘭特主力經過三個星期纔到達汽船登陸點。"},{"english":"Grant, the captain, has been with the company for 13 years. He still gets seasick.","chinese":"船長格蘭特在這家公司已經13年了，還是有點暈船。"},{"english":"About the only person who can comfort Alim is Cary Grant.","chinese":"關於唯一的人誰可以安慰阿利姆是加里格蘭特。"},{"english":"Grant then ordered the rest of his army to cross to the east side of the river. Some of his officers protested.","chinese":"格蘭特隨後命令他的其餘部隊全部渡河到東岸去。"},{"english":"Grant heard the artillery booming and sent orders that it should stop.","chinese":"格蘭特聽見炮響，便下令停止。"},{"english":"Grant died of throat cancer in 1885 at the age of 63.","chinese":"一八八五年，格蘭特死於喉癌，死時六十三歲。"},{"english":"Millennium Park is an extension of Chicago's Grant Park.","chinese":"太平盛世公園是對芝加哥格蘭特公園的擴大。"},{"english":"Grant was of humble origin, shabby in dress, rough in speech and manners.","chinese":"格蘭特出身低微，衣着腌臢，說話粗魯，態度生硬。"},{"english":"She was bron to Mr. and Mrs. Grant.","chinese":"她是格蘭特夫婦的女兒。"},{"english":"Grant wasted no time. He quickly sent troops to fight the Confederate force blocking the Tennessee River.","chinese":"格蘭特馬不停蹄，迅速出兵，阻南軍于田納西州河畔。"}],"related":[]}