{"definition":["Greenland"],"pinyin":["Ge2 ling2 lan2 dao3"],"simplified":["格陵兰岛"],"rank":44394.0,"normalized_rank":0.6211296573531263,"fraction":2.535631378591761e-7,"cumulative_fraction":0.9978708115002888,"word":"格陵蘭島","characters":[{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"},{"definition":["mound\/tomb\/hill\/mountain"],"pinyin":["ling2"],"word":"陵"},{"definition":["orchid (蘭花|兰花 Cymbidium goeringii)\/fragrant thoroughwort (蘭草|兰草 Eupatorium fortunei)\/lily magnolia (木蘭|木兰)","surname Lan\/abbr. for Lanzhou 蘭州|兰州[Lan2 zhou1], Gansu"],"pinyin":["Lan2","lan2"],"word":"蘭"},{"definition":["island\/CL:個|个[ge4],座[zuo4]"],"pinyin":["dao3"],"word":"島"}],"containing_words":[],"sentences":[{"english":"Today one-third of the people on Greenland earn their living in the fishing industry.","chinese":"今天格陵蘭島上有三分之一的人在捕魚業中謀生。"},{"english":"Denmark's territory includes the Faeroe Islands and Greenland in the Arctic Circle.","chinese":"丹麥領土包括北極圈內的法羅羣島和格陵蘭島。"},{"english":"Melting ice in Greenland threatens to raise sea levels.","chinese":"格陵蘭島的融冰已威脅着海水的上漲。"},{"english":"The Shetlanders are an island race.","chinese":"世界上最大的島嶼是格陵蘭島。"},{"english":"The East Greenland Current flows southward from the Arctic along the island’s eastern coast, carrying sea ice with it.","chinese":"攜帶着海冰，沿着格陵蘭島東海岸從北極向南流動。"},{"english":"Aerial view of Ilulissat glacier, near Ilulissat, Greenland on July 3.","chinese":"鳥瞰伊盧利薩特冰川附近，格陵蘭島，於7月3日。"},{"english":"Here’s Europe. The big white thing is Greenland.","chinese":"這是歐洲，而這個大大的白點就是格陵蘭島。"},{"english":"The ice covering Greenland is about hundreds of meters thick.","chinese":"覆蓋格陵蘭島的冰大約有幾百米厚。"},{"english":"In Greenland two huge chunks of ice broke off in July and August.","chinese":"七月和八月，格陵蘭島兩個巨大的冰塊脫落。"},{"english":"West and north of Greenland, sea ice appears pale gray-blue.","chinese":"在格陵蘭島的西部和北部，海冰呈淡淡的灰藍色。"},{"english":"To get around in Greenland you have to fly.","chinese":"如果想參觀格陵蘭島，那就得靠飛機了。"},{"english":"2010 was an exceptional year for Greenland’s ice cap.","chinese":"2010年對格陵蘭島的冰帽來說是不同尋常的一年。"},{"english":"In Greenland, it's meltwater greasing the way for massive outflows of ice.","chinese":"在格陵蘭島，是冰水增加了大量的冰流出的渠道。"},{"english":"6Floating ice fills a harbor in Ilulissat, Greenland, on July 18, 2011.","chinese":"浮冰漂在格陵蘭島伊盧利薩特的港口。"}],"related":[]}