{"definition":["flowchart\/block diagram"],"pinyin":["kuang4 tu2"],"simplified":["框图"],"rank":56631.0,"normalized_rank":0.7923411637961189,"fraction":6.700373072962687e-8,"cumulative_fraction":0.9996341594842432,"word":"框圖","characters":[{"definition":["frame (e.g. door frame)\/casing\/fig. framework\/template\/to circle (i.e. draw a circle around sth)\/to frame\/to restrict\/Taiwan pr. [kuang1]"],"pinyin":["kuang4"],"word":"框"},{"definition":["diagram\/picture\/drawing\/chart\/map\/CL:張|张[zhang1]\/to plan\/to scheme\/to attempt\/to pursue\/to seek"],"pinyin":["tu2"],"word":"圖"}],"containing_words":[{"definition":["flowchart\/block diagram"],"pinyin":["fang1 kuang4 tu2"],"word":"方框圖"}],"sentences":[{"english":"Stencils are available to aid in the construction of neat flow charts .","chinese":"型板用於幫助構成簡潔的程序框圖。"},{"english":"Finally, the structure drawing of main program and the watchdog program were put forward.","chinese":"給出了主程序框圖和看門狗子程序。"},{"english":"The paper introduces the frame principle of a portable natural gamma spectrum.","chinese":"介紹了一種便攜式天然伽馬能譜測量儀的框圖原理。"},{"english":"The common flow-chart for above content computer programs are …","chinese":"給出了通用的計算機程序框圖。"},{"english":"The flowchart and the calculating results of seve…","chinese":"文中列有計算框圖及對數種相圖的計算結果。"},{"english":"The dark-coloured frame shows off the painting well.","chinese":"深色的畫框圖襯托得很好看。"},{"english":"The robot motion and its environment is simulated in terms of a 3D frame-structured graph.","chinese":"機器人運動及環境用三維線框圖顯示。"},{"english":"Our method can be used to interpret to the hidden-parts-drawn and the natural line drawings.","chinese":"該方法可用於解釋畫隱線框圖和自然線框圖。"},{"english":"Our method can be used to interpret to the hidden-parts-drawn and the natural line drawings.","chinese":"該方法可用於解釋畫隱線框圖和自然線框圖。"},{"english":"Finally, the system flow chart diagram and procedures.","chinese":"最後給出了系統框圖和程序流程圖。"},{"english":"The common flow-chart for above content computer p…","chinese":"給出了通用的計算機程序框圖。"},{"english":"A designed block diagram and two recorded dynamic heartbeat rate diagram are given.","chinese":"文中給出了設計方框圖和實測動態心率變化記錄圖。"},{"english":"Finally, the block diagram of the strap-down inertial navigation system is given .","chinese":"最後給出了無陀螺捷聯慣性導航系統的框圖。"},{"english":"The above block diagram shows a potential retrofit bulb.","chinese":"以上方框圖顯示了一個潛在的改型燈泡。"},{"english":"The common flow-chart for above content computer programs are presented.","chinese":"給出了通用的計算機程序框圖。"},{"english":"This paper introduces the principle and usual faults of PTSI medical oxygen generator with the block diagram.","chinese":"結合方框圖介紹了PTSI型製氧機原理及常見故障。"}],"related":[]}