{"definition":["regulations\/rules\/code of conduct\/ordinances\/statutes"],"pinyin":["tiao2 li4"],"simplified":["条例"],"rank":1995.0,"normalized_rank":0.027912638338953168,"fraction":0.00007669124398106527,"cumulative_fraction":0.7300919916276399,"word":"條例","characters":[{"definition":["strip\/item\/article\/clause (of law or treaty)\/classifier for long thin things (ribbon, river, road, trousers etc)"],"pinyin":["tiao2"],"word":"條"},{"definition":["example\/precedent\/rule\/case\/instance"],"pinyin":["li4"],"word":"例"}],"containing_words":[],"sentences":[{"english":"Cross-sectoral international collaboration key to implementing IHR.","chinese":"跨部門的國際合作是實施《國際衛生條例》的關鍵。"},{"english":"Article 32 The interpreting right of this rule belongs to the Industrial Engineering section.","chinese":"第三十二條本條例解釋權屬組工業工程科。"},{"english":"The Regulation sets an excellent example for our futural non- contractual conflicts legislation.","chinese":"《條例》爲我國非合同之債法律選擇立法提供了借鑑。"},{"english":"Officials had accused them of violating health regulations.","chinese":"官員們指責他們的設備不符合衛生條例。"},{"english":"The first is an opt-out from social and employment legislation.","chinese":"他的第一步就是部分退出社會與就業相關條例。"},{"english":"Besides, the Regulations also clarify managements and managing methods of direct sales industry.","chinese":"此外，條例還明確了直銷業的管理部門及管理辦法。"},{"english":"Article 30 The Municipal Public Security Bureau are responsible for the interpretation of the specific application of the present regulations.","chinese":"第三十條本條例的具體應用問題由市公安局負責解釋。"},{"english":"\"Workers paid annual leave regulations\" promulgated at the same time.","chinese":"《職工帶薪年休假條例》同時出臺。"},{"english":"Now, Pecos Bill could ride anything that ever was.","chinese":"現在，佩科斯條例草案將曾經有過騎不了。"},{"english":"A landlord and a new tenant are talking about rules of the building.","chinese":"一個房東和一個新房客正在討論租賃房屋的條例。"},{"english":"We ony recruit our manpower that has been approved by Local Government Authority.","chinese":"我們配合當地政府所規定的條例來聘請勞工。"},{"english":"The conditions of non-voluntary licensing were set out in the regulation.","chinese":"該條例還規定了非自願許可的條件。"},{"english":"What is the cause of the new airport-security rules for liquids ?","chinese":"啓用新的機場液體安全條例的原因是什麼？"},{"english":"How Have Land-use Regulations Affected Property values in Oregon?","chinese":"俄勒岡土地利用條例怎樣影響不動產價值？"},{"english":"Registration of creation and cancellation of statutory mortgage according to the Public Housing Act.","chinese":"八依國民住宅條例規定法定抵押權之設定及塗銷登記。"},{"english":"The Regulations Concerning the Prevention of Pollution of Sea Areas by Vessels of the P. C. C.","chinese":"中華人民共和國防止船舶污染海域管理條例。"}],"related":[{"definition":["provision\/to fix\/to set\/to formulate\/to stipulate\/to provide\/regulation\/rule\/CL:個|个[ge4]"],"pinyin":["gui1 ding4"],"word":"規定"},{"definition":["legislation\/statute"],"pinyin":["fa3 gui1"],"word":"法規"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"審查"},{"definition":["to violate (a law)"],"pinyin":["wei2 fan3"],"word":"違反"},{"definition":["clause (of contract or law)\/CL:項|项[xiang4]"],"pinyin":["tiao2 kuan3"],"word":"條款"},{"definition":["to regulate"],"pinyin":["gui1 guan3"],"word":"規管"},{"definition":["to be in effect\/in force\/current"],"pinyin":["xian4 xing2"],"word":"現行"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"規範"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"監管"},{"definition":["rules\/regulations"],"pinyin":["shou3 ze2"],"word":"守則"},{"definition":["to set\/to designate\/to stipulate\/to provide\/to draw up\/to formulate (rules etc)\/stipulation"],"pinyin":["ding4 ding4"],"word":"訂定"},{"definition":["rule\/regulation\/rules and regulations"],"pinyin":["gui1 ze2"],"word":"規則"},{"definition":["clause\/explanatory section in a document"],"pinyin":["tiao2 wen2"],"word":"條文"},{"definition":["authorities"],"pinyin":["dang1 ju2"],"word":"當局"},{"definition":["to implement\/to carry out\/to execute\/to run"],"pinyin":["zhi2 xing2"],"word":"執行"},{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"實行"}]}