{"definition":["to abandon ship"],"pinyin":["qi4 chuan2"],"simplified":["弃船"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"棄船","characters":[{"definition":["to abandon\/to relinquish\/to discard\/to throw away"],"pinyin":["qi4"],"word":"棄"},{"definition":["boat\/vessel\/ship\/CL:條|条[tiao2],艘[sou1],隻|只[zhi1]"],"pinyin":["chuan2"],"word":"船"}],"containing_words":[],"sentences":[{"english":"All crew members assembled on boat deck and exercised abandon ship drill.","chinese":"全體船員在艇甲板上集合，進行棄船演習。"},{"english":"I must abandon vessel after piracy in the west mouth of Malacca Strait.","chinese":"我船在馬六甲海峽西出口被海盜搶劫後必須棄船。"},{"english":"I don't want you to jump ship just yet.","chinese":"我還沒有說要你棄船逃命呢。"},{"english":"The order to abandon the ship was given and hundreds of people plunged into the icy water.","chinese":"棄船的命令發出了，數百人跳進了冰冷刺骨的海水裏。"},{"english":"Will you abandon vessel?","chinese":"你船船員準備棄船嗎？"},{"english":"After the merger many employees decided to jump ship.","chinese":"在公司合併了之後，很多員工都選擇了棄船另謀職位。"},{"english":"Mustering of the crew in response to the abandon ship alarm.","chinese":"聽到棄船信號後，在位置集結。"},{"english":"The typhoon is coming. We'll have to get everything ready to evacuate the rig.","chinese":"颱風快要來了，必須做好一切棄船準備。"},{"english":"We were sinking fast, and the captain gave the order to abandon the ship.","chinese":"我們在迅速地下沉，船長下令棄船。"},{"english":"The whole crew deserted.","chinese":"全體船員棄船逃生。"},{"english":"The crew made a last ditch effort to put out the blaze before finally abandoning ship.","chinese":"在最後棄船前船員們作了撲滅大火的最後一次努力。"},{"english":"The captain of the ship has deserted.","chinese":"船長已棄船逃生。"},{"english":"Smee , decided to abandon the ship by jumping down into the water.","chinese":"他們和斯米先生決定棄船，跳水逃命。"},{"english":"Allcrew member assembled on the lifeboat deck, carried out abandon drill.","chinese":"全體船員在艇甲板上集合，進行棄船演習。"},{"english":"We learned from those jumbles that the captain hadn't given orders to abandon the ship.","chinese":"我們從哪些航海日誌中得知，船長並沒有下令棄船。"}],"related":[]}