{"definition":["super\/excellent"],"pinyin":["bang4 ji2 le5"],"simplified":["棒极了"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"棒極了","characters":[{"definition":["stick\/club\/cudgel\/smart\/capable\/strong\/wonderful\/classifier for legs of a relay race"],"pinyin":["bang4"],"word":"棒"},{"definition":["extremely\/pole (geography, physics)\/utmost\/top"],"pinyin":["ji2"],"word":"極"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly"],"pinyin":["le5","liao3"],"word":"了"}],"containing_words":[],"sentences":[{"english":"The goal-keeper was great!","chinese":"那個守門員棒極了。"},{"english":"Kathy is an awesome Laughter Yoga Teacher right here in Australia (Sydney).","chinese":"凱西是一名棒極了的澳大利亞微笑瑜伽老師。"},{"english":"There's nothing stuck-up about the great English wild flower.","chinese":"遍及英倫的這些棒極了的野花一點都不張揚。"},{"english":"This is a really wonderful party with interesting people and great food.","chinese":"這場晚會有美食佳賓真是棒極了。"},{"english":"Putin is wearing his famous judo outfit. He looks terrific, relaxed.","chinese":"普京穿着他那套著名的柔道服，看上去棒極了。"},{"english":"Now, the Bear family feels great in their new home.","chinese":"現在，小熊一家在新家裏感覺棒極了。"},{"english":"So I'm meeting all kinds of walks of life, and it's awesome.","chinese":"所以我碰見的是各行各業的人，棒極了。"},{"english":"I feel great about my hair.","chinese":"我覺得我的頭髮棒極了。"},{"english":"Would you like to go to the China Hotel for dinner ? They serve excellent sour and sweet pork steak .","chinese":"你想到中國飯店喫晚餐嗎？他們的糖醋排骨棒極了。"},{"english":"You look wonderful.","chinese":"你看起來棒極了。"},{"english":"you'd want to say \"You look amazing.\"","chinese":"你會說，你看起來真是棒極了。"},{"english":"The provincial road from Guiyang to Kaiyang was, indeed, marvellous.","chinese":"那條從貴陽到開陽的省級公路的確是棒極了。"},{"english":"From the most wonderful, busy, fun-filled summer vacation.","chinese":"那是一個棒極了的，十分充實且充滿歡樂的暑假。"},{"english":"Your handcraft is really awesome.","chinese":"您的手藝實在棒極了。"},{"english":"If I may say no, this chocolate cake you make is fantastic.","chinese":"如果要我說的話，你做的這隻巧克力蛋糕棒極了。"},{"english":"It's such a good game. The graphics are awesome.","chinese":"這個遊戲棒極了，畫面非常漂亮。"}],"related":[]}