{"definition":["light brown"],"pinyin":["zong1 huang2"],"simplified":["棕黄"],"rank":57204.0,"normalized_rank":0.800358177213773,"fraction":6.189451378945924e-8,"cumulative_fraction":0.9996710436512196,"word":"棕黃","characters":[{"definition":["palm\/palm fiber\/coir (coconut fiber)\/brown"],"pinyin":["zong1"],"word":"棕"},{"definition":["surname Huang or Hwang","yellow\/pornographic\/to fall through"],"pinyin":["Huang2","huang2"],"word":"黃"}],"containing_words":[],"sentences":[{"english":"Its muddy water makes the ocean brown for 200 miles.","chinese":"渾濁的河水使河口200英里範圍的海洋變成棕黃色。"},{"english":"Dark red-violet powder, taste bitter, easy to absorb moist.","chinese":"本品爲棕黃色粉末，味微苦，引溼性強。"},{"english":"The orange-brown, scalloped appearance of these lesions is consistent with old contusions.","chinese":"棕黃色圓齒狀外觀的病變與舊挫傷相一致。"},{"english":"You regularly see this colour with tan marks on head and legs.","chinese":"頭部和腿部有棕黃斑點的邊牧也很罕見。"},{"english":"The fruit itself color , they go to a yellow and browned color.","chinese":"果實本身是有顏色的，最終會變成棕黃色。"},{"english":"Her hair was sandy and she swung up and down.","chinese":"她的頭髮是棕黃色的，隨着她上下搖擺。"},{"english":"Soft tan with light pink sparkle.","chinese":"柔和的棕黃色帶淺粉亮片。"},{"english":"The resolution left behind hemosiderin from the hemorrhage that produces the orange-brown staining.","chinese":"出血後血液溶解形成的含鐵血黃素產生棕黃色外觀。"},{"english":"Yellow slurry water is yellowish-brown, colloid mixture.","chinese":"黃漿水爲棕黃色，膠體混合物。"},{"english":"Soft matte cool tan filled with silvery-white sparkles.","chinese":"柔和啞光清涼棕黃色充滿銀白色亮片。"},{"english":"These days, a tan indicates that you wealthy and physically healthy.","chinese":"現在的人認爲棕黃一點的膚色表明你富有和身體健康。"},{"english":"He was mostly black, with a small amount of tan above his eyes and on his feet.","chinese":"小狗幾乎全身是黑色，但嘴巴和腳有少許棕黃色。"},{"english":"The yellow-tan exudate of acute bacterial meningitis seen here obscures the sulci.","chinese":"急性細菌性腦膜炎棕黃色滲出物使腦溝模糊不清。"},{"english":"The yellow-tan clouding of the meninges seen here is due to an exudate from acute meningitis.","chinese":"這裏所見棕黃色混濁物是急性腦膜炎的滲出物。"},{"english":"Soft tan with a subtle green sheen.","chinese":"柔和的棕黃色帶微妙的綠色光澤。"}],"related":[]}