{"definition":["Yang Jiechi (1950-), Chinese politician and diplomat, foreign minister of PRC 2007-2013"],"pinyin":["Yang2 Jie2 chi2"],"simplified":["杨洁篪"],"rank":30926.0,"normalized_rank":0.4326948637947197,"fraction":8.673990588136009e-7,"cumulative_fraction":0.9910797017999939,"word":"楊潔篪","characters":[{"definition":["poplar","surname Yang"],"pinyin":["Yang2","yang2"],"word":"楊"},{"definition":["clean"],"pinyin":["jie2"],"word":"潔"},{"definition":["bamboo flute with 7 or 8 holes"],"pinyin":["chi2"],"word":"篪"}],"containing_words":[],"sentences":[{"english":"Today, our relations stand at a new starting point in history.","chinese":"楊潔篪最後說，中印關係正站在一個新的歷史起點上。"},{"english":"On the same day, Yang held talks with his Gabonese counterpart Paul Toungui.","chinese":"同日，楊潔篪與加蓬外長通吉舉行會談。"},{"english":"On the same day, Ukraine's Parliament Speaker Volodymyr Lytvyn met with Yang Jiechi in the parliament building.","chinese":"同日，烏克蘭議長利特溫在議會大廈會見楊潔篪。"},{"english":"People of China and Kyrgyzstan shared profound traditional friendship, said Yang.","chinese":"楊潔篪表示，中吉兩國人民有着深厚的傳統友誼。"},{"english":"Yang noted that China and Turkey enjoy a long history of friendly exchanges.","chinese":"楊潔篪表示，中國與土耳其友好交往源遠流長。"},{"english":"Prince Faisal expressed warm welcome for Yang's visit, saying that Jordan and China share very strong bilateral ties with fruitful cooperation in economy, trade and other fields.","chinese":"費薩爾熱情歡迎楊潔篪訪問約旦。"},{"english":"Yang expressed welcome for Baird's visit and congratulated him for assuming his new office.","chinese":"楊潔篪歡迎貝爾德來華訪問並祝賀其履新。"},{"english":"Yang also took questions form the journalists on China-Japan relations and the Korean Peninsula nuclear issue.","chinese":"楊潔篪還就中日關係和朝核問題回答了記者提問。"},{"english":"Yang said recent years have witnessed smooth development of bilateral strategic partnership.","chinese":"楊潔篪說，近年來，中墨戰略伙伴關係發展順利。"},{"english":"Foreign Minister Yang Jiechi has sent a message of condolences to his Argentine counterpart Timerman.","chinese":"楊潔篪外長就此向阿根廷外長蒂梅爾曼發了唁電。"},{"english":"Yang first sent Alor warm congratulations on the independence and establishment of the Republic of South Sudan.","chinese":"楊潔篪首先熱烈祝賀南蘇丹獨立建國。"},{"english":"Chinchilla asked Yang to convey her greetings to President Hu Jintao.","chinese":"欽奇利亞請楊潔篪轉達致胡錦濤主席的問候。"},{"english":"Matsumoto just out the same day with the Chinese Foreign Minister Yang Jiechi held a telephone meeting.","chinese":"松本剛明當天還與中國外長楊潔篪進行了電話會談。"},{"english":"Batbold is visiting China at the invitation of Foreign Minister Yang Jiechi.","chinese":"巴特包勒德是應楊潔篪外長邀請訪華。"},{"english":"“China will never seek to advance its interests at the expense of others, ” Mr. Yang said, according to Reuters.","chinese":"據路透社報道，楊潔篪說，”中國不會損人利已。"},{"english":"Yang met with Japanese Foreign Minister Seiji Maehara in Hanoi on that morning.","chinese":"楊潔篪當天上午在河內會見了日本外務大臣前原誠司。"}],"related":[]}