{"definition":["the state of Chu, one of the most important of the small states contending for power in China between 770 and 223 BC, located around present-day Hubei"],"pinyin":["Chu3 guo2"],"simplified":["楚国"],"rank":30653.0,"normalized_rank":0.4288752396009682,"fraction":8.892957028428905e-7,"cumulative_fraction":0.9908399837641768,"word":"楚國","characters":[{"definition":["distinct\/clear\/orderly\/pain\/suffering\/deciduous bush used in Chinese medicine (genus Vitex)\/punishment cane (old)","surname Chu\/abbr. for Hubei 湖北省[Hu2 bei3 Sheng3] and Hunan 湖南省[Hu2 nan2 Sheng3] provinces together\/Chinese kingdom during the Spring and Autumn and Warring States Periods (722-221 BC)"],"pinyin":["Chu3","chu3"],"word":"楚"},{"definition":["country\/nation\/state\/national\/CL:個|个[ge4]","surname Guo"],"pinyin":["Guo2","guo2"],"word":"國"}],"containing_words":[],"sentences":[{"english":"The Chu general Zhuang Jiao entered the region from the upper Yangtze River and set himself up as \"King of Dian\".","chinese":"楚國的將軍莊郊從長江上游來到這裏自稱滇王。"},{"english":"Chu and Qi were only able to compete with them.","chinese":"當時只有楚國和齊國能與之抗衡。"},{"english":"Then, Qin government intends to fight on the state of Chu.","chinese":"接着，秦王政就打算去打楚國。"},{"english":"Chu has a well-known archery bear experts called drainage sub.","chinese":"楚國有一位著名的射箭能手名叫熊渠子。"},{"english":"The Suipian offered new evidence for study calendar of Chu state.","chinese":"《日書》“歲篇”爲楚國曆法研究提供了新證據。"},{"english":"Chu's once in ChuShan and found a piece of jade called equipments.","chinese":"楚國人和氏有一次在楚山中發現一塊叫做璞的玉石。"},{"english":"A man from the state of Chu wanted to sell a precious pearl in the state of Zheng.","chinese":"有個楚國人想在鄭國出售一顆珍貴的珍珠。"},{"english":"Sitting in the chariot was the great King of Chu.","chinese":"坐在車上的是偉大的楚國國君。"},{"english":"There is a sacrifice to the chu and rewarded MenKe a pot of wine.","chinese":"楚國有個祭祀的人，賞給門客一壺酒。"},{"english":"On the way to the State of Chu, Confucius saw an old man catching cicada in the woods.","chinese":"孔子到楚國去，在路上遇見一位在林中捕蟬的老先生。"},{"english":"Pre-Qin era, Chu has been the integration of all ethnic groups in southern culture.","chinese":"先秦時代，楚國已融合了南方各族文化。"},{"english":"Finally, chu destroyed by the state of qin.","chinese":"終於，楚國被秦國滅掉了。"},{"english":"But I really have a premonition that Chu is facing GREat danger.","chinese":"大臣莊辛預見到楚國會發生危險。"},{"english":"A man of the state of Zheng bought the casket and gave him back the pearl.","chinese":"有個楚國人想在鄭國出售一顆珍貴的珍珠。"},{"english":"The current cold weather, it is better first went to the south of Wei and Chu Shou Fu .","chinese":"目前天冷，不如先去收服南方的魏國和楚國。"},{"english":"Chu people of peril and suffering, pain Yuan.","chinese":"楚國的危亡和百姓的痛苦，屈原痛不欲生。"}],"related":[{"definition":["Duke Huan of Qi (reigned 685-643 BC), one of the Five Hegemons 春秋五霸"],"pinyin":["Qi2 Huan2 gong1"],"word":"齊桓公"},{"definition":["Qi state of Western Zhou and the Warring states (1122-265 BC), centered in Shandong"],"pinyin":["Qi2 guo2"],"word":"齊國"},{"definition":["the state of Qin, one of the seven states of the Warring States Period (475-220 BC)"],"pinyin":["Qin2 guo2"],"word":"秦國"},{"definition":["Yan, a vassal state of Zhou in modern Hebei and Liaoning\/north Hebei\/the four Yan kingdoms of the Sixteen Kingdoms, namely: Former Yan 前燕 (337-370), Later Yan 後燕|后燕 (384-409), Southern Yan 南燕 (398-410), Northern Yan 北燕 (409-436)"],"pinyin":["Yan1 guo2"],"word":"燕國"},{"definition":["Lu, vassal state at the time of the Zhou Dynasty 周朝|周朝[Zhou1 chao2], located in the southwest of present-day Shandong 山東|山东[Shan1 dong1], birthplace of Confucius"],"pinyin":["Lu3 guo2"],"word":"魯國"},{"definition":["Duke Wen of Jin (697-628 BC, reigned 636-628 BC), one of the Five Hegemons 春秋五霸"],"pinyin":["Jin4 Wen2 gong1"],"word":"晉文公"},{"definition":["Sun Quan (reigned 222-252), southern warlord and king of state of Wu 吳|吴 in the Three Kingdoms period"],"pinyin":["Sun1 Quan2"],"word":"孫權"},{"definition":["Wei State (407-225 BC), one of the Seven Hero States of the Warring States 戰國七雄|战国七雄\/Wei State or Cao Wei 曹魏 (220-265), the most powerful of the Three Kingdoms"],"pinyin":["Wei4 guo2"],"word":"魏國"},{"definition":["vassal state"],"pinyin":["zhu1 hou2 guo2"],"word":"諸侯國"},{"definition":["Zhao, one of the seven states during the Warring States Period of Chinese history (475-220 BC)"],"pinyin":["Zhao4 Guo2"],"word":"趙國"},{"definition":["Liu Bei (161-223), warlord at the end of the Han dynasty and founder of the Han kingdom of Shu 蜀漢|蜀汉 (c. 200-263), later the Shu Han dynasty"],"pinyin":["Liu2 Bei4"],"word":"劉備"},{"definition":["monarch"],"pinyin":["guo2 jun1"],"word":"國君"},{"definition":["feudal vassal\/feudal princes, esp. the monarchs (dukes or princes) of the several vassal states 諸侯國|诸侯国 of Zhou during Western Zhou and Spring and Autumn periods 11th-5th century BC\/subordinate warlord\/local official"],"pinyin":["zhu1 hou2"],"word":"諸侯"},{"definition":["utterly defeated\/routed\/crushed\/to collapse (of army)"],"pinyin":["kui4 bai4"],"word":"潰敗"},{"definition":["King Huai of Chu (reigned 328-299 BC)\/later King Huai of Chu (reigned 208-205 BC)"],"pinyin":["Chu3 Huai2 wang2"],"word":"楚懷王"},{"definition":["Liu Yu, founder of Song of the Southern dynasties 劉宋|刘宋[Liu2 Song4], broke away from Eastern Jin in 420, reigned as Emperor Wu of Song 宋武帝[Song4 Wu3 di4]"],"pinyin":["Liu2 Yu4"],"word":"劉裕"}]}