{"definition":["polar coordinates (math.)"],"pinyin":["ji2 zuo4 biao1"],"simplified":["极坐标"],"rank":65687.0,"normalized_rank":0.9190463531683292,"fraction":1.3575919298159691e-8,"cumulative_fraction":0.9999636140546572,"word":"極座標","characters":[{"definition":["extremely\/pole (geography, physics)\/utmost\/top"],"pinyin":["ji2"],"word":"極"},{"definition":["seat\/base\/stand\/CL:個|个[ge4]\/classifier for buildings, mountains and similar immovable objects"],"pinyin":["zuo4"],"word":"座"},{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"標"}],"containing_words":[{"definition":["system of polar coordinates"],"pinyin":["ji2 zuo4 biao1 xi4"],"word":"極座標系"}],"sentences":[{"english":"We have written the compatibility equation in a form that corresponds with the polar geometry.","chinese":"我們已經把協調方程寫成了極座標的形式。"},{"english":"The FPGA implementation scheme of LPT is also discussed in the paper.","chinese":"給出了對數極座標變換的FPGA實現方案。"},{"english":"Let's check what we had for polar coordinates.","chinese":"我們來回顧一下極座標。"},{"english":"And lofting with polar coordinates method can break through localization of deflection angle method.","chinese":"使用極座標法放樣可以避免偏角法的侷限性。"},{"english":"With examples, this article attempts to explain the method of polar coordinates and its application in conic .","chinese":"結合實例，闡述了極座標法在圓錐曲線中的運用。"},{"english":"The displacement solution is constructed by applying the methods of complex function and multi polar coordinates system.","chinese":"利用複變函數和多極座標方法構造了問題的位移解。"},{"english":"An approximately polar formatting algorithm is proposed to compensate scatter migration through resolution cells.","chinese":"爲校正越距離單元走動，提出了一種近似極座標算法。"},{"english":"The mesh equations of gears are given by tangent polar coordinate system.","chinese":"本文給出了切線極座標下的齒輪齧合方程式。"}],"related":[]}