{"definition":["extremely few\/a small minority"],"pinyin":["ji2 shao3 shu4"],"simplified":["极少数"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"極少數","characters":[{"definition":["extremely\/pole (geography, physics)\/utmost\/top"],"pinyin":["ji2"],"word":"極"},{"definition":["few\/less\/to lack\/to be missing\/to stop (doing sth)\/seldom","young"],"pinyin":["shao3","shao4"],"word":"少"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[],"sentences":[{"english":"This is one of those rare cases.","chinese":"本案屬於那種極少數案例之一。"},{"english":"Then there are the few brae souls who grab at its horns and hang on at all costs.","chinese":"只有極少數的靈魂不畏艱險，不惜一切。"},{"english":"Dingoes are one of their few enemies.","chinese":"澳大利亞野犬是袋鼠極少數的敵人之一。"},{"english":"Historically, most societies granted rights only to the lucky few.","chinese":"回顧歷史，大多數社會只讓極少數幸運者享有權利。"},{"english":"However, we find these circumstances to be rare.","chinese":"然而，我們發現這樣的情況只是極少數。"},{"english":"In rare cases, the intestine perforates and the infant dies.","chinese":"極少數的個案，出現腸道出現穿孔而導致死亡。"},{"english":"Minnelli is one of the few directors for whom Technicolor seems to have been invented.","chinese":"明奈利是極少數似乎彩色電影是爲他發明的導演之一。"},{"english":"Very few organisations have a truly international structure and perspective.","chinese":"極少數組織擁有真正國際化的結構和眼界。"},{"english":"The few females afforded respect in Jawa culture are the shamans.","chinese":"在賈瓦文化中，極少數受尊敬的女性是巫師。"},{"english":"All old houses have stories to be the Government Wenbao Yum Chak's only a very small minority.","chinese":"所有舊房子的故事，是政府文保蔭澤的只是極少數。"},{"english":"Few people commented on the in-the-cloud capabilities announced by Microsoft.","chinese":"極少數人就微軟宣佈的計劃中功能發表了評論。"},{"english":"There were few primary lymph nodules which devoid of germinal centre in the lymph nodes.","chinese":"在淋巴結已形成極少數不具生髮中心的初級淋巴小結。"},{"english":"However, focal spermatogenesis and severe oligozoospermia have been found in a few cases of 47, XXY, too.","chinese":"但極少數患者仍有局部生精竈和少量精子發生。"},{"english":"But very few other countries can absorb the US trade deficit.","chinese":"但是，只有極少數國家有能力吸收美國的貿易赤字。"},{"english":"Very little, if any, debate takes place unless the nominee is controversial.","chinese":"在極少數情況下，除非被提名者有爭議纔會進行討論。"},{"english":"Until this spring, a handful of people knew of his matchmaking project.","chinese":"直到今年春天，極少數人知道他的牽線搭橋項目。"}],"related":[]}