{"definition":["to build\/to construct"],"pinyin":["gou4 zhu4"],"simplified":["构筑"],"rank":7402.0,"normalized_rank":0.1035635834510934,"fraction":0.000013555774385652744,"cumulative_fraction":0.9021892786278528,"word":"構築","characters":[{"definition":["to construct\/to form\/to make up\/to compose\/literary composition\/paper mulberry (Broussonetia papyrifera)"],"pinyin":["gou4"],"word":"構"},{"definition":["to build\/to construct\/to ram\/to hit\/Taiwan pr. [zhu2]"],"pinyin":["zhu4"],"word":"築"}],"containing_words":[],"sentences":[{"english":"Second, step up counter-terrorism efforts and build a safe environment for the Organization’s development.","chinese":"第二，加大反恐力度，構築本組織發展的安全環境。"},{"english":"These results have provided powerful basis for design and reconstruction of retain piles in Badu landslide.","chinese":"這爲滑坡地帶重新構築抗滑樁設計提供了理論依據。"},{"english":"If building a win-win relationship, you can create an environment that solve the territorial issue.","chinese":"如能構築雙贏關係，則可以爲解決領土問題創造環境。"},{"english":"It’s his job to build the genome and protein infrastructure for mirror life.","chinese":"他的工作是爲鏡像生命構築基因組和蛋白基本結構。"},{"english":"Objective To explore changes of micro framework of the collagen fibers of the epiphyseal plate following traction separation.","chinese":"目的探討骺板受到牽拉後其膠原纖維超微構築的變化。"},{"english":"Suntzu would have been impressed with general giap's spy network in South Vietnam.","chinese":"武元甲在南越構築的情報網得到了孫子真傳。"},{"english":"Players have 20 minutes to build their decks.","chinese":"牌手有20分鐘時間來構築自己的牌組。"},{"english":"The infiltration gallery is widely used in the northeast and west-east areas of China to collect under-ground water.","chinese":"滲渠式集水廊道是一種集取地下水的構築物形式。"},{"english":"The bridge is (built)of stone.","chinese":"這橋是由石頭構築的。"},{"english":"Main task is to select and process design and calculation of the structures.","chinese":"主要任務是工藝流程選擇及構築物設計和計算。"},{"english":"Zen build the spirit of the sacred core for the design.","chinese":"禪境爲設計構築神聖的精神內核的判斷。"},{"english":"Based on AAFES standard, the framework of American textile standards is studied.","chinese":"以AAFES標準爲例研究美國紡織品標準構築體系。"},{"english":"\"Houses\" as used in this Law means buildings and structures such as houses on the land.","chinese":"本法所稱房屋，是指土地上的房屋等建築物及構築物。"},{"english":"The last one, it perfect social ensurance system and build up a protective screen of the economic development.","chinese":"第五是健全社會保障體系，構築經濟發展的安全屏障。"},{"english":"This paper reported the fabrication of an ordered array of the hexogen-filling carbon nano-tubes.","chinese":"報導了黑索今填充的碳納米管有序陣列的構築。"},{"english":"Speeding up the development of talented people in the space industry and forming advantages in this regard.","chinese":"加速航天科技隊伍建設，構築航天人才優勢。"}],"related":[{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["to construct (often sth abstract, such as good relations)\/to set up\/to develop\/construction (abstract)\/architecture"],"pinyin":["jian4 gou4"],"word":"建構"},{"definition":["to construct\/to form\/to make up\/to compose\/literary composition\/paper mulberry (Broussonetia papyrifera)"],"pinyin":["gou4"],"word":"構"},{"definition":["ecology"],"pinyin":["sheng1 tai4"],"word":"生態"},{"definition":["structure\/composition\/tectonic (geology)\/CL:個|个[ge4]"],"pinyin":["gou4 zao4"],"word":"構造"},{"definition":["to recreate\/to reconstruct (a historical relic)"],"pinyin":["zai4 xian4"],"word":"再現"},{"definition":["structure\/composition\/makeup\/architecture\/CL:座[zuo4],個|个[ge4]"],"pinyin":["jie2 gou4"],"word":"結構"},{"definition":["to create\/to bring about\/to produce\/to set (a record)"],"pinyin":["chuang4 zao4"],"word":"創造"},{"definition":["to build (housing)\/to construct\/to make"],"pinyin":["ying2 zao4"],"word":"營造"},{"definition":["to strengthen\/to intensify"],"pinyin":["qiang2 hua4"],"word":"強化"},{"definition":["shape\/form\/pattern\/morphology"],"pinyin":["xing2 tai4"],"word":"形態"},{"definition":["modernization\/CL:個|个[ge4]"],"pinyin":["xian4 dai4 hua4"],"word":"現代化"},{"definition":["to introduce into\/to channel\/to lead\/to guide into\/to import (data)"],"pinyin":["dao3 ru4"],"word":"導入"},{"definition":["to initiate\/to start\/to found"],"pinyin":["kai1 chuang4"],"word":"開創"},{"definition":["to constitute\/to form\/to compose\/to make up\/to configure (computing)"],"pinyin":["gou4 cheng2"],"word":"構成"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推進"}]}