{"definition":["scale"],"pinyin":["biao1 du4"],"simplified":["标度"],"rank":60035.0,"normalized_rank":0.8399675401900019,"fraction":4.145764602878873e-8,"cumulative_fraction":0.9998163494890396,"word":"標度","characters":[{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"標"},{"definition":["to estimate\/Taiwan pr. [duo4]","to pass\/to spend (time)\/measure\/limit\/extent\/degree of intensity\/degree (angles, temperature etc)\/kilowatt-hour\/classifier for events and occurrences"],"pinyin":["du4","duo2"],"word":"度"}],"containing_words":[],"sentences":[{"english":"It is point out that the fluctuation of structure function lead to nonlinear scaling law.","chinese":"指出結構函數的振盪漲落導致非線性標度律。"},{"english":"The short scaling time series have multifractal properties.","chinese":"小標度時間序列存在多重分形特徵。"},{"english":"Finally, it discusses the multiscale fractal feature of quasicrystal conjugate structure.","chinese":"最後討論了準晶共軛結構的多標度分形特徵。"},{"english":"In the generally customary construction of fingerboards the scale length is divided by way of calculation.","chinese":"在指板的一般習慣的建築標度長度被劃分通過演算。"},{"english":"It is a uniform scale of measurement of earthquake size. It is suitable for statistics covering a broad range of magnitudes.","chinese":"它是一個均勻的震級標度，適用於寬尺度的地震統計。"},{"english":"That phenomenon is known as scale-free correlation, and transcends biology.","chinese":"這種現象稱爲無標度的相關性，超越了生物學的規律。"},{"english":"Through scaling transform, field F and energy level E are replaced by parameter t.","chinese":"通過標度變換，引入t參量代替能級E和外電場F。"},{"english":"Scaling law of structure function in GOY model is analyzed in this paper.","chinese":"分析了GOY模型結構函數的標度律。"},{"english":"Lol…. Pakistan is the new scale to measure friendship and loyalty?","chinese":"哈哈，巴基斯坦是衡量友誼和忠誠的新標度？"},{"english":"Dial is aluminum oxide printing plate, the surface clear and beautiful style.","chinese":"標度盤是鋁氧化印刷盤，表面清晰式樣美觀。"},{"english":"There are two scales for defining the strength of an earthquake, the Mercalli Scale and the Richter Scale.","chinese":"地震強度有兩種標度，麥卡列震級和里氏震級。"},{"english":"Investigate the correlation properties of scale-free networks.","chinese":"研究無標度網絡的相關性。"},{"english":"There were dials, switches and flashing lights all over the instrument panel.","chinese":"儀表板上佈滿標度盤，開關和閃爍的指示燈。"},{"english":"There is only scale-free regime in the phase diagram.","chinese":"在網絡的相圖中只有無標度區。"},{"english":"The flow in porous media is expressed in terms of scaling law.","chinese":"在多孔介質中的流動問題可以用“標度”律表述。"},{"english":"In the model, weights of factors of the investment are got by relative scale.","chinese":"基於相對標度法求出投資模型中各投資因子的權重值。"}],"related":[]}