{"definition":["to mark\/to indicate"],"pinyin":["biao1 ming2"],"simplified":["标明"],"rank":9588.0,"normalized_rank":0.13414855959593133,"fraction":0.000008856754576967148,"cumulative_fraction":0.9261788825754032,"word":"標明","characters":[{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"標"},{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"}],"containing_words":[],"sentences":[{"english":"GMO foods do not have to be labeled in America.","chinese":"在美國，轉基因食品毋須用籤條標明。"},{"english":"He inserted a slip marking his place in the book.","chinese":"他在書中插入紙頁，以標明他讀到的地方。"},{"english":"As its name indicates, Professional wear refers to the garments for professionals.","chinese":"職業裝，顧名思議，就是能夠標明職業特徵的服裝。"},{"english":"Now there are almost four hundred mapped ways to climb Seneca Rocks.","chinese":"現在已經有地圖標明的攀登路線近四百條。"},{"english":"As the map indicates, the Lincoln Park is one of the scenic spots.","chinese":"按地圖上所標明的，林肯公園是風景點之一。"},{"english":"It must be followed by the function name and the parenthesized list of formal parameters.","chinese":"其後必須帶有函數名和以括號標明的參數列表。"},{"english":"If you don't indicate any location, that by default in the production order will be used.","chinese":"如果你沒有標明任何位置，默認這生產單將使用。"},{"english":"Where the indications or the functions marked on the labels of the pharmaceuticals do not fall within the prescribed scope.","chinese":"標明的適應症或者功能主治超出規定範圍的。"},{"english":"But over time our studies indicate, stocks do go up and up.","chinese":"但是我們的研究標明，股票總體還是會一漲再漲的。"},{"english":"A fence marked the perimeter of the field.","chinese":"標明瞭那塊田地的周界。"},{"english":"Some quotations seek an author, others lose them.","chinese":"有些語錄標明作者何人，而有些則查無此人。"},{"english":"All lifting appliances must be clearly marked with an identification number and with their safe working loads.","chinese":"所有起重器具必須清楚標明標識號和其安全作業載荷。"},{"english":"They are usually red, and they display the price per kilometre on the window.","chinese":"它們一般是紅色的，窗上標明瞭每公里的價格。"},{"english":"The barrel was labelled flour and taken aboard the ship.","chinese":"那隻木桶標明是裝的麪粉，被運上了船。"},{"english":"The three are being held after crossing an unmarked border on a hike.","chinese":"三名美國人試圖穿越未標明的邊境進入伊朗時被拘。"},{"english":"Beijing is indicated on the map by a red star.","chinese":"在這幅地圖上北京是用一顆紅星標明的。"}],"related":[{"definition":["to mark out\/to tag\/to put a sign on sth explaining or calling attention to\/to annotate (e.g. a character with its pinyin)"],"pinyin":["biao1 zhu4"],"word":"標注"},{"definition":["to register\/to annotate\/note\/comment"],"pinyin":["zhu4"],"word":"註"},{"definition":["to indicate"],"pinyin":["biao1 shi4"],"word":"標示"},{"definition":["model or template character\/written slogan or phrase\/mention (e.g. \"air mail\" 航空 on a letter, \"first draft\" 初稿 on a document etc)"],"pinyin":["zi4 yang4"],"word":"字樣"},{"definition":["source (esp. of quotation or literary allusion)\/origin\/where sth comes from"],"pinyin":["chu1 chu4"],"word":"出處"},{"definition":["label\/tag\/tab (of a window) (computing)"],"pinyin":["biao1 qian1"],"word":"標籤"},{"definition":["superscript"],"pinyin":["shang4 biao1"],"word":"上標"},{"definition":["for reference only"],"pinyin":["jin3 gong1 can1 kao3"],"word":"僅供參考"},{"definition":["content\/substance\/details\/CL:個|个[ge4],項|项[xiang4]"],"pinyin":["nei4 rong2"],"word":"內容"},{"definition":["material\/resources\/data\/information\/profile (Internet)\/CL:份[fen4],個|个[ge4]"],"pinyin":["zi1 liao4"],"word":"資料"},{"definition":["according to\/basis\/foundation"],"pinyin":["yi1 ju4"],"word":"依據"},{"definition":["editor\/compiler"],"pinyin":["bian1 zhe3"],"word":"編者"},{"definition":["barcode"],"pinyin":["tiao2 ma3"],"word":"條碼"},{"definition":["calligraphic style\/typeface\/font"],"pinyin":["zi4 ti3"],"word":"字體"},{"definition":["name (of a thing)\/name (of an organization)"],"pinyin":["ming2 cheng1"],"word":"名稱"},{"definition":["to contrast\/to compare\/to place side by side for comparison (as parallel texts)\/to check"],"pinyin":["dui4 zhao4"],"word":"對照"}]}