{"definition":["to indicate"],"pinyin":["biao1 shi4"],"simplified":["标示"],"rank":12723.0,"normalized_rank":0.1780112769857149,"fraction":0.000005544084290589322,"cumulative_fraction":0.9481345895904532,"word":"標示","characters":[{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"標"},{"definition":["to show\/to reveal"],"pinyin":["shi4"],"word":"示"}],"containing_words":[],"sentences":[{"english":"LBS. minimum pull-out force in direction indicated.","chinese":"標示出至少7磅的外拉力及其方向。"},{"english":"Equipment nameplates will be bilingual, English and French.","chinese":"設備標示牌要採用英法雙語表示。"},{"english":"An abandoned military road, overgrown with weeds, marked the former boundary line.","chinese":"一條長滿野草的廢棄軍用公路標示出以前的邊界線。"},{"english":"In the US, warning messages have been in place on cigarette packages for decades.","chinese":"在香菸盒上標示警告語的做法在美國已有幾十年了。"},{"english":"His name was carded upon two rooms.","chinese":"有兩個房間用卡片標示着他的名字。"},{"english":"On the edges are 13 inlaid jade markers.","chinese":"外側鑲嵌有13個標示音位的玉徽或金徽。"},{"english":"Eid-al-Fitr marks the end of Muslim fasting month of Ramadan.","chinese":"開齋節標示著穆斯林齋戒月的結束。"},{"english":"Use highlighters (colored pens) with texts to highlight forms that you are studying.","chinese":"用熒光筆在你讀的書上標示出這些形式。"},{"english":"Power sockets for benches will be shown in the relative plan view.","chinese":"工作臺上的電源插座在相關側面圖上標示。"},{"english":"A road surface drawing device.","chinese":"道路標示作図裝置。"},{"english":"Black lines designate boundaries on this map.","chinese":"在這幅地圖上黑線標示疆界。"},{"english":"In the past, numbers in the financial records of a company were written in red ink to show a loss.","chinese":"過去，公司財務記錄數字都用紅色墨水標示虧損。"},{"english":"All dimensions may be inaccurate and are subject to adjustments.","chinese":"所有標示的尺寸，或會有所調整，不可作準。"},{"english":"All these mark the boom of \"Qu\" as an esthetic category of classical Chinese literary criticism.","chinese":"這標示出了“趣”作爲我國古代文論審美範疇的盛興。"},{"english":"The captain plotted out the ship's course and told the crew to get ready.","chinese":"船長標示出船的航線並讓船員們做好準備。"},{"english":"Bulk containers must be properly placarded and marked.","chinese":"裝貨集裝箱一定要適當地被公告而且標示。"}],"related":[{"definition":["label\/tag\/tab (of a window) (computing)"],"pinyin":["biao1 qian1"],"word":"標籤"},{"definition":["variant of 標誌|标志[biao1 zhi4]"],"pinyin":["biao1 zhi4"],"word":"標識"},{"definition":["superscript"],"pinyin":["shang4 biao1"],"word":"上標"},{"definition":["to differentiate\/to draw a distinction\/to divide into categories"],"pinyin":["qu1 fen1"],"word":"區分"},{"definition":["sign\/mark\/symbol\/to mark up\/(computing) token"],"pinyin":["biao1 ji4"],"word":"標記"},{"definition":["to show\/to illustrate\/to display\/to demonstrate"],"pinyin":["xian3 shi4"],"word":"顯示"},{"definition":["to select and purchase\/to buy"],"pinyin":["xuan3 gou4"],"word":"選購"},{"definition":["to appeal\/to demand (an answer)\/requirement\/demand\/claim\/appeal\/(marketing) message"],"pinyin":["su4 qiu2"],"word":"訴求"},{"definition":["according to\/based on\/basis\/foundation\/CL:個|个[ge4]"],"pinyin":["gen1 ju4"],"word":"根據"},{"definition":["to pack\/to package\/to wrap\/packaging"],"pinyin":["bao1 zhuang1"],"word":"包裝"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["to set up\/to install"],"pinyin":["she4 zhi4"],"word":"設置"},{"definition":["name (of a thing)\/name (of an organization)"],"pinyin":["ming2 cheng1"],"word":"名稱"},{"definition":["rule\/regulation\/rules and regulations"],"pinyin":["gui1 ze2"],"word":"規則"},{"definition":["provision\/to fix\/to set\/to formulate\/to stipulate\/to provide\/regulation\/rule\/CL:個|个[ge4]"],"pinyin":["gui1 ding4"],"word":"規定"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"規範"}]}