{"definition":["iconic"],"pinyin":["biao1 zhi4 xing4"],"simplified":["标志性"],"rank":8265.0,"normalized_rank":0.11563807311852027,"fraction":0.0000113176454106056,"cumulative_fraction":0.9128808531486858,"word":"標誌性","characters":[{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"標"},{"definition":["sign\/mark\/to record\/to write a footnote"],"pinyin":["zhi4"],"word":"誌"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"Looks that last are a hallmark of Bang & Olufsen.","chinese":"看起來，最後是一個標誌性的爆炸和Olufsen。"},{"english":"Daniel, the Yi Gate Tower can be regarded as Longmen's landmark structure.","chinese":"大牛，這義門可以說是龍門鎮的標誌性建築了。"},{"english":"Creative bedding set inspired by the iconic video game console.","chinese":"受到標誌性的視頻遊戲機所啓發的創意牀上用品。"},{"english":"What iconic brands come to mind when you look around your space?","chinese":"看看你周圍的空間，你會想到哪些標誌性品牌呢？"},{"english":"Speed is vital to him. Spontaneity is more than ever the hallmark of good speaking.","chinese":"出口成章現已成爲優秀演講的標誌性特徵。"},{"english":"Perhaps the only thing that`s recognizable is his signature hairstyle.","chinese":"或許唯一能勾起回憶的就是他那標誌性的髮型。"},{"english":"Problems is house-building and their countermeasures are analysed and studied in detail…","chinese":"最後提出住房建設是奔小康的標誌性工程。"},{"english":"The super high-rise New Times plaza structure is the symbol building in Shekou, Shenzhen.","chinese":"超高層建築新時代廣場是深圳蛇口的標誌性建築。"},{"english":"Pumpkins are also a symbol of Halloween.","chinese":"南瓜也是萬聖節的標誌性象徵。"},{"english":"It came to a conclution that serum CHE was a sign of organophosphorus toxicosis.","chinese":"因此，血清CHE是有機磷中毒的標誌性酶類。"},{"english":"This tower is a landmark piece of architecture in Fuliang town.","chinese":"這座塔就是古代浮樑縣的標誌性建築。"},{"english":"Every generation has its life-defining moments.","chinese":"每一代人都有其標誌性的歷史時刻。"},{"english":"Even a Starbucks on Madison Avenue didn't open.","chinese":"麥迪遜小道上標誌性的星巴克都罕有地打烊收歇。"},{"english":"The Bank of China Tower is over there.","chinese":"中銀大廈是香港的標誌性建築之一。"},{"english":"He had shaved his signature beard and moustache.","chinese":"當時他已經颳去了他標誌性的大鬍子和八字須。"},{"english":"Red-tile roofs shaded in trees are a scenic feature of Qingdao.","chinese":"紅瓦綠樹，是青島的標誌性景觀。"}],"related":[]}