{"definition":["grade"],"pinyin":["biao1 hao4"],"simplified":["标号"],"rank":30265.0,"normalized_rank":0.4234466162047207,"fraction":9.21264803125654e-7,"cumulative_fraction":0.9904886759050792,"word":"標號","characters":[{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"標"},{"definition":["ordinal number\/day of a month\/mark\/sign\/business establishment\/size\/ship suffix\/horn (wind instrument)\/bugle call\/assumed name\/to take a pulse\/classifier used to indicate number of people","roar\/cry\/CL:個|个[ge4]"],"pinyin":["hao2","hao4"],"word":"號"}],"containing_words":[],"sentences":[{"english":"Unlabelled terminals must not be used as \"tie points\" for other wires.","chinese":"不可將無標號的接線端當成其它導線的“結點”。"},{"english":"Each delivery man has a table with a route number on it and the mail to deliver.","chinese":"每個快遞員都有一張表，顯示路徑標號和地址。"},{"english":"The light green Pantong No and Art worts, please send them to me asap!","chinese":"請儘快給我淺綠色的色標號和圖片文件。"},{"english":"Enumerates the maximum length for a queue label and pathname.","chinese":"枚舉隊列標號和路徑名稱的長度最大值。"},{"english":"We received our order No. CL 818 yesterday.","chinese":"我方收到了標號爲CL818的那批訂貨。"},{"english":"It was strung at top, center and bottom on 12-gauge spring steel wire.","chinese":"它在上中下三處以12標號的鋼絲拉緊起來。"},{"english":"The analyzer's job is to take apart a string of text and give you back a stream of tokens.","chinese":"分析器的工作是分離一串文本並返回一個標號流。"},{"english":"These different labellings will then be represented by the buttons present in the GUI.","chinese":"這些不同的標號將被代表的按鈕在GUI中。"},{"english":"Some scenic conditions behind, there is no doubt that there is a high grade gasoline supply.","chinese":"一些景區條件落後，紛歧定有高標號的汽油供應。"},{"english":"The name can also be the number of the method to use.","chinese":"這個名字也可以是使用的方法標號。"},{"english":"When it intercepts the event, the plug-in retrieves the file name and changes its label.","chinese":"當它攔截事件時，插件檢索文件名並更改其標號。"},{"english":"Significantly changed steps are numbered and described below.","chinese":"重要更改的步驟已被標號並且在下面描述。"},{"english":"The addition of red mud up to 35% is still possible to produce high early strength cement.","chinese":"當赤泥配比達35%時，可生產高標號早強快硬水泥。"},{"english":"But also do not eliminate cement grade exorbitant , bring about ceramic tile craze.","chinese":"但也不排除水泥標號過高，導致瓷磚開裂。"},{"english":"The anuual capacity of\"Weiyangshan\"high quality cement is 2 Million ton.","chinese":"年生產“蔚陽山”牌高標號水泥200萬噸。"}],"related":[]}