{"definition":["scalar quantity"],"pinyin":["biao1 liang4"],"simplified":["标量"],"rank":43301.0,"normalized_rank":0.6058371692807074,"fraction":2.8173681984352907e-7,"cumulative_fraction":0.9975788629615306,"word":"標量","characters":[{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"標"},{"definition":["capacity\/quantity\/amount\/to estimate\/abbr. for 量詞|量词[liang4 ci2], classifier (in Chinese grammar)\/measure word","to measure"],"pinyin":["liang2","liang4"],"word":"量"}],"containing_words":[],"sentences":[{"english":"Why a scalar value?","chinese":"爲什麼是標量值呢？"},{"english":"Inertia scalars are defined in terms of quantities called inertia vectors.","chinese":"我們將用慣性矢量來定義慣性標量。"},{"english":"The result of the scalar subquery first needs to be transferred to the federated server.","chinese":"首先需要將標量子查詢的結果傳送到聯邦服務器。"},{"english":"There is only a scalar in memory, and it contains a scalar value.","chinese":"每個標量都有唯一的值，或者是字符串或者是引用。"},{"english":"Finally, the whole 32bit scalar micro-processor has verified using FPGA prototyping.","chinese":"最後，對32位標量處理器進行了FPGA驗證。"},{"english":"The scalar state may be a good candidate for the ground scalar glueball.","chinese":"而是基態標量膠球很好的候選者。"},{"english":"Plaintext imbedded into the divisors of a hyperelliptic curve is a key work in HECC.","chinese":"除子標量乘是超橢圓曲線密碼體制中的關鍵運算。"},{"english":"For a pure scalar potential the zero energy bound state does exist, and the fractional charge does exist.","chinese":"對於純標量場，存在零能量束縛態，存在分數電荷。"},{"english":"It was worked out to use two scaler potentials method for calculating magnetic field in aluminium reduction cell.","chinese":"本文采用雙標量位法計算鋁電解槽的磁場。"},{"english":"This paper introduces the concept of periodic constant and the process of transforming induction scalar to difference equation.","chinese":"週期常量是指循環中值呈週期性出現的遞歸標量。"},{"english":"We call those scalars.","chinese":"我們稱他們爲標量。"},{"english":"You can also see which of them are scalar and columnar.","chinese":"還可查看這其中哪些是標量，哪些是柱狀。"},{"english":"Consolidate the values calculated using SIMD into a single scalar return value.","chinese":"聯合SIMD結算的各個結果到一個標量返回值上。"},{"english":"Divisor scalar multiplication is the key operation in hyperelliptic curve cryptosystem.","chinese":"除子標量乘是超橢圓曲線密碼體制中的關鍵運算。"},{"english":"Scalar-valued functions can be invoked where scalar expressions are used.","chinese":"可在使用標量表達式的位置調用標量值函數。"},{"english":"Scalar-valued functions can be invoked where scalar expressions are used.","chinese":"可在使用標量表達式的位置調用標量值函數。"}],"related":[]}