{"definition":["analog signal"],"pinyin":["mo2 ni3 xin4 hao4"],"simplified":["模拟信号"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"模擬信號","characters":[{"definition":["mold\/die\/matrix\/pattern","to imitate\/model\/norm\/pattern"],"pinyin":["mo2","mu2"],"word":"模"},{"definition":["to plan to\/to draft (a plan)\/to imitate\/to assess\/to compare\/pseudo-"],"pinyin":["ni3"],"word":"擬"},{"definition":["letter\/mail\/CL:封[feng1]\/to trust\/to believe\/to profess faith in\/truthful\/confidence\/trust\/at will\/at random"],"pinyin":["xin4"],"word":"信"},{"definition":["ordinal number\/day of a month\/mark\/sign\/business establishment\/size\/ship suffix\/horn (wind instrument)\/bugle call\/assumed name\/to take a pulse\/classifier used to indicate number of people","roar\/cry\/CL:個|个[ge4]"],"pinyin":["hao2","hao4"],"word":"號"}],"containing_words":[],"sentences":[{"english":"First-generation cell phones were basic analog units, based on a scheme that Alexander Graham Bell would recognize.","chinese":"第一代手機技術是基本模擬信號，是基於貝爾的理論。"},{"english":"In computer technology, the larger the number of bits, the more exact analog signals.","chinese":"之中，比特數越高表示模擬信號就越精確。"},{"english":"The voltage of the analog signals in control and protection circuits are all below DC 24V.","chinese":"控制和保護迴路模擬信號的電壓都低於24V直流。"},{"english":"The first essential step in analog-to-digital conversion is to sample an analog signal.","chinese":"模數轉換關鍵性的第一步是對模擬信號進行採樣。"},{"english":"It is used for temperature measurement instruments and system that is an analogue signal output.","chinese":"用於需要有模擬信號輸出的溫度測量儀表和系統。"},{"english":"A device that senses and stores the instantaneous value of an analog signal.","chinese":"一種檢測和存儲模擬信號瞬時值的設備。"},{"english":"The analog signals must be converted to voltage signals suitable for conversion to digital form.","chinese":"模擬信號須轉換成適合於變換到數字形式的電壓信號。"},{"english":"Sampling time for all digital and analog signals is 10 msec .","chinese":"採樣時間爲所有數字和模擬信號是10毫秒。"},{"english":"The analog signals of ultrasonic fault detector are digitalized successfully.","chinese":"成功地將超聲探傷儀輸出的模擬信號數字化。"},{"english":"TV broadcasts here are still being done in analogue.","chinese":"這裏的電視廣播依然使用的是模擬信號。"},{"english":"Two light sources are used for simulating the signal and backscatter light respectively.","chinese":"採用兩個模擬光源，分別模擬信號光和後向散射光。"},{"english":"Well, the first two letters represent the basic analogue signal.","chinese":"好的，前兩個字母的抽像形式代表基礎模擬信號。"}],"related":[]}