{"definition":["fuzzy mathematics"],"pinyin":["mo2 hu5 shu4 xue2"],"simplified":["模糊数学"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"模糊數學","characters":[{"definition":["mold\/die\/matrix\/pattern","to imitate\/model\/norm\/pattern"],"pinyin":["mo2","mu2"],"word":"模"},{"definition":["muddled\/paste\/scorched","paste\/cream"],"pinyin":["hu2","hu4"],"word":"糊"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"The feasibility of applying fuzzy mathematics method to appraise manuscript quality is studied. How to apply Method No.","chinese":"探討應用模糊數學方法評價論文稿質量的可行性。"},{"english":"The paper describes operation dynamics of motor-cars with fuzzy mathematical method.","chinese":"該文利用模糊數學方法對車輛的運行動態進行描述。"},{"english":"The illegibility mathematics is used for evaluating water quality.","chinese":"將模糊數學應用於水質評價中。"},{"english":"So some fuzzy math is required.","chinese":"所以就需要引入一些模糊數學了。"},{"english":"This paper deals elementally with some views concerning the integration of philosophy into fuzzy mathematics.","chinese":"本文主要淺談模糊數學與哲學相結合的一些看法。"},{"english":"A fuzzy mathematics method about whole pass judgment of examination paper .","chinese":"試卷整體評判的模糊數學方法。"},{"english":"A kind of self -tuning PID regulator based on fuzzy mathematics theory is introduced.","chinese":"基於模糊數學理論設計了一種自校正PID調節器。"},{"english":"New textbook contents and systems are assessed with the tools of fuzzy mathematics.","chinese":"運用模糊數學的知識對新教材的內容和體系進行評估。"},{"english":"In this paper, we studied the content validity of the examination questions in physics by means of fuzzy mathematics.","chinese":"本文動用模糊數學方法研究了物理試題的內容效度。"},{"english":"Impact on price of commodity apartment of second-hand house;","chinese":"本文運用模糊數學知識來解決二手房屋的價格評估。"},{"english":"In this paper, a method based on fuzzy mathematics to fuse multimodality medical images was presented.","chinese":"提出一種基於模糊數學的方法來融合多模醫學圖像。"},{"english":"Programmes of the general transport layout are evaluated by fuzzy method.","chinese":"利用模糊數學的方法對總圖運輸設計方案進行了評價。"},{"english":"Research on application of fuzzy mathematics to water quality evaluation of wetland.","chinese":"模糊數學在溼地水質評價中的應用研究。"},{"english":"Fuzzy multifactorial decision is one of the widely applied methods in fuzzy mathematics.","chinese":"模糊綜合評判是應用較爲廣泛的模糊數學方法之一。"},{"english":"Adopting fuzzy mathematics, the paper evaluated synthetically the quality of Tibetan parched flour made from different feed proportioning.","chinese":"應用模糊數學的方法綜合評價糌粑感官質量。"}],"related":[]}