{"definition":["sample\/specimen"],"pinyin":["yang4 pin3"],"simplified":["样品"],"rank":8291.0,"normalized_rank":0.11600184685125853,"fraction":0.000011273414189666435,"cumulative_fraction":0.9131745817386212,"word":"樣品","characters":[{"definition":["manner\/pattern\/way\/appearance\/shape\/classifier: kind, type"],"pinyin":["yang4"],"word":"樣"},{"definition":["article\/commodity\/product\/goods\/kind\/grade\/rank\/character\/disposition\/nature\/temperament\/variety\/to taste sth\/to sample\/to criticize\/to comment\/to judge\/to size up\/fret (on a guitar or lute)"],"pinyin":["pin3"],"word":"品"}],"containing_words":[],"sentences":[{"english":"The shipping charges for returning samples will be added to your final invoice.","chinese":"運費爲返回的樣品將增加來您最後的發貨票。"},{"english":"Result Determin the best prescription approach and prepare the samples.","chinese":"結果確定處方最佳工藝並製備樣品。"},{"english":"Does the supplier have adequate equipment and facilities for performing ISIR's?","chinese":"供應商是否有足夠的設備進行樣品檢驗？"},{"english":"For biological products, samples from several consecutively manufactured batches should be submitted.","chinese":"對於生物製品，應當要提交連續幾個生產批次的樣品。"},{"english":"What Chastain was wearing was, in fact, a prototype for the Nike Inner Actives range of sports underwear.","chinese":"其實，查斯頓穿的是耐克運動內衣系列的樣品。"},{"english":"The re-inspection will only be conducted to the sampled samples the re-inspection result shall be final.","chinese":"複驗只對抽取留存的樣品，複驗結果爲最終依據。"},{"english":"The monitoring system samples stack gas at a rate proportional to the stack gas volumetric flow rate.","chinese":"煙道氣樣品的監控系統速率成正比的煙氣體積流量。"},{"english":"Please have a look at those samples.","chinese":"請給我望一上這些樣品。"},{"english":"The physical and chemical properties of the carbon black are detected, and its microstructure is analysed by High Revolution Electromicroscopy (HREM) and X-ray Diffraction.","chinese":"射線衍射和高分辨率透射電鏡分析了樣品的微觀結構。"},{"english":"Figure 3. A sample customized menu of favorite commands.","chinese":"圖形⒊一個定製喜愛命令的菜單樣品。"},{"english":"Doing so would help prevent the sample from becoming unnecessarily moist.","chinese":"這樣做會有助於阻止樣品不必要的受潮。"},{"english":"The bath also performs general laboratory applications, such as incubation and sample tempering.","chinese":"浴槽也可用於如孵育和樣品保溫等類常規實驗。"},{"english":"The results of two three-ply samples calculated by this method are in good agreement with experimental data.","chinese":"給出的兩個三層樣品的計算結果與實驗值符合得很好。"},{"english":"The goods submitted do not corresppond with the sample sent.","chinese":"到貨與惠送樣品並不相同。"},{"english":"A specimen which is much thicker than the penetration depth decays exponentially.","chinese":"一個比穿深透度厚得多的樣品，按指數律衰減。"},{"english":"A multi-station rotary sample stage is disclosed.","chinese":"一種多工位旋轉樣品臺。"}],"related":[{"definition":["sample\/specimen"],"pinyin":["yang4 ben3"],"word":"樣本"},{"definition":["to detect\/to test\/detection\/sensing"],"pinyin":["jian3 ce4"],"word":"檢測"},{"definition":["factory\/factory owners"],"pinyin":["chang3 jia1"],"word":"廠家"},{"definition":["plastic\/synthetic resin\/plastic cement"],"pinyin":["su4 jiao1"],"word":"塑膠"},{"definition":["to test (machinery etc)\/to test (students)\/test\/quiz\/exam\/beta (software)"],"pinyin":["ce4 shi4"],"word":"測試"},{"definition":["survey\/to measure\/to gauge\/to determine"],"pinyin":["ce4 liang2"],"word":"測量"},{"definition":["to procure (for an enterprise etc)\/to purchase"],"pinyin":["cai3 gou4"],"word":"採購"},{"definition":["sample\/sampling"],"pinyin":["chou1 yang4"],"word":"抽樣"},{"definition":["to take a sample"],"pinyin":["qu3 yang4"],"word":"取樣"},{"definition":["agricultural produce"],"pinyin":["nong2 chan3 pin3"],"word":"農產品"},{"definition":["to cross the limit\/to be over the accepted norm\/excessive"],"pinyin":["chao1 biao1"],"word":"超標"},{"definition":["to indicate"],"pinyin":["biao1 shi4"],"word":"標示"},{"definition":["reagent"],"pinyin":["shi4 ji4"],"word":"試劑"},{"definition":["kind\/genus\/type\/category\/variety\/species\/sort\/class"],"pinyin":["zhong3 lei4"],"word":"種類"},{"definition":["to produce\/to manufacture\/to give birth to a child"],"pinyin":["sheng1 chan3"],"word":"生產"},{"definition":["to detect\/to examine and discover\/to sense"],"pinyin":["jian3 chu1"],"word":"檢出"}]}