{"definition":["dendrite (branched projection of a neuron)"],"pinyin":["shu4 tu1"],"simplified":["树突"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"樹突","characters":[{"definition":["tree\/CL:棵[ke1]\/to cultivate\/to set up"],"pinyin":["shu4"],"word":"樹"},{"definition":["to dash\/to move forward quickly\/to bulge\/to protrude\/to break through\/to rush out\/sudden\/Taiwan pr. [tu2]"],"pinyin":["tu1"],"word":"突"}],"containing_words":[{"definition":["dendritic cell"],"pinyin":["shu4 tu1 zhuang4 xi4 bao1"],"word":"樹突狀細胞"}],"sentences":[{"english":"Liver-derived dendritic cells belong to the antigen-presenting cells.","chinese":"肝樹突狀細胞屬於抗原遞呈細胞。"},{"english":"Dendritic cells induce efficient and specific immune response against liver cancer in vitro.","chinese":"肝癌病人樹突狀細胞誘導高效而特異的抗肝癌免疫。"},{"english":"The dendrites usually create a weak network of connections between neurons.","chinese":"樹突通常創造連接神經元之間的一種弱網。"},{"english":"Occasional enlarged and rounded spines were also seen in control slices.","chinese":"偶爾在對照的腦片上可以看見增粗和圓形的樹突棘。"},{"english":"Results The tonsillar dendritic cell sarcoma had no characteristic clinical manifestations.","chinese":"結果扁桃體樹突狀細胞肉瘤無特徵性臨牀表現。"},{"english":"Objective To investigate the function of dendritic cells in smoking person.","chinese":"目的研究吸菸者樹突狀細胞的功能。"},{"english":"Therewere two or three dendrites in each olfactory hair of male antenna.","chinese":"雄蛾觸角的每個毛形感器內有二個或三個樹突。"},{"english":"The key difference involves something known as dendritic cells.","chinese":"關鍵的差異涉及到某些樹突狀細胞。"},{"english":"But how might dim light have brought about dendritic spine changes?","chinese":"但是昏暗光是如何引起樹突棘數量變化的呢？"},{"english":"I have attached images of few of the loose stones and Pendants of fine quality dendritic agate.","chinese":"我附加圖片的幾個鬆散的石塊和吊墜優質樹突狀瑪瑙。"},{"english":"Testosterone can induces the increase in number of neurons and dendritic growth and synaptogenesis in adulthood.","chinese":"睾酮能誘導神經元數目增加，樹突增長和突觸形成。"},{"english":"There was thick wall and no dendrite in mechanoreceptor.","chinese":"機械感器壁厚無孔，淋巴腔中無樹突。"}],"related":[]}