{"definition":["olivine (rock-forming mineral magnesium-iron silicate (Mg,Fe)2SiO4)\/peridot"],"pinyin":["gan3 lan3 shi2"],"simplified":["橄榄石"],"rank":57251.0,"normalized_rank":0.8010157681921845,"fraction":6.145658090887344e-8,"cumulative_fraction":0.9996739437887312,"word":"橄欖石","characters":[{"definition":["olive"],"pinyin":["gan3"],"word":"橄"},{"definition":["olive"],"pinyin":["lan3"],"word":"欖"},{"definition":["dry measure for grain equal to ten dou 斗\/ten pecks\/one hundred liters","rock\/stone\/stone inscription\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Shi"],"pinyin":["Shi2","dan4","shi2"],"word":"石"}],"containing_words":[],"sentences":[{"english":"Lunar olivine was created by great volcanoes called fire fountains, which sprayed superheated lava into the sky.","chinese":"月之橄欖石產生於名爲“火噴泉”的巨型火山。"},{"english":"It is made of Magnesium and Iron Silicate , and it is a member of the Chrysolite mineral family.","chinese":"它是由鎂，矽鐵，它是一個成員橄欖石礦物家庭。"},{"english":"This resembles volcanic ash, which is predominantly composed of minerals such as pyroxene and olivine.","chinese":"這類似於火山灰，這是主要組成礦物如輝石和橄欖石。"},{"english":"Rhodium-plated pierced earrings with Jonquil crystal lemon and leaf in Peridot crystal.","chinese":"銠鍍穿耳環與信奉水晶檸檬葉在橄欖石晶體。"},{"english":"Peridot is given as a symbol of fame, dignity, and protection.","chinese":"橄欖石是給出一個聲譽，尊嚴的象徵，和保護。"},{"english":"These are globules of once-molten rock trapped inside crystals in the rock.","chinese":"這些源自熔岩的球狀岩石被包裹在橄欖石晶體裏。"},{"english":"Forsteritic olivine almost invariably represents primary precipitate material .","chinese":"鎂質橄欖石几乎總是代表了原生沉澱物。"},{"english":"Peridot, to go still.","chinese":"橄欖石，欲走還留。"},{"english":"A consistent zonal arrangement is a constant feature of those complexes that contain olivine-bearing rocks .","chinese":"穩定的帶狀排列是這些含橄欖石巖類雜巖的固定特點。"},{"english":"So, with its cloudy walls of chrysolite , jasper, and sapphire.","chinese":"於是，鑲嵌橄欖石，碧玉，藍寶石的雲牆中間。"},{"english":"Olivine-type LiFePO4 cathode material was successfully synthesized by co-precipitation method.","chinese":"採用共沉澱法合成了橄欖石型磷酸亞鐵鋰正極材料。"},{"english":"The olivine grains in the troctolite of the Upper Zone are rather short and thick.","chinese":"上巖帶橄長巖中的橄欖石顆粒相當短粗。"},{"english":"The olivine from the Laoheishan is chrysolite.","chinese":"老黑山熔岩中的橄欖石是貴橄欖石。"},{"english":"The olivine from the Laoheishan is chrysolite.","chinese":"老黑山熔岩中的橄欖石是貴橄欖石。"},{"english":"Peridot raw material and Peridot finished product.","chinese":"主要以批發銷售橄欖石原料及成品爲主。"},{"english":"Rhodium-plated hair clip with Light Siam crystal apple and leaf in Peridot crystal.","chinese":"銠鍍頭髮夾輕暹水晶蘋果和葉子在橄欖石晶體。"}],"related":[]}