{"definition":["violently\/flagrantly"],"pinyin":["heng2 jia1"],"simplified":["横加"],"rank":40919.0,"normalized_rank":0.5725098988429197,"fraction":3.5107619260294685e-7,"cumulative_fraction":0.9968270942407332,"word":"橫加","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng2","heng4"],"word":"橫"},{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"}],"containing_words":[{"definition":["to blame unscrupulously"],"pinyin":["heng2 jia1 zhi3 ze2"],"word":"橫加指責"}],"sentences":[{"english":"They made comments about the too-colourful waistcoats that he wore.","chinese":"他們對他色彩豔麗的馬甲橫加評論。"},{"english":"Though I was yet a mere child my father did not place any restriction on my wanderings.","chinese":"那時我還是個孩子，父親對我的走動，從不橫加阻攔。"},{"english":"There should be no arbitrary meddling in this process.","chinese":"在這方面，不要橫加干涉。"},{"english":"Political paralysis has given rise to accusations of meddling by India.","chinese":"人們指責是印度的橫加干涉導致了尼泊爾的政治癱瘓。"},{"english":"He's always making unwarranted accusations against others. His manner is intolerably aggressive.","chinese":"他動不動就對別人橫加指責，氣勢逼人。"},{"english":"If you do anything unique, people will attack you for it.","chinese":"如果你行事很獨特，人們就會對你的行爲橫加指責。"},{"english":"Forget the criticism about not making money with Android.","chinese":"不要再對谷歌未能利用安卓吸金而橫加指責。"},{"english":"They wouldn't welcome any officious interference from the police.","chinese":"他們不會歡迎任何來自警方的橫加干涉。"},{"english":"They made rude remarks about her appearance.","chinese":"他們對她的外表橫加粗暴的評論。"},{"english":"That's probably better than constant meddling or overbearing behavior.","chinese":"這也許比事事橫加干涉和傲慢專橫的行爲要好。"},{"english":"Yet they couldn't condemn the Dutch fast enough.","chinese":"然而他們卻無法對荷蘭橫加指責。"},{"english":"Society ought to promote the exercise of virtue, not obstruct it.","chinese":"社會應讓人們容易地修練德行，勿橫加障礙。"},{"english":"We must not point fingers and cast blame.","chinese":"我們一定不要指指點點，橫加指責。"}],"related":[]}