{"definition":["to overflow\/transverse flow\/to flow over\/cross flow"],"pinyin":["heng2 liu2"],"simplified":["横流"],"rank":24019.0,"normalized_rank":0.33605697256306577,"fraction":0.0000016209355686748948,"cumulative_fraction":0.9827694354899604,"word":"橫流","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng2","heng4"],"word":"橫"},{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"}],"containing_words":[{"definition":["tears and mucus flowing profusely\/sniveling\/in a tragic state"],"pinyin":["ti4 si4 heng2 liu2"],"word":"涕泗橫流"},{"definition":["to be overflowing with tears (idiom)"],"pinyin":["yan3 lei4 heng4 liu2"],"word":"眼淚橫流"}],"sentences":[{"english":"The cross-flow influence the flow field of downstream outflow.","chinese":"橫流對通道下游孔內流場影響較大。"},{"english":"The fan induces air through the entire louver face of a crossflow tower.","chinese":"誘導風機空氣在整個百葉窗面對橫流塔。"},{"english":"Being vex'd a sea nourish'd with lovers' tears: What is it else?","chinese":"煩惱時，愛是情侶淚水橫流的海洋。愛還是什麼？"},{"english":"Materialistic, warm taste moved closer, love is tapering off.","chinese":"物慾橫流，暖味越走越近，愛情卻漸行漸遠。"},{"english":"We are all changed, in this materialistic age.","chinese":"我們都變了，在這個物慾橫流的時代。"},{"english":"Investigations on an impinging jet under the influence of crossflow are carried out in this dissertation.","chinese":"本文的研究對象爲受橫流影響的衝擊射流。"},{"english":"When the seas are in turmoil, heroes are on their mettle.","chinese":"滄海橫流，方顯出英雄本色。"},{"english":"Can the torn and bloody victim \"love\" the blood-splashed jaws that rend him limb from limb?","chinese":"鮮血橫流的受害者能否“愛”那將他撕碎的血口？"},{"english":"The utility model belongs to the field of transverse flow direct contact water showering cooling towers.","chinese":"本實用新型屬於橫流直接接觸水淋冷卻塔領域。"},{"english":"The floods surged over the village.","chinese":"村子裏洪水四處橫流。"},{"english":"It's more of a \"high money\" age.","chinese":"現在是一個物慾橫流金錢至上的時代。"}],"related":[]}