{"definition":["horizontal section"],"pinyin":["heng2 duan4 mian4"],"simplified":["横断面"],"rank":48641.0,"normalized_rank":0.680550697466176,"fraction":1.6626851699574073e-7,"cumulative_fraction":0.9987491479327892,"word":"橫斷面","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng2","heng4"],"word":"橫"},{"definition":["to break\/to snap\/to cut off\/to give up or abstain from sth\/to judge\/(usu. used in the negative) absolutely\/definitely\/decidedly"],"pinyin":["duan4"],"word":"斷"},{"definition":["face\/side\/surface\/aspect\/top\/classifier for flat surfaces such as drums, mirrors, flags etc"],"pinyin":["mian4"],"word":"面"}],"containing_words":[],"sentences":[{"english":"The cross section design is an important part of the road design.","chinese":"道路橫斷面設計是道路設計的重要組成部分。"},{"english":"The process of subgrade drainage and railway-use land design is related with cross section design directly.","chinese":"路基排水用地設計與橫斷面設計成果直接相關。"},{"english":"The dominant plane for showing the parapharyngeal space was suggested.","chinese":"並提出咽旁間隙在橫斷面上的最佳顯示平面。"},{"english":"Seed flattened dorsally in cross section, face concave .","chinese":"種子背面扁平在橫斷面上，表面凹。"},{"english":"Also this paper discusses the cross-sectional elements and the cross-sectional forms of the connected-way.","chinese":"探討了銜接道路橫斷面構成要素和採用的橫斷面形式。"},{"english":"Also this paper discusses the cross-sectional elements and the cross-sectional forms of the connected-way.","chinese":"探討了銜接道路橫斷面構成要素和採用的橫斷面形式。"},{"english":"Method cluster sampling and cross sectional study.","chinese":"方法整羣抽樣，橫斷面調查。"},{"english":"The domes are circular or ovoid in cross-section .","chinese":"穹丘的橫斷面爲圓形或卵圓形。"},{"english":"The domes are circular or ovoid in cross - section .","chinese":"穹丘的橫斷面爲圓形或卵圓形。"},{"english":"Here is a transverse MRI scan that reveals the lobulated ependymoma .","chinese":"橫斷面MRI顯示分葉狀室管膜瘤。"}],"related":[]}