{"definition":["to overflow\/brimming with"],"pinyin":["heng2 yi4"],"simplified":["横溢"],"rank":47850.0,"normalized_rank":0.6694835812124859,"fraction":1.8042834680134816e-7,"cumulative_fraction":0.9986122140578426,"word":"橫溢","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng2","heng4"],"word":"橫"},{"definition":["to overflow\/(literary) excessive\/old variant of 鎰|镒[yi4]"],"pinyin":["yi4"],"word":"溢"}],"containing_words":[{"definition":["brimming over with talent (esp. literary)\/brilliant"],"pinyin":["cai2 hua2 heng2 yi4"],"word":"才華橫溢"}],"sentences":[{"english":"I am a talented worrier, too.","chinese":"但我也是個才氣橫溢的愛發愁的人。"},{"english":"Li Bai was a Tang poet of superb talent.","chinese":"李白是唐代一位才氣橫溢的詩人。"},{"english":"This brilliant engineer and droid technician operated out of the Minos Cluster.","chinese":"這位才華橫溢的機器人工程技師在米諾斯星團外工作。"},{"english":"Hemingway is a writer of remarkable genius.","chinese":"海明威是才華橫溢的作家。"},{"english":"Up to the time of his death, his notable make him become the legendry figue in music.","chinese":"早在他去世前很久，他橫溢的音樂才華就成爲了傳奇。"},{"english":"He was not only very talented, but also very upright.","chinese":"他不但才華橫溢，而且爲人耿直。"},{"english":"Jackie was running around with all these brilliant people.","chinese":"傑姬混跡於這些才華橫溢的人之間。"},{"english":"\"Cori is talented beyond thinking like a worm, \" Dr.","chinese":"葛利不僅愛思考，更是才華橫溢。"},{"english":"A Xin is not only handsome, but also talented.","chinese":"阿信，不但擁有帥氣的外表，而且才華橫溢。"},{"english":"Regardless of the genius of the novelists readers become less and less interested in pure literature.","chinese":"儘管小說家才華橫溢，然而純文學的讀者越來越少。"},{"english":"I have been lucky to be able to work with many talented coauthors.","chinese":"我非常有幸能與諸多才華橫溢的學者共事。"},{"english":"There are many smart and talented people inside Microsoft who know what to do.","chinese":"微軟公司裏還有很多才華橫溢的聰明人知道該怎樣做。"},{"english":"She is a prodigiously talented pianist.","chinese":"她是才華橫溢的鋼琴家。"},{"english":"They have been brilliant before. Exciting, fast-breaking and smooth.","chinese":"他們一直是一支才華橫溢的球隊，興奮。"},{"english":"I have never seen such a talented man as he is.","chinese":"我從來沒有見過象他這樣才華橫溢的人。"},{"english":"But she thinks she is like the most talented kid in the school.","chinese":"但她覺得她就是這學校最才華橫溢得人。"}],"related":[]}