{"definition":["to cross\/to traverse"],"pinyin":["heng2 chuan1"],"simplified":["横穿"],"rank":14868.0,"normalized_rank":0.20802260993661945,"fraction":0.000004207367161414609,"cumulative_fraction":0.9584815427573876,"word":"橫穿","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng2","heng4"],"word":"橫"},{"definition":["to wear\/to put on\/to dress\/to bore through\/to pierce\/to perforate\/to penetrate\/to pass through\/to thread"],"pinyin":["chuan1"],"word":"穿"}],"containing_words":[],"sentences":[{"english":"The high tension line inside the village uses unified string to divide each, cannot traverse a house owned by a citizen.","chinese":"村內高壓線使用統一的線杆分到各戶，不能橫穿民房。"},{"english":"Wildebeests migrate in great herds across the Serengeti. The key to their mass movement is the rain.","chinese":"牛羚羣要橫穿塞倫蓋蒂進行大遷移，其關鍵是雨水。"},{"english":"I don't think jaywalking is allowed .","chinese":"我不認爲隨意橫穿馬路是允許的。"},{"english":"She was partly to blame for failing to look as she crossed the road.","chinese":"她橫穿馬路時沒有看車，應承擔部分責任。"},{"english":"The post-office is only three blocks away.","chinese":"只橫穿三條馬路就是郵局。"},{"english":"The new main north-south road in Belize was cut through the forest only four or five miles away.","chinese":"一條縱貫伯利茲南北的路就在四五英里外橫穿森林。"},{"english":"The little girl is afraid to go across the street.","chinese":"這個小女孩不敢橫穿馬路。"},{"english":"Highway 50 cut through an astounding forest of old-growth timber.","chinese":"50號公路橫穿一片驚人的古木森林。"},{"english":"No hobgoblin appeared, although a black cat did try to cross my path.","chinese":"沒有妖怪出現，只有一隻黑貓企圖橫穿馬路。"},{"english":"It lies to the north of Ascalon across a mountain range.","chinese":"它位於阿斯卡隆的北部，橫穿一座山脈。"},{"english":"Let the Stapletons know that you' re going to walk home across the moor.","chinese":"讓他們知道，您是打算橫穿沼地走回家的。"},{"english":"The smooth topography is easy to work across at harvest time.","chinese":"平坦的地形有利於在收穫時橫穿畦田。"},{"english":"The policeman warned him against crossing the road at that place.","chinese":"警察提醒他不要在那個地方橫穿馬路。"},{"english":"Stop here to gas up before crossing the desert.","chinese":"橫穿沙漠前要在這裏停車加足汽油。"},{"english":"The little girl goes across the road.","chinese":"這個小女孩橫穿馬路。"},{"english":"Do you see those children jaywalking?","chinese":"你看見那些孩子橫穿馬路了嗎？"}],"related":[]}