{"definition":["striated muscle"],"pinyin":["heng2 wen2 ji1"],"simplified":["横纹肌"],"rank":61386.0,"normalized_rank":0.8588697829949771,"fraction":3.3282898924520535e-8,"cumulative_fraction":0.9998666348401002,"word":"橫紋肌","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng2","heng4"],"word":"橫"},{"definition":["line\/trace\/mark\/pattern\/grain (of wood etc)"],"pinyin":["wen2"],"word":"紋"},{"definition":["flesh\/muscle"],"pinyin":["ji1"],"word":"肌"}],"containing_words":[],"sentences":[{"english":"It reviewed the progress on etiopathogenisis of non-traumatic rhabdomyolysis (NRML) patients and their nursing.","chinese":"綜述了非創傷性橫紋肌溶解症的病因及護理進展。"},{"english":"Fenarol has proved to be effective as a striated muscle relaxant.","chinese":"已證明芬那露爲一種有效的橫紋肌松施藥。"},{"english":"Transversus linguae of lingual muscles are more developed. The gustatory glands are seen in radix linguae .","chinese":"舌肌的橫紋肌發達，味腺只見於舌根部。"},{"english":"Rhabdomyosarcoma is the most common soft tissue malignancy of the head and neck in children.","chinese":"橫紋肌肉瘤是兒童最常見的頭頸部軟組織惡性腫瘤。"},{"english":"No cases of rhabdomyolysis were reported, nor was there a risk of developing liver enzyme elevations .","chinese":"沒有關於橫紋肌溶解的報道，也沒有肝酶升高的風險。"},{"english":"Rhabdomyosarcoma is the most common soft tissue sarcoma in children and adolescents.","chinese":"橫紋肌肉瘤是兒童時期最常見的一種軟組織肉瘤。"},{"english":"Objective To investigate the clinicopathological characteristics of rhabdoid meningioma.","chinese":"目的探討橫紋肌樣型腦膜瘤的臨牀病理特點。"},{"english":"At first the appearance will be of an irregular orb, striated .","chinese":"首先外觀將是一個不規則的球，橫紋肌。"},{"english":"Pathological diagnosis: All were embryonal rhabdomyosarcoma.","chinese":"病理診斷均爲胚胎型橫紋肌肉瘤。"},{"english":"The most serious form of myopathy is called rhabdomyolysis.","chinese":"肌病最嚴重的形式被稱作橫紋肌溶解。"},{"english":"Histological examination of the mass revealed embryonal rhabdomyosarcoma.","chinese":"組織切片顯示，此腫塊是胚胎型橫紋肌肉瘤。"}],"related":[]}