{"definition":["to span\/to stretch across\/to travel across"],"pinyin":["heng2 kua4"],"simplified":["横跨"],"rank":14749.0,"normalized_rank":0.20635764554447134,"fraction":0.0000042696996080846536,"cumulative_fraction":0.9579770645158208,"word":"橫跨","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng2","heng4"],"word":"橫"},{"definition":["to step across\/to stride over\/to straddle\/to span"],"pinyin":["kua4"],"word":"跨"}],"containing_words":[],"sentences":[{"english":"This is one of many cultural chasms across the Atlantic.","chinese":"這只是橫跨大西洋的諸多文化鴻溝之一。"},{"english":"This bridge straddles the Eurasia.","chinese":"這座橋橫跨歐亞大陸。"},{"english":"Two bridges spanning the glass-covered intermediate space connect the exhibition area with the southern element.","chinese":"兩座橋橫跨玻璃覆蓋的空間連接了南面的展覽面積。"},{"english":"A covered bridge traverses the stream.","chinese":"一座有頂蓋的橋橫跨這條河流。"},{"english":"The first white settlers traveled across America in wagons.","chinese":"第一批白人定居者橫跨美洲大陸時乘的是四輪馬車。"},{"english":"A pedestrian way passage links up the footbridge across Siu Sai Wan Road.","chinese":"行人通道連接橫跨小西灣道的行人天橋。"},{"english":"Why did the Emperor Hadrian build a wall right across England?","chinese":"爲什麼哈德良皇帝建造了一座橫跨英格蘭的城牆？"},{"english":"The Mon and Pyu kingdoms were an active overland trade route between India and China.","chinese":"孟國和驃國是中印兩國間橫跨大陸的活躍的通商之道。"},{"english":"This is the bridge striding between the two countries.","chinese":"這是座橫跨兩個國家的橋樑。"},{"english":"Russia stretches across much of the north of the supercontinent of Eurasia.","chinese":"俄羅斯橫跨歐亞大陸北部的大部分地區。"},{"english":"Across the river lies a newly-built steel bridge.","chinese":"新建的一座鐵橋橫跨這條河流。"},{"english":"Straddling the ridge of a mountain range shaped like a dragon’s back is, appropriately enough, Dragon’s Back Trail.","chinese":"橫跨山脈的形狀像龍的背，真的像一條龍在那裏。"},{"english":"Across the borders that divide forests of stone standing petrified.","chinese":"橫跨把森林分開的站立的石頭界碑。"},{"english":"Simply supported reinforced concrete bridges spanning the spillways all came off their bearings.","chinese":"由泄水壩支撐的橫跨水泥公路完全脫離了它的承載體。"},{"english":"Up ahead appeared something like a sluice gate, straddling the tracks.","chinese":"前方出現了一個大水閘似的建築，攔腰橫跨在鐵道上。"},{"english":"Software Description: About Dragons Lair, An animated mythical dragon flys across your screen.","chinese":"活生生神話的龍橫跨你的屏幕飛行。"}],"related":[]}