{"definition":["to oppress\/to rule as a despot\/to tyrannize"],"pinyin":["heng2 xing2 ba4 dao4"],"simplified":["横行霸道"],"rank":40736.0,"normalized_rank":0.569949491416339,"fraction":3.5808311869231965e-7,"cumulative_fraction":0.9967622598835152,"word":"橫行霸道","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng2","heng4"],"word":"橫"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"},{"definition":["hegemon\/tyrant\/lord\/feudal chief\/to rule by force\/to usurp\/(in modern advertising) master"],"pinyin":["ba4"],"word":"霸"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"}],"containing_words":[],"sentences":[{"english":"There is no law and order and motorcycle gangs terrorize the country.","chinese":"世間沒有法律和秩序，只有飛車黨橫行霸道。"},{"english":"The more the reactionaries lash out, the more resistance they provoke.","chinese":"越是橫行霸道，就越發激起更強烈的反抗。"},{"english":"The street was overrun by the bullies last year.","chinese":"去年那些暴徒在街上橫行霸道，無惡不作。"},{"english":"The Fascists once tyrannized a large part of the world.","chinese":"法西斯曾在世界很大範圍內橫行霸道。"},{"english":"During the Second World War, China had been overrun by Japanese invaders.","chinese":"二戰期間，日本侵略者在中國橫行霸道，無惡不作。"},{"english":"For many hundreds of years, the armies of the Dark Gods had ruled triumphant over the realms.","chinese":"數百年來，黑暗之神的軍隊一直在諸域橫行霸道。"}],"related":[{"definition":["to stir up public sentiment by false statements (idiom)\/to resort to demagogy"],"pinyin":["gu3 huo4 ren2 xin1"],"word":"蠱惑人心"},{"definition":["feudalism"],"pinyin":["feng1 jian4 zhu3 yi4"],"word":"封建主義"},{"definition":["to condemn in speech and in writing (idiom)\/to denounce by word and pen"],"pinyin":["kou3 zhu1 bi3 fa2"],"word":"口誅筆伐"},{"definition":["to cut weeds and eliminate the roots (idiom); to destroy root and branch\/to eliminate completely"],"pinyin":["zhan3 cao3 chu2 gen1"],"word":"斬草除根"},{"definition":["to plot and kill sb for his property (idiom); to murder for money"],"pinyin":["mou2 cai2 hai4 ming4"],"word":"謀財害命"},{"definition":["traitor"],"pinyin":["mai4 guo2 zei2"],"word":"賣國賊"},{"definition":["to ask oneself honestly\/to search in one's heart"],"pinyin":["men2 xin1 zi4 wen4"],"word":"捫心自問"},{"definition":["to watch the fires burning across the river\/to delay entering the fray until all others have been exhausted by fighting amongst themselves (idiom)"],"pinyin":["ge2 an4 guan1 huo3"],"word":"隔岸觀火"},{"definition":["anger against a common enemy (idiom); joined in opposition to the same adversary"],"pinyin":["tong2 chou2 di2 kai4"],"word":"同仇敵愾"},{"definition":["to fool\/to hoodwink\/to dupe"],"pinyin":["qi1 man2"],"word":"欺瞞"},{"definition":["scramble for power and profit (idiom); power struggle"],"pinyin":["zheng1 quan2 duo2 li4"],"word":"爭權奪利"},{"definition":["to be drowned (figurative and literal)"],"pinyin":["mie4 ding3"],"word":"滅頂"},{"definition":["harmful teachings\/evil doctrine"],"pinyin":["xie2 shuo1"],"word":"邪說"},{"definition":["to disrupt\/to throw into disorder"],"pinyin":["jiao3 luan4"],"word":"攪亂"},{"definition":["to have a clear view of things\/to adapt to circumstances"],"pinyin":["shi2 shi2 wu4"],"word":"識時務"},{"definition":["to act in collusion (idiom); in cahoots with\/villains will look after one another"],"pinyin":["hang4 xie4 yi1 qi4"],"word":"沆瀣一氣"}]}