{"definition":["horizontal traverse\/to cut across\/to cross transversally"],"pinyin":["heng2 guan4"],"simplified":["横贯"],"rank":27687.0,"normalized_rank":0.3873770514739832,"fraction":0.0000011595002901643272,"cumulative_fraction":0.9878228803639888,"word":"橫貫","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng2","heng4"],"word":"橫"},{"definition":["to pierce through\/to pass through\/to be stringed together\/string of 1000 cash"],"pinyin":["guan4"],"word":"貫"}],"containing_words":[],"sentences":[{"english":"A high mountain range, the Trans–Antarctic range, runs from east to west, cutting the continent in two.","chinese":"一條橫貫南極洲的山脈，從東到西將南極洲分爲兩半。"},{"english":"The climber traversed a long horizontal crack in the face of the mountain slope.","chinese":"登山者橫貫了山脈斜坡表面一段長的水平裂縫。"},{"english":"River flows from north-east across the area to the southwest, rolling 50 Wa Lane.","chinese":"流溪河從該區東北部橫貫至西南部，連綿50華里。"},{"english":"Hadrian's Wall is built across Britannia to keep out the barbarians .","chinese":"橫貫大不列顛的哈德連長城被修築用來防禦野蠻人。"},{"english":"So you can imagine what the gas bill would be on a transcontinental flight.","chinese":"所以你也能想象得出橫貫大陸的航線需要多少汽油錢。"},{"english":"Mr GuoWei river from east to west across the whole country.","chinese":"奧果韋河自東向西橫貫全境。"},{"english":"A high mountain range, the Trans?CAntarctic range, runs from east to west, cutting the continent in two.","chinese":"一條橫貫南極洲的山脈，從東到西將南極洲分爲兩半。"},{"english":"Take Trans-Canada Highway 1 South.","chinese":"以橫貫加拿大的1號公路南。"},{"english":"It is advisable to take the trans-Atlantic liner.","chinese":"乘坐橫貫大西洋的班船比較合適。"},{"english":"The start of the Central Cross-Island Highway.","chinese":"進入中部橫貫公路。"},{"english":"Aurora Borealis in the distance on this beautiful night over Europe.","chinese":"在這個美麗的夜晚，橫貫整個歐洲上空的極光。"},{"english":"Because of the Tropic of Cancer and the Trans-Ba Bao Tong had opened up to astronomical Park.","chinese":"因北迴歸線橫貫八寶塘而過，開闢爲天文公園。"},{"english":"The Ghan's revival on the north-south transcontinental line has been even more remarkable.","chinese":"橫貫大洲南北的甘線鐵路的復興更意義非凡。"},{"english":"A hill bridges the town from east to west.","chinese":"一座山從東向西橫貫全鎮。"},{"english":"\"the harmony\" is one has existed since ancient times, thing yawing development idea.","chinese":"“和諧”是一個古已有之，東西橫貫的發展理念。"},{"english":"I crossed the continent and joined together the seas with my great railroads .","chinese":"我們修通了橫貫北美大陸連接東西海岸的鐵路幹線。"}],"related":[]}