{"definition":["tabula (horizontal floor of polyp)"],"pinyin":["heng2 ge2"],"simplified":["横隔"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"橫隔","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng2","heng4"],"word":"橫"},{"definition":["to separate\/to partition\/to stand or lie between\/at a distance from\/after or at an interval of"],"pinyin":["ge2"],"word":"隔"}],"containing_words":[{"definition":["diaphragm"],"pinyin":["heng2 ge2 mo2"],"word":"橫隔膜"}],"sentences":[{"english":"Normal breathing is accomplished by contracting the dome-shaped diaphragm downward into a flat shape.","chinese":"頂狀的橫隔膜向下壓縮成水平狀來完成的。"},{"english":"Practice through horizontal movement of the diaphragm to breath for the completion of abdominal breathing.","chinese":"練功中通過橫隔肌的運動來完成的呼吸爲腹式呼吸。"},{"english":"Often times the footnotes may dictate the design of the diaphragm.","chinese":"很多時候腳註決定了橫隔的設計。"},{"english":"Three thousand miles of ocean lie between you and them.","chinese":"你們和他們之間橫隔着三千海里大洋。"},{"english":"Section 21 below explains how to use the diaphragm to breathe properly.","chinese":"後面在21節中解釋瞭如何使用橫隔膜正確的呼吸。"},{"english":"Switching to diaphragmatic breathing takes concentrated practice.","chinese":"轉變爲橫隔膜呼吸需要全神貫注的練習。"},{"english":"These fungi are septate with simple pores in their cross-walls.","chinese":"這些真菌在它們的橫壁中是具簡單孔的橫隔膜的。"},{"english":"Ralph grasped the idea and hit the shell with air from his diaphragm.","chinese":"拉爾夫抓住了要領，運用橫隔膜的氣往貝殼裏猛送。"},{"english":"Simultaneously the region of the perineum is contracted and pulled up towards the diaphragm.","chinese":"會陰區域收縮的同時向橫隔膜方向提拉。"},{"english":"With the X-frames projecting into the boxes, the transverse diaphragms were formed.","chinese":"把這些X框架放進這些箱體，就成了橫隔梁。"}],"related":[]}