{"definition":["to traverse"],"pinyin":["heng2 guo4"],"simplified":["横过"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"橫過","characters":[{"definition":["harsh and unreasonable\/unexpected","horizontal\/across\/crosswise\/horizontal stroke (in Chinese characters)\/to place (sth) flat (on a surface)\/to cross (a river, etc)\/in a jumble\/chaotic\/(in fixed expressions) harsh and unreasonable\/violent"],"pinyin":["heng2","heng4"],"word":"橫"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"}],"containing_words":[],"sentences":[{"english":"Recurvature follows after it traverses the ridge axis.","chinese":"預料尼伯特將於橫過副高脊線後開始轉向。"},{"english":"The old woman walked across the road in small steps.","chinese":"那位老太太步履蹀躞地橫過馬路。"},{"english":"After crossing Owl Creek, on the road to Poplar Cove, there are three large trees.","chinese":"後橫過道路奧爾河，楊樹灣，有三個大的樹木。"},{"english":"TYPICAL USE:The climber traversed a long horizontal crack in the face of the mountain slope.","chinese":"登山者橫過山表斜坡上的水平裂縫。"},{"english":"You can find deep knife scar across his face.","chinese":"你能發現橫過他臉部的深深的刀疤。"},{"english":"While crossing the street, you must be careful.","chinese":"當你橫過馬路時，一定要小心。"},{"english":"That old woman crossed the road at a snail's pace.","chinese":"那個老太太橫過馬路時，走得慢極了。"},{"english":"Be those old men walking across the street?","chinese":"那些老大爺在橫過馬路嗎？"},{"english":"Long streamers of Northern Lights flashing blue wisps across the sky.","chinese":"北極光的狹長流光，閃射出藍色的光芒，橫過夜空。"},{"english":"A great star came out over the white cherry trees.","chinese":"一顆明星橫過白色的櫻桃樹爬上了夜空。"},{"english":"He saw me and came to me across the road.","chinese":"他看見了我，便橫過馬路向我走來。"},{"english":"It is only some sizes of pebbles, ellipsis like that river crossing.","chinese":"那其實只是些大小不一的卵石，刪節號似的橫過那河。"},{"english":"Passengers mustn't cross the rails.","chinese":"乘客不得橫過鐵路。"},{"english":"Keep your shoulders relaxed and cross your left arm over your chest.","chinese":"把你的肩膀放鬆，然後將左臂舉起，橫過胸前。"},{"english":"Look around before crossing the streets.","chinese":"在橫過馬路的時候先朝各方向看看。"},{"english":"Keep your shoulders relaxed and cross your right arm over your chest.","chinese":"把你的肩膀放鬆，然後將右臂舉起，橫過胸前。"}],"related":[]}