{"definition":["prosecutor's office\/procuratorate"],"pinyin":["jian3 cha2 yuan4"],"simplified":["检察院"],"rank":6877.0,"normalized_rank":0.09621815230926364,"fraction":0.000015128975270343786,"cumulative_fraction":0.8946789084024229,"word":"檢察院","characters":[{"definition":["to check\/to examine\/to inspect\/to exercise restraint"],"pinyin":["jian3"],"word":"檢"},{"definition":["short name for Chahar Province 察哈爾|察哈尔[Cha2 ha1 er3]","to examine\/to inquire\/to observe\/to inspect\/to look into\/obvious\/clearly evident"],"pinyin":["Cha2","cha2"],"word":"察"},{"definition":["courtyard\/institution\/CL:個|个[ge4]"],"pinyin":["yuan4"],"word":"院"}],"containing_words":[{"definition":["PRC Supreme People's Procuratorate (prosecutor's office)"],"pinyin":["Zui4 gao1 Ren2 min2 Jian3 cha2 yuan4"],"word":"最高人民檢察院"}],"sentences":[{"english":"When a public security organ demands the arrest of an offender, it shall obtain the approval of a people's procuratorate.","chinese":"公安機關要求逮捕人犯的時候，由人民檢察院批准。"},{"english":"People's procuratorates at all levels may install judicial police as needed.","chinese":"各級人民檢察院根據需要可以設司法警察。"},{"english":"The people's procuratorates in China are state organs for legal supervision.","chinese":"人民檢察院是國家的法律監督機關。"},{"english":"The public security organ or the people's procuratorate shall inform the prison of the result of its handling.","chinese":"公安機關或者人民檢察院應當將處理結果通知監獄。"},{"english":"The law-enforcement level of the court and procuratorate has been raised remarkably.","chinese":"法院和檢察院的執法水平又有明顯提高。"},{"english":"Prosecutor functions reflect the legal functions of the People's Procuratorate, which is their business.","chinese":"檢察職能體現了人民檢察院的法律職能，屬於其業務。"},{"english":"The procuratorial personnel of the people's procuratorate shall be no less than 2 when performing their duties in a court.","chinese":"人民檢察院檢察人員出庭履行職責時，不得少於二人。"},{"english":"The King County Prosecutor's Office has charged Lewis with making a fraudulent insurance claim.","chinese":"金縣的檢察院已經以保險詐騙罪起訴劉易斯。"},{"english":"The people's court shall conduct a trial denovo of a case protested by the people's procuratorate.","chinese":"人民檢察院提出抗訴的案件，人民法院應當再審。"},{"english":"The People's Procuratorate shall notify the victim of its decision made after reexamination.","chinese":"人民檢察院應當將複查決定告知被害人。"},{"english":"The people's procuratorates at all levels shall ensure the official vehicles as required by the appearance of procuratorial personnel in court.","chinese":"各級人民檢察院應當保證檢察人員出庭所需公務用車。"},{"english":"To undertake the functions of the Work Office of Procuratorate of the State Forestry Bureau;","chinese":"承擔國家林業局檢察院法院工作辦公室的工作。"},{"english":"I don't know if the Procuratorate or the court have re-sought expert testimony on Yang Jia or not.","chinese":"我不知，檢察院或法院有沒有對楊佳重新做司法鑑定。"},{"english":"These ties can have an especially constraining effect on prosecutorial and court decisions.","chinese":"這些關係甚至可以制約檢察院和法院的的決定。"},{"english":"The people's procuratorates have the right to exercise procuratorial authority.","chinese":"人民檢察院是通過行使檢察權來完成自己的任務的。"},{"english":"The competent organ shall, without delay, inform the People's Procuratorate of how it has handled the case.","chinese":"有關主管機關應當將處理結果及時通知人民檢察院。"}],"related":[{"definition":["inquest\/trial\/interrogation\/to try\/to interrogate"],"pinyin":["shen3 xun4"],"word":"審訊"},{"definition":["witness"],"pinyin":["zheng4 ren2"],"word":"證人"},{"definition":["to hear (a case)"],"pinyin":["shen3 li3"],"word":"審理"},{"definition":["to expose\/to bring to light\/to disclose\/revelation"],"pinyin":["jie1 fa1"],"word":"揭發"},{"definition":["to prosecute (criminal)\/the prosecution"],"pinyin":["jian3 kong4"],"word":"檢控"},{"definition":["to investigate (a crime) and prosecute"],"pinyin":["zhen1 ban4"],"word":"偵辦"},{"definition":["to traffic narcotics\/drugs trade\/opium trade"],"pinyin":["fan4 du2"],"word":"販毒"},{"definition":["crime syndicate"],"pinyin":["fan4 zui4 ji2 tuan2"],"word":"犯罪集團"},{"definition":["to sue\/to bring a lawsuit against\/to prosecute"],"pinyin":["qi3 su4"],"word":"起訴"},{"definition":["to claim\/to state\/to proclaim\/to assert"],"pinyin":["sheng1 cheng1"],"word":"聲稱"},{"definition":["to detect\/to investigate"],"pinyin":["zhen1 cha2"],"word":"偵查"},{"definition":["to follow\/to follow up"],"pinyin":["gen1 jin4"],"word":"跟進"},{"definition":["to inspect\/(law) to prosecute\/to investigate"],"pinyin":["jian3 cha2"],"word":"檢察"},{"definition":["to defraud\/to swindle\/to blackmail"],"pinyin":["zha4 pian4"],"word":"詐騙"},{"definition":["to cheat"],"pinyin":["qi1 zha4"],"word":"欺詐"},{"definition":["to accept a bribe"],"pinyin":["shou4 hui4"],"word":"受賄"}]}