{"definition":["detector"],"pinyin":["jian3 ce4 qi4"],"simplified":["检测器"],"rank":47154.0,"normalized_rank":0.6597456382130314,"fraction":1.925444898308885e-7,"cumulative_fraction":0.9984825768745768,"word":"檢測器","characters":[{"definition":["to check\/to examine\/to inspect\/to exercise restraint"],"pinyin":["jian3"],"word":"檢"},{"definition":["to survey\/to measure\/to conjecture"],"pinyin":["ce4"],"word":"測"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[{"definition":["optical detector"],"pinyin":["guang1 jian3 ce4 qi4"],"word":"光檢測器"}],"sentences":[{"english":"A novel UV-vis detector for high performance liquid chromatography (HPLC) was introduced.","chinese":"介紹一種新型的高效液相色譜紫外可見檢測器。"},{"english":"A continuously variable potentiometer is connected into the detector bridge network.","chinese":"在檢測器橋路中，接有可調電位器。"},{"english":"Unfortunately, vehicle speeds cannot be directly measured by single-loop detectors.","chinese":"然而，交通速度並不能直接從單線圈檢測器測量出來。"},{"english":"Capsule images were viewed on a real-time viewer.","chinese":"膠囊圖像被呈現到一臺實時檢測器上。"},{"english":"The abbrev attribute defines a short abbreviation for the detector.","chinese":"abbrev屬性定義檢測器的縮寫。"},{"english":"The high-tech backpacks they wear to monitor pollution are tiny and light as a feather.","chinese":"鴿子背的高科技污染檢測器像羽毛一樣又小又輕。"},{"english":"Several related detectors may be grouped together by sharing the same abbreviation.","chinese":"可以用同一個縮寫將幾個相關的檢測器組織到一起。"},{"english":"Why would you want to write custom bug detectors?","chinese":"爲什麼要編寫自定義缺陷檢測器？"},{"english":"The detector temperature can also affect the observed peak height if its response is temperature dependent.","chinese":"檢測器溫度的改變也會影響那些相應的峯高。"},{"english":"The purity of argon was analyzed by gas chromatography with argon discharge detector.","chinese":"採用氬放電檢測器氣相色譜儀分析了氬氣純度。"},{"english":"The urinary concentrations of lactulose and mannitol were determined by a refractive index detector .","chinese":"上用示差檢測器測定尿液中乳果糖和甘露醇的濃度。"},{"english":"A gas chromagraph equipped with a hydrogen flame detector is used.","chinese":"使用一臺配有氫火焰檢測器的氣相色譜儀。"},{"english":"Two-pole filter(TPF)is a recurrence feedback accumulation detector implementing multi-quantization accumulation.","chinese":"雙極點濾波器是一種遞歸型的反饋積累檢測器。"},{"english":"The Monitor had to be strapped to the runner's waist facing forward.","chinese":"這個檢測器必須面朝前綁在跑步者的腰部。"},{"english":"Open and close valve is equipped for front-end memory type alloy detector and upper shifting fork.","chinese":"並設前端裝記憶合金檢測器與上撥叉配合的開閉閥。"},{"english":"FPD detector easy to fire, greatly increase the workload of the analysis.","chinese":"FPD檢測器容易滅火，分析工作量大大增加。"}],"related":[]}