{"definition":["second after\/second only to"],"pinyin":["ci4 yu2"],"simplified":["次于"],"rank":36844.0,"normalized_rank":0.5154953618849076,"fraction":5.14279179434587e-7,"cumulative_fraction":0.9950782040269148,"word":"次於","characters":[{"definition":["next in sequence\/second\/the second (day, time etc)\/secondary\/vice-\/sub-\/infra-\/inferior quality\/substandard\/order\/sequence\/hypo- (chemistry)\/classifier for enumerated events: time"],"pinyin":["ci4"],"word":"次"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[],"sentences":[{"english":"It's the next best thing to witnessing an actual blastoff.","chinese":"這是僅次於目睹火箭真實升空的最佳選擇。"},{"english":"Airfoil buffet boundary is an important aerodynamic parameter which is second only to the lift-drag ratio.","chinese":"翼型抖振邊界是僅次於升阻比的一項重要氣動指標。"},{"english":"Background Tea which flavor is fragrant is consumed only second to water .","chinese":"茶葉氣味芬芳，是世界上僅次於水的第二大飲料。"},{"english":"Fixed a bug allowing users to appear in a channel twice.","chinese":"固定在允許用戶出現兩次於海峽的故障。"},{"english":"To the writer of real estate advertisements, the autobiographer is the most suspect of prose artists.","chinese":"自傳作者是僅次於房地產廣告作者的最可疑的散文家。"},{"english":"Russia is now PepsiCo's biggest market after the U.S.","chinese":"俄羅斯目前是百事公司僅次於美國的第二大市場。"},{"english":"The American men are ranked third in the world behind volleyball powerhouse Brazil and Russia.","chinese":"美國男排世界排名第三，次於排球大國巴西和俄羅斯。"},{"english":"The next-best solution is to abandon the project altogether.","chinese":"僅次於最佳的解決方法是放棄全部計劃。"},{"english":"India’s economy became the world’s second fastest-growing economy, after China. Led by a thriving information-technology sector, the services sector boomed.","chinese":"印度成爲世界上增長第二快的經濟體，僅次於中國。"},{"english":"It is the second-smallest country in the world (after the Vatican City).","chinese":"它僅次於梵蒂岡，是世界上面積第二小國。"},{"english":"This river's flow into the sea is only second to that one.","chinese":"這條河流的入海量僅次於那條河流。"},{"english":"Fats or lipids are the second important nutrients next to carbohydrates.","chinese":"脂肪又叫脂質，它僅次於碳水化合物的第二大營養素。"},{"english":"We ourselves attract more foreign investment than any country but the U. S.","chinese":"我們所吸引的外資額僅次於美國。"},{"english":"Yale’s endowment is the second largest after Harvard, at twenty-two and a half billion dollars.","chinese":"耶魯的捐贈基金僅次於哈佛排第二，達225億美元。"},{"english":"India's economy became the world's second fastest-growing economy, after China.","chinese":"印度成爲世界上增長第二快的經濟體，僅次於中國。"},{"english":"China is the third-largest art market in the world, after the United States and Great Britain.","chinese":"中國是僅次於美國和英國的第三大藝術品市場。"}],"related":[]}