{"definition":["to bully"],"pinyin":["qi1 fu5"],"simplified":["欺负"],"rank":11131.0,"normalized_rank":0.15573713150420435,"fraction":0.000006927660237986716,"cumulative_fraction":0.9382641040401108,"word":"欺負","characters":[{"definition":["to take unfair advantage of\/to deceive\/to cheat"],"pinyin":["qi1"],"word":"欺"},{"definition":["to bear\/to carry (on one's back)\/to turn one's back on\/to be defeated\/negative (math. etc)"],"pinyin":["fu4"],"word":"負"}],"containing_words":[],"sentences":[{"english":"He suffered no man to do them wrong: yea, he reproved kings for their sakes.","chinese":"耶和華不容什麼人欺負他們，爲他們的緣故責備君王。"},{"english":"The fresh boy is always bullied by seniors at school.","chinese":"那個新來的男孩在學校裏總是被學長欺負。"},{"english":"That's how schoolyard bullies run playgrounds and global godfathers do it everywhere.","chinese":"這就是校園欺負運行操場和全球教父做到無處不在。"},{"english":"He often bullies you. I really take up the cudgel for you.","chinese":"他常欺負你，我真爲你打抱不平。"},{"english":"This is a vast nation like China would let the Sri Lankan bully?","chinese":"中國這泱泱大國還會讓這斯欺負？"},{"english":"\"Who dare bully my son?! \"Father leads Son by the hand out ot the house.","chinese":"“誰敢欺負我的乖兒子？”爸爸牽着兒子就往外走。"},{"english":"Sometimes I thought she just bullied me.","chinese":"有時我認爲她就是在欺負我。"},{"english":"At first, Chan seems to be a pathetic patsy to Tuckers aggression.","chinese":"起初，成龍像是個老受塔克欺負的倒黴蛋。"},{"english":"Iraq shares a table, before is always bullied by Iraq, has class leader to support luckily.","chinese":"伊拉克同桌，以前老被伊拉克欺負，幸好有班長撐腰。"},{"english":"She's a doormat in the company, even the green hand can wrong her.","chinese":"她在公司就是個受氣包，甚至新手也可以欺負她。"},{"english":"Animals who are dressed-up. An analogy meaning immoral and despicable people.","chinese":"你這個衣冠禽獸就知道欺負女人。"},{"english":"O. K. didn't humiliate this, otherwise, I will likewise dead to have no whole corpseses.","chinese":"還好沒有欺負到這小子頭上，不然，我也會死無全屍。"},{"english":"IT employ to bully me in high educate.","chinese":"高等初等中等學校時她常常欺負我。"},{"english":"The result is not good, the family circumstances are poor, receives the human to bully frequently.","chinese":"成績不好，家境貧寒，經常受人欺負。"},{"english":"But others lack confidence because of the high school bully factor.","chinese":"還有些人因爲高中有受到過欺負的經歷而信心不足。"},{"english":"What you know about bein bullied over half your life?","chinese":"你知道半輩子都被人欺負的滋味嗎？"}],"related":[{"definition":["to regard with disdain\/to shun"],"pinyin":["xian2 qi4"],"word":"嫌棄"},{"definition":["to despise\/to disdain\/to look down upon"],"pinyin":["bi3 shi4"],"word":"鄙視"},{"definition":["to scold\/to abuse\/to curse\/CL:通[tong4],頓|顿[dun4]"],"pinyin":["ma4"],"word":"罵"},{"definition":["to take liberties with a woman\/to dally\/to assail a woman with obscenities"],"pinyin":["tiao2 xi4"],"word":"調戲"},{"definition":["honest\/sincere\/well-behaved\/open and guileless\/naive"],"pinyin":["lao3 shi5"],"word":"老實"},{"definition":["to lose face\/humiliation"],"pinyin":["diu1 lian3"],"word":"丟臉"},{"definition":["rampant\/unbridled\/arrogant\/aggressive"],"pinyin":["xiao1 zhang1"],"word":"囂張"},{"definition":["to speak\/to say\/to talk\/to gossip\/to tell stories\/talk\/word"],"pinyin":["shuo1 hua4"],"word":"說話"},{"definition":["(coll.) presenting as unfriendly and blunt, but warm and tender inside (loanword from Japanese \"tsundere\")"],"pinyin":["ao4 jiao1"],"word":"傲嬌"},{"definition":["to play a joke\/to make fun of\/to joke"],"pinyin":["kai1 wan2 xiao4"],"word":"開玩笑"},{"definition":["to act like a spoiled child\/to throw a tantrum\/to act coquettishly"],"pinyin":["sa1 jiao1"],"word":"撒嬌"},{"definition":["to swear or curse (at people)\/to scold or yell at someone"],"pinyin":["ma4 ren2"],"word":"罵人"},{"definition":["to disturb\/to look for trouble\/to stir up a row\/to bother sb intentionally"],"pinyin":["dao3 luan4"],"word":"搗亂"},{"definition":["unworthy\/to let down\/I'm sorry\/excuse me\/pardon me\/if you please\/sorry? (please repeat)"],"pinyin":["dui4 bu5 qi3"],"word":"對不起"},{"definition":["It is said that ... (at the start of a narrative)\/to discuss\/to recount"],"pinyin":["hua4 shuo1"],"word":"話說"},{"definition":["in one's childhood"],"pinyin":["xiao3 shi2 hou5"],"word":"小時候"}]}