{"definition":["abbr. for 歐洲共同體|欧洲共同体, European Community (old term for the EU, European Union)"],"pinyin":["Ou1 gong4 ti3"],"simplified":["欧共体"],"rank":37285.0,"normalized_rank":0.5216655240440446,"fraction":4.935503564201928e-7,"cumulative_fraction":0.9953002551204421,"word":"歐共體","characters":[{"definition":["(used for transliteration)\/old variant of 謳|讴[ou1]","Europe\/abbr. for 歐洲|欧洲[Ou1 zhou1]\/surname Ou"],"pinyin":["Ou1","ou1"],"word":"歐"},{"definition":["common\/general\/to share\/together\/total\/altogether\/abbr. for 共產黨|共产党[Gong4 chan3 dang3], Communist party"],"pinyin":["gong4"],"word":"共"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[],"sentences":[{"english":"The EC only has nine people here and there is a limit to what we can do.","chinese":"歐共體只有九個人在這裏工作，我們所能做的很有限。"},{"english":"He has also managed to unite the British parliament and the European Union in support of his proposals.","chinese":"他也設法得了到英國國會和歐共體的支持。"},{"english":"The notification document can be obtained from the EC Enquiry Point.","chinese":"通報文件可從歐共體諮詢點獲取。"},{"english":"The European Economic and Monetary Union (EMU) originated from the acceptability of sovereignties in the European Community(EC).","chinese":"歐洲經貨聯盟源起於歐共體各主權國家的合意。"},{"english":"The EC is not paid by Pakistan, so I can be outspoken.","chinese":"由於巴基斯坦不向歐共體交錢，所以我可以直言不諱。"},{"english":"Finally, as part of this treaty, the EC reestablished itself as the European Union.","chinese":"最後，最爲該條約的一部分，歐共體重整爲歐盟。"},{"english":"The EC had no objections for the two cases to be merged.","chinese":"歐共體對兩案合併不持異議。"},{"english":"Improved the focusing accuracy when using the EC-20 Teleconverter.","chinese":"改進了對焦準確時，用歐共體20個鏡頭。"},{"english":"Europe all body includes main research to develop a field velar technology.","chinese":"歐共體把膜技術列入主要研究開發領域。"},{"english":"Europe in all body includes main research to develop a field velar technology.","chinese":"歐共體把膜技術列入主要研究開發領域。"},{"english":"A European-like trading club has developed in Asia.","chinese":"一個類似歐共體的貿易俱樂部正在亞洲形成。"},{"english":"The US referred to a similar case involving India and the EC and proposed both cases to be merged.","chinese":"美國提到印度與歐共體的類似案件，並建議兩案合併。"},{"english":"The cynical Eurocrat has seemingly been proved right.","chinese":"歐共體官員的冷嘲熱諷似乎已經得到了驗證。"},{"english":"The EC repeatedly blocked formation of a GATT panel.","chinese":"歐共體多次阻撓關貿總協定專家小組的組建。"}],"related":[]}