{"definition":["ohm (loanword)"],"pinyin":["ou1 mu3"],"simplified":["欧姆"],"rank":44128.0,"normalized_rank":0.617407972241266,"fraction":2.5984017581423925e-7,"cumulative_fraction":0.9978025733827444,"word":"歐姆","characters":[{"definition":["(used for transliteration)\/old variant of 謳|讴[ou1]","Europe\/abbr. for 歐洲|欧洲[Ou1 zhou1]\/surname Ou"],"pinyin":["Ou1","ou1"],"word":"歐"},{"definition":["woman who looks after small children\/(old) female tutor"],"pinyin":["mu3"],"word":"姆"}],"containing_words":[{"definition":["Omron Corporation (Japanese electronics company)"],"pinyin":["Ou1 mu3 long2"],"word":"歐姆龍"},{"definition":["omelette"],"pinyin":["ou1 mu3 dan4"],"word":"歐姆蛋"}],"sentences":[{"english":"Such a theoretical device would have a zero ohm output impedance in series with the source.","chinese":"這種理論的設備將有一個與源系列零歐姆的輸出阻抗。"},{"english":"Make sure that the measured values are not more than the maximum permitted value of 200 ohms.","chinese":"確保測量值不超過200歐姆這個最大的允許值。"},{"english":"Using an ohmmeter, check the resistance between terminal 50 and the switch body.","chinese":"使用歐姆計，檢查在電磁開關50和外殼之間的電阻。"},{"english":"Due to the ohmic resistance in the conductor some energy were lost in transmission.","chinese":"由於歐姆電阻在導體一些能源在傳輸中丟失。"},{"english":"Each of the bulbs has a resistance of 120 ohms.","chinese":"每一盞燈泡有120歐姆的電阻。"},{"english":"Most micro- ohmmeters and DMMs don't have provisions for setting the test current.","chinese":"大多數的微歐姆計和數字多用表都不能設置測試電流。"},{"english":"When resistance in the circuit exceeds 140 ohms , the reading is not completely dependable.","chinese":"網路電阻超過140歐姆時，讀數就完全不準了。"},{"english":"Attach test leads to pins 1 and 2 and note ohmmeter reading.","chinese":"把測試探針連接到插頭1和2，並記下歐姆表讀數。"},{"english":"The resistance must BE calculated from the current and the resulting voltage drop using ohm is law.","chinese":"根據電流和測出的壓降值用歐姆定律計算出接地電阻。"},{"english":"A conductivity definition for mixture is derived by solving the average for Ohm's law.","chinese":"對歐姆定律求平均，得到混合物電導率定義。"},{"english":"Nevertheless, OMRON assumes no responsibility for errors or omissions.","chinese":"儘管如此，歐姆龍不承擔任何責任的錯誤或遺漏。"},{"english":"The ohmmeter uses an internal current source and electrometer voltmeter to make the measurement.","chinese":"歐姆計使用內部的電流源和靜電計電壓表來進行測量。"},{"english":"This law is known as Ohm's law.","chinese":"這個定律通稱爲歐姆定律。"},{"english":"This paper introduces control system of sleeper maintenance based on OMRON PLC.","chinese":"介紹了以歐姆龍PLC爲核心的軌枕養護控制系統。"},{"english":"Using an ohmmeter, check the resistance between terminal C and the field coil brush lead.","chinese":"使用歐姆計，檢查勵磁線圈電刷之間的電阻。"},{"english":"It said Omron supplies electronic parts to Honda and Toyota.","chinese":"報導說，歐姆龍爲本田和豐田供應電子元件。"}],"related":[]}