{"definition":["to merrily spend (an occasion)\/to celebrate"],"pinyin":["huan1 du4"],"simplified":["欢度"],"rank":21645.0,"normalized_rank":0.3028416325045821,"fraction":0.0000020260234832167565,"cumulative_fraction":0.9784587217158754,"word":"歡度","characters":[{"definition":["joyous\/happy\/pleased"],"pinyin":["huan1"],"word":"歡"},{"definition":["to estimate\/Taiwan pr. [duo4]","to pass\/to spend (time)\/measure\/limit\/extent\/degree of intensity\/degree (angles, temperature etc)\/kilowatt-hour\/classifier for events and occurrences"],"pinyin":["du4","duo2"],"word":"度"}],"containing_words":[],"sentences":[{"english":"In an atmosphere of joy, new and old friends celebrated the Chinese traditional festival together.","chinese":"在歡樂的氣氛中，新朋老友一起歡度中國的傳統佳節。"},{"english":"He likes to drink, have a good time, and tell everyone how wonderful he is.","chinese":"他開懷暢飲，歡度每一刻，告訴每個人他有多棒。"},{"english":"It depicts the people to celebrate the Spring Festival grand festival scene.","chinese":"描繪了我國人民歡度春節盛大的喜慶情景。"},{"english":"The city has been painted up for the Spring Festival.","chinese":"爲歡度春節市容已修飾一新。"},{"english":"No word on how the first famliy plans to spent New Year’s Eve tonight.","chinese":"沒人知道第一家庭今晚計劃如何歡度新年前夜。"},{"english":"Yang-ge dancing is a necessity of celebrating holidays.","chinese":"扭秧歌是歡度節日的必備節目。"},{"english":"We celebrated the joyous Mid-Autumn Festival.","chinese":"我們歡度中秋佳節。"},{"english":"Each year, Canada's neational capital. Ottawa, celebrates the spirit of winter with Winterlude.","chinese":"每年，加拿大首都渥太華都舉辦冰雪節來歡度冬天。"},{"english":"They celebrated the festival by holding a party.","chinese":"他們是以舉行宴會的方式歡度該節日的。"},{"english":"To walk, and pass our long Loves Day.","chinese":"去散步，把悠長的戀愛日歡度。"},{"english":"The Nerazzurri ambassador spent nearly an hour with his 'admirers'.","chinese":"藍黑大使與球迷們歡度了大約一個小時。"},{"english":"In the past one month, i was staying with my parents and enjoying the spring festival in my hometown.","chinese":"在剛剛過去的這個月中，我同爸爸媽媽一起歡度春節。"},{"english":"Muslims here and around the world began celebrating Eid al-Adha, or the Feast of the Sacrifice.","chinese":"本地和全世界的穆斯林歡度古爾邦節，即宰牲節。"},{"english":"But belief in the supernatural is not required to enjoy Halloween.","chinese":"但歡度萬聖節可不一定要信鬼。"},{"english":"Burning fireworks is one of the most typical customs that people do during Spring Festival.","chinese":"燃燒的煙花也是最典型的歡度春節活動之一。"},{"english":"Exchanging gifts and sending Christmas cards are the modern ways of celebrating the Christmas in the orld.","chinese":"交換禮物和寄聖誕卡是歡度聖誕常見的方式。"}],"related":[]}