{"definition":["regular (figure in geometry)"],"pinyin":["zheng4 ze2"],"simplified":["正则"],"rank":49032.0,"normalized_rank":0.6860212947546626,"fraction":1.5999147904067766e-7,"cumulative_fraction":0.9988129213246152,"word":"正則","characters":[{"definition":["first month of the lunar year","straight\/upright\/proper\/main\/principal\/to correct\/to rectify\/exactly\/just (at that time)\/right (in that place)\/(math.) positive"],"pinyin":["zheng1","zheng4"],"word":"正"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"則"}],"containing_words":[{"definition":["regular parametrization"],"pinyin":["zheng4 ze2 can1 shu4"],"word":"正則參數"},{"definition":["regular expression (computing)"],"pinyin":["zheng4 ze2 biao3 da2 shi4"],"word":"正則表達式"}],"sentences":[{"english":"You can describe all of these formats with regular expressions.","chinese":"所有這些格式都可以用正則表達式來描述。"},{"english":"The global fast dynamics for the generalized symmetric regularized long wave equation is considered.","chinese":"考慮了對稱正則長波方程的整體快變動力學。"},{"english":"This pattern object represents the regular expression that is defined in text format.","chinese":"該模式對象代表以文本格式定義的正則表達式。"},{"english":"Differentiating between greediness and laziness is key to fully understanding advanced regular expressions.","chinese":"理解貪婪與懶惰的區別是運用高級正則表達式的基礎。"},{"english":"The case of regular solutions of nonlinear PDAEs is investigated.","chinese":"並研究了非線性偏微分方程組的解在正則部分的情形。"},{"english":"A associative ring R is called a regular ring if every left principle ideal of it is generated by an idempotent.","chinese":"每一個主左理想均由一個冪等元生成的環叫正則環。"},{"english":"Whitespace in the regular expression that isn't inside a character class is ignored.","chinese":"在正則表達式中不在字符類中的空白符被忽略。"},{"english":"Finally, this paper gives applications of the above results to quasiregular mappings.","chinese":"最後，給出上述結論在擬正則映射中的應用。"},{"english":"To achieve this in the above example, you use a regular expression to perform the replacement.","chinese":"爲此，上例中使用正則表達式進行替換。"},{"english":"In Chapter 2, we discussed the applications of homotopy regular morphism.","chinese":"第二章討論同倫正則態射的應用。"},{"english":"There exists an irregular semigroups in which joins of good congruences are good.","chinese":"存在所有好餘的並都是好餘的非正則半羣。"},{"english":"The canonical transformation method is proposed for symplectic conservative perturbation approximation.","chinese":"然後給出正則變換的攝動保辛方法。"},{"english":"Super-resolved image restoration technique from a single image was studied by edge-preserving regularization.","chinese":"本文研究單幀圖像超分辨重構的正則化方法。"},{"english":"The ill-posedness inherent in the bandlimited signal extrapolation problem can be treated by means of regularization parameters.","chinese":"引進正則參數能夠處理數據外推問題的內在不穩定性。"},{"english":"Quasi-regular quadrature formulas have also been discussed.","chinese":"本文還討論了擬正則求積公式。"},{"english":"To deal with this dilemma, you can use advanced regular expressions .","chinese":"爲了解決這個困境，你可以使用一些高級的正則。"}],"related":[{"definition":["lit. carpenter's straight line marker\/same as 墨斗\/fig. rules\/rules and regulations"],"pinyin":["sheng2 mo4"],"word":"繩墨"},{"definition":["to observe the ritual mourning"],"pinyin":["ju1 sang4"],"word":"居喪"},{"definition":["experienced\/sophisticated\/worldly-wise"],"pinyin":["lian4 da2"],"word":"練達"},{"definition":["ability and insight"],"pinyin":["cai2 shi2"],"word":"才識"},{"definition":["chastity\/virginity (of women)\/moral integrity (of men)\/loyalty\/constancy"],"pinyin":["zhen1 jie2"],"word":"貞節"},{"definition":["righteous indignation\/moral indignation"],"pinyin":["yi4 fen4"],"word":"義憤"},{"definition":["name and reality\/how sth is portrayed and what it is actually like"],"pinyin":["ming2 shi2"],"word":"名實"},{"definition":["my limited view (lit. view through a thin tube)\/my limited understanding\/my opinion (humble)"],"pinyin":["guan3 jian4"],"word":"管見"},{"definition":["to plan and consider\/to reflect on one's best strategy"],"pinyin":["mou2 lu:4"],"word":"謀慮"},{"definition":["lit. outside-flexible, inside-firm (idiom)\/fig. velvet glove"],"pinyin":["wai4 yuan2 nei4 fang1"],"word":"外圓內方"},{"definition":["of noble character and unquestionable integrity (idiom)"],"pinyin":["gao1 feng1 liang4 jie2"],"word":"高風亮節"},{"definition":["famous person"],"pinyin":["wen2 ren2"],"word":"聞人"},{"definition":["swordsmanship"],"pinyin":["jian4 shu4"],"word":"劍術"},{"definition":["properly\/satisfactorily\/firmly\/very fitting\/appropriate\/proper\/to be in good order\/also written 妥帖"],"pinyin":["tuo3 tie1"],"word":"妥貼"},{"definition":["wind vane\/anemometer\/weathercock\/fig. person who switches allegiance readily\/turncoat"],"pinyin":["feng1 biao1"],"word":"風標"},{"definition":["to treat one another with absolute sincerity (idiom); to show total devotion"],"pinyin":["gan1 dan3 xiang1 zhao4"],"word":"肝膽相照"}]}