{"definition":["regular expression (computing)"],"pinyin":["zheng4 ze2 biao3 da2 shi4"],"simplified":["正则表达式"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"正則表達式","characters":[{"definition":["first month of the lunar year","straight\/upright\/proper\/main\/principal\/to correct\/to rectify\/exactly\/just (at that time)\/right (in that place)\/(math.) positive"],"pinyin":["zheng1","zheng4"],"word":"正"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"則"},{"definition":["exterior surface\/family relationship via females\/to show (one's opinion)\/a model\/a table (listing information)\/a form\/a meter (measuring sth)"],"pinyin":["biao3"],"word":"表"},{"definition":["surname Da","to attain\/to reach\/to amount to\/to communicate\/eminent"],"pinyin":["Da2","da2"],"word":"達"},{"definition":["type\/form\/pattern\/style"],"pinyin":["shi4"],"word":"式"}],"containing_words":[],"sentences":[{"english":"You can describe all of these formats with regular expressions.","chinese":"所有這些格式都可以用正則表達式來描述。"},{"english":"This pattern object represents the regular expression that is defined in text format.","chinese":"該模式對象代表以文本格式定義的正則表達式。"},{"english":"Differentiating between greediness and laziness is key to fully understanding advanced regular expressions.","chinese":"理解貪婪與懶惰的區別是運用高級正則表達式的基礎。"},{"english":"Whitespace in the regular expression that isn't inside a character class is ignored.","chinese":"在正則表達式中不在字符類中的空白符被忽略。"},{"english":"To achieve this in the above example, you use a regular expression to perform the replacement.","chinese":"爲此，上例中使用正則表達式進行替換。"},{"english":"Both lines use regular expressions.","chinese":"兩行都使用了正則表達式。"},{"english":"Can DFA regex engines handle atomic groups?","chinese":"DFA的正則表達式引擎可以處理原子團？"},{"english":"Each regex is represented by a match element.","chinese":"每個正則表達式都由一個匹配元素表示。"},{"english":"You can also use regular expression-like groups to match files.","chinese":"您還可以使用類似於正則表達式的組來匹配文件。"},{"english":"Wht is wrong with my regex?","chinese":"什麼是我的正則表達式是錯誤的？"},{"english":"An Extended Stored Procedure to use regular expressions in T-SQL.","chinese":"一個使用正則表達式的存儲過程。"},{"english":"This saves you the trouble of having to re-type the regular expression every time.","chinese":"這樣您就不必每次都要重新鍵入正則表達式。"},{"english":"This allows hexadecimal values in regular expressions when parsing.","chinese":"這允許在解析時在正則表達式中使用十六進制值。"},{"english":"Parentheses in a regular expression are used to create a subexpression.","chinese":"正則表達式中的括號用於創建子表達式。"},{"english":"When used with care, regexes are very fast.","chinese":"小心使用它，正則表達式是非常快的。"},{"english":"Re-enter the search string using the correct regular expression syntax.","chinese":"使用正確的正則表達式語法重新輸入搜索字符串。"}],"related":[]}