{"definition":["directly facing"],"pinyin":["zheng4 dui4"],"simplified":["正对"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"正對","characters":[{"definition":["first month of the lunar year","straight\/upright\/proper\/main\/principal\/to correct\/to rectify\/exactly\/just (at that time)\/right (in that place)\/(math.) positive"],"pinyin":["zheng1","zheng4"],"word":"正"},{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"}],"containing_words":[],"sentences":[{"english":"It will be a possession game virtually every game, probably to a fan's delight.","chinese":"幾乎每場都會是寸土必爭的比賽，也許正對球迷口味。"},{"english":"The center line of condenser shall be opposite to the exhaust end of syn gas compressor turbine.","chinese":"凝汽器中心線正對合成氣壓縮機透平排汽端。"},{"english":"The desensitisation of young men to gratuitously violent sexual acts is happening.","chinese":"年輕人正對無緣由的性暴力行爲脫敏。"},{"english":"Shy film stars dodge cameras.","chinese":"膽怯的影星不敢正對攝影機。"},{"english":"Mullah Baradar's capture comes amid a major Nato-led offensive against the Taliban in southern Afghanistan.","chinese":"在阿富汗南部地區，北約正對塔利班發動規模攻擊。"},{"english":"The blogs are ranked by the number of clicks they receive.","chinese":"我們正對這些博客的點擊率進行大排行。"},{"english":"This seat is close to the air-conditioning register. Would you like a wrap?","chinese":"這個位置正對空調出風口，您需要披肩嗎？"},{"english":"Right to the opposite of Hongqiao Golf, the hotel lies perfectly in tranquility and elegance.","chinese":"酒店正對虹橋高爾夫球場，四周環境安靜優美。"},{"english":"Some companies are training staffers to broaden their social-media efforts.","chinese":"有些公司正對員工進行培訓，以擴大社交媒體宣傳。"},{"english":"They are doing some research on the interaction between seawater and lava.","chinese":"他們正對海水與溶岩的相互作用進行研究。"},{"english":"A larger door, painted bright red, can be opened for transporting sculptures outside.","chinese":"巨大的門塗上紅色，正對室外的雕塑。"},{"english":"The side of the moon facing the Earth and the side facing away have strikingly different topographies.","chinese":"正對和背對地球的月亮兩側地勢差別明顯。"},{"english":"The Complaints Commission is working through hundreds of allegations of serious fraud.","chinese":"投訴委員會正對數百宗嚴重欺詐的指控進行調查。"},{"english":"When he turned and confronted it, the thing had vanished.","chinese":"他回過頭來正對它看時，那東西卻倏忽不見了。"},{"english":"This detective novel meets my appetite.","chinese":"這本偵探小說正對我的胃口。"},{"english":"The adjective injected new acceptation into the objected cold article.","chinese":"這個形容詞給受到正對的客觀物體注入了新的意義。"}],"related":[{"definition":["(sitting) opposite\/across (the street)\/directly in front\/to be face to face"],"pinyin":["dui4 mian4"],"word":"對面"},{"definition":["entrance\/door\/gate\/large and influential family","the Doors, US rock band"],"pinyin":["Da4 men2","da4 men2"],"word":"大門"},{"definition":["lateral\/side\/to the side\/beside"],"pinyin":["pang2 bian1"],"word":"旁邊"},{"definition":["window\/CL:個|个[ge4],扇[shan4]"],"pinyin":["chuang1 hu5"],"word":"窗戶"},{"definition":["to detour\/to bypass\/to circumvent\/to avoid\/to wind around (of a road etc)"],"pinyin":["rao4 guo4"],"word":"繞過"},{"definition":["bend in a street\/corner\/to turn a corner"],"pinyin":["zhuan3 jiao3"],"word":"轉角"},{"definition":["right side\/right, to the right"],"pinyin":["you4 bian5"],"word":"右邊"},{"definition":["running in opposite direction (buses, trains, ferries etc)"],"pinyin":["dui4 kai1"],"word":"對開"},{"definition":["the back door\/fig. under the counter (indirect way for influence or pressure)\/anus"],"pinyin":["hou4 men2"],"word":"後門"},{"definition":["center\/central point\/focus"],"pinyin":["zhong1 xin1 dian3"],"word":"中心點"},{"definition":["lean on one side","the side\/to incline towards\/to lean\/inclined\/lateral\/side"],"pinyin":["ce4","zhai1"],"word":"側"},{"definition":["in front of the door"],"pinyin":["men2 qian2"],"word":"門前"},{"definition":["hall\/lounge"],"pinyin":["da4 ting1"],"word":"大廳"},{"definition":["main entrance\/main gate\/portal"],"pinyin":["zheng4 men2"],"word":"正門"},{"definition":["doorway\/gate\/CL:個|个[ge4]"],"pinyin":["men2 kou3"],"word":"門口"},{"definition":["west\/west side\/western part\/to the west of"],"pinyin":["xi1 bian1"],"word":"西邊"}]}