{"definition":["positive integer"],"pinyin":["zheng4 zheng3 shu4"],"simplified":["正整数"],"rank":63893.0,"normalized_rank":0.893945965609391,"fraction":2.058284538753244e-8,"cumulative_fraction":0.9999333829640108,"word":"正整數","characters":[{"definition":["first month of the lunar year","straight\/upright\/proper\/main\/principal\/to correct\/to rectify\/exactly\/just (at that time)\/right (in that place)\/(math.) positive"],"pinyin":["zheng1","zheng4"],"word":"正"},{"definition":["exactly\/in good order\/whole\/complete\/entire\/in order\/orderly\/to repair\/to mend\/to renovate\/(coll.) to fix sb\/to give sb a hard time\/to mess with sb"],"pinyin":["zheng3"],"word":"整"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[],"sentences":[{"english":"a to the b where b is an integer.","chinese":"也就是a的b次方，而b是個正整數。"},{"english":"An example of semigroup with no minimal ideal is the set of positive integers under addition.","chinese":"沒有極小理想的半羣的例子是在加法下的正整數集合。"},{"english":"A composite is a positive integer with more than two divisors.","chinese":"複合數就是具有一個以上約數的正整數。"},{"english":"Scale maximum must be a positive integer value.","chinese":"比例最大值必須是一個正整數。"},{"english":"Every positive integer greater than 1 can be expressed as the product of prime numbers.","chinese":"每個大於1的正整數都能表示爲素數的乘積。"},{"english":"The second line of each test case will contain a permutation of the N smallest positive integers.","chinese":"每個測試案例第二行包含了N最小的正整數置換。"},{"english":"How many four-digit positive integers have their product of digits even?","chinese":"數字之積爲偶數的四位正整數共有多少個？"},{"english":"I demand that you give me a positive integer.","chinese":"我要求你給我一個正整數。"},{"english":"Please enter a positive integer.","chinese":"請輸入一正整數。"},{"english":"The sum of two positive integers is 29, find the minimum value of the sum of their squares.","chinese":"兩個正整數之和爲29，求此兩數平方和的最小值。"},{"english":"Each transmitter will be assigned one positive integer channel.","chinese":"每一個傳送站將被配置一正整數信道。"},{"english":"In arithmetic the positive integer and the positive fraction were sufficient for all requirements.","chinese":"在算數中，曾經正整數和正分數能夠滿足所有的需求。"}],"related":[]}