{"definition":["the correct path\/the right way (Buddhism)"],"pinyin":["zheng4 dao4"],"simplified":["正道"],"rank":26814.0,"normalized_rank":0.3751626488324262,"fraction":0.0000012574512777886836,"cumulative_fraction":0.986767286364714,"word":"正道","characters":[{"definition":["first month of the lunar year","straight\/upright\/proper\/main\/principal\/to correct\/to rectify\/exactly\/just (at that time)\/right (in that place)\/(math.) positive"],"pinyin":["zheng1","zheng4"],"word":"正"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"}],"containing_words":[{"definition":["the Eight-fold Noble Way (Buddhism)"],"pinyin":["ba1 zheng4 dao5"],"word":"八正道"}],"sentences":[{"english":"The appropriate direction lost many elites in those early annuals, it was under the archaic divine tree to fair cage him.","chinese":"當年正道損失無數精英，纔將他困在上古神木之下。"},{"english":"He led them by a straight way to a city where they could dwell.","chinese":"引領他們走入正道，走入可安居的城廓。"},{"english":"Small jia she borrow wood, injured advice he should return to the path from the rivers lake.","chinese":"小嘉便借木榮受傷之事，勸告他應重返正道退出江湖。"},{"english":"Please ordain me a Bhikkhu so that I can develop the Noble Eightfold Path.","chinese":"請給我授戒讓我成爲比丘，這樣我就能夠修行八正道。"},{"english":"He forgave his good-for-nothing brother for the purpose of maintaining brotherhood.","chinese":"他寬恕了他那不走正道的兄弟，藉以維持手足知情。"},{"english":"After going straight for a bit, he returned to petty thieving again.","chinese":"走了一段正道後，他又重操舊業當起小偷來。"},{"english":"The United States and its allies are right to balance values and strategic interests.","chinese":"美國及其盟國積極去平衡價值觀和戰略利益纔是正道。"},{"english":"Bezos was so wrong he was right.","chinese":"貝索斯正因爲錯得如此離譜，他才找到了正道。"},{"english":"Listen, my son, and be wise, and keep your heart on the right path.","chinese":"我兒，你當聽，當存智慧，好在正道上引導你的心。"},{"english":"He led them back to the right way.","chinese":"他把他們帶回到正道上來。"},{"english":"Jotham grew powerful because he walked steadfastly before the Lord his God.","chinese":"約坦在耶和華他神面前行正道，以致日漸強盛。"},{"english":"You wanna do better for yourself. You gotta go the right path.","chinese":"你想自己變得更好，你必須走正道。"},{"english":"Are the Noble Eightfold Path developed in me?","chinese":"是否巳經開發了八正道？"},{"english":"One who follows Jesus who can lead people to the right way.","chinese":"跟隨基督的人，能領人走正道。"},{"english":"Rhys Davids is of the opinion that the Eightfold Path is a later systematisation.","chinese":"戴維斯夫人是認爲八正道是後來才系統化的。"},{"english":"It’s not clear why a human instinct to nurse went awry.","chinese":"人類餵養母乳的天性爲何會偏離正道，這點並不清楚。"}],"related":[{"definition":["depraved life\/evil ways\/fornication"],"pinyin":["xie2 dao4"],"word":"邪道"},{"definition":["lit. devil's gate, crooked path (idiom); corrupt practices\/crooked methods\/dishonesty"],"pinyin":["xie2 men2 wai1 dao4"],"word":"邪門歪道"},{"definition":["go-between\/mediator\/intermediary"],"pinyin":["zhong1 ren2"],"word":"中人"},{"definition":["dissenting religious sect (idiom); heretical school of opinion\/dissident group"],"pinyin":["pang2 men2 zuo3 dao4"],"word":"旁門左道"},{"definition":["side door"],"pinyin":["pang2 men2"],"word":"旁門"},{"definition":["Confucian orthodoxy"],"pinyin":["dao4 tong3"],"word":"道統"},{"definition":["Buddhism"],"pinyin":["Fo2 men2"],"word":"佛門"},{"definition":["the Way of the King\/statecraft\/benevolent rule\/virtuous as opposed to the Way of Hegemon 霸道"],"pinyin":["wang2 dao4"],"word":"王道"},{"definition":["lit. true religion\/orthodox religion\/orthodox Christianity\/Islam (in the writing of Chinese or Hui theologians)"],"pinyin":["zheng4 jiao4"],"word":"正教"},{"definition":["upright"],"pinyin":["zheng4 pai4"],"word":"正派"},{"definition":["to practice Daoism"],"pinyin":["xiu1 dao4"],"word":"修道"},{"definition":["disciple\/follower\/hanger-on (at an aristocrat's home)"],"pinyin":["men2 ren2"],"word":"門人"},{"definition":["(literary) we\/us"],"pinyin":["wo3 bei4"],"word":"我輩"},{"definition":["Daoist School of the Warring States Period (475-221 BC), based on the teachings of Laozi or Lao-tze 老子[Lao3 zi3] (c. 500 BC-) and Zhuangzi 庄子 (369-286 BC)"],"pinyin":["Dao4 jia1"],"word":"道家"},{"definition":["very able person"],"pinyin":["gao1 ren2"],"word":"高人"},{"definition":["martial arts (social) circles"],"pinyin":["wu3 lin2"],"word":"武林"}]}