{"definition":["here\/this place"],"pinyin":["ci3 jian1"],"simplified":["此间"],"rank":5861.0,"normalized_rank":0.08200299413764639,"fraction":0.000019139272635494788,"cumulative_fraction":0.8773735823266544,"word":"此間","characters":[{"definition":["this\/these"],"pinyin":["ci3"],"word":"此"},{"definition":["between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms","gap\/to separate\/to thin out (seedlings)\/to sow discontent"],"pinyin":["jian1","jian4"],"word":"間"}],"containing_words":[],"sentences":[{"english":"People survive because they are really good cooperators.","chinese":"人們進化是因爲他們彼此間是最好的合作伙伴。"},{"english":"Want to check to bughouse regularly here.","chinese":"此間要定期到精神病院複查。"},{"english":"The life can be let I am here is weary unbearable.","chinese":"生活只能讓我在此間疲倦不堪。"},{"english":"Ss become less dependent on the teacher, and get used to helping and learning from each other.","chinese":"讓學生減少對老師的依賴，習慣於彼此間互學互助。"},{"english":"“Like friends, we discuss those differences honestly and forthrightly,” Clinton said at the opening session yesterday of the first day of meetings between U.","chinese":"我們像朋友一樣坦誠直率地探討彼此間存在的差異。"},{"english":"Such names serve more than fodder for pitting males and females against one another.","chinese":"起這些名字並非僅是男女性彼此間無意義的一比。"},{"english":"Cannot stand up to the years rolling like a stream, and cannot escape the youth.","chinese":"經不住似水流年，逃不過此間少年。"},{"english":"Mike and Molly have patched up their differences.","chinese":"邁克和莫莉已經平息了彼此間的分歧。"},{"english":"In the process, China has become the world s third largest trader.","chinese":"此間中國攀升爲世界第三大貿易國。"},{"english":"Not once had we written to each other.","chinese":"我們彼此間沒有寫過一封信。"},{"english":"The silver lining is that many accommodations have remained reasonably priced.","chinese":"一點慰藉是，此間許多房間住宿還保持着合理價格。"},{"english":"In the course of the RCIA journey, recreational activities are also organized for the building of friendship between participants.","chinese":"慕道過程中也舉辦一些康樂活動，促進彼此間的友誼。"},{"english":"The Fifth Cross-Straits Economic, Trade and Culture Forum unveiled its curtain in Changsha on July 11.","chinese":"第五屆兩岸經貿文化論壇十一日在此間開幕。"},{"english":"Humanity knows only extremes in karma both with earth and amongst one another.","chinese":"人類只瞭解彼此間和與地球間業力中的極端。"},{"english":"Unity is expressed here in terms of sun and sea.","chinese":"此間的統一便在陽光和海洋裏。"},{"english":"Rumour is already rife here as to Dr. Trefoil's successor.","chinese":"關於特雷福伊爾博士的繼任人，此間已經謠言蜂起。"}],"related":[]}