{"definition":["always\/throughout (a period of time)\/(of) all-time"],"pinyin":["li4 lai2"],"simplified":["历来"],"rank":8452.0,"normalized_rank":0.11825444573475298,"fraction":0.000010934016207212444,"cumulative_fraction":0.9149623922153536,"word":"歷來","characters":[{"definition":["to experience\/to undergo\/to pass through\/all\/each\/every\/history"],"pinyin":["li4"],"word":"歷"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"}],"containing_words":[{"definition":["all time low (point)"],"pinyin":["li4 lai2 zui4 di1 dian3"],"word":"歷來最低點"}],"sentences":[{"english":"For this reason, the researches on opening up wasteland were always hot.","chinese":"爲此，有關屯墾的研究歷來較爲活躍。"},{"english":"Mount Tai has long been the preferred gathering place for artists and poets.","chinese":"泰山歷來是畫家騷客所鍾情的聚集地。"},{"english":"Taihu Basin was always one of the most developed districts in China.","chinese":"太湖流域歷來是我國經濟比較發達地區之一。"},{"english":"The first woman in Malaysia to head a university, Tan Sri Ng was the founding President of Universiti Tunku Abdul Rahman (UTAR).","chinese":"黃博士是馬來西亞大學歷來第一位女性校長。"},{"english":"They compiled thousands of case history to prove the relationship between smoking and cancer.","chinese":"他們收集了數以千計的病歷來證明吸菸與癌症的關係。"},{"english":"The excavation of inclined shaft was always difficult in the construction of Pumped-Storage Power Station.","chinese":"在抽水蓄能電站中斜井開挖施工歷來是一個難點。"},{"english":"From the novel to the film is aways the hot topic.","chinese":"從小說到電影的藝術轉換，歷來是討論的熱題。"},{"english":"IAB investigators target those offenses that have been traditionally corruption-prone.","chinese":"內勤局調查員會鎖定歷來容易導致腐敗的違法行爲。"},{"english":"Wealth creates what has historically been the social backbone of democracy: a middle class.","chinese":"財富創造了歷來就是民主的社會支柱的中產階級。"},{"english":"On the whole, the spatial relationship is the key of the western art history.","chinese":"縱觀西方美術史，空間關係歷來是畫面關係的重點。"},{"english":"Rajasthan has traditionally been the area of the country with the most camels.","chinese":"拉賈斯坦邦歷來是印度駱駝數量最多的地區。"},{"english":"As a means of figurative speech, repetition of words is often employed by poets.","chinese":"疊字作爲一種修辭手段，歷來爲詩人廣用。"},{"english":"Liang Ke Shuo\" of Dengxi used to be regarded as a sophism.\"","chinese":"鄧析的“兩可說”歷來被視爲是詭辯。"},{"english":"Images are agood way to catch a visitors attention.","chinese":"圖像歷來是吸引眼球的不二法門。"},{"english":"Railway passenger station always put the passenger flow line as the focus of design ideas.","chinese":"鐵路客運站歷來把旅客流線作爲其設計構思的重點。"},{"english":"The researchers of Mohism uphold their own core theory since the subject of Mohism came into being.","chinese":"歷來的墨學研究者各自提出了自己的核心論。"}],"related":[]}