{"definition":["historical background"],"pinyin":["li4 shi3 bei4 jing3"],"simplified":["历史背景"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"歷史背景","characters":[{"definition":["to experience\/to undergo\/to pass through\/all\/each\/every\/history"],"pinyin":["li4"],"word":"歷"},{"definition":["history\/annals\/title of an official historian in ancient China","surname Shi"],"pinyin":["Shi3","shi3"],"word":"史"},{"definition":["the back of a body or object\/to turn one's back\/to hide something from\/to learn by heart\/to recite from memory\/unlucky (slang)\/hard of hearing","to be burdened\/to carry on the back or shoulder"],"pinyin":["bei1","bei4"],"word":"背"},{"definition":["bright\/circumstance\/scenery","surname Jing"],"pinyin":["Jing3","jing3"],"word":"景"}],"containing_words":[],"sentences":[{"english":"The drifting people of Baekje are precisely produces under this historical perspective.","chinese":"百濟遺民正是在此歷史背景下出現的。"},{"english":"By way of an introduction, I'd just like to give some historical background for this issue.","chinese":"作爲開場白，我來解釋一下這件事的歷史背景。"},{"english":"The second chapter elaborates the Baekje drifting people related to the historical background.","chinese":"第二章論述百濟遺民相關的歷史背景。"},{"english":"In this paper, the first chapter primarily analyzes the historical background of the hippy movement.","chinese":"論文第一章主要分析嬉皮士運動發生的歷史背景。"},{"english":"The special historical context makes the pottery figures collected by Lvshun Museum have un- usual characteristics.","chinese":"特殊的歷史背景使得旅順博物館所藏人俑極具特色。"},{"english":"Harout, the host showed the map while analyzing the historical background of Israel and Palestina.","chinese":"主持人哈魯特用地圖講解了以巴衝突的歷史背景。"},{"english":"The first part of the historical background of the Mukden Incident.","chinese":"第一部分爲九一八事變的歷史背景。"},{"english":"Let me give you a brief historical perspective on today’s health challenges.","chinese":"讓我向你們簡要地介紹一下當今衛生挑戰的歷史背景。"},{"english":"These issues have both complicated historical background and many practical reasons.","chinese":"這些問題既有複雜的歷史背景，也有諸多的現實原因。"},{"english":"First, examining the reasons of the history background of Wu's art coming into being.","chinese":"吳冠中藝術觀產生的歷史背景因素。"},{"english":"Chapter I, the historical background of Seneca\"s three essays.\"","chinese":"第一章，塞涅卡三論的歷史背景。"},{"english":"They advanced the theory of the mean in similar historical background.","chinese":"在相似的歷史背景下，他們提出了“中庸”思想。"},{"english":"Colander emphasizes the intellectual and historical context to which the economic models are applied.","chinese":"科蘭德強調知識和歷史背景的經濟模式的應用。"},{"english":"Giving the name \"honoring brothers\" to Taiwan's seventh month Pudu rite has its own special historical background.","chinese":"臺灣七月普渡稱爲拜好兄弟實有其特殊的歷史背景。"},{"english":"The first chapter reveals the historical background of Hanseatic merchants entering into Britain.","chinese":"第一章論述漢薩商人進入英國的歷史背景。"},{"english":"The historical background of Chinese literary theory is the introduction of Western modernity into China in the last few decades of the 20th century.","chinese":"20世紀晚期中國文論的歷史背景是現代性西學東漸。"}],"related":[{"definition":["context"],"pinyin":["yu3 jing4"],"word":"語境"},{"definition":["historical period"],"pinyin":["li4 shi3 shi2 qi1"],"word":"歷史時期"},{"definition":["historic significance"],"pinyin":["li4 shi3 yi4 yi4"],"word":"歷史意義"},{"definition":["historical incident"],"pinyin":["li4 shi3 shi4 jian4"],"word":"歷史事件"},{"definition":["pedigree"],"pinyin":["pu3 xi4"],"word":"譜系"},{"definition":["linked in countless ways"],"pinyin":["qian1 si1 wan4 lu:3"],"word":"千絲萬縷"},{"definition":["changes\/vicissitudes"],"pinyin":["bian4 qian1"],"word":"變遷"},{"definition":["ideology"],"pinyin":["yi4 shi2 xing2 tai4"],"word":"意識形態"},{"definition":["variegation\/diversity"],"pinyin":["duo1 yang4 xing4"],"word":"多樣性"},{"definition":["prosperity and decline (of a kingdom)\/rise and fall"],"pinyin":["xing1 shuai1"],"word":"興衰"},{"definition":["traceable to the same stock (idiom); of a common origin (of trends, ideas etc)"],"pinyin":["yi1 mai4 xiang1 cheng2"],"word":"一脈相承"},{"definition":["arteries and veins\/network of blood vessels\/vascular system (of a plant or animal)\/(fig.) fabric (i.e. underlying structure, as in \"social fabric\")\/overall context"],"pinyin":["mai4 luo4"],"word":"脈絡"},{"definition":["to reconstruct\/reconstruction\/(computing) refactoring"],"pinyin":["chong2 gou4"],"word":"重構"},{"definition":["an original idea"],"pinyin":["chuang4 jian4"],"word":"創見"},{"definition":["cultural tradition"],"pinyin":["wen2 hua4 chuan2 tong3"],"word":"文化傳統"},{"definition":["historical fact"],"pinyin":["shi3 shi2"],"word":"史實"}]}