{"definition":["to have experienced a lot of\/to have been through"],"pinyin":["li4 jin4"],"simplified":["历尽"],"rank":24153.0,"normalized_rank":0.337931806416409,"fraction":0.0000016021044548097056,"cumulative_fraction":0.9829853527495844,"word":"歷盡","characters":[{"definition":["to experience\/to undergo\/to pass through\/all\/each\/every\/history"],"pinyin":["li4"],"word":"歷"},{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely"],"pinyin":["jin4"],"word":"盡"}],"containing_words":[{"definition":["to have been through the hardships of life\/to have been through the mill"],"pinyin":["li4 jin4 cang1 sang1"],"word":"歷盡滄桑"}],"sentences":[{"english":"I'm not speaking as someone who has been through the mill and picked and chosen my games.","chinese":"我不會像一個歷盡磨難的人說，去選擇我的比賽。"},{"english":"Love that matures through hardships is the most passionate love.","chinese":"歷盡艱辛而成熟的愛情是最熱烈的愛情。"},{"english":"The revolutionary army had a hard time of it when they captured the city.","chinese":"革命軍佔領該城市時歷盡了艱辛。"},{"english":"We experienced great difficulty in taming tigers.","chinese":"我們在馴服老虎的過程中歷盡艱辛。"},{"english":"But one of his successors in the White House had about as checkered a youth as can be imagined.","chinese":"但是，在白宮他的一位接班人青年時代卻歷盡艱辛。"},{"english":"Look at these dreams so beaten and so battered.","chinese":"看看這些歷盡滄桑的夢想。"},{"english":"She has buffeted about from pillar to post for ten years.","chinese":"近10年來她歷盡滄桑。"},{"english":"We've been through a lot but we're still together. It must be fate.","chinese":"我們歷盡滄桑後仍然在一起，必定是命中註定的。"},{"english":"You I for the sake of ideal and through all difficult, just to the road to success.","chinese":"你我爲了幻想而歷盡了艱難，才走向了成功之路。"},{"english":"Gone through life and death, suffering, Ma Cuifen finally helm Tang.","chinese":"歷盡生死磨難，馬翠芬終於執掌唐家。"},{"english":"Go through vicissitudes of life , your needing to learn to ignore over.","chinese":"歷盡滄桑，你要學會忽略過去。"},{"english":"In the recession, our firm went through a bad time.","chinese":"我們公司在經濟衰退時期歷盡艱辛。"},{"english":"Sick in Brazil Clay Cross, has gone through many hardships.","chinese":"克萊在巴西貧病交加，也歷盡磨練。"},{"english":"But their stay in Dongguan was to be full of hardships.","chinese":"然而，他們在東莞的日子卻歷盡艱辛。"},{"english":"Over the history of its existence the Russian merchant fleet has seen the moments of boom and decline.","chinese":"在俄羅斯的歷史上，商船隊可謂是歷盡榮辱。"},{"english":"After great difficulty, she finally found a job.","chinese":"她歷盡艱難終於找到了一份工作。"}],"related":[]}