{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"simplified":["归"],"rank":3191.0,"normalized_rank":0.04464623004491206,"fraction":0.00004474564609622689,"cumulative_fraction":0.7995536434220631,"word":"歸","components":{"unicode":"U+6B78","character":"歸","decomposition":"⿰⿱𠂤止帚","decomposition_definitions":[{"word":"⿰"},{"word":"⿱"},{"word":"𠂤"},{"definition":["to stop\/to prohibit\/until\/only"],"pinyin":["zhi3"],"word":"止"},{"definition":["broom"],"pinyin":["zhou3"],"word":"帚"}]},"containing_words":[{"definition":["to return to\/to retreat\/regression (statistics)"],"pinyin":["hui2 gui1"],"word":"回歸"},{"definition":["to return sth\/to revert"],"pinyin":["gui1 huan2"],"word":"歸還"},{"definition":["to belong to\/to be affiliated to\/to fall under the jurisdiction of\/a place where one feels that one belongs\/one's final destination (where one need look no further)"],"pinyin":["gui1 shu3"],"word":"歸屬"},{"definition":["to bring to justice\/to file away (a document)"],"pinyin":["gui1 an4"],"word":"歸案"},{"definition":["to sum up\/to summarize\/to conclude from facts\/induction (method of deduction in logic)"],"pinyin":["gui1 na4"],"word":"歸納"},{"definition":["to sum up\/to conclude\/in a nutshell\/the end (of a story)"],"pinyin":["gui1 jie2"],"word":"歸結"},{"definition":["to return to one's unit\/to go back to one's station in life"],"pinyin":["gui1 dui4"],"word":"歸隊"},{"definition":["to give credit\/to give sb his due\/attribution"],"pinyin":["gui1 gong1"],"word":"歸功"},{"definition":["place to return to\/home\/final destination\/ending"],"pinyin":["gui1 su4"],"word":"歸宿"},{"definition":["to belong to\/affiliated to\/to result in sth\/to incline towards"],"pinyin":["gui1 yu2"],"word":"歸於"},{"definition":["to put the blame on\/to accuse"],"pinyin":["gui1 jiu4"],"word":"歸咎"},{"definition":["to go home (to one's native country)\/to return from abroad"],"pinyin":["gui1 guo2"],"word":"歸國"},{"definition":["homeless"],"pinyin":["wu2 jia1 ke3 gui1"],"word":"無家可歸"},{"definition":["in the final analysis\/ultimately"],"pinyin":["gui1 gen1 jie2 di3"],"word":"歸根結底"}],"sentences":[{"english":"The weather became so bad that they had to turn back.","chinese":"天氣變得很壞，他們只好原路而歸了。"},{"english":"And all that dwelt at Lydda and Saron saw him, and turned to the Lord.","chinese":"凡住呂大和沙崙的人都看見了他，就歸服主。"},{"english":"In the year of the jubilee all shall return to their possessions.","chinese":"在這喜年內，人各歸其祖業。"},{"english":"Party B shall still have the ownership of the equipment until Party B is paid in full.","chinese":"甲方未付清全款前，設備的所有權仍歸乙方所有。"},{"english":"\"Lucrece, \" quoth he, \"this night I must enjoy.","chinese":"佳麗，今夜，你須歸我享用。"},{"english":"Weston now demanded all profits from these sales go entirely to the investors.","chinese":"威斯頓如今卻要求所有銷售的利潤均歸投資者。"},{"english":"Her latest work cannot be catagorized as either a novel or an autobiography.","chinese":"她的最新作品既不能歸爲小說，也不能算作自傳。"},{"english":"People used to give credit Columbus for the discovery of the New Continent.","chinese":"人們過去把發現新大陸的功勞歸之於哥倫布。"},{"english":"Luring [A7] students back from foreign campuses constitutes China's new class struggle[A8] .","chinese":"因此，吸引海外學生歸囯成爲了中囯新的階級鬥爭。"},{"english":"I belive that the people of XIANGXIN will provide honest service to surprise you .","chinese":"我們祥鑫人將會以真誠的服務令您們滿意而歸。"},{"english":"One day God will right every wrong.","chinese":"到那日，上帝必使每件事都歸正。"},{"english":"In China, Overseas Chinese Farm is the most significant organization that collectively settled the returned Vietnamese Chinese refugees.","chinese":"華僑農場是中國安頓越南歸難僑最集中的社區。"},{"english":"Take the horse and the cart, you devil, only don't take my life.","chinese":"馬和車都歸你，你個魔鬼，只要留下我的命。"},{"english":"Glory to God in the highest heaven, and on earth peace among those whom he favors!","chinese":"在至高之處榮耀歸神，在地上平安歸他所喜悅的人。"},{"english":"32But I, when I am lifted up from the earth, will draw all men to myself.","chinese":"我若從地上被舉起來，就要吸引萬人來歸我。"},{"english":"All the days of his separation he is holy unto the LORD.","chinese":"在他離俗的日子，他都是歸耶和華爲聖的。"}],"related":[{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["how? (emphatic question)","old variant of 愷|恺[kai3]\/old variant of 凱|凯[kai3]"],"pinyin":["kai3","qi3"],"word":"豈"},{"definition":["(final particle, same as 吧)","to stop\/to cease\/to dismiss\/to suspend\/to quit\/to finish"],"pinyin":["ba4","ba5"],"word":"罷"},{"definition":["to cut short\/extinct\/to disappear\/to vanish\/absolutely\/by no means"],"pinyin":["jue2"],"word":"絕"},{"definition":["alone\/independent\/single\/sole\/only"],"pinyin":["du2"],"word":"獨"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"則"},{"definition":["secret\/hidden\/concealed\/(prefix) crypto-","to lean upon"],"pinyin":["yin3","yin4"],"word":"隱"},{"definition":["old\/opposite: new 新\/former\/worn (with age)"],"pinyin":["jiu4"],"word":"舊"},{"definition":["mistake\/error\/to miss\/to harm\/to delay\/to neglect\/mistakenly"],"pinyin":["wu4"],"word":"誤"},{"definition":["bosom\/heart\/mind\/to think of\/to harbor in one's mind\/to conceive (a child)","surname Huai"],"pinyin":["Huai2","huai2"],"word":"懷"},{"definition":["to go and return\/to return\/to resume\/to return to a normal or original state\/to repeat\/again\/to recover\/to restore\/to turn over\/to reply\/to answer\/to reply to a letter\/to retaliate\/to carry out"],"pinyin":["fu4"],"word":"復"},{"definition":["although\/even though"],"pinyin":["sui1"],"word":"雖"},{"definition":["to abolish\/to abandon\/to abrogate\/to discard\/to depose\/to oust\/crippled\/abandoned\/waste"],"pinyin":["fei4"],"word":"廢"},{"definition":["far\/distant\/remote\/(intensifier in a comparison) by far\/much (lower etc)","to distance oneself from (classical)"],"pinyin":["yuan3","yuan4"],"word":"遠"},{"definition":["all\/various","surname Zhu"],"pinyin":["Zhu1","zhu1"],"word":"諸"}]}