{"definition":["to belong to\/to be affiliated to\/to fall under the jurisdiction of\/a place where one feels that one belongs\/one's final destination (where one need look no further)"],"pinyin":["gui1 shu3"],"simplified":["归属"],"rank":7625.0,"normalized_rank":0.10668364277419444,"fraction":0.000012897415288505433,"cumulative_fraction":0.9051364753862228,"word":"歸屬","characters":[{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"歸"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"}],"containing_words":[{"definition":["sense of belonging"],"pinyin":["gui1 shu3 gan3"],"word":"歸屬感"},{"definition":["right of attribution"],"pinyin":["gui1 shu3 quan2"],"word":"歸屬權"}],"sentences":[{"english":"From that day on, the Klatooinians were property of the Hutt criminal empire.","chinese":"從那以後，克拉圖因人便歸屬於赫特人的犯罪帝國。"},{"english":"You can accomplish much if you do not care who gels the credit.","chinese":"一個人假如不計較功勞歸屬於誰，他的成就就會更大。"},{"english":"Friendships provide a sense of belonging and comfort.","chinese":"友誼提供了歸屬感和舒適感。"},{"english":"We all want to belong, no matter what our age.","chinese":"無論我們年齡有多大，我們需要歸屬感。"},{"english":"Can Americans choose how and when to use ethnic heritage in describing themselves?","chinese":"美國人能夠選擇怎樣及何時使用族裔歸屬自我定位嗎？"},{"english":"The ownership of the island has long been established beyond dispute.","chinese":"該島的歸屬早已確定無疑。"},{"english":"The explanation rights of the above details belongs to our company and the cruise company.","chinese":"以上細則的解釋權歸屬我公司及遊船公司。"},{"english":"One can query the phone number attribution process, support for the latest segment number.","chinese":"一個可以查詢手機號碼歸屬地的程序，支持最新號段。"},{"english":"Payables that cannot be classified as accounts payable.","chinese":"指不能歸屬於應付帳款之款項。"},{"english":"In conclusion, friendships provide a sense of belonging and comfort.","chinese":"最後，友誼提供了歸屬感和舒適感。"},{"english":"The genetic series of these granitic rocks may belong to that of mixed crust-mantle derivation.","chinese":"它們的成因系列應歸屬於殼幔混源型。"},{"english":"The last chapter evaluates the historical significance as well as the categorization of Shen Zi's theories.","chinese":"第六章即最後一章述評慎子的學派歸屬及歷史地位。"},{"english":"They used to be floating in the air and at last found their own sense of belongingness .","chinese":"他們從漂浮於空中到最終尋找到自己的一種歸屬感。"},{"english":"The distinction of identity and the ascription of liability is the basis of all legal relationship.","chinese":"身分辨識及責任歸屬是一切法律關係的基礎。"},{"english":"The Egyptians strove against with the Romans for the possession of the Nile Valley .","chinese":"埃及人爲爭取尼羅河谷的歸屬曾和羅馬人進行鬥爭。"},{"english":"In China, nothing quite kills the romance like the threat of losing real estate.","chinese":"在中國，扼殺浪漫的罪魁禍首當屬房產歸屬權。"}],"related":[{"definition":["rights\/interests\/rights and benefits"],"pinyin":["quan2 yi4"],"word":"權益"},{"definition":["in other words"],"pinyin":["huan4 yan2 zhi1"],"word":"換言之"},{"definition":["independent\/independence\/to stand alone"],"pinyin":["du2 li4"],"word":"獨立"},{"definition":["main part\/bulk\/body\/subject\/agent"],"pinyin":["zhu3 ti3"],"word":"主體"},{"definition":["ownership\/possession\/property rights\/title (to property)"],"pinyin":["suo3 you3 quan2"],"word":"所有權"},{"definition":["both sides"],"pinyin":["liang3 zhe3"],"word":"兩者"},{"definition":["to admit (to membership)"],"pinyin":["jie1 na4"],"word":"接納"},{"definition":["to approve\/approval\/acknowledgment\/OK"],"pinyin":["ren4 ke3"],"word":"認可"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或許"},{"definition":["to be classified as\/to belong to\/to be part of"],"pinyin":["shu3 yu2"],"word":"屬於"},{"definition":["substance\/essence"],"pinyin":["shi2 zhi4"],"word":"實質"},{"definition":["to achieve\/to implement\/to realize\/to bring about"],"pinyin":["shi2 xian4"],"word":"實現"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"認為"},{"definition":["to change\/to alter\/to modify"],"pinyin":["bian4 geng1"],"word":"變更"},{"definition":["to exaggerate"],"pinyin":["kua1 da4"],"word":"誇大"},{"definition":["hidden\/potential\/latent"],"pinyin":["qian2 zai4"],"word":"潛在"}]}