{"definition":["to return to one's original trade\/to put (a business etc) under the administration of the relevant central authority\/(the) relevant (department in charge of sth)"],"pinyin":["gui1 kou3"],"simplified":["归口"],"rank":29759.0,"normalized_rank":0.4163670197137381,"fraction":9.612626728858234e-7,"cumulative_fraction":0.9900123793742652,"word":"歸口","characters":[{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"歸"},{"definition":["mouth\/classifier for things with mouths (people, domestic animals, cannons, wells etc)\/classifier for bites or mouthfuls"],"pinyin":["kou3"],"word":"口"}],"containing_words":[],"sentences":[{"english":"To administer centrally the law popularization and education in the customs institutions.","chinese":"歸口管理海關係統的普法教育。"},{"english":"The Manufacturing Department is responsible for the administrative management of product labels and traceability.","chinese":"製造部負責產品標識和可追溯性歸口管理。"},{"english":"To centralize the external communication and international cooperation affairs in the sector of securities and futures.","chinese":"歸口管理證券期貨行業的對外交往和國際合作事務。"},{"english":"XXVII. The foreign affairs should be under central management.","chinese":"第二十七條涉外事務歸口管理。"},{"english":"To manage unifiedly the foreign relationships and international cooperation affairs in respect of the administration of securities and futures markets.","chinese":"歸口管理證券期貨行業的對外交往和國際合作事務。"},{"english":"This standard is standardized by the Shandong Provincial Forestry Technical Committee.","chinese":"本標準由山東省林業標準化技術委員會歸口。"},{"english":"Planning the budget department returns a people the company plan management department management.","chinese":"計劃預算部歸口公司計劃經營部管理。"},{"english":"To administer the various business of the archives and chronicles center; to administer the confidential and communication office.","chinese":"領導部檔案史志中心業務，歸口管理部機要通信室。"},{"english":"The Human Resource & General Affair Department is responsible for the total management of training work.","chinese":"培訓工作由人力資源總務部歸口管理。"}],"related":[]}