{"definition":["to assign (to a class)\/to classify as\/to include"],"pinyin":["gui1 ru4"],"simplified":["归入"],"rank":21481.0,"normalized_rank":0.30054705972884865,"fraction":0.000002060328225529311,"cumulative_fraction":0.9781237610153456,"word":"歸入","characters":[{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"歸"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"}],"containing_words":[],"sentences":[{"english":"How is the difficulty level for each word determined?","chinese":"每個詞彙是如何歸入不同的難度等級的？"},{"english":"This supercilious attitude relegates me to the level of the commonplace.","chinese":"這種目空一切的心態把我歸入大路貨的檔次。"},{"english":"This item belongs under a different heading.","chinese":"這一項應歸入不同的類目。"},{"english":"Polypodiaceae A family of terrestrial or epiphytic leptosporangiate ferns.","chinese":"有時歸入水龍骨科或珠蕨科。"},{"english":"According to doctors, some diseases fall into the category of stress-related illnesses.","chinese":"醫生認爲，一些疾病應歸入壓力造成的疾病範疇。"},{"english":"These questions may be included in the same category.","chinese":"這些問題可以歸入一類。"},{"english":"All the recent talk about the faltering economy certainly seems to fall into the bad-news category.","chinese":"一切對於無力經濟的討論似乎都可歸入壞消息一類。"},{"english":"Accounts Receivable are often classified as current assets.","chinese":"應收帳款通常歸入流動資產。"},{"english":"That means that all logic belongs within a service.","chinese":"這意味着所有邏輯應歸入一個服務。"},{"english":"Botanists refer this flower to the rose family.","chinese":"植物學家將這花歸入薔薇科。"},{"english":"Policies are grouped into policy groups based on business and access control requirements.","chinese":"可以根據業務和訪問控制要求將策略歸入策略組中。"},{"english":"The material which is of no consequence will be relegated to appendices.","chinese":"那些無關緊要的材料將被歸入附錄中。"},{"english":"Criminalizing such conduct would threaten the freedom of the press, he said.","chinese":"將這類接觸歸入刑事犯罪，將危及新聞自由，他表示。"},{"english":"Surviving Death Eaters will have to be brought to justice or reintegrated into magical society.","chinese":"那些殘存的食死徒要麼繩之於法要麼歸入魔法社會。"},{"english":"This plant belongs to the daisy family.","chinese":"這類植物應歸入菊科。"},{"english":"The prosecution was brought under the emergency act.","chinese":"這起控訴歸入緊急法令。"}],"related":[]}