{"definition":["to bring to justice\/to file away (a document)"],"pinyin":["gui1 an4"],"simplified":["归案"],"rank":10879.0,"normalized_rank":0.1522113245561261,"fraction":0.000007195675160905223,"cumulative_fraction":0.9364845448027588,"word":"歸案","characters":[{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"歸"},{"definition":["(legal) case\/incident\/record\/file\/table"],"pinyin":["an4"],"word":"案"}],"containing_words":[{"definition":["to bring to justice"],"pinyin":["zhuo1 na2 gui1 an4"],"word":"捉拿歸案"}],"sentences":[{"english":"Huang taiji at noon on the second day if the killer is not on the monkey to justice was put to death on her.","chinese":"皇太極下旨第二日中午如果兇手還不歸案就處死玉兒。"},{"english":"Socialist organizations called for the culprits to be hunted down.","chinese":"社會主義團體呼籲將這些犯人緝拿歸案。"},{"english":"The criminal who looted the bank has been hounded down.","chinese":"搶劫銀行的那名罪犯已被捉拿歸案了。"},{"english":"He remembered instances in which defaulters had been captured.","chinese":"他想起一些盜用公款的罪犯被捉拿歸案的例子。"},{"english":"Police have charged a man with murder as a hate crime in her death.","chinese":"警方抓捕了一名男子，並以仇殺罪名將其歸案。"},{"english":"The police have already arrested the bank robber.","chinese":"警察已經把銀行搶劫犯抓捕歸案。"},{"english":"A fourth pirate was captured in the operation on Sunday.","chinese":"第四名海盜在週日的行動中被抓捕歸案。"},{"english":"We find them; we take them as a team and we bring them back.","chinese":"我們找到他們，把他們一網打盡，捉拿歸案。"},{"english":"Last July, the local police arrested Luo and Xu.","chinese":"去年6月，當地警方將羅某與許某逮捕歸案。"},{"english":"Catching the \" Gang of Four \" at one stroke.","chinese":"一舉把“四人幫”捉拿歸案。"},{"english":"The law will haunt them until they are caught.","chinese":"法律將追查到底，直到把他們抓捕歸案。"},{"english":"The police said that it was just a matter of time before the murderer was put into prison.","chinese":"警方表示，將殺人兇手緝拿歸案只是個時間問題。"},{"english":"The police are tying to round up the jewel thieves and bring them to justice.","chinese":"警察正在設法將盜竊珠寶的竊賊捉拿歸案。"},{"english":"According to the authentic news , the grafter has been arrested.","chinese":"據可靠消息，那名貪污犯已被捉拿歸案。"},{"english":"The robbers haven't been sloughed up yet.","chinese":"犯搶劫的案犯還沒有被捉拿歸案。"},{"english":"The criminal was seized by the police.","chinese":"罪犯被警方緝拿歸案。"}],"related":[]}