{"definition":["after all\/in the final analysis\/ultimately"],"pinyin":["gui1 gen1 dao4 di3"],"simplified":["归根到底"],"rank":23203.0,"normalized_rank":0.3246400738740504,"fraction":0.00000174749817116419,"cumulative_fraction":0.9813962842428288,"word":"歸根到底","characters":[{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"歸"},{"definition":["root\/basis\/classifier for long slender objects, e.g. cigarettes, guitar strings\/CL:條|条[tiao2]\/radical (chemistry)"],"pinyin":["gen1"],"word":"根"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["(equivalent to 的 as possessive particle)","background\/bottom\/base\/end (of the month, year etc)\/remnants\/(math.) radix\/base"],"pinyin":["de5","di3"],"word":"底"}],"containing_words":[],"sentences":[{"english":"The competition among enterprises is the competing for the excellent employees in the finial analysis.","chinese":"企業競爭歸根到底是人才的競爭。"},{"english":"So perhaps guilt is good after all.","chinese":"歸根到底，也許罪惡感是個好東西。"},{"english":"After all, journalism is all about being in the right place at the right -- or wrong -- time.","chinese":"歸根到底新聞就是要在恰當的時間出現在恰當的地方。"},{"english":"In the final analysis, then, Liu Xie's philosophy of literature is a philosophy of humanity.","chinese":"因此，歸根到底，劉勰的文學觀乃是一種人生的哲學。"},{"english":"After all, the industrial revolution is far from finished.","chinese":"歸根到底，工業革命遠未完結。"},{"english":"In the final analysis, it was the cultural background of Su Manshu's age that engendered his poems.","chinese":"歸根到底，這是由蘇曼殊所處的時代文化背景決定的。"},{"english":"In the final analysis, approaches of prosecution is concerned with how to allocate the power to prosecute.","chinese":"起訴方式歸根到底是對追訴權的分配問題。"},{"english":"In the final analysis, it was the cultural background of Su Manshu's…","chinese":"歸根到底，這是由蘇曼殊所處的時代文化背景決定的。"},{"english":"Basically, this congress will concentrate on the reform and the opening process.","chinese":"十三大歸根到底是改革開放的大會。"},{"english":"\"These things, at the core, are relationship problems,\" Ybarra said.","chinese":"歸根到底，這些事情都是一些感情問題。"},{"english":"Corruption is also a serious problem. The fundamental solution to these problems lies in deepened reform.","chinese":"解決這些問題歸根到底要靠深化改革。"},{"english":"I was discovering that I could not escape the ghetto after all .","chinese":"我發現自己歸根到底無法擺脫黑人區。"},{"english":"What it comes down to is the sincerity of the sayer.","chinese":"歸根到底是說話人的真誠。"},{"english":"Everything is economical, returning a root to return knot exactly and all is horary of economical.","chinese":"一切節省，歸根到底都歸結爲時間的節省。"},{"english":"What it comes down to is how the user thinks about it.","chinese":"歸根到底應該是用戶怎麼看這兩種東西的。"},{"english":"While much of this boils down to semantics, your choice of words are critical.","chinese":"歸根到底就是語義學，你所選擇的語句是至關重要的。"}],"related":[]}