{"definition":["inductive reasoning"],"pinyin":["gui1 na4 tui1 li3"],"simplified":["归纳推理"],"rank":62308.0,"normalized_rank":0.8717697592097715,"fraction":2.8173681984352912e-8,"cumulative_fraction":0.9998949315812276,"word":"歸納推理","characters":[{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"歸"},{"definition":["surname Na","to receive\/to accept\/to enjoy\/to bring into\/to pay (tax etc)\/nano- (one billionth)\/to reinforce sole of shoes or stockings by close sewing"],"pinyin":["Na4","na4"],"word":"納"},{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"}],"containing_words":[{"definition":["inference by incomplete induction"],"pinyin":["bu4 wan2 quan2 gui1 na4 tui1 li3"],"word":"不完全歸納推理"},{"definition":["inference by complete induction"],"pinyin":["wan2 quan2 gui1 na4 tui1 li3"],"word":"完全歸納推理"}],"sentences":[{"english":"Inductive reasoning moves from specific details to broader generalizations.","chinese":"歸納推理是從具體中歸納普遍的規律。"},{"english":"You can use inductive reasoning to find the next terms in a sequence.","chinese":"你可以使用歸納推理來求一列數中的各次項。"},{"english":"Decision tree learning is one of the widely used and practical methods for inductive inference.","chinese":"決策樹學習是應用最廣泛的歸納推理算法之一。"},{"english":"Every induction is a speculation.","chinese":"所有歸納推理都是一種猜測。"},{"english":"He emphasized the use of inductive reasoning in the pursuit of knowledge.","chinese":"他強調，使用歸納推理在追求知識。"},{"english":"This paper studies the rational problem of general inductive reasoning and nonmonotonic reasoning.","chinese":"本文研究了一般歸納推理與非單調推理的合理性問題。"},{"english":"Distinguish between inductive and deductive reasoning.","chinese":"區分歸納推理和演繹推理。"}],"related":[]}