{"definition":["to blame sb"],"pinyin":["gui1 zui4"],"simplified":["归罪"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"歸罪","characters":[{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"歸"},{"definition":["guilt\/crime\/fault\/blame\/sin"],"pinyin":["zui4"],"word":"罪"}],"containing_words":[],"sentences":[{"english":"All this above imputes or contributes to the communication su ort.","chinese":"以上這些都可以歸罪於或歸功於通信保障。"},{"english":"I have no aspirations such as those you impute to me.","chinese":"我可沒有你歸罪於我的這些慾望。"},{"english":"Londoncannot claim credit for having produced all of the whipping-boys of the financial crisis.","chinese":"不能歸罪倫敦給金融危機帶來這麼多帶罪羔羊。"},{"english":"He blamed the evils of market competition.","chinese":"他把這歸罪於市場競爭這個魔鬼。"},{"english":"But the pure behavior imputation also has the various insufficiency and the flaw.","chinese":"但是單純的行爲歸罪亦有多方面的不足和缺陷。"},{"english":"He had no hesitation in imputing the failure of his marriage to his wife's shortcomings.","chinese":"他毫不猶豫地將他婚姻的失敗歸罪於他妻子的缺點。"},{"english":"The government blames middle men who collect milk from dairy farmers.","chinese":"政府歸罪於從奶牛養殖者手中收購牛奶的中間商。"},{"english":"The heatwave has been blamed on masses of hot air from the Sahara Desert moving north.","chinese":"這場熱浪歸罪於從撒哈拉沙漠向北襲來的大量熱空氣。"},{"english":"Germans far more likely to blame cars and aircraft use for global warming.","chinese":"德國人更傾向於把全球變暖歸罪於汽車和飛機的使用。"},{"english":"But Zhu did not trace all of China’s troubles to foreign invaders.","chinese":"但是朱先生沒有把中國所有的苦難歸罪於侵略者。"},{"english":"Series of attacks blamed on people with grievances, mental illness","chinese":"一連串的截擊歸罪於具有不滿情緒和心理疾病的人。"},{"english":"Now Andy, just take it easy. I'm not saying you are to blame for everything .","chinese":"安狄，別激動，我並沒有說所有的問題都歸罪於你。"},{"english":"They later blamed their experience on the crime culture of the favellas.","chinese":"事後他們把遭遇歸罪於這個貧民區的犯罪文化。"},{"english":"How dare you impute such monstrous intentions to me?","chinese":"我可沒有你歸罪於我的這些慾望。"},{"english":"He thought of inculpating his brother to escape punishment himself.","chinese":"他想歸罪於他的兄弟以避免自己受罰。"},{"english":"But to blame the service for infidelity is to confuse cause and effect.","chinese":"但將夫妻不忠歸罪在線約會則是本末倒置了。"}],"related":[]}