{"definition":["parent shell (of a cluster bomb)"],"pinyin":["mu3 dan4"],"simplified":["母弹"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"母彈","characters":[{"definition":["mother\/elderly female relative\/origin\/source\/(of animals) female"],"pinyin":["mu3"],"word":"母"},{"definition":["crossball\/bullet\/shot\/shell\/ball","to pluck (a string)\/to play (a string instrument)\/to spring or leap\/to shoot (e.g. with a catapult)\/(of cotton) to fluff or tease\/to flick\/to flip\/to accuse\/to impeach\/elastic (of materials)"],"pinyin":["dan4","tan2"],"word":"彈"}],"containing_words":[{"definition":["(military) cluster bomb\/shrapnel"],"pinyin":["zi3 mu3 dan4"],"word":"子母彈"}],"sentences":[{"english":"Flow characteristics of submunition dispensing simultaneously were investigated.","chinese":"研究了子彈同時拋撒子母彈分離干擾氣動特性。"},{"english":"This is the second section about damage effectiveness analysis of aircraft carrier under the attacking of submunition.","chinese":"這是子母彈對航空母艦毀傷效果分析的第二部分。"},{"english":"She had been hit by shrapnel and arrived in the camp five days earlier.","chinese":"她被子母彈擊中，是在5天前抵達營地的。"},{"english":"This article is the third section to analysis effectiveness of the damage submunition against aircraft carrier.","chinese":"是子母彈對航空母艦毀傷效果分析的第三部分。"},{"english":"Shrapnel is made of many materials and its structure seems to be axial symmetry.","chinese":"子母彈是由多種材料組成，結構近似爲軸對稱形式。"},{"english":"This paper studies the effectiveness of fire when the rocket weapon fires rockets containing sub-missiles at a tank-group.","chinese":"本文研究火箭武器用子母彈對坦克羣射擊的射擊效力。"},{"english":"The paper will provide a useful tool for investigating the lethal power of the shrapnels.","chinese":"本文將爲論證子母彈的殺傷威力提供有力的工具。"}],"related":[]}