{"definition":["parent material (e.g. the eroded rock making up sediment)"],"pinyin":["mu3 zhi4"],"simplified":["母质"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"母質","characters":[{"definition":["mother\/elderly female relative\/origin\/source\/(of animals) female"],"pinyin":["mu3"],"word":"母"},{"definition":["character\/nature\/quality\/plain\/to pawn\/pledge\/hostage\/to question\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"質"}],"containing_words":[],"sentences":[{"english":"and macromolecular clumps of organic material called kerogen.","chinese":"最後是一種叫做油母質的大分子化合物。"},{"english":"The matrix, or inferior portion, includes the lowermost part of the follicle and the hair bulb.","chinese":"毛母質或許下部，包括毛囊的最下部和毛球。"},{"english":"The subsoil underneath is the earth from which the soil was made and is called the parent material .","chinese":"下面的亞土壤是土壤起始形成的地方，稱爲母質。"},{"english":"The factors influencing the content of hydrous micas were discussed.","chinese":"結果表明母質是影響粘粒雲母含量的主要因素。"},{"english":"The parent material for the two locations is river alluvial soil.","chinese":"兩個地點土壤母質爲河流沖積土。"},{"english":"Volatilization of ammonia from latosol soils with different matrixes was evaluated in the present study.","chinese":"針對不同母質磚紅壤中氨的揮發損失進行了研究。"},{"english":"Which the soil was made and is called the parent material.","chinese":"下面的亞土壤是土壤起始形成的地方，稱爲母質。"},{"english":"The boron content in soil depends upon the parent materials of soil.","chinese":"土壤硼含量決定於成土母質。"},{"english":"Soil Cu content primarily depend on its parent material.","chinese":"土壤銅含量決定於母質類型。"},{"english":"Oil-generating Parent material kerogen is the important target in petroleum geology study.","chinese":"生油母質乾酪根是石油地質工作研究的重要對象。"}],"related":[]}