{"definition":["toxicology"],"pinyin":["du2 li3 xue2"],"simplified":["毒理学"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"毒理學","characters":[{"definition":["poison\/to poison\/poisonous\/malicious\/cruel\/fierce\/narcotics"],"pinyin":["du2"],"word":"毒"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"It is thus necessary to develop ecotoxicological diagnosis methods.","chinese":"因此，需要發展污染生態毒理學診斷方法。"},{"english":"To provide toxicological basis for the safety evaluation of Yikeyuan beauty capsule.","chinese":"目的爲依科源牌美容膠囊安全性評價提供毒理學依據。"},{"english":"Toxicology is currently a guessing game.","chinese":"現在的毒理學研究就像猜謎遊戲。"},{"english":"This paper was to investigate the mutagenicity of KINGPANAX fresh Panax notoginseng juice.","chinese":"研究了金不換鮮三七液特殊毒理學效應的致突變性。"},{"english":"Objective To analyze toxicological and biological characteristics of transfluthrin.","chinese":"目的分析四氟苯菊酯的毒理學和生物學特徵。"},{"english":"Toxicology certifies that it has no obvious toxic action.","chinese":"毒理學表明寧動顆粒無明顯毒副反應。"},{"english":"Objective To study the toxicity of calcium hyaluronate.","chinese":"目的研究透明質酸鈣的毒理學特性。"},{"english":"Contact the toxicologist in Los Angeles Californiawho specializes in nanotechnology.","chinese":"聯繫加州洛杉磯專門研究納米技術的毒理學家。"},{"english":"Toxicologists attempt to identify and understand toxic hazards.","chinese":"毒理學家試圖找出並瞭解毒害風險。"},{"english":"Further validation of this study is provided today by a new study from the National Toxicology Program.","chinese":"國家毒理學規劃處今日發出一份更深入的驗證研究。"},{"english":"Nanotoxicology is a new area of research.","chinese":"納米毒理學是一個新的研究領域。"}],"related":[]}