{"definition":["pizza (loanword)\/CL:張|张[zhang1]"],"pinyin":["bi3 sa4 bing3"],"simplified":["比萨饼"],"rank":38705.0,"normalized_rank":0.5415331663705175,"fraction":4.3399148466052436e-7,"cumulative_fraction":0.9959594417647564,"word":"比薩餅","characters":[{"definition":["Belgium\/Belgian\/abbr. for 比利時|比利时[Bi3 li4 shi2]","euphemistic variant of 屄[bi1]","to compare\/(followed by a noun and adjective) more {adj.} than {noun}\/ratio\/to gesture\/(Taiwan pr. [bi4] in some compounds derived from Classical Chinese)"],"pinyin":["Bi3","bi1","bi3"],"word":"比"},{"definition":["Bodhisattva\/surname Sa"],"pinyin":["Sa4"],"word":"薩"},{"definition":["round flat cake\/cookie\/cake\/pastry\/CL:張|张[zhang1]"],"pinyin":["bing3"],"word":"餅"}],"containing_words":[],"sentences":[{"english":"For men, the most-ordered item is burgers, followed by french fries and pizza.","chinese":"男性點的最多的是漢堡，其次是薯條和比薩餅。"},{"english":"The school canteen provides hamburgers, sandwiches, pizza and so on.","chinese":"學校食堂提供漢堡，三明治，比薩餅等等。"},{"english":"The pizza was quartered into six pieces.","chinese":"比薩餅被分成六塊。"},{"english":"I'm wondering whether you could come over for a pizza sometime next week?","chinese":"我想知道你下週什麼時候是否能過來喫比薩餅？"},{"english":"Even so, pizza's roots go back to the antediluvian times.","chinese":"但即使如此，比薩餅的根源可追溯至古老的時代。"},{"english":"You can put a lot of different pizza toppings on a pizza base.","chinese":"你可以在比薩餅底襯上加不同的頂配料。"},{"english":"The prisoners' favorites included meat Kebab and pizza, the official said.","chinese":"據稱囚犯們最喜歡的外賣是羊肉串和比薩餅。"},{"english":"Only in Amercia can a pizza get to your house faster than an ambulance.","chinese":"只有在美國，比薩餅能比救護車更快地到達你的門口。"},{"english":"Do you have any pizzas on sale today?","chinese":"今天有特價比薩餅嗎？"},{"english":"I'd like to have a big slice of pizza and a blueberry ice cream.","chinese":"我來一大塊比薩餅，再要一份烏飯樹漿果冰淇淋。"},{"english":"We decide to go get a carry-out pizza for dinner.","chinese":"我們決定買一個比薩餅帶回去作爲晚餐。"},{"english":"B: OK, loser buys pizza tomorrow night.","chinese":"好，輸的人明天晚上請客喫比薩餅。"},{"english":"You can use it to blot a teaspoon of fat off a pizza slice.","chinese":"您可以用它來吸乾比薩餅中一茶匙的脂肪。"},{"english":"No one could imagine eating a piece of pizza without a taste of Oregano added to it.","chinese":"沒有人能想象喫一塊比薩餅沒有味道的牛至添加到它。"},{"english":"But, yesterday, I was so happy that I had a piece after all,\" said Steffen.","chinese":"昨天，我很高興，我還是喫一塊比薩餅。"},{"english":"Thai food, or pizza, or whatever you want.","chinese":"泰國菜，或者比薩餅，隨你喜歡。"}],"related":[]}