{"definition":["stadium\/playing field for a competition"],"pinyin":["bi3 sai4 chang3"],"simplified":["比赛场"],"rank":19416.0,"normalized_rank":0.27165503057098483,"fraction":0.0000025446819914572012,"cumulative_fraction":0.9733971744996476,"word":"比賽場","characters":[{"definition":["Belgium\/Belgian\/abbr. for 比利時|比利时[Bi3 li4 shi2]","euphemistic variant of 屄[bi1]","to compare\/(followed by a noun and adjective) more {adj.} than {noun}\/ratio\/to gesture\/(Taiwan pr. [bi4] in some compounds derived from Classical Chinese)"],"pinyin":["Bi3","bi1","bi3"],"word":"比"},{"definition":["to compete\/competition\/match\/to surpass\/better than\/superior to\/to excel"],"pinyin":["sai4"],"word":"賽"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"}],"containing_words":[],"sentences":[{"english":"The one metre border should be in a different colour from the rest of the matted area.","chinese":"比賽場邊界內一公尺，鋪上不同顏色的墊子。"},{"english":"Who would have a seat right next to the field and not come?","chinese":"誰會買了一張座位靠近比賽場的票卻不來呢？"},{"english":"Cheedleading squads perform during the breaks at basketball matches.","chinese":"籃球比賽場間休息時，啦啦隊活躍起來。"},{"english":"The game was played on vast walled and banked playing areas.","chinese":"比賽在寬闊有圍牆的比賽場巨型。"},{"english":"The cricket games will be held in the stadium of Guangdong University of Technology.","chinese":"板球比賽場位於廣東工業大學校園內。"},{"english":"The competition arena is badly in need of repairs.","chinese":"這個比賽場地急待修繕。"},{"english":"The judge shall dismiss from the ring any Pembroke Welsh Corgi that is excessively shy.","chinese":"裁判通常會將過分羞怯的賓波基犬請出比賽場地。"},{"english":"A small luxury 'life-style' exhibition center is being created adjacent to the polo tournament venue.","chinese":"在馬球比賽場地邊將會設置“時尚奢侈生活展”區域。"},{"english":"Cheering squad is always very lively in the interval of the basketball match.","chinese":"籃球比賽場間休息時，拉拉隊總是很活躍的。"},{"english":"Narrator: Froggy left the venue, he continuously hit, very sad.","chinese":"離開了比賽場地，他連續受到打擊，非常的傷心。"},{"english":"The Tseung Kwan O Sports Ground will be the arena with the most gold medals awarded.","chinese":"將軍澳運動場將是最多金牌誕生的比賽場地。"},{"english":"So world sauna tounament sets match field in Finland.","chinese":"所以世界桑拿錦標賽把比賽場地設在了芬蘭。"},{"english":"A golf course was converted into a cross-country course.","chinese":"一個高爾夫球場則被改裝成越野比賽場地。"},{"english":"But Brad and Angelina weren’t the only famous faces at the game.","chinese":"但是皮特和朱莉並非比賽場唯一的名人。"}],"related":[]}