{"definition":["woolen textiles"],"pinyin":["mao2 zhi1 wu4"],"simplified":["毛织物"],"rank":62712.0,"normalized_rank":0.8774222433646272,"fraction":2.6129995208285856e-8,"cumulative_fraction":0.9999058918734092,"word":"毛織物","characters":[{"definition":["hair\/feather\/down\/wool\/mildew\/mold\/coarse or semifinished\/young\/raw\/careless\/unthinking\/nervous\/scared\/(of currency) to devalue or depreciate\/classifier for Chinese fractional monetary unit ( = 角[jiao3] , = one-tenth of a yuan or 10 fen 分[fen1])","surname Mao"],"pinyin":["Mao2","mao2"],"word":"毛"},{"definition":["to weave\/to knit"],"pinyin":["zhi1"],"word":"織"},{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"}],"containing_words":[],"sentences":[{"english":"Woollen fabrics shrink in the wash.","chinese":"毛織物一洗要縮水。"},{"english":"The article discusses several requests on the style and charcter of worsted goods.","chinese":"本文簡述了毛織物的風格及特徵的幾點基本要求。"},{"english":"This article discusses the development of nanometer intellectualized thermoregulation wool fabric.","chinese":"採用微膠囊納米技術開發智能調溫毛織物。"},{"english":"Synthetic detergents or soaps containing alkaline builders are used to scour wool.","chinese":"具有鹼性組分的合成滌劑或肥皂適用於對毛織物煮練。"},{"english":"Figure 5 is a process flow chart of wool and worsted fabric finishing oprations.","chinese":"圖5系粗紡和精紡毛織物整理加工的流程圖。"},{"english":"Based on this principle, it has developed the worsted wool fabrics with three dimension printing.","chinese":"基於這一原理，開發了三維印花毛織物。"},{"english":"This soap won't shrink woolen goods.","chinese":"這種肥皂不會使毛織物收縮。"},{"english":"Wool usually damages if washed in hot water.","chinese":"毛織物用熱水洗一般會受損。"},{"english":"Figure 4 outlines the operations that take place in woolen and worsted fabric manufacturing.","chinese":"圖4概略表示出粗紡和精紡毛織物生產的工藝流程。"},{"english":"Figure 5 is a process flow chart of wool and worsted fabric finishing operations.","chinese":"圖5系粗紡和精紡毛織物整理加工的流程圖。"}],"related":[]}