{"definition":["effortless\/not expending the slightest effort"],"pinyin":["hao2 bu4 fei4 li4"],"simplified":["毫不费力"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"毫不費力","characters":[{"definition":["hair\/drawing brush\/(in the) least\/one thousandth\/currency unit, 0.1 yuan"],"pinyin":["hao2"],"word":"毫"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["surname Fei","to cost\/to spend\/fee\/wasteful\/expenses"],"pinyin":["Fei4","fei4"],"word":"費"},{"definition":["power\/force\/strength\/ability\/strenuously","surname Li"],"pinyin":["Li4","li4"],"word":"力"}],"containing_words":[],"sentences":[{"english":"I figured out this problem without any effort.","chinese":"我毫不費力地解決了這個問題。"},{"english":"Lift your voice so that everyone can hear you with ease.","chinese":"把嗓門提高，讓大家都能毫不費力地聽清你的話。"},{"english":"I work out the problem without a diffcult.","chinese":"我毫不費力地解決了這個問題。"},{"english":"I can easily finish the work.","chinese":"我可以毫不費力地完成這工作。"},{"english":"With the help of the enthusiast, I had no difficult finding his home.","chinese":"在這個熱心人的幫助下，我毫不費力地找到了他的家。"},{"english":"So he effortlessly went to the team at the top.","chinese":"於是，他毫不費力地就走到了隊毋棠最前面。"},{"english":"He had little difficulty in talking the slanderer down.","chinese":"他以事實和數字爲後盾毫不費力地駁倒了誹謗者。"},{"english":"I'm at work in five-inch heels and perfectly able to do my job.","chinese":"我現在就穿着5英寸的高跟鞋在工作，而且毫不費力。"},{"english":"The wind blew stronger, and the little boat rampaged along effortlessly .","chinese":"風颳得更猛烈了，小船毫不費力地飛速行駛。"},{"english":"He jumped the wall with ease.","chinese":"他毫不費力地跳過了那堵牆。"},{"english":"Now, these three large principles are not always easy to advance at once.","chinese":"這三大原則並非總是能夠毫不費力地同時得到促進。"},{"english":"He creates effortlessly through his word and through his will.","chinese":"通過自己的意願，毫不費力的創造一切。"},{"english":"Most Hou the spot a young girl nowise and hard to tacklely become champion.","chinese":"最後現場一名少女毫不費力地獲得勝利。"},{"english":"The actor coasted to stardom on his good looks.","chinese":"這位男演員靠自己長得漂亮而毫不費力地成了明星。"},{"english":"I know 10 no-sweat ways to buff up your bod.","chinese":"我知道十種毫不費力的鍛鍊身體方法。"},{"english":"it enables it to get its food with very little effort, no more effort than one bite.","chinese":"蛇有了毒液就能夠毫不費力地咬上一口獵到的食物。"}],"related":[]}