{"definition":["a hair\/the slightest"],"pinyin":["hao2 fa4"],"simplified":["毫发"],"rank":29307.0,"normalized_rank":0.410042953283058,"fraction":0.0000010005306545116829,"cumulative_fraction":0.9895695753662492,"word":"毫髮","characters":[{"definition":["hair\/drawing brush\/(in the) least\/one thousandth\/currency unit, 0.1 yuan"],"pinyin":["hao2"],"word":"毫"},{"definition":["hair\/Taiwan pr. [fa3]"],"pinyin":["fa4"],"word":"髮"}],"containing_words":[{"definition":["not to deviate one hair's breadth (idiom)\/to be extremely accurate"],"pinyin":["hao2 fa4 bu4 shuang3"],"word":"毫髮不爽"}],"sentences":[{"english":"They might be,for example,in an accident, and come close to being killed,but walk away without a scratch.","chinese":"比如說在事故中倖存，差點送命，但結果毫髮無傷。"},{"english":"Fortunately, the temple is believed to have escaped any damage.","chinese":"幸運的是，神廟毫髮無傷。"},{"english":"The calculations made by computers are perfectly accurate.","chinese":"計算機的計算毫髮不爽。"},{"english":"He decided to search for it in the land of the Minimoys and try to save the day.","chinese":"他決定到毫髮人的國度尋找寶藏，試圖拯救家園。"},{"english":"But not all Chinese car companies would escape unscathed.","chinese":"不過，並非所有的中國汽車企業都會毫髮無損。"},{"english":"Reiko was crying and had a gash on her forehead, but otherwise the child seemed unhurt.","chinese":"玲子還在哭喊，額頭被擦傷了，除此之外，毫髮無損。"},{"english":"The rich have escaped the recession almost unscathed.","chinese":"富人近乎毫髮無傷地擺脫了衰退。"},{"english":"It is amazing he got out of it without a scratch.","chinese":"他能夠毫髮未傷的走出來真的是讓人驚奇。"},{"english":"A hair's breadth is sometimes a great distance. -(Robert Hugh Benson)","chinese":"有時候毫髮之差也是一個很大的距離。"},{"english":"Ben had a big scare but escaped without injury.","chinese":"在這過程中班飽受驚嚇，但他卻毫髮無損。"},{"english":"We're just glad Emma's okay.","chinese":"值得慶幸的是艾瑪還是毫髮未傷的。"},{"english":"You can't engage in unarmed combat without getting hurt.","chinese":"你不可能在徒手格鬥中毫髮無傷。"},{"english":"Yet the little drow appeared to be unharmed.","chinese":"現在，小小的卓爾精靈好像毫髮無傷。"},{"english":"He apparently walked away from the wrecks, miraculously unharmed.","chinese":"顯然他從失事殘骸中逃了，並奇蹟般地毫髮無傷。"},{"english":"They escaped unharmed.","chinese":"他們毫髮無傷的脫離了。"},{"english":"He is surprised to find himself whole after the car accident.","chinese":"他很驚訝自己在車禍中毫髮未傷。"}],"related":[]}