{"definition":["aerosol"],"pinyin":["qi4 rong2 jiao1"],"simplified":["气溶胶"],"rank":46628.0,"normalized_rank":0.6523862157737887,"fraction":2.0305487896494766e-7,"cumulative_fraction":0.99837866197101,"word":"氣溶膠","characters":[{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"},{"definition":["to dissolve\/soluble"],"pinyin":["rong2"],"word":"溶"},{"definition":["to glue\/glue\/gum\/rubber"],"pinyin":["jiao1"],"word":"膠"}],"containing_words":[{"definition":["aerosol detector"],"pinyin":["qi4 rong2 jiao1 zhen1 cha2 yi2"],"word":"氣溶膠偵察儀"}],"sentences":[{"english":"Study on relationship between extinction coefficient and mass concentration.","chinese":"氣溶膠消光係數與質量濃度的相關性研究。"},{"english":"The study provides scientific basis for exploring aerosol immunity of Hantavirus.","chinese":"這爲研究漢坦病毒的氣溶膠免疫提供了科學依據。"},{"english":"Only small total volumes of liquid aerosols can be expected to reach the distal portions of the tracheobronchial tree.","chinese":"只有很少一部分液狀氣溶膠可達到細末支氣管。"},{"english":"Instead of using an aerosol freshening spray, mist your room with real citrus scent, .","chinese":"用天然甘橘氣味劑代替氣溶膠清新噴霧劑。"},{"english":"Sea salt source contribution to the coast aerosol increased with the diameter of particulate.","chinese":"海鹽源對氣溶膠的貢獻隨氣溶膠粒徑增大而增加。"},{"english":"Sea salt source contribution to the coast aerosol increased with the diameter of particulate.","chinese":"海鹽源對氣溶膠的貢獻隨氣溶膠粒徑增大而增加。"},{"english":"The third one will show you the aerosol optical inversion algorithm in sparse vegetation region.","chinese":"第三章介紹了稀疏植被區域氣溶膠光學厚度反演算法。"},{"english":"The size distribution of aerosol follows unimodal distribution.","chinese":"氣溶膠粒子濃度譜爲單峯分佈。"},{"english":"The sulphur aerosols are actually preventing some warming from taking place currently.","chinese":"含硫氣溶膠實際上一定程度防止了變暖。"},{"english":"The chlorofluoromethanes are used principally in aerosol spray cans and as refrigerants .","chinese":"氯氟甲烷主要使用在氣溶膠噴霧罐和作爲冷凍劑。"},{"english":"The daughter nuclides of radon and thoron tend to become attached.","chinese":"氡和釷射氣的子體易被氣溶膠吸附。"},{"english":"Cloud droplets form around aerosols.","chinese":"積雨雲中的水珠在氣溶膠附近形成。"},{"english":"The absorption of cloud droplets and aerosol is included in the computation.","chinese":"計算中包括雲滴與氣溶膠的吸收作用。"},{"english":"The vertical distribution and diurnal variation law of the bioaerosol concentration in Nanjing City.","chinese":"南京市生物氣溶膠濃度垂直分佈和日變化規律。"},{"english":"Natural aerosols are the most common condensation nuclei in pristine environments.","chinese":"自然環境中非人爲產生的氣溶膠是最常見的雲凝結核。"},{"english":"There are many sources of aerosols, including smoke and pollution from human activities.","chinese":"氣溶膠的來源有很多，包括煙霧和人類活動的污染。"}],"related":[]}