{"definition":["meteorological office"],"pinyin":["qi4 xiang4 ting1"],"simplified":["气象厅"],"rank":31979.0,"normalized_rank":0.4474276999706183,"fraction":7.913447152185342e-7,"cumulative_fraction":0.9919522134332324,"word":"氣象廳","characters":[{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"},{"definition":["elephant\/CL:隻|只[zhi1]\/shape\/form\/appearance\/to imitate"],"pinyin":["xiang4"],"word":"象"},{"definition":["(reception) hall\/living room\/office\/provincial government department"],"pinyin":["ting1"],"word":"廳"}],"containing_words":[],"sentences":[{"english":"Fukushima Prefecture and the Japan Meteorological Agency has issued a tsunami warning, Ibaraki Prefecture.","chinese":"日本氣象廳已向福島縣以及茨城縣發佈海嘯警報。"},{"english":"And yesterday, the Meteorological Agency announced that the rainy season ended.","chinese":"跟住星期三，氣象廳宣佈了梅雨結束了。"},{"english":"After the earthquake, the Japan Meteorological Agency issued tsunami warnings the first time.","chinese":"日本氣象廳在地震發生後第一時間發佈海嘯警報。"},{"english":"According to Busan Regional Meteorological Agency statistics, this is the lowest in 96 years.","chinese":"據釜山地方氣象廳統計，這是96年來最低。"},{"english":"Japan Meteorological Agency has released the devastating tsunami warning.","chinese":"日本氣象廳已發佈破壞性海嘯預警。"},{"english":"Japan Meteorological Agency called on local residents concerned about the new fuel Yue volcanic activity.","chinese":"日本氣象廳呼籲當地居民關注新燃嶽火山的活動情況。"},{"english":"The drought as well as the water shortage will continue for some time, according to the South Korea Meteorological Department.","chinese":"韓氣象廳預計，乾旱及缺水問題將持續一段時間。"},{"english":"The satellite imagery is provided by JMA.","chinese":"該衛星影像是由日本氣象廳提供的。"},{"english":"Japan Meteorological Agency said the earthquake that triggered the tsunami risk.","chinese":"日本氣象廳說，這次地震並沒有引發海嘯的危險。"},{"english":"It also reported a smaller aftershock shortly after.","chinese":"氣象廳還報告了不久之後的一場小規模餘震。"}],"related":[]}