{"definition":["magnesium hydroxide Mg(OH)2"],"pinyin":["qing1 yang3 hua4 mei3"],"simplified":["氢氧化镁"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"氫氧化鎂","characters":[{"definition":["hydrogen (chemistry)"],"pinyin":["qing1"],"word":"氫"},{"definition":["oxygen (chemistry)"],"pinyin":["yang3"],"word":"氧"},{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"},{"definition":["magnesium (chemistry)"],"pinyin":["mei3"],"word":"鎂"}],"containing_words":[],"sentences":[{"english":"Magnesium aluminum hydroxides show higher adsorption capacity to the model pitch and stickies at neutral pH.","chinese":"氫氧化鎂鋁對樹脂和膠黏物在中性條件下吸附量較大。"},{"english":"Preparation of magnesia whiskers by high-temperature flux method;","chinese":"採用循環晶種的方法制取了氫氧化鎂。"},{"english":"Objective This paper focused on adjusting the release rates of risperidone from PLGA microspheres by co-encapsulating Mg(OH)2.","chinese":"目的用氫氧化鎂調節利培酮PLGA微球的釋放速度。"},{"english":"The influence of operating conditions on the performance of Mg(OH) 2 is discussed.","chinese":"討論了試驗條件對氫氧化鎂性能的影響。"},{"english":"Super-fine magnesium hydroxide powder winch surface is treated is a kind of environment-friendly fire-retardant of polymer.","chinese":"超細活性氫氧化鎂是一種重要的環保型阻燃材料。"},{"english":"The advances in production Process and Method of Ultrafine Magnesium Hydroxide is researched.","chinese":"就超細氫氧化鎂阻燃劑的製作與阻燃性能做出研究。"},{"english":"Super-fine magnesium hydroxide powder which surface is treated is a kind of environment-friendly fire-retardant of polymer.","chinese":"超細活性氫氧化鎂是一種重要的環保型阻燃材料。"},{"english":"With the process according to the invention a lactate salt is formed and magnesium hydroxide.","chinese":"用本發明的方法形成乳酸鹽和氫氧化鎂。"},{"english":"How to accelerate the sedimentation rate of magnesium hydroxide was studied in the paper.","chinese":"本文針對如何加快氫氧化鎂的沉降速度進行了研究。"}],"related":[]}