{"definition":["hydrogen bond"],"pinyin":["qing1 jian4"],"simplified":["氢键"],"rank":66688.0,"normalized_rank":0.9330516418787514,"fraction":1.0364411507197183e-8,"cumulative_fraction":0.9999755267048706,"word":"氫鍵","characters":[{"definition":["hydrogen (chemistry)"],"pinyin":["qing1"],"word":"氫"},{"definition":["key (on a piano or computer keyboard)\/button (on a mouse or other device)\/chemical bond\/linchpin"],"pinyin":["jian4"],"word":"鍵"}],"containing_words":[],"sentences":[{"english":"So now these are still hydrogen bonded.","chinese":"那麼現在這些仍然通過氫鍵連接。"},{"english":"Halogen bond is known as a kind of non-covalent intermolecular interaction.","chinese":"滷鍵是一種類似氫鍵的分子間弱相互作用。"},{"english":"The BDE values of title compounds are influenced by intramolecular hydrogen bonds.","chinese":"此外，分子內氫鍵影響鍵離解能值。"},{"english":"Now let's starts breaking some hydrogen bonds.","chinese":"現在讓我們開始破壞掉一些氫鍵。"},{"english":"Vibration analysis show that dimer and trimer have typical red-shift hydrogen bond.","chinese":"振動分析表明二聚體和三聚體存在典型的紅移氫鍵。"},{"english":"It could be hydrogen bonding. Could be different.","chinese":"它有可能是氫鍵，可能不同。"},{"english":"Different adsorption effects of different montmorillonite can be attributed to H-bonding mechanism.","chinese":"並對氫鍵吸附機制進行了探討。"},{"english":"In-situ FTIR was found to be a powerful and effective technique to study the hydrogen bonding quantitatively under various conditions.","chinese":"證明該技術是定量研究煤中氫鍵的有效方法。"},{"english":"N8 atom could form H-bond to the acceptor as a free base.","chinese":"N8原子可能以遊離鹼形式與受體發生氫鍵作用。"},{"english":"Now I want to ask, what's the nature of the carbon-hydrogen bond?","chinese":"現在我想問問，碳氫鍵的本質是什麼？"},{"english":"Please draw the potential hydrogen bond formations and explain how they interact with water.","chinese":"請繪出帶電氫鍵的形成，並解釋它們如何與水作用。"},{"english":"The dimer was formed through intermolecular hydrogen bonds.","chinese":"分子間以氫鍵形成二聚體。"},{"english":"The linear glucan molecules of cellulose are bound together by hydrogen bonds.","chinese":"纖維素中直鏈葡聚糖分子由氫鍵連接在一起。"},{"english":"This paper reviews the recent advance in heteroaromatic molecular tweezers involving multiple hydrogen-bonding sites.","chinese":"綜述了芳雜環類多重氫鍵分子鉗人工受體研究進展。"},{"english":"Nitric acid molecules are linked by hydrogen bonds.","chinese":"硝酸分子以氫鍵互相連結。"},{"english":"Therefore the H-bonds are strengthened or weakened.","chinese":"因此氫鍵就被增強或減弱。"}],"related":[]}