{"definition":["hydrogen chloride HCl"],"pinyin":["lu:4 hua4 qing1"],"simplified":["氯化氢"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"氯化氫","characters":[{"definition":["chlorine (chemistry)"],"pinyin":["lu:4"],"word":"氯"},{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"},{"definition":["hydrogen (chemistry)"],"pinyin":["qing1"],"word":"氫"}],"containing_words":[],"sentences":[{"english":"Systems that use hydrogen chloride must be kept extremely dry.","chinese":"使用氯化氫的系統必須保持非常乾燥。"},{"english":"Residual or process hydrogen chloride within the system should be disposed of using a caustic scrubber.","chinese":"在系統內的殘留氯化氫應該用腐蝕性擦洗器處理。"},{"english":"HC1 and PCDD\/Fs emission can be reduced effectively by introducing calcium base.","chinese":"鈣基的加入可以有效降低氯化氫和二噁英的排放。"},{"english":"Dehydrochlorination reaction can be prevented effectively while adding stabilizer.","chinese":"加入穩定劑能有效的防止脫氯化氫反應。"},{"english":"Anhydrous hydrogen chloride is considered non-corrosive.","chinese":"無水氯化氫被認爲是沒有腐蝕性的。"},{"english":"The rings are opened with hydrogen chloride and deuterium chloride.","chinese":"應用氯化氫和氯化氘打開沅環。"},{"english":"It is noncorrosive in the anhydrous state.","chinese":"在無水狀態氯化氫沒有腐蝕性。"},{"english":"One of the greatest vulnerabilities of hydrogen chloride tube trailers is the involvement in a transportation accident.","chinese":"氯化氫管道拖車的最大弱點之一是捲入交通事故。"},{"english":"Chlorine-37 likes to bond with hydrogen and vaporize out as hydrogen chloride.","chinese":"氯37容易與氫元素化合，以氯化氫的形式蒸發出來。"},{"english":"The present running situation on diad graphite synthetic furnace producing hydrogen chloride is introduced in the paper.","chinese":"介紹了二合一石墨合成爐制氯化氫的運行狀況。"},{"english":"The method of purifying hydrogen chloride is introduced.","chinese":"介紹了一種氯化氫精製技術。"},{"english":"But this process also released large amounts of deadly hydrochloric acid gas.","chinese":"但是這個過程同時也釋放了大量的氯化氫酸性氣體。"}],"related":[]}