{"definition":["aquatic (plant, animal)"],"pinyin":["shui3 sheng1"],"simplified":["水生"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"水生","characters":[{"definition":["surname Shui","water\/river\/liquid\/beverage\/additional charges or income\/(of clothes) classifier for number of washes"],"pinyin":["Shui3","shui3"],"word":"水"},{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"}],"containing_words":[{"definition":["heavy water production"],"pinyin":["zhong4 shui3 sheng1 chan3"],"word":"重水生產"}],"sentences":[{"english":"Tests showed increased levels of toxin in shellfish.","chinese":"檢驗表明水生有殼動物的毒素水平提高了。"},{"english":"The aquatic-living colonies had a higher photosynthetic carbon fixation capacity than the natural colonies.","chinese":"水生原植體的光合固碳能力比天然原植體高。"},{"english":"A weedy aquatic plant of genus elodea.","chinese":"伊樂藻屬的任何一種水生植物。"},{"english":"Farmers water plants with it while firemen use it to put out fire.","chinese":"農民水生植物而消防員用它來撲滅火。"},{"english":"Everybody knew that the aquarium is the raising aquatic animal's place.","chinese":"大家知道水族館是飼養水生動物的地方。"},{"english":"The downstream reach of Tankeng Hydropower Station is a key protection area of Pelochely bibroni.","chinese":"灘坑水電站下游爲國家一級保護水生動物黿的保護區。"},{"english":"Has the condition to be possible to pick the aquatic animal whole the laboratory to carry on again processing.","chinese":"有條件的可將水生動物整體採回實驗室再進行處理。"},{"english":"An osmotic agent is added to the composition for use in attracting salt-water aquatic animals.","chinese":"一種滲透性的試劑添加到其中用來吸引鹹水水生動物。"},{"english":"A water lily glows in the aquatic plants area of San Francisco's Conservatory of Flowers.","chinese":"一支睡蓮在舊金山溫室花房的水生植物區熠熠綻放着。"},{"english":"Water creates wood but restricts fire, mirroring the nourishing and flourishing nature.","chinese":"水生木克火曰則上，具滋潤向上，鑽研之性。"},{"english":"We describe the influence of heavy metal pollution on the morphological and internal structural changes of aquatic Dipteral insects.","chinese":"水生雙翅目昆蟲是監測水體重金屬污染的理想對象。"},{"english":"The mechanisms of the compensatory growth of V. spiralis were discussed.","chinese":"並初步探討了水生植物受損後的補償生長機理。"},{"english":"A study on lake vegetation of Yunnan Plateau.","chinese":"雲南高原湖泊水生植被的研究。"},{"english":"This pool can also be used for experimentations on hydro-culture or cultivating plants for biofuel.","chinese":"該池也可用於水紋研究實驗或栽培水生植物生物燃料。"},{"english":"Of toxaphene in lake water and its uptake by aquatic plants and animals.","chinese":"毒殺芬湖中的水，其吸收的水生的植物和動物。"},{"english":"The longest spathe of submersed plant was measured more than 60 cm!","chinese":"這種水生植物的佛焰苞經多大60釐米長。"}],"related":[{"definition":["surname Mu","tree\/wood\/coffin\/wooden\/simple\/numb\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Mu4","mu4"],"word":"木"},{"definition":["menstruation\/woman's period"],"pinyin":["gui3 shui3"],"word":"癸水"},{"definition":["12th earthly branch: 9-11 p.m., 10th solar month (7th November-6th December), year of the Boar\/ancient Chinese compass point: 330°"],"pinyin":["hai4"],"word":"亥"},{"definition":["five phases of Chinese philosophy: wood 木, fire 火, earth 土, metal 金, water 水"],"pinyin":["wu3 xing2"],"word":"五行"},{"definition":["snake\/serpent\/CL:條|条[tiao2]"],"pinyin":["she2"],"word":"蛇"},{"definition":["variant of 鱉|鳖[bie1]"],"pinyin":["bie1"],"word":"鼈"},{"definition":["fifth of the ten Heavenly Stems 十天干[shi2 tian1 gan1]\/fifth in order\/letter \"E\" or Roman \"V\" in list \"A, B, C\", or \"I, II, III\" etc\/penta"],"pinyin":["wu4"],"word":"戊"},{"definition":["tortoise\/turtle"],"pinyin":["gui1"],"word":"龜"},{"definition":["owl\/valiant\/trafficker"],"pinyin":["xiao1"],"word":"梟"},{"definition":["10th earthly branch: 5-7 p.m., 8th solar month (8th September-7th October), year of the Rooster\/ancient Chinese compass point: 270° (west)"],"pinyin":["you3"],"word":"酉"},{"definition":["aquatic grasses\/elegant"],"pinyin":["zao3"],"word":"藻"},{"definition":["Tu (ethnic group)\/surname Tu","earth\/dust\/clay\/local\/indigenous\/crude opium\/unsophisticated\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Tu3","tu3"],"word":"土"},{"definition":["loach\/mud fish\/CL:條|条[tiao2]"],"pinyin":["ni2 qiu5"],"word":"泥鰍"},{"definition":["variant of 鱷|鳄[e4]"],"pinyin":["e4"],"word":"鰐"},{"definition":["fish\/CL:條|条[tiao2],尾[wei3]","surname Yu"],"pinyin":["Yu2","yu2"],"word":"魚"},{"definition":["age\/seventh of the ten Heavenly Stems 十天干[shi2 tian1 gan1]\/seventh in order\/letter \"G\" or Roman \"VII\" in list \"A, B, C\", or \"I, II, III\" etc\/ancient Chinese compass point: 255°\/hepta"],"pinyin":["geng1"],"word":"庚"}]}