{"definition":["as the water recedes, the rocks appear (idiom)\/the truth comes to light"],"pinyin":["shui3 luo4 shi2 chu1"],"simplified":["水落石出"],"rank":20592.0,"normalized_rank":0.2881087963286836,"fraction":0.000002248931319434927,"cumulative_fraction":0.9762125263091224,"word":"水落石出","characters":[{"definition":["surname Shui","water\/river\/liquid\/beverage\/additional charges or income\/(of clothes) classifier for number of washes"],"pinyin":["Shui3","shui3"],"word":"水"},{"definition":["colloquial reading for 落[luo4] in certain compounds","to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["la4","lao4","luo4"],"word":"落"},{"definition":["dry measure for grain equal to ten dou 斗\/ten pecks\/one hundred liters","rock\/stone\/stone inscription\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Shi"],"pinyin":["Shi2","dan4","shi2"],"word":"石"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"I’m not sure the whole truth ever came out.","chinese":"我無法肯定全部的真相最終能否水落石出。"},{"english":"The truth finally coming out, Zhang could not help tearing when being interviewed.","chinese":"一切水落石出，章子怡在接受採訪時泣不成聲。"},{"english":"Until I get to the bottom of it, I won't know what peace is.","chinese":"直到水落石出的那一天，不然我不知道什麼是安寧。"},{"english":"\"the justice is inescapable, is sparse and is leakproof \", the matter has coming to light one day finally.","chinese":"“天網恢恢，疏而不漏”，事情終有水落石出的一天。"},{"english":"Four flees vast for Ting, makes Ting's unjust charge to seem to be that comes to light the time.","chinese":"浩爲婷四出奔走，令婷的冤獄似有水落石出之期。"},{"english":"But the scale and nature of the attacks is also quickly realised.","chinese":"但這起襲擊事件的規模和本質也迅速水落石出。"},{"english":"We have to ravel the matter out.","chinese":"我們必須把事情弄個水落石出。"},{"english":"The matter settled shortly after the presentation of this information.","chinese":"這一信息的出現很快讓事情水落石出順利解決。"}],"related":[{"definition":["the whole truth is revealed (idiom); everything becomes clear"],"pinyin":["zhen1 xiang4 da4 bai2"],"word":"真相大白"},{"definition":["culprit"],"pinyin":["zhen1 xiong1"],"word":"真兇"},{"definition":["to investigate thoroughly"],"pinyin":["che4 cha2"],"word":"徹查"},{"definition":["lit. paper can't wrap fire; fig. the truth will out"],"pinyin":["zhi3 bao1 bu4 zhu4 huo3"],"word":"紙包不住火"},{"definition":["to find out\/to ascertain\/to get to the bottom of\/to clarify"],"pinyin":["cha2 qing1"],"word":"查清"},{"definition":["to float up (idiom); to become evident\/to surface\/to appear"],"pinyin":["fu2 chu1 shui3 mian4"],"word":"浮出水面"},{"definition":["conducting business impartially (idiom); to act justly"],"pinyin":["bing3 gong1 ban4 li3"],"word":"秉公辦理"},{"definition":["malign agent who manipulates from behind the scenes\/hidden hand"],"pinyin":["mu4 hou4 hei1 shou3"],"word":"幕後黑手"},{"definition":["(of a plot etc) to be exposed (idiom)\/to come to light"],"pinyin":["dong1 chuang1 shi4 fa1"],"word":"東窗事發"},{"definition":["to be executed"],"pinyin":["fu2 fa3"],"word":"伏法"},{"definition":["the truth about sth\/the actual facts"],"pinyin":["zhen1 xiang4"],"word":"真相"},{"definition":["(of a plot etc) to fall through and stand exposed"],"pinyin":["bai4 lu4"],"word":"敗露"},{"definition":["\"Red Poppies\", novel by 阿來|阿来[A1 lai2]","lit. the dust has settled (idiom)\/fig. to get sorted out\/to be finalized"],"pinyin":["Chen2 ai1 luo4 ding4","chen2 ai1 luo4 ding4"],"word":"塵埃落定"},{"definition":["the dead cannot testify (idiom); dead men tell no tales"],"pinyin":["si3 wu2 dui4 zheng4"],"word":"死無對證"},{"definition":["to punish according to the law\/to bring to justice"],"pinyin":["sheng2 zhi1 yi3 fa3"],"word":"繩之以法"},{"definition":["the rise and fall of the terrain (idiom)\/(fig.) the whole sequence of events\/causes and effects"],"pinyin":["lai2 long2 qu4 mai4"],"word":"來龍去脈"}]}