{"definition":["waterwheel\/millwheel"],"pinyin":["shui3 lun2"],"simplified":["水轮"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"水輪","characters":[{"definition":["surname Shui","water\/river\/liquid\/beverage\/additional charges or income\/(of clothes) classifier for number of washes"],"pinyin":["Shui3","shui3"],"word":"水"},{"definition":["wheel\/disk\/ring\/steamship\/to take turns\/to rotate\/by turn\/classifier for big round objects: disk, or recurring events: round, turn"],"pinyin":["lun2"],"word":"輪"}],"containing_words":[{"definition":["see 風水輪流轉|风水轮流转[feng1 shui3 lun2 liu2 zhuan4]"],"pinyin":["feng1 shui3 lun2 liu2"],"word":"風水輪流"},{"definition":["fortunes rise and fall\/times change"],"pinyin":["feng1 shui3 lun2 liu2 zhuan4"],"word":"風水輪流轉"}],"sentences":[{"english":"The turning direction of this water turbine is overlook clockwise.","chinese":"水輪機旋向爲俯視順時針。"},{"english":"This article proposes an improved mehodof selecting the desirable type and parameter for a reaction turbine.","chinese":"本文提出一種改進的反擊式水輪機選型方法。"},{"english":"Installation of a working wheel of the hydraulic turbine.","chinese":"安裝水輪機工作輪。"},{"english":"Use of poppet valve in a separate housing parallel to turbine is seldom.","chinese":"很少有作爲單獨的外殼，而與水輪機並行的情況。"},{"english":"Cavitation theory does not belong to Pelton turbine.","chinese":"空化理論不屬於水斗式水輪機。"},{"english":"12 radiaxial hydroelectric generating sets are installed in the hall.","chinese":"在大廳中的12座水輪發電機組已經安裝完畢。"},{"english":"The impulse of falling water turns the waterwheel.","chinese":"落水的衝力使水輪轉動。"},{"english":"Look back the passed history, re-understand the Pelton turbine, look forward its prospect future.","chinese":"回顧認識水斗式水輪機，展望其未來發展。"},{"english":"The torque of the shafts of turbines and generators was transmitted by friction.","chinese":"水輪機與發電機大軸靠摩擦傳遞力矩。"},{"english":"The experimental study on the influence of bucket numbers on the Pelton turbine′s performance was presented.","chinese":"研究了水斗數對沖擊式水輪機性能的影響。"},{"english":"The hydro grates are on the bed of a hog boiler.","chinese":"水輪發電機爐是在牀上的豬鍋爐。"},{"english":"There is an image of a silk spinning machine powered by a water wheel that dates to 1313.","chinese":"一部水輪轉動絲綢紡車圖像的日期確定爲1313年。"},{"english":"As a result, application and practice shows the remarkable advantage effect by taking integrative measures at XLD.","chinese":"實踐證明小浪底水輪機採取的綜合抗磨措施效果顯著。"},{"english":"Guide bearing of vertical hydrogenerator carries the radial force from its rotatory parts.","chinese":"立式水輪發電機的導軸承承受轉動部件的徑向力。"},{"english":"With the development of waterpower resources, the dimension of runner blade of Kaplan turbine is getting larger and larger.","chinese":"隨着水力資源的開發，轉槳式水輪機葉片日趨增大。"},{"english":"A motion equation for hydrogenerator set with non-direct connection is established in this paper.","chinese":"本文中建立了非直聯水輪發電機組運動方程。"}],"related":[{"definition":["lit. small belly, chicken's gut (idiom); narrow-minded\/petty"],"pinyin":["xiao3 du4 ji1 chang2"],"word":"小肚雞腸"},{"definition":["to die without a burial site\/to die a pauper\/a tragic end"],"pinyin":["si3 wu2 zang4 shen1 zhi1 di4"],"word":"死無葬身之地"},{"definition":["variant of 敢做敢當|敢做敢当[gan3 zuo4 gan3 dang1]"],"pinyin":["gan3 zuo4 gan3 dang1"],"word":"敢作敢當"},{"definition":["to have no other choice\/to be the last resort"],"pinyin":["bu4 de2 yi3 er2 wei2 zhi1"],"word":"不得已而為之"},{"definition":["No flower can bloom for a hundred days.\/Good times do not last long. (idiom)"],"pinyin":["hua1 wu2 bai3 ri4 hong2"],"word":"花無百日紅"},{"definition":["bold, visionary words"],"pinyin":["hao2 yan2 zhuang4 yu3"],"word":"豪言壯語"},{"definition":["to refute\/to demolish (an argument, theory etc)"],"pinyin":["bo2 dao3"],"word":"駁倒"},{"definition":["lit. to kill the chicken to get the eggs (idiom)\/fig. to kill the goose that lays the golden eggs"],"pinyin":["sha1 ji1 qu3 luan3"],"word":"殺雞取卵"},{"definition":["to behave unscrupulously"],"pinyin":["zi4 yi4 wang4 wei2"],"word":"恣意妄為"},{"definition":["lit. not even the chickens and dogs are left undisturbed (idiom)\/fig. great commotion\/pandemonium"],"pinyin":["ji1 quan3 bu4 ning2"],"word":"雞犬不寧"},{"definition":["lit. not eating for fear of choking (idiom); fig. to cut off one's nose to spite one's face\/to avoid sth essential because of a slight risk"],"pinyin":["yin1 ye1 fei4 shi2"],"word":"因噎廢食"},{"definition":["to make a fool of oneself"],"pinyin":["nao4 xiao4 hua4"],"word":"鬧笑話"},{"definition":["keenly felt pain\/bitter anguish"],"pinyin":["qie4 fu1 zhi1 tong4"],"word":"切膚之痛"},{"definition":["(idiom) to lose one's head\/to panic\/to go to pieces"],"pinyin":["zi4 luan4 zhen4 jiao3"],"word":"自亂陣腳"},{"definition":["chicken-hearted (idiom)\/gutless"],"pinyin":["dan3 xiao3 ru2 shu3"],"word":"膽小如鼠"},{"definition":["without a retreat route\/caught in a dead end\/having burned one's bridges"],"pinyin":["wu2 lu4 ke3 tui4"],"word":"無路可退"}]}