{"definition":["water and land transport"],"pinyin":["shui3 lu4 jiao1 tong1"],"simplified":["水陆交通"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"水陸交通","characters":[{"definition":["surname Shui","water\/river\/liquid\/beverage\/additional charges or income\/(of clothes) classifier for number of washes"],"pinyin":["Shui3","shui3"],"word":"水"},{"definition":["shore\/land\/continent","six (banker's anti-fraud numeral)","surname Lu"],"pinyin":["Lu4","liu4","lu4"],"word":"陸"},{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"},{"definition":["classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)","to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc"],"pinyin":["tong1","tong4"],"word":"通"}],"containing_words":[],"sentences":[{"english":"Beautiful scenery, is extremely advantageous geographical conditions, water and land transportation accessible.","chinese":"山水秀麗，地理條件十分優越，水陸交通四通八達。"},{"english":"The convenient land and water transport is conducive to the development of export-oriented economy.","chinese":"水陸交通便利，有利於外向型經濟的發展。"},{"english":"Beilun port in the north, along the southeast coast of China's major sea and land transport hub.","chinese":"北靠北侖港，是我國東南沿海重要的水陸交通樞紐。"},{"english":"Endowed with unique location, Hamburg becomes the center of water and land transportation.","chinese":"得天獨厚的地理位置，使漢堡成爲水陸交通的中心。"},{"english":"Bao ying County is an important material transfer place in the middle Jiangsu Area, and the terraqueous transport of Bao ying is very convenient.","chinese":"寶應縣是蘇中地區物資轉運要邑，水陸交通十分便利。"},{"english":"In history, Hubei has been a hub of both water and land transportation in China.","chinese":"湖北歷來爲中國水陸交通運輸樞紐。"}],"related":[]}