{"definition":["to ask for sth and receive it\/to try to obtain\/to look for and obtain"],"pinyin":["qiu2 de2"],"simplified":["求得"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"求得","characters":[{"definition":["to seek\/to look for\/to request\/to demand\/to beseech"],"pinyin":["qiu2"],"word":"求"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[],"sentences":[{"english":"The explicit expressions of free surface and resultant forces imposing on the rotor are obtained.","chinese":"求得了自由面和作用在轉子上的合力的顯式表達式。"},{"english":"When Poissons ratio is zero, tile exact solution of displacement is obtained.","chinese":"當泊桑比爲零時，求得位移的精確解。"},{"english":"But this year I choose on the windowsill, obtained a leisurely.","chinese":"但今年我卻選擇獨倚窗臺，求得一點閒適。"},{"english":"Only the resultant matrix is needed to solve the greatest common factor of polynomials …","chinese":"該方法僅利用結矩陣便可求得多項式的最大公因式。"},{"english":"FRIEDMAN And where it's almost impossible to make them precise.","chinese":"並且在這個領域中幾乎不可能求得精確的計算。"},{"english":"Originally the phrase means two fish out of water moisten each other with saliva to keep each other alive temporarily.","chinese":"原指離開水的魚相互吐沫沾溼，以求得暫時的生存。"},{"english":"The approach of continuous gust response was based on the calculation of the power spectral density.","chinese":"對於連續突風，由頻響函數求得響應的功率譜密度。"},{"english":"it hides the sun for whom she cries.","chinese":"它藏起得太陽，而太陽原是他所呼求得。"},{"english":"You would get that by integrating the density.","chinese":"你可以通過對密度積分求得它的質量。"},{"english":"Finally, calculation examples are used to gain results under certain confidence level.","chinese":"最後結合算例求得一定置信水平下問題的結果。"},{"english":"All transitions are found to be the first order.","chinese":"所求得的相變都是一級相變。"},{"english":"The transfer rate equation is experimentally obtained and the superficial transfer energy is calculated.","chinese":"並求得初始傳質速率方程，計算了表觀傳質反應熱。"},{"english":"Even in the case of multi-variable function, the minimization of the logical function can also be obtained.","chinese":"在多變量的情況下也能求得邏輯函數的最簡式。"},{"english":"Optimal solutions to LP problems so far have been found under deterministic assumptions.","chinese":"LP問題的最佳解是依據確定性的假設前題下求得。"},{"english":"Unplesant feelings should be released to obtain the balance in mental.","chinese":"不愉快的情緒必須釋放，以求得心理上的平衡。"},{"english":"They can, however, be estimated from the training set.","chinese":"但是這些都是可以通過訓練集估計求得。"}],"related":[{"definition":["to seek after\/to strive for"],"pinyin":["qiu2 qu3"],"word":"求取"},{"definition":["to seek\/to look for\/to request\/to demand\/to beseech"],"pinyin":["qiu2"],"word":"求"},{"definition":["in order to"],"pinyin":["yi3 qiu2"],"word":"以求"},{"definition":["inappropriate or presumptuous demands"],"pinyin":["wang4 qiu2"],"word":"妄求"},{"definition":["to seek for\/to hope to gain\/desirous"],"pinyin":["qi3 qiu2"],"word":"企求"},{"definition":["to desire\/wants\/appetites"],"pinyin":["yu4 qiu2"],"word":"欲求"},{"definition":["to pray for\/to appeal"],"pinyin":["qi2 qiu2"],"word":"祈求"},{"definition":["to repay\/to reward"],"pinyin":["chou2 bao4"],"word":"酬報"},{"definition":["to seek\/to pursue\/to investigate"],"pinyin":["tan4 qiu2"],"word":"探求"},{"definition":["to obtain a proof\/Q.E.D."],"pinyin":["de2 zheng4"],"word":"得證"},{"definition":["so as to\/for the purpose of\/in order to"],"pinyin":["jie4 yi3"],"word":"借以"},{"definition":["to convert to (a religion)\/to rely upon\/refuge\/mainstay"],"pinyin":["gui1 yi1"],"word":"歸依"},{"definition":["repay\/recompense"],"pinyin":["bao4 chang2"],"word":"報償"},{"definition":["can then (and only then)"],"pinyin":["fang1 neng2"],"word":"方能"},{"definition":["to grow old with unfailing eyes and ears (idiom)"],"pinyin":["chang2 sheng1 jiu3 shi4"],"word":"長生久視"},{"definition":["in order to\/because of\/for the sake of"],"pinyin":["wei4 zhe5"],"word":"為著"}]}