{"definition":["to contaminate"],"pinyin":["wu1 sun3"],"simplified":["污损"],"rank":37075.0,"normalized_rank":0.5187273515873126,"fraction":5.027469469124944e-7,"cumulative_fraction":0.9951956925141408,"word":"污損","characters":[{"definition":["dirty\/filthy\/foul\/corrupt\/to smear\/to defile\/dirt\/filth"],"pinyin":["wu1"],"word":"污"},{"definition":["to decrease\/to lose\/to damage\/to harm\/(coll.) to speak sarcastically\/to deride\/caustic\/mean\/one of the 64 hexagrams of the Book of Changes (䷨)"],"pinyin":["sun3"],"word":"損"}],"containing_words":[],"sentences":[{"english":"Nearly 20% of the bales were broken and the contents badly soiled.","chinese":"將近20%的包都破了，包內的貨物嚴重污損。"},{"english":"Avoid defacing headliner inside the vehicle .","chinese":"避免污損頭條新聞車內。"},{"english":"The staining and losing of the books and periodicals are the common phenomena in university library.","chinese":"書刊污損與流失是高校圖書館普遍存在的現象。"},{"english":"Defect detection is an essential step in paper currency sorting.","chinese":"污損檢測是紙幣清分中的一個重要環節。"},{"english":"What harm is there if thy clothes become tattered and stained?","chinese":"你的衣服污損了又何妨呢？"},{"english":"Why is sin described as \"defiling\" a person?","chinese":"爲什麼罪被形容爲污損人呢？"},{"english":"If you spoil your paper, intentionally or accidentally.","chinese":"如果你故意或無意地污損考卷。"},{"english":"The same shall apply to stained or damaged imprinted stamps on postcards, aerogrammes and letter sheets.","chinese":"明信片及特製郵簡上表示價格之花紋有污損時，亦同。"},{"english":"Don't deface library books.","chinese":"不要污損圖書館的書籍。"},{"english":"Please protect equipment and facilities, if there is any defile, you should compensate as its price.","chinese":"請閣下敬服設施裝備，如有污損按價賠償。"},{"english":"The youths used spray paint to deface buildings during the riots.","chinese":"這些年輕人在抗爭時用噴漆污損了建築物的外觀。"},{"english":"Barnacle is one kind of marine fouling organism in the East China Sea.","chinese":"藤壺是東海區主要的污損生物之一。"},{"english":"It is disgraceful this night of British pride has been sullied, \" said a government spokesman.\"","chinese":"“英國的榮耀在今晚被污損了，”一位政府發言人說。"},{"english":"This is about more than petty hackers who deface websites.","chinese":"這是關於多誰污損小黑客網站。"},{"english":"There is no discernable offset on the paper.","chinese":"這張紙上沒有明顯的污損。"},{"english":"Anything that tainted the image wouldn't be welcome.","chinese":"任何污損形象的事情都不會受到歡迎。"}],"related":[]}