{"definition":["determinism"],"pinyin":["jue2 ding4 lun4"],"simplified":["决定论"],"rank":43689.0,"normalized_rank":0.6112657926769549,"fraction":2.7108045308260797e-7,"cumulative_fraction":0.9976860451363458,"word":"決定論","characters":[{"definition":["to decide\/to determine\/to execute (sb)\/(of a dam etc) to breach or burst\/definitely\/certainly"],"pinyin":["jue2"],"word":"決"},{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"論"}],"containing_words":[],"sentences":[{"english":"Finally, it confuses the ambit of historical determinism and historical non-determinism.","chinese":"其四，混淆機械決定論和辯證決定論的侷限。"},{"english":"Finally, it confuses the ambit of historical determinism and historical non-determinism.","chinese":"其四，混淆機械決定論和辯證決定論的侷限。"},{"english":"The author attempts to avoid technology determinism starting off from the media.","chinese":"在研究中力避單純從媒介出發的技術決定論。"},{"english":"Popper's Historical Non-determinism is formed and reflected in the process of critiizing Maxist Historical Determinism and once evoked great repercussion in Western society.","chinese":"波普爾的歷史非決定論曾在西方社會產生過很大影響。"},{"english":"Fried, too, finds it impossible to keep determinism at the top of his mind.","chinese":"弗萊德也發現在他心靈的最上層無法堅持決定論。"},{"english":"That may sound like a clear-cut piece of biological determinism.","chinese":"乍一聽，這似乎是‘生物決定論’的典型例證。"},{"english":"The conclusion was that co-decision theory is more reasonable and it is similar to the theory of demand and supply.","chinese":"結論是，共同決定論更合理，與供求論有相似之處。"},{"english":"The argument of antithesis tries to falsify the possibility of freedom and therefore to ground the determinism of nature causality.","chinese":"反命題則否證一切自由之可能而奠定決定論。"},{"english":"The technological determinist, however, is the opposite of dialectical reasoning.","chinese":"這與技術決定論的非辯證思維是根本對立的。"},{"english":"The technological determinist, however, is the opposite of dialectical$…","chinese":"這與技術決定論的非辯證思維是根本對立的。"},{"english":"Therefore, shaping about innovation psychology should not preponderate over the principle with practice determining theory.","chinese":"所以，創新心理的形成不能超過實踐決定論這一原則。"},{"english":"In fact, determinism is required for self-control.","chinese":"事實上，自我控制需要決定論。"},{"english":"This paper puts forward to a new explanation of natural historical process determinism to unemployment in China.","chinese":"提出我國失業的自然歷史過程決定論新解。"},{"english":"And some real biological determinism comes in here.","chinese":"一些生理決定論也源自於這兒。"},{"english":"In this paper, non-determinism which is opposite to determinism concept is defined clearly.","chinese":"本文對非決定論概念也作了明確的界定。"}],"related":[]}