{"definition":["gasoline engine"],"pinyin":["qi4 you2 ji1"],"simplified":["汽油机"],"rank":32207.0,"normalized_rank":0.4506177157807844,"fraction":7.755791315174457e-7,"cumulative_fraction":0.9921308557437688,"word":"汽油機","characters":[{"definition":["steam\/vapor"],"pinyin":["qi4"],"word":"汽"},{"definition":["oil\/fat\/grease\/petroleum\/to apply tung oil, paint or varnish\/oily\/greasy\/glib\/cunning"],"pinyin":["you2"],"word":"油"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[],"sentences":[{"english":"This paper studied the cycle-to-cycle variation of in-cylinder peak pressure in gasoline engines.","chinese":"本文對汽油機最高爆發壓力的循環變動進行了研究。"},{"english":"The engine is four- stroke, air-cooled gasoline engine which is started by rebound starter and it can transmit smoothly without energy loss.","chinese":"發動機爲四衝程空冷汽油機，靠反彈式起動器啓動。"},{"english":"After the gasoline engine is started, push the damper strangler to the full open position.","chinese":"汽油機起動後，將阻風門打至全開位置。"},{"english":"This VVT system is suitable for high-speed automot…","chinese":"該系統適合於頂置雙凸輪軸車用高速汽油機。"},{"english":"The engine performance was investigated in a multipoint EFI gasoline engine fueled with gasohol blend.","chinese":"研究了多點電噴汽油機燃用醇汽油混合燃料的性能。"},{"english":"Analyzes the detonation factors and gasbleeding effect of the super-charged gasoline engine.","chinese":"試驗分析了增壓汽油機的致爆因素及放氣效應。"},{"english":"This VVT system is suitable for high-speed automotive gasoline engines with DOHC.","chinese":"該系統適合於頂置雙凸輪軸車用高速汽油機。"},{"english":"Helicopters use gasoline engines.","chinese":"直升機使用汽油機。"},{"english":"Scooter engine muffler exhaust pipes etc series products.","chinese":"汽油機滑板車消聲器排器管等系列產品。"},{"english":"The design for pulsation supercharged air intake system used in high speed vehicle gasoline engine is described.","chinese":"闡述了車用高速汽油機波動增壓進氣系統的設計。"},{"english":"Air-cooled, 2-stroke, single cylinder, gasoline engine.","chinese":"風冷，2衝程，單缸，汽油機。"},{"english":"In this paper, a fractal based knock threshold detection method is presented.","chinese":"提出了一種利用分形幾何檢測汽油機爆震邊緣的方法。"}],"related":[]}