{"definition":["steam turbine"],"pinyin":["qi4 lun2 ji1"],"simplified":["汽轮机"],"rank":36351.0,"normalized_rank":0.5085976522602941,"fraction":5.361758234638769e-7,"cumulative_fraction":0.9948195918148992,"word":"汽輪機","characters":[{"definition":["steam\/vapor"],"pinyin":["qi4"],"word":"汽"},{"definition":["wheel\/disk\/ring\/steamship\/to take turns\/to rotate\/by turn\/classifier for big round objects: disk, or recurring events: round, turn"],"pinyin":["lun2"],"word":"輪"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[],"sentences":[{"english":"The paper studies dynamic characteristic for industrial steam turbine digital electro hydraulic governing system.","chinese":"研究了工業汽輪機數字電液調節系統的動態特性。"},{"english":"Then the steam passes into the turbine.","chinese":"然後蒸氣進入汽輪機。"},{"english":"In Hanwang, there was a saying that it was enviable to be a worker ofDongfang.","chinese":"在漢旺，東方汽輪機廠的工人是很令人羨慕的。"},{"english":"Gradually, Li felt at home with the factory and the life.","chinese":"漸漸地，李萬勝把東方汽輪機廠當成了自己的家。"},{"english":"The paper presents a successful try-out of using the boundary element method for the stress analysis of a steam turbine rotor.","chinese":"採用邊界元法對汽輪機轉子的應力場進行分析。"},{"english":"The designed thinking of a complex CNC surface grinding machine for turbine cylinder is narrated briefly.","chinese":"概述了數控汽輪機缸體表面打磨機的設計思想。"},{"english":"All simulation is divided into individual part such as high-pressure casing and condenser, etc.","chinese":"將飽和蒸汽輪機的仿真研究分爲各個部件的計算。"},{"english":"On a street not far from the steam turbine factory, we could not see any house left intact.","chinese":"距離汽輪機廠不遠處的一條街道無一處完好的房屋。"},{"english":"The high temperature gas and the improvement of steam parameter make the lubricant run under much more severe conditions.","chinese":"汽輪機技術的發展使得汽輪機油的運行環境更加苛刻。"},{"english":"The high temperature gas and the improvement of steam parameter make the lubricant run under much more severe conditions.","chinese":"汽輪機技術的發展使得汽輪機油的運行環境更加苛刻。"},{"english":"A real time model to simulate the main steam system and turbine set is introduced.","chinese":"介紹了一種電站主蒸汽系統與汽輪機組實時仿真模型。"},{"english":"The internal leakage of low-pressure bypass is a common problem in steam turbine.","chinese":"低壓旁路的內漏是汽輪機組系統中普遍存在的問題。"},{"english":"The company is determined to rise above from the ruins once more to success.","chinese":"東方汽輪機公司決心在地震廢墟中站起來。"},{"english":"My whole life has been dedicated to and connected with Dongfang.","chinese":"我的一生都獻給了東方汽輪機廠。"},{"english":"The main characteristics of the overspeed protection system of supercritical steam turbines are analyzed.","chinese":"重點分析超臨界汽輪機的超速保護系統的特點。"},{"english":"He was once an auto-machine room engineer in Shanghai Steam Turbine Company.","chinese":"“他曾任上海汽輪機廠自控室工程師”用英文怎麼說？"}],"related":[]}