{"definition":["steamer (for cooking)"],"pinyin":["qi4 guo1"],"simplified":["汽锅"],"rank":58660.0,"normalized_rank":0.8207295062471143,"fraction":5.08002141479524e-8,"cumulative_fraction":0.9997530042495948,"word":"汽鍋","characters":[{"definition":["steam\/vapor"],"pinyin":["qi4"],"word":"汽"},{"definition":["pot\/pan\/boiler\/CL:口[kou3],隻|只[zhi1]"],"pinyin":["guo1"],"word":"鍋"}],"containing_words":[],"sentences":[{"english":"This is probably the earliest record of a steam boiler explosion.","chinese":"這大概是最早記錄的蒸汽鍋爐發生爆炸。"},{"english":"This is a famous Yunnan dish—steam-pot chicken.","chinese":"這是雲南名菜汽鍋雞。"},{"english":"ABB was the first to provide China with a steam boiler.","chinese":"當時ABB向中國提供了第一臺蒸汽鍋爐。"},{"english":"The technology of instant concret steam boiler shelling is introduced.","chinese":"介紹了蒸汽鍋爐耐火混凝土爐牆現澆成型施工工藝。"},{"english":"Boilermaker course sequences prepare individuals to use technical comprehension and ability to fabricate and repair steam boiler components.","chinese":"鍋爐技師專業培養學生學習蒸汽鍋爐部件製造和修理。"},{"english":"Steam boilers of 40 m height. An elevator near every boiler.","chinese":"40米高的蒸汽鍋爐，每個蒸汽鍋爐旁邊都有升降機。"},{"english":"Steam boilers of 40 m height. An elevator near every boiler.","chinese":"40米高的蒸汽鍋爐，每個蒸汽鍋爐旁邊都有升降機。"},{"english":"The furnace after steam boiler maintenance methods are there?","chinese":"停爐之後的蒸汽鍋爐保養方法有哪些？"},{"english":"Introduces the steam boiler and booster step before the fire have those?","chinese":"介紹蒸汽鍋爐升火前與升壓步驟有那些？"},{"english":"Steam boiler work is controlled by computers.","chinese":"由計算機控制的蒸汽鍋爐。"},{"english":"The famous foods in Kunming are Steampot chicken and Cross-bridge Rice Noodles, would you like to have a try?","chinese":"昆明最有名的食物是汽鍋雞和過橋米線，您想嚐嚐嗎？"},{"english":"Marine steam boiler is an important industrial and civilian and military equipment, It is very extensive.","chinese":"本論文主要是針對船用蒸汽鍋爐保護系統進行的研究。"},{"english":"What are the requirements of the steam boiler used?","chinese":"使用蒸汽鍋爐的要求有哪些？"},{"english":"The characteristics of the furnace compared with the steam boiler, energy-saving about 50 percent.","chinese":"該爐的特點與蒸汽鍋爐相比，節能50%左右。"},{"english":"The method has been applied successfully to the control of a steam boiler heating system.","chinese":"該方法已成功的應用於蒸汽鍋爐加熱功率控制。"}],"related":[]}