{"definition":["Warren (name)"],"pinyin":["Wo4 lun2"],"simplified":["沃伦"],"rank":40886.0,"normalized_rank":0.5720481860282904,"fraction":3.523899912447042e-7,"cumulative_fraction":0.996815488435487,"word":"沃倫","characters":[{"definition":["fertile\/rich\/to irrigate\/to wash (of river)"],"pinyin":["wo4"],"word":"沃"},{"definition":["human relationship\/order\/coherence"],"pinyin":["lun2"],"word":"倫"}],"containing_words":[{"definition":["Warren Buffett (1930-), the Sage of Omaha, US investor and philanthropist, principal owner of holding company Berkshire Hathaway"],"pinyin":["Wo4 lun2 · Ba1 fei1 te4"],"word":"沃倫·巴菲特"},{"definition":["Ken Warren (1927-1991), American adventurer and river runner"],"pinyin":["Ken3 Wo4 lun2"],"word":"肯沃倫"}],"sentences":[{"english":"Warren Buffett has a reputation as a bit of a wordsmith;","chinese":"沃倫巴菲特的口才出衆是出了名的。"},{"english":"Mr Walendowski said he would tell police \"the truth, \" according to the complaint.","chinese":"根據控告書，沃倫鬥斯基先生說他願意告知警察實情。"},{"english":"Warren's eldest son is an art student, at St Martin's.","chinese":"沃倫的大兒子是聖馬丁學院藝術系的學生。"},{"english":"But the Warren affair is only the latest chapter in an ongoing saga.","chinese":"不過，沃倫僅僅是一個未完傳奇中的最後一章。"},{"english":"Warren, who has not publicly commented, has not been charged with any crime.","chinese":"沃倫本人並未發表任何評論，也未被以任何罪名起訴。"},{"english":"In Warren, Mich., Karen Alexander doesn't see a shift in the economy.","chinese":"密歇根州沃倫的卡倫亞歷山大並不認爲經濟出現轉機。"},{"english":"You and Warren?The rest of us are only sidekicks.","chinese":"除了你和沃倫，其它的人都只是助手。"},{"english":"Brandeis and Warren were swimming against the tide of history.","chinese":"布蘭代斯和沃倫曾經是反潮流鬥士。"},{"english":"Valentino later immortalized the dance on film.","chinese":"沃倫丁羅後來在電影裏使這種舞蹈。"},{"english":"I would hate to have a mother like Orenstein.","chinese":"我討厭象沃倫斯坦的媽媽。"},{"english":"Warren Barfield performs live at The Rock Church.","chinese":"沃倫巴菲爾德執行居住在岩石教堂。"},{"english":"And my pal Warren won't be there forever.","chinese":"我的沃倫老哥不會永遠呆在那兒等你。"},{"english":"Guidroz's son Warren Junior also is a fisherman.","chinese":"吉德羅斯的兒子沃倫少年也是一個漁夫。"},{"english":"Mr. Warren will retire from the directorship of the Microsoft soon.","chinese":"沃倫先生很快就要從微軟公司主管職位上退下來。"},{"english":"Warren is an aspiring author as well as a spy.","chinese":"沃倫除了做間諜，還是個充滿抱負的作家。"}],"related":[]}