{"definition":["alluvial deposit"],"pinyin":["chong1 ji1 ceng2"],"simplified":["冲积层"],"rank":66139.0,"normalized_rank":0.9253704195990096,"fraction":1.1970165402678438e-8,"cumulative_fraction":0.9999693787111392,"word":"沖積層","characters":[{"definition":["(of water) to dash against\/to mix with water\/to infuse\/to rinse\/to flush\/to develop (a film)\/to rise in the air\/to clash\/to collide with"],"pinyin":["chong1"],"word":"沖"},{"definition":["to amass\/to accumulate\/to store\/measured quantity (such as area of volume)\/product (the result of multiplication)\/to integrate (math.)\/to solve (or integrate) an ordinary differential equation (math.)\/old\/long-standing"],"pinyin":["ji1"],"word":"積"},{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"層"}],"containing_words":[],"sentences":[{"english":"The mine shaft sinking with a mine shaft drilling is a reliable mine shaft construction method to pass through a deep and thick alluvium.","chinese":"鑽井法鑿井是通過深厚沖積層最可靠的豎井施工方法。"},{"english":"The security of freezing wall is the key problem of freezing shaft sinking in deep alluvium.","chinese":"凍結壁的安全性是深厚沖積層中凍結鑿井的關鍵問題。"},{"english":"Study on the thickness of frozen wall in deep alluvium;","chinese":"凍結壁的安全性是深厚沖積層中凍結鑿井的關鍵問題。"},{"english":"Three kinds of different coal seams be found under the huge and thick water contained alluvium in a certain mine.","chinese":"在某礦巨厚含水沖積層下，有三種不同產狀的煤層。"},{"english":"The upper part of the main river alluvium in modern times, the lower the pour-shaped alluvium.","chinese":"上部主要是近代河流沖積層，下部爲傾狀沖積層。"},{"english":"The upper part of the main river alluvium in modern times, the lower the pour-shaped alluvium.","chinese":"上部主要是近代河流沖積層，下部爲傾狀沖積層。"},{"english":"Of or relating to alluvium .","chinese":"屬於或關於沖積層的。"},{"english":"This saphire deposit is occurred in the Holocene alluvium.","chinese":"礦牀賦存於全新統沖積層。"}],"related":[]}