{"definition":["to erode\/erosion"],"pinyin":["chong1 shi2"],"simplified":["冲蚀"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"沖蝕","characters":[{"definition":["(of water) to dash against\/to mix with water\/to infuse\/to rinse\/to flush\/to develop (a film)\/to rise in the air\/to clash\/to collide with"],"pinyin":["chong1"],"word":"沖"},{"definition":["to nibble away at sth\/to eat into\/to erode"],"pinyin":["shi2"],"word":"蝕"}],"containing_words":[],"sentences":[{"english":"The bed of a river is partly worn away by corrosive action.","chinese":"河牀部分地就是被這種侵蝕作用沖蝕的。"},{"english":"The erosion resistance of HVOF-sprayed is enhanced with the temperature increasing.","chinese":"溫度升高，塗層的抗沖蝕性能提高。"},{"english":"Long durability thanks to washing and corrosion resistant alloy sphere valve core and stainless valve seat.","chinese":"合金球面閥芯與不鏽鋼閥座耐沖蝕，使用壽命長。"},{"english":"Nonerodible clods are also broken down by impacts of saltating grains.","chinese":"不可沖蝕的土塊因跳躍顆粒的撞擊也會破碎。"},{"english":"Erodible soil fractions are usually dislodged from projections and trapped in depression.","chinese":"可沖蝕土壤部分經常從凸出物剝蝕並降落於窪地。"},{"english":"The effect of impingement angle on the erosion resistance is great.","chinese":"沖蝕角對塗層抗沖蝕性能有較大影響。"},{"english":"The effect of impingement angle on the erosion resistance is great.","chinese":"沖蝕角對塗層抗沖蝕性能有較大影響。"},{"english":"Yes, how many years can a mountain exist Before it's washed to the sea ?","chinese":"一座高山能聳立多少年，直到被沖蝕到海洋？"},{"english":"At the same time, using a new type surface wear resistant coatings, the anti-erosion ability of drill bit is strengthened.","chinese":"同時採用新型表面防磨塗層，加強了鑽頭抗沖蝕能力。"},{"english":"The relation between the flow conditions and material surface abrasive erosion of the pump impeller has been studied.","chinese":"研究了過流條件與泵輪葉片表面沖蝕磨損的關係。"},{"english":"The running water eroded a gully.","chinese":"流水沖蝕出一條溝渠。"},{"english":"The government has made attempts to reduce soil erosion.","chinese":"政府已經作出努力來減少土壤沖蝕。"},{"english":"Scientists claim that they will soon be able to create the washout conditions.","chinese":"科學家們聲稱，他們很快就能創建沖蝕條件。"},{"english":"The valve seat receives the protection of the spheroid all the time, avoid the eroding of the fluid.","chinese":"閥座始終受到球體的保護，避免了流體的沖蝕。"},{"english":"Erosion may also occur in gas streams, again assuming the presence of sand particles.","chinese":"沖蝕同樣可能發生在氣流中，同樣要求有一定的沙粒。"},{"english":"The model of the erosion mechanism is advanced on the basis of the above mentioned erosion behaviour.","chinese":"在此基礎上提出了封嚴塗層的沖蝕磨損模型。"}],"related":[]}