{"definition":["to treat the symptoms but not the root cause"],"pinyin":["zhi4 biao1 bu4 zhi4 ben3"],"simplified":["治标不治本"],"rank":32580.0,"normalized_rank":0.4558364697158368,"fraction":7.490112034285739e-7,"cumulative_fraction":0.992415211986148,"word":"治標不治本","characters":[{"definition":["to rule\/to govern\/to manage\/to control\/to harness (a river)\/to treat (a disease)\/to wipe out (a pest)\/to punish\/to research"],"pinyin":["zhi4"],"word":"治"},{"definition":["mark\/sign\/label\/to mark with a symbol, label, lettering etc\/to bear (a brand name, registration number etc)\/prize\/award\/bid\/target\/quota\/(old) the topmost branches of a tree\/visible symptom\/classifier for military units"],"pinyin":["biao1"],"word":"標"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to rule\/to govern\/to manage\/to control\/to harness (a river)\/to treat (a disease)\/to wipe out (a pest)\/to punish\/to research"],"pinyin":["zhi4"],"word":"治"},{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"}],"containing_words":[],"sentences":[{"english":"But such bond-buying is a temporary palliative.","chinese":"但這種債券買法治標不治本。"},{"english":"Scotch tape may solve the problem temporarily, but it cannot take the problem away.","chinese":"膠紙或許能暫時地解決問題，但是它治標不治本。"},{"english":"A bailout will not address the fundamental causes of Greece's fiscal problems.","chinese":"金援對於希臘的財政問題來說只是治標不治本。"},{"english":"“Caring is good, but it treats the symptoms without addressing the root cause of the problem,” says Ye Jingzhong.","chinese":"葉精忠說，“關愛是好的，但這治標不治本。”"},{"english":"“Caring is good, but it treats the symptoms without addressing the root cause of the problem, ” says Ye Jingzhong.","chinese":"葉精忠說，“關愛是好的，但這治標不治本。”"},{"english":"Such actions are palliatives.","chinese":"這樣的行動是治標不治本的。"},{"english":"However, these ways could not deal with the true problem.","chinese":"這些解決辦法治標不治本，沒有抓住問題的實質。"},{"english":"But critics say the circular only \"scratches the surface of a problem\".","chinese":"但是評論家們認爲該項通知“治標不治本”。"}],"related":[]}