{"definition":["gate to enlightment (Buddhism)\/Buddhism\/way\/method\/(old) south gate of a palace"],"pinyin":["fa3 men2"],"simplified":["法门"],"rank":44685.0,"normalized_rank":0.625201124900312,"fraction":2.461182788892177e-7,"cumulative_fraction":0.9979434158086478,"word":"法門","characters":[{"definition":["France\/French\/abbr. for 法國|法国[Fa3 guo2]\/Taiwan pr. [Fa4]","law\/method\/way\/to emulate\/(Buddhism) dharma\/(abbr. for 法家[Fa3 jia1]) the Legalists\/(physics) farad (abbr. for 法拉[fa3 la1])"],"pinyin":["Fa3","fa3"],"word":"法"},{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["Men2","men2"],"word":"門"}],"containing_words":[{"definition":["the one and only way\/the only proper course to take"],"pinyin":["bu4 er4 fa3 men2"],"word":"不二法門"}],"sentences":[{"english":"A monetary rule is a requisite for restoring the Fed’s independence.","chinese":"貨幣規則是重建美聯儲獨立性的不二法門。"},{"english":"Magic cannot go in playing.","chinese":"魔法門進不去遊戲。"},{"english":"He also thanked China for sending the Buddha Finger Sarira of Famen Temple in Shanxi for enshrinement in the ROK.","chinese":"他還對陝西法門寺佛指舍利來韓供奉表示感謝。"},{"english":"In contrast, during the Famennian the radiolarian fauna was well developed and diversified.","chinese":"相反，放射蟲動物羣在法門期得到了重大發展。"},{"english":"The first rule in winning is to participate!","chinese":"參與是獲得勝利的不二法門。"},{"english":"I was taught by my master that the core of this path is remembering the guru.","chinese":"我的上師教導我，這個法門的核心就在於憶念上師。"},{"english":"Images are agood way to catch a visitors attention.","chinese":"圖像歷來是吸引眼球的不二法門。"},{"english":"Take in fewer calories than you burn, and you lose weight.","chinese":"喫得比你消耗的少，是減肥的不二法門。"},{"english":"Some scholars believe that the whole of basement was rendered as a mandala.","chinese":"有人認爲法門寺地宮構成一個完整的蔓荼羅。"},{"english":"If you cannot be that way, then you aren't really cultivating the Shurangama Dharma-door.","chinese":"不能這樣，就談不到真正修楞嚴法門。"},{"english":"The Famen Temple, Qian Mausoleum, The Tomb of Princess Yongtai 1- Day Private Tour.","chinese":"法門寺，乾陵，永泰公主墓，觀光獨立成團一日遊。"},{"english":"Because innumerable billions of Bodhisattvas also seek this wonderful and subtle Dharma School.","chinese":"彼無量億諸菩薩等，皆悉求此微妙法門。"},{"english":"The Lord has surely abandoned suffering as this Dhamma has been realized by him.","chinese":"世尊確實擺脫了痛苦，因爲你知道這個法門。"},{"english":"In short, patience is the most important of all methods of cultivation, and cannot be ignored or overlooked.","chinese":"淺言之，忍耐是修行法門最主要的，不可忽略。"},{"english":"Receiving the heart of brahma net sutra in jizulutos mountain .","chinese":"雞足蓮花山金剛塔座受持梵網經菩薩心地法門品。"},{"english":"The man is the only proper course to take, should never let him meet.","chinese":"抓住男人的不二法門，應該就是，永遠不要讓他滿足。"}],"related":[{"definition":["to become enlightened (Buddhism)"],"pinyin":["kai1 wu4"],"word":"開悟"},{"definition":["origin"],"pinyin":["yuan2 qi3"],"word":"緣起"},{"definition":["all living things"],"pinyin":["zhong4 sheng1"],"word":"眾生"},{"definition":["tathagata (Buddha's name for himself, having many layers of meaning - Sanskrit: thus gone, having been Brahman, gone to the absolute etc)"],"pinyin":["ru2 lai2"],"word":"如來"},{"definition":["to instruct (novices)\/to preach\/to teach\/to reveal"],"pinyin":["kai1 shi4"],"word":"開示"},{"definition":["Taoist or Buddhist rite\/abbr. for 菩提道場|菩提道场[Pu2 ti2 dao4 chang3]"],"pinyin":["dao4 chang3"],"word":"道場"},{"definition":["to vow"],"pinyin":["fa1 yuan4"],"word":"發願"},{"definition":["actual situation\/the ultimate essence of things (Buddhism)"],"pinyin":["shi2 xiang4"],"word":"實相"},{"definition":["(of Taoists) to practice austerities\/to practice asceticism"],"pinyin":["xiu1 lian4"],"word":"修煉"},{"definition":["a flash of realization\/the truth in a flash\/a moment of enlightenment (usually Buddhist)"],"pinyin":["dun4 wu4"],"word":"頓悟"},{"definition":["Zen Buddhism"],"pinyin":["Chan2 zong1"],"word":"禪宗"},{"definition":["to study\/to practice"],"pinyin":["xiu1 xi2"],"word":"修習"},{"definition":["Buddhism"],"pinyin":["Fo2 men2"],"word":"佛門"},{"definition":["karmic reward (Buddhism)"],"pinyin":["fu2 bao4"],"word":"福報"},{"definition":["Bodhisattva (Buddhism)"],"pinyin":["Pu2 sa4"],"word":"菩薩"},{"definition":["(of a deity) to take a material shape\/to appear"],"pinyin":["shi4 xian4"],"word":"示現"}]}