{"definition":["to appear\/to emerge\/to surface"],"pinyin":["fan4 qi3"],"simplified":["泛起"],"rank":24635.0,"normalized_rank":0.34467561176947936,"fraction":0.000001530137484766773,"cumulative_fraction":0.983741448977132,"word":"泛起","characters":[{"definition":["to float\/to be suffused with\/general\/extensive\/non-specific\/flood\/pan- (prefix)"],"pinyin":["fan4"],"word":"泛"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"The coco-cola frothed as it was poured out.","chinese":"可口可樂倒出來時泛起泡沫。"},{"english":"The beer frothed as it was poured out.","chinese":"啤酒倒出來時泛起泡沫。"},{"english":"Said the captain; his mood had changed again and the mirthless smile was back on his lips.","chinese":"他的情緒又變了，脣間又一次泛起了那陰沉的微笑。"},{"english":"The sea water foams under the bow.","chinese":"海水在船首下面泛起浪花。"},{"english":"The setting sun in dusk, rays and shoulders thrown in slightly fold.","chinese":"夕陽依着黃昏，霞光撒在肩頭泛起的微微褶皺。"},{"english":"A slight flush suffused her pale face, and she looked down, speaking to her hands.","chinese":"她蒼白的臉頰上泛起一抹紅暈，低下頭看着自己的手。"},{"english":"Clean and brilliant, deep plum red colour, with purple hues.","chinese":"酒液清澈明亮，深邃的梅紅色中泛起紫色光澤。"},{"english":"The tang of Scotch , sweat and gun-metal rose from his pages.","chinese":"他的書頁中泛起蘇格蘭的，汗水和炮銅的濃烈氣息。"},{"english":"The term \"whitewater\" refers to the appearance of the frothy water found in rapids.","chinese":"“白浪”這個詞指的是急流泛起水沫的樣子。"},{"english":"The light of setting sun projects on the surface and start to be suffused with one in multiple layers thin ground gold color wave.","chinese":"夕陽的光投射在水面上，泛起一層層細碎的金色波浪。"},{"english":"Heart Lake, the little silver waves thrown up, difficult to calm.","chinese":"心湖中，點點銀波泛起，難以平靜。"},{"english":"Perfume from battle-fields rising, up from the foetor arising.","chinese":"醇香飄自這戰場，惡臭泛起沿着河上。"},{"english":"At this time, Wang Yaner eyes tears.","chinese":"此時的王燕兒眼睛裏也泛起淚光。"},{"english":"It would appear that Beatrice understood him. There came a deep flush to her cheek;","chinese":"比阿特麗絲顯然明白他言下之意，臉上泛起一股紅潮。"},{"english":"In the lonely lane there is no passer-by, the wind is up, the ripples are rampant in the river.","chinese":"孤寂的小路上空無一人，起風了，河裏泛起陣陣漣漪。"},{"english":"A crimson flush was glowing on her cheek, that had been long so pale.","chinese":"長期以來十分蒼白的面頰也泛起紅潮。"}],"related":[{"definition":["to float\/to emerge"],"pinyin":["fu2 qi3"],"word":"浮起"},{"definition":["to well up\/to boil out\/to bubble forth\/to spurt"],"pinyin":["yong3 qi3"],"word":"湧起"},{"definition":["to ripple\/to undulate\/also written 蕩漾|荡漾"],"pinyin":["dang4 yang4"],"word":"盪漾"},{"definition":["to float up\/to rise to the surface\/fig. to rise in the world"],"pinyin":["fu2 shang4"],"word":"浮上"},{"definition":["to flash through (one's mind)\/to dodge (away from pursuers)"],"pinyin":["shan3 guo4"],"word":"閃過"},{"definition":["to emerge"],"pinyin":["fu2 chu1"],"word":"浮出"},{"definition":["to flit across\/to sweep past\/to glance (strike at an angle)"],"pinyin":["lu:e4 guo4"],"word":"掠過"},{"definition":["ripple"],"pinyin":["lian2 yi1"],"word":"漣漪"},{"definition":["to appear before one's eyes\/to come into view\/to float into appearance\/to come back (of images from the past)\/to emerge\/it emerges\/it occurs (to me that..)"],"pinyin":["fu2 xian4"],"word":"浮現"},{"definition":["to raise\/to hoist\/to rise"],"pinyin":["sheng1 qi3"],"word":"升起"},{"definition":["to flicker or flash"],"pinyin":["shan3 dong4"],"word":"閃動"},{"definition":["(of a meteor etc) to streak across (the sky)\/(of a searchlight, lightning etc) to play across (the sky)"],"pinyin":["hua2 guo4"],"word":"劃過"},{"definition":["indistinct\/faintly discernible"],"pinyin":["ruo4 you3 ruo4 wu2"],"word":"若有若無"},{"definition":["to raise one's head\/to perk up"],"pinyin":["yang2 qi3"],"word":"揚起"},{"definition":["afloat"],"pinyin":["fu2 zhe5"],"word":"浮著"},{"definition":["eyes"],"pinyin":["yan3 mou2"],"word":"眼眸"}]}