{"definition":["extensive reading"],"pinyin":["fan4 du2"],"simplified":["泛读"],"rank":56321.0,"normalized_rank":0.7880038615980859,"fraction":6.963132801314166e-8,"cumulative_fraction":0.9996130064502472,"word":"泛讀","characters":[{"definition":["to float\/to be suffused with\/general\/extensive\/non-specific\/flood\/pan- (prefix)"],"pinyin":["fan4"],"word":"泛"},{"definition":["comma\/phrase marked by pause","to read\/to study\/reading of word (i.e. pronunciation), similar to 拼音[pin1 yin1]"],"pinyin":["dou4","du2"],"word":"讀"}],"containing_words":[],"sentences":[{"english":"However, some people will meet with the problem of whether they should read selectively or extensively.","chinese":"然而，有些人會碰到應該選讀還是泛讀的問題。"},{"english":"We need to do some extensive reading.","chinese":"我們需要一些泛讀練習。"},{"english":"His eyeglasses magnify phrases so he can read them.","chinese":"他藉助眼睛把字放大以便能夠泛讀。"},{"english":"Some hold that we should read extensively for getting more knowledge.","chinese":"一些人認爲我們應該泛讀，以此來獲得更多的知識。"},{"english":"It may be slower, but it forces you to learn instead of just skim.","chinese":"這會變慢，但它迫使你把掌握代替泛讀。"},{"english":"These articles need extensive reading.","chinese":"這些文章只須泛讀一下。"},{"english":"The learners can develop their language knowledge through extensive reading.","chinese":"學習者能夠通過泛讀開發他們的語言知識。"},{"english":"His eyeglasses magnify phrases so he can easyst you.","chinese":"他藉助眼睛把字放大以便能夠泛讀。"},{"english":"Both intensive reading and extensive reading are needed in learning English.","chinese":"精讀與泛讀在英語學習中都不能少。"},{"english":"Reform the classroom teaching structure, make intensive reading with be suffused with to read to combine together.","chinese":"改革課堂教學結構，使精讀與泛讀相結合。"},{"english":"All in all, extensive reading takes extremely significant effect in language learning.","chinese":"總之，泛讀在語言學習中有着非常顯著的影響。"},{"english":"In English study, intensive reading must be combined with extensive reading.","chinese":"在英語學習中，精讀必須與泛讀結合起來。"},{"english":"First of all, reading extensively can enrich us more.","chinese":"首先，泛讀能讓我們獲得更多的知識。"},{"english":"He selected an extensive reading course this term.","chinese":"這個學期他選修了泛讀課程。"},{"english":"It has been decided that more time be alloted for extensive reading.","chinese":"已經決定讓出更多的時間用於泛讀。"}],"related":[]}