{"definition":["to pour into\/to empty into"],"pinyin":["zhu4 ru4"],"simplified":["注入"],"rank":4291.0,"normalized_rank":0.06003665719922208,"fraction":0.000030284664446403307,"cumulative_fraction":0.8398740104589624,"word":"注入","characters":[{"definition":["to inject\/to pour into\/to concentrate\/to pay attention\/stake (gambling)\/classifier for sums of money\/variant of 註|注[zhu4]"],"pinyin":["zhu4"],"word":"注"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"}],"containing_words":[{"definition":["intravenous (medicine)"],"pinyin":["jing4 mai4 zhu4 ru4"],"word":"靜脈注入"}],"sentences":[{"english":"D. Hold tubing until fluid is instilled .","chinese":"握住肛管直至液體全部注入。"},{"english":"Astrologers think of the water-bearer as pouring life-enhancing energy into the ether.","chinese":"占星學家認爲這個水瓶，是將生命的能量注入靈性。"},{"english":"Has been infused into an ink bottle.","chinese":"已經注入墨水瓶。"},{"english":"The financial impact of treating obesity and obesity-related disease is substantial.","chinese":"注入肥胖症的財務衝擊和與肥胖有關的疾病是可觀的。"},{"english":"Such a young and capable man as him will put new life into our work.","chinese":"像他這樣年輕有爲的人會給我們的工作注入新生機。"},{"english":"The Anfield boss believes the trio's return will keep everyone in his squad on their toes.","chinese":"貝帥相信三員大將的迴歸將給全隊注入一針強心劑。"},{"english":"Shake and strain into a rocks glass, add 7up, stir.","chinese":"加冰搖合原料濾入冰過的玻璃杯，注入七喜，攪合。"},{"english":"Objective To study the acute effects of talc instillation intrapleurally.","chinese":"研究胸腔內注入滑石粉漿的急性反應。"},{"english":"The profiled blocks attached to the drive chains of a coiled tubing injector head.","chinese":"固定在撓性管注入頭的傳動鏈上的定型塊。"},{"english":"the eggs are collected before they divide and are injected with the foreign genetic material.","chinese":"將這些卵收集起來，在其卵裂前注入外來基因物質。"},{"english":"They also have a pending patent on part of the injection process they are developing.","chinese":"他們還擁有正在開發尚待批准的注入過程部分專利。"},{"english":"Workers have been pumping sea water into reactors in an effort to prevent further damage.","chinese":"工人盡力給反應器注入海水以避免進一步的損失。"},{"english":"Fresh capital will help China Railway to build new capacity.","chinese":"而新注入的資本將會幫助中鐵提高運輸能力。"},{"english":"Shake recipe with ice, strain over ice and top with Champagne.","chinese":"加冰搖合原料，濾入冰塊，注入適量香檳。"},{"english":"A team with a never say die attitude.","chinese":"球隊被注入一種永不言敗的精神。"},{"english":"Shall I put some anti- freeze in the radiator?","chinese":"要不要在散熱器裏注入一些防凍劑？"}],"related":[{"definition":["to blend into\/to integrate\/to assimilate\/to merge"],"pinyin":["rong2 ru4"],"word":"融入"},{"definition":["to pour into\/perfusion (med.)\/to concentrate one's attention on\/to teach\/to inculcate\/to instill"],"pinyin":["guan4 zhu4"],"word":"灌注"},{"definition":["to flow\/to circulate\/to go from place to place\/to be mobile\/(of assets) liquid"],"pinyin":["liu2 dong4"],"word":"流動"},{"definition":["a mixture\/an amalgam\/fusion\/welding together\/to be in harmony with (nature)\/to harmonize with\/to fit in"],"pinyin":["rong2 he2"],"word":"融合"},{"definition":["(lit. and fig.) to permeate\/to seep into\/(of a product, idea etc) to penetrate (in a population)\/(of hostile forces) to infiltrate\/(chemistry) osmosis"],"pinyin":["shen4 tou4"],"word":"滲透"},{"definition":["to take in\/to absorb\/to admit\/to accept"],"pinyin":["xi1 na4"],"word":"吸納"},{"definition":["to permeate"],"pinyin":["shen4 ru4"],"word":"滲入"},{"definition":["to come pouring in\/influx"],"pinyin":["yong3 ru4"],"word":"湧入"},{"definition":["to draw\/to derive\/to absorb"],"pinyin":["ji2 qu3"],"word":"汲取"},{"definition":["to insert\/to implant\/to embed\/to introduce (a new element) into"],"pinyin":["zhi4 ru4"],"word":"置入"},{"definition":["energy\/vitality\/vigor\/vital force"],"pinyin":["huo2 li4"],"word":"活力"},{"definition":["to absorb\/to assimilate\/to ingest\/to recruit"],"pinyin":["xi1 shou1"],"word":"吸收"},{"definition":["to overflow\/to spill over\/(computing) overflow"],"pinyin":["yi4 chu1"],"word":"溢出"},{"definition":["to activate"],"pinyin":["ji1 huo2"],"word":"激活"},{"definition":["to arouse\/to excite"],"pinyin":["ji1 fa1"],"word":"激發"},{"definition":["to draw into\/to pull into\/to introduce"],"pinyin":["yin3 ru4"],"word":"引入"}]}