{"definition":["Tylo (name)\/Hollywood actress Hunter Tylo"],"pinyin":["Tai4 luo2"],"simplified":["泰罗"],"rank":40826.0,"normalized_rank":0.5712087081835099,"fraction":3.5399574514018553e-7,"cumulative_fraction":0.9967942983231712,"word":"泰羅","characters":[{"definition":["Mt Tai 泰山[Tai4 Shan1] in Shandong\/abbr. for Thailand","safe\/peaceful\/most\/grand"],"pinyin":["Tai4","tai4"],"word":"泰"},{"definition":["gauze\/to collect\/to gather\/to catch\/to sift","surname Luo"],"pinyin":["Luo2","luo2"],"word":"羅"}],"containing_words":[{"definition":["Catalonia"],"pinyin":["Jia1 tai4 luo2 ni2 ya4"],"word":"加泰羅尼亞"}],"sentences":[{"english":"The Principles of Scientific Management by Frederick Winslow Taylor has been considered the origin of modem management thoughts.","chinese":"泰羅的科學管理原理被認爲是現代管理思想的起源。"},{"english":"However, Real Madrid are a great club as well, as they wear white like Santos - but Catalunya and Barcelona have a place in my heart.","chinese":"然而我的心中永遠有加泰羅尼亞和巴塞羅那的位置。"},{"english":"What does Tyrol do during Baltar's speech?","chinese":"在波爾塔演講期間，泰羅爾做了什麼？"},{"english":"They are only found in one of three lakes in Terokkar forest.","chinese":"狂暴龍蝦只有在泰羅卡森林的三個湖裏可以釣到。"},{"english":"Mr. Bellès, who is Catalan, lives in Cadaqués all year long.","chinese":"貝勒先生是加泰羅尼亞人，並長年居住在卡得奎。"},{"english":"Ferrari drivers Felipe Massa and Kimi Raikkonen were the fastest drivers at Circuit de Catalunya today.","chinese":"法拉利馬薩和萊克寧是加泰羅尼亞第二天的最快車手。"},{"english":"Barça has taken the role of Catalunya's national team.","chinese":"巴薩充當了加泰羅尼亞國家隊的角色。"},{"english":"On Catalonian cars you will easily discover signs of the Catalonian Donkey.","chinese":"在加泰羅尼亞汽車上，不難發現這樣的標誌。"},{"english":"Name the stealth ship that Tyrol and Cally built.","chinese":"泰羅爾和凱莉造的那個隱形飛船叫什麼？"},{"english":"Amaia after breaking up with Rafa, fells in love with a Catalonian.","chinese":"Amaia了拉法打破後，愛上了一個加泰羅尼亞。"}],"related":[]}