{"definition":["bathroom\/restroom\/shower room\/CL:間|间[jian1]"],"pinyin":["xi3 zao3 jian1"],"simplified":["洗澡间"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"洗澡間","characters":[{"definition":["to wash\/to bathe\/to develop (photo)"],"pinyin":["xi3"],"word":"洗"},{"definition":["bath"],"pinyin":["zao3"],"word":"澡"},{"definition":["between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms","gap\/to separate\/to thin out (seedlings)\/to sow discontent"],"pinyin":["jian1","jian4"],"word":"間"}],"containing_words":[],"sentences":[{"english":"The three of us stood in the bathroom eagerly waiting for the telltale line to appear.","chinese":"我們三個一起站在洗澡間殷切等待儀器指示線的出現。"},{"english":"Each bedroom in the hotel has a bathroom en suite.","chinese":"該旅館每間臥室都有一洗澡間自成一套。"},{"english":"I have to share the bathroom with the other farants.","chinese":"我得和別的房客共用洗澡間。"},{"english":"This house had no bath so we had one built.","chinese":"這間房子原無洗澡間，我們補建了一個。"},{"english":"I have to share the bathroom with the other tenants.","chinese":"我得和別的房客共用洗澡間。"},{"english":"Leave the laundry in the laundry bag behind the door of the bathroom.","chinese":"把待洗的衣旅敢呑洗澡間門後的洗衣袋裏就行了。"},{"english":"Moreover, each unit comes up with a latrine and bathroom.","chinese":"每個避難單元配有廁所和洗澡間。"},{"english":"What are you doing in my bathroom?","chinese":"你在我的洗澡間裏幹什麼？"},{"english":"Bythe time she got up, her brother had already gone into the bathroom.","chinese":"到她起牀的時候，她的弟弟已經去洗澡間了。"},{"english":"Designed for people who come up with great ideas in the shower.","chinese":"專爲那些能在洗澡間想出好主意的人士設計。"},{"english":"For a bathroom I have two thermos bottles of water and an enameled bowl.","chinese":"洗澡間裏的兩個熱水瓶和一個搪瓷盆是用來洗澡的。"},{"english":"He doesn't like the house without bathroom.","chinese":"他不喜歡沒有洗澡間的房子。"},{"english":"There's a bag in the bathroom. Just put your laundry in it.","chinese":"在洗澡間裏有個袋子，把要洗的衣服放在裏面就行了。"},{"english":"I slept in small family hotels recommended by locals, invariably a room with a bath.","chinese":"我住在本地人介紹的小旅館裏，房間總是帶有洗澡間。"},{"english":"He looked in the bathroom to make sure that he was alone.","chinese":"他看了看洗澡間，確定是否只有他一個人。"},{"english":"B. The bathroom and the kitchen are well-furnished.","chinese":"洗澡間和廚房都很好。"}],"related":[]}