{"definition":["reagent (chemistry)"],"pinyin":["huo2 xing4 ji4"],"simplified":["活性剂"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"活性劑","characters":[{"definition":["to live\/alive\/living\/work\/workmanship"],"pinyin":["huo2"],"word":"活"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"},{"definition":["dose (medicine)"],"pinyin":["ji4"],"word":"劑"}],"containing_words":[{"definition":["surfactant"],"pinyin":["biao3 mian4 huo2 xing4 ji4"],"word":"表面活性劑"}],"sentences":[{"english":"The solubility increase is not obvious with nonionic surfactants added.","chinese":"它與非離子表面活性劑復配增溶效果不明顯。"},{"english":"The new system is made of single amphoteric surfactant and clay stabilizer.","chinese":"該體系由單一兩性表面活性劑和黏土穩定劑組成。"},{"english":"On the contrary, for the anionic surfactant an opposite effect was observed.","chinese":"相反，對陰離子活性劑觀察到相反的效應。"},{"english":"Lurgiuses has used undisclosed promoter and corrosion inhibitor .","chinese":"魯奈公司採用了未公開的活性劑和防蝕劑。"},{"english":"The adding of surfactant in emulsion improved the encapsulation of protein in PLAPEG microspheres.","chinese":"適當加入表面活性劑可改善微球對蛋白的包接性能。"},{"english":"The effects of surfactant (SDS) concentrations were also investigated.","chinese":"觀察了表面活性劑SDS濃度的影響。"},{"english":"Objective introduce the development of Non-ionic surfactant based vesicles.","chinese":"目的介紹非離子表面活性劑囊泡的研究進展。"},{"english":"At the present time there is an increasing interest in the use of biosurfactants.","chinese":"現在人們對生物表面活性劑越來越感興趣。"},{"english":"To develop affordable surfactants and oil displacement systems is the key.","chinese":"研製出經濟實惠的表面活性劑和驅油體系是關鍵。"},{"english":"The results showed that the resistance factor of FPJ surfactant achieved 17.","chinese":"結果表明，表面活性劑FPJ的阻力因子達到17。"},{"english":"Multifunctiona synergist MAT is a king of anionic surfactant.","chinese":"多功能增效劑MAT屬陰離子表面活性劑。"},{"english":"The research of borate ester surfactants is still in the initial stage.","chinese":"硼酸酯表面活性劑在國內外的研究都還處於起始階段。"},{"english":"The micelles'solubilizing technology was one of the important effects of surfactants.","chinese":"膠束增溶技術是表面活性劑的一個重要作用。"},{"english":"The outlook of development in applications of biosurfactants was prospected.","chinese":"最後展望了生物表面活性劑的應用前景。"},{"english":"The graft hydrophilic polymer could effectively prevent surfactant from adsorbing on the surface of micelles.","chinese":"微膠束在接枝前，被表面活性劑吸附甚至形成包圍。"},{"english":"Further control is obtained through the choice of surfactant and its ability to form micelles of various sizes.","chinese":"選擇不同的表面活性劑，會形成不同大小的膠團。"}],"related":[]}