{"definition":["local police station"],"pinyin":["pai4 chu1 suo3"],"simplified":["派出所"],"rank":2248.0,"normalized_rank":0.031452436584444465,"fraction":0.00006660564974117436,"cumulative_fraction":0.7482017113586932,"word":"派出所","characters":[{"definition":["clique\/school\/group\/faction\/to dispatch\/to send\/to assign\/to appoint\/pi (Greek letter Ππ)\/the circular ratio pi = 3.1415926\/(loanword) pie"],"pinyin":["pai4"],"word":"派"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["actually\/place\/classifier for houses, small buildings, institutions etc\/that which\/particle introducing a relative clause or passive\/CL:個|个[ge4]"],"pinyin":["suo3"],"word":"所"}],"containing_words":[],"sentences":[{"english":"New era brings forward new requirements for local police directors.","chinese":"新時期對公安派出所所長提出新的要求。"},{"english":"The round-visiting village police system is a model of police tasks in the practice of reform of the countryside local police station.","chinese":"巡訪村警制是農村派出所改革實踐中的一種警務模式。"},{"english":"Which local police station do there is in Anhui Province Tai He County?","chinese":"安徽省太和縣有哪些派出所？"},{"english":"Qinghe police stations in the area, the police quickly found Liu.","chinese":"在清河派出所轄區，民警很快就找到了劉文。"},{"english":"Sent to the police station, yue-hua zhang fair business deal with the problem.","chinese":"送到派出所，張躍華公允辦事處理了問題。"},{"english":"The thief was seized and turned over to a police station.","chinese":"小偷被扭送到派出所了。"},{"english":"Yue Square police station after police Jiejing, immediately rushed to the scene promptly control the situation.","chinese":"嶽坊派出所民警接警後，立即趕到現場及時控制事態。"},{"english":"The enforcement of the ruling shall be assisted by his work unit and the local police station.","chinese":"單位和常住地公安派出所應當協助執行裁決。"},{"english":"The local police station a rapid, in the tea house will present a two-person arrested.","chinese":"當地派出所迅速出警，在茶館內將二人抓了個現行。"},{"english":"Ned must have found a police officer.","chinese":"內德一定是找到了個派出所，她想道。"},{"english":"After obtaining evidence, the reporter called Hanzhong Gate police station alarm call.","chinese":"取得證據後，記者撥通了漢中門派出所的報警電話。"},{"english":"The buildings of police substations were, although small, the most powerful instrument of the power activated under this system.","chinese":"派出所規模雖小，卻爲其制度下權力運作之利器。"},{"english":"The battlement closes police post people Jing quickly arrive to site the development investigate.","chinese":"城關派出所民警迅速趕到現場開展調查。"},{"english":"Have you reported it to the police?","chinese":"你有去派出所報失？"},{"english":"Mr. Tian angrily warning, but police let the two sides through consultation.","chinese":"田先生憤而報警，但派出所讓雙方協商解決。"},{"english":"The case has been under investigation by the police in Hongshan, Changsha so far.","chinese":"目前，長沙洪山橋派出所接到報案後已經介入調查。"}],"related":[{"definition":["sub-bureau"],"pinyin":["fen1 ju2"],"word":"分局"},{"definition":["public security bureau (government office similar in function to a police station)"],"pinyin":["gong1 an1 ju2"],"word":"公安局"},{"definition":["civil police\/PRC police\/abbr. for 人民警察"],"pinyin":["min2 jing3"],"word":"民警"},{"definition":["to dispatch police to the scene of crime, accident etc"],"pinyin":["chu1 jing3"],"word":"出警"},{"definition":["to report a case to the authorities"],"pinyin":["bao4 an4"],"word":"報案"},{"definition":["(of police, fire brigade etc) to receive a report of an incident"],"pinyin":["jie1 jing3"],"word":"接警"},{"definition":["to sound an alarm\/to report sth to the police"],"pinyin":["bao4 jing3"],"word":"報警"},{"definition":["(Ministry of) Public Security\/public safety\/public security"],"pinyin":["gong1 an1"],"word":"公安"},{"definition":["police"],"pinyin":["jing3 fang1"],"word":"警方"},{"definition":["censorship brigade (PRC)"],"pinyin":["du1 cha2 da4 dui4"],"word":"督察大隊"},{"definition":["to alert\/to warn\/police"],"pinyin":["jing3"],"word":"警"},{"definition":["auxiliary police"],"pinyin":["xie2 jing3"],"word":"協警"},{"definition":["public security bureau"],"pinyin":["gong1 an1 ji1 guan1"],"word":"公安機關"},{"definition":["police officer"],"pinyin":["xun2 jing3"],"word":"巡警"},{"definition":["a suspect"],"pinyin":["xian2 yi2 ren2"],"word":"嫌疑人"},{"definition":["administrative region"],"pinyin":["xia2 qu1"],"word":"轄區"}]}