{"definition":["streaming media"],"pinyin":["liu2 mei2 ti3"],"simplified":["流媒体"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"流媒體","characters":[{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"},{"definition":["medium\/intermediary\/matchmaker\/go-between\/abbr. for 媒體|媒体[mei2 ti3], media, esp. news media"],"pinyin":["mei2"],"word":"媒"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[],"sentences":[{"english":"No special streaming server is required.","chinese":"不需要專門的流媒體服務器。"},{"english":"For a better understanding of the features and technology used in todays streaming service.","chinese":"如需功能和技術更好地瞭解今天的流媒體服務使用。"},{"english":"Imeem is a social networking site that offers streaming music.","chinese":"Immem是一個提供流媒體音樂的社交網絡站點。"},{"english":"It tried to become a general-purpose streaming media player enclosure.","chinese":"它嘗試成爲一款通用型的流媒體播放外殼。"},{"english":"Streaming media is the continuous-flow media which is in the use of transmission Technology.","chinese":"流媒體就是使用流式傳輸技術的連續時基媒體。"},{"english":"The design of the mutual multimedia plat of distance instruction based the technology of streaming media.","chinese":"基於流媒體的交互式多媒體遠程學習平臺設計。"},{"english":"The inclusion of a streaming media server facilitates the use of video in presentations.","chinese":"流媒體服務器的加入促進了形象呈現中視頻的使用。"},{"english":"Moreover, the main frame of the Rotate Multicast System is analysed.","chinese":"詳細描述了流媒體輪播系統的基本構架。"},{"english":"This paper studies will FGS coding technology and P2P streaming media best combination.","chinese":"研究了將FGS編碼技術與P2P流媒體的最佳結合。"},{"english":"How about $8\/month for the streaming web version?","chinese":"或者每月8塊上網用流媒體收聽？"},{"english":"Buffer management is a very critical problem in large-scale video streaming servers.","chinese":"在大規模流媒體服務中，緩存管理是非常關鍵的問題。"},{"english":"Known to cause the host audio to skip if upload bandwidth is insufficient for the stream.","chinese":"已知當流媒體的加載帶寬不足時，可導致主音頻跳過。"},{"english":"Free streaming will not save the music business.","chinese":"免費的流媒體不能拯救商業音樂。"},{"english":"A library for playback of various streamed audio formats used in video games.","chinese":"各種播放流媒體視頻遊戲使用的音頻格式。"},{"english":"Premium Branded Slates are presented in-stream before the content begins.","chinese":"優質品牌石板載流媒體內容開始之前。"}],"related":[]}