{"definition":["flow chart"],"pinyin":["liu2 cheng2 tu2"],"simplified":["流程图"],"rank":38634.0,"normalized_rank":0.5405397842541939,"fraction":4.3720299245148685e-7,"cumulative_fraction":0.9959285177183048,"word":"流程圖","characters":[{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"},{"definition":["rule\/order\/regulations\/formula\/journey\/procedure\/sequence","surname Cheng"],"pinyin":["Cheng2","cheng2"],"word":"程"},{"definition":["diagram\/picture\/drawing\/chart\/map\/CL:張|张[zhang1]\/to plan\/to scheme\/to attempt\/to pursue\/to seek"],"pinyin":["tu2"],"word":"圖"}],"containing_words":[],"sentences":[{"english":"Other relevant documents, such as flow diagrams, equipment specification, statistical.","chinese":"其他相關文件，如流程圖，設備規格書，統計表。"},{"english":"A process flow diagram is provided in each Knowledge Area chapter.","chinese":"介紹知識領域的各章，繪有過程流程圖。"},{"english":"This paper proposses a cost-effective software design of BLDCM, and some procedure flow charts of main program subroutine are offered.","chinese":"詳細列出無刷直流電機雙閉環控制器軟件程序流程圖。"},{"english":"Diagrammer is the one-product solution for your diagramming needs.","chinese":"是一個爲您的所有流程圖的需要解決方案。"},{"english":"You can move the rectangle representing the screen to scroll the diagram.","chinese":"您可以移動表示屏幕的矩形以滾動流程圖。"},{"english":"And the C-language data structure and flow charts are given.","chinese":"並給出了控件的C語言數據結構和工作流程圖。"},{"english":"Finally, the system flow chart diagram and procedures.","chinese":"最後給出了系統框圖和程序流程圖。"},{"english":"Flowcharts facilitate communication between programmers and business people.","chinese":"流程圖方便市民之間的溝通程序員和業務。"},{"english":"The flow chart to complete the automatic tuning function is given in the paper.","chinese":"並給出了實現整個自動調諧功能的程序流程圖。"},{"english":"From each high-level step, \"drill down\" to a more detailed flowchart on a new page.","chinese":"從每一高級步驟，“深入”到新頁上更詳細的流程圖。"},{"english":"Finally, the program flow chart of one-step forming is given.","chinese":"最後給出了一步成形模擬算法的程序流程圖。"},{"english":"The software flow chart as well as some key subprogram is given in this paper.","chinese":"論文給出了系統的軟件流程圖和部分重要的子程序。"},{"english":"In flowcharting, a connector which illustrates continuation of a broken flowline.","chinese":"流程圖中的一個單元的方框。"},{"english":"This is where flowcharts come to the rescue.","chinese":"這就需要流程圖來解圍了。"},{"english":"See a larger image of this flowchart.","chinese":"查看這個流程圖的大版本。"},{"english":"This thesis also displays the flow charts and circuit diagram of part of the software of the whole system.","chinese":"本文還給出了整個系統的部分軟件流程圖和電路圖。"}],"related":[]}