{"definition":["to roam far and wide (idiom)\/to travel the world"],"pinyin":["lang4 ji4 tian1 ya2"],"simplified":["浪迹天涯"],"rank":41868.0,"normalized_rank":0.5857876400878653,"fraction":3.220266448574224e-7,"cumulative_fraction":0.9971463643900604,"word":"浪跡天涯","characters":[{"definition":["wave\/breaker\/unrestrained\/dissipated\/to stroll\/to ramble"],"pinyin":["lang4"],"word":"浪"},{"definition":["footprint\/mark\/trace\/vestige\/sign\/indication\/Taiwan pr. [ji1]"],"pinyin":["ji4"],"word":"跡"},{"definition":["day\/sky\/heaven"],"pinyin":["tian1"],"word":"天"},{"definition":["border\/horizon\/shore"],"pinyin":["ya2"],"word":"涯"}],"containing_words":[],"sentences":[{"english":"I must go down to the seas again, to the vagrant Gypsy life.","chinese":"我必須重回大海的懷抱，回到浪跡天涯的無拘生活。"},{"english":"His library displayed miscellanea of mementos from different parts of the world, a lifetime of traveling.","chinese":"他書房裏滿是浪跡天涯時，蒐羅來的世界各地紀念品。"},{"english":"Shi led a wandering life for a long time.","chinese":"很長一段時間石濤都在過着浪跡天涯的生活。"},{"english":"I must wander again all over the world.","chinese":"我必須再一次浪跡天涯。"},{"english":"And lonely travelers wandering free, Will find their way back home with me.","chinese":"還有那浪跡天涯的遊子，我會指引他找到回家的路。"},{"english":"End of the World traces a pot of rover Ruhou hard, you go after the wine warm memories of lean thinking.","chinese":"一壺飄泊浪跡天涯難入喉，你走之後酒暖回憶思念瘦。"},{"english":"In those days wandering minstrels were welcome everywhere.","chinese":"當時，浪跡天涯的吟遊歌手到處受歡迎。"},{"english":"He took the midnight train goin' anywhere…","chinese":"有一天，他乘上了午夜的列車，浪跡天涯。"},{"english":"We compare with wave vestige the person of the limits of the earth, just having another a material of outer shell.","chinese":"我們和浪跡天涯的人相比，只是多了一個物質的外殼。"},{"english":"In your despair you wander about vainly seeking contentment in empty pleasure.","chinese":"絕望中，你浪跡天涯，在虛無的快樂中尋找幸福。"},{"english":"She is gone forever. Who is going to be roaming this tiny planet with me for the rest of my life?","chinese":"她已經遠去。我的餘生裏，誰將會陪伴我浪跡天涯呢？"},{"english":"Do not miss tasteless roaming alone took a gourd ladle thoughts of water.","chinese":"盡不知思念無味浪跡天涯獨取一瓢思念黃河水。"},{"english":"She took the midnight train goin' anywhere…","chinese":"有一天，她乘上了午夜的列車，浪跡天涯。"}],"related":[{"definition":["to regard the four corners of the world all as home (idiom)\/to feel at home anywhere\/to roam about unconstrained\/to consider the entire country, or world, to be one's own"],"pinyin":["si4 hai3 wei2 jia1"],"word":"四海為家"},{"definition":["Getting Home, 2007 PRC comedy-drama film directed by 張揚|张扬[Zhang1 Yang2], starring 趙本山|赵本山[Zhao4 Ben3 shan1]","lit. a falling leaf returns to the roots (idiom)\/fig. all things go back to their source eventually\/in old age, an expatriate returns home"],"pinyin":["Luo4 ye4 gui1 gen1","luo4 ye4 gui1 gen1"],"word":"落葉歸根"},{"definition":["variant of 漂泊[piao1 bo2]"],"pinyin":["piao1 bo2"],"word":"飄泊"},{"definition":["to stand aloof from worldly affairs"],"pinyin":["yu3 shi4 wu2 zheng1"],"word":"與世無爭"},{"definition":["ten thousand crags and torrents (idiom); the trials and tribulations of a long journey\/a long and difficult road"],"pinyin":["wan4 shui3 qian1 shan1"],"word":"萬水千山"},{"definition":["at home wherever one is (idiom); ready to adapt\/flexible\/to accept circumstances with good will"],"pinyin":["sui2 yu4 er2 an1"],"word":"隨遇而安"},{"definition":["brocade garments, jade meals (idiom); a life of luxury\/extravagance"],"pinyin":["jin3 yi1 yu4 shi2"],"word":"錦衣玉食"},{"definition":["burden","to implicate\/to involve"],"pinyin":["fu4 lei3","fu4 lei4"],"word":"負累"},{"definition":["to have no cares\/to be carefree"],"pinyin":["wu2 qian1 wu2 gua4"],"word":"無牽無掛"},{"definition":["lit. a dream of Nanke\/fig. dreams of grandeur"],"pinyin":["Nan2 ke1 yi1 meng4"],"word":"南柯一夢"},{"definition":["lit. when the seas run dry and the stones go soft (idiom)\/fig. forever\/until the end of time"],"pinyin":["hai3 ku1 shi2 lan4"],"word":"海枯石爛"},{"definition":["to run this way and that (idiom); to rush about busily\/to bustle about\/to hopscotch\/also 東跑西顛|东跑西颠[dong1 pao3 xi1 dian1]"],"pinyin":["dong1 ben1 xi1 zou3"],"word":"東奔西走"},{"definition":["the moth flies into the flame\/fatal attraction"],"pinyin":["fei1 e2 pu1 huo3"],"word":"飛蛾撲火"},{"definition":["to walk alone (idiom)"],"pinyin":["ju3 ju3 du2 xing2"],"word":"踽踽獨行"},{"definition":["(idiom) (of a good outcome) unanticipated\/serendipitous\/fortuitous"],"pinyin":["wu2 xin1 cha1 liu3"],"word":"無心插柳"},{"definition":["to bother\/to disturb\/to vex"],"pinyin":["fan2 rao3"],"word":"煩擾"}]}