{"definition":["to emerge"],"pinyin":["fu2 chu1"],"simplified":["浮出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"浮出","characters":[{"definition":["to float\/superficial\/floating\/unstable\/movable\/provisional\/temporary\/transient\/impetuous\/hollow\/inflated\/to exceed\/superfluous\/excessive\/surplus"],"pinyin":["fu2"],"word":"浮"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[{"definition":["to float up (idiom); to become evident\/to surface\/to appear"],"pinyin":["fu2 chu1 shui3 mian4"],"word":"浮出水面"}],"sentences":[{"english":"Yet there may be another supercycle emerging – that is, for gold.","chinese":"而另一場大牛市可能正在浮出水面，那就是黃金。"},{"english":"He came out from the water immediately, climbed up the bank, and made off for home at once.","chinese":"他迅速浮出水面，上岸後撒腿就往家跑。"},{"english":"Gathering them unemotionally will help those facts come out.","chinese":"非情緒化地收集事實會幫助那些事實浮出水面。"},{"english":"Ron Artest doesn't read - he stares down books until they give up the information.","chinese":"阿泰不閱讀，他盯着書，直到他們浮出字爲止。"},{"english":"The new sorting device of floating roller is designed.","chinese":"設計了新型輥子浮出式貨物分類裝置。"},{"english":"Time has finished reading right away having spent three section of class's like this \"float out sea surface \".","chinese":"就這麼花了三節課的時間讀完了《浮出海面》。"},{"english":"Liu brought the transgender issue to the surface.","chinese":"劉著讓跨性別問題浮出水面。"},{"english":"It emerged about a hundred years after production became mechanized.","chinese":"一百年後生產機械化後品牌才浮出水面。"},{"english":"The next revolution has not yet surfaced.","chinese":"下一場革命還沒有浮出水面。"},{"english":"Another bit of evidence for Apple's world view emerged this week.","chinese":"蘋果公司的世界觀的另一個證據本週浮出水面。"},{"english":"The deal emerged late on Saturday after fractious public exchanges earlier in the day between Republicans and Democrats.","chinese":"在週六共和黨和民主黨惡語相向以後，協議浮出水面。"},{"english":"In a world of big data the correlations surface almost by themselves.","chinese":"在龐大數據的世界中，相關數據幾乎是自行浮出水面。"},{"english":"This IP address lets big Peng press down Zhu Mou to rise to surface.","chinese":"這個IP地址讓大彭鎮褚某浮出水面。"},{"english":"This is coming to a head in November.","chinese":"十一月這將浮出頭來。"},{"english":"Jen-Huey Chiang and his family began to emerge of the dust-laden history.","chinese":"姜仁惠及其家族的塵封歷史開始浮出水面。"},{"english":"They waited for over a month, but the huge turtle did not appear on the sea.","chinese":"可是，它們等了一個多月，大鰲還沒浮出海面。"}],"related":[{"definition":["to float up\/to rise to the surface\/fig. to rise in the world"],"pinyin":["fu2 shang4"],"word":"浮上"},{"definition":["to float\/to emerge"],"pinyin":["fu2 qi3"],"word":"浮起"},{"definition":["to appear\/to emerge\/to surface"],"pinyin":["fan4 qi3"],"word":"泛起"},{"definition":["to float\/superficial\/floating\/unstable\/movable\/provisional\/temporary\/transient\/impetuous\/hollow\/inflated\/to exceed\/superfluous\/excessive\/surplus"],"pinyin":["fu2"],"word":"浮"},{"definition":["to appear before one's eyes\/to come into view\/to float into appearance\/to come back (of images from the past)\/to emerge\/it emerges\/it occurs (to me that..)"],"pinyin":["fu2 xian4"],"word":"浮現"},{"definition":["afloat"],"pinyin":["fu2 zhe5"],"word":"浮著"},{"definition":["to flash through (one's mind)\/to dodge (away from pursuers)"],"pinyin":["shan3 guo4"],"word":"閃過"},{"definition":["to appear\/to come out in the open"],"pinyin":["xian3 lu4 chu1"],"word":"顯露出"},{"definition":["to disappear\/to hide"],"pinyin":["yin3 qu4"],"word":"隱去"},{"definition":["to flit across\/to sweep past\/to glance (strike at an angle)"],"pinyin":["lu:e4 guo4"],"word":"掠過"},{"definition":["to well up\/to boil out\/to bubble forth\/to spurt"],"pinyin":["yong3 qi3"],"word":"湧起"},{"definition":["to ripple\/to undulate\/also written 蕩漾|荡漾"],"pinyin":["dang4 yang4"],"word":"盪漾"},{"definition":["to eliminate"],"pinyin":["xiao1 qu4"],"word":"消去"},{"definition":["(of a meteor etc) to streak across (the sky)\/(of a searchlight, lightning etc) to play across (the sky)"],"pinyin":["hua2 guo4"],"word":"劃過"},{"definition":["to delineate\/to articulate\/to evoke\/to draw out\/to tick off"],"pinyin":["gou1 chu1"],"word":"勾出"},{"definition":["to flash past\/to flit by"],"pinyin":["yi1 shan3 er2 guo4"],"word":"一閃而過"}]}