{"definition":["(computing) floating-point number\/float\/real"],"pinyin":["fu2 dian3 shu4"],"simplified":["浮点数"],"rank":64980.0,"normalized_rank":0.9091545058973318,"fraction":1.5911561327950606e-8,"cumulative_fraction":0.9999532141705908,"word":"浮點數","characters":[{"definition":["to float\/superficial\/floating\/unstable\/movable\/provisional\/temporary\/transient\/impetuous\/hollow\/inflated\/to exceed\/superfluous\/excessive\/surplus"],"pinyin":["fu2"],"word":"浮"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[],"sentences":[{"english":"Converts the specified string representation of a number to an equivalent single-precision floating-point number.","chinese":"將指定的十進制數的值轉換爲等效的單精度浮點數。"},{"english":"Computer principle of a floating point arithmetic unit.","chinese":"計算機組成原理的一個浮點數運算器。"},{"english":"For floating-point and fixed-point types, M is the total number of digits that can be stored.","chinese":"對於浮點數及定點類型，M是數字存儲的總位數。"},{"english":"They don't distinguish between integer and floating point numbers. Variables are typeless.","chinese":"腳本不區分整數和浮點數，變量是沒有類型的。"},{"english":"Make a single-float draggable handle.","chinese":"製作一個單一浮點數可拖動控制柄。"},{"english":"If you're reading a floating point number, there are other concerns.","chinese":"如果您讀取的浮點數，還有另外需要關注的問題。"},{"english":"This is similar to the modulo operator but it works with floating point numbers.","chinese":"這是類似於模運算符，但可以使用浮點數。"},{"english":"Converts a specified value to a single-precision floating-point number.","chinese":"將指定的值轉換爲單精確度浮點數。"},{"english":"Writes a Unique Id value.","chinese":"編寫一個單精度浮點數。"},{"english":"Just write a program to find the max of x and y.","chinese":"就寫個程序找出浮點數x和y中的最大值吧。"},{"english":"Does a negative floating point mantissa also with or without sign it?","chinese":"請問一個負數的浮點數的尾數還帶不帶符號呀？"},{"english":"Converts the specified Boolean value to the equivalent single-precision floating-point number.","chinese":"傳回指定的單精確度浮點數，不執行實際的轉換。"},{"english":"It would be best to try to avoid floating point comparison entirely.","chinese":"最好完全避免使用浮點數比較。"},{"english":"Writes a single-precision floating-point number.","chinese":"寫入單精確度浮點數。"},{"english":"Returns the specified single-precision floating-point number; no actual conversion is performed.","chinese":"將指定之物件的值，轉換爲單精確度浮點數。"},{"english":"All it does is return a floating point number representing the temperature.","chinese":"它只是返回一個表示溫度的浮點數。"}],"related":[]}