{"definition":["(computing) floating point"],"pinyin":["fu2 dian3"],"simplified":["浮点"],"rank":42137.0,"normalized_rank":0.5895512990919648,"fraction":3.145817858874638e-7,"cumulative_fraction":0.9972320244994364,"word":"浮點","characters":[{"definition":["to float\/superficial\/floating\/unstable\/movable\/provisional\/temporary\/transient\/impetuous\/hollow\/inflated\/to exceed\/superfluous\/excessive\/surplus"],"pinyin":["fu2"],"word":"浮"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[{"definition":["floating point operation"],"pinyin":["fu2 dian3 yun4 suan4"],"word":"浮點運算"},{"definition":["(computing) floating-point number\/float\/real"],"pinyin":["fu2 dian3 shu4"],"word":"浮點數"},{"definition":["(computing)floating-point\/float\/real"],"pinyin":["fu2 dian3 xing2"],"word":"浮點型"}],"sentences":[{"english":"There are differences in the definition of floating-point numbers and long variable types.","chinese":"浮點型數字和長變量類型的定義是有差異的。"},{"english":"Converts the specified string representation of a number to an equivalent single-precision floating-point number.","chinese":"將指定的十進制數的值轉換爲等效的單精度浮點數。"},{"english":"Computer principle of a floating point arithmetic unit.","chinese":"計算機組成原理的一個浮點數運算器。"},{"english":"For floating-point and fixed-point types, M is the total number of digits that can be stored.","chinese":"對於浮點數及定點類型，M是數字存儲的總位數。"},{"english":"It lacked floating point and parallel processing ability.","chinese":"它缺少浮點和並行處理功能。"},{"english":"They don't distinguish between integer and floating point numbers. Variables are typeless.","chinese":"腳本不區分整數和浮點數，變量是沒有類型的。"},{"english":"Make a single-float draggable handle.","chinese":"製作一個單一浮點數可拖動控制柄。"},{"english":"If you're reading a floating point number, there are other concerns.","chinese":"如果您讀取的浮點數，還有另外需要關注的問題。"},{"english":"This is similar to the modulo operator but it works with floating point numbers.","chinese":"這是類似於模運算符，但可以使用浮點數。"},{"english":"Converts a specified value to a single-precision floating-point number.","chinese":"將指定的值轉換爲單精確度浮點數。"},{"english":"Rounds a double-precision floating-point value to the nearest integer.","chinese":"將雙精度浮點值舍入至指定的小數位數。"},{"english":"So, a 32 bit of float gives you a bunch of precision.","chinese":"2比特的浮點型數據精度更大。"},{"english":"Designing a floating point calculator using FPGA technology may shorten the development cycle of product.","chinese":"介紹了基於FPGA技術的浮點運算器的設計與實現。"},{"english":"Therefore, it is necessary to design high performance FPU.","chinese":"因此，高性能浮點微處理單元的設計是非常有必要。"},{"english":"Writes a Unique Id value.","chinese":"編寫一個單精度浮點數。"},{"english":"Just write a program to find the max of x and y.","chinese":"就寫個程序找出浮點數x和y中的最大值吧。"}],"related":[]}