{"definition":["to rise from the ashes (idiom)\/to thrive again after surviving an ordeal"],"pinyin":["yu4 huo3 chong2 sheng1"],"simplified":["浴火重生"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"浴火重生","characters":[{"definition":["bath\/to bathe"],"pinyin":["yu4"],"word":"浴"},{"definition":["fire\/urgent\/ammunition\/fiery or flaming\/internal heat (Chinese medicine)\/hot (popular)\/classifier for military units (old)\/Kangxi radical 86","surname Huo"],"pinyin":["Huo3","huo3"],"word":"火"},{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["chong2","zhong4"],"word":"重"},{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"}],"containing_words":[],"sentences":[{"english":"Each time, the financial sector rose, phoenix-like, from the ashes.","chinese":"每一次，金融業都像鳳凰般浴火重生。"},{"english":"Ashes of new homes, is gathering a new hope.","chinese":"浴火重生的新家園，正匯聚升騰起新的希望。"},{"english":"or keep trading in the hope of resurrection.","chinese":"或是繼續經營，以期浴火重生。"},{"english":"Sinburning is also a monthly ceremony where your anonymous confession is annihilated by fire.","chinese":"罪惡感的消除也將是一個你每月浴火重生的典禮。"},{"english":"Perhaps another story.","chinese":"也許又一個浴火重生的故事。"},{"english":"Unitech Kiln, shifts the clay alive, beyond the value.","chinese":"歐泰科窯爐，讓泥土浴火重生，超越價值。"},{"english":"Twenty-eight years later, GM is emerging from another agonizing reorganization.","chinese":"二十八年之後，通用汽車在重組風波中浴火重生。"},{"english":"We also can expect, see Baidu how \" bath fire renascence \".","chinese":"我們也可以期待，看百度如何“浴火重生”。"},{"english":"Phoenix this non-mediocre bird, the bath fire rebirth is freer.","chinese":"鳳凰本非凡俗鳥，浴火重生更逍遙。"}],"related":[{"definition":["to be reborn\/rebirth"],"pinyin":["chong2 sheng1"],"word":"重生"},{"definition":["nirvana (Buddhism)"],"pinyin":["nie4 pan2"],"word":"涅槃"},{"definition":["to shed one's mortal body and exchange one's bones (idiom); born again Daoist\/to turn over a new leaf\/fig. to change wholly\/to create from other material (story, artwork etc)"],"pinyin":["tuo1 tai1 huan4 gu3"],"word":"脫胎換骨"},{"definition":["variant of 盤|盘\/wooden tray"],"pinyin":["pan2"],"word":"槃"},{"definition":["lit. to break through a cocoon and turn into a butterfly (idiom)\/fig. to emerge strong after a period of struggle\/to get to a better place after going through difficult period"],"pinyin":["po4 jian3 cheng2 die2"],"word":"破繭成蝶"},{"definition":["to transform\/to morph\/to degenerate\/metamorphosis\/transmutation\/transformation\/decay\/degeneration"],"pinyin":["tui4 bian4"],"word":"蛻變"},{"definition":["baptism (lit. or fig.)"],"pinyin":["xi3 li3"],"word":"洗禮"},{"definition":["to rise from the dead (idiom); fig. an unexpected recovery"],"pinyin":["qi3 si3 hui2 sheng1"],"word":"起死回生"},{"definition":["to be tempered into a steel"],"pinyin":["bai3 lian4 cheng2 gang1"],"word":"百煉成鋼"},{"definition":["lit. to fly upwards swiftly\/fig. rapid advance\/rapidly developing (situation)"],"pinyin":["teng2 fei1"],"word":"騰飛"},{"definition":["to reconstruct (an art object)\/to remodel"],"pinyin":["chong2 su4"],"word":"重塑"},{"definition":["to revive\/(lit. and fig.) to come back to life\/(religion) resurrection"],"pinyin":["fu4 huo2"],"word":"復活"},{"definition":["to amaze the world with a single brilliant feat (idiom); an overnight celebrity"],"pinyin":["yi1 ming2 jing1 ren2"],"word":"一鳴驚人"},{"definition":["place sb on a field of death and he will fight to live (idiom based on Sunzi's \"The Art of War\" 孫子兵法|孙子兵法[Sun1 zi3 Bing1 fa3]); to fight desperately when confronting mortal danger\/fig. to find a way out of an impasse"],"pinyin":["zhi4 zhi1 si3 di4 er2 hou4 sheng1"],"word":"置之死地而後生"},{"definition":["lit. to reorganize flags and drums (idiom); to regroup after a setback\/to prepare for new initiatives\/to attempt a comeback"],"pinyin":["chong2 zheng3 qi2 gu3"],"word":"重整旗鼓"},{"definition":["to come back from death's door (idiom); unexpected rescue from danger\/fig. to recover from a seemingly impossible situation\/to find a way out of a predicament"],"pinyin":["jue2 chu3 feng2 sheng1"],"word":"絕處逢生"}]}