{"definition":["damage to goods during shipping"],"pinyin":["hai3 sun3"],"simplified":["海损"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"海損","characters":[{"definition":["ocean\/sea\/CL:個|个[ge4],片[pian4]\/great number of people or things\/(dialect) numerous","surname Hai"],"pinyin":["Hai3","hai3"],"word":"海"},{"definition":["to decrease\/to lose\/to damage\/to harm\/(coll.) to speak sarcastically\/to deride\/caustic\/mean\/one of the 64 hexagrams of the Book of Changes (䷨)"],"pinyin":["sun3"],"word":"損"}],"containing_words":[],"sentences":[{"english":"If a particular cargo is partially damaged, the damage is titled particular average.","chinese":"假如某批貨是部份受損，咱們稱之爲“單獨海損”。"},{"english":"The F.P.A. doesn't cover partial loss of the nature of particular average.","chinese":"平安險不包括單獨海損性質的部分損失。"},{"english":"Risk of Breakage is classified under extraneous risks.","chinese":"險是屬於一種單獨海損，對嗎？"},{"english":"This rule shall not affect the determination of the place at which the average statement is to be made up.","chinese":"本條規定不影響對編制海損理算書地點的決定。"},{"english":"The adjustment of general average is governed by the rules agreed by the parties to it.","chinese":"共同海損理算，適用當事人約定的理算規則。"},{"english":"Insurance company insured ships and their cargoes against loss and sea.","chinese":"保險公司爲船舶和船貨承保了海損險。"},{"english":"If a particular bikego is partiwhichley damaged, the damage is titled particular average.","chinese":"假如某批貨是部份受損咱們稱之爲“單獨海損”。"},{"english":"Particular charges are not included in particular average.","chinese":"特別費用不包括在單獨海損內。"},{"english":"Not every breakage is a particular average.","chinese":"並非一切的破碎險都屬於單獨海損。"},{"english":"The F. P. A. doesn't cover partial loss of the nature of particular average.","chinese":"平安險不包括零丁海損性質的部分喪失落。"}],"related":[]}