{"definition":["maritime climate"],"pinyin":["hai3 yang2 xing4 qi4 hou4"],"simplified":["海洋性气候"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"海洋性氣候","characters":[{"definition":["ocean\/sea\/CL:個|个[ge4],片[pian4]\/great number of people or things\/(dialect) numerous","surname Hai"],"pinyin":["Hai3","hai3"],"word":"海"},{"definition":["ocean\/vast\/foreign\/silver dollar or coin"],"pinyin":["yang2"],"word":"洋"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"},{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"},{"definition":["to wait\/to inquire after\/to watch\/season\/climate\/(old) period of five days"],"pinyin":["hou4"],"word":"候"}],"containing_words":[],"sentences":[{"english":"Lying within the South Temperate Zone, New Zealand has an oceanic climate, without extremes of heat or cold.","chinese":"新西蘭地處南溫帶，屬海洋性氣候，沒有嚴冬和酷署。"},{"english":"Is the tropics marine climate, year to year high temperature moist rain.","chinese":"屬熱帶海洋性氣候，常年高溫潮溼多雨。"},{"english":"This area is belong to oceanic-continental transitional climate , has different scene in each season.","chinese":"景區屬北溫帶大陸海洋性氣候，四季皆可一遊。"},{"english":"Therefore, said Mira Hill is a continental climate with the climate of the watershed.","chinese":"因此說，米拉山是大陸性氣候與海洋性氣候的分水嶺。"},{"english":"The Pacific northwest is favored with a maritime climate.","chinese":"太平洋西北岸爲海洋性氣候。"},{"english":"Therefore , said Mira Hill is a continental climate with the climate of the watershed . bbs. ifeng…","chinese":"因此說，米拉山是大陸性氣候與海洋性氣候的分水嶺。"},{"english":"Li I'm not used to this maritime climate yet.","chinese":"我到現在還不習慣這裏的海洋性氣候。"},{"english":"You're my temperate maritime climate being warm all the time.","chinese":"你是我的溫帶海洋性氣候一直都是暖暖的。"},{"english":"The southwestern coastal region has a humid mild marine climate.","chinese":"西南海岸地區有着潮溼溫和的海洋性氣候。"},{"english":"You are my temperate marine climate, has always been warm.","chinese":"你是我的溫帶海洋性氣候，一直都是暖暖的。"}],"related":[]}