{"definition":["spongy"],"pinyin":["hai3 mian2 zhuang4"],"simplified":["海绵状"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"海綿狀","characters":[{"definition":["ocean\/sea\/CL:個|个[ge4],片[pian4]\/great number of people or things\/(dialect) numerous","surname Hai"],"pinyin":["Hai3","hai3"],"word":"海"},{"definition":["silk floss\/continuous\/soft\/weak\/mild-mannered (dialect)"],"pinyin":["mian2"],"word":"綿"},{"definition":["accusation\/suit\/state\/condition\/strong\/great\/-shaped"],"pinyin":["zhuang4"],"word":"狀"}],"containing_words":[{"definition":["bovine spongiform encephalopathy, BSE\/mad cow disease"],"pinyin":["niu2 hai3 mian2 zhuang4 nao3 bing4"],"word":"牛海綿狀腦病"}],"sentences":[{"english":"Objective To investigate the pathological characteristics of heroin spongiform leukoencephalopathy.","chinese":"目的瞭解海洛因海綿狀白質腦病的病理特徵。"},{"english":"Pregnancy and estrogen-based medications can cause cavernous hemangiomas to grow.","chinese":"妊娠和雌激素藥物可能導致的海綿狀血管瘤增長。"},{"english":"Along with the clinical improvement the spongiform pustules vanished, and the inflammation in dermis also lessened.","chinese":"治療後表皮內海綿狀膿皰消失，真皮炎症有所減輕。"},{"english":"Diagnosis and Treatment for the Giant Cavernous Hemangiomas in the Middle Fossa.","chinese":"中顱凹底巨大海綿狀血管瘤的診斷和治療。"},{"english":"Objective To investigate methods of microsurgical treatment for cases of intracranial cavernous hemangioma.","chinese":"目的探討顱內海綿狀血管瘤顯微手術治療方法。"},{"english":"Seed Chang Sanleng shape, constant involute be in a fungous fiber plastid inside.","chinese":"種子常三棱狀，常內卷在具海綿狀纖維質體內。"},{"english":"I gave up eating all beef when I first heard of BSE.","chinese":"我首次聽說牛海綿狀腦病後便不再喫任何牛肉。"},{"english":"Objective To sum up the experiences in microneurosurgical treatment of spinal cord cavernous hemangiomas ( SCH).","chinese":"目的總結脊髓海綿狀血管瘤顯微外科治療的經驗。"},{"english":"Methods The artifical sponginess skin can be obtained from the effervesced chitin.","chinese":"方法市售甲殼素經發泡技術製成海綿狀人工皮。"},{"english":"The extracted collagen was white, with no smell. The collagen membrane was white, sponge-like and elastic.","chinese":"凍幹交聯膠原膜呈白色海綿狀，具有一定彈性。"},{"english":"Objective To probe manifestations of cerebral cavernous angioma on MRI image as well as their diagnostic value.","chinese":"目的探討腦海綿狀血管瘤的MRI表現及診斷價值。"},{"english":"Spongy degeneration was apparent with brain biopsy.","chinese":"腦病理檢查表現爲海綿狀變性。"},{"english":"Objective To study the diagnosis and treatment of cavernoma of urethra cavernosum.","chinese":"目的探討尿道海綿體海綿狀血管瘤的診斷及治療方法。"},{"english":"Objective To study imaging features of dural cavernous angiomas .","chinese":"目的探討硬腦膜海綿狀血管瘤的影像學特徵。"}],"related":[]}