{"definition":["to melt (e.g. an icecap)"],"pinyin":["xiao1 rong2"],"simplified":["消融"],"rank":26835.0,"normalized_rank":0.3754564660780994,"fraction":0.0000012552616133857547,"cumulative_fraction":0.9867936637919998,"word":"消融","characters":[{"definition":["to disappear\/to vanish\/to eliminate\/to spend (time)\/have to\/need"],"pinyin":["xiao1"],"word":"消"},{"definition":["to melt\/to thaw\/to blend\/to merge\/to be in harmony"],"pinyin":["rong2"],"word":"融"}],"containing_words":[],"sentences":[{"english":"Results These pathways were successfully ablated in 9 patients.","chinese":"結果本組10例患者，射頻消融9條旁道成功。"},{"english":"The ice fields at the roof of the world are shrinking.","chinese":"這世界屋脊的冰原也在漸漸消融。"},{"english":"The ablation target site was the isthmus between tricuspid valve annulus and inferior vana cava.","chinese":"位於三尖瓣環和下腔靜脈口間的峽部爲消融部位。"},{"english":"Objective To summarize the nursing of atrial tachyarrhythmia after radiofrequency current catheter ablation(RCCA) .","chinese":"目的總結導管射頻消融治療快速房性心律失常的護理。"},{"english":"If treatment is desired, ablative or excisional modalities are appropriate.","chinese":"如確實需要治療，可進行消融或切除。"},{"english":"The dominant mechanism by which interventional ultrasound energy dissolves thrombi is acoustic cavitation.","chinese":"超聲介入消融血栓的主要作用機制是聲學空化效應。"},{"english":"Some icebergs, however, drift north to warmer climates and disintegrate.","chinese":"不過，也有一些冰山會往北漂流到溫帶然後消融。"},{"english":"Right-sided accessory atrioventricular pathways were ablated by radiofrequency current in 6 patients with Wolff-Parkinson-White syndrome.","chinese":"以射頻電流消融6例預激綜合徵患者的右側旁路。"},{"english":"To investigate the outcome of radiofrequency ablation (RFA) in treatment for liver cancer located in the second hepatic portal.","chinese":"探討第二肝門區肝癌射頻消融的治療結局。"},{"english":"The experience of RFA in the treatment of atrial flutter in children should be accumulated.","chinese":"射頻消融治療兒童心房撲動需積累經驗。"},{"english":"LITT of brain tumors need exact location.","chinese":"腦部腫瘤激光消融需要精確的定位。"},{"english":"Radiofrequency ablation is used to treat many types of liver cancer. The two most common types are","chinese":"射頻消融術能夠用於治療許多類型的肝癌。"},{"english":"Radiofrequency Catheter Ablation for Idiopathic Ventricular Tachycardia of Atypical Site.","chinese":"特殊部位特發性室性心動過速的射頻消融。"},{"english":"The retreat of the glaciers threatens agriculture downstream.","chinese":"冰川的消融威脅着下游的農業。"},{"english":"Focal atrial fibrillation treated by circumferential radiofrequency catheter ablation of pulmonary vein orifice.","chinese":"導管射頻肺靜脈口環狀消融治療局竈性心房顫動。"},{"english":"Linear ablation along the isthmus between tricuspid valve and inferior vena cava was performed.","chinese":"於右房三尖瓣環與下腔靜脈之間的峽部進行線性消融。"}],"related":[{"definition":["to melt\/molten\/fig. to understand thoroughly"],"pinyin":["rong2 jie3"],"word":"融解"},{"definition":["to dissipate"],"pinyin":["xiao1 san4"],"word":"消散"},{"definition":["erosion\/wearing away\/ablation"],"pinyin":["xiao1 shi2"],"word":"消蝕"},{"definition":["to melt\/to thaw\/to dissolve\/to blend into\/to combine\/to fuse"],"pinyin":["rong2 hua4"],"word":"融化"},{"definition":["ice\/(fig.) frosty relationship"],"pinyin":["jian1 bing1"],"word":"堅冰"},{"definition":["to melt\/to dissolve (of sugar etc)"],"pinyin":["rong2 hua4"],"word":"溶化"},{"definition":["to eliminate\/to obliterate"],"pinyin":["xiao1 min3"],"word":"消泯"},{"definition":["to condense\/to solidify\/to coagulate\/clot (of blood)"],"pinyin":["ning2 jie2"],"word":"凝結"},{"definition":["(literary) to eliminate\/to put an end to"],"pinyin":["xiao1 mi3"],"word":"消弭"},{"definition":["to freeze over\/to ice over\/icebound\/to shelve (a proposal etc)"],"pinyin":["bing1 feng1"],"word":"冰封"},{"definition":["to dissipate everywhere (of light, sound, gas etc)"],"pinyin":["mi2 san4"],"word":"彌散"},{"definition":["to spread out after being diluted or melted\/to dissolve into a liquid"],"pinyin":["hua4 kai1"],"word":"化開"},{"definition":["to cleanse\/to scrub\/to scour\/to wash down\/to erode\/to wash away"],"pinyin":["chong1 shua1"],"word":"沖刷"},{"definition":["ice crystals"],"pinyin":["bing1 jing1"],"word":"冰晶"},{"definition":["to burn\/to scorch\/to cauterize"],"pinyin":["shao1 zhuo2"],"word":"燒灼"},{"definition":["to wane\/to vanish gradually"],"pinyin":["xiao1 tui4"],"word":"消退"}]}