{"definition":["noise reduction equipment"],"pinyin":["xiao1 sheng1 qi4"],"simplified":["消声器"],"rank":45273.0,"normalized_rank":0.6334280077791613,"fraction":2.3210442671047216e-7,"cumulative_fraction":0.9980839294929328,"word":"消聲器","characters":[{"definition":["to disappear\/to vanish\/to eliminate\/to spend (time)\/have to\/need"],"pinyin":["xiao1"],"word":"消"},{"definition":["sound\/voice\/tone\/noise\/reputation\/classifier for sounds"],"pinyin":["sheng1"],"word":"聲"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[],"sentences":[{"english":"The new and trial-manufactured silencer excelled the silencer of original machine on each item of performances.","chinese":"新試製的消聲器各項性能均優於原機消聲器。"},{"english":"The new and trial-manufactured silencer excelled the silencer of original machine on each item of performances.","chinese":"新試製的消聲器各項性能均優於原機消聲器。"},{"english":"I put the silencer on my gun and Jeff did the same.","chinese":"我在槍上裝上消聲器，傑夫也把消音器安好。"},{"english":"I had a new muffler put on the Cadillac.","chinese":"我還在卡迪拉克車上裝了一個新的消聲器。"},{"english":"This paper covers the design and orthogonal test of silencer.","chinese":"本文探討了消聲器設計與正交試驗。"},{"english":"The driver deadened the noise of the car with a new muffler.","chinese":"司機安裝了新的消聲器減少汽車嗓音。"},{"english":"Then the resistance loss characteristics is analyzed for the different configurations of water silencers.","chinese":"隨後對不同結構水消聲器的阻力損失特性進行了分析。"},{"english":"The weapon can fire a pistol fitted with a silencer.","chinese":"這個裝備也可裝備安裝消聲器的手槍。"},{"english":"It was found that the primary muffler was failure when the tricatalyzing exchanger was installed.","chinese":"汽車主消聲器在加裝三元催化轉化器後發生失效。"},{"english":"Wanted Mufflers for ATVs and Golf Cars, please send us some quotes.","chinese":"我們需要求購汽車消聲器，請聯繫我們。"},{"english":"Guns with silencers only make a little noise.","chinese":"裝上消聲器的手槍只會發出很小的聲音。"},{"english":"The suppressor's durability is shown in the icon.","chinese":"消聲器的耐久度會顯示在武器圖標上。"},{"english":"Scooter engine muffler exhaust pipes etc series products.","chinese":"汽油機滑板車消聲器排器管等系列產品。"},{"english":"The muffler is an irregular shaped tapered type mid-ship muffler.","chinese":"消聲器是一個不規則形狀的圓錐型船舯消聲器。"},{"english":"The muffler is an irregular shaped tapered type mid-ship muffler.","chinese":"消聲器是一個不規則形狀的圓錐型船舯消聲器。"},{"english":"Muffler is the conventional muffling device in the noise control of compressor.","chinese":"消聲器是壓縮機噪聲控制中常用的消聲裝置。"}],"related":[]}