{"definition":["to set foot in\/to step into\/to become involved for the first time"],"pinyin":["she4 zu2"],"simplified":["涉足"],"rank":8910.0,"normalized_rank":0.12466245994991115,"fraction":0.000010075229828383697,"cumulative_fraction":0.9197657781444548,"word":"涉足","characters":[{"definition":["to wade\/to be involved\/to concern\/to experience\/to enter (classical)"],"pinyin":["she4"],"word":"涉"},{"definition":["excessive","foot\/to be sufficient\/ample"],"pinyin":["ju4","zu2"],"word":"足"}],"containing_words":[],"sentences":[{"english":"He just dabbles in politics.","chinese":"他僅僅是涉足政治而已。"},{"english":"Aside from customers, few outsiders set foot inside.","chinese":"除客戶外，很少有外界人士能涉足這裏。"},{"english":"Nokia diversified into televisions and computers without much success.","chinese":"後來，諾基亞涉足電視和電腦業務，均未獲成功。"},{"english":"His business interests span petrochemicals, textiles, transportation and electronics.","chinese":"他的企業涉足石油化工，紡織業，運輸業和電力行業。"},{"english":"Senator in a scandal he’ll loose his beltway to the fast track.","chinese":"要是議員涉足醜聞，他的亨通仕途就此終結了。"},{"english":"Chinese economic history is barely coming into its own as a field of study.","chinese":"中國經濟史只是剛涉足的研究領域。"},{"english":"Was the bedside of such a dying man as that the proper place for a bishop?","chinese":"那種死人的病榻前也能成爲主教涉足的地方嗎？"},{"english":"Keep off fame and wealth; crave not external attractions. Always see life as a candle flickering in the wind.","chinese":"勿涉足名利，勿貪戀外境，時刻視生命如風中之燭。"},{"english":"Razer does not rule out expansion into any gaming or entertainment category.","chinese":"我們不會武斷地否認不涉足某些遊戲或娛樂市場。"},{"english":"Xu toured Zhejiang seven times as his most favorite place.","chinese":"徐氏七次遊浙，浙江是他涉足次數最多的省份。"},{"english":"What fields do you draw on for the study of your subject?","chinese":"在研究本主題的過程中，你還涉足哪些領域？"},{"english":"Nowadays, Daton Bio-tech has been widely applied in food additive field, depends on our strength.","chinese":"我們現依靠自身實力廣泛涉足於食品添加劑行業。"},{"english":"Without them, we might never venture into the \"real love\" arena.","chinese":"沒有它們，我們可能永遠也不會涉足“真愛”的舞臺。"},{"english":"Is still the cause uproar, it permeates in whatever you set foot in the soil.","chinese":"依舊是滿城風雨，它瀰漫在任何你涉足的土壤。"},{"english":"Yes, we dabble in literature, and more generally, narrative.","chinese":"是的，我們涉足文學，或者通俗點說是記敘文。"},{"english":"Randwaded into politics within a year of moving to Kentucky.","chinese":"蘭德剛搬去肯塔基州一年就涉足了政治。"}],"related":[{"definition":["to skim (through a book)\/to read cursorily\/to dip into"],"pinyin":["she4 lie4"],"word":"涉獵"},{"definition":["to march\/to advance"],"pinyin":["jin4 jun1"],"word":"進軍"},{"definition":["domain\/sphere\/field\/territory\/area"],"pinyin":["ling3 yu4"],"word":"領域"},{"definition":["to break new ground (for agriculture)\/to open up (a new seam)\/to develop (border regions)\/fig. to open up (new horizons)"],"pinyin":["kai1 tuo4"],"word":"開拓"},{"definition":["to throw oneself into sth"],"pinyin":["tou2 shen1"],"word":"投身"},{"definition":["to start out by\/to grow an enterprise beginning with\/to begin one's career by"],"pinyin":["qi3 jia1"],"word":"起家"},{"definition":["to go for\/to engage in\/to undertake\/to deal with\/to handle\/to do"],"pinyin":["cong2 shi4"],"word":"從事"},{"definition":["equity participation (finance)"],"pinyin":["can1 gu3"],"word":"參股"},{"definition":["to cooperate\/to collaborate\/to work together\/cooperation\/CL:個|个[ge4]"],"pinyin":["he2 zuo4"],"word":"合作"},{"definition":["transformation\/to transform"],"pinyin":["zhuan3 xing2"],"word":"轉型"},{"definition":["to reveal outstanding talent (idiom); to stand out as conspicuously brilliant"],"pinyin":["zhan3 lu4 tou2 jiao3"],"word":"嶄露頭角"},{"definition":["industry\/business"],"pinyin":["hang2 ye4"],"word":"行業"},{"definition":["to fight in one place after another"],"pinyin":["zhuan3 zhan4"],"word":"轉戰"},{"definition":["(of markets, industries, infectious diseases etc) rising\/emerging\/in the ascendant","Xinxing county in Yunfu 雲浮|云浮[Yun2 fu2], Guangdong\/Xinxing or Hsinhsing district of Kaohsiung city 高雄市[Gao1 xiong2 shi4], south Taiwan"],"pinyin":["Xin1 xing1","xin1 xing1"],"word":"新興"},{"definition":["under the banner of"],"pinyin":["qi2 xia4"],"word":"旗下"},{"definition":["main business"],"pinyin":["zhu3 ye4"],"word":"主業"}]}