{"definition":["to ford (a stream, river etc)"],"pinyin":["she4 guo4"],"simplified":["涉过"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"涉過","characters":[{"definition":["to wade\/to be involved\/to concern\/to experience\/to enter (classical)"],"pinyin":["she4"],"word":"涉"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"}],"containing_words":[],"sentences":[{"english":"Has forded your frivolous lens, I see the profound pupil.","chinese":"涉過你輕薄的鏡片，我看到深邃的瞳孔。"},{"english":"North Koreans keep on wading the Tumen River.","chinese":"不過朝鮮人並未被嚇阻，他們繼續涉過圖們江。"},{"english":"Andy rolled up his pants and then walked through the stream.","chinese":"安迪捲起褲管，然後涉過了小溪。"},{"english":"The soldier rode out of the ford with the scouts in advance.","chinese":"偵察兵先涉過淺灘，戰士們跟着安然渡過。"},{"english":"The exercise will help you wade through the tidal wave of names you’re about to encounter.","chinese":"這樣會幫你涉過你將遇到的名字的浪潮。"},{"english":"He splashed (his way) through the shallow water.","chinese":"他噗通噗通地涉過淺水。"},{"english":"If you decide to ford a stream, be extremely careful.","chinese":"如果已決定要涉過小溪，必須極度小心。"},{"english":"He took off his shoes and wade across the shallow gully.","chinese":"他脫下鞋子涉過了淺水溝。"},{"english":"He take off his shoes and wade across the shallow gully .","chinese":"他脫下鞋子涉過了淺水溝。"},{"english":"The cow went on till she passed the shallow channel of Cephisus and came out into the plain of Panope.","chinese":"那條牛涉過了刻非瑟斯淺峽，來到了帕諾蒲平原。"},{"english":"Sometimes we had to crawl along, sometimes we had to wade knee-deep through water and mud.","chinese":"我們時而貓腰而行，時而涉過水深及膝的泥漿。"},{"english":"Go on my life on the road, met to wade across the river.","chinese":"走在自己的人生道路上，遇到了無法涉過的河。"},{"english":"We waded across a stream.","chinese":"我們涉過一條小溪。"},{"english":"As they neared the grape hut, the patrol waded through an irrigation ditch.","chinese":"巡邏隊涉過灌溉水渠，走近葡萄園小屋。"}],"related":[]}