{"definition":["lit. extreme saturation (idiom)\/fig. vividly and thoroughly\/in great detail\/without restraint\/(of a performance) brilliant"],"pinyin":["lin2 li2 jin4 zhi4"],"simplified":["淋漓尽致"],"rank":10305.0,"normalized_rank":0.14418031984105886,"fraction":0.000007875638946828103,"cumulative_fraction":0.9321619899074952,"word":"淋漓盡致","characters":[{"definition":["to filter\/to strain\/to drain\/gonorrhea\/(TCM) strangury","to sprinkle\/to drip\/to pour\/to drench"],"pinyin":["lin2","lin4"],"word":"淋"},{"definition":["pattering (of rain)\/seep through"],"pinyin":["li2"],"word":"漓"},{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely"],"pinyin":["jin4"],"word":"盡"},{"definition":["to send\/to devote\/to deliver\/to cause\/to convey"],"pinyin":["zhi4"],"word":"致"}],"containing_words":[],"sentences":[{"english":"The symmetry rules were exerted perfectly in crystallography.","chinese":"對稱規律在晶體學中得到了淋漓盡致的發揮。"},{"english":"Rural the poetics picture meaning like is in of Zhu Teng in braiding, reflect incisively and vividly.","chinese":"田園般的詩情畫意在竹藤的編織中體現得淋漓盡致。"},{"english":"But at the same time the Chinese want their pound of flesh.","chinese":"但與此同時，中國人的苛求也在其間展現的淋漓盡致。"},{"english":"Verbal jokes use this element to the greatest level possible.","chinese":"口頭笑話把這一招用的淋漓盡致。"},{"english":"It's in deceiving oneself that human intelligence is best revealed.","chinese":"人類的智慧在欺騙自己時體現的淋漓盡致。"},{"english":"This has been well demonstrated in the case of the unsuccessful assassination of President Reagan.","chinese":"這點，在謀殺里根總統未遂案中已表現得淋漓盡致。"},{"english":"which can be performed outright, as... you know, a movement piece","chinese":"這樣就可以淋漓盡致地展現出某些動作。"},{"english":"So-called muck, in today's society show incisively and vividly.","chinese":"所謂的糞，在今天的社會里表現得淋漓盡致。"},{"english":"He underplayed the comic elements of the opera.","chinese":"他沒有把這出歌劇的喜劇成分表演得淋漓盡致。"},{"english":"All these are fully shown from the heroes in the heroes in the Trojan War.","chinese":"這些都在特洛亞戰爭英雄的身上體現得淋漓盡致。"},{"english":"The people of Hetian have turned to this handicraft in an impressive, distinctive way.","chinese":"和田人已把他們的這種手工藝發揮得淋漓盡致。"},{"english":"Of course, by the same token, Clare's classic characters shine through every Leasingham wine.","chinese":"當然，嘉拉谷的經典特色被麗星酒園表現得淋漓盡致。"},{"english":"The dit-mension of obscenity is that by which Christianity revives the religion of men.","chinese":"低俗的淋漓盡致，是基督教用來複活人的宗教的策略。"},{"english":"We were wailing but nobody had a tape machine.","chinese":"我們演奏得淋漓盡致，可惜沒有人帶錄音機。"},{"english":"The new album will fully present Fong's guitar-playing skill.","chinese":"新專輯裏，大同的吉他功力將會表現得淋漓盡致。"}],"related":[{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"word":"展現"},{"definition":["vivid\/lively"],"pinyin":["sheng1 dong4"],"word":"生動"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"體現"},{"definition":["peak\/pinnacle\/ultimate"],"pinyin":["ji2 zhi4"],"word":"極致"},{"definition":["to portray"],"pinyin":["ke4 hua4"],"word":"刻畫"},{"definition":["vivid\/lifelike"],"pinyin":["chuan2 shen2"],"word":"傳神"},{"definition":["(of a story etc) to unfold\/to play out\/to develop (a technique etc)\/to enact\/(logic) to deduce\/to infer"],"pinyin":["yan3 yi4"],"word":"演繹"},{"definition":["to interpret\/to comment and explain\/to annotate\/to perform (i.e. interpret a theatrical role)\/to decode\/interpretation\/annotation"],"pinyin":["quan2 shi4"],"word":"詮釋"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰顯"},{"definition":["to describe\/to depict\/to portray\/description"],"pinyin":["miao2 xie3"],"word":"描寫"},{"definition":["to stand out from the masses (idiom)"],"pinyin":["yu3 zhong4 bu4 tong2"],"word":"與眾不同"},{"definition":["incomparable"],"pinyin":["wu2 yu3 lun2 bi3"],"word":"無與倫比"},{"definition":["it's just perfect\/it's just right"],"pinyin":["qia4 dao4 hao3 chu4"],"word":"恰到好處"},{"definition":["to describe\/to portray"],"pinyin":["miao2 hui4"],"word":"描繪"},{"definition":["to be quick-witted"],"pinyin":["ling2 dong4"],"word":"靈動"},{"definition":["lit. to fly one's banner on a solitary tree (idiom); fig. to act as a loner\/to stand out\/to develop one's own school\/to have attitude of one's own"],"pinyin":["du2 shu4 yi1 zhi4"],"word":"獨樹一幟"}]}