{"definition":["tears falling like rain (idiom)"],"pinyin":["lei4 ru2 yu3 xia4"],"simplified":["泪如雨下"],"rank":35134.0,"normalized_rank":0.491570243308662,"fraction":5.979243596264741e-7,"cumulative_fraction":0.994129271208304,"word":"淚如雨下","characters":[{"definition":["tears"],"pinyin":["lei4"],"word":"淚"},{"definition":["as\/as if\/such as"],"pinyin":["ru2"],"word":"如"},{"definition":["rain\/CL:陣|阵[zhen4],場|场[chang2]","to rain\/(of rain, snow etc) to fall\/to precipitate\/to wet"],"pinyin":["yu3","yu4"],"word":"雨"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[{"english":"The indomitable spirit of man also cant help tears.","chinese":"這個頂天立地的男人也不禁淚如雨下。"},{"english":"''We thought she was dead,'' the aunt said through a shower of tears.","chinese":"“我們以爲她死了，”嬸母說着，淚如雨下。"},{"english":"See suicide after poor Du Shan, xiao-feng liu love of tears.","chinese":"看到自殺後可憐的杜山，劉小鳳心疼的淚如雨下。"},{"english":"This year the fall, but I think the departure of their loved ones burst into tears.","chinese":"這一年秋天，我想起親人的離去卻淚如雨下。"},{"english":"Rose looks up at Jack tears pouring down her face.","chinese":"露絲擡頭望着傑克，淚如雨下。"},{"english":"When tears come down like falling rain, you'll toss around and call my name.","chinese":"當淚如雨下，你將輾轉反側呼喚我的名字。"},{"english":"So he held his mother, and she clung to him, and she shed many tears.","chinese":"於是他摟着母親，母親靠在他身上，淚如雨下。"},{"english":"My teardrops fell like rain that day.","chinese":"那天我淚如雨下。"},{"english":"I still felt unsure if I would be able to without breaking down into tears.","chinese":"我仍然不確定我是否能夠控制住不淚如雨下。"},{"english":"She burst into tears as she knew her son got a heart donor.","chinese":"當她得知有心臟捐贈者捐心給兒子時，立刻淚如雨下。"},{"english":"The mourner's profuse tears at the burial were heartbreaking.","chinese":"送葬者淚如雨下，令人心碎。"},{"english":"If has artificial me to weep copiously .","chinese":"如果有人爲我淚如雨下。"},{"english":"Li Mu sees a daughter accordingly, tears such as rain afterward.","chinese":"李母見女兒如此，淚如雨下。"},{"english":"When her mother looks at her, Tingting ­suddenly bursts into tears.","chinese":"當媽媽看着女兒時，婷婷忽然淚如雨下。"}],"related":[]}