{"definition":["tears\/teardrops"],"pinyin":["lei4 ye4"],"simplified":["泪液"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"淚液","characters":[{"definition":["tears"],"pinyin":["lei4"],"word":"淚"},{"definition":["liquid\/fluid\/Taiwan pr. [yi4]"],"pinyin":["ye4"],"word":"液"}],"containing_words":[],"sentences":[{"english":"Newborns do not have normal tear secretions to protect their eyes from irritants.","chinese":"新生兒沒有正常的淚液分泌以保護他們的眼睛刺激。"},{"english":"These engineered nanoparticles react with glucose molecules found in tears.","chinese":"這些經設計的納米微粒與淚液中的葡萄糖分子反應。"},{"english":"Value of basal tear secretion.","chinese":"基礎淚液分泌測定值。"},{"english":"However, this study tries to elucidate the role of passive tear drainage after DCR and CDCR.","chinese":"然而本文嘗試解釋吻合術後，被動性淚液引流之角色。"},{"english":"Dry eyes can result from an improper balance of tear production and drainage.","chinese":"乾眼症是由於淚液的分泌與排出失衡所引起的。"},{"english":"Still they call forth my warm affection's tear.","chinese":"它們依舊汲引我深情的淚液。"},{"english":"In group-E, one eye was treated with 0.5% timolol eye drops and the other eye was given artificial tear.","chinese":"組隨機一隻眼滴用噻嗎心安，對側眼滴用人工淚液。"},{"english":"For patients with mild irritation, artificial tears can be used.","chinese":"對於有輕微刺激症狀的病人，可使用人工淚液。"},{"english":"Objective To remedy lacrimal hypersecretion by procaine blocking lacrimal gland .","chinese":"目的利用普羅卡因封閉淚腺治療淚液分泌過多症。"},{"english":"Objective To remedy lacrimal hypersecretion by procaine blocking lacrimal gland.","chinese":"目的利用普羅卡因封閉淚腺治療淚液分泌過多症。"},{"english":"Objective To evaluate the clinical effects of artificial tear Yanshukang in treatment of dry eye.","chinese":"目的評價眼舒康人工淚液的臨牀療效。"},{"english":"Objective To study tear secretion and tear film function in type 2 diabetic patients.","chinese":"目的探討2型糖尿病患者淚液分泌及淚膜功能。"},{"english":"Objective To effects of Lacrimal drainage install implantation for xerophthalmia patients.","chinese":"目的探討淚液引流裝置對眼乾燥症的治療效果。"},{"english":"Passive tear suctioning force can be demonstrated by a Venturi tube model.","chinese":"被動性淚液吸引之力量，可藉由文氏管模型來解釋。"}],"related":[]}