{"definition":["coagulant"],"pinyin":["hun4 ning2 ji4"],"simplified":["混凝剂"],"rank":65424.0,"normalized_rank":0.915366641948708,"fraction":1.4305807432469353e-8,"cumulative_fraction":0.9999599491403608,"word":"混凝劑","characters":[{"definition":["confused\/dirty\/to mix\/muddy\/variant of 渾|浑[hun2]","to mix\/to mingle\/muddled\/to drift along\/to muddle along\/to pass for\/to get along with sb\/thoughtless\/reckless"],"pinyin":["hun2","hun4"],"word":"混"},{"definition":["to congeal\/to concentrate attention\/to stare"],"pinyin":["ning2"],"word":"凝"},{"definition":["dose (medicine)"],"pinyin":["ji4"],"word":"劑"}],"containing_words":[],"sentences":[{"english":"Treatment of restaurant wastewater with polysilicate aluminium was studied.","chinese":"以聚硅酸鋁爲混凝劑，用化學法絮凝處理餐飲廢水。"},{"english":"Jar test is an important method for determination of proper coagulant dosage.","chinese":"杯罐試驗是水廠合理確定混凝劑投加量的重要方法。"},{"english":"The study and application of coagulant to water treatment is introduced in this paper.","chinese":"本文介紹了水處理用混凝劑的研究及應用狀況。"},{"english":"The optimal coagulant dosage exists, and makes flux maximun.","chinese":"存在最佳混凝劑投加量，它可使膜過濾通量最大。"},{"english":"The develop progress of inorganic polymeric coagulant in recent years were reviewed.","chinese":"綜述了近年來無機高分子混凝劑的研製進展。"},{"english":"This paper discusses several aluminum salt coagulants.","chinese":"對幾種鋁鹽混凝劑進行了評述。"},{"english":"In this paper, fly ash treated by acids is changed into coagulant.","chinese":"在本文中粉煤灰經酸處理後，製得混凝劑。"},{"english":"The treatment of waste dyeing water by high-efficient coagulating agent was studied.","chinese":"採用高效混凝劑對印染廢水處理進行了探討。"},{"english":"Aluminum salt coagulant is the most widely applied inorganic salt coagulant.","chinese":"鋁鹽混凝劑是應用最爲廣泛的無機鹽類混凝劑。"},{"english":"Aluminum salt coagulant is the most widely applied inorganic salt coagulant.","chinese":"鋁鹽混凝劑是應用最爲廣泛的無機鹽類混凝劑。"},{"english":"Study on the high effective inorganic polymer coagulant polysilicate ferric aluminum.","chinese":"高效無機混凝劑聚矽酸鐵鋁的研究。"}],"related":[]}