{"definition":["hybrid"],"pinyin":["hun4 he2 ti3"],"simplified":["混合体"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"混合體","characters":[{"definition":["confused\/dirty\/to mix\/muddy\/variant of 渾|浑[hun2]","to mix\/to mingle\/muddled\/to drift along\/to muddle along\/to pass for\/to get along with sb\/thoughtless\/reckless"],"pinyin":["hun2","hun4"],"word":"混"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[],"sentences":[{"english":"Traditionally, soap was a mix of animal fatsfruit or vegetable oils. This combination has a high PHis drying to skin, particularly to aging skin.","chinese":"傳統上，香皂是動物脂肪和水果油或植物油的混合體。"},{"english":"It is beyond argument that every human being is a composite of good and evil.","chinese":"每個人都是善與惡的混合體，這是無可爭辯的事實。"},{"english":"It is the mixture of the politics between transcendentalism and experientialism.","chinese":"政治理念本身是一個先驗性和經驗性的混合體。"},{"english":"This clip is a mixture of a variety of intros.","chinese":"這個電影片段是一個包含多樣介紹的混合體。"},{"english":"The Ainu look like a mixture of Asian and Caucasian.","chinese":"阿伊努人長得像亞洲人和高加索人的混合體。"},{"english":"As Pell sees it, what Nekton does is a blend of art and science.","chinese":"對他而言，耐頓就是藝術和科學的混合體。"},{"english":"The gas-liquid mixture enters the gas-liquid separation chamber through the diffusion tube.","chinese":"氣液混合體通過廓張管進入氣液回到儲液室。"},{"english":"The empirical evidence for the PHH is at best mixed.","chinese":"環境避難所假說的實證充其量就是個混合體。"},{"english":"Vinicius is a mix of different Brazilian animals.","chinese":"維尼修斯是多種巴西動物的混合體。"},{"english":"Thus, Japanese, is a combination f Chinese and kana.","chinese":"日語就是漢字與假名的混合體。"},{"english":"It resembled a cross between a lunatic asylum and a cotton mill.","chinese":"它像是瘋人院和棉紡織廠的混合體。"},{"english":"The vice-presidency is a hybrid of administrative and legislative offices.","chinese":"這種新的政體是一種總統和議會制度的混合體。"},{"english":"Druids are interesting because they're a mix between a spellcaster type and a warrior type.","chinese":"DRU很有趣因爲他們是一個施法者和戰士的混合體。"},{"english":"McFly's early sound was a mixture of pop and rock.","chinese":"McFly早期風格屬於pop和rock混合體。"},{"english":"OJ Mayo is equal parts ice and fire.","chinese":"梅奧是冰和火的混合體。"},{"english":"That’s a cultural cocktail bound to produce achievement in many spheres.","chinese":"這種文化的混合體必然能在許多領域產生巨大成就。"}],"related":[{"definition":["nature (i.e. properties of sth)\/character"],"pinyin":["xing4 zhuang4"],"word":"性狀"},{"definition":["lit. you hoodwink me and I cheat you (idiom); fig. mutual deception\/each tries to outwit the other\/dog eats dog and devil take the hindmost"],"pinyin":["er3 yu2 wo3 zha4"],"word":"爾虞我詐"},{"definition":["biochemistry"],"pinyin":["sheng1 hua4 xue2"],"word":"生化學"},{"definition":["(idiom) impossible to fault\/impeccable"],"pinyin":["wu2 xie4 ke3 ji1"],"word":"無懈可擊"},{"definition":["hard to distinguish real from imitation"],"pinyin":["zhen1 jia3 nan2 bian4"],"word":"真假難辨"},{"definition":["perfect and without blemish\/flawless\/to leave nothing to be desired"],"pinyin":["wan2 mei3 wu2 que1"],"word":"完美無缺"},{"definition":["lit. one body two sides (idiom)\/fig. a situation with two sides to it"],"pinyin":["yi1 ti3 liang3 mian4"],"word":"一體兩面"},{"definition":["a crystal"],"pinyin":["jie2 jing1 ti3"],"word":"結晶體"},{"definition":["organism"],"pinyin":["sheng1 wu4 ti3"],"word":"生物體"},{"definition":["properly\/satisfactorily\/firmly\/very fitting\/appropriate\/proper\/to be in good order\/also written 妥帖"],"pinyin":["tuo3 tie1"],"word":"妥貼"},{"definition":["chemical reaction"],"pinyin":["hua4 xue2 fan3 ying4"],"word":"化學反應"},{"definition":["suffix"],"pinyin":["ci2 wei3"],"word":"詞尾"},{"definition":["not care about one's appearance (idiom)\/slovenly in dress and manner"],"pinyin":["bu4 xiu1 bian1 fu2"],"word":"不修邊幅"},{"definition":["morphology (in biology or linguistics)"],"pinyin":["xing2 tai4 xue2"],"word":"形態學"},{"definition":["...-shaped thing (suffix)"],"pinyin":["zhuang4 wu4"],"word":"狀物"},{"definition":["trite\/clichéd\/empty and trite\/banality\/platitude"],"pinyin":["chen2 fu3"],"word":"陳腐"}]}