{"definition":["to infiltrate\/to sneak into"],"pinyin":["hun4 jin4"],"simplified":["混进"],"rank":29620.0,"normalized_rank":0.4144222293733298,"fraction":9.713351291392969e-7,"cumulative_fraction":0.9898781015622402,"word":"混進","characters":[{"definition":["confused\/dirty\/to mix\/muddy\/variant of 渾|浑[hun2]","to mix\/to mingle\/muddled\/to drift along\/to muddle along\/to pass for\/to get along with sb\/thoughtless\/reckless"],"pinyin":["hun2","hun4"],"word":"混"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[],"sentences":[{"english":"The spy wormed in the meeting-place.","chinese":"奸細混進了會場。"},{"english":"It means to mix it with inferior substances.","chinese":"就是把品質低劣的東西混進去。"},{"english":"The thief got into the house by masquerading as a television repairman.","chinese":"竊賊裝成電視修理工混進了房子。"},{"english":"The atmosphere became even more difficult when a group of dissident directors were put into the board mix.","chinese":"當一個異議者混進了董事會，這種情況變得更加艱難。"},{"english":"A painter tempers his colours by mixing them with oil.","chinese":"畫家把顏料混進油裏來調色。"},{"english":"so the demon blends in with the spread-open newspaper.","chinese":"鋪開的報紙裏混進了魔鬼。"},{"english":"You can mix the glycerin back in when you make soap.","chinese":"當你做肥皂的時候你可以再把它們混進去。"},{"english":"Damema assisted him to join a teaching session but still he got kicked out by Marpa.","chinese":"師母幫他混進別人求法的教學裏，還是被趕了出去。"},{"english":"He managed to join the band, though he was not good at it.","chinese":"儘管他不擅長吹竽，還是設法混進了樂隊。"},{"english":"We should not be overcautious or too afraid of reactionaries sneaking in.","chinese":"不要畏首畏尾，懼怕反動分子混進來。"},{"english":"Don't let any non-members worm in.","chinese":"別讓非會員混進來。"},{"english":"He went into the ballroom in disguise.","chinese":"他喬裝打扮了一下就混進了舞廳。"},{"english":"Shi Dong pretends to be convict infiltrate month the jail of 44 heavenly bodies, desire filch helicopter.","chinese":"史東冒充囚犯混進月四四星球的監獄，欲竊取直升機。"},{"english":"Strong winds pick up the loose dust and dirt, mixing them with industrial pollution.","chinese":"大風捲起了鬆散的塵沙，並混進了工業污染物。"},{"english":"If you creep in, please don't let it show.","chinese":"如果你想在外面偷偷混進來，請不要讓人知道。"},{"english":"In weeks, LeiYuan know the location of explosive in the winery.","chinese":"混進周家，雷遠知道了炸藥的存放位置，就在酒廠。"}],"related":[]}