{"definition":["peaceful\/quiet\/tranquil\/purified of defiling illusion (Buddhism)"],"pinyin":["qing1 jing4"],"simplified":["清净"],"rank":24501.0,"normalized_rank":0.34280077791613617,"fraction":0.0000015530559721840964,"cumulative_fraction":0.9835348347256914,"word":"清淨","characters":[{"definition":["Qing or Ch'ing dynasty of imperial China (1644-1911)\/surname Qing","clear\/distinct\/quiet\/just and honest\/pure\/to settle or clear up\/to clean up or purge"],"pinyin":["Qing1","qing1"],"word":"清"},{"definition":["clean\/completely\/only\/net (income, exports etc)\/(Chinese opera) painted face male role"],"pinyin":["jing4"],"word":"淨"}],"containing_words":[{"definition":["lit. ears pure and peaceful (idiom)\/to stay away from the filth and unrest of the world"],"pinyin":["er3 gen1 qing1 jing4"],"word":"耳根清淨"}],"sentences":[{"english":"Unique peace and quiet dispersant and antioxidant.","chinese":"獨特的清淨分散劑和抗氧化劑。"},{"english":"Keep the mind pure and undefiled. Remain calm and serene always.","chinese":"守住清淨無爲的心，讓心時時寂靜。"},{"english":"All sentient beings have the ability to realize and actualize the Dharma, a completely pure state of being.","chinese":"所有衆生皆可證入法，那樣的境界是完全清淨的。"},{"english":"If with a pure mind a person speaks or acts, happiness follows him like his never-departing shadow.","chinese":"若人以清淨之心言行，快樂將跟隨着他，如影隨形。"},{"english":"Mody? We must maintain an integrity of nature and a pure heart.","chinese":"麼？我們一定要保有一顆完整的本性和一顆清淨的心。"},{"english":"Learn to develop pure and unconditional love;","chinese":"要培養一分清淨無染的愛。"},{"english":"When a meditator has gained deep concentration of mind, his mind is purified.","chinese":"當修行者獲得較深的定力時，他的心變得清淨。"},{"english":"In his library he had been always sure of leisure and tranquillity ;","chinese":"他平常待在書房裏就是爲了要圖個悠閒清淨。"},{"english":"The Buddhas or Tathagatas abandon every possible fault or obscuration and then, through their great realizations, achieve the pure vision.","chinese":"佛就是淨除了一切過失或無明以大智慧證得清淨之見。"},{"english":"Especialy it helps to raise clarifying effect and economic efficiency.","chinese":"對於提高清淨效果和經濟效益具有一定作用。"},{"english":"The experiments of using chitosan flocculant in syrup floating purification of the afination raw sugar is introduced in this paper.","chinese":"用殼聚糖絮凝劑對復篩原糖漿進行氣浮清淨試驗。"},{"english":"I want to go back when it's quieter \/ I want to go back when it's quieter.","chinese":"我想等它清淨一些的時候再去看看。"},{"english":"The foaming properties of metallic detergents in different internal-combustion engine oils were mainly studies.","chinese":"金屬清淨劑在不同的基礎油中抗泡性能各不相同。"},{"english":"The number is equal to about two-thirds of the world's population, leaving few corners of the globe where public spaces are free of mobile-tethered babblers.","chinese":"整個世界的公共空間只有少數幾個角落是清淨的了。"},{"english":"I want to go back when it is quieter.","chinese":"我想等它清淨一些的時候再去看看。"},{"english":"At the same time release me from my sorrow, who have lived in perfect wholesomeness .","chinese":"同時讓我這個身心清淨者解脫悲傷。"}],"related":[{"definition":["all living things"],"pinyin":["zhong4 sheng1"],"word":"眾生"},{"definition":["quiet\/peaceful and quiet"],"pinyin":["qing1 jing4"],"word":"清靜"},{"definition":["tathagata (Buddha's name for himself, having many layers of meaning - Sanskrit: thus gone, having been Brahman, gone to the absolute etc)"],"pinyin":["ru2 lai2"],"word":"如來"},{"definition":["Bodhisattva (Buddhism)"],"pinyin":["Pu2 sa4"],"word":"菩薩"},{"definition":["to vow"],"pinyin":["fa1 yuan4"],"word":"發願"},{"definition":["solemn\/dignified\/stately"],"pinyin":["zhuang1 yan2"],"word":"莊嚴"},{"definition":["(Buddhism) Pure Land, usually refers to Amitabha Buddha's Western Pure Land of Ultimate Bliss (Sukhavati in Sanskrit)"],"pinyin":["Jing4 tu3"],"word":"淨土"},{"definition":["actual situation\/the ultimate essence of things (Buddhism)"],"pinyin":["shi2 xiang4"],"word":"實相"},{"definition":["to instruct (novices)\/to preach\/to teach\/to reveal"],"pinyin":["kai1 shi4"],"word":"開示"},{"definition":["gate to enlightment (Buddhism)\/Buddhism\/way\/method\/(old) south gate of a palace"],"pinyin":["fa3 men2"],"word":"法門"},{"definition":["Anning District of Lanzhou City 蘭州市|兰州市[Lan2 zhou1 Shi4], Gansu\/Anning City, to the west of Kunming 昆明[Kun1 ming2], Yunnan","peaceful\/tranquil\/calm\/composed\/free from worry"],"pinyin":["An1 ning2","an1 ning2"],"word":"安寧"},{"definition":["to untie\/to free\/to absolve of\/to get free of\/to extirpate oneself\/(Buddhism) to free oneself of worldly worries"],"pinyin":["jie3 tuo1"],"word":"解脫"},{"definition":["anatta (Buddhist concept of \"non-self\")"],"pinyin":["wu2 wo3"],"word":"無我"},{"definition":["to become enlightened (Buddhism)"],"pinyin":["kai1 wu4"],"word":"開悟"},{"definition":["the Three Precious Treasures of Buddhism, namely: the Buddha 佛, the Dharma 法 (his teaching), and the Sangha 僧 (his monastic order)"],"pinyin":["san1 bao3"],"word":"三寶"},{"definition":["still\/calm\/quiet\/not moving"],"pinyin":["jing4"],"word":"靜"}]}