{"definition":["to clear up\/to tidy up\/to dispose of"],"pinyin":["qing1 li3"],"simplified":["清理"],"rank":2738.0,"normalized_rank":0.03830817231681894,"fraction":0.00005364517211786459,"cumulative_fraction":0.7774210646591121,"word":"清理","characters":[{"definition":["Qing or Ch'ing dynasty of imperial China (1644-1911)\/surname Qing","clear\/distinct\/quiet\/just and honest\/pure\/to settle or clear up\/to clean up or purge"],"pinyin":["Qing1","qing1"],"word":"清"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"}],"containing_words":[{"definition":["to purge the ranks"],"pinyin":["qing1 li3 dui4 wu3"],"word":"清理隊伍"}],"sentences":[{"english":"Test, tweak, rinse and repeat until you succeed.","chinese":"在你成功之前，測試，調節，清理和重做。"},{"english":"II. 199 foreign business invested commercial enterprises need to make rectifications after sorting out.","chinese":"經過清理需要進行整改的外商投資商業企業199家。"},{"english":"The manual said it was self-cleaning.","chinese":"使用手冊上說它是自動清理的。"},{"english":"Clean up any beads of mercury by using an index card and plastic dustpan.","chinese":"用撲索引卡和塑料簸箕清理水銀珠子。"},{"english":"The glass also must be cleaned after each scan.","chinese":"每次掃描後，還得清理玻璃板。"},{"english":"It is the collapsing of the Expander that triggers the Adorer clean up code.","chinese":"這是崩潰的膨脹觸發崇拜者清理代碼。"},{"english":"Eating utensils and food trays are cleaned at the hygiene station with premoistened towelettes.","chinese":"就餐器具和食物盤在衛生站用預先弄溼的小毛巾清理。"},{"english":"After dinner, the table is cleared and moved outside and mattresses laid down.","chinese":"晚餐後矮桌清理乾淨並移到外面，地上鋪上了牀墊。"},{"english":"Clean the bearings, or replace them if worn out.","chinese":"清理軸承，如果已經用壞，請更換新軸承。"},{"english":"What if a hurricane comes along and obliterates the dunes entirely?","chinese":"如果刮來一場颶風把沙丘都清理乾淨了怎麼辦？"},{"english":"Two downtown Portland parks where Occupy Portland demonstrators camped for weeks are clear Monday and police say crews will be removing debris and assessing damage.","chinese":"波特蘭兩個示威者宿營的城市公園在週一得到了清理。"},{"english":"Next you should clean up the hard disk.","chinese":"接著你應該清理硬碟。"},{"english":"Police then rushed to the scene to sort out the horse and Luo Tuoqing meeting place.","chinese":"警方隨後趕赴現場將馬和駱駝清理出集會場所。"},{"english":"From now onwards will focus on sprucing up village land violations.","chinese":"從即日起保定市將集中清理各種土地違法行爲。"},{"english":"The presence of rough surfaces or ledges make the room difficult to clean.","chinese":"粗糙的表面或壁架的存在使房間很難清理。"},{"english":"Maintenance and clean-up work after building is also essential to constructions.","chinese":"建後維護及清理工作對建築來說也十分必要。"}],"related":[{"definition":["to clear away\/to eliminate\/to get rid of"],"pinyin":["qing1 chu2"],"word":"清除"},{"definition":["to tidy up\/to mop up\/a sweep (against crime)"],"pinyin":["qing1 sao3"],"word":"清掃"},{"definition":["to wash\/to clean\/to purge"],"pinyin":["qing1 xi3"],"word":"清洗"},{"definition":["junk\/items of no value\/various bits and bobs"],"pinyin":["za2 wu4"],"word":"雜物"},{"definition":["trash\/refuse\/garbage\/(coll.) of poor quality\/Taiwan pr. [le4 se4]"],"pinyin":["la1 ji1"],"word":"垃圾"},{"definition":["clean\/to clean"],"pinyin":["qing1 jie2"],"word":"清潔"},{"definition":["to pile up\/to heap\/accumulation"],"pinyin":["dui1 ji1"],"word":"堆積"},{"definition":["to clear\/to empty"],"pinyin":["qing1 kong1"],"word":"清空"},{"definition":["to fall\/to drop\/to lag behind\/to lose\/to go missing\/to reduce\/fall (in prices)\/to lose (value, weight etc)\/to wag\/to swing\/to turn\/to change\/to exchange\/to swap\/to show off\/to shed (hair)\/(used after certain verbs to express completion, fulfillment, removal etc)"],"pinyin":["diao4"],"word":"掉"},{"definition":["to mend"],"pinyin":["xiu1 bu3"],"word":"修補"},{"definition":["to tear down\/to demolish\/to dismantle\/to remove"],"pinyin":["chai1 chu2"],"word":"拆除"},{"definition":["to clog up\/blockage"],"pinyin":["du3 se4"],"word":"堵塞"},{"definition":["to tidy up\/to reorganize\/to consolidate\/to rectify"],"pinyin":["zheng3 dun4"],"word":"整頓"},{"definition":["to stockpile"],"pinyin":["ji1 cun2"],"word":"積存"},{"definition":["to rinse\/to wash\/to develop (photographic film)"],"pinyin":["chong1 xi3"],"word":"沖洗"},{"definition":["to remain\/left over\/surplus\/remnant"],"pinyin":["can2 liu2"],"word":"殘留"}]}