{"definition":["meiosis (in sexual reproduction)"],"pinyin":["jian3 shu4 fen1 lie4"],"simplified":["减数分裂"],"rank":62902.0,"normalized_rank":0.8800805898730989,"fraction":2.510815182025233e-8,"cumulative_fraction":0.9999107701537456,"word":"減數分裂","characters":[{"definition":["to lower\/to decrease\/to reduce\/to subtract\/to diminish"],"pinyin":["jian3"],"word":"減"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["to split\/to crack\/to break open\/to rend"],"pinyin":["lie4"],"word":"裂"}],"containing_words":[],"sentences":[{"english":"The position of the centromere and the behavior of chromosomes during meiosis also important.","chinese":"着絲粒的位置和染色體在減數分裂中的行爲也很重要。"},{"english":"Bivalent Describing any pair of homologous chromosomes when they pair up during MEIOSIS.","chinese":"在減數分裂中配對時的任意一對同源染色體。"},{"english":"Meiosis of microspore mother cells is synchronous or unsynchronous.","chinese":"小孢子母細胞減數分裂同步或不同步。"},{"english":"The megaspore mother cell meiosis to form a linear megaspore tetrad.","chinese":"大孢子母細胞減數分裂產生直線形大孢子四分體。"},{"english":"The nucleus in shrinking cytoplasm of microspore mother cell enters into telophase . 17.","chinese":"收縮的小孢子母細胞質中核進入減數分裂末期。"},{"english":"Successive cytokinesis in the megasporocyte follows meiosis and the megaspore tetrads are linear.","chinese":"大孢子母細胞減數分裂形成直線型四分體。"},{"english":"Apospory, aposporous The development of a gametophyte directly from a sporophyte without the occurrence of meiosis or spore formation.","chinese":"不經過減數分裂形成孢子，而直接形成配子體。"},{"english":"The result of this process is sperm cells ready to fuse with an egg.","chinese":"減數分裂的結果就是使精子細胞和卵細胞結合。"},{"english":"The cytokinesis of PMCs conforms to simultaneous type.","chinese":"小孢子母細胞減數分裂爲同時型。"},{"english":"Objective: To determine the effect of methylbenzene on meiosis of spermatocyte from mouse testis.","chinese":"目的探討甲苯對小鼠精母細胞減數分裂的影響。"},{"english":"Prophase --- The first stage of cell division, during which the chromosomes become visible as discrete structures and subsequently thicken and shorten.","chinese":"細胞有絲分裂或減數分裂的第一個階段。"},{"english":"The nucleus in shrinking cytoplasm of microspore mother cell enters into diakinesis stage. 16.","chinese":"收縮的小孢子母細胞中核進入減數分裂終變期。"},{"english":"Synapsis before meiosis is restricted by PH genes.","chinese":"PH基因制約減數分裂前染色體的聯會。"},{"english":"A second meiotic division, followed by development of the embryo, takes place if the egg is fertilized .","chinese":"如果卵受精，那麼第二次減數分裂伴隨胚胎的發育。"},{"english":"The roles of somatic meiosis-like reduction in the somatic embryogenesis and somaclonal variations were discussed.","chinese":"經體細胞類減數分裂產生的細胞都發生染色體重組。"},{"english":"The meiosis is highly synchronous.","chinese":"減數分裂同步率較高。"}],"related":[]}