{"definition":["Bohai Bay"],"pinyin":["Bo2 hai3 wan1"],"simplified":["渤海湾"],"rank":25120.0,"normalized_rank":0.3514613910147888,"fraction":0.000001463279731664008,"cumulative_fraction":0.984467456296232,"word":"渤海灣","characters":[{"definition":["same as 渤海[Bo2 Hai3], Bohai Sea between Liaoning and Shandong\/Gulf of Zhili or Chihli"],"pinyin":["Bo2"],"word":"渤"},{"definition":["ocean\/sea\/CL:個|个[ge4],片[pian4]\/great number of people or things\/(dialect) numerous","surname Hai"],"pinyin":["Hai3","hai3"],"word":"海"},{"definition":["bay\/gulf\/to cast anchor\/to moor (a boat)"],"pinyin":["wan1"],"word":"灣"}],"containing_words":[{"definition":["Bohai Economic Rim (economic region including Beijing, Tianjin, Hebei, Liaoning and Shandong)"],"pinyin":["Huan2 Bo2 hai3 Wan1 Di4 qu1"],"word":"環渤海灣地區"}],"sentences":[{"english":"The slope belts of rifted lacustrine basin in Bohai Bay Basin are very important for hydrocarbon accumulation.","chinese":"渤海灣盆地斷陷湖盆的斜坡帶是油氣聚集的重要場所。"},{"english":"Tianjin is a major trade center with connection to seaports on the Bohai Gulf.","chinese":"天津坐擁渤海灣的海港，是主要的貿易中心。"},{"english":"Bohaiwan basin features the alter nations of thinning and thickening of lithospherical mantle.","chinese":"渤海灣盆地則以岩石圈地幔減薄與增厚波動爲特徵。"},{"english":"Zhuanghai district is located in the south of neritic area in Bohai gulf.","chinese":"摘要樁海地區位於濟陽坳陷渤海灣南部極淺海地區。"},{"english":"The waters of eastern Bohai Straits is the only route for vessels entering or leaving Bohai Sea Gulf.","chinese":"渤海海峽以東海域是船舶進出渤海灣的必經之路。"},{"english":"The Bohai oil province is a part of the Bohai bay nonmarine rift basin.","chinese":"渤海油區是渤海灣陸相裂谷盆地的一部分。"},{"english":"Tanggu is a shining pearl over the Bohai Bay.","chinese":"塘沽是渤海灣上的一顆璀璨的明珠。"},{"english":"The dinoflagellates abundance is high in the northern Bohai Gulf.","chinese":"浮游甲藻在渤海灣北部存在高值區。"},{"english":"Multistage reservoir? forming of complex fault blocks is a major feature of petroleum geology in Bohaiwan basin.","chinese":"複雜斷塊多期成藏是渤海灣盆地石油地質的一大特點。"},{"english":"You'll enjoy the special Sea-food of Bohai Bay.","chinese":"渤海灣特有的海鮮更是讓您一飽口福。"},{"english":"Haixing lies on the coast of the Bohai Sea.","chinese":"海興位於渤海灣沿岸。"},{"english":"Colorful sea water on the stony beach of Rizhao, Shandong, PRC.","chinese":"渤海灣多彩的海水，山東日照。"}],"related":[]}