{"definition":["to measure temperature"],"pinyin":["ce4 wen1"],"simplified":["测温"],"rank":37447.0,"normalized_rank":0.5239321142249521,"fraction":4.868353855845438e-7,"cumulative_fraction":0.9953796749782249,"word":"測溫","characters":[{"definition":["to survey\/to measure\/to conjecture"],"pinyin":["ce4"],"word":"測"},{"definition":["surname Wen","warm\/lukewarm\/temperature\/to warm up\/mild\/soft\/tender\/to review (a lesson etc)\/fever (TCM)\/old variant of 瘟[wen1]"],"pinyin":["Wen1","wen1"],"word":"溫"}],"containing_words":[],"sentences":[{"english":"The thermistor unbalanced bridge is widely used in temperature measuring circuits.","chinese":"不平衡電橋在熱敏電阻測溫電路中應用十分廣泛。"},{"english":"The temperature measurement using neutron resonance spectrum has many advantages comparing traditional techniques of temperature measurement.","chinese":"中子共振測溫與傳統的測溫技術相比，具有很多優勢。"},{"english":"The temperature measurement using neutron resonance spectrum has many advantages comparing traditional techniques of temperature measurement.","chinese":"中子共振測溫與傳統的測溫技術相比，具有很多優勢。"},{"english":"Resistance temperature sensor makes temperature setting more accurate, safe and hygienic.","chinese":"電阻式測溫棒使溫度設定更精準，更安全衛生。"},{"english":"Effects of the medium in radiation transmitting path on infrared thermometry have been analyzed.","chinese":"分析了幅射傳遞通道中的介質對紅外測溫的影響。"},{"english":"Spectro-balance thermometry method is a new approach for the noncontact measurement of temperature.","chinese":"調譜平衡測溫法是一種新的非接觸測溫方法。"},{"english":"Spectro-balance thermometry method is a new approach for the noncontact measurement of temperature.","chinese":"調譜平衡測溫法是一種新的非接觸測溫方法。"},{"english":"A new characteristie equation for radiation thermometers has been put forward in this paper.","chinese":"本文提出輻射測溫的一種簡單線性化公式。"},{"english":"Moreover, a detailed discussion is made on the flaw due to applying separable components or elements to thermometric systems for vacuum metallurgy plant.","chinese":"詳細論述了真空爐測溫系統用分立元件法檢定弊端。"},{"english":"The measurement results show that it is avaliable for the system of pyroelectric infrared measuring temperature to realize practional utilization.","chinese":"測試結果表明，熱釋電紅外測溫系統有望實現實用化。"},{"english":"Measures to be taken in infrared measurement at the soaking section of a reheating furnace are put introduced through actual examples.","chinese":"通過實例介紹了加熱爐均熱段紅外測溫應採取的措施。"},{"english":"They have a comparison, analysis and calculation to different radiant temperature measuring meter.","chinese":"對不同類型的輻射測溫計進行了比較分析計算。"},{"english":"Temperature measurement by laser is an advanced method for measuring temperature.","chinese":"激光測溫是一種先進的溫度測量方法。"},{"english":"The circuit of measuring temperature in the automatic vacuum calorimeter is improved.","chinese":"對自動真空量熱儀的測溫電路進行了改進。"},{"english":"The forehead thermometer is much easier to use.","chinese":"這個前額測溫的體溫計愈加便當運用。"},{"english":"The origin of the deposit explored by using the microprobe, inclusion thermometry. isotope assay etc. is also discussed.","chinese":"利用包體測溫及同位素等測試資料探討了礦牀成因。"}],"related":[]}