{"definition":["to bring together\/to make do in a bad situation\/to just get by\/to improvise\/passable\/not too bad"],"pinyin":["cou4 he5"],"simplified":["凑合"],"rank":23894.0,"normalized_rank":0.3343080603864396,"fraction":0.0000016368471300028454,"cumulative_fraction":0.9825658437052844,"word":"湊合","characters":[{"definition":["to gather together, pool or collect\/to happen by chance\/to move close to\/to exploit an opportunity"],"pinyin":["cou4"],"word":"湊"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"}],"containing_words":[],"sentences":[{"english":"Knowing your own darkness is the best method for dealing with the darknesses of other people.","chinese":"理解自身的陰暗，是湊合他人陰暗一面的最好辦法。"},{"english":"There are so much variety that you never have to do with the second best.","chinese":"物品品種繁多，從來不必用二等品來湊合。"},{"english":"Chen Chen said, benefit also assembles, for a car to earn one thousand or two thousand.","chinese":"陳晨說，效益還湊合，辦理一輛車掙一兩千。"},{"english":"She'll make do with the old typewriter until the new one arrives.","chinese":"新打字機到之前她將湊合着用舊的。"},{"english":"I forgot the words of my speech, so I had to improvise .","chinese":"我忘了我的演講詞，所以我只得臨時湊合。"},{"english":"We threw together a meal out of leftovers.","chinese":"我們用剩菜剩飯匆匆湊合了一頓飯。"},{"english":"He overwhelmed so many of his opponents alone. Hers really something.","chinese":"他實了不訖，居然一個人湊合了這麼多的對手。"},{"english":"There is so much variety thatyou never have to make do with second best.","chinese":"物品種繁多，從來不必用二等品來湊合。"},{"english":"I think this is a feature that \"just works\" as I am not aware of JetBrains having worked on specific SCA integration.","chinese":"我認爲這僅僅是一種“湊合用”的特性。"},{"english":"They pieced out a meal from leftovers.","chinese":"他們用剩飯剩菜湊合成一頓飯。"},{"english":"I can make this padded jacket do for another winter.","chinese":"我這件棉襖湊合着還能穿一冬。"},{"english":"A tube cutter works best but you can use a hacksaw.","chinese":"最好用截管器，不過用鋼鋸也能湊合。"},{"english":"We can sleep on the beach. I don't mind roughing it for a night or two.","chinese":"我們可以在海邊睡覺，我不介意湊合著睡個一兩晚。"},{"english":"The rain, colors, and contrast just brought it all together.","chinese":"雨，色彩，對比度剛巧湊合地在一起。"},{"english":"He has not much money,but he rubs along all right.","chinese":"他沒有很多的錢，可是他可以湊合着過日子。"},{"english":"There is so much variety that you never have to make do with second best.","chinese":"物品品種繁多，從來不必用二等品來湊合。"}],"related":[{"definition":["to live one's life\/to pass one's days\/to get along"],"pinyin":["guo4 ri4 zi5"],"word":"過日子"},{"definition":["there is nothing to be done\/one can't do anything about it"],"pinyin":["mei2 ban4 fa3"],"word":"沒辦法"},{"definition":["as one wishes\/as one pleases\/at random\/negligent\/casual\/wanton"],"pinyin":["sui2 bian4"],"word":"隨便"},{"definition":["to say again\/to put off a discussion until later\/moreover\/what's more\/besides"],"pinyin":["zai4 shuo1"],"word":"再說"},{"definition":["to accept (a bit reluctantly)\/to put up with"],"pinyin":["jiang1 jiu5"],"word":"將就"},{"definition":["not bad\/tolerable\/fortunately"],"pinyin":["hai2 hao3"],"word":"還好"},{"definition":["we or us (including both the speaker and the person(s) spoken to)\/(dialect) I or me\/(dialect) (in a coaxing or familiar way) you\/also pr. [za2 men5]"],"pinyin":["zan2 men5"],"word":"咱們"},{"definition":["easy to deal with\/not a problem\/(polite answer) you flatter me"],"pinyin":["hao3 shuo1"],"word":"好說"},{"definition":["to give it a try"],"pinyin":["shi4 shi4 kan4"],"word":"試試看"},{"definition":["to be indifferent\/not to matter\/cannot be said to be"],"pinyin":["wu2 suo3 wei4"],"word":"無所謂"},{"definition":["still\/still in progress\/still more\/yet\/even more\/in addition\/fairly\/passably (good)\/as early as\/even\/also\/else","surname Huan","to pay back\/to return"],"pinyin":["Huan2","hai2","huan2"],"word":"還"},{"definition":["incorrect\/wrong\/amiss\/abnormal\/queer"],"pinyin":["bu4 dui4"],"word":"不對"},{"definition":["a modal particle indicating (don't mind it, ok)","a modal particle indicating (that's all, only, nothing much)"],"pinyin":["ba4 le5","ba4 liao3"],"word":"罷了"},{"definition":["ready-made\/readily available"],"pinyin":["xian4 cheng2"],"word":"現成"},{"definition":["occasionally\/once in a while\/sometimes"],"pinyin":["ou3 er3"],"word":"偶爾"},{"definition":["dull\/vapid\/colorless"],"pinyin":["wu2 qu4"],"word":"無趣"}]}