{"definition":["to scrape together enough (people, money etc)"],"pinyin":["cou4 zu2"],"simplified":["凑足"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"湊足","characters":[{"definition":["to gather together, pool or collect\/to happen by chance\/to move close to\/to exploit an opportunity"],"pinyin":["cou4"],"word":"湊"},{"definition":["excessive","foot\/to be sufficient\/ample"],"pinyin":["ju4","zu2"],"word":"足"}],"containing_words":[],"sentences":[{"english":"We still need $ 5 to make up the sum we asked for.","chinese":"我們還需要5美元才能湊足我們所需要的數目。"},{"english":"A: We can‘t split open a case to fill your order .","chinese":"因爲我們不能拆箱來湊足你的訂量。"},{"english":"Funds were found and, armed with a wealth of enthusiasm, mother and daughter started out.","chinese":"資金終於湊足，懷着滿腔熱忱，母女倆出發了。"},{"english":"B:You bet,as long as I can collect enough money.","chinese":"當然想，只要能湊足錢。"},{"english":"They made up a four at tennis.","chinese":"他們湊足了四個人來打網球。"},{"english":"You bet, as long as I can collect enough money.","chinese":"只要能湊足錢款，我當然願意。"},{"english":"Because want happen by chance sufficient this word number or the theme that want more abstruse place.","chinese":"因爲要湊足這字數還是要比較深奧點的主題。"},{"english":"We need one more player to make up a team.","chinese":"我們再需要一名隊員就能湊足一個球隊。"},{"english":"But it is very difficult to gather a team of players together.","chinese":"但是要湊足一隊球員是很難的。"},{"english":"Don't wait until you have all the money needed before you start taking steps towards starting a business.","chinese":"不要等到你湊足所有的資金纔開始你的商業投資。"},{"english":"We finally dug up enough money for a computer.","chinese":"我們終於湊足了買電腦的錢。"},{"english":"A: We can't split open a case to fill your","chinese":"因爲我們不能拆箱來湊足你的訂量。"},{"english":"Now call on others to sing K, even one in the box who can not gather sufficient.","chinese":"現在請別人去唱K，連一箇中包廂的人也無法湊足。"},{"english":"Some actors recognised him and raised enough money to get him back on the tour.","chinese":"有一些演員認出了他，並湊足了錢讓他回到了巡迴賽。"}],"related":[]}