{"definition":["to raise enough money to do sth\/to pool money\/to club together (to do sth)"],"pinyin":["cou4 qian2"],"simplified":["凑钱"],"rank":30427.0,"normalized_rank":0.42571320638562815,"fraction":9.08418771961804e-7,"cumulative_fraction":0.9906368636332128,"word":"湊錢","characters":[{"definition":["to gather together, pool or collect\/to happen by chance\/to move close to\/to exploit an opportunity"],"pinyin":["cou4"],"word":"湊"},{"definition":["coin\/money\/CL:筆|笔[bi3]\/unit of weight, one tenth of a tael 兩|两[liang3]","surname Qian"],"pinyin":["Qian2","qian2"],"word":"錢"}],"containing_words":[],"sentences":[{"english":"The family clubbed together to buy the car.","chinese":"全家人湊錢買了這部小汽車。"},{"english":"We all pitched in to buy this gift .","chinese":"這是我們大夥湊錢給您買的禮物。"},{"english":"We did a whip-round to buy her a present.","chinese":"我們湊錢給她買了份禮物。"},{"english":"They pooled their money to buy a van.","chinese":"他們湊錢買了輛搬運車。"},{"english":"We are going to make a collection to buy flowers for Janet, who is ill in the hospital.","chinese":"我們打算湊錢給珍妮特買花，她已住進醫院。"},{"english":"We clubbed together to buy our teacher a present.","chinese":"我們湊錢給老師買了件禮物。"},{"english":"The explorers pooled their resources and bought a boat by which they began to search for the source of the river.","chinese":"探險家們湊錢買了條船，並憑此開始勳章河流的源頭。"},{"english":"In the second problem the two groups had to club together to pay for the movie they wanted to watch.","chinese":"在第二個問題中，兩組人需要一起湊錢去看一場電影。"},{"english":"Everybody chipped in to buy the teacher a gold watch when he retired.","chinese":"老師退休的時候，大家湊錢給他買了塊金錶。"},{"english":"The students clubbed together to buy their teacher a present.","chinese":"學生們湊錢給他們的老師買了件禮物。"},{"english":"The office chipped in and sided with us.","chinese":"辦公室湊錢，支持我們。"},{"english":"Just like classmates across the country, they all chipped in to buy a classmate a birthday gift.","chinese":"和全國一樣，他們湊錢給同班同學買了一份生日禮物。"},{"english":"Yun-shen working partners to raise money to help them, chipped in to help gathering pace to complete the operation.","chinese":"雲生的工作夥伴們集資相助，湊錢幫助雲生完成手術。"},{"english":"Letwouls ingl chip in and get Phil a retirement gift.","chinese":"讓我們一起湊錢給菲爾買一件退休禮物吧。"}],"related":[]}