{"definition":["to spill\/to overflow (of water, crowds)\/to crowd (into a space)"],"pinyin":["yong3 jin4"],"simplified":["涌进"],"rank":20254.0,"normalized_rank":0.2833797378030865,"fraction":0.000002331992589119366,"cumulative_fraction":0.9754383300236652,"word":"湧進","characters":[{"definition":["to bubble up\/to rush forth"],"pinyin":["yong3"],"word":"湧"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[],"sentences":[{"english":"People poured into the Beijing International Sculpture Park.","chinese":"人們湧進了北京國際雕塑公園。"},{"english":"Once again, huge numbers packed Tahrir Square.","chinese":"大量示威者再次湧進瞭解放廣場。"},{"english":"Water came up to his window and into his house.","chinese":"水上升到了他的窗口，湧進他的的房子。"},{"english":"After Chongqing opened the port, \"modern agitation \" poured into Sichuan Basin along the course of the Changjiang River.","chinese":"重慶開埠後，“近代風潮”沿長江航線湧進四川盆地。"},{"english":"They rarely talked about the hideous images that occasionally flooded their minds.","chinese":"他們幾乎不談那些偶爾會湧進腦海裏的可怕畫面。"},{"english":"The whole town was alive with talk about revolutionaries who were flooding the mills with their handbills.","chinese":"傳說革命者湧進工廠裏散發傳單，這事弄得滿城風雨。"},{"english":"Mary, missing melts into a thousand streams deluging into my world.","chinese":"瑪麗，想念融化成一千條河流湧進我的世界。"},{"english":"Wave on wave of the audience entered into the theatre.","chinese":"一批又一批的觀衆湧進了劇場。"},{"english":"In the upside-down cabin, water spouted through the hatch.","chinese":"水嘩嘩地從艙口湧進翻倒的船艙。"},{"english":"The sour vapour pours into the flourishing flour factory.","chinese":"酸蒸汽湧進興旺的麪粉廠。"},{"english":"A flood of Chinese products keep coming into the country.","chinese":"大量的中國產品不斷湧進了這個國家。"},{"english":"There were wild celebrations as they streamed in through the gates.","chinese":"在他們湧進官邸大門的時候進行了瘋狂的慶祝。"},{"english":"The water just flooded into the plane quickly.","chinese":"水迅速湧進了飛機。"},{"english":"I effuse my flesh in eddies, and drift it in lacy jags.","chinese":"我把我的肉體湧進漩渦，讓它漂浮在花邊狀的裂縫中。"},{"english":"By Friday the city clerk's office had been flooded with applications.","chinese":"直到上星期五，各種申請已經湧進了城市職員辦公廳。"},{"english":"The boarding call announced, the throngs rushed for the non-air conditioned train carriages.","chinese":"廣播通知上車了，人羣湧進了沒有空調的火車車廂。"}],"related":[]}