{"definition":["Junggar Basin, northern Xinjiang"],"pinyin":["Zhun3 ga2 er3 Pen2 di4"],"simplified":["准噶尔盆地"],"rank":45175.0,"normalized_rank":0.6320568606326865,"fraction":2.3429409111340107e-7,"cumulative_fraction":0.9980610746517607,"word":"準噶爾盆地","characters":[{"definition":["accurate\/standard\/definitely\/certainly\/about to become (bride, son-in-law etc)\/quasi-\/para-"],"pinyin":["zhun3"],"word":"準"},{"definition":["phonetic ga (used in rendering Tibetan and Mongolian sounds)\/Tibetan Ge: language of Buddha\/(dialect) final particle similar to 了[le5] (esp. in Yunnan)"],"pinyin":["ga2"],"word":"噶"},{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"},{"definition":["basin\/flower pot\/unit of volume equal to 12 斗[dou3] and 8 升[sheng1], approx 128 liters\/CL:個|个[ge4]"],"pinyin":["pen2"],"word":"盆"},{"definition":["-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct","earth\/ground\/field\/place\/land\/CL:片[pian4]"],"pinyin":["de5","di4"],"word":"地"}],"containing_words":[],"sentences":[{"english":"The Mengku region is located at the southern foot of the Altay Mountains to the north of the Junggar basin.","chinese":"新疆蒙庫地區位於阿爾泰山南麓，南接準噶爾盆地。"},{"english":"The southern edge of Junggar Basin, is the The only access to the North Road of Silk Road.","chinese":"準噶爾盆地南緣，是絲綢之路北道的必經之地。"},{"english":"Three anticline zones developed on the south margins of Junggar Basin.","chinese":"準噶爾盆地南緣發育三排背斜帶。"},{"english":"Finally, after contractive uplift in Miocene, Present Junggar Basin was formed in the end.","chinese":"最後在中新世時萎縮上隆，形成了現代的準噶爾盆地。"},{"english":"Xia 40 well area in Zunger Basin has tight reservoirs.","chinese":"準噶爾盆地夏40井區儲層緻密。"},{"english":"The Yongjin Oilfield had been explored to be a large oilfield with in-place volume of hundreds millions ton in Junggar Basin.","chinese":"準噶爾盆地永進油田爲儲量規模上億噸的整裝油田。"},{"english":"The late movement makes oil and accumulation possess late period forming in the Junggar basin.","chinese":"晚期構造決定準噶爾盆地南緣具有晚期成藏的特點。"},{"english":"Lithologic trap is the most important type of traps in Shawodi area of Junggar basin.","chinese":"巖性圈閉是準噶爾盆地沙窩地地區最主要的圈閉類型。"},{"english":"A computation example of Zhungeer basin is given in this paper.","chinese":"最後列舉了準噶爾盆地的計算實例。"},{"english":"The paper discusses the analyzing results of mineral compositions of 87 sand samples from 9 des- erts in the Jungger Basin.","chinese":"對準噶爾盆地87件沙漠沙礦物分析結果進行了研究。"},{"english":"The tectonic evolution and hydrocarbon accumulation in the foreland fold-and-thrust belt of the southern JunggarBasin is complex.","chinese":"準噶爾盆地南緣前陸沖斷帶構造演化與成藏過程複雜。"},{"english":"Decision tree and utility theory are used to evaluate the hydrocarbon re-sources of the Junggar Basin.","chinese":"決策樹和效用理論已應用於準噶爾盆地油氣資源評價。"}],"related":[]}