{"definition":["directrix line of a parabola\/guide line"],"pinyin":["zhun3 xian4"],"simplified":["准线"],"rank":56682.0,"normalized_rank":0.7930547199641823,"fraction":6.641982022217914e-8,"cumulative_fraction":0.9996375613468592,"word":"準線","characters":[{"definition":["accurate\/standard\/definitely\/certainly\/about to become (bride, son-in-law etc)\/quasi-\/para-"],"pinyin":["zhun3"],"word":"準"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"}],"containing_words":[],"sentences":[{"english":"An united space datum line has been given.","chinese":"給出統一的空間基準線。"},{"english":"It can maintain a fluid interface at a reference line in an inclined glass tube .","chinese":"它能保持流體分界面在傾斜的玻璃管中基準線上。"},{"english":"The coastline is the base directrix divides the region of sea and land management.","chinese":"海岸線是劃分海洋與陸地管理區域的基準線。"},{"english":"When you find your line in Headstand, it's a beautiful thing.","chinese":"在頭倒立中找到準線是一件非常美好的事情。"},{"english":"If necessary, you can easily add extra guidelines and labels by dividing by other values.","chinese":"如果需要，添加其他的基準線和標記也很方便。"},{"english":"Record a baseline of your regular activities and determine a reasonable schedule.","chinese":"記錄平時鍛鍊的基準線，制定合理的進度表。"},{"english":"Aligning the type to a consistent baseline.","chinese":"對所有的排版都設置對齊的到一致的基準線上。"},{"english":"Use some horizontal line or subject as benchmark to draw a parallel line for midpoint line of stationary seat.","chinese":"找一條瓷片線作爲基準線並劃好掛件中點水平線。"},{"english":"So, that right there gets you pretty close to a consistent baseline.","chinese":"這樣一來，你非常容易就得到了一個一致的基準線。"},{"english":"The directrix line of a conic.","chinese":"二次曲線的準線。"},{"english":"The outer barrel of the syringe should be transparent enough; bench line can be seen distinctly.","chinese":"注射器外套應有足夠透明度，能清晰地看到基準線。"},{"english":"Use the tape to measure and adjust the level of the cabinet by the reference line.","chinese":"再用捲尺以基準線爲標準，測量調試吊櫃水平。"},{"english":"Create a blend curve to create the light base line.","chinese":"創建一個混合曲線創造輕基準線。"},{"english":"Is there a hard-and-fast line between good and evil?","chinese":"這是區分美好與邪惡的基準線嗎？"},{"english":"Thus, in Beijing, 60,000 yuan in low-income families is the standard line.","chinese":"因此，在北京，6萬元是中低收入家庭的標準線。"}],"related":[]}