{"definition":["overflowing"],"pinyin":["yi4 man3"],"simplified":["溢满"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"溢滿","characters":[{"definition":["to overflow\/(literary) excessive\/old variant of 鎰|镒[yi4]"],"pinyin":["yi4"],"word":"溢"},{"definition":["Manchu ethnic group","to fill\/full\/filled\/packed\/fully\/completely\/quite\/to reach the limit\/to satisfy\/satisfied\/contented"],"pinyin":["Man3","man3"],"word":"滿"}],"containing_words":[],"sentences":[{"english":"Truest friendship fulfills life with enthusiam.","chinese":"真摯的友誼，使人生溢滿熱情。"},{"english":"No longer clear bright eyes overflowing with gentle, flashing a soulful.","chinese":"不再清澈明亮的眸子裏溢滿了溫柔，閃爍着深情。"},{"english":"JAKE, eyes streaming, struggles with his bindings.","chinese":"傑克，眼裏溢滿淚水，在柱子上掙扎着。"},{"english":"Drolma was full of hate, but she didn't show any hint on her face.","chinese":"仇恨在卓瑪的心裏溢滿，而她並沒有把這些寫在臉上。"},{"english":"And then, my cup of love was overflowing .","chinese":"然後，我的愛之杯開始溢滿。"},{"english":"And after a time she turned round and looked at him, and her eyes were full of tears.","chinese":"過了一會兒她回頭看他，雙眼溢滿了淚水。"},{"english":"Particles of renewable products Yiman Liaoning.","chinese":"再生顆粒產品溢滿遼寧。"},{"english":"The black breathing that billows her sleep, her name.","chinese":"黑色呼吸讓她的夢溢滿驚浪，她的名。"},{"english":"Think of, never sigh Qingchou, between the lines.","chinese":"想着，不覺輕輕嘆息，清愁溢滿字裏行間。"},{"english":"After the peach, I look forward to working with the dark mountains.","chinese":"桃花過後，我期待着溢滿黛色的山巒。"},{"english":"In the rainy season, the pit overflows all over the school grounds.","chinese":"在雨季，茅坑出來的水溢滿整個學校的地面。"},{"english":"The choices YOU make, and the happiness that bubbles up inside you.","chinese":"你選擇，然後幸福感溢滿心中。"},{"english":"Under my record's this move overflows devotionally is filled with the door leaf.","chinese":"我虔誠地記載下的這份感動溢滿心扉。"},{"english":"Neytiri's eyes brim with tears.","chinese":"奈提莉的眼裏溢滿淚水。"},{"english":"The sunshine is full of the city.","chinese":"那座陽光溢滿的城。"}],"related":[]}