{"definition":["moderate faction"],"pinyin":["wen1 he2 pai4"],"simplified":["温和派"],"rank":33528.0,"normalized_rank":0.4691002196633694,"fraction":6.895983092957675e-7,"cumulative_fraction":0.9930966243080632,"word":"溫和派","characters":[{"definition":["surname Wen","warm\/lukewarm\/temperature\/to warm up\/mild\/soft\/tender\/to review (a lesson etc)\/fever (TCM)\/old variant of 瘟[wen1]"],"pinyin":["Wen1","wen1"],"word":"溫"},{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["clique\/school\/group\/faction\/to dispatch\/to send\/to assign\/to appoint\/pi (Greek letter Ππ)\/the circular ratio pi = 3.1415926\/(loanword) pie"],"pinyin":["pai4"],"word":"派"}],"containing_words":[],"sentences":[{"english":"Kaifu is a relative moderate in the Japanese political lexicon .","chinese":"海部在日本政治詞彙中是一個相對的溫和派。"},{"english":"Ms Royal, believe it or not, is considered a moderate.","chinese":"相信與否，羅雅爾女士被認爲是溫和派。"},{"english":"The moderates finally plunked for  the party candidate.","chinese":"溫和派最後支持了黨的候選人。"},{"english":"The Moderates, on the other hand, have left an ambiguous and, in the end, harmful legacy.","chinese":"而溫和派們則始終態度含糊，最終，遺患無窮。"},{"english":"Now, with DOVE, the security graphic artist has the same opportunity.","chinese":"現在，與溫和派人物，安全書畫藝術家有相同的機會。"},{"english":"A moderate Democrat, Giffords’ Arizona office was vandalized last year.","chinese":"溫和派民主黨人吉福茲的辦公室去年遭到破壞騷擾。"},{"english":"How did I come to be with the \"softs\" at the congress ?","chinese":"在代表大會上，我怎麼會站在“溫和派”一邊呢？"},{"english":"Hua and his moderate allies quickly arrested the Gang of Four.","chinese":"華國鋒及其溫和派人士迅速逮捕了四人幫。"},{"english":"This has the potential to open doors for moderates within the FDLR to lay down their weapons.","chinese":"這有可能打開大門內的民主力量的溫和派放下武器。"},{"english":"They, in turn, were ruthless in killing and marginalising more moderate Tamils.","chinese":"他們無情的殺戮轉而使更多的溫和派泰米爾人邊緣化。"},{"english":"The initiative’s goal is to create a global movement of moderates, he said.","chinese":"他說，這項倡議的目標是發起一場全球溫和派運動。"}],"related":[]}