{"definition":["thermometer"],"pinyin":["wen1 du4 biao3"],"simplified":["温度表"],"rank":57244.0,"normalized_rank":0.8009178291102934,"fraction":6.160255853573537e-8,"cumulative_fraction":0.9996735127167994,"word":"溫度表","characters":[{"definition":["surname Wen","warm\/lukewarm\/temperature\/to warm up\/mild\/soft\/tender\/to review (a lesson etc)\/fever (TCM)\/old variant of 瘟[wen1]"],"pinyin":["Wen1","wen1"],"word":"溫"},{"definition":["to estimate\/Taiwan pr. [duo4]","to pass\/to spend (time)\/measure\/limit\/extent\/degree of intensity\/degree (angles, temperature etc)\/kilowatt-hour\/classifier for events and occurrences"],"pinyin":["du4","duo2"],"word":"度"},{"definition":["exterior surface\/family relationship via females\/to show (one's opinion)\/a model\/a table (listing information)\/a form\/a meter (measuring sth)"],"pinyin":["biao3"],"word":"表"}],"containing_words":[],"sentences":[{"english":"Thermometer shed, Hong Kong Observatory, Tsimshatsui, Kowloon.","chinese":"溫度表棚，九龍尖沙咀香港天文臺。"},{"english":"Maternal heart is children people emotive thermometer.","chinese":"母親的心是兒女們感情的溫度表。"},{"english":"The thermometer had dropped to 18 degrees below zero, but we still chose to sleep in the porch as usual.","chinese":"溫度表降到零下十八度的時候，我們也是在廊下睡覺。"},{"english":"For detailed Operating Pressure, refer to Pressure Temperature Chart on page 46.","chinese":"要了解工作壓力細節，參閱第46頁的壓力溫度表。"},{"english":"The fundamental constitute and working elements of electronic thermometer was elaborated.","chinese":"闡述了電子溫度表組成部分的基本構成和工作原理。"},{"english":"This paper makes introduction of the construction of the temperature gauge and fuel guage for vehicle and their basic operation principles.","chinese":"介紹汽車溫度表與燃油表的組成及其簡單工作原理。"},{"english":"The thermometer registered 29℃ yesterday.","chinese":"昨天溫度表上顯示的讀數爲攝氏29度。"},{"english":"Thethermometer has fallen to 20℃below zero .","chinese":"溫度表已降到零下20攝式度。"},{"english":"Earth thermometers, Hong Kong Observatory, Tsimshatsui, Kowloon.","chinese":"土壤溫度表，九龍尖沙咀香港天文臺。"},{"english":"I can't read what the thermometer says.","chinese":"我不會看溫度表上的度數。"}],"related":[]}