{"definition":["dissolved substance\/material in solution"],"pinyin":["rong2 zhi4"],"simplified":["溶质"],"rank":57169.0,"normalized_rank":0.7998684818043177,"fraction":6.218646904318311e-8,"cumulative_fraction":0.9996688716501094,"word":"溶質","characters":[{"definition":["to dissolve\/soluble"],"pinyin":["rong2"],"word":"溶"},{"definition":["character\/nature\/quality\/plain\/to pawn\/pledge\/hostage\/to question\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"質"}],"containing_words":[],"sentences":[{"english":"So this is where the mixing of the solute comes in.","chinese":"這是加進來的溶質混合引起的。"},{"english":"It couples the groundwater flow equation with the solute-transport equation.","chinese":"它把地下水流動方程與溶質輸運方程耦合在一起。"},{"english":"So it's moles per weight of solvent.","chinese":"就是每千克溶劑的溶質摩爾數。"},{"english":"Calculate according to the experiment please the vitriolic solute quality mark in this sewage.","chinese":"請根據實驗計算該污水中硫酸的溶質質量分數。"},{"english":"In situ observation of TEM indicates that bainite nucleate by shear in solute atom's depleted regions.","chinese":"原位觀察證實貝氏體於溶質原子貧化區切變形核。"},{"english":"So now the CS2 is the solute.","chinese":"那麼CS2就是溶質。"},{"english":"In addition, the retention mechanism of apolar and polar solute was also discussed.","chinese":"還討論了非極性和極性溶質的保留機理。"},{"english":"Or in solutions, where your solutes, your solute molecules are mixing around.","chinese":"或者是溶液狀態溶質，溶質分子相互混合。"},{"english":"Or in solutions, where your solutes, your solute molecules are mixing around.","chinese":"或者是溶液狀態溶質，溶質分子相互混合。"},{"english":"Solute exchange has little effect on absorption rate, adding to an overall reproducibility.","chinese":"溶質交換相對總的再生性來說對吸收率幾乎不起作用。"},{"english":"The densification behaviour is affected by the Ni2+ solutes .","chinese":"鈦酸鋇緻密化行爲的差異受到鎳溶質的影響。"},{"english":"The factors affecting on retention of solute were studied.","chinese":"研究了影響溶質保留值的此素。"},{"english":"Moles per kilograms of solvent.","chinese":"每千克溶劑的溶質摩爾數。"},{"english":"We're going to assume that it's totally non-volatile.","chinese":"我們假定溶質完全不揮發。"},{"english":"This solute will be referred to as a tracer.","chinese":"這種溶質稱爲示蹤劑。"},{"english":"If you know what's happening in the liquid phase, for a solute.","chinese":"如果知道溶質在液相中發生的事情，拉烏爾定律。"}],"related":[]}