{"definition":["glider"],"pinyin":["hua2 xiang2 ji1"],"simplified":["滑翔机"],"rank":33504.0,"normalized_rank":0.4687644285254572,"fraction":6.913500408181108e-7,"cumulative_fraction":0.9930800548255708,"word":"滑翔機","characters":[{"definition":["surname Hua","to slip\/to slide\/smooth\/slippery\/cunning"],"pinyin":["Hua2","hua2"],"word":"滑"},{"definition":["to soar\/to glide\/variant of 詳|详[xiang2]"],"pinyin":["xiang2"],"word":"翔"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[{"definition":["hang-glider"],"pinyin":["xuan2 gua4 shi4 hua2 xiang2 ji1"],"word":"懸掛式滑翔機"}],"sentences":[{"english":"He flies a motor  glider and small airplanes.","chinese":"現在他可以駕駛電動滑翔機和小型飛機。"},{"english":"Currents of warm air keep the hang-gliders aloft.","chinese":"懸掛式滑翔機藉着暖氣流在高空飛行。"},{"english":"Power -driven heavier - than -air aircraft shall give way to gliders.","chinese":"重於空氣的動力驅動飛機應該給滑翔機讓路。"},{"english":"The glider uncoupled from the two planes.","chinese":"滑翔機與拖機脫開。"},{"english":"British paratroopers writing slogans on their Horsa gliding plane.","chinese":"寫在他們的滑翔機霍薩英國傘兵的口號。"},{"english":"The man who first experimented with sailplanes hoped to imitate the flight of birds.","chinese":"首先使用滑翔機作實驗的人是想模仿鳥的飛行。"},{"english":"It was as if the glider wasn't there.","chinese":"這種感覺，就好像滑翔機根本就不在我身上一樣。"},{"english":"Some of the airborne forces were carried toward their destinations by gliders towed behind transport aircraft.","chinese":"某些空降部隊乘坐由運輸機拖拽的滑翔機前往目的地。"},{"english":"By the cliff where the hang-glider took off.","chinese":"在懸崖邊看滑翔機起飛。"},{"english":"Gliders equipped with radio and recording instruments have been flown into the core of thunderstorms.","chinese":"裝有無線電設備和記錄儀的滑翔機曾飛進雷暴的中心。"},{"english":"The glider uncoupled from the tow plane.","chinese":"滑翔機與拖行機分開。"},{"english":"The glider was winched off the ground.","chinese":"那架滑翔機由絞車拖離地面。"},{"english":"One fell hard enough to break the glider's sturdy aluminum strut.","chinese":"人們都恨不得折斷滑翔機上那段堅硬的鋁支桿。"},{"english":"The film was taken by a camera mounted on a hang - glider .","chinese":"這部影片是用攝影機系在懸掛式滑翔機上拍攝的。"},{"english":"The stresses caused by flying too fast could peel the wings from the sailplane.","chinese":"飛行過快而引起的應力會使滑翔機的機翼脫落。"}],"related":[]}