{"definition":["exudate"],"pinyin":["shen4 chu1 wu4"],"simplified":["渗出物"],"rank":61841.0,"normalized_rank":0.8652358233178963,"fraction":3.0655301641005754e-8,"cumulative_fraction":0.9998811860359248,"word":"滲出物","characters":[{"definition":["to seep\/to ooze\/to horrify"],"pinyin":["shen4"],"word":"滲"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"}],"containing_words":[],"sentences":[{"english":"A thick yellow exudate coats the peritoneal surfaces.","chinese":"一層厚的黃色滲出物被覆在腹膜外。"},{"english":"An inflammatory exudate collects on the surface .","chinese":"炎性滲出物集合在表面。"},{"english":"Note that there is no alveolar exudate.","chinese":"沒有肺泡腔滲出物。"},{"english":"Commonly the muzzle is encrusted with mucus and exudate .","chinese":"鼻鏡通常覆蓋着粘液和滲出物。"},{"english":"The pleural surface at the lower left demonstrates areas of yellow-tan purulent exudate.","chinese":"左下胸膜表面可看見黃褐色膿性滲出物。"},{"english":"Surface exudation is minimal.","chinese":"它的表面滲出物很少。"},{"english":"The yellow-tan exudate of acute bacterial meningitis seen here obscures the sulci.","chinese":"急性細菌性腦膜炎棕黃色滲出物使腦溝模糊不清。"},{"english":"Commonly the muzzle is encrusted with mucus and exudate.","chinese":"鼻鏡通常覆蓋着粘液和滲出物。"},{"english":"The yellow-tan clouding of the meninges seen here is due to an exudate from acute meningitis.","chinese":"這裏所見棕黃色混濁物是急性腦膜炎的滲出物。"},{"english":"The cut surface at the right demonstrates yellowish-tan mucosal exudation with a hyperemic border.","chinese":"在右側切面可見黃棕色黏膜滲出物，邊緣有充血。"},{"english":"The epicardial surface of the heart shows a shaggy fibrinous exudate.","chinese":"心外膜表面可見粗糙的纖維蛋白滲出物。"},{"english":"The serosal surface at the left shows a tan-yellow exudate.","chinese":"左側顯示漿膜表面，有黃褐色滲出物。"}],"related":[]}