{"definition":["carburization"],"pinyin":["shen4 tan4"],"simplified":["渗碳"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"滲碳","characters":[{"definition":["to seep\/to ooze\/to horrify"],"pinyin":["shen4"],"word":"滲"},{"definition":["carbon (chemistry)"],"pinyin":["tan4"],"word":"碳"}],"containing_words":[],"sentences":[{"english":"Distortion of automobile synchronizer gear sleeves will take place during the course of carburization and quenching.","chinese":"汽車同步器齒套在滲碳淬火後，發生變形。"},{"english":"Rapid carburizing process by increasing furnace pressure is introduced and its mechanism is analysed.","chinese":"介紹了快速壓力滲碳工藝，並對其機理進行了分析。"},{"english":"A newly developed BBH pre - vacuum - pumping carburizing furnace has been introduced in this paper.","chinese":"介紹了新研製的預抽真空式可控氣氛氣體滲碳爐。"},{"english":"When designing a continuous type carburizing furnace, it is necessary to take account of degreasing.","chinese":"連續式滲碳爐設計時，應考慮脫脂問題。"},{"english":"Spheroidizing is the process of producing a structure in which the cementite is in a spheroidal distribution.","chinese":"球化是使滲碳體產生成類似球狀分佈結構的工藝。"},{"english":"Amount of time product spends in a furnace at specified temperature for the purpose of carburizing or hardening product.","chinese":"產品在爐中某特定溫度下滲碳或硬化所需要的時間。"},{"english":"The tempering operation may be described as one of precipitation and agglomeration or coalescence of cementite.","chinese":"回火作業可以描述爲滲碳體析出和凝聚或聚結的過程。"},{"english":"The processing of carburization affects the quality of products in heat treatment directly.","chinese":"滲碳工藝過程的執行，直接關係到熱處理產品的質量。"},{"english":"A new research & development of continuous gas carburizing furnace is described.","chinese":"介紹了新研製的網帶連續式氣體滲碳爐。"},{"english":"This model is used to achieve the calculation and actual time control of deep carburization with high concentration.","chinese":"應用該模型實現了高濃度深層滲碳的計算機實時控制。"},{"english":"The low-temperature RE carburizing technology is explored by a series of tests.","chinese":"通過一系列試驗，摸索出利用稀土低溫滲碳技術。"},{"english":"So the diamond growth up depends on the consumption of original cementite.","chinese":"金剛石的生長通過對初生滲碳體的消耗得以進行。"},{"english":"The main production of solid carburizing agent.","chinese":"主要生產固體滲碳劑。"},{"english":"The distribution of cementite particle size displayed bimodal.","chinese":"顆粒狀滲碳體的尺寸呈雙峯分佈。"},{"english":"High carburized rate was attained by using Al 2O 3 fluidized bed furnace.","chinese":"剛玉流動粒子爐滲碳能夠獲得較高的滲碳速度。"},{"english":"High carburized rate was attained by using Al 2O 3 fluidized bed furnace.","chinese":"剛玉流動粒子爐滲碳能夠獲得較高的滲碳速度。"}],"related":[]}