{"definition":["to have one's heart filled with\/(to collide) full on\/(of farm animals) heavy with young"],"pinyin":["man3 huai2"],"simplified":["满怀"],"rank":12608.0,"normalized_rank":0.17640227778321885,"fraction":0.000005632254777213929,"cumulative_fraction":0.9474918223636308,"word":"滿懷","characters":[{"definition":["Manchu ethnic group","to fill\/full\/filled\/packed\/fully\/completely\/quite\/to reach the limit\/to satisfy\/satisfied\/contented"],"pinyin":["Man3","man3"],"word":"滿"},{"definition":["bosom\/heart\/mind\/to think of\/to harbor in one's mind\/to conceive (a child)","surname Huai"],"pinyin":["Huai2","huai2"],"word":"懷"}],"containing_words":[],"sentences":[{"english":"I loved you tenderness and candor.","chinese":"我曾柔情似水滿懷真摯地愛過你。"},{"english":"He was in such a hurry to get out that he barged into a passer-by.","chinese":"他急急忙忙地往外走，竟與一位行人撞了個滿懷。"},{"english":"It resides in the particular things thathe delighted to record.","chinese":"它就棲身於塞林格滿懷欣喜記錄下來的那些事物中。"},{"english":"With a bumper harvest in sight, joy reigned over us.","chinese":"豐收在望，我們滿懷喜悅。"},{"english":"Sometimes he bent his head, as if under a great weight of sorrow.","chinese":"有時候他低着頭，好象滿懷愁情。"},{"english":"One of the reporters cannoned into Arnold.","chinese":"其中一個記者和阿諾德撞了個滿懷。"},{"english":"That falls in well with mine, and certes brought.","chinese":"那天裏，的確給我帶來滿懷的喜悅和舒暢。"},{"english":"He nearly ran into a large man who suddenly came in through the doorway.","chinese":"他差點與一位突然闖進的大個子男人撞個滿懷。"},{"english":"She assailed her studies with new determination.","chinese":"她滿懷新的決心毅然對付學習。"},{"english":"Looking to the future, we are filled with pride and enthusiasm.","chinese":"展望未來，我們豪情滿懷。"},{"english":"Michael looked at him imploringly, eyes brimming with tears.","chinese":"邁克爾滿懷乞求地看着他，兩眼淚汪汪的。"},{"english":"He ran full tilt into me.","chinese":"他和我撞了個滿懷。"},{"english":"Li's pock-marked wife was also waiting for him in a subdued, humble way.","chinese":"李的麻臉妻子也在柔情滿懷地等待着他。"},{"english":"To travel hopefully is better than to arrive. ----R. L.","chinese":"滿懷希望的旅行比抵達目的地更美好。"},{"english":"I steer my ship with hope, leaving fear behind.","chinese":"我滿懷希望地駕駛航船，把恐懼拋在後面。"},{"english":"All human wisdoms are summed up in two words: Wait and Hope.","chinese":"概言之，人類的智慧就是耐心等待並滿懷希望。"}],"related":[]}