{"definition":["fills the eyes (of a beautiful view, scene of desolation etc)"],"pinyin":["man3 mu4"],"simplified":["满目"],"rank":27425.0,"normalized_rank":0.3837113315517748,"fraction":0.0000011903015694321949,"cumulative_fraction":0.9875149551578866,"word":"滿目","characters":[{"definition":["Manchu ethnic group","to fill\/full\/filled\/packed\/fully\/completely\/quite\/to reach the limit\/to satisfy\/satisfied\/contented"],"pinyin":["Man3","man3"],"word":"滿"},{"definition":["eye\/item\/section\/list\/catalogue\/table of contents\/order (taxonomy)\/goal\/name\/title"],"pinyin":["mu4"],"word":"目"}],"containing_words":[{"definition":["glittering jewels to delight the eye (idiom)\/fig. a dazzling lineup"],"pinyin":["lin2 lang2 man3 mu4"],"word":"琳瑯滿目"},{"definition":["lit. bumps and bruises everywhere (idiom); fig. an ugly shambles\/devastation everywhere"],"pinyin":["chuang1 yi2 man3 mu4"],"word":"瘡痍滿目"},{"definition":["lit. to fill one's eyes with glittering jewels\/a literary masterpiece or sb of extraordinary talent (idiom)"],"pinyin":["man3 mu4 lin2 lang2"],"word":"滿目琳琅"},{"definition":["thorns and brambles as far as eye can see (idiom); beset by troubles"],"pinyin":["jing1 zhen1 man3 mu4"],"word":"荊榛滿目"}],"sentences":[{"english":"The devastated old China is gone for ever.","chinese":"瘡痍滿目的舊中國一去不復返了。"},{"english":"A long thin table against the front wall was covered with gorgeous jewelry.","chinese":"而靠牆的一條長桌上則擺滿了琳琅滿目的首飾。"},{"english":"Two faint hopes flicker in the sodden gloom left by the earthquake.","chinese":"在地震過後的滿目瘡痍裏閃爍着兩線模糊的希望。"},{"english":"The market in the port:There are many small wares loaded to here by ship.","chinese":"口岸市場》口岸市場裏琳琅滿目的舶來小商品。"},{"english":"Regardless of Paris or other provinces, cafes everywhere.","chinese":"無論巴黎還是外省，咖啡館滿目皆是。"},{"english":"Shop windows display of goods dazzling, brilliant.","chinese":"商店的櫥窗裏陳列的商品琳琅滿目，熠熠生輝。"},{"english":"The city was scarred by war.","chinese":"這座城市被戰爭弄得瘡痍滿目。"},{"english":"A rusty iron rod projected mournfully from one of the window ledges.","chinese":"一個窗架上突出一根生鏽的鐵棒，真是滿目淒涼。"},{"english":"Everywhere near the scene of the car accident, destruction meets the eye.","chinese":"車禍現場瘡痍滿目一片狼藉。"},{"english":"Tiny street-side market stalls replaced trinket-laden shop windows.","chinese":"小小的街邊貨攤代替了貨物琳琅滿目的商店櫥窗。"},{"english":"He has his Winter too of pale disfeature , or else he would forego his mortal nature.","chinese":"他也有滿目蒼涼的冬天，除非他走在命定的時日之前。"},{"english":"His visitor was shown into the study, where all the fishing tackle hung.","chinese":"客人給請進了書房，那裏各種釣魚用具掛得琳琅滿目。"},{"english":"The land is scarred and many of the people have left.","chinese":"那兒土地已經變得滿目瘡痍，很多人都離開了。"},{"english":"The flood cut a wide swath in this area.","chinese":"洪水席捲了這一地區，滿目一片瘡痍。"},{"english":"A: The shop is a feast for the eyes indeed.","chinese":"你們店實在是琳琅滿目，美不勝收。"},{"english":"On all sides, verdant sunset-bathed hills greet the eye.","chinese":"滿目青山夕照明。"}],"related":[]}