{"definition":["filled with\/preoccupied with"],"pinyin":["man3 fu4"],"simplified":["满腹"],"rank":29216.0,"normalized_rank":0.4087697452184741,"fraction":0.0000010081214911085035,"cumulative_fraction":0.9894781635923972,"word":"滿腹","characters":[{"definition":["Manchu ethnic group","to fill\/full\/filled\/packed\/fully\/completely\/quite\/to reach the limit\/to satisfy\/satisfied\/contented"],"pinyin":["Man3","man3"],"word":"滿"},{"definition":["abdomen\/stomach\/belly"],"pinyin":["fu4"],"word":"腹"}],"containing_words":[{"definition":["lit. belly full of complaints (idiom)\/discontent\/always moaning and complaining"],"pinyin":["man3 fu4 lao2 sao1"],"word":"滿腹牢騷"},{"definition":["full of political wisdom (idiom)\/politically astute\/with encyclopedic experience of state policy"],"pinyin":["man3 fu4 jing1 lun2"],"word":"滿腹經綸"},{"definition":["full of wisdom (idiom); astute and widely experienced"],"pinyin":["jing1 shen2 man3 fu4"],"word":"精神滿腹"}],"sentences":[{"english":"But what if you’re feeling grouchy?","chinese":"如果你自己都滿腹牢騷情況會怎麼樣呢？"},{"english":"She stared, colored, doubted, and was silent.","chinese":"她瞪着眼，紅着臉，滿腹狐疑，閉口不響。"},{"english":"\"At the time, \" he added, \"I was really brassed off (angry) about it.\"","chinese":"他還說，“那個時候，我真是滿腹怨氣”。"},{"english":"For my dream i will grin and bear it, without complaint.","chinese":"爲了這個夢想我要任勞任怨不再滿腹牢騷。"},{"english":"So it was that a duplicitous Chancellor took advantage of this unswerving allegiance.","chinese":"這堅定不渝的忠誠也是滿腹陰謀的議長所利用的優勢。"},{"english":"I was racked with doubt and pain.","chinese":"我滿腹疑慮，痛苦萬分。"},{"english":"They often take an unusual path, thanks to their intellect and offbeat ideas.","chinese":"滿腹的才華和非主流的思想常常使水瓶座不走尋常路。"},{"english":"You don't want to come across as a whiner.","chinese":"你也不願意碰到一個牢騷滿腹的人吧。"},{"english":"The March wind is fretful, fretting the languid waves into murmurs.","chinese":"三月風躁動不安，把倦怠的波浪攪得滿腹怨言。"},{"english":"Timid people always wreak their peevishness on the gentle.","chinese":"怯懦的人總是把滿腹牢騷向溫和的人發泄。"},{"english":"They left that house confused and wondering, never to see Harold again.","chinese":"他們滿腹狐疑的離開了，但是從此再也沒見到霍華德。"},{"english":"Bellyful of timid meaning dust.","chinese":"滿腹怯意化塵埃。"},{"english":"He is extremely suspicious of all his neighbours.","chinese":"他對所有鄰居都滿腹狐疑。"},{"english":"you know what, douglas? you are a real boring whinger.","chinese":"道格拉斯你知道嗎，你是一個牢騷滿腹的傢伙。"},{"english":"Thinopyrum drink river rat, but the full.","chinese":"偃鼠飲河，不過滿腹。"},{"english":"The Policeman hesitates, vacillates, then takes another rather uncertain step or two forward.","chinese":"警察猶豫了一下，滿腹狐疑地又往前挪了一兩步。"}],"related":[]}