{"definition":["one's heart filled with\/full of (joy)"],"pinyin":["man3 qiang1"],"simplified":["满腔"],"rank":28791.0,"normalized_rank":0.4028234438179452,"fraction":0.000001049871092391016,"cumulative_fraction":0.9890411166500296,"word":"滿腔","characters":[{"definition":["Manchu ethnic group","to fill\/full\/filled\/packed\/fully\/completely\/quite\/to reach the limit\/to satisfy\/satisfied\/contented"],"pinyin":["Man3","man3"],"word":"滿"},{"definition":["cavity of body\/barrel (e.g. engine cylinder)\/compartment\/tune\/accent of speech"],"pinyin":["qiang1"],"word":"腔"}],"containing_words":[{"definition":["full of enthusiasm"],"pinyin":["man3 qiang1 re4 chen2"],"word":"滿腔熱忱"}],"sentences":[{"english":"Embracing warm blood, I sing of youth without regret. Look upon the horizon and know not when my ally would return.","chinese":"滿腔熱血唱出青春無悔，望穿天涯不知戰友何時回。"},{"english":"Passion alone cannot win the revolution; Passion just makes martyrs.","chinese":"光靠滿腔熱血，不會使革命成，只能製造烈士。"},{"english":"In prison, he worked hard to cultivate more self-control over his anger.","chinese":"他在獄中努力培養對自己滿腔怒火的自我控制力。"},{"english":"Don't go into your passion with amateur skills.","chinese":"千萬不要以滿腔的熱情卻表現出業餘的水平。"},{"english":"You have lost heart, faith and patience.","chinese":"你已經開始失去滿腔的熱情，信心和耐心。"},{"english":"I give to filled with the absolute sincerity you, is willing you to be forever strong, is forever vigorous.","chinese":"我把滿腔赤誠獻給你，願你永遠堅強，永遠蓬勃。"},{"english":"She was silent, and I guessed at her unutterable depression.","chinese":"她不說話了，但我猜她有滿腔說不出的鬱悶。"},{"english":"The right man for the job needs to be enthusiastic and energetic.","chinese":"這份工作的適合人選應該是滿腔熱情而且精力充沛的。"},{"english":"We should be warm towards our comrades, not ice cold and indifferent.","chinese":"看待同志要滿腔熱忱，不能冷冷清清，漠不關心。"},{"english":"He was silent, and i guessed at his unutterable depression .","chinese":"他不講話了，但我猜他有滿腔說不出的鬱悶。"},{"english":"You mean a guy using enthusiastic knowledgable about computer?","chinese":"你是說一個滿腔熱情，對電腦很在行的人？"},{"english":"He filled with sorrow and anger into poetry, the spread of the Miluo river.","chinese":"他把滿腔悲憤化爲詩歌，蔓延在汩羅江上。"},{"english":"Funds were found and, armed with a wealth of enthusiasm, mother and daughter started out.","chinese":"資金終於湊足，懷着滿腔熱忱，母女倆出發了。"},{"english":"We've poured our full enthusiasm.","chinese":"我們傾注了滿腔的澎湃熱情。"},{"english":"She found herself swirling in a sea of resentment towards her abuser.","chinese":"她發現自己將滿腔的憤恨都拋給了她的虐待者。"},{"english":"The right man for the job needs to be enthusiastic and energetic .","chinese":"這份工作適合的人選應該是滿腔熱血而且精力旺盛的。"}],"related":[]}