{"definition":["evolution\/gradual forward progress"],"pinyin":["yan3 jin4"],"simplified":["演进"],"rank":16331.0,"normalized_rank":0.2284918780518517,"fraction":0.0000035436068920734037,"cumulative_fraction":0.9641338690203616,"word":"演進","characters":[{"definition":["to develop\/to evolve\/to practice\/to perform\/to play\/to act"],"pinyin":["yan3"],"word":"演"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[],"sentences":[{"english":"However, features for the later evolutions would require mostly new code.","chinese":"然而，對於後面的演進的特性將主要需要新的代碼。"},{"english":"Investment in asset evolution.","chinese":"投資於資產演進。"},{"english":"It is throughout the maintenance phase that the software evolves the most.","chinese":"軟件的演進主要發生在整個維護階段。"},{"english":"It shows three evolutions for this project, using cylinders to represent iterations.","chinese":"它顯示了該項目的三個演進，用圓柱來表示迭代。"},{"english":"It can even describe how industry structures evolve.","chinese":"它甚至能描述產業結構是如何演進的。"},{"english":"Incentive-compatible regulation is an inevitable trend in the progress of international banking regulation.","chinese":"激勵相容監管是國際銀行業監管演進必然趨勢。"},{"english":"Agile and transparent optical network is one of the significant directions for the evolution of Optical Transport Network (OTN).","chinese":"靈活透明光網絡是傳送網的發展演進方向之一。"},{"english":"Then the author points out the Lunan Economic Belt's strategic position in Shandong province.","chinese":"第三部分詳細闡述了魯南經濟帶城鎮體系的演進歷程。"},{"english":"How do we handle evolution of DSL meta-models and models?","chinese":"如何處理DSL元模型及模型的演進？"},{"english":"Generally speaking, the evolution of constitution can be summed up in two aspects:the pattern of amendment and the pattern of interpretation.","chinese":"大體說來，憲法演進分爲修改模式和解釋模式兩種。"},{"english":"Note that each cylinder is contained within a spiral that represents an evolution.","chinese":"注意到每個圓柱都包含於表示演進的螺旋中。"},{"english":"Photo manipulation is an ever evolving collaboration between photography and graphic design.","chinese":"照片處理是攝影與平面設計兩者不斷演進的合作結晶。"},{"english":"There is a course from requisition-compensation balance of cultivated land to overprotection.","chinese":"耕地從佔補平衡到超額保護經歷了一個演進過程。"},{"english":"It is the first time it has got to this stage with these type of bacteria.","chinese":"這是首次讓此類細菌演進到這種階段。"},{"english":"It would be a natural evolution of microelectronics to become nanoelectronics.","chinese":"它是從微電子學到奈米電子學的自然演進。"},{"english":"Enterprise accounting organization has the internal connection with optimizing company governability.","chinese":"企業會計組織演進與優化公司治理具有內在聯繫。"}],"related":[{"definition":["to transform\/to change"],"pinyin":["bian4 ge2"],"word":"變革"},{"definition":["to develop\/to evolve\/development\/evolution"],"pinyin":["yan3 bian4"],"word":"演變"},{"definition":["to digitalize\/digital"],"pinyin":["shu4 zi4 hua4"],"word":"數字化"},{"definition":["to reconstruct\/reconstruction\/(computing) refactoring"],"pinyin":["chong2 gou4"],"word":"重構"},{"definition":["to industrialize\/industrialization"],"pinyin":["gong1 ye4 hua4"],"word":"工業化"},{"definition":["to put to use\/to apply\/practical\/applied (science, linguistics etc)\/application\/practical use\/(computing) app"],"pinyin":["ying4 yong4"],"word":"應用"},{"definition":["arteries and veins\/network of blood vessels\/vascular system (of a plant or animal)\/(fig.) fabric (i.e. underlying structure, as in \"social fabric\")\/overall context"],"pinyin":["mai4 luo4"],"word":"脈絡"},{"definition":["exclusive\/proprietary"],"pinyin":["zhuan1 you3"],"word":"專有"},{"definition":["socio-economic"],"pinyin":["she4 hui4 jing1 ji4"],"word":"社會經濟"},{"definition":["pioneer"],"pinyin":["xian1 qu1"],"word":"先驅"},{"definition":["variegation\/diversity"],"pinyin":["duo1 yang4 xing4"],"word":"多樣性"},{"definition":["to construct (often sth abstract, such as good relations)\/to set up\/to develop\/construction (abstract)\/architecture"],"pinyin":["jian4 gou4"],"word":"建構"},{"definition":["changes\/vicissitudes"],"pinyin":["bian4 qian1"],"word":"變遷"},{"definition":["to explain\/to expound\/to interpret\/elucidation"],"pinyin":["chan3 shi4"],"word":"闡釋"},{"definition":["now\/nowadays\/modern"],"pinyin":["xian4 jin1"],"word":"現今"},{"definition":["theoretical foundation"],"pinyin":["li3 lun4 ji1 chu3"],"word":"理論基礎"}]}