{"definition":["the Han dynasty (206 BC-220 AD)"],"pinyin":["Han4 dai4"],"simplified":["汉代"],"rank":18130.0,"normalized_rank":0.2536622220978552,"fraction":0.0000028998455576122826,"cumulative_fraction":0.969901734385332,"word":"漢代","characters":[{"definition":["Han ethnic group\/Chinese (language)\/the Han dynasty (206 BC-220 AD)","man"],"pinyin":["Han4","han4"],"word":"漢"},{"definition":["to substitute\/to act on behalf of others\/to replace\/generation\/dynasty\/age\/period\/(historical) era\/(geological) eon"],"pinyin":["dai4"],"word":"代"}],"containing_words":[],"sentences":[{"english":"Analysis about some phenomenon of using characters of bronze inscriptions in the Han Dynasty.","chinese":"分析討論漢代金文中的用字研究。"},{"english":"The Hepu Tombs, from the Han Dynasty, are in Guangxi province.","chinese":"漢代的合浦陵園在廣西省境內。"},{"english":"Xinjiang Karez back in the Han Dynasty two thousand years ago, there were problems of its shape.","chinese":"新疆的坎兒井早在兩千年前的漢代即出現其雛形。"},{"english":"This collection is an excellent example to show artistic style of Han bronze seals.","chinese":"從這些古印中可窺測到漢代銅印藝術特色與風格。"},{"english":"The origin of the military finance in the Han Dynasty can trace back to the Zhou Dynasty, and it consummated in the Qin Dynasty.","chinese":"漢代軍事財政的淵源可溯及到周朝，至秦已比較完善。"},{"english":"It is an important feature of poetic viewpoints of the Han Dynasty.","chinese":"重視詩歌的諷諫功能，是漢代詩學的重要特點。"},{"english":"During the Han Dynasty, perfect dance with fish stage props was found .","chinese":"至漢代已有較完美的持魚道具而舞的形式。"},{"english":"The Mai Jing or Pulse Classic was written in the late Han dynasty by Wang Shu-he.","chinese":"在麥擊嗯或脈衝經典寫後期由汪屬漢代河。"},{"english":"Large dark green lanes, there are gray stone miscellaneous flaws, resulting in the Han Dynasty.","chinese":"大體呈墨綠，雜有灰白石瑕，產生於漢代。"},{"english":"Taixue was very important to the political control and the development of culture in the Han Dynasty.","chinese":"太學對漢代的政治統治和文化發展起了重大作用。"},{"english":"This section points out the astrology flourished during the Han Dynasty various social causes.","chinese":"這一部分分析了星占學在漢代興盛的各種社會原因。"},{"english":"Palace women were a special womans colony in the society in Han dynasty.","chinese":"漢代宮廷女性是社會中一個特殊的女性羣體。"},{"english":"The second point is that the system changes redquin destiny view of Han people and music system in the comments.","chinese":"二爲漢代人天命觀和禮樂制度的變化在註解中的體現。"},{"english":"Art of portrayal bricks have been to the peak early in the development of the Han Dynasty.","chinese":"畫像磚藝術早在漢代就已經發展到了高峯。"},{"english":"No record is found in the Han Dynasty documentation of Mencius' style.","chinese":"孟子之字，在漢代文獻均說未聞。"},{"english":"In Han Dynasty, elite class included merchant elite and township elites.","chinese":"漢代豪民在類型上可大致劃分爲工商豪民和鄉里豪民。"}],"related":[{"definition":["Western Han Dynasty (206 BC-8 AD), also called 前漢|前汉[Qian2 Han4], Former Han Dynasty"],"pinyin":["Xi1 Han4"],"word":"西漢"},{"definition":["Eastern or later Han dynasty, 25-220"],"pinyin":["Dong1 han4"],"word":"東漢"},{"definition":["the Warring States period (475-221 BC)"],"pinyin":["Zhan4 guo2"],"word":"戰國"},{"definition":["Emperor Wu of the Han dynasty (141-87 BC)"],"pinyin":["Han4 Wu3 di4"],"word":"漢武帝"},{"definition":["Han Dynasty (206 BC-220 AD)"],"pinyin":["Han4 chao2"],"word":"漢朝"},{"definition":["etiquette\/system of rites"],"pinyin":["li3 zhi4"],"word":"禮制"},{"definition":["to write down\/to record\/written account"],"pinyin":["ji4 zai3"],"word":"記載"},{"definition":["Han dynasty (206 BC-220 AD)\/refers to the Western Han and Eastern Han"],"pinyin":["liang3 Han4"],"word":"兩漢"},{"definition":["bronze implement\/refers to ancient bronze artifacts, from c. 2,000 BC"],"pinyin":["qing1 tong2 qi4"],"word":"青銅器"},{"definition":["the Qin (221-207 BC) and Han (206 BC-220 AD) dynasties"],"pinyin":["Qin2 Han4"],"word":"秦漢"},{"definition":["to do textual research\/to make textual criticism\/to verify by means of research (esp. historical details)\/to take an exam to get a certificate (abbr. for 考取證件|考取证件[kao3 qu3 zheng4 jian4])"],"pinyin":["kao3 zheng4"],"word":"考證"},{"definition":["Shijing, the Book of Songs, early collection of Chinese poems and one of the Five Classics of Confucianism 五經|五经[Wu3 jing1]"],"pinyin":["Shi1 jing1"],"word":"詩經"},{"definition":["Records of the Grand Historian, by 司馬遷|司马迁[Si1 ma3 Qian1], first of the 24 dynastic histories 二十四史[Er4 shi2 si4 Shi3]"],"pinyin":["Shi3 ji4"],"word":"史記"},{"definition":["handed down from ancient times\/family heirloom"],"pinyin":["chuan2 shi4"],"word":"傳世"},{"definition":["the Rites of Zhou (in Confucianism)"],"pinyin":["Zhou1 li3"],"word":"周禮"},{"definition":["image\/picture\/graphic"],"pinyin":["tu2 xiang4"],"word":"圖像"}]}