{"definition":["aimless\/at random"],"pinyin":["man4 wu2 mu4 di4"],"simplified":["漫无目的"],"rank":32556.0,"normalized_rank":0.4555006785779245,"fraction":7.507629349509172e-7,"cumulative_fraction":0.9923972136746442,"word":"漫無目的","characters":[{"definition":["free\/unrestrained\/to inundate"],"pinyin":["man4"],"word":"漫"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["eye\/item\/section\/list\/catalogue\/table of contents\/order (taxonomy)\/goal\/name\/title"],"pinyin":["mu4"],"word":"目"},{"definition":["aim\/clear","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","really and truly","see 的士[di1 shi4]"],"pinyin":["de5","di1","di2","di4"],"word":"的"}],"containing_words":[],"sentences":[{"english":"People walked through the streets aimlessly with nowhere to go, carrying the few bags and possessions they had left.","chinese":"人們帶着僅剩的財物包裹漫無目的遊蕩。"},{"english":"After getting new email: waste 10 minutes aimlessly surfing the web.","chinese":"漫無目的的上上網，在收到一封信郵件後。"},{"english":"Do you find yourself floundering about aimlessly in life ?","chinese":"你會發現自己上徘徊約漫無目的地在人生？"},{"english":"I stood there, staring blindly across at the park.","chinese":"我站在那裏，兩眼漫無目的地往公園那邊看來看去。"},{"english":"She wandered aimlessly around the streets.","chinese":"她在大街上漫無目的地到處遊蕩。"},{"english":"They are those things that are wandering around aimlessly in your head.","chinese":"它們是一些在你腦中漫無目的遊走的東西。"},{"english":"Shortage is still severe aimlessly flowery and good-looking youth.","chinese":"依舊漫無目的地荒度如花貌美的青春。"},{"english":"A handful of soldiers and some civilians wandered about aimlessly.","chinese":"一小隊士兵和幾個普通市民漫無目的的在街上游蕩着。"},{"english":"He wandered up and down the road aimlessly.","chinese":"他在大街上漫無目的地徘徊。"},{"english":"Without a target, you are aimless.","chinese":"沒有了目標，你就是漫無目的的。"},{"english":"Keeping the information between the two tools synchronized was a hit or miss proposition.","chinese":"保持這兩個工具間的信息同步是一個漫無目的的主張。"},{"english":"Therefore I tended to run away from myself, leading a purposeless life.","chinese":"所以，我總是自我逃避，漫無目的的生活。"},{"english":"I have done unnumbered wrongs, and aimlessly I roam about.","chinese":"我犯了數不清的錯誤，也漫無目的地漫遊着。"},{"english":"If you're only doing without any goal in mind, it's not worth doing.","chinese":"而如果你只是漫無目的的做事，那就不值得了。"},{"english":"When you are aimless, you will not have that power from within to get there.","chinese":"如果你漫無目的，你就不可能有達成願望的能力。"},{"english":"Do you live busily and purposelessly every day ?","chinese":"您還是每天忙碌漫無目的的過日子嗎？"}],"related":[]}