{"definition":["(of water, prices etc) to rise and fall"],"pinyin":["zhang3 luo4"],"simplified":["涨落"],"rank":36097.0,"normalized_rank":0.5050438627173898,"fraction":5.493138098814507e-7,"cumulative_fraction":0.9946817550683312,"word":"漲落","characters":[{"definition":["to rise (of prices, rivers)","to swell\/to distend"],"pinyin":["zhang3","zhang4"],"word":"漲"},{"definition":["colloquial reading for 落[luo4] in certain compounds","to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["la4","lao4","luo4"],"word":"落"}],"containing_words":[],"sentences":[{"english":"It is point out that the fluctuation of structure function lead to nonlinear scaling law.","chinese":"指出結構函數的振盪漲落導致非線性標度律。"},{"english":"The simulated hypoxia phenomena develop during the neap tide and disappear during the spring tide .","chinese":"缺氧現象的發展與減退受潮汐漲落的影響。"},{"english":"This property of the quantum fluctuations is known in statistical mechanics as ergodicity .","chinese":"這個量子漲落的性質在統計力學中稱爲遍歷性。"},{"english":"The quantum fluctuation of this mesoscopic coupling circuit is also discussed.","chinese":"該文還討論了介觀電容耦合電路的量子漲落。"},{"english":"Quantum fluctuations inside the pockets were amplified along with the universe.","chinese":"該區域內的量子漲落隨着宇宙膨脹而被放大。"},{"english":"But the mean temperature could disguise large fluctuations during the day.","chinese":"但是平均溫度可能掩蓋了一天之內溫度大的漲落。"},{"english":"It's a common practice that changes in salary lag changes in prices.","chinese":"工資的漲落隨物價變化而變化是常事兒。"},{"english":"The influence of fluctuation on an auto-oscillation system of Thomson-type is discussed.","chinese":"本文討論漲落對湯姆生型電子管振盪器的影響。"},{"english":"From those density fluctuations galaxies eventually formed.","chinese":"星系最終就是在這些密度漲落中形成的。"},{"english":"We obtain the distribution functions for quarks(and anti-quarks)and gluons under perturbation of the fluctuation of the color field.","chinese":"的夸克和反夸克在色場漲落擾動下偏離平衡較遠。"},{"english":"His breakfast varied in cost from two to four sous, according as eggs were dear or cheap.","chinese":"午餐得花二至四個蘇，隨着蛋價的漲落而不同。"},{"english":"The fluctuation in range is called straggling .","chinese":"粒子射程的漲落稱爲歧離。"}],"related":[]}