{"definition":["progress step by step\/gradual progress\/to move forward (slowly)"],"pinyin":["jian4 jin4"],"simplified":["渐进"],"rank":17606.0,"normalized_rank":0.24633078225343835,"fraction":0.0000030610048576678564,"cumulative_fraction":0.9683414281423552,"word":"漸進","characters":[{"definition":["gradual\/gradually","to imbue"],"pinyin":["jian1","jian4"],"word":"漸"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[{"definition":["in sequence, step by step (idiom); to make steady progress incrementally"],"pinyin":["xun2 xu4 jian4 jin4"],"word":"循序漸進"}],"sentences":[{"english":"Aid to living according to our capability, step-by-step, and gradually increase.","chinese":"生活救助要量力而行，循序漸進，逐步提高。"},{"english":"And as we all know, change is often slow and incremental.","chinese":"正如我們所知，變革往往是緩慢和漸進的。"},{"english":"Go slow; learn what you don't know.","chinese":"循序漸進地學習您不知道的內容。"},{"english":"The pumice flow deposit begins from its bottom, and gradually develops forward.","chinese":"堆積過程是從浮巖流底部漸進式向前堆積。"},{"english":"Remember this is a step by step process.","chinese":"記住，這是一個循序漸進的過程。"},{"english":"With progressive enhancement, we build sites on a foundation of usable code.","chinese":"使用漸進增強，我們在可用代碼的基礎上構建站點。"},{"english":"In a word, the legislation of mercy killing is suitable for gradualness .","chinese":"所以，安樂死立法宜循序漸進。"},{"english":"Conclusions Progressive addition lenses can be used to slow down myopia development effectively in teenagers.","chinese":"結論漸進多焦鏡能有效減緩青少年近視的發展。"},{"english":"What Am I Doing in a Step-Family?","chinese":"我在做什麼在循序漸進的家庭？"},{"english":"Obtain step-by-step guidance for common problem determination tasks.","chinese":"獲得常見問題確定任務的循序漸進的指導。"},{"english":"As long ChuanLang gradual time.","chinese":"宛如冗長漸進的時光穿廊。"},{"english":"It may present with disturbance of visual acuity, and progressive proptosis .","chinese":"它能影響視力及造成漸進性的眼球外凸。"},{"english":"An asymptotic formula is given for the sum, where is the Eulers function.","chinese":"設表示歐拉函數，用分析方法給出了的一個漸進公式。"},{"english":"The result is a pandemic of not just incrementalism but also academic dishonesty.","chinese":"結果不僅導致漸進主義蔓延，還造成學術欺詐盛行。"},{"english":"And in advancing East Asian cooperation, we should follow a step-by-step approach. We should start with the easier tasks before moving on to the more difficult ones.","chinese":"推進東亞合作，要循序漸進，先易後難。"},{"english":"Another person demonstrated an unusual, progressive fatal neurological illness.","chinese":"另一人呈現異常的漸進性致命神經系統疾病。"}],"related":[{"definition":["in sequence, step by step (idiom); to make steady progress incrementally"],"pinyin":["xun2 xu4 jian4 jin4"],"word":"循序漸進"},{"definition":["to approach (a numerical value)\/to converge to a limit (in calculus)\/convergence"],"pinyin":["qu1 jin4"],"word":"趨近"},{"definition":["to change\/to transform\/shift\/transformation\/CL:個|个[ge4]"],"pinyin":["zhuan3 bian4"],"word":"轉變"},{"definition":["(economics) to reduce\/to curtail\/to cut back\/to tighten\/austerity\/tightening\/crunch"],"pinyin":["jin3 suo1"],"word":"緊縮"},{"definition":["to change direction\/fig. to change one's stance","to get lost\/to lose one's way"],"pinyin":["zhuan3 xiang4","zhuan4 xiang4"],"word":"轉向"},{"definition":["to pull back\/to shrink\/to contract\/(physiology) systole"],"pinyin":["shou1 suo1"],"word":"收縮"},{"definition":["balance sheet"],"pinyin":["zi1 chan3 fu4 zhai4 biao3"],"word":"資產負債表"},{"definition":["to cut\/to reduce"],"pinyin":["suo1 jian3"],"word":"縮減"},{"definition":["to turn back\/to reverse"],"pinyin":["ni4 zhuan3"],"word":"逆轉"},{"definition":["to trigger\/to spark"],"pinyin":["chu4 fa1"],"word":"觸發"},{"definition":["to intensify\/to sharpen\/to accelerate\/to aggravate\/to exacerbate\/to embitter"],"pinyin":["jia1 ju4"],"word":"加劇"},{"definition":["slow\/slow-moving"],"pinyin":["huan3 man4"],"word":"緩慢"},{"definition":["direction\/trend\/to incline"],"pinyin":["qu1 xiang4"],"word":"趨向"},{"definition":["to borrow sb's authority\/to seize an opportunity"],"pinyin":["jie4 shi4"],"word":"借勢"},{"definition":["to reverse\/to turn around (an undesirable situation)\/(mechanics) torsion"],"pinyin":["niu3 zhuan3"],"word":"扭轉"},{"definition":["less advanced\/underdeveloped\/lagging behind\/the younger generation\/the less experienced ones"],"pinyin":["hou4 jin4"],"word":"後進"}]}