{"definition":["unspoken rules (usually ones that codify improper behaviors such as leveraging guanxi to get favorable treatment, or coercing employees for sexual favors)"],"pinyin":["qian2 gui1 ze2"],"simplified":["潜规则"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"潛規則","characters":[{"definition":["hidden\/secret\/latent\/to hide\/to conceal\/to submerge\/to dive"],"pinyin":["qian2"],"word":"潛"},{"definition":["compass\/a rule\/regulation\/to admonish\/to plan\/to scheme"],"pinyin":["gui1"],"word":"規"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"則"}],"containing_words":[],"sentences":[{"english":"Our problem is, bribery has become a hidden regulation of society connivance.","chinese":"我們的問題是，行賄受賄成爲社會默認的潛規則。"},{"english":"What are the unspoken rules?","chinese":"貴公司的潛規則是什麼？"},{"english":"The latent regulation embeds in the normal regulation and in the traditional culture.","chinese":"潛規則交易嵌於正式規則和傳統文化當中。"},{"english":"Depressingly, these market-distorting shenanigans are part of a pattern.","chinese":"令人沮喪的是，這些扭曲市場的詭計成了潛規則。"},{"english":"Baidu's entertainment spirit is to do away with hidden rules and regulations, and let the talented have the opportunity.","chinese":"打破潛規則，讓有才的人有機會，是百度娛樂的精神。"},{"english":"Do your job well, and you can sleep with sexy movie stars who depend on you.","chinese":"混得好的話，你可以潛規則那些有求於你的性感女星。"},{"english":"Hidden rules always cost a lot, some of them are not retrievable.","chinese":"其實潛規則也要付出代價的，有些根本無法挽回。"},{"english":"In addition to what's highlighted in the company handbook, what are the unwritten rules?","chinese":"除了公司手冊中的要點之外，還有哪些潛規則？"},{"english":"I think there must be some hidden rules that you do not know.","chinese":"你聽說最近發生在大學裏的潛規則醜聞了麼？"},{"english":"This is the principle behind Japanese style homes.","chinese":"這就是日本式家園的潛規則。"}],"related":[{"definition":["person who writes articles - newspapers, magazines, blogs (informal)\/scribe\/copyist\/a talented writer of articles or of calligraphy"],"pinyin":["xie3 shou3"],"word":"寫手"},{"definition":["to return\/to go back"],"pinyin":["zhuan4 qu4"],"word":"轉去"},{"definition":["to lose money instead of being paid (i.e. sb should pay me, but is actually taking my money)"],"pinyin":["dao4 tie1"],"word":"倒貼"},{"definition":["the end\/to conclude","to leave (the stage, an exam room, the playing field etc)\/to take part in some activity\/to take an examination (in the imperial examination system)"],"pinyin":["xia4 chang3","xia4 chang5"],"word":"下場"},{"definition":["to take one's seat according to the ticket number\/(fig.) to put (things or people) in their right place\/to take a general comment as a personal attack"],"pinyin":["dui4 hao4 ru4 zuo4"],"word":"對號入座"},{"definition":["to expel (a member of an organization)\/to fire (an employee)"],"pinyin":["kai1 chu2"],"word":"開除"},{"definition":["in public\/in front of everybody"],"pinyin":["dang1 zhong4"],"word":"當眾"},{"definition":["to shut out\/to block\/to smother"],"pinyin":["feng1 sha1"],"word":"封殺"},{"definition":["\"sensational headline writers\", people who write misleading titles in order to generate clicks from Internet users\/clickbait"],"pinyin":["biao1 ti2 dang3"],"word":"標題黨"},{"definition":["one by one\/one after another"],"pinyin":["yi1 ge5 jie1 yi1 ge5"],"word":"一個接一個"},{"definition":["to sneer at sb\/to ridicule"],"pinyin":["chi3 xiao4"],"word":"恥笑"},{"definition":["farce\/CL:場|场[chang3],齣|出[chu1],幕[mu4]"],"pinyin":["nao4 ju4"],"word":"鬧劇"},{"definition":["When you enter a village, follow the local customs (idiom); do as the natives do\/When in Rome, do as the Romans do"],"pinyin":["ru4 xiang1 sui2 su2"],"word":"入鄉隨俗"},{"definition":["scum of a community\/degenerate"],"pinyin":["bai4 lei4"],"word":"敗類"},{"definition":["criminal underworld\/organized crime syndicate"],"pinyin":["hei1 she4 hui4"],"word":"黑社會"},{"definition":["to offer for sale\/to sell\/to sell out or betray"],"pinyin":["chu1 mai4"],"word":"出賣"}]}