{"definition":["to spur sb into action by making negative remarks"],"pinyin":["ji1 jiang4"],"simplified":["激将"],"rank":51454.0,"normalized_rank":0.7199082170889707,"fraction":1.2291316181774687e-7,"cumulative_fraction":0.9991537408371972,"word":"激將","characters":[{"definition":["to arouse\/to incite\/to excite\/to stimulate\/sharp\/fierce\/violent"],"pinyin":["ji1"],"word":"激"},{"definition":["general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead","to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])"],"pinyin":["jiang1","jiang4","qiang1"],"word":"將"}],"containing_words":[{"definition":["indirect, psychological method of getting sb to do as one wishes (e.g. questioning whether they are up to the task)"],"pinyin":["ji1 jiang4 fa3"],"word":"激將法"},{"definition":["lit. to dispatch a general is not as effective as to excite a general\/fig. inciting people to action is more effective than dispatching orders"],"pinyin":["qing3 jiang4 bu4 ru2 ji1 jiang4"],"word":"請將不如激將"}],"sentences":[{"english":"I provoked him into doing something really stupid.","chinese":"我用激將法使他做了件很蠢的事。"},{"english":"However, excessive or aberrant ER stress results in cell injury or death.","chinese":"過度的內質網應激將導致細胞損害和死亡。"},{"english":"The dual stimulation of right and left hands will provide much pleasure for the receiver.","chinese":"左右手的雙倍刺激將給予她多而多之的快感。"},{"english":"He's just egging you on.","chinese":"這不過是他的激將法。"},{"english":"Such a \"blindingly\" general will not be any good results.","chinese":"這樣的“激將法”一般不會有好效果。"},{"english":"He did it on a dare.","chinese":"他是在激將法的鼓動下做這件事的。"},{"english":"Of Li Heping risk danger in desperation stimulate will conspiratorial have one's way.","chinese":"李和平鋌而走險的激將陰謀得逞了。"},{"english":"I dared him to jump from the bridge into the river.","chinese":"我用激將法要他從橋上跳入水中。"},{"english":"He jumped in the river at twelve o'clock last night for a dare.","chinese":"昨天夜裏十二點，他在激將法的鼓動下跳進河裏。"},{"english":"Thrill of the Hunt grants Focus when you land a critical strike.","chinese":"狩獵刺激將在你造成暴擊以後獲得集中值。"}],"related":[]}