{"definition":["to arouse\/to excite"],"pinyin":["ji1 fa1"],"simplified":["激发"],"rank":5494.0,"normalized_rank":0.07686818798707204,"fraction":0.000020934505490642833,"cumulative_fraction":0.8700310173246966,"word":"激發","characters":[{"definition":["to arouse\/to incite\/to excite\/to stimulate\/sharp\/fierce\/violent"],"pinyin":["ji1"],"word":"激"},{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"}],"containing_words":[{"definition":["booster shot\/booster injection"],"pinyin":["ji1 fa1 zhu4 she4"],"word":"激發注射"}],"sentences":[{"english":"Encourage her release by constructing an erotic fantasy before things heat up.","chinese":"應當在高潮激發前鼓勵她通過性幻想放鬆自己。"},{"english":"Throughout their history, the pyramids of Giza have stimulated human imagination.","chinese":"縱觀歷史，吉薩金子塔激發了人類的想象。"},{"english":"Thirdly, Trammell was really a good rival.","chinese":"第三，特拉梅爾是一位可以激發劉翔潛能的對手。"},{"english":"In doing this, more people will be inspired and encouraged to write.","chinese":"如此拋磚引玉，能激發與鼓勵更多人加入寫作隊伍。"},{"english":"Most managers attempt to influence employee motivation using both positive and negative approaches.","chinese":"大多數經理試圖正負雙法並舉，激發員工的積極性。"},{"english":"Point blank, it increases brain function. Barlean's makes a fish oil foam called Omega Swirl that tastes like candy.","chinese":"它能夠激發空白點，提高腦功能。"},{"english":"The design of the film-systems used for bio-fluorescence excitation and barrier filters were discussed in this paper.","chinese":"本文論述生物熒光激發濾光片及柵濾光片的膜系設計。"},{"english":"Let your kids rest on pillows designed to inspire musical dreams.","chinese":"讓你的孩子們偎依在能激發音樂夢想的枕頭上。"},{"english":"It is that quantitative difference that drives the interest in digital TV.","chinese":"正是這種質量差別激發我們對數字電視的興趣。"},{"english":"Improve the production efficiency, improve the overall quality, potential to inspire.","chinese":"提高生產效率，提升員工整體素質，潛質激發。"},{"english":"The labor song is the oldest ballad directly originating from physical labor.","chinese":"勞動歌是由體力勞動直接激發起來的最古老的歌謠。"},{"english":"The new classification has certainly caught the imagination of Internet users.","chinese":"這種新的分類當然激發了網友們的奇思妙想。"},{"english":"According to the Law of Attraction, a powerful intent made up of clear, pure and focused thoughts will start to attract the very essence of your desires.","chinese":"根據引力定律，一個明確的想法會激發你的所有慾望。"},{"english":"The power of the mind's creativity depends on the constant stimulation and encouragements.","chinese":"心靈的創造力是需要被時時的激發的。"},{"english":"But such triggers don't seem to trouble the patients with a damaged insula.","chinese":"但是這種激發看來已不會困擾島葉皮層損傷的患者。"},{"english":"Snow shoveling is a known trigger for heart attacks.","chinese":"剷雪是一個已知的心臟病發作激發因素。"}],"related":[{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"},{"definition":["to display\/to exhibit\/to bring out implicit or innate qualities\/to express (a thought or moral)\/to develop (an idea)\/to elaborate (on a theme)"],"pinyin":["fa1 hui1"],"word":"發揮"},{"definition":["to release\/to set free\/to liberate (a prisoner)\/to discharge"],"pinyin":["shi4 fang4"],"word":"釋放"},{"definition":["to create\/to bring about\/to produce\/to set (a record)"],"pinyin":["chuang4 zao4"],"word":"創造"},{"definition":["to enlighten\/to explain (a text etc)\/to stimulate (a mental attitude)\/enlightenment\/revelation\/motivation"],"pinyin":["qi3 fa1"],"word":"啟發"},{"definition":["to change\/to transform\/isomerization (chemistry)"],"pinyin":["zhuan3 hua4"],"word":"轉化"},{"definition":["to encourage\/to urge\/motivation\/incentive"],"pinyin":["ji1 li4"],"word":"激勵"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["ingenuity\/creativity"],"pinyin":["chuang4 zao4 li4"],"word":"創造力"},{"definition":["to increase\/to strengthen"],"pinyin":["zeng1 qiang2"],"word":"增強"},{"definition":["to guide\/to lead (around)\/to conduct\/to boot\/introduction\/primer"],"pinyin":["yin3 dao3"],"word":"引導"},{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"word":"展現"},{"definition":["potential\/hidden capability"],"pinyin":["qian2 neng2"],"word":"潛能"},{"definition":["to encourage"],"pinyin":["gu3 li4"],"word":"鼓勵"},{"definition":["to cultivate\/to breed\/to foster\/to nurture\/to educate\/to groom (for a position)\/education\/fostering\/culture (biology)"],"pinyin":["pei2 yang3"],"word":"培養"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰顯"}]}