{"definition":["turbidity"],"pinyin":["zhuo2 du4"],"simplified":["浊度"],"rank":47589.0,"normalized_rank":0.6658318525876905,"fraction":1.8466169798034416e-7,"cumulative_fraction":0.9985645697340091,"word":"濁度","characters":[{"definition":["turbid\/muddy\/impure"],"pinyin":["zhuo2"],"word":"濁"},{"definition":["to estimate\/Taiwan pr. [duo4]","to pass\/to spend (time)\/measure\/limit\/extent\/degree of intensity\/degree (angles, temperature etc)\/kilowatt-hour\/classifier for events and occurrences"],"pinyin":["du4","duo2"],"word":"度"}],"containing_words":[],"sentences":[{"english":"NH3-N and concentration of particles reached lnd standard of sewage treatment plant.","chinese":"濃度和濁度達到國家一級排放標準。"},{"english":"Conclusion Electromagnetic fields can be used to reduce turbidity value and fluoride in water.","chinese":"目的探討複合電磁場降低水的渾濁度和除氟功能。"},{"english":"The power is calculated and model is selected by water treatment amounts and turbid degree of inlet and outlet of water.","chinese":"通過實際處理水量與進出水濁度計算功率和選型。"},{"english":"METHODS Gel clot and kinetic turbidimetric limulus tests were applied.","chinese":"方法採用凝膠法和動態濁度法鱟試驗。"},{"english":"OBJECTIVE To establish a turbidimetric assay method to determine Tobramycin sulfate injection.","chinese":"目的採用濁度法測定硫酸妥布黴素注射液的含量。"},{"english":"Unqualified detected items in secondary water supply primarily were the concentrations of turbidity and iron.","chinese":"二次供水不合格的檢測項目主要爲渾濁度和鐵。"},{"english":"And for those on the sidelines without a job it's a troubling requirement.","chinese":"對那些沒有工作的旁觀者來說，這是一個濁度需求。"},{"english":"The ratio between turbidity and the concentration of high-turbidity water of the Huanghe River is not constant.","chinese":"黃河水的濁度與含沙量之間沒有固定的比值關係。"},{"english":"The stirring with center pipe and flocculate has little effect to the effluent turbidity.","chinese":"中心管加攪拌以及攪拌絮凝對出水濁度影響甚微。"},{"english":"Stub tube fillers have practical significance for the removal of turbidity.","chinese":"短管填料對水濁度去除有着重要的實用意義。"},{"english":"Any turbidity in the drinking water is automatically associated with possible wastewater pollution.","chinese":"飲水中的任何濁度都被自然地聯想到可能是廢水污染。"},{"english":"The study applying scatter light turbidity measurement to design a turbidimeter system.","chinese":"課題中運用了散射光濁度測量方法來研製濁度儀。"},{"english":"The study applying scatter light turbidity measurement to design a turbidimeter system.","chinese":"課題中運用了散射光濁度測量方法來研製濁度儀。"},{"english":"Objective To establish a turbidimetric method for the contents determination of minocycline hydrochloride capsule.","chinese":"目的建立濁度法測定鹽酸米諾環素膠囊的效價。"},{"english":"Turbidity reflected the content of insoluble aggregates contained in protein.","chinese":"濁度反映了蛋白中不溶性聚集體的含量。"}],"related":[]}