{"definition":["enriched uranium"],"pinyin":["nong2 suo1 you2"],"simplified":["浓缩铀"],"rank":15975.0,"normalized_rank":0.2235109761728205,"fraction":0.0000036852051901294777,"cumulative_fraction":0.9628480512241434,"word":"濃縮鈾","characters":[{"definition":["concentrated\/dense\/strong (smell etc)"],"pinyin":["nong2"],"word":"濃"},{"definition":["to withdraw\/to pull back\/to contract\/to shrink\/to reduce\/abbreviation\/also pr. [su4]"],"pinyin":["suo1"],"word":"縮"},{"definition":["uranium (chemistry)\/Taiwan pr. [you4]"],"pinyin":["you2"],"word":"鈾"}],"containing_words":[{"definition":["low-enriched uranium"],"pinyin":["di1 nong2 suo1 you2"],"word":"低濃縮鈾"},{"definition":["highly enriched uranium (HEU)"],"pinyin":["gao1 nong2 suo1 you2"],"word":"高濃縮鈾"}],"sentences":[{"english":"So we're confident that the North Koreans do, in fact, have a program to enrich uranium to produce nuclear weapons.","chinese":"因此，我們確知北韓有製造核武器的濃縮鈾項目。"},{"english":"The plant did not process weapon-grade uranium till 1987.","chinese":"到1987年，該廠就不再生產軍用濃縮鈾了。"},{"english":"Like enriched uranium, hypocrisy can be costlier than it seems.","chinese":"就如濃縮鈾，僞善的代價比看起來的更高。"},{"english":"Plutonium and highly enriched uranium can be used to build nuclear weapons.","chinese":"鈽元素以及高度濃縮鈾可以用來製造核武器。"},{"english":"Iran's Foreign Minister Manouchehr Mottaki says his country has no reason to suspend its nuclear activities.","chinese":"伊朗外長穆塔基說，伊朗沒有理由中止濃縮鈾活動。"},{"english":"A visit to the uranium enrichment facility in Natanz is also on the agenda.","chinese":"訪問日程還包括訪問納坦茲的濃縮鈾設施。"},{"english":"If you keep a Betta in a bowl, make sure you give it plenty of enrichment.","chinese":"如果您保持鬥魚在一碗，一定要給予足夠的濃縮鈾。"},{"english":"Enriching raw uranium is more expensive than converting highly enriched uranium to fuel grade.","chinese":"濃縮原鈾比將高濃縮鈾轉化至燃料品級更昂貴。"},{"english":"Fissile materials used in nuclear bomb production include highly enriched uranium and plutonium.","chinese":"用於製造核彈的裂變材料包括高濃縮鈾和鈈。"},{"english":"Iran has said it was seeking enriched uranium for a civilian nuclear-powered electricity program.","chinese":"伊朗表示尋求濃縮鈾是爲了一個民用核電項目。"},{"english":"What I can verify is that the issue of enriched uranium has been touched upon.","chinese":"我可以證實的是，濃縮鈾的問題在會上有所提及。"},{"english":"Canada agreed to give up a significant quantity of highly enriched uranium.","chinese":"加拿大同意放棄相當數量的高純度濃縮鈾。"}],"related":[]}