{"definition":["to congregate in one hall (idiom); to gather under one roof"],"pinyin":["ji3 ji3 yi1 tang2"],"simplified":["济济一堂"],"rank":32928.0,"normalized_rank":0.4607054412155639,"fraction":7.266766265186983e-7,"cumulative_fraction":0.99267193305801,"word":"濟濟一堂","characters":[{"definition":["only used in 濟濟|济济[ji3 ji3]","to cross a river\/to aid or relieve\/to be of help","used in place names associated with the Ji River 濟水|济水[Ji3 Shui3]\/surname Ji"],"pinyin":["Ji3","ji3","ji4"],"word":"濟"},{"definition":["only used in 濟濟|济济[ji3 ji3]","to cross a river\/to aid or relieve\/to be of help","used in place names associated with the Ji River 濟水|济水[Ji3 Shui3]\/surname Ji"],"pinyin":["Ji3","ji3","ji4"],"word":"濟"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["(main) hall\/large room for a specific purpose\/CL:間|间[jian1]\/relationship between cousins etc on the paternal side of a family\/of the same clan\/classifier for classes, lectures etc\/classifier for sets of furniture"],"pinyin":["tang2"],"word":"堂"}],"containing_words":[],"sentences":[{"english":"Linguists from all over the country assembled at the symposium.","chinese":"研討會上全國的語言學家濟濟一堂。"},{"english":"Participants from different parts of the world have come to compete and win the prestigious title of the Big Fish Hunter.","chinese":"來自各地的參賽者濟濟一堂，都來爭奪釣魚王的稱號。"},{"english":"The chaplain came and preaches to a packed church.","chinese":"牧師來了，向濟濟一堂的教友們布了道。"},{"english":"The guests gathered in the banquet hall, the Great Hall of the People, which was filled with warm and festive atmosphere. The national emblem was placed above the podium.","chinese":"人民大會堂宴會廳內賓朋濟濟一堂，氣氛喜慶熱烈。"}],"related":[]}