{"definition":["filter"],"pinyin":["lu:4 bo1 qi4"],"simplified":["滤波器"],"rank":33965.0,"normalized_rank":0.4752144166328544,"fraction":6.639062469680675e-7,"cumulative_fraction":0.9933918659561012,"word":"濾波器","characters":[{"definition":["to strain\/to filter"],"pinyin":["lu:4"],"word":"濾"},{"definition":["Poland\/Polish\/abbr. for 波蘭|波兰[Bo1 lan2]","wave\/ripple\/storm\/surge"],"pinyin":["Bo1","bo1"],"word":"波"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[],"sentences":[{"english":"Using low pass filters before the readout device may also reduce bandwidth.","chinese":"在讀出設備之前採用低通濾波器也可以減小帶寬。"},{"english":"The relation between the filter sampling time and cutting error is fuzzed .","chinese":"將濾波器的採樣時間與剪切誤差之間的關係模糊化。"},{"english":"The theory provided a new way to fabricate ultra-narrow optical filters.","chinese":"這將爲設計一種全新的濾波器提供指導。"},{"english":"The last 4 times decimation was achieved by two half-band filters and a droop FIR.","chinese":"剩餘4倍抽取採用兩級半帶濾波器和升幅FIR實現。"},{"english":"Multi-scale edge detection based on over-sampled filter banks is studied.","chinese":"研究基於過採樣濾波器組的多尺度邊緣檢測算法。"},{"english":"In addition, the manufacturing advantages known from E-plane technology are maintained.","chinese":"而且，雙工器中的濾波器保持了E面的製造加工優勢。"},{"english":"Formulas are derived for the solution of the transient currents of dissipative low-pass T-type electric wave filters.","chinese":"此篇先推求收端加電阻時，低頻濾波器瞬流之公式。"},{"english":"This paper design a 4-step band pass digital filter.","chinese":"本文設計了一個4階帶通數字濾波器。"},{"english":"A novel method to suppress the spurious response of microstrip bandpass filter is proposed in this paper.","chinese":"提出了新的抑制微帶帶通濾波器寄生通帶的方法。"},{"english":"Metallized film capacitors & filters, VDE, UL, TUV approved.","chinese":"金屬化薄膜電容器&濾波器，有VDE等多項認證。"},{"english":"Near perfect reconstruction cosine-modulated filter banks with high stop attenuation can be achieved using the proposed method.","chinese":"該方法可獲得很高阻帶衰減的餘弦調製濾波器組。"},{"english":"New filters are costless in operation when used in HVDC power transmission system.","chinese":"新濾波器用在高壓直流輸電系統中將節省運行成本。"},{"english":"We use a new deblurring function that is easier to implement than inverse filter.","chinese":"採用了新的消模糊函數，它比起逆濾波器較易於製作。"},{"english":"Finally, the simulation results are given to testify that the notch filter can suppress the vibration effectively.","chinese":"最後，仿真結果證明了陷波濾波器抑制振動的有效性。"},{"english":"Also given is a simple technique to generate binary phase-only filters with CCD camera, PC\/XT computer and photographic film.","chinese":"同時還給出了製作二元純位相濾波器的簡單方法。"},{"english":"Using steerable filters in wavelet analysis, a new algorithm is proposed in the paper.","chinese":"文中結合方向可調濾波器，給出了一種新的融合算法。"}],"related":[]}