{"definition":["Shenyang subprovincial city and capital of Liaoning province 遼寧省|辽宁省 in northeast China\/old names include Fengtian 奉天, Shengjing 盛京 and Mukden"],"pinyin":["Shen3 yang2"],"simplified":["沈阳"],"rank":2028.0,"normalized_rank":0.028374351153582476,"fraction":0.00007530927378756336,"cumulative_fraction":0.7325979886721128,"word":"瀋陽","characters":[{"definition":["liquid\/to pour"],"pinyin":["shen3"],"word":"瀋"},{"definition":["positive (electric.)\/sun\/male principle (Taoism)\/Yang, opposite: 陰|阴[yin1]"],"pinyin":["yang2"],"word":"陽"}],"containing_words":[{"definition":["Shenyang subprovincial city and capital of Liaoning province 遼寧省|辽宁省 in northeast China\/old names include Fengtian 奉天, Shengjing 盛京 and Mukden"],"pinyin":["Shen3 yang2 shi4"],"word":"瀋陽市"},{"definition":["Mukden Palace, aka Shenyang Imperial Palace, the main imperial palace during the early years of the Qing dynasty (1625-1644), a secondary palace in subsequent years, now a museum"],"pinyin":["Shen3 yang2 Gu4 gong1"],"word":"瀋陽故宮"}],"sentences":[{"english":"Currently, I'm the general engineer of Shenyang Machine Tools Plant in charge of Quality control.","chinese":"目前我任瀋陽機械工具廠總工程師，負責質量控制。"},{"english":"The first group of affordable public housing tenants in Shenyang moved into their new homes yesterday.","chinese":"瀋陽市保障性住房第一批住戶昨天喜遷新居。"},{"english":"Beiling airport is used by Shenyang Aircraft Corporation for test flights.","chinese":"北陵機場是由瀋陽飛機工業公司使用的飛行試驗。"},{"english":"This world of difference continues almost a year in Shenyang labour market of migrant workers.","chinese":"瀋陽農民工市場的冰火兩重天已持續了快一年的時間。"},{"english":"China would likely respond by mobilizing the Shenyang Military Region forces and could send forces into North Korea to control refugee flow.","chinese":"中國可能出動瀋陽軍區的部隊進入朝鮮以控制難民潮。"},{"english":"How far is it from Shenyang Railway Station to Taiyuan Business Street?","chinese":"從瀋陽站到太原街有多遠的路程？"},{"english":"Traders in pet markets in Shenyang experienced the same conditions as Chen.","chinese":"和陳琦一樣無奈的還有瀋陽市寵物市場的攤主們。"},{"english":"Room 905, Jinli Mansion, No. 115 Beizhan Road, Shenhe District, Shenyang.","chinese":"瀋陽市瀋河區北站路115號金利大廈905室。"},{"english":"Shenyang Refrigerator Cars licensing unit series.","chinese":"瀋陽牌冷藏車製冷機組系列。"},{"english":"The examined specimens are deposited in the Institute of Entomology, Shenyang Normal University.","chinese":"研究標本保存於瀋陽師範大學昆蟲研究所。"},{"english":"Students attend college entrance exam at a middle school in Shenyang, Liaoning Province.","chinese":"遼寧瀋陽的一所中學內，學生們正在進行高考。"},{"english":"The picture left shows the Shenyang Tiexi new town.","chinese":"左圖爲瀋陽鐵西新城。"},{"english":"The Monday venue is the Foreign Affairs Hotel of Shenyang Normal University.","chinese":"週一的口試考場爲瀋陽師範大學外事賓館。"},{"english":"It became known as Shen Prefecture in the Jin Dynasty and Shenyang Path in the Yuan Dynasty.","chinese":"它成爲縣被稱爲沉金代王朝路徑和瀋陽元。"},{"english":"Curious to see the changes for myself, I visited Shenyang last month.","chinese":"懷着眼見爲實的好奇心，我上個月參觀了瀋陽。"},{"english":"Dog grain that Shenyang pet shop sells. Where does the pet articles for use toy wait to replenish stock?","chinese":"瀋陽寵物店賣的狗糧。寵物用品玩具等在哪進貨？"}],"related":[{"definition":["Changchun subprovincial city and capital of Jilin province 吉林省 in northeast China"],"pinyin":["Chang2 chun1"],"word":"長春"},{"definition":["Harbin, subprovincial city and capital of Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Ha1 er3 bin1"],"word":"哈爾濱"},{"definition":["Zhengzhou prefecture level city and capital of Henan Province in central China"],"pinyin":["Zheng4 zhou1"],"word":"鄭州"},{"definition":["Guiyang prefecture-level city and capital of Guizhou province 貴州|贵州[Gui4 zhou1], short name 筑[Zhu4]"],"pinyin":["Gui4 yang2"],"word":"貴陽"},{"definition":["Qingdao, subprovincial city in Shandong"],"pinyin":["Qing1 dao3"],"word":"青島"},{"definition":["Chongqing city (Chungking), formerly in Sichuan province, a municipality since 1997, short name 渝[Yu2]"],"pinyin":["Chong2 qing4"],"word":"重慶"},{"definition":["Changsha prefecture-level city and capital of Hunan province in south central China"],"pinyin":["Chang2 sha1"],"word":"長沙"},{"definition":["Wuxi prefecture level city in Jiangsu"],"pinyin":["Wu2 xi1"],"word":"無錫"},{"definition":["Taibei or Taipei, capital of Taiwan"],"pinyin":["Tai2 bei3"],"word":"臺北"},{"definition":["Xiamen or Amoy, subprovincial city in Fujian, abbr. 廈|厦[Xia4]"],"pinyin":["Xia4 men2"],"word":"廈門"},{"definition":["Dalian subprovincial city in Liaoning province 遼寧省|辽宁省 in northeast China"],"pinyin":["Da4 lian2"],"word":"大連"},{"definition":["Northeast China\/Manchuria","northeast"],"pinyin":["Dong1 bei3","dong1 bei3"],"word":"東北"},{"definition":["Jinan, subprovincial city and capital of Shandong province in northeast China"],"pinyin":["Ji3 nan2"],"word":"濟南"},{"definition":["Guangzhou subprovincial city and capital of Guangdong\/Canton"],"pinyin":["Guang3 zhou1"],"word":"廣州"},{"definition":["Ürümqi or Urumqi prefecture level city and capital of Xinjiang Uighur autonomous region 新疆維吾爾自治區|新疆维吾尔自治区 in west China"],"pinyin":["Wu1 lu3 mu4 qi2"],"word":"烏魯木齊"},{"definition":["Dongguan prefecture-level city in Guangdong 廣東省|广东省[Guang3 dong1 sheng3]"],"pinyin":["Dong1 guan3"],"word":"東莞"}]}