{"definition":["area under irrigation"],"pinyin":["guan4 qu1"],"simplified":["灌区"],"rank":27727.0,"normalized_rank":0.3879367033705036,"fraction":0.0000011552669389853309,"cumulative_fraction":0.9878691840292962,"word":"灌區","characters":[{"definition":["to irrigate\/to pour\/to install (software)\/to record (music)"],"pinyin":["guan4"],"word":"灌"},{"definition":["area\/region\/district\/small\/distinguish\/CL:個|个[ge4]","surname Ou"],"pinyin":["Ou1","qu1"],"word":"區"}],"containing_words":[],"sentences":[{"english":"The interconnection of the monitoring system of large irrigating area is a physical platform of digital irrigating area.","chinese":"大型灌區監控系統互聯是數字化灌區的物理平臺。"},{"english":"The interconnection of the monitoring system of large irrigating area is a physical platform of digital irrigating area.","chinese":"大型灌區監控系統互聯是數字化灌區的物理平臺。"},{"english":"Expedite Water Saving Tune-up, Push forward Reform and Promote Sustainable Development of the Irrigated area.","chinese":"狠抓節水改造積極推進改革促進灌區可持續發展。"},{"english":"The gap between the supply and demand is complemented by the waters here.","chinese":"合肥用水的缺口就是依靠淠史杭灌區填補。"},{"english":"According to the measured data, the sediment deposition in the canal system of Weishan Irrigation District was analyzed.","chinese":"根據實測資料，分析位山灌區渠系泥沙淤積問題。"},{"english":"Sangganhe Irrigation District on the upper reaches of Yongdinghe River is one of large-scale artesian irrigation districts in Shanxi province.","chinese":"永定河上游桑乾河灌區是山西省大型自流灌區之一。"},{"english":"Sangganhe Irrigation District on the upper reaches of Yongdinghe River is one of large-scale artesian irrigation districts in Shanxi province.","chinese":"永定河上游桑乾河灌區是山西省大型自流灌區之一。"},{"english":"In the end, this paper also present points of sediments rational utilization in the Yellow River irrigation district and the ways …","chinese":"提出了引黃灌區泥沙資源的合理利用與優化配置途徑。"},{"english":"The problem of the sediment is beginning playing a important role in the development and building of Yellow River irrigation district more and more.","chinese":"泥沙問題越來越嚴重地影響到引黃灌區的建設與發展。"},{"english":"Shaoshan Irrigation Area building is a worthy monument of history.","chinese":"韶山灌區的建設不愧是一座歷史的豐碑。"},{"english":"Water-saving modification works usually result in a large amount of spoil .","chinese":"景電一期灌區是全國大型灌區節水改造重點工程之一。"},{"english":"Water-saving modification works usually result in a large amount of spoil .","chinese":"景電一期灌區是全國大型灌區節水改造重點工程之一。"},{"english":"In this paper, the application of the piping in canal irrigation district is introduced.","chinese":"本文闡述了管道輸水灌溉在渠灌區中的應用形式。"},{"english":"Head-end measurement method is applied in sample irrigation districts.","chinese":"樣點灌區採用首尾測算分析方法。"},{"english":"Zhenlai irrigation area is located at the Songnen plain on the west bank of Nenjiang river in the northwestward of Jilin province.","chinese":"鎮賚灌區位於吉林省西北部邊緣嫩江西岸松嫩平原。"},{"english":"In water-saving irrigation projects, concrete-lined channel is of great importance.","chinese":"在灌區節水項目建設中，渠道砼襯砌佔有重要地位。"}],"related":[]}