{"definition":["to pour into\/perfusion (med.)\/to concentrate one's attention on\/to teach\/to inculcate\/to instill"],"pinyin":["guan4 zhu4"],"simplified":["灌注"],"rank":31801.0,"normalized_rank":0.44493724903110266,"fraction":8.025849924869031e-7,"cumulative_fraction":0.9918103611341056,"word":"灌注","characters":[{"definition":["to irrigate\/to pour\/to install (software)\/to record (music)"],"pinyin":["guan4"],"word":"灌"},{"definition":["to inject\/to pour into\/to concentrate\/to pay attention\/stake (gambling)\/classifier for sums of money\/variant of 註|注[zhu4]"],"pinyin":["zhu4"],"word":"注"}],"containing_words":[{"definition":["variant of 全神貫注|全神贯注[quan2 shen2 guan4 zhu4]"],"pinyin":["quan2 shen2 guan4 zhu4"],"word":"全神灌注"}],"sentences":[{"english":"Objective To investigate the protective effects of maltol(MT) on cerebral ischemia and reperfusion damages in rats.","chinese":"目的研究麥芽醇對大鼠腦缺血再灌注損傷的保護作用。"},{"english":"Normal saline in the same volume was perfused in the ischemiareperfusion group and sham operation group.","chinese":"缺血再灌注組和假手術組灌等體積的生理鹽水。"},{"english":"The practice of fabricating a pile by drilling and filling pedestal is described in the discussion.","chinese":"通過工程實例介紹擴底鑽孔灌注樁施工實踐。"},{"english":"Results—Early 1-hour thrombolysis restored perfusion and reduced infarction.","chinese":"結果早期1小時溶栓恢復灌注降低梗塞體積。"},{"english":"After Gingival retraction, impressions were made and superhard gypsum model were finished.","chinese":"排齦後製取印模，灌注超硬石膏模型。"},{"english":"Then the labeled bladder cancer cells were implanted into the nude mice bladder by intravesical instillation.","chinese":"採用經尿道膀胱灌注法使腫瘤細胞種植於膀胱黏膜。"},{"english":"Beggared of blood to blush through lively veins.","chinese":"缺乏鮮血去灌注淡紅的脈絡？"},{"english":"Bore-hole cast-in-place pile was filled outside the foundation pit.","chinese":"對於基坑外的部分，採用鑽孔灌注樁補樁。"},{"english":"Method of capacity of socketed piles are determined to bring together.","chinese":"歸納總結了確定嵌巖灌注樁的承載力方法。"},{"english":"Ischemia-reperfulion injury model of small bowel transplantation was established.","chinese":"建立小腸移植缺血再灌注損傷模型。"},{"english":"Myocardial perfusion scintigraphy provides complementary data for assessing ischemic burden.","chinese":"心肌灌注閃爍照相術對缺血程度估計提供輔助資料。"},{"english":"Objective To evaluate the legitimation of left gastric regional arterial infusion chemotherapy in the treatment of gastric carcinoma.","chinese":"目的探討胃左動脈區域灌注化療治療胃癌的合理性。"},{"english":"The maintenance of higher aortic perfusion pressure intraoperatively must be emphasized to decrease the likelihood of air embolism.","chinese":"應強調術中保持較高的主動脈灌注壓以防止空氣栓塞。"},{"english":"The MR pulmonary perfusion imaging was achieved by the first-pass contrast agent method.","chinese":"利用對比劑首次通過法可進行MR肺灌注成像。"},{"english":"Objective To evaluate the safety of intraperitoneal hyperthermic chemotherapy.","chinese":"目的探討腹腔溫熱灌注化療的安全性和可行性。"},{"english":"Conclusion MRPP with 2D FSPGR without breath-hold is a feasible method to diagnose APE.","chinese":"結論MR肺灌注成像是診斷肺栓塞的可行方法。"}],"related":[{"definition":["to concentrate\/to gather\/(biology) to agglutinate"],"pinyin":["ning2 ji2"],"word":"凝集"},{"definition":["variant of 凝練|凝练[ning2 lian4]"],"pinyin":["ning2 lian4"],"word":"凝煉"},{"definition":["to condense\/to solidify\/to coagulate\/clot (of blood)"],"pinyin":["ning2 jie2"],"word":"凝結"},{"definition":["medical puncture to extract bodily fluid (a tap)\/body piercing\/puncture"],"pinyin":["chuan1 ci4"],"word":"穿刺"},{"definition":["idea\/thought"],"pinyin":["yi4 nian4"],"word":"意念"},{"definition":["concise\/compact\/condensed"],"pinyin":["ning2 lian4"],"word":"凝練"},{"definition":["to vaporize\/to dispel"],"pinyin":["yi4 san4"],"word":"逸散"},{"definition":["channel of TCM"],"pinyin":["jing1 mai4"],"word":"經脈"},{"definition":["to pour into\/to empty into"],"pinyin":["zhu4 ru4"],"word":"注入"},{"definition":["pubic region\/point two inches below the navel where one's qi resides"],"pinyin":["dan1 tian2"],"word":"丹田"},{"definition":["cyclone"],"pinyin":["qi4 xuan2"],"word":"氣旋"},{"definition":["crystal"],"pinyin":["jing1 ti3"],"word":"晶體"},{"definition":["to bubble out\/to squirt"],"pinyin":["pen1 yong3"],"word":"噴湧"},{"definition":["to condense\/to concentrate\/compression\/concentration"],"pinyin":["ning2 suo1"],"word":"凝縮"},{"definition":["spiral\/helix\/screw"],"pinyin":["luo2 xuan2"],"word":"螺旋"},{"definition":["occult force\/the power of a God or spirit"],"pinyin":["shen2 li4"],"word":"神力"}]}