{"definition":["to sprinkle over sth"],"pinyin":["sa3 man3"],"simplified":["洒满"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"灑滿","characters":[{"definition":["to sprinkle\/to spray\/to spill\/to shed"],"pinyin":["sa3"],"word":"灑"},{"definition":["Manchu ethnic group","to fill\/full\/filled\/packed\/fully\/completely\/quite\/to reach the limit\/to satisfy\/satisfied\/contented"],"pinyin":["Man3","man3"],"word":"滿"}],"containing_words":[],"sentences":[{"english":"The campus every inch of the humanities, where the light of asperses full bright.","chinese":"校園的每一寸地方，灑滿燦爛的人文之光。"},{"english":"Spring is working it's magic on the woodland floor, spreading a carpet of bluebells.","chinese":"春天在林地上施展魔法，灑滿一地的風鈴草。"},{"english":"His suit was besprinkled  with water.","chinese":"他的衣服被灑滿了水。"},{"english":"Seems that your heart is filled up with silver moonlight, and then you are suddenly enlightened.","chinese":"你的心彷彿都灑滿了銀色的月光，豁然開朗起來。"},{"english":"With warm sunshine and tall mountains, a river quietly flows by.","chinese":"溫暖的陽光灑滿四周的高山，一條小河靜靜地流過。"},{"english":"A natural light-flooded atrium connects every floor to each other.","chinese":"灑滿自然陽光的中庭連接着各個樓層。"},{"english":"Orange blossoms perfumed the air in the garden.","chinese":"橙花在花園的空氣裏灑滿了香味。"},{"english":"RMB 4.5 gets you four fried, greasy, and scallionscattered dumplings.","chinese":"花4塊5角錢，買4個灑滿蔥花的油嫩生煎饅頭。"},{"english":"they were nowhere in the house, nor about the moonlit dawn.","chinese":"他們不在屋子裏，也不在灑滿月光的拂曉。"},{"english":"The swallow flew to the sky full of bright moonlight.","chinese":"燕子飛上了灑滿月光的夜空。"},{"english":"Sunlight filled the kitchen from the big window behind the sink.","chinese":"日光透過水槽後的大窗灑滿了整個廚房。"},{"english":"Sun Valley is filled with late afternoon light and there is a chill in the air.","chinese":"森瓦利灑滿了夕陽的餘暉，空氣裏有一絲涼意。"},{"english":"I brought injury, perseverance and watchful along the tears.","chinese":"我帶着傷堅定不移的前行，沿路灑滿淚滴。"},{"english":"Under the house, you e the shadow clearly visible.","chinese":"夜光灑滿了屋子，你的影子清晰可見。"},{"english":"With both windows open wide, the light of the waning moon spilled across the bedchamber.","chinese":"兩扇窗戶都是全開的，蒼白的月亮光灑滿了臥室。"},{"english":"It is like an angel bringing love to the world.","chinese":"它像是一個天使，將愛灑滿人間。"}],"related":[]}