{"definition":["mortar (for masonry)"],"pinyin":["hui1 jiang1"],"simplified":["灰浆"],"rank":54490.0,"normalized_rank":0.7623857960348663,"fraction":8.671071035598769e-8,"cumulative_fraction":0.9994704184238726,"word":"灰漿","characters":[{"definition":["ash\/dust\/lime\/gray\/discouraged\/dejected"],"pinyin":["hui1"],"word":"灰"},{"definition":["broth\/serum\/to starch","starch paste"],"pinyin":["jiang1","jiang4"],"word":"漿"}],"containing_words":[],"sentences":[{"english":"The mixed cement has been hoisted up the building.","chinese":"拌好的水泥灰漿已吊到建築物頂上了。"},{"english":"Self-set grout is a flexible waterproof material used for anti-seepage wall.","chinese":"自凝灰漿是性能良好的柔性防滲牆材料。"},{"english":"As these are more exposed to the winds, they are coated with white-coloured waterproof rendering mortar.","chinese":"因爲這些更多暴露在風中，塗有白色防水抹灰灰漿。"},{"english":"Refer to Architect's General Specification for concrete strength and mortar mix.","chinese":"混凝土強度及灰漿混合比例須參照建築師之基本規範。"},{"english":"Thee mason flushed the joint with mortar.","chinese":"泥工用灰漿把接縫處抹平。"},{"english":"The brick-layer at the top of the scaffold is calling for more mortar.","chinese":"磚工人喊着要人再送些灰漿上去。"},{"english":"This new house is built by white mortar and steel structure.","chinese":"該項目中的新住宅是由白灰漿和鋼結構建造。"},{"english":"After the flue gas passes through the tray, it encounters the absorber spray zone.","chinese":"煙氣和從聯箱噴射出來的石灰漿液相碰撞。"},{"english":"Color epoxy grout system and method for use.","chinese":"彩色環氧灰漿系統和其使用方法。"},{"english":"The mason flushed the joint with mortar.","chinese":"泥工用灰漿把接縫處抹平。"},{"english":"That invisible wall was now being cemented by the mortar of indifference.","chinese":"那無形的牆好像被淡漠的灰漿接合得更加堅固了。"},{"english":"The report about the limited fire-endurance time of reinforced concrete with slurry layer is a little showed before.","chinese":"但典型灰漿層對鋼筋混凝土的耐火極限的報道還不多。"},{"english":"After gearshift adjustment device is fixed on the electrical current of pump motor is lower more.","chinese":"加裝液力偶合器改造後，灰漿泵運行電流進一步降低。"}],"related":[]}