{"definition":["catastrophic"],"pinyin":["zai1 nan4 xing4"],"simplified":["灾难性"],"rank":20150.0,"normalized_rank":0.28192464287213354,"fraction":0.000002358414539581376,"cumulative_fraction":0.9751944221380022,"word":"災難性","characters":[{"definition":["disaster\/calamity"],"pinyin":["zai1"],"word":"災"},{"definition":["difficult (to...)\/problem\/difficulty\/difficult\/not good","disaster\/distress\/to scold"],"pinyin":["nan2","nan4"],"word":"難"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"Many disaster will happen every day in the world.","chinese":"在這個世界上，天天都邑發生很多災難性的工作。"},{"english":"Contemporary society, people have produced the serious self-contradiction.","chinese":"當代社會人的自我矛盾甚至自我分裂已是災難性問題。"},{"english":"The puppet troops suffered disastrous defeat.","chinese":"僞軍遭到了災難性的失敗。"},{"english":"If you don't, then his catastrophic conclusions are irrelevant.","chinese":"如果你不信，那他得出的災難性結論就根本不足爲慮。"},{"english":"The disallowed goal was a disaster for the team.","chinese":"那個進球被判無效對球隊來說是個災難性的打擊。"},{"english":"Emerging economies, for the most part, avoided this disastrous over-borrowing.","chinese":"而新興市場經濟體大多避免了災難性的過度借貸。"},{"english":"\"Shout\" of a , the beard worked properly Feng to fling out disaster one net.","chinese":"“呼”的一聲，胡靈峯扔出了災難性的一網。"},{"english":"For other disaster scenarios, go for gold.","chinese":"而要是其他的災難性狀況，就應該買黃金。"},{"english":"Some of these comets would have slammed into Earth, causing catastrophic results to life.","chinese":"其中一些彗星會衝向地球，給生物帶來災難性的後果。"},{"english":"By eliminating this ticking time-bomb, the possibility of serious accidents had been ruled out.","chinese":"剷除了一顆定時炸彈，避免了災難性事故的發生。"},{"english":"For workers, the shutdowns and job losses are devastating.","chinese":"對於工人來說，停產和裁員是災難性的。"},{"english":"The only option would be a catastrophic default.","chinese":"屆時唯一的選擇將是災難性的違約。"},{"english":"The social consequences could be disastrous, and could give political hard-liners a leg up.","chinese":"其社會後果可能是災難性的，同時會觸怒強硬派分子。"},{"english":"The epidemic of catastrophic bee losses is called Colony Collapse Disorder (CCD).","chinese":"導致蜜蜂災難性損失的流行病稱爲羣體性癱瘓失調。"},{"english":"A short-term correction would be painful, but hardly catastrophic.","chinese":"短期調整是痛苦的，但絕不會是災難性的。"},{"english":"Metal Migration has been the cause of many catastrophic microcircuit failures.","chinese":"金屬遷移能導致混合微電路發生災難性失效。"}],"related":[]}