{"definition":["to blow up\/to destroy with explosives"],"pinyin":["zha4 hui3"],"simplified":["炸毁"],"rank":14392.0,"normalized_rank":0.2013627523680271,"fraction":0.000004447062424721902,"cumulative_fraction":0.9564208246256168,"word":"炸燬","characters":[{"definition":["to deep fry\/Taiwan pr. [zha4]","to explode"],"pinyin":["zha2","zha4"],"word":"炸"},{"definition":["variant of 毀|毁[hui3]\/to destroy by fire\/a blaze"],"pinyin":["hui3"],"word":"燬"}],"containing_words":[],"sentences":[{"english":"after World Trade Center was knocked down.","chinese":"在世貿中心被炸燬以後。"},{"english":"Enemy agents plotted to blow up the plant.","chinese":"敵人奸細密謀炸燬那家工廠。"},{"english":"Here, a woman sifts sand in bombed out Berlin in 1948.","chinese":"圖爲1948年一女性在被炸燬的柏林篩沙。"},{"english":"It has also destroyed the cooling tower at its reactor at Yongbyon.","chinese":"北韓還炸燬了寧邊核反應堆的冷卻塔。"},{"english":"The bridge went up with a roar when the mine was exploded.","chinese":"地雷爆炸時，那座橋轟然一聲被炸燬了。"},{"english":"Suspects accused of trying to carry out a bomb plot against New Yorks appeared in court.","chinese":"被指控密謀試圖炸燬紐約猶太教堂的疑犯出席聽證會。"},{"english":"The bomb blew all the windows out.","chinese":"炸彈把所有窗門都炸燬了。"},{"english":"The terrorists dynamited the dam.","chinese":"恐怖分子將水壩炸燬。"},{"english":"The building is blown up finally, and skeleton person reduces drop big then.","chinese":"房屋最終被炸燬，而骷髏人接着大開殺戒。"},{"english":"They planned to take out the enemy arsenal by bombing it.","chinese":"他們計劃炸燬敵兵工廠。"},{"english":"The insurgents blow up railway tracks, seize land and chase away forest guards.","chinese":"起義者炸燬了鐵軌，奪去了土地，趕走了森林警衛。"},{"english":"His plans, however, came to a halt after the destruction of the first Death Star.","chinese":"然而，第一顆死星被炸燬後，他的計劃就擱淺了。"},{"english":"The Defense Administry said the attacks office was destroyed, at least 42 people injured.","chinese":"國防部長說一個稅務所被炸燬，至少42人受傷。"},{"english":"Zhang Qishan command zhang adjutant laying such as explosives, blow up mine.","chinese":"張啓山命令張副官等鋪設炸藥，炸燬礦洞。"},{"english":"Our army destroyed the enemy's blockhouse with a rocket bomb.","chinese":"我軍利用火箭彈炸燬了敵軍的碉堡。"},{"english":"Saboteurs dynamited the dam.","chinese":"破壞者炸燬了堤壩。"}],"related":[]}