{"definition":["olefine\/alkene (chemistry)"],"pinyin":["xi1 ting1"],"simplified":["烯烃"],"rank":36752.0,"normalized_rank":0.5142081625229108,"fraction":5.182205753598592e-7,"cumulative_fraction":0.9950307172129416,"word":"烯烴","characters":[{"definition":["alkene"],"pinyin":["xi1"],"word":"烯"},{"definition":["hydrocarbon"],"pinyin":["ting1"],"word":"烴"}],"containing_words":[],"sentences":[{"english":"Process flow of olefin conversion unit is introduced.","chinese":"對烯烴轉換工藝技術作了介紹。"},{"english":"The two main classes of petrochemicals are olefins and aromatics.","chinese":"石化的兩類主要產品是烯烴和芳烴。"},{"english":"In this paper, a kind of new catalysts for olefins hydroformylation was studied.","chinese":"本論文研製了一種新型烯烴氫甲酰化催化劑。"},{"english":"Polymers of vinyl chloride or of other halogenated olefins, in primary forms.","chinese":"初級形狀的氯乙烯或其他鹵化烯烴聚合物。"},{"english":"Optionally the olefinic naphtha has a low content of acids.","chinese":"任選地，所述烯烴石腦油含低含量的酸。"},{"english":"An unsaturated hydrocarbon belonging to the alkene homologous series.","chinese":"不飽和碳氫化合物，屬於烯烴同系物。"},{"english":"Compounds containing two double bonds are called dienes.","chinese":"包含兩個雙鍵的化合物叫做二烯烴。"},{"english":"A new direct hydration catalyst for preparing alcohols from dicyclopentadiene was studied.","chinese":"提出了一種烯烴水合制醇的新方法。"},{"english":"The product has good catalytic property for the formation of diene stereospecific polymers.","chinese":"製得的叔碳酸釹具有對二烯烴良好的定向聚合活性。"},{"english":"Firstly the dependence of stress strain behavior of polyolefin on the test conditions was investigated.","chinese":"首先研究了聚烯烴應力應變行爲的測試條件依賴性。"},{"english":"The suggestion for developing the technics of alkene preparation from natural gas in China was proposed.","chinese":"並對我國今後天然氣制烯烴技術的開發提出了建議。"},{"english":"Application and preparation of a non - hydrogenation reducing - olefin catalyst were introduced.","chinese":"介紹了一種非加氫降烯烴催化劑的製備及應用。"},{"english":"Application and preparation of a non-hydrogenation reducing-olefin catalyst were studied.","chinese":"研究了一種非加氫降烯烴催化劑的製備及應用。"},{"english":"Polymers of propylene or of other olefins, in primary forms.","chinese":"初級形狀的丙烯或其他烯烴聚合物。"},{"english":"The low-molecular-weight homolog III shows no difference in catalytic activity toward the two cycloalkenes.","chinese":"同源低分子量顯示使用的環烯烴無催化活性差異。"},{"english":"The invention relates to a preparation method of open-cell foamed polyolefin.","chinese":"本發明涉及一種開孔發泡聚烯烴的製備方法。"}],"related":[]}