{"definition":["very little\/hardly any"],"pinyin":["wu2 ji3"],"simplified":["无几"],"rank":43289.0,"normalized_rank":0.6056692737117513,"fraction":2.821747527241149e-7,"cumulative_fraction":0.9975754802219834,"word":"無幾","characters":[{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["almost","how much\/how many\/several\/a few"],"pinyin":["ji1","ji3"],"word":"幾"}],"containing_words":[{"definition":["just a very few (idiom); tiny number\/not many at all\/You count them on your fingers."],"pinyin":["liao2 liao2 wu2 ji3"],"word":"寥寥無幾"},{"definition":["there is not much left"],"pinyin":["suo3 sheng4 wu2 ji3"],"word":"所剩無幾"}],"sentences":[{"english":"But \"fewer than a dozen people\" are looking in this direction, she said.","chinese":"但是朝這個方向研究的人寥寥無幾，她說。"},{"english":"The monarchies now left in Asia can be counted on the fingers of one hand.","chinese":"現在在亞洲的君主國已廖廖無幾。"},{"english":"This is the only home of the red Colobus monkey but there are very few left.","chinese":"這是紅色疣猴的唯一棲息地，但是現在所剩無幾了。"},{"english":"The leaves of the trees left, the car in the snow in slowly moving forward.","chinese":"樹上的葉子所剩無幾，汽車在雪地中緩慢地行駛着。"},{"english":"There aren't too many examples of this style. of architecture left nowadays.","chinese":"現今這種風格的建築已所剩無幾了。"},{"english":"The prevalence of scar contractures in the upper extremities was similar to that in the lower extremities.","chinese":"瘢痕攣縮的發生率在上下肢中相差無幾。"},{"english":"There just were not enough Confederate soldiers left to fight.","chinese":"南軍兵力不足，所剩廖廖無幾。"},{"english":"Besides, there are very few skilled stone workers left after the war years.","chinese":"此外，在戰後年代之後，有技術的石工寥寥無幾。"},{"english":"Currently, there are few interventions whose effectiveness has been scientifically proven.","chinese":"目前，在有效性上得到科學論證的干預措施寥寥無幾。"},{"english":"The Moon Light replicates exactly the craters and surface of the actual moon.","chinese":"燈面上的凹凸與真正的月球表面，相差無幾。"},{"english":"So many people have flu that hardly any policemen reported for duty.","chinese":"患流行性感冒的人太多，連去執勤的警察也寥寥無幾。"},{"english":"“A dialysis machine has the same number of parts as a car,” he says.","chinese":"透析器材和汽車一樣，某些零件的佔有量相差無幾。"},{"english":"Because finds out renal artery narrow in this kind of patient to accommodate very few.","chinese":"因爲在這類病人中查出腎動脈狹窄者容容無幾。"},{"english":"Even some residential appearance is almost the same with the bath.","chinese":"甚至有的住宅外觀同洗浴中心相差無幾。"},{"english":"His ugly disposition gained him few friends.","chinese":"他脾氣壞，因而朋友寥寥無幾。"},{"english":"But by mid-2009 he was almost out of cash.","chinese":"但是到2009年年中，他手頭已經所剩無幾。"}],"related":[]}