{"definition":["not to have access\/beyond one's authority or capability\/sth one has no way of doing"],"pinyin":["wu2 cong2"],"simplified":["无从"],"rank":10418.0,"normalized_rank":0.14576133644872888,"fraction":0.00000773944182096592,"cumulative_fraction":0.9330439357828038,"word":"無從","characters":[{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"}],"containing_words":[{"definition":["not know where to start"],"pinyin":["wu2 cong2 xia4 shou3"],"word":"無從下手"},{"definition":["like mice trying to pull a turtle, nowhere to get a hand grip (idiom)\/no clue where to start"],"pinyin":["lao3 shu3 la1 gui1 , wu2 cong2 xia4 shou3"],"word":"老鼠拉龜，無從下手"}],"sentences":[{"english":"But beyond that his imagination could not travel.","chinese":"除此之外，他的想像力就無從馳騁了。"},{"english":"Big problem or does not know how to start, or solution is not complete.","chinese":"大題要麼無從下手，要麼解不全。"},{"english":"We had to push the car home as it broke down half way and we couldst know how to repair it.","chinese":"半路上車拋錨了，我們又無從修理，只得將其推回。"},{"english":"The Libyan air campaign could not have been fought without American help.","chinese":"離開美國的幫助，利比亞空戰也無從展開。"},{"english":"Without a peaceful and stable environment, there is no development to speak of.","chinese":"沒有和平穩定的環境，發展無從談起。"},{"english":"Love, in all its endlessness , unboundedness and failed definitions is this experience.","chinese":"這是一次無邊無境，無從定義的愛之旅。"},{"english":"So many things happened without any choice;","chinese":"許多事情，無從選擇地發生。"},{"english":"The past cannot be changed. The future is yet in your power.","chinese":"過往已無從改變，但未來仍握於你手。"},{"english":"The question is whether he is alive or dead. There is no trace of him.","chinese":"問題是是他是生還是死我們無從得知他的行蹤。"},{"english":"“We never know what the answer will be,” says Mr Smith.","chinese":"“我們無從猜測答案會是什麼，”史密斯先生說。"},{"english":"Without this point, no discussion can be started.","chinese":"沒有這一點，所有的討論都無從談起。"},{"english":"Because rock keeps silence which makes instigator don't know what to do with it.","chinese":"因爲石頭的靜默令挑釁生事者無從入手。"},{"english":"The long-term effects of inhaling contaminated air is unknown.","chinese":"長期吸入被污染空氣的影響還無從知曉。"},{"english":"As you look around your room or entire house for that matter it seems impossible.","chinese":"你四下打量你的房間或是整個屋子，看來無從下手。"},{"english":"It's unknown how profitable Harbin Pharmaceutical Group Sixth Pharm Plant is.","chinese":"哈藥六廠的盈利狀況我們無從得知。"},{"english":"Do you ever feel overwhelmed or have too much to do?","chinese":"你是否感到不知所措或是工作太多無從下手？"}],"related":[]}