{"definition":["to make nuclear-free\/to de-nuclearize"],"pinyin":["wu2 he2 hua4"],"simplified":["无核化"],"rank":14792.0,"normalized_rank":0.20695927133323072,"fraction":0.0000042495546955777066,"cumulative_fraction":0.9581602162212288,"word":"無核化","characters":[{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["pit\/stone\/nucleus\/nuclear\/to examine\/to check\/to verify"],"pinyin":["he2"],"word":"核"},{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"}],"containing_words":[],"sentences":[{"english":"But he did not lay out a timescale for his plan.","chinese":"但是對於無核化進程他卻沒有一個明確的計劃表。"},{"english":"China strongly urged Pyongyang to promote denuclearisation of the Korean peninsula.","chinese":"中國此前強烈敦促平壤促進朝鮮半島的無核化。"},{"english":"He said the premier, Wen Jiabao, would push for denuclearisation and a return to the six-party talks.","chinese":"他說，總理溫家寶將推動無核化進程和重啓六方會談。"},{"english":"First, the objective of a denuclearized Korean Peninsula has been set.","chinese":"一是確立了朝鮮半島無核化目標。"},{"english":"Both sides support the efforts to denuclearize the Korean Peninsula.","chinese":"雙方支持實現朝鮮半島無核化的努力。"},{"english":"\"We have never objected to the denuclearisation of the Korean Peninsula and of the world itself, \" it said.","chinese":"我們從沒有放棄朝鮮半島以及世界範圍的無核化。"},{"english":"Negotiations over the denuclearisation of the Korean peninsula look set to resume.","chinese":"關於朝鮮半島無核化的談判看來肯定將要重新啓動。"},{"english":"We uphold realizing denuclearization on the Peninsula through dialogue and consultation.","chinese":"我們一貫主張，通過對話協商實現半島無核化。"},{"english":"Hill has been the point man in six-nation negotiations aimed at getting rid of North Korea's nuclear weapons capabilities.","chinese":"希爾是北韓無核化六方會談的關鍵人物。"},{"english":"ROK and China hold the same opinion and stand on realizing the goal of denuclearization of the Korean Peninsula.","chinese":"韓中在實現半島無核化目標上看法和立場一致。"}],"related":[]}