{"definition":["anthracite"],"pinyin":["wu2 yan1 mei2"],"simplified":["无烟煤"],"rank":35768.0,"normalized_rank":0.5004407258685097,"fraction":5.662472145974349e-7,"cumulative_fraction":0.994498367463078,"word":"無煙煤","characters":[{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["cigarette or pipe tobacco\/CL:根[gen1]\/smoke\/mist\/vapour\/CL:縷|缕[lu:3]\/tobacco plant\/(of the eyes) to be irritated by smoke"],"pinyin":["yan1"],"word":"煙"},{"definition":["coal\/CL:塊|块[kuai4]"],"pinyin":["mei2"],"word":"煤"}],"containing_words":[],"sentences":[{"english":"The floor covering is an anthracite needle felt.","chinese":"地板覆蓋是無煙煤針感覺。"},{"english":"The organic affinity of trace elements decreases further in anthracite.","chinese":"到無煙煤階段，有機態微量元素含量進一步降低。"},{"english":"The application of anthracite in black powder is introduced.","chinese":"文章介紹了無煙煤在工業黑火藥中的應用。"},{"english":"The combustion characters of petroleum coke were between those of soft coal and anthracite .","chinese":"石油焦的燃燒特性處於煙煤和無煙煤之間。"},{"english":"The combustion parameters of petroleum coke are between soft coal and anthracite .","chinese":"石油焦的燃燒特性指數大約處於煙煤和無煙煤之間。"},{"english":"The properties of coking coal and anthracite are related to their coal-forming periods.","chinese":"煉焦煤和無煙煤的煤質特徵與其成煤時代有關。"},{"english":"Why cannot we use anthracite as fuel? Give me a reason.","chinese":"爲什麼我們不能用無煙煤作爲燃料？說說你的理由。"},{"english":"Hon Gai in Vietnam produces anthracite coal, the materials below for reference only.","chinese":"越南鴻基產無煙煤，現提供下列資料僅供參考。"},{"english":"We are required by environment protecting department to use anthracite.","chinese":"環保部門要求我們使用無煙煤。"},{"english":"A new kind of technique, the vortex arch suited to blind coal combustion for conveyor stoker is investigated.","chinese":"提出一種能夠用於鏈條爐燃用無煙煤的渦流拱新技術。"},{"english":"The combustion characteristics of stone coal are similar to anthracite coal and worse than anthracite .","chinese":"石煤的燃燒特性與無煙煤相近，但比無煙煤差。"},{"english":"The combustion characteristics of stone coal are similar to anthracite coal and worse than anthracite .","chinese":"石煤的燃燒特性與無煙煤相近，但比無煙煤差。"},{"english":"Detail of this higher grade of coal, anthracite.","chinese":"上圖是高等級別的煤，也就是無煙煤。"}],"related":[]}