{"definition":["proletariat\/non-propertied person"],"pinyin":["wu2 chan3 zhe3"],"simplified":["无产者"],"rank":47530.0,"normalized_rank":0.6650063660403229,"fraction":1.8582951899523964e-7,"cumulative_fraction":0.9985536387833324,"word":"無產者","characters":[{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["to give birth\/to reproduce\/to produce\/product\/resource\/estate\/property"],"pinyin":["chan3"],"word":"產"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[{"definition":["Proletarier aller Länder, vereinigt euch!\/Workers of the world, unite!"],"pinyin":["quan2 shi4 jie4 wu2 chan3 zhe3 lian2 he2 qi3 lai5"],"word":"全世界無產者聯合起來"},{"definition":["lumpenproletariat (in Marxist theory)"],"pinyin":["liu2 mang2 wu2 chan3 zhe3"],"word":"流氓無產者"}],"sentences":[{"english":"The proles, it suddenly occurred to him, had remained in this condition.","chinese":"他突然想到，無產者仍舊是這樣。"},{"english":"It was not desirable that the proles should have strong political feelings.","chinese":"無產者不該有什麼強烈的政治情感。"},{"english":"The future belonged to the proles.","chinese":"未來屬於無產者。"},{"english":"The proletarians have nothing to lose but their chains . They have a world to win.","chinese":"無產者失去的只是鎖鏈，他們獲得的將是整個世界。"},{"english":"If there is hope… it lies in the proles.","chinese":"如果有希望的話，希望在無產者身上。"},{"english":"Not only should proletarians emancipate themselves but also the whole mankind.","chinese":"無產者不僅要解放他們自己，而且要解放全人類。"},{"english":"The Party claimed, of course, to have liberated the proles from bondage.","chinese":"當然，黨宣稱已把無產者從枷鎖中解放出來了。"},{"english":"This is the comprador class by the bureaucracy and the civilian population constitutes a proletarian mode of the dumbbell.","chinese":"這是由官僚買辦階級與平民無產者構成的啞鈴模式。"},{"english":"The proletarians have nothing to lose but their chains.","chinese":"無產者在這個革命中失去的只是鎖鏈。"},{"english":"The proletarians have nothing to lose but their chains. They have a world to win.","chinese":"無產者失去的只是鎖鏈，他們獲得的將是整個世界。"}],"related":[]}