{"definition":["to calcine (purify by heating)"],"pinyin":["duan4 shao1"],"simplified":["煅烧"],"rank":51660.0,"normalized_rank":0.7227904243560506,"fraction":1.2028556453423213e-7,"cumulative_fraction":0.999178779503668,"word":"煅燒","characters":[{"definition":["variant of 鍛|锻[duan4]"],"pinyin":["duan4"],"word":"煅"},{"definition":["to burn\/to cook\/to stew\/to bake\/to roast\/to heat\/to boil (tea, water etc)\/fever\/to run a temperature\/(coll.) to let things go to one's head"],"pinyin":["shao1"],"word":"燒"}],"containing_words":[],"sentences":[{"english":"In order to content the productive capacity of soda, a new calciner system was added.","chinese":"爲滿足純鹼生產能力，新增一套煅燒爐系統。"},{"english":"The influences of the calcinations furnace's structure type on the performance of the integrated methanol catalysts are discussed.","chinese":"討論了煅燒爐的結構型式對聯醇催化劑性能的影響。"},{"english":"So, the activity of metakaolin is the highest after calcined at 700℃.","chinese":"因此，700℃下煅燒得到的偏高嶺土活性最高。"},{"english":"Pure lithium zinc ferrites were synthesized by means of a combination of sol-gel method and subsequent calcination.","chinese":"結合溶膠凝膠法與後期煅燒製備了純鋰鋅鐵氧體。"},{"english":"The differential calcination technology is introduced in this paper to stabilize the high temperature layer of clinker calcined by shaft kiln.","chinese":"介紹了採用差熱煅燒法穩定立窯燒成熟料的高溫層。"},{"english":"The effects of seeds and the calcination temperature on the properties of the powder were studied.","chinese":"分析了添加籽晶和煅燒溫度對粉體性能的影響。"},{"english":"It is also made clear that the higher the calcine temperature is, the better the crystallization becomes.","chinese":"微波燒結樣品的催化特性和結晶比電爐煅燒的稍好。"},{"english":"During the synthesis process of titanium oxide pillared bentonite, the calcinations temperature is the most important.","chinese":"鈦柱撐膨潤土的製備過程中，煅燒溫度至關重要。"},{"english":"The new process of calcine for ammonium paratungstate to tungsten trioxide by microwave was investigated.","chinese":"探討了微波煅燒仲鎢酸銨製取三氧化鎢的新工藝。"},{"english":"Light-burned magnesia is prepared by calcining magnesite.","chinese":"本文通過煅燒菱鎂礦製備輕燒氧化鎂。"},{"english":"The maxim strength is found when calcination temperature is 600℃.","chinese":"煅燒溫度在600℃所制無水石膏水泥強度最大。"},{"english":"The production process and its application in latex paint of this calcinated kaolin clay were described.","chinese":"介紹了該煅燒高嶺土的生產工序及其在乳膠漆的應用。"},{"english":"The powders synthesized are uniform in size, but there are partially hard particle agglomerates in the powders.","chinese":"煅燒後粉體尺寸均勻，但部分顆粒間存在硬團聚。"},{"english":"It has to be crushed after firing and the aggregate therefore has sharp corners .","chinese":"煅燒後需要進行破碎，因此骨料具有尖銳的棱角。"},{"english":"The carrier is calcined after loading the sulfating agent and the chromium on the carrier.","chinese":"在將硫酸化劑和鉻裝載在載體之後煅燒載體。"},{"english":"Kaolin and other kaolinic clays, whether or not calcined.","chinese":"高嶺土及類似土，不論是否煅燒。"}],"related":[]}