{"definition":["coking\/the process of producing coke from coal"],"pinyin":["lian4 jiao1"],"simplified":["炼焦"],"rank":30762.0,"normalized_rank":0.4304002910189862,"fraction":8.80099112350589e-7,"cumulative_fraction":0.9909364457800072,"word":"煉焦","characters":[{"definition":["to refine\/to smelt"],"pinyin":["lian4"],"word":"煉"},{"definition":["burnt\/scorched\/charred\/worried\/anxious\/coke\/abbr. for 焦耳[jiao1 er3], joule","surname Jiao"],"pinyin":["Jiao1","jiao1"],"word":"焦"}],"containing_words":[{"definition":["coking furnace"],"pinyin":["lian4 jiao1 lu2"],"word":"煉焦爐"}],"sentences":[{"english":"The principal commodity of the Brisbane business unit is metallurgical coal for use in steel making.","chinese":"布里斯班公司的主要商品爲鍊鋼用的煉焦煤。"},{"english":"A coking plant at Hangang, the main steel mill complex in Handan, China.","chinese":"圖爲邯鋼的一個煉焦廠，這是邯鋼的主要部分之一。"},{"english":"The properties of coking coal and anthracite are related to their coal-forming periods.","chinese":"煉焦煤和無煙煤的煤質特徵與其成煤時代有關。"},{"english":"Workers fix a rail next to a coking furnace plant at Hangang.","chinese":"工人們正在修理邯鋼煉焦廠旁的鐵路。"},{"english":"Feedforward control model for the heat key is to determine the coking heat loss.","chinese":"前饋供熱量控制模型的關鍵是確定煉焦耗熱量。"},{"english":"Coking coal is used, together with iron ore, in blast furnaces to manufacture steel.","chinese":"煉焦煤用於在高爐中冶煉鐵礦石生產鋼鐵。"},{"english":"The State shall adopt measures to ban coke making by indigenous methods.","chinese":"國家採取措施取締土法煉焦。"},{"english":"In mixing coal for the coking, both of two may substitute the domestic coking coal.","chinese":"在配煤煉焦中兩者均可替代目前國內主焦煤品種。"},{"english":"Metallurgical cleaned coal has been mainly used for coking blend in domestic steel and iron plants and coking plants.","chinese":"冶煉精煤主要供國內鋼鐵廠及焦化廠配煤煉焦使用。"}],"related":[]}