{"definition":["smoking pipe"],"pinyin":["yan1 guan3"],"simplified":["烟管"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"煙管","characters":[{"definition":["cigarette or pipe tobacco\/CL:根[gen1]\/smoke\/mist\/vapour\/CL:縷|缕[lu:3]\/tobacco plant\/(of the eyes) to be irritated by smoke"],"pinyin":["yan1"],"word":"煙"},{"definition":["surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["Guan3","guan3"],"word":"管"}],"containing_words":[{"definition":["elbow pasta"],"pinyin":["yan1 guan3 mian4"],"word":"煙管麵"}],"sentences":[{"english":"An Initiative Mode of Group-Buying Online;","chinese":"煙管魚科的一個模式屬。"},{"english":"He silently applied the tube to his lips .","chinese":"他默默地把煙管遞到嘴裏。"},{"english":"A pipe gives a wise man time to think and a fool something to stick in.","chinese":"煙管給聰明人靈感，給笨蛋口裏一個棍子。"},{"english":"Boilers may be broadly classified as shell, fire-tube and water-tube types.","chinese":"人們一般把它分爲鍋殼型，煙管型和水冷管型等類型。"},{"english":"It burns smoke-free ethanol which needs no flue.","chinese":"它燃燒乙醇，無煙也無需煙管。"},{"english":"A side suction cover of a foldable smoke pipe is in correspondence with a material charging and discharging opening of the furnace body.","chinese":"摺疊式煙管的側吸罩與爐體的物料進出口相對。"},{"english":"Placed beside an opium pipe was a small shoe, a shoe for a bound foot.","chinese":"在鴉片煙管旁放着一雙小鞋，一雙給裹足人穿的小鞋。"},{"english":"Our Factory specializes in standard level fire tubes used in the EU style Wall-Hung Gas Boiler.","chinese":"本廠專業生產歐款壁掛爐標準水平排煙管的企業。"},{"english":"He bought some roach clips and hashish pipes at the head shop .","chinese":"在麻藥品店裏他買了些蟑螂夾子和煙管。"},{"english":"The lighter poised over the mouth of his pipe.","chinese":"打火機停在了他的煙管嘴的上方。"},{"english":"But the nargileh too has fallen victim to the ban.","chinese":"然而這個水煙管也成爲了此項禁令的犧牲品。"}],"related":[]}