{"definition":["approved for distribution\/to provide (wages etc) as usual (e.g. while an employee is on maternity leave)"],"pinyin":["zhao4 fa1"],"simplified":["照发"],"rank":41417.0,"normalized_rank":0.5794775649545982,"fraction":3.358945194093059e-7,"cumulative_fraction":0.9969981084903772,"word":"照發","characters":[{"definition":["according to\/in accordance with\/to shine\/to illuminate\/to reflect\/to look at (one's reflection)\/to take (a photo)\/photo\/as requested\/as before"],"pinyin":["zhao4"],"word":"照"},{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"}],"containing_words":[],"sentences":[{"english":"Some companies, she added, pay employees’ salaries while they take time off to participate in humanitarian or relief efforts.","chinese":"有些公司在員工請假參加人道和救濟工作時照發工資。"},{"english":"Women workers are entitled to maternity leave with full pay.","chinese":"女工產假期間工資照發。"},{"english":"Since you're not willing to work, why should the state continue to pay you wages as if you were?","chinese":"你既然不願意工作，國家爲什麼還要照發工資呢？"},{"english":"SNS does not guarantee messages will be received in the exact order they were published.","chinese":"SNS不能保證按照發布消息的先後順序接收消息。"},{"english":"A free vacation on top of a pay raise is icing on the cake.","chinese":"加了工資還有工資照發的假期，真是錦上添花。"},{"english":"The annex is reproduced as received, in English only.","chinese":"附件只按英文本原文照發。"},{"english":"She now knows she doesn't have a disorder, but still gets the ads.","chinese":"即便她現在知道自己沒患子宮病，廣告仍然照發不誤。"}],"related":[]}