{"definition":["to follow the rules\/to do as instructed\/to play by the book\/to comply with a request"],"pinyin":["zhao4 ban4"],"simplified":["照办"],"rank":33091.0,"normalized_rank":0.4629860226938844,"fraction":7.167501478920869e-7,"cumulative_fraction":0.992789573507947,"word":"照辦","characters":[{"definition":["according to\/in accordance with\/to shine\/to illuminate\/to reflect\/to look at (one's reflection)\/to take (a photo)\/photo\/as requested\/as before"],"pinyin":["zhao4"],"word":"照"},{"definition":["to do\/to manage\/to handle\/to go about\/to run\/to set up\/to deal with"],"pinyin":["ban4"],"word":"辦"}],"containing_words":[],"sentences":[{"english":"He had no choice but to comply, allowing the Imperials aboard.","chinese":"他別無選擇，只能照辦，同意帝國檢查隊登艦。"},{"english":"Wilco dobbs. How's the view up front ?","chinese":"照辦，多布斯。前方情況如何？"},{"english":"When he yelled 'run', I did.","chinese":"他衝着我喊‘快跑’，我照辦了。"},{"english":"Out of pressing need, the mother complies but the donator disappeared without forking up.","chinese":"迫於所需的母親照辦了，但是捐贈者卻食言消失了。"},{"english":"You must comply with it- take off those boots youwear, and draw on these of mine.","chinese":"你得照辦＿＿脫掉腳上的靴子，穿上我的。"},{"english":"That can be arranged provided you bear the additional charges.","chinese":"如貴方負擔增加的費用，那就能安排照辦。"},{"english":"I see in your face that you know I cando nothing else than this.","chinese":"我從你臉上看得出來我只能照辦，沒有別的辦法。"},{"english":"The rest will come later to comply with local laws.","chinese":"隨後，便依據當地法律照辦相關事項。"},{"english":"The usher took the paper, cast a glance upon it, and obeyed.","chinese":"執達吏接了那張紙，瞟了一眼，便遵命照辦了。"},{"english":"“The passport office is pretty expeditious when it comes to handling renewals,” Teddy said.","chinese":"在辦理展期方面，護照辦人員是很迅速的。"},{"english":"He again told us to turn back, which we did.","chinese":"他再次要求我們回去，我們也照辦了。"},{"english":"He kept with the spirit, if not the letter of the policy.","chinese":"即使沒有句句照辦，他還是遵循了這個制度的精神。"},{"english":"You asked for more detail, and we responded.","chinese":"你們希望獲得進一步細節，我們照辦了。"},{"english":"Jingyuan then asked Yu Xianyang to open handcuffs shackles, Pelle had to do.","chinese":"靜遠隨即要求打開俞顯揚的手銬腳鐐，小秋只得照辦。"},{"english":"The emperor wills it, so it must be done.","chinese":"皇帝旨意如此，故必須照辦。"},{"english":"Jack directed his light down into the shaft and asked Karen and Gnea to do the same.","chinese":"傑克將光束打入豎井，也請凱倫和妮雅照辦。"}],"related":[{"definition":["to judge between right and wrong\/to reason things out"],"pinyin":["ping2 li3"],"word":"評理"},{"definition":["to heave a sigh of relief"],"pinyin":["song1 yi1 kou3 qi4"],"word":"鬆一口氣"},{"definition":["to deal with (an offender)"],"pinyin":["fa1 luo4"],"word":"發落"},{"definition":["to admonish\/instructions\/orders"],"pinyin":["xun4 shi4"],"word":"訓示"},{"definition":["to reason with sb\/to lecture"],"pinyin":["xiao3 yi3 da4 yi4"],"word":"曉以大義"},{"definition":["a fish that escaped the net (idiom)\/(fig.) sb or sth that slips through the net"],"pinyin":["lou4 wang3 zhi1 yu2"],"word":"漏網之魚"},{"definition":["convoluted and overelaborate (document)\/unnecessarily elaborate writing\/mumbo-jumbo"],"pinyin":["fan2 wen2 ru4 jie2"],"word":"繁文縟節"},{"definition":["to use violence (against sb)\/to strong-arm sb\/to manhandle"],"pinyin":["dong4 cu1"],"word":"動粗"},{"definition":["to use public office to avenge private wrongs"],"pinyin":["gong1 bao4 si1 chou2"],"word":"公報私仇"},{"definition":["without a retreat route\/caught in a dead end\/having burned one's bridges"],"pinyin":["wu2 lu4 ke3 tui4"],"word":"無路可退"},{"definition":["lit. to settle accounts after autumn\/settle scores at an opportune moment (idiom)"],"pinyin":["qiu1 hou4 suan4 zhang4"],"word":"秋後算賬"},{"definition":["public courtroom accusation (idiom)\/legal confrontation\/to take sb to court\/to sue"],"pinyin":["dui4 bu4 gong1 tang2"],"word":"對簿公堂"},{"definition":["soup of the day"],"pinyin":["li4 tang1"],"word":"例湯"},{"definition":["to advertise\/to solicit business"],"pinyin":["zhao1 lan3 sheng1 yi5"],"word":"招攬生意"},{"definition":["When you enter a country, follow the local customs (idiom); do as the natives do\/When in Rome, do as the Romans do"],"pinyin":["ru4 jing4 sui2 su2"],"word":"入境隨俗"},{"definition":["lit. a horse that brings trouble to its herd (idiom)\/fig. troublemaker\/black sheep\/rotten apple"],"pinyin":["hai4 qun2 zhi1 ma3"],"word":"害群之馬"}]}