{"definition":["fluorescent lamp\/neon lamp"],"pinyin":["ying2 guang1 deng1"],"simplified":["荧光灯"],"rank":30242.0,"normalized_rank":0.4231248163642215,"fraction":9.227245793942732e-7,"cumulative_fraction":0.9904674684214266,"word":"熒光燈","characters":[{"definition":["a glimmer\/glimmering\/twinkling\/fluorescence\/phosphorescence\/perplexed\/dazzled and confused\/planet Mars (arch.)"],"pinyin":["ying2"],"word":"熒"},{"definition":["light\/ray\/CL:道[dao4]\/bright\/only\/merely\/to use up"],"pinyin":["guang1"],"word":"光"},{"definition":["lamp\/light\/lantern\/CL:盞|盏[zhan3]"],"pinyin":["deng1"],"word":"燈"}],"containing_words":[],"sentences":[{"english":"Explosion hazardous area 2 usually adopts safety-increased explosion-proof fluorescent lamp.","chinese":"爆炸危險2區內一般使用增安型防爆熒光燈照明。"},{"english":"Compact florescent light bulbs, on the other hand, are a somewhat different story.","chinese":"相反，緊湊型熒光燈泡有些不同。"},{"english":"There was more hoopla surrounding the introduction of incandescent lights than there seems to be surrounding compact fluorescents.","chinese":"當時，引進白熾燈可比引進緊湊熒光燈熱鬧許多。"},{"english":"This article reviewed the progress of solid state sources catch up with florescent lamps.","chinese":"綜述近三年來固態光源追趕熒光燈的進展。"},{"english":"The utility model relates to a double filament fluorescent lamp and a lamp base.","chinese":"本實用新型是一種雙燈絲熒光燈管及管座。"},{"english":"Most florescent bulbs cannot be dimmed.","chinese":"大多數熒光燈不能變灰。"},{"english":"They used fluorescent lights, so they had that distinct metallic, oldish smell places that use fluorescents always have.","chinese":"使用熒光燈的地方總是充斥着老舊的氣息。"},{"english":"Those bulbs also contain tiny amounts of mercury.","chinese":"這種熒光燈還含有一定量的水銀。"},{"english":"Fluorescent starter holder series have got CE approval.","chinese":"熒光燈啓輝器座產品系列已獲得CE認證。"},{"english":"Suitable for annular fluorescent lamp.","chinese":"可配裝環形熒光燈。"},{"english":"First , power off , then , take away the fluorescent tubes .","chinese":"首先關掉電源把熒光燈管取下。"},{"english":"Federal officials say switching to compact florescent bulbs could significantly reduce energy demands every year.","chinese":"聯邦官員稱使用熒光燈每年可以明顯減少電能需求。"},{"english":"With cement floors and exposed florescent lighting, some offices have an industrial feel.","chinese":"水泥地面，熒光燈照明，讓辦公室看上去很有工業感。"},{"english":"Specify a custom height for the modular fluorescent fitting.","chinese":"指定板塊式熒光燈的自定義高度。"},{"english":"Replace incandescent bulbs with compact fluorescent lights.","chinese":"用結實的熒光燈代替白熾燈泡。"},{"english":"Plasma: Plasmas use the same technology that the Fluorescent lights over your head use to light televisions.","chinese":"等離子使用了類似你頭上熒光燈的技術來點亮屏幕。"}],"related":[]}