{"definition":["fluorescent screen\/TV screen"],"pinyin":["ying2 ping2"],"simplified":["荧屏"],"rank":11513.0,"normalized_rank":0.16108180711597386,"fraction":0.000006554249468473892,"cumulative_fraction":0.9408389584392196,"word":"熒屏","characters":[{"definition":["a glimmer\/glimmering\/twinkling\/fluorescence\/phosphorescence\/perplexed\/dazzled and confused\/planet Mars (arch.)"],"pinyin":["ying2"],"word":"熒"},{"definition":["(standing) screen","see 屏營|屏营[bing1 ying2]","to get rid of\/to put aside\/to reject\/to keep control\/to hold (one's breath)"],"pinyin":["bing1","bing3","ping2"],"word":"屏"}],"containing_words":[],"sentences":[{"english":"After a five-year hiatus, the Billboard Music Awards officially returned in the United States.","chinese":"經過5年的停辦，美國公告牌音樂獎重回熒屏。"},{"english":"College life may never be this tumultuous, but then again, this is TV.","chinese":"大學生活本不應該動動盪蕩，僅僅體現在熒屏上。"},{"english":"After the quote was removed from the screen, Russert turned to me.","chinese":"在摘錄被從熒屏上移走後，拉塞特轉向我。"},{"english":"Alternatively, the touch screen can be used to select a square.","chinese":"二者擇一地，觸覺熒屏能用來選擇一個正方形。"},{"english":"Fans have waited a long time to see Harry Potter's kiss on the big screen.","chinese":"“哈迷”們對哈利波特的熒屏初吻期待已久。"},{"english":"Rescaling of video to utilize full-screen area.","chinese":"錄象機的再計數利用全熒屏區域。"},{"english":"His Scottish detective character, named Rebus, has been adapted for television.","chinese":"他的蘇格蘭私人偵探“雷布斯”已經被搬上熒屏。"},{"english":"Works based on the Four Masters' Works appear constantly on television.","chinese":"由四大名著改編的電視作品經常被搬上熒屏。"},{"english":"After sleep eyes still leave screen flash, blurred vision.","chinese":"分開熒屏後仍覺長遠閃光，目力恍惚。"},{"english":"A square inch place includes the infinite universe, small screen deduction in society all phenomena on earth.","chinese":"方寸之地包羅大千世界，小小熒屏演繹世間萬象。"},{"english":"And most of this on-screen violence is committed by men, as well.","chinese":"並且絕大部分熒屏上的暴力也是由男性實施的。"},{"english":"However, the screens have a limited lifespan.","chinese":"不過，這種熒屏的使用壽命有限。"}],"related":[]}