{"definition":["thermodynamics"],"pinyin":["re4 li4 xue2"],"simplified":["热力学"],"rank":51105.0,"normalized_rank":0.7150252542918305,"fraction":1.2773042350419064e-7,"cumulative_fraction":0.99910999046656,"word":"熱力學","characters":[{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"熱"},{"definition":["power\/force\/strength\/ability\/strenuously","surname Li"],"pinyin":["Li4","li4"],"word":"力"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[{"definition":["thermodynamic temperature (temperature above absolute zero)"],"pinyin":["re4 li4 xue2 wen1 du4"],"word":"熱力學溫度"},{"definition":["thermodynamic temperature scale (in degrees Kelvin, measured above absolute zero)"],"pinyin":["re4 li4 xue2 wen1 biao1"],"word":"熱力學溫標"}],"sentences":[{"english":"Thermodynamic parameters depict the endothermic nature of adsorption and the process is spontaneous.","chinese":"熱力學參數表明，吸附過程是自發的和吸熱的。"},{"english":"The dual symmetry of Legendre transformation is studied.","chinese":"指出熱力學關係具有勒讓德變換的對偶對稱性。"},{"english":"We formulate these broad thermodynamic laws.","chinese":"然後抽象這些一般的熱力學定律。"},{"english":"The oxygen autogenous smelting process of nickeliferous copper concentrate from Jinchuan Nonferrous Corp. is thermodynamically analyzed.","chinese":"對金川二次銅精礦氧氣自熱熔鍊過程進行熱力學分析。"},{"english":"In this paper, thermodynamics of irreversible processes at negative absolute temperatures is discussed.","chinese":"本文討論負絕對溫度下的不可逆過程熱力學。"},{"english":"But we know thermodynamics is all about equilibrium.","chinese":"但我們知道熱力學都是關於平衡的。"},{"english":"So in the earlier part of the course, and saw the macroscopic thermodynamic treatment.","chinese":"在課程的前一部分，見過宏觀的熱力學處理方法。"},{"english":"Consider thermodynamic functions of the system of interacting fermions using the oscillator representation.","chinese":"利用振盪表象，考慮相互作用費米系統的熱力學函數。"},{"english":"Thermodynamic optimization of insulation for pipe like surface based on entropy generation analysis is given in this paper.","chinese":"基於熵產分析，時管狀表面絕熱層進行熱力學優化。"},{"english":"If it's an equilibrium system, then thermodynamics can describe it.","chinese":"如果它是個平衡系統，那麼熱力學就能描述它。"},{"english":"The crack healing is a thermodynamic nonreversible process.","chinese":"裂紋癒合是一個不可逆的熱力學過程。"},{"english":"The thermodynamical properties of polymers are studied using a BP artificial neural network model.","chinese":"用前饋多層神經網絡方法研究了高聚物的熱力學性質。"},{"english":"Thermodynamically it is a first order transition.","chinese":"這個相變在熱力學上爲一級相變。"},{"english":"Since these are all state functions.","chinese":"因爲所有的熱力學量都是態函數。"},{"english":"Lastly, the third law of thermodynamics of black-hole has been completely discussed.","chinese":"最後，討論了黑洞的熱力學第三定律。"},{"english":"The equation is different from that of linear thermodynamics theory because of its high term.","chinese":"和線性熱力學不同的是方程中含有高次項。"}],"related":[]}