{"definition":["thermal conductivity\/heat conductivity"],"pinyin":["re4 dao3 lu:4"],"simplified":["热导率"],"rank":67698.0,"normalized_rank":0.9471828522658906,"fraction":7.590836596820472e-9,"cumulative_fraction":0.9999845879740998,"word":"熱導率","characters":[{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"熱"},{"definition":["to transmit\/to lead\/to guide\/to conduct\/to direct"],"pinyin":["dao3"],"word":"導"},{"definition":["rate\/frequency","to lead\/to command\/rash\/hasty\/frank\/straightforward\/generally\/usually"],"pinyin":["lu:4","shuai4"],"word":"率"}],"containing_words":[],"sentences":[{"english":"Our high quality grey iron includes copper to increase thermal conductivity and wear properties.","chinese":"我們的高品質灰鐵包括銅，以提高熱導率和磨損性能。"},{"english":"For the world's high-temperature insulation thermal conductivity of the area of one of the lowest.","chinese":"爲目前世界上高溫隔熱領域熱導率最低的材料之一。"},{"english":"The thermal conductivities and thermal diffusivities of the material must be known.","chinese":"必須知道各種材料的熱導率和熱擴散率。"},{"english":"The problem is the low thermal conductivity of air.","chinese":"問題在於空氣的熱導率很低。"},{"english":"Quartztes and rock salt have the highest conductivities.","chinese":"石英岩和岩鹽的熱導率最高。"},{"english":"This instrument can measure soil thermal conductivity quickly with thermal needle method.","chinese":"該儀器用熱針法可快速測量土的熱導率。"},{"english":"Quartzes and rock salt have the highest conductivities.","chinese":"石英岩和岩鹽的熱導率最高。"},{"english":"It has been used successfully to determine the thermal conductivity of hollow glassy microspheres with simple equipment.","chinese":"用該法已成功地測定了空心玻璃微球的熱導率。"},{"english":"The insulating layer thermal conductivity value of table1 is calculated by the Al-Substrate CCL thermal resistance value.","chinese":"表1中絕緣層熱導率是由鋁基板熱阻值推算所得。"},{"english":"Quartzes and rock salt have the highest conductivities .","chinese":"石英岩和岩鹽的熱導率最高。"},{"english":"How heat dissipates through a material is a matter of the materials' thermal conductivity and thickness.","chinese":"某種材料的散熱能力與材料的熱導率和厚度有關。"},{"english":"The calculation method for selection of soil thermal conductivity is given.","chinese":"給出了土壤熱導率的選取計算方法。"}],"related":[]}