{"definition":["calorific value"],"pinyin":["re4 zhi2"],"simplified":["热值"],"rank":37516.0,"normalized_rank":0.5248975137464497,"fraction":4.840618106741672e-7,"cumulative_fraction":0.9954131761137016,"word":"熱值","characters":[{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"熱"},{"definition":["value\/(to be) worth\/to happen to\/to be on duty"],"pinyin":["zhi2"],"word":"值"}],"containing_words":[{"definition":["gross calorific value"],"pinyin":["zong3 re4 zhi2"],"word":"總熱值"}],"sentences":[{"english":"It is discussed how to apply intelligent regulator to control the combustion value of mixing gas.","chinese":"詣在探討應用智能調節器控制混合煤氣熱值。"},{"english":"Combustibility of producer gas is compared with other fuel gas to use rationally low calorific value gas.","chinese":"對其燃燒特性進行比較，以利於合理使用低熱值煤氣。"},{"english":"Both coal gangue and coal bed methane are low heating value fuels.","chinese":"煤矸石和含甲烷量較低的煤層氣均屬於低熱值的燃料。"},{"english":"The extensive utilization of lower-grade fuels is at present our national energy policy.","chinese":"充分利用低熱值燃料是目前國家的能源政策之一。"},{"english":"Study on the Caloric Value of Organs at the Different Development Stages of Moringa sp.","chinese":"辣木植物器官不同發育階段的熱值研究。"},{"english":"The calorific value of Medicago populations from northern Xingjiang and cultivars were measured using Parr measurement.","chinese":"用氧彈式自動測熱儀測定苜蓿不同種羣植物體的熱值。"},{"english":"Test of dewatering performance and heat value of sludge was carried out by using addition of dewatering conditioner.","chinese":"採用加入脫水調理劑對污泥脫水性能和熱值進行試驗。"},{"english":"Correspondingly, there is an increase in LHV and density of gas.","chinese":"並且水蒸氣熱解明顯提高了產氣的熱值和密度。"},{"english":"The minimum temperature showed the negative impact on the early rice caloric value with great variation.","chinese":"最低溫度對熱值具負影響作用，表現出大的變異係數。"},{"english":"The principle and method of the caloric value control system of the gas mixing station of Panzhihua Iron &Steel Co. are presented.","chinese":"介紹了攀鋼煤氣混合站熱值控制系統的原理及方法。"}],"related":[]}