{"definition":["heat transfer\/thermal conduction"],"pinyin":["re4 chuan2 dao3"],"simplified":["热传导"],"rank":52394.0,"normalized_rank":0.7330600366571992,"fraction":1.1123495166879232e-7,"cumulative_fraction":0.999263775122888,"word":"熱傳導","characters":[{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"熱"},{"definition":["biography\/historical narrative\/commentaries\/relay station","to pass on\/to spread\/to transmit\/to infect\/to transfer\/to circulate\/to conduct (electricity)"],"pinyin":["chuan2","zhuan4"],"word":"傳"},{"definition":["to transmit\/to lead\/to guide\/to conduct\/to direct"],"pinyin":["dao3"],"word":"導"}],"containing_words":[],"sentences":[{"english":"Wellbore and formation are connected by Ramey heat-transfer coefficient.","chinese":"井筒和地層的溫度通過綜合熱傳導係數聯繫起來。"},{"english":"Heat losses from the reservoir by heat conduction cannot be prevented .","chinese":"熱儲通過熱傳導的熱損耗是無法阻擋的。"},{"english":"The potentials and fluxes at the interior points close to the boundary are computed for three-dimensional beat conduction examples.","chinese":"對三維熱傳導算例，計算了近邊界點的溫度和熱流。"},{"english":"The flow and heat transfer calculations are performed inside the computational domain.","chinese":"流動和熱傳導計算在計算的領域內部被執行。"},{"english":"It is the base of research on heat expansion and heat transfer of single screw compressors.","chinese":"它是研究單螺桿壓縮機熱膨脹及熱傳導的基礎。"},{"english":"This constant k actually is called the heat conductivity.","chinese":"這個常數k就叫做熱傳導係數。"},{"english":"Finned cast aluminum heaters offer more efficient heat dissipation.","chinese":"棒狀鑄鋁加熱器提供更有效熱傳導。"},{"english":"Theoretical models of microscale heat transfer and solving approaches are summarized.","chinese":"概述了微尺度熱傳導理論的幾種模型及其求解方法。"},{"english":"For example, the heat equation is one example of a partial differential equation.","chinese":"例如，熱傳導方程就是這樣的例子。"},{"english":"Thecalculations confirm that, in general, the undesirable effects due to sidewise heatconduction are small.","chinese":"結果表明，由側向熱傳導引起的不良效應通常比較小。"},{"english":"Isothermal Block. The thermally conductive block that equalizes the temperature of all thermocouple connections.","chinese":"等溫塊使所有熱電偶連接的溫度相同的熱傳導塊。"},{"english":"This paper presents the mathematical model of heat transfer on flange plate.","chinese":"建立了法蘭盤兩側熱傳導的數學模型。"}],"related":[]}