{"definition":["heat engine"],"pinyin":["re4 ji1"],"simplified":["热机"],"rank":56917.0,"normalized_rank":0.7963426748562394,"fraction":6.423015581925014e-8,"cumulative_fraction":0.9996529316231454,"word":"熱機","characters":[{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"熱"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[],"sentences":[{"english":"So it's going to be the case for any irreversible engine.","chinese":"這對所有不可逆熱機都成立。"},{"english":"And side by side, we're going to run another engine.","chinese":"與它並列的，有另一臺熱機。"},{"english":"So generalize our Carnot engine results.","chinese":"讓我們推廣卡諾熱機的結果。"},{"english":"So use work out of right-hand side to run left-hand backward.","chinese":"利用右邊輸出的功，來驅動左邊的熱機反方向運行。"},{"english":"Thermal engine is the drive-device of AUV driven by temperature difference energy.","chinese":"熱機是溫差能驅動水下監測平臺的動力裝置。"},{"english":"We're building up to entropy and to engines, Carnot cycles, etcetera.","chinese":"我們要研究，熵，熱機，卡洛循環等概念。"},{"english":"But, in his spare time, he built heat engines in his home workshop.","chinese":"但是，在他閒暇之餘，他會在自己的工作室建造熱機。"},{"english":"In Chapter 2, we propose a finite-time thermodynamics model for a Diesel heat engine cycle.","chinese":"第二章建立狄塞爾熱機循環的有限時間熱力學模型。"},{"english":"The experimental results are well accordant with the thermal analysis of the microcantilever unit.","chinese":"實驗結果與熱機械模型的分析一致。"},{"english":"By heat engine people mean an engine converting heat energy into mechanical work.","chinese":"熱機是指把熱能轉變爲機械功的一種發動機。"},{"english":"According to the second law of thermodynamics, a heat engine can generate power from this temperature difference.","chinese":"根據熱力學第二定律，一個熱機發電可以從這個溫差。"},{"english":"A cycle model of an irreversible Brayton heat engine working with harmonic systems is established in this paper.","chinese":"建立了一種不可逆諧振子系統布雷頓熱機循環模型。"},{"english":"Carnot's Theorem discusses the extreme value of the efficiency of heat engines' cycles.","chinese":"根據卡諾定理給出了熱機的循環效率極大值問題。"},{"english":"In a real engine, of course, you can approach the reversible limit.","chinese":"在一個真實的熱機裏，當然，你可以達到可逆極限。"},{"english":"All heat engines use the expansion of gases to convert heat energy into mechanical energy.","chinese":"所有熱機都利用氣體膨脹來把熱能轉換爲機械能。"},{"english":"In this paper, characteristic of equivalent heat drop calculation of reheat unit is analysed.","chinese":"對再熱機組等效熱降計算特性作了簡要分析。"}],"related":[]}