{"definition":["thermal cleavage (i.e. sth splits when heated)"],"pinyin":["re4 jie3"],"simplified":["热解"],"rank":47484.0,"normalized_rank":0.6643627663593245,"fraction":1.8655940712954929e-7,"cumulative_fraction":0.9985450704805462,"word":"熱解","characters":[{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"熱"},{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","surname Xie","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","to transport under guard"],"pinyin":["Xie4","jie3","jie4","xie4"],"word":"解"}],"containing_words":[],"sentences":[{"english":"Once eat cherry attack discomfort, clearing away heat and toxic material available sugar cane juice.","chinese":"一旦喫多了櫻桃發作不適，可用甘蔗汁清熱解毒。"},{"english":"Here we can see a typical thermogravimetric analysis.","chinese":"現在我們可看到典型的熱解重量分析法。"},{"english":"Objective To establish a quality standard for heat-clearing and detoxicating mixture.","chinese":"目的建立清熱解毒合劑的質量控制方法。"},{"english":"After the pyrolysis coking process, the pyrrhotite was the main form of the catalyst residual.","chinese":"經過熱解制焦後，催化劑殘留的主要形態是磁黃鐵礦。"},{"english":"Temperature is the main factor to influence the coal residue pyrolysis.","chinese":"熱解溫度是影響煤矸石熱解反應最主要的因素。"},{"english":"Temperature is the main factor to influence the coal residue pyrolysis.","chinese":"熱解溫度是影響煤矸石熱解反應最主要的因素。"},{"english":"Gas chromatography shows that there are more than 100 compounds in light hydrocarbon pyrolysates.","chinese":"經毛細色譜分析，熱解輕烴中有100餘種化合物。"},{"english":"The rutile Ti-O film has the similar blood compatibility compared with the low temperature isotropic pyrolytic carbon.","chinese":"金紅石型氧化鈦薄膜具有與熱解碳相當的血液相容性。"},{"english":"A self made graphite platform was installed in pyrolytic graphite tube of graphite furnace.","chinese":"用自制的石墨平臺安裝於石墨爐中熱解石墨管內。"},{"english":"The tars produced in multi-stage pyrolysis under syngas were also analyzed.","chinese":"最後，還對合成氣氣氛下多段熱解的油品進行了分析。"},{"english":"The properties and compositions of the bio-oi1 from fast pyrolysis of apricot stone were studied.","chinese":"對杏核熱解油的性質和組成進行了研究。"},{"english":"The main function of mother-in-law man is clear hot detoxify , subsidence of a swelling and diuresis.","chinese":"婆婆丁的主要功能是清熱解毒，消腫和利尿。"},{"english":"Spherical cobalt blue with good reflectivity characteristics was synthesized by spray pyrolysis.","chinese":"研究了噴霧熱解法合成高性能球形鈷藍。"},{"english":"Through pyrolysis , Hg and pyrolytic vapor will be reliefed from organic samples.","chinese":"生物樣品經高溫熱解，汞及大量熱解氣體一同釋出。"},{"english":"Through pyrolysis , Hg and pyrolytic vapor will be reliefed from organic samples.","chinese":"生物樣品經高溫熱解，汞及大量熱解氣體一同釋出。"},{"english":"Mung bean soup is not only cool to quench their thirst, have heat-clearing and detoxifying effect.","chinese":"綠豆湯不僅清涼解渴，還有清熱解毒的功效。"}],"related":[]}