{"definition":["hot treatment (e.g. of metal)"],"pinyin":["re4 chu3 li3"],"simplified":["热处理"],"rank":38958.0,"normalized_rank":0.5450729646160088,"fraction":4.23919028407051e-7,"cumulative_fraction":0.9960680520386934,"word":"熱處理","characters":[{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"熱"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"}],"containing_words":[],"sentences":[{"english":"Homogenizing treatment process of said alloy is optimized.","chinese":"優化了該合金的均勻化熱處理工藝。"},{"english":"The results show that both are caused by decarburization in heat tret - ment.","chinese":"結果表明，兩者均爲熱處理脫碳所引起。"},{"english":"HMF was produced after heating, especially in pasteurizing after filling.","chinese":"HMF是在熱處理後產生，特別是灌裝後巴氏殺菌。"},{"english":"A heat treatment is carried out in vacuum after the formation of the thin film.","chinese":"氮化鐵薄膜形成後，在真空中進行熱處理。"},{"english":"We must determine the heat-treatment technical parameters, according to its influence.","chinese":"因此，必須考慮其影響來綜合制訂熱處理工藝參數。"},{"english":"The improvement in the heat treatment technology of the stamping die for the silicon steel sheet was introduced.","chinese":"介紹了硅鋼片沖模熱處理工藝的改進。"},{"english":"The most common treatments applied to proteinaceous raw materials are different heat treatments.","chinese":"應用於蛋白質原料的最普通處理是不同的熱處理。"},{"english":"Appropriately increasing heat-retaining time can make MMC size fine.","chinese":"熱處理保溫時間的適當增長可使MMC組織變得細小。"},{"english":"The granule surface of starch had little change after heat-moist treatment (HMT).","chinese":"其中溼熱處理前後澱粉的顆粒形貌變化較小。"},{"english":"However, carbon and two-step annealing can promote the precipitation of oxygen.","chinese":"但是，碳和低高溫兩步熱處理都可以促進氧沉澱。"},{"english":"The problem studied in this paper is motivated by heat-treatment operations in the pre-casting stage of steel casting manufacturing.","chinese":"本研究源於鋼鐵鑄造業中預鑄階段的熱處理作業。"},{"english":"The long neck flange should have stress-relief heat treatment after welding.","chinese":"拼接法蘭應進行焊後消除應力熱處理。"},{"english":"The influence of heat-treatment on the property of electro iron has researched.","chinese":"研究了熱處理工藝對電鑄電工純鐵性能的影響。"},{"english":"The content of sulphides does not change with the variation of tempering temperature.","chinese":"硫化物數量基本不隨熱處理制度變化。"},{"english":"Low-temperature electrolytic sulphurizing is a new chemical heat-treatment processing.","chinese":"低溫電解滲硫是一項新型的化學熱處理工藝。"},{"english":"Objective The objective of this study was to learn the influence of crystallization on mechanical properties of DGC.","chinese":"目的探討晶化熱處理對牙用玻璃陶瓷力學性能的影響。"}],"related":[{"definition":["clamp\/fixture (machining)"],"pinyin":["jia1 ju4"],"word":"夾具"},{"definition":["to smelt"],"pinyin":["rong2 lian4"],"word":"熔煉"},{"definition":["computer numerical control machine tool (CNC machine tool)"],"pinyin":["shu4 kong4 ji1 chuang2"],"word":"數控機床"},{"definition":["electroplating\/electroplated"],"pinyin":["dian4 du4"],"word":"電鍍"},{"definition":["fiberglass\/glass fiber"],"pinyin":["bo1 li2 xian1 wei2"],"word":"玻璃纖維"},{"definition":["aluminum alloy"],"pinyin":["lu:3 he2 jin1"],"word":"鋁合金"},{"definition":["radiator (for heating a room)\/radiator (for cooling an engine)"],"pinyin":["san4 re4 qi4"],"word":"散熱器"},{"definition":["metal plate"],"pinyin":["jin1 shu3 ban3"],"word":"金屬板"},{"definition":["glass-reinforced plastic\/fiberglass"],"pinyin":["bo1 li5 gang1"],"word":"玻璃鋼"},{"definition":["silver-plated"],"pinyin":["du4 yin2"],"word":"鍍銀"},{"definition":["to spread litter in a cowshed, pigsty etc","washer (on bolt)\/toilet seat"],"pinyin":["dian4 juan4","dian4 quan1"],"word":"墊圈"},{"definition":["solenoid (electrical engineering)\/coil"],"pinyin":["xian4 quan1"],"word":"線圈"},{"definition":["plywood"],"pinyin":["jiao1 he2 ban3"],"word":"膠合板"},{"definition":["inner tube (of a tire)"],"pinyin":["nei4 tai1"],"word":"內胎"},{"definition":["industrial waste product\/slag"],"pinyin":["fei4 zha1"],"word":"廢渣"},{"definition":["heat-resistant"],"pinyin":["nai4 gao1 wen1"],"word":"耐高溫"}]}