{"definition":["to ignite\/to light\/fig. to spark off (hopes, controversy, flames of revolution)"],"pinyin":["ran2 qi3"],"simplified":["燃起"],"rank":14162.0,"normalized_rank":0.19814475396303502,"fraction":0.000004560049107913037,"cumulative_fraction":0.9553856622389092,"word":"燃起","characters":[{"definition":["to burn\/to ignite\/to light\/fig. to spark off (hopes)\/to start (debate)\/to raise (hopes)"],"pinyin":["ran2"],"word":"燃"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"With the countless torches lit, with the silent sea of faces and the unbarred heads.","chinese":"無數火炬燃起，無數臉孔和致哀者彙集的沉默海洋。"},{"english":"Forged in a fire lit long ago, stand next to me, you'll never stand i moreovertself.","chinese":"歷煉之火早已燃起，與我比肩，你將永不寂寞。"},{"english":"Better to light one candle than to curse the dark-ness.","chinese":"與其詛咒黑暗，毋如燃起蠟燭。"},{"english":"When he left, I saw his face with a crimson.","chinese":"他離開時，我看到他的臉上燃起一片緋紅。"},{"english":"The Libya operation has reinvigorated African fears about American power.","chinese":"利比亞行動重新燃起了非洲對美國力量的恐懼感。"},{"english":"As evening falls, each family begins to put on their lights.","chinese":"初更時候，家家戶戶開始燃起燈火。"},{"english":"The night's silence , like a deep lamp, is burning with the light of its milky way.","chinese":"夜的靜謐，如一盞深沉的燈，銀河便是它燃起的燈光。"},{"english":"They turned round, and every man there saw his own cottage burning.","chinese":"大家轉頭一看，每個人都看到自己家的房子燃起大火。"},{"english":"What can we do to re-ignite our passion?","chinese":"怎樣才能使我們的熱情重新燃起呢？"},{"english":"Families lit incense and wept in front of piles of rubble.","chinese":"倖存的人家燃起薰香，在一片廢墟中悲泣。"},{"english":"Make sure use the saw with continuous watering to prevent building a fire through scraping.","chinese":"使用盤鋸肯定不要斷水，防止摩擦生熱陰燃起火。"},{"english":"The battle for supremacy in the mobile industry has only just begun.","chinese":"移動產業，誰主沉浮，戰火纔剛剛燃起。"},{"english":"He tried to rekindle her attention.","chinese":"他想再去燃起她的情火。"},{"english":"Zuo Feiyo and Ku Bai gathered some dry branches and made a fire below the tower .","chinese":"左非右與褲白撿了一些枯枝，在塔下燃起一個火堆。"},{"english":"We had lit many bonfires.","chinese":"我們燃起了一堆堆篝火。"},{"english":"I also went out just kindled the compassion, the head also does not answer to go.","chinese":"我也熄滅了剛剛燃起的一絲憐憫，頭也不回地走了。"}],"related":[{"definition":["raging\/flaming"],"pinyin":["xiong2 xiong2"],"word":"熊熊"},{"definition":["to ignite\/to set on fire\/aflame"],"pinyin":["dian3 ran2"],"word":"點燃"},{"definition":["to stop burning\/to go out (of fire)\/to die out\/extinguished"],"pinyin":["xi1 mie4"],"word":"熄滅"},{"definition":["flame"],"pinyin":["huo3 miao2"],"word":"火苗"},{"definition":["blaze\/flame"],"pinyin":["huo3 yan4"],"word":"火焰"},{"definition":["to ignite\/to combust\/to burn\/combustion\/flaming"],"pinyin":["ran2 shao1"],"word":"燃燒"},{"definition":["flame\/blaze"],"pinyin":["huo3 guang1"],"word":"火光"},{"definition":["to extinguish\/to put out (fire)\/to quench\/to stop burning\/to go out (of fire, lamp etc)\/to come to an end\/to wither away\/to die out\/Taiwan pr. [xi2]"],"pinyin":["xi1"],"word":"熄"},{"definition":["to raise\/to hoist\/to rise"],"pinyin":["sheng1 qi3"],"word":"升起"},{"definition":["to rise\/to ascend\/to leap up"],"pinyin":["sheng1 teng2"],"word":"升騰"},{"definition":["ember"],"pinyin":["yu2 jin4"],"word":"餘燼"},{"definition":["to have a fever reaching (a certain temperature)"],"pinyin":["shao1 dao4"],"word":"燒到"},{"definition":["to start a prairie fire"],"pinyin":["liao2 yuan2"],"word":"燎原"},{"definition":["a single spark (idiom); an insignificant cause can have a massive effect"],"pinyin":["xing1 xing5 zhi1 huo3"],"word":"星星之火"},{"definition":["burning fiercely\/flaming\/blazing"],"pinyin":["chi4 lie4"],"word":"熾烈"},{"definition":["ashes"],"pinyin":["hui1 jin4"],"word":"灰燼"}]}