{"definition":["lampstand"],"pinyin":["deng1 tai2"],"simplified":["灯台"],"rank":48555.0,"normalized_rank":0.6793474458886573,"fraction":1.67874270891222e-7,"cumulative_fraction":0.9987347811067084,"word":"燈臺","characters":[{"definition":["lamp\/light\/lantern\/CL:盞|盏[zhan3]"],"pinyin":["deng1"],"word":"燈"},{"definition":["Taiwan (abbr.)","platform\/stage\/terrace\/stand\/support\/station\/broadcasting station\/classifier for vehicles or machines"],"pinyin":["Tai2","tai2"],"word":"臺"}],"containing_words":[],"sentences":[{"english":"20 the lampstands of pure gold with their lamps, to burn in front of the inner sanctuary as prescribed;","chinese":"並精金的燈臺和燈盞，可以照例點在內殿前。"},{"english":"Its wick trimmers and trays are to be of pure gold.","chinese":"燈臺的蠟剪和蠟花盤也是要精金的。"},{"english":"Of a talent of pure gold shall he make it, with all these vessels.","chinese":"作燈臺和這一切的器具要用精金一他連得。"},{"english":"And being turned, I saw seven golden candlesticks;","chinese":"既轉過來，就看見七個金燈臺。"},{"english":"He shall order the lamps upon the pure candlestick before the LORD continually.","chinese":"他要在耶和華面前常收拾精金燈臺上的燈。"},{"english":"L is for the Lampstand, one church in each city shining.","chinese":"是燈臺，一城一召會照亮。"},{"english":"Of a talent of pure gold made he it, and all the vessels thereof.","chinese":"他用精金一他連得作燈臺和燈臺的一切器具。"},{"english":"Of a talent of pure gold made he it, and all the vessels thereof.","chinese":"他用精金一他連得作燈臺和燈臺的一切器具。"},{"english":"And the tongs thereof, and the snuffdishes thereof, shall be of pure gold.","chinese":"燈臺的臘剪和臘花盤也是要精金的。"},{"english":"A talent of pure gold is to be used for the lampstand and all these accessories.","chinese":"做燈臺和這一切的器具要用精金一他連得。"},{"english":"A lamp had been knocked over, and the throw rug was wadded against one wall.","chinese":"一具燈臺倒着，小地毯卷靠在牆邊。"},{"english":"A talent of pure gold was used for the lampstand and its various appurtenances .","chinese":"爲做燈臺和一切用具，用了一塔冷通純金。"}],"related":[]}