{"definition":["burn (injury)"],"pinyin":["shao1 shang1"],"simplified":["烧伤"],"rank":9968.0,"normalized_rank":0.1394652526128748,"fraction":0.000008316929312831723,"cumulative_fraction":0.929432424915976,"word":"燒傷","characters":[{"definition":["to burn\/to cook\/to stew\/to bake\/to roast\/to heat\/to boil (tea, water etc)\/fever\/to run a temperature\/(coll.) to let things go to one's head"],"pinyin":["shao1"],"word":"燒"},{"definition":["to injure\/injury\/wound"],"pinyin":["shang1"],"word":"傷"}],"containing_words":[],"sentences":[{"english":"Conclusion Complex treatment is the most effective method for treatment of residual brun wound.","chinese":"結論綜合治療是治療燒傷殘餘創面的重要方法。"},{"english":"Objectives To explore the training method of comprehensive competence for junior nurses in burn department.","chinese":"目的探討燒傷科新護士綜合護理能力的培養方法。"},{"english":"The adrenocortical response appears to parallel the severity of the burn .","chinese":"腎上腺皮質反應與燒傷的嚴重性是平行的。"},{"english":"ObjectiveTo find out the cause and actualities of pre-hospital care of pedo-burn.","chinese":"目的瞭解小兒燒傷的致傷因素和院前急救現狀。"},{"english":"Objective To examine the usefulness of keratoplasty with the patients of symblepharon after burns.","chinese":"目的觀察角膜移植治療燒傷後瞼球粘連的效果。"},{"english":"Objective To investigate the protective effects of ulinastatin on organ function in severe burn.","chinese":"目的探討烏司他丁對嚴重燒傷患者臟器功能的作用。"},{"english":"Evaluate the usage of radical scavengers in alkali burns of cornea.","chinese":"探討角膜鹼燒傷後自由基清除劑治療機制。"},{"english":"Objector To evaluate the value of laminar flow in the treatment of bums.","chinese":"目的探索層流潔淨技術治療大面積燒傷的價值。"},{"english":"Objective To study the therapeutic effect of biological amnion covering on early severe ocular burn.","chinese":"目的探討生物羊膜在早期重度眼表燒傷中的臨牀療效。"},{"english":"Objective To study the effect of Reptilase in the burn and plastic surgery.","chinese":"目的觀察立止血在燒傷整形手術中的止血效果。"},{"english":"Objective To explore diagnosis and treatment methods of a batch of extensive burn combined with burst injury of lung.","chinese":"目的探討成批特重燒傷合併衝擊傷的診斷及治療方法。"},{"english":"Please prescribe some medicine for the burn.","chinese":"請爲我開藥方治燒傷。"},{"english":"Product such as not escape, cannot jump high walls, the legs are hot coals burns.","chinese":"品如無路可逃，無法跳下高牆，腿被炙熱的炭火燒傷。"},{"english":"Venipuncture is a common method used to rescue and treat burned child.","chinese":"靜脈穿刺是搶救與治療小兒燒傷的常用手段之一。"},{"english":"Objective Present paper aims at Summing up the experience of mass hot cement burn Casulties.","chinese":"目的總結成批熱水泥燒傷病人救治經驗。"},{"english":"The findings would be helpful to guide the treatment of alkali burns.","chinese":"這一次發現有助於指導鹼燒傷的治療。"}],"related":[{"definition":["a burn (tissue damage from heat, chemicals etc)\/to burn (the skin etc)\/(fig.) (of anger, jealousy etc) to hurt (sb)"],"pinyin":["zhuo2 shang1"],"word":"灼傷"},{"definition":["to abrade\/to scrape\/to chafe\/to graze\/abrasion\/friction burn\/scratch"],"pinyin":["ca1 shang1"],"word":"擦傷"},{"definition":["to scald"],"pinyin":["tang4 shang1"],"word":"燙傷"},{"definition":["lightly wounded\/minor injuries"],"pinyin":["qing1 shang1"],"word":"輕傷"},{"definition":["condition of an injury"],"pinyin":["shang1 shi4"],"word":"傷勢"},{"definition":["seriously hurt\/serious injury"],"pinyin":["zhong4 shang1"],"word":"重傷"},{"definition":["neck"],"pinyin":["jing3 bu4"],"word":"頸部"},{"definition":["to become bruised\/bruising\/bruise"],"pinyin":["yu1 shang1"],"word":"瘀傷"},{"definition":["head"],"pinyin":["tou2 bu4"],"word":"頭部"},{"definition":["to burn\/to scorch\/burned\/burning\/scorched\/charred"],"pinyin":["shao1 jiao1"],"word":"燒焦"},{"definition":["to rescue"],"pinyin":["qiang3 jiu4"],"word":"搶救"},{"definition":["to die in an accident or disaster\/to be killed"],"pinyin":["li2 nan4"],"word":"罹難"},{"definition":["casualty\/victim (of an accident)\/wounded person"],"pinyin":["shang1 zhe3"],"word":"傷者"},{"definition":["to rescue\/to be rescued"],"pinyin":["huo4 jiu4"],"word":"獲救"},{"definition":["to gash\/to cut\/gash\/cut"],"pinyin":["ge1 shang1"],"word":"割傷"},{"definition":["hit by a bullet\/shot"],"pinyin":["zhong4 dan4"],"word":"中彈"}]}