{"definition":["caustic soda NaOH"],"pinyin":["shao1 jian3"],"simplified":["烧碱"],"rank":28928.0,"normalized_rank":0.4047402515635275,"fraction":0.0000010355652849585469,"cumulative_fraction":0.9891838729885996,"word":"燒鹼","characters":[{"definition":["to burn\/to cook\/to stew\/to bake\/to roast\/to heat\/to boil (tea, water etc)\/fever\/to run a temperature\/(coll.) to let things go to one's head"],"pinyin":["shao1"],"word":"燒"},{"definition":["base\/alkali\/soda (chemistry)"],"pinyin":["jian3"],"word":"鹼"}],"containing_words":[],"sentences":[{"english":"The domestic caustic soda production techniques by diaphragm method and ion-exchange membrane method at present are introduced.","chinese":"介紹了當前國內隔膜法和離子膜法燒鹼的生產技術。"},{"english":"The preparation of laminated crystalline sodium silicate from flake caustic soda was discussed.","chinese":"對用片狀燒鹼製備層狀結晶硅酸鈉進行了探討。"},{"english":"The results of experiment indicate that whole cotton stalk pulp by KP cooking is better than that by soda-AQ cooking.","chinese":"從實驗結果看出全棉稈蒸煮硫酸鹽法好於燒鹼蒽醌法。"},{"english":"Some of the color usually stays on while its in the caustic soda, but it wipes right off.","chinese":"一些通常的顏色，而停留在其在燒鹼，但馬上擦拭。"},{"english":"The running situation of the electrochemical rectification facility in Hengyang Caustic Soda Plant of Hunan Province was introduced.","chinese":"介紹了湖南省衡陽燒鹼廠電化學整流裝置的運行情況。"},{"english":"This new method had advantage over the caustic soda lime one, despite its higher sodium hydroxide consumption.","chinese":"該法比燒鹼石灰法有諸多優點，鹼耗較高是其不足。"},{"english":"Design plot of land is the site of caustic soda plant in Taizhou, which belongs to the brownfields range.","chinese":"設計地塊原址爲台州燒鹼廠，屬於棕地改造的範圍。"},{"english":"The modifications of caustic soda facility and production techniques of chlor-alkali plant of Qilu Petrochemical Inc. are summarized.","chinese":"總結了齊魯氯鹼廠燒鹼裝置及生產技術的改進。"}],"related":[]}