{"definition":["to press (clothes)\/to iron out (wrinkles)"],"pinyin":["tang4 ping2"],"simplified":["烫平"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"燙平","characters":[{"definition":["to scald\/to burn (by scalding)\/to blanch (cooking)\/to heat (sth) up in hot water\/to perm\/to iron\/scalding hot"],"pinyin":["tang4"],"word":"燙"},{"definition":["flat\/level\/equal\/to tie (make the same score)\/to draw (score)\/calm\/peaceful\/see also 平聲|平声[ping2 sheng1]","surname Ping"],"pinyin":["Ping2","ping2"],"word":"平"}],"containing_words":[],"sentences":[{"english":"The wrinkled silk will flatten out if you iron it.","chinese":"發皺的絲綢可以用熨斗燙平。"},{"english":"It took a long time to iron out all the creases in this dress.","chinese":"燙平這件衣服上的皺痕花了很長時間。"},{"english":"It is the commitment of central bank to smooth the volatility of the foreign exchange market in the short interval.","chinese":"燙平短期匯市劇烈波動是中央銀行的職責。"},{"english":"Will you iron out the wrinkles in this skirt?","chinese":"能否幫我燙平這個裙子嗎？"},{"english":"Damp clothes iron easily.","chinese":"溼衣服容易燙平。"},{"english":"She smoothed the creases out with an electric iron .","chinese":"她用電熨斗把皺褶燙平。"},{"english":"He likes smoothing down his shirt before wearing it.","chinese":"他喜歡穿襯衣物前把它燙平。"},{"english":"I want my trousers (to be) ironed out.","chinese":"我希望把我的褲子燙平。"},{"english":"Damp clothes iron [press] easily.","chinese":"溼衣服容易燙平。"},{"english":"Please smooth this dress with a hot iron.","chinese":"請用一個熱的熨斗燙平這件衣服。"},{"english":"The machine can easily reach the wrinkled position that cannot be reached by common iron.","chinese":"能輕易的吹挺一般熨斗不能燙平的鄒疊部位。"},{"english":"I've got to get this shirt washed and ironed.","chinese":"我這些襯衫和長褲要乾洗和燙平。"},{"english":"This garment should be put on after being ironed by an electric iron.","chinese":"這件衣服應該用電熨斗燙平後再穿。"},{"english":"This silk dress presses well.","chinese":"這件絲綢連衣裙很容易燙平。"},{"english":"Spray it a little wet may help ironing out the wrinkles.","chinese":"熨燙時，可適量噴溼，易於燙平。"},{"english":"Will you iron out the wrinkles in the skirt?","chinese":"沒出國疑問幫我把這件裙子燙平嗎？"}],"related":[]}