{"definition":["grate"],"pinyin":["lu2 jia4"],"simplified":["炉架"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"爐架","characters":[{"definition":["stove\/furnace"],"pinyin":["lu2"],"word":"爐"},{"definition":["to support\/frame\/rack\/framework\/classifier for planes, large vehicles, radios etc"],"pinyin":["jia4"],"word":"架"}],"containing_words":[],"sentences":[{"english":"Put some greenery along the mantle to soften the edge a little bit.","chinese":"沿着壁爐架擺放了一些綠葉以使邊線看起來柔和一點。"},{"english":"On the mantel were photographs of a man and a woman.","chinese":"壁爐架上面是一對男女的一些照片。"},{"english":"That's a mantelpiece cluttered up with all kinds of doodad .","chinese":"那是個擺滿了各種小玩意兒的壁爐架。"},{"english":"Lady Catherine's drawing rooms costs eight hundred pounds.","chinese":"甚至凱瑟琳夫人一個畫室的壁爐架就價值八百英鎊。"},{"english":"There was a little heraldic chair by the chimney-piece .","chinese":"壁爐架旁邊有一把印有紋章的小椅子。"},{"english":"He set the glass on the mantel .","chinese":"他把玻璃杯放在壁爐架上。"},{"english":"I heard him knock his pipe out on the mantelpiece.","chinese":"我聽見他在壁爐架上磕打菸斗。"},{"english":"Hareton, I'll leave this book upon the chimney-piece, and I'll bring some more tomorrow.'","chinese":"哈里頓，我把這本書放在爐架上，我明天再拿點來。"},{"english":"She centered the clock on the mantelpiece.","chinese":"她將時鐘放在壁爐架正中央。"},{"english":"Be careful not to strike your head against the mantel.","chinese":"小心不要使你的頭撞到壁爐架。"},{"english":"I heard him knock out his pipe on the mantelpiece.","chinese":"我聽見他在壁爐架上磕打菸斗。"},{"english":"I glare up at the family photos on the mantel, over the fireplace.","chinese":"我擡頭怒視壁爐架上的家庭照片，就在壁爐的上方。"},{"english":"The Bishop's candlesticks were in their place on the chimney-piece.","chinese":"主教的蠟燭臺仍放在壁爐架上。"},{"english":"That is one of my paintings over the chimney-piece.","chinese":"壁爐架上的那幅畫就是我畫的。"},{"english":"Even the chimney-piece in one of Lady Catherine's drawing rooms costs eight hundred pounds.","chinese":"甚至凱瑟琳夫人一個畫室的壁爐架就價值八百英鎊。"},{"english":"He had thrust his chest out, supporting his shoulders against the mantel .","chinese":"他挺起胸脯，肩膊抵着壁爐架。"}],"related":[]}