{"definition":["to obtain by an effort\/to strive to get sth"],"pinyin":["zheng1 de2"],"simplified":["争得"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"爭得","characters":[{"definition":["to strive for\/to vie for\/to argue or debate\/deficient or lacking (dialect)\/how or what (literary)"],"pinyin":["zheng1"],"word":"爭"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[],"sentences":[{"english":"The couple had a heck of an argument and kept us awake all night.","chinese":"爭得夠嗆，弄得咱們一晚上沒眨眼皮。"},{"english":"He has a competive quarrel with his boss.","chinese":"他和老闆爭得面紅耳赤。"},{"english":"So it is what that drives you to move forward and to pursue the unlimited wealth with unremitting efforts?","chinese":"是什麼促使您執著向前，去爭得明擺著花不完的財富？"},{"english":"You can talk things over, or even argue, with your boss.","chinese":"你可以和老闆討論事情，甚至可以爭得面紅耳赤。"},{"english":"Monica and Ross compete for the \"Geller Cup.\"","chinese":"莫妮卡和羅斯爲家族的“蓋勒杯”爭得頭破血流。"},{"english":"He argued with the boss until he was blue in the face.","chinese":"他和老闆爭得面紅耳赤。"},{"english":"So as to win in the world culture should be the seat of the forest.","chinese":"這樣才能在世界文化之林中爭得應有之席。"},{"english":"Kit shared his views and we had a lot of good arguments.","chinese":"基特和傑克遜的觀點一樣，我們常常爭得面紅耳赤。"}],"related":[]}