{"definition":["to fall over each other in their eagerness to..."],"pinyin":["zheng1 xiang1"],"simplified":["争相"],"rank":9956.0,"normalized_rank":0.13929735704391868,"fraction":0.000008327147746712058,"cumulative_fraction":0.9293325714019408,"word":"爭相","characters":[{"definition":["to strive for\/to vie for\/to argue or debate\/deficient or lacking (dialect)\/how or what (literary)"],"pinyin":["zheng1"],"word":"爭"},{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"}],"containing_words":[],"sentences":[{"english":"Does north and south Han scramble for making space trash , the nobody tube?","chinese":"南北韓爭相製造太空垃圾，沒人管管？"},{"english":"Already, he says, people are flocking to the new, efficient products.","chinese":"他說，人們已經爭相購買新的節能產品了。"},{"english":"A report by Jiangxi Economic and Trade Department also shows the trend of an emulative inrushing of foreign investment.","chinese":"江西省經貿廳一份報告也顯示了外資爭相湧入的趨勢。"},{"english":"At meal times the odour of sauerkraut vies with that of garlic.","chinese":"用飯的時候，德國泡菜味和大蒜味爭相散發。"},{"english":"If the Sitka plan succeeds, other water-rich cities may soon follow.","chinese":"如果西特卡的計劃成功，其他的多水城市會爭相效仿。"},{"english":"Siblings become enemies, fighting over assets that are left.","chinese":"所遺家產，成爲兄弟反目，爭相搶奪。"},{"english":"Meanwhile operators are scrambling to catch up.","chinese":"與此同時經營商們爭相趕上。"},{"english":"Since then, people rushed to convert to expand the ethos, buddhist apart.","chinese":"此後，人們爭相皈依，信佛的風氣便擴大開來。"},{"english":"But when a ten-year married man looks happy, we wonder why.","chinese":"十年婚男若露喜，大家爭相會猜謎。"},{"english":"When Lai Gemi is released, people scramble to his house to see him.","chinese":"當萊格米被釋放後，人們爭相前往他的住所去看望他。"},{"english":"Now, there seems to be a competition to punish him.","chinese":"而現在呢，似乎所有人都在爭相懲治被告。"}],"related":[]}