{"definition":["erg (physics) (loanword)"],"pinyin":["er3 ge2"],"simplified":["尔格"],"rank":27680.0,"normalized_rank":0.3872791123920921,"fraction":0.0000011602301782986368,"cumulative_fraction":0.9878147612343602,"word":"爾格","characters":[{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"},{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"}],"containing_words":[{"definition":["Belgrade, capital of Serbia"],"pinyin":["Bei4 er3 ge2 lai2 de2"],"word":"貝爾格萊德"},{"definition":["ancient name of Ulan Bator"],"pinyin":["Wu1 er3 ge2"],"word":"烏爾格"},{"definition":["Belgrade, capital of Serbia (Tw)"],"pinyin":["Bei4 er3 ge2 le4"],"word":"貝爾格勒"},{"definition":["Hans Asperger (1906-1980), Austrian pediatrician"],"pinyin":["A1 si1 pei4 er3 ge2 er3"],"word":"阿斯佩爾格爾"}],"sentences":[{"english":"Fulgrim of the Emperor's Children was the closest to horus.","chinese":"帝皇之子的福爾格里姆是最親近何魯斯的人。"},{"english":"Goldberg said researchers have been working with robots for 50 years.","chinese":"戈爾德貝爾格說研究人員50年來一直研究機器人。"},{"english":"OK, I was wrong about my earlier less-than-flattering description of the Hostel Belgrade.","chinese":"好了，我先前對貝爾格萊德旅館的不恭之詞錯了。"},{"english":"The Beagle's first stop was one of the Cape Verde Islands near the coast of Africa.","chinese":"貝爾格號第一站在非洲海岸附近的佛得角停靠。"},{"english":"Unlike Milgram's experiment, this shock was real.","chinese":"與米爾格倫實驗不同的是，這種電擊是真實的。"},{"english":"The Beagle continued to the coast of South America.","chinese":"貝爾格號繼續駛向南美海岸。"},{"english":"Ignore this effect if Erg Raiders has summoning sickness.","chinese":"如果爾格騎隊正處於召喚失調，則忽略此效果。"},{"english":"I have some raw data that I want to import to ELGG social networking website.","chinese":"我有一些，我要導入到埃爾格社交網站的原始數據。"},{"english":"Recordings were an important part of the work of the Alban Berg Quartet.","chinese":"錄音都表明了貝爾格四重奏工作的重要組成部分。"},{"english":"Rosemary arranges for Jack to live temporarily with his friend Chuck Bolger.","chinese":"羅斯瑪麗安排生活暫時傑克與他的朋友查博爾格。"},{"english":"Pine Island Bay is tucked into a corner of the West Antarctic’s Walgreen Coast.","chinese":"松島灣位於是西南極洲的沃爾格林海岸。"},{"english":"Belgrade intends to harmonise the law with those in Europe.","chinese":"貝爾格萊德打算同歐洲的法律一致。"},{"english":"At just 24 years old, Garg has two ventures to her name.","chinese":"年僅24歲的加爾格名下已經有了兩家公司。"},{"english":"Pilger said he knows that Assange has angered some people.","chinese":"皮爾格說他知道阿桑奇得罪了一些人。"},{"english":"Serbia's also experienced 38 degree heat on Monday.","chinese":"爾維亞首都貝爾格萊德也遭遇到了38度的高溫。"},{"english":"Feinberg has yet to set a deadline for applying for long-term compensation.","chinese":"費恩貝爾格還沒有對申請長期補償設置截止日期。"}],"related":[]}