{"definition":["section\/fragment\/segment"],"pinyin":["pian4 duan4"],"simplified":["片断"],"rank":14721.0,"normalized_rank":0.2059658892169071,"fraction":0.00000428298357212909,"cumulative_fraction":0.9578573517674944,"word":"片斷","characters":[{"definition":["disk\/sheet","thin piece\/flake\/a slice\/film\/TV play\/to slice\/to carve thin\/partial\/incomplete\/one-sided\/classifier for slices, tablets, tract of land, area of water\/classifier for CDs, movies, DVDs etc\/used with numeral 一[yi1]: classifier for scenario, scene, feeling, atmosphere, sound etc\/Kangxi radical 91"],"pinyin":["pian1","pian4"],"word":"片"},{"definition":["to break\/to snap\/to cut off\/to give up or abstain from sth\/to judge\/(usu. used in the negative) absolutely\/definitely\/decidedly"],"pinyin":["duan4"],"word":"斷"}],"containing_words":[],"sentences":[{"english":"You only run these segments when you call the function.","chinese":"在您調用函數時，僅運行相應的片斷。"},{"english":"The field cache has therefore been modified such that it only reloads parts where the segment has changed.","chinese":"因此，修改後的字段緩存只會加載更新過的片斷。"},{"english":"He was calm and steady when playing difficult things.","chinese":"在演奏一些難度片斷時，他依然很淡定。"},{"english":"This little snake had a tougher customer the other day in the bit of eternity it was trying to swallow.","chinese":"那天，這難纏傢伙成爲小蛇難以下嚥的不朽片斷。"},{"english":"Cut potatoes into bite-sized pieces.","chinese":"切土豆成叮咬大小的片斷。"},{"english":"Does not have detachable pieces that can lodge in the windpipe, ears, or nostrils.","chinese":"沒有可拆卸的片斷，可以向在氣管，耳朵，或鼻孔。"},{"english":"The avirulence gene fragment is homologous in all races of the pathogen of Xoo.","chinese":"該無毒基因片斷在此病原的不同小種中均有同源性。"},{"english":"She took a piece of bacon and ran out of the house.","chinese":"她採取了煙肉片斷並且用盡了房子。"},{"english":"A lol of Passage of Wei Book, which were rich and colorful, were full of features of short story.","chinese":"緯書內容豐富博雜，許多緯書片斷具有濃郁的小說性。"},{"english":"The image below illustrates a piece of an SDD file that carries out a test case.","chinese":"下圖顯示了執行測試用例的SDD文件的片斷。"},{"english":"Both code snippets will retrieve the tasks where the assignee currently is the given user.","chinese":"上述兩個代碼片斷都能夠取出用戶被支使的使命列表。"},{"english":"He skillfully fuses these fragments into a cohesive whole.","chinese":"他巧妙地把這些片斷合併成連貫的整體。"},{"english":"Inspired by a piece of pottery made by Eva.","chinese":"啓發由伊娃做的瓦器片斷。"},{"english":"The repeated process fragment must be placed inside these loop modeling elements.","chinese":"重複的流程片斷必須置於這些循環建模元素內。"},{"english":"Rip off as many samples from horror movies as possible to use in your extreme album. Copyright is for pussies .","chinese":"從恐怖電影中抄襲儘量多的片斷用在你的極端專輯中。"},{"english":"Over the past few years they have been working on the various bits and pieces needed.","chinese":"過去的幾年中，他們在各式各樣的字節和片斷中工作。"}],"related":[{"definition":["to digress\/to stray from the subject"],"pinyin":["li2 ti2"],"word":"離題"},{"definition":["stream of consciousness (in literature)"],"pinyin":["yi4 shi2 liu2"],"word":"意識流"},{"definition":["lit. draw legs on a snake (idiom); fig. to ruin the effect by adding sth superfluous\/to overdo it"],"pinyin":["hua4 she2 tian1 zu2"],"word":"畫蛇添足"},{"definition":["to disdain as beneath contempt (idiom)"],"pinyin":["bu4 xie4 yi1 gu4"],"word":"不屑一顧"},{"definition":["tone sandhi\/modified tone\/(music) to change key\/modulation"],"pinyin":["bian4 diao4"],"word":"變調"},{"definition":["plain\/clear\/obvious"],"pinyin":["qian3 xian3"],"word":"淺顯"},{"definition":["theatrical"],"pinyin":["xi4 ju4 hua4"],"word":"戲劇化"},{"definition":["to provide food for thought (idiom)\/thought-provoking"],"pinyin":["fa1 ren2 shen1 xing3"],"word":"發人深省"},{"definition":["pretension\/affectation\/putting on artificial airs"],"pinyin":["jiao3 rou2 zao4 zuo4"],"word":"矯揉造作"},{"definition":["to force someone to do something"],"pinyin":["qiang3 ren2 suo3 nan2"],"word":"強人所難"},{"definition":["(idiom) (of a good outcome) unanticipated\/serendipitous\/fortuitous"],"pinyin":["wu2 xin1 cha1 liu3"],"word":"無心插柳"},{"definition":["interlude\/to cross the stage\/to do sth as a mere formality\/to go through the motions"],"pinyin":["guo4 chang3"],"word":"過場"},{"definition":["mythological story\/myth"],"pinyin":["shen2 hua4 gu4 shi5"],"word":"神話故事"},{"definition":["abstruse\/complicated"],"pinyin":["jian1 shen1"],"word":"艱深"},{"definition":["to be cynical\/to be embittered"],"pinyin":["fen4 shi4 ji2 su2"],"word":"憤世嫉俗"},{"definition":["to talk about this and that (idiom); to ramble incoherently"],"pinyin":["dong1 la1 xi1 che3"],"word":"東拉西扯"}]}