{"definition":["dentin\/dentine"],"pinyin":["ya2 ben3 zhi4"],"simplified":["牙本质"],"rank":58319.0,"normalized_rank":0.8159584738292782,"fraction":5.342781143146717e-8,"cumulative_fraction":0.9997352218390008,"word":"牙本質","characters":[{"definition":["tooth\/ivory\/CL:顆|颗[ke1]"],"pinyin":["ya2"],"word":"牙"},{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"},{"definition":["character\/nature\/quality\/plain\/to pawn\/pledge\/hostage\/to question\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"質"}],"containing_words":[],"sentences":[{"english":"The decay reaches into the dentin, where it can spread and undermine the enamel.","chinese":"當齲壞擴散破壞到釉質下方，就進入了牙本質。"},{"english":"Conclusion It is effective that fluoride iontophoresis treats dentin hypersensitivity.","chinese":"結論氟離子導入法治療牙本質過敏症是有效的。"},{"english":"Objective To know the mechanisms of treating dentine hypersensitivity by NS Paint.","chinese":"目的探討NS牙面塗料對牙本質過敏症的治療機制。"},{"english":"Blot the canal dry with a large paper point, leaving the dentin visibly moist.","chinese":"使用粗紙尖吸乾根管水分，牙本質保留明顯的溼潤。"},{"english":"Objective To investigate the effect of a new desensitizer on the treatment of dentinal hypersensitivity.","chinese":"目的研究新型牙本質脫敏劑極固寧的作用機制。"},{"english":"Conclusion Fluoride iontophoresis can effectively occlude the dentine tubules.","chinese":"結論氟離子導入對於牙本質小管有一定封閉作用。"},{"english":"PAX9 is involved in the biomineralization process of the dentine and enamel.","chinese":"PAX9參與牙本質和釉質的生物礦化過程。"},{"english":"Objective To study the effects of nano-hydroxyapatite on the remineralization of decalcified dentin.","chinese":"目的研究納米羥基磷灰石對軟化牙本質再礦化的效果。"}],"related":[]}