{"definition":["physical property"],"pinyin":["wu4 li3 xing4 zhi4"],"simplified":["物理性质"],"rank":54079.0,"normalized_rank":0.7566353727981195,"fraction":9.12360167887076e-8,"cumulative_fraction":0.9994338897124142,"word":"物理性質","characters":[{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"},{"definition":["character\/nature\/quality\/plain\/to pawn\/pledge\/hostage\/to question\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"質"}],"containing_words":[],"sentences":[{"english":"Plutarch also recorded a number of physical characteristics about the pneuma.","chinese":"普魯塔克還記錄了靈氣的一些物理性質。"},{"english":"Would that then make consciousness a physical property?","chinese":"到那時是否意識會具有物理性質呢？"},{"english":"Because its unique photophysical property, and arise our interest to this research.","chinese":"因爲其特殊的光物理性質，引起我們對它研究的興趣。"},{"english":"And we are studying the properties of small, hot things.","chinese":"我們現在正是在研究小且熱的東西所具有的物理性質。"},{"english":"Furthermore, the degreasing ability of the HFEs was tested.","chinese":"測定了三種氟醚的物理性質及其去油能力。"},{"english":"Thermal conductivity is one of the most important parameters of thermophysical properties of materials.","chinese":"導熱係數是材料熱物理性質的重要參數之一。"},{"english":"The Pacific Rower makes ingenious use of the unique physical properties of water.","chinese":"太平洋賽艇使得巧妙利用獨特的物理性質的水。"},{"english":"Physical and rheological properties of extrudates were finally improved effectivly.","chinese":"所得擠出物的物理性質及其流變特性均有明顯改善。"},{"english":"The photophysical properties of the dyes in different solvents and solid matrices are researched.","chinese":"研究了它們在溶液和固體基質中的光物理性質。"},{"english":"This high-gloss, medium-impact grade offers a good balance of physical properties.","chinese":"這種高光澤，中衝級物理性質提供了很好的平衡。"},{"english":"In addition, the research advance on the physical character of foxtail millet is introduced.","chinese":"同時，對小米物理性質方面的研究進展也做了介紹。"}],"related":[]}