{"definition":["to look for\/to seek\/to choose\/color of object\/color of fleece (of domestic animal)\/to see\/to notice\/all kinds of things\/odds and ends"],"pinyin":["wu4 se4"],"simplified":["物色"],"rank":18048.0,"normalized_rank":0.2525149357099884,"fraction":0.0000029253916423131205,"cumulative_fraction":0.9696628500277422,"word":"物色","characters":[{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"},{"definition":["color\/CL:種|种[zhong3]\/look\/appearance\/sex","color\/dice"],"pinyin":["se4","shai3"],"word":"色"}],"containing_words":[],"sentences":[{"english":"They are marching off to gyms and discovering face cream in record numbers.","chinese":"他們向健身房進軍，物色到的面霜數目已創歷史新高。"},{"english":"The new premier is forming his government mainly from young men.","chinese":"這位新總理主要從年輕人中物色人選組建政府。"},{"english":"I'll try my best to rout out a good goalkeeper for our football team.","chinese":"我願盡力爲我們的足球隊物色一位優秀的守門員。"},{"english":"We have lined up a speaker for the meeting.","chinese":"我們已經爲這個會物色到一個發言人。"},{"english":"The company is casting its net wide in its search for a new sales director.","chinese":"公司撒開大網到處物色新的銷售主任。"},{"english":"So I began to look for a husband.","chinese":"因此我開始物色一個丈夫。"},{"english":"American military leaders began looking for someone to lead the attack.","chinese":"軍方領導人開始物色合適人選。"},{"english":"They are beating the bushes for qualified persons in this field.","chinese":"他們正在四處物色這方面的人才。"},{"english":"We is offering a general agent for our textile in singapore.","chinese":"我公司欲在新加坡物色一名紡織品總代理。"},{"english":"I have lighted upon the book I wanted.","chinese":"我已物色到我所需要的那本書了。"},{"english":"They are hunting up the most promising candidates for the position.","chinese":"他們正在極力物色最適於這個職位的人選。"},{"english":"Eg. The company is casting its net wide in its search for a new sales director.","chinese":"公司撒開大網到處物色新的銷售主任。"},{"english":"I will try and root out some good players for the basketball team.","chinese":"我將設法給籃球隊物色幾個優秀的選手。"},{"english":"The personnel manager has been casting about for somebody who can act as receptionist.","chinese":"人事部經理一直在到處物色接待員的人選。"},{"english":"A: I'm looking for a sleeveless blouse for my girlfriend.","chinese":"我正在爲我女朋友物色一條無袖短衫。"},{"english":"The proposal came at a crucial time for Geithner, who has struggled to fill positions in his team.","chinese":"蓋特納一直在竭力爲他團隊中的空缺職位物色人選。"}],"related":[{"definition":["choice of person\/candidate"],"pinyin":["ren2 xuan3"],"word":"人選"},{"definition":["to act as go-between (between prospective marriage partners etc)"],"pinyin":["zuo4 mei2"],"word":"做媒"},{"definition":["to have a preference for\/to fancy\/to choose after consideration\/to settle on"],"pinyin":["kan4 zhong4"],"word":"看中"},{"definition":["to recommend sb\/to give a referral"],"pinyin":["yin3 jian4"],"word":"引薦"},{"definition":["to try to find\/to look for\/to call on sb\/to find\/to seek\/to return\/to give change"],"pinyin":["zhao3"],"word":"找"},{"definition":["to introduce (sb)\/(esp.) to present to the emperor"],"pinyin":["yin3 jian4"],"word":"引見"},{"definition":["to find to one's taste\/to pick (after looking at)\/Taiwan pr. [xiang4 zhong4]"],"pinyin":["xiang1 zhong4"],"word":"相中"},{"definition":["Mao Sui recommends himself (idiom); to offer one's services (in the style of Mao Sui offering his services to king of Chu 楚 of the Warring states)"],"pinyin":["Mao2 Sui4 zi4 jian4"],"word":"毛遂自薦"},{"definition":["to pull strings\/to manipulate (a puppet)\/to control from behind the scene\/to mediate"],"pinyin":["qian1 xian4"],"word":"牽線"},{"definition":["to act as a matchmaker"],"pinyin":["shuo1 mei2"],"word":"說媒"},{"definition":["ideal husband\/\"Mr. Right\""],"pinyin":["ru2 yi4 lang2 jun1"],"word":"如意郎君"},{"definition":["to put forward plans and ideas (also derogatory)\/to give advice (idiom)"],"pinyin":["chu1 mou2 hua4 ce4"],"word":"出謀劃策"},{"definition":["to bribe\/to get (luggage) ready\/to put in order\/to organize things\/(baseball) RBI (run batted in)"],"pinyin":["da3 dian5"],"word":"打點"},{"definition":["to sound out opinions\/to get sb's views by polite or indirect questioning"],"pinyin":["tan4 kou3 feng1"],"word":"探口風"},{"definition":["to discuss a matter with sb\/to get in touch with\/to arrange"],"pinyin":["jie1 qia4"],"word":"接洽"},{"definition":["ideal son-in-law"],"pinyin":["cheng2 long2 kuai4 xu4"],"word":"乘龍快婿"}]}