{"definition":["objective (optics)"],"pinyin":["wu4 jing4"],"simplified":["物镜"],"rank":61210.0,"normalized_rank":0.8564073146502875,"fraction":3.415876468569213e-8,"cumulative_fraction":0.999860703623142,"word":"物鏡","characters":[{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"},{"definition":["mirror\/lens"],"pinyin":["jing4"],"word":"鏡"}],"containing_words":[],"sentences":[{"english":"The design of a new kind of UV or DUV lithography lenses is described in this paper.","chinese":"設計了一種新的紫外或深紫外光刻物鏡。"},{"english":"This is illustrated in Figure 3 using three different magnifications .","chinese":"圖所示爲三種不同倍率的物鏡下的圖形。"},{"english":"Hence the value of high numerical aperture for such specimens.","chinese":"因此對這標本需採用大數值孔徑的物鏡。"},{"english":"Optical design of apochromatic objective used wave disparity method in this paper.","chinese":"採用波差法進行復消色物鏡的光學設計。"},{"english":"Measuring results of two microscope objectives were also given .","chinese":"並給出了對兩個顯微物鏡測量的結果。"},{"english":"Furthermore, the larger the numerical aperture of the objective, the less the effect of the slant angle on the line image shape.","chinese":"物鏡的數值孔徑越大，傾角對線結構成像的影響越小。"},{"english":"We consider that the digital image acquired by 20x object lens is suitable to be the virtual slide.","chinese":"認爲20倍物鏡採集的數碼圖像比較適合作虛擬切片。"},{"english":"The focusing characteristics of Gaussian beam through the List microscope objective is analyzed.","chinese":"本文分析了高斯光束經里斯特顯微物鏡的聚焦特性。"},{"english":"This objective produces only very little scattered light.","chinese":"此物鏡僅產生很小的散射光。"},{"english":"The circularly polarized light is then focused down onto the disk.","chinese":"圓偏振光經物鏡聚焦後射到光盤上。"},{"english":"Finally the design of a refracting-reflecting objective with long focal length is represented.","chinese":"最後，介紹了折反射式長焦距物鏡的設計。"},{"english":"Objective lens, optical pickup device, recorder and reproducer.","chinese":"物鏡，光學拾取器，記錄器和重現設備。"},{"english":"Type D also owns objective magnification and indenter automatic switching devices.","chinese":"型還擁有測量物鏡與壓頭自動切換裝置。"}],"related":[]}