{"definition":["Trinidad and Tobago"],"pinyin":["Te4 li4 ni2 da2 he2 Duo1 ba1 ge1"],"simplified":["特立尼达和多巴哥"],"rank":26757.0,"normalized_rank":0.3743651448798847,"fraction":0.0000012629984276094372,"cumulative_fraction":0.986695457489506,"word":"特立尼達和多巴哥","characters":[{"definition":["special\/unique\/distinguished\/especially\/unusual\/very\/abbr. for 特克斯[te4 ke4 si1], tex"],"pinyin":["te4"],"word":"特"},{"definition":["surname Li","to stand\/to set up\/to establish\/to lay down\/to draw up\/at once\/immediately"],"pinyin":["Li4","li4"],"word":"立"},{"definition":["Buddhist nun\/(often used in phonetic spellings)"],"pinyin":["ni2"],"word":"尼"},{"definition":["surname Da","to attain\/to reach\/to amount to\/to communicate\/eminent"],"pinyin":["Da2","da2"],"word":"達"},{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["many\/much\/often\/a lot of\/numerous\/more\/in excess\/how (to what extent)\/multi-\/Taiwan pr. [duo2] when it means \"how\""],"pinyin":["duo1"],"word":"多"},{"definition":["Ba state during Zhou dynasty (in east of modern Sichuan)\/abbr. for east Sichuan or Chongqing\/surname Ba\/abbr. for Palestine or Palestinian\/abbr. for Pakistan","to long for\/to wish\/to cling to\/to stick to\/sth that sticks\/close to\/next to\/spread open\/informal abbr. for bus 巴士[ba1 shi4]\/bar (unit of pressure)\/nominalizing suffix on certain nouns, such as 尾巴[wei3 ba5], tail"],"pinyin":["Ba1","ba1"],"word":"巴"},{"definition":["elder brother"],"pinyin":["ge1"],"word":"哥"}],"containing_words":[],"sentences":[{"english":"The Honorable Kamla Persad-Bissessar, Prime Minister of Trinidad and Tobago, attended the ceremony and made the opening remarks.","chinese":"特立尼達和多巴哥總理比塞薩爾到會並發表主旨講話。"},{"english":"May the Republic of Trinidad and Tobago enjoy social harmony and the people live in peace and prosperity.","chinese":"祝特立尼達和多巴哥共和國社會和諧，人民安康。"}],"related":[]}