{"definition":["to involve\/to drag in"],"pinyin":["qian1 she4 dao4"],"simplified":["牵涉到"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"牽涉到","characters":[{"definition":["to lead along\/to pull (an animal on a tether)\/(bound form) to involve\/to draw in"],"pinyin":["qian1"],"word":"牽"},{"definition":["to wade\/to be involved\/to concern\/to experience\/to enter (classical)"],"pinyin":["she4"],"word":"涉"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"}],"containing_words":[],"sentences":[{"english":"We can never be frightened when our principles are concerned.","chinese":"牽涉到我們的原則時，我們是永遠也嚇不倒的。"},{"english":"Some are programs that involve doctors.","chinese":"一些訓練程式牽涉到醫生。"},{"english":"The human element was Admiral Halsey's frame of mind.","chinese":"人事因素，牽涉到海爾賽將軍的想法。"},{"english":"Individuation involves the growth of a unique human being through a deepening of awareness.","chinese":"個體化牽涉到獨特的人的成長，透過知覺的深化。"},{"english":"All these problems have to do with our policies relating to the exercise of regional national autonomy.","chinese":"這一系列問題，牽涉到實行民族區域自治的政策。"},{"english":"If the investigation turns up hidden corruption, we will also deal with this according to the law and there will not be any soft-pedaling.","chinese":"如果牽涉到腐敗，我們一定會依法處理，絕不手軟。"},{"english":"Denial is the default position when it comes to nuclear waste.","chinese":"牽涉到核廢料時，拒絕面對是默認立場。"},{"english":"There really are different brain mechanisms involved.","chinese":"庫尼奧斯博士說，“這牽涉到不同的腦部運行機制。”"},{"english":"Homoserine has also been implicated in the biosynthesis of methionine.","chinese":"同型絲氨酸也牽涉到蛋氨酸的生物合成。"},{"english":"The readout step also involves measuring anyon states.","chinese":"讀取的步驟也牽涉到如何測量任意子的狀態。"},{"english":"Meanwhile, orexins have also been implicated in regulating appetite and feelings of reward.","chinese":"同時，食慾素也牽涉到食慾和感官情感回報的調節。"},{"english":"A person who is seated instead of standing erect--destinies hang upon such a thing as that.","chinese":"一個人的一起一坐竟會牽涉到許多人的命運。"},{"english":"This project concerns many departments.","chinese":"這項計劃牽涉到許多部門。"},{"english":"What values does this decision involve for you?","chinese":"這些決策對你來說牽涉到怎樣的觀念？"},{"english":"If I share information that implicates you, who gets to control that?","chinese":"如果我分享的信息牽涉到其他人，那麼由誰來控制呢？"},{"english":"Both genes have been implicated in alcoholdependence in previous studies.","chinese":"這兩個基因都牽涉到先前對酒精依賴症的研究。"}],"related":[]}