{"definition":["scene of the crime"],"pinyin":["fan4 zui4 xian4 chang3"],"simplified":["犯罪现场"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"犯罪現場","characters":[{"definition":["to violate\/to offend\/to assault\/criminal\/crime\/to make a mistake\/recurrence (of mistake or sth bad)"],"pinyin":["fan4"],"word":"犯"},{"definition":["guilt\/crime\/fault\/blame\/sin"],"pinyin":["zui4"],"word":"罪"},{"definition":["to appear\/present\/now\/existing\/current"],"pinyin":["xian4"],"word":"現"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"}],"containing_words":[],"sentences":[{"english":"Francis is accused of having helped him to concoct a false alibi.","chinese":"弗朗西斯因幫助他捏造不在犯罪現場的證據而被起訴。"},{"english":"She also looked good in a CSI uniform.","chinese":"她在《犯罪現場調查》裏穿制服也很好看。"},{"english":"That doesn't suppose you were absent at the scene of the crime.","chinese":"那並不能說明你不在犯罪現場。"},{"english":"Black insulating tapes are familiar evidence at criminal sites.","chinese":"黑色絕緣膠帶是犯罪現場的常見物證。"},{"english":"The witness averred that he had seen the suspect at the scene of the crime.","chinese":"證人斷言他看到嫌犯出現在犯罪現場。"},{"english":"Amy's brother was caught red-handed at the scene of the crime.","chinese":"艾米的哥哥在犯罪現場被逮了個正着。"},{"english":"The police viewed the scene of the crime.","chinese":"警方檢查了犯罪現場。"},{"english":"The police dog sniffed the crime scene for clues.","chinese":"警犬在犯罪現場聞來聞去尋找線索。"},{"english":"Just don't investigate CSI-style with a black light.","chinese":"只是不要用紫外光燈來進行犯罪現場調查。"},{"english":"The newspaper printed disturbing photos of the crime scene.","chinese":"這份報紙刊印了駭人的犯罪現場照片。"},{"english":"Leaving your own name at the crime scene was one of the stupidest things I've found.","chinese":"把你的名字留在犯罪現場是我見過最愚蠢的事情之一。"},{"english":"In this cosmic crime scene, it's all about heat and chemistry.","chinese":"在這個天體犯罪現場，熱度和化學物質是重要的證據。"},{"english":"A ballistics expert was taking evidence at the scene of the crime.","chinese":"一位彈道學家正在犯罪現場提取證據。"},{"english":"He took an oath that he had seen the defendant leaving the scene of crime.","chinese":"他賭咒曾看到過被告從犯罪現場離開。"},{"english":"Thrill-seekers descended upon  the scene of the crime.","chinese":"尋求刺激者急速接近犯罪現場。"},{"english":"The vividness of the description of crime scenes made the book a classic mystery novel.","chinese":"犯罪現場的生動描述使該書成爲經典的神祕小說。"}],"related":[{"definition":["to return something to its rightful owner"],"pinyin":["wu4 gui1 yuan2 zhu3"],"word":"物歸原主"},{"definition":["human pyramid"],"pinyin":["die2 luo2 han4"],"word":"疊羅漢"},{"definition":["lit. to settle accounts after autumn\/settle scores at an opportune moment (idiom)"],"pinyin":["qiu1 hou4 suan4 zhang4"],"word":"秋後算賬"},{"definition":["all crows are black (idiom)\/evil people are bad all over the world"],"pinyin":["tian1 xia4 wu1 ya1 yi1 ban1 hei1"],"word":"天下烏鴉一般黑"},{"definition":["(neologism c. 2013) organized disruption of healthcare facilities or verbal and physical abuse of medical staff, by an aggrieved patient or proxies such as family members or hired thugs, typically aimed at obtaining compensation"],"pinyin":["yi1 nao4"],"word":"醫鬧"},{"definition":["superficial wound\/a bruise"],"pinyin":["pi2 wai4 shang1"],"word":"皮外傷"},{"definition":["lit. to assess the head and discuss the feet (idiom); minute criticism of a woman's appearance\/fig. to find fault in minor details\/nitpicking\/overcritical"],"pinyin":["pin3 tou2 lun4 zu2"],"word":"品頭論足"},{"definition":["to whisper to one another's ear"],"pinyin":["jiao1 tou2 jie1 er3"],"word":"交頭接耳"},{"definition":["entrapment (law)"],"pinyin":["diao4 yu2 zhi2 fa3"],"word":"釣魚執法"},{"definition":["to take the blame for sb else\/to compensate for one's crime\/to get charges dropped (by paying money etc)"],"pinyin":["ding3 zui4"],"word":"頂罪"},{"definition":["please excuse me for not complying\/to politely decline"],"pinyin":["jing4 xie4 bu4 min3"],"word":"敬謝不敏"},{"definition":["emergency"],"pinyin":["jin3 ji2 shi4 jian4"],"word":"緊急事件"},{"definition":["condor\/bald eagle"],"pinyin":["tu1 ying1"],"word":"禿鷹"},{"definition":["laser pointer"],"pinyin":["ji1 guang1 bi3"],"word":"激光筆"},{"definition":["child bride\/girl adopted into a family as future daughter-in-law"],"pinyin":["tong2 yang3 xi2"],"word":"童養媳"},{"definition":["see 謾罵|谩骂[man4 ma4]"],"pinyin":["man4 ma4"],"word":"漫罵"}]}