{"definition":["to charge forward"],"pinyin":["meng3 chong1"],"simplified":["猛冲"],"rank":37410.0,"normalized_rank":0.5234144362206707,"fraction":4.88441139480025e-7,"cumulative_fraction":0.9953616359389632,"word":"猛衝","characters":[{"definition":["ferocious\/fierce\/violent\/brave\/suddenly\/abrupt\/(slang) awesome"],"pinyin":["meng3"],"word":"猛"},{"definition":["powerful\/vigorous\/pungent\/towards\/in view of","thoroughfare\/to go straight ahead\/to rush\/to clash"],"pinyin":["chong1","chong4"],"word":"衝"}],"containing_words":[],"sentences":[{"english":"Several members , refusing to accept the decision of the vote , got up and stormed out .","chinese":"幾個成員拒絕接受表決的結果，憤然而起，猛衝出去。"},{"english":"He careened through foreign territories on a desperate kind of blitz.","chinese":"在孤注一擲地閃電戰中他猛衝過外國領地。"},{"english":"The birds exploded into the air, all pipes and feathers.","chinese":"鳥羣猛衝上天，鳴叫響成一片，羽毛紛紛飄落。"},{"english":"As a cavalryman, his style was hard-driving and aggressive.","chinese":"作爲一名天生的騎兵，他的風格就是猛衝狠鬥。"},{"english":"They rushed the guard at the gate.","chinese":"他們向大門口的衛兵猛衝過去。"},{"english":"Over the heads of the bathers dashed the immense wave.","chinese":"那巨浪猛衝過來，越過那些泳者的頭頂。"},{"english":"Bicycles and motorbikes careened in front of me.","chinese":"自行車和摩托車在我面前猛衝直撞地行駛。"},{"english":"The horses dashed out of burning stable.","chinese":"馬羣猛衝出着了火的馬廄。"},{"english":"The race started. the rabbit darted almost out of sight at once.","chinese":"比賽開始了，免子猛衝出去，簡直一轉眼就不見了。"},{"english":"He dashed to smash the fashionable ashtray with cash.","chinese":"他猛衝用現金砸那個過時的菸灰盤。"},{"english":"Head flung back as if to howl, the monkey merely yawns.","chinese":"頭猛衝後背好像號叫，一隻猴子僅僅打哈欠。"},{"english":"They threw themselves at the men and tried to bite them.","chinese":"它們朝人猛衝了過去，企圖咬他們。"},{"english":"The car walloped the pavement, charging towards the Holland Tunnel .","chinese":"汽車猛衝過馬路，直奔荷蘭地道。"},{"english":"They've never sprinted headlong into a flock of seagulls to watch them flap and scatter.","chinese":"他們也不曾猛衝入海鷗羣中，看着它們振翅四散。"},{"english":"As soon as the bull saw the horses, he began to charge again.","chinese":"公牛一見到馬又開始猛衝起來。"},{"english":"Several protesters storm out in disgust, shouting insults.","chinese":"幾個抗議者厭惡地猛衝而走，還喊着侮辱人的話。"}],"related":[]}