{"definition":["alone"],"pinyin":["du2 ge4"],"simplified":["独个"],"rank":54122.0,"normalized_rank":0.7572369985868791,"fraction":9.07980839081218e-8,"cumulative_fraction":0.9994378042484556,"word":"獨個","characters":[{"definition":["alone\/independent\/single\/sole\/only"],"pinyin":["du2"],"word":"獨"},{"definition":["individual\/this\/that\/size\/classifier for people or objects in general"],"pinyin":["ge4"],"word":"個"}],"containing_words":[],"sentences":[{"english":"No one should be alone in their old age, he thought.","chinese":"誰也不該上了年紀獨個兒待着，他想。"},{"english":"Is it at all possible that he alone can drink ten bottles of beer?","chinese":"難道他真的能獨個兒飲十瓶啤酒嗎？"},{"english":"Individual mountain gorillas have never been re-introduced to the wild successfully.","chinese":"獨個的山地大猩猩從來不能再度在野外成功存活。"},{"english":"I hate to see you standing about by youself in this stupid manner.","chinese":"我可不願意看到你獨個兒這麼傻里傻氣的站在這。"},{"english":"If you travel alone in that forest, you may run into danger.","chinese":"如果你獨個兒在那片森林裏行走，你會遇到危險的。"},{"english":"There was no room for details that were to be viewed as individual elements.","chinese":"細節不應被視作獨個的元素。"},{"english":"In his present frame of mind he shouldn't be left alone.","chinese":"在他目前的這種心情下，不該讓他獨個兒留着。"},{"english":"He immediately let go of his hands and sleep in bed singly.","chinese":"他立刻放開手，獨個兒上牀睡覺。"},{"english":"I hate to see you standing about by yourself in this stupid manner.","chinese":"我不願看到你獨個兒這麼傻里傻氣地站在這兒。"},{"english":"I hate to be alone in the house, but I dare not go out alone after dark. ;","chinese":"我討厭獨個兒呆在家，但天黑後我又不敢一個人出去。"},{"english":"I love staying with friends, instead of staying alone.","chinese":"我喜歡跟朋友一起，而不喜歡獨個兒。"},{"english":"One little nigger boy living all alone…","chinese":"一個小黑人獨個兒過活。"},{"english":"I went to the Grand Canyon a couple of weeks ago ALONE.","chinese":"幾個星期前，我獨個兒去了大峽谷。"},{"english":"Of course, you might not have a whole room of your own to work in.","chinese":"當然，你可能沒有自己工作的獨個房間。"},{"english":"After he passed the exam, Mr. A was cheerfully hum-ming(songs)to himself.","chinese":"考試通過後，A先生獨個兒喜悅地自哼歌曲。"}],"related":[]}