{"definition":["exclusive"],"pinyin":["du2 jia1"],"simplified":["独家"],"rank":4161.0,"normalized_rank":0.0582177885355309,"fraction":0.000031558611196027395,"cumulative_fraction":0.8358560063509781,"word":"獨家","characters":[{"definition":["alone\/independent\/single\/sole\/only"],"pinyin":["du2"],"word":"獨"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[{"definition":["a family bereaved of its only child"],"pinyin":["shi1 du2 jia1 ting2"],"word":"失獨家庭"}],"sentences":[{"english":"He got all the big scoops for the paper.","chinese":"他爲本報弄到所有的頭號獨家新聞。"},{"english":"It's also an issue of exclusivity.","chinese":"這也是一個獨家經營權問題。"},{"english":"I propose a sole agency aGREement for bicycles for a period of 3 years.","chinese":"我建議訂專銷自行車的爲期三年的獨家代理協議。"},{"english":"InfoQ brings you an  exclusive pdf chapter excerpt from this new book.","chinese":"InfoQ爲您獨家帶來本書的章節節選。"},{"english":"If you are considering relocating to Key Largo , here is the scoop on it.","chinese":"如果您正在考慮遷移到基拉戈，這裏是它的獨家新聞。"},{"english":"Embargoes lead to more total coverage than exclusives.","chinese":"保密協議比獨家報道的覆蓋面更加廣泛。"},{"english":"Exclusive distribution of \"HIESTAND Swiss Gourmet Bakery\" leader in frozen premium good.","chinese":"的獨家經銷商，優質冷凍產品的龍頭企業。"},{"english":"The Holy Box was released the same year by Lucretia Records including exclusive acoustic tracks.","chinese":"聖盒被釋放，同年由盧克記錄包括獨家聲曲目。"},{"english":"Both of these wineries are imported and distributed exclusively by Summergate in China.","chinese":"這兩款酒均由美夏公司在中國獨家進口經銷。"},{"english":"We are very interested in an exclusive arrangement with your factoryfor the promotion of your products in Bahrain.","chinese":"盼望能成爲貴公司獨家代理，促銷在巴林市場的貨品。"},{"english":"You can get pre-releases, plus unique exclusive tracks and remixes.","chinese":"你可以預先發布，加上獨家收錄的歌曲和混音。"},{"english":"We should be interested in acting as your sole agent.","chinese":"我們很苦願問應做貴公司的獨家代庖代理人。"},{"english":"See ShangQian struggle, zhuo or will inform ShangQian exclusive news.","chinese":"看見尚謙的拼搏行徑，卓或便將獨家消息告知尚謙。"},{"english":"It is learned that Tianjin has more than 30 air exclusive implementation of the route .","chinese":"據瞭解，目前天津航空擁有30餘條獨家執行的航線。"},{"english":"Everyone was surprised by the Times exclusive about the prince' marriage.","chinese":"泰晤士報關於王子大婚的獨家新聞令很多人驚奇不已。"},{"english":"Set up a market observer, protect agent's exclusive interests strictly .","chinese":"設立市場監測員，嚴格保護代理商獨家利益。"}],"related":[{"definition":["to belong or be dedicated exclusively to\/proprietary\/private\/personal"],"pinyin":["zhuan1 shu3"],"word":"專屬"},{"definition":["carefully chosen\/handpicked\/best of the bunch\/choice (product)\/concentration (mining)\/to concentrate\/to winnow"],"pinyin":["jing1 xuan3"],"word":"精選"},{"definition":["Internet","network (computing, telecommunications, transport etc)"],"pinyin":["Wang3 luo4","wang3 luo4"],"word":"網絡"},{"definition":["online"],"pinyin":["xian4 shang4"],"word":"線上"},{"definition":["unique and unmatched (idiom); unrivalled\/nothing compares with it"],"pinyin":["du2 yi1 wu2 er4"],"word":"獨一無二"},{"definition":["free (of charge)"],"pinyin":["mian3 fei4"],"word":"免費"},{"definition":["entity\/substance\/thing that has a material existence (as opposed to a conceptual, virtual or online existence)\/the real thing (as opposed to an image or model of it)"],"pinyin":["shi2 ti3"],"word":"實體"},{"definition":["information\/news\/message\/text message or SMS"],"pinyin":["xun4 xi1"],"word":"訊息"},{"definition":["to assemble\/to concentrate\/to mass\/to build up\/to marshal"],"pinyin":["ji2 jie2"],"word":"集結"},{"definition":["digital"],"pinyin":["shu4 wei4"],"word":"數位"},{"definition":["top-notch\/first-rate"],"pinyin":["ding3 ji2"],"word":"頂級"},{"definition":["team"],"pinyin":["tuan2 dui4"],"word":"團隊"},{"definition":["network (computer, telecom)\/Internet\/Taiwanese term for 網絡|网络[wang3 luo4]"],"pinyin":["wang3 lu4"],"word":"網路"},{"definition":["brand new"],"pinyin":["zhan3 xin1"],"word":"嶄新"},{"definition":["on the eve of\/to be about to\/to be on the verge of"],"pinyin":["ji2 jiang1"],"word":"即將"},{"definition":["unique\/distinct\/having special characteristics"],"pinyin":["du2 te4"],"word":"獨特"}]}