{"definition":["only (child)\/to be the sole survivor"],"pinyin":["du2 sheng1"],"simplified":["独生"],"rank":30539.0,"normalized_rank":0.4272802316958851,"fraction":8.980543604546067e-7,"cumulative_fraction":0.9907380668563868,"word":"獨生","characters":[{"definition":["alone\/independent\/single\/sole\/only"],"pinyin":["du2"],"word":"獨"},{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"}],"containing_words":[{"definition":["an only child"],"pinyin":["du2 sheng1 zi3 nu:3"],"word":"獨生子女"},{"definition":["an only daughter"],"pinyin":["du2 sheng1 nu:3"],"word":"獨生女"},{"definition":["only son"],"pinyin":["du2 sheng1 zi3"],"word":"獨生子"},{"definition":["one-child policy"],"pinyin":["du2 sheng1 zi3 nu:3 zheng4 ce4"],"word":"獨生子女政策"}],"sentences":[{"english":"China is implementing a family planning policy. So I'm the only child in my family.","chinese":"中國正在實施計劃生育政策，所以我是家中的獨生子。"},{"english":"Objective To probe into the psychological state of criminal adolescences from the single child families.","chinese":"目的探討獨生子犯罪者心理狀況。"},{"english":"If they firmly believe one-child policy, there will be more and more the dink.","chinese":"如果他們堅信獨生子女政策，將會有越來越多的丁克。"},{"english":"China has single-child policy.","chinese":"中國實行獨生子女政策。"},{"english":"Objective To investigate mental health status of only-child nurses.","chinese":"目的瞭解獨生子女護士的心理健康狀況。"},{"english":"John lavishes care on his only son.","chinese":"約翰對他的獨生兒子過分溺愛。"},{"english":"\"Only children often grow up to be self-centred, \" she was quoted as saying.","chinese":"她認爲獨生子女容易以自我爲中心。"},{"english":"The incidence of injury was closely related to parental culture background and being only-child or not.","chinese":"傷害發生率與父母文化程度及是否獨生子女密切相關。"},{"english":"She was the only daughter and the youngest child of five.","chinese":"她是家裏的獨生女，也是五個孩子中最小的。"},{"english":"How to bring up the only child triggered many debates in China.","chinese":"怎樣培養好獨生子女在中國引發了許多辯論。"},{"english":"The first generation born under the one-child policy has reached the age of childbearing.","chinese":"中國的第一代獨生子女已經到了婚育年齡。"},{"english":"The first generation under-child policy has reached the age of childbearing.","chinese":"中國的第一代獨生子女已經到了婚育年齡。"},{"english":"Despite the fact that she is the only child in her family, she is never babied by her parents.","chinese":"儘管她是家裏的獨生女，她父母也從不溺愛她。"},{"english":"The only child acceded to the family estate.","chinese":"這個獨生子繼承了家產。"},{"english":"Here is another story. There was a rich man who was selecting a husband for his only child among a multitude of pursuers.","chinese":"有則故事說，一個富人爲獨生女兒選婿，求婚者衆多。"},{"english":"The only daughter took as heir.","chinese":"這個獨生女繼承了遺產。"}],"related":[]}