{"definition":["acquired (i.e. not inborn)"],"pinyin":["huo4 de2 xing4"],"simplified":["获得性"],"rank":44166.0,"normalized_rank":0.6179396415429603,"fraction":2.5867235479934376e-7,"cumulative_fraction":0.9978124222012736,"word":"獲得性","characters":[{"definition":["to catch\/to obtain\/to capture"],"pinyin":["huo4"],"word":"獲"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"AIDS is an acronym for\"Acquired Immune Deficiency Syndrome.\"","chinese":"艾滋病的全稱是“獲得性免疫缺損綜合徵”。"},{"english":"Methods: The data of 52 COPD cases iatrogenic pneumonia were analyzed.","chinese":"方法對52例醫院獲得性念珠菌肺炎病人進行分析。"},{"english":"Acinetobacter has become a major pathogen for nosocomial infection.","chinese":"不動桿菌是醫院獲得性感染的主要致病菌之一。"},{"english":"Vaccinations work by activating the host's adaptive immunity in advance of infection.","chinese":"接種疫苗的機理是在感染之前激活宿主獲得性免疫。"},{"english":"For the poor, access and affordability are usually one and the same.","chinese":"就窮人而言，獲得性和可承受力通常屬於同一問題。"},{"english":"Most of the children had acquired the pneumococcal infection while in hospital.","chinese":"大多數兒童在醫院獲得性感染了肺炎鏈球菌。"},{"english":"Objective To evaluate the serum histamine-releasing activity of patients with primary acquired cold urticaria (PACU).","chinese":"目的探討原發性獲得性寒冷性蕁麻疹的組胺釋放活性。"},{"english":"In terms of improving access to medicines, price and quality go hand in hand.","chinese":"在改進藥品的獲得性方面，價格和質量齊頭並進。"},{"english":"Acquired genetic abnormalities account for 85% to 90% of breast cancers.","chinese":"獲得性基因異常佔乳癌的85%至90%。"}],"related":[]}