{"definition":["to obtain permission"],"pinyin":["huo4 zhun3"],"simplified":["获准"],"rank":9554.0,"normalized_rank":0.13367285548388902,"fraction":0.000008913831829070164,"cumulative_fraction":0.9258767558925952,"word":"獲准","characters":[{"definition":["to catch\/to obtain\/to capture"],"pinyin":["huo4"],"word":"獲"},{"definition":["to allow\/to grant\/in accordance with\/in the light of"],"pinyin":["zhun3"],"word":"准"}],"containing_words":[],"sentences":[{"english":"He applied for a scholarship and won it at last.","chinese":"他申請了獎學金並終於獲准。"},{"english":"You can also use National Instruments data acquisition hardware to control strobe lights.","chinese":"你也可以使用國家儀器數據獲准硬件控制頻閃燈。"},{"english":"The \"Admission Notice\" will be sent to the admitted applicants two weeks before registration.","chinese":"申請獲准入學者將在開學註冊前二週通知。"},{"english":"Mr. Yim said he hopes the Japanese government will allow the film to be shown there.","chinese":"嚴浩表示希望影片能獲准在日本放映。"},{"english":"Second Xiangya Hospital AIDS Research allowed to participate in the above-mentioned two specific research.","chinese":"湘雅二醫院艾滋病研究室獲准參加上述兩項專項研究。"},{"english":"By this time, even females were allowed to serve as stormtroopers.","chinese":"在這個時期，女性也正式獲准參加衝鋒隊。"},{"english":"Longfellow was granted leave of absence in order for him to visit Germany \"for the benefit of his health\".","chinese":"“爲了有益於健康”，朗費羅被獲准假期去德國一遊。"},{"english":"Anyone who makes such a Peter-like confession will gain entry into the Kingdom of God.","chinese":"任何人像彼得一樣宣告，都將會獲准進入上帝的國度。"},{"english":"And when we were come to Rome, Paul was suffered to dwell by himself, with a soldier that kept him.","chinese":"我們進了羅馬，保祿獲准與看守他的士兵獨居一處。"},{"english":"The criminal was granted bail .","chinese":"犯人獲准交保釋放。"},{"english":"This was the first permitted use of the Olympic logo in a non-Olympic festival.","chinese":"這是第一次獲准允許在非奧運會期間使用奧運會標誌。"},{"english":"Her request has been acquiesced in.","chinese":"她的請求已獲准了。"},{"english":"She is here on sufferance.","chinese":"她勉強獲准留在這裏。"},{"english":"He has been matriculated in the university.","chinese":"他已經獲准上大學。"},{"english":"To attend her father's funeral.","chinese":"她獲准喪假爲父親送葬。"},{"english":"The medicine is already approved to fight narcolepsy and sleepiness related to shift work.","chinese":"此藥已經獲准用於治療因倒班產生的嗜睡和瞌睡症狀。"}],"related":[]}