{"definition":["recipient"],"pinyin":["huo4 de2 zhe3"],"simplified":["获得者"],"rank":9576.0,"normalized_rank":0.13398066402697525,"fraction":0.000008877775355235267,"cumulative_fraction":0.9260724647394432,"word":"獲得者","characters":[{"definition":["to catch\/to obtain\/to capture"],"pinyin":["huo4"],"word":"獲"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"He is a national important contribution expert and is granted a Special Allowance from the State Council.","chinese":"國家級有突出貢獻專家，國務院特殊津貼獲得者。"},{"english":"Enlisted recipients of the Medal of Honor are entitled to a supplemental uniform allowance.","chinese":"榮譽勳章獲得者將有資格獲得軍人的津貼。"},{"english":"We have a great admiration for the gold medalists.","chinese":"我們對金牌獲得者極爲敬佩。"},{"english":"Are there any Nobel Prize winners at Princeton?","chinese":"普林斯頓大學有沒有培養出諾貝爾獎獲得者呢？"},{"english":"The Nobel Prize winner contributed much to the research in this field.","chinese":"這位諾貝爾獲得者爲這一領域的研究做出了很大貢獻。"},{"english":"This means accepting it as presented by its favored class, by those who profited most from it .","chinese":"這意味着它是按最高利益獲得者的視角描繪下來的。"},{"english":"In the Olympics of voting, there are no gold medalists.","chinese":"在選舉的奧林匹克競賽中，沒有金牌獲得者。"},{"english":"She is a graduate of the Air Force Academy and a Rhodes scholar.","chinese":"她畢業於美國空軍學院並是一名羅茲獎學金獲得者。"},{"english":"All medallists are requested to undergo a \"dope\" test after the final.","chinese":"決賽後，要對所有獎牌獲得者作興奮劑檢查。"},{"english":"And warmly welcome( ) to give awards to our winners.","chinese":"歡迎三等獎獲得者上臺。"},{"english":"Sun Honglei is awarded with the \"Best Performance Art\" and the \"Most Popular Actor\".","chinese":"最佳表演藝術獎最具人氣演員獎獲得者孫紅雷。"},{"english":"This one belonged to Nobel Prize-winning author Ernest Hemingway.","chinese":"這一項發明屬於諾貝爾獲得者，作家海明威。"},{"english":"The Oscar-winning scribe was charged with vehicular manslaughter.","chinese":"這位奧斯卡最佳編劇獎獲得者被控過失殺人。"},{"english":"And now Obama is the Nobel Peace Prize winner.","chinese":"現在，奧巴馬是諾貝爾和平獎獲得者了。"},{"english":"Seven time World Champion retires.","chinese":"這位七次世界冠軍獲得者退役。"},{"english":"We should be proud of our Nobel Prize winners.","chinese":"我們應該爲我們的諾貝爾獎獲得者感到自豪。"}],"related":[]}