{"definition":["to learn of sth\/to find out\/to get news"],"pinyin":["huo4 xi1"],"simplified":["获悉"],"rank":1227.0,"normalized_rank":0.017167321925762175,"fraction":0.0001324281295142345,"cumulative_fraction":0.6528244216986859,"word":"獲悉","characters":[{"definition":["to catch\/to obtain\/to capture"],"pinyin":["huo4"],"word":"獲"},{"definition":["in all cases\/know"],"pinyin":["xi1"],"word":"悉"}],"containing_words":[],"sentences":[{"english":"This is the news yesterday from the Provincial Quality Supervision Bureau.","chinese":"這是記者昨日從省質監局獲悉的。"},{"english":"It will also help inform and shape public policy in this field.","chinese":"這也會幫助獲悉和形成在這一領域的公共政策。"},{"english":"Shortly afterwards admiral harwood learnt that the ship was weighing anchor.","chinese":"嗣後不久，哈伍德海軍上將獲悉“施佩”號在起錨了。"},{"english":"We note that you want additional samples of 5 yards per color way to be dispatched by air.","chinese":"獲悉貴方另要求航寄色位各5碼樣品，這是可以的。"},{"english":"Two weeks later, I learned, she went with a man to his flat.","chinese":"兩個星期後，我獲悉她跟一個男人回到了他的公寓。"},{"english":"This figure includes data for the current year and the one or two preceding years, where available.","chinese":"該數據包括本年及之前一或兩年所能獲悉的數據。"},{"english":"We learned the matter from an American paper.","chinese":"我們從一家美國報紙上獲悉此事。"},{"english":"It was spine-chilling to learn that a murderer was in our neighborhood.","chinese":"獲悉殺人兇手就在我們附近，讓人不寒而慄。"},{"english":"Yang Fengmao learns and gold deep water Lin Ying baby be vivisection experiments, very worried.","chinese":"楊豐懋和金深水獲悉林嬰嬰被做活體實驗，萬分着急。"},{"english":"You have to be able to capture the interest of your readers and hold it from the beginning of your article to the end.","chinese":"你要能夠獲悉讀者的興趣，並投其所好貫穿文章始末。"},{"english":"I'm so glad to hear of your scholarship to Nelson .","chinese":"十分高興獲悉你得到了尼爾遜獎學金。"},{"english":"YangGuang learn news emergency to leave things to the father emperor.","chinese":"楊廣獲悉消息後緊急把事情告訴給了父皇。"},{"english":"We're told the two had in-depth discussions about the crisis.","chinese":"我們獲悉他們就當前的危機展開了深入的討論。"},{"english":"We note that you want additional samples of 5 yards per colour way to be dispatched by air.","chinese":"獲悉貴方另要求航寄色位各5碼樣品，這是可以的。"},{"english":"And what about sensitive data meant only for a single individual or organization?","chinese":"如果某些敏感數據只能由單一個體或組織獲悉怎麼辦？"},{"english":"Li Jun learned after mixed feelings, no blame li play glass was missing.","chinese":"李君獲悉之後百感交集，沒有再責怪黎璃當年玩失蹤。"}],"related":[]}