{"definition":["to offer\/to give (as tribute)\/to devote (one's life)\/to sacrifice (oneself)"],"pinyin":["xian4 chu1"],"simplified":["献出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"獻出","characters":[{"definition":["to offer\/to present\/to dedicate\/to donate\/to show\/to put on display\/worthy person (old)"],"pinyin":["xian4"],"word":"獻"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"Entirely devoted to the Party, the young soldier gave his life for his country.","chinese":"對黨無限忠誠，這位年輕的士兵爲祖國獻出了生命。"},{"english":"Those behave fawningly to rich one have no money received and that means they offer their soul, their dignity for nothing.","chinese":"奉承的人沒有錢收而獻出他們的靈魂他們的尊嚴。"},{"english":"Under the Mistletoes, let's give out our sweet kisses.","chinese":"在聖誕花環下，讓我們獻出甜吻。"},{"english":"Am I continually separating myself to consider God every day of my life?","chinese":"我是否每天不斷地獻出自己，只以神爲念？"},{"english":"I encourage you to join the list and contribute your thoughts to the project.","chinese":"我鼓勵您加入這個列表，並獻出您對這個項目的想法。"},{"english":"The wood of the river and black Chuans all for exploring clear this malert: but dedicating own life.","chinese":"江木和黑川都是爲了探明這件事而獻出了自己的生命。"},{"english":"Without hesitation, the elephant king offered what was left of his tusks.","chinese":"象王沒有絲毫猶豫就獻出了自己餘下的象牙。"},{"english":"Napoleon bragged that he could train men to sacrifice their lives for a scrap of ribbon.","chinese":"拿破崙吹噓道他可以訓練人們爲了塊破布而獻出生命。"},{"english":"I dedicate today to minimalist health.","chinese":"我獻出今天來達到簡易健康。"},{"english":"After I donate my blood, will the organization sell it?","chinese":"我獻出的血液，採供血機構會不會拿去賣掉呢？"},{"english":"I hope you will dedicate this day too.","chinese":"我希望你也會獻出這一天。"},{"english":"Do you still remember those who lost their lives for the country?","chinese":"你還記得住那些爲國家獻出生命的人嗎？"},{"english":"People may even be willing to die for their pets.","chinese":"甚至有人願意爲寵物獻出自己的生命。"},{"english":"As spring gave the lifetime loyalty.","chinese":"就象那春蠶獻出一生的忠誠。"},{"english":"This flower-girl now offered her blossom to the soul.","chinese":"這個獻花女現在只向靈魂獻出她的花朵了。"},{"english":"Numerous Russian young people sacrificed their lives for the victory of the Anti-Japanese War in China.","chinese":"許多俄羅斯青年爲了中國抗日戰爭的勝利獻出了生命。"}],"related":[]}