{"definition":["deceitful trick\/mystery\/unfathomable"],"pinyin":["xuan2 xu1"],"simplified":["玄虚"],"rank":52709.0,"normalized_rank":0.7374672953422969,"fraction":1.0743953337038207e-7,"cumulative_fraction":0.9992982007346736,"word":"玄虛","characters":[{"definition":["black\/mysterious"],"pinyin":["xuan2"],"word":"玄"},{"definition":["emptiness\/void\/abstract theory or guiding principles\/empty or unoccupied\/diffident or timid\/false\/humble or modest\/(of health) weak\/virtual\/in vain"],"pinyin":["xu1"],"word":"虛"}],"containing_words":[{"definition":["deliberately mystifying\/to make sth unnecessarily complicated"],"pinyin":["gu4 nong4 xuan2 xu1"],"word":"故弄玄虛"}],"sentences":[{"english":"They asked these questions very sincerely, never talked about anything metaphysically.","chinese":"向得極其虔誠，就是不談玄虛。"},{"english":"In the opinion of some lofty experts they never quite cohered again.","chinese":"在某些玄虛的專家看來，他們沒有再完全融洽統一過。"},{"english":"It turns away from the lofty height of the spirit.","chinese":"它反對玄虛的精神高度。"},{"english":"No educated guesses' about what to do or chart reading.","chinese":"沒有故弄玄虛的猜測和圖表統計分析。"},{"english":"It will be my pleasure to share with you some of this double-talk so typical of our times.","chinese":"我很樂意摘錄幾則典型的故弄玄虛的評論，與君共享。"},{"english":"Science won't let you juggle a bit.","chinese":"科學不容許你一點玄虛。"},{"english":"However, the audience will feel that the story is too hypocritical, director mystify .","chinese":"不過，也會有觀衆覺得故事太矯情，導演故弄玄虛。"},{"english":"On some level this definition may seem like quite a lot of scientific mumbo-jumbo.","chinese":"在某種程度上，這一定義可能顯得有點故弄玄虛。"},{"english":"Passed on wide pinion through the lofty air.","chinese":"如何以廣展的翅翼飛過玄虛的高空。"},{"english":"I want to be deliberately mystifying in here neither, he does not have but courage.","chinese":"我也不想在這裏故弄玄虛，可是他沒有勇氣。"}],"related":[]}