{"definition":["to neglect one's duty\/dereliction of duty\/malpractice"],"pinyin":["wan2 hu1 zhi2 shou3"],"simplified":["玩忽职守"],"rank":18114.0,"normalized_rank":0.25343836133924696,"fraction":0.000002906414550821069,"cumulative_fraction":0.9698552869320618,"word":"玩忽職守","characters":[{"definition":["to play\/to have fun\/to trifle with\/toy\/sth used for amusement\/curio or antique (Taiwan pr. [wan4])\/to keep sth for entertainment"],"pinyin":["wan2"],"word":"玩"},{"definition":["surname Hu","to neglect\/to overlook\/to ignore\/suddenly"],"pinyin":["Hu1","hu1"],"word":"忽"},{"definition":["office\/duty"],"pinyin":["zhi2"],"word":"職"},{"definition":["to guard\/to defend\/to keep watch\/to abide by the law\/to observe (rules or ritual)\/nearby\/adjoining"],"pinyin":["shou3"],"word":"守"}],"containing_words":[],"sentences":[{"english":"Regulators dozing Homer Simpson-like at the switch?","chinese":"難道是監管者像荷馬。辛普森那樣玩忽職守？"},{"english":"causing losses to archives as a result of neglect of duty on the part of archivists.","chinese":"檔案工作人員玩忽職守，造成檔案損失的。"},{"english":"He usually is a very loyal employee but occasionally he lies down on the job.","chinese":"他通常是一位很忠實的受僱者，但偶爾也會玩忽職守。"},{"english":"The city man ager says the suits may claim negligence by the town and its employees.","chinese":"市領導稱這起訴訟可能會判該鎮及其職員玩忽職守罪。"},{"english":"He was found guilty of gross dereliction of duty.","chinese":"他被判嚴重玩忽職守。"},{"english":"The official was dismissed for neglect of his duty.","chinese":"這名官員因玩忽職守而遭開除。"},{"english":"The boss fired him out for neglect of his duty.","chinese":"老闆以玩忽職守爲由把他開除了。"},{"english":"I don't trust him, for he often neglects his duty.","chinese":"我不信任他，因爲他常常玩忽職守。"},{"english":"The head nurse was reduced to ordinary nurse due to malpractice.","chinese":"這位護士長由於玩忽職守被降職爲普通護士。"},{"english":"Oppositions MPs charged the minister with neglecting her duty.","chinese":"反對黨議員指責女部長玩忽職守。"},{"english":"We accused him of having neglected his duty.","chinese":"我們指責他玩忽職守。"},{"english":"Neglect of duty is good cause for removal of a trustee.","chinese":"玩忽職守是幹掉受委託人的最佳理由。"},{"english":"Nothing can extenuate her negligence.","chinese":"她的玩忽職守是無法掩飾的。"},{"english":"He was dismissed for neglect of his duty.","chinese":"他因玩忽職守而被解僱了。"},{"english":"The moment was too grave to admit of the sentinel abandoning his duty and his post of observation.","chinese":"哨兵要是玩忽職守，這一時刻可是太嚴重了。"},{"english":"A jury convicted the first operator of willful neglect.","chinese":"陪審團宣判此案中第一位接線員故意玩忽職守。"}],"related":[]}