{"definition":["player (of a game)\/enthusiast (audio, model planes etc)"],"pinyin":["wan2 jia1"],"simplified":["玩家"],"rank":1450.0,"normalized_rank":0.020287381248863208,"fraction":0.00011030901558160708,"cumulative_fraction":0.6798046297278196,"word":"玩家","characters":[{"definition":["to play\/to have fun\/to trifle with\/toy\/sth used for amusement\/curio or antique (Taiwan pr. [wan4])\/to keep sth for entertainment"],"pinyin":["wan2"],"word":"玩"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[],"sentences":[{"english":"I want players to enjoy the 'aha!' of solving a puzzle.","chinese":"我希望玩家能享受解決一個謎題後“啊哈”的感覺。"},{"english":"But unless you get paid to play videogames, you’re kind of not accomplishing stuff.","chinese":"但除非你是職業玩家，你什麼也沒實現。"},{"english":"There were no entrances or exits, and players could only leave by hearthing out;","chinese":"既沒有入口也沒有出口，玩家只能爐石出去。"},{"english":"Players can also fine-tune their characters' clothing, size and expressions.","chinese":"玩家也能自由調整他們角色的服飾，體型和外表。"},{"english":"The focus within the game is for the player to investigate the activity of an group of cultist.","chinese":"玩家的任務是要調查某異教的組織的活動。"},{"english":"So as to avoid the operation of the strangeness players.","chinese":"從而避免了玩家操作上的陌生感。"},{"english":"After a player's wrap-up step is over, the next player begins his or her start phase.","chinese":"收尾工作結束後，下一個玩家開始他的開始階段。"},{"english":"But its biggest achievement by far is the sense of responsibility bestowed upon players.","chinese":"本作最大的特點就是玩家決定主人公的善惡命運。"},{"english":"Player must shoot the attackers of zombi .","chinese":"玩家必須射殺那些喪屍。"},{"english":"Bladeling PCs may be any non-chaotic alignment.","chinese":"刀鋒怪玩家可以成爲任何非混亂陣營。"},{"english":"Slowing abilities and spells will no longer decrease the speed of a player when traveling by Gryphon.","chinese":"乘坐獅鷲時，減速魔法和效果不再會降低玩家的速度。"},{"english":"Isn't there a problem in one of the players owning the scorecard that everybody uses?","chinese":"一位玩家持有衆人使用的記分卡，這難道沒有問題麼？"},{"english":"When the player tilts or moves the phone, the helicopter changes direction accordingly.","chinese":"當玩家傾斜或移動手機時，直升飛機也會地飛行方向。"},{"english":"Myth is a game very popular among players.","chinese":"封神榜是一款很受玩家歡迎的遊戲。"},{"english":"Players can be at ease use will not be found.","chinese":"玩家可以放心使用不會被發現。"},{"english":"Multiplayer Spades, Backgammon, Hearts, Checkers, and Reversi.","chinese":"多玩家黑桃王，雙陸棋，紅心大戰，跳棋和翻轉棋。"}],"related":[{"definition":["to make an in-app purchase in a game"],"pinyin":["ke4 jin1"],"word":"氪金"},{"definition":["to play fast and loose with the law\/to game the system\/(leisure) rules of the game\/way of doing an activity\/(tourism) way of experiencing a place"],"pinyin":["wan2 fa3"],"word":"玩法"},{"definition":["(video games) PlayerUnknown's Battlegrounds (PUBG)\/battle royale game\/last-man-standing game\/to play PUBG (or similar game)\/to win at PUBG (or similar game)"],"pinyin":["chi1 ji1"],"word":"吃雞"},{"definition":["game\/CL:場|场[chang3]\/to play"],"pinyin":["you2 xi4"],"word":"遊戲"},{"definition":["playing card"],"pinyin":["ka3 pai2"],"word":"卡牌"},{"definition":["attached externally (e.g. fuel tank)\/plug-in\/add-on\/special software used to cheat in an online game"],"pinyin":["wai4 gua4"],"word":"外掛"},{"definition":["online game\/abbr. for 網絡遊戲|网络游戏"],"pinyin":["wang3 you2"],"word":"網遊"},{"definition":["to hang up (a phone)\/to leave a computer etc running (idling, downloading, or playing a game in one's stead etc)"],"pinyin":["gua4 ji1"],"word":"掛機"},{"definition":["hanbok (traditional Korean dress)"],"pinyin":["han2 fu2"],"word":"韓服"},{"definition":["mobile game\/abbr. for 手機遊戲|手机游戏"],"pinyin":["shou3 you2"],"word":"手遊"},{"definition":["World of Warcraft (video game)"],"pinyin":["Mo2 shou4 Shi4 jie4"],"word":"魔獸世界"},{"definition":["to start the servers (for an online game, typically after the system has been shut down for maintenance, upgrade etc)"],"pinyin":["kai1 fu2"],"word":"開服"},{"definition":["conveyance (car, boat, aircraft etc)\/vehicle\/(fig.) medium\/platform\/vector"],"pinyin":["zai4 ju4"],"word":"載具"},{"definition":["opposing sides (in chess etc)\/position (of opposing forces)"],"pinyin":["dui4 ju2"],"word":"對局"},{"definition":["hero\/CL:個|个[ge4]"],"pinyin":["ying1 xiong2"],"word":"英雄"},{"definition":["sprayer\/spraying apparatus\/(slang) firearm\/Internet troll\/hater"],"pinyin":["pen1 zi5"],"word":"噴子"}]}