{"definition":["current situation"],"pinyin":["xian4 zhuang4"],"simplified":["现状"],"rank":2975.0,"normalized_rank":0.0416241098037021,"fraction":0.00004835654867428365,"cumulative_fraction":0.7895177809860693,"word":"現狀","characters":[{"definition":["to appear\/present\/now\/existing\/current"],"pinyin":["xian4"],"word":"現"},{"definition":["accusation\/suit\/state\/condition\/strong\/great\/-shaped"],"pinyin":["zhuang4"],"word":"狀"}],"containing_words":[{"definition":["to take things as they are (idiom)\/to leave a situation as it is\/to be happy with the status quo"],"pinyin":["an1 yu2 xian4 zhuang4"],"word":"安於現狀"},{"definition":["The Strange State of the World Witnessed Over 20 Years, novel by late Qing novelist Wu Jianren 吳趼人|吴趼人[Wu2 Jian3 ren2]"],"pinyin":["Er4 shi2 Nian2 Mu4 du3 zhi1 Guai4 Xian4 zhuang4"],"word":"二十年目睹之怪現狀"}],"sentences":[{"english":"He self-reflected and decided to decrease the stress and clean up his diet, looking beyond the status quo.","chinese":"他能自我反醒並決定減少壓力和調整飲食，改變現狀。"},{"english":"ObjectiveTo find out the cause and actualities of pre-hospital care of pedo-burn.","chinese":"目的瞭解小兒燒傷的致傷因素和院前急救現狀。"},{"english":"The third part of the study focused on the status of vocational school students bad habits.","chinese":"第三部分集中考察職校生不良行爲習慣的現狀。"},{"english":"While reluctant to criticize the status quo, the guides often let things slip out in conversation.","chinese":"導遊不願意批評現狀，但在交談中會不時漏嘴。"},{"english":"Hey, that's the economic reality in sports and sports departments today.","chinese":"嗨，今天體育界和媒體體育部的經濟現狀就是如此。"},{"english":"The paper briefly describes present state of airborne laser reconnaissance subaquatic targets technology at abroad.","chinese":"綜述了國外機載激光偵察水下目標技術的發展現狀。"},{"english":"Elaborated in the industrialization production the steamed bun anti-aging engineering research present situation.","chinese":"闡述了工業化生產中饅頭抗老化技術研究現狀。"},{"english":"In contrast with developed islands, this paper also analyzed the problems exposed in earlier exploitation.","chinese":"對比已開發無人島現狀，分析開發中凸顯的問題。"},{"english":"The developments and current situation of tantalum-niobium hydrometallurgical extraction are presented.","chinese":"介紹了鉭鈮溼法冶金技術的發展概況和現狀。"},{"english":"But that may soon be changing.","chinese":"但是現狀可能很快會改變。"},{"english":"Then evaluates and considers the actualities of the prerogative of mercy that in our country.","chinese":"在此基礎上對我國赦免權的現狀進行評價和反思。"},{"english":"In this paper, the status and development of vehicle-mounted medical imaging equipments at home and broad were introduced.","chinese":"本文介紹了國內外車載醫學影像裝備的發展現狀。"},{"english":"Objective To learn the situation of supervision and management of pulmonary tuberculosis(TB) patients by village doctors and its influential factors.","chinese":"目的瞭解村醫生督導管理肺結核病人現狀及影響因素。"},{"english":"The actuality and development of engraving heads for electronic engravers were introduced.","chinese":"介紹了電子雕刻機雕刻頭的研究現狀與發展。"},{"english":"Secondly, this paper has dissected the current situation about management of tourist's development of Zaozhuang.","chinese":"其次，剖析棗莊旅遊業發展管理的現狀。"},{"english":"Is there anything I can do to improve the situation rather than leave?","chinese":"除了離家出走，我還可以做些什麼來改變現狀嗎？"}],"related":[{"definition":["the current situation"],"pinyin":["xian4 kuang4"],"word":"現況"},{"definition":["immediately\/at once\/at that moment\/at the moment"],"pinyin":["dang1 xia4"],"word":"當下"},{"definition":["society\/CL:個|个[ge4]"],"pinyin":["she4 hui4"],"word":"社會"},{"definition":["condition\/state\/situation\/CL:個|个[ge4]"],"pinyin":["zhuang4 kuang4"],"word":"狀況"},{"definition":["situation (of a person)"],"pinyin":["chu3 jing4"],"word":"處境"},{"definition":["regarding\/as far as sth is concerned\/with regards to"],"pinyin":["dui4 yu2"],"word":"對於"},{"definition":["current\/today's\/modern\/present\/to be facing (us)"],"pinyin":["dang1 qian2"],"word":"當前"},{"definition":["to confront\/to face"],"pinyin":["mian4 dui4"],"word":"面對"},{"definition":["topic of discussion\/topic\/subject\/issue (under discussion)\/CL:項|项[xiang4]"],"pinyin":["yi4 ti2"],"word":"議題"},{"definition":["future\/tomorrow\/CL:個|个[ge4]\/approaching\/coming\/pending"],"pinyin":["wei4 lai2"],"word":"未來"},{"definition":["to appeal\/to demand (an answer)\/requirement\/demand\/claim\/appeal\/(marketing) message"],"pinyin":["su4 qiu2"],"word":"訴求"},{"definition":["notion\/thought\/concept\/sense\/views\/ideology\/general impressions"],"pinyin":["guan1 nian4"],"word":"觀念"},{"definition":["reality\/actuality\/real\/actual\/realistic\/pragmatic\/materialistic\/self-interested"],"pinyin":["xian4 shi2"],"word":"現實"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或許"},{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["to approve of\/to endorse\/to acknowledge\/to recognize\/to identify oneself with"],"pinyin":["ren4 tong2"],"word":"認同"}]}