{"definition":["idea\/concept\/philosophy\/theory"],"pinyin":["li3 nian4"],"simplified":["理念"],"rank":1534.0,"normalized_rank":0.02146265023155597,"fraction":0.0001043348812022825,"cumulative_fraction":0.688811804468767,"word":"理念","characters":[{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["to read\/to study (a subject)\/to attend (a school)\/to read aloud\/to give (sb) a tongue-lashing (CL:頓|顿[dun4])\/to miss (sb)\/idea\/remembrance\/twenty (banker's anti-fraud numeral corresponding to 廿[nian4])"],"pinyin":["nian4"],"word":"念"}],"containing_words":[],"sentences":[{"english":"On the grounds of modern emergency medicine, defibrillation has to be performed in combination with CPR.","chinese":"根據現代急救理念，電除顫必須與心肺復甦聯合應用。"},{"english":"And Trump's governing concept shows a strong inclination toward neo-isolationism.","chinese":"從其執政理念看，新孤立主義傾向明顯。"},{"english":"Commitment to animal welfare issues and to promoting IFAW's mission.","chinese":"理解動物福利理念，並願意推動IFAW宗旨。"},{"english":"So, what was the concept Akon and Jackson tried to deliver on the song?","chinese":"那麼阿肯和傑克遜試圖通過這首歌傳遞什麼理念呢？"},{"english":"Anna's constant search for new ideas and challenges keeps her ahead of her times.","chinese":"對新理念與挑戰的不斷追求令安娜始終走在時代前列。"},{"english":"Senior middle school chemistry teaching should be conducted with the concept of new curriculum reform.","chinese":"高中化學教學需要用新課程改革的理念來統領。"},{"english":"This paper discusses the relationship between the truth perfect, beautiful life principle and university education.","chinese":"論述了求真求善求美的人生理念與大學教育的關係。"},{"english":"This paper examines a new concept of community-based tourism(CBET) that originated in foreign country.","chinese":"本文引入了國外基於社區的生態旅遊這一新發展理念。"},{"english":"Also, the whole concept of “goto hell” was abandoned.","chinese":"而且，“下地獄去吧”這樣的理念沒有了。"},{"english":"The concept and project status of design were introduced of ceiling curtain sound amplifying system for world trade building in Beijing.","chinese":"介紹了世貿天階天幕擴聲系統的設計理念與工程概況。"},{"english":"Mediation priority, early prevention, public power dominant the social security are essential Countermeasure.","chinese":"讓公權力主導社會安全的理念深入人心是基本對策。"},{"english":"His idea ofalienation was derived mostly from Hegel.","chinese":"他的關於異化的理念絕大部分脫胎於黑格爾。"},{"english":"I hope some of those concepts come to market in 2010.","chinese":"我希望2010年這些理念能走向市場。"},{"english":"Tried-and-true methods mix with fresh concepts to create better wildland fleets .","chinese":"試用真實方法混合新鮮理念，創造出更好的荒地船隊。"},{"english":"At present, the theory of the Chinese subject have the newchanges.","chinese":"目前，語文學科教學理念有了新的變革。"},{"english":"At the same time, implementation of people-centered concept of curriculum leadership to achieve this requirement exactly.","chinese":"以人爲本的課程領導理念恰恰體現了這一要求。"}],"related":[{"definition":["people-oriented"],"pinyin":["yi3 ren2 wei2 ben3"],"word":"以人為本"},{"definition":["to advocate\/to initiate\/to propose\/to be a proponent of (an idea or school of thought)"],"pinyin":["chang4 dao3"],"word":"倡導"},{"definition":["to take orders\/to receive commands\/to carry on (a tradition)"],"pinyin":["bing3 cheng2"],"word":"秉承"},{"definition":["to uphold\/to hold fast to"],"pinyin":["bing3 chi2"],"word":"秉持"},{"definition":["to practice\/to put into practice"],"pinyin":["jian4 xing2"],"word":"踐行"},{"definition":["objective\/aim\/goal"],"pinyin":["zong1 zhi3"],"word":"宗旨"},{"definition":["to promote\/to advocate"],"pinyin":["ti2 chang4"],"word":"提倡"},{"definition":["notion\/thought\/concept\/sense\/views\/ideology\/general impressions"],"pinyin":["guan1 nian4"],"word":"觀念"},{"definition":["to implement\/to put into practice\/to carry out"],"pinyin":["guan4 che4"],"word":"貫徹"},{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"word":"實踐"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["starting point\/(fig.) basis\/motive"],"pinyin":["chu1 fa1 dian3"],"word":"出發點"},{"definition":["marrow\/pith\/quintessence\/essence"],"pinyin":["jing1 sui3"],"word":"精髓"},{"definition":["pragmatism"],"pinyin":["shi2 yong4 zhu3 yi4"],"word":"實用主義"},{"definition":["original intention"],"pinyin":["chu1 zhong1"],"word":"初衷"},{"definition":["to hold up (as an model)\/to hold in esteem\/to revere\/to advocate"],"pinyin":["chong2 shang4"],"word":"崇尚"}]}