{"definition":["as it should be by rights (idiom); proper and to be expected as a matter of course\/inevitable and right"],"pinyin":["li3 suo3 dang1 ran2"],"simplified":["理所当然"],"rank":11670.0,"normalized_rank":0.1632784408098163,"fraction":0.0000064123592151640955,"cumulative_fraction":0.9418572434766208,"word":"理所當然","characters":[{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["actually\/place\/classifier for houses, small buildings, institutions etc\/that which\/particle introducing a relative clause or passive\/CL:個|个[ge4]"],"pinyin":["suo3"],"word":"所"},{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["correct\/right\/so\/thus\/like this\/-ly"],"pinyin":["ran2"],"word":"然"}],"containing_words":[],"sentences":[{"english":"Of course you have.","chinese":"理所當然你會有。"},{"english":"We foresee a soft landing, but this cannot be taken for granted.","chinese":"我們預期會出現軟着陸，但不能將其視爲理所當然。"},{"english":"At the biggest companies, long-term investment is taken for granted.","chinese":"在大公司，長期投資被視爲是理所當然的。"},{"english":"Fittingly, there should be a deep focus on trade and investment.","chinese":"理所當然，峯會應當重點關注貿易和投資。"},{"english":"Children, obey your parents in the Lord: for this is right.","chinese":"你們作兒女的，要在主裏聽從父母，這是理所當然的。"},{"english":"The well- disciplined soldiers carried out their orders without question.","chinese":"訓練有素的士兵理所當然地執行了命令。"},{"english":"I was surprised; I looked down, flushing, of course.","chinese":"我很驚訝，只得低下了頭，理所當然地臉紅了。"},{"english":"It is taken for granted by the public-at-large.","chinese":"公衆把新聞界的影響力看成是理所當然的。"},{"english":"Dot take for granted the things closest to your heart.","chinese":"別把最貼心的事情當成理所當然。"},{"english":"With, thus far, we've taken that for granted.","chinese":"至此，我們把那個當成時理所當然的了。"},{"english":"Don't take for granted what you have.","chinese":"不要認爲你所擁有的是理所當然的。"},{"english":"She had good reason to feel angry.","chinese":"理所當然，厄里斯爲此感到憤怒。"},{"english":"Many effective prescription will become a matter of course the recipe.","chinese":"許多有效的方劑也就理所當然的成爲祕方。"},{"english":"And, as a result, this book would have been mainly about Shanti Uncle.","chinese":"理所當然的，這本書本應主要記述山狄叔叔。"},{"english":"But I certainly like what he's done for this town.","chinese":"但是我理所當然地喜歡他爲這個城市所做的一切。"},{"english":"While talking the Ya in the eye however became naturally.","chinese":"說話時，眼裏的訝然就變成了理所當然。"}],"related":[{"definition":["this kind of\/so\/this way\/like this\/such"],"pinyin":["zhe4 yang4"],"word":"這樣"},{"definition":["because\/owing to\/on account of"],"pinyin":["yin1 wei4"],"word":"因為"},{"definition":["they"],"pinyin":["ta1 men5"],"word":"他們"},{"definition":["conversely\/in reverse order\/in an opposite direction"],"pinyin":["fan3 guo5 lai2"],"word":"反過來"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或許"},{"definition":["we\/us\/ourselves\/our"],"pinyin":["wo3 men5"],"word":"我們"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"畢竟"},{"definition":["always\/at all times\/never (if used in negative sentence)"],"pinyin":["cong2 lai2"],"word":"從來"},{"definition":["to treat\/treatment"],"pinyin":["dui4 dai4"],"word":"對待"},{"definition":["always"],"pinyin":["zong3 shi4"],"word":"總是"},{"definition":["excessive\/undue\/overly"],"pinyin":["guo4 fen4"],"word":"過分"},{"definition":["only\/merely\/nothing but\/no more than\/it's just that ..."],"pinyin":["zhi3 bu5 guo4"],"word":"只不過"},{"definition":["moreover\/besides\/in addition\/furthermore"],"pinyin":["kuang4 qie3"],"word":"況且"},{"definition":["in a word\/in short\/in brief"],"pinyin":["zong3 zhi1"],"word":"總之"},{"definition":["should not\/to owe nothing"],"pinyin":["bu4 gai1"],"word":"不該"},{"definition":["a modal particle indicating (don't mind it, ok)","a modal particle indicating (that's all, only, nothing much)"],"pinyin":["ba4 le5","ba4 liao3"],"word":"罷了"}]}