{"definition":["should\/ought"],"pinyin":["li3 dang1"],"simplified":["理当"],"rank":31077.0,"normalized_rank":0.4348075497040841,"fraction":8.568886696795419e-7,"cumulative_fraction":0.9912098170599885,"word":"理當","characters":[{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"}],"containing_words":[],"sentences":[{"english":"I think women should accept their traditional role of being housewives.","chinese":"我認爲婦女理當接管她們傳統的腳色，做家庭婦女。"},{"english":"And by reason hereof he ought, as for the people, so also for himself, to offer for sins.","chinese":"故此他理當爲百姓和自己獻祭贖罪。"},{"english":"All citizens and organizations shall respect and care for the National Flag.","chinese":"每個平正易近和組織，都理當尊敬和愛護國旗。"},{"english":"The kitchen is one of the most taken for granted parts of the house.","chinese":"廚房是其中一個房子的理當如此的部分。"},{"english":"Obey the king's command, I say, because you took an oath before God.","chinese":"我勸你遵守王的命令，既指神起誓，理當如此。"},{"english":"And rightly so; it’s world famous.","chinese":"理當如此，因爲它世界馳名。"},{"english":"But the kitchen is one of the most taken for granted parts of the house.","chinese":"但是廚房是其中一個房子的理當如此的部分。"},{"english":"I was blissful and sure that all things were as they should be.","chinese":"我是有福的，我確信萬物都理當如此。"},{"english":"This paper introduces a distributed stage suspender control system, which is based on configuration and PLC technology.","chinese":"舞臺吊杆的控制也理當順應了這一發展趨勢。"},{"english":"Certainly all journalists should aim to be accurate.","chinese":"所有記者理當以準確爲目標。"}],"related":[]}