{"definition":["to straighten out\/to sort out\/to organize"],"pinyin":["li3 shun4"],"simplified":["理顺"],"rank":11585.0,"normalized_rank":0.16208918052971052,"fraction":0.0000064875376929979895,"cumulative_fraction":0.941308789183006,"word":"理順","characters":[{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["to obey\/to follow\/to arrange\/to make reasonable\/along\/favorable"],"pinyin":["shun4"],"word":"順"}],"containing_words":[],"sentences":[{"english":"We must rationalize our regulatory system. The regulator must have the capacity to regulate comprehensive services.","chinese":"我們必須理順監管體制。"},{"english":"She smoothed her dishevelled hair.","chinese":"她理順了亂蓬蓬的頭髮。"},{"english":"Make smooth raw material inspection and storage procedures and strengthen rechecking of samples for witness of raw material storage.","chinese":"理順原材料進庫檢驗及儲存，加強進庫見證取樣複檢。"},{"english":"We cannot speed up the reform without rationalizing prices.","chinese":"理順物價，改革才能加快步伐。"},{"english":"Zoom in, out, or use colored nodes to create order out of that chaos.","chinese":"放大，縮小，或者使用色標理順想法。"},{"english":"Eighth, consummate the system of popularizing agricultural technique.","chinese":"八是完善理順農技推廣體系。"},{"english":"A men's T-shirt should be face down and smoothed out before you fold it.","chinese":"一個男人的T恤應該是朝下並理順之前，把它摺疊。"},{"english":"Want to keep your plaster pliable a bit longer to get it all smoothed out?","chinese":"要保留你的石膏柔韌多一點的時間來把一切理順嗎？"},{"english":"One, the relation that straightens enterprise of local power supply and provincial power company.","chinese":"理順地方供電企業與省級電力公司的關係。"},{"english":"You should straighten up your ideas first.","chinese":"你得先把你的思路理順。"},{"english":"The government is making unprecedented efforts to stanch the bleeding.","chinese":"美國政府正在採取史無前例的行動來理順經濟。"},{"english":"The distribution of the graduates needs to be straightened out.","chinese":"畢業生分配關係沒有理順。"},{"english":"A gentle, relaxing gel, formulated to help reduce puffiness and smooth out fine lines.","chinese":"柔和輕鬆凝膠以幫助減少浮腫和理順幼紋。"}],"related":[]}