{"definition":["Manasseh (son of Hezekiah)"],"pinyin":["Ma3 na2 xi1"],"simplified":["玛拿西"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"瑪拿西","characters":[{"definition":["agate\/cornelian"],"pinyin":["ma3"],"word":"瑪"},{"definition":["to hold\/to seize\/to catch\/to apprehend\/to take\/(used in the same way as 把[ba3]: to mark the following noun as a direct object)"],"pinyin":["na2"],"word":"拿"},{"definition":["the West\/abbr. for Spain 西班牙[Xi1 ban1 ya2]\/Spanish","west"],"pinyin":["Xi1","xi1"],"word":"西"}],"containing_words":[],"sentences":[{"english":"And Manasseh his son succeeded him as king.","chinese":"他兒子瑪拿西接續他作王。"},{"english":"So Manasseh and Ephraim, the descendants of Joseph, received their inheritance.","chinese":"約瑟的兒子瑪拿西，以法蓮就得了他們的地業。"},{"english":"So he took his two sons Manasseh and Ephraim along with him.","chinese":"他就帶着兩個兒子瑪拿西和以法蓮同去。"},{"english":"Manasseh lay carpets there.","chinese":"瑪拿西，把地毯放在那兒。"},{"english":"Manasseh rested with his fathers and was buried in his palace garden, the garden of Uzza.","chinese":"瑪拿西與他列祖同睡，葬在自己宮院烏撒的園內。"},{"english":"And by the border of Manasseh, from the east side unto the west side, a portion for Ephraim.","chinese":"挨着瑪拿西的地界，從東到西，是以法蓮的一分。"},{"english":"Between Ahaz and Manasseh there was 29-year reign of King Hezekiah.","chinese":"在亞哈斯和瑪拿西之間，希西家作王共29年。"},{"english":"And over the host of the tribe of the children of Manasseh was Gamaliel the son of Pedahzur.","chinese":"統領瑪拿西支派軍隊的是比大蓿的兒子迦瑪列。"},{"english":"and Eliab son of Helon was over the division of the tribe of Zebulun.","chinese":"統領瑪拿西支派軍隊的是比大蓿的兒子迦瑪列。"},{"english":"Then Manasseh knew that the Lord is God.","chinese":"瑪拿西這才知道惟獨耶和華是神。"},{"english":"These are the other male descendants of Manasseh son of Joseph by their clans.","chinese":"這些按着宗族，都是約瑟兒子瑪拿西子孫的男丁。"},{"english":"So he took his two sons (A)Manasseh and Ephraim with him.","chinese":"他就帶著兩個兒子瑪拿西和以法蓮同去。"},{"english":"Manasseh rested with his fathers and was buried in his palace.","chinese":"瑪拿西與他列祖同睡，葬在自己的宮院裏。"},{"english":"And by the border of Naphtali, from the east side unto the west side, a portion for Manasseh.","chinese":"挨着拿弗他利的地界，從東到西，是瑪拿西的一分。"},{"english":"He was murdered by King Hezekiah's son King Manasseh.","chinese":"他被西家王的兒子瑪拿西殺害。"},{"english":"So the children of Joseph, Manasseh and Ephraim, took their inheritance.","chinese":"約瑟的兒子瑪拿西，以法蓮就得了他們的地業。"}],"related":[]}