{"definition":["environmentalist"],"pinyin":["huan2 bao3 zhu3 yi4 zhe3"],"simplified":["环保主义者"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"環保主義者","characters":[{"definition":["ring\/hoop\/loop\/(chain) link\/classifier for scores in archery etc\/to surround\/to encircle\/to hem in","surname Huan"],"pinyin":["Huan2","huan2"],"word":"環"},{"definition":["Bulgaria\/Bulgarian\/abbr. for 保加利亞|保加利亚[Bao3 jia1 li4 ya4]","to defend\/to protect\/to keep\/to guarantee\/to ensure\/civil administration unit in the baojia 保甲[bao3 jia3] system (old)"],"pinyin":["Bao3","bao3"],"word":"保"},{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["Yi4","yi4"],"word":"義"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"But right now greens are the last people we need to be talking to.","chinese":"但現在的事實是，我們最不需要向環保主義者佈道。"},{"english":"Environmentalists may embrace genetically modified crops as a carbon-reduction technology.","chinese":"轉基因作物將和碳減排技術一樣得到環保主義者接受。"},{"english":"Conservationists claim that businessmen then flocked to the island and began rampantly abusing this quota.","chinese":"環保主義者說，商人云集巴厘島，開始濫用此項配額。"},{"english":"On the one hand, it marks a big victory for them.","chinese":"一方面，它標誌着環保主義者取得了重大勝利。"},{"english":"As conservationists like to say, every niche is valuable.","chinese":"正如環保主義者常說的那樣，每一個生態位都很珍貴。"},{"english":"Environmentalists saw last year's endangered-species legislation as weak and only minimally effective.","chinese":"環保主義者卻沒有看到那種緊迫感。"}],"related":[]}