{"definition":["epoxy resin (chemistry)"],"pinyin":["huan2 yang3 shu4 zhi1"],"simplified":["环氧树脂"],"rank":42932.0,"normalized_rank":0.6006743805353071,"fraction":2.919552537238643e-7,"cumulative_fraction":0.997473067866129,"word":"環氧樹脂","characters":[{"definition":["ring\/hoop\/loop\/(chain) link\/classifier for scores in archery etc\/to surround\/to encircle\/to hem in","surname Huan"],"pinyin":["Huan2","huan2"],"word":"環"},{"definition":["oxygen (chemistry)"],"pinyin":["yang3"],"word":"氧"},{"definition":["tree\/CL:棵[ke1]\/to cultivate\/to set up"],"pinyin":["shu4"],"word":"樹"},{"definition":["fat\/rouge (cosmetics)\/resin"],"pinyin":["zhi1"],"word":"脂"}],"containing_words":[],"sentences":[{"english":"The new box could be epoxied or screw attached into place.","chinese":"該新盒可以用用環氧樹脂粘合或螺栓連接到位。"},{"english":"Liquid crystalline epoxy resin is a kind of liquid crystalline thermosets .","chinese":"液晶環氧樹脂是一種具有廣闊應用前景的液晶熱固體。"},{"english":"J-800A\/B is a two part epoxy paste adhesive.","chinese":"是一種雙組分環氧樹脂膏狀膠粘劑。"},{"english":"Polyesters exhibit better non-yellowing properties than epoxies, but not as good as aliphatic urethanes.","chinese":"聚酯的耐黃性優於環氧樹脂，但弱於脂肪族聚氨酯。"},{"english":"The zero current transformer of the type LXK is casting resin and indoor product.","chinese":"本型零序電流互感器爲環氧樹脂澆注戶內型產品。"},{"english":"Volatiles should not be added to the epoxies to improve their viscosity.","chinese":"不應將揮發物加到環氧樹脂中去改善它們的粘性。"},{"english":"The products are made of metallized polypropylene film, seal with epoxy resin.","chinese":"金屬化聚丙烯膜卷繞而成，阻燃環氧樹脂封封。"},{"english":"A pouring adhesive made of epoxy resin for glazing vane wheel was prepared in the paper.","chinese":"研究開發了研磨頁輪用單組分環氧樹脂澆鑄膠粘劑。"},{"english":"Polyesters are less brittle than epoxies, but not as flexible or tough as urethanes.","chinese":"聚酯沒有環氧樹脂發脆，但也沒有聚氨酯的堅韌性。"},{"english":"The epoxy resin sealant has extensive application in the electronic and electrical equipment industry.","chinese":"環氧樹脂灌封膠在電子電器工業領域應用廣泛。"},{"english":"For situations where extreme water resistance is required, epoxy is the best choice.","chinese":"在需要極端耐水的情況下，環氧樹脂是最好的選擇。"},{"english":"The changes of electrical characteristics of varistors after being coated in epoxy resin were investigated.","chinese":"研究了壓敏電阻器在環氧樹脂灌封后的電性能變化。"},{"english":"This paper introduced detailed two kinds of hardener of epoxy resin.","chinese":"本文比較詳細地介紹了環氧樹脂兩類固化劑。"},{"english":"The sulfonium salt has better curing character to epoxy resin.","chinese":"該硫鎓鹽對環氧樹脂具有良好的固化性能。"},{"english":"The silane treated carbon steel was adhered by epoxy resin.","chinese":"對碳鋼表面進行硅烷處理，用環氧樹脂膠黏劑粘接。"},{"english":"These inconveniences make epoxies a bad choice for everyday work.","chinese":"這些不便使得環氧樹脂不能在日常使用中得以普及。"}],"related":[]}