{"definition":["to look around\/to survey"],"pinyin":["huan2 gu4"],"simplified":["环顾"],"rank":23482.0,"normalized_rank":0.3285436458522799,"fraction":0.0000017048727041205057,"cumulative_fraction":0.9818776746629316,"word":"環顧","characters":[{"definition":["ring\/hoop\/loop\/(chain) link\/classifier for scores in archery etc\/to surround\/to encircle\/to hem in","surname Huan"],"pinyin":["Huan2","huan2"],"word":"環"},{"definition":["surname Gu","to look after\/to take into consideration\/to attend to"],"pinyin":["Gu4","gu4"],"word":"顧"}],"containing_words":[{"definition":["to look around"],"pinyin":["huan2 gu4 si4 zhou1"],"word":"環顧四周"}],"sentences":[{"english":"It looked around the page and saw lines all around.","chinese":"它環顧畫紙，發現周圍佈滿了線條。"},{"english":"She looked around her stripped room without emotion.","chinese":"她環顧自己那空落落的房間，沒有一點感情。"},{"english":"She glanced about the table to see the effect of this.","chinese":"她環顧一眼餐桌，看這句話產生了什麼效果。"},{"english":"The black dog was there, too, but the small tin soldier looked straight at the pretty paper house and at the beautiful dancer.","chinese":"小錫士兵環顧四周，發現他又回到了同一戶人家。"},{"english":"She looked round and saw )ett running.","chinese":"她環顧四周，看見傑夫正在奔跑。"},{"english":"Looking around Osaka, many buildings have been constructed or are under construction.","chinese":"環顧大阪，林立着許多架起的或尚待開發的建築。"},{"english":"I look around this room and I don't see many black faces who will become doctors.","chinese":"我環顧這間屋子沒有看到幾張將成爲醫生的黑色面孔。"},{"english":"He looked round upon us with a most agreeable smile.","chinese":"他帶着十分爽朗的笑容向我們環顧了一下。"},{"english":"When I standed up and looked around, just several people were still digging.","chinese":"當我站起來環顧四周時，只有幾個人依然在挖蚌。"},{"english":"However, on a cloudy day, looking around, one can only see boundless land disappearing into a sea of clouds.","chinese":"但遇陰天時，環顧四周，蒼茫大地，盡入雲海。"},{"english":"Patricia sipped her coffee and looked around at the one-room cabin.","chinese":"帕特西亞啜着咖啡，環顧着這個只有一間臥室的小屋。"},{"english":"When the sky is overcast, the horizon disappears into a sea of cloud.","chinese":"但與天陰時，環顧四周，蒼茫大地，盡入雲海。"},{"english":"When the sky is overcast, the horizon disappears into a sea of clouds.","chinese":"但遇天陰時，環顧四周，蒼茫大地，盡入雲海。"},{"english":"If you look around there, almost nobody is homeless.","chinese":"如果你環顧四周，幾乎無人流浪。"},{"english":"Anderson lit the oil-lamp and looked round.","chinese":"安得森先生點亮油燈，環顧四周看了看。"},{"english":"PreSchool-Grade 1-Suzy Goose looks around and wishes she could be different.","chinese":"學齡前級1蘇西鵝環顧四周，並希望她可以是不同的。"}],"related":[]}