{"definition":["willingly"],"pinyin":["gan1 yuan4"],"simplified":["甘愿"],"rank":21309.0,"normalized_rank":0.2981405565738111,"fraction":0.0000020946329678418653,"cumulative_fraction":0.9777664962472292,"word":"甘願","characters":[{"definition":["surname Gan\/abbr. for Gansu Province 甘肅省|甘肃省[Gan1 su4 Sheng3]","sweet\/willing"],"pinyin":["Gan1","gan1"],"word":"甘"},{"definition":["to hope\/to wish\/to desire\/hoped-for\/ready\/willing"],"pinyin":["yuan4"],"word":"願"}],"containing_words":[],"sentences":[{"english":"That a separate the world empty thoughts, like poison, always let a person willing to sink.","chinese":"那一份隔世離空的思念，宛如毒藥，總讓人甘願沉淪。"},{"english":"If you find out that Han Xiaoou is a spy, he is willing to lose his head.","chinese":"如果將來查出韓曉鷗是特務，他甘願掉腦袋。"},{"english":"It became known to all that she had a boyfriend who was ready to sacrifice everything for her.","chinese":"所有的人都知道她有一個爲她甘願付出的男友。"},{"english":"There are many small countries bow their head to Da T'ang at that time.","chinese":"當時大唐周邊許多小國甘願俯首稱臣。"},{"english":"So he put aside his dignity, they are willing to Wu to become a pawn.","chinese":"於是他放下尊嚴，甘願到吳國去當馬前卒。"},{"english":"When enough people are willing to help, then we will succeed.","chinese":"當有足夠的人民甘願幫助時，我們就會成功。"},{"english":"No matter it is fully blooming or silently declining, willingness and respect we keep to it are always there.","chinese":"不管是竭力盛放，還是靜默頹敗，都如此甘願和珍重。"},{"english":"He was a rounder's son named Westley.","chinese":"他是一個圓的兒子名叫維斯特利甘願出個。"},{"english":"We are willing to look like fools to test things for our readers.","chinese":"爲了我們的讀者，我們甘願做這樣的傻事。"},{"english":"Born as human beings, how can we be willing to equate ourselves to animals?","chinese":"作爲人，我們又怎能甘願讓自己與旁生不分高低呢？"},{"english":"The flowers refuse to be snapped off the branches and lose their soul.","chinese":"不甘願被折離枝端失去了靈魂。"},{"english":"How many kings step down from their thrones?","chinese":"有多少帝王甘願步下他們的王座？"},{"english":"Because of breach of the villagers, the incense are willing to be punished stepped back.","chinese":"因失信村民，金香甘願受罰退位讓賢。"},{"english":"If the experiment is not successful,I am ready to pack it in.","chinese":"如果試驗不成功，我甘願承認失敗。"},{"english":"You would be a sweet surrender but I must go the other way.","chinese":"即使你甘願放棄我也只有遠走他鄉。"},{"english":"I would sooner resign than work under that boss.","chinese":"我甘願辭職也不願在那個老闆手底下工作。"}],"related":[{"definition":["delighted to (do sth, idiom)\/perfectly happy to do\/most willing to do"],"pinyin":["xin1 gan1 qing2 yuan4"],"word":"心甘情願"},{"definition":["unwilling\/unwillingness"],"pinyin":["bu4 yuan4"],"word":"不願"},{"definition":["a modal particle indicating (don't mind it, ok)","a modal particle indicating (that's all, only, nothing much)"],"pinyin":["ba4 le5","ba4 liao3"],"word":"罷了"},{"definition":["honor does not allow one to glance back (idiom); duty-bound not to turn back\/no surrender\/to pursue justice with no second thoughts"],"pinyin":["yi4 wu2 fan3 gu4"],"word":"義無反顧"},{"definition":["even if\/even though"],"pinyin":["zong4 ran2"],"word":"縱然"},{"definition":["to get the desired outcome\/to win favor by fawning on sb\/to curry favor with\/a fruitful outcome to reward one's labor"],"pinyin":["tao3 hao3"],"word":"討好"},{"definition":["as it should be by rights (idiom); proper and to be expected as a matter of course\/inevitable and right"],"pinyin":["li3 suo3 dang1 ran2"],"word":"理所當然"},{"definition":["to believe (sth in relation to oneself)\/to regard oneself as\/to acknowledge (sth in relation to oneself)\/to resign oneself to"],"pinyin":["zi4 ren4"],"word":"自認"},{"definition":["should not\/to owe nothing"],"pinyin":["bu4 gai1"],"word":"不該"},{"definition":["to take pity on\/pity\/mercy"],"pinyin":["lian2 min3"],"word":"憐憫"},{"definition":["to submit to humiliation (idiom); to suffer in silence\/to swallow one's anger\/to grin and bear it"],"pinyin":["ren3 qi4 tun1 sheng1"],"word":"忍氣吞聲"},{"definition":["moreover\/besides\/in addition\/furthermore"],"pinyin":["kuang4 qie3"],"word":"況且"},{"definition":["willing (to do sth)\/to take pleasure in"],"pinyin":["le4 yu2"],"word":"樂於"},{"definition":["to turn a blind eye to\/to ignore"],"pinyin":["shi4 er2 bu4 jian4"],"word":"視而不見"},{"definition":["considerate (of other people's needs)"],"pinyin":["ti3 tie1"],"word":"體貼"},{"definition":["obedient\/to comply\/to submit\/to defer"],"pinyin":["shun4 cong2"],"word":"順從"}]}