{"definition":["biomechanics"],"pinyin":["sheng1 wu4 li4 xue2"],"simplified":["生物力学"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"生物力學","characters":[{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"},{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"},{"definition":["power\/force\/strength\/ability\/strenuously","surname Li"],"pinyin":["Li4","li4"],"word":"力"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"It is, therefore, of important aspect in biomechanics study.","chinese":"因此，在生物力學研究上具有重要意義。"},{"english":"That will throw off your body’s biomechanics.","chinese":"那將會使你的身體偏離生物力學。"},{"english":"Aim To analyse the biomechanical mechanism of arcus plantaris and its clinical application.","chinese":"目的分析足弓的生物力學原理及在臨牀的應用。"},{"english":"Orthotics are orthopedic devices that are used to treat a variety of biomechanical foot disorders.","chinese":"骨科矯形是設備，用於治療各種腳病的生物力學。"},{"english":"Objective To discuss the biomechanical mechanism of clinical representation of gluteal muscle contracture (GMC).","chinese":"目的探討臀肌攣縮症患者臨牀表現的生物力學機制。"},{"english":"It bases on biology mechanics theory and herbalist doctor's massage correctitude bone theory .","chinese":"它根據生物力學原理及中醫推拿正骨原理設計面成。"},{"english":"It can also form air liquid interface and analog biomechanics incentives.","chinese":"能夠形成氣液界面和模擬生物力學的刺激。"},{"english":"Studys on anatomy and biomechanics of the sesamoids are the basic of kinds of clinical ones.","chinese":"其解剖及生物力學等研究是各種臨牀研究的基礎。"},{"english":"Objective To compare the stress distribution of implant in maxillary complex in anterior, medium and posterior postions under vertical and horizontal loading.","chinese":"目的討論種植體在上頜骨複合體中的生物力學行爲。"},{"english":"The proximal tibial metaphysis microstructure significantly correlates with its biomechanical properties.","chinese":"脛骨近側幹骺端微結構參數與生物力學特徵顯著相關。"},{"english":"Three-point bending test was carried out for the measurement of the femur biomechanical properties.","chinese":"取股骨行三點彎曲試驗，測骨生物力學性能指標。"},{"english":"Method We used the biomechanics method of photoelastic experiment.","chinese":"方法採用生物力學光彈性實驗方法。"},{"english":"Pathological and biomechanical changes of femoral head were studied at 16 weeks after treatment.","chinese":"植入後16周行病理學檢查及生物力學測定。"},{"english":"They come from the fields of biomechanics, sports podiatry, and physical therapy.","chinese":"他們來自生物力學，運動足部學，和理療等不同領域。"}],"related":[]}