{"definition":["physiologist"],"pinyin":["sheng1 li3 xue2 jia1"],"simplified":["生理学家"],"rank":50328.0,"normalized_rank":0.7041540162019224,"fraction":1.3911667839942136e-7,"cumulative_fraction":0.9990063867872899,"word":"生理學家","characters":[{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[],"sentences":[{"english":"Thus, neurophysiologists tell us that lobsters do not process pain.","chinese":"但是，神經生理學家告訴我們龍蝦感知不到疼痛。"},{"english":"The answers, some exercise physiologists say, are not always what you might expect.","chinese":"一些運動生理學家的答案並非如你所想。"},{"english":"There are some tricks, exercise physiologists say, but also some risks.","chinese":"運動生理學家指出，其中有些訣竅，但也有些風險。"},{"english":"The physiologist recently studied indicated that evening exercises beneficially .","chinese":"生理學家新近研究表明，傍晚鍛鍊最爲有益。"},{"english":"Animal physiologists have done beautiful work on the anatomy of this sensory system.","chinese":"動物生理學家對這一感覺系統進行了完善的解剖研究。"},{"english":"Immunoassays are the tests physiologists have traditionally used in such studies.","chinese":"免疫測定法是生理學家在類似研究中傳統使用的方法。"},{"english":"Immunoassays are the tests physiologists hae traditionally used in such studies.","chinese":"免疫測定法是生理學家在類似研究中傳統使用的方法。"},{"english":"He said, \"Oh, well, he's a very eminent muscle electrophysiologist. \" I said, \"Muscle?","chinese":"他說，“喔，他是一個非常出色的肌肉電生理學家。”"}],"related":[]}