{"definition":["biological product"],"pinyin":["sheng1 wu4 zhi4 pin3"],"simplified":["生物制品"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"生物製品","characters":[{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"},{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"},{"definition":["to manufacture\/to make"],"pinyin":["zhi4"],"word":"製"},{"definition":["article\/commodity\/product\/goods\/kind\/grade\/rank\/character\/disposition\/nature\/temperament\/variety\/to taste sth\/to sample\/to criticize\/to comment\/to judge\/to size up\/fret (on a guitar or lute)"],"pinyin":["pin3"],"word":"品"}],"containing_words":[],"sentences":[{"english":"For biological products, samples from several consecutively manufactured batches should be submitted.","chinese":"對於生物製品，應當要提交連續幾個生產批次的樣品。"},{"english":"Animal Biologics Science is a required course for the students of Biologic Technology.","chinese":"動物生物製品學是生物技術專業的必修課。"},{"english":"A gas chromatographic method for the determination of phenol in some biologics was developed.","chinese":"本文采用氣相色譜法測定了幾種生物製品中苯酚含量。"},{"english":"Adopting the routine allergy tests for detecting the allergy of biologicals.","chinese":"採用生物製品過敏試驗常規檢測方法。"},{"english":"Many biological products were manufactured by means of large-up culture of animal cells.","chinese":"利用動物細胞大規模培養技術可生產多種生物製品。"},{"english":"It is the largest enterprise specializing in the research and development of Antarctic Krill Bio-products in China.","chinese":"是國內最大的南極磷蝦生物製品研發企業。"},{"english":"Article 4 The Ministry of Agriculture shall be responsible for supervising and administrating veterinary biological products across the country.","chinese":"第四條農業部負責全國獸用生物製品的監督管理工作。"},{"english":"Blood is a biological substance and may never be entirely risk-free.","chinese":"血液是生物製品，所以不可能完全沒有風險。"},{"english":"Mouse shall be provided by Experimental Animal Center of Changchun Biologicals Institute.","chinese":"由生物製品所實驗動物中心提供。"},{"english":"In Shenyang Pu biological preparations Limited company.","chinese":"瀋陽中普生物製品有限公司。"}],"related":[]}