{"definition":["unprocessed medicinal herb"],"pinyin":["sheng1 yao4"],"simplified":["生药"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"生藥","characters":[{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"},{"definition":["medicine\/drug\/substance used for a specific purpose (e.g. poisoning, explosion, fermenting)\/CL:種|种[zhong3],服[fu4],味[wei4]\/to poison"],"pinyin":["yao4"],"word":"藥"}],"containing_words":[],"sentences":[{"english":"Results The pharmacognostic character of Herba Agriophyllum was described comprehensively.","chinese":"結果詳細描述了蒙藥材沙蓬的生藥學特徵。"},{"english":"Objective: In order to provide identifiable ground for Stevia rebaudiana on pharmaceutical botany.","chinese":"目的爲甜葉菊的生藥鑑定提供依據。"},{"english":"Lu side traffic crude drug lose money, go back township.","chinese":"呂方販賣生藥虧了本，不能回鄉。"},{"english":"OBJECTIVE To study the pharmacognostic character of Desmodium gangeticum( L. ) DC.","chinese":"目的研究紅母雞草的生藥鑑別特徵。"},{"english":"OBJECTIVE To establish the standard of pharmacognostic identification for the Synurus deltoides.","chinese":"建立山牛蒡生藥學鑑定標準。"},{"english":"The development of pharmacognosy is facing opportunities and challenges.","chinese":"生藥學的發展面臨着機遇和挑戰。"},{"english":"Objective To evaluate the identification methods for Trema rientalis(L. ) BL.","chinese":"目的建立山黃麻生藥鑑定的方法。"},{"english":"Methods By consulting Pharmacopoeia of China and Japanese Pharmacopoeia, the source of the crude drugs was compared.","chinese":"方法通過查閱中國藥典和日本藥局方，比較生藥來源。"},{"english":"The Research of Formosan Original Plants and Their Medicinal …","chinese":"阿美族的傳統生藥植物簡介。"},{"english":"Results The pharmacognosy theory systematically of Radix Rosa Davuricum was assayed for the first time.","chinese":"結果首次系統闡明瞭山刺玫根的生藥學理論。"},{"english":"The experimental results provide a scientific basis the rational use of Semen Cuscutae.","chinese":"實驗結果爲合理使用菟絲子類生藥提供了科學依據。"},{"english":"Once the task was accomplished, Goddess of Western Heaven rewarded the archer with a pill that would make him immortal.","chinese":"任務完成後，西天的上帝將給弓箭手長生藥。"},{"english":"Objective To study the pharmacognostic character of Herba Agriophylli.","chinese":"目的對蒙藥材沙蓬進行生藥學研究。"},{"english":"OBJECTIVE To develop the identification method of Trapa manshurica Fler.","chinese":"目的探索東北菱的生藥組織學鑑別方法。"},{"english":"Objective:To study the pharmacognosy of Pongamia pinnata(L. )Merr. Systematically.","chinese":"目的對水黃皮進行系統的生藥學研究。"},{"english":"Objective To study pharmacognosy of wild Glycyrrhiza aspera Pall.","chinese":"目的對吉爾吉斯斯坦野生粗毛甘草進行生藥學研究。"}],"related":[]}