{"definition":["to dazzle\/to brighten up (a room etc)"],"pinyin":["sheng1 hui1"],"simplified":["生辉"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"生輝","characters":[{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"},{"definition":["splendor\/to shine upon"],"pinyin":["hui1"],"word":"輝"}],"containing_words":[{"definition":["Your presence brings light to my humble dwelling\/see also 蓬蓽生光|蓬荜生光[peng2 bi4 sheng1 guang1]"],"pinyin":["peng2 bi4 sheng1 hui1"],"word":"蓬蓽生輝"},{"definition":["resplendent"],"pinyin":["xu3 xu3 sheng1 hui1"],"word":"栩栩生輝"}],"sentences":[{"english":"Cedar columns flare at their base as they prop up the Douglas fir logs overhead.","chinese":"雪松柱熠熠生輝地在支撐着上方的花旗松原木。"},{"english":"And old instruments often have a history that adds to their lustre.","chinese":"而古舊樂器又有着一段歷史讓其熠熠生輝，錦上添花。"},{"english":"The lively call look unripe brightness, jin's call sedate and easy.","chinese":"活潑的叫顧盼生輝，矜特叫穩重大方。"},{"english":"All the legends have been great - they've all been brilliant with me.","chinese":"每個傳奇球星都是偉大的，他們讓我蓬蓽生輝。"},{"english":"The policy meaning of resuming college entrance examinations is still glistening.","chinese":"恢復高考的政策意義迄今依然熠熠生輝。"},{"english":"The light of humanity shines brightly on this quality grounding.","chinese":"在這片質感的底色之上，人文的性靈之光熠熠生輝。"},{"english":"Sparkling, bring u to the luxury world.","chinese":"璀燦生輝，帶你進入品位奢華生活世界。"},{"english":"The water was a deep blue and sunlight glittered on its looking glass-clear surface.","chinese":"湖水澄藍，波平如鏡，陽光照在湖上熠熠生輝。"},{"english":"Shop windows display of goods dazzling, brilliant.","chinese":"商店的櫥窗裏陳列的商品琳琅滿目，熠熠生輝。"},{"english":"It's shining in the winter sunshine today.","chinese":"在今天冬日的陽光裏它熠熠生輝。"},{"english":"Your coming brightened up the room.","chinese":"你的到來使這屋棚壁生輝。"},{"english":"Czech drilling imaginative decorations, shoes shine.","chinese":"捷克鑽匠心獨運裝飾，鞋子熠熠生輝。"},{"english":"Two spots of color brightened IT cheeks.","chinese":"臉頰上的兩片紅暈，使她滿面生輝。"},{"english":"You are the life of the party and your high confidence levels let you easily go up to hotties.","chinese":"你總是晚會的焦點而你的高度自信常使你熠熠生輝。"},{"english":"Unusual and creative beds that will make a great addition to any bedroom.","chinese":"與衆不同而又富有創意的牀會讓每個臥室都蓬蓽生輝。"},{"english":"I feel my limbs are made glorious by the touch of this world of life.","chinese":"我覺得我的四肢因受到生命世界的愛撫而熠熠生輝。"}],"related":[]}