{"definition":["auxin (plant growth hormone)"],"pinyin":["sheng1 zhang3 su4"],"simplified":["生长素"],"rank":48814.0,"normalized_rank":0.6829711919186267,"fraction":1.633489644585021e-7,"cumulative_fraction":0.9987776723990124,"word":"生長素","characters":[{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"},{"definition":["chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance","length\/long\/forever\/always\/constantly"],"pinyin":["chang2","zhang3"],"word":"長"},{"definition":["raw silk\/white\/plain, unadorned\/vegetarian (food)\/essence\/nature\/element\/constituent\/usually\/always\/ever"],"pinyin":["su4"],"word":"素"}],"containing_words":[],"sentences":[{"english":"These bars buds themselves also produce auxin .","chinese":"而這些葉芽本身也可以生成生長素。"},{"english":"Endogenous auxin, or indole-3-acetic acid (IAA), plays a central role during root induction in woody plants.","chinese":"生長素類物質在木本植物生根過程中發揮重要作用。"},{"english":"It is antagonistic to abscisic acid in abscission.","chinese":"在脫落過程中生長素與脫落酸有拮抗作用。"},{"english":"Hormones, especially auxins, are involved in the promotion of elongation.","chinese":"激素尤其是植物生長素可以促進細胞壁的延伸。"},{"english":"Ghrelin is produced mostly by cells in the stomach lining.","chinese":"胃促生長素主要由胃保護層的細胞產生。"},{"english":"Many plants may thrive in extra light but light also destroys auxin.","chinese":"許多植物可以茁壯成長，但額外光燈也摧毀了生長素。"},{"english":"You must be auxin, cause you are causing me to have rapid stem elongation.","chinese":"你一定是生長素，因爲你讓我的莖迅速的延長。"},{"english":"Cytokinin is known to have negative effects on denovo auxin-induced root formation.","chinese":"細胞分裂素對生長素誘導的根的形成具有負向作用。"},{"english":"Objective To study the effect of Chinese traditional medicine pilose antler growth factor on cell proliferation.","chinese":"目的研究鹿茸生長素對關節軟骨細胞增殖的影響。"},{"english":"The buds release this hormone down the plant stem.","chinese":"頂芽將生長素釋放至植株莖部。"}],"related":[]}