{"definition":["to bear (give birth)"],"pinyin":["chan3 xia4"],"simplified":["产下"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"產下","characters":[{"definition":["to give birth\/to reproduce\/to produce\/product\/resource\/estate\/property"],"pinyin":["chan3"],"word":"產"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[{"english":"She delivered twins at 5 P.M.","chinese":"她於下午5時產下孿生兒。"},{"english":"Female tigers in the wild can live up to 15 years averagely.","chinese":"野生雌虎的壽命大約是15年，平均能產下5窩虎仔。"},{"english":"Male boas were available to the boa mother and she had previously given birth to other snake litters by mating with males.","chinese":"她有雄伴，之前也曾通過交配產下其它小蛇。"},{"english":"Rain and cool temperature will kill many of the eggs the grasshoppers are laying today.","chinese":"雨水和冷涼的氣溫能破壞蝗蟲現在產下的許多卵。"},{"english":"Ichthyosaurs and other contemporary viviparous species, by contrast, gave birth to multiple offspring.","chinese":"相比之下，魚龍和其他現代胎生的物種產下多個幼崽。"},{"english":"To realize the value of nine months. Ask a monther who gave birth a still born.","chinese":"想要懂得九個月的價值，去問一位產下死嬰的母親。"},{"english":"In its lifetime, a female ladybug will lay as many as 2, 000 eggs.","chinese":"在雌性瓢蟲的一生中將產下多達2000枚的卵。"},{"english":"The hybrid child of a murderous utopia and a disenchanted époque.","chinese":"血腥兇殘的烏托邦和幻滅的時代產下了混血兒。"},{"english":"My dog slipped its whelps.","chinese":"我的狗產下一窩不足月的狗仔。"},{"english":"The breeding pair and any offspring are the property of China.","chinese":"這對繁殖後代的熊貓及其產下的幼崽都歸中國所有。"},{"english":"Soon she becomes pregnant and births an illegitimate girl .","chinese":"沒多久珍妮懷了孕，產下一非婚生的小女兒。"},{"english":"The second largest mare has just given birth to a foal.","chinese":"第二大的母驢剛剛產下一隻小驢。"},{"english":"She gave birth to a girl last night.","chinese":"她昨晚產下一個女孩。"},{"english":"His baby girl was conceived through artificial insemination using donor sperm and Beatie's own eggs.","chinese":"用捐贈者的精子和比提的卵子經過人工授精產下女嬰。"},{"english":"In a patch of velvety moss, a black snake, called a racer, leaves her eggs.","chinese":"在一團毛絨絨的的苔蘚裏，美洲黑蛇產下了卵。"},{"english":"Next to the woman is a dragon that is ready to devour the child she is giving birth to.","chinese":"在女人身邊有一條戾龍正準備吞下她將要產下的嬰兒。"}],"related":[]}