{"definition":["in order to\/so as to"],"pinyin":["yong4 yi3"],"simplified":["用以"],"rank":10460.0,"normalized_rank":0.14634897094007526,"fraction":0.000007689663450206001,"cumulative_fraction":0.9333680380835372,"word":"用以","characters":[{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"},{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"}],"containing_words":[],"sentences":[{"english":"Remove spring clip securing bulb to fog lamp .","chinese":"拆卸用以固定燈泡至霧燈的彈簧夾子。"},{"english":"Here are few examples to illustrate this principle .","chinese":"略舉數例，用以說明這一原理。"},{"english":"Breadcrumbs are an indication of the customer’s location within your site.","chinese":"當前位置導航欄是用以指示客戶在網站中的位置。"},{"english":"These projects are named to match the corresponding package names.","chinese":"這些項目起的名字用以匹配相應的包名。"},{"english":"Drink hot soup or a large number of drinking water, with dilutes alcohol concentration.","chinese":"多喝熱湯或大量飲用開水，用以沖淡酒精的濃度。"},{"english":"THE fundamental constants of physics are the numbers that describe just how strong the forces of nature are.","chinese":"物理學的基本常數，是用以描述自然中力的強度的量。"},{"english":"Which of the following answer is correct to express the value 8 in octal number?","chinese":"下面的哪些答案可以用以表示八進制值8。"},{"english":"Some plant gums are used in the manufacture of cosmetics.","chinese":"某些植物樹膠用以製造化妝品。"},{"english":"Globalisation is a catch-all to describe increased international trade.","chinese":"“全球化”是個泛稱，用以描述增進了的的國際貿易。"},{"english":"The poles are to be inserted into the rings so they will be on two sides of the altar when it is carried.","chinese":"這貢要穿在壇兩旁的環子內，用以擡壇。"},{"english":"I think I would ask for a compass, which always points north, to help find direction.","chinese":"我認爲需要一個指南針，用以辨別方向。"},{"english":"Use the vendor for some hands-on training and mentoring to ramp up quickly.","chinese":"利用廠商進行一些內行培訓和諮詢，用以快速掌握。"},{"english":"The fuel tank is used to store fuel oil.","chinese":"燃油箱用以儲存燃油。"},{"english":"Preparation and Property of Desiccants Which are Made from Natural Material;","chinese":"原材料指用以生產工業品的天然物質。"},{"english":"Apraxia is a collective term used to describe impairment in carrying out purposeful movements.","chinese":"失用用以描述各種目的性運動障礙。"},{"english":"In the fourth year all its fruit will be holy, an offering of praise to the Lord .","chinese":"但第四年所結的果子全要成爲聖，用以讚美耶和華。"}],"related":[{"definition":["use in\/use on\/use for"],"pinyin":["yong4 yu2"],"word":"用于"},{"definition":["to be used for"],"pinyin":["yong4 lai2"],"word":"用來"},{"definition":["with this\/thereby\/thus\/because of this"],"pinyin":["yi3 ci3"],"word":"以此"},{"definition":["to use for the purpose of\/to serve as"],"pinyin":["yong4 zuo4"],"word":"用作"},{"definition":["in addition\/moreover\/(used before a disyllabic verb to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["jia1 yi3"],"word":"加以"},{"definition":["so that\/so as to\/in order to"],"pinyin":["yi3 bian4"],"word":"以便"},{"definition":["in common usage"],"pinyin":["chang2 yong4"],"word":"常用"},{"definition":["easy to\/convenient for"],"pinyin":["bian4 yu2"],"word":"便於"},{"definition":["to borrow sth for another use\/to borrow an idea for one's own use"],"pinyin":["jie4 yong4"],"word":"借用"},{"definition":["necessary (for)\/required"],"pinyin":["suo3 xu1"],"word":"所需"},{"definition":["using this as a pretext\/thereby"],"pinyin":["jie4 ci3"],"word":"藉此"},{"definition":["external part\/external"],"pinyin":["wai4 bu4"],"word":"外部"},{"definition":["special\/specific\/designated\/particular"],"pinyin":["te4 ding4"],"word":"特定"},{"definition":["to draw support from\/with the help of"],"pinyin":["jie4 zhu4"],"word":"借助"},{"definition":["in order to\/hoping to\/attempting to\/waiting for"],"pinyin":["yi3 qi1"],"word":"以期"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"}]}