{"definition":["needed\/to come in useful"],"pinyin":["yong4 de5 shang4"],"simplified":["用得上"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"用得上","characters":[{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["on top\/upon\/above\/upper\/previous\/first (of multiple parts)\/to climb\/to get onto\/to go up\/to attend (class or university)","see 上聲|上声[shang3 sheng1]"],"pinyin":["shang3","shang4"],"word":"上"}],"containing_words":[],"sentences":[{"english":"This little present is for you as a token of our love. We hope you can use it.","chinese":"送你這個小禮物，聊表我心意，希望你能用得上。"},{"english":"Yeah. I think it’s applied at home, though.","chinese":"是的，我認爲它在家裏用得上。"},{"english":"An administrative abstrusearial position wactuality advice abilities and a affable attitude against humans will be assets.","chinese":"行政祕書的職務，用得上交際技能和與人爲善的立場。"},{"english":"The issue is whether there are any ideas so good today that they will survive into the future.","chinese":"問題在於今天這麼多好點子能不能在將來用得上。"},{"english":"I'll keep your suggestion in mind for the future.","chinese":"我會記住你的建議，將來也許用得上。"},{"english":"Do you use English in your work?","chinese":"你工作用得上英語嗎？"},{"english":"Then she programs possible moves that I can use if a new situation arises.","chinese":"然後她把我在新情況下可能用得上的動作也編出程序。"},{"english":"When they're useful, they're very useful.","chinese":"可以說，當它們用得上的時候，就會非常有用。"}],"related":[]}