{"definition":["username\/user ID"],"pinyin":["yong4 hu4 ming2"],"simplified":["用户名"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"用戶名","characters":[{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"},{"definition":["a household\/door\/family"],"pinyin":["hu4"],"word":"戶"},{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"}],"containing_words":[],"sentences":[{"english":"Data security by providing support for username and password authentication and for digital certificates.","chinese":"通過支持用戶名和密碼認證以及數字證書的數據安全。"},{"english":"Moreover, it only matches user names of exactly eight characters.","chinese":"而且，它只匹配恰好八個字符的用戶名。"},{"english":"Suppose that the application authenticates a user given a user name and password.","chinese":"假設這個應用軟件鑑定了一個特定的用戶名和密碼。"},{"english":"The user name and password combo provide a point of weakness.","chinese":"用戶名和密碼的組合帶來了一個弱點。"},{"english":"A username identifies you on WikiDoc.","chinese":"用戶名用於識別您的身份。"},{"english":"The author posts using the \" yak \" username.","chinese":"作者員額用“犛牛”的用戶名。"},{"english":"Of course, username and password-based accounts have to be managed as well.","chinese":"當然，基於用戶名和密碼的帳戶也必須進行管理。"},{"english":"Provide a valid password for the username.","chinese":"爲這個用戶名提供有效的密碼。"},{"english":"Requires operator to re-enter user name and password before an action is taken.","chinese":"運營商需要重新輸入用戶名和密碼之前採取行動。"},{"english":"Enter the user name you want to run the application as here.","chinese":"在此輸入您想要以何用戶名的身份運行此應用程序。"},{"english":"I discovered that the user names would still be on the page but hidden. So I did a right click on the page and clicked on View Source","chinese":"我發現用戶名仍然在頁面上不過是隱藏的。"},{"english":"Chongzhi Please enter the user name, card number and password.","chinese":"請輸入衝值的用戶名，卡號和密碼。"},{"english":"If you're like me, you own many identifiers or userids.","chinese":"如果您像我一樣，會擁有很多標識符或用戶名。"},{"english":"My username is the name of a prophetess in Norse mythology.","chinese":"我的用戶名是名稱的先知在北歐神話。"},{"english":"All you need is to fill in a form and remember the user name and the password.","chinese":"只需填個表格，然後記住用戶名和密碼就可以了。"},{"english":"Does not allow use of non-mainstream user name.","chinese":"不允許使用非主流用戶名。"}],"related":[]}