{"definition":["user interface"],"pinyin":["yong4 hu4 jie4 mian4"],"simplified":["用户界面"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"用戶界面","characters":[{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"},{"definition":["a household\/door\/family"],"pinyin":["hu4"],"word":"戶"},{"definition":["boundary\/scope\/extent\/circles\/group\/kingdom (taxonomy)"],"pinyin":["jie4"],"word":"界"},{"definition":["face\/side\/surface\/aspect\/top\/classifier for flat surfaces such as drums, mirrors, flags etc"],"pinyin":["mian4"],"word":"面"}],"containing_words":[{"definition":["graphical user interface (GUI)"],"pinyin":["tu2 xing2 yong4 hu4 jie4 mian4"],"word":"圖形用戶界面"}],"sentences":[{"english":"The Research and Application of User Interface in CAID System;","chinese":"用戶界面旋鈕型的直觀且易於使用。"},{"english":"One major concern for a rich user interface is layout management.","chinese":"對於富用戶界面，一個重要的方面就是佈局管理。"},{"english":"New features include equalisation technology and a user-friendly interface.","chinese":"新功能包括均衡技術，以及友好的用戶界面。"},{"english":"We accomplished this by completely separating the data from the user interface.","chinese":"我們通過將數據與用戶界面分離來實現該目的。"},{"english":"You can follow one of any number of processes in designing the user interface.","chinese":"在大量用戶界面設計流程中可以任意挑選一個來遵循。"},{"english":"I do not merely mean a nice user interface with friendly buttons.","chinese":"我不僅僅指帶有友好按鈕的漂亮用戶界面。"},{"english":"Re-customize the user interface.","chinese":"重新定製用戶界面。"},{"english":"You will be impressed by the easiness and simplicity of user's interface.","chinese":"你會對該軟件舒適且簡單的用戶界面留下深刻的印象。"},{"english":"Which user interface environment do they use?","chinese":"它們使用哪個用戶界面環境？"},{"english":"Also, links that appear in the user interface are italicized .","chinese":"同時，在用戶界面中的鏈接也使用了斜體字。"},{"english":"The setup is basically the same, but the user interface has been tailored to fit better into the mobile user experience.","chinese":"但用戶界面經過調整以更好的適應移動用戶體驗。"},{"english":"User interface elements are normally hierarchic.","chinese":"用戶界面元素通常是分級的。"},{"english":"Start the debugger user interface on the client machine.","chinese":"啓動客戶端機器上的調試器用戶界面。"},{"english":"Specifically, the design of user interfaces in software.","chinese":"特別是軟件中的用戶界面設計。"},{"english":"One of the Powerset innovations is surfacing of semantics to the user interface.","chinese":"powerset創新之一是語義表面化於用戶界面。"},{"english":"In the instantaneous profile gauge system, user interface is an important part.","chinese":"凸度儀系統中，用戶界面是一重要組成部分。"}],"related":[]}