{"definition":["from this, it can be seen that..."],"pinyin":["you2 ci3 ke3 jian4"],"simplified":["由此可见"],"rank":9448.0,"normalized_rank":0.13218977795811004,"fraction":0.000009102434922975779,"cumulative_fraction":0.9249219576929372,"word":"由此可見","characters":[{"definition":["to follow\/from\/it is for...to\/reason\/cause\/because of\/due to\/to\/to leave it (to sb)\/by (introduces passive verb)"],"pinyin":["you2"],"word":"由"},{"definition":["this\/these"],"pinyin":["ci3"],"word":"此"},{"definition":["can\/may\/able to\/to approve\/to permit\/to suit\/(particle used for emphasis) certainly\/very","see 可汗[ke4 han2]"],"pinyin":["ke3","ke4"],"word":"可"},{"definition":["to appear\/also written 現|现[xian4]","to see\/to meet\/to appear (to be sth)\/to interview"],"pinyin":["jian4","xian4"],"word":"見"}],"containing_words":[],"sentences":[{"english":"From the above-mentioned story we can see that Mencius mother realized the importance of environment for children's development.","chinese":"由此可見，孟母深知環境對孩子成長的影響。"},{"english":"Thus prepositional logic can only expressparts of the logic rules.","chinese":"由此可見，命題邏輯只反映了一部分邏輯規律。"},{"english":"That's why Yu-Fu Era is considered as the transfer time of ancient Shu.","chinese":"由此可見魚鳧時代爲古蜀社會轉型期。"},{"english":"This shows, gesso building materials not only performance is good, also be green building materials.","chinese":"由此可見，石膏建材不僅性能好，也是綠色建材。"},{"english":"This shows, the sort that does not cause next lumbago diseases with the crowd is different.","chinese":"由此可見，不同人羣導致下腰痛疾病的種類不同。"},{"english":"Thus it can be seen that Shangguan Wan'er was quite an influential poet in the early Tang Dynasty.","chinese":"由此可見，上官婉兒在初唐詩壇是有一定影響的詩人。"},{"english":"Therefore, FLS are crucial effector in joint inflammation and destruction.","chinese":"由此可見，FLS是關節炎症和破壞的主要效應細胞。"},{"english":"It will take something very special to avoid relegation.","chinese":"由此可見，要想避免降級，萊切得好好費些思量。"},{"english":"This tragic brutal bet, bet without lost on the battlefield.","chinese":"由此可見賭之悲慘，賭之殘酷毫不輸於戰場殺敵。"},{"english":"So the magnetic mirror parameters have significant effect on the ion energy distributions.","chinese":"由此可見，磁鏡場參數對離子能量分佈有很大影響。"},{"english":"Thus it can be seen that dragon formation have close relationships with worship of water deity.","chinese":"由此可見，龍的形成與水神崇拜密切相關。"},{"english":"Thus, by the relationship between the people always retain the Xiasheng down.","chinese":"由此可見，靠關係留住人始終都是落了下乘。"},{"english":"Fig4. Therefore, should be inverse ratio btw IQ and happiness.","chinese":"由此可見，智商和快樂成反比。"},{"english":"Thus, the richness of its literature life, rather to be examined.","chinese":"由此可見，其藝文生命的豐富性頗值得探究。"},{"english":"This shows that discipline class adviser's work is \"working in the contemporary era and Benefit future generations.\"","chinese":"由此可見，班主任的工作“功在當代，利在千秋。”"},{"english":"China has become a country of old type population.","chinese":"由此可見，我國開始步入了老年型人口國家的行列。"}],"related":[]}