{"definition":["tortoise shell and animal bones used in divination\/oracle bone inscriptions (an early form of Chinese script)"],"pinyin":["jia3 gu3"],"simplified":["甲骨"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"甲骨","characters":[{"definition":["first of the ten Heavenly Stems 十天干[shi2 tian1 gan1]\/(used for an unspecified person or thing)\/first (in a list, as a party to a contract etc)\/letter \"A\" or roman \"I\" in list \"A, B, C\", or \"I, II, III\" etc\/armor plating\/shell or carapace\/(of the fingers or toes) nail\/bladed leather or metal armor (old)\/ranking system used in the Imperial examinations (old)\/civil administration unit in the baojia 保甲[bao3 jia3] system (old)\/ancient Chinese compass point: 75°"],"pinyin":["jia3"],"word":"甲"},{"definition":["bone"],"pinyin":["gu3"],"word":"骨"}],"containing_words":[{"definition":["oracle script\/oracle bone inscriptions (an early form of Chinese script)"],"pinyin":["jia3 gu3 wen2"],"word":"甲骨文"},{"definition":["oracle script\/oracle bone character (an early form of Chinese script)"],"pinyin":["jia3 gu3 wen2 zi4"],"word":"甲骨文字"},{"definition":["turbinate\/nasal concha"],"pinyin":["bi2 jia3 gu3"],"word":"鼻甲骨"}],"sentences":[{"english":"But these are products that Oracle sells.","chinese":"但這些都是甲骨文公司銷售的產品。"},{"english":"There has been no other contact with Oracle since then.","chinese":"從那以後，我們和甲骨文再沒有任何接觸。"},{"english":"The original characters are Oracle, popular in the Shang period.","chinese":"最初的漢字是甲骨文，盛行於殷商時期。"},{"english":"Oracle inscriptions are pictographs.","chinese":"甲骨文是象形文字。"},{"english":"In terms of antitrust, Oracle also seems safe.","chinese":"在反托拉斯方面甲骨文似乎也是安全的。"},{"english":"He had served as chief technology officer of Oracle's client software group.","chinese":"高斯林曾擔任甲骨文客戶軟件部的首席技術官。"},{"english":"The question is: what exactly does the cloud mean to Oracle?","chinese":"問題是，雲究竟對於甲骨文公司意味着什麼？"},{"english":"Outside the bronze inscription, he also involves Oracle study.","chinese":"金文之外，孫氏又涉及甲骨文研究。"},{"english":"Oracle and Microsoft were both born in difficult economic times.","chinese":"甲骨文和微軟恰恰就是產生在經濟低谷期。"},{"english":"Oracle should be the first to write with a brush, then use the weapon carved.","chinese":"甲骨文也應該是先用毛筆寫出，然後再用利器刻出的。"},{"english":"The symbols inscribed on pottery earlier than the Shang Dynasty bear resemblance to the Shang oracles.","chinese":"夏商以前的陶紋刻符與商代的甲骨文有相似之處。"},{"english":"But HP and Oracle reaffirmed a commitment to their partnership on Monday.","chinese":"但是，週一惠普和甲骨文重申他們的夥伴關係。"},{"english":"These writings are  incisions on bones and tortoise shell.","chinese":"這些文字均爲甲骨雕文。"},{"english":"Simplified Chinese characters from Oracle to the evolutionary history of a continuous and verifiable.","chinese":"簡體字來自於連續可證明的甲骨文的進化史。"},{"english":"In Village South Series, identical soothsaying texts on Oracle Bones in Lizu and Wumingzu have different traits.","chinese":"屯南系列甲骨卜辭中歷組和無名組同文卜辭各具特點。"},{"english":"The oracle bones from South of Xiaotun Locus were first discovered scientifically in 1973 since the founding of New China.","chinese":"小屯南地甲骨是新中國第一批科學發掘的甲骨。"}],"related":[{"definition":["oracle script\/oracle bone character (an early form of Chinese script)"],"pinyin":["jia3 gu3 wen2 zi4"],"word":"甲骨文字"},{"definition":["oracle bone\/bone used for divination, esp. animal scapula"],"pinyin":["bu3 gu3"],"word":"卜骨"},{"definition":["rubbings from a tablet"],"pinyin":["ta4 pian4"],"word":"拓片"},{"definition":["inscription in bronze\/bell-cauldron inscription"],"pinyin":["jin1 wen2"],"word":"金文"},{"definition":["oracle inscriptions of the Shang Dynasty (16th-11th century BC) on tortoiseshells or animal bones"],"pinyin":["bu3 ci2"],"word":"卜辭"},{"definition":["bamboo slip used for record keeping during the Han Dynasty"],"pinyin":["Han4 jian3"],"word":"漢簡"},{"definition":["early form of Chinese characters inscribed in stone, a precursor of the small seal 小篆[xiao3 zhuan4]"],"pinyin":["shi2 gu3 wen2"],"word":"石鼓文"},{"definition":["the great seal\/used narrowly for 籀文\/used broadly for many pre-Qin scripts"],"pinyin":["da4 zhuan4"],"word":"大篆"},{"definition":["bronze implement\/refers to ancient bronze artifacts, from c. 2,000 BC"],"pinyin":["qing1 tong2 qi4"],"word":"青銅器"},{"definition":["to read and interpret ancient texts\/to decipher"],"pinyin":["shi4 du2"],"word":"釋讀"},{"definition":["ritual objects\/sacral vessels"],"pinyin":["yi2 qi4"],"word":"彞器"},{"definition":["Yinxu, ruins of Yinshang 殷商 city at Anyang 安陽|安阳 in Henan province, a World Heritage site"],"pinyin":["Yin1 xu1"],"word":"殷墟"},{"definition":["bamboo writing slips in ancient times (joined together to form whole scrolls)"],"pinyin":["zhu2 jian3"],"word":"竹簡"},{"definition":["pictogram\/hieroglyph"],"pinyin":["xiang4 xing2 wen2 zi4"],"word":"象形文字"},{"definition":["carving in bone"],"pinyin":["gu3 ke4"],"word":"骨刻"},{"definition":["oracle tortoise shell"],"pinyin":["bu3 jia3"],"word":"卜甲"}]}