{"definition":["to shrink back in fear (idiom); too cowardly to advance"],"pinyin":["wei4 suo1 bu4 qian2"],"simplified":["畏缩不前"],"rank":56131.0,"normalized_rank":0.7853455150896143,"fraction":7.138305953548483e-8,"cumulative_fraction":0.9995996179662202,"word":"畏縮不前","characters":[{"definition":["to fear"],"pinyin":["wei4"],"word":"畏"},{"definition":["to withdraw\/to pull back\/to contract\/to shrink\/to reduce\/abbreviation\/also pr. [su4]"],"pinyin":["suo1"],"word":"縮"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["front\/forward\/ahead\/first\/top (followed by a number)\/future\/ago\/before\/BC (e.g. 前293年)\/former\/formerly"],"pinyin":["qian2"],"word":"前"}],"containing_words":[],"sentences":[{"english":"The big boys jumped into the river but little Ned hung back.","chinese":"大些的男孩子都跳進河裏了，但小內德畏縮不前。"},{"english":"German banks are balking at writing off Greek debt.","chinese":"德國各家銀行在勾銷希臘債務方面畏縮不前。"},{"english":"The dog cringed at the sight of the whip.","chinese":"狗見了鞭子畏縮不前。"},{"english":"Did we brave all then to falter now?","chinese":"當時我們英勇奮鬥，今天卻要畏縮不前嗎？"},{"english":"The big boys jumped into the river, but little Ned hung back.","chinese":"大些的男孩都跳下河了，但小內德畏縮不前。"},{"english":"Have you ever held back on doing something because you were afraid of failure?","chinese":"你是否曾因爲害怕失敗而畏縮不前？"},{"english":"Thou wilt not cower in the dust.","chinese":"你不會含屈忍辱畏縮不前。"},{"english":"He said he could swim, but he backed down when we got to the lake.","chinese":"他說他會泅水，但是等咱們到了湖邊他卻畏縮不前了。"},{"english":"The dog cringed at the sight of a snake.","chinese":"那條狗看見了一條蛇便畏縮不前。"},{"english":"The coward quai- led before the enemy.","chinese":"這個懦夫在敵人面前畏縮不前。"},{"english":"He always funked when competition grew too keen.","chinese":"在競爭太激烈時他總是畏縮不前。"},{"english":"He cowered when he saw all of the TV cameras.","chinese":"看到了四周的電視攝像機，他有些畏縮不前。"},{"english":"Follow your heart. It's wiser than you think. And for God's sake don't be scared.","chinese":"跟隨着心的方向，不要畏縮不前，這纔是明智的做法。"},{"english":"We can't afford to have anyone in this enterprise who is likely to turn yellow when the testing-time comes.","chinese":"我們的企業不能僱用在考驗關頭可能畏縮不前的人。"},{"english":"The coward quailed before the enemy.","chinese":"這個懦夫在敵人面前畏縮不前。"}],"related":[]}