{"definition":["to ask sb to stay\/to keep sb for the night\/to await (classical)"],"pinyin":["liu2 zhu4"],"simplified":["留住"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"留住","characters":[{"definition":["to leave (a message etc)\/to retain\/to stay\/to remain\/to keep\/to preserve"],"pinyin":["liu2"],"word":"留"},{"definition":["to live\/to dwell\/to stay\/to reside\/to stop\/(suffix indicating firmness, steadiness, or coming to a halt)"],"pinyin":["zhu4"],"word":"住"}],"containing_words":[],"sentences":[{"english":"Retain the most memorable kiss, kissing the man failed to keep.","chinese":"留住了最刻骨銘心的吻，留不住接吻的那個人。"},{"english":"ShangHeng saw her carrying luggage, managed to keep her.","chinese":"尚恆看見她帶着行李，設法留住她。"},{"english":"As a kind of oil, it is surprisingly water-soluble and can be thoroughly wash off with water.","chinese":"沒有緊繃感，並能留住滋潤，讓洗臉也變成一種享受。"},{"english":"We have to retain our best customer. We have to be there.","chinese":"我們必須獲得那份銷售合同，留住最好的客戶。"},{"english":"A great recommendation system can retain and attract users to the service.","chinese":"一個好的推薦系統能夠爲這項服務留住並且吸引用戶。"},{"english":"After jalam injury and have to be apart, can reach wei forced to keep her.","chinese":"雅蘭傷好後又要分開，可達偉強行留住了她。"},{"english":"Keeping current club members is just as important as bringing in new ones, Dochterman said.","chinese":"留住現有的社員與引進新社員同等重要，陶德曼說。"},{"english":"Step away from that cookie if you want to keep your boyfriend, ladies.","chinese":"女人們，要想留住自己的男朋友，就離小甜餅遠點吧。"},{"english":"Boxed and terraced planters retain more root moister and nutrients.","chinese":"盒裝和梯田種植留住更多的根潮溼和養分。"},{"english":"From that day Saul kept David with him and did not let him return to his father's house.","chinese":"那日掃羅留住大衛，不容他再回父家。"},{"english":"For some reason, I can not condone my own to keep you.","chinese":"爲了某種原因，我不能緃容自己留住你。"},{"english":"Thus, by the relationship between the people always retain the Xiasheng down.","chinese":"由此可見，靠關係留住人始終都是落了下乘。"},{"english":"Learn to give up some dreams wished to keep.","chinese":"學會放棄時有些夢希望能留住。"},{"english":"The abdominal ability tarry that still is an evenness is beautiful.","chinese":"還是一個平坦的腹部才能留住漂亮。"},{"english":"Grab your gun and fire into them. You keep one next the bed for this very reason?","chinese":"抄起你的槍向他射擊，留住他的命在在牀邊問他緣由？"},{"english":"Can London keep these young people in London with enough funding and advise.","chinese":"倫敦真能用足夠的資金和遊說留住這些年輕人嗎？"}],"related":[{"definition":["to move (to pity)\/arousing (sympathy)\/touching"],"pinyin":["da3 dong4"],"word":"打動"},{"definition":["to carry\/to take away"],"pinyin":["dai4 zou3"],"word":"帶走"},{"definition":["to want to\/to feel like\/to fancy\/to care for sb\/desirous of"],"pinyin":["xiang3 yao4"],"word":"想要"},{"definition":["old variant of 留[liu2]"],"pinyin":["liu2"],"word":"畱"},{"definition":["to yield\/to permit\/to let sb do sth\/to have sb do sth\/to make sb (feel sad etc)\/by (indicates the agent in a passive clause, like 被[bei4])"],"pinyin":["rang4"],"word":"讓"},{"definition":["to think\/to believe\/to suppose\/to wish\/to want\/to miss (feel wistful about the absence of sb or sth)"],"pinyin":["xiang3"],"word":"想"},{"definition":["to leave behind\/to stay behind\/to remain\/to keep\/not to let (sb) go"],"pinyin":["liu2 xia4"],"word":"留下"},{"definition":["to depart\/to leave"],"pinyin":["li2 kai1"],"word":"離開"},{"definition":["to give up\/to abandon\/to abort"],"pinyin":["she3 qi4"],"word":"捨棄"},{"definition":["to grab\/to capture"],"pinyin":["zhua1 zhu4"],"word":"抓住"},{"definition":["to set aside for"],"pinyin":["liu2 gei3"],"word":"留給"},{"definition":["to retrieve\/to redeem"],"pinyin":["wan3 hui2"],"word":"挽回"},{"definition":["to raise salary"],"pinyin":["jia1 xin1"],"word":"加薪"},{"definition":["to leave\/to exit"],"pinyin":["li2 qu4"],"word":"離去"},{"definition":["to see off\/to send off"],"pinyin":["song4 zou3"],"word":"送走"},{"definition":["to give up\/to part with"],"pinyin":["ge1 she3"],"word":"割捨"}]}