{"definition":["to set aside for"],"pinyin":["liu2 gei3"],"simplified":["留给"],"rank":5857.0,"normalized_rank":0.08194702894799434,"fraction":0.000019150366935136296,"cumulative_fraction":0.8772970116601931,"word":"留給","characters":[{"definition":["to leave (a message etc)\/to retain\/to stay\/to remain\/to keep\/to preserve"],"pinyin":["liu2"],"word":"留"},{"definition":["to supply\/to provide","to\/for\/for the benefit of\/to give\/to allow\/to do sth (for sb)\/(grammatical equivalent of 被)\/(grammatical equivalent of 把)\/(sentence intensifier)"],"pinyin":["gei3","ji3"],"word":"給"}],"containing_words":[],"sentences":[{"english":"What kind of government will bel behind for his successor?","chinese":"他將留給後任一個什麼樣的政府呢？"},{"english":"This, it appears, is the legacy I have received and have now bequeathed to my own child.","chinese":"而這，正是我已收到並留給自己孩子的遺產。"},{"english":"It is a paper that those gentlemen left for these ladies.","chinese":"這是那幾位先生留給太太們的一張條子。"},{"english":"The only option left with me was to ask her to go the airport for getting her ticket re-scheduled.","chinese":"留給我的唯一選項就是叫她去機場重新預訂機票。"},{"english":"I always stick to be virginity to present the man who I will live together throughout my life.","chinese":"總是守着着份貞操留給和自己一輩子的男人。"},{"english":"Mother's old-fashioned quartz watch was inherited from my grandmother.","chinese":"老式石英錶是姥姥留給她的。"},{"english":"Many others will be filled by “retired” army officers.","chinese":"另有許多席位留給了“退役的”軍職人員。"},{"english":"He's frittered away the money his father left him.","chinese":"他揮霍掉了父親留給他的錢財。"},{"english":"The majority of users are mine production dispatching users except a few administrative users.","chinese":"除少數行政用戶外外，大部分留給礦生產調度用戶。"},{"english":"Vargas emptied his tool bag and left the bag with the Indian.","chinese":"瓦格斯騰出自己的工具袋，把它留給印第安人。"},{"english":"In the meantime, I'll leave this info literature with you.","chinese":"那我現在就把這些書面資料留給你。"},{"english":"He left his Montana ranch to his spinster sister.","chinese":"他把他在蒙大拿州的大牧場留給了他未婚妹妹。"},{"english":"You are left with the holes in your sink and the supply tubes waiting for the new faucet.","chinese":"您留給在您的水槽和等待新的龍頭的供應管的孔。"},{"english":"Leaving Harry an old Snitch – what the hell was that about?","chinese":"留給哈利一箇舊的金色小賊，幹什麼用呀？"},{"english":"The seats are reserved for old and sick people.","chinese":"這些座位是留給老弱病殘。"},{"english":"She soon made off with the fortune which she had gained when his father died.","chinese":"她很快就把她父親死時留給她的遺產花光了。"}],"related":[]}