{"definition":["sketch\/sketch map\/thumbnail picture"],"pinyin":["lu:e4 tu2"],"simplified":["略图"],"rank":43333.0,"normalized_rank":0.6062848907979237,"fraction":2.810069317092194e-7,"cumulative_fraction":0.9975878645259134,"word":"略圖","characters":[{"definition":["plan\/strategy\/outline\/summary\/slightly\/rather\/to rob\/to plunder\/to summarize\/to omit"],"pinyin":["lu:e4"],"word":"略"},{"definition":["diagram\/picture\/drawing\/chart\/map\/CL:張|张[zhang1]\/to plan\/to scheme\/to attempt\/to pursue\/to seek"],"pinyin":["tu2"],"word":"圖"}],"containing_words":[],"sentences":[{"english":"Here are the three steps of drawing a sketch map of Siu Sai Wan.","chinese":"以下是繪畫小西灣略圖的三個步驟。"},{"english":"The second function of your album is allowing the user to click on a thumbnail and get a blown-up version of the photo.","chinese":"相冊的第二項功能是允許用戶單擊縮略圖來查看全圖。"},{"english":"Set this option to show the file size below the image thumbnail.","chinese":"設定此選項以在圖像縮略圖下方顯示文件大小。"},{"english":"Aster and Hoban had their heads bent over a sketch for the battle account.","chinese":"埃斯特和胡班已經在埋頭搞一份附在戰報中的略圖。"},{"english":"The first thing I did with my picture collection was generate thumbnails.","chinese":"我對照片集所執行的第一個操作是生成縮略圖。"},{"english":"Thumbnail resize for images onn stories Front and Blog page.","chinese":"調整圖像的縮略圖歐恩故事陣線和博客網頁。"},{"english":"Set this option to show the filename below the image thumbnail.","chinese":"設定此選項以在圖像縮略圖下方顯示文件名稱。"},{"english":"Each of the thumbnails nodes need to be placed along with the node label in a coherent manner.","chinese":"需要使用一致的方式放置縮略圖節點和節點標籤。"},{"english":"This has led to an upswing in thumbnails that are both clever and usable.","chinese":"這些探討導致了縮略圖在智能和可用性方面大大增強。"},{"english":"If the user clicks a thumbnail, the image will expand to full size.","chinese":"如果用戶單擊一個縮略圖，就會完全展開該圖像。"},{"english":"You should now have a functioning pager that provides the user a list of thumbnails.","chinese":"現在有了一個可用的分頁器爲用戶提供一些縮略圖。"},{"english":"It then lays out a thumbnail of every image until it reaches every fifth image and starts a new row.","chinese":"然後放上每個圖片的縮略圖，每五張圖片作爲一行。"},{"english":"You might need to know how big to make the thumbnail from the previous example, for example.","chinese":"例如，您可能需要知道前一個示例中的縮略圖有多大。"},{"english":"Each thumbnail is linked to its full-sized image.","chinese":"每個縮略圖連接到它的全尺寸的圖象。"},{"english":"A Thumbnailer Plus control, can display thumbnails from most multimedia formats.","chinese":"非常好用的縮略圖控件，可以顯示多種格式的縮略圖。"},{"english":"A Thumbnailer Plus control, can display thumbnails from most multimedia formats.","chinese":"非常好用的縮略圖控件，可以顯示多種格式的縮略圖。"}],"related":[]}