{"definition":["(of siblings) having the same father but different mothers"],"pinyin":["yi4 mu3"],"simplified":["异母"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"異母","characters":[{"definition":["different\/other\/hetero-\/unusual\/strange\/surprising\/to distinguish\/to separate\/to discriminate"],"pinyin":["yi4"],"word":"異"},{"definition":["mother\/elderly female relative\/origin\/source\/(of animals) female"],"pinyin":["mu3"],"word":"母"}],"containing_words":[{"definition":["(of siblings) having the same father but different mothers\/half (brother or sister)"],"pinyin":["tong2 fu4 yi4 mu3"],"word":"同父異母"}],"sentences":[{"english":"And Ma as they are on is the half-sister of the snow is a challenge.","chinese":"和馬他們受到作爲月乃的同父異母的姐姐雪乃的挑戰。"},{"english":"One of David's sons raped his step-sister.","chinese":"大衛的一個兒子姦污了他同父異母的妹妹。"},{"english":"I was one of six children, with three more half-sisters, and our family was considered small.","chinese":"我家有6個孩子，還有三個同父異母的姐妹。"},{"english":"I was one of six children, with three more half-sisters.","chinese":"我是六個孩子之一，還有三個同父異母的姐妹。"},{"english":"I have deserted also his little half-sister .","chinese":"我遺棄了他的同父異母的小妹妹。"},{"english":"Now, Leung Puiyuk, half-blooded sister of Leung Yeuklam, is looking for Leung Yeuklam's three sons and their descendants.","chinese":"現同父異母的姐姐梁佩玉尋他們兄弟三人及其後人。"},{"english":"Her brother-german went abroad when he was 14years old.","chinese":"她的同父異母兄弟14歲出國了。"},{"english":"Ahmed Wali Karzai, the president's half-brother, is the city's main power-broker.","chinese":"伊，總統的同父異母兄弟，坎大哈的主要權力經紀人。"},{"english":"My half-brother,the Earl of Moray,tried to stop the marriage.","chinese":"我的同父異母兄弟，馬裏伯爵，試圖想阻止這場婚姻。"},{"english":"Freud had two half-brothers some 20 years older than himself.","chinese":"弗洛伊德有兩個約比他年長20歲的異母哥哥。"},{"english":"She and her baby, my half sister, slept in the front room.","chinese":"她和我那同父異母的小妹睡在前屋。"},{"english":"Also a half sister to Abraham on Terah his father's side.","chinese":"她也是亞伯拉罕同父異母的妹妹。"}],"related":[]}