{"definition":["opposite polarities attract\/(fig.) opposite sexes attract\/opposites attract"],"pinyin":["yi4 xing4 xiang1 xi1"],"simplified":["异性相吸"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"異性相吸","characters":[{"definition":["different\/other\/hetero-\/unusual\/strange\/surprising\/to distinguish\/to separate\/to discriminate"],"pinyin":["yi4"],"word":"異"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"},{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"},{"definition":["to breathe\/to suck in\/to absorb\/to inhale"],"pinyin":["xi1"],"word":"吸"}],"containing_words":[],"sentences":[{"english":"The adage 'opposites attract', holds true when you think of Virgo and Pisces compatibility.","chinese":"“異性相吸”很好的形容了處女座和雙魚座間的關係。"},{"english":"People say that \"opposites attract.\"","chinese":"人們說，“異性相吸”。"},{"english":"I guess it was a case of opposites attracting.","chinese":"我猜可能是異性相吸吧。"},{"english":"I guess it's true that \"opposites attract\"!","chinese":"我想異性相吸是對的。"},{"english":"Like charges repel, but opposite charges attract, which is one of the fundamental laws of electricity.","chinese":"電荷同性相斥，異性相吸，這是電的一個基本規律。"},{"english":"Like hydrogen and oxygen, for some couples, opposites attract.","chinese":"就像氫和氧，有些人成雙成對的緣故是因爲異性相吸。"},{"english":"When it comes to love, we're ambivalent about \"opposites attract\".","chinese":"說到愛情，我們對異性相吸懷有矛盾的看法。"},{"english":"This is why opposites attract.","chinese":"這就是異性相吸的原因所在。"}],"related":[{"definition":["henpecked male"],"pinyin":["qi1 guan3 yan2"],"word":"妻管嚴"},{"definition":["(coll.) womanizer\/skirt-chaser"],"pinyin":["hua1 xin1 da4 luo2 bo5"],"word":"花心大蘿蔔"},{"definition":["all crows are black (idiom)\/evil people are bad all over the world"],"pinyin":["tian1 xia4 wu1 ya1 yi1 ban1 hei1"],"word":"天下烏鴉一般黑"},{"definition":["lit. a good horse doesn't turn around and graze the same patch again (idiom)\/fig. once you've moved on, don't go back again (romantic relationship, job etc)\/leave the past behind"],"pinyin":["hao3 ma3 bu4 chi1 hui2 tou2 cao3"],"word":"好馬不吃回頭草"},{"definition":["Electra complex"],"pinyin":["lian4 fu4 qing2 jie2"],"word":"戀父情結"},{"definition":["vain"],"pinyin":["ai4 mu4 xu1 rong2"],"word":"愛慕虛榮"},{"definition":["nodding acquaintance"],"pinyin":["dian3 tou2 zhi1 jiao1"],"word":"點頭之交"},{"definition":["to patch up one's lie (when inconsistencies appear)\/to cover (for sb who has lied)"],"pinyin":["yuan2 huang3"],"word":"圓謊"},{"definition":["lit. rarely seen, very strange (idiom); to express amazement due to lack of experience\/naive expression of excitement due to ignorance"],"pinyin":["shao3 jian4 duo1 guai4"],"word":"少見多怪"},{"definition":["to ask a question, already knowing the answer"],"pinyin":["ming2 zhi1 gu4 wen4"],"word":"明知故問"},{"definition":["lit. to stand with each foot in a different boat (idiom)\/fig. to have it both ways\/to run after two hares\/(especially) to have two lovers at the same time"],"pinyin":["jiao3 ta4 liang3 tiao2 chuan2"],"word":"腳踏兩條船"},{"definition":["Every family goes through its problems. (idiom)"],"pinyin":["jia1 jia1 you3 ben3 nan2 nian4 de5 jing1"],"word":"家家有本難念的經"},{"definition":["to follow the path to one's own doom (idiom)\/to bring about one's own destruction"],"pinyin":["zi4 xun2 si3 lu4"],"word":"自尋死路"},{"definition":["marriage by capture\/bride kidnapping"],"pinyin":["qiang3 hun1"],"word":"搶婚"},{"definition":["to make a terrible scene (idiom)\/to throw a tantrum"],"pinyin":["yi1 ku1 er4 nao4 san1 shang4 diao4"],"word":"一哭二鬧三上吊"},{"definition":["alchemy"],"pinyin":["lian4 jin1 shu4"],"word":"煉金術"}]}