{"definition":["isomer (chemistry)"],"pinyin":["yi4 gou4 ti3"],"simplified":["异构体"],"rank":64577.0,"normalized_rank":0.9035160130398892,"fraction":1.7663292850293794e-8,"cumulative_fraction":0.9999464594938428,"word":"異構體","characters":[{"definition":["different\/other\/hetero-\/unusual\/strange\/surprising\/to distinguish\/to separate\/to discriminate"],"pinyin":["yi4"],"word":"異"},{"definition":["to construct\/to form\/to make up\/to compose\/literary composition\/paper mulberry (Broussonetia papyrifera)"],"pinyin":["gou4"],"word":"構"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[{"definition":["isomer (chemistry)"],"pinyin":["tong2 fen1 yi4 gou4 ti3"],"word":"同分異構體"},{"definition":["enantiomeric isomer (chemistry)"],"pinyin":["dui4 ying4 yi4 gou4 ti3"],"word":"對映異構體"},{"definition":["stereoisomer (chemistry)"],"pinyin":["li4 ti3 yi4 gou4 ti3"],"word":"立體異構體"}],"sentences":[{"english":"Isomers are defined as compounds having the same formula but different structures.","chinese":"異構體被定義爲化學式相同而結構不同的化合物。"},{"english":"The spectral patterns can be used to characterize the above stereoisomers.","chinese":"其譜態可作爲上述立體異構體的結構區分特徵。"},{"english":"Allene is an isomer of methyl acetylene.","chinese":"甲基乙炔的一種異構體。"},{"english":"This toxin is a class of monocyclic heptapeptides with many different isomerides.","chinese":"該毒素是一類具有多種異構體的環狀多肽物質。"},{"english":"Solvent took a significant effect on proportion between isomers of di-nitrated TPP.","chinese":"溶劑對二硝基TPP兩個異構體的比例有較大影響。"},{"english":"Special considerations necessary for stereochemical impurity investigations are also discussed.","chinese":"特別對於光學異構體相關物質的研究也進行了討論。"},{"english":"Finally, the theoretical hardness of high-density C3N4 polymorphs is predicted.","chinese":"最後，預測了高密度C3N4異構體的理論硬度。"},{"english":"Draw perspective formulas for the isomers of isoleucine.","chinese":"畫出異亮氨酸異構體的透視式。"},{"english":"Catechol was determined in the phenyl dihydroxide isomers by fluorophotometry.","chinese":"用熒光光度法測定苯二酚異構體中的鄰苯二酚。"},{"english":"Stereochemistry deals with stereoisomers and with asymmetric synthesis.","chinese":"立體化學研究立體異構體以及不對稱合成法。"},{"english":"Phenol and cresol isomers could be well separated in liquid crystal PBOB packed column.","chinese":"苯酚和甲酚異構體在液晶PBOB填充柱上分離良好。"},{"english":"Which isomer of carvone do you have?","chinese":"你所得到的香芹酮異構體是哪一種呢？"},{"english":"The palonosetron injection has the advantages of high stability and less isomer.","chinese":"本發明的帕洛諾司瓊注射液穩定性高，異構體減少。"},{"english":"In this pater the separation of the isomers of xylene by using the adsorption separation technology is discussed.","chinese":"論述了採用吸附分離技術分離二甲苯異構體。"},{"english":"CONCLUSION This observation also suggests that E-isomer has a stronger ability to quench radical than Z-isomer did.","chinese":"結論反式異構體淬滅羥自由基的能力比順式異構體強。"},{"english":"CONCLUSION This observation also suggests that E-isomer has a stronger ability to quench radical than Z-isomer did.","chinese":"結論反式異構體淬滅羥自由基的能力比順式異構體強。"}],"related":[]}