{"definition":["isomeric (chemistry)"],"pinyin":["yi4 gou4"],"simplified":["异构"],"rank":44052.0,"normalized_rank":0.6163446336378773,"fraction":2.6159190733658245e-7,"cumulative_fraction":0.9977827598394496,"word":"異構","characters":[{"definition":["different\/other\/hetero-\/unusual\/strange\/surprising\/to distinguish\/to separate\/to discriminate"],"pinyin":["yi4"],"word":"異"},{"definition":["to construct\/to form\/to make up\/to compose\/literary composition\/paper mulberry (Broussonetia papyrifera)"],"pinyin":["gou4"],"word":"構"}],"containing_words":[{"definition":["isomer (chemistry)"],"pinyin":["tong2 fen1 yi4 gou4 ti3"],"word":"同分異構體"},{"definition":["isomer (chemistry)"],"pinyin":["yi4 gou4 ti3"],"word":"異構體"},{"definition":["isomerism (chemistry)"],"pinyin":["tong2 fen1 yi4 gou4"],"word":"同分異構"},{"definition":["enantiomeric isomerism (chemistry)"],"pinyin":["dui4 ying4 yi4 gou4"],"word":"對映異構"},{"definition":["enantiomeric isomer (chemistry)"],"pinyin":["dui4 ying4 yi4 gou4 ti3"],"word":"對映異構體"},{"definition":["stereoisomerism (chemistry)"],"pinyin":["li4 ti3 yi4 gou4"],"word":"立體異構"},{"definition":["stereoisomer (chemistry)"],"pinyin":["li4 ti3 yi4 gou4 ti3"],"word":"立體異構體"}],"sentences":[{"english":"In theory, ke- rose can be reduced to obtain a couple of sugar alcohols which are epimers and have the same molecular weight.","chinese":"酮糖被還原時理論上生成一對等量的差向異構體糖醇。"},{"english":"Isomers are defined as compounds having the same formula but different structures.","chinese":"異構體被定義爲化學式相同而結構不同的化合物。"},{"english":"What is heterogeneous batching and how can it help performance?","chinese":"何爲異構批處理且它如何有助於性能提升？"},{"english":"The photoisomerization reaction is reversible.","chinese":"光異構反應是可逆的。"},{"english":"Which, as a side-effect, makes heterogeneity a non-issue.","chinese":"所以，作爲副作用，異構也不再是一個問題了。"},{"english":"The carbon atomic charge(Qc) on C-O bond described the structural differences among the isomers of aliphatic alcohols and was easy to obtain .","chinese":"容易獲取，表徵了醇分子同分異構體之間的結構差異。"},{"english":"The spectral patterns can be used to characterize the above stereoisomers.","chinese":"其譜態可作爲上述立體異構體的結構區分特徵。"},{"english":"However, there are still other heterogeneity problems left unresolved.","chinese":"但是，還有其他一些異構問題尚未解決。"},{"english":"Topology discovery of extra-large networks need go through many heterogeneous networks and management domains.","chinese":"特大型網絡拓撲發現需跨越很多異構型網絡及管理域。"},{"english":"The studies in the catalysts for dehydroisomerization of n-butane are reviewed.","chinese":"綜述了正丁烷一步脫氫異構催化劑的研究現狀。"},{"english":"like an isomerization inside a crystalline solid.","chinese":"晶體中的異構化反應。"},{"english":"The non-noble metal catalyst for n-pentane isomerization at low temperature was prepared by acid modification.","chinese":"通過酸性改性製備正戊烷異構化低溫非貴金屬催化劑。"},{"english":"Allene is an isomer of methyl acetylene.","chinese":"甲基乙炔的一種異構體。"},{"english":"This toxin is a class of monocyclic heptapeptides with many different isomerides.","chinese":"該毒素是一類具有多種異構體的環狀多肽物質。"},{"english":"Solvent took a significant effect on proportion between isomers of di-nitrated TPP.","chinese":"溶劑對二硝基TPP兩個異構體的比例有較大影響。"},{"english":"Special considerations necessary for stereochemical impurity investigations are also discussed.","chinese":"特別對於光學異構體相關物質的研究也進行了討論。"}],"related":[]}