{"definition":["to emerge as a new force to be reckoned with (idiom)"],"pinyin":["yi4 jun1 tu1 qi3"],"simplified":["异军突起"],"rank":17519.0,"normalized_rank":0.24511353937850655,"fraction":0.0000030956015552341338,"cumulative_fraction":0.9680735694154974,"word":"異軍突起","characters":[{"definition":["different\/other\/hetero-\/unusual\/strange\/surprising\/to distinguish\/to separate\/to discriminate"],"pinyin":["yi4"],"word":"異"},{"definition":["(bound form) army\/military"],"pinyin":["jun1"],"word":"軍"},{"definition":["to dash\/to move forward quickly\/to bulge\/to protrude\/to break through\/to rush out\/sudden\/Taiwan pr. [tu2]"],"pinyin":["tu1"],"word":"突"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"Development of Chinese literature to the late Ming novels have sprung up everywhere.","chinese":"中國文學發展到晚明時期，小說創作異軍突起。"},{"english":"In recent years, the sudden emergence of affordable products in the Korean market.","chinese":"近年來，中低檔產品在韓國市場異軍突起。"},{"english":"Among lots of regionally flavor restaurants in Beijing, the Xiangcai restaurant also expand rapidly.","chinese":"在北京各種地方風味餐館中，湘菜館也可謂異軍突起。"},{"english":"To solve this problem, guarantee companies rise.","chinese":"爲解決這一問題，擔保公司異軍突起。"},{"english":"In chapter two, the evidences and the influences of the European ultra-rightist parties' sudden rise are mentioned.","chinese":"第二章歐洲極右翼政黨異軍突起的主要表現和影響。"},{"english":"The boom about the folk institution of age service gives us new idea.","chinese":"民間養老服務機構的異軍突起爲我們提供了新的思路。"},{"english":"In chapter three, the subjective and objective reasons of the European ultra-rightist parties' sudden rise are discussed.","chinese":"第三章歐洲極右翼政黨異軍突起的主客觀原因。"}],"related":[{"definition":["to run neck and neck\/to keep pace with\/to keep abreast of\/on a par with one another"],"pinyin":["bing4 jia4 qi2 qu1"],"word":"並駕齊驅"},{"definition":["most outstanding\/par excellence"],"pinyin":["du2 ling3 feng1 sao1"],"word":"獨領風騷"},{"definition":["Four Asian Tigers\/East Asian Tigers\/Four Little Dragons (East Asian economic powers: Taiwan, South Korea, Singapore and Hong Kong)"],"pinyin":["Si4 Xiao3 long2"],"word":"四小龍"},{"definition":["lit. only one branch of the tree is thriving (idiom)\/fig. to be in a league of one's own\/outstanding"],"pinyin":["yi1 zhi1 du2 xiu4"],"word":"一枝獨秀"},{"definition":["intensive farming"],"pinyin":["jing1 geng1 xi4 zuo4"],"word":"精耕細作"},{"definition":["bellwether"],"pinyin":["ling3 tou2 yang2"],"word":"領頭羊"},{"definition":["startup (company, phase etc)\/newly established\/in the early stages"],"pinyin":["chu1 chuang4"],"word":"初創"},{"definition":["the tide rises, the boat floats (idiom); fig. to change with the overall trend\/to develop according to the situation"],"pinyin":["shui3 zhang3 chuan2 gao1"],"word":"水漲船高"},{"definition":["to augment\/to amplify\/to extend\/to expand"],"pinyin":["kuo4 zeng1"],"word":"擴增"},{"definition":["to aspire to the throne\/to aim at (the first place etc)"],"pinyin":["wen4 ding3"],"word":"問鼎"},{"definition":["to turn white-hot\/to intensify\/to reach a climax"],"pinyin":["bai2 re4 hua4"],"word":"白熱化"},{"definition":["commercial organization"],"pinyin":["shang1 ye4 ji1 gou4"],"word":"商業機構"},{"definition":["moviedom\/the world of movies\/film circles"],"pinyin":["dian4 ying3 jie4"],"word":"電影界"},{"definition":["famous school\/noted school of thought"],"pinyin":["xian3 xue2"],"word":"顯學"},{"definition":["printing block\/section (of a newspaper)\/board (of BBS or discussion forum)"],"pinyin":["ban3 kuai4"],"word":"版塊"},{"definition":["to reveal outstanding talent (idiom); to stand out as conspicuously brilliant"],"pinyin":["zhan3 lu4 tou2 jiao3"],"word":"嶄露頭角"}]}