{"definition":["immediately\/at once\/at that moment\/at the moment"],"pinyin":["dang1 xia4"],"simplified":["当下"],"rank":8574.0,"normalized_rank":0.1199613840191401,"fraction":0.000010682350778502472,"cumulative_fraction":0.9162798773761004,"word":"當下","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[{"english":"In the third place, the article is to expound the current significance of Lin Yutang's esthetic thought of life art.","chinese":"三是闡發林語堂生活藝術論美學思想的當下意義。"},{"english":"Surprisingly, after chewing it for a bit, he found it sweetish and rather pleasant.","chinese":"當下伸手接過，咬了一口，咀嚼之下，倒也甘美可口。"},{"english":"That's certainly the prevailing view of marriage, American style, in 2009.","chinese":"這確實是2009年當下最普遍的美國式婚姻觀。"},{"english":"He was completely and entirely in the present.","chinese":"他完全徹底地活在當下。"},{"english":"The ater-style wedding is now a new style of wedding ceremony.","chinese":"劇院式婚禮是當下一種新興的時尚婚禮儀式。"},{"english":"Just let go and let yourself be in the moment.","chinese":"只是放開並讓自己處在當下時刻。"},{"english":"Meanwhile, Li Dazhao said that today is most precious.","chinese":"同時，李大釗說過，當下是最寶貴的。"},{"english":"Bakshi: What would you recommend to political actors in Japan right now?","chinese":"你對政治人物的當下的建議是什麼呢？"},{"english":"But the feeling that what is now is real has never changed, even in dream.","chinese":"但即使夢中，那當下如是的感覺從來不變。"},{"english":"To find the name of the working directory, use the pwd command.","chinese":"可以用pwd命令，顯示出你當下目錄的路徑信息。"},{"english":"To sacrifice moments in your life now for those that are dead and gone is a wasteful endeavor.","chinese":"爲了已經逝去的過往犧牲生命中當下的時間是徒勞的。"},{"english":"\"Acceptance of the present moment has nothing to do with resignation,\" writes Kabat-Zinn.","chinese":"“接受當下時刻與順從無關，”卡巴金寫道。"},{"english":"Unhappiness or problems cannot survive in the Now.","chinese":"所有不快樂或苦惱，都難以在當下活存。"},{"english":"But when I knew this time, I saw straight away that turning over the hand is Rupa and Nama.","chinese":"但當我這次了悟時，我當下見到翻轉手臂是色與名。"},{"english":"Flowers are destined to bloom and fade, It's best to enjoy living in the present.","chinese":"花開花落自然事，活在當下最自然。"},{"english":"Ring the bell of the present, and you will hear the distant echoes of the infinite past and future.","chinese":"敲響當下的鐘，你會聽到遙遠的過去和未來的回聲。"}],"related":[{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或許"},{"definition":["these"],"pinyin":["zhe4 xie1"],"word":"這些"},{"definition":["perhaps\/maybe"],"pinyin":["ye3 xu3"],"word":"也許"},{"definition":["true\/real"],"pinyin":["zhen1 shi2"],"word":"真實"},{"definition":["society\/CL:個|个[ge4]"],"pinyin":["she4 hui4"],"word":"社會"},{"definition":["regarding\/as far as sth is concerned\/with regards to"],"pinyin":["dui4 yu2"],"word":"對於"},{"definition":["same\/equal\/equivalent"],"pinyin":["tong2 yang4"],"word":"同樣"},{"definition":["in a word\/in short\/in brief"],"pinyin":["zong3 zhi1"],"word":"總之"},{"definition":["we\/us\/ourselves\/our"],"pinyin":["wo3 men5"],"word":"我們"},{"definition":["to confront\/to face"],"pinyin":["mian4 dui4"],"word":"面對"},{"definition":["current situation"],"pinyin":["xian4 zhuang4"],"word":"現狀"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"畢竟"},{"definition":["this kind of\/so\/this way\/like this\/such"],"pinyin":["zhe4 yang4"],"word":"這樣"},{"definition":["they"],"pinyin":["ta1 men5"],"word":"他們"},{"definition":["at once\/right away","then\/at that time\/while"],"pinyin":["dang1 shi2","dang4 shi2"],"word":"當時"},{"definition":["time\/juncture\/moment\/period of time\/CL:個|个[ge4],段[duan4]\/constantly\/always"],"pinyin":["shi2 ke4"],"word":"時刻"}]}