{"definition":["persons involved or implicated\/party (to an affair)"],"pinyin":["dang1 shi4 ren2"],"simplified":["当事人"],"rank":3311.0,"normalized_rank":0.04632518573447316,"fraction":0.00004273465830857692,"cumulative_fraction":0.8047984375211117,"word":"當事人","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"}],"containing_words":[],"sentences":[{"english":"The indicting condition of civil lawsuit is exact in our country.","chinese":"我國民事訴訟的起訴條件比較嚴格，對當事人不公平。"},{"english":"In taking such steps offenders are seeking forgiveness.","chinese":"冒犯者以這種做出悔改的方式來尋求當事人的寬恕。"},{"english":"The premium rate of disproportional reinsurance by bilateral party agreed.","chinese":"非比例再保險的保險費率由雙方當事人議定。"},{"english":"Touching the case, I suggest that we should go to ask the litigant.","chinese":"關於這個案子，我建議我們去問問當事人。"},{"english":"At last the litigants could easily interfere in cases, which hurts the fairness of justice.","chinese":"三是案件易受當事人不正當干預，影響司法公正。"},{"english":"His client was a middle-aged man who lost his wife two months ago.","chinese":"他的當事人是一位兩個月前喪偶的男性。"},{"english":"Pending settlement of the dispute over water, none of the parties may unilaterally alter the existing water regime.","chinese":"在水事糾紛解決前，當事人不得單方面改變現狀。"},{"english":"The chief method is to take depositions of parties and witnesses.","chinese":"主要的方法是錄取當事人和證人的宣誓證言。"},{"english":"The form of decision for administrative penalty shall be given to the party on the spot.","chinese":"行政處罰決定書應當當場交付當事人。"},{"english":"Proceedings may also instituted directly in a people's court if the parties do not wish to settle the dispute by mediation.","chinese":"當事人不願調解的，也可以直接向人民法院起訴。"},{"english":"There are two bases upon which the court may assess the amount of costs recoverable.","chinese":"法院可基於兩點來評估當事人應獲得的訴訟費數額。"},{"english":"The award may be made public only with the consent of both parties.","chinese":"裁決書須經雙方當事人同意方得公佈。"},{"english":"He has some other kind of relationship with a party to the case, which might affect the impartial handling of the case.","chinese":"與本案當事人有其他關係，可能影響案件的公正處理。"},{"english":"He has any other relationship with any party concerned so that the impartial handling of the case might be affected.","chinese":"與本案當事人有其他關係，可能影響案件公正處理的。"},{"english":"If no objections have been raised, the parties must execute the arbitration decision.","chinese":"對仲裁裁決無異議的，當事人必須履行。"},{"english":"The responsibility of criminal counsels should be to safeguard the legal rights of their clients.","chinese":"刑事辯護律師的責任應當是維護當事人的合法權益。"}],"related":[{"definition":["to handle\/to treat\/to deal with\/to process\/to deal with a criminal case\/to mete out punishment\/to offer for sale at a reduced price\/to punish"],"pinyin":["chu3 li3"],"word":"處理"},{"definition":["to respond\/response"],"pinyin":["hui2 ying4"],"word":"回應"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"審查"},{"definition":["lawyer"],"pinyin":["lu:4 shi1"],"word":"律師"},{"definition":["explanation\/to explain\/to interpret\/to resolve\/CL:個|个[ge4]"],"pinyin":["jie3 shi4"],"word":"解釋"},{"definition":["action\/conduct\/behavior\/activity"],"pinyin":["xing2 wei2"],"word":"行為"},{"definition":["dispute"],"pinyin":["jiu1 fen1"],"word":"糾紛"},{"definition":["evidence\/proof\/testimony"],"pinyin":["zheng4 ju4"],"word":"證據"},{"definition":["to admit (to membership)"],"pinyin":["jie1 na4"],"word":"接納"},{"definition":["counterpart\/other person involved\/opposite side\/other side\/receiving party"],"pinyin":["dui4 fang1"],"word":"對方"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["to explain\/to illustrate\/to indicate\/to show\/to prove\/explanation\/directions\/caption\/CL:個|个[ge4]"],"pinyin":["shuo1 ming2"],"word":"說明"},{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有關"},{"definition":["right (i.e. an entitlement to sth)\/(classical) power and wealth"],"pinyin":["quan2 li4"],"word":"權利"},{"definition":["should\/ought to"],"pinyin":["ying1 dang1"],"word":"應當"},{"definition":["to refuse\/to decline\/to reject"],"pinyin":["ju4 jue2"],"word":"拒絕"}]}