{"definition":["among\/in the middle\/in the center"],"pinyin":["dang1 zhong1"],"simplified":["当中"],"rank":1451.0,"normalized_rank":0.020301372546276217,"fraction":0.00011020668526517686,"cumulative_fraction":0.6799148364130848,"word":"當中","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["China\/Chinese\/surname Zhong","to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right"],"pinyin":["Zhong1","zhong1","zhong4"],"word":"中"}],"containing_words":[{"definition":["right in the midpoint\/a bull's eye\/to hit the nail on the head"],"pinyin":["zheng4 dang1 zhong1"],"word":"正當中"}],"sentences":[{"english":"There is a discrepancy in the combat log when casting Paladin healing spells.","chinese":"戰鬥記錄當中對騎士的治療記錄有錯誤。"},{"english":"The replier said that he went to a Chrisitan high school when he was young.","chinese":"迴應當中的一位網友說到自己求學時的經歷。"},{"english":"Can a first cousin at one remove inherit the property?","chinese":"在堂表兄弟姐妹這一輩當中，他是唯一的男孩。"},{"english":"Those of you who are weak will be merged.","chinese":"你們當中財務較弱的銀行將會被合併。"},{"english":"The occupation of genetic engineer took a few more years to be named, this time by Poul Anderson.","chinese":"幾年後這個詞彙才被保羅安德森應用於科學當中。"},{"english":"Daqiang is the most skillful of all the workers here.","chinese":"大強是這裏所有的工人當中最熟練的。"},{"english":"In the spiritual life we have to make a distinction between two kinds of loneliness.","chinese":"在靈性生活當中，我們必須懂得區分兩種不同的孤獨。"},{"english":"I chose three of them to show all of you a full view.","chinese":"我選了當中的三張以展示完整的外觀給您們大家看。"},{"english":"Many of the acolytes have been in hiding amongst the populace.","chinese":"許多寺僧都隱藏在平民當中。"},{"english":"I feel intimately inside myself where the role belongs.","chinese":"我能絲絲入扣地在自我當中感受角色之所在。"},{"english":"In my work has to avoid some service not attentive place.","chinese":"在我的工作當中難免有一些服務不周到的地方。"},{"english":"Some of you are bound to have met with disappointment in the recruiting season.","chinese":"在招聘季節中，你們當中有的人註定要與失望爲伍。"},{"english":"Until now, the rats under study have met two of the three elements of addiction.","chinese":"直到現在，研究中的大鼠符合成癮三要素當中的二項。"},{"english":"It's all in those side effects I mentioned.","chinese":"其實都在那些我提到的副作用當中。"},{"english":"Now, improved bedsheets are being designed to be compatible with that technology.","chinese":"現在，與這一技術相配套的改進牀單正在設計當中。"},{"english":"He recognized Dan as one of his best firends.","chinese":"大家承認簡是我們當中最聰明的女孩。"}],"related":[{"definition":["same\/equal\/equivalent"],"pinyin":["tong2 yang4"],"word":"同樣"},{"definition":["and\/besides\/moreover\/furthermore\/in addition"],"pinyin":["bing4 qie3"],"word":"並且"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"},{"definition":["current"],"pinyin":["xian4 shi2"],"word":"現時"},{"definition":["these"],"pinyin":["zhe4 xie1"],"word":"這些"},{"definition":["to come and go\/to have friendly relations with\/in the past\/previous"],"pinyin":["guo4 wang3"],"word":"過往"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"認為"},{"definition":["barely\/only\/merely"],"pinyin":["jin3"],"word":"僅"},{"definition":["equivalent to\/appropriate\/considerably\/to a certain extent\/fairly\/quite"],"pinyin":["xiang1 dang1"],"word":"相當"},{"definition":["regarding\/as far as sth is concerned\/with regards to"],"pinyin":["dui4 yu2"],"word":"對於"},{"definition":["to participate (in sth)"],"pinyin":["can1 yu4"],"word":"參與"},{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有關"},{"definition":["auxiliary verb introducing future action: may (be able to)\/will (cause)\/should (enable)\/going to"],"pinyin":["jiang1 hui4"],"word":"將會"},{"definition":["the rest\/the others\/remaining\/remainder\/apart from them"],"pinyin":["qi2 yu2"],"word":"其餘"},{"definition":["final\/ultimate"],"pinyin":["zui4 zhong1"],"word":"最終"},{"definition":["to pass through\/to penetrate\/by means of\/via"],"pinyin":["tou4 guo4"],"word":"透過"}]}