{"definition":["fully deserving, without any reservations (idiom); entirely worthy (of a title, honor etc)"],"pinyin":["dang1 zhi1 wu2 kui4"],"simplified":["当之无愧"],"rank":13644.0,"normalized_rank":0.19089726190309628,"fraction":0.000004894483851053723,"cumulative_fraction":0.9529375961237015,"word":"當之無愧","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["ashamed"],"pinyin":["kui4"],"word":"愧"}],"containing_words":[],"sentences":[{"english":"A:I think he deserved his gold.","chinese":"我認爲他的金牌當之無愧。"},{"english":"I wish you every success in the future, You are worthysuccess.","chinese":"我祝你來日事業成功，出類拔萃，成功當之無愧。"},{"english":"And thus Stieglitz deservingly gained the reputation as the \"Father of the Contemporary Photography\".","chinese":"斯蒂格利茨也被當之無愧地譽爲“當代攝影之父”。"},{"english":"Rembrandt is a deservedly famous artist .","chinese":"倫勃朗是個當之無愧的名畫家。"},{"english":"The leader on and off the court.","chinese":"場上或場下都是當之無愧的領袖。"},{"english":"It's worth the Grammy Award it won.","chinese":"它得了格萊美獎真當之無愧啊。"},{"english":"She deserved it, because she played Paganini better than anyone else in the world.","chinese":"她當之無愧，因爲她拉的帕格尼尼是世界第一。"},{"english":"Guo Moruo is a well-deserved founder of Chinese New Poetry.","chinese":"郭沫若當之無愧是中國新詩的奠基者。"},{"english":"He is the true father of this century's best art.","chinese":"他確實是本世紀的當之無愧的藝術之父。"},{"english":"I wish you every success in the future, You are worthy success.","chinese":"我祝你來日事業成功，超羣絕倫，成功當之無愧。"},{"english":"He was the first person who advocated Tu Fu in Song dynasty.","chinese":"“兩宋尊杜第一人”，王禹是當之無愧的。"},{"english":"They went to their death unflinchingly, worthy of the title of heroes.","chinese":"慷慨赴死，從容就義，他們當之無愧。"},{"english":"These, it is dry to one company come out , be be worthy of.","chinese":"這些，對一公司來說是幹出來的，是當之無愧的。"},{"english":"She worked hard all year. She really deserved the honor.","chinese":"她一整年辛勤工作，這份榮譽她當之無愧。"},{"english":"Pavel Anosov received well-deserved recognition for his achievements.","chinese":"帕維爾阿諾索夫的成就收到當之無愧的認可。"},{"english":"\"Captain Tsubasa\" Japan eyes of the public well-deserved hero.","chinese":"《足球小將》是日本民衆心目中當之無愧的英雄。"}],"related":[]}