{"definition":["to take up duty as\/to assume a position\/to assume\/to take on (an office)"],"pinyin":["dang1 shang5"],"simplified":["当上"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"當上","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["on top\/upon\/above\/upper\/previous\/first (of multiple parts)\/to climb\/to get onto\/to go up\/to attend (class or university)","see 上聲|上声[shang3 sheng1]"],"pinyin":["shang3","shang4"],"word":"上"}],"containing_words":[],"sentences":[{"english":"Any man can be a father.","chinese":"任何人都能當上父親。"},{"english":"She won't pay any more attention to us if she becomes a manager-assistant.","chinese":"如果她當上經理助理就會把我們不放在眼裏。"},{"english":"Assange fathered him in his teens with his then-girlfriend.","chinese":"阿桑格與他當時的女友在十幾歲時就當上了爹媽。"},{"english":"Costa, meanwhile, resumed his role as Flamengo coach.","chinese":"這期間科斯塔重新當上了弗拉門戈主教練。"},{"english":"After their graduation from college, Wang Hai became a teacher, while Li Ping turned manager.","chinese":"大學畢業後，王海做了教師，而李平當上了經理。"},{"english":"' And his answer was: 'When you become the Monkey King, you can see me.","chinese":"二哥答道，“你當上美猴王的那天，就能見到我了。”"},{"english":"He became Lord Mayor of London, and lent large sums of money to the king.","chinese":"他後來當上了倫敦市長，連國王缺錢花時都要向他借。"},{"english":"Dabao to others when the body double, oneself was beaten face is swollen.","chinese":"大寶給別人當上了替身演員，自己被打得臉都腫了。"},{"english":"He became a railroad locomotive fireman with the Southern Railroad.","chinese":"他在南方鐵路公司當上了鐵路機車司爐工。"},{"english":"After serving his apprenticeship as a toolmaker, he became a manager.","chinese":"結束了工具匠的學徒期以後，他當上了經理。"},{"english":"Maria finished school, and then became the librarian of the Nantucket athenaeum .","chinese":"中學畢業後，瑪麗當上了南塔克特學會的圖書管理員。"},{"english":"From being a librarian she is now an MP.","chinese":"她從一個圖書館管理員當上了目前的下議院議員。"},{"english":"Then one thing led to another and now I am a news anchor myself.","chinese":"就這樣，機緣巧合的，我就當上了新聞主播。"},{"english":"Later he became a river superintendent.","chinese":"後來又當上了江漢關監督。"},{"english":"The month's trial over, Oliver was formally apprenticed.","chinese":"一個月的試用期結束了，奧立弗正式當上了學徒。"},{"english":"I pay when top10 is achieved on google and yahoo in usa.","chinese":"我要當上十大谷歌和雅虎在美國取得的。"}],"related":[]}