{"definition":["top priority job\/matter of vital importance"],"pinyin":["dang1 wu4 zhi1 ji2"],"simplified":["当务之急"],"rank":10675.0,"normalized_rank":0.14935709988387222,"fraction":0.0000074220864601680785,"cumulative_fraction":0.9349930887615134,"word":"當務之急","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["affair\/business\/matter\/to be engaged in\/to attend to\/by all means"],"pinyin":["wu4"],"word":"務"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["urgent\/pressing\/rapid\/hurried\/worried\/to make (sb) anxious"],"pinyin":["ji2"],"word":"急"}],"containing_words":[],"sentences":[{"english":"India obviously has preoccupations enough to keep its focus fixed on its border regions.","chinese":"印度的當務之急顯然是把焦點定在邊界地區。"},{"english":"But buttering up China appears to be a new priority.","chinese":"但顯然向中國示好成爲其當務之急。"},{"english":"I think the first order of business is to get you out of here.","chinese":"我認爲，當務之急首先是得把你攆出去。"},{"english":"For him, tackling climate change is every bit as urgent.","chinese":"但在他看來，應對氣候變化同樣是當務之急。"},{"english":"Its urgent for telecommunication enterprises in China to emphasize and implement marketing research.","chinese":"重視和開展市場調研是國內電信企業的當務之急。"},{"english":"On the correct application of market research in enterprises marketing;","chinese":"重視和開展市場調研是國內電信企業的當務之急。"},{"english":"I believe now that cooperation is everything.","chinese":"我認爲當務之急是要通力合作。"},{"english":"Now he believed that mitigating the impact of rising temperatures was urgent.","chinese":"如今，他堅信減輕氣溫升高的影響是當務之急。"},{"english":"What is pressing at present is to resume the negotiation as soon as possible.","chinese":"當務之急是爭取儘快復談。"},{"english":"The environmental management of coal waste has become an impending problem.","chinese":"煤矸石的環境治理問題已成當務之急。"},{"english":"The necessity for making decisions devolves on him.","chinese":"作出決策乃當務之急，此事必然地落在他身上。"},{"english":"Encourage farmers to macro-control of cotton is a matter of urgency.","chinese":"鼓勵農民種棉是宏觀調控的當務之急。"},{"english":"Now the urgent task is to make sure you get vigilante thing right.","chinese":"現在的當務之急是務必把“治安維持會”的事情辦好。"},{"english":"The task of promptly building up an administrative system of criminal science and technology is of top priority.","chinese":"建立新型刑事科學技術管理體制是當務之急。"},{"english":"State-owned commercial banks improve customer loyalty become an urgency matter.","chinese":"提高國有商業銀行的客戶忠誠度成爲當務之急。"},{"english":"The priority for policymakers must be to keep the number of losers as small as possible.","chinese":"決策者的當務之急是儘量減少這些失意者的數量。"}],"related":[{"definition":["bring order out of chaos\/set to rights things which have been thrown into disorder"],"pinyin":["bo1 luan4 fan3 zheng4"],"word":"撥亂反正"},{"definition":["lit. before it rains, bind around with silk (idiom, from Book of Songs 詩經|诗经); fig. to plan ahead\/to prepare for a rainy day"],"pinyin":["wei4 yu3 chou2 mou2"],"word":"未雨綢繆"},{"definition":["(Tw) to buy off influential people (in an election, a call for tenders etc)"],"pinyin":["bang3 zhuang1"],"word":"綁樁"},{"definition":["lit. to prescribe the right medicine for an illness (idiom); fig. to study a problem to find the right way to solve it\/to take appropriate steps"],"pinyin":["dui4 zheng4 xia4 yao4"],"word":"對症下藥"},{"definition":["to judge the hour and size up the situation\/to take stock"],"pinyin":["shen3 shi2 duo2 shi4"],"word":"審時度勢"},{"definition":["(of a pendulum) to stop swinging\/(of work, production, activities etc) to come to a halt\/to be suspended\/to be canceled\/shutdown\/(sports) lockout"],"pinyin":["ting2 bai3"],"word":"停擺"},{"definition":["to be duty bound\/to be one's unshirkable responsibility"],"pinyin":["ze2 wu2 pang2 dai4"],"word":"責無旁貸"},{"definition":["administrative department\/administration\/executive (government branch)"],"pinyin":["xing2 zheng4 bu4 men2"],"word":"行政部門"},{"definition":["chaotic situation"],"pinyin":["luan4 ju2"],"word":"亂局"},{"definition":["fair competition"],"pinyin":["gong1 ping2 jing4 zheng1"],"word":"公平競爭"},{"definition":["to brook no delay\/to demand immediate action"],"pinyin":["ke4 bu4 rong2 huan3"],"word":"刻不容緩"},{"definition":["highest common factor HCF\/greatest common divisor GCD"],"pinyin":["zui4 da4 gong1 yue1 shu4"],"word":"最大公約數"},{"definition":["political correctness\/politically correct"],"pinyin":["zheng4 zhi4 zheng4 que4"],"word":"政治正確"},{"definition":["to avoid the important and dwell on the trivial\/to keep silent about major charges while admitting minor ones"],"pinyin":["bi4 zhong4 jiu4 qing1"],"word":"避重就輕"},{"definition":["ruler"],"pinyin":["zhi2 zheng4 zhe3"],"word":"執政者"},{"definition":["alarm\/alert\/warning signal"],"pinyin":["jing3 hao4"],"word":"警號"}]}