{"definition":["current\/today's\/modern\/present\/to be facing (us)"],"pinyin":["dang1 qian2"],"simplified":["当前"],"rank":1252.0,"normalized_rank":0.0175171043610874,"fraction":0.0001296580580669025,"cumulative_fraction":0.6560967566150302,"word":"當前","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["front\/forward\/ahead\/first\/top (followed by a number)\/future\/ago\/before\/BC (e.g. 前293年)\/former\/formerly"],"pinyin":["qian2"],"word":"前"}],"containing_words":[{"definition":["facing a powerful enemy (idiom); fig. confronting grave difficulties\/Enemy at the Gates, 1991 movie by Jean-Jacques Annaud"],"pinyin":["da4 di2 dang1 qian2"],"word":"大敵當前"}],"sentences":[{"english":"Context is the most frequently studied theme in pragmatics.","chinese":"語境是當前語用學研究的一個熱點。"},{"english":"The existing vaccines can only reduce the amount of virus, rather than totally inactivating it.","chinese":"當前的疫苗只會減少病毒數量，並非真正殺滅病毒。"},{"english":"As you can see, there are some consequences with the current arrangement.","chinese":"正如您所看到的，當前這種安排還存有許多問題。"},{"english":"The financial restraint in rural areas is one of the bottlenecked factors in current new rural construction.","chinese":"農村金融抑制是當前新農村建設問題的瓶頸因素之一。"},{"english":"However, the present recognition of TV essays still remains on the text-oriented level.","chinese":"但當前對電視散文的認識仍然停留在文本主導論層次。"},{"english":"Adds a sequence of connected cubic Bzier curves to the current figure.","chinese":"在當前圖形中添加一系列相互連接的立方貝塞爾曲線。"},{"english":"Each plug-in has access to information about a personâ ™s current location whereabouts. The location information includes","chinese":"各插件都可訪問關於某人當前位置所在的信息。"},{"english":"The rotating sphere shows the current pitch and bank angles.","chinese":"旋轉的球體表示了當前的俯仰角和坡度角。"},{"english":"The rapid development of the present vocational colleges calls for the 2nd-level management in schools or departments.","chinese":"院系二級管理是當前高職院校迅速發展的需要。"},{"english":"To narrate is to give an account of what happened or is happening.","chinese":"記敘文講述的是發生在當前或過去事情的經過。"},{"english":"Development and ecology are two main theme in urban design and construction in Beijing nowadays.","chinese":"發展與生態是當前北京城市建設的兩大突出主題。"},{"english":"Make the directory containing the files the current working directory.","chinese":"將包含這些文件的目錄作爲當前工作目錄。"},{"english":"The domestic caustic soda production techniques by diaphragm method and ion-exchange membrane method at present are introduced.","chinese":"介紹了當前國內隔膜法和離子膜法燒鹼的生產技術。"},{"english":"He can cope with the present situation.","chinese":"他能夠應付當前的局勢。"},{"english":"Eutrophication is becoming a serious problem in most of the mariculture areas in China.","chinese":"當前，中國的多數海水養殖區富營養化相當嚴重。"},{"english":"How to develop the economy of tax fund is a new problem now.","chinese":"如何培育地方稅源經濟是當前的新課題。"}],"related":[{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["economy\/economic"],"pinyin":["jing1 ji4"],"word":"經濟"},{"definition":["now\/nowadays\/modern"],"pinyin":["xian4 jin1"],"word":"現今"},{"definition":["circumstances\/situation\/terrain\/CL:個|个[ge4]"],"pinyin":["xing2 shi4"],"word":"形勢"},{"definition":["current"],"pinyin":["xian4 shi2"],"word":"現時"},{"definition":["trend\/tendency"],"pinyin":["qu1 shi4"],"word":"趨勢"},{"definition":["economic development"],"pinyin":["jing1 ji4 fa1 zhan3"],"word":"經濟發展"},{"definition":["one step further\/to move forward a step\/further onwards"],"pinyin":["jin4 yi1 bu4"],"word":"進一步"},{"definition":["immediately\/at once\/at that moment\/at the moment"],"pinyin":["dang1 xia4"],"word":"當下"},{"definition":["completely\/totally\/total\/entire\/overall\/population (statistics)"],"pinyin":["zong3 ti3"],"word":"總體"},{"definition":["current situation"],"pinyin":["xian4 zhuang4"],"word":"現狀"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"},{"definition":["marketplace\/market (also in abstract)"],"pinyin":["shi4 chang3"],"word":"市場"},{"definition":["current\/present\/now\/nowadays"],"pinyin":["dang1 jin1"],"word":"當今"},{"definition":["investment\/to invest"],"pinyin":["tou2 zi1"],"word":"投資"},{"definition":["to continue\/to persist\/sustainable\/preservation"],"pinyin":["chi2 xu4"],"word":"持續"}]}