{"definition":["to manage the household\/to be the one in charge of the family\/to call the shots\/to be in charge"],"pinyin":["dang1 jia1"],"simplified":["当家"],"rank":10847.0,"normalized_rank":0.1517636030389098,"fraction":0.000007235089120157944,"cumulative_fraction":0.9362536004602492,"word":"當家","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[{"definition":["to be in charge in one's own house (idiom)\/to be the master of one's own affairs"],"pinyin":["dang1 jia1 zuo4 zhu3"],"word":"當家作主"},{"definition":["a person who doesn't manage a household would not be aware how expensive it is (idiom)"],"pinyin":["bu4 dang1 jia1 bu4 zhi1 chai2 mi3 gui4"],"word":"不當家不知柴米貴"}],"sentences":[{"english":"The people are the masters of their country.","chinese":"人民當家作主人。"},{"english":"It is the striking theme of the ruling history and country history that people are the masters.","chinese":"人民當家作主成爲黨的執政史和國史的鮮明主題。"},{"english":"When her husband was out she wore the trousers.","chinese":"當她丈夫不在時，她當家做主。"},{"english":"I will raise you ten because it is Home Alone.","chinese":"我加十塊，我猜是小鬼當家。"},{"english":"The force at the core leading our cause forward is the Chinese Communist Party.","chinese":"領導我們事業的核心力量是中國當家的。"},{"english":"It was a comedy called \"Home Alone\".","chinese":"這是一部叫《小鬼當家》的喜劇。"},{"english":"In in out out one handle, the poor family's child can get marry earlier.","chinese":"裏裏外外一把手，窮人的孩子早當家。"},{"english":"Today, Chinese cabbage is no longer the main dish for northern people in winter.","chinese":"如今，大白菜不再是北方人冬天的當家菜。"},{"english":"There's no doubt who wears the trousers in that household.","chinese":"那戶人家裏誰當家是毫無疑問的。"},{"english":"Granite is our shops' main business.","chinese":"花崗岩是本店經營的當家品種。"},{"english":"He couldn't visualize either Martinez or Brown as platoon sergeant.","chinese":"他不信馬丁內茲和布朗有誰能當得了排裏的當家上士。"},{"english":"I am honored to be the host of kids club.","chinese":"我很榮幸被選爲小鬼當家的主持人。"},{"english":"That poor children as early as it headed.","chinese":"都說窮人的孩子早當家吧。"},{"english":"The bonus told the five children with people outside the door to protect the big headed.","chinese":"花紅告訴小五子帶着人去門外面保護大當家。"},{"english":"When the parents found that the performance of these children should be in time to the hospital for check-ups .","chinese":"當家長髮現孩子有這些表現時，應及時到醫院做檢查。"},{"english":"Ma Po's bean curd is a specialty in our restaurant.","chinese":"本店的當家菜是麻婆豆腐。"}],"related":[{"definition":["currently popular (of movie stars, singers etc)"],"pinyin":["dang1 hong2"],"word":"當紅"},{"definition":["picul (100 catties, 50 kg)\/two buckets full\/carrying pole and its load\/classifier for loads carried on a shoulder pole","to undertake\/to carry\/to shoulder\/to take responsibility"],"pinyin":["dan1","dan4"],"word":"擔"},{"definition":["reputation"],"pinyin":["ming2 sheng1"],"word":"名聲"},{"definition":["neck\/collar\/to lead\/to receive\/classifier for clothes, mats, screens etc"],"pinyin":["ling3"],"word":"領"},{"definition":["favorite"],"pinyin":["zui4 xi3 ai4"],"word":"最喜愛"},{"definition":["not just in name only, but also in reality (idiom)"],"pinyin":["ming2 fu4 qi2 shi2"],"word":"名副其實"},{"definition":["in the capacity of\/as"],"pinyin":["shen1 wei2"],"word":"身為"},{"definition":["to rely on\/to depend on\/by means of\/thanks to\/sth that one relies on\/also written 憑借|凭借[ping2 jie4]"],"pinyin":["ping2 jie4"],"word":"憑藉"},{"definition":["repeatedly\/again and again"],"pinyin":["lian2 lian2"],"word":"連連"},{"definition":["pet\/favorite\/darling"],"pinyin":["chong3 er2"],"word":"寵兒"},{"definition":["to see with one's own eyes\/very soon"],"pinyin":["yan3 jian4"],"word":"眼見"},{"definition":["in those days\/then\/in those years\/during that time","that very same year"],"pinyin":["dang1 nian2","dang4 nian2"],"word":"當年"},{"definition":["shopkeeper"],"pinyin":["zhang3 gui4"],"word":"掌櫃"},{"definition":["at this time\/at this moment"],"pinyin":["zhe4 shi2"],"word":"這時"},{"definition":["barracks\/army camp"],"pinyin":["jun1 ying2"],"word":"軍營"},{"definition":["to praise\/to acclaim\/to commend\/to compliment"],"pinyin":["cheng1 zan4"],"word":"稱讚"}]}