{"definition":["in those days\/then\/in those years\/during that time","that very same year"],"pinyin":["dang1 nian2","dang4 nian2"],"simplified":["当年"],"rank":1326.0,"normalized_rank":0.01855246036965008,"fraction":0.00012153922039372241,"cumulative_fraction":0.6653656972686453,"word":"當年","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["surname Nian","year\/CL:個|个[ge4]"],"pinyin":["Nian2","nian2"],"word":"年"}],"containing_words":[{"definition":["to be in the prime of life"],"pinyin":["zheng4 dang1 nian2"],"word":"正當年"},{"definition":["(of one's skills, appearance etc) not to have deteriorated a bit\/to be as (good, vigorous etc) as ever"],"pinyin":["bu4 jian3 dang1 nian2"],"word":"不減當年"},{"definition":["a real man doesn't boast about his past achievements (idiom)"],"pinyin":["hao3 han4 bu4 ti2 dang1 nian2 yong3"],"word":"好漢不提當年勇"}],"sentences":[{"english":"In the intensive care unit, beam aunt continue to talk to her mother that year.","chinese":"重症病房裏，梁大媽繼續跟馬母說着當年的事。"},{"english":"We were both on the tennis team.","chinese":"我們當年都是校網球隊的。"},{"english":"The mistake is caused by the situation today, Sheng Maolin too late to regret.","chinese":"當年的誤以爲是造成了今天的局面，盛茂林追悔莫及。"},{"english":"The magpies nest year high, waterlogging rain.","chinese":"喜鵲搭窩高，當年雨水澇。"},{"english":"The Bells of Bow Church spoke truly when they chimed to young Dick.","chinese":"當年包教堂的鐘聲對年輕的迪克的確說了真話。"},{"english":"Those early years' folding Ru old grudge have already eliminated thin?","chinese":"難道當年的折辱仇恨已經消淡了？"},{"english":"In those years, workers lived right on those cliffs.","chinese":"當年修渠的勇士們就住在那些山崖上。"},{"english":"Liu Bei lost no time in telling his brothers the story of King Wen bent on visiting one of his subjects called Jiang Ziya.","chinese":"劉備忙講了當年文王訪姜子牙的故事。"},{"english":"The 54-year-old had promised during the campaign to serve out his term as mayor.","chinese":"當年54歲的朱立倫在競選中承諾將服滿市長任期。"},{"english":"Look, here are the tools they used then.","chinese":"你看，這些就是當年修渠的人們使用的工具。"},{"english":"The Weill family were very close-knit, as were many immigrant Jewish families of that era.","chinese":"一如當年許多猶太移民家族，魏爾家也是非常團結的。"},{"english":"It was no great distance, in those days, from the prison-door to the market-place.","chinese":"當年，從牢門到市場沒有幾步路。"},{"english":"The appropriate direction lost many elites in those early annuals, it was under the archaic divine tree to fair cage him.","chinese":"當年正道損失無數精英，纔將他困在上古神木之下。"},{"english":"I was back on the physical irks , but now do not they became a physics teacher?","chinese":"我當年對物理很厭煩，可現在不也當了個物理老師嗎？"},{"english":"His voice is no longer young children, more powerful.","chinese":"他的聲音不再是當年稚嫩的童音，變得渾厚有力。"},{"english":"The 42-year-old one-time heart-throb cut a distinctly portly figure.","chinese":"當年的大衆情人如今已經42歲，身體發福。"}],"related":[{"definition":["at once\/right away","then\/at that time\/while"],"pinyin":["dang1 shi2","dang4 shi2"],"word":"當時"},{"definition":["at that time\/originally"],"pinyin":["dang1 chu1"],"word":"當初"},{"definition":["then\/at that time\/in those days"],"pinyin":["na4 shi2"],"word":"那時"},{"definition":["once\/already\/former\/previously\/ever\/(past tense marker used before verb or clause)"],"pinyin":["ceng2 jing1"],"word":"曾經"},{"definition":["at that time"],"pinyin":["na4 shi2 hou5"],"word":"那時候"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不過"},{"definition":["afterwards\/later"],"pinyin":["hou4 lai2"],"word":"後來"},{"definition":["same\/equal\/equivalent"],"pinyin":["tong2 yang4"],"word":"同樣"},{"definition":["to come and go\/to have friendly relations with\/in the past\/previous"],"pinyin":["guo4 wang3"],"word":"過往"},{"definition":["now\/at present\/at the moment\/modern\/current\/nowadays"],"pinyin":["xian4 zai4"],"word":"現在"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"畢竟"},{"definition":["here"],"pinyin":["zhe4 li3"],"word":"這裡"},{"definition":["really\/indeed"],"pinyin":["di2 que4"],"word":"的確"},{"definition":["young"],"pinyin":["nian2 qing1"],"word":"年輕"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或許"},{"definition":["indeed\/really\/reliable\/real\/true"],"pinyin":["que4 shi2"],"word":"確實"}]}