{"definition":["on that night","that very night\/the same night"],"pinyin":["dang1 ye4","dang4 ye4"],"simplified":["当夜"],"rank":26940.0,"normalized_rank":0.3769255523064654,"fraction":0.000001243729380863662,"cumulative_fraction":0.9869248489220214,"word":"當夜","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["night"],"pinyin":["ye4"],"word":"夜"}],"containing_words":[],"sentences":[{"english":"In that night was Belshazzar the king of the Chaldeans slain.","chinese":"當夜，迦勒底王伯沙撒被殺。"},{"english":"There were several alarms during the night but no actual air raid took place.","chinese":"當夜，空襲警報拉響了數次，但並沒有飛機來襲。"},{"english":"They fought over the night.","chinese":"當夜，老山鏖戰通霄。"},{"english":"Or, it actually happened the night before!","chinese":"或當夜該航班墜機實際發生。"},{"english":"With dark shies you will notice the reddish color of Arcturus.","chinese":"當夜幕降臨時，你會注意到那顆淡紅色的大角星。"},{"english":"That night the house detective raided alec's hotel room.","chinese":"當夜，偵探搜查了亞歷克在旅館的房間。"},{"english":"That night (27 -28 June) defensive works were thrown up in selected places near Berestko.","chinese":"當夜，選定在別列斯科奇附近地方建立防禦工事。"},{"english":"\"Appeared the same night,\" the night on which he went to Beer-sheba.","chinese":"艾薩克上別示巴去，當夜耶和華向他顯現。"},{"english":"That night the 2 men and their company surrendered to Zhao Zilong.","chinese":"當夜二人引五百軍徑奔趙雲寨來投降。"},{"english":"At that hour of the night the jailer took them and washed their wounds;","chinese":"當夜就在那時候，禁卒把他們帶去，洗他們的傷。"},{"english":"As dusk fell, we seemed to face an uncertain future.","chinese":"當夜幕降臨時，我們似乎面對一個不確定的未來。"},{"english":"He plans to dive into that same night by neither incense, rescued peony.","chinese":"他計劃當夜潛入荷香別院，救走牡丹。"},{"english":"When the darkness falls will you please shine her the way.","chinese":"當夜幕落下，請你照亮她前面的路。"},{"english":"The same night Baltasar the Chaldean king was slain.","chinese":"當夜加色丁王貝耳沙匝即爲人所殺。"},{"english":"Nightfalll found him many miles short of his destination.","chinese":"當夜幕降臨時，他離目的地還有好幾英里呢。"},{"english":"As dusk fell, he decided to return to Shepperton.","chinese":"當夜幕降臨時，他決定返回謝伯頓。"}],"related":[]}