{"definition":["Angelica sinensis"],"pinyin":["dang1 gui1"],"simplified":["当归"],"rank":31377.0,"normalized_rank":0.4390049389279868,"fraction":8.339701822622184e-7,"cumulative_fraction":0.991463309106742,"word":"當歸","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"歸"}],"containing_words":[{"definition":["(botany) lovage\/Levisticum officinale"],"pinyin":["Ou1 dang1 gui1"],"word":"歐當歸"}],"sentences":[{"english":"Objection To observe analgesic effect of Angelica oil on mouse dysmenorrhea.","chinese":"目的觀察研究當歸油對小鼠痛經的鎮痛作用。"},{"english":"Externally used Dan Gui is very versatile; if you are wanting mostly the invigorating properties you should use the TAIL of the herb, or Dang Gui Wei.","chinese":"如果主要需要滋補的話，可以使用當歸的尾部。"},{"english":"Furthermore, Danggui Buxue Tang also can promote the production of blood and improve angiogenesis .","chinese":"當歸補血湯還具有促進造血和血管生成作用。"},{"english":"For example, Dang Gui is found in balms to help with burns and such.","chinese":"例如，燒傷等所用的鎮痛軟膏中就含有當歸。"},{"english":"Chinese angelica parenteral solution was replaced by normal saline in control group.","chinese":"對照組給予生理鹽水代替當歸注射液治療。"},{"english":"Conclusion: Angelica injection can reduce GE ototoxicity.","chinese":"結論當歸注射液能降低GE的耳毒性。"},{"english":"Aim To study the anti-dysmenorrhea effect of the essential oil from Angelica sinensis Diels.","chinese":"目的研究當歸精油治療痛經的藥理作用。"},{"english":"Objective To evaluate the antioxidation activities of two Chinese herbs, polygonum multiflorum and Angelica sinensis.","chinese":"目的研究生首烏和當歸兩種中藥的抗氧化活性。"},{"english":"As an example, study of DangGui verified the predicting abililty of the proposed method.","chinese":"以中藥當歸爲實例對該方法進行應用研究。"},{"english":"Boss will add in the angelica based on the customers' needs.","chinese":"老闆是應顧客的需要而加入當歸。"},{"english":"Ultrasonography and extracting a short time, Angelica in the basic ferulic acid can be extracted completely.","chinese":"且超聲提取時間短，當歸中的阿魏酸基本能提取完全。"},{"english":"RESULTS The contents of components were changed after Angelica sinensis(Oliv. )Diels was processed by different methods.","chinese":"結果當歸經不同方法炮製後，其所含成分發生了變化。"},{"english":"What's more, Dong Quai is a mild tranquilliser and helps relieve stress and pressure.","chinese":"當歸亦具有溫和的鎮靜效果，有助緩解緊張及壓力。"},{"english":"Objective To explore the inner quality of ultra micro-powder.","chinese":"目的探討當歸超微細粉的內在質量。"}],"related":[{"definition":["medicinal ingredient"],"pinyin":["yao4 cai2"],"word":"藥材"},{"definition":["fresh ginger"],"pinyin":["sheng1 jiang1"],"word":"生薑"},{"definition":["poor man's ginseng (Codonopsis pilosula)\/codonopsis root (used in TCM)"],"pinyin":["dang3 shen1"],"word":"黨參"},{"definition":["Dioscorea polystachya\/yam"],"pinyin":["shan1 yao5"],"word":"山藥"},{"definition":["four-substance decoction (si wu tang), tonic formula used in Chinese medicine"],"pinyin":["si4 wu4 tang1"],"word":"四物湯"},{"definition":["dried ginger"],"pinyin":["gan1 jiang1"],"word":"乾薑"},{"definition":["donkey-hide gelatin (used in TCM)\/Taiwan pr. [a1 jiao1]"],"pinyin":["e1 jiao1"],"word":"阿膠"},{"definition":["jujube\/red date"],"pinyin":["hong2 zao3"],"word":"紅棗"},{"definition":["Chinese knotweed (Polygonum multiflorum)\/fleeceflower root"],"pinyin":["he2 shou3 wu1"],"word":"何首烏"},{"definition":["dark brown sugar\/molasses"],"pinyin":["hong2 tang2"],"word":"紅糖"},{"definition":["King Solomon's seal (plant of genus Polygonatum)"],"pinyin":["huang2 jing1"],"word":"黃精"},{"definition":["Chinese foxglove (Rehmannia glutinosa), its rhizome used in TCM"],"pinyin":["di4 huang2"],"word":"地黃"},{"definition":["medical prescription\/recipe\/formula"],"pinyin":["chu3 fang1"],"word":"處方"},{"definition":["prescription"],"pinyin":["yao4 fang1"],"word":"藥方"},{"definition":["see 龍眼|龙眼[long2 yan3]"],"pinyin":["gui4 yuan2"],"word":"桂圓"},{"definition":["(TCM) to build up one's kidney yang\/to boost male sex drive"],"pinyin":["zhuang4 yang2"],"word":"壯陽"}]}