{"definition":["to consider as\/to take to be"],"pinyin":["dang4 cheng2"],"simplified":["当成"],"rank":5176.0,"normalized_rank":0.07241895540973514,"fraction":0.00002286900100181716,"cumulative_fraction":0.863075335513413,"word":"當成","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["surname Cheng","to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth"],"pinyin":["Cheng2","cheng2"],"word":"成"}],"containing_words":[],"sentences":[{"english":"Does Bruce see him as a left-winger or a central midfielder?","chinese":"布魯斯會把他當成一個左邊鋒還是中場球員？"},{"english":"Today's companies should think of high-earning singles as a key market.","chinese":"當今的企業應該把高收入的單身族當成重要的市場。"},{"english":"In primitive tribes, dreams were thought to be the indication of God or the haunting of the devil.","chinese":"在原始部落中，夢被當成天神降臨或是妖魔附體。"},{"english":"I entertained myself flicking wheat-based projectiles at the cat.","chinese":"我把小麪糰當成子彈彈向那隻貓，以此來打發時間。"},{"english":"Break the task down into little bits of time. Make it a game.","chinese":"把任務分解成小段的時間，把它當成遊戲。"},{"english":"Don't consider me as CEO. Consider me as your project manager.","chinese":"不要把我當成CEO，就當做是一個項目經理。"},{"english":"Hope everybody to chongqing food web forums for his own family, often at home.","chinese":"希望大家把渝菜網論壇當成自己的家，常回家看看。"},{"english":"Gradually, Li felt at home with the factory and the life.","chinese":"漸漸地，李萬勝把東方汽輪機廠當成了自己的家。"},{"english":"Today, my grandpa who is staying with us mistook me for a Japanese soldier and started to hit me with a bat.","chinese":"今天來家裏住的爺爺把我當成了日本鬼子用球棒打我。"},{"english":"A lot of people here think of Lebanon as the Middle East, as like a war zone.","chinese":"許多人把黎巴嫩當成中東，就好像一個戰區一樣。"},{"english":"Everything I told him seemed to go in one ear and out the other.","chinese":"我告訴他的每件事他好像都當成耳邊風一樣。"},{"english":"Unlabelled terminals must not be used as \"tie points\" for other wires.","chinese":"不可將無標號的接線端當成其它導線的“結點”。"},{"english":"Investing your emotions in someone. That's scary.","chinese":"把對某人的感情當成是投資，是可怕的。"},{"english":"When out of work, treat the job hunt as a full-time job.","chinese":"失業時，要把找工作當成一份全職工作來做。"},{"english":"I was made to look ridiculous because of Fowler, and I defended him.","chinese":"我被當成很好可笑，就因爲科拿，而我是保護他。"},{"english":"I hadn’t expected this. I had been outed as an eco-murderer.","chinese":"我沒想到他會這麼說，我被當成了一個“生態殺手”。"}],"related":[]}