{"definition":["to come to power\/to hold power\/in office"],"pinyin":["dang1 zheng4"],"simplified":["当政"],"rank":29662.0,"normalized_rank":0.4150098638646762,"fraction":9.678316660946104e-7,"cumulative_fraction":0.989918818809746,"word":"當政","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["political\/politics\/government"],"pinyin":["zheng4"],"word":"政"}],"containing_words":[{"definition":["power holder\/current political ruler"],"pinyin":["dang1 zheng4 zhe3"],"word":"當政者"}],"sentences":[{"english":"Gates' performance during the hearing didn't sway the powers that be.","chinese":"蓋茨當時在聽證會上的表現沒能改變當政者的看法。"},{"english":"Darius I, when in power, Zoroastrian as the state religion.","chinese":"大流士一世當政時，瑣羅亞斯德教定爲國教。"},{"english":"First, justice Japan' s Showa period, Tanaka was the first person to warlords in power.","chinese":"田中義一是日本昭和時期軍閥當政的第一人。"},{"english":"As nazism took hold of Germany, however, he saw nazism for what it was.","chinese":"但當納粹黨在德國當政後，他看清了納粹的真面目。"},{"english":"Pericles was in Athens are reaching its peak.","chinese":"伯里克利當政時期雅典臻於鼎盛。"},{"english":"The blame, he said, lay both in George W.","chinese":"奧巴馬說，布什當政時期的美國朝野都應受到指責。"},{"english":"During Colonel Qaddafi’s rule, China had big interests in Libya’s economy.","chinese":"在卡扎菲當政期間，中國在利比亞有龐大的經濟利益。"},{"english":"Neo- conservatism prevailed in the Reagan era.","chinese":"在雷根當政期間，新保守主義盛行。"},{"english":"China’s rulers say corrupt cadres are the nation’s worst enemy.","chinese":"中國當政者說，官員貪污腐敗是國家最大的毒瘤。"},{"english":"Are you saying that those in power should ignore their daughters' educational needs?","chinese":"您說當政者應忽視各家女兒的教育需要嗎？"},{"english":"The Democrats have been in since the hand-over of power.","chinese":"自從權力移交後，民主黨人一直當政。"},{"english":"During the Clinton years, remember there was a controversy donors?","chinese":"克林頓當政期間，有個競價捐款記得吧？"}],"related":[]}