{"definition":["overhead\/up in the sky"],"pinyin":["dang1 kong1"],"simplified":["当空"],"rank":32337.0,"normalized_rank":0.4524365844444755,"fraction":7.663825410251439e-7,"cumulative_fraction":0.992231073326006,"word":"當空","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["empty\/air\/sky\/in vain","to empty\/vacant\/unoccupied\/space\/leisure\/free time"],"pinyin":["kong1","kong4"],"word":"空"}],"containing_words":[],"sentences":[{"english":"The sun so hot, I froze to death.","chinese":"烈日當空，我心卻冰冷。"},{"english":"The moon is lightening, the breeze is blowing the valley.","chinese":"皓月當空，微風輕輕吹過谷底。"},{"english":"The moon shine brightly , the breeze blow across the bottom of gorge slightly.","chinese":"皓月當空，微風輕輕吹過谷底。"},{"english":"Under the hot sun, the student in the middle resorts to a light-colored wig to block the sun.","chinese":"烈日當空，走在中間的學生，索性帶頂淺色假髮遮陽。"},{"english":"A bright moon is shining in the sky.","chinese":"一輪明月當空照。"},{"english":"So bright was the moon that the flowers bright as by day.","chinese":"皓月當空，花朵就像白天那樣的鮮豔。"},{"english":"Provide partial shade from scorching noon or early afternoon sun.","chinese":"在正午和午後烈日當空時，要給他們提供部分遮蔭。"},{"english":"Summer vacation's one day, scorching sun overhead, all appear that peaceful.","chinese":"暑假的一天，烈日當空，一切顯得那麼安靜。"},{"english":"Make hay while the sun shines .","chinese":"烈日當空照，勿忘曬乾草。"},{"english":"Now, with her containers still empty and the sun blazing overhead, she has returned home for a moment's rest.","chinese":"此刻，已是烈日當空，查雅空載而歸，稍作休息。"},{"english":"I yearn for the soaring, even if is scorching sun overhead.","chinese":"我向往飛翔，即便是烈日當空。"},{"english":"So bright is the moon that the flowers are as bright as by day.","chinese":"皓月當空，花朵就像白天那樣鮮豔。"},{"english":"When the sun is shining, you better enjoy as much sunlight as you can.","chinese":"當太陽當空照耀的時候，你最好儘可能多享受點陽光。"},{"english":"As the sun bets down, he swings about.","chinese":"烈日當空，他來回搖擺着。"},{"english":"In the heat people are desperate for water.","chinese":"烈日當空下人們極需要水。"},{"english":"Lying in the red desert, dreaming, sobbing.","chinese":"烈日當空，周邊一片紅色沙漠。"}],"related":[]}