{"definition":["equivalent\/yield"],"pinyin":["dang1 liang4"],"simplified":["当量"],"rank":23292.0,"normalized_rank":0.32588529934380817,"fraction":0.000001732316497970549,"cumulative_fraction":0.9815510596493068,"word":"當量","characters":[{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["capacity\/quantity\/amount\/to estimate\/abbr. for 量詞|量词[liang4 ci2], classifier (in Chinese grammar)\/measure word","to measure"],"pinyin":["liang2","liang4"],"word":"量"}],"containing_words":[{"definition":["dose equivalent"],"pinyin":["ji4 liang4 dang1 liang4"],"word":"劑量當量"},{"definition":["nuclear yield"],"pinyin":["he2 dang1 liang4"],"word":"核當量"},{"definition":["TNT equivalent"],"pinyin":["ti1 en1 ti1 dang1 liang4"],"word":"梯恩梯當量"},{"definition":["equivalent dose"],"pinyin":["dang1 liang4 ji4 liang4"],"word":"當量劑量"},{"definition":["equivalent megatonnage (EMT)"],"pinyin":["deng3 xiao4 bai3 wan4 dun1 dang1 liang4"],"word":"等效百萬噸當量"}],"sentences":[{"english":"The 2006 test produced a yield of less than one kiloton.","chinese":"2006年的試驗當量不超過1千噸。"},{"english":"A new determinating method is presented of the equivalent size of defects for ultrasonic examination of forgings.","chinese":"本文提出了鍛件超聲波探傷缺陷當量尺寸新的測定法。"},{"english":"The relationship between equivalent static load and temperature field has been verified through tests.","chinese":"文中還通過試驗驗證了上述當量靜載與溫度場的關係。"},{"english":"The second way is a methodology for passenger car equivalents at signalized intersections of city.","chinese":"第二種是關於城市道路交叉口小客車當量換算的方法。"},{"english":"Equivalent I. Q. I. sensitivity .","chinese":"象質指示器當量靈敏度。"},{"english":"The atomic bomb dropped on Hiroshima had a yield of20 kilotons .","chinese":"落在廣島的原子彈產生出二萬噸的當量。"},{"english":"Weighted average functionality possess additivity by equivalent number fraction.","chinese":"重均官能度具有按當量數分數加和的性質。"},{"english":"A method of calculating condensate equivalent gas volume is shown in this paper.","chinese":"本文提供了計算凝析油當量氣體體積的方法。"},{"english":"Using that equation, a ton of methane emissions is the equivalent of 21 tons of carbon dioxide.","chinese":"因此，甲烷的二氧化碳當量折算因子就是21倍。"},{"english":"The fuel-air equivalence ratio and fuel injection location affect the configuration of flame.","chinese":"火焰結構受燃料噴射位置和油氣當量比的影響。"},{"english":"The raw cotton equivalent of imported textiles was 1.8 million bales in calendar 1978.","chinese":"1978年自然年度進口的原棉當量爲一百八十萬包。"},{"english":"Kodak company describes open chain reactive methylene two-equivalent yellow-forming conplers.","chinese":"柯達敘述了一種直鏈的活性亞甲基兩當量的黃成色劑。"},{"english":"The normality of a solution of a base is equal to the number of equivalents of acid it can neutralize.","chinese":"鹼液的當量濃度等於能中和它的酸的當量數。"},{"english":"The normality of a solution of a base is equal to the number of equivalents of acid it can neutralize.","chinese":"鹼液的當量濃度等於能中和它的酸的當量數。"},{"english":"For now, it is the only 60-watt-equivalent LED that people can actually buy.","chinese":"直到現在，消費者只能買到60瓦特當量的LED。"},{"english":"The equivalent hot spot method for riser design has the advantages of direct visual and simple calculation.","chinese":"冒口的當量熱節設計法，概念直觀，計算簡單。"}],"related":[]}