{"definition":["superposition\/layering\/overlay"],"pinyin":["die2 jia1"],"simplified":["叠加"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"疊加","characters":[{"definition":["to fold\/to fold over in layers\/to furl\/to layer\/to pile up\/to repeat\/to duplicate"],"pinyin":["die2"],"word":"疊"},{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"}],"containing_words":[{"definition":["superposition of states (quantum mechanics)"],"pinyin":["tai4 die2 jia1"],"word":"態疊加"}],"sentences":[{"english":"The method of noise source identification and location based on Wave Superposition Method(WSM) is proposed.","chinese":"提出了基於波疊加的噪聲源識別和定位方法。"},{"english":"Euclidean quantum gravity applies the superposition principle to the entire universe.","chinese":"歐氏量子重力將疊加原理套用到整個宇宙。"},{"english":"The temperature maps were overlayed on the anatomic images for monitoring the treatment.","chinese":"將溫度圖疊加在解剖圖上治療監控。"},{"english":"The corresponding field state consists of two displaced Fock states.","chinese":"相應的光場態爲兩個位移福克態的疊加。"},{"english":"EPC(Electronic Product Code) network is a communi cational network that is on the Internet.","chinese":"EPC網絡是疊加在互聯網上的一層通信網絡。"},{"english":"The hierarchical overlapping design gives the bathroom the sense of larger space.","chinese":"層次疊加設計，令浴室更添空間感。"},{"english":"This implicates that overlaying images could not be used.","chinese":"這就意味着疊加的圖像就不行了。"},{"english":"By using the concept of generalized simply supported edge together with the method of superposition, we can solve this problem.","chinese":"用廣義簡支邊這個概念及疊加法，就可以解這類問題。"},{"english":"The synonymous reduplication is a unique linguistic phenomenon in Korean.","chinese":"同義疊加是朝鮮語特有的一種語言現象。"},{"english":"The plate-shaped transparent member overlies a display screen.","chinese":"板狀透明構件疊加在顯示屏上。"},{"english":"Open the Layer Style box and change the \"Dolor Overlay\" to whellote.","chinese":"打開圖層範式中，轉變“色彩疊加”爲白的色彩。"},{"english":"Lower RMSD values were obtained, indicating a better superposition of the structures in the sets.","chinese":"較低的均方根偏差值，獲得更好的疊加顯示的結構套。"},{"english":"I decided to overlay white line work onto the rendering to give the illustration a little more texture.","chinese":"我決定在渲染圖上疊加白色線條，使其多一些紋理。"},{"english":"The overprinted part of the early and late stages is the ore shoot part in the ore area.","chinese":"早晚兩期成礦疊加部位構成礦區內富礦段。"},{"english":"An analysis is made on the characteristics of multimode coherent superposition state light field higher-order squeezing.","chinese":"研究了多模相干疊加態光場的高次壓縮特性。"},{"english":"By superposing the single factor diagenetic facies, the comprehensive diagenetic facies were determined.","chinese":"在此基礎上進行了平面疊加，確定了綜合成巖相。"}],"related":[{"definition":["effect (scientific phenomenon)"],"pinyin":["xiao4 ying4"],"word":"效應"},{"definition":["to present clearly\/to give prominence to\/to magnify\/clear and obvious"],"pinyin":["tu1 xian3"],"word":"凸顯"},{"definition":["to spur\/to provide impetus\/to drive"],"pinyin":["dai4 dong4"],"word":"帶動"},{"definition":["to contrast\/contrast\/ratio\/CL:個|个[ge4]"],"pinyin":["dui4 bi3"],"word":"對比"},{"definition":["to overlap\/to superimpose\/to telescope\/to run together\/to duplicate\/one over another\/superposition\/an overlap\/redundancy\/reduplication (in Chinese grammar, e.g. 散散步[san4 san4 bu4] to have a stroll)"],"pinyin":["chong2 die2"],"word":"重疊"},{"definition":["appearance\/to appear"],"pinyin":["xian3 xian4"],"word":"顯現"},{"definition":["area\/region\/district"],"pinyin":["qu1 yu4"],"word":"區域"},{"definition":["slab\/(geology) tectonic plate\/(fig.) sector (of the stock market or of industry)\/(economic) bloc"],"pinyin":["ban3 kuai4"],"word":"板塊"},{"definition":["to interweave"],"pinyin":["jiao1 zhi1"],"word":"交織"},{"definition":["main part\/bulk\/body\/subject\/agent"],"pinyin":["zhu3 ti3"],"word":"主體"},{"definition":["to drive\/to propel\/drive (vehicle wheel)\/drive mechanism (tape or disk)\/device driver (computing software)"],"pinyin":["qu1 dong4"],"word":"驅動"},{"definition":["double"],"pinyin":["shuang1 chong2"],"word":"雙重"},{"definition":["variant of 衝擊|冲击[chong1 ji1]"],"pinyin":["chong1 ji1"],"word":"沖擊"},{"definition":["conspicuous\/to make sth stand out\/make sth prominent"],"pinyin":["tu1 xian3"],"word":"突顯"},{"definition":["along with\/in the wake of\/following"],"pinyin":["sui2 zhe5"],"word":"隨著"},{"definition":["relatively\/opposite\/to resist\/to oppose\/relative\/vis-a-vis\/counterpart"],"pinyin":["xiang1 dui4"],"word":"相對"}]}