{"definition":["sick personnel\/person on the sick list\/patient"],"pinyin":["bing4 yuan2"],"simplified":["病员"],"rank":40094.0,"normalized_rank":0.5609670784771872,"fraction":3.8216942712453843e-7,"cumulative_fraction":0.9965247395408696,"word":"病員","characters":[{"definition":["illness\/CL:場|场[chang2]\/disease\/to fall ill\/defect"],"pinyin":["bing4"],"word":"病"},{"definition":["person\/employee\/member"],"pinyin":["yuan2"],"word":"員"}],"containing_words":[{"definition":["the sick and the wounded"],"pinyin":["shang1 bing4 yuan2"],"word":"傷病員"}],"sentences":[{"english":"Patients must not be attacked, and ambulances and hospitals must not be misused.","chinese":"不得襲擊傷病員，不得將救護車和醫院用於其他目的。"},{"english":"The number of the sick was increasing with appalling rapidity .","chinese":"病員的數量正以驚人的速度增加。"},{"english":"The nurse always treated the sick and wounded with kindness.","chinese":"這位護士總是以藹然可親的態度對待傷病員。"},{"english":"Because of the huge number of patients, these hospitals need more doctors.","chinese":"由於傷病員的數目驚人，這些醫院需要更多的醫生。"},{"english":"To place medicine on a wound.","chinese":"護士正在給傷病員敷藥。"},{"english":"The sick and wounded were soon taken to hospital.","chinese":"傷病員很快被送往醫院。"},{"english":"But the man was already dead and the patients were laughing to see the orderly trying to wake a dead man.","chinese":"病員們都笑那個護理員在叫一個死人醒過來。"},{"english":"ObjectiveTo evaluate the effect of initial consultation system in order to provide satisfactory service for patients.","chinese":"目的評估首問負責制的效果，爲病員提供滿意的服務。"},{"english":"The nurse is applying the medicine to the injured soldier.","chinese":"護士正在給傷病員敷藥。"},{"english":"The nurses helped the wounded soldiers into the hospital.","chinese":"護士們攙扶着傷病員走進醫院。"},{"english":"The wounded are being taken good care of here now.","chinese":"現在傷病員們在這裏受到了很好照顧。"},{"english":"We hid our patients in the shelter during the war.","chinese":"戰爭年代我們把傷病員藏在掩蔽部。"},{"english":"The fog particles are sent to patients through a faceshield or an inhaler.","chinese":"該霧粒通過面罩或吸入器送至病員。"}],"related":[]}