{"definition":["pathological science (TCM)"],"pinyin":["bing4 yin1 xue2"],"simplified":["病因学"],"rank":62497.0,"normalized_rank":0.8744141144208303,"fraction":2.7151838596319382e-8,"cumulative_fraction":0.9999001648791512,"word":"病因學","characters":[{"definition":["illness\/CL:場|场[chang2]\/disease\/to fall ill\/defect"],"pinyin":["bing4"],"word":"病"},{"definition":["cause\/reason\/because"],"pinyin":["yin1"],"word":"因"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"In recent year, it is found that the part etiology of ophthalmopathy is associated with toxoplasmosis infection.","chinese":"近年研究還發現一些眼病與弓形蟲感染有病因學聯繫。"},{"english":"Objective To explore the clinical and etiology characteristics of cerebral infarction in juvenile.","chinese":"目的研究青少年腦梗死的臨牀特徵及病因學特點。"},{"english":"What is the etiology for myocardial dysfunction observed with AFE?","chinese":"AFE出現心肌功能障礙的病因學？"},{"english":"Objective To investigate the status of vascular endothelial cell in proliferative and involutive hemangioma.","chinese":"目的探討血管瘤內皮細胞功能及其病因學意義。"},{"english":"Conclu sion Etiological research on pedophilia has lagged behind the developments in assessment methods.","chinese":"結論戀童癖病因學研究遠落後於評估。"},{"english":"Objective To investigate whether genomic imprinting is involved in the etiology of tic disorder.","chinese":"目的研究遺傳印跡是否與抽動障礙的遺傳病因學有關。"},{"english":"We discuss the etiology of the PIH in the following three parts.","chinese":"本研究分爲三部分對妊高徵的病因學進行探討。"},{"english":"The urban environment is an important factor in the research of lung cancer etiology.","chinese":"城市環境因素是肺癌病因學研究中的重要內容。"},{"english":"This model was helpful for the investigation of pathogenesis and therapeutics of endometritis.","chinese":"該模型可用於子宮內膜炎病因學和治療學的研究。"},{"english":"The present study is to analyse the current etiology and classification of scoliosis .","chinese":"本研究探討脊柱側凸最近的病因學構成和發展情況。"},{"english":"So are the Aetiology and Effect Measure blogs.","chinese":"病因學和效應測量的博客也是如此。"}],"related":[]}