{"definition":["to bawl out\/to reprimand severely"],"pinyin":["tong4 ma4"],"simplified":["痛骂"],"rank":29964.0,"normalized_rank":0.4192352356834049,"fraction":9.454970891847345e-7,"cumulative_fraction":0.990207879765064,"word":"痛罵","characters":[{"definition":["ache\/pain\/sorrow\/deeply\/thoroughly"],"pinyin":["tong4"],"word":"痛"},{"definition":["to scold\/to abuse\/to curse\/CL:通[tong4],頓|顿[dun4]"],"pinyin":["ma4"],"word":"罵"}],"containing_words":[],"sentences":[{"english":"When she said that,I belted into her.","chinese":"她說了那事以後，我痛罵了她一頓。"},{"english":"He jumped his son out.","chinese":"他把他的兒子痛罵了一頓。"},{"english":"In Green's invective there is the starveling author's jealousy of the prosperous actor.","chinese":"格林的痛罵聲裏包含潦倒作家對發跡演員的嫉妒。"},{"english":"If she does that again I'll really give her a piece of my mind.","chinese":"如果她再做，我真的要痛罵她一頓了。"},{"english":"You'll catch it if Mrs Brown finds you trampling on her flowers beds.","chinese":"如果布朗太太發現你踩她的花壇，你會挨一頓痛罵。"},{"english":"The boss sailed into me for leaving the office unlocked when I went to lunch.","chinese":"就因爲我去喫午餐沒把門鎖上，老闆痛罵了我一頓。"},{"english":"The boss rapped me on knuckles for failing to spot the mistake.","chinese":"老闆因我不能找出差錯而痛罵了我一頓。"},{"english":"Is biting your daughter's head off for academic reasons justified?","chinese":"爲了學業原因痛罵女兒，正當合理嗎？"},{"english":"Working late into the night, Niederhoffer berated himself for leaving himself so exposed.","chinese":"尼德霍夫工作到深夜，痛罵自己的倉位太重。"},{"english":"She abused him soundly for his neglect.","chinese":"因疏忽被她痛罵了一頓。"},{"english":"The boy asked for a leave to watch the football match. When he returned his father gave him Jessie.","chinese":"那男孩請假去看足球賽，回來時被他父親痛罵了一頓。"},{"english":"Fishermen blasted officials after octopus prices plummeted. \"The fishermen here are dumbfounded , \" said Im Hyun-ki, head of an octopus production association in South Jeolla province.","chinese":"在章魚的價格暴跌後，漁民們詛咒痛罵政府官員。"},{"english":"He vituperated his son.","chinese":"他痛罵他的兒子。"},{"english":"He greeted me with a stream of abuse, which made me feel sad.","chinese":"他迎面對我一頓痛罵，這使我很難過。"},{"english":"You will be skinned alive by your mother.","chinese":"你準會挨你母親一頓痛罵。"},{"english":"I let him have his say, and then I laid into him.","chinese":"我讓他把話說完，然後把他痛罵了一頓。"}],"related":[{"definition":["dumbstruck and unable to reply (idiom); left speechless\/at a loss for words"],"pinyin":["ya3 kou3 wu2 yan2"],"word":"啞口無言"},{"definition":["to smash"],"pinyin":["za2 lan4"],"word":"砸爛"},{"definition":["to sow dissension (idiom); to drive a wedge between"],"pinyin":["tiao3 bo1 li2 jian4"],"word":"挑撥離間"},{"definition":["to use violence (against sb)\/to strong-arm sb\/to manhandle"],"pinyin":["dong4 cu1"],"word":"動粗"},{"definition":["to fight back\/to return fire\/to counterattack"],"pinyin":["hui2 ji1"],"word":"回擊"},{"definition":["to be furious\/to fly into a terrible rage"],"pinyin":["da4 fa1 lei2 ting2"],"word":"大發雷霆"},{"definition":["to shout and scream (idiom); to kick up a fuss\/to make a scene"],"pinyin":["da4 chao3 da4 nao4"],"word":"大吵大鬧"},{"definition":["lit. change to more severe (idiom); to become more intense (esp. of shortcoming)\/to aggravate\/to intensify"],"pinyin":["bian4 ben3 jia1 li4"],"word":"變本加厲"},{"definition":["to call loudly (idiom); to get people's attention\/to make one's views known"],"pinyin":["da4 sheng1 ji2 hu1"],"word":"大聲疾呼"},{"definition":["lit. to punch and kick (idiom); to beat up\/fig. determined to sort out a problem"],"pinyin":["quan2 da3 jiao3 ti1"],"word":"拳打腳踢"},{"definition":["gongs and drums overture to a Chinese opera\/to create a disturbance"],"pinyin":["nao4 chang3"],"word":"鬧場"},{"definition":["vocal accompaniment in some traditional Chinese operas\/to speak in support of\/to chime in"],"pinyin":["bang1 qiang1"],"word":"幫腔"},{"definition":["to condemn in speech and in writing (idiom)\/to denounce by word and pen"],"pinyin":["kou3 zhu1 bi3 fa2"],"word":"口誅筆伐"},{"definition":["the trick of injuring oneself to gain the enemy's confidence\/CL:條|条[tiao2]"],"pinyin":["ku3 rou4 ji4"],"word":"苦肉計"},{"definition":["to offend"],"pinyin":["re3 nao3"],"word":"惹惱"},{"definition":["the content of a conversation\/words\/remarks"],"pinyin":["yi1 xi2 hua4"],"word":"一席話"}]}