{"definition":["plasmodium (malaria parasite)"],"pinyin":["nu:e4 yuan2 chong2"],"simplified":["疟原虫"],"rank":51241.0,"normalized_rank":0.7169280707399998,"fraction":1.2583271435498553e-7,"cumulative_fraction":0.9991272406427268,"word":"瘧原蟲","characters":[{"definition":["malaria","see 瘧子|疟子[yao4 zi5]"],"pinyin":["nu:e4","yao4"],"word":"瘧"},{"definition":["Hara (Japanese surname)","former\/original\/primary\/raw\/level\/cause\/source"],"pinyin":["Yuan2","yuan2"],"word":"原"},{"definition":["lower form of animal life, including insects, insect larvae, worms and similar creatures\/CL:條|条[tiao2],隻|只[zhi1]\/(fig.) person with a particular undesirable characteristic"],"pinyin":["chong2"],"word":"蟲"}],"containing_words":[{"definition":["plasmodium falciparum (malaria parasite)"],"pinyin":["e4 xing4 nu:e4 yuan2 chong2"],"word":"惡性瘧原蟲"}],"sentences":[{"english":"After inoculation with P. yoelii, parasites disappeared naturally, but with P. berghei…","chinese":"但接種伯氏瘧原蟲後的陽性小鼠則不能自然轉陰。"},{"english":"P. vivax has been neglected because it is rarely fatal.","chinese":"間日瘧原蟲被人們忽略，這是由於它很少導致死亡。"},{"english":"has been neglected because it is rarely fatal.","chinese":"間日瘧原蟲被人們忽略，這是由於它很少導致死亡。"},{"english":"A static cultivation apparatus for the culture in vitro of Plasmodium falciparum gametocytes is described.","chinese":"應用自制恆溫恆氣裝置靜態培養惡性瘧原蟲配子體。"},{"english":"Many of these targeted places on the malarial parasite different from the places targeted by current drugs.","chinese":"其中許多化合物瞄準了不同於目前藥物的瘧原蟲部位。"},{"english":"Objective To induce a line of Plasmodium berghei with resistance to artemisinin.","chinese":"目的培育伯氏瘧原蟲青蒿素抗性系。"},{"english":"The life cycle of Plasmodium parasites is known to depend on temperature.","chinese":"已知瘧原蟲的生命史依賴於溫度。"},{"english":"Now, the Duffy blood-group protein is essentially necessary for Plasmodium vivax to get into the red cell.","chinese":"現在間日瘧原蟲必須依靠達菲蛋白進入紅細胞。"},{"english":"The research of proteomics is one of the important studies on Plasmodium .","chinese":"蛋白組學研究是瘧原蟲研究中的重要組成部分。"},{"english":"Only the drug derived from Artemisia annua appears to be effective against all strains of the malaria parasite.","chinese":"只有從青蒿中提取的藥物對所有類型的瘧原蟲都有效。"},{"english":"The evolution of drug-resistant Plasmodium strains, especially those resistant to chloroquine, has had major impacts on global public health.","chinese":"抗藥性瘧原蟲的發生已經嚴重影響到全球健康。"},{"english":"When malign plasmodium parasitism, film of red blood cell has the drawback with irregular height.","chinese":"惡性瘧原蟲寄生時，紅細胞膜有高度不規則的缺陷。"},{"english":"Multidrug-resistant Plasmodium falciparum malaria is also widely prevalent in south-east Asia and South America.","chinese":"耐多藥惡性瘧原蟲瘧疾在東南亞和南美洲也廣泛流行。"},{"english":"Malaria parasites reside in bubbles, called vacuoles, inside infected cells.","chinese":"瘧原蟲位於感染細胞的空泡中，這些空泡被稱作液泡。"},{"english":"ABSTEACT. AIM To study the infectivity of different densities of P. vivax to An. sinensis.","chinese":"目的觀察不同密度間日瘧原蟲對中華按蚊的感染性。"},{"english":"However, the infected mice challenged with the heterologous strain of plasmodia were died completely.","chinese":"而異種瘧原蟲攻擊時小鼠全部感染並死亡。"}],"related":[]}