{"definition":["hard lump in the abdomen (in Chinese medicine)\/crux of an issue\/main point in an argument\/sticking point\/deadlock in negotiations"],"pinyin":["zheng1 jie2"],"simplified":["症结"],"rank":16024.0,"normalized_rank":0.224196549746058,"fraction":0.000003663746478980774,"cumulative_fraction":0.9630280835336428,"word":"癥結","characters":[{"definition":["abdominal tumor\/bowel obstruction\/(fig.) sticking point"],"pinyin":["zheng1"],"word":"癥"},{"definition":["(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]","knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)"],"pinyin":["jie1","jie2"],"word":"結"}],"containing_words":[],"sentences":[{"english":"That is the entire stalker problem right there.","chinese":"這纔是整個跟蹤狂問題的癥結所在。"},{"english":"This is where the root-cause lies.","chinese":"這是問題的癥結所在。"},{"english":"Instead of imagining lobotomizing us, turning us into rats, suppose we just say, look, the problem is really this.","chinese":"這次不用額葉切除術把我們變成老鼠，問題的癥結是。"},{"english":"Many people can feel the body, often lies in the support psychological.","chinese":"許多人感到身體支持不住，往往癥結在於心理上。"},{"english":"The efficience of industrial enterprises is the crux of many contradictions.","chinese":"工業企業效益差是當前許多矛盾的癥結所在。"},{"english":"Mikes explanation made the problem clear to me.","chinese":"麥克的解釋讓我明白了這個問題的癥結。"},{"english":"Possibly alimony was the stumbling-block.","chinese":"也可能癥結是他拿不出贍養費。"},{"english":"The few profit of industry is the sticking point of many contradictions currently.","chinese":"工業企業效益差是當前許多矛盾的癥結所在。"},{"english":"All the contradictions existing in industrial enterprises today boil down to scanty economic returns.","chinese":"工業企業效益差是當前許多矛盾的癥結所在。"},{"english":"How did I get the client back on track?","chinese":"我是如何幫助這家公司找到癥結，走上正軌？"},{"english":"I mean, that is why breakups and divorces exist, right?","chinese":"難道這不正是分手和離婚的癥結所在嗎？"},{"english":"So it comes down to this, Killian.","chinese":"啊，所以這就是問題的癥結，基利安。"},{"english":"Engineering are endeavoring to locate the source of the problem.","chinese":"工程師們正努力尋找問題的癥結所在。"},{"english":"The culprit of the plight is our mediocre coaches in basic levels.","chinese":"基層教練水平低下是籃球后繼乏人的癥結所在。"},{"english":"Herein lies the nub of the problem.","chinese":"這正是問題的癥結所在。"},{"english":"For News Corp., it's the reason the trouble is far from over.","chinese":"對於新聞集團來說，這也是其麻煩不斷的癥結所在。"}],"related":[]}