{"definition":["to publish\/to appear (in print)"],"pinyin":["deng1 chu1 lai2"],"simplified":["登出来"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"登出來","characters":[{"definition":["to scale (a height)\/to ascend\/to mount\/to publish or record\/to enter (e.g. in a register)\/to press down with the foot\/to step or tread on\/to put on (shoes or trousers) (dialect)\/to be gathered and taken to the threshing ground (old)"],"pinyin":["deng1"],"word":"登"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"}],"containing_words":[],"sentences":[{"english":"Yes. I want to apply for a job you posted on the Internet yesterday.","chinese":"我想申請你們昨天在網上登出來的職位。"},{"english":"Being with Beckham is a guaranteed good-news story.","chinese":"和貝克漢姆在一起登出來保證是受歡迎的故事。"},{"english":"Girls also had a fondness for including photos from childhood.","chinese":"女生們還愛把小時候的照片也登出來。"},{"english":"61—He wants it in for July, Mr Bloom said.","chinese":"“他希望七月裏登出來，”布盧姆先生說。"},{"english":"The affair will come out in the newspapers.","chinese":"這件事會在報上登出來。"},{"english":"A week later, her complete report was printed in the newspaper, inclu.","chinese":"一週以後，她這篇完整的報道在報上登出來了，點。"},{"english":"She does this ahead of publication. That is a strategy.","chinese":"書出版之前她就要登出來，這是策略。"},{"english":"The news has been published in the newspaper.","chinese":"消息已在報上登出來了。"},{"english":"The story broke in the evening papers.","chinese":"這報道在晚報登出來了。"},{"english":"The affair will come out in the newspaper.","chinese":"這件事將在報上登出來。"},{"english":"The next day the ad appeared.","chinese":"第二天，廣告登出來了。"}],"related":[]}