{"definition":["to post (an item on a forum)"],"pinyin":["fa1 tie3"],"simplified":["发帖"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"發帖","characters":[{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"},{"definition":["fitting snugly\/appropriate\/suitable\/variant of 貼|贴[tie1]\/to paste\/to obey","invitation card\/notice","rubbing from incised inscription"],"pinyin":["tie1","tie3","tie4"],"word":"帖"}],"containing_words":[],"sentences":[{"english":"Now the post has become an effective means of promotion.","chinese":"現在發帖子成爲人們進行推廣的一種有效手段。"},{"english":"In both cases the women accused of posting the profiles denied it.","chinese":"兩個案子中，被指稱發帖的女性都矢口否認。"},{"english":"Nobody will publish your guest posts, and nobody will link to you.","chinese":"沒人會發表你的來賓發帖，也不會有人鏈接你。"},{"english":"Ahhh. Now go drink something strong, it's time to talk about posting.","chinese":"現在喝些提神的飲料，因爲我們要開始討論發帖了。"},{"english":"This is the story: about three years ago, they posted their the articles.","chinese":"那是三年前，他們在清地發帖子。"},{"english":"I was the only one who do not wish to post.","chinese":"希望不要只有我一個人發帖。"},{"english":"Postings are anonymous, which encourages users to give unvarnished views.","chinese":"發帖都是匿名的，這鼓勵用戶提出真實的觀點。"},{"english":"Still go studying moss-grown person energy of life and hair post measure.","chinese":"還是去學習落伍的人氣和發帖數量吧。"},{"english":"After the event, please post a follow-up activities will be reported.","chinese":"活動結束後，請及時將活動內容進行後續發帖報道。"},{"english":"The poster said they had suspicions of physical symptoms of AIDS.","chinese":"發帖者說，他們的身體出現疑似艾滋病症狀。"},{"english":"In the body of post write amount of posts and your e-currency account.","chinese":"在帖子裏註明你發帖數量和你的網銀。"},{"english":"Postings to the new category would cost $10 and can be renewed for $5.","chinese":"新類別的發帖費是10美元，續期費是5美元。"},{"english":"Which is why today's posts are a bit less than usual.","chinese":"爲什麼今天的發帖數比平時的少呢？"},{"english":"His face looks familiar. Seems he was introduced before somewhere.","chinese":"小盆友有點面熟，好像以前發帖介紹過他。"},{"english":"Current, this sends Cong Mou of bloodguilty of post offer a reward to already was detained by public security on the net.","chinese":"目前，這位在網上發帖懸賞殺人的叢某已被治安拘留。"},{"english":"Please post it on Chinese forum.","chinese":"如果你想用中文發帖，請到中文論壇。"}],"related":[{"definition":["to stick\/to paste\/to post (e.g. on a blog)\/to keep close to\/to fit snugly\/to subsidize\/allowance (e.g. money for food or housing)\/sticker\/classifier for sticking plaster: strip"],"pinyin":["tie1"],"word":"貼"},{"definition":["to make a speech\/statement\/utterance\/CL:個|个[ge4]"],"pinyin":["fa1 yan2"],"word":"發言"},{"definition":["don't tell me ...\/could it be that...?"],"pinyin":["nan2 dao4"],"word":"難道"},{"definition":["to think (i.e. to take it to be true that ...) (Usually there is an implication that the notion is mistaken – except when expressing one's own current opinion.)"],"pinyin":["yi3 wei2"],"word":"以為"},{"definition":["online"],"pinyin":["wang3 shang4"],"word":"網上"},{"definition":["as for\/when it comes to"],"pinyin":["yao4 shuo1"],"word":"要說"},{"definition":["It is said that ... (at the start of a narrative)\/to discuss\/to recount"],"pinyin":["hua4 shuo1"],"word":"話說"},{"definition":["to come in"],"pinyin":["jin4 lai2"],"word":"進來"},{"definition":["original poster (in an online forum)\/landlord of a building (traditional)"],"pinyin":["lou2 zhu3"],"word":"樓主"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"},{"definition":["to stand in a circle and watch"],"pinyin":["wei2 guan1"],"word":"圍觀"},{"definition":["to disturb\/to look for trouble\/to stir up a row\/to bother sb intentionally"],"pinyin":["dao3 luan4"],"word":"搗亂"},{"definition":["to help\/to assist\/to support\/for sb (i.e. as a help)\/hired (as worker)\/side (of pail, boat etc)\/outer layer\/upper (of a shoe)\/group\/gang\/clique\/party\/secret society"],"pinyin":["bang1"],"word":"幫"},{"definition":["to play a joke\/to make fun of\/to joke"],"pinyin":["kai1 wan2 xiao4"],"word":"開玩笑"},{"definition":["to swear or curse (at people)\/to scold or yell at someone"],"pinyin":["ma4 ren2"],"word":"罵人"},{"definition":["group"],"pinyin":["xiao3 zu3"],"word":"小組"}]}