{"definition":["to send back\/to return"],"pinyin":["fa1 hui2"],"simplified":["发回"],"rank":16108.0,"normalized_rank":0.22537181872875076,"fraction":0.0000036271060946384285,"cumulative_fraction":0.9633343416752466,"word":"發回","characters":[{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"},{"definition":["to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)"],"pinyin":["hui2"],"word":"回"}],"containing_words":[],"sentences":[{"english":"A spectrum is then obtained and telemetered to the ground.","chinese":"然後記錄它的光譜，並將數據通過遙測系統發回地面。"},{"english":"Thanks Tony Dai report back.","chinese":"感謝戴貝發回的報道。"},{"english":"The Soyuz wasn't able to send the high quality pictures back to Earth live.","chinese":"聯盟號無法將高清高質量的照片發回到地面。"},{"english":"This is its first processed color image since entering Mercury orbit.","chinese":"這是信使號進入水星軌道後發回的首張彩色照片。"},{"english":"The relation between the remand for new trial and the principle of no appeal resulting in additional punishment is seldom discussed before.","chinese":"發回重審和上訴不加刑原則的關係問題很少有人論及。"},{"english":"Chirst Morris reports from Kabul.","chinese":"莫里斯從喀布爾發回報道稱。"},{"english":"The three part introduces the opinions of improving the remanding re-trial in the criminal appeal trial.","chinese":"第三部分完善我國刑事二審發回重審制度的建議。"},{"english":"Lizzy Davies reports from Amsterdam's Schiphol airport Link to this audio","chinese":"麗姿從阿姆斯特丹斯希波爾機場發回的報道。"},{"english":"Thirdly, the stipulation of remanding for the problems of substantive disposition should be cancelled too.","chinese":"三是取消實體處理有問題可以發回重審這一規定。"},{"english":"Any law returned by the Standing Committee of the National People's Congress shall immediately be invalidated.","chinese":"經全國人民代表大會常務委員會發回的法律立即失效。"},{"english":"Therefore, it is urgently needed to reform and perfect.","chinese":"因此，我國發回重審制度亟待改革與完善。"},{"english":"Our Africa editor Mary Harper reports on the documents presented in court.","chinese":"下面是本臺記者發回的法庭文件報道。"},{"english":"Also, for the first time, the new rover will send video back to Earth.","chinese":"這個新的流動站也會在第一時間內把錄像發回地球。"},{"english":"This information is sent as a setup message by the signaling gateway back to the MGC.","chinese":"這種消息作爲建立的消息由信令網關發回給mgc。"},{"english":"The output result is then sent back to the invoker.","chinese":"於是輸出結果就會發回給調用者。"},{"english":"ANasa probe has sent back photographs of what appear to be trees on theplanet's surface.","chinese":"美國宇航局探測器發回看似星球表面樹木的照片。"}],"related":[]}