{"definition":["to excavate\/to explore\/(fig.) to unearth\/to tap into"],"pinyin":["fa1 jue2"],"simplified":["发掘"],"rank":5960.0,"normalized_rank":0.08338813258153427,"fraction":0.0000187093685243864,"cumulative_fraction":0.8792484794061317,"word":"發掘","characters":[{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"},{"definition":["to dig"],"pinyin":["jue2"],"word":"掘"}],"containing_words":[],"sentences":[{"english":"The Keqiutou site (NP) excavated in Fujian.","chinese":"福建殼丘頭遺址發掘。"},{"english":"Arnesen has been given the role of head talent scout, in charge of uncovering football talents.","chinese":"阿內森被任命爲球探總管，負責發掘足球天才。"},{"english":"Then, they will find a way to search and know that person well.","chinese":"然後，探祕將會找到能更好發掘和了解的道路。"},{"english":"In this paper, we analyze and summarize Lü Zuqian's learning psychology.","chinese":"本文對呂祖謙的學習心理思想進行了發掘和整理。"},{"english":"Nevertheless, to quiet public opinion an exhumation order was granted.","chinese":"然而，要平定公衆意見就必須准許屍體發掘的工作。"},{"english":"The excavation of the necropolis has prominent academic meanings.","chinese":"這批土墩墓的發掘具有重要的學術意義。"},{"english":"We found the bones of these animals.","chinese":"我們發掘了這些動物的骨頭。"},{"english":"Recent excavations have revealed two main Neolithic cultures lying in stratified sequence.","chinese":"近年的考古發掘，主要顯示兩個新石器時代的文化層。"},{"english":"The studio has great potential to tap its visual resource.","chinese":"可以說，新影的影像資料具有極大的發掘潛力。"},{"english":"It is the first imperial mausoleum excavated on the approval of the State Council.","chinese":"是第一座由國務院批准有計劃發掘的皇陵。"},{"english":"Warriors in array the excavations opening up to the world and sensation.","chinese":"俑陣經發掘對外開放後便轟動世界。"},{"english":"Then I decided to v14)cultivate his talent.","chinese":"父親說，“於是我決定發掘培養他的這種天賦。”"},{"english":"Landor's challenge was to identify the elements relevant for the Chinese pack.","chinese":"郎濤的挑戰就是發掘和中國包裝相關的元素。"},{"english":"It's a very new technology so nobody has picked it up and commercialised it.","chinese":"這是一項非常新的技術，還未被完全發掘並商業化。"},{"english":"Archaeological discovery has shown that Beijing is a cradle of the Chinese nation.","chinese":"考古發掘表明，北京是中華民族的發源地之一。"},{"english":"Cosmoprof Asia is the definitive venue to find new products and ideas.","chinese":"亞太區美容展是發掘新產品及意念的最佳平臺。"}],"related":[{"definition":["to seek\/to look for"],"pinyin":["xun2 zhao3"],"word":"尋找"},{"definition":["to investigate\/to probe"],"pinyin":["tan4 tao3"],"word":"探討"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"發展"},{"definition":["to try\/to attempt\/CL:次[ci4]"],"pinyin":["chang2 shi4"],"word":"嘗試"},{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"word":"展現"},{"definition":["to create\/to bring about\/to produce\/to set (a record)"],"pinyin":["chuang4 zao4"],"word":"創造"},{"definition":["to search\/to seek\/to explore"],"pinyin":["tan4 xun2"],"word":"探尋"},{"definition":["to look for\/to seek\/to find fault"],"pinyin":["zhao3 xun2"],"word":"找尋"},{"definition":["to participate (in sth)"],"pinyin":["can1 yu4"],"word":"參與"},{"definition":["to exploit (a resource)\/to open up (for development)\/to develop"],"pinyin":["kai1 fa1"],"word":"開發"},{"definition":["to break new ground (for agriculture)\/to open up (a new seam)\/to develop (border regions)\/fig. to open up (new horizons)"],"pinyin":["kai1 tuo4"],"word":"開拓"},{"definition":["to decipher\/to decode\/to interpret"],"pinyin":["jie3 du2"],"word":"解讀"},{"definition":["to create\/to produce\/to write\/creative work\/creation\/CL:個|个[ge4]"],"pinyin":["chuang4 zuo4"],"word":"創作"},{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"word":"實踐"},{"definition":["to extend\/to spread\/to popularize\/generalization\/promotion (of a product etc)"],"pinyin":["tui1 guang3"],"word":"推廣"},{"definition":["value\/worth\/fig. values (ethical, cultural etc)\/CL:個|个[ge4]"],"pinyin":["jia4 zhi2"],"word":"價值"}]}