{"definition":["to award a prize"],"pinyin":["fa1 jiang3"],"simplified":["发奖"],"rank":35652.0,"normalized_rank":0.4988177353686008,"fraction":5.726702301793599e-7,"cumulative_fraction":0.9944323620733392,"word":"發獎","characters":[{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"},{"definition":["prize\/award\/encouragement\/CL:個|个[ge4]"],"pinyin":["jiang3"],"word":"獎"}],"containing_words":[],"sentences":[{"english":"Give the girl a prize.","chinese":"小小說，“給這女孩子發獎。"},{"english":"The president gave away prizes at the school sports.","chinese":"校長在學校運動會上頒發獎品。"},{"english":"We have invited a famous former student to give away the prizes.","chinese":"我們邀請了一位知名校友來頒發獎品。"},{"english":"The Education Department willrewardaward the first grants early next year.","chinese":"教育部明年早期會給一等獎發獎。"},{"english":"When I was giving award, I could only congratulate a few of the contestants.","chinese":"當我發獎時，我只能祝賀幾位選手。"},{"english":"It is the custom of this academy to make an annual award for outstanding researchers in chemistry.","chinese":"每年向傑出的化學研究人員發獎是這個學會的慣例。"},{"english":"These are much more important than delaying the granting of bonus, and also much more effective, I think.","chinese":"我覺得這些應該比遲發獎金來的更重要，更有效。"},{"english":"This is the first time in my life that I've experienced the masses voting on rewards for cadres.","chinese":"羣衆投票給幹部發獎，這是我有生以來經歷的第一次。"},{"english":"The mayor distributed the prizes among the winners.","chinese":"市長給優勝者頒發獎品。"},{"english":"The headmaster himself will give away the prizes to the students at the meeting.","chinese":"校長將在會上親自給學生頒發獎品。"},{"english":"The winner will receive Prize & Certificate in the Final.","chinese":"獲勝同學將在決賽頒發獎品和證書。"},{"english":"The top 3 finishers in each category will receive medals and prizes.","chinese":"男女各組成績前3名，各頒發獎牌及獎品各乙份。"},{"english":"A certificate of merit will also be awarded to each winning participant.","chinese":"各得獎者將獲頒發獎狀一張。"},{"english":"Winning teams will be awarded with a certificate.","chinese":"勝利隊伍將由外語部頒發獎狀每人一張。"},{"english":"One of the mayor's jobs is the presentation of prizes.","chinese":"頒發獎狀是市長的工作之一。"},{"english":"A certificate of merit and a medal will also be awarded to each winning participant.","chinese":"各得獎者將獲頒發獎狀一張及獎牌一面。"}],"related":[]}