{"definition":["vocal\/sound\/sound production\/to utter\/to give voice"],"pinyin":["fa1 sheng1"],"simplified":["发声"],"rank":22642.0,"normalized_rank":0.31679095602535223,"fraction":0.0000018461790469228557,"cumulative_fraction":0.980388367120396,"word":"發聲","characters":[{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"},{"definition":["sound\/voice\/tone\/noise\/reputation\/classifier for sounds"],"pinyin":["sheng1"],"word":"聲"}],"containing_words":[{"definition":["intonation"],"pinyin":["fa1 sheng1 fa3"],"word":"發聲法"},{"definition":["sound device"],"pinyin":["fa1 sheng1 qi4"],"word":"發聲器"},{"definition":["vocal organs\/vocal cords"],"pinyin":["fa1 sheng1 qi4 guan1"],"word":"發聲器官"}],"sentences":[{"english":"Stroke the cat to make it purr then click on the Cinderella.","chinese":"點擊這個貓使它發聲音，然後點灰姑娘。"},{"english":"Vocalizing is a higher nervous activity of the human being.","chinese":"歌唱發聲是人的一種高級神經活動。"},{"english":"The computerized talking dictionary, unparalleled in the world, is. a good assis. ant for your successful career.","chinese":"真人發聲電腦辭典，獨步天下，事業成功好幫手。"},{"english":"The Parktronic system operates on the echo-sounder principle.","chinese":"駐車定位系統根據回波發聲器原理工作。"},{"english":"Chinchillas make a variety of vocalizations, including chirps, squeaks, and barks.","chinese":"龍貓作出了各種發聲，包括呻吟，唧唧叫和哨音。"},{"english":"Disclosed is an automatic sounding and counting instrument for pulse which is a medical apparatus suitable for feeling the pulse in traditional Chinese medical treatment.","chinese":"脈搏自動發聲計數儀是一種適於中醫切脈的醫療器具。"},{"english":"We are very good at picking from very brief vocalization the effective state of a person.","chinese":"通過簡單的發聲我們就能夠推測出一個人的實際狀態。"},{"english":"You may mouth the words, but no sound must be uttered.","chinese":"在演唱時，你做出發音的口型就可以了，但不要發聲。"},{"english":"He has been using a wheel chair for many years and speaks with the aid of a voice synthesizer.","chinese":"他多年來只能坐在輪椅上，藉助發聲器“講話”。"},{"english":"Objective To study the relationship of functional phonation disorders and laryngeal organic diseases.","chinese":"目的探討功能性發聲障礙與喉器質性病變的關係。"},{"english":"Your baby will begin to vocalize long before she can talk.","chinese":"你的女嬰早在會說話之前就要開始咿呀發聲了。"},{"english":"The computerized talking dictionary, unparalleled in the world, is a good assistant for your successful career.","chinese":"真人發聲電腦辭典，獨步天下，事業成功好幫手。"},{"english":"Wisdom crieth without; she uttereth her voice in the streets","chinese":"智慧在街市上呼喊，在寬闊處發聲。"},{"english":"After that, thorax shrink, the meatus of esophagus turn in again, the voice behavior is over.","chinese":"後胸廓縮小，食管入口黏膜再次內翻，發聲結束。"},{"english":"Ma has hit back at Wang, accusing him of abandoning their family.","chinese":"事後，馬蓉也發聲反擊，譴責王寶強拋妻棄子。"},{"english":"In response to a question about the American accent of his synthesiser .","chinese":"迴應一個關於他的電子發聲器的美國口音問題。"}],"related":[{"definition":["to respond\/response"],"pinyin":["hui2 ying4"],"word":"回應"},{"definition":["group\/organization\/team\/CL:個|个[ge4]"],"pinyin":["tuan2 ti3"],"word":"團體"},{"definition":["to emphasize (a statement)\/to stress"],"pinyin":["qiang2 diao4"],"word":"強調"},{"definition":["to pass through\/to penetrate\/by means of\/via"],"pinyin":["tou4 guo4"],"word":"透過"},{"definition":["they"],"pinyin":["ta1 men5"],"word":"他們"},{"definition":["expression of opinion\/views\/remarks\/arguments"],"pinyin":["yan2 lun4"],"word":"言論"},{"definition":["to claim\/to state\/to proclaim\/to assert"],"pinyin":["sheng1 cheng1"],"word":"聲稱"},{"definition":["to encourage"],"pinyin":["gu3 li4"],"word":"鼓勵"},{"definition":["to appeal\/to demand (an answer)\/requirement\/demand\/claim\/appeal\/(marketing) message"],"pinyin":["su4 qiu2"],"word":"訴求"},{"definition":["topic of discussion\/topic\/subject\/issue (under discussion)\/CL:項|项[xiang4]"],"pinyin":["yi4 ti2"],"word":"議題"},{"definition":["to fight against\/to oppose\/to be opposed to\/opposition"],"pinyin":["fan3 dui4"],"word":"反對"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["society\/CL:個|个[ge4]"],"pinyin":["she4 hui4"],"word":"社會"},{"definition":["for this reason\/with regards to this\/in this respect\/in order to do this\/to this end"],"pinyin":["wei4 ci3"],"word":"為此"},{"definition":["to issue (an order, decree etc)\/to send out\/to dispatch\/to produce (a sound)\/to let out (a laugh)"],"pinyin":["fa1 chu1"],"word":"發出"},{"definition":["to criticize\/criticism\/CL:個|个[ge4]"],"pinyin":["pi1 ping2"],"word":"批評"}]}