{"definition":["Baiyin prefecture-level city in Gansu","silver"],"pinyin":["Bai2 yin2","bai2 yin2"],"simplified":["白银"],"rank":9223.0,"normalized_rank":0.129041736040183,"fraction":0.00000949978602329396,"cumulative_fraction":0.9228298129137456,"word":"白銀","characters":[{"definition":["surname Bai","white\/snowy\/pure\/bright\/empty\/blank\/plain\/clear\/to make clear\/in vain\/gratuitous\/free of charge\/reactionary\/anti-communist\/funeral\/to stare coldly\/to write wrong character\/to state\/to explain\/vernacular\/spoken lines in opera"],"pinyin":["Bai2","bai2"],"word":"白"},{"definition":["silver\/silver-colored\/relating to money or currency"],"pinyin":["yin2"],"word":"銀"}],"containing_words":[{"definition":["Baiyin prefecture-level city in Gansu"],"pinyin":["Bai2 yin2 shi4"],"word":"白銀市"},{"definition":["Baiyin district of Baiyin city 白銀市|白银市[Bai2 yin2 shi4], Gansu"],"pinyin":["Bai2 yin2 qu1"],"word":"白銀區"},{"definition":["valuable book decorated with silver, gold and jewels etc, commonly regarded as a disguised form of bribe"],"pinyin":["bai2 yin2 shu1"],"word":"白銀書"}],"sentences":[{"english":"A new method to recover silver from silver-bearing waste catalytic agent is introduced.","chinese":"介紹了從含銀的廢催化劑中回收白銀的一種新方法。"},{"english":"He made his money speculating on the London gold and silver markets.","chinese":"他在倫敦黃金市場和白銀市場上進行投機買賣。"},{"english":"Baiyin Is China's largest and most varieties of non-ferrous metal industrial base.","chinese":"白銀是我國目前規模最大的多品種有色金屬工業基地。"},{"english":"As in gold, long-term silver chart also suggests caution.","chinese":"和黃金一樣，白銀的長期趨勢圖也提示我們保持謹慎。"},{"english":"I would prefer one just on relative value, silver is probably better.","chinese":"按相對估傎的標準選擇的話，白銀可能更好。"},{"english":"In 2001, he held a personal exhibition in Baiying city Gansu province.","chinese":"2001年在甘肅白銀市舉辦個人畫展。"},{"english":"Song Yuan time, becomes in the Chinese currency history the silver monetization crucial phase.","chinese":"宋元時期，成爲中國貨泉史上白銀貨泉化的關頭時期。"},{"english":"It cannot be gotten for gold, neither shall silver be weighed for the price thereof.","chinese":"智慧非用黃金可得，也不能平白銀爲它的價值。"},{"english":"Silver moved to new highs but encountered a very long-term resistance level.","chinese":"白銀雖然創出歷史高點，但是也遭遇了強大的阻力。"},{"english":"In fact, the physical ratio of silver to gold in the earth’s crust is 16 to 1.","chinese":"事實上，白銀和黃金在地殼中含量之比爲16:1。"},{"english":"A German alchemist tried to transmute silver into gold.","chinese":"一位德國的鍊金術士試圖將白銀煉成黃金。"},{"english":"Silver plummeted to a seven-month low, before rallying slightly.","chinese":"白銀價格創七個月新低，隨後小幅上揚。"},{"english":"Silver is forming a strong technical pattern along with Gold and also forming a pennant.","chinese":"與黃金形成三角旗一樣，白銀形成強勢技術圖形。"},{"english":"Since building up a country, Bai Yin City is that national economic development has made gigantic contribution out.","chinese":"建國以來，白銀市爲國家經濟建設做出了巨大的貢獻。"},{"english":"This made a big difference in the PHLX Gold and Silver Sector Index, traded on the Philadelphia Stock Exchange.","chinese":"費城證交所的黃金白銀指數走勢卻截然相反。"},{"english":"Silver declined with gold yesterday but it lost more in percentage terms.","chinese":"白銀隨黃金下跌，但以損失百份比更多。"}],"related":[{"definition":["gold\/golden (opportunity)\/prime (time)"],"pinyin":["huang2 jin1"],"word":"黃金"},{"definition":["short term"],"pinyin":["duan3 xian4"],"word":"短線"},{"definition":["profit\/to obtain benefits\/benefits obtained"],"pinyin":["huo4 li4"],"word":"獲利"},{"definition":["to sell\/to reach (a price in an auction)"],"pinyin":["mai4 chu1"],"word":"賣出"},{"definition":["bull market (prices appear to be rising)"],"pinyin":["kan4 zhang3"],"word":"看漲"},{"definition":["to purchase\/to buy in (goods)"],"pinyin":["mai3 jin4"],"word":"買進"},{"definition":["funds\/funding\/capital"],"pinyin":["zi1 jin1"],"word":"資金"},{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"word":"反彈"},{"definition":["foreign investment"],"pinyin":["wai4 zi1"],"word":"外資"},{"definition":["to buy (finance)"],"pinyin":["mai3 ru4"],"word":"買入"},{"definition":["faucet\/water tap\/bicycle handle bar\/chief (esp. of gang)\/boss\/decision maker\/(market) leader (of companies)\/front end of mud-flow\/figurehead on prow of dragon boat 龍船|龙船"],"pinyin":["long2 tou2"],"word":"龍頭"},{"definition":["(commercial) trade\/CL:個|个[ge4]"],"pinyin":["mao4 yi4"],"word":"貿易"},{"definition":["bargaining chip\/gaming chip\/casino token"],"pinyin":["chou2 ma3"],"word":"籌碼"},{"definition":["to flee from danger\/to avoid danger\/to minimize risk\/(finance) hedge"],"pinyin":["bi4 xian3"],"word":"避險"},{"definition":["diamond\/CL:顆|颗[ke1]"],"pinyin":["zuan4 shi2"],"word":"鑽石"},{"definition":["phony\/so-called\/armchair (expert)\/vain (promise)\/(finance) short-seller\/bear (market)\/short (selling)"],"pinyin":["kong1 tou2"],"word":"空頭"}]}