{"definition":["dolomite"],"pinyin":["bai2 yun2 shi2"],"simplified":["白云石"],"rank":49548.0,"normalized_rank":0.6932408042197753,"fraction":1.5137879905582366e-7,"cumulative_fraction":0.9988932945622756,"word":"白雲石","characters":[{"definition":["surname Bai","white\/snowy\/pure\/bright\/empty\/blank\/plain\/clear\/to make clear\/in vain\/gratuitous\/free of charge\/reactionary\/anti-communist\/funeral\/to stare coldly\/to write wrong character\/to state\/to explain\/vernacular\/spoken lines in opera"],"pinyin":["Bai2","bai2"],"word":"白"},{"definition":["cloud\/CL:朵[duo3]","surname Yun\/abbr. for Yunnan Province 雲南省|云南省[Yun2 nan2 Sheng3]"],"pinyin":["Yun2","yun2"],"word":"雲"},{"definition":["dry measure for grain equal to ten dou 斗\/ten pecks\/one hundred liters","rock\/stone\/stone inscription\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Shi"],"pinyin":["Shi2","dan4","shi2"],"word":"石"}],"containing_words":[],"sentences":[{"english":"The invention relates to a dolomite glass and a manufacturing method thereof.","chinese":"本發明涉及一種白雲石玻璃及其製作方法。"},{"english":"Proper dolomite application significantly increased rapeseed yield in the acidic yellow-red soil.","chinese":"適當施用白雲石粉能夠極顯著提高油菜產量。"},{"english":"Commonly the dolomite crystals form a framework with evenly distributed porosity.","chinese":"通常白雲石晶體構成格架，它有均勻分佈的孔隙。"},{"english":"The commonly used fluxes are limestone and dolomite.","chinese":"常用的熔劑有石灰石和白雲石。"},{"english":"Dolomite is the main material of magnesium products.","chinese":"鎂製品生產的主要原料爲白雲石。"},{"english":"The new comprehensive utilization technology of phosphatic dolomite is discussed.","chinese":"論述了含磷白雲石的綜合利用新工藝。"},{"english":"The ladle lining with tar dolomite is common in German and in Europe.","chinese":"用焦油白雲石做包襯，在德國及歐洲其它國家很普及。"}],"related":[]}