{"definition":["percentage"],"pinyin":["bai3 fen1 shu4"],"simplified":["百分数"],"rank":53227.0,"normalized_rank":0.7447147874022358,"fraction":1.0087054016159512e-7,"cumulative_fraction":0.9993521317309828,"word":"百分數","characters":[{"definition":["hundred\/numerous\/all kinds of","surname Bai"],"pinyin":["Bai3","bai3"],"word":"百"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[],"sentences":[{"english":"The Buyers are requested to establish the L\/C in amount with the indicated percentage over the total value of the order as per this Sales Contract.","chinese":"信用證之金額按本售貨合約金額增加相應的百分數。"},{"english":"Relative humidity is expressed as percentage.","chinese":"相對溼度採用百分數表示。"},{"english":"Results of the analyses show that the devitrification h…","chinese":"給出了晶體體積百分數和晶體形貌，分析表明。"},{"english":"Another way of specifying the size of the output image is to use percentages.","chinese":"指定輸出圖像大小的另一種方法是使用百分數。"},{"english":"And there are two different scales of ionic character.","chinese":"這裏有兩個版本的離子百分數。"},{"english":"Where are the percentages I asked you for?","chinese":"我向你要的百分數在哪裏？"},{"english":"What if the data we get back can’t be modeled as a simple percentage?","chinese":"如果我們得到的數據不能轉化爲簡單的百分數怎麼辦？"},{"english":"Such percentages provide clues on how modern humans migrated and interbred.","chinese":"這些百分數提示了我們現代人遷移和通婚的方式。"},{"english":"The cut-off percentages based on average call stack length are shown in the following table.","chinese":"基於堆棧平均長度的截止百分數見下表。"},{"english":"So far, resource controls have been limited to relative values expressed in percentages.","chinese":"在此之前，資源控制只能使用表示爲百分數的相對值。"}],"related":[]}