{"definition":["Anglo-"],"pinyin":["Ang4 ge2 lu3"],"simplified":["盎格鲁"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"盎格魯","characters":[{"definition":["abundant\/bowl\/dish\/pot"],"pinyin":["ang4"],"word":"盎"},{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"},{"definition":["(bound form) crass\/stupid\/rude\/(used to represent the sounds of \"ru\", \"lu\" etc in loanwords)","surname Lu\/Lu, ancient state of China 魯國|鲁国[Lu3 guo2]\/Lu, short name for Shandong 山東|山东[Shan1 dong1]"],"pinyin":["Lu3","lu3"],"word":"魯"}],"containing_words":[{"definition":["Anglo-Saxon (people)"],"pinyin":["Ang4 ge2 lu3 Sa1 ke4 xun4"],"word":"盎格魯撒克遜"},{"definition":["Anglo-Saxon"],"pinyin":["Ang4 ge2 lu3 Sa4 ke4 xun4"],"word":"盎格魯薩克遜"}],"sentences":[{"english":"Chapter 1. Anglo-Saxon or whatever happen to the Jutes.","chinese":"第一章，盎格魯撒克遜人或發生在朱特人的任何事。"},{"english":"I was born a Protestant of the white Anglo-Saxon persuasion.","chinese":"我生爲盎格魯撒克遜白人的新教教徒。"},{"english":"These consist of weldnesh , steel angles and a scaffold pole handrail.","chinese":"這些由焊接盎格魯鋼鐵和腳手立杆組成的欄杆。"},{"english":"The ancestors of many English people were the ancient Angles and Saxons.","chinese":"許多英國人的祖先是古盎格魯和撒克遜人。"},{"english":"Angelo's is one of California's hot spot for celebrity.","chinese":"盎格魯是加利福尼亞的名人聚集的地方。"},{"english":"A priest or clergyman in the Roman Catholic or Anglican churches.","chinese":"羅馬天主教或盎格魯教的牧師或神父。"},{"english":"A beautiful combination of all the best that Anglo-American and Indian looks have to offer.","chinese":"她是盎格魯血統美國人和印度人的完美結合。"},{"english":"The ancestors of many English people were the ancient Angles and Saxo .","chinese":"許多英國人的祖先是古盎格魯和撒克遜人。"},{"english":"Despite its Anglo-Saxon outlook, it is more Portuguese than Irish.","chinese":"儘管它的盎格魯撒克遜的前景，它比愛爾蘭葡萄牙語。"},{"english":"Please \"Anglo relatives\" to help him fight against Picts.","chinese":"請“盎格魯親戚們”來幫助他對抗皮克特人。"},{"english":"While Anglo-Saxons were throwing money around, Germans kept saving.","chinese":"當盎格魯薩克遜人到處花錢之時，德國人保持儲蓄。"}],"related":[]}