{"definition":["to be in vogue\/to be prevalent"],"pinyin":["sheng4 xing2"],"simplified":["盛行"],"rank":10659.0,"normalized_rank":0.14913323912526408,"fraction":0.0000074480704777495024,"cumulative_fraction":0.934874134658914,"word":"盛行","characters":[{"definition":["flourishing\/vigorous\/magnificent\/extensively","surname Sheng","to hold\/to contain\/to ladle\/to pick up with a utensil"],"pinyin":["Sheng4","cheng2","sheng4"],"word":"盛"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"}],"containing_words":[],"sentences":[{"english":"Fox conflicts over religion in many parts of Shanxi Province, in particular, is especially prevalent in Jinzhong.","chinese":"狐突信仰遍及山西許多地區，特別是在晉中尤爲盛行。"},{"english":"In the Japanese Edo Period, the literary thought of \"promoting virtues and punishing evils\" was prevalent.","chinese":"日本江戶時期，“勸善懲惡”文學思想盛行。"},{"english":"The original characters are Oracle, popular in the Shang period.","chinese":"最初的漢字是甲骨文，盛行於殷商時期。"},{"english":"2010 is the most popular is the \"Xiuting\", and Chinese medicine products.","chinese":"2010年最盛行就是“秀挺”了，中藥產品。"},{"english":"These masquerade balls became popular in continental Europe in the 17th century.","chinese":"這種化妝舞會在十七世紀的歐陸頗爲盛行。"},{"english":"Aristotle's science had acquired ascendancy.","chinese":"亞里斯多德的科學早已盛行一時。"},{"english":"The conventional practice flourishes in the United States.","chinese":"這種常規做法在美國很盛行。"},{"english":"Kingfisher beer is popular wherever spicy curries are eaten.","chinese":"在所有咖喱飯盛行之處，都有翠豐啤酒的銷路。"},{"english":"In close after balcony be current, the balcony became a cubby again.","chinese":"在封閉陽臺盛行之後，陽臺又成了一個小房間。"},{"english":"At that time, however, McCarthyism prevailed in the United States.","chinese":"但當時，美國麥卡錫主義盛行。"},{"english":"The pop song is popular in the populous city.","chinese":"這尾盛行歌直在生齒濃密的都會風行。"},{"english":"The most prevalent danger though often involves online predators or individuals who claim to be someone that they are not.","chinese":"最盛行的威脅通常涉及在線詐騙犯或冒稱他人的人。"},{"english":"These are ideal conditions for diseases of filth to flourish.","chinese":"這些是水土污染引起的疾病盛行的理想條件。"},{"english":"Renting is more popular than ever, even among the wealthy.","chinese":"即使是在富人圈子裏，租房之風也空前盛行。"},{"english":"I would ask you to believe that such an enchantment took place in its time.","chinese":"我想要你們相信，這種障眼畫法在當時盛行。"},{"english":"The use of horese for ploughing still prevails among the poorer farmers.","chinese":"用馬耕作的現象在貧苦農民中仍然十分盛行。"}],"related":[{"definition":["rampant\/very popular"],"pinyin":["da4 xing2 qi2 dao4"],"word":"大行其道"},{"definition":["(of a contagious disease etc) to spread\/to propagate\/(of a style of clothing, song etc) popular\/fashionable"],"pinyin":["liu2 xing2"],"word":"流行"},{"definition":["to rise\/to spring up\/to burgeon\/to be aroused\/to come into vogue"],"pinyin":["xing1 qi3"],"word":"興起"},{"definition":["to be popular for a while\/to be all the rage for a time"],"pinyin":["feng1 xing2 yi1 shi2"],"word":"風行一時"},{"definition":["tempest\/wave (of popular sentiment etc)\/craze or fad"],"pinyin":["feng1 chao2"],"word":"風潮"},{"definition":["fashionable\/popular"],"pinyin":["feng1 mi3"],"word":"風靡"},{"definition":["to flourish\/to thrive"],"pinyin":["xing1 sheng4"],"word":"興盛"},{"definition":["at present\/right now"],"pinyin":["shi2 xia4"],"word":"時下"},{"definition":["fashionable\/popular"],"pinyin":["shi2 xing1"],"word":"時興"},{"definition":["general mood\/atmosphere\/common practice"],"pinyin":["feng1 qi4"],"word":"風氣"},{"definition":["now\/nowadays\/modern"],"pinyin":["xian4 jin1"],"word":"現今"},{"definition":["to hold up (as an model)\/to hold in esteem\/to revere\/to advocate"],"pinyin":["chong2 shang4"],"word":"崇尚"},{"definition":["lit. floating wine goblets on a stream\/the origin (of some phenomenon)"],"pinyin":["lan4 shang1"],"word":"濫觴"},{"definition":["in the middle of the road\/to be in the way\/to hold power\/(fig.) to predominate\/to be in vogue"],"pinyin":["dang1 dao4"],"word":"當道"},{"definition":["fashionable for a while (idiom); all the rage"],"pinyin":["feng1 mi3 yi1 shi2"],"word":"風靡一時"},{"definition":["to have become common practice (idiom)\/to become a general trend"],"pinyin":["wei4 ran2 cheng2 feng1"],"word":"蔚然成風"}]}