{"definition":["known by everyone (idiom); well known\/a household name"],"pinyin":["jin4 ren2 jie1 zhi1"],"simplified":["尽人皆知"],"rank":34002.0,"normalized_rank":0.4757320946371357,"fraction":6.618625601920003e-7,"cumulative_fraction":0.9934164028974674,"word":"盡人皆知","characters":[{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely"],"pinyin":["jin4"],"word":"盡"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"},{"definition":["all\/each and every\/in all cases"],"pinyin":["jie1"],"word":"皆"},{"definition":["to know\/to be aware"],"pinyin":["zhi1"],"word":"知"}],"containing_words":[],"sentences":[{"english":"All of this stuff is obvious and everyone knows it.","chinese":"您介紹的所有這些東西都是顯而易見，盡人皆知的。"},{"english":"The tower on the hilltop is a well-known landmark.","chinese":"那山頂上的塔乃是盡人皆知的陸標。"},{"english":"Its ugly record of police brutality is known in every section of this country.","chinese":"該市警察暴行的醜惡記錄全國各地盡人皆知。"},{"english":"It was common knowledge throughout the court that Leia was adopted into the Royal Family.","chinese":"萊婭是王族的養女，這是宮廷中盡人皆知的事實。"},{"english":"I was quite a proverb for it at Maple Grove.","chinese":"在楓園，我的戀家是盡人皆知的。"},{"english":"They are known to be rolling in money.","chinese":"他們是盡人皆知的擁有大量錢財的人。"},{"english":"It's well-known for its fine technics and it also expresses the silversmith's unique feeling and thoughts.","chinese":"其工藝技術之美盡人皆知，表現了獨特的匠意之美。"},{"english":"The story of the businessman moustache snow rock with red top is common to all.","chinese":"紅頂商人胡雪巖的故事盡人皆知。"},{"english":"It is common knowledge that the traffic situation there is deplorable.","chinese":"那裏的交通情況可悲可嘆是盡人皆知的。"},{"english":"It id known to everyone that Mary lied about his age.","chinese":"瑪麗謊報年齡是盡人皆知的事實。"},{"english":"Dubai has a well-known seven-star \"Burj Al Arab Hotel\", Brunei it?","chinese":"迪拜有個盡人皆知的七星級“帆船酒店”，文萊呢？"}],"related":[]}