{"definition":["to be full of\/completely"],"pinyin":["jin4 shi4"],"simplified":["尽是"],"rank":23478.0,"normalized_rank":0.32848768066262785,"fraction":0.0000017060405251354014,"cumulative_fraction":0.9818708531284284,"word":"盡是","characters":[{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely"],"pinyin":["jin4"],"word":"盡"},{"definition":["is\/are\/am\/yes\/to be"],"pinyin":["shi4"],"word":"是"}],"containing_words":[],"sentences":[{"english":"Another's bedroom is tilting.There are cracks on many of the walls.","chinese":"另一間臥室也已傾斜，牆壁上盡是裂隙。"},{"english":"His speech was full of milk-and-water platitudes.","chinese":"他的演講盡是些乏味的老生常談。"},{"english":"On the path proliferates the fallen flower, puts out a hand to touch is glittering and translucentcarving.","chinese":"道路上遍佈落英，伸手所觸盡是晶瑩剔透。"},{"english":"Dorian:All I see is decay.","chinese":"我看到的盡是衰敗。"},{"english":"Congress taught us only vote back politics… it did nothing to this nation.","chinese":"國大黨教我們的盡是票倉政治。"},{"english":"The only company at home are re- possessors.","chinese":"家裏盡是些追債的人。"},{"english":"Treasure Tripod Temple is among stones of different weird shapes, known as a Little Stone Forest.","chinese":"寶鼎寺周圍盡是千姿百態的石頭，俗稱小石林。"},{"english":"All she could think of were the faces of friends and family.","chinese":"她能夠想到的盡是家人和朋友的面孔。"},{"english":"With the orphan, the autumn is, from feeling hurt.","chinese":"事與孤鴻去，探秋盡是，傷離意緒。"},{"english":"Cold Mountain is full of great piz Valley, Tao.","chinese":"大冷山盡是奇峯幽谷，林海松濤。"},{"english":"Heavy smoke filled the room, he could hardly find his way out.","chinese":"房間裏盡是煙霧，他幾乎看不清出門的路。"},{"english":"The place offers meandering rivers and green meadows.","chinese":"那地方盡是彎彎的河水跟綠綠的草原。"},{"english":"It was a poor performance, full of inconclusive arguments and other commonplaces.","chinese":"課本不怎麼樣，盡是不得要領的論說和一些老生常談。"},{"english":"That is a poem full of precious images .","chinese":"那是盡是挖空心思的意象的詩篇。"},{"english":"Long hair like waterfall, pupil cut water, light a room full of every twinkle and smile.","chinese":"長髮如瀑，瞳眸剪水，一顰一笑間盡是淡淡的詩韻。"},{"english":"All the exhibits here are for sale new products.","chinese":"這裏展銷的盡是新產品。"}],"related":[]}