{"definition":["eyepiece"],"pinyin":["mu4 jing4"],"simplified":["目镜"],"rank":41886.0,"normalized_rank":0.5860394834412995,"fraction":3.2144273434997465e-7,"cumulative_fraction":0.997152156052406,"word":"目鏡","characters":[{"definition":["eye\/item\/section\/list\/catalogue\/table of contents\/order (taxonomy)\/goal\/name\/title"],"pinyin":["mu4"],"word":"目"},{"definition":["mirror\/lens"],"pinyin":["jing4"],"word":"鏡"}],"containing_words":[{"definition":["goggles\/protective glasses"],"pinyin":["hu4 mu4 jing4"],"word":"護目鏡"}],"sentences":[{"english":"I think the EDG probably uses a low astigmatism eyepiece design like the SE.","chinese":"我想EDG可能使用了象SE一樣的低像散目鏡設計。"},{"english":"The two zoom eyepieces are given as an example of design.","chinese":"最後給出了兩個變倍目鏡設計實例。"},{"english":"A welder wears goggles to protect his eyes from being burned.","chinese":"電焊工戴着護目鏡防止眼睛被灼傷。"},{"english":"The Huygens ocular, which dates back over 250 years is still in wide use today.","chinese":"二百五十多年前的惠更斯目鏡今天還在廣泛使用。"},{"english":"BUG, Easi-Scan remote display, wrist monitor.","chinese":"遠程顯示器，通用護目鏡。"},{"english":"I used a pair of tinted safety goggles as part of the faceplate .","chinese":"我用了一雙染過色的護目鏡作爲面板的一部分。"},{"english":"Do not watch welding processes unless your eyes are properly protected.","chinese":"沒有正確的護目鏡，不要看燒焊作業。"},{"english":"Try to use a higher-power eyepiece.","chinese":"嘗試使用一個高倍目鏡。"},{"english":"Hundreds of enthusiasts wearing goggles catch a glimpse of the phenomenon.","chinese":"數百位熱情人士戴著護目鏡捕捉日食現象的驚鴻一瞥。"},{"english":"Grease on the hands can easily get on goggles.","chinese":"手上的油脂膏容易沾到護目鏡上。"},{"english":"Last, put a glare screen3 on your monitor to reduce squinting.","chinese":"最後，在屏幕上加片護目鏡來減少眯眼。"},{"english":"This is the size of the field our eye sees when looking into the eyepiece.","chinese":"就是我們透過目鏡可以看到的區域範圍。"},{"english":"Wear appropriatc protective clothing compatible chemical-resistant gloves and chemical safety goggles.","chinese":"穿戴防護服，防護手套和化學安全護目鏡。"},{"english":"Then the scratches and spots on the field lens would be visible at the eye lens.","chinese":"此時場鏡上的劃痕和小點會在接目鏡中看見。"},{"english":"S39 Wear eye \/ face protection.","chinese":"戴護目鏡或面具。"},{"english":"The ocular micrometer is a circular diameter graticule.","chinese":"目鏡測微計是一個圓形十字格。"}],"related":[]}