{"definition":["blind people touch an elephant (idiom, from Nirvana sutra 大般涅槃經|大般涅盘经[da4 ban1 Nie4 pan2 jing1]); fig. unable to see the big picture\/to mistake the part for the whole\/unable to see the wood for the trees"],"pinyin":["mang2 ren2 mo1 xiang4"],"simplified":["盲人摸象"],"rank":49329.0,"normalized_rank":0.6901767100863263,"fraction":1.5517421735423392e-7,"cumulative_fraction":0.9988597335759726,"word":"盲人摸象","characters":[{"definition":["blind"],"pinyin":["mang2"],"word":"盲"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"},{"definition":["to feel with the hand\/to touch\/to stroke\/to grope\/to steal\/to abstract","variant of 摹[mo2]"],"pinyin":["mo1","mo2"],"word":"摸"},{"definition":["elephant\/CL:隻|只[zhi1]\/shape\/form\/appearance\/to imitate"],"pinyin":["xiang4"],"word":"象"}],"containing_words":[],"sentences":[{"english":"Each sees a different part, like the blind men patting an elephant.","chinese":"就像盲人摸象，每個人都只看了不同的一部分。"},{"english":"The Buddha once told the story of the blind men and the elephant .","chinese":"佛陀曾經講過一個盲人摸象的故事。"},{"english":"Anybody ever hear of the story of the blind men and the elephant?","chinese":"估計每個人都聽說過盲人摸象的故事。"},{"english":"We are still, to a large extent, flying blind in conceptual terms.","chinese":"在經濟學觀念問題上，我們仍是盲人摸象。"}],"related":[{"definition":["blind people touch an elephant (idiom, from Nirvana sutra 大般涅槃經|大般涅盘经[da4 ban1 Nie4 pan2 jing1]); fig. unable to see the big picture\/to mistake the part for the whole\/unable to see the wood for the trees"],"pinyin":["xia1 zi5 mo1 xiang4"],"word":"瞎子摸象"},{"definition":["to touch an elephant (of proverbial blind people)"],"pinyin":["mo1 xiang4"],"word":"摸象"},{"definition":["lit. eyes obscured by a single leaf (idiom)\/fig. not seeing the wider picture\/can't see the wood for the trees"],"pinyin":["yi1 ye4 zhang4 mu4"],"word":"一葉障目"},{"definition":["unable to see the wood for the trees\/fig. only able to see isolated details, and not the bigger picture"],"pinyin":["zhi3 jian4 shu4 mu4 bu4 jian4 sen1 lin2"],"word":"只見樹木不見森林"},{"definition":["to know that it is so but not why it is so (idiom)"],"pinyin":["zhi1 qi2 ran2 er2 bu4 zhi1 qi2 suo3 yi3 ran2"],"word":"知其然而不知其所以然"},{"definition":["lit. to see a leopard through a narrow tube (idiom); fig. to miss the big picture"],"pinyin":["guan3 zhong1 kui1 bao4"],"word":"管中窺豹"},{"definition":["the view of a frog in a well (idiom); fig. a narrow view"],"pinyin":["jing3 wa1 zhi1 jian4"],"word":"井蛙之見"},{"definition":["lit. drawing a tiger using a cat as a model (idiom); fig. to follow a model and get things more or less right but without capturing the spirit of the subject\/uninspired imitation"],"pinyin":["zhao4 mao1 hua4 hu3"],"word":"照貓畫虎"},{"definition":["lit. crossing the river by feeling for stones\/improvise by trial-and-error\/move cautiously"],"pinyin":["mo1 shi2 tou5 guo4 he2"],"word":"摸石頭過河"},{"definition":["to wade across the river, feeling for footholds as one goes (idiom)\/to advance cautiously, step by step\/to feel one's way forward"],"pinyin":["mo1 zhe5 shi2 tou5 guo4 he2"],"word":"摸著石頭過河"},{"definition":["lit. a notch on the side of a boat to locate a sword dropped overboard (idiom); fig. an action made pointless by changed circumstances"],"pinyin":["ke4 zhou1 qiu2 jian4"],"word":"刻舟求劍"},{"definition":["lit. to scratch the outside of the boot (idiom)\/fig. beside the point\/ineffectual"],"pinyin":["ge2 xue1 sao1 yang3"],"word":"隔靴搔癢"},{"definition":["to copy the way they walk in Handan (idiom)\/slavishly copying others, one risks becoming a caricature"],"pinyin":["Han2 dan1 xue2 bu4"],"word":"邯鄲學步"},{"definition":["lit. climb a tree to catch a fish (idiom); fig. to attempt the impossible"],"pinyin":["yuan2 mu4 qiu2 yu2"],"word":"緣木求魚"},{"definition":["lit. to know one and understand half (idiom); a smattering of knowledge\/dilettante\/amateur"],"pinyin":["yi1 zhi1 ban4 jie3"],"word":"一知半解"},{"definition":["to treat the symptoms rather than getting to the root of the problem (proverb)\/reactive (rather than proactive)"],"pinyin":["tou2 tong4 yi1 tou2 , jiao3 tong4 yi1 jiao3"],"word":"頭痛醫頭，腳痛醫腳"}]}