{"definition":["relativistic (physics)"],"pinyin":["xiang1 dui4 lun4 xing4"],"simplified":["相对论性"],"rank":68848.0,"normalized_rank":0.9632728442908512,"fraction":5.109216940167626e-9,"cumulative_fraction":0.9999918691921518,"word":"相對論性","characters":[{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"},{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"論"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[{"definition":["non-relativistic (physics)"],"pinyin":["fei1 xiang1 dui4 lun4 xing4"],"word":"非相對論性"}],"sentences":[{"english":"This method can be easily generalized to relativistically phenomenological dynamical equation.","chinese":"這一方法易於推廣到相對論性唯象動力學方程。"},{"english":"The relativistic classical scattering angular distributions are predicted which may be compared with experiments.","chinese":"相對論性經典理論預言的角分佈可與實驗比較。"},{"english":"The conservation laws of relativistic variable mass systems were studied.","chinese":"研究相對論性變質量系統的守恆律。"},{"english":"The quantization of vortices has also been discussed in the relativistic superfluid in this paper.","chinese":"另外還討論了相對論性超流體中的渦旋量子化。"}],"related":[]}