{"definition":["phase diagram (math.)\/phase portrait"],"pinyin":["xiang4 tu2"],"simplified":["相图"],"rank":60316.0,"normalized_rank":0.8438990947630574,"fraction":3.970591450644555e-8,"cumulative_fraction":0.9998277389554426,"word":"相圖","characters":[{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"},{"definition":["diagram\/picture\/drawing\/chart\/map\/CL:張|张[zhang1]\/to plan\/to scheme\/to attempt\/to pursue\/to seek"],"pinyin":["tu2"],"word":"圖"}],"containing_words":[{"definition":["star chart"],"pinyin":["xing1 xiang4 tu2"],"word":"星相圖"}],"sentences":[{"english":"Or if we drew a phase diagram, here's the line.","chinese":"或者畫一個相圖，然後說這條線在這。"},{"english":"Quantity of water solubilization by rust inhibitors was calculated based on the phase digram .","chinese":"在相圖測定的基礎上，計算出防鏽劑對水的增溶度。"},{"english":"The flowchart and the calculating results of seve…","chinese":"文中列有計算框圖及對數種相圖的計算結果。"},{"english":"The phase diagram of a homogenous ultracold Fermi gas with spin polarization is studied at unitarity.","chinese":"研究了超冷均勻極化的費米氣體在共振區的相圖。"},{"english":"All gas region of the phase diagram.","chinese":"相圖中完全是液相的區域。"},{"english":"Their characteristics have been simply analysed and discussed.","chinese":"給出了幾種典型的動態相圖，簡要討論了其特點。"},{"english":"Why shouldn't we be able to calculate phase diagrams?","chinese":"我們可以計算出相圖？"},{"english":"This paper provide another method to phase diagram of trona carbonation and phase diagram analysis.","chinese":"給出了又一種天然鹼碳酸化相圖及相圖分析。"},{"english":"This paper provide another method to phase diagram of trona carbonation and phase diagram analysis.","chinese":"給出了又一種天然鹼碳酸化相圖及相圖分析。"},{"english":"So now I can draw a similar diagram for sugared water.","chinese":"現在我可以對糖水畫出相同的相圖。"},{"english":"There is only scale-free regime in the phase diagram.","chinese":"在網絡的相圖中只有無標度區。"},{"english":"The paper discusses the law of the damping-without-drive simple pendulum motion through phase-graph method.","chinese":"用相圖法分析討論了有阻尼無驅動單擺的運動規律。"},{"english":"Recent developments concerning the electronic phase diagram of high temperature superconductors(HTS) are presented.","chinese":"要介紹了高溫超導體的電子態相圖及最近的一些發展。"},{"english":"The isothermal section of this system at 900 ℃ were constructed.","chinese":"並構作了這個體系900℃等溫截面的相圖。"},{"english":"The tricritical point in the temperature-polarization plane is obtained.","chinese":"在溫度和費米子極化的相圖上得到了三相點的位置。"},{"english":"What you saw before, we just drew phase diagrams.","chinese":"像以前一樣，我們先來畫相圖。"}],"related":[]}