{"definition":["to bring out the best in each other (idiom)\/to complement one another well"],"pinyin":["xiang1 de2 yi4 zhang1"],"simplified":["相得益彰"],"rank":17152.0,"normalized_rank":0.23997873322793226,"fraction":0.0000032290251061859395,"cumulative_fraction":0.966912727590942,"word":"相得益彰","characters":[{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["benefit\/profit\/advantage\/beneficial\/to increase\/to add\/all the more","surname Yi"],"pinyin":["Yi4","yi4"],"word":"益"},{"definition":["clear\/conspicuous\/manifest"],"pinyin":["zhang1"],"word":"彰"}],"containing_words":[],"sentences":[{"english":"The gray-green walls, and the walls of fresh silver like box can complement each other.","chinese":"灰綠色的牆面清新宜人，牆上的銀色像框相得益彰。"},{"english":"The terraces create an artificial landscape perfectly suited to a par 3.","chinese":"梯田創造的人工風景和三杆洞相得益彰。"},{"english":"The key is finding a style that you both like and that flatters your face.","chinese":"關鍵是找到一款你喜歡的並且和臉型相得益彰的髮式。"},{"english":"Work and rest go together, hand in hand.","chinese":"工作和休息齊頭並進，相得益彰。"},{"english":"Bibo stone bridge and a clean seamless, Waterscape King Bridge, complement each other.","chinese":"石橋與碧波清流渾然一體，水景橋景，相得益彰。"},{"english":"The menu is a awesomely cool retro design that prefaces the film very well.","chinese":"這個菜單出奇地冷靜，精美的設計與影片相得益彰。"},{"english":"If combined with pierced processes but also put the finishing touch, complement each other.","chinese":"如果結合鏤空工藝更是畫龍點睛，相得益彰。"},{"english":"The two are complementary and can be replenished each other perfectly.","chinese":"二者相輔相成，互爲補充，相得益彰。"},{"english":"Zoe Saldana: Casual but totally orange carpet appropriate.","chinese":"打扮隨意但又很好的與“橙毯”相得益彰。"},{"english":"Copy and typography complement each other and give Rochdale an aesthetic voice.","chinese":"複製和版式相得益彰，給羅奇代爾一種審美的聲音。"},{"english":"The simple inlaid floor and the intricate decoration bring out the best in each other.","chinese":"腳下簡潔大方的拼木地板與繁複的裝飾相得益彰。"},{"english":"Prague, Czech Republic carriage and castle-like city of complement each other.","chinese":"捷克布拉格的馬車與古堡般的城市相得益彰。"},{"english":"Store's overall design and Embry underwear design complement each other.","chinese":"專賣店的整體設計與安莉芳內衣設計風格相得益彰。"},{"english":"Feed them to each other for a healthy, vitamin C-packed dessert.","chinese":"維生素C包裹的點心，相得益彰。"},{"english":"The applied research is sure to bring mutual benefits to the development of Yuanjiology and other disciplines.","chinese":"應用研究必定會使元極學與其它學科的發展相得益彰。"},{"english":"It exalts the noble aromas of green apple with a crop acid and a very fine, persistent perlage.","chinese":"青蘋果的優雅清香與新鮮的果酸交織融合，相得益彰。"}],"related":[{"definition":["to complement one another (idiom)"],"pinyin":["xiang1 fu3 xiang1 cheng2"],"word":"相輔相成"},{"definition":["to set each other off nicely"],"pinyin":["xiang1 ying4 cheng2 qu4"],"word":"相映成趣"},{"definition":["to blend into one another\/to blend together well"],"pinyin":["hun2 ran2 yi1 ti3"],"word":"渾然一體"},{"definition":["to conform (with)\/to echo\/to correlate well\/(linguistics) agreement"],"pinyin":["hu1 ying4"],"word":"呼應"},{"definition":["string of pearl and jade (idiom); ideal combination\/perfect pair"],"pinyin":["zhu1 lian2 bi4 he2"],"word":"珠聯璧合"},{"definition":["to contrast\/to set off one another\/to go well with"],"pinyin":["xiang1 chen4"],"word":"相襯"},{"definition":["to fuse together (idiom)\/hypostatic union (religion)"],"pinyin":["rong2 wei2 yi1 ti3"],"word":"融為一體"},{"definition":["the brush stroke that dots in the eyes (idiom); fig. to add the vital finishing touch\/the crucial point that brings the subject to life\/a few words to clinch the point"],"pinyin":["dian3 jing1 zhi1 bi3"],"word":"點睛之筆"},{"definition":["having a unique or distinctive style"],"pinyin":["bie2 ju4 yi1 ge2"],"word":"別具一格"},{"definition":["to reflect\/to shine"],"pinyin":["hui1 ying4"],"word":"輝映"},{"definition":["it's just perfect\/it's just right"],"pinyin":["qia4 dao4 hao3 chu4"],"word":"恰到好處"},{"definition":["to blend\/to mix"],"pinyin":["jiao1 rong2"],"word":"交融"},{"definition":["to match\/well-suited"],"pinyin":["xiang1 pei4"],"word":"相配"},{"definition":["to have quite a lasting charm"],"pinyin":["bie2 you3 yun4 wei4"],"word":"別有韻味"},{"definition":["to match\/in tune\/reasonable"],"pinyin":["da1 diao4"],"word":"搭調"},{"definition":["a mixture\/an amalgam\/fusion\/welding together\/to be in harmony with (nature)\/to harmonize with\/to fit in"],"pinyin":["rong2 he2"],"word":"融合"}]}