{"definition":["to discuss two disparate things together (idiom); to mention on equal terms\/to place on a par with\/(often with negatives: impossible to mention X in the same breath as Y)"],"pinyin":["xiang1 ti2 bing4 lun4"],"simplified":["相提并论"],"rank":15311.0,"normalized_rank":0.21422075469058247,"fraction":0.000003997305356360288,"cumulative_fraction":0.9602995073945682,"word":"相提並論","characters":[{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"},{"definition":["to carry (hanging down from the hand)\/to lift\/to put forward\/to mention\/to raise (an issue)\/upwards character stroke\/lifting brush stroke (in painting)\/scoop for measuring liquid"],"pinyin":["ti2"],"word":"提"},{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge"],"pinyin":["bing4"],"word":"並"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"論"}],"containing_words":[],"sentences":[{"english":"Actually no one can parallel him in writing.","chinese":"事實上沒人能在寫作上和他相提並論。"},{"english":"It is true that abdicating the throne is by no means the most easy thing as failure of examination.","chinese":"當然沒有通過考試是不能和總統辭職相提並論。"},{"english":"Don't bracket me with him just because we work for the same company.","chinese":"別因爲我和他在一家公司工作而把我們相提並論。"},{"english":"There is nothing in China to match the Venezuelan orchestral revolution.","chinese":"中國也沒法和委內瑞拉革命相提並論。"},{"english":"It has a degree of openness and precision that is only matched by the best solid-core cables.","chinese":"此線材豐富寬廣及精確，只有好的線材才能相提並論。"},{"english":"He has also equated cyberthreats with nuclear and biological weapons.","chinese":"他還把網絡威脅與核武器和生化武器相提並論。"},{"english":"The vases of the ancient Greeks cannot rival them in workmanship .","chinese":"古希蠟的花瓶在製作工藝上也無法與它相提並論。"},{"english":"It’s much, much better than Internet Explorer, and on-par with Firefox.","chinese":"它遠優於IE瀏覽器，並與FIREFOX相提並論。"},{"english":"You cannot equate his poems with his plays.","chinese":"你不可以把他的詩歌和他的劇本相提並論。"},{"english":"Gog of Magog has a plan to destroy Israel but is no match for the power of God.","chinese":"哥格計劃毀滅以色列，但跟天主的力量不能相提並論。"},{"english":"For no creatures under God are as we are, none so like Him as ourselves.","chinese":"只有我們能和上帝相提並論，別無分號。"},{"english":"Most English people bracket American and Canadian accents together.","chinese":"大多數英國人都把美國音和加拿大音相提並論。"},{"english":"It can be compared with classmates and comrades-in-arms is the fellow townsman .","chinese":"可以與同學和戰友相提並論的是同鄉。"},{"english":"people equate success in life with the ability of operating computer.","chinese":"人們把會施用計較機與人生樂成相提並論。"},{"english":"People equate success in life with the ability of  operating computer.","chinese":"人們把會使用計算機與人生成功相提並論。"},{"english":"People equate success in life with the ability of operating computer.","chinese":"人們把會使用秏羗計算機與人生成功相提並論。"}],"related":[{"definition":["to confuse one thing with another (idiom); to muddle"],"pinyin":["hun4 wei2 yi1 tan2"],"word":"混為一談"},{"definition":["political correctness\/politically correct"],"pinyin":["zheng4 zhi4 zheng4 que4"],"word":"政治正確"},{"definition":["clear\/evident\/obvious(ly)"],"pinyin":["xian3 ran2"],"word":"顯然"},{"definition":["similar\/analogous"],"pinyin":["lei4 si4"],"word":"類似"},{"definition":["to assert\/to claim"],"pinyin":["xuan1 cheng1"],"word":"宣稱"},{"definition":["closely bound up (idiom); intimately related"],"pinyin":["xi1 xi1 xiang1 guan1"],"word":"息息相關"},{"definition":["nature\/characteristic\/CL:個|个[ge4]"],"pinyin":["xing4 zhi4"],"word":"性質"},{"definition":["let alone\/to say nothing of\/besides\/what's more"],"pinyin":["he2 kuang4"],"word":"何況"},{"definition":["to come apart"],"pinyin":["tuo1 jie2"],"word":"脫節"},{"definition":["argument\/view (sometimes derogatory)"],"pinyin":["lun4 diao4"],"word":"論調"},{"definition":["contempt\/contemptuous\/to despise\/to scorn\/scornful"],"pinyin":["qing1 shi4"],"word":"輕視"},{"definition":["can be counted on one's fingers (idiom)\/very few"],"pinyin":["qu1 zhi3 ke3 shu3"],"word":"屈指可數"},{"definition":["to assert\/assertion"],"pinyin":["duan4 yan2"],"word":"斷言"},{"definition":["to differentiate\/to draw a distinction\/to divide into categories"],"pinyin":["qu1 fen1"],"word":"區分"},{"definition":["to run in the opposite direction (idiom); to run counter to"],"pinyin":["bei4 dao4 er2 chi2"],"word":"背道而馳"},{"definition":["indeed\/true! (I agree with you)"],"pinyin":["cheng2 ran2"],"word":"誠然"}]}