{"definition":["to merge with\/interlinking\/to join with\/to interlock"],"pinyin":["xiang1 jie1"],"simplified":["相接"],"rank":24032.0,"normalized_rank":0.3362388594294349,"fraction":0.0000016194757924062755,"cumulative_fraction":0.9827904978718524,"word":"相接","characters":[{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"},{"definition":["to receive\/to answer (the phone)\/to meet or welcome sb\/to connect\/to catch\/to join\/to extend\/to take one's turn on duty\/to take over for sb"],"pinyin":["jie1"],"word":"接"}],"containing_words":[{"definition":["lit. short-weaponed soldiery fight one another (idiom); fierce hand-to-hand infantry combat\/to fight at close quarters"],"pinyin":["duan3 bing1 xiang1 jie1"],"word":"短兵相接"},{"definition":["to join head to tail\/bumper-to-bumper (of traffic jam)"],"pinyin":["shou3 wei3 xiang1 jie1"],"word":"首尾相接"}],"sentences":[{"english":"It was bumper-to-bumper all the way from school.","chinese":"從學校過來的路上都是一輛輛首尾相接的車。"},{"english":"They closed with their enemy and started a fierce struggle.","chinese":"他們與敵人短兵相接，一場激戰開始了。"},{"english":"The single-phase-to-earth fault in the system takes place frequently.","chinese":"在這類系統中，發生最多的是單相接地故障。"},{"english":"The mandala of between machines were used conveyor.","chinese":"其中間的機器之間可用輸送機相接。"},{"english":"A car turned over and blocked the road, so all the traffic was held up.","chinese":"從學校過來的路上都是一輛輛首尾相接的車。"},{"english":"Our soldiers grappled with the enemy at close range .","chinese":"我們的戰士和敵人短兵相接地搏鬥。"},{"english":"The septum articulates caudally with the anterior nasal spine.","chinese":"鼻中隔的尾側端與前鼻棘相接。"},{"english":"Green jade blue sky with broad ocean water the sky connect.","chinese":"碧藍的天空與遼闊的大海水天相接。"},{"english":"A lifting handle is arranged on the toaster, which is connected with the switch C.","chinese":"多士爐上設置有一提手，該提手與開關C相接。"},{"english":"In modern naval warfare, men seldom fight hand to hand.","chinese":"在現代海戰中，很少有短兵相接的場面。"},{"english":"Blink of an eye, Tianshui phase appeared together with the landlord Hongxia.","chinese":"轉眼間，天水相接的地主出現了一道紅霞。"},{"english":"Objective To observe the effect of fabricating tissue-engineering bone using biphasic seeding method.","chinese":"目的觀察雙相接種法構建組織工程骨的效果。"},{"english":"As for the connecting part with the heart, I covered it with some green grass and bushes.","chinese":"而在桃心相接的底部，我加入了一些綠草和灌木。"},{"english":"Bereavements and blessings, one following another, make us sad and biessed by turns.","chinese":"喪親之痛和緈褔祝願，彼此相接，使我們悲喜交加。"},{"english":"Of furniture decorate should size look line, on any account is conterminous , strewn at random have send.","chinese":"傢俱的佈置應該大小相襯，高低相接，錯落有致。"},{"english":"The single line-to-ground (SLG) faults in low ground current system may have many features.","chinese":"小電流接地系統單相接地時有許多特點。"}],"related":[{"definition":["to link\/to join\/link\/connection"],"pinyin":["xiang1 lian2"],"word":"相連"},{"definition":["to flow together\/confluence (of rivers, airflow, roads)\/(international) cooperation"],"pinyin":["jiao1 hui4"],"word":"交匯"},{"definition":["to cross over (e.g. traffic)\/to intersect\/to make friends"],"pinyin":["xiang1 jiao1"],"word":"相交"},{"definition":["to look at one another\/to face each other"],"pinyin":["xiang1 wang4"],"word":"相望"},{"definition":["to link up\/to thread together"],"pinyin":["guan4 tong1"],"word":"貫通"},{"definition":["to connect\/to communicate\/to relate\/(math.) connected"],"pinyin":["lian2 tong1"],"word":"連通"},{"definition":["to adjoin"],"pinyin":["pi2 lian2"],"word":"毗連"},{"definition":["common boundary\/common border"],"pinyin":["jiao1 jie4"],"word":"交界"},{"definition":["to crisscross\/to intertwine"],"pinyin":["jiao1 cuo4"],"word":"交錯"},{"definition":["horizontal traverse\/to cut across\/to cross transversally"],"pinyin":["heng2 guan4"],"word":"橫貫"},{"definition":["to link up\/to join together\/to connect"],"pinyin":["guan4 lian2"],"word":"貫連"},{"definition":["lit. warp string in weaving\/fig. vertical or north-south lines\/to pass through\/to cross lengthwise\/to pierce (esp. north-south or top-to-bottom)"],"pinyin":["zong4 guan4"],"word":"縱貫"},{"definition":["to interact\/interrelated"],"pinyin":["xiang1 lian2"],"word":"相聯"},{"definition":["overall length\/span"],"pinyin":["quan2 chang2"],"word":"全長"},{"definition":["western extremity"],"pinyin":["xi1 duan1"],"word":"西端"},{"definition":["northern extremity"],"pinyin":["bei3 duan1"],"word":"北端"}]}