{"definition":["phase space (math., ordinary differential equations)"],"pinyin":["xiang4 kong1 jian1"],"simplified":["相空间"],"rank":71091.0,"normalized_rank":0.9946553243882306,"fraction":1.897709149205118e-9,"cumulative_fraction":0.9999993372615608,"word":"相空間","characters":[{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"},{"definition":["empty\/air\/sky\/in vain","to empty\/vacant\/unoccupied\/space\/leisure\/free time"],"pinyin":["kong1","kong4"],"word":"空"},{"definition":["between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms","gap\/to separate\/to thin out (seedlings)\/to sow discontent"],"pinyin":["jian1","jian4"],"word":"間"}],"containing_words":[],"sentences":[{"english":"One key problem when analyzing actual acoustic signal in phase space is how to reduce the noise and lower the embedding dimension.","chinese":"實際水聲信號在相空間中分析時的首要問題是降噪。"},{"english":"Phase-space reconstruction theory of multivariate time series is introduced.","chinese":"介紹了多變量時間序列相空間重構理論。"},{"english":"How to determinate those parameters of the time delay method were studied.","chinese":"並深入分析了延遲時間和相空間維數的確定原理。"},{"english":"We shows that an inhomogeneous superfluid state is most widespread in the phase diagram.","chinese":"作者發現了一種非均勻的超流相在相空間占主導地位。"},{"english":"The pseudo random of chaotic state is described according to the motion of point in phase.","chinese":"用相空間表示點的運動來描寫混沌態的贗隨機變化。"},{"english":"It proposed the approach of solving three basic crack tip fields in phase space.","chinese":"給出了三種基本形式裂紋端部場在相空間內求解方法。"},{"english":"In the phase space of the elastic parameter, the generalized linear inversion equations are presented.","chinese":"在彈性參數的相空間中，得到廣義線性反演方程。"},{"english":"The character of the phase space of subsystem is analyzed.","chinese":"研究了路段交通子系統的相空間特徵。"},{"english":"The recurrence plots and quantification recurrence analysis on the basis of state space reconstruction are explored.","chinese":"研究了基於相空間重構的遞歸圖及定量遞歸分析。"},{"english":"There are many uneven factor in the phase space of multi-particle.","chinese":"末態粒子相空間存在着各種非均勻因素。"}],"related":[]}