{"definition":["equivalent to"],"pinyin":["xiang1 dang1 yu2"],"simplified":["相当于"],"rank":3169.0,"normalized_rank":0.04433842150182586,"fraction":0.00004500796789169779,"cumulative_fraction":0.7985665984726763,"word":"相當於","characters":[{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"},{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[{"definition":["greater than or equal to ≥\/at least as great as"],"pinyin":["xiang1 dang1 yu2 huo4 da4 yu2"],"word":"相當於或大於"}],"sentences":[{"english":"The words of the equivalent of 19 AnLun times of enlightenment.","chinese":"經論字數相當於十九部《菩提道次廣論》。"},{"english":"That is the cold dish like a salad.","chinese":"然後做相當於色拉的冷菜。"},{"english":"And now the South Koreans say they have evidence of what amounts to an act of war.","chinese":"韓國稱他們擁有相當於“戰爭性攻擊行爲”的證據。"},{"english":"Petal clear ZhenTianLei is a northeast pure the yes, this sentence is equivalent to shock him.","chinese":"瓣兒清晰震天雷是個東北純爺們，這句話相當於激他。"},{"english":"The entire image width covers about one-half a degree, about the same angular width as the full moon.","chinese":"整個圖像寬度約半度，相當於一個滿月的直徑寬度。"},{"english":"It thus acts as a supercapacitor.","chinese":"因此它的作用相當於一個超級電容器。"},{"english":"The verbal equivalent of about 150 average-length books!","chinese":"這些字大約相當於150本中等篇幅的書。"},{"english":"The overpayment equals the expected loss of the government loan.","chinese":"的價格相當於政府貸款的預期損失。"},{"english":"More volume equates to being able to handle faster line speeds and larger areas.","chinese":"更多體積相當於能夠處理線速度更快和更大的領域。"},{"english":"In South Africa, Global English therefore represents the cultural equivalent of a neutron bomb.","chinese":"在南非，全球化英語就相當於一顆文化的中子彈。"},{"english":"Camels are represented in the New World by lamas.","chinese":"在新世界駱馬相當於駱駝。"},{"english":"The Moukisac is made of a nice suede-like material about the size of a small satchel.","chinese":"它由上好的絨面類材料製成，大小相當於一個小書包。"},{"english":"Lower line currents are associated with lower resistive losses (I2R) in the line.","chinese":"降低電流相當於降低線路上的電附性損耗。"},{"english":"That corresponds to normal vector pointing up.","chinese":"那相當於法向量指向上。"},{"english":"From the sealing structure, it is similar to multi - layer cylindrical wall.","chinese":"從其結構上看，它相當於多層圓筒壁的傳熱。"},{"english":"Two 40s is the equivalent of, what, six beers?","chinese":"兩隻手40盎司，相當於，額，六支啤酒？"}],"related":[]}