{"definition":["physiognomy"],"pinyin":["xiang4 shu4"],"simplified":["相术"],"rank":60067.0,"normalized_rank":0.8404152617072181,"fraction":4.1165690775064866e-8,"cumulative_fraction":0.9998176710244956,"word":"相術","characters":[{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"},{"definition":["method\/technique","various genera of flowers of Asteracea family (daisies and chrysanthemums), including Atractylis lancea"],"pinyin":["shu4","zhu2"],"word":"術"}],"containing_words":[{"definition":["astrology"],"pinyin":["xing1 xiang4 shu4"],"word":"星相術"},{"definition":["positron emission tomography (PET)"],"pinyin":["zheng4 dian4 zi3 fa1 she4 duan4 ceng2 zhao4 xiang1 shu4"],"word":"正電子發射斷層照相術"}],"sentences":[{"english":"X-ray photography used to fathom such mysteries as honeybee navigation.","chinese":"用來探測像蜜蜂飛行導向這類奧祕的x光照相術。"},{"english":"Myocardial perfusion scintigraphy provides complementary data for assessing ischemic burden.","chinese":"心肌灌注閃爍照相術對缺血程度估計提供輔助資料。"},{"english":"This peper presents a method for measuring rigid body motion by white light digital speckle photography.","chinese":"給出了一個測量物體剛體位移的數字白光散斑照相術。"},{"english":"It leads to the dramatic advances in astronomical photography.","chinese":"天文照相術得到巨大發展。"},{"english":"Schlieren photography is a very sensitive optical arrangement.","chinese":"條紋照相術是一種非常靈敏的光學技術。"},{"english":"Learn how to read a person just by looking at their hand using the ancient art of palmistry.","chinese":"只要通過古老的手相術就可以知道怎麼看一個人。"},{"english":"Janice: Are you sure? I've read a lot about palmistry.","chinese":"你真的不信？我讀過很多關於手相術的書。"},{"english":"Two Do you believe in palmistry?","chinese":"你相信手相術嗎？"},{"english":"The fundamental and developments of the laser speckle photography are introduced in this paper.","chinese":"介紹了激光散斑照相術的基本原理及其發展。"}],"related":[]}