{"definition":["to alternate\/to follow one another"],"pinyin":["xiang1 jian4"],"simplified":["相间"],"rank":15848.0,"normalized_rank":0.22173408140136835,"fraction":0.000003739508867322117,"cumulative_fraction":0.9623766202736108,"word":"相間","characters":[{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"},{"definition":["between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms","gap\/to separate\/to thin out (seedlings)\/to sow discontent"],"pinyin":["jian1","jian4"],"word":"間"}],"containing_words":[],"sentences":[{"english":"The ions in TATB are with positive and negative charges in turns.","chinese":"整個TATB分子上面離子的淨電荷是正負相間的。"},{"english":"I had made a special pouch for her, red and green with white lace.","chinese":"我爲她做的小袋很特別，紅綠相間鑲着白邊。"},{"english":"Bertha is a cute brown and white bear.","chinese":"柏莎是一隻可愛的棕白相間的熊。"},{"english":"When I wake, a tatter of blue and green beneath my nails.","chinese":"我醒來的時候，我指甲下有一縷藍綠相間的碎布纖維。"},{"english":"The one on the far right, with long, black-and-white hair, is Buddie .","chinese":"最右邊有着長長的黑白相間的毛的那只是布迪。"},{"english":"A large brown and black dog, with a serious expression.","chinese":"一隻棕黑相間的大狗，帶着嚴肅的表情。"},{"english":"He long with black and white cat, as well as a pair of round Yo's big eyes.","chinese":"他長着黑白相間的貓，還有一雙圓溜溜的大眼睛。"},{"english":"Those children are always quarreling among themselves .","chinese":"那些小孩子互相間老是吵吵鬧鬧。"},{"english":"I had made a special pouch for her, red and GREen with white lace.","chinese":"我爲她做的小袋很非凡，紅綠相間還鑲着白邊。"},{"english":"We often practice speaking English among ourselves.","chinese":"我們經常互相間練習講英語。"},{"english":"Her coat is blue and yellow.","chinese":"她穿着藍黃相間的外套。"},{"english":"He wore a skintight black and yellow outfit covered with advertisements.","chinese":"羅伯特身穿黃黑相間的緊身外衣，上面印有廣告。"},{"english":"The red lionfish sports maroon and white stripes to complement its venomous spines.","chinese":"紅獅子魚褐白相間的條紋真是爲它的毒刺錦上添花。"},{"english":"The evening sky flamed with red and orange.","chinese":"傍晚天空的顏色是一片火紅和橘黃相間。"},{"english":"The pork is cut into 2-inch squares of both fat and lean meat with the skin left on.","chinese":"肥瘦相間的豬肉被切成2英寸見方的肉塊，保留豬皮。"},{"english":"Left dry throat pain, cough, sputum color white yellow.","chinese":"咽喉左側幹疼，伴有咳嗽，白黃相間色痰。"}],"related":[]}