{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"simplified":["相关"],"rank":255.0,"normalized_rank":0.0035677808403173227,"fraction":0.0004830230338814176,"cumulative_fraction":0.4217976718989699,"word":"相關","characters":[{"definition":["appearance\/portrait\/picture\/government minister\/(physics) phase\/(literary) to appraise (esp. by scrutinizing physical features)\/to read sb's fortune (by physiognomy, palmistry etc)","each other\/one another\/mutually\/fret on the neck of a pipa 琵琶[pi2 pa5] (a fret on the soundboard is called a 品[pin3])","surname Xiang"],"pinyin":["Xiang1","xiang1","xiang4"],"word":"相"},{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["Guan1","guan1"],"word":"關"}],"containing_words":[{"definition":["closely related"],"pinyin":["mi4 qie4 xiang1 guan1"],"word":"密切相關"},{"definition":["closely bound up (idiom); intimately related"],"pinyin":["xi1 xi1 xiang1 guan1"],"word":"息息相關"},{"definition":["correlation"],"pinyin":["xiang1 guan1 xing4"],"word":"相關性"},{"definition":["to share the same interests (idiom)\/to be closely related\/to be in the same boat"],"pinyin":["xiu1 qi1 xiang1 guan1"],"word":"休戚相關"},{"definition":["event-related potential"],"pinyin":["shi4 jian4 xiang1 guan1 dian4 wei4"],"word":"事件相關電位"}],"sentences":[{"english":"They're less likely to nitpick about details that aren't relevant at this stage.","chinese":"減少他們在與主題不相關的細節上的吹毛求疵。"},{"english":"The results have important guiding significance on the production safety of fertilizer-related enterprises.","chinese":"研究結果對相關化肥企業的安全生產有指導意義。"},{"english":"These are usually associated with a major publisher and a strong brand.","chinese":"他們通過與一個大型的發行商和很強的品牌相關聯。"},{"english":"At least 3 years facility related work experience.","chinese":"至少3年廠務相關的工作經驗。"},{"english":"Hand-in-glove with radar was battle management.","chinese":"與雷達密切相關的是戰鬥管理。"},{"english":"This paper talks about related problems with campus culture construction in higher institutes .","chinese":"本文對高校校園文化建設的相關問題加以論述。"},{"english":"The development of financial circles and strick precaution of the risk are closely linked with disclosure of financial information.","chinese":"金融業的發展及其風險的防範與信息披露息息相關。"},{"english":"Objective To investigate the anatomical structures of the posterior column of the acetabulum and the related clinical significance.","chinese":"目的探討髖臼後柱的解剖學結構及其相關臨牀意義。"},{"english":"Yes. A specific subject-selection system allows the training coordinator to select relevant subjects for each target group.","chinese":"可以根據每一個目標羣設定相關的培訓主題。"},{"english":"Furthermore, the expression of MMP9 in tumor tissues was positively associated with the MVD val-ue.","chinese":"腫瘤組織中MMP9的表達與微血管密度呈正相關。"},{"english":"An easy to use collaborative environment for editing and running features. There is already RubyMine and LowDown, but I have some different ideas myself.","chinese":"提供易於使用的協助環境來編輯和運行相關功能。"},{"english":"Bugfix related to optimizing Far-field data including surface-wave.","chinese":"修正了相關的優化遠場數據，包括地面波。"},{"english":"Correlation analysis showed there was relationship between pet owning and health.","chinese":"相關分析表明，是否擁有寵物犬與身心健康顯著相關。"},{"english":"Correlation analysis showed there was relationship between pet owning and health.","chinese":"相關分析表明，是否擁有寵物犬與身心健康顯著相關。"},{"english":"This inhibiting effect was due chiefly to the concentration of combined nitrogen.","chinese":"化合態氮的抑制作用與濃度密切相關。"},{"english":"we can offer: Website translation service, language interpretation service, editing service, proofread-ing service and more","chinese":"相關的俄文或英文文件翻譯及俄漢口譯工作。"}],"related":[{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有關"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["to correspond\/answering (one another)\/to agree (among the part)\/corresponding\/relevant\/appropriate\/(modify) accordingly"],"pinyin":["xiang1 ying4"],"word":"相應"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"},{"definition":["concrete\/definite\/specific"],"pinyin":["ju4 ti3"],"word":"具體"},{"definition":["follow-up\/(dialect) to remarry"],"pinyin":["hou4 xu4"],"word":"後續"},{"definition":["to target\/to focus on\/to be aimed at or against\/in response to"],"pinyin":["zhen1 dui4"],"word":"針對"},{"definition":["to follow\/to follow up"],"pinyin":["gen1 jin4"],"word":"跟進"},{"definition":["individual\/specific\/respective\/just one or two"],"pinyin":["ge4 bie2"],"word":"個別"},{"definition":["all categories"],"pinyin":["ge4 lei4"],"word":"各類"},{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"word":"協助"},{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge"],"pinyin":["bing4"],"word":"並"},{"definition":["these"],"pinyin":["zhe4 xie1"],"word":"這些"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"},{"definition":["regarding\/as far as sth is concerned\/with regards to"],"pinyin":["dui4 yu2"],"word":"對於"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"}]}