{"definition":["to omit\/to dispense with\/to make unnecesary\/to save (time, trouble etc)"],"pinyin":["sheng3 qu4"],"simplified":["省去"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"省去","characters":[{"definition":["to inspect\/to examine\/to be aware\/to pay a visit (to one's parents or elders)","to save\/to economize\/to do without\/to omit\/to leave out\/province\/(archaic) central government department"],"pinyin":["sheng3","xing3"],"word":"省"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"In writing telegrams, omit superfluous words .","chinese":"寫電報稿要省去不必要的字。"},{"english":"Since you don' t use any utensils to eat, you can use this bread to scoop up the curry or rice.","chinese":"你可以用麪包來盛咖喱粉和米飯而省去了器皿。"},{"english":"A case well-stated is half-tried.","chinese":"充分陳述的案件能省去一半的審問。"},{"english":"Omit the questionable passage and draw back from the edge.","chinese":"省去可疑的段落，從剽竊的邊緣上抽身而退。"},{"english":"This finishing operation is omitted on bodies receiving rubber diaphragms.","chinese":"這道修整工序省去了配置橡膠隔膜的閥體。"},{"english":"There is no need for solid solution and overaging pretreatments in the superplastic deformation process.","chinese":"可省去固溶與過時效預處理工序。"},{"english":"Having a one-button deployment saves you a lot of headaches.","chinese":"擁有一鍵式部署將爲您省去很多令人頭痛之事。"},{"english":"Direct driving by hollow shaft expels chains and saves time for lubrication and tension adjustment on chains.","chinese":"直接由空心驅動軸驅動，省去了鏈條潤滑等維護工作。"},{"english":"Hymie said it'd save a lot of legal mess.","chinese":"海米說這樣可以省去許多法律上的麻煩。"},{"english":"But trust me it saves you from a lot of unnecessary hassle.","chinese":"但值得信賴的是這會讓你省去很多不必要的麻煩。"},{"english":"Paul decides to go through a realtor to save himself the trouble of running all over town looking.","chinese":"保羅決定通過房屋中介，省去到城裏到處亂找的麻煩。"},{"english":"Produce can take a big chunk out of your grocery budget.","chinese":"自產糧食可以省去你日常一大部分的開支。"},{"english":"Putting a meal in the slow cooker saves you from needing to heat up the kitchen later in the day.","chinese":"用文火慢慢燉着，可以省去在黃昏時分到廚房裏加熱。"},{"english":"Cisco even figured out a way to save on in-house tech-support staff.","chinese":"思科公司研究出一種能省去家庭技術支持人員的方法。"},{"english":"By being honest with your answers, you can avoid many unnecessary troubles.","chinese":"對以上問題回答自如，你能省去一些不必要的麻煩。"},{"english":"She could save him a lot of time and touble.","chinese":"她能讓他省去很多時間和麻煩。"}],"related":[{"definition":["saving\/to save\/to use sparingly\/to cut down on"],"pinyin":["jie2 sheng3"],"word":"節省"},{"definition":["to handle administrative work","to simplify matters\/to save trouble"],"pinyin":["sheng3 shi4","xing3 shi4"],"word":"省事"},{"definition":["to economize\/to conserve (resources)\/economy\/frugal"],"pinyin":["jie2 yue1"],"word":"節約"},{"definition":["many and complicated\/mired in minor details"],"pinyin":["fan2 suo3"],"word":"繁瑣"},{"definition":["to take time\/time-consuming"],"pinyin":["fei4 shi2"],"word":"費時"},{"definition":["convenient\/suitable\/to facilitate\/to make things easy\/having money to spare\/(euphemism) to relieve oneself"],"pinyin":["fang1 bian4"],"word":"方便"},{"definition":["need not"],"pinyin":["bu4 yong4"],"word":"不用"},{"definition":["to save labor\/to save effort"],"pinyin":["sheng3 li4"],"word":"省力"},{"definition":["needless"],"pinyin":["wu2 xu1"],"word":"無需"},{"definition":["to simplify"],"pinyin":["jian3 hua4"],"word":"簡化"},{"definition":["to fix\/to settle\/to wangle"],"pinyin":["gao3 ding4"],"word":"搞定"},{"definition":["requiring much time and effort"],"pinyin":["hao4 shi2 hao4 li4"],"word":"耗時耗力"},{"definition":["to waste\/to spend\/to consume\/to squander"],"pinyin":["hao4 fei4"],"word":"耗費"},{"definition":["firstly, ..."],"pinyin":["yi1 lai2"],"word":"一來"},{"definition":["simple and convenient\/handy"],"pinyin":["jian3 bian4"],"word":"簡便"},{"definition":["expense\/cost\/to spend (time or money)\/expenditure"],"pinyin":["hua1 fei4"],"word":"花費"}]}