{"definition":["provincial Party committee"],"pinyin":["sheng3 wei3"],"simplified":["省委"],"rank":2900.0,"normalized_rank":0.040574762497726416,"fraction":0.00005017032068804316,"cumulative_fraction":0.7858289770095045,"word":"省委","characters":[{"definition":["to inspect\/to examine\/to be aware\/to pay a visit (to one's parents or elders)","to save\/to economize\/to do without\/to omit\/to leave out\/province\/(archaic) central government department"],"pinyin":["sheng3","xing3"],"word":"省"},{"definition":["same as 逶 in 逶迤 winding, curved","surname Wei","to entrust\/to cast aside\/to shift (blame etc)\/to accumulate\/roundabout\/winding\/dejected\/listless\/committee member\/council\/end\/actually\/certainly"],"pinyin":["Wei3","wei1","wei3"],"word":"委"}],"containing_words":[],"sentences":[{"english":"Governor of Hunan Province Mei Kebao also attended the meeting.","chinese":"省委副書記梅克保參加會見。"},{"english":"PS Wang meeting: Ambassador Huntsman called on Party Secretary Wang Yang and Mayor Wan at Zhudao this morning.","chinese":"大使今晨在珠島賓館與省委書記汪洋及萬市長會面。"},{"english":"The main leaders of the Party Committee in Jiangxi province proposed that Xinyu take the lead to realize the city and countryside integration.","chinese":"省委主要領導要求新餘在全省率先實現城鄉一體化。"},{"english":"Mao linsheng was appointed member of the Standing Committee of CPC Zhejiang Provincial Committee.","chinese":"任命茅臨生爲中共浙江省委常委。"},{"english":"After the meeting, by the Hunan Provincial Party Committee Secretary Zhang Chunxian reporters, \"containment.\"","chinese":"會後，湖南省委書記張春賢受到記者的“圍堵”。"},{"english":"Be named to be by round provincial Party committee recently \" Yunnan saves expert of first youth station \" .","chinese":"最近被團省委命名爲“雲南省首屆青年崗位能手”。"},{"english":"The report is said to have caused the Guangdong Provincial Party Committee and provincial government attention.","chinese":"該報告說，已造成廣東省委，省政府的關注。"},{"english":"Zhao Hongzhu, provincial Party committee secretaries of Zhejiang, and Board chairman Zheng Yuanbao.","chinese":"浙江省委書記趙洪祝與鄭元豹董事長。"},{"english":"Liu Qibao, secretary of Sichuan Province Party Committee and Board Chairman Zheng Yuanbao.","chinese":"中共四川省委書記劉奇葆與鄭元豹董事長親切交談。"},{"english":"The party has also urged that the city's legislature vote to strip him from his mayoral post.","chinese":"中共山西省委還督促市人大投票解除他的市長職務。"},{"english":"Deputy Secretary of the Hunan Provincial CPC Committee Mei Kebao made an important speech at the celebration meeting.","chinese":"湖南省委副書記梅克保在會上發表重要講話。"},{"english":"Zhou Qiang, secretary of the CPC Hunan Provincial Committee, delivers a speech at the closing ceremony.","chinese":"中共湖南省委書記周強在閉幕式上發表講話。"},{"english":"Xu Guangchun-the current secretary of Henan Provincial Party Committee and the Chairman-Zheng Yuanbao.","chinese":"原河南省委書記徐光春與鄭元豹董事長。"},{"english":"He graduated from Hunan Provincial Party College in 1992.","chinese":"1992年於湖南省委黨校大學專科畢業。"},{"english":"Mei Kebao, vice secretary of the Hunan Provincial CPC Committee attended the closing ceremony and delivered a speech.","chinese":"湖南省委副書記梅克保出席閉幕式並講話。"},{"english":"Four provincial governors and one provincial party secretary recently were charged with corruption.","chinese":"最近有幾名省長和省委書記被控腐敗。"}],"related":[{"definition":["municipal committee"],"pinyin":["shi4 wei3"],"word":"市委"},{"definition":["secretary (chief official of a branch of a socialist or communist party)\/clerk\/scribe"],"pinyin":["shu1 ji5"],"word":"書記"},{"definition":["governor of a province"],"pinyin":["sheng3 zhang3"],"word":"省長"},{"definition":["CCP county committee"],"pinyin":["xian4 wei3"],"word":"縣委"},{"definition":["standing committee"],"pinyin":["chang2 wei3 hui4"],"word":"常委會"},{"definition":["deputy secretary"],"pinyin":["fu4 shu1 ji5"],"word":"副書記"},{"definition":["member of standing committee"],"pinyin":["chang2 wei3"],"word":"常委"},{"definition":["discipline inspection commission"],"pinyin":["ji4 wei3"],"word":"紀委"},{"definition":["district chief"],"pinyin":["qu1 zhang3"],"word":"區長"},{"definition":["city hall\/city government"],"pinyin":["shi4 zheng4 fu3"],"word":"市政府"},{"definition":["Party committee"],"pinyin":["dang3 wei3"],"word":"黨委"},{"definition":["county's head commissioner"],"pinyin":["xian4 zhang3"],"word":"縣長"},{"definition":["mayor"],"pinyin":["shi4 zhang3"],"word":"市長"},{"definition":["deputy mayor"],"pinyin":["fu4 shi4 zhang3"],"word":"副市長"},{"definition":["head of provincial PRC government department"],"pinyin":["ting1 zhang3"],"word":"廳長"},{"definition":["Military Commission of the Communist Party Central Committee"],"pinyin":["jun1 wei3"],"word":"軍委"}]}