{"definition":["provincial capital"],"pinyin":["sheng3 hui4"],"simplified":["省会"],"rank":7359.0,"normalized_rank":0.10296195766233404,"fraction":0.000013645550626172833,"cumulative_fraction":0.9016046944336572,"word":"省會","characters":[{"definition":["to inspect\/to examine\/to be aware\/to pay a visit (to one's parents or elders)","to save\/to economize\/to do without\/to omit\/to leave out\/province\/(archaic) central government department"],"pinyin":["sheng3","xing3"],"word":"省"},{"definition":["can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])","to balance an account\/accountancy\/accounting"],"pinyin":["hui4","kuai4"],"word":"會"}],"containing_words":[],"sentences":[{"english":"Local secondary education is concentrated in the provincial capitals and some district centers.","chinese":"當地的中級教育主要集中在省會和其它一些行政中心。"},{"english":"Nanjing, capital of the neighboring Jiangsu province, did so five years ago.","chinese":"鄰省江蘇省的省會南京市在五年前就已經實施了。"},{"english":"Chengdu is the capital of Sichuan and is the cultural and industrial center for the agricultural Chengdu Plain.","chinese":"成都是四川的省會，也是成都平原的文化和工業中心。"},{"english":"Hebei province is briefly named as Ji, with Shijiazhuang as its provincial seat.","chinese":"河北省簡稱冀，省會城市是石家莊。"},{"english":"Furong District is located in Changsha, the capital city of Hunan Province.","chinese":"芙蓉區位於湖南省省會長沙市。"},{"english":"Chihli Qing Dynasty was the first capital of the province.","chinese":"清代曾爲直隸省第一省會。"},{"english":"Shenyang is the capital of Liaoning Province. It's the largest city in the Northeast.","chinese":"瀋陽是遼寧省的省會，它是東北最大年夜的皆會。"},{"english":"Part of Xinji City, Hebei Province in Shijiazhuang, the provincial capital.","chinese":"辛集市隸屬於河北省省會石家莊市。"},{"english":"County Administrative Office is located in Lijiang area, 527 kilometers from the provincial capital Kunming.","chinese":"地區行署所在地麗江縣，距離省會昆明市527公里。"},{"english":"Located in central Gansu Province, Dingxi City West, is the southern gate of the provincial capital Lanzhou.","chinese":"位於甘肅省中部，定西市西部，是省會蘭州的南大門。"},{"english":"Haikou, the capital of Hainan Province, is in the northeast of the island.","chinese":"海口市是海南省省會，它位於海南島的東北部。"},{"english":"Kunming is the capital of Yunnan Province, it is called \"Spring City\".","chinese":"昆明是雲南省的省會，被稱爲“春城”。"},{"english":"Last month I escorted Marston to Zhengzhou, the capital city of Henan Province on a tour.","chinese":"上個月，我陪同馬斯頓去河南省省會城市鄭州去旅行。"},{"english":"A spectacular march in four days brought them within ten miles of the capital, Yunnanfu.","chinese":"他們在四天急行軍後到達距省會雲南府十英里處。"},{"english":"Since last year, the provincial capital on the market has entered a new era of overlapping.","chinese":"去年以來，省會市場上已進入一個新時代的重疊。"},{"english":"Jilin is briefly named as Ji, with Changchun as its provincial seat.","chinese":"吉林省簡稱吉，省會城市是長春。"}],"related":[{"definition":["municipality, namely: Beijing 北京, Tianjin 天津, Shanghai 上海 and Chongqing 重慶|重庆, the first level administrative subdivision\/province level city\/also called directly governed city"],"pinyin":["zhi2 xia2 shi4"],"word":"直轄市"},{"definition":["inland\/interior"],"pinyin":["nei4 lu4"],"word":"內陸"},{"definition":["Yangtze River Delta\/abbr. for 長江三角洲|长江三角洲"],"pinyin":["Chang2 San1 jiao3"],"word":"長三角"},{"definition":["administrative district"],"pinyin":["xing2 zheng4 qu1"],"word":"行政區"},{"definition":["traffic hub"],"pinyin":["jiao1 tong1 shu1 niu3"],"word":"交通樞紐"},{"definition":["special economic zone"],"pinyin":["jing1 ji4 te4 qu1"],"word":"經濟特區"},{"definition":["(military) strategic town\/(fig.) major center (for commerce, culture or tourism etc)"],"pinyin":["zhong4 zhen4"],"word":"重鎮"},{"definition":["area\/region\/district\/small\/distinguish\/CL:個|个[ge4]","surname Ou"],"pinyin":["Ou1","qu1"],"word":"區"},{"definition":["Yangtze River Delta"],"pinyin":["Chang2 Jiang1 San1 jiao3 zhou1"],"word":"長江三角洲"},{"definition":["local\/regional\/district (not necessarily formal administrative unit)\/region\/area\/as suffix to city name, means prefecture or county (area administered by a prefecture-level city or county level city)\/CL:個|个[ge4]"],"pinyin":["di4 qu1"],"word":"地區"},{"definition":["tourist city"],"pinyin":["lu:3 you2 cheng2 shi4"],"word":"旅遊城市"},{"definition":["bordering\/adjacent to"],"pinyin":["pi2 lin2"],"word":"毗鄰"},{"definition":["Binhai New District, subprovincial district of Tianjin"],"pinyin":["Bin1 hai3 xin1 qu1"],"word":"濱海新區"},{"definition":["administrative area"],"pinyin":["xing2 zheng4 qu1 yu4"],"word":"行政區域"},{"definition":["frontier defense"],"pinyin":["bian1 fang2"],"word":"邊防"},{"definition":["landmark"],"pinyin":["di4 biao1"],"word":"地標"}]}