{"definition":["to have a preference for\/to fancy\/to choose after consideration\/to settle on"],"pinyin":["kan4 zhong4"],"simplified":["看中"],"rank":6623.0,"normalized_rank":0.09266436276635932,"fraction":0.000016030095160962495,"cumulative_fraction":0.8907260984865065,"word":"看中","characters":[{"definition":["to look after\/to take care of\/to watch\/to guard","to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)"],"pinyin":["kan1","kan4"],"word":"看"},{"definition":["China\/Chinese\/surname Zhong","to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right"],"pinyin":["Zhong1","zhong1","zhong4"],"word":"中"}],"containing_words":[],"sentences":[{"english":"He took a fancy to the girl.","chinese":"他看中了這位姑娘。"},{"english":"Lazio defender Stephan Lichtsteiner is being lined up by new Inter Milan coach Rafa Benitez.","chinese":"拉齊奧後衛師太最近被傳被國妓新帥貝尼特斯看中。"},{"english":"Physical aware, of the Japanese people see is the shangguan familys reputation.","chinese":"方天翼明白，這些日本人看中的是上官家族的聲望。"},{"english":"A year later, the Empire expressed interest in the powerful warriors of the Calian Confederacy.","chinese":"一年後，帝國看中了強大的卡利安邦聯勇士。"},{"english":"Ai Hua to white women fancy Yiming indoctrination, is your money.","chinese":"艾華向白一鳴灌輸，女人看中的是你的錢。"},{"english":"The painting took his fancy, so he bought it.","chinese":"這幅畫被他看中了，所以他就把他買了下來。"},{"english":"What Zhang values about working as a civil servant is also the platform it offers.","chinese":"鄭芳看中公務員的另一點就是它提供的平臺。"},{"english":"Should we buy their own eyes.","chinese":"要自己看中才買。"},{"english":"Large astronomical observatories also take advantage of the calm Canary Island sky.","chinese":"大型天文臺也看中了加那利羣島寧靜的天空。"},{"english":"Take control and before you know it you will mesmerize the person of your choice.","chinese":"保持控制權，你已經讓你看中的人很着迷了。"},{"english":"Liu loach took the boat lake pearl household.","chinese":"劉泥鰍看中了湖邊珍珠家用過的小舟。"},{"english":"How long did they fancy a stroll Floral Jiaao.","chinese":"沒逛多久便看中一件碎花夾襖。"},{"english":"I want to add to the squad and have identified one or two targets.","chinese":"我要加強球隊的陣容，而且已經看中了一兩名球員。"},{"english":"Lei is the eyes on this small park before deciding moved here .","chinese":"磊就是看中了這個小公園才決定搬來這裏的。"},{"english":"The younger generation longs for more personal comfort.","chinese":"年輕一代更多看中個人享樂。"},{"english":"Tan Qunzhao expresses, what take a fancy to La Gang to go up in the product grandly is deep accumulate.","chinese":"譚羣釗表示，盛大看中藍港在產品上的深厚積澱。"}],"related":[{"definition":["to look upon\/to take a fancy to\/to fall for"],"pinyin":["kan4 shang4"],"word":"看上"},{"definition":["to find to one's taste\/to pick (after looking at)\/Taiwan pr. [xiang4 zhong4]"],"pinyin":["xiang1 zhong4"],"word":"相中"},{"definition":["to regard as important\/to care about"],"pinyin":["kan4 zhong4"],"word":"看重"},{"definition":["to stand out\/outstanding"],"pinyin":["chu1 zhong4"],"word":"出眾"},{"definition":["(lit.) to fix one's gaze on\/(fig.) to show interest in\/(favorable) attention\/favor"],"pinyin":["qing1 lai4"],"word":"青睞"},{"definition":["to recommend sb\/to give a referral"],"pinyin":["yin3 jian4"],"word":"引薦"},{"definition":["Sino-Italian","to take one's fancy\/to be to one's liking"],"pinyin":["Zhong1 Yi4","zhong4 yi4"],"word":"中意"},{"definition":["to pass on\/to resell\/to change hands"],"pinyin":["zhuan3 shou3"],"word":"轉手"},{"definition":["to choose\/to select"],"pinyin":["tiao1 xuan3"],"word":"挑選"},{"definition":["to keep an eye on","to regard as having good prospects"],"pinyin":["kan1 hao3","kan4 hao3"],"word":"看好"},{"definition":["to appreciate\/to recognize the worth of sth\/appreciation"],"pinyin":["shang3 shi2"],"word":"賞識"},{"definition":["to make one's name\/to become famous"],"pinyin":["cheng2 ming2"],"word":"成名"},{"definition":["to select very carefully"],"pinyin":["qian1 tiao1 wan4 xuan3"],"word":"千挑萬選"},{"definition":["to move (to pity)\/arousing (sympathy)\/touching"],"pinyin":["da3 dong4"],"word":"打動"},{"definition":["large sum of money"],"pinyin":["zhong4 jin1"],"word":"重金"},{"definition":["to place high hopes"],"pinyin":["ji4 yu3 hou4 wang4"],"word":"寄予厚望"}]}