{"definition":["to look down upon\/to despise"],"pinyin":["kan4 bu5 qi3"],"simplified":["看不起"],"rank":16350.0,"normalized_rank":0.2287577127026989,"fraction":0.000003538205719879512,"cumulative_fraction":0.9642011492327168,"word":"看不起","characters":[{"definition":["to look after\/to take care of\/to watch\/to guard","to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)"],"pinyin":["kan1","kan4"],"word":"看"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"Mockups will be looked upon more favourably.","chinese":"實物模型會看不起更有利。"},{"english":"I shocked a lot of things heart, afraid other people look down on their own.","chinese":"好多東西讓我怛心，好怕別人看不起自已。"},{"english":"He held them in contempt for behaving in such a cowardly way.","chinese":"他看不起他們，因爲他們這樣膽小怕事。"},{"english":"I wish you wouldn't look down on this kind of work.","chinese":"我希望你不要看不起這種工作。"},{"english":"Do not look down on non-P arty people, for they can master the lessons of our experience very quickly.","chinese":"不要看不起黨外人士，我們的經驗他們很快就可學會。"},{"english":"Now, some people might look down on worm's nechanics, call it immoral.","chinese":"可能有些人看不起蟲子出老千，認爲這是不道德的。"},{"english":"Latty made little of Jane's new dress because she was jealous.","chinese":"拉蒂看不起簡的新裙子，困爲她很妒嫉。"},{"english":"He was looked down upon because of his poor family.","chinese":"他因家窮而被人看不起。"},{"english":"They were very often despised because of the very widespread practice of child marriages.","chinese":"由於普遍的童婚行爲，她們常常被人看不起。"},{"english":"You shouldn't look down upon him because he is poor.","chinese":"你不應該因爲一個人窮就看不起他。"},{"english":"I look down on those who eat the bread of idleness.","chinese":"我看不起那些吃閒飯的人。"},{"english":"Nana despises Yijia when she finds out that Big Foot is her father.","chinese":"娜娜發現大腳是怡嘉的父親後立刻看不起怡嘉。"},{"english":"He despised people who were lavish with their praises .","chinese":"他看不起那些阿諛奉承的人。"},{"english":"It is better to be looked over than overlooked.","chinese":"被人仰視總比被人看不起要強的多。"},{"english":"But I can’t understand why even the nuns despised her.","chinese":"可是我不太明白爲什麼那些修女也看不起她。"},{"english":"They are also looked down upon by your FICO credit score and other lenders.","chinese":"他們也看不起你的信用信用評分，其他放款。"}],"related":[{"definition":["to look down upon\/to hold in contempt"],"pinyin":["qiao2 bu4 qi3"],"word":"瞧不起"},{"definition":["to despise\/to disdain\/to look down upon"],"pinyin":["bi3 shi4"],"word":"鄙視"},{"definition":["cannot bear to see\/to hate\/to dislike\/to disapprove"],"pinyin":["kan4 bu5 guan4"],"word":"看不慣"},{"definition":["to show respect for\/to think highly of"],"pinyin":["kan4 de5 qi3"],"word":"看得起"},{"definition":["to jeer at\/to deride\/to ridicule\/mockery\/derision"],"pinyin":["chao2 xiao4"],"word":"嘲笑"},{"definition":["to think highly of oneself (idiom); giving oneself airs\/arrogant and self-important"],"pinyin":["zi4 shi4 qing1 gao1"],"word":"自視清高"},{"definition":["to think highly of oneself (idiom); giving oneself airs\/arrogant and self-important"],"pinyin":["zi4 shi4 shen4 gao1"],"word":"自視甚高"},{"definition":["to belittle\/to scorn\/to take sth lightly"],"pinyin":["kan4 qing1"],"word":"看輕"},{"definition":["to snort disdainfully\/to scoff at\/to turn up one's nose"],"pinyin":["chi1 zhi1 yi3 bi2"],"word":"嗤之以鼻"},{"definition":["to despise\/to look down upon\/despicable"],"pinyin":["bi3 yi2"],"word":"鄙夷"},{"definition":["contempt\/contemptuous\/to despise\/to scorn\/scornful"],"pinyin":["qing1 shi4"],"word":"輕視"},{"definition":["to disdain as beneath contempt (idiom)"],"pinyin":["bu4 xie4 yi1 gu4"],"word":"不屑一顧"},{"definition":["to think of oneself as high and pure (idiom); smug and self-righteous\/holier-than-thou"],"pinyin":["zi4 ming4 qing1 gao1"],"word":"自命清高"},{"definition":["to be self-interested"],"pinyin":["shi4 li4 yan3"],"word":"勢利眼"},{"definition":["to loathe\/to despise\/contempt"],"pinyin":["mie4 shi4"],"word":"蔑視"},{"definition":["to loathe\/to hate\/disgusted with sth"],"pinyin":["yan4 wu4"],"word":"厭惡"}]}