{"definition":["to keep an eye on","to regard as having good prospects"],"pinyin":["kan1 hao3","kan4 hao3"],"simplified":["看好"],"rank":2589.0,"normalized_rank":0.03622346900228058,"fraction":0.000057250089613220005,"cumulative_fraction":0.7691915118605924,"word":"看好","characters":[{"definition":["to look after\/to take care of\/to watch\/to guard","to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)"],"pinyin":["kan1","kan4"],"word":"看"},{"definition":["good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello","to be fond of\/to have a tendency to\/to be prone to"],"pinyin":["hao3","hao4"],"word":"好"}],"containing_words":[],"sentences":[{"english":"The yuan non-deliverable forward market isn't expecting significant appreciation for the next year.","chinese":"讓市場大喜過望的人民幣在下一年完整不被看好。"},{"english":"Within bonds, we overweight credit versus underweight government bonds.","chinese":"具體而言，我們繼續相對看好企業債，看空政府債。"},{"english":"We remain unenthused regarding near tern outlook for the company.","chinese":"我們仍舊不看好該公司的近期前景。"},{"english":"Professor Duman hailed the potential of ketamine.","chinese":"Duman教授十分看好氯胺酮的潛力。"},{"english":"Subordinates are not optimistic about Wang Jingwei to sign the agreement.","chinese":"下屬不看好汪精衛要籤的協議。"},{"english":"Our country's cigarette market is attractive to many foreign tobacco companies.","chinese":"我國的菸草市場被許多外國的大煙草公司看好。"},{"english":"Liu had a good feeling about Zhang even though she was an amateur actress;","chinese":"儘管張只是一位羣衆演員，但是嘯宇很看好她。"},{"english":"The reception among food distributors and buyers for store chains has been favorable, he said.","chinese":"他說，食品批發商以及連鎖店進貨商對他們看好。"},{"english":"To be fair, Ellison is helping to finance some very promising films at Paramount.","chinese":"公平地說，埃利森確實在資助一些很被看好的電影。"},{"english":"\"You just don't believe in her,\" Iaccused.","chinese":"“你就是不看好她，”我反脣相譏。"},{"english":"The rental trend in the villa market will remain stable and may rise slightly in the future.","chinese":"別墅租賃市場前景看好，仍將穩中有升。"},{"english":"At the beginning of the bridge tournament, we were the under dogs and nobody thought we were going to win.","chinese":"橋牌賽一開始，我們不被看好，沒有人認爲我們會贏。"},{"english":"Xiangyu took the latter part of the site is promising.","chinese":"象嶼拿這幅土地是對後期看好。"},{"english":"So the insurance business is good, I ask Buffett?","chinese":"我問巴菲特，這是否意味着看好保險行業的前景？"},{"english":"Check this out. Anybody need a hanky?","chinese":"看好了，有人需要手帕嗎？"},{"english":"There are risks to the consensus bullish view on emerging markets.","chinese":"大多數人看好新興市場，這種觀點是有風險的。"}],"related":[{"definition":["foreground\/vista\/(future) prospects\/perspective"],"pinyin":["qian2 jing3"],"word":"前景"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"認為"},{"definition":["(lit.) to fix one's gaze on\/(fig.) to show interest in\/(favorable) attention\/favor"],"pinyin":["qing1 lai4"],"word":"青睞"},{"definition":["(of economy, business etc) flourishing\/prosperous"],"pinyin":["jing3 qi4"],"word":"景氣"},{"definition":["stock that has potential to increase in value\/(fig.) sb with good prospects"],"pinyin":["qian2 li4 gu3"],"word":"潛力股"},{"definition":["to overestimate\/to overrate"],"pinyin":["gao1 gu1"],"word":"高估"},{"definition":["outlook\/prospect\/to look ahead\/to look forward to"],"pinyin":["zhan3 wang4"],"word":"展望"},{"definition":["popular\/hot\/in vogue"],"pinyin":["re4 men2"],"word":"熱門"},{"definition":["future\/tomorrow\/CL:個|个[ge4]\/approaching\/coming\/pending"],"pinyin":["wei4 lai2"],"word":"未來"},{"definition":["to pay attention to\/to follow sth closely\/to follow (on social media)\/concern\/interest\/attention"],"pinyin":["guan1 zhu4"],"word":"關注"},{"definition":["to forecast\/to predict"],"pinyin":["yu4 ce4"],"word":"預測"},{"definition":["to hype\/to promote (in the media)"],"pinyin":["chao3 zuo4"],"word":"炒作"},{"definition":["to approve\/approval\/acknowledgment\/OK"],"pinyin":["ren4 ke3"],"word":"認可"},{"definition":["to have a preference for\/to fancy\/to choose after consideration\/to settle on"],"pinyin":["kan4 zhong4"],"word":"看中"},{"definition":["to come and see\/to see a topic from a certain point of view"],"pinyin":["lai2 kan4"],"word":"來看"},{"definition":["cautious\/prudent"],"pinyin":["jin3 shen4"],"word":"謹慎"}]}