{"definition":["to regard as\/to look upon as"],"pinyin":["kan4 zuo4"],"simplified":["看做"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"看做","characters":[{"definition":["to look after\/to take care of\/to watch\/to guard","to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)"],"pinyin":["kan1","kan4"],"word":"看"},{"definition":["to do\/to make\/to produce\/to write\/to compose\/to act as\/to engage in\/to hold (a party)\/to be\/to become\/to function (in some capacity)\/to serve as\/to be used for\/to form (a bond or relationship)\/to pretend\/to feign\/to act a part\/to put on appearance"],"pinyin":["zuo4"],"word":"做"}],"containing_words":[],"sentences":[{"english":"So, it's hard for me not to see this as being political.","chinese":"所以對我來說，很難不把這件事看做是一個政治事件。"},{"english":"Its light and resistant gear was taken as a novelty.","chinese":"它的輕便耐磨的齒輪被看做是一個傳奇。"},{"english":"It would not be wrong to say that it is a kind of traditional art of behavior.","chinese":"把它看做一種傳統的“行爲藝術”，也未嘗不可。"},{"english":"Today, many Burmese view China as a pillager of resources.","chinese":"如今，許多緬族人都把中國看做是一個資源掠奪者。"},{"english":"The hijacking of the Alabama is believed the first pirate attack on an American-flagged merchant ship in 200 years.","chinese":"阿拉巴馬被看做200年來第一艘被劫的美國船隻。"},{"english":"He looked upon his wife as the better half.","chinese":"他把妻子看做是賢內助。"},{"english":"Time to move forward, I also look forward to what?","chinese":"時間向前走，我還往後看做什麼？"},{"english":"Considered an attack against democracy, the assassination caused the government to _declarewar on the yakuza.","chinese":"這被看做是對民主的攻擊，政府正式對暴力團宣戰。"},{"english":"Nevertheless, you are OK also these message regard as bru it or it is gossip.","chinese":"不過，你也可以將這些消息看做謠傳或是道聽途說。"},{"english":"The moon is the 'yin' or female principle and it is a trusted friend.","chinese":"月亮代表“陰”或女性，並且被看做是可靠的朋友。"},{"english":"I could have him for my fellow worker but not for a friend.","chinese":"我可以把他看做我的同事，卻不能視作朋友。"},{"english":"The business world should start to see Twitter as one of the primary consumer communication channels available.","chinese":"企業應該開始將微薄看做一個基本的客戶交流平臺。"},{"english":"She is reckoned a very good teacher.","chinese":"她被看做是一位優秀教師。"},{"english":"Economic envy, once seen as a European vice, is now rife.","chinese":"曾經被看做歐式惡習的經濟嫉妒，如今卻很盛行。"},{"english":"Well, the people of Annam certainly don't view them as traditional.","chinese":"好吧，安南的人們當然不把他們看做傳統的自己人。"},{"english":"He called the prison break a disaster.","chinese":"他把這次越獄事件看做一場災難。"}],"related":[{"definition":["to look upon as\/to regard as"],"pinyin":["kan4 zuo4"],"word":"看作"},{"definition":["to regard as"],"pinyin":["kan4 cheng2"],"word":"看成"},{"definition":["to regard as\/to treat as"],"pinyin":["shi4 zuo4"],"word":"視作"},{"definition":["to treat as\/to regard as\/to look upon as"],"pinyin":["dang4 zuo4"],"word":"當做"},{"definition":["to treat as\/to regard as"],"pinyin":["dang4 zuo4"],"word":"當作"},{"definition":["to consider as\/to take to be"],"pinyin":["dang4 cheng2"],"word":"當成"},{"definition":["to view as\/to see as\/to consider to be\/to deem"],"pinyin":["shi4 wei2"],"word":"視為"},{"definition":["to be called\/to be known as"],"pinyin":["cheng1 zuo4"],"word":"稱作"},{"definition":["in fact\/in reality\/as a matter of fact\/in practice"],"pinyin":["shi2 ji4 shang4"],"word":"實際上"},{"definition":["to liken to\/to compare to"],"pinyin":["bi3 zuo4"],"word":"比作"},{"definition":["certainty\/without a doubt"],"pinyin":["hao2 wu2 yi2 wen4"],"word":"毫無疑問"},{"definition":["only\/merely\/nothing but\/no more than\/it's just that ..."],"pinyin":["zhi3 bu5 guo4"],"word":"只不過"},{"definition":["in fact\/in reality\/actually\/as a matter of fact\/de facto\/ipso facto"],"pinyin":["shi4 shi2 shang4"],"word":"事實上"},{"definition":["definition\/to define"],"pinyin":["ding4 yi4"],"word":"定義"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"認為"},{"definition":["to equate\/equal to"],"pinyin":["deng3 tong2"],"word":"等同"}]}