{"definition":["to observe and make sure\/to check"],"pinyin":["kan4 zhun3"],"simplified":["看准"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"看準","characters":[{"definition":["to look after\/to take care of\/to watch\/to guard","to see\/to look at\/to read\/to watch\/to visit\/to call on\/to consider\/to regard as\/to look after\/to treat (an illness)\/to depend on\/to feel (that)\/(after verb) to give it a try\/Watch out! (for a danger)"],"pinyin":["kan1","kan4"],"word":"看"},{"definition":["accurate\/standard\/definitely\/certainly\/about to become (bride, son-in-law etc)\/quasi-\/para-"],"pinyin":["zhun3"],"word":"準"}],"containing_words":[{"definition":["to watch for an opportunity\/to see one's chance to"],"pinyin":["kan4 zhun3 ji1 hui4"],"word":"看準機會"}],"sentences":[{"english":"Lin Lei saw the opportunity to ridicule Bai righteousness, want him to hold.","chinese":"林磊看準機會乘機奚落柏義，要他來執籌碼。"},{"english":"A miracle will soon appear, \"eyes opened wide points, sights poker.\"","chinese":"奇蹟即將出現，“眼睛睜大點，看準撲克牌。”"},{"english":"The Southwest Airlines was able to see the silver lines in the cloud and profit from the oil crisis.","chinese":"西南航空公司看準油價行情，變成危機中的贏家。"},{"english":"If they attack, concentrate your forces and attack his weakness.","chinese":"如果敵人進攻，就集中兵力看準敵人的破綻去打擊它。"},{"english":"This allows Mahone and Michael to sneak intoTuxhorn's house and find the device.","chinese":"馬宏和邁可看準機會，溜了進去，及時拿回了設備。"},{"english":"Chongqing Xidishan Days Hotel just gets hold of such an opportunity.","chinese":"而重慶喜地山戴斯大酒店，正是看準了這樣一個契機。"},{"english":"Once you have decide you are going to kiss someone, choose your moment and go for it.","chinese":"一旦你決定要吻這個人，看準時機就立刻行動。"},{"english":"She watched her moment to cross the road.","chinese":"她看準時機橫穿馬路。"},{"english":"ICI is also targeting the housing construction market.","chinese":"ICI同時還看準了民用住宅建設市場。"},{"english":"The fighter's well-aimed blow curled his opponent up.","chinese":"那位拳擊手看準目標，一拳把對手打垮了。"},{"english":"This allows Mahone and Michael to sneak into Tuxhorn's house and find the device.","chinese":"馬宏和邁可看準機會，溜了進去，及時拿回了設備。"},{"english":"They saw the great opportunity to corner the market and earned a lot of money.","chinese":"他們看準了壟斷市場的大好時機並賺了很多錢。"},{"english":"Qin saw the opportunity, first with Qi Lianheng, Wei introduction of large tracts of land.","chinese":"秦國看準時機，先與齊連橫，攻略魏國大片土地。"},{"english":"To see in order to focus one eye on the worm .","chinese":"向看去，以便使一隻眼睛能看準蟲子。"}],"related":[{"definition":["to take aim at\/to target"],"pinyin":["miao2 zhun3"],"word":"瞄準"},{"definition":["business opportunity\/commercial opportunity"],"pinyin":["shang1 ji1"],"word":"商機"},{"definition":["ambition\/ambitious"],"pinyin":["qi3 tu2 xin1"],"word":"企圖心"},{"definition":["rival\/competitor"],"pinyin":["jing4 zheng1 dui4 shou3"],"word":"競爭對手"},{"definition":["amusing speech or act\/jokes\/antics\/funny\/amusing\/Taiwan pr. [xue1 tou2]"],"pinyin":["xue2 tou2"],"word":"噱頭"},{"definition":["fortunate timing\/occasion\/opportunity"],"pinyin":["shi2 ji1"],"word":"時機"},{"definition":["to lock (a door)\/to close with a latch\/to lock into place\/a lock\/a latch\/to lock a computer file (to prevent it being overwritten)\/to lock (denying access to a computer system or device or files, e.g. by password-protection)\/to focus attention on\/to target"],"pinyin":["suo3 ding4"],"word":"鎖定"},{"definition":["key strength\/strong suit\/specialty"],"pinyin":["qiang2 xiang4"],"word":"強項"},{"definition":["marketplace\/market (also in abstract)"],"pinyin":["shi4 chang3"],"word":"市場"},{"definition":["potential\/capacity"],"pinyin":["qian2 li4"],"word":"潛力"},{"definition":["wind direction\/the way the wind blows\/fig. trend\/direction of events\/how things develop (esp. how they affect oneself)\/public opinion (concerning one's actions)\/publicity (usually derog.)\/limelight"],"pinyin":["feng1 tou2"],"word":"風頭"},{"definition":["to speculate (on financial markets)\/opportunistic\/congenial\/agreeable"],"pinyin":["tou2 ji1"],"word":"投機"},{"definition":["slot within a schedule\/timeslot (for a TV program, a session with a photographer etc)\/range of dates in which an event is to be held (film screening, exhibition etc)"],"pinyin":["dang4 qi1"],"word":"檔期"},{"definition":["trend\/tendency"],"pinyin":["dong4 xiang4"],"word":"動向"},{"definition":["to lose money\/to pay for damages"],"pinyin":["pei2 qian2"],"word":"賠錢"},{"definition":["selling point"],"pinyin":["mai4 dian3"],"word":"賣點"}]}