{"definition":["to stare blankly\/to look on helplessly\/to look on unfeelingly"],"pinyin":["yan3 zheng1 zheng1"],"simplified":["眼睁睁"],"rank":15634.0,"normalized_rank":0.2187399437549844,"fraction":0.000003839065608841954,"cumulative_fraction":0.9615659179032278,"word":"眼睜睜","characters":[{"definition":["eye\/small hole\/crux (of a matter)\/CL:隻|只[zhi1],雙|双[shuang1]\/classifier for big hollow things (wells, stoves, pots etc)"],"pinyin":["yan3"],"word":"眼"},{"definition":["to open (one's eyes)"],"pinyin":["zheng1"],"word":"睜"},{"definition":["to open (one's eyes)"],"pinyin":["zheng1"],"word":"睜"}],"containing_words":[],"sentences":[{"english":"Can you, of allthe people who love her, bear to see her so?","chinese":"在這麼多愛她的人中，你能眼睜睜看着她這樣麼？"},{"english":"I can't stand to see him cry like that.","chinese":"我不能眼睜睜看着他哭成那樣。"},{"english":"Sasuke is looking at the fleeing Danzo and reaches his arm out.","chinese":"佐助眼睜睜的看着團藏逃跑了。"},{"english":"I can't open my eyes to watch you jumping into the fiery pit, for I will shut my eyes at the time.","chinese":"我不會眼睜睜看着你往火坑裏跳，到時候我會閉上的。"},{"english":"Pandu watched him go, thinking that he ought to say something to him.","chinese":"潘杜眼睜睜地看着他離去，心想自己應該說些什麼。"},{"english":"You are about to see them die.","chinese":"你只能眼睜睜看他們死去。"},{"english":"You will eventually watch as she and another man left to go.","chinese":"你最後會眼睜睜的看着她和另一個人走了去的。"},{"english":"And let it see roll back down again.","chinese":"再眼睜睜的看着它滾下來。"},{"english":"How can people possibly be relaxed as we watch our savings disappear?","chinese":"眼睜睜看着自己的存款消失時我們怎麼可能會輕鬆？"},{"english":"Looking you go ahead to the far and disappear in the dark.","chinese":"眼睜睜看着你走遠，你的身影消失在暗夜裏。"},{"english":"I cannot die of thirst with water close by.","chinese":"我不能眼睜睜在水邊渴死。"},{"english":"Su destroys snow Cu eyebrow, helplessly canning be hugged by the other celebration oneself is in the breast.","chinese":"蘇殘雪蹙眉，眼睜睜的任由對方將自己抱在懷裏。"},{"english":"Helpless, we watched half a year's food destroyed before our eyes.","chinese":"我們毫無辦法，眼睜睜地看着半年的糧食給毀掉了。"}],"related":[]}