{"definition":["eyespot (in lower creatures)"],"pinyin":["yan3 dian3"],"simplified":["眼点"],"rank":63852.0,"normalized_rank":0.8933723224154576,"fraction":2.0728823014394365e-8,"cumulative_fraction":0.9999325352719316,"word":"眼點","characters":[{"definition":["eye\/small hole\/crux (of a matter)\/CL:隻|只[zhi1],雙|双[shuang1]\/classifier for big hollow things (wells, stoves, pots etc)"],"pinyin":["yan3"],"word":"眼"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[{"definition":["place of interest\/a place one has one's eye on"],"pinyin":["zhuo2 yan3 dian3"],"word":"著眼點"}],"sentences":[{"english":"The eyespots are great for confusing predators.","chinese":"這些眼點對迷惑捕食者非常有用。"},{"english":"Then, what should the innovation focus on in the economic downturn?","chinese":"那麼，經濟低迷期，企業創新的主要着眼點在哪裏？"},{"english":"Focused on the long-term development and comprehensive evaluation of many perspectives.","chinese":"着眼點在於企業的長遠發展和多視角的綜合評價。"},{"english":"We accepted self-determination with a view to ending war once and for all,\" he said.","chinese":"我們接受的是以永遠結束戰爭爲着眼點進行自主決定。"},{"english":"In this paper, this is the most in-depth and focus boils down to a point.","chinese":"這是本文最深入的一個着眼點和歸結點。"},{"english":"Our counterinsurgency campaign in Afghanistan is really focused on winning the people.","chinese":"而我們在阿富汗的平叛運動的真正着眼點是贏得民心。"},{"english":"Text has become the new emphasis of contrastive study.","chinese":"語篇開始成爲對比研究新的着眼點。"},{"english":"The subject build is a focal point of hospital technology build.","chinese":"學科建設是醫院技術建設的着眼點。"},{"english":"No, we have very different approaches.","chinese":"不，我們有非常不同的着眼點。"},{"english":"This article starts from cultural differences between China and Spain.","chinese":"本文以文化特性的差異比較爲入眼點。"}],"related":[]}