{"definition":["knowledge base"],"pinyin":["zhi1 shi5 ku4"],"simplified":["知识库"],"rank":40984.0,"normalized_rank":0.5734193331747653,"fraction":3.493244610806037e-7,"cumulative_fraction":0.9968498504010302,"word":"知識庫","characters":[{"definition":["to know\/to be aware"],"pinyin":["zhi1"],"word":"知"},{"definition":["to know\/knowledge\/Taiwan pr. [shi4]","to record\/to write a footnote"],"pinyin":["shi2","zhi4"],"word":"識"},{"definition":["warehouse\/storehouse\/(file) library"],"pinyin":["ku4"],"word":"庫"}],"containing_words":[],"sentences":[{"english":"It is arrange in pairs database of the field that make disambiguation do.","chinese":"並針對該領域建立了搭配知識庫，作爲消歧的依據。"},{"english":"Add this information to the knowledge base.","chinese":"將這些信息添加到知識庫中。"},{"english":"Both countries have a rich knowledge base to work from.","chinese":"這兩個國家都有可供使用的豐富的知識庫。"},{"english":"Now the decision plan can leverage the knowledge base.","chinese":"現在決策計劃就可以利用知識庫了。"},{"english":"With each iteration, you should have a better performing knowledge base.","chinese":"每次執行完迭代後，都應該有一個性能更好的知識庫。"},{"english":"Another peculiar resident of the depths is the Mon Calamari Knowledge Bank.","chinese":"另外一個海底深處的特殊棲息者是蒙克萊梅利知識庫。"},{"english":"Load all items in the knowledge base.","chinese":"裝載知識庫中的所有東西。"},{"english":"Get the most recent knowledge base from the database.","chinese":"從數據庫中獲取最新的知識庫。"},{"english":"A folder can be created in the root collection of the repository or in a subfolder of the repository.","chinese":"您可以在知識庫的根集下或者子文件夾中創建文件夾。"},{"english":"The realization of an intelligent automatic color harmony system with a knowledge base is presented.","chinese":"闡述了帶有知識庫的智能化自動色彩協調系統的實現。"},{"english":"The paper demonstrates an innovation and efficient implementation of ICAI domain knowledge base and its application.","chinese":"領域知識庫是教學內容的源泉和教學決策的依據。"},{"english":"The method commences with the extraction of the existing knowledge base from the rules engine.","chinese":"此方法首先從規則引擎中取得已有知識庫。"},{"english":"Using the corpus as input, you can create and test the KB.","chinese":"以文集作爲輸入，可以創建和測試知識庫。"},{"english":"A layered and blocked strategy is proposed for the organization and management of such an integrated kno…","chinese":"提出了知識庫組織的分層分塊管理策略。"},{"english":"The reasoner is used to identify the car emblem by the use of the knowledge base.","chinese":"推理機是利用知識庫中的知識進行車徽識別的過程。"},{"english":"Now you can add the new element to the knowledge base.","chinese":"現在，可以把新元素添加到知識庫中。"}],"related":[]}