{"definition":["short term\/short-term"],"pinyin":["duan3 qi1"],"simplified":["短期"],"rank":1548.0,"normalized_rank":0.0216585283953381,"fraction":0.00010344251996927553,"cumulative_fraction":0.6902650793318187,"word":"短期","characters":[{"definition":["short\/brief\/to lack\/weak point\/fault"],"pinyin":["duan3"],"word":"短"},{"definition":["a period of time\/phase\/stage\/classifier for issues of a periodical, courses of study\/time\/term\/period\/to hope\/Taiwan pr. [qi2]"],"pinyin":["qi1"],"word":"期"}],"containing_words":[{"definition":["short-term financing"],"pinyin":["duan3 qi1 rong2 zi1"],"word":"短期融資"}],"sentences":[{"english":"The BLOs provide short-term shelter and can provide medical care.","chinese":"這些邊境聯絡處提供短期的庇護和醫療。"},{"english":"In technical side, short and mid-term technical indicators keep on rise.","chinese":"技術面，短期及中期各項技術指標保持多頭強勢狀態。"},{"english":"We believe that the sea is the production of \"Tamiflu\" short-term performance thickening.","chinese":"我們認爲，海正生產“達菲”短期增厚業績。"},{"english":"The previously known most distant object was a short-lived gamma ray burst.","chinese":"之前所知最遙遠的天體是一次短期的伽瑪射線暴。"},{"english":"Decreased overall still in channels, short-short pattern is unchanged.","chinese":"總體仍處於下跌通道中，短期空頭格局不變。"},{"english":"Disaster situation, the sea shortly world Street bars unable to operate normally.","chinese":"受災情影響，短期內海上世界酒吧街無法正常開業。"},{"english":"Some cadres are eager to be in short-term gain perhaps gives inside lieutenancy .","chinese":"有的幹部急於在短期或者是任期內出成果。"},{"english":"Think short term and long term.","chinese":"同時制定好短期計劃和長期計劃。"},{"english":"The so-called \"green barriers\" cannot be completely eliminated in a short term.","chinese":"所謂的“綠色壁壘”短期內沒可能完全消除。"},{"english":"So there is the short-term issue of how to tighten policy safely.","chinese":"所以短期問題是如何安全縮緊政策。"},{"english":"In other words, long-dated bonds offer a lot more income than short ones.","chinese":"換句話說，長期債券的收益要高於短期債券。"},{"english":"In the short-run, there are definitely some headwinds.","chinese":"短期而言，金價上漲無疑存在一些阻力。"},{"english":"Therefore, the accurate assessment of the credit risk of STCP is on imminent.","chinese":"所以，對短期融資券信用風險的準確評估就迫在眉睫。"},{"english":"A business overdraft would be most suitable for short-term loans.","chinese":"商業透支項目最適合短期貸款。"},{"english":"Some of the effects of short-term sleep deprivation can be very similar to the effects of being drunk.","chinese":"短期睡眠剝奪的某些影響與醉酒的後果類似。"},{"english":"Set specific short- and long-term goals.","chinese":"制定詳細的短期和長期目標。"}],"related":[{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"word":"反彈"},{"definition":["short term"],"pinyin":["duan3 xian4"],"word":"短線"},{"definition":["specific to a particular stage (of a project etc)\/interim (policy etc)\/occurring in stages\/phased"],"pinyin":["jie1 duan4 xing4"],"word":"階段性"},{"definition":["to vibrate\/to shake\/to shudder"],"pinyin":["zhen4 dang4"],"word":"震蕩"},{"definition":["to fall back\/to return to low level after a rise (in water level, price etc)"],"pinyin":["hui2 luo4"],"word":"回落"},{"definition":["tendency\/trend\/path"],"pinyin":["zou3 shi4"],"word":"走勢"},{"definition":["bull market (prices appear to be rising)"],"pinyin":["kan4 zhang3"],"word":"看漲"},{"definition":["phony\/so-called\/armchair (expert)\/vain (promise)\/(finance) short-seller\/bear (market)\/short (selling)"],"pinyin":["kong1 tou2"],"word":"空頭"},{"definition":["many-headed\/many-layered (authority)\/devolved (as opposed to centralized)\/pluralistic\/(as classifier) number of animals\/long term (finance)\/long (investment)"],"pinyin":["duo1 tou2"],"word":"多頭"},{"definition":["stock market index\/share price index\/abbr. for 股票指數|股票指数[gu3 piao4 zhi3 shu4]"],"pinyin":["gu3 zhi3"],"word":"股指"},{"definition":["to fall\/to tumble"],"pinyin":["xia4 die1"],"word":"下跌"},{"definition":["(finance) profit-taking"],"pinyin":["huo4 li4 hui2 tu3"],"word":"獲利回吐"},{"definition":["market price\/quotation of market price\/the current market situation"],"pinyin":["hang2 qing2"],"word":"行情"},{"definition":["Shanghai Stock Exchange (SSE), abbr. for 上海證券交易所|上海证券交易所[Shang4 hai3 Zheng4 quan4 Jiao1 yi4 suo3]"],"pinyin":["Shang4 Zheng4"],"word":"上證"},{"definition":["large fall"],"pinyin":["da4 die1"],"word":"大跌"},{"definition":["(of trains) up (i.e. towards the capital)\/(of river boats) to go against the current\/to submit (a document) to higher authorities"],"pinyin":["shang4 xing2"],"word":"上行"}]}