{"definition":["orthopedic (e.g. surgery)"],"pinyin":["jiao3 xing2"],"simplified":["矫形"],"rank":40514.0,"normalized_rank":0.566843423390651,"fraction":3.662578657965878e-7,"cumulative_fraction":0.9966818816826118,"word":"矯形","characters":[{"definition":["argumentative\/contentious","surname Jiao","to correct\/to rectify\/to redress\/strong\/brave\/to pretend\/to feign\/affectation"],"pinyin":["Jiao3","jiao2","jiao3"],"word":"矯"},{"definition":["to appear\/to look\/form\/shape"],"pinyin":["xing2"],"word":"形"}],"containing_words":[{"definition":["orthopedic surgery"],"pinyin":["jiao3 xing2 wai4 ke1"],"word":"矯形外科"},{"definition":["orthodontic brace"],"pinyin":["jiao3 xing2 ya2 tao4"],"word":"矯形牙套"},{"definition":["orthopedic doctor"],"pinyin":["jiao3 xing2 yi1 sheng1"],"word":"矯形醫生"}],"sentences":[{"english":"People interested in the above article What Are Orthotics?","chinese":"“感興趣的人以上文章”什麼是矯形？"},{"english":"Lower limb exoskeleton orthosis was used as rehabilitation device in gait training.","chinese":"設計用於步態康復訓練的下肢外骨骼矯形器。"},{"english":"Objective In order to explore the value of knee orthosis (KO) in treatment of joint contracture.","chinese":"目的探討矯形器對膝關節攣縮的治療價值。"},{"english":"Orthotics are orthopedic devices that are used to treat a variety of biomechanical foot disorders.","chinese":"骨科矯形是設備，用於治療各種腳病的生物力學。"},{"english":"Dai said.At his first opportunity, he switched to orthopedics.","chinese":"於是一有機會，他就跳到矯形外科去了。"},{"english":"The forces which act upon the load-bearing members will vary depending upon the particular orthopaedic instrument.","chinese":"作用在承載構件上的力將取決於特定矯形器材來改變。"},{"english":"Does the belt after tooth orthopaedic maintain implement does time need time for ages after all?","chinese":"牙矯形後帶保持器的時間究竟需要好久時間？"},{"english":"The application of orthosis and self-help aids to hemiplegic upper extremity was summarized.","chinese":"對中風後偏癱上肢應用矯形器和自助具進行了綜述。"},{"english":"Anti-spasticity orthotic devices were used and conventional rehabilitation treatments were conducted after injection.","chinese":"注射後佩戴抗痙攣矯形器及常規康復訓練。"},{"english":"But in shoe orthotic inserts it can work only in foot-flat stages.","chinese":"但是鞋中的矯形嵌入物可能僅在“扁平足”時期有效。"},{"english":"Removable insoles supply fitting flexibility and allows for a custom orthotic.","chinese":"可拆卸鞋墊供應配件的靈活性，並允許自定義的矯形。"},{"english":"I highly recommend custom-made orthotics.","chinese":"我強烈建議訂造內裏鞋矯形。"},{"english":"I need a management software for orthopedic and orthotic practitioners.","chinese":"我需要和矯形骨科醫生管理軟件。"},{"english":"Objective To observe the effects of wrist hand orthoses on cerebral palsy children with adduction of thumb.","chinese":"目的觀察腕手矯形器治療腦癱患兒拇指內收的效果。"},{"english":"Conclusion Function of knee joint contracture was improved using knee orthosis.","chinese":"結論矯形器治療能明顯改善攣縮兔膝關節功能。"},{"english":"There are really so many different types of orthotics and other devices.","chinese":"事實上有這麼多不同類型的矯形器和其他設施。"}],"related":[]}