{"definition":["Shijiazhuang prefecture level city and capital of Hebei Province 河北省[He2 bei3 Sheng3] in north China"],"pinyin":["Shi2 jia1 zhuang1"],"simplified":["石家庄"],"rank":7412.0,"normalized_rank":0.10370349642522353,"fraction":0.000013528038636548974,"cumulative_fraction":0.90232466470202,"word":"石家莊","characters":[{"definition":["dry measure for grain equal to ten dou 斗\/ten pecks\/one hundred liters","rock\/stone\/stone inscription\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Shi"],"pinyin":["Shi2","dan4","shi2"],"word":"石"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"},{"definition":["farmstead\/village\/manor\/place of business\/banker (in a gambling game)\/grave or solemn\/holdings of a landlord (in imperial China)","surname Zhuang"],"pinyin":["Zhuang1","zhuang1"],"word":"莊"}],"containing_words":[{"definition":["Shijiazhuang prefecture level city and capital of Hebei Province 河北省[He2 bei3 Sheng3] in north China"],"pinyin":["Shi2 jia1 zhuang1 Shi4"],"word":"石家莊市"},{"definition":["Shijiazhuang prefecture in Hebei"],"pinyin":["Shi2 jia1 zhuang1 di4 qu1"],"word":"石家莊地區"}],"sentences":[{"english":"Ths study was conducted in Shijiazhuang City.","chinese":"該項研究在石家莊進行。"},{"english":"There is no wholesale market for Chinese herbal medicine in Shijiazhuang, where the specific location?","chinese":"石家莊有沒有中草藥材批發市場，具體地點在哪裏？"},{"english":"Chrysanthemum and all those heading for Shijiazhuang will borad the train at 6pm the same day.","chinese":"菊鳳將於七日上午六時乘車出發去石家莊。"},{"english":"Hebei province is briefly named as Ji, with Shijiazhuang as its provincial seat.","chinese":"河北省簡稱冀，省會城市是石家莊。"},{"english":"Miao Qing comes from Shijiazhuang, is currently studying dance at Tianjing College of Music.","chinese":"苗青，石家莊人氏，就讀於天津音樂學院舞蹈系。"},{"english":"Part of Xinji City, Hebei Province in Shijiazhuang, the provincial capital.","chinese":"辛集市隸屬於河北省省會石家莊市。"},{"english":"Journal of Shijiazhuang Railway Institute(2010 …","chinese":"石家莊鐵道學院學報。"},{"english":"The mayor of Shijiazhuang has been dismissed.","chinese":"石家莊市市長被罷免。"},{"english":"U can't find bus such like this in Shijiazhuang.","chinese":"石家莊就沒有這種扁扁車。"},{"english":"Shijiazhuang Zhengyuan Tower Equipment Co. , Ltd.","chinese":"石家莊正元塔器設備有限公司。"},{"english":"The second part is the research and reform of innovative education in No. 27 middle school.","chinese":"第二部分，石家莊市第二十七中學創新教育的沿革。"},{"english":"To establish the evaluation agency of Wushu Ranks System in Shijiazhuang colleges.","chinese":"建立石家莊普通高校武術段位制考評機構。"},{"english":"\"a city not far from Beijing\" is in apposition to \"Shijiazhuang\".","chinese":"我住在離北京不遠的石家莊。"},{"english":"Shijiazhuang is most should the high-sounding talk rescue the city the city.","chinese":"石家莊纔是最應該高調救市的城市。"},{"english":"OBJECTIVE To identify the urban residents demands for health services in the District of Changan.","chinese":"目的瞭解石家莊市長安區居民衛生服務需求情況。"},{"english":"The victim, Shi Jingsun, was a teacher at the Oriental Academy of Fines Arts, the Yanzhao Metropolis Daily reported.","chinese":"受害人石景蓀是石家莊東方美院的一名老師。"}],"related":[{"definition":["Zhengzhou prefecture level city and capital of Henan Province in central China"],"pinyin":["Zheng4 zhou1"],"word":"鄭州"},{"definition":["Shenyang subprovincial city and capital of Liaoning province 遼寧省|辽宁省 in northeast China\/old names include Fengtian 奉天, Shengjing 盛京 and Mukden"],"pinyin":["Shen3 yang2"],"word":"瀋陽"},{"definition":["Jinan, subprovincial city and capital of Shandong province in northeast China"],"pinyin":["Ji3 nan2"],"word":"濟南"},{"definition":["North China"],"pinyin":["Hua2 bei3"],"word":"華北"},{"definition":["Qingdao, subprovincial city in Shandong"],"pinyin":["Qing1 dao3"],"word":"青島"},{"definition":["Changchun subprovincial city and capital of Jilin province 吉林省 in northeast China"],"pinyin":["Chang2 chun1"],"word":"長春"},{"definition":["Chongqing city (Chungking), formerly in Sichuan province, a municipality since 1997, short name 渝[Yu2]"],"pinyin":["Chong2 qing4"],"word":"重慶"},{"definition":["Wuhan city on Changjiang, subprovincial city and capital of Hubei province"],"pinyin":["Wu3 han4"],"word":"武漢"},{"definition":["Ürümqi or Urumqi prefecture level city and capital of Xinjiang Uighur autonomous region 新疆維吾爾自治區|新疆维吾尔自治区 in west China"],"pinyin":["Wu1 lu3 mu4 qi2"],"word":"烏魯木齊"},{"definition":["East China"],"pinyin":["Hua2 dong1"],"word":"華東"},{"definition":["Changsha prefecture-level city and capital of Hunan province in south central China"],"pinyin":["Chang2 sha1"],"word":"長沙"},{"definition":["Shandong, province in northeast China, short name 魯|鲁[Lu3], capital Jinan 濟南|济南[Ji3 nan2]"],"pinyin":["Shan1 dong1"],"word":"山東"},{"definition":["Guiyang prefecture-level city and capital of Guizhou province 貴州|贵州[Gui4 zhou1], short name 筑[Zhu4]"],"pinyin":["Gui4 yang2"],"word":"貴陽"},{"definition":["Harbin, subprovincial city and capital of Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Ha1 er3 bin1"],"word":"哈爾濱"},{"definition":["Dalian subprovincial city in Liaoning province 遼寧省|辽宁省 in northeast China"],"pinyin":["Da4 lian2"],"word":"大連"},{"definition":["Heilongjiang province (Heilungkiang) in northeast China, abbr. 黑, capital Harbin 哈尔滨\/Heilongjiang river forming the border between northeast China and Russia\/Amur river"],"pinyin":["Hei1 long2 jiang1"],"word":"黑龍江"}]}