{"definition":["quartz clock"],"pinyin":["shi2 ying1 zhong1"],"simplified":["石英钟"],"rank":51045.0,"normalized_rank":0.71418577644705,"fraction":1.2875226689222414e-7,"cumulative_fraction":0.9991022929203176,"word":"石英鐘","characters":[{"definition":["dry measure for grain equal to ten dou 斗\/ten pecks\/one hundred liters","rock\/stone\/stone inscription\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Shi"],"pinyin":["Shi2","dan4","shi2"],"word":"石"},{"definition":["United Kingdom\/British\/England\/English\/abbr. for 英國|英国[Ying1 guo2]","hero\/outstanding\/excellent\/(literary) flower\/blossom"],"pinyin":["Ying1","ying1"],"word":"英"},{"definition":["clock\/o'clock\/time as measured in hours and minutes\/bell\/CL:架[jia4],座[zuo4]"],"pinyin":["zhong1"],"word":"鐘"}],"containing_words":[],"sentences":[{"english":"Your quartz clocks are quite salable on our market.","chinese":"你們的石英鐘在市場上賣得不錯。"},{"english":"Our company is the one producing \"Guiguan\" brand series quartz clock.","chinese":"本公司是以生產“桂冠”牌系列石英鐘的企業。"},{"english":"The time on the quartz watch at my home is several minutes earlier than that on the television.","chinese":"我家石英鐘的時間比電視上顯示的時間快幾分鐘。"},{"english":"211Please send us your price list of quartz clocks。","chinese":"請寄給我們貴方的石英鐘價目單。"},{"english":"The clock is now controlled by a high grade quartz clock in the main entrance of the Observatory.","chinese":"此鍾現由位於天文館主入口處的高頻石英鐘控制。"},{"english":"I saw a beautiful clock last time I was shopping and I wanted to get it for her.","chinese":"我上次逛街時看見一個石英鐘挺漂亮的，想送給她。"},{"english":"The time base was given both by a crystal clock and the broadcast standard signals.","chinese":"時間標準是由石英鐘和廣播標準信號提供的。"},{"english":"There is a gold quartz clock near the wood shutter.","chinese":"木製的百葉窗旁掛着一個金黃色的石英鐘。"},{"english":"Quartz-crystal technology did not remain the premier frequency standard for long either, however.","chinese":"不過石英鐘技術稱霸計時標準的壽命也不長。"},{"english":"It analyses it's characteristics and also directs and summarizes such designing of quartz crystal clock movement.","chinese":"該方法對此類型石英鐘機心的設計具有一定參考價值。"},{"english":"Please send us your price list of quartz clocks.","chinese":"請寄給我們貴方的石英鐘價目單。"},{"english":"Hearing the striking of the clock on the wall, I knew it was already one past midnight.","chinese":"聽到牆上的石英鐘的報時，我知道已經一點了。"},{"english":"I saw a beautiful clock last time I was shopping.","chinese":"我上次逛街時看見一個石英鐘挺漂亮的。"},{"english":"This kind of set fit onvariouis second juniper quartz movement.","chinese":"這種報時裝置適合於各種秒跳式石英鐘機心。"}],"related":[]}