{"definition":["naphtha"],"pinyin":["shi2 nao3 you2"],"simplified":["石脑油"],"rank":30252.0,"normalized_rank":0.4232647293383515,"fraction":9.222866465136877e-7,"cumulative_fraction":0.9904766930396232,"word":"石腦油","characters":[{"definition":["dry measure for grain equal to ten dou 斗\/ten pecks\/one hundred liters","rock\/stone\/stone inscription\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Shi"],"pinyin":["Shi2","dan4","shi2"],"word":"石"},{"definition":["brain\/mind\/head\/essence"],"pinyin":["nao3"],"word":"腦"},{"definition":["oil\/fat\/grease\/petroleum\/to apply tung oil, paint or varnish\/oily\/greasy\/glib\/cunning"],"pinyin":["you2"],"word":"油"}],"containing_words":[],"sentences":[{"english":"Optionally the olefinic naphtha has a low content of acids.","chinese":"任選地，所述烯烴石腦油含低含量的酸。"},{"english":"The aromatic hydrocarbons content in naphtha was analyzed by a chemical reaction method.","chinese":"用化學分析方法測定了工業用石腦油中芳香烴的含量。"},{"english":"Molecular modeling and optimization for naphtha catalytic reforming process is studied in this paper.","chinese":"採用分子模擬方法對石腦油催化重整過程進行研究。"},{"english":"Naphtha is a mixture of molecules in the range of 5 to 9 carbons.","chinese":"石腦油由5到9個碳組成。"},{"english":"Naphtha is one of the chief raw materials for ethylene cracker.","chinese":"石腦油是乙烯裂解裝置的主要原料之一。"},{"english":"The impact of catalysts on naphtha catalytic cracking was investigated.","chinese":"考察了催化劑對石腦油催化裂解的影響。"},{"english":"By means of coprecipitation, a hydrocracking catalyst for naphtha production was prepared.","chinese":"採用共沉澱方法合成了石腦油型加氫裂化催化劑。"},{"english":"Light petroleum distillate, generally known AS naphtha, wAS the logical choice.","chinese":"輕石油餾分，如石腦油是合乎邏輯的選擇。"},{"english":"The hydrocarbon molecules in naphtha feedstock are rearranged.","chinese":"石腦油原料的烴類分子得到重新排列。"},{"english":"All of those significantly increase competition of naphtha cracking plant.","chinese":"極大增加使用石腦油裂解的乙烯廠的競爭力。"}],"related":[]}