{"definition":["brickwork"],"pinyin":["qi4 ti3"],"simplified":["砌体"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"砌體","characters":[{"definition":["to build by laying bricks or stones"],"pinyin":["qi4"],"word":"砌"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[],"sentences":[{"english":"In this paper, a method for calculating seismic vulnerability matrix of brick masonry structure is put forward.","chinese":"本文提出一種計算磚砌體結構地震易損性矩陣的方法。"},{"english":"Some specific works are made in load-bearing masonry.","chinese":"一些具體的部位建立在承重砌體基礎上。"},{"english":"Masonry culvert replaces concrete gutter.","chinese":"砌體暗渠取代混凝土排水溝。"},{"english":"Masonry structure is a type of traditional structure with wide and many uses.","chinese":"砌體結構在我國是一種應用量大面廣的傳統結構形式。"},{"english":"The special-shaped block and ordinary concrete block compression test and shear test were conducted.","chinese":"並設計了混凝土異型砌塊砌體的抗震性能試驗方案。"},{"english":"Laying should avoid shocked the lower masonry.","chinese":"砌築時應避免震驚下層砌體。"},{"english":"The earthquake -resistant character of high-rise masonry structure with constructing measure has also been analyzed.","chinese":"還分析了具有構造措施的砌體結構的抗震特性。"},{"english":"In principle , each wedge-shaped masonry block cannot fall inward without pushing the others out ;","chinese":"砌體塊原則，每個楔形砌塊無法向內傾圮的。"},{"english":"The results show that the reinforced masonry has good seismic properties.","chinese":"試驗表明組合配筋磚砌體牆片具有較好的抗震性能。"},{"english":"After the completion of the building should be well maintenance, keep wet surface masonry.","chinese":"砌築完畢後應做好養護，保持砌體表面潮溼。"},{"english":"Through experiments, the shear strength of concrete hollow brick masonry has been researched in this paper.","chinese":"通過試驗研究了混凝土空心磚砌體的抗剪強度。"},{"english":"The flexural tensile strength of perforated concrete brick masonry is studied by experiment.","chinese":"通過試驗研究了混凝土多孔磚砌體的彎曲抗拉強度。"},{"english":"It can be reference for the design of multi-story masonry buildings.","chinese":"希望有益於多層砌體房屋設計的改進。"},{"english":"Masonry structures serve outdoor kitchen facilities and pool environments.","chinese":"砌體結構爲戶外廚房設施和游泳池環境。"},{"english":"The results show that the aseismic behavior of reinforced masonry is good.","chinese":"試驗表明配筋砌體房屋有良好的抗震性能。"},{"english":"This is a dry-masonry structure with a friction-resistant stress-transfer mechanism.","chinese":"這是一種具有抗摩擦應力轉移機制的無漿砌體。"}],"related":[]}