{"definition":["research and development\/to develop"],"pinyin":["yan2 fa1"],"simplified":["研发"],"rank":1562.0,"normalized_rank":0.021854406559120226,"fraction":0.0001024060788185558,"cumulative_fraction":0.6917078070193745,"word":"研發","characters":[{"definition":["to grind\/study\/research"],"pinyin":["yan2"],"word":"研"},{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"}],"containing_words":[],"sentences":[{"english":"Besides, Russia is also working on the localization of strategic missile research, development and manufacturing.","chinese":"此外，戰略導彈研發生產本土化也是俄努力的方向。"},{"english":"Self-developed products of Contec have been exported to more than 150 countries and regions.","chinese":"公司自主研發的產品已出口到150多個國家和地區。"},{"english":"Other companies are busy with further research and development of drugs targeting CCR5.","chinese":"其他公司則忙於研發更進一步的靶向CCR5的藥品。"},{"english":"The development of new, alternative insecticides is an expensive and long-term endeavour.","chinese":"新的替代殺蟲劑的研發是一項昂貴的長期努力。"},{"english":"Is a research and development, production and sales of electronic and electrical appliances factory.","chinese":"是一家集研發，生產，銷售爲一體的電子電器廠。"},{"english":"Skeletal Mastery research time reduced to 30 seconds from 45 seconds.","chinese":"精通招喚骷髏的研發時間從45秒縮減爲30秒。"},{"english":"This study provides the experimental foundation for the further research of Aster ageratoides var.","chinese":"本研究爲長毛三脈紫菀的進一步研發奠定了實驗基礎。"},{"english":"Such realism is useful in the development of automated CCTV systems.","chinese":"這麼寫實的程度，對研發自動閉路電視系統很有益處。"},{"english":"CONCLUSION The leases of Eriobotrya japonica(Thumb. )Lindl. are valuable for intensive research and development.","chinese":"結論枇杷葉具有深入研發的重要價值。"},{"english":"According to the market demand and development of production of special boneless wiper.","chinese":"並且根據市場需求研發生產多種車型的專用無骨雨刮。"},{"english":"The Pfizer and Merck drugs were in late-stage development.","chinese":"輝瑞和默克的藥物均已到了研發的後期。"},{"english":"Polyamine analogue is a new type of antitumor agents.","chinese":"多胺類似物是一類研發中的新型抗腫瘤藥物。"},{"english":"Moreover, new drugs are being developed that will prevent osteolysis and loss of bone.","chinese":"此外，正在研發預防骨溶解和骨丟失的各種新藥。"},{"english":"Anti-AIDS vaccine research and development of the industry once again become the focus of attention.","chinese":"抗艾疫苗研發再次成爲了業界關注的焦點。"},{"english":"Chapter iii indicates the establishment of R&D competency model approach and the steps.","chinese":"第三章爲建立研發人員勝任特徵模型的方法和步驟等。"},{"english":"America has long suspected China of developing anti-satellite technology.","chinese":"長期以來，美國一直都懷疑中國在研發反衛星技術。"}],"related":[{"definition":["to exploit (a resource)\/to open up (for development)\/to develop"],"pinyin":["kai1 fa1"],"word":"開發"},{"definition":["to put to use\/to apply\/practical\/applied (science, linguistics etc)\/application\/practical use\/(computing) app"],"pinyin":["ying4 yong4"],"word":"應用"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["team"],"pinyin":["tuan2 dui4"],"word":"團隊"},{"definition":["industry\/estate\/property\/industrial"],"pinyin":["chan3 ye4"],"word":"產業"},{"definition":["to recommend\/to introduce (from outside)"],"pinyin":["yin3 jin4"],"word":"引進"},{"definition":["technology\/technique\/skill\/CL:門|门[men2],種|种[zhong3],項|项[xiang4]"],"pinyin":["ji4 shu4"],"word":"技術"},{"definition":["goods\/merchandise\/product\/CL:個|个[ge4]"],"pinyin":["chan3 pin3"],"word":"產品"},{"definition":["laboratory\/CL:間|间[jian1]"],"pinyin":["shi2 yan4 shi4"],"word":"實驗室"},{"definition":["to be in operation\/to do business\/(of train, bus etc) to be in service\/operation\/service"],"pinyin":["yun4 ying2"],"word":"運營"},{"definition":["investment\/to invest"],"pinyin":["tou2 zi1"],"word":"投資"},{"definition":["equipment\/facilities\/installations\/CL:個|个[ge4]"],"pinyin":["she4 bei4"],"word":"設備"},{"definition":["patent\/sth uniquely enjoyed (or possessed etc) by a certain group of people\/monopoly"],"pinyin":["zhuan1 li4"],"word":"專利"},{"definition":["transformation\/to transform"],"pinyin":["zhuan3 xing2"],"word":"轉型"},{"definition":["to produce\/to manufacture\/to give birth to a child"],"pinyin":["sheng1 chan3"],"word":"生產"}]}