{"definition":["researcher"],"pinyin":["yan2 jiu1 yuan2"],"simplified":["研究员"],"rank":4579.0,"normalized_rank":0.06406615085416871,"fraction":0.00002731577147128533,"cumulative_fraction":0.8481618293513778,"word":"研究員","characters":[{"definition":["to grind\/study\/research"],"pinyin":["yan2"],"word":"研"},{"definition":["after all\/to investigate\/to study carefully\/Taiwan pr. [jiu4]"],"pinyin":["jiu1"],"word":"究"},{"definition":["person\/employee\/member"],"pinyin":["yuan2"],"word":"員"}],"containing_words":[],"sentences":[{"english":"Finding should change standard of care, which is 4 doses every 3 weeks, researchers say.","chinese":"研究員說該發現將改變每3周4次給藥的治療標準。"},{"english":"Are you aware that many researchers are convinced that prolonged close work causes myopia?","chinese":"你認爲，許多研究員確信長期近距離工作引起近視嗎？"},{"english":"Xiaobing Sun, male, born in 1966, Ph. D, associate professor.","chinese":"孫曉兵，男，1966年生，博士，副研究員。"},{"english":"By manipulating the energy states, they were able to control the current passing through the molecule.","chinese":"採用這一方法，研究員可以控制穿越分子的電流。"},{"english":"He is now a researcher at Instiute For Arts & Literature Trend of People's University of China.","chinese":"現任中國人民大學文藝思潮研究所研究員。"},{"english":"A researcher named Dr. Charles Czeisler, tells about an interesting experiment.","chinese":"一個叫C博士的研究員做了一個有趣的實驗。"},{"english":"Xian-Chun Zhang. Pteridologist, Research professor at the Institute of Botany, Chinese Academy of Sciences.","chinese":"張憲春，中國科學院植物研究所研究員，博士生導師。"},{"english":"A good example a university job like a teaching or research asistanshipresearch assistantship.","chinese":"在大學任助教或助理研究員就是個不錯的例子。"},{"english":"Barry E. DiGregorio is a research associate for the Cardiff Center for Astrobiology in Wales, U. K.","chinese":"英國威爾斯卡地夫天文生物學中心的副研究員。"},{"english":"The researchers said there are close ties between duck grazing patterns and rice cropping intensity.","chinese":"研究員指出，放養鴨子和水稻栽種密度也有密切關聯。"},{"english":"I also think it makes Aunts \"Associate Research Assistants \".","chinese":"偶想，小姨子也因此成了“研究員助理”。"},{"english":"Headquarters Economy was first used by the researcher named Zhao Hong from Beijing Academy of Social Sciences.","chinese":"總部經濟最早是由北京社科院的趙弘研究員命名的。"},{"english":"Hong Hyun-ik is a North Korea researcher at the Sejong Institute in Seoul.","chinese":"韓信一是首爾世宗研究所的北韓問題研究員。"},{"english":"Comrade Huang Xiaohui is researcher of institute of technology of economy of state committee of planning.","chinese":"黃小蕙同志是國家計委經濟技術研究所研究員。"},{"english":"I aspired to become a leading researcher at Umbrella Inc.","chinese":"我原本渴望成爲安布雷拉公司的主要研究員。"},{"english":"Researchers believe that some hummingbirds fly non-stop over the Gulf of Mexico.","chinese":"研究員相信，一些蜂鳥會馬不停蹄地飛越墨西哥灣。"}],"related":[{"definition":["deputy chair of board\/vice-president (of a university etc)"],"pinyin":["fu4 yuan4 zhang3"],"word":"副院長"},{"definition":["the head of an institution whose name ends in 院[yuan4]\/chair of a board\/president of a university\/department head\/dean\/premier of the Republic of China\/CL:個|个[ge4]"],"pinyin":["yuan4 zhang3"],"word":"院長"},{"definition":["adviser\/consultant"],"pinyin":["gu4 wen4"],"word":"顧問"},{"definition":["routine\/everyday business\/daily operation (of a company)"],"pinyin":["chang2 wu4"],"word":"常務"},{"definition":["vice-secretary"],"pinyin":["fu4 mi4 shu1 zhang3"],"word":"副秘書長"},{"definition":["Chinese Academy of Science"],"pinyin":["Zhong1 guo2 Ke1 xue2 yuan4"],"word":"中國科學院"},{"definition":["to give a lecture\/to lecture on"],"pinyin":["zhu3 jiang3"],"word":"主講"},{"definition":["head\/director (of an organizational unit)\/(police) commissioner\/inspector-general\/rank of local governor in Tang dynasty administration"],"pinyin":["zong3 jian1"],"word":"總監"},{"definition":["Peking University"],"pinyin":["Bei3 jing1 Da4 xue2"],"word":"北京大學"},{"definition":["editor in chief"],"pinyin":["zhu3 bian1"],"word":"主編"},{"definition":["surname Tan","variant of 談|谈[tan2]"],"pinyin":["Tan2","tan2"],"word":"譚"},{"definition":["Tsinghua or Qinghua University, Beijing\/National Tsing Hua University, Hsinchu, Taiwan"],"pinyin":["Qing1 hua2 Da4 xue2"],"word":"清華大學"},{"definition":["secretary-general"],"pinyin":["mi4 shu1 zhang3"],"word":"秘書長"},{"definition":["vice-principal"],"pinyin":["fu4 xiao4 zhang3"],"word":"副校長"},{"definition":["chief editor (of newspaper)"],"pinyin":["zong3 bian1 ji2"],"word":"總編輯"},{"definition":["an association\/a society\/CL:個|个[ge4],家[jia1]"],"pinyin":["xie2 hui4"],"word":"協會"}]}