{"definition":["dash\/Chinese dash ── (punct., double the length of the western dash)"],"pinyin":["po4 zhe2 hao4"],"simplified":["破折号"],"rank":60881.0,"normalized_rank":0.8518041778014075,"fraction":3.605647383489725e-8,"cumulative_fraction":0.9998491392755409,"word":"破折號","characters":[{"definition":["broken\/damaged\/worn out\/lousy\/rotten\/to break, split or cleave\/to get rid of\/to destroy\/to break with\/to defeat\/to capture (a city etc)\/to expose the truth of"],"pinyin":["po4"],"word":"破"},{"definition":["to break (e.g. stick or bone)\/a loss","to break\/to fracture\/to snap\/to suffer loss\/to bend\/to twist\/to turn\/to change direction\/convinced\/to convert into (currency)\/discount\/rebate\/tenth (in price)\/classifier for theatrical scenes\/to fold\/accounts book","to turn sth over\/to turn upside down\/to tip sth out (of a container)"],"pinyin":["she2","zhe1","zhe2"],"word":"折"},{"definition":["ordinal number\/day of a month\/mark\/sign\/business establishment\/size\/ship suffix\/horn (wind instrument)\/bugle call\/assumed name\/to take a pulse\/classifier used to indicate number of people","roar\/cry\/CL:個|个[ge4]"],"pinyin":["hao2","hao4"],"word":"號"}],"containing_words":[],"sentences":[{"english":"Follow this up with a succinct description of the location followed by a dash and a time reference.","chinese":"接着，簡要地說明地點，然後用一個破折號提及時間。"},{"english":"Copy the activation code to the keygen with the numbers seperated by dashes .","chinese":"複製激活碼的凱基與分隔的數字破折號。"},{"english":"Here, too, the lon must be followed by a sh.","chinese":"這裏也一樣，應當在冒號之後加破折號。"},{"english":"Underscores are just bad. Stick to dashes.","chinese":"下劃線只有一個糟字可言，堅持使用破折號。"},{"english":"Don't try to drive one with your in-dash receiver's built-in amplifier.","chinese":"不要設法駕駛一與您的在破折號接收器的固定放大器。"},{"english":"The dash is longer than the hyphen.","chinese":"破折號比連字號長。"},{"english":"I even started using dashes in my writing.","chinese":"我甚至開始在作文時運用破折號。"},{"english":"Typing square bracket caret zero dash nine will exclude all numbers from matching.","chinese":"輸入方括號插入零九個破折號將排除所有號碼匹配。"}],"related":[]}