{"definition":["to split\/to cut open"],"pinyin":["po4 kai1"],"simplified":["破开"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"破開","characters":[{"definition":["broken\/damaged\/worn out\/lousy\/rotten\/to break, split or cleave\/to get rid of\/to destroy\/to break with\/to defeat\/to capture (a city etc)\/to expose the truth of"],"pinyin":["po4"],"word":"破"},{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"}],"containing_words":[],"sentences":[{"english":"It was filled with eggs, some already broken open.","chinese":"它是蛋組成的，一些已經破開了。"},{"english":"I had to break into a $20 to pay the bus fare.","chinese":"我只好破開一張20美元的鈔票買車票。"},{"english":"We looked into a dusty room with a hole in the ceiling where once the stovepipe exited.","chinese":"我們走進一個髒暗的房間那裏天花板都破開了一個洞。"},{"english":"A spectator can even opt to remove the fog of war altogether for a truly global view of the battlefield.","chinese":"從一個旁觀者的身份，可以破開任何一處的戰爭迷霧。"},{"english":"Later they break open the pods to remove the beans.","chinese":"然後破開豆莢取出可可豆。"},{"english":"I lose my key. The truck had to be broken open.","chinese":"我丟了鑰匙，只得把衣箱破開。"},{"english":"The chick finally broke through the shell and struggled out of it.","chinese":"小雞終於破開蛋殼，掙扎着從中鑽了出來。"},{"english":"The pipe broke open and water gushed everywhere.","chinese":"管道破開，水噴的到處都是。"},{"english":"The faster we get her stomach untwisted, the better.","chinese":"我們把她的胃破開得最快越好。"},{"english":"If you can read this page, that spells you have breeched the block.","chinese":"如果你可以正常瀏覽本頁面，說明已經破開封鎖。"},{"english":"Linda broke off some of the chocolate to give to the children.","chinese":"琳達把這塊巧克力破開，分了一些給孩子們。"},{"english":"The operator-splitting method is a numerical method.","chinese":"破開算子法是一種數值計算方法。"},{"english":"Could you change me a one-pound note, please?","chinese":"我們的乘客中沒有一個能破開這張鈔票的。"},{"english":"I’d like to have the one-hundred yuan bill broken up.","chinese":"我想破開這100元錢。"},{"english":"Maybe the front desk can break it for me.","chinese":"也許前臺能給我破開。"},{"english":"Break the ten-yuan note, please.","chinese":"把這10元的票子破開。"}],"related":[]}