{"definition":["to burst or force open a door\/to excommunicate sb (from the Roman Catholic Church)\/to score a goal (in football, hockey etc)"],"pinyin":["po4 men2"],"simplified":["破门"],"rank":5774.0,"normalized_rank":0.08078575126271459,"fraction":0.000019533996138529445,"cumulative_fraction":0.8756915282612546,"word":"破門","characters":[{"definition":["broken\/damaged\/worn out\/lousy\/rotten\/to break, split or cleave\/to get rid of\/to destroy\/to break with\/to defeat\/to capture (a city etc)\/to expose the truth of"],"pinyin":["po4"],"word":"破"},{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["Men2","men2"],"word":"門"}],"containing_words":[{"definition":["to break the door down and enter (idiom)"],"pinyin":["po4 men2 er2 ru4"],"word":"破門而入"},{"definition":["to wear out the doorstep (idiom)\/to crowd at sb's door"],"pinyin":["ta1 po4 men2 kan3"],"word":"踏破門檻"}],"sentences":[{"english":"I remember Thierry Henry flicking a ball over his head and scoring.","chinese":"我記得亨利輕挑一個球越過他頭頂，然後破門。"},{"english":"That was until Sinclair cracked it home with a fantastic diagonal shot.","chinese":"直到辛克萊禁區斜角的夢幻施射才破門。"},{"english":"It that man whose house was broken into by burglars last week?","chinese":"上週家裏被盜賊破門而入的就是那個人嗎？"},{"english":"The Church reacted to this stance with characteristic fury, threatening to excommunicate the president.","chinese":"教會的反應是這個立場與特徵憤怒，威脅要破門總統。"},{"english":"Thieves break into the palace and steal the king's treasure.","chinese":"竊賊破門進入宮殿偷走了國王的金銀財寶。"},{"english":"After the thief broke in, there was almost nothing left in the room.","chinese":"小偷破門而入，屋裏幾乎被洗劫一空。"},{"english":"“Andrew's hut was broken into and some film was stolen,” she said.","chinese":"安德魯的棚屋被破門而入，一些片子被偷了。"},{"english":"He'd burgled the office.","chinese":"他破門盜竊了辦公室。"},{"english":"The thief had jumped out of the window before the police broke in.","chinese":"警察還沒來得及破門進入，小偷就已跳窗逃竄了。"},{"english":"He loves to score goals and was unlucky not to get on the scoresheet today.","chinese":"他喜歡破門得分，而他今天未能進球實在是不走運。"},{"english":"However, Li Kai very quick completed has forced a door open, lets on the stand belong to tranquilly .","chinese":"不過，李凱很快就完成了破門，讓看臺上歸於平靜。"},{"english":"A neighbor called police and reported two men trying to break into the house.","chinese":"一個鄰居報警說有兩個男人正試圖破門進入他家。"},{"english":"Charless scored again, with an exact duplicate of his first goal.","chinese":"查爾斯再次得分，與第一次破門如出一轍。"},{"english":"Thief broke out the door when the owner was on vocation.","chinese":"屋主外出度假時，有賊破門進入。"},{"english":"A thieve broke in when the house owner went out on vacation.","chinese":"屋主外出度假時，有賊破門進入。"},{"english":"The thief broke into the house during the night.","chinese":"小偷在夜間破門進入住宅。"}],"related":[{"definition":["12-yard (sports)\/penalty kick"],"pinyin":["shi2 er4 ma3"],"word":"十二碼"},{"definition":["to mess sth up\/to screw up"],"pinyin":["bai3 wu1 long2"],"word":"擺烏龍"},{"definition":["to turn defeat into victory (idiom); to turn the tide"],"pinyin":["fan3 bai4 wei2 sheng4"],"word":"反敗為勝"},{"definition":["(sports) to steal\/to intercept the ball"],"pinyin":["duan4 qiu2"],"word":"斷球"},{"definition":["firefighting\/to extinguish a fire and save life and property\/to dive (of goalkeeper in soccer)"],"pinyin":["pu1 jiu4"],"word":"撲救"},{"definition":["to lift a siege\/to help sb out of trouble or embarrassment"],"pinyin":["jie3 wei2"],"word":"解圍"},{"definition":["visiting team (sports)"],"pinyin":["ke4 dui4"],"word":"客隊"},{"definition":["red card (sports)"],"pinyin":["hong2 pai2"],"word":"紅牌"},{"definition":["hat trick (when one player scores three goals)"],"pinyin":["mao4 zi5 xi4 fa3"],"word":"帽子戲法"},{"definition":["restricted area\/forbidden region"],"pinyin":["jin4 qu1"],"word":"禁區"},{"definition":["chaotic warfare\/confused fighting\/melee\/to join in such fighting"],"pinyin":["hun4 zhan4"],"word":"混戰"},{"definition":["goalkeeper"],"pinyin":["shou3 men2 yuan2"],"word":"守門員"},{"definition":["Minnesota, USA"],"pinyin":["Ming2 ni2 su1 da2"],"word":"明尼蘇達"},{"definition":["to assault a fortified position\/(fig.) to concentrate one's efforts on a particularly difficult part of one's mission"],"pinyin":["gong1 jian1"],"word":"攻堅"},{"definition":["pass (in soccer)\/to feed (ball)"],"pinyin":["chuan2 qiu2"],"word":"傳球"},{"definition":["fireman"],"pinyin":["xiao1 fang2 dui4 yuan2"],"word":"消防隊員"}]}