{"definition":["silicate"],"pinyin":["gui1 suan1 yan2"],"simplified":["硅酸盐"],"rank":42110.0,"normalized_rank":0.5891735340618135,"fraction":3.1531167402177353e-7,"cumulative_fraction":0.9972235201348504,"word":"硅酸鹽","characters":[{"definition":["silicon (chemistry)"],"pinyin":["gui1"],"word":"硅"},{"definition":["sour\/tart\/sick at heart\/grieved\/sore\/aching\/pedantic\/impractical\/to make sarcastic remarks about sb\/an acid"],"pinyin":["suan1"],"word":"酸"},{"definition":["salt\/CL:粒[li4]"],"pinyin":["yan2"],"word":"鹽"}],"containing_words":[{"definition":["Portland cement"],"pinyin":["gui1 suan1 yan2 shui3 ni2"],"word":"硅酸鹽水泥"}],"sentences":[{"english":"Crushing of granites; mining of coal, minerals embedded in siliceous rocks.","chinese":"花崗岩粉碎，採煤，硅酸鹽礦石內植入礦物。"},{"english":"Chemical features of these granites are consistent with silicate liquid immiscibility.","chinese":"它們的化學特徵可以用硅酸鹽液態不混熔來解釋。"},{"english":"Alkali-free aluminosilicate glass is a kind of special glass used in many fields.","chinese":"無鹼鋁硅酸鹽玻璃是一種應用範圍較廣的特種玻璃。"},{"english":"The radiation was filtered either by borosilicate glass or by quartz .","chinese":"輻射光源或用硼硅酸鹽玻璃或用石英過濾。"},{"english":"And what mechanism can get rid of the silicate core that has not been broken by the tides?","chinese":"硅酸鹽核心又是在何種機理作用下不被潮汐力摧毀？"},{"english":"The borosilicate glass was strengthened by using low temperature ion exchange method.","chinese":"採用低溫型離子交換法對硼硅酸鹽玻璃進行增強。"},{"english":"The rice husk is a ligneous hard layer of the cereal with high silicate content.","chinese":"稻殼灰是具有高硅酸鹽含量的穀類的一種木質的硬層。"},{"english":"This paper focuses on mineral weathering by silicate bacteria.","chinese":"研究了硅酸鹽細菌對礦物的風化作用。"},{"english":"The influence of different fineness to the film-forming properties of silicate coatings is investigated.","chinese":"考察了不同細度的滑石粉對硅酸鹽塗料成膜性的影響。"},{"english":"Ilvaite is a rare mineral of calcium-iron-bearing silicate.","chinese":"黑柱石是一種少見的含鈣鐵硅酸鹽礦物。"},{"english":"Ordinary Silicate Rotary-kiln Producing Early-consolidation Cement.","chinese":"普通硅酸鹽，迴轉窯早強型水泥。"},{"english":"At last the silicates is melted.","chinese":"最後，硅酸鹽熔化。"},{"english":"Lithium silicate photosensitive glasses doped silver were fabricated by the method of high temperature melt in silica crucible .","chinese":"採用高溫熔融法制備了銀摻雜的鋰鋁硅酸鹽微晶玻璃。"},{"english":"The invention discloses a silicate scale clearing agent for a ternary combination flooding extraction well.","chinese":"本發明公開了一種三元複合驅採出井硅酸鹽垢清垢劑。"},{"english":"UHP Projector lamps are made of borosilicate glass and fused quartz.","chinese":"UHP投影機燈泡由硼硅酸鹽玻璃和熔凝石英制成。"},{"english":"One of the simplest examples of phyllosilicates is clay minerals.","chinese":"驗證層狀硅酸鹽存在的一個最簡單證據就是粘土礦物。"}],"related":[]}