{"definition":["copper sulfate CuSO4"],"pinyin":["liu2 suan1 tong2"],"simplified":["硫酸铜"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"硫酸銅","characters":[{"definition":["sulfur (chemistry)"],"pinyin":["liu2"],"word":"硫"},{"definition":["sour\/tart\/sick at heart\/grieved\/sore\/aching\/pedantic\/impractical\/to make sarcastic remarks about sb\/an acid"],"pinyin":["suan1"],"word":"酸"},{"definition":["copper (chemistry)\/see also 紅銅|红铜[hong2 tong2]\/CL:塊|块[kuai4]"],"pinyin":["tong2"],"word":"銅"}],"containing_words":[],"sentences":[{"english":"Commercial scale test of selective precipitation method for Mo removal from tungstate solution;","chinese":"研究了用硫酸銅沉澱法除去粗鎢酸鈉溶液中鉬的方法。"},{"english":"The fluid used in the study is bluestone solution.","chinese":"研究中採用的流體爲硫酸銅溶液。"},{"english":"Leaching of copper from chalcocite with acidic acetonitrilecopper sulphate system was studied.","chinese":"研究了用酸性乙腈硫酸銅體系從輝銅礦中提取銅。"},{"english":"A solution of copper sulfate and quicklime used as a fungicide .","chinese":"硫酸銅和生石灰的溶液，用作殺真菌劑。"},{"english":"A hard problern is free from impurity iron in tbe preparation of cupric sulfate from spongy-copper.","chinese":"用海綿銅生產硫酸銅，其困難在於除鐵雜質。"},{"english":"A new technology of producing copper sulphate from impurity-removed waste electrolyte is introduced in the paper.","chinese":"介紹了廢電解液淨化除雜製取硫酸銅的新工藝。"},{"english":"The conditions of production of copper sulfate by air oxidation in liquid phase were discussed.","chinese":"對液相空氣氧化法制取硫酸銅的生產條件進行了研究。"},{"english":"Copper-loaded montmorillonite was prepared using montmorillonite and copper sulphate as raw materials.","chinese":"以蒙脫石和硫酸銅爲主要原料，製備載銅蒙脫石。"},{"english":"Iron or steel placed in copper sulfate also receives a loose immersion deposit.","chinese":"鐵或鋼放入硫酸銅中，也會生成疏鬆的浸鍍層。"}],"related":[]}