{"definition":["sodium sulfate"],"pinyin":["liu2 suan1 na4"],"simplified":["硫酸钠"],"rank":57379.0,"normalized_rank":0.8028066542610496,"fraction":6.043473752083992e-8,"cumulative_fraction":0.9996817401618264,"word":"硫酸鈉","characters":[{"definition":["sulfur (chemistry)"],"pinyin":["liu2"],"word":"硫"},{"definition":["sour\/tart\/sick at heart\/grieved\/sore\/aching\/pedantic\/impractical\/to make sarcastic remarks about sb\/an acid"],"pinyin":["suan1"],"word":"酸"},{"definition":["sodium (chemistry)"],"pinyin":["na4"],"word":"鈉"}],"containing_words":[{"definition":["sodium hyposulfide\/sodium thiosulfate"],"pinyin":["liu2 dai4 liu2 suan1 na4"],"word":"硫代硫酸鈉"},{"definition":["sodium hyposulfide Na2S2O3 (hypo)"],"pinyin":["ci4 ya4 liu2 suan1 na4"],"word":"次亞硫酸鈉"}],"sentences":[{"english":"An indirectly determination of water content in sodium pyrosulphate is introduced.","chinese":"介紹了一種間接測定焦亞硫酸鈉中水分含量的方法。"},{"english":"When sodium dithionite is used, the effect is excellent.","chinese":"用連二亞硫酸鈉處理，效果顯著。"},{"english":"Synthetic detergents replaced the soap with emulsifying agents, such as sodium lauryl sulphate.","chinese":"合成洗滌劑乳化劑如十二烷基硫酸鈉取代了皁粉。"},{"english":"Thiourea or sodium thiosulfate can reduce polymer degradation in RPW solutions.","chinese":"硫脲和硫代硫酸鈉均可減輕污水溶液中聚合物的降解。"},{"english":"Pinellin dissociated into subunits in the presence of sodium dodecyl sulfate or guanidine hydrochloride.","chinese":"十二烷基硫酸鈉或胍鹽存在下，半夏蛋白解聚成亞基。"},{"english":"The thiosulfate is commonly used as the oxidant terminator in water treatment research.","chinese":"硫代硫酸鈉常作爲水處理研究中氧化劑的猝滅劑。"},{"english":"The process for removing the chromium from the silicon steel plant wastewaters was studied by using sodium sulfite as reducer.","chinese":"用亞硫酸鈉爲還原劑對硅鋼含鉻廢水進行了試驗研究。"},{"english":"Sodium pyrosulfite on the impact was not obvious.","chinese":"焦亞硫酸鈉對迷迭香酸的影響不明顯。"},{"english":"For that, we use powdered sodium metabisulfite.","chinese":"因此我們要用到粉末狀的焦亞硫酸鈉。"},{"english":"The single-cycle salt and frost hea-(ving) rate interval increases with increase of sulfate content.","chinese":"硫酸鈉含量增加，其單次鹽脹和凍脹率變化區間增大。"},{"english":"Sodium metabisulfite for sanitizing.","chinese":"消毒的焦亞硫酸鈉。"},{"english":"The optimum conditions of bagasse neutral sodium sulfite pulping had been studied.","chinese":"本文研究了甘蔗渣中性亞硫酸鈉製漿的最佳工藝條件。"},{"english":"The Solubility of sodium sulfate in supercritical water was studied.","chinese":"研究硫酸鈉在超臨界水中的溶解度。"},{"english":"The advantages was obvious compare to traditional processes.","chinese":"相比於常規連二亞硫酸鈉漂白優勢明顯。"},{"english":"Leaching of Ag from residue containing silver with sodium sulfite are studied.","chinese":"研究了用亞硫酸鈉用分銀渣中浸出銀。"},{"english":"Beinga dehydrating agent, the dehydrated sodium sulfate must be used properly, otherwise a negative derivation would occur.","chinese":"脫水劑硫酸鈉用量必須適當，否則會產生負偏差。"}],"related":[]}