{"definition":["to run into\/to meet (unexpectedly)\/to bump into"],"pinyin":["peng4 jian4"],"simplified":["碰见"],"rank":22262.0,"normalized_rank":0.31147426300840875,"fraction":0.0000019115770237570016,"cumulative_fraction":0.9796742004845446,"word":"碰見","characters":[{"definition":["to touch\/to meet with\/to bump"],"pinyin":["peng4"],"word":"碰"},{"definition":["to appear\/also written 現|现[xian4]","to see\/to meet\/to appear (to be sth)\/to interview"],"pinyin":["jian4","xian4"],"word":"見"}],"containing_words":[],"sentences":[{"english":"Use formal greetings when you meet teachers.","chinese":"碰見老師要問安。"},{"english":"Luchy repent for his own affairs, have never thought to mulan had met.","chinese":"呂希爲自己的事情懺悔，沒想到讓木蘭碰見了。"},{"english":"An Arab was walking along in the desert when he met two men.","chinese":"一個阿拉伯人正獨自在沙漠中走，這時他碰見兩個人。"},{"english":"So I'm meeting all kinds of walks of life, and it's awesome.","chinese":"所以我碰見的是各行各業的人，棒極了。"},{"english":"i never dream to meet you here.","chinese":"我做夢也想不到會在這兒碰見你。"},{"english":"Let it be the one thing our hearts are set on, seeking, and finding, and meeting God.","chinese":"讓我們的心放在這上面尋找，尋見，並碰見神。"},{"english":"Bad managers are a dime a dozen but a good one is difficult to find.","chinese":"壞的老闆簡直是多如牛毛，碰見一個好的真難。"},{"english":"Just met Zhao Chuanji wear suits to the street.","chinese":"到街上剛好碰見趙傳奇穿的西裝革履。"},{"english":"I never thought will meet u here.","chinese":"我做夢也想不到會在這兒碰見你。"},{"english":"Avoid seeing people who make unreasonable demands on your time .","chinese":"避免碰見在你工作時間裏提出不合理要求的人。"},{"english":"We met a man with a baby goat two weeks ago.","chinese":"兩週前，我們碰見一個帶小山羊的男人。"},{"english":"I was about to leave when I ran into Mr White.","chinese":"我剛要走就碰見了懷特先生。"},{"english":"So special that even the people I met tends to be special.","chinese":"連出門後碰見的人都特別了。"},{"english":"Meet a black uncle whom I photo the several days ago.","chinese":"居然碰見熟客了，那是前些天我拍的一個黑人大叔。"},{"english":"Should you run into Sunny, tell her she owes me a letter.","chinese":"萬一你碰見桑妮，告訴她她欠我一封信。"},{"english":"Sun Yao meets a tourist outside a hotel in China.","chinese":"孫耀在中國的一家旅館外面碰見一個旅遊者。"}],"related":[]}