{"definition":["to meet\/to hold a meeting"],"pinyin":["peng4 tou2"],"simplified":["碰头"],"rank":24916.0,"normalized_rank":0.34860716634253497,"fraction":0.0000014910154807677753,"cumulative_fraction":0.9841658600961196,"word":"碰頭","characters":[{"definition":["to touch\/to meet with\/to bump"],"pinyin":["peng4"],"word":"碰"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"}],"containing_words":[],"sentences":[{"english":"Lay your heads together and see if you can think out a scheme.","chinese":"你們碰頭看看能否想出個計劃。"},{"english":"You want to have a status meeting every day?","chinese":"你每天都想開一次碰頭會。"},{"english":"The first thing they did when they started work every day was to have a brief meeting.","chinese":"他們每天上班的頭一項工作，就是要舉行碰頭會。"},{"english":"The meeting was over in thirty-five minutes.","chinese":"他們的碰頭三十五分鐘就結束了。"},{"english":"The door was held open by a doorstop.","chinese":"那門用了門碰頭，一直開着。"},{"english":"The door was held open by a doorstop .","chinese":"那門用了門碰頭，一直開著。"},{"english":"Yes, I could meet you just after 10.","chinese":"是的，10點以後可以碰頭。"},{"english":"My uncle and aunt and I were to go together; and the others were to meet us at the church.","chinese":"舅父母跟我一塊兒去的，別的人都約定在教堂裏碰頭。"},{"english":"When we met in the street the houses had grown somber.","chinese":"大夥兒在街上碰頭時，四周的房子都已黯淡下來。"},{"english":"Thank you for your hospitality. I look forward to meeting your general manager.","chinese":"感激你們的美意約請，我也等候着與總司理老師碰頭。"},{"english":"Jon meets Liz and tells her Odie and Garfield have been gone.","chinese":"喬恩與莉茲碰頭後告訴了她奧迪和加菲都失蹤了。"},{"english":"Her first question was “What exactly does the phrase ‘pre-meeting meeting’ mean?”","chinese":"她第一個問題是“‘預先碰頭會’到底是什麼意思？”"},{"english":"One night, a gang of robbers met together just outside the elephant shed.","chinese":"一天晚上，一夥強盜剛好在象棚外碰頭。"},{"english":"About one month later, Germont came back to see us.","chinese":"一個月之後，熱爾芒特回來和我們碰頭。"},{"english":"He left work, and met me at the Motor Vehicle place, which is a 20 mile drive.","chinese":"他離開了單位，駕車到20裏地外的車管所和我碰頭。"},{"english":"We both roared with laughter, our heads together.","chinese":"我倆頭碰頭，狂笑不止。"}],"related":[]}