{"definition":["hydrocarbon"],"pinyin":["tan4 qing1 hua4 he2 wu4"],"simplified":["碳氢化合物"],"rank":39394.0,"normalized_rank":0.5511731702880808,"fraction":4.0669366843734303e-7,"cumulative_fraction":0.9962489523311632,"word":"碳氫化合物","characters":[{"definition":["carbon (chemistry)"],"pinyin":["tan4"],"word":"碳"},{"definition":["hydrogen (chemistry)"],"pinyin":["qing1"],"word":"氫"},{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"}],"containing_words":[],"sentences":[{"english":"A typical example is the halogenation of a hydrocarbon.","chinese":"典型的例子是碳氫化合物的鹵化。"},{"english":"An unsaturated hydrocarbon belonging to the alkene homologous series.","chinese":"不飽和碳氫化合物，屬於烯烴同系物。"},{"english":"It is a saturated hydrocarbon belonging to the alkane homologous series.","chinese":"是飽和碳氫化合物，屬於烷烴同系物。"},{"english":"A large number of hydrocarbons such as benzopyrene are also mutagenic.","chinese":"大量碳氫化合物如苯並芘也是誘變劑。"},{"english":"Diesel is made up of hydrocarbons with roughly 12 to 24 carbons.","chinese":"柴油是由大約12到24個碳的碳氫化合物組成。"},{"english":"It has good chemical resistance to greases, oils and hydrocarbons.","chinese":"它具有良好的耐化學性，以油脂，油類和碳氫化合物。"},{"english":"Electrolysis of water, catalytic decomposition of hydrocarbons?","chinese":"電解水，催化分解碳氫化合物？"},{"english":"The aromatics are ringed hydrocarbons, such as benzene, toluene and xylene. Benzene is used to make polystyrenes (e.g.","chinese":"芳烴是環狀碳氫化合物，如苯，甲苯和二甲苯。"},{"english":"A hydrocarbon was known to be either an alkene or alkane.","chinese":"某碳氫化合物已知可能是烯烴或是烷烴。"},{"english":"To do this, synthetically manufactured hydrocarbons and salts are added.","chinese":"要做到這一點，合成生產的碳氫化合物和鹽被加進。"},{"english":"He looked back to see the hydrocarbon count registering from the exhaust sniffer.","chinese":"他回頭看了看尾氣探測器顯示的碳氫化合物讀數。"},{"english":"Charcoal-grilled foods contain a comparatively higher level of Polycyclic Aromatic Hydrocarbons(PAHs).","chinese":"碳燒食物所含的多環芳香族碳氫化合物通常相對較高。"},{"english":"There are several chemical processes that can change one hydrocarbon into another.","chinese":"幾個化攻過程就可以將一種碳氫化合物變成另一種。"},{"english":"The primary forces causing migration of hydrocarbons are buoyancy and capillarity.","chinese":"引起碳氫化合物運移的主要作用力是浮托力和毛細力。"}],"related":[]}