{"definition":["to crush or compact by means of a roller"],"pinyin":["nian3 ya1"],"simplified":["碾压"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"碾壓","characters":[{"definition":["stone roller\/roller and millstone\/to grind\/to crush\/to husk"],"pinyin":["nian3"],"word":"碾"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"}],"containing_words":[],"sentences":[{"english":"The rubble was moving. It was pressing down, slowly crushing them.","chinese":"瓦礫還在不斷地向下滾動，碾壓着他們的身體。"},{"english":"Crack resistance of two gradated RCC is better than that of three gradated RCC, and Crack resistance of RCC develops with age.","chinese":"隨着齡期的增加，碾壓混凝土的抗裂性能將得到提高。"},{"english":"The sandy gravel was filled in earth-rock dam and rolled by vibrating machine.","chinese":"土石壩填築採用砂礫料，振動機械碾壓。"},{"english":"Deformation properties are the important aspects to study crack resistance of RCC.","chinese":"變形性能是研究和分析碾壓混凝土抗裂性的重要依據。"},{"english":"Research on the crack control measures of RCC dam in the view of structure.","chinese":"本文從結構方面進行了碾壓混凝土壩防裂措施的研究。"},{"english":"The spillway face are RCC benched spillway face.","chinese":"溢流壩面爲碾壓混凝土臺階式溢流面。"},{"english":"Research on the crack control measures in the view of material.","chinese":"本文從材料方面進行了碾壓混凝土壩防裂措施的研究。"},{"english":"Roller crushed concrete is adopted first within our country in dams with bottom conduits in Guanyinge reservoir.","chinese":"觀音閣水庫底孔壩段採用碾壓混凝土尚屬國內首例。"},{"english":"Special carbon paper rolled carbon paper to transfer device on the gravure cylinder.","chinese":"專門的炭素紙轉移裝置將炭素紙碾壓到凹印滾筒上。"},{"english":"Do you know how many Gods and Monsters have been drowned under the waves of past eras?","chinese":"知否多少神怪，被時代無情的車輪碾壓而過？"},{"english":"British Sandbags can be crushed normally by light crush vehicles.","chinese":"英軍沙包現在能被輕型車輛正常碾壓。"},{"english":"A pile of crushed cushions remained to show where Illyrio had sprawled.","chinese":"一堆皺皺巴巴的靠枕依稀辨得出伊利里歐曾經的碾壓。"},{"english":"This glass is ground under water using pestle and mortar.","chinese":"玻璃在水下被杵和臼碾壓。"},{"english":"The Linhekou Hydropower Station has a RCC double-curvature arch dam.","chinese":"藺河口水電站大壩爲碾壓混凝土雙曲拱壩。"},{"english":"The result of braking extruded powder coating after cooling.","chinese":"對擠出的粉末塗料冷卻後碾壓的結果。"},{"english":"For the RCC dam of Taolinkou Reservoir, RCC was developed in the conventional concrete.","chinese":"桃林口水庫碾壓混凝土壩爲“金包銀”形式。"}],"related":[{"definition":["to injure\/to wound\/to damage"],"pinyin":["da3 shang1"],"word":"打傷"},{"definition":["to behead"],"pinyin":["zhan3 sha1"],"word":"斬殺"},{"definition":["lit. to punch and kick (idiom); to beat up\/fig. determined to sort out a problem"],"pinyin":["quan2 da3 jiao3 ti1"],"word":"拳打腳踢"},{"definition":["to dodge\/to sidestep"],"pinyin":["shan3 bi4"],"word":"閃避"},{"definition":["to snap sth off\/to break"],"pinyin":["zhe2 duan4"],"word":"折斷"},{"definition":["to adjust one's head and turn one's face (idiom); cosmetic changes\/Despite superficially new policies, the substance remains unchanged."],"pinyin":["gai3 tou2 huan4 mian4"],"word":"改頭換面"},{"definition":["brick"],"pinyin":["zhuan1 kuai4"],"word":"磚塊"},{"definition":["to satirize\/to ridicule\/to mock"],"pinyin":["ji1 feng3"],"word":"譏諷"},{"definition":["victor\/winner"],"pinyin":["sheng4 li4 zhe3"],"word":"勝利者"},{"definition":["to stop\/to obstruct"],"pinyin":["zu3 lan2"],"word":"阻攔"},{"definition":["seriously hurt\/serious injury"],"pinyin":["zhong4 shang1"],"word":"重傷"},{"definition":["to spar\/to fight\/to duke it out"],"pinyin":["dui4 da3"],"word":"對打"},{"definition":["to gesticulate\/to point out\/to point the finger of blame"],"pinyin":["zhi3 zhi3 dian3 dian3"],"word":"指指點點"},{"definition":["to trip\/to stumble"],"pinyin":["ban4 dao3"],"word":"絆倒"},{"definition":["to damn\/to curse\/to revile"],"pinyin":["zhou4 ma4"],"word":"咒罵"},{"definition":["frigid irony and scorching satire (idiom); to mock and ridicule"],"pinyin":["leng3 chao2 re4 feng3"],"word":"冷嘲熱諷"}]}