{"definition":["magnetosphere\/magnetic layer"],"pinyin":["ci2 ceng2"],"simplified":["磁层"],"rank":51562.0,"normalized_rank":0.7214192772095757,"fraction":1.2145338554912756e-7,"cumulative_fraction":0.9991669382365096,"word":"磁層","characters":[{"definition":["magnetic\/magnetism\/porcelain"],"pinyin":["ci2"],"word":"磁"},{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"層"}],"containing_words":[],"sentences":[{"english":"We have simply used nature's ways to open up the magnetosphere without benefit of storm.","chinese":"我們只不過運用自然的方式張開磁層，而非利用風暴。"},{"english":"What factors govern the variation in the shape of the Earth's magnetosphere?","chinese":"什麼因素支配在地球磁層的形狀變化？"},{"english":"There are few models for the high-latitude magnetopause because of the limit of the satellite observations data.","chinese":"受衛星觀測數據的限制，高緯磁層頂位形模型比較少。"},{"english":"Like the tornado belt or the tropical cyclone zone, the magnetosphere is a place of sudden storms.","chinese":"磁層很像是龍捲風帶或熱帶氣旋區，充滿了瞬間風暴。"},{"english":"This method itself is independent of the normal directions on the magnetopause.","chinese":"這種方法本身與磁層頂的法線方向無關。"},{"english":"In this paper, a mechanism of the earth's magnetospheric substorm is discussed.","chinese":"本文討論了一種地球磁層的亞暴機制。"},{"english":"Studies of Jovian magnetosphere via local measurements of charged particle fluxes and by remote sensing of auroral emissions.","chinese":"研究木星磁層，測量與遙感帶電粒子的數量。"},{"english":"A continuous stream of charged particles called the solar wind impinges on the earth's magnetosphere.","chinese":"稱作太陽風的連續帶電子流撞擊在地球的磁層上。"},{"english":"We use a three dimensional pulsar magnetosphere model to study the geometry of outer- magnetospheric gaps.","chinese":"利用三維脈衝星磁層模型研究了磁層外隙的幾何結構。"},{"english":"We use a three dimensional pulsar magnetosphere model to study the geometry of outer- magnetospheric gaps.","chinese":"利用三維脈衝星磁層模型研究了磁層外隙的幾何結構。"},{"english":"Saturn's magnetosphere appears to be intermediate in nature to those of Earth and Jupiter.","chinese":"土星磁層的性質似乎是在中堅餑地球和木星的。"},{"english":"Magnetospheric substorms are important processes during geomagnetospheric space storms.","chinese":"磁層亞暴是地球空間動力學的一個重要過程。"},{"english":"Magnetospheres are fluid and plastic, as the simulation of Earth's magnetosphere shows.","chinese":"磁層液和塑料，作爲模擬的地球磁層顯示。"},{"english":"Magnetospheres are fluid and plastic, as the simulation of Earth's magnetosphere shows.","chinese":"磁層液和塑料，作爲模擬的地球磁層顯示。"}],"related":[]}