{"definition":["magnetic induction"],"pinyin":["ci2 gan3 ying4"],"simplified":["磁感应"],"rank":58849.0,"normalized_rank":0.8233738614581729,"fraction":4.9486415506195e-8,"cumulative_fraction":0.9997624866642791,"word":"磁感應","characters":[{"definition":["magnetic\/magnetism\/porcelain"],"pinyin":["ci2"],"word":"磁"},{"definition":["to feel\/to move\/to touch\/to affect\/feeling\/emotion\/(suffix) sense of ~"],"pinyin":["gan3"],"word":"感"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"}],"containing_words":[{"definition":["electromagnetic induction"],"pinyin":["dian4 ci2 gan3 ying4"],"word":"電磁感應"},{"definition":["magnetic field density"],"pinyin":["ci2 gan3 ying4 qiang2 du4"],"word":"磁感應強度"}],"sentences":[{"english":"On carrying our his experiment, Faraday discovered electromagnetic induction.","chinese":"在進行實驗時，法拉第發現了電磁感應現象。"},{"english":"The rangeability of magnetic induction effect enhance after annealing.","chinese":"退火可以提高非晶薄帶的磁感應效應變化幅度。"},{"english":"Faraday was the scientist who discovered electromagnetic induction.","chinese":"法拉第是發現電磁感應的科學家。"},{"english":"Inverse problem of the open magnetic induction tomography.","chinese":"開放式磁感應成像逆問題研究。"},{"english":"The magnetic induction intensity of the fibers raised with increasing of thickness of the fiber.","chinese":"隨着樣品厚度的增加纖維的磁感應強度明顯加大。"},{"english":"The residual magnetism that remains on magnetic storage media after degaussing .","chinese":"經消磁後，磁介質上殘留的磁感應。"},{"english":"The sensing itself is done by magnetising a spot on the rim of the flywheel.","chinese":"感應過程通過磁感應調速輪邊緣的一個點來實現。"},{"english":"Dice in a magnetic induction block contact, can throw the various points.","chinese":"色子在磁感應塊上接觸一下，可擲出各種點數。"},{"english":"Magnetic induction of a circular current is calculated using magnetic scalar potential.","chinese":"用磁標勢法計算了圓形線電流的磁感應強度。"},{"english":"Compact, high magnetic induction intensity and long coil service life.","chinese":"結構緊湊，磁感應強度高，線圈使用壽命長。"},{"english":"Exchange the silicon controlled rectifier to control, electromagnetic induction exports.","chinese":"交流可控硅控制，電磁感應輸出。"},{"english":"Electromagnetically induced transparency and slow light in ultracold Bose gas were investigated.","chinese":"研究了超冷玻色氣體中的電磁感應透明現象。"},{"english":"The electromagnetically induced two-photon transparency (EITT) under the control of coherent field is investigated.","chinese":"研究了相干場控制下的電磁感應雙光子光透明。"},{"english":"While the relative error hardly changes if magnetic induction strength increases to some value.","chinese":"當磁感應強度增加到一定值時，其誤差幾乎不變。"}],"related":[]}