{"definition":["magnetite Fe3O4"],"pinyin":["ci2 tie3 kuang4"],"simplified":["磁铁矿"],"rank":46581.0,"normalized_rank":0.6517286247953773,"fraction":2.037847670992573e-7,"cumulative_fraction":0.9983691029180706,"word":"磁鐵礦","characters":[{"definition":["magnetic\/magnetism\/porcelain"],"pinyin":["ci2"],"word":"磁"},{"definition":["iron (metal)\/arms\/weapons\/hard\/strong\/violent\/unshakeable\/determined\/close\/tight (slang)","surname Tie"],"pinyin":["Tie3","tie3"],"word":"鐵"},{"definition":["ore\/mine"],"pinyin":["kuang4"],"word":"礦"}],"containing_words":[],"sentences":[{"english":"They have just found a magnetite in this region.","chinese":"他們在這個地區剛剛發現一個磁鐵礦。"},{"english":"The mixture of magnetite and quartz was separated by magnetic separation.","chinese":"磁鐵礦和石英的混合礦樣採用磁選分離。"},{"english":"The oxidation mechanism of Jidong magnetite pellets was studied.","chinese":"對冀東磁鐵礦球團焙燒的氧化機理進行了研究。"},{"english":"Makeng Mining is now the largest single magnetite ore underground mine in China.","chinese":"馬坑礦業已成爲我國最大的單體井下磁鐵礦。"},{"english":"The larger resource is magnetite.","chinese":"大的那份是磁鐵礦。"},{"english":"Iron ores of greatest economic interest contain magnetite and hematite.","chinese":"安徽廬江龍橋鐵礦屬一大型隱伏磁鐵礦礦牀。"},{"english":"The analytical scheme of magnetite in iron ores by means of the chemical separation has been investigated.","chinese":"本文研究了用化學分離法測定鐵礦石中磁鐵礦的方案。"},{"english":"Ancient Chinese people into contact with magnetite, as he began to understand the nature of magnetism.","chinese":"古代中國人接觸了磁鐵礦，開始了對磁性質的瞭解。"},{"english":"This is because the oxidation breaks down magnetite.","chinese":"這是因爲氧化磁鐵礦蛻變。"},{"english":"Panzhihua city lies in the upstream of Yangtze River, where possessing of the biggest Vanadium Titanivm magnetite in China.","chinese":"攀枝花市位於長江上游，擁有全國最大的釩鈦磁鐵礦。"},{"english":"Reasons of the skimmer damage when smelting V-bearing titanomagnetite at Panzhihua Iron and Steel Group are studied.","chinese":"分析了高爐冶煉釩鈦磁鐵礦爐前砂口損壞的原因。"},{"english":"There exists a certain kind of difficulty to smelt the vanadium-bearing titanomagnetite in a conventional blast furnace.","chinese":"利用普通高爐冶煉高鈦型釩鈦磁鐵礦有很大的難度。"},{"english":"The Longqiao iron ore deposit is a large-scale hidden magnetite ore deposit.","chinese":"安徽廬江龍橋鐵礦屬一大型隱伏磁鐵礦礦牀。"},{"english":"Commercial test of separating Baima vanadium-bearing titanomagnetite was performanced.","chinese":"對白馬釩鈦磁鐵礦進行了選礦工業試驗。"},{"english":"The Damiao anorthosite complex is rich in vanadium titanomagnetite ore bodies.","chinese":"大廟斜長巖雜巖體中賦存有豐富的釩鈦磁鐵礦礦體。"}],"related":[]}