{"definition":["milling machine"],"pinyin":["mo2 ji1"],"simplified":["磨机"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"磨機","characters":[{"definition":["grindstone\/to grind\/to turn round","to rub\/to grind\/to polish\/to sharpen\/to wear down\/to die out\/to waste time\/to pester\/to insist"],"pinyin":["mo2","mo4"],"word":"磨"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[{"definition":["ball mill"],"pinyin":["qiu2 mo2 ji1"],"word":"球磨機"},{"definition":["rod mill"],"pinyin":["bang4 mo2 ji1"],"word":"棒磨機"},{"definition":["angle grinder"],"pinyin":["jiao3 mo2 ji1"],"word":"角磨機"}],"sentences":[{"english":"Various shortcomings existed for the adoption of slide bearing in the ball mill was analyzed.","chinese":"分析了球磨機採用滑動軸承存在摩擦阻力大的弊端。"},{"english":"Roller mills grind essentially by crushing and attrition .","chinese":"輥磨機主要靠擠壓和摩擦研碎物料。"},{"english":"Portable grinders should be handled with care to avoid damaging the grinding wheel.","chinese":"可動的研磨機小心用手持，避免損傷磨輪。"},{"english":"After that, use water-mill machine to polish the edges and angles of the slate material.","chinese":"之後，用水磨機對石板的邊角進行拋光。"},{"english":"Sturdily mount the clamping device of machine.","chinese":"研磨機夾持必須安裝牢固。"},{"english":"The invention discloses a grinding method and a grinder of the spherical surface of a columnar workpiece.","chinese":"本發明公開了一種柱狀工件球面的研磨方法及研磨機。"},{"english":"The designed thinking of a complex CNC surface grinding machine for turbine cylinder is narrated briefly.","chinese":"概述了數控汽輪機缸體表面打磨機的設計思想。"},{"english":"These methods are applied successfully in NC grinding machine used in skates machining.","chinese":"該方法在數控冰刀研磨機上得到成功的應用。"},{"english":"Use a coffee grinder to grind the sheets into a powder.","chinese":"利用咖啡研磨機把一大片磨碎成粉末。"},{"english":"Ball mill is an efficient tool for grinding many materials into fine powder.","chinese":"球磨機是一種有效的工具磨許多材料成細粉。"},{"english":"In this paper, the small-scale planet style ball mill is applied to manufacture the industrial roseite powder in XinJiang Province.","chinese":"本研究採用小型行星式球磨機加工新疆工業蛭石粉體。"},{"english":"Never clamp a hand-held grinder in a vise.","chinese":"絕不可使用虎鉗夾住手持式研磨機。"},{"english":"The design idea and structures of the partial enclosures for bowl mill are introduced.","chinese":"介紹了球磨機局部隔聲罩的設計思路和裝置結構。"},{"english":"A new kind of material which suitable for manufacturing large scale ball mill liner was successfully researched.","chinese":"研究成功了一種適合於製造大型球磨機襯板的新材料。"},{"english":"The steel ball lifter is for loading the loading capacity is about 1 t.","chinese":"此鋼球提升器爲磨機裝運鋼球用，裝載量約1噸。"},{"english":"This machine adopts the double leaf blade, it's controled by hydraulic.","chinese":"本機採用雙葉片泵由液壓來控制的三輥研磨機。"}],"related":[]}