{"definition":["to sharpen on grindstone\/to improve oneself by practice"],"pinyin":["mo2 li4"],"simplified":["磨砺"],"rank":21828.0,"normalized_rank":0.3054020399311628,"fraction":0.000001994054382933994,"cumulative_fraction":0.9788266200782428,"word":"磨礪","characters":[{"definition":["grindstone\/to grind\/to turn round","to rub\/to grind\/to polish\/to sharpen\/to wear down\/to die out\/to waste time\/to pester\/to insist"],"pinyin":["mo2","mo4"],"word":"磨"},{"definition":["grind\/sandstone"],"pinyin":["li4"],"word":"礪"}],"containing_words":[],"sentences":[{"english":"Bao Jianfeng from sharpening out, plum blossom from the bitter cold.","chinese":"寶劍鋒從磨礪出，梅花噴鼻自苦寒來。"},{"english":"Hard working conditions buld up character.","chinese":"艱苦的工作條件能磨礪人的性格。"},{"english":"I think it whets our appetite for the next things to come.","chinese":"我覺得我們的胃口接下來磨礪的東西。"},{"english":"But it may be a long and painful grind.","chinese":"但是，這將會是一個漫長而痛苦的磨礪過程。"},{"english":"My powers of observation were honed through it.","chinese":"我的觀察力也得到磨礪。"},{"english":"She found, however, that it was one to which she must inure herself.","chinese":"不過她覺得，她必須使自己習慣於這磨礪。"},{"english":"In the reality of the furnace, the heart will be coarseness and inhospitality gradually.","chinese":"在現實的磨礪中，心卻漸漸的粗糙冷漠。"},{"english":"One successful hunt is enough to sharpen their inborn skills.","chinese":"一次成功的狩獵足夠磨礪它們天生的技能。"},{"english":"This machine is used for grinding flat clothing for textile trade.","chinese":"該機主要用於紡織企業對蓋板針布的磨礪。"},{"english":"Because the Sun and moon honed, rock Daisy seems slightly different, gorgeous.","chinese":"由於日月的磨礪，石菊花便顯得形態各異，絢麗多姿。"},{"english":"Fragrance of plum blossom is sweet in bitter cold.","chinese":"寶劍鋒自磨礪出，梅花香自苦寒來。"},{"english":"Twenty years of grounding, make sure we don't recognize each other.","chinese":"二十年光陰的磨礪，肯定會讓我們都認不出彼此了。"},{"english":"They have pushed themselves to be as sharp as a razor's edge.","chinese":"他們已經把自己磨礪得像刀尖一樣鋒利。"},{"english":"All the better. It will be honed by the sandstorms of the northern deserts.","chinese":"正好，塞外的風沙能磨礪出他的堅強。"},{"english":"He had a painful excursion.","chinese":"他有了一個充滿磨礪的短途旅行。"},{"english":"I convergence in my hands and feet, to protect, but difficult to avoid grounding.","chinese":"我收斂我的手腳，極力袒護，但還是要難避磨礪。"}],"related":[]}