{"definition":["phosphate ore"],"pinyin":["lin2 kuang4"],"simplified":["磷矿"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"磷礦","characters":[{"definition":["phosphorus (chemistry)"],"pinyin":["lin2"],"word":"磷"},{"definition":["ore\/mine"],"pinyin":["kuang4"],"word":"礦"}],"containing_words":[{"definition":["phosphate"],"pinyin":["lin2 kuang4 shi2"],"word":"磷礦石"}],"sentences":[{"english":"The method is applicable to the manufacturers for extracting iodine with phosphate ore.","chinese":"適用於從磷礦石提取碘的生產企業。"},{"english":"Residual amounts of iron and aluminum dilute the phosphate content.","chinese":"殘採的鐵鋁降低了磷礦的含量。"},{"english":"Phosphoric acid was selected as bond to make phosphate rock powder into ball material.","chinese":"研究選用磷酸作粘結劑，使碎磷礦粉粘結成型。"},{"english":"Industrial-grade phosphoric acid was produced by using mid-low-grade phosphate rock.","chinese":"利用中低品位磷礦製取工業級磷酸。"},{"english":"The Dayukou project met with a great difficulty in deciding on the source of secondary rock.","chinese":"大峪口工程在確定二次磷礦源時遇到了很大困難。"},{"english":"Flotation is used for Florida and Kola rock.","chinese":"浮選操作法用於佛羅里達磷礦和科拉磷礦。"},{"english":"Flotation is used for Florida and Kola rock.","chinese":"浮選操作法用於佛羅里達磷礦和科拉磷礦。"},{"english":"The problems in the beneficiation of phosphorite ores and countermeasures are presented.","chinese":"指出了磷礦石選礦中存在的問題並給出瞭解決對策。"},{"english":"The phosphate also acts as a binder.","chinese":"磷礦還起膠結劑的作用。"},{"english":"Chemical beneficiation is an effective method for treating refractory phosphate ores.","chinese":"化學選礦是處理難選磷礦石的有效方法。"},{"english":"This is illustrated by citing a case of purchase of bulldozers in Kunyang Phosphate Mine.","chinese":"以昆陽磷礦購買推土機爲例作了說明。"},{"english":"Phosphate rock is the major raw material in the production of Phosphate fertilizer.","chinese":"磷礦是生產磷肥的主要原料。"},{"english":"Phosphate bulk carrier off the cost of Nauru at sunset.","chinese":"在夕陽中駛離瑙魯海灘的散裝磷礦石船。"},{"english":"Bowl mills have not been widely employed for phosphate rock to date.","chinese":"鉢狀磨礦機至今尚未廣泛應用於磷礦的磨碎。"},{"english":"The calcium carbonate content of phosphate rock determines the pore structure.","chinese":"磷礦中碳酸鈣的含量決定了磷礦的毛細孔結構。"},{"english":"The calcium carbonate content of phosphate rock determines the pore structure.","chinese":"磷礦中碳酸鈣的含量決定了磷礦的毛細孔結構。"}],"related":[]}