{"definition":["sodium phosphate (chemistry)"],"pinyin":["lin2 suan1 na4"],"simplified":["磷酸钠"],"rank":46433.0,"normalized_rank":0.6496579127782519,"fraction":2.0714225251708172e-7,"cumulative_fraction":0.9983386718380654,"word":"磷酸鈉","characters":[{"definition":["phosphorus (chemistry)"],"pinyin":["lin2"],"word":"磷"},{"definition":["sour\/tart\/sick at heart\/grieved\/sore\/aching\/pedantic\/impractical\/to make sarcastic remarks about sb\/an acid"],"pinyin":["suan1"],"word":"酸"},{"definition":["sodium (chemistry)"],"pinyin":["na4"],"word":"鈉"}],"containing_words":[],"sentences":[{"english":"The mechanism of electroless nickel deposition in sodium hypophosphite bath is discussed.","chinese":"探討了次亞磷酸鈉體系化學鍍鎳沉積機理。"},{"english":"All four preferred electroless baths use hypophosphite as a reducing agent.","chinese":"所有四個優先使用化學浴次磷酸鈉作爲還原劑。"},{"english":"METHODS Determinating the contents of riboflavin sodium phosphate by UV-vis.","chinese":"方法用分光光度法測定核黃素磷酸鈉的含量。"},{"english":"The technological process for preparing phosphorous acid from the production waste of sodium hypophosphite was described.","chinese":"介紹了從次磷酸鈉生產廢渣中回收提取亞磷酸的工藝。"},{"english":"Sodium tripolyphosphate (STPP) is a highly efficient retardant, and is commonly used in building gypsum.","chinese":"三聚磷酸鈉是建築石膏高效緩凝劑。"},{"english":"The fermentation of sugar to alcohol and the production of lime and sodium phosphate also generate carbon dioxide.","chinese":"糖發酵成酒精和石灰和磷酸鈉的生產也產生二氧化碳。"},{"english":"Addition of the appropriate sodium phosphate effectively improved meat texture and tas…","chinese":"添加適量的磷酸鈉能有效改善醬體中牛肉的口感。"},{"english":"Sodium magnesium fructose diphosphate conduced to maintenance the integrality of myocardial cell ultrastructures.","chinese":"表明果糖二磷酸鈉鎂能維護細胞結構的完整性。"},{"english":"Rather it's composite chicken made with ground-up chicken skin held together with sodium phosphate and salt .","chinese":"而是綜合了雞與地面跟進雞皮膚一起舉行磷酸鈉和鹽。"},{"english":"The impurities removing in production of sodium hypophosphite is focused in the paper.","chinese":"重點論述了次磷酸鈉工業生產中的雜質去除問題。"}],"related":[]}