{"definition":["to demonstrate\/to show how to do sth\/demonstration\/a model example"],"pinyin":["shi4 fan4"],"simplified":["示范"],"rank":3360.0,"normalized_rank":0.047010759307710606,"fraction":0.000041898352484284915,"cumulative_fraction":0.8068715459418951,"word":"示範","characters":[{"definition":["to show\/to reveal"],"pinyin":["shi4"],"word":"示"},{"definition":["pattern\/model\/example"],"pinyin":["fan4"],"word":"範"}],"containing_words":[],"sentences":[{"english":"Professional building in the country with a demonstration effect.","chinese":"專業的建設在全國帶有一定的示範作用。"},{"english":"Daye city or village women's federation of women's demonstration focused on building the village.","chinese":"該村還是大冶市婦聯重點建設的巾幗示範村。"},{"english":"The construction of fine courses is a main component of the construction of an examplar higher vocational college.","chinese":"精品課程建設是示範院校專業建設的主要內涵。"},{"english":"In 2007, the state began to establish disaster-reduction demonstration communities.","chinese":"2007年，國家開展了減災示範社區創建活動。"},{"english":"Now let's act out the model dialogue.","chinese":"現在讓我們表演一下示範對話。"},{"english":"I carefully prepared a second model class, finally got the recognition.","chinese":"但我精心準備了第二次示範課，這次終於得到了表揚。"},{"english":"There also are plans to flight-test the scale model next year.","chinese":"也有一些計劃試飛規模示範明年。"},{"english":"To see glass-making demonstrations, visit the tiny island of Murano.","chinese":"要看玻璃示範製作，就要前往小島慕拉諾。"},{"english":"OK. I'll ask some groups to act it out.","chinese":"此表演讓學生先準備，然後找幾組來示範。"},{"english":"A brother initiate who is a skilled chef demonstrates vegetarian cooking . vegetarian stuffed cabbage.","chinese":"烹飪課上，廚師師兄示範美味素食餐點的料理方法。"},{"english":"There are many ideas for commercial-scale demonstration projects.","chinese":"還有很多關於商業規模示範項目的想法。"},{"english":"This furnace is used at the Anshan Iron and Steel Co. as demonstration furnace.","chinese":"該爐在鞍鋼弓長嶺球團廠獲得成功應用併成爲示範爐。"},{"english":"Genu bosom lies a demonstrative graph another relevant adjustment the method is \" bridge-type lies \" .","chinese":"膝胸臥位示範圖另一相關的調整方法是“橋式臥位”。"},{"english":"Any mobile phone can be Swiss Diamond, these are just sample.","chinese":"什麼手機都能鑲鑽的，這些只是示範圖。"},{"english":"Here will be an important carrier of self-innovation and a model area of saving energy and reducing emission.","chinese":"這裏將是自主創新的重要載體和節能減排的示範區。"},{"english":"Visit Juncao mushroom enterprises and industry demonstration parks.","chinese":"參觀福建省菌草產業示範企業及示範園區。"}],"related":[{"definition":["to guide\/to give directions\/to direct\/to coach\/guidance\/tuition\/CL:個|个[ge4]"],"pinyin":["zhi3 dao3"],"word":"指導"},{"definition":["to extend\/to spread\/to popularize\/generalization\/promotion (of a product etc)"],"pinyin":["tui1 guang3"],"word":"推廣"},{"definition":["(administrative) national-level"],"pinyin":["guo2 jia1 ji2"],"word":"國家級"},{"definition":["site developed for a group of related enterprises\/(industrial or technology) park"],"pinyin":["yuan2 qu1"],"word":"園區"},{"definition":["industry\/estate\/property\/industrial"],"pinyin":["chan3 ye4"],"word":"產業"},{"definition":["to cultivate\/to train\/to groom\/training"],"pinyin":["pei2 xun4"],"word":"培訓"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引領"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["test point\/to carry out trial\/pilot scheme"],"pinyin":["shi4 dian3"],"word":"試點"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to found\/to establish"],"pinyin":["chuang4 jian4"],"word":"創建"},{"definition":["important point\/main point\/focus\/key (project etc)\/to focus on\/to put the emphasis on","to recount (e.g. results of election)\/to re-evaluate"],"pinyin":["chong2 dian3","zhong4 dian3"],"word":"重點"},{"definition":["to build (housing)\/to construct\/to make"],"pinyin":["ying2 zao4"],"word":"營造"},{"definition":["transformation\/to transform"],"pinyin":["zhuan3 xing2"],"word":"轉型"},{"definition":["advanced (technology)\/to advance"],"pinyin":["xian1 jin4"],"word":"先進"},{"definition":["to guide\/to lead (around)\/to conduct\/to boot\/introduction\/primer"],"pinyin":["yin3 dao3"],"word":"引導"}]}