{"definition":["neurofibril"],"pinyin":["shen2 jing1 xian1 wei2"],"simplified":["神经纤维"],"rank":45615.0,"normalized_rank":0.6382130314944104,"fraction":2.2465956774051362e-7,"cumulative_fraction":0.9981620495659256,"word":"神經纖維","characters":[{"definition":["God\/abbr. for 神舟[Shen2 zhou1]","deity\/soul\/spirit\/unusual\/mysterious\/lively\/expressive\/expression\/look\/CL:個|个[ge4]\/(slang) awesome\/amazing"],"pinyin":["Shen2","shen2"],"word":"神"},{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["Jing1","jing1"],"word":"經"},{"definition":["fine\/delicate\/minute"],"pinyin":["xian1"],"word":"纖"},{"definition":["abbr. for Uighur 維吾爾|维吾尔[Wei2 wu2 er3]\/surname Wei","to preserve\/to maintain\/to hold together\/dimension\/vitamin (abbr. for 維生素|维生素[wei2 sheng1 su4])"],"pinyin":["Wei2","wei2"],"word":"維"}],"containing_words":[{"definition":["neurofibroma"],"pinyin":["shen2 jing1 xian1 wei2 liu2"],"word":"神經纖維瘤"}],"sentences":[{"english":"The unmyelinated nerve fibers either terminate around the blood capillaries or approach near pituicytes.","chinese":"無髓神經纖維終止於毛細血管周圍或僅貼垂體細胞。"},{"english":"The regenerating fibers were mainly small myelinated fibers.","chinese":"再生纖維主要爲細小的有髓神經纖維。"},{"english":"A solitary intraosseous neurofibroma is rare and mostly occurs in the mandible.","chinese":"孤獨內神經纖維瘤是罕見的，主要發生在頜骨。"},{"english":"Only by incision of the perineurium the nerve fibres can be completely decompressed.","chinese":"因此只有切開束膜，神經纖維才能獲得完全減壓。"},{"english":"The skin nerve fibers were detected in the fetal rabbits at 22 days gestation.","chinese":"胎齡22天胎兔背部皮膚已有神經纖維支配。"},{"english":"In addition, VIP-like fibers were also seen in the supraoptic nucleus.","chinese":"另外，在視上核內見到了VIP樣神經纖維。"},{"english":"The...divisions... are none other than the beginnings of this nerve fibre net.","chinese":"這些部分是神經纖維網絡的發端。"},{"english":"The tumor is usually associated with neurofibromatosis type 1 (NF-1).","chinese":"這種腫瘤經常合併有第一型神經纖維瘤病。"},{"english":"General travel operation excises nerve fibroma.","chinese":"神經纖維瘤一般行手術切除。"},{"english":"Multiplicity is a common feature in GI tract neurofibromas and GISTs.","chinese":"胃腸道神經纖維瘤及GISTs的常見特點是多發。"},{"english":"The pit organ contains nerve fibres known as trigeminal ganglia.","chinese":"窩器內有三叉神經節的神經纖維。"},{"english":"The treatment tries to stimulate the growth of new fibres by injecting glucose into the ligaments.","chinese":"向韌帶注射葡萄糖是爲了加速神經纖維的再生。"},{"english":"The isolated gastric neurofibroma is a rare disease and is difficult to be diagnosed before operation.","chinese":"單發性胃神經纖維瘤臨牀頗爲少見，術前診斷困難。"},{"english":"The retinal nerve fiber layer tends to become thinning with age.","chinese":"隨年齡的增長，視網膜神經纖維層有變薄的趨勢。"},{"english":"Objective To investigate nerve fibers connection between locus coeruleus and the dorsal column nuclei in rats.","chinese":"目的探討大鼠藍斑與背柱核間的神經纖維聯繫。"},{"english":"In the transitional segment, neurons and nerve fibers were distributed linearly along the longitudinal muscle fibers.","chinese":"神經元和神經纖維呈沿縱行肌長軸線性分佈。"}],"related":[]}