{"definition":["neurologist"],"pinyin":["shen2 jing1 xue2 jia1"],"simplified":["神经学家"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"神經學家","characters":[{"definition":["God\/abbr. for 神舟[Shen2 zhou1]","deity\/soul\/spirit\/unusual\/mysterious\/lively\/expressive\/expression\/look\/CL:個|个[ge4]\/(slang) awesome\/amazing"],"pinyin":["Shen2","shen2"],"word":"神"},{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["Jing1","jing1"],"word":"經"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[],"sentences":[{"english":"Again determined to rule out a reaction to textures, the neurologists tested her with colored light.","chinese":"再次決心排除反應紋理，神經學家測試與彩色光她。"},{"english":"Haynes wasn't the first neuroscientist to explore unconscious decision-making.","chinese":"海恩斯並非第一個探究無意識思考決策的神經學家。"},{"english":"Well the so called MS experts are neurologists.","chinese":"神經學家是這樣巧舌如簧的。"},{"english":"On the one hand, Freud made his start as a neuroscientist.","chinese":"一方面，弗洛伊德在一開始時是一位神經學家。"},{"english":"Sacks, Oliver - official site of the neurologist-writer. Contact information, news, and links.","chinese":"供神經學家參考的官方站點，有關信息，新聞及鏈接。"},{"english":"There's a possible clue in the work of neuroscientist David Sweatt.","chinese":"有一個在工作的神經學家大衛斯韋特可能的線索。"},{"english":"But for ages, not even neuroscientists knew why.","chinese":"但好多年以來，神經學家也不知道爲什麼。"}],"related":[]}