{"definition":["neurotoxin"],"pinyin":["shen2 jing1 du2 su4"],"simplified":["神经毒素"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"神經毒素","characters":[{"definition":["God\/abbr. for 神舟[Shen2 zhou1]","deity\/soul\/spirit\/unusual\/mysterious\/lively\/expressive\/expression\/look\/CL:個|个[ge4]\/(slang) awesome\/amazing"],"pinyin":["Shen2","shen2"],"word":"神"},{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["Jing1","jing1"],"word":"經"},{"definition":["poison\/to poison\/poisonous\/malicious\/cruel\/fierce\/narcotics"],"pinyin":["du2"],"word":"毒"},{"definition":["raw silk\/white\/plain, unadorned\/vegetarian (food)\/essence\/nature\/element\/constituent\/usually\/always\/ever"],"pinyin":["su4"],"word":"素"}],"containing_words":[],"sentences":[{"english":"The neurotoxic effects of manganese exposure in the workplace are well known.","chinese":"衆所周知，工作場所的錳有神經毒素的效果。"},{"english":"In fact, we take our pillows, we douse them in a neurotoxin.","chinese":"事實上，我們買的枕頭，有些是浸泡到神經毒素裏。"},{"english":"Still, it can also be assumed the more comprehensive lists of known animal and human neurotoxins will likely have impacts to fetuses.","chinese":"假定已知的動物和人類神經毒素很可能會影響胎兒。"},{"english":"Lead is a neurotoxin.","chinese":"鉛是一種神經毒素。"},{"english":"Such immersion is accompanied by mind-altering neurotoxins which keep the victim docile.","chinese":"在這種融合的同時，致幻神經毒素能保持受害者順從。"},{"english":"Lead is putatively regarded as an environmental neurotoxicant.","chinese":"鉛是一種廣爲人知的環境神經毒素。"},{"english":"Researchers will search for varieties with low levels of this neurotoxin.","chinese":"科學家將尋找含有最低濃度的這種神經毒素的品種。"}],"related":[]}