{"definition":["clergy\/clerical"],"pinyin":["shen2 zhi2"],"simplified":["神职"],"rank":51921.0,"normalized_rank":0.7264421529808459,"fraction":1.1722003437013151e-7,"cumulative_fraction":0.99920975902162,"word":"神職","characters":[{"definition":["God\/abbr. for 神舟[Shen2 zhou1]","deity\/soul\/spirit\/unusual\/mysterious\/lively\/expressive\/expression\/look\/CL:個|个[ge4]\/(slang) awesome\/amazing"],"pinyin":["Shen2","shen2"],"word":"神"},{"definition":["office\/duty"],"pinyin":["zhi2"],"word":"職"}],"containing_words":[{"definition":["clergy\/cleric"],"pinyin":["shen2 zhi2 ren2 yuan2"],"word":"神職人員"}],"sentences":[{"english":"Some Scriptures said to focus my ministry and my life on God and God alone.","chinese":"一些經文教導我要把我的神職和生命致力於上帝一個。"},{"english":"During the dawn period of civilization, the status of the wizard dropped and became the clergy.","chinese":"到了文明曙光期，巫覡地位下降，終於成爲神職人員。"},{"english":"The church has no ordained clergy.","chinese":"教會並沒有受戒的神職人員。"},{"english":"The celibate ministry comes about later.","chinese":"獨身神職後來纔出現。"},{"english":"In the beginning of early Christianity,see, you did not have the celibate ministr.","chinese":"在早期基督教之初，是沒有獨身神職的。"},{"english":"The new proposals affect both clergy and laity.","chinese":"新的建議與神職人員和俗人都有關係。"},{"english":"The color black, the preference of ecclesiastical leaders,was a symbol of authority.","chinese":"黑色在那時受到神職人員的青睞，是權威的象徵。"},{"english":"And then the writer takes Melchizedek to be a type, a sign of Jesus and his priesthood.","chinese":"然後作者把麥基洗德當做象徵了，耶穌及其神職。"},{"english":"Religious edifices and orders have been in existence for many years.","chinese":"許多宗教建築和神職已經存在了好些年。"},{"english":"For years, the Catholic Church in America has struggled to find new clergy.","chinese":"多年來，美國天主教會一直在努力尋找新的神職人員。"},{"english":"Some bom had been sent to clerics wra edas gifts.","chinese":"把炸彈包裹成禮物模樣送到神職人員手上。"},{"english":"Priesthoods based on the worship of a demigod are extremely rare.","chinese":"崇拜半神的神職人員也是十分的稀有。"},{"english":"Sometimes, not always, the clergy and laity voted in separate chambers.","chinese":"有時候，並非總是，神職人員和俗人投了單獨的分庭。"},{"english":"Iran's clerics have also climbed the cyber-learning curve.","chinese":"伊朗的神職人員也在迅速學習運用互聯網。"},{"english":"Clergy and laity alike are divided in their views.","chinese":"神職人員和信衆同樣都觀點各異。"},{"english":"Lin's maturity could lead him to the ministry.","chinese":"林的成熟可能會導致他成爲神職人員。"}],"related":[]}