{"definition":["defense of the imperial palace or of the capital\/the palace guard (or a member of that unit)"],"pinyin":["jin4 wei4"],"simplified":["禁卫"],"rank":56294.0,"normalized_rank":0.7876260965679347,"fraction":6.99232832668655e-8,"cumulative_fraction":0.9996111240687492,"word":"禁衛","characters":[{"definition":["to endure","to prohibit\/to forbid"],"pinyin":["jin1","jin4"],"word":"禁"},{"definition":["surname Wei\/vassal state during the Zhou Dynasty (1066-221 BC), located in present day Henan and Hebei Provinces","to guard\/to protect\/to defend\/abbr. for 衛生|卫生, hygiene\/health\/abbr. for 衛生間|卫生间, toilet"],"pinyin":["Wei4","wei4"],"word":"衛"}],"containing_words":[{"definition":["imperial guard"],"pinyin":["jin4 wei4 jun1"],"word":"禁衛軍"}],"sentences":[{"english":"Palace guards' changing a rites is to be subjected to what visitor likes very much.","chinese":"禁衛軍的換崗儀式是很受遊人喜愛的。"},{"english":"He has been Colonel of the Welsh Guards since 1975.","chinese":"查爾斯於1975年開始擔任威爾士禁衛軍陸軍上校。"},{"english":"The power of emperor's guard troopswastheorganic constitute of Chinese ancient regality.","chinese":"禁衛軍權是中國古代專制君權的有機構成。"},{"english":"The platinum has Royal palace guards to stand guard before the temple.","chinese":"白金漢宮前有皇家禁衛軍站崗。"},{"english":"The power of emperor's guard troops was the organic constitute of Chinese ancient autarchical regality .","chinese":"禁衛軍權是中國古代專制君權的有機構成。"},{"english":"What early firearms were commonly used by the Janissaries?","chinese":"那麼，土耳其蘇丹禁衛軍早期通常都用什麼武器？"},{"english":"Qapukulu, 'court slaves', are household cavalry regiments loyal to the Sultan.","chinese":"宮廷衛隊爲土耳其禁衛騎兵，對蘇丹無比忠誠。"},{"english":"The main role of the Tabardariyya is to guard the Sultan and the palace.","chinese":"蘇丹禁衛軍主要職責爲保護蘇丹王室及蘇丹宮殿。"},{"english":"As praetorian prefect he is said to have had good judgement whenever he sought to act.","chinese":"身爲禁衛軍長官他在行動時有着良好的判斷力。"}],"related":[]}