{"definition":["welfare services"],"pinyin":["fu2 li4 shi4 ye4"],"simplified":["福利事业"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"福利事業","characters":[{"definition":["good fortune\/happiness\/luck","surname Fu\/abbr. for Fujian province 福建省[Fu2 jian4 sheng3]"],"pinyin":["Fu2","fu2"],"word":"福"},{"definition":["sharp\/favorable\/advantage\/benefit\/profit\/interest\/to do good to\/to benefit","surname Li"],"pinyin":["Li4","li4"],"word":"利"},{"definition":["matter\/thing\/item\/work\/affair\/CL:件[jian4],樁|桩[zhuang1],回[hui2]"],"pinyin":["shi4"],"word":"事"},{"definition":["line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already","surname Ye"],"pinyin":["Ye4","ye4"],"word":"業"}],"containing_words":[],"sentences":[{"english":"We will energetically develop social welfare programs.","chinese":"積極發展社會福利事業。"},{"english":"The issuance of the welfare lottery ticket directly pushed the development of the our country welfare worked.","chinese":"福利彩票的發行直接推動了我國福利事業的發展。"},{"english":"Other public and welfare undertakings in society that aim to promote social development and progress. IV.Other public welfare undertakings promoting social development and progress.","chinese":"促進社會發展和進步的其他社會公共和福利事業。"},{"english":"He devoted all his life to the cause of children's welfare.","chinese":"他把自己的一生獻給了兒童福利事業。"},{"english":"Public welfare was described by some people as \"bleeding the country white\".","chinese":"有些人把公共福利事業說成是“在使國家流盡鮮血”。"},{"english":"The house has been condemned for the use of public welfare.","chinese":"那房子已被徵作公共福利事業用了。"},{"english":"In most of the advanced countries, the welfare work is well-developed.","chinese":"在多數先進國家福利事業發展健全。"},{"english":"If you can't contribute money to charity, give time.","chinese":"如果你無法捐錢給福利事業，給你時間。"},{"english":"The pension system contributes to welfare through the intergenerational sharing of risks.","chinese":"養老金體系通過兩代間分擔風險而促進福利事業。"}],"related":[]}