{"definition":["to take orders\/to receive commands\/to carry on (a tradition)"],"pinyin":["bing3 cheng2"],"simplified":["秉承"],"rank":10060.0,"normalized_rank":0.14075245197487166,"fraction":0.00000818525749340226,"cumulative_fraction":0.9301910462645137,"word":"秉承","characters":[{"definition":["surname Bing","to grasp\/to hold\/to maintain"],"pinyin":["Bing3","bing3"],"word":"秉"},{"definition":["surname Cheng\/Cheng (c. 2000 BC), third of the legendary Flame Emperors 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","to bear\/to carry\/to hold\/to continue\/to undertake\/to take charge\/owing to\/due to\/to receive"],"pinyin":["Cheng2","cheng2"],"word":"承"}],"containing_words":[],"sentences":[{"english":"Door-to-door service is the consistent style of our shop.","chinese":"這部小說秉承了他一貫的沉抑風格。"},{"english":"Innovation is a recognized part of Motorola's 75-year heritage.","chinese":"年來，摩托羅拉一直秉承着創新的傳統。"},{"english":"YanChong adhering to the idea love is omnipotent, then use their cell phones the braille.","chinese":"言重秉承愛是無所不能的想法，便用手機拍下點字。"},{"english":"This may seem at odds with the value we place on relevant text-based ads.","chinese":"這似乎和我們秉承的文本關聯廣告模式有些衝突。"},{"english":"Shanghang talent network adhering to the \"people-centered innovation.\"","chinese":"上杭人才網秉承“以人爲中心，開拓創新。”"},{"english":"Huang Weimin's calligraphy bases on the tradition, to seek the aroma and be full of classic.","chinese":"黃衛民的書法，秉承傳統，追求古韻，蘊藉經典。"},{"english":"The principle of the Olympics must be upheld, that is, the Olympic Games should not be politicized.","chinese":"我們要秉承奧運會的宗旨，就是不能把奧運會政治化。"},{"english":"LSBF enjoys a stated mission to develop students to become global leaders.","chinese":"LSBF秉承以培養全球領袖爲目標的辦學理念。"},{"english":"She works in theatre, following in her father's footsteps.","chinese":"她秉承父業，也從事戲劇工作。"},{"english":"In imperial times, the critical tradition was carried forward by such scholars as Huang Zongxi.","chinese":"在帝王時代，黃宗羲等學者秉承批評傳統。"},{"english":"Like most of her recordings, both are issued by Sony Masterworks.","chinese":"秉承一貫傳統，由索尼古典音樂錄製及發行。"},{"english":"My hotel, too, had absorbed some of this ancient inertia.","chinese":"我住的旅館也秉承了某些古老的惰性。"},{"english":"The company always adheres to the quality policy of \"superior quality\".","chinese":"公司秉承“萬力優質”的質量方針。"},{"english":"He hoped that the Diet's Japan-China Friendship League could carry forward the friendly tradition and continue to play active role in this field.","chinese":"希望日中議聯秉承友好傳統，繼續發揮積極作用。"},{"english":"We work with integrity and put our best effort into every job.","chinese":"我們秉承誠信原則，對每一件事的傾注全力。"},{"english":"Fuyuan Chemical adheres to quality policy of\"quality first, customer first\".","chinese":"富苑化工秉承“質量爲本，用戶至上”的經營理念。"}],"related":[{"definition":["to uphold\/to hold fast to"],"pinyin":["bing3 chi2"],"word":"秉持"},{"definition":["idea\/concept\/philosophy\/theory"],"pinyin":["li3 nian4"],"word":"理念"},{"definition":["objective\/aim\/goal"],"pinyin":["zong1 zhi3"],"word":"宗旨"},{"definition":["based on...\/in conformance with..\/taking as one's main principle"],"pinyin":["ben3 zhe5"],"word":"本著"},{"definition":["people-oriented"],"pinyin":["yi3 ren2 wei2 ben3"],"word":"以人為本"},{"definition":["to scrupulously abide by"],"pinyin":["ke4 shou3"],"word":"恪守"},{"definition":["to practice\/to put into practice"],"pinyin":["jian4 xing2"],"word":"踐行"},{"definition":["to pursue (a course, a policy)"],"pinyin":["feng4 xing2"],"word":"奉行"},{"definition":["variant of 秉承[bing3 cheng2]"],"pinyin":["bing3 cheng2"],"word":"稟承"},{"definition":["consistent\/constant\/from start to finish\/all along\/persistent"],"pinyin":["yi1 guan4"],"word":"一貫"},{"definition":["traceable to the same stock (idiom); of a common origin (of trends, ideas etc)"],"pinyin":["yi1 mai4 xiang1 cheng2"],"word":"一脈相承"},{"definition":["to advocate\/to initiate\/to propose\/to be a proponent of (an idea or school of thought)"],"pinyin":["chang4 dao3"],"word":"倡導"},{"definition":["to follow\/to abide by\/to comply with\/compliance"],"pinyin":["zun1 xun2"],"word":"遵循"},{"definition":["to develop\/to make full use of"],"pinyin":["fa1 yang2"],"word":"發揚"},{"definition":["to implement\/to put into practice\/to carry out"],"pinyin":["guan4 che4"],"word":"貫徹"},{"definition":["to perfect sth that is already outstanding (idiom); constantly improving"],"pinyin":["jing1 yi4 qiu2 jing1"],"word":"精益求精"}]}