{"definition":["history of science"],"pinyin":["ke1 xue2 shi3"],"simplified":["科学史"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"科學史","characters":[{"definition":["branch of study\/administrative section\/division\/field\/branch\/stage directions\/family (taxonomy)\/rules\/laws\/to mete out (punishment)\/to levy (taxes etc)\/to fine sb\/CL:個|个[ge4]"],"pinyin":["ke1"],"word":"科"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"},{"definition":["history\/annals\/title of an official historian in ancient China","surname Shi"],"pinyin":["Shi3","shi3"],"word":"史"}],"containing_words":[],"sentences":[{"english":"That is absolutely unprecedented in American science.","chinese":"這在美國科學史上絕對是前所未聞的。"},{"english":"That is part of the wonder of evolutionary science.","chinese":"這是進化科學史的一個研究主題。"},{"english":"\"Internal History\" is still the mainstream, \"External History\" is increasing.","chinese":"內史仍是科學史的主流，外史在不斷增加。"},{"english":"Some books on science and the history of science are poorly written.","chinese":"有些科學或科學史圖書寫得非常糟糕。"},{"english":"Science history can also help students understand why scientific knowledge grows ever more accurate.","chinese":"科學史可以幫助學生理解科學知識正變得更加準確。"},{"english":"This has established the book of Erya as an important works in the world history of science.","chinese":"這奠定了《爾雅》一書是世界科學史上的重要著作。"},{"english":"He is the unsung hero of British science.","chinese":"他是英國科學史上未經讚美的英雄。"},{"english":"In the book, there are lot of penetrating analysis in many subjects especialy in the history of Chinese scientific thought.","chinese":"在具體科學史問題的研究上，該書也有許多重要突破。"},{"english":"We are also discussing possibilities for extending our programmes on the history of science.","chinese":"我們還在討論把我們的科學史項目加以擴展的可能性。"}],"related":[]}