{"definition":["Horqin or Xorchin, famous Mongolian archer\/Horqin district or Xorchin raion of Tongliao city 通遼市|通辽市[Tong1 liao2 shi4], Inner Mongolia"],"pinyin":["Ke1 er3 qin4"],"simplified":["科尔沁"],"rank":30843.0,"normalized_rank":0.4315335861094399,"fraction":8.73822074395526e-7,"cumulative_fraction":0.9910074471080484,"word":"科爾沁","characters":[{"definition":["branch of study\/administrative section\/division\/field\/branch\/stage directions\/family (taxonomy)\/rules\/laws\/to mete out (punishment)\/to levy (taxes etc)\/to fine sb\/CL:個|个[ge4]"],"pinyin":["ke1"],"word":"科"},{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"},{"definition":["to seep\/to percolate"],"pinyin":["qin4"],"word":"沁"}],"containing_words":[{"definition":["Horqin district or Xorchin raion of Tongliao city 通遼市|通辽市[Tong1 liao2 shi4], Inner Mongolia"],"pinyin":["Ke1 er3 qin4 qu1"],"word":"科爾沁區"},{"definition":["Ar Horqin banner or Aru Khorchin khoshuu in Chifeng 赤峰[Chi4 feng1], Inner Mongolia"],"pinyin":["A1 lu3 ke1 er3 qin4 qi2"],"word":"阿魯科爾沁旗"},{"definition":["Horqin right center banner, Mongolian Khorchin Baruun Garyn Dund khoshuu, in Hinggan league 興安盟|兴安盟[Xing1 an1 meng2], east Inner Mongolia"],"pinyin":["Ke1 er3 qin4 you4 yi4 zhong1 qi2"],"word":"科爾沁右翼中旗"},{"definition":["Horqin right front banner, Mongolian Khorchin Baruun Garyn Ömnöd khoshuu, in Hinggan league 興安盟|兴安盟[Xing1 an1 meng2], east Inner Mongolia"],"pinyin":["Ke1 er3 qin4 you4 yi4 qian2 qi2"],"word":"科爾沁右翼前旗"},{"definition":["Horqin Left Rear banner or Khorchin Züün Garyn Xoit khoshuu in Tongliao 通遼|通辽[Tong1 liao2], Inner Mongolia"],"pinyin":["Ke1 er3 qin4 zuo3 yi4 hou4 qi2"],"word":"科爾沁左翼後旗"},{"definition":["Horqin Left Middle banner or Khorchin Züün Garyn Dund khoshuu in Tongliao 通遼|通辽[Tong1 liao2], Inner Mongolia"],"pinyin":["Ke1 er3 qin4 zuo3 yi4 zhong1 qi2"],"word":"科爾沁左翼中旗"},{"definition":["Horqin Left Middle banner or Khorchin Züün Garyn Dund khoshuu in Tongliao 通遼|通辽[Tong1 liao2], Inner Mongolia"],"pinyin":["Ke1 er3 qin4 zuo3 yi4 zhong1"],"word":"科爾沁左翼中"},{"definition":["Horqin Left Rear banner or Khorchin Züün Garyn Xoit khoshuu in Tongliao 通遼|通辽[Tong1 liao2], Inner Mongolia"],"pinyin":["Ke1 er3 qin4 zuo3 yi4 hou4"],"word":"科爾沁左翼後"},{"definition":["Ar Horqin banner or Aru Khorchin khoshuu in Chifeng 赤峰[Chi4 feng1], Inner Mongolia"],"pinyin":["A1 lu3 ke1 er3 qin4"],"word":"阿魯科爾沁"}],"sentences":[{"english":"The northern part of Liaoning Province lies to the south of Kerqin Desert of Inner Mongolia.","chinese":"遼寧北部處於內蒙古科爾沁沙地“百里翰海”的南緣。"},{"english":"China travel, Inner Mongolia, Horqin, Xianghai wetland, drought. Photo by KaKa.","chinese":"中國旅遊，內蒙古，科爾沁，向海溼地，乾旱。"},{"english":"Zhuang concubine is a famous person of history.","chinese":"莊妃是歷史名人，而且是科爾沁左翼中旗人。"},{"english":"In the past, cultivation mainly led to activation of Korqin sandy land several times.","chinese":"墾殖也是過去科爾沁地區沙地幾度活化的主導因素。"},{"english":"Chapter four is the overall interpretation of inheritance of Horqin Mongol four-stringed instrument.","chinese":"第四章對科爾沁地區四胡文化傳承的整體闡釋。"},{"english":"China travel, Inner Mongolia, Horqin, a racetrack. Photo by KaKa.","chinese":"中國旅遊，內蒙古，科爾沁，一個賽馬場。"},{"english":"China travel, Inner Mongolia, Horqin prairie, horses and cattle.","chinese":"中國旅遊，內蒙古，科爾沁草原，馬匹。"},{"english":"China travel, Inner Mongolia, Horqin, a small town. Photo by KaKa.","chinese":"中國旅遊，內蒙古，科爾沁，一個小城鎮。"},{"english":"China travel, Inner Mongolia, Horqin prairie, beautiful birch forest. Photo by KaKa.","chinese":"中國旅遊，內蒙古，科爾沁草原，美麗的白樺林。"},{"english":"China travel, Inner Mongolia, Horqin, Donkey cart.","chinese":"中國旅遊，內蒙古科爾沁，驢車。"},{"english":"China travel, Inner Mongolia, Horqin, a small town.","chinese":"中國旅遊，內蒙古，科爾沁，野花。"},{"english":"In the process of formation and development, the narrative fork songs hadabsorbed non-verbal narrative arts and the narrative f.","chinese":"敘事民歌是具有科爾沁地域文化特徵的口頭敘事經典。"},{"english":"China travel, Inner Mongolia, Horqin Prairie, sunset in reservoir side. Photo by KaKa.","chinese":"中國旅遊，內蒙古，科爾沁草原，在水庫邊的日落。"},{"english":"China travel, Inner Mongolia, Horqin, a museum. Photo by KaKa.","chinese":"中國旅遊，內蒙古，科爾沁，一個博物館。"}],"related":[]}