{"definition":["imperial examination"],"pinyin":["ke1 ju3"],"simplified":["科举"],"rank":21012.0,"normalized_rank":0.29398514124214736,"fraction":0.000002154045861974671,"cumulative_fraction":0.977136371996692,"word":"科舉","characters":[{"definition":["branch of study\/administrative section\/division\/field\/branch\/stage directions\/family (taxonomy)\/rules\/laws\/to mete out (punishment)\/to levy (taxes etc)\/to fine sb\/CL:個|个[ge4]"],"pinyin":["ke1"],"word":"科"},{"definition":["to lift\/to hold up\/to cite\/to enumerate\/to act\/to raise\/to choose\/to elect\/act\/move\/deed"],"pinyin":["ju3"],"word":"舉"}],"containing_words":[{"definition":["imperial examination system"],"pinyin":["ke1 ju3 zhi4"],"word":"科舉制"},{"definition":["imperial examinations (in former times)"],"pinyin":["ke1 ju3 kao3 shi4"],"word":"科舉考試"}],"sentences":[{"english":"The fourth section analysis the literary work of people who walk into political field by examination.","chinese":"第四節分析評述科舉入仕之工商子弟的文學創作活動。"},{"english":"Selecting scholars from grass roots is an important approach in the Imperial Examination.","chinese":"鄉貢取士是科舉取士的重要途徑之一。"},{"english":"You have earned enough merit to pass the imperial examinations.","chinese":"你們的福報足以使你們通過科舉考試。"},{"english":"The imperial examination system's rise and fall, was closely related with our culture.","chinese":"科舉制度的盛衰，與我國文化傳統密切相關。"},{"english":"Mingfa is one of the subjects of imperial examinations in Tang Dynasty.","chinese":"明法是唐代科舉考試的科目之一。"},{"english":"The westward spread into Europe and America of the imperial examination system marked a great contribution of China to world civilization.","chinese":"科舉考試西傳歐美是中國對世界文明進程的一大貢獻。"},{"english":"Of course, this also is affected by the ancient Chinese imperial examinations.","chinese":"當然，這也受到古代科舉的影響。"},{"english":"I think mainly when taking a disability from the eight-legged essay in the examination system to explore.","chinese":"我以爲主要當從八股文取士的科舉制度中去探尋。"},{"english":"The Eight-part essay was one of the special styles for the Imperial Examination from Ming to Qing Dynasty.","chinese":"八股文是明清科舉考試最基本也是最重要的一種文體。"},{"english":"The academic honor plot nightmare which creates by the imperial civil service examination adheres to stickcohere equally likely on their body.","chinese":"由科舉造成的功名情節像夢魘一樣附着在他們身上。"},{"english":"Imperial selection started at the beginning of Sui Dynasty, so the tendency of examinations began to spread.","chinese":"在隋朝開始的科舉選才，應試之風開始蔓延。"},{"english":"In old China, this was where the academics from Yunnan province took their entrance exams for the imperial court.","chinese":"在舊中國，這裏是雲南參加朝廷的科舉考試的學院。"},{"english":"Poem and Fu is an important part of Imperial examination from Tang to Early Northern Song Dynasty.","chinese":"詩賦是唐代至宋初科舉考試中的重要內容。"},{"english":"The imperial examination system in the Tang Dynasty left a cross-age impact on the intellectual selection in China.","chinese":"唐代科舉制度在中國選士制度史上有着劃時代的意義。"},{"english":"The weak points of the imperial examination system cannot be regarded as the reason for negative rationality of the Eight - part Essay stylistic style.","chinese":"科舉制度的弊端不能成爲否定八股文體合理性的理由。"},{"english":"\"QingZhengYaZheng\" is the marking criterion for the Eight-part Essay of the Imperial examination in Qing Dynasty.","chinese":"“清真雅正”是清代科舉八股文的衡文標準。"}],"related":[{"definition":["imperial examinations (in former times)"],"pinyin":["ke1 ju3 kao3 shi4"],"word":"科舉考試"},{"definition":["graduate\/successful candidate in the imperial provincial examination"],"pinyin":["ju3 ren2"],"word":"舉人"},{"definition":["Imperial College of Supreme Learning, established in 124 BC, and the highest educational institute in ancient China until the Sui Dynasty"],"pinyin":["Tai4 xue2"],"word":"太學"},{"definition":["Zhengtong Emperor, reign name of sixth Ming Emperor Zhu Qizhen 朱祁鎮|朱祁镇[Zhu1 Qi2 zhen4] (1427-1464), reigned 1435-1449, Temple name Yingzong 英宗[Ying1 zong1]","orthodox"],"pinyin":["Zheng4 tong3","zheng4 tong3"],"word":"正統"},{"definition":["the current dynasty"],"pinyin":["guo2 chao2"],"word":"國朝"},{"definition":["to take an exam"],"pinyin":["ying4 shi4"],"word":"應試"},{"definition":["Zhang Zhidong (1837-1909), prominent politician in late Qing"],"pinyin":["Zhang1 Zhi1 dong4"],"word":"張之洞"},{"definition":["to compile and edit"],"pinyin":["bian1 xiu1"],"word":"編修"},{"definition":["reign name of Ming emperor (1573-1619)"],"pinyin":["Wan4 li4"],"word":"萬曆"},{"definition":["junior scholar or pupil in imperial China"],"pinyin":["hou4 xue2"],"word":"後學"},{"definition":["successful candidate in the highest imperial civil service examination\/palace graduate"],"pinyin":["jin4 shi4"],"word":"進士"},{"definition":["Kang Youwei (1858-1927), Confucian intellectual, educator and would-be reformer, main leader of the failed reform movement of 1898"],"pinyin":["Kang1 You3 wei2"],"word":"康有為"},{"definition":["Imperial College (or Academy), the highest educational body in imperial China"],"pinyin":["Guo2 zi3 jian4"],"word":"國子監"},{"definition":["to act as regent"],"pinyin":["she4 zheng4"],"word":"攝政"},{"definition":["Ministry of (Confucian) Rites (in imperial China)"],"pinyin":["Li3 bu4"],"word":"禮部"},{"definition":["place where the emperor listened to lectures (traditional)"],"pinyin":["jing1 yan2"],"word":"經筵"}]}