{"definition":["to transfer\/to hand over"],"pinyin":["yi2 jiao1"],"simplified":["移交"],"rank":6372.0,"normalized_rank":0.08915254711569404,"fraction":0.000016976030183027815,"cumulative_fraction":0.8865863436365484,"word":"移交","characters":[{"definition":["to move\/to shift\/to change\/to alter\/to remove"],"pinyin":["yi2"],"word":"移"},{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"}],"containing_words":[],"sentences":[{"english":"If a crime is constituted, he shall be transferred to the department of justice and subject to criminal liabilities.","chinese":"構成犯罪的，依法移交司法機關追究其刑事責任。"},{"english":"Then there is the problem that all transitions are bureaucratic nightmares.","chinese":"最後，移交是一個行政程序上的令人心悸的麻煩事。"},{"english":"The suspected drug dealer will be returned to the US on January 5.","chinese":"這名嫌犯將於1月5日被移交回美國。"},{"english":"Inquiry , indeed , is a work which devolves upon experts.","chinese":"探究確實是移交給專家的一項工作。"},{"english":"Involved in serious violations of law, the transfer of the judiciary.","chinese":"涉及嚴重違法違紀行爲的，移交司法部門處理。"},{"english":"For serious cases, will be handed over to the public security organs.","chinese":"對於情節嚴重者，會將線索移交給公安執法機關。"},{"english":"He has been conducted to police headquarters, where he is being subjected to a thorough examination.","chinese":"現在他已被移交警察總部接受徹查。"},{"english":"In the Agile development visualization shown in Figure 5, no \"handoffs\" can be seen.","chinese":"而在圖5所示的敏捷開發中，並沒有看到“移交物”。"},{"english":"\"Taking-Over Certificate\" means a certificate issued pursuant to Clause 48.","chinese":"“移交證書”指按照第48條之規定頒發的一種證書。"},{"english":"1984 - United Kingdom agrees handover of Hong Kong.","chinese":"1984年的今天，英國同意香港的移交。"},{"english":"So, Klaette like a prisoner of war as being transferred to the Issa hands.","chinese":"於是，科萊特又像戰俘一樣地被移交給了埃薩里。"},{"english":"If necessary, I hand over the situation to someone else and return later.","chinese":"如果有必要，我將事情移交給其他人，之後再回來。"},{"english":"His duties have been assumed by the Lieutenant Governor during his recovery.","chinese":"在地方官康復期間，他的權利已經移交給主管上尉。"},{"english":"It is believed that China is still building Mings, with 21 delivered so far.","chinese":"據信中國仍在製造明級，至今也移交了21艘。"},{"english":"Of those cases, 5,373 have been referred to the courts for criminal persecution.","chinese":"其中5373人已移交法院追究刑事責任。"},{"english":"It was Taiwan's second democratic transfer of power, after eight years of rule by the pro-independence party.","chinese":"這是臺灣第二次民主移交權力。"}],"related":[{"definition":["to transfer (a case, a person, files etc)"],"pinyin":["yi2 song4"],"word":"移送"},{"definition":["to pass on to sb\/to carry and give to sb else"],"pinyin":["zhuan3 jiao1"],"word":"轉交"},{"definition":["to handle\/to take care of\/to punish"],"pinyin":["chu3 zhi4"],"word":"處置"},{"definition":["to recover (illegally obtained property)\/to seize\/to capture\/to force sb to hand over sth\/to levy"],"pinyin":["shou1 jiao3"],"word":"收繳"},{"definition":["to detain\/to arrest\/to hold\/to confiscate"],"pinyin":["kou4 liu2"],"word":"扣留"},{"definition":["to detain\/to hold in custody\/to distrain\/to seize property"],"pinyin":["kou4 ya1"],"word":"扣押"},{"definition":["to return sth\/to hand back"],"pinyin":["jiao1 huan2"],"word":"交還"},{"definition":["to report, requesting approval\/written request for instructions"],"pinyin":["bao4 qing3"],"word":"報請"},{"definition":["to hand over\/to deliver"],"pinyin":["song4 jiao1"],"word":"送交"},{"definition":["to report to one's superiors\/to appear in the news\/to reply to a letter"],"pinyin":["shang4 bao4"],"word":"上報"},{"definition":["to incorporate\/to put under (external administration)"],"pinyin":["hua4 gui1"],"word":"劃歸"},{"definition":["to file for investigation\/to prosecute (a case)"],"pinyin":["li4 an4 zhen1 cha2"],"word":"立案偵查"},{"definition":["to destroy (by melting or burning)\/to obliterate"],"pinyin":["xiao1 hui3"],"word":"銷毀"},{"definition":["to recover (stolen property)\/to pursue and force sb to give back the spoils"],"pinyin":["zhui1 jiao3"],"word":"追繳"},{"definition":["legal (proceedings)\/according to law"],"pinyin":["yi1 fa3"],"word":"依法"},{"definition":["according to the law"],"pinyin":["an4 zhao4 fa3 lu:4"],"word":"按照法律"}]}