{"definition":["degree (level or extent)\/level\/CL:個|个[ge4]"],"pinyin":["cheng2 du4"],"simplified":["程度"],"rank":726.0,"normalized_rank":0.010157681921844613,"fraction":0.0002125478040397791,"cumulative_fraction":0.5692860909986017,"word":"程度","characters":[{"definition":["rule\/order\/regulations\/formula\/journey\/procedure\/sequence","surname Cheng"],"pinyin":["Cheng2","cheng2"],"word":"程"},{"definition":["to estimate\/Taiwan pr. [duo4]","to pass\/to spend (time)\/measure\/limit\/extent\/degree of intensity\/degree (angles, temperature etc)\/kilowatt-hour\/classifier for events and occurrences"],"pinyin":["du4","duo2"],"word":"度"}],"containing_words":[{"definition":["contamination meter"],"pinyin":["zhan1 ran3 cheng2 du4 jian3 cha2 yi2"],"word":"沾染程度檢查儀"},{"definition":["transparency"],"pinyin":["tou4 ming2 cheng2 du4"],"word":"透明程度"}],"sentences":[{"english":"However, satisfaction also appears to be influenced by psychologic factors.","chinese":"然而，滿意程度似乎也是整個身體的影響因素之一。"},{"english":"For degree of differentiation, Shitanhu population is higher than that of Gutang population.","chinese":"分化程度石潭湖羣體高於古塘羣體。"},{"english":"In some extend, I am not a hypercritical person about food.","chinese":"在某種程度上，我對於食物是一點都不挑剔的。"},{"english":"Pollution levels fall during nightime.","chinese":"夜晚的污染程度則會下降。"},{"english":"Any deviation from this ideal must be penalized to the extent of the deviation.","chinese":"任何偏離這個理想，必須扣分的偏差程度。"},{"english":"It is simply that the tactic should always respond to the rival in the way that astonishes him most.","chinese":"就是說一個戰術應該最大程度地引起對手的驚訝。"},{"english":"The amount of electrolyte leakage was highly related to the treating time and concentration of toxin.","chinese":"且電解質外滲的程度與毒素濃度和處理時間呈正比。"},{"english":"The higher the anode is humidified , the more water will migrate from anode to cathode.","chinese":"陽極增溼程度越大，由陽極向陰極遷移的水量越多。"},{"english":"Light the degree of coloring for object is called color rendering.","chinese":"光源對於物體顏色呈現的程度稱爲顯色性。"},{"english":"These characteristics are found, though in a lesser degree, in the bitch.","chinese":"這些特徵在雌性身上也有，只是程度略輕一些。"},{"english":"She clings to Monty to the point he doesn't have any time alone.","chinese":"她粘蒙提甚至到了根本不給他任何獨處的時間的程度。"},{"english":"Your goal is to mitigate the risks of exploiting vulnerabilities to an acceptable level.","chinese":"您的目標是將漏洞被利用的風險減輕到可接受的程度。"},{"english":"The Observatory explained that the average wind speed in Victoria Harbour did not reach storm force level.","chinese":"天文臺解釋，是維港港內普遍風速未達烈風程度。"},{"english":"When the women reached age 40, Leupp measured their levels of depression .","chinese":"等到她們40歲時，萊普分別測試她們的抑鬱程度。"},{"english":"Therefore, these auto market pussyfooter, will affect Hangzhou city auto market to a great extent.","chinese":"因此，這些車市觀望者，將很大程度上影響杭城車市。"},{"english":"Which class level would you like to enroll in?","chinese":"你預定想念哪一個程度的班別？"}],"related":[{"definition":["stage\/degree (to which a situation has evolved)\/situation\/leeway"],"pinyin":["di4 bu4"],"word":"地步"},{"definition":["from this, it can be seen that..."],"pinyin":["you2 ci3 ke3 jian4"],"word":"由此可見"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["layer\/level\/gradation\/arrangement of ideas\/(a person's) standing"],"pinyin":["ceng2 ci4"],"word":"層次"},{"definition":["equivalent to\/appropriate\/considerably\/to a certain extent\/fairly\/quite"],"pinyin":["xiang1 dang1"],"word":"相當"},{"definition":["next\/secondly"],"pinyin":["qi2 ci4"],"word":"其次"},{"definition":["level (of achievement etc)\/standard\/horizontal"],"pinyin":["shui3 ping2"],"word":"水平"},{"definition":["it is obvious that...\/as one can well imagine..."],"pinyin":["ke3 xiang3 er2 zhi1"],"word":"可想而知"},{"definition":["as for\/as to\/to go so far as to"],"pinyin":["zhi4 yu2"],"word":"至於"},{"definition":["aim\/clear","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","really and truly","see 的士[di1 shi4]"],"pinyin":["de5","di1","di2","di4"],"word":"的"},{"definition":["even\/so much so that"],"pinyin":["shen4 zhi4"],"word":"甚至"},{"definition":["condition\/state\/situation\/CL:個|个[ge4]"],"pinyin":["zhuang4 kuang4"],"word":"狀況"},{"definition":["it can clearly be seen (that this is the case)\/it is (thus) clear\/clear\/visible"],"pinyin":["ke3 jian4"],"word":"可見"},{"definition":["surely\/certainly\/necessarily\/fixed\/a certain (extent etc)\/given\/particular\/must"],"pinyin":["yi1 ding4"],"word":"一定"},{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["regarding\/as far as sth is concerned\/with regards to"],"pinyin":["dui4 yu2"],"word":"對於"}]}