{"definition":["Cheng Yaojin (589-665), aka 程知節|程知节[Cheng2 Zhi1 jie2], Chinese general of the Tang dynasty"],"pinyin":["Cheng2 Yao3 jin1"],"simplified":["程咬金"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"程咬金","characters":[{"definition":["rule\/order\/regulations\/formula\/journey\/procedure\/sequence","surname Cheng"],"pinyin":["Cheng2","cheng2"],"word":"程"},{"definition":["to bite\/to nip"],"pinyin":["yao3"],"word":"咬"},{"definition":["gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)"],"pinyin":["Jin1","jin1"],"word":"金"}],"containing_words":[{"definition":["lit. Cheng Yaojin ambushes the enemy (saying)\/fig. sb shows up unexpectedly and disrupts the plan\/sb whose presence is regarded as irksome"],"pinyin":["ban4 lu4 sha1 chu1 ge4 Cheng2 Yao3 jin1"],"word":"半路殺出個程咬金"},{"definition":["see 半路殺出個程咬金|半路杀出个程咬金[ban4 lu4 sha1 chu1 ge4 Cheng2 Yao3 jin1]"],"pinyin":["ban4 lu4 sha1 chu1 de5 Cheng2 Yao3 jin1"],"word":"半路殺出的程咬金"}],"sentences":[{"english":"Cheng bite gold face flower feet still be firm.","chinese":"程咬金面對花大腳依然態度堅決。"},{"english":"Things HouCheng bite gold and during the meeting.","chinese":"事後程咬金與李世民相遇。"},{"english":"Cheng bite gold smell speech secretly urged QinQiong show identity.","chinese":"程咬金聞言暗中催促秦瓊表露身份。"},{"english":"See cheng bite gold was almost will face posted on their own feet.","chinese":"看到程咬金竟然差點將臉貼到自己的腳丫上。"},{"english":"Cheng bite gold is carrying big head. it said he will guard the during.","chinese":"程咬金卻是提着大板斧表示自己要護衛李世民到底。"},{"english":"The next day, cheng bite gold etc are counsel how to take over the unique to the site.","chinese":"隔天，程咬金等人正在商議如何接管瞿讓的地盤。"},{"english":"Cheng bite gold in flower bigfoot under persecution finally with the couple.","chinese":"程咬金在花大腳的逼迫之下終於跟其成婚。"},{"english":"Marriage that night, cheng bite gold to draw up three chapters.","chinese":"婚事當晚，程咬金欲約法三章。"},{"english":"Tang wall and cheng bite play gold few rounds.","chinese":"唐壁與程咬金交手沒幾個回合。"},{"english":"In the belly hungry, but poorer path bite gold think out money fast trick.","chinese":"肚中飢餓，但囊中羞澀的程咬金想出來錢快的鬼點子。"},{"english":"Late at night, cheng bite gold and flower feet in bed play play.","chinese":"深夜，程咬金與花大腳在牀上嘻戲。"},{"english":"Cheng bite gold in the village that war.","chinese":"程咬金在寨外叫戰。"},{"english":"Just want to pull a long process bite gold, but female manager came after.","chinese":"正想拉住程咬金長談一番，不料女掌櫃追了過來。"},{"english":"In order to dodge the flower feet, cheng bite toll lucheng state.","chinese":"爲了躲開花大腳，程咬金來到了潞州。"},{"english":"Cheng bite gold dispatching a hand came to McCullough has dwellings.","chinese":"程咬金調派一個手下來到羅成住處。"},{"english":"Cheng bite, such as gold heart know Yang ling is to kill QinQiong.","chinese":"程咬金等人心知楊林是想殺掉秦瓊。"}],"related":[{"definition":["Di Renjie (607-700), Tang dynasty politician, prime minister under Wu Zetian, subsequently hero of legends\/master sleuth Judge Dee, aka Chinese Sherlock Holmes, in novel Three murder cases solved by Judge Dee 狄公案[Di2 gong1 an4] translated by Dutch sinologist R.H. van Gulik 高羅珮|高罗佩[Gao1 Luo2 pei4]"],"pinyin":["Di2 Ren2 jie2"],"word":"狄仁傑"},{"definition":["Zhang Fei (168-221), general of Shu and blood-brother of Liu Bei in Romance of the Three Kingdoms, famous as fearsome fighter and lover of wine"],"pinyin":["Zhang1 Fei1"],"word":"張飛"},{"definition":["Diaochan (-192), one of the four legendary beauties 四大美女[si4 da4 mei3 nu:3], in fiction a famous beauty at the break-up of Han dynasty, given as concubine to usurping warlord Dong Zhuo 董卓[Dong3 Zhuo2] to ensure his overthrow by fighting hero Lü Bu 呂布|吕布[Lu:3 Bu4]"],"pinyin":["Diao1 Chan2"],"word":"貂蟬"},{"definition":["Huang Zhong (-220), general of Shu in Romance of the Three Kingdoms, portrayed as an old fighter"],"pinyin":["Huang2 Zhong1"],"word":"黃忠"},{"definition":["Han Xin (-196 BC), famous general of first Han emperor Liu Bang 劉邦|刘邦[Liu2 Bang1]"],"pinyin":["Han2 Xin4"],"word":"韓信"},{"definition":["Guan Yu (-219), general of Shu and blood-brother of Liu Bei in Romance of the Three Kingdoms, fearsome fighter famous for virtue and loyalty\/posthumously worshipped and identified with the guardian Bodhisattva Sangharama"],"pinyin":["Guan1 Yu3"],"word":"關羽"},{"definition":["Lü Bu (-198), general and warlord"],"pinyin":["Lu:3 Bu4"],"word":"呂布"},{"definition":["Zhong Kui (mythological figure, supposed to drive away evil spirits)\/(fig.) a person with the courage to fight against evil"],"pinyin":["Zhong1 Kui2"],"word":"鍾馗"},{"definition":["Ying Zheng (260-210 BC), personal name of the first emperor 秦始皇[Qin2 Shi3 huang2]"],"pinyin":["Ying2 Zheng4"],"word":"嬴政"},{"definition":["Zhao Yun (-229), general of Shu in Romance of the Three Kingdoms"],"pinyin":["Zhao4 Yun2"],"word":"趙雲"},{"definition":["Lu Ban, legendary master craftsman, called the father of Chinese carpentry"],"pinyin":["Lu3 Ban1"],"word":"魯班"},{"definition":["Sun Bin (-316 BC), political strategist of the School of Diplomacy 縱橫家|纵横家[Zong4 heng2 jia1] during the Warring States Period (425-221 BC)"],"pinyin":["Sun1 Bin4"],"word":"孫臏"},{"definition":["Dharma, the teaching of Buddha\/Bodhidharma"],"pinyin":["Da2 mo2"],"word":"達摩"},{"definition":["秦越人[Qin2 Yue4 ren2] (407-310 BC), Warring States physician known for his medical skills, nicknamed Bian Que after the earliest known Chinese physician allegedly from the 黃帝|黄帝[Huang2 di4] era"],"pinyin":["Bian3 Que4"],"word":"扁鵲"},{"definition":["Bai Qi (-258 BC), famous general of Qin 秦國|秦国, the victor at 長平|长平 in 260 BC\/same as 公孫起|公孙起"],"pinyin":["Bai2 Qi3"],"word":"白起"},{"definition":["Houyi, mythological Chinese archer whose wife was Chang'e"],"pinyin":["Hou4 Yi4"],"word":"后羿"}]}