{"definition":["racist (person)"],"pinyin":["zhong3 zu2 zhu3 yi4 zhe3"],"simplified":["种族主义者"],"rank":54678.0,"normalized_rank":0.765016159948512,"fraction":8.466702357992066e-8,"cumulative_fraction":0.999486508953771,"word":"種族主義者","characters":[{"definition":["seed\/species\/kind\/type\/classifier for types, kinds, sorts","to plant\/to grow\/to cultivate"],"pinyin":["zhong3","zhong4"],"word":"種"},{"definition":["race\/nationality\/ethnicity\/clan\/by extension, social group (e.g. office workers 上班族)"],"pinyin":["zu2"],"word":"族"},{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"},{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["Yi4","yi4"],"word":"義"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"The white racists tried to keep down the Indians by force.","chinese":"白人種族主義者企圖用武力壓服印第安人。"},{"english":"He has been branded anti-Semitic and a racist by a British judge.","chinese":"一位英國法官宣佈其爲反猶分子和種族主義者。"},{"english":"He says accusations of racism are smears that he has come to expect.","chinese":"他認爲指控他爲種族主義者是對他的意圖進行醜化。"},{"english":"\"This guy is, I believe, a racist, \" Beck said.","chinese":"貝克說“我認爲，這個人是一個種族主義者。”"},{"english":"Just that I'm racist.","chinese":"只因我是個種族主義者。"},{"english":"My mother was a straight-up-and-down racist of a very marked kind.","chinese":"我母親是一個徹頭徹尾的明顯型種族主義者。"},{"english":"Indians who live in Australia is under threat from racists.","chinese":"在澳大利亞的印度人受到來自種族主義者的威脅。"},{"english":"Hatemongering is the predominant idea in the book by a racist.","chinese":"在種族主義者寫的書中，煽動仇恨是主要的觀點。"},{"english":"But conservatives and rightwingers are not the only racists.","chinese":"但是保守主義者和右翼分子並非唯一的種族主義者。"},{"english":"Callingflag waving \"racist\" is laughable.","chinese":"把國旗揮舞稱爲“種族主義者”是可笑的。"},{"english":"Even the racialist find it difficult to make out a case for apartheid.","chinese":"甚至種族主義者也很難提出有利於種族隔離的理由。"},{"english":"The embassy was attacked by a few radical racialists.","chinese":"大使館受到了幾個激進的種族主義者的襲擊。"}],"related":[]}