{"definition":["to be called\/to be known as"],"pinyin":["cheng1 zuo4"],"simplified":["称做"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"稱做","characters":[{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"},{"definition":["to do\/to make\/to produce\/to write\/to compose\/to act as\/to engage in\/to hold (a party)\/to be\/to become\/to function (in some capacity)\/to serve as\/to be used for\/to form (a bond or relationship)\/to pretend\/to feign\/to act a part\/to put on appearance"],"pinyin":["zuo4"],"word":"做"}],"containing_words":[],"sentences":[{"english":"More than 80 percent of the facilities will be built around the Fourth Ring Road .","chinese":"以上的場館建在被稱做“申奧大道”的四環路周圍。"},{"english":"At is time the subject of topology was known as analysis situs .","chinese":"在這個時候，拓撲學被稱做位置幾何學。"},{"english":"Such an attack is termed syncope.","chinese":"象這樣的病我們就稱做暈厥。"},{"english":"They're the \"four wonders\" of Mount Huangshan.","chinese":"他們稱做黃山的“四絕”。"},{"english":"Turquoise, steel and royal blue are called the three iridescent colors.","chinese":"藍綠色，金屬色及皇家藍色被稱做三閃光色。"},{"english":"Two-year colleges in the United States are also known as community colleges.","chinese":"在美國，兩年制的大學也稱做社區學院。"},{"english":"Their heads also hold large quantities of a substance called spermaceti.","chinese":"它們的大腦中還有大量的一種被稱做鯨腦的物質。"},{"english":"He tugged the camels to make them get up.","chinese":"駱駝又被稱做“沙漠之舟。”"},{"english":"It is a conundrum in game theory known as a prisoner's dilemma.","chinese":"這在搏弈理論中被稱做囚徒的困境。"},{"english":"This was termed the plum pudding model.","chinese":"這被稱做棗糕布丁模型。"},{"english":"To the people who called us conspiracy nuts, whatcha think now.","chinese":"那些把我們稱做陰謀論瘋子的人現在怎麼想？"},{"english":"The Dongba characters are also called the Naxi pictographic characters.","chinese":"所以東巴文也稱做納西象形文字。"},{"english":"Pinto's ability is called \"globe luxation.","chinese":"平託的這種能力通常被稱做“眼球脫臼”。"},{"english":"Bit-mapped graphics are often called raster graphics.","chinese":"位映像經常被稱做光柵圖形。"},{"english":"Cats would have been more appropriate than tigers.","chinese":"將我們這幾個人稱做貓比虎更貼切。"},{"english":"This pitch-and-rhythm variation, known as prosody, conveys emotion.","chinese":"這種我們稱做聲調的節奏與音調變化常常傳達着情感。"}],"related":[]}