{"definition":["to express thanks"],"pinyin":["cheng1 xie4"],"simplified":["称谢"],"rank":45754.0,"normalized_rank":0.6401578218348187,"fraction":2.2188599283013692e-7,"cumulative_fraction":0.9981930928760993,"word":"稱謝","characters":[{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"},{"definition":["surname Xie","to thank\/to apologize\/to wither (of flowers, leaves etc)\/to decline"],"pinyin":["Xie4","xie4"],"word":"謝"}],"containing_words":[],"sentences":[{"english":"I will give you thanks, for you answered me; you have become my salvation.","chinese":"我要稱謝你，因爲你已經應允我，又成了我的拯救。"},{"english":"5 who by his understanding made the heavens, His love endures forever.","chinese":"稱謝那用智慧造天的，因他的慈愛永遠長存。"},{"english":"Rejoice in the LORD, ye righteous; and give thanks at the remembrance of his holiness.","chinese":"你們義人當靠耶和華歡喜，稱謝他可記念的聖名。"},{"english":"Give thanks to the God of heaven. His love endures forever.","chinese":"你們要稱謝天上的神，因他的慈愛永遠長存。"},{"english":"Praise the LORD with harp: sing unto him with the psaltery and an instrument of ten strings.","chinese":"你們應當彈琴稱謝耶和華，用十弦瑟歌頌他。"},{"english":"I will praise you, O Lord , among the nations; I will sing of you among the peoples.","chinese":"耶和華阿，我要在萬民中稱謝你，在列邦中歌頌你。"},{"english":"13 to him who divided the Red Sea asunder His love endures forever.","chinese":"稱謝那分裂紅海的，因他的慈愛永遠長存。"},{"english":"O give thanks unto the God of heaven: for his mercy endureth for ever.","chinese":"你們要稱謝天上的神，因他的慈愛永遠長存。"},{"english":"To him that stretched out the earth above the waters: for his mercy endureth for ever.","chinese":"稱謝那鋪地在水以上的，因他的慈愛永遠長存。"},{"english":"7 who made the great lights- His love endures forever.","chinese":"稱謝那造成大光的，因他的慈愛永遠長存。"},{"english":"To him which divided the Red sea into parts: for his mercy endureth for ever","chinese":"稱謝那分裂紅海的，因他的慈愛永遠長存。"},{"english":"O give thanks unto the God of gods: for his mercy endureth for ever.","chinese":"你們要稱謝萬神之神，因他的慈愛永遠長存。"},{"english":"I will praise you with an upright heart as I learn your righteous laws.","chinese":"我學了你公義的判語，就要以正直的心稱謝你。"},{"english":"O Lord my God, I will give you thanks forever.","chinese":"耶和華我的神阿，我要稱謝你，直到永遠。"},{"english":"To him that by wisdom made the heavens: for his mercy endureth for ever.","chinese":"稱謝那用智慧造天的，因他的慈愛永遠長存。"},{"english":"Therefore will I give thanks unto thee, O LORD, among the heathen, and sing praises unto thy name.","chinese":"耶和華阿，因此我要在外邦中稱謝你，歌頌你的名。"}],"related":[{"definition":["to refute\/to demolish (an argument, theory etc)"],"pinyin":["bo2 dao3"],"word":"駁倒"},{"definition":["to bow before (idiom)\/to capitulate"],"pinyin":["fu3 shou3 cheng1 chen2"],"word":"俯首稱臣"},{"definition":["hiding place\/hideout"],"pinyin":["cang2 shen1 zhi1 chu4"],"word":"藏身之處"},{"definition":["out of ammunition and no food left (idiom); in desperate straits"],"pinyin":["dan4 jin4 liang2 jue2"],"word":"彈盡糧絕"},{"definition":["to whisper to one another's ear"],"pinyin":["jiao1 tou2 jie1 er3"],"word":"交頭接耳"},{"definition":["to meet on the battlefield (idiom)"],"pinyin":["bing1 rong2 xiang1 jian4"],"word":"兵戎相見"},{"definition":["lit. killing the chicken to warn the monkey (idiom)\/fig. to punish an individual as an example to others\/pour encourager les autres"],"pinyin":["sha1 ji1 jing3 hou2"],"word":"殺雞儆猴"},{"definition":["to obstruct\/to impede"],"pinyin":["zu3 rao3"],"word":"阻擾"},{"definition":["lit. to settle accounts after autumn\/settle scores at an opportune moment (idiom)"],"pinyin":["qiu1 hou4 suan4 zhang4"],"word":"秋後算賬"},{"definition":["38th parallel, forming the DMZ border between North and South Korea"],"pinyin":["san1 ba1 xian4"],"word":"三八線"},{"definition":["to take the blame for sb else\/to compensate for one's crime\/to get charges dropped (by paying money etc)"],"pinyin":["ding3 zui4"],"word":"頂罪"},{"definition":["(jocularly) public building that has been lying idle (and is thus ideal for housing mosquitos) (Tw)"],"pinyin":["wen2 zi5 guan3"],"word":"蚊子館"},{"definition":["obscene language"],"pinyin":["hui4 yu3"],"word":"穢語"},{"definition":["the last of the three entry-level exams in the imperial examination system of Ming and Qing dynasties"],"pinyin":["yuan4 shi4"],"word":"院試"},{"definition":["lit. not even the chickens and dogs are left undisturbed (idiom)\/fig. great commotion\/pandemonium"],"pinyin":["ji1 quan3 bu4 ning2"],"word":"雞犬不寧"},{"definition":["to undress"],"pinyin":["kuan1 yi1 jie3 dai4"],"word":"寬衣解帶"}]}