{"definition":["to commend\/to praise"],"pinyin":["cheng1 dao4"],"simplified":["称道"],"rank":14605.0,"normalized_rank":0.20434289871699804,"fraction":0.0000043432723320230685,"cumulative_fraction":0.9573571540278796,"word":"稱道","characters":[{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"}],"containing_words":[],"sentences":[{"english":"Only in Canada are people celebrated for saying no.","chinese":"只有在加拿大，會因說“不”而爲人稱道。"},{"english":"The two south and the north of the developers really commendable development.","chinese":"上述一南一北兩個樓盤的開發商確實值得稱道。"},{"english":"But what it is best known for is its images.","chinese":"但是它最爲人所稱道的是雜誌中的精美圖片。"},{"english":"This is referred to as the Confucian Road \"music rituals\" of the theme.","chinese":"這就是爲儒家所稱道的“制禮作樂”的主題思想。"},{"english":"Misers are no fun to live,but they make great ancestors.","chinese":"與吝嗇鬼生活毫無樂趣，但他們卻爲後人稱道不已。"},{"english":"Most frequently cited plus-points among expat readers are the levels of cleanliness and safety on Tokyo’s streets.","chinese":"東京最被人稱道的地方是乾淨而安全的街道。"},{"english":"Are lying in their lowly beds, with the fair and good of ours.","chinese":"帶着我們稱道的美麗和善良，低臥土牀板。"},{"english":"The method of his organisation work is worth commending.","chinese":"他的組織工作的方法值得稱道。"},{"english":"The German chancellor's leadership in shoring up Europe's finances is commendable.","chinese":"德國總理在重組歐洲金融中所起的領導作用值得稱道。"},{"english":"It is really exciting to be able to get a passport in an even shorter time than the time spent in buying a train ticket.","chinese":"辦本護照比買張火車票還容易，實在令人稱道。"},{"english":"Thou sayest, Men cannot admire the sharpness of thy wits.","chinese":"你說，你的智慧無法讓衆人稱道。"},{"english":"His moral character and habits are praiseworthy .","chinese":"他的道德品質和性情值得稱道。"},{"english":"He claimed that the weapons had been planted on him.","chinese":"他稱道，那武器是別人給他栽的贓。"},{"english":"Misers are no fun to live with, but they make great ancestors.","chinese":"與吝嗇鬼生活毫無樂趣，但他們卻爲後人稱道不已。"},{"english":"The Parisian police, so much extolled for acumen, are cunning, but no more.","chinese":"巴黎警察一向以智慧稱道於世，實在不外是桀黠罷了。"},{"english":"This will let you discover all the genuinely nice things about people.","chinese":"這會讓你發現他人身上所有美好的，值得稱道的優點。"}],"related":[]}