{"definition":["lit. to proclaim oneself hegemon\/to take a leading role\/to build a personal fiefdom"],"pinyin":["cheng1 ba4"],"simplified":["称霸"],"rank":17578.0,"normalized_rank":0.2459390259258741,"fraction":0.000003073121000697396,"cumulative_fraction":0.968255548920562,"word":"稱霸","characters":[{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"},{"definition":["hegemon\/tyrant\/lord\/feudal chief\/to rule by force\/to usurp\/(in modern advertising) master"],"pinyin":["ba4"],"word":"霸"}],"containing_words":[],"sentences":[{"english":"Therefore, the non-hegemony is the inevitable choice of China for the…","chinese":"從四個方面來看，不稱霸是中國必然的選擇。"},{"english":"He tyrannizes his family.","chinese":"他在家裏稱王稱霸。"},{"english":"The sun is entering your sign, and the next four weeks will be your personal New Year.","chinese":"日座進入處女，未來四周是你稱王稱霸的日子。"},{"english":"Who says Russia's going to help China with her global ambitions?","chinese":"誰說俄羅斯會幫中國實現稱霸全球的野心啊？"},{"english":"In 1950 Britain dominated the global automotive market.","chinese":"1950年英國稱霸於全球汽車市場。"},{"english":"Did not ourselves the cubits warp, for fear to be a king.","chinese":"不正是我們自己歪曲了度量，不敢稱王稱霸。"},{"english":"Michael Jordan used to reign as the number one basketball player in NBA.","chinese":"邁克爾喬丹曾是稱霸籃壇第一把交椅的球員。"},{"english":"Gone are the days when a big nation could king it over small ones.","chinese":"大國可以對小國稱王稱霸的日子已經一去不復返了。"},{"english":"China will dominate them or not after rising made them apprehensions.","chinese":"中國崛起後會不會稱霸等無不給他們疑懼。"},{"english":"They will be able to come and go without obstacles, characteristic of an army that belongs to a king or hegemon.","chinese":"能夠進退無阻的軍隊，那就是圖王稱霸的軍隊了。"},{"english":"Gone are the days when a big nation could lord it over small ones.","chinese":"大國可以對小國稱王稱霸的日子已經一去不復返了。"},{"english":"The war menace grows out of their attempt to dominate the world.","chinese":"戰爭威脅來自他們稱霸世界的企圖。"},{"english":"China will never seek hegemony and never go in for expansion.","chinese":"中國永遠不稱霸，永遠不搞擴張。"},{"english":"When he’s done, he goes to China and becomes the top man there.","chinese":"稱霸之後，他又移師中國，十年成爲業界領頭羊。"},{"english":"So English is Taking Over the Globe. So What?","chinese":"英語稱霸全球了。那有什麼了不起？"},{"english":"Quartz-crystal technology did not remain the premier frequency standard for long either, however.","chinese":"不過石英鐘技術稱霸計時標準的壽命也不長。"}],"related":[{"definition":["to march\/to advance"],"pinyin":["jin4 jun1"],"word":"進軍"},{"definition":["to aspire to the throne\/to aim at (the first place etc)"],"pinyin":["wen4 ding3"],"word":"問鼎"},{"definition":["campaign\/expedition"],"pinyin":["zheng1 zhan4"],"word":"征戰"},{"definition":["domain\/territory"],"pinyin":["ban3 tu2"],"word":"版圖"},{"definition":["to seize\/to capture\/to wrest control of"],"pinyin":["duo2 qu3"],"word":"奪取"},{"definition":["champion\/CL:個|个[ge4]"],"pinyin":["guan4 jun1"],"word":"冠軍"},{"definition":["to fight over\/to contest\/to vie over"],"pinyin":["zheng1 duo2"],"word":"爭奪"},{"definition":["to seize\/to take away forcibly\/to wrest control of\/to compete or strive for\/to force one's way through\/to leave out\/to lose"],"pinyin":["duo2"],"word":"奪"},{"definition":["(ironically) mainland China (Taiwan & Hong Kong usage)","powerful country\/great power"],"pinyin":["Qiang2 guo2","qiang2 guo2"],"word":"強國"},{"definition":["the man (or woman) of the moment (idiom)\/influential figure"],"pinyin":["feng1 yun2 ren2 wu4"],"word":"風雲人物"},{"definition":["to occupy\/to hold"],"pinyin":["zhan4 ju4"],"word":"佔據"},{"definition":["lit. only one branch of the tree is thriving (idiom)\/fig. to be in a league of one's own\/outstanding"],"pinyin":["yi1 zhi1 du2 xiu4"],"word":"一枝獨秀"},{"definition":["to defeat\/to overpower\/to beat\/to be defeated"],"pinyin":["da3 bai4"],"word":"打敗"},{"definition":["wind direction\/the way the wind blows\/fig. trend\/direction of events\/how things develop (esp. how they affect oneself)\/public opinion (concerning one's actions)\/publicity (usually derog.)\/limelight"],"pinyin":["feng1 tou2"],"word":"風頭"},{"definition":["to rely on\/to depend on\/by means of\/thanks to\/sth that one relies on\/also written 憑借|凭借[ping2 jie4]"],"pinyin":["ping2 jie4"],"word":"憑藉"},{"definition":["to fight in one place after another"],"pinyin":["zhuan3 zhan4"],"word":"轉戰"}]}