{"definition":["rice husk"],"pinyin":["dao4 ke2"],"simplified":["稻壳"],"rank":46775.0,"normalized_rank":0.6544429364935009,"fraction":1.9984337117398514e-7,"cumulative_fraction":0.9984082622923408,"word":"稻殼","characters":[{"definition":["paddy\/rice (Oryza sativa)"],"pinyin":["dao4"],"word":"稻"},{"definition":["shell\/carapace\/crust (earth's crust etc)\/also pr. [ke2]"],"pinyin":["qiao4"],"word":"殼"}],"containing_words":[],"sentences":[{"english":"Here is Dostoyevsky wrestling with God, Melville with nothingness, Douglas with slavery … In a culture of chaff, here is the wheat.","chinese":"在一個由稻殼組成的文化中，這裏就是稻穀。"},{"english":"The rice husk is a ligneous hard layer of the cereal with high silicate content.","chinese":"稻殼灰是具有高硅酸鹽含量的穀類的一種木質的硬層。"},{"english":"This brings us back to Polish scientist Casimir Funk and the link between rice hulls and beriberi.","chinese":"這又使得我們談到芬克以及稻殼和腳氣之間的關係。"},{"english":"She was pounding it in a mortar with a pestle, to separate the husks.","chinese":"她把稻米放入臼鉢裏，用杵搗着，以分離稻殼。"},{"english":"The rice huck is reused in the ferment. The residue is used as the livestock feed.","chinese":"稻殼用於回糠制酒，糧渣是畜禽精飼料。"},{"english":"Increasing RHA fineness would enhance the strength and durability of blended concrete.","chinese":"增加稻殼灰的細度可提高混凝土的強度和耐久性。"},{"english":"Adding the ash makes concrete stronger and more resistant to corrosion.","chinese":"加入稻殼灰能夠提高混凝土強度及抗腐蝕性。"},{"english":"Rice (Oryza sativa) produces momilactone diterpenoids as both phytoalexins and allelochemicals.","chinese":"水稻產生稻殼酮二萜類化合物作爲抗毒素和化感素。"},{"english":"Its bulb-like purifier uses rice-husk ash impregnated with nano-silver particles.","chinese":"它的燈泡式淨水器以浸漬納米銀顆粒的稻殼灰製成。"},{"english":"But the modern inventors say rice hull ash works better than other materials.","chinese":"然而，現在的發明者稱稻殼灰燼比其他的材料都要好。"}],"related":[]}