{"definition":["integral calculus"],"pinyin":["ji1 fen1 xue2"],"simplified":["积分学"],"rank":67163.0,"normalized_rank":0.9396975081499308,"fraction":9.050612865439794e-9,"cumulative_fraction":0.9999801365323484,"word":"積分學","characters":[{"definition":["to amass\/to accumulate\/to store\/measured quantity (such as area of volume)\/product (the result of multiplication)\/to integrate (math.)\/to solve (or integrate) an ordinary differential equation (math.)\/old\/long-standing"],"pinyin":["ji1"],"word":"積"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[{"definition":["infinitesimal calculus\/calculus"],"pinyin":["wei1 ji1 fen1 xue2"],"word":"微積分學"}],"sentences":[{"english":"We have to factor that into the calculus.","chinese":"我們要在微積分學中考慮這些因素。"},{"english":"He invented calculus and investigated the nature of light.","chinese":"他創立了微積分學，探索了光的本質。"},{"english":"His work in geometry aided in the eventual development of integral calculus.","chinese":"他對幾何學的研究促進了積分學的發展。"},{"english":"Integral calculus ' learning is one is abstract to turn mathematics foundation academics of a higher door of the degree.","chinese":"積分學是一門抽象化程度較高的一門數學基礎學科。"},{"english":"This book assumes a basic knowledge of differential and integral calculus.","chinese":"這本書假裝一種不同和積分學的基礎知識。"},{"english":"These relationships would prove to be integral from both a collaboration and learning perspective for Yulia.","chinese":"這些關係將證明是來自一個協作和積分學角度對著。"},{"english":"The course provides an introduction to differential and integral calculus.","chinese":"本課程主要介紹基本微積分學。"},{"english":"As you will find in multivariable calculus.","chinese":"你們將會發現在多元的微積分學裏。"},{"english":"In 1686, Leibniz published the first calculus literature.","chinese":"1686年，萊布尼茨發表了第一篇積分學的文獻。"},{"english":"All this leads up to the most fundamental of theorems of calculus .","chinese":"綜上所述就導出了微積分學中的最基本的定理。"},{"english":"The technique he created became known as integral calculus.","chinese":"他所發明的這個方法後來以積分學著稱於世。"},{"english":"This course introduces to students the important concepts and knowledge of vector calculus.","chinese":"本課程在於描述向量微積分學的重要觀念和知識。"},{"english":"Methods Method of deducing minimum value in differential and integral calculus was applied.","chinese":"方法利用微積分學中求極小值的方法。"}],"related":[]}