{"definition":["enthusiast\/(political) activist"],"pinyin":["ji1 ji2 fen4 zi3"],"simplified":["积极分子"],"rank":24814.0,"normalized_rank":0.347180054006408,"fraction":0.0000015042994448122108,"cumulative_fraction":0.9840130461910148,"word":"積極分子","characters":[{"definition":["to amass\/to accumulate\/to store\/measured quantity (such as area of volume)\/product (the result of multiplication)\/to integrate (math.)\/to solve (or integrate) an ordinary differential equation (math.)\/old\/long-standing"],"pinyin":["ji1"],"word":"積"},{"definition":["extremely\/pole (geography, physics)\/utmost\/top"],"pinyin":["ji2"],"word":"極"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi3","zi5"],"word":"子"}],"containing_words":[],"sentences":[{"english":"Tens of thousands of flag-waving activists called for early elections.","chinese":"數以萬計揮舞着國旗的積極分子要求提早進行選舉。"},{"english":"Among the vast numbers of Party and League members the activists and middle elements are rising to give battle .","chinese":"廣大黨團員中的積極分子及中間羣衆起而對抗。"},{"english":"The activists want the king to surrender his right to appoint the prime minister and cabinet.","chinese":"這些積極分子希望國王交出權利，任命總理和內閣。"},{"english":"A group of like-minded single-issue activists.","chinese":"單談某一問題的積極分子集團。"},{"english":"Area English science and technology competition second prize, school study activist, outstanding organization head.","chinese":"區英語科技競賽二等獎，校學習積極分子，優秀社長。"}],"related":[]}