{"definition":["deposits accumulated over long periods\/fig. valuable experience, accumulated wisdom"],"pinyin":["ji1 dian4"],"simplified":["积淀"],"rank":14195.0,"normalized_rank":0.1986064667776643,"fraction":0.000004538882352018057,"cumulative_fraction":0.9555357178967548,"word":"積澱","characters":[{"definition":["to amass\/to accumulate\/to store\/measured quantity (such as area of volume)\/product (the result of multiplication)\/to integrate (math.)\/to solve (or integrate) an ordinary differential equation (math.)\/old\/long-standing"],"pinyin":["ji1"],"word":"積"},{"definition":["sediment\/precipitate"],"pinyin":["dian4"],"word":"澱"}],"containing_words":[],"sentences":[{"english":"Phosphor changes indium chip to need more than silicon chip second precipitate and etch.","chinese":"磷化銦晶片比硅片需要更屢次的積澱和蝕刻。"},{"english":"They don't come from a car culture.","chinese":"他們沒有汽車文化的積澱。"},{"english":"I think Donington has a lot of racing heritage.","chinese":"我認爲多寧頓也有豐富的賽車積澱。"},{"english":"Ganqi performance in Xingtian myth contained witchery and religious factors.","chinese":"積澱在刑天神話中的干鏚之舞，蘊含巫術宗教因素。"},{"english":"It is generated uniquely, in place, over time.","chinese":"它是在適當的位置，經過時間積澱而唯一生成的。"},{"english":"Jiaxing is a vintage town marinating in a thick cultural atmosphere.","chinese":"嘉興是一座有着濃厚文化積澱的歷史名城。"},{"english":"After days, the accumulated sediment of your thought will become munificence.","chinese":"假以時日，你思想的積澱，就會變得豐厚。"},{"english":"The cooperation between China and Arab States has solid accumulations and depositions.","chinese":"中國與阿拉伯國家的合作具有深厚的歷史積澱。"},{"english":"Accumulation of life, traveling, reading ten thousand books.","chinese":"人生積澱，讀萬卷書，行萬里路。"},{"english":"Tan Qunzhao expresses, what take a fancy to La Gang to go up in the product grandly is deep accumulate.","chinese":"譚羣釗表示，盛大看中藍港在產品上的深厚積澱。"},{"english":"Still, there's something to be said for age-old wisdom.","chinese":"不過，還是要爲歲月積澱的智慧說幾句。"},{"english":"Shijiazhuang has a long history and profound cultural background.","chinese":"石家莊的歷史源遠流長，文化積澱深厚。"}],"related":[]}