{"definition":["to accumulate\/accumulation\/cumulative\/cumulatively"],"pinyin":["ji1 lei3"],"simplified":["积累"],"rank":3156.0,"normalized_rank":0.04415653463545675,"fraction":0.000045164893840574375,"cumulative_fraction":0.7979806947867113,"word":"積累","characters":[{"definition":["to amass\/to accumulate\/to store\/measured quantity (such as area of volume)\/product (the result of multiplication)\/to integrate (math.)\/to solve (or integrate) an ordinary differential equation (math.)\/old\/long-standing"],"pinyin":["ji1"],"word":"積"},{"definition":["tired\/weary\/to strain\/to wear out\/to work hard","to accumulate\/to involve or implicate (Taiwan pr. [lei4])\/continuous\/repeated"],"pinyin":["lei3","lei4"],"word":"累"}],"containing_words":[{"definition":["cumulative"],"pinyin":["ji1 lei3 xing4"],"word":"積累性"},{"definition":["cumulative poison"],"pinyin":["ji1 lei3 du2 xing4"],"word":"積累毒性"}],"sentences":[{"english":"Now I am making an attempt to explain the positions of categories such as primitive accumulation and some others.","chinese":"這裏，對原始積累等範疇的位置，試提出一種解釋。"},{"english":"Gathering frequent flyer miles is one of the perks of OCS travel.","chinese":"積累飛行里程是商務旅行的額外補貼之一。"},{"english":"Compared with the TFP, the role of labor capital accumulation are more prominent.","chinese":"與TFP相比而言，勞均資本積累的作用更爲突出。"},{"english":"When a dam is built, the accumulating water presses down upon the rock below.","chinese":"當大壩建成，逐漸積累的水壓壓向下方的岩石。"},{"english":"Mannitol accumulates more than other little molecular carbohydrates in A. mellea.","chinese":"甘露醇是蜜環菌體內積累較多的小分子糖類成分。"},{"english":"Yes. You can't learn these words from textbooks; you just get them from daily life.","chinese":"對，這些詞課本上是學不到的，都得在生活中積累。"},{"english":"And the business department of China's largest non-Ping'an small accumulation of land.","chinese":"與中國最大的非營業部，平安的小塊土地的積累。"},{"english":"Treat it gently by allowing your equity to grow steadily rather than in bursts.","chinese":"與其暴贏，不如緩進，穩紮穩打地積累資產。"},{"english":"Jason: No, I just want to accumulate some useful experience there.","chinese":"傑森:不想，我只想在那裏積累一些有用的經驗。"},{"english":"Books are the ever-burning lamps of accumulated wisdom the world of eternal.","chinese":"書籍是積累世人智慧的不滅的明燈。"},{"english":"According to the rumor, Sun Yue will be transfered to the low level league NBDL for the more experiences.","chinese":"據傳孫悅會被下放到低一級別的NBDL去積累經驗。"},{"english":"Moreover, it will help accumu-late funds for China's great cause.","chinese":"還會有助於爲中國的偉大事業積累資金。"},{"english":"It is caused when water gets accumulated in the ear canal and leads to an infection.","chinese":"這是造成水時會積累的耳道，並導致感染。"},{"english":"Separate holding tanks can be installed to accumulate this slurry prior to dewatering.","chinese":"可以安裝分開的接受器在脫水之前積累這泥漿。"},{"english":"It's a building-block process much like a math course.","chinese":"這就像數學課一樣，是一個需要積累的過程。"},{"english":"The drug suramin, which is used to kill invading trypanosomes, is accumulated in lysosomes .","chinese":"用來殺死侵入的錐蟲的藥物蘇拉明，在溶酶體中積累。"}],"related":[{"definition":["to accumulate"],"pinyin":["lei3 ji1"],"word":"累積"},{"definition":["experience\/to experience"],"pinyin":["jing1 yan4"],"word":"經驗"},{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"word":"實踐"},{"definition":["to change\/to transform\/isomerization (chemistry)"],"pinyin":["zhuan3 hua4"],"word":"轉化"},{"definition":["base\/foundation\/basis\/underlying\/CL:個|个[ge4]"],"pinyin":["ji1 chu3"],"word":"基礎"},{"definition":["unceasing\/uninterrupted\/continuous\/constant"],"pinyin":["bu4 duan4"],"word":"不斷"},{"definition":["cognition\/cognitive\/understanding\/perception\/awareness\/to be cognizant of\/to recognize\/to realize"],"pinyin":["ren4 zhi1"],"word":"認知"},{"definition":["progress\/improvement\/to improve\/to progress\/CL:個|个[ge4]"],"pinyin":["jin4 bu4"],"word":"進步"},{"definition":["to cultivate\/to breed\/to foster\/to nurture\/to educate\/to groom (for a position)\/education\/fostering\/culture (biology)"],"pinyin":["pei2 yang3"],"word":"培養"},{"definition":["to mature\/to grow\/growth"],"pinyin":["cheng2 zhang3"],"word":"成長"},{"definition":["to change\/to transform\/shift\/transformation\/CL:個|个[ge4]"],"pinyin":["zhuan3 bian4"],"word":"轉變"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"畢竟"},{"definition":["experience\/CL:個|个[ge4],次[ci4]\/to experience\/to go through"],"pinyin":["jing1 li4"],"word":"經歷"},{"definition":["to create\/to bring about\/to produce\/to set (a record)"],"pinyin":["chuang4 zao4"],"word":"創造"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"體現"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"}]}