{"definition":["to coalesce\/to gather together\/to amass"],"pinyin":["ji1 ju4"],"simplified":["积聚"],"rank":14909.0,"normalized_rank":0.2085962531305528,"fraction":0.0000041872222489076624,"cumulative_fraction":0.9586536709623033,"word":"積聚","characters":[{"definition":["to amass\/to accumulate\/to store\/measured quantity (such as area of volume)\/product (the result of multiplication)\/to integrate (math.)\/to solve (or integrate) an ordinary differential equation (math.)\/old\/long-standing"],"pinyin":["ji1"],"word":"積"},{"definition":["to congregate\/to assemble\/to mass\/to gather together\/to amass\/to polymerize"],"pinyin":["ju4"],"word":"聚"}],"containing_words":[],"sentences":[{"english":"Within three years he accumulated great wealth by speculations in stocks.","chinese":"三年內他靠炒買股票積聚了大量財富。"},{"english":"But there’s another, darker kind of nontraditional power China is currently amassing.","chinese":"但中國目前在積聚另一種較爲黑暗的非傳統力量。"},{"english":"Accumulations, rous 'd love and joy and thought.","chinese":"那些積聚，被勾起的愛和歡樂，以及思索。"},{"english":"Foam is the other common type of air in oil. Foam typically refers to the stable layer of relatively large bubbles that accumulate at the surface of a reservoir.","chinese":"泡沫是指相對較大的泡泡穩定積聚在油液表面。"},{"english":"Note the dark red congested regions that represent accumulation of RBC's in centrilobular regions.","chinese":"暗紅色淤血區表示肝小葉中心區的紅細胞積聚。"},{"english":"I must have accumulated some merit during my past lives.","chinese":"過去生裏，我定曾積聚功德。"},{"english":"An electic current is applied to the cell, converting the aluminium surface into a coating of aluminium oxide.","chinese":"電解池通過電流，鋁片的表面就逐漸積聚起氧化鋁層。"},{"english":"The accumulation of unswallowed saliva in the pharynx causes the sensation of choking .","chinese":"不能嚥下的唾液積聚在咽部引起窒息感。"},{"english":"NB: If glucose can't get into the cells, it builds up in the blood.","chinese":"如果葡萄糖不能進入細胞，就會積聚在血液中。"},{"english":"Lymphedema is characterized by a regional accumulation of excessive amounts of interstitial protein-rich fluid.","chinese":"淋巴水腫的特點是過量間質性富蛋白液的局部積聚。"},{"english":"Substrates may accumulate intracellularly against a concentration gradient.","chinese":"底物可以逆濃度梯度而積聚於細胞內。"},{"english":"Rain water collected in the drainpipe.","chinese":"雨水積聚在排水道里。"},{"english":"That is because the heavy snows that have been accumulating in central China were falling on places far out of the spotlight.","chinese":"那是因爲華中積聚的大雪降落在遠離聚光燈的地方。"},{"english":"Additional antistatic action will considerably retard new soiling and attraction of dust.","chinese":"添加的防靜電劑能有效防止產生新的污垢和灰塵積聚。"},{"english":"Wealth accumulated through various controversial websites.","chinese":"積聚的財富通過各種爭議性網站。"},{"english":"Occasionally people get an uncomfortable ear wax build up.","chinese":"有時耳屎積聚太多，讓人感到不舒服。"}],"related":[{"definition":["to pile up\/to heap\/accumulation"],"pinyin":["dui1 ji1"],"word":"堆積"},{"definition":["to stock up\/to lay in supplies\/to hoard (for speculation)\/to corner the market in sth"],"pinyin":["tun2 ji1"],"word":"囤積"},{"definition":["to change\/to transform\/isomerization (chemistry)"],"pinyin":["zhuan3 hua4"],"word":"轉化"},{"definition":["to induce\/to cause\/to elicit\/to trigger"],"pinyin":["you4 fa1"],"word":"誘發"},{"definition":["within the body\/in vivo (vs in vitro)\/internal to"],"pinyin":["ti3 nei4"],"word":"體內"},{"definition":["to expand\/to inflate\/to swell"],"pinyin":["peng2 zhang4"],"word":"膨脹"},{"definition":["to arise\/to come into being\/to come about\/to give rise to\/to bring into being\/to bring about\/to produce\/to engender\/to generate\/to appear\/appearance\/emergence\/generation\/production\/yield"],"pinyin":["chan3 sheng1"],"word":"產生"},{"definition":["to lead to\/to create\/to cause\/to bring about"],"pinyin":["dao3 zhi4"],"word":"導致"},{"definition":["corrosion\/to corrode (degrade chemically)\/to rot\/corruption"],"pinyin":["fu3 shi2"],"word":"腐蝕"},{"definition":["to harm\/to damage\/to injure\/impairment\/loss\/disability"],"pinyin":["sun3 shang1"],"word":"損傷"},{"definition":["surplus\/excess"],"pinyin":["guo4 sheng4"],"word":"過剩"},{"definition":["bacterium\/germ"],"pinyin":["xi4 jun1"],"word":"細菌"},{"definition":["to amass\/to accumulate\/to store\/measured quantity (such as area of volume)\/product (the result of multiplication)\/to integrate (math.)\/to solve (or integrate) an ordinary differential equation (math.)\/old\/long-standing"],"pinyin":["ji1"],"word":"積"},{"definition":["destruction\/damage\/to wreck\/to break\/to destroy"],"pinyin":["po4 huai4"],"word":"破壞"},{"definition":["to stockpile"],"pinyin":["ji1 cun2"],"word":"積存"},{"definition":["kidney"],"pinyin":["shen4 zang4"],"word":"腎臟"}]}