{"definition":["stable voltage"],"pinyin":["wen3 ya1"],"simplified":["稳压"],"rank":40457.0,"normalized_rank":0.5660459194381094,"fraction":3.684475301995168e-7,"cumulative_fraction":0.99666093433109,"word":"穩壓","characters":[{"definition":["settled\/steady\/stable"],"pinyin":["wen3"],"word":"穩"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"}],"containing_words":[],"sentences":[{"english":"An intelligent switching power supply which has adjustable output is designed.","chinese":"設計了一種輸出可調智能開關穩壓電源。"},{"english":"The paper provides valuable reference to the design of non-contact AC regulated power supply.","chinese":"該論文方案對設計無觸點交流穩壓電源具有參考價值。"},{"english":"The voltage stabilizing means in the quench air fan frequency converter speed regulating control system were introduced in detail.","chinese":"介紹了驟冷風機變頻調速控制系統穩壓的技改措施。"},{"english":"The company configurated a steady power supply for computers stored with important information.","chinese":"單位爲存儲重要資料的電腦配置了穩壓電源。"},{"english":"I was designed to debug power supply .","chinese":"本人就是設計可調試穩壓電源。"},{"english":"Permits you service the Model 30 regulator without removing it from the line.","chinese":"允許您服務，而不刪除它從示範線30穩壓器。"},{"english":"The paper introduces the principle and the measuring method of DC power supply .","chinese":"本文介紹了直流穩壓電源的基本原理及其檢測方法。"},{"english":"And then the paper introduces the design of power amplifier and DC regulated power supply.","chinese":"論文重點介紹了功率放大器和直流穩壓電源的設計。"},{"english":"This paper describes a wide range of switching power supply design.","chinese":"本文詳細介紹了寬範圍開關穩壓電源的設計方法。"},{"english":"Adj, Very high current, low dropout voltage regulator.","chinese":"形容詞，非常高的電流，低壓差穩壓器。"},{"english":"Anchorage shall be carried out when the pressure stabilizing and tensioning make up is made.","chinese":"穩壓補張後回油至設計控制應力進行錨固。"},{"english":"Pulse width modulation is widely used in voltage regulators.","chinese":"脈寬調製技術是廣泛應用於穩壓器。"},{"english":"This paper will introduce the design of DC regulated power supply in detail.","chinese":"本文對直流穩壓電源的設計進行了詳細介紹。"},{"english":"Micro-computer controlled AC voltage stabilizer is a device of new technology.","chinese":"微機控制交流穩壓器是一種新技術。"},{"english":"A half bridge switching mode power supply(SMPS) based on PWM technology is introduced.","chinese":"介紹了一款基於PWM技術的半橋式開關穩壓電源。"},{"english":"This paper introduces the design principle of a kind of practical isolating switching stable power supply.","chinese":"介紹了一種實用的隔離開關穩壓電源的設計原理。"}],"related":[]}