{"definition":["flow of air\/draft"],"pinyin":["kong1 qi4 liu2"],"simplified":["空气流"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"空氣流","characters":[{"definition":["empty\/air\/sky\/in vain","to empty\/vacant\/unoccupied\/space\/leisure\/free time"],"pinyin":["kong1","kong4"],"word":"空"},{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"},{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"}],"containing_words":[{"definition":["fresh air\/draft"],"pinyin":["kong1 qi4 liu2 tong1"],"word":"空氣流通"}],"sentences":[{"english":"Absorption is also dependent upon air flow rates and the partial pressure of the gases in the inspired air.","chinese":"吸收也取決於空氣流速和吸入空氣中的氣體分壓。"},{"english":"Combat that with a small fan on your desk that will help keep air circulating in your workspace.","chinese":"要解決它可以用一個小風扇助你周圍空氣流通。"},{"english":"Also note air flow is from right to left.","chinese":"也要注意，空氣流是從右到左的。"},{"english":"Thewindows shouldbe open to allowthe air to circulate.","chinese":"我們應當打開窗戶以使空氣流通。"},{"english":"Attach the bung and the airlock, making sure to fill the airlock halfway with water.","chinese":"用水填裝氣密室以保證空氣流通。"},{"english":"Move it out of any confined spaces and give it about a foot all around for proper air circulation.","chinese":"招出任何密閉空間約一呎，給予適當的空氣流通各地。"},{"english":"It through continuous air flow make you feel more natural cool.","chinese":"它通過持續的空氣流讓你感覺更加自然的涼爽。"},{"english":"Numerous small mesh covered contact areas give outstanding air circulation around the back.","chinese":"許多小網覆蓋接觸面使背部空氣流通優良。"},{"english":"The large window makes the room seem airy.","chinese":"那扇大窗使這房間看來空氣流通。"},{"english":"So many Windows, accelerated air circulation.","chinese":"因此要多開窗，加速空氣流通。"},{"english":"Open the windows to let some air flow in.","chinese":"打開窗戶，讓空氣流進來。"},{"english":"Control valves are used to set the flow rate of air for gas burners.","chinese":"該控制閥用於設定氣體燃燒器空氣流速。"},{"english":"We should often open the windows to allow the air to circulate.","chinese":"我們應當經常打開窗戶以使空氣流通。"},{"english":"Maintain good ventilation by keeping the windows open and turning off the air-conditioning as far as possible.","chinese":"儘量關掉空調及打開窗戶以保持空氣流通。"},{"english":"But, the velocity of the inlet airflow is less influential.","chinese":"蒸發管入口空氣流速對蒸發率的影響較小。"},{"english":"Open the window and ventilate the room.","chinese":"打開窗戶，讓房間空氣流通。"}],"related":[]}