{"definition":["neutral gear"],"pinyin":["kong1 dang3"],"simplified":["空挡"],"rank":30390.0,"normalized_rank":0.4251955283813468,"fraction":9.111923468721805e-7,"cumulative_fraction":0.9906031992947492,"word":"空擋","characters":[{"definition":["empty\/air\/sky\/in vain","to empty\/vacant\/unoccupied\/space\/leisure\/free time"],"pinyin":["kong1","kong4"],"word":"空"},{"definition":["to arrange\/to put in order","to resist\/to obstruct\/to hinder\/to keep off\/to block (a blow)\/to get in the way of\/cover\/gear (e.g. in a car's transmission)"],"pinyin":["dang3","dang4"],"word":"擋"}],"containing_words":[{"definition":["see 放空擋|放空挡[fang4 kong1 dang3]"],"pinyin":["gua4 kong1 dang3"],"word":"掛空擋"},{"definition":["to coast along in neutral gear (in a car)\/(coll.) to go commando"],"pinyin":["fang4 kong1 dang3"],"word":"放空擋"}],"sentences":[{"english":"But he tried to appear calm as he instructed Griffith to put the car in neutral.","chinese":"他要格里菲斯掛空擋。"},{"english":"Leave a car in neutral gear.","chinese":"讓汽車排擋置於空擋位置。"},{"english":"Q. I should still idle my car in really cold weather before driving, right?","chinese":"天氣很冷的時候要開車前是要把車子掛空擋的嗎？"},{"english":"SECURITY. Reverse alarm neutral start switch handlever parking brake.","chinese":"倒車報警器，空擋啓動開關，手動駐車制動。"},{"english":"Just as he was unzipping, a London police officer showed up.","chinese":"就在他鬆開拉鍊的空擋，一個倫敦的警官出現了。"},{"english":"Leave a good safety margin between your car and the next.","chinese":"在你的車和下一輛車之間留出足夠的安全空擋。"},{"english":"In addition, automatic-shift cars slide neutral, will cause damage to the car.","chinese":"另外，自動擋車子空擋滑行，還會對車子造成損害。"},{"english":"I even took up piano-playing again, finding that the small intervals of the provided sufficient time for both writing and piano practice.","chinese":"我發現那些小小的時間空擋足夠用於寫作和鋼琴練習。"},{"english":"Allows the driver to select neutral and reverse gear.","chinese":"讓車手選擇空擋和倒車檔。"},{"english":"At last a gap in the next lane opens. The driver stamps on the accelerator.","chinese":"終於隔壁車道上出現了一個空擋，司機踩下了油門。"},{"english":"Graham put the van in neutral and jumped out into the road.","chinese":"格雷厄姆把貨車掛到空擋，自己跳到馬路上。"}],"related":[]}