{"definition":["gap\/empty space"],"pinyin":["kong4 bai2 dian3"],"simplified":["空白点"],"rank":34739.0,"normalized_rank":0.4860436808305234,"fraction":6.20112958909488e-7,"cumulative_fraction":0.9938889898448264,"word":"空白點","characters":[{"definition":["empty\/air\/sky\/in vain","to empty\/vacant\/unoccupied\/space\/leisure\/free time"],"pinyin":["kong1","kong4"],"word":"空"},{"definition":["surname Bai","white\/snowy\/pure\/bright\/empty\/blank\/plain\/clear\/to make clear\/in vain\/gratuitous\/free of charge\/reactionary\/anti-communist\/funeral\/to stare coldly\/to write wrong character\/to state\/to explain\/vernacular\/spoken lines in opera"],"pinyin":["Bai2","bai2"],"word":"白"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[],"sentences":[{"english":"Point blank, it increases brain function. Barlean's makes a fish oil foam called Omega Swirl that tastes like candy.","chinese":"它能夠激發空白點，提高腦功能。"},{"english":"To develop the inland waters electronic chart has never been proceeded.","chinese":"電子江圖的研製開發是一個空白點。"},{"english":"The child-bearing right is related to the gap of China's laws.","chinese":"罪犯的生育權觸及了我國法律的空白點。"},{"english":"The research on these systematic questions still remains empty.","chinese":"這一系列問題都是研究的空白點。"},{"english":"At present, the marriage right of the persons serving sentences is still non-existent in our country's law.","chinese":"服刑人員的結婚權是我國法律的空白點。"},{"english":"But the study of James Legge in China has left some aspects untouched .","chinese":"國內對理雅各的研究還有許多空白點有待於深入探討。"}],"related":[]}