{"definition":["not a soul in sight (idiom)"],"pinyin":["kong1 wu2 yi1 ren2"],"simplified":["空无一人"],"rank":24524.0,"normalized_rank":0.3431225777566353,"fraction":0.0000015486766433782385,"cumulative_fraction":0.9835705021691508,"word":"空無一人","characters":[{"definition":["empty\/air\/sky\/in vain","to empty\/vacant\/unoccupied\/space\/leisure\/free time"],"pinyin":["kong1","kong4"],"word":"空"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"}],"containing_words":[],"sentences":[{"english":"In a trice, the street was empty.","chinese":"轉眼之間，大街上就空無一人。"},{"english":"The first is how empty it was at al Asad Air Base, where he landed.","chinese":"第一個就是他落地的阿薩德空軍基地空無一人。"},{"english":"The streets were empty because many folks smarter than I were still asleep.","chinese":"街上空無一人，很多比我聰明的人還都在睡夢之中。"},{"english":"It was New Year's Eve and the snowed streets were deserted.","chinese":"這是元旦夜和雪的街道空無一人。"},{"english":"The village was deserted because of the earthquake.","chinese":"因爲地震，這個村子變得空無一人。"},{"english":"Five-lane motorways are almost deserted.","chinese":"五車道的高速公路幾乎空無一人。"},{"english":"Dorms with Sunrise or at Dusk; an ancient empty street; below skirts.","chinese":"清晨或日落下的房間，空無一人的古老街道，裙下。"},{"english":"At this time of the morning, the arcade was almost empty.","chinese":"在早晨的這個時候，拱廊街上幾乎空無一人。"},{"english":"Kim looks around the empty road, and calls out for her mother.","chinese":"金姆環視着空無一人的道路，大聲呼叫她的母親。"},{"english":"Whenever sang my songs on the stage, on my own!","chinese":"每當我站在空無一人的舞臺上宛若囈語般歌唱時。"},{"english":"In the lonely lane there is no passer-by, the wind is up, the ripples are rampant in the river.","chinese":"孤寂的小路上空無一人，起風了，河裏泛起陣陣漣漪。"},{"english":"The sun shines on the empty seafront in Mombasa, Kenya.","chinese":"陽光明媚，肯尼亞蒙巴薩島的海灘上卻空無一人。"},{"english":"On waking one morning, B was surprised to see that Shepperton was deserted.","chinese":"早晨一醒來，B驚訝地發現謝伯頓空無一人了。"},{"english":"Now the sand-swept sites stand nearly empty.","chinese":"如今這些沙漠景點幾乎空無一人。"},{"english":"I looked through the open door, but the room was empty.","chinese":"通過敞開的門向裏看，我看到屋裏空無一人。"},{"english":"When the desk was clear of people, I still waited.","chinese":"桌邊已經空無一人了，我仍在等着。"}],"related":[]}