{"definition":["jejunum (empty gut, middle segment of small intestine between duodenum 十二指腸|十二指肠[shi2 er4 zhi3 chang2] and ileum 回腸|回肠[hui2 chang2])"],"pinyin":["kong1 chang2"],"simplified":["空肠"],"rank":58408.0,"normalized_rank":0.8172036992990358,"fraction":5.284390092401943e-8,"cumulative_fraction":0.9997399523899776,"word":"空腸","characters":[{"definition":["empty\/air\/sky\/in vain","to empty\/vacant\/unoccupied\/space\/leisure\/free time"],"pinyin":["kong1","kong4"],"word":"空"},{"definition":["intestines"],"pinyin":["chang2"],"word":"腸"}],"containing_words":[],"sentences":[{"english":"To explore the nursing ways of enteral nutrition therapy per stoma of jejunum after total gastrectomy.","chinese":"探討全胃切除術後空腸造口腸內營養治療的護理方法。"},{"english":"The atonomosis meshs density of the jejunum was larger than the ileums.","chinese":"空腸器官表面動脈吻合網面密度大於迴腸。"},{"english":"Location of efferent neurons of caecum in fowl;","chinese":"探討白朮對雞離體空腸和盲腸運動張力的影響。"},{"english":"The experimental Alkaline Reflux Gastritis in rats was established after 9 weeks of anastomosis between stomach and jejunum.","chinese":"大鼠胃空腸吻合9周後，形成實驗性返流性胃炎。"},{"english":"The two ends of the jejunum segment were anastomosed separately to the cervical esophagus and the stomach.","chinese":"空腸段上下兩斷端分別與頸部食管及胃吻合代食管。"},{"english":"Campylobacter jejuni is recognized as one of the major causes of human food-borne diseases.","chinese":"空腸彎曲菌是引起人類食源性疾病的主要病原菌之一。"},{"english":"Scintigraphy with Technetium-labeled red blood cells showed jejunal bleeding.","chinese":"同位素紅血球掃描發現空腸處出血。"},{"english":"The first choice of reconstructive strategy for hypopharyngeal circumferential defects is free jejunal interposition.","chinese":"建議下嚥環周缺損重建首選遊離空腸移植術。"},{"english":"The correct jejunal position was documented by the application of a radiopaque contrast medium through the tube.","chinese":"通過導管注入造影劑以標記正確的空腸位置。"},{"english":"Reconstruction of the pharyngoesophagus with free jejunal transfer has become the standard technique.","chinese":"使用自由空腸皮瓣已成爲咽食道重建之標準方式。"},{"english":"The research aimed to discuss the effect of atractylodes macrocephala on the tension of isolated jejunum and caecum of chook.","chinese":"探討白朮對雞離體空腸和盲腸運動張力的影響。"}],"related":[]}