{"definition":["(of a ship, train etc) not carrying any load (i.e. no passengers or freight etc)\/(electricity) no-load (used to describe the condition of a transformer when there is no load connected to its secondary coil)"],"pinyin":["kong1 zai4"],"simplified":["空载"],"rank":37262.0,"normalized_rank":0.5213437242035454,"fraction":4.944262221813643e-7,"cumulative_fraction":0.9952888923679446,"word":"空載","characters":[{"definition":["empty\/air\/sky\/in vain","to empty\/vacant\/unoccupied\/space\/leisure\/free time"],"pinyin":["kong1","kong4"],"word":"空"},{"definition":["to carry\/to convey\/to load\/to hold\/to fill up\/and\/also\/as well as\/simultaneously","to record in writing\/to carry (i.e. publish in a newspaper etc)\/Taiwan pr. [zai4]\/year"],"pinyin":["zai3","zai4"],"word":"載"}],"containing_words":[],"sentences":[{"english":"Foot switch board has quick lowering function when unload.","chinese":"腳踏開關板具備空載快速下降功能。"},{"english":"High no-load voltage and good ability of trust compensation.","chinese":"高的空載電壓及良好的推力補償功能。"},{"english":"Lift the suspension coop vacant load for 300mm and stop.","chinese":"將吊籠空載提升300毫米左右高度停止。"},{"english":"Valve as a whole item, easy service Foot switch board has quick lowering function when unload.","chinese":"腳踏開關板具備空載快速下降功能。"},{"english":"No-load loss, with the traditional machine than can be saving 50%.","chinese":"空載損耗小，與傳統焊機比，可節電50%。"},{"english":"Setting open-circuit frequency and voltage algorithm for steady-state control power flow .","chinese":"穩態控制潮流的設定空載頻率及空載電壓算法。"},{"english":"Setting open-circuit frequency and voltage algorithm for steady-state control power flow .","chinese":"穩態控制潮流的設定空載頻率及空載電壓算法。"},{"english":"With little no-load loss, compared to traditional welder, it can save electricity about50%","chinese":"空載損耗小，與傳統焊機比，可節電50%。"},{"english":"Now, with her containers still empty and the sun blazing overhead, she has returned home for a moment's rest.","chinese":"此刻，已是烈日當空，查雅空載而歸，稍作休息。"},{"english":"This paper describes the effect of no-load deexcitation damping affect on deexcitation process.","chinese":"敘述了空載滅磁阻尼作用對滅磁過程的影響。"},{"english":"No-load voltage and higher energy Thrust better compensation, a wide range of uses.","chinese":"較高的空載電壓和較好的能量推力補償，用途廣泛。"},{"english":"The response time of the analyser is made up of dead - time and equilibration.","chinese":"分析器的響應時間是由空載時間和平衡時間組成。"},{"english":"Using high quality silicon steel plates, its low loss and noise unladen small.","chinese":"採用優質的硅鋼片，其空載損耗低及噪音小。"},{"english":"The barrel temperature field without load is tested and analysis.","chinese":"測試並分析了該機的空載下機筒的溫度場。"},{"english":"It can improve the power factor of the motor when it is under low load or no load running.","chinese":"能提高電動機在輕載或空載時的功率因素。"},{"english":"The no load twisting moment measuring instrument of ball lead screw is introduced in the paper.","chinese":"介紹了一種測量滾珠絲槓空載扭矩的測量儀。"}],"related":[{"definition":["to be clogged up\/to be congested (traffic, computer network etc)"],"pinyin":["yong1 se4"],"word":"擁塞"},{"definition":["trench\/moat"],"pinyin":["hao2 gou1"],"word":"壕溝"},{"definition":["electricity pylon\/transmission tower"],"pinyin":["dian4 ta3"],"word":"電塔"},{"definition":["flashing light\/indicator light"],"pinyin":["deng1 hao4"],"word":"燈號"},{"definition":["Kanting township in Pingtung County 屏東縣|屏东县[Ping2 dong1 Xian4], Taiwan"],"pinyin":["Kan3 ding3"],"word":"崁頂"},{"definition":["the mountain road twists around each new peak (idiom)\/(of a mountain road) twisting and turning\/fig. an opportunity has come unexpectedly\/things have taken a new turn"],"pinyin":["feng1 hui2 lu4 zhuan3"],"word":"峰回路轉"},{"definition":["Santimen township in Pingtung County 屏東縣|屏东县[Ping2 dong1 Xian4], Taiwan"],"pinyin":["San1 di4 men2"],"word":"三地門"},{"definition":["lathe"],"pinyin":["che1 chuang2"],"word":"車床"},{"definition":["wiring"],"pinyin":["bu4 xian4"],"word":"布線"},{"definition":["hearse"],"pinyin":["ling2 che1"],"word":"靈車"},{"definition":["Dr Sun Yat-sen (1866-1925), first president of the Republic of China and co-founder of the Kuomintang\/same as 孫中山|孙中山"],"pinyin":["Sun1 Yi4 xian1"],"word":"孫逸仙"},{"definition":["vehicle\/(more specifically) mobility vehicle (mobility scooter, electric wheelchair, Segway etc)"],"pinyin":["dai4 bu4 che1"],"word":"代步車"},{"definition":["car park"],"pinyin":["ting2 che1 ku4"],"word":"停車庫"},{"definition":["to load or unload\/to transfer\/to assemble and disassemble"],"pinyin":["zhuang1 xie4"],"word":"裝卸"},{"definition":["sluice\/water gate\/waterlocks\/floodgate\/lock\/dam"],"pinyin":["shui3 zha2"],"word":"水閘"},{"definition":["Tungshan or Dongshan township in Yilan county 宜蘭縣|宜兰县[Yi2 lan2 xian4], Taiwan"],"pinyin":["Dong1 shan1 xiang1"],"word":"冬山鄉"}]}