{"definition":["free\/vacant\/unoccupied"],"pinyin":["kong4 yu2"],"simplified":["空余"],"rank":27664.0,"normalized_rank":0.387055251633484,"fraction":0.000001162127887447842,"cumulative_fraction":0.9877961849974316,"word":"空餘","characters":[{"definition":["empty\/air\/sky\/in vain","to empty\/vacant\/unoccupied\/space\/leisure\/free time"],"pinyin":["kong1","kong4"],"word":"空"},{"definition":["extra\/surplus\/remaining\/remainder after division\/(following numerical value) or more\/in excess of (some number)\/residue (math.)\/after\/I\/me","surname Yu","variant of 餘|余[yu2], remainder"],"pinyin":["Yu2","yu2"],"word":"餘"}],"containing_words":[],"sentences":[{"english":"Three is afraid of in some way yet but would have died, free grudge.","chinese":"三是怕某些心願尚未了卻便就此撒手西去，空餘遺恨。"},{"english":"On any free time, she would have the obnoxiously busy job at the coffee shop across the street from campus.","chinese":"空餘的時間會在學校對街熱鬧的咖啡店打工。"},{"english":"I afraid we have no vacant suite room, would you mind having a double room?","chinese":"我們恐怕沒有空餘的套間了，你介意改定雙人間嗎？"},{"english":"Have a great plan for your next weekend or freetime?","chinese":"爲你下個週末或空餘時間做好安排了嗎？"},{"english":"Jim spends much of his free time driving the bus for the blind children.","chinese":"吉姆把大部分空餘時間用去爲盲童開車了。"},{"english":"Between the two floors there is empty space which is thesize of the whole floor.","chinese":"兩層樓之間有一塊相當於整層樓那麼大的空餘空間。"},{"english":"Nurturing your spirituality is one of the best ways to sneak time in for yourself every day.","chinese":"養精蓄銳是每天給自己空餘更多時間的最好方法之一。"},{"english":"In his spare time he has traveled to all seven continents. Follow him on Twitter @cqchoi.","chinese":"空餘時間，他足跡遍佈七大洲。"},{"english":"I have to take the Yellow Crane to spare here, Yellow Crane Tower.","chinese":"昔人已乘黃鶴去，此地空餘黃鶴樓。"},{"english":"He takes a part-time job as a cashier.","chinese":"他利用工作的空餘時間兼差做收銀員。"},{"english":"Tariel : How do you spend your free time ?","chinese":"你是怎樣過你的空餘時間的？"},{"english":"Let students read this unit. Read this unit.","chinese":"空餘時間讓學生進行朗讀前面的課文，以讀促學。"},{"english":"She devotes all her spare time to looking after her sick mother.","chinese":"她把所有的空餘時間都花在賜顧幫襯生病的母親上。"},{"english":"I'm afraid we haven't vacancy suits. Would you mind having a double room instead?","chinese":"我們恐怕沒有空餘的套間了，您介意改定雙人間嗎？"},{"english":"I'm sorry to tell you that we have no vacant suites, would you mind order a double room?","chinese":"我們恐怕沒有空餘的套間了，您介意改訂雙人間嗎？"},{"english":"We are afraid that there are not any vacant suits available now, do you mind changing to book double rooms?","chinese":"我們恐怕沒有空餘的套件了，您介意改訂雙人間嗎？"}],"related":[]}