{"definition":["to penetrate"],"pinyin":["chuan1 tou4"],"simplified":["穿透"],"rank":14396.0,"normalized_rank":0.20141871755767912,"fraction":0.000004446040581333868,"cumulative_fraction":0.9564386101017408,"word":"穿透","characters":[{"definition":["to wear\/to put on\/to dress\/to bore through\/to pierce\/to perforate\/to penetrate\/to pass through\/to thread"],"pinyin":["chuan1"],"word":"穿"},{"definition":["to penetrate\/to pass through\/thoroughly\/completely\/transparent\/to appear\/to show"],"pinyin":["tou4"],"word":"透"}],"containing_words":[{"definition":["penetrating radiation"],"pinyin":["chuan1 tou4 fu2 she4"],"word":"穿透輻射"}],"sentences":[{"english":"Tackling well and playing penetrating balls from midfield are vital.","chinese":"中場的搶斷和穿透性的出球是我們需要的。"},{"english":"Globe rupture can occur secondary to blunt or penetrating trauma.","chinese":"眼球破裂可繼發於鈍挫傷或穿透性損傷。"},{"english":"Signals in the spectrum can penetrate walls, making it ideal for wireless broadband.","chinese":"該頻段的信號可以穿透牆壁，從而非常適合無線寬帶。"},{"english":"Specifically, the clarity and projection of the altissimo range.","chinese":"具體地說，可以影響高音區發音的清晰度和穿透力嗎？"},{"english":"Tritium emits a weak form of radiation that does not travel very far in the air and cannot penetrate the skin.","chinese":"氚發出的輻射很弱，在空氣傳播不遠，不能穿透皮膚。"},{"english":"Its quantity of heat and the far-infrared can rapidly penetrate the skin points deep place.","chinese":"其熱量和遠紅外線能迅速穿透皮膚穴位深處。"},{"english":"Whatever she tries to launch at you isn't able to penetrate the protective force.","chinese":"不論她嘗試對你做什麼，也不能穿透這個保護的力量。"},{"english":"Last wax the incapability is over-weight and keep penetration beaded paint from peeping out ground colour.","chinese":"上蠟時不能過重，防止穿透油漆露出底色。"},{"english":"Several bullets struck the log-house, but not one entered;","chinese":"有幾發子彈打中了木屋子，但是沒有穿透進來。"},{"english":"Cripple's armor and magic penetration lowered to 10 from 25.","chinese":"殘廢的護甲與魔法穿透效果從25減少到10。"},{"english":"This forerunner of the musket is capable of firing deadly volleys that can pierce armour.","chinese":"這些火槍的先驅者可以射出穿透盔甲的致命齊射。"},{"english":"We shall need a strong light to penetrate through this mist.","chinese":"我們必須要用強光來穿透這層薄霧。"},{"english":"The penetration and deposition of the droplets increase with the gradient wind.","chinese":"而彌霧機械梯度風的存在，有利於霧滴的穿透和沉積。"},{"english":"This being looks at her with a hypnotically deep and steady gaze, as if penetrating her with its eyes.","chinese":"天使如催眠般深深凝望着她，彷彿要用目光將她穿透。"},{"english":"Easy, just see if my watch lasers can cut through the wall.","chinese":"簡單，看看我的表發出的激光能不能夠穿透那堵牆吧。"},{"english":"The missing becomes long-line, penetrates the thick raindrop, arrives at you.","chinese":"思念連成長線，穿透厚厚的雨點，來到你身邊。"}],"related":[{"definition":["to skewer\/to impale\/to pierce through"],"pinyin":["ci4 chuan1"],"word":"刺穿"},{"definition":["to puncture\/to pierce"],"pinyin":["ci4 po4"],"word":"刺破"},{"definition":["to penetrate\/to pierce\/to see clearly\/to have an insight into"],"pinyin":["dong4 chuan1"],"word":"洞穿"},{"definition":["to wear out (clothes)\/to pierce (a membrane etc)"],"pinyin":["chuan1 po4"],"word":"穿破"},{"definition":["to rip apart\/to tear\/laceration\/rent"],"pinyin":["si1 lie4"],"word":"撕裂"},{"definition":["to separate\/to cut off"],"pinyin":["zu3 ge2"],"word":"阻隔"},{"definition":["to split\/to cut open"],"pinyin":["po4 kai1"],"word":"破開"},{"definition":["to cut open\/to rip\/to streak across (lightning, meteor etc)\/to pierce (scream, searchlight etc)"],"pinyin":["hua2 po4"],"word":"劃破"},{"definition":["emission\/ejaculation"],"pinyin":["she4 chu1"],"word":"射出"},{"definition":["light beam"],"pinyin":["guang1 shu4"],"word":"光束"},{"definition":["to transmit\/transmission (of radiation through a medium)\/passage"],"pinyin":["tou4 she4"],"word":"透射"},{"definition":["scattering"],"pinyin":["san3 she4"],"word":"散射"},{"definition":["to cover\/to hide from view\/to obstruct or block\/defilade (military)"],"pinyin":["zhe1 bi4"],"word":"遮蔽"},{"definition":["to smash to pieces"],"pinyin":["ji1 sui4"],"word":"擊碎"},{"definition":["to shine on\/to light up\/to irradiate"],"pinyin":["zhao4 she4"],"word":"照射"},{"definition":["to prick\/to puncture"],"pinyin":["zha1 chuan1"],"word":"扎穿"}]}