{"definition":["conspicuous\/to make sth stand out\/make sth prominent"],"pinyin":["tu1 xian3"],"simplified":["突显"],"rank":17166.0,"normalized_rank":0.2401746113917144,"fraction":0.0000032255216431412535,"cumulative_fraction":0.9669579048928808,"word":"突顯","characters":[{"definition":["to dash\/to move forward quickly\/to bulge\/to protrude\/to break through\/to rush out\/sudden\/Taiwan pr. [tu2]"],"pinyin":["tu1"],"word":"突"},{"definition":["to make visible\/to reveal\/prominent\/conspicuous\/(prefix) phanero-"],"pinyin":["xian3"],"word":"顯"}],"containing_words":[],"sentences":[{"english":"The goodness of God should have put them to shame, for they continually sinned against Him.","chinese":"上帝的美善，倒要突顯人們不斷犯罪的可恥。"},{"english":"The poll, he said, highlights a number of worrying trends.","chinese":"他說，該調查突顯出一些令人擔憂的趨勢。"},{"english":"Each crystal is hand-cut to enhance every piece's unique colour and sparkle.","chinese":"每顆水晶均於人工切割，突顯其獨特色澤和流麗光彩。"},{"english":"Devastating floods last year highlighted the benefits of dams on the Indus.","chinese":"去年破壞嚴重的洪水突顯了在印度河建造大壩的好處。"},{"english":"In the case of tax dodging, the results were even more striking.","chinese":"對於逃漏稅的問題，測試結果甚至更爲突顯。"},{"english":"Her black hair framed her angular face and reached her shoulders.","chinese":"她一頭黑髮齊肩，突顯出有棱有角的臉龐。"},{"english":"At fault may be the very idea of highlighting a site's particular merits.","chinese":"有過失可能正是一種來突顯古蹟的特殊價值的辦法。"},{"english":"Midmonth highlights communication and education.","chinese":"在月中突顯溝通和教育。"},{"english":"But the fragility of world food markets has been underscored by the tragic events of this summer.","chinese":"但今夏一些悲劇性事件更突顯了脆弱的世界糧食市場。"},{"english":"The frequent incidents over the past month have highlighted the danger of loose and corroded aluminium window frames.","chinese":"意外頻頻發生，突顯鋁窗鬆脫和侵蝕的危險。"},{"english":"A GPS navigational system can highlight danger on the road.","chinese":"GPS導航系統可以突顯道路上的危險物。"},{"english":"The vermilion gates and windows better highlight the wealth and rank of her family.","chinese":"朱漆的門窗更能突顯她家的榮華富貴。"},{"english":"With the development of Criterion-referenced tests, standard setting becomes more and more important.","chinese":"隨着標準參照測驗的興起，標準設定的作用日益突顯。"},{"english":"And yet, it could be a transformative deal whose full implications will take years to emerge.","chinese":"但它的變革性意義將在數年之後完整地突顯出來。"},{"english":"The tale of Saint George and the evil dragon he killed best shows the difference.","chinese":"而最能突顯這項差異的就是聖喬治宰殺惡龍的故事。"},{"english":"Elegant interior design accentuating the unique feeling of space.","chinese":"優雅的室內設計突顯了獨特的空間感。"}],"related":[{"definition":["to present clearly\/to give prominence to\/to magnify\/clear and obvious"],"pinyin":["tu1 xian3"],"word":"凸顯"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰顯"},{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"word":"展現"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"體現"},{"definition":["to build (housing)\/to construct\/to make"],"pinyin":["ying2 zao4"],"word":"營造"},{"definition":["appearance\/to appear"],"pinyin":["xian3 xian4"],"word":"顯現"},{"definition":["to use\/to put to use"],"pinyin":["yun4 yong4"],"word":"運用"},{"definition":["to appear\/to emerge\/to present (a certain appearance)\/to demonstrate"],"pinyin":["cheng2 xian4"],"word":"呈現"},{"definition":["to emphasize (a statement)\/to stress"],"pinyin":["qiang2 diao4"],"word":"強調"},{"definition":["fickle\/multi-variate (math.)"],"pinyin":["duo1 bian4"],"word":"多變"},{"definition":["unique\/distinct\/having special characteristics"],"pinyin":["du2 te4"],"word":"獨特"},{"definition":["diverse\/diversity\/manifold"],"pinyin":["duo1 yang4"],"word":"多樣"},{"definition":["to combine\/to link\/to integrate\/binding\/CL:次[ci4]"],"pinyin":["jie2 he2"],"word":"結合"},{"definition":["to own exclusively\/unique to\/specific\/there is only"],"pinyin":["du2 you3"],"word":"獨有"},{"definition":["to appeal\/to demand (an answer)\/requirement\/demand\/claim\/appeal\/(marketing) message"],"pinyin":["su4 qiu2"],"word":"訴求"},{"definition":["layer\/level\/gradation\/arrangement of ideas\/(a person's) standing"],"pinyin":["ceng2 ci4"],"word":"層次"}]}