{"definition":["to advance by leaps and bounds"],"pinyin":["tu1 fei1 meng3 jin4"],"simplified":["突飞猛进"],"rank":17109.0,"normalized_rank":0.23937710743917284,"fraction":0.0000032452286227676136,"cumulative_fraction":0.96677351880066,"word":"突飛猛進","characters":[{"definition":["to dash\/to move forward quickly\/to bulge\/to protrude\/to break through\/to rush out\/sudden\/Taiwan pr. [tu2]"],"pinyin":["tu1"],"word":"突"},{"definition":["to fly"],"pinyin":["fei1"],"word":"飛"},{"definition":["ferocious\/fierce\/violent\/brave\/suddenly\/abrupt\/(slang) awesome"],"pinyin":["meng3"],"word":"猛"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[],"sentences":[{"english":"With your wonderful leadership skills, your career is guided by drive, stamina and commitment.","chinese":"伴隨着你傑出的領導能力，工作突飛猛進地發展。"},{"english":"The wheel of technology history turns remarkably fast.","chinese":"科技發展的歷史突飛猛進。"},{"english":"Nowdays, science and technology are growing in leaps and bounds, and knowledge economy has shaped it's small form.","chinese":"當今世界，科學技術突飛猛進，知識經濟已見端倪。"},{"english":"The development of two years of advance rapidly, created new start for phlogistic yellow network.","chinese":"兩年突飛猛進的發展，爲炎黃網絡創造了新的起點。"},{"english":"Trade within the region has been growing by leaps and bounds.","chinese":"區域內貿易突飛猛進。"},{"english":"P2P networking applications have seen explosive growth in recent years.","chinese":"對等網應用在近幾年內已得到突飛猛進的發展。"},{"english":"While after renaissance time, modern surgery in western medicine has been largely improved by its technologies.","chinese":"“文藝復興”以後的西醫外科學得到突飛猛進地發展。"},{"english":"With spending in check, the economy soared during his term.","chinese":"通過控制開支，美國經濟在他執政期間一路突飛猛進。"},{"english":"Their business has grown by leaps and bounds.","chinese":"他們的生意突飛猛進。"},{"english":"Global trade increased enormously in the second half of the 20th century.","chinese":"20世紀後半葉，全球化貿易突飛猛進。"},{"english":"Technolgical developments in the field of genetic engineering have proceeded rapidly in recent years.","chinese":"最近以來遺傳工程學技術突飛猛進。"},{"english":"Construction of postal and telecommunications facilities greatly expanded.","chinese":"郵電通信建設突飛猛進。"},{"english":"Over the past two decades, China has achieved exceptionally rapid economic growth.","chinese":"年中，中國經濟突飛猛進地增長。"},{"english":"But not so radical that you think it's science fiction.","chinese":"但不會突飛猛進到你以爲是科幻那樣的程度。"},{"english":"Shani started out slow but dug deep on his final lap.","chinese":"沙尼起步很慢，但在最後一圈中突飛猛進。"},{"english":"We are now witnessing a period of rapid transformation in the global marketplace.","chinese":"當前，我們正目睹一個全球市場突飛猛進的時期。"}],"related":[{"definition":["to increase steadily\/to grow with each passing day"],"pinyin":["yu3 ri4 ju4 zeng1"],"word":"與日俱增"},{"definition":["lit. what the heart wishes, the hand accomplishes (idiom) skilled at the job\/entirely in one's element\/going smoothly and easily"],"pinyin":["de2 xin1 ying4 shou3"],"word":"得心應手"},{"definition":["socio-economic"],"pinyin":["she4 hui4 jing1 ji4"],"word":"社會經濟"},{"definition":["with great prospects for the future (idiom); well worth doing"],"pinyin":["da4 you3 ke3 wei2"],"word":"大有可為"},{"definition":["lit. only one branch of the tree is thriving (idiom)\/fig. to be in a league of one's own\/outstanding"],"pinyin":["yi1 zhi1 du2 xiu4"],"word":"一枝獨秀"},{"definition":["flying speed\/rapid (growth)"],"pinyin":["fei1 su4"],"word":"飛速"},{"definition":["direction\/trend\/to incline"],"pinyin":["qu1 xiang4"],"word":"趨向"},{"definition":["to transform\/to change"],"pinyin":["bian4 ge2"],"word":"變革"},{"definition":["economic prosperity"],"pinyin":["jing1 ji4 fan2 rong2"],"word":"經濟繁榮"},{"definition":["lit. mustn't speak of two things on the same day (idiom); not to be mentioned in the same breath\/incomparable"],"pinyin":["bu4 ke3 tong2 ri4 er2 yu3"],"word":"不可同日而語"},{"definition":["stuck and not moving forward (idiom); stagnant\/in a rut\/at a standstill"],"pinyin":["ting2 zhi4 bu4 qian2"],"word":"停滯不前"},{"definition":["posture\/situation"],"pinyin":["tai4 shi4"],"word":"態勢"},{"definition":["to tamp\/to ram (earth etc)"],"pinyin":["hang1 shi2"],"word":"夯實"},{"definition":["professionalization"],"pinyin":["zhi2 ye4 hua4"],"word":"職業化"},{"definition":["a hundred flowers bloom (idiom); let the arts have free expression"],"pinyin":["bai3 hua1 qi2 fang4"],"word":"百花齊放"},{"definition":["to surge like a gathering storm (idiom)\/to grow by leaps and bounds"],"pinyin":["feng1 qi3 yun2 yong3"],"word":"風起雲湧"}]}