{"definition":["form (used in programming languages such as Visual Basic and Delphi to create a GUI window)"],"pinyin":["chuang1 ti3"],"simplified":["窗体"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"窗體","characters":[{"definition":["shutter\/window\/CL:扇[shan4]"],"pinyin":["chuang1"],"word":"窗"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[],"sentences":[{"english":"This change takes two forms.","chinese":"該更改需要兩個窗體。"},{"english":"The system needs the coordinates of the minimized rectangle for the window.","chinese":"系統需要窗體的最小矩形框的座標。"},{"english":"Repaints a Form or control and refreshes any values.","chinese":"重新繪製窗體或控件並刷新任何值。"},{"english":"Once attached, the custom menu bar replaces the built-in menu bar for the form or report.","chinese":"附加的自定義菜單欄將替換窗體或報表的內置菜單欄。"},{"english":"Wa anted the background of the form for one of my projects to be translucent.","chinese":"要爲我的項目之一窗體的背景是半透明的。"},{"english":"Forms that are displayed modally are typically used as dialog boxes in an application.","chinese":"有模式顯示的窗體通常用作應用程序中的對話框。"},{"english":"If the form is paginated into several screens, each screen contains the footer.","chinese":"如果窗體被分頁爲多個屏幕，則每個屏幕都包含頁腳。"},{"english":"Changes the size, position, and Z order of a child, pop-up, or top-level window.","chinese":"主要用來顯示窗體的位置大小等。"},{"english":"This effectively has all your fields included on our form.","chinese":"此操作可以讓窗體有效地包括所有字段。"},{"english":"The Startup form appears automatically when you open Northwind.","chinese":"打開“羅斯文”數據庫時會自動顯示“啓動”窗體。"},{"english":"Horizontal and Vertical Scrolling Form E - This is a form with a horizontal and vertical scrollbar.","chinese":"這是一個窗體，帶有一個水平和垂直的滾動條。"},{"english":"The code page for the windows variant of the Latin1 character set.","chinese":"這一頁使用拉丁字符集定義了窗體變量。"},{"english":"The designer host is the nucleus of the forms designer.","chinese":"設計器宿主是窗體設計器的核心。"},{"english":"ListEntry Represents an item in a drop-down form field.","chinese":"代表了一個下拉型窗體字段項。"},{"english":"The forms designer infrastructure is built on top of services.","chinese":"窗體設計器基礎結構是在服務之上生成的。"},{"english":"Finally the design of the main form of the reviewing terminal is described.","chinese":"最後描述了閱卷終端主窗體的設計。"}],"related":[]}