{"definition":["to pry into or spy on\/to snoop\/to peep\/to poke one's nose into\/to peer\/to get a glimpse of"],"pinyin":["kui1 tan4"],"simplified":["窥探"],"rank":29095.0,"normalized_rank":0.4070767982315,"fraction":0.0000010203836117649059,"cumulative_fraction":0.989355452025682,"word":"窺探","characters":[{"definition":["to peep\/to pry into"],"pinyin":["kui1"],"word":"窺"},{"definition":["to explore\/to search out\/to scout\/to visit\/to stretch forward"],"pinyin":["tan4"],"word":"探"}],"containing_words":[],"sentences":[{"english":"Here are the three most common ways everyone reported snooping","chinese":"以下是人們提供的三中最常見的窺探方式。"},{"english":"These are the names of the men which Moses sent to spy out the land.","chinese":"這就是摩西所打發，窺探那地之人的名字。"},{"english":"This exposes your administrative password to anyone looking over your shoulder.","chinese":"這會向任何窺探您左右的人暴露您的管理密碼。"},{"english":"We were sidetracked for a long time and children came and peeked in.","chinese":"我們乘的火車在旁軌上停了好久，有些兒童進來窺探。"},{"english":"The thieves cased Wilson's house before the robbery.","chinese":"那些盜賊在搶劫前窺探了威爾遜的住宅。"},{"english":"20% of couples had one text snooper.","chinese":"20%的夫婦中有一方是窺探者。"},{"english":"They left and went up into the hill country, and came to the Valley of Eshcol and explored it.","chinese":"於是他們起身上山地去，到以實各谷，窺探那地。"},{"english":"The backstage activities are a mysterious world for this youngster.","chinese":"綵樓背後的戲棚是孩童攀爬窺探的神祕世界。"},{"english":"He skulked around outside until the police had gone.","chinese":"他窺探著四周，直至見到警察走開。"},{"english":"I'm one individuing who watches what our lecl posters do more thone what our lecl posters promise.","chinese":"我只是一個窺探我們指導人手腳多過應許的人。"},{"english":"So they went up, and searched the land from the wilderness of Zin unto Rehob, as men come to Hamath.","chinese":"他們上去窺探那地，從尋的曠野到利合，直到哈馬口。"},{"english":"Well... you could read the documentation or peek at it's source code.","chinese":"嗯，你當然可以去閱讀文檔或是窺探一下它的源代碼。"},{"english":"I've also come across instances where he has snooped behind my back to find out what I've been doing.","chinese":"我還在無意中發現，他居然暗中窺探我做的事情。"},{"english":"People guessed, people knew, and eventually it was only a matter of time before it all had to come out.","chinese":"人們的猜疑，窺探，到最後事情最終被敗露。"},{"english":"And above all, don't go  snooping around the house.","chinese":"最重要的是，不要在屋子裏四處窺探。"},{"english":"And they turned and went up into the mountain， and came unto the valley of Eshcol， and searched it out.","chinese":"於是他們起身上山地去，到以實各谷，窺探那地。"}],"related":[{"definition":["to peep\/to pry into"],"pinyin":["kui1"],"word":"窺"},{"definition":["to hide\/to conceal\/to mask\/to shelter\/to harbor (i.e. keep sth hidden)\/to hide oneself\/to lie low\/to nestle\/hidden\/implicit\/private\/covert\/recessed (lighting)"],"pinyin":["yin3 cang2"],"word":"隱藏"},{"definition":["to peep at\/to spy on\/to peek"],"pinyin":["kui1 shi4"],"word":"窺視"},{"definition":["to sense\/to perceive\/to become aware of\/to detect"],"pinyin":["cha2 jue2"],"word":"察覺"},{"definition":["to cover up\/to hide\/to conceal"],"pinyin":["yin3 ni4"],"word":"隱匿"},{"definition":["not knowing anything at all (idiom); completely ignorant\/without an inkling"],"pinyin":["yi1 wu2 suo3 zhi1"],"word":"一無所知"},{"definition":["to search\/to seek\/to explore"],"pinyin":["tan4 xun2"],"word":"探尋"},{"definition":["to transform\/to convert\/to vary\/to alternate\/a transformation"],"pinyin":["bian4 huan4"],"word":"變換"},{"definition":["to recount\/to tell of\/to relate\/(fig.) (of a thing) to stand as testament to (some past history)"],"pinyin":["su4 shuo1"],"word":"訴說"},{"definition":["secret\/hidden"],"pinyin":["yin3 mi4"],"word":"隱秘"},{"definition":["to experience\/to realize\/to comprehend"],"pinyin":["ti3 wu4"],"word":"體悟"},{"definition":["to gaze at\/to fix one's eyes on"],"pinyin":["ning2 shi4"],"word":"凝視"},{"definition":["to touch"],"pinyin":["chu4 mo1"],"word":"觸摸"},{"definition":["difference\/peculiar"],"pinyin":["yi4 yang4"],"word":"異樣"},{"definition":["thought-provoking\/worth thinking over\/to provide food for thought"],"pinyin":["nai4 ren2 xun2 wei4"],"word":"耐人尋味"},{"definition":["accustomed to\/used to"],"pinyin":["xi2 yi3 wei2 chang2"],"word":"習以為常"}]}