{"definition":["to stand\/to have a footing\/to be established\/to base oneself on"],"pinyin":["li4 zu2"],"simplified":["立足"],"rank":7130.0,"normalized_rank":0.09975795055475496,"fraction":0.000014332229382931363,"cumulative_fraction":0.8984073695369661,"word":"立足","characters":[{"definition":["surname Li","to stand\/to set up\/to establish\/to lay down\/to draw up\/at once\/immediately"],"pinyin":["Li4","li4"],"word":"立"},{"definition":["excessive","foot\/to be sufficient\/ample"],"pinyin":["ju4","zu2"],"word":"足"}],"containing_words":[{"definition":["foothold"],"pinyin":["li4 zu2 dian3"],"word":"立足點"}],"sentences":[{"english":"But Netease still cannot anticipate in the base oneself upon of enterprise mailbox market and development.","chinese":"但網易在企業郵箱市場的立足與發展仍然不可預期。"},{"english":"To make matters worse, Mr Berntsen Larsen quickly threw up after entering the tank, which was standing room only.","chinese":"更糟的是，他一進入僅有立足之地的馬桶就吐了。"},{"english":"We have to base itself, potential, and strengthen the goal, and strive to become.","chinese":"我們要立足自身，挖掘潛力，強化目標，力求成才。"},{"english":"I sink in deep mire, where there is no foothold.","chinese":"我身陷泥潭中，找不到立足點。"},{"english":"Fourthly, it finds solution to the centurial problem.","chinese":"它找到了破解世紀難題的立足點。"},{"english":"China's energy development is based on the principle of relying on domestic resources.","chinese":"中國能源發展堅持立足國內的基本方針。"},{"english":"It is also encouraging the purchase and consumption of local produce, communicating its long-term benefits.","chinese":"從長遠的利益考慮，鼓勵自產自銷是基本立足點。"},{"english":"Bonovo is a China-based company with a 17 year history as a pioneer in the Chinese orthopedic industry.","chinese":"博能華立足中國，擁有17年領先的骨科行業歷史。"},{"english":"The mountain climber could not find many footholds on the melting ice.","chinese":"登山者在融化的冰上找不到多少立足之處。"},{"english":"This method is so anchored in the context of construction that it seems difficult to change.","chinese":"這種方法是立足於建設的背景下，這似乎很難改變。"},{"english":"It was difficult to get even a toehold in the kitchen dinnerware market.","chinese":"在廚房餐具市場立足甚至佔有一席之位是很難。"},{"english":"If you doubt yourself, then indeed you stand on shaky ground。(Ibsen, Norwegian dramatist)","chinese":"如果你懷疑自己，那麼你的立足點確實不穩固了。"},{"english":"The original school was based in Epicurus ' home and garden.","chinese":"最初的學校立足於伊壁鳩魯的家和花園。"},{"english":"Pure Stannum Mill\" comes from Malaysia, and is established in China.\"","chinese":"純錫坊”源自馬來西亞，立足於中國。"},{"english":"KETUT: Keep grounded so it's like you have four legs, that way you can stay in this world.","chinese":"你要像四隻腳著地，這樣你能在這個世界立足。"},{"english":"It’s an evidence-based approach rather than a faith-based one.","chinese":"這是個立足於證據而非立足於信仰的方法。"}],"related":[{"definition":["to stand firmly\/to gain a foothold\/to establish oneself"],"pinyin":["zhan4 wen3 jiao3 gen1"],"word":"站穩腳跟"},{"definition":["foundation"],"pinyin":["gen1 ji1"],"word":"根基"},{"definition":["to take root"],"pinyin":["zha1 gen1"],"word":"扎根"},{"definition":["foothold"],"pinyin":["li4 zu2 dian3"],"word":"立足點"},{"definition":["settle down and get on with one's pursuit"],"pinyin":["an1 shen1 li4 ming4"],"word":"安身立命"},{"definition":["to put effort into sth\/to try really hard"],"pinyin":["zhuo2 li4"],"word":"著力"},{"definition":["to break new ground (for agriculture)\/to open up (a new seam)\/to develop (border regions)\/fig. to open up (new horizons)"],"pinyin":["kai1 tuo4"],"word":"開拓"},{"definition":["to gain a firm foothold\/(fig.) to get oneself established"],"pinyin":["zhan4 wen3 jiao3 bu4"],"word":"站穩腳步"},{"definition":["to stand firm"],"pinyin":["zhan4 wen3"],"word":"站穩"},{"definition":["to rely on\/to depend on\/support"],"pinyin":["yi1 tuo1"],"word":"依託"},{"definition":["heel"],"pinyin":["jiao3 gen1"],"word":"腳跟"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"發展"},{"definition":["to borrow sb's authority\/to seize an opportunity"],"pinyin":["jie4 shi4"],"word":"借勢"},{"definition":["to lay (a foundation)\/to conquer (a city etc)\/to shoot down (a bird etc)"],"pinyin":["da3 xia4"],"word":"打下"},{"definition":["firm and substantial\/solid"],"pinyin":["jian1 shi2"],"word":"堅實"},{"definition":["to tamp\/to ram (earth etc)"],"pinyin":["hang1 shi2"],"word":"夯實"}]}