{"definition":["ill-founded\/groundless"],"pinyin":["zhan4 bu5 zhu4 jiao3"],"simplified":["站不住脚"],"rank":24381.0,"normalized_rank":0.34112182222657506,"fraction":0.0000015718870860492858,"cumulative_fraction":0.9833472761017056,"word":"站不住腳","characters":[{"definition":["station\/to stand\/to halt\/to stop\/branch of a company or organization\/website"],"pinyin":["zhan4"],"word":"站"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to live\/to dwell\/to stay\/to reside\/to stop\/(suffix indicating firmness, steadiness, or coming to a halt)"],"pinyin":["zhu4"],"word":"住"},{"definition":["foot\/leg (of an animal or an object)\/base (of an object)\/CL:雙|双[shuang1],隻|只[zhi1]\/classifier for kicks","variant of 角[jue2]\/role"],"pinyin":["jiao3","jue2"],"word":"腳"}],"containing_words":[],"sentences":[{"english":"The opinion does not survive experience of a popular Continental camping place.","chinese":"但這種說法在受人歡迎的歐洲露營地是站不住腳的。"},{"english":"The researches of these scholars have shown that the old theory is untenable.","chinese":"這些學者的研究表明那個舊學說是站不住腳的。"},{"english":"But another official said such assertions are groundless.","chinese":"但另一名官員說，這種斷言是站不住腳的。"},{"english":"To argue otherwise is trying to defend the indefensible.","chinese":"持相反的論點就是試圖爲站不住腳的事情強辯。"},{"english":"None of his arguments seemed to me to hold water.","chinese":"對我來說，他所有的論點都是站不住腳的。"},{"english":"It was easy to pick holes in his flimsy argument.","chinese":"在他那番站不住腳的論點中找漏洞是很容易的。"},{"english":"I'm not prepared to listen to your weak excuses.","chinese":"我不想聽你那站不住腳的藉口。"},{"english":"Your argument is ill-founded.","chinese":"你的理由站不住腳。"},{"english":"This argument is not valid.","chinese":"這個論點是站不住腳的。"},{"english":"The claim that the crisis was due to insufficient regulation is also unconvincing.","chinese":"危機是由於監管不足的說法也站不住腳。"},{"english":"The Lawyer may refuse to undertake a case which appears to him unsound.","chinese":"律師可能拒絕承辦他認爲站不住腳的案件。"},{"english":"But the proportion of that increase ascribable to renminbi appreciation is very much debatable.","chinese":"但把增長歸結於人民幣的升值那就太站不住腳了。"},{"english":"This faith may be ill-founded .","chinese":"這個信念也許是站不住腳的。"},{"english":"Prejudice and lies are untenable and the Cold War mentality has no popular support.","chinese":"他表示，偏見和謊言站不住腳，冷戰思維不得人心。"},{"english":"Most of the arguments put forward by our opponents simply do not hold water.","chinese":"我們的對手提出的大部辯白解都站不住腳。"},{"english":"This disproves the theory that children are purely imitative.","chinese":"這證明認爲兒童只會單純地模仿的理論是站不住腳的。"}],"related":[]}