{"definition":["rule"],"pinyin":["zhang1 ze2"],"simplified":["章则"],"rank":70786.0,"normalized_rank":0.9903879786772628,"fraction":2.1896644029289827e-9,"cumulative_fraction":0.9999987054703892,"word":"章則","characters":[{"definition":["chapter\/section\/clause\/movement (of symphony)\/seal\/badge\/regulation\/order","surname Zhang"],"pinyin":["Zhang1","zhang1"],"word":"章"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"則"}],"containing_words":[],"sentences":[{"english":"Chapter Five analyses the creative features of new scenarios of Shanghai\"s Peking Opera.\"","chinese":"第五章則是對上海京劇新編劇本創作特點的分析。"},{"english":"Chapter 3 is focused on the performance characteristics of \"Tashanji\".","chinese":"第三章則集中探究了《他山集》的演奏特點。"},{"english":"I have read and agree to competition regulation.","chinese":"本人巳閱讀並同意遵守大會規定章則。"},{"english":"And anti-pollution measures and regulations are falling far short of getting to grips with it.","chinese":"而反污染措施及規章則鞭長莫及，束手無策。"},{"english":"The fourth chapter describes the today's Sibeichai.","chinese":"第四章則敘述當今的寺北柴。"},{"english":"Chapter Four examines the history of two pianos and gives suggestions on the performing of two pianos works.","chinese":"第四章則是關於雙鋼琴歷史與雙鋼琴演奏方面的建議。"},{"english":"Organiser reserves the final right for any amendment.","chinese":"大會保留最後修訂賽事及報名章則之權利。"},{"english":"The second chapter examines the cultural characteristics of song and dance duet.","chinese":"第二章則考察了二人轉的文化特徵。"},{"english":"In the third chapter, the thesis author analyses Pearl Buck's formation of feminism.","chinese":"第三章則分析了賽珍珠女性觀的成因。"},{"english":"Chapter Three: This chapter has stated measures about solving problems from point of inside management.","chinese":"第三章則從內部管理的角度提出瞭解決問題的措施。"},{"english":"Bahasa Malaysia and English newspapers have steered clear of reporting his statements for now.","chinese":"馬來文和英文報章則明顯地避開了關課題。"},{"english":"The fifth chapter discusses the case of relative extinguishment of security right on ships.","chinese":"第五章則探討了船舶擔保物權的相對消滅問題。"},{"english":"The communication language used by the system is referred in the sixth chapter, namely KQML.","chinese":"第六章則介紹了系統採用的通訊語言，即KQML。"},{"english":"Chapter four is about the comment of the theme of the death.","chinese":"第四章則對蘇童作品中的死亡主題作了價值評判。"},{"english":"There are intercessory as well as persistent prayers in chapter 9.","chinese":"而第九章則是一種認罪的代求和恆切的禱告。"}],"related":[]}