{"definition":["in keeping with\/in accordance with\/tallying with\/in line with\/to agree with\/to accord with\/to conform to\/to correspond with\/to manage\/to handle"],"pinyin":["fu2 he2"],"simplified":["符合"],"rank":979.0,"normalized_rank":0.013697480167335916,"fraction":0.00016327772737659348,"cumulative_fraction":0.6165373143076466,"word":"符合","characters":[{"definition":["mark\/sign\/talisman\/to seal\/to correspond to\/tally\/symbol\/written charm\/to coincide","surname Fu"],"pinyin":["Fu2","fu2"],"word":"符"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"}],"containing_words":[{"definition":["same sign, joint aim (idiom); fig. completely compatible\/identical"],"pinyin":["tong2 fu2 he2 qi4"],"word":"同符合契"},{"definition":["to comply with a standard\/standards-compliant"],"pinyin":["fu2 he2 biao1 zhun3"],"word":"符合標準"}],"sentences":[{"english":"Major non-conformities should require on-site verification within 80 days.","chinese":"嚴重不符合項應該要求在80天內完成現場驗證工作。"},{"english":"As to whether this accords with legal principle, it is disputable.","chinese":"但是否符合法律原理，卻值得商榷。"},{"english":"Offending United States because of Irq is not in their national interests.","chinese":"爲伊拉克而得罪美國，不符合他們的國家利益啊。"},{"english":"The cost of non-compliance with industry regulations can be catastrophic.","chinese":"對於不符合工業規則的代價可能是毀滅性的。"},{"english":"The officer will confirm that you still meet the requirements for admission to Canada.","chinese":"工作人員會確證你是否仍然符合移民加拿大的要求。"},{"english":"You should provide cost effective work within TAT.","chinese":"您應該提供符合成本效益達內的工作。"},{"english":"Do the project proposals in the pipeline correspond with market trends?","chinese":"正在進行中的項目提議是否符合市場趨勢？"},{"english":"Alert Bay is also the first marina we have stopped at that is truly affordable on our budget.","chinese":"阿樂灣也是我們停留的碼頭中最符合我們預算的。"},{"english":"The results of two three-ply samples calculated by this method are in good agreement with experimental data.","chinese":"給出的兩個三層樣品的計算結果與實驗值符合得很好。"},{"english":"Over centuries, particular vines have been chosen for their desirable characteristics.","chinese":"幾個世紀以來，尤其是葡萄樹已選擇符合自己特點。"},{"english":"Officials had accused them of violating health regulations.","chinese":"官員們指責他們的設備不符合衛生條例。"},{"english":"Results cultured cells showed the specific characteristics of bovine trabecular meshwork cells.","chinese":"結果體外培養細胞符合牛眼小梁細胞的特點。"},{"english":"Therefore, it should conform to the nature and be esthetical.","chinese":"它應該是符合大自然的，也必須是美的。"},{"english":"Results All the results of tests were consistent with the requirment of Chp. 2000.","chinese":"結果產品質量符合中國藥典2000版二部標準。"},{"english":"Facts have proven that the establishment of diplomatic ties between China and Dominica conforms to the fundamental interest of both countries.","chinese":"事實證明，中多建交符合兩國的根本利益。"},{"english":"To clumped populations, those index above are identical with the characters of clumped populations.","chinese":"而聚集分佈的種羣其聚集強度指標則符合聚集特徵。"}],"related":[{"definition":["to match\/to tally"],"pinyin":["xiang1 fu2"],"word":"相符"},{"definition":["rational\/reasonable\/fair"],"pinyin":["he2 li3"],"word":"合理"},{"definition":["(an official) standard\/norm\/criterion\/CL:個|个[ge4]"],"pinyin":["biao1 zhun3"],"word":"標準"},{"definition":["to follow\/to abide by\/to comply with\/compliance"],"pinyin":["zun1 xun2"],"word":"遵循"},{"definition":["unanimous\/identical (views or opinions)"],"pinyin":["yi1 zhi4"],"word":"一致"},{"definition":["according to\/in accordance with\/in the light of\/on the basis of"],"pinyin":["an4 zhao4"],"word":"按照"},{"definition":["condition\/circumstances\/term\/factor\/requirement\/prerequisite\/qualification\/CL:個|个[ge4]"],"pinyin":["tiao2 jian4"],"word":"條件"},{"definition":["to possess\/to have\/equipped with\/able to fulfill (conditions or requirements)"],"pinyin":["ju4 bei4"],"word":"具備"},{"definition":["to be a good fit\/to be identical with\/to adjust oneself to\/to fit in"],"pinyin":["wen3 he2"],"word":"吻合"},{"definition":["according to\/basis\/foundation"],"pinyin":["yi1 ju4"],"word":"依據"},{"definition":["to be applicable"],"pinyin":["shi4 yong4"],"word":"適用"},{"definition":["to request\/to require\/requirement\/to stake a claim\/to ask\/to demand\/CL:點|点[dian3]"],"pinyin":["yao1 qiu2"],"word":"要求"},{"definition":["to consult a reference\/to refer to (another document)"],"pinyin":["can1 zhao4"],"word":"參照"},{"definition":["agreement\/to agree\/to get on with\/congenial\/agreeing with\/to ally oneself with sb"],"pinyin":["qi4 he2"],"word":"契合"},{"definition":["according to\/in light of"],"pinyin":["yi1 zhao4"],"word":"依照"},{"definition":["clear-cut\/definite\/explicit\/to clarify\/to specify\/to make definite"],"pinyin":["ming2 que4"],"word":"明確"}]}