{"definition":["sb who is romantically involved with sb already in a committed relationship\/the other woman\/the other man\/third person\/third party (in dispute)\/disinterested party\/number three in a list"],"pinyin":["di4 san1 zhe3"],"simplified":["第三者"],"rank":10803.0,"normalized_rank":0.1511479859527374,"fraction":0.000007278298497709076,"cumulative_fraction":0.9359342853498104,"word":"第三者","characters":[{"definition":["(prefix indicating ordinal number, e.g. first, number two etc)\/order\/(old) rank in the imperial examinations\/mansion\/(literary) but\/just"],"pinyin":["di4"],"word":"第"},{"definition":["surname San","three\/3"],"pinyin":["San1","san1"],"word":"三"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"In this case the proforma invoice is required for a third party.","chinese":"這裏述及的形式發票是爲第三者索取的。"},{"english":"If they did, they would not have been tempted to commit adultery.","chinese":"如果他們知道，就不會被誘惑，成爲第三者了。"},{"english":"Is \"the Possible Experience\" also \"the Third Thing\" of Synthetic Judgment a Priori ? --H. J.","chinese":"可能經驗也是先天綜合判斷的第三者嗎？"},{"english":"The at last ought to marry the important hero , be a dream because of having had 'the third person' Duo A quietly.","chinese":"最後宜靜沒有嫁給大雄，是因爲有了第三者哆啦A夢。"},{"english":"I gar there must be a third person involved.","chinese":"我猜測一定是有第三者插足。"},{"english":"A slander is not actionable unless it is published to a third person.","chinese":"誹謗只有向第三者傳播才能起訴。"},{"english":"Depression can be like a third party that comes between couples and creates a sense of hopelessness.","chinese":"抑鬱症可以像夫妻間的第三者，並創造出絕望情緒。"},{"english":"It'seldom happened that a third party ever witnessed any of these prodigies.","chinese":"這類壯舉發生的時候，難得有第三者在場目睹過。"},{"english":"Zhai says Sudan had agreed not to transfer Chinese-made weapons to third parties.","chinese":"翟雋說，蘇丹同意不把中國製造的武器轉讓給第三者。"},{"english":"Please complete the following authorization form if you wish to authorise a third party to collect the securities.","chinese":"如閣下授權第三者代取股票，請填寫以下授權表格。"},{"english":"Bing and argue, honor with customers, we appealed to grasp bitterness toward refers to a third party.","chinese":"秉又與客戶爭執，榮勸解秉，秉向榮訴苦指有第三者。"},{"english":"Their marriage has broken just because of the other man.","chinese":"他們婚姻的破裂僅僅因爲有第三者插足。"},{"english":"Some star has come into frequent\/close contact with the other woman.","chinese":"湡某位明星最近和第三者有密切聯繫。"},{"english":"I gather there must be a third person involved.","chinese":"我猜測一定是有第三者插足。"},{"english":"So I left, so that I wouldn't be in the way.","chinese":"於是我離開了，我不願成爲礙事的第三者。"},{"english":"This application must be accompanied by a copy of the third party operator's valid Business Registration Certificate.","chinese":"申請表必須附同第三者經營的有效的商業登記證副本。"}],"related":[{"definition":["extramarital affair"],"pinyin":["hun1 wai4 qing2"],"word":"婚外情"},{"definition":["to squeeze in\/to step in\/to take part\/to step between (two persons in a relationship)"],"pinyin":["cha1 zu2"],"word":"插足"},{"definition":["see 婚外情[hun1 wai4 qing2]"],"pinyin":["hun1 wai4 lian4"],"word":"婚外戀"},{"definition":["extramarital"],"pinyin":["hun1 wai4"],"word":"婚外"},{"definition":["mistress\/the other woman (coll.)\/grade 3 in elementary school"],"pinyin":["xiao3 san1"],"word":"小三"},{"definition":["derailment (railway accident)\/to leave the rails\/fig. to overstep bounds\/fig. to have an extramarital affair"],"pinyin":["chu1 gui3"],"word":"出軌"},{"definition":["extramarital affair"],"pinyin":["wai4 yu4"],"word":"外遇"},{"definition":["matrimony\/wedding\/marriage\/CL:樁|桩[zhuang1],次[ci4]"],"pinyin":["hun1 yin1"],"word":"婚姻"},{"definition":["married man"],"pinyin":["you3 fu4 zhi1 fu1"],"word":"有婦之夫"},{"definition":["to do the splits (gymnastics)\/(Tw) two-timing (in romantic relationships)\/Taiwan pr. [pi1 tui3]"],"pinyin":["pi3 tui3"],"word":"劈腿"},{"definition":["to divorce\/divorced from (one's spouse)"],"pinyin":["li2 hun1"],"word":"離婚"},{"definition":["change of affection, shift of love (idiom); to change one's feelings to another love\/to fall in love with sb else"],"pinyin":["yi2 qing2 bie2 lian4"],"word":"移情別戀"},{"definition":["to have a foot in both camps\/to have a bet each way\/to be having an affair"],"pinyin":["jiao3 ta4 liang3 zhi1 chuan2"],"word":"腳踏兩隻船"},{"definition":["lit. to stand with each foot in a different boat (idiom)\/fig. to have it both ways\/to run after two hares\/(especially) to have two lovers at the same time"],"pinyin":["jiao3 ta4 liang3 tiao2 chuan2"],"word":"腳踏兩條船"},{"definition":["to rob sb of sth they cherish (idiom)"],"pinyin":["heng2 dao1 duo2 ai4"],"word":"橫刀奪愛"},{"definition":["lover\/sweetheart"],"pinyin":["qing2 ren2"],"word":"情人"}]}