{"definition":["(of writing) tone\/style"],"pinyin":["bi3 diao4"],"simplified":["笔调"],"rank":40310.0,"normalized_rank":0.5639891987183971,"fraction":3.7399468002027025e-7,"cumulative_fraction":0.9966063658504816,"word":"筆調","characters":[{"definition":["pen\/pencil\/writing brush\/to write or compose\/the strokes of Chinese characters\/classifier for sums of money, deals\/CL:支[zhi1],枝[zhi1]"],"pinyin":["bi3"],"word":"筆"},{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["diao4","tiao2"],"word":"調"}],"containing_words":[],"sentences":[{"english":"The style was hurried, the tone intemperate .","chinese":"匆促的筆調，放縱的語氣。"},{"english":"Tune in tomorrow for her Top 10 Cons of Virginity","chinese":"文字筆調上接她的《童貞的十大壞處》。"},{"english":"The editor would take a theme and embroider upon it with drollery.","chinese":"編輯會將一篇文章，以調侃式的幽默筆調加以渲染。"},{"english":"She answered his letter in such wise that she seemed more of less betwixt and between.","chinese":"她給他的覆信寫的多少似乎帶有摸棱兩可的筆調。"},{"english":"I feel heavy too, because I must write composition in a heavy style.","chinese":"我的心情也不很舒暢，因爲我要用沉重的筆調寫作文。"},{"english":"This book sentimentalizes the suffering of the disabled.","chinese":"這本書以柔懦的筆調渲染了殘疾人的痛苦。"},{"english":"Style fresh, beauty of language, metrical sense is strong, article is a good splendid text.","chinese":"筆調清新，語言優美，韻律感強，是一篇不錯的美文。"},{"english":"He wrote many books on science in a popular style.","chinese":"他用通俗的筆調寫了許多科學讀物。"},{"english":"Lu Xun writes with a leisurely pace.","chinese":"魯迅以一種悠閒的筆調進行寫作。"},{"english":"The bible exclusively rejoices in the birth of Jesus.","chinese":"聖經也用特別喜樂的筆調描寫耶穌的誕生。"}],"related":[]}