{"definition":["constant pressure\/equal pressure"],"pinyin":["deng3 ya1"],"simplified":["等压"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"等壓","characters":[{"definition":["class\/rank\/grade\/equal to\/same as\/to wait for\/to await\/et cetera\/and so on\/et al. (and other authors)\/after\/as soon as\/once"],"pinyin":["deng3"],"word":"等"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"}],"containing_words":[{"definition":["isobar (line of equal pressure)"],"pinyin":["deng3 ya1 xian4"],"word":"等壓線"}],"sentences":[{"english":"This algorithm can draw isobar accurately.","chinese":"該算法可精確地繪製出等壓線。"},{"english":"With the quotation of three pulse coefficients, the fluctuating turbine is regarded as isobaric turbine.","chinese":"引入三個脈衝係數將脈衝渦輪按等壓渦輪計算。"},{"english":"As an example, the isobars are plotted for strong detonation waves passing over a wedge surface.","chinese":"作爲例子，文中計算了強爆震波繞薄楔時的等壓線。"},{"english":"Pressure differences are indicated on weather maps by isobars.","chinese":"在氣象圖上氣壓差用等壓線表示。"},{"english":"Path number 2 on my diagram it's a reversible, this path number 2, it's a reversible constant pressure path.","chinese":"路徑，首先是一個，等壓過程。"},{"english":"The pressure equalized rain-screen (PER) walls were exactly proposed in this context.","chinese":"等壓雨幕牆正是在這一背景下誕生的。"},{"english":"Therefore, the equal pressure method and the sensing method will be the future trend.","chinese":"因此，等壓法和傳感法將是今後的發展趨勢。"},{"english":"So the first path then, the first path, 1 constant volume constant V, so I'm going to, again, let's just worry about energy.","chinese":"首先，是路徑，等壓過程。"},{"english":"The design of spring is the critical factor to the feature of isobar filling valve.","chinese":"彈簧設計對於等壓灌裝閥的性能起着決定性的作用。"},{"english":"A region of low pressure with roughly concentric isobars is known technically as a cyclone .","chinese":"具有大致同心的等壓線的低壓區在技術上稱爲氣旋。"},{"english":"On this basis, the new technology of thermal isobaric method steel plastic clad tube is developed.","chinese":"在此基礎上開發了熱等壓法鋼塑複合新技術。"},{"english":"Whereas, like isobaric means constant pressure.","chinese":"等壓“指壓強不變。"},{"english":"P dV is equal to R dT. pV = RT for 1 mole, pdV=RdT so I just take dV here.","chinese":"對等壓過程，那麼。"},{"english":"The atmosphere pressure gradient is an inverse measure of the spacing of the isobars on a weather map.","chinese":"氣壓梯度與天氣圖上等壓線的間隔大小成反比。"},{"english":"Micropore filtration under constant driving pressure is a powerful tool for assessing the RBC deformability.","chinese":"等壓微孔過濾法是測定紅細胞變形性的重要手段。"}],"related":[]}