{"definition":["(usually used in the negative) to answer or reply to sb's question"],"pinyin":["da2 dui4"],"simplified":["答对"],"rank":28236.0,"normalized_rank":0.3950582737537252,"fraction":0.000001102423038061312,"cumulative_fraction":0.9884440264065631,"word":"答對","characters":[{"definition":["reply\/answer\/return\/respond\/echo","to answer\/to agree"],"pinyin":["da1","da2"],"word":"答"},{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"}],"containing_words":[],"sentences":[{"english":"You got a l5 out of 15 on your Part 1 idiom quiz!","chinese":"你在第一部分十五道成語測驗題中答對了五道。"},{"english":"If you guessed the Anti-Mason Party, you win the cigar.","chinese":"如果你回答是反共濟黨的話，那麼恭喜你，你答對了。"},{"english":"Test takers who correctly answer 60% of the test questions or above will be awarded a certificate.","chinese":"各等級測驗答對總題數之60%以上者可獲得證書。"},{"english":"OK, great. So, the majority of you got it right.","chinese":"非常好你們大多數都答對了。"},{"english":"A row of the correct answer to the question of the more points you get you have.","chinese":"請你再試答一下，仔細想想，我認爲你會答對的。"},{"english":"We get the key when we answer certain questions correctly.","chinese":"當答對某個問題時獲得某把鑰匙。"},{"english":"Test takers who answer 60% or more of the test questions correctly will be awarded a certificate.","chinese":"各等級測驗答對總題數之60%以上者可獲得證書。"},{"english":"For its first seven weeks, FreeRice gave 10 grains of rice for each correct answer.","chinese":"剛開始的七週，每答對一個問題是10粒大米。"},{"english":"If you guessed posture then you are correct.","chinese":"如果你猜的是“站姿”，那你就答對了。"},{"english":"The majority of the study volunteers got the person's job correctly, but struggled with the name.","chinese":"大多數志願者答對了工作，但卻總記不起名字。"},{"english":"And most of you got that, about 75% of you got that right.","chinese":"你們大多數都得出這個答案，大概75%都答對了。"},{"english":"I miss all the ten questions but two.","chinese":"十道題我只答對了兩道，其他的全錯了。"},{"english":"The monkeys were rewarded with Kool-Aid for choosing the right answers.","chinese":"答對題目後，猴子會有酷愛飲料做獎勵。"},{"english":"I really enjoy them and even answered most of the questions correctly.","chinese":"我非常喜歡這些節目，甚至大部分問題我都答對了。"},{"english":"Two points for every one right.","chinese":"每答對一題得兩分。"},{"english":"If you answer this question correctly, it's worth five points.","chinese":"答對了這道題可以得五分。"}],"related":[]}