{"definition":["administrative committee\/management committee\/abbr. for 管理委員會|管理委员会[guan3 li3 wei3 yuan2 hui4]"],"pinyin":["guan3 wei3 hui4"],"simplified":["管委会"],"rank":10589.0,"normalized_rank":0.14815384830635345,"fraction":0.0000075219351569416414,"cumulative_fraction":0.9343500197989368,"word":"管委會","characters":[{"definition":["surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["Guan3","guan3"],"word":"管"},{"definition":["same as 逶 in 逶迤 winding, curved","surname Wei","to entrust\/to cast aside\/to shift (blame etc)\/to accumulate\/roundabout\/winding\/dejected\/listless\/committee member\/council\/end\/actually\/certainly"],"pinyin":["Wei3","wei1","wei3"],"word":"委"},{"definition":["can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])","to balance an account\/accountancy\/accounting"],"pinyin":["hui4","kuai4"],"word":"會"}],"containing_words":[],"sentences":[{"english":"I was part of the student government in the dorms.","chinese":"我是學生宿舍管委會的成員。"},{"english":"The MC inside the screen was to be removed later by acidizing.","chinese":"管委會內屏幕則必須拆除後酸化。"},{"english":"It enjoys municipal level authority in economy management.","chinese":"開發區管委會享有地市級經濟管理權限。"},{"english":"If an exemption is still necessary after these periods of exemption expire, it depends on the decision of the ETDZAC.","chinese":"免稅期滿後需要繼續減免的，由開發區管委會決定。"},{"english":"In charge of Chenggong New Area Administrative Committee, Kunming Xindu Investment Co., Ltd..","chinese":"分管呈貢新區管委會，昆明新都投資有限公司。"},{"english":"A second new application was setting MC across producing perforations for a temporary abandonment plug.","chinese":"第二個新申請設置管委會橫跨產齒孔爲暫時放棄堵塞。"},{"english":"Hello dear friends, I am the Director of the Administrative Committee.","chinese":"各位朋友大家好，我是這個景區的管委會主任。"},{"english":"Deputy Director of the Management Committee of PUYUAN sweater market Zhu Shaoming said.","chinese":"濮院羊毛衫市場管委會副主任朱少明如是說。"},{"english":"Luo Shehui, director of the Administrative Commission of the Changsha High-tech Industrial Development Zone, attended the meeting.","chinese":"長沙高新區管委會主任羅社輝參加會見。"},{"english":"In charge of Chenggong New Area Administrative Committee, Kunming Xindu Investment Co. , Ltd.","chinese":"分管呈貢新區管委會，昆明新都投資有限公司。"}],"related":[{"definition":["department head\/section chief"],"pinyin":["chu4 zhang3"],"word":"處長"},{"definition":["administrative committee\/management committee"],"pinyin":["guan3 li3 wei3 yuan2 hui4"],"word":"管理委員會"},{"definition":["committee member\/committee\/council\/CL:個|个[ge4]"],"pinyin":["wei3 yuan2"],"word":"委員"},{"definition":["secretary (chief official of a branch of a socialist or communist party)\/clerk\/scribe"],"pinyin":["shu1 ji5"],"word":"書記"},{"definition":["secretary-general"],"pinyin":["mi4 shu1 zhang3"],"word":"秘書長"},{"definition":["director general"],"pinyin":["li3 shi4 zhang3"],"word":"理事長"},{"definition":["head of a (government etc) department\/section chief\/section head\/secretary\/minister\/CL:個|个[ge4],位[wei4],名[ming2]"],"pinyin":["bu4 zhang3"],"word":"部長"},{"definition":["committee"],"pinyin":["wei3 yuan2 hui4"],"word":"委員會"},{"definition":["bureau chief\/CL:位[wei4],個|个[ge4]"],"pinyin":["ju2 zhang3"],"word":"局長"},{"definition":["general manager\/CEO"],"pinyin":["zong3 jing1 li3"],"word":"總經理"},{"definition":["person in charge"],"pinyin":["fu4 ze2 ren2"],"word":"負責人"},{"definition":["Hong Kong and Macao Affairs Office of the State Council (abbr. for 國務院港澳事務辦公室|国务院港澳事务办公室[Guo2 wu4 yuan4 Gang3 Ao4 Shi4 wu4 Ban4 gong1 shi4])"],"pinyin":["Gang3 ao4 ban4"],"word":"港澳辦"},{"definition":["deputy mayor"],"pinyin":["fu4 shi4 zhang3"],"word":"副市長"},{"definition":["Liaison Office of the Central People's Government in the Hong Kong Special Administrative Region (abbr. for 中央人民政府駐香港特別行政區聯絡辦公室|中央人民政府驻香港特别行政区联络办公室[Zhong1 yang1 Ren2 min2 Zheng4 fu3 Zhu4 Xiang1 gang3 Te4 bie2 Xing2 zheng4 qu1 Lian2 luo4 Ban4 gong1 shi4]) or the equivalent office in Macao"],"pinyin":["Zhong1 lian2 ban4"],"word":"中聯辦"},{"definition":["abbr. for 民主建港協進聯盟|民主建港协进联盟, Democratic alliance for the betterment of Hong Kong (DAB), Hong Kong pro-Beijing party"],"pinyin":["min2 jian4 lian2"],"word":"民建聯"},{"definition":["(political, economic etc) affairs\/work\/transaction (as in a computer database)"],"pinyin":["shi4 wu4"],"word":"事務"}]}