{"definition":["to control"],"pinyin":["guan3 kong4"],"simplified":["管控"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"管控","characters":[{"definition":["surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["Guan3","guan3"],"word":"管"},{"definition":["to control\/to accuse\/to charge\/to sue\/to invert a container to empty it\/(suffix) (slang) buff\/enthusiast\/devotee\/-phile or -philia"],"pinyin":["kong4"],"word":"控"}],"containing_words":[],"sentences":[{"english":"Is there an evidence that black oxide thickness is well controlled?","chinese":"是否能證明黑化厚度有很好的管控？"},{"english":"The pressure in the swim bladder is regulated by a gas gland.","chinese":"魚鰾中的壓力由一個氣體腺來管控。"},{"english":"With so much top line growth hitting the books they stop monitoring invoices and expense reports.","chinese":"因爲收入豐厚，他們也就不再管控支出報告了。"},{"english":"Is the front-to-back registration on layers measured and controlled?","chinese":"是否測試並管控層間上下對準度？"},{"english":"The Russians asserted their intention to keep control of the airport.","chinese":"不過俄羅斯方面宣稱他們的意圖是爲了管控機場。"},{"english":"A financial budget and other system modules to achieve procurement budget reasonable control.","chinese":"結合財務預算等系統模塊，實現採購預算的合理管控。"},{"english":"Chavez last week announced an increase in the regulated prices of corn and sorghum.","chinese":"上週查韋斯剛剛宣佈提高玉米和高粱的管控價格。"},{"english":"Study on Traffic Flow and its Management - control Based on Seif - organization Theory.","chinese":"基於自組織理論的交通流及其管控研究。"},{"english":"Are thermal stressed cross-sections performed as an in-process plating control?","chinese":"製程電鍍管控是否有熱應力切片試驗？"},{"english":"Some employees need high amounts of control and encouragement.","chinese":"某些下屬需要相當多的管控與鼓勵。"},{"english":"Is there evidence to demonstrate that spindle run-out is well controlled?","chinese":"是否能證明鑽軸偏移管控良好？"},{"english":"Are the maximum number of re-sharpens documented &controlled?","chinese":"是否有文件規定並對最大研磨次數進行管控？"},{"english":"Also, inventoried under FIFO with expired date control?","chinese":"並且，到期管控有先進先出目錄？"},{"english":"Are the customer specific ENIG thickness requirements documented on the traveler?","chinese":"是否有文件規定按照客人規定的化鎳金厚度進行管控？"},{"english":"Is the lay-up done in a clean room with adequate temperature and humidity control?","chinese":"疊合線無塵室是否有相應的溫度與溼度管控？"},{"english":"Are cross-sections performed as an in-process plating control?","chinese":"製程電鍍管控是否有進行切片確認？"}],"related":[{"definition":["to supervise\/to manage\/to administer\/management\/administration\/CL:個|个[ge4]"],"pinyin":["guan3 li3"],"word":"管理"},{"definition":["to control\/to restrict\/(PRC law) non-custodial sentence with specified restrictions on one's activities for up to 3 years (e.g. not to participate in demonstrations)"],"pinyin":["guan3 zhi4"],"word":"管制"},{"definition":["to prevent and control (e.g. the spread of a communicable disease)"],"pinyin":["fang2 kong4"],"word":"防控"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落實"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"監管"},{"definition":["to increase (e.g. one's effort)"],"pinyin":["jia1 da4"],"word":"加大"},{"definition":["micromanagement"],"pinyin":["xi4 hua4 guan3 li3"],"word":"細化管理"},{"definition":["to govern\/to administer\/to manage\/to control\/governance"],"pinyin":["zhi4 li3"],"word":"治理"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"規範"},{"definition":["to investigate strictly"],"pinyin":["yan2 cha2"],"word":"嚴查"},{"definition":["normalized (statistics)\/to normalize (relations etc)\/to become the norm"],"pinyin":["chang2 tai4 hua4"],"word":"常態化"},{"definition":["measure\/step\/CL:個|个[ge4]"],"pinyin":["cuo4 shi1"],"word":"措施"},{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"實行"},{"definition":["to strike a severe blow\/to crack down\/to take strong measures"],"pinyin":["yan2 li4 da3 ji1"],"word":"嚴厲打擊"},{"definition":["to ensure\/to guarantee"],"pinyin":["que4 bao3"],"word":"確保"},{"definition":["to give a more granular level of detail\/to elaborate\/to refine\/to become more differentiated"],"pinyin":["xi4 hua4"],"word":"細化"}]}