{"definition":["throttle"],"pinyin":["jie2 qi4 men2"],"simplified":["节气门"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"節氣門","characters":[{"definition":["festival\/holiday\/node\/joint\/section\/segment\/part\/to economize\/to save\/to abridge\/moral integrity\/classifier for segments, e.g. lessons, train wagons, biblical verses\/CL:個|个[ge4]","see 節骨眼|节骨眼[jie1 gu5 yan3]"],"pinyin":["jie1","jie2"],"word":"節"},{"definition":["gas\/air\/smell\/weather\/to make angry\/to annoy\/to get angry\/vital energy\/qi"],"pinyin":["qi4"],"word":"氣"},{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["Men2","men2"],"word":"門"}],"containing_words":[],"sentences":[{"english":"The carburetor obtains this enrichment by the addition of a choke valve in the carburetor throat above the venture and main nozzle.","chinese":"所以在節氣門和主噴管的上方增加了一個阻風門。"},{"english":"Three types and their properties of gas valves of electronic control automobile engine are introduced.","chinese":"介紹了電控發動機節氣門體的三種類型及特點。"},{"english":"According to test-bed trial the result is perfect.","chinese":"經過臺架試驗，節氣門控制效果理想。"},{"english":"Fit cover for throttle body.","chinese":"安裝節氣門體蓋。"},{"english":"There is in fact so much speed in the actuator that hydraulic restrictors are used to slow it down and prevent damage.","chinese":"事實上液壓節氣門減慢了驅動器的速度以防止損壞。"},{"english":"Throttle Body Assemblies described here use an aluminum casting.","chinese":"這裏描述的節氣門體組件使用的鋁鑄件。"}],"related":[]}