{"definition":["arthropod"],"pinyin":["jie2 zhi1 dong4 wu4"],"simplified":["节肢动物"],"rank":58104.0,"normalized_rank":0.8129503448854812,"fraction":5.503356532694843e-8,"cumulative_fraction":0.9997235786634829,"word":"節肢動物","characters":[{"definition":["festival\/holiday\/node\/joint\/section\/segment\/part\/to economize\/to save\/to abridge\/moral integrity\/classifier for segments, e.g. lessons, train wagons, biblical verses\/CL:個|个[ge4]","see 節骨眼|节骨眼[jie1 gu5 yan3]"],"pinyin":["jie1","jie2"],"word":"節"},{"definition":["limb"],"pinyin":["zhi1"],"word":"肢"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"}],"containing_words":[],"sentences":[{"english":"The world largest arthropod is the Japanese Spider Crab.","chinese":"世界上最大的節肢動物是日本蜘蛛蟹。"},{"english":"Crayfish belong to a group of animals called Crustaceans and are part of the phylum Arthropoda.","chinese":"所有的節肢動物都有堅硬的外殼起到骨骼的作用。"},{"english":"A segment of the limb of an arthropod.","chinese":"節肢動物中一類包括水黽。"},{"english":"How many legs do centipedes and millipedes have?","chinese":"蜈蚣和倍足綱節肢動物有多少條腿？"},{"english":"It may be mechanically transmitted by arthropods .","chinese":"它可以通過節肢動物機械地傳播。"},{"english":"Butterflies and shrimps and other animals with jointedlegs belong to Arthropoda.","chinese":"蝴蝶和蝦以及其他長有節足的動物屬於節肢動物門。"},{"english":"Scorpion is arthropod poisonous insect.","chinese":"蠍，節肢動物綱毒蟲。"},{"english":"The arthropod community structure and diversity influenced by the forest type.","chinese":"林分類型對節肢動物羣落結構及多樣性的影響。"},{"english":"The Japanese Spider Crab is the World's Largest Crustacean and Arthropod.","chinese":"日本蜘蛛蟹，是世界上最大的甲殼動物和節肢動物。"},{"english":"Permethrin repels and kills mosquitoes as well as ticks and other arthropods.","chinese":"菊酯排斥和殺死蚊子以及蜱和其他節肢動物。"},{"english":"Molting can be observed in all arthropods.","chinese":"所有的節肢動物都可以觀察到蛻皮。"}],"related":[]}