{"definition":["writing\/sections and chapters"],"pinyin":["pian1 zhang1"],"simplified":["篇章"],"rank":16145.0,"normalized_rank":0.22588949673303205,"fraction":0.000003615281906862612,"cumulative_fraction":0.96346832796995,"word":"篇章","characters":[{"definition":["sheet\/piece of writing\/bound set of bamboo slips used for record keeping (old)\/classifier for written items: chapter, article"],"pinyin":["pian1"],"word":"篇"},{"definition":["chapter\/section\/clause\/movement (of symphony)\/seal\/badge\/regulation\/order","surname Zhang"],"pinyin":["Zhang1","zhang1"],"word":"章"}],"containing_words":[],"sentences":[{"english":"The Chinese side would like to work together with Arab states to compose a new chapter of China-Arab friendly cooperation.","chinese":"中方願與阿方共同努力，譜寫中阿友好合作的新篇章。"},{"english":"Macro structure is the higher level semantic structure of a text.","chinese":"宏觀結構是篇章的高層次語義結構。"},{"english":"Today we are at the beginning of the next chapter of the reinvention of personal transportation.","chinese":"今天，我們正站在再造個人交通新篇章的開始。"},{"english":"A new chapter for Libya, but will the victors stay united?","chinese":"利比亞翻開了新篇章，但勝利者仍會團結一致嗎？"},{"english":"Many sections and chapters of acupuncture and moxibustion in The Yellow Emperor's Internal Classic contain a principle of pulse taking.","chinese":"《內經》的許多鍼灸篇章中都蘊藏着一個診脈原則。"},{"english":"Descent: Freespace is a new chapter in space dogfight sims.","chinese":"《縱橫太空》開創了太空格鬥模擬遊戲的新篇章。"},{"english":"It's just these heart-thrilling chapters that brought his work world renown.","chinese":"正因這些扣人心絃的篇章才使得他的作品舉世聞名。"},{"english":"Important books of the Old Testament were written or assembled at roughly the same time.","chinese":"聖經舊約的重要篇章也大概在這個時期撰寫或者編纂。"},{"english":"Andthat is how we will write the next chapter in the great American story.","chinese":"唯有如此，我們才能爲偉大的美國曆史書寫新的篇章。"},{"english":"They are also more restrained and conventionalized on the overall text organization and language use.","chinese":"在篇章組織結構和整體語言使用上也更爲侷限。"},{"english":"This show has a place in television history that we will never forget.","chinese":"這部劇集正成爲電視史上令人永難忘懷篇章。"},{"english":"Sincerely look forward to your cooperation, to co-creating a glorious future, and composing new writings.","chinese":"真誠期待和您的合作，共創美好未來，譜寫新的篇章。"},{"english":"The greatest book on sex, love and marriage is in the bible.","chinese":"關於性，愛和婚姻的最美好的篇章在聖經中。"},{"english":"The choice of different kinds of pattern of sentence are dependent of the cohesion of sentences and contexts.","chinese":"選擇不同的句式，常同複句關聯和篇章銜接有關。"},{"english":"Clearly the last chapter of the Fezzan is yet to be written.","chinese":"其實，費讚的最後篇章仍然在寫。"},{"english":"The establishment of China-South Korea diplomatic ties in 1992 opened a new page of bilateral relations.","chinese":"1992年中韓建交，開啓了兩國關係發展新篇章。"}],"related":[{"definition":["journey\/expedition\/voyage"],"pinyin":["zheng1 cheng2"],"word":"征程"},{"definition":["to compose (a piece of music)\/(fig.) to create, by one's actions, a narrative (generally one that can be recounted with pride)"],"pinyin":["pu3 xie3"],"word":"譜寫"},{"definition":["overture"],"pinyin":["xu4 qu3"],"word":"序曲"},{"definition":["start\/beginning"],"pinyin":["kai1 duan1"],"word":"開端"},{"definition":["movement (of a symphony)"],"pinyin":["yue4 zhang1"],"word":"樂章"},{"definition":["course\/process"],"pinyin":["li4 cheng2"],"word":"歷程"},{"definition":["start of literary work\/opening song of ballad in Tanci style 彈詞|弹词[tan2 ci2]"],"pinyin":["kai1 pian1"],"word":"開篇"},{"definition":["to write"],"pinyin":["shu1 xie3"],"word":"書寫"},{"definition":["thick and heavy in colors\/to describe sth in colorful language with attention to detail (idiom)"],"pinyin":["nong2 mo4 zhong4 cai3"],"word":"濃墨重彩"},{"definition":["prologue"],"pinyin":["xu4 mu4"],"word":"序幕"},{"definition":["long journey\/trek\/course of an expedition"],"pinyin":["zheng1 tu2"],"word":"征途"},{"definition":["to express (emotions in prose)\/a written description (of emotions)"],"pinyin":["shu1 xie3"],"word":"抒寫"},{"definition":["New Age (movement)","new era\/new epoch"],"pinyin":["Xin1 ji4 yuan2","xin1 ji4 yuan2"],"word":"新紀元"},{"definition":["splendid\/glorious"],"pinyin":["hui1 huang2"],"word":"輝煌"},{"definition":["to follow the past and herald the future (idiom); part of a historical transition\/forming a bridge between earlier and later stages"],"pinyin":["ji4 wang3 kai1 lai2"],"word":"繼往開來"},{"definition":["surging forward with great momentum\/unfolding on a magnificent scale"],"pinyin":["bo1 lan2 zhuang4 kuo4"],"word":"波瀾壯闊"}]}