{"definition":["to usurp\/to seize"],"pinyin":["cuan4 duo2"],"simplified":["篡夺"],"rank":49212.0,"normalized_rank":0.6885397282890042,"fraction":1.5721790413030095e-7,"cumulative_fraction":0.998841456447202,"word":"篡奪","characters":[{"definition":["to seize\/to usurp"],"pinyin":["cuan4"],"word":"篡"},{"definition":["to seize\/to take away forcibly\/to wrest control of\/to compete or strive for\/to force one's way through\/to leave out\/to lose"],"pinyin":["duo2"],"word":"奪"}],"containing_words":[],"sentences":[{"english":"Yuan Shikai quickly seized the fruits of the victory of the 1911 Revolution.","chinese":"袁世凱迅速篡奪了辛亥革命的勝利果實。"},{"english":"Indra worried that this powerful sage would one day want to usurp the position of king of heaven.","chinese":"他擔心這位強有力的聖哲有一天會篡奪天帝的位置。"},{"english":"In a delicate exercise, charities are trying to present their agenda without usurping the mayor.","chinese":"慈善機構正在不篡奪市長權力的前提下，盡力想方案。"},{"english":"Though you have solemnly vowed yourself loyal to His Majesty's Court.","chinese":"丞相信誓旦旦說自己沒有篡奪漢室之意。"},{"english":"Industrialism began to usurp the production and distribution functions of the family .","chinese":"工業化生產已開始篡奪家庭生產和分配的功能。"},{"english":"Surely this usurpation is more worrisome than a few federal stimulus programs.","chinese":"對權力的篡奪的擔憂遠勝於聯邦刺激計劃。"},{"english":"The fondle dog suspects the universe for scheming to take its location.","chinese":"小狗懷疑大宇宙陰謀篡奪它的位寘。"},{"english":"Other ministers even remarked that Tin Aung Myint Oo had usurped Thein Sein’s power.","chinese":"其他部長甚至評論說丁昂敏吳篡奪了吳的權力。"},{"english":"Little by little he usurped his boss's authority.","chinese":"他逐漸地篡奪老闆的權力。"},{"english":"The usurper had them smashed to powder, I expect.","chinese":"我猜篡奪者將它們碾成了粉末。"},{"english":"Viserys used to call them the Usurper's dogs.","chinese":"韋賽里斯曾叫他們篡奪者的狗。"},{"english":"He was hanged for plotting to supplant the king.","chinese":"他因陰謀篡奪皇位而被絞死。"},{"english":"Shikai quickly seized the fruits of the victory of the1911 Revolution.","chinese":"袁世凱迅速篡奪了辛亥革命的勝利果實。"},{"english":"We are the Usurpers to the Heavenly Thrones .","chinese":"我們是神聖王座的篡奪者。"},{"english":"Yuan Shikai quickly seized the fruits of the victory of the1911 Revolution.","chinese":"袁世凱迅速篡奪了辛亥革命的勝利果實。"},{"english":"They are usurping the Throne of God where all Judgement stands.","chinese":"他們篡奪王位上帝那裏所有的判斷標準。"}],"related":[]}