{"definition":["in simple terms\/to put things simply\/briefly"],"pinyin":["jian3 yan2 zhi1"],"simplified":["简言之"],"rank":68712.0,"normalized_rank":0.961370027842682,"fraction":5.4011721938914905e-9,"cumulative_fraction":0.9999911581351278,"word":"簡言之","characters":[{"definition":["simple\/uncomplicated\/letter\/to choose\/to select\/bamboo strips used for writing (old)"],"pinyin":["jian3"],"word":"簡"},{"definition":["words\/speech\/to say\/to talk"],"pinyin":["yan2"],"word":"言"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"}],"containing_words":[],"sentences":[{"english":"In short, they might make better ethical decisions than people.","chinese":"簡言之，它們會比人類做出更恰當的道德判斷。"},{"english":"In short, our life has become comfortable and convenient.","chinese":"簡言之，我們的生活變得舒適而方便。"},{"english":"In short, there is more to the equation than simply smoking and lung cancer.","chinese":"簡言之，僅僅吸菸與得肺癌之間是不能簡單劃等號的。"},{"english":"In short, they find their work interesting.","chinese":"簡言之，隱密直似有接受祕事之權也。"},{"english":"In short, the two traits go together.","chinese":"簡言之，這兩項特性合而爲一了。"},{"english":"In short, you need proper governance.","chinese":"簡言之，您需要適當的治理。"},{"english":"In short, it is all a big chocolate mess.","chinese":"簡言之，現在是天下大亂。"},{"english":"In the short term, yes, but sleeping less probably won't help you lose weight.","chinese":"簡言之，是的，但少睡並不能幫助你減肥。"},{"english":"Financial assets are simply a claim on goods and services.","chinese":"金融資產簡言之即對產品和服務的求償權。"},{"english":"Simply put, it is the use of 'rock instrumentation' for non-rock purposes.","chinese":"簡言之，後搖就是用搖滾樂器來創造非搖滾。"},{"english":"In short the photographic exhibition can get the students to discover and appreciate beauty.","chinese":"簡言之，攝影展能夠讓同學發現和欣賞美。"},{"english":"In short, I sing for fun.","chinese":"簡言之，我爲快樂萬唱。"},{"english":"In short, it means the ability graduate complete scientific research task successfully.","chinese":"簡言之，指研究生順利完成科研活動任務所需的能力。"},{"english":"In short, reading is both an intellectual skill and also a meta-cognitive activity.","chinese":"簡言之，閱讀既是智力技能，也是一種元認知活動。"},{"english":"In short, they affect the quality of your life.","chinese":"簡言之，這些想法影響你生活的質量。"},{"english":"It's a long letter; but in brief, he says \"No\".","chinese":"這是一封長信，但簡言之，他拒絕了。"}],"related":[]}