{"definition":["concise\/brief"],"pinyin":["jian3 yao4"],"simplified":["简要"],"rank":14011.0,"normalized_rank":0.19603206805367066,"fraction":0.000004657124229776222,"cumulative_fraction":0.9546900804526658,"word":"簡要","characters":[{"definition":["simple\/uncomplicated\/letter\/to choose\/to select\/bamboo strips used for writing (old)"],"pinyin":["jian3"],"word":"簡"},{"definition":["important\/vital\/to want\/to ask for\/will\/going to (as future auxiliary)\/may\/must\/(used in a comparison) must be\/probably\/if","to demand\/to request\/to coerce"],"pinyin":["yao1","yao4"],"word":"要"}],"containing_words":[{"definition":["brief introduction"],"pinyin":["jian3 yao4 jie4 shao4"],"word":"簡要介紹"}],"sentences":[{"english":"In this paper, the technical features of the structure of the Bridge are briefly described.","chinese":"簡要介紹粵海鐵路棧橋的結構技術特點。"},{"english":"The initiation mechanism of electro-explosive device( EED) was introduced.","chinese":"簡要介紹了射頻對電火工品的作用機制。"},{"english":"The article describes the structural features and configuration of the edger stand with whole hydraulic screw-down for HCM Rough mills.","chinese":"簡要介紹全液壓壓下立輥軋機的結構特點及組成。"},{"english":"This is the brief summary about the recent study progress on the secretion proteins of Mycobacteria .","chinese":"對近年來分支桿菌分泌蛋白研究進展進行了簡要綜述。"},{"english":"On the utilization of creative study in marketing;","chinese":"簡要介紹世界各國研究和應用創造學的概況。"},{"english":"Follow this up with a succinct description of the location followed by a dash and a time reference.","chinese":"接着，簡要地說明地點，然後用一個破折號提及時間。"},{"english":"The mechanism of reducing aerodynamic drag by acoustic excitation was briefly analysed.","chinese":"本文首先簡要地分析了聲激勵減阻機理。"},{"english":"At the same time, it is described how to treat the denitrified residua.","chinese":"同時還簡要介紹了脫氮殘渣的處理方法。"},{"english":"The physical mechanism of leaky-wave on microstrip line is briefly introduced at the beginning of the thesis.","chinese":"論文首先簡要介紹了微帶線漏波的物理機制。"},{"english":"This article has a brief review on Holocene climate changes in Mongolia.","chinese":"簡要地回顧了蒙古全新世氣候變化研究。"},{"english":"Finally, an economic evaluation of the reclaimed-water recycling plant is made.","chinese":"最後，對該中水處理系統做了簡要的經濟評估。"},{"english":"This paper briefly analyzed the development of Liaoning coastal economic belt.","chinese":"本文主要就遼寧沿海經濟帶的發展進行了簡要的分析。"},{"english":"In this paper we reviewed the recent progress in proteomic study of hepatocellular carcinoma.","chinese":"本文就肝細胞癌的蛋白質組學研究進展作簡要綜述。"},{"english":"It describes 4 deep-sky surveys since the discovering of Schmidt optics.","chinese":"簡要地介紹了十二種著名的巡天星圖。"},{"english":"The functions realized by the system and the software flow charts are described simply.","chinese":"系統所實現的功能及軟件流程文中也作了簡要說明。"},{"english":"The fifth chapter narrated the books design's future.","chinese":"第五章簡要概敘書籍裝幀的未來發展戰略。"}],"related":[{"definition":["to comment on\/commentary"],"pinyin":["ping2 shu4"],"word":"評述"},{"definition":["to prove a point\/to expound on\/to demonstrate or prove (through argument)\/proof"],"pinyin":["lun4 zheng4"],"word":"論證"},{"definition":["to make a copy of"],"pinyin":["chao1 lu4"],"word":"抄錄"},{"definition":["to decipher\/to decode\/to interpret"],"pinyin":["jie3 du2"],"word":"解讀"},{"definition":["to outline\/to summarize\/to sketch\/summary\/brief description\/concise narrative\/in a nutshell\/briefly"],"pinyin":["jian3 shu4"],"word":"簡述"},{"definition":["to recount"],"pinyin":["xiang2 shu4"],"word":"詳述"},{"definition":["to infer\/to judge\/inference\/judgment\/conclusion"],"pinyin":["lun4 duan4"],"word":"論斷"},{"definition":["detailed and reliable\/full and accurate"],"pinyin":["xiang2 shi2"],"word":"詳實"},{"definition":["complete and accurate"],"pinyin":["xiang2 shi2"],"word":"翔實"},{"definition":["brief introduction"],"pinyin":["jian3 yao4 jie4 shao4"],"word":"簡要介紹"},{"definition":["to sum up\/to summarize\/to conclude from facts\/induction (method of deduction in logic)"],"pinyin":["gui1 na4"],"word":"歸納"},{"definition":["to expound (a position)\/to elaborate (on a topic)\/to treat (a subject)"],"pinyin":["chan3 shu4"],"word":"闡述"},{"definition":["icon (computing)"],"pinyin":["tu2 shi4"],"word":"圖示"},{"definition":["to explain\/to expound\/to interpret\/elucidation"],"pinyin":["chan3 shi4"],"word":"闡釋"},{"definition":["treatise\/discourse\/exposition"],"pinyin":["lun4 shu4"],"word":"論述"},{"definition":["folklore"],"pinyin":["min2 su2 xue2"],"word":"民俗學"}]}