{"definition":["to sign (a contract, treaty etc)"],"pinyin":["qian1 ding4"],"simplified":["签定"],"rank":12549.0,"normalized_rank":0.1755767912358513,"fraction":0.000005684222812376778,"cumulative_fraction":0.94715800890127,"word":"簽定","characters":[{"definition":["to sign one's name\/visa\/variant of 籤|签[qian1]"],"pinyin":["qian1"],"word":"簽"},{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"}],"containing_words":[],"sentences":[{"english":"The purchaser signing the subscription document must be cautious and avoid falling into the trap.","chinese":"購買人簽定樓宇認購書應謹防誤入陷阱。"},{"english":"Everybody has seen the face of the movement before and after the 12-point understanding.","chinese":"所有人都看到了12點協議簽定後運動發生的變化。"},{"english":"Sign the cooperation intention agreement.","chinese":"簽定合作意向協議書。"},{"english":"IN WITNESS WHEREOF I cause this Power of Attorney to be duly signed.","chinese":"作爲證據，本人於此正式簽定本授權委宛書。"},{"english":"Most try to sign a divorce settlementby themselves first.","chinese":"大多數夫妻會先行簽定離婚協議書。"},{"english":"He's got a five-year deal with the Major League Soccer club.","chinese":"他同這支大聯盟球隊簽定了爲期五年的合同。"},{"english":"They signed a nonaggression pact.","chinese":"他們簽定了互不侵犯條約。"},{"english":"Sign the franchise contract.","chinese":"簽定特許經營合同書。"},{"english":"He said Raila Odina could not sign up to a cabinet that he did not agree too.","chinese":"表示R總統將不會與一個他不同意的內閣簽定協議。"},{"english":"I was one of the first Castaways to be offered a place, and the last to sign the contract.","chinese":"我是第一個被選出來最後一個簽定合同的漂流者。"},{"english":"This tab is located at the extreme right of the list of tabs.","chinese":"這個頁簽定位在頁籤列表的最右邊。"},{"english":"This Agreement will be effective upon the execution of this Agreement by the Parties.","chinese":"本合約自甲乙雙方簽定後，始生效力。"},{"english":"A: Before you sign the lease, do you have any questions?","chinese":"簽定租契之前，你有什麼問題嗎？"},{"english":"According to these articles did the Romans covenant with the people of the Jews.","chinese":"根據這些話，羅馬人同猶太民族簽定了盟約。"},{"english":"An agreement to be signed (=which is to be signed) next week will concern every ont of us.","chinese":"下週要簽定的一項協定關係的我們每一個人。"},{"english":"The storekeeper signed a complaint accusing them of shoplifting.","chinese":"店東簽定了控訴書，指控他們在店裏扒竊貨色。"}],"related":[]}