{"definition":["to collect money\/to raise funds"],"pinyin":["chou2 ji2"],"simplified":["筹集"],"rank":6894.0,"normalized_rank":0.0964560043652848,"fraction":0.000015082554385001693,"cumulative_fraction":0.894935664654892,"word":"籌集","characters":[{"definition":["chip (in gambling)\/token (for counting)\/ticket\/to prepare\/to plan\/to raise (funds)\/resource\/means"],"pinyin":["chou2"],"word":"籌"},{"definition":["to gather\/to collect\/collected works\/classifier for sections of a TV series etc: episode"],"pinyin":["ji2"],"word":"集"}],"containing_words":[],"sentences":[{"english":"Some local businessmen proposed to raise a comfort fund for the earthquake victims.","chinese":"當地一些商人提議向地震受害者籌集撫卹金。"},{"english":"What should we do to raise money for them?","chinese":"爲他們籌集一些錢我們應做什麼？"},{"english":"The foundation was set up to collect funds for the boy.","chinese":"該基金會的建立是爲薩帕馬加籌集資金。"},{"english":"The good news is that US$1.9 billion has been pledged, in loans and grants.","chinese":"好消息是籌集了19億美元的貸款和資助金。"},{"english":"A securities company must undertake its self-operated business by using its own capital and lawfully raised funds.","chinese":"自營業務必須使用自有資金和依法籌集的資金。"},{"english":"Some cooperatives, for example, raise money for research into important crops.","chinese":"例如，一些合作社籌集資金研究重要農作物。"},{"english":"Road-toll is an efficient way to collect capital for road building.","chinese":"公路收費是籌集公路建設資金的一種行之有效的方法。"},{"english":"The raising of twenty-five thousand pounds was a task altogether beyond her powers.","chinese":"要籌集兩萬五千鎊錢她完全無力辦得到。"},{"english":"They are trying by all possible means to raise funds.","chinese":"法務省準備通過個人集資籌集資金。"},{"english":"When a company sells shares of itself to the public to raise capital .","chinese":"一家公司通過向社會公衆出售其股票籌集資本的行爲。"},{"english":"Mr. Dai said the pension program's funding channels need to be broadened.","chinese":"戴相龍表示，社保基金的資金籌集渠道需要擴展。"},{"english":"Finally in 1975, the team went to climb the mountain.","chinese":"個女隊員進行訓練，籌集登山的資金。"},{"english":"The balance will be sought from governments and other International Financial Institutions.","chinese":"餘款將從各國政府和其他國際金融機構籌集。"},{"english":"Nowadays a lot of startups don't want to raise multi-million dollar series A rounds.","chinese":"很多初創企業不願進行動輒上百萬的首輪資金籌集。"},{"english":"If you plan to raise venture capital, set up an Inc.","chinese":"如果你打算籌集風險資本，那麼就建立股份有限公司。"},{"english":"We are planning to collect 780,000 yuan for the wild life project at present.","chinese":"我們目前計劃爲野生動物工程籌集78萬元。"}],"related":[]}