{"definition":["granulocyte"],"pinyin":["li4 xi4 bao1"],"simplified":["粒细胞"],"rank":39928.0,"normalized_rank":0.5586445231066277,"fraction":3.8727864406470603e-7,"cumulative_fraction":0.9964608884889476,"word":"粒細胞","characters":[{"definition":["grain\/granule\/classifier for small round things (peas, bullets, peanuts, pills, grains etc)"],"pinyin":["li4"],"word":"粒"},{"definition":["thin or slender\/finely particulate\/thin and soft\/fine\/delicate\/trifling\/(of a sound) quiet\/frugal"],"pinyin":["xi4"],"word":"細"},{"definition":["placenta\/womb\/born of the same parents"],"pinyin":["bao1"],"word":"胞"}],"containing_words":[{"definition":["neutrophil (the most common type of white blood cell)"],"pinyin":["zhong1 xing4 li4 xi4 bao1"],"word":"中性粒細胞"},{"definition":["eosinophil (type of white blood cell)"],"pinyin":["shi4 suan1 xing4 li4 xi4 bao1"],"word":"嗜酸性粒細胞"},{"definition":["basophil granulocytes (rarest type of white blood cell)"],"pinyin":["shi4 jian3 xing4 li4 xi4 bao1"],"word":"嗜鹼性粒細胞"}],"sentences":[{"english":"The increase of granulocytes is tumor-dependent.","chinese":"粒細胞的增加是腫瘤依賴性的。"},{"english":"Objective To explore morphology and clinical significance of binucleated granulocyte in blood diseases.","chinese":"目的探討雙核粒細胞的形態學及其診斷意義。"},{"english":"Objective To investigate the relationship between ceramide and apoptosis of granulosa cells.","chinese":"目的探討神經酰胺與顆粒細胞凋亡的關係。"},{"english":"Granulosa cell apoptosis was detected by agarose gel electrophoresis.","chinese":"用瓊脂糖凝膠電泳檢測兩類卵的顆粒細胞凋亡。"},{"english":"Eosinophils can increase with allergic reactions and with parasitic infestations.","chinese":"當過敏反應和寄生蟲感染時嗜酸性粒細胞會增多。"},{"english":"In general idea, cumulus cell is the best nuclear donor cell for reprogramming.","chinese":"一般來說，顆粒細胞作爲核供體最易被核重編程。"},{"english":"The eosinophil increase can always be found out via routine blood inspections.","chinese":"血常規查抄常有嗜酸性粒細胞增多。"},{"english":"Stem cells were mobilized with granulocyte colony-stimulating factor from HLA-identical sibling donors.","chinese":"供者採用粒細胞集落刺激因子皮下注射動員幹細胞。"},{"english":"A few of granular cells have typical nucleolus.","chinese":"還觀察到極少的顆粒細胞具有典型的核仁。"},{"english":"Hyaline casts were admixed with neutrophils.","chinese":"玻璃品摻合了嗜中性粒細胞。"},{"english":"Peripheral leukocyte and acidophilic granulocyte were decreased.","chinese":"外周血白細胞與嗜酸性粒細胞減少。"},{"english":"The diagnosis of angiolymphoid hyperplasia with eosinophilia was confirmed.","chinese":"血管淋巴樣增生伴嗜酸粒細胞增多症。"},{"english":"Recombinant human granulocyte stimulating factor (GSF) was bought from Qilu Pharmacy Co. , Ltd.","chinese":"重組人粒細胞刺激因子購於齊魯製藥有限公司。"},{"english":"Here, the mucosa shows ulceration and undermining by an extensive neutrophilic exudate.","chinese":"圖示黏膜層可見潰瘍，內有大量的中性粒細胞滲出。"},{"english":"Here you can see a particulate organelle called the ribosome.","chinese":"在這裏您可以看到一個名爲顆粒細胞的核糖體。"},{"english":"The use of granulocyte colony-stimulating factor to prevent granulocytopenia was not permitted.","chinese":"試驗中不預防使用粒細胞集落刺激因子。"}],"related":[]}