{"definition":["quality goods\/premium product\/fine work (of art)"],"pinyin":["jing1 pin3"],"simplified":["精品"],"rank":3914.0,"normalized_rank":0.05476193807451765,"fraction":0.000034141977258603004,"cumulative_fraction":0.8277525043573866,"word":"精品","characters":[{"definition":["essence\/extract\/vitality\/energy\/semen\/sperm\/mythical goblin spirit\/highly perfected\/elite\/the pick of sth\/proficient (refined ability)\/extremely (fine)\/selected rice (archaic)"],"pinyin":["jing1"],"word":"精"},{"definition":["article\/commodity\/product\/goods\/kind\/grade\/rank\/character\/disposition\/nature\/temperament\/variety\/to taste sth\/to sample\/to criticize\/to comment\/to judge\/to size up\/fret (on a guitar or lute)"],"pinyin":["pin3"],"word":"品"}],"containing_words":[{"definition":["boutique"],"pinyin":["jing1 pin3 dian4"],"word":"精品店"}],"sentences":[{"english":"Quality image, brand name benefit, do the proven route, right-time & right-place development.","chinese":"樹精品意識，創品牌效益，走規模道路，搶時機發展？"},{"english":"The construction of fine courses is a main component of the construction of an examplar higher vocational college.","chinese":"精品課程建設是示範院校專業建設的主要內涵。"},{"english":"For handed down your porcelain rare high-quality goods.","chinese":"爲傳世汝瓷罕見之精品。"},{"english":"This is a boutique project for \"karis\" in a shopping center in Hiroshima.","chinese":"這是一個“卡利斯在廣島購物中心”的精品工程。"},{"english":"The packaging and presentation you get with designer shoes gives you that whole experience.","chinese":"你買的精品鞋的包裝和說明會給你一次完整經驗的。"},{"english":"Temple Hall of smart structures, the resplendent, for payment of the fine on behalf of the Building.","chinese":"寺內殿堂構造靈巧，金碧輝煌，爲金代建築之精品。"},{"english":"A series of extractive lectures have been held by the institute for 10 times.","chinese":"該學院推出的精品系列講座已舉辦10場。"},{"english":"I'd like to buy sone Chinese handicrafts.","chinese":"我想要中國的精品。"},{"english":"There are many upscale fashion shops and trendy boutiques in the area.","chinese":"有許多高檔時裝店和時髦的精品屋領域。"},{"english":"Cable tray to create a boutique supermarket industry.","chinese":"努力打造電纜橋架行業的精品超市。"},{"english":"Just recently, the station was also named the whole coal sample fine station.","chinese":"就在前不久，該站場還被評爲全煤樣板精品站場。"},{"english":"Dr. Liu on the returned overseas Chinese students' outstanding projects recommendation of Zhongguancun Science Park.","chinese":"參加中關村科技園區留學人員精品項目推薦會。"},{"english":"These exhibits includes some fine examples of medieval pottery.","chinese":"這些展覽品中包括一些中世紀陶器精品。"},{"english":"The west garden in Liuhua Park is a famous miniascape garden and one of the excellence Lingnan Gardens.","chinese":"流花西苑是廣州著名的盆景園，也是嶺南園林的精品。"},{"english":"For years Young Lion worked diligently in creating high quality and industry breaking space sculpt¬ures.","chinese":"多年來雅林士達公司致力於創造高質量的精品空間。"},{"english":"Planted 300 acres of apple orchard and 500 acres of fine chestnut base.","chinese":"種植了300畝精品蘋果園和500畝板栗基地。"}],"related":[{"definition":["valuable object\/curio"],"pinyin":["zhen1 pin3"],"word":"珍品"},{"definition":["masterpiece\/fine piece of writing"],"pinyin":["jia1 zuo4"],"word":"佳作"},{"definition":["character\/intrinsic quality (of a person)\/quality (of a product or service, or as in \"quality of life\", \"air quality\" etc)"],"pinyin":["pin3 zhi4"],"word":"品質"},{"definition":["delicate\/fine\/refinement"],"pinyin":["jing1 mei3"],"word":"精美"},{"definition":["to appreciate (as a connoisseur)"],"pinyin":["jian4 shang3"],"word":"鑑賞"},{"definition":["article\/commodity\/product\/goods\/kind\/grade\/rank\/character\/disposition\/nature\/temperament\/variety\/to taste sth\/to sample\/to criticize\/to comment\/to judge\/to size up\/fret (on a guitar or lute)"],"pinyin":["pin3"],"word":"品"},{"definition":["to put effort into (work, farming, writing etc)\/a masterpiece"],"pinyin":["li4 zuo4"],"word":"力作"},{"definition":["excellent quality"],"pinyin":["you1 zhi4"],"word":"優質"},{"definition":["special performance"],"pinyin":["zhuan1 chang3"],"word":"專場"},{"definition":["first-class\/best quality\/also pr. [shang4 sheng4]"],"pinyin":["shang4 cheng2"],"word":"上乘"},{"definition":["lit. to fly one's banner on a solitary tree (idiom); fig. to act as a loner\/to stand out\/to develop one's own school\/to have attitude of one's own"],"pinyin":["du2 shu4 yi1 zhi4"],"word":"獨樹一幟"},{"definition":["gem\/(fig.) rare and valuable item\/gem\/treasure"],"pinyin":["gui1 bao3"],"word":"瑰寶"},{"definition":["characteristic\/distinguishing feature or quality"],"pinyin":["te4 se4"],"word":"特色"},{"definition":["original and ingenious (idiom)\/to show great creativity"],"pinyin":["du2 ju4 jiang4 xin1"],"word":"獨具匠心"},{"definition":["to perfect sth that is already outstanding (idiom); constantly improving"],"pinyin":["jing1 yi4 qiu2 jing1"],"word":"精益求精"},{"definition":["best quality\/item of the highest quality\/(slang) outrageous\/annoying in the extreme\/gross\/person with these qualities"],"pinyin":["ji2 pin3"],"word":"極品"}]}