{"definition":["refinery (of oil etc)"],"pinyin":["jing1 lian4 chang3"],"simplified":["精炼厂"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"精煉廠","characters":[{"definition":["essence\/extract\/vitality\/energy\/semen\/sperm\/mythical goblin spirit\/highly perfected\/elite\/the pick of sth\/proficient (refined ability)\/extremely (fine)\/selected rice (archaic)"],"pinyin":["jing1"],"word":"精"},{"definition":["to refine\/to smelt"],"pinyin":["lian4"],"word":"煉"},{"definition":["factory\/yard\/depot\/workhouse\/works\/(industrial) plant"],"pinyin":["chang3"],"word":"廠"}],"containing_words":[],"sentences":[{"english":"BesGas Three has remained in operation for decades since.","chinese":"此後，貝斯平第三氣體精煉廠持續運轉了幾十年。"},{"english":"By chance, he discovered BesGas Three along the way.","chinese":"他在路上意外發現了貝斯平第三氣體精煉廠。"},{"english":"“The refinery was just hemorrhaging benzene into the atmosphere, ” she says.","chinese":"她說“精煉廠一直在向空氣中排放苯。”"},{"english":"Place down the finished Power Plant and que another Refinery.","chinese":"放下完成的電廠並建造另一個精煉廠。"},{"english":"It catalogued several pieces of potentially exposed computer hardware used at the refinery.","chinese":"報告同樣分類列出了精煉廠中可能暴露的計算機硬件。"},{"english":"Place the finished Refinery on your main field and que another Refinery.","chinese":"在你的主礦區放下完成的精煉廠製造另一個精煉廠。"},{"english":"Place the finished Refinery on your main field and que another Refinery.","chinese":"在你的主礦區放下完成的精煉廠製造另一個精煉廠。"},{"english":"Shortly afterwards, the Empire took control of Bespin and all its refineries.","chinese":"沒過多久，帝國控制了貝斯平及其所有精煉廠。"},{"english":"Build Refinery, place it down facing the nearest Tiberium Field.","chinese":"建造T礦精煉廠，並讓他面對最近的T礦礦區。"},{"english":"They fly over what looks like a small refinery.","chinese":"他們飛過一個看上去上個精煉廠的建築。"},{"english":"Indiana’s shore is still lined with steel plants and refineries.","chinese":"印第安納州的湖濱仍然矗立着大量的鋼鐵廠和精煉廠。"}],"related":[]}