{"definition":["psychiatry"],"pinyin":["jing1 shen2 bing4 xue2"],"simplified":["精神病学"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"精神病學","characters":[{"definition":["essence\/extract\/vitality\/energy\/semen\/sperm\/mythical goblin spirit\/highly perfected\/elite\/the pick of sth\/proficient (refined ability)\/extremely (fine)\/selected rice (archaic)"],"pinyin":["jing1"],"word":"精"},{"definition":["God\/abbr. for 神舟[Shen2 zhou1]","deity\/soul\/spirit\/unusual\/mysterious\/lively\/expressive\/expression\/look\/CL:個|个[ge4]\/(slang) awesome\/amazing"],"pinyin":["Shen2","shen2"],"word":"神"},{"definition":["illness\/CL:場|场[chang2]\/disease\/to fall ill\/defect"],"pinyin":["bing4"],"word":"病"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"Objecive To investigate the effect of Consultation-Liaison Psychiatry(CLP)on the general hospital.","chinese":"目的探討會診聯絡精神病學在綜合醫院的作用。"},{"english":"Dr Max Counselling Service - a secure encrypted site for psychiatric information and counselling.","chinese":"爲精神病學家提供的信息和諮詢的站點。"},{"english":"His major work, Compendium der Psychiatrie, was first published in 1883.","chinese":"他的主要著作《精神病學綱要》初版於1883年。"},{"english":"The results of the study have been published in the Canadian Journal of Psychiatry.","chinese":"這些研究結果發表在精神病學加拿大的期刊裏。"},{"english":"The findings appeared in the journal \" neology\".","chinese":"這項發現發表在《精神病學》期刊上。"},{"english":"She also spoke separately with Psychiatric News.","chinese":"麥克科馬克也單獨接受了《精神病學新聞》的採訪。"},{"english":"Basic personality types, according to the theories of Carl Gustav Jung.","chinese":"按照精神病學家容格的理論確立的基本人格類型。"},{"english":"Michael Lutter, co- senior author and assistant professor of psychiatry.","chinese":"邁克爾拉特，共同高級作者與精神病學副教授。"},{"english":"The research is in the journal Biological Psychiatry. [Emanuel Bubi et al, http:\/\/bit.ly\/bOXClP]","chinese":"此項研究已收入《生物精神病學》期刊中。"},{"english":"Rappaport, now a child and adolescent psychiatrist in Cambridge, Mass.","chinese":"現在是麻省坎布里奇市的一名兒童青少年精神病學家。"},{"english":"This is called negative symptom in psychiatry.","chinese":"這在精神病學上被稱作是陰性症狀。"},{"english":", chair of the Department of Psychiatry at Georgetown University.","chinese":"他是喬治敦大學精神病學系系主任。"},{"english":"It was published in the Archives of General Psychiatry journal.","chinese":"研究結果發表在《普通精神病學文獻》雜誌上。"},{"english":"Psychiatrists and psychologists around the world love this piece of work.","chinese":"全世界的精神病學家和心理學家都很歡迎這個成果。"},{"english":"The findings appeared last month in The Archives of General Psychiatry.","chinese":"結果發表在上個月的《普通精神病學紀要》中。"},{"english":"The finding was reported in the February Archives of General Psychiatry.","chinese":"這項發現發表在二月份的《普通精神病學檔案》上。"}],"related":[]}