{"definition":["carefully chosen\/handpicked\/best of the bunch\/choice (product)\/concentration (mining)\/to concentrate\/to winnow"],"pinyin":["jing1 xuan3"],"simplified":["精选"],"rank":7340.0,"normalized_rank":0.10269612301148684,"fraction":0.000013697664638962544,"cumulative_fraction":0.9013450894277996,"word":"精選","characters":[{"definition":["essence\/extract\/vitality\/energy\/semen\/sperm\/mythical goblin spirit\/highly perfected\/elite\/the pick of sth\/proficient (refined ability)\/extremely (fine)\/selected rice (archaic)"],"pinyin":["jing1"],"word":"精"},{"definition":["to choose\/to pick\/to select\/to elect"],"pinyin":["xuan3"],"word":"選"}],"containing_words":[],"sentences":[{"english":"So there are a lot of photographs in this collection that no one has seen before.","chinese":"所以，在這部精選集裏有很多照片是沒有人看到過的。"},{"english":"Check out Buck's selection of tapered and pocket sharpeners.","chinese":"購買巴克精選的錐形磨刀器和口袋磨刀器。"},{"english":"A selection of long- sleeved casual shirts featuring contemporary and classic styles.","chinese":"精選的長袖休閒襯衫採用現代和古典風格。"},{"english":"It selects top grade raw materials in the Land of Abundance, and is produced with our advanced techniques.","chinese":"精選天府之國優質原料，採用盈棚技術精工製作。"},{"english":"Material selection for imported cowhide, sheepskin, such as crocodile skin.","chinese":"製作材料精選爲進口牛皮，羊皮，鱷魚皮等。"},{"english":"EUROPEAN FOLK contains examples of the design of everyday textiles and costumes of rural Central and South-Eastern Europe.","chinese":"本書精選中歐和東南歐部的日常服飾設計實例。"},{"english":"Well-selected Beijing operas for your enjoyment .","chinese":"精選的京劇，京劇愛好者的聽覺享受。"},{"english":"Tom: Ok, a bottle of the house red please!","chinese":"好的，那就來一瓶精選的紅酒吧。"},{"english":"Books, like friends , should be few and well chosen.","chinese":"書如同朋友一樣，宜少和宜精選。"},{"english":"It is manually curated and currently holds 3782 antimicrobial sequences.","chinese":"它是人工精選的，當前包含有3782個抗菌肽序列。"},{"english":"Pick your strongest line-up and prove to me that the defence is in top form.","chinese":"精選你的強壯排成直線並且跟我證明防衛以頂端形式。"},{"english":"Bocanegra badging is featured dead-center on the hatch.","chinese":"格拉標誌是精選死中心孵化。"},{"english":"For selected items, there are videos featuring discussions by expert curators.","chinese":"對一些精選展品內容，還配有文史專家的討論視頻。"},{"english":"The perfect balance of espresso and frothed milk.","chinese":"咖啡和精選牛奶的完美平衡。"},{"english":"We carefully choose only the eye round beef with highest quality, which has the big shape, tender taste and regular shape.","chinese":"精選優質牛肉的圓眼肉部分，塊狀粗大，肉質鮮嫩。"},{"english":"Made of selected malleable steel making them virtually unbreakable.","chinese":"本體材質採用精選的展性鑄鐵不易破裂變形。"}],"related":[{"definition":["the classics\/scriptures\/classical\/classic (example, case etc)\/typical"],"pinyin":["jing1 dian3"],"word":"經典"},{"definition":["to present respectfully"],"pinyin":["cheng2 xian4"],"word":"呈獻"},{"definition":["to choose\/to select"],"pinyin":["tiao1 xuan3"],"word":"挑選"},{"definition":["theme\/subject"],"pinyin":["zhu3 ti2"],"word":"主題"},{"definition":["precious"],"pinyin":["zhen1 gui4"],"word":"珍貴"},{"definition":["for a particular person, occasion, purpose\/focused on one thing\/special\/expert\/particular (to sth)\/concentrated\/specialized"],"pinyin":["zhuan1"],"word":"專"},{"definition":["specific topic (addressed by a book, lecture, TV program etc)\/article, report or program etc on a specific topic"],"pinyin":["zhuan1 ti2"],"word":"專題"},{"definition":["to select\/to pick"],"pinyin":["zhen1 xuan3"],"word":"甄選"},{"definition":["to put on display\/to exhibit\/exhibition\/show\/CL:個|个[ge4],次[ci4]"],"pinyin":["zhan3 lan3"],"word":"展覽"},{"definition":["to include (in a collection)\/to put together (stories, poems etc)\/to record\/to employ\/to recruit"],"pinyin":["shou1 lu4"],"word":"收錄"},{"definition":["originality\/creativity\/innovation"],"pinyin":["yuan2 chuang4"],"word":"原創"},{"definition":["to choose"],"pinyin":["xuan3 qu3"],"word":"選取"},{"definition":["to cover\/to comprise\/to include"],"pinyin":["han2 gai4"],"word":"涵蓋"},{"definition":["to collect in a museum or library\/museum collection\/library holdings"],"pinyin":["guan3 cang2"],"word":"館藏"},{"definition":["exclusive"],"pinyin":["du2 jia1"],"word":"獨家"},{"definition":["masterpiece"],"pinyin":["jie2 zuo4"],"word":"傑作"}]}