{"definition":["paste\/glue"],"pinyin":["hu2 ji4"],"simplified":["糊剂"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"糊劑","characters":[{"definition":["muddled\/paste\/scorched","paste\/cream"],"pinyin":["hu2","hu4"],"word":"糊"},{"definition":["dose (medicine)"],"pinyin":["ji4"],"word":"劑"}],"containing_words":[],"sentences":[{"english":"OBJECTIVE To prepare the combined rivanol paste and observe its clinical effect.","chinese":"目的製備複方利凡諾糊劑，觀察臨牀療效。"},{"english":"OBJECTIVE To establish a method to determine indigo contents in Anti-ulcer paste of traditional Chinese herbs.","chinese":"目的建立中藥潰瘍糊劑中靛藍的含量測定方法。"},{"english":"Conclusion The antibiotic cataplasm had a good effect on young permanent teeth with periapical periodontitis.","chinese":"結論抗生素糊劑對於年輕恆牙根尖周炎具有良好效果。"},{"english":"Objective The explore of clinical curative efficacy of retinoic acid paste in treatment with oral leukoplakia.","chinese":"目的探討維甲酸糊劑治療口腔白斑的臨牀療效。"},{"english":"A good consistency for the paste is one like honey or toothpaste.","chinese":"稠度較好的糊劑就像是蜂蜜或牙膏。"},{"english":"The MTT assay showed the paste had good biocompatibility.","chinese":"MTT評價結果表明該糊劑具有良好的生物相容性。"},{"english":"Objective To study the clinical effects of Benzocaine Paste on treating oral ulcers.","chinese":"目的研究臨牀應用苯佐卡因糊劑治療口腔潰瘍的療效。"},{"english":"The antibacterial effect of the aqueous extract of Chinese gallnut on anaerobic strains in the root canals was proved.","chinese":"本實驗證實了五倍子糊劑在感染根管內的抑菌效果。"},{"english":"This article reports 30 cases of root canal filling with calcium hydroxide and iodoform paste.","chinese":"本文報道應用氫氧化鈣蒸餾水糊劑作根管充填30例。"},{"english":"The consistency of the paste then prevents segregation errors.","chinese":"糊劑的稠度可以預防分離錯誤。"}],"related":[]}