{"definition":["to correct an error"],"pinyin":["jiu1 cuo4"],"simplified":["纠错"],"rank":24997.0,"normalized_rank":0.3497404614329887,"fraction":0.0000014828407336635068,"cumulative_fraction":0.9842862923681686,"word":"糾錯","characters":[{"definition":["to gather together\/to investigate\/to entangle\/to correct"],"pinyin":["jiu1"],"word":"糾"},{"definition":["mistake\/wrong\/bad\/interlocking\/complex\/to grind\/to polish\/to alternate\/to stagger\/to miss\/to let slip\/to evade\/to inlay with gold or silver","surname Cuo"],"pinyin":["Cuo4","cuo4"],"word":"錯"}],"containing_words":[],"sentences":[{"english":"In teaching college English writing, its of great significance to encourage students to self-correct errors in writing.","chinese":"在大學英語寫作教學中，倡導學生自我糾錯非常重要。"},{"english":"Exchange your exercise books with your neighbor and correct each other's mistakes.","chinese":"把你的練習本和同桌交換，互相糾錯。"},{"english":"In this paper, a digital signature scheme constructed with error-correcting codes is first presented.","chinese":"本文首次提出了一種基於糾錯碼的數字簽名方案。"},{"english":"Finally, we use error correcting coding to improve secure algorithm.","chinese":"最後，利用糾錯碼理論進一步改進水印算法。"},{"english":"Teachers follow the principle of student priority in the course of error correction.","chinese":"在糾錯中教師應儘量給予學生獨立修正偏誤的優先權。"},{"english":"A general method of automatic error detecting and correcting for spelling English words is summarized.","chinese":"概述了英文單詞拼寫自動偵錯與糾錯的一般方法。"},{"english":"It also synchronizes and establishes an agreement on procedures for error recovery and control of data integrity.","chinese":"它還對糾錯和數據整合的過程進行同步並達成協議。"},{"english":"Error correcting code mainly includes block code and convolutional code.","chinese":"糾錯碼主要有分組碼和卷積碼兩種。"},{"english":"An identification scheme based on a generator matrix of error-correcting codes over GF(q);","chinese":"該方案根據移動信道性能的變化自適應地選擇糾錯碼。"},{"english":"Based oh the codes, a fast single byte-error correction scheme for main memory is proposed.","chinese":"基於最小方陣碼，本文給出一種快速內存糾錯方案。"},{"english":"Introduce the ECC(Error Correction Code) into the field of information hiding in binary images.","chinese":"將通信領域的糾錯碼技術引入到信息隱藏中。"},{"english":"To do that, switch over to the debug perspective and test your updated application from there.","chinese":"切換到糾錯透視圖並在此測試更新過的應用程序。"},{"english":"Once the necessary corrections are made, translated documents are finally delivered to the manufacturer.","chinese":"完成必要的糾錯之後，翻譯文檔最後提交給製造商。"},{"english":"A digital signature Public-key cryptosystem based on error correcting codes is presented in this paper.","chinese":"本文提出了基於糾錯碼的一類公鑰體制數字簽名方案。"},{"english":"RS(Reed-Solomon)code is being used widely because of its powerful error correction capability.","chinese":"RS碼由於具有優良的糾錯能力而得到廣泛應用。"},{"english":"At last, the relation between the capacity of subliminal channel and the parameters of the code used in the system is described.","chinese":"同時給出了容量與所採用糾錯碼請參數之間的關係。"}],"related":[{"definition":["to look favorably on sth\/would be glad to see it happen"],"pinyin":["le4 guan1 qi2 cheng2"],"word":"樂觀其成"},{"definition":["initiative\/active role"],"pinyin":["neng2 dong4 xing4"],"word":"能動性"},{"definition":["to force someone to do something"],"pinyin":["qiang3 ren2 suo3 nan2"],"word":"強人所難"},{"definition":["to waste all one's previous efforts (idiom)\/all that has been achieved goes down the drain"],"pinyin":["qian2 gong1 jin4 qi4"],"word":"前功盡棄"},{"definition":["to become a mere formality"],"pinyin":["liu2 yu2 xing2 shi4"],"word":"流於形式"},{"definition":["accomplice\/accessory"],"pinyin":["bang1 xiong1"],"word":"幫凶"},{"definition":["code of conduct\/standard of conduct"],"pinyin":["xing2 wei2 zhun3 ze2"],"word":"行為準則"},{"definition":["(abbr. for 嘗試錯誤|尝试错误) trial and error\/failure"],"pinyin":["shi4 cuo4"],"word":"試錯"},{"definition":["to be stuck\/to feel stuck"],"pinyin":["ka3 guan1"],"word":"卡關"},{"definition":["lit. as if sitting on pins and needles (idiom)\/fig. to be in an uncomfortable situation"],"pinyin":["ru2 zuo4 zhen1 zhan1"],"word":"如坐針氈"},{"definition":["to complicate\/to become complicated"],"pinyin":["fu4 za2 hua4"],"word":"複雜化"},{"definition":["vocal accompaniment in some traditional Chinese operas\/to speak in support of\/to chime in"],"pinyin":["bang1 qiang1"],"word":"幫腔"},{"definition":["bureaucracy"],"pinyin":["guan1 liao2 zhu3 yi4"],"word":"官僚主義"},{"definition":["form of words (e.g. inflection, conjugation)\/morphology (linguistics)"],"pinyin":["ci2 xing2"],"word":"詞形"},{"definition":["stake\/vital interest\/concern"],"pinyin":["li4 hai4 guan1 xi5"],"word":"利害關係"},{"definition":["(to act) on one's own initiative"],"pinyin":["zi4 dong4 zi4 fa1"],"word":"自動自發"}]}