{"definition":["restrictive condition\/constraint"],"pinyin":["yue1 shu4 tiao2 jian4"],"simplified":["约束条件"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"約束條件","characters":[{"definition":["to make an appointment\/to invite\/approximately\/pact\/treaty\/to economize\/to restrict\/to reduce (a fraction)\/concise","to weigh in a balance or on a scale"],"pinyin":["yao1","yue1"],"word":"約"},{"definition":["surname Shu","to bind\/bunch\/bundle\/classifier for bunches, bundles, beams of light etc\/to control"],"pinyin":["Shu4","shu4"],"word":"束"},{"definition":["strip\/item\/article\/clause (of law or treaty)\/classifier for long thin things (ribbon, river, road, trousers etc)"],"pinyin":["tiao2"],"word":"條"},{"definition":["item\/component\/classifier for events, things, clothes etc"],"pinyin":["jian4"],"word":"件"}],"containing_words":[],"sentences":[{"english":"The boundary condition of restriction and the natural condition of variation for the virtual principle of displacement are given too.","chinese":"明確了虛位移原理的變分約束條件和變分自然條件。"},{"english":"The influence of bound condition on the trend of foliation and high stress area.","chinese":"約束條件與層理分佈和應力集中區的關係。"},{"english":"Now, we have some constraints here.","chinese":"現在我們有一些約束條件。"},{"english":"So we have four variables, two constraints.","chinese":"那麼我們有四個變量，兩個約束條件。"},{"english":"Aerodynamical and mechanical constraints are considered in the problem formulation.","chinese":"求優中考慮了多種氣動與機械約束條件。"},{"english":"Our constraint is that we are the coexistence point.","chinese":"我們的約束條件是必須在共存點上。"},{"english":"And maybe you give it a set of constraints.","chinese":"你可能給了它一系列的約束條件。"},{"english":"The constraint conditions to realize the vector control of 3DM are presented.","chinese":"本文首先給出實現三維電動機矢量控制的約束條件。"},{"english":"It is discuss the control relation and control term of the work procedure.","chinese":"討論了該工作流程的控制關係及約束條件等。"},{"english":"Possibly an empty set of constraints.","chinese":"約束條件得出的也可能是空值。"},{"english":"And the constraint is what?","chinese":"約束條件是什麼呢？"},{"english":"And then we add the constraints.","chinese":"然後加上約束條件。"},{"english":"The spatial relationship of the sub-area was used as constraint conditions to correct the result.","chinese":"將各子區位置分佈關係用作匹配結果的約束條件。"},{"english":"Global path planning allows finding optimal paths under multi-constraints.","chinese":"全局路徑規劃可在多種約束條件下找出最優路徑。"},{"english":"Well, here we have to use the constraint.","chinese":"這裏，我們必須使用約束條件。"},{"english":"The constraint has to change. I've added a constraint.","chinese":"必須改變約束條件。"}],"related":[]}