{"definition":["red food dye made from yeast"],"pinyin":["hong2 qu1"],"simplified":["红曲"],"rank":54724.0,"normalized_rank":0.7656597596295105,"fraction":8.408311307247293e-8,"cumulative_fraction":0.9994903900609372,"word":"紅曲","characters":[{"definition":["red\/popular\/revolutionary\/bonus","surname Hong"],"pinyin":["Hong2","hong2"],"word":"紅"},{"definition":["bent\/crooked\/wrong","surname Qu","tune\/song\/CL:支[zhi1]"],"pinyin":["Qu1","qu1","qu3"],"word":"曲"}],"containing_words":[],"sentences":[{"english":"To clarify the safety of Monascus and Chinese traditional medicine synbiotics.","chinese":"闡明紅曲黴與健胃中藥合生素的安全性。"},{"english":"The production experiment of red koji was conducted with millet as raw material and Monascus purpureus being inoculated.","chinese":"紅曲是一種天然紅色素，傳統生產工藝以秈米爲原料。"},{"english":"The invention relates to a haw monascus health product comprising haws and monascus raw materials.","chinese":"一種山楂紅曲保健品，由山楂和紅曲原料製成。"},{"english":"The invention relates to a haw monascus health product comprising haws and monascus raw materials.","chinese":"一種山楂紅曲保健品，由山楂和紅曲原料製成。"},{"english":"Hongqu has a long history as a traditional food.","chinese":"紅曲是一種傳統的食品，在我國具有悠久的歷史。"},{"english":"I don't know the cost of the Red Yeast Rice, but I'm sure it isn't as much as Lipitor.","chinese":"我不知道紅曲米的價格是多少，但肯定沒有膽固清貴。"},{"english":"Monascus pigment is an excellent stainer .","chinese":"紅曲色素是優良的着色劑。"},{"english":"Conclusion:Under the optimized culture condition, a Red Yeast Rich with high pigment value and more red color hue was obtained.","chinese":"在優化工藝條件下，可得到偏紅色調高色價紅曲米。"},{"english":"Besides, liquor tasting results showed that the aroma and the taste of monascus base liquor got improved evidently.","chinese":"品酒結果表明，紅曲基酒的香氣和口味得到明顯改善。"},{"english":"Feed stimulating experiments were used to confirm precursors of monascus pigments.","chinese":"採用刺激實驗法確定紅曲色素的合成前體。"},{"english":"Red koji is also named Dan koji that belong to the fermented product with high-tech of biology.","chinese":"紅曲亦名丹曲，屬生物科技含量較高的釀造製品。"},{"english":"Conclusion Monascin can adjust the serum lipid.","chinese":"結論紅曲具有調節血脂作用。"},{"english":"So the polyketide pathway is presumed to be the main biosynthetic pathway of antibiotic monascus pigments.","chinese":"所以聚酮途徑被認爲是紅曲色素合成的主要途徑。"},{"english":"Monascus possesses certain fermenting power and strong esterifying power.","chinese":"紅曲黴具有一定的發酵力及較強的酯化力。"},{"english":"However, red kojic red and gardenia blue have no antioxidant activity.","chinese":"而紅曲米色素和梔子藍色素不具有抗氧活性。"},{"english":"The history of red koji brewing technique in ancientry is introduced in this article.","chinese":"該文主要介紹了釀造紅曲古工藝歷史資料的查詢結果。"}],"related":[]}