{"definition":["red shift (astronomy)"],"pinyin":["hong2 yi2"],"simplified":["红移"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"紅移","characters":[{"definition":["red\/popular\/revolutionary\/bonus","surname Hong"],"pinyin":["Hong2","hong2"],"word":"紅"},{"definition":["to move\/to shift\/to change\/to alter\/to remove"],"pinyin":["yi2"],"word":"移"}],"containing_words":[],"sentences":[{"english":"The absorption peak of FL was red shifted when silver nanoparticles were added.","chinese":"FL溶液中加入納米銀，FL分子吸收峯位發生紅移。"},{"english":"A new deceleration and cooling mechanism by red shifted diffuse light have been reported.","chinese":"報道了利用紅移漫射光冷卻原子的新機制。"},{"english":"The effect is known as gravitational redshifting.","chinese":"這個效應被稱爲引力紅移現象。"},{"english":"Cosmological redshifts, however, are generally considered to be different from the Doppler effect.","chinese":"宇宙學的紅移現象，通常區別於多普勒效應。"},{"english":"Vibration analysis show that dimer and trimer have typical red-shift hydrogen bond.","chinese":"振動分析表明二聚體和三聚體存在典型的紅移氫鍵。"},{"english":"The size of the shift is called the redshift, and it helps scientists figure out the movement of stars in space. Hydra isn’t the only distant cluster of galaxies that displays a redshift, though.","chinese":"“紅移”有助於科學家勾勒出星球在空間的運動狀態。"},{"english":"This paper presents a novel method for redshift determination of quasars .","chinese":"給出了一種新的類星體光譜的紅移測量方法。"},{"english":"The intensity of red-shifted radiation components can be further enhanced by increasing the three-order dispersion coefficient.","chinese":"當增大三階色散係數時，紅移輻射可得到進一步加強。"},{"english":"Red and blue shifts were not found at absorption peak positions.","chinese":"隨着溫度升高，峯值位置未見紅移或藍移。"},{"english":"The adsorption of 4-aminothiolphenol, on the other hand, caused a red shift of the SPR band.","chinese":"對巰基苯胺的吸附則使得表面等離子體共振紅移。"},{"english":"The infinite redshift is an avatar of the unphysical assumption of infinitely small atoms.","chinese":"無限紅移只是無限小的原子這個非物理假設的化身。"},{"english":"The animation below schematically shows what a redshift and blueshift might look like, again using a car as an example.","chinese":"下面的動畫顯示了紅移或藍移看上去的可能樣子。"},{"english":"And redshift depends on just how the universe is expanding.","chinese":"並且紅移取決於宇宙如何膨脹。"}],"related":[]}