{"definition":["to not move a single jot (idiom)"],"pinyin":["wen2 si1 bu4 dong4"],"simplified":["纹丝不动"],"rank":34538.0,"normalized_rank":0.4832314300505086,"fraction":6.313532361778566e-7,"cumulative_fraction":0.9937631988800724,"word":"紋絲不動","characters":[{"definition":["line\/trace\/mark\/pattern\/grain (of wood etc)"],"pinyin":["wen2"],"word":"紋"},{"definition":["silk\/thread\/trace\/(cuisine) shreds or julienne strips\/CL:條|条[tiao2]\/classifier: a thread (of cloud, smoke etc), a bit, an iota, a hint (of sth) etc"],"pinyin":["si1"],"word":"絲"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"}],"containing_words":[],"sentences":[{"english":"I pulled and pushed and tried everything, but it didn't move.","chinese":"我又拉又推用盡一切方法，但它卻紋絲不動。"},{"english":"The fence remained intact but the ram injured its own horns.","chinese":"結果籬笆紋絲不動，它反把自己的犄角碰傷了。"},{"english":"In front of me the three sleepers did not stir.","chinese":"在我前面，三隻瞌睡蟲紋絲不動。"},{"english":"Patience and the ability to sit silently without making a move are a good start.","chinese":"非凡的耐心與紋絲不動的靜坐也許是個良好開端。"},{"english":"Hanna listened standing up, straightbacked, and absolutely motionless.","chinese":"漢娜起立聽着宣讀，挺挺身子，紋絲不動。"},{"english":"Jim stopped inside the door, as immovable as a dog smelling a bird.","chinese":"吉姆站在屋裏的門口邊，紋絲不動地好像聞鳥狗。"},{"english":"Johnsy lay, scarcely making a ripple under the bedclothes, with her face toward the window.","chinese":"瓊西躺着，臉朝着窗口，被子底下的身體紋絲不動。"},{"english":"There wasn't a breath of wind – the branches were motionless.","chinese":"一絲風都沒有，樹枝紋絲不動。"},{"english":"My wings beat in a frenzy, but the Grail would not move.","chinese":"我的翅膀瘋狂地撲打着，聖盃卻紋絲不動。"},{"english":"Li Wu body tolerate the pain and the hearts of sadness, absolutely still.","chinese":"李武強忍身上的劇痛和心中的悲傷，紋絲不動。"},{"english":"He even tried kicking the huge lump of gold. But again it wouldn’t budge an inch!","chinese":"他甚至去踢金塊，但是金塊仍然紋絲不動。"},{"english":"The company faced the bridge, staring stonily, motionless.","chinese":"整列士兵面向大橋，面無表情地凝視前方，紋絲不動。"}],"related":[]}