{"definition":["Nashville, capital of Tennessee"],"pinyin":["Na4 shi2 wei2 er3"],"simplified":["纳什维尔"],"rank":51137.0,"normalized_rank":0.7154729758090468,"fraction":1.2743846825046678e-7,"cumulative_fraction":0.9991140720010068,"word":"納什維爾","characters":[{"definition":["surname Na","to receive\/to accept\/to enjoy\/to bring into\/to pay (tax etc)\/nano- (one billionth)\/to reinforce sole of shoes or stockings by close sewing"],"pinyin":["Na4","na4"],"word":"納"},{"definition":["ten (used in fractions, writing checks etc)\/assorted\/miscellaneous","what"],"pinyin":["shen2","shi2"],"word":"什"},{"definition":["abbr. for Uighur 維吾爾|维吾尔[Wei2 wu2 er3]\/surname Wei","to preserve\/to maintain\/to hold together\/dimension\/vitamin (abbr. for 維生素|维生素[wei2 sheng1 su4])"],"pinyin":["Wei2","wei2"],"word":"維"},{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"}],"containing_words":[],"sentences":[{"english":"I am available for gigs in my home of Nashville, TN.","chinese":"我在我的納什維爾，TN家庭音樂會可用。"},{"english":"That is one of the reasons that some years ago I moved to Nashville , TN.","chinese":"這也是我在幾年前搬到納什維爾的原因之一。"},{"english":"She also regularly patronized Nashville's Bluebird Cafe and similar clubs, studying the performances and immersing herself in the world of singer? songwriters.","chinese":"她還時常光顧納什維爾的藍鳥咖啡屋和類似的俱樂部。"},{"english":"Nashville is a port of entry and major commercial center known especially for its music industry. Population, 488,374.","chinese":"納什維爾是一個進口港和主要的商業中心。"},{"english":"He lives in Nashville.","chinese":"他住在納什維爾。"},{"english":"One of these schools is Belmont University in Nashville, Tennessee.","chinese":"這些學校之一，是貝爾蒙在田納西州納什維爾大學。"},{"english":"I was lucky enough to get to know Clayton once he moved to Nashville.","chinese":"當初克萊頓剛搬到納什維爾我就知道了。"},{"english":"New York and Nashville are the top music producing cities.","chinese":"和紐約，納什維爾是音樂產業的頂級城市。"},{"english":"Is Nashville, Tennessee a lot different from San Francisco?","chinese":"田納西州的納什維爾和舊金山很不一樣嗎？"},{"english":"Why aren’t we staying in Nashville?","chinese":"爲什麼我們不住在納什維爾？"},{"english":"After all, Nashville is the undisputed home of country music .","chinese":"畢竟，納什維爾是無容置疑的鄉村音樂之鄉。"},{"english":"I heard that Nashville is well-known for country music.","chinese":"我聽說納什維爾的鄉村音樂很有名。"},{"english":"Much of that water flowed into the Cumberland River, which flows through Nashville.","chinese":"大部分的水流入坎伯蘭河，通過納什維爾流動。"}],"related":[]}