{"definition":["(Internet slang) what? (loanword from Japanese 何 なに nani)"],"pinyin":["na4 ni2"],"simplified":["纳尼"],"rank":49991.0,"normalized_rank":0.6994389489737384,"fraction":1.4407991771272705e-7,"cumulative_fraction":0.998958707574804,"word":"納尼","characters":[{"definition":["surname Na","to receive\/to accept\/to enjoy\/to bring into\/to pay (tax etc)\/nano- (one billionth)\/to reinforce sole of shoes or stockings by close sewing"],"pinyin":["Na4","na4"],"word":"納"},{"definition":["Buddhist nun\/(often used in phonetic spellings)"],"pinyin":["ni2"],"word":"尼"}],"containing_words":[{"definition":["Narnia, children's fantasy world in stories by C.S. Lewis"],"pinyin":["Na4 ni2 ya4"],"word":"納尼亞"},{"definition":["The Chronicles of Narnia, children's stories by C.S. Lewis"],"pinyin":["Na4 ni2 ya4 Chuan2 qi2"],"word":"納尼亞傳奇"}],"sentences":[{"english":"The referee didn't blow his whistle at all and Nani actually looked at him to check.","chinese":"裁判沒有吹哨，納尼看着裁判想確認狀況。"},{"english":"Nani's passage to the World Cup with Portugal was plain sailing by comparison with Evra's exertions.","chinese":"納尼進入世界盃比起埃弗拉來講就順理成章的多。"},{"english":"However, Nani will miss Portugal's trip to Liechtenstein after sustaining a shoulder injury.","chinese":"不過納尼因爲肩膀受傷不能去國家隊報到了。"},{"english":"Manchester United players celebrate Nani's opening goal. Photograph: Tom Jenkins","chinese":"曼聯球員慶祝納尼的首開紀錄。"},{"english":"I've played against Giggsy, Ronaldo and Nani.","chinese":"我曾經碰到過吉格斯，羅納爾多和納尼。"},{"english":"Sir Alex feels Mark Clattenburg's decision to allow Nani's late goal against Tottenham to stand was the correct one.","chinese":"弗格森爵士覺得裁判判定納尼的進球有效是對的。"},{"english":"Asnani points to plenty of risks in the near term.","chinese":"阿斯納尼也指出了近期印度所面臨的諸多風險。"},{"english":"Nani is a really funny lad around the dressing room.","chinese":"納尼在更衣室裏是個非常有意思的球員。"},{"english":"I know there are a number of United fans who had lost faith in Nani.","chinese":"我知道很多曼聯球迷都對納尼失去了信心。"},{"english":"He tried every means to seduce multimedia Du, but he found multimedia Du love is Nani.","chinese":"他用盡手段欲引誘繽杜，但他發現繽杜愛的是納尼。"}],"related":[]}