{"definition":["prime number"],"pinyin":["su4 shu4"],"simplified":["素数"],"rank":51448.0,"normalized_rank":0.7198242693044926,"fraction":1.2305913944460886e-7,"cumulative_fraction":0.9991530029202932,"word":"素數","characters":[{"definition":["raw silk\/white\/plain, unadorned\/vegetarian (food)\/essence\/nature\/element\/constituent\/usually\/always\/ever"],"pinyin":["su4"],"word":"素"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[{"definition":["Mersenne prime number (math.)"],"pinyin":["mei2 sen1 su4 shu4"],"word":"梅森素數"}],"sentences":[{"english":"The specific example that I employ verifies that a number is prime.","chinese":"我使用的具體例子是檢查一個數是否爲素數。"},{"english":"Cray number crunchers discovered the largest prime number .","chinese":"克來公司的電腦發現了世界上最大的素數。"},{"english":"Averaging several pixels raises these frame rates and increases the dynamic range.","chinese":"這些像素數提高平均幀速率，提高了動態範圍。"},{"english":"Note that, in the same prime factorization can appear multiple times.","chinese":"注意，同一個素數在因數分解中可以出現多次。"},{"english":"A Stream Parallel Algorithm of the Mersenne Prime Search Problem;","chinese":"梅森素數分佈研究是數學中的一大難題。"},{"english":"While megapixels are important in a digital camera, sensor size is, arguably, even more important.","chinese":"對相機的性能而言，傳感器大小比像素數更重要。"},{"english":"The number of pixels to move before displaying a character.","chinese":"在顯示一個字符之前移動的象素數目。"},{"english":"Number of pixels around the content pages.","chinese":"頁首周圍保留的像素數。"},{"english":"The Mersenne prime is an important research topic in number theory.","chinese":"梅森素數分佈研究是數學中的一大難題。"},{"english":"Every positive integer greater than 1 can be expressed as the product of prime numbers.","chinese":"每個大於1的正整數都能表示爲素數的乘積。"},{"english":"There are a few things I want to work on.","chinese":"關於素數的方程的所有有意義的解都在一條直線上。"},{"english":"Arithmetic progressions, any one in which consists of 3 primes and 1 almost prime, are investigated.","chinese":"考察了由3個素數和1個殆素數構成的等差數列。"},{"english":"Arithmetic progressions, any one in which consists of 3 primes and 1 almost prime, are investigated.","chinese":"考察了由3個素數和1個殆素數構成的等差數列。"},{"english":"The Mersenne prime distribution is a very difficult topic in mathematics.","chinese":"梅森素數分佈研究是數學中的一大難題。"},{"english":"Please specify a number of pixels or a percentage from 1% to 100%.","chinese":"請指定像素數或從1%到100%之間的某百分比。"},{"english":"The topic of primes is a large part of any book on number theory.","chinese":"在任意一本有關數論的書中，素數都是一個大的論題。"}],"related":[]}