{"definition":["cytoplasm"],"pinyin":["xi4 bao1 zhi4"],"simplified":["细胞质"],"rank":52846.0,"normalized_rank":0.7393841030878794,"fraction":1.0568780184803886e-7,"cumulative_fraction":0.9993127930961868,"word":"細胞質","characters":[{"definition":["thin or slender\/finely particulate\/thin and soft\/fine\/delicate\/trifling\/(of a sound) quiet\/frugal"],"pinyin":["xi4"],"word":"細"},{"definition":["placenta\/womb\/born of the same parents"],"pinyin":["bao1"],"word":"胞"},{"definition":["character\/nature\/quality\/plain\/to pawn\/pledge\/hostage\/to question\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"質"}],"containing_words":[],"sentences":[{"english":"Complete disintegration of cytoplasm at stage of vacuolated microspore.","chinese":"單核液泡期的小孢子細胞質完全解體。"},{"english":"The sea water is said to be hypertonic to the cytoplasm .","chinese":"海水對細胞質來說是高滲的。"},{"english":"An infection thread is formed by the cytoplasm of the host cell.","chinese":"侵染線是由寄主細胞的細胞質形成的。"},{"english":"Microtubule bundles in the tetrad cell radiated from the nucleus.","chinese":"在細胞質存在一個疏鬆的微管束網絡。"},{"english":"Others are associated with the protoplasm of the cell.","chinese":"其它一些與細胞的細胞質有關。"},{"english":"The smooth surfaced endoplasmic reticulum, mitochondria and fat droplet almost disappeared in cytoplasm.","chinese":"細胞質中的滑面內質網，線粒體與脂滴幾乎全部消失。"},{"english":"Glycolysis occurs in cell cytoplasm.","chinese":"糖酵解發生在細胞質中。"},{"english":"They move through the cytoplasm to the lowermost cell surface. See gravitropism.","chinese":"它們可以從細胞質運動到細胞最低處的細胞表面位置。"},{"english":"The cell cytoplasm is filled with a gelatinous substance.","chinese":"細胞質是一種使細胞充滿的凝膠狀物質。"},{"english":"The cell nucleus and cytoplasm become fragmented as enzymes such as caspases destroy cellular components.","chinese":"細胞核和細胞質由於酶的作用變成了碎片。"},{"english":"The results showed that PrNV replicated only in the cytoplasm of larval midgut cells.","chinese":"結果表明該病毒只在菜青蟲中腸細胞質內增殖。"},{"english":"Microfilaments and microtubules are responsible for almost all major cytoplasmic movements.","chinese":"絕大部分細胞質運動由微絲和微管完成。"},{"english":"Necrosis of hepatocytes and cytoplasmic blebbing were also observed.","chinese":"壞死的肝細胞和細胞質的起泡是被觀察到了。"},{"english":"The nucleus in shrinking cytoplasm of microspore mother cell enters into telophase . 17.","chinese":"收縮的小孢子母細胞質中核進入減數分裂末期。"},{"english":"The cytoplasm were degraded into central vacuole gradually and haustorial mother cells lost their physiological function.","chinese":"吸器母細胞細胞質逐漸空泡化後喪失其生理功能。"},{"english":"The cytoplasms of amebic cyst in different states were dense, packed with lipid drops, spherical mitochondria and lysosomes.","chinese":"而蟲體的細胞質內富含粒線體和溶脂酶。"}],"related":[]}