{"definition":["cell culture"],"pinyin":["xi4 bao1 pei2 yang3"],"simplified":["细胞培养"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"細胞培養","characters":[{"definition":["thin or slender\/finely particulate\/thin and soft\/fine\/delicate\/trifling\/(of a sound) quiet\/frugal"],"pinyin":["xi4"],"word":"細"},{"definition":["placenta\/womb\/born of the same parents"],"pinyin":["bao1"],"word":"胞"},{"definition":["to bank up with earth\/to cultivate (lit. or fig.)\/to train (people)"],"pinyin":["pei2"],"word":"培"},{"definition":["to raise (animals)\/to bring up (children)\/to keep (pets)\/to support\/to give birth"],"pinyin":["yang3"],"word":"養"}],"containing_words":[{"definition":["cell cultivator"],"pinyin":["xi4 bao1 pei2 yang3 qi4"],"word":"細胞培養器"}],"sentences":[{"english":"Methods To cultivate human uterine leiomyoma cells by digestive method and explanted culture in vitro.","chinese":"方法採用消化法及貼塊法進行體外子宮肌瘤細胞培養。"},{"english":"The culture supernatant of tumor cell lines was not cytoxic.","chinese":"白血病細胞培養上清液無細胞毒作用。"},{"english":"Results At the 20th passage, the SHEE cell remained monolayer, anchorage-dependent and attachment-inhibited growth.","chinese":"結果細胞培養呈單層，錨定依賴和接觸抑制生長。"},{"english":"The microculture assay has also been briefly discussed.","chinese":"本文還對微量細胞培養試驗方法作簡要的討論。"},{"english":"The new bags facilitate the sterile handling of cell cultures.","chinese":"新的袋子是細胞培養的無菌操作變的容易。"},{"english":"Cell culture is a promising way of CoQ10 production.","chinese":"菸草細胞培養是獲得輔酶Q10的一條有效途徑。"},{"english":"The cells that I showed you dying in cell culture are dying from methylmercury.","chinese":"我給你看死於乙基汞的細胞培養中的細胞。"},{"english":"Results Fibroblast-like cells could grow up in each group.","chinese":"結果各組均有纖維母細胞樣細胞培養出。"},{"english":"Improved explant culture was a good culturing method for rat DF cells.","chinese":"改良組織塊法是一種良好的大鼠牙囊細胞培養方法。"},{"english":"Used in cell culture to prevent proteolytic damage to cells and to extend lifetime of cells.","chinese":"用於細胞培養中防止細胞蛋白的水解並延長細胞壽命。"},{"english":"Methods The fresh human hilar cholangiocarcinoma specimen was cultured.","chinese":"方法將人肝門部膽管癌標本進行細胞培養，傳代。"},{"english":"Objective The Aim is to study the cryopreservation of the cultured epidermal cell sheets.","chinese":"目的研究表皮細胞培養膜片的冷凍保存。"},{"english":"The cultured vitelline cells from adult Schistosoma japonica were observed ultrastructurally.","chinese":"從超微結構水平研究日本血吸蟲卵黃細胞培養的動態。"},{"english":"Methods Use villus cell culture and the chromosome with G-bands by trypsin using Giemsa.","chinese":"方法絨毛細胞培養法及G顯帶製作染色體分析。"},{"english":"virus isolation by cell culture.","chinese":"通過細胞培養分離病毒。"},{"english":"Effect of gibberellin and chlorocholine chloride on taxanes production was investigated.","chinese":"考察了矮壯素和赤黴素對細胞培養生產紫杉烷的影響。"}],"related":[]}