{"definition":["cytology"],"pinyin":["xi4 bao1 xue2"],"simplified":["细胞学"],"rank":52173.0,"normalized_rank":0.7299679599289242,"fraction":1.1400852657916903e-7,"cumulative_fraction":0.9992388871053304,"word":"細胞學","characters":[{"definition":["thin or slender\/finely particulate\/thin and soft\/fine\/delicate\/trifling\/(of a sound) quiet\/frugal"],"pinyin":["xi4"],"word":"細"},{"definition":["placenta\/womb\/born of the same parents"],"pinyin":["bao1"],"word":"胞"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"The invention relates to a system and a method for manufacturing flakes of liquid-based cytology.","chinese":"本發明是關於一種液基細胞學制片系統以及製片方法。"},{"english":"There are obvious difference on morphology and cytology between polypoid and diploid .","chinese":"四倍體與二倍體在形態學和細胞學上有明顯差異。"},{"english":"Treatment of asymptomatic women with trichomonads noted on liquid-based cervical cytology is recommended.","chinese":"宮頸細胞學檢查發現滴蟲的無症狀患者建議用藥治療。"},{"english":"Who Are Cytologist?","chinese":"誰堪稱細胞學家？"},{"english":"The patch clamp technique has become the main method for the molecule and cell research.","chinese":"膜片鉗技術已成爲分子和細胞學研究的重要手段。"},{"english":"Objective To discuss the method of manufactures the high quality LCT fluid basal cell study flat and thin piece.","chinese":"目的探討如何製作優質的LCT液基細胞學片子。"},{"english":"Objective To explore clinical features of meninges carcinoma and cytologic changes of CSF.","chinese":"目的探討腦膜癌病的臨牀特徵和腦脊液細胞學改變。"},{"english":"Cytological examination by fine-needle aspirate biopsy was helpful to diagnosis.","chinese":"針刺細胞學檢查有助於甲狀腺結核的診斷。"},{"english":"Objective:To analysis the cytologic examination by CT - guided percutaneous needle aspiration biopsy of the lung.","chinese":"分析CT引導下經皮肺穿刺細胞學檢查結果。"},{"english":"Aspiration cytologic examination reealed a fibrocystic change.","chinese":"抽吸細胞學檢查爲纖維囊性變。"},{"english":"Demonstrate the techniques for preparing intraoperative cytology smears.","chinese":"掌握製備術中細胞學塗片的技術。"},{"english":"The experiment would provide cytological evidence for the early diagnosis of endometritis in dairy cows.","chinese":"平實驗可爲奶牛子宮內膜炎早期診斷提供細胞學依據。"},{"english":"Cytological study relieved that it was a diploid with 30chromosomes and its karyotype was 1A.","chinese":"細胞學研究發現，其染色體數爲30，核型屬1A型。"},{"english":"All epithelial lining appears benign cytologically.","chinese":"所有襯覆上皮似乎細胞學良性。"},{"english":"The sperm basic proteins and cytology of fertilization in S. serrata were studied in this paper.","chinese":"研究鋸緣青蟹精子鹼性蛋白分佈與受精細胞學。"},{"english":"Cytological observation of cytoplasmic male- sterile anther of brown cotton.","chinese":"棕色棉細胞質雄性不育花葯的細胞學觀察。"}],"related":[]}