{"definition":["to organize\/to set up\/to establish"],"pinyin":["zu3 jian4"],"simplified":["组建"],"rank":2873.0,"normalized_rank":0.04019699746757517,"fraction":0.00005067598718749289,"cumulative_fraction":0.7844673020854653,"word":"組建","characters":[{"definition":["surname Zu","to form\/to organize\/group\/team\/classifier for sets, series, groups of people, batteries"],"pinyin":["Zu3","zu3"],"word":"組"},{"definition":["to establish\/to found\/to set up\/to build\/to construct"],"pinyin":["jian4"],"word":"建"}],"containing_words":[],"sentences":[{"english":"The new premier is forming his government mainly from young men.","chinese":"這位新總理主要從年輕人中物色人選組建政府。"},{"english":"Create a treasure hunt with some blogging friends.","chinese":"和一些博友組建一支尋寶隊。"},{"english":"Bayerische Landesbank is a corporation established under the German public law.","chinese":"德國巴伐利亞州銀行是一家依據德國立法組建的銀行。"},{"english":"Swing Dynasty Jazz and chanson Franaise band based in Shanghai.","chinese":"在上海組建的法國爵士和香頌。"},{"english":"In that year, the Council of Nicaea was convened by emperor Constantine.","chinese":"在那些年裏，康斯坦丁大帝組建了尼西亞理事會。"},{"english":"Construction and Analysis of the Susceptible Population Life Table of Plutella xylostella L.","chinese":"小菜蛾敏感種羣生命表的組建與分析。"},{"english":"The Center for Food Safety and Applied Nutrition had a Sugar Task Force look into these claims.","chinese":"食品安全中心爲此特別組建了一個研究小組。"},{"english":"Many former Thai Rak Thai Party members moved to establish the People's Power Party.","chinese":"許多前泰愛泰黨的成員組建了人民力量黨。"},{"english":"Three experimental population life tables of citrus black scale Par-latoria zizyphus Lucas under different humidity conditions were established.","chinese":"本文組建了黑點蚧三種溼度範圍種羣生命表。"},{"english":"The second part is the introduction of the new journey after amalgamation.","chinese":"第二部分爲新的歷程，即三峽大學合併組建後的情況。"},{"english":"The SKA will be built in the southern hemisphere with South Africa and Australia currently vying for the right to host the project.","chinese":"她又南非與澳大利亞共同組建，目前坐落於南半球。"},{"english":"In 1869, he formed the Westinghouse Air Brake Company.","chinese":"在1869年，他組建了西屋空氣制動公司。"},{"english":"I've recently started to crew for a sailboat and occasionally take part in offshore races.","chinese":"我最近開始組建一支帆船隊，並偶爾參加近海比賽。"},{"english":"Separate mechanized divisions and tank battalions for infantry divisions were also formed.","chinese":"同時獨立的機械化師和步兵師屬坦克營也開始組建。"},{"english":"Clarity and thermoformability are enhanced by the incorporation of nucleating and slip agent.","chinese":"淨度和熱成型性能，從而加強了對核和滑移代理組建。"},{"english":"The Shabab says it has set up three units of suicide-bombers.","chinese":"伊斯蘭青年黨宣稱他們已經組建了3自殺襲擊者小組。"}],"related":[{"definition":["to found\/to establish"],"pinyin":["chuang4 jian4"],"word":"創建"},{"definition":["team"],"pinyin":["tuan2 dui4"],"word":"團隊"},{"definition":["to establish\/to found\/to launch"],"pinyin":["chuang4 ban4"],"word":"創辦"},{"definition":["to combine\/to join\/unite\/alliance"],"pinyin":["lian2 he2"],"word":"聯合"},{"definition":["to set up\/to establish"],"pinyin":["she4 li4"],"word":"設立"},{"definition":["to originate\/to initiate\/to launch (an attack, an initiative etc)\/to start\/to propose sth (for the first time)"],"pinyin":["fa1 qi3"],"word":"發起"},{"definition":["member"],"pinyin":["cheng2 yuan2"],"word":"成員"},{"definition":["to form\/to make up\/to constitute"],"pinyin":["zu3 cheng2"],"word":"組成"},{"definition":["to establish\/to set up\/to found"],"pinyin":["chuang4 li4"],"word":"創立"},{"definition":["preparations\/to get ready for sth"],"pinyin":["chou2 bei4"],"word":"籌備"},{"definition":["to establish (a unit or department)\/staffing structure (excluding temporary and casual staff)"],"pinyin":["bian1 zhi4"],"word":"編制"},{"definition":["to guide\/to lead"],"pinyin":["dai4 ling3"],"word":"帶領"},{"definition":["to open\/to start (a business etc)\/to set up"],"pinyin":["kai1 ban4"],"word":"開辦"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to arrange\/to make preparations"],"pinyin":["chou2 ban4"],"word":"籌辦"},{"definition":["alliance\/union\/coalition"],"pinyin":["lian2 meng2"],"word":"聯盟"}]}