{"definition":["to stumble over sth"],"pinyin":["ban4 jiao3"],"simplified":["绊脚"],"rank":58697.0,"normalized_rank":0.8212471842513956,"fraction":5.050825889422854e-8,"cumulative_fraction":0.999754879624166,"word":"絆腳","characters":[{"definition":["to trip\/to stumble\/to hinder"],"pinyin":["ban4"],"word":"絆"},{"definition":["foot\/leg (of an animal or an object)\/base (of an object)\/CL:雙|双[shuang1],隻|只[zhi1]\/classifier for kicks","variant of 角[jue2]\/role"],"pinyin":["jiao3","jue2"],"word":"腳"}],"containing_words":[{"definition":["stumbling block\/obstacle\/someone who gets in your way"],"pinyin":["ban4 jiao3 shi2"],"word":"絆腳石"}],"sentences":[{"english":"In his letter of resignation, the General admitted that he has become a liability to the president.","chinese":"在辭職信中，將軍承認他已經成爲總統的絆腳石。"},{"english":"The stumbling block lies with their conflicting views of space and time.","chinese":"絆腳石正是它們對空間和時間觀念的衝突。"},{"english":"Diapers seem to be a stumbling block for everyone.","chinese":"尿片似乎對所有人來說都是個絆腳石。"},{"english":"Please don't move that stumbling block, but lead me , Lord, around it.","chinese":"上帝，請不要搬開那塊絆腳石，指引我繞開它。"},{"english":"He flung himself resolutely into the tangle of undergrowth.","chinese":"他果斷地鑽進了纏手絆腳的荊棘叢。"},{"english":"I know this is my biggest stumbling block.","chinese":"我知道這是我最大的絆腳石。"},{"english":"The next rock in your path may be a stepping stone.","chinese":"也許人生路上的下一個絆腳石就是墊腳石。"},{"english":"Overstaffing has become the obstacle for reforms.","chinese":"人浮於事已成爲改革的絆腳石。"},{"english":"But it can also be destructive, and become an obstacle to success.","chinese":"但競爭也具有破壞性，成爲阻礙成功的絆腳石。"},{"english":"Wilfulness is the stumbling block in a marriage.","chinese":"任性，刁蠻是婚姻的絆腳石。"},{"english":"Agriculture continues to be the main stumbling block to a deal.","chinese":"農業仍舊是達成協議最大的絆腳石。"},{"english":"Second-guessing is what gets in the way of a writer’s ability to write faster.","chinese":"“推敲”是阻礙作者寫得更快的絆腳石。"},{"english":"Articles and prepositions are stumbling blocks to the beginners of English.","chinese":"冠詞和介係詞對英文初學者來說是個絆腳石。"},{"english":"The key to success is to turn blocking stone into stepping-stone.","chinese":"人生的一大祕訣就是將絆腳石變成墊腳石。"},{"english":"Our CM tool was a stumbling block in this project.","chinese":"我們的配置管理工具是我們這個項目的一塊絆腳石。"},{"english":"Pride is a stumbling block to real progress.","chinese":"驕傲自滿是真正取得進步的絆腳石。"}],"related":[]}