{"definition":["to make friends with"],"pinyin":["jie2 jiao1"],"simplified":["结交"],"rank":19453.0,"normalized_rank":0.2721727085752662,"fraction":0.0000025322738931739373,"cumulative_fraction":0.9734910626379611,"word":"結交","characters":[{"definition":["(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]","knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)"],"pinyin":["jie1","jie2"],"word":"結"},{"definition":["to hand over\/to deliver\/to pay (money)\/to turn over\/to make friends\/to intersect (lines)\/variant of 跤[jiao1]"],"pinyin":["jiao1"],"word":"交"}],"containing_words":[],"sentences":[{"english":"You need to build a business, not to make new friends on-line.","chinese":"你需要建立一個生意，不結交新朋在網上。"},{"english":"He liked most animals stamps, he likes to make friends with like-minded friends.","chinese":"他最喜歡動物郵票，他喜歡結交情趣相投朋友。"},{"english":"With softness and strength, i would like to make more friends.","chinese":"我剛柔並濟，活潑大方，願意結交更多的朋友。"},{"english":"It is every renju players right and free choice to make friends.","chinese":"每個棋手都有權力自由地選擇結交棋友。"},{"english":"If you get out more you can meet more new friends.","chinese":"如果你更加經常外出，你就會結交到更多的朋友。"},{"english":"In addition, you can try to write English diaries and even make foreign penpals by writing those.","chinese":"此外，你可以嘗試用英文寫日記，甚至結交外國筆友。"},{"english":"Seek the fellowship of godly men, harken unto their words and remember them.","chinese":"與虔誠之人結交，傾聽其話語並銘記在心。"},{"english":"Avoid malcontents and pessimists. They dray you down and contribute nothing.","chinese":"避免結交不滿意者和悲觀者，他們對你有害無益。"},{"english":"Henry made many friends among the residents and staff at St Dunstan's.","chinese":"在聖鄧斯坦，亨利結交了許多當地的朋友。"},{"english":"Now Dauren has a lot of friends and soul mates.","chinese":"如今Dauren結交了很多朋友和靈魂伴侶。"},{"english":"Making new friends and communication with interesting people are the best ways to fight boredom.","chinese":"結交新朋友的最好方法是無聊時與有趣的人通信。"},{"english":"Do they really think that America is going to think that Barack Obama is palling around with terrorists?","chinese":"他們真的認爲美國人會相信奧巴馬在結交恐怖分子麼？"},{"english":"Hehe. Just want to make friends in my free time.","chinese":"男女皆可，只是純粹想結交儀徵的朋友。"},{"english":"Money can buy a lot of influence.","chinese":"金錢可結交許多達官貴人。"},{"english":"Avoid malcontents and pessimists. They drag you down and contribute nothing.","chinese":"避免結交不滿意者和悲觀者，他們對你有害無益。"},{"english":"Never do a wrong thing to make a friend or keep one.","chinese":"千萬不要爲了結交朋友或者挽留友情而做錯一事。"}],"related":[{"definition":["to get to know sb\/to meet sb for the first time"],"pinyin":["jie2 shi2"],"word":"結識"},{"definition":["intimate\/to get close to"],"pinyin":["qin1 jin4"],"word":"親近"},{"definition":["to know\/to recognize\/to be familiar with\/to get acquainted with sb\/knowledge\/understanding\/awareness\/cognition"],"pinyin":["ren4 shi5"],"word":"認識"},{"definition":["willing (to do sth)\/to take pleasure in"],"pinyin":["le4 yu2"],"word":"樂於"},{"definition":["to invite\/to make an appointment"],"pinyin":["yao1 yue1"],"word":"邀約"},{"definition":["to take care\/to keep an eye on\/to look after\/to tell\/to remind"],"pinyin":["guan1 zhao4"],"word":"關照"},{"definition":["to go with sb\/to form companionships"],"pinyin":["jie2 ban4"],"word":"結伴"},{"definition":["to gain first-hand knowledge of sth\/to experience for oneself\/knowledge\/experience\/insight"],"pinyin":["jian4 shi5"],"word":"見識"},{"definition":["party\/gathering\/to meet\/to get together"],"pinyin":["ju4 hui4"],"word":"聚會"},{"definition":["to chat"],"pinyin":["tan2 tian1"],"word":"談天"},{"definition":["younger generation"],"pinyin":["hou4 bei4"],"word":"後輩"},{"definition":["senior\/older generation\/precursor"],"pinyin":["qian2 bei4"],"word":"前輩"},{"definition":["at one's side\/on hand"],"pinyin":["shen1 bian1"],"word":"身邊"},{"definition":["to interact\/interactive"],"pinyin":["hu4 dong4"],"word":"互動"},{"definition":["to be in contact (with sb)\/to associate\/to interact\/to get along (well, poorly)"],"pinyin":["xiang1 chu3"],"word":"相處"},{"definition":["to experience\/experience"],"pinyin":["yue4 li4"],"word":"閱歷"}]}