{"definition":["conclusion\/verdict\/CL:個|个[ge4]\/to conclude\/to reach a verdict"],"pinyin":["jie2 lun4"],"simplified":["结论"],"rank":3528.0,"normalized_rank":0.04936129727309613,"fraction":0.00003918433644566785,"cumulative_fraction":0.8136675734824559,"word":"結論","characters":[{"definition":["(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]","knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)"],"pinyin":["jie1","jie2"],"word":"結"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"論"}],"containing_words":[],"sentences":[{"english":"Conclusion Complex treatment is the most effective method for treatment of residual brun wound.","chinese":"結論綜合治療是治療燒傷殘餘創面的重要方法。"},{"english":"That's according to a new AP Ipsos poll.","chinese":"這是根據最新的美聯社依普索民意調查得出的結論。"},{"english":"Conclusions Uterine cavity and fallopian tube abnormalities were the important reason of female infertile.","chinese":"結論子宮腔及輸卵管形態異常是不孕症的重要原因。"},{"english":"Conclusion Mutations in the CYP1B1 gene have genetic heterogeneity.","chinese":"結論CYP1B1基因具有明顯的遺傳異質性。"},{"english":"Conclusions Osteoclast-mediated bone resorption was inhibited by the bisphosphonate administration.","chinese":"結論雙膦酸鹽對破骨細胞性骨吸收有明顯的抑制作用。"},{"english":"Conclusion The above procedure is necessary for the ankle sprains with the injury of the common peroneal nerve.","chinese":"結論踝扭傷出現腓總神經損傷者應作探查鬆解減壓術。"},{"english":"Conclusion Heavy-moxibustion is a good method for constipation after stroke.","chinese":"結論重灸法是治療中風後便祕的良好方法。"},{"english":"Conclusion Tibia fracture healing delays after ovariectomy.","chinese":"結論卵巢切除後，脛骨骨折癒合緩慢。"},{"english":"Purpose To study limb immobilization influencing on denervated muscle atrophy.","chinese":"結論肢體制動加速了失神經支配肌肉萎縮的發展。"},{"english":"The results provide empirical foundation for model-building and simulations.","chinese":"結論爲進一步建模仿真提供了實證基礎。"},{"english":"Conclusions It was proved feasibility of DNA fingerprints in the heredity monitoring of inbred strain rat.","chinese":"結論證實了該方法在近交系大鼠遺傳監測中的可行性。"},{"english":"If the conclusions can not be applied in practice, better dump them when it is still early.","chinese":"如果得出結論不能在實踐中應用，趁早扔了。"},{"english":"This conclusion plays an important theoretical guiding role in ESG designing and testing.","chinese":"其結論對靜電陀螺儀的設計與測試具有理論指導意義。"},{"english":"Conclusions Up till now, the operation pattern for ectopic IUD is not definite .","chinese":"結論對迷路IUD的處理方案是不定型的。"},{"english":"Conclusion These results suggest that benidipine is a safe and effective anti-hypertension drug.","chinese":"結論貝尼地平是一種安全有效的抗高血壓藥。"},{"english":"At last that RFID is IT Pioneer is concluded.","chinese":"最後本文得出RFID是IT“尖兵”的結論。"}],"related":[{"definition":["to judge\/to determine\/judgment"],"pinyin":["pan4 duan4"],"word":"判斷"},{"definition":["point of view\/viewpoint\/standpoint\/CL:個|个[ge4]"],"pinyin":["guan1 dian3"],"word":"觀點"},{"definition":["to expound Buddhist teachings","way of speaking\/wording\/formulation\/one's version (of events)\/statement\/theory\/hypothesis\/interpretation"],"pinyin":["shuo1 fa3","shuo1 fa5"],"word":"說法"},{"definition":["explanation\/to explain\/to interpret\/to resolve\/CL:個|个[ge4]"],"pinyin":["jie3 shi4"],"word":"解釋"},{"definition":["to recognize\/to know\/to admit"],"pinyin":["ren4"],"word":"認"},{"definition":["logic (loanword)"],"pinyin":["luo2 ji5"],"word":"邏輯"},{"definition":["question\/problem\/issue\/topic\/CL:個|个[ge4]"],"pinyin":["wen4 ti2"],"word":"問題"},{"definition":["to explain\/to illustrate\/to indicate\/to show\/to prove\/explanation\/directions\/caption\/CL:個|个[ge4]"],"pinyin":["shuo1 ming2"],"word":"說明"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"認為"},{"definition":["fact\/CL:個|个[ge4]"],"pinyin":["shi4 shi2"],"word":"事實"},{"definition":["outcome\/result\/conclusion\/in the end\/as a result\/to kill\/to dispatch","to bear fruit\/CL:個|个[ge4]"],"pinyin":["jie1 guo3","jie2 guo3"],"word":"結果"},{"definition":["cognition\/cognitive\/understanding\/perception\/awareness\/to be cognizant of\/to recognize\/to realize"],"pinyin":["ren4 zhi1"],"word":"認知"},{"definition":["to prove a point\/to expound on\/to demonstrate or prove (through argument)\/proof"],"pinyin":["lun4 zheng4"],"word":"論證"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或許"},{"definition":["theory\/CL:個|个[ge4]\/to argue\/to take notice of"],"pinyin":["li3 lun4"],"word":"理論"},{"definition":["to sum up\/to conclude\/summary\/résumé\/CL:個|个[ge4]"],"pinyin":["zong3 jie2"],"word":"總結"}]}