{"definition":["danger spot\/Jedi (in Star Wars)"],"pinyin":["jue2 di4"],"simplified":["绝地"],"rank":21755.0,"normalized_rank":0.3043806752200132,"fraction":0.0000020077762798590148,"cumulative_fraction":0.9786805506314541,"word":"絕地","characters":[{"definition":["to cut short\/extinct\/to disappear\/to vanish\/absolutely\/by no means"],"pinyin":["jue2"],"word":"絕"},{"definition":["-ly\/structural particle: used before a verb or adjective, linking it to preceding modifying adverbial adjunct","earth\/ground\/field\/place\/land\/CL:片[pian4]"],"pinyin":["de5","di4"],"word":"地"}],"containing_words":[],"sentences":[{"english":"Lightsabers have changed little in the thousands of years of their employ by the Jedi Knights.","chinese":"在絕地武士使用光劍的幾千年裏，光劍的變化不大。"},{"english":"They caught up with the old Jedi in a hidden hangar.","chinese":"他們在一個隱蔽的機庫裏追上了這名老絕地。"},{"english":"The beleaguered Jedi Knights fought valiantly to repulse the Mandalorian marauders.","chinese":"被圍攻的絕地武士英勇戰鬥，擊退了曼達洛強盜。"},{"english":"He kept rabbiting (on) about the poor pay.","chinese":"他不絕地埋怨薪水低。"},{"english":"Can he play Lazarus one last time?","chinese":"現在他能最後一次上演絕地反擊嗎？"},{"english":"The loyal clone troopers executed their treasonous Jedi generals in cold blood.","chinese":"忠誠的克隆人士兵冷酷地處決了叛國的絕地將軍們。"},{"english":"Luke’s journey to becoming a Jedi Knight would have had a lot more bumps.","chinese":"盧克成爲絕地武士的旅程原本要更加坎坷。"},{"english":"You've proved yourself worthy of the title of Jedi Master.","chinese":"證明了自己無愧於絕地大師的稱號。"},{"english":"Jabba's enforcers were no match for a group of determined Rebels led by a Jedi Knight.","chinese":"賈巴的打手無法與絕地武士領導的頑強義軍相匹敵。"},{"english":"The frozen Dark Jedi lured Aayla to his tomb, and had her deactivate the stasis shield.","chinese":"被冰凍的黑暗絕地引誘她進入墳墓，打開了封印罩。"},{"english":"For the first time in ages, Jedi and Sith dueled.","chinese":"這是許多年以來，絕地和西斯的第一次對決。"},{"english":"Now face oblivion like all of the Jedi before you.","chinese":"現在面對死亡吧，就向你之前的絕地武士一樣。"},{"english":"Windu arranged a group of Jedi Masters to arrest the Chancellor.","chinese":"溫杜安排了一隊絕地大師去捉拿議長。"},{"english":"As such, he came to be regarded as a Jedi of mystery, an unapproachable enigma.","chinese":"因此，他被看作一個神祕的絕地，一個無法接近的謎。"},{"english":"Aurra continued to kill Jedi as the Republic began to decay and crumble around her.","chinese":"當共和國腐朽敗落之時，奧拉繼續殺害絕地。"},{"english":"But what happens when a Jedi loses his memory?","chinese":"但如果一名絕地失憶會有何後果？"}],"related":[{"definition":["lit. to directly attack Huanglong\/fig. to directly combat the root of a problem"],"pinyin":["zhi2 dao3 Huang2 Long2"],"word":"直搗黃龍"},{"definition":["no room to advance or to retreat (idiom); without any way out of a dilemma\/trapped\/in an impossible situation"],"pinyin":["jin4 tui4 wei2 gu3"],"word":"進退維谷"},{"definition":["no way out\/nowhere to go\/trapped beyond hope of rescue\/painted into a corner"],"pinyin":["wu2 lu4 ke3 tao2"],"word":"無路可逃"},{"definition":["microphone\/to use a microphone"],"pinyin":["chuan2 sheng1"],"word":"傳聲"},{"definition":["location on wrist over the radial artery where pulse is taken in TCM"],"pinyin":["qi4 kou3"],"word":"氣口"},{"definition":["to be drowned (figurative and literal)"],"pinyin":["mie4 ding3"],"word":"滅頂"},{"definition":["isolated\/solitary"],"pinyin":["gu1 jue2"],"word":"孤絕"},{"definition":["the earth's axis"],"pinyin":["di4 zhou2"],"word":"地軸"},{"definition":["opponent\/substantial adversary\/worthy match\/antagonist\/in the enemy's hands"],"pinyin":["di2 shou3"],"word":"敵手"},{"definition":["to be buried in a horse hide (idiom)\/to give one's life on the battlefield"],"pinyin":["ma3 ge2 guo3 shi1"],"word":"馬革裹屍"},{"definition":["evening mist\/fig. declining spirits\/lethargy"],"pinyin":["mu4 qi4"],"word":"暮氣"},{"definition":["variant of 兇惡|凶恶, fierce\/ferocious\/fiendish\/frightening"],"pinyin":["xiong1 e4"],"word":"凶惡"},{"definition":["eager to win\/competitive\/aggressive"],"pinyin":["hao4 sheng4"],"word":"好勝"},{"definition":["long-range raid"],"pinyin":["ben1 xi2"],"word":"奔襲"},{"definition":["to touch base matter and turn it to gold (idiom); fig. to turn crude writing into a literary gem"],"pinyin":["dian3 shi2 cheng2 jin1"],"word":"點石成金"},{"definition":["extreme joy turns to sorrow (idiom); Don't celebrate too soon, things could still go wrong!"],"pinyin":["le4 ji2 sheng1 bei1"],"word":"樂極生悲"}]}