{"definition":["overwhelming majority"],"pinyin":["jue2 da4 bu4 fen5"],"simplified":["绝大部分"],"rank":6262.0,"normalized_rank":0.08761350440026304,"fraction":0.00001733455123460072,"cumulative_fraction":0.8846988222659224,"word":"絕大部分","characters":[{"definition":["to cut short\/extinct\/to disappear\/to vanish\/absolutely\/by no means"],"pinyin":["jue2"],"word":"絕"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["ministry\/department\/section\/part\/division\/troops\/board\/classifier for works of literature, films, machines etc"],"pinyin":["bu4"],"word":"部"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"}],"containing_words":[],"sentences":[{"english":"Humans lived as roaming hunters and gatherers for most of their existence.","chinese":"當時的人類羣體絕大部分是以遊獵部落形式存在的。"},{"english":"In 20 years, he is engaged in majority time party work works.","chinese":"二十年中，絕大部分時間他在從事黨務工作。"},{"english":"His idea ofalienation was derived mostly from Hegel.","chinese":"他的關於異化的理念絕大部分脫胎於黑格爾。"},{"english":"Those are put in the galosh on the balcony, the majority made a patch.","chinese":"那些放在陽臺上的套鞋，絕大部分是打了補丁的。"},{"english":"At present, mostly cables bridge frames are made by thin steel plate in our country.","chinese":"目前，國內絕大部分電纜橋架均採用薄鋼板製造。"},{"english":"They slathered time drinking.","chinese":"他們花費絕大部分時間湊在一起喝酒。"},{"english":"Microorganisms do most of the work.","chinese":"微生物做絕大部分的工作。"},{"english":"This will cover the vast majority of roundtrip problems.","chinese":"這將包括絕大部分往返問題。"},{"english":"Now and then, someone gave him a ride , but most of the way he walked.","chinese":"偶爾有人會讓他搭個便車，但絕大部分路他得自己走。"},{"english":"Most metals (copper, iron) are good conductors of electricity.","chinese":"它們中的絕大部分都像銅和鋅一樣，是電流的良導體。"},{"english":"Believe that the majority of people in the youth in life gets pimples.","chinese":"相信絕大部分人在青春年少時都會得青春痘。"},{"english":"As an envoy, Bush could assuage most of these worries.","chinese":"作爲大使，布什能夠緩和絕大部分的困擾。"},{"english":"Therefore, the majority of liver cancer patients need non-surgical treatment.","chinese":"爲此，絕大部分肝癌患者需非手術治療。"},{"english":"The bentonite in coal series is very rich.","chinese":"煤系地層中膨潤土儲量相當豐富，絕大部分品質優良。"},{"english":"Most of those from his village are illiterate.","chinese":"他們村絕大部分村民家的孩子都是文盲。"},{"english":"Almost all of Luxun's essays were directed at the enemy.","chinese":"魯迅的雜文絕大部分是對準敵人的。"}],"related":[]}