{"definition":["absolute zero"],"pinyin":["jue2 dui4 ling2 du4"],"simplified":["绝对零度"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"絕對零度","characters":[{"definition":["to cut short\/extinct\/to disappear\/to vanish\/absolutely\/by no means"],"pinyin":["jue2"],"word":"絕"},{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["zero\/nought\/zero sign\/fractional\/fragmentary\/odd (of numbers)\/(placed between two numbers to indicate a smaller quantity followed by a larger one)\/fraction\/(in mathematics) remainder (after division)\/extra\/to wither and fall\/to wither"],"pinyin":["ling2"],"word":"零"},{"definition":["to estimate\/Taiwan pr. [duo4]","to pass\/to spend (time)\/measure\/limit\/extent\/degree of intensity\/degree (angles, temperature etc)\/kilowatt-hour\/classifier for events and occurrences"],"pinyin":["du4","duo2"],"word":"度"}],"containing_words":[],"sentences":[{"english":"Its lower fixed point is absolute zero.","chinese":"其低端固定點溫度是絕對零度。"},{"english":"Guess what the third law is going to tell us?","chinese":"它說絕對零度不可達到？"},{"english":"What weird behaviour can gases display near absolute zero?","chinese":"什麼樣的希奇古怪的行爲可以氣化顯示接近絕對零度？"},{"english":"The study and use of devices utilizing properties of materials near absolute zero in temperature.","chinese":"絕對零度時的特性進行研究和利用的學科。"},{"english":"He achieved a temperature of within one-tenth of a degree above absolute zero.","chinese":"他實現了高出絕對零度不到十分之一度的溫度。"},{"english":"If this were to be an absolute zero Kelvin, then we could we can have something, T2 Sorry, it's T2.","chinese":"如果它等於絕對零度，我們可以，對不起，這是。"}],"related":[]}