{"definition":["one and only (idiom); rarely seen\/unique of its kind"],"pinyin":["jue2 wu2 jin3 you3"],"simplified":["绝无仅有"],"rank":19897.0,"normalized_rank":0.2783848446266422,"fraction":0.0000024230826282812118,"cumulative_fraction":0.9745901349055768,"word":"絕無僅有","characters":[{"definition":["to cut short\/extinct\/to disappear\/to vanish\/absolutely\/by no means"],"pinyin":["jue2"],"word":"絕"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["barely\/only\/merely"],"pinyin":["jin3"],"word":"僅"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"}],"containing_words":[],"sentences":[{"english":"Examples of demonization of homosexuality is not unique in history.","chinese":"將同性戀妖魔化的事例在歷史上並非絕無僅有。"},{"english":"It is the only case of that kind I ever heard of.","chinese":"這是我聽到的同類情況中絕無僅有的。"},{"english":"In other words, we are the only ones with anything to offer.","chinese":"換句話說，我們是絕無僅有的供方。"},{"english":"This is the only zero-emission car on the market.","chinese":"這是現在市場上絕無僅有的“零排放”車型。"},{"english":"Toys “R” Us’s frustration is not unique.","chinese":"玩具反斗城的挫折並非絕無僅有。"},{"english":"It is unparallel in the scripture where there is such emphasis on joy.","chinese":"在經文的描述中，這樣重複地強調歡樂是絕無僅有的。"},{"english":"The  most  special  feeling  of  human  is  the  blind  love. That's  the  unique.","chinese":"人類的感情最特別的就是單戀，那是絕無僅有的。"},{"english":"Never again will the automotive industry experience this kind of growth.","chinese":"體驗這種增長是汽車行業絕無僅有的機會。"},{"english":"The most special feeling of human is the blind love.","chinese":"人類的感情最特別的就是單戀，那是絕無僅有的。"},{"english":"Each storm provides a remarkable drama, one without parallel in nature.","chinese":"每次暴風雨都是一次大自然的絕無僅有的精彩演出。"},{"english":"5The most special feeling of human is the blind love. That's the unique.","chinese":"5人類的感情最特別的就是單戀，那是絕無僅有的。"}],"related":[]}