{"definition":["absolutely not"],"pinyin":["jue2 fei1"],"simplified":["绝非"],"rank":10824.0,"normalized_rank":0.15144180319841058,"fraction":0.000007262678891634848,"cumulative_fraction":0.9360869029150078,"word":"絕非","characters":[{"definition":["to cut short\/extinct\/to disappear\/to vanish\/absolutely\/by no means"],"pinyin":["jue2"],"word":"絕"},{"definition":["abbr. for 非洲[Fei1 zhou1], Africa","to not be\/not\/wrong\/incorrect\/non-\/un-\/in-\/to reproach or blame\/(colloquial) to insist on\/simply must"],"pinyin":["Fei1","fei1"],"word":"非"}],"containing_words":[],"sentences":[{"english":"She has the beauty that beggars description.","chinese":"她的美貌絕非筆墨所能形容。"},{"english":"For example, honeybees are great builders. Beehive construction begins with finding a suitable site.","chinese":"事實上，蜜蜂是偉大的建築師，而絕非僅僅是蜇人。"},{"english":"I didn't break it on purpose, Mum, it was an accident!","chinese":"他的死絕非僅僅偶然事故所致，而是壞人有意策劃的。"},{"english":"But we even find it hard to beat them when we’re at home”.","chinese":"但即使是在主場，擊敗希洪也絕非易事。"},{"english":"Some say this is no coincidence.","chinese":"一些人說，這絕非巧合。"},{"english":"It was not brought about by accident, but by the malice of Cupid (Eros).","chinese":"事情的發生絕非偶然，而是邱比特故意搞的鬼。"},{"english":"But no one became Roman overnight.","chinese":"但轉化爲羅馬人絕非一夕之功。"},{"english":"Certainly the phenomenon of sexuality-in-flux is by no means exclusive to women.","chinese":"當然性傾向在同量的情況下絕非排斥女性。"},{"english":"This small\"demon\"not wave get hollow reputation.","chinese":"這個小“精靈”絕非浪得虛名。"},{"english":"In which, it's not as easy as the so called \"popularity of Sinology\" can explain it.","chinese":"這其中，絕非是所謂的國學熱這麼簡單可以解釋的。"},{"english":"Whatever else is unsure in this stinking dunghill of a world a mother's love is not.","chinese":"母親之愛絕非是惡臭糞坑般的世界所無法確定的東西。"},{"english":"Sovereign default is far from inconceivable.","chinese":"主權國拖欠債務也絕非天方夜譚。"},{"english":"Art cannot rival this pomp of purple and gold.","chinese":"浮華的金紫，絕非畫師所能描繪。"},{"english":"Failure should be our teacher, not our undertaker.","chinese":"失敗是我們的老師，而絕非掘墓人。"},{"english":"The reason why Lu Xun named his essay collections of \"wild grass\" is by no means accidental.","chinese":"散文詩集《野草》被魯迅命名爲“野草”絕非偶然。"},{"english":"Quintana is a crafty southpaw with good skills and is by no means a walk - over.","chinese":"昆塔納是個技術出色的狡猾的左撇子，絕非等閒之輩。"}],"related":[]}