{"definition":["capstan"],"pinyin":["jiao3 pan2"],"simplified":["绞盘"],"rank":43928.0,"normalized_rank":0.6146097127586642,"fraction":2.650953703812688e-7,"cumulative_fraction":0.9977501071259399,"word":"絞盤","characters":[{"definition":["to twist (strands into a thread)\/to entangle\/to wring\/to hang (by the neck)\/to turn\/to wind\/classifier for skeins of yarn"],"pinyin":["jiao3"],"word":"絞"},{"definition":["plate\/dish\/tray\/board\/hard drive (computing)\/to build\/to coil\/to check\/to examine\/to transfer (property)\/to make over\/classifier for food: dish, helping\/to coil\/classifier for coils of wire\/classifier for games of chess"],"pinyin":["pan2"],"word":"盤"}],"containing_words":[],"sentences":[{"english":"At work, at paying out a cable or winding up a capstan, Jean Valjean was worth four men.","chinese":"服勞役時，扭鐵索，推絞盤，冉阿讓抵得上四個人。"},{"english":"This peg must prevent the winch from unwinding .","chinese":"這木樁一定是用來防止絞盤松開的。"},{"english":"Thanks to Capstan, a restored version will now be released in 2012.","chinese":"到絞盤，恢復版本將在2012年發佈的。"},{"english":"It's an amphibious vehicle, which has a winch and a water cannon.","chinese":"它是一種水路兩棲載具，所以配備有絞盤和水炮。"},{"english":"The question of who would operate the winch, however, was still unresolved.","chinese":"但誰來操縱絞盤的問題還沒有解決。"},{"english":"All planetary winches incorporate a spring applied-hydraulic brake.","chinese":"所有的行星絞盤都有一個彈簧應用液壓制動器。"},{"english":"Capstan imagesetter works such as shown in Figure 2.","chinese":"絞盤式照排機的處事道理如圖2所示。"},{"english":"Winch upgrade, load and a set of dual-reflector system link.","chinese":"有提升絞盤，負載反光鏡和一套雙掛鉤系統。"},{"english":"The pull on the wire is exerted in this area, between the die box and the capstan .","chinese":"拉伸的導線外露在該區域中，在拉模盒和絞盤之間。"},{"english":"The fascia tension could increase by 66% due to windlass mechanism.","chinese":"絞盤機制的作用可以使筋膜的張力增加66%。"},{"english":"Winches are typically used to raise the mainsail and to trim in jib sheets.","chinese":"絞盤通常用來升起主帆，或嵌入前三角帆的帆腳索。"},{"english":"Workers were hauling a loaded train by a winch.","chinese":"工作人員正以絞盤牽引過磅的重車。"},{"english":"Due to the winch recycle design of the disinfecting tube , the operation is very simple.","chinese":"且消毒管採用絞盤式回收，作業便捷。"},{"english":"Remove the hose boudles from the yellow and blue hose reels .","chinese":"從黃蘭絞盤上卸下跨接軟管。"},{"english":"Is there any potential for us to receive an order for the winches?","chinese":"有沒有在我們的任何潛力能接受一份訂單爲絞盤？"}],"related":[]}