{"definition":["to rack one's brains"],"pinyin":["jiao3 jin4 nao3 zhi1"],"simplified":["绞尽脑汁"],"rank":22117.0,"normalized_rank":0.30944552488352245,"fraction":0.0000019396047281144933,"cumulative_fraction":0.9793950281996502,"word":"絞盡腦汁","characters":[{"definition":["to twist (strands into a thread)\/to entangle\/to wring\/to hang (by the neck)\/to turn\/to wind\/classifier for skeins of yarn"],"pinyin":["jiao3"],"word":"絞"},{"definition":["to use up\/to exhaust\/to end\/to finish\/to the utmost\/exhausted\/finished\/to the limit (of sth)\/all\/entirely"],"pinyin":["jin4"],"word":"盡"},{"definition":["brain\/mind\/head\/essence"],"pinyin":["nao3"],"word":"腦"},{"definition":["juice"],"pinyin":["zhi1"],"word":"汁"}],"containing_words":[],"sentences":[{"english":"I think brainbarfing is a more natural way to come up with writing material.","chinese":"我認爲絞盡腦汁是一種採集寫作素材更自然的方法。"},{"english":"B: They have racked their brain.","chinese":"他們可謂絞盡腦汁。"},{"english":"He tussled all night with the figures, but couldn't balance the account.","chinese":"他絞盡腦汁算了一夜也沒把帳算清。"},{"english":"The students there were working hard. They rack their brains tackling difficult scientific problems.","chinese":"學生在那兒苦讀，絞盡腦汁地解決科學難題。"},{"english":"But don't agonize over what to write.","chinese":"但是，不要絞盡腦汁來想到底寫什麼。"},{"english":"Even after racking his brains he couldn't think of a single example.","chinese":"即便絞盡腦汁，他還是連一個例女也念不出來。"},{"english":"Is it worthwhile to cudgel your brains to find a solution to that puzzle on the newspaper?","chinese":"你這樣絞盡腦汁去解決報上的那個智力測驗題值得嗎？"},{"english":"Are you looking for ways to make quick cash?","chinese":"你在爲如何賺快錢而絞盡腦汁？"},{"english":"The scientist has worried at the problem during the last two months.","chinese":"科學工作者在過去的兩個月裏絞盡腦汁攻克難題。"},{"english":"Both directors and performers rack their brains during writing and rehearsals.","chinese":"導演和演員們絞盡腦汁地進行節目的編排。"},{"english":"No guts, but this writing is also racked their brains.","chinese":"沒有膽量，而且寫稿時也是絞盡腦汁。"},{"english":"You are at your wits' end and have begun to dread meal times.","chinese":"你爲此絞盡腦汁並且開始害怕喫飯時間的到來。"},{"english":"She wrack her brains to solve that complicated problem.","chinese":"她絞盡腦汁在想解決這個複雜問題。"},{"english":"He puzzled his brains to find the answer to the physics problem.","chinese":"他絞盡腦汁尋求這道物理題的答案。"},{"english":"Mary was rack her brain for the key to the problem during the exam.","chinese":"馬麗在考試時絞盡腦汁尋找答案。"}],"related":[{"definition":["to neglect sleep and forget about food (idiom)\/to skip one's sleep and meals\/to be completely wrapped up in one's work"],"pinyin":["fei4 qin3 wang4 shi2"],"word":"廢寢忘食"},{"definition":["to rack one's brains (idiom); to take great pains to think sth through"],"pinyin":["fei4 jin4 xin1 si5"],"word":"費盡心思"},{"definition":["to take care of\/to raise money\/to attend to (guests, customers etc)"],"pinyin":["zhang1 luo5"],"word":"張羅"},{"definition":["to bury oneself in work (idiom); to be engrossed in work\/to make an all-out effort\/up to the neck in work"],"pinyin":["mai2 tou2 ku3 gan4"],"word":"埋頭苦幹"},{"definition":["accustomed to\/used to"],"pinyin":["xi2 yi3 wei2 chang2"],"word":"習以為常"},{"definition":["to avoid the important and dwell on the trivial\/to keep silent about major charges while admitting minor ones"],"pinyin":["bi4 zhong4 jiu4 qing1"],"word":"避重就輕"},{"definition":["the rise and fall of the terrain (idiom)\/(fig.) the whole sequence of events\/causes and effects"],"pinyin":["lai2 long2 qu4 mai4"],"word":"來龍去脈"},{"definition":["to be a real headache\/to find sth a real headache\/to beat one's brains"],"pinyin":["shang1 nao3 jin1"],"word":"傷腦筋"},{"definition":["to boast"],"pinyin":["kua1 kou3"],"word":"誇口"},{"definition":["to make a supreme effort\/at all costs"],"pinyin":["ji2 li4"],"word":"極力"},{"definition":["stupefied\/flabbergasted"],"pinyin":["cheng1 mu4 jie2 she2"],"word":"瞠目結舌"},{"definition":["mature reflection\/after careful deliberations"],"pinyin":["shen1 si1 shu2 lu:4"],"word":"深思熟慮"},{"definition":["careless\/reckless\/casually\/absent-mindedly\/at will\/at random\/any old how"],"pinyin":["hu2 luan4"],"word":"胡亂"},{"definition":["different mouths, same voice\/to speak in unison (idiom)"],"pinyin":["yi4 kou3 tong2 sheng1"],"word":"異口同聲"},{"definition":["lit. if it's wrong, it's wrong (idiom); to make the best after a mistake\/to accept an error and adapt to it\/to muddle through"],"pinyin":["jiang1 cuo4 jiu4 cuo4"],"word":"將錯就錯"},{"definition":["lit. to have one's hands bound and be unable to do anything about it (idiom); fig. helpless in the face of a crisis"],"pinyin":["shu4 shou3 wu2 ce4"],"word":"束手無策"}]}