{"definition":["winch\/windlass"],"pinyin":["jiao3 che1"],"simplified":["绞车"],"rank":40441.0,"normalized_rank":0.5658220586795013,"fraction":3.691774183338265e-7,"cumulative_fraction":0.9966550334774792,"word":"絞車","characters":[{"definition":["to twist (strands into a thread)\/to entangle\/to wring\/to hang (by the neck)\/to turn\/to wind\/classifier for skeins of yarn"],"pinyin":["jiao3"],"word":"絞"},{"definition":["car\/vehicle\/CL:輛|辆[liang4]\/machine\/to shape with a lathe\/Kangxi radical 159","surname Che","war chariot (archaic)\/rook (in Chinese chess)\/rook (in chess)"],"pinyin":["Che1","che1","ju1"],"word":"車"}],"containing_words":[],"sentences":[{"english":"Remove the front cover of the drawworks.","chinese":"卸掉絞車前邊的護罩。"},{"english":"The front drawworks guard should be put back in place when the operation is completed.","chinese":"作業結束之後，要儘快把絞車前邊的護罩裝回原處。"},{"english":"The container is winched off the ground.","chinese":"集裝箱被絞車吊起來。"},{"english":"Manually reeve 6 wraps of the 1 inch manila rope onto the drawworks drum.","chinese":"把一寸的棕繩在絞車輥筒上纏六圈。"},{"english":"When all personnel are ready, the driller engages the drawworks in forward drive and starts reeving in the new drilling line.","chinese":"人員都就位後，司鑽啓動絞車正轉，開始纏新大繩。"},{"english":"We had the winch overhauled last year.","chinese":"去年我們對絞車大修過一次。"},{"english":"Remove the front guard cover of the drawworks.","chinese":"卸掉絞車前邊的護罩。"},{"english":"Install the front drawworks guard cover after the mast is raised.","chinese":"井架起來之後，把絞車前邊的護罩裝上。"},{"english":"A hoisting drum is used in the drawworks of a drilling or workover rig.","chinese":"在鑽機或修井作業機的絞車中使用提升滾筒。"},{"english":"The paper introduces the consolidation method and its technical parameters of the underground winch basement in Xieli coalmine.","chinese":"介紹了謝李礦井下絞車基礎的加固方法和技術參數。"},{"english":"The driller also operates the drawworks brake using a long-handled lever.","chinese":"司鑽同樣操作絞車的剎車使用一個長的手柄。"},{"english":"What class of performance do these winches have?","chinese":"這些絞車有哪方面的性能？"},{"english":"Then operate the winch in haul-in direction and then in payout direction\".\"","chinese":"然後操作絞車的收攬和放攬指令。"},{"english":"In the waste dump, the Abstract is linked with the winch working Laoqin drivers turn waste rock.","chinese":"在矸石山下，摘掛工老秦正配合着絞車司機在翻矸石。"},{"english":"Winch motors of No. 1 derrick operational in 30minutes.","chinese":"不，1艙的絞車電機不能工作。"},{"english":"This allows you to use the Winches here.","chinese":"這可以讓你用絞車在這裏。"}],"related":[]}