{"definition":["to give\/to grant"],"pinyin":["gei3 yi3"],"simplified":["给以"],"rank":23381.0,"normalized_rank":0.327130524813566,"fraction":0.0000017204923101947326,"cumulative_fraction":0.9817047065027508,"word":"給以","characters":[{"definition":["to supply\/to provide","to\/for\/for the benefit of\/to give\/to allow\/to do sth (for sb)\/(grammatical equivalent of 被)\/(grammatical equivalent of 把)\/(sentence intensifier)"],"pinyin":["gei3","ji3"],"word":"給"},{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"}],"containing_words":[],"sentences":[{"english":"This article on shiitake mushroom's cultivation management, the recovery processing gives the introduction.","chinese":"本文就香菇的栽培管理，採收加工給以介紹。"},{"english":"Hope to show them to help deal with the vampire.","chinese":"希望顯祖給以協助對付吸血鬼。"},{"english":"One non-exercise group received quercetin while the other did not.","chinese":"其中一組被給以槲皮素餵養，而另一組沒有。"},{"english":"The love and care you have given us will encourage us to go through a long and arduous journey.","chinese":"您給以我們的愛和眷注將激昂着我們走過艱鉅困苦。"},{"english":"Treatment with iron usually Brings quick improvement.","chinese":"給以鐵劑治療可使症狀迅速改善。"},{"english":"Give it time, it will melt.","chinese":"給以時間，冰會融成水。"},{"english":"This will be based on the study of.","chinese":"本文將結合本人研究的課題《壇經》給以佐證。"},{"english":"Thank you for giving us this singular privilege of being part of this commencement ceremony.","chinese":"感謝你們給以我們加入此次結業典禮的殊榮。"},{"english":"Oils fuels the skin's natural hydration and healing process in the dermis layer of skin where stretch marks form.","chinese":"油可以給以皮膚自然的水份和癒合真皮層的受孕紋。"},{"english":"The actor needed to be prompted frequently.","chinese":"那演員需要經常給以提詞。"},{"english":"It had dawned upon me that I have never placed a proper valuation upon womankind .","chinese":"我這才覺得，我一向不曾對女性給以應有的估價。"},{"english":"This essay tries to give an objective comment on this issue.","chinese":"本文試圖對這一切給以客觀的申說。"},{"english":"Your foot, meanwhile, may not be giving you the stability you need.","chinese":"同時你的腳也可能沒有給以足夠穩定的支撐。"},{"english":"Or if that isn't allowed under their guidelines, campaign for a no-fee policy.","chinese":"或者，你可以問一下圖書館員工，給以幫助的途徑。"},{"english":"Prayer gives us hope and changes our outlook in life.","chinese":"禱告給以我們但願，變化我們的人生不美觀。"},{"english":"In this essay the Ampere Circuital Theorem is accurately illustrated and detailed exact demonstration is made upon it.","chinese":"本文對安培環路定理給以準確的說明和詳細的論證。"}],"related":[]}