{"definition":["to state in advance\/preset\/given"],"pinyin":["gei3 ding4"],"simplified":["给定"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"給定","characters":[{"definition":["to supply\/to provide","to\/for\/for the benefit of\/to give\/to allow\/to do sth (for sb)\/(grammatical equivalent of 被)\/(grammatical equivalent of 把)\/(sentence intensifier)"],"pinyin":["gei3","ji3"],"word":"給"},{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"}],"containing_words":[],"sentences":[{"english":"With any given project there are stages of development and test.","chinese":"在任何給定的項目中，都有不同的開發和測試階段。"},{"english":"To the grammar which assigns eliminates the left recursion.","chinese":"對給定的文法消除左遞歸。"},{"english":"Let's say that I give you the vector field with components yz, xz and xy.","chinese":"給定一個向量場。"},{"english":"The return value designates the slices on which the given query will be executed.","chinese":"返回值會指定給定查詢將要在其上執行的那些片。"},{"english":"Get an interpolated normal at a given location.","chinese":"獲取在給定位置的插值法線。"},{"english":"The non-complete characteristics of the test wave as well as the wave reset of the given signal are discussed.","chinese":"探討了檢測波形的非完整性以及給定信號的波形設定。"},{"english":"Given a positive odd number n, the output magic squares of order n.","chinese":"給定一個正奇數n，輸出n階幻方。"},{"english":"Predictions should be arranged by their order in the test set.","chinese":"預測結果需要按照測試集中給定的順序排列。"},{"english":"Returns a nonzero value if the given list is empty.","chinese":"如果給定鏈表爲空，則返回非零值。"},{"english":"Often, these conditions are rarely true for any given object.","chinese":"對於任何給定對象，這些條件通常很少爲真。"},{"english":"Teleports a specified bot to a given coordinate.","chinese":"傳送指定的機器人到給定的座標。"},{"english":"You can also apply all fixes that are applicable for a given virtual system.","chinese":"還可以應用適合某個給定虛擬系統的所有補丁。"},{"english":"Further, the paper expounds the judicious method used to determine errors of right-angle prism.","chinese":"進而闡明瞭直角棱鏡誤差給定的合理方法。"},{"english":"A collection of documents on a given subject.","chinese":"某一給定題目的資料集。"},{"english":"Uninstalls the assembly from the given application.","chinese":"從給定應用程序卸載程序集。"},{"english":"Because class names are constants, you can have only one class of a given name.","chinese":"因爲類名稱是常量，所以您只能有一個給定名稱的類。"}],"related":[]}