{"definition":["united front"],"pinyin":["tong3 yi1 zhan4 xian4"],"simplified":["统一战线"],"rank":14055.0,"normalized_rank":0.196647685139843,"fraction":0.0000046253011071203205,"cumulative_fraction":0.954894231915564,"word":"統一戰線","characters":[{"definition":["to gather\/to unite\/to unify\/whole"],"pinyin":["tong3"],"word":"統"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to fight\/fight\/war\/battle"],"pinyin":["zhan4"],"word":"戰"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"}],"containing_words":[{"definition":["United Front Work Department of CCP Central Committee (UFWD)"],"pinyin":["Tong3 yi1 Zhan4 xian4 Gong1 zuo4 bu4"],"word":"統一戰線工作部"}],"sentences":[{"english":"Recently, I was called to the Religious Affairs Bureau and the United Front Work Department.","chinese":"最近我被國家宗教事務局和統一戰線工作部傳喚。"},{"english":"All Party comrades must strive to consolidate and develop this united front.","chinese":"全黨同志必須爲這個統一戰線的鞏固和發展而奮鬥。"},{"english":"They form the progressive section of the anti-Japanese united front.","chinese":"他們是抗日統一戰線中的進步派。"},{"english":"The theory of the united front is developing in different historic periods.","chinese":"統一戰線理論在不同的歷史時期不斷被豐富和發展。"},{"english":"At one time, he joined a United Front government in Shansi.","chinese":"他曾一度參加過山西某縣的統一戰線政府。"},{"english":"We should integrate the united front into the state system, and identify its constitution status.","chinese":"應當將統一戰線納入國體範疇，從而明確其憲法地位。"},{"english":"The work of the United Front has always been serving the party's general line and construction.","chinese":"統一戰線工作歷來是爲黨的總路線建設和服務的。"},{"english":"The organs of political power of the anti- Japanese united front must be elected by the people.","chinese":"抗日統一戰線政權的產生，應經過人民選舉。"},{"english":"Second, the controversy persons had a theoretic exploration to the cultural united front.","chinese":"其次，論爭對文化統一戰線進行了理論探索。"},{"english":"Otherwise co-operation will turn into amalgamation and the united front will inevitably be sacrificed.","chinese":"否則就是將合作變成了混一，必然犧牲統一戰線。"},{"english":"The parties of the leave have forme a common front to fight the force of reaction.","chinese":"政黨的左翼組成與反動勢力鬥爭的統一戰線。"},{"english":"The United Front and the CPC's administrative competence are complementarily correlative.","chinese":"統一戰線與黨的執政能力密切相連，相互促進。"},{"english":"They form the middle section of the anti-Japanese united front.","chinese":"他們是抗日統一戰線中的中間派。"},{"english":"United-front work of a is the basis of our Party's united-front work.","chinese":"縣級統戰工作是我們黨統一戰線工作的基礎。"},{"english":"And it is the form which a constitutional government of the anti-Japanese united front should take.","chinese":"這樣的憲政也就是抗日統一戰線的憲政。"},{"english":"The research of present united front has great theoretical and practical significance.","chinese":"研究現階段統一戰線具有重大的理論意義和現實意義。"}],"related":[{"definition":["student movement"],"pinyin":["xue2 sheng5 yun4 dong4"],"word":"學生運動"},{"definition":["United Front (either of the two alliances between the Guomindang and the Communist Party, 1923-1927 and 1937-1945)"],"pinyin":["Guo2 Gong4 He2 zuo4"],"word":"國共合作"},{"definition":["democracy"],"pinyin":["min2 zhu3 zhu3 yi4"],"word":"民主主義"},{"definition":["Autumn Harvest Uprising (1927), insurrection in Hunan and Jiangxi provinces led by Mao Zedong"],"pinyin":["Qiu1 shou1 Qi3 yi4"],"word":"秋收起義"},{"definition":["fascism"],"pinyin":["fa3 xi1 si1 zhu3 yi4"],"word":"法西斯主義"},{"definition":["armed force"],"pinyin":["wu3 zhuang1 li4 liang4"],"word":"武裝力量"},{"definition":["the Mukden or Manchurian Railway Incident of 18th September 1931 used by the Japanese as a pretext to annex Manchuria\/also known as Liutiaogou incident 柳條溝事變|柳条沟事变"],"pinyin":["Jiu3 Yi1 ba1 Shi4 bian4"],"word":"九一八事變"},{"definition":["Zhang Guotao (1897-1979), Chinese communist leader in the 1920s and 1930s, defected to Guomindang in 1938"],"pinyin":["Zhang1 Guo2 tao1"],"word":"張國燾"},{"definition":["Zunyi conference of January 1935 before the Long March"],"pinyin":["Zun1 yi4 hui4 yi4"],"word":"遵義會議"},{"definition":["Sino-Japanese relations"],"pinyin":["Zhong1 Ri4 guan1 xi4"],"word":"中日關係"},{"definition":["guerrilla warfare"],"pinyin":["you2 ji1 zhan4"],"word":"遊擊戰"},{"definition":["disarmament"],"pinyin":["cai2 jun1"],"word":"裁軍"},{"definition":["pro-U.S."],"pinyin":["qin1 Mei3"],"word":"親美"},{"definition":["Mao Zedong Thought\/Maoism"],"pinyin":["Mao2 Ze2 dong1 Si1 xiang3"],"word":"毛澤東思想"},{"definition":["to plan\/to arrange"],"pinyin":["bo4 hua4"],"word":"擘劃"},{"definition":["principle of people's livelihood, the third of Dr Sun Yat-sen's 孫中山|孙中山 Three Principles of the People 三民主義|三民主义 (at the time, meaning redistribution of wealth, self-sufficiency and internal trade)"],"pinyin":["min2 sheng1 zhu3 yi4"],"word":"民生主義"}]}