{"definition":["to be collectively called\/collective term\/general designation"],"pinyin":["tong3 cheng1"],"simplified":["统称"],"rank":21171.0,"normalized_rank":0.29620975753081585,"fraction":0.000002119157209154669,"cumulative_fraction":0.9774757975689168,"word":"統稱","characters":[{"definition":["to gather\/to unite\/to unify\/whole"],"pinyin":["tong3"],"word":"統"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"}],"containing_words":[{"definition":["collectively known as\/to call sth as a group"],"pinyin":["tong3 cheng1 wei2"],"word":"統稱為"}],"sentences":[{"english":"Research exceeds a general designation of science and technology below cold condition this kind to learn for microtherm .","chinese":"探究這種超冷狀態下的科學技術統稱爲低溫學。"},{"english":"The MOFTEC or the SETC is hereinafter uniformly referred to as the investigation organ.","chinese":"外經貿部和國家經貿委，以下統稱調查機關。"},{"english":"Diabetes mellitus is a group of diseases characterized by high levels of blood sugar.","chinese":"“糖尿病”是一類表現爲高血糖的病症的統稱。"},{"english":"A word that serves as a catchall for a bewildering array of computer accessories.","chinese":"一個可作爲混雜排列的計算機附件的統稱詞。"},{"english":"Yanshan eight sceneries\" is the general designation of eight scenic spots of Beijing.\"","chinese":"燕山八景是北京的八處風景名勝的統稱。"},{"english":"Any of about 100 species of small, slender freshwater fishes (family Percidae), native to eastern North America.","chinese":"鱸形目鱸科鏢鱸亞科約一百種小型細長淡水魚的統稱。"},{"english":"Hydrofining is a process of various oil products upgrading under hydrogen pressure.","chinese":"加氫精制是各種油品在氫壓下進行催化改質的統稱。"},{"english":"The Chinese police and administration is the general designation of the police and government affairs.","chinese":"警政是對有關警察的國家和政府事務的統稱。"},{"english":"These are called as mala - the waste, which need to be excreted.","chinese":"這些東西統稱爲身體垃圾，是必須要被排泄掉的。"},{"english":"Any of several large North or Central American fishes of the genus Lepisosteus.","chinese":"雀鱔科雀鱔屬的大型魚類的統稱，產於北美或中美。"},{"english":"This chapter is a catchall for all open items that were not performed in previous chapters.","chinese":"本章是在以前的章節統稱爲所有打開的項目進行了不。"},{"english":"The bouquet and aroma of a wine.","chinese":"葡萄酒中酒香和果香的統稱。"},{"english":"In our country and cabernet sauvignon, cabernet franc gernischt, collectively known as it.","chinese":"在我國與赤霞珠，蛇龍珠，品麗珠統稱爲解百納。"},{"english":"Official documents generally can be called amanuensis materials or files.","chinese":"公文又統稱文書材料，或稱文件。"},{"english":"The principal muscles involved in hip flexion are the psoas and the iliacus, collectively known as the iliopsoas .","chinese":"主要涉及肌肉，在髖關節屈曲的腰肌和髂，統稱爲髂。"},{"english":"The Han-style clothes are a tradition with different style in different period.","chinese":"漢服是個統稱，不同時期有不同的風格。"}],"related":[{"definition":["called\/to call sth (by a name)\/to name"],"pinyin":["cheng1 wei2"],"word":"稱為"},{"definition":["also known as"],"pinyin":["you4 cheng1"],"word":"又稱"},{"definition":["commonly referred to as\/common term"],"pinyin":["su2 cheng1"],"word":"俗稱"},{"definition":["to be abbreviated to\/abbreviation\/short form"],"pinyin":["jian3 cheng1"],"word":"簡稱"},{"definition":["to divide sth into (parts)\/to subdivide"],"pinyin":["fen1 wei2"],"word":"分為"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"},{"definition":["name (of a thing)\/name (of an organization)"],"pinyin":["ming2 cheng1"],"word":"名稱"},{"definition":["same type\/category 1 (i.e. class A)"],"pinyin":["yi1 lei4"],"word":"一類"},{"definition":["to belong to (a category)\/to be attached to"],"pinyin":["li4 shu3"],"word":"隸屬"},{"definition":["so-called\/what is called"],"pinyin":["suo3 wei4"],"word":"所謂"},{"definition":["commonly seen\/common\/to see sth frequently"],"pinyin":["chang2 jian4"],"word":"常見"},{"definition":["kind\/type\/class\/category\/similar\/like\/to resemble"],"pinyin":["lei4"],"word":"類"},{"definition":["common term\/general term"],"pinyin":["he2 cheng1"],"word":"合稱"},{"definition":["to view as\/to see as\/to consider to be\/to deem"],"pinyin":["shi4 wei2"],"word":"視為"},{"definition":["person (first person, second person etc in grammar)\/called\/known as"],"pinyin":["ren2 cheng1"],"word":"人稱"},{"definition":["to differentiate\/to draw a distinction\/to divide into categories"],"pinyin":["qu1 fen1"],"word":"區分"}]}