{"definition":["to fasten\/to bind"],"pinyin":["bang3 zhu4"],"simplified":["绑住"],"rank":32319.0,"normalized_rank":0.4521847410910414,"fraction":7.671124291594534e-7,"cumulative_fraction":0.9922172712873636,"word":"綁住","characters":[{"definition":["to tie\/bind or fasten together\/to kidnap"],"pinyin":["bang3"],"word":"綁"},{"definition":["to live\/to dwell\/to stay\/to reside\/to stop\/(suffix indicating firmness, steadiness, or coming to a halt)"],"pinyin":["zhu4"],"word":"住"}],"containing_words":[],"sentences":[{"english":"Two arms strech out naturally, even with one rope connecting two hands.","chinese":"用一根繩子綁住兩隻手，雙臂依然能夠展開。"},{"english":"The images of women barefoot on the street, handcuffed and tied to a rope, enraged internet users.","chinese":"被繩子綁住的婦女赤腳走在街上的畫面激怒了網民。"},{"english":"Xu felt that she had tied Liu down and repeatedly asked him, 'Are you regretful?","chinese":"徐認爲，她綁住劉下來，反覆問他，你是否有後悔？"},{"english":"Huo Yuanjia went out looking for Wang Zhilan, found that Yuan Hao was tied.","chinese":"霍元甲外出找王芷蘭時，發現袁浩被人綁住。"},{"english":"But don't let the myths hold you back.","chinese":"但是不要讓不真實的傳言綁住你的想法。"},{"english":"He ordered his pilots to employ their harpoons and tow cables to ensnare the walkers' legs.","chinese":"他命令屬下的飛行員用魚叉和拖纜綁住步行機的長腿。"},{"english":"We are tied down by fuel.","chinese":"我們被燃料死死地綁住了。"},{"english":"Sometimes we get so caught up in our lives that we forget to go out and enjoy the planet.","chinese":"有時候我們被生活綁住了，忘了走出來享受這個星球。"},{"english":"One could say, the wife and kids tie him down.","chinese":"有人可能會說，妻子和孩子綁住了他。"},{"english":"The only reasonable explanation is long-term bondage .","chinese":"唯一適合的解釋是她曾被長時間綁住。"},{"english":"He tied ropes around it and tried to drag it.","chinese":"他又試着用繩子綁住金子想拖着走。"},{"english":"Ye Lingqing had to tie him first.","chinese":"葉凌青只得先綁住他。"},{"english":"Tided myself to a man who was terrified of being tied down.","chinese":"將自己綁在一個特別害怕被綁住的男人身上。"},{"english":"The horse has been hobbled so that he can not run away.","chinese":"那馬的腳被綁住了，所以它無法逃走。"},{"english":"I got off and immediately tied one of his front legs up .","chinese":"我火大了，乾脆直接立刻用繩子綁住它的一隻前腳。"}],"related":[{"definition":["indecisive\/wavering"],"pinyin":["yao2 bai3 bu4 ding4"],"word":"搖擺不定"},{"definition":["to come to blows\/to paw\/to grope\/to get fresh"],"pinyin":["dong4 shou3 dong4 jiao3"],"word":"動手動腳"},{"definition":["to submit to humiliation (idiom); to suffer in silence\/to swallow one's anger\/to grin and bear it"],"pinyin":["ren3 qi4 tun1 sheng1"],"word":"忍氣吞聲"},{"definition":["to mix\/to blend\/(fig.) to spoil\/to mess up things\/to run around with (sb)\/to get involved with\/to mix (with other people)"],"pinyin":["jiao3 huo5"],"word":"攪和"},{"definition":["bored\/fed up with sth\/sick of sth"],"pinyin":["yan4 fan2"],"word":"厭煩"},{"definition":["to question intensely\/to interrogate\/to demand information"],"pinyin":["bi1 wen4"],"word":"逼問"},{"definition":["to press down\/to crush down\/to restrain (anger)\/to keep down (voice)"],"pinyin":["ya1 zhu4"],"word":"壓住"},{"definition":["sneering\/sarcasm\/cynical remarks"],"pinyin":["feng1 liang2 hua4"],"word":"風涼話"},{"definition":["to ask for trouble\/to invite difficulties"],"pinyin":["zi4 zhao3 ma2 fan5"],"word":"自找麻煩"},{"definition":["change of affection, shift of love (idiom); to change one's feelings to another love\/to fall in love with sb else"],"pinyin":["yi2 qing2 bie2 lian4"],"word":"移情別戀"},{"definition":["to obstinately persist in going about things the wrong way (idiom)"],"pinyin":["zhi2 mi2 bu4 wu4"],"word":"執迷不悟"},{"definition":["lit. lotus roots may break, but the fiber remains joined (idiom); lovers part, but still long for one another"],"pinyin":["ou3 duan4 si1 lian2"],"word":"藕斷絲連"},{"definition":["to throw off\/to struggle free of\/Taiwan pr. [zheng1 tuo1]"],"pinyin":["zheng4 tuo1"],"word":"掙脫"},{"definition":["to incite disharmony\/to instigate"],"pinyin":["tiao3 bo1"],"word":"挑撥"},{"definition":["covered all over with cuts and bruises\/beaten black and blue\/be a mass of bruises"],"pinyin":["bian4 ti3 lin2 shang1"],"word":"遍體鱗傷"},{"definition":["to deceive\/to cheat"],"pinyin":["hong3 pian4"],"word":"哄騙"}]}