{"definition":["long-lasting\/durable"],"pinyin":["jing1 jiu3"],"simplified":["经久"],"rank":25168.0,"normalized_rank":0.3521329732906132,"fraction":0.0000014559808503209117,"cumulative_fraction":0.9845375204479091,"word":"經久","characters":[{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["Jing1","jing1"],"word":"經"},{"definition":["(long) time\/(long) duration of time"],"pinyin":["jiu3"],"word":"久"}],"containing_words":[{"definition":["unfailing\/never-ending"],"pinyin":["jing1 jiu3 bu4 shuai1"],"word":"經久不衰"}],"sentences":[{"english":"Electroplated copper shell can be used for many years.","chinese":"電鍍全銅殼經久耐用。"},{"english":"Durable, adopting auto painting process of imported car.","chinese":"採用進口轎車噴漆工藝，經久耐用。"},{"english":"There was prolonged applause when he began to speak.","chinese":"他開始講話時響起了經久不息的掌聲。"},{"english":"Third, set off firecrackers and the customs temporary enduring a tradition.","chinese":"第三，放鞭炮也是我國習俗傍邊經久不衰的一項傳統。"},{"english":"And that's a perennial issue in philosophy.","chinese":"這在哲學上也是一個經久不衰的問題。"},{"english":"But now, your comedy can live on forever.","chinese":"但是現在，你的喜劇能夠經久不衰。"},{"english":"Celanese's pure acrylic emulsions are the foundation for durable exterior paints.","chinese":"塞拉尼斯純丙烯酸乳液是外牆塗料經久耐用的基礎。"},{"english":"High speed high efficiency. Easy to operate, long-service and endurance.","chinese":"高速度，高效率，操作簡便，經久耐用。"},{"english":"Temples and statues decay, but books survieve.","chinese":"寺廟會倒坍，神像會朽爛，而書卻經久長存。"},{"english":"A good shingle roof is a most durable type of roof.","chinese":"用優質木瓦蓋的屋頂是一種經久耐用的屋頂。"},{"english":"It is not difficult to find the reasons for their enduring appeal.","chinese":"找到其吸引力能經久不衰的原因並不難。"},{"english":"This is because these are more affordable and some are even more durable.","chinese":"這是因爲他們更加的價廉物美，更加經久耐用。"},{"english":"Increase productivity with speedy relocation. Two castors and two wheels for easily move.","chinese":"外形簡單大方，經久耐用，兩個腳輪，可方便地移動。"},{"english":"It has been one of the most enduring genres in the business.","chinese":"這是影視業中最經久不衰的類型之一。"},{"english":"When he got up to reply there was long applause.","chinese":"他站起來回答時，響起經久不息的掌聲。"},{"english":"Airlines recommend hard-sided cases for durability.","chinese":"航空公司推薦使用硬邊箱，因其經久耐用。"}],"related":[]}