{"definition":["to undergo (hardship)\/to endure\/to withstand"],"pinyin":["jing1 shou4"],"simplified":["经受"],"rank":9231.0,"normalized_rank":0.12915366641948708,"fraction":0.000009464751392847097,"cumulative_fraction":0.92290570551413,"word":"經受","characters":[{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["Jing1","jing1"],"word":"經"},{"definition":["to receive\/to accept\/to suffer\/subjected to\/to bear\/to stand\/pleasant\/(passive marker)"],"pinyin":["shou4"],"word":"受"}],"containing_words":[],"sentences":[{"english":"China-ASEAN relations have withstood the test of crises and disasters.","chinese":"中國和東盟的關係經受住了風雨災禍的考驗。"},{"english":"You can live through anything for a year, I figured.","chinese":"我覺得，人可以經受住任何事情在一年的時間裏。"},{"english":"You have to have success and failure.","chinese":"你必須經受成功與失敗的體驗。"},{"english":"Therefore, Q1 must withstand a gate-to-source voltage higher than this value.","chinese":"因此，Q1必須經受門源極電壓高於這個值。"},{"english":"Many small firms did not weather the storm of the recession.","chinese":"許多小公司沒能經受住這次經濟衰退的風波。"},{"english":"The resolve of our nation is still being tested.","chinese":"我國的決心仍在經受考驗。"},{"english":"Those who climb the Western Steps experience a more rugged climb.","chinese":"而選擇攀登西面梯道，則要經受崎嶇不平的梯級。"},{"english":"No benefactions can make up for the change in character the city has suffered.","chinese":"捐款決不能彌補城市所經受的性質上的變化。"},{"english":"Naturally, faint-hearted investors failed the test.","chinese":"當然，那些膽怯的投資者未能經受住市場的考驗。"},{"english":"A-form pylons are designed to withstand earthquake forces .","chinese":"型框架式塔架設計中考慮塔架能夠經受地震力的作用。"},{"english":"Abraham's faith withstands many a trial.","chinese":"亞伯拉罕的信仰經受了多重考驗。"},{"english":"Here are five timeless management laws that have stood the test of time.","chinese":"這裏是能經受時間考研的五條永恆的管理法則。"},{"english":"We've suffered an agonising seven years which has ruined the lives and health of my family.","chinese":"我們已經經受了家人生命和健康逝去的痛苦的七年。"},{"english":"The flowers bud will weather the attacks from cold wind and rain, making it way blossom into the fair spring.","chinese":"讓含苞的花蕾經受住寒風冷雨，綻放在明媚的春天。"},{"english":"He'd tolerated two rounds of chemo, the central line catheters and bone marrow biopsies.","chinese":"他已經經受了兩輪的化療。"},{"english":"Fluffy cotton candy, who survive the sweet taste.","chinese":"蓬鬆的棉花糖，誰經受得住那香甜的滋味。"}],"related":[]}