{"definition":["Organization for Economic Cooperation and Development (OECD)\/abbr. for 經濟合作與發展組織|经济合作与发展组织"],"pinyin":["Jing1 He2"],"simplified":["经合"],"rank":37013.0,"normalized_rank":0.5178598911477061,"fraction":5.062504099571807e-7,"cumulative_fraction":0.99516440980066,"word":"經合","characters":[{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["Jing1","jing1"],"word":"經"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"}],"containing_words":[{"definition":["Organization for Economic Cooperation and Development, OECD\/abbr. for 經濟合作與發展組織|经济合作与发展组织"],"pinyin":["Jing1 He2 Zu3 zhi1"],"word":"經合組織"},{"definition":["APEC (Asia Pacific economic cooperation)"],"pinyin":["Ya4 Tai4 jing1 he2 hui4"],"word":"亞太經合會"},{"definition":["APEC (organization)"],"pinyin":["Ya4 Tai4 Jing1 He2 Zu3 zhi1"],"word":"亞太經合組織"}],"sentences":[{"english":"But the OECD figure is quite different to the official Chinese figures.","chinese":"但是經合組織的數字與中國官方的統計數據迥異。"},{"english":"The organisation has now broken out numbers on wireless broadband subscriptions.","chinese":"目前經合組織統計出了無線寬帶用戶的數量。"},{"english":"Regional organizations such as APEC have already shown considerable progress in these areas.","chinese":"亞太經合組織等地區組織已在這些領域取得可觀進展。"},{"english":"He also chaired the editorial board of OECD Economic Studies.","chinese":"他同時擔任“經合組織經濟學研究”編委會主席。"},{"english":"U.S. President George Bush is in Peru for his final Pacific Rim summit.","chinese":"美國總統布什前往祕魯出席亞太經合組織高峯會。"},{"english":"E. C. D. countries that the number of nurses is too small toresponserespond to the demand.","chinese":"大多數經合組織成員國擔心護士短缺無法滿足需求。"},{"english":"The Chinese Statistical Bureau provides data more easily than the OECD.","chinese":"中國國家統計局比經合組織更容易提供數據。"},{"english":"There are concerns in most O. E. C. D. countries that the number of nurses is too small to respond to the demand.","chinese":"大多數經合組織成員國擔心護士太少會無法滿足需求。"},{"english":"The transfer of one partys share in the registered capital shall be effected only with the consent of the other parties to the venture.","chinese":"合營者的註冊資本如果轉讓必須經合營各方同意。"},{"english":"A representative for the Mainland Affairs Council said that the CSECC will meet twice a year.","chinese":"陸委會代表表示兩岸經合會每年將召開兩次會議。"},{"english":"Thomas Liebig is the an economist in at the OECD.","chinese":"托馬斯李比希是經合組織的一名經濟學家。"},{"english":"The 30-nation OECD brings together nations committed to democracy and a free-market economy.","chinese":"經合組織由致力於民主和自由市場經濟的30國組成。"},{"english":"By contrast, Asian OECD countries Japan and South Korea are the leanest.","chinese":"相比之下，經合組織的亞洲成員國日本和韓國最瘦。"},{"english":"Here's the OECD's graph of Gini coefficients by country.","chinese":"下圖是經合組織按照國家排序的基尼係數。"}],"related":[]}