{"definition":["to be able to withstand\/to be able to endure"],"pinyin":["jing1 de5 qi3"],"simplified":["经得起"],"rank":18152.0,"normalized_rank":0.2539700306409413,"fraction":0.000002894736340672115,"cumulative_fraction":0.9699654761000118,"word":"經得起","characters":[{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["Jing1","jing1"],"word":"經"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"Accepted and run, let love stand the fleeting time.","chinese":"接納與磨合，讓愛經得起流年。"},{"english":"Haba toys are a great choice that will stand the test of time.","chinese":"哈巴玩具是一個不錯的選擇，經得起時間的考驗。"},{"english":"A name is like a boat which stands the strong wind and striking wave in the sea.","chinese":"名字的含義是像小船一樣在大海里經得起風吹浪打。"},{"english":"Will your tax statement stand up to detailed examination?","chinese":"你的有關稅收的報告經得起詳細審查嗎？"},{"english":"I believe it will stand the test of time.","chinese":"我相信這份報告會經得起時間考驗。"},{"english":"But would such a sleight of hand really stand up to legal scrutiny in the aftermath of Armageddon?","chinese":"但這種戲法真的經得起末日審判的法律審查嗎？"},{"english":"Practice has proven that the bilateral relations have withstood the tests of time.","chinese":"實踐證明中塞黑關係是經得起時間考驗的。"},{"english":"A accumulated backbone of a archful of animal hair is able of acknowledging a counterbalancet agnate to that of 99 humans.","chinese":"滿頭頭髮合在一起的力氣可經得起99個人的分量。"},{"english":"Turth is the daughter of time.","chinese":"真理經得起時間的考驗。"},{"english":"Her claim can bear close examination.","chinese":"她的要求經得起仔細檢查。"},{"english":"The packing must be able to withstand rough handling.","chinese":"包裝必須經得起野蠻搬運。"},{"english":"Its four-dimensional beauty can stand up0 time.","chinese":"建築的美是四維的，他能經得起時間的磨移。"},{"english":"Children’s furniture must withstand kicks and blows.","chinese":"孩子用的傢俱必須經得起拳打腳踢。"},{"english":"Metal can bear beating with a hammer, which a stone can't.","chinese":"金屬能經得起錘子的敲打，但石頭卻不行。"},{"english":"Cars and girls go perfectly well together, it is tested by time.","chinese":"香車美女的絕配，是經得起時間的考驗的。"},{"english":"WHO can withstand this scrutiny.","chinese":"世衛組織經得起這一審查。"}],"related":[]}