{"definition":["theodolite"],"pinyin":["jing1 wei3 yi2"],"simplified":["经纬仪"],"rank":56030.0,"normalized_rank":0.7839323940509003,"fraction":7.225892529665643e-8,"cumulative_fraction":0.9995923733885534,"word":"經緯儀","characters":[{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["Jing1","jing1"],"word":"經"},{"definition":["latitude\/woof (horizontal thread in weaving)\/weft"],"pinyin":["wei3"],"word":"緯"},{"definition":["apparatus\/rites\/appearance\/present\/ceremony"],"pinyin":["yi2"],"word":"儀"}],"containing_words":[],"sentences":[{"english":"This method is also suitable for the theodolite with a contract index level.","chinese":"這個方法也適合於一般具有豎盤符合水準器的經緯儀。"},{"english":"Geodetic theodolites generally have circles of about 140mm diameter.","chinese":"大地經緯儀的度盤直徑一般爲140毫米。"},{"english":"The optical theodolite can be used in measuring the shape and position of a super - big workpiece.","chinese":"用光學經緯儀可以對超大工件的形狀和位置進行檢測。"},{"english":"Dynamic angle measuring system has been employed in electronic theodolites.","chinese":"電子經緯儀採用了動態測角系統。"},{"english":"The methods of optical-eletronic theodolite calibration in the range were studied.","chinese":"對光電經緯儀外場星校方法進行了研究。"},{"english":"It is used for mfg. transit to raise precision and lower cost.","chinese":"用於製造經緯儀等設備以提高精度減少成本。"},{"english":"When you see a planet by a transit, the orbit has to be in your line of sight.","chinese":"當你通過經緯儀看到行星，其軌道應該在你的視線中。"},{"english":"The Theodolite Main Controller is the relay center of communications between theodolites and central computers.","chinese":"經緯儀主控器是經緯儀與中心機的通信樞紐。"},{"english":"The Theodolite Main Controller is the relay center of communications between theodolites and central computers.","chinese":"經緯儀主控器是經緯儀與中心機的通信樞紐。"},{"english":"The traditional metrological verification instrument for theodolite has many disadvantages.","chinese":"傳統的經緯儀計量檢測設備存在諸多缺點。"},{"english":"The FOG north-finder and laser collimation theodolite are assembled to achieve orientation and aiming integral.","chinese":"提出了光纖陀螺尋北儀與準直經緯儀結構一體化方案。"}],"related":[]}