{"definition":["energy channels\/meridian (TCM)\/(dialect) trick\/tactic"],"pinyin":["jing1 luo4"],"simplified":["经络"],"rank":31393.0,"normalized_rank":0.43922879968659495,"fraction":8.329483388741848e-7,"cumulative_fraction":0.9914766429951348,"word":"經絡","characters":[{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["Jing1","jing1"],"word":"經"},{"definition":["net-like object\/to hold sth in place with a net\/to wind\/to twist\/(TCM) channels in the human body","small net"],"pinyin":["lao4","luo4"],"word":"絡"}],"containing_words":[],"sentences":[{"english":"The magnetic line can be extended to the channels and collaterals acupoints of people's vola.","chinese":"更將磁力線延伸到人們足底的經絡穴位。"},{"english":"The light will move through the meridians and cells allowing for the act of regeneration.","chinese":"光將會通過經絡和細胞運作，從而允許再生行爲發生。"},{"english":"Qi and blood in the body are the material basis for the physiological activities of the zang-fu and meridians.","chinese":"人體氣血是臟腑經絡生理活動的物質基礎。"},{"english":"How did people discover the invisible “jingluo” in human body?","chinese":"人們是怎麼發現人體中那無形的“經絡”的呢？"},{"english":"The basis of acupuncture is the theory of meridians and acupoints.","chinese":"鍼灸的理論基礎就是經絡腧穴理論。"},{"english":"There was meridian theoretical basis kidney protecting foetus.","chinese":"腎固胞胎也有其經絡理論基礎。"},{"english":"Be familiar with physiological functions and pathological changes of meridians and collaterals.","chinese":"熟悉經絡的生理功能，病理變化。"},{"english":"The large intestine has close relationship with the brain through body fluid and meridians and collaterals in TCM.","chinese":"在生理上中醫認爲大腸與腦通過津液和經絡密切相聯。"},{"english":"Clinical general the stroke divides into the internal organs and the channels and collaterals, but dialectical treats.","chinese":"臨牀上將中風分爲中臟腑和中經絡而辨證施治。"},{"english":"ObjectiveTo investigate the structure of micro vessel in Houhai point and its relationship with meridians and collaterals.","chinese":"目的探索穴區內微血管構築及與經絡腧穴的關係。"},{"english":"Our specialist offers traditional Chinese massage to relax your channels and collaterals.","chinese":"專家門診，傳統手法推拿，按摩，舒展經絡。"},{"english":"Results This theory is used for meridian diagnosis and acupoint selection with the best therapeutic effects.","chinese":"結果該理論運用於經絡診斷和取穴治療效果甚佳。"},{"english":"The New York stock exchange is the world biggest stock market.","chinese":"對於交易所證券市場的經絡，那她更是“淵源有自”。"},{"english":"This study provided a data to clarify the essence of meridian and the mechanism of referred pain.","chinese":"爲闡明經絡生理實質及牽涉痛機理提供了可靠的證據。"},{"english":"Asking about locality of the pain helps understand pathological changes of internal organs and meridians;","chinese":"問疼痛的部位可以幫助瞭解臟腑經絡的病理改變。"},{"english":"Western medicine thinks all-diseases can be refll cted in the abnormality of bioelectricity ofaody.","chinese":"所有疾病都是人體經絡不通。"}],"related":[{"definition":["channel of TCM"],"pinyin":["jing1 mai4"],"word":"經脈"},{"definition":["qi and blood (two basic bodily fluids of Chinese medicine)"],"pinyin":["qi4 xue4"],"word":"氣血"},{"definition":["inner organs"],"pinyin":["zang4 fu3"],"word":"臟腑"},{"definition":["traditional Chinese medical science\/a doctor trained in Chinese medicine"],"pinyin":["Zhong1 yi1"],"word":"中醫"},{"definition":["The Yellow Emperor's Internal Canon, medical text c. 300 BC"],"pinyin":["Huang2 di4 Nei4 jing1"],"word":"黃帝內經"},{"definition":["abbr. for 黃帝內經|黄帝内经[Huang2 di4 Nei4 jing1], The Yellow Emperor's Internal Canon, medical text c. 300 BC"],"pinyin":["Nei4 jing1"],"word":"內經"},{"definition":["to prick with a needle\/to treat by acupuncture"],"pinyin":["zhen1 ci4"],"word":"針刺"},{"definition":["cervical vertebra\/the seven cervical vertebrae in the neck of humans and most mammals"],"pinyin":["jing3 zhui1"],"word":"頸椎"},{"definition":["to harm\/to damage\/to injure\/impairment\/loss\/disability"],"pinyin":["sun3 shang1"],"word":"損傷"},{"definition":["surface of the body\/periphery of the body\/body thermometer\/(literary) a person's appearance"],"pinyin":["ti3 biao3"],"word":"體表"},{"definition":["five viscera and six bowels (TCM)"],"pinyin":["wu3 zang4 liu4 fu3"],"word":"五臟六腑"},{"definition":["rule (e.g. of science)\/law of behavior\/regular pattern\/rhythm\/discipline"],"pinyin":["gui1 lu:4"],"word":"規律"},{"definition":["joint (physiology)\/key point\/critical phase"],"pinyin":["guan1 jie2"],"word":"關節"},{"definition":["yin and yang"],"pinyin":["yin1 yang2"],"word":"陰陽"},{"definition":["to correspond\/a correspondence\/corresponding\/homologous\/matching with sth\/counterpart"],"pinyin":["dui4 ying4"],"word":"對應"},{"definition":["five viscera of TCM, namely: heart 心[xin1], liver 肝[gan1], spleen 脾[pi2], lungs 肺[fei4] and kidneys 腎|肾[shen4]"],"pinyin":["wu3 zang4"],"word":"五臟"}]}