{"definition":["via"],"pinyin":["jing1 you2"],"simplified":["经由"],"rank":14655.0,"normalized_rank":0.2050424635876485,"fraction":0.000004317726247322229,"cumulative_fraction":0.9575736807440948,"word":"經由","characters":[{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["Jing1","jing1"],"word":"經"},{"definition":["to follow\/from\/it is for...to\/reason\/cause\/because of\/due to\/to\/to leave it (to sb)\/by (introduces passive verb)"],"pinyin":["you2"],"word":"由"}],"containing_words":[],"sentences":[{"english":"Fish generally respire through gills.","chinese":"一般是經由鰓呼吸。"},{"english":"Veins then carry blood out of the clitoris.","chinese":"然後，血液又經由血管從陰蒂輸送出來。"},{"english":"Malaria is spread by  mosquito bites.","chinese":"瘧疾經由蚊子叮咬傳播。"},{"english":"Every citizen has a right to participate personally, or through his representative, in its foundation.","chinese":"全國公民都有權親身或經由其代表去參與法律的制定。"},{"english":"The visa application charge will be returned to the applicant, care of the migration agent's address.","chinese":"簽證申請費將會經由移民代理的地址轉交退給申請人。"},{"english":"Mathilde continued to tell Jeanne her story.","chinese":"瑪蒂爾德繼續向吉茵講她的那段經由過程。"},{"english":"Pidan is prepared from raw duck egg by alkaline treatment.","chinese":"皮蛋是生鴨蛋經由鹼處理而製成的。"},{"english":"Anti-cancer drug via oral or intravenous injection into the blood circulation to the body.","chinese":"抗癌藥物可經由口服或靜脈注射進入血液循環到全身。"},{"english":"Symbols are then mapped to subcarriers and transmitted via antennas.","chinese":"然後，符號將會映射到副載波，並且經由天線傳送。"},{"english":"People can also become infected by consuming undercooked meat.","chinese":"人們同樣可以經由食用未煮熟的肉類而感染。"},{"english":"By the subtitle decoder, the subtitles will be held in SDRAM in the receiver.","chinese":"經由字幕解碼器，字幕可以被存入片外SDRAM。"},{"english":"Find out how users navigate your site via heat maps.","chinese":"找出用戶是如何經由熱貼圖瀏覽你的網站的。"},{"english":"This presumption may be rebutted by clear and convincing evidence.","chinese":"這一假設可以經由明確和有說服力的證據駁回。"},{"english":"By comparing the two sides can complement each other I have found that Chinese and Western absorb purposes.","chinese":"經由過程比力我發明中西單方皆可互補，吸納之用。"},{"english":"He has a plan to make us successful through failure.","chinese":"他有一個計畫來讓我們經由失敗得以成功。"},{"english":"The program was telecast live via satellite.","chinese":"該節目經由衛星以電視現場轉播。"}],"related":[{"definition":["to pass through\/to penetrate\/by means of\/via"],"pinyin":["tou4 guo4"],"word":"透過"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"word":"協助"},{"definition":["to pass\/to go through\/process\/course\/CL:個|个[ge4]"],"pinyin":["jing1 guo4"],"word":"經過"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["not only (this one)\/not just (...) but also"],"pinyin":["bu4 jin3"],"word":"不僅"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"},{"definition":["general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead","to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])"],"pinyin":["jiang1","jiang4","qiang1"],"word":"將"},{"definition":["participant"],"pinyin":["can1 yu4 zhe3"],"word":"參與者"},{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge"],"pinyin":["bing4"],"word":"並"},{"definition":["and\/besides\/moreover\/furthermore\/in addition"],"pinyin":["bing4 qie3"],"word":"並且"},{"definition":["to target\/to focus on\/to be aimed at or against\/in response to"],"pinyin":["zhen1 dui4"],"word":"針對"},{"definition":["to transmit\/to pass on to sb else\/(math.) transitive"],"pinyin":["chuan2 di4"],"word":"傳遞"}]}