{"definition":["syndrome"],"pinyin":["zong1 he2 zheng1"],"simplified":["综合征"],"rank":15961.0,"normalized_rank":0.2233150980090384,"fraction":0.0000036904603846965067,"cumulative_fraction":0.9627964199593656,"word":"綜合徵","characters":[{"definition":["heddle (device to form warp in weaving textiles)\/Taiwan pr. [zong4]","to sum up\/to put together\/Taiwan pr. [zong4]"],"pinyin":["zeng4","zong1"],"word":"綜"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["4th note in pentatonic scale 五音[wu3 yin1], roughly sol\/see also 徵|征[zheng1]","to invite\/to recruit\/to levy (taxes)\/to draft (troops)\/phenomenon\/symptom\/characteristic sign (used as proof)\/evidence"],"pinyin":["zheng1","zhi3"],"word":"徵"}],"containing_words":[{"definition":["Budd-Chiari syndrome"],"pinyin":["Bu4 Jia1 zong1 he2 zheng1"],"word":"布加綜合徵"},{"definition":["severe fever with thrombocytopenia syndrome (SFTS)"],"pinyin":["fa1 re4 ban4 xue4 xiao3 ban3 jian3 shao3 zong1 he2 zheng1"],"word":"發熱伴血小板減少綜合徵"},{"definition":["irritable bowel syndrome (IBS)"],"pinyin":["chang2 yi4 ji1 zong1 he2 zheng1"],"word":"腸易激綜合徵"}],"sentences":[{"english":"Psyllium offers benefits in patients with irritable bowel syndrome in primary care.","chinese":"歐車前在腸易激綜合徵患者的初級保健中療效最佳。"},{"english":"Objective To study the imaging features of Klippel-Trenaunay syndrome.","chinese":"目的探討靜脈畸形骨肥大綜合徵影像診斷的徵象。"},{"english":"This paper summarizes the nursing experience for 11 cases with locked-in syndrome.","chinese":"總結11例閉鎖綜合徵患者的早期康復護理經驗。"},{"english":"Objective To study the clinical manifestation of mitral valve prolapse syndrome.","chinese":"目的瞭解二尖瓣脫垂綜合徵的臨牀表現。"},{"english":"This study provides an anatomical basis for clinical diagnosis and treatment of tarsal sinus syndrome.","chinese":"爲臨牀診治跗骨竇綜合徵提供解剖學依據。"},{"english":"Polycystic ovary syndrome (PCOS) is defined as a syndrome of ovarian hyperandrogenism and chronic anovulation.","chinese":"多囊卵巢綜合徵以雄激素過多和持續無排卵爲特徵。"},{"english":"The main pathophysiological changes of patients with PCOS are insulin resistance, hyperinsulinemia and hyperandrogenism.","chinese":"胰島素抵抗是多囊卵巢綜合徵的主要發病機制之一。"},{"english":"Objective To summarize the experiences in the diagnosis and therapy of hyperventilation syndrome of yong servicemen.","chinese":"目的總結青年軍人過度通氣綜合徵的診斷與治療經驗。"},{"english":"The chronic tractive injury at the elbow is the main factor of cubital tunnel syndrome.","chinese":"慢性肘部牽拉傷是導致肘管綜合徵的主要因素。"},{"english":"To study Dorsolateral Medullary Syndrome with MRI.","chinese":"應用MRI研究延髓背外側綜合徵。"},{"english":"Methods 82 patients with primary nephrosis syndrom were randomly divided into two groups.","chinese":"方法將82例原發性腎病綜合徵患者隨機分爲2組。"},{"english":"Hirsutism is frequently a result of PCOS.","chinese":"多毛症常常是多囊卵巢綜合徵的結果。"},{"english":"This paper summarizes professor Xie Jianqun s clinical experience in the treatment of irritable bowel syndrome(IBS).","chinese":"總結謝建羣教授從肝脾論治腸易激綜合徵的臨牀經驗。"},{"english":"Please discuss the clinical type and diagnosis standard of nephritic syndrome.","chinese":"試述腎病綜合徵的臨牀分型及診斷標準。"},{"english":"This patient presented with Cushing's syndrome and hypertension.","chinese":"這個病人有庫興氏綜合徵和高血壓病史。"},{"english":"Method Trace back and analyze ECG of 50 cases of IPS.","chinese":"回顧性分析50例間歇性預激綜合徵的心電圖。"}],"related":[]}