{"definition":["chlorite (geology)"],"pinyin":["lu:4 ni2 shi2"],"simplified":["绿泥石"],"rank":63843.0,"normalized_rank":0.8932464007387405,"fraction":2.0728823014394365e-8,"cumulative_fraction":0.9999323487125248,"word":"綠泥石","characters":[{"definition":["green"],"pinyin":["lu:4"],"word":"綠"},{"definition":["mud\/clay\/paste\/pulp","restrained"],"pinyin":["ni2","ni4"],"word":"泥"},{"definition":["dry measure for grain equal to ten dou 斗\/ten pecks\/one hundred liters","rock\/stone\/stone inscription\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Shi"],"pinyin":["Shi2","dan4","shi2"],"word":"石"}],"containing_words":[],"sentences":[{"english":"Appropriate amount of rim chlorite also played an active role in the protection of reservoirs.","chinese":"適量的環邊綠泥石也對儲層起到了一定的保護作用。"},{"english":"Their mineral weathering degree is relatively low and the clay minerals are mainly composed of illite, chlorite and kaolinite.","chinese":"礦物風化度低，粘土礦物組成以伊利石，綠泥石爲主。"},{"english":"Chlorite in Furong tin allotment can be divided into two stages of mineralization.","chinese":"芙蓉錫礦田中的綠泥石可分爲兩個礦化階段。"},{"english":"XRD analysis shows that the mineral composition of the chlorite jade is mainly chlorite.","chinese":"射線衍射分析結果表明，該綠泥石玉的物相爲綠泥石。"},{"english":"XRD analysis shows that the mineral composition of the chlorite jade is mainly chlorite.","chinese":"射線衍射分析結果表明，該綠泥石玉的物相爲綠泥石。"},{"english":"Of these minerals kaolinite illite and chlorite are commonest.","chinese":"在這些礦物中，高嶺石，伊利石和綠泥石最常見。"},{"english":"Corrensite forms networks of crinkled or folded sheets.","chinese":"柯綠泥石呈捲曲網狀或折迭片狀。"},{"english":"In the end, an application example of stilpnomelane is presented.","chinese":"最後以黑硬綠泥石爲例介紹檢索系統的使用方法。"},{"english":"In the Ranger area highly chloritic rocks were believed to be altered dolerites.","chinese":"蘭傑地區的強烈綠泥石化岩石據信可能是蝕變粒玄巖。"},{"english":"Clinochlore along with quartz are the principal constituents of the matrix.","chinese":"與石英一起的斜綠泥石是基質的主要組成部分。"}],"related":[]}