{"definition":["Virginia, US state (Tw)"],"pinyin":["Wei2 ji2 ni2 ya4"],"simplified":["维吉尼亚"],"rank":57533.0,"normalized_rank":0.8049613140626529,"fraction":5.926691650594447e-8,"cumulative_fraction":0.9996909535397456,"word":"維吉尼亞","characters":[{"definition":["abbr. for Uighur 維吾爾|维吾尔[Wei2 wu2 er3]\/surname Wei","to preserve\/to maintain\/to hold together\/dimension\/vitamin (abbr. for 維生素|维生素[wei2 sheng1 su4])"],"pinyin":["Wei2","wei2"],"word":"維"},{"definition":["lucky\/giga- (meaning billion or 10^9)","surname Ji\/abbr. for Jilin Province 吉林省[Ji2 lin2 Sheng3]"],"pinyin":["Ji2","ji2"],"word":"吉"},{"definition":["Buddhist nun\/(often used in phonetic spellings)"],"pinyin":["ni2"],"word":"尼"},{"definition":["Asia\/Asian\/Taiwan pr. [Ya3]","second\/next to\/inferior\/sub-\/Taiwan pr. [ya3]"],"pinyin":["Ya4","ya4"],"word":"亞"}],"containing_words":[{"definition":["Virginia, US state (Tw)"],"pinyin":["Wei2 ji2 ni2 ya4 Zhou1"],"word":"維吉尼亞州"}],"sentences":[{"english":"He arrived boos at a federal courthouse in Richmond, Virginia.","chinese":"他在維吉尼亞理德曼的聯邦法院遭到了陣陣噓聲。"},{"english":"In Virginia, 19, 000 jobs are at risk.","chinese":"在維吉尼亞，有19000個工作崗位在風雨中飄搖。"},{"english":"In headquarters of bureau of the affection in Virginia city plot of a politics is planning.","chinese":"在維吉尼亞州中情局總部一場政治陰謀正在計劃着。"},{"english":"Speech by Mr. Jim Cheng, Secretary of Commerce and Trade of State of Virginia.","chinese":"維吉尼亞州商務貿易廳廳長鄭叔霆致辭祝賀。"},{"english":"In 1847 Poe’s wife, Virginia, died.","chinese":"1847年，坡的妻子維吉尼亞去世。"},{"english":"To keep himself going through a winter in West Virginia Mark does something very interesting.","chinese":"知道西維吉尼亞冬天很冷，他能找什麼工作呢？"},{"english":"A member of the siouan people of virginia and north carolina.","chinese":"維吉尼亞和卡羅萊納州的蘇族人。"},{"english":"It left England to go to Virginia.","chinese":"在維吉尼亞古老的李斯堡過夜很好。"},{"english":"Rolfe's wife also died, probably soon after they reached Virginia.","chinese":"到達維吉尼亞不久，羅爾夫的妻子也死了。"},{"english":"Speech by Mr. Mike Jing, Virginia State Governor's Advisor on Asian Affair.","chinese":"維吉尼亞州州長代表景明先生致辭祝賀。"},{"english":"Leva now teaches French language and literature at the Virginia Military Institute.","chinese":"目前萊瓦主要在維吉尼亞軍事學院講授法語和文學。"},{"english":"Standard exercises shall be scored using Virginia Count only.","chinese":"標準程序射擊只能使用維吉尼亞計分法來計算得分。"},{"english":"It's thought to be a first for West Virginia, a healthy set of quintuplets.","chinese":"這被認爲是西維吉尼亞第一個健康的五胞胎。"},{"english":"A popular longways is called the Virginia reel.","chinese":"其中一種流行的縱隊舞叫維吉尼亞里爾舞。"},{"english":"Upon Rolfe's return to Virginia, he assumed more prominence in the colony.","chinese":"羅爾夫回到維吉尼亞之後，他取得了更傑出的成就。"},{"english":"Schreiber teaches at the College of William and Mary in Virginia.","chinese":"施賴伯任教於維吉尼亞州的威廉瑪麗學院。"}],"related":[]}