{"definition":["(math.) dimension\/dimensionality"],"pinyin":["wei2 shu4"],"simplified":["维数"],"rank":55371.0,"normalized_rank":0.7747121290557273,"fraction":7.795205274427178e-8,"cumulative_fraction":0.9995429361675049,"word":"維數","characters":[{"definition":["abbr. for Uighur 維吾爾|维吾尔[Wei2 wu2 er3]\/surname Wei","to preserve\/to maintain\/to hold together\/dimension\/vitamin (abbr. for 維生素|维生素[wei2 sheng1 su4])"],"pinyin":["Wei2","wei2"],"word":"維"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[],"sentences":[{"english":"In this dissertation, a new computation method of fractal dimension has been presented.","chinese":"本文提出了一種新的計算分形維數的方法。"},{"english":"Stably free dimensions of rings and modules are defined.","chinese":"引入了環和模的穩定自由維數。"},{"english":"So, the dimension constraints in 3D can be consilient with graphs in 2D.","chinese":"協同了尺寸三維約束與二維圖形在維數上的不一致。"},{"english":"The dimension function of NTFW was characterized by showing its definition and properties.","chinese":"闡述了規範緊框架小波的維數函數的定義和相關性質。"},{"english":"Fractal dimensions of grains in the standard photographs are measured.","chinese":"測量了標準圖譜中鐵素體晶粒度圖形的分形維數。"},{"english":"The paper also discuss the image's character by Box dimension.","chinese":"利用計盒維數討論了圖形的分形特徵。"},{"english":"How to determinate those parameters of the time delay method were studied.","chinese":"並深入分析了延遲時間和相空間維數的確定原理。"},{"english":"Dimensionality reduction is an important preprocessing step before object recognition.","chinese":"維數約簡是目標識別的一個重要預處理步驟。"},{"english":"In this paper, we introduce the concept of finitely cogenerated dimension of modules and study its properties.","chinese":"引入模的有限餘生成維數的概念，研究了它的性質。"},{"english":"Retrieves the dimensions of the tightest bounding rectangle around the current clipping boundary.","chinese":"獲取當前剪切邊界周圍最緊綁定矩形的維數。"},{"english":"The influences of pressure on the fractal dimension and the structure of micropore are discussed in details.","chinese":"詳細討論了分形維數和微孔結構隨壓力的變化規律。"},{"english":"There may be more dimensions as well.","chinese":"也可能存在更多的維數。"},{"english":"The search area of the FBD was reduced by the statistical method.","chinese":"然後，通過統計法縮小盒子維數的運算區域。"},{"english":"Feature selection and feature extraction are common methods for dimensionality reduction.","chinese":"特徵選擇和特徵抽取是維數約簡常用的兩種方法。"},{"english":"The fractal dimensions of coke were calculated according to FHH model.","chinese":"根據FHH模型計算了焦炭的分形維數。"},{"english":"In this paper, fractal dimension of macroporous crosslinked polystyrenes were calculated via FHH and NK methods respectively.","chinese":"探討了分形維數對樹脂吸附性能的影響規律。"}],"related":[]}