{"definition":["vascular"],"pinyin":["wei2 guan3"],"simplified":["维管"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"維管","characters":[{"definition":["abbr. for Uighur 維吾爾|维吾尔[Wei2 wu2 er3]\/surname Wei","to preserve\/to maintain\/to hold together\/dimension\/vitamin (abbr. for 維生素|维生素[wei2 sheng1 su4])"],"pinyin":["Wei2","wei2"],"word":"維"},{"definition":["surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["Guan3","guan3"],"word":"管"}],"containing_words":[{"definition":["vascular bundle (botany)"],"pinyin":["wei2 guan3 shu4"],"word":"維管束"},{"definition":["vascular plants\/tracheophytes (botany)"],"pinyin":["wei2 guan3 shu4 zhi2 wu4"],"word":"維管束植物"},{"definition":["vascular column"],"pinyin":["wei2 guan3 zhu4"],"word":"維管柱"}],"sentences":[{"english":"Calcium precipitates in style cell and vascular tissues of male flowers was sparse and seldom seen.","chinese":"雄花花柱細胞和維管細胞中鈣沉澱顆粒很少。"},{"english":"Florogeography of vascular plants in alpine tundra of the Changbai Mountain.","chinese":"長白山高山凍原維管植物區系地理。"},{"english":"The organ is penetrated with vascular tissue .","chinese":"根瘤的器官內有維管組織穿過。"},{"english":"The vascular ray was developed and the development of periderm was obvious.","chinese":"維管射線發達，周皮發育明顯。"},{"english":"Sporophyll The sporangium-bearing structure of vascular plants.","chinese":"是維管植物中的產生孢子囊的結構。"},{"english":"The primary chalazal haustorium ramifies around the vascular tissues of the ovule .","chinese":"初生合點吸器沿着胚珠的維管組織分支。"},{"english":"The sieve element of the primary vascular system of the seedling of Nelumbo nucifera was sieve tube element.","chinese":"蓮幼苗初生維管系統中的篩分子爲篩管分子。"},{"english":"Lower tracheophytes in existence since the devonian.","chinese":"自從泥盆紀以來就生存的低等維管植物。"},{"english":"In woody plants, tissues outside of the vascular cambium .","chinese":"木本植物維管形成層外部的組織。"},{"english":"Such cultures could give rise to vascular tissues, roots and shoot buds .","chinese":"這樣的培養可能產生維管組織，根和苗端芽。"},{"english":"The vascular bundle of ovule of Phytolacca is evidently from the vascular tissue of receptacle.","chinese":"商陸屬植物的胚珠維管束明顯地來自花托的維管組織。"}],"related":[]}