{"definition":["to maintain\/to keep up\/to hold together"],"pinyin":["wei2 xi4"],"simplified":["维系"],"rank":13774.0,"normalized_rank":0.19271613056678746,"fraction":0.000004815509954921419,"cumulative_fraction":0.9535686134653598,"word":"維繫","characters":[{"definition":["abbr. for Uighur 維吾爾|维吾尔[Wei2 wu2 er3]\/surname Wei","to preserve\/to maintain\/to hold together\/dimension\/vitamin (abbr. for 維生素|维生素[wei2 sheng1 su4])"],"pinyin":["Wei2","wei2"],"word":"維"},{"definition":["to connect\/to arrest\/to worry","to tie\/to fasten\/to button up"],"pinyin":["ji4","xi4"],"word":"繫"}],"containing_words":[],"sentences":[{"english":"The party was kept together by personal loyalty to the leader.","chinese":"這個黨是靠對領袖的個人忠誠而維繫在一起的。"},{"english":"The financial system is held together with a very thin filament called confidence.","chinese":"金融體系只靠一條名爲信心的細線所維繫。"},{"english":"Water is the source of life and the link that binds all living beings on this planet.","chinese":"水是生命之源，也是維繫地球上所有生命的紐帶。"},{"english":"Plan down the trair-conk but maintain flexicity.","chinese":"事前規劃，但要維繫彈性。"},{"english":"Interests are the governing factor in maintaining the relation between the Party and the mass.","chinese":"利益是維繫黨羣關係的決定性因素。"},{"english":"Let Thy goodness, like a fetter, Bind my wandering heart to Thee.","chinese":"我主，讓此恩典維繫流蕩的心歸你前。"},{"english":"In 1985 the numwind upr remained the saree.","chinese":"1985年這個數字維繫不變。"},{"english":"The arranging of clauses one after the other without connectives showing the relation between.","chinese":"小句之間的關係不靠連接詞來維繫。"},{"english":"Forget what you’ve read about communication being the key to a lasting relationship.","chinese":"什麼溝通交流是維繫一段感情的關鍵，都是假話。"},{"english":"Satisfaction to the current situation and an eternal hope supports a spirit-soul-body whereas on this Earth.","chinese":"知足於當下，永恆的盼望，維繫在地的每一個靈魂體。"},{"english":"We have been to technological innovation as it is to maintain a long-term driving force for enterprise development.","chinese":"我們一直把技術創新作爲是維繫企業發展的長效動力。"},{"english":"The next two chapters will teach you more principles that both support and sustain your PMA .","chinese":"以下二章將告訴你更多維繫積極心態的原則。"},{"english":"It must recognize that most governmental authority still resides with nation-states.","chinese":"必須認識到，大部分的政府權力仍然維繫於民族國家。"},{"english":"And how do you have confidence to maintain stability of the society under the situation.","chinese":"在這樣的況下，您如何有信心維繫國家的穩定？"},{"english":"Every day, families sacrifice to live within their means.","chinese":"每一天，無數家庭通過省喫儉用以維繫生活。"},{"english":"Study of decoupling algorithms for multiple-dimensional system.","chinese":"多維繫統解耦算法研究。"}],"related":[{"definition":["(for a) long time"],"pinyin":["chang2 jiu3"],"word":"長久"},{"definition":["to defend\/to safeguard\/to protect\/to uphold\/to maintain"],"pinyin":["wei2 hu4"],"word":"維護"},{"definition":["to link\/to connect"],"pinyin":["lian2 xi4"],"word":"連繫"},{"definition":["steady\/stable\/stability\/to stabilize\/to pacify"],"pinyin":["wen3 ding4"],"word":"穩定"},{"definition":["to join\/to connect\/to link up\/to communicate"],"pinyin":["gou1 tong1"],"word":"溝通"},{"definition":["relation\/relationship\/to concern\/to affect\/to have to do with\/guanxi\/CL:個|个[ge4]"],"pinyin":["guan1 xi5"],"word":"關係"},{"definition":["society\/CL:個|个[ge4]"],"pinyin":["she4 hui4"],"word":"社會"},{"definition":["stable\/steady\/firm\/to stabilize"],"pinyin":["wen3 gu4"],"word":"穩固"},{"definition":["individual"],"pinyin":["ge4 ti3"],"word":"個體"},{"definition":["to depend on\/to be dependent on"],"pinyin":["yi1 lai4"],"word":"依賴"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["they"],"pinyin":["ta1 men5"],"word":"他們"},{"definition":["variant of 關係|关系[guan1 xi5]"],"pinyin":["guan1 xi5"],"word":"關系"},{"definition":["to be in contact (with sb)\/to associate\/to interact\/to get along (well, poorly)"],"pinyin":["xiang1 chu3"],"word":"相處"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"發展"},{"definition":["affection\/family love\/love, esp. within a married couple or between parents and children"],"pinyin":["qin1 qing2"],"word":"親情"}]}