{"definition":["network layer"],"pinyin":["wang3 luo4 ceng2"],"simplified":["网络层"],"rank":47443.0,"normalized_rank":0.6637891231653912,"fraction":1.8714331763699703e-7,"cumulative_fraction":0.9985374078229572,"word":"網絡層","characters":[{"definition":["net\/network"],"pinyin":["wang3"],"word":"網"},{"definition":["net-like object\/to hold sth in place with a net\/to wind\/to twist\/(TCM) channels in the human body","small net"],"pinyin":["lao4","luo4"],"word":"絡"},{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"層"}],"containing_words":[{"definition":["network layer protocol"],"pinyin":["wang3 luo4 ceng2 xie2 yi4"],"word":"網絡層協議"}],"sentences":[{"english":"The AS-I interface network layer was used to carry out the interconnection communication between sensor and executor.","chinese":"接口網絡層用於傳感器和執行器的聯網通信。"},{"english":"Controlling routing at the physical network layer embeds policy into topology.","chinese":"在物理網絡層控制路由需要將策略嵌入到拓撲中。"},{"english":"The architecture of this module consists of Auto-adaptive Ontology Layer and CBR Layer.","chinese":"本模型包括自適應本體網絡層和CBR領域知識層。"},{"english":"You can think of this as creating a secure trusted tunnel at the network layer.","chinese":"您可以將這看作是在網絡層創建安全的受信任隧道。"},{"english":"Another approach to monitoring is to listen at the network level.","chinese":"另外一種監控方法是在網絡層監聽。"},{"english":"A packet-filtering firewall works at the network level.","chinese":"信息包過濾防火牆工作在網絡層。"},{"english":"The IP layer provides a connectionless and unreliable delivery system.","chinese":"在網絡層提供了無連接的不可靠傳輸系統。"},{"english":"Above the link layer is the network layer, which is responsible for directing packets to their destinations.","chinese":"鏈路層上面是網絡層，它負責將報文定向到目標位置。"},{"english":"In particular, it pro-vides the implement mechanism for the network layer's secure transport tunnel technology.","chinese":"特別是對網絡層的安全傳輸通道技術提出了實現機制。"},{"english":"Think of this as creating a secure trusted tunnel at the network layer.","chinese":"可以將這看作是在網絡層上創建安全的可信隧道。"}],"related":[]}