{"definition":["Internet\/net\/cyber-"],"pinyin":["wang3 ji4"],"simplified":["网际"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"網際","characters":[{"definition":["net\/network"],"pinyin":["wang3"],"word":"網"},{"definition":["border\/edge\/boundary\/interval\/between\/inter-\/to meet\/time\/occasion\/to meet with (circumstances)"],"pinyin":["ji4"],"word":"際"}],"containing_words":[{"definition":["Internet protocol\/IP"],"pinyin":["wang3 ji4 xie2 ding4"],"word":"網際協定"},{"definition":["Internet"],"pinyin":["wang3 ji4 wang3 luo4"],"word":"網際網絡"},{"definition":["Internet"],"pinyin":["wang3 ji4 wang3 lu4"],"word":"網際網路"},{"definition":["cyberporn"],"pinyin":["wang3 ji4 se4 qing2"],"word":"網際色情"}],"sentences":[{"english":"Thoughout the last decade the Internet has become an important tool of communication.","chinese":"過去十年來網際網路已經成爲通訊的重要工具。"},{"english":"An Exploratory Study of Web-based Travel Information Search Behavior …","chinese":"網際網路型態旅遊資訊搜尋行爲之初探。"},{"english":"Meanwhile, he said China is stepping up efforts in supervising the Internet.","chinese":"他還說，中國正在加大網際網路的監管力度。"},{"english":"URL: in full Uniform Resource Locator, Address of a resource on the Internet.","chinese":"全名通用資源位標，網際網絡資源的地址。"},{"english":"Internet video junkies will be happy to know that Mux is totally free of charge.","chinese":"網際網路視訊癮會樂於知道多工器是完全免費的。"},{"english":"Protects you against Internet-borne worms and hacker attacks.","chinese":"保護您以對抗基於網際網路的蠕蟲及駭客攻擊。"},{"english":"The Effect of Internet Application on the Hotel … Lecturer, Department of Hospitality Management, Diwan University …","chinese":"運用網際網路在臺灣旅館營收管理之影響效果。"},{"english":"A: Do you use the internet a lot?","chinese":"你經常使用網際網路嗎？"},{"english":"In the evening , I watched TV and surfed the Internet for two hours .","chinese":"在晚上，我看電視和瀏覽了網際網路二個小時。"},{"english":"Routers are the backbone devices of large intranets and of the Internet.","chinese":"路由器是大型企業內網路和網際網路的骨幹裝置。"},{"english":"Since the advent of the Internet, it has become much easier to find information.","chinese":"自從網際網路的來臨，查資料變得容易多了。"},{"english":"An Exploratory Study of Web-based Travel Information Search …","chinese":"網際網路型態旅遊資訊搜尋行爲之初探。"}],"related":[]}