{"definition":["(merchandise) in high demand"],"pinyin":["jin3 qiao4"],"simplified":["紧俏"],"rank":18449.0,"normalized_rank":0.25812544597260506,"fraction":0.000002807879652689265,"cumulative_fraction":0.9708120948057084,"word":"緊俏","characters":[{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"緊"},{"definition":["good-looking\/charming\/(of goods) in great demand\/(coll.) to season (food)"],"pinyin":["qiao4"],"word":"俏"}],"containing_words":[],"sentences":[{"english":"In China's big cities, real estate's expensive and young women are in short supply.","chinese":"中國的大城市，房價高企，年輕女子的行市緊俏。"},{"english":"You should buy this bicycle while there are some left, it is in great demand.","chinese":"趁着還有，你應該買下這部自行車，它是緊俏商品。"},{"english":"A market place where illegal or hard-to-get items are sold or where money is illegally exchanged.","chinese":"非法或緊俏物資的銷售點，或者非法換匯的地方。"},{"english":"Keep rare items back for customers who would pay the best prices.","chinese":"把緊俏商品留給肯出大價錢的主顧們。"},{"english":"At a time of tight budgets, many schools are finding that offer too good to refuse.","chinese":"在眼下預算緊俏時期，很多學校難以拒絕這一支持。"},{"english":"The declarant certified personnel integrates the world along with the Chinese economy, but is scarcer.","chinese":"報關員持證人員隨着中國經濟融入世界而更加緊俏。"},{"english":"Air or train tickets to Heilongjiang are in huge demand.","chinese":"目前，前往黑龍江的機票或火車票都很緊俏。"},{"english":"A market place where illegal or hard-to-get items are sold or where money is illegal exchanged.","chinese":"非法或緊俏物資的銷售點，或者非法換匯的地方。"},{"english":"Eider down clothes of novel design have Been in short supply this winter.","chinese":"設計新穎的羽絨系列服裝，成爲今冬的緊俏貨。"},{"english":"I would like to see the samples first.","chinese":"要知道這些商品很緊俏。"},{"english":"Flags were in such demand, they were stolen.","chinese":"商店裏，國旗是如此緊俏，有人不惜偷搶。"},{"english":"Pumps and generators has become a tight natural merchandise.","chinese":"水泵和發電機自然成了緊俏商品。"},{"english":"With an aging baby boomer generation, healthcare continues to make a strong showing.","chinese":"隨着嬰兒潮一代進入老年，保健行業依然保持緊俏。"}],"related":[]}