{"definition":["to stick closely to (a topic or theme etc)"],"pinyin":["jin3 kou4"],"simplified":["紧扣"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"緊扣","characters":[{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"緊"},{"definition":["to fasten\/to button\/button\/buckle\/knot\/to arrest\/to confiscate\/to deduct (money)\/discount\/to knock\/to smash, spike or dunk (a ball)\/to cover (with a bowl etc)\/(fig.) to tag a label on sb\/(Tw) (loanword) code"],"pinyin":["kou4"],"word":"扣"}],"containing_words":[],"sentences":[{"english":"A blocked vent had caused the tank to buckle.","chinese":"有一條封閉的管子使罐子緊扣。"},{"english":"Your wandering eyes pull at your lover’s heartstrings.","chinese":"你迷離的眼睛緊扣愛人的心絃。"},{"english":"Others may see doors open that lead them to financial success that were previously closed.","chinese":"而其他人會看到以前緊扣的經濟成功之門向他們敞開。"},{"english":"If it’s going to attack, lie facedown, with your hands clasped behind your neck.","chinese":"如果它要襲擊你，面朝下躺下，雙手在頸後緊扣。"},{"english":"The speech he made stuck to the key points.","chinese":"他所作的演說緊扣要點，沒有多餘的話。"},{"english":"Your theme should be content-focused and really simple;","chinese":"你的主題模版必須緊扣內容，同時簡約優雅。"},{"english":"The poet's fingers by the end of Lycidas aren't forced or rude.","chinese":"在的最後，詩人的手指並沒有緊扣着。"},{"english":"Joseph clasped his hands and let them hang loosely between his knees.","chinese":"約瑟夫兩手緊扣，垂在兩膝之間。"},{"english":"These four aspects are closely connected, making up the organic entirety of Mengzi s virtue theory.","chinese":"這四個方面環環緊扣，構成了孟子德性論的有機整體。"},{"english":"The system consists alloy ground floor extrusions and interlocking cassette boards.","chinese":"該系統由鋁合金型材，環環緊扣地下磁帶板。"},{"english":"The translation follows closely the original.","chinese":"這篇譯作緊扣原文。"},{"english":"Remember, your boss is busy so stick to the point.","chinese":"記住，你的上司很忙，所以要緊扣要點。"}],"related":[]}