{"definition":["immediately adjacent\/immediately following\/to follow closely on"],"pinyin":["jin3 jie1"],"simplified":["紧接"],"rank":30635.0,"normalized_rank":0.4286233962475341,"fraction":8.907554791115101e-7,"cumulative_fraction":0.9908239618437632,"word":"緊接","characters":[{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"緊"},{"definition":["to receive\/to answer (the phone)\/to meet or welcome sb\/to connect\/to catch\/to join\/to extend\/to take one's turn on duty\/to take over for sb"],"pinyin":["jie1"],"word":"接"}],"containing_words":[],"sentences":[{"english":"When the markets opened the following Monday, the Dow bid adieu to 10000 for good.","chinese":"股市在緊接着的週一開盤時就告別了10000點。"},{"english":"Then I have patted \"the Day Yunshan Legend\" with him.","chinese":"緊接着，我又跟他拍了《天雲山傳奇》。"},{"english":"It's the first thing they should teach you after arithmetic, in grade school.","chinese":"這是你在學校學完基本算術後的緊接着的課。"},{"english":"Then the second-place man sliced a fly into quarters.","chinese":"緊接着排名第二的人將一隻蒼蠅切成了四半。"},{"english":"The piece segues into his solo with the strings.","chinese":"曲終後緊接着就是他的絃樂獨奏。"},{"english":"The array brackets come after the argument name instead of after the type.","chinese":"數組括號緊接參數名之後，而非類型之後。"},{"english":"New Years comes after Christmas.","chinese":"新年是緊接在聖誕節之後。"},{"english":"Maundy Thursday served as a preparation for the feast of Easter about to follow.","chinese":"濯足日乃是爲著緊接著到來之復活節筵席所做的預備。"},{"english":"This will be followed up by CR2 release in the beginning of August.","chinese":"緊接着會在8月初發布CR2。"},{"english":"Then, introduces the four parts of the lawyer culture;","chinese":"緊接着，又介紹了律師文化的“四分法”。"},{"english":"Then a helper comes to immediately move the baby inside.","chinese":"緊接着就會有助手把孩子抱進教堂裏。"},{"english":"Developing cultivation and solicitation strategies will follow closely behind.","chinese":"開發培育及勸募的策略將緊接於後。"},{"english":"Alternatively, heat one side of a gas grill set on medium-high.","chinese":"緊接着，把烤架的一半邊加熱即可。"},{"english":"After taking a cold rawness of the larynx and trachea come on.","chinese":"感冒了，緊接是喉嚨和氣管的疼痛。"},{"english":"Sepal One of the structures situated immediately below the petals of a flower.","chinese":"一朵花中位置緊接在花瓣下方的結構。"},{"english":"Then, when she was in the sixth grade, the family bought its first computer.","chinese":"緊接着，她升上了六年級，家裏買了第一臺電腦。"}],"related":[]}