{"definition":["in short supply\/scarce"],"pinyin":["jin3 que1"],"simplified":["紧缺"],"rank":9131.0,"normalized_rank":0.12775453667818618,"fraction":0.000009666200517916562,"cumulative_fraction":0.9219486491865624,"word":"緊缺","characters":[{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"緊"},{"definition":["deficiency\/lack\/scarce\/vacant post\/to run short of"],"pinyin":["que1"],"word":"缺"}],"containing_words":[],"sentences":[{"english":"Propionic acid is product heavily short of in our country.","chinese":"丙酸是目前國內十分緊缺的一種產品。"},{"english":"Second, the Mid-Autumn festival is coming, especially in the market shortage of maotai liquor.","chinese":"其次，中秋即將來臨，茅臺酒在市場上尤爲緊缺。"},{"english":"Shacheng Harbour Basin is rich in nature resources. It has not been largely developed now, because of short of electric power.","chinese":"沙埕港流域物產豐富，目前因電力緊缺多未開發。"},{"english":"College graduates are not in short supply.","chinese":"本科畢業生也不在是緊缺資源。"},{"english":"The east Haihe River plain area is one of the regions which are short of water resources in China.","chinese":"海河平原東部地區是中國水資源最緊缺的地區之一。"},{"english":"Of course, human resources shortages are not confined to mental health alone.","chinese":"當然，人力資源緊缺並僅不侷限於心理衛生。"},{"english":"Meat was scarce during the war and too expensive for ordinary people.","chinese":"戰爭期間肉類緊缺，貴得普通人家買不起。"},{"english":"The building plans include much needed new office accommodation.","chinese":"建築規劃包括緊缺的新辦公用房在內。"},{"english":"With the scarcity of world water resources, water crisis is becoming more serious.","chinese":"由於世界水資源的緊缺，水危機日益嚴重。"},{"english":"However because of fuel shortages, some aircraft are clogging up the tarmac.","chinese":"然而因爲燃料緊缺，許多飛機阻塞了停機坪。"},{"english":"In recent years experienced customs broker in some areas is always more shortage.","chinese":"近幾年有經驗的報關員在一些地區始終是比較緊缺的。"},{"english":"Municipal wastewater recycling is one of the effective methods to resolve water resource problem.","chinese":"城市污水回用是緩解我國水資源緊缺的有效途徑之一。"},{"english":"There is now less movement of money between banks and therefore a shortage of available money.","chinese":"銀行間越來越少的貨幣進入造成了可提供的貨幣緊缺。"},{"english":"Some regions of the country are already feeling the pinch.","chinese":"中國的部分地區已經感覺到能源緊缺了。"},{"english":"Many of the boats are sunk, along with the soldiers and desperately needed supplies.","chinese":"許多船和士兵都成了魚食，而供給也緊缺。"},{"english":"On every continent some rivers are drying out, threatening severe water shortages.1?","chinese":"每一塊大陸上都有河流枯涸，水資源緊缺日益加劇。"}],"related":[]}