{"definition":["to gaze\/to stare fixedly"],"pinyin":["jin3 ding1"],"simplified":["紧盯"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"緊盯","characters":[{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"緊"},{"definition":["to watch attentively\/to fix one's attention on\/to stare at\/to gaze at"],"pinyin":["ding1"],"word":"盯"}],"containing_words":[],"sentences":[{"english":"She stared towards them and they ran to his car and sped off.","chinese":"她緊盯着他們，他們倆嚇得趕緊跑進車開走了。"},{"english":"A bipartisan commission, created by Congress last year, is studying contractors closely.","chinese":"去年由國會創建的一個兩黨委員會正緊盯着承包商。"},{"english":"Inside the observatory a team of scientists closely follow the debris.","chinese":"在觀測所裏，科學家正緊盯著殘骸物。"},{"english":"All with their eyes intently fastened on the iron-clamped oaken door.","chinese":"他們一個個都緊盯着佈滿鐵釘的橡木牢門。"},{"english":"The dog stared at me and gave a low growl .","chinese":"這隻狗緊盯着我，而且發出低沉的吼叫聲。"},{"english":"His black, ophidian eyes fixed on Burak.","chinese":"他黑色的毒蛇眼珠緊盯在伯拉克身上。"},{"english":"I was forgetting all his faults, for which I had once kept a sharp look-out.","chinese":"我正在忘卻他所有的缺點，而過去我是緊盯不放的。"},{"english":"Mr. Lyu didn't talk and remained Mou light light, but tightly stared at to raise Chu.","chinese":"呂先生沒有說話，依舊眸光淡淡，卻緊盯着翹楚。"},{"english":"Focus on topics and ideas with large markets.","chinese":"緊盯大市場的主題和想法。"},{"english":"The policeman stared at his eyes when questioning him.","chinese":"警官在詢問他問題的時候，緊盯着他的雙眼。"},{"english":"He rubbed at the windshield and strained his vision over the sweep of headlight.","chinese":"他擦了擦擋風玻璃，緊盯着頭燈掃過的區域。"},{"english":"Now, Thomas is marking Pixon closely.","chinese":"現在托馬斯正緊盯着皮克森。"},{"english":"Pedestrians in great haste, and his eyes are fixed on the ground.","chinese":"但行人來去匆匆，眼睛中是緊盯着地面。"},{"english":"I expect that the Queen does not enjoy being gawked at.","chinese":"我想女王不喜歡被人愣愣地緊盯着看。"},{"english":"Dr. Roquefort’s eyes strafed the group and zeroed tight on the few he thought absolutely loyal.","chinese":"雷孟達的眼睛掃射這人羣緊盯着那些對他絕對忠誠的。"},{"english":"But the days of clockwatching for TB patients may soon be over.","chinese":"但是緊盯結核病患者的日子可能很快就要結束了。"}],"related":[]}