{"definition":["to follow precisely\/to comply with"],"pinyin":["jin3 gen1"],"simplified":["紧跟"],"rank":12041.0,"normalized_rank":0.16846921215004268,"fraction":0.000006082303800829266,"cumulative_fraction":0.9441704175059504,"word":"緊跟","characters":[{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"緊"},{"definition":["heel\/to follow closely\/to go with\/(of a woman) to marry sb\/with\/compared with\/to\/towards\/and (joining two nouns)"],"pinyin":["gen1"],"word":"跟"}],"containing_words":[],"sentences":[{"english":"It also reflects the pantheistic experimentation of the period immediately following the Civil War.","chinese":"同時也反映出了泛神論時期緊跟的內戰時期狀態。"},{"english":"Longtze remained in contact but rounded the windward mark in last position.","chinese":"龍之子號一路緊跟但還是最後一個繞標。"},{"english":"He heeled after his wife as a dog.","chinese":"他像狗一樣緊跟在他妻子的身後。"},{"english":"A full error message follows, running to the end of the format string.","chinese":"緊跟一個完整的錯誤信息，直到格式串尾。"},{"english":"The students walked through the gates with Uncle Wang (L34).","chinese":"同學們緊跟王伯伯走進廠門。"},{"english":"But research will follow the market.","chinese":"但是，研究將緊跟市場步伐。"},{"english":"The car pelted along,with two motorcycles running after.","chinese":"那輛汽車急速行駛，兩輛摩托車緊跟其後。"},{"english":"In any industry ,you have to stay current on new trends and technologies .","chinese":"在任何一個行業裏，你必須緊跟新技術和發展的潮流。"},{"english":"He described Yang as \"very meek and very nervous.\"","chinese":"他形容楊欣“緊跟其後，非常緊張”。"},{"english":"Once one of them followed me until I gave him a dollar.","chinese":"有一次一個人緊跟我不放直到我給了他一塊錢才走。"},{"english":"After a bright flash, there came a very loudly thunder.","chinese":"一個閃電過後，緊跟的是咔嚓嚓的雷聲。"},{"english":"Firms also use fancy job titles to signal that they are au fait with the latest fashion.","chinese":"各家公司用花哨的職位來表示他們緊跟時尚潮流。"},{"english":"South Korea's Seoul ranked third, followed closely by Tokyo at No. 4.","chinese":"韓國的首爾名列第三，東京緊跟其後，位居第四。"},{"english":"Others have followed in Apple’s footsteps.","chinese":"其他人也已經緊跟蘋果的步伐。"},{"english":"I wish the person behind us could stop tailgating us.","chinese":"真希望我們後面那個人可以不要再緊跟我們。"},{"english":"The blog is updated relatively frequent and it is a good resource to monitor.","chinese":"這個博客更新很勤，也是一個可以緊跟的好資源。"}],"related":[]}