{"definition":["to pursue closely"],"pinyin":["jin3 zhui1"],"simplified":["紧追"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"緊追","characters":[{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"緊"},{"definition":["to chase after\/to seek\/to do one's utmost to seek or procure sth\/to recall","to sculpt\/to carve\/musical instrument (old)"],"pinyin":["dui1","zhui1"],"word":"追"}],"containing_words":[],"sentences":[{"english":"He took off after me, vainly trying to land a blow.","chinese":"他在後面緊追不捨，總想打到我。"},{"english":"Not far behind him was Lin Tao.","chinese":"緊追其後的是林濤。"},{"english":"The hound nips at a rabbit.","chinese":"獵犬在野兔身後緊追不捨。"},{"english":"The police kept after the criminal until they finally caught him.","chinese":"警方對那個罪犯緊追不捨，直至最後把他抓獲。"},{"english":"The boy rushed past me with a policeman close on his heels.","chinese":"那男孩從我身邊飛奔而過，有個警察緊追在後。"},{"english":"The thief ran off down the road , so I chased him for all I was worth .","chinese":"那賊順着馬路逃跑，我就拼命緊追不捨。"},{"english":"The partisans managed to get away, although the enemy was hot on their tracks.","chinese":"雖然敵人緊追不捨，游擊隊員們還是設法跑掉了。"},{"english":"Wounded haze it running in the woods, the day a group of soldiers followed behind.","chinese":"負傷的嵐麼在樹林中奔跑，身後一羣日兵緊追不捨。"},{"english":"The shark, excited by the smell of blood and the chase, went after him.","chinese":"那條鯊魚受到血腥味以及捕食的刺激，緊追在他後頭。"},{"english":"Merger mania grips green.","chinese":"併購狂潮緊追綠色趨勢。"},{"english":"The taxi driver saw him and ran after him.","chinese":"出租車司機看見了他，在後面緊追不放。"},{"english":"Top would be fine, but to be near the top would mean the run-in would present us with an opportunity.","chinese":"頭名當然好，但緊追領頭羊意味着我們還有機會。"},{"english":"Now in our school there is a hot pursuit of fashion.","chinese":"現在在我們學校有一股緊追時尚的風氣。"},{"english":"In most, though, he is nipping at Mr Romney’s heels.","chinese":"儘管大多數調查中，凱恩是緊追羅姆尼其後。"},{"english":"A snarling swarm of razor-toothed green monsters is hot on his heels.","chinese":"一大羣牙尖齒利的綠色怪獸在他身後緊追不捨。"},{"english":"He kept running desperately chased by two police.","chinese":"他拼命地逃，後面兩個警察緊追不捨。"}],"related":[{"definition":["to oppose each other with equal harshness (idiom); tit for tat\/measure for measure"],"pinyin":["zhen1 feng1 xiang1 dui4"],"word":"針鋒相對"},{"definition":["to turn white-hot\/to intensify\/to reach a climax"],"pinyin":["bai2 re4 hua4"],"word":"白熱化"},{"definition":["to call loudly (idiom); to get people's attention\/to make one's views known"],"pinyin":["da4 sheng1 ji2 hu1"],"word":"大聲疾呼"},{"definition":["to make way (for sth)"],"pinyin":["rang4 lu4"],"word":"讓路"},{"definition":["dangers spring up all around (idiom); surrounded by perils"],"pinyin":["xian3 xiang4 huan2 sheng1"],"word":"險象環生"},{"definition":["to make an amphibious assault\/to seize a beachhead\/to gain a foothold in (a new market)"],"pinyin":["qiang3 tan1"],"word":"搶灘"},{"definition":["to take the lead"],"pinyin":["yi1 ma3 dang1 xian1"],"word":"一馬當先"},{"definition":["one falls, the next follows (idiom); stepping into the breach to replace fallen comrades\/advancing wave upon wave"],"pinyin":["qian2 pu1 hou4 ji4"],"word":"前仆後繼"},{"definition":["to surmount all difficulties (on the way to success) (idiom)\/abbr. for 過五關斬六將|过五关斩六将[guo4 wu3 guan1 zhan3 liu4 jiang4]"],"pinyin":["guo4 guan1 zhan3 jiang4"],"word":"過關斬將"},{"definition":["(of a pendulum) to stop swinging\/(of work, production, activities etc) to come to a halt\/to be suspended\/to be canceled\/shutdown\/(sports) lockout"],"pinyin":["ting2 bai3"],"word":"停擺"},{"definition":["to be a cinch\/in the bag\/(of a person) confident of success"],"pinyin":["shi2 na2 jiu3 wen3"],"word":"十拿九穩"},{"definition":["to follow up a victory and press home the attack\/to pursue retreating enemy"],"pinyin":["cheng2 sheng4 zhui1 ji1"],"word":"乘勝追擊"},{"definition":["to dodge\/to sidestep"],"pinyin":["shan3 bi4"],"word":"閃避"},{"definition":["to stick onto\/stalemate\/gridlock\/to agglutinate"],"pinyin":["jiao1 zhuo2"],"word":"膠著"},{"definition":["to glare like a tiger watching his prey (idiom)\/to eye covetously"],"pinyin":["hu3 shi4 dan1 dan1"],"word":"虎視眈眈"},{"definition":["lit. to ruin the enterprise for the sake of one basketful\/to fail through lack of a final effort\/to spoil the ship for a ha'penny worth of tar (idiom)"],"pinyin":["gong1 kui1 yi1 kui4"],"word":"功虧一簣"}]}