{"definition":["urgent and important moment (idiom); critical juncture"],"pinyin":["jin3 yao4 guan1 tou2"],"simplified":["紧要关头"],"rank":29557.0,"normalized_rank":0.4135407776363102,"fraction":9.773202118406358e-7,"cumulative_fraction":0.989816734757572,"word":"緊要關頭","characters":[{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"緊"},{"definition":["important\/vital\/to want\/to ask for\/will\/going to (as future auxiliary)\/may\/must\/(used in a comparison) must be\/probably\/if","to demand\/to request\/to coerce"],"pinyin":["yao1","yao4"],"word":"要"},{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["Guan1","guan1"],"word":"關"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"}],"containing_words":[],"sentences":[{"english":"We are at a critical moment in our history.","chinese":"我們正處於歷史的緊要關頭。"},{"english":"A friend is someone who will come to help you in a pinch.","chinese":"所謂朋友，就是在緊要關頭肯來幫助你的人。"},{"english":"The fate of our people hangs in the balance.","chinese":"我的族人們的命運正處在緊要關頭。"},{"english":"They arrived in the nick of time to save us.","chinese":"在緊要關頭他們正好趕到來救我們。"},{"english":"Ever notice that most dreams have a blood-surging urgency to them?","chinese":"可曾記得，大部分的夢都有一段驚心動魄的緊要關頭？"},{"english":"When it comes to the point, she always shrinks back.","chinese":"每逢到了緊要關頭，她總是臨陣退縮。"},{"english":"We are at a critical time in our history.","chinese":"我們處在歷史的緊要關頭。"},{"english":"He appeared at the psychological moment to prevent me from being bitten by the dog.","chinese":"他出現在緊要關頭才使我未被狗咬着。"},{"english":"There is no guarantee of rationality in these showdowns.","chinese":"在這樣的緊要關頭沒有合理的保證。"},{"english":"Ulla, a young Swedish woman caught in the moment of crucial decision.","chinese":"烏拉，一位處在緊要關頭下的年輕瑞典婦女。"}],"related":[]}