{"definition":["to be right next to\/close neighbor"],"pinyin":["jin3 lin2"],"simplified":["紧邻"],"rank":13822.0,"normalized_rank":0.1933877128426119,"fraction":0.000004780767279728279,"cumulative_fraction":0.9537989860135052,"word":"緊鄰","characters":[{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"緊"},{"definition":["neighbor\/adjacent\/close to"],"pinyin":["lin2"],"word":"鄰"}],"containing_words":[],"sentences":[{"english":"Just outside Sanya, the newly built Nanshan Temple with its 108-metre-high Buddha statue draws alot of tourists.","chinese":"緊鄰三亞，有着108米高的南山寺吸引了很多遊客。"},{"english":"The north tower butts against the outer wall.","chinese":"北邊那座塔緊鄰着外圍牆。"},{"english":"The Recurrence for a Class of Non-nearest-neighbor Random Walks in Random Environments.","chinese":"一類隨機環境中非緊鄰的隨機遊動的常返性。"},{"english":"Her quarters were right next to my Master Suite.","chinese":"她的四分之一是正確地緊鄰我的主人隨員。"},{"english":"The Bird World is next to the Monkey Hill. There are all kinds of birds.","chinese":"鳥世界緊鄰猴山，那兒有各種各樣的美麗的鳥。"},{"english":"Dark-colored wooden tables with upholstered chairs are scattered around each of the three intimate seating areas.","chinese":"深色木桌和軟墊椅子散佈在三個緊鄰的房間裏。"},{"english":"Located at the southeast of Guomao Bridge. Beside the east 3rd ring road.","chinese":"位於國貿橋東南角，緊鄰東三環。"},{"english":"The house adjacent to the church is the vicarage.","chinese":"緊鄰教堂的房子是牧師的住處。"},{"english":"SP positive cell bodies in the reticular formation close ventrolateral to nucleus ambiguus were also found.","chinese":"SP陽性細胞還見於疑核腹外側緊鄰的網狀結構中。"},{"english":"It was next to sublime History Museum and across the River Reuss .","chinese":"它緊鄰莊嚴的歷史博物館，也橫跨過盧埃斯河。"},{"english":"The library neighboured the shop.","chinese":"圖書館緊鄰着商店。"},{"english":"Near Chaoyangmen, beside Yabao Market. Close to Ritan Park.","chinese":"位於朝陽門，緊鄰雅寶市場，日壇公園。"},{"english":"The community college where my ex-husband teaches is next door to the North Carolina School for the Deaf.","chinese":"我前夫任教的社區大學緊鄰北北卡羅來納州聾人學校。"},{"english":"To avoid edge effect, models should only be sliced immediately before their optical analysis.","chinese":"爲避免邊緣效應，模型應在緊鄰光學分析之前才切片。"},{"english":"Gas station is located in the hilly slopes, adjacent to the highway.","chinese":"加油站地處丘陵地帶的高坡上，緊鄰公路。"},{"english":"Located just beside the Sanyuan Bridge and Luthansa Area.","chinese":"坐落與三元橋畔，緊鄰燕莎中心。"}],"related":[]}