{"definition":["to close securely\/tightly closed\/secure"],"pinyin":["jin3 bi4"],"simplified":["紧闭"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"緊閉","characters":[{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"緊"},{"definition":["to close\/to stop up\/to shut\/to obstruct"],"pinyin":["bi4"],"word":"閉"}],"containing_words":[{"definition":["lockjaw\/trismus"],"pinyin":["ya2 guan1 jin3 bi4 zheng4"],"word":"牙關緊閉症"}],"sentences":[{"english":"His lips are tight; his jaw is clenched.","chinese":"他雙脣緊閉，牙關緊咬。"},{"english":"He lacdfds. com on his back, his teeth set, his right hand clenched on his breast.","chinese":"他仰臥着，牙關緊閉，右手緊握着拳頭胸口上。"},{"english":"The door was closed, so he knocked, but there was no answer.","chinese":"門緊閉着，他敲一下門，裏面沒有迴應。"},{"english":"Long to set out the next day, but the wangs are closed.","chinese":"第二天長文來迎親，但王家大門緊閉。"},{"english":"She never did open her eyes.","chinese":"她雙眼緊閉，從這以後就再也未睜開過雙眼。"},{"english":"While the front door is closed,there must be another open for you.","chinese":"當你的大門緊閉時，另一扇大門就一定會爲你敞開。"},{"english":"I felt my jaws clench and teeth grind together.","chinese":"我感到雙顎緊閉，牙齒緊緊咬在一起。"},{"english":"He lay on the sleeping-porch and watched the winter sun slide along the taut curtains.","chinese":"他躺在迴廊裏，看冬天的陽光滑過緊閉的窗簾。"},{"english":"Two closely shut old gates just like the vicissitude of a family.","chinese":"緊閉着的兩扇老門，象關着一個家族的變遷史。"},{"english":"He clinched his hands. He knitted his brows and tightened his lips.","chinese":"他雙手握拳，雙眉緊蹙，嘴脣緊閉。"},{"english":"As the rolle coaster started to move, Tommy squeezed his eyes shut.","chinese":"雲霄飛車啓動時，湯米把眼睛緊緊閉上。"},{"english":"He shutteth his eyes to devise froward things: moving his lips he bringeth evil to pass.","chinese":"眼目緊合的，圖謀乖僻，嘴脣緊閉的，成就邪惡。"},{"english":"The mouth is reversed into a frown but is still closed.","chinese":"嘴巴已經緊蹙地反過來，但還使緊閉着。"},{"english":"Outside, even through the shut window-pane, the world looked cold.","chinese":"即使透過緊閉的窗格，外面的世界也看起來一片冰冷。"},{"english":"He lay on his back, his teeth set, his right hand clenched on his breast .","chinese":"他仰臥着，牙關緊閉，右手緊握着拳頭放在胸口上。"},{"english":"You say that you love the wind, but you close the windows when it blows.","chinese":"你說你愛微風輕柔，風拂髮梢時你卻緊閉門窗。"}],"related":[]}