{"definition":["to press hard\/to close in on"],"pinyin":["jin3 bi1"],"simplified":["紧逼"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"緊逼","characters":[{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"緊"},{"definition":["to force (sb to do sth)\/to compel\/to press for\/to extort\/to press on towards\/to press up to\/to close in on\/euphemistic variant of 屄[bi1]"],"pinyin":["bi1"],"word":"逼"}],"containing_words":[],"sentences":[{"english":"The Americans kept hustling, and it finally paid off in the 104th minute.","chinese":"美國人繼續緊逼，最終在第104分鐘得到回報。"},{"english":"Tight marking or even man marking in midfield can have massive effects on the defensive performance.","chinese":"中場的緊逼盯人甚至人盯人對防守相當有利。"},{"english":"Several kinds are offered.","chinese":"那緊逼有幾種呢？"},{"english":"The full-court press is legs, not arms.","chinese":"全場緊逼靠的是腳，而非手。"},{"english":"I knew your team broke through the Shanghai team's half-court pre .","chinese":"我知道你們球隊打破了上海隊的半場緊逼。"},{"english":"Do you know how to play full-court press?","chinese":"你會打全場區域緊逼嗎？"},{"english":"He never used the full-court press the same way again.","chinese":"在餘下的賽季，他再也沒那樣使用全場緊逼。"},{"english":"Armed police have barricaded people again, stepping forward forcing them back.","chinese":"武警再築人牆，雙方步步緊逼。"},{"english":"When he first time has dribbled half-court encounters presses hard on, and presents the fault.","chinese":"在他第一次帶球過半場時就遭到緊逼，並出現失誤。"},{"english":"Yet the puzzle of the press is that it has never become popular.","chinese":"令人不解的是，全場緊逼戰術從來沒有真正流行起來。"},{"english":"Added Tight Marking to view menu in the in-match tactics .","chinese":"添加爲比賽中的戰術菜單添加緊逼防守選項。"},{"english":"The NBA, meanwhile, is making a full-court press.","chinese":"同時，NBA在製造全場緊逼時。"},{"english":"Our team broke through the Shanghai team's half-court press.","chinese":"我們球隊打破了上海隊的半場緊逼。"},{"english":"You can also toggle between Loose\/Tight marking.","chinese":"你可以在寬鬆盯防和緊逼盯防中切換。"},{"english":"I know your team broke through the Shanghai team's half-court press.","chinese":"我知道你們球隊打破了上海隊的半場緊逼。"},{"english":"I knew your team broke through the Shanghai team's half-court press.","chinese":"我知道你們球隊打破了上海隊的半場緊逼。"}],"related":[]}