{"definition":["introduction\/introductory chapter"],"pinyin":["xu4 lun4"],"simplified":["绪论"],"rank":60501.0,"normalized_rank":0.8464874847844641,"fraction":3.839211586468816e-8,"cumulative_fraction":0.999834967767526,"word":"緒論","characters":[{"definition":["beginnings\/clues\/mental state\/thread"],"pinyin":["xu4"],"word":"緒"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"論"}],"containing_words":[],"sentences":[{"english":"The dissertation consists of introduction and four parts.","chinese":"全文分爲緒論和四個主要章節。"},{"english":"I always jump introduction to read books.","chinese":"我看書時常常略去緒論。"},{"english":"Based on this, the paper, including three except introduction.","chinese":"基於此，本文除了緒論外，包括三章。"},{"english":"This thesis consists of five chapters of the introduction and main text plus the conclusion totaling about fifty thousand words.","chinese":"本論文分爲緒論及正文共五章和結語，全文約5萬字。"},{"english":"A good way to end the introduction is to state the dissertation objectives.","chinese":"結束緒論的一個好辦法就是陳述這篇論文的寫作目的。"},{"english":"Besides introduction, the content is mainly divided into four parts.","chinese":"本文除緒論外，內容主要分爲四個部分。"},{"english":"This article consists of an introduction and four chapters.","chinese":"本文由緒論和四個章節組成。"},{"english":"This thesis falls into eight chapters, including the introduction and conclusion.","chinese":"本文除緒論和結論外分六章。"},{"english":"The thesis has five chapters other than introduction and conclusion.","chinese":"正文分爲五章，另有緒論和結語兩部分。"},{"english":"The introduction clarified the motive and the meaning of this topic research.","chinese":"緒論闡明瞭本課題研究的動機和意義。"},{"english":"The prolegomenon mainly includes four aspects.","chinese":"緒論部分包括四個方面的內容。"},{"english":"Cat is composed of exordium and four chapters.","chinese":"全文由緒論和四個章節構成。"},{"english":"This thesis consists of the exordium and ten chapters.","chinese":"論文包括緒論及十章內容。"},{"english":"The essay consists of five chapters, an introduction, and a conclusion.","chinese":"本文除緒論及結論兩章外，內容共分五章。"},{"english":"This article includes three parts, introduction and body.","chinese":"本文包括緒論和正文三部分。"},{"english":"This book has three parts and composes of introduction and two chapters.","chinese":"本文內容共分三部分，由緒論和二個章節構成。"}],"related":[]}