{"definition":["linear programming"],"pinyin":["xian4 xing4 gui1 hua4"],"simplified":["线性规划"],"rank":62465.0,"normalized_rank":0.873966392903614,"fraction":2.7297816223181315e-8,"cumulative_fraction":0.9998992932467416,"word":"線性規劃","characters":[{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"},{"definition":["compass\/a rule\/regulation\/to admonish\/to plan\/to scheme"],"pinyin":["gui1"],"word":"規"},{"definition":["to cut\/to slash\/to scratch (cut into the surface of sth)\/to strike (a match)","to delimit\/to transfer\/to assign\/to plan\/to draw (a line)\/stroke of a Chinese character"],"pinyin":["hua2","hua4"],"word":"劃"}],"containing_words":[],"sentences":[{"english":"Semidefinite programming is an extension of linear programming.","chinese":"半定規劃是線性規劃的一種推廣。"},{"english":"AimIn order to get a numerical algorithm which is simple and efficient for a class of linear programs problem.","chinese":"目的爲得到一類線性規劃的簡單有效的數值算法。"},{"english":"A standard form of interval linear programming was defined.","chinese":"定義了區間線性規劃的標準型。"},{"english":"In this paper, bilevel linear programming with fuzzy coefficients is studied.","chinese":"研究具有模糊係數的兩層線性規劃問題。"},{"english":"Here the single-goal method in planning such as linear programming may not be suitable any more.","chinese":"這時，線性規劃等單一目標的規劃方法已不適應。"},{"english":"For example, he will be the introduction of linear programming to minimize the practice of transportation costs.","chinese":"例如，他將線性規劃引入最小化運輸成本的實踐中。"},{"english":"The paper enquires into the applicability of the optimum linear plan method to masterplan for land utilization.","chinese":"探討最優線性規劃法對土地利用總體規劃的適用性。"},{"english":"In this paper, an iterative formula to solving non-degenerate LP to optimality is given.","chinese":"本文給出了求非退化線性規劃最優解的迭代公式。"},{"english":"In goal-seeking optimization problems, linear programming problems are the most common.","chinese":"線性規劃是目標優化問題中最常用的模型。"},{"english":"This paper presents a new implicit enumerative algorithm for integer linear programs.","chinese":"提出了一種求解整數線性規劃的新的隱數算法。"},{"english":"It is typical that the method of linear programming is applied to multisensor management.","chinese":"線性規劃方法在多傳感器管理中的應用已比較經典。"}],"related":[]}