{"definition":["linear equation (math.)"],"pinyin":["xian4 xing4 fang1 cheng2"],"simplified":["线性方程"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"線性方程","characters":[{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"},{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["Fang1","fang1"],"word":"方"},{"definition":["rule\/order\/regulations\/formula\/journey\/procedure\/sequence","surname Cheng"],"pinyin":["Cheng2","cheng2"],"word":"程"}],"containing_words":[],"sentences":[{"english":"Let's take a linear function of x, y, and z.","chinese":"我們來看關於x，y，z的一個線性方程。"},{"english":"A quasilinear equation is one in which the highest-order derivative appears linearly .","chinese":"最高階導數線性地出現的那種方程是準線性方程。"},{"english":"All of the terms in a linear equation are of the first degree.","chinese":"線性方程中的所有項均爲一次項。"},{"english":"The Schr?dinger equation is a linear equation.","chinese":"薛定諤方程是一個線性方程。"},{"english":"Higher-order linear equations are solved using Abramov and Bronstein algorithms.","chinese":"常係數線性方程使用矩陣指數的方法求解。"},{"english":"What is one of the properties of a linear equation?","chinese":"線性方程的一個特性是什麼？"},{"english":"OK, so we've seen how to multiply matrices, and how to write linear systems in matrix form.","chinese":"我們學過矩陣乘法的，以及用矩陣表示線性方程。"},{"english":"Linear equation means that solutions are additive.","chinese":"線性方程的結果是可加的。"},{"english":"Well, in life, a lot of things are related by linear formulas.","chinese":"呃，在生活中，很多東西跟線性方程是相關的。"},{"english":"Now, how do I solve a linear system matrix times x, y equals zero?","chinese":"好了，現在我怎麼解這個線性方程？"}],"related":[]}