{"definition":["thread spool"],"pinyin":["xian4 zhou2"],"simplified":["线轴"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"線軸","characters":[{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"},{"definition":["axis\/axle\/spool (for thread)\/roller (for scrolls)\/classifier for calligraphy rolls etc","see 壓軸戲|压轴戏[ya1 zhou4 xi4]\/Taiwan pr. [zhou2]"],"pinyin":["zhou2","zhou4"],"word":"軸"}],"containing_words":[],"sentences":[{"english":"Thread is wound on spools.","chinese":"線是繞在線軸上的。"},{"english":"A ratchet mechanism transfers the thread from spool to bobbin.","chinese":"一種棘齒裝置把線從線軸轉到梭心上。"},{"english":"High precision linear guiding pair ensured steady and long-term processing accuracy.","chinese":"高精度直線軸承導軌副，可長期保持精度。"},{"english":"Basic design concepts of Linear Shaft Motor are SIMPLE), NON-CONTACT and HIGH PRECISION.","chinese":"線軸電機具有簡便，無接觸和高精度的設計特點。"},{"english":"Tool feeding adopted linear bearing motion pair, which ensured steady processing.","chinese":"刀具進給採用直線軸承運動副，使工作性能穩定。"},{"english":"Histones organize the DNA and keep it from getting tangled, much like thread wrapped around a spool.","chinese":"組蛋白組織DNA並防止它雜亂，很像線纏在線軸上。"},{"english":"Also, at the same time, with his right hand, he caught up the loose twine-end of a small bobbin.","chinese":"與此同時，他用右手捏住小線軸上鬆了的線頭。"},{"english":"A woman goes into Wal-Mart to buy a rod and reel.","chinese":"一個女人去沃爾瑪超市買魚竿和魚線軸。"},{"english":"On the roadsides, there are spindle-shaped posts and sculptures as well as kite-shaped street lamps.","chinese":"路邊有放風箏用的線軸，路燈做成了風箏的形狀。"},{"english":"It's as if you were winding sewing thread on a spool.","chinese":"這就像你在把線纏繞到一個線軸上去。"},{"english":"Cutting head movement and feed are used linear bearing motion pair.","chinese":"機頭移動和進給均採用直線軸承運動副。"},{"english":"The bobbins are placed in a shuttle which carries the weft thread through the shed .","chinese":"該線軸被放置在一個航天飛機載有與通過棚緯紗。"},{"english":"The carriage assembly is supported by four recirculating linear ball bearings and two hardened guide shafts.","chinese":"馬車議會的支持，四循環直線軸承和兩個硬化指導軸。"},{"english":"The spools of thread in this box have become tangled.","chinese":"這個盒子的線軸都亂成一團了。"},{"english":"Linear bearings do not bear the rotating load, otherwise it can lead to accidents.","chinese":"直線軸承不承受旋轉載荷，否則可以導致意外事故。"},{"english":"Linear bearings provide low stick slip for precise positioning and ease of moving the load.","chinese":"直線軸承提供低堅持滑精確定位和方便移動的負載。"}],"related":[]}