{"definition":["to arrest\/to seize"],"pinyin":["ji1 na2"],"simplified":["缉拿"],"rank":19886.0,"normalized_rank":0.27823094035509915,"fraction":0.000002424688382176693,"cumulative_fraction":0.974563475011583,"word":"緝拿","characters":[{"definition":["to seize\/to arrest\/Taiwan pr. [qi4]","to stitch finely"],"pinyin":["ji1","qi1"],"word":"緝"},{"definition":["to hold\/to seize\/to catch\/to apprehend\/to take\/(used in the same way as 把[ba3]: to mark the following noun as a direct object)"],"pinyin":["na2"],"word":"拿"}],"containing_words":[],"sentences":[{"english":"Shi Xiang summer Guanci apprehend came to see two people is exhausted.","chinese":"緝拿施襄夏的官差趕來，看到是精疲力竭的倆人。"},{"english":"Socialist organizations called for the culprits to be hunted down.","chinese":"社會主義團體呼籲將這些犯人緝拿歸案。"},{"english":"One who pursues a criminal or fugitive for whom a reward is offered.","chinese":"爲得賞而追捕緝拿罪犯或逃犯的人。"},{"english":"The Pakistani government is determined to seize the criminals as soon as possible and bring them to justice.","chinese":"巴政府下決心儘快緝拿罪犯，並將其繩之以法。"},{"english":"The arrest of the two drug traffickers was broadcast live on the TV.","chinese":"緝拿兩名販毒分子的過程在電視上進行了實況轉播。"},{"english":"Is it time the police to apprehend criminals do not have to pay cost?","chinese":"難道每次緝拿歹徒警察都沒有付出代價嗎？"},{"english":"The police said that it was just a matter of time before the murderer was put into prison.","chinese":"警方表示，將殺人兇手緝拿歸案只是個時間問題。"},{"english":"The criminal was seized by the police.","chinese":"罪犯被警方緝拿歸案。"},{"english":"He was driven back to pao an with a price on his head .","chinese":"在懸賞緝拿他的首級的情況下他被迫退到保安去。"},{"english":"And there are plans to collar even more coppersnatchers.","chinese":"政府現已制定抓捕計劃，欲緝拿更多的盜銅賊歸案。"},{"english":"You son escaped, officials are brought to justice.","chinese":"你兒子逃走了，官府正在緝拿歸案。"},{"english":"Have any of the murderers been captured?","chinese":"有兇手被緝拿歸案了嗎？"}],"related":[]}