{"definition":["to originate from\/to come from the fact that\/owing to\/because of"],"pinyin":["yuan2 yu2"],"simplified":["缘于"],"rank":13794.0,"normalized_rank":0.19299595651504764,"fraction":0.000004804123700026188,"cumulative_fraction":0.9536647740373908,"word":"緣於","characters":[{"definition":["cause\/reason\/karma\/fate\/predestined affinity\/margin\/hem\/edge\/along"],"pinyin":["yuan2"],"word":"緣"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[],"sentences":[{"english":"MR. LU’S fascination with war came from eight years of service in the Chinese Army.","chinese":"陸川對於戰爭的着迷緣於他當了八年兵。"},{"english":"The reason in mind music is the happy fountainhead.","chinese":"緣於心靈的音樂是幸福的源泉。"},{"english":"Wei Zhe calm and cool due to his \"Jinling curriculum vitae.\"","chinese":"衛哲的從容和冷靜緣於他的“金領簡歷”。"},{"english":"Sunburn is due to overexposure of the skin to ultraviolet rays of the sun or a sun lamp.","chinese":"曬斑緣於皮膚對太陽中紫外線的過度暴露。"},{"english":"In a sense, extramarital love results from lack of responsibility.","chinese":"從某種意義上說，婚外戀緣於責任感缺乏。"},{"english":"His enchantment comes from his childlike pureness and sincerity.","chinese":"其魅力緣於他的赤子般“純念”和孺子般“真誠”。"},{"english":"DuanMu's \"Earth Complex\" originates from his profound experience towards life.","chinese":"端木蕻良的“土地情結”緣於他深刻的人生體驗。"},{"english":"The intuition on the level of consciousness stems from the application and imagination of knowledge blocks.","chinese":"意識層的直覺緣於知識的組塊化運用和想象。"},{"english":"The reason why Li Ting began to use handkerchief again is an environmental protection research.","chinese":"李婷重新拿起手帕，緣於一項關於環保的調查。"},{"english":"Part of the reason we’re seeing an increase in personal e-mail communication devices is because of the nature of mobile.","chinese":"私人電子郵件交流設備的增長部分緣於移動的本質。"},{"english":"Poetry is the rhythmical creation of beauty in words.","chinese":"詩歌緣於優美詞彙的有節奏性組合，這個解釋很新奇。"},{"english":"It was presumably that that the fans I heard were complaining about.","chinese":"如果沒猜錯，我聽到的那些球迷的抱怨就是緣於此。"},{"english":"The loneliness complex formed in QU Yuans heart because he had been exiled for a long time.","chinese":"屈原孤獨情結緣於屈原遭貶並在長期的貶謫中生成。"},{"english":"The reason for re-mentioning and questioning the Being is that the Being is forgotten.","chinese":"對存在問題的重提和追問緣於存在的被遺忘。"},{"english":"In fact, Honglei Sun into his heart due to Wang Zhiwen.","chinese":"其實孫紅雷走進自己的內心還是緣於王志文。"}],"related":[]}