{"definition":["origin"],"pinyin":["yuan2 qi3"],"simplified":["缘起"],"rank":25357.0,"normalized_rank":0.3547773285016721,"fraction":0.0000014340842062916216,"cumulative_fraction":0.9848106536383802,"word":"緣起","characters":[{"definition":["cause\/reason\/karma\/fate\/predestined affinity\/margin\/hem\/edge\/along"],"pinyin":["yuan2"],"word":"緣"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"Its origin in the tax system in the financial management system implementation.","chinese":"其緣起於分稅制財政管理體制改革的實施。"},{"english":"The origin of the cabinet system of Ming Dynasty could be traced back to the conflicting process between the premier power and the monarchic power.","chinese":"明代內閣制的緣起可追溯至相權與君權的鬥爭過程。"},{"english":"Please tell us about your film, and how the initial idea come about.","chinese":"請談下你們的這部電影，以及緣起吧。"},{"english":"Part one is about the origin and significance of the personal property register.","chinese":"第一部分爲動產物權登記制度的緣起與意義。"},{"english":"In introduction, the author puts forward the reason of the topic and the topical contents.","chinese":"引言部分，提出論文選題的緣起與論題大旨。"},{"english":"The first chapter in the main body elaborates the origin of the United States' Yugoslavian policy.","chinese":"正文的第一章，論述美國的南斯拉夫政策的緣起。"},{"english":"Originated, some waiting to no end.","chinese":"緣起緣滅，有些等待註定沒有結局。"},{"english":"Chapter 1 provides the origin and motive of the study.","chinese":"第一章說明本論文的緣起以及研究動機和目的。"},{"english":"The females procreation adoration is the origin and return of ancient goddess.","chinese":"女性生殖崇拜是上古女神的緣起和皈依。"},{"english":"This essay discusses the evolution background of the researches on political development.","chinese":"本文意在討論政治發展研究緣起的學科沿革背景。"},{"english":"Chapter 1 concerns the origin and planning for the practice of civil right thoughts in Guangxi.","chinese":"第一部分爲民權主義在廣西實踐的緣起與籌劃。"},{"english":"The second part of the system of free proof for the origin and evolution.","chinese":"第二章爲自由心證制度的緣起與沿革。"},{"english":"The case originated in complaint launched by Irish Music Rights Organization (IMRO).","chinese":"本案例緣起於“愛爾蘭音樂權利組織”的一起上訴。"},{"english":"Empires have been created on the basis of a good idea.","chinese":"偉大的帝國的創建常常緣起於一個想法。"},{"english":"The five geographical and Xinyuan, a Tantric On the Origin of the six.","chinese":"這五緣和心緣，構成密宗的六大緣起論。"},{"english":"I like that touch of Youlan horizon, like looking at the sky to see the origins edge off.","chinese":"我喜歡天邊那一抹幽藍，喜歡仰望天空看緣起緣落。"}],"related":[{"definition":["chance\/opportunity\/predestined relationship\/(Buddhist) principal and secondary causes\/chain of cause and effect"],"pinyin":["yin1 yuan2"],"word":"因緣"},{"definition":["to instruct (novices)\/to preach\/to teach\/to reveal"],"pinyin":["kai1 shi4"],"word":"開示"},{"definition":["gate to enlightment (Buddhism)\/Buddhism\/way\/method\/(old) south gate of a palace"],"pinyin":["fa3 men2"],"word":"法門"},{"definition":["anatta (Buddhist concept of \"non-self\")"],"pinyin":["wu2 wo3"],"word":"無我"},{"definition":["a flash of realization\/the truth in a flash\/a moment of enlightenment (usually Buddhist)"],"pinyin":["dun4 wu4"],"word":"頓悟"},{"definition":["to vow"],"pinyin":["fa1 yuan4"],"word":"發願"},{"definition":["to form ties\/to become attached (to sb, sth)"],"pinyin":["jie2 yuan2"],"word":"結緣"},{"definition":["cause\/reason\/karma\/fate\/predestined affinity\/margin\/hem\/edge\/along"],"pinyin":["yuan2"],"word":"緣"},{"definition":["happy\/joyous\/delighted\/to like\/to be fond of"],"pinyin":["huan1 xi3"],"word":"歡喜"},{"definition":["to expound (a position)\/to elaborate (on a topic)\/to treat (a subject)"],"pinyin":["chan3 shu4"],"word":"闡述"},{"definition":["solemn\/dignified\/stately"],"pinyin":["zhuang1 yan2"],"word":"莊嚴"},{"definition":["all\/various","surname Zhu"],"pinyin":["Zhu1","zhu1"],"word":"諸"},{"definition":["and\/to give\/together with","to take part in","variant of 歟|欤[yu2]"],"pinyin":["yu2","yu3","yu4"],"word":"與"},{"definition":["Taoist monastery\/palace gate watchtower\/platform","surname Guan","to look at\/to watch\/to observe\/to behold\/to advise\/concept\/point of view\/outlook"],"pinyin":["Guan4","guan1","guan4"],"word":"觀"},{"definition":["to become enlightened (Buddhism)"],"pinyin":["kai1 wu4"],"word":"開悟"},{"definition":["origin"],"pinyin":["you2 lai2"],"word":"由來"}]}