{"definition":["to establish (a unit or department)\/staffing structure (excluding temporary and casual staff)"],"pinyin":["bian1 zhi4"],"simplified":["编制"],"rank":2026.0,"normalized_rank":0.02834636855875645,"fraction":0.00007532708305804051,"cumulative_fraction":0.7324473606359919,"word":"編制","characters":[{"definition":["to weave\/to plait\/to organize\/to group\/to arrange\/to edit\/to compile\/to write\/to compose\/to fabricate"],"pinyin":["bian1"],"word":"編"},{"definition":["system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4"],"word":"制"}],"containing_words":[{"definition":["having a permanent post\/part of the official staff"],"pinyin":["you3 bian1 zhi4"],"word":"有編制"}],"sentences":[{"english":"Both sets of columns may be indexed, but by different indexes.","chinese":"這兩組列都可以編制索引，但是使用不同的索引。"},{"english":"Now the workout method of pretender is a norm and practical method.","chinese":"目前，標底編制主要採用定額法和實物量法。"},{"english":"Budgeting is something that people either love or hate to do.","chinese":"編制預算對很多人來說是又愛又恨的事情。"},{"english":"A new table of axial capacity parameter of driven pile has been compiled.","chinese":"在此基礎上編制了新的打入樁豎向承載力參數表。"},{"english":"Listing species is the beginning of that essential process, \" Attenborough said in a statement accompanying the report.","chinese":"編制物種名錄是保護物種這一重要進程的開始。"},{"english":"Commercial documents of company is inculcated.","chinese":"公司商業文件的編制。"},{"english":"The computer programs are compiled for statistic program of meteorologic data and the infiltration dynamic energy consumption.","chinese":"編制了氣象數據統計程序和滲風動態能耗計算程序。"},{"english":"A shortcut route has been provided for working out the post-process program of parallel-link machine tools.","chinese":"爲編制虛擬軸機牀數控後處理程序提供一條捷徑。"},{"english":"Objective To develop a self-rating scale of quality of life for convalescent cancer patients.","chinese":"目的編制康復期癌症患者生存質量自評量表。"},{"english":"The paper also expresses its view on a couple of issues concerning the quotation of price preparation for track - laying …","chinese":"筆者就編制鋪軌架樑報價的幾個具體問題提出了看法。"},{"english":"The system hardware circuity and software programming concept are presented in detail.","chinese":"較詳細地敘述了系統硬件電路構成和軟件編制思路。"},{"english":"Manageability is the ability to manipulate the communication system.","chinese":"處置性是操息通訊編制的本領。"},{"english":"And \"change\" refers to unleashing staff potential through deepening reform.","chinese":"改，就是通過深化改革推動機構編制釋放潛力。"},{"english":"Single form site index table was constructed after derived curve was expanded by differential method.","chinese":"用差分法展開導向曲線，編制了單形立地指數表。"},{"english":"She began working when she was 4, collecting grasses that her father wove into mats.","chinese":"當她只有四歲時，便爲編制草蓆的父親蒐集青草。"},{"english":"They can cane ten chairs in a week.","chinese":"他們一個星期能編制十把藤椅。"}],"related":[{"definition":["an overall plan\/to plan an entire project as a whole"],"pinyin":["tong3 chou2"],"word":"統籌"},{"definition":["to work out\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制訂"},{"definition":["to weave\/to plait\/to compile\/to put together (a lesson plan, budget etc)"],"pinyin":["bian1 zhi4"],"word":"編製"},{"definition":["to plan (how to do sth)\/planning\/plan\/program"],"pinyin":["gui1 hua4"],"word":"規劃"},{"definition":["to audit\/to investigate thoroughly"],"pinyin":["shen3 he2"],"word":"審核"},{"definition":["function\/role"],"pinyin":["zhi2 neng2"],"word":"職能"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"審查"},{"definition":["to construct\/to build\/infrastructure\/architecture\/framework"],"pinyin":["jia4 gou4"],"word":"架構"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"規範"},{"definition":["to cultivate\/to train\/to groom\/training"],"pinyin":["pei2 xun4"],"word":"培訓"},{"definition":["to implement\/to carry out\/to execute\/to run"],"pinyin":["zhi2 xing2"],"word":"執行"},{"definition":["to coordinate\/to harmonize\/to fit together\/to match (colors etc)\/harmonious\/concerted"],"pinyin":["xie2 tiao2"],"word":"協調"},{"definition":["to organize\/to set up\/to establish"],"pinyin":["zu3 jian4"],"word":"組建"},{"definition":["category"],"pinyin":["fan4 chou2"],"word":"範疇"},{"definition":["person\/employee\/member"],"pinyin":["yuan2"],"word":"員"},{"definition":["according to\/based on\/basis\/foundation\/CL:個|个[ge4]"],"pinyin":["gen1 ju4"],"word":"根據"}]}