{"definition":["buffer (computer science)"],"pinyin":["huan3 chong1 qi4"],"simplified":["缓冲器"],"rank":45214.0,"normalized_rank":0.6326025212317938,"fraction":2.3341822535222955e-7,"cumulative_fraction":0.9980701962097529,"word":"緩衝器","characters":[{"definition":["slow\/unhurried\/sluggish\/gradual\/not tense\/relaxed\/to postpone\/to defer\/to stall\/to stave off\/to revive\/to recuperate"],"pinyin":["huan3"],"word":"緩"},{"definition":["powerful\/vigorous\/pungent\/towards\/in view of","thoroughfare\/to go straight ahead\/to rush\/to clash"],"pinyin":["chong1","chong4"],"word":"衝"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[],"sentences":[{"english":"The same logic used to load the register is used to enable the tri-state buffers instead.","chinese":"裝載寄存器的邏輯同樣用於使能三態緩衝器。"},{"english":"The fetcher also generates a search address for output to the branch target buffer.","chinese":"指令讀取器亦產生搜尋位址輸出至分支目標緩衝器中。"},{"english":"Computers record in ation in the buffer .","chinese":"計算機在緩衝器中記錄信息。"},{"english":"Decompression routine needs some free space to use as a temporary buffer following the kernel image in RAM.","chinese":"是壓縮過得，而解壓縮函數需要一些空間作爲緩衝器。"},{"english":"Don't count on the bumper to hold up during a low-speed collision.","chinese":"別指望緩衝器會在低速碰撞時減緩衝擊。"},{"english":"The application of TOC in project management is called Critical Chain Project Management ( CCPM) , which controls the project by critical chain and buffer.","chinese":"它通過項目的關鍵鏈，並利用緩衝器來進行項目管理。"},{"english":"The bumper is below the two beams sticking out of the front.","chinese":"緩衝器位於前面的兩道橫樑之下。"},{"english":"The column must be pre-equilibrated in binding buffer before beginning sample application.","chinese":"列必須在開端抽樣應用之前在捆綁的緩衝器中被平衡。"},{"english":"Users who already purchased a bumper will be eligible for a refund.","chinese":"已經購買了手機緩衝器的用戶可以申請退款。"},{"english":"Don't count on the bumper to hold up during a low-speed collision.","chinese":"千萬別指望在低速碰撞中緩衝器會起到什麼作用。"},{"english":"Thus you needed to modify what was written into the buffer.","chinese":"因此您需要決定，在緩衝器中寫進什麼內容。"},{"english":"The V-shaped squeegee assembly is robust and equipped with bumpers .","chinese":"型的橡膠滾軸工作起來動力十足還裝有緩衝器。"},{"english":"The puppet buffer state keeps South Korea’s democracy far from China’s border.","chinese":"這個傀儡緩衝器可以讓韓國民主遠離中國邊界。"},{"english":"A static jitter buffer is hardware-based and is configured by the manufactures.","chinese":"靜態抖動緩衝器是基於硬件的，它是由廠家來配置的。"}],"related":[]}