{"definition":["woof (horizontal thread in weaving)\/weft"],"pinyin":["wei3 sha1"],"simplified":["纬纱"],"rank":55826.0,"normalized_rank":0.7810781693786465,"fraction":7.386467919213767e-8,"cumulative_fraction":0.9995774795832396,"word":"緯紗","characters":[{"definition":["latitude\/woof (horizontal thread in weaving)\/weft"],"pinyin":["wei3"],"word":"緯"},{"definition":["cotton yarn\/muslin"],"pinyin":["sha1"],"word":"紗"}],"containing_words":[],"sentences":[{"english":"The projectile loom uses a projectile with grippers to carry the yarn through the shed.","chinese":"片梭織機使用一個帶有夾子的片梭將緯紗引過梭口。"},{"english":"Based on this, the method of weft tension controller was introduced.","chinese":"在此基礎上，給出緯紗張力控制器的實現方法。"},{"english":"The device used to weave together warp and weft threads is called a loom.","chinese":"用於編織在一起經紗和緯紗的設備被稱爲一臺織布機。"},{"english":"The term weft is taken from weaving terminology.","chinese":"緯紗這一術語是來自機織工藝。"},{"english":"The function of a filling stop motion is to stop the loom when filling is not present.","chinese":"緯停機構的作用是在沒有緯紗時使織機停車。"},{"english":"The production of PET elastomeric yarns was introduced.","chinese":"紹了子午胎簾子布用滌綸彈力緯紗的製造技術。"},{"english":"The performance of weft yarns of coarse, medium and fine count from different mills is studied.","chinese":"研究了不同工廠的高中低支緯紗的性能。"},{"english":"The skewness or bending of Weft yarn is unavoidable in finishing process of printing and dyeing.","chinese":"織物在印染過程中，緯紗歪斜或彎曲是不可避免的。"},{"english":"A device called a shuttle carries the filling through the shed and so forms the crosswise yarns of the fabric.","chinese":"一種裝置叫梭子攜帶緯紗穿過梭口形成紗線交織的布。"},{"english":"A weaver uses the weft threads to create individual areas of color.","chinese":"織布使用緯紗的色彩創造的個別地區。"},{"english":"The bobbins are placed in a shuttle which carries the weft thread through the shed .","chinese":"該線軸被放置在一個航天飛機載有與通過棚緯紗。"},{"english":"The selection of twist for weft is much important in design and production.","chinese":"認爲在設計和生產過程中，緯紗捻度的選擇較爲重要。"},{"english":"A pick is a single weft thread, hence the term.","chinese":"一個緯紗是一根單緯線，故有此名。"}],"related":[]}