{"definition":["to indulge\/to connive at"],"pinyin":["zong4 rong2"],"simplified":["纵容"],"rank":14607.0,"normalized_rank":0.20437088131182404,"fraction":0.000004343126354396206,"cumulative_fraction":0.9573658402805886,"word":"縱容","characters":[{"definition":["warp (the vertical threads in weaving)\/vertical\/longitudinal\/north-south (lines of longitude)\/lengthwise\/to release\/to indulge\/even if"],"pinyin":["zong4"],"word":"縱"},{"definition":["surname Rong","to hold\/to contain\/to allow\/to tolerate\/appearance\/look\/countenance"],"pinyin":["Rong2","rong2"],"word":"容"}],"containing_words":[],"sentences":[{"english":"These lunches, though, are where the pampering begins and ends.","chinese":"這些午餐，雖然，是縱容開始和結束的地方。"},{"english":"Let's not mollycoddle our students!","chinese":"我們不能縱容學生。"},{"english":"However, I found that it just connived PTB.","chinese":"但是，我發現這樣恰恰縱容了PTB。"},{"english":"\"I decided it was better for me to break that promise than to endorse the lie, \" he says.","chinese":"“我認爲寧肯我食言也不能縱容撒謊，”他說。"},{"english":"The Chinese government is deliberately or not condoned by the mob and prevent fragmentation mutilations?","chinese":"或者是中國政府故意不出來阻止而縱容暴徒虐殺不成？"},{"english":"\" The wise man, humoring him, said, \"Be a cutter.","chinese":"智者縱容着他說，“去做採石匠吧。”"},{"english":"He connived at letting the prisoner escape from prison.","chinese":"他縱容那個囚犯越獄。"},{"english":"The general is accused of conniving in a plot to topple the government.","chinese":"將軍被指控縱容一個顛覆政府的陰謀。"},{"english":"Society as a whole also connives in the denial.","chinese":"社會上普遍存在縱容剝奪權利的現象。"},{"english":"He indulges his son with plenty of pocket money.","chinese":"他縱容他的兒子，給他許多零用錢。"},{"english":"The Asians’ parsimony made the Anglo-Saxons’ profligacy possible.","chinese":"亞洲人的節儉縱容了歐美人的揮霍。"},{"english":"And Parents should tolerant such wrong behaviors, but not indulge them.","chinese":"父母對孩子犯錯應抱寬容的態度，但不能縱容。"},{"english":"Don't pamper damp scamp tramp s that camp under ramp lamps.","chinese":"不能縱容在斜坡燈下踐踏潮溼露營地的流氓。"},{"english":"Too low a credit-loss cost may connive \"the spoilt children\".","chinese":"失信成本過低會縱容“壞孩子”。"},{"english":"Instead of badgering him about why he's so busy, try pampering him a bit.","chinese":"與其和他爭吵爲什麼他怎麼忙，不如多縱容他一下。"},{"english":"Nevertheless, forgiving need not equal to conniving the mistake either.","chinese":"然而，原諒也並不等於縱容一個錯誤。"}],"related":[{"definition":["to blame\/to rebuke"],"pinyin":["ze2 guai4"],"word":"責怪"},{"definition":["to ignore\/to neglect\/to treat with contempt"],"pinyin":["mo4 shi4"],"word":"漠視"},{"definition":["lit. change to more severe (idiom); to become more intense (esp. of shortcoming)\/to aggravate\/to intensify"],"pinyin":["bian4 ben3 jia1 li4"],"word":"變本加厲"},{"definition":["unduly\/excessive"],"pinyin":["guo4 fen4"],"word":"過份"},{"definition":["to conflict\/to contradict"],"pinyin":["di3 chu4"],"word":"抵觸"},{"definition":["to submit to humiliation (idiom); to suffer in silence\/to swallow one's anger\/to grin and bear it"],"pinyin":["ren3 qi4 tun1 sheng1"],"word":"忍氣吞聲"},{"definition":["to turn a blind eye to\/to ignore"],"pinyin":["shi4 er2 bu4 jian4"],"word":"視而不見"},{"definition":["as it should be by rights (idiom); proper and to be expected as a matter of course\/inevitable and right"],"pinyin":["li3 suo3 dang1 ran2"],"word":"理所當然"},{"definition":["to feel grateful to sb\/to appreciate the kindness"],"pinyin":["ling3 qing2"],"word":"領情"},{"definition":["contempt\/contemptuous\/to despise\/to scorn\/scornful"],"pinyin":["qing1 shi4"],"word":"輕視"},{"definition":["to conspire"],"pinyin":["tu2 mou2"],"word":"圖謀"},{"definition":["not to hear, not to question (idiom)\/to show no interest in sth\/uncritical\/not in the least concerned"],"pinyin":["bu4 wen2 bu4 wen4"],"word":"不聞不問"},{"definition":["to move aside\/to get out of the way\/to back down\/to concede"],"pinyin":["tui4 rang4"],"word":"退讓"},{"definition":["hot-headed\/impulsive\/reckless"],"pinyin":["lu3 mang3"],"word":"魯莽"},{"definition":["absolutely unrestrained\/unbridled\/without the slightest scruple"],"pinyin":["si4 wu2 ji4 dan4"],"word":"肆無忌憚"},{"definition":["to make reprisals\/to retaliate\/revenge\/retaliation"],"pinyin":["bao4 fu4"],"word":"報復"}]}