{"definition":["lit. warp string in weaving\/fig. vertical or north-south lines\/to pass through\/to cross lengthwise\/to pierce (esp. north-south or top-to-bottom)"],"pinyin":["zong4 guan4"],"simplified":["纵贯"],"rank":32956.0,"normalized_rank":0.4610971975431282,"fraction":7.25070872623217e-7,"cumulative_fraction":0.9926922535816024,"word":"縱貫","characters":[{"definition":["warp (the vertical threads in weaving)\/vertical\/longitudinal\/north-south (lines of longitude)\/lengthwise\/to release\/to indulge\/even if"],"pinyin":["zong4"],"word":"縱"},{"definition":["to pierce through\/to pass through\/to be stringed together\/string of 1000 cash"],"pinyin":["guan4"],"word":"貫"}],"containing_words":[],"sentences":[{"english":"Longitudinalcheng he solid throughout, folding fighting snake river, tortuous.","chinese":"固城河縱貫全境，河道斗折蛇行，迂迴曲折。"},{"english":"The new main north-south road in Belize was cut through the forest only four or five miles away.","chinese":"一條縱貫伯利茲南北的路就在四五英里外橫穿森林。"},{"english":"The meandering River Yi, such as the inlaid jade belt, that runs its length throughout, with Aura.","chinese":"蜿蜒的沂河，如鑲嵌的玉帶，縱貫全境，充滿靈氣。"},{"english":"A colorful history of coins and currency from their very beginnings.","chinese":"一部圖文並茂的錢幣史，縱貫古今，精彩紛呈。"},{"english":"Dnieper north-south central part of the shipping lines and major industrial and agricultural water.","chinese":"第聶伯河縱貫中部，是航運幹線和工農業主要水源。"},{"english":"Since ancient times, there are floods, droughts and the pier, Beijing-Hangzhou Grand Canal longitudinal throughout.","chinese":"自古有水旱碼頭之稱，京杭大運河縱貫全境。"},{"english":"The city is cut by the Beijing-Hangzhou Grand Canal from north to south.","chinese":"京杭大運河縱貫蘇州南北，交通十分方便。"},{"english":"Kindly make the shipment by cross fast freight , and charge the cost to our account .","chinese":"懇請採用縱貫鐵路快車貨運，費由敝公司負擔。"}],"related":[]}