{"definition":["to survey comprehensively\/an overall survey"],"pinyin":["zong4 guan1"],"simplified":["纵观"],"rank":12537.0,"normalized_rank":0.1754088956668952,"fraction":0.000005690791805585564,"cumulative_fraction":0.9470897496169718,"word":"縱觀","characters":[{"definition":["warp (the vertical threads in weaving)\/vertical\/longitudinal\/north-south (lines of longitude)\/lengthwise\/to release\/to indulge\/even if"],"pinyin":["zong4"],"word":"縱"},{"definition":["Taoist monastery\/palace gate watchtower\/platform","surname Guan","to look at\/to watch\/to observe\/to behold\/to advise\/concept\/point of view\/outlook"],"pinyin":["Guan4","guan1","guan4"],"word":"觀"}],"containing_words":[],"sentences":[{"english":"Throughout their history, the pyramids of Giza have stimulated human imagination.","chinese":"縱觀歷史，吉薩金子塔激發了人類的想象。"},{"english":"This's our opportunity to step back.","chinese":"那樣我們纔可以縱觀全局。"},{"english":"Throughout Shu-shan Wen-hai, with regard to the interpretation of love can be described are mixed.","chinese":"縱觀書山文海，關於愛情的詮釋可謂是衆說紛紜。"},{"english":"Throughout the world, more people are killed by mosquito-borne illness than any other factor.","chinese":"縱觀世界，更多的人死於由蚊蠅引發的疾病。"},{"english":"Comparing it with other works of the same genre in the history, people can find its characteristics of inheritance and improvement.","chinese":"縱觀歷史上同類題材，自能發現它的繼承和超越之處。"},{"english":"On the whole, the spatial relationship is the key of the western art history.","chinese":"縱觀西方美術史，空間關係歷來是畫面關係的重點。"},{"english":"By means of this software, called Multi-Media Education Control System abbrev.","chinese":"縱觀現有的多媒體教學軟件，均缺少控制。"},{"english":"But, despite huge upheavals in the world, little has altered.","chinese":"縱觀國際社會亂象紛生，聯合國卻幾乎一成不變。"},{"english":"The underneath is the standpoint that the water demon takes a wide view some movie review a collection editor.","chinese":"下面是水妖縱觀一些影評蒐集編輯的觀點。"},{"english":"Review whole bedroom, profusion colour is wanton jump move, harmonious and not messy.","chinese":"縱觀整個居室，繽紛色彩肆意躍動，和諧而不零亂。"},{"english":"Withallthedeals last year, in vestment investment banks did well.","chinese":"縱觀去年所有鉸易，投資銀行做得很好。"},{"english":"Throughout modern history, technological breakthroughs regularly surpass the people who invent them.","chinese":"縱觀整個現代史，技術突破時常超過發明技術的人類。"},{"english":"Seeing my whole education history, I have many teachers.","chinese":"縱觀我整個受教育史，我有過很多老師。"},{"english":"M usic's interconnection with society can be seen throughout history.","chinese":"縱觀歷史，音樂的社會互聯作用隨處可見。"},{"english":"Throughout Zong 's life, the most glorious is to recover 1\/6 of the national territories.","chinese":"縱觀左宗棠的一生，最輝煌的是收復六分之一的國土。"},{"english":"Historically, of course, this makes a lot of sense.","chinese":"縱觀歷史，這些當然有很大的意義。"}],"related":[]}