{"definition":["to leap\/to spring\/to throw oneself"],"pinyin":["zong4 shen1"],"simplified":["纵身"],"rank":23181.0,"normalized_rank":0.3243322653309641,"fraction":0.0000017517315223431859,"cumulative_fraction":0.9813577998691038,"word":"縱身","characters":[{"definition":["warp (the vertical threads in weaving)\/vertical\/longitudinal\/north-south (lines of longitude)\/lengthwise\/to release\/to indulge\/even if"],"pinyin":["zong4"],"word":"縱"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"}],"containing_words":[],"sentences":[{"english":"She cries out to Scarpia and leaps from the battlement.","chinese":"她厲聲呼喊迫卡皮亞，並從城垛上縱身一躍。"},{"english":"He leapt up from his concealment, but he cowered back.","chinese":"他從隱蔽處縱身跳出，但又馬上退了回來。"},{"english":"Host poling in hands, Mengke threw himself on the horse, feeling full of strength.","chinese":"手持套馬杆，縱身躍上馬背，孟克覺得自己充滿力量。"},{"english":"With a shout of fury Hagrid launched himself off the bike at the Death Eater;","chinese":"海格怒吼一聲，縱身跳出摩托車，朝那個食死徒撲去。"},{"english":"He ran to the edge of the swimming pool and plunged in.","chinese":"他跑到游泳池邊，一縱身跳進水裏。"},{"english":"He swings down into the water.","chinese":"他縱身一躍跳進了水中。"},{"english":"Are you ready to jump?","chinese":"你準備好了縱身一躍嗎？"},{"english":"He swung himself into the saddle.","chinese":"他縱身跨上馬鞍。"},{"english":"I jumped up , pushed the boat under the water with my feet , and caught one of the ship's ropes .","chinese":"我縱身一跳，把小船踩入水中，抓住大船的一根纜繩。"},{"english":"The swimmer ran to the side of the swimming pool and dived off.","chinese":"那游泳者奔到游泳池邊，縱身跳下。"},{"english":"He dashed along the platform and jumped on the train.","chinese":"他沿站臺猛跑，縱身跳上火車。"},{"english":"She sprang to the door with alacrity.","chinese":"她輕捷地一縱身向門口跳去。"},{"english":"Another man then ran to the river and jumped on the log with Darrell.","chinese":"另一個船工跑向河邊，縱身一躍和達瑞爾站在了一起。"},{"english":"The truth throws itself into the abyss when Oedipus resolves the enigma.","chinese":"真理自己縱身跳入深淵，當伊底普斯解答這個謎團。"},{"english":"He swung himself over the fence.","chinese":"他縱身一躍跳過了籬笆。"},{"english":"Bottom of trouser-leg, bound up a drastic son fixed go into pond in.","chinese":"了褲腳，縱身一個猛子扎入水塘中。"}],"related":[]}