{"definition":["column\/file\/CL:列[lie4],路[lu4]"],"pinyin":["zong4 dui4"],"simplified":["纵队"],"rank":26463.0,"normalized_rank":0.37025170344046,"fraction":0.0000012975951251757152,"cumulative_fraction":0.9863193084716672,"word":"縱隊","characters":[{"definition":["warp (the vertical threads in weaving)\/vertical\/longitudinal\/north-south (lines of longitude)\/lengthwise\/to release\/to indulge\/even if"],"pinyin":["zong4"],"word":"縱"},{"definition":["squadron\/team\/group\/CL:個|个[ge4]"],"pinyin":["dui4"],"word":"隊"}],"containing_words":[{"definition":["fifth column (subversive group)"],"pinyin":["di4 wu3 zong4 dui4"],"word":"第五縱隊"}],"sentences":[{"english":"Every morning young pioneers go to school in file.","chinese":"每天早晨少先隊員們排着兩列縱隊去上學。"},{"english":"Some are under cover forming the enemys fifth column.","chinese":"有些是祕密的這就是敵人的第五縱隊。"},{"english":"The PLA men launched a converging attack on the enemy force in many column.","chinese":"人民解放軍對敵人的多個縱隊進行了集中兵力的進攻。"},{"english":"The column was four abreast.","chinese":"他們並排成四路縱隊。"},{"english":"The smaller male leads a female on a single file march.","chinese":"這隻較小的雄性領着一隻雌性列成縱隊前進。"},{"english":"In columns rise and fall to the undulations of the ground.","chinese":"縱隊起伏哪怕灰壕泥波弄髒咱的身。"},{"english":"A popular longways is called the Virginia reel.","chinese":"其中一種流行的縱隊舞叫維吉尼亞里爾舞。"},{"english":"Shandong encirclement and suppression of column of the strategic plan is in abeyance.","chinese":"圍剿的山東縱隊的戰略計劃暫時擱置。"},{"english":"Use five or six columns to hold off and attack enemy reinforcements.","chinese":"以五個至六個縱隊，擔任阻援和打援。"},{"english":"Standard of Mongolia the field battle troops be ridden soldier's column of troops by 3 to constitute.","chinese":"標準的蒙古野戰部隊由三個騎兵縱隊組成。"},{"english":"Behind the vanguard were 38 columns guarding 38 four-horse chariots.","chinese":"在前鋒的後面是38列縱隊，護衛着38輛四馬戰車。"},{"english":"Terry's column was to join him in two days.","chinese":"泰瑞的縱隊將於兩天之後加入他。"},{"english":"All our columns are composed solely of old soldiers.","chinese":"我們所有的縱隊全是由老戰士組成。"},{"english":"Waves of rocket-carrying aircraft pounded at the enemy columns.","chinese":"一批批攜帶火箭的飛機不斷轟擊敵人的縱隊。"},{"english":"When running with a group in a very busy area, run single file.","chinese":"如果是與團隊奔跑在一繁忙的街區，要排成一列縱隊。"}],"related":[]}