{"definition":["must\/have to\/be bound to"],"pinyin":["zong3 dei3"],"simplified":["总得"],"rank":19927.0,"normalized_rank":0.2788045835490325,"fraction":0.0000024137400601620483,"cumulative_fraction":0.974662678341268,"word":"總得","characters":[{"definition":["always\/to assemble\/gather\/total\/overall\/head\/chief\/general\/in every case"],"pinyin":["zong3"],"word":"總"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[],"sentences":[{"english":"Somebody gonna do something about the gophers.","chinese":"總得有人想法子對付地鼠。"},{"english":"'There's got to be a little gallows humor to get you through the day,' Mr. Obama said.","chinese":"奧巴馬說，總得有點兒黑色幽默讓人們撐下去。"},{"english":"The chrysanthemum are all ready. They deserve to bloom once.","chinese":"菊花都繡好了，總得開一回。"},{"english":"Prince Henry They say, madam, it takes one to know one.","chinese":"亨利王子夫人，人們常說總得花時間去了解一個人。"},{"english":"The downside of fiscal stimulus is that someone must pay for it.","chinese":"財政刺激方案的唯一壞處就是總得有人買單。"},{"english":"A life, he will have to express some emotion.","chinese":"人生在世，總得發表一些感慨。"},{"english":"The thing about candles and being outside is that you always have to keep wind in mind.","chinese":"在室外使用蠟燭的時候，你總得留意風勢。"},{"english":"You always have to revert back to the English.","chinese":"你總得還原到英語。"},{"english":"There are twenty-four hours in each day, and I must spend them somehow.","chinese":"每天有二十四小時，總得很過去的。"},{"english":"The scores for all behaviours were then added to derive an overall lifestyle score.","chinese":"最後，將所有行爲的得分相加，獲得生活方式總得分。"},{"english":"Our team holds the record for total points scored.","chinese":"我們隊保持着總得分的最高記錄。"},{"english":"The larger issue is one of equality.","chinese":"總得平等的對待問題的雙方。"},{"english":"Sometimes, you should control your temper.","chinese":"有時候，你總得控制自己的脾氣。"},{"english":"In conclusion, what does this mean for our media business?","chinese":"總得來說，這對於媒體產業意味着什麼？"},{"english":"A spider has to pick up a living somehow or other, and I happen to be a trapper.","chinese":"蜘蛛總得想辦法活下去啊，碰巧我是一個結網捉蟲的。"},{"english":"We gotta get everything set up and then we can come out in the open.","chinese":"咱們總得把一切都準備妥當了，才能公開出頭露面。"}],"related":[]}