{"definition":["eventually\/after all\/anyhow"],"pinyin":["zong3 gui1"],"simplified":["总归"],"rank":28036.0,"normalized_rank":0.39226001427112334,"fraction":0.000001123297838702568,"cumulative_fraction":0.98822143753146,"word":"總歸","characters":[{"definition":["always\/to assemble\/gather\/total\/overall\/head\/chief\/general\/in every case"],"pinyin":["zong3"],"word":"總"},{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"歸"}],"containing_words":[],"sentences":[{"english":"There have been many proposals, but all share two features.","chinese":"提案已然數不勝數，但總歸有兩個共同點。"},{"english":"No love is always the wind, hold thousands of times will go.","chinese":"得不到的愛人總歸是風，強留千百次也終究會走。"},{"english":"The food will be horrible, as it always is for astronauts.","chinese":"食物可能也比較糟糕，因爲總歸是爲宇航員準備的。"},{"english":"Sometimes they are hard solutions, but they always have a solution.","chinese":"有時它們很難解決，但總歸有解決方案。"},{"english":"The object of curious dent disorderly total being, can not mention the letter always returns not is reserve at a polite distance.","chinese":"怪力亂神的東西，不能說不信，總歸是敬而遠之。"},{"english":"We will always shake hands and past.","chinese":"我們總歸都會和過往握手言和。"},{"english":"But look closer. There is always a payoff.","chinese":"但是請仔細想想，回報總歸是有的。"},{"english":"Besides, girls aren't going to like you for awhile anyway.","chinese":"另外，女孩子們在那時候總歸不會喜歡你的。"},{"english":"Sailors being sailors, they like to push the boat as much as they can.","chinese":"水手總歸是水手，他們喜歡讓船航行得儘可能遠些。"},{"english":"The answer is always going to be zero.","chinese":"那個答案總歸是。"},{"english":"The fledglings are always small potatoes.","chinese":"菜鳥總歸是小菜嘛。"}],"related":[]}