{"definition":["computer bus"],"pinyin":["zong3 xian4"],"simplified":["总线"],"rank":9055.0,"normalized_rank":0.12669119807479748,"fraction":0.00000981422183155456,"cumulative_fraction":0.9212080598703604,"word":"總線","characters":[{"definition":["always\/to assemble\/gather\/total\/overall\/head\/chief\/general\/in every case"],"pinyin":["zong3"],"word":"總"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"}],"containing_words":[{"definition":["data bus (computer)"],"pinyin":["shu4 ju4 zong3 xian4"],"word":"數據總線"},{"definition":["(computing) front-side bus (FSB)"],"pinyin":["qian2 duan1 zong3 xian4"],"word":"前端總線"},{"definition":["Universal Serial Bus, USB (computer)"],"pinyin":["tong1 yong4 chuan4 xing2 zong3 xian4"],"word":"通用串行總線"}],"sentences":[{"english":"A design of high speed backplane bus is introduced in this paper.","chinese":"介紹了一個高速背板總線的設計嘗試。"},{"english":"A list of the bus destinations that are currently defined displays.","chinese":"此時將顯示當前定義的總線目的地的列表。"},{"english":"Good reliability-It takes advantage of fieldbus technique and error code test function.","chinese":"高可靠性，它採用了現場總線技術並有誤碼效驗功能。"},{"english":"They think this is how authentication to the bus should work.","chinese":"他們認爲這是對總線進行身份驗證應有的工作方式。"},{"english":"This paper introduces a bus- based flammable gases monitor system.","chinese":"本文介紹了一種總線式可燃性氣體監測系統。"},{"english":"A suit of CAN bus based on the existed intelligence control instruments is presented.","chinese":"介紹了利用現有控溫儀表構建一套CAN總線系統。"},{"english":"Deploy a bus service and a decompression filter for the Bus off-ramp.","chinese":"爲總線出站部署一個總線服務和一個解壓縮過濾器。"},{"english":"Deploy a bus service and a decompression filter for the Bus off-ramp.","chinese":"爲總線出站部署一個總線服務和一個解壓縮過濾器。"},{"english":"The VME bus data collecting system is studied in the paper.","chinese":"本論文旨在研究VME總線數據採集系統。"},{"english":"The butcher follows the dog into the bus.","chinese":"殘殺者按照牽轉具進總線之內。"},{"english":"Choose the server or cluster to add the bus from the drop down menu.","chinese":"從下拉菜單中選擇要添加到總線的服務器或集羣。"},{"english":"This prevents any possible lockup problems that might occur on the two-wire bus.","chinese":"這就避免了兩總線上發生可能鎖定的問題。"},{"english":"A hardware design of bus control module in OBS edge node is reported.","chinese":"給出了一種OBS邊緣節點總線控制的硬件設計方案。"},{"english":"An alarm system for residence district based on CAN-bus is proposed.","chinese":"提出了一種基於CAN總線的住宅小區安防系統。"},{"english":"In chapter two, describes hardware system design of the network-stye instrument bus.","chinese":"第二章闡述網絡式儀器總線硬件平臺的設計。"},{"english":"This system is so designed as to make a two-circuit structure with a cyclic time of 208 millimicroseconds.","chinese":"該系統設計成循環時間爲208毫微秒的雙總線結構。"}],"related":[]}