{"definition":["terminus"],"pinyin":["zong3 zhan4"],"simplified":["总站"],"rank":13786.0,"normalized_rank":0.1928840261357436,"fraction":0.0000048064593420559785,"cumulative_fraction":0.953626333019021,"word":"總站","characters":[{"definition":["always\/to assemble\/gather\/total\/overall\/head\/chief\/general\/in every case"],"pinyin":["zong3"],"word":"總"},{"definition":["station\/to stand\/to halt\/to stop\/branch of a company or organization\/website"],"pinyin":["zhan4"],"word":"站"}],"containing_words":[],"sentences":[{"english":"This is the photo of bus station exit.","chinese":"這是火車東站的汽車總站出口。"},{"english":"A river port and a bus terminal are joint together in one building built in a shape of a ship.","chinese":"這是河港與巴士總站相連成船舶狀的建築物。"},{"english":"Sun Yinghong, the vice station master of municipal hydrological monitoring station said, it's a misunderstanding.","chinese":"市水文監測總站副站長孫映宏說，這其實是一種誤區。"},{"english":"The waste water was piped up from the sub-stations to the central station for cleaning.","chinese":"污水通過管道從分站向上輸送到總站去淨化。"},{"english":"And we were invited to have hot pot in Jiafu Hot Pot near to the bus station.","chinese":"當天晚上她請我們在總站旁邊的家福火鍋喫飯。"},{"english":"In the afternoon the buses fill up from the terminal at Ngong Ping.","chinese":"下午在昂坪的總站公共汽車上總會坐滿人。"},{"english":"It is located at ground floor near the public transport terminus and is accessible from Yi Nam Road.","chinese":"位於地下近公共交通總站，可由怡南路前往。"},{"english":"It connects Light Rail Transit terminus and West Rail Station at the first floor.","chinese":"在一樓連接輕便鐵路總站及西鐵站。"},{"english":"We parted company at the bus terminal.","chinese":"我們是在公共汽車總站分手的。"},{"english":"The traffic is smoothly around here, that the factory is just 500 meters away from Zhongshan City Official Bus Station.","chinese":"工廠距離中山市汽車總站僅500米，交通非常便利。"},{"english":"My own house feels as filthy and chaotic as a bus terminal.","chinese":"我自己的房子感覺和公共汽車總站一樣污濁混亂。"},{"english":"PC will be provided by CowieStation for this competition.","chinese":"科衛總站將提供一部電腦供參賽者比賽。"},{"english":"It is a five-minute walk from the bus No. 5 bus terminus .","chinese":"從5路公共汽車總站起，走路只要5分鐘。"},{"english":"Do not see the faces of victory I Termini on the losing side.","chinese":"看不到時間勝利的臉，我總站在輸的一方。"},{"english":"He insisted on seeing me to the bus tenminal","chinese":"他堅持把我送到公共汽車總站。"},{"english":"My home is close to a bus terminal.","chinese":"我家離公共汽車總站很近。"}],"related":[{"definition":["website"],"pinyin":["zhan4 dian3"],"word":"站點"},{"definition":["\"through train\" (refers to the idea of retaining previous legislature after transition to Chinese rule in Hong Kong or Macao)"],"pinyin":["zhi2 tong1 che1"],"word":"直通車"},{"definition":["to transfer\/to change trains, buses etc"],"pinyin":["zhuan3 cheng2"],"word":"轉乘"},{"definition":["bus\/abbr. for 公共汽車|公共汽车[gong1 gong4 qi4 che1]\/car belonging to an organization and used by its members (government car, police car, company car etc)\/abbr. for 公務用車|公务用车[gong1 wu4 yong4 che1]"],"pinyin":["gong1 che1"],"word":"公車"},{"definition":["parking lot\/car park"],"pinyin":["ting2 che1 chang3"],"word":"停車場"},{"definition":["Wan Chai district of Hong Kong"],"pinyin":["Wan1 Zai3"],"word":"灣仔"},{"definition":["Tuen Mun district of New Territories, Hong Kong"],"pinyin":["Tun2 Men2"],"word":"屯門"},{"definition":["shuttle bus ferrying passengers between train stations on two different rail lines"],"pinyin":["jie1 bo2 che1"],"word":"接駁車"},{"definition":["Tianqiao district of Jinan city 濟南市|济南市[Ji3 nan2 shi4], Shandong\/Tianqiao district in Beijing, formerly a center of folk culture","overhead walkway\/pedestrian bridge"],"pinyin":["Tian1 qiao2","tian1 qiao2"],"word":"天橋"},{"definition":["dock\/pier\/wharf\/CL:個|个[ge4]"],"pinyin":["ma3 tou2"],"word":"碼頭"},{"definition":["to change train (plane, bus etc)\/transfer between modes of transport"],"pinyin":["huan4 cheng2"],"word":"換乘"},{"definition":["itinerary\/route\/political line (e.g. right revisionist road)\/CL:條|条[tiao2]"],"pinyin":["lu4 xian4"],"word":"路線"},{"definition":["departure (of a coach or train)\/to dispatch a vehicle"],"pinyin":["fa1 che1"],"word":"發車"},{"definition":["subway\/metro"],"pinyin":["di4 tie3"],"word":"地鐵"},{"definition":["light rail\/transit system (underground, at street level or elevated)\/streetcar\/metro\/abbr. for 輕型軌道交通|轻型轨道交通[qing1 xing2 gui3 dao4 jiao1 tong1]"],"pinyin":["qing1 gui3"],"word":"輕軌"},{"definition":["to access\/to transfer passengers between two railway lines"],"pinyin":["jie1 bo2"],"word":"接駁"}]}