{"definition":["total energy"],"pinyin":["zong3 neng2"],"simplified":["总能"],"rank":10071.0,"normalized_rank":0.14090635624641473,"fraction":0.000008173725260880169,"cumulative_fraction":0.9302810325668388,"word":"總能","characters":[{"definition":["always\/to assemble\/gather\/total\/overall\/head\/chief\/general\/in every case"],"pinyin":["zong3"],"word":"總"},{"definition":["can\/to be able to\/might possibly\/ability\/(physics) energy","surname Neng"],"pinyin":["Neng2","neng2"],"word":"能"}],"containing_words":[],"sentences":[{"english":"Patients did not always get the correct medication.","chinese":"病人並非總能拿到正確的藥物。"},{"english":"I was always able to figure out more or less where he was.","chinese":"我總能多多少少地找到他在哪裏。"},{"english":"But high taxes do not always mean expensive cigarettes.","chinese":"高額菸草稅不總能讓煙價高不可攀。"},{"english":"We are flexible at all times to meet and exceed customers' needs.","chinese":"我們總能夠靈活機動以保證滿足客戶的需求。"},{"english":"One can no longer walk the streets without seeing beggars importuning passers by.","chinese":"走在街上總能看到乞丐糾纏行人乞討。"},{"english":"Ice cream always makes his mouth  water.","chinese":"冰淇淋總能讓他饞得淌口水。"},{"english":"Those activities always attract kids to use the Internet for a while or all night long.","chinese":"這些活動總能吸引孩子們使用互聯網的同時，或通夜。"},{"english":"Because you get to hear which side will win.","chinese":"你總能聽到哪一方將會獲勝的消息。"},{"english":"People always believe that self-criticism, self-recognition is not.","chinese":"自我批評總能讓人相信，自我表揚則不然。"},{"english":"NIKOLAY DAVYDENKO: Shock, maybe just for press shocked, because Nadal always winning here.","chinese":"很雷，但是是壓迫的雷，因爲納達爾在這兒總能贏。"},{"english":"What we love to do we find time to do.","chinese":"我們喜歡做的事，總能找到時間去做。"},{"english":"Clara has always been very perceptive about whether her employees are being honest.","chinese":"克拉羅總能看透他的員工是否誠實。"},{"english":"Children are in some way cunning , they always know how to get what they want.","chinese":"孩子有時很狡猾，他們總能得到他們想要的。"},{"english":"\"Tracy, he will find people, \" Adelman said.","chinese":"“麥迪總能找到人，”阿帥說。"},{"english":"Due to his reputation, he is able to acquire the most interesting cases.","chinese":"他名聲大噪，因此總能獲得最有意思的案子。"},{"english":"It takes a long time, and I don't always get them all.","chinese":"耙葉子要花很時間，我還並不總能把落葉都耙好。"}],"related":[]}