{"definition":["coil (in electric motor or transformer)"],"pinyin":["rao4 zu3"],"simplified":["绕组"],"rank":57062.0,"normalized_rank":0.7983714129811258,"fraction":6.30623348043547e-8,"cumulative_fraction":0.9996621728827909,"word":"繞組","characters":[{"definition":["to wind\/to coil (thread)\/to rotate around\/to spiral\/to move around\/to go round (an obstacle)\/to by-pass\/to make a detour\/to confuse\/to perplex"],"pinyin":["rao4"],"word":"繞"},{"definition":["surname Zu","to form\/to organize\/group\/team\/classifier for sets, series, groups of people, batteries"],"pinyin":["Zu3","zu3"],"word":"組"}],"containing_words":[],"sentences":[{"english":"The windings should be cleaned and dried, and reimpregnated if necessary.","chinese":"繞組應清潔並乾燥，如有必要重新侵漆。"},{"english":"The degaussing windings of the system have different configurations.","chinese":"消磁系統之消磁繞組的組成方式有多種。"},{"english":"The terminals of the rotor winding are connected to three slip rings.","chinese":"轉子繞組的各端與三個滑環連接。"},{"english":"In using, the secondary winding can not be short-circuited or operating over-load.","chinese":"使用時二次繞組不能短路及超負荷運行。"},{"english":"If the filament transformer has a center tap, don't use it.","chinese":"如果變壓器燈絲繞組有抽頭，請不要使用它。"},{"english":"Clean off the dust in the windings before reassembling.","chinese":"在重新組裝前請清除掉繞組中的灰塵。"},{"english":"Repair after winding, it must re-create a new mask sets and the closure plate.","chinese":"修復繞組後，又必須重新制作新的屏蔽套和封板。"},{"english":"Unipolar controllers need center-tapped windings.","chinese":"單極控制器需要中心抽頭繞組。"},{"english":"Armature manufacture and design of 6-layers-serials printed circuit motor is introduced here.","chinese":"介紹了六層印製繞組電機電樞的設計與的製作。"},{"english":"Have probed into its stator of windings and rotor winding design method.","chinese":"探討了其定子繞組和轉子繞組的設計方法。"},{"english":"Have probed into its stator of windings and rotor winding design method.","chinese":"探討了其定子繞組和轉子繞組的設計方法。"},{"english":"Windings should be dried in a drying oven.","chinese":"應將線圈繞組放入烘乾箱中烘乾。"},{"english":"The temperature sensing element type WZC copper resistance is a wire winding.","chinese":"型銅電阻的感溫元件是一個銅絲繞組。"},{"english":"To guarantee the manufacturing process quality of power equipment, it is necessary to braze the winding bars reliably and efficiently.","chinese":"電力設備在製造工藝中要求對繞組銅排接頭可靠焊接。"},{"english":"The stator winding must be impregnated with insulation paint and dried before refitting.","chinese":"定子繞組在重新安裝前必須侵絕緣漆和烘乾。"},{"english":"The secondary was sandwiched between the two primary sections.","chinese":"次級繞組採用三明治繞法夾在兩個初級繞組之間。"}],"related":[]}