{"definition":["to punish according to the law\/to bring to justice"],"pinyin":["sheng2 zhi1 yi3 fa3"],"simplified":["绳之以法"],"rank":23440.0,"normalized_rank":0.3279560113609335,"fraction":0.0000017105658315681213,"cumulative_fraction":0.9818059428628452,"word":"繩之以法","characters":[{"definition":["rope\/CL:根[gen1]"],"pinyin":["sheng2"],"word":"繩"},{"definition":["(possessive particle, literary equivalent of 的[de5])\/him\/her\/it"],"pinyin":["zhi1"],"word":"之"},{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["France\/French\/abbr. for 法國|法国[Fa3 guo2]\/Taiwan pr. [Fa4]","law\/method\/way\/to emulate\/(Buddhism) dharma\/(abbr. for 法家[Fa3 jia1]) the Legalists\/(physics) farad (abbr. for 法拉[fa3 la1])"],"pinyin":["Fa3","fa3"],"word":"法"}],"containing_words":[],"sentences":[{"english":"Our military has brought justice to the enemy and honor to America. (Cheers, applause.)","chinese":"我軍已經將敵人繩之以法，給美國帶來了榮譽。"},{"english":"He said the perpetrators should be brought to justice.","chinese":"他說，那些犯了罪的人，應該被繩之以法。"},{"english":"His aim was to bring the criminal who killed his son to justice.","chinese":"他的目的就是要把殺害的他兒子的罪犯繩之以法。"},{"english":"The Pakistani government is determined to seize the criminals as soon as possible and bring them to justice.","chinese":"巴政府下決心儘快緝拿罪犯，並將其繩之以法。"},{"english":"Courts do not have time to haul in the millions of ordinary users who pilfer copyright material online.","chinese":"法院沒有時間將成千上萬的一般網絡盜版者繩之以法。"},{"english":"To demand thorough investigation by relevant departments to arrest the culprit.","chinese":"要求政府有關部門徹查此事，並將犯案者繩之以法。"},{"english":"It could take time for pro-Qaddafi people to be fully defeated and rounded up.","chinese":"徹底擊垮擁護卡扎菲的人並把他們繩之以法尚需時日。"},{"english":"They are the ones who are running. And we will catch them all and bring them to justice.","chinese":"逃竄的是他們，而我們將把他們一網打盡並繩之以法。"}],"related":[]}