{"definition":["to tie on\/to buckle up\/to fasten"],"pinyin":["ji4 shang5"],"simplified":["系上"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"繫上","characters":[{"definition":["to connect\/to arrest\/to worry","to tie\/to fasten\/to button up"],"pinyin":["ji4","xi4"],"word":"繫"},{"definition":["on top\/upon\/above\/upper\/previous\/first (of multiple parts)\/to climb\/to get onto\/to go up\/to attend (class or university)","see 上聲|上声[shang3 sheng1]"],"pinyin":["shang3","shang4"],"word":"上"}],"containing_words":[],"sentences":[{"english":"Men should wear a collared, long-sleeve white shirt with a conservative tie.","chinese":"男士應穿着白色有領長袖襯衫，並繫上領帶。"},{"english":"Blue Jay tied the scarf.","chinese":"藍松鴉把圍巾繫上去。"},{"english":"But is she very ill?' I asked, flinging down my rake and tying my bonnet.","chinese":"“她的病很嚴重嗎？”我問道，扔下耙子，繫上帽子。"},{"english":"Then he fastened a torch to every pair of tails.","chinese":"然後，他在每一對尾巴上繫上一支火把。"},{"english":"Please attach labels to all your bags.","chinese":"請你把所有的包上都繫上標籤。"},{"english":"As I see it, all motorists should wear seat belts.","chinese":"依我看，汽車司機都應繫上安全帶。"},{"english":"Trevor, let me tie your shoelace.","chinese":"特雷福，讓我幫你把鞋帶繫上吧。"},{"english":"Tie up the long carrot slice on the cabbage roll as ribbon. Serve with dipping sauce.","chinese":"繫上胡蘿蔔絲即可配合沾醬擺盤上桌。"},{"english":"The tourist attached labels to all his bags.","chinese":"旅遊者把他的行李都繫上標籤。"},{"english":"A tag was attached to each article.","chinese":"每件物品上都繫上了標籤。"},{"english":"There is a white ribbon on every branch.","chinese":"每根樹枝都繫上了白絲帶。"},{"english":"Now the driver and the front-seat passenger are required to wear safety belts.","chinese":"現在司機和前座乘客必須繫上安全帶。"},{"english":"The police belted up and went out.","chinese":"差人繫上皮帶，走了出去。"},{"english":"They go out into the middle of the river on a boat, tie themselves to a rope and dive in.","chinese":"他們坐船行使到河中央，身上繫上繩子跳進河中。"},{"english":"Lace up some comfortable shoes, put your pooch on his leash and move those legs.","chinese":"穿上舒適的鞋子，給狗繫上皮帶，然後邁動雙腿。"},{"english":"Harnesses are also attached on the riders to allow for a safer travel experience.","chinese":"騎自行車的人也要繫上揹帶，保證騎行時候的安全。"}],"related":[]}