{"definition":["stepson"],"pinyin":["ji4 zi3"],"simplified":["继子"],"rank":42066.0,"normalized_rank":0.5885579169756412,"fraction":3.166254726635309e-7,"cumulative_fraction":0.9972096185394662,"word":"繼子","characters":[{"definition":["to continue\/to follow after\/to go on with\/to succeed\/to inherit\/then\/afterwards"],"pinyin":["ji4"],"word":"繼"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi3","zi5"],"word":"子"}],"containing_words":[{"definition":["stepchildren\/adopted children"],"pinyin":["ji4 zi3 nu:3"],"word":"繼子女"}],"sentences":[{"english":"White writes to his stepson in 1964 from his farm in Maine.","chinese":"懷特在他緬因的農場裏寫信給他的繼子說。"},{"english":"Few years ago his Navy was \"the ugly little stepchild of the Government.\"","chinese":"幾年前，他的海軍還是“政府的又醜又小的繼子。”"},{"english":"Article 21. Maltreatment and discrimination shall not be allowed between step-parents and step-children.","chinese":"第二十一條繼父母與繼子女間，不得虐待或歧視。"},{"english":"I asked Delia about the accusations that her stepson had shot the man in North Luangwa.","chinese":"我向她請教她對繼子在北盧安瓜涉嫌殺人指控的看法。"},{"english":"His stepson is still very distant towards him.","chinese":"他的繼子對他仍然很疏遠。"},{"english":"Uncle Mike married twice, he has two stepsons.","chinese":"Mike舅舅結過兩次婚，他有2個繼子。"},{"english":"The 11th house also deals with legislative bodies and step-children.","chinese":"第十一宮也掌管立法團體及繼子女。"},{"english":"He is married and has one son and two stepchildren.","chinese":"他已婚，有一個兒子和兩個繼子。"},{"english":"Queen returned to the palace, elated, thinking to kill these step-children.","chinese":"王后回到宮中，心花怒放，以爲打發了這些繼子女。"},{"english":"In summary, returns management should no longer be the ugly step-child of the supply chain.","chinese":"總之，退貨管理再也不應該是供應鏈的醜繼子。"},{"english":"My step son graduated college last weekend.","chinese":"我的繼子上週末從大學畢業了。"},{"english":"I can't tolerate her wronging his young stepson.","chinese":"她對他繼子的虐待，我無法容忍。"},{"english":"In most cases, step-kids live with their mom and step-dad.","chinese":"大多數情況下，繼子與他們的母親和繼父在一起。"},{"english":"Article 27 Maltreatment or discrimination shall not be permitted between stepparents and stepchildren.","chinese":"第二十七條繼父母與繼子女間，不得虐待或歧視。"}],"related":[]}