{"definition":["(of an illness, debt etc) to plague sb\/to preoccupy sb\/difficult to get rid of"],"pinyin":["chan2 shen1"],"simplified":["缠身"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"纏身","characters":[{"definition":["to wind around\/to wrap round\/to coil\/tangle\/to involve\/to bother\/to annoy"],"pinyin":["chan2"],"word":"纏"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"}],"containing_words":[],"sentences":[{"english":"Too ill to get out of bed, she had strong feelings of uselessness.","chinese":"由於疾病纏身，臥牀不起，她深深感到力不從心。"},{"english":"Neymar has also been dogged by allegations related to tax evasion.","chinese":"內馬爾還被有關逃稅的指控纏身。"},{"english":"The violators whom the Federal Election Commission detects may land in trouble.","chinese":"這些違規的人被聯邦選舉委發現可就麻煩纏身了。"},{"english":"Prefer paralysis and disease?","chinese":"喜歡癱瘓和病魔纏身的題材？"},{"english":"The old lady is never free from paining.","chinese":"這位老太太連續病痛纏身。"},{"english":"After his conversation with the Governor, a lot happened to distract Steve from his new cause.","chinese":"在他與州長的對話以後，史蒂夫公務纏身。"},{"english":"She looked as she had a dozen years ago, before the disease had begun.","chinese":"她看來就如同十幾年前病魔尚未纏身時那樣。"},{"english":"Hu declined to name the debt-ridden university.","chinese":"胡拒絕透露這所債務纏身學校的名稱。"},{"english":"His affairs in France keep him long overdue.","chinese":"他在法國公務纏身，還得待很久。"},{"english":"He was never terribly sick, but he always thought he was.","chinese":"他從來沒什麼大病，但他總認爲自己重病纏身。"},{"english":"He seems to be dying from cancer.","chinese":"他因癌症纏身而日見衰弱無力。"},{"english":"After returning to the Kahn still has trouble-ridden, scandal into several piles.","chinese":"回國後的卡恩仍一直麻煩纏身，陷入數樁醜聞事件。"},{"english":"I'm domesticated now. Two children. And Don is putting on weight.","chinese":"我現在是家務纏身啦，有了兩個孩子啦，塘思現在可。"},{"english":"Because it's always out of cash and always in debt.","chinese":"因爲它總是缺錢花，又總是債務纏身。"},{"english":"Can you imagine a woman with serious illness manage a website by herself?","chinese":"你能想象一個病魔纏身的婦女獨自經營一個網站嗎？"},{"english":"She has been afflicted with a serious illness.","chinese":"她一直重病纏身。"}],"related":[{"definition":["ineradicable disease\/fig. deep-seated problem\/perennial problem"],"pinyin":["wan2 ji2"],"word":"頑疾"},{"definition":["overwork"],"pinyin":["guo4 lao2"],"word":"過勞"},{"definition":["depressed\/sulky\/moody\/unhappy"],"pinyin":["men4 men4 bu4 le4"],"word":"悶悶不樂"},{"definition":["bad luck\/misfortune\/adversity"],"pinyin":["e4 yun4"],"word":"厄運"},{"definition":["lit. to have one's hands bound and be unable to do anything about it (idiom); fig. helpless in the face of a crisis"],"pinyin":["shu4 shou3 wu2 ce4"],"word":"束手無策"},{"definition":["to leave a place where some event is taking place\/(of an actor) to exit\/(sports) to leave the field\/(of an audience) to leave"],"pinyin":["tui4 chang3"],"word":"退場"},{"definition":["to lose one's job\/unemployment\/not to fulfill one's obligations\/to neglect one's job\/dereliction of duty"],"pinyin":["shi1 zhi2"],"word":"失職"},{"definition":["dilemma\/quandary\/to face a difficult choice"],"pinyin":["liang3 nan2"],"word":"兩難"},{"definition":["to stir up trouble\/to invite disaster"],"pinyin":["re3 huo4"],"word":"惹禍"},{"definition":["to get away\/to escape (from obligations)\/to free oneself\/to disengage"],"pinyin":["tuo1 shen1"],"word":"脫身"},{"definition":["to take one's last breath\/dying"],"pinyin":["qi4 jue2"],"word":"氣絕"},{"definition":["the gains do not make up for the losses (idiom)"],"pinyin":["de2 bu4 chang2 shi1"],"word":"得不償失"},{"definition":["cage\/trap (e.g. basket, pit or snare for catching animals)\/fig. bonds (of wrong ideas)\/shackles (of past misconceptions)\/to trap\/to shackle"],"pinyin":["lao2 long2"],"word":"牢籠"},{"definition":["to bother\/to disturb\/to vex"],"pinyin":["fan2 rao3"],"word":"煩擾"},{"definition":["marriage upheaval (infidelity, divorce etc)\/marriage breakup"],"pinyin":["hun1 bian4"],"word":"婚變"},{"definition":["as yet undecided\/unsolved\/still outstanding"],"pinyin":["wei4 jue2"],"word":"未決"}]}