{"definition":["cilium"],"pinyin":["xian1 mao2"],"simplified":["纤毛"],"rank":55073.0,"normalized_rank":0.7705427224266507,"fraction":8.116356053523429e-8,"cumulative_fraction":0.9995192330503418,"word":"纖毛","characters":[{"definition":["fine\/delicate\/minute"],"pinyin":["xian1"],"word":"纖"},{"definition":["hair\/feather\/down\/wool\/mildew\/mold\/coarse or semifinished\/young\/raw\/careless\/unthinking\/nervous\/scared\/(of currency) to devalue or depreciate\/classifier for Chinese fractional monetary unit ( = 角[jiao3] , = one-tenth of a yuan or 10 fen 分[fen1])","surname Mao"],"pinyin":["Mao2","mao2"],"word":"毛"}],"containing_words":[{"definition":["ciliary dynein protein"],"pinyin":["xian1 mao2 dong4 li4 dan4 bai2"],"word":"纖毛動力蛋白"}],"sentences":[{"english":"In the nose, cilia help to drain mucus from the nasal cavity down to the throat.","chinese":"比方說鼻子，纖毛可以幫助粘液從鼻腔流到喉嚨。"},{"english":"Maintenance of humidity is vital for ciliary function .","chinese":"保持溼度對纖毛功能來說十分重要。"},{"english":"Each cilium terminates within the Pavilion - with another tiny light source.","chinese":"每個纖毛終亭與另一極光源。"},{"english":"Each comb plate is a simple rectangular paddle composed of cilia.","chinese":"每個櫛板都是纖毛組成的矩形的槳。"},{"english":"Microtubules are also used in the construction of centrioles, basal bodies, cilia and flagella.","chinese":"微管還用於建造中心粒，基體，纖毛和鞭毛。"},{"english":"This coughing may last as long as a couple of months, until the cilia are fully recovered.","chinese":"這種咳嗽可能會持續幾個月，直到纖毛完全修復。"},{"english":"Blepharisma is thought to be a relatively primitive genus in the phylum Ciliophora.","chinese":"赭纖蟲被認爲是一類進化過程中較爲原始的纖毛蟲。"},{"english":"The stomach mucosal epithelium consists of ciliated cells and microvilli.","chinese":"胃粘膜上皮由纖毛細胞和微絨毛細胞組成。"},{"english":"An inner mucous membrane has cilia (see cilium) that project inward to trap particles.","chinese":"內層的黏膜有纖毛，向內突出以擋住微粒。"},{"english":"He sees the roots falling away from her human body.","chinese":"他看見纖毛從她的人類身體上脫落。"},{"english":"Connecting cilium and accessory outer segment are present in both rods and cones.","chinese":"視錐和視杆均含有連接纖毛和輔助外段。"},{"english":"Most of the epithelia are ciliated columnar cells.","chinese":"粘膜上皮主要爲單層柱狀纖毛細胞。"},{"english":"Pseudostratified ciliated columnar epithelium from the trachea.","chinese":"氣管表面的假復層纖毛柱狀上皮。"},{"english":"Objective To study the structural characteristic of cilium of photoreceptor cells from neonatal retina.","chinese":"目的瞭解新出生期視網膜感光細胞纖毛結構特點。"},{"english":"The unit membrane of the cell continues up over each cilium .","chinese":"細胞膜向上突起延續構成纖毛的表面。"},{"english":"The airways are lined with tiny hairs known as cilia.","chinese":"在呼吸道的表面佈滿了微小的毛髮，稱爲爲纖毛。"}],"related":[]}