{"definition":["absence\/absent"],"pinyin":["que1 xi2"],"simplified":["缺席"],"rank":6415.0,"normalized_rank":0.08975417290445344,"fraction":0.000016798229433509982,"cumulative_fraction":0.8873128150185232,"word":"缺席","characters":[{"definition":["deficiency\/lack\/scarce\/vacant post\/to run short of"],"pinyin":["que1"],"word":"缺"},{"definition":["surname Xi","woven mat\/seat\/banquet\/place in a democratic assembly\/classifier for banquets, conversations etc"],"pinyin":["Xi2","xi2"],"word":"席"}],"containing_words":[],"sentences":[{"english":"Zargany has taken a leave of absence amid a dispute with the region's provincial council.","chinese":"薩爾曼省長在當地的一次省級議會上請假缺席。"},{"english":"Missing three tests results in an automatic two-year ban.","chinese":"缺席三次藥檢的結果是自動禁賽兩年。"},{"english":"He made up a story to explain his absence.","chinese":"他編造謊言爲他的缺席開脫。"},{"english":"He absented himself from a meeting yesterday.","chinese":"他昨天缺席會議了。"},{"english":"And all those absent in Nangang are important players.","chinese":"而且南鋼缺席的又都是主力隊員。"},{"english":"The string quartet was calling, and anyway it would have been bad manners.","chinese":"絃樂四重奏在召喚，缺席怎麼說都太失禮了。"},{"english":"And Yi did a great job off the bench, after missing 24 games.","chinese":"在缺席24場比賽後，阿聯打出了一場好球。"},{"english":"The European Union, meanwhile, is largely absent from this debate.","chinese":"同時，歐盟很大程度上是缺席這場辯論的。"},{"english":"John didn't have a good excuse for his absence so he made up one.","chinese":"約翰無故缺席，因此他編了一個理由。"},{"english":"You will be in the danger of failing the course if you exceed four absences.","chinese":"如果你缺席超過四次，這個科目你將有被當掉的危險。"},{"english":"She attended every twice-weekly session of the group.","chinese":"她準時參加寫作組每週兩次的會議，從不缺席。"},{"english":"Noticeably absent is the role of Team Leader; the team is expected to self-organize.","chinese":"團隊領導這個角色明顯缺席，這要求團隊做到自組織。"},{"english":"But the absence of men is no accident.","chinese":"然而男人的缺席並非偶然。"},{"english":"Kevin-Prince Boateng is back in action for AC Milan after more than two months out with injury.","chinese":"在兩個多月的因傷缺席後，博阿滕終於復出。"},{"english":"You get demerits if you miss a meeting .","chinese":"如果你缺席會議，會被記過的。"},{"english":"We're joining with dads across the country to do something about father absence.","chinese":"我們聯合全國各地的父親一起做一些父親缺席的事情。"}],"related":[{"definition":["armistice"],"pinyin":["xiu1 zhan4"],"word":"休戰"},{"definition":["to come back out of retirement\/to get involved again after having withdrawn"],"pinyin":["fu4 chu1"],"word":"復出"},{"definition":["to compete\/to take part (in a sports event)"],"pinyin":["chu1 sai4"],"word":"出賽"},{"definition":["to pull\/to injure by straining"],"pinyin":["la1 shang1"],"word":"拉傷"},{"definition":["holiday roster"],"pinyin":["lun2 xiu1"],"word":"輪休"},{"definition":["to have no opportunity\/no way (of doing sth)\/no chance\/no connection\/not placed (in a competition)\/(in pop lyrics) no chance of love, no place to be together etc"],"pinyin":["wu2 yuan2"],"word":"無緣"},{"definition":["competition (sports etc)\/match\/CL:場|场[chang3],次[ci4]\/to compete"],"pinyin":["bi3 sai4"],"word":"比賽"},{"definition":["on stage\/to go on stage\/to take the field"],"pinyin":["shang4 chang3"],"word":"上場"},{"definition":["(of a performer) to come onto the stage to perform\/(of an athlete) to enter the arena to compete\/(fig.) to enter the scene (e.g. a new product)\/(of an examinee etc) to leave the venue"],"pinyin":["chu1 chang3"],"word":"出場"},{"definition":["condition of an injury"],"pinyin":["shang1 shi4"],"word":"傷勢"},{"definition":["to replace"],"pinyin":["ding3 ti4"],"word":"頂替"},{"definition":["to return to\/to retreat\/regression (statistics)"],"pinyin":["hui2 gui1"],"word":"回歸"},{"definition":["first issue\/first public showing"],"pinyin":["shou3 fa1"],"word":"首發"},{"definition":["to leave in the middle of the play\/(fig.) to leave before the matter is concluded"],"pinyin":["zhong1 tu2 tui4 chang3"],"word":"中途退場"},{"definition":["to go on stage\/fig. to appear on the scene\/used in advertising to mean new product"],"pinyin":["deng1 chang3"],"word":"登場"},{"definition":["poised for battle\/to square up for a fight"],"pinyin":["dui4 zhen4"],"word":"對陣"}]}