{"definition":["deficiency\/shortcoming\/hiatus"],"pinyin":["que1 shi1"],"simplified":["缺失"],"rank":7557.0,"normalized_rank":0.10573223455010984,"fraction":0.000013086164360037907,"cumulative_fraction":0.9042526710697472,"word":"缺失","characters":[{"definition":["deficiency\/lack\/scarce\/vacant post\/to run short of"],"pinyin":["que1"],"word":"缺"},{"definition":["to lose\/to miss\/to fail"],"pinyin":["shi1"],"word":"失"}],"containing_words":[{"definition":["attention deficit hyperactivity disorder (ADHD)"],"pinyin":["zhu4 yi4 li4 que1 shi1 zheng4"],"word":"注意力缺失症"}],"sentences":[{"english":"Genetic counseling should be considered for individuals with a family history of albinism or hypopigmentation.","chinese":"遺傳諮詢應考慮個人與家族病史白化或色素缺失。"},{"english":"An absence of the exposure of knowledge-based assets will cause a seriously underrated evaluation of enterprises.","chinese":"對知識資產披露的缺失使企業價值被嚴重低估。"},{"english":"How can parents in father-absent homes compensate, if at all?","chinese":"在父愛缺失的家庭，父母該如何補償孩子？"},{"english":"Synopsis: An amnesiac spy awakens in a world overrun by zombies.","chinese":"一個記憶缺失的特工在一個殭屍遍野的世界甦醒。"},{"english":"This crisis of meaningless is a relatively new thing.","chinese":"相對而言，這場意義缺失危機是新事物。"},{"english":"Such attributions falsely account for the lack of connection.","chinese":"而這種歸因錯誤地導致了和他人之間互動的缺失。"},{"english":"Together they form the missing framework steps for adaptive business system design.","chinese":"它們一起形成了自適應系統設計所缺失的框架步驟。"},{"english":"The root cause of the loss of CPAs sincerity lies in the deficiency of system proper.","chinese":"註冊會計師誠信缺失的根源在於制度缺陷。"},{"english":"The anatomic level of the lesion generally correlates with the motor and sensory deficit.","chinese":"損傷的解剖等級與運動神經和感覺神經的缺失正相關。"},{"english":"It is short of prosecutive right of civil servant in civil servant system.","chinese":"公務員的檢舉權在公務員制度中是有所缺失的。"},{"english":"An implant and an all-ceramic crown restored the site of a congenitally missing lateral incisor.","chinese":"使用植體及全瓷冠修復先天性缺失的側切牙。"},{"english":"Therefore, to evaluate interregional government cooperation it is necessary to have public management point of view.","chinese":"因此，考量區域政府間合作就不能缺失公共管理視角。"},{"english":"Lack of sleep promotes obesity by messing with these hunger hormones.","chinese":"睡眠缺失促進肥胖，因其干擾了這些飢餓激素。"},{"english":"Lumbosacral lipoma can be responsible for progressive neurological and urological defects.","chinese":"腰骶部脂肪瘤導致了神經功能和小便功能的缺失。"},{"english":"Such cells have raised hopes of replacing lost or diseased tissue.","chinese":"這樣的細胞增加了更換缺失組織或者患病組織的希望。"},{"english":"Loss of fidelity in the data being displayed is another key risk.","chinese":"顯示的數據中保真度的缺失是另一個主要風險。"}],"related":[{"definition":["to lack\/to be short of\/lack\/shortage"],"pinyin":["que1 fa2"],"word":"缺乏"},{"definition":["lack\/shortage of\/shortfall\/to be short (of)\/to lack"],"pinyin":["que1 shao3"],"word":"缺少"},{"definition":["defect\/flaw\/physical defect"],"pinyin":["que1 xian4"],"word":"缺陷"},{"definition":["to be deficient in\/lapse\/deficiency"],"pinyin":["qian4 que1"],"word":"欠缺"},{"definition":["insufficient\/lacking\/deficiency\/not enough\/inadequate\/not worth\/cannot\/should not"],"pinyin":["bu4 zu2"],"word":"不足"},{"definition":["to complement\/to make up for a deficiency"],"pinyin":["mi2 bu3"],"word":"彌補"},{"definition":["to be deficient in sth\/to be short of sth (supplies, money etc)"],"pinyin":["kui4 fa2"],"word":"匱乏"},{"definition":["to exist\/to be\/existence"],"pinyin":["cun2 zai4"],"word":"存在"},{"definition":["a regret\/sth regrettable"],"pinyin":["que1 han4"],"word":"缺憾"},{"definition":["imperfect"],"pinyin":["bu4 wan2 shan4"],"word":"不完善"},{"definition":["to fill a gap\/to fill in a blank (on a form)\/to overcome a deficiency"],"pinyin":["tian2 bu3"],"word":"填補"},{"definition":["weak\/frail"],"pinyin":["bo2 ruo4"],"word":"薄弱"},{"definition":["to trace something to its source (idiom)"],"pinyin":["jiu1 qi2 gen1 yuan2"],"word":"究其根源"},{"definition":["to lose\/to forfeit"],"pinyin":["sang4 shi1"],"word":"喪失"},{"definition":["to neglect\/to ignore"],"pinyin":["hu1 shi4"],"word":"忽視"},{"definition":["short stave of the barrel (which allows the contents to escape)\/(fig.) shortcoming\/weak point"],"pinyin":["duan3 ban3"],"word":"短板"}]}