{"definition":["comment\/statement"],"pinyin":["zhi4 ping2"],"simplified":["置评"],"rank":26120.0,"normalized_rank":0.3654526884277979,"fraction":0.0000013394907040850895,"cumulative_fraction":0.9858673249525404,"word":"置評","characters":[{"definition":["to install\/to place\/to put\/to buy"],"pinyin":["zhi4"],"word":"置"},{"definition":["to discuss\/to comment\/to criticize\/to judge\/to choose (by public appraisal)"],"pinyin":["ping2"],"word":"評"}],"containing_words":[],"sentences":[{"english":"But Mr. Viniar declined to discuss in detail the impact that the new regulations would have on Goldman, saying that it was too early to give any guidance on the subject.","chinese":"關於新法案對高盛的影響，維尼亞拒絕詳細置評。"},{"english":"A spokeswoman for the FTC declined to comment.","chinese":"FTC的一名發言人拒絕置評。"},{"english":"Borsig, through a spokesman, declined to comment.","chinese":"博爾西希通過一位發言人拒絕置評。"},{"english":"A spokeswoman for Mr. Rajaratnam's legal team declined to comment.","chinese":"拉賈拉特南律師團的一位發言人拒絕置評。"},{"english":"Members of the Ampatuan family couldn't be reached to comment.","chinese":"記者暫時無法聯繫到安帕圖安家族成員進行置評。"},{"english":"Spokeswomen for Apple and Microsoft declined to comment.","chinese":"蘋果公司和微軟公司的發言人拒絕置評。"},{"english":"A spokeswoman for Brookfield declined to comment.","chinese":"布魯克菲爾德公司的發言人拒絕置評。"},{"english":"Markets see-sawed all day, with S&P officials refusing to comment on their plans.","chinese":"市場全天反覆漲跌，標普高管拒絕就其計劃置評。"},{"english":"Li's parents declined to comment on Tuesday.","chinese":"週二，李翔的父母拒絕置評。"},{"english":"Chinese weapons manufacturers have declined to comment on the issue.","chinese":"中國軍火商曾拒絕就此事置評。"},{"english":"Zhuzhou Electric Locomotive could not be reached for comment Thursday.","chinese":"記者週四無法聯繫株洲電力機車公司就此置評。"},{"english":"Lawrence and Cissell could not be reached for comment.","chinese":"記者無法聯繫勞倫斯和西塞爾就此置評。"},{"english":"Meanwhile we shall not and could not comment on anything regarding our customers.","chinese":"同時對於任何有關客戶的事物，我們不能也不予置評。"},{"english":"Toyota declined to make Mr. Okuda available for comment.","chinese":"豐田拒絕安排奧田碩發表置評。"},{"english":"Catcher also declined to comment.","chinese":"可成科技也拒絕置評。"},{"english":"The DRDC declined to comment.","chinese":"防務研究與開發局拒絕置評。"}],"related":[]}