{"definition":["to give up\/to abandon (a goal etc)\/to let sth go\/forget it\/let the matter drop"],"pinyin":["ba4 xiu1"],"simplified":["罢休"],"rank":23355.0,"normalized_rank":0.3267667510808277,"fraction":0.000001723411862731971,"cumulative_fraction":0.9816599361864357,"word":"罷休","characters":[{"definition":["(final particle, same as 吧)","to stop\/to cease\/to dismiss\/to suspend\/to quit\/to finish"],"pinyin":["ba4","ba5"],"word":"罷"},{"definition":["surname Xiu","to rest\/to stop doing sth for a period of time\/to cease\/(imperative) don't"],"pinyin":["Xiu1","xiu1"],"word":"休"}],"containing_words":[],"sentences":[{"english":"Set your goals high, and don't stop till you get there.","chinese":"樹立遠大的目標，不達目的誓不罷休。"},{"english":"He is an honest man, and he never has an ax to grind.","chinese":"他是個不達目的決不罷休的人。"},{"english":"They are about to the stance with ritual, and get straight to the blood bleeding.","chinese":"他們注重禮節，採取硬碰硬，直到出血才罷休。"},{"english":"We'll never stop until we reach our goal.","chinese":"不達目的，誓不罷休。"},{"english":"He's a man who sticks at it until it's finished.","chinese":"他是那種不達目的決不罷休的人。"},{"english":"Y yo no me lo callo.","chinese":"我絕不會就此罷休。"},{"english":"To ambitious goals, never give up to reach the goal.","chinese":"目標要遠大，不達目的決不罷休。"},{"english":"Not yet, however, in spite of her disappointment in her husband, did Mrs.","chinese":"班納特太太雖然碰了一鼻子灰，可是並不甘心罷休。"},{"english":"But we can’t stop there, because binary files now await us.","chinese":"但我們還不能罷休，因爲二進制文件還在等着我們。"},{"english":"Beijing didn't stop there.","chinese":"北京並未就此罷休。"},{"english":"If you are right your choice is confident, and do not surmount swear not to stop.","chinese":"假如你對你的選擇佈滿信心，而且不超越誓不罷休。"},{"english":"I wont stop until I reach my goals.","chinese":"我不達目的，誓不罷休。"},{"english":"I' m such a perfectionist that I won't stop until a job is well done.","chinese":"工作做得不文雅，我是不會罷休的。"},{"english":"Set your goals , and don't stop till you get there.","chinese":"樹立遠大目標，不達目的誓不罷休。"},{"english":"My cousins and I usually played it just before dark.","chinese":"我和我表弟們經常玩躲貓貓到天黑才罷休。"},{"english":"Dirk Kuyt insists he will not rest until he achieves his dream of becoming a Barclays Premier League champion with Liverpool.","chinese":"庫伊特堅稱不幫助利物浦奪取聯賽冠軍誓不罷休。"}],"related":[]}