{"definition":["Logue or Rogge (name)\/Jacques Rogge, president of International Olympic Committee (IOC)"],"pinyin":["Luo2 ge2"],"simplified":["罗格"],"rank":21267.0,"normalized_rank":0.2975529220824647,"fraction":0.0000021017858715581,"cumulative_fraction":0.9776783821079688,"word":"羅格","characters":[{"definition":["gauze\/to collect\/to gather\/to catch\/to sift","surname Luo"],"pinyin":["Luo2","luo2"],"word":"羅"},{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"}],"containing_words":[{"definition":["Rutgers University (New Jersey)"],"pinyin":["Luo2 ge2 si1 Da4 xue2"],"word":"羅格斯大學"}],"sentences":[{"english":"Hiya, Rog. Frank, you all set?","chinese":"嗨，你好，羅格。佛蘭克，你都搞定了嗎？"},{"english":"What have we learnt from the rosiglitazone saga?","chinese":"從羅格列酮事件中我們學到了什麼？"},{"english":"Conclusion The insulin-sensitizing drugs, rosiglitazone and metformin, are effective in the treatment of NAFLD.","chinese":"結論羅格列酮和二甲雙胍可有效治療大鼠NAFLD。"},{"english":"Rosiglitazone was put into the drinking water. The observing time was 8 weeks.","chinese":"羅格列酮爲觀察藥，溶於飲水中，實驗期8周。"},{"english":"President Rogge’s interview on Weibo also created waves offline.","chinese":"羅格主席的在線訪談也在線下掀起了高潮。"},{"english":"Now we visit the apartment of the Rogarshevsky family ofthe Lithuania.","chinese":"現在我們來到羅格柴夫斯基一家的公寓。"},{"english":"During the process, Logue and Albert form an unbreakable bond.","chinese":"在這段過程中，羅格和亞伯特發展出牢不可破的情誼。"},{"english":"Rutgers, The State University of New Jersey, Camden.","chinese":"點評羅格斯，新澤西州立大學，卡姆登校區。"},{"english":"I remember learning a lot from Mister Rogers, and Yoda.","chinese":"我記得我從羅格斯先生和尤達那裏學到很多知識。"},{"english":"The complete audio monograph is on the Rutgers Law Review website.","chinese":"完整的音頻專着是羅格斯大學法律評論“網站上。"},{"english":"But Rogoff cautioned against equating that skill with forecasting.","chinese":"但是羅格夫警告說，不要把這種技能與預測劃等號。"},{"english":"The complete audio monograph is on the Rutgers Law Review website. You can find a link to the site at http:\/\/www.hxen.com .","chinese":"完整的音頻在羅格斯大學法學評論網站上。"},{"english":"No difference between rosiglitazone and pioglitazone was apparent.","chinese":"羅格列酮和匹格列酮間無明顯差別。"},{"english":"Objective To observe the efficacy of rosiglitazone in the treatment of obese type 2 diabetics.","chinese":"目的觀察羅格列酮治療肥胖型2型糖尿病的療效。"},{"english":"Rosiglitazone and pioglitazone are part of a group of drugs called thiazolidinediones.","chinese":"羅格列酮和吡咯列酮同屬噻唑烷二酮類。"},{"english":"Now we visit the apartment of the Rogarshevsky family of Lithuania.","chinese":"現在我們來到羅格柴夫斯基一家的公寓。"}],"related":[]}