{"definition":["Ronaldo (name)\/Cristiano Ronaldo (1985-), Portuguese soccer player"],"pinyin":["Luo2 na4 er3 duo1"],"simplified":["罗纳尔多"],"rank":8927.0,"normalized_rank":0.12490031200593232,"fraction":0.000010037859555907041,"cumulative_fraction":0.9199367105006508,"word":"羅納爾多","characters":[{"definition":["gauze\/to collect\/to gather\/to catch\/to sift","surname Luo"],"pinyin":["Luo2","luo2"],"word":"羅"},{"definition":["surname Na","to receive\/to accept\/to enjoy\/to bring into\/to pay (tax etc)\/nano- (one billionth)\/to reinforce sole of shoes or stockings by close sewing"],"pinyin":["Na4","na4"],"word":"納"},{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"},{"definition":["many\/much\/often\/a lot of\/numerous\/more\/in excess\/how (to what extent)\/multi-\/Taiwan pr. [duo2] when it means \"how\""],"pinyin":["duo1"],"word":"多"}],"containing_words":[],"sentences":[{"english":"We should take Ronaldo to Lourdes.","chinese":"我們應該帶羅納爾多去盧爾德。"},{"english":"Ronaldo camped on the left-wing to battle with Ferreira.","chinese":"羅納爾多打左邊鋒，對壘費雷拉。"},{"english":"I've played against Giggsy, Ronaldo and Nani.","chinese":"我曾經碰到過吉格斯，羅納爾多和納尼。"},{"english":"Ozil also served an assist to Ronaldo against Atletico Madrid in the Copa del Rey.","chinese":"厄齊爾同樣在國王杯對陣馬德里競技時助工羅納爾多。"},{"english":"I picked Ronny because he scored a hatful of goals and so many were important.","chinese":"我會選羅納爾多，因爲他進了太多球，這很重要。"},{"english":"That Ronaldo is utterly essential to Real’s chances is unquestionable.","chinese":"毫無疑問，羅納爾多對皇馬是不可或缺的。"},{"english":"Owing to his fantastic performance, Ronaldo got the call-up to the full Brazil national squad.","chinese":"由於羅納爾多的出色表現，他被選入巴西國家足球對。"},{"english":"There's only one Ronaldo, and he is called Christiano.","chinese":"世上只有一個羅納爾多，他的名字叫做克里斯蒂亞諾。"},{"english":"Brazil coach Dunga has declared AC Milan youngster Alexandre Pato as the 'new Ronaldo'.","chinese":"巴西主教練鄧加認爲米蘭新星帕託是“新羅納爾多”。"},{"english":"All the evidence points to a case of extortion with Ronaldo as the victim.","chinese":"所有證據顯示，羅納爾多是這起勒索案的受害者。"},{"english":"Ronaldo has suffered weight problems in the last months after spending more than one year without play due to an injury.","chinese":"羅納爾多因傷休養了1年多後一直被體重問題困擾。"},{"english":"Ronaldo of Brazil arrived for C45 million.","chinese":"巴西的羅納爾多用了四百五十萬。"},{"english":"Real Madrid will sign Vieri and Ronaldo in about 80% of your games.","chinese":"皇家馬德里80%會簽下維耶裏和羅納爾多。"},{"english":"Ronaldo grew up in Bento Ribeiro, a suburb of Rio.","chinese":"羅納爾多在里約熱內盧的一個叫本託。"}],"related":[]}