{"definition":["to dub with a nice-sounding appellation\/fanciful moniker"],"pinyin":["mei3 cheng1"],"simplified":["美称"],"rank":23915.0,"normalized_rank":0.3346018776321128,"fraction":0.0000016340735550924687,"cumulative_fraction":0.9826001868397128,"word":"美稱","characters":[{"definition":["beautiful\/very satisfactory\/good\/to beautify\/to be pleased with oneself","the Americas\/abbr. for 美洲[Mei3 zhou1]\/USA\/abbr. for 美國|美国[Mei3 guo2]"],"pinyin":["Mei3","mei3"],"word":"美"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"}],"containing_words":[],"sentences":[{"english":"South Africa Has Beautiful Scenery, Mild Climate , \"Rainbow Country\"Good Name.","chinese":"南非風景娟秀，天氣溫順，有“彩虹之國”的美稱。"},{"english":"The company is located in Changle city of Fuzhou, Fujian Province, the renowned \"Textile City\".","chinese":"公司坐落在有“紡織之鄉”美稱的福州長樂市。"},{"english":"Yuyao city, Zhejiang province is honored with the title of \"Town of Moulds\" and \"King or Plastics\"etc.","chinese":"浙江省餘姚市號稱“模具之鄉，塑料王國”等美稱。"},{"english":"Sichuan has always enjoyed the reputation of the being “Heavenly Land of Plenty”.","chinese":"四川素有“天府之國”的美稱。"},{"english":"Small fat cat has ecological garden hotel inn name.","chinese":"小肥貓客棧有着生態花園客棧的美稱。"},{"english":"Jinping County is known as \"township of the pine\" the laudatory name, the forestry area is quite broad.","chinese":"錦屏縣素有“杉木之鄉”的美稱，林業面積相當廣闊。"},{"english":"Therefore, potatoes have \"underground apple\" laudatory name.","chinese":"因此，土豆擁有“地下蘋果”的美稱。"},{"english":"Liancheng County is known as \"The township of sweet potato processing in China\" .","chinese":"連城縣素有“中國紅心地瓜幹之鄉”的美稱。"},{"english":"With mild spring like weather all the year around, Gulangyu is reputed as a garden on the sea.","chinese":"鼓浪嶼上氣候怡人，四季如春，素有海上花園的美稱。"},{"english":"Thus, while the urban centres have Xanadu's Huandao the laudatory name.","chinese":"因此，華麗環島有都市中心的世外桃源這一美稱。"},{"english":"Wuhu has a good name is called \"1000 Lake City\", which is the nature of water.","chinese":"蕪湖有個美稱叫做“千湖之城”，因而是性水的。"}],"related":[]}