{"definition":["American-Soviet (tension, rapprochement etc)"],"pinyin":["Mei3 Su1"],"simplified":["美苏"],"rank":30235.0,"normalized_rank":0.4230268772823304,"fraction":9.231625122748591e-7,"cumulative_fraction":0.9904610073056841,"word":"美蘇","characters":[{"definition":["beautiful\/very satisfactory\/good\/to beautify\/to be pleased with oneself","the Americas\/abbr. for 美洲[Mei3 zhou1]\/USA\/abbr. for 美國|美国[Mei3 guo2]"],"pinyin":["Mei3","mei3"],"word":"美"},{"definition":["Perilla frutescens (Chinese basil or wild red basil)\/place name\/to revive\/used as phonetic in transliteration","surname Su\/abbr. for Soviet Union 蘇維埃|苏维埃 or 蘇聯|苏联\/abbr. for Jiangsu province 江蘇|江苏\/abbr. for Suzhou city 蘇州|苏州"],"pinyin":["Su1","su1"],"word":"蘇"}],"containing_words":[],"sentences":[{"english":"Nor would we undertake an obligation to concert US-Soviet actions toward third countries.","chinese":"我們也不承擔協調美蘇針對第三國行動的義務。"},{"english":"The Cold War was also a sporting war, with US–Soviet rivalries played out every four years.","chinese":"冷戰也體現在體育對抗上，每四年演繹一場美蘇對抗。"},{"english":"Never mind the two-party U.S.-Soviet moon race of old.","chinese":"忘記以前登月競賽的美蘇爭霸吧。"},{"english":"The American and Soviet governments drew diametrically opposite conclusions from it.","chinese":"美蘇兩國政府從這裏得出了截然相反的結論。"},{"english":"This had a far-reaching effects on pattern of US-Soviet Cold War and the situation in the Middle East.","chinese":"這對美蘇冷戰格局和中東局勢都產生了深遠影響。"},{"english":"If a nuclear exchange began, children were to crouch beneath their desks.","chinese":"如果美蘇開始相互核攻擊，孩子們就要蹲到課桌下面。"},{"english":"The U.S. and the Soviet bloc exchanged accused spies at the Glienicke Bridge in a deal that eventually involved 29 people.","chinese":"美蘇在Glienicke橋互換了29名間諜。"},{"english":"This marks the US-Soviet relations have entered a new stage.","chinese":"這標誌着美蘇關係進入一個新階段。"},{"english":"Imagine a US-China renewable energy initiative, along the lines of the US-Soviet space station.","chinese":"試着沿美蘇空間站的思路想象美中可再生能源倡議。"},{"english":"On the Impact of Vietnam War on American Economy;","chinese":"美蘇兩強一個臺前，一個幕後都捲入了越南戰爭。"},{"english":"Conservatives resented the very fact of a Soviet-American dialogue.","chinese":"保守派人士對於美蘇對話這件事大爲不滿。"},{"english":"Both two powers U S and USSR were involved in the Vietnamese War directly or indirectly.","chinese":"美蘇兩強一個臺前，一個幕後都捲入了越南戰爭。"},{"english":"From this perspective, the US-Soviet detente is based on the realities of the nuclear age.","chinese":"從這個角度看，美蘇緩和正是基於核時代的現實。"},{"english":"Before the war, China is the United States and Soviet Union countries want to fight.","chinese":"開戰前，中國是美蘇都想爭取的國家。"},{"english":"Germany's effect in Cold War was reduced under the situation which the US-Soviet relations relaxed.","chinese":"在美蘇關係緩和的形勢下，德國在冷戰中的作用降低。"}],"related":[]}