{"definition":["righteous man"],"pinyin":["yi4 ren2"],"simplified":["义人"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"義人","characters":[{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["Yi4","yi4"],"word":"義"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"}],"containing_words":[{"definition":["People's Democratic Republic of Korea (North Korea)"],"pinyin":["Chao2 xian3 Min2 zhu3 zhu3 yi4 Ren2 min2 Gong4 he2 guo2"],"word":"朝鮮民主主義人民共和國"}],"sentences":[{"english":"The Righteous One takes note of the house of the wicked and brings the wicked to ruin.","chinese":"義人思想惡人的家，知道惡人傾倒，必至滅亡。"},{"english":"Rejoice in the LORD, ye righteous; and give thanks at the remembrance of his holiness.","chinese":"你們義人當靠耶和華歡喜，稱謝他可記念的聖名。"},{"english":"The blessing of the Lord is upon the head of the just: but iniquity covereth the mouth of the wicked.","chinese":"上主的祝福在義人頭上，災禍卻使惡人啞口無言。"},{"english":"A righteous man regardeth the life of his beast: but the tender mercies or the wicked are cruel.","chinese":"義人顧惜牲畜的生命主，惡人都是殘暴不仁。"},{"english":"5There they are, overwhelmed with dread, for God is present in the company of the righteous.","chinese":"他們在那裏大大的害怕，因爲神在義人的族類中。"},{"english":"The mouth of the virtuous utters wisdom and his tongue speaks of what is right.","chinese":"義人的口傾吐智慧，他的舌頭講論公義。"},{"english":"For there is not a just man upon earth, that doeth good, and sinneth not.","chinese":"時常行善而不犯罪的義人，世上實在沒有。"},{"english":"The wicked borrow and do not repay, but the righteous have mercy and share.","chinese":"惡人借貸總不償還，義人卻常好施樂善。"},{"english":"The LORD will not suffer the soul of the righteous to famish : but he casteth away the substance of the wicked.","chinese":"耶和華不容許義人抵受飢餓，惡人的慾念卻無法得着。"},{"english":"The wicked plotteth against the just, and gnasheth upon him with his teeth.","chinese":"惡人設謀害義人，又向他咬牙。"},{"english":"The fruit of the righteous is a tree of life, and he who wins souls is wise.","chinese":"義人所結的果子就是生命樹，有智慧的必能得人。"},{"english":"The mouth of the righteous brings forth wisdom, but the perverse tongue will be cut off.","chinese":"義人的口滋生智慧，乖謬的舌必被割斷。"},{"english":"The righteous is delivered out of trouble, and the wicked cometh in his stead.","chinese":"義人得脫離患難，有惡人來代替他。"},{"english":"With their mouths the godless would destroy their neighbors, but by knowledge the righteous are delivered.","chinese":"不虔敬的人用口敗壞鄰居，義人卻因知識得救。"},{"english":"They band together against the righteous and condemn the innocent to death.","chinese":"他們大家聚集攻擊義人，將無辜的人定爲死罪。"},{"english":"When the upright man, turning away from his righteousness, does evil, death will overtake him in it.","chinese":"義人轉離他的義而作罪孽，就必因此死亡。"}],"related":[{"definition":["Jesus Christ"],"pinyin":["Ye1 su1 Ji1 du1"],"word":"耶穌基督"},{"definition":["(third person pronoun for a divine being)"],"pinyin":["ta1"],"word":"祂"},{"definition":["Gospel according to St John"],"pinyin":["Yue1 han4 Fu2 yin1"],"word":"約翰福音"},{"definition":["previous sins"],"pinyin":["guo4 fan4"],"word":"過犯"},{"definition":["righteousness"],"pinyin":["gong1 yi4"],"word":"公義"},{"definition":["love others as self"],"pinyin":["ai4 ren2 ru2 ji3"],"word":"愛人如己"},{"definition":["tabernacle (biblical word for a meeting hall or tent)"],"pinyin":["hui4 mu4"],"word":"會幕"},{"definition":["to maintain\/to adhere to\/to observe (an injunction etc)"],"pinyin":["chi2 shou3"],"word":"持守"},{"definition":["commandment"],"pinyin":["jie4 ming4"],"word":"誡命"},{"definition":["gospel"],"pinyin":["fu2 yin1 shu1"],"word":"福音書"},{"definition":["Book of Genesis\/First Book of Moses"],"pinyin":["Chuang4 shi4 ji4"],"word":"創世記"},{"definition":["saint"],"pinyin":["sheng4 tu2"],"word":"聖徒"},{"definition":["Holy Father\/God the Father (in the Christian Trinity)"],"pinyin":["Sheng4 Fu4"],"word":"聖父"},{"definition":["Holy Son\/Jesus Christ\/God the Son (in the Christian Trinity)"],"pinyin":["Sheng4 zi3"],"word":"聖子"},{"definition":["Judas\/Judah (son of Jacob)"],"pinyin":["You2 da4"],"word":"猶大"},{"definition":["archaic variant of 蘇|苏[su1]\/to revive"],"pinyin":["su1"],"word":"穌"}]}