{"definition":["the Righteous and Harmonious Fists\/the Boxers (history)"],"pinyin":["Yi4 he2 tuan2"],"simplified":["义和团"],"rank":43639.0,"normalized_rank":0.6105662278063044,"fraction":2.722482740975035e-7,"cumulative_fraction":0.9976724622101212,"word":"義和團","characters":[{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["Yi4","yi4"],"word":"義"},{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["round\/lump\/ball\/to roll into a ball\/to gather\/regiment\/group\/society\/classifier for a lump or a soft mass: wad (of paper), ball (of wool), cloud (of smoke)"],"pinyin":["tuan2"],"word":"團"}],"containing_words":[{"definition":["Boxer Rebellion"],"pinyin":["Yi4 he2 tuan2 Yun4 dong4"],"word":"義和團運動"}],"sentences":[{"english":"The incident of Yihetuan (anti-imperialist organization at the end of 19th century) is historical, but also modern.","chinese":"義和團事件是歷史的，也是現代的。"},{"english":"The Boxer Band tunes in to historyThe Boxers’ negative image in the West is of little concern.","chinese":"當地毫不在意義和團在西方人眼中的負面形象。"},{"english":"The Boxer episode is commonly portrayed in the West as an orgy of anti-foreign violence.","chinese":"在西方，義和團被視作反西方的暴力狂歡。"},{"english":"Mao Zedong's Red Guards sometimes called themselves “new Boxers”.","chinese":"紅衛兵有時自稱“新義和團”。"},{"english":"During the uprising, the Plum Flower Boxers renamed themselves the “Righteous and Harmonious Fists”.","chinese":"在義和團運動中，梅花拳更名爲“義和拳”。"},{"english":"Ever since the uprising, memories of it have troubled the relationship between China and the West.","chinese":"對義和團運動的歷史記憶一直困擾着中西關係。"},{"english":"Trigram of Taoism doctrine had been largely used in the Boxers' notices.","chinese":"道教教義中的八卦在義和團揭帖中多有使用。"},{"english":"The Boxer Rebellion has an important influence on the sea transportation of tribute grain in the Late Qing Dynasty.","chinese":"義和團運動對晚清的漕糧運輸產生了重大影響。"},{"english":"In summer 1900, China was convulsed by Boxer attacks on these groups.","chinese":"在1900年夏，義和團的抵抗運動震撼了中國。"},{"english":"A second series of destruction followed when eight allied armies put down the Boxer Movement in 1900.","chinese":"第二次浩劫是1900年的八國聯軍鎮壓義和團運動。"},{"english":"Mao Zedong’s Red Guards sometimes called themselves “new Boxers”.","chinese":"紅衛兵有時自稱“新義和團”。"}],"related":[{"definition":["White Lotus society"],"pinyin":["Bai2 lian2 jiao4"],"word":"白蓮教"},{"definition":["Self-Strengthening Movement (period of reforms in China c 1861-1894), also named 自強運動|自强运动"],"pinyin":["Yang2 wu4 Yun4 dong4"],"word":"洋務運動"},{"definition":["to forfeit sovereignty and humiliate the country (idiom)\/to surrender territory under humiliating terms"],"pinyin":["sang4 quan2 ru3 guo2"],"word":"喪權辱國"},{"definition":["national prestige"],"pinyin":["guo2 wei1"],"word":"國威"},{"definition":["foreign affairs (in Qing times)\/foreign learning"],"pinyin":["yang2 wu4"],"word":"洋務"},{"definition":["Lelang commandery (108 BC-313 AD), one of four Han dynasty commanderies in north Korea"],"pinyin":["Le4 lang4 jun4"],"word":"樂浪郡"},{"definition":["commander-in-chief, the equivalent of king in Chinese chess"],"pinyin":["jiang4 shuai4"],"word":"將帥"},{"definition":["to exhort (sb) to live a virtuous life (Buddhism)\/to beg for alms"],"pinyin":["quan4 hua4"],"word":"勸化"},{"definition":["May Fourth Movement\/Chinese national renewal movement that started with 4th May 1919 protest against the Treaty of Versailles"],"pinyin":["Wu3 si4 Yun4 dong4"],"word":"五四運動"},{"definition":["disaster of war"],"pinyin":["zhan4 huo4"],"word":"戰禍"},{"definition":["variant of 授予[shou4 yu3]"],"pinyin":["shou4 yu3"],"word":"授與"},{"definition":["to sacrifice oneself in a just cause\/a victim of a disaster"],"pinyin":["xun4 nan4"],"word":"殉難"},{"definition":["Fabi, first currency issued by the 國民黨|国民党[Guo2 min2 dang3] in 1935, in use until 1948"],"pinyin":["fa3 bi4"],"word":"法幣"},{"definition":["The Jesuits (Society of Jesus)"],"pinyin":["Ye1 su1 hui4"],"word":"耶穌會"},{"definition":["sb who sacrifices himself\/sacrificial victim\/sb who is expendable"],"pinyin":["xi1 sheng1 zhe3"],"word":"犧牲者"},{"definition":["state religion"],"pinyin":["guo2 jiao4"],"word":"國教"}]}