{"definition":["Boxer Rebellion"],"pinyin":["Yi4 he2 tuan2 Yun4 dong4"],"simplified":["义和团运动"],"rank":57063.0,"normalized_rank":0.7983854042785388,"fraction":6.30623348043547e-8,"cumulative_fraction":0.9996622359451258,"word":"義和團運動","characters":[{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["Yi4","yi4"],"word":"義"},{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["round\/lump\/ball\/to roll into a ball\/to gather\/regiment\/group\/society\/classifier for a lump or a soft mass: wad (of paper), ball (of wool), cloud (of smoke)"],"pinyin":["tuan2"],"word":"團"},{"definition":["to move\/to transport\/to use\/to apply\/fortune\/luck\/fate"],"pinyin":["yun4"],"word":"運"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"}],"containing_words":[],"sentences":[{"english":"During the uprising, the Plum Flower Boxers renamed themselves the “Righteous and Harmonious Fists”.","chinese":"在義和團運動中，梅花拳更名爲“義和拳”。"},{"english":"Ever since the uprising, memories of it have troubled the relationship between China and the West.","chinese":"對義和團運動的歷史記憶一直困擾着中西關係。"},{"english":"The Boxer Rebellion has an important influence on the sea transportation of tribute grain in the Late Qing Dynasty.","chinese":"義和團運動對晚清的漕糧運輸產生了重大影響。"},{"english":"A second series of destruction followed when eight allied armies put down the Boxer Movement in 1900.","chinese":"第二次浩劫是1900年的八國聯軍鎮壓義和團運動。"}],"related":[]}