{"definition":["(of the wind) blowing gently\/abundant\/flying"],"pinyin":["xi2 xi2"],"simplified":["习习"],"rank":33977.0,"normalized_rank":0.4753823122018105,"fraction":6.636142917143436e-7,"cumulative_fraction":0.9933998313712888,"word":"習習","characters":[{"definition":["(bound form) to practice\/to study\/habit\/custom","surname Xi"],"pinyin":["Xi2","xi2"],"word":"習"},{"definition":["(bound form) to practice\/to study\/habit\/custom","surname Xi"],"pinyin":["Xi2","xi2"],"word":"習"}],"containing_words":[],"sentences":[{"english":"A lot of people also sit outdoors, enjoying the cool, breezy nighttime air.","chinese":"還有好多人坐在室外，享受涼風習習的夜晚。"},{"english":"\"Xixi\" is surely a new word.","chinese":"“習習”可是個新詞。"},{"english":"Heater breeze, the sun, the air thick with incense of glutinous rice.","chinese":"暖風習習，豔陽高照，空氣中瀰漫着濃濃的糯米香。"},{"english":"It's breezy and pleasant today.","chinese":"今日涼風習習，非常舒適。"},{"english":"Now he felt the cool breeze that was blowing in this part of the Maze and it was refreshing.","chinese":"這時，從迷宮中吹來習習的涼風，使人感到神清氣爽。"},{"english":"However, the desert breeze couldn't wipe away my feeling of being cheated.","chinese":"然而，戈壁的習習微風並不能掃去我被欺騙後感受。"},{"english":"For most of the country, the crisp cool air of autumn is upon us.","chinese":"在很多國家，涼風習習的秋天已經來到了我們身邊。"},{"english":"In the autumn breeze, we end this pleasant trip.","chinese":"在習習的秋風中我們結束了這次愉快的旅行。"},{"english":"The blustery winds of spring had dropped to a gentle breeze.","chinese":"呼嘯的春風已經減弱，成了習習的微風。"},{"english":"On breezy days we used to enjoy flying kites on the beach.","chinese":"在涼風習習的天，我們用來享受飛行的風箏在沙灘上。"},{"english":"In fact, the air felt breezy and cool, but warm enough.","chinese":"事實上，天朗氣清，涼風習習，可是並不冷。"},{"english":"\"Xixi\" is an adjective.","chinese":"“習習”是個形容詞。"},{"english":"Jute detail lines midsole for a breezy finish.","chinese":"一個涼風習習的完成爲底的黃麻詳細線。"},{"english":"My words, quietly lying on the rocks, away against Zhushan, dress blowing.","chinese":"我的文字，靜靜地躺在岩石邊，遙對珠山，衣裙習習。"},{"english":"Its green boughs in the breezy sky.","chinese":"它翠綠的枝幹伸向微風習習的天空。"}],"related":[]}