{"definition":["to use habitually\/usual\/conventional"],"pinyin":["xi2 yong4"],"simplified":["习用"],"rank":61717.0,"normalized_rank":0.8635009024386832,"fraction":3.138518977531542e-8,"cumulative_fraction":0.999877338503614,"word":"習用","characters":[{"definition":["(bound form) to practice\/to study\/habit\/custom","surname Xi"],"pinyin":["Xi2","xi2"],"word":"習"},{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"}],"containing_words":[],"sentences":[{"english":"The paper explores the problems occurring in the existing translation works.","chinese":"該論文將習用語翻譯中出現的問題歸納爲三類。"},{"english":"But in Yunnan province, many plants (including D. delavayi) are habitually used as Rhizoma Drynariae.","chinese":"而在雲南省則習用多種植物。"},{"english":"The soil criteria of P supplying ability worked out here were much lower than that commonly used for farmland.","chinese":"本文擬訂的供磷能力分等標準比農田習用的要低得多。"},{"english":"This kind of fruit tastes very good.","chinese":"這家商店有很多種學習用品。"},{"english":"He sells school things every day .","chinese":"他每天賣學習用品。"},{"english":"This is the accustomed terms of payment in all-embracing business.","chinese":"這是國際商業中習用的付款方式。"},{"english":"This is the normis terms of payment in internis online coair conditioningh business.","chinese":"這是國際貿易中習用的付款步驟。"},{"english":"The site also allows students to buy and sell old textbooks and other school supplies.","chinese":"學生們也可以在這個網站上買賣舊書或者學習用品。"},{"english":"Idioms are very close with culture, which can be testified by its origins.","chinese":"從它的來源來看，習用語與文化有着緊密的聯繫。"},{"english":"There are many stationary for the students in Si Chuan. How many? Let's count. One.","chinese":"把講臺佈置成爲四川災區學生捐學習用品的場景。"},{"english":"You will have some school supply words today in the lesson.","chinese":"今天的課程中，你們會遇到一些關於學習用品的單詞。"},{"english":"Twenty-three per cent of Tokyo schoolchildren will rely on government aid for things such as school supplies this year.","chinese":"今年，東京23%的小學生要依靠政府資助學習用品。"},{"english":"Objective To research the antibacterial activity of varieties of Flos Lonicerae produced in Sichuan.","chinese":"目的探討川產習用金銀花的抑菌作用。"},{"english":"The next day, Hagrid takes Harry to London to shop for school supplies.","chinese":"第二天，海格帶着哈利去倫敦購買學習用品。"},{"english":"I want some school things for my son.","chinese":"我要爲我兒子買一些學習用品。"},{"english":"English is a language abounding with idiomatic expressions.","chinese":"英語是一種習用語極其豐富的語言。"}],"related":[]}