{"definition":["to warp\/to bend\/fig. distorted opinion\/prejudice"],"pinyin":["qiao2 qu1"],"simplified":["翘曲"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"翹曲","characters":[{"definition":["outstanding\/to raise","to stick up\/to rise on one end\/to tilt"],"pinyin":["qiao2","qiao4"],"word":"翹"},{"definition":["bent\/crooked\/wrong","surname Qu","tune\/song\/CL:支[zhi1]"],"pinyin":["Qu1","qu1","qu3"],"word":"曲"}],"containing_words":[],"sentences":[{"english":"Bedrock beneath hebgen lake warped and rotated, causing a seiche in the lake .","chinese":"赫布根湖底的基岩發生了翹曲和旋轉，引起湖中浪湧。"},{"english":"It has improved impact resistance and low warpage.","chinese":"它改善了耐衝擊性和低翹曲。"},{"english":"The beam has started.","chinese":"橫樑已經翹曲了。"},{"english":"Is Warp Speed Safe?","chinese":"翹曲速度安全嗎？"},{"english":"All the window frames of the old building have sprung.","chinese":"這幢舊樓的所有窗框全都翹曲了。"},{"english":"The floor of the house has been started.","chinese":"那所房間裏的地板都已翹曲了。"},{"english":"The values of warping coordinates is still expressed in the calculating formulas.","chinese":"翹曲座標值，仍以計算公式表示之。"},{"english":"This effects called warping .","chinese":"此種效應稱爲翹曲。"},{"english":"Thickening the wall will help reduce orientation related warpage problems.","chinese":"增加壁厚將有助於減少因取向引起的翹曲問題。"},{"english":"It is a funny and easy to use application for photo morphing and warping.","chinese":"這是一個有趣且易於使用的應用爲照片變形和翹曲。"},{"english":"Next, inspect the gusset for warpage and straighten as needed.","chinese":"下一步，檢查和整頓的翹曲扣板根據需要的一面。"},{"english":"According to the statistical results, the injection time is the most important affecting factor on warpage.","chinese":"結果表明，注射時間對注塑件翹曲變形的影響最大。"},{"english":"Thicker parts also tend to warp less.","chinese":"較厚零件也有助於減少翹曲。"},{"english":"The speckle projection correlation technique is used to measure the chip warpage.","chinese":"本文采用投影散斑相關法對芯片翹曲度進行了測量。"},{"english":"So what do you do when your profile warps?","chinese":"那麼，型材翹曲時，我們該怎樣做呢？"},{"english":"The warped phenomenon is mitigated when the chordal height decreases.","chinese":"隨着弦高的減小，翹曲現象減輕，漸呈准直線。"}],"related":[]}