{"definition":["to toss and turn (sleeplessly)\/again and again"],"pinyin":["fan1 lai2 fu4 qu4"],"simplified":["翻来覆去"],"rank":29532.0,"normalized_rank":0.413190995200985,"fraction":9.79071943362979e-7,"cumulative_fraction":0.989792280731498,"word":"翻來覆去","characters":[{"definition":["to turn over\/to flip over\/to overturn\/to rummage through\/to translate\/to decode\/to double\/to climb over or into\/to cross"],"pinyin":["fan1"],"word":"翻"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["to cover\/to overflow\/to overturn\/to capsize","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4"],"word":"覆"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"That night, the boy couldn’t sleep for disappointment.","chinese":"那天晚上，小男孩失望極了，翻來覆去怎麼也睡不着。"},{"english":"You sigh, toss and turn, and try to get to sleep.","chinese":"你長吁短嘆，翻來覆去，試圖能夠入睡。"},{"english":"He tossed fretfully and could not get to sleep.","chinese":"但是東想西想，急躁地翻來覆去終夜不能入眠。"},{"english":"They found the man turning from side to side on his bed, still unconscious.","chinese":"他們發現那人在牀上翻來覆去，仍然神志不清。"},{"english":"I tossed and turned all ngiht.","chinese":"我整晚翻來覆去。"},{"english":"He keeps on harping on the same thing.","chinese":"他總是翻來覆去地講一件事。"},{"english":"And certainly don't ruminate on your own.","chinese":"當然你不要自個把事情翻來覆去地想個不停。"},{"english":"I listened, and tossed about, and, finally, dressed and descended.","chinese":"我諦聽着，翻來覆去，終於穿上衣服下了樓。"},{"english":"I’ve been turning over these questions in my head for the past two weeks.","chinese":"近兩週來我一直在翻來覆去地思考這兩個問題。"},{"english":"as you read and turn the thin message in your hands.","chinese":"閱讀信上的字句，一張薄紙在手中翻來覆去。"},{"english":"Lab work is dull and repetitious .","chinese":"實驗室裏的工作味同嚼蠟翻來覆去。"},{"english":"I tossed and turned all night.","chinese":"我整晚翻來覆去。"},{"english":"Tossed and turned at night, the prince is still can not sleep, Wu Guanzhi dont understand the idea.","chinese":"夜裏，王子尚翻來覆去睡不着，吳冠志卻不懂其想法。"},{"english":"She tossed restlessly in her sleep.","chinese":"她翻來覆去地睡不着。"},{"english":"This is what she has been saying over and over again.","chinese":"這種話，她翻來覆去不知說過多少遍了。"},{"english":"You ever toss and turn your llying awake and thinking about the one you love?","chinese":"你是否曾經翻來覆去的睡不着，因爲來思念着你的愛？"}],"related":[]}