{"definition":["to roll\/to turn over\/to invert\/to flip"],"pinyin":["fan1 zhuan3"],"simplified":["翻转"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"翻轉","characters":[{"definition":["to turn over\/to flip over\/to overturn\/to rummage through\/to translate\/to decode\/to double\/to climb over or into\/to cross"],"pinyin":["fan1"],"word":"翻"},{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"}],"containing_words":[],"sentences":[{"english":"If it is too flat, athletes will flip .","chinese":"如果太平，運動員將翻轉。"},{"english":"Forks tooling for handling pallets.","chinese":"叉形工具用於翻轉棧板。"},{"english":"Finally, MaXiao point to my pistol suddenly flip, pointing blade.","chinese":"終於，馬嘯指向本人的手槍忽然翻轉，指向刀鋒。"},{"english":"So there I was happily pan frying the slabs when I lost my grip on one as I was turning it.","chinese":"我高興地用煎鍋煎魚片，在翻轉魚片時我失手了。"},{"english":"Review all key points which are listed on flip chart .","chinese":"回顧翻轉展示板上的要點。"},{"english":"The top flap is then flipped back up into place.","chinese":"然後將貼膜頂部翻轉回原來的位置。"},{"english":"Multiplayer Spades, Backgammon, Hearts, Checkers, and Reversi.","chinese":"多玩家黑桃王，雙陸棋，紅心大戰，跳棋和翻轉棋。"},{"english":"Unique reversal structure suitable to various IC bonding.","chinese":"獨特翻轉式結構，適用於各種尺寸IC邦定。"},{"english":"Cushion can turn over changeover to use, answer to retroflexion every week, make wear away to distributing equably .","chinese":"墊子可翻轉換用，應每週翻轉一次，使磨損均勻分佈。"},{"english":"At the end of a cycle, the magnetic field rapidly reverses its polarity.","chinese":"在週期的最後，磁場的兩極快速翻轉。"},{"english":"But when I knew this time, I saw straight away that turning over the hand is Rupa and Nama.","chinese":"但當我這次了悟時，我當下見到翻轉手臂是色與名。"},{"english":"In case of big defect, anterior rectus sheath flap was placed in addition.","chinese":"腹直肌前鞘翻轉成形可補充修補巨大缺損。"},{"english":"In this way, the double helices can be turned back and forth at will.","chinese":"如此一來，我們就可以隨意來回翻轉雙股螺旋。"},{"english":"His car rolled over then exploded.","chinese":"他的車子翻轉然後爆炸了。"},{"english":"It works by separating the mirror flip and aperture opening into two steps.","chinese":"它將鏡面翻轉和光圈打開分爲兩個步驟。"},{"english":"Don't lean too forward or back when trying a 360 flip trick.","chinese":"不要太向前或向後傾斜時，試圖一招360翻轉。"}],"related":[{"definition":["to rotate (about an axis)\/to revolve\/to turn\/to move in a circle\/to gyrate","to turn sth around\/to swivel"],"pinyin":["zhuan3 dong4","zhuan4 dong4"],"word":"轉動"},{"definition":["to change\/to transform\/shift\/transformation\/CL:個|个[ge4]"],"pinyin":["zhuan3 bian4"],"word":"轉變"},{"definition":["reversal\/inversion\/to reverse\/to invert (upside down, inside out, back to front, white to black etc)"],"pinyin":["fan3 zhuan3"],"word":"反轉"},{"definition":["to rotate\/to revolve\/to spin\/to whirl"],"pinyin":["xuan2 zhuan3"],"word":"旋轉"},{"definition":["general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead","to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])"],"pinyin":["jiang1","jiang4","qiang1"],"word":"將"},{"definition":["brand new"],"pinyin":["zhan3 xin1"],"word":"嶄新"},{"definition":["to reappear"],"pinyin":["chong2 xian4"],"word":"重現"},{"definition":["to pass through\/to penetrate\/by means of\/via"],"pinyin":["tou4 guo4"],"word":"透過"},{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"word":"展現"},{"definition":["three-dimensional\/solid\/stereoscopic"],"pinyin":["li4 ti3"],"word":"立體"},{"definition":["one's impressions\/observations"],"pinyin":["guan1 gan3"],"word":"觀感"},{"definition":["to open\/to start\/(computing) to enable"],"pinyin":["kai1 qi3"],"word":"開啟"},{"definition":["to take advantage\/to seize an opportunity\/in passing\/without taking extra trouble\/conveniently"],"pinyin":["shun4 shi4"],"word":"順勢"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰顯"},{"definition":["change\/variation\/to change\/to vary\/CL:個|个[ge4]"],"pinyin":["bian4 hua4"],"word":"變化"},{"definition":["to use\/to put to use"],"pinyin":["yun4 yong4"],"word":"運用"}]}