{"definition":["to overturn\/to turn upside down"],"pinyin":["fan1 guo4 lai2"],"simplified":["翻过来"],"rank":35377.0,"normalized_rank":0.4949701285800232,"fraction":5.863921271043815e-7,"cumulative_fraction":0.9942730794616542,"word":"翻過來","characters":[{"definition":["to turn over\/to flip over\/to overturn\/to rummage through\/to translate\/to decode\/to double\/to climb over or into\/to cross"],"pinyin":["fan1"],"word":"翻"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"}],"containing_words":[],"sentences":[{"english":"\"As soon as we rolled him over, he gasped and started crying, \" Harmon says.","chinese":"“我們把他翻過來，他一邊喘氣一邊哭”哈蒙說。"},{"english":"Fry the steak for five minutes and then turn it and fry the other side.","chinese":"把牛排煎五分鐘，然後翻過來再煎另一面。"},{"english":"'You can't keep flipping the cushions every time a new person comes along,' he says.","chinese":"他說，你總不能在每次來新人的時候都把椅墊翻過來。"},{"english":"Now flip the hakama over and perform this on the other side.","chinese":"現在翻過來在另一面完成同樣操作。"},{"english":"Hand turned over the securities, eying their gold seals .","chinese":"韓德把那些證券翻過來，瞅着上面打的金印。"},{"english":"If you choose to build a wall around your heart, make it low enough for love to climb over.","chinese":"如果要築起心牆，也記得砌低點，好讓愛還能翻過來。"},{"english":"She flipped an egg over in the pan.","chinese":"她把平鍋裏的雞蛋猛然翻過來。"},{"english":"He emptied his pockets but couldn't find the ticket.","chinese":"他把褲袋都翻過來，還是找不到票。"},{"english":"I had to hear Beethoven before I could ask him to roll over .","chinese":"我得先聽一下貝多芬曲，才能請他把唱片翻過來。"},{"english":"Please reverse your examination paper.","chinese":"請把試卷翻過來。"},{"english":"Reverse your sweater or you will put it on wrong side out.","chinese":"把你的羊毛衣翻過來，要不然你就穿反了。"},{"english":"Most of the dead and injured were in three carriages which were derailed and overturned.","chinese":"大部分傷亡乘客是在三節脫軌，翻過來的車廂裏。"},{"english":"If anyone had turned him over, he might have survived.","chinese":"如果哪怕是有一個人把他翻過來，他都會倖免的。"},{"english":"If anyone had turned him over he might have survived.","chinese":"如果哪怕是有一個人把他翻過來，他都會倖免的。"},{"english":"Turn the cards over looking for the Wheel of Fortune . Its position gives you the answer.","chinese":"把牌翻過來尋找一下命運之輪，它的位置會給你答案。"},{"english":"Instead of coffee tables, designers seem to have used upturned wooden boxes.","chinese":"看起來設計者是把木箱子翻過來當咖啡桌使用。"}],"related":[]}