{"definition":["to turn over\/to transform"],"pinyin":["fan1 guo4"],"simplified":["翻过"],"rank":18952.0,"normalized_rank":0.26516306857134864,"fraction":0.0000026677411309018104,"cumulative_fraction":0.9721877536565138,"word":"翻過","characters":[{"definition":["to turn over\/to flip over\/to overturn\/to rummage through\/to translate\/to decode\/to double\/to climb over or into\/to cross"],"pinyin":["fan1"],"word":"翻"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"}],"containing_words":[{"definition":["to overturn\/to turn upside down"],"pinyin":["fan1 guo4 lai2"],"word":"翻過來"}],"sentences":[{"english":"Someone's been rifling through my drawers, there's some money missing.","chinese":"有人翻過我的抽屜，一些錢不見了。"},{"english":"His field has been hacked after harvest.","chinese":"收穫之後他的田地已經翻過了。"},{"english":"Since he’s the past,why not turn over this page?","chinese":"既然他已經是過去了，爲什麼不翻過這一頁呢？"},{"english":"As he clambered over the railings he grinned at Manuel.","chinese":"在他攀爬翻過圍欄時他對曼紐爾咧嘴笑了笑。"},{"english":"\"As soon as we rolled him over, he gasped and started crying, \" Harmon says.","chinese":"“我們把他翻過來，他一邊喘氣一邊哭”哈蒙說。"},{"english":"Fry the steak for five minutes and then turn it and fry the other side.","chinese":"把牛排煎五分鐘，然後翻過來再煎另一面。"},{"english":"Someone's turned the chest out alow and aloft.","chinese":"有人把箱子上上下下都翻過了。"},{"english":"We have turned the page from this black internal divi-sion.","chinese":"我們已經把內部分裂這黑暗的一頁翻過去了。"},{"english":"When it turns over a new leaf.","chinese":"當它把一片剛落的葉子吹翻過來時。"},{"english":"Just turn the page.","chinese":"翻過去這一頁吧。"},{"english":"Turn the patient over onto his front.","chinese":"把病人翻過去讓他俯臥。"},{"english":"The burglar jumped over a neighboring garden wall and disappeared in the darkness.","chinese":"那個竊賊從鄰居花園的牆頭翻過去，消失在黑暗中。"},{"english":"'You can't keep flipping the cushions every time a new person comes along,' he says.","chinese":"他說，你總不能在每次來新人的時候都把椅墊翻過來。"},{"english":"Panting, Harry fell forwards over the hydrangea bush, straightened up and stared around.","chinese":"哈利氣喘着向前翻過八仙花灌木，站直並往周圍看着。"},{"english":"The wind turned my umbrella inside out .","chinese":"風把我的傘吹得翻過去了。"},{"english":"As he turns it over, he discovers that one end is loose.","chinese":"他將念珠翻過來看時，發現其中一端鬆動了。"}],"related":[]}