{"definition":["previous generation\/older generation"],"pinyin":["lao3 yi1 bei4"],"simplified":["老一辈"],"rank":17536.0,"normalized_rank":0.2453513914345277,"fraction":0.00000309005440541338,"cumulative_fraction":0.9681261504107156,"word":"老一輩","characters":[{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["lifetime\/generation\/group of people\/class\/classifier for generations\/(literary) classifier for people"],"pinyin":["bei4"],"word":"輩"}],"containing_words":[],"sentences":[{"english":"So had most of the veteran revolutionaries.","chinese":"同樣西去的還有大多數老一輩革命家。"},{"english":"There are a lot of young artists and older artists, too, that live in that area","chinese":"那裏住着很多年輕的藝術家和老一輩的藝術家。"},{"english":"Old-time druggists depended on the prescription and patent medicine trade to sustain their operations.","chinese":"老一輩的藥師靠處方和專利藥來維持生意。"},{"english":"This year is birthday of Peng Zhen of revolutionist of older generation proletariat 100 years.","chinese":"今年是老一輩無產階級革命家彭真誕辰100週年。"},{"english":"Your generation is definitely leading the way, and people who are older are beginning to wake up as well.","chinese":"你的課題是前驅先導，當然老一輩也開始覺醒。"},{"english":"The older generation blows bubbles, and the young-developger generation breaks them.","chinese":"老一輩製造出來的空洞理論，年輕一輩將它們打破。"},{"english":"Filed Donglai Bank, Qingdao older people do not do not know.","chinese":"提起東萊銀行，老一輩的青島人沒有不知道的。"},{"english":"But she added that this applies to older generations.","chinese":"但是她接着說，這些比較符合老一輩。"},{"english":"Now the Chinese younger generation is not as job-oriented as the older generations.","chinese":"現在中國的年輕一代已不像老一輩那樣以工作爲重心。"},{"english":"\"The older generation is more accommodating of the state, \" says Mr Azmy.","chinese":"阿斯麥先生說“老一輩更適應國家現狀“。"},{"english":"The older people remember days of clear-aired yore.","chinese":"老一輩人還記得昔日晴朗的天空。"},{"english":"It's those of us in the older generation who have to make adjustments.","chinese":"必須做出調整的是我們這些老一輩人。"},{"english":"Prof. Chen Lesu is one of the earliest scholars who started the study.","chinese":"陳樂素教授便是最早從事宋史研究的老一輩學者之一。"}],"related":[]}