{"definition":["lit. old general\/commander-in-chief 將帥|将帅, the equivalent of king in Chinese chess\/fig. old-timer\/veteran"],"pinyin":["lao3 jiang4"],"simplified":["老将"],"rank":4543.0,"normalized_rank":0.06356246414730038,"fraction":0.000027634878563605516,"cumulative_fraction":0.8471730326704688,"word":"老將","characters":[{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead","to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])"],"pinyin":["jiang1","jiang4","qiang1"],"word":"將"}],"containing_words":[],"sentences":[{"english":"I had to listen to the manager and players like Giggsy – he gives me advice all the time.","chinese":"我請教過經理和老將，他們總是給我建議。"},{"english":"One night, Zhou Yu was thinking hard in his tent about how to defeat Cao Cao's army, when Huang Gai came in .","chinese":"一日深夜，老將黃蓋來到帳中，商議破曹以火攻爲好。"},{"english":"The old veteran could tire out the most robust sportsman.","chinese":"這位久經沙場的老將能把最強壯的運動員拖得筋疲力。"},{"english":"The performance also secured a raft of records for veteran Wu.","chinese":"這一成績也讓老將吳敏霞創造了一系列紀錄。"},{"english":"Finley is expected to sign for the prorated veteran minimum.","chinese":"芬利可能在幾天內籤一份老將底薪合約。"},{"english":"This is a story from Three Kingdoms. Huang Zhong, a veteran in the army of Shu, was one of its top five generals.","chinese":"黃忠是蜀軍中有名的老將。"},{"english":"This is a story from Three Kingdoms. Huang Zhong， a veteran in the army of Shu， was one of its top five generals.","chinese":"黃忠是蜀軍中有名的老將。"},{"english":"He navigates celebrity dinner galas like a seasoned politician.","chinese":"他遊刃有餘地參加名流晚宴，宛如政壇老將。"},{"english":"The world by tomorrow tired, spring bitter autumn comes after veteran to.","chinese":"世人苦被明日累，春去秋來老將至。"},{"english":"All mortals are tired for the sake of tomorrow","chinese":"世人若被明日累，春來秋去老將至。"},{"english":"Rock and roll veteran Keith Richards has a cameo as Captain Jack's father.","chinese":"搖滾老將基思理查茲擁有作爲傑克船長的父親客串。"},{"english":"However, the United manager insists his longest-serving player still has an important job to do at Old Trafford.","chinese":"不過，曼聯經理說這位老將還是要在曼聯工作。"}],"related":[{"definition":["(in classical literature) young military officer of high rank for his age\/(during the Cultural Revolution) young militant in the Red Guard\/(in modern usage) rising star (in sport, politics etc)"],"pinyin":["xiao3 jiang4"],"word":"小將"},{"definition":["core\/nucleus\/backbone"],"pinyin":["zhong1 jian1"],"word":"中堅"},{"definition":["(sports) member of the national team\/national representative\/(medicine, chess etc) one of the most highly skilled practitioners in one's country"],"pinyin":["guo2 shou3"],"word":"國手"},{"definition":["(military) commander-in-chief\/(sports) team manager\/coach"],"pinyin":["zhu3 shuai4"],"word":"主帥"},{"definition":["the national team"],"pinyin":["guo2 jia1 dui4"],"word":"國家隊"},{"definition":["high-ranking military officer"],"pinyin":["jiang4 ling3"],"word":"將領"},{"definition":["sports club member\/footballer, golfer etc"],"pinyin":["qiu2 yuan2"],"word":"球員"},{"definition":["to defend the crown (in sports championship)"],"pinyin":["wei4 mian3"],"word":"衛冕"},{"definition":["famous general"],"pinyin":["ming2 jiang4"],"word":"名將"},{"definition":["commander-in-chief (military)\/star player (sports)\/key figure (in an organization)"],"pinyin":["zhu3 jiang4"],"word":"主將"},{"definition":["to return to one's unit\/to go back to one's station in life"],"pinyin":["gui1 dui4"],"word":"歸隊"},{"definition":["to replace (a damaged component with a new one, an injured player with a substitute player, full-time workers with casual workers etc)\/a substitute\/a replacement"],"pinyin":["ti4 bu3"],"word":"替補"},{"definition":["racetrack\/field (for athletics competition)"],"pinyin":["sai4 chang3"],"word":"賽場"},{"definition":["(Tw) (sports) foreign player\/import"],"pinyin":["yang2 jiang4"],"word":"洋將"},{"definition":["semifinals"],"pinyin":["ban4 jue2 sai4"],"word":"半決賽"},{"definition":["sports team (basketball, soccer, football etc)"],"pinyin":["qiu2 dui4"],"word":"球隊"}]}