{"definition":["(coll.) father's father's mother\/paternal great-grandmother\/respectful form of address for an old woman"],"pinyin":["lao3 nai3 nai5"],"simplified":["老奶奶"],"rank":23206.0,"normalized_rank":0.3246820477662894,"fraction":0.0000017470602382836041,"cumulative_fraction":0.9814015262994092,"word":"老奶奶","characters":[{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["breast\/milk\/to breastfeed"],"pinyin":["nai3"],"word":"奶"},{"definition":["breast\/milk\/to breastfeed"],"pinyin":["nai3"],"word":"奶"}],"containing_words":[],"sentences":[{"english":"This is an age-old approach, recommended by many country grandmothers.","chinese":"這是一種古老的方法，由許多鄉村老奶奶推薦。"},{"english":"The kind grandma shows her mercy on every orphan.","chinese":"這位仁慈的老奶奶對每個孤兒都很憐惜。"},{"english":"She stood up first so as to help the old lady off the bus.","chinese":"爲了攙扶那位老奶奶下車，她先站了起來。"},{"english":"Old women all like sitting in the tree shadows and gossiping on summer days.","chinese":"老奶奶們到了夏天都愛坐在樹陰涼兒里拉家常。"},{"english":"Granny quietly touched the small umbrella, and then put her back in the cupboard.","chinese":"老奶奶悄悄摸了摸小花傘，然後把她放回了櫃子。"},{"english":"The part of the old grandmother was played by Julia.","chinese":"劇中的老奶奶的角色由朱麗亞扮演。"},{"english":"World Cup fever has spread to South African grannies, with dozens of elderly women in aprons and skirts fighting for the ball.","chinese":"世界盃的旋風颳到了南非的一羣老奶奶身上。"},{"english":"While examining the wandering village herd, he noticed Grandma's Blackie.","chinese":"他觀察村中漫遊的牧羣，注意到了老奶奶的小黑子。"},{"english":"But the lady just smiled and thanked me.","chinese":"老奶奶笑着道了謝。"},{"english":"It's wrong to back grandma into a coner and guard her.","chinese":"把老奶奶逼到牆角看住她是不對的。"},{"english":"You'll see teenagers and grandmothers, women from sizes petite to plus.","chinese":"你會看到小姑娘和老奶奶，從嬌小型到龐大型。"},{"english":"This old gramma sits here everyday watching the children play in the street.","chinese":"這位老奶奶每天都坐在這裏，看着孩子們在街邊玩耍。"},{"english":"This week I have nothing sepecial except helping an old lady across the road.","chinese":"這周我和平時一樣除了幫助一老奶奶過馬路。"},{"english":"Grandma 24)groped at the fresh paint for a moment.","chinese":"老奶奶在還未乾的油漆上摸索片刻。"},{"english":"Bing was a second-team matches grandmother away.","chinese":"第二隊火柴兵被一位老奶奶帶走了。"},{"english":"On her way to the cinema, Liu Mei met an old woman.","chinese":"劉梅在去影院的路上遇到了一位老奶奶。"}],"related":[{"definition":["(coll.) father's father's father\/paternal great-grandfather"],"pinyin":["lao3 ye2 ye5"],"word":"老爺爺"},{"definition":["uncle\/grandpa\/CL:位[wei4]"],"pinyin":["lao3 da4 ye2"],"word":"老大爺"},{"definition":["elderly lady (respectful)\/esteemed mother\/CL:位[wei4]"],"pinyin":["lao3 tai4 tai5"],"word":"老太太"},{"definition":["(informal) grandma (paternal grandmother)\/(respectful) mistress of the house\/CL:位[wei4]\/(coll.) boobies\/breasts"],"pinyin":["nai3 nai5"],"word":"奶奶"},{"definition":["old lady\/Madam (polite address)\/CL:位[wei4]"],"pinyin":["lao3 da4 niang2"],"word":"老大娘"},{"definition":["granny\/mother-in-law"],"pinyin":["a1 po2"],"word":"阿婆"},{"definition":["old man or woman\/the elderly\/one's aged parents or grandparents"],"pinyin":["lao3 ren2"],"word":"老人"},{"definition":["maternal aunt\/step-mother\/childcare worker\/nursemaid\/woman of similar age to one's parents (term of address used by child)\/CL:個|个[ge4]"],"pinyin":["a1 yi2"],"word":"阿姨"},{"definition":["(coll.) father's older brother\/uncle\/term of respect for older man","arrogant idler\/self-centered show-off"],"pinyin":["da4 ye2","da4 ye5"],"word":"大爺"},{"definition":["father's elder brother's wife\/aunt (affectionate term for an elderly woman)"],"pinyin":["da4 ma1"],"word":"大媽"},{"definition":["(coll.) father's father\/paternal grandfather\/CL:個|个[ge4]"],"pinyin":["ye2 ye5"],"word":"爺爺"},{"definition":["(coll.) father's older brother's wife\/aunt (polite address)"],"pinyin":["da4 niang2"],"word":"大娘"},{"definition":["\"Madam\" (affectionate term for an elderly woman)\/CL:位[wei4]"],"pinyin":["lao3 da4 ma1"],"word":"老大媽"},{"definition":["grandpa (polite form of address for old man)"],"pinyin":["lao3 bo2 bo5"],"word":"老伯伯"},{"definition":["old lady"],"pinyin":["lao3 tai4"],"word":"老太"},{"definition":["(of an elderly couple) husband or wife"],"pinyin":["lao3 ban4"],"word":"老伴"}]}