{"definition":["uncle\/grandpa\/CL:位[wei4]"],"pinyin":["lao3 da4 ye2"],"simplified":["老大爷"],"rank":22675.0,"normalized_rank":0.31725266883998154,"fraction":0.0000018407778747289646,"cumulative_fraction":0.9804491987710844,"word":"老大爺","characters":[{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["grandpa\/old gentleman"],"pinyin":["ye2"],"word":"爺"}],"containing_words":[],"sentences":[{"english":"The driver hastens next handlebar grandpa uprear, apologize again and again.","chinese":"司機趕忙下車把老大爺扶起，並連連道歉。"},{"english":"Sometimes a few old man to get on the car, we all rob the seats.","chinese":"不時有幾個老大爺上車，我們大家都搶着讓座。"},{"english":"Just then an old man entered, supported by a boy.","chinese":"就在這時候，一個男孩攙着一位老大爺走了進來。"},{"english":"The young man gave up his seat to an old man.","chinese":"那年青人將座位讓給一位老大爺。"},{"english":"After attending evening classes Grandpa became more open-minded.","chinese":"老大爺上夜校以後，腦筋更開通了。"},{"english":"Grandpa, can I have a drink?","chinese":"老大爺，能給我口水喝麼？"},{"english":"There is an old man under that tree.","chinese":"那棵樹下有位老大爺。"},{"english":"Be those old men walking across the street?","chinese":"那些老大爺在橫過馬路嗎？"},{"english":"This old man has an eye for curios.","chinese":"這個老大爺有辨別古董的眼力。"},{"english":"It serves as a prerequisite for Reapers to be built at the Barracks.","chinese":"兵營是雙槍老大爺的前提建築之一。"},{"english":"The old man often goes to the teahouse to drink tea .","chinese":"那位老大爺經常到茶館裏喝茶。"},{"english":"A group of children surrounded the old man.","chinese":"一羣孩子把老大爺圍住了。"},{"english":"You get your hands well, old man.","chinese":"你把你的手養好，老大爺。"}],"related":[]}