{"definition":["callus (patch or hardened skin)\/corns (on feet)\/also 老趼"],"pinyin":["lao3 jian3"],"simplified":["老茧"],"rank":39014.0,"normalized_rank":0.5458564772711374,"fraction":4.214374087503981e-7,"cumulative_fraction":0.9960917120924556,"word":"老繭","characters":[{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["cocoon\/callus"],"pinyin":["jian3"],"word":"繭"}],"containing_words":[],"sentences":[{"english":"For years, he prone paint and his hands full of callosity.","chinese":"長年俯地作畫，令他雙手佈滿老繭。"},{"english":"The long march had callused his feet.","chinese":"沃爾登握了握他那長滿老繭的手。"},{"english":"But the benefits will likelyoutweigh the callouses.","chinese":"但它的優點能蓋過這些老繭的。"},{"english":"He says a few calluses can help runners avoid injuries.","chinese":"他說，些許老繭可以幫助跑步者免受傷害。"},{"english":"Mcteague exhibited his hard, calloused palms .","chinese":"麥克梯格攤開那雙生滿老繭堅硬的手掌。"},{"english":"Today my old slan has become as dust.","chinese":"今天，我的老繭化爲塵埃。"},{"english":"Chan Kwok-Shing's index finger touched callosity said with a smile.","chinese":"陳國盛撫摸着食指上的老繭笑着說。"},{"english":"Today I shed my old skin which hath , too long , suffered the bruises of failure and wounds of mediocrity.","chinese":"今天，我爬出滿是失敗創傷和平庸劣跡的老繭。"},{"english":"His hands were rough and calloused, from years of karate practice.","chinese":"由於多年練習空手道，他的雙手粗糙不平，佈滿老繭。"},{"english":"For most people, eliminating the source of friction helps corns and calluses disappear.","chinese":"對大多數人來說，消除磨損源能讓雞眼和老繭消失。"},{"english":"The palms of your hands will thicken, the skin of your cheeks will tan.","chinese":"你手掌的老繭會越來越厚，你的雙頰會被曬得黝黑。"},{"english":"You should see the thick calluses on my feet.","chinese":"你們真該看看我腳上的那三個老繭。"},{"english":"Today, I crawl out the fully defeated wound callus.","chinese":"今天，我爬出滿是失敗創傷的老繭。"},{"english":"I showed my callused hands in court.","chinese":"我在法庭上展示我佈滿老繭手。"},{"english":"I saw the callous spot on your right forefinger where the handle of the pestle rubs.","chinese":"我看到你右手食指被乳鉢柄摩出老繭的地方了。"},{"english":"I go to school and just take grandma work-gnarled hands that go back to the kindergarten.","chinese":"我上學也只是牽着奶奶那雙佈滿老繭的手走回幼兒園。"}],"related":[]}