{"definition":["old road\/familiar way\/beaten track\/conventional behavior"],"pinyin":["lao3 lu4"],"simplified":["老路"],"rank":20109.0,"normalized_rank":0.2813509996782001,"fraction":0.000002367903085327402,"cumulative_fraction":0.9750975281743745,"word":"老路","characters":[{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["road\/CL:條|条[tiao2]\/journey\/route\/line (bus etc)\/sort\/kind","surname Lu"],"pinyin":["Lu4","lu4"],"word":"路"}],"containing_words":[],"sentences":[{"english":"We may just be following Mother Nature's ancient recipe.","chinese":"我們可能正走在大自然曾走過的老路，步其後塵。"},{"english":"However, the long-expected \"new\" head acts exactly like the \"old\" one.","chinese":"可是他們期待的新村長依然走着上一任村長的老路。"},{"english":"After all, conservatism and the old ways won the battle.","chinese":"最終還是保守派和老路子贏得了這場戰爭。"},{"english":"These paths all require work and self-discipline.","chinese":"這些老路都需要努力工作以及自律的精神。"},{"english":"China cannot follow the traditional, Western path of industrialisation.","chinese":"我們不能走西方國家工業化的老路。"},{"english":"They would rather have familiar experiences than novel ones.","chinese":"他們寧願走老路而不願體驗新奇的事物。"},{"english":"Even the Chinese are abandoning their methods and trying to be like us.","chinese":"甚至中國也開始放棄他們的老路子來效仿我們。"},{"english":"It is a great on-road car as well as being able to drive off the beaten track.","chinese":"這是一個巨大的硫汽車以及能夠驅趕走老路。"},{"english":"There is one alternative, and that is to try and keep everything exactly the way it was, which will not work.","chinese":"這是一種代替，繼續保持所有的事走老路是行不通的。"},{"english":"We should not retrace the route our forefathers had taken.","chinese":"我們不應重走我們祖先走過的老路。"},{"english":"Your essence remains the Nazi mantle, you are still wear new shoes to follow the beaten track.","chinese":"你的骨子裏仍然是納粹的衣鉢，你還在穿新鞋走老路。"},{"english":"He should change his method and not adhere to the old way any longer .","chinese":"他應該改弦更張，不要再走老路了。"},{"english":"And I have gone beyond and shown a new way.","chinese":"我突破過去的老路子，展示了一種戰爭的新方法。"},{"english":"The temptation to stick with the old ways will be strong.","chinese":"但堅持走老路的誘惑會是強烈的。"},{"english":"It's really saddening for her to find out a year later that she's right back where she started.","chinese":"一年之後她很傷心的發現自己又走回了原來的老路。"}],"related":[{"definition":["see 邪道[xie2 dao4]"],"pinyin":["xie2 lu4"],"word":"邪路"},{"definition":["the road back to where one came from"],"pinyin":["hui2 tou2 lu4"],"word":"回頭路"},{"definition":["method\/way\/approach"],"pinyin":["lu4 zi5"],"word":"路子"},{"definition":["downhill road\/(fig.) downhill path"],"pinyin":["xia4 po1 lu4"],"word":"下坡路"},{"definition":["to turn back\/to backtrack\/(fig.) to revert to the former way of doing things"],"pinyin":["zou3 hui2 tou2 lu4"],"word":"走回頭路"},{"definition":["to repeat\/to follow the same road as"],"pinyin":["chong2 dao3"],"word":"重蹈"},{"definition":["disastrous policy"],"pinyin":["fu4 zhe2"],"word":"覆轍"},{"definition":["to follow the track of an overturned cart\/to repeat a disastrous policy"],"pinyin":["chong2 dao3 fu4 zhe2"],"word":"重蹈覆轍"},{"definition":["winding road\/roundabout route\/detour\/(fig.) wrong way (of doing sth)"],"pinyin":["wan1 lu4"],"word":"彎路"},{"definition":["bon voyage\/Godspeed"],"pinyin":["hao3 zou3"],"word":"好走"},{"definition":["to stick to one's ways\/to cling to one's course"],"pinyin":["yi1 tiao2 dao4 zou3 dao4 hei1"],"word":"一條道走到黑"},{"definition":["direction\/strike (i.e. angle of inclination in geology)\/inclination\/trend\/to move towards\/to head for"],"pinyin":["zou3 xiang4"],"word":"走向"},{"definition":["lit. trailing dust\/fig. sb's footsteps\/course in life"],"pinyin":["hou4 chen2"],"word":"後塵"},{"definition":["lit. to set up a separate kitchen (idiom); to start from scratch\/back to square one\/to start of on a new path"],"pinyin":["ling4 qi3 lu2 zao4"],"word":"另起爐灶"},{"definition":["this road is blocked\/fig. This method does not work.\/Doing this is no good."],"pinyin":["ci3 lu4 bu4 tong1"],"word":"此路不通"},{"definition":["won't work\/will get (you) nowhere"],"pinyin":["xing2 bu5 tong1"],"word":"行不通"}]}