{"definition":["outmoded\/old-fashioned"],"pinyin":["lao3 jiu4"],"simplified":["老旧"],"rank":18358.0,"normalized_rank":0.2568522379080212,"fraction":0.0000028340096478975515,"cumulative_fraction":0.9705554737285216,"word":"老舊","characters":[{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["old\/opposite: new 新\/former\/worn (with age)"],"pinyin":["jiu4"],"word":"舊"}],"containing_words":[],"sentences":[{"english":"We overthrow the old qc group, because they are out of date.","chinese":"我們推翻了老舊的品管組織，因爲他們已經過時了。"},{"english":"Looking through the atmosphere is somewhat like looking through a piece of old, stained glass.","chinese":"透過大氣層觀測有些像透過一片老舊的有色玻璃。"},{"english":"Old pitons should not be reused once they fall out.","chinese":"老舊的巖釘一旦脫出之後，就不得重新加以使用。"},{"english":"In the sunniest spot stood an old mansion surrounded by a deep moat.","chinese":"在陽光最充足的地方矗立着一棟老舊的大宅邸。"},{"english":"The old bridge threatened to colla e beneath the weight of our truck.","chinese":"這座老舊的橋樑恐怕快被我們卡車的重量給壓垮了。"},{"english":"I could imagine that my old penholder feels reproachfully towards me.","chinese":"可以想象，那根老舊的筆架肯定在責怪我。"},{"english":"He also said that Lorca old building is not easy to resist earthquakes.","chinese":"他還說，洛爾卡的建築老舊，也不容易抵禦地震。"},{"english":"Should we remove or keep ancient aging buildings?","chinese":"老舊的建築究竟該拆還是留？"},{"english":"They used fluorescent lights, so they had that distinct metallic, oldish smell places that use fluorescents always have.","chinese":"使用熒光燈的地方總是充斥着老舊的氣息。"},{"english":"She lived at the old red mill on the green hill.","chinese":"她住在翠綠山丘上的老舊紅磨坊裏。"},{"english":"The city's museums are filled with mouldy old collections.","chinese":"市內博物館中塞滿老舊乏味的收藏品。"},{"english":"It is an old town with buildings that need a lot of fixing-up done to them.","chinese":"這是一個有著很多需要維修的老舊建築的老鄉鎮。"},{"english":"It seemed lost in her worn, old shopping bag.","chinese":"它在薩默斯太太那老舊的購物袋裏彷彿不見了蹤影。"},{"english":"Nung-fu needs a new blade for the old shredder.","chinese":"農夫的老舊鉸碎機需換新刀片。"},{"english":"This old and rusty rifle is a dead shot.","chinese":"正是這隻老舊的來福槍命中了那致命的一槍。"},{"english":"But the games are here and some of the older, shabby neighborhoods remain.","chinese":"奧林匹克競賽已經到來，但周邊的殘破老舊也依舊在。"}],"related":[{"definition":["old-fashioned"],"pinyin":["chen2 jiu4"],"word":"陳舊"},{"definition":["to discard\/to abandon (old ways)\/to invalidate"],"pinyin":["fei4 qi4"],"word":"廢棄"},{"definition":["shabby"],"pinyin":["po4 jiu4"],"word":"破舊"},{"definition":["old style"],"pinyin":["jiu4 shi4"],"word":"舊式"},{"definition":["facilities\/installation"],"pinyin":["she4 shi1"],"word":"設施"},{"definition":["building (a relatively large, multi-storey one)\/CL:幢[zhuang4],座[zuo4]"],"pinyin":["da4 lou2"],"word":"大樓"},{"definition":["a building used as a factory\/factory (building)\/CL:座[zuo4],棟|栋[dong4]"],"pinyin":["chang3 fang2"],"word":"廠房"},{"definition":["a building of two or more stories\/CL:棟|栋[dong4],幢[zhuang4],座[zuo4]"],"pinyin":["lou2 fang2"],"word":"樓房"},{"definition":["to replace (a worn-out tire etc)\/to change (one's address etc)"],"pinyin":["geng1 huan4"],"word":"更換"},{"definition":["maintenance (of equipment)\/to protect and maintain"],"pinyin":["wei2 xiu1"],"word":"維修"},{"definition":["simple and crude"],"pinyin":["jian3 lou4"],"word":"簡陋"},{"definition":["public facilities\/infrastructure"],"pinyin":["gong1 gong4 she4 shi1"],"word":"公共設施"},{"definition":["exterior appearance\/to view sth from the outside\/exterior condition"],"pinyin":["wai4 guan1"],"word":"外觀"},{"definition":["building\/structure\/edifice"],"pinyin":["jian4 zhu4 wu4"],"word":"建築物"},{"definition":["periphery\/rim\/surroundings\/all around\/perimeter\/peripheral (computing)\/spin-offs"],"pinyin":["zhou1 bian1"],"word":"周邊"},{"definition":["residential area\/neighborhood"],"pinyin":["ju1 min2 qu1"],"word":"居民區"}]}