{"definition":["see 老頭子|老头子[lao3 tou2 zi5]"],"pinyin":["lao3 tou2 'r"],"simplified":["老头儿"],"rank":33016.0,"normalized_rank":0.4619366753879087,"fraction":7.215674095785306e-7,"cumulative_fraction":0.9927356420737024,"word":"老頭兒","characters":[{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"},{"definition":["child\/son","non-syllabic diminutive suffix\/retroflex final"],"pinyin":["'r","er2"],"word":"兒"}],"containing_words":[],"sentences":[{"english":"A weak small spare old man.","chinese":"一個瘦弱的小老頭兒。"},{"english":"The old man looked meditatively at the darts board.","chinese":"老頭兒沉思不語，看着那投鏢板。"},{"english":"\"Light your lanthorn, old man, \" he said.","chinese":"“老頭兒，把你的燈籠點亮，”他說。"},{"english":"Run for the doctor,the old man is dying.","chinese":"這個老頭兒不行了，趕快去找醫生。"},{"english":"What is your name, old man?","chinese":"老頭兒，你叫什麼名字？"},{"english":"A sudden splash of water frightened the old man.","chinese":"忽聽嘩啦一聲水響，老頭兒嚇了一大跳。"},{"english":"Gee- I sure wish that old guy who lives next door would buy himself a hearing aid.","chinese":"嗨，我真希望隔壁那老頭兒能給本身買個助聽器。"},{"english":"Judiao seeing this old man on the knifing, and dragons were quick to jump lotus pond.","chinese":"老頭兒見狀舉刀就砍，小龍連忙躍人荷花池中。"},{"english":"I would have given ten years of my life to have been in that old man's shoes.","chinese":"我真情願少活十年來換得這個老頭兒的位置。"},{"english":"Poor old man, I didn't think he had any tears left.","chinese":"可憐的老頭兒，我沒料到他還有眼淚。"},{"english":"On these fifteen hundred francs these two old women and the old man subsisted.","chinese":"兩個老婦人和老頭兒都在那一千五百法郎裏過活。"},{"english":"The young man took the clock happily and thanked the old man.","chinese":"年輕人很高興地拿了鬧鐘，謝了老頭兒。"},{"english":"That old man is rather surly.","chinese":"這老頭兒脾氣倔。"},{"english":"He told him where the old man, Anselmo, was posted.","chinese":"他告訴他老頭兒安塞爾莫放哨的地方。"},{"english":"Once the old man to the sea and fishnet.","chinese":"有一次老頭兒向大海撒下魚網。"},{"english":"My father's bark is worse than his bite.","chinese":"我家老頭兒吠得比咬得更兇。"}],"related":[]}