{"definition":["fellow townsman\/fellow villager\/sb from the same hometown"],"pinyin":["lao3 xiang1"],"simplified":["老乡"],"rank":7106.0,"normalized_rank":0.09942215941684272,"fraction":0.000014417918249899316,"cumulative_fraction":0.8980623696630812,"word":"老鄉","characters":[{"definition":["prefix used before the surname of a person or a numeral indicating the order of birth of the children in a family or to indicate affection or familiarity\/old (of people)\/venerable (person)\/experienced\/of long standing\/always\/all the time\/of the past\/very\/outdated\/(of meat etc) tough"],"pinyin":["lao3"],"word":"老"},{"definition":["country or countryside\/native place\/home village or town\/township (PRC administrative unit)"],"pinyin":["xiang1"],"word":"鄉"}],"containing_words":[],"sentences":[{"english":"All products are purchased from acquaintance fellow villagers so that products have high quality.","chinese":"所有產品收購於鄰近相識的父老鄉親，品質有保障。"},{"english":"The villagers also filmed this Tianshan snow crab specimens made of snow crab.","chinese":"我們的老鄉還拍了這隻天山雪蟹做成標本的雪蟹。"},{"english":"Hazy darkness, Yu-ming, another fellow from \"The Fat Man, \" the phone.","chinese":"朦朧夜色中，於得明接到另一位老鄉“胖子”的電話。"},{"english":"Hereby he is presenting the fellows in Northeast China.","chinese":"在這裏他向我們呈現的是東北的父老鄉親。"},{"english":"It wasn't good. They must have thought I have joined them.","chinese":"那樣不好，他們一定以爲我和那老鄉是一夥的。"},{"english":"Thanks to those guys who have ever supported me and my family. Thanks indeed.","chinese":"謝謝各位父老鄉親對我的關心和支持。"},{"english":"Marita Lindahl, after winning the Miss World title, married a fellow Finn, a publicity manager.","chinese":"奪冠之後嫁給一位從事公關經理工作的芬蘭老鄉。"},{"english":"From then on all the villagers talked about\"our Doctor Mei\".","chinese":"從那時起，老鄉們都在談”我們的梅大夫”了。"},{"english":"But he wanted to see the old folk again and to visit my mother's grave.","chinese":"但是，他想看一看家鄉父老鄉親，爲我的母親掃墓。"},{"english":"Confucius awoke and knew his compatriot was not an ordinary person.","chinese":"孔子這時才驚醒過來，知道這位老鄉，實非等閒之輩。"},{"english":"At that time, there are well-intentioned fellow remind him that prostitutes infected with AIDS care.","chinese":"當時，有老鄉善意提醒他，小心嫖娼染上艾滋病。"},{"english":"Blue is a claim with the Laoxiang Xiaofang, and is willing to help her.","chinese":"藍某自稱與小芳是老鄉，並願意幫助她。"},{"english":"Villagers say, hope for how many years, our immigration as a officer.","chinese":"老鄉們說，盼了多少年，總算盼到我們的移民當了官。"},{"english":"No person of hometown, working pressure also big, sometimes will also be colleagues bullying.","chinese":"沒有老鄉，工作壓力也大，有時也會被同事欺負。"}],"related":[{"definition":["daughter-in-law\/wife (of a younger man)\/young married woman\/young woman"],"pinyin":["xi2 fu4"],"word":"媳婦"},{"definition":["to thank\/thanks\/thank you"],"pinyin":["xie4 xie5"],"word":"謝謝"},{"definition":["a relative (i.e. family relation)\/CL:門|门[men2],個|个[ge4],位[wei4]"],"pinyin":["qin1 qi5"],"word":"親戚"},{"definition":["surname Xie","to thank\/to apologize\/to wither (of flowers, leaves etc)\/to decline"],"pinyin":["Xie4","xie4"],"word":"謝"},{"definition":["Cantonese (people)"],"pinyin":["Guang3 dong1 ren2"],"word":"廣東人"},{"definition":["countryside\/rural area\/CL:個|个[ge4]"],"pinyin":["xiang1 xia5"],"word":"鄉下"},{"definition":["Brothers!\/brethren\/dude (colloquial)\/brother (diminutive form of address between males)"],"pinyin":["ge1 men5"],"word":"哥們"},{"definition":["original poster (in an online forum)\/landlord of a building (traditional)"],"pinyin":["lou2 zhu3"],"word":"樓主"},{"definition":["special local product\/(regional) specialty"],"pinyin":["te4 chan3"],"word":"特產"},{"definition":["(final particle equivalent to 了[le5])\/(particle calling attention to, or mildly warning of, a situation)","subordinates in gang of bandits"],"pinyin":["lou2","lou5"],"word":"嘍"},{"definition":["to lead the way\/to guide\/to show the way\/fig. to instruct"],"pinyin":["dai4 lu4"],"word":"帶路"},{"definition":["(coll.) father's older brother\/uncle\/term of respect for older man","arrogant idler\/self-centered show-off"],"pinyin":["da4 ye2","da4 ye5"],"word":"大爺"},{"definition":["many thanks\/thanks a lot"],"pinyin":["duo1 xie4"],"word":"多謝"},{"definition":["It is said that ... (at the start of a narrative)\/to discuss\/to recount"],"pinyin":["hua4 shuo1"],"word":"話說"},{"definition":["locally born and bred\/indigenous\/home-grown"],"pinyin":["tu3 sheng1 tu3 zhang3"],"word":"土生土長"},{"definition":["there"],"pinyin":["na4 'r"],"word":"那兒"}]}