{"definition":["to resist corrosion"],"pinyin":["nai4 shi2"],"simplified":["耐蚀"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"耐蝕","characters":[{"definition":["capable of enduring\/able to tolerate\/patient\/durable\/hardy\/resistant"],"pinyin":["nai4"],"word":"耐"},{"definition":["to nibble away at sth\/to eat into\/to erode"],"pinyin":["shi2"],"word":"蝕"}],"containing_words":[],"sentences":[{"english":"It's obviously that corrosion-resistance and brightness are much better than those of Zn plating.","chinese":"實驗結果表明，其耐蝕性和光亮度明顯優於鍍鋅層。"},{"english":"The process is fast in deposition speed and excellent in corrosion resistance of the coating.","chinese":"該工藝沉積速率快，鍍層耐蝕性優異。"},{"english":"Corrosion resistances of nickel alloys in tidal zone are better than in fully immersion zone.","chinese":"鎳合金在潮汐區的耐蝕性比全浸區好。"},{"english":"Phosphating process has usually been adopted to improve the corrosion resistance of iron and steel.","chinese":"磷化處理常用於提高鋼鐵件的耐蝕性。"},{"english":"Zinc plating chromic acid salt after the passivation, corrosion resistance can improve 6 to 8 times.","chinese":"鋅鍍層經鉻酸鹽鈍化之後，耐蝕性可提高6～8倍。"},{"english":"The influence of rustproof pigments on the corrosion protective properties of the film was discussed.","chinese":"分析了防鏽顏料對塗層耐蝕性的影響。"},{"english":"The results show the different film structure of polyaniline coating has the obvious difference in corrosion behavior.","chinese":"結果表明，不同的聚苯胺表面膜耐蝕能力有顯著區別。"},{"english":"Al and Rare Earth in bath can improve the corrosion resistance of coating.","chinese":"鋅池中的鋁和稀土可以提高鍍層的耐蝕性。"},{"english":"The method comprises providing the substrate with a wear protection layer and providing corrosion resistant layer.","chinese":"該方法包括向基材提供耐磨層和耐蝕層。"},{"english":"Chemical immersion indicated that PKS has better corrosion-resistant properties.","chinese":"由浸漬實驗測試，證明PKS具有良好的耐蝕性能。"},{"english":"The corrosion resistance and the fatigue resistance of the aluminium coating film are exa- mined.","chinese":"測定了鋁膜耐蝕性及疲勞性能。"},{"english":"Magnesium alloys have poor corrosion resistance and cause environmental pollution as they are chemically conversed by chromate.","chinese":"鎂合金的耐蝕性差，用鉻酸鹽法處理污染環境。"},{"english":"Graining Technology by Electrolytic Etching on the Surface of Aluminum Alloys.","chinese":"電鍍防護性鋅基合金鍍層鈍化膜的耐蝕性。"},{"english":"The corrosion resistance of the coating is measured by neutral salt spray test and soaking in 5%NaCl solution.","chinese":"塗層的耐蝕性採用中性鹽霧試驗和5%鹽水浸潤試驗。"},{"english":"The spring is made in stainless steel, with strong corrosion resistance.","chinese":"彈簧是用不鏽鋼製作，因而具有很強的耐蝕性。"},{"english":"Ridges occur in humid regions along belts of resistant rocks.","chinese":"在潮溼地區，山脊沿着耐蝕的石帶發育。"}],"related":[]}