{"definition":["to dissipate\/to squander"],"pinyin":["hao4 san4"],"simplified":["耗散"],"rank":52727.0,"normalized_rank":0.7377191386957312,"fraction":1.071475781166582e-7,"cumulative_fraction":0.9993001321646542,"word":"耗散","characters":[{"definition":["to waste\/to spend\/to consume\/to squander\/news\/(coll.) to delay\/to dilly-dally"],"pinyin":["hao4"],"word":"耗"},{"definition":["scattered\/loose\/to come loose\/to fall apart\/leisurely\/powdered medicine","to scatter\/to break up (a meeting etc)\/to disperse\/to disseminate\/to dispel\/(coll.) to sack"],"pinyin":["san3","san4"],"word":"散"}],"containing_words":[],"sentences":[{"english":"We extend enormous energy on our anger.","chinese":"我們耗散了太多的能量在我們的憤怒上。"},{"english":"The first one is a modified critical dissipative Quasi-Geostrophic equation.","chinese":"第一個是一類修正的臨界耗散準地轉方程。"},{"english":"We researched into the dissipative characteristic of human auricular points in 40 cases of myopia.","chinese":"介紹40例近視眼病例的耳穴耗散特性實驗研究。"},{"english":"The initial boundary value problem of fourth order wave equation with dispersive and dissipative terms is studied.","chinese":"研究具色散和耗散項的四階波動方程的初邊值問題。"},{"english":"In this chapter, we shall study the depolarizing channel and the lossy channel.","chinese":"我們將研究退極化通道與耗散通道模型。"},{"english":"The unprimed portions are configured to enable electrostatic dissipation.","chinese":"非底層部分被構造成能夠使靜電耗散。"},{"english":"As he showed slides of the ocean floor andexplained that the coast is a system of energy dissipation, the crowdpeppered him with questions.","chinese":"他用底架構的幻燈片說明海岸線是個能量耗散的系統。"},{"english":"The frictional dissipation will introduce an exponential decay .","chinese":"摩擦耗散可導致指數式的衰減。"},{"english":"From complementarity principle we build up dissipation mechanics in this paper.","chinese":"在本文中，我們根據互補性原理，建立了耗散力學。"},{"english":"The friction force is therefore called a nonconservative or a dissipative force.","chinese":"因此，摩擦力稱爲非保守力或耗散力。"},{"english":"These verified that the agric economic system is a Non-linear dissipation structural complex system.","chinese":"證明了農業系統是非線性耗散結構的複雜系統。"},{"english":"All of the energy converted is dissipated within the source .","chinese":"轉換來的所有能量都耗散在電源內部。"},{"english":"Does biasing at max dissipation guarantee class A operation?","chinese":"是否偏置保證在最大耗散A級操作？"},{"english":"Finallly, the scientific idea of the dissipative structure theory is clarified.","chinese":"最後闡明耗散結構理論的科學思想。"},{"english":"Quadratic- dissipative control for linear discrete-time systems with time-delay is considered in this paper.","chinese":"考慮線性離散時滯系統的二次型耗散控制問題。"},{"english":"Dissipative structure theory has increasingly important influences on mo-dern sciences and philosophies.","chinese":"耗散結構理論對當代科學和哲學的影響日益顯著。"}],"related":[{"definition":["to waste"],"pinyin":["hao4 sun3"],"word":"耗損"},{"definition":["damage (e.g. to goods in transit)"],"pinyin":["shang1 hao4"],"word":"傷耗"},{"definition":["wear and tear\/to wear away over time"],"pinyin":["xiao1 sun3"],"word":"消損"},{"definition":["sex fluids"],"pinyin":["yin1 jing1"],"word":"陰精"},{"definition":["(of sth that should be retained: nutrients, moisture, heat etc) to be lost"],"pinyin":["hao4 shi1"],"word":"耗失"},{"definition":["bodily fluids (general term in Chinese medicine)"],"pinyin":["jin1 ye4"],"word":"津液"},{"definition":["to generate heat"],"pinyin":["sheng1 re4"],"word":"生熱"},{"definition":["deficiency of kidney essence due to sexual excess (TCM)"],"pinyin":["fang2 lao2"],"word":"房勞"},{"definition":["to coalesce\/to gather together\/to amass"],"pinyin":["ji1 ju4"],"word":"積聚"},{"definition":["to such an extent as to\/down to\/up to"],"pinyin":["yi3 zhi4"],"word":"以致"},{"definition":["lust"],"pinyin":["shi4 yu4"],"word":"嗜慾"},{"definition":["medical dressing\/bandage"],"pinyin":["fu1 bu4"],"word":"敷布"},{"definition":["exhausted\/worn out"],"pinyin":["lao2 juan4"],"word":"勞倦"},{"definition":["(TCM) consumptive disease, chronic deficiency disorder due to impaired function of inner organs, deficiency of qi, blood, yin and yang\/asthenia"],"pinyin":["xu1 sun3"],"word":"虛損"},{"definition":["pathogeny (cause of disease) in TCM\/as opposed to vital energy 正氣|正气[zheng4 qi4]"],"pinyin":["bing4 xie2"],"word":"病邪"},{"definition":["disorder of internal organs caused by overexertion"],"pinyin":["lao2 shang1"],"word":"勞傷"}]}