{"definition":["to inhabit a region (esp. ethnic group)\/to congregate"],"pinyin":["ju4 ju1"],"simplified":["聚居"],"rank":18268.0,"normalized_rank":0.2555930211408504,"fraction":0.0000028604315983595606,"cumulative_fraction":0.9702993299981753,"word":"聚居","characters":[{"definition":["to congregate\/to assemble\/to mass\/to gather together\/to amass\/to polymerize"],"pinyin":["ju4"],"word":"聚"},{"definition":["(archaic) sentence-final particle expressing a doubting attitude","surname Ju","to reside\/to be (in a certain position)\/to store up\/to be at a standstill\/residence\/house\/restaurant\/classifier for bedrooms"],"pinyin":["Ju1","ji1","ju1"],"word":"居"}],"containing_words":[{"definition":["inhabited land\/habitat"],"pinyin":["ju4 ju1 di4"],"word":"聚居地"}],"sentences":[{"english":"The second part is about the machine-processd components of settlement form in the ancient towns of Bayu.","chinese":"第二部分爲巴渝古鎮聚居形態的構成機制研究。"},{"english":"The old house our clan had lived in for so many years had already been sold.","chinese":"我們多年聚居的老屋，已經賣給別姓了。"},{"english":"It is a region inhabited by an overwhelming majority of the Korean minority nationality in China.","chinese":"長白山區，是我國朝鮮族同胞的主要聚居地。"},{"english":"This is the first time that the outbreak of demonstrations in cities and towns inhabited by Arabs.","chinese":"今次亦是首次有阿拉伯人聚居城鎮爆發示威。"},{"english":"Western Guizhou is inhabited by many minority nationalities living in compact communities.","chinese":"黔西是一個少數民族聚居地。"},{"english":"These communities still exist today.","chinese":"時至今日，這些聚居區依然如故。"},{"english":"Shangqiu is the original settlement of the Shang Tribe.","chinese":"商丘是商族的起源和聚居地。"},{"english":"The forth part is the considers and exploration about integration of settlement form in the ancient towns of Bayu.","chinese":"第四部分爲對古鎮聚居形態的整合思考與探索。"},{"english":"Village refers to the homes habitation for the living and various productions of the villagers.","chinese":"村莊是指農村村民居住和從事各種生產的聚居點。"},{"english":"Hongyuan:Hongyuan is the only complete grassland farming county in A Ba which is Tibet's habitation.","chinese":"紅原紅原是阿壩州唯一的以藏族聚居爲主的純牧業縣。"},{"english":"The Mai Po Marshes form one of the most important wildlife conservation sites in Hong Kong.","chinese":"米埔沼澤區是本港野生動物的主要聚居地之一。"},{"english":"New York is a vast melting-pot of different nationalities.","chinese":"紐約是不同國籍的人的聚居地。"},{"english":"Tujia ethnic group in Hubei mainly lives in the compact communities of Wuling mountain area.","chinese":"湖北土家族長期聚居在鄂西武陵山區。"},{"english":"This shows that by the late primitive society, Jingxing territory has been inhabited by human beings.","chinese":"這表明最遲在原始社會晚期，井陘境內已有人類聚居。"},{"english":"Seventeen thousand Indians live in Arizona on a reservation .","chinese":"一萬七千名印第安人居住在亞利桑那州的聚居地。"},{"english":"The third part is the research about the appearance and special features of settlement form in the ancient towns of Bayu.","chinese":"第三部分爲巴渝古鎮聚居形態的風貌特色研究。"}],"related":[{"definition":["inhabited land\/habitat"],"pinyin":["ju4 ju1 di4"],"word":"聚居地"},{"definition":["cohabitation (of different populations or races)\/to coexist"],"pinyin":["za2 ju1"],"word":"雜居"},{"definition":["community\/living together"],"pinyin":["ji2 ju1"],"word":"集居"},{"definition":["(of a group of people) to live scattered over an area"],"pinyin":["san3 ju1"],"word":"散居"},{"definition":["settlement\/dwelling place\/town\/village"],"pinyin":["ju4 luo4"],"word":"聚落"},{"definition":["to migrate\/to move"],"pinyin":["qian1 xi3"],"word":"遷徙"},{"definition":["village"],"pinyin":["cun1 luo4"],"word":"村落"},{"definition":["indigenous peoples\/aborigine"],"pinyin":["yuan2 zhu4 min2"],"word":"原住民"},{"definition":["to settle (in some city, country etc)\/to take up residence"],"pinyin":["ding4 ju1"],"word":"定居"},{"definition":["ethnic group\/community"],"pinyin":["zu2 qun2"],"word":"族群"},{"definition":["descendant"],"pinyin":["hou4 yi4"],"word":"後裔"},{"definition":["to reside\/to dwell\/to live in a place\/resident in"],"pinyin":["ju1 zhu4"],"word":"居住"},{"definition":["to multiply\/to reproduce\/to increase gradually in number or quantity"],"pinyin":["fan2 yan3"],"word":"繁衍"},{"definition":["(of disparate elements) to mix in with one another\/(of diverse groups of people) to live in the same area\/to coexist"],"pinyin":["za2 chu3"],"word":"雜處"},{"definition":["branch or subdivision of a family"],"pinyin":["zhi1 xi4"],"word":"支系"},{"definition":["clan"],"pinyin":["shi4 zu2"],"word":"氏族"}]}