{"definition":["to get together"],"pinyin":["ju4 zai4 yi1 qi3"],"simplified":["聚在一起"],"rank":15436.0,"normalized_rank":0.2159696668672086,"fraction":0.000003942417768660202,"cumulative_fraction":0.960795758483063,"word":"聚在一起","characters":[{"definition":["to congregate\/to assemble\/to mass\/to gather together\/to amass\/to polymerize"],"pinyin":["ju4"],"word":"聚"},{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"I love to meet up with my friends, get out of the city.","chinese":"我喜歡和朋友們聚在一起，離開城市的喧囂。"},{"english":"acquaintances often gather to play for fun, with no wagering.","chinese":"熟人經常聚在一起打麻將玩，不下注。"},{"english":"Someday we'll is together.","chinese":"我們總有一天能聚在一起。"},{"english":"The unlucky investors hang out together and drown their sorrows in a few drinks.","chinese":"一些歹運的投資人聚在一起藉酒澆愁。"},{"english":"Some like-minded people got together and set up a group.","chinese":"一些志趣相投的人聚在一起，成立了一個小組。"},{"english":"It is a rare chance for us to get together.","chinese":"難得我們有機會聚在一起。"},{"english":"People often gather for a party, appreciate chrysanthemums, pin the leaves of Cornus on clothes.","chinese":"人們經常聚在一起聚會，欣賞菊花，銷的葉子在衣服。"},{"english":"Everyone had gathered to say “GOOD-BYE” to the place where we had spent our schooldays.","chinese":"所有人都聚在一起，向我們度過校園生活的地方告別。"},{"english":"Oceanian Polynexiya had been shown specifically to cluster with Asia populations.","chinese":"大洋洲的波利尼西亞人與亞洲人羣聚在一起。"},{"english":"We had dumplings made by the whole family for dinner on lunar New Year's Eve ere.","chinese":"全家人聚在一起喫年夜飯是多麼幸福的事情。"},{"english":"All family members get together on New Year'Eve to have a big meal.","chinese":"所有家庭成員聚在一起在新年團年飯。"},{"english":"We gathered because we needed our grief to be witnessed.","chinese":"我們聚在一起是爲了讓我們的悲傷得到見證。"},{"english":"Do a few chamber pot quickly to us, we can gather again again.","chinese":"快給我們弄幾個尿盆來，我們又可重聚在一起了。"},{"english":"Today is grandma's 80th birthday, and all the family have got together to congratulate her.","chinese":"今天是奶奶的80壽誕，全家人聚在一起給奶奶祝壽。"},{"english":"In China, for example, tea is always served when people get together.","chinese":"例如，在中國，每當人們聚在一起的時候，都要上茶。"},{"english":"In the henhouse, all the chickens got together and were shivering.","chinese":"在雞舍裏，所有的雞聚在一起瑟瑟發抖。"}],"related":[{"definition":["to sit in a circle\/seated around (a narrator)"],"pinyin":["wei2 zuo4"],"word":"圍坐"},{"definition":["in groups of three or four (idiom)"],"pinyin":["san1 wu3 cheng2 qun2"],"word":"三五成群"},{"definition":["party\/gathering\/to meet\/to get together"],"pinyin":["ju4 hui4"],"word":"聚會"},{"definition":["to talk endlessly\/talking of anything under the sun"],"pinyin":["tan2 tian1 shuo1 di4"],"word":"談天說地"},{"definition":["to chat\/casual conversation"],"pinyin":["xian2 liao2"],"word":"閒聊"},{"definition":["see 天南地北[tian1 nan2 di4 bei3]"],"pinyin":["tian1 nan2 hai3 bei3"],"word":"天南海北"},{"definition":["in twos and threes"],"pinyin":["san1 san1 liang3 liang3"],"word":"三三兩兩"},{"definition":["(of relations) joyous and harmonious"],"pinyin":["qi2 le4 rong2 rong2"],"word":"其樂融融"},{"definition":["communal meal\/formal dinner of club or group"],"pinyin":["ju4 can1"],"word":"聚餐"},{"definition":["each other\/mutually\/mutual"],"pinyin":["hu4 xiang1"],"word":"互相"},{"definition":["to meet together\/to assemble (of a group of people)"],"pinyin":["ju4 qi2"],"word":"聚齊"},{"definition":["to chatter idly\/to gossip\/to boast or brag"],"pinyin":["kan3 da4 shan1"],"word":"侃大山"},{"definition":["distant places\/all over the country\/(to talk) about this and that"],"pinyin":["tian1 nan2 di4 bei3"],"word":"天南地北"},{"definition":["to gather happily under one roof"],"pinyin":["huan1 ju4 yi1 tang2"],"word":"歡聚一堂"},{"definition":["to chat\/idle gossip"],"pinyin":["xian2 liao2 tian1"],"word":"閑聊天"},{"definition":["to gather one's friends\/to band together"],"pinyin":["hu1 peng2 yin3 ban4"],"word":"呼朋引伴"}]}