{"definition":["fusion (physics)"],"pinyin":["ju4 bian4"],"simplified":["聚变"],"rank":29074.0,"normalized_rank":0.4067829809858268,"fraction":0.000001022281320914111,"cumulative_fraction":0.9893340068904528,"word":"聚變","characters":[{"definition":["to congregate\/to assemble\/to mass\/to gather together\/to amass\/to polymerize"],"pinyin":["ju4"],"word":"聚"},{"definition":["to change\/to become different\/to transform\/to vary\/rebellion"],"pinyin":["bian4"],"word":"變"}],"containing_words":[{"definition":["nuclear fusion"],"pinyin":["he2 ju4 bian4"],"word":"核聚變"},{"definition":["thermonuclear fusion reaction"],"pinyin":["re4 he2 ju4 bian4 fan3 ying4"],"word":"熱核聚變反應"},{"definition":["nuclear fusion"],"pinyin":["ju4 bian4 fan3 ying4"],"word":"聚變反應"},{"definition":["fusion-type weapon"],"pinyin":["ju4 bian4 wu3 qi4"],"word":"聚變武器"}],"sentences":[{"english":"A hydrogen bomb has a built-in atomic bomb, which is needed to trigger the fusion reaction.","chinese":"氫彈內置了一顆原子彈，用於觸發聚變反應。"},{"english":"Cold fusion has been investigated by the electrolytical method and the deuterium absorption method.","chinese":"採用電解法和氘氣吸附法研究了冷聚變現象。"},{"english":"A nuclear fusion is a thermonuclear reaction.","chinese":"核聚變是一種熱核反應。"},{"english":"The fissions (or fusions) of these localized coherent structures may occur after their interactions.","chinese":"這些局域相干結構的相互作用存在裂變和聚變現象。"},{"english":"2201 – At the Sun slowing thermonuclear processes. Temperature drops.","chinese":"2201年，太陽熱核聚變減慢，地球氣溫大幅下降。"},{"english":"This should, in turn, cause more fusion reactions until the fuel runs out.","chinese":"這應當依次導致更多的聚變反應，直到燃料耗盡。"},{"english":"The oscillogram photographs of the neutrons from laser-produced plasma were taken for the first time.","chinese":"首次拍攝到我國激光聚變上發射的中子信號波形照片。"},{"english":"The beam sampling grating (BSG) used in the inertial confinement fusion system is designed.","chinese":"設計了用於慣性約束核聚變系統的取樣光柵。"},{"english":"But there's a snag in its widespread adoption as a fusion fuel.","chinese":"但是，作爲聚變燃料成爲它被廣泛應用的障礙。"},{"english":"But accelerators could potentially produce nuclear fusion, which fuses atomic nuclei together.","chinese":"而加速器可能產生核聚變，將原子核融合在一起。"},{"english":"Physicists are looking at the complex fusion of chain reactions.","chinese":"物理學家轉向複合性連鎖反應聚變上。"},{"english":"S. fight? \" claims the North possesses nuclear fusion technology.","chinese":"的視頻宣稱朝鮮擁有核聚變技術。"},{"english":"A 3-D ray equation on optical trajectory of laser propagation in the laser-driven fusion is firstly proposed.","chinese":"提出了激光聚變中激光傳播的三維光學軌跡光路方程。"},{"english":"The erosion of a divertor target of beryllium in a fusion reactor is discussed.","chinese":"討論了偏濾器鈹靶在聚變堆工況下的腐蝕問題。"},{"english":"Deuterium-based fusion reactors enter widespread use on Earth.","chinese":"基於重氫的聚變反應堆在地球上被廣泛使用。"},{"english":"Every fusion reaction devours exactly one tritium ion and produces exactly one neutron.","chinese":"每一個聚變反應會耗一個氚核並只產生一箇中子。"}],"related":[]}