{"definition":["to identify by smell\/to detect a scent\/to sniff out"],"pinyin":["wen2 chu1"],"simplified":["闻出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"聞出","characters":[{"definition":["surname Wen","to hear\/news\/well-known\/famous\/reputation\/fame\/to smell\/to sniff at"],"pinyin":["Wen2","wen2"],"word":"聞"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[{"definition":["State Administration for Press, Publication, Radio, Film and Television (SAPPRFT)\/abbr. to 廣電總局|广电总局[Guang3 dian4 Zong3 ju2]"],"pinyin":["Guo2 jia1 Xin1 wen2 Chu1 ban3 Guang3 dian4 Zong3 ju2"],"word":"國家新聞出版廣電總局"},{"definition":["General Administration of Press and Publication (PRC state censorship organization)"],"pinyin":["Xin1 wen2 Chu1 ban3 Zong3 shu3"],"word":"新聞出版總署"}],"sentences":[{"english":"He is working in China Children's Press&Publication Group.","chinese":"供職於中國少年兒童新聞出版總社。"},{"english":"Be aimed at these problems, city news publication bureau will take the step of tripartite face.","chinese":"針對這些問題，市新聞出版局將採取三方面的措施。"},{"english":"Small smart snakes smelt smoked steaks.","chinese":"聰明的小蛇聞出了薰牛排的味道。"},{"english":"I can sniff something burning.","chinese":"我聞出有東西燒焦的味。"},{"english":"The hounds had winded the fox.","chinese":"獵狗聞出了有狐狸的氣味。"},{"english":"Cooperative Office System and Portal Site System of Bureau of Press and Publication.","chinese":"協同辦公系統和新聞出版局門戶網站系統。"},{"english":"Liu Chenghua was appointed Director of the Department of Culture, Radio, Film, TV, Press and Publication of Jinan.","chinese":"任命劉程華爲濟南市文化廣電新聞出版局局長。"},{"english":"Try it, you'll smell a big difference.","chinese":"試試吧，你會聞出區別很大。"},{"english":"We had been approved by the subordinate organs of the propaganda department include the press and publication bureau of Guangdong Province.","chinese":"本公司是經廣東省新聞出版局覈准的一類印刷企業。"},{"english":"In light of these problems, City Press and Publications Board will take three measures.","chinese":"針對這些問題，市新聞出版局將採取三方面的措施。"},{"english":"I should smell it the way a cat smells a mouse.","chinese":"我們可以象貓嗅老鼠一樣聞出它的氣味。"},{"english":"So eventually you know maybe you can sniff the right man out.","chinese":"所以最終你知道或許你可以聞出你的意中人。"},{"english":"Illegal Periodicals seriously disturb the order of national press and publishing.","chinese":"非法期刊嚴重擾亂了我國新聞出版秩序。"},{"english":"I can smell some nice bread and biscuits.","chinese":"我能聞出一些好的麪包和餅乾。"},{"english":"Sun Yong is Chief of the Press and Publication Bureau of Shanghai .","chinese":"上海市新聞出版局局長。"},{"english":"Freedom of assembly and the press foster open debate and exchange of ideas.","chinese":"集會和新聞出版自由促進公開辯論和意見交流。"}],"related":[]}