{"definition":["to be famous far and wide (idiom)"],"pinyin":["wen2 ming2 xia2 er3"],"simplified":["闻名遐迩"],"rank":30366.0,"normalized_rank":0.42485973724343457,"fraction":9.132360336482477e-7,"cumulative_fraction":0.9905813112633997,"word":"聞名遐邇","characters":[{"definition":["surname Wen","to hear\/news\/well-known\/famous\/reputation\/fame\/to smell\/to sniff at"],"pinyin":["Wen2","wen2"],"word":"聞"},{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"},{"definition":["distant\/long-lasting\/to abandon"],"pinyin":["xia2"],"word":"遐"},{"definition":["recently\/near\/close"],"pinyin":["er3"],"word":"邇"}],"containing_words":[],"sentences":[{"english":"Cantonese sausage is well known for its particular appearance and flavor.","chinese":"廣式臘腸以其獨特的外觀和風味聞名遐邇。"},{"english":"This May Day holiday, my friend and I went to climb the famous Wuyi mountain.","chinese":"今年五一，我和朋友去聞名遐邇的武夷山玩。"},{"english":"She is a Chinese TV star and famous for acting as a policewoman.","chinese":"她是一位以扮演警花而聞名遐邇的中國影星。"},{"english":"Rorty is famous for his theory of \"post - philosophical culture\" .","chinese":"羅蒂以他的“後哲學文化”理論而聞名遐邇。"},{"english":"The mountain is most famous for its spectacular sunrise and sunset.","chinese":"泰山的日出與日落，聞名遐邇。"},{"english":"This restaurant is celebrated for their juicy rib-eye steak.","chinese":"這家餐廳以鮮美多汁的樂野牛排而聞名遐邇。"},{"english":"Guilin is also famous for its meandering Lijiang River and Peach Blossom River.","chinese":"桂林還以蜿蜒的灕江和桃花江聞名遐邇。"},{"english":"The Tokyo Tower is world-famous, and is even known by three-year-old children.","chinese":"東京鐵塔聞名遐邇，連三歲小孩子都知道。"},{"english":"This lychee trees has become linked to the famous tree.","chinese":"這荔枝樹便成了聞名遐邇的掛綠樹。"},{"english":"Rotorua city is renowned for its unique “rotteneggs” aroma, which is caused by the geothermal activity releasingsulphur compounds into the atmosphere.","chinese":"該市以其空氣中瀰漫着的“臭雞蛋”味而聞名遐邇。"},{"english":"The town is famous as a hot-spring resort.","chinese":"作爲一個溫泉勝地，這鎮子聞名遐邇。"},{"english":"the designer has built a reputation for his unusually shaped carafes.","chinese":"該設計師以其造型奇特的玻璃水瓶而聞名遐邇。"},{"english":"Elegant and Graceful, here is the famous Silk City alone.","chinese":"鍾靈毓秀，這裏是聞名遐邇的獨秀水城。"}],"related":[]}