{"definition":["to receive news (of)"],"pinyin":["wen2 xun4"],"simplified":["闻讯"],"rank":8567.0,"normalized_rank":0.11986344493724906,"fraction":0.000010697970384576696,"cumulative_fraction":0.9162050493905488,"word":"聞訊","characters":[{"definition":["surname Wen","to hear\/news\/well-known\/famous\/reputation\/fame\/to smell\/to sniff at"],"pinyin":["Wen2","wen2"],"word":"聞"},{"definition":["to question\/to ask\/to interrogate\/rapid\/speedy\/fast\/news\/information"],"pinyin":["xun4"],"word":"訊"}],"containing_words":[],"sentences":[{"english":"Buyers who stampede in.","chinese":"購買者聞訊蜂擁而至。"},{"english":"He posted a notice on his MySpace site about the party and 500 people turned up to his suburban home in Melbourne on Saturday.","chinese":"週六，500人聞訊趕到了他位於墨爾本郊區的家中。"},{"english":"On hearing the alarm the fire brigade rushed to the scene.","chinese":"消防隊聞訊趕到。"},{"english":"However, news reporters, they do not see the plane.","chinese":"不過，記者聞訊趕來時，卻沒有看到那架飛機。"},{"english":"Dogs and black woman rushed to night, to stop the black ant.","chinese":"夜犬和黑婆聞訊趕來，想阻攔黑蟻。"},{"english":"Local press got wind of the company and made a lot of noise about it.","chinese":"當地的媒體聞訊公司的做法，進行了連篇累牘的報道。"},{"english":"To know the truth of Peter is very angry and beat even to the tower.","chinese":"知道真相的皮特非常生氣，打了聞訊而來的塔利。"},{"english":"A few bruiser, even to an irreverent hit Bai Zhou.","chinese":"幾個彪形大漢聞訊而至，毫不客氣揍了白宙一頓。"},{"english":"This lady hears the news, specially came to Dandong to put his son back.","chinese":"莊夫人聞訊，特意來到丹東要把兒子抓回去。"},{"english":"Dont want to, and fight a halfway cheng yaojin, the east China sea dragon were killed will come.","chinese":"不想，半路又殺出一個程咬金，東海龍聞訊殺將過來。"},{"english":"Hearing the news, Chong Er escaped from the state of Jin, remaining a fugitive for more than ten years.","chinese":"重耳聞訊，逃出了晉國，在外流忘十幾年。"},{"english":"Xin Bei and Liu Bang rush to the hospital and apologise to them.","chinese":"欣北和劉幫聞訊趕來，向兩老道歉。"},{"english":"Family members were told of the situation and were either at the hospital or en route, Oxman said.","chinese":"家庭成員聞訊後都往醫院裏趕，奧克斯曼說。"}],"related":[]}