{"definition":["to have heard what was said"],"pinyin":["wen2 yan2"],"simplified":["闻言"],"rank":50390.0,"normalized_rank":0.7050214766415289,"fraction":1.3809483501138786e-7,"cumulative_fraction":0.9990149780085632,"word":"聞言","characters":[{"definition":["surname Wen","to hear\/news\/well-known\/famous\/reputation\/fame\/to smell\/to sniff at"],"pinyin":["Wen2","wen2"],"word":"聞"},{"definition":["words\/speech\/to say\/to talk"],"pinyin":["yan2"],"word":"言"}],"containing_words":[],"sentences":[{"english":"YangLinWen speech agree with the purple how suggestion.","chinese":"楊林聞言同意了紫焉的建議。"},{"english":"Big sister smell speech, also said she believes that giant.","chinese":"大妹聞言，也說她相信擎天。"},{"english":"YangYongWen words agreed on the spot.","chinese":"楊勇聞言當場表示同意。"},{"english":"Wu founds a nation to smell speech to sneer at a , profoundly saw the wood jumping one eye.","chinese":"吳建國聞言嘲笑一聲，深深的看了林躍一眼。"},{"english":"Cheng bite gold smell speech secretly urged QinQiong show identity.","chinese":"程咬金聞言暗中催促秦瓊表露身份。"},{"english":"The right to water heard such as lightning, home received a wedding invitation to Guo Jiaji.","chinese":"權水聞言如遭雷擊，回到家裏收到了郭家寄來的喜貼。"},{"english":"Prince smell speech rapidly into the wings ready to see in the queen.","chinese":"太子聞言急速步入廂房換衣準備入宮面見皇后。"},{"english":"Sir Walter promptly boxed his son's ears.","chinese":"老沃特聞言七竅生煙，立馬甩了他兒子一個耳光。"},{"english":"Rather the sun smells the speech must silent nod.","chinese":"寧陽聞言只得默默點了頭。"},{"english":"The lei smell speech her dont easy to DE shi change immediately, lest suffer.","chinese":"亞磊聞言立即着她別容易對德仕改觀，免得喫虧。"},{"english":"Instant yong-shou Chen smell speech frightened to death.","chinese":"陳永壽聞言瞬間嚇的半死。"},{"english":"ShenXing smell speech flew into a rage and scolded Amy assume find out other peoples privacy.","chinese":"沈星聞言勃然大怒，訓斥艾米多管閒事打探他人隱私。"},{"english":"\"Is\" brocade it smell the speech noding to agree.","chinese":"“是”錦之聞言點頭應諾。"},{"english":"MengFei smell speech firmly request alarm, against Chen.","chinese":"孟菲聞言堅決請求報警，陳超反對。"},{"english":"Now during the smell speech came to the place.","chinese":"此時李世民聞言來到事發地點。"},{"english":"A mother smell speech on the spot at ChenYan said no hate.","chinese":"張媽媽聞言當場表示壓根沒有討厭陳妍。"}],"related":[]}