{"definition":["to smell\/to hear\/knowledge\/information"],"pinyin":["wen2 jian4"],"simplified":["闻见"],"rank":43933.0,"normalized_rank":0.6146796692457291,"fraction":2.648034151275449e-7,"cumulative_fraction":0.9977514318729038,"word":"聞見","characters":[{"definition":["surname Wen","to hear\/news\/well-known\/famous\/reputation\/fame\/to smell\/to sniff at"],"pinyin":["Wen2","wen2"],"word":"聞"},{"definition":["to appear\/also written 現|现[xian4]","to see\/to meet\/to appear (to be sth)\/to interview"],"pinyin":["jian4","xian4"],"word":"見"}],"containing_words":[],"sentences":[{"english":"The burned scents from ustulate milk and matches make me hungry.","chinese":"牛奶燒糊了，火柴燒黑了，那焦香我聞見了就覺得餓。"},{"english":"Wen can see the elegant fragrance, you can taste the long poetic.","chinese":"可以聞見淡雅的清香，可以品味悠長的詩意。"},{"english":"There was rosemary behind me, and I could smell only the scent of its alcohol.","chinese":"我身後有迷迭香，我只能聞見它散發出的酒精氣味。"},{"english":"When milk or matches are burnt, they give out a smell of burning and I feel hungry at the smell .","chinese":"牛奶燒糊了，火柴燒黑了，那焦香我聞見了就覺得餓。"},{"english":"Milk gets burnt, and matchstick gets burnt black. Those singeing smell makes me feel hungry.","chinese":"牛奶燒糊了，火柴燒黑了，那焦香我聞見了就覺得餓。"},{"english":"I lowered the head smell a fragrance.","chinese":"我低下頭聞見一陣芬芳。"},{"english":"In the cultivation process he advocated the ethics to guide the knowledge.","chinese":"在修養過程中主張以德性之知指導聞見之知。"},{"english":"When smell the taste lovers in dream I felt my own tears falling down.","chinese":"我聞見戀人遙遠夢中的氣息，淚水惘然。"},{"english":"I feel hungry at the smell of the milk burning overly and the match burned into black.","chinese":"牛奶燒糊了，火柴燒黑了，那焦香我聞見了就覺得餓。"},{"english":"You can't smell or see Salmonella in or on food.","chinese":"你能在食物中聞見或看見沙門氏菌。"},{"english":"Do we smell nothing as yet of the divine decomposition? Gods, too, decompose.","chinese":"我們沒聞見那神聖的腐爛臭味麼？"},{"english":"I can smell something burning.","chinese":"我聞見什麼東西燒焦了。"},{"english":"She was nauseated by the stench of burning flesh.","chinese":"她聞見生肉燃燒的臭氣直作嘔。"}],"related":[]}