{"definition":["United Kingdom"],"pinyin":["Lian2 he2 wang2 guo2"],"simplified":["联合王国"],"rank":51502.0,"normalized_rank":0.7205797993647951,"fraction":1.2232925131029913e-7,"cumulative_fraction":0.9991596263631574,"word":"聯合王國","characters":[{"definition":["to ally\/to unite\/to join\/(poetry) antithetical couplet"],"pinyin":["lian2"],"word":"聯"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["king or monarch\/best or strongest of its type\/grand\/great","surname Wang","to rule\/to reign over"],"pinyin":["Wang2","wang2","wang4"],"word":"王"},{"definition":["country\/nation\/state\/national\/CL:個|个[ge4]","surname Guo"],"pinyin":["Guo2","guo2"],"word":"國"}],"containing_words":[{"definition":["United Kingdom"],"pinyin":["Da4 ying1 Lian2 he2 Wang2 guo2"],"word":"大英聯合王國"},{"definition":["United Kingdom"],"pinyin":["Ying1 lian2 he2 wang2 guo2"],"word":"英聯合王國"}],"sentences":[{"english":"The \"UK\" is made up of four countries .","chinese":"聯合王國是由四部分組成的。"},{"english":"In the U. K. a kind of conscription was long in force.","chinese":"在聯合王國，一種徵兵制長期有效。"},{"english":"Close relatives of the monarch of the United Kingdom are known by the appellation The Royal Family.","chinese":"近親國王聯合王國所知的稱謂王室。"},{"english":"There is no single legal system in the United Kingdom.","chinese":"聯合王國不實行完全統一的法律制度。"},{"english":"The United Kingdom consists of Great Britain and Northern Island.","chinese":"聯合王國是由大不列顛及北愛爾蘭組成。"},{"english":"A division of the United Kingdom in the northeast section of the island of Ireland.","chinese":"愛爾蘭島東北部分，與聯合王國分離。"},{"english":"The UK is made up of four countries.","chinese":"聯合王國由四個國家組成。"},{"english":"The United Kingdom consists of Great Britain and the Northern Ireland.","chinese":"聯合王國是由大不列顛和北愛爾蘭所組成。"},{"english":"The great kingdom consists of Great Britain and Northern Ireland.","chinese":"聯合王國有不列顛和北愛爾蘭組成。"},{"english":"The United Kingdom includes Northern Ireland and Wales.","chinese":"聯合王國也包括北愛爾蘭和威爾士。"},{"english":"The coronation of King George I of Great Britain and Ireland took place.","chinese":"大不列顛和愛爾蘭聯合王國國王喬治一世加冕。"},{"english":"A bloodless revolution in the distribution of wealth is taking place in the U. K.","chinese":"在聯合王國正發生一場財富分配方面的平穩變革。"},{"english":"London is the capital and the largest city of both England and the United Kingdom.","chinese":"倫敦爲英格蘭和聯合王國的首都及最大城市。"}],"related":[]}