{"definition":["workplace\/workforce (of a nation or industry etc)\/job market"],"pinyin":["zhi2 chang3"],"simplified":["职场"],"rank":9212.0,"normalized_rank":0.1288878317686399,"fraction":0.000009524894175114212,"cumulative_fraction":0.922725247825826,"word":"職場","characters":[{"definition":["office\/duty"],"pinyin":["zhi2"],"word":"職"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"}],"containing_words":[],"sentences":[{"english":"I was baffled that some ofthe most basic workplace blunders seem to be tripping people up!","chinese":"許多最基本的職場失誤會讓他們摔跟頭，這讓我困惑。"},{"english":"The decline in breastfeeding has become a major concern to health workers.","chinese":"母乳哺餵率下降之關注議題已經考量到職場員工。"},{"english":"Form the habit of recording your daily deeds in workplaces.","chinese":"養成每天記錄自己職場行爲的習慣。"},{"english":"The career principles in the books are also of limited use.","chinese":"此外，書中所說的職場原則也鮮少有用武之地。"},{"english":"None of which is good when you're fighting to stay afloat in a competitive work environment.","chinese":"這些都是在激烈的職場競爭環境中的生存大忌。"},{"english":"A woman who has recently re-entered the workforce should make sure she's maxing out her own retirement accounts.","chinese":"近期再入職場的女性應確保其存有足夠的退休金。"},{"english":"Handsome men are always at an advantage and never discriminated against.","chinese":"英俊的男士永遠佔有優勢，且從不遭受職場白眼。"},{"english":"Workplace friendships are like a double-edged sword.","chinese":"職場友誼就像一把雙刃劍。"},{"english":"Everyone knows that attitudes toward work attire have relaxed.","chinese":"都知道，人們對職場裝束的態度變得隨意了。"},{"english":"There's a lot of bravura in business about how little people sleep.","chinese":"關於職場人士犧牲睡眠的壯舉有很多，我並不認同。"},{"english":"I will think naught of my family when I am in the market place for this will cloud my thoughts.","chinese":"身在職場，不可戀家，否則那會使我思想混飩。"},{"english":"In the turbulent, toss-about world of work, all kinds of people are worried about getting fired.","chinese":"在風雲變幻的職場中，每個人都在擔心會不會被炒。"},{"english":"You can try to use following methods to solve the contradictories in work.","chinese":"妳可以試著利用下面的方法來解決職場矛盾。"},{"english":"Like it or not, the multi-generational workplace is here.","chinese":"不管你喜歡與否，現在的職場就是多代共事的。"},{"english":"Smart careerists are always ready for the next opportunity.","chinese":"聰明的職場人士隨時準備好迎接下一個機會。"},{"english":"Hypomanics and manics generally have chaotic personal and professional relationships.","chinese":"輕度躁狂和躁狂患者的人際及職場關係，通常一團糟。"}],"related":[{"definition":["to be employed\/to be in post\/on-the-job"],"pinyin":["zai4 zhi2"],"word":"在職"},{"definition":["undertaking\/project\/activity\/(charitable, political or revolutionary) cause\/publicly funded institution, enterprise or foundation\/career\/occupation\/CL:個|个[ge4]"],"pinyin":["shi4 ye4"],"word":"事業"},{"definition":["society\/CL:個|个[ge4]"],"pinyin":["she4 hui4"],"word":"社會"},{"definition":["occupation\/profession\/vocation\/professional"],"pinyin":["zhi2 ye4"],"word":"職業"},{"definition":["(social) class\/CL:個|个[ge4]"],"pinyin":["jie1 ji2"],"word":"階級"},{"definition":["cognition\/cognitive\/understanding\/perception\/awareness\/to be cognizant of\/to recognize\/to realize"],"pinyin":["ren4 zhi1"],"word":"認知"},{"definition":["to mature\/to grow\/growth"],"pinyin":["cheng2 zhang3"],"word":"成長"},{"definition":["domain\/sphere\/field\/territory\/area"],"pinyin":["ling3 yu4"],"word":"領域"},{"definition":["young people\/youngster"],"pinyin":["nian2 qing1 ren2"],"word":"年輕人"},{"definition":["to begin an undertaking\/to start a major task\/to initiate\/to venture\/venture\/entrepreneurship"],"pinyin":["chuang4 ye4"],"word":"創業"},{"definition":["line of business\/industry\/occupation\/job\/employment\/school studies\/enterprise\/property\/(Buddhism) karma\/deed\/to engage in\/already","surname Ye"],"pinyin":["Ye4","ye4"],"word":"業"},{"definition":["to get a job\/employment"],"pinyin":["jiu4 ye4"],"word":"就業"},{"definition":["industry\/business"],"pinyin":["hang2 ye4"],"word":"行業"},{"definition":["every trade\/all professions\/all walks of life"],"pinyin":["ge4 hang2 ge4 ye4"],"word":"各行各業"},{"definition":["notion\/thought\/concept\/sense\/views\/ideology\/general impressions"],"pinyin":["guan1 nian4"],"word":"觀念"},{"definition":["difficult\/challenging\/straitened circumstances\/difficult situation"],"pinyin":["kun4 nan5"],"word":"困難"}]}