{"definition":["not to listen\/to be deaf to"],"pinyin":["ting1 bu4 jin4 qu5"],"simplified":["听不进去"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"聽不進去","characters":[{"definition":["(literary pronunciation, still advocated in Taiwan) to rule\/to sentence\/to allow","to listen\/to hear\/to obey\/a can (loanword from English \"tin\")\/classifier for canned beverages"],"pinyin":["ting1","ting4"],"word":"聽"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"She ranted and raved for two whole days and wouldn't listen to reason.","chinese":"她大叫大嚷吵了整整兩天，什麼也聽不進去。"},{"english":"These adults can take no comfort from their younglings.","chinese":"有些大人根本聽不進去孩子們的安慰。"},{"english":"I just can't take the advice that I shouldn't be worried about stammering.","chinese":"有人建議我不要擔心口喫，但我就是聽不進去。"},{"english":"Dumb sister moved out of the green farming method, Jin Cai can not hear.","chinese":"啞妹搬出了“綠色養殖法”，金財聽不進去。"},{"english":"He turned a deaf ear to criticism.","chinese":"他對批評聽不進去。"}],"related":[]}