{"definition":["unable to make sense of what one is hearing"],"pinyin":["ting1 bu5 dong3"],"simplified":["听不懂"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"聽不懂","characters":[{"definition":["(literary pronunciation, still advocated in Taiwan) to rule\/to sentence\/to allow","to listen\/to hear\/to obey\/a can (loanword from English \"tin\")\/classifier for canned beverages"],"pinyin":["ting1","ting4"],"word":"聽"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to understand\/to comprehend"],"pinyin":["dong3"],"word":"懂"}],"containing_words":[],"sentences":[{"english":"I couldn't understand a single word. … You could have been singing in Norwegian.","chinese":"我一個字也聽不懂，你概略在用挪威語演唱吧。"},{"english":"Firstly, she always talks in English. We don't understanded words.","chinese":"第一，她總是用英語說話，我們根本聽不懂她說什麼。"},{"english":"Excuse me, I hear a litte ask you direct for me left or right?","chinese":"對不起，我聽不懂，請您詳細指給我怎麼走好嗎？"},{"english":"The old teacher was muddling on, and nobody could follow what he was trying to say.","chinese":"這位老教師在敷衍了事，誰也聽不懂他想說什麼。"},{"english":"Although I sometimes do not understand a word you say white language.","chinese":"雖然我有時候聽不懂你說的某一句白語。"},{"english":"I could not understand the lecture on the puter given by Mr. Smith .","chinese":"我聽不懂史密斯先生作的那個關於計算機的講座。"},{"english":"He gave a answer that I could not understand, and floated on by.","chinese":"他給了一個我聽不懂的回答後，就又飄走了。"},{"english":"I haven't got a clue what you're saying.","chinese":"我一點都聽不懂你在說什麼。"},{"english":"He's been babbling since he was born, and he's still speaking gibberish.","chinese":"他從出生起就咿咿呀呀，他現在還是說些聽不懂的話。"},{"english":"He asked her what ailed her, but could not understand what she said in reply.","chinese":"他問她爲什麼難過，但是他聽不懂她回答的話。"},{"english":"Talk to me sometimes, even if I don't understand your words.","chinese":"請偶爾對我說說話，縱使我聽不懂你說的內容。"},{"english":"I could not understand the lecture on the computer given by Mr. Smith .","chinese":"我聽不懂史密斯先生作的那個觀於計算機的講座。"},{"english":"Sorry, I didn't catch you.","chinese":"對不起，我聽不懂您說的。"},{"english":"But, pardon me, you cannot understand what I am saying.","chinese":"但是請原諒，你們是聽不懂我說的這些話的。"},{"english":"\"you can't learn if you can't understand the teacher, \"she said to Nasha.","chinese":"如果你聽不懂老師在說什麼，那你就什麼都學不到。"},{"english":"Sorry, I don't understand you, will you speak slowly?","chinese":"對不起，我聽不懂您的話，請您講慢點兒好嗎？"}],"related":[{"definition":["Mandarin (common language)\/Putonghua (common speech of the Chinese language)\/ordinary speech"],"pinyin":["pu3 tong1 hua4"],"word":"普通話"},{"definition":["to understand (by hearing)\/to catch (what sb says)"],"pinyin":["ting1 de5 dong3"],"word":"聽得懂"},{"definition":["to understand (on hearing)\/to catch (what is spoken)"],"pinyin":["ting1 dong3"],"word":"聽懂"},{"definition":["Cantonese language"],"pinyin":["Guang3 dong1 hua4"],"word":"廣東話"},{"definition":["Cantonese language"],"pinyin":["Yue4 yu3"],"word":"粵語"},{"definition":["Southern Min, a Sinitic language spoken in southern Fujian and surrounding areas"],"pinyin":["Min3 nan2 hua4"],"word":"閩南話"},{"definition":["to speak\/to say\/to talk\/to gossip\/to tell stories\/talk\/word"],"pinyin":["shuo1 hua4"],"word":"說話"},{"definition":["Chinese language (Mandarin), emphasizing its national nature\/Chinese as a primary or secondary school subject\/Chinese in the context of the Nationalist Government\/Guoyu, book of historical narrative c. 10th-5th century BC"],"pinyin":["Guo2 yu3"],"word":"國語"},{"definition":["Taiwanese\/Hokklo"],"pinyin":["Tai2 yu3"],"word":"台語"},{"definition":["Hakka dialect"],"pinyin":["Ke4 jia1 hua4"],"word":"客家話"},{"definition":["unpleasant to hear\/coarse\/vulgar\/offensive\/shameful"],"pinyin":["nan2 ting1"],"word":"難聽"},{"definition":["see 沒關係|没关系[mei2 guan1 xi5]"],"pinyin":["mei2 you3 guan1 xi5"],"word":"沒有關係"},{"definition":["to speak\/to explain\/to negotiate\/to emphasise\/to be particular about\/as far as sth is concerned\/speech\/lecture"],"pinyin":["jiang3"],"word":"講"},{"definition":["accent"],"pinyin":["qiang1 diao4"],"word":"腔調"},{"definition":["Beijing dialect"],"pinyin":["Bei3 jing1 hua4"],"word":"北京話"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"}]}