{"definition":["to submit to the will of heaven\/to resign oneself to fate\/to trust to luck"],"pinyin":["ting1 tian1 you2 ming4"],"simplified":["听天由命"],"rank":38155.0,"normalized_rank":0.5338379527933625,"fraction":4.577858378390193e-7,"cumulative_fraction":0.9957143335050662,"word":"聽天由命","characters":[{"definition":["(literary pronunciation, still advocated in Taiwan) to rule\/to sentence\/to allow","to listen\/to hear\/to obey\/a can (loanword from English \"tin\")\/classifier for canned beverages"],"pinyin":["ting1","ting4"],"word":"聽"},{"definition":["day\/sky\/heaven"],"pinyin":["tian1"],"word":"天"},{"definition":["to follow\/from\/it is for...to\/reason\/cause\/because of\/due to\/to\/to leave it (to sb)\/by (introduces passive verb)"],"pinyin":["you2"],"word":"由"},{"definition":["life\/fate\/order or command\/to assign a name, title etc"],"pinyin":["ming4"],"word":"命"}],"containing_words":[],"sentences":[{"english":"They have abandoned their children to the tender mercies of the social services.","chinese":"他們遺棄了孩子，任其在社會福利中聽天由命。"},{"english":"By late afternoon Alex had become resigned.","chinese":"接近黃昏時，亞歷克斯已經準備聽天由命。"},{"english":"You are the angel befallen the stage.","chinese":"我聽天由命，凡降臨於我的都是公正的。"},{"english":"You can larn slowly, and sometimes painfully, by just waiting for life to happen to you.","chinese":"你可以聽天由命，慢慢的學，有時候或許會很痛苦。"},{"english":"Before busy, first divide the work, I only a portion to eat not to wash the dishes, it is resigned.","chinese":"忙前，先分個工，我只喫飯不洗碗，這就聽天由命了。"},{"english":"Algren: I think a man does what he can, until his destiny is revealed.","chinese":"我相信，人應竭盡所能，然後才聽天由命。"},{"english":"This was the last blow. Gringoire received it with resignation.","chinese":"這是最後一個打擊，甘果瓦聽天由命地接受了。"},{"english":"Is success in life earned or do people succeed because they are lucky?","chinese":"成功是事在人爲還是聽天由命？"},{"english":"My choice was to sit back and let life take its course or for me to plan it.","chinese":"我可以選擇聽天由命，或是奪過對命運的掌控權。"},{"english":"Oh well, like Trey said, inshallah , which meant, like, whatever.","chinese":"對了，像特里說的，聽天由命。"},{"english":"Submit to the will of Heaven cause they know too much about the world.","chinese":"它們正因爲對這個世界知曉得太多，才這樣聽天由命。"},{"english":"The trains are often late, so getting to work on time is a fairly hit-and-miss affair.","chinese":"火車時常晚到，所以上班要準時完全要聽天由命。"},{"english":"He lay an image of sadness and resignation waiting his death.","chinese":"他帶着悲哀的，聽天由命的神氣躺着等死。"}],"related":[{"definition":["(idiom) due to an unexpected turn of events"],"pinyin":["yin1 cuo4 yang2 cha1"],"word":"陰錯陽差"},{"definition":["stepping stone\/fig. person used to advance one's career"],"pinyin":["dian4 jiao3 shi2"],"word":"墊腳石"},{"definition":["without a retreat route\/caught in a dead end\/having burned one's bridges"],"pinyin":["wu2 lu4 ke3 tui4"],"word":"無路可退"},{"definition":["to withdraw\/to hole up"],"pinyin":["gui1 suo1"],"word":"龜縮"},{"definition":["to patch up one's lie (when inconsistencies appear)\/to cover (for sb who has lied)"],"pinyin":["yuan2 huang3"],"word":"圓謊"},{"definition":["ability\/skill"],"pinyin":["liang3 ba3 shua1 zi5"],"word":"兩把刷子"},{"definition":["to get straight to the point (idiom)"],"pinyin":["dan1 dao1 zhi2 ru4"],"word":"單刀直入"},{"definition":["to let emotions affect one's decisions"],"pinyin":["yi4 qi4 yong4 shi4"],"word":"意氣用事"},{"definition":["spilt water is difficult to retrieve (idiom)\/it's no use crying over spilt milk\/what's done is done and can't be reversed\/the damage is done\/once divorced, there's no reuniting"],"pinyin":["fu4 shui3 nan2 shou1"],"word":"覆水難收"},{"definition":["lit. cannot rest or eat in peace (idiom)\/fig. extremely worried and troubled"],"pinyin":["qin3 shi2 nan2 an1"],"word":"寢食難安"},{"definition":["to ignore\/to brush off\/to dismiss\/to pay no attention to"],"pinyin":["bu4 yu3 li3 hui4"],"word":"不予理會"},{"definition":["open the net on one side (idiom); let the caged bird fly\/to give one's opponent a way out\/lenient treatment"],"pinyin":["wang3 kai1 yi1 mian4"],"word":"網開一面"},{"definition":["lit. to give medicine to a dead horse (idiom)\/fig. to keep trying everything in a desperate situation"],"pinyin":["si3 ma3 dang4 huo2 ma3 yi1"],"word":"死馬當活馬醫"},{"definition":["the trick of injuring oneself to gain the enemy's confidence\/CL:條|条[tiao2]"],"pinyin":["ku3 rou4 ji4"],"word":"苦肉計"},{"definition":["depressed\/cheerless"],"pinyin":["yu4 yu4 gua3 huan1"],"word":"鬱鬱寡歡"},{"definition":["clever and eloquent (idiom); fluent\/having the gift of the gab"],"pinyin":["ling2 ya2 li4 chi3"],"word":"伶牙俐齒"}]}