{"definition":["ossicles (in the middle ear)\/also written 聽小骨|听小骨"],"pinyin":["ting1 gu3"],"simplified":["听骨"],"rank":69208.0,"normalized_rank":0.9683097113595344,"fraction":4.525306432719897e-9,"cumulative_fraction":0.999993592604012,"word":"聽骨","characters":[{"definition":["(literary pronunciation, still advocated in Taiwan) to rule\/to sentence\/to allow","to listen\/to hear\/to obey\/a can (loanword from English \"tin\")\/classifier for canned beverages"],"pinyin":["ting1","ting4"],"word":"聽"},{"definition":["bone"],"pinyin":["gu3"],"word":"骨"}],"containing_words":[{"definition":["chain of ossicles (in the middle ear)"],"pinyin":["ting1 gu3 lian4"],"word":"聽骨鏈"}],"sentences":[{"english":"Lesion of ossicular chain is a common ear disease impairing the sense of hearing.","chinese":"聽骨鏈病變是導致患者聽力水平下降的普遍病症。"},{"english":"Ossiculoplasty can steadily improve hearing postoperatively in most cases.","chinese":"採用聽骨成形術可以有效地改善聽力。"},{"english":"Methods The ossicular reconstruction of 6 patients who suffered from middle conductive hearing loss were operated by the endoscope.","chinese":"方法用耳內鏡爲6例傳導性耳聾患者重建聽骨鏈。"},{"english":"To study morphologic changes of ear ossicles and auditory ossicular chain of patients with conductive deafness.","chinese":"明確傳導性耳聾的聽小骨及聽骨鏈的形態學改變。"},{"english":"The technique type choice should also e pick Sichuan to the auditory bone chain operation as far as possible few methods.","chinese":"術式選擇也應盡峨採川對聽骨鏈操作儘可能少的方法。"},{"english":"Objective To explore diagnosis and therapy of traumatic ossicular chain disruption.","chinese":"目的探討外傷性聽骨鏈中斷的診斷和治療。"},{"english":"Objective To look for an new operated method of the ossicular reconstruction.","chinese":"目的爲聽骨鏈重建術尋找一種新的手術方法。"}],"related":[]}