{"definition":["carnitine (biochemistry)"],"pinyin":["rou4 jian3"],"simplified":["肉碱"],"rank":57058.0,"normalized_rank":0.7983154477914737,"fraction":6.320831243121662e-8,"cumulative_fraction":0.9996619206334518,"word":"肉鹼","characters":[{"definition":["meat\/flesh\/pulp (of a fruit)\/(coll.) (of a fruit) squashy\/(of a person) flabby\/irresolute\/Kangxi radical 130"],"pinyin":["rou4"],"word":"肉"},{"definition":["base\/alkali\/soda (chemistry)"],"pinyin":["jian3"],"word":"鹼"}],"containing_words":[],"sentences":[{"english":"Carnitine is a nutrient that helps the body turn fat into energy.","chinese":"肉鹼是一種營養，幫助人體脂肪轉化爲能量。"},{"english":"You should not self-treat chest pain with carnitine, however.","chinese":"你不應該自我治療肉鹼胸痛，但是。"},{"english":"There is no reaction on the body, because pure L-carnitine.","chinese":"對身體沒有任何反作用的，由於是純左旋肉鹼。"},{"english":"Well-being of L-carnitine really fast to lose weight?","chinese":"左旋肉鹼真的可以快速安康減肥嗎？"},{"english":"It is also possible that carnitine can help nerves regenerate.","chinese":"這也可能是肉鹼可以幫助神經再生。"},{"english":"Tea polyphenols and carnitine preparation can reduce blood lipid.","chinese":"茶多酚肉鹼複方製劑具有輔助降血脂的作用。"},{"english":"Applicable to a variety of L-carnitine and heart health-related purposes.","chinese":"左旋肉鹼適用於多種與心臟健康有關的用途。"},{"english":"The evidence is mixed as to whether carnitine is useful in treating Alzheimer's disease.","chinese":"證據是混合是否肉鹼是有用的治療阿爾茨海默氏病。"},{"english":"Such as L-carnitine ah whatever.","chinese":"比如左旋肉鹼啊什麼的。"},{"english":"L-carnitine is a fat into energy to the class of amino acids.","chinese":"左旋肉鹼是一種促使脂肪轉化爲能量的類氨基酸。"},{"english":"Effects of carnitine on adipose metabolism in Chinese soft-shelled turtles.","chinese":"肉鹼對中華鱉脂肪代謝的影響。"},{"english":"Niuxin Kang L-carnitine Where can I buy genuine?","chinese":"紐欣康左旋肉鹼在哪能買到正品？"},{"english":"Many baby milk powder has increased L-carnitine.","chinese":"很多嬰兒奶粉裏都有增加左旋肉鹼。"},{"english":"My company professional engaged in the L-carnitine series development and production of varieties.","chinese":"我公司專業從事於左旋肉鹼系列品種的開發和生產。"},{"english":"The main physiological function of L-carnitine to promote fat into energy. A U.","chinese":"左旋肉鹼的主要生理功用是促進脂肪轉化成能量。"}],"related":[]}