{"definition":["electromyogram (EMG)"],"pinyin":["ji1 dian4 tu2"],"simplified":["肌电图"],"rank":61165.0,"normalized_rank":0.8557777062667021,"fraction":3.4450719939416e-8,"cumulative_fraction":0.9998591610775598,"word":"肌電圖","characters":[{"definition":["flesh\/muscle"],"pinyin":["ji1"],"word":"肌"},{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["diagram\/picture\/drawing\/chart\/map\/CL:張|张[zhang1]\/to plan\/to scheme\/to attempt\/to pursue\/to seek"],"pinyin":["tu2"],"word":"圖"}],"containing_words":[],"sentences":[{"english":"Laryngeal electromyography (LEMG) plays a potentially significant role in the diagnosis of neuromuscular disorder of the larynx .","chinese":"喉肌電圖爲診斷喉部肌肉及神經性疾病的直接方法。"},{"english":"Objective To study the clinical significance of single fiber electromyography in diabetic peripheral neuropathy.","chinese":"目的探討單纖維肌電圖在糖尿病周圍神經病中的應用。"},{"english":"This paper introduces an EMG multi-gateway analysis diagnosis and information management system.","chinese":"介紹所開發的肌電圖多途徑分析診斷及信息管理系統。"},{"english":"The clinical value of EMG of polymyositis was discussed in the pape…","chinese":"文中還討論了本病肌電圖檢查的臨牀價值。"},{"english":"Needle electromyography of anterior tibial muscle showed fibrillations and positive sharp waves.","chinese":"發病兔脛前肌肌電圖可見正相尖波和纖顫電位。"},{"english":"The clinical value of EMG of polymyositis was discussed in the paper.","chinese":"文中還討論了本病肌電圖檢查的臨牀價值。"},{"english":"Objective To discuss the role of electromyogram and electroneurogram to diagnose the tarsal tunnel syndrome.","chinese":"目的探討肌電圖和神經電圖對踝管綜合徵的診斷作用。"},{"english":"Aim To study the clinical significance of single fiber electromyography in diabetic peripheral neuropathy.","chinese":"目的探討單纖維肌電圖在糖尿病周圍神經病中的應用。"}],"related":[]}