{"definition":["(have sb in) the palm of one's hand\/fig. (under) one's complete control"],"pinyin":["gu3 zhang3"],"simplified":["股掌"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"股掌","characters":[{"definition":["thigh\/part of a whole\/portion of a sum\/(stock) share\/strand of a thread\/low-level administrative unit, translated as \"section\" or \"department\" etc, ranked below 科[ke1]\/classifier for long winding things like ropes, rivers etc\/classifier for smoke, smells etc: thread, puff, whiff\/classifier for bands of people, gangs etc\/classifier for sudden forceful actions"],"pinyin":["gu3"],"word":"股"},{"definition":["palm of the hand\/sole of the foot\/paw\/horseshoe\/to slap\/to hold in one's hand\/to wield"],"pinyin":["zhang3"],"word":"掌"}],"containing_words":[],"sentences":[{"english":"China is brilliant at playing divide and rule among individual EU countries.","chinese":"中國玩弄歐盟單個國家於股掌之間。"},{"english":"People always like to think that they can beat the stock market.","chinese":"人們總覺得自己能夠玩弄市場於股掌之中。"},{"english":"Virginia is hosting an institution that the Kochs practically control.","chinese":"弗吉尼亞州的這所大學實際上已經在科氏股掌之間了。"}],"related":[{"definition":["to play with\/to toy with\/to dally with\/to engage in\/to resort to"],"pinyin":["wan2 nong4"],"word":"玩弄"},{"definition":["to play with\/to engage in\/to resort to\/to dally with"],"pinyin":["shua3 nong4"],"word":"耍弄"},{"definition":["to produce clouds with one turn of the hand and rain with another (idiom); fig. to shift one's ground\/tricky and inconstant\/to make love"],"pinyin":["fan1 yun2 fu4 yu3"],"word":"翻雲覆雨"},{"definition":["within the range of a bow and arrow\/(fig.) under sb's control"],"pinyin":["gou4 zhong1"],"word":"彀中"},{"definition":["to reckon\/to calculate\/to plan\/to expect\/to scheme"],"pinyin":["suan4 ji5"],"word":"算計"},{"definition":["life-and-death power\/ultimate power"],"pinyin":["sheng1 sha1 da4 quan2"],"word":"生殺大權"},{"definition":["free to come and go (idiom)\/to have room to maneuver"],"pinyin":["jin4 tui4 zi4 ru2"],"word":"進退自如"},{"definition":["to slaughter\/(fig.) to ride roughshod over\/to take advantage of (others)"],"pinyin":["zai3 ge1"],"word":"宰割"},{"definition":["to place sb on field of death\/to confront with mortal danger\/to give sb no way out\/with one's back to the wall\/looking death in the eye\/part of idiom 置之死地而後生|置之死地而后生"],"pinyin":["zhi4 zhi1 si3 di4"],"word":"置之死地"},{"definition":["crafty plots and machinations (idiom)"],"pinyin":["yin1 mou2 gui3 ji4"],"word":"陰謀詭計"},{"definition":["treacherous and murderous"],"pinyin":["yin1 xian3 du2 la4"],"word":"陰險毒辣"},{"definition":["to provoke"],"pinyin":["tiao3 ba2"],"word":"挑拔"},{"definition":["the power of sb or sth evil\/the clutches (of a bad person etc)"],"pinyin":["mo2 zhang3"],"word":"魔掌"},{"definition":["lit. to upend heaven and earth (idiom)\/fig. to change the course of events\/to turn things around"],"pinyin":["niu3 zhuan3 qian2 kun1"],"word":"扭轉乾坤"},{"definition":["lit. to turn over one's palm\/fig. everything is going very well."],"pinyin":["fan3 zhang3"],"word":"反掌"},{"definition":["to plan\/operations\/logistics"],"pinyin":["yun4 chou2"],"word":"運籌"}]}