{"definition":["stock market index\/share price index\/abbr. for 股票指數|股票指数[gu3 piao4 zhi3 shu4]"],"pinyin":["gu3 zhi3"],"simplified":["股指"],"rank":2695.0,"normalized_rank":0.03770654652805955,"fraction":0.00005446731811235099,"cumulative_fraction":0.7750972431676563,"word":"股指","characters":[{"definition":["thigh\/part of a whole\/portion of a sum\/(stock) share\/strand of a thread\/low-level administrative unit, translated as \"section\" or \"department\" etc, ranked below 科[ke1]\/classifier for long winding things like ropes, rivers etc\/classifier for smoke, smells etc: thread, puff, whiff\/classifier for bands of people, gangs etc\/classifier for sudden forceful actions"],"pinyin":["gu3"],"word":"股"},{"definition":["finger\/to point at or to\/to indicate or refer to\/to depend on\/to count on\/(of hair) to stand on end"],"pinyin":["zhi3"],"word":"指"}],"containing_words":[],"sentences":[{"english":"If without critical bad news, the index will continue to rise up next week.","chinese":"如果沒有重大利空消息，下週股指延續上行趨勢不變。"},{"english":"Asian shares were mixed while U. S. stock futures were pointing to mild gains on Wall Street.","chinese":"亞洲股市漲跌互現，美國股指期貨開盤後小幅走高。"},{"english":"Even so, the comments sent stocks into a late-afternoon dive.","chinese":"即便如此，此番言論還是令股指在尾盤跳水。"},{"english":"Johnson & Johnson and Merck Sharp & Dohme down the impact of the performance of the Dow to lag behind other indexes.","chinese":"強生與默沙東下跌影響，道指表現落後於其它股指。"},{"english":"Asian shares lost ground while U.S. stock futures were pointing to a steady open on Wall Street.","chinese":"亞洲股市紛紛失守，美國股指期貨開盤走穩。"},{"english":"I discuss the function which Index Future downsizes risks of the stock market in the paper.","chinese":"本文研究了股指期貨對股市風險的防範。"},{"english":"Owning heavyweight stocks will give institutions more control of the index futures.","chinese":"擁有權重股將增加機構投資者對股指期貨的控制力。"},{"english":"The local shares index has dropped sharply towards the 3000 mark.","chinese":"本地股指驟降，直逼3000點大關。"},{"english":"Stocks have risen from their lows of a week ago.","chinese":"股指已經從一週前的低點開始上漲。"},{"english":"The red digital in the stock exchange indicates that the stock index has risen slightly.","chinese":"證券交易所的紅盤顯示，股指略有上漲。"},{"english":"As the index goes up, there is more and more pressure on cash flows.","chinese":"隨着股指的走高，獲利盤的套現壓力越來越大。"},{"english":"Major European indexes erased early morning losses.","chinese":"歐洲幾大股指早盤收復失地。"},{"english":"Other major stock indexes also fell heavily.","chinese":"其他主要股指同樣嚴重下跌。"},{"english":"On the same day, two other major European stock indexes have suffered various magnitudes .","chinese":"當日，歐洲其他兩大主要股指卻遭受不同程度的跌幅。"},{"english":"U.S. stock-index futures climbed while Asian shares retreated.","chinese":"美國股指期貨上漲，亞洲股市下滑。"}],"related":[{"definition":["Shanghai Stock Exchange (SSE), abbr. for 上海證券交易所|上海证券交易所[Shang4 hai3 Zheng4 quan4 Jiao1 yi4 suo3]"],"pinyin":["Shang4 Zheng4"],"word":"上證"},{"definition":["Shanghai composite index (stock market index)"],"pinyin":["Hu4 zong1 zhi3"],"word":"滬綜指"},{"definition":["market close"],"pinyin":["shou1 pan2"],"word":"收盤"},{"definition":["(of sales, prices etc) to fall\/to drop\/decline\/slump"],"pinyin":["xia4 cuo4"],"word":"下挫"},{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"word":"反彈"},{"definition":["blue chip stock"],"pinyin":["lan2 chou2 gu3"],"word":"藍籌股"},{"definition":["to vibrate\/to shake\/to shudder"],"pinyin":["zhen4 dang4"],"word":"震蕩"},{"definition":["to fall\/to tumble"],"pinyin":["xia4 die1"],"word":"下跌"},{"definition":["(numerical, statistical) index\/(math.) exponent\/index\/exponential (function, growth)"],"pinyin":["zhi3 shu4"],"word":"指數"},{"definition":["tendency\/trend\/path"],"pinyin":["zou3 shi4"],"word":"走勢"},{"definition":["(of a stock price or market index) currently higher than at the previous day's close"],"pinyin":["hong2 pan2"],"word":"紅盤"},{"definition":["short term"],"pinyin":["duan3 xian4"],"word":"短線"},{"definition":["to fall back\/to return to low level after a rise (in water level, price etc)"],"pinyin":["hui2 luo4"],"word":"回落"},{"definition":["large fall"],"pinyin":["da4 die1"],"word":"大跌"},{"definition":["to fall back (of water level or share prices)"],"pinyin":["hui2 die1"],"word":"回跌"},{"definition":["market price\/quotation of market price\/the current market situation"],"pinyin":["hang2 qing2"],"word":"行情"}]}