{"definition":["tuberculosis, TB"],"pinyin":["fei4 jie2 he2 bing4"],"simplified":["肺结核病"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"肺結核病","characters":[{"definition":["lung\/CL:個|个[ge4]"],"pinyin":["fei4"],"word":"肺"},{"definition":["(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]","knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)"],"pinyin":["jie1","jie2"],"word":"結"},{"definition":["pit\/stone\/nucleus\/nuclear\/to examine\/to check\/to verify"],"pinyin":["he2"],"word":"核"},{"definition":["illness\/CL:場|场[chang2]\/disease\/to fall ill\/defect"],"pinyin":["bing4"],"word":"病"}],"containing_words":[],"sentences":[{"english":"Objective To learn the situation of supervision and management of pulmonary tuberculosis(TB) patients by village doctors and its influential factors.","chinese":"目的瞭解村醫生督導管理肺結核病人現狀及影響因素。"},{"english":"Objective To test the efficacy of rifapention on treating patients with pulmonary tuberculosis.","chinese":"目的驗證利福噴丁治療肺結核病的療效。"},{"english":"Objective To analyze the treatment effects of smear-positive cases with pulmonary tuberculosis.","chinese":"目的分析塗陽肺結核病人的化療效果。"},{"english":"The delayed rate of newly registered smear positive patients was over 64%.","chinese":"新登塗陽肺結核病人延誤爲64%以上。"},{"english":"Objective To probe the source of smear-positive patients.","chinese":"目的分析塗陽肺結核病人轉診情況。"},{"english":"No matter what it does, the signal says this one has TB.","chinese":"無論這隻老鼠做什麼，信號都顯示它患有肺結核病。"},{"english":"Objective To analyze outcomes of pulmonary tuberculosis prevention and control in Henan Normal University students.","chinese":"目的分析河南師大學生肺結核病預防控制效果。"},{"english":"JUNE SUGIYAMA: \"Especially TB medication needs to be kept in a certain temperature.\"","chinese":"特別是治療肺結核病的藥物需要控制在特定的溫度。"},{"english":"We now know the identity of the federally-quarantined tuberculosis patient.","chinese":"現已確認了被聯邦調查局隔離的肺結核病者的身份。"},{"english":"Objective To study clinic characteristic of pregnancy with acute miliary pulmonary tuberculosis.","chinese":"目的探討妊娠合併急性粟粒型肺結核病的臨牀特徵。"},{"english":"Tuberculosis can be reactivated by overwork.","chinese":"肺結核病可以由於過度勞累而復發。"},{"english":"History of contact with T. B. patients?","chinese":"曾與肺結核病人接觸？"},{"english":"Tuberculosis was once terribly fashionable.","chinese":"肺結核病曾經一度廣泛流行。"},{"english":"TB is a bacterial infection that predominantly attacks the lungs.","chinese":"肺結核病是由細菌感染引發的，它主要侵蝕肺部。"},{"english":"The effect of lotus root are Qingfei bleeding, tuberculosis patients are advised to eat.","chinese":"蓮藕還有清肺止血的功效，肺結核病人最宜食用。"},{"english":"And there is still no vaccine able to prevent pulmonary TB, the most common form of the disease.","chinese":"目前仍無疫苗能夠預防最常見的肺結核病。"}],"related":[]}