{"definition":["peptide chain (chain of amino acids making up protein)"],"pinyin":["tai4 lian4"],"simplified":["肽链"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"肽鏈","characters":[{"definition":["peptide (two or more amino acids linked by peptide bonds CO-NH)"],"pinyin":["tai4"],"word":"肽"},{"definition":["chain\/cable (unit of length: 100 fathoms, about 185 m)\/chain (unit of length: 66 feet, about 20 m)\/to chain\/to enchain"],"pinyin":["lian4"],"word":"鏈"}],"containing_words":[],"sentences":[{"english":"A computer program for DNA and polypeptide sequence analysis was made.","chinese":"本文介紹了一種DNA和多肽鏈序列分析的軟件系統。"},{"english":"Proteins are made up of one or more polypeptides. See peptide; denaturation; conjugated protein.","chinese":"蛋白質是由一條或多條多肽鏈組成。"},{"english":"Are the residues contiguous in the primary sequence of the polypeptide chain?","chinese":"這些殘基在多肽鏈的一級結構上是連續的嗎？"},{"english":"These amino acids are polymerized to form the growing polypeptide chain.","chinese":"這些氨基酸聚合在一起形成了伸長的多肽鏈。"},{"english":"Amino acids link together to form chains called peptides.","chinese":"氨基酸連接在一起，形成所謂的肽鏈。"},{"english":"This spatial configuration of the polypeptide chain is the secondary structure.","chinese":"肽鏈的這個空間構象就是二級結構。"},{"english":"Conclusion It is concluded that carboxylate oxygen and chromium were bonding with coordinated bond.","chinese":"結論蛋白質肽鏈上的羰基氧與鉻形成配位鍵。"},{"english":"Primary structure --- The amino acid sequence of a polypeptide.","chinese":"多肽鏈的氨基酸序列。"},{"english":"Quality control over protein structure and function depends on the presence of molecular chaperones and proteases, which prevent aggregation.","chinese":"分子伴侶和蛋白酶可有效地調控多肽鏈的正確摺疊。"},{"english":"Proteins are made up of one or more polypeptides.","chinese":"蛋白質是由一條或多條多肽鏈組成。"},{"english":"As reaction time was prolonged, the lengths of the peptides were increased.","chinese":"隨着反應時間的延長，所形成的肽鏈的長度也會增加。"}],"related":[]}