{"definition":["to indulge in flights of fancy (idiom)\/to let one's imagination run wild"],"pinyin":["hu2 si1 luan4 xiang3"],"simplified":["胡思乱想"],"rank":28486.0,"normalized_rank":0.3985560981069775,"fraction":0.000001078628684882817,"cumulative_fraction":0.9887164657653744,"word":"胡思亂想","characters":[{"definition":["non-Han people, esp. from central Asia\/reckless\/outrageous\/what?\/why?\/to complete a winning hand at mahjong (also written 和[hu2])","surname Hu"],"pinyin":["Hu2","hu2"],"word":"胡"},{"definition":["to think\/to consider"],"pinyin":["si1"],"word":"思"},{"definition":["in confusion or disorder\/in a confused state of mind\/disorder\/upheaval\/riot\/illicit sexual relations\/to throw into disorder\/to mix up\/indiscriminate\/random\/arbitrary"],"pinyin":["luan4"],"word":"亂"},{"definition":["to think\/to believe\/to suppose\/to wish\/to want\/to miss (feel wistful about the absence of sb or sth)"],"pinyin":["xiang3"],"word":"想"}],"containing_words":[],"sentences":[{"english":"She was never flighty like you.","chinese":"她從來不像你這樣胡思亂想。"},{"english":"My fantasy spills soup and gravy .","chinese":"由於我在胡思亂想，倒翻了菜湯和肉汁。"},{"english":"An idle man will woolgather .","chinese":"人一閒下來就會胡思亂想。"},{"english":"Studies show that the average person experiences paranoia on a daily basis.","chinese":"研究表明普通人每天都會有一些胡思亂想的體驗。"},{"english":"She dreamt about vacation plans when she should have been working.","chinese":"她在本應工作時胡思亂想着度假計劃。"},{"english":"As he sat on his bunk that final night, butterflies fluttered in his stomach.","chinese":"在最後一夜他坐在自己的鋪位上，開始胡思亂想。"},{"english":"What with his students and what with his sports, the school-boy had no time left for idle thoughts.","chinese":"一半是功課，一半是運動，學生沒有時間胡思亂想。"},{"english":"I will lie in bed, awake, forever thinking and rethinking whatever happens to be on my mind at the time.","chinese":"而我，卻總躺在牀上，胡思亂想，難以入夢。"},{"english":"In the Spring and Autumn Period, in the State of Qi there was a man who always let his imagination run away with him.","chinese":"春秋時代，杞國有一個喜歡胡思亂想的人。"},{"english":"He says he works hard, but he's day-dreaming half the time.","chinese":"他說他工作努力，但他卻常常在胡思亂想。"},{"english":"That then takes you away from the task at hand. Or you may even end up nodding off.","chinese":"如果不把你從胡思亂想中拉回來，你甚至可能打瞌睡。"},{"english":"Oatmeal may help if you find yourself feeling irritable and cranky.","chinese":"燕麥可以幫助你緩解急躁和胡思亂想的情緒。"},{"english":"I noticed that my bread was leaving a lot of crumbs on thefloor, while I daydreamed.","chinese":"我才發現我在胡思亂想的時候把麪包屑都弄到地上了。"},{"english":"Dorothea felt rather ashamed as she detected herself in these speculations .","chinese":"多蘿西婭發現自己這麼胡思亂想，不免有些臉紅。"},{"english":"Oh, please do not suggest anything incestuous.","chinese":"哦，請你們別胡思亂想了。"},{"english":"We don’t know how hard it is to stop thinking until we try.","chinese":"如果不去嘗試，我們不會知道要停止胡思亂想有多難。"}],"related":[{"definition":["to intertwine\/to band together (with)\/to link up (with)\/twisted\/tangled\/confused\/to be at a loss"],"pinyin":["jiu1 jie2"],"word":"糾結"},{"definition":["lit. to penetrate into a bull's horn (idiom); fig. to waste time on an insoluble or insignificant problem\/to bash one's head against a brick wall\/a wild goose chase\/a blind alley\/to split hairs"],"pinyin":["zuan1 niu2 jiao3 jian1"],"word":"鑽牛角尖"},{"definition":["to toss from side to side (e.g. sleeplessly)\/to repeat sth over and over again\/to torment sb\/to play crazy\/to squander (time, money)"],"pinyin":["zhe1 teng5"],"word":"折騰"},{"definition":["brains\/mind\/CL:個|个[ge4]"],"pinyin":["nao3 zi5"],"word":"腦子"},{"definition":["cannot figure out\/to be unable to take a lighter view\/to take things too hard\/to be depressed\/to fret over trifles"],"pinyin":["xiang3 bu5 kai1"],"word":"想不開"},{"definition":["hesitancy\/indecision\/to waver"],"pinyin":["you2 yu4 bu4 jue2"],"word":"猶豫不決"},{"definition":["brains\/mind\/head\/way of thinking"],"pinyin":["nao3 jin1"],"word":"腦筋"},{"definition":["emotional\/sentimental"],"pinyin":["qing2 xu4 hua4"],"word":"情緒化"},{"definition":["to prattle\/to chatter away\/to nag\/garrulous\/nagging"],"pinyin":["lao2 dao5"],"word":"嘮叨"},{"definition":["to tell lies"],"pinyin":["sa1 huang3"],"word":"撒謊"},{"definition":["lacking in confidence\/diffident\/to have a guilty conscience"],"pinyin":["xin1 xu1"],"word":"心虛"},{"definition":["bored\/fed up with sth\/sick of sth"],"pinyin":["yan4 fan2"],"word":"厭煩"},{"definition":["at a loss to know what to do (idiom); bewildered"],"pinyin":["shou3 zu2 wu2 cuo4"],"word":"手足無措"},{"definition":["to be in a tangle\/to nag"],"pinyin":["jiu1 chan2"],"word":"糾纏"},{"definition":["now hot, now cold\/(of one's mood, affection etc) to alternate"],"pinyin":["hu1 leng3 hu1 re4"],"word":"忽冷忽熱"},{"definition":["to grieve\/to be broken-hearted\/to feel deeply hurt"],"pinyin":["shang1 xin1"],"word":"傷心"}]}