{"definition":["to act willfully and make a scene\/to make trouble"],"pinyin":["hu2 nao4"],"simplified":["胡闹"],"rank":31973.0,"normalized_rank":0.4473437521861402,"fraction":7.9178264809912e-7,"cumulative_fraction":0.9919474644890752,"word":"胡鬧","characters":[{"definition":["non-Han people, esp. from central Asia\/reckless\/outrageous\/what?\/why?\/to complete a winning hand at mahjong (also written 和[hu2])","surname Hu"],"pinyin":["Hu2","hu2"],"word":"胡"},{"definition":["noisy\/cacophonous\/to make noise\/to disturb\/to vent (feelings)\/to fall ill\/to have an attack (of sickness)\/to go in (for some activity)\/to joke"],"pinyin":["nao4"],"word":"鬧"}],"containing_words":[],"sentences":[{"english":"Was this a lover, or a lecher whether?","chinese":"誰知這究竟是戀愛，還是瞎胡鬧？"},{"english":"Stop pissing about. I've got work to do.","chinese":"別胡鬧了，我還有活要幹。"},{"english":"In the age of the farce, the choice can be made a lovely children.","chinese":"在可以胡鬧的年齡，選擇做了一個乖孩子。"},{"english":"If you behave so foolishly you must be ready to take the consequences.","chinese":"假如你這樣瞎胡鬧，就應該準備自食其果。"},{"english":"After school some students are horsing around in the park.","chinese":"放學後，一些學生在公園裏胡鬧。"},{"english":"\"Idiotic?\" Natalie said. \"I was just deciding it's rather magical.","chinese":"“瞎胡鬧？”娜塔麗說，“我正覺得有點神奇呢。”"},{"english":"That boy is seldom serious about anything. He's sll the time clowning around.","chinese":"那個男孩對任何事件都不認真，他總是胡鬧。"},{"english":"You have been raking and smoking too much, you wicked boy.","chinese":"你成天胡鬧，吸菸吸得太多了，你這個淘氣的孩子。"},{"english":"That man is seldom serious acres anything. He's sll the time clhaveing by oneself.","chinese":"這個男孩對任何事件都不認真，他總是胡鬧。"},{"english":"He told the boys to quit their monkey business，or he would call a teacher.","chinese":"他告訴那些男孩子不要再胡鬧，不然他就叫老師。"},{"english":"Stop larking about and get on with your work.","chinese":"別到處胡鬧了，幹活去吧。"},{"english":"These dissipations make against your chance of success.","chinese":"你這樣胡鬧下去，就很難有所成就了。"},{"english":"Were you serious, or was that a bit of tomfoolery?","chinese":"你是認真的呢，還是有點胡鬧？"},{"english":"They are not working;they are just assing about.","chinese":"他們不幹活，淨胡鬧。"},{"english":"You boys have been horsing about again, getting yourselves dirty.","chinese":"你們這些男孩們又在胡鬧，把身上都弄髒了。"},{"english":"The prank went undetected around the world.","chinese":"全世界都沒察覺這場胡鬧。"}],"related":[{"definition":["to argue\/to reason with sb\/to talk sense\/to be reasonable"],"pinyin":["jiang3 li3"],"word":"講理"},{"definition":["to gesticulate while talking (idiom)\/to explain by waving one's hands\/to criticize or give orders summarily"],"pinyin":["zhi3 shou3 hua4 jiao3"],"word":"指手畫腳"},{"definition":["to make trouble without reason (idiom); to be deliberately provocative"],"pinyin":["wu2 li3 qu3 nao4"],"word":"無理取鬧"},{"definition":["to look for trouble"],"pinyin":["zhao3 ma2 fan5"],"word":"找麻煩"},{"definition":["to gesticulate\/to point out\/to point the finger of blame"],"pinyin":["zhi3 zhi3 dian3 dian3"],"word":"指指點點"},{"definition":["to turn a blind eye"],"pinyin":["zheng1 yi1 zhi1 yan3 bi4 yi1 zhi1 yan3"],"word":"睜一隻眼閉一隻眼"},{"definition":["noisy\/raucous\/to shout and scream"],"pinyin":["chao3 nao4"],"word":"吵鬧"},{"definition":["to spend effort\/to take trouble\/May I trouble you to...? (as part of polite request)\/Please would you mind...?"],"pinyin":["fei4 shen2"],"word":"費神"},{"definition":["unpleasant talk\/malicious words"],"pinyin":["huai4 hua4"],"word":"壞話"},{"definition":["to obstinately persist in going about things the wrong way (idiom)"],"pinyin":["zhi2 mi2 bu4 wu4"],"word":"執迷不悟"},{"definition":["to only want to have a good time\/to just want to have fun, and to shy away from self-discipline"],"pinyin":["tan1 wan2"],"word":"貪玩"},{"definition":["to tease a woman by pretending to be displeased with her\/to flirt with a member of the opposite sex\/to banter flirtatiously"],"pinyin":["da3 qing2 ma4 qiao4"],"word":"打情罵俏"},{"definition":["to think for oneself and act accordingly (idiom); to act on one's own initiative"],"pinyin":["zi4 zuo4 zhu3 zhang1"],"word":"自作主張"},{"definition":["to seethe\/to sulk\/to be pissed off (vulgar)"],"pinyin":["sheng1 men4 qi4"],"word":"生悶氣"},{"definition":["variant of 小題大做|小题大做[xiao3 ti2 da4 zuo4]"],"pinyin":["xiao3 ti2 da4 zuo4"],"word":"小題大作"},{"definition":["to make a fuss about nothing (idiom)"],"pinyin":["da4 jing1 xiao3 guai4"],"word":"大驚小怪"}]}