{"definition":["liposome (bilayer lipid vesicle)"],"pinyin":["zhi1 zhi4 ti3"],"simplified":["脂质体"],"rank":59354.0,"normalized_rank":0.8304394666517426,"fraction":4.6128930088370563e-8,"cumulative_fraction":0.9997866093211396,"word":"脂質體","characters":[{"definition":["fat\/rouge (cosmetics)\/resin"],"pinyin":["zhi1"],"word":"脂"},{"definition":["character\/nature\/quality\/plain\/to pawn\/pledge\/hostage\/to question\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"質"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[],"sentences":[{"english":"The release characteristics and anti-tumor activities of CCNU-TSL in vitro were investigated.","chinese":"並考察脂質體的體外釋藥特性和體外抗腫瘤活性。"},{"english":"The release rate of lansoprazole from liposomes was also tested.","chinese":"採用透析法考察脂質體的釋放規律。"},{"english":"High pressure extruding action has disadvantage on the encapsulation efficiency.","chinese":"高壓擠壓工藝不利於得到較高包封率的熊果苷脂質體。"},{"english":"OBJECTIVE To estimate drug penetration through skin using liposome electrokinetic chromatography.","chinese":"目的採用脂質體電動色譜法對藥物透皮吸收進行評估。"},{"english":"Objective To introduce the progress of liposome entrapped cyclodextrin complex delivery systems.","chinese":"目的介紹環糊精包合物脂質體給藥系統的研究進展。"},{"english":"Amphotericin B liposome and itraconazole are effective in treating penicilliosis marneffei.","chinese":"兩性黴素B脂質體及伊曲康唑治療有效。"},{"english":"Objective To prepare plasmid DNA-containing liposomes using detergent removal method and investigate the properties of liposomes.","chinese":"目的用去污劑透析法制備載基因脂質體並考察其性質。"},{"english":"Objective To determine the encapsulation efficiency and the release rate of baicalin liposome.","chinese":"目的測定黃芩苷脂質體的包封率與滲漏率。"},{"english":"Result A few of the compounds increase liposomal stability by adding ingredients to the velum or coating the liposomes.","chinese":"結果多種化合物不同程度地提高了脂質體的穩定性。"},{"english":"OBJECTIVE To study the antifungal activity of Itraconazole Liposome in vitro.","chinese":"目的研究伊曲康唑脂質體體外抗深部真菌作用。"},{"english":"ObjectiveTo prepare and determine the content and entrapment efficiency of Hydroquinone liposome.","chinese":"目的製備氫醌脂質體並測定含量及包封率。"},{"english":"By using globin lipoplast, the authors established latex agglutination test to determine occult blood.","chinese":"本文應用珠蛋白脂質體建立了膠乳凝集實驗測便潛血。"},{"english":"Liposome SOD from cactus is prepared by reverse-phase evaporation.","chinese":"採用逆相蒸發法制備仙人掌SOD脂質體。"},{"english":"Objective To investigate the release rate and pharmacodynamics in vitro of of vincristine sulfate liposomes.","chinese":"目的考察硫酸長春新鹼脂質體的體外釋放度及其藥效。"},{"english":"OBJECTIVE To prepare and evaluate a liposome hydrogel acemetacin(ACM) .","chinese":"目的研製阿西美辛脂質體凝膠劑，並進行評價。"},{"english":"Antibody can be linked to liposome particles by covalent binding.","chinese":"抗體能通過共價鍵結合在脂質體顆粒上。"}],"related":[]}