{"definition":["prolapse"],"pinyin":["tuo1 chui2"],"simplified":["脱垂"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"脫垂","characters":[{"definition":["to shed\/to take off\/to escape\/to get away from"],"pinyin":["tuo1"],"word":"脫"},{"definition":["to hang (down)\/droop\/dangle\/bend down\/hand down\/bequeath\/nearly\/almost\/to approach"],"pinyin":["chui2"],"word":"垂"}],"containing_words":[],"sentences":[{"english":"This is most likely prolapsed fallopian tube .","chinese":"這個很可能是脫垂的輸卵管。"},{"english":"Objective To study the clinical manifestation of mitral valve prolapse syndrome.","chinese":"目的瞭解二尖瓣脫垂綜合徵的臨牀表現。"},{"english":"It is recommended for women with mild to moderate prolapse.","chinese":"向有輕微到中等脫垂的女性推薦這種產品。"},{"english":"Objective To study clinical presentations and complications of prolapse of gastric mucosa.","chinese":"目的探討胃黏膜脫垂症的臨牀表現及其併發症。"},{"english":"Clinical application of vaginal hysterectomy for non-prolapsed uterus;","chinese":"目的評價兩種治療子宮脫垂的手術方法及效果。"},{"english":"To explore traditional chinese and western medicine treatment methods anorectal prolapse.","chinese":"探討中西醫治療肛管直腸脫垂的方法。"},{"english":"One complication which can arise is a prolapse.","chinese":"可能出現的一種併發症是脫垂。"},{"english":"Objective to investigate the reason and clinical significance of tricuspid valve prolapse in the aged.","chinese":"目的探討老年人三尖瓣脫垂的原因及臨牀意義。"},{"english":"Objective To discuss CT features of patients with spontaneous subconjunctival orbital fat prolapse.","chinese":"目的探討原發性結膜下眶脂肪脫垂的CT表現。"},{"english":"For more on what to do if the cord is prolapsed, see page 565.","chinese":"如果想知道更多關於臍帶脫垂，請看565頁。"},{"english":"Objective To evaluate excision-closed hemorrhoidectomy for severe prolapsed circumferential hemorrhoids by using stapler device.","chinese":"目的探討適合嚴重脫垂環狀痔的手術方法。"},{"english":"Prolapse is a complication that can occur in women.","chinese":"脫垂是一種併發症，可以發生在婦女。"},{"english":"Chronic what drug should sinusitis of stomach of sex of simple table debaucjed and prolapse of gastric mucous membrane take?","chinese":"慢性淺表糜爛性胃竇炎和胃粘膜脫垂該喫什麼藥？"},{"english":"These are known as prolapsed or prolapsing haemorrhoids.","chinese":"這些被稱爲脫垂或脫垂痔瘡。"},{"english":"These are known as prolapsed or prolapsing haemorrhoids.","chinese":"這些被稱爲脫垂或脫垂痔瘡。"},{"english":"Stoma prolapse is a common late complication following loop transverse colostomy.","chinese":"造口脫垂是環狀大腸造口常見的晚期併發症。"}],"related":[]}