{"definition":["to reveal one's talent (idiom)\/to rise above others\/to distinguish oneself"],"pinyin":["tuo1 ying3 er2 chu1"],"simplified":["脱颖而出"],"rank":7708.0,"normalized_rank":0.1078449204594742,"fraction":0.00001268881325971973,"cumulative_fraction":0.90619824321727,"word":"脫穎而出","characters":[{"definition":["to shed\/to take off\/to escape\/to get away from"],"pinyin":["tuo1"],"word":"脫"},{"definition":["head of grain\/husk\/tip\/point\/clever\/gifted\/outstanding"],"pinyin":["ying3"],"word":"穎"},{"definition":["and\/as well as\/and so\/but (not)\/yet (not)\/(indicates causal relation)\/(indicates change of state)\/(indicates contrast)"],"pinyin":["er2"],"word":"而"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"Contract after rent in the countryside la nd circulation practice blooming.","chinese":"反租倒包在農村土地流轉的實踐中脫穎而出。"},{"english":"Chen was selected from nearly 300 professors in the country.","chinese":"陳煒教授從全美近300名教授中脫穎而出獲得此獎。"},{"english":"How can the complexity of today look forward to ad-fan competition does?","chinese":"又如何在今天盼繁複雜的廣告競爭中脫穎而出呢？"},{"english":"We make sure your business stays ahead of the competition and leads the pack.","chinese":"我們確保你的業務在競爭中脫穎而出，並獨佔鰲頭。"},{"english":"It’s that liberal license and the site’s mouthwatering photography that really make Nibbledish special.","chinese":"自由許可和令人垂涎的美圖使得這個網站脫穎而出。"},{"english":"His brilliance raised him above the ruck .","chinese":"他的才華使他從普通人羣中脫穎而出。"},{"english":"Those specifics are what will make your brand stand out from your competition.","chinese":"這些具體的東西纔是在競爭中脫穎而出的法寶。"},{"english":"If your CV has these keywords you could be considered.","chinese":"你的簡歷中有這些關鍵詞，你將會脫穎而出。"},{"english":"A music goes well in the competition, become a propaganda section chief.","chinese":"一樂順利在競聘中脫穎而出，成了宣傳科長。"},{"english":"The granddaddy of all gaming mice is back by popular demand.","chinese":"這個遊戲鼠標的前身從普通需求中脫穎而出。"},{"english":"He'd stand out in any crowd.","chinese":"他會在任何人羣中脫穎而出。"},{"english":"On silk and porcelains, phoenix patterns distinguish themselves from others with their unique styles.","chinese":"在絲織品和瓷器上，鳳紋更以其獨特的風采脫穎而出。"},{"english":"But her admissions essay set her apart from the multitudes of privileged Harvard kids.","chinese":"可是，她的入學作文使她從衆多哈佛學子中脫穎而出。"},{"english":"New surface effects and treatments have emerged from the tie-dye trend.","chinese":"新表面效果與處理從扎染潮流中脫穎而出。"},{"english":"Therefore, the nine fort towns were set up to defend the frontier, where some defending talents showed themselves.","chinese":"明設九鎮防邊，一批戍邊幹才脫穎而出。"},{"english":"Success comes from standing out, not fitting in.","chinese":"成功來自脫穎而出，而非曲意迎合。"}],"related":[{"definition":["special glory\/distinction\/rare honor\/one's laurels\/it's a privilege (to meet you)"],"pinyin":["shu1 rong2"],"word":"殊榮"},{"definition":["numerous"],"pinyin":["zhong4 duo1"],"word":"眾多"},{"definition":["to obtain\/to receive\/to get"],"pinyin":["huo4 de2"],"word":"獲得"},{"definition":["to get past the qualifying round\/to make it to the finals"],"pinyin":["ru4 wei2"],"word":"入圍"},{"definition":["to compete\/to take part in a competition"],"pinyin":["can1 sai4"],"word":"參賽"},{"definition":["to win an award"],"pinyin":["huo4 jiang3"],"word":"獲獎"},{"definition":["peak\/apex\/world best\/number one\/finest (competitors)\/top (figures in a certain field)"],"pinyin":["ding3 jian1"],"word":"頂尖"},{"definition":["to pick out\/to select\/to elect"],"pinyin":["xuan3 chu1"],"word":"選出"},{"definition":["award\/prize\/CL:項|项[xiang4]"],"pinyin":["jiang3 xiang4"],"word":"獎項"},{"definition":["exceptional\/outstandingly good"],"pinyin":["you1 yi4"],"word":"優異"},{"definition":["to seize\/to take away forcibly\/to wrest control of\/to compete or strive for\/to force one's way through\/to leave out\/to lose"],"pinyin":["duo2"],"word":"奪"},{"definition":["to compete\/competition"],"pinyin":["jing4 zheng1"],"word":"競爭"},{"definition":["to select on the basis of a vote or consensus"],"pinyin":["ping2 xuan3"],"word":"評選"},{"definition":["be honored with"],"pinyin":["rong2 huo4"],"word":"榮獲"},{"definition":["to select the best"],"pinyin":["xuan3 ba2"],"word":"選拔"},{"definition":["to appraise\/to evaluate\/to judge"],"pinyin":["ping2 shen3"],"word":"評審"}]}