{"definition":["threshing machine"],"pinyin":["tuo1 li4 ji1"],"simplified":["脱粒机"],"rank":56025.0,"normalized_rank":0.7838624375638353,"fraction":7.225892529665643e-8,"cumulative_fraction":0.999592012093927,"word":"脫粒機","characters":[{"definition":["to shed\/to take off\/to escape\/to get away from"],"pinyin":["tuo1"],"word":"脫"},{"definition":["grain\/granule\/classifier for small round things (peas, bullets, peanuts, pills, grains etc)"],"pinyin":["li4"],"word":"粒"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[],"sentences":[{"english":"Why? Because people don't want another Thresher.","chinese":"爲什麼？由於人們不想要另一臺脫粒機。"},{"english":"The paper introduces the manufacture of a new type of corn thresher.","chinese":"介紹了一種新型甜玉米脫粒機的研製。"},{"english":"The utility model relates to a multifunctional thresher which belongs to an implement working on fields in agricultural machinery.","chinese":"多功能脫粒機屬於農業機械中的場上作業機具。"},{"english":"So you've got corn shellers.","chinese":"因此你能買到玉米脫粒機。"},{"english":"He came to the threshers.","chinese":"於是穆那查到了脫粒機那裏。"},{"english":"How design that height mass maize sheller is the priority designing that out.","chinese":"如何設計出高質量的玉米脫粒機是設計的重點。"},{"english":"Now, volunteers are designing a pedal-powered grain crusher.","chinese":"現在，志願者們在設計腳踏裝置的稻穀脫粒機。"},{"english":"Before thrashing machines farmers thrashed their wheat by hand.","chinese":"在有脫粒機之前，農民用手打麥脫粒。"},{"english":"The utility model relates to a holding-type rice thresher which belongs to a working implement on fields in agricultural machinery.","chinese":"夾持式水稻脫粒機屬於農業機械中的場上作業機具。"},{"english":"The thresher has the advantages of higher percentage of threshing and no damage of the corn cobs.","chinese":"本脫粒機不但脫粒率較高，而且玉米芯又不會破損。"}],"related":[]}