{"definition":["to get away\/to escape (from obligations)\/to free oneself\/to disengage"],"pinyin":["tuo1 shen1"],"simplified":["脱身"],"rank":18916.0,"normalized_rank":0.2646593818644803,"fraction":0.0000026762078332598026,"cumulative_fraction":0.972091608996044,"word":"脫身","characters":[{"definition":["to shed\/to take off\/to escape\/to get away from"],"pinyin":["tuo1"],"word":"脫"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"}],"containing_words":[],"sentences":[{"english":"Village work to get to meet with siew, he put away the resolution dove.","chinese":"中村功得以脫身去與蕭船見面，他決議除掉白鴿。"},{"english":"Finally, she wiggled out from under a heavy blanket and out of the machine.","chinese":"最後，她從一張厚重毛毯與機器中擺動脫身。"},{"english":"Fast-money traders are selling as they are stopped out of short-term positions.","chinese":"投機者在拋售，是因爲他們正從短期頭寸脫身。"},{"english":"How can a server get away without formally defining a contract?","chinese":"不正式地定義契約，服務器怎麼可能得以脫身？"},{"english":"Schiller, Goethe only in the face, only feel the need to escape out.","chinese":"席勒，也只有在歌德面前，才覺得有必要脫身而出。"},{"english":"You just can't get away without mastering specific business skills.","chinese":"你在沒有掌握具體的業務技能時是無法脫身的。"},{"english":"In other time it is no apology at all if Japan can get away.","chinese":"而在其他時間，如果日本能脫身，道歉連門都沒有。"},{"english":"When the dog shakes, centripetal forces pull the water away.","chinese":"狗一抖動，向心力就使水脫身而出。"},{"english":"The rules portray 18th century combat in a detailed manner without bogging down the player.","chinese":"規則塑造18世紀的作戰中詳細地脫身下來播放。"},{"english":"He fumbles for a way out.","chinese":"他在找辦法脫身。"},{"english":"Zhu himself gets tangled in a love dilemma.","chinese":"朱孝廉自己也陷入了愛情的困境，難以脫身。"},{"english":"And Chrysler is on the verge of exiting from its bankruptcy in record time.","chinese":"還有，克萊斯勒快要從破產中快速的脫身而出了。"},{"english":"And never get out to let the rugh in surrey waited her a card at night.","chinese":"而無法脫身的盧伊薩只好讓卡白白等了她一個晚上。"},{"english":"Take your attention into present, and immediately the past no longer has that power over you.","chinese":"將你的注意力聚焦於現在，倏然你即從過去脫身開去。"},{"english":"I first took up walking as a means of escape.","chinese":"我最初開始散步是作爲一種脫身之計。"},{"english":"He had no chance to get away.","chinese":"他沒有脫身機會。"}],"related":[{"definition":["the gains do not make up for the losses (idiom)"],"pinyin":["de2 bu4 chang2 shi1"],"word":"得不償失"},{"definition":["lit. to rein in the horse at the edge of the precipice (idiom)\/fig. to act in the nick of time"],"pinyin":["xuan2 ya2 le4 ma3"],"word":"懸崖勒馬"},{"definition":["to save or redeem (a situation)\/to mediate\/to intercede"],"pinyin":["zhuan3 huan2"],"word":"轉圜"},{"definition":["no strategy left to try (idiom); at one's wit's end\/at the end of one's tether\/powerless"],"pinyin":["wu2 ji4 ke3 shi1"],"word":"無計可施"},{"definition":["no room to advance or to retreat (idiom); without any way out of a dilemma\/trapped\/in an impossible situation"],"pinyin":["jin4 tui4 liang3 nan2"],"word":"進退兩難"},{"definition":["to cross the sea by a trick (idiom)\/to achieve one's aim by underhanded means"],"pinyin":["man2 tian1 guo4 hai3"],"word":"瞞天過海"},{"definition":["to escape (danger)\/to rescue\/to come out alive"],"pinyin":["tuo1 xian3"],"word":"脫險"},{"definition":["to sound out the difficulties and retreat to avoid defeat (idiom); fig. to back out of an awkward situation\/to get out on finding out what it's really like"],"pinyin":["zhi1 nan2 er2 tui4"],"word":"知難而退"},{"definition":["to oppose each other with equal harshness (idiom); tit for tat\/measure for measure"],"pinyin":["zhen1 feng1 xiang1 dui4"],"word":"針鋒相對"},{"definition":["to turn a blind eye to"],"pinyin":["shi4 ruo4 wu2 du3"],"word":"視若無睹"},{"definition":["to be drowned (figurative and literal)"],"pinyin":["mie4 ding3"],"word":"滅頂"},{"definition":["to console"],"pinyin":["quan4 wei4"],"word":"勸慰"},{"definition":["to take a risk out of desperation (idiom)"],"pinyin":["ting3 er2 zou3 xian3"],"word":"鋌而走險"},{"definition":["resolute\/definitive\/categorically\/absolutely"],"pinyin":["duan4 ran2"],"word":"斷然"},{"definition":["penniless (idiom)"],"pinyin":["shen1 wu2 fen1 wen2"],"word":"身無分文"},{"definition":["to advance gradually and entrench oneself at every step\/to consolidate at every step"],"pinyin":["bu4 bu4 wei2 ying2"],"word":"步步為營"}]}