{"definition":["renal pelvis (medicine)"],"pinyin":["shen4 yu2"],"simplified":["肾盂"],"rank":58692.0,"normalized_rank":0.8211772277643306,"fraction":5.065423652109046e-8,"cumulative_fraction":0.9997546270828715,"word":"腎盂","characters":[{"definition":["kidney"],"pinyin":["shen4"],"word":"腎"},{"definition":["basin\/wide-mouthed jar or pot"],"pinyin":["yu2"],"word":"盂"}],"containing_words":[{"definition":["pyelitis (medicine)"],"pinyin":["shen4 yu2 yan2"],"word":"腎盂炎"}],"sentences":[{"english":"Objective To evaluate the treatment of cooperative care of patients with IVP.","chinese":"目的探討靜脈腎盂造影的護理配合。"},{"english":"Methods The pelvis pressure was reduced through urine drainage from catheter under cystoscope.","chinese":"方法通過膀胱鏡輸尿管插管引流尿液使腎盂壓力降低。"},{"english":"Learn the diagnosis and management of urinary tract infections, including pyelonephritis and prostitutes .","chinese":"學習如何診斷及處道感染，包括腎盂炎及前腺炎。"},{"english":"On retrograde pyelography the catheter is curved as\"S\"shape.","chinese":"逆行腎盂造影時輸尿管導管彎曲，呈“S”形。"},{"english":"He thought, for acute pyelitis, the beginning was a new affection syndrome and aincubative pathogen syndrome secondly.","chinese":"急性腎盂炎初呈新感之症狀，繼現伏邪之體徵。"},{"english":"Pyelonephritis with chronic patient relatively much see.","chinese":"腎盂腎炎以慢性患者較爲多見。"},{"english":"A large staghorn calculus is seen obstructing the renal peli-calyceal system.","chinese":"圖中可見巨大的鹿角樣結石嵌頓於腎盂腎盞系統。"},{"english":"And urinary infection common in the acute pyelonephritis.","chinese":"而上尿路感染常見的是急性腎盂腎炎。"},{"english":"Those with moderate and severe pyelectasis are likely to have abnormalities of urinary or other systems.","chinese":"中重度腎盂擴張者，易合併泌尿系或其他器官異常。"},{"english":"Be in charge of like occurrence leucocyte in ④ make water model, conduce to the diagnosis to pyelonephritis.","chinese":"尿中如出現白細胞管型，有助於對腎盂腎炎的診斷。"},{"english":"Objective To study the application of native pelvis and ureter in kidney transplantation.","chinese":"目的報告自體腎盂輸尿管在腎移植術中的應用。"},{"english":"Xanthogranulomatous pyelonephritis and staghorn calculus are rare in children.","chinese":"黃色肉芽腫腎盂腎炎和鹿角石皆罕見於兒童。"},{"english":"In the intrarenal pelvis, caliceal dilatation and renal parenchymal damage are maximal.","chinese":"而若爲腎內腎盂，腎盞擴張和腎實質損害均嚴重。"},{"english":"She had ever received nephrectomy on the left side kidney due to xanthogranulomatous pyelonephritis.","chinese":"該患者曾因左側黃斑肉芽腎盂炎接受左腎切除術。"},{"english":"Objective To present the clinical and pathological features of carcinosarcoma of ureter and renal pelvis.","chinese":"目的總結腎盂輸尿管癌肉瘤的臨牀及病理特點。"},{"english":"The suffering kidney urine were from the cystoscope, intraureteral cannula and pyelostomy.","chinese":"患腎尿來自膀胱鏡或術中輸尿管插管及腎盂穿刺造瘻。"}],"related":[]}