{"definition":["stroke\/cerebral hemorrhage"],"pinyin":["nao3 cu4 zhong4"],"simplified":["脑卒中"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"腦卒中","characters":[{"definition":["brain\/mind\/head\/essence"],"pinyin":["nao3"],"word":"腦"},{"definition":["soldier\/servant\/to finish\/to die\/finally\/at last\/pawn in Chinese chess","variant of 猝[cu4]"],"pinyin":["cu4","zu2"],"word":"卒"},{"definition":["China\/Chinese\/surname Zhong","to hit (the mark)\/to be hit by\/to suffer\/to win (a prize, a lottery)","within\/among\/in\/middle\/center\/while (doing sth)\/during\/(dialect) OK\/all right"],"pinyin":["Zhong1","zhong1","zhong4"],"word":"中"}],"containing_words":[],"sentences":[{"english":"To summarize the effects of rehabilitation nursing for 112 stroke patients with dysphagia.","chinese":"總結了112例腦卒中患者吞嚥障礙的康復護理體會。"},{"english":"Objective To explore the relationship between post-stroke depression and social sustain and coping style with an aim to guide the prospective psychological intervention.","chinese":"目的探討腦卒中後抑鬱與社會支持及應對方式的關係。"},{"english":"Objective: To probe into the effect of emotion nursing to improve post-stroke depression for cerebral apoplexy patients.","chinese":"探討情志護理對改善腦卒中後病人的抑鬱狀態效果。"},{"english":"ConclusionsImproving communication methods can decrease the depressive level of the patients with stroke dysphasia.","chinese":"結論改善溝通可以降低腦卒中語言障礙患者抑鬱程度。"},{"english":"To observe the effects of needling combined with function training on the balance function of stroke patients.","chinese":"探討針刺配合功能訓練對腦卒中患者平衡功能的影響。"},{"english":"Objective To appraise the clinic effect of mini-invasive drainage on hemorrhages cerebral apoplexy with herniation.","chinese":"探討微創穿刺引流對出血性腦卒中並腦疝的治療價值。"},{"english":"Objective To observe the influence of Zhenweifang on the muscle tension in flaccid paralysis period and prognosis of stroke.","chinese":"目的觀察振痿方對腦卒中軟癱期肌張力及預後的影響。"},{"english":"Objective To explore self-care agency and its relating factors among patients with stroke.","chinese":"目的研究腦卒中病人自我護理能力及其影響因素。"},{"english":"Objective To probe the clinical features and the onset mechanism of epilepsy after stroke.","chinese":"目的探討腦卒中後癲癎的臨牀特點及發病機制。"},{"english":"Objective To analyze the function of Shoulder Belt Protector in preventing the dislocation of shoulder for brain apoplexy patients.","chinese":"目的探討護肩帶對腦卒中患者肩關節脫位的預防作用。"},{"english":"Objective To observe the clinical curative effects of Puerarin combination with Shuxuening injection in the treatment of acute ischemic stroke.","chinese":"目的觀察舒血寧聯合葛根素急性缺血性腦卒中的療效。"},{"english":"Objective: To observe the recovery effect of early intervention on dyskinesia after acute cerebral apoplexy.","chinese":"目的觀察急性腦卒中後肢體運動障礙的早期康復效果。"},{"english":"Objective To explore the effect of swallowing training on swallowing disorders following stroke.","chinese":"目的探討改善吞嚥動作訓練治療腦卒中吞嚥障礙療效。"},{"english":"Objective Analysis of psychological intervention on the clinical effects of post-stroke depression.","chinese":"目的總結分析心理干預對腦卒中後抑鬱的臨牀效果。"},{"english":"ObjectiveTo observe the effect of multidisciplinary rehabilitation on prognosis of patients with stroke hemiplegia.","chinese":"目的觀察綜合康復治療對腦卒中偏癱患者預後的影響。"},{"english":"Post-stroke depression is one of the common complications of Cerebrovascular Disease.","chinese":"腦卒中後抑鬱症是腦血管病的常見併發症之一。"}],"related":[{"definition":["frequently re-occurring disease"],"pinyin":["duo1 fa1 bing4"],"word":"多發病"},{"definition":["cerebral hemorrhage"],"pinyin":["nao3 chu1 xue4"],"word":"腦出血"},{"definition":["cerebral stroke"],"pinyin":["nao3 zhong4 feng1"],"word":"腦中風"},{"definition":["angina"],"pinyin":["xin1 jiao3 tong4"],"word":"心絞痛"},{"definition":["cerebrovascular disease"],"pinyin":["nao3 xue4 guan3 ji2 bing4"],"word":"腦血管疾病"},{"definition":["symptom (of a disease)"],"pinyin":["bing4 zhuang4"],"word":"病狀"},{"definition":["cerebral infarction"],"pinyin":["nao3 geng3 se4"],"word":"腦梗塞"},{"definition":["coronary artery"],"pinyin":["guan1 zhuang4 dong4 mai4"],"word":"冠狀動脈"},{"definition":["autoimmune disease"],"pinyin":["zi4 ti3 mian3 yi4 ji2 bing4"],"word":"自體免疫疾病"},{"definition":["encephalitis"],"pinyin":["nao3 yan2"],"word":"腦炎"},{"definition":["meningitis"],"pinyin":["nao3 mo2 yan2"],"word":"腦膜炎"},{"definition":["osteoarthritis"],"pinyin":["gu3 guan1 jie2 yan2"],"word":"骨關節炎"},{"definition":["pulmonary edema"],"pinyin":["fei4 shui3 zhong3"],"word":"肺水腫"},{"definition":["Alzheimer's disease\/senile dementia"],"pinyin":["A1 er3 ci2 hai3 mo4 bing4"],"word":"阿爾茨海默病"},{"definition":["consultation (medical)\/to meet for diagnosis\/(by extension) consultation of different specialists"],"pinyin":["hui4 zhen3"],"word":"會診"},{"definition":["tuberculosis"],"pinyin":["jie2 he2 bing4"],"word":"結核病"}]}