{"definition":["ventricles of the brain"],"pinyin":["nao3 shi4"],"simplified":["脑室"],"rank":55221.0,"normalized_rank":0.7726134344437758,"fraction":7.94118290128911e-8,"cumulative_fraction":0.9995311125636392,"word":"腦室","characters":[{"definition":["brain\/mind\/head\/essence"],"pinyin":["nao3"],"word":"腦"},{"definition":["room\/work unit\/grave\/scabbard\/family or clan\/one of the 28 constellations of Chinese astronomy","surname Shi"],"pinyin":["Shi4","shi4"],"word":"室"}],"containing_words":[],"sentences":[{"english":"Objective To study the clinical features and treatment of traumatic cerebral intraventricular hemorrhage(TIVH).","chinese":"目的探討外傷性腦室出血的臨牀特點和治療方法。"},{"english":"CNS infections may be associated with brain atrophy, with resultant microcephaly and ventriculomegaly.","chinese":"有關，伴有小頭畸形和腦室擴大的後果。"},{"english":"There are some comput rooms on the second floor.","chinese":"這兒有許多電腦室在三樓。"},{"english":"The patient underwent external decompression and external ventricular drainage.","chinese":"患者接受了外部減壓和腦室外引流。"},{"english":"Julie finds Ted working in the computer lab.","chinese":"朱莉發現特德在電腦室裏工作。"},{"english":"Objective To discuss the diagnosis and treatment of microneurosurgery for meningiomas of the lateral ventricle.","chinese":"目的探討側腦室腦膜瘤的診斷及其顯微外科手術治療。"},{"english":"This afternoon I went to the computer room, the teacher also in, I found a seat.","chinese":"我下午去了電腦室，老師也在，我找了一個座位坐下。"},{"english":"The robot and I went into the computer room but Hee -Haw stayed outside.","chinese":"機器人和我進了電腦室，但“嘻嗬”留在外面。"},{"english":"Infectious causes of hydrocephalus may also result in narrowing of the mesencephalic aqueduct;","chinese":"造成吸收不良的原因可能是腦室感染引起。"},{"english":"Data centers have their roots in the huge computer rooms of the early ages of the computing industry.","chinese":"數據中心的根源在於巨大的電腦室早期年齡計算行業。"},{"english":"Objective To study the new treatment for hypertensive intraventricular hemorrhage.","chinese":"目的研究高血壓性腦室出血的新療法。"},{"english":"Objective To study the morphological characteristics and distribution of the cells in the subventricular zone(SVZ).","chinese":"目的觀察側腦室腦室下層細胞的形態及分佈。"},{"english":"Objective To study the morphological characteristics and distribution of the cells in the subventricular zone(SVZ).","chinese":"目的觀察側腦室腦室下層細胞的形態及分佈。"},{"english":"Part of multi-angle cells labeled at the bottom of the epithalamic tetra-brain ventricle.","chinese":"下丘腦的四腦室底部標記到部分多角細胞。"},{"english":"To explore the clinical outcome of microsurgery in the treatment of meningioma at the trigone of lateral ventricles.","chinese":"目的探討顯微手術治療側腦室三角區腦膜瘤的療效。"},{"english":"Ventriculography is of great value in locating the tumor.","chinese":"腦室造影對腫瘤定位有很大價值。"}],"related":[]}