{"definition":["back of the head"],"pinyin":["nao3 shao2"],"simplified":["脑勺"],"rank":58741.0,"normalized_rank":0.8218628013375681,"fraction":5.021630364050467e-8,"cumulative_fraction":0.9997570984840941,"word":"腦勺","characters":[{"definition":["brain\/mind\/head\/essence"],"pinyin":["nao3"],"word":"腦"},{"definition":["spoon\/ladle\/CL:把[ba3]\/abbr. for 公勺[gong1 shao2], centiliter (unit of volume)"],"pinyin":["shao2"],"word":"勺"}],"containing_words":[{"definition":["back of the head"],"pinyin":["hou4 nao3 shao2"],"word":"後腦勺"}],"sentences":[{"english":"He still bears the scars on the back of his head.","chinese":"他的後腦勺上依然有着當時留下的傷疤。"},{"english":"He lay back and put his hands behind his head.","chinese":"他躺了下去，用雙手墊着後腦勺。"},{"english":"This can cause lower jaw pains as well as muscle pains in the back of the head.","chinese":"這會引發下頜痛和後腦勺肌肉痛。"},{"english":"Run your fingers through their hair and gently caress the back of the head.","chinese":"你的手指滑過他們的頭髮，溫柔地撫摸後腦勺。"},{"english":"He began shaving an Apple logo into the back of his head.","chinese":"他開始在後腦勺剃出有蘋果標識的髮型。"},{"english":"I think it's in your brain, the back of your head.","chinese":"應該是在大腦中，後腦勺那裏。"},{"english":"It hit the president in the upper right rear of his head, and blood was everywhere.","chinese":"它擊中了總統的後腦勺的右上方，血濺四處。"},{"english":"The back of my head throbbed, as usual, when I remembered that money.","chinese":"我的後腦勺一如往常我想到那些錢般抽痛。"},{"english":"The back of your head keeps getting hit by the toilet seat.","chinese":"衛生間裏的馬桶蓋打到你的後腦勺了。"},{"english":"Twenty shaved heads.","chinese":"二十個剃的光光的後腦勺。"},{"english":"Cup some water in your hand and pretend to sneeze on the back of someone’s head.","chinese":"舀點水在手心裏，對着別人的後腦勺假裝打噴嚏。"},{"english":"Was rich to greatly applaud to clap her behind portion of skull, little Cu eyebrow, presently resume original variety.","chinese":"富大拍了拍她的後腦勺，微微蹙眉，很快就恢復原樣。"},{"english":"Went home and put a bullet through his head.","chinese":"回到家中，用一顆子彈射穿了自己的腦勺。"},{"english":"They must have another hollow-point ready for the back of your head.","chinese":"他們肯定也給你的後腦勺準備了另一個子彈孔。"}],"related":[]}