{"definition":["brain damage"],"pinyin":["nao3 sun3 shang1"],"simplified":["脑损伤"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"腦損傷","characters":[{"definition":["brain\/mind\/head\/essence"],"pinyin":["nao3"],"word":"腦"},{"definition":["to decrease\/to lose\/to damage\/to harm\/(coll.) to speak sarcastically\/to deride\/caustic\/mean\/one of the 64 hexagrams of the Book of Changes (䷨)"],"pinyin":["sun3"],"word":"損"},{"definition":["to injure\/injury\/wound"],"pinyin":["shang1"],"word":"傷"}],"containing_words":[{"definition":["thalamic lesions"],"pinyin":["qiu1 nao3 sun3 shang1"],"word":"丘腦損傷"}],"sentences":[{"english":"Is it true that lack of iodine really causes brain damage?","chinese":"缺碘是否真的會造成腦損傷？"},{"english":"Patricia Neal raised money for children and adults who had suffered brain injuries.","chinese":"帕特里夏尼爾誰提出的兒童和成年人遭受腦損傷的錢。"},{"english":"RESULTS Ischemia enhanced cell proliferation in DG of adult rats.","chinese":"結果缺血性腦損傷可促進成年大鼠齒狀回的細胞增殖。"},{"english":"Brain injury may lead to neuronal cell necrosis.","chinese":"腦損傷可導致神經細胞壞死。"},{"english":"Objective To observe the electric physiologic changes in newborn piglets with HIBD.","chinese":"目的觀察缺氧缺血性腦損傷新生豬腦電生理的變化。"},{"english":"Objective To investigate factors affecting prognosis of patients sustaining mild to moderate brain injury and discuss nursing strategies.","chinese":"目的探討影響輕中度腦損傷患者預後因素及護理對策。"},{"english":"Objective To explore the process of consciousness-regaining and outcome predictors in patients with head injury and coma.","chinese":"目的探討腦損傷昏迷病人有效促醒途徑和預測的指標。"},{"english":"But when consumed, they can cause cancer and brain damage.","chinese":"但是這些金屬會導致癌症及腦損傷。"},{"english":"Brain damage can produce weird shifts in behaviour and experience.","chinese":"腦損傷可以產生在行爲上和感受上很奇怪的變化。"},{"english":"Distortion of balance is often a consequence of traumatic brain injury.","chinese":"平衡失真往往是創傷性腦損傷帶來的結果。"},{"english":"The syndrome is often misdiagnosed as coma and severe brain damage.","chinese":"這種症狀經常被誤診爲昏迷和嚴重腦損傷。"},{"english":"Scientists have been researching on \/ into the causes of brain damage.","chinese":"科學家們一直對腦損傷的起因進行研究。"},{"english":"In 1962 Rick was born with brain damage.","chinese":"一九六二年，瑞克出生時就有腦損傷。"},{"english":"These findings bring hope for self-repair after brain injury.","chinese":"這些研究爲腦損傷後的自身修復帶來了希望。"},{"english":"DDMS can result from cerebral injury in utero or early in life.","chinese":"DDMS可能是源於宮內或剛出生時的腦損傷。"},{"english":"Dan: Oh, I think I have brain damage .","chinese":"哦，我想我撞出腦損傷了。"}],"related":[]}