{"definition":["brain disease\/encephalopathy"],"pinyin":["nao3 bing4"],"simplified":["脑病"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"腦病","characters":[{"definition":["brain\/mind\/head\/essence"],"pinyin":["nao3"],"word":"腦"},{"definition":["illness\/CL:場|场[chang2]\/disease\/to fall ill\/defect"],"pinyin":["bing4"],"word":"病"}],"containing_words":[{"definition":["bovine spongiform encephalopathy, BSE\/mad cow disease"],"pinyin":["niu2 hai3 mian2 zhuang4 nao3 bing4"],"word":"牛海綿狀腦病"},{"definition":["computer virus"],"pinyin":["dian4 nao3 bing4 du2"],"word":"電腦病毒"}],"sentences":[{"english":"Objective To investigate the pathological characteristics of heroin spongiform leukoencephalopathy.","chinese":"目的瞭解海洛因海綿狀白質腦病的病理特徵。"},{"english":"Another type of self-replicating computer program.","chinese":"另一種自我複製類型的電腦病毒。"},{"english":"Objective To assess the curative effect of hepatic cerebropathy with naloxone.","chinese":"目的評價納絡酮治療肝硬化肝性腦病的療效。"},{"english":"The history of a patient who suffered encephalopathy and coma is presented.","chinese":"歷史上誰的病人遭受性腦病和昏迷介紹。"},{"english":"In neonatal stadium, 1 patient was found with hypoxia-ischemic encephalopathy, and 4 with cerebral hemorrhage.","chinese":"新生兒期發現缺血缺氧性腦病1例，顱內出血4例。"},{"english":"Therefore, the correlational researches may have significant effects on the prevention and cure of diabetic neuropathies in brain.","chinese":"此方面的研究對於糖尿病腦病的防治具有重要意義。"},{"english":"Number two: study of pathogenesis of demyelinating encephalopathy from dogs with spontaneous canine distemper.","chinese":"二是自發性犬瘟熱脫髓性腦病發生機理的研究。"},{"english":"Objective To investigate the pathogenetic mechanism of diabetic encephalopathy.","chinese":"目的探討糖尿病腦病的發病機制。"},{"english":"Computer virus, that is.","chinese":"指的是電腦病毒。"},{"english":"Results 20 patients with hepatic coma improved in level of encephalopathy.","chinese":"結果20例治療前伴肝性腦病患者昏迷程度減輕。"},{"english":"Cranial MRI on the symptomatic patient demonstrated bilateral symmetric leukoencephalopathy and multiple small subcortical lacunar infarcts.","chinese":"MRI顯示雙側對稱的白質腦病和多發性腦梗死。"},{"english":"Objective To study the relation between the cirrhosis complicated with hepatic encephalopathy(CCHE) and the activated oxygen.","chinese":"目的探討肝硬化並肝性腦病與活性氧的關係。"},{"english":"Neurocognitive impairment in liver patients is called hepatic encephalopathy.","chinese":"肝硬化患者中的神經認知障礙被稱爲肝性腦病。"},{"english":"Objective To explore the clinical features of tussah pupa encephalopathy.","chinese":"目的探討柞蠶蛹性腦病的臨牀特徵。"},{"english":"Infantile spasm is a severe epileptic encephalopathy that is quite specific to infancy.","chinese":"嬰兒痙攣症是一種好發於嬰兒時期的難治型癇樣腦病。"},{"english":"Encephalopathy describes problems with the workings of the brain.","chinese":"腦病介紹了與大腦的運作問題。"}],"related":[]}