{"definition":["electroencephalogram (EEG)"],"pinyin":["nao3 dian4 tu2"],"simplified":["脑电图"],"rank":44250.0,"normalized_rank":0.619114910525653,"fraction":2.567746456501386e-7,"cumulative_fraction":0.9978340601729492,"word":"腦電圖","characters":[{"definition":["brain\/mind\/head\/essence"],"pinyin":["nao3"],"word":"腦"},{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["diagram\/picture\/drawing\/chart\/map\/CL:張|张[zhang1]\/to plan\/to scheme\/to attempt\/to pursue\/to seek"],"pinyin":["tu2"],"word":"圖"}],"containing_words":[{"definition":["electroencephalogram (EEG)"],"pinyin":["nao3 dian4 tu2 ban3"],"word":"腦電圖版"}],"sentences":[{"english":"Objective To investigate the clinical and electroencephalographic characteristics of automatism.","chinese":"目的分析癲自動症的臨牀和腦電圖特徵。"},{"english":"Electroencephalograms examine shows moderate or severe abnormality.","chinese":"腦電圖檢查可發現中度或高度異常。"},{"english":"To explore the value of electroencephalogram(EEG) after depriving sleep in the diagnosis of epilepsy.","chinese":"目的探討剝奪睡眠腦電圖在小兒癲癇診斷中的價值。"},{"english":"Objective To explore change of sleep electroencephalography in depressions with physical anxiety.","chinese":"目的探討軀體焦慮性抑鬱症病人的睡眠腦電圖改變。"},{"english":"Then, see if those patterns are generalizable — if everyone has similar patterns.","chinese":"之後，看看這些腦電圖是否存在一些共性。"},{"english":"Objective To explore clinical characteristics and changes of electroencephalography (EEG) in children with migraine.","chinese":"目的探討兒童偏頭痛臨牀特點和腦電圖變化。"},{"english":"Aim: To investigate the value of video electroencephalogram in diagnosis of epilepsy.","chinese":"目的探討錄像腦電圖在癔症的鑑別診斷中的作用。"},{"english":"Methods To analyze clinical and electroencephalographic data of 36 BECT patients.","chinese":"方法分析36例BECT患者的臨牀及腦電圖資料。"},{"english":"That fiction, though, is often based on a real technique known as electroencephalography .","chinese":"而這種幻想是建立在現實中的腦電圖技術之上的。"},{"english":"One such clever method is an EEG.","chinese":"其中一個巧妙的方法是腦電圖。"},{"english":"Brain scans and EEGs (Electro-encephalograms or brain wave tracings) are not helpful in working out whether a person has ADHD.","chinese":"腦掃描和腦電圖對多動症確診沒有幫助。"},{"english":"The appearances of abnormal EEG were mainly slow wave and local epileptiform discharge.","chinese":"腦電圖異常表現爲瀰漫性慢波增多和侷限性癇性放電。"},{"english":"Objective To explore the clinical value of electroencephalograph in diagnosis of viral encephalitis.","chinese":"目的探討腦電圖在病毒性腦炎診斷中的作用。"},{"english":"Objective To explore characteristic of sleep electroencephalograph in depressives with and without early awakening .","chinese":"目的探索伴和不伴早醒的抑鬱症患者睡眠腦電圖特徵。"},{"english":"Conclusion EEGs were fundamental criterion in diagnosis of seizure .","chinese":"結論腦電圖是診斷癲癇的根本依據。"},{"english":"After the Lactone Coriariainjections, the EEG of all the rabbits showed the characteristics of theepilepsy type.","chinese":"注射馬桑內酯後，家兔腦電圖均出現癇性放電。"}],"related":[]}