{"definition":["oncology\/study of tumors"],"pinyin":["zhong3 liu2 xue2"],"simplified":["肿瘤学"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"腫瘤學","characters":[{"definition":["to swell\/swelling\/swollen"],"pinyin":["zhong3"],"word":"腫"},{"definition":["tumor"],"pinyin":["liu2"],"word":"瘤"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"View the future, TCM Oncology is facing the unprecedented opportunity and the challenge.","chinese":"展望未來，中醫腫瘤學面臨着前所未有的機遇和挑戰。"},{"english":"Chinese Society of Clinical Oncology, Chinese Anti-Cancer Association.","chinese":"中國抗癌協會臨牀腫瘤學協作專業委員會。"},{"english":"All pelvic exenteration surgery was performed by the same gynecological oncologist.","chinese":"由同樣的婦科腫瘤學專家施行盆腔清掃術。"},{"english":"He was one of the founders of oncological research in china.","chinese":"他是中國腫瘤學研究的創始人。"},{"english":"The oncologist invented a new kind of interferon to prevent cancer.","chinese":"那位腫瘤學家發明了一種可以預防癌症的干擾素。"},{"english":"The oncologic benefit was primarily in patients with organ confined disease.","chinese":"腫瘤學的好處主要是器官侷限性疾病的患者。"},{"english":"Others become oncologists and treat cancer patients.","chinese":"其他的變成了腫瘤學醫師和治療癌患病人。"},{"english":"The report appears in the September issue of The Lancet Oncology.","chinese":"報告刊登在柳葉刀腫瘤學9月號上。"},{"english":"The lymph node mapping(LNM)is a new hot spot of oncology and surgery in recent years.","chinese":"淋巴結顯像技術是腫瘤學和外科學研究的新熱點。"},{"english":"In China, curriculum arrangement and teaching of oncology program at medical colleges and universities lag behind those of other majors.","chinese":"在我國，醫學院校腫瘤學課程設置及教學相對滯後。"},{"english":"The development of oncology is always following the anti-tumor new-medicine research and the clinical trial.","chinese":"腫瘤學的發展一直伴隨抗腫瘤新藥的研發與臨牀試驗。"},{"english":"This paper is focusing on the status, progression, review, and the prospect of TCM Oncology.","chinese":"本文就中醫腫瘤學的發展歷程進行一個回顧與展望。"},{"english":"Maura Gillison, a professor of oncology and epidemiology, said in a telephone interview.","chinese":"他是一名腫瘤學和流行病學的教授。"}],"related":[]}