{"definition":["footstool"],"pinyin":["jiao3 deng4"],"simplified":["脚凳"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"腳凳","characters":[{"definition":["foot\/leg (of an animal or an object)\/base (of an object)\/CL:雙|双[shuang1],隻|只[zhi1]\/classifier for kicks","variant of 角[jue2]\/role"],"pinyin":["jiao3","jue2"],"word":"腳"},{"definition":["bench\/stool"],"pinyin":["deng4"],"word":"凳"}],"containing_words":[],"sentences":[{"english":"He didn’t get off his stool and bang it on the floor.","chinese":"他並沒有離開高腳凳並用其敲擊地面。"},{"english":"MAN on a barstool SLAPS the WOMAN he's with.","chinese":"一個坐在高腳凳上的男人打了和他一起的女人一巴掌。"},{"english":"Your feet should be flat on the floor or supported by a footrest.","chinese":"你的腳應該平放在地板上或用一個腳凳支持。"},{"english":"43until I make your enemies a footstool for your feet.","chinese":"等我使你仇敵作你的腳凳。"},{"english":"Let us go into his tent; let us give worship at his feet.","chinese":"我們要進他的居所，在他腳凳前下拜。"},{"english":"And he used the extinct volcano as a foot-stool.","chinese":"他曾經使用那座死火山當做腳凳。"},{"english":"Here is thy footstool and there rest thy feet where live the poorest, and lowliest, and lost.","chinese":"您在最貧最賤最失所的人羣中歇足，這是您的腳凳。"},{"english":"Until I make thy foes thy footstool.","chinese":"等我使你仇敵作你的腳凳。"},{"english":"Till I make thine enemies thy footstool.","chinese":"等我使你的仇敵作你的腳凳。"},{"english":"If necessary, prop up your feet with a footstool or other support.","chinese":"如有必要，用腳凳或其它支持物墊起雙腳。"},{"english":"Heb. 10:13 Henceforth waiting until His enemies are made the footstool for His feet.","chinese":"來十13從此等候他的仇敵，放在他的腳下作腳凳。"},{"english":"From henceforth expecting till his enemies be made his footstool.","chinese":"從此等候他仇敵成了他的腳凳。"},{"english":"We were led to a room lined wtih easy chairs and foot stools.","chinese":"我們被領到一個房間裏，裏面排着舒服的椅子和腳凳。"},{"english":"The ark then is said to serve as his footstool.","chinese":"方舟則是作爲他的腳凳。"},{"english":"Cathy carried a footstool and her cup to his side.","chinese":"凱蒂搬來一個腳凳，拿着自己的茶杯，走到他身邊去。"},{"english":"The dining room opens into the kitchen and has an island with barstool seating.","chinese":"餐廳通向廚房和酒吧高腳凳座位一個島。"}],"related":[]}