{"definition":["intestine\/gut"],"pinyin":["chang2 guan3"],"simplified":["肠管"],"rank":49497.0,"normalized_rank":0.6925272480517118,"fraction":1.5225466481699526e-7,"cumulative_fraction":0.9988855523468798,"word":"腸管","characters":[{"definition":["intestines"],"pinyin":["chang2"],"word":"腸"},{"definition":["surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["Guan3","guan3"],"word":"管"}],"containing_words":[],"sentences":[{"english":"Bowel or omentum may herniate alongside the drain .","chinese":"腸管或網膜可能沿引流物疝出。"},{"english":"Bowel may herniate alongside a drain, with resulting obstruction.","chinese":"腸管可能沿著引流物疝出，導致梗阻。"},{"english":"Objective:To probe into application of helical nasointestinal tube for patients with carcinoma of gastric cardia and nursing care of them.","chinese":"探討螺旋型鼻腸管在胃賁門癌病人護理中的應用效果。"},{"english":"Enterectomy is necessary if it has a part of intestine tube necrosis.","chinese":"如果有腸管壞死必要時行腸管部分切除術。"},{"english":"Enterectomy is necessary if it has a part of intestine tube necrosis.","chinese":"如果有腸管壞死必要時行腸管部分切除術。"},{"english":"The gross appearance of the bowel may be normal from the serosal surface.","chinese":"腸管肉眼所見，漿膜面可以正常。"},{"english":"B CT scan of the lower abdomen shows beaking and collapsed bowel loops at the retrocecal recess.","chinese":"下腹部CT掃描顯示盲腸後隱窩處腸管塌陷呈鳥嘴徵。"},{"english":"Peony and licorice decoction had inhibiting effect on the rabbit's intestine invito.","chinese":"芍藥甘草湯對家兔離體腸管呈抑制作用。"},{"english":"Injury to organs near the ovaries, such as the bladder, bowel, or blood vessels.","chinese":"刺傷卵巢旁邊的器官，比如膀胱，腸管或血管。"},{"english":"The gut will pass through the defect into the chest.","chinese":"腸管可經過缺損進入胸腔。"},{"english":"It can even grow on your bladder or intestines.","chinese":"甚至能在膀胱和腸管生長。"},{"english":"Bowel or omentum may herniate alongside the drain.","chinese":"腸管或網膜可能沿引流物疝出。"}],"related":[]}