{"definition":["to join with glue"],"pinyin":["jiao1 he2"],"simplified":["胶合"],"rank":45099.0,"normalized_rank":0.6309935220292978,"fraction":2.358998450088824e-7,"cumulative_fraction":0.9980432147270476,"word":"膠合","characters":[{"definition":["to glue\/glue\/gum\/rubber"],"pinyin":["jiao1"],"word":"膠"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"}],"containing_words":[{"definition":["plywood"],"pinyin":["jiao1 he2 ban3"],"word":"膠合板"}],"sentences":[{"english":"First, I cut an access hole in the Bridge Deck and glued the Wheelhouse to it.","chinese":"首先，我削減一進入洞，在橋面和膠合板舵手給它。"},{"english":"They could do that using plywood and a seat out of an existing airplane.","chinese":"他們可能用膠合板和其它現有飛機的座椅進行試驗。"},{"english":"This instrument can be used for centering during edging and cement, and testing centering error of lenses.","chinese":"該儀器可用於磨邊或膠合定中心和檢驗透鏡中心誤差。"},{"english":"Birch plywood construction.","chinese":"樺木膠合板結構。"},{"english":"Glue the horn strips to core.","chinese":"膠合墊鐵小條挖出果核。"},{"english":"On the assertion of producer, gluing they are resistant to abrasion and action of water.","chinese":"就斷言生產者，膠合他們是抗磨損和行動的水。"},{"english":"The inside walls were all finished with lauan plywood and painted white partly.","chinese":"內牆都採用柳桉木膠合板，部分牆體被刷成了白色。"},{"english":"Yet underneath the tough veneer lies a strong current of social optimism.","chinese":"在堅硬的膠合板下面躺着一個龐大的社會樂觀性。"},{"english":"No tablet coatings, diluents, binders, granulators, disintegrators or colors.","chinese":"無片劑外層，稀釋劑，膠合物，成粒子和分解素。"},{"english":"When you have finished weaving the mat, glue the ends of the strips on the first paper.","chinese":"當您完成編織蓆子時，膠合小條的末端在第一張紙的。"},{"english":"Black painted Birch plywood enclosure.","chinese":"樺木膠合板箱體，黑色噴漆。"},{"english":"Glue them together and wrap with plastic wrap, clamp tightly and let dry.","chinese":"一起膠合他們和套與塑料套，緊緊夾緊並且讓乾燥。"},{"english":"We are a company that produces plywood and have right of self-run export…","chinese":"我公司是一家擁有自營出口權的生產膠合板的企業。"},{"english":"What’s wrong with plywood?","chinese":"膠合板有什麼問題呢？"},{"english":"A second phase generates the glue code and the system configuration code.","chinese":"第二個階段是生成膠合代碼以及系統配置代碼。"},{"english":"Poplar(Populus deltoides) veneers were used to make plywood for concrete forms.","chinese":"採用浸膠玻璃纖維布強化方法制造楊木膠合板模板。"}],"related":[]}