{"definition":["offset printing"],"pinyin":["jiao1 yin4"],"simplified":["胶印"],"rank":41563.0,"normalized_rank":0.5815202943768976,"fraction":3.312232353497241e-7,"cumulative_fraction":0.9970468058968098,"word":"膠印","characters":[{"definition":["to glue\/glue\/gum\/rubber"],"pinyin":["jiao1"],"word":"膠"},{"definition":["surname Yin\/abbr. for 印度[Yin4 du4]","to print\/to mark\/to engrave\/a seal\/a print\/a stamp\/a mark\/a trace\/image"],"pinyin":["Yin4","yin4"],"word":"印"}],"containing_words":[],"sentences":[{"english":"It is achieved that demonstrating phenomenon is obvious if the device is working at slow-speed.","chinese":"膠印機示教裝置在低速運行時，演示現象明顯。"},{"english":"The compression performance of offset rubber sheet was related to the ink transfer closely.","chinese":"膠印橡皮布的壓縮性與油墨轉移緊密相關。"},{"english":"The utility model is applied to the rubber imprinter.","chinese":"本實用新型用於膠印機。"},{"english":"Thus it is the reasonable basis to put forward extending the waterless lithography printing in China.","chinese":"從而爲在我國推廣普及無水膠印提供了合理的依據。"},{"english":"This paper provides a systematical research about the web-offset -printing machines.","chinese":"本文對捲筒紙膠印機進行了系統的研究。"},{"english":"High-definition color with imported embroidering diagram Hyde treasure four-color offset printing machine printing.","chinese":"高清晰彩色繡圖用進口海德寶四色膠印機印刷。"},{"english":"The company is a supplier of offset and rotogravure printing machines.","chinese":"該公司是一家膠印和凹版印刷機的供應商。"},{"english":"This company produce a variety of printing ink with different colors and these products are used in offset printing and ink printing widely.","chinese":"本公司油墨品種花色齊全，廣泛適用於膠印油墨印刷。"},{"english":"Otherwise offset printing department, the production of a variety of beautifully packaged .","chinese":"公司另有膠印印刷部，生產各種精美包裝。"},{"english":"However, the general Offset, it is difficult to achieve the level.","chinese":"然而對普通膠印來說，這是很難達到的水平。"},{"english":"The performance of the offset press inking system was evaluated by static and dynamic indices.","chinese":"膠印機輸墨系統性能的好壞由靜態和動態指標來評價。"},{"english":"Thus, the process of the offset printing ink viscosity control is very important.","chinese":"由此可見，油墨粘度的控制在膠印過程中至關重要。"},{"english":"There is close relation between newsprint printability and the water-ink balance during offset printing.","chinese":"新聞紙的印刷適性與膠印水墨平衡有密切的聯繫。"},{"english":"Sheetfed Business development in China.","chinese":"負責中國膠印市場的開發。"}],"related":[]}