{"definition":["rubber ring\/gasket"],"pinyin":["jiao1 quan1"],"simplified":["胶圈"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"膠圈","characters":[{"definition":["to glue\/glue\/gum\/rubber"],"pinyin":["jiao1"],"word":"膠"},{"definition":["circle\/ring\/loop\/classifier for loops, orbits, laps of race etc\/CL:個|个[ge4]\/to surround\/to circle","pen (pig)\/a fold","to confine\/to lock up\/to pen in"],"pinyin":["juan1","juan4","quan1"],"word":"圈"}],"containing_words":[],"sentences":[{"english":"Property speciality and spinning effect of JF spinning double short apron draft were discussed.","chinese":"探討JF型細紗雙短膠圈牽伸的性能特點及紡紗效果。"},{"english":"This text main introduce the improvement of the binding machine to the Model CR2 glue.","chinese":"本文主要介紹了對CR2型膠圈裝訂機的改進。"},{"english":"To lessen the resonance from the HDD I used rubber rings to mount it in place.","chinese":"爲了減少從硬盤我用橡膠圈裝入到位的共鳴。"},{"english":"If the magnet or rubber rings are broken, please replace the spare parts.","chinese":"磁石或橡膠圈如有破損，請及時更換備用配件。"},{"english":"The rubber bands get dutifully sorted by size, but that client proposal?","chinese":"橡膠圈很難按照大小排序，那客戶提案呢？"},{"english":"At the same time according to customer's request to configure rubber ring.","chinese":"同時可按客戶要求配置橡膠圈。"},{"english":"First reassembly step is to push the wipers and foam rings back on to the stanchions .","chinese":"組裝的第一步，是將密封圈和膨脹膠圈裝回支腿。"},{"english":"The utility model relates to a vacuum sealing ring, which is a circular rubber ring.","chinese":"本實用新型所涉及的真空密封圈爲圓形橡膠圈。"},{"english":"The bell and spigot ends are normally jointed by using a rubber ring gasket.","chinese":"鍾型和套管末端通常用橡膠圈接口。"},{"english":"The manual shows a three-inch-diameter rubber ring, but I dont have it.","chinese":"使用手冊上說有一個直徑三吋的橡膠圈，但我的沒有。"},{"english":"Sealing washer in a injection molding machine losed its function because of wear.","chinese":"注塑機過膠圈在使用中因磨損失去密封性而失效。"},{"english":"The utility model is composed of an annular magnet, a rubber ring and a plastic cover disk.","chinese":"它是由環形磁鐵，橡膠圈和塑料罩盤組成的。"},{"english":"Effects of different humidizers on the natural gas network are studied.","chinese":"研究了不同加溼劑對管網中橡膠圈和麻絲的溶脹作用。"}],"related":[]}