{"definition":["to glue\/to cement\/a bond"],"pinyin":["jiao1 jie2"],"simplified":["胶结"],"rank":59415.0,"normalized_rank":0.8312929357939361,"fraction":4.569099720778476e-8,"cumulative_fraction":0.9997894068363816,"word":"膠結","characters":[{"definition":["to glue\/glue\/gum\/rubber"],"pinyin":["jiao1"],"word":"膠"},{"definition":["(of a plant) to produce (fruit or seeds)\/Taiwan pr. [jie2]","knot\/sturdy\/bond\/to tie\/to bind\/to check out (of a hotel)"],"pinyin":["jie1","jie2"],"word":"結"}],"containing_words":[],"sentences":[{"english":"The first use of cemented fragmental rock filling in China was conducted atTongkeng tin mine operated by Dachang Mine Bureau.","chinese":"大廠銅坑錫礦在國內率先使用塊石砂漿膠結充填法。"},{"english":"Furthermore, a portion of space is filled with clay and cementing material .","chinese":"而且，部分孔隙被粘土和膠結物質填充。"},{"english":"Then, the sodium silicate solution will produce gel reaction in acidic environment.","chinese":"其次，水玻璃溶液遇到酸性環境會產生膠結作用。"},{"english":"The discuss about organic acid dissolution of sandstone reservoirs of paleogene strata in Xihu Sag;","chinese":"蘇北金湖凹陷阜寧組砂岩儲層中的膠結物爲片鈉鋁石。"},{"english":"The phosphate also acts as a binder.","chinese":"磷礦還起膠結劑的作用。"},{"english":"However, the loess with dense microstructure particles has less high-frequency components and \"shorter\"power-chain transmission.","chinese":"膠結較緊密的土層高頻成分少，力鏈傳遞“近”。"},{"english":"The rotating contacts are made with copper or silver sheet and have rectangular shape glued on the wheel.","chinese":"旋轉接觸與銅或銀板，並有長方形膠結對車輪。"},{"english":"A detail description of cemented phosphorus gypsum filling system and its process in Kaiy…","chinese":"詳細介紹了開磷集團磷石膏膠結充填系統及其工藝。"},{"english":"A detail description of cemented phosphorus gypsum filling system and its process in Kaiyang Phosphorus Group Co, Ltd is made.","chinese":"詳細介紹了開磷集團磷石膏膠結充填系統及其工藝。"},{"english":"Cementing material can also be extracted from lunar resources.","chinese":"膠結物也可以從月球資源中提取。"}],"related":[]}