{"definition":["bentonite (mineralogy)"],"pinyin":["peng2 run4 tu3"],"simplified":["膨润土"],"rank":50540.0,"normalized_rank":0.7071201712534804,"fraction":1.3590517060845884e-7,"cumulative_fraction":0.999035530782559,"word":"膨潤土","characters":[{"definition":["swollen"],"pinyin":["peng2"],"word":"膨"},{"definition":["to moisten\/to lubricate\/to embellish\/moist\/glossy\/sleek"],"pinyin":["run4"],"word":"潤"},{"definition":["Tu (ethnic group)\/surname Tu","earth\/dust\/clay\/local\/indigenous\/crude opium\/unsophisticated\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Tu3","tu3"],"word":"土"}],"containing_words":[],"sentences":[{"english":"Attapulgite clay presented better adsorption capability than bentonite.","chinese":"凹土的吸附脫色性能優於膨潤土。"},{"english":"Modified effect was studied on fresh mortar and hardens mortar with bentonite.","chinese":"研究了膨潤土對新拌砂漿和硬化砂漿的改性效果。"},{"english":"Activated clay is prepared via reation of bentonite and sulfuric acid at high temperature.","chinese":"活性白土是以膨潤土與硫酸經高溫反應制成的。"},{"english":"Bentonite ore is a lack mineral in Guizhou.","chinese":"膨潤土礦尚屬本省缺門礦種。"},{"english":"The bentonite in coal series is very rich.","chinese":"煤系地層中膨潤土儲量相當豐富，絕大部分品質優良。"},{"english":"This blocks application of bentonites in practice.","chinese":"這給膨潤土的工業應用帶來一定的困難。"},{"english":"The influence of bentonite ratio to green ball properties is not so obvious.","chinese":"膨潤土配入量對氧化鎳礦生球性能的影響不明顯。"},{"english":"It is capable of being adjusting agent and carrier of fertilizers.","chinese":"膨潤土還可用作肥料的調理劑和載體。"},{"english":"Organic complexes of montmorillonite were prepared by modifying montmorillonite with certain quaternary ammonium.","chinese":"對無機膨潤土進行了聚胺改性，得到有機複合膨潤土。"},{"english":"Organic complexes of montmorillonite were prepared by modifying montmorillonite with certain quaternary ammonium.","chinese":"對無機膨潤土進行了聚胺改性，得到有機複合膨潤土。"},{"english":"Kitty litter is bentonite clay.","chinese":"小鷹垃圾是膨潤土。"},{"english":"A method for the determination of trace arsenic by atomic fluorescence spectrometry was reported.","chinese":"建立了一種原子熒光光譜測定膨潤土中微量砷的方法。"},{"english":"The flocculating property of chitosan on medicinal bentonite suspension has been investigaeted .","chinese":"本文報道將殼聚糖用於絮凝藥用膨潤土懸濁液。"},{"english":"During the synthesis process of titanium oxide pillared bentonite, the calcinations temperature is the most important.","chinese":"鈦柱撐膨潤土的製備過程中，煅燒溫度至關重要。"},{"english":"A kind of absorbent is made from the combination of chitosan and bentonite.","chinese":"將殼聚糖與膨潤土混合製得一種吸附劑。"},{"english":"The effect of acid-activated bentonite on the properties of color ink-jet printing paper was studied.","chinese":"研究了酸化膨潤土對彩色噴墨打印紙性能的影響。"}],"related":[]}