{"definition":["gallstone"],"pinyin":["dan3 shi2 zheng4"],"simplified":["胆石症"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"膽石症","characters":[{"definition":["gall bladder\/courage\/guts\/gall\/inner container (e.g. bladder of a football, inner container of a thermos)"],"pinyin":["dan3"],"word":"膽"},{"definition":["dry measure for grain equal to ten dou 斗\/ten pecks\/one hundred liters","rock\/stone\/stone inscription\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Shi"],"pinyin":["Shi2","dan4","shi2"],"word":"石"},{"definition":["disease\/illness"],"pinyin":["zheng4"],"word":"症"}],"containing_words":[],"sentences":[{"english":"The pearly gallstone was discharged after Treatment with Magnetic Field (TMF).","chinese":"由旋磁療法治療膽石症患者獲得珍珠形膽結石。"},{"english":"Objective To study the correlation between cholelithiasis and the infection of HBV.","chinese":"目的探討乙肝病毒感染在膽石症發病中的作用。"},{"english":"Methods The clinical data of 24 patients with cholelithiasis and cirrhosis receiving operation were summarized.","chinese":"方法總結24例膽石症合併肝硬化外科治療的病例。"},{"english":"Objective To evaluate the laparoscopic cholecystectomy and its indications for the cholelithiasis in children.","chinese":"目的討論小兒膽石症的腹腔鏡治療及其適應證。"},{"english":"Objective To evaluate the value of the clinical application of postoperative choledochofiberscopy (POC).","chinese":"目的評價分析膽石症術後膽道鏡取石術臨牀應用價值。"},{"english":"Objective To study the problems of surgical treatment of senile biliary cholelithiasis and biliary infection.","chinese":"目的探討老年人膽石症膽感染外科的治療狀況。"},{"english":"Conclusion Internal and external medicine in effective for cholelithiasis.","chinese":"提示中藥內服外敷是治療膽石症的有效方法。"},{"english":"Cholelithiasis is the most common disease in our country.","chinese":"膽石症是我國的常見病。"},{"english":"Conclusion There might be good effect for cholelithiasis with this method.","chinese":"結論膽石利通片治療膽石症有很好的療效。"},{"english":"Objective To investigate the pathogenic relation between diabetes and cholelithiasis.","chinese":"目的探討糖尿病與膽石症之間的發病關係。"},{"english":"Objective To investigate the diagnosis and treatment of cholelithiasis in childhood.","chinese":"目的探討小兒膽石症的診斷與治療方法。"}],"related":[]}