{"definition":["pimple containing pus"],"pinyin":["nong2 pao4"],"simplified":["脓疱"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"膿皰","characters":[{"definition":["pus"],"pinyin":["nong2"],"word":"膿"},{"definition":["pimple\/acne\/blister\/boil\/ulcer"],"pinyin":["pao4"],"word":"皰"}],"containing_words":[],"sentences":[{"english":"A pustule caused by smallpox or a similar eruptive disease.","chinese":"痘皰由天花或類似的發疹性疾病導致的膿皰。"},{"english":"Along with the clinical improvement the spongiform pustules vanished, and the inflammation in dermis also lessened.","chinese":"治療後表皮內海綿狀膿皰消失，真皮炎症有所減輕。"},{"english":"Tinea capitis is manifested by pustular eruptions of the scalp, with scaling and bald patches.","chinese":"頭癬是補丁表現爲膿皰爆發的禿頭頭皮，具有縮放和。"},{"english":"Patients with guttate, erythrodermic, or pustular psoriasis were excluded.","chinese":"與點滴狀，紅皮，或膿皰性銀屑病患者被排除在外。"},{"english":"The histological findings of a skin biopsy were consistent with acute generalised exanthematous pustulosis.","chinese":"皮膚活檢組織學檢查符合急性泛發性膿皰性皮炎。"},{"english":"A type of acne characterized by the presence of papules and pustules.","chinese":"是一種炎性的青春痘類型，表現爲丘疹或膿皰。"},{"english":"This invention discloses a process for preparing a medicin \"Qingxin oil\" for curing pustuloderma.","chinese":"本發明爲一種治療膿皰瘡用慶鋅油的制條方法。"},{"english":"Impetigo has been prevalent in infants born in some hospitals in Dalian for some years.","chinese":"膿皰病在大連某些醫院出生的嬰兒中流行已有若干年。"},{"english":"The rash morphology progresses from papules to pustules and finally to crusting lesions.","chinese":"皮疹的形態從最初的丘疹發展至膿皰，最終局部脫屑。"},{"english":"Pruritis, papules, pustules, crusts and scabs.","chinese":"搔癢，丘疹，膿皰，外皮堅硬並結痂。"},{"english":"Another reason to find a long pustules, symptomatic treatment.","chinese":"另外要找出長膿皰的緣由，對症治療。"},{"english":"Conclusion Sanhuang-calamine mixture yields satisfactory results in treating newborn's abscess and curtails the course of the disease and therefore worth popularization.","chinese":"目的觀察三黃爐甘石混合液治療新生兒膿皰瘡的效果。"},{"english":"When this happens, pustules form.","chinese":"在這種情況下，膿皰形式。"},{"english":"AGEP is characterised by acute onset of a pustular eruption in association with fever.","chinese":"AGEP的特點是急性發作的膿皰噴發與發燒。"},{"english":"Skin lesions vary from macular, papular, or occasional pustular and nodular type rashes.","chinese":"皮膚病因黃斑，丘疹，偶爾或膿皰，結節性皮疹。"},{"english":"See your GP for treatment for impetigo .","chinese":"看到你的家庭醫生爲治療膿皰。"}],"related":[]}