{"definition":["to assume\/assumption"],"pinyin":["yi4 duan4"],"simplified":["臆断"],"rank":37569.0,"normalized_rank":0.5256390525093392,"fraction":4.823100791518238e-7,"cumulative_fraction":0.995438786574536,"word":"臆斷","characters":[{"definition":["feelings\/opinion\/thoughts"],"pinyin":["yi4"],"word":"臆"},{"definition":["to break\/to snap\/to cut off\/to give up or abstain from sth\/to judge\/(usu. used in the negative) absolutely\/definitely\/decidedly"],"pinyin":["duan4"],"word":"斷"}],"containing_words":[],"sentences":[{"english":"In the absence of your judgment, everything would be fine.","chinese":"停止你的主觀臆斷，一切都會很好。"},{"english":"I am sorry if you have misunderstood my message by subjective interpretation.","chinese":"很抱歉地說，您主觀臆斷，曲解了我文章的原意。"},{"english":"Never assume, for it makes an ASS out of U and ME. (Anon)","chinese":"永遠不要主觀臆斷，因爲那會使你我成爲蠢驢。"},{"english":"The whole plan is based on merely his own supposition.","chinese":"整個計劃只是建立在他的主觀臆斷上。"},{"english":"The assumption of free will is strongest in this category.","chinese":"在這種類型裏，對於自由意志的臆斷是最強烈的。"},{"english":"Never assume, for it makes an ASS out of U and ME.","chinese":"永遠不要主觀臆斷，因爲那會使你我成爲蠢驢。"},{"english":"Any comparison that is not strictly factual runs the risk of being interpreted as subjective.","chinese":"任何不完全切合實際的比較都有可能被當作主觀臆斷。"},{"english":"Don't assume the mission is accomplished.","chinese":"不要主觀臆斷某項任務已經圓滿完成。"},{"english":"You should not rest your argument upon subjective and groundless conclusions.","chinese":"你不能以主觀臆斷作爲你的論據。"},{"english":"Doubt the existence of objective reality should insist, not subjective.","chinese":"疑義的存在應堅持客觀存在，不能主觀臆斷。"},{"english":"A case of small bowel volvulus was admitted with the clinical impression of acute occlusive intestinal ischemia.","chinese":"本病例入院臆斷爲阻塞性腸道缺血。"},{"english":"The reporting of such coincidental conditions can lead to undue fears and allegations.","chinese":"報告這些偶合病狀可能導致不適當的恐懼和主觀臆斷。"}],"related":[]}