{"definition":["to befall"],"pinyin":["lin2 dao4"],"simplified":["临到"],"rank":39851.0,"normalized_rank":0.5575671932058259,"fraction":3.9019819660194466e-7,"cumulative_fraction":0.9964309445362828,"word":"臨到","characters":[{"definition":["to face\/to overlook\/to arrive\/to be (just) about to\/just before"],"pinyin":["lin2"],"word":"臨"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"}],"containing_words":[],"sentences":[{"english":"However, she started to write her essay only one day before the deadline.","chinese":"然而，她臨到截止日期的前一天才開始動筆。"},{"english":"And the word of the LORD came unto me the second time, saying, What seest thou?","chinese":"耶和華的話第二次臨到我說，你看見什麼。"},{"english":"Let bad luck come down on both the houses.","chinese":"讓壞運降臨到這兩個家庭吧。"},{"english":"The kind of fame that hounded Pollock's life and death never quite came to Still.","chinese":"圍繞波洛克生與死的那種名望從未降臨到史蒂爾身上。"},{"english":"He began to imagine all kinds of frightening things that could happen to him.","chinese":"他開始想像各種可能降臨到他頭上的可怕的事情。"},{"english":"There is no place that you can go where God’s love isn’t.","chinese":"你不管到哪裏，神的愛都能臨到你。"},{"english":"Because of their guilt, God's anger came upon Judah and Jerusalem.","chinese":"因他們這罪，就有忿怒臨到猶大和耶路撒冷。"},{"english":"Like a fluttering sparrow or a darting swallow, an undeserved curse does not come to rest.","chinese":"麻雀往來，燕子翻飛，這樣，無故的咒詛也必不臨到。"},{"english":"shall there be evil in a city, and the LORD hath not done it?","chinese":"災禍若臨到一城，豈非耶和華所降的嗎。"},{"english":"The word of the LORD that came to Joel the son of Pethuel.","chinese":"耶和華的話臨到毘土珥的兒子約珥。"},{"english":"And the word of the LORD came to Elijah the Tishbite, saying.","chinese":"耶和華的話臨到提斯比人以利亞說。"},{"english":"But the word of the LORD came to Shemaiah the man of God, saying.","chinese":"但耶和華的話臨到神人示瑪雅說。"},{"english":"I saw hope dawning on the faces of Cornwallis and Krishna.","chinese":"我看到希望的表情降臨到了康沃和克里斯的臉上。"},{"english":"He will come upon rulers as upon mortar, As the potter treads the clay.","chinese":"他必臨到掌權的，好像臨到灰泥，彷佛窯匠踹泥一樣。"},{"english":"He will come upon rulers as upon mortar, As the potter treads the clay.","chinese":"他必臨到掌權的，好像臨到灰泥，彷佛窯匠踹泥一樣。"},{"english":"\"It came up on me gradually, over time, \" Jason says.","chinese":"“它是漸漸降臨到我頭上的，”傑生說。"}],"related":[]}