{"definition":["facing death\/at death's door"],"pinyin":["lin2 si3"],"simplified":["临死"],"rank":27346.0,"normalized_rank":0.3826060190561471,"fraction":0.000001197892406029015,"cumulative_fraction":0.9874206031026748,"word":"臨死","characters":[{"definition":["to face\/to overlook\/to arrive\/to be (just) about to\/just before"],"pinyin":["lin2"],"word":"臨"},{"definition":["to die\/impassable\/uncrossable\/inflexible\/rigid\/extremely\/damned"],"pinyin":["si3"],"word":"死"}],"containing_words":[{"definition":["equanimity in the face of death\/to face dangers with assurance"],"pinyin":["lin2 si3 bu4 qie4"],"word":"臨死不怯"}],"sentences":[{"english":"It has been supposed that Darwin renounced evolution on his deathbed.","chinese":"有人認爲達爾文臨死時否定了進化論。"},{"english":"I just want to make a new friend when I'm going todie.","chinese":"我只是想在臨死之前多交一個朋友而已。"},{"english":"The second woman also recorded her statement before she died.","chinese":"第二位婦女也在臨死前錄下了證詞。"},{"english":"My grandfather, on his deathbed, sold me this watch.","chinese":"我的祖父，在他臨死的時候，把這塊表賣給了我。"},{"english":"It is said that he died clutching the script to 'The Final Curtain'.","chinese":"據說，他臨死前緊緊抓着《黑幕風雲》的劇本。"},{"english":"I can perhaps even picture the moment of my death.","chinese":"我甚至能想象自己臨死的那一刻。"},{"english":"In stature she was tall, somewhat slender, and in her latter days, even emaciated.","chinese":"她身材修長，有點嬌弱，臨死前，竟是形銷骨立。"},{"english":"In the end, Molly will gave birth to a son before dying down.","chinese":"最終，莫莉在臨死之前將兒子生了下來。"},{"english":"We post to the website the near-death experience exactly as it was shared with us.","chinese":"我們貼在網站的臨死體驗完全是我們得到它時的模樣。"},{"english":"Authorities do YuanQuan before his death is of all kinds of suggest that mean???????","chinese":"機關算盡的袁荃臨死前的種種暗示意味着什麼？"},{"english":"The die set static also want to know who is linghu chong.","chinese":"臨死的定靜還想知道令狐沖到底是誰。"},{"english":"Death of that a moment, two brothers got really get out of it.","chinese":"臨死的那一刻，兄弟二人都得到了真正的擺脫。"},{"english":"Mendoza used a hostage as a human shield to protect himself, before being killed.","chinese":"門多薩在臨死前還挾持了一名人質來做他的盾牌。"},{"english":"Before dying she made her sisters promise they’d keep her head in the hall.","chinese":"臨死前，她讓姐姐保證會把她的頭顱留在房子裏。"},{"english":"Liu Hulan glared the enemy before her death.","chinese":"劉胡蘭臨死前怒目而視着敵人。"}],"related":[]}