{"definition":["facing the street"],"pinyin":["lin2 jie1"],"simplified":["临街"],"rank":16449.0,"normalized_rank":0.23014285114658686,"fraction":0.0000035003975145222717,"cumulative_fraction":0.9645494747688966,"word":"臨街","characters":[{"definition":["to face\/to overlook\/to arrive\/to be (just) about to\/just before"],"pinyin":["lin2"],"word":"臨"},{"definition":["street\/CL:條|条[tiao2]"],"pinyin":["jie1"],"word":"街"}],"containing_words":[{"definition":["the store front\/the part of a house facing the street serving as a store"],"pinyin":["lin2 jie1 fang2"],"word":"臨街房"}],"sentences":[{"english":"There is a locked door from the street that leads to the corridor where the basement door is (I don't even have a key for this).","chinese":"房子臨街有一個鎖著的門，打開門就是一個走廊。"},{"english":"The street-facing elevation incorporates windows that divide the surface into horizontal bands.","chinese":"臨街立面採用的窗戶把表面分成了水平的長條。"},{"english":"The rooms by street-side were divided into four shops for lease;","chinese":"臨街的一邊隔了四個商鋪出租。"},{"english":"The gatehouse on the street, so far still ringing in binoculars.","chinese":"臨街的門樓上，至今彈痕猶在。"},{"english":"The diners are packed into a small room facing onto the street.Posters of the house specialities adorn the walls.","chinese":"用餐者擠進一個臨街的小房間。"},{"english":"The sky had gone dark, and cozily lighted storefronts beckoned like fireflies.","chinese":"天色已晚，臨街店面慵懶的路燈像一隻只螢火蟲。"},{"english":"Daylighting is very good, after shining, not street noise.","chinese":"採光非常好，前後無遮擋，不臨街無噪音。"},{"english":"I’d like a quiet room away from the street.","chinese":"我想要個不臨街的安靜房間。"},{"english":"By the way, I’d like a quiet room away from the street if the is possible.","chinese":"順便說一下，如有可能我想要一個不臨街的安靜房間。"},{"english":"Facing the street door, the reception desk is spacious and bright.","chinese":"正對着臨街大門，前臺寬敞明亮。"},{"english":"On the street-facing elevation, the skin pulls back to reveal a wall made of stained cedar blocks.","chinese":"在臨街面上，表皮消失，露出彩色的雪松牆面的體塊。"},{"english":"Q. I’m tired of having my car dented and knocked about on the street and want to use my front garden for parking.","chinese":"車停在臨街，上面有凹痕，還老被撞，這讓我很累。"},{"english":"Daylighting is very good, and shining, street not noise.","chinese":"採光非常好，前後無遮擋，不臨街無噪音。"},{"english":"A small storefront leads to an English-language school run by Disney.","chinese":"一個臨街的店面通向由迪士尼經營的英語語言學校。"}],"related":[]}