{"definition":["before leaving\/on departure"],"pinyin":["lin2 zou3"],"simplified":["临走"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"臨走","characters":[{"definition":["to face\/to overlook\/to arrive\/to be (just) about to\/just before"],"pinyin":["lin2"],"word":"臨"},{"definition":["to walk\/to go\/to run\/to move (of vehicle)\/to visit\/to leave\/to go away\/to die (euph.)\/from\/through\/away (in compound verbs, such as 撤走[che4 zou3])\/to change (shape, form, meaning)"],"pinyin":["zou3"],"word":"走"}],"containing_words":[],"sentences":[{"english":"Li Zhongming would burn up those drawings, he left home leave Yang Nian letters.","chinese":"黎仲明將那些圖紙燒燬，他臨走時給楊念留下書信。"},{"english":"Face before hiking, Qin Feng says apt her ugg boots new store starts train ugg tall builds threatening force this time.","chinese":"臨走前，秦風對她說這次新店開業要造一下聲勢。"},{"english":"Previous to her departure she gave a big party.","chinese":"在她臨走之前她舉行了一次大型宴會。"},{"english":"I finally picked out three books which were written in a style easy enough for me to understand, and I took these back to my room.","chinese":"臨走時，我還選了三本簡單易懂的帶回寢室。"},{"english":"He had said to finish the tutor to Gao Luo, come back in the evening.","chinese":"他臨走時說做完家教要找高洛去，晚上回來。"},{"english":"The guests were given a tiny jar of honey from the White House beehives to take home.","chinese":"每位客人臨走時還被贈送了一小瓶白宮自產的蜂蜜。"},{"english":"When he left he cut short the father's nervous thanks gruffly.","chinese":"臨走時，他很粗魯地打斷了那父親的緊張的道謝的話。"},{"english":"His last thought on leaving home was for her.","chinese":"他離家的時候，臨走想到的還是她。"},{"english":"And he told me I could go to the canteen to get paste, he had arranged well with the kitchen.","chinese":"臨走時說，糨子到伙房去打，他已經跟炊事員說好了。"},{"english":"When he left, liu town told him, when he and his friendship to the end.","chinese":"臨走時，柳時鎮告訴他，自己和他的友情到此結束。"},{"english":"I left impressed.","chinese":"臨走時，我的印象很深刻。"},{"english":"There is a being who carried off my sky when she went away.","chinese":"有個人臨走時把天帶走了。"},{"english":"The time faced to walk, he still remembers to be personally needling up a lotus light in front of door.","chinese":"臨走的時候，他還記得在親手在門前掛上一盞蓮花燈。"},{"english":"But before he left, Summerville accused Nora of leading him on, and swore vengeance.","chinese":"索姆威勒臨走前，抱怨勞拉誆騙了他，併發誓要報復。"},{"english":"Just before leaving, I and several good friends took a souvenir photo under the oriental pearl tower.","chinese":"臨走時，我和幾個好朋友們在東方明珠塔下留了影。"},{"english":"Before I left, Mr. Xie did not disproportionately expressed their preferences.","chinese":"臨走前，謝先生並沒有過多地表示出自己的喜好。"}],"related":[]}