{"definition":["just before the battle\/to approach the front line"],"pinyin":["lin2 zhen4"],"simplified":["临阵"],"rank":29356.0,"normalized_rank":0.4107285268562954,"fraction":9.960053480789632e-7,"cumulative_fraction":0.9896184806448232,"word":"臨陣","characters":[{"definition":["to face\/to overlook\/to arrive\/to be (just) about to\/just before"],"pinyin":["lin2"],"word":"臨"},{"definition":["disposition of troops\/wave\/spate\/burst\/spell\/short period of time\/classifier for events or states of short duration"],"pinyin":["zhen4"],"word":"陣"}],"containing_words":[{"definition":["see 臨陣退縮|临阵退缩[lin2 zhen4 tui4 suo1]"],"pinyin":["lin2 zhen4 tuo1 tao2"],"word":"臨陣脫逃"},{"definition":["to shrink back as the time for battle approaches (idiom)\/to get cold feet"],"pinyin":["lin2 zhen4 tui4 suo1"],"word":"臨陣退縮"}],"sentences":[{"english":"The soldiers were punished for their base conduct in running away from the enemy.","chinese":"那些士兵由於臨陣脫逃的可恥行爲受到懲罰。"},{"english":"Freddy chickened out of the plan at the last minute.","chinese":"弗雷迪臨陣脫逃，最終退出了這個計劃。"},{"english":"He's boning up for his finals.","chinese":"他爲應付期末考試而臨陣磨槍。"},{"english":"I have to cram for finals next week. ;","chinese":"我必須臨陣磨槍以準備下周的期末考試。"},{"english":"I spent the last 48 hours cramming for it.","chinese":"我在剛過去的48小時在臨陣磨槍。"},{"english":"I have years of experience in battlefield combat, which makes me competent for the principalship .","chinese":"我擁有多年臨陣作戰的經驗，足以勝任這個職務。"},{"english":"I have to cram all night for tomorrow's exams.","chinese":"爲了明天的考試，我得熬夜臨陣磨槍。"},{"english":"Claire canceled the wedding. She got cold feet.","chinese":"克萊兒取消婚禮，她臨陣退縮。"},{"english":"He let the opportunity slip and fled the field.","chinese":"他錯過了機會，而且臨陣脫逃。"},{"english":"He was accused of running away when the enemy attacked.","chinese":"他被指控在敵人進攻時臨陣脫逃。"},{"english":"The band couldn't perform because the singer chickened out backstage. (chicken out)","chinese":"這個樂團不能表演，因爲主唱在後臺臨陣退縮了。"},{"english":"Never swap horses while crossing the stream.","chinese":"過河莫換馬，臨陣勿換將。"},{"english":"Put him in a designed crisis to see if he will escape or change his mind.","chinese":"設計一個危機的狀況，看他會不會臨陣脫逃。"},{"english":"Henry wanted to ask Sue on a date, but then he chickened out.","chinese":"亨利想約蘇出去，但是他後來卻臨陣脫逃。"},{"english":"No, he didn't funk it.","chinese":"沒有，他沒有臨陣脫逃。"},{"english":"Several white-livered fellows ran away at the beginning of the battle.","chinese":"戰鬥一開始，幾個膽小鬼就臨陣脫逃。"}],"related":[]}