{"definition":["from start to finish (idiom)"],"pinyin":["zi4 shi3 zhi4 zhong1"],"simplified":["自始至终"],"rank":15809.0,"normalized_rank":0.221188420802261,"fraction":0.0000037551284733963433,"cumulative_fraction":0.9622305487831349,"word":"自始至終","characters":[{"definition":["self\/oneself\/from\/since\/naturally\/surely"],"pinyin":["zi4"],"word":"自"},{"definition":["to begin\/to start\/then\/only then"],"pinyin":["shi3"],"word":"始"},{"definition":["to arrive\/most\/to\/until"],"pinyin":["zhi4"],"word":"至"},{"definition":["end\/finish"],"pinyin":["zhong1"],"word":"終"}],"containing_words":[],"sentences":[{"english":"Gates sat through it silently for about an hour.","chinese":"蓋茨坐了約一個小時，自始至終沉默不言。"},{"english":"Throughout, she illustrates her analysis with excerpts from discussions.","chinese":"自始至終，她摘引討論內容來闡明她的分析。"},{"english":"And yet the movement is a masterpiece of pattern designing all the time.","chinese":"莫扎特的這一樂章又自始至終是樂式設計的傑作。"},{"english":"The American way of dining is such a large plate, and one should concentrate on the plate from start to finish.","chinese":"美式餐飲就是那麼一大盤，自始至終以一盤貫之。"},{"english":"But pediatricians do not consistently prescribe vitamin drops.","chinese":"但是兒科醫生沒有自始至終地開出維生素點滴的處方。"},{"english":"Ensure absolutely impartiality and Confidentiality throughout.","chinese":"自始至終確保完全的公正與失密。"},{"english":"We drew on her experience throughout the project .","chinese":"我們這一項目自始至終都借重她的經驗。"},{"english":"She still keeps it in a drawer in her bedroom at Buckingham Palace.","chinese":"自始至終，女王都把它珍藏在白金漢宮的臥室抽屜中。"},{"english":"It was a wonderful evening, but I was nervous the entire time.","chinese":"這是一個奇妙的夜晚，但我自始至終都有些心神不定。"},{"english":"Liberal arts students, they have all along and the Americans to fight in the language.","chinese":"文科類學生來說，他們自始至終都在和美國人拼語言。"},{"english":"She has been, and continues to be, a devoted public servant.","chinese":"自始至終，她都是一名勤於奉獻的公務人員。"},{"english":"Rivers somehow managed to keep her sense of humor throughout.","chinese":"不管怎樣，Rivers自始至終保持了她的幽默感。"},{"english":"It happened that she was in the group and she impressed me greatly with her friendly and lovely smile throughout the test.","chinese":"她自始至終友好而可愛的微笑給我留下了深刻的印象。"},{"english":"He retained a tender affection for his wife to the end of his life.","chinese":"他一生自始至終都對他的妻子溫情脈脈。"},{"english":"The Stainless One, Pure Spirit through and through.","chinese":"自始至終的超靈，純潔無暇的靈魂。"},{"english":"Throughout the reception, it was permeated with warm and friendly atmosphere.","chinese":"招待會自始至終洋溢着熱烈友好的氣氛。"}],"related":[]}