{"definition":["since ancient times"],"pinyin":["zi4 gu3 yi3 lai2"],"simplified":["自古以来"],"rank":19660.0,"normalized_rank":0.2750689071397591,"fraction":0.00000247884608174247,"cumulative_fraction":0.974009387003414,"word":"自古以來","characters":[{"definition":["self\/oneself\/from\/since\/naturally\/surely"],"pinyin":["zi4"],"word":"自"},{"definition":["ancient\/old\/paleo-","surname Gu"],"pinyin":["Gu3","gu3"],"word":"古"},{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"}],"containing_words":[],"sentences":[{"english":"Chinese people has never regarded human beings as the hightest creature among everything else since ancient times.","chinese":"中華民族自古以來從來不把人看作高於一切。"},{"english":"Calvinism was the most convenient religion since the days of the ancients.","chinese":"加爾文主義是自古以來最方便的宗教。"},{"english":"In ancient times, the people of many civilized countries used propolis as medicine to treat inflammations.","chinese":"自古以來，蜂膠被用作天然消炎藥物。"},{"english":"They have been easily extracted since ancient times by soaking wood ashes in water.","chinese":"自古以來，人們用水浸泡木灰就很容易濾取出它們。"},{"english":"Formerly known as the Western Territory, Xinjiang has been an inalienable part of China since ancient times.","chinese":"新疆古稱西域，自古以來就是中國不可分割的一部分。"},{"english":"It's a primarily, historically there's a lot of, it has a very heavy Jewish community.","chinese":"基本上，那裏自古以來就有很多，猶太人聚集區。"},{"english":"Since ancient time, plutus cat has been regarded as a mascot for wealth and luck in Japan.","chinese":"招財貓自古以來被日本視爲招財招福的吉祥物。"},{"english":"People have dreamt of immortality since time immemorial .","chinese":"人們自古以來就夢想着永垂不朽。"},{"english":"Since ancient times, Tibetan and Chinese peoples have lived as neighbors.","chinese":"中文版是“藏漢兩個民族自古以來毗鄰而居。”"},{"english":"Taking nourishing food in winter to build up health has been used as the usual health care method since ancient time.","chinese":"冬季進補是我國人民自古以來常用的自身保健方法。"},{"english":"Ever since the ancient times the literati and warriors had conquered the world in drasticly different ways.","chinese":"自古以來，文人與武人的征服方式，就根本不同。"},{"english":"The folk financing existence history is long-standing in our country.","chinese":"民間融資在我國自古以來就已存在。"},{"english":"In fact, since ancient times, the ingenious combination of poetry paintings of many people.","chinese":"事實上，自古以來，將詩書畫結合巧妙的人大有人在。"},{"english":"Since ancient times, Chinese were courteous image of modesty.","chinese":"自古以來中國人就以謙謙有禮的形象而聞名於世。"},{"english":"The traditional morals of Rome nation was handed down through generations from ancient times.","chinese":"羅馬民族自古以來就有一種世代相襲的傳統美德。"},{"english":"They said that historically, they could always take what they wanted.","chinese":"他們說，自古以來，他們都是任取所需。"}],"related":[{"definition":["antiquity"],"pinyin":["gu3 shi2"],"word":"古時"},{"definition":["among the people\/popular\/folk\/non-governmental\/involving people rather than governments"],"pinyin":["min2 jian1"],"word":"民間"},{"definition":["Chinese person"],"pinyin":["Zhong1 guo2 ren2"],"word":"中國人"},{"definition":["tradition\/traditional\/convention\/conventional\/CL:個|个[ge4]"],"pinyin":["chuan2 tong3"],"word":"傳統"},{"definition":["called\/to call sth (by a name)\/to name"],"pinyin":["cheng1 wei2"],"word":"稱為"},{"definition":["Changshou suburban district of Chongqing municipality, formerly in Sichuan","longevity\/ability to live long\/long lived"],"pinyin":["Chang2 shou4","chang2 shou4"],"word":"長壽"},{"definition":["since ancient times\/since times immemorial"],"pinyin":["gu3 wang3 jin1 lai2"],"word":"古往今來"},{"definition":["lit. source is distant and the flow is long (idiom); fig. sth goes back to the dim and distant past\/a lot of water has flowed under the bridge since then"],"pinyin":["yuan2 yuan3 liu2 chang2"],"word":"源遠流長"},{"definition":["to praise\/to acclaim\/reputation"],"pinyin":["yu4"],"word":"譽"},{"definition":["gem\/(fig.) rare and valuable item\/gem\/treasure"],"pinyin":["gui1 bao3"],"word":"瑰寶"},{"definition":["origin"],"pinyin":["you2 lai2"],"word":"由來"},{"definition":["people"],"pinyin":["ren2 men5"],"word":"人們"},{"definition":["can be counted on one's fingers (idiom)\/very few"],"pinyin":["qu1 zhi3 ke3 shu3"],"word":"屈指可數"},{"definition":["only\/nothing else"],"pinyin":["wu2 fei1"],"word":"無非"},{"definition":["to pay particular attention to\/carefully selected for quality\/tastefully chosen"],"pinyin":["jiang3 jiu5"],"word":"講究"},{"definition":["place of origin\/birthplace\/source"],"pinyin":["fa1 yuan2 di4"],"word":"發源地"}]}