{"definition":["to free oneself\/to extricate oneself from a difficult situation"],"pinyin":["zi4 ba2"],"simplified":["自拔"],"rank":21509.0,"normalized_rank":0.3009388160564129,"fraction":0.0000020546350980816957,"cumulative_fraction":0.9781813586776884,"word":"自拔","characters":[{"definition":["self\/oneself\/from\/since\/naturally\/surely"],"pinyin":["zi4"],"word":"自"},{"definition":["to pull up\/to pull out\/to draw out by suction\/to select\/to pick\/to stand out (above level)\/to surpass\/to seize"],"pinyin":["ba2"],"word":"拔"}],"containing_words":[],"sentences":[{"english":"Teacher education can not still pull itself from technical whirlpool.","chinese":"在今天，教師教育依然在技術主義的漩渦裏不可自拔。"},{"english":"Just for a laugh, and have a crush on the low memory.","chinese":"只爲一個笑，而迷戀於那卑微的回憶裏不可自拔。"},{"english":"Our eyes are naturally drawn to contrast, we simply can't help but look!","chinese":"我們的眼睛會非常自然地被對比色所吸引而不能自拔。"},{"english":"Do you sometimes feel that you are stuck in a rut?","chinese":"你是否時常感到深陷瑣事無力自拔？"},{"english":"Unable to go out because of the deep snow, she felt imprisoned in her own house.","chinese":"她因深雪而無法自拔，感覺自己被關在了屋子裏。"},{"english":"Workers are trapped in a cycle of poverty with no escape.","chinese":"工人們陷入貧困的怪圈裏，無力自拔。"},{"english":"You will only get yourself into more trouble than you can climb out of by mid-semester.","chinese":"期中後，你將只會使自己陷入更大的困境而不能自拔。"},{"english":"That he is an irrepressible jackass who thinks of himself as a sly fox?","chinese":"他是個無法自拔的混球，認爲自己是隻狡猾的狐狸？"},{"english":"Pina Gallimard reverie together, be able to extricate themselves in the one-way thinking Orientalism.","chinese":"加利馬爾遐想聯翩，無法自拔於東方主義的單向思維。"},{"english":"Only for a laugh, and caught up in the humbler memories of the misery of it.","chinese":"只爲一個笑，而陶醉於那微賤的回念裏沒有成自拔。"},{"english":"When you resist the state you’re in, you perpetuate it.","chinese":"而一旦抵制這種狀態，你會深陷其間難以自拔。"},{"english":"More than a month, I often fall into distress among the non-anonymous in order to extricate themselves.","chinese":"一個多月了，我時常陷入無名的苦惱之中無以自拔。"},{"english":"Those that sin still, must expect to be in trouble still.","chinese":"那些仍舊犯罪的人，也將仍舊在患難中難以自拔。"},{"english":"Fascination with the network all day, we will lose ourselves, unable to extricate themselves.","chinese":"整天迷戀網絡，我們會迷失自我，難以自拔。"},{"english":"Ribbing a friend for being helplessly in love.","chinese":"戀愛得無力自拔的朋友。"},{"english":"I held them closely, and now I cannot break away.","chinese":"我緊緊捧住它，如今我已無法自拔。"}],"related":[{"definition":["to indulge in\/to wallow\/absorbed in\/deeply engrossed\/addicted"],"pinyin":["chen2 ni4"],"word":"沉溺"},{"definition":["to be engrossed\/to be absorbed with\/to lose oneself in\/to be addicted to"],"pinyin":["chen2 mi2"],"word":"沉迷"},{"definition":["to fall deeper and deeper (in debt, in love etc)"],"pinyin":["yue4 xian4 yue4 shen1"],"word":"越陷越深"},{"definition":["deeply immersed\/fig. wallowing in\/deeply engrossed in"],"pinyin":["chen2 mian3"],"word":"沉湎"},{"definition":["to indulge in\/to wallow in"],"pinyin":["dan1 ni4"],"word":"耽溺"},{"definition":["to sink into (vice, depravity etc)\/to pass into oblivion\/downfall\/passing"],"pinyin":["chen2 lun2"],"word":"沉淪"},{"definition":["to become intoxicated"],"pinyin":["chen2 zui4"],"word":"沉醉"},{"definition":["to be infatuated with\/to be enchanted by\/to be passionate about"],"pinyin":["mi2 lian4"],"word":"迷戀"},{"definition":["to soak\/to permeate\/to immerse"],"pinyin":["chen2 jin4"],"word":"沉浸"},{"definition":["to be deeply in (trouble, debt etc)\/deep set (eyes)"],"pinyin":["shen1 xian4"],"word":"深陷"},{"definition":["to control oneself"],"pinyin":["zi4 yi4"],"word":"自抑"},{"definition":["to forget"],"pinyin":["wang4 huai2"],"word":"忘懷"},{"definition":["to lose (one's bearings)\/to get lost"],"pinyin":["mi2 shi1"],"word":"迷失"},{"definition":["want to stop but can't (idiom)\/to be unable to stop oneself\/to feel an urge to continue"],"pinyin":["yu4 ba4 bu4 neng2"],"word":"欲罷不能"},{"definition":["to forget"],"pinyin":["wang4 que4"],"word":"忘卻"},{"definition":["to be infatuated with\/to be drunk with\/to be enchanted with\/to revel in"],"pinyin":["tao2 zui4"],"word":"陶醉"}]}