{"definition":["to call oneself\/to claim to be\/to profess\/to claim a title"],"pinyin":["zi4 cheng1"],"simplified":["自称"],"rank":4756.0,"normalized_rank":0.06654261049627133,"fraction":0.00002587409642839689,"cumulative_fraction":0.8528667316204932,"word":"自稱","characters":[{"definition":["self\/oneself\/from\/since\/naturally\/surely"],"pinyin":["zi4"],"word":"自"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"}],"containing_words":[],"sentences":[{"english":"The Chu general Zhuang Jiao entered the region from the upper Yangtze River and set himself up as \"King of Dian\".","chinese":"楚國的將軍莊郊從長江上游來到這裏自稱滇王。"},{"english":"The one sets the engine, is a grand-banquet's host named Oota-zyunya.","chinese":"設置引擎的，是一位自稱太田順也的盛宴之主。"},{"english":"Organovo calls itself a regenerative medicine company.","chinese":"Organovo自稱再生醫學公司。"},{"english":"The University of Paderborn considers itself \"The University for the Information Society\".","chinese":"帕德波恩大學自稱爲一所“信息化社會大學”。"},{"english":"Giacomo reclaims his daughter, and the King professes his love.","chinese":"賈科莫回收他的女兒，國王自稱他的愛。"},{"english":"The Bible itself doesn't claim to have been written by God.","chinese":"聖經並未自稱是上帝之作。"},{"english":"His fans even began calling themselves Vayniacs.","chinese":"他的擁躉甚至開始以“沃伊腦殘粉”自稱。"},{"english":"He later apologized for what he said was an “inappropriate” remark.","chinese":"之後他爲這一自稱爲不恰當的評論做出了道歉。"},{"english":"They are professional quotes-deleted corporations and individuals, who call themselves \" Online PR\".","chinese":"他們是專業的刪帖公司和個人，自稱“網絡公關”。"},{"english":"Women's claim in nanchang city of jiangxi province, but mobile phone number is jiangxi shangrao.","chinese":"女子自稱江西南昌人，但手機號碼是江西上饒的。"},{"english":"He even identified himself, because he started claiming divine status for himself.","chinese":"他甚至標榜自己，自稱爲神。"},{"english":"How much do I have to change in order TO CLAIM copyright in someone else's work?","chinese":"這句是說改了圖後便自稱擁有修改後的版權。"},{"english":"He listed himself as a conservative.","chinese":"他自稱是一個保守主義者。"},{"english":"Anybody who set himself up as king, without being appointed king by the Senate, that was itself an act of treason.","chinese":"任何人自稱爲王，而不受元老院冊封，那就是叛國罪。"},{"english":"The beautiful women from antiquity she impersonates always call themselves \"Nu Jia\".","chinese":"她扮演的古代佳人總是自稱“奴家”。"},{"english":"Mao Zedong's Red Guards sometimes called themselves “new Boxers”.","chinese":"紅衛兵有時自稱“新義和團”。"}],"related":[{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"},{"definition":["to claim\/to state\/to proclaim\/to assert"],"pinyin":["sheng1 cheng1"],"word":"聲稱"},{"definition":["to believe (sth in relation to oneself)\/to regard oneself as\/to acknowledge (sth in relation to oneself)\/to resign oneself to"],"pinyin":["zi4 ren4"],"word":"自認"},{"definition":["to assert\/to claim"],"pinyin":["xuan1 cheng1"],"word":"宣稱"},{"definition":["to think (i.e. to take it to be true that ...) (Usually there is an implication that the notion is mistaken – except when expressing one's own current opinion.)"],"pinyin":["yi3 wei2"],"word":"以為"},{"definition":["so-called\/what is called"],"pinyin":["suo3 wei4"],"word":"所謂"},{"definition":["false\/fake\/forged\/bogus\/(prefix) pseudo-\/Taiwan pr. [wei4]"],"pinyin":["wei3"],"word":"偽"},{"definition":["to expound Buddhist teachings","way of speaking\/wording\/formulation\/one's version (of events)\/statement\/theory\/hypothesis\/interpretation"],"pinyin":["shuo1 fa3","shuo1 fa5"],"word":"說法"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"},{"definition":["to doubt (sth)\/to be skeptical of\/to have one's doubts\/to harbor suspicions\/to suspect that"],"pinyin":["huai2 yi2"],"word":"懷疑"},{"definition":["to call\/to address as\/appellation"],"pinyin":["cheng1 hu5"],"word":"稱呼"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["explanation\/to explain\/to interpret\/to resolve\/CL:個|个[ge4]"],"pinyin":["jie3 shi4"],"word":"解釋"},{"definition":["official (in an organization or government)\/administrator"],"pinyin":["guan1 yuan2"],"word":"官員"},{"definition":["to admit\/to concede\/to recognize\/recognition (diplomatic, artistic etc)\/to acknowledge"],"pinyin":["cheng2 ren4"],"word":"承認"},{"definition":["(it's) no wonder (that...)\/(it's) not surprising (that)"],"pinyin":["nan2 guai4"],"word":"難怪"}]}