{"definition":["spontaneous"],"pinyin":["zi4 fa1"],"simplified":["自发"],"rank":7081.0,"normalized_rank":0.0990723769815175,"fraction":0.000014487695555539318,"cumulative_fraction":0.8977011944462967,"word":"自發","characters":[{"definition":["self\/oneself\/from\/since\/naturally\/surely"],"pinyin":["zi4"],"word":"自"},{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"}],"containing_words":[{"definition":["(to act) on one's own initiative"],"pinyin":["zi4 dong4 zi4 fa1"],"word":"自動自發"},{"definition":["spontaneous symmetry breaking (physics)"],"pinyin":["zi4 fa1 dui4 chen4 po4 que1"],"word":"自發對稱破缺"},{"definition":["self-rising flour"],"pinyin":["zi4 fa1 fen3"],"word":"自發粉"},{"definition":["electroencephalogram (EEG)"],"pinyin":["zi4 fa1 dian4 wei4"],"word":"自發電位"}],"sentences":[{"english":"Spontanous subarachnoid hemorrhage ( SAH) mostly arises from rupture and bleeding of intracranial aneurysms.","chinese":"自發性蛛網膜下腔出血多是由於顱內動脈瘤破裂引起。"},{"english":"Thermodynamic parameters depict the endothermic nature of adsorption and the process is spontaneous.","chinese":"熱力學參數表明，吸附過程是自發的和吸熱的。"},{"english":"In other words, learning spontaneously is one of man's unique traits.","chinese":"換言之，自動自發的學習是人類的獨特性質之一。"},{"english":"Independent, enthusiastic, self-initiating, self-motivated & able to perform under pressure.","chinese":"獨立，態度積極，自發與能在壓力下執行任務。"},{"english":"The method that is used in controling spontaneous emission of a two-level or three-level atom in this paper.","chinese":"這篇論文研究了一種控制多能級原子自發輻射的方法。"},{"english":"Gorbachev called for decollectivization from above; China’s farmers decollectivized spontaneously from below.","chinese":"而中國農民去集體化是從底層自發的。"},{"english":"The solar system is part of one of such self generating cosmic exertions .","chinese":"太陽系是這些自發的宇宙運轉活動中的一部分。"},{"english":"During the rounding process spontaneous contractions stopped and microtubules and myofibrils depolymerized.","chinese":"在變圓過程中微管及肌原纖維解聚，自發性收縮停止。"},{"english":"For the purpose of fighting against the foreign invasion, they organized spontaneously an army composed of volunteers.","chinese":"爲了抗擊外國的侵略，他們自發組成志願軍。"},{"english":"Methods Clinical data of 9 cases of SRR were analyzed retrospectively.","chinese":"方法回顧分析本院9例自發性腎破裂的臨牀資料。"},{"english":"Objective To summarize the experience of treat spontaneous pneumothorax by thoracoscope operation.","chinese":"目的總結電視胸腔鏡下治療自發性氣胸的體會。"},{"english":"Self-efficacy is a key component of personal empowerment.","chinese":"自發自覺的意識是個人賦權的關鍵因素。"},{"english":"Also because the aspirin may suppress the spontaneous ear sound launch.","chinese":"又因爲阿斯匹林可以抑制自發性耳聲發射。"},{"english":"Article 50 These rules shall come into effect from the day they are promulgated.","chinese":"第五十條本實施細則自發布之日起施行。"},{"english":"That tells us whether the change is spontaneous.","chinese":"這可以告訴我們變化是否是自發的。"},{"english":"The mutations appear to occur sporadically and spontaneously.","chinese":"變異似是偶發和自發的。"}],"related":[{"definition":["to originate\/to initiate\/to launch (an attack, an initiative etc)\/to start\/to propose sth (for the first time)"],"pinyin":["fa1 qi3"],"word":"發起"},{"definition":["group\/organization\/team\/CL:個|个[ge4]"],"pinyin":["tuan2 ti3"],"word":"團體"},{"definition":["to organize\/organization\/(biology) tissue\/(textiles) weave\/CL:個|个[ge4]"],"pinyin":["zu3 zhi1"],"word":"組織"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["in turn\/successively\/one after the other\/bit by bit"],"pinyin":["lu4 xu4"],"word":"陸續"},{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"word":"協助"},{"definition":["for this reason\/with regards to this\/in this respect\/in order to do this\/to this end"],"pinyin":["wei4 ci3"],"word":"為此"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to pass through\/to penetrate\/by means of\/via"],"pinyin":["tou4 guo4"],"word":"透過"},{"definition":["to encourage"],"pinyin":["gu3 li4"],"word":"鼓勵"},{"definition":["community\/neighborhood"],"pinyin":["she4 qu1"],"word":"社區"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"},{"definition":["to extend\/to spread\/to popularize\/generalization\/promotion (of a product etc)"],"pinyin":["tui1 guang3"],"word":"推廣"},{"definition":["to open\/to start (a business etc)\/to set up"],"pinyin":["kai1 ban4"],"word":"開辦"},{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge"],"pinyin":["bing4"],"word":"並"},{"definition":["to participate (in sth)"],"pinyin":["can1 yu4"],"word":"參與"}]}