{"definition":["to recommend oneself (for a job)"],"pinyin":["zi4 jian4"],"simplified":["自荐"],"rank":24099.0,"normalized_rank":0.3371762763561065,"fraction":0.0000016088194256453544,"cumulative_fraction":0.9828986510898406,"word":"自薦","characters":[{"definition":["self\/oneself\/from\/since\/naturally\/surely"],"pinyin":["zi4"],"word":"自"},{"definition":["to recommend\/to offer sacrifice (arch.)\/grass\/straw mat"],"pinyin":["jian4"],"word":"薦"}],"containing_words":[{"definition":["Mao Sui recommends himself (idiom); to offer one's services (in the style of Mao Sui offering his services to king of Chu 楚 of the Warring states)"],"pinyin":["Mao2 Sui4 zi4 jian4"],"word":"毛遂自薦"}],"sentences":[{"english":"I fully expected one of the women to volunteer6, as was usually the case.","chinese":"我滿心指望像平常一樣，某位女士能毛遂自薦。"},{"english":"Do you shrink from doing anything that smacks of self-promotion?","chinese":"帶有自薦意味的事情會讓你退縮嗎？"},{"english":"He offers up his services to finish the operation.","chinese":"他毛遂自薦來完成這個行動計劃。"},{"english":"Applicants whose personal statements are submitted in both Korean and English receive precedent.","chinese":"曾有申請學生遞交過韓英雙語之自薦個人陳述的先例。"},{"english":"Thank you to take time to browse me to recommend letter in 100 favours first.","chinese":"起首感激您在百忙之中抽暇閱讀本人地自薦信。"},{"english":"Ask if you can help be a source for other stories.","chinese":"如果其它報道你能提供新聞線索，不妨自薦。"},{"english":"Li Yugang proposed to the boss that he could finish the show for her.","chinese":"李玉剛向他的老闆自薦說他可以完成女聲部分。"},{"english":"Thank you for opening up the introductory letter which read me in the midst of pressing affairs.","chinese":"感謝您在百忙之中展閱我的自薦信。"},{"english":"Extremely thank you in to be very busy can scrutinize me to offer to volunteer the book.","chinese":"十分感激您在百忙中能核閱本人的自薦書。"},{"english":"Finally, thank you to scrutinize me once more to offer to volunteer the material.","chinese":"最後，再次感激您核閱本人的自薦資料。"},{"english":"A cover letter typically accompanies each resume you send out.","chinese":"每封自薦信都是隨着簡歷一起寄出的。"},{"english":"We have the pleasure of introducing ourselves to your as a state-operated corporation dealing exclusively in light industrial goods.","chinese":"我們有幸自薦，我們是一家專營輕工業品的有限公司。"},{"english":"Thank you in 100 favours the exhibition read I recommend the letter.","chinese":"感謝您在百忙之中展閱我的自薦信。"},{"english":"Use standard cover letter protocol.","chinese":"採用標準的自薦信格式。"},{"english":"It is unadvisable to put yourself up for the chairman's seat.","chinese":"你自薦當選主席是不明智的。"},{"english":"This might have been established because of the excellence of your CV and covering letter.","chinese":"對方可能是根據你的簡歷及自薦書確定你的能力。"}],"related":[{"definition":["to lobby\/to campaign\/to promote (an idea, a product)\/(old) to visit various rulers and promote one's political ideas (in the Warring States period)"],"pinyin":["you2 shui4"],"word":"遊說"},{"definition":["to recommend sb\/to give a referral"],"pinyin":["yin3 jian4"],"word":"引薦"},{"definition":["to take the opportunity\/to take a plane"],"pinyin":["cheng2 ji1"],"word":"乘機"},{"definition":["to rope in\/fig. to involve sb\/to entice"],"pinyin":["la1 long3"],"word":"拉攏"},{"definition":["to talk from one's personal experience\/to use oneself as an example"],"pinyin":["xian4 shen1 shuo1 fa3"],"word":"現身說法"},{"definition":["roll call\/to mention sb by name\/(to call or praise or criticize sb) by name"],"pinyin":["dian3 ming2"],"word":"點名"},{"definition":["conspiracy\/secret plan\/to conspire"],"pinyin":["mi4 mou2"],"word":"密謀"},{"definition":["to agree (to do sth)\/to promise"],"pinyin":["ying4 cheng2"],"word":"應承"},{"definition":["to fight in one place after another"],"pinyin":["zhuan3 zhan4"],"word":"轉戰"},{"definition":["to fail to be chosen (or elected)\/to lose an election"],"pinyin":["luo4 xuan3"],"word":"落選"},{"definition":["to pass on a story\/to communicate a message"],"pinyin":["chuan2 hua4"],"word":"傳話"},{"definition":["visitor\/guest\/object (in grammar)"],"pinyin":["bin1"],"word":"賓"},{"definition":["to sneer at sb\/to ridicule"],"pinyin":["chi3 xiao4"],"word":"恥笑"},{"definition":["to pull strings\/to manipulate (a puppet)\/to control from behind the scene\/to mediate"],"pinyin":["qian1 xian4"],"word":"牽線"},{"definition":["to appreciate\/to recognize the worth of sth\/appreciation"],"pinyin":["shang3 shi2"],"word":"賞識"},{"definition":["to avoid the important and dwell on the trivial\/to keep silent about major charges while admitting minor ones"],"pinyin":["bi4 zhong4 jiu4 qing1"],"word":"避重就輕"}]}