{"definition":["top-down"],"pinyin":["zi4 ding3 xiang4 xia4"],"simplified":["自顶向下"],"rank":69086.0,"normalized_rank":0.9666027730751472,"fraction":4.671284059581829e-9,"cumulative_fraction":0.9999930351154536,"word":"自頂向下","characters":[{"definition":["self\/oneself\/from\/since\/naturally\/surely"],"pinyin":["zi4"],"word":"自"},{"definition":["apex\/crown of the head\/top\/roof\/most\/to carry on the head\/to push to the top\/to go against\/to replace\/to substitute\/to be subjected to (an aerial bombing, hailstorm etc)\/(slang) to \"bump\" a forum thread to raise its profile\/classifier for headwear, hats, veils etc"],"pinyin":["ding3"],"word":"頂"},{"definition":["surname Xiang","towards\/to face\/to turn towards\/direction\/to support\/to side with\/shortly before\/formerly\/always\/all along\/(suffix) suitable for ...\/oriented to ..."],"pinyin":["Xiang4","xiang4"],"word":"向"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[{"english":"A grading and styling design of garment pattern pieces is described in a top-down way.","chinese":"介紹服裝樣片分類和款式的自頂向下設計方法。"},{"english":"The top-down management support should not be confused with the rollout approach.","chinese":"自頂向下的管理支持不應該與鋪展過程相混淆。"},{"english":"You could also embed the sideway approach within the top-down or bottom-up approach.","chinese":"您也可以在自頂向下或自底向上方法中嵌入旁路方法。"},{"english":"And top-down, means problem to architecture to solution.","chinese":"自頂向下，意味着從問題，到架構，再到解決方案。"},{"english":"The top-down inductive program synthesis is based on the method of identification by enumeration.","chinese":"自頂向下的歸納程序綜合基於枚舉識認方法。"},{"english":"However, it is rare for an architecture to be totally driven from the top down.","chinese":"然而，很少有體系架構是完完全全的自頂向下的。"},{"english":"The top-down approach is to implement the data warehouse in a single project phase.","chinese":"自頂向下的方法就是在單個項目階段中實現數據倉庫。"},{"english":"They also agree the top-down approach requires much more business involvement.","chinese":"他們也認同自頂向下的方法需要更多業務的介入。"},{"english":"Visit the Top down application development feature.","chinese":"訪問自頂向下應用程序開發特性。"},{"english":"The example in this article follows a top-down approach.","chinese":"本文中的示例遵循自頂向下的方法。"},{"english":"The final results of the query are then pulled from the top.","chinese":"隨後自頂向下地提取本查詢的最終結果。"},{"english":"Now, let's take a look at the top-down approach from a logical perspective.","chinese":"現在，讓我們從邏輯的角度來研究自頂向下方法。"}],"related":[]}