{"definition":["volunteer"],"pinyin":["zi4 yuan4 zhe3"],"simplified":["自愿者"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"自願者","characters":[{"definition":["self\/oneself\/from\/since\/naturally\/surely"],"pinyin":["zi4"],"word":"自"},{"definition":["to hope\/to wish\/to desire\/hoped-for\/ready\/willing"],"pinyin":["yuan4"],"word":"願"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"Lauren asked a bone-tired volunteer. The man shook his head.","chinese":"勞倫斯問一個累得筋疲力盡的自願者，那人搖了搖頭。"},{"english":"Tots also turned into avid volunteers.","chinese":"小孩們也成爲熱心的自願者。"},{"english":"They divided the volunteers into five groups, called quintiles.","chinese":"他們將自願者共分爲5個大組，並進行對比試驗。"},{"english":"You have come here voluntarily to this blue green jewel and you have incarnated into the physical tenacities of flesh.","chinese":"們原本是自願者來到這藍綠星球，轉生物理的。"},{"english":"So one way to make the transition a little easier is to volunteer.","chinese":"因此，轉變稍微容易一些的一個途徑是做自願者。"},{"english":"Volunteer at your local animal shelter to take the dogs for a walk.","chinese":"在當地動物救助站當自願者，帶着狗出去散步。"},{"english":"Non-profit organizations are reporting record numbers of new volunteers.","chinese":"非營利機構正報道新自願者的人數。"},{"english":"The blue is refugee camps these volunteers had spotted from the air.","chinese":"藍色的是那些自願者從空中發現的難民營。"},{"english":"In my university years, I volunteered to teach in rural schools.","chinese":"我上大學時，以自願者的身份前往農村地區教書。"}],"related":[]}