{"definition":["ozone layer"],"pinyin":["chou4 yang3 ceng2"],"simplified":["臭氧层"],"rank":29048.0,"normalized_rank":0.40641920725308855,"fraction":0.0000010241790300633164,"cumulative_fraction":0.9893074068472856,"word":"臭氧層","characters":[{"definition":["sense of smell\/smell bad","stench\/smelly\/to smell (bad)\/repulsive\/loathsome\/terrible\/bad\/severely\/ruthlessly\/dud (ammunition)"],"pinyin":["chou4","xiu4"],"word":"臭"},{"definition":["oxygen (chemistry)"],"pinyin":["yang3"],"word":"氧"},{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"層"}],"containing_words":[],"sentences":[{"english":"Climate change and the depleted ozone layer are among the starkest examples.","chinese":"氣候變化和臭氧層耗減就是其中最明顯的例子。"},{"english":"The intensity of near-earth ultraviolet(UV)radiation is increasing with the spoilage of ozone layer.","chinese":"由於臭氧層損耗，使地球表面的紫外線輻射量增加。"},{"english":"'Nothing's wrong with he satellite, ' Kiah answered quietly. 'It's AOL.","chinese":"“衛星沒問題，”凱平靜地回答，“是人工臭氧層。”"},{"english":"Climate change is bringing mixed news to the ozone layer.","chinese":"氣候變化帶給臭氧層的消息是喜憂摻半的。"},{"english":"You don't know how to fix the holes in our ozone layer.","chinese":"你們不知道該如何填補臭氧層的破洞吧？"},{"english":"The size and shape of the ozone hole is shown in 2009.","chinese":"這幅圖片上的陰影顯示的是2009年的臭氧層空洞。"},{"english":"Avoid using ozone destructive substances as cleaning agents for protecting global environment.","chinese":"避免使用破壞臭氧層的清洗劑以保護環境。"},{"english":"Curbing nitrous oxide emissions would enhance the ozone layer's recovery.","chinese":"抑制氧化亞氮的排放將會促進臭氧層的恢復。"},{"english":"But man-made nitrous oxide is now the elephant in the room among ozone-depleting substances.","chinese":"但人爲的一氧化二氮現在成了主要的臭氧層破壞物質。"},{"english":"And you end up with the destruction of the ozone layer.","chinese":"最終臭氧層被破壞。"},{"english":"The clouds form surfaces where chemical reactions can take place that produce ozone-destroying molecules.","chinese":"在這種雲表面化學反應會產生一種破壞臭氧層的分子。"},{"english":"Methyl bromide is one of the most widely used fumigants in the world and is one of ozone-depleting substances.","chinese":"甲基溴是一種多用途的廣譜熏蒸劑和消耗臭氧層物質。"},{"english":"She is so fat, they're going to use her to fill that hole in the ozone layer.","chinese":"她太胖樂，科學家們準備用她來填補臭氧層空洞。"},{"english":"CH4, with a net lifetime of 10 years, can also degrade the ozone layer.","chinese":"甲烷，雖然淨壽命只有10年，卻可以破壞臭氧層。"},{"english":"The ozone layer protects life on earth from harmful ultra-violet rays.","chinese":"臭氧層保護地球上的生命免受有害紫外線的輻射。"},{"english":"For ozone depletion, we don't use Freon -discharging products.","chinese":"對臭氧層破壞，我們不用要氟利昂的產品。"}],"related":[]}