{"definition":["desktop computer"],"pinyin":["tai2 shi4 ji1"],"simplified":["台式机"],"rank":11940.0,"normalized_rank":0.16705609111132874,"fraction":0.000006158504122051195,"cumulative_fraction":0.943552712447996,"word":"臺式機","characters":[{"definition":["Taiwan (abbr.)","platform\/stage\/terrace\/stand\/support\/station\/broadcasting station\/classifier for vehicles or machines"],"pinyin":["Tai2","tai2"],"word":"臺"},{"definition":["type\/form\/pattern\/style"],"pinyin":["shi4"],"word":"式"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[],"sentences":[{"english":"A typical desktop PC wastes nearly half the power it consumes.","chinese":"標準的臺式機僅消耗它耗費能源的一半。"},{"english":"Desktop or Gateway policy-based encryption and content filtering.","chinese":"基於臺式機或網關策略的加密及內容篩選。"},{"english":"Make one case for desktop systems and another for laptops.","chinese":"爲臺式機系列和筆記本分別制定統一機箱。"},{"english":"Do you want a table top system or mobile system?","chinese":"需要的是臺式機器還是可移動的麻醉機？"},{"english":"Use your laptop and hook that up, or your desktop machine.","chinese":"那就連到你的筆記本電腦上，或者臺式機也行。"},{"english":"Here's a wall of motherboards bearing the new chipsets on the desktop front.","chinese":"這裏的一整面牆的主機板軸承新的芯片在臺式機前。"},{"english":"Hand over your laptop, and take a desktop from IT.","chinese":"把你的筆記本電腦交上來，去領一臺臺式機吧。"},{"english":"For most desktops, high colour 16-bit depth is adequate.","chinese":"對於大多數臺式機，高彩色16位深度是足夠的。"},{"english":"Virtual machines provide a level of isolation I've never had on my own desktop.","chinese":"虛擬機提供了我的臺式機中所不具有的隔離級別。"},{"english":"Some mobile ads already make more money than desktop ads, said Google's chief financial officer, Patrick Pichette.","chinese":"一些移動廣告已經獲得了比臺式機廣告更多的收益。"},{"english":"A 17-inch model is better suited as a desktop replacement.","chinese":"一個17英寸的型號更適合用來作爲臺式機的替代品。"},{"english":"With desktops, there's a trade-off between size and price.","chinese":"對臺式機而言，尺寸和價格相互關聯。"}],"related":[]}