{"definition":["abreast of modern developments\/to keep up with the times\/progressive\/timely"],"pinyin":["yu3 shi2 ju4 jin4"],"simplified":["与时俱进"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"與時俱進","characters":[{"definition":["and\/to give\/together with","to take part in","variant of 歟|欤[yu2]"],"pinyin":["yu2","yu3","yu4"],"word":"與"},{"definition":["o'clock\/time\/when\/hour\/season\/period","surname Shi"],"pinyin":["Shi2","shi2"],"word":"時"},{"definition":["entirely\/without exception\/(literary) to be together\/to be alike"],"pinyin":["ju4"],"word":"俱"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[],"sentences":[{"english":"Keeping up with the times is the most prominent hallmark of the new period.","chinese":"新時期最突出的標誌是與時俱進。"},{"english":"Every year, the show will release the new season and the stories keep pace with the time.","chinese":"每年，該節目會播出新季，故事也會與時俱進。"},{"english":"The Western broadcasters contend they have simply moved with the times.","chinese":"但西方廣播界爭辨說他們只是“與時俱進”而已。"},{"english":"The company advocates the philosophy of \"people-oriented, moving forward with times, innovation and development\".","chinese":"公司崇尚“以人爲本”，與時俱進，開拓創新。"},{"english":"Construction Project Budgeting and Final Accounting Specialty should undergo reforms.","chinese":"基建工程預決算專業的教學改革應與時俱進。"},{"english":"The views of the Three Generation Leading Group share the same root and keep pace with times.","chinese":"三代中央領導集體的發展觀既一脈相承，又與時俱進。"},{"english":"Dinggu Enterprise is ready to keep pace with the times, and create a wonderful future together with people of aall circles.","chinese":"頂固企業願與社會各界人士與時俱進，共創美好將來。"},{"english":"They just couldn't keep it up, Anne.","chinese":"她們不能讓它保持與時俱進，安妮。"},{"english":"The people who advance with times is advisability.","chinese":"與時俱進的人才是明智的人。"},{"english":"It really was just,  even as a physical object, all bound up with the politics of its moment.","chinese":"這樣看來，她的想法在當時的確與時俱進。"},{"english":"In demand of being a party affairs worker, we need to update our idea and keep up with the times.","chinese":"更新觀念，與時俱進，是時代賦予黨務工作者的要求。"},{"english":"This kind of system requires keeping up with the times.","chinese":"這種體系需要保持與時俱進。"},{"english":"Attention should be given to hearing courses, with the hearing without textbooks is infeasible.","chinese":"要重視聽力課程，沒有與時俱進的聽力課本是不行的。"},{"english":"Faced with the new situation, Party building among university students must keep pace with the times.","chinese":"面對新形勢，高校學生黨建工作必須與時俱進。"},{"english":"It is required to keep pace with the time and improve fire fighting.","chinese":"與時俱進做好消防工作是新時期的新要求。"},{"english":"Professor Wang Ning believes that the standard of Chinese characters should be updated with time.","chinese":"王寧教授相信，中國漢字標準應該與時俱進。"}],"related":[{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["to comply\/to conform to\/in tune with\/adapting to\/to adjust to"],"pinyin":["shun4 ying4"],"word":"順應"},{"definition":["to appeal\/to demand (an answer)\/requirement\/demand\/claim\/appeal\/(marketing) message"],"pinyin":["su4 qiu2"],"word":"訴求"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["active\/energetic\/vigorous\/positive (outlook)\/proactive"],"pinyin":["ji1 ji2"],"word":"積極"},{"definition":["now\/nowadays\/modern"],"pinyin":["xian4 jin1"],"word":"現今"},{"definition":["to push out the old and bring in the new (idiom); to innovate"],"pinyin":["tui1 chen2 chu1 xin1"],"word":"推陳出新"},{"definition":["unceasing\/uninterrupted\/continuous\/constant"],"pinyin":["bu4 duan4"],"word":"不斷"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["in sequence, step by step (idiom); to make steady progress incrementally"],"pinyin":["xun2 xu4 jian4 jin4"],"word":"循序漸進"},{"definition":["tradition\/traditional\/convention\/conventional\/CL:個|个[ge4]"],"pinyin":["chuan2 tong3"],"word":"傳統"},{"definition":["progress\/improvement\/to improve\/to progress\/CL:個|个[ge4]"],"pinyin":["jin4 bu4"],"word":"進步"},{"definition":["to guide\/to lead (around)\/to conduct\/to boot\/introduction\/primer"],"pinyin":["yin3 dao3"],"word":"引導"},{"definition":["to develop\/to make full use of"],"pinyin":["fa1 yang2"],"word":"發揚"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰顯"},{"definition":["to cultivate\/to breed\/to foster\/to nurture\/to educate\/to groom (for a position)\/education\/fostering\/culture (biology)"],"pinyin":["pei2 yang3"],"word":"培養"}]}