{"definition":["to participate in a meeting"],"pinyin":["yu4 hui4"],"simplified":["与会"],"rank":5762.0,"normalized_rank":0.08061785569375847,"fraction":0.00001958888372622954,"cumulative_fraction":0.8754568641168571,"word":"與會","characters":[{"definition":["and\/to give\/together with","to take part in","variant of 歟|欤[yu2]"],"pinyin":["yu2","yu3","yu4"],"word":"與"},{"definition":["can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])","to balance an account\/accountancy\/accounting"],"pinyin":["hui4","kuai4"],"word":"會"}],"containing_words":[],"sentences":[{"english":"Those opinions and propositions were agreed upon and echoed by many participating leaders.","chinese":"這些觀點和主張得到許多與會領導人的贊同和呼應。"},{"english":"House and Senate conferees have struck a deal on the new farm bill.","chinese":"參衆兩院與會代表已就新的農業法案達成協議。"},{"english":"The ending was a kicker and it was generally a pretty good movie.","chinese":"結束是一個踢球者和與會者普遍一個不錯的電影。"},{"english":"African delegates said they hope to learn from Vietnam's agricultural example.","chinese":"非洲與會代表說，他們希望向越南的農業範例學習。"},{"english":"Attendees registering for the meeting crowded the lobby of the Moscone Center.","chinese":"茅斯考恩中心的大廳擠滿了正準備登記的與會者。"},{"english":"The King'n Trio entertained attendees with their folk songs and Rotary-themed lyrics.","chinese":"三重唱用他們的民歌和扶輪主題的歌曲來款待與會者。"},{"english":"About a thousand people attended the meeting.","chinese":"與會者蓋一千人。"},{"english":"Participants agreed to boost security and development in the central Asian nation.","chinese":"與會者同意加強阿富汗的安全及發展的工作。"},{"english":"Opening Ceremony was successfully held after the round trip of lion performance at the exhibition hall .","chinese":"開幕典禮在醒獅帶領與會者到展覽館繞場一週後完成。"},{"english":"Second, I will not tolerate abuse of our relationship with Member States.","chinese":"其次，我不能容忍濫用我們與會員國的關係。"},{"english":"The attendees mingled, exchanged calling cards and traded cameras for photographs.","chinese":"與會者交雜著，互相交換名片與相互拍照留念。"},{"english":"Municipal officials and representatives of the government-authorized labor union have also attended meetings of the workers’ council with management, workers said.","chinese":"中山官員與工會代表也一道與會。"},{"english":"Then she could take her seat on the Supreme Court when it meets in October.","chinese":"這樣在最高法院十月與會時，埃琳娜可以順利就任。"},{"english":"In the stock market, the participants are all motivated to buy low and sell high.","chinese":"在股票市場上，與會者都積極地低買高賣。"},{"english":"After this connection is established, it synchronizes with the rest of the meeting.","chinese":"連接建立之後，它與會議的其他部分進行同步。"},{"english":"Agile 2007 attendees can choose from more than 615 highly interactive sessions.","chinese":"有超過615個高度互動的課程讓與會者們選擇。"}],"related":[]}