{"definition":["prosperous and developing\/flourishing"],"pinyin":["xing1 wang4 fa1 da2"],"simplified":["兴旺发达"],"rank":32293.0,"normalized_rank":0.4518209673583031,"fraction":7.693020935623825e-7,"cumulative_fraction":0.9921972993583446,"word":"興旺發達","characters":[{"definition":["feeling or desire to do sth\/interest in sth\/excitement","surname Xing","to rise\/to flourish\/to become popular\/to start\/to encourage\/to get up\/(often used in the negative) to permit or allow (dialect)\/maybe (dialect)"],"pinyin":["Xing1","xing1","xing4"],"word":"興"},{"definition":["prosperous\/flourishing\/(of flowers) blooming\/(of fire) roaring"],"pinyin":["wang4"],"word":"旺"},{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"},{"definition":["surname Da","to attain\/to reach\/to amount to\/to communicate\/eminent"],"pinyin":["Da2","da2"],"word":"達"}],"containing_words":[],"sentences":[{"english":"Respectfully requests, and praying fathers come to enjoy the family size peace, prosperity.","chinese":"恭請祖宗降臨享用，並祈保合家大小平安，興旺發達。"},{"english":"The 16th Party Congress fully demonstrates that our Party is flourishing and has no lack of successors.","chinese":"黨的十六大充分表明我們黨興旺發達，後繼有人。"},{"english":"The 17th Party Congress fully demonstrates that our Party is flourishing and has no lack of successors.","chinese":"黨的十七大充分表明我們黨興旺發達，後繼有人。"},{"english":"The business would not thrive without good mangement.","chinese":"沒有良好的經營管理，事業就不會興旺發達。"},{"english":"The 12th Party congress fully demonstrates that our Party is flourishing and has no lack of successors.","chinese":"黨的十二大充分表明我們黨興旺發達，後繼有人。"},{"english":"What should the government do to make the country do to make the country successful and prosperous?","chinese":"政府該做什麼才能令國家興旺發達？"},{"english":"Market economy, Chinese culture card once again flourishing.","chinese":"市場經濟條件下，中華牌文化再次興旺發達。"},{"english":"Sticking to use people appropriately will have influence on flourishing of our party's cause.","chinese":"堅持正確的用人導向關係到黨的事業興旺發達。"},{"english":"The 16th Party congress fully demonstrates that our Patty is flourishing and has no lack of successors.","chinese":"黨的十六大充分表明我們黨興旺發達，後繼有人。"},{"english":"His firm will certainly grow and succeed.","chinese":"他的公司一定會興旺發達起來。"},{"english":"It is key for the prosperity of the Party and our country to train and select young cadres.","chinese":"培養和選拔年輕幹部是黨和國家興旺發達的關鍵。"},{"english":"Intelligence flourishes only in the ages when belief withers.","chinese":"只有在信仰凋敝的年代，智力纔會興旺發達。"},{"english":"More power to Your Excellency and your country.","chinese":"願總統閣下和你的國家更加興旺發達。"},{"english":"A business cannot thrive without good management。","chinese":"沒有良好的經營管理，事業就不會興旺發達。"},{"english":"I strongly believe that the United States can and will flourish from this competition.","chinese":"我堅信，美國可以而且必將通過這場競爭興旺發達。"},{"english":"The coal industry once flourished remarkably in the country.","chinese":"這個國家的煤炭工業一度很興旺發達。"}],"related":[{"definition":["to be at the highest level of enlightenment (Buddhist expression)"],"pinyin":["bai3 chi3 gan1 tou2"],"word":"百尺竿頭"},{"definition":["the hardships of beginning an undertaking (idiom)"],"pinyin":["bi4 lu4 lan2 lu:3"],"word":"篳路藍縷"},{"definition":["lit. to sleep on brushwood and taste gall (like King Gou Jian of Yue 勾踐|勾践[Gou1 Jian4]), in order to recall one's humiliations) (idiom)\/fig. to maintain one's resolve for revenge"],"pinyin":["wo4 xin1 chang2 dan3"],"word":"臥薪嘗膽"},{"definition":["to receive worldwide attention"],"pinyin":["ju3 shi4 zhu3 mu4"],"word":"舉世矚目"},{"definition":["anger against a common enemy (idiom); joined in opposition to the same adversary"],"pinyin":["tong2 chou2 di2 kai4"],"word":"同仇敵愾"},{"definition":["to get rid of the old to bring in the new (idiom); to innovate"],"pinyin":["chu2 jiu4 bu4 xin1"],"word":"除舊布新"},{"definition":["commodity economy"],"pinyin":["shang1 pin3 jing1 ji4"],"word":"商品經濟"},{"definition":["to help the poor\/almsgiving for the needy\/to assist poor households or poor regions"],"pinyin":["fu2 pin2 ji4 kun4"],"word":"扶貧濟困"},{"definition":["see 念念不忘[nian4 nian4 bu4 wang4]"],"pinyin":["nian4 zi1 zai4 zi1"],"word":"念茲在茲"},{"definition":["to judge the hour and size up the situation\/to take stock"],"pinyin":["shen3 shi2 duo2 shi4"],"word":"審時度勢"},{"definition":["(abbr. for 嘗試錯誤|尝试错误) trial and error\/failure"],"pinyin":["shi4 cuo4"],"word":"試錯"},{"definition":["It takes ten years to nurture a tree, but a hundred years to train a man (idiom)\/fig. a good education program takes a long time to develop\/cf. 十年樹木，百年樹人|十年树木，百年树人"],"pinyin":["bai3 nian2 shu4 ren2"],"word":"百年樹人"},{"definition":["highest common factor HCF\/greatest common divisor GCD"],"pinyin":["zui4 da4 gong1 yue1 shu4"],"word":"最大公約數"},{"definition":["civil society"],"pinyin":["gong1 min2 she4 hui4"],"word":"公民社會"},{"definition":["economic prosperity"],"pinyin":["jing1 ji4 fan2 rong2"],"word":"經濟繁榮"},{"definition":["foothold"],"pinyin":["li4 zu2 dian3"],"word":"立足點"}]}