{"definition":["in former times\/the olden days"],"pinyin":["jiu4 shi2"],"simplified":["旧时"],"rank":24281.0,"normalized_rank":0.3397226924852741,"fraction":0.0000015847331172131357,"cumulative_fraction":0.9831893623222284,"word":"舊時","characters":[{"definition":["old\/opposite: new 新\/former\/worn (with age)"],"pinyin":["jiu4"],"word":"舊"},{"definition":["o'clock\/time\/when\/hour\/season\/period","surname Shi"],"pinyin":["Shi2","shi2"],"word":"時"}],"containing_words":[{"definition":["former times\/the olden days"],"pinyin":["jiu4 shi2 dai4"],"word":"舊時代"}],"sentences":[{"english":"He must be permitted to speak of that Paris as though it still existed.","chinese":"請允許他談那舊時的巴黎，好象它現在仍然存在一樣。"},{"english":"I'm only paying back on old debt of thankfulness.","chinese":"我覺得我只是在償還這份舊時的人情債。"},{"english":"All her lovely companions are faded and gone;","chinese":"所有可愛的伴侶，無復舊時容。"},{"english":"It is impossible for him to drag the modern society back to the horse-and-buggy era.","chinese":"他要想把現代社會拉向舊時代，那是不可能的。"},{"english":"Working is like old-time marriage, obviously you got no happiness, but still you have to live with it.","chinese":"上班就像舊時代的婚姻，明明不幸福，還得長相廝守。"},{"english":"And where the road bends a small bridge is suddenly seen.","chinese":"舊時茅店社林邊，路轉溪橋忽見。"},{"english":"From the ashes of the old times a new world will arise.","chinese":"新世界將從舊時代的灰燼中華麗誕生。"},{"english":"The old days of corporate beneficence and loyalty to longtime employees are long gone.","chinese":"舊時企業對老員工的關懷和忠誠早就煙飛雲滅了。"},{"english":"Pinchgut is now a museum for cannon and antique mat è riel.","chinese":"品奇各特現在是大炮和舊時軍用裝備博物館。"},{"english":"In a reenactment scene, Khmer men working with stone grinding construction.","chinese":"舊時重現的現場，高棉人用石頭打磨建築。"},{"english":"In a reenactment scene, workers digging inside a canal.","chinese":"舊時重現的現場，人們在挖掘隧道。"},{"english":"And with the hot bats came some good old-fashioned excitement in the Bronx.","chinese":"還有，一些像是來自舊時代布隆克斯區的火熱支援。"},{"english":"The parlance pressed aforetime, ten inside art gallery arrive this comes to an end for the time being.","chinese":"按舊時的說法，十里畫廊到此告一段落。"},{"english":"They believed the nation was a \"new order for the ages.\"","chinese":"因爲奠基者們認爲，這個國家是“舊時代的新秩序”。"},{"english":"Most of the landlords in old China own a big mansion.","chinese":"大部分舊時中國的地主都有大的庭院。"},{"english":"They look at it as a natural passing from old age to senility .","chinese":"他們看看它作爲一個自然通過從舊時代到衰老。"}],"related":[]}