{"definition":["aviation science"],"pinyin":["hang2 kong1 xue2"],"simplified":["航空学"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"航空學","characters":[{"definition":["boat\/ship\/craft\/to navigate\/to sail\/to fly"],"pinyin":["hang2"],"word":"航"},{"definition":["empty\/air\/sky\/in vain","to empty\/vacant\/unoccupied\/space\/leisure\/free time"],"pinyin":["kong1","kong4"],"word":"空"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[{"definition":["Beijing Aeronautical and Astronautical Institute (abbr. to 北航院)"],"pinyin":["Bei3 jing1 Hang2 kong1 Xue2 yuan4"],"word":"北京航空學院"}],"sentences":[{"english":"Advanced Aeronautics booster color changes for Apollo and Carrier Drones.","chinese":"先進航空學將會改變阿波羅和艦載機的加速器顏色。"},{"english":"He devoted every spare moment to aeronautics.","chinese":"他把他所有多餘的時間用在航空學上。"},{"english":"Pai Ch'ung-hsi then took over as principal of the aviation academy and as commander of the air force.","chinese":"隨後白崇禧作爲空軍司令員和航空學院校長接管空軍。"},{"english":"At present, the management system has been used in Nanjing Aeronautical Institut…","chinese":"該系統已在南京航空學院財務部門使用，效果良好。"},{"english":"At present, the management system has been used in Nanjing Aeronautical Institute and satisfactory results, have been obtained.","chinese":"該系統已在南京航空學院財務部門使用，效果良好。"},{"english":"They were pilots in the early days of aviation.","chinese":"萊特兄弟是航空學先驅。"},{"english":"Pilots of large aircraft are masters of aviation.","chinese":"大型飛行器的駕駛員是航空學方面的專家。"},{"english":"Aeronautics enables us to overcome great distances.","chinese":"航空學使我們能征服遠距離。"},{"english":"A 'concept' is a group of aeronautical features, which are logically linked together.","chinese":"一個“概念”就是一組邏輯相互關聯的航空學特性。"},{"english":"My uncle was studying aeronautics at Queensland University.","chinese":"我叔叔當時正在昆士蘭大學學習航空學。"},{"english":"Aviation is a subject that challenges one's encourage.","chinese":"航空學是一門挑戰人的勇氣的學科。"},{"english":"Wright brothers were pioneers in aviation.","chinese":"萊特兄弟是航空學先驅。"},{"english":"Mr. Li Yongfa, Professor, the First Aviation University of Air Force.","chinese":"李永法，教授，空軍第一航空學院。"}],"related":[]}