{"definition":["wake (of ship)\/flight path"],"pinyin":["hang2 ji4"],"simplified":["航迹"],"rank":47973.0,"normalized_rank":0.671204510794286,"fraction":1.7809270477155727e-7,"cumulative_fraction":0.9986342521541928,"word":"航跡","characters":[{"definition":["boat\/ship\/craft\/to navigate\/to sail\/to fly"],"pinyin":["hang2"],"word":"航"},{"definition":["footprint\/mark\/trace\/vestige\/sign\/indication\/Taiwan pr. [ji1]"],"pinyin":["ji4"],"word":"跡"}],"containing_words":[],"sentences":[{"english":"Your track is diverging from reference line.","chinese":"你船的航跡和參照線不平行。"},{"english":"The perfect very low penetration route can be developed by heuristic research method.","chinese":"並利用逐級搜索法決策出理想的飛機超低空突防航跡。"},{"english":"A contrail is the visible vapor trail behind airplanes or rockets traveling at high altitudes.","chinese":"這團痕跡可能是飛機或火箭飛上高空後留下的航跡雲。"},{"english":"In chapter 5, distributed track-to-track fusion algorithms are discussed.","chinese":"第五章研究分佈式航跡融合算法。"},{"english":"Track initialization is an important problem in multi-target track processing.","chinese":"航跡起始是多目標航跡處理中的重要問題。"},{"english":"Track initialization is an important problem in multi-target track processing.","chinese":"航跡起始是多目標航跡處理中的重要問題。"},{"english":"Then, the geometric relation between the mapped area and the flight path of the antenna is determined.","chinese":"分析了成像區位置與載機航跡的幾何關係。"},{"english":"Alter course for next leg of track now.","chinese":"如今轉向進進下一個航跡區內。"},{"english":"Route planning is an up-to-date technique for the very low altitude penetration.","chinese":"航跡規劃是新一代的超低空突防技術。"},{"english":"Request permission to divert20 miles right of track to avoid the thunderstorm( build-ups).","chinese":"請求向航跡右面改20海里避開雷雨。"},{"english":"The track control strategies contain both direct approach and indirect approach.","chinese":"航跡控制可分爲直接法與間接法兩種。"},{"english":"We just saw the foaming white wake of the liner.","chinese":"w我們只看到班輪駛過留下的白沫翻騰的航跡。"},{"english":"A boat wake cuts across one of the oil packets at image top right.","chinese":"在圖像的右上角，一條船舶航跡徑直穿過一片浮油帶。"},{"english":"You are right of track.","chinese":"你在航跡的右面。"},{"english":"Your track is converging to reference line.","chinese":"你船的航跡正與參照線相交一點。"},{"english":"When the ship sailed, the foaming white wake of the liner was left.","chinese":"輪船駛過，留下了白沫翻騰的航跡。"}],"related":[]}