{"definition":["ship-based"],"pinyin":["jian4 zai4"],"simplified":["舰载"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"艦載","characters":[{"definition":["warship"],"pinyin":["jian4"],"word":"艦"},{"definition":["to carry\/to convey\/to load\/to hold\/to fill up\/and\/also\/as well as\/simultaneously","to record in writing\/to carry (i.e. publish in a newspaper etc)\/Taiwan pr. [zai4]\/year"],"pinyin":["zai3","zai4"],"word":"載"}],"containing_words":[{"definition":["carrier-based aircraft"],"pinyin":["jian4 zai4 ji1"],"word":"艦載機"}],"sentences":[{"english":"Advanced Aeronautics booster color changes for Apollo and Carrier Drones.","chinese":"先進航空學將會改變阿波羅和艦載機的加速器顏色。"},{"english":"The cross location is the uppermost location mode for the ship-borne microwave OTH radar.","chinese":"交叉定位是艦載微波超視距雷達最主要的定位方式。"},{"english":"These will now be dealt with by sea-borne systems.","chinese":"據悉正被處理成由艦載系統發射的防禦導彈系統。"},{"english":"It's about the air wing and our Navy.","chinese":"這是艦載機聯隊以及我們海軍的任務。"},{"english":"This paper proposes a comprehensive mathematical model about operational effectiveness evaluation of shipborne electronic warfare system.","chinese":"本文提出了艦載電子對抗系統作戰效能綜合數學模型。"},{"english":"Battleship radar sets permit accurate night bombardment of enemy ships or shore installations.","chinese":"艦載雷達有助於對敵艦或海防設施進行準確的夜襲。"},{"english":"China's new Navy air ambulance helicopter Z-8JH flies over the Pacific Ocean.","chinese":"海軍新型醫療救護艦載直升機首飛太平洋。"},{"english":"A6E \"intruders\" carrier-based air defenses of paper drawings of the model 16, note 2.","chinese":"“入侵者”艦載攻擊機紙模型圖紙16張，說明2張。"},{"english":"Carrier Drones are now able to change targets, increased speed, tweaked damage.","chinese":"艦載機現在可以切換目標，增加速度，微調傷害。"},{"english":"The developing process of common-frame launch technology for carrier-based missile was introduced in this paper.","chinese":"介紹了艦載導彈共架發射技術的發展過程。"},{"english":"One plane, a marine F18, was lost in the raid.","chinese":"突襲行動中損失了一架F18艦載戰鬥機。"},{"english":"In this paper, the take-off path of sea-based aircraft was calculated.","chinese":"文中對艦載機的彈射起飛進行了仿真計算。"},{"english":"A general mathematical model of carrier - based aircraft ski jump take -off is derived based on tensor.","chinese":"基於張量推導建立了艦載機起飛過程的一般數學模型。"},{"english":"The fast-extension motion of the nose gear of the carrier-based aircraft is studied.","chinese":"研究了艦載機前起落架的突伸運動。"}],"related":[]}