{"definition":["virtuous cycle (i.e. positive feedback loop)"],"pinyin":["liang2 xing4 xun2 huan2"],"simplified":["良性循环"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"良性循環","characters":[{"definition":["good\/very\/very much"],"pinyin":["liang2"],"word":"良"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"},{"definition":["to follow\/to adhere to\/to abide by"],"pinyin":["xun2"],"word":"循"},{"definition":["ring\/hoop\/loop\/(chain) link\/classifier for scores in archery etc\/to surround\/to encircle\/to hem in","surname Huan"],"pinyin":["Huan2","huan2"],"word":"環"}],"containing_words":[],"sentences":[{"english":"So a benign cycle, makes, the scale benefits.","chinese":"以致形成良性循環，薄利多銷，向規模要效益。"},{"english":"It’s a virtuous circle.","chinese":"“這是一個良性循環”。"},{"english":"It forms a non-virtuous circle.","chinese":"形成一種非良性循環。"},{"english":"So that's a virtuous cycle.","chinese":"所以是個良性循環。"},{"english":"This virtuous circle was good for business and good for society.","chinese":"這種良性循環既有益於商業發展也有益於社會。"},{"english":"In most industries such a virtuous circle would be a cause for celebration.","chinese":"在大多數產業中，這樣的良性循環都是值得慶幸的事。"},{"english":"This is a virtuous circle of promotion, everybody taking part wins.","chinese":"這是一個相互促進的良性循環，參與者都是獲益方。"},{"english":"Objective To discover the operation model for EPIs beneficial cycle in a such a long time.","chinese":"目的探索計劃免疫可持續發展的良性循環的運作機制。"},{"english":"It is extremely important to form a good circulation in English teaching in class.","chinese":"在英語教學課堂教學中形成一個良性循環圈非常重要。"},{"english":"At present, the relationship between the population and the socioeconomics of Changshu is on the stage of benign circulation.","chinese":"目前常熟人口與社會經濟關係已步入良性循環階段。"},{"english":"The virtuous circle so much praised would be broken.","chinese":"這種被多加讚揚的良性循環將被打破。"}],"related":[]}