{"definition":["Hmong or Miao ethnic group of southwest China"],"pinyin":["Miao2 zu2"],"simplified":["苗族"],"rank":18077.0,"normalized_rank":0.25292068333496565,"fraction":0.0000029169249399551287,"cumulative_fraction":0.9697475637641628,"word":"苗族","characters":[{"definition":["Hmong or Miao ethnic group of southwest China\/surname Miao","sprout"],"pinyin":["Miao2","miao2"],"word":"苗"},{"definition":["race\/nationality\/ethnicity\/clan\/by extension, social group (e.g. office workers 上班族)"],"pinyin":["zu2"],"word":"族"}],"containing_words":[{"definition":["Xiangxi Tujia and Miao autonomous prefecture in northwest Hunan, capital Jishou 吉首"],"pinyin":["Xiang1 xi1 Tu3 jia1 zu2 Miao2 zu2 zi4 zhi4 zhou1"],"word":"湘西土家族苗族自治州"},{"definition":["Qiandongnan Miao and Dong autonomous prefecture in Guizhou, capital Kaili city 凱里市|凯里市"],"pinyin":["Qian2 dong1 nan2 Miao2 zu2 Dong4 zu2 zi4 zhi4 zhou1"],"word":"黔東南苗族侗族自治州"},{"definition":["Qianxinan Buyei and Miao autonomous prefecture in Guizhou, capital Xingyi city 興義市|兴义市"],"pinyin":["Qian2 xi1 nan2 Bu4 yi1 zu2 Miao2 zu2 zi4 zhi4 zhou1"],"word":"黔西南布依族苗族自治州"},{"definition":["Rongshui Miao Autonomous County in Liuzhou 柳州[Liu3 zhou1], Guangxi"],"pinyin":["Rong2 shui3 Miao2 zu2 Zi4 zhi4 xian4"],"word":"融水苗族自治縣"},{"definition":["Wenshan Zhuang and Miao autonomous prefecture in Yunnan 雲南|云南"],"pinyin":["Wen2 shan1 Zhuang4 zu2 Miao2 zu2 zi4 zhi4 zhou1"],"word":"文山壯族苗族自治州"},{"definition":["Enshi Tujia and Miao autonomous prefecture in Hubei"],"pinyin":["En1 shi1 Tu3 jia1 zu2 Miao2 zu2 zi4 zhi4 zhou1"],"word":"恩施土家族苗族自治州"},{"definition":["Qiannan Buyei and Miao autonomous prefecture in Guizhou, capital Duyun city 都勻市"],"pinyin":["Qian2 nan2 Bu4 yi1 zu2 Miao2 zu2 zi4 zhi4 zhou1"],"word":"黔南布依族苗族自治州"},{"definition":["Baoting Li and Miao autonomous county, Hainan"],"pinyin":["Bao3 ting2 Li2 zu2 Miao2 zu2 Zi4 zhi4 xian4"],"word":"保亭黎族苗族自治縣"},{"definition":["Qiongzhong Li and Miao autonomous county, Hainan"],"pinyin":["Qiong2 zhong1 Li2 zu2 Miao2 zu2 Zi4 zhi4 xian4"],"word":"瓊中黎族苗族自治縣"},{"definition":["Luquan Yi and Miao autonomous county in Kunming 昆明[Kun1 ming2], Yunnan"],"pinyin":["Lu4 quan4 Yi2 zu2 Miao2 zu2 Zi4 zhi4 xian4"],"word":"祿勸彞族苗族自治縣"},{"definition":["Mayang Miao autonomous county in Huaihua 懷化|怀化[Huai2 hua4], Hunan"],"pinyin":["Ma2 yang2 Miao2 zu2 Zi4 zhi4 xian4"],"word":"麻陽苗族自治縣"},{"definition":["Weining Yi, Hui and Miao autonomous county in Bijie prefecture 畢節地區|毕节地区[Bi4 jie2 di4 qu1], Guizhou"],"pinyin":["Wei1 ning2 Yi2 zu2 Hui2 zu2 Miao2 zu2 Zi4 zhi4 xian4"],"word":"威寧彞族回族苗族自治縣"},{"definition":["Chengbu Miao Autonomous County in Shaoyang 邵陽|邵阳[Shao4 yang2], Hunan"],"pinyin":["Cheng2 bu4 Miao2 zu2 Zi4 zhi4 xian4"],"word":"城步苗族自治縣"},{"definition":["Youyang Miao and Tujia autonomous county in Qianjiang suburbs of Chongqing municipality"],"pinyin":["You3 yang2 Tu3 jia1 zu2 Miao2 zu2 Zi4 zhi4 xian4"],"word":"酉陽土家族苗族自治縣"},{"definition":["Jinping Miao, Yao and Dai autonomous county in Honghe Hani and Yi autonomous prefecture 紅河哈尼族彞族自治州|红河哈尼族彝族自治州[Hong2 he2 Ha1 ni2 zu2 Yi2 zu2 Zi4 zhi4 zhou1], Yunnan"],"pinyin":["Jin1 ping2 Miao2 zu2 Yao2 zu2 Dai3 zu2 Zi4 zhi4 xian4"],"word":"金平苗族瑤族傣族自治縣"}],"sentences":[{"english":"Among ethnic groups, Bai , Bouyei and Miao people are also adept at embroidery.","chinese":"在民族，白族，布依族和苗族人還善於刺繡。"},{"english":"Abstract:The flying songs of Miao nationality have become one kind of code name and symbol of Miao nationality music.","chinese":"苗族飛歌成了苗族音樂的一種代號和象徵。"},{"english":"Abstract:The flying songs of Miao nationality have become one kind of code name and symbol of Miao nationality music.","chinese":"苗族飛歌成了苗族音樂的一種代號和象徵。"},{"english":"Furong Ancient Town Furong Town or Hibiscus Town is located Yongshun County of Western Hunan Tujia and Miao Autonomous Prefecture.","chinese":"芙蓉古鎮位於土家和苗族自治區西部的永順縣。"},{"english":"There are allegations the Hmong are not being properly cared for.","chinese":"這些都表明，苗族人並沒有受到公正的對待。"},{"english":"This village is populated by Khamu, Hmong and Lao Loom people.","chinese":"這個村莊是由Khamu，苗族，老撾織機人居住。"},{"english":"Why are they in attires?","chinese":"苗族盛裝何時穿戴？"},{"english":"Fenghuang is a habitat area of Chinese minorities, ethnic Miao and Tujia.","chinese":"鳳凰是土家族和苗族的居住區。"},{"english":"Therefore the recognition to the P. R. China is the highest recognition of Mongolian in Miao ethnic group.","chinese":"因此對中國國家的認同是苗族蒙人最高級的認同。"},{"english":"Thee Dragon-Boat Festival is the most important celebration of the Miao people, who live alongthe Qingshui Rwerin southeastem Guizhou Province.","chinese":"龍船節，是黔東南清水江上苗族人民最盛大的的節日。"},{"english":"The customs of Li and Miao Minority attract the tourists from both at home and abroad.","chinese":"黎苗族的風尚吸收了來自國內外的很多遊客。"},{"english":"The women from the Miao ethnic group dye their fabrics with natural colorants.","chinese":"苗族婦女用天然染色劑給她們的布料染色。"},{"english":"One of the New Year's celebration activities for the Miao nation(This photo and caption were submitted to My Shot.)","chinese":"苗族的一個新年慶祝活動。"},{"english":"Her name is Long Gan, Miao Tribe, twelve years old, second grade at Wen Xian Elementary School.","chinese":"她是龍根，苗族，今年十二歲，文賢三小二年級學生。"},{"english":"Ancient folk song and long poem are the most representative works of Hmong Folk Literature.","chinese":"苗族民間文學中最具代表性的是古歌與民間長詩。"},{"english":"She returned home and began to live among the ethnic Miao.","chinese":"她回到家鄉，開始和苗族人民生活在一起。"}],"related":[{"definition":["Yao ethnic group of southwest China and southeast Asia"],"pinyin":["Yao2 zu2"],"word":"瑤族"},{"definition":["Yi ethnic group"],"pinyin":["Yi2 zu2"],"word":"彞族"},{"definition":["Zhuang ethnic group of Guangxi, the PRC's second most numerous ethnic group"],"pinyin":["Zhuang4 zu2"],"word":"壯族"},{"definition":["Gelao or Klau ethnic group of Guizhou"],"pinyin":["Ge1 lao3 zu2"],"word":"仡佬族"},{"definition":["Maonan ethnic group of Guangxi"],"pinyin":["Mao2 nan2 zu2"],"word":"毛南族"},{"definition":["Tujia ethnic group of Hunan"],"pinyin":["Tu3 jia1 zu2"],"word":"土家族"},{"definition":["Buyei ethnic group"],"pinyin":["Bu4 yi1"],"word":"布依"},{"definition":["Mulao ethnic group of Guangxi"],"pinyin":["Mu4 lao3 zu2"],"word":"仫佬族"},{"definition":["Wa, Kawa or Va ethnic group of Myanmar, south China and southeast Asia"],"pinyin":["Wa3 zu2"],"word":"佤族"},{"definition":["Lisu ethnic group of Yunnan"],"pinyin":["Li4 su4 zu2"],"word":"傈僳族"},{"definition":["Hani ethnic group"],"pinyin":["Ha1 ni2 zu2"],"word":"哈尼族"},{"definition":["Jingpo ethnic group of Tibet and Yunnan"],"pinyin":["Jing3 po1 zu2"],"word":"景頗族"},{"definition":["Jinuo ethnic group"],"pinyin":["Ji1 nuo4 zu2"],"word":"基諾族"},{"definition":["Lahu ethnic group of Yunnan"],"pinyin":["La1 hu4 zu2"],"word":"拉祜族"},{"definition":["Pumi ethnic group"],"pinyin":["Pu3 mi3 zu2"],"word":"普米族"},{"definition":["see 苗族[Miao2 zu2]"],"pinyin":["Miao2 jia1"],"word":"苗家"}]}