{"definition":["to suffer from (a disadvantage)"],"pinyin":["ku3 yu2"],"simplified":["苦于"],"rank":18292.0,"normalized_rank":0.25592881227876263,"fraction":0.0000028541545604044977,"cumulative_fraction":0.970367902112528,"word":"苦於","characters":[{"definition":["bitter\/hardship\/pain\/to suffer\/to bring suffering to\/painstakingly"],"pinyin":["ku3"],"word":"苦"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[],"sentences":[{"english":"The inhabitants are suffering for provisions.","chinese":"居民們正苦於缺乏糧食。"},{"english":"And all those companies are plagued by backed-up orders and delivery delays.","chinese":"而所有這些公司都苦於訂單堆積及交貨延誤。"},{"english":"The school labours under the disadvantage of not having enough textbooks .","chinese":"這所學校苦於課本不足的不利條件。"},{"english":"However, no eye in the sky opened suffering, the spirit world unknown.","chinese":"然而，苦於沒有天目，不能瞭解靈界。"},{"english":"But government departments are struggling to implement the measures.","chinese":"然而政府部門正苦於實施這些措施。"},{"english":"We’ve all agonized over difficult decisions. Go to college or backpack around Europe?","chinese":"我們都苦於決擇，去上大學還是揹包徒步到歐洲旅行？"},{"english":"But the plan is plagued by bureaucratic in-fighting.","chinese":"只是這計劃又苦於官僚之間的混戰難以實施。"},{"english":"They were straitened for money.","chinese":"他們苦於沒有錢繕。"},{"english":"There are not enough women in positions of power. The world has suffered from this deficit for a long time.","chinese":"整個世界很長時間都一直苦於當要權的女性過少。"},{"english":"The caller is having a tough time right now making ends meet.","chinese":"這位打電話的人現在正苦於讓收支相抵。"},{"english":"Yu Mr. Suffer from mountain road in the north, went out to block making way.","chinese":"愚公苦於山北面道路阻塞，出去進來都要繞遠路。"},{"english":"But all also suffer from cystic in Xiuse, often embarrassing for the poor worry about.","chinese":"但這一切又苦於囊中羞澀，時常爲此尷尬窮愁。"}],"related":[]}