{"definition":["nothing can surpass"],"pinyin":["mo4 guo4 yu2"],"simplified":["莫过于"],"rank":11446.0,"normalized_rank":0.16014439018930227,"fraction":0.000006624172751740757,"cumulative_fraction":0.940397588223454,"word":"莫過於","characters":[{"definition":["do not\/there is none who","surname Mo"],"pinyin":["Mo4","mo4"],"word":"莫"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[],"sentences":[{"english":"The most interesting thing was to climb the Fragrant Mount.","chinese":"最有趣的事情莫過於爬香山了。"},{"english":"The Way of the Dragon God believes that the heart, more than anything else, points the way forward.","chinese":"龍神道相信指引方向的最大力量莫過於心。"},{"english":"Now, I am half snake, half woman-the worst of all possible worlds.","chinese":"如今我半蛇半女，世間最痛苦的，莫過於此。"},{"english":"The most threatening change, from my perspective, is extermination of species.","chinese":"在我看來，威脅最大的莫過於物種的滅絕。"},{"english":"Nothing is worse than the death of conscience.","chinese":"一個人最傷心的事莫過於良心的死滅。"},{"english":"The most interesting thing was to climb the Golden Hill.","chinese":"最有趣的事情莫過於爬金山了。"},{"english":"There is nothing so beautiful as the creation of a new life.","chinese":"世間最美好的事，莫過於新生命的誕生。"},{"english":"There's no greater happiness than that of succeeding in one's career.","chinese":"最大的快樂莫過於事業上的成功。"},{"english":"Today researchers are most excited by ginger's ability to combat inflammation.","chinese":"現在，研究人員最激動莫過於姜的抗炎作用。"},{"english":"The best data is that which is tied to Nesta and Maldini's recovery.","chinese":"最好的小廝莫過於內斯塔和馬爾蒂尼的迴歸了。"},{"english":"The biggest handheld-related news lately has been about VGA screens.","chinese":"最近關於手持設備最火一條新聞莫過於VGA屏幕了。"},{"english":"That is the worst thing that you can do.","chinese":"最糟糕的事情莫過於此。"},{"english":"I am going to get everything ready beforehand.","chinese":"最好的辦法莫過於早作準備。"},{"english":"One of the great tortures of life is receiving grades on papers and tests.","chinese":"生活中最折磨人的事情莫過於收取考試成績單。"},{"english":"There is simply no other possession, anyone could hold, more precious than this.","chinese":"人們所能擁有的最珍貴的禮物莫過於此了。"},{"english":"There is no more precious possession anyone could hold.","chinese":"人們所能擁有的最珍貴的禮物莫過於此了。"}],"related":[]}