{"definition":["(chemistry) liquid-liquid extraction (aka solvent extraction)\/to extract"],"pinyin":["cui4 qu3"],"simplified":["萃取"],"rank":29961.0,"normalized_rank":0.4191932617911659,"fraction":9.460809996921823e-7,"cumulative_fraction":0.9902050428358634,"word":"萃取","characters":[{"definition":["collect\/collection\/dense\/grassy\/thick\/assemble\/gather"],"pinyin":["cui4"],"word":"萃"},{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"}],"containing_words":[],"sentences":[{"english":"Often, they are cold-pressed and extracted from fatty portions of vegetables.","chinese":"常常，他們冷壓萃取脂肪和部分蔬菜。"},{"english":"It is mainly extracted by ethanol extract of the finished product obtained Absolute clouds.","chinese":"本品主要通過乙醇萃取成品的雲煙浸膏製得淨油。"},{"english":"The unrefined Veratryl alcohol extracted from fresh grape peel by organic solvent could significantly enhance Lip activity.","chinese":"有機萃取葡萄皮渣粗提藜蘆醇可提高酶活。"},{"english":"To definite the optimum experimental condition for microwave extraction red pigment of Baubinia blakeana Dunn flower .","chinese":"確定微波萃取紅花羊蹄甲花紅色素的最佳試驗條件。"},{"english":"Sea weed extract is neither a rare nor expensive ingredient.","chinese":"海藻萃取液是一種既非稀有也不昂貴的成分。"},{"english":"It offers several advantages over conventional dispersion-coalescence-settling solvent extraction processes.","chinese":"該過程具有一些區別於通常萃取過程的特殊優勢。"},{"english":"Extraction technique in binary-water phase system has been widely used in separation and purification of enzyme.","chinese":"雙水相體系萃取技術巳被廣泛應用於酶的分離純化。"},{"english":"Solid-Phase extraction (SPE) is a fast-developing sample preparating technique.","chinese":"固相萃取是近年來發展較快的樣品預處理技術。"},{"english":"Principle and practice for application of extractive technology in extracting gold from copper anode slime are described.","chinese":"介紹萃取技術在銅陰極泥提金中的應用原理和實踐。"},{"english":"Supercritical CO2 fluid was used to extract the flavone in Artemisia Selengensis Turcz.","chinese":"採用超臨界CO2萃取藜蒿中黃酮類物質。"},{"english":"Elixirs are concentrated alcohol extractions that are similar to both teas and tinctures .","chinese":"長生不老藥是濃縮的酒精萃取物，類似於茶和酊劑。"},{"english":"We handle projects in order to accumulate more experience working with diverse technologies.","chinese":"軟體技術與經驗就從實作計劃中歷練萃取累積的。"},{"english":"ASE extraction efficiency is equivalent to that of Soxhlet extraction.","chinese":"加速溶劑萃取的提取效率和索氏提取相當。"},{"english":"Naphthalenesulfonic acid type organic wastewater was treated by complex extraction method.","chinese":"採用絡合萃取法對萘磺酸類有機廢水進行預處理。"},{"english":"These are derived from wild yams and soybeans.","chinese":"天然黃體酮萃取自野生山藥和豆科植物。"},{"english":"Selections of extractants with their strong and weak points have also been discussed by the author.","chinese":"並討論了萃取劑的選擇及其優缺點。"}],"related":[{"definition":["to distill\/distillation"],"pinyin":["zheng1 liu2"],"word":"蒸餾"},{"definition":["to purify"],"pinyin":["ti2 chun2"],"word":"提純"},{"definition":["succinct\/pure and concise"],"pinyin":["jing1 cui4"],"word":"精粹"},{"definition":["essential oil"],"pinyin":["jing1 you2"],"word":"精油"},{"definition":["best feature\/most important part of an object\/quintessence\/essence\/soul"],"pinyin":["jing1 hua2"],"word":"精華"},{"definition":["to extract (ore, minerals etc)\/to refine\/to purify\/to process"],"pinyin":["ti2 lian4"],"word":"提煉"},{"definition":["milling\/to grind\/to polish by grinding\/to abrade\/whetstone\/pestle"],"pinyin":["yan2 mo2"],"word":"研磨"},{"definition":["rose hip"],"pinyin":["mei2 gui1 guo3"],"word":"玫瑰果"},{"definition":["seasoning\/condiment\/flavoring\/dressing\/essences"],"pinyin":["xiang1 jing1"],"word":"香精"},{"definition":["marsh mallow (Althaea officinalis)"],"pinyin":["yao4 shu3 kui2"],"word":"藥蜀葵"},{"definition":["composition\/make-up\/ingredient\/element\/component\/one's social status\/CL:個|个[ge4]"],"pinyin":["cheng2 fen4"],"word":"成分"},{"definition":["jojoba"],"pinyin":["he2 he2 ba1"],"word":"荷荷巴"},{"definition":["palm oil"],"pinyin":["ye1 you2"],"word":"椰油"},{"definition":["hops"],"pinyin":["pi2 jiu3 hua1"],"word":"啤酒花"},{"definition":["prescription\/cooking recipe\/formulation\/completing the square (to solve quadratic equation, math.)"],"pinyin":["pei4 fang1"],"word":"配方"},{"definition":["to add water (or other liquid) to (another ingredient such as powdered milk or tea leaves)\/to infuse (tea)"],"pinyin":["chong1 pao4"],"word":"沖泡"}]}