{"definition":["to burgeon\/to produce\/to conceive\/to be in the initial stage"],"pinyin":["meng2 sheng1"],"simplified":["萌生"],"rank":15569.0,"normalized_rank":0.2178305094231388,"fraction":0.000003870012865736684,"cumulative_fraction":0.9613153868666562,"word":"萌生","characters":[{"definition":["to sprout\/to bud\/to have a strong affection for (slang)\/adorable (loanword from Japanese 萌え moe, slang describing affection for a cute character)"],"pinyin":["meng2"],"word":"萌"},{"definition":["to be born\/to give birth\/life\/to grow\/raw\/uncooked\/student"],"pinyin":["sheng1"],"word":"生"}],"containing_words":[],"sentences":[{"english":"At this moment, an idea came into Tucheng ' s mind, which was to make artificial cultivated land.","chinese":"此時的土成有一個心願，他萌生了人造耕地的想法。"},{"english":"The path of crack initiation and growth is transgranular under conditions of isothermal low cycle fatigue.","chinese":"在等溫低周疲勞載荷下，裂紋主要爲穿晶萌生與擴展。"},{"english":"This essay investigates the emergence of society from the perspective of social system Luhmanns.","chinese":"本文試圖從魯曼的系統理論來探討社會體的萌生特質。"},{"english":"Yet for advocates of fuel-cell cars, hope springs eternal.","chinese":"而對燃料電池汽車的支持者來說，希望永遠都在萌生。"},{"english":"Sochaux have approached Liverpool for want-away striker Anthony Le Tallec.","chinese":"索肖因萌生去意的利物浦前鋒勒塔萊接觸利物浦。"},{"english":"Vegetative shoots of Calocedrus formosana continually initiated leaves and lateral branches from early March until the end of October.","chinese":"臺灣肖楠每年從三月至十月底萌生新葉與側枝。"},{"english":"The Quercus forest in the Northwest of Yunnan Province showed a strong sprouting ability.","chinese":"滇西北的川滇高山櫟具有很強的萌生能力。"},{"english":"They have just initiation love was young has gone through the test of life and death.","chinese":"他們剛剛萌生的愛情幼苗也歷經生死的考驗。"},{"english":"The results showed that all the cracks were initiated from the notch.","chinese":"分析兩次試驗結果發現，裂紋都在缺口處萌生。"},{"english":"Fracture is mainly intergranular and transgranular under conditions of triangular wave shape.","chinese":"在同相位梯形波載荷下，裂紋主要爲沿晶萌生與擴展。"},{"english":"Since the initiation Yu from the sea of bright sense of disloyalty .","chinese":"自瑜萌生起對海亮不忠的感覺。"},{"english":"Looking through his composition , a new opinion came into his mind.","chinese":"瀏覽着作文時，一個新觀點在他的頭腦中萌生了。"},{"english":"After graduation, she had an idea.","chinese":"畢業後，她萌生了一個想法。"},{"english":"The threshold of the fatigue crack initiation from the notch of the microbeam is close to that of the bulk material.","chinese":"疲勞裂紋從尖缺口處萌生的門檻值接近塊體材料。"},{"english":"India's capital market burgeoned against this backdrop.","chinese":"印度的資本市場是在這種背景下萌生的。"},{"english":"Then I just started to feel this urge.","chinese":"然後我開始感覺這種念頭一直在萌生。"}],"related":[{"definition":["to sprout\/to shoot\/to bud"],"pinyin":["meng2 fa1"],"word":"萌發"},{"definition":["thought\/idea\/intention"],"pinyin":["nian4 tou5"],"word":"念頭"},{"definition":["way of thinking\/opinion\/notion\/to think of a way (to do sth)\/CL:個|个[ge4]"],"pinyin":["xiang3 fa3"],"word":"想法"},{"definition":["to give birth\/to grow (whiskers etc)\/to generate\/to produce"],"pinyin":["sheng1 chu1"],"word":"生出"},{"definition":["discouraged\/downhearted"],"pinyin":["xin1 hui1 yi4 leng3"],"word":"心灰意冷"},{"definition":["thereupon\/as a result\/consequently\/thus\/hence"],"pinyin":["yu2 shi4"],"word":"於是"},{"definition":["lit. to be together from the first beat (idiom)\/to hit it off\/to click together\/to chime in easily"],"pinyin":["yi1 pai1 ji2 he2"],"word":"一拍即合"},{"definition":["desire\/wish"],"pinyin":["yuan4 wang4"],"word":"願望"},{"definition":["to make a firm resolution"],"pinyin":["xia4 ding4 jue2 xin1"],"word":"下定決心"},{"definition":["to have an urge\/to be impetuous\/impulse\/urge"],"pinyin":["chong1 dong4"],"word":"衝動"},{"definition":["arising involuntarily (idiom); spontaneous\/to spring up unbidden (of emotion)"],"pinyin":["you2 ran2 er2 sheng1"],"word":"油然而生"},{"definition":["to think\/to believe\/to suppose\/to wish\/to want\/to miss (feel wistful about the absence of sb or sth)"],"pinyin":["xiang3"],"word":"想"},{"definition":["deep in one's heart"],"pinyin":["nei4 xin1 shen1 chu4"],"word":"內心深處"},{"definition":["to sprout (lit. or fig.)\/to bud\/to germinate\/germ\/seed\/bud"],"pinyin":["meng2 ya2"],"word":"萌芽"},{"definition":["once it gets started there's no stopping it"],"pinyin":["yi1 fa1 bu4 ke3 shou1 shi5"],"word":"一發不可收拾"},{"definition":["to begin to stir (idiom)\/to get restless\/to become threatening"],"pinyin":["chun3 chun3 yu4 dong4"],"word":"蠢蠢欲動"}]}