{"definition":["multimeter"],"pinyin":["wan4 yong4 biao3"],"simplified":["万用表"],"rank":54280.0,"normalized_rank":0.7594476235781344,"fraction":8.89003747589167e-8,"cumulative_fraction":0.999451997215183,"word":"萬用表","characters":[{"definition":["surname Wan","ten thousand\/a great number"],"pinyin":["Wan4","wan4"],"word":"萬"},{"definition":["to use\/to employ\/to have to\/to eat or drink\/expense or outlay\/usefulness\/hence\/therefore"],"pinyin":["yong4"],"word":"用"},{"definition":["exterior surface\/family relationship via females\/to show (one's opinion)\/a model\/a table (listing information)\/a form\/a meter (measuring sth)"],"pinyin":["biao3"],"word":"表"}],"containing_words":[],"sentences":[{"english":"This article introduces the methods of checking integrate circuit module and single crystal transistor.","chinese":"介紹了用萬用表檢測集成電路塊和單結晶體管的方法。"},{"english":"It also has the function of measuring leads for multimeter.","chinese":"它也有功能的測量線索，萬用表。"},{"english":"A digital multi-meter measures the output voltage of the black box.","chinese":"數字萬用表測量黑盒的輸出電壓。"},{"english":"Connect the multimeter to the output of the current measuring transformer.","chinese":"連接萬用表到電流測量感應器輸出端。"},{"english":"If you open up an analog multimeter you will understand what i mean.","chinese":"如果你打開一個模擬萬用表，你會明白我的意思。"},{"english":"Most multimeters have a fuse to help protect against misuse.","chinese":"大多數的萬用表有一個保險絲來防止損壞。"},{"english":"Touch one of the multimeter probes to the correct pin to be tested.","chinese":"將萬用表的一支表筆接觸待測試的正確觸針。"},{"english":"Combining with Multimeter, repairer can identify the issue quickly.","chinese":"結合萬用表的使用，維修人員能夠快速定位故障所在。"},{"english":"More expensive digital multimeters can equal or better this performance.","chinese":"很多便宜的數字萬用表也可以達到或者比其性能更好。"}],"related":[]}