{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"simplified":["落实"],"rank":1125.0,"normalized_rank":0.01574020958963525,"fraction":0.00014240117500381483,"cumulative_fraction":0.6388296407670021,"word":"落實","characters":[{"definition":["colloquial reading for 落[luo4] in certain compounds","to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["la4","lao4","luo4"],"word":"落"},{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"}],"containing_words":[],"sentences":[{"english":"China stands ready to earnestly implement the agreement together with Vietnam.","chinese":"中方願與越方共同努力，認真落實協議。"},{"english":"Objective To explore the effective nursing in three-stage prevention of periodontitis.","chinese":"目的探索一種有效落實牙周病的三期預防的護理措施。"},{"english":"Field projects are implemented in all types of natural forests.","chinese":"各類天然林實地區項目得到落實。"},{"english":"Timely deployment of work safety, strict implementation of territorial regulatory responsibility.","chinese":"及時研究部署安全生產工作，嚴格落實屬地監管責任。"},{"english":"The optimum adjustment of the human-natural relationship should be implemented into specific regions.","chinese":"人地關係優化調控必須落實到具體的區域。"},{"english":"Both sides are committed to continuing the High- and Expert-Level meetings and to implementing the outcomes of those meetings.","chinese":"雙方承諾繼續開展中美創新對話並落實對話成果。"},{"english":"Ultimately, though, his duty was to his commander in chief.","chinese":"當然最後還是要落實到他作爲統帥的責任。"},{"english":"We shall work even harder to further honour our pledges.","chinese":"我們自當加倍努力，進一步落實承諾。"},{"english":"A basis for COC consultations is the implementation of the DOC.","chinese":"“準則”磋商是建立在落實《宣言》基礎上的。"},{"english":"We set up a mechanism to inspect and establish accountability for the implementation of major government policies and introduced third-party evaluations.","chinese":"建立重大政策落實督查問責機制，開展第三方評估。"},{"english":"We will fully implement all regional development plans.","chinese":"全面落實各項區域發展規劃。"},{"english":"We will implement the administrative law enforcement accountability system to strengthen and improve administrative law enforcement.","chinese":"加強和改善行政執法，落實行政執法責任制。"},{"english":"The short term, you first need is implementation of cotton-planting area of concern.","chinese":"短期來說，首先需要關注的是植棉面積的落實情況。"},{"english":"Please call again one week before your departure date for reconfirmation.","chinese":"請在您啓程前一週再給我打一個電話落實一下。"},{"english":"Of course, only time will tell if Bocom can execute on this plan.","chinese":"當然，只有時間能證明，交行能否落實好這個計劃。"},{"english":"Third, pay close attention to the responsibility to implement.","chinese":"三是狠抓責任落實。"}],"related":[{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["feasible\/realistic\/practical\/earnestly\/conscientiously"],"pinyin":["qie4 shi2"],"word":"切實"},{"definition":["mechanism"],"pinyin":["ji1 zhi4"],"word":"機制"},{"definition":["to launch\/to develop\/to unfold\/(of an exhibition etc) to open"],"pinyin":["kai1 zhan3"],"word":"開展"},{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"實行"},{"definition":["to examine or inspect\/self-criticism\/review"],"pinyin":["jian3 tao3"],"word":"檢討"},{"definition":["to implement\/to carry out\/to execute\/to run"],"pinyin":["zhi2 xing2"],"word":"執行"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推進"},{"definition":["to ensure\/to guarantee"],"pinyin":["que4 bao3"],"word":"確保"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["to implement\/to carry out"],"pinyin":["shi2 shi1"],"word":"實施"},{"definition":["authorities"],"pinyin":["dang1 ju2"],"word":"當局"},{"definition":["active\/energetic\/vigorous\/positive (outlook)\/proactive"],"pinyin":["ji1 ji2"],"word":"積極"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"監管"},{"definition":["to move\/to act\/action\/decision\/conduct\/manner"],"pinyin":["ju3 cuo4"],"word":"舉措"}]}