{"definition":["to be widely known as"],"pinyin":["zhu4 cheng1"],"simplified":["著称"],"rank":8372.0,"normalized_rank":0.11713514194171225,"fraction":0.000011095175507268017,"cumulative_fraction":0.9140807457401586,"word":"著稱","characters":[{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","aspect particle indicating action in progress","to make known\/to show\/to prove\/to write\/book\/outstanding","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","to wear (clothes)\/to contact\/to use\/to apply"],"pinyin":["zhao1","zhao2","zhe5","zhu4","zhuo2"],"word":"著"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"}],"containing_words":[{"definition":["world-renowned"],"pinyin":["zhu4 cheng1 yu2 shi4"],"word":"著稱於世"}],"sentences":[{"english":"Our teacher is known for her fairness in grading pupils.","chinese":"我們的老師以給學生評分公平著稱。"},{"english":"India's culture is marked by a high degree of syncretism and pluralism.","chinese":"印度文化以高度的融合性和多元性而著稱。"},{"english":"Ponson, distinguished for seascapes, took part in salons since 1861.","chinese":"彭松以描繪海景著稱，1861年起在巴黎沙龍參展。"},{"english":"Here by \"the red tile greenery, the blue sea blue sky\" is celebrated worldwide.","chinese":"這裏以“紅瓦綠樹，碧海藍天”著稱於世。"},{"english":"The island is noted for its summer resort.","chinese":"這個島以避暑勝地而著稱。"},{"english":"East Dongting Lake has been famous for its great size and beauty throughout Chinese history.","chinese":"東洞庭湖在中國歷史上一直以它的壯觀和美麗著稱。"},{"english":"Sheep are known for their thick coat of fleece.","chinese":"綿羊以一身厚密的羊毛著稱。"},{"english":"The region is remarkable for its woodland scenery.","chinese":"這地區以森林景色著稱。"},{"english":"Male mallard ducks (Anas platyrhynchos) are famous for their long, spiraling genitalia.","chinese":"雄性綠頭野鴨以長長的螺旋狀生殖器而著稱。"},{"english":"With exquisite workmanship, PE celebrated, unique flavor from home or abroad.","chinese":"益以工藝精湛，風味獨特著稱，飲譽海內外。"},{"english":"Wu Gorge, also known as Great Gorge to a beautiful deep said.","chinese":"巫峽又名大峽，以幽深秀麗著稱。"},{"english":"Both are known for their devotion to mentoring, Backus says.","chinese":"巴克斯說，兩人都以熱心輔導學生而著稱。"},{"english":"Palau is noteworthy for its amazing and scuba diving sights.","chinese":"帛琉以其令人讚歎的浮潛和潛水景點著稱。"},{"english":"Marseilles is a chief port and Lyon is an industrial center famous for its textiles.","chinese":"馬賽是最大的港口，而里昂則以紡織工業著稱於世。"},{"english":"The drawer is famous for his landscape painting.","chinese":"這位畫家以其山水畫著稱。"},{"english":"Mount Langya, which stands on the southwest outskirts of Chuzhou in Anhui Province, is well known for its scenic charm.","chinese":"安徽省滁州市西南郊的琅玡山，向以山水醉人著稱。"}],"related":[]}