{"definition":["to record\/to put down in writing"],"pinyin":["zhu4 lu4"],"simplified":["著录"],"rank":46003.0,"normalized_rank":0.6436416548906579,"fraction":2.164848206362454e-7,"cumulative_fraction":0.9982476406278844,"word":"著錄","characters":[{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","aspect particle indicating action in progress","to make known\/to show\/to prove\/to write\/book\/outstanding","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","to wear (clothes)\/to contact\/to use\/to apply"],"pinyin":["zhao1","zhao2","zhe5","zhu4","zhuo2"],"word":"著"},{"definition":["diary\/record\/to hit\/to copy","surname Lu"],"pinyin":["Lu4","lu4"],"word":"錄"}],"containing_words":[],"sentences":[{"english":"Modern book editions are complicated and various, but the rules of book description are backward.","chinese":"現代圖書版本類型複雜多樣，而著錄規則滯後。"},{"english":"The sea, in addition to describe the geographic positions, also recorded the styles of countries and people which are far away .","chinese":"《海經》除著錄地理方位外，還記載遠國異人的風貌。"},{"english":"The author index has entries arranged in alphabetical order of author's surnames.","chinese":"著者索引中有按著者姓氏字母順序排列的著錄。"},{"english":"The Epitaph of Wang Tai-ruren, Xiong Mingyu's Mother, in the Ming Dynasty has never been seen in any description.","chinese":"明代熊明遇之母王太孺人墓誌至今未見有著錄。"},{"english":"This paper introduces the duplicate checking in the process of cataloging and the description of bibliographic citations.","chinese":"介紹了圖書編目過程中的查重工作和書目數據的著錄。"},{"english":"There are two record methods in ancient Chinese booklist record, i. e. inter record method and analytic method .","chinese":"中國古代書目著錄有互著和別裁兩種方法。"},{"english":"In appendix, we extracted the records concerning this book from past catalogues.","chinese":"附錄集錄歷代書目對景德傳燈錄的著錄。"},{"english":"There are a passel of ancient pottery script which have not been recorded in the cultural relic collection room of Jilin University.","chinese":"吉林大學文物室藏着一批古陶文實物，皆未經著錄。"},{"english":"There are many errors when The Booklist of Chinese Ancient Rare Books registered the copy.","chinese":"《中國古籍善本書目》著錄丁本時有誤。"},{"english":"Objective To understand the citation of foreign-language references of articles in nursing periodicals.","chinese":"目的瞭解護理期刊論文外文參考文獻著錄情況。"},{"english":"While I was concentrating on monographic publications, he recorded articles in journals.","chinese":"我專注於專題論文之出版，他著錄期刊中的文獻。"}],"related":[{"definition":["printing plate bearing an image (illustration, photo etc)\/print made with such a plate"],"pinyin":["tu2 ban3"],"word":"圖版"},{"definition":["catalog"],"pinyin":["tu2 lu4"],"word":"圖錄"},{"definition":["short comments\/preface and postscript"],"pinyin":["ti2 ba2"],"word":"題跋"},{"definition":["to collect in a museum or library\/museum collection\/library holdings"],"pinyin":["guan3 cang2"],"word":"館藏"},{"definition":["handed down from ancient times\/family heirloom"],"pinyin":["chuan2 shi4"],"word":"傳世"},{"definition":["to include (in a collection)\/to put together (stories, poems etc)\/to record\/to employ\/to recruit"],"pinyin":["shou1 lu4"],"word":"收錄"},{"definition":["a series of books\/a collection of books"],"pinyin":["cong2 shu1"],"word":"叢書"},{"definition":["document"],"pinyin":["wen2 xian4"],"word":"文獻"},{"definition":["anthology"],"pinyin":["xuan3 ji2"],"word":"選集"},{"definition":["marginal notes\/annotation\/to annotate\/to add comments to text"],"pinyin":["zhu4 shi4"],"word":"注釋"},{"definition":["seal script (Chinese calligraphic style)"],"pinyin":["zhuan4 shu1"],"word":"篆書"},{"definition":["Chang Dai-chien or Zhang Daqian (1899-1983), one of the greatest Chinese artists of the 20th century"],"pinyin":["Zhang1 Da4 qian1"],"word":"張大千"},{"definition":["editor in chief"],"pinyin":["zhu3 bian1"],"word":"主編"},{"definition":["to refer to\/see also\/compare (cf.)\/to pay respect to"],"pinyin":["can1 jian4"],"word":"參見"},{"definition":["to write down\/to record\/written account"],"pinyin":["ji4 zai3"],"word":"記載"}]}