{"definition":["to gather\/to collect"],"pinyin":["sou1 ji2"],"simplified":["蒐集"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"蒐集","characters":[{"definition":["madder (Rubia cordifolia)\/to hunt for\/to gather\/to collect"],"pinyin":["sou1"],"word":"蒐"},{"definition":["to gather\/to collect\/collected works\/classifier for sections of a TV series etc: episode"],"pinyin":["ji2"],"word":"集"}],"containing_words":[],"sentences":[{"english":"The students collected a bag of bark for their science project.","chinese":"學生爲進行科學計畫蒐集了一袋樹皮。"},{"english":"Chapter four makes a collection and arrangement in terms of Ho Group Hunting Oracle.","chinese":"第四章對何組田獵卜辭進行蒐集和整理。"},{"english":"It can change material roller and collect materials automatically.","chinese":"它可以改變材料的壓路機和蒐集材料不攻自破。"},{"english":"The children love to collect the colorful Hsiang Bao.","chinese":"小孩喜歡蒐集鮮豔的香包。"},{"english":"She collected many writing materials through a series of investigations and surveys.","chinese":"一系列內查外訪，她蒐集到了許多寫作素材。"},{"english":"He showed his friends the precious stamps which he has collected these years.","chinese":"他把這些年來所蒐集的珍貴郵票拿給朋友看。"},{"english":"She began working when she was 4, collecting grasses that her father wove into mats.","chinese":"當她只有四歲時，便爲編制草蓆的父親蒐集青草。"},{"english":"He is a man of ex-plays (criminal record).","chinese":"他是一個蒐集犯罪證據的人。"},{"english":"He asked someone else to do all the legwork of gathering information.","chinese":"他叫了別人來做所有蒐集資料的跑腿活。"},{"english":"The material collected from a number of websites, and edited by a lawyer.","chinese":"本文素材蒐集自多家網站，由佳和律師編輯整理。"},{"english":"Book I gleans nearly seventy tales of the art of management.","chinese":"第一冊蒐集了近七十個有關管理藝術的故事。"},{"english":"The port scanning also is the hacker collects the goal main engine information one commonly used method.","chinese":"端口掃描也是黑客蒐集目標主機信息的一種常用方法。"},{"english":"Since last week, police have interviewed members of the polygamist sect looking for evidence.","chinese":"警方自上週起詢問了一夫多妻組織的成員，蒐集證據。"},{"english":"These pictures are collected without choice.","chinese":"這些畫是不分好壞蒐集來的。"},{"english":"The underneath is the standpoint that the water demon takes a wide view some movie review a collection editor.","chinese":"下面是水妖縱觀一些影評蒐集編輯的觀點。"},{"english":"He is to spy and gather information that will help the Sky People conquer the land.","chinese":"他去偵察和蒐集情報，將幫助天空人征服這片土地。"}],"related":[{"definition":["to collect and organize (papers etc)\/to archive (data)\/to summarize (evidence etc)\/summary"],"pinyin":["hui4 zheng3"],"word":"彙整"},{"definition":["to thumb through\/to flip through (a book)"],"pinyin":["fan1 yue4"],"word":"翻閱"},{"definition":["to make\/to manufacture"],"pinyin":["zhi4 zuo4"],"word":"製作"},{"definition":["leisure"],"pinyin":["xian2 xia2"],"word":"閒暇"},{"definition":["to do textual research\/to make textual criticism\/to verify by means of research (esp. historical details)\/to take an exam to get a certificate (abbr. for 考取證件|考取证件[kao3 qu3 zheng4 jian4])"],"pinyin":["kao3 zheng4"],"word":"考證"},{"definition":["to disseminate"],"pinyin":["san4 bu4"],"word":"散佈"},{"definition":["to compile and print\/to publish"],"pinyin":["bian1 yin4"],"word":"編印"},{"definition":["to display\/to exhibit"],"pinyin":["chen2 lie4"],"word":"陳列"},{"definition":["old property (esp. inherited from former generation)\/former territory"],"pinyin":["jiu4 wu4"],"word":"舊物"},{"definition":["archive of graphics (e.g. maps, documents or botanical figures)\/atlas\/collection of illustrations or sheet music"],"pinyin":["tu2 pu3"],"word":"圖譜"},{"definition":["lit. looking for a fine horse using only a picture (idiom)\/fig. to do things along rigid, conventional lines\/to try and find sth with the help of a clue"],"pinyin":["an4 tu2 suo3 ji4"],"word":"按圖索驥"},{"definition":["document"],"pinyin":["wen2 xian4"],"word":"文獻"},{"definition":["detailed and reliable\/full and accurate"],"pinyin":["xiang2 shi2"],"word":"詳實"},{"definition":["manuscript of a book"],"pinyin":["shu1 gao3"],"word":"書稿"},{"definition":["to compile"],"pinyin":["bian1 zuan3"],"word":"編纂"},{"definition":["to select very carefully"],"pinyin":["jing1 tiao1 xi4 xuan3"],"word":"精挑細選"}]}