{"definition":["to accumulate\/to store up"],"pinyin":["xu4 ji1"],"simplified":["蓄积"],"rank":28089.0,"normalized_rank":0.3930015530340129,"fraction":0.0000011184805770161242,"cumulative_fraction":0.9882808384554276,"word":"蓄積","characters":[{"definition":["to store up\/to grow (e.g. a beard)\/to entertain (ideas)"],"pinyin":["xu4"],"word":"蓄"},{"definition":["to amass\/to accumulate\/to store\/measured quantity (such as area of volume)\/product (the result of multiplication)\/to integrate (math.)\/to solve (or integrate) an ordinary differential equation (math.)\/old\/long-standing"],"pinyin":["ji1"],"word":"積"}],"containing_words":[],"sentences":[{"english":"However, the accumulative concentrations of DDT and BHC in 1998 was much higher than that of some foreign countries.","chinese":"但1998年的蓄積水平與國外相比仍處於較高水平。"},{"english":"Although mannitol can be absorbed by the gastrointestinal, but does not accumulate in the body.","chinese":"甘露醇雖可被人的胃腸所吸收，但在體內並不蓄積。"},{"english":"Consequently, women capable of bearing children tend not to accumulate excess fat on the belly.","chinese":"因此，女性的生育能力使得脂肪往往不會蓄積在腹部。"},{"english":"The non-porous layer holds the water in an area called the saturated zone.","chinese":"不滲透層將水蓄積在一個叫做“飽和層”的地方。"},{"english":"China's per-capita forest area and stocking volume lag far behind the worlds average level.","chinese":"中國人均森林面積和蓄積量都遠低於世界平均水平。"},{"english":"In determining dosage regimens, it is also necessary to know the extent of drug accumulation.","chinese":"在決定劑量方案時，必須知道藥物在體內蓄積的程度。"},{"english":"This represents the last uncontrolled reservoir of polio in the world.","chinese":"這形成全世界最後無法控制的脊髓灰質炎的蓄積地。"},{"english":"Rainwater and condensation collect in the box’s chamber, where water gets trapped.","chinese":"收集到的雨水和凝結水蓄積在箱體的內腔。"},{"english":"The men collected rain-water in the rubber dinghy.","chinese":"他們用橡皮艇蓄積雨水。"},{"english":"Cadmium is a heavy metal element with accumulation toxicity.","chinese":"鎘是一種有毒的重金屬元素，具有蓄積性毒性。"},{"english":"Reduction of AGE accumulation could a-meliorate wound healing delay due to diabetes.","chinese":"減少AGE蓄積，可改善糖尿病創面癒合延遲現象。"},{"english":"As a result of this defect, affected individuals accumulate high concentrations of plant sterols in plasma and tissues.","chinese":"因此，患者在血漿和組織中蓄積了高濃度的植物固醇。"},{"english":"Their hope was that, overwhelmed with pyruvate, the mitochondria would be forced to respond.","chinese":"希望，當丙酮酸蓄積時，線粒體就會被迫產生反應。"},{"english":"The nurse should remove previously applied topical medications before applying new medications to prevent accumulation of medication that exceeds the precribed dose.","chinese":"護士應該先除去殘留的藥物再塗藥，避免藥物蓄積。"},{"english":"The effects of guanethidine are cumulative over extended periods.","chinese":"胍乙啶的作用是蓄積性的，且可維持較長時間。"},{"english":"The highest annual volume growth is found in stands of middle density of stocking.","chinese":"中等密度的白樺林有着最高的年蓄積生長量。"}],"related":[{"definition":["electrolyte"],"pinyin":["dian4 jie3 zhi4"],"word":"電解質"},{"definition":["too few\/insufficient"],"pinyin":["guo4 shao3"],"word":"過少"},{"definition":["radiation\/rays of radiation"],"pinyin":["fang4 she4 xian4"],"word":"放射線"},{"definition":["to waste"],"pinyin":["hao4 sun3"],"word":"耗損"},{"definition":["inner product\/the dot product of two vectors"],"pinyin":["nei4 ji1"],"word":"內積"},{"definition":["metabolism (biology)\/the new replaces the old (idiom)"],"pinyin":["xin1 chen2 dai4 xie4"],"word":"新陳代謝"},{"definition":["vertebrate"],"pinyin":["ji3 zhui1 dong4 wu4"],"word":"脊椎動物"},{"definition":["hyperfunction (medical)"],"pinyin":["kang4 jin4"],"word":"亢進"},{"definition":["variant of 熱衷|热衷[re4 zhong1]"],"pinyin":["re4 zhong1"],"word":"熱中"},{"definition":["(medical) compensation\/to repay a debt or obligation in place of someone else"],"pinyin":["dai4 chang2"],"word":"代償"},{"definition":["to pile up\/to heap\/accumulation"],"pinyin":["dui1 ji1"],"word":"堆積"},{"definition":["imbalance\/to become dysfunctional\/to lack proper care (after an illness etc)","out of tune (music)"],"pinyin":["shi1 diao4","shi1 tiao2"],"word":"失調"},{"definition":["surplus\/excess"],"pinyin":["guo4 sheng4"],"word":"過剩"},{"definition":["to overheat (e.g. an economy)"],"pinyin":["guo4 re4"],"word":"過熱"},{"definition":["hardening of the arteries\/arteriosclerosis"],"pinyin":["dong4 mai4 ying4 hua4"],"word":"動脈硬化"},{"definition":["to misuse"],"pinyin":["wu4 yong4"],"word":"誤用"}]}