{"definition":["cap rock"],"pinyin":["gai4 ceng2"],"simplified":["盖层"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"蓋層","characters":[{"definition":["lid\/top\/cover\/canopy\/to cover\/to conceal\/to build","surname Ge"],"pinyin":["Ge3","gai4"],"word":"蓋"},{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"層"}],"containing_words":[],"sentences":[{"english":"The sand forms a continuous transgressive blanket .","chinese":"砂質物構成一個連續的海進蓋層。"},{"english":"Then using a special knife, they cut off the lids of the cells.","chinese":"用一種特殊的刀，刮下蜂板上的覆蓋層。"},{"english":"The thicker the overburden, the smaller its anomalous value will be.","chinese":"覆蓋層越厚其異常量越小。"},{"english":"Microleakage is one of the most important pathways in which the natural gas diffuses through caprocks .","chinese":"微滲漏是天然氣通過蓋層散失的重要方式之一。"},{"english":"Soil is disturbed as little as possible and is seeded directly through existing mulch cover.","chinese":"儘量減少對土壤的干擾並通過現有的覆蓋層直接播種。"},{"english":"There are no large slipping nappe structure belts on the north depression in the Turpan Hami basin.","chinese":"吐哈盆地北部凹陷不存在大型蓋層滑脫型推覆構造帶。"},{"english":"The genetic model of hydrocarbon vertical distribution in caprock is established.","chinese":"建立了蓋層烴類垂向分佈成因模式。"},{"english":"The Peak Clad location above the bottom.","chinese":"最高覆蓋層的位置位於底部的上方。"},{"english":"The caprock displacement pressure decides its sealing character.","chinese":"蓋層的排替壓力決定了蓋層的封閉性質。"},{"english":"The caprock displacement pressure decides its sealing character.","chinese":"蓋層的排替壓力決定了蓋層的封閉性質。"},{"english":"All the soil cover were stripped away.","chinese":"全部土壤蓋層都被剝去了。"},{"english":"A gap or void in the coating of a pipe or in paint on a metal surface.","chinese":"在管子覆蓋層或金屬表面塗漆層上有漏塗點或裂縫。"},{"english":"It is overlain unconformably by the post Cambrian platform cover.","chinese":"被後寒武紀地臺沉積蓋層不整合覆蓋。"},{"english":"The Liangshang Formation mudstone is the direct cap rock of the Carboniferous gas pools.","chinese":"石炭系氣藏的直接蓋層是下二疊統梁山組泥岩層。"},{"english":"The shape of cavity should be optimized in the design of anechoic coating.","chinese":"在覆蓋層設計中，空腔的形狀應有一個優化的過程。"},{"english":"Blades built up laminated hardwood and pine with ply covering overlain by glued fabric.","chinese":"刀片建立了覆蓋層的疊層膠織物覆硬木和松樹。"}],"related":[]}