{"definition":["to have become common practice (idiom)\/to become a general trend"],"pinyin":["wei4 ran2 cheng2 feng1"],"simplified":["蔚然成风"],"rank":31243.0,"normalized_rank":0.4371301050746436,"fraction":8.436047056351059e-7,"cumulative_fraction":0.9913509564043844,"word":"蔚然成風","characters":[{"definition":["Artemisia japonica\/luxuriant\/resplendent\/impressive","surname Yu\/place name"],"pinyin":["Yu4","wei4"],"word":"蔚"},{"definition":["correct\/right\/so\/thus\/like this\/-ly"],"pinyin":["ran2"],"word":"然"},{"definition":["surname Cheng","to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth"],"pinyin":["Cheng2","cheng2"],"word":"成"},{"definition":["wind\/news\/style\/custom\/manner\/CL:陣|阵[zhen4],絲|丝[si1]"],"pinyin":["feng1"],"word":"風"}],"containing_words":[],"sentences":[{"english":"In Asia and America it has become fashionable to look upon these failings with disdain.","chinese":"在亞洲和美國，不屑一顧於歐洲的衰落已經蔚然成風。"},{"english":"Whatever the case is, ads planted in TV dramas and films are the order of the day.","chinese":"不論怎麼說，在影視劇中植入廣告現已蔚然成風。"},{"english":"Cooperation and mutual help between factories has become the order of the day.","chinese":"廠際協作和互相幫助已蔚然成風。"},{"english":"To improve one's professional skill has now become a common practice.","chinese":"鑽研業務已蔚然成風。"},{"english":"Co-ordination and mutual help between factories has become the order of the day.","chinese":"廠際協作和互相幫助已蔚然成風。"},{"english":"The construction of urban and rural public sports and exercise facilities was accelerated, and the national fitness program has taken root.","chinese":"城鄉公共體育設施建設加快，全民健身活動蔚然成風。"},{"english":"This has become a fairly common practice.","chinese":"這種做法已經蔚然成風。"},{"english":"and apparently irrational financial behavior becomes the order of the day.","chinese":"而很顯然，不合理的財務行爲蔚然成風。"},{"english":"Participation in standardization work in PUYUAN prevail.","chinese":"參與標準化工作在濮院蔚然成風。"},{"english":"I hope equality of opportunity for men and women is here to stay.","chinese":"我希望男女機會平等的風氣能夠蔚然成風。"},{"english":"Coordination and mutual help between factories have become the order of the day.","chinese":"廠際協作和互相幫助已蔚然成風。"}],"related":[]}