{"definition":["weak link\/loophole"],"pinyin":["bo2 ruo4 huan2 jie2"],"simplified":["薄弱环节"],"rank":14654.0,"normalized_rank":0.20502847229023544,"fraction":0.0000043180182025759525,"cumulative_fraction":0.9575693630178476,"word":"薄弱環節","characters":[{"definition":["meager\/slight\/weak\/ungenerous or unkind\/frivolous\/to despise\/to belittle\/to look down on\/to approach or near","see 薄荷[bo4 he5]","surname Bo","thin\/cold in manner\/indifferent\/weak\/light\/infertile"],"pinyin":["Bo2","bao2","bo2","bo4"],"word":"薄"},{"definition":["weak\/feeble\/young\/inferior\/(following a decimal or fraction) slightly less than"],"pinyin":["ruo4"],"word":"弱"},{"definition":["ring\/hoop\/loop\/(chain) link\/classifier for scores in archery etc\/to surround\/to encircle\/to hem in","surname Huan"],"pinyin":["Huan2","huan2"],"word":"環"},{"definition":["festival\/holiday\/node\/joint\/section\/segment\/part\/to economize\/to save\/to abridge\/moral integrity\/classifier for segments, e.g. lessons, train wagons, biblical verses\/CL:個|个[ge4]","see 節骨眼|节骨眼[jie1 gu5 yan3]"],"pinyin":["jie1","jie2"],"word":"節"}],"containing_words":[],"sentences":[{"english":"Able to reveal weaknesses in the structure in order to optimize the structure design.","chinese":"能夠揭示出結構的薄弱環節，以利於優化結構設計。"},{"english":"Hardness was quiet different in different zone of fusion welding joint.","chinese":"熔焊接頭硬度分佈不均勻，熱影響區是薄弱環節。"},{"english":"Defence has always been weak and vulnerable in the basket-ball matches in China.","chinese":"防守是我國籃球隊的一個薄弱環節。"},{"english":"How to practise evidence-based medicine(EBM) in clinic still remains a problem.","chinese":"循證臨牀實踐是當前循證醫學教育的一個薄弱環節。"},{"english":"The history of mathematics in Pre-Qin China is the weakest domain in the study of the history of mathematics in China.","chinese":"先秦數學史一直是中國數學史研究的薄弱環節。"},{"english":"The basic techniques concerned with passing, taking a pass and dribbling are the weakness in the real games.","chinese":"傳接球和運球基本技術在實戰運用中是薄弱環節。"},{"english":"Weekends are spent sharpening academic weak spots in paid tutoring sessions.","chinese":"週末得花錢上補習班，提高自己學習中的薄弱環節。"},{"english":"In sucker-rod oil pumping system, the sucker rod is its vulnerable spot.","chinese":"在有杆抽油系統中，抽油杆是其薄弱環節。"},{"english":"We must find the weak link in our work and then strengthen it.","chinese":"我們要找出工作中的薄弱環節，加強力量。"},{"english":"Also the hardened steel of the shaft pulling onto the mild steel of the frame is going to be a weak point.","chinese":"而且軸滴硬化鋼拉動框架滴軟化鋼將是一個薄弱環節。"},{"english":"The wall thickness of metal corrugated pipe is very thin, that is the weakest link in the piping system.","chinese":"金屬波紋管的壁厚很薄，它是管道系統中的薄弱環節。"},{"english":"The seal oil system has become weaker part for hydrogen cooled generator in running.","chinese":"軸封油系統已成爲氫冷發電機運行的薄弱環節。"},{"english":"But batteries remain the weak point.","chinese":"但是電瓶還是薄弱環節。"},{"english":"The labrum is a thin ring of cartilage that lines the acetabulum, or hip socket.","chinese":"在髖臼周圍的軟骨中，上脣是薄弱環節。"},{"english":"\"Rebounding had been one of their weaknesses, \" Hamblen said.","chinese":"“在過去，籃板一直是他們的薄弱環節，”弗蘭克稱。"},{"english":"This is a disease that can take advantage of any weakness in the health infrastructure.","chinese":"這種疾病可能利用衛生基礎設施中的一切薄弱環節。"}],"related":[]}