{"definition":["Sachsen or Saxony, Bundesland in east of Germany, bordering on Poland and Czech republic, capital Dresden 德累斯頓|德累斯顿[De2 lei4 si1 dun4]"],"pinyin":["Sa4 ke4 sen1"],"simplified":["萨克森"],"rank":44775.0,"normalized_rank":0.6264603416674829,"fraction":2.440745921131506e-7,"cumulative_fraction":0.9979654705464464,"word":"薩克森","characters":[{"definition":["Bodhisattva\/surname Sa"],"pinyin":["Sa4"],"word":"薩"},{"definition":["abbr. for 克羅地亞|克罗地亚[Ke4 luo2 di4 ya4], Croatia\/(Tw) abbr. for 克羅埃西亞|克罗埃西亚[Ke4 luo2 ai1 xi1 ya4], Croatia"],"pinyin":["Ke4"],"word":"克"},{"definition":["Mori (Japanese surname)","forest"],"pinyin":["Sen1","sen1"],"word":"森"}],"containing_words":[{"definition":["Sachsen or Saxony, Bundesland in east of Germany, bordering on Poland and Czech republic, capital Dresden 德累斯頓|德累斯顿[De2 lei4 si1 dun4]"],"pinyin":["Sa4 ke4 sen1 zhou1"],"word":"薩克森州"}],"sentences":[{"english":"Saxong is famous for its long history and rich cultural traditions.","chinese":"薩克森州以悠久的歷史和豐富的文化傳統而聞名於世。"},{"english":"The Dowager Duchess of Saxe-Coburg and Gotha continued to reside in Coburg.","chinese":"在薩克森公爵夫人太后科堡與哥達繼續居住在科堡。"},{"english":"Vegetables in Saxony are highly prized growing in the Ebe Valley.","chinese":"蔬菜在薩克森州的珍貴增長在江部谷。"},{"english":"Martin Luther was born in 1483 at Eisleben, Saxony, Germany.","chinese":"1483年馬丁路德出生於德國，薩克森，艾斯萊本。"},{"english":"A new generation of electrically conductive yarns has been developed at Schsische Baumwollspinnerei GmbH, Venusberg.","chinese":"薩克森棉紡公司研製了新一代導電紗線。"},{"english":"The Jobs book will be his fourth major biography.","chinese":"《喬布斯傳》將是艾薩克森完成的第四本傳記。"},{"english":"But Isaacson's biography suggests that he was much more of a tweaker.","chinese":"但是艾薩克森的傳記中暗示他不僅僅是一個“巧匠”。"},{"english":"Mona recounted to Isaacson her first encounter with Jobs.","chinese":"莫娜向艾薩克森重述了和喬布斯第一次見面的過程。"},{"english":"Saxen, now married and living in Berkeley, Calif., said after that incident, food was an escape.","chinese":"薩克森現已結婚並居住在哈里發的伯克利。"},{"english":"He was a prisoner in the Dachau and Sachsenhausen concentration camps in Germany.","chinese":"他是德國達濠和薩克森豪斯集中營的一個囚犯。"},{"english":"Isaacson’s authorized biography of Jobs goes on sale Monday.","chinese":"艾薩克森所著的喬布斯授權傳記將於22日發售。"},{"english":"Wulff was previously state premier of Lower Saxony in Hanover.","chinese":"武爾夫以前是首府位於漢諾威的下薩克森州的州長。"}],"related":[]}