{"definition":["Nicolas Sarkozy (1955-), French UMP politician, President 2007-2012"],"pinyin":["Sa4 ke1 qi2"],"simplified":["萨科齐"],"rank":18469.0,"normalized_rank":0.2584052719208652,"fraction":0.0000028027704357490982,"cumulative_fraction":0.9708681916720696,"word":"薩科齊","characters":[{"definition":["Bodhisattva\/surname Sa"],"pinyin":["Sa4"],"word":"薩"},{"definition":["branch of study\/administrative section\/division\/field\/branch\/stage directions\/family (taxonomy)\/rules\/laws\/to mete out (punishment)\/to levy (taxes etc)\/to fine sb\/CL:個|个[ge4]"],"pinyin":["ke1"],"word":"科"},{"definition":["(name of states and dynasties at several different periods)\/surname Qi","neat\/even\/level with\/identical\/simultaneous\/all together\/to even sth out"],"pinyin":["Qi2","qi2"],"word":"齊"}],"containing_words":[],"sentences":[{"english":"Both Mr Woerth and Mr Sarkozy deny any wrongdoing in the case.","chinese":"韋爾特和薩科齊都否認在這個案件裏做過任何錯事。"},{"english":"Mr Sarkozy, though, is nothing if not a risk-taker.","chinese":"毫無疑問，薩科齊是一個十足的冒險家。"},{"english":"Third, Mr Sarkozy is ready to confront France's bastions of conservatism.","chinese":"第三，薩科齊先生準備好面對法國保守主義的堡壘。"},{"english":"Yes, that's French President Nicholas Sarkozy with striped underwear on his head.","chinese":"下面這張圖是法國總統薩科齊頂着一條條紋內褲。"},{"english":"Does China have any message for President Sarkozy?","chinese":"中方是否有口信要傳遞給薩科齊總統？"},{"english":"Could this be the start of something special? \"Obama is my buddy,\" French President Nicolas Sarkozy said.","chinese":"法國總統薩科齊曾說，“奧巴馬是我的朋友。"},{"english":"President Nicolas Sarkozy has said all French troops will be withdrawn from Afghanistan by 2014.","chinese":"總統薩科齊說道所有法國部隊將會在2014年撤出。"},{"english":"Her French counter-part, President Nicolas Sarkozy also sent his congratulations.","chinese":"法國總統薩科齊也發出恭賀。"},{"english":"And in any case, he is unlikely to be deterred by diplomatic niceties .","chinese":"不管那種情況，薩科齊都不大可能受局與外交禮節。"},{"english":"Sarkozy is set to visit Mont Saint Michel in Normandy, France that day.","chinese":"薩科齊將訪問聖米歇爾山在諾曼底，法國那一天。"},{"english":"The man accused Sarkozy of \" dirtying me.\"","chinese":"那人辱罵薩科齊弄髒了他。"},{"english":"Mrs Merkel and Mr Sarkozy did not say how recapitalisation will proceed;","chinese":"默克爾和薩科齊並沒有說明資本調整將如何進行。"},{"english":"Mr Sarkozy, it appears, did not cave in entirely to Mr Hu.","chinese":"看起來薩科齊並沒有完全屈服於胡。"},{"english":"One year on, in short, Mr Sarkozy has delivered less than he promised.","chinese":"簡而言之，一年過去了，薩科齊未能完全履行諾言。"},{"english":"For instance, French president Nicolas Sarkozy loves fried wonton.","chinese":"如法國總統薩科齊愛喫炸餛飩。"},{"english":"Mr. Sarkozy is traveling with a high-level business delegation.","chinese":"薩科齊率領的是一個高級商務代表團。"}],"related":[]}