{"definition":["Surrey (county in England)"],"pinyin":["Sa4 li3"],"simplified":["萨里"],"rank":61537.0,"normalized_rank":0.8609824689043415,"fraction":3.2407033163348935e-8,"cumulative_fraction":0.9998715944299744,"word":"薩里","characters":[{"definition":["Bodhisattva\/surname Sa"],"pinyin":["Sa4"],"word":"薩"},{"definition":["Li (surname)","li, ancient measure of length, approx. 500 m\/neighborhood\/ancient administrative unit of 25 families\/(Tw) borough, administrative unit between the township 鎮|镇[zhen4] and neighborhood 鄰|邻[lin2] levels"],"pinyin":["Li3","li3"],"word":"里"}],"containing_words":[{"definition":["Martti Ahtisaari (1937-), Finnish diplomat and politician, veteran peace negotiator and 2008 Nobel peace laureate"],"pinyin":["A1 he4 di4 sa4 li3"],"word":"阿赫蒂薩里"},{"definition":["Surrey (county in south England)"],"pinyin":["Sa4 li3 jun4"],"word":"薩里郡"}],"sentences":[{"english":"The nearest town with potential was Salida.","chinese":"最近的城鎮有可能是薩里達。"},{"english":"Then Al-Ghazali mentioned a very long supplication to be recited.","chinese":"之後，安薩里提到一段非常長的祈禱詞。"},{"english":"The Philippines is getting impatient, Mr. del Rosario said.","chinese":"羅薩里奧說，菲律賓開始失去耐心。"},{"english":"Beginning from the tucked in end, start making pleats in the Sari, about 5 inches deep.","chinese":"從年底的捲起，開始褶皺的瑪丹薩里，約5英寸深。"},{"english":"These do not match with north surrey and privet drive as we know it.","chinese":"這些都不符合我們所知道的北薩里郡及女貞路。"},{"english":"So, Klaette like a prisoner of war as being transferred to the Issa hands.","chinese":"於是，科萊特又像戰俘一樣地被移交給了埃薩里。"},{"english":"I want to have a look at some of the countryside down in Surrey and in Sussex.","chinese":"我想看看薩里和蘇塞克斯的一些小鄉村。"},{"english":"Ansari said she viewed herself as an ambassador forattractingprivate investment to space flight.","chinese":"安薩里說，她把自己看作是吸引太空私人投資的大使。"},{"english":"At the end of July, a farmer in Surui ( Surrey ) noted that two of his cows were sick.","chinese":"六月底，薩里一個農夫發現他的兩頭牛病了。"},{"english":"The University of Surrey's visual media research group is headed up by Professor Adrian Hilton.","chinese":"薩里大學的視覺媒體研究小組的領導者是希爾頓教授。"},{"english":"Vasari also went into raptures about the painting.","chinese":"瓦薩里也對這幅畫熱烈談論不止。"},{"english":"Our specialists are electronic engineers who were trained in Surrey, UK - specialising only in electronics.","chinese":"我們的工程師是在英國薩里嚴格的通過培訓。"},{"english":"Pool at Sonaisali Island resort, Sonaisali Island, near Nadi.","chinese":"索娜薩里島度假酒店的泳池。"},{"english":"Ansari also suggested the attacks may have been supported by Pakistan's spy agency.","chinese":"安薩里還建議襲擊可能是由巴基斯坦間諜機構的支持。"},{"english":"In addition to space flight, Ansari has an interest in social entrepreneurship.","chinese":"除太空飛行外，安薩里還熱衷於社會公益事業。"},{"english":"Traces still remain of the long-defunct Surrey Iron Railway.","chinese":"薩里鐵路雖然已停運很久，但仍然有跡可尋。"}],"related":[]}