{"definition":["blueprint\/source material on which later works (books, movies etc) are based"],"pinyin":["lan2 ben3"],"simplified":["蓝本"],"rank":22403.0,"normalized_rank":0.31344703594364304,"fraction":0.000001889096469220264,"cumulative_fraction":0.9799421424186491,"word":"藍本","characters":[{"definition":["blue\/indigo plant","surname Lan"],"pinyin":["Lan2","lan2"],"word":"藍"},{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"}],"containing_words":[],"sentences":[{"english":"According to Xie Wanglin's best-selling novel, based on the reality.","chinese":"根據謝旺霖同名暢銷小說改編，真人真事爲藍本。"},{"english":"Izurieta based much of his tactical thinking on Sun Tzu’s “Art of War.”","chinese":"伊蘇列塔的戰術思維主要以《孫子兵法》爲藍本。"},{"english":"But the law system in the Tang Dynasty was so perfected that successive dynasties regarded it as their original erasing.","chinese":"但是唐律體制完備，是後代封建王朝的法律藍本。"},{"english":"The film ___a novel by Lu Xun.","chinese":"這部電影以魯迅的小說爲藍本。"},{"english":"This episode marks the first episode where a new introductory credits style is used.","chinese":"這一季以第一季爲藍本，使用了新的入場信用模式。"},{"english":"It is the blueprint of the teaching of vocal music in China.","chinese":"美聲唱法成了中國聲樂教學的藍本。"},{"english":"Its obsessive clarity turns out to be theperfect basis for digital information.","chinese":"它那令人着迷的清晰被證明是數字化信息的最佳藍本。"},{"english":"Zheng Zhen always writing to Du Fu as a model was not accidental.","chinese":"鄭珍在創作上始終以杜詩爲藍本絕非偶然。"},{"english":"Blithedale is modeled on the transcendentalist community at brook farm.","chinese":"福谷是以“小溪農場”的超驗主義者公社爲藍本的。"},{"english":"Several of Hoffmann's stories provided the basis for operas and ballets.","chinese":"霍夫曼的幾部小說都被用作了歌劇和芭蕾舞劇的藍本。"}],"related":[]}