{"definition":["Tibetan ethnic group"],"pinyin":["Zang4 zu2"],"simplified":["藏族"],"rank":9691.0,"normalized_rank":0.13558966322947127,"fraction":0.000008682165335240278,"cumulative_fraction":0.927082221471928,"word":"藏族","characters":[{"definition":["Tibet\/Xizang 西藏","storehouse\/depository\/Buddhist or Taoist scripture","to conceal\/to hide away\/to harbor\/to store\/to collect"],"pinyin":["Zang4","cang2","zang4"],"word":"藏"},{"definition":["race\/nationality\/ethnicity\/clan\/by extension, social group (e.g. office workers 上班族)"],"pinyin":["zu2"],"word":"族"}],"containing_words":[{"definition":["Haixi Mongol and Tibetan autonomous prefecture (Tibetan: Mtsho-nub Sog-rigs dang Bod-rigs rang-skyong-khul) in Qinghai"],"pinyin":["Hai3 xi1 Meng3 gu3 zu2 Zang4 zu2 zi4 zhi4 zhou1"],"word":"海西蒙古族藏族自治州"},{"definition":["Ngawa Tibetan and Qiang autonomous prefecture (Tibetan: rnga ba bod rigs cha'ng rigs rang skyong khul, formerly in Kham province of Tibet), northwest Sichuan, capital Barkam 馬爾康鎮|马尔康镇[Ma3 er3 kang1 zhen4]"],"pinyin":["A1 ba4 Zang4 zu2 Qiang1 zu2 zi4 zhi4 zhou1"],"word":"阿壩藏族羌族自治州"},{"definition":["Tianzhu Tibetan Autonomous County in Wuwei 武威[Wu3 wei1], Gansu"],"pinyin":["Tian1 zhu4 Zang4 zu2 Zi4 zhi4 xian4"],"word":"天祝藏族自治縣"},{"definition":["Muli Tibetan autonomous county in Liangshan Yi autonomous prefecture 涼山彞族自治州|凉山彝族自治州[Liang2 shan1 Yi2 zu2 zi4 zhi4 zhou1], south Sichuan"],"pinyin":["Mu4 li3 Zang4 zu2 Zi4 zhi4 xian4"],"word":"木里藏族自治縣"},{"definition":["Golog Tibetan autonomous prefecture (Tibetan: Mgo-log Bod-rigs rang-skyong-khul) in south Qinghai"],"pinyin":["Guo3 luo4 Zang4 zu2 zi4 zhi4 zhou1"],"word":"果洛藏族自治州"},{"definition":["Haibei Tibetan autonomous prefecture (Tibetan: Mtsho-byang Bod-rigs rang-skyong-khul) in Qinghai"],"pinyin":["Hai3 bei3 Zang4 zu2 zi4 zhi4 zhou1"],"word":"海北藏族自治州"},{"definition":["Hainan Tibetan autonomous prefecture (Tibetan Mtsho-lho Bod-rigs rang-skyong-khul), Qinghai"],"pinyin":["Hai3 nan2 Zang4 zu2 Zi4 zhi4 zhou1"],"word":"海南藏族自治州"},{"definition":["Yushu Tibetan autonomous prefecture (Tibetan: yus hru'u bod rigs rang skyong khul) in Qinghai"],"pinyin":["Yu4 shu4 Zang4 zu2 zi4 zhi4 zhou1"],"word":"玉樹藏族自治州"},{"definition":["Gannan Tibetan autonomous prefecture in Gansu"],"pinyin":["Gan1 nan2 Zang4 zu2 zi4 zhi4 zhou1"],"word":"甘南藏族自治州"},{"definition":["Garze or Kandze, Tibetan autonomous prefecture (Tibetan: dkar mdzes bod rigs rang skyong khul), formerly in Kham province of Tibet, present Sichuan"],"pinyin":["Gan1 zi1 Zang4 zu2 zi4 zhi4 zhou1"],"word":"甘孜藏族自治州"},{"definition":["Tibetan (person)"],"pinyin":["Zang4 zu2 ren2"],"word":"藏族人"},{"definition":["Dêqên or Diqing Tibetan autonomous prefecture, northwest Yunnan, capital Jiantang 建塘鎮|建塘镇[Jian4 tang2 zhen4]"],"pinyin":["Di2 qing4 Zang4 zu2 zi4 zhi4 zhou1"],"word":"迪慶藏族自治州"},{"definition":["Huangnan Tibetan autonomous prefecture (Tibetan: Rma-lho Bod-rigs rang skyong khul) in Qinghai"],"pinyin":["Huang2 nan2 Zang4 zu2 zi4 zhi4 zhou1"],"word":"黃南藏族自治州"}],"sentences":[{"english":"The arrival of Princess Wen Cheng and promote Tibetan culture, the integration of clothing with the Central Plains.","chinese":"文成公主的到來，推動了藏族服飾同中原文化的融合。"},{"english":"This paper studies the morphology of the Tibetan dwellings in the southeast of Ganzi.","chinese":"本文研究甘孜州東南部地區藏族民居的形態。"},{"english":"Danba Hydropower Station is located in Ganzi Tibetan Autonomous Prefecture in Sichuan Province Danba County.","chinese":"丹巴水電站位於四川省甘孜藏族自治州丹巴縣境內。"},{"english":"When Peng Liyuan begins to sing, 16 actresses in Tibetan clothes accompany her with dance.","chinese":"彭麗媛演唱，十六名藏族服飾的女演員爲她伴舞。"},{"english":"There is also a supply of foreign Western Hotels, and some will have Tibetan song and dance performances.","chinese":"涉外賓館裏還供應西餐，有的還會有藏族歌舞表演。"},{"english":"Yet, most Tibetan men in northeastern India join the SFF.","chinese":"然而，印東北大部分藏族男子都加入這一特種部隊。"},{"english":"Dangchang Tibetan is situated in Minjiang-River valley in Gansu province.","chinese":"宕昌藏族位於甘肅省岷江流域。"},{"english":"In the past, there were nine Tibetan villages inhabitting the ravine, so that is why it is called “Nine-Village Ravine”.","chinese":"過去，溝中有九個藏族村寨，因此得名。"},{"english":"The collation of the ancient Tibetan medicine books had always received much attention from the Tibetan ruling class.","chinese":"藏醫藥古籍整理受到歷代藏族統治階級的重視。"},{"english":"The results indicate t the Baima Zang nationality is an independent one.","chinese":"結果表明“白馬藏族”應是一個獨立的民族。"},{"english":"Tashi delek is the Tibet an greeting . It means \"good luck\".","chinese":"扎西德勒是藏族的問候語，它的意思是“吉祥如意”。"},{"english":"Tibetan folk song cadence, rhyme Hezhe paste, attractive.","chinese":"藏族民歌抑揚頓挫，合轍貼韻，悅耳動聽。"},{"english":"Objective To understand the situation of anxiety and depression in male Tibetan with mycoplasmal infection.","chinese":"目的瞭解藏族男性支原體感染患者焦慮與抑制的狀況。"},{"english":"As far as culture is concerned, it belongs to Tibetan culture of Bailong-River basin.","chinese":"從文化上講，其屬於白龍江流域藏族文化。"},{"english":"The fourth chapter describes the viewpoint of the Tibetan novel.","chinese":"第四章敘述了藏族傳統小說觀。"},{"english":"It has been said that one would find a more complete array of Tibetan cultural relics in Panjiayuan than in a Tibetan village.","chinese":"曾有人說會找到一個更完整陣藏文物潘家園比藏族村。"}],"related":[{"definition":["Tibetan (person)"],"pinyin":["Zang4 zu2 ren2"],"word":"藏族人"},{"definition":["Nakhi ethnic group in Yunnan"],"pinyin":["Na4 xi1 zu2"],"word":"納西族"},{"definition":["Menba ethnic group"],"pinyin":["Men2 ba1 zu2"],"word":"門巴族"},{"definition":["Yi ethnic group"],"pinyin":["Yi2 zu2"],"word":"彞族"},{"definition":["Pumi ethnic group"],"pinyin":["Pu3 mi3 zu2"],"word":"普米族"},{"definition":["Tajik ethnic group"],"pinyin":["Ta3 ji2 ke4 zu2"],"word":"塔吉克族"},{"definition":["Lisu ethnic group of Yunnan"],"pinyin":["Li4 su4 zu2"],"word":"傈僳族"},{"definition":["former Kham province of Tibet, now split between Tibet and Sichuan"],"pinyin":["Kang1 ba1 Zang4 qu1"],"word":"康巴藏區"},{"definition":["Nu ethnic group"],"pinyin":["Nu4 zu2"],"word":"怒族"},{"definition":["Lhoba ethnic group of southeast Tibet"],"pinyin":["Luo4 ba1 zu2"],"word":"珞巴族"},{"definition":["Kazakh ethnic group of Xinjiang"],"pinyin":["Ha1 sa4 ke4 zu2"],"word":"哈薩克族"},{"definition":["Mongol ethnic group of north China and Inner Mongolia"],"pinyin":["Meng3 gu3 zu2"],"word":"蒙古族"},{"definition":["former Tibetan province of Kham, now split between Tibet and Sichuan"],"pinyin":["Kang1 ba1 di4 qu1"],"word":"康巴地區"},{"definition":["Yugur ethnic group of Gansu"],"pinyin":["Yu4 gu4 zu2"],"word":"裕固族"},{"definition":["Salar ethnic group of Qinghai province"],"pinyin":["Sa1 la1 zu2"],"word":"撒拉族"},{"definition":["Kyrghiz ethnic group of Xinjiang"],"pinyin":["Ke1 er3 ke4 zi1 zu2"],"word":"柯爾克孜族"}]}