{"definition":["pharmacokinetics"],"pinyin":["yao4 dong4 xue2"],"simplified":["药动学"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"藥動學","characters":[{"definition":["medicine\/drug\/substance used for a specific purpose (e.g. poisoning, explosion, fermenting)\/CL:種|种[zhong3],服[fu4],味[wei4]\/to poison"],"pinyin":["yao4"],"word":"藥"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"AIM To investigate the pharmacokinetic profile of carbamazepine (CBZ) in Chinese epilepsy patients.","chinese":"目的考察中國癲癇患者卡馬西平的羣體藥動學參數。"},{"english":"OBJECTIVE To investigate the pharmacokinetics of fosfomycin in Chinese healthy volunteers.","chinese":"目的考察磷黴素在體內的藥動學過程。"},{"english":"Objective To analyze the dynamic affection on human of ciclosporin A.","chinese":"目的分析環孢素A的人體藥動學影響因素。"},{"english":"OBJECTIVE To study pharmacokinetics of norcantharidin in human by urinary excretion method.","chinese":"目的採用尿藥法進行去甲斑蝥素人體藥動學研究。"},{"english":"By using 3P97 pharmacokinetic program, the concentration-time curves were fitted as one compartment open model.","chinese":"經用3P97藥動學程序擬合符合一室開放模型。"},{"english":"OBJECTIVE To study the effect on body pharmacokinetics of chitin as tablet additive.","chinese":"目的研究甲殼胺作爲片劑輔料對人體藥動學的影響。"},{"english":"Conclutions The pharmacokinetics of gastrodin injection in volunteers was accorded with two compartment model.","chinese":"結論天麻素注射液的人體藥動學符合藥動學二室模型。"},{"english":"Pharmacokinetics of Domestic Cilostazol Tablets in Chinese Healthy Volunteers;","chinese":"目的研究西洛他唑片在人體內的藥動學。"},{"english":"OBJECTIVE To investigate the characteristics of nasal mucosa absorption of ligustrazine phosphate and its pharmacokinetics.","chinese":"目的研究磷酸川芎嗪的鼻黏膜吸收特性及體內藥動學。"},{"english":"OBJECTIVE To investigate pharmacokinetic properties of brucine in rats.","chinese":"目的考察馬錢子鹼在大鼠體內的藥動學性質。"},{"english":"The pharmacokinetic parameters were calculated according to non - compartment model.","chinese":"用非房室模型參數估算法計算藥動學參數。"},{"english":"Effects of borneol on the pharmacokinetics of scutellarin in rats;","chinese":"目的研究大鼠灌胃給藥燈盞花乙素苷元的藥動學。"},{"english":"AIM To study the pharmacokinetics and bioavailability of clinafloxacin in rats.","chinese":"目的研究克林沙星在大鼠體內的藥動學和生物利用度。"},{"english":"OBJECTIVE To investigate the pharmacokinetics of tramadol hydrochloride in Chinese Han healthy volunteers.","chinese":"目的研究鹽酸曲馬多膠囊在漢族健康人體內的藥動學。"},{"english":"OBJECTIVE To establish a HPLC-ECD method for determining scutellarin in rat plasma and to study pharmacokinetics of scutellarein in rats.","chinese":"目的研究大鼠灌胃給藥燈盞花乙素苷元的藥動學。"}],"related":[]}