{"definition":["to discipline sb\/to punish\/disciplinary action\/to deal with (a matter)\/CL:個|个[ge4]"],"pinyin":["chu3 fen4"],"simplified":["处分"],"rank":5594.0,"normalized_rank":0.07826731772837295,"fraction":0.00002043467809626757,"cumulative_fraction":0.872098274816218,"word":"處分","characters":[{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"}],"containing_words":[],"sentences":[{"english":"The competent authorities shall impose necessary administrative and disciplinary sanctions on those who have violated the aforesaid provisions.","chinese":"違反者，主管部門應給予必要的行政或紀律處分。"},{"english":"The obligee's ratification of unauthorized disposition can validate the disposition behavior.","chinese":"權利人對無權處分的追認可以使處分行爲有效。"},{"english":"The obligee's ratification of unauthorized disposition can validate the disposition behavior.","chinese":"權利人對無權處分的追認可以使處分行爲有效。"},{"english":"The police rank of any traffic policeman who is imposed upon an administrative sanction below removal from post shall be degraded.","chinese":"受到撤職以下行政處分的交通警察，應當降低警銜。"},{"english":"Any member of the Macao Garrison who breaches military discipline shall be subject to disciplinary sanction.","chinese":"澳門駐軍人員違反軍隊紀律的，給予紀律處分。"},{"english":"He was degraded for being drunk.","chinese":"他因酗酒而受到降級處分。"},{"english":"if the case is not serious for criminal punishments, they shall be given administrative sanctions in accordance with law.","chinese":"尚不夠刑事處罰的，依法給予行政處分。"},{"english":"The deputy police commissioner yesterday promised to discipline officers found to be slack on duty.","chinese":"警務處副處長答應會對“蛇王”的警員紀律處分。"},{"english":"He was degraded from office for his dereliction of duty.","chinese":"他因瀆職而受到降級處分。"},{"english":"Part five, The protective measures of law in operation of China.","chinese":"第五部分，我國現行法上的保安處分性質措施。"},{"english":"He had been punished for covering up for a friend.","chinese":"他因包庇友人曾受到處分。"},{"english":"Should be given disciplinary action by the discipline inspection and supervision departments.","chinese":"應當給予紀律處分的，由紀檢監察部門處理。"},{"english":"those who violate traffic regulations should be punished.","chinese":"違背交通規矩的人應該受到處分。"},{"english":"The student handbook says that students will face disciplinary action if caught.","chinese":"學生手冊稱被抓到的學生將會面臨紀律處分。"},{"english":"The second part introduces the history of the right of disposition.","chinese":"第二部分介紹了處分權的歷史沿革。"},{"english":"Expulsion is the ultimate Party disciplinary measure.","chinese":"開除黨籍是黨內的最高處分。"}],"related":[{"definition":["to penalize\/to punish"],"pinyin":["chu3 fa2"],"word":"處罰"},{"definition":["to violate (rules)\/irregular\/illegal\/corrupt"],"pinyin":["wei2 gui1"],"word":"違規"},{"definition":["to fine\/penalty\/fine (monetary)"],"pinyin":["fa2 kuan3"],"word":"罰款"},{"definition":["to examine\/to investigate\/to censor out\/censorship"],"pinyin":["shen3 cha2"],"word":"審查"},{"definition":["to violate (a law)"],"pinyin":["wei2 fan3"],"word":"違反"},{"definition":["to lodge an accusation\/accusation (law)"],"pinyin":["gao4 fa1"],"word":"告發"},{"definition":["lack of discipline\/to break a rule\/to violate discipline\/to breach a principle"],"pinyin":["wei2 ji4"],"word":"違紀"},{"definition":["mechanism\/gear\/machine-operated\/office\/agency\/organ\/organization\/establishment\/institution\/body\/stratagem\/scheme\/intrigue\/plot\/trick\/CL:個|个[ge4]"],"pinyin":["ji1 guan1"],"word":"機關"},{"definition":["to punish\/to penalize"],"pinyin":["fa2"],"word":"罰"},{"definition":["to repeal\/to revoke\/(computing) to undo"],"pinyin":["che4 xiao1"],"word":"撤銷"},{"definition":["illegal\/to break the law"],"pinyin":["wei2 fa3"],"word":"違法"},{"definition":["to suspend (sb) from duties"],"pinyin":["ting2 zhi2"],"word":"停職"},{"definition":["judicial authorities"],"pinyin":["si1 fa3 ji1 guan1"],"word":"司法機關"},{"definition":["authority\/power over others"],"pinyin":["zhi2 quan2"],"word":"職權"},{"definition":["regulations\/rules\/code of conduct\/ordinances\/statutes"],"pinyin":["tiao2 li4"],"word":"條例"},{"definition":["to punish\/to administer justice"],"pinyin":["cheng2 chu3"],"word":"懲處"}]}