{"definition":["to be situated at\/to find oneself at"],"pinyin":["chu3 zai4"],"simplified":["处在"],"rank":3782.0,"normalized_rank":0.05291508681600045,"fraction":0.00003575459210254677,"cumulative_fraction":0.8231409790129353,"word":"處在","characters":[{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"},{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"}],"containing_words":[],"sentences":[{"english":"Today, however, the moon will embrace Uranus, the wild-card planet of the zodiac, in your third house of communication.","chinese":"然而今天，月亮和天王星處在你的第三宮交流宮。"},{"english":"Therefore, he is always in a state of being half crazy and half sober-minded.","chinese":"所以，他總是處在半醉半醒的狀態。"},{"english":"Parents should also acknowledge the frightening parts of the disaster when talking with a child about it.","chinese":"與孩子談話時，家長應清楚災難的可怕之處在哪裏。"},{"english":"The crust of east China has been affected by extensional stress since the Mesozoic-Ceno-zoic.","chinese":"新生代以來，中國東部地殼一直處在引張應力作用下。"},{"english":"Some artists living in China are at the doorsill to this segment.","chinese":"一些生活在中國的藝術家處在這個階段的門檻上。"},{"english":"All other metals and nonmetals lie within the boundaries of lead and diamond.","chinese":"所有其他金屬和非金屬都處在鉛和金剛石的界限之內。"},{"english":"China meet a pivotal time now. It's a new jumping-off point of history.","chinese":"現在中國正處在這樣一個關鍵時刻，歷史的新起點。"},{"english":"For water intake pump house pressure water test shall be made on the bedrock so as to define its permeability.","chinese":"取水泵房處在基岩中進行壓水試驗，以確定其透水性。"},{"english":"I think you looked as if you were half-asleep throughout the song.","chinese":"你唱歌的時候，看起來處在半睡眠狀態。"},{"english":"With Mars in Leo, you'll go after your goal with earnest.","chinese":"隨着處在獅子宮的火星，你肯定能完成你的目標。"},{"english":"We are living in a great historic era.","chinese":"我們正處在一個偉大的歷史時代。"},{"english":"It's now expecting fiscal-year results at the lower end of expectations.","chinese":"目前預計本財年公司收益將處在預測區間的低端。"},{"english":"Are we in the post-PC era?","chinese":"我們是否正處在後PC時代？"},{"english":"We are at such a juncture.","chinese":"我們正處在這樣一個關頭。"},{"english":"M. Fauchelevent almost occupied a place among these vanished beings.","chinese":"割風先生幾乎也處在這些消失的人中。"},{"english":"At present, China is in the transformation period of new and old systems.","chinese":"當前，我國處在新舊體制的轉型期。"}],"related":[]}