{"definition":["first show\/maiden appearance"],"pinyin":["chu3 zi3 xiu4"],"simplified":["处子秀"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"處子秀","characters":[{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi3","zi5"],"word":"子"},{"definition":["handsome\/refined\/elegant\/graceful\/superior\/show (loanword)\/CL:場|场[chang2]\/(literary) to grow\/to bloom\/(of crops) to produce ears"],"pinyin":["xiu4"],"word":"秀"}],"containing_words":[],"sentences":[{"english":"We faced Leyton Orient and it was actually my debut.","chinese":"我們的對手是萊頓東方，實際上那是我的處子秀。"},{"english":"Beckham came through the youth system at Old Trafford and made his debut in 1993.","chinese":"貝克漢姆出自曼聯青訓營，1993年完成處子秀。"},{"english":"A teaser will debut on Tuesday on MTV.","chinese":"一個玩笑話將在週二就MTV的處子秀。"},{"english":"Alex Oxlade-Chamberlain made his debut in that game and I'll be picking him up.","chinese":"張伯倫在那場比賽完成他的處子秀，我將會去鼓舞他。"},{"english":"Sotirios Kyrgiakos made his Liverpool debut at Bolton back in August.","chinese":"基里亞科斯八月面對博爾頓上演他的利物浦處子秀。"},{"english":"The debuts of the new players were positive, \" he said.\"","chinese":"新球員的處子秀很積極。"},{"english":"He was very young and only 16 when he made his first team debut for Charlton.","chinese":"他灰常年輕，僅僅16歲就代表查爾頓上演處子秀。"},{"english":"Hugo Rodallega made his Wigan debut as a substitute in this fixture last season.","chinese":"上賽季兩隊交鋒中羅達雷加作爲替補上演他的處子秀。"}],"related":[]}