{"definition":["an execution\/to put sb to death"],"pinyin":["chu3 si3"],"simplified":["处死"],"rank":18937.0,"normalized_rank":0.2649531991101535,"fraction":0.000002669930795304739,"cumulative_fraction":0.9721477214820112,"word":"處死","characters":[{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"},{"definition":["to die\/impassable\/uncrossable\/inflexible\/rigid\/extremely\/damned"],"pinyin":["si3"],"word":"死"}],"containing_words":[],"sentences":[{"english":"His actions led to a death sentence, which was later commuted to a prison term.","chinese":"郗浩良的行動導致被判處死刑，後來減爲有期徒刑。"},{"english":"All others who found—and opened bottles—would be put to death.","chinese":"其他發現並打開瓶中信的人將會被處死。"},{"english":"If being ugly were a crime, you'd get the electric chair.","chinese":"如果長得醜是一種罪的話，那你就應該被電刑處死。"},{"english":"Huang taiji at noon on the second day if the killer is not on the monkey to justice was put to death on her.","chinese":"皇太極下旨第二日中午如果兇手還不歸案就處死玉兒。"},{"english":"Anyone who reached the age of fifty or a bit over --- he was to be done away with.","chinese":"超過五十歲包括五十歲的人，一律被處死。"},{"english":"Mr Grant prosecuted him and watched him put to death.","chinese":"Grant先生對他提起公訴並最終看到他被處死。"},{"english":"Alex was sentenced to death for apostasy.","chinese":"亞歷克斯因叛黨而被判處死刑。"},{"english":"The exiles were forbidden to return at the peril of their lives.","chinese":"流放犯已被禁止返回，違者處死。"},{"english":"Therefore the Jewish leaders asked the Roman government to execute him.","chinese":"因而，宗教領袖要求羅馬政府處死他。"},{"english":"King Henry said she was unfaithful to him and eventually had her killed.","chinese":"英王亨利說安對他不忠，最後還將她處死。"},{"english":"By the term human sacrifice, we mean executing people and afterwards interring them in a pit in order to worship the ancestors.","chinese":"把人強行處死後埋入坑內祭祀祖先，稱爲人祭。"},{"english":"Eight rats in each group were sacrificed 28 days after intratracheal instillation.","chinese":"各組動物均於氣管內灌藥後第28天分別處死8只。"},{"english":"Anyone who took up arms against Libya would be executed, he warned.","chinese":"他警告說，任何反對利比亞的人都會被處死。"},{"english":"And she saw her husband, the aged Priam, dragged towards the household altar and ruthlessly  butchered there.","chinese":"年邁的丈夫皮安姆被拖到家庭祭壇殘酷地處死。"},{"english":"He was sentenced to death but was reprieved by the president.","chinese":"他被判處死刑但被總統下令緩期執行。"},{"english":"The Man condemned to die on Calvary.","chinese":"這個被定罪要被處死在髑髏地的人。"}],"related":[{"definition":["to execute (a condemned criminal)"],"pinyin":["chu3 jue2"],"word":"處決"},{"definition":["house arrest"],"pinyin":["ruan3 jin4"],"word":"軟禁"},{"definition":["to deport\/to expel"],"pinyin":["qu1 zhu2 chu1 jing4"],"word":"驅逐出境"},{"definition":["to imprison\/to lock up (in jail)"],"pinyin":["guan1 ya1"],"word":"關押"},{"definition":["to kill\/to murder"],"pinyin":["zhu1 sha1"],"word":"誅殺"},{"definition":["to expel (a member of an organization)\/to fire (an employee)"],"pinyin":["kai1 chu2"],"word":"開除"},{"definition":["unfettered and beyond the law (idiom); evading retribution\/getting away with it (e.g. crimes)\/still at large"],"pinyin":["xiao1 yao2 fa3 wai4"],"word":"逍遙法外"},{"definition":["traitor"],"pinyin":["mai4 guo2 zei2"],"word":"賣國賊"},{"definition":["not to shrink from any crime (idiom); to commit any imaginable misdeed"],"pinyin":["wu2 e4 bu4 zuo4"],"word":"無惡不作"},{"definition":["to entrap\/to frame\/to plant false evidence against sb"],"pinyin":["wu1 xian4"],"word":"誣陷"},{"definition":["to conspire to murder\/to plot against sb's life"],"pinyin":["mou2 hai4"],"word":"謀害"},{"definition":["to denounce\/to condemn\/to call to account\/to punish"],"pinyin":["wen4 zui4"],"word":"問罪"},{"definition":["supreme penalty\/execution"],"pinyin":["ji2 xing2"],"word":"極刑"},{"definition":["to accompany\/to follow\/to attend\/entourage\/attendant"],"pinyin":["sui2 cong2"],"word":"隨從"},{"definition":["to guard\/to defend"],"pinyin":["shou3 wei4"],"word":"守衛"},{"definition":["extermination of an entire family (ancient Chinese punishment)"],"pinyin":["mie4 zu2"],"word":"滅族"}]}