{"definition":["to be lacking\/to fall short of\/to wane\/deficit\/deficient"],"pinyin":["kui1 que1"],"simplified":["亏缺"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"虧缺","characters":[{"definition":["deficiency\/deficit\/luckily\/it's lucky that...\/(often ironically) fancy that..."],"pinyin":["kui1"],"word":"虧"},{"definition":["deficiency\/lack\/scarce\/vacant post\/to run short of"],"pinyin":["que1"],"word":"缺"}],"containing_words":[],"sentences":[{"english":"The water condition of stony trough is worse than soil surface.","chinese":"石槽水分虧缺最嚴重，土面次之。"},{"english":"Water stress can decrease the availability of soil nutrients.","chinese":"水分虧缺可使土壤養分的有效性降低。"},{"english":"The moon wax till it become full, and then wane.","chinese":"月亮漸漸變圓直至滿盈，然後再變虧缺。"},{"english":"The water deficit stress resulted in the accumulation of endogenous polyamines in wheat leaves.","chinese":"水分虧缺脅迫導致小麥葉片內源多胺累積。"},{"english":"Under water stress, leaf water content decreased and leaf water deficit intensified.","chinese":"在乾旱脅迫下，葉片含水量減少，葉片水分虧缺嚴重。"},{"english":"The biomass formation of the herbage was a process in which soil moisture was of deficit gradually.","chinese":"沙打旺生物量形成過程中土壤水分逐漸虧缺。"},{"english":"You shall wane, but you shall wax again.","chinese":"你會虧缺，但也會再轉盈。"},{"english":"The company should end the financial year in the back.","chinese":"公司正在財政年度末該當有虧缺。"},{"english":"The potassium was deficient all along with high proportion.","chinese":"而鉀素平衡一直呈大比例虧缺。"},{"english":"She does not wane, but my fortune.","chinese":"伊尚未虧缺，而吾之命運。"},{"english":"Limited water deficient benefit assimilate transporting to seeds.","chinese":"有限度的水分虧缺，有利於同化物向籽粒調運。"},{"english":"Water deficit and soil infertile is the main limited factor in arid agricultural production.","chinese":"旱地農業生產的主要限制因素是水分虧缺和土壤貧瘠。"},{"english":"The moon wanes to make him a cradle.","chinese":"月亮就會虧缺，來爲他做一張搖籃。"}],"related":[]}