{"definition":["to blend into\/to integrate\/to assimilate\/to merge"],"pinyin":["rong2 ru4"],"simplified":["融入"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"融入","characters":[{"definition":["to melt\/to thaw\/to blend\/to merge\/to be in harmony"],"pinyin":["rong2"],"word":"融"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"}],"containing_words":[],"sentences":[{"english":"Getting it to civilization is another.","chinese":"讓它融入現代文明是另一方面。"},{"english":"High performing teams do an excellent job of \"on-boarding\" the new team member(s).","chinese":"高績效團隊在幫助新人融入方面也做得很出色。"},{"english":"Content Analysis Study on Character Education in Textbooks of Learning Area of Integrated …","chinese":"臺灣國民小學中年級綜合活動領域教科書融入品德。"},{"english":"The boys suffered loneliness, homesickness, \"Pommy bashing\" and culture shock.","chinese":"他們不能融入當地社會，還遭遇文化衝突。"},{"english":"The huts darkled away into the gloom of the field.","chinese":"那些茅舍逐漸變模糊，融入了一片蒼茫的原野中。"},{"english":"a. The economy of China will merge into the tide of the world economy. b. The economy of China will converge with that of the world economy.","chinese":"中國的經濟將融入世界經濟的大潮。"},{"english":"Painters were hired to try and blend the huge, obtrusive towers into the landscape.","chinese":"受僱的畫家嘗試着將突兀的巨塔融入周圍的風景之中。"},{"english":"This, and only by this, can the Dharma truly infuse our minds.","chinese":"只有這樣，才能使正法真正融入自相續。"},{"english":"It's a chance for Poland to be in the mainstream of the EU, and to be engaged in global affairs, \" Balcer noted.\"","chinese":"這是波蘭融入歐盟主流，參與全球事務的一個機會。"},{"english":"It is successfully integrated into the Park, making various references to the surrounding city.","chinese":"它成功地融入公園，與周邊城市形成各種參照。"},{"english":"The former Atletico Madrid keeper is wasting little time becoming integrated at United and adapting to his new surroundings.","chinese":"前馬競門將正在嘗試融入球隊，並與新隊友配合。"},{"english":"With his friendly manners and loyalty he perfectly fitted into our team.","chinese":"他的友善和忠誠使他很好地融入了我們的團隊。"},{"english":"There are much knowledge on law and commerce in his works.","chinese":"海巖作品中融入了豐富的法律知識和商業知識。"},{"english":"Clason offers personal finance wisdom in the form of parables.","chinese":"Clason將個人理財智慧融入寓言之中。"},{"english":"New stars have joined the club, but the group became well-oiled.","chinese":"新的球星融入了球隊，但是球隊之間的磨合很好。"},{"english":"The building unfurls and is folded into the railroad landscape and composite urban fabric.","chinese":"建築在鐵路景觀與綜合城市肌理中展開，並融入其中。"}],"related":[{"definition":["a mixture\/an amalgam\/fusion\/welding together\/to be in harmony with (nature)\/to harmonize with\/to fit in"],"pinyin":["rong2 he2"],"word":"融合"},{"definition":["to fuse together (idiom)\/hypostatic union (religion)"],"pinyin":["rong2 wei2 yi1 ti3"],"word":"融為一體"},{"definition":["to pour into\/to empty into"],"pinyin":["zhu4 ru4"],"word":"注入"},{"definition":["marrow\/pith\/quintessence\/essence"],"pinyin":["jing1 sui3"],"word":"精髓"},{"definition":["(lit. and fig.) to permeate\/to seep into\/(of a product, idea etc) to penetrate (in a population)\/(of hostile forces) to infiltrate\/(chemistry) osmosis"],"pinyin":["shen4 tou4"],"word":"滲透"},{"definition":["to draw into\/to pull into\/to introduce"],"pinyin":["yin3 ru4"],"word":"引入"},{"definition":["mix together\/put together (usu. things that do not blend well together)"],"pinyin":["rou2 he2"],"word":"糅合"},{"definition":["element\/element of a set\/chemical element"],"pinyin":["yuan2 su4"],"word":"元素"},{"definition":["fusion\/to combine as one"],"pinyin":["rong2 hui4"],"word":"融匯"},{"definition":["to permeate"],"pinyin":["shen4 ru4"],"word":"滲入"},{"definition":["to blend\/to mix"],"pinyin":["jiao1 rong2"],"word":"交融"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"體現"},{"definition":["to run through\/a connecting thread from beginning to end\/to link"],"pinyin":["guan4 chuan1"],"word":"貫穿"},{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"word":"展現"},{"definition":["to adapt\/to fit\/to suit"],"pinyin":["shi4 ying4"],"word":"適應"},{"definition":["to create\/to build\/to develop\/to forge (of metal)"],"pinyin":["da3 zao4"],"word":"打造"}]}