{"definition":["screw"],"pinyin":["luo2 ding1"],"simplified":["螺钉"],"rank":35739.0,"normalized_rank":0.5000349782435325,"fraction":5.675610132391923e-7,"cumulative_fraction":0.9944819330098912,"word":"螺釘","characters":[{"definition":["spiral shell\/snail\/conch"],"pinyin":["luo2"],"word":"螺"},{"definition":["nail\/to follow closely\/to keep at sb (to do sth)\/variant of 盯[ding1]","to join things together by fixing them in place at one or more points\/to nail\/to pin\/to staple\/to sew on"],"pinyin":["ding1","ding4"],"word":"釘"}],"containing_words":[{"definition":["hexagon socket head cap screw"],"pinyin":["nei4 liu4 jiao3 yuan2 zhu4 tou2 luo2 ding1"],"word":"內六角圓柱頭螺釘"}],"sentences":[{"english":"Use percussive drill to enlarge holes. Install expansion plugs and secure with wood screws.","chinese":"直接塞上膨脹塞並用75MM的木螺釘固定。"},{"english":"The crew unscrewed the screws from the sewing-machine and chewed them.","chinese":"海員們從縫紉機上旋下螺釘並咀嚼它們。"},{"english":"The pothole fractured a bolt on the axle.","chinese":"壺穴使車軸上的一隻螺釘破碎。"},{"english":"Install screws attaching seat function switch to seat trim panel.","chinese":"安裝連接座椅功能開關至座椅飾板的螺釘。"},{"english":"Side view of wing screw with adjustable thread length.","chinese":"螺紋長度可調整的翼形螺釘的側面圖。"},{"english":"They are easy to pick out because they do not have as sharp a point as wood screws do.","chinese":"他們是容易辨認，因爲他們沒有一點爲削木螺釘。"},{"english":"CKP sensor rotor plate is fitted to crankshaft counterweight No. 1 by pin and screws.","chinese":"轉子板的CKP傳感器安裝在曲軸銷和螺釘重第一。"},{"english":"Objective To analyze biomechanical property of three methods of sacral screw.","chinese":"目的研究三種骶骨螺釘植入法的生物力學性能。"},{"english":"The curved screw at the femoral calcar was found in the experimental side.","chinese":"有一隻山羊實驗側螺紋釘出現彎曲，爲股骨距處螺釘。"},{"english":"Variation of the screw angle results in reduction of purchase of the locking interface, or cross-threading the head.","chinese":"螺釘角度的變異會致使鎖定界面的減少或跨螺紋的頭。"},{"english":"The risk of ICA injury from C1 screws is unknown.","chinese":"C1螺釘固定頸內動脈的危險還不知道。"},{"english":"The full screw cap results in the tube being able to stand independently in the kitchen cupboard.","chinese":"完整的螺釘內能夠站在廚櫃獨立管帽的結果。"},{"english":"The Trauson Cannulated Screws are available in a wide range of sizes for varied clinical situations.","chinese":"創生中空螺釘規格齊全，以適應不同的臨牀需要。"},{"english":"Fix through flashing into battens using specified screws.","chinese":"採用特定螺釘通過收邊泛水和掛瓦條連接固定。"},{"english":"Hexalobular socket countersunk head tapping screws.","chinese":"沉頭內六角攻絲螺釘。"},{"english":"They include front located gain controls, XLR and screw terminal connectors.","chinese":"他們包括前設增益控制，XLR和螺釘終端連接器。"}],"related":[]}