{"definition":["creep (materials science)"],"pinyin":["ru2 bian4"],"simplified":["蠕变"],"rank":62415.0,"normalized_rank":0.8732668280329635,"fraction":2.758977147690518e-8,"cumulative_fraction":0.9998979182834732,"word":"蠕變","characters":[{"definition":["to squirm\/to wiggle\/to wriggle\/Taiwan pr. [ruan3]"],"pinyin":["ru2"],"word":"蠕"},{"definition":["to change\/to become different\/to transform\/to vary\/rebellion"],"pinyin":["bian4"],"word":"變"}],"containing_words":[],"sentences":[{"english":"The mechanism of high temperature creep associated with the climb of extended dislocations is investigated.","chinese":"本文研究了擴展位錯攀移的高溫蠕變機制。"},{"english":"The experimental results of the creeping effect for aluminium field wire are reported.","chinese":"報道了對鋁場絲蠕變效應研究的結果。"},{"english":"Simulated galvanic cell tests and stress corrosion tests using pre-creeping specimens were conducted.","chinese":"進行了模擬原電池試驗和預蠕變試樣的應力腐蝕試驗。"},{"english":"The anisotropy of compression creep strength in a nickel-base single crystal superalloy was investigated.","chinese":"研究了鎳基單晶高溫合金壓縮蠕變強度的各向異性。"},{"english":"It resists tearing, flex-cut growth, creep and abrasion.","chinese":"它抗撕，柔性切割增長，蠕變和磨損。"},{"english":"When the alloy contains no or excess magnesium, its creep properties will decline.","chinese":"不含鎂或鎂含量過高的合金，其蠕變性能均有所下降。"},{"english":"The Paper discusses the test system for material creep with advanced VXI instrument BUS.","chinese":"介紹了具有先進VXI儀器總線的材料蠕變測試系統。"},{"english":"Thus, this paper find the thinking of researching creep shope deformation on prediction.","chinese":"從而總結出了研究蠕變邊坡變形預測的一種新思路。"},{"english":"The creep deformation is controlled by dislocation climb resulting from lattice self-diffusion.","chinese":"該合金的蠕變由晶格自擴散引起的位錯攀移所控制。"},{"english":"The laws and facts of cryogen creep of metal materials have been discussed.","chinese":"討論了金屬材料的低溫蠕變現象和規律。"},{"english":"Then, the effects of schistosity planes on creep laws of mica-quartz schist are analyzed.","chinese":"分析片理面對二雲石英片岩蠕變的影響。"},{"english":"The creep mechanisms of both composites are dislocation-climbing mechanism.","chinese":"兩種複合材料的蠕變機制均爲位錯攀移機制。"},{"english":"The creep strain of nonwoven geotextiles is measured by using the method of photic leverage.","chinese":"本文采用光槓杆法對非織造土工布蠕變量進行測試。"},{"english":"Creep and elastic losses.","chinese":"蠕變與彈性損失。"},{"english":"The creep property of nonwoven geotextiles is described well with the model.","chinese":"該模型可較好地描述非織造土工織物的蠕變性能。"},{"english":"PMMA has a room temperature creep.","chinese":"PMMA具有室溫蠕變特性。"}],"related":[]}