{"definition":["blood pressure meter\/sphygmomanometer"],"pinyin":["xue4 ya1 ji4"],"simplified":["血压计"],"rank":41772.0,"normalized_rank":0.5844444755362165,"fraction":3.245082645140752e-7,"cumulative_fraction":0.997115332466142,"word":"血壓計","characters":[{"definition":["blood\/colloquial pr. [xie3]\/CL:滴[di1],片[pian4]"],"pinyin":["xue4"],"word":"血"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"計"}],"containing_words":[],"sentences":[{"english":"Give it a try if youhave a blood pressure monitor at home.","chinese":"如果你家中有血壓計，你可以試一下。"},{"english":"The present invention is indication tube of sphygmomanometer, and belongs to the field of medical equipment technology.","chinese":"一種血壓計的示值管，屬於醫療器械技術領域。"},{"english":"At whose blood pressure measuring is the earliest tonometer used?","chinese":"最早的血壓計用於測量誰的血壓？"},{"english":"Sphygmomanometer is a kind of instrument which can measure pressure blood.","chinese":"血壓計是測量血壓的儀器。"},{"english":"CONCLUSIONS The cuff of sphygmomanometer should be sterilized regularly.","chinese":"結論血壓計袖帶必須定期消毒。"},{"english":"Conclusion Normal sphygmomanometer can effective measure the artifical airway ballonet pressure.","chinese":"結論普通血壓計同樣可準確測定人工氣道氣囊壓力。"},{"english":"Objective To determine the accuracy of electronic wrist blood pressure monitor.","chinese":"目的確定腕式電子血壓計的準確性。"},{"english":"Methods Random measurement of blood pressure was made to 2000 new students.","chinese":"方法用水銀柱血壓計隨機檢測2000名新生血壓。"},{"english":"The dynamic digital display sphygmomanometer is designed by using the technology of weak signal detection.","chinese":"利用微弱信號檢測技術，設計了動態數顯血壓計。"},{"english":"Mercury blood-pressure devices for use by professionals have, however, escaped being banned.","chinese":"但是供專業人士使用的水銀血壓計不在此禁令之內。"},{"english":"Objective To test the accuracy of the electronic sphygmomanometer arm.","chinese":"目的測試臂式電子血壓計測量準確性。"},{"english":"Where do there is ohm of dragon electron sphygmomanometer in Ningbo?","chinese":"寧波哪裏有歐姆龍電子血壓計？"},{"english":"The instrument error that contributes to the greatest variability is the cuff size of the sphygmomanometer.","chinese":"變異性中佔比例最大的設備誤差是血壓計袖套的大小。"},{"english":"All air is expressed from the sphygmomanometer or pneumatic tourniquet before application.","chinese":"應在止血帶或血壓計使用前壓出所有剩餘氣體。"}],"related":[]}