{"definition":["schistosoma"],"pinyin":["xue4 xi1 chong2"],"simplified":["血吸虫"],"rank":22961.0,"normalized_rank":0.3212541799001021,"fraction":0.0000017893937500735646,"cumulative_fraction":0.9809683312686798,"word":"血吸蟲","characters":[{"definition":["blood\/colloquial pr. [xie3]\/CL:滴[di1],片[pian4]"],"pinyin":["xue4"],"word":"血"},{"definition":["to breathe\/to suck in\/to absorb\/to inhale"],"pinyin":["xi1"],"word":"吸"},{"definition":["lower form of animal life, including insects, insect larvae, worms and similar creatures\/CL:條|条[tiao2],隻|只[zhi1]\/(fig.) person with a particular undesirable characteristic"],"pinyin":["chong2"],"word":"蟲"}],"containing_words":[{"definition":["schistosomiasis"],"pinyin":["xue4 xi1 chong2 bing4"],"word":"血吸蟲病"}],"sentences":[{"english":"For schistosomiasis: xiong huang with nan gua zi (pumpkin seeds), bin nang.","chinese":"血吸蟲病，可與南瓜子，檳榔等同用。"},{"english":"Schistosomes also possess what seems to be a cloak of invisibility: an unusual covering known as the tegument .","chinese":"血吸蟲還有一種如同隱形披風的特殊外衣，稱爲體壁。"},{"english":"Praziquantel is the only available treatment against all forms of schistosomiasis.","chinese":"吡喹酮是唯一可用於治療各種類型血吸蟲病的藥物。"},{"english":"Objective To construct a multivalent DNA vaccine.","chinese":"目的構建日本血吸蟲多價DNA疫苗。"},{"english":"The cloning and expression of the gene encoding S japonicum tropomyosin had been successfully made.","chinese":"日本血吸蟲原肌球蛋白編碼基因克隆和原核表達成功。"},{"english":"Objective To explore the risk factors of cerebral schistosomiasis japonica .","chinese":"目的探討腦型血吸蟲病發病的危險因素。"},{"english":"Chinese Journal of Schistosomiasis Contr…","chinese":"中國血吸蟲病防治雜誌。"},{"english":"The economic and health effects of schistosomiasis are considerable.","chinese":"血吸蟲病造成相當嚴重的經濟和健康影響。"},{"english":"During the first half of the 20th century, schistosomiasis was widespread in the Yangtze River Valley.","chinese":"20世紀上半期，血吸蟲病氾濫於長江流域。"},{"english":"It is concluded that schistosomiasis status is stable in Zhejiang province, however, the prevalence factor for re-emerging of schistosomiasis is still in existence.","chinese":"結論浙江省血吸蟲病疫情穩定，但流行條件仍然存在。"},{"english":"Until now, the main drug used to treat bilharzia has been praziquantel.","chinese":"到目前爲止，吡喹酮是治療血吸蟲病的主要藥物。"},{"english":"Rates of bilharzia, the second most economically devastating disease after malaria, are increasing in China.","chinese":"在中國，血吸蟲病的個案正逐步遞增。"},{"english":"Oncomelania diffusion is the major way of spreading schistosomiasis.","chinese":"釘螺擴散是血吸蟲病傳播的最主要途徑。"},{"english":"Objective To survey the epidemic change of schistosomiasis by emigration from xinjizhou.","chinese":"目的觀察新洲居民遷移對血吸蟲病流行的影響。"},{"english":"Objective To explore the way of fast control of schistosome infectivity in susceptible zones.","chinese":"目的探討快速控制血吸蟲病易感地帶感染性的方法。"},{"english":"Schistosoma japonicum has been spreading across China in recent years.","chinese":"日本血吸蟲近年來在中國重新流行。"}],"related":[]}