{"definition":["blood vessels"],"pinyin":["xue4 mai4"],"simplified":["血脉"],"rank":17758.0,"normalized_rank":0.2484574594602157,"fraction":0.000003008306934370698,"cumulative_fraction":0.9688027618204368,"word":"血脈","characters":[{"definition":["blood\/colloquial pr. [xie3]\/CL:滴[di1],片[pian4]"],"pinyin":["xue4"],"word":"血"},{"definition":["arteries and veins\/vein (on a leaf, insect wing etc)","see 脈脈|脉脉[mo4 mo4]"],"pinyin":["mai4","mo4"],"word":"脈"}],"containing_words":[{"definition":["lit. blood vessels swell wide (idiom)\/fig. one's blood runs quicker\/to be excited"],"pinyin":["xue4 mai4 fen4 zhang1"],"word":"血脈僨張"}],"sentences":[{"english":"We are noodle folk. Broth runs through our veins.","chinese":"我們是做麪條的，血脈裏流淌着湯汁。"},{"english":"And evetually the Chinese people chose Marxism, for which is related by blood with the Chinese traditional culture.","chinese":"馬克思主義和中國傳統文化血脈是相通的。"},{"english":"For the protection of ZhongLiang blood, shaolin the monk would die rather than surrender, strive to resist.","chinese":"爲保護忠良的血脈，少林衆僧寧死不屈，奮力抵抗。"},{"english":"Every time I come here I can relate myself to many things.","chinese":"每次到中國來我都感到自己與許多事情血脈相連。"},{"english":"We must never sever the cultural vein of our nation.","chinese":"我們不能割斷民族的文化血脈。"},{"english":"These drawer-dropping beauties in skintight leather trousers.","chinese":"這些讓人血脈賁張的美人兒穿着性感的緊身皮褲。"},{"english":"You are the blood of the dragon, you can make a hat.","chinese":"你是真龍血脈，你一定能編出一頂帽子的。"},{"english":"Traditional values emphasise conventional family life and the continuation of blood lines.","chinese":"傳統價值觀強調的是常規的家庭生活以及血脈的延續。"},{"english":"We are part of China. Our futures are forever linked.","chinese":"香港是中國一部分，血脈相連，榮辱與共。"},{"english":"We have to nanytime bisect the cultural attitude of our nation.","chinese":"咱們不能切斷民族的文化血脈。"},{"english":"XT in large dosage could also increase the brain weight in scopolamine models.","chinese":"血脈通大劑量還明顯提高東莨菪鹼模型的腦重指數。"},{"english":"His son is the only remaining survivor of the royal bloodline.","chinese":"他的兒子凱爾薩斯王子是這個皇家血統的最後血脈。"},{"english":"Your heart starts to beat a little faster, your blood starts flowing quicker, and your breath gets shorter.","chinese":"你的心跳加速，血脈賁張，呼吸也急促起來。"},{"english":"Each of your blood will be inside my body, effort connected.","chinese":"你的每個血脈，都會在我的身體裏面，心血相連。"},{"english":"Blood is thicker than water. Our veins are bounded .","chinese":"血濃於水，血脈相連。"},{"english":"All things are connected like the blood which unites one family.","chinese":"世間萬物皆血脈相連，親如一家。"}],"related":[{"definition":["channel of TCM"],"pinyin":["jing1 mai4"],"word":"經脈"},{"definition":["the Chinese people"],"pinyin":["Zhong1 hua2 min2 zu2"],"word":"中華民族"},{"definition":["arteries and veins\/network of blood vessels\/vascular system (of a plant or animal)\/(fig.) fabric (i.e. underlying structure, as in \"social fabric\")\/overall context"],"pinyin":["mai4 luo4"],"word":"脈絡"},{"definition":["linked in countless ways"],"pinyin":["qian1 si1 wan4 lu:3"],"word":"千絲萬縷"},{"definition":["qi and blood (two basic bodily fluids of Chinese medicine)"],"pinyin":["qi4 xue4"],"word":"氣血"},{"definition":["lit. source is distant and the flow is long (idiom); fig. sth goes back to the dim and distant past\/a lot of water has flowed under the bridge since then"],"pinyin":["yuan2 yuan3 liu2 chang2"],"word":"源遠流長"},{"definition":["prosperity and decline (of a kingdom)\/rise and fall"],"pinyin":["xing1 shuai1"],"word":"興衰"},{"definition":["descendants of the Fiery Emperor and the Yellow Emperor (i.e. Han Chinese people)"],"pinyin":["Yan2 Huang2 zi3 sun1"],"word":"炎黃子孫"},{"definition":["to nourish"],"pinyin":["zi1 yang3"],"word":"滋養"},{"definition":["hidden beneath the surface\/buried and concealed"],"pinyin":["qian2 cang2"],"word":"潛藏"},{"definition":["healthy environment\/healthy atmosphere\/righteousness\/vital energy (in Chinese medicine)"],"pinyin":["zheng4 qi4"],"word":"正氣"},{"definition":["to search\/to seek\/to explore"],"pinyin":["tan4 xun2"],"word":"探尋"},{"definition":["breath\/smell\/odor\/flavor"],"pinyin":["qi4 xi1"],"word":"氣息"},{"definition":["race\/ethnicity"],"pinyin":["zhong3 zu2"],"word":"種族"},{"definition":["to condense\/to solidify\/to coagulate\/clot (of blood)"],"pinyin":["ning2 jie2"],"word":"凝結"},{"definition":["opportunity to live\/to reprieve from death\/life force\/vitality"],"pinyin":["sheng1 ji1"],"word":"生機"}]}