{"definition":["to exercise power"],"pinyin":["xing2 shi3 zhi2 quan2"],"simplified":["行使职权"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"行使職權","characters":[{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"},{"definition":["to make\/to cause\/to enable\/to use\/to employ\/to send\/to instruct sb to do sth\/envoy\/messenger"],"pinyin":["shi3"],"word":"使"},{"definition":["office\/duty"],"pinyin":["zhi2"],"word":"職"},{"definition":["authority\/power\/right\/(literary) to weigh\/expedient\/temporary","surname Quan"],"pinyin":["Quan2","quan2"],"word":"權"}],"containing_words":[],"sentences":[{"english":"Where a director encounters barriers when he normally exercises his power, he shall report it to the CIRC .","chinese":"董事正常行使職權遇到障礙，應當向中國保監會報告。"},{"english":"I feel this is meddlesome , if be proper exercise powers and authorities of office, what are you afraid of?","chinese":"我覺得這是好事，如果是正當行使職權，你怕什麼？"},{"english":"Whether factory has the quality the director general, independently exercises authority to the product quality.","chinese":"工廠是否有質量總監，對產品質量獨立行使職權。"},{"english":"The board of shareholders is the company's governing body, and shall exercise its powers in accordance with this Law.","chinese":"股東會是公司的權力機構，依照本法行使職權。"},{"english":"Whether there is independence the quality control for exercising authority personnel?","chinese":"是否有獨立行使職權的質量控制人員？"}],"related":[]}