{"definition":["practicable\/realizable\/will work"],"pinyin":["xing2 de5 tong1"],"simplified":["行得通"],"rank":34381.0,"normalized_rank":0.4810347963566661,"fraction":6.409877595507443e-7,"cumulative_fraction":0.9936632901864932,"word":"行得通","characters":[{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)","to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc"],"pinyin":["tong1","tong4"],"word":"通"}],"containing_words":[],"sentences":[{"english":"Pablo must have a sound plan or he would not have tried it.","chinese":"巴勃羅一定有個行得通的方案，否則他不會這麼幹。"},{"english":"This idea will work.","chinese":"這個主意行得通。"},{"english":"You do what works for your child.","chinese":"你要做對你孩子行得通的事情。"},{"english":"I think your suggestion is avaible.","chinese":"我看你的建議行得通。"},{"english":"Mining metals from asteroids seems a bonkers idea. But could it work?","chinese":"小行星採礦這想法聽似瘋狂，但行得通嗎？"},{"english":"Whether it can work is one question.","chinese":"這能否行得通是一個問題。"},{"english":"This strategy transfers well to books and furniture.","chinese":"這個策略在書和傢俱上同樣行得通。"},{"english":"I would like to open a Weifang Mi Fendian Guilin, I do not know if it works?","chinese":"我想在濰坊開一家桂林米粉店，不知道是否行得通？"},{"english":"I'm asking you. Do you think that would work?","chinese":"我在問你呢。這招行不行得通？"},{"english":"It is advisable that these regulations be abolished.","chinese":"消除這些個規則的講法是行得通的。"},{"english":"In this case, some combination of approaches may be possible.","chinese":"在這種情況下，一些方案組合也許行得通。"},{"english":"So is it correct English to split infinitives?","chinese":"那麼拆分不定式到底行不行得通呢？"},{"english":"Itworks there and there is great team spirit on those teams.","chinese":"在那行得通，而且那些團隊也具有偉大的團隊精神。"},{"english":"I assumed a business visa would be required.","chinese":"我想商務簽證應該可以行得通。"},{"english":"Time changed, the strategy of being bestial a century ago is not easily applicable nowadays.","chinese":"一百年前行得通的橫蠻現在不容易，時空都不同了。"},{"english":"A local team, Miami FC, said they will try out for it.","chinese":"當地的邁阿密聯合球隊說，他們將試試看是否行得通。"}],"related":[{"definition":["won't work\/will get (you) nowhere"],"pinyin":["xing2 bu5 tong1"],"word":"行不通"},{"definition":["feasible"],"pinyin":["ke3 xing2"],"word":"可行"},{"definition":["to be effective (idiom)"],"pinyin":["xing2 zhi1 you3 xiao4"],"word":"行之有效"},{"definition":["feasibility"],"pinyin":["ke3 xing2 xing4"],"word":"可行性"},{"definition":["this road is blocked\/fig. This method does not work.\/Doing this is no good."],"pinyin":["ci3 lu4 bu4 tong1"],"word":"此路不通"},{"definition":["(of sb who ostensibly collaborated with the Japanese during the Sino-Japanese war of 1937-1945) to secretly work for the Nationalists or against the Communists"],"pinyin":["qu1 xian4 jiu4 guo2"],"word":"曲線救國"},{"definition":["plan of convenience (idiom); stop-gap measure\/makeshift stratagem\/interim step"],"pinyin":["quan2 yi2 zhi1 ji4"],"word":"權宜之計"},{"definition":["to get sth done once and for all"],"pinyin":["yi1 lao2 yong3 yi4"],"word":"一勞永逸"},{"definition":["appropriate to any place and any time (idiom); universally applicable\/a panacea"],"pinyin":["fang4 zhi1 si4 hai3 er2 jie1 zhun3"],"word":"放之四海而皆准"},{"definition":["efficacious\/useful"],"pinyin":["guan3 yong4"],"word":"管用"},{"definition":["to take an alternate route (idiom)\/to find an alternative\/to take a different approach\/to blaze a new trail"],"pinyin":["ling4 pi4 xi1 jing4"],"word":"另闢蹊徑"},{"definition":["acceptable\/desirable\/worth having"],"pinyin":["ke3 qu3"],"word":"可取"},{"definition":["method\/way\/approach"],"pinyin":["lu4 zi5"],"word":"路子"},{"definition":["to satisfy rival demands (idiom)\/to get the best of both worlds\/to have it both ways\/to have one's cake and eat it too"],"pinyin":["liang3 quan2 qi2 mei3"],"word":"兩全其美"},{"definition":["to imagine the wildest thing\/to indulge in fantasy"],"pinyin":["yi4 xiang3 tian1 kai1"],"word":"異想天開"},{"definition":["lunatic ravings\/nonsense\/pipe dream"],"pinyin":["chi1 ren2 shuo1 meng4"],"word":"痴人說夢"}]}