{"definition":["(registered) company"],"pinyin":["hang2 hao4"],"simplified":["行号"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"行號","characters":[{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"},{"definition":["ordinal number\/day of a month\/mark\/sign\/business establishment\/size\/ship suffix\/horn (wind instrument)\/bugle call\/assumed name\/to take a pulse\/classifier used to indicate number of people","roar\/cry\/CL:個|个[ge4]"],"pinyin":["hao2","hao4"],"word":"號"}],"containing_words":[],"sentences":[{"english":"When used within a module, for example, the error message includes the module name and line number.","chinese":"當在模塊中使用時，錯誤消息中包含模塊名稱和行號。"},{"english":"Additionally, a row number is assigned to each row.","chinese":"此外，每個行被賦予一個行號。"},{"english":"An editor that displays line numbers will help you find errors quickly.","chinese":"顯示行號的編輯器能幫助您快速找到錯誤。"},{"english":"Added file and line numbers to all sexp nodes.","chinese":"爲每個sexp節點新增的文件和行號。"},{"english":"The line numbers in the left column represent the original source as seen by the user.","chinese":"左列中的行號表示用戶所見的初始源。"},{"english":"Material changes were made to steel for airplanes line number 814 and on.","chinese":"行號爲814及以後的飛機已經做好材料升級的準備。"},{"english":"The line number displayed may not always be where the actual error originated.","chinese":"錯誤消息中顯示的行號不一定是出現錯誤的實際位置。"},{"english":"The left-hand column shows the line number.","chinese":"最左邊一欄顯示行號。"},{"english":"Otherwise, from the value of the starting line number.","chinese":"否則從以該值爲行號的起始值。"},{"english":"It includes basics such as line numbering and cursor and character positions and counts.","chinese":"它包括基礎知識，如行號和遊標和字符的位置和計數。"},{"english":"Given the column number and the row number, the formula works like a charm.","chinese":"指定列號和行號後，這些公式將發揮它們的作用。"}],"related":[]}