{"definition":["Methodists"],"pinyin":["Wei4 li3 Gong1 hui4"],"simplified":["卫理公会"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"衛理公會","characters":[{"definition":["surname Wei\/vassal state during the Zhou Dynasty (1066-221 BC), located in present day Henan and Hebei Provinces","to guard\/to protect\/to defend\/abbr. for 衛生|卫生, hygiene\/health\/abbr. for 衛生間|卫生间, toilet"],"pinyin":["Wei4","wei4"],"word":"衛"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"},{"definition":["public\/collectively owned\/common\/international (e.g. high seas, metric system, calendar)\/make public\/fair\/just\/Duke, highest of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/honorable (gentlemen)\/father-in-law\/male (animal)"],"pinyin":["gong1"],"word":"公"},{"definition":["can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])","to balance an account\/accountancy\/accounting"],"pinyin":["hui4","kuai4"],"word":"會"}],"containing_words":[],"sentences":[{"english":"My mother is one of the Methodists.","chinese":"我母親是衛理公會派教徒之一。"},{"english":"CKCMC is located in the State of Perak Manjung County.","chinese":"莫珍歪衛理公會是位於在霹靂州的曼隆縣。"},{"english":"Could you actually marry a Methodist?","chinese":"你能和衛理公會教徒結婚嗎？"},{"english":"The pregnancy progresses normally for Karen, an active member of the Panther Creek United Methodist Church in Morristown, Tennessee.","chinese":"凱倫住在田納西州莫里斯鎮，是衛理公會的虔誠信徒。"},{"english":"As a methodist he was a fervent advocate of temperance .","chinese":"身爲一名衛理公會教徒，他是禁慾的熱情擁護者。"},{"english":"She jest seems to have been born with a sort of chronic spite agin men and Methodists.","chinese":"她似乎天生就憎恨男人和衛理公會教徒。"},{"english":"The Wei Li Gong Hui methodist church in Jinfeng town, Fujian province, China. Photograph: Dan Chung for the Guardian","chinese":"中國福建金峯鎮，衛理公會教堂。"},{"english":"Other students on the SMU campus also had high hopes for the future.","chinese":"南衛理公會大學的其他學生也對未來抱有很高的期望。"},{"english":"I can still hear the sounds of those Methodist bells.","chinese":"衛理公會聖鍾之聲我還能聽見。"},{"english":"The main nonconformist groups in England are Methodist, Congregational and Baptist.","chinese":"英格蘭主要的新教羣體有衛理公會，公理會和浸信會。"}],"related":[]}