{"definition":["to sprint\/to spurt\/to dash\/big effort"],"pinyin":["chong1 ci4"],"simplified":["冲刺"],"rank":8778.0,"normalized_rank":0.12281560869139395,"fraction":0.000010313319337795508,"cumulative_fraction":0.9184185551514522,"word":"衝刺","characters":[{"definition":["powerful\/vigorous\/pungent\/towards\/in view of","thoroughfare\/to go straight ahead\/to rush\/to clash"],"pinyin":["chong1","chong4"],"word":"衝"},{"definition":["(onom.) whoosh","thorn\/sting\/thrust\/to prick\/to pierce\/to stab\/to assassinate\/to murder"],"pinyin":["ci1","ci4"],"word":"刺"}],"containing_words":[],"sentences":[{"english":"Stop, breathe for a sec, then sprint again.","chinese":"停下來，呼吸幾秒，然後再衝刺。"},{"english":"The runner kept some energy in store for spurting at the end.","chinese":"那名賽跑的人爲最後的衝刺貯存精力。"},{"english":"We sought to parry the charateristic soviet lunge with fancy footwork.","chinese":"我們以花式步法力圖避開典型的蘇聯衝刺。"},{"english":"Lynx have longer legs and much broader paws. This helps them charge around in snow.","chinese":"山貓腿較長，腳掌較寬，協助它們在雪地中衝刺。"},{"english":"The peak phase is characterized by short, fast workouts that simulate racing.","chinese":"衝刺階段的特徵是短而快的訓練，這是爲了模擬比賽。"},{"english":"Collecting my energy for one last push, I was eating a chocolate bar when along pedalled two 15-year-olds.","chinese":"爲了積蓄能量做最後衝刺，我吃了一塊巧克力。"},{"english":"This list of tasks becomes the Sprint Backlog.","chinese":"任務的列表就成了所謂的代辦衝刺。"},{"english":"The runner seemed to be rallying for a final sprint.","chinese":"賽跑者似乎在振作精神作最後衝刺。"},{"english":"The odor of disinfectant stung my nostrils as I moved down the row of pens.","chinese":"下樓梯時消毒水的味道衝刺着我的鼻孔。"},{"english":"Try it: go outside and sprint all-out for two minutes.","chinese":"試試吧，走到外面，竭盡全力地衝刺兩分鐘。"},{"english":"He sprinted past the other runners just before reaching the tape.","chinese":"他在到達終點之前全速衝刺，超越了其他賽跑者。"},{"english":"Sprints shall be run according to the rules governing sprint races.","chinese":"運動員的衝刺，以爭先賽的有關規則爲準。"},{"english":"I got the book-writing done by breaking it down into hour-long sprints.","chinese":"而這本書的完成我是以每小時爲單位做寫作衝刺的。"},{"english":"The product owner and team agree on a goal for the sprint.","chinese":"產品所有者和團隊會就衝刺階段的目標達成一致意見。"},{"english":"Hurdling is something that involves my whole body being stretched and contorted in quick bursts.","chinese":"跨欄賽跑需要在快速的衝刺中拉伸和扭曲整個身體。"},{"english":"Better to light one candle than to curse the darkness.","chinese":"與其詛咒妝呆妝婪，哄騙衝刺蠟燭。"}],"related":[{"definition":["to pursue\/to chase after\/to accelerate\/to catch up with\/to overtake"],"pinyin":["zhui1 gan3"],"word":"追趕"},{"definition":["to prepare\/to make adequate preparation"],"pinyin":["zuo4 hao3 zhun3 bei4"],"word":"作好準備"},{"definition":["despite\/although\/even though\/in spite of\/unhesitatingly\/do not hesitate (to ask, complain etc)\/(go ahead and do it) without hesitating"],"pinyin":["jin3 guan3"],"word":"儘管"},{"definition":["ambition\/ambitious"],"pinyin":["qi3 tu2 xin1"],"word":"企圖心"},{"definition":["to relax\/to relax efforts\/to slack off\/to take it easy\/complacent\/undisciplined"],"pinyin":["song1 xie4"],"word":"鬆懈"},{"definition":["to warm up (sports)\/(fig.) to prepare\/to get in condition"],"pinyin":["re4 shen1"],"word":"熱身"},{"definition":["turning point"],"pinyin":["zhuan3 lie4 dian3"],"word":"轉捩點"},{"definition":["(lit. and fig.) to carry a heavy load\/to carry a heavy burden"],"pinyin":["fu4 zhong4"],"word":"負重"},{"definition":["racetrack\/field (for athletics competition)"],"pinyin":["sai4 chang3"],"word":"賽場"},{"definition":["race course"],"pinyin":["sai4 dao4"],"word":"賽道"},{"definition":["to weigh one's abilities and act accordingly\/to act according to one's means\/to cut one's coat according to one's cloth"],"pinyin":["liang4 li4 er2 wei2"],"word":"量力而為"},{"definition":["to pursue unremittingly (idiom); to persevere"],"pinyin":["chi2 zhi1 yi3 heng2"],"word":"持之以恆"},{"definition":["to make way (for sth)"],"pinyin":["rang4 lu4"],"word":"讓路"},{"definition":["relay race\/CL:場|场[chang3]"],"pinyin":["jie1 li4 sai4"],"word":"接力賽"},{"definition":["to get promoted (at work etc)\/promotion"],"pinyin":["sheng1 zhi2"],"word":"升職"},{"definition":["business in which a company has traditionally engaged (e.g. before diversifying)\/original business\/core business\/(literary) agriculture"],"pinyin":["ben3 ye4"],"word":"本業"}]}