{"definition":["symbol\/indicator\/representation"],"pinyin":["biao3 zheng1"],"simplified":["表征"],"rank":29025.0,"normalized_rank":0.4060974074125894,"fraction":0.0000010260767392125212,"cumulative_fraction":0.989283826789264,"word":"表徵","characters":[{"definition":["exterior surface\/family relationship via females\/to show (one's opinion)\/a model\/a table (listing information)\/a form\/a meter (measuring sth)"],"pinyin":["biao3"],"word":"表"},{"definition":["4th note in pentatonic scale 五音[wu3 yin1], roughly sol\/see also 徵|征[zheng1]","to invite\/to recruit\/to levy (taxes)\/to draft (troops)\/phenomenon\/symptom\/characteristic sign (used as proof)\/evidence"],"pinyin":["zheng1","zhi3"],"word":"徵"}],"containing_words":[],"sentences":[{"english":"In this article, atom-pairs of compounds, which include abundant three-dimensional information of molecules, were calculated.","chinese":"採用原子對空間距離法表徵化合物的三維結構信息。"},{"english":"Copper methanesulfonate is synthesized and characterized by TGA and FTIR.","chinese":"合成了甲烷磺酸銅，用熱重和紅外對其進行表徵。"},{"english":"The powder and the composite emulsion were characterized by FTIR.","chinese":"用FTIR對粉體和苯丙複合乳液進行了表徵。"},{"english":"The carbon atomic charge(Qc) on C-O bond described the structural differences among the isomers of aliphatic alcohols and was easy to obtain .","chinese":"容易獲取，表徵了醇分子同分異構體之間的結構差異。"},{"english":"This paper briefly reviewed the structure characterization and its methods of random copolymer of propylene.","chinese":"綜述了丙烯無規共聚物的結構表徵方法及其結果。"},{"english":"The obtained value of heterogeneous index with entropy weight method can quantitatively reflect the heterogeneity of reservoir.","chinese":"熵權非均質指數的大小能定量表徵儲層的非均質性。"},{"english":"It is classically presented with continuous urinary incontinence, but a normal voiding pattern after successful toilet training.","chinese":"它的典型表徵是有正常排尿型態但卻持續的尿失禁。"},{"english":"This is still characterized the spirit of this county, also has tourist value.","chinese":"此仍足以表徵本縣的精神風貌，亦十分具有觀光價值。"},{"english":"The Korean articles introduced to China in Song Dynasty were one of the tokens.","chinese":"宋時高麗物品源源向中國輸入，就是其表徵之一。"},{"english":"As the token of Buddhist Wisdom, Manjusri is the symbol of oriental wisdom.","chinese":"文殊表徵了佛教智慧的核心，乃東方智慧的象徵。"},{"english":"Eleven-shape coding can effectively indicate the trait of Chinese character.","chinese":"十一形碼編碼方法能夠表徵漢字的本質特徵。"},{"english":"NMR and FTIR were used to characterize the structure of terminal groups of the copolyethers.","chinese":"利用核磁共振法表徵了雙丁基聚醚的端基結構。"},{"english":"Among them relatively typical token, be \" Martian article \" use wantonly .","chinese":"其中較爲典型的表徵，是“火星文”的大肆使用。"},{"english":"The air humidity is an important parameter which characterizes the atmospheres state.","chinese":"空氣溼度是表徵大氣物理狀態的一個重要因素。"},{"english":"The average diameter and the diameter distribution of electrospinning nanofibers were measured experimentally by using scanning electron microscopy.","chinese":"納米纖維的平均直徑和直徑分佈用掃描電鏡表徵。"},{"english":"For Sorrell, that lack of control is symptomatic of the new world.","chinese":"對索雷爾來說，缺乏控制就是新世界的表徵。"}],"related":[{"definition":["to concretize"],"pinyin":["ju4 ti3 hua4"],"word":"具體化"},{"definition":["humanism"],"pinyin":["ren2 wen2 zhu3 yi4"],"word":"人文主義"},{"definition":["motif (loanword)\/main idea\/theme"],"pinyin":["mu3 ti2"],"word":"母題"},{"definition":["etiquette\/system of rites"],"pinyin":["li3 zhi4"],"word":"禮制"},{"definition":["to investigate\/dialectical"],"pinyin":["bian4 zheng4"],"word":"辯證"},{"definition":["three principles and five virtues (idiom)\/the three rules (ruler guides subject, father guides son and husband guides wife) and five constant virtues of Confucianism (benevolence 仁, righteousness 義|义, propriety 禮|礼, wisdom 智 and fidelity 信)"],"pinyin":["san1 gang1 wu3 chang2"],"word":"三綱五常"},{"definition":["hedonism"],"pinyin":["xiang3 le4 zhu3 yi4"],"word":"享樂主義"},{"definition":["to flow and change\/development and change (of society)"],"pinyin":["liu2 bian4"],"word":"流變"},{"definition":["postmodernism"],"pinyin":["hou4 xian4 dai4 zhu3 yi4"],"word":"後現代主義"},{"definition":["world view"],"pinyin":["yu3 zhou4 guan1"],"word":"宇宙觀"},{"definition":["natural phenomenon"],"pinyin":["zi4 ran2 xian4 xiang4"],"word":"自然現象"},{"definition":["religious ceremony"],"pinyin":["zong1 jiao4 yi2 shi4"],"word":"宗教儀式"},{"definition":["proper human relationships"],"pinyin":["lun2 chang2"],"word":"倫常"},{"definition":["clear proof"],"pinyin":["ming2 zheng4"],"word":"明證"},{"definition":["to contain\/to accumulate\/to embrace\/implicit condition\/implication\/entailment"],"pinyin":["yun4 han2"],"word":"蘊涵"},{"definition":["material culture"],"pinyin":["wu4 zhi4 wen2 ming2"],"word":"物質文明"}]}