{"definition":["to make clear\/to make known\/to state clearly\/to indicate\/known"],"pinyin":["biao3 ming2"],"simplified":["表明"],"rank":1229.0,"normalized_rank":0.017195304520588196,"fraction":0.0001319701976987686,"cumulative_fraction":0.6530885759513068,"word":"表明","characters":[{"definition":["exterior surface\/family relationship via females\/to show (one's opinion)\/a model\/a table (listing information)\/a form\/a meter (measuring sth)"],"pinyin":["biao3"],"word":"表"},{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"}],"containing_words":[],"sentences":[{"english":"Her arms showed green patches, indicating heavy internal bleeding.","chinese":"她的胳膊出現了青斑，表明有嚴重的內出血。"},{"english":"Post-simulation shows that the deserializer meets the design requirements.","chinese":"後仿真結果表明，本文設計的串並轉換電路滿足要求。"},{"english":"The results indicated that interfacial charge transfer may be the rate limiting step.","chinese":"分析表明界面的電荷轉移是反應的速度控制步。"},{"english":"The two fish of Pisces show Christianity's split between spirit and matter.","chinese":"雙魚宮的兩條魚表明基督教的靈性與物質的分離。"},{"english":"As it turns out, a handful of scientific studies show that chicken soup really could have medicinal value.","chinese":"而且幾項科學研究也表明，雞湯的確具有藥用價值。"},{"english":"The last lane is Method, indicating where the lock contends.","chinese":"最後一列是方法，表明鎖競爭是在什麼位置發生的。"},{"english":"Thermodynamic parameters depict the endothermic nature of adsorption and the process is spontaneous.","chinese":"熱力學參數表明，吸附過程是自發的和吸熱的。"},{"english":"It was found that giant pandas in Fopinghad tke habit of seasonal vertical movement.","chinese":"結果表明，佛坪大熊貓有季節性垂直移動習性。"},{"english":"It is shown that the conducting time of the power converter transistor should not be too short.","chinese":"實驗表明，功率管的導通時間不宜太短。"},{"english":"Correlation analysis showed there was relationship between pet owning and health.","chinese":"相關分析表明，是否擁有寵物犬與身心健康顯著相關。"},{"english":"The experimental data showed that the results were better than those determined by partial least squares.","chinese":"結果表明，經小波變換後處理結果回收率明顯提高。"},{"english":"The design problems of hatch cover and cantilever beam were solved to check the usefulness of the suggested method.","chinese":"艙口蓋及懸樑的設計結果表明瞭該方法的可行性。"},{"english":"Experiment results show that those approaches have good real -time performance and vivid effect.","chinese":"實驗結果表明，該算法達到了較好的實時性和真實感。"},{"english":"It made clear that temperature is an important influence factor for flesh color and senescence of fruits under storage.","chinese":"這表明溫度對採後梅果果肉色澤及衰老有很大的影響。"},{"english":"Sequence analysis showed that it contained the basic characteristic of primary structure of promoter.","chinese":"對其序列分析表明它具有啓動子初級結構的基本特徵。"},{"english":"There are myelinated and unmyelinated fibers in alligator's optic nerve.","chinese":"結果表明，視神經中可見有髓纖維和無髓纖維。"}],"related":[{"definition":["to explain\/to illustrate\/to indicate\/to show\/to prove\/explanation\/directions\/caption\/CL:個|个[ge4]"],"pinyin":["shuo1 ming2"],"word":"說明"},{"definition":["proof\/certificate\/identification\/testimonial\/CL:個|个[ge4]\/to prove\/to testify\/to confirm the truth of"],"pinyin":["zheng4 ming2"],"word":"證明"},{"definition":["to confirm (sth to be true)\/to verify"],"pinyin":["zheng4 shi2"],"word":"證實"},{"definition":["to show\/to illustrate\/to display\/to demonstrate"],"pinyin":["xian3 shi4"],"word":"顯示"},{"definition":["to hint\/to suggest\/suggestion\/hint"],"pinyin":["an4 shi4"],"word":"暗示"},{"definition":["to signify\/to mean\/to imply"],"pinyin":["yi4 wei4 zhe5"],"word":"意味著"},{"definition":["evidence\/proof\/to confirm\/corroboration"],"pinyin":["zuo3 zheng4"],"word":"佐證"},{"definition":["opposite\/contrary"],"pinyin":["xiang1 fan3"],"word":"相反"},{"definition":["outstanding\/notable\/remarkable\/statistically significant"],"pinyin":["xian3 zhu4"],"word":"顯著"},{"definition":["mark\/indication\/sign\/indicator"],"pinyin":["ji4 xiang4"],"word":"跡象"},{"definition":["and\/besides\/moreover\/furthermore\/in addition"],"pinyin":["bing4 qie3"],"word":"並且"},{"definition":["conclusion\/verdict\/CL:個|个[ge4]\/to conclude\/to reach a verdict"],"pinyin":["jie2 lun4"],"word":"結論"},{"definition":["it can clearly be seen (that this is the case)\/it is (thus) clear\/clear\/visible"],"pinyin":["ke3 jian4"],"word":"可見"},{"definition":["clear\/distinct\/obvious"],"pinyin":["ming2 xian3"],"word":"明顯"},{"definition":["to indicate\/to point out"],"pinyin":["zhi3 chu1"],"word":"指出"},{"definition":["from this, it can be seen that..."],"pinyin":["you2 ci3 ke3 jian4"],"word":"由此可見"}]}