{"definition":["apparent"],"pinyin":["biao3 guan1"],"simplified":["表观"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"表觀","characters":[{"definition":["exterior surface\/family relationship via females\/to show (one's opinion)\/a model\/a table (listing information)\/a form\/a meter (measuring sth)"],"pinyin":["biao3"],"word":"表"},{"definition":["Taoist monastery\/palace gate watchtower\/platform","surname Guan","to look at\/to watch\/to observe\/to behold\/to advise\/concept\/point of view\/outlook"],"pinyin":["Guan4","guan1","guan4"],"word":"觀"}],"containing_words":[{"definition":["epigenetics"],"pinyin":["biao3 guan1 yi2 chuan2 xue2"],"word":"表觀遺傳學"}],"sentences":[{"english":"A similar question remains for the inheritance of the epigenetic characteristics from parents to offspring.","chinese":"表觀遺傳特性的同樣問題存在於親代和子代之間。"},{"english":"In contrast, epigenetically mediated gene silencing occurs gradually.","chinese":"相反，表觀遺傳造成的基因沉默會逐漸地出現。"},{"english":"Similarly, apparent carboxylation efficiency increased with light intensity but CO_2 compensation point decreased.","chinese":"在不同光強下，表觀羧化效率也隨光的增強而增大。"},{"english":"Additionaliy, compound enzyme also improved the ileal digestibility of protein significantly.","chinese":"此外，複合酶還顯著提高了蛋白質的迴腸表觀消化率。"},{"english":"In a sense, the epigenome is the genome's boss.","chinese":"從某種意義上說，表觀基因是基因的老闆。"},{"english":"In 2003, our country demand quantity of PIB was about 40 thousand tons.","chinese":"2003年，我國聚異丁烯的表觀需求量約爲4萬噸。"},{"english":"The transfer rate equation is experimentally obtained and the superficial transfer energy is calculated.","chinese":"並求得初始傳質速率方程，計算了表觀傳質反應熱。"},{"english":"Other times, the epigenome demotes a gene.","chinese":"有時候表觀基因會把基因降級。"},{"english":"This article is to analyze the influencing factor of apparent information asymmetry in medical dispute game.","chinese":"探討醫療糾紛博弈表觀信息不對稱性的影響因素。"},{"english":"Rather, the new traits were carried on through epigenetic means.","chinese":"更進一步說，新的遺傳特徵由表觀遺傳所承載。"},{"english":"The light saturation point and the apparent quantum requirement are higher.","chinese":"光飽和點和表觀量子需要量較高。"},{"english":"The effective factor and the apparent reaction rate constant of catalyst-capsule were determined.","chinese":"測定了催化劑包的有效因子和表觀反應速率常數。"},{"english":"The oxidation reaction of malachite green by PMN has a order of 2 of Malachite Green.","chinese":"PMN氧化孔雀綠的反應與染料濃度呈表觀2級反應。"},{"english":"In addition, adding calcium chloride to pectin solution could increase its apparent viscosity.","chinese":"氯化鈣溶液的加入可明顯增加果膠溶液的表觀粘度。"},{"english":"The synthesized sample exhibits apparent superparamagnetism.","chinese":"樣品具有表觀超順磁性。"},{"english":"A new measurement system about the apparent viscosity of the blood with microphotography was studied. 1t was both simple and convenient.","chinese":"本文研製了一種新的血液顯微表觀粘度測定系統。"}],"related":[]}