{"definition":["surface tension"],"pinyin":["biao3 mian4 zhang1 li4"],"simplified":["表面张力"],"rank":57606.0,"normalized_rank":0.8059826787738027,"fraction":5.8683005998496734e-8,"cumulative_fraction":0.9996952578360516,"word":"表面張力","characters":[{"definition":["exterior surface\/family relationship via females\/to show (one's opinion)\/a model\/a table (listing information)\/a form\/a meter (measuring sth)"],"pinyin":["biao3"],"word":"表"},{"definition":["face\/side\/surface\/aspect\/top\/classifier for flat surfaces such as drums, mirrors, flags etc"],"pinyin":["mian4"],"word":"面"},{"definition":["surname Zhang","to open up\/to spread\/sheet of paper\/classifier for flat objects, sheet\/classifier for votes"],"pinyin":["Zhang1","zhang1"],"word":"張"},{"definition":["power\/force\/strength\/ability\/strenuously","surname Li"],"pinyin":["Li4","li4"],"word":"力"}],"containing_words":[],"sentences":[{"english":"Once again, close adaptation of the denture base to the mucosa will enhance these forces.","chinese":"同樣，基託與粘膜間良好的密合性可增強表面張力。"},{"english":"The liquid surface tension coefficient was measured by si-resistance-strain sensor.","chinese":"利用硅壓阻式力敏傳感器測量液體表面張力系數。"},{"english":"Surface tension of LiBr solution with surfactants was measured by Wilhelmy plate method.","chinese":"採用吊板法測量溶液的表面張力。"},{"english":"The interfacial tension of the acquired dispersions was lower than that of deionized water.","chinese":"兩類預聚物水分散系的表面張力均遠小於純水。"},{"english":"The chemicals are designed to reduce the surface tension of the remaining oil and to push it toward a producing well.","chinese":"化學劑用來降低剩餘油的表面張力並將油推向生產井。"},{"english":"The effects of adsorbate on moduli and surface stress of the diamond thin films were investigated.","chinese":"探討了吸附物對金剛石模量或表面張力的影響。"},{"english":"Plating solution surface tension is too large, wetting agents insufficient.","chinese":"電鍍溶液表面張力過大，溼潤劑不足。"},{"english":"The thermocapillary and buoyancy driven flow are included in the solution of momentum equations.","chinese":"動量方程求解中考慮了熱表面張力與浮力聯合驅動流。"},{"english":"So for the water to be ejected from the fur, the centripetal force has to exceed the surface tension.","chinese":"所以，要讓水從皮毛彈出，向心力必須超過表面張力。"},{"english":"Surface tension is one of the important control parameters of the ceramic squeegee oil .","chinese":"表面張力的控制是陶瓷印油產品的主要控制指標之一。"},{"english":"This proved that the surface tension causes free surface returning to equilibrium location.","chinese":"說明表面張力具有使得自由面返回到平衡位置的作用。"},{"english":"Low surface tension also helps bubbles grow quickly.","chinese":"弱小的表面張力也促使了泡泡增長速度變快。"},{"english":"The methods used are the sessile and pendant drop tensiometry.","chinese":"表面張力之量測乃使用固著液滴和懸垂液滴兩種方法。"},{"english":"Varying surface tension leads to tangential forces along the interface. This is often called the Marangoni effect.","chinese":"表面張力之量測乃使用固著液滴和懸垂液滴兩種方法。"}],"related":[]}