{"definition":["kidnap victim\/kidnapped (person)"],"pinyin":["bei4 bang3"],"simplified":["被绑"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"被綁","characters":[{"definition":["quilt\/by\/(indicates passive-voice clauses)\/(literary) to cover\/to meet with\/(coll.) (since c. 2009) used before a verb that does not accurately represent what actually happened, to describe with black humor how sb or sth was dealt with by the authorities (as in 被自殺|被自杀[bei4 zi4 sha1])"],"pinyin":["bei4"],"word":"被"},{"definition":["to tie\/bind or fasten together\/to kidnap"],"pinyin":["bang3"],"word":"綁"}],"containing_words":[],"sentences":[{"english":"He kicked at the bound prisoner.","chinese":"他朝那被綁着的囚犯踢了一腳。"},{"english":"They tied him up to a pole and burned him alive in 1415.","chinese":"1415年胡斯被綁在柱子上活活燒死。"},{"english":"For over a year, Flash had been tied to a tree in front of someone’s house.","chinese":"一年多來，“閃光”一直被綁在某人屋前的樹上。"},{"english":"Tied to a corner of the cellar, such as the ants when Mr Zhang is flustered.","chinese":"被綁在地窖一角如百蟻鬧心的張志強氣急敗壞。"},{"english":"The criminal would be attached to a cart wheel and his arms and legs stretched out along the spokes.","chinese":"犯人被綁在車輪上，手腳順着輪輻伸直。"},{"english":"Easy Hanzi tied in the tent.","chinese":"易寒子被綁在帳篷內。"},{"english":"JAKE and GRACE are lashed to posts at the front entrance to Hometree.","chinese":"傑克和格蕾絲被綁在家園樹門口的柱子上。"},{"english":"The thief was pinioned to a tree.","chinese":"盜賊被綁在樹上。"},{"english":"Luckily, he was strapped into his pram at the time, which probably saved his life.","chinese":"僥倖，當時，他被綁在嬰兒車上，這可能救了他的命。"},{"english":"She needed restraints on her bed. She had terrible fever and sweats.","chinese":"她被綁在牀上，高燒不退，出汗不止。"},{"english":"ZuoYuKun tied on the carriage, ready to sent to the headquarters.","chinese":"左玉琨被綁上馬車，準備押解到司令部。"},{"english":"Somewhere in that bag is an angry dinosaur and a kidnapped princess.","chinese":"這包薯片中藏着庫巴和被綁的公主。"},{"english":"Joan of Arc was bound to the stake and burnt to death.","chinese":"聖女貞德被綁在火刑柱上燒死。"},{"english":"The prisoner had relapsed into his taciturnity.","chinese":"那被綁的人又回覆到沉默狀態。"},{"english":"Shouye discovers Youqing has been kidnapped too and decided to let both of them go.","chinese":"守業發現有情也被綁來，將兩人送走。"}],"related":[]}