{"definition":["respondent (in a survey, questionnaire, study etc)"],"pinyin":["bei4 fang3 zhe3"],"simplified":["被访者"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"被訪者","characters":[{"definition":["quilt\/by\/(indicates passive-voice clauses)\/(literary) to cover\/to meet with\/(coll.) (since c. 2009) used before a verb that does not accurately represent what actually happened, to describe with black humor how sb or sth was dealt with by the authorities (as in 被自殺|被自杀[bei4 zi4 sha1])"],"pinyin":["bei4"],"word":"被"},{"definition":["to visit\/to call on\/to seek\/to inquire\/to investigate"],"pinyin":["fang3"],"word":"訪"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"Respondents said they watch \"very little\" TV.","chinese":"被訪者說他們“很少”看電視。"},{"english":"Chinese respondents widely believe that relations between the two countries have improved.","chinese":"中國被訪者普遍認爲兩國關係有所發展。"},{"english":"Real Time information, mentioned by 48% of the respondents.","chinese":"48%的被訪者提到了實時信息。"},{"english":"Thirty-nine percent of respondents believe the smart grid will diminish their privacy.","chinese":"39%的被訪者認爲智能電網會降低他們的隱私。"},{"english":"Large majorities in Europe and the U.S. have a negative view about China’s growing military prowess.","chinese":"絕大多數歐美被訪者對中國軍事實力增長持負面態度。"},{"english":"The names of those interviewed have been changed to protect their identities.","chinese":"不過被訪者的姓名已經做了改動以策安全。"}],"related":[]}