{"definition":["favoritism shown to sb because of the influence of the person's wife or other female relative\/(by extension) favoritism towards relatives, friends or associates"],"pinyin":["qun2 dai4 guan1 xi5"],"simplified":["裙带关系"],"rank":44959.0,"normalized_rank":0.6290347403914766,"fraction":2.3940330805356877e-7,"cumulative_fraction":0.9980099394189614,"word":"裙帶關係","characters":[{"definition":["skirt\/CL:條|条[tiao2]"],"pinyin":["qun2"],"word":"裙"},{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"帶"},{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["Guan1","guan1"],"word":"關"},{"definition":["to connect\/to relate to\/to tie up\/to bind\/to be (literary)"],"pinyin":["xi4"],"word":"係"}],"containing_words":[],"sentences":[{"english":"Cage changed his name to deflect accusations of nepotism.","chinese":"凱奇改了名字以避免別人指責他搞裙帶關係。"},{"english":"It's hard to avoid suspicions of nepotism about the program's management team.","chinese":"很難讓人不去懷疑這個項目的運作中存在裙帶關係。"},{"english":"The Protestant Establishment was inbred.","chinese":"新教徒之間的裙帶關係是與生俱來的。"},{"english":"The mayor leaned over backward to avoid the appearance of nepotism.","chinese":"市長爲了避免裙帶關係的出現而走向了另一個極端。"},{"english":"That looked like just the sort of nepotism that the president abhors.","chinese":"而這正是總統深惡痛絕的裙帶關係。"},{"english":"The congressman lashed the president for his nepotism.","chinese":"國會議員抨擊總統搞裙帶關係。"},{"english":"After all, rewarding people according to merit is superior to corruption or nepotism.","chinese":"畢竟，基於業績給與獎勵要優於腐敗和裙帶關係。"},{"english":"In Central Asia the most successful companies are sinecures of nepotism.","chinese":"而在中亞，最成功的公司往往是靠裙帶關係。"},{"english":"The corruption, nepotism, favoritism, moneyembezzlement, all and all will fall apart.","chinese":"腐敗，裙帶關係，徇私枉法以及貪污都將土崩瓦解。"}],"related":[]}