{"definition":["to make up for an earlier mistake\/to make amends"],"pinyin":["bu3 guo4"],"simplified":["补过"],"rank":43233.0,"normalized_rank":0.6048857610566227,"fraction":2.8319659611214836e-7,"cumulative_fraction":0.9975596543495228,"word":"補過","characters":[{"definition":["to repair\/to patch\/to mend\/to make up for\/to fill (a vacancy)\/to supplement"],"pinyin":["bu3"],"word":"補"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"}],"containing_words":[],"sentences":[{"english":"Some planks are patched and warped. Several bottom skids are broken.","chinese":"一些板子補過並彎翹了，幾根底梁斷了。"},{"english":"It was hard for me to ask for a change, so I just went ahead.","chinese":"再改過去很難，我只好將功補過。"},{"english":"And old shoes and clouted upon their feet, and old garments upon them;","chinese":"將補過的舊鞋穿在腳上，把舊衣服穿在身上。"},{"english":"Now he might get at least two chances to make amends .","chinese":"現在他至少可以有兩次機會可以將功補過。"},{"english":"How many teeth have you had filled in the past two years ?","chinese":"在過去的兩年裏你補過多少顆牙齒？"},{"english":"The pair redeemed themselves in some style 10 minutes into the second half.","chinese":"下半時十分鐘，二人將功補過。"},{"english":"We should let them make up for their mistakes.","chinese":"我們應當讓他們將功補過。"},{"english":"He has a chance to make things right.","chinese":"他有機會將功補過。"},{"english":"The men put worn and patched sandals on their feet and wore old clothes.","chinese":"將補過的舊鞋穿在腳上，把舊衣服穿在身上。"},{"english":"The little spot of gold in the dirt is a molar with a gold filling.","chinese":"泥土裏那小小的金光是一顆用金子補過的磨牙。"},{"english":"Next to it surface two more molars with silver amalgam fillings.","chinese":"在它旁邊還有幾顆用銀補過的磨牙。"},{"english":"We should let him make up for his mistakes.","chinese":"我們應當讓他將功補過。"},{"english":"Note the mend the primary color with winter there is a big difference.","chinese":"注意補過的地方顏色與硯的原色有很大的差異。"},{"english":"I am sure your dad has caught bluefish tuna before right?","chinese":"那你爸一定有補過黑鮪魚吧？"}],"related":[]}