{"definition":["to pretend\/to feign\/to act a part"],"pinyin":["zhuang1 zuo4"],"simplified":["装作"],"rank":21891.0,"normalized_rank":0.3062834916681824,"fraction":0.000001981646284650729,"cumulative_fraction":0.9789518738453298,"word":"裝作","characters":[{"definition":["adornment\/to adorn\/dress\/clothing\/costume (of an actor in a play)\/to play a role\/to pretend\/to install\/to fix\/to wrap (sth in a bag)\/to load\/to pack"],"pinyin":["zhuang1"],"word":"裝"},{"definition":["to do\/to grow\/to write or compose\/to pretend\/to regard as\/to feel\/writings or works","worker\/workshop\/(slang) troublesome\/high-maintenance (person)"],"pinyin":["zuo1","zuo4"],"word":"作"}],"containing_words":[],"sentences":[{"english":"We're supposed to be a pair of likely lads, just in case the slave-catchers are watching.","chinese":"我們要裝作是一對小男孩，以防努力獵手看見。"},{"english":"He always looked for the opening as he approached the suspect.","chinese":"當他在接近嫌疑犯的時候，通常裝作尋找一個狗洞。"},{"english":"Yet pretending you have never been in my heart.","chinese":"卻還得故意裝作絲毫沒把你放在心裏。"},{"english":"Pass, such as when pretending to casually looked elsewhere.","chinese":"等擦肩而過時，忽又裝作漫不經心地打量着別處。"},{"english":"He is the clever evil spirit messenger, is pretends the bright messenger to arrive in this world.","chinese":"他是鬼魔的差役，是裝作光明的使者來到這世上的。"},{"english":"For such are false apostles, deceitful workers, transforming themselves into the apostles of Christ.","chinese":"那等人是假使徒，行事詭詐，裝作基督使徒的模樣。"},{"english":"To feel, or feign, decorous woe.","chinese":"感到或裝作適當的悲傷。"},{"english":"How many times can a man turn his head, and pretend that he just doesn't see ?","chinese":"還能別過多少次頭，來裝作看不見苦難的臉？"},{"english":"Yang's family is pretending that he is mentally ill to protect him.","chinese":"她和丈夫說，楊家裝作兒子是精神病而包庇了他。"},{"english":"And no wonder, for even Satan masquerades as an angel of light.","chinese":"這也不足爲怪，因爲連撒但也裝作光明的天使。"},{"english":"He made a feint of working hard.","chinese":"他裝作努力工作。"},{"english":"Satan himself masquerades as an angel of light.","chinese":"撒但也裝作光明的天使。"},{"english":"She and her husband say Mr. Yang’s family is pretending that he is mentally ill to protect him.","chinese":"她和丈夫說，楊家裝作兒子是精神病而包庇了他。"},{"english":"Dimension nadia to ask the friendship first, but friendship pretend don't know.","chinese":"維娜先去問了阿雅，但阿雅裝作不曉得。"},{"english":"Alaric: Please don't talk about me like I'm not here.","chinese":"說我壞話，別裝作好像我不在似的。"},{"english":"Only one serious piece Guzi pretending to scan.","chinese":"只是顧自裝作認真的一件件細看。"}],"related":[]}