{"definition":["to assume (an air of)"],"pinyin":["zhuang1 chu1"],"simplified":["装出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"裝出","characters":[{"definition":["adornment\/to adorn\/dress\/clothing\/costume (of an actor in a play)\/to play a role\/to pretend\/to install\/to fix\/to wrap (sth in a bag)\/to load\/to pack"],"pinyin":["zhuang1"],"word":"裝"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"She can more or less assume his cocksureness.","chinese":"母雞可以多多少少地裝出公雞的自信。"},{"english":"She acted out the role of a wronged lover to make him feel guilty.","chinese":"她裝出一副受委屈的情人的樣子，以讓他感到內疚。"},{"english":"And he pretends to be omniscient.","chinese":"他還裝出一副無所不知的樣子。"},{"english":"I pretend to be a human through Linguini.","chinese":"而在小林面前，我又得裝出一副人的模樣。"},{"english":"She strikes a pose of being an invalid when really she is well and strong.","chinese":"她裝出一副有病體弱的樣子，但實際上身體強壯。"},{"english":"She affected a look of disinterest as she glanced at his newspaper.","chinese":"當她掃視他的報紙時，她裝出一副不感興趣的表情。"},{"english":"He assumes a well-informed manner but in fact knows very little.","chinese":"他裝出一副博學多聞的樣子，其實懂得很少。"},{"english":"But soon he again assumed a confiding tone.","chinese":"但很快，他又裝出一副讓人信任的語氣來。"},{"english":"He pretends to be poor.","chinese":"他裝出一副可憐的樣子。"},{"english":"The attendants attend the meeting and  pretend to be attentive.","chinese":"侍從們出席會議並裝出專注的樣子。"},{"english":"He raised his eyebrows with an affectation of surprise.","chinese":"他揚起雙眉裝出一幅驚奇的樣子。"},{"english":"In 2009, China's clothing export once into a two-digit growth.","chinese":"2009年，我國服裝出口一度陷入兩位數負增長。"},{"english":"When Harry put on his act of being mildly annoyed, the assistant promised to order some for him.","chinese":"哈里裝出不高興的樣子時，女售貨員答應爲他定貨。"},{"english":"The fashion repairs a background brattishing and embark a proptosis with the hue you of individualism.","chinese":"時尚裝修背景牆，用色彩裝出你的個性。"},{"english":"He seems arrogant because he overcompensates for his feeling of inferiority.","chinese":"他爲彌補自己的自卑感而裝出傲慢的樣子。"},{"english":"You affect this gayety to inspire me with courage.","chinese":"你是爲了鼓勵我才裝出高興的樣子。"}],"related":[]}