{"definition":["docker\/longshoreman"],"pinyin":["zhuang1 xie4 gong1"],"simplified":["装卸工"],"rank":40102.0,"normalized_rank":0.5610790088564913,"fraction":3.8173149424395257e-7,"cumulative_fraction":0.9965277957284656,"word":"裝卸工","characters":[{"definition":["adornment\/to adorn\/dress\/clothing\/costume (of an actor in a play)\/to play a role\/to pretend\/to install\/to fix\/to wrap (sth in a bag)\/to load\/to pack"],"pinyin":["zhuang1"],"word":"裝"},{"definition":["to unload\/to unhitch\/to remove or strip\/to get rid of"],"pinyin":["xie4"],"word":"卸"},{"definition":["work\/worker\/skill\/profession\/trade\/craft\/labor"],"pinyin":["gong1"],"word":"工"}],"containing_words":[],"sentences":[{"english":"The stochastic loader problem and the procedure for solutions were proposed in this paper.","chinese":"提出了隨機裝卸工問題及其求解策略。"},{"english":"The stevedores are already on board. Let's go and have a look.","chinese":"裝卸工已經上船了，讓我們去看看。"},{"english":"A lumper is someone who does not split an exercise into component parts.","chinese":"裝卸工不把一項訓練拆分成多個部分的。"},{"english":"Shipment cannot execute within period owing stevedore shortage.","chinese":"因裝卸工人不足，無法在限定時間內裝船。"},{"english":"Please tell the dockers to stow the cargoes according to the stowage plan.","chinese":"請告訴裝卸工人要依照配載圖裝貨。"},{"english":"It's purely a fiction that individual dockers intentionally injure the cartons.","chinese":"所謂個別裝卸工故意破壞紙箱，這純屬捏造。"},{"english":"The stevedores tossedthrew the bags from high place into the hold. That brought on a lot of bags with seams slack.","chinese":"裝卸工從高處向艙裏拋袋子，這使得大量袋子鬆口。"},{"english":"The stevedores are justifiable for they are unable to catch what you say.","chinese":"裝卸工聽不懂你的話，情有可原。"},{"english":"The wash basin in stevedore's lavatory damaged, to be renewed.","chinese":"裝卸工用廁的洗手盆壞了，需要更換。"}],"related":[]}