{"definition":["fitted with"],"pinyin":["zhuang1 you3"],"simplified":["装有"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"裝有","characters":[{"definition":["adornment\/to adorn\/dress\/clothing\/costume (of an actor in a play)\/to play a role\/to pretend\/to install\/to fix\/to wrap (sth in a bag)\/to load\/to pack"],"pinyin":["zhuang1"],"word":"裝"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"}],"containing_words":[],"sentences":[{"english":"The upper port of the leg protective bag of the utility model is provided with a pair of fasteners.","chinese":"本實用新型護腿袋的上端口裝有一對卡子。"},{"english":"Video recording or reproducing apparatus, whether or not incorporating a video tuner.","chinese":"視頻信號錄製或重放設備，不論是否裝有高頻調諧器。"},{"english":"Theat the head of your bed has an automatic waking device.","chinese":"您牀頭的臺子裝有不傭人的勞力叫醒器。"},{"english":"The initial stabilization for a leaking cylinder containing corrosives is isolation in a well-ventilated area.","chinese":"第一步是把裝有腐蝕劑的鋼瓶隔離在通風良好的區域。"},{"english":"The shop is fitted with rolling shutters.","chinese":"那商店的窗子裝有可捲動的遮板。"},{"english":"When we want to intubate the patient, he turns out to have dentures in his mouth.","chinese":"當我們想給他插管時，我們發現他的嘴裏裝有假牙。"},{"english":"Customer: Do you have the one with a time switch?","chinese":"你們有那種裝有定時開關器的嗎？"},{"english":"The front panel houses a bridge-current meter .","chinese":"正面板上裝有橋式電流表。"},{"english":"This camera with a magic eye costs much more than that automat.","chinese":"這架裝有電眼的照相機比那臺自動的要貴得多。"},{"english":"People carry their phones around in pockets with keys and change.","chinese":"人們可以把他們的手機裝在裝有鑰匙及零錢的兜裏。"},{"english":"The tests must be done in the lab equipped with exhauster.","chinese":"測試必須在裝有排氣裝置的實驗室內進行。"},{"english":"Inside there is some money, IP card and a monthly ticket.","chinese":"裏面裝有一些錢，一張IP卡和一張月票。"},{"english":"This model is available with automatic transmission.","chinese":"這種裝有自動變速器的車有現貨。"},{"english":"Each came equipped with a charger that plugs into an electrical outlet.","chinese":"每一個機件都裝有一個可插入電源插口的充電器。"},{"english":"Put it into the pan with potatoes – boiled and mashed.","chinese":"將它倒入裝有煮熟搗碎的土豆的平底鍋內。"},{"english":"There is a switch board mounted on the wall.","chinese":"在牆上裝有一個開關板。"}],"related":[]}