{"definition":["armored vehicles"],"pinyin":["zhuang1 jia3 che1 liang4"],"simplified":["装甲车辆"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"裝甲車輛","characters":[{"definition":["adornment\/to adorn\/dress\/clothing\/costume (of an actor in a play)\/to play a role\/to pretend\/to install\/to fix\/to wrap (sth in a bag)\/to load\/to pack"],"pinyin":["zhuang1"],"word":"裝"},{"definition":["first of the ten Heavenly Stems 十天干[shi2 tian1 gan1]\/(used for an unspecified person or thing)\/first (in a list, as a party to a contract etc)\/letter \"A\" or roman \"I\" in list \"A, B, C\", or \"I, II, III\" etc\/armor plating\/shell or carapace\/(of the fingers or toes) nail\/bladed leather or metal armor (old)\/ranking system used in the Imperial examinations (old)\/civil administration unit in the baojia 保甲[bao3 jia3] system (old)\/ancient Chinese compass point: 75°"],"pinyin":["jia3"],"word":"甲"},{"definition":["car\/vehicle\/CL:輛|辆[liang4]\/machine\/to shape with a lathe\/Kangxi radical 159","surname Che","war chariot (archaic)\/rook (in Chinese chess)\/rook (in chess)"],"pinyin":["Che1","che1","ju1"],"word":"車"},{"definition":["classifier for vehicles"],"pinyin":["liang4"],"word":"輛"}],"containing_words":[],"sentences":[{"english":"The communication between the panzer and commanding car is realized by the wireless data transmission module.","chinese":"裝甲車輛與指揮車之間的通信通過無線數傳模塊實現。"},{"english":"The theory is prepared for the application on the armoring vehicle.","chinese":"爲其在裝甲車輛上的應用做出了理論準備。"},{"english":"The paper apply the general theory of three-dimensional flow to armoured vehicle fans.","chinese":"本文將三元流動的基本理論用於裝甲車輛風機。"},{"english":"The blast forms a slug of molten metal that can rip through most armoured vehicles—and their occupants.","chinese":"爆炸以後形成的金屬嵌片可以穿破裝甲車輛。"},{"english":"It fuzes on impact with a shaped charge capable of destroying or disabling armored vehicles.","chinese":"其撞擊引信引爆裝料可以摧毀或報廢敵裝甲車輛。"}],"related":[]}