{"definition":["to load sth onto a ship etc"],"pinyin":["zhuang1 huo4"],"simplified":["装货"],"rank":32554.0,"normalized_rank":0.4554726959830985,"fraction":7.507629349509172e-7,"cumulative_fraction":0.9923957121487744,"word":"裝貨","characters":[{"definition":["adornment\/to adorn\/dress\/clothing\/costume (of an actor in a play)\/to play a role\/to pretend\/to install\/to fix\/to wrap (sth in a bag)\/to load\/to pack"],"pinyin":["zhuang1"],"word":"裝"},{"definition":["goods\/money\/commodity\/CL:個|个[ge4]"],"pinyin":["huo4"],"word":"貨"}],"containing_words":[],"sentences":[{"english":"One copy of inspection Report on Quantity and Quality issued SGS at loading port.","chinese":"裝貨港SGS數量及重量檢驗報告，一份副本。"},{"english":"We would have some water in our loading dock in the back.","chinese":"我們本來在我們的碼頭裝貨水在後面。"},{"english":"Expanded opportunity of loading M3U playlists.","chinese":"擴大機會裝貨m3u播放清單。"},{"english":"One necessary aspect of bulk cargo is fungibility .","chinese":"散裝貨所必須具備的一個特徵是它的替換性。"},{"english":"When does your cargo liner sail?","chinese":"你們的裝貨班輪什麼時候開航？"},{"english":"This watch may be a counterfeit, but it looks just like the original.","chinese":"這隻手錶有可能是假貨，但它看起來很像原裝貨。"},{"english":"The ship stopped here to take in freight.","chinese":"這艘船在這裏停泊裝貨。"},{"english":"Please calculate the loading scale and the number of containers of their shift.","chinese":"請計算一下本班的裝貨水尺和集裝箱箱數。"},{"english":"Does a W. P. A. policy include a deck loading stipulation?","chinese":"水漬險是否包括甲板上裝貨的規定？"},{"english":"Cover bilge(s) with wrapper before loading.","chinese":"在裝貨前艙底污水井用包裝布蓋上。"},{"english":"Vessel sailed from loading port to yingkou port directly . without discharging any cargo on the voyage.","chinese":"船舶由裝貨港直達營口港，中途未卸貨。"},{"english":"We'll pick out the damaged cargo in the slings during loading, provided there is any.","chinese":"裝貨過程中我們會撿出關內殘損貨，如果有的話。"},{"english":"Payment shall be made CWO by means of T\/TorM\/T.","chinese":"裝貨付款費用應以電匯或信匯的方式。"},{"english":"I had to wait most of the day to deliver the bales, sitting there in my truck, watching stevedores load other cargo.","chinese":"我幾乎等了整整一天，坐在卡車裏看着碼頭工人裝貨。"},{"english":"I am afraid the cartons are not strong enough.","chinese":"我擔心裝貨的紙箱不夠結實。"},{"english":"Please tell the Foremen keep the vessel level during loading.","chinese":"告訴單船指導員裝貨時候保持船體平衡。"}],"related":[]}