{"definition":["compound word"],"pinyin":["fu4 he2 ci2"],"simplified":["复合词"],"rank":66262.0,"normalized_rank":0.9270913491808096,"fraction":1.1678210148954571e-8,"cumulative_fraction":0.999970834400034,"word":"複合詞","characters":[{"definition":["to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate"],"pinyin":["fu4"],"word":"複"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["word\/statement\/speech\/lyrics\/CL:組|组[zu3],個|个[ge4]\/a form of lyric poetry, flourishing in the Song dynasty 宋朝|宋朝[Song4 chao2]\/CL:首[shou3]"],"pinyin":["ci2"],"word":"詞"}],"containing_words":[{"definition":["polymorphemic"],"pinyin":["fu4 he2 ci2 su4 ci2"],"word":"複合詞素詞"}],"sentences":[{"english":"How to explain the formation and meaning of the following compounds?","chinese":"如何解釋所給複合詞的構成及意思？"},{"english":"Metaphor project on different levels of compound words.","chinese":"隱喻在複合詞中的投射有不同層面。"},{"english":"Do not capitalize each word in so-called closed-form compound words.","chinese":"不要將所謂的緊湊格式複合詞中的每個單詞都大寫。"},{"english":"Modern Chinese two-syllable compound words many of the quantity, uses widely.","chinese":"現代漢語雙音節複合詞的數量多，用途廣。"},{"english":"The conveyance of causativity is an important feature of Chinese resultative V-V compound.","chinese":"表達致使是漢語動補複合詞的重要特徵。"},{"english":"In compounds, the two lexical morphemes can be of different word classes.","chinese":"複合詞中，兩個詞彙語素可能是不同的詞類。"},{"english":"Describing the morpheme order of bisyllabic copulative compound.","chinese":"描寫雙音節並列式複合詞語素的組合狀況。"},{"english":"Separating a compound word into two meaningful words.","chinese":"將一個複合詞分成兩個有意義的單詞。"},{"english":"The second chapter is\"side-by-side compound words of Jinwen Shangshu\".","chinese":"第二部分爲“今文《尚書》並列複合詞”。"},{"english":"Follow that, study classification of compound words of telescopic form.","chinese":"再接下來對兼語式複合詞進行分類。"},{"english":"The third chapter is\"modifier-head compound words in Jinwen Shangshu\".","chinese":"第三部分爲“今文《尚書》偏正複合詞”。"},{"english":"The first chapter is\"composite standard definition of compound words in Jinwen Shangshu\".","chinese":"第一部分爲“今文《尚書》複合詞的界定標準”。"},{"english":"English loves compound words: 'washing machine' and all that sort of thing.","chinese":"英語多喜複合詞，像是“洗衣機”啊這一類的。"},{"english":"The fourth chapter is\"other compound words of Jinwen Shangshu\".","chinese":"第四部分爲“今文《尚書》其它結構複合詞”。"},{"english":"What are the main features of the English compounds?","chinese":"英語複合詞的主要特徵是什麼？"}],"related":[]}