{"definition":["copy"],"pinyin":["fu4 ben3"],"simplified":["复本"],"rank":55671.0,"normalized_rank":0.7789095182796301,"fraction":7.517847783389508e-8,"cumulative_fraction":0.9995659337747972,"word":"複本","characters":[{"definition":["to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate"],"pinyin":["fu4"],"word":"複"},{"definition":["root\/stem\/origin\/source\/this\/the current\/original\/inherent\/originally\/classifier for books, periodicals, files etc"],"pinyin":["ben3"],"word":"本"}],"containing_words":[],"sentences":[{"english":"The Console should indicate that both subscribers received a copy of the message.","chinese":"控制檯應該指示兩個訂戶均收到了該消息的複本。"},{"english":"I put photocopies of my drawings all over the walls.","chinese":"我把自己畫的畫的照片複本貼滿了牆面。"},{"english":"Of, based on, or using the principles of bimetallism .","chinese":"以複本位製爲基礎，或與之相關。"},{"english":"You can also call their office and ask the secretary to give you their fax number.","chinese":"傳真發完之後，再給馬丁的辦公室傳一份複本。"},{"english":"However, sometimes you might want to restore the dataset from the backup copy.","chinese":"但是，有時您可能要從備份複本還原資料集。"},{"english":"Have them faxed over with a copy also faxed to Martin’s office.","chinese":"傳真發完後，再給馬丁的辦公室傳一份複本。"},{"english":"The Provide Data function provides copies of stored AIPs to Access.","chinese":"供應數據功能爲存取功能模塊提供檔案信息包的複本。"},{"english":"You will make a copy of the initial recording and use that as your new test.","chinese":"您可以製作一個最初記錄的複本，作爲您的新測試。"},{"english":"You have the right to request a copy of the personal information we may hold on you.","chinese":"您有權利向金佰利索取一份您的個人資料複本。"},{"english":"Compare the copy in your workspace to the version on the server that is checked out to you.","chinese":"比較工作區中的複本與伺服器上已簽出給您的版本。"}],"related":[]}