{"definition":["to sit for the second round of a two-stage exam"],"pinyin":["fu4 shi4"],"simplified":["复试"],"rank":12904.0,"normalized_rank":0.18054370181746954,"fraction":0.0000054204412406372656,"cumulative_fraction":0.9491261934211268,"word":"複試","characters":[{"definition":["to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate"],"pinyin":["fu4"],"word":"複"},{"definition":["to test\/to try\/experiment\/examination\/test"],"pinyin":["shi4"],"word":"試"}],"containing_words":[],"sentences":[{"english":"The 3rd, the second-round exam is the assessment of pair of examinee knowledge faces.","chinese":"第三，複試是對考生知識面的考覈。"},{"english":"Objects: To know the mental health conditions of candidates for postgraduate taken re-examinations in a university.","chinese":"瞭解某高校參加研究生複試的考生的心理健康狀況。"},{"english":"Accordingly, examinee should begin to make final preparation for the second-round exam.","chinese":"因此，考生應着手爲複試做最後的準備了。"},{"english":"Lasers reproduce the pictures combined into three-dimensional images, or holograms.","chinese":"激光將這些照片複試，組合成三維圖片，或全息圖。"},{"english":"Understanding wants to enter oneself for an examination before the second-round exam the data that school place asks to carry, take complete.","chinese":"複試前要了解報考院校所要求攜帶的資料，並帶全。"},{"english":"One is to have potential auditees review final candidates.","chinese":"一是讓潛在的被審單位複試候選人。"},{"english":"The double-entry accounting is used by virtually every business organization.","chinese":"幾乎每個商業組織都使用複試記賬法。"},{"english":"When re-testing high requirements on the English do not?","chinese":"複試的時候對英語要求高不？"},{"english":"Graduate students of the units and the re-admission process also will be launched.","chinese":"各研究生招生單位複試和錄取工作也隨之啓動。"},{"english":"Amy is back again, for the test.","chinese":"妹妹又回來了，爲了複試。"},{"english":"These elemental expression are proper, regular meeting obtains many impression to divide in the second-round exam.","chinese":"這些元素表現得當，一定會在複試中取得不少印象分。"},{"english":"Troy: Callbacks the same time as the game?","chinese":"複試時間和球賽同時舉行？"},{"english":"You will likely have more opportunity to ask questions in the second interview.","chinese":"複試時你可能有更多的機會問問題。"}],"related":[{"definition":["to accept an applicant (prospective student, employee etc) who passes an entrance exam\/to admit (a student)\/to hire (a job candidate)"],"pinyin":["lu4 qu3"],"word":"錄取"},{"definition":["oral examination\/oral test"],"pinyin":["kou3 shi4"],"word":"口試"},{"definition":["price tag"],"pinyin":["jia4 ma3"],"word":"價碼"},{"definition":["written examination\/paper test (for an applicant)"],"pinyin":["bi3 shi4"],"word":"筆試"},{"definition":["to grade exam papers"],"pinyin":["yue4 juan4"],"word":"閱卷"},{"definition":["to substitute\/to complement in the proper order\/to fill vacancies progressively"],"pinyin":["di4 bu3"],"word":"遞補"},{"definition":["proper reason\/reasonable grounds"],"pinyin":["zheng4 dang4 li3 you2"],"word":"正當理由"},{"definition":["to contend on strong grounds\/to argue strongly for what is right"],"pinyin":["ju4 li3 li4 zheng1"],"word":"據理力爭"},{"definition":["student ID number"],"pinyin":["xue2 hao4"],"word":"學號"},{"definition":["abbr. for 大學學科能力測驗|大学学科能力测验[Da4 xue2 Xue2 ke1 Neng2 li4 Ce4 yan4]"],"pinyin":["Xue2 ce4"],"word":"學測"},{"definition":["to be interviewed (as a candidate)\/interview"],"pinyin":["mian4 shi4"],"word":"面試"},{"definition":["exam question\/test topic"],"pinyin":["shi4 ti2"],"word":"試題"},{"definition":["to hire (an employee)\/to accept (a manuscript) for publication"],"pinyin":["lu4 yong4"],"word":"錄用"},{"definition":["class timetable"],"pinyin":["ke4 cheng2 biao3"],"word":"課程表"},{"definition":["to make a comeback\/(of a doctor's assessment of the gender of a fetus) to turn out to be wrong"],"pinyin":["fan1 pan2"],"word":"翻盤"},{"definition":["to correct an error"],"pinyin":["jiu1 cuo4"],"word":"糾錯"}]}