{"definition":["check box"],"pinyin":["fu4 xuan3 kuang4"],"simplified":["复选框"],"rank":39383.0,"normalized_rank":0.5510192660165377,"fraction":4.072775789447908e-7,"cumulative_fraction":0.9962444756352804,"word":"複選框","characters":[{"definition":["to repeat\/to double\/to overlap\/complex (not simple)\/compound\/composite\/double\/diplo-\/duplicate\/overlapping\/to duplicate"],"pinyin":["fu4"],"word":"複"},{"definition":["to choose\/to pick\/to select\/to elect"],"pinyin":["xuan3"],"word":"選"},{"definition":["frame (e.g. door frame)\/casing\/fig. framework\/template\/to circle (i.e. draw a circle around sth)\/to frame\/to restrict\/Taiwan pr. [kuang1]"],"pinyin":["kuang4"],"word":"框"}],"containing_words":[],"sentences":[{"english":"A check box is toggled by pressing the spacebar.","chinese":"一個複選框可通過單擊空檔鍵進行切換。"},{"english":"Also, make sure you check the box to create a main method.","chinese":"另外，確保勾選了關於創建主方法的複選框。"},{"english":"There is a checkbox next to each product plug-in data collector.","chinese":"每個產品插件數據收集器旁邊有一個對應的複選框。"},{"english":"Uncheck Use a layout or master page.","chinese":"去掉“母板頁佈局”複選框。"},{"english":"You can suppress this message by selecting the check box in the dialog.","chinese":"通過選中對話框中的複選框，您可以取消此消息。"},{"english":"Down the left-hand side you'll see a set of check boxes.","chinese":"沿着左手邊你會看到一個複選框集。"},{"english":"Check the box next to an effect to enable it.","chinese":"在某一特效旁邊的複選框上打勾以啓用它。"},{"english":"The other checkboxes specify behavior to be followed after the extraction.","chinese":"其他複選框指定在提取完成之後應該執行的行爲。"},{"english":"By clearing this check box, you limit the number of templates available.","chinese":"通過清除此複選框，可以限制可用模板的數量。"},{"english":"To revoke these authorities, you could uncheck the box beside each authority.","chinese":"要撤消這些權限，可以不選中權限旁邊的複選框。"},{"english":"Uncheck boxes Leaving only one box checked and click okay.","chinese":"取消勾選框只留下一個複選框，然後點擊好。"},{"english":"De-select this checkbox.","chinese":"取消選中此複選框。"},{"english":"To set a check in every subitem , you check the checkbox in the column header.","chinese":"要設置在每一個分項目檢查時，檢查的列標題複選框。"},{"english":"Let's add a checkbox that toggles a message on and off.","chinese":"讓我們添加一個複選框用於開關消息。"},{"english":"You will see two checkboxes on this page. It is the second one that is relevant here","chinese":"在此頁面上將看到兩個複選框。"},{"english":"You will notice that in this case, the check box specifying multi-valued data is selected.","chinese":"您會注意到指定多值數據的複選框被選中了。"}],"related":[]}