{"definition":["ragged\/shabby"],"pinyin":["lan2 lu:3"],"simplified":["褴褛"],"rank":52795.0,"normalized_rank":0.7386705469198159,"fraction":1.062717123554866e-7,"cumulative_fraction":0.999307388128574,"word":"襤褸","characters":[{"definition":["ragged garments"],"pinyin":["lan2"],"word":"襤"},{"definition":["soiled\/tattered"],"pinyin":["lu:3"],"word":"褸"}],"containing_words":[],"sentences":[{"english":"The eldest Kasyapa's disciples were in rags and practiced a Dhuta practice.","chinese":"大伽葉的弟子衣衫襤褸，他們修的是頭陀行。"},{"english":"He, Jean Valjean, had made her abandon those rags to clothe herself in these mourning habiliments.","chinese":"是他冉阿讓，使她脫下了這襤褸的衣服，換上了孝服。"},{"english":"They huddled inside the storm door—two children in ragged outgrown coats.","chinese":"他們蜷縮在風門裏面，是兩個衣衫襤褸的孩子。"},{"english":"Before long, his widow and children were in rags, begging on the streets.","chinese":"不久，他的妻兒們就衣裳襤褸，要到街上要飯了。"},{"english":"They all wore tattered clothes.","chinese":"他們都穿着襤褸的衣衫。"},{"english":"Yeah I love scuffed up cowboy boots and broken tore up jeans.","chinese":"是的我愛穿磨損牛仔靴破洞襤褸牛仔褲。"},{"english":"Somewhere, under those rags…are you still the greatest geisha in Miyako?","chinese":"你在這深襤褸衣衫之下，仍是宮古市最美的藝伎嗎？"},{"english":"He looks around and finds that there is a beggar with shabbily dresses.","chinese":"他向四周看了看，發現個衣衫襤褸的乞討者。"},{"english":"Better go to heaven in rags than to hell in embroidery.","chinese":"與其衣錦而入地獄寧可襤褸而入天堂。"},{"english":"Shabby clothes don't necessarily prove that you are free from corruption.","chinese":"冠帶襤褸不一定證明你是清廉的。"},{"english":"He died four days later in a hospital. He was forty years old.","chinese":"他衣衫襤褸，他被送到醫院四天後去逝，年僅40歲。"},{"english":"The prowess and endowment are the prowler's wager to the dowdy dowager.","chinese":"英勇和稟賦是潛行者下給衣衫襤褸的富孀的賭注。"},{"english":"Senile as he is, he crouches in some ragged pieces of cloth.","chinese":"因爲他是老年，他蜷縮在一些衣衫襤褸的布片。"},{"english":"Round and round the ruffed rock the ragged rascal ran.","chinese":"衣襯襤褸的無賴圍着高低不平的岩石不停地跑。"},{"english":"A ragged man emerged from behind the tree.","chinese":"一個衣衫襤褸的男人從樹後面走出來。"},{"english":"The harpist is sitting there in rags.","chinese":"彈着豎琴的女子坐在那兒，衣衫襤褸。"}],"related":[]}