{"definition":["attacker"],"pinyin":["xi2 ji1 zhe3"],"simplified":["袭击者"],"rank":12494.0,"normalized_rank":0.1748072698781358,"fraction":0.000005730935652972595,"cumulative_fraction":0.946844286047739,"word":"襲擊者","characters":[{"definition":["to attack\/to inherit\/classifier for suits (esp. of funeral robes)"],"pinyin":["xi2"],"word":"襲"},{"definition":["to hit\/to strike\/to break\/Taiwan pr. [ji2]"],"pinyin":["ji1"],"word":"擊"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"The attackers also hurled grenades.","chinese":"襲擊者還投擲了手雷。"},{"english":"The attacker was identified by the state-run Xinhua news agency as Wu Huanming, 48.","chinese":"中國新華社確認了該襲擊者名爲吳煥明，四十八歲。"},{"english":"Early one morning, Shmi was attacked and abducted by the savage Tusken Raiders.","chinese":"一天清晨，野蠻的塔斯肯襲擊者毆打併綁架了施密。"},{"english":"He said unfortunately one of the attackers managed to escape.","chinese":"他說，遺憾的是其中一名襲擊者設法逃逸。"},{"english":"The hospital chief executive said the attackers just barged in and fired indiscriminately.","chinese":"這家醫院院長表示，襲擊者衝進來，亂槍掃射。"},{"english":"The Shabab says it has set up three units of suicide-bombers.","chinese":"伊斯蘭青年黨宣稱他們已經組建了3自殺襲擊者小組。"},{"english":"Mr. Ramos-Horta says that international peacekeepers were too slow in their attempts to catch his attackers.","chinese":"霍爾塔說，國際維和部隊追捕襲擊者的行動過於緩慢。"},{"english":"Attackers who do, will be subjected to the disorienting effects of the light.","chinese":"仍繼續靠近船隻的襲擊者，將遭到激光的眩暈效果。"},{"english":"Yeah. I think the suicide bombers do have ideals.","chinese":"是的，我認爲自殺式襲擊者是有理想的。"},{"english":"Alam refused to speculate on the attackers motives.","chinese":"阿拉姆拒絕推測襲擊者動機。"},{"english":"Right? We are kind of suicide bomber.","chinese":"就像自殺式襲擊者那樣。"},{"english":"The raiders plundered all the cattle.","chinese":"襲擊者偷走了所有的耕牛。"},{"english":"Xulhaz and a companion were hacked to death by unidentified attackers on Monday.","chinese":"曼南和一名同伴星期一被身份不明的襲擊者砍死。"},{"english":"En route, they were ambushed by Tusken Raiders.","chinese":"在途中，他們遭到塔斯肯襲擊者的伏擊。"},{"english":"He saw his assailant head straight for the Tour Magdala.","chinese":"他看到他的襲擊者朝着馬格達拉塔直奔。"},{"english":"The scavenger vessel is called the Raider.","chinese":"清道夫飛船名爲“襲擊者號”。"}],"related":[]}