{"definition":["Western medicine\/a doctor trained in Western medicine"],"pinyin":["xi1 yi1"],"simplified":["西医"],"rank":19066.0,"normalized_rank":0.2667580764764317,"fraction":0.000002634604209604152,"cumulative_fraction":0.9724899869029898,"word":"西醫","characters":[{"definition":["the West\/abbr. for Spain 西班牙[Xi1 ban1 ya2]\/Spanish","west"],"pinyin":["Xi1","xi1"],"word":"西"},{"definition":["medical\/medicine\/doctor\/to cure\/to treat"],"pinyin":["yi1"],"word":"醫"}],"containing_words":[{"definition":["Chinese and Western medicine\/a doctor trained in Chinese and Western medicine"],"pinyin":["zhong1 xi1 yi1"],"word":"中西醫"},{"definition":["to combine traditional Chinese and Western medicine"],"pinyin":["Zhong1 Xi1 yi1 jie2 he2"],"word":"中西醫結合"}],"sentences":[{"english":"Modern Western medicine has had little impact in staying the disease's deadly hand.","chinese":"現代西醫技術對這種疾病的死亡之手基本束手無策。"},{"english":"To explore traditional chinese and western medicine treatment methods anorectal prolapse.","chinese":"探討中西醫治療肛管直腸脫垂的方法。"},{"english":"However, it also encountered several problems on the way of development.","chinese":"但中西醫結合在發展的道路上也遇到了若干問題。"},{"english":"Patients in the treatment group took Modified Li Zhong Tang on the basis of conventional western treatment.","chinese":"治療組在西醫常規治療基礎上服用加味理中湯。"},{"english":"Western medicine's \"Seven Emotions\" disease is well founded.","chinese":"西醫的“七情”致病很有道理。"},{"english":"Objective To explore the treatment perscription with the method of integrated traditional and western medicine in type 2 diabetes.","chinese":"目的探討2型糖尿病中西醫結合治療方案。"},{"english":"Resultantly , the gastric cancer postoperative complications were successfully treated with the combination of Chinese and Western medicine.","chinese":"中西醫結合治療成功控制此胃癌術後併發症的案例。"},{"english":"Surgery of integrated Chinese and Western medicine is a clinical discipline that attaches great importance to practice.","chinese":"中西醫結合外科學是一門實踐性極強的臨牀學科。"},{"english":"Objective To investigate the clinical efficacy of treating tubal reghancy with combined therapy of Chinese and western medicine.","chinese":"目的探討中西醫結合治療輸卵管妊娠的臨牀療效。"},{"english":"OBJECTIVE To observe the effect of traditional Chinese medicine combined with western medicine on treatment muscular asthenopia.","chinese":"目的觀察用中西醫結合方法治療肌性視疲勞的療效。"},{"english":"Though she chose to become a doctor, she said there was ample room for both approaches.","chinese":"雖然她選擇成爲醫生，但她表示西醫和巫醫並行不悖。"},{"english":"Objective To observe the therapeutic effect of Banxiaxiexin decoction combined with Mosapride tablets in treating functional dyspepsia.","chinese":"目的觀察中西醫結合治療功能性消化不良的療效。"},{"english":"We observed the effect of integrative medical treatment in therapy group and simply isosorbide dinitrate treatment in control group.","chinese":"對中西醫結合方法和單純服用消心痛的療效進行觀察。"},{"english":"To explore the clinical effect of Chinese medicine combined with western medicine in treating lymphoid tuberculosis.","chinese":"目的探討中西醫治療淋巴結核的臨牀療效。"},{"english":"Objective To explore how to increase cure rate of hemorrhagic necrotizing pancreatitis.","chinese":"中西醫結合治療急性壞死性筋膜炎能取得良好的療效。"},{"english":"Advocators believed that Chinese medicine is not scientifically based in comparison with West medicine.","chinese":"與西醫相比，中醫沒有科學依據。"}],"related":[{"definition":["traditional Chinese medical science\/a doctor trained in Chinese medicine"],"pinyin":["Zhong1 yi1"],"word":"中醫"},{"definition":["medical\/medicine\/doctor\/to cure\/to treat"],"pinyin":["yi1"],"word":"醫"},{"definition":["doctor\/CL:個|个[ge4],位[wei4],名[ming2]"],"pinyin":["yi1 sheng1"],"word":"醫生"},{"definition":["medicine\/medical science\/study of medicine"],"pinyin":["yi1 xue2"],"word":"醫學"},{"definition":["(traditional) Chinese medicine\/CL:服[fu4],種|种[zhong3]"],"pinyin":["Zhong1 yao4"],"word":"中藥"},{"definition":["Western medicine"],"pinyin":["xi1 yao4"],"word":"西藥"},{"definition":["to treat (an illness)\/medical treatment\/therapy"],"pinyin":["zhi4 liao2"],"word":"治療"},{"definition":["clinical"],"pinyin":["lin2 chuang2"],"word":"臨床"},{"definition":["to treat\/to cure\/therapy"],"pinyin":["liao2"],"word":"療"},{"definition":["medicaments\/pharmaceuticals\/medication\/medicine\/drug"],"pinyin":["yao4 wu4"],"word":"藥物"},{"definition":["hospital\/CL:所[suo3],家[jia1],座[zuo4]"],"pinyin":["yi1 yuan4"],"word":"醫院"},{"definition":["medicine\/drug\/substance used for a specific purpose (e.g. poisoning, explosion, fermenting)\/CL:種|种[zhong3],服[fu4],味[wei4]\/to poison"],"pinyin":["yao4"],"word":"藥"},{"definition":["doctor"],"pinyin":["yi1 shi1"],"word":"醫師"},{"definition":["diagnosis\/to diagnose"],"pinyin":["zhen3 duan4"],"word":"診斷"},{"definition":["to prescribe medicine"],"pinyin":["kai1 yao4"],"word":"開藥"},{"definition":["acupuncture and moxibustion\/to give or have acupuncture and moxibustion"],"pinyin":["zhen1 jiu3"],"word":"針灸"}]}