{"definition":["key job\/important position"],"pinyin":["yao4 zhi2"],"simplified":["要职"],"rank":24407.0,"normalized_rank":0.3414855959593133,"fraction":0.0000015680916677508752,"cumulative_fraction":0.9833880850231608,"word":"要職","characters":[{"definition":["important\/vital\/to want\/to ask for\/will\/going to (as future auxiliary)\/may\/must\/(used in a comparison) must be\/probably\/if","to demand\/to request\/to coerce"],"pinyin":["yao1","yao4"],"word":"要"},{"definition":["office\/duty"],"pinyin":["zhi2"],"word":"職"}],"containing_words":[],"sentences":[{"english":"The Bartender's primary function involves serving alcoholic and non-alcoholic beverages to guests of the Resort.","chinese":"吧員的主要職責是爲客人提供含酒精和不含酒精飲料。"},{"english":"Assessing risks should not be your main priority.","chinese":"評估風險大小不應該是你的主要職責。"},{"english":"You see,many of you, not far from now,you will be in influential positions.","chinese":"你們許多人，不久將會身居要職。"},{"english":"He occupies an important post in government.","chinese":"他在政府中任要職。"},{"english":"Many of the enterprises are employing leading- post retirement premises Board.","chinese":"該企業更是聘用不少房地局退休領導任要職。"},{"english":"This server's main duty is handling name-related tasks.","chinese":"此服務器的主要職責是處理名稱相關的任務。"},{"english":"The king conferred the dignity of a peerage on the general.","chinese":"國王頒賜爵位這要職給將軍。"},{"english":"Ordinary people have always resented the nomenklatura's privileges.","chinese":"老百姓一直都對要職人員的特權心懷怨恨。"},{"english":"The main responsibilities of the independent quality unit(s) should not be delegated.","chinese":"獨立的質量部的主要職責不應該委派給他人。"},{"english":"Pai maneuvered himself into a strategic position in Central China and became commander of the government's defense at Hankow.","chinese":"白崇禧設法混到漢口擔任華中剿匪總司令的要職。"},{"english":"Some went on to occupy prestigious positions in the pharmaceutical industry, health ministry and academia.","chinese":"這些人戰後繼續在製藥業，衛生部和學術界擔任要職。"},{"english":"Its main functions are facing the class teaching system.","chinese":"其主要職責是面向全班學生系統授課。"},{"english":"You have a splendid position, but it is your splendid position that makes you so vulnerable.","chinese":"你身居要職，但也正是這顯赫的地位令你不堪一擊。"},{"english":"One of the organization's main jobs has become assigning and overseeing domain names on the Internet.","chinese":"分配和監督互聯網域名已成爲該組織的一個主要職責。"},{"english":"This non-principal part of innovation is an important responsibility for science editors.","chinese":"非主體的創新是科技編輯的重要職責。"},{"english":"The main role of the Tabardariyya is to guard the Sultan and the palace.","chinese":"蘇丹禁衛軍主要職責爲保護蘇丹王室及蘇丹宮殿。"}],"related":[]}