{"definition":["main point\/essential"],"pinyin":["yao4 dian3"],"simplified":["要点"],"rank":8750.0,"normalized_rank":0.1224238523638297,"fraction":0.00001035200340891392,"cumulative_fraction":0.9181292098317191,"word":"要點","characters":[{"definition":["important\/vital\/to want\/to ask for\/will\/going to (as future auxiliary)\/may\/must\/(used in a comparison) must be\/probably\/if","to demand\/to request\/to coerce"],"pinyin":["yao1","yao4"],"word":"要"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[{"definition":["strategic point"],"pinyin":["zhan4 lu:e4 yao4 dian3"],"word":"戰略要點"}],"sentences":[{"english":"What do you think it takes to beat you besides luck?","chinese":"你覺得要想打敗你，除了運氣還需要點什麼？"},{"english":"Our course deals with the essentials of management.","chinese":"我們的課程講述管理的基本要點。"},{"english":"The optical unit and the electronic unit of measurement equipment are shown.","chinese":"介紹了測量裝置光路部分和電路部分的技術要點。"},{"english":"Objective To explore the operative design and technique of human hand allotransplantation.","chinese":"目的探討異體手移植的手術設計與技術操作要點。"},{"english":"This paper introduced the characteristics and its higy-yielding oultural techniques of \"Chuanbei 1\".","chinese":"該文主要介紹了川貝1號的特徵特性及栽培技術要點。"},{"english":"First, the leverage is the whole point.","chinese":"第一，槓桿作用是整個要點。"},{"english":"Objective To study the nursing points of using semiconductor laser to cure early glottis cancer.","chinese":"目的探討半導體激光手術治療早期聲門癌的護理要點。"},{"english":"Review all key points which are listed on flip chart .","chinese":"回顧翻轉展示板上的要點。"},{"english":"What's the point of creating a header file with extern declarations?","chinese":"創建一個與外部聲明的頭文件的要點是什麼？"},{"english":"Summerized the key nursing methods of removing the tracheobronchial foreign bodies in children.","chinese":"總結了小兒氣管支氣管異物取出術的護理要點。"},{"english":"Objective To explore the nursing care of patients with auto-immune hepatitis.","chinese":"目的探討自身免疫性肝炎的臨牀護理要點。"},{"english":"Key technology and method to display serial processed DIB image is presented.","chinese":"着重敘述DIB位圖連貫顯示的技術要點和實現方法。"},{"english":"Each of these points needs to be considered when hitching an open source project to a corporate bandwagon.","chinese":"在承擔公司的開放源碼項目時，需要考慮上述要點。"},{"english":"Pig tail is a type of popularized food , the processing technology and key points of soft packaging pig tail are detailed in this article.","chinese":"主要討論了軟包裝滷製豬尾的加工工藝及技術要點。"},{"english":"He only adverted to mine leading points of the arguments.","chinese":"他只提到一些爭論的要點。"},{"english":"The purpose was to study the processing route and operating points of papier-mache Pteridium aquilinum processing.","chinese":"爲了研究紙型蕨菜加工的工藝流程及操作要點。"}],"related":[{"definition":["crucial point\/crux\/CL:個|个[ge4]\/key\/crucial\/pivotal"],"pinyin":["guan1 jian4"],"word":"關鍵"},{"definition":["to discuss\/to talk over\/CL:個|个[ge4]"],"pinyin":["tao3 lun4"],"word":"討論"},{"definition":["in a word\/in short\/in brief"],"pinyin":["zong3 zhi1"],"word":"總之"},{"definition":["important point\/main point\/focus\/key (project etc)\/to focus on\/to put the emphasis on","to recount (e.g. results of election)\/to re-evaluate"],"pinyin":["chong2 dian3","zhong4 dian3"],"word":"重點"},{"definition":["to have to\/must\/compulsory\/necessarily"],"pinyin":["bi4 xu1"],"word":"必須"},{"definition":["correct\/proper"],"pinyin":["zheng4 que4"],"word":"正確"},{"definition":["to explain"],"pinyin":["jiang3 jie3"],"word":"講解"},{"definition":["to explain\/to illustrate\/to indicate\/to show\/to prove\/explanation\/directions\/caption\/CL:個|个[ge4]"],"pinyin":["shuo1 ming2"],"word":"說明"},{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有關"},{"definition":["really\/indeed"],"pinyin":["di2 que4"],"word":"的確"},{"definition":["principle\/doctrine\/CL:個|个[ge4]"],"pinyin":["yuan2 ze2"],"word":"原則"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["concrete\/definite\/specific"],"pinyin":["ju4 ti3"],"word":"具體"},{"definition":["suitable\/appropriate"],"pinyin":["shi4 dang4"],"word":"適當"},{"definition":["to sum up\/to conclude\/summary\/résumé\/CL:個|个[ge4]"],"pinyin":["zong3 jie2"],"word":"總結"},{"definition":["regarding\/as far as sth is concerned\/with regards to"],"pinyin":["dui4 yu2"],"word":"對於"}]}