{"definition":["disastrous policy"],"pinyin":["fu4 zhe2"],"simplified":["覆辙"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"覆轍","characters":[{"definition":["to cover\/to overflow\/to overturn\/to capsize","variant of 復|复[fu4]\/to reply to a letter"],"pinyin":["fu4"],"word":"覆"},{"definition":["rut\/track\/rhyme\/(dialect) way\/method","to remove\/to withdraw"],"pinyin":["che4","zhe2"],"word":"轍"}],"containing_words":[{"definition":["to follow the track of an overturned cart\/to repeat a disastrous policy"],"pinyin":["chong2 dao3 fu4 zhe2"],"word":"重蹈覆轍"}],"sentences":[{"english":"In an effort not to repeat the same situation with their own children, they have few rules.","chinese":"爲了不使孩子重蹈覆轍，他們很少給孩子立規矩。"},{"english":"Otherwise, you are doomed to repeat it.","chinese":"否則，你就註定會重蹈覆轍。"},{"english":"I made a blunder, and I tell myself that I'll never make that mistake again.","chinese":"我犯了個大錯，我告訴自己絕不會再重蹈覆轍。"},{"english":"Given the turnover of dynasties in the past, I don't think the Qing could be revived.","chinese":"過往朝廷覆轍在前，我想大清不還陽的那天了。"},{"english":"In this context, history could repeat itself in the Arab World.","chinese":"以此類推，阿拉伯世界有可能重蹈覆轍。"},{"english":"We made the mistake of romanticizing villages, and we don't need to make that mistake again.","chinese":"我們錯誤地把鄉村浪漫化，我們不要再重蹈覆轍。"},{"english":"Acknowledge your role in it so you can avoid repeating it.","chinese":"承認你對婚姻失敗負有責任，從而避免重蹈覆轍。"},{"english":"To reGREt one’s errors to the point of not repeating them is true repentance.","chinese":"反思自己的過錯以至於不重蹈覆轍纔是真正的悔悟。"},{"english":"The General met Lincoln’s original fate, the electric chair.","chinese":"將軍重蹈林肯覆轍，坐上了死刑的電椅。"},{"english":"It should be clear to everyone that we will not repeat the mistakes of the past.","chinese":"大家應當清楚，我們不會重蹈覆轍。"},{"english":"I am the sister of a ten-year-old boy who is busy making them now.","chinese":"我是一個十歲男孩的姐姐，他正忙於重蹈我的覆轍。"},{"english":"Who can guarantee that we won’t repeat our previous mistakes?","chinese":"誰敢保證在這件事情上我們不會重蹈覆轍？"},{"english":"Old McDonald gave up smoking for a while, but soon returned to his old ways.","chinese":"老麥克唐納戒了一段時間煙，但不久又重蹈覆轍。"},{"english":"By learning about these pitfalls now, you will be able to avoid them in the future.","chinese":"現在學習到這些缺陷可以避免你在今後重蹈覆轍。"},{"english":"He who does not learn from history dooms to repeat it.","chinese":"不向歷史學習的人註定要重蹈覆轍。"},{"english":"The system is accident-prone, but it rarely makes the same mistake twice.","chinese":"金融系統容易發生意外，但它很少重蹈覆轍。"}],"related":[]}