{"definition":["a (10 meter) square\/a square of given side"],"pinyin":["jian4 fang1"],"simplified":["见方"],"rank":28837.0,"normalized_rank":0.4034670434989436,"fraction":0.000001044031987316539,"cumulative_fraction":0.9890892669323174,"word":"見方","characters":[{"definition":["to appear\/also written 現|现[xian4]","to see\/to meet\/to appear (to be sth)\/to interview"],"pinyin":["jian4","xian4"],"word":"見"},{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["Fang1","fang1"],"word":"方"}],"containing_words":[],"sentences":[{"english":"Rib meat sheep will be washed, cut into 4 cm square block.","chinese":"將羊肋條肉洗淨，切成4釐米見方的塊。"},{"english":"She can even squeeze herself into boxes just 50 sq cm.","chinese":"她甚至可以將自己塞進一個僅50釐米見方的盒子裏。"},{"english":"At its summit is a rock only about six meters across.","chinese":"峯頂是一塊僅僅6米見方的岩石。"},{"english":"The pork is cut into 2-inch squares of both fat and lean meat with the skin left on.","chinese":"肥瘦相間的豬肉被切成2英寸見方的肉塊，保留豬皮。"},{"english":"She can even squeeze herself into boxes just 50cms squared.","chinese":"她甚至可以讓自己擠進僅僅50釐米見方的盒子裏。"},{"english":"The chief's house contained an audience room forty feet square .","chinese":"酋長的房裏有一個接見室，四十英尺見方。"},{"english":"Guo cut off abducted, two dogs naturally come to meet Fang jie.","chinese":"郭割擄已死，二狗自然要來見見方捷。"},{"english":"It is 1 metre cubed and made of a robust recycled plastic that can be adapted to individual needs.","chinese":"這個很結實的1米見方的回收塑料盒能適合個人需要。"},{"english":"Which has Anshan to sell the monoblock lumber's? 1 meter of square is the above.","chinese":"鞍山哪有賣整塊的木料的？1米見方以上的。"}],"related":[]}