{"definition":["to regulate\/rules and regulations\/regulatory\/style and structure (esp. of building)"],"pinyin":["gui1 zhi4"],"simplified":["规制"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"規制","characters":[{"definition":["compass\/a rule\/regulation\/to admonish\/to plan\/to scheme"],"pinyin":["gui1"],"word":"規"},{"definition":["system\/to control\/to regulate\/variant of 製|制[zhi4]"],"pinyin":["zhi4"],"word":"制"}],"containing_words":[],"sentences":[{"english":"Based on this theory, many countries carried out anti-monopoly reform and legal regulation on the electricity industry.","chinese":"這正是各國電力行業改革與反壟斷法律規制的依據。"},{"english":"Again, analysis of government non-tax revenue into the feasibility of legal regulation.","chinese":"再次，淺析淺析了政府非稅收入法律規制的可行性。"},{"english":"V. How can Anti-monopoly Law Regulate the Court of Law for Abuse of Power?","chinese":"反壟斷法如何規制法院權力濫用？"},{"english":"Part three makes a study on the costs and gains of current system of electrical utility regulation.","chinese":"第三部分分析了現行電業規制制度成本與績效。"},{"english":"Chapter II, analysis the current experience of legal regulation on patent pool abuse.","chinese":"第三部分，闡述了我國專利池運用及規制現狀。"},{"english":"Chapter two is about the integration principles of standard terms.","chinese":"第二章主要分析規制格式條款的訂入規則。"},{"english":"So it is necessary for our country to regulate the behavior of public enterprises restricting competition.","chinese":"爲此，有必要對公用企業限制競爭行爲進行規制。"},{"english":"The U. S. Plan reaffirmed the nature of financial law lies in regulation and supervision.","chinese":"方案再次和反覆證明了規制與監管是金融法的品性。"},{"english":"Chapter two is the comparative research on regulations governing unmarried cohabitation in foreign countries.","chinese":"第二章是對非婚同居法律規制的比較研究。"},{"english":"Therefore, this article providessomething valuable to regulating one-man company in our country at the legal level.","chinese":"從而爲我國如何在法律層面上規制一人公司提供參考。"},{"english":"The corporation laws of each states are similar but not identical .","chinese":"美國沒有單一法典或法規規制商務企業法。"},{"english":"Chapter two discusses the justifiability of Antimonopoly regulatory law for abuse of IPRs.","chinese":"第二章提出反壟斷法規制知識產權濫用的正當性命題。"},{"english":"The regulation of enterprises merger is an important part of Anti-monopoly Law.","chinese":"對企業合併進行規制是反壟斷法的重要內容之一。"},{"english":"There are two types of model in the legislation of anti-takeover England model and American model.","chinese":"在反收購的法律規制中，可資借鑑的有英美兩種模式。"},{"english":"The second part mainly approaches the problem of the controlling form term made into the contracts.","chinese":"第二部分研究格式條款之訂入合同及其規制。"},{"english":"The third issue of the thesis is the theoretical analysis of anti-monopoly regulation on the Business Franchise.","chinese":"第三部分是商業特許經營領域反壟斷規制的理論分析。"}],"related":[{"definition":["written report"],"pinyin":["bao4 gao4 shu1"],"word":"報告書"},{"definition":["terms (of an agreement)"],"pinyin":["gui1 yue1"],"word":"規約"},{"definition":["to establish\/to found\/to create (a good environment)"],"pinyin":["chuang4 she4"],"word":"創設"},{"definition":["preparedness\/to bring sth to a state of readiness"],"pinyin":["zheng3 bei4"],"word":"整備"},{"definition":["to apologize for an offense\/to offer one's apology for a fault"],"pinyin":["xie4 zui4"],"word":"謝罪"},{"definition":["to make a correction"],"pinyin":["ding4 zheng4"],"word":"訂正"},{"definition":["to link\/to peg (currency)\/gang (gears)\/continuously\/serial verb construction"],"pinyin":["lian2 dong4"],"word":"連動"},{"definition":["Takeshima (Korean Dokdo 獨島|独岛[Du2 dao3]), disputed islands in Sea of Japan"],"pinyin":["Zhu2 dao3"],"word":"竹島"},{"definition":["to decide\/to determine\/established practice\/(dialect) firmly resolved (to do sth)"],"pinyin":["ding4 gui1"],"word":"定規"},{"definition":["radiation\/rays of radiation"],"pinyin":["fang4 she4 xian4"],"word":"放射線"},{"definition":["frequently\/often\/usually\/regularly"],"pinyin":["chang2 shi2"],"word":"常時"},{"definition":["rules\/regulations"],"pinyin":["gui1 cheng2"],"word":"規程"},{"definition":["base\/foundation\/(Tw) (geology) bedrock"],"pinyin":["ji1 pan2"],"word":"基盤"},{"definition":["check-up (health, car safety, environment etc)"],"pinyin":["jian4 zhen3"],"word":"健診"},{"definition":["unconstitutional"],"pinyin":["wei2 xian4"],"word":"違憲"},{"definition":["(military) arms\/armaments"],"pinyin":["jun1 bei4"],"word":"軍備"}]}