{"definition":["according to a pattern\/regular\/orderly\/structured\/neat and tidy"],"pinyin":["gui1 zheng3"],"simplified":["规整"],"rank":31734.0,"normalized_rank":0.4439998321044311,"fraction":8.068183436658991e-7,"cumulative_fraction":0.991756439772318,"word":"規整","characters":[{"definition":["compass\/a rule\/regulation\/to admonish\/to plan\/to scheme"],"pinyin":["gui1"],"word":"規"},{"definition":["exactly\/in good order\/whole\/complete\/entire\/in order\/orderly\/to repair\/to mend\/to renovate\/(coll.) to fix sb\/to give sb a hard time\/to mess with sb"],"pinyin":["zheng3"],"word":"整"}],"containing_words":[{"definition":["irregular\/disordered"],"pinyin":["fei1 gui1 zheng3"],"word":"非規整"}],"sentences":[{"english":"The regulation of the steel slag particle was improved with grinding time.","chinese":"隨着粉磨時間的延長，鋼渣顆粒的規整度進一步提高。"},{"english":"Neat Vegetable Garden in the City of Nanking, China.","chinese":"南京城內一處規整的小菜園。"},{"english":"The use of regular packing and new inner parts in the modification of cuprammonia tower, as well as related achievement are introduced.","chinese":"論述規整填料和新型塔內件在銅洗塔改造中的效果。"},{"english":"Melon is oval, shape neat, beautiful of big fruit type stripe.","chinese":"瓜正橢圓形，果形規整，條紋美觀屬大果型。"},{"english":"The new process of domestic PA refining and the technique of high efficiency regular packing tower are introduced.","chinese":"介紹了國內苯酐精製新工藝和高效規整填料塔技術。"},{"english":"Bottom 6 teams burn, the whole device nail team spirit foot, make after god very neat.","chinese":"底部6個支釘支燒，整器神完氣足，製作極其規整。"},{"english":"The technological charateristics and application advantages of stucture packing are expounded.","chinese":"闡述了規整填料塔的技術特性和應用優勢。"},{"english":"They form genre of folksongs with exquisitely subtle tunes.","chinese":"它們節奏規整，曲調細膩委婉。"},{"english":"This technique could be a new route to synthesize arranged zeolitic materials without binder.","chinese":"是一種無粘合劑合成分子篩規整催化劑的一個新途徑。"},{"english":"The column diameter can be kept constant by changing the corrugation angle of structured packing.","chinese":"通過改變波紋規整填料的傾角可以避免塔體變徑。"},{"english":"The site is standard, long in the south-north direction.","chinese":"場地規整，南北進深較大。"}],"related":[]}