{"definition":["to regard as\/to treat as"],"pinyin":["shi4 zuo4"],"simplified":["视作"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"視作","characters":[{"definition":["to look at\/to regard\/to inspect"],"pinyin":["shi4"],"word":"視"},{"definition":["to do\/to grow\/to write or compose\/to pretend\/to regard as\/to feel\/writings or works","worker\/workshop\/(slang) troublesome\/high-maintenance (person)"],"pinyin":["zuo1","zuo4"],"word":"作"}],"containing_words":[],"sentences":[{"english":"The Maybach has been adopted as the ultimate status symbol by Russia's super-rich.","chinese":"邁巴赫被視作俄國超級富豪的”終極身份象徵“。"},{"english":"We see this platform as winning.","chinese":"我們把這個平臺視作一種勝利。"},{"english":"In feudal society, the dragon also be regarded as a symbol of the emperor.","chinese":"在封建社會，龍更被視作帝王的象徵。"},{"english":"It sees the dead as lovers, too.","chinese":"它也把死者視作愛人。"},{"english":"The Boxer episode is commonly portrayed in the West as an orgy of anti-foreign violence.","chinese":"在西方，義和團被視作反西方的暴力狂歡。"},{"english":"Bituminous coal is often treated as a consistent and homogeneous product.","chinese":"煙煤一般被視作一種質地均勻一致的產品。"},{"english":"All the cultural activities in Gannan should be regarded as hakka culture occurancies.","chinese":"歷史上發生於贛南的文化事象都應視作客家文化。"},{"english":"In the a ence of such indication, the credit shall be deemed to be revocable.","chinese":"如無該項表示，信用證應視作是可撤銷的。"},{"english":"Before being liberated from slavery, these people had been scorned and used and treated as outcasts.","chinese":"以色列人脫離奴役前，飽受嘲弄利用，被視作賤民。"},{"english":"Reporters used to be considered non-combatants. Not anymore.","chinese":"記者通常被視作非戰鬥人員，現在就不行了。"},{"english":"I could have him for my fellow worker but not for a friend.","chinese":"我可以把他看做我的同事，卻不能視作朋友。"},{"english":"Management dismissed the union's behavior as irresponsible and unreasonable.","chinese":"管理層把工會行爲視作不負責任和無理要求草草處理。"},{"english":"So exactly what in this case is supposed to be delusive?","chinese":"那麼，這個例子中究竟有什麼應被視作欺幻呢？"},{"english":"Payment made before mid- night on the due date will be regarded as on- time payment.","chinese":"於到期日午夜前繳款會被視作準時繳交。"},{"english":"There was no room for details that were to be viewed as individual elements.","chinese":"細節不應被視作獨個的元素。"},{"english":"In four seasons with Cleveland, Diop was deemed a bust.","chinese":"在克里夫蘭的4個賽季，迪奧普被視作水貨。"}],"related":[]}