{"definition":["to be determined by\/to depend on"],"pinyin":["shi4 hu1"],"simplified":["视乎"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"視乎","characters":[{"definition":["to look at\/to regard\/to inspect"],"pinyin":["shi4"],"word":"視"},{"definition":["(classical particle similar to 於|于[yu2]) in\/at\/from\/because\/than\/(classical final particle similar to 嗎|吗[ma5], 吧[ba5], 呢[ne5], expressing question, doubt or astonishment)"],"pinyin":["hu1"],"word":"乎"}],"containing_words":[],"sentences":[{"english":"The amount of government subsidy depends on the number of students they admit.","chinese":"政府資助額視乎收生人數而定。"},{"english":"Depending on the requirement of the top layer, backing papers vary very much in nature.","chinese":"視乎面層的要求，託底紙有各種極端不同的性質。"},{"english":"It all depends on perspective; on how you see the situation.","chinese":"這完全視乎你如何看待這種狀況。"},{"english":"All hotel bonus offers are subject to availability.","chinese":"所有酒店優惠須視乎供應情況而定。"},{"english":"All hotel value-adds are not valid for Special prices and are subject to availability.","chinese":"所有酒店優惠不適用於優惠價及須視乎供應情況而訂。"},{"english":"Advertising position will be offered on first-come-first served basis and subject to space availability.","chinese":"廣告位置將以先到先得辦理，並需視乎位置調配而定。"},{"english":"Depending on the requirement, either letter-press printing blocks or gravure printing places can be produced.","chinese":"視乎需要，它可以造成供凸版或凹版印刷用的印版。"},{"english":"August 4You’ll get as many chances as you want and need.","chinese":"機會的多寡視乎你的慾望和需求。"},{"english":"Most are reasonably priced between $25 and $40 depending on where you get it.","chinese":"最合理的票價由25元和40元，視乎何處得到它。"},{"english":"Filling the gap between model and reality may need something besides this.","chinese":"彌合模型和事實之間的差距光靠這些視乎不夠。"},{"english":"Depending on how you look at this research result.","chinese":"視乎你如何看這個研究結果。"},{"english":"Availability of gifts depends on the level of demand.","chinese":"獎品之供應須視乎需求而定。"}],"related":[]}