{"definition":["parallax"],"pinyin":["shi4 cha1"],"simplified":["视差"],"rank":57171.0,"normalized_rank":0.7998964643991437,"fraction":6.218646904318311e-8,"cumulative_fraction":0.9996689960230476,"word":"視差","characters":[{"definition":["to look at\/to regard\/to inspect"],"pinyin":["shi4"],"word":"視"},{"definition":["difference\/discrepancy\/to differ\/error\/to err\/to make a mistake","to differ from\/to fall short of\/lacking\/wrong\/inferior\/Taiwan pr. [cha1]","to send\/to commission\/messenger\/mission"],"pinyin":["cha1","cha4","chai1"],"word":"差"}],"containing_words":[],"sentences":[{"english":"Do not forget to keep the subject within the parallax correction mark.","chinese":"別忘了讓被攝主體保持在視差糾正線之內。"},{"english":"The zero parallax setting (ZPS) is also important to the experience.","chinese":"保證零視差的設備的設置也非常重要。"},{"english":"The zero parallax setting is also important to the experience.","chinese":"保證零視差的設備的設置也非常重要。"},{"english":"The concept of parallax measurements of the stars is simple.","chinese":"視差測量恆星的概念很簡單。"},{"english":"Instead we use a technique called \"parallax.","chinese":"相反我們用一種技術叫“視差”。"},{"english":"The invention provides a technique for eliminating vertical parallax of multi-viewpoint stereo image.","chinese":"本發明提出一種消除多視點立體圖像垂直視差的技術。"},{"english":"The parallax barrier is tuned to the horizontal separation between the human eyes.","chinese":"視差屏障被調節爲可在平行方向區別人的兩個眼睛。"},{"english":"Based on stereo disparity, a vision system for locating three-dimensional position is described in the paper.","chinese":"描述了基於雙眼視差原理的三維空間定位系統。"},{"english":"An approach based on disparity space to a binocular visual odometry system is presented.","chinese":"提出了一種基於視差空間的雙目視覺里程計算法。"},{"english":"The time-parallax is a method of close-range photogrammetry.","chinese":"時間視差法是近景攝影測量中的一種方法。"},{"english":"Project with example of how to use the parallax.","chinese":"這是一個如何使用視差動效的示例。"}],"related":[]}