{"definition":["one's own mouth\/fig. in one's own words\/to say sth personally"],"pinyin":["qin1 kou3"],"simplified":["亲口"],"rank":19842.0,"normalized_rank":0.27761532326892674,"fraction":0.000002436804525206234,"cumulative_fraction":0.9744565497573916,"word":"親口","characters":[{"definition":["parent\/one's own (flesh and blood)\/relative\/related\/marriage\/bride\/close\/intimate\/in person\/first-hand\/in favor of\/pro-\/to kiss\/(Internet slang) dear","parents-in-law of one's offspring"],"pinyin":["qin1","qing4"],"word":"親"},{"definition":["mouth\/classifier for things with mouths (people, domestic animals, cannons, wells etc)\/classifier for bites or mouthfuls"],"pinyin":["kou3"],"word":"口"}],"containing_words":[],"sentences":[{"english":"She stays and waits for Ross to return so she can tell him.","chinese":"她留下來等待羅斯返家，並打算親口轉告他。"},{"english":"It's not the end of the world . Not until I say so , anyway.","chinese":"世界末日還沒到，除非是由我親口說的纔算。"},{"english":"We have heard it from his own lips.","chinese":"他親口所說的，我們都親自聽見了。"},{"english":"\"If you had spoken when you ought to have spoken\" I would have agreed.","chinese":"如果你從前好好的親口說破，我會同意的。"},{"english":"We have sent therefore Judas and Silas, who themselves also will, by word of mouth, tell you the same things.","chinese":"我們派猶達和息拉去，他們要親口報告同樣的事。"},{"english":"If you promise that you love me .","chinese":"給我你的愛，承以你親口允諾。"},{"english":"The two found it easier to express feelings in emails than in person.","chinese":"她們倆發現在電子郵件裏比親口說更能表達感受。"},{"english":"You have told me yourself that you were not greedy for the presidency.","chinese":"你曾經親口告訴我你並不貪婪總統的職位。"},{"english":"Tapes of the hearing showed she had verbally pleaded guilty.","chinese":"聆訊錄音顯示她親口認罪。"},{"english":"For the mouth of the Lord has spoken.","chinese":"這是耶和華親口說的。"}],"related":[]}