{"definition":["intimate\/to get close to"],"pinyin":["qin1 jin4"],"simplified":["亲近"],"rank":10771.0,"normalized_rank":0.15070026443552112,"fraction":0.00000731712854645435,"cumulative_fraction":0.9357008150104454,"word":"親近","characters":[{"definition":["parent\/one's own (flesh and blood)\/relative\/related\/marriage\/bride\/close\/intimate\/in person\/first-hand\/in favor of\/pro-\/to kiss\/(Internet slang) dear","parents-in-law of one's offspring"],"pinyin":["qin1","qing4"],"word":"親"},{"definition":["near\/close to\/approximately"],"pinyin":["jin4"],"word":"近"}],"containing_words":[],"sentences":[{"english":"Fulgrim of the Emperor's Children was the closest to horus.","chinese":"帝皇之子的福爾格里姆是最親近何魯斯的人。"},{"english":"The closer they are to me, the mre I like them.","chinese":"愈是跟我親近的人，我愈是喜歡他們。"},{"english":"We need to have a happy medium between being too close and too distant to our friends.","chinese":"對待朋友應在過分親近與過分疏遠中，選擇中庸之道。"},{"english":"Rulers in Beijing are belatedly trying to befriend his enemies.","chinese":"北京的統治者們才亡羊補牢的費心思去親近他的敵人。"},{"english":"In the temple men drew near to God with music and pantomimes (out of this later the theatre developed).","chinese":"在聖殿的裏面，人類企圖親近上帝。"},{"english":"I too loved my closest disciple although we were not beloveds .","chinese":"我也愛著我最親近的門徒，儘管我們不曾是愛人。"},{"english":"The closer relationship between Japan and South Korea will also reinforce the Japan-US alliance.","chinese":"而更親近的日韓關係，也將夯實日美同盟。"},{"english":"Does skin-to-skin contact with their babies have benefits for the parents?","chinese":"和嬰兒親近對孩子父母也有好處麼？"},{"english":"Romantic love is when attraction and closeness are combined.","chinese":"彼此吸引與親近感結合，就產生了愛情。"},{"english":"The Hanna who could cry was closer to me than the Hanna who was only strong.","chinese":"對我來說，會哭的漢娜比只會強硬的漢娜更親近。"},{"english":"You always gently flying in the mountains, is so close, cordial.","chinese":"你總是溫柔地飄舞在山間，是那麼親近，親切。"},{"english":"And Absalom her brother said unto her, Hath Amnon thy brother been with thee?","chinese":"她胞兄押沙龍問她說，莫非你哥哥暗嫩與你親近了嗎。"},{"english":"Most of these ancient towns are far away from the mega-cities and near to the nature and countryside.","chinese":"這些古鎮大部分遠離大城市，親近自然和農村。"},{"english":"They want to be close to thy skin and thy blood.","chinese":"他們想親近你的皮與血。"},{"english":"His two closest nude-curious friends are female, after all.","chinese":"然而，他的兩個親近的好奇裸體好友卻都是女性。"},{"english":"Hess was one of Hitler's closest aides.","chinese":"赫斯曾是希特勒最親近的助手之一。"}],"related":[{"definition":["to be in contact (with sb)\/to associate\/to interact\/to get along (well, poorly)"],"pinyin":["xiang1 chu3"],"word":"相處"},{"definition":["intimate\/close"],"pinyin":["qin1 mi4"],"word":"親密"},{"definition":["to touch\/to contact\/access\/in touch with"],"pinyin":["jie1 chu4"],"word":"接觸"},{"definition":["one's close relatives"],"pinyin":["qin1 ren2"],"word":"親人"},{"definition":["they"],"pinyin":["ta1 men5"],"word":"他們"},{"definition":["this kind of\/so\/this way\/like this\/such"],"pinyin":["zhe4 yang4"],"word":"這樣"},{"definition":["relation\/relationship\/to concern\/to affect\/to have to do with\/guanxi\/CL:個|个[ge4]"],"pinyin":["guan1 xi5"],"word":"關係"},{"definition":["willing (to do sth)\/to take pleasure in"],"pinyin":["le4 yu2"],"word":"樂於"},{"definition":["to be far from\/to keep away from"],"pinyin":["yuan3 li2"],"word":"遠離"},{"definition":["immediately\/at once\/at that moment\/at the moment"],"pinyin":["dang1 xia4"],"word":"當下"},{"definition":["because\/owing to\/on account of"],"pinyin":["yin1 wei4"],"word":"因為"},{"definition":["right\/correct\/couple\/pair\/towards\/at\/for\/to face\/opposite\/to treat (sb a certain way)\/to match together\/to adjust\/to fit\/to suit\/to answer\/to reply\/classifier: couple"],"pinyin":["dui4"],"word":"對"},{"definition":["to know\/to recognize\/to be familiar with\/to get acquainted with sb\/knowledge\/understanding\/awareness\/cognition"],"pinyin":["ren4 shi5"],"word":"認識"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或許"},{"definition":["amiable\/cordial\/close and dear\/familiar"],"pinyin":["qin1 qie4"],"word":"親切"},{"definition":["dialogue\/CL:個|个[ge4]"],"pinyin":["dui4 hua4"],"word":"對話"}]}