{"definition":["personal\/oneself"],"pinyin":["qin1 shen1"],"simplified":["亲身"],"rank":11848.0,"normalized_rank":0.1657688917493319,"fraction":0.000006239229749705841,"cumulative_fraction":0.9429821714474822,"word":"親身","characters":[{"definition":["parent\/one's own (flesh and blood)\/relative\/related\/marriage\/bride\/close\/intimate\/in person\/first-hand\/in favor of\/pro-\/to kiss\/(Internet slang) dear","parents-in-law of one's offspring"],"pinyin":["qin1","qing4"],"word":"親"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"}],"containing_words":[],"sentences":[{"english":"Kenai residents know firsthand the challenges that follow a natural disaster.","chinese":"肯奈居民從親身經驗知道天災之後出現的困難。"},{"english":"A small illustration of this is the experience of Richard Garriott.","chinese":"這副小小的插圖描繪的正是理查德加雷特的親身經歷。"},{"english":"I’d like to cite my own experience as an example.","chinese":"這裏我想拿自己的親身經歷作爲例證。"},{"english":"Every citizen has a right to participate personally, or through his representative, in its foundation.","chinese":"全國公民都有權親身或經由其代表去參與法律的制定。"},{"english":"None but those who have experienced them can conceive of the enticements of science.","chinese":"只有親身經歷的人才能感受到科學的魅力。"},{"english":"If you didn't experience what they report personally, you don't know if it is true or not.","chinese":"只要沒有親身經歷，你便不能分辨這些話的真假。"},{"english":"International students studying in Canada can get valuable work experInternet Explorernce while they are studying.","chinese":"在加的出國生在研究期間能得到寶貴的打工親身經歷。"},{"english":"All application should be made in person or by post, first-come-first-serve.","chinese":"申請人可郵寄或親身報名，先到先得。"},{"english":"Aunt Sally was to find a cook, a lot, she signed up to personal interview.","chinese":"萊莉姑姑要找個廚師，良多人應徵，她要親身面試。"},{"english":"According to my manal experience, smile get finiherd me a lot of bad.","chinese":"根據我一自己親身歷程，微笑已帶給我許多好處。"},{"english":"You should not know the joys and sorrows without experienced yourself.","chinese":"若非親身經歷，豈知其中甘苦。"},{"english":"Be sure to tell us whether you think it is accurate from your own experiences.","chinese":"別忘了以你的親身經驗告訴我們它是否準確。"},{"english":"Please return this form to any Fubon branch in person if Primary Account is a Credit Card account.","chinese":"若基本戶口是信用卡，請把表格親身交回本行。"},{"english":"I have experienced this transformation of your country in a highly personal way.","chinese":"我個人親身體驗了貴國的這一鉅變。"},{"english":"A witness appearing in court to give evidence shall impersonally state the facts apperceived by himself.","chinese":"出庭作證的證人應當客觀陳述其親身感知的事實。"},{"english":"Residents of participating estates can enjoy a first-time trial service to get personal experience of the benefits of massage.","chinese":"屋苑住客特享初次試做服務，親身體驗服務箇中好處。"}],"related":[{"definition":["to experience for oneself"],"pinyin":["ti3 yan4"],"word":"體驗"},{"definition":["close range"],"pinyin":["jin4 ju4 li2"],"word":"近距離"},{"definition":["to look around\/to tour\/to visit"],"pinyin":["can1 guan1"],"word":"參觀"},{"definition":["to know from experience\/to learn through experience\/to realize\/understanding\/experience"],"pinyin":["ti3 hui4"],"word":"體會"},{"definition":["to go in person"],"pinyin":["qin1 lin2"],"word":"親臨"},{"definition":["to try\/to attempt\/CL:次[ci4]"],"pinyin":["chang2 shi4"],"word":"嘗試"},{"definition":["to participate (in sth)"],"pinyin":["can1 yu4"],"word":"參與"},{"definition":["experience\/to experience"],"pinyin":["jing1 yan4"],"word":"經驗"},{"definition":["to appreciate\/to enjoy\/to admire"],"pinyin":["xin1 shang3"],"word":"欣賞"},{"definition":["on-site"],"pinyin":["shi2 di4"],"word":"實地"},{"definition":["the scene (of a crime, accident etc)\/(on) the spot\/(at) the site"],"pinyin":["xian4 chang3"],"word":"現場"},{"definition":["to have a taste of\/to realize\/to appreciate"],"pinyin":["ling3 lu:e4"],"word":"領略"},{"definition":["to watch\/to view"],"pinyin":["guan1 kan4"],"word":"觀看"},{"definition":["to guide\/to lead"],"pinyin":["dai4 ling3"],"word":"帶領"},{"definition":["local"],"pinyin":["dang1 di4"],"word":"當地"},{"definition":["to listen (respectfully)"],"pinyin":["ling2 ting1"],"word":"聆聽"}]}