{"definition":["to come to understand\/to realize\/consciousness\/awareness\/Buddhist enlightenment (Sanskrit: cittotpāda)"],"pinyin":["jue2 wu4"],"simplified":["觉悟"],"rank":19936.0,"normalized_rank":0.2789305052257496,"fraction":0.0000024100906194905,"cumulative_fraction":0.974684377623546,"word":"覺悟","characters":[{"definition":["a nap\/a sleep\/CL:場|场[chang2]","to feel\/to find that\/thinking\/awake\/aware"],"pinyin":["jiao4","jue2"],"word":"覺"},{"definition":["to comprehend\/to apprehend\/to become aware"],"pinyin":["wu4"],"word":"悟"}],"containing_words":[],"sentences":[{"english":"With the benefit of hindsight, what different steps would you have taken?","chinese":"有事後覺悟的幫助，你會採取哪些不同的步驟呢？"},{"english":"This will raise their awareness of words.","chinese":"這樣可以提升他們對單詞的覺悟。"},{"english":"The people of our country have a high level of political consciousness.","chinese":"我們國家的人民是有高度的政治覺悟的人民。"},{"english":"That slogan is simply a call for conscious reflection on national unity.","chinese":"這一口號僅僅是號召人民提高民族團結的覺悟。"},{"english":"We hope she'll come to her senses and correct her mistakes.","chinese":"我們希望她能覺悟過來，改正錯誤。"},{"english":"Aterm used to describe the level of knowledge and consciousness that thepublic has regarding the environment, environmental issues, etc.","chinese":"公衆所具備的有關環境及環境問題的覺悟水平。"},{"english":"He has published five individual albums like the \"Consciousness and Confirmation\".","chinese":"出版有《覺悟與印證》等個人畫集五部。"},{"english":"It cannot be cut off or destroyed, right up to the attainment of Buddhahood.","chinese":"它不能被去除或破壞，正好獲得佛境界的覺悟。"},{"english":"They belonged to the Chan school of Buddhism, the basis of whose creed was abstract meditation.","chinese":"他們都屬於佛教禪院，其教義的實質是透徹覺悟。"},{"english":"The class consciousness of the workers make them unite in the struggle.","chinese":"工人們的階級覺悟使他們在鬥爭中團結起來。"},{"english":"The Buddha only teaches Nyana and Jhana that give rise to the divine eye and the divine ear.","chinese":"佛陀只教導能獲得聖眼及聖耳的覺悟及禪定之法。"},{"english":"This is the heightened state of awareness we hope to communicate.","chinese":"這是我們希望傳達的更高境界的覺悟。"},{"english":"Since unknowingly being suddenly in this study to be a trend of consciousness, which is Shijue.","chinese":"在這不覺之中忽然起了一念要趨向覺悟，這是始覺。"},{"english":"Is it true that my lips are candied like the aperture bud of the aboriginal acquainted love?","chinese":"我的脣兒，是真像覺悟的初戀的蓓蕾那樣香甜麼？"},{"english":"Jamie a consciousness to find SaiLin not in my side.","chinese":"傑米一覺悟來，發現賽琳不在本人的身邊。"},{"english":"Consciousness naturally see the sky, people empty the which things?","chinese":"覺悟人生性空見，長天萬里哪東西？"}],"related":[{"definition":["to understand\/to comprehend"],"pinyin":["ling3 wu4"],"word":"領悟"},{"definition":["to become enlightened (Buddhism)"],"pinyin":["kai1 wu4"],"word":"開悟"},{"definition":["conscious\/aware\/on one's own initiative\/conscientious"],"pinyin":["zi4 jue2"],"word":"自覺"},{"definition":["(of Taoists) to practice austerities\/to practice asceticism"],"pinyin":["xiu1 lian4"],"word":"修煉"},{"definition":["to know\/knowledge\/Taiwan pr. [shi4]","to record\/to write a footnote"],"pinyin":["shi2","zhi4"],"word":"識"},{"definition":["to experience\/to realize\/to comprehend"],"pinyin":["ti3 wu4"],"word":"體悟"},{"definition":["accomplishment\/training\/self-cultivation"],"pinyin":["xiu1 yang3"],"word":"修養"},{"definition":["to awaken\/to come to realize\/awakened to the truth\/the truth dawns upon one\/scales fall from the eyes\/to become aware"],"pinyin":["jue2 xing3"],"word":"覺醒"},{"definition":["to sense\/to perceive\/to come to realize\/to be aware"],"pinyin":["jue2 cha2"],"word":"覺察"},{"definition":["chance\/opportunity\/predestined relationship\/(Buddhist) principal and secondary causes\/chain of cause and effect"],"pinyin":["yin1 yuan2"],"word":"因緣"},{"definition":["a flash of realization\/the truth in a flash\/a moment of enlightenment (usually Buddhist)"],"pinyin":["dun4 wu4"],"word":"頓悟"},{"definition":["learning\/knowledge\/CL:個|个[ge4]"],"pinyin":["xue2 wen4"],"word":"學問"},{"definition":["attitude (of the heart)\/state of one's psyche\/way of thinking\/mentality"],"pinyin":["xin1 tai4"],"word":"心態"},{"definition":["anatta (Buddhist concept of \"non-self\")"],"pinyin":["wu2 wo3"],"word":"無我"},{"definition":["cognition\/cognitive\/understanding\/perception\/awareness\/to be cognizant of\/to recognize\/to realize"],"pinyin":["ren4 zhi1"],"word":"認知"},{"definition":["so-called\/what is called"],"pinyin":["suo3 wei4"],"word":"所謂"}]}