{"definition":["to decompress\/decompression (esp. computer)"],"pinyin":["jie3 ya1 suo1"],"simplified":["解压缩"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"解壓縮","characters":[{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","surname Xie","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","to transport under guard"],"pinyin":["Xie4","jie3","jie4","xie4"],"word":"解"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"},{"definition":["to withdraw\/to pull back\/to contract\/to shrink\/to reduce\/abbreviation\/also pr. [su4]"],"pinyin":["suo1"],"word":"縮"}],"containing_words":[],"sentences":[{"english":"The need to decompress before we can see.","chinese":"這個需要解壓縮纔可以看到。"},{"english":"Deploy a bus service and a decompression filter for the Bus off-ramp.","chinese":"爲總線出站部署一個總線服務和一個解壓縮過濾器。"},{"english":"Verify that the files were unpackaged after downloading.","chinese":"驗證文件在下載後是否被解壓縮。"},{"english":"Unable to unpack update package.","chinese":"無法解壓縮更新軟件包。"},{"english":"Follow these steps to download, unzip and install to TRAINZ .","chinese":"按下列步驟下載，解壓縮後完整裝入TRAINZ。"},{"english":"The files are automatically decompressed after being downloaded.","chinese":"文件在下載完成之後會自動解壓縮。"},{"english":"Extract that file to your plugins directory, as well.","chinese":"將該文件也解壓縮到插件目錄中。"},{"english":"Specifically, download the source code archive and extract it to a directory of your choice.","chinese":"下載源代碼壓縮包，並將其解壓縮到任意目錄。"},{"english":"Installation only takes unzipping an archive.","chinese":"安裝只需要解壓縮的存檔。"},{"english":"Occasionally, you'll run into a downloaded file which needs to be decompressed or un-zipped before installation.","chinese":"有時候，你會碰到需要在安裝前先解壓縮的下載文件。"},{"english":"Once you have downloaded this file, extract its contents.","chinese":"下載這個文件之後，對其進行解壓縮。"},{"english":"Undeploy the bus service and decompression filter for the Bus off-ramp.","chinese":"取消爲總線出站部署的總線服務和解壓縮過濾器。"},{"english":"Unzip Newer Unzips files based on last-modification time.","chinese":"解壓縮文件解壓縮較新的基礎上最後修改時間。"},{"english":"I recently wrote an LZW compression and decompression procedures.","chinese":"我最近寫的一個LZW的壓縮與解壓縮程序。"},{"english":"D8 The Runtime module is uncompressed into memory.","chinese":"刷新模塊解壓縮到內存中。"},{"english":"Decompression routine needs some free space to use as a temporary buffer following the kernel image in RAM.","chinese":"是壓縮過得，而解壓縮函數需要一些空間作爲緩衝器。"}],"related":[]}