{"definition":["after liberation (i.e. after the Communist's victory)\/after the establishment of PRC in 1949"],"pinyin":["jie3 fang4 hou4"],"simplified":["解放后"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"解放後","characters":[{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","surname Xie","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","to transport under guard"],"pinyin":["Xie4","jie3","jie4","xie4"],"word":"解"},{"definition":["to put\/to place\/to release\/to free\/to let go\/to let out\/to set off (fireworks)"],"pinyin":["fang4"],"word":"放"},{"definition":["back\/behind\/rear\/afterwards\/after\/later\/post-"],"pinyin":["hou4"],"word":"後"}],"containing_words":[],"sentences":[{"english":"Emancipation Park was originally a rich garden reverted to the government after the liberation.","chinese":"解放公園原是一處富家大花園，解放後收歸政府所有。"},{"english":"After liberation , great changes have taken place in the small town .","chinese":"解放後，小鎮發生了巨大的變化。"},{"english":"After the liberation of the so-called pharmaceutical companies is also a workshop.","chinese":"解放後所謂的中藥廠其實也是一個作坊。"},{"english":"We came off relief grain shortly after liberation.","chinese":"解放後不久，我們就不喫救濟糧了。"},{"english":"After the liberation, shenyang Tan Jie as a district party committee secretary of the position.","chinese":"瀋陽解放後，譚捷擔任區委書記一職。"},{"english":"After the liberation of Li Luo Huai died, his son diverted, the industry has no mass.","chinese":"解放後李洛懷過世，其子改行，其業遂不傳。"},{"english":"My father lived in Shanghai after liberation .","chinese":"解放後我父親住在上海。"},{"english":"After the liberation of all three provincial supply and use.","chinese":"解放後三家祠堂都爲供銷社使用。"},{"english":"After liberation highways were built into the mountains.","chinese":"解放後公路一直修進了山裏。"},{"english":"He was named director of the plant after liberation .","chinese":"解放後，他被任命爲這個廠的廠長。"},{"english":"He didn't return to his hometown until after liberation.","chinese":"他是解放後纔回到他家鄉的。"},{"english":"After Liberation the land issue in the old revolutionary base area of western Fujian was particularly pressing.","chinese":"全國解放後，閩西老革命根據地的土地問題特別突出。"},{"english":"In the newly liberated Peking he married his wife Jean.","chinese":"北京解放後不久，他在那裏與瓊結爲夫婦。"},{"english":"Agriculture in this country has developed greatly after liberation .","chinese":"解放後這個國家的農業得到了巨大的發展。"},{"english":"This situation has to be changed after the liberation.","chinese":"這樣的局面一直到解放後纔有所改變。"},{"english":"After Naboo was liberated, Bibble attended the parade celebrating the newfound freedom.","chinese":"納布解放後，比布爾參加了慶祝重獲自由的遊行。"}],"related":[]}