{"definition":["talent\/ability\/capability\/martial arts technique\/Taiwan pr. [jie3 shu4]"],"pinyin":["xie4 shu4"],"simplified":["解数"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"解數","characters":[{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","surname Xie","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","to transport under guard"],"pinyin":["Xie4","jie3","jie4","xie4"],"word":"解"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[{"definition":["to give it your all\/to go at it with all you've got\/to throw your whole weight behind it\/also pr. [hun2 shen1 jie3 shu4]"],"pinyin":["hun2 shen1 xie4 shu4"],"word":"渾身解數"}],"sentences":[{"english":"This paper has investigated the system of congruences and given them the asymptotic formula of the number of solutions.","chinese":"給出了一類同餘方程組解數的公式或漸近公式。"},{"english":"He is a cheeper apparently, I make him purposely happy, exert all over skill.","chinese":"他明顯是個雛，我有心讓他快樂，使出了渾身解數。"},{"english":"It was a wake-up call for Milan who began to take the game seriously and utilise all their assets.","chinese":"米蘭方纔如夢初醒，認真對待比賽，使出渾身解數。"},{"english":"A: Did you see him fall all over himself making excuses?","chinese":"看到他使出渾身解數爲自己找藉口了嗎？"},{"english":"To figure out where disease-prevention dollars would be best spent, the scientists crunched the numbers.","chinese":"爲了弄清楚疾病預防的支出，科學家們使盡渾身解數。"},{"english":"The actress emoted for all she was worth.","chinese":"女演員施展渾身解數來表演。"}],"related":[]}