{"definition":["to relieve fever"],"pinyin":["jie3 re4"],"simplified":["解热"],"rank":38250.0,"normalized_rank":0.5351671260475984,"fraction":4.536984642868853e-7,"cumulative_fraction":0.9957576311990816,"word":"解熱","characters":[{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","surname Xie","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","to transport under guard"],"pinyin":["Xie4","jie3","jie4","xie4"],"word":"解"},{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"熱"}],"containing_words":[],"sentences":[{"english":"Objective Establish the quality standards for Jiere Xiaoyan Capsule.","chinese":"目的提高解熱消炎膠囊的質量標準。"},{"english":"Refrigeration by means of negative heat of dissolution of inorganic salts is a low consumption cooling method.","chinese":"採用無機鹽的負溶解熱製冷是一種低能耗的製冷方法。"},{"english":"Non-aspirin fever reducers can be used to reduce a fever.","chinese":"不含阿斯匹林的解熱藥可以用來退燒。"},{"english":"Objective To compare the effects of powders with different diameters of schizonepeta on anti-pyretic and analgesic effects.","chinese":"目的荊芥不同粒徑粉體的解熱鎮痛作用的比較研究。"},{"english":"The measurement in heat of fusion of ice is one of experiments in thermodynamics done in many universities.","chinese":"冰的熔解熱的測量是許多高校所開設的熱學實驗之一。"},{"english":"Gurcke has antipyretic, analgesic and anti- inflammatory effects.","chinese":"提示賽葵具有解熱鎮痛抗炎作用。"},{"english":"OBJECTIVE To observe the anti - infection and anti - pyretic effect in vivo of Minor Decoction of Bupleurum ( Xiaochaihu Tang ) .","chinese":"目的觀察中藥製劑小柴胡湯體內抗感染及解熱作用。"},{"english":"Objective:To Observe the febrifuge effect of antivirus capsule.","chinese":"目的觀察安替威膠囊的解熱作用。"},{"english":"Don't drink alcohol or beverage with alcohol while taking analgesics and antipyretics .","chinese":"服用解熱鎮痛工時，不能同時飲酒或含有酒精的飲料。"},{"english":"Refreshing antipyretic drugs, consumption of a variety mungbean porridge.","chinese":"消暑解熱毒，常飲綠豆粥。"},{"english":"This seasonal food wants can disappear heat solution is hot, diuresis detumescence .","chinese":"這個季節的食物要能消暑解熱，利尿消腫。"},{"english":"Objective To investigate the antipyretic mechanism of Naoreqing oral solution (NOS).","chinese":"目的探討腦熱清口服液的解熱機制。"},{"english":"Objective To research the mechanism of aqueous extract of Radix Scutellariae in relieving fever of model rats.","chinese":"目的探討黃芩水提物對乾酵母致熱大鼠解熱作用機制。"},{"english":"Objective To investigate the anti inflammatory and antipyretic effects of Huanggui enema.","chinese":"目的研究黃桂灌腸劑的抗炎與解熱鎮痛作用。"},{"english":"These products are used for pain, fever, colds and sleeplessness","chinese":"這些藥用於止痛，解熱，感冒和失眠。"},{"english":"So the rational prescription of it is important, especially in children.","chinese":"對於嬰兒這一特殊羣體，解熱藥的合理使用非常重要。"}],"related":[{"definition":["cough suppressant"],"pinyin":["zhen4 ke2"],"word":"鎮咳"},{"definition":["to alleviate fever (medicine)\/to clear internal heat (Chinese medicine)"],"pinyin":["qing1 re4"],"word":"清熱"},{"definition":["to reduce the pressure (of a fluid)\/to lower one's blood pressure\/to lower (or step down) the voltage"],"pinyin":["jiang4 ya1"],"word":"降壓"},{"definition":["to relieve (cold, rheumatic pain etc)\/lit. to dispel pathogenic wind (TCM)"],"pinyin":["qu1 feng1"],"word":"祛風"},{"definition":["to moisten the lungs\/to make expectoration easy (medicine)"],"pinyin":["run4 fei4"],"word":"潤肺"},{"definition":["analgesic\/pain killer"],"pinyin":["zhen4 tong4"],"word":"鎮痛"},{"definition":["to cure constipation with laxatives"],"pinyin":["run4 chang2 tong1 bian4"],"word":"潤腸通便"},{"definition":["sore\/skin ulcer"],"pinyin":["chuang1 yang2"],"word":"瘡瘍"},{"definition":["to reduce fever"],"pinyin":["tui4 re4"],"word":"退熱"},{"definition":["to course the liver and rectify 氣|气[qi4] (TCM)"],"pinyin":["shu1 gan1 li3 qi4"],"word":"疏肝理氣"},{"definition":["bacillary dysentery"],"pinyin":["xi4 jun1 xing4 li4 ji2"],"word":"細菌性痢疾"},{"definition":["mouth ulcer"],"pinyin":["kou3 chuang1"],"word":"口瘡"},{"definition":["to warm oneself\/to expel the cold (TCM)"],"pinyin":["qu1 han2"],"word":"驅寒"},{"definition":["tonsillitis"],"pinyin":["bian3 tao2 ti3 yan2"],"word":"扁桃體炎"},{"definition":["to ease constipation (TCM)"],"pinyin":["run4 chang2"],"word":"潤腸"},{"definition":["to reduce swelling\/detumescence\/(fig.) to streamline (a bloated bureaucracy etc)"],"pinyin":["xiao1 zhong3"],"word":"消腫"}]}