{"definition":["to remove armor and return to the farm\/to return to civilian life"],"pinyin":["jie3 jia3 gui1 tian2"],"simplified":["解甲归田"],"rank":51567.0,"normalized_rank":0.7214892336966406,"fraction":1.2145338554912756e-7,"cumulative_fraction":0.9991675455034374,"word":"解甲歸田","characters":[{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","surname Xie","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","to transport under guard"],"pinyin":["Xie4","jie3","jie4","xie4"],"word":"解"},{"definition":["first of the ten Heavenly Stems 十天干[shi2 tian1 gan1]\/(used for an unspecified person or thing)\/first (in a list, as a party to a contract etc)\/letter \"A\" or roman \"I\" in list \"A, B, C\", or \"I, II, III\" etc\/armor plating\/shell or carapace\/(of the fingers or toes) nail\/bladed leather or metal armor (old)\/ranking system used in the Imperial examinations (old)\/civil administration unit in the baojia 保甲[bao3 jia3] system (old)\/ancient Chinese compass point: 75°"],"pinyin":["jia3"],"word":"甲"},{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"歸"},{"definition":["field\/farm\/CL:片[pian4]","surname Tian"],"pinyin":["Tian2","tian2"],"word":"田"}],"containing_words":[],"sentences":[{"english":"Washington longed to retire to his fields at Mount Vernon.","chinese":"華盛頓希望能夠解甲歸田，在弗農山莊安享晚年。"},{"english":"They retired to lead quiet lives in the country.","chinese":"於是他們解甲歸田，過起了平靜的生活。"}],"related":[]}