{"definition":["to untie\/to free\/to absolve of\/to get free of\/to extirpate oneself\/(Buddhism) to free oneself of worldly worries"],"pinyin":["jie3 tuo1"],"simplified":["解脱"],"rank":13581.0,"normalized_rank":0.1900158101660767,"fraction":0.000004936817362843684,"cumulative_fraction":0.952628115234029,"word":"解脫","characters":[{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","surname Xie","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","to transport under guard"],"pinyin":["Xie4","jie3","jie4","xie4"],"word":"解"},{"definition":["to shed\/to take off\/to escape\/to get away from"],"pinyin":["tuo1"],"word":"脫"}],"containing_words":[],"sentences":[{"english":"She freed herself of worry.","chinese":"她使自己從煩惱中解脫出來。"},{"english":"Disentangle the person's feet from the wreckage and bring the feet foward to exit.","chinese":"將傷者的腳從殘骸中解脫出來，並移至靠近出口處。"},{"english":"Nirvana brings the joy of liberation.","chinese":"寂滅離苦解脫樂。"},{"english":"Absence from those we love is self from self a deadly banishment.","chinese":"脫離情人就是自我解脫，極度地放縱。"},{"english":"Liberation and awakened understanding can’t be found by devoting ourselves to the study of the Buddhist scriptures.","chinese":"解脫和覺醒無法從鑽研佛經中獲得。"},{"english":"He cut desperately at the rope in an attempt to free his foot.","chinese":"他拼命砍繩子，試圖把自己的腳解脫開。"},{"english":"Maharaj: What do you mean by realisation and liberation?","chinese":"你所說的開悟和解脫是什麼意思？"},{"english":"We want you to begin reaching for that ensuing sense of relief.","chinese":"我們希望你能夠體會得到那種解脫後的輕鬆感。"},{"english":"Soldiers would find that a welcome relief.","chinese":"士兵們會發現他們從笨重的防護服中終得解脫。"},{"english":"But now, I can see that this is liberating.","chinese":"但是現在，我開始懂了，這是一種解脫。"},{"english":"Advocating free soul, Yebao such as reincarnation and non-violence.","chinese":"主張靈魂解脫，業報輪迴和非暴力等。"},{"english":"Chapter III is about the freedom from the material pressure.","chinese":"第三章從物質環境壓力的解脫談起。"},{"english":"In one of right knowledge, right release comes into being.","chinese":"有正智的人，正解脫產生。"},{"english":"Perhaps he knew that, own iscaught instead is in kind of spiritual extricating.","chinese":"或許他知道，自己的落網反而是種精神上的解脫。"},{"english":"As your birthday month gets under way, you’ll feel a great sense of relief.","chinese":"隨着蠍子們誕辰月的啓動，你會感到一種解脫。"},{"english":"You have to get up and take breaks from sitting.","chinese":"帕特說“你需要站起來從久坐中解脫出來。”"}],"related":[{"definition":["to be worried\/to be distressed\/worries"],"pinyin":["fan2 nao3"],"word":"煩惱"},{"definition":["all living things"],"pinyin":["zhong4 sheng1"],"word":"眾生"},{"definition":["to despair\/to give up all hope\/desperate\/desperation"],"pinyin":["jue2 wang4"],"word":"絕望"},{"definition":["to release (tension)\/relief (from suspense)\/to dispel (usu. with negative, unable to forget)"],"pinyin":["shi4 huai2"],"word":"釋懷"},{"definition":["actual situation\/the ultimate essence of things (Buddhism)"],"pinyin":["shi2 xiang4"],"word":"實相"},{"definition":["to reincarnate\/reincarnation (Buddhism)\/(of the seasons etc) to follow each other cyclically\/cycle\/CL:個|个[ge4]"],"pinyin":["lun2 hui2"],"word":"輪迴"},{"definition":["used for 師傅|师傅 (in Taiwan)\/master\/qualified worker"],"pinyin":["shi1 fu5"],"word":"師父"},{"definition":["gate to enlightment (Buddhism)\/Buddhism\/way\/method\/(old) south gate of a palace"],"pinyin":["fa3 men2"],"word":"法門"},{"definition":["to confess\/to repent\/remorse\/repentance\/penitent\/confession (Buddhism)"],"pinyin":["chan4 hui3"],"word":"懺悔"},{"definition":["to come to understand\/to realize\/consciousness\/awareness\/Buddhist enlightenment (Sanskrit: cittotpāda)"],"pinyin":["jue2 wu4"],"word":"覺悟"},{"definition":["to separate"],"pinyin":["fen1 li2"],"word":"分離"},{"definition":["vexed\/distressed"],"pinyin":["ku3 nao3"],"word":"苦惱"},{"definition":["to be frightened\/fear\/dread"],"pinyin":["kong3 ju4"],"word":"恐懼"},{"definition":["pain (from wound)\/sorrow"],"pinyin":["shang1 tong4"],"word":"傷痛"},{"definition":["to separate oneself from\/to break away from\/diastasis (medicine)\/abscission\/abjunction (botany)"],"pinyin":["tuo1 li2"],"word":"脫離"},{"definition":["happy\/joyous\/delighted\/to like\/to be fond of"],"pinyin":["huan1 xi3"],"word":"歡喜"}]}