{"definition":["to violate\/to offend"],"pinyin":["chu4 fan4"],"simplified":["触犯"],"rank":12817.0,"normalized_rank":0.17932645894253774,"fraction":0.0000054754748059642135,"cumulative_fraction":0.9486523171993668,"word":"觸犯","characters":[{"definition":["to touch\/to make contact with sth\/to stir up sb's emotions"],"pinyin":["chu4"],"word":"觸"},{"definition":["to violate\/to offend\/to assault\/criminal\/crime\/to make a mistake\/recurrence (of mistake or sth bad)"],"pinyin":["fan4"],"word":"犯"}],"containing_words":[],"sentences":[{"english":"Instead of punishing a child for violating a school policy, they battle the policy.","chinese":"不因爲觸犯了學校的紀律懲罰孩子，而是攻擊校規。"},{"english":"Any one who breaks the law should be punished.","chinese":"任何觸犯法律的人都應受到懲罰。"},{"english":"They are an appropriate venue for trying detainees for violations of the laws of war.","chinese":"軍事委員會是審理觸犯戰爭法的在押人員的合適場所。"},{"english":"the offensive offender defended himself with the fence.","chinese":"那個厭惡的觸犯者用竹籬自衛。"},{"english":"He was arrested on a charge of having infringed the Election Law.","chinese":"他因被指控觸犯選舉法而被拘捕。"},{"english":"The Delegate-General for National Security emphasized that it was a violation of Cameroonian law.","chinese":"國家安全總代表強調說這是對喀麥隆法律的觸犯。"},{"english":"Yemeni interest in the star-crossed lovers touches on geopolitics, too.","chinese":"也門人對跨越界限又觸犯地緣政治的戀人也很感興趣。"},{"english":"The old chancellor who had offended against the emperor was relegated to the distant boundaries of the country.","chinese":"觸犯了皇帝的老宰相被流放到遙遠的邊疆。"},{"english":"Vick fell foul of a Federal ban on dogfighting.","chinese":"維克觸犯了關於不允許鬥狗的一條聯邦禁令。"},{"english":"Offenders are liable to fines of up to 100.","chinese":"觸犯者可予罰款達100英鎊。"},{"english":"A publicized incident that brings about disgrace or offends the moral sensibilities of society","chinese":"醜聞帶來不光彩或觸犯社會道德標準的公開事件。"},{"english":"Lit. Unless you offend the Government, you can do anything in China.","chinese":"中國你想可以做嘢，除非觸犯政府。"},{"english":"He violated criminal law in two car smuggling cases, constituting smuggling.","chinese":"他在兩起汽車走私案中觸犯刑律，構成走私罪。"},{"english":"You could easily break one of our laws and not know it.","chinese":"你非常容易在不知情的情況下觸犯法律。"},{"english":"To enter was to breach the protocols of a club privée.","chinese":"進入博物館彷彿觸犯了俱樂部的清規。"},{"english":"They did not abide by the customs laws in any way.","chinese":"從各方面來看，他們都是在觸犯海關法律。"}],"related":[]}