{"definition":["flip-flop (electronics)"],"pinyin":["chu4 fa1 qi4"],"simplified":["触发器"],"rank":54317.0,"normalized_rank":0.7599653015824157,"fraction":8.84624418783309e-8,"cumulative_fraction":0.9994552761646384,"word":"觸發器","characters":[{"definition":["to touch\/to make contact with sth\/to stir up sb's emotions"],"pinyin":["chu4"],"word":"觸"},{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[],"sentences":[{"english":"Tokens can be created by a time trigger, which is the default.","chinese":"令牌可由時間觸發器創建，這是缺省設置。"},{"english":"The application of this type of double-edge-triggered flip-flop in seq…","chinese":"文章還介紹了該雙邊沿觸發器在時序電路中的應用。"},{"english":"Peeing was my trigger and drinking coffee was my habit.","chinese":"如廁就是一個觸發器，而喝咖啡就是我的習慣了。"},{"english":"The trigger, once pressed, dispatches a custom event.","chinese":"觸發器被觸發之後，就會分派一個定製的事件。"},{"english":"Quad 2-input NAND gate with schmitt trigger inputs.","chinese":"四2輸入與非門施密特觸發器輸入。"},{"english":"Such avalanches may also be what triggers lightning.","chinese":"觸發器閃光可能就是發生了這種電子雪崩。"},{"english":"The design principle of monostable flip flops is investigated in this paper.","chinese":"本文對單穩態觸發器的設計原理進行了研究。"},{"english":"Radiation-hardened octal D-flip-flop with clear.","chinese":"抗輻射具有明確的八進制D型觸發器。"},{"english":"The replication can also be trigger on an as-needed basis using the synchronization strategies.","chinese":"這個複製也可以是採用同步策略的隨需觸發器。"},{"english":"The trigger monitor waits for another trigger message.","chinese":"觸發器監控器等待另一個觸發消息。"},{"english":"Lightning triggers go off when there’s any change in light source.","chinese":"閃電觸發器在光源有變化時會自動閃滅。"},{"english":"The ability to define the trigger text in the multi-line smart editor.","chinese":"能夠在多行智能編輯器中定義觸發器文本。"},{"english":"Some features left out are complete trigger support and writable views.","chinese":"不受支持的一些功能包括完全觸發器支持和可寫視圖。"},{"english":"Do not use control flow to model events and triggers in a process model.","chinese":"不要使用控制流爲流程模型中的事件和觸發器建模。"},{"english":"The delete trigger does not depend on the coordinate values, so nothing changes there.","chinese":"刪除觸發器不依賴於座標值，所以這裏不需要修改。"},{"english":"The process object tells the trigger monitor what command to execute.","chinese":"進程對象告知觸發器監控器將要執行的命令。"}],"related":[]}