{"definition":["information\/news\/message\/text message or SMS"],"pinyin":["xun4 xi1"],"simplified":["讯息"],"rank":15165.0,"normalized_rank":0.21217802526828314,"fraction":0.000004071024057925564,"cumulative_fraction":0.9597109777170734,"word":"訊息","characters":[{"definition":["to question\/to ask\/to interrogate\/rapid\/speedy\/fast\/news\/information"],"pinyin":["xun4"],"word":"訊"},{"definition":["breath\/news\/interest (on an investment or loan)\/to cease\/to stop\/to rest\/Taiwan pr. [xi2]"],"pinyin":["xi1"],"word":"息"}],"containing_words":[{"definition":["information source"],"pinyin":["xun4 xi1 yuan2"],"word":"訊息原"}],"sentences":[{"english":"Do not clutter up the page with so many illustrations that you obscure the message.","chinese":"不要在一頁內放置過多的插圖，那樣會模糊訊息。"},{"english":"The sending application specifies response queues when the application sends its messages.","chinese":"傳回至迴應佇列的訊息是應用程式指定的。"},{"english":"MissionThe mission of the EV Ministry is to spread the good news of Jesus Christ.","chinese":"福傳委員會的使命是要傳揚主耶穌基督救恩的好訊息。"},{"english":"A message from %1 was dropped, because it contained a blacklisted word.","chinese":"送來的訊息已被丟棄，因爲包含被擋掉的字眼。"},{"english":"This message is often overlooked while people bash other sins that are not as common.","chinese":"儘管人們往往忽視這個訊息打壞，不像其他罪常見。"},{"english":"But its action conveys a powerful message.","chinese":"是次行動帶出強而有力的訊息。"},{"english":"Sometimes you just need to improve the wording of an error message.","chinese":"有時候只要改良某個錯誤訊息的用字。"},{"english":"In the end, however, they recovered only 43 messages.","chinese":"不過，最後他們也只是找回了43條訊息。"},{"english":"Okay, I am very glad to be here and I am ready to transcribe this message.","chinese":"對，我很高興我在這兒，我已準備好轉錄訊息。"},{"english":"It was their farewell message as they signed off. Stay Hungry. Stay Foolish. And I've always wished that for myself.","chinese":"那是他們親筆寫下的告別訊息，我總是以此自許。"},{"english":"In communications, a series of codes to denote the end of a message.","chinese":"你也能選擇在訊息的末端添加一個簽名檔。"},{"english":"What if an ad coes in at exactly the same time as a chat ?","chinese":"那如果廣告作爲一個新的聊天訊息出場的話呢？"},{"english":"Instead, such devices usually show only a device-specific error message, or the error code.","chinese":"此類裝置通常只顯示裝置的特定錯誤訊息或錯誤碼。"},{"english":"How to get the information of China Queer Film Festival Tour?","chinese":"如何獲得中國酷兒影像巡迴展的展映訊息？"},{"english":"A middle click always opens this message.","chinese":"滑鼠中鍵用於開啓此訊息。"},{"english":"So we still get our message out through the Web.","chinese":"因此，我們還是通過網絡傳播我們的訊息。"}],"related":[{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有關"},{"definition":["to respond\/response"],"pinyin":["hui2 ying4"],"word":"回應"},{"definition":["information"],"pinyin":["zi1 xun4"],"word":"資訊"},{"definition":["to get in touch with\/to contact\/to stay in contact (with)\/liaison\/(math.) connection"],"pinyin":["lian2 luo4"],"word":"聯絡"},{"definition":["to pass through\/to penetrate\/by means of\/via"],"pinyin":["tou4 guo4"],"word":"透過"},{"definition":["material\/resources\/data\/information\/profile (Internet)\/CL:份[fen4],個|个[ge4]"],"pinyin":["zi1 liao4"],"word":"資料"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["to pass on\/to convey\/to relay\/to transmit\/transmission"],"pinyin":["chuan2 da2"],"word":"傳達"},{"definition":["Internet","network (computing, telecommunications, transport etc)"],"pinyin":["Wang3 luo4","wang3 luo4"],"word":"網絡"},{"definition":["to transmit\/to pass on to sb else\/(math.) transitive"],"pinyin":["chuan2 di4"],"word":"傳遞"},{"definition":["to show\/to illustrate\/to display\/to demonstrate"],"pinyin":["xian3 shi4"],"word":"顯示"},{"definition":["auxiliary verb introducing future action: may (be able to)\/will (cause)\/should (enable)\/going to"],"pinyin":["jiang1 hui4"],"word":"將會"},{"definition":["signal"],"pinyin":["xun4 hao4"],"word":"訊號"},{"definition":["content\/substance\/details\/CL:個|个[ge4],項|项[xiang4]"],"pinyin":["nei4 rong2"],"word":"內容"},{"definition":["connection\/contact\/relation\/to get in touch with\/to integrate\/to link\/to touch"],"pinyin":["lian2 xi4"],"word":"聯繫"},{"definition":["movement\/motion\/development\/trend\/dynamic (science)"],"pinyin":["dong4 tai4"],"word":"動態"}]}