{"definition":["can't remember"],"pinyin":["ji4 bu5 zhu4"],"simplified":["记不住"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"記不住","characters":[{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"記"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to live\/to dwell\/to stay\/to reside\/to stop\/(suffix indicating firmness, steadiness, or coming to a halt)"],"pinyin":["zhu4"],"word":"住"}],"containing_words":[],"sentences":[{"english":"I just couldn't remember it's name last night but I have been looking forward to seeing it for a long time.","chinese":"其實我一直盼望着去看看，但昨晚老記不住名字。"},{"english":"Her problem: She can't remember them.","chinese":"她的問題在於她記不住。"},{"english":"Amnesia sufferers usually cannot remember their identity or name.","chinese":"失憶症患者常常記不住他們的身份或名字。"},{"english":"And at moments you just can't remember your lines.","chinese":"但是這時你就是記不住臺詞。"},{"english":"Many actors have difficulty in learning their lines, and get them wrong even after a lot of practice.","chinese":"許我演員記不住臺詞，排練了許多次以後還是要搞錯。"},{"english":"Finding that he could not remember a word of the letter either.","chinese":"獄卒發現自己連一個字也記不住。"},{"english":"Even the honors kids do not retain much by the end of the year.","chinese":"年底的時候，連優等生也記不住多少所學的東西。"},{"english":"Can t memorize these lists?","chinese":"記不住這些名單？"},{"english":"Show me, and I may not reme ber.","chinese":"給我看，我可能也記不住。"},{"english":"Many of them spend hours in memorizing vocabularies but are still having a hard time in remembering them.","chinese":"很多人花大量的時間去背單詞，但是卻仍然記不住。"},{"english":"She couldn't remember my log-ons and passwords, no matter how many times I wrote them down for her.","chinese":"無論我說多少次，她老是記不住我的登錄名和密碼。"},{"english":"Relaxed: Men tend to have dull dreams that often cannot even be remembered (posed by model)","chinese":"男人們的夢往往很無聊，他們通常也記不住。"},{"english":"Actually he is very bad at remembering passwords.","chinese":"實際上他記性非常差，記不住密碼。"}],"related":[]}