{"definition":["to remember"],"pinyin":["ji4 de5"],"simplified":["记得"],"rank":2718.0,"normalized_rank":0.038028346368558764,"fraction":0.00005400617478909415,"cumulative_fraction":0.7763446916205194,"word":"記得","characters":[{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"記"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[],"sentences":[{"english":"Remember what we read from I Cor 15?","chinese":"記得我們在哥林多前書15章所讀過的嗎？"},{"english":"Maybe some newsy remembers an odd customer.","chinese":"也許哪個賣報的還記得這麼個古怪的顧客。"},{"english":"Or maybe I don't even remember that I was alive.","chinese":"甚至可能連活着都不記得。"},{"english":"Keep in mind that Drone Platforms don't supply Assimilators when sold.","chinese":"時刻記得機械平臺在賣掉得時候不提供同化者。"},{"english":"Remember to spend a day in Central Park watching a play by Shakespeare in the open air.","chinese":"記得花一天時間在中央公園露天看莎士比亞的戲劇。"},{"english":"She remembered that she was wearing a moon-white tunic.","chinese":"她記得她穿的是一件月白的衫子。"},{"english":"Have you only remembered Dong Ying and Tong?","chinese":"難道你只記得董穎和彤了嗎？"},{"english":"Be on time to meetings-early if you can.","chinese":"開會記得準時，能早點到更好。"},{"english":"Dear colleagues, a pleasant journey, I remember thinking of us, always come back together sometime.","chinese":"親愛的同事，一路順風，記得想念我們，常回來聚聚。"},{"english":"I remember when I went and I had a great time.","chinese":"我記得我讀大學的時候度過了一段美妙的時光。"},{"english":"I remember it only had winter cabbages, right?","chinese":"我記得只有冬儲大白菜，對吧？"},{"english":"But remember this auspicious month comes but once a year.","chinese":"但要記得，吉慶的齋月，每年只有一次。"},{"english":"Fare well, Ai Iijima, I'll remember your love forever.","chinese":"永別了，飯島愛，我永遠會記得妳的愛。"},{"english":"But he said you remember the week that rained?","chinese":"他卻問我，你記得那個下雨的週末嗎？"},{"english":"I didn't recall talking about sneakers, but it was possible, I guess.","chinese":"我沒有記得說過軟底鞋，但它是可能的，我猜。"},{"english":"We still remember last year, when the first scene scarf to wear it?","chinese":"還記得我們上一年級時，第一次戴上領巾時的情景嗎？"}],"related":[{"definition":["time\/length of time\/moment\/period"],"pinyin":["shi2 hou5"],"word":"時候"},{"definition":["to forget"],"pinyin":["wang4 ji4"],"word":"忘記"},{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不過"},{"definition":["at that time"],"pinyin":["na4 shi2 hou5"],"word":"那時候"},{"definition":["to remember\/to bear in mind\/to learn by heart"],"pinyin":["ji4 zhu5"],"word":"記住"},{"definition":["then\/at that time\/in those days"],"pinyin":["na4 shi2"],"word":"那時"},{"definition":["that one\/that thing\/that (as opposed to this)\/(used before a verb or adjective for emphasis)\/(used to humorously or indirectly refer to sth embarrassing, funny etc, or when one can't think of the right word)\/(used in speech as a filler, similar to \"umm\", \"you know\" etc)\/(euph.) menstruation\/sex\/also pr. [nei4 ge5]"],"pinyin":["na4 ge5"],"word":"那個"},{"definition":["It is said that ... (at the start of a narrative)\/to discuss\/to recount"],"pinyin":["hua4 shuo1"],"word":"話說"},{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"記"},{"definition":["ought to\/should\/must"],"pinyin":["ying1 gai1"],"word":"應該"},{"definition":["here"],"pinyin":["zhe4 li3"],"word":"這裡"},{"definition":["to press charges\/to file a complaint","to tell\/to inform\/to let know"],"pinyin":["gao4 su4","gao4 su5"],"word":"告訴"},{"definition":["to hear (sth said)\/one hears (that)\/hearsay\/listening and speaking"],"pinyin":["ting1 shuo1"],"word":"聽說"},{"definition":["because\/owing to\/on account of"],"pinyin":["yin1 wei4"],"word":"因為"},{"definition":["furthermore\/in addition\/still\/also"],"pinyin":["hai2 you3"],"word":"還有"},{"definition":["now\/at present\/at the moment\/modern\/current\/nowadays"],"pinyin":["xian4 zai4"],"word":"現在"}]}