{"definition":["to bear grudges"],"pinyin":["ji4 hen4"],"simplified":["记恨"],"rank":41929.0,"normalized_rank":0.5866411092300589,"fraction":3.2056686858880303e-7,"cumulative_fraction":0.9971659596968022,"word":"記恨","characters":[{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"記"},{"definition":["to hate\/to regret"],"pinyin":["hen4"],"word":"恨"}],"containing_words":[],"sentences":[{"english":"But gold bugs hated it.","chinese":"但黃金投資者記恨這個。"},{"english":"When someone has deeply hurt you, it can be surprisingly beneficial to your grudge.","chinese":"有人深深傷害你時，你很難做到不記恨心頭。"},{"english":"I never get my knife in someone, because I know that can't resolve anything.","chinese":"我從不記恨某人，因爲我知道這對解決問題毫無幫助。"},{"english":"That he could trust, but not resent those who let him down.","chinese":"他可以去信任，但不去記恨讓他失望的人。"},{"english":"That was a thousand years ago, Mom. How long are you gonna hold the grudge?","chinese":"那都是一千年以前的事了，媽，你還打算記恨多久。"},{"english":"Instead of holding mistakes against them for life, try to forgive someone.","chinese":"與其因某人犯錯而記恨一輩子，不如選擇寬恕。"},{"english":"I was wondering if Xiaoxian would hate me.","chinese":"我呢，一直也害怕小仙兒會記恨我。"},{"english":"Also bears a grudge clearly uselessly, remains does not have the time, detains is bored.","chinese":"也明白記恨無益，留不得時間，強留更是無聊。"},{"english":"Life is too short, should not be used to bear grudges.","chinese":"生命太短暫了，不應該用來記恨。"},{"english":"He may accept your apology, but the offence will be chalked up against you.","chinese":"他也許會接受你的道歉，但你的冒犯將被記恨在心。"},{"english":"Unfair or abusive treatment and training will lead to an Akita that resents you.","chinese":"不公平或過濫的對待訓練會導致她記恨你。"},{"english":"It may sour in hated dependence or independence.","chinese":"它可能酸記恨依賴或獨立。"}],"related":[{"definition":["to harbor evil designs\/to harbor malicious intentions"],"pinyin":["bu4 huai2 hao3 yi4"],"word":"不懷好意"},{"definition":["to watch with amusement as sb makes a fool of himself"],"pinyin":["kan4 xiao4 hua5"],"word":"看笑話"},{"definition":["to submit to humiliation (idiom); to suffer in silence\/to swallow one's anger\/to grin and bear it"],"pinyin":["ren3 qi4 tun1 sheng1"],"word":"忍氣吞聲"},{"definition":["Trouble issues from the mouth (idiom). A loose tongue may cause a lot of trouble."],"pinyin":["huo4 cong2 kou3 chu1"],"word":"禍從口出"},{"definition":["evil has its retribution (idiom); to suffer the consequences of one's bad deeds\/sow the wind and reap the whirlwind (Hosea 8:7)"],"pinyin":["e4 you3 e4 bao4"],"word":"惡有惡報"},{"definition":["dumbstruck and unable to reply (idiom); left speechless\/at a loss for words"],"pinyin":["ya3 kou3 wu2 yan2"],"word":"啞口無言"},{"definition":["to think highly of oneself (idiom); giving oneself airs\/arrogant and self-important"],"pinyin":["zi4 shi4 shen4 gao1"],"word":"自視甚高"},{"definition":["lit. to destroy the bridge after crossing the river (idiom)\/fig. to abandon one's benefactor upon achieving one's goal"],"pinyin":["guo4 he2 chai1 qiao2"],"word":"過河拆橋"},{"definition":["to keep silent"],"pinyin":["mo4 bu4 zuo4 sheng1"],"word":"默不作聲"},{"definition":["to fawn on\/to curry favor with\/to make up to"],"pinyin":["ba1 jie5"],"word":"巴結"},{"definition":["idle gossip"],"pinyin":["xian2 yan2 xian2 yu3"],"word":"閒言閒語"},{"definition":["to die in such a way that sb (or sth) else also perishes\/to take sb down with oneself\/to end in mutual destruction"],"pinyin":["tong2 gui1 yu2 jin4"],"word":"同歸於盡"},{"definition":["to forget favors and violate justice (idiom); ingratitude to a friend\/to kick a benefactor in the teeth"],"pinyin":["wang4 en1 fu4 yi4"],"word":"忘恩負義"},{"definition":["spilt water is difficult to retrieve (idiom)\/it's no use crying over spilt milk\/what's done is done and can't be reversed\/the damage is done\/once divorced, there's no reuniting"],"pinyin":["fu4 shui3 nan2 shou1"],"word":"覆水難收"},{"definition":["to learn a lesson from the mistakes of one's predecessor (idiom)"],"pinyin":["qian2 che1 zhi1 jian4"],"word":"前車之鑒"},{"definition":["to resign oneself to adversity (idiom); to grin and bear it\/to submit meekly to insults, maltreatment, humiliation etc"],"pinyin":["ni4 lai2 shun4 shou4"],"word":"逆來順受"}]}