{"definition":["to recall\/to recollect"],"pinyin":["ji4 qi3"],"simplified":["记起"],"rank":24287.0,"normalized_rank":0.3398066402697522,"fraction":0.0000015845871395862737,"cumulative_fraction":0.9831988701370212,"word":"記起","characters":[{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"記"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"So don. t lose sight of your healthy diet pyramid when you do your shopping.","chinese":"所以你購物時要記起健康飲食金字塔。"},{"english":"Marianne was going to retort, but she remembered her promises and forbore.","chinese":"瑪麗安正想反駁，但她記起了自己的諾言，便。"},{"english":"Mute recall him , maybe grow this world here being able to not have forgot.","chinese":"默默的記起他，也許此生此世都不會忘記了。"},{"english":"I can recollect many things which I did not understand, but which stirred me deeply.","chinese":"我能記起許多我不能理解但卻使我深深激動的事情。"},{"english":"And then you remember that you moved when you were about three years old.","chinese":"這時你記起大概三歲的時候，你們搬過一次家。"},{"english":"Only when he steps toward the table do I remember his face.","chinese":"只在他朝桌子這邊走過來的時候我才記起他的臉來。"},{"english":"They should write down everything they remember.","chinese":"他們應該寫下他們能記起的所有事。"},{"english":"Sometimes we are able to remember our dreams while sometimes we are not.","chinese":"有時我們能記起做過的夢，有時卻不能。"},{"english":"As I recall the many things we left unsaid.","chinese":"我記起許多我們沒說出的往事。"},{"english":"For the first list, I was able to recall only 12 %.","chinese":"第一張生詞表，我只記起其中12%的單詞的意思。"},{"english":"And then the children remembered that Martha couldn't see the wishes.","chinese":"於是孩子們記起馬莎是看不出這些許願的事的。"},{"english":"Ponti worried Jackie remember previously I had participated in the kidnapping Jackie.","chinese":"龐很擔憂傑姬記起以前本人曾經參與過綁架傑姬的事。"},{"english":"The animals remember people even after long separation.","chinese":"馬能記起分別已久的人。"},{"english":"Gallicantu means \"cock crowing \" and it remembers the three denials of Peter.","chinese":"該法亞意思是“雞叫”，它使人記起彼得三次不認主。"},{"english":"When I woke, Luda once several times called me as Chau Jie.","chinese":"記起當我醒來時，路德曾數次稱我爲橋傑。"},{"english":"I suddenly recalled A-do's stick of skewered mutton?","chinese":"我突然記起阿杜的那串羊肉？"}],"related":[{"definition":["to forget"],"pinyin":["wang4 ji4"],"word":"忘記"},{"definition":["to realize suddenly\/to wake up with a start"],"pinyin":["jing1 jue2"],"word":"驚覺"},{"definition":["once\/already\/former\/previously\/ever\/(past tense marker used before verb or clause)"],"pinyin":["ceng2 jing1"],"word":"曾經"},{"definition":["to become forgotten\/to forget"],"pinyin":["yi2 wang4"],"word":"遺忘"},{"definition":["then\/at that time\/in those days"],"pinyin":["na4 shi2"],"word":"那時"},{"definition":["to become aware\/to detect\/to realize\/to perceive"],"pinyin":["fa1 jue2"],"word":"發覺"},{"definition":["to hear"],"pinyin":["ting1 jian4"],"word":"聽見"},{"definition":["to see\/to catch sight of"],"pinyin":["kan4 jian4"],"word":"看見"},{"definition":["to talk about\/to mention\/(preposition) as for"],"pinyin":["shuo1 dao4"],"word":"說到"},{"definition":["lit. that person\/fig. the person you have been looking for\/Mr Right\/the girl of one's dreams"],"pinyin":["na4 ge4 ren2"],"word":"那個人"},{"definition":["just now\/a moment ago"],"pinyin":["gang1 cai2"],"word":"剛才"},{"definition":["to grieve\/to be broken-hearted\/to feel deeply hurt"],"pinyin":["shang1 xin1"],"word":"傷心"},{"definition":["to depart\/to leave"],"pinyin":["li2 kai1"],"word":"離開"},{"definition":["to feel sad\/to feel unwell\/(of life) to be difficult"],"pinyin":["nan2 guo4"],"word":"難過"},{"definition":["to rouse\/to be woken by sth\/to wake with a start\/to sleep lightly"],"pinyin":["jing1 xing3"],"word":"驚醒"},{"definition":["to leave\/to exit"],"pinyin":["li2 qu4"],"word":"離去"}]}