{"definition":["interviewer"],"pinyin":["fang3 wen4 zhe3"],"simplified":["访问者"],"rank":33339.0,"normalized_rank":0.4664558644523107,"fraction":6.999627208029647e-7,"cumulative_fraction":0.9929652314518786,"word":"訪問者","characters":[{"definition":["to visit\/to call on\/to seek\/to inquire\/to investigate"],"pinyin":["fang3"],"word":"訪"},{"definition":["to ask"],"pinyin":["wen4"],"word":"問"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"The Actavis Group hf. respects the privacy of the visitors to this website.","chinese":"阿特維斯集團尊重本網站訪問者的隱私。"},{"english":"Or you can have a form to collect visitors' comments about your site.","chinese":"或者可以創建表格收集訪問者對網站的評論。"},{"english":"A pageview indicates that a visitor has viewed a certain page on the website.","chinese":"頁面視圖意味着訪問者已經瀏覽了網站上的一些頁面。"},{"english":"It gave visitors a strong impression they’d have to register in order to check out.","chinese":"它給訪問者造成的強烈印象是他們必須註冊才能結賬。"},{"english":"That’s far easier than getting more visitors.","chinese":"這比獲得更多訪問者要容易得多。"},{"english":"You can use different approaches to introduce your new web-service to your visitors.","chinese":"你可以通過不同的途徑向你的訪問者介紹網站服務。"},{"english":"A statistics application can give you the browsing route of a visitor.","chinese":"統計應用可以給你提供訪問者的瀏覽路線。"},{"english":"Prevent visitors from viewing and printing your source code.","chinese":"阻止訪問者查看並打印您的源代碼。"},{"english":"This encourages visitor traffic and promotes client reorders .","chinese":"這些鼓勵了交易訪問者並促進了客戶再次定貨。"},{"english":"The vicious visitors visited the virtual village. The vicious visitors visited the virtual village.","chinese":"惡毒的訪問者拜訪了虛擬的村莊。"},{"english":"Visitors who read beyond the headline, scan subheadings .","chinese":"不瀏覽標題的訪問者，會注意副標題。"},{"english":"You can also view a listof pages each visitor has viewed.","chinese":"你還可以瀏覽一個訪問者瀏覽過的網頁的列表。"},{"english":"Visitors were amazed at the students' conversational fluency in English.","chinese":"訪問者對學生們流利的英語感到驚訝。"},{"english":"A categorical arrangement of specimens is needed to show the visitors.","chinese":"標本的分類排列需要展示給訪問者看。"},{"english":"Famous visitors include Ngawang Namgyal in the 17th century and Milarepa.","chinese":"著名的訪問者包括阿旺朗傑在17世紀和米拉日巴。"},{"english":"Visitors have to provide some input to start browsing through the site.","chinese":"訪問者必須提供一些輸入，才能啓動瀏覽網站。"}],"related":[]}