{"definition":["located at\/set up in a particular location"],"pinyin":["she4 zai4"],"simplified":["设在"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"設在","characters":[{"definition":["to set up\/to arrange\/to establish\/to found\/to display"],"pinyin":["she4"],"word":"設"},{"definition":["(located) at\/(to be) in\/to exist\/in the middle of doing sth\/(indicating an action in progress)"],"pinyin":["zai4"],"word":"在"}],"containing_words":[],"sentences":[{"english":"The company's headquarter is located in Jinhua city and the company has its own customs broker.","chinese":"公司總部設在金華，並有自己的報關行。"},{"english":"Existing staff of 50 people, the plant located in the east village Humen.","chinese":"現有員工五十餘人，總廠設在虎門東風村。"},{"english":"Amylin is headquartered in San Diego, California.","chinese":"胰澱素是總部設在加利福尼亞州聖迭戈。"},{"english":"The command post was set up in a forward position.","chinese":"指揮部設在前沿陣地上。"},{"english":"His headquarters are somewhere in the Everglades, his gang are a mixed-up bunch.","chinese":"其總部設在某處沼澤地，他的團伙是一個混合了一堆。"},{"english":"The novel is set in a futureworld.","chinese":"小說的背景設在未來世界。"},{"english":"The company is headquartered at No. 3 Nanhuan Road, Zhoutie Town, Southwest Suburb, Wuxi.","chinese":"集團總部設在無錫市西南郊周鐵鎮南環路3號。"},{"english":"Please go to the Shanghai Travel Service Agency in our hotel.","chinese":"請到設在我們飯店的上海旅行服務社去購買。"},{"english":"The factory address is located in Long Huahe the back industrial district, has the staff more than 200 people.","chinese":"工廠地址設在龍華河背工業區，擁有員工200多人。"},{"english":"An optional bow member clips about the pinna.","chinese":"可選用的弓形件夾設在耳廓的周圍。"},{"english":"The head office of the Group after its mergence is located in Beijing.","chinese":"重組後的中交集團，總部設在北京。"},{"english":"Headquartered in lanzhou city, gansu province.","chinese":"公司總部設在甘肅蘭州。"},{"english":"The team's field headquarters that night would be an empty building on the very edge of town.","chinese":"別動隊當晚的戰地指揮部就設在城邊的一座空樓裏。"},{"english":"Our company situates in Shenzhen for foreign business contact.","chinese":"公司設在深圳市，負責對外業務聯繫。"},{"english":"Home at the place far away from downtown area.","chinese":"把總部設在遠離鬧市區的地方。"},{"english":"Neal Communities is based in Manatee County.","chinese":"尼爾共同體總部設在馬納提縣。"}],"related":[]}