{"definition":["design norm\/planning regulations"],"pinyin":["she4 ji4 gui1 fan4"],"simplified":["设计规范"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"設計規範","characters":[{"definition":["to set up\/to arrange\/to establish\/to found\/to display"],"pinyin":["she4"],"word":"設"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"計"},{"definition":["compass\/a rule\/regulation\/to admonish\/to plan\/to scheme"],"pinyin":["gui1"],"word":"規"},{"definition":["pattern\/model\/example"],"pinyin":["fan4"],"word":"範"}],"containing_words":[],"sentences":[{"english":"Typically, design codes are based on one specific set of units.","chinese":"而設計規範是基於某套特定的單元。"},{"english":"It was recommended that the annual maximum value method is worth to accept by the design code.","chinese":"建議《室外排水設計規範》儘早改用年最大值法選樣。"},{"english":"Compile Group of Code for Design of Steel Structure.","chinese":"《鋼結構設計規範》編寫組。"},{"english":"The seismic zoning map is the basic information for compiling code for seismic design of any kind of structures.","chinese":"地震區劃圖是編制抗震設計規範的基礎資料。"},{"english":"NFPA 13, Standard for the Installation of Sprinkler Systems, 2002.","chinese":"自動噴水滅火系統設計規範。"},{"english":"I think it\\\\\\'s less than satisfactory in design code enforcement.","chinese":"我認爲在設計規範的強制執行上還不能令人滿意。"},{"english":"The air duct must be designed and installed in accordance with national design code for HVAC duct.","chinese":"風管設計和安裝必須符合國家暖通空調管道設計規範。"},{"english":"Familiar with relevant rotating static equipment design codes stards including GB, API, ISO.","chinese":"熟悉轉動設備和靜設備設計規範和標準，包括。"},{"english":"This research subject is the sixth passel subject of code for design of concrete structure.","chinese":"本課題爲國家混凝土結構設計規範第六批科研課題。"},{"english":"Comply with the design specifications and tech-regulation of Shanghai.","chinese":"符合中國設計規範及上海市有關的技術規定。"}],"related":[]}