{"definition":["procedural law"],"pinyin":["su4 song4 fa3"],"simplified":["诉讼法"],"rank":41967.0,"normalized_rank":0.5871727785317532,"fraction":3.195450252007695e-7,"cumulative_fraction":0.9971781222607172,"word":"訴訟法","characters":[{"definition":["to complain\/to sue\/to tell"],"pinyin":["su4"],"word":"訴"},{"definition":["litigation"],"pinyin":["song4"],"word":"訟"},{"definition":["France\/French\/abbr. for 法國|法国[Fa3 guo2]\/Taiwan pr. [Fa4]","law\/method\/way\/to emulate\/(Buddhism) dharma\/(abbr. for 法家[Fa3 jia1]) the Legalists\/(physics) farad (abbr. for 法拉[fa3 la1])"],"pinyin":["Fa3","fa3"],"word":"法"}],"containing_words":[{"definition":["criminal procedure"],"pinyin":["xing2 shi4 su4 song4 fa3"],"word":"刑事訴訟法"}],"sentences":[{"english":"Not-suing is an important instition of our country's criminal suit law.","chinese":"不起訴是我國刑事訴訟法的一項重要制度。"},{"english":"Criminal laws stipulate that detention de bene esse can apply to active criminal.","chinese":"刑事訴訟法規定對現行犯可以適用先行拘留。"},{"english":"The principle of orality is established as a basic principle in modern civil Procedural law.","chinese":"言詞原則是近代民事訴訟法確立的一項重要原則。"},{"english":"Law of evidence is a important part of procedural law .","chinese":"證據法學是訴訟法學中的重要組成部分。"},{"english":"Therefore, the reconstruction of scope of accepting cases of administrative litigation is imperative.","chinese":"因此，重構行政訴訟法受案範圍勢在必行。"},{"english":"Administrative Law and Administrative Procedure Law\" is the preparation of teaching materials for graduate students.\"","chinese":"行政法與行政訴訟法》是爲研究生編寫的教材。"},{"english":"The status and function for the spy proceeding in the criminal law have been discussed.","chinese":"第一章論述了偵查程序在刑事訴訟法中的地位與功能。"},{"english":"Litigation right theory and procedural law and substantial law.","chinese":"訴權論和訴訟法與實體法關係理論。"},{"english":"We are carrying out our work according to procedural law, so please cooperate.","chinese":"我們是依據訴訟法開展工作的，請您配合我們。"},{"english":"Thus, this author urges that we should abrogate this principle while amending the Criminal Procedural Act.","chinese":"因此，應當在修改《刑事訴訟法》時廢除這一制度。"},{"english":"China's Criminal Procedural Law does not provide for the preliminary investigation system.","chinese":"我國《刑事訴訟法》中並未規定初查制度。"},{"english":"However, little research has been conducted on the right of private prosecution in criminal litigation.","chinese":"刑事訴訟法學界對刑事自訴權理論的研究尚不夠充分。"},{"english":"Our country's law of criminal procedure lacks the regulations to the system.","chinese":"我國刑事訴訟法對刑事缺席審判制度缺乏明文規定。"},{"english":"The first chapter introduces shifty necessity of the administrative procedure legal methodology.","chinese":"第一章主要介紹了行政訴訟法學方法論轉變的必要性。"}],"related":[]}