{"definition":["morphology (linguistics)\/word formation and inflection"],"pinyin":["ci2 fa3"],"simplified":["词法"],"rank":58841.0,"normalized_rank":0.8232619310788689,"fraction":4.963239313305693e-8,"cumulative_fraction":0.9997620898970896,"word":"詞法","characters":[{"definition":["word\/statement\/speech\/lyrics\/CL:組|组[zu3],個|个[ge4]\/a form of lyric poetry, flourishing in the Song dynasty 宋朝|宋朝[Song4 chao2]\/CL:首[shou3]"],"pinyin":["ci2"],"word":"詞"},{"definition":["France\/French\/abbr. for 法國|法国[Fa3 guo2]\/Taiwan pr. [Fa4]","law\/method\/way\/to emulate\/(Buddhism) dharma\/(abbr. for 法家[Fa3 jia1]) the Legalists\/(physics) farad (abbr. for 法拉[fa3 la1])"],"pinyin":["Fa3","fa3"],"word":"法"}],"containing_words":[{"definition":["morphological awareness"],"pinyin":["gou4 ci2 fa3 yi4 shi2"],"word":"構詞法意識"},{"definition":["orthography (linguistics)"],"pinyin":["zheng4 ci2 fa3"],"word":"正詞法"}],"sentences":[{"english":"Syntax trees only represent the lexical and syntactic structure of the source code.","chinese":"語法樹只能夠表現出源代碼的詞法和句法結構。"},{"english":"Here is an example of lexing and parsing a sentence.","chinese":"以下是對一個句子進行詞法分析和解析的示例。"},{"english":"The two word-building is an important means of polysyllabic adverbs in Song Shu.","chinese":"這兩種構詞法是《宋書》中副詞複音化的重要手段。"},{"english":"Ancient China had rich accidence concepts.","chinese":"中國古人已有相當豐富的詞法觀念。"},{"english":"A brief tutorial on parsing and lexing is in order.","chinese":"應該給出關於解析和詞法分析的一個簡短指南。"},{"english":"During index update processing, the lexical analysis identifies the lemmas of the words in the document, and the analysis adds this information to the text index.","chinese":"在索引更新過程中，詞法分析確定文檔中單詞的詞元。"},{"english":"If the tokenizer encounters neither token, it returns a lexical error.","chinese":"如果記號賦予器未遇到這兩個記號，則返回詞法錯誤。"},{"english":"Do you know word formation in English words?","chinese":"你知道英語單詞的構詞法嗎？"},{"english":"Scanning, or lexical analysis.","chinese":"掃描，也稱詞法分析。"},{"english":"Word-formation is one of the important methods of English learning.","chinese":"英語構詞法是英語學習中的重要方法之一。"},{"english":"From the third to fifth part, is to study Changshan dialect's morphology.","chinese":"第三至五部分是崇山土話的詞法研究。"},{"english":"Creating new words according to Chinese way of word formation.","chinese":"按漢語構詞法創造新詞對譯西方術語。"},{"english":"That's where the power of lexically scoped variables comes into play.","chinese":"在詞法上確定範圍的變量就是在此處發揮作用。"},{"english":"Morphology comprises notional words and function words.","chinese":"詞法部分包括實詞和虛詞。"},{"english":"In the second chapter, we compare and contrast all most word-formation between English and Chinese.","chinese":"第二章對英漢語的構詞法進行了細緻的對比和分析。"},{"english":"A query refinement scheme, which synthesizes the synonymic relation and the semantic association, is presented.","chinese":"提出了一種綜合詞法關係和語義分析的查詢優化方法。"}],"related":[]}