{"definition":["morpheme"],"pinyin":["ci2 su4"],"simplified":["词素"],"rank":67919.0,"normalized_rank":0.9502749289941655,"fraction":7.152903716234676e-9,"cumulative_fraction":0.9999862176683292,"word":"詞素","characters":[{"definition":["word\/statement\/speech\/lyrics\/CL:組|组[zu3],個|个[ge4]\/a form of lyric poetry, flourishing in the Song dynasty 宋朝|宋朝[Song4 chao2]\/CL:首[shou3]"],"pinyin":["ci2"],"word":"詞"},{"definition":["raw silk\/white\/plain, unadorned\/vegetarian (food)\/essence\/nature\/element\/constituent\/usually\/always\/ever"],"pinyin":["su4"],"word":"素"}],"containing_words":[{"definition":["polymorphemic"],"pinyin":["fu4 he2 ci2 su4 ci2"],"word":"複合詞素詞"},{"definition":["morphological structure"],"pinyin":["ci2 su4 jie2 gou4"],"word":"詞素結構"},{"definition":["morpheme access model (MA model)"],"pinyin":["ci2 su4 tong1 da2 mo2 xing2"],"word":"詞素通達模型"}],"sentences":[{"english":"It refers to the formation of new words by adding affixes to other words or morphemes.","chinese":"將詞綴加入其他單詞或詞素以構成新詞的方法。"},{"english":"Part 3 is concerned with word classes and morphology.","chinese":"第三部分有3章，談詞類和詞素。"},{"english":"Morphemes are actually abstract elements of analysis.","chinese":"詞素實際上是抽象的語法分析元素。"},{"english":"The morpheme repeated prime paradigm was used to probe the mental representation of compound words.","chinese":"用詞素重複啓動的方法考察合成詞的心理表徵。"},{"english":"The thesis defines the concept and presents the formation of foreign word and foreign morpheme briefly.","chinese":"本文簡單界定了外來詞與外來詞詞素的概念和形成。"},{"english":"Morpheme is the smallest meaning-bearing unit of language.","chinese":"詞素是單詞的最小的有意義的組成部分。"},{"english":"The most basic element of meaning is traditionally called morpheme .","chinese":"傳統上把意義的基本成分稱爲詞素。"},{"english":"Morpheme is the basic unit in the study of morphology.","chinese":"詞素是形態學研究的最基本的單位。"},{"english":"What occurs is an orthographic form in writing termed \"morph\" which realizes the morpheme.","chinese":"在拼寫中被稱爲形素變體的形式形成了詞素。"},{"english":"A morpheme is a dual combination of both sound and meaning.","chinese":"詞素是最小的意義單位，有意義也有聲音。"},{"english":"In English, the minimal meaningful units are known as morphemes.","chinese":"詞素是英語中的最小語義單位。"}],"related":[]}