{"definition":["inquiry"],"pinyin":["xun2 pan2"],"simplified":["询盘"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"詢盤","characters":[{"definition":["to ask about\/to inquire about"],"pinyin":["xun2"],"word":"詢"},{"definition":["plate\/dish\/tray\/board\/hard drive (computing)\/to build\/to coil\/to check\/to examine\/to transfer (property)\/to make over\/classifier for food: dish, helping\/to coil\/classifier for coils of wire\/classifier for games of chess"],"pinyin":["pan2"],"word":"盤"}],"containing_words":[],"sentences":[{"english":"The original inquiry from abroad, information, and my heart is relatively happy.","chinese":"原來是來自國外詢盤信息，心裏也比較高興。"},{"english":"Inquiries for steel are increasing.","chinese":"對鋼的詢盤在增加。"},{"english":"4，Enquiries are so large that we can only than allot you 200 cases.","chinese":"詢盤如此之多，我們只能分給你們200箱貨。"},{"english":"Your are urged to give an early reply to our enquiry for groundnuts.","chinese":"請早日答覆我們有關花生的詢盤。"},{"english":"We have received your letter of July 1, enquiring about the best terms of the goods.","chinese":"貴公司7月1日來函就該商品優惠條件的詢盤敬悉。"},{"english":"We have received an inquiry from our clients in Japan for your shoes and hats.","chinese":"有關貴方鞋帽，我已收到日本客戶的詢盤。"},{"english":"Heaudio-videoy enquiries witness the quality of our products.","chinese":"大量詢盤證明我們產品格量過硬。"},{"english":"We are looking forward to your reply to our inquiry.","chinese":"我們期待你方對我方的詢盤做出答覆。"},{"english":"Heavy enquires witness the quality of our products!","chinese":"大量的詢盤證明我們的產品質量過硬。"},{"english":"We are looking forward to your reply to our inquiry。","chinese":"我們期待你方對我方的詢盤做出答覆。"},{"english":"Enquiries are so large that we can only allot you 200 cases.","chinese":"詢盤如此之多，我們只能分給你們200箱貨。"},{"english":"A lot of inquiries confirm the high quality of our products.","chinese":"大量詢盤證明我們產品質量過硬。"},{"english":"They transferred their future inquiries to X Company.","chinese":"他們將以後的詢盤轉給X公司。"},{"english":"Please address your enquires to the manager.","chinese":"請將貴方的詢盤寄給經理。"},{"english":"Generally speaking, inquiries are formulfound oned by the buyers.","chinese":"詢盤一樣平常由買方發出。"},{"english":"You can rest assured that we shall revert to your enquiry as soon as possible.","chinese":"請放心，我方以後將盡速重新處理你的詢盤。"}],"related":[]}