{"definition":["to try out\/to test"],"pinyin":["shi4 xing2"],"simplified":["试行"],"rank":6850.0,"normalized_rank":0.0958403872791124,"fraction":0.000015203715815297095,"cumulative_fraction":0.8942693087573679,"word":"試行","characters":[{"definition":["to test\/to try\/experiment\/examination\/test"],"pinyin":["shi4"],"word":"試"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"}],"containing_words":[],"sentences":[{"english":"He suggests establishing a trial period and a date for review.","chinese":"他建議設定一段試行期，並確定一個重新評估日期。"},{"english":"We launched Freshness in 2005 in MediaCom's U.","chinese":"2005年，我們在英國分公司開始試行這項計劃。"},{"english":"If \"it\" does not work, a different approach is tried right away.","chinese":"如果“它”不工作，一個不同的方法將被立刻試行。"},{"english":"To prevent female college students \"sits near the big style\" phenomenon guangdong education for women.","chinese":"爲防止女大學生“傍大款”現象廣東試行女性教育。"},{"english":"Their efforts worked. Some families in the village decided to try SRI.","chinese":"這些工作都有成效，村裏一些家庭決定試行SRI。"},{"english":"Viewed from the function of military courts, it is feasible for military courts to judge the civil cases.","chinese":"軍事法院試行審理軍內民事案件，引發了一些爭議。"},{"english":"Small-class teaching could be implemented in Sha Tin on a trial basis.","chinese":"可以在沙田試行小班教學。"},{"english":"In Shanghai, similar experiments are being carried out.","chinese":"在上海，也執行了同樣的試行。"},{"english":"Beijing is not the only Chinese city experimenting with the sex education in elementary schools.","chinese":"在中國，不僅僅只有北京在小學試行性教育。"},{"english":"In the implementation and the comprehensive promotion, universities charge has become too high.","chinese":"在試行與全面推廣中，出現了收費過高的問題。"},{"english":"A budget system for managing state capital was introduced in some enterprises on a trial basis.","chinese":"在部分企業試行國有資本經營預算制度。"},{"english":"Military courts try out to judge the civil cases inside the army, it causes some disputes.","chinese":"軍事法院試行審理軍內民事案件，引發了一些爭議。"},{"english":"The author suggests a new system to do track maintenance and repair work separately on Datong-Qinhuangdao Railway Line.","chinese":"建議大秦鐵路線路養護維修工作試行養修分離新體制。"},{"english":"You can look at these as temporary fixes – something to try over a 30-day period .","chinese":"你可以把它們看作暫時的措施，試行30天。"},{"english":"The trial is being extended for six months.","chinese":"此提議的試行期已經被延長至六個月。"}],"related":[{"definition":["to try sth out\/trial\/pilot scheme"],"pinyin":["shi4 ban4"],"word":"試辦"},{"definition":["guide\/forerunner\/pioneer"],"pinyin":["xian1 dao3"],"word":"先導"},{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"實行"},{"definition":["mechanism"],"pinyin":["ji1 zhi4"],"word":"機制"},{"definition":["authorities"],"pinyin":["dang1 ju2"],"word":"當局"},{"definition":["test point\/to carry out trial\/pilot scheme"],"pinyin":["shi4 dian3"],"word":"試點"},{"definition":["to set up\/to establish"],"pinyin":["she4 li4"],"word":"設立"},{"definition":["to open\/to start (a business etc)\/to set up"],"pinyin":["kai1 ban4"],"word":"開辦"},{"definition":["to start using\/(computing) to enable (a feature)"],"pinyin":["qi3 yong4"],"word":"啟用"},{"definition":["to regulate"],"pinyin":["gui1 guan3"],"word":"規管"},{"definition":["to implement\/to carry out"],"pinyin":["shi2 shi1"],"word":"實施"},{"definition":["to work out\/to formulate"],"pinyin":["zhi4 ding4"],"word":"制訂"},{"definition":["to set up\/to install"],"pinyin":["she4 zhi4"],"word":"設置"},{"definition":["running\/operation (of airport, bus service, business etc)"],"pinyin":["ying2 yun4"],"word":"營運"},{"definition":["to set\/to designate\/to stipulate\/to provide\/to draw up\/to formulate (rules etc)\/stipulation"],"pinyin":["ding4 ding4"],"word":"訂定"},{"definition":["large scale\/extensive\/wide scale\/broad scale"],"pinyin":["da4 gui1 mo2"],"word":"大規模"}]}