{"definition":["to take temperature"],"pinyin":["shi4 biao3"],"simplified":["试表"],"rank":62992.0,"normalized_rank":0.8813398066402698,"fraction":2.4816196566528466e-8,"cumulative_fraction":0.9999130164574671,"word":"試表","characters":[{"definition":["to test\/to try\/experiment\/examination\/test"],"pinyin":["shi4"],"word":"試"},{"definition":["exterior surface\/family relationship via females\/to show (one's opinion)\/a model\/a table (listing information)\/a form\/a meter (measuring sth)"],"pinyin":["biao3"],"word":"表"}],"containing_words":[],"sentences":[{"english":"And, DNA testing suggests that the food animals themselves were the major source of contamination.","chinese":"DNA測試表明食用動物本身就是主要污染源。"},{"english":"Preliminary tests indicate the substance found was Ricin.","chinese":"初步測試表明，該物質是蓖麻毒素。"},{"english":"Testing has shown increased speed improvements of 5X to 10X.","chinese":"測試表明，轉換速度提高了5到10倍。"},{"english":"By test, it has been confirmed that these varnishes possessed good properties and could be used as amino coatings.","chinese":"性能測試表明，該類烘漆確實具有較優異的性能。"},{"english":"The silicone -acrylic emulsion paint for exterior wall has been proved to be excellent through performance test.","chinese":"性能測試表明，硅丙外牆乳膠漆的性能優異。"},{"english":"The average velocity of droplet swarm is muchdiffrent from that of a single drop.","chinese":"測試表明液滴羣的浮升速度同單液滴有顯著不同。"},{"english":"It showed that the patient was producing a huge amount of growth hormone.","chinese":"測試表明該患者體內分泌大量生長激素。"},{"english":"Government tests show that it emits virtually no dioxin and other pollutants.","chinese":"政府測試表明該廠幾乎沒有二噁英及其他污染物排放。"},{"english":"None of the tests found the cement to be stable.","chinese":"沒有一次測試表明水泥是穩定的。"}],"related":[]}