{"definition":["poetry circles\/poetry world"],"pinyin":["shi1 tan2"],"simplified":["诗坛"],"rank":39930.0,"normalized_rank":0.5586725057014537,"fraction":3.8727864406470603e-7,"cumulative_fraction":0.9964616630462356,"word":"詩壇","characters":[{"definition":["abbr. for Shijing 詩經|诗经[Shi1 jing1], the Book of Songs","poem\/CL:首[shou3]\/poetry\/verse"],"pinyin":["Shi1","shi1"],"word":"詩"},{"definition":["platform\/rostrum\/altar"],"pinyin":["tan2"],"word":"壇"}],"containing_words":[],"sentences":[{"english":"Have you read the great masters of English poetry?","chinese":"你讀過英語詩壇上大師級詩人的作品嗎？"},{"english":"Poet Bian Zhilin contributes a series of intellectual poems to the modern poetry circle of China.","chinese":"詩人卞之琳爲中國現代詩壇貢獻出了一系列知性詩。"},{"english":"Li Bai, the superstar of poetry circles in Tang Dynasty, is deeply impressed by Taoism.","chinese":"唐代詩壇巨星李白，受道家思想影響甚深。"},{"english":"Thus it can be seen that Shangguan Wan'er was quite an influential poet in the early Tang Dynasty.","chinese":"由此可見，上官婉兒在初唐詩壇是有一定影響的詩人。"},{"english":"Shen Qianyun was an important poet during the flouring poetry age in Tang Dynasty.","chinese":"沈千運是盛唐詩壇上一位重要詩人。"},{"english":"Maybe we want to go into the ministry, maybe we want to go into poetry.","chinese":"也許我們從事牧師職業，也許想步入詩壇。"},{"english":"The flourish of poems of love is a special phenomenon of literature in the circle of poets of the late Tang Dynasty.","chinese":"愛情詩的興盛是中晚唐詩壇一個引人注目的文學現象。"},{"english":"Faulty sentence poetry and Xue pan style are having a contest at present.","chinese":"目前的詩壇實際上就是病句詩與薛蟠體的較量。"},{"english":"However, I remained nameless in Taiwan's poetry circle before I left for this country.","chinese":"但在我離開臺灣以前，在詩壇上可說是藉藉無名。"},{"english":"Song Wan, as an important poet in the poem field of the early Qing Dynasty, has been misunderstood deeply.","chinese":"作爲清初詩壇名家，宋琬其實是被深深誤解的一位。"},{"english":"Tang Qiu was an active poet in the late Tang dynasty.","chinese":"唐求，晚唐活躍於詩壇的蜀中詩人。"},{"english":"Embodying Shi Runzhang's important station and action in the poem's field at the beginning of the Qing Dynasty.","chinese":"也由此突現施閏章在清初詩壇的重要地位和作用。"},{"english":"Da Xie is a contemporary Chinese poet, with considerable influence around the whole country.","chinese":"大解是中國當代詩壇中生代詩人，在全國較有影響。"},{"english":"Wu Qi is a very active poet in early Qing Dynasty.","chinese":"吳綺是清初詩壇一位非常活躍的文人。"},{"english":"Wang Anshi is an important poet in the region of poetry in the middle period of Song Dynasty.","chinese":"王安石是北宋中期詩壇上一位重要詩人。"},{"english":"They have commented on the famous school and writer of poetic circles in the Ming dynasty.","chinese":"對明代詩壇上著名的流派和作家都進行了品評。"}],"related":[]}