{"definition":["sly\/treacherous"],"pinyin":["gui3 zha4"],"simplified":["诡诈"],"rank":56460.0,"normalized_rank":0.7899486519384943,"fraction":6.831752937138426e-8,"cumulative_fraction":0.9996225911952484,"word":"詭詐","characters":[{"definition":["sly\/crafty\/weird\/bizarre\/contradictory\/inconsistent"],"pinyin":["gui3"],"word":"詭"},{"definition":["to cheat\/to swindle\/to pretend\/to feign\/to draw sb out\/to try to extract information by deceit or bluff"],"pinyin":["zha4"],"word":"詐"}],"containing_words":[],"sentences":[{"english":"But He perceived their craftiness and said to them.","chinese":"耶穌看出他們的詭詐，就對他們說。"},{"english":"He is a merchant, the balances of deceit are in his hand: he loveth to oppress.","chinese":"以法蓮是商人，手裏有詭詐的天平，愛行欺騙。"},{"english":"The heart is deceitful above all things and beyond cure. Who can understand it?","chinese":"人心比萬物都詭詐，壞到極處，誰能識透呢。"},{"english":"For I knew that you would deal very treacherously And would be called a transgressor from the womb.","chinese":"我原知道你行事極其詭詐，你從母腹裏便稱爲悖逆的。"},{"english":"Because of new technology, scams have become even trickier to detect.","chinese":"因爲新科技，騙錢術變得更詭詐而難以偵測。"},{"english":"For such are false apostles, deceitful workers, transforming themselves into the apostles of Christ.","chinese":"那等人是假使徒，行事詭詐，裝作基督使徒的模樣。"},{"english":"And in every sort of evil that deceives those who are perishing .","chinese":"並且在那沉淪的人身上，行各樣出於不義的詭詐。"},{"english":"Thou givest thy mouth to evil, and thy tongue frameth deceit.","chinese":"你口任說惡言，你舌編造詭詐。"},{"english":"Will you speak deceitfully for him?","chinese":"爲他說詭詐的言語嗎？"},{"english":"Whose hatred is covered by deceit, his wickedness shall be shewed before the whole congregation.","chinese":"他雖用詭詐遮掩自己的怨恨，他的邪惡必在會中顯露。"},{"english":"You love every harmful word, O you deceitful tongue!","chinese":"詭詐的舌頭阿，你愛說一切毀滅的話。"},{"english":"4He who has clean hands and a pure heart, who does not lift up his soul to an idol or swear by what is false.","chinese":"就是手潔心清，不向虛妄，起誓不懷詭詐的人。"},{"english":"Wickedness is in the midst thereof: deceit and guile depart not from her streets.","chinese":"邪惡在其中，欺壓和詭詐不離街市。"},{"english":"If I have walked with vanity, or if my foot hath hasted to deceit;","chinese":"我若與虛謊同行，腳若追隨詭詐。"},{"english":"Oneway Normandyis comparable to go is the fact that the deception is involved.","chinese":"與圍棋相比，諾曼底實際上是運用了詭詐之術。"},{"english":"I wanted to inject a little humor and quirkiness into the film.","chinese":"我希望他在影片中注入一點幽默和詭詐。"}],"related":[{"definition":["virtue has its rewards (idiom); one good turn deserves another"],"pinyin":["shan4 you3 shan4 bao4"],"word":"善有善報"},{"definition":["evil has its retribution (idiom); to suffer the consequences of one's bad deeds\/sow the wind and reap the whirlwind (Hosea 8:7)"],"pinyin":["e4 you3 e4 bao4"],"word":"惡有惡報"},{"definition":["lit. to point at the mulberry tree and curse the locust tree\/fig. to scold sb indirectly\/to make oblique accusations (idiom)"],"pinyin":["zhi3 sang1 ma4 huai2"],"word":"指桑罵槐"},{"definition":["shameful performance\/disgraceful situation"],"pinyin":["chou3 tai4"],"word":"醜態"},{"definition":["to mention sth without elaborating (idiom); not giving details"],"pinyin":["yu3 yan1 bu4 xiang2"],"word":"語焉不詳"},{"definition":["to make an irrelevant comparison or interpretation (idiom)"],"pinyin":["qian1 qiang3 fu4 hui4"],"word":"牽強附會"},{"definition":["with a will, you can achieve anything (idiom); cf 精誠所至，金石為開|精诚所至，金石为开[jing1 cheng2 suo3 zhi4 , jin1 shi2 wei4 kai1]"],"pinyin":["jing1 cheng2 suo3 zhi4"],"word":"精誠所至"},{"definition":["judge"],"pinyin":["shen3 pan4 zhe3"],"word":"審判者"},{"definition":["fight to the death\/desperate struggle"],"pinyin":["si3 zhan4"],"word":"死戰"},{"definition":["forged book\/book of dubious authenticity\/misattributed book\/Apocrypha"],"pinyin":["wei3 shu1"],"word":"偽書"},{"definition":["the State of Qǐ in modern Qǐ county 杞縣|杞县, Henan (c. 1500-445 BC), a small vassal state of Shang and Western Zhou for most of its existence"],"pinyin":["Qi3 guo2"],"word":"杞國"},{"definition":["to plot and kill sb for his property (idiom); to murder for money"],"pinyin":["mou2 cai2 hai4 ming4"],"word":"謀財害命"},{"definition":["to run a newspaper\/to publish a newspaper"],"pinyin":["ban4 bao4"],"word":"辦報"},{"definition":["to think for oneself and act accordingly (idiom); to act on one's own initiative"],"pinyin":["zi4 zuo4 zhu3 zhang1"],"word":"自作主張"},{"definition":["transition"],"pinyin":["guo4 du4 shi2 qi1"],"word":"過渡時期"},{"definition":["omniscient"],"pinyin":["wu2 suo3 bu4 zhi1"],"word":"無所不知"}]}