{"definition":["should\/to deserve"],"pinyin":["gai1 dang1"],"simplified":["该当"],"rank":50174.0,"normalized_rank":0.7019993564003191,"fraction":1.4130634280235035e-7,"cumulative_fraction":0.9989848037032032,"word":"該當","characters":[{"definition":["should\/ought to\/probably\/must be\/to deserve\/to owe\/to be sb's turn to do sth\/that\/the above-mentioned"],"pinyin":["gai1"],"word":"該"},{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"}],"containing_words":[],"sentences":[{"english":"The children should be allowed to go to the movies with friends on Friday nights.","chinese":"孩子們該當被容許星期五早晨和冤家們一同去看影戲。"},{"english":"I think you should go ahedeal.","chinese":"我以爲你該當開始幹了。"},{"english":"I think we should get this in writing.","chinese":"我認爲我們該當把這個寫上去。"},{"english":"You ought to pay us the credit interest once payment is wrongly refused.","chinese":"若是拒付錯了，你們該當償付我方的銀行利錢。"},{"english":"When should we pray?","chinese":"什麼時候該當祈禱？"},{"english":"Their parents should encourage and help them, and in no wise hinder them from following God's call.","chinese":"該當勉勵相幫他們，萬不可阻撓兒童隨天主的聖召。"},{"english":"Singaporeans should help immigrhelpless ishs integrdined on into society. Cla connections! for exa triingod!","chinese":"新加坡人該當幫助新移民融入社會。"},{"english":"It was all he would have allday and he knew that he should take it.","chinese":"這是他今兒一成天的飲食，他知道該當把它喝了。"},{"english":"You ought to pay us the prohilittlek interest once payment is wrongly refused.","chinese":"萬一拒付錯了，你們該當償付我方的銀行利錢。"},{"english":"Whoever violingesteds the disciplines should be criticized.","chinese":"誰違抗了紀律，誰就該當遭到月旦。"},{"english":"Xuehai boundless, no individual shall find suitable opportunity.","chinese":"學海茫茫，沒團體都該當找到合適本人的機會。"},{"english":"We shouldn't spend too much time on it.","chinese":"但是我們不該當在因特網上花消太多的時間。"},{"english":"I see no objection whconsumedver-but you should open the L\/C right now.","chinese":"我看沒有什麼可抗議的，不過您該當登時開證。"},{"english":"Be careful whom you appoint to the position of manager.","chinese":"你該當心你所任命的那個經理。"},{"english":"In fact, we should also take care not to cough or sneeze in public .","chinese":"究竟上，我們還該當把穩不在公共園地咳嗽或打噴嚏。"},{"english":"Here we should use an fwisling tone.","chinese":"這裏我們該當用降調。"}],"related":[]}