{"definition":["to recognize\/to remember sth (or sb) on seeing it\/to know"],"pinyin":["ren4 de5"],"simplified":["认得"],"rank":25219.0,"normalized_rank":0.3528465294586767,"fraction":0.0000014497038123658483,"cumulative_fraction":0.984611623362588,"word":"認得","characters":[{"definition":["to recognize\/to know\/to admit"],"pinyin":["ren4"],"word":"認"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[],"sentences":[{"english":"About a month after her arrival, she taught me the word \"water\".","chinese":"她來後約莫一個月，就教我認得了“水”這個詞。"},{"english":"After two classes, I started to recognize several of the faces in each class.","chinese":"兩節課下來，每個班上我都已經認得好幾張面孔了。"},{"english":"He got one apostle to say he did not even know Christ.","chinese":"他曾抓住一個使徒，叫他說他不認得主。"},{"english":"They look exactly the same. How can you tell which is which?","chinese":"他們看起來完全一樣，你怎麼認得出誰是誰啊？"},{"english":"She couldn't recognize her face. Then she would start crying at times and laughing at times,\" Pillai says.","chinese":"她不認得自己的臉，還時而哭時而笑，”皮拉伊說。"},{"english":"Can you recognize the car thief?","chinese":"你認得出竊車者嗎？"},{"english":"I boasted among men that I had known you.","chinese":"我在人前誇說我認得你。"},{"english":"Monsieur Defarge alighted; knowing one or two of the soldiery there, and one of the police.","chinese":"德伐日認得那兒的兩個士兵和一個警察。"},{"english":"They also knew his cowboy hat, which he wore every day.","chinese":"馬也認得他的每天戴着的牛仔帽。"},{"english":"The teacher flashed up each word to see if the children would recognize it.","chinese":"老師把每一個單詞舉起晃了一晃，看孩子們是否認得。"},{"english":"'You recognize me?I have changed a lot, 'she answered.","chinese":"“你認得出我？我變了許多，”她回答。"},{"english":"Many of those who joined in it, uninvited, we did not even know.","chinese":"許多不請自來的參加者，我們連認都不認得。"},{"english":"I recognize the shop.","chinese":"我認得那家商店。"},{"english":"Lest I should know you too easily, you play with me.","chinese":"只恐我太輕易地認得你，你對我耍花招。"},{"english":"I may not evermore acknowledge thee.","chinese":"我今後未必還認得你。"},{"english":"Recognize this transparent body, the wisdom of the leaves fall in the world?","chinese":"認得這透明體，智慧的葉子掉在人間？"}],"related":[]}