{"definition":["corpus"],"pinyin":["yu3 liao4"],"simplified":["语料"],"rank":55884.0,"normalized_rank":0.7818896646286009,"fraction":7.342674631155188e-8,"cumulative_fraction":0.9995817505966464,"word":"語料","characters":[{"definition":["dialect\/language\/speech","to tell to"],"pinyin":["yu3","yu4"],"word":"語"},{"definition":["material\/stuff\/grain\/feed\/to expect\/to anticipate\/to guess"],"pinyin":["liao4"],"word":"料"}],"containing_words":[{"definition":["text corpus"],"pinyin":["yu3 liao4 ku4"],"word":"語料庫"}],"sentences":[{"english":"Utilizing a data-based research, this paper makes a contrastive study of metaphorical expressions in English and Chinese.","chinese":"本文運用語料調查的方法對比研究英漢隱喻運動表達。"},{"english":"This paper comments on the effect of corpus empirical studies on lexicology.","chinese":"論述了語料庫實證研究對詞彙學的影響和作用。"},{"english":"Chapter V is the corpus transcription.","chinese":"第五章是語料標音。"},{"english":"It is a corpus-based study.","chinese":"本文是一項基於語料庫的研究。"},{"english":"This paper first explores unsupervised part-of-speech tagging for Chinese via monolingual corpus.","chinese":"本文首先探索了基於單語料庫的無監督中文詞性標註。"},{"english":"The explanatory power of this criterion is tested against an alternative scenario-based account.","chinese":"在具體語料的分析中，這一標準與場景理論形成對照。"},{"english":"Corpus, non caro\" is his own description of the angelic body.\"","chinese":"“語料庫，非卡羅”是他自己的描述天使機構。"},{"english":"This contains the linguistic corpora that are analyzed and processed in the book.","chinese":"包含本書中分析和處理的語言語料庫。"},{"english":"This paper comments on the of effect of corpus empirical studies on lexicology.","chinese":"論述了語料庫實證研究對詞彙學的影響和作用。"},{"english":"Appendix contains Linying dialect vocabulary and classification of recorded sound corpus.","chinese":"附錄包含有臨潁方言分類詞表和語料記音。"},{"english":"Since the massive homogeneous news has been the treasure house of language materials in studying synonymous texts.","chinese":"大量存在的同質新聞是同義語篇研究的語料寶庫。"},{"english":"I close my eyes to the world, Kiss my skinless corpus.","chinese":"我閉上眼睛世界，親親我去皮語料庫。"},{"english":"This study is to extract the unknown words from the corpus of Tang Poetry .","chinese":"此項研究的基礎是唐詩語料中未登錄詞的提取。"},{"english":"So the study of emotional feature extraction based on merge-database is significative.","chinese":"因此，對特徵的混合語料庫研究是有現實意義的。"},{"english":"It turns out that Corpora have great advantages in lexicography.","chinese":"語料庫在詞典編纂中具有強大的優勢。"},{"english":"Besides, it improves the way of the automatic words segmentation.","chinese":"另外，對語料庫構建過程中的自動分詞技術進行改進。"}],"related":[]}