{"definition":["text corpus"],"pinyin":["yu3 liao4 ku4"],"simplified":["语料库"],"rank":58574.0,"normalized_rank":0.8195262546695955,"fraction":5.1530102282262055e-8,"cumulative_fraction":0.9997486062356522,"word":"語料庫","characters":[{"definition":["dialect\/language\/speech","to tell to"],"pinyin":["yu3","yu4"],"word":"語"},{"definition":["material\/stuff\/grain\/feed\/to expect\/to anticipate\/to guess"],"pinyin":["liao4"],"word":"料"},{"definition":["warehouse\/storehouse\/(file) library"],"pinyin":["ku4"],"word":"庫"}],"containing_words":[],"sentences":[{"english":"This paper comments on the effect of corpus empirical studies on lexicology.","chinese":"論述了語料庫實證研究對詞彙學的影響和作用。"},{"english":"It is a corpus-based study.","chinese":"本文是一項基於語料庫的研究。"},{"english":"This paper first explores unsupervised part-of-speech tagging for Chinese via monolingual corpus.","chinese":"本文首先探索了基於單語料庫的無監督中文詞性標註。"},{"english":"Corpus, non caro\" is his own description of the angelic body.\"","chinese":"“語料庫，非卡羅”是他自己的描述天使機構。"},{"english":"This contains the linguistic corpora that are analyzed and processed in the book.","chinese":"包含本書中分析和處理的語言語料庫。"},{"english":"This paper comments on the of effect of corpus empirical studies on lexicology.","chinese":"論述了語料庫實證研究對詞彙學的影響和作用。"},{"english":"I close my eyes to the world, Kiss my skinless corpus.","chinese":"我閉上眼睛世界，親親我去皮語料庫。"},{"english":"So the study of emotional feature extraction based on merge-database is significative.","chinese":"因此，對特徵的混合語料庫研究是有現實意義的。"},{"english":"It turns out that Corpora have great advantages in lexicography.","chinese":"語料庫在詞典編纂中具有強大的優勢。"},{"english":"Besides, it improves the way of the automatic words segmentation.","chinese":"另外，對語料庫構建過程中的自動分詞技術進行改進。"},{"english":"As TED translates hundreds of talks, they’re creating “parallel corpora”, the raw material for machine translation systems.","chinese":"平行的語料庫，這是機器翻譯系統的原始資料。"},{"english":"This paper describes a corpus for speech synthesis.","chinese":"本文介紹了一個語音合成語料庫。"},{"english":"The annotated corpus of Song Dynasty poetry is the foundation of the computer-based study of Song Dynasty poetry.","chinese":"全宋詞切分語料庫的建立是計算機研究宋詞的基礎。"},{"english":"In conclusion, some suggestions concerning the pedagogical implications of corpus-based study to English teaching in China are made.","chinese":"並探討了基於語料庫的研究對英語教學所帶來的啓示。"}],"related":[]}