{"definition":["discourse\/text"],"pinyin":["yu3 pian1"],"simplified":["语篇"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"語篇","characters":[{"definition":["dialect\/language\/speech","to tell to"],"pinyin":["yu3","yu4"],"word":"語"},{"definition":["sheet\/piece of writing\/bound set of bamboo slips used for record keeping (old)\/classifier for written items: chapter, article"],"pinyin":["pian1"],"word":"篇"}],"containing_words":[],"sentences":[{"english":"Contrastive Rhetoric (CR) studies the differences of discourse patterns across languages and cultures.","chinese":"對比修辭研究不同語言及文化間的語篇模式差異。"},{"english":"Finally, the cohesion and coherence of discourse also have an impact on the translation of polysemic words.","chinese":"同時，語篇的銜接與連貫也作用於多義詞的翻譯。"},{"english":"This thesis carries on a research of Martin's classification of textual grammatical metaphor(TGM).","chinese":"本文對馬丁的語篇語法隱喻分類進行了探討。"},{"english":"Meanwhile, it is found that discourse errors are very small in quantity.","chinese":"同時還發現，語篇錯誤在數量上非常少。"},{"english":"This article sets out to examine the discourse_organizing power of semi_content words in the English language.","chinese":"本文旨在探討英語語言中準實義詞的語篇構架功能。"},{"english":"Anaphora is an important grammatical device of textual cohesion.","chinese":"回指是語篇銜接的重要語法手段之一。"},{"english":"Discourse analysis has become one of the mainstreams in linguistics.","chinese":"語篇分析現在已成爲語言學的主流研究領域之一。"},{"english":"Informativeness is a primary norm measuring the quality of a text.","chinese":"語篇信息性是衡量語篇質量的重要指標之一。"},{"english":"Informativeness is a primary norm measuring the quality of a text.","chinese":"語篇信息性是衡量語篇質量的重要指標之一。"},{"english":"Transformational synonymy and lexical synonymy show important synonymous relationships in discourse analysis.","chinese":"同義關係句在語篇分析中是一個重要內容。"},{"english":"Three experiments were carried out to investigate the role accentuation plays in spoken discourse comprehension.","chinese":"用三個實驗探索了重讀在口語語篇理解加工中的作用。"},{"english":"Theme and rheme theory is a functional system for studying textual Coherence and cohesion.","chinese":"主述位理論又是研究語篇銜接與連貫的一大功能系統。"},{"english":"Chapter two discusses explicit coherence: cohesion.","chinese":"第三章探討語篇的語義連貫。"},{"english":"The textual function of the passives in the legislative texts is the focus of the thesis.","chinese":"被動語態在立法文本中的語篇功能研究是本文的重點。"},{"english":"This paper discusses the pragmatic macrostructure in discourse and its related notions.","chinese":"本文討論語篇中的語用宏觀結構理論及其相關的概念。"},{"english":"The evident difference between English and Chinese is hypotaxis and parataxis.","chinese":"語篇的形合與意合是英漢語言之間最明顯的區別特徵。"}],"related":[]}