{"definition":["to have the final say\/to be the one in charge"],"pinyin":["shuo1 le5 suan4"],"simplified":["说了算"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"說了算","characters":[{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly"],"pinyin":["le5","liao3"],"word":"了"},{"definition":["to regard as\/to figure\/to calculate\/to compute"],"pinyin":["suan4"],"word":"算"}],"containing_words":[],"sentences":[{"english":"Shanghai property market with high prices of 14 major suspenseful who say that low?","chinese":"上海樓市14大懸疑之房價高與低該誰說了算？"},{"english":"Pucci: heresy is what *I* say it is.","chinese":"誰是異端我說了算。"},{"english":"At the bank, Bill is second in command.","chinese":"彼爾是繼佛蘭克之後第二個說了算的人。"},{"english":"As the host, you decide the theme.","chinese":"作爲主人，主題你說了算。"},{"english":"Land disputes became overheated and were frequently resolved at the point of a gun.","chinese":"土地爭端變得火爆異常，而且基本上是槍桿子說了算。"},{"english":"Zi Chan smiled, \"I am the boss here.","chinese":"子產笑了，“這裏我說了算。"},{"english":"Isn't she? Wahtever you say, chef.","chinese":"對吧？你說了算數。"},{"english":"Sheldon: Whoo, boy, you are all over the place this morning.","chinese":"哇，小子，今早什麼話都是你說了算啊。"},{"english":"As we are constantly told, first impressions count.","chinese":"就如我們一直被告知的一樣，第一印象說了算。"},{"english":"I repeat I do not control the market.","chinese":"我重申這個市場不由我說了算。"},{"english":"In reality, however, they were to have absolute say in everything.","chinese":"然而，實際上在所有事務上都由他們說了算。"},{"english":"However, parents need to have the final say about rules.","chinese":"但是，父母對所立的規矩要最後說了算。"},{"english":"Laszlo added that Lafferty had “the last word” in what he spent.","chinese":"拉斯洛補充說錢該怎麼花還是拉弗蒂“說了算”。"},{"english":"Whatever you say. I'm too nervous to think.","chinese":"你說了算，我太緊張了，無法思考。"},{"english":"Zi Chan smiled, \"I am the boss here.\"","chinese":"子產笑了，“這裏我說了算。"},{"english":"Its time we stand up to those people and change the rules around here.","chinese":"該是我們挺起來面對這些人，是我們說了算的時候了。"}],"related":[]}