{"definition":["in the final analysis\/in the end"],"pinyin":["shuo1 dao4 di3"],"simplified":["说到底"],"rank":13664.0,"normalized_rank":0.19117708785135645,"fraction":0.0000048800320659943926,"cumulative_fraction":0.953035350771418,"word":"說到底","characters":[{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["(equivalent to 的 as possessive particle)","background\/bottom\/base\/end (of the month, year etc)\/remnants\/(math.) radix\/base"],"pinyin":["de5","di3"],"word":"底"}],"containing_words":[],"sentences":[{"english":"After all, this is male chauvinism at play in.","chinese":"說到底，這也是大男人主義在作怪了。"},{"english":"Ultimately, though, trying to muscle China into revaluing the yuan would be a mistake.","chinese":"不過說到底，強迫中國使人民幣升值終將是一個錯誤。"},{"english":"After all,once I'm dead,I don't exist.","chinese":"說到底，一旦我死了，我就不存在。"},{"english":"After all,my body's still functioning until star two.","chinese":"說到底，我的身體一直運作到了星號二。"},{"english":"A phobia, after all, is an irrational fear.","chinese":"恐懼症說到底是一種非理性的恐懼。"},{"english":"Leading officials' style of work is essentially the question of Party spirit.","chinese":"領導幹部作風問題，說到底是黨性問題。"},{"english":"But reduced to its essence meditation is all about the breath.","chinese":"但是說到底，冥想支與呼吸有關。"},{"english":"Who, Ithought, needs laudanum?","chinese":"所以說到底是誰需要鴉片酒呢？"},{"english":"But what exactly is the differentiator between experts and non-experts?","chinese":"但是說到底，究竟專家和非專家之間的區別是什麼？"},{"english":"Tell me the reason. How can I drill in high quality and speed?","chinese":"你說說到底咋回事，到底怎樣才能優質高速？"},{"english":"The bottom line was that Dodi paid his wages.","chinese":"說到底，他的工資是由多迪付給的。"},{"english":"To say it explicitly, impermanence rules all phenomena.","chinese":"萬法說到底竟皆無常。"},{"english":"Cartoon in the final analysis, is artificial life.","chinese":"卡通說到底，是人工化的生活。"},{"english":"After all, you're not meditating to get to the breath.","chinese":"說到底，你作禪定非爲理解呼吸。"},{"english":"After all, I must have prayed to the Lord far more than that taxi - driver.","chinese":"說到底，我畢竟比那出租車司機向上帝祈禱的次數多。"},{"english":"So what are the benefits of embarking on such an undertaking as I have done?","chinese":"那麼說到底，我來這裏所從事的事業究竟有何益處呢？"}],"related":[]}