{"definition":["folk art consisting of storytelling to music"],"pinyin":["shuo1 shu1"],"simplified":["说书"],"rank":33131.0,"normalized_rank":0.4635456745904048,"fraction":7.145604834891579e-7,"cumulative_fraction":0.992818195195268,"word":"說書","characters":[{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"},{"definition":["abbr. for 書經|书经[Shu1 jing1]","book\/letter\/document\/CL:本[ben3],冊|册[ce4],部[bu4]\/to write"],"pinyin":["Shu1","shu1"],"word":"書"}],"containing_words":[],"sentences":[{"english":"I know radio began by restoring the ancient art of storyteller .","chinese":"我知道，廣播的開始是藉助於說書人這種古老藝術。"},{"english":"Second, I want to read some books I like, such as the fiction books.","chinese":"其次，我想讀一些我喜歡的書籍，比如小說書。"},{"english":"AMUSE】The storyteller's jokes amused the children.","chinese":"說書人的笑話逗樂了孩子。"},{"english":"\"Red\" pious, boasts many followers of the \"nine\" music.","chinese":"“說書紅”弟子很多，號稱有“高門九英”之說。"},{"english":"He was our storyteller.","chinese":"他是我們的說書人。"},{"english":"The story breathes with the teller's breath.","chinese":"故事與說書人一同呼吸。"},{"english":"What are you, like a clich movie bitch?","chinese":"你覺得自己是誰，一個說書的婊子？"},{"english":"In their time, they were better known as academics that storytellers .","chinese":"在他們年代，他們是以語言學者聞名而非說書人。"},{"english":"I like reading Novel books and Science book.","chinese":"我喜歡閱讀小說書和科學書。"},{"english":"This is my own disappointment, not suitable for storytelling.","chinese":"這是我對自己的失望，不宜用來說書。"},{"english":"It developed into an independent art form in the early years of the Qing Dynasty (late 17thcentury).","chinese":"評書作爲一種獨立的說書品種，大約形成於清代初期。"},{"english":"Which of these novels do you like best?","chinese":"這些小說書你最喜歡哪一本？"},{"english":"Story-telling is a folk art much loved by the Chinese.","chinese":"說書是中國人喜聞樂見的民間藝術。"},{"english":"But first we want to tell you a story about a group of storytellers .","chinese":"首先我們想告訴你們一個關於一羣說書人的故事。"},{"english":"Books and recordings, they assumed, were destined to take the place of storytellers.","chinese":"書和唱片，他們推測，註定會取代說書人。"},{"english":"A storyteller once came to the marketplace, and I sneaked off to listen to him.","chinese":"有一段時間，集市上來了一個說書人。"}],"related":[{"definition":["lit. to quote the classics\/to quote chapter and verse (idiom)"],"pinyin":["yin3 jing1 ju4 dian3"],"word":"引經據典"},{"definition":["calligraphy society\/village school (old)\/literary society (old)"],"pinyin":["shu1 hui4"],"word":"書會"},{"definition":["to talk about this and that (idiom); to ramble incoherently"],"pinyin":["dong1 la1 xi1 che3"],"word":"東拉西扯"},{"definition":["lit. an easy drive on a familiar path (idiom); fig. experience makes progress easy\/a task that is so familiar one can do it with one's hand tied behind one's back"],"pinyin":["jia4 qing1 jiu4 shu2"],"word":"駕輕就熟"},{"definition":["to speak without thinking (idiom)\/to blurt sth out"],"pinyin":["xin4 kou3 kai1 he2"],"word":"信口開河"},{"definition":["to attend an opera\/to see an opera"],"pinyin":["ting1 xi4"],"word":"聽戲"},{"definition":["frightening words to scare people (idiom); alarmist talk\/reds under the beds"],"pinyin":["wei1 yan2 song3 ting1"],"word":"危言聳聽"},{"definition":["to speak forcefully and with justice (idiom); to argue with the courage of one's convictions"],"pinyin":["zhen4 zhen4 you3 ci2"],"word":"振振有詞"},{"definition":["to drag sb before a public meeting to denounce, humiliate and physically abuse them (esp. during the Cultural Revolution)"],"pinyin":["pi1 dou4"],"word":"批鬥"},{"definition":["social connections\/stratagem\/method\/approach\/movement (martial arts)\/(sb's) background story"],"pinyin":["lu4 shu4"],"word":"路數"},{"definition":["(of an uneducated person) to mingle with the cognoscenti\/to pose as a culture lover\/to be a culture snob\/having pretensions to culture"],"pinyin":["fu4 yong1 feng1 ya3"],"word":"附庸風雅"},{"definition":["writings in the vernacular"],"pinyin":["bai2 hua4 wen2"],"word":"白話文"},{"definition":["unheard of\/an extremely rare and unprecedented event"],"pinyin":["wen2 suo3 wei4 wen2"],"word":"聞所未聞"},{"definition":["tied up in a bundle on a high shelf\/to put sth on the back burner\/no longer a high priority"],"pinyin":["shu4 zhi1 gao1 ge2"],"word":"束之高閣"},{"definition":["to smash"],"pinyin":["za2 lan4"],"word":"砸爛"},{"definition":["united front (abbr. for 統一戰線|统一战线[tong3 yi1 zhan4 xian4])"],"pinyin":["tong3 zhan4"],"word":"統戰"}]}