{"definition":["to persuade\/to convince\/to talk sb over\/Taiwan pr. [shui4 fu2]"],"pinyin":["shuo1 fu2"],"simplified":["说服"],"rank":7504.0,"normalized_rank":0.10499069578722037,"fraction":0.000013234331651302769,"cumulative_fraction":0.9035553508359458,"word":"說服","characters":[{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"},{"definition":["classifier for medicine: dose\/Taiwan pr. [fu2]","clothes\/dress\/garment\/to serve (in the military, a prison sentence etc)\/to obey\/to be convinced (by an argument)\/to convince\/to admire\/to acclimatize\/to take (medicine)\/mourning clothes\/to wear mourning clothes"],"pinyin":["fu2","fu4"],"word":"服"}],"containing_words":[{"definition":["persuasiveness"],"pinyin":["shuo1 fu2 li4"],"word":"說服力"},{"definition":["convincing"],"pinyin":["you3 shuo1 fu2 li4"],"word":"有說服力"}],"sentences":[{"english":"The papal captain have vainly endeavoured to induce his wife to remain behind him .","chinese":"教廷的隊長曾白費力氣地試圖說服妻子留下不去。"},{"english":"Despite all my efforts to persuade him, he wouldn't agree.","chinese":"儘管我盡力說服他，可他就是不同意。"},{"english":"Don't let the devil convince you otherwise.","chinese":"不要讓魔鬼用別的方式說服你。"},{"english":"I lurk at the end of the queue and persuade him to go for coffee.","chinese":"我悄悄跟在隊伍的末尾並說服了他出去喝杯咖啡。"},{"english":"Dissenters must be consistent, though, otherwise they'll fail to convince the majority.","chinese":"反對者必須堅持一致，否則就不能成功說服大多數人。"},{"english":"A defense lawyer says Jufer was intoxicated at the time of his crime.","chinese":"律師以他那富有感染力的辯護說服了陪審團。"},{"english":"Flattery is the best persuader of people.","chinese":"奉承是最好的說服者。"},{"english":"The 'what if' device is often facile, rarely convincing.","chinese":"“假如”式分析方法常常是膚淺的，很少有說服力。"},{"english":"She tried to convince the woman to wait for the police.","chinese":"她開始嘗試說服那個女人跟她一起等警察來。"},{"english":"People who are perceived as experts have a greater ability to persuade others.","chinese":"被冠以專家名號的人物在說服他人方面確實技高一籌。"},{"english":"Eagleburger says the U. S. can try to persuade the North Koreans to come back to the negotiating table.","chinese":"伊格爾伯格說，美國有能力試圖說服北韓重返談判桌。"},{"english":"She persuaded me into buying it.","chinese":"她說服我買下了它。"},{"english":"Mitchell failed Tuesday to persuade Mr. Abbas to engage in direct talks with Israel.","chinese":"米切爾星期二沒能說服阿巴斯與以色列開展直接對話。"},{"english":"Chinese policeman tries to convince a knife-wielding man to release a hostage on a street in Guangzhou, China.","chinese":"警察試圖說服揮舞刀具的男子釋放人質。"},{"english":"Sometimes salesmen need to do a lot of fast talking to convince clients to buy.","chinese":"有時候業務員需要快言快語去說服客戶購買。"},{"english":"Of the modes of persuasion furnished by the spoken word there are three kinds.","chinese":"使用語言的說服性論證共有三種類型。"}],"related":[{"definition":["to refuse\/to decline\/to reject"],"pinyin":["ju4 jue2"],"word":"拒絕"},{"definition":["to approve of\/to endorse\/to acknowledge\/to recognize\/to identify oneself with"],"pinyin":["ren4 tong2"],"word":"認同"},{"definition":["to renounce\/to abandon\/to give up"],"pinyin":["fang4 qi4"],"word":"放棄"},{"definition":["explanation\/to explain\/to interpret\/to resolve\/CL:個|个[ge4]"],"pinyin":["jie3 shi4"],"word":"解釋"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"認為"},{"definition":["to fight against\/to oppose\/to be opposed to\/opposition"],"pinyin":["fan3 dui4"],"word":"反對"},{"definition":["to fight for\/to strive for\/to win over"],"pinyin":["zheng1 qu3"],"word":"爭取"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或許"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"畢竟"},{"definition":["to persuade\/persuasion\/to advise"],"pinyin":["quan4 shuo1"],"word":"勸說"},{"definition":["to join\/to connect\/to link up\/to communicate"],"pinyin":["gou1 tong1"],"word":"溝通"},{"definition":["whatever the case\/in any event\/no matter what\/by all possible means"],"pinyin":["wu2 lun4 ru2 he2"],"word":"無論如何"},{"definition":["to change\/to alter\/to transform"],"pinyin":["gai3 bian4"],"word":"改變"},{"definition":["final\/ultimate"],"pinyin":["zui4 zhong1"],"word":"最終"},{"definition":["to yield\/to permit\/to let sb do sth\/to have sb do sth\/to make sb (feel sad etc)\/by (indicates the agent in a passive clause, like 被[bei4])"],"pinyin":["rang4"],"word":"讓"},{"definition":["to try\/to attempt\/CL:次[ci4]"],"pinyin":["chang2 shi4"],"word":"嘗試"}]}