{"definition":["to speak frankly"],"pinyin":["shuo1 bai2 le5"],"simplified":["说白了"],"rank":18488.0,"normalized_rank":0.2586711065717124,"fraction":0.0000027967853530477584,"cumulative_fraction":0.9709213911744928,"word":"說白了","characters":[{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"},{"definition":["surname Bai","white\/snowy\/pure\/bright\/empty\/blank\/plain\/clear\/to make clear\/in vain\/gratuitous\/free of charge\/reactionary\/anti-communist\/funeral\/to stare coldly\/to write wrong character\/to state\/to explain\/vernacular\/spoken lines in opera"],"pinyin":["Bai2","bai2"],"word":"白"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly"],"pinyin":["le5","liao3"],"word":"了"}],"containing_words":[],"sentences":[{"english":"To be frank, big restaurants and big hotels are the main places producing drainage oil.","chinese":"說白了，大酒樓大賓館是地溝油的主要產地。"},{"english":"Let me be clear about it .","chinese":"讓我把話說白了吧。"},{"english":"What this does is hides the cost from the consumer.","chinese":"說白了，這樣做就是向消費者隱瞞這筆開支。"},{"english":"Force management in the final analysis is a man's job.","chinese":"管理說白了就是如何去管人。"},{"english":"In fact, Tapas is just some bread with some antipastos.","chinese":"其實說白了，就是一些麪包，加些小菜。"},{"english":"That means theoretical speed, no average speed and you can this speed is \" can max\".","chinese":"說白了，僅僅指有這個理論速度而已。"},{"english":"More broadly, the fight was over the Liberal Party's future direction.","chinese":"說白了，這場鬥爭是自由黨未來的發展方向之爭。"},{"english":"White said the old society is a bawd , a new era of MB manager.","chinese":"說白了就是舊社會的鴇母，新時代的MB經理人。"},{"english":"John is a coward, in so many words.","chinese":"說白了，約翰是個懦夫。"},{"english":"Express it is a word, fast.","chinese":"快運說白了就一個字，快。"},{"english":"They simply strengthen readers' sense of grievance.","chinese":"說白了，它們就是幫讀者出惡氣的。"},{"english":"Say white, be foster sensibilities Bai in advance.","chinese":"說白了，就是提前培養感情唄。"},{"english":"It means will put money on the line.","chinese":"說白了就是會放錢就行了。"},{"english":"Let's just tell the world that this is BS, and I'm not an old soul.","chinese":"其實說白了就是瞎扯，我可沒什麼古典氣質。"},{"english":"In another word, that is to say, the sword rules, stepping rules and body rules should be acted smoothly.","chinese":"說白了即劍法與步法和身法的協調一致。"},{"english":"Spoken parts in an opera, we still are doing the business that a traditional humanness serves.","chinese":"說白了，我們還是在做一個傳統的爲人服務的企業。"}],"related":[]}