{"definition":["liar"],"pinyin":["shuo1 huang3 zhe3"],"simplified":["说谎者"],"rank":51314.0,"normalized_rank":0.7179494354511494,"fraction":1.2495684859381393e-7,"cumulative_fraction":0.9991363884766924,"word":"說謊者","characters":[{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"},{"definition":["lies\/to lie"],"pinyin":["huang3"],"word":"謊"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"This will make the liar at ease.","chinese":"這樣就會讓說謊者放鬆。"},{"english":"PICKTHAL:The lying, sinful forelock. SHAKIR:A lying, sinful forehead.","chinese":"說謊者，犯罪者的額髮。"},{"english":"Even detectives and psychologists can spot a liar only about 47 percent of the time.","chinese":"就連偵探和心理學家也只能辨認出47%的說謊者。"},{"english":"Test suspected liars by making them read alternate versions of their stories.","chinese":"測試疑似說謊者時，可令他們以不同版本複述謊話。"},{"english":"A liar is not believed when he speaks thetruth.","chinese":"說謊者即使講真話也沒人相信。"},{"english":"Whether they will be cheats and liars is another matter.","chinese":"他們是否會是騙子和說謊者又是另一回事。"},{"english":"B liar is not believed when he speaks the truth.","chinese":"說謊者即使講實話也沒人相信。"},{"english":"\"The best liars are natural manipulators,\" says Sgt.Yarbrough.","chinese":"“最高明的說謊者是天生的操縱者，”亞伯勒中士說。"},{"english":"He labeled the boastful man a liar.","chinese":"他把那個好自誇的男人稱作說謊者。"},{"english":"Satan, by his very nature, is a liar.","chinese":"撒旦是一個很自然的說謊者。"},{"english":"That's why a polygraph can often uncover a liar.","chinese":"這就是測謊儀能找出說謊者的原因。"},{"english":"Liars may noticeably fidget, especially during a pause in the conversation.","chinese":"說謊者會顯得煩躁不安，尤其是在交談的停頓時間裏。"},{"english":"He couldn't deny that without being a bald-faced liar.","chinese":"他無法不需要身爲臉白的說謊者就否認那。"},{"english":"Liars tend to use fewer first-person pronouns.","chinese":"說謊者很少用第一人稱代詞。"}],"related":[]}