{"definition":["excuse\/pretext\/entreaties\/arguments"],"pinyin":["shuo1 ci2"],"simplified":["说辞"],"rank":27037.0,"normalized_rank":0.3782827081555273,"fraction":0.000001233218991729603,"cumulative_fraction":0.9870449920123924,"word":"說辭","characters":[{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"},{"definition":["to resign\/to dismiss\/to decline\/to take leave\/ballad (archaic poetic genre)\/variant of 詞|词[ci2]"],"pinyin":["ci2"],"word":"辭"}],"containing_words":[],"sentences":[{"english":"If Detroit gets money, then everyone would have a case.","chinese":"如果底特律得償所願，那麼每個人都會有一套說辭。"},{"english":"Yet this is all just rhetoric.","chinese":"然而，所有這些不過是說辭而已。"},{"english":"Should America and Europe abandon any pretense of even wanting to promote democracy abroad?","chinese":"美國和歐洲抑或應該放棄任何在海外推動民主的說辭？"},{"english":"Well, this is hugely stereotypical, hugely appropriative.","chinese":"這是個非常明顯的他固有的老套說辭。"},{"english":"What terms shall we find which have not been already exhausted?","chinese":"我們還能找到什麼尚未用盡的說辭呢？"},{"english":"It was a pretty convincing speech, I thought.","chinese":"我認爲這是一個極有說服力的演說辭。"},{"english":"We don't think the president himself composed the speech.","chinese":"我們不認爲是總統本人寫的演說辭。"},{"english":"It could just as well apply to a racketeer or a thief who robs you.","chinese":"這套說辭對騙子和竊賊同樣適用。"},{"english":"First, you’ll need to practice your speech.","chinese":"首先，你需要實際演練你的演講說辭。"},{"english":"Frank was about to sign the loan papers when the bank began to whistle a different tune.","chinese":"當法蘭克要籤貸款合約的時候，銀行就換另一種說辭。"},{"english":"He has recorded whole speeches, but miniature one.","chinese":"他把全部演說辭收錄在案，但是又簡化它。"},{"english":"Sen. Obama dedicated a large portion of his speech to retelling Sen. Biden's personal story.","chinese":"奧巴馬在演說辭中花了大量篇幅介紹拜登的個人經歷。"},{"english":"Now you don't have to be dealing with classic American oratory to run into problems.","chinese":"現在你沒有必要爲美國經典演說辭而苦惱。"}],"related":[]}