{"definition":["lit. to discuss sb's merits and demerits (idiom); to gossip"],"pinyin":["shuo1 chang2 dao4 duan3"],"simplified":["说长道短"],"rank":58476.0,"normalized_rank":0.8181551075231206,"fraction":5.2259990416571706e-8,"cumulative_fraction":0.9997435234406628,"word":"說長道短","characters":[{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"},{"definition":["chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance","length\/long\/forever\/always\/constantly"],"pinyin":["chang2","zhang3"],"word":"長"},{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"},{"definition":["short\/brief\/to lack\/weak point\/fault"],"pinyin":["duan3"],"word":"短"}],"containing_words":[],"sentences":[{"english":"George enjoys talking about people’s private affairs. He is a gossip. (2003.9)","chinese":"喬治喜歡談論別人的私事，他是個愛說長道短的人。"},{"english":"He said that wouldnt be enough. I end up counselling people about it because Ive been through it.","chinese":"由於我是過來人，所以不願對此事說長道短。"},{"english":"Her disheveled appearance when she arrives is meat for Caroline's gossip, but Mrs.","chinese":"她到達時的狼狽相，爲卡羅琳說長道短提供了話柄。"},{"english":"Do you share the view that too many people are talking too much about China?","chinese":"關於中國說長道短的人太多了，你同意這種看法嗎？"},{"english":"I know how people chatter in england .","chinese":"我知道英國人會怎樣說長道短。"},{"english":"She can spend a whole day gossiping with her neighbors.","chinese":"她能一整天都跟鄰居們說長道短。"},{"english":"\"Depression is pretty serious and should not be gossiped about,\" she said.","chinese":"她說“抑鬱症是很嚴肅的事情，不應該被說長道短。”"},{"english":"I don't like lazy people or people who gossip.","chinese":"我不喜歡和懶人或是愛說長道短的人工作。"},{"english":"Two old hens from the neighbored were standing on the corner gossiping .","chinese":"有兩個鄰居老婆子站在街角上說長道短。"},{"english":"There's nothing I like less than gossiping .","chinese":"我最不喜歡的莫過於說長道短了。"},{"english":"Gossiping is a bad habit that we should avoid.","chinese":"說長道短是壞習慣，我們要避免這種惡習。"},{"english":"According to the gossip, Mr. Ede is absolutely furious.","chinese":"據愛說長道短的人說愛德先生肯定是暴跳如雷。"},{"english":"Let's stop gossiping and get back to work.","chinese":"讓我們停止說長道短，回到工作中吧。"},{"english":"Her disheveled appearance when she arrives is meat for Caroline's gossip.","chinese":"她到達時的狼狽相，爲卡羅琳說長道短提供了話柄。"},{"english":"Three old hens are standing on the corner gossiping.","chinese":"有三個老婆子正站在街角上說長道短。"},{"english":"Three oldhens from the neighbored were standing on the cornergossiping.","chinese":"有三個鄰居老婆子站在街角上說長道短。"}],"related":[]}