{"definition":["who would have thought\/unexpectedly"],"pinyin":["shei2 zhi1"],"simplified":["谁知"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"誰知","characters":[{"definition":["who\/also pr. [shui2]"],"pinyin":["shei2"],"word":"誰"},{"definition":["to know\/to be aware"],"pinyin":["zhi1"],"word":"知"}],"containing_words":[{"definition":["God knows...\/Who would have imagined...?"],"pinyin":["shei2 zhi1 dao4"],"word":"誰知道"}],"sentences":[{"english":"See, I stopped at the red traffic light, and I swear it never turned green!","chinese":"紅燈亮了，我踩了腳剎車，誰知道那燈再沒變綠過。"},{"english":"Was this a lover, or a lecher whether?","chinese":"誰知這究竟是戀愛，還是瞎胡鬧？"},{"english":"Who would have thought things are unpredictable, they are also very pick.","chinese":"誰知世事難料，她們也都很挑。"},{"english":"Who knows Luo Kai its pharmacodynamics action and concerned content?","chinese":"洛凱誰知道它的藥理作用和有關內容？"},{"english":"Who knows whether the Obama administration would approve this deal.","chinese":"誰知道在奧巴馬政府會不會批准這一交易。"},{"english":"No one can be sure what he would do in such circumstances.","chinese":"在這樣的境況下，沒有誰知道他將做什麼。"},{"english":"Who knows, we may want to revisit this format in the future.","chinese":"又有誰知道呢，這種形式以後可能還會被我們用到。"},{"english":"It was sunny when I went out. Who knows why it changed all of a sudden.","chinese":"出去的時候天還好好兒的，誰知道說變就變了。"},{"english":"It was 3900. However, the East China Airline which I think would be cheaper cost 3500 RMB.","chinese":"我想東方航空應該會便宜一點，誰知道也要3500。"},{"english":"Who knows what might be under the thousands of acres that are left?","chinese":"誰知道在剩下的幾千英畝下還會有些什麼？"},{"english":"However, a black bear monster came out unexpectedly. He concealed the cassock under the shield of the fire.","chinese":"可誰知這時來了只黑熊怪，他趁火劫走了袈裟。"},{"english":"Who know the name of this song? Thanks!","chinese":"誰知道該英文歌曲名？"},{"english":"Who knew eating sensibly could make you feel so good?","chinese":"有誰知道明智的飲食能讓人感覺這麼好呀？"},{"english":"Who knows what hidden messages in Chinese characters are molded into other shoe soles.","chinese":"誰知道其它鞋底壓膜的漢字隱藏了啥意思不。"},{"english":"Who knows the interactive website system to do question how to do it?","chinese":"誰知道網頁上的交互做題系統是怎麼做的？"},{"english":"Who know that the quilt distance Anne's friendship saw.","chinese":"誰知道被程安雅看見了。"}],"related":[{"definition":["(final particle, same as 吧)","to stop\/to cease\/to dismiss\/to suspend\/to quit\/to finish"],"pinyin":["ba4","ba5"],"word":"罷"},{"definition":["unintentionally\/not in the mood to"],"pinyin":["wu2 xin1"],"word":"無心"},{"definition":["late\/delayed\/slow","surname Chi"],"pinyin":["Chi2","chi2"],"word":"遲"},{"definition":["how? (emphatic question)","old variant of 愷|恺[kai3]\/old variant of 凱|凯[kai3]"],"pinyin":["kai3","qi3"],"word":"豈"},{"definition":["but\/yet\/however\/while\/to go back\/to decline\/to retreat\/nevertheless\/even though"],"pinyin":["que4"],"word":"卻"},{"definition":["to startle\/to be frightened\/to be scared\/alarm"],"pinyin":["jing1"],"word":"驚"},{"definition":["now\/this moment"],"pinyin":["ci3 shi2"],"word":"此時"},{"definition":["not to see\/not to meet\/to have disappeared\/to be missing"],"pinyin":["bu4 jian4"],"word":"不見"},{"definition":["bosom\/heart\/mind\/to think of\/to harbor in one's mind\/to conceive (a child)","surname Huai"],"pinyin":["Huai2","huai2"],"word":"懷"},{"definition":["helpless\/without choice\/for lack of better option\/grudgingly\/willy-nilly\/nolens volens\/abbr. for 無可奈何|无可奈何[wu2 ke3 nai4 he2]"],"pinyin":["wu2 nai4"],"word":"無奈"},{"definition":["mistake\/error\/to miss\/to harm\/to delay\/to neglect\/mistakenly"],"pinyin":["wu4"],"word":"誤"},{"definition":["unmanned\/uninhabited"],"pinyin":["wu2 ren2"],"word":"無人"},{"definition":["alone\/independent\/single\/sole\/only"],"pinyin":["du2"],"word":"獨"},{"definition":["surname Gui","to return\/to go back to\/to give back to\/(of a responsibility) to be taken care of by\/to belong to\/to gather together\/(used between two identical verbs) despite\/to marry (of a woman) (old)\/division on the abacus with a one-digit divisor"],"pinyin":["Gui1","gui1"],"word":"歸"},{"definition":["warp (the vertical threads in weaving)\/vertical\/longitudinal\/north-south (lines of longitude)\/lengthwise\/to release\/to indulge\/even if"],"pinyin":["zong4"],"word":"縱"},{"definition":["a period of time\/a while\/for a short while\/temporary\/momentary\/at the same time"],"pinyin":["yi1 shi2"],"word":"一時"}]}