{"definition":["to transfer\/to maneuver (troops etc)\/movement of personnel\/to mobilize\/to bring into play"],"pinyin":["diao4 dong4"],"simplified":["调动"],"rank":5265.0,"normalized_rank":0.07366418087949296,"fraction":0.000022255603013743315,"cumulative_fraction":0.8650818229568044,"word":"調動","characters":[{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["diao4","tiao2"],"word":"調"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"}],"containing_words":[],"sentences":[{"english":"Engage your core muscles, then curl your upper body towards a sitting position.","chinese":"調動人體核心部位的肌肉力量向上擡體，成坐姿。"},{"english":"To get that figure, look at the figures before seasonal adjustment.","chinese":"爲了得到這個數字，我們先來看下季節調動的情況。"},{"english":"They emphasize test-first development, heavy customer involvement, and refactoring.","chinese":"它們強調開發中測試第一，積極調動客戶和重構。"},{"english":"The captain applied to headquarters for a transfer.","chinese":"上尉向司令部請求調動。"},{"english":"At present, we must transfer all active factors to resolve the problem of employment.","chinese":"當前我們應調動一切積極因素，打好就業攻堅戰。"},{"english":"It is under the absolute leadership of the Central Military Commission.","chinese":"中央軍委有關軍隊的調動指揮是通過總參來執行的。"},{"english":"The little man got everyone all worked up.","chinese":"這個小個子男人調動了每個人的情緒。"},{"english":"At the same time, Japan speeded up sending troops to Northeast China, then the Russo-Japanese War began.","chinese":"同時，日本加快向中國東北調動部隊，日俄戰爭爆發。"},{"english":"As a Colonel, he was transferred to the high profile Death Star assignment.","chinese":"作爲上校，他被調動到高層的死星赴任。"},{"english":"I think I've jumped out of the frying-pan into the fire by changing jobs.","chinese":"我調動工作真是跳出釜底進火坑。"},{"english":"You have to be able to listen well if you are going to motivate the people who work for you .","chinese":"你要善於聽取意見才能調動你手下工作人員的積極性。"},{"english":"III. Introduce the competition mechanism and fully motivate the employees' initiative for work.","chinese":"引入競爭機制，充分調動員工的工作積極性。"},{"english":"The movement of troops augurs ill for the peace of the area.","chinese":"部隊的調動對這地區的和平是一種凶兆。"},{"english":"To bring your opponent to the net.","chinese":"爲了調動你的對手來到網前。"},{"english":"How should we motivate general publics in disaster-affected area to participate in reconstruction?","chinese":"如何調動基層人民參與災後重建的積極性。"},{"english":"Employees moniter video screens and dispatch agents where they are needed.","chinese":"工作人員監視視頻屏幕並且調動人員到需要的地方去。"}],"related":[{"definition":["to display\/to exhibit\/to bring out implicit or innate qualities\/to express (a thought or moral)\/to develop (an idea)\/to elaborate (on a theme)"],"pinyin":["fa1 hui1"],"word":"發揮"},{"definition":["to arouse\/to excite"],"pinyin":["ji1 fa1"],"word":"激發"},{"definition":["zeal\/initiative\/enthusiasm\/activity"],"pinyin":["ji1 ji2 xing4"],"word":"積極性"},{"definition":["reserves\/to store up"],"pinyin":["chu3 bei4"],"word":"儲備"},{"definition":["to guide\/to lead (around)\/to conduct\/to boot\/introduction\/primer"],"pinyin":["yin3 dao3"],"word":"引導"},{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"word":"協助"},{"definition":["response\/to answer\/to reply"],"pinyin":["ying4 dui4"],"word":"應對"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["to coordinate\/to harmonize\/to fit together\/to match (colors etc)\/harmonious\/concerted"],"pinyin":["xie2 tiao2"],"word":"協調"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落實"},{"definition":["to utilize\/to put sth to use"],"pinyin":["dong4 yong4"],"word":"動用"},{"definition":["suitable\/appropriate"],"pinyin":["shi4 dang4"],"word":"適當"},{"definition":["to appeal\/to demand (an answer)\/requirement\/demand\/claim\/appeal\/(marketing) message"],"pinyin":["su4 qiu2"],"word":"訴求"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"},{"definition":["to adjust\/to regulate\/to harmonize\/to reconcile (accountancy etc)"],"pinyin":["tiao2 jie2"],"word":"調節"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"}]}