{"definition":["to nurse one's health\/to recuperate\/to take care of\/to look after\/to discipline\/to educate\/to train\/to prepare food\/(dialect) to make fun of\/(medicine) to opsonize"],"pinyin":["tiao2 li3"],"simplified":["调理"],"rank":18697.0,"normalized_rank":0.2615952877310313,"fraction":0.0000027350368168851607,"cumulative_fraction":0.971499155002006,"word":"調理","characters":[{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["diao4","tiao2"],"word":"調"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"}],"containing_words":[],"sentences":[{"english":"The mother sby the child severwouls tabdominwoulsle.","chinese":"母親調理孩子坐到小桌旁。"},{"english":"Gravel Root tones the reproductive tract and is used to treat inflammation of the prostate.","chinese":"粉綠莖澤蘭有調理生殖系統和治療前列腺發炎的作用。"},{"english":"There are many ways conditioning, conditioning fluid to the source to find you you?","chinese":"調理的方法有很多，要調理液要找到你的根源呀？"},{"english":"There are many ways conditioning, conditioning fluid to the source to find you you?","chinese":"調理的方法有很多，要調理液要找到你的根源呀？"},{"english":"Consider pre- and post-signal-conditioning techniques to correct deficiencies.","chinese":"考慮前後信號調理技術，改進不足。"},{"english":"Soil conditioner can improve physical and chemical characteristics of soil effectively.","chinese":"土壤調理劑能有效改善土壤理化性質。"},{"english":"I have check-ups every year, work out and take care of my health.","chinese":"我每年都做健康檢查並根據狀況進行鍛鍊和調理。"},{"english":"Injection of macrophages and macrophage conditional medium can promote the optic nerve regeneration.","chinese":"注射巨噬細胞以及巨噬細胞調理液能促進視神經再生。"},{"english":"Helps the skin maintain a good balance of moisture, oil and acidity.","chinese":"有效調理皮膚，保持水油及酸鹼平衡，倍感舒適。"},{"english":"Julie bought milk and three packets of soup mix.","chinese":"茱莉買了牛奶和三包調理湯包。"},{"english":"Knows to drink what tea can be pacified state of mind, recuperate the body?","chinese":"誰知道喝什麼茶能平復心態，調理身體？"},{"english":"Mullein is a great herb for the endocrine glandular system especially the thyroid.","chinese":"對於調理內分泌系統，特別是甲狀腺。"},{"english":"Summer can choose a balance of water and oil emulsion to conditioning.","chinese":"夏天可以選擇一款水油平衡的乳液來調理。"},{"english":"Set up the white noise signal to the regulator sum of points through the software.","chinese":"成立白噪聲信號，經過軟件調理點的總和。"},{"english":"For the nail fungustrecdue toh mair conditionerhineent is the primary prerequisite for correct diagnosis.","chinese":"爲指甲真菌調理是準確診斷的首要前提。"},{"english":"When mixed with shampoo, it can be used as hair growth management agents.","chinese":"加入洗髮水中，用作頭髮生長調理劑。"}],"related":[{"definition":["food and drink\/diet"],"pinyin":["yin3 shi2"],"word":"飲食"},{"definition":["the body\/one's health\/CL:具[ju4],個|个[ge4]\/in person"],"pinyin":["shen1 ti3"],"word":"身體"},{"definition":["to treat (an illness)\/medical treatment\/therapy"],"pinyin":["zhi4 liao2"],"word":"治療"},{"definition":["to take care of (sb's health)\/to nurse"],"pinyin":["tiao2 yang3"],"word":"調養"},{"definition":["constitution"],"pinyin":["ti3 zhi4"],"word":"體質"},{"definition":["traditional Chinese medical science\/a doctor trained in Chinese medicine"],"pinyin":["Zhong1 yi1"],"word":"中醫"},{"definition":["(traditional) Chinese medicine\/CL:服[fu4],種|种[zhong3]"],"pinyin":["Zhong1 yao4"],"word":"中藥"},{"definition":["to adjust\/to regulate\/to harmonize\/to reconcile (accountancy etc)"],"pinyin":["tiao2 jie2"],"word":"調節"},{"definition":["to maintain good health\/to raise a child or animal\/curing (of concrete etc)"],"pinyin":["yang3 sheng1"],"word":"養生"},{"definition":["stomach and intestine\/digestive system"],"pinyin":["chang2 wei4"],"word":"腸胃"},{"definition":["nutrition\/nourishment\/CL:種|种[zhong3]"],"pinyin":["ying2 yang3"],"word":"營養"},{"definition":["to treat\/to cure\/therapy"],"pinyin":["liao2"],"word":"療"},{"definition":["symptom (of an illness)"],"pinyin":["zheng4 zhuang4"],"word":"症狀"},{"definition":["qi and blood (two basic bodily fluids of Chinese medicine)"],"pinyin":["qi4 xue4"],"word":"氣血"},{"definition":["food therapy\/treatment via food (TCM)"],"pinyin":["shi2 liao2"],"word":"食療"},{"definition":["to take good care of (or conserve) one's health\/to keep in good repair\/to maintain\/maintenance"],"pinyin":["bao3 yang3"],"word":"保養"}]}