{"definition":["harmonious\/to adjust\/to tune (e.g. wireless receiver)\/to bring into harmony"],"pinyin":["tiao2 xie2"],"simplified":["调谐"],"rank":39135.0,"normalized_rank":0.5475494242581115,"fraction":4.1632819181023056e-7,"cumulative_fraction":0.9961423772772992,"word":"調諧","characters":[{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["diao4","tiao2"],"word":"調"},{"definition":["harmonious\/humorous"],"pinyin":["xie2"],"word":"諧"}],"containing_words":[{"definition":["RF tuner"],"pinyin":["she4 pin2 tiao2 xie2 qi4"],"word":"射頻調諧器"}],"sentences":[{"english":"Video recording or reproducing apparatus, whether or not incorporating a video tuner.","chinese":"視頻信號錄製或重放設備，不論是否裝有高頻調諧器。"},{"english":"The radio's dial twirled and the lights behind the tuning panel went out.","chinese":"收音機的調諧鈕轉動了一下，面板上的指示燈熄滅了。"},{"english":"The first all-solid state tunable laser system has been developed successfully.","chinese":"第一臺全固化可調諧激光系統已研製成功。"},{"english":"You can attune unto our kingdoms to learn the Language of ONE.","chinese":"你能向我們王國調諧來學習全一之語。"},{"english":"This laser design allows for broadband tuning.","chinese":"這種激光器允許激光的多頻率調諧。"},{"english":"Sodium atoms in flame can be resonantly excited by pulsed tunable dye laser.","chinese":"用脈衝可調諧染料激光共振激勵火焰中的鈉原子。"},{"english":"Both public and private EMON counters may be used for software and hardware tuning.","chinese":"公用和私用EMON計數器都可用於軟件和硬件調諧。"},{"english":"The excitation source was a flashlamp pumped rhodamine tunable dye laser .","chinese":"激發源爲閃光燈泵可調諧若丹明染科雷射器。"},{"english":"Fine tunning the already coded plug-in to make it works perfect.","chinese":"精細調諧已經編碼插件，使其作品的完美。"},{"english":"An all fiber wavelength tunable loop mirror is demonstrated.","chinese":"介紹了一種全光纖波長可調諧環路反射鏡。"},{"english":"The tunability of millimeter wave free electron laser was observed.","chinese":"觀察到了毫米波自由電子激光器的調諧特性。"},{"english":"Ensure that control valves have been left in normal operating position and properly configured on pcs.","chinese":"在工作狀態，把調諧器調整到在一個方便的位置。"},{"english":"The flow chart to complete the automatic tuning function is given in the paper.","chinese":"並給出了實現整個自動調諧功能的程序流程圖。"},{"english":"It make tuning screw small in body, reasonable in structure to the engineering.","chinese":"設計出空間尺寸小，結構合理的調諧螺釘應用於工程。"},{"english":"Meditation is the attuning of the mental and physical body to your spiritual source.","chinese":"冥想是將你的身心調諧至你精神的來源。"},{"english":"The isochromatic principle of birefringent filter design is proposed in this paper.","chinese":"提出雙折射調諧器設計的等色圖方法，給出原理。"}],"related":[]}