{"definition":["to reassign sb to a different job\/to turn around\/to change direction\/to make a U turn"],"pinyin":["diao4 zhuan3"],"simplified":["调转"],"rank":31378.0,"normalized_rank":0.4390189302253998,"fraction":8.339701822622184e-7,"cumulative_fraction":0.9914641430769244,"word":"調轉","characters":[{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["diao4","tiao2"],"word":"調"},{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"}],"containing_words":[],"sentences":[{"english":"Every time he saw a lawyer walking along the road, he would swerve to hit him.","chinese":"每當他看見有律師在路邊走，他就會調轉車頭撞過去。"},{"english":"I back my car up to the next pump, hurry to get away from her.","chinese":"爲了躲她遠點，我匆匆調轉車頭向下一個油泵駛去。"},{"english":"When the angle is small, the saturation control is replaced by the reverse square root control.","chinese":"小角度調轉時用反向開方代替飽和控制的三模態控制。"},{"english":"At this point the players have to modulate from E to G.","chinese":"這時演奏者必須由E調轉到G調。"},{"english":"The stentorian voice, the timbre is exquisite, can turn on lathe the palace to transfer, 12 law sound accompaniments are prepared.","chinese":"聲音宏亮，音色優美，能旋宮調轉，十二律伴音齊備。"},{"english":"He decided to turn this research on its head by studying young healthy men.","chinese":"他決定調轉研究方向，研究健康的年輕人。"},{"english":"At the end of this phrase, the music modulates from C to G.","chinese":"這個樂句結束時，音樂從C調轉爲G調。"},{"english":"The quartermaster swung the ship into the wind and laid it by.","chinese":"舵工調轉船頭使船頂風停下。"},{"english":"Here the music modulates from E to G.","chinese":"音樂在這兒從E調轉到G調。"},{"english":"Then he turned and started marching back behind it.","chinese":"然後他調轉方向並且開始跟在李的後面行進。"},{"english":"The ship came about and headed for the shore.","chinese":"輪船調轉般向朝海岸駛去。"},{"english":"We must make a turn at the next street.","chinese":"我們必須在下一個街口調轉車頭。"}],"related":[{"definition":["to oppose each other with equal harshness (idiom); tit for tat\/measure for measure"],"pinyin":["zhen1 feng1 xiang1 dui4"],"word":"針鋒相對"},{"definition":["to bill\/to open a tab"],"pinyin":["kai1 dan1"],"word":"開單"},{"definition":["to force someone to do something"],"pinyin":["qiang3 ren2 suo3 nan2"],"word":"強人所難"},{"definition":["lit. you hoodwink me and I cheat you (idiom); fig. mutual deception\/each tries to outwit the other\/dog eats dog and devil take the hindmost"],"pinyin":["er3 yu2 wo3 zha4"],"word":"爾虞我詐"},{"definition":["to take one's anger out on sb (who does not deserve it)"],"pinyin":["qian1 nu4"],"word":"遷怒"},{"definition":["to avoid the important and dwell on the trivial\/to keep silent about major charges while admitting minor ones"],"pinyin":["bi4 zhong4 jiu4 qing1"],"word":"避重就輕"},{"definition":["to move aside\/to get out of the way\/to back down\/to concede"],"pinyin":["tui4 rang4"],"word":"退讓"},{"definition":["to turn a blind eye to"],"pinyin":["shi4 ruo4 wu2 du3"],"word":"視若無睹"},{"definition":["to turn back\/to put back\/reversal\/melodic inversion (in music)"],"pinyin":["zhuan3 hui2"],"word":"轉回"},{"definition":["to console"],"pinyin":["quan4 wei4"],"word":"勸慰"},{"definition":["the cool eye of a bystander\/a detached point of view"],"pinyin":["leng3 yan3 pang2 guan1"],"word":"冷眼旁觀"},{"definition":["to suffer defeat in every battle (idiom)"],"pinyin":["lu:3 zhan4 lu:3 bai4"],"word":"屢戰屢敗"},{"definition":["to feel grateful to sb\/to appreciate the kindness"],"pinyin":["ling3 qing2"],"word":"領情"},{"definition":["lit. chasing the wind and clutching at shadows (idiom); fig. groundless accusations\/to act on hearsay evidence"],"pinyin":["bu3 feng1 zhuo1 ying3"],"word":"捕風捉影"},{"definition":["to discard in the wrong place (cigarette butts etc)\/to leave one's things lying around"],"pinyin":["luan4 diu1"],"word":"亂丟"},{"definition":["to spend (money or time)"],"pinyin":["po4 fei4"],"word":"破費"}]}