{"definition":["to summon\/to muster\/to assemble"],"pinyin":["diao4 ji2"],"simplified":["调集"],"rank":14325.0,"normalized_rank":0.2004253354413555,"fraction":0.000004478009681616632,"cumulative_fraction":0.9561217780707356,"word":"調集","characters":[{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["diao4","tiao2"],"word":"調"},{"definition":["to gather\/to collect\/collected works\/classifier for sections of a TV series etc: episode"],"pinyin":["ji2"],"word":"集"}],"containing_words":[],"sentences":[{"english":"How long would it take to assemble a team for a project like this?","chinese":"爲這樣一個計劃調集一個小組的人需要多長時間？"},{"english":"Chapter Two, The study on the cultural background and the standard to select poem .","chinese":"第二章，《才調集》產生的文化背景與選詩標準。"},{"english":"Coordinate the movement and consignment of USG relief commodities.","chinese":"協調美國政府援助物資的調集和交付。"},{"english":"They assembled a tremendous force to face the attack.","chinese":"他們調集了巨大的兵力來對付這場進攻。"},{"english":"So the year following Lysias gathered together threescore thousand chosen men, and five thousand horsemen, that he might subdue them.","chinese":"次年，他調集六萬精兵，五千騎兵，來攻打猶太人。"},{"english":"And they were struck with great fear, because they heard that the king had given him authority to gather together an army.","chinese":"堡壘裏的人一聽王給了他調集軍隊的權柄，都很害怕。"},{"english":"Dutch colonial army quickly mobilized a large number of military defense fairways .","chinese":"荷蘭殖民軍急忙調集大批軍隊防守航道。"},{"english":"Team see the time is ripe, immediately start mobilizing police officer.","chinese":"專案組見時機成熟，馬上調集警力展開圍捕行動。"}],"related":[]}