{"definition":["to adjust the speed"],"pinyin":["tiao2 su4"],"simplified":["调速"],"rank":40655.0,"normalized_rank":0.5688161963258853,"fraction":3.610026712295583e-7,"cumulative_fraction":0.9967331312158956,"word":"調速","characters":[{"definition":["to harmonize\/to reconcile\/to blend\/to suit well\/to adjust\/to regulate\/to season (food)\/to provoke\/to incite","to transfer\/to move (troops or cadres)\/to investigate\/to enquire into\/accent\/view\/argument\/key (in music)\/mode (music)\/tune\/tone\/melody"],"pinyin":["diao4","tiao2"],"word":"調"},{"definition":["fast\/rapid\/quick\/velocity"],"pinyin":["su4"],"word":"速"}],"containing_words":[],"sentences":[{"english":"This paper also introduces the dual-speed control system and the realization of the function.","chinese":"還詳述了雙調速系統，及所實現的功能。"},{"english":"Conveyer's speed may dispose the control mode which the constant speed or may modulate velocity.","chinese":"輸送機的速度可配置成定速或可調速的控制方式。"},{"english":"Digital control electronic governor can im- prove the idle speed characteristic of the high-speed direct injection diesel engine.","chinese":"數控電子調速器可改善高速直噴柴油機的怠速特性。"},{"english":"This paper presents a double loop controller for VVVF.","chinese":"介紹一種雙閉環控制變頻調速系統。"},{"english":"The configuration of roller table speed regulation system is emphasized.","chinese":"着重介紹了輥道調速系統的構成。"},{"english":"Often a stuntman's success depends on careful timing.","chinese":"通常一個特技人的勝利取決於小心的調速。"},{"english":"The methods were discussed to design the speed governing system of DC motor.","chinese":"詳細討論了直流電機調速系統的工程設計方法。"},{"english":"Unwinding of jumbo roll is pushed by step-less speed-regulator to stable material tension during unwinding.","chinese":"原材料放卷配裝無級調速推送，放卷材料張力恆定。"},{"english":"In situations requiring wide range multi-speed DC motor.","chinese":"在要求寬範圍調速的場合多用直流電動機。"},{"english":"The importance of variable frequency regulating velocity was pointed out on the increasing benefit and economizing energy in the chemi…","chinese":"指出了變頻調速對化工企業節能增效的重要性。"},{"english":"The alternating current excitation motor (ACEM) is a kind of novel adjustable speed motor by changing frequency.","chinese":"交流勵磁電動機是一種新穎的變頻調速電動機。"},{"english":"I need to buy car flywheels, please and contact us.","chinese":"我們需要購買汽車調速輪，請與我們聯繫。"},{"english":"This paper introduced the structure principle and debug method of the axial flow and grout rotation electrohydraulic speedometer.","chinese":"介紹軸流轉漿式電液調速器的結構原理與調試方法。"},{"english":"The paper introduces the VVVF control method for single phase capacitor motor.","chinese":"介紹單相電容電機變頻調速的控制方法。"},{"english":"The inspection glass for oil level of main generator engine governor, to be renewed.","chinese":"主發電機調速器用於檢查油等級的檢查玻璃需要換新。"},{"english":"Using Doubly-fed system in pumping station is a new application domain in China.","chinese":"雙饋調速系統在泵站上的應用是一個全新的應用領域。"}],"related":[]}