{"definition":["earnest\/devoted\/tireless\/sincere\/assiduous"],"pinyin":["zhun1 zhun1"],"simplified":["谆谆"],"rank":52074.0,"normalized_rank":0.7285828214850363,"fraction":1.1532232522092641e-7,"cumulative_fraction":0.9992275366149538,"word":"諄諄","characters":[{"definition":["repeatedly (in giving advice)\/sincere\/earnest\/untiring"],"pinyin":["zhun1"],"word":"諄"},{"definition":["repeatedly (in giving advice)\/sincere\/earnest\/untiring"],"pinyin":["zhun1"],"word":"諄"}],"containing_words":[{"definition":["to repeatedly advise sb earnestly (idiom)\/to admonish"],"pinyin":["zhun1 zhun1 gao4 jie4"],"word":"諄諄告誡"}],"sentences":[{"english":"He inculcates good manners in his children.","chinese":"他諄諄教導他的孩子們要懂規矩。"},{"english":"His predecessor Bill Clinton did not escape \"criticism from Confucius\" either.","chinese":"他的前任克林頓也沒能逃脫來自孔子的“諄諄教誨”。"},{"english":"We will keep in mind your earnest words.","chinese":"我們會牢記您的諄諄話語。"},{"english":"We must never be unworthy of our teachers' untiring and sincere teachings.","chinese":"我們決不要辜負老師的諄諄教導。"},{"english":"He beat in me the duties of loyalty and filial piety.","chinese":"他諄諄教導我要盡孝順之道。"},{"english":"He often inculcates in young people the duty of loyalty.","chinese":"他經常以忠貞之道諄諄教誨年輕人。"},{"english":"I will always remember the earnest teachings from Prof. Luo that guided me to the bright land.","chinese":"銘記羅師諄諄教導，引自己走向光明。"},{"english":"We failed to inculcate students with love of knowledge.","chinese":"我們未能通過諄諄教誨使學生們熱愛知識。"},{"english":"Little Bush also deeply remember a father of inculcation.","chinese":"小布什也深深記得父親的諄諄教誨。"},{"english":"Consequently the ancients earnestly and tirelessly announces drop we, must not risk foolish \" gas \" .","chinese":"因而古人諄諄告戒我們，千萬不要冒傻“氣”。"},{"english":"You light our world with deep love and patient teaching.","chinese":"您用深沉的愛和諄諄教誨點亮了我們的世界。"},{"english":"They fail to inculcate student with love of knowledge.","chinese":"他們未能諄諄教誨使學生們愛好知識。"},{"english":"We' re moved by his devotion to his students.","chinese":"我們未能通過諄諄教誨使學生們熱愛知識。"},{"english":"He drummed two injunctions into the mind of the ignorant.","chinese":"他向愚昧無知的人羣諄諄教誨兩條誡命。"}],"related":[]}