{"definition":["conference table"],"pinyin":["tan2 pan4 zhuo1"],"simplified":["谈判桌"],"rank":21282.0,"normalized_rank":0.2977627915436599,"fraction":0.000002098720341393999,"cumulative_fraction":0.9777098861235324,"word":"談判桌","characters":[{"definition":["surname Tan","to speak\/to talk\/to converse\/to chat\/to discuss"],"pinyin":["Tan2","tan2"],"word":"談"},{"definition":["to judge\/to sentence\/to discriminate\/to discern\/obviously (different)"],"pinyin":["pan4"],"word":"判"},{"definition":["table\/desk\/classifier for tables of guests at a banquet etc"],"pinyin":["zhuo1"],"word":"桌"}],"containing_words":[],"sentences":[{"english":"Eagleburger says the U. S. can try to persuade the North Koreans to come back to the negotiating table.","chinese":"伊格爾伯格說，美國有能力試圖說服北韓重返談判桌。"},{"english":"Peace can be achieved only around the negotiating table.","chinese":"和平只可能在談判桌邊達成。"},{"english":"He said Tehran might be ready to return to negotiations.","chinese":"他說，德黑蘭也許已做好重返談判桌的準備。"},{"english":"Russia opens efforts to get NKorea back into talks.","chinese":"俄羅斯展開努力將朝鮮拉回談判桌。"},{"english":"All life of Zhou Enlai, there are a lot of time is spent in negotiations.","chinese":"周恩來的一生，有許多時間是在談判桌上度過的。"},{"english":"The members of Club Med no longer need to glower across the table at each other.","chinese":"聯盟成員國不再需要像以前那樣在談判桌上怒目而視。"},{"english":"Mr. Abbas came to the table reluctantly.","chinese":"阿布斯先生勉強地來到了談判桌上。"},{"english":"Now artificial intelligence software has taken a seat at the negotiating table.","chinese":"現在人工智能軟件被用在了談判桌前。"},{"english":"The three states will need to swallow their suspicions and return to the table.","chinese":"三個州必須嚥下猜疑，重返談判桌。"},{"english":"After all, it is the negotiating table, not a game of hardball, that will bring progress.","chinese":"歸根結底還是談判桌而非政治把戲纔會帶來進步。"},{"english":"Now they see themselves as sitting at the table.","chinese":"可如今他們已經坐在國際談判桌上。"},{"english":"There are too many variables, too many changes on the table and too many competing agendas.","chinese":"談判桌上你來我往，競爭和對峙造成了太多變數。"}],"related":[]}