{"definition":["treatise\/discourse\/exposition"],"pinyin":["lun4 shu4"],"simplified":["论述"],"rank":12174.0,"normalized_rank":0.17033005470597287,"fraction":0.00000596931711763813,"cumulative_fraction":0.9449722365538292,"word":"論述","characters":[{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"論"},{"definition":["to state\/to tell\/to narrate\/to relate"],"pinyin":["shu4"],"word":"述"}],"containing_words":[],"sentences":[{"english":"The advantages of iron ore-coal pellets covered with iron-concentrate shell are discussed.","chinese":"論述了礦煤球團用鐵精礦及添加劑包殼的優點。"},{"english":"This paper talks about related problems with campus culture construction in higher institutes .","chinese":"本文對高校校園文化建設的相關問題加以論述。"},{"english":"R. C. – Of discourse, of the body, that is what I mean.","chinese":"關於論述，關於身體，那是我的意思。"},{"english":"This paper describes the basic principles of the image digitizer and its development course.","chinese":"本文論述了圖像數字化器的基本原理及其發展過程。"},{"english":"He is the sovereign representative.","chinese":"這是他又一非常關鍵的論述。"},{"english":"Lastly, it discusses the layout of the warehouse and optimization of the goods location.","chinese":"最後，論述了倉庫的佈局和貨位優化問題。"},{"english":"This paper discusses the relationship between the truth perfect, beautiful life principle and university education.","chinese":"論述了求真求善求美的人生理念與大學教育的關係。"},{"english":"The part of 3th discusses the role of the theory of comparative advantage for Chinese foreign trade .","chinese":"第三部分論述了比較優勢理論對中國對外貿易的作用。"},{"english":"Meanwhile, some mechanisms of defoaming in refine sugar were related here.","chinese":"並對製糖業中的消泡機理進行了論述。"},{"english":"This paper studies on the relationship between the Ma Wusu sands control and particle board′s building.","chinese":"本文論述了毛烏素沙地治理與刨花板廠建設的關係。"},{"english":"The methods for measuring the geometry dimension of graphite electrode tapered nipples as well as the measurement mechanism adopted are reviewed.","chinese":"論述了測量石墨電極接頭的各種方法及測量原理。"},{"english":"It can be called as the exposition of surrounding rock reinforcement.","chinese":"此論述也可稱圍巖加固論。"},{"english":"In chapter two, the background of the Notes of Classical Chinese is demonstrated.","chinese":"第二章論述了《古文觀止》成書的背景。"},{"english":"Furthermore, the suitable control methods of VRM are discussed.","chinese":"同時對適用於VRM的控制方法進行了論述。"},{"english":"In chapter 4, the experiment of temperature-thermal Errors of CNC machine tools is introduced.","chinese":"第四章，主要論述了數控機牀熱誤差實驗。"},{"english":"The second chapter mainly discusses Dingli's commercial literary view.","chinese":"第二部分主要論述了丁力的商情文學觀。"}],"related":[{"definition":["to expound (a position)\/to elaborate (on a topic)\/to treat (a subject)"],"pinyin":["chan3 shu4"],"word":"闡述"},{"definition":["arteries and veins\/network of blood vessels\/vascular system (of a plant or animal)\/(fig.) fabric (i.e. underlying structure, as in \"social fabric\")\/overall context"],"pinyin":["mai4 luo4"],"word":"脈絡"},{"definition":["to decipher\/to decode\/to interpret"],"pinyin":["jie3 du2"],"word":"解讀"},{"definition":["scholar"],"pinyin":["xue2 zhe3"],"word":"學者"},{"definition":["to explain\/to expound\/to interpret\/elucidation"],"pinyin":["chan3 shi4"],"word":"闡釋"},{"definition":["to prove a point\/to expound on\/to demonstrate or prove (through argument)\/proof"],"pinyin":["lun4 zheng4"],"word":"論證"},{"definition":["point of view\/viewpoint\/standpoint\/CL:個|个[ge4]"],"pinyin":["guan1 dian3"],"word":"觀點"},{"definition":["learning\/science\/academic\/CL:個|个[ge4]"],"pinyin":["xue2 shu4"],"word":"學術"},{"definition":["cognition\/cognitive\/understanding\/perception\/awareness\/to be cognizant of\/to recognize\/to realize"],"pinyin":["ren4 zhi1"],"word":"認知"},{"definition":["theory\/CL:個|个[ge4]\/to argue\/to take notice of"],"pinyin":["li3 lun4"],"word":"理論"},{"definition":["opinion\/view\/understanding"],"pinyin":["jian4 jie3"],"word":"見解"},{"definition":["to sum up\/to summarize\/to conclude from facts\/induction (method of deduction in logic)"],"pinyin":["gui1 na4"],"word":"歸納"},{"definition":["to advocate\/to stand for\/view\/position\/stand\/proposition\/viewpoint\/assertion\/CL:個|个[ge4]"],"pinyin":["zhu3 zhang1"],"word":"主張"},{"definition":["to relate (a story or information)\/to tell or talk about\/to recount\/narration\/telling\/narrative\/account"],"pinyin":["xu4 shu4"],"word":"敘述"},{"definition":["argument\/line of reasoning\/thesis\/point (of discussion)"],"pinyin":["lun4 dian3"],"word":"論點"},{"definition":["to investigate\/dialectical"],"pinyin":["bian4 zheng4"],"word":"辯證"}]}