{"definition":["(used for abstract things) a good deal, a lot of"],"pinyin":["zhu1 duo1"],"simplified":["诸多"],"rank":3063.0,"normalized_rank":0.0428553439760469,"fraction":0.00004675210857744415,"cumulative_fraction":0.7936996992838824,"word":"諸多","characters":[{"definition":["all\/various","surname Zhu"],"pinyin":["Zhu1","zhu1"],"word":"諸"},{"definition":["many\/much\/often\/a lot of\/numerous\/more\/in excess\/how (to what extent)\/multi-\/Taiwan pr. [duo2] when it means \"how\""],"pinyin":["duo1"],"word":"多"}],"containing_words":[],"sentences":[{"english":"This is one of many cultural chasms across the Atlantic.","chinese":"這只是橫跨大西洋的諸多文化鴻溝之一。"},{"english":"Yet evidence abounds that banks are still gun-shy about lending to business.","chinese":"但是諸多證據顯示銀行對企業貸款仍是小心翼翼。"},{"english":"You can’t have good ideas unless you’re willing to generate a lot of bad ones.","chinese":"除非摒棄諸多不良想法纔會有好點子。"},{"english":"Many of the experiments involved pigs inflicted with near-fatal injuries.","chinese":"其中諸多實驗包括在豬隻身上施以幾近致命的傷害。"},{"english":"The southern paper-cut is folk custom culture product in south of our country.","chinese":"南方剪紙是我國南方諸多民族民俗文化的產物。"},{"english":"Many Chinese agricultural initiatives are shrouded in mystery.","chinese":"中國在農業方面的諸多舉措仍然充滿了神祕色彩。"},{"english":"The analysis indicated that the current method for machining the abnormal deep ostiole has many drawback.","chinese":"結果表明，當前異形深小孔的加工技術存在諸多缺陷。"},{"english":"Being summed up, there are creditor's right theory, mixed-right theory and new-right theory in this field.","chinese":"然而，這一重大問題在理論界卻存在諸多分歧。"},{"english":"Virtual indestructibility was just one of the many perks I was looking forward to.","chinese":"金剛不壞之身只是我期許的諸多好處之一。"},{"english":"He has been awarded for several times the MEXT prize of Japan.","chinese":"他曾經多次獲得日本文部科學大臣獎等諸多藝術獎項。"},{"english":"While modernity makes greater progress, it also brings with it a lot of malaises.","chinese":"現代性取得了巨大成就的同時，也帶了諸多的隱憂。"},{"english":"While we, when making a choice, are so full of hesitations and have so many doubts.","chinese":"而人們在做出種種選擇的時候總會參雜着諸多的猶豫。"},{"english":"Catalpa Po for repair units as soon as possible the owner, the owner of lining.","chinese":"梓博要求業主儘快維修單位，業主諸多推搪。"},{"english":"Present family planning policy has caused many disharmonies.","chinese":"現行計劃生育政策，造成了諸多的不和諧。"},{"english":"She provides little analysis of the corporate culture that led to the many snafus .","chinese":"她幾乎沒怎麼分析導致這諸多混亂的公司文化。"},{"english":"Praxair owns extensive experience in steel industry and contributes a number of innovative technologies.","chinese":"普萊克斯在鋼鐵領域具有豐富經驗和諸多技術貢獻。"}],"related":[]}