{"definition":["Normandy, France"],"pinyin":["Nuo4 man4 di3"],"simplified":["诺曼底"],"rank":28589.0,"normalized_rank":0.3999972017405174,"fraction":0.000001069578072017377,"cumulative_fraction":0.9888270846914576,"word":"諾曼底","characters":[{"definition":["to consent\/to promise\/(literary) yes!"],"pinyin":["nuo4"],"word":"諾"},{"definition":["handsome\/large\/long"],"pinyin":["man4"],"word":"曼"},{"definition":["(equivalent to 的 as possessive particle)","background\/bottom\/base\/end (of the month, year etc)\/remnants\/(math.) radix\/base"],"pinyin":["de5","di3"],"word":"底"}],"containing_words":[{"definition":["Norman (people)"],"pinyin":["nuo4 man4 di3 ren2"],"word":"諾曼底人"},{"definition":["Normandy peninsula"],"pinyin":["Nuo4 man4 di3 Ban4 dao3"],"word":"諾曼底半島"}],"sentences":[{"english":"The population of Normandy, which saw most of the fighting, halved.","chinese":"經歷了大部分戰鬥的諾曼底人，半數死亡。"},{"english":"Ice situation not expected to change in area around Normandy.","chinese":"冰況在靠近諾曼底處將不會改變。"},{"english":"The second chapter analyzes the history of England from Normandy Conquest to Glory Revolution.","chinese":"第二章分析從諾曼底征服到光榮革命時期的英國。"},{"english":"In Normandy, the Allies secured absolute command of both the air and sea.","chinese":"在諾曼底，盟軍已經牢牢地掌握了制海權和制空權。"},{"english":"D-Day was the result of broad international accord.","chinese":"諾曼底登陸是廣泛國際合作的結果。"},{"english":"Sarkozy is set to visit Mont Saint Michel in Normandy, France that day.","chinese":"薩科齊將訪問聖米歇爾山在諾曼底，法國那一天。"},{"english":"A second new plant in Normandy appears to be experiencing similar problems.","chinese":"諾曼底的另一個新核電站似乎也面臨同樣的問題。"},{"english":"The Vikings invaded present-day Normandy in the 9th century.","chinese":"斯堪的納維亞人在第9世紀侵略了當代的諾曼底。"},{"english":"Normandy was the classic example of modern combined arms, air-land, coalition warfare.","chinese":"諾曼底登陸是一次經典的現代空軍和陸軍的聯合作戰。"},{"english":"The landing in Normandy is merely a diversionary maneuver.","chinese":"諾曼底登陸只是聲東擊西的陽動。"},{"english":"According to the textbook of history, the Normans conquered England in1066.","chinese":"據歷史書記載諾曼底人於一零六六年佔領了英格蘭。"},{"english":"Oneway Normandyis comparable to go is the fact that the deception is involved.","chinese":"與圍棋相比，諾曼底實際上是運用了詭詐之術。"},{"english":"Allied land forces that saw combat in Normandy on D-Day itself came from Canada, the United Kingdom and the United States of America.","chinese":"參與諾曼底登陸的盟軍來自加拿大，英國和美國。"},{"english":"Visit medieval castles in Normandy and the Loire Valley.","chinese":"在諾曼底參觀中世紀城堡和盧瓦爾河谷。"},{"english":"The Normans ruled England by right of conquest.","chinese":"諾曼底人於一零六六年佔領英格蘭。"},{"english":"World War II veterans return to Normandy 65 years after D-Day.","chinese":"諾曼底登陸65年後，二戰退伍軍人回到諾曼底。"}],"related":[]}