{"definition":["to scheme\/to plot\/conspiracy"],"pinyin":["mou2 hua4"],"simplified":["谋划"],"rank":12273.0,"normalized_rank":0.17171519314986078,"fraction":0.0000058945765726848215,"cumulative_fraction":0.945559860732104,"word":"謀劃","characters":[{"definition":["to plan\/to seek\/scheme"],"pinyin":["mou2"],"word":"謀"},{"definition":["to cut\/to slash\/to scratch (cut into the surface of sth)\/to strike (a match)","to delimit\/to transfer\/to assign\/to plan\/to draw (a line)\/stroke of a Chinese character"],"pinyin":["hua2","hua4"],"word":"劃"}],"containing_words":[{"definition":["to put forward plans and ideas (also derogatory)\/to give advice (idiom)"],"pinyin":["chu1 mou2 hua4 ce4"],"word":"出謀劃策"}],"sentences":[{"english":"If your employer isn't already aware of your plans, ask for a meeting to explain.","chinese":"假如店主還不知道你的謀劃，請求劈面解釋。"},{"english":"We have new methods likepensation trade and joint ventrue.","chinese":"我們有賠償貿易以及合資謀劃。"},{"english":"Electronic computers must be programmed before they can work.","chinese":"必須爲電子謀劃機編好程序，它才華工作。"},{"english":"The person who planned this crime planned it exactly like a detective-story.","chinese":"謀劃這起罪惡的人完全是在按照偵探小說的模式。"},{"english":"He has no PR people advising him.","chinese":"他身邊沒有公關人員替他出謀劃策。"},{"english":"Each new day brings another plot to assassinate me and bring us closer to anarchy and terror.","chinese":"日日有人謀劃暗殺我，將國家逼向動亂和恐怖。"},{"english":"Our compa recenty mainly deals with the export business of silk goods.","chinese":"我公司主要謀劃絲織品的入口業務。"},{"english":"The calculated operating tonnage of the die will include stripping pressure.","chinese":"謀劃出的模具工作噸位應包括脫料力。"},{"english":"No employee of the United States Government shall engage in, or conspire to engage in, political assassination.","chinese":"任何美國政府的僱員不得介入或謀劃進行政治暗殺。"},{"english":"Meanwhile, the manager is planning a new role for Dalglish under his Anfield reign.","chinese":"與此同時，霍奇森正在爲達格利什謀劃一個新角色。"},{"english":"Post a topic, and someone will definitely help you out.","chinese":"發佈一個主題，絕對會有人給你出謀劃策的。"},{"english":"Friends who have wonderful ideas please don’t be shy and bring forward your suggestions on our group, if you got the talent, don’t waste it.","chinese":"有好的建議的朋友請在後面跟貼，爲團隊出謀劃策。"},{"english":"That Chu sword achievement the whole political plans all have no from begin to talk almost.","chinese":"那楚劍功一切政治謀劃都無從談起。"},{"english":"Unlike Best and Gascoigne, he has been shrewdly advised.","chinese":"不同於貝斯特和加斯科因，他身邊一直有人出謀劃策。"},{"english":"The banker can engage in two kinds of fraud and embezzlement.","chinese":"銀行家們可以謀劃兩種方式的欺詐和侵佔行爲。"},{"english":"The accused was convicted of murder and will be sentenced next week.","chinese":"被告已被定謀劃殺罪並於下週判刑。"}],"related":[{"definition":["feasible\/realistic\/practical\/earnestly\/conscientiously"],"pinyin":["qie4 shi2"],"word":"切實"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推進"},{"definition":["to launch\/to develop\/to unfold\/(of an exhibition etc) to open"],"pinyin":["kai1 zhan3"],"word":"開展"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落實"},{"definition":["an overall plan\/to plan an entire project as a whole"],"pinyin":["tong3 chou2"],"word":"統籌"},{"definition":["opportunity\/turning point\/juncture"],"pinyin":["qi4 ji1"],"word":"契機"},{"definition":["to move\/to act\/action\/decision\/conduct\/manner"],"pinyin":["ju3 cuo4"],"word":"舉措"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["strategy"],"pinyin":["zhan4 lu:e4"],"word":"戰略"},{"definition":["to implement\/to put into practice\/to carry out"],"pinyin":["guan4 che4"],"word":"貫徹"},{"definition":["optimization\/to optimize\/to make superior"],"pinyin":["you1 hua4"],"word":"優化"},{"definition":["to plan (how to do sth)\/planning\/plan\/program"],"pinyin":["gui1 hua4"],"word":"規劃"},{"definition":["active\/energetic\/vigorous\/positive (outlook)\/proactive"],"pinyin":["ji1 ji2"],"word":"積極"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["lit. before it rains, bind around with silk (idiom, from Book of Songs 詩經|诗经); fig. to plan ahead\/to prepare for a rainy day"],"pinyin":["wei4 yu3 chou2 mou2"],"word":"未雨綢繆"},{"definition":["to plan and prepare"],"pinyin":["chou2 hua4"],"word":"籌劃"}]}