{"definition":["to seek\/to strive for\/to obtain\/see also 牟取[mou2 qu3]"],"pinyin":["mou2 qu3"],"simplified":["谋取"],"rank":10385.0,"normalized_rank":0.1452996236340996,"fraction":0.000007785424773427428,"cumulative_fraction":0.932787790738658,"word":"謀取","characters":[{"definition":["to plan\/to seek\/scheme"],"pinyin":["mou2"],"word":"謀"},{"definition":["to take\/to get\/to choose\/to fetch"],"pinyin":["qu3"],"word":"取"}],"containing_words":[],"sentences":[{"english":"This short term make-a-fast-buck philosophy has killed this country.","chinese":"“謀取近利”這一指導思想已經扼殺了這個國家。"},{"english":"We enlisted them to help.","chinese":"我們謀取他們的幫助。"},{"english":"Corruption is the use of governmental powers by government officials for illegitimate private gain.","chinese":"腐敗是利用政府權力，政府官員爲非法謀取私利。"},{"english":"In ancient times there was a country magistrate who took bribes and practised graft.","chinese":"古時候有一個縣官，貪污受賄，謀取私利。"},{"english":"The fact that he'd been in prison militated against his chances of getting a job in a bank.","chinese":"蹲過監獄這件事影響他謀取銀行職位的機會。"},{"english":"In war we must always leave room for strokes of fortune, and accidents that cannot be foreseen – Polybius.","chinese":"戰爭中我們爲謀取財富而離鄉背井，前途叵測。"},{"english":"The provinces start to take advantage of the Empire's weakened state.","chinese":"但其他的行省開始在帝國式微之下謀取各自的利益。"},{"english":"All the misunderstanding honor the benefit of using his honor thoroughly frustrated, .","chinese":"全誤會榮利用自己謀取利益，對榮徹底失望。"},{"english":"Exploiting your assets for personal gain.","chinese":"利用您的資產謀取私利。"},{"english":"At present, Tanzania is at the centre of the world's ivory slaughter.","chinese":"目前，坦桑尼亞是世界屠宰大象謀取象牙的中心。"},{"english":"Right rent seeking of inspector means to put privacy into the public right to obtain money and material interests.","chinese":"權力尋租者將公權化爲私權，以謀取金錢和物質利益。"},{"english":"They jockey for the leaderships of the party.","chinese":"他們不擇手段謀取黨的領導權。"},{"english":"The houses have become a few rich people's means of cornering and profiteering.","chinese":"住宅成了少數一些富人囤積居奇謀取暴利的手段。"},{"english":"Using other people for one's own profit is unethical.","chinese":"利用別人來謀取私利是不道德的。"}],"related":[]}