{"definition":["to claim\/to pretend"],"pinyin":["huang3 cheng1"],"simplified":["谎称"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"謊稱","characters":[{"definition":["lies\/to lie"],"pinyin":["huang3"],"word":"謊"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"}],"containing_words":[],"sentences":[{"english":"Ying falsely claim is the waiter here, then panic away.","chinese":"珠英謊稱自己是這裏的服務員，便驚慌的走開了。"},{"english":"A bouquet of flowers in the sitting room, the son that the tie was frequently gave concise.","chinese":"客廳中有一束鮮花，允兒謊稱是克勤送給簡潔的。"},{"english":"President Nichols misled the people by lying about his involvement in the scandal.","chinese":"尼可總統謊稱他和這宗醜聞無關，誤導民衆。"},{"english":"Treasure nothing pretends to fry bridge, forced chrysanthemum son shot and killed himself.","chinese":"寶虎子謊稱要炸橋，逼菊子開槍打死了自己。"},{"english":"Chen claimed a package to help review the patient's condition had taken a bag of blood.","chinese":"陳某謊稱幫助包某複查病情，抽取了包某的血液。"},{"english":"They also falsely claimed that this project was managed by a business organization.","chinese":"而且謊稱該計畫由商業機構管理。"},{"english":"Mr Still does not recognize identity, saying she called golden knife.","chinese":"金戈仍然不承認身份，謊稱自己叫金刀。"},{"english":"Another situation is when someone falsely claims another person said something.","chinese":"另一種情況是，當有人謊稱別人說了什麼時。"},{"english":"See class feeling much better ride, Sun Feng lied out something to deal with.","chinese":"見搭班情緒好了許多，孫峯謊稱外出有事要處理。"},{"english":"The monkey that original nightman man is his father.","chinese":"猴子謊稱原來的掏糞工人是自己的爹。"},{"english":"Fu Yuwei does not want to reveal the identity, pretend oneself are ab extra work younger sister.","chinese":"傅語薇不想暴露身份，便謊稱自己是個外來打工妹。"},{"english":"Clock from the false in Tan Ruiling prepared a birthday present.","chinese":"鍾離謊稱在給譚睿玲準備生日禮物。"}],"related":[]}