{"definition":["to explain"],"pinyin":["jiang3 ming2"],"simplified":["讲明"],"rank":30189.0,"normalized_rank":0.42238327760133204,"fraction":9.268119529464071e-7,"cumulative_fraction":0.9904184603746032,"word":"講明","characters":[{"definition":["to speak\/to explain\/to negotiate\/to emphasise\/to be particular about\/as far as sth is concerned\/speech\/lecture"],"pinyin":["jiang3"],"word":"講"},{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"}],"containing_words":[],"sentences":[{"english":"The professor spoke for a long time, but I'm afraid his meaning did not come across.","chinese":"那教授講了半天，但我想他沒把意思講明白。"},{"english":"He spoke for a long time but his meaning did not come across.","chinese":"他說了很久，但是沒有把他的意思講明白。"},{"english":"Please give me your reasons for refusing.","chinese":"請向我講明你拒絕的理由。"},{"english":"She’s telling him that he can’t go with her to see his father.","chinese":"她跟他講明，不能帶他去見他父親。"},{"english":"These things speak, and exhort, and rebuke with all authority.","chinese":"這些事你要講明，勸戒人，用各等權柄責備人。"},{"english":"First I ask Julie to tell me some things she wants from me during this month.","chinese":"首先，我讓朱莉講明這個月她想讓我做的事情。"},{"english":"The boss of the company, whose name was Mr Little, told the story about Ms King and then said.","chinese":"公司的老闆利特爾先生講明瞭金女士的情況，然後說。"},{"english":"Paul told her, I must tell xiao ya know, including work and feelings.","chinese":"保羅告訴她，自己要跟小雅講明白，包括工作和感情。"},{"english":"The lecturer tried to drum in his viewpoint, but the students were not listening.","chinese":"演講者設法講明他的觀點，但學生們卻充耳不聞。"}],"related":[]}