{"definition":["to stress\/to emphasize\/particular about sth\/to strive for"],"pinyin":["jiang3 qiu2"],"simplified":["讲求"],"rank":16507.0,"normalized_rank":0.23095434639654136,"fraction":0.0000034793767362541535,"cumulative_fraction":0.964751858150778,"word":"講求","characters":[{"definition":["to speak\/to explain\/to negotiate\/to emphasise\/to be particular about\/as far as sth is concerned\/speech\/lecture"],"pinyin":["jiang3"],"word":"講"},{"definition":["to seek\/to look for\/to request\/to demand\/to beseech"],"pinyin":["qiu2"],"word":"求"}],"containing_words":[],"sentences":[{"english":"\" Sound rhythm\" is an important characteristic of poems.","chinese":"“聲律”的講求是詩歌語言藝術的重要特點。"},{"english":"The Italians are eminently practical, and everything must have its use.","chinese":"意大利人講求實際是出了名的，一切都要物盡其用。"},{"english":"In the movie, Confucius talks of changing oneself from within.","chinese":"影片中，孔子講求從內心深處來改變一個人。"},{"english":"There's balance between use and preservation.","chinese":"在使用與保存之間要講求平衡。"},{"english":"The unique feature of this book is its down-to-earth practicality.","chinese":"這本書所獨有的特點就是其講求實際的實用性。"},{"english":"He advocated the editorial principles of letting a hundred schools of thought contend and attaching great importance to the academic quality.","chinese":"提倡百家爭鳴，講求學術質量是他的編輯思想。"},{"english":"Grooming and privgot hygiene haudio-videoe i've been around for matures.","chinese":"儀容整潔和個人衛生的講求已經行之有年了。"},{"english":"We want to be productive and see with our own eyes what we have made.","chinese":"我們講求成效，希望親眼看見自己做出的成果。"},{"english":"You are entering an enterprise pursuing practical results, so demonstrate your value with performance.","chinese":"你進入的是一家講求實效的企業，請用你的業績說話。"},{"english":"Did not focus on direct evidence of sub-type.","chinese":"不講求證據直接判型。"},{"english":"Work hard and effectively, but you can also have some fun.","chinese":"要勤奮工作，講求成效，但是也要找點樂兒。"},{"english":"In order to defeat a strong army, a weak army must carefully choose favourable terrain as a battleground.","chinese":"弱軍要戰勝強軍，是不能不講求陣地這個條件的。"},{"english":"It’s both productive and, of course, relaxing.","chinese":"它既有創造性，當然又講求放鬆。"},{"english":"He did not bother about amall matters in personal behaviour and in being an official.","chinese":"他爲人和做官都不拘小節，講求實效。"},{"english":"The Chinese civilization has always given prominence to good neighborliness.","chinese":"中華文明歷來注重親仁善鄰，講求和睦相處。"}],"related":[]}