{"definition":["to talk about\/to narrate\/to give an account"],"pinyin":["jiang3 shu4"],"simplified":["讲述"],"rank":3105.0,"normalized_rank":0.043442978467393284,"fraction":0.00004616761415948898,"cumulative_fraction":0.795651048787944,"word":"講述","characters":[{"definition":["to speak\/to explain\/to negotiate\/to emphasise\/to be particular about\/as far as sth is concerned\/speech\/lecture"],"pinyin":["jiang3"],"word":"講"},{"definition":["to state\/to tell\/to narrate\/to relate"],"pinyin":["shu4"],"word":"述"}],"containing_words":[],"sentences":[{"english":"The first part narrates Shang and Zhou period personalities do not stand independently.","chinese":"第一部分講述商周時期人格的不獨立。"},{"english":"The story speaks of more than thankfulness.","chinese":"這故事講述的不僅僅是感激之情。"},{"english":"To narrate is to give an account of what happened or is happening.","chinese":"記敘文講述的是發生在當前或過去事情的經過。"},{"english":"Last week, we talked about the growth of the cattle industry.","chinese":"上週，我們向你講述了美國養牛業迅速發展的情況。"},{"english":"He told a heart-wrenching story of his childhood in the impoverished countryside.","chinese":"他講述了在貧困農村度過的悲慘童年的經歷。"},{"english":"Bending the ear of the hedgerow with stories of fire and sword.","chinese":"吹壓着籬木的耳朵，講述劍與火的故事。"},{"english":"And BedelL listened as she told him about her brothers and about James.","chinese":"比德爾也傾聽她講述他的兄弟和丈夫詹姆斯的事。"},{"english":"Chapter II is mainly about the role of the local history in high school history teaching.","chinese":"第二章，主要講述鄉土史在高中歷史教學中的作用。"},{"english":"Snider shares her personal story in the introduction.","chinese":"斯奈德在介紹中給我們講述了她自己的故事。"},{"english":"The main option I focus on in this article is the inline editor switch.","chinese":"本文將重點講述的主要選項是行內編輯器開關。"},{"english":"It takes work to tell a story succinctly.","chinese":"簡潔地講述一個故事是需要花功夫的。"},{"english":"The second chapter narrated the comprehensive budget management elementary theory.","chinese":"第二章講述了全面預算管理的基本理論。"},{"english":"Last month I talked about how to write a device driver for radio-tuner cards.","chinese":"上個月我講述了怎樣爲音頻接收卡編寫設備驅動。"},{"english":"Our course deals with the essentials of management.","chinese":"我們的課程講述管理的基本要點。"},{"english":"Chapter 3 treats the design of the timing synchronization loop.","chinese":"第三章講述了基於內插思想的同步環路設計。"},{"english":"Hostesses are also writing best-selling books, be they on money management or the art of conversation.","chinese":"陪酒女們也寫出了暢銷書，講述如何理財和談話藝術。"}],"related":[{"definition":["to relate (a story or information)\/to tell or talk about\/to recount\/narration\/telling\/narrative\/account"],"pinyin":["xu4 shu4"],"word":"敘述"},{"definition":["to recount\/to tell of\/to relate\/(fig.) (of a thing) to stand as testament to (some past history)"],"pinyin":["su4 shuo1"],"word":"訴說"},{"definition":["experience\/CL:個|个[ge4],次[ci4]\/to experience\/to go through"],"pinyin":["jing1 li4"],"word":"經歷"},{"definition":["to expound (a position)\/to elaborate (on a topic)\/to treat (a subject)"],"pinyin":["chan3 shu4"],"word":"闡述"},{"definition":["to recount\/to narrate\/to give an account of"],"pinyin":["shu4 shuo1"],"word":"述說"},{"definition":["newsreel\/documentary (film or TV program)\/CL:部[bu4]"],"pinyin":["ji4 lu4 pian4"],"word":"紀錄片"},{"definition":["to introduce (sb to sb)\/to give a presentation\/to present (sb for a job etc)\/introduction"],"pinyin":["jie4 shao4"],"word":"介紹"},{"definition":["to speak\/to explain\/to negotiate\/to emphasise\/to be particular about\/as far as sth is concerned\/speech\/lecture"],"pinyin":["jiang3"],"word":"講"},{"definition":["to describe\/to portray"],"pinyin":["miao2 hui4"],"word":"描繪"},{"definition":["to record\/record (written account)\/note-taker\/record (in sports etc)\/CL:個|个[ge4]"],"pinyin":["ji4 lu4"],"word":"記錄"},{"definition":["(of a story etc) to unfold\/to play out\/to develop (a technique etc)\/to enact\/(logic) to deduce\/to infer"],"pinyin":["yan3 yi4"],"word":"演繹"},{"definition":["to create\/to produce\/to write\/creative work\/creation\/CL:個|个[ge4]"],"pinyin":["chuang4 zuo4"],"word":"創作"},{"definition":["pertaining to\/concerning\/with regard to\/about\/a matter of"],"pinyin":["guan1 yu2"],"word":"關於"},{"definition":["movie\/film\/CL:部[bu4],片[pian4],幕[mu4],場|场[chang3]"],"pinyin":["dian4 ying3"],"word":"電影"},{"definition":["to discuss\/to talk about"],"pinyin":["tan2 lun4"],"word":"談論"},{"definition":["to film\/to shoot (a picture)"],"pinyin":["pai1 she4"],"word":"拍攝"}]}