{"definition":["to remember with reverence\/to bear in mind\/to keep in mind"],"pinyin":["jin3 ji4"],"simplified":["谨记"],"rank":36789.0,"normalized_rank":0.5147258405271921,"fraction":5.166148214643779e-7,"cumulative_fraction":0.9950498580913312,"word":"謹記","characters":[{"definition":["cautious\/careful\/solemnly\/sincerely (formal)"],"pinyin":["jin3"],"word":"謹"},{"definition":["to record\/to note\/to memorize\/to remember\/mark\/sign\/classifier for blows, kicks, shots"],"pinyin":["ji4"],"word":"記"}],"containing_words":[],"sentences":[{"english":"Remebering that first impressions are not always correct.","chinese":"時刻謹記第一印象並不總是正確的。"},{"english":"Remember, he's a Martian and doesn't keep score the way you do.","chinese":"謹記，他是火星人，記分法和你不同。"},{"english":"Remember the five-day rule for leftovers, too.","chinese":"對剩飯菜請同樣謹記五天原則。"},{"english":"A major point to keep in mind is that people will need human-machine interaction in the future.","chinese":"但我們必須謹記，在未來人們會需要人機交互技術。"},{"english":"You must bear in mind all these wise sayings.","chinese":"這些至理名言你可要謹記在心。"},{"english":"We must remember that the Cold War born in this city was not a battle for land or treasure.","chinese":"我們必須謹記，始於本市的冷戰並非爲了領土或財富。"},{"english":"Always remember people equate skepticism with wisdom.","chinese":"謹記，人們把懷疑態度等同於智慧。"},{"english":"Remember that grief is a natural pridator, so learn to tolerate some damage.","chinese":"謹記，悲傷是天然的獵多者，因此要學會忍受損失。"},{"english":"Remember you will only receive a harvest in proportion to what you’ve sown for.","chinese":"謹記，一分耕耘一分收穫。"},{"english":"There are a few concepts that you should master in order to successfully engage and “pick up” a woman.","chinese":"爲了成功吸引和追到姑娘，一些觀念你必須謹記。"},{"english":"When choosing a soup, keep in mind that cream-based soups are higher in fat and calories than broth-based soups.","chinese":"點湯時，謹記奶油湯的脂肪和熱量比清湯高。"},{"english":"Remember the GDS is just the data conduit….","chinese":"請謹記，GDS只是數據的中轉站。"},{"english":"Even if get stumbled at one moment, keep the long term communication strategy in mind.","chinese":"即使一時之間有所磕碰，也應該謹記長期的溝通策略。"},{"english":"Wherever you go you must keep it in mind.","chinese":"無論你走到哪裏，你都要謹記在心。"},{"english":"God help me to take this to heart in the testing times ahead.","chinese":"求神幫助我在未來的試煉時期將之謹記於心。"},{"english":"Keep the baseline in mind.","chinese":"將基線謹記於心。"}],"related":[]}