{"definition":["to compose (a piece of music)\/(fig.) to create, by one's actions, a narrative (generally one that can be recounted with pride)"],"pinyin":["pu3 xie3"],"simplified":["谱写"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"譜寫","characters":[{"definition":["chart\/list\/table\/register\/score (music)\/spectrum (physics)\/to set to music"],"pinyin":["pu3"],"word":"譜"},{"definition":["to write"],"pinyin":["xie3"],"word":"寫"}],"containing_words":[],"sentences":[{"english":"The Chinese side would like to work together with Arab states to compose a new chapter of China-Arab friendly cooperation.","chinese":"中方願與阿方共同努力，譜寫中阿友好合作的新篇章。"},{"english":"Phoenix patterns together with the other traditional patterns write a history of the Chinese patterns.","chinese":"鳳紋樣和其它傳統紋樣一起，共同譜寫着中國紋樣史。"},{"english":"With our practical action to write a song and a hymn in the spring.","chinese":"用我們實際行動來譜寫一曲又一曲春天裏的讚歌。"},{"english":"The song am composed by a youth stayer.","chinese":"這首歌是一位年青務工傭人譜寫的。"},{"english":"Sincerely look forward to your cooperation, to co-creating a glorious future, and composing new writings.","chinese":"真誠期待和您的合作，共創美好未來，譜寫新的篇章。"},{"english":"You will do much better starting a relationship with someone who has common interests.","chinese":"你會和有着共同興趣的某人譜寫一段更加浪漫的戀曲。"},{"english":"This musical composition was especially written by him for her.","chinese":"這支琴曲是他專門爲她譜寫的。"},{"english":"The music for this dance.","chinese":"爲孔雀舞譜寫的舞曲。"},{"english":"I can sign the preposition song in my sleep.","chinese":"我可以在我睡覺的時候譜寫介詞之歌。"},{"english":"Together, we will help write the next chapter of the great American story.","chinese":"讓我們一起譜寫美國曆史新一頁的華章。"},{"english":"The tune was composed at the beginning of the War of Liberation.","chinese":"這支曲子是在解放戰爭初期譜寫的。"},{"english":"The composition is in the manner of German folk songs.","chinese":"這首曲子是以德國民歌的風格譜寫成的。"},{"english":"We are the architects of our own fate.","chinese":"命運都是由我們自己譜寫的。"},{"english":"Of course, there are also part of the exotic marriage successfully wrote another.","chinese":"當然，也有一部分異國婚姻成功地譜寫了別樣的戀曲。"},{"english":"Music written in duple time for dancing the tango .","chinese":"爲探戈譜寫的一種雙拍子樂曲。"},{"english":"Botou compose a long history of the development of China Zhang.","chinese":"泊頭悠久的歷史譜寫出發展的華章。"}],"related":[]}