{"definition":["spectral analysis (physics)"],"pinyin":["pu3 fen1 xi1"],"simplified":["谱分析"],"rank":60979.0,"normalized_rank":0.8531753249478824,"fraction":3.5618540954311445e-8,"cumulative_fraction":0.9998526478478044,"word":"譜分析","characters":[{"definition":["chart\/list\/table\/register\/score (music)\/spectrum (physics)\/to set to music"],"pinyin":["pu3"],"word":"譜"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["to separate\/to divide\/to analyze"],"pinyin":["xi1"],"word":"析"}],"containing_words":[{"definition":["spectral analysis"],"pinyin":["guang1 pu3 fen1 xi1"],"word":"光譜分析"}],"sentences":[{"english":"Electrophosresis in discontinuous buffer system was applied for the presenting patterns and fractions of the pancreatic amylase isoenzymes.","chinese":"應用不連續緩衝系統薄膜電泳法行酶譜分析。"},{"english":"A method was developed for determination of fipronil residue in leguminous vegetables with solid-phase extraction(SPE) combined with gas chromatography.","chinese":"建立氟蟲腈在豆類蔬菜中的殘留氣相色譜分析方法。"},{"english":"Objective To establish the method of fingerprint analysis of Potentilla anserina by HPLC.","chinese":"目的建立蕨麻藥材HPLC指紋圖譜分析方法。"},{"english":"An HPLC method for determination of cinnamaldehyde in cassia bark capsules was developed.","chinese":"報道了桂皮膠囊中桂皮醛的高效液相色譜分析方法。"},{"english":"A new method based on bispectral analysis for rotating machinery faults diagnosis is presented.","chinese":"提出了基於雙譜分析的旋轉機械故障診斷新方法。"},{"english":"In this paper, the application of ferrograph analysis technology in Shendong Colliery is introduced.","chinese":"本文介紹了鐵譜分析技術在神東礦區的應用情況。"},{"english":"Electrophoresis in discontinuous buffer system was applied to fractionalize the pancreatic amylase isoenzymes.","chinese":"應用不連續緩衝系統薄膜電泳法行酶譜分析。"},{"english":"Gas chromatography shows that there are more than 100 compounds in light hydrocarbon pyrolysates.","chinese":"經毛細色譜分析，熱解輕烴中有100餘種化合物。"},{"english":"With pedigree analysis, the genetic mode of the disease in the family are autosomal dominant inheritance.","chinese":"據系譜分析，該疾病符合常染色體顯性遺傳方式。"},{"english":"In-depth discussion of wavelet mother function is made by using spectrum analysis method.","chinese":"應用譜分析的方法，對小波母函數作了深入的探討。"},{"english":"OPA (HPLC) was adopted to detect the contents of amino acids in hippocampus.","chinese":"採用OPA高效液相色譜分析法檢測海馬氨基酸含量。"},{"english":"ObjectiveTo establish a fingerprint analysis of Origanum vulgare L…","chinese":"目的建立牛至揮發油的指紋圖譜分析方法。"},{"english":"The lung sound feature were extracted by using higher-order spectral technique.","chinese":"用高階譜分析方法，對肺音信號進行了特徵提取。"},{"english":"Therefore, the laser allows a reduction in the number of lasers in a spectroscopic analysis system.","chinese":"由此，光譜分析系統中的激光器數量將得以減少。"},{"english":"SBPV data were analyzed by periodogram.","chinese":"使用週期圖法對SBPV進行譜分析。"},{"english":"Principles and applications of modern near infrared spectroscopic techniques.","chinese":"現代近紅外光譜分析技術的原理及應用。"}],"related":[]}