{"definition":["spectral line"],"pinyin":["pu3 xian4"],"simplified":["谱线"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"譜線","characters":[{"definition":["chart\/list\/table\/register\/score (music)\/spectrum (physics)\/to set to music"],"pinyin":["pu3"],"word":"譜"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"}],"containing_words":[],"sentences":[{"english":"Auto power spectrum of the periodic and quasi-periodic solution has been obtained.","chinese":"得到了週期解和準週期解的自相關功率譜線。"},{"english":"The major use of this spectrograph is to observe the CO molecular spectral lines from dark clouds in the Galaxy.","chinese":"主要用於南天暗星雲中一氧化碳分子譜線的觀測研究。"},{"english":"It is observed that all of the chlorides added to the oxide sample increased the line intensities.","chinese":"實驗中觀察到各種氯化物均能增強譜線強度。"},{"english":"The full width at half maximum (FWHM) of spectral line was obviously broadened.","chinese":"同時，加入氬氣後上述譜線的半寬度明顯加大。"},{"english":"During unsaturated growth, the width of the spectral profile will decrease .","chinese":"在非飽和增長期間，譜線輪廓的寬度將減小。"},{"english":"It's plastered with absorption lines, and each of them can be identified.","chinese":"它和吸收譜線混雜，每一條都能辨認出來。"},{"english":"OK Is everyone seeing that? Yeah, pretty much. OK.","chinese":"分立的各個譜線，有看到的嗎？有很多。"},{"english":"In astronomical situations, the natural line width is seldom directly observed.","chinese":"在天文學研究中，譜線固有寬度很少能直接觀測到。"},{"english":"Whose linewidths are each smaller than the natural linewidth and cavity decay rate.","chinese":"這些線寬小於譜線的自然線寬和腔場的衰減率。"},{"english":"And, sure enough, we see the splitting.","chinese":"這樣，我們就必然能看到譜線的分裂了。"},{"english":"METHODS A group of ultraviolet spectral was used.","chinese":"方法採用中藥紫外譜線組法進行鑑別。"},{"english":"It is suggested that laser intracavity intensity could be a criterion determining the competition ability of both the competing laser bands.","chinese":"提出了以腔內光強作爲衡量譜線競爭能力大小的標準。"}],"related":[]}