{"definition":["to change into\/to turn into\/to become"],"pinyin":["bian4 zuo4"],"simplified":["变作"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"變作","characters":[{"definition":["to change\/to become different\/to transform\/to vary\/rebellion"],"pinyin":["bian4"],"word":"變"},{"definition":["to do\/to grow\/to write or compose\/to pretend\/to regard as\/to feel\/writings or works","worker\/workshop\/(slang) troublesome\/high-maintenance (person)"],"pinyin":["zuo1","zuo4"],"word":"作"}],"containing_words":[],"sentences":[{"english":"Vishnu changed for the dwarf and Beelzebub fighting to save the world's religious story of relief.","chinese":"毗溼奴變作侏儒與魔王戰鬥拯救世界的宗教故事浮雕。"},{"english":"The Life Eternal but a baseless dream?","chinese":"永生會變作無稽的夢想。"},{"english":"And I closed and opened my hand again, and behold there was a bird.","chinese":"我合掌又張開，瞧，它又變作一隻鳥。"},{"english":"I wish to be the Yangtze River.","chinese":"我願變作長江水。"},{"english":"Change your laughter to mourning and your joy to gloom.","chinese":"將喜笑變作悲哀，歡樂變作愁悶。"},{"english":"Change your laughter to mourning and your joy to gloom.","chinese":"將喜笑變作悲哀，歡樂變作愁悶。"},{"english":"Who made the old bailey a judge of beauty?","chinese":"是誰讓老貝勒變作了選美評判員的？"},{"english":"Don't spend time beating on a wall hoping to transform it into a door.","chinese":"不要浪費時間敲一堵牆，你無法將其變作一扇門。"},{"english":"Erh-lang turned into a huge sea crane and pursued the crow.","chinese":"二郎神急抖翎毛，搖身變作大海鶴，鑽上雲霄來啄。"},{"english":"Here was the best the books had to offer coming true.","chinese":"書本知識的精華在這地變作了現實。"},{"english":"But DuPont’s new cellulosic process can turn the entire corn plant into fuel.","chinese":"杜邦公司開發的纖維素新工藝可把整株玉米變作燃料。"},{"english":"Wu-k'ung dived into a brook and changed into a fish.","chinese":"那大聖又將身按下，鑽進溪流裏變作一條魚兒。"},{"english":"Behold, Damascus is taken away from being a city, and it shall be a ruinous heap.","chinese":"看哪，大馬士革已被廢棄，不再爲城，必變作亂堆。"},{"english":"Jean turned to the viewport and thought of the phoenix once more, the transubstantiation of an entire race.","chinese":"吉音轉向窗口，又想起了整個因維人族羣變作的鳳凰。"},{"english":"And the she-devil hiding inside kicked him way up into the air.","chinese":"變作山羊的惡女魔一腳把他遠遠地踢到天上。"},{"english":"And he cast it on the ground， and it became a serpent； and Moses fled from before it.","chinese":"他一丟下去，就變作蛇，摩西便跑開。"}],"related":[]}