{"definition":["variation (calculus)\/deformation"],"pinyin":["bian4 fen1"],"simplified":["变分"],"rank":61127.0,"normalized_rank":0.8552460369650078,"fraction":3.4742675193139865e-8,"cumulative_fraction":0.9998578488846709,"word":"變分","characters":[{"definition":["to change\/to become different\/to transform\/to vary\/rebellion"],"pinyin":["bian4"],"word":"變"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"}],"containing_words":[{"definition":["calculus of variations"],"pinyin":["bian4 fen1 fa3"],"word":"變分法"},{"definition":["variational principle (physics)"],"pinyin":["bian4 fen1 yuan2 li3"],"word":"變分原理"},{"definition":["calculus of variations (math.)"],"pinyin":["bian4 fen1 xue2"],"word":"變分學"}],"sentences":[{"english":"This paper discusses a class of degenerate linear parabolic differential inequations.","chinese":"本文討論了一類拋物型變分不等式的近似收斂問題。"},{"english":"This paper presents a new alternating direction method for a class of variational inequalities.","chinese":"該文對於一類變分不等式提出了一種新的交替方向法。"},{"english":"The boundary condition of restriction and the natural condition of variation for the virtual principle of displacement are given too.","chinese":"明確了虛位移原理的變分約束條件和變分自然條件。"},{"english":"The boundary condition of restriction and the natural condition of variation for the virtual principle of displacement are given too.","chinese":"明確了虛位移原理的變分約束條件和變分自然條件。"},{"english":"The mean field variational method is a basic variational approximate inference method.","chinese":"均值場變分方法是圖模型最基本的變分近似推理方法。"},{"english":"The derivation of generalized variational principles with preconditions by the use of the Lagrange multiplier method.","chinese":"應用拉氏乘子法推導有先決條件的廣義變分原理。"},{"english":"Based on the sub-region generalized variational principle, the solving equations of the problem are derived directly.","chinese":"根據分區廣義變分原理，直接導出問題的求解方程式。"},{"english":"Sufficiant condition for the identity between variational problem and boundary problem is proposed.","chinese":"最後討論了邊值問題與變分問題等價的充分條件。"},{"english":"A convergence estimate and approximation for a kind of parabolic variational inequality is discussed.","chinese":"本文討論了一類拋物型變分不等式的近似收斂問題。"},{"english":"Firstly, the relevant theories of the variation and integrand are introduced.","chinese":"本文首先介紹了變分與變積的相關理論知識。"},{"english":"Based on constraint variational principle, the deformation theoretical FE equations are deduced.","chinese":"基於約束變分原理，推導出全量有限元計算方程。"},{"english":"We first improve the complementary variational principle.","chinese":"首先改進互補變分原理。"},{"english":"Hamiltonian principle is one of the important variation principles in classical mechanics.","chinese":"哈蜜頓原理是經典力學中的重要力學變分原理之一。"},{"english":"Ray equation is derived from Fermat's principle in variation form.","chinese":"本文由費馬原理的變分形式，導出光線微分方程。"},{"english":"I am a postgraduate, and my major is 'Finite-Dimensional Variational Inequalities and Complementarity Problems'.","chinese":"現在是一個在校研究生，專業是變分不等式。"},{"english":"A time-dependent variational expression of S-matrix is developed.","chinese":"本文發展了S散射矩陣的時間相關的變分表示式。"}],"related":[]}