{"definition":["to change\/to fluctuate\/change\/fluctuation"],"pinyin":["bian4 dong4"],"simplified":["变动"],"rank":3297.0,"normalized_rank":0.04612930757069103,"fraction":0.00004287100141206596,"cumulative_fraction":0.8041992149824493,"word":"變動","characters":[{"definition":["to change\/to become different\/to transform\/to vary\/rebellion"],"pinyin":["bian4"],"word":"變"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"}],"containing_words":[],"sentences":[{"english":"I further represent that I will notify GMI of any material changes in writing.","chinese":"此外，我保證將以書面形式通知GMI任何變動情況。"},{"english":"The reality is that the market has changed and I need to change to the new realities.","chinese":"可目前的現實是市場發生了變動而我必須因時應事。"},{"english":"The global fast dynamics for the generalized symmetric regularized long wave equation is considered.","chinese":"考慮了對稱正則長波方程的整體快變動力學。"},{"english":"If the rate of change of neutrons is zero, so be it.","chinese":"如果中子的變動率是0，那就是它了。"},{"english":"Amount of off-replenish is high, maybe a chemistry change would be more appropriate.","chinese":"數量重新補充大，可能化學變動是更加適當的。"},{"english":"The other big corporate tax change now occurring will be negative for capital spending.","chinese":"目前另一項公司稅收大變動不利於資本支出。"},{"english":"This paper studied the cycle-to-cycle variation of in-cylinder peak pressure in gasoline engines.","chinese":"本文對汽油機最高爆發壓力的循環變動進行了研究。"},{"english":"The subsurface fluid and fluid force produced by subsurface fluid universally exist and have influence on tectonism.","chinese":"地下流體及流體力普遍存在且對構造變動產生影響。"},{"english":"Any major non leagued teams removed or added?","chinese":"那關於其他非聯賽球隊的變動情況呢？"},{"english":"Who help you manage the change of car info?","chinese":"當汽車信息變動時，誰幫你修改它。"},{"english":"This is like building a building with a measuring rod that constantly changes.","chinese":"這就好比建造一棟建築，而測量桿卻不停的在變動。"},{"english":"What should people living in permafrost areas be doing to adapt to these changes?","chinese":"住在永凍土區域的人們應該做着什麼適應這些變動？"},{"english":"And what will happen to asset prices if the boomers try to cash in their portfolios?","chinese":"如果他們決定取現，那麼資產的價格會發生何種變動？"},{"english":"This research is to study the influential factors of the housing sold prices.","chinese":"本研究系探討影響中古屋成交價格的變動因素。"},{"english":"He expects Yahoo to be compensated for the move.","chinese":"他期望雅虎公司能夠因該變動得到補償。"},{"english":"There are probably a variety of reasons for the drastic changes in peoples moral concepts.","chinese":"人們道德觀替考劇烈變動可能有不一樣替考端由。"}],"related":[{"definition":["to undulate\/to fluctuate\/wave motion\/rise and fall"],"pinyin":["bo1 dong4"],"word":"波動"},{"definition":["to adjust\/adjustment\/revision\/CL:個|个[ge4]"],"pinyin":["tiao2 zheng3"],"word":"調整"},{"definition":["hidden\/potential\/latent"],"pinyin":["qian2 zai4"],"word":"潛在"},{"definition":["individual\/specific\/respective\/just one or two"],"pinyin":["ge4 bie2"],"word":"個別"},{"definition":["to forecast\/to predict"],"pinyin":["yu4 ce4"],"word":"預測"},{"definition":["influence\/effect\/to influence\/to affect (usually adversely)\/to disturb\/CL:股[gu3]"],"pinyin":["ying3 xiang3"],"word":"影響"},{"definition":["to count\/to calculate\/to compute\/CL:個|个[ge4]"],"pinyin":["ji4 suan4"],"word":"計算"},{"definition":["to expect\/to anticipate"],"pinyin":["yu4 qi1"],"word":"預期"},{"definition":["to trigger\/to spark"],"pinyin":["chu4 fa1"],"word":"觸發"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["in other words"],"pinyin":["huan4 yan2 zhi1"],"word":"換言之"},{"definition":["financial affairs"],"pinyin":["cai2 wu4"],"word":"財務"},{"definition":["completely\/totally\/total\/entire\/overall\/population (statistics)"],"pinyin":["zong3 ti3"],"word":"總體"},{"definition":["whole entity\/entire body\/synthesis\/as a whole (situation, construction, team etc)\/global\/macrocosm\/integral\/holistic\/whole"],"pinyin":["zheng3 ti3"],"word":"整體"},{"definition":["steady\/stable\/stability\/to stabilize\/to pacify"],"pinyin":["wen3 ding4"],"word":"穩定"},{"definition":["to delay\/to postpone\/to keep putting sth off\/to procrastinate\/(computing) to lag"],"pinyin":["yan2 chi2"],"word":"延遲"}]}