{"definition":["variable star"],"pinyin":["bian4 xing1"],"simplified":["变星"],"rank":61489.0,"normalized_rank":0.8603108866285171,"fraction":3.2698988417072806e-8,"cumulative_fraction":0.9998700310095896,"word":"變星","characters":[{"definition":["to change\/to become different\/to transform\/to vary\/rebellion"],"pinyin":["bian4"],"word":"變"},{"definition":["star\/heavenly body\/satellite\/small amount"],"pinyin":["xing1"],"word":"星"}],"containing_words":[],"sentences":[{"english":"The brightness of this star varies over a period of about 11 months.","chinese":"這顆變星的亮度變化大約持續11個月。"},{"english":"Algol is probably the most famous variable star in all the heavens.","chinese":"大陵五可能是天空中最著名的變星了。"},{"english":"Mira is one of the most famous of all variable stars.","chinese":"蒭藁增二是所有著名變星中的一顆。"},{"english":"It's a variable star, Omicron Ceti, whose proper name is Mira.","chinese":"鯨魚座的o星是一顆變星，它的固有名爲蒭藁增二。"},{"english":"Another type of standard candle is a type of star called a Cepheid variable.","chinese":"另一種標準燭光是一種叫做造父變星的恆星。"},{"english":"These objects include variable stars as well as supernovae.","chinese":"這些物體包括象超新星這樣的變星。"},{"english":"American Association of Variable Star Observers.","chinese":"美國變星觀測者協會。"},{"english":"Cepheid's distance can thus be calculated with great accuracy.","chinese":"依次，一個造父變星的距離便可非常準確地計算出來。"},{"english":"After blinking and measuring, two flare stars and 15 variable stars are found.","chinese":"經過閃視和測量，共發現兩顆新耀星和15顆新變星。"},{"english":"Young variable star RY Tauri is emerging from a yellowish cocoon of dust near top center.","chinese":"最上面正中一年輕的變星正在破繭而出。"},{"english":"Welcome to the American Association of Variable Star Observers (AAVSO) Nova Search program.","chinese":"歡迎訪問美國變星協會新星搜索組。"},{"english":"Usually, we analyze variation stars or occultation events by applying aperture photometry.","chinese":"傳統上尋找變星或掩星的方法是測光分析。"},{"english":"Intermediate polars are a type of cataclysmic variable star system.","chinese":"中度極化的雙星系統是激變變星中的一種類型。"}],"related":[]}