{"definition":["converter"],"pinyin":["bian4 liu2 qi4"],"simplified":["变流器"],"rank":61139.0,"normalized_rank":0.8554139325339639,"fraction":3.459669756627792e-8,"cumulative_fraction":0.9998582643369976,"word":"變流器","characters":[{"definition":["to change\/to become different\/to transform\/to vary\/rebellion"],"pinyin":["bian4"],"word":"變"},{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[],"sentences":[{"english":"Converter is the important part of the power accumulator battery testing system.","chinese":"變流器是動力蓄電池組測試系統重要組成部分。"},{"english":"Steady-state analysis of soft-switching converters is discussed in this paper.","chinese":"討論軟開關變流器的穩態分析。"},{"english":"The grid simulator adopts the four-quadrant converter consists of back-to-back mode.","chinese":"該裝置採用背靠背方式的四象限變流器組成。"},{"english":"The high-pressure sodium lamp is dimmed by varying the input voltage of the inverter.","chinese":"高壓鈉燈的調光則藉由改變變流器的輸入電壓。"},{"english":"Test results show that the converter has reached design requirement.","chinese":"試驗結果表明，該變流器達到了設計要求。"},{"english":"Simultaneously, four-quadrant converter capacity problem's simulation and analysis have been done, too.","chinese":"同時還給出了四象限變流器容量問題的分析與仿真。"},{"english":"Phaseshifting reactor is a new method for converter power supply systems harmonic suppression.","chinese":"移相電抗器是變流器供電系統諧波抑制的一種新方法。"},{"english":"This thesis aims at implementation of high frequency linked inverter based-on selected harmonic elimination.","chinese":"本論文旨在研製一基於特定諧波消除之高頻鏈變流器。"},{"english":"The experimental results show that the static inverter achieves high performance targ…","chinese":"實驗結果證明該靜止變流器有高的技術性能指標。"}],"related":[]}