{"definition":["warming\/changing to become warmer"],"pinyin":["bian4 nuan3"],"simplified":["变暖"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"變暖","characters":[{"definition":["to change\/to become different\/to transform\/to vary\/rebellion"],"pinyin":["bian4"],"word":"變"},{"definition":["warm\/to warm"],"pinyin":["nuan3"],"word":"暖"}],"containing_words":[{"definition":["global warming"],"pinyin":["shi4 jie4 bian4 nuan3"],"word":"世界變暖"},{"definition":["global warming"],"pinyin":["quan2 qiu2 qi4 hou4 bian4 nuan3"],"word":"全球氣候變暖"},{"definition":["global warming (PRC usage)\/written 全球暖化 in Taiwan"],"pinyin":["quan2 qiu2 bian4 nuan3"],"word":"全球變暖"}],"sentences":[{"english":"Global warming caused a dryer and warmer climate in the centeral part of Qinghai-Tibet plateau.","chinese":"受全球變暖影響，青藏高原氣候呈現出暖幹趨勢。"},{"english":"And all of this, of course, ignores the benefits of limiting global warming.","chinese":"而所有這一切都忽略了遏制全球變暖所帶來的好處。"},{"english":"On others, such as global warming, the two countries are at opposite ends of the spectrum.","chinese":"在全球變暖等其它問題上，兩國更是處於對立的兩級。"},{"english":"The implications for desertification and global warming are immense.","chinese":"沙漠化和全球變暖之間有着千絲萬縷的聯繫。"},{"english":"If you believe that, the world will continue warming.","chinese":"如果你相信這一點，那麼世界將繼續變暖。"},{"english":"Global warming will likely increase the number of heat-----related illnesses and deaths.","chinese":"全球變暖可能會增加與熱相關的疾病發生並造成死亡。"},{"english":"The afternoon grew a little warmer and the snow came thicker than ever.","chinese":"下午稍微變暖和了一點，雪卻前所未有地更厚了。"},{"english":"The warming of the Earth and the con- sequent climatic changes affect us all.","chinese":"地球變暖以及隨之而來的氣候變化影響着我們所有人。"},{"english":"Windy Trend Linked to Global Warming?","chinese":"多風的趨勢與氣候變暖有關嗎？"},{"english":"It seems counterintuitive that climate change could be responsible for both withering droughts and devastating floods.","chinese":"如果說乾旱和洪水都源於氣候變暖，這有些違背直覺。"},{"english":"It also confirms the notion that planting more trees in tropical rainforests could help slow global warming worldwide.","chinese":"而在熱帶雨林種更多的樹則會減緩全球變暖。"},{"english":"My fleas are freaking out about globe warming.","chinese":"我的跳蚤因全球變暖而反應異常。"},{"english":"We start on about global warming and the environment again.","chinese":"我們又開始討論起全球變暖和環境。"},{"english":"The explanation is a warming climate and a weather phenomenon, scientists said.","chinese":"科學家的解釋是氣候變暖和天氣現象。"},{"english":"Will Prize-Winning Novels Shift Attitudes on Global Warming?","chinese":"獲獎小說會轉變對全球變暖的態度嗎？"},{"english":"The global-warming documentary \"An Inconvenient Truth\" ultimately won the prize.","chinese":"最終反映全球變暖的《難以忽視的真相》獲獎。"}],"related":[]}