{"definition":["metamorphic rock (geology)"],"pinyin":["bian4 zhi4 yan2"],"simplified":["变质岩"],"rank":57459.0,"normalized_rank":0.8039259580540904,"fraction":5.970484938653026e-8,"cumulative_fraction":0.9996865499786538,"word":"變質岩","characters":[{"definition":["to change\/to become different\/to transform\/to vary\/rebellion"],"pinyin":["bian4"],"word":"變"},{"definition":["character\/nature\/quality\/plain\/to pawn\/pledge\/hostage\/to question\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"質"},{"definition":["cliff\/rock"],"pinyin":["yan2"],"word":"岩"}],"containing_words":[],"sentences":[{"english":"The neo-Archean rocks possibly exist in Tieklik metamorphic rocks.","chinese":"鐵克力克可能有新太古代變質岩系的存在。"},{"english":"The Precambrian metamorphic rocks in Northern Fujian are the important part consisting of the Cathaysian palaeocontinental basement.","chinese":"聞北前寒武紀變質岩是華夏古陸基底的重要組成部分。"},{"english":"Apart from these young Danxia landforms, a variety of metamorphic rocks can also be viewed at the source of the Laodao River.","chinese":"撈刀河源頭區除了這年輕的丹霞，還有各種變質岩。"},{"english":"The metamorphic petrology of eclogites from northern Dabie Mountains was performed.","chinese":"研究了大別山北部榴輝巖的變質岩岩石學。"},{"english":"It can therefore, be deduced that the protolith from which sapphirine was derived is not necessarily magnesiorich pelite.","chinese":"含假藍寶石的變質岩石之原巖未必是富鎂泥質岩。"},{"english":"All the gems that have been discovered occur in the hypometamorphic rock belts.","chinese":"已發現的寶玉石均產於深變質岩帶中。"},{"english":"Marble, a metamorphic rock, forms when limestone re- crystallizes.","chinese":"大理岩，一種變質岩，在灰巖重結晶時形成。"},{"english":"Wangjiawaizi gold deposit occurs in Lower Proterozoic opimetamorphic rock series.","chinese":"王家崴子金礦牀賦存於遼南古元古代淺變質岩系中。"},{"english":"Is the tectonic setting of South Anhui metamorphic rocks an ancient land or an orogen?","chinese":"皖南變質岩分佈區是古陸還是一個造山帶？"},{"english":"The host rocks of the ore bodies, the Gaixian Formation of Liaohe Group, are a medium grade metamorphosed rock of the Early Proterogoic.","chinese":"礦體圍巖爲早元古界遼河羣蓋縣組中部變質岩系。"},{"english":"Almost all kinds of metamorphic rocks can be discovered here.","chinese":"變質岩幾乎所有類型的小構造，在這裏都找得到。"},{"english":"Wangjiawaizi gold deposit occurrs in Lower Proterozoic opimetamorphic rock series.","chinese":"王家崴子金礦牀賦存於遼南古元古代淺變質岩系中。"},{"english":"This precious mineral is found as crystals within metamorphic rock.","chinese":"我們可以在變質岩中發現這種珍貴礦物的結晶體。"},{"english":"Basement of the basins is composed of Uranium-bearing granite and high-and medium-grade metamorphic rocks.","chinese":"盆地基底爲花崗岩和中高級變質岩，鈾源條件良好。"},{"english":"Precambrian metamorphic rocks constituted the basin basement.","chinese":"盆地的基底是前寒武系變質岩。"},{"english":"The oldest metamorphic rock and the youngest Danxia landscapes coexist.","chinese":"這裏，湖南最老的變質岩和最年青的丹霞共存。"}],"related":[]}