{"definition":["(transformer) substation"],"pinyin":["bian4 dian4 zhan4"],"simplified":["变电站"],"rank":15346.0,"normalized_rank":0.21471045010003775,"fraction":0.000003984459325196438,"cumulative_fraction":0.9604392041880564,"word":"變電站","characters":[{"definition":["to change\/to become different\/to transform\/to vary\/rebellion"],"pinyin":["bian4"],"word":"變"},{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["station\/to stand\/to halt\/to stop\/branch of a company or organization\/website"],"pinyin":["zhan4"],"word":"站"}],"containing_words":[],"sentences":[{"english":"The powerhouse is designed to be of shaft and semi-underground type and the substation of open type.","chinese":"廠房採用豎井半地下式佈置，開敞式變電站。"},{"english":"In this paper, an on-line monitoring device for fast transient overvoltages on substations is designed.","chinese":"本文設計了一個變電站瞬時過電壓在線監測系統。"},{"english":"An intelligent equipment which can transmit degrees of ammeters in power system is designed.","chinese":"設計了一種用於電力變電站的智能抄表裝置。"},{"english":"The substation equipped with a transformer of 500 KVA is at the south of the plant.","chinese":"在工程的南邊有一座裝有五百千伏安變電器的變電站。"},{"english":"The system has been put into use in Changsha Mawangdui Unatended Substation.","chinese":"該系統已在長沙馬王堆無人值班變電站投入運行。"},{"english":"This paper studies the model of each element in Tang Yin substation.","chinese":"本文在分析了湯陰變電站各元件的諧波參數。"},{"english":"Problem is also encountered in connections between underground lines and substations.","chinese":"地下電纜線路與變電站聯接時還會碰到問題。"},{"english":"An insulated conductor forming part of the return circuit and connecting the rest of the re-turn circuit to the substation.","chinese":"形成部分迴流且連接變電站其餘迴路的絕緣導線。"},{"english":"It is well known that substations are the key of power transmission system .","chinese":"衆所周知，變電站是輸配電系統中的重要環節。"},{"english":"This paper introduces the application of CANbus network in substation automation system SAS .","chinese":"介紹了CAN總線在變電站自動化系統中的實際應用。"},{"english":"Usually, there is no interconnection between the circuits energized by the various substations.","chinese":"通常，由不同變電站送電的線路之間無相互聯接。"},{"english":"The power failure took a toll on two traction substations along the Yingtan-Xiamen electric railway.","chinese":"停電影響鷹廈電氣化鐵路2個牽引變電站。"},{"english":"The sun sets over the Islington substation in Christchurch, New Zealand.","chinese":"落日的餘暉籠罩着新西蘭基督城的伊斯靈頓變電站。"},{"english":"Substations and periphery stations can have several user lines or branch channels.","chinese":"變電站等設外圍站可提供若干條用戶線或轉接通道。"},{"english":"In substations, Switching operation will give rise to transient overvoltage.","chinese":"在變電站內，開關的操作將產生瞬態過電壓。"},{"english":"This system has been running safely for 7 month, and achieved desired result.","chinese":"本系統在某縣三個變電站投運7個月以來，效果良好。"}],"related":[{"definition":["electricity generating station\/power station"],"pinyin":["fa1 dian4 zhan4"],"word":"發電站"},{"definition":["a power station\/an electricity generating plant"],"pinyin":["dian4 zhan4"],"word":"電站"},{"definition":["hydroelectric power plant"],"pinyin":["shui3 dian4 zhan4"],"word":"水電站"},{"definition":["water treatment plant"],"pinyin":["wu1 shui3 chu3 li3 chang3"],"word":"污水處理廠"},{"definition":["electrical network"],"pinyin":["dian4 wang3"],"word":"電網"},{"definition":["unit in charge of construction\/builder"],"pinyin":["shi1 gong1 dan1 wei4"],"word":"施工單位"},{"definition":["electricity transmission\/to transmit electricity"],"pinyin":["shu1 dian4"],"word":"輸電"},{"definition":["pipeline\/general term for pipes, cables etc"],"pinyin":["guan3 xian4"],"word":"管線"},{"definition":["sluice\/water gate\/waterlocks\/floodgate\/lock\/dam"],"pinyin":["shui3 zha2"],"word":"水閘"},{"definition":["power plant"],"pinyin":["fa1 dian4 chang3"],"word":"發電廠"},{"definition":["bridge pier"],"pinyin":["qiao2 dun1"],"word":"橋墩"},{"definition":["(electric) cable"],"pinyin":["dian4 lan3"],"word":"電纜"},{"definition":["railway line"],"pinyin":["tie3 lu4 xian4"],"word":"鐵路線"},{"definition":["to construct\/to erect"],"pinyin":["jia4 she4"],"word":"架設"},{"definition":["monkey (dialect)\/little monkey (affectionate term for children, subordinates)"],"pinyin":["ma3 liu2"],"word":"馬騮"},{"definition":["heavy industry\/manufacturing"],"pinyin":["zhong4 gong1 ye4"],"word":"重工業"}]}