{"definition":["to make way (for sth)"],"pinyin":["rang4 lu4"],"simplified":["让路"],"rank":19680.0,"normalized_rank":0.2753487330880193,"fraction":0.0000024735908871754404,"cumulative_fraction":0.9740589100593048,"word":"讓路","characters":[{"definition":["to yield\/to permit\/to let sb do sth\/to have sb do sth\/to make sb (feel sad etc)\/by (indicates the agent in a passive clause, like 被[bei4])"],"pinyin":["rang4"],"word":"讓"},{"definition":["road\/CL:條|条[tiao2]\/journey\/route\/line (bus etc)\/sort\/kind","surname Lu"],"pinyin":["Lu4","lu4"],"word":"路"}],"containing_words":[],"sentences":[{"english":"No problem is permanent storms always give way to the sun.","chinese":"風暴總會給陽光讓路，寒冬總會轉變爲暖春。"},{"english":"If the car does not yield to pedestrian, the car could be ticketed.","chinese":"大多數國家，如果車子不給行人讓路，會被抄罰單的。"},{"english":"Power -driven heavier - than -air aircraft shall give way to gliders.","chinese":"重於空氣的動力驅動飛機應該給滑翔機讓路。"},{"english":"Your project will have to make way, for the main project.","chinese":"你們的工程得給重點工程讓路。"},{"english":"A fat sow was grubbing about near the gate and refused to move out of our way.","chinese":"一隻肥母豬在大門口拱來拱去，不肯給我們讓路。"},{"english":"I will never make way for a fool.","chinese":"我從來不會給一個傻瓜讓路。"},{"english":"When entering a trail or starting a descent, yield to other skiers.","chinese":"進入滑雪道或開始下滑時，要給其他滑雪者讓路。"},{"english":"Make way, oh, make way for my Eastern Rose.","chinese":"讓路，哦，請爲我美麗的東方玫瑰讓點路。"},{"english":"Aeroplanes shall give way to power -driven heavier - than -air aircraft.","chinese":"飛機應該給重於空氣的動力驅動飛機讓路。"},{"english":"Cars have to yield to pedestrians at zebra crossings.","chinese":"汽車須在斑馬線前停下來讓路予行人。"},{"english":"We did not give way to bitterness.","chinese":"我們沒有給苦難和怨恨讓路。"},{"english":"Anti-terrorism gave way to its much more potent cousin, anti-insurgency.","chinese":"反恐讓路給了其更有力的表親，平叛。"},{"english":"An optimization opportunity model is proposed for given-way vessel to take collision avoidance action.","chinese":"應用多種理論方法建立了讓路船避碰時機優化模型。"},{"english":"Storms always give away to the sun. Winner always thaws into springtime.","chinese":"風暴總會給陽光讓路，寒冬總會轉變爲暖春。"},{"english":"Matteo Brighi might make way for Simone Perrotta in a more attacking formation.","chinese":"布里吉可能需要給佩羅塔讓路，使陣容更具攻擊性。"},{"english":"The tears are not just giving ways to joy, they produce joy.","chinese":"所以，淚水不僅爲喜樂讓路，而且它們將生髮出喜樂。"}],"related":[{"definition":["to watch with folded arms (idiom); to look on without lifting a finger"],"pinyin":["xiu4 shou3 pang2 guan1"],"word":"袖手旁觀"},{"definition":["to contend on strong grounds\/to argue strongly for what is right"],"pinyin":["ju4 li3 li4 zheng1"],"word":"據理力爭"},{"definition":["lit. bashing sideways and colliding straight on (idiom); to push through shoving and bumping\/to barge\/to charge around violently"],"pinyin":["heng2 chong1 zhi2 zhuang4"],"word":"橫衝直撞"},{"definition":["hissing sound\/to hiss (as a sign of displeasure)"],"pinyin":["xu1 sheng1"],"word":"噓聲"},{"definition":["the content of a conversation\/words\/remarks"],"pinyin":["yi1 xi2 hua4"],"word":"一席話"},{"definition":["to put forward plans and ideas (also derogatory)\/to give advice (idiom)"],"pinyin":["chu1 mou2 hua4 ce4"],"word":"出謀劃策"},{"definition":["lit. a horse that brings trouble to its herd (idiom)\/fig. troublemaker\/black sheep\/rotten apple"],"pinyin":["hai4 qun2 zhi1 ma3"],"word":"害群之馬"},{"definition":["monkey (dialect)\/little monkey (affectionate term for children, subordinates)"],"pinyin":["ma3 liu2"],"word":"馬騮"},{"definition":["to whine on for days (idiom)\/to endlessly grumble complaints\/incessant whining"],"pinyin":["jiao4 ku3 lian2 tian1"],"word":"叫苦連天"},{"definition":["to oppose each other with equal harshness (idiom); tit for tat\/measure for measure"],"pinyin":["zhen1 feng1 xiang1 dui4"],"word":"針鋒相對"},{"definition":["to plan\/to arrange"],"pinyin":["bo4 hua4"],"word":"擘劃"},{"definition":["relay station"],"pinyin":["zhong1 ji4 zhan4"],"word":"中繼站"},{"definition":["to avoid the important and dwell on the trivial\/to keep silent about major charges while admitting minor ones"],"pinyin":["bi4 zhong4 jiu4 qing1"],"word":"避重就輕"},{"definition":["to turn a blind eye to"],"pinyin":["shi4 ruo4 wu2 du3"],"word":"視若無睹"},{"definition":["to be reluctant to give up a post"],"pinyin":["lian4 zhan4"],"word":"戀棧"},{"definition":["variant of 小題大做|小题大做[xiao3 ti2 da4 zuo4]"],"pinyin":["xiao3 ti2 da4 zuo4"],"word":"小題大作"}]}