{"definition":["vertical shaft (for mining, ventilation systems etc)"],"pinyin":["shu4 jing3"],"simplified":["竖井"],"rank":38338.0,"normalized_rank":0.5363983602199432,"fraction":4.494651131078892e-7,"cumulative_fraction":0.9957973591562098,"word":"豎井","characters":[{"definition":["to erect\/vertical\/vertical stroke (in Chinese characters)"],"pinyin":["shu4"],"word":"豎"},{"definition":["Jing, one of the 28 constellations of Chinese astronomy\/surname Jing","a well\/CL:口[kou3]\/neat\/orderly"],"pinyin":["Jing3","jing3"],"word":"井"}],"containing_words":[],"sentences":[{"english":"The temporary concrete lining guard wall method was used in excavating vertical shaft.","chinese":"豎井開挖採用了臨時混凝士襯砌護壁措施。"},{"english":"The mine shaft sinking with a mine shaft drilling is a reliable mine shaft construction method to pass through a deep and thick alluvium.","chinese":"鑽井法鑿井是通過深厚沖積層最可靠的豎井施工方法。"},{"english":"The powerhouse is designed to be of shaft and semi-underground type and the substation of open type.","chinese":"廠房採用豎井半地下式佈置，開敞式變電站。"},{"english":"These silos and isolation are the things that the SOA solutions struggle against.","chinese":"這些豎井和孤立就是SOA解決方案要鬥爭的對象。"},{"english":"There will be many problems in the design and construction of vertical shaft when it passes through the worked-out mine area.","chinese":"設計與建設穿越廢礦區的豎井時會遇到許多問題。"},{"english":"The Changjiang rub-river tunnel is designed as inverted siphon with drop shaft.","chinese":"長江過江隧道採用了豎井式倒虹吸管的佈置形式。"},{"english":"The circular tube belt conveyor is a new method for hoisting coal in a vertical shaft.","chinese":"圓管膠帶輸送機是豎井提升煤炭的一種新方法。"},{"english":"Fixed the track in the shaft side to prevent the sedan theater box rocking.","chinese":"在豎井的側面固定了軌道以防止轎廂的晃動。"},{"english":"Our goal is to transcend silos.","chinese":"我們的目標是超越豎井。"},{"english":"Jack directed his light down into the shaft and asked Karen and Gnea to do the same.","chinese":"傑克將光束打入豎井，也請凱倫和妮雅照辦。"},{"english":"His voice rose from the shaft like that of an oracle.","chinese":"他的聲音從豎井下升起，如同天啓神喻。"},{"english":"Systems are built in silos.","chinese":"系統是在豎井中構建的。"},{"english":"In Yangzhuoyong Lake Hydropower Station, the Surge shaft, a differential structure, is composed of vertical shaft and upper chamber.","chinese":"羊湖電站調壓井爲差動式結構，由豎井和上室組成。"},{"english":"The calculations are divided into two cases-closed shaft and open shaft.","chinese":"計算分爲豎井封閉及豎井開啓兩種情況。"},{"english":"The calculations are divided into two cases-closed shaft and open shaft.","chinese":"計算分爲豎井封閉及豎井開啓兩種情況。"},{"english":"Those single-domain applications are said to be \"siloed.\"","chinese":"這些單一域應用程序也稱爲“豎井”應用程序。"}],"related":[]}