{"definition":["pattra palm tree (loan from Sanskrit, Corypha umbraculifera), whose leaves were used as paper substitute for Buddhist sutras"],"pinyin":["bei4 duo1"],"simplified":["贝多"],"rank":66500.0,"normalized_rank":0.9304212779651057,"fraction":1.0948322014644912e-8,"cumulative_fraction":0.9999735244757412,"word":"貝多","characters":[{"definition":["cowrie\/shellfish\/currency (archaic)","surname Bei"],"pinyin":["Bei4","bei4"],"word":"貝"},{"definition":["many\/much\/often\/a lot of\/numerous\/more\/in excess\/how (to what extent)\/multi-\/Taiwan pr. [duo2] when it means \"how\""],"pinyin":["duo1"],"word":"多"}],"containing_words":[{"definition":["Ludwig van Beethoven (1770-1827), German composer"],"pinyin":["Bei4 duo1 fen1"],"word":"貝多芬"},{"definition":["Barbados, Caribbean island (Tw)"],"pinyin":["Ba1 bei4 duo1"],"word":"巴貝多"},{"definition":["Talipot palm (Corypha umbraculifera), whose leaves were used as writing media"],"pinyin":["bei4 duo1 luo2 shu4"],"word":"貝多羅樹"}],"sentences":[{"english":"When he was 15, and was working in a Church as an assistance organist, Ludwig was practically supporting the family.","chinese":"貝多芬15歲時就在教堂擔任助理風琴師，掙錢養家。"},{"english":"We've sort of gone from the Beach Boys to Beethoven here.","chinese":"我們好像從沙灘男孩一下跳到了貝多芬。"},{"english":"So how does Beethoven go about making the Ode to Joy joyful?What does he do here?","chinese":"貝多芬是怎樣讓歡樂頌變得那麼歡樂的呢？"},{"english":"But they did not have patience for this, nor him to read their lips.","chinese":"貝多芬對此沒有耐心，也不去看對方的口型。"},{"english":"Beethoven String Quartet, Op. 18, No. 2, final Movement.","chinese":"貝多芬絃樂四重奏，作品18號，第二首，末樂章。"},{"english":"Berlioz compared him favorably to Beethoven and Gluck.","chinese":"柏遼茲認爲他並不亞於貝多芬和格魯克。"},{"english":"In his youth he fell under the influence of Beethoven.","chinese":"他年輕時受到貝多芬的影響。"},{"english":"Beethoven Sonata for Piano and Violin No. 4,5,9","chinese":"貝多芬第4，5，9號鋼琴與小提琴奏鳴曲。"},{"english":"To the melody of Moonlight Sonata of Beethoven.","chinese":"到貝多芬《月光奏鳴曲》旋律暢想。"},{"english":"Journey back into Beethoven's mind with the Borromeo String Quartet.","chinese":"博羅美奧絃樂四重奏將會爲我們進行貝多芬解碼。"},{"english":"And Damisch chose Beethoven's A. N. S Appassionato Sonata for his a reason.","chinese":"達彌施選用了貝多芬的《熱情奏鳴曲》只有一個理由。"},{"english":"My recon squad had engaged Saddam's army in a small Bedouin encampment.","chinese":"我的偵察班在貝多因的一個小營地與薩達姆軍隊交戰。"},{"english":"This movement is the most popular of Beethoven’s Symphony No. 7.","chinese":"這首樂章是貝多芬《第七號交響曲》中最受歡迎的。"},{"english":"Vicki had brought some Beethoven, which I put on the CD player.","chinese":"維姬隨身帶來貝多芬的唱片，我把它放進了CD機。"},{"english":"I am looking for a record of Beethovens Sixth Symphony.","chinese":"我正在找貝多芬第六交響曲的唱片。"},{"english":"They will perform Beethoven's Eroica at the concerto tonight.","chinese":"他們將在今晚的音樂會上演奏貝多芬的《英雄》。"}],"related":[]}