{"definition":["to be responsible for"],"pinyin":["fu4 you3"],"simplified":["负有"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"負有","characters":[{"definition":["to bear\/to carry (on one's back)\/to turn one's back on\/to be defeated\/negative (math. etc)"],"pinyin":["fu4"],"word":"負"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"}],"containing_words":[{"definition":["at fault\/blamed for\/responsible (for a blunder or crime)"],"pinyin":["fu4 you3 ze2 ren4"],"word":"負有責任"}],"sentences":[{"english":"Management of the firm culpable for its losses will be terminated.","chinese":"對公司虧損負有責任的管理層將被撤職。"},{"english":"Both firms deny any responsibility for the tragedy.","chinese":"兩家公司都否認對這一慘禍負有責任。"},{"english":"In combating the illicit trafficking of SALW, national governments shoulder the primary responsibilities.","chinese":"在打擊小武器非法貿易方面，各國政府負有首要責任。"},{"english":"Mr Tourre was responsible for the CDO, known as ABACUS.","chinese":"以神機妙算而聞名的圖雷先生對於CDO負有責任。"},{"english":"UL-STR shall not be held responsible for these risks, which are out of its control.","chinese":"乙方不對此等超出乙方控制範圍的風險負有責任。"},{"english":"These are online communities that come with commitments too.","chinese":"這些也都是你對之負有責任的網絡社區。"},{"english":"Much of the responsibility for the mess belongs with Mr Hatoyama.","chinese":"鳩山對這一混亂的局面負有很大的責任。"},{"english":"FAO as an institution should be held responsible.","chinese":"糧農組織作爲一個機構應當負有責任。"},{"english":"In my view, he is culpable for four goals so far.","chinese":"依我看來，至今爲止他應對四粒失球負有責任。"},{"english":"Is Bill fully morally responsible for killing his wife and children?","chinese":"比爾是否對殺死他的妻兒負有道德責任？"},{"english":"I am to blame for his lateness.","chinese":"我對他的遲到負有責任。"},{"english":"Therefore, experiment teaching of methodology is highly responsible for it.","chinese":"對此，教學法實驗課負有重任。"},{"english":"But Pyongyang denies it is responsible for the attack.","chinese":"但是平壤否認對那次襲擊負有責任。"},{"english":"We all take responsibility for that.","chinese":"我們都對此負有責任”。"},{"english":"For the decipherment of the sign, however, he bears the entire responsibility.","chinese":"爲了解釋此一徵象，他負有全部的責任。"},{"english":"It isn't the players, but the supporters, that are responsible for football hooliganism .","chinese":"不僅是選手，支持者對足球流氓行爲也都有負有責任。"}],"related":[]}