{"definition":["negative pole\/cathode"],"pinyin":["fu4 ji2"],"simplified":["负极"],"rank":48962.0,"normalized_rank":0.6850419039357519,"fraction":1.6115930005557314e-7,"cumulative_fraction":0.9988016822151682,"word":"負極","characters":[{"definition":["to bear\/to carry (on one's back)\/to turn one's back on\/to be defeated\/negative (math. etc)"],"pinyin":["fu4"],"word":"負"},{"definition":["extremely\/pole (geography, physics)\/utmost\/top"],"pinyin":["ji2"],"word":"極"}],"containing_words":[],"sentences":[{"english":"During choose the direct current power supply, pay attention to the negative and positive.","chinese":"選用直流供電時，注意正負極標識。"},{"english":"Instead they use materials with lattice structures for both positive and negative electrodes.","chinese":"取而代之的是在正極和負極上使用柵格結構材料。"},{"english":"Surface charge density of apoptotic cell was reduced by electret.","chinese":"負極性駐極體能減少凋亡細胞的表面電荷量。"},{"english":"Please notice the place of anode and cathode when pit in the batteries.","chinese":"安裝電池時請注意放好正負極位置。"},{"english":"Is the thermocouple positive and negative poles are consistent.","chinese":"是熱電偶的正負極是否一致。"},{"english":"That is how that works. By the way, this is the cathode.","chinese":"那就是它怎麼起作用的，順便說一下，這就是負極。"},{"english":"Must connect the laser tube correctly positively and negatively extremely.","chinese":"要正確連接激光管的正負極。"},{"english":"Do not directly touch terminal by hand.","chinese":"不要直接用手接觸電容器正負極。"},{"english":"On the other hand, prepared negative plate expander is commercially available.","chinese":"另一方面，在商業上可購到現成的負極板膨脹劑。"},{"english":"Studies of tin-based anode materials for lithium ion secondary batteries are reviewed.","chinese":"綜述了鋰離子電池錫基負極材料的研究進展。"},{"english":"Studies and developments of anode materials for lithium ion secondary battery are re- viewed.","chinese":"綜述了鋰離子二次電池負極材料的研究和進展。"},{"english":"The radio won't work, if you swap the cell's poles over.","chinese":"如果你把電池的正負極顛倒了，收音機就不會響了。"},{"english":"The life of titanium negative grid plated with copper was researched.","chinese":"研究了鈦上鍍銅負極板柵的壽命。"},{"english":"All kinds of lead acid batteries are aligned pull screen grid and punching board gate.","chinese":"各種鉛酸性電池正負極拉網板柵及衝孔板柵。"},{"english":"CAW were firstly reported to be applied as a cathode of the lithium-ion secondary batteries in the dissertation.","chinese":"本文首次將碳原子線用作鋰離子二次電池的負極材料。"},{"english":"For an uncoated capillary, the EOF is toward the negative electrode.","chinese":"如果是未加塗層的毛細管，電滲流朝負極移動。"}],"related":[]}