{"definition":["at fault\/blamed for\/responsible (for a blunder or crime)"],"pinyin":["fu4 you3 ze2 ren4"],"simplified":["负有责任"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"負有責任","characters":[{"definition":["to bear\/to carry (on one's back)\/to turn one's back on\/to be defeated\/negative (math. etc)"],"pinyin":["fu4"],"word":"負"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["duty\/responsibility\/to reproach\/to blame"],"pinyin":["ze2"],"word":"責"},{"definition":["surname Ren\/Ren County 任縣|任县[Ren2 Xian4] in Hebei","to assign\/to appoint\/to take up a post\/office\/responsibility\/to let\/to allow\/to give free rein to\/no matter (how, what etc)\/classifier for terms served in office, or for spouses, girlfriends etc (as in 前任男友)"],"pinyin":["Ren2","ren4"],"word":"任"}],"containing_words":[],"sentences":[{"english":"Management of the firm culpable for its losses will be terminated.","chinese":"對公司虧損負有責任的管理層將被撤職。"},{"english":"Both firms deny any responsibility for the tragedy.","chinese":"兩家公司都否認對這一慘禍負有責任。"},{"english":"Mr Tourre was responsible for the CDO, known as ABACUS.","chinese":"以神機妙算而聞名的圖雷先生對於CDO負有責任。"},{"english":"UL-STR shall not be held responsible for these risks, which are out of its control.","chinese":"乙方不對此等超出乙方控制範圍的風險負有責任。"},{"english":"These are online communities that come with commitments too.","chinese":"這些也都是你對之負有責任的網絡社區。"},{"english":"FAO as an institution should be held responsible.","chinese":"糧農組織作爲一個機構應當負有責任。"},{"english":"In my view, he is culpable for four goals so far.","chinese":"依我看來，至今爲止他應對四粒失球負有責任。"},{"english":"I am to blame for his lateness.","chinese":"我對他的遲到負有責任。"},{"english":"But Pyongyang denies it is responsible for the attack.","chinese":"但是平壤否認對那次襲擊負有責任。"},{"english":"We all take responsibility for that.","chinese":"我們都對此負有責任”。"},{"english":"It isn't the players, but the supporters, that are responsible for football hooliganism .","chinese":"不僅是選手，支持者對足球流氓行爲也都有負有責任。"},{"english":"Both of you will hold each other accountable to your goals and plans.","chinese":"你們互相對達到你們的目標和計劃負有責任。"},{"english":"Acknowledge your role in it so you can avoid repeating it.","chinese":"承認你對婚姻失敗負有責任，從而避免重蹈覆轍。"},{"english":"I think they are responsible for large-scale human miseries in Pakistan.","chinese":"我認爲他們對巴基斯坦的大規模人類慘劇負有責任。"},{"english":"He should be responsible for that.","chinese":"他應該對此事負有責任。"},{"english":"Assemblers should be held accountable for completing their tasks properly.","chinese":"裝配工應該對正確地完成他們的任務負有責任。"}],"related":[]}