{"definition":["to be in charge of\/to take responsibility for\/to be to blame\/conscientious"],"pinyin":["fu4 ze2"],"simplified":["负责"],"rank":780.0,"normalized_rank":0.010913211982147104,"fraction":0.00020170852731240009,"cumulative_fraction":0.580434319884688,"word":"負責","characters":[{"definition":["to bear\/to carry (on one's back)\/to turn one's back on\/to be defeated\/negative (math. etc)"],"pinyin":["fu4"],"word":"負"},{"definition":["duty\/responsibility\/to reproach\/to blame"],"pinyin":["ze2"],"word":"責"}],"containing_words":[{"definition":["person in charge"],"pinyin":["fu4 ze2 ren2"],"word":"負責人"},{"definition":["to take responsibility\/to bear responsibility\/to be responsible"],"pinyin":["fu4 ze2 ren4"],"word":"負責任"}],"sentences":[{"english":"Many southerners said all of the North was responsible for the raid.","chinese":"許多南方人說，所有的北方人都應該對這次襲擊負責。"},{"english":"The team of contributors is generally responsible for the project area and everything in it.","chinese":"貢獻者組成的團隊一般負責該項目區域和其中的一切。"},{"english":"As a safeguard, officers-in-charge of departments are requested to verify identification by comparing signatures.","chinese":"爲安全起見，部門負責主管應比對簽字檢驗身份。"},{"english":"Clerked at One-and-One clothes Store in charge of sales, 1992.","chinese":"1992年，在一加一服裝店當店員，負責銷售。"},{"english":"Big brother says the paper is due tomorrow, or else.","chinese":"老師說，論文明天應交，否則後果由個人負責。"},{"english":"CCS will not be liable for any loss due to any error of the applicant or any other person.","chinese":"本社對因申請方或他人的過錯造成的損失不負責。"},{"english":"Different teams work on the Bolivia site and the Brazil site.","chinese":"玻利維亞站點和巴西站點由不同的團隊負責。"},{"english":"Who could have predicted that within ten years hed be in charge of the whole company?","chinese":"誰曾能預料到在十年內他會成爲整個公司的負責人？"},{"english":"The developer is under the family, is responsible for land which digests encircles .","chinese":"開發商是“下家”，負責消化圈來的土地。"},{"english":"Currently, I'm the general engineer of Shenyang Machine Tools Plant in charge of Quality control.","chinese":"目前我任瀋陽機械工具廠總工程師，負責質量控制。"},{"english":"The Government of Japan will receive further signatures, as the Depositary of the ACTA.","chinese":"作爲協定受託國，日本國政府將負責接收進一步簽名。"},{"english":"To be responsible for the party-masses work of Administration and its directly affiliated institutions.","chinese":"負責局機關及直屬單位的黨羣工作。"},{"english":"I'll tell the checkout person.","chinese":"我會告訴負責退房的人。"},{"english":"Each of the services groupings engages a subject area.","chinese":"其中每個服務分組負責某個主題領域。"},{"english":"I've been tasked with psychoanalyzing Jack after his mental breakdown.","chinese":"我一直在負責對崩潰後的傑克使用精神分析療法。"},{"english":"Arnesen has been given the role of head talent scout, in charge of uncovering football talents.","chinese":"阿內森被任命爲球探總管，負責發掘足球天才。"}],"related":[{"definition":["to give\/to deliver\/to hand over"],"pinyin":["jiao1 gei3"],"word":"交給"},{"definition":["to undertake\/to assume (responsibility etc)"],"pinyin":["cheng2 dan1"],"word":"承擔"},{"definition":["picul (100 catties, 50 kg)\/two buckets full\/carrying pole and its load\/classifier for loads carried on a shoulder pole","to undertake\/to carry\/to shoulder\/to take responsibility"],"pinyin":["dan1","dan4"],"word":"擔"},{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有關"},{"definition":["person\/employee\/member"],"pinyin":["yuan2"],"word":"員"},{"definition":["to organize\/organization\/(biology) tissue\/(textiles) weave\/CL:個|个[ge4]"],"pinyin":["zu3 zhi1"],"word":"組織"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["to target\/to focus on\/to be aimed at or against\/in response to"],"pinyin":["zhen1 dui4"],"word":"針對"},{"definition":["specialist\/specialized\/customized"],"pinyin":["zhuan1 men2"],"word":"專門"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"word":"協助"},{"definition":["independent\/independence\/to stand alone"],"pinyin":["du2 li4"],"word":"獨立"},{"definition":["to believe\/to think\/to consider\/to feel"],"pinyin":["ren4 wei2"],"word":"認為"},{"definition":["to participate (in sth)"],"pinyin":["can1 yu4"],"word":"參與"},{"definition":["should\/ought to\/probably\/must be\/to deserve\/to owe\/to be sb's turn to do sth\/that\/the above-mentioned"],"pinyin":["gai1"],"word":"該"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"}]}