{"definition":["rich man\/moneybags"],"pinyin":["cai2 zhu3"],"simplified":["财主"],"rank":33633.0,"normalized_rank":0.4705693058917354,"fraction":6.824454055795329e-7,"cumulative_fraction":0.9931686098172652,"word":"財主","characters":[{"definition":["money\/wealth\/riches\/property\/valuables"],"pinyin":["cai2"],"word":"財"},{"definition":["owner\/master\/host\/individual or party concerned\/God\/Lord\/main\/to indicate or signify\/trump card (in card games)"],"pinyin":["zhu3"],"word":"主"}],"containing_words":[{"definition":["local wealthy landlord\/country money-bags\/rich provincial"],"pinyin":["tu3 cai2 zhu3"],"word":"土財主"}],"sentences":[{"english":"There was a rich man who was clothed in purple and fine linen and who feasted sumptuously every day.","chinese":"有一個財主穿著紫色袍和細麻布衣服，天天奢華宴樂。"},{"english":"Then said Jesus unto his disciples, Verily I say unto you, That a rich man shall hardly enter into the kingdom of heaven.","chinese":"耶穌對門徒說，我實在告訴你們，財主進天國是難的。"},{"english":"Zhen, a local rich man who also needed warehouses, inspected the property.","chinese":"一位姓甄的財主正需要倉庫，他來看了這些房子。"},{"english":"An upstart like that dares to bandy words with me!","chinese":"這樣一個小財主也敢跟我逗嘴皮子。"},{"english":"And, behold, there was a man named Zacchaeus, which was the chief among the publicans, and he was rich.","chinese":"有一個人名叫撒該，作稅吏長，是個財主。"},{"english":"2A man was there by the name of Zacchaeus; he was a chief tax collector and was wealthy.","chinese":"有一個人名叫撒該，作稅吏長，是個財主。"},{"english":"1As he looked up, Jesus saw the rich putting their gifts into the temple treasury.","chinese":"耶穌擡頭觀看，見財主把捐項投在庫裏。"},{"english":"His grandpa used to be very rich, so there are many antiques in his house.","chinese":"他爺爺原來是財主，家裏有很多骨董。"},{"english":"Her father is rich as Croesus. He owns several houses and factories in other countries.","chinese":"他父親是個大財主，在國外還有幾幢房子和幾家工廠。"},{"english":"Then you must come with me and recover my stolen money.","chinese":"財主邀請他同去把被偷盜的錢財找回來。"},{"english":"It is easier for a camel to go through the eye of a needle, than for a rich man to enter into the kingdom of God.","chinese":"駱駝穿過針的眼，比財主進神的國，還容易呢。"},{"english":"Afanty borrowed a small ingot of gold from a moneybags, but repaid him two ones.","chinese":"阿凡提借了財主一錠金子，還他時給了他兩錠。"},{"english":"For it is easier for a camel to go through a needle's eye, than for a rich man to enter into the kingdom of God.","chinese":"駱駝穿過針的眼，比財主進神的國，還容易呢。"},{"english":"The rich men in the village call every poor person a fool.","chinese":"鄉里的土財主們把窮人統稱爲愚氓。"},{"english":"Wang Huonan was a rich man in Huainan.","chinese":"王獲楠是淮南的一個財主。"},{"english":"There they sold him to work for a rich man.","chinese":"在那裏，他們將約瑟賣給一個財主，要約瑟爲他工作。"}],"related":[{"definition":["brows raised in delight, eyes laughing (idiom); beaming with joy\/all smiles"],"pinyin":["mei2 kai1 yan3 xiao4"],"word":"眉開眼笑"},{"definition":["offal\/mixed entrails\/trivial matters"],"pinyin":["za2 sui4"],"word":"雜碎"},{"definition":["to run this way and that (idiom); to rush about busily\/to bustle about"],"pinyin":["dong1 ben1 xi1 pao3"],"word":"東奔西跑"},{"definition":["you can net sparrows at the door (idiom); completely deserted"],"pinyin":["men2 ke3 luo2 que4"],"word":"門可羅雀"},{"definition":["young married woman\/mistress\/(fig.) punching bag\/(old) child bride"],"pinyin":["xiao3 xi2 fu5"],"word":"小媳婦"},{"definition":["smile spread across the face (idiom); beaming with pleasure\/all smiles\/joy written across one's face"],"pinyin":["xiao4 zhu2 yan2 kai1"],"word":"笑逐顏開"},{"definition":["to get oneself a wife\/to take a daughter-in-law"],"pinyin":["qu3 xi2 fu4"],"word":"娶媳婦"},{"definition":["arrogant and despotic"],"pinyin":["xiao1 zhang1 ba2 hu4"],"word":"囂張跋扈"},{"definition":["soft skin and tender flesh (idiom)\/smooth-skinned"],"pinyin":["xi4 pi2 nen4 rou4"],"word":"細皮嫩肉"},{"definition":["feudal times"],"pinyin":["feng1 jian4 shi2 dai4"],"word":"封建時代"},{"definition":["penniless"],"pinyin":["yi1 pin2 ru2 xi3"],"word":"一貧如洗"},{"definition":["hanging one's head dispiritedly (idiom); dejected\/crestfallen"],"pinyin":["chui2 tou2 sang4 qi4"],"word":"垂頭喪氣"},{"definition":["to strive for favor"],"pinyin":["zheng1 chong3"],"word":"爭寵"},{"definition":["to look anxious (idiom)\/to look miserable"],"pinyin":["chou2 mei2 ku3 lian3"],"word":"愁眉苦臉"},{"definition":["red in the face\/extremely angry"],"pinyin":["lian3 hong2 bo2 zi5 cu1"],"word":"臉紅脖子粗"},{"definition":["unscrupulous businessperson\/profiteer\/philistine"],"pinyin":["shi4 kuai4"],"word":"市儈"}]}