{"definition":["cargo hold\/cargo bay (of a plane)"],"pinyin":["huo4 cang1"],"simplified":["货舱"],"rank":31325.0,"normalized_rank":0.4382773914625103,"fraction":8.373276676800429e-7,"cumulative_fraction":0.991419864413256,"word":"貨艙","characters":[{"definition":["goods\/money\/commodity\/CL:個|个[ge4]"],"pinyin":["huo4"],"word":"貨"},{"definition":["cabin\/the hold of a ship or airplane"],"pinyin":["cang1"],"word":"艙"}],"containing_words":[{"definition":["sealed cabin"],"pinyin":["mi4 bi4 huo4 cang1"],"word":"密閉貨艙"}],"sentences":[{"english":"Four fixed rings need to be added on upper deck for derrick holds.","chinese":"吊貨艙上層甲板上應裝4個固定環。"},{"english":"If the cargo space ought to be reserved, please send us the necessary application forms.","chinese":"假如要預訂貨艙，請將訂艙表寄給咱們。"},{"english":"Sounding the tanks and cargo hold bilges adjacent to collision area.","chinese":"測量碰撞附近的艙櫃和貨艙污水阱。"},{"english":"Whether you want to hear it or not, you could be allergic to your house-hold pet.","chinese":"不論你要聽與否，你可以到您家過敏貨艙寵物。"},{"english":"The aim of the derrick latched onto the cotton bales and lifted them into the hold.","chinese":"起重機吊臂抓住棉花包，把它們吊進貨艙。"},{"english":"PSCO: Do all the cylinders protect the engine room and cargo holds?","chinese":"所有氣瓶是保護機艙和貨艙的嗎？"},{"english":"Are hold ventilators operational?","chinese":"貨艙通風機能工作嗎？"},{"english":"What was it like day after day in their fetid cargo bay?","chinese":"在惡臭熏天的貨艙中日復一日的生活是什麼樣的？"},{"english":"Are all cargo and bunker tank lids closed?","chinese":"所有液貨艙艙口蓋均已關閉？"},{"english":"The conclusions were of guiding significance to the design of Type-C liquid tank.","chinese":"這些結論對C型液貨艙的設計具有一定的指導意義。"},{"english":"If the cargo space must be reserved， please send us the necessary application forms.","chinese":"如果要預訂貨艙，請將訂艙表寄給我們。"},{"english":"Are fork-lift trucks for cargo holds available?","chinese":"可以提供貨艙內工作的叉車嗎？"},{"english":"Fire alarm displays of holds operational in 10minutes.","chinese":"貨艙的火警顯示10分鐘後工作。"},{"english":"Inspecting fitting accuracy of hatch coaming on board.","chinese":"貨艙口圍板船上安裝精度檢查。"},{"english":"The hold was flooded, and the sailors were pumping out the water.","chinese":"貨艙積了水，水手們在往外抽水。"},{"english":"The crane lifted the bales into the hold.","chinese":"起重機將大包吊進貨艙。"}],"related":[]}