{"definition":["child trafficking","trafficker\/dealer\/monger\/peddler"],"pinyin":["fan4 zi3","fan4 zi5"],"simplified":["贩子"],"rank":14283.0,"normalized_rank":0.1998377009500091,"fraction":0.000004496548840228097,"cumulative_fraction":0.9559333263556288,"word":"販子","characters":[{"definition":["to deal in\/to buy and sell\/to trade in\/to retail\/to peddle"],"pinyin":["fan4"],"word":"販"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi3","zi5"],"word":"子"}],"containing_words":[{"definition":["ticket scalper"],"pinyin":["piao4 fan4 zi5"],"word":"票販子"},{"definition":["middleman\/buyer and seller"],"pinyin":["er4 dao4 fan4 zi5"],"word":"二道販子"}],"sentences":[{"english":"The drug trafficker is concerned about the condition of the traditional concert.","chinese":"毒品販子擔心傳統音樂會的狀況。"},{"english":"Several rum runners were arrested in the train.","chinese":"幾個私酒販子在火車上被捕了。"},{"english":"The dealer sells each cat for about 50 yuan (US$7.31) to restaurants.","chinese":"這些貓販子以每隻貓50元人民幣的價格賣給餐館。"},{"english":"The wine-sellers elbow their way through the crowd with great black skins on their shoulders.","chinese":"酒販子肩上扛着黑色大皮簍在人羣裏推搡着前進。"},{"english":"The pedlars were sitting there minding their own business.","chinese":"小販子在忙自己的生意。"},{"english":"On Thursday, the authorities caught one of the fishmongers.","chinese":"週二，當局逮捕了其中的一個魚販子。"},{"english":"The police are launching a major attack on drug dealers.","chinese":"警方對毒品販子發動了大規模的攻擊。"},{"english":"He bought the ticket at a high price from a (ticket) scalper.","chinese":"他從一個票販子手裏高價買了張黃牛票。"},{"english":"A lot of these newly rich people are just big bootleggers, you know.","chinese":"有很多這樣的暴發戶都是大私酒販子，你要知道。"},{"english":"The slavers had killed one of Yarna's children in the attack.","chinese":"奴隸販子在襲擊中殺害了亞娜的一個孩子。"},{"english":"Obviously, the rabbit vendor by the train station was a very clever chap.","chinese":"很明顯，火車站賣小兔的販子太狡猾了。"},{"english":"When are you going to start harassing the traffickers?","chinese":"你打算什麼時候去找找那些人販子的麻煩？"},{"english":"He went among the drug dealers in disguise.","chinese":"他化裝混到毒品販子當中。"},{"english":"The team posed as drug dealers to trap the ringleaders.","chinese":"該隊隊員裝扮成毒品販子，誘捕罪犯頭目。"},{"english":"The love of war has gone AWOL at National Review.","chinese":"國家評論上的戰爭販子也已經偃旗息鼓了。"},{"english":"Faithful grand also at the same time follow at sb' heels and go, think uncover kidnaps and sell dealer this.","chinese":"忠浩亦同時尾隨而去，想揪出這個拐賣販子。"}],"related":[]}