{"definition":["your distinguished country"],"pinyin":["gui4 guo2"],"simplified":["贵国"],"rank":33968.0,"normalized_rank":0.4752563905250934,"fraction":6.639062469680675e-7,"cumulative_fraction":0.9933938576748422,"word":"貴國","characters":[{"definition":["expensive\/noble\/precious\/(honorific) your"],"pinyin":["gui4"],"word":"貴"},{"definition":["country\/nation\/state\/national\/CL:個|个[ge4]","surname Guo"],"pinyin":["Guo2","guo2"],"word":"國"}],"containing_words":[],"sentences":[{"english":"You may also forward us a list of qualified drivers from your respective countries for our reference.","chinese":"你也可以自貴國傳一份合格選手的名單給我們參考。"},{"english":"Is it customary for guests at hotels in your country to tip the waiters?","chinese":"在貴國住旅館的客人依慣例是否給侍者小費。"},{"english":"Therefore, I want to go to your post-graduate study.","chinese":"所以，我想去貴國學習深造。"},{"english":"Check with the U.S. embassy in your country to see whether other documentation is necessary.","chinese":"請向駐貴國的美國使領館詢問是否需要其他材料。"},{"english":"I respect your dedication to your studies and your deep concern for the honor of your country.","chinese":"我尊重你的奉獻你的研究和你的深切關懷榮譽貴國。"},{"english":"For the past five years, we have done a lot of trade with your company.","chinese":"在過去的五年中，我們與貴國進行了罅康拿騁住。"},{"english":"For the sake of convenience, you may contact our Commercial Counsellors' Office in your country for this matter.","chinese":"爲方便起見，可請徑與我國駐貴國的商務參贊處聯繫。"},{"english":"We''re deeply grateful to your country''s technicians for their considerable assistance.","chinese":"我們深深感激貴國技術人員的大力協助。"},{"english":"I have experienced this transformation of your country in a highly personal way.","chinese":"我個人親身體驗了貴國的這一鉅變。"},{"english":"Are any of the specific actions already being implemented in your country or region?","chinese":"有無任何具體行動已經在貴國或區域得到實施？"},{"english":"I want to thank you for the incomparable hospitality , for which your country is justly famous throughout the world.","chinese":"感謝您無比盛情的款待，這也是貴國聞名於世之所在。"},{"english":"How to resolve the dispute in your country?","chinese":"在貴國怎樣解決國際貿易中的糾紛呢？"},{"english":"Look, your party, government and army leaders have left their seats.","chinese":"看，貴國的黨政軍領導人已經離開座位了。"},{"english":"Going to study in your business schools is one of the top choices of Chinese students.","chinese":"去貴國商學院修業成爲了我國粹子們的首選之一。"},{"english":"Importer: The development of ceramics in your country has been remarkable.","chinese":"貴國陶瓷業的發展切實不同凡響。"},{"english":"If a little accident like this perturbs your country.","chinese":"假如這麼一小小的意外也驚擾了貴國的話。"}],"related":[]}