{"definition":["precious metal"],"pinyin":["gui4 jin1 shu3"],"simplified":["贵金属"],"rank":14478.0,"normalized_rank":0.20256600394554586,"fraction":0.000004402831203782737,"cumulative_fraction":0.9568015136936276,"word":"貴金屬","characters":[{"definition":["expensive\/noble\/precious\/(honorific) your"],"pinyin":["gui4"],"word":"貴"},{"definition":["gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)"],"pinyin":["Jin1","jin1"],"word":"金"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"}],"containing_words":[],"sentences":[{"english":"Whatever sent the precious metals out of a country impoverished it.","chinese":"而將貴金屬從一個國家運出則會使其變窮。"},{"english":"Everyone has a favorite precious metal , one we gravitate back to even if we wear something else occasionally.","chinese":"人人喜愛的貴金屬之一，我們即使穿回科系東西偶爾。"},{"english":"You can order a small cross made of brass or from precious metals with precious stones.","chinese":"你可以定做一個小十字，鑲嵌黃銅或貴金屬與寶石。"},{"english":"Meanwhile, associated Pt family element, gold and silver all are recovered comprehensively.","chinese":"同時伴生貴金屬鉑族元素和金銀等均得到綜合回收。"},{"english":"A method to prepare perofskite metal oxide used as non-noble metal CO combustion catalyst was developed.","chinese":"研究開發了一種非貴金屬CO助燃劑及其製備方法。"},{"english":"The non-noble metal catalyst for n-pentane isomerization at low temperature was prepared by acid modification.","chinese":"通過酸性改性製備正戊烷異構化低溫非貴金屬催化劑。"},{"english":"Precious metal ores and concentrates.","chinese":"貴金屬礦砂及其精礦。"},{"english":"What is the market scenario in precious metals at this juncture?","chinese":"在這樣一個節骨眼上，貴金屬市場表現如何呢？"},{"english":"The bright nanometer Ag powder is one important type of the precious metal powder materials.","chinese":"納米光亮銀粉是貴金屬粉體材料的重要品種之一。"},{"english":"Waste computer mainboards contain abundant precious metals and other valuable metals.","chinese":"報廢電腦主板中含有大量的貴金屬和賤金屬元素。"},{"english":"Adjusted with reference to the market offered rate of the related metal contract.","chinese":"根據個別貴金屬合約市場金商所提供息口每日結算。"},{"english":"Not surprisingly, all three have been vociferous champions of gold and other precious metals.","chinese":"此外，在黃金和其他貴金屬領域他們也是佼佼者。"},{"english":"Changkeng Au-Ag deposit is a newly-discovered, large-scale and new type precious metal deposit.","chinese":"長坑金銀礦是新近發現的新型大型貴金屬礦牀。"},{"english":"Precious metal in non-coin form such as ingots, bars or wafers.","chinese":"非硬幣形狀的貴金屬，例如金塊或金條。"},{"english":"Non-set of assorted articles of heading No. 8215, plated with precious metal.","chinese":"第8215節之各種物品，未配成套，鍍貴金屬者。"},{"english":"MRT can also be applied for the refining of slimes containing precious metals.","chinese":"MRT也可以用於精煉含貴金屬的陽極泥。"}],"related":[{"definition":["abbr. for 期貨合約|期货合约[qi1 huo4 he2 yue1], futures contract (finance)"],"pinyin":["qi1 huo4"],"word":"期貨"},{"definition":["to flee from danger\/to avoid danger\/to minimize risk\/(finance) hedge"],"pinyin":["bi4 xian3"],"word":"避險"},{"definition":["merchandise or commodities available immediately after sale\/merchandise in stock\/available item\/actuals (investment)\/actual commodities"],"pinyin":["xian4 huo4"],"word":"現貨"},{"definition":["derivative product\/derivative (in finance)"],"pinyin":["yan3 sheng1 chan3 pin3"],"word":"衍生產品"},{"definition":["analyst (e.g. of news)"],"pinyin":["fen1 xi1 yuan2"],"word":"分析員"},{"definition":["earnest money\/cash deposit\/bail\/margin (in derivative trading)"],"pinyin":["bao3 zheng4 jin1"],"word":"保證金"},{"definition":["futures contract (finance)"],"pinyin":["qi1 huo4 he2 yue1"],"word":"期貨合約"},{"definition":["foreign (currency) exchange"],"pinyin":["wai4 hui4"],"word":"外匯"},{"definition":["stock market\/stock exchange"],"pinyin":["gu3 piao4 shi4 chang3"],"word":"股票市場"},{"definition":["gilt-edged stock\/blue chip stock"],"pinyin":["ji4 you1 gu3"],"word":"績優股"},{"definition":["slab\/(geology) tectonic plate\/(fig.) sector (of the stock market or of industry)\/(economic) bloc"],"pinyin":["ban3 kuai4"],"word":"板塊"},{"definition":["to invest in stock\/to buy shares"],"pinyin":["gu3 piao4 tou2 zi1"],"word":"股票投資"},{"definition":["iron ore\/iron ore mine"],"pinyin":["tie3 kuang4"],"word":"鐵礦"},{"definition":["negotiable security (financial)\/certificate\/stocks and bonds"],"pinyin":["zheng4 quan4"],"word":"證券"},{"definition":["exchange rate"],"pinyin":["hui4 jia4"],"word":"匯價"},{"definition":["catalyst"],"pinyin":["cui1 hua4 ji4"],"word":"催化劑"}]}