{"definition":["credit side (of a balance sheet)\/creditor\/lender"],"pinyin":["dai4 fang1"],"simplified":["贷方"],"rank":41268.0,"normalized_rank":0.5773928616400599,"fraction":3.405658034688877e-7,"cumulative_fraction":0.9969477373044758,"word":"貸方","characters":[{"definition":["to lend on interest\/to borrow\/a loan\/leniency\/to make excuses\/to pardon\/to forgive"],"pinyin":["dai4"],"word":"貸"},{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["Fang1","fang1"],"word":"方"}],"containing_words":[],"sentences":[{"english":"Double-entry-accounting: A system of recording every business transaction with equal dollar amounts of both debit and credit entries.","chinese":"在借方和貸方用相等的金額記錄經濟事項的記賬系統。"},{"english":"She credited your account with the amount of the cheque.","chinese":"她把支票款項記入你的賬戶的貸方。"},{"english":"Equality of totals in the debit and credit sides of an account.","chinese":"對借方餘額和貸方餘額是否相等的驗證就叫做試算表。"},{"english":"Comparing debit and credit balances for equality.","chinese":"比較借方和貸方餘額是否相同。"},{"english":"If the revenue exceeds the expense, the Income Summary account will have a credit balance.","chinese":"如果收入超過費用，收益彙總帳戶就會有貸方餘額。"},{"english":"In a compound entry, all the credits are listed under the debits.","chinese":"在複合分錄中，所有貸方應列在借方之下。"},{"english":"A credit balance of $100 was brought forward from his June account.","chinese":"貸方餘額100美元是從他6月份的賬轉來的。"},{"english":"If you don't , the lender will foreclose on the home .","chinese":"如果你不，貸方將排除在回家。"},{"english":"The debtor and creditor must sign a document drawn up in accordance with government regulations.","chinese":"借方和貸方必須簽定一份依據政府規章草擬的文件。"},{"english":"Sum of debit entries minus the sum of credit entries in an account. If positive, the difference is called a debit balance;","chinese":"是指一個賬戶中貸方總額和借方總額的差額。"},{"english":"This proof of equality of debit and credit balances is called a trial balance.","chinese":"對借方餘額和貸方餘額是否相等的驗證就叫做試算表。"}],"related":[]}