{"definition":["to argue needlessly\/to waste time explaining"],"pinyin":["fei4 kou3 she2"],"simplified":["费口舌"],"rank":50129.0,"normalized_rank":0.7013697480167336,"fraction":1.4189025330979807e-7,"cumulative_fraction":0.998978431049902,"word":"費口舌","characters":[{"definition":["surname Fei","to cost\/to spend\/fee\/wasteful\/expenses"],"pinyin":["Fei4","fei4"],"word":"費"},{"definition":["mouth\/classifier for things with mouths (people, domestic animals, cannons, wells etc)\/classifier for bites or mouthfuls"],"pinyin":["kou3"],"word":"口"},{"definition":["tongue"],"pinyin":["she2"],"word":"舌"}],"containing_words":[],"sentences":[{"english":"You are wasting your breath; he won't change his mind.","chinese":"你在白費口舌，他不會改變主的。"},{"english":"Bards will not spare breath upon your pitiful empire.","chinese":"吟遊詩人將不會在你那可鄙的王朝上多費口舌。"},{"english":"You're wasting your breath. I won't change my mind.","chinese":"你不必多費口舌，我是不會改變主意的。"},{"english":"I've already made up my mind. There's no sense flogging a dead horse .","chinese":"我已經下了決心，不必再白費口舌了。"},{"english":"Asking him is wasting my breath.","chinese":"問他是白費口舌。"},{"english":"Save your breath, the boss will never give you the day off.","chinese":"別白費口舌了，老闆不會給你假的。"},{"english":"He won’t pay attention to anybody, you’re just wasting your breath.","chinese":"他對誰都不加理會，你不過是白費口舌。"},{"english":"He won't listen to anybody. You're just wasting your breath.","chinese":"他誰的話都不聽，你只是白費口舌。"},{"english":"It was mere waste of breath to argue with a person in so unreasonable a state of mind.","chinese":"和一個如此不可理喻的人爭論純粹是白費口舌。"},{"english":"Offering unnecessary care would, in fact, be faster.","chinese":"事實上，醫生提供不必要的診療反而不用多費口舌。"},{"english":"Don't waste words on that fellow.","chinese":"不要同那傢伙白費口舌。"},{"english":"Ive already made up my mind. Theres no sense beating a dead horse.","chinese":"我已經下了決心，不要再白費口舌了。"},{"english":"Trying to reason with them was like banging my head against a brick wall.","chinese":"試圖和他們講道理只是白費口舌。"},{"english":"Save your breath; you'll never persuade her.","chinese":"不要白費口舌了，你說服不了她。"},{"english":"Don't waste your breath try to convince him; he's going to leave anyway.","chinese":"不要白費口舌勸阻他了，他反正也要走的。"},{"english":"In making that plea he will breathe in vain.","chinese":"他做那種懇求是白費口舌的。"}],"related":[]}