{"definition":["Fermi (name)\/Enrico Fermi (1901-1954), Italian born US nuclear physicist"],"pinyin":["Fei4 mi3"],"simplified":["费米"],"rank":53437.0,"normalized_rank":0.7476529598589677,"fraction":9.838892050494226e-8,"cumulative_fraction":0.9993730345593276,"word":"費米","characters":[{"definition":["surname Fei","to cost\/to spend\/fee\/wasteful\/expenses"],"pinyin":["Fei4","fei4"],"word":"費"},{"definition":["rice\/CL:粒[li4]\/meter (classifier)","surname Mi"],"pinyin":["Mi3","mi3"],"word":"米"}],"containing_words":[{"definition":["fermion"],"pinyin":["fei4 mi3 zi3"],"word":"費米子"},{"definition":["Enrico Fermi (1901-1954), Italian born US nuclear physicist"],"pinyin":["En1 li3 ke1 · Fei4 mi3"],"word":"恩里科·費米"}],"sentences":[{"english":"Like all virtuosos, Fermi had a distinctive style.","chinese":"像所藝術家一樣，費米有他的獨特風格。"},{"english":"Consider thermodynamic functions of the system of interacting fermions using the oscillator representation.","chinese":"利用振盪表象，考慮相互作用費米系統的熱力學函數。"},{"english":"What are light and fermions?","chinese":"光和費米子是什麼？"},{"english":"The phase diagram of a homogenous ultracold Fermi gas with spin polarization is studied at unitarity.","chinese":"研究了超冷均勻極化的費米氣體在共振區的相圖。"},{"english":"Then the entropies of the bosons and fermions fields are given by using the brick-wall model.","chinese":"然後利用磚牆方法計算了玻色場和費米場的熵。"},{"english":"Where do light and fermions come from?","chinese":"光和費米子來自哪裏？"},{"english":"Those antimatter beams are then picked up by Fermi's instruments.","chinese":"這些發物質束便被費米的儀器所捕獲了。"},{"english":"The Fermi bubbles could be powered by the black hole at the center of our galaxy.","chinese":"費米爾泡可能是由我們銀河系中心的黑洞所驅動的。"},{"english":"Particles, such as electrons, requiring antisymmetric wave functions are called fermions.","chinese":"要求反對稱波函數的粒子，如電子，叫做費米子。"},{"english":"From 1 billion light-years to 0.1 fermi.","chinese":"從十億光年到零點一費米。"},{"english":"This idea is embodied in the Fermi Paradox.","chinese":"這個想法在費米悖論中有所體現。"},{"english":"PROVERBIAL APPLES AND ORANGES are as different as the types of quantum particles called fermions and bosons.","chinese":"費米子與玻色子的差異之大，有如橘子與蘋果的不同。"},{"english":"The emission intensity is given by the absorptance of the volume in which there is a difference of the quasi Fermi energies.","chinese":"輻射強度由存在準費米能級差的體積的吸收率決定。"},{"english":"The tricritical point in the temperature-polarization plane is obtained.","chinese":"在溫度和費米子極化的相圖上得到了三相點的位置。"},{"english":"He believes that this process supplies the gamma-rays observed by Fermi.","chinese":"他相信這個過程產生出了費米鏡觀測到的伽馬射線流。"},{"english":"This is the first time to achieve the DFG at home.","chinese":"這是國內首次完成的費米量子簡併的實驗。"}],"related":[]}