{"definition":["mussel"],"pinyin":["yi2 bei4"],"simplified":["贻贝"],"rank":53582.0,"normalized_rank":0.7496816979838541,"fraction":9.678316660946103e-8,"cumulative_fraction":0.9993871740982428,"word":"貽貝","characters":[{"definition":["to present\/to bequeath"],"pinyin":["yi2"],"word":"貽"},{"definition":["cowrie\/shellfish\/currency (archaic)","surname Bei"],"pinyin":["Bei4","bei4"],"word":"貝"}],"containing_words":[],"sentences":[{"english":"Be sure to review the Information about the collection of the zebra mussel data.","chinese":"要保證熟讀有關收集斑馬貽貝數據的說明。"},{"english":"These include oysters, clams, mussels and whelks.","chinese":"這些海產包括牡蠣，文蛤，貽貝和蛾螺。"},{"english":"It typically has a few different types of fish, clams, mussels and prawns.","chinese":"它通常由好幾種魚類，蛤蜊，貽貝和對蝦熬成。"},{"english":"To investigate the protective effect of mussel polysaccharide on alcoholic hepatic injury in mice.","chinese":"探討貽貝多糖對小鼠酒精性肝損傷的保護作用。"},{"english":"To those people who resided within the tropical zones old coconut shells and mussel shells were commonly employed.","chinese":"居住在熱帶地區的人普遍採用老椰子殼和貽貝殼。"},{"english":"Mussel is mussel meat, which is aquatic products.","chinese":"淡菜，即貽貝肉，水產品。"},{"english":"The digestibility of fresh meat of Mytilus edulis -was much higher than that of the dried one.","chinese":"鮮貽貝肉的蛋白質消化率比干品的高得多。"},{"english":"Be sure the Information about the collection of the zebra mussel data.","chinese":"要保證熟讀有關收集斑馬貽貝數據的說明。"},{"english":"The effects of New Zealand green-lipped mussel supplements have been studied in people with OA.","chinese":"新西蘭綠影響脣貽貝補充劑進行了研究與辦公的人。"},{"english":"This paper describes some observations made mainly on the growth of raftculturedmussels (Mytilus edulis L. ) in Jiaochou Wan, Shandong Province.","chinese":"本文報道了膠州灣貽貝生長的研究結果。"},{"english":"Volcanic vents in the Atlantic are home to swarms of blind shrimp and beds of unusual mussels.","chinese":"大西洋的火山口是盲蝦和貽貝聚集的樂園。"},{"english":"Paul is then left to choose one box to open to retrieve the mussel.","chinese":"然後讓保羅選擇打開其中一個箱子來獲得貽貝。"},{"english":"Perhaps Paul likes oyster better than mussel, for example.","chinese":"假設比起貽貝，章魚保羅更喜歡牡蠣。"},{"english":"The existence and extended diversity of antimicrobial peptides has been revealed in mussel in recent years.","chinese":"近年來在海洋軟體動物貽貝中發現了新的抗菌肽家族。"}],"related":[]}