{"definition":["volume of trade (between countries)"],"pinyin":["mao4 yi4 e2"],"simplified":["贸易额"],"rank":11703.0,"normalized_rank":0.1637401536244456,"fraction":0.000006372507323030788,"cumulative_fraction":0.9420682173498875,"word":"貿易額","characters":[{"definition":["commerce\/trade"],"pinyin":["mao4"],"word":"貿"},{"definition":["easy\/amiable\/to change\/to exchange\/prefix corresponding to the English adjective suffix \"-able\" or \"-ible\"","surname Yi\/abbr. for 易經|易经[Yi4 jing1], the Book of Changes"],"pinyin":["Yi4","yi4"],"word":"易"},{"definition":["forehead\/horizontal tablet or inscribed board\/specified number or amount"],"pinyin":["e2"],"word":"額"}],"containing_words":[],"sentences":[{"english":"Bilateral trade reached US$59.66 billion in 2008 and approached US$43 billion in the first nine months of 2009.","chinese":"2009年前9個月，雙邊貿易額近430億美元。"},{"english":"Each country's aggregate international trade is expanding by 23-24% annually.","chinese":"兩國各自的國際貿易額每年擴展23%到24%。"},{"english":"China has worked to boost trade with several countries in the Middle East.","chinese":"中國努力提高與中東國家幾個國家的貿易額。"},{"english":"The China-Africa trade volume has exceeded 100 billion U.S. dollars for the first time in 2008.","chinese":"2008年中非貿易額首次突破1000億美元。"},{"english":"General trade and foreign-funded enterprises export trade amounted to more than 8000 million.","chinese":"一般貿易和三資企業出口貿易額達8000多萬美元。"},{"english":"Meanwhile, US annual trade with Asia-Pacific countries has gone beyond one trillion dollars.","chinese":"美國與亞太國家的年貿易額超過1萬億美元。"},{"english":"Ten years ago, China–U.S. trade stood at only $102.6 billion.","chinese":"10年前，中美貿易額僅有1，026億美元。"},{"english":"S. dollars. General trade and foreign-funded enterprises export trade amounted to more than 8000 million.","chinese":"一般貿易和三資企業出口貿易額達8000多萬美元。"},{"english":"China said the Sino-U. S. trade hit 212 billion U. S. dollars last year.","chinese":"中國方面說，去年中美貿易額達到了2120億美圓。"},{"english":"We trade about a trillion dollars in goods and services each year.","chinese":"歐美每年商品服務貿易額都達數萬億美元。"},{"english":"China is now the world’s third-largest trading nation with 6 percent of world trade.","chinese":"現在，中國卻是佔世界貿易額6%的第三大貿易國。"},{"english":"Two-way direct foreign investment between Canada and India is relatively low.","chinese":"加拿大與印度的雙邊貿易額相對還很小。"},{"english":"The bilateral trade volume has reached one new height after another and the scale of two-way investment has been continuously expanded.","chinese":"兩國貿易額連創新高，雙向投資規模不斷擴大。"},{"english":"With the trade volume increasing by over 100 folds more than the time when the two sides established diplomatic ties, bilateral economic and trade cooperation has witnessed outstanding progress.","chinese":"經貿合作成果顯著，貿易額比建交時增長百餘倍。"},{"english":"It trades more with the EU than any other partner.","chinese":"中國與歐盟的貿易額比其他地區都多。"},{"english":"The picture shows the development trend of Sino-Australian bilateral trade volume.","chinese":"圖爲中澳雙邊貿易額髮展趨勢。"}],"related":[]}