{"definition":["Jia Qinglin (1940-), member of the Politburo Standing Committee 2002-2012"],"pinyin":["Jia3 Qing4 lin2"],"simplified":["贾庆林"],"rank":9719.0,"normalized_rank":0.13598141955703552,"fraction":0.000008642897353614417,"cumulative_fraction":0.9273246673916584,"word":"賈慶林","characters":[{"definition":["merchant\/to buy","surname Jia"],"pinyin":["Jia3","gu3"],"word":"賈"},{"definition":["to celebrate"],"pinyin":["qing4"],"word":"慶"},{"definition":["surname Lin\/Japanese surname Hayashi","woods\/forest\/CL:片[pian4]\/circle(s) (i.e. specific group of people)\/a collection (of similar things)"],"pinyin":["Lin2","lin2"],"word":"林"}],"containing_words":[],"sentences":[{"english":"Jia welcomed King Gyanendra to the annual conference of the forum.","chinese":"賈慶林歡迎賈南德拉國王來華出席博鰲亞洲論壇年會。"},{"english":"Badawi agreed with Jia's comments and proposals on bilateral relations.","chinese":"巴達維贊同賈慶林對兩國關係的評價和提出的建議。"},{"english":"CPPCC National Committee Chairman Jia Qinglin delivered a keynote report after the session started at 3 pm.","chinese":"政協主席賈慶林在會議開始後發表了重要講話。"},{"english":"Jia QInglin conveyed the greetings of President Hu Jintao to President Fox.","chinese":"賈慶林轉達了胡錦濤主席對福克斯總統的問候。"},{"english":"Jia said that the Chinese and Fijian people enjoy a long history of friendship.","chinese":"賈慶林說，中斐兩國人民的友誼源遠流長。"},{"english":"Jia said that since the establishment of diplomatic ties, bilateral relations have been developing smoothly.","chinese":"賈慶林說，中馬建交以來，兩國關係發展順利。"},{"english":"CPPCC Chairman Jia Qinglin will deliver a speech.","chinese":"全國政協主席賈慶林將發表講話。"},{"english":"Jia said that the traditional friendship between both countries has withstood the tests of changeable international situations.","chinese":"賈慶林說，中越傳統友誼經歷了國際風雲變幻的考驗。"},{"english":"Jia first conveyed the cordial greetings from Premier Wen Jiabao to Khai.","chinese":"賈慶林首先轉達了溫家寶總理對潘文凱的親切問候。"},{"english":"Jia Qinglin, chairman of the National Committee of the Chinese People's Political Consultative Conference delivered a speech over the talks.","chinese":"全國政協主席賈慶林出席座談會並講話。"},{"english":"Jia said that Malaysia is China's important partner in ASEAN.","chinese":"賈慶林說，馬來西亞是中國在東盟的重要夥伴。"},{"english":"Jia conveyed the greetings from President Hu Jintao to Luong.","chinese":"賈慶林轉達了胡錦濤主席對陳德良的問候。"},{"english":"On the same day Jia also met with Taito Waqavakatoga, President of the Fijian Senate.","chinese":"當日，賈慶林還會見了斐濟參議長萬加瓦卡通加。"},{"english":"Fox asked Jia QInglin to convey his greetings to President Hu Jintao.","chinese":"福克斯請賈慶林轉達他對胡錦濤主席的問候。"},{"english":"Jia Qinglin delivered a brief speech at the Cancun airport.","chinese":"賈慶林在坎昆機場發表了簡短書面講話。"},{"english":"Top advisor urges broader, deeper cross-Strait ties.","chinese":"賈慶林呼籲發展更廣泛和更深入的兩岸關係。"}],"related":[]}