{"definition":["variant of 賜予|赐予[ci4 yu3]"],"pinyin":["ci4 yu3"],"simplified":["赐与"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"賜與","characters":[{"definition":["to confer\/to bestow\/to grant"],"pinyin":["ci4"],"word":"賜"},{"definition":["and\/to give\/together with","to take part in","variant of 歟|欤[yu2]"],"pinyin":["yu2","yu3","yu4"],"word":"與"}],"containing_words":[],"sentences":[{"english":"The fulness of the gospel, including all temple ordinances, is then available to us.","chinese":"豐滿的福音，包括所有的聖殿教儀，已經賜與我們。"},{"english":"Your unit price seems fair enough, but we're hoping for a higher discount rate.","chinese":"單價彷彿公道，但我們希看賜與更高的折扣率。"},{"english":"Back to thinking about the battlefield, there is a simile I can give you.","chinese":"追念戰爭，我能賜與你們一個明喻的講法。"},{"english":"Who also hath manifested to us your love in the spirit.","chinese":"也就是他給我們報告了聖神所賜與你們的愛。"},{"english":"Today God still bestows these abilities and thousands of others, so people can serve him.","chinese":"今天神仍賜與千萬人這些才能，讓他們可以事奉他。"},{"english":"He who can take advice is sometimes superior to him who can give it.","chinese":"能擔當鍼砭的有時比賜與者更強。"},{"english":"As for the important and key points, the thesis has analyzed separately and propose detailed solutions.","chinese":"重點難點題目單獨賜與分析，提出具體解決辦法。"},{"english":"I do not know whether the answers to that intended, but also your busy schedule to give guidance on January 2.","chinese":"不知解答能否契合題意，還請您百忙中賜與指點一二。"},{"english":"For this, Noni is, and always has been, a highly effective gift of nature .","chinese":"而鍩利正是大自然界賜與我們最有好的禮物。"},{"english":"We solicit a continuance of your confidence and support.","chinese":"懇請貴方持續賜與信賴，大年夜力撐持。"},{"english":"Want happiness , Be you give a care.","chinese":"我要的夸姣，是你賜與我的在意。"},{"english":"This is the simile of what I have just given to you.","chinese":"不過這是我已經賜與你們的明喻。"},{"english":"Let yourimmolation be guided by what gives you joy and inspiration.","chinese":"讓自己被那些賜與您高興與靈感的事物指面。"},{"english":"The policeman cautioned that driver.","chinese":"差人對阿誰司機賜與警告。"}],"related":[]}