{"definition":["having given away a bride, to lose one's army on top of it (idiom)\/to suffer a double loss after trying to trick the enemy"],"pinyin":["pei2 le5 fu1 ren2 you4 zhe2 bing1"],"simplified":["赔了夫人又折兵"],"rank":43800.0,"normalized_rank":0.6128188266897989,"fraction":2.6816090054536944e-7,"cumulative_fraction":0.9977159855855487,"word":"賠了夫人又折兵","characters":[{"definition":["to compensate for loss\/to indemnify\/to suffer a financial loss"],"pinyin":["pei2"],"word":"賠"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly"],"pinyin":["le5","liao3"],"word":"了"},{"definition":["(classical) this, that\/he, she, they\/(exclamatory final particle)\/(initial particle, introduces an opinion)","husband\/man\/manual worker\/conscripted laborer (old)"],"pinyin":["fu1","fu2"],"word":"夫"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"},{"definition":["(once) again\/also\/both... and...\/and yet\/(used for emphasis) anyway"],"pinyin":["you4"],"word":"又"},{"definition":["to break (e.g. stick or bone)\/a loss","to break\/to fracture\/to snap\/to suffer loss\/to bend\/to twist\/to turn\/to change direction\/convinced\/to convert into (currency)\/discount\/rebate\/tenth (in price)\/classifier for theatrical scenes\/to fold\/accounts book","to turn sth over\/to turn upside down\/to tip sth out (of a container)"],"pinyin":["she2","zhe1","zhe2"],"word":"折"},{"definition":["soldiers\/a force\/an army\/weapons\/arms\/military\/warlike\/CL:個|个[ge4]"],"pinyin":["bing1"],"word":"兵"}],"containing_words":[],"sentences":[],"related":[{"definition":["the trick of injuring oneself to gain the enemy's confidence\/CL:條|条[tiao2]"],"pinyin":["ku3 rou4 ji4"],"word":"苦肉計"},{"definition":["lit. helping tyrant Zhou 商紂王|商纣王[Shang1 Zhou4 wang2] in his oppression (idiom)\/fig. to take the side of the evildoer\/giving succor to the enemy"],"pinyin":["zhu4 Zhou4 wei2 nu:e4"],"word":"助紂為虐"},{"definition":["extreme joy turns to sorrow (idiom); Don't celebrate too soon, things could still go wrong!"],"pinyin":["le4 ji2 sheng1 bei1"],"word":"樂極生悲"},{"definition":["to die without a burial site\/to die a pauper\/a tragic end"],"pinyin":["si3 wu2 zang4 shen1 zhi1 di4"],"word":"死無葬身之地"},{"definition":["spendthrift and foolish\/sb with more money than sense"],"pinyin":["yuan1 da4 tou2"],"word":"冤大頭"},{"definition":["strike first and gain the upper hand (idiom, martial arts term); Making the first move is an advantage."],"pinyin":["xian1 xia4 shou3 wei2 qiang2"],"word":"先下手為強"},{"definition":["it will cause no end of trouble (idiom)"],"pinyin":["hou4 huan4 wu2 qiong2"],"word":"後患無窮"},{"definition":["lit. deal sincerely and fairly (idiom); frank and open-minded\/plain speaking\/Let's talk frankly and openly between ourselves.\/to put one's cards on the table"],"pinyin":["kai1 cheng2 bu4 gong1"],"word":"開誠布公"},{"definition":["lit. cannot rest or eat in peace (idiom)\/fig. extremely worried and troubled"],"pinyin":["qin3 shi2 nan2 an1"],"word":"寢食難安"},{"definition":["open the net on one side (idiom); let the caged bird fly\/to give one's opponent a way out\/lenient treatment"],"pinyin":["wang3 kai1 yi1 mian4"],"word":"網開一面"},{"definition":["harming others for one's personal benefit (idiom); personal gain to the detriment of others"],"pinyin":["sun3 ren2 li4 ji3"],"word":"損人利己"},{"definition":["druggist"],"pinyin":["yao4 shang1"],"word":"藥商"},{"definition":["to upbraid"],"pinyin":["chi4 ze2"],"word":"叱責"},{"definition":["Trouble issues from the mouth (idiom). A loose tongue may cause a lot of trouble."],"pinyin":["huo4 cong2 kou3 chu1"],"word":"禍從口出"},{"definition":["lit. wind past your ear\/fig. sth you don't pay much attention to\/in one ear and out the other"],"pinyin":["er3 bian1 feng1"],"word":"耳邊風"},{"definition":["magnanimous (idiom); generous"],"pinyin":["kuan1 hong2 da4 liang4"],"word":"寬宏大量"}]}