{"definition":["reparations\/to pay reparations"],"pinyin":["pei2 kuan3"],"simplified":["赔款"],"rank":18265.0,"normalized_rank":0.2555510472486114,"fraction":0.0000028618913746281807,"cumulative_fraction":0.9702907463677379,"word":"賠款","characters":[{"definition":["to compensate for loss\/to indemnify\/to suffer a financial loss"],"pinyin":["pei2"],"word":"賠"},{"definition":["section\/paragraph\/funds\/CL:筆|笔[bi3],個|个[ge4]\/classifier for versions or models (of a product)"],"pinyin":["kuan3"],"word":"款"}],"containing_words":[],"sentences":[{"english":"Stiff reparations for war damages were to be paid—by the Chinese.","chinese":"中國承擔嚴厲的戰爭賠款。"},{"english":"Robust Bayesian Estimate of Outstanding Claims Reserve In Non-Life Insurance;","chinese":"未決賠款準備金的估計對於保險公司而言非常重要。"},{"english":"He also said the US, the biggest carbon emitter in history, did not owe reparations.","chinese":"他還說，歷史上最大的碳排放國美國不欠賠款。"},{"english":"If settlement currency option is not specified, HKD cheque will be issued.","chinese":"如沒有註明賠款貨幣，本公司將發出港幣支票。"},{"english":"Is lovely to cede territory indemnity in the Tan Yuan, feeble in character of make people don't humiliate him embarrassed.","chinese":"乖在檀淵割地賠款，懦弱的讓人不欺負他都不好意思。"},{"english":"Guo paid the judgment but refused to apologize or admit any wrongdoing.","chinese":"郭敬明支付了賠款但拒絕道歉或承認自己做錯了。"},{"english":"Apologies for government mistreatment and reparations have been rare in Congress.","chinese":"美國國會爲政府不公平待遇道歉甚至賠款相當罕見。"},{"english":"A few days later the club revoked the contract and refunded the advance.","chinese":"幾天後，這傢俱樂部違反了合同並且提前支付了賠款。"},{"english":"And all we known, both PRC and ROC gave up Japan, s war reparations.","chinese":"衆所周知，國共兩黨都免除了日本的戰爭賠款。"},{"english":"Qinghua by the United States returned to the auditorium is part of the Boxer Indemnity completed.","chinese":"清華大會堂是由美退還局部庚子賠款建成的。"},{"english":"Under this treaty, they were to pay an indemnity of 60 million pounds.","chinese":"根據這項條約，他們應賠款六千萬英鎊。"},{"english":"He collected on the damage to his house.","chinese":"他收到了房屋損壞的賠款。"},{"english":"Reparations were temporarily pretermitted.","chinese":"賠款暫時中止了。"},{"english":"Hillary Clinton won't be handing over a check for climate reparations.","chinese":"希拉里不會開出氣候賠款支票。"},{"english":"The imperialist powers repeatedly forced the Qing government to cede territory and pay indemnities.","chinese":"帝國主義列強多次強迫清朝政府割地賠款。"}],"related":[{"definition":["to denounce\/to condemn\/to call to account\/to punish"],"pinyin":["wen4 zui4"],"word":"問罪"},{"definition":["to deceive\/to conceal"],"pinyin":["man2 pian4"],"word":"瞞騙"},{"definition":["no strategy left to try (idiom); at one's wit's end\/at the end of one's tether\/powerless"],"pinyin":["wu2 ji4 ke3 shi1"],"word":"無計可施"},{"definition":["to repay a debt in kind or by labor"],"pinyin":["di3 zhai4"],"word":"抵債"},{"definition":["security measures (esp. border security)\/official seal (esp. military seal during Qing and Ming times)"],"pinyin":["guan1 fang2"],"word":"關防"},{"definition":["to forfeit sovereignty and humiliate the country (idiom)\/to surrender territory under humiliating terms"],"pinyin":["sang4 quan2 ru3 guo2"],"word":"喪權辱國"},{"definition":["to pay wages or salary"],"pinyin":["fa1 xin1"],"word":"發薪"},{"definition":["to oppose each other with equal harshness (idiom); tit for tat\/measure for measure"],"pinyin":["zhen1 feng1 xiang1 dui4"],"word":"針鋒相對"},{"definition":["tax liability"],"pinyin":["shui4 fu4"],"word":"稅賦"},{"definition":["low ranking\/low level\/underclass\/subordinate"],"pinyin":["xia4 ji2"],"word":"下級"},{"definition":["variant of 巨額|巨额[ju4 e2]"],"pinyin":["ju4 e2"],"word":"鉅額"},{"definition":["lit. to return to office after living as a hermit on Mount Dongshan (idiom); fig. to make a comeback"],"pinyin":["dong1 shan1 zai4 qi3"],"word":"東山再起"},{"definition":["imprisonment"],"pinyin":["lao2 yu4 zhi1 zai1"],"word":"牢獄之災"},{"definition":["to contend on strong grounds\/to argue strongly for what is right"],"pinyin":["ju4 li3 li4 zheng1"],"word":"據理力爭"},{"definition":["to avoid the important and dwell on the trivial\/to keep silent about major charges while admitting minor ones"],"pinyin":["bi4 zhong4 jiu4 qing1"],"word":"避重就輕"},{"definition":["to get out of trouble\/to escape from danger\/a danger appears\/threatened by danger"],"pinyin":["chu1 xian3"],"word":"出險"}]}