{"definition":["to offer an apology\/to make amends"],"pinyin":["pei2 li3"],"simplified":["赔礼"],"rank":50992.0,"normalized_rank":0.7134442376841604,"fraction":1.2948215502653384e-7,"cumulative_fraction":0.9990954531386108,"word":"賠禮","characters":[{"definition":["to compensate for loss\/to indemnify\/to suffer a financial loss"],"pinyin":["pei2"],"word":"賠"},{"definition":["gift\/rite\/ceremony\/CL:份[fen4]\/propriety\/etiquette\/courtesy","surname Li\/abbr. for 禮記|礼记[Li3 ji4], Classic of Rites"],"pinyin":["Li3","li3"],"word":"禮"}],"containing_words":[],"sentences":[{"english":"Finally had to tell ChangJiang tomorrow the old couple to give NingCaiXia extend an apology.","chinese":"最後只好告訴常江明天老兩口去給寧彩霞賠禮道歉。"},{"english":"When he realized his mistake, he have to eat humble pie.","chinese":"他認識到了自己的錯誤，只好賠禮道歉。"},{"english":"Realizing that your apology may not be enough for them.","chinese":"意識到你的賠禮道歉可能對他們而言還是不夠的。"},{"english":"Angered by the unfair treatment, they asked for an apology.","chinese":"不公正待遇使得他們很生氣，要求對方賠禮道歉。"},{"english":"The contents of apology should be explained clearly.","chinese":"賠禮道歉的內容應當作出明確解釋。"},{"english":"When he realized his mistake, he had to eat humble pie.","chinese":"他認識到了自己的錯誤，只好賠禮道歉。"},{"english":"Finally had to tell the old couple to NingCaiXia Chang Jiang tomorrow to apologize.","chinese":"最後只好告訴常江明天老兩口去給寧彩霞賠禮道歉。"},{"english":"On the table, take the initiative to Rebecca offer an apology.","chinese":"在餐桌上主動向瑞貝卡賠禮道歉。"},{"english":"The fourth part of apology may produce the legal consequences.","chinese":"第四部分，訴訟之外的賠禮道歉可能產生的法律後果。"},{"english":"You may not believe this, but finally he apologized to me.","chinese":"你也許不相信，但他最後還是向我賠禮道歉了。"},{"english":"At the same time, we should apologize to them for anything we did wrong.","chinese":"對那時辦得不對的事，應當向他們賠禮。"},{"english":"Secondly, thinking and reduce the responsibility to apologize.","chinese":"其次，思考賠禮道歉和減輕責任之間的聯繫。"},{"english":"Later, Guo Bao an apology to get an understanding.","chinese":"事後，郭軍向鮑某賠禮道歉，得到了諒解。"},{"english":"To reduce its responsibility to apologize as the basis for positive.","chinese":"對賠禮道歉作爲減輕其責任的依據進行正面闡述。"},{"english":"The image is apology to law under the moral responsibility of shell package.","chinese":"賠禮道歉被形象的比喻成法律外殼包裹下的道德責任。"}],"related":[]}