{"definition":["to be sold out"],"pinyin":["mai4 wan2"],"simplified":["卖完"],"rank":20065.0,"normalized_rank":0.2807353825920277,"fraction":0.000002378267496834599,"cumulative_fraction":0.9749931271653074,"word":"賣完","characters":[{"definition":["to sell\/to betray\/to spare no effort\/to show off or flaunt"],"pinyin":["mai4"],"word":"賣"},{"definition":["to finish\/to be over\/whole\/complete\/entire"],"pinyin":["wan2"],"word":"完"}],"containing_words":[],"sentences":[{"english":"The peach pies and chocolate Mousse cakes are nearly finished.","chinese":"桃餡餅和巧克力慕斯蛋糕也接近賣完。"},{"english":"The vendor can turn his stock every day.","chinese":"小販每天都能把進的貨賣完。"},{"english":"I saw the other day when Chelsea played against Leverkusen - it was not a sell-out.","chinese":"就在切爾西對陣勒沃庫森的時候，球票就沒有賣完。"},{"english":"We're packed out and again chiefly to young people.","chinese":"我們的票賣完了，主要又是賣給年輕人的。"},{"english":"Show that does well in the tryouts in the provinces is likely to be sold out weeks in advance .","chinese":"在外埠試演成功的戲大概幾個星期以前票就賣完了。"},{"english":"I'm sorry, we're fresh out of popcorn.","chinese":"抱歉爆玉米花賣完了。"},{"english":"Sorry, sleepers are all sold out. We have only soft seats left.","chinese":"對不起，臥鋪票已經賣完了，只有軟座。"},{"english":"Meat quickly sold, the elderly victoriously home.","chinese":"肉很快就賣完了，老人勝利地回家。"},{"english":"But when we returned from looking into other stalls, we found they'd all been sold.","chinese":"但是等我們從市場上返回時竟然發現已經賣完了。"},{"english":"I had no grab one at the store before they sold out.","chinese":"我得在他們賣完之前，在書店裏抓一本。"},{"english":"We are amazed at how fast these went ourselves.","chinese":"我們驚訝地發現在這麼短的時間賣完。"},{"english":"Trouble started when they ran out of dolls.","chinese":"當洋娃娃賣完的時候麻煩就開始了。"},{"english":"We should have applied for block seating before it is sold out.","chinese":"我們當時在門票賣完前應該申請團體座位纔對。"},{"english":"How'd you get tickets to this concert? I thought it was sold-out.","chinese":"你怎麼拿到演唱會的票啊？我還以爲都賣完了咧。"},{"english":"The stock is nearly exhausted.","chinese":"庫存已幾乎賣完。"},{"english":"I am sorry. The flight is fully booked for the 20th.","chinese":"很抱歉，20日的機票全賣完了。"}],"related":[]}