{"definition":["selling point"],"pinyin":["mai4 dian3"],"simplified":["卖点"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"賣點","characters":[{"definition":["to sell\/to betray\/to spare no effort\/to show off or flaunt"],"pinyin":["mai4"],"word":"賣"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[],"sentences":[{"english":"That series s selling point was not just sex and designer clothes.","chinese":"這一電視劇的賣點不僅只是性和名牌服裝。"},{"english":"One of the game's big selling points is its action-oriented movement.","chinese":"這款遊戲的最大的賣點在於動感十足。"},{"english":"BUY, Buy more American obsolete weapons, then re-sale them to the Philippines.","chinese":"買吧，多買點美國過時的武器吧，再賣點給菲律賓。"},{"english":"It might be a selling point.","chinese":"這也許會是一個賣點。"},{"english":"The chief attraction of the device is the ease with which it can be used to buy books and other content.","chinese":"它主要的賣點就是能方便地買書和其他內容。"},{"english":"Some prisoners also sell handicrafts they have made or pictures they've drawn.","chinese":"有些囚犯也會賣點自己製作的手工品或繪製的圖畫。"},{"english":"The problem for Sony now is that the sheer weight of USPs is against them.","chinese":"但是現在困擾索尼的問題是賣點完全不在他們一邊。"},{"english":"Teaching in English is the selling point of the local education system.","chinese":"英語教學是本港教育制度的賣點。"},{"english":"The idea of an upgradable machine was a big selling point back then.","chinese":"一臺可升級的機器”在當時是一個大賣點。"},{"english":"At the same time, also highlighted the better the \"Golden River, the quality of\" selling points.","chinese":"同時也更好的突出了“金沙河，金品質”的賣點。"},{"english":"The biggest selling point of crystal is not only in the purity, but also in the gorgeous cut.","chinese":"其最大的賣點就是晶體之純淨與切割之華麗工整。"},{"english":"GPS used to be the USP of high-end handsets.","chinese":"GPS曾是高端手機的賣點。"},{"english":"By 1598, his name had become a selling point and began to appear on the title pages.","chinese":"到1598年，他的名字已經成爲賣點並出現在扉頁。"},{"english":"Come on, ride off to town, and get money for the horse, or make a good bargain with it.","chinese":"你騎着它到鎮上，把馬賣點錢，或者換點好東西吧。"},{"english":"Eventually the store will be one of the key selling points in marketing of new devices.","chinese":"最終商店會成爲新設備營銷過程中的一大賣點。"},{"english":"Higher rate of the selling points of many projects.","chinese":"較高的綠化率是許多樓盤的賣點。"}],"related":[{"definition":["highlight\/bright spot"],"pinyin":["liang4 dian3"],"word":"亮點"},{"definition":["popular\/hot\/in vogue"],"pinyin":["re4 men2"],"word":"熱門"},{"definition":["merit\/benefit\/strong point\/advantage\/CL:個|个[ge4],項|项[xiang4]"],"pinyin":["you1 dian3"],"word":"優點"},{"definition":["amusing speech or act\/jokes\/antics\/funny\/amusing\/Taiwan pr. [xue1 tou2]"],"pinyin":["xue2 tou2"],"word":"噱頭"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["popular\/well-received"],"pinyin":["shou4 huan1 ying2"],"word":"受歡迎"},{"definition":["not only (this one)\/not just (...) but also"],"pinyin":["bu4 jin3"],"word":"不僅"},{"definition":["to own exclusively\/unique to\/specific\/there is only"],"pinyin":["du2 you3"],"word":"獨有"},{"definition":["popularity\/personality\/character"],"pinyin":["ren2 qi4"],"word":"人氣"},{"definition":["to exploit (a resource)\/to open up (for development)\/to develop"],"pinyin":["kai1 fa1"],"word":"開發"},{"definition":["to stand out from the masses (idiom)"],"pinyin":["yu3 zhong4 bu4 tong2"],"word":"與眾不同"},{"definition":["well-known\/famous\/renowned\/eminent"],"pinyin":["wen2 ming2"],"word":"聞名"},{"definition":["Internet celebrity"],"pinyin":["wang3 hong2"],"word":"網紅"},{"definition":["first choice\/premium\/to come first in the imperial examinations"],"pinyin":["shou3 xuan3"],"word":"首選"},{"definition":["equivalent to\/appropriate\/considerably\/to a certain extent\/fairly\/quite"],"pinyin":["xiang1 dang1"],"word":"相當"},{"definition":["appearance\/manifestation"],"pinyin":["yang4 mao4"],"word":"樣貌"}]}