{"definition":["to assign\/to entrust (a task)\/to give\/to bestow"],"pinyin":["fu4 yu3"],"simplified":["赋予"],"rank":4893.0,"normalized_rank":0.06845941824185357,"fraction":0.000024798971206558757,"cumulative_fraction":0.8563297673292409,"word":"賦予","characters":[{"definition":["poetic essay\/taxation\/to bestow on\/to endow with"],"pinyin":["fu4"],"word":"賦"},{"definition":["(archaic) I\/me","to give"],"pinyin":["yu2","yu3"],"word":"予"}],"containing_words":[],"sentences":[{"english":"Worker mobility gives the tech industry fluidity, velocity, and energy.","chinese":"員工流動賦予科技產業流動性，週轉性和能量。"},{"english":"Creativity is the soul of the advertisement, which endows the advertisement with vitality and life.","chinese":"創意是廣告的靈魂，是賦予廣告精神與生命的活動。"},{"english":"He was given a fresh refill.","chinese":"他被賦予了新的筆芯。"},{"english":"Shou was bestowed by Empress Dowager Cixi when she presented the Empress with the embroidered tapestry, Eight Immortals Celebrating Birthday.","chinese":"壽被賦予慈溪太后她皇后繡掛毯，八老慶祝生日。"},{"english":"The cardigans and leggings as soft as silk endow ladies with particular charm.","chinese":"柔情似水的毛衣裙裝賦予女性獨特的魅力。"},{"english":"A honey character, from lees contact, gives the wine depth.","chinese":"酒渣沉澱後獲取的蜜汁，賦予了其豐富的酒體。"},{"english":"I believe the commune in community is what gives meaning and depth to my life.","chinese":"我相信是這種鄰里間的關係賦予我生命的意義和深度。"},{"english":"Thus it is the densification that produces the higher tensile strength for T700 fibers.","chinese":"所以致密化賦予了T700較高的拉伸強度。"},{"english":"Only one of three women in the Berlusconi government had a heavyweight job.","chinese":"在貝盧斯科尼政府的三名女性，只有一名被賦予重任。"},{"english":"Its fragrant scent will give you unlimited imagination.","chinese":"她將賦予您馥郁的芬芳令人悠然上神往。"},{"english":"Riches, the dumb god, that givest all men tongues.","chinese":"無聲的上帝，賦予所有人以語言。"},{"english":"He thought bestowal could be reduced to appraisal.","chinese":"他認爲賦予可以被簡化爲評價。"},{"english":"The screws also promote a particular sense of perspective.","chinese":"螺絲釘還賦予我們一種從整體出發來看問題的意識。"},{"english":"Erosion shaped its honeycombed appearance.","chinese":"剝蝕賦予了它蜂巢狀的外形。"},{"english":"This gives XP a black and orange look.","chinese":"它賦予XP黑色與橘色結合的外觀。"},{"english":"The code to vest the government with unrestricted power is a \"bad\" code.","chinese":"賦予政府不受約束之權力的規矩是“惡”法。"}],"related":[{"definition":["to create\/to bring about\/to produce\/to set (a record)"],"pinyin":["chuang4 zao4"],"word":"創造"},{"definition":["unique\/distinct\/having special characteristics"],"pinyin":["du2 te4"],"word":"獨特"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"體現"},{"definition":["to manifest"],"pinyin":["zhang1 xian3"],"word":"彰顯"},{"definition":["to come out\/to emerge\/to reveal\/to display"],"pinyin":["zhan3 xian4"],"word":"展現"},{"definition":["to own exclusively\/unique to\/specific\/there is only"],"pinyin":["du2 you3"],"word":"獨有"},{"definition":["to interpret\/to comment and explain\/to annotate\/to perform (i.e. interpret a theatrical role)\/to decode\/interpretation\/annotation"],"pinyin":["quan2 shi4"],"word":"詮釋"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["to view as\/to see as\/to consider to be\/to deem"],"pinyin":["shi4 wei2"],"word":"視為"},{"definition":["to pass on\/to convey\/to relay\/to transmit\/transmission"],"pinyin":["chuan2 da2"],"word":"傳達"},{"definition":["to use\/to put to use"],"pinyin":["yun4 yong4"],"word":"運用"},{"definition":["to release\/to set free\/to liberate (a prisoner)\/to discharge"],"pinyin":["shi4 fang4"],"word":"釋放"},{"definition":["to combine\/to link\/to integrate\/binding\/CL:次[ci4]"],"pinyin":["jie2 he2"],"word":"結合"},{"definition":["value\/worth\/fig. values (ethical, cultural etc)\/CL:個|个[ge4]"],"pinyin":["jia4 zhi2"],"word":"價值"},{"definition":["to present clearly\/to give prominence to\/to magnify\/clear and obvious"],"pinyin":["tu1 xian3"],"word":"凸顯"},{"definition":["to display\/to exhibit\/to bring out implicit or innate qualities\/to express (a thought or moral)\/to develop (an idea)\/to elaborate (on a theme)"],"pinyin":["fa1 hui1"],"word":"發揮"}]}