{"definition":["examination of the evidence of the opposing party in a court of law"],"pinyin":["zhi4 zheng4"],"simplified":["质证"],"rank":25331.0,"normalized_rank":0.3544135547689337,"fraction":0.0000014365658259482745,"cumulative_fraction":0.9847733280350572,"word":"質證","characters":[{"definition":["character\/nature\/quality\/plain\/to pawn\/pledge\/hostage\/to question\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"質"},{"definition":["certificate\/proof\/to prove\/to demonstrate\/to confirm\/variant of 症[zheng4]"],"pinyin":["zheng4"],"word":"證"}],"containing_words":[],"sentences":[{"english":"Other circumstances in which the experts' conclusion cannot be as the evidence upon the cross-examination.","chinese":"經過質證認定不能作爲證據使用的其他情形。"},{"english":"Strengthening the function of court trial requires more of Cross - examination and Attestation.","chinese":"強化庭審功能必然也對質證和認證提出了新的要求。"},{"english":"The grade-b qualification certificate to engage in the consulting of capital expenditure issued by the construction committee of shandong province.","chinese":"山東省建設委員會頒發的工程造價諮詢乙級資質證書。"},{"english":"The second part is its characteristics and effects of the cross-examination.","chinese":"論文第二部分是“質證的性質及其效力”。"},{"english":"Commensurate with the quality of inspection certificate grading operations.","chinese":"與資質證書等級相適應的勘察業務。"},{"english":"The evidence shall be exhibited in court, and be cross-examined by the parties concerned.","chinese":"證據應當在法庭上出示，由當事人質證。"},{"english":"Article 45 The evidence shall be presented during the hearings and may be examined by the parties.","chinese":"第45條證據應當在開庭時出示，當事人可以質證。"},{"english":"Article 47 Evidences shall be presented at court and be cross-examined by the parties concerned.","chinese":"第四十七條證據應當在法庭上出示，由當事人質證。"},{"english":"The expertise report should be cross-examined by both parties and advice should be given.","chinese":"鑑定意見書應當經雙方當事人質證，發表意見。"},{"english":"The copy of the sheet above and certificate are given to regional manager.","chinese":"上述申請表格與資質證書複印件交四春公司區域經理。"},{"english":"It is concluded that the Abnormal Savda is the main syndrome of depression in the traditional Uighur Medicine.","chinese":"由此得出，異常黑膽質證是抑鬱症的維醫主要證型。"},{"english":"During this trial, there are many doubtable pieces of evidence which must be re-verified.","chinese":"這次審判中，有許多證據有質證，需要重新覈實。"},{"english":"Prethrombosis state is more obvious in Abnormal Savda syndrome than that of non Abnormal Savda syndrome.","chinese":"複雜性疾病異常黑膽質證患者血栓前狀態改變明顯。"},{"english":"The evidence shall be displayed and cross-examined by the litigants at the court.","chinese":"證據應當在法庭上出示，並由當事人互相質證。"},{"english":"The parties concerned may request for cross-examining the evidences collected by the arbitration panel on its own initiative.","chinese":"當事人可以對仲裁庭自行收集的證據提出質證意見。"},{"english":"But the seriousness of rhinorrhea and nasal obstruction does not have any relationship with the pattern.","chinese":"而流鼻水與鼻塞嚴重程度均與體質證型沒有關聯性。"}],"related":[]}