{"definition":["point mass\/particle"],"pinyin":["zhi4 dian3"],"simplified":["质点"],"rank":61379.0,"normalized_rank":0.8587718439130859,"fraction":3.3282898924520535e-8,"cumulative_fraction":0.999866401859808,"word":"質點","characters":[{"definition":["character\/nature\/quality\/plain\/to pawn\/pledge\/hostage\/to question\/Taiwan pr. [zhi2]"],"pinyin":["zhi4"],"word":"質"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[],"sentences":[{"english":"Despite their many differences, there is a remarkable degree of homogeneity among them.","chinese":"他們的差異點雖多，但其間亦有極大的同質點。"},{"english":"Now, that is only for a point mass.","chinese":"那只是對於一個質點而言的。"},{"english":"What is the work done on the particle in this case?","chinese":"這種情況下對質點所作的功是多少？"},{"english":"And for non-breaking wave the horizontal particle velocity can be estimated by using regular wave theory.","chinese":"對於非破波，質點的水平速度可以由規則波理論得到。"},{"english":"Polarization of shear-wave is analysed by using particle motion diagram.","chinese":"用質點運動圖的方法對橫波的偏振進行了分析。"},{"english":"The transverse impact of variable cross-section flexible beam has been investigated.","chinese":"研究了質點對變截面柔性梁橫向碰撞問題。"},{"english":"Taking the three dimensional bar element as an example, the formulations of the FPM are derived in the paper.","chinese":"以空間杆單元爲例推導了有限質點法計算公式。"},{"english":"The shaking table test of an SMA strands-composite bearing;","chinese":"對兩質點以滾球隔震模型進行了振動臺試驗。"},{"english":"This artical approaches the dynamics of relative motion of a system with variable mass.","chinese":"本文研究變質量質點系的相對運動動力學。"},{"english":"Therefore, if , the system of particles must be in equilibrium.","chinese":"故時質點系必處於平衡。"},{"english":"The molecules comprising this particle are continuously changing.","chinese":"組成該質點的分子是連續變化的。"},{"english":"A type of surface wave in which particles oscillate horizontally and perpendicularly to the direction of wave propagation.","chinese":"一種面波，質點水平地振動，並垂直於波傳播的方向。"},{"english":"The transient response of a double-degree-of-freedom system under forced load is computed.","chinese":"最後計算了一個雙質點系在強迫力下的瞬態響應。"},{"english":"Dynamic calculation model was series-wound more particle.","chinese":"動力計算模型採用的是彎剪型串聯多質點系。"},{"english":"Thus we reduce considerably memory requirements and calculating time. Test runs showe…","chinese":"計算檢驗表明，與質點網格法相比，減少了數值波動。"},{"english":"A crossplot of two components of particle motion over a time window.","chinese":"質點在一個時窗內運動的兩個分量的交會圖。"}],"related":[]}