{"definition":["to rely on\/to depend on"],"pinyin":["lai4 yi3"],"simplified":["赖以"],"rank":38147.0,"normalized_rank":0.5337260224140584,"fraction":4.580777930927432e-7,"cumulative_fraction":0.9957106709264084,"word":"賴以","characters":[{"definition":["surname Lai","to depend on\/to hang on in a place\/bad\/to renege (on promise)\/to disclaim\/to rat (on debts)\/rascally\/to blame\/to put the blame on"],"pinyin":["Lai4","lai4"],"word":"賴"},{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"}],"containing_words":[],"sentences":[{"english":"Energy is an important material base for human-kind's existence and production.","chinese":"能源是人類賴以生存和進行生產的重要物質基礎。"},{"english":"Wetland is a significant habitat for Ciconia boyciana.","chinese":"溼地是東方白鸛賴以生存的棲息地。"},{"english":"Overfishing can also upset the delicate ecological balance coral reefs depend on to thrive.","chinese":"捕撈過度同樣會打破珊瑚礁賴以生存的生態平衡。"},{"english":"Honesty and trust are the basis of the civilization of the human society.","chinese":"誠信是人類社會文明賴以生存的基石。"},{"english":"Make furniture is John's meal ticket.","chinese":"製做傢俱是約翰賴以爲生的手段。"},{"english":"Whampoa and its alumni were the base on which Chiang’s power was built.","chinese":"黃埔軍校以及其校友是蔣介石賴以建立其權力的基石。"},{"english":"Making furniture is John 's meal ticket.","chinese":"製做傢俱是約翰賴以爲生的手段。"},{"english":"North Korea is essentially tearing up the agreements that make the zone run.","chinese":"北韓方面實際上撕毀了工業園區賴以運作的合同。"},{"english":"For subsistence, the Narragansett depended on the cultivation of corn (maize), hunting, and fishing.","chinese":"納拉甘塞特人靠種植玉米，狩獵和捕魚賴以生存。"},{"english":"For credit industry, the credit is the base of existence and development.","chinese":"對信託業而言，信用更是賴以生存和發展的根本。"},{"english":"Water is an important resource on which mankind rely for existence indispensably.","chinese":"水是人類賴以生存和不可缺少的一種重要資源。"},{"english":"This is what we need to live by.","chinese":"這纔是我們所賴以生存的追求。"},{"english":"Dor locate flying insects on which they feed.","chinese":"或者找到它們賴以爲生的昆蟲。"},{"english":"This is the control upon which WordPad application is built.","chinese":"這是賴以寫字板應用程序生成的控制。"},{"english":"The discussion poisoned the public discourse that is the lifeblood of a democratic society.","chinese":"這場辨論毒化了一個民主社會賴以生存的公衆對話。"},{"english":"Core systems will be the hardware and software without which the organization cannot exist.","chinese":"核心系統將是組織賴以生存而不可或缺的硬件和軟件。"}],"related":[]}