{"definition":["Wright (name)"],"pinyin":["Lai4 te4"],"simplified":["赖特"],"rank":26223.0,"normalized_rank":0.3668937920613379,"fraction":0.0000013247469637720345,"cumulative_fraction":0.9860045852334592,"word":"賴特","characters":[{"definition":["surname Lai","to depend on\/to hang on in a place\/bad\/to renege (on promise)\/to disclaim\/to rat (on debts)\/rascally\/to blame\/to put the blame on"],"pinyin":["Lai4","lai4"],"word":"賴"},{"definition":["special\/unique\/distinguished\/especially\/unusual\/very\/abbr. for 特克斯[te4 ke4 si1], tex"],"pinyin":["te4"],"word":"特"}],"containing_words":[{"definition":["Madeleine Albright (1937-), former US Secretary of State"],"pinyin":["Ao4 er3 bu4 lai4 te4"],"word":"奧爾布賴特"},{"definition":["Fulbright (scholarship)"],"pinyin":["fu4 bu4 lai4 te4"],"word":"富布賴特"}],"sentences":[{"english":"I would have introduced Wright-Phillips and Robben a lot earlier.","chinese":"要是我，就早些換上羅本和小賴特。"},{"english":"Wrighty ran to the new North Bank Stand and embraced the fans in the front row.","chinese":"賴特跑到了新的北看臺，和前面的球迷擁抱。"},{"english":"Wilbur and Orville Wright had 4 wanted to fly.","chinese":"威爾伯和奧維爾賴特有4要飛。"},{"english":"Fallingwater is Wright designed for the Kafu Man family villa.","chinese":"流水別墅是賴特爲卡夫曼家族設計的別墅。"},{"english":"It was on one of these occasions that I met the Cartwrights.","chinese":"就是在一次這樣的場合，我遇到了卡特賴特一家。"},{"english":"Boyle doesn’t pay much attention to the concentrated effort that Wright put into his work.","chinese":"博伊爾沒有把過多的精力集中在賴特的藝術作品上面。"},{"english":"Credit to Wrighty, they were unbelievable goals.","chinese":"說到賴特的入球，都是不可思議的入球。"},{"english":"Why associate myself with Reverend Wright in the first place, they may ask?","chinese":"他們可能會問，爲什麼你會在一開始同賴特牧師交往？"},{"english":"At 11:30, he swung off his bunk and stepped into a puddle.","chinese":"11點半，賴特搖搖晃晃地下牀，一腳踩進了水坑裏。"},{"english":"Tadashi doesn’t hide the fact that his view of Wright is limited.","chinese":"佐藤不想掩蓋他對賴特所知有限這一事實。"},{"english":"He got full of gin and laid round Wright's poolroom all day.","chinese":"他灌了一肚子杜松子酒，在賴特檯球室躺了一天。"},{"english":"Spiral-shaped museum, is Wright's proud of the pen.","chinese":"螺旋形的博物館，是賴特的得意之筆。"},{"english":"You will also want to visit the Wheelwright Museum of The American Indian.","chinese":"你也會想要參觀美國印第安人惠賴特博物館。"},{"english":"\"I don't have to work as hard for people to come, \" Braitman said.","chinese":"“我沒有工作，爲人民來之不易，”布賴特曼說。"},{"english":"Fulbright disagreed.","chinese":"富布賴特卻不同意。"},{"english":"Wright and Savana took turns lending him their vests.","chinese":"賴特和薩瓦那輪流把救生衣借給蓋伊穿。"}],"related":[]}