{"definition":["to purchase\/to acquire"],"pinyin":["gou4 de2"],"simplified":["购得"],"rank":14240.0,"normalized_rank":0.1992360751612497,"fraction":0.0000045174236408693535,"cumulative_fraction":0.9557395012040776,"word":"購得","characters":[{"definition":["to buy\/to purchase"],"pinyin":["gou4"],"word":"購"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"}],"containing_words":[],"sentences":[{"english":"Many teens find them readily available through local dealers or online.","chinese":"許多少年從當地藥販或網上購得。"},{"english":"Lime water may be bought at any druggist's, or easily prepared at home.","chinese":"石灰水可從藥店購得，不過在家裏配製也很容易。"},{"english":"For real pheromone, it is impossible to be obtained at so cheap price.","chinese":"真正高品質的費洛蒙，是不可能那麼便宜可以購得的。"},{"english":"It was bought at Sotheby's by the Perot Foundation in 1993.","chinese":"在1993年通過蘇士比拍賣行，由佩洛特基金購得。"},{"english":"They bought the freehold of their house.","chinese":"他們購得了一處可終身擁有的房子。"},{"english":"You can buy it from Amazon.","chinese":"您可以在亞馬遜上購得。"},{"english":"But we climbers don't have the luxury of purchasing that competitive edge.","chinese":"但是我們攀巖者無法奢求購得這樣的競爭優勢。"},{"english":"It is actually easily affordable, with the ticket price ranging from over 1,000 yuan to merely 50 yuan.","chinese":"從上千元的貴賓票到50元的普通票，都可以購得。"},{"english":"Chinese investors aren’t allowed to purchase control of Taiwanese financial companies.","chinese":"中國的投資者並不允許購得臺灣金融公司的控制權。"},{"english":"A person who buys something, especially something expensive.","chinese":"以最高應價購得拍賣標的競買人。"},{"english":"I need not sell my soul to buy bliss.","chinese":"我不必出賣靈魂來購得幸福。"},{"english":"I consider it to be one of the best purchases I’ve made.","chinese":"我覺得這是我所購得的東西中最值得一個之一。"},{"english":"However, if you should make us an acceptable bid, there is a possibility of your obtaining these.","chinese":"若你方能給一個可接受的遞盤，有可能購得此貨。"},{"english":"Half of them, he reckons, had been bought or pilfered from state armories .","chinese":"據他估計，其中有一半是從國家武器庫購得或盜出。"}],"related":[]}