{"definition":["to walk over (to)"],"pinyin":["zou3 qu4"],"simplified":["走去"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"走去","characters":[{"definition":["to walk\/to go\/to run\/to move (of vehicle)\/to visit\/to leave\/to go away\/to die (euph.)\/from\/through\/away (in compound verbs, such as 撤走[che4 zou3])\/to change (shape, form, meaning)"],"pinyin":["zou3"],"word":"走"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"The tiger paced up and down the cage.","chinese":"老虎在籠中走來走去。"},{"english":"Watching those blocky minifigures walk around their sets will make you smile.","chinese":"看那些塊狀迷你人偶在佈景中走來走去會讓你發笑。"},{"english":"She paraded up and down in her new hat.","chinese":"她戴著新帽子在人前走來走去。"},{"english":"He walked back and forth at the seashore, anxiously waiting for the return of the fishing-boats.","chinese":"他在海灘上走來走去，焦急地等待着漁船歸來。"},{"english":"Panda always walks around and climbs up and down.","chinese":"熊貓每天走來走去，爬上爬下。"},{"english":"She walked around in the lightless room.","chinese":"她在黑暗的房間中走來走去。"},{"english":"Then he started up and walked about the Luxembourg garden like a madman.","chinese":"隨後，他象個瘋子似的在公園裏走來走去。"},{"english":"She walks across a levee, blowing a whistle and waving her arms.","chinese":"她在大堤上走來走去，吹口哨，揮舞着胳膊趕鳥。"},{"english":"He was walking up and down the station platform.","chinese":"他在火車站的月臺上走來走去。"},{"english":"I could hear the thug thudding about upstairs in his heavy boots.","chinese":"我聽見兇手穿着沉重的靴子在樓上咯咯地走來走去。"},{"english":"He strutted up and down before the manager.","chinese":"他在經理面前大搖大擺地走來走去。"},{"english":"The baby put on his father's clothes and walked the way his father did.","chinese":"寶寶穿上爸爸的衣服，人模狗樣地走來走去。"},{"english":"Cigarette in the mouth, he paced about most of the night.","chinese":"夜裏大部分時間他叼着煙，在屋裏走來走去。"},{"english":"The show has also had its contestants walk in a public square wearing bikinis.","chinese":"該節目還曾讓選手們身穿比基尼在廣場走來走去。"},{"english":"He tramped up and down in the office.","chinese":"他在辦公室裏沉重地走來走去。"},{"english":"I can hear him thudd about upstairs in his heavy boots.","chinese":"我聽見他穿著沉重的靴子在樓上咯咯地走來走去。"}],"related":[{"definition":["quick step"],"pinyin":["kuai4 bu4"],"word":"快步"},{"definition":["directly"],"pinyin":["jing4 zhi2"],"word":"徑直"},{"definition":["to turn one's head\/to turn around"],"pinyin":["niu3 tou2"],"word":"扭頭"},{"definition":["at a stride\/taking large steps (while walking)"],"pinyin":["da4 bu4 liu2 xing1"],"word":"大步流星"},{"definition":["at a fast pace"],"pinyin":["ji2 bu4"],"word":"疾步"},{"definition":["without leave\/without consulting anyone"],"pinyin":["jing4 zi4"],"word":"徑自"},{"definition":["nutation (plants turning to face the sun)","to turn one's head\/to change direction\/U-turn\/volte face\/to repent"],"pinyin":["zhuan3 tou2","zhuan4 tou2"],"word":"轉頭"},{"definition":["(literary) to move forward"],"pinyin":["ju3 bu4"],"word":"舉步"},{"definition":["abbr. for 朝鮮|朝鲜[Chao2 xian3] Korea","imperial or royal court\/government\/dynasty\/reign of a sovereign or emperor\/court or assembly held by a sovereign or emperor\/to make a pilgrimage to\/facing\/towards","morning"],"pinyin":["Chao2","chao2","zhao1"],"word":"朝"},{"definition":["large strides"],"pinyin":["da4 bu4"],"word":"大步"},{"definition":["(of a person) to turn round\/to face about\/(of a widow) to remarry (archaic)"],"pinyin":["zhuan3 shen1"],"word":"轉身"},{"definition":["to pout\/to stick out one's lips"],"pinyin":["nu3 zui3"],"word":"努嘴"},{"definition":["to get up\/to leave\/to set forth"],"pinyin":["qi3 shen1"],"word":"起身"},{"definition":["to look around\/to peep (through a crack)\/to peer at\/to throw a look at"],"pinyin":["zhang1 wang4"],"word":"張望"},{"definition":["to walk slowly\/to amble along\/gradually\/slowly"],"pinyin":["huan3 bu4"],"word":"緩步"},{"definition":["to wave (one's hand)"],"pinyin":["hui1 shou3"],"word":"揮手"}]}