{"definition":["to be at an impasse (idiom)\/in a tight spot\/at the end of one's rope\/desperate"],"pinyin":["zou3 tou2 wu2 lu4"],"simplified":["走投无路"],"rank":23605.0,"normalized_rank":0.33026457543408005,"fraction":0.000001685019746867283,"cumulative_fraction":0.9820861809303948,"word":"走投無路","characters":[{"definition":["to walk\/to go\/to run\/to move (of vehicle)\/to visit\/to leave\/to go away\/to die (euph.)\/from\/through\/away (in compound verbs, such as 撤走[che4 zou3])\/to change (shape, form, meaning)"],"pinyin":["zou3"],"word":"走"},{"definition":["to cast\/to send\/to throw oneself (into the river etc)\/to seek refuge\/to place oneself into the hands of"],"pinyin":["tou2"],"word":"投"},{"definition":["not to have\/no\/none\/not\/to lack\/un-\/-less"],"pinyin":["wu2"],"word":"無"},{"definition":["road\/CL:條|条[tiao2]\/journey\/route\/line (bus etc)\/sort\/kind","surname Lu"],"pinyin":["Lu4","lu4"],"word":"路"}],"containing_words":[],"sentences":[{"english":"Advocate cornered, so heart a horizontal, allow to stay.","chinese":"雅樂走投無路，於是把心一橫，容許留下。"},{"english":"Pure literature in this era of almost no way out, still cling to.","chinese":"在這個純文學幾乎已經走投無路的年代，仍然固守。"},{"english":"Veterans of the war were desperate for relief.","chinese":"一戰老兵們走投無路，急需救濟。"},{"english":"Revolutionary forces have fought Gadhafi's men street by street, cornering the last vestiges of the old regime to that last district.","chinese":"卡扎菲舊政權的殘存勢力也在這個城市最終走投無路。"},{"english":"We must not make him desperate.","chinese":"我們千萬不要弄得他走投無路。"},{"english":"Oh, you and I dancing slow, and we got nowhere to go.","chinese":"哦，你和我緩慢的舞動着，我們走投無路。"},{"english":"Very often the bandits are hard pressed by gendarmes or carbineers;","chinese":"強盜常常讓憲兵和馬槍兵逼得走投無路。"},{"english":"Pumas will not attack a human being unless it is cornered.","chinese":"美洲獅除非被逼得走投無路，是絕不會傷人的。"},{"english":"The remainder, referred to as displaced persons, or DPs, were people who literally had no place to go.","chinese":"其餘被稱爲流離失所的人是那些完全走投無路的難民。"},{"english":"They had to escape to the home of Chiron.","chinese":"人馬族被逼的走投無路，只好逃到了奇倫的家中。"},{"english":"He saw no way of eluding Featherstone's stupid demand.","chinese":"費瑟斯通的愚蠢要求使他走投無路。"},{"english":"If you're desperate for money, what are some things you can do to make money fast?","chinese":"如果你缺錢到走投無路的地步，怎樣才能賺點快錢呢？"},{"english":"Mr Jones is a good chess player, and he soon had me beat coming and going.","chinese":"瓊斯先生是個象棋高手，他一下子攻得我走投無路。"},{"english":"They were desperate people in a place where it hadn't rained.","chinese":"天已經好久不下雨了，他們被逼得走投無路。"}],"related":[{"definition":["penniless (idiom)"],"pinyin":["shen1 wu2 fen1 wen2"],"word":"身無分文"},{"definition":["to be drowned (figurative and literal)"],"pinyin":["mie4 ding3"],"word":"滅頂"},{"definition":["to die in such a way that sb (or sth) else also perishes\/to take sb down with oneself\/to end in mutual destruction"],"pinyin":["tong2 gui1 yu2 jin4"],"word":"同歸於盡"},{"definition":["no strategy left to try (idiom); at one's wit's end\/at the end of one's tether\/powerless"],"pinyin":["wu2 ji4 ke3 shi1"],"word":"無計可施"},{"definition":["to throw one's life in for\/to haplessly give one's life for\/to sacrifice oneself torturously working for another or for a group\/to pour in one's utmost effort\/to shed one's last ounce of strength for"],"pinyin":["mai4 ming4"],"word":"賣命"},{"definition":["to look up and see no-one familiar (idiom); not having anyone to rely on\/without a friend in the world"],"pinyin":["ju3 mu4 wu2 qin1"],"word":"舉目無親"},{"definition":["no way out\/nowhere to go\/trapped beyond hope of rescue\/painted into a corner"],"pinyin":["wu2 lu4 ke3 tao2"],"word":"無路可逃"},{"definition":["to entrap\/to frame\/to plant false evidence against sb"],"pinyin":["wu1 xian4"],"word":"誣陷"},{"definition":["to raise money"],"pinyin":["chou2 qian2"],"word":"籌錢"},{"definition":["to set a trap"],"pinyin":["she4 ju2"],"word":"設局"},{"definition":["you can't guard against it (idiom)\/impossible to defend effectively\/not much one can do about it\/It can't be prevented."],"pinyin":["fang2 bu4 sheng4 fang2"],"word":"防不勝防"},{"definition":["to repeat errors\/to continue blundering\/to make continuous mistakes"],"pinyin":["yi1 cuo4 zai4 cuo4"],"word":"一錯再錯"},{"definition":["to submit to humiliation (idiom); to suffer in silence\/to swallow one's anger\/to grin and bear it"],"pinyin":["ren3 qi4 tun1 sheng1"],"word":"忍氣吞聲"},{"definition":["to watch with folded arms (idiom); to look on without lifting a finger"],"pinyin":["xiu4 shou3 pang2 guan1"],"word":"袖手旁觀"},{"definition":["to fall into a trap\/taken in by a stratagem\/cheated\/ripped off"],"pinyin":["zhong4 ji4"],"word":"中計"},{"definition":["dumbstruck and unable to reply (idiom); left speechless\/at a loss for words"],"pinyin":["ya3 kou3 wu2 yan2"],"word":"啞口無言"}]}