{"definition":["to go through the motions"],"pinyin":["zou3 guo4 chang3"],"simplified":["走过场"],"rank":29945.0,"normalized_rank":0.41896940103255775,"fraction":9.469568654533541e-7,"cumulative_fraction":0.9901898976570764,"word":"走過場","characters":[{"definition":["to walk\/to go\/to run\/to move (of vehicle)\/to visit\/to leave\/to go away\/to die (euph.)\/from\/through\/away (in compound verbs, such as 撤走[che4 zou3])\/to change (shape, form, meaning)"],"pinyin":["zou3"],"word":"走"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"}],"containing_words":[],"sentences":[{"english":"I think my inspection is just some sort of formality.","chinese":"我要告訴我的客戶，當不走過場起重重量。"},{"english":"I'm convinced the new method won't work but I'll still have to go through the motions .","chinese":"我深信這個新方法起不了什麼作用，但仍還得走過場。"},{"english":"I like to tell my clients to not just go through the motion when lifting weights.","chinese":"我要告訴我的客戶，當不走過場起重重量。"},{"english":"I'm not really into this project. I'm just going through the motions.","chinese":"我對這個項目並不感冒，只是走走過場而已。"},{"english":"Such thing is all about routines.","chinese":"這種事我們一般走走過場就完了。"},{"english":"Now I don't even go through the motions.","chinese":"如今，我甚至不願去“走過場”。"},{"english":"You can't afford to just coast along, or go through the motions, if you're running a business.","chinese":"如果你在經營事業的話，你不能只是走走過場而已。"},{"english":"The economy has sufficient momentum that Beijing can muddle through with piecemeal reforms for now.","chinese":"經濟動力充足，令北京暫時可靠零星改革來走過場。"},{"english":"Generally speaking, we don't take this kind of matter too serisouly.","chinese":"這種事我們一般走走過場就完了。"},{"english":"She's here to remind you that life is too short for simply going through the motions.","chinese":"它在提醒你，如果只是走走過場，生命可是太短暫了。"}],"related":[]}