{"definition":["vigorously\/energetically\/enthusiastically"],"pinyin":["qi3 jin4"],"simplified":["起劲"],"rank":26589.0,"normalized_rank":0.3720146069144992,"fraction":0.0000012815375862209023,"cumulative_fraction":0.9864817808404768,"word":"起勁","characters":[{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"},{"definition":["stalwart\/sturdy\/strong\/powerful","strength\/energy\/enthusiasm\/spirit\/mood\/expression\/interest\/CL:把[ba3]\/Taiwan pr. [jing4]"],"pinyin":["jin4","jing4"],"word":"勁"}],"containing_words":[],"sentences":[{"english":"The mallards seemed like the colder it was the better in the pond.","chinese":"池中野鴨是愈冷愈遊得起勁兒。"},{"english":"They talked of their holiday plans with great animation.","chinese":"他們非常起勁地談着度假計劃。"},{"english":"They are working hard to produce a program-controlled computer.","chinese":"他們正在起勁打造一臺程序節制計算機。"},{"english":"When I finished sulkins, I double my efforts and worked even harder.","chinese":"我生完氣，就加倍努力，於是更起勁。"},{"english":"Eg: Inspired by her example, the League members worked even harder.","chinese":"在她榜樣的鼓舞下，共青團員們幹得更起勁了。"},{"english":"HuiZhen turned to care for her husband.","chinese":"惠珍起勁去關懷丈夫。"},{"english":"Emil had already begun work and was mowing vigorously.","chinese":"愛彌兒已經在那裏開始割草了，他幹得十分起勁。"},{"english":"The more they worked, the more energetical they became.","chinese":"他們越幹越起勁。"},{"english":"As they were inspired by her example, the League members worked even harder.","chinese":"在她的榜樣的鼓舞下，共青團員們幹得更起勁了。"},{"english":"They were talking and laughing away but they stopped as soon as a visitor appeared.","chinese":"她們正說笑得起勁，見來了客人，便立即啞口了。"},{"english":"Gret efforts ensure the success of our work.","chinese":"巨大的起勁確保了我們工作的成功。"},{"english":"I wish I had a glass of beer; but I can't get up the gumption to go down to the village an' get it.","chinese":"天吶，我真想喝一杯啤酒，可又鼓不起勁下村子裏去。"},{"english":"Clustered on the concrete, birds pecked at part of a candy bar stuck to","chinese":"在水泥地上，一羣鳥兒起勁地啄着紅紙包裹的糖果。"},{"english":"\"Lady fish,\" he eagerly replied. \"Very tasty!\"","chinese":"“海鰱魚，”他很起勁地回答道，“很好喫。”"},{"english":"The others agreed and they all began to dig hard in the sand.","chinese":"別的孩於同意了，他們就都起勁地挖起沙來。"},{"english":"I didn't hear you calling me because i was in the zone with my study.","chinese":"我沒有聽見你給我打電話，我剛纔學得正起勁呢。"}],"related":[]}