{"definition":["to originate"],"pinyin":["qi3 shi3"],"simplified":["起始"],"rank":15191.0,"normalized_rank":0.21254179900102133,"fraction":0.000004053652720328995,"cumulative_fraction":0.9598165423138044,"word":"起始","characters":[{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"},{"definition":["to begin\/to start\/then\/only then"],"pinyin":["shi3"],"word":"始"}],"containing_words":[],"sentences":[{"english":"This is the starting value for the two data sets.","chinese":"這是兩個數據集的起始值。"},{"english":"The server part of the channel is located at the start of the server context sink chain.","chinese":"通道的伺服器部分位在伺服器內容接收鏈結的起始端。"},{"english":"Write the words in front of, summing up the work starting.","chinese":"即寫在前面的話，工作總結起始的段落。"},{"english":"Gets the starting column of a script block in the generated source file.","chinese":"獲取生成資源文件中某個腳本塊的起始列。"},{"english":"You create a new project that deals with requirements for a new starship generation.","chinese":"您需要爲一個新的起始代，創建一個新項目。"},{"english":"Take a look at the start page for an example of the inclusion.","chinese":"在起始頁中可看到包含的示例。"},{"english":"The appointment form must have a start date field.","chinese":"約會表單必須有一個起始日期字段。"},{"english":"He stood there at the starting line with a regular piece of paper.","chinese":"他那這一張普通的紙站在起始線上。"},{"english":"A melancholy fold, which resembled the beginning of irony, wrinkled her right cheek.","chinese":"一條含愁的皺痕橫在她的右臉上，彷彿是冷笑的起始。"},{"english":"Attributes are always added to the start tag of an HTML element.","chinese":"屬性應該添加在HTML元素裏的起始標籤中。"},{"english":"This is regarded as the beginning of barehanded martial arts and healthcare martial arts.","chinese":"以上是徒手武術而後保健武術的起始。"},{"english":"Ancona now starts as a rebel region.","chinese":"安科納現在起始是叛亂地區。"},{"english":"Designates the start or destination of a hypertext link.","chinese":"表示超鏈接的起始或目的位置。"},{"english":"Attributes are name-value pairs attached to an element's start tag.","chinese":"屬性是附加到元素起始標記上的名值對。"},{"english":"Describes how to install and apply a custom Start Page.","chinese":"描述如何安裝和應用自定義起始頁。"},{"english":"Hold and slowly return. Avoid arching your back.","chinese":"維持幾秒並慢慢恢復起始位置，避免弓背。"}],"related":[{"definition":["initial\/starting (point)"],"pinyin":["chu1 shi3"],"word":"初始"},{"definition":["beginning\/origin\/to originate\/to initiate"],"pinyin":["fa1 duan1"],"word":"發端"},{"definition":["starting point\/initial point"],"pinyin":["shi3 dian3"],"word":"始點"},{"definition":["to initiate\/to start\/the start"],"pinyin":["zhao4 shi3"],"word":"肇始"},{"definition":["to increase by degrees\/in increasing order\/incremental\/progressive"],"pinyin":["di4 zeng1"],"word":"遞增"},{"definition":["to be considered to be\/to be defined to be\/to be called"],"pinyin":["ji2 wei2"],"word":"即為"},{"definition":["midpoint\/half-way point"],"pinyin":["zhong1 dian3"],"word":"中點"},{"definition":["namely\/that is\/i.e.\/prompt\/at once\/at present\/even if\/prompted (by the occasion)\/to approach\/to come into contact\/to assume (office)\/to draw near"],"pinyin":["ji2"],"word":"即"},{"definition":["to begin\/beginning\/to start\/initial\/CL:個|个[ge4]"],"pinyin":["kai1 shi3"],"word":"開始"},{"definition":["the end\/end point\/finishing line (in a race)\/destination\/terminus\/CL:個|个[ge4]"],"pinyin":["zhong1 dian3"],"word":"終點"},{"definition":["progressively decreasing\/gradually falling\/in descending order"],"pinyin":["di4 jian3"],"word":"遞減"},{"definition":["icon (computing)"],"pinyin":["tu2 shi4"],"word":"圖示"},{"definition":["to correspond\/a correspondence\/corresponding\/homologous\/matching with sth\/counterpart"],"pinyin":["dui4 ying4"],"word":"對應"},{"definition":["groundbreaking\/to lay foundation"],"pinyin":["dian4 ji1"],"word":"奠基"},{"definition":["sequence\/order"],"pinyin":["shun4 xu4"],"word":"順序"},{"definition":["norm\/standard\/standard of reference\/base\/base point\/base line\/benchmark\/reference point\/reference frame\/criterion\/data"],"pinyin":["ji1 zhun3"],"word":"基準"}]}