{"definition":["to be industrious, rising early and going to bed late"],"pinyin":["qi3 zao3 tan1 hei1"],"simplified":["起早贪黑"],"rank":32145.0,"normalized_rank":0.4497502553411778,"fraction":7.801044379501655e-7,"cumulative_fraction":0.9920826361221082,"word":"起早貪黑","characters":[{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"},{"definition":["early\/morning\/Good morning!\/long ago\/prematurely"],"pinyin":["zao3"],"word":"早"},{"definition":["to have a voracious desire for\/to covet\/greedy\/corrupt"],"pinyin":["tan1"],"word":"貪"},{"definition":["abbr. for Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1]","black\/dark\/sinister\/secret\/shady\/illegal\/to hide (sth) away\/to vilify\/(loanword) to hack (computing)"],"pinyin":["Hei1","hei1"],"word":"黑"}],"containing_words":[],"sentences":[{"english":"The husband worked day and night to support the family, but with no care of his wife.","chinese":"丈夫爲了養家起早貪黑以至於沒有多關心他的妻子。"},{"english":"There was once a poor woodcutter who toiled from early morning till late at night.","chinese":"從前有個窮樵夫，天天起早貪黑地勞作。"},{"english":"When you were little, mom and dad went out to sell at night and came back at morning…","chinese":"在你小的時候，媽媽和爸爸總是起早貪黑的工作。"},{"english":"Yeah, I'll miss the boredom and the freedom and the time spent alone.","chinese":"我會想想起早貪黑和無拘無束的時光。"},{"english":"Consciousness will never agree to work 9 to 5.","chinese":"意識從不會同意朝九晚五，起早貪黑。"},{"english":"She gets up very early and sleeps very late every day. She works hard, yet without complaining.","chinese":"她每天起早貪黑，辛苦地工作，從無怨言。"},{"english":"Peasants work from dawn to dusk all the year round.","chinese":"農民整年起早貪黑地勞動。"}],"related":[]}