{"definition":["to get up\/to leave\/to set forth"],"pinyin":["qi3 shen1"],"simplified":["起身"],"rank":9117.0,"normalized_rank":0.12755865851440404,"fraction":0.000009696125931423257,"cumulative_fraction":0.9218131663292284,"word":"起身","characters":[{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"}],"containing_words":[],"sentences":[{"english":"Then David rose and went down to the wilderness of Paran.","chinese":"大衛起身，下到巴蘭的曠野。"},{"english":"She rose from her seat to watch him.","chinese":"現在她從樹樁上站起身來看他。"},{"english":"At once I stood up and said it was too inconvenient, I then walked quickly to follow him.","chinese":"我立即起身說那太麻煩了，就疾步跟過去。"},{"english":"She rose to her feet and gazed upon him, round-eyed.","chinese":"她站起身，直愣愣地看着他，眼睛瞪得圓圓的。"},{"english":"My friend was on her feet now, with one unbelieving hand against her mouth.","chinese":"我的朋友不禁站起身，驚訝得用手捂住了嘴巴。"},{"english":"He Finally got up and, throwing off his clothes, climbed into his iron cot.","chinese":"最後他站起身來，把衣服一脫，爬到鐵牀上。"},{"english":"He got up abruptly and tried to see himself in the dirty looking- glass over the wash-stand.","chinese":"他猛然站起身來，想在盟洗臺的骯髒鏡子裏看看自己。"},{"english":"He stood up and drew the curtains to let in the pale glint of dawn.","chinese":"他起身拉開窗簾，讓黎明的翕光射進房間。"},{"english":"Pushing aside the stack of paper, I got up.","chinese":"我把那疊文件往旁邊推了推，站起身來。"},{"english":"Abruptly he Sat. upright in his chair and, with an effort of will, expunged his downcast mood.","chinese":"突然，他在椅子上直起身來，努力趕走沮喪的情緒。"},{"english":"\"I remember, \" I answered her and got up from the cushioned seat.","chinese":"“我記得，”我答道，然後從軟墊椅起身。"},{"english":"Had he got up little earlier, he would not have missed the train.","chinese":"要是他早一點起身的話，他本來可以不誤車的。"},{"english":"The angered witch got up and went to Clemencia's bedroom.","chinese":"巫婆的憤怒起身前往克萊門的臥室。"},{"english":"She just stands up laughing, kicking the mosquito-incense holder back under the table.","chinese":"她只是笑吟吟地站起身來，將蚊香盤踢到桌子底下”。"},{"english":"At this point Shasta got up and tiptoed away.","chinese":"沙斯塔聽到這兒便站起身來，掂着腳走開了。"},{"english":"Zeus stood up to shake off the dung pellet, and the eggs were thrown to the ground without his thinking.","chinese":"宙斯站起身來抖落糞蛋，沒留神把鷹卵也抖掉了。"}],"related":[{"definition":["to get up on hind legs (esp. of horse)\/to stand\/to spring up"],"pinyin":["zhan4 qi3"],"word":"站起"},{"definition":["to stand up"],"pinyin":["zhan4 qi3 lai5"],"word":"站起來"},{"definition":["(of a person) to turn round\/to face about\/(of a widow) to remarry (archaic)"],"pinyin":["zhuan3 shen1"],"word":"轉身"},{"definition":["to sit down"],"pinyin":["zuo4 xia5"],"word":"坐下"},{"definition":["to turn one's head\/to turn around"],"pinyin":["niu3 tou2"],"word":"扭頭"},{"definition":["nutation (plants turning to face the sun)","to turn one's head\/to change direction\/U-turn\/volte face\/to repent"],"pinyin":["zhuan3 tou2","zhuan4 tou2"],"word":"轉頭"},{"definition":["to hurry\/to hasten\/to make haste"],"pinyin":["gan3 mang2"],"word":"趕忙"},{"definition":["promptly\/at once"],"pinyin":["lian2 mang2"],"word":"連忙"},{"definition":["hastily"],"pinyin":["ji2 mang2"],"word":"急忙"},{"definition":["to say goodbye\/to take one's leave"],"pinyin":["gao4 ci2"],"word":"告辭"},{"definition":["in a great rush\/in a flurry"],"pinyin":["huang1 mang2"],"word":"慌忙"},{"definition":["to stoop"],"pinyin":["wan1 yao1"],"word":"彎腰"},{"definition":["to wave (one's hand)"],"pinyin":["hui1 shou3"],"word":"揮手"},{"definition":["to leave\/to walk away\/to beat it\/to move aside"],"pinyin":["zou3 kai1"],"word":"走開"},{"definition":["to be just about to\/to be on the point of"],"pinyin":["zheng4 yao4"],"word":"正要"},{"definition":["quick step"],"pinyin":["kuai4 bu4"],"word":"快步"}]}