{"definition":["starting point"],"pinyin":["qi3 dian3"],"simplified":["起点"],"rank":5101.0,"normalized_rank":0.07136960810375946,"fraction":0.00002341349755001216,"cumulative_fraction":0.8613402400393599,"word":"起點","characters":[{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[{"definition":["starting line"],"pinyin":["qi3 dian3 xian4"],"word":"起點線"},{"definition":["from zero\/from scratch\/beginners' (course)\/for beginners"],"pinyin":["ling2 qi3 dian3"],"word":"零起點"}],"sentences":[{"english":"The 2.6.25 implementation will need to walk the retransmission queue from the start in order to find this data.","chinese":"的實現需要從起點遍歷重傳隊列以便找到數據。"},{"english":"China meet a pivotal time now. It's a new jumping-off point of history.","chinese":"現在中國正處在這樣一個關鍵時刻，歷史的新起點。"},{"english":"What meaning is warning is first question of regional forest resources early warning.","chinese":"明確警義是區域森林資源預警的起點。"},{"english":"Today, our relations stand at a new starting point in history.","chinese":"楊潔篪最後說，中印關係正站在一個新的歷史起點上。"},{"english":"Basically it lasts until it's gone full circle and has been returned back to the temple where it started.","chinese":"大致上，它要走完整個路程，回到作爲起點的佛牙寺。"},{"english":"The great railway lines of England all start from London.","chinese":"英國的鐵路幹線都以倫敦爲起點。"},{"english":"Such debacles usually start, Edward has found, with a compelling growth story.","chinese":"錢塞勒發現，此類崩潰通常以引人注目的增長爲起點。"},{"english":"The Chinese premier also expressed the hope that the 60th anniversary of the establishment of the Sino-Indian diplomatic ties would become a new starting point for the development of the relations.","chinese":"我希望中印建交60週年成爲雙邊關係發展的新起點。"},{"english":"Click and drag from the start to end-point that you wish to measure.","chinese":"點擊後從起點拖到終點來進行測量。"},{"english":"Be sure you put your feet in the right place, then stand firm.","chinese":"確認你的起點無慮，然後站穩腳步。"},{"english":"Let this be your starting point to take what I have written about and apply it to your own forms.","chinese":"就讓這裏成爲你學以致用的起點吧。"},{"english":"When running outdoors, you have to get back to your start destination somehow!","chinese":"戶外跑的時候，無論如何你必須回到你的起點。"},{"english":"The VC & PE Tower start a fresh new starting point to the architectural design industry of Shenzhen.","chinese":"創業投資大廈賦予了深圳建築新的起點。"},{"english":"I was the sinfonia of new century 2001, brave is a new start.","chinese":"2001年i是新世紀的序曲，勇是一個新的起點。"},{"english":"Their starting rotation is the strongest in baseball.","chinese":"他們的起點輪替是棒球史上最強的。"},{"english":"It began with the planting of ten to twelve beehives in the town.","chinese":"這個項目以該鎮的十到十二個蜂箱爲起點。"}],"related":[{"definition":["the end\/end point\/finishing line (in a race)\/destination\/terminus\/CL:個|个[ge4]"],"pinyin":["zhong1 dian3"],"word":"終點"},{"definition":["opportunity\/turning point\/juncture"],"pinyin":["qi4 ji1"],"word":"契機"},{"definition":["path\/route\/method\/ways and means"],"pinyin":["lu4 jing4"],"word":"路徑"},{"definition":["stage\/section\/phase\/period\/CL:個|个[ge4]"],"pinyin":["jie1 duan4"],"word":"階段"},{"definition":["area\/region\/district"],"pinyin":["qu1 yu4"],"word":"區域"},{"definition":["way\/channel"],"pinyin":["tu2 jing4"],"word":"途徑"},{"definition":["start\/beginning"],"pinyin":["kai1 duan1"],"word":"開端"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引領"},{"definition":["to open\/to start\/(computing) to enable"],"pinyin":["kai1 qi3"],"word":"開啟"},{"definition":["here"],"pinyin":["zhe4 li3"],"word":"這裡"},{"definition":["node"],"pinyin":["jie2 dian3"],"word":"節點"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"},{"definition":["from\/through\/via\/to follow\/to obey\/to engage in (an activity)\/never (in negative sentence)\/(Taiwan pr. [zong4]) retainer\/assistant\/auxiliary\/subordinate\/related by common paternal grandfather or earlier ancestor","surname Cong"],"pinyin":["Cong2","cong2"],"word":"從"},{"definition":["the next one"],"pinyin":["xia4 yi1 ge5"],"word":"下一個"},{"definition":["area\/region\/district\/small\/distinguish\/CL:個|个[ge4]","surname Ou"],"pinyin":["Ou1","qu1"],"word":"區"},{"definition":["(fig.) to dream of\/dream"],"pinyin":["meng4 xiang3"],"word":"夢想"}]}