{"definition":["lit. the more you touch things up, the darker they get\/fig. to only make matters worse"],"pinyin":["yue4 miao2 yue4 hei1"],"simplified":["越描越黑"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"越描越黑","characters":[{"definition":["generic word for peoples or states of south China or south Asia at different historical periods\/abbr. for Vietnam 越南","to exceed\/to climb over\/to surpass\/the more... the more"],"pinyin":["Yue4","yue4"],"word":"越"},{"definition":["to depict\/to trace (a drawing)\/to copy\/to touch up"],"pinyin":["miao2"],"word":"描"},{"definition":["generic word for peoples or states of south China or south Asia at different historical periods\/abbr. for Vietnam 越南","to exceed\/to climb over\/to surpass\/the more... the more"],"pinyin":["Yue4","yue4"],"word":"越"},{"definition":["abbr. for Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1]","black\/dark\/sinister\/secret\/shady\/illegal\/to hide (sth) away\/to vilify\/(loanword) to hack (computing)"],"pinyin":["Hei1","hei1"],"word":"黑"}],"containing_words":[],"sentences":[{"english":"Her awkward attempt to explain her error merely added insult to injury.","chinese":"她笨拙地企圖解釋所犯的錯誤，結果只是越描越黑。"},{"english":"Introverted boss immediately tense up, quickly explained, but the more black.","chinese":"內向的老闆馬上緊張起來，趕緊解釋，卻越描越黑。"},{"english":"Her awkward attempt to tell her error merely added insult to injury.","chinese":"她笨拙地企圖解析所犯的錯誤，結果只是越描越黑。"},{"english":"She woodenly attempted to explain her mistake, but it was just adding insult to injury.","chinese":"她笨拙地企圖解釋所犯的錯誤，結果只是越描越黑。"}],"related":[{"definition":["lit. 300 silver taels not hidden here (idiom); fig. to reveal what one intends to hide"],"pinyin":["ci3 di4 wu2 yin2 san1 bai3 liang3"],"word":"此地無銀三百兩"},{"definition":["trying to hide it makes it more conspicuous (idiom); A cover up only makes matters worse."],"pinyin":["yu4 gai4 mi2 zhang1"],"word":"欲蓋彌彰"},{"definition":["to offer an explanation\/to plead innocence\/to try to defend oneself"],"pinyin":["bian4 bai2"],"word":"辯白"},{"definition":["to crush one's own foot while trying to maneuver a rock (to a cliff edge, to drop on one's enemy) (idiom)\/hoisted by one's own petard"],"pinyin":["ban1 qi3 shi2 tou5 za2 zi4 ji3 de5 jiao3"],"word":"搬起石頭砸自己的腳"},{"definition":["to confess without being pressed\/to make a confession without duress"],"pinyin":["bu4 da3 zi4 zhao1"],"word":"不打自招"},{"definition":["to twist words and force logic (idiom)\/sophistry\/loud rhetoric making up for fallacious argument\/shoving false arguments down people's throats"],"pinyin":["qiang3 ci2 duo2 li3"],"word":"強詞奪理"},{"definition":["even an honest and upright official will have difficulty resolving a family dispute (proverb)"],"pinyin":["qing1 guan1 nan2 duan4 jia1 wu4 shi4"],"word":"清官難斷家務事"},{"definition":["in the wrong"],"pinyin":["li3 kui1"],"word":"理虧"},{"definition":["to patch up one's lie (when inconsistencies appear)\/to cover (for sb who has lied)"],"pinyin":["yuan2 huang3"],"word":"圓謊"},{"definition":["to invite a snub\/to court a rebuff"],"pinyin":["zi4 tao3 mei2 qu4"],"word":"自討沒趣"},{"definition":["lit. public opinion is powerful enough to melt metal (idiom)\/fig. public clamor can obscure the actual truth\/mass spreading of rumors can confuse right and wrong"],"pinyin":["zhong4 kou3 shuo4 jin1"],"word":"眾口鑠金"},{"definition":["to say a matter has no relationship with the individual referred to, to emphasise one is innocent or in the clear"],"pinyin":["pie3 qing1"],"word":"撇清"},{"definition":["to exculpate\/to absolve\/to exonerate"],"pinyin":["kai1 tuo1"],"word":"開脫"},{"definition":["three men talking makes a tiger (idiom); repeated rumor becomes a fact"],"pinyin":["san1 ren2 cheng2 hu3"],"word":"三人成虎"},{"definition":["to lie through one's teeth (idiom)\/to talk drivel"],"pinyin":["zheng1 yan3 shuo1 xia1 hua4"],"word":"睜眼說瞎話"},{"definition":["to dispute\/to refute"],"pinyin":["bian4 bo2"],"word":"辯駁"}]}