{"definition":["to rush over"],"pinyin":["gan3 lai2"],"simplified":["赶来"],"rank":4929.0,"normalized_rank":0.06896310494872189,"fraction":0.00002456175756290812,"cumulative_fraction":0.8572180340357924,"word":"趕來","characters":[{"definition":["to overtake\/to catch up with\/to hurry\/to rush\/to try to catch (the bus etc)\/to drive (cattle etc) forward\/to drive (sb) away\/to avail oneself of (an opportunity)\/until"],"pinyin":["gan3"],"word":"趕"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"}],"containing_words":[],"sentences":[{"english":"Shi Xiang summer Guanci apprehend came to see two people is exhausted.","chinese":"緝拿施襄夏的官差趕來，看到是精疲力竭的倆人。"},{"english":"Chen's three sisters and his niece came for the ceremony from Huitong county in Hunan province.","chinese":"陳聚志的三個姐姐和侄女特意從湖南會同縣趕來。"},{"english":"And I want to thank all of you for braving the cold and the crowds and traveling in some cases thousands of miles to join us here today.","chinese":"我要感謝冒着嚴寒千里迢迢趕來的人們。"},{"english":"The Haitian a line of people came to quite, Haitian dad have come here to reunite with sea.","chinese":"海天一行人終於到了蜀地，海天爹也趕來與海天團聚。"},{"english":"Cao Cao's army harried his rear guard.","chinese":"袁紹退軍急回，背後曹軍趕來。"},{"english":"Can you come quickly?","chinese":"你能儘快趕來嗎？"},{"english":"When Han arrived, there is no pot of rice.","chinese":"當韓信趕來，鍋裏已經沒有飯了。"},{"english":"The next day a Verd drove up, and created the sentence.","chinese":"次日，一位動詞駕車趕來，創造了句子。"},{"english":"He always comes rushing up at the last moment.","chinese":"他往往到最後的一瞬間才急忙趕來。"},{"english":"Several members of a winter swimming team nearby came to help.","chinese":"附近的冬泳隊趕來幫助他們。"},{"english":"Critical moment, Zhou Siwei rescue, give gold stupa ACTS as the interpreter.","chinese":"關鍵時刻，周斯韋趕來救場，給金多寶充當翻譯。"},{"english":"WenDaoHe sword male is heard at this time, and have brought wine.","chinese":"聞道和劍雄此時也聞聲趕來，並帶來了美酒。"},{"english":"People came from far and near to hear the famous violinist.","chinese":"人們從肆面捌方趕來聽這位著名小提琴家的演奏。"},{"english":"Journalists and hundreds of consumers came to see what the story was behind the flag.","chinese":"記者和許多的消費者趕來想了解這面旗子背後的故事。"},{"english":"I came from afar, because I have a problem with my son.","chinese":"我長途趕來，因爲我兒子有個問題。"},{"english":"Then officer Orangutang and the Policeman dog came quickly.","chinese":"小貓立即報了案，猩猩警官和狗警察很快就趕來了。"}],"related":[]}