{"definition":["to hurry to (somewhere)"],"pinyin":["gan3 wang3"],"simplified":["赶往"],"rank":6369.0,"normalized_rank":0.08911057322345503,"fraction":0.000016980263534206813,"cumulative_fraction":0.8865354108747153,"word":"趕往","characters":[{"definition":["to overtake\/to catch up with\/to hurry\/to rush\/to try to catch (the bus etc)\/to drive (cattle etc) forward\/to drive (sb) away\/to avail oneself of (an opportunity)\/until"],"pinyin":["gan3"],"word":"趕"},{"definition":["to go (in a direction)\/to\/towards\/(of a train) bound for\/past\/previous"],"pinyin":["wang3"],"word":"往"}],"containing_words":[],"sentences":[{"english":"The officer, who refused to give his name, said Fang was on his way to the airport.","chinese":"該不願透露姓名的警察表明方濱興正在趕往機場。"},{"english":"Rescue workers rushed to the site.","chinese":"營救人員趕往雪崩地點。"},{"english":"So I made the four-hour trip from Zaragoza to Madrid.","chinese":"於是我花了四個小時從薩拉戈薩趕往馬德里。"},{"english":"Hu Xuebing is on his way to the county town. He needs to sell his tofu at the morning market.","chinese":"胡學兵正趕往縣城，他要在早市上賣掉今天的豆腐。"},{"english":"China's railway minister, Sheng Guangzu, was reported to have rushed to the scene.","chinese":"據報道，中國鐵道部部長盛光祖已經火速趕往現場。"},{"english":"Of passengers breakfast, Xing-ice has led the passengers rushed to the airport.","chinese":"安排旅客喫完早餐，陳星冰又帶領旅客趕往機場。"},{"english":"I rushed to the squadron fire officers and soldiers rushed to the scene and started a fire fight.","chinese":"我中隊消防官兵火速趕往現場並展開了火災撲救。"},{"english":"Allow that concise crash, and immediately rushed to the hospital.","chinese":"允兒得悉簡潔撞車，立即趕往醫院。"},{"english":"After getting away from pursuing troops, I fast rush via into Wu to go properly main cool Lun location.","chinese":"擺脫追兵後，我迅速的趕往亡靈法師酷倫處。"},{"english":"When he set out for the market he forgot to bring it along.","chinese":"可當他趕往市集時，卻忘了帶量好的尺碼。"},{"english":"Chen Zuo’er and division chief Zhang hurried to Beijing Capital Airport in the same day afternoon to meet Li and Xu.","chinese":"陳佐洱和張處長於當日下午趕往首都機場迎接。"},{"english":"But Jimmy, they are driving round to the house now as we speak.","chinese":"但我們說話這會他們肯定正驅車趕往我們家。"},{"english":"I land at 8.00 pm and head back home.","chinese":"晚上8點飛機降落後，我趕往家裏。"},{"english":"There was an air of amusement as they approached the playground, which was afraid with banderole and balloons.","chinese":"趕往掛滿了彩旗和氣球的操場時，有一種節日的氣氛。"},{"english":"Instantly he repented his life, put on his clothes in a hurry and rushed to the temple.","chinese":"他忽然深深懺悔，披衣而起，快馬加鞭，趕往寺裏。"},{"english":"The people rushed to cloud empty master xia town.","chinese":"衆人趕往雲空大師所在的霞流鎮。"}],"related":[]}