{"definition":["to hurry\/to hasten\/to make haste"],"pinyin":["gan3 mang2"],"simplified":["赶忙"],"rank":16271.0,"normalized_rank":0.2276524002070712,"fraction":0.0000035669633123713128,"cumulative_fraction":0.9639205533740044,"word":"趕忙","characters":[{"definition":["to overtake\/to catch up with\/to hurry\/to rush\/to try to catch (the bus etc)\/to drive (cattle etc) forward\/to drive (sb) away\/to avail oneself of (an opportunity)\/until"],"pinyin":["gan3"],"word":"趕"},{"definition":["busy\/hurriedly\/to hurry\/to rush"],"pinyin":["mang2"],"word":"忙"}],"containing_words":[],"sentences":[{"english":"The driver hastens next handlebar grandpa uprear, apologize again and again.","chinese":"司機趕忙下車把老大爺扶起，並連連道歉。"},{"english":"You walk hurriedly walk, don't turn around, don't with my tears flow.","chinese":"你要走就趕忙走，別轉頭，別對着我淚流。"},{"english":"Shu ping and show jade notice hurried back to the village to hide the men in the village.","chinese":"淑萍和秀玉趕忙回村通知村裏的男人躲起來。"},{"english":"The SuiYuMa quickly on a cup of warm boiled water.","chinese":"隋玉媽趕忙端上一杯溫開水。"},{"english":"The boat came close to the rocks and then sneered away.","chinese":"那條船接近了礁石，於是趕忙駛開。"},{"english":"She hastened to explain the situation.","chinese":"她趕忙解釋這個情況。"},{"english":"After a complete end pock basically useless, so quickly.","chinese":"痘疤完整結好後基本上就沒用了，所以要趕忙。"},{"english":"So, I pay attention to take advantage of the hen, hastens to the sleeves rolled up.","chinese":"於是，我趁母雞不注意，趕忙把袖子挽上去。"},{"english":"Jaimie hurried to get some milk.","chinese":"傑米趕忙去弄點牛奶。"},{"english":"Space mulberry road the second diplomatic corps chief quickly make a noise to say.","chinese":"格桑路亞的使節團團長趕忙出聲說道。"},{"english":"Two month later, Jacob hardly finished his work when he hastened home.","chinese":"兩個月後，傑可伯剛一完成工作，就趕忙回家去。"},{"english":"I hurry shin over a rock to get a look of the Shin.","chinese":"本人爲了看信樂團而趕忙地躍過一個石頭。"},{"english":"She was scared, searched the right symptom of tuberculin test on line in a hurry.","chinese":"害怕，趕忙在網上搜索結核菌素測試的正常症狀。"},{"english":"The hen see product such as can't swim, quickly jumped into the water to save product such as.","chinese":"世賢見品如不會游泳，趕忙跳入水中去救品如。"},{"english":"Camp left quickly orders the arrest reactive nakamura.","chinese":"營左趕忙命人抓捕中村功。"},{"english":"Special listened to in a hurry to see WenXue.","chinese":"特殊聽了趕忙去看溫雪。"}],"related":[]}