{"definition":["as soon as possible\/at the first opportunity\/the sooner the better\/before it's too late"],"pinyin":["gan3 zao3"],"simplified":["赶早"],"rank":40137.0,"normalized_rank":0.5615687042659466,"fraction":3.8041769560219523e-7,"cumulative_fraction":0.9965411312226121,"word":"趕早","characters":[{"definition":["to overtake\/to catch up with\/to hurry\/to rush\/to try to catch (the bus etc)\/to drive (cattle etc) forward\/to drive (sb) away\/to avail oneself of (an opportunity)\/until"],"pinyin":["gan3"],"word":"趕"},{"definition":["early\/morning\/Good morning!\/long ago\/prematurely"],"pinyin":["zao3"],"word":"早"}],"containing_words":[],"sentences":[{"english":"They arrived early in order that they might get a good seat.","chinese":"他們趕早而來以便能有個好座位。"},{"english":"We were planning on just having a snack and catching the early train.","chinese":"我們打算喫份快餐然後去趕早班火車。"},{"english":"Early flight to Nanchang so no time to worry about jet lag.","chinese":"趕早班飛機來南昌，沒時間擔心時差了。"},{"english":"Is there any hope of catching the early flight?","chinese":"趕早班飛機還有希望嗎？"},{"english":"I got up early this morning in order to catch the early train.","chinese":"爲了趕早車，今天早晨我起牀很早。"},{"english":"Eg. We left early so that we could catch the first train.","chinese":"爲了趕早班火車，我們走得很早。"},{"english":"I intended to catch the early train, but I didn't get up in time.","chinese":"我本來打算趕早班的火車，但是我起晚了。"},{"english":"Since last week, many people have gone there to taste the pot earlier than the mass.","chinese":"而上週開始，羊鍋村裏已有不少趕早嚐鮮的食客。"},{"english":"The hour was his (real) girlfriend's self-imposed curfew, since she had to get up early for school.","chinese":"這個時間是H的女朋友因爲要趕早上課而自行的宵禁。"},{"english":"Hurry up and clear out a couple of rooms where they can rest.","chinese":"你們趕早打掃兩間屋子叫他們歇歇兒去。"}],"related":[]}