{"definition":["to drive out\/to turn back"],"pinyin":["gan3 zou3"],"simplified":["赶走"],"rank":17484.0,"normalized_rank":0.2446238439690513,"fraction":0.0000031071337877562265,"cumulative_fraction":0.9679650087739528,"word":"趕走","characters":[{"definition":["to overtake\/to catch up with\/to hurry\/to rush\/to try to catch (the bus etc)\/to drive (cattle etc) forward\/to drive (sb) away\/to avail oneself of (an opportunity)\/until"],"pinyin":["gan3"],"word":"趕"},{"definition":["to walk\/to go\/to run\/to move (of vehicle)\/to visit\/to leave\/to go away\/to die (euph.)\/from\/through\/away (in compound verbs, such as 撤走[che4 zou3])\/to change (shape, form, meaning)"],"pinyin":["zou3"],"word":"走"}],"containing_words":[],"sentences":[{"english":"Going into the tana away, west mother forbade it, get rid of him.","chinese":"塔納要闖進去帶走帕萊，西瓦母親不允，趕走了他。"},{"english":"Brown tried all ways to get rid of Steelman, but he couldn't do it.","chinese":"布朗用盡一切辦法想趕走斯蒂爾曼，但都沒成功。"},{"english":"Abruptly he Sat. upright in his chair and, with an effort of will, expunged his downcast mood.","chinese":"突然，他在椅子上直起身來，努力趕走沮喪的情緒。"},{"english":"Why alienate half of your potential investors?","chinese":"爲什麼要趕走一半的潛在投資者呢？"},{"english":"The National Socialists ousted him from his position as mayor of the city of Cologne.","chinese":"國家社會主義黨把他從科龍市長的地位趕走。"},{"english":"Some kinds of animals can whisk flies away with their tails.","chinese":"某些動物會用它們的尾巴趕走蒼蠅。"},{"english":"Night after night, however, I was woken up and told to move along by security guards or the police.","chinese":"但夜復一夜，我還是數次被保安或警察叫醒並趕走。"},{"english":"The insurgents blow up railway tracks, seize land and chase away forest guards.","chinese":"起義者炸燬了鐵軌，奪去了土地，趕走了森林警衛。"},{"english":"It’s St Peter’s, whom your fathers chased away.","chinese":"這城池是聖彼得的，你們的父輩將他從這裏趕走。"},{"english":"The police moved the crowd on before it could get big enough to threat law and order.","chinese":"警察趕走了人羣，以防聚集太多而滋生事端。"},{"english":"Small grand drives away Xiao Ya instantly, live together with big house rise.","chinese":"小浩立即趕走肖雅，與大宇同居起來。"},{"english":"We shooed them away and went back to bed.","chinese":"我們將它們趕走後，就回去睡覺了。"},{"english":"The room into what he said no evidence, but also called security out of show.","chinese":"房成卻說何秀沒有證據，還叫來了保安趕走何秀。"},{"english":"You’d wear daisies in your hair and I’d chase away the hornets.","chinese":"你在頭上插滿雛菊，我趕走大黃蜂。"},{"english":"How did you drive him away?","chinese":"您是如何將他趕走的？"},{"english":"The landlady turned out a tenant for not paying the rent .","chinese":"女房東趕走了一名不交房租的房客。"}],"related":[{"definition":["to carry\/to take away"],"pinyin":["dai4 zou3"],"word":"帶走"},{"definition":["to kill"],"pinyin":["sha1 si3"],"word":"殺死"},{"definition":["to handle\/to deal with\/to cope\/to get by with"],"pinyin":["dui4 fu5"],"word":"對付"},{"definition":["to persuade\/to convince\/to talk sb over\/Taiwan pr. [shui4 fu2]"],"pinyin":["shuo1 fu2"],"word":"說服"},{"definition":["to seize an opportunity\/to take advantage of situation"],"pinyin":["chen4 ji1"],"word":"趁機"},{"definition":["to let off\/to let slip by\/to let sb get away with sth"],"pinyin":["fang4 guo4"],"word":"放過"},{"definition":["to placate\/to pacify\/to appease"],"pinyin":["an1 fu3"],"word":"安撫"},{"definition":["to put an end to\/to annihilate\/to cause to perish\/to perish\/annihilation (in quantum field theory)"],"pinyin":["xiao1 mie4"],"word":"消滅"},{"definition":["to surround\/to encircle\/to hem in"],"pinyin":["bao1 wei2"],"word":"包圍"},{"definition":["at once\/immediately\/promptly\/swiftly"],"pinyin":["li4 ma3"],"word":"立馬"},{"definition":["to persuade\/persuasion\/to advise"],"pinyin":["quan4 shuo1"],"word":"勸說"},{"definition":["to push open (a gate etc)\/to push away\/to reject\/to decline"],"pinyin":["tui1 kai1"],"word":"推開"},{"definition":["thorough\/thoroughly\/complete"],"pinyin":["che4 di3"],"word":"徹底"},{"definition":["to stay out of (hot water, trouble, awkward situation etc)\/to avoid (sb)"],"pinyin":["duo3 kai1"],"word":"躲開"},{"definition":["to stop\/to obstruct"],"pinyin":["zu3 lan2"],"word":"阻攔"},{"definition":["to answer\/to respond\/to answer positively\/to agree\/to accept\/to promise"],"pinyin":["da1 ying5"],"word":"答應"}]}