{"definition":["to hurry\/to rush"],"pinyin":["gan3 fu4"],"simplified":["赶赴"],"rank":5939.0,"normalized_rank":0.08309431533586109,"fraction":0.000018817245990637365,"cumulative_fraction":0.8788544711934687,"word":"趕赴","characters":[{"definition":["to overtake\/to catch up with\/to hurry\/to rush\/to try to catch (the bus etc)\/to drive (cattle etc) forward\/to drive (sb) away\/to avail oneself of (an opportunity)\/until"],"pinyin":["gan3"],"word":"趕"},{"definition":["to go\/to visit (e.g. another country)\/to attend (a banquet etc)"],"pinyin":["fu4"],"word":"赴"}],"containing_words":[],"sentences":[{"english":"Police then rushed to the scene to sort out the horse and Luo Tuoqing meeting place.","chinese":"警方隨後趕赴現場將馬和駱駝清理出集會場所。"},{"english":"Who gave me the name of May, to go forward with great strength and vigour of a ceramic rhyme?","chinese":"是誰賦予我五月的名義，趕赴一場浩浩蕩蕩的瓷韻？"},{"english":"Journalists who were tipped off about the incident raced to the scene.","chinese":"事先聽到有關此事風聲的新聞記者爭先恐後趕赴現場。"},{"english":"Hundreds of troops have been dispatched to the region to assist in the effort.","chinese":"數以百計的軍隊已經趕赴災區，幫助救援工作。"},{"english":"International disaster relief teams have been sent to Japan.","chinese":"國際災難救援隊伍也已經趕赴日本。"},{"english":"Reporters rushed to the scene, the balcony windows billowing smoke wafting account.","chinese":"記者趕赴現場發現，陽臺窗戶口飄出滾滾黑煙。"},{"english":"Currently, rescue workers rushed to the scene.","chinese":"目前，救援人員已趕赴現場。"},{"english":"Invitation of the Government of Mexico, Chile, support search and rescue experts to the scene.","chinese":"應墨西哥政府邀請，智利專家趕赴現場支援搜救。"},{"english":"Senior provincial officials were assigned to direct rescue operations on site.","chinese":"江西省高層官員趕赴現場指揮搶救。"},{"english":"Prime Minister Recep Tayyip Erdogan has been canceled earth day itinerary, will be rushed to the disaster area.","chinese":"土總理埃爾多安已取消當天的預定行程，將趕赴災區。"},{"english":"But other Turks have reached out to the quake-stricken area.","chinese":"但是，有的土耳其人還是趕赴災區。"},{"english":"If the doctor had come in time, Bmy would still be alive.","chinese":"如果大夫實時趕赴艾米此刻還會在世。"},{"english":"Hu Xiadong, deputy minister of railways, is heading to the scene for rescue work.","chinese":"鐵道部副部長鬍亞東正趕赴現場，指導救援工作。"},{"english":"Guo Gengmao, the provincial governor has gone to the mine to take charge of the rescue operation.","chinese":"河南省省長郭庚茂已趕赴現場指揮搶險救援。"},{"english":"The 110 command center sent policemen to the site as soon as they received the crime report.","chinese":"指揮台接警後立刻派民警趕赴出事地點。"}],"related":[]}