{"definition":["to tend towards"],"pinyin":["qu1 yu2"],"simplified":["趋于"],"rank":6571.0,"normalized_rank":0.09193681530088284,"fraction":0.000016206874067092295,"cumulative_fraction":0.8898881810692137,"word":"趨於","characters":[{"definition":["to hasten\/to hurry\/to walk fast\/to approach\/to tend towards\/to converge"],"pinyin":["qu1"],"word":"趨"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[],"sentences":[{"english":"You need be for balance and contrast, for prayer and inner peace","chinese":"你需我來趨於衡平，尋求對照，潛心祝禱，舒緩內心。"},{"english":"And then it stabilized and has remained at this level.","chinese":"然後趨於平穩，並一直維持在這一水平上。"},{"english":"After listening the Buddhist music, the pains and troubles disappear and the heart regains the equanimity.","chinese":"佛教音樂使人聽聞之下煩惱頓消，內心趨於平靜。"},{"english":"After the tillering stage the biomass 15N tended towards stable.","chinese":"在分櫱期以後微生物固持態15N的變化趨於穩定。"},{"english":"It is usually added that understanding must not go too far.","chinese":"再則，也常有人說，理智不可太趨於極端。"},{"english":"By late liberation war, the conditions for multi-party cooperation toward maturity.","chinese":"到了解放戰爭後期，多黨合作的條件趨於成熟。"},{"english":"Is the vessel in any immediate danger of sinking or capsizing ?","chinese":"船是否有趨於沉沒或傾覆的危險。"},{"english":"Valuations go down. Things equalize.","chinese":"風險估值走低，事情趨於平衡。"},{"english":"Further income elasticities tend to be stable over time.","chinese":"久而久之，以後的收入彈性將趨於穩定。"},{"english":"In general, any region in the visual field tends to induce its complementary color in neighboring areas.","chinese":"通常情況下，任何視覺區域都會趨於臨域的補色。"},{"english":"The environment and functions of Momoge wetland go worsen.","chinese":"可見莫莫格溼地的生態環境及功能趨於惡化。"},{"english":"As the government of the South Sung Dynasty stabilized, the bowmen were removed during the 4th year of Shaoxing.","chinese":"隨著南宋政權趨於穩定，紹興四年高宗罷廢新置弓手。"},{"english":"The US financial markets are also stabilizing with positive signs in its economy.","chinese":"美國金融市場趨於穩定，經濟運行出現一些積極跡象。"},{"english":"The volume condenses in the beginning, then dilates, and finally comes to the steady state.","chinese":"試體之體積先產生壓縮，然後膨脹，最後亦趨於穩定。"},{"english":"The crisis trends toward a reconciliation.","chinese":"這場危機趨於和解。"},{"english":"It is shown that the proper acceleration of null geodesic with conjugate points approaches infinity.","chinese":"具有共軛點的類光測地線的固有加速度趨於無窮大。"}],"related":[]}