{"definition":["to fall into\/to dip below a certain level"],"pinyin":["die1 jin4"],"simplified":["跌进"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"跌進","characters":[{"definition":["to fall\/to tumble\/to trip\/(of prices etc) to drop\/Taiwan pr. [die2]"],"pinyin":["die1"],"word":"跌"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[],"sentences":[{"english":"Such had been his first dip into the dark abysses of existence.","chinese":"他第一次跌進人生黑暗深淵的情形就是這樣。"},{"english":"He who digs a pit for others, falls in himself.","chinese":"想坑別人的人，跌進自己掘得陷阱裏。"},{"english":"With a heavy noise, she fell into the pit.","chinese":"隨着一聲悶響，她跌進了坑裏。"},{"english":"The fox fell into the trap and couldn't climb out of it.","chinese":"狐狸跌進陷阱自己爬不出來了。"},{"english":"Though you've slipped through death'sslim door.","chinese":"雖然你跌進了死亡的小門。"},{"english":"I am myself fallen unawares into the snares of death.","chinese":"我自己不知不覺跌進了死神的陷阱。"},{"english":"The pup was in a fix when he walked into the mudhole.","chinese":"小狗跌進泥坑便爬不出來了。"},{"english":"Falling into the blue bridge of hometown.","chinese":"跌進故鄉的藍橋。"},{"english":"But then Clifford lost his balance! He tumbled into the tub of dye.","chinese":"但是克利福德身體一下子失去了平衡，跌進了染缸裏。"},{"english":"At this moment, the slight bow-shaped moon fell into the valley opposite.","chinese":"這時候，那彎淺淺月跌進了河對面的山坳。"},{"english":"With hundreds of questions, my memory falled into the swirl of remembering.","chinese":"夾搭着一連串的疑問，我的思緒跌進了回憶的漩渦。"},{"english":"While playing by the river, one child slipped and fell in .","chinese":"一個孩子在河邊嬉戲時滑了一跤跌進了河裏。"},{"english":"How did we fall into such great invisibility within the Tao?","chinese":"我們是怎麼跌進道內這場巨大的消隱無蹤的？"},{"english":"I tripped and fell into a manhole","chinese":"我給絆了一下，跌進了一個窨井。"},{"english":"Then the little louse fell in and burnt herself.","chinese":"小蝨子跌進蛋殼，燒傷了自己。"},{"english":"They fell into the seething waters of the rapids.","chinese":"他們跌進了翻騰的急流中。"}],"related":[]}