{"definition":["to scamper\/to run around"],"pinyin":["pao3 lai2 pao3 qu4"],"simplified":["跑来跑去"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"跑來跑去","characters":[{"definition":["(of an animal) to paw (the ground)","to run\/to run away\/to escape\/to run around (on errands etc)\/(of a gas or liquid) to leak or evaporate\/(verb complement) away\/off"],"pinyin":["pao2","pao3"],"word":"跑"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["(of an animal) to paw (the ground)","to run\/to run away\/to escape\/to run around (on errands etc)\/(of a gas or liquid) to leak or evaporate\/(verb complement) away\/off"],"pinyin":["pao2","pao3"],"word":"跑"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"They love to run about on the beach.","chinese":"他們喜歡在海灘上跑來跑去。"},{"english":"That child flits about like a wraith.","chinese":"那個孩子像幽靈一樣飛快地跑來跑去。"},{"english":"As soon as the alarm went, the crew raced around shutting the watertight doors.","chinese":"警報一響，船員們跑來跑去把船上的水密門關緊。"},{"english":"A brace of tame deer ran familiarly about the house.","chinese":"一對馴鹿無拘無束地在室內跑來跑去。"},{"english":"I would rather hoe in the garden than run on the playground.","chinese":"我寧願在花園裏鋤草，不願在運動場上跑來跑去。"},{"english":"Don't chase about any more and sit down quickly.","chinese":"別再跑來跑去了，趕快坐下來。"},{"english":"As soon as the alarm went, the crew raced about shouting the watertight doors.","chinese":"警報一響，船員們跑來跑去把船上的水密門關緊。"},{"english":"I would rather hoe in the garden than run about on the playground.","chinese":"我寧願在花園裏鋤草，不願在運動場上跑來跑去。"},{"english":"She raced about the house to get her work done.","chinese":"她在屋裏跑來跑去要把自己的工作搞完。"},{"english":"Toddlers like to run around the house bare naked .","chinese":"剛會走路的孩子喜歡光着腳在房子周圍跑來跑去。"},{"english":"The other people all in to have a meal, but xiaoyan run to give everybody end dish.","chinese":"別人都在喫飯，唯獨曉燕跑來跑去給大家端菜。"},{"english":"In primitive times man went without clothing.","chinese":"在原始時代人光着身子跑來跑去。"},{"english":"Don't crash about upstairs while I'm working.","chinese":"我工作時，別在樓上咚咚地跑來跑去。"},{"english":"A lot of students enjoy running around the playground during their break time.","chinese":"很多學生喜歡在下課休息時間，在操場上跑來跑去。"},{"english":"The company commander was running around and shouting that we should dig like crazy.","chinese":"連長跑來跑去，喊着讓我們玩命地挖戰壕。"},{"english":"They rushed about helter-skelter collecting dung and carrying earth.","chinese":"他們忙慌亂亂地跑來跑去拾糞擔土。"}],"related":[]}