{"definition":["to surmount\/to cross over"],"pinyin":["kua4 guo4"],"simplified":["跨过"],"rank":15978.0,"normalized_rank":0.22355295006505954,"fraction":0.0000036838913914877197,"cumulative_fraction":0.9628591046500492,"word":"跨過","characters":[{"definition":["to step across\/to stride over\/to straddle\/to span"],"pinyin":["kua4"],"word":"跨"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"}],"containing_words":[],"sentences":[{"english":"They passed the dry bed of a rivulet.","chinese":"他們跨過了一道乾涸的河牀。"},{"english":"It appears as a dusty, cloud-line across the sky.","chinese":"跨過夜空眼前是一條星星點點雲霧線。"},{"english":"After I crossed the threshold of the conference hall, I collapsed in the university hallway.","chinese":"跨過會議廳的門檻後，我就倒在了大學的走廊裏。"},{"english":"Is there some set-point which when crossed unleashes the evil?","chinese":"有沒有一個臨界點，當它被跨過之後就會釋放出邪惡？"},{"english":"The water ran down the street and crossed another street.","chinese":"水沿着街道一直衝下去，還跨過了另外一條街。"},{"english":"She opened the door, stepped over the lintel, and on to the damp, cold earth of the passage outside.","chinese":"她打開門，跨過門檻，踩到過廳潮溼的冰涼的地上。"},{"english":"He stepped lightly over the puddle.","chinese":"他敏捷地跨過泥水坑。"},{"english":"Also in Fifteen-Thirteen, Vasco Nunez de Balboa crossed the Isthmus of Panama and reached the Pacific Ocean.","chinese":"同年，巴爾沃亞跨過了巴拿馬地峽到達了太平洋。"},{"english":"His Rockets never advanced further than the second round of the playoffs.","chinese":"他的火箭隊從來沒有跨過季後賽第二輪。"},{"english":"Never walk under or step over a tied lead rope.","chinese":"一定不要鑽過或跨過綁好的鉛繩。"},{"english":"According to legend, Paul Bunyan was a giant.","chinese":"保羅是個巨人，他只須邁一小步就能跨過三條街。"},{"english":"He endured hardships crossing the Mexico border to work in the United States.","chinese":"爲了到美國工作，他經受了跨過墨西哥邊境的艱辛。"},{"english":"Cross the heaviest thing in life with the most lightsome pace.","chinese":"用最輕盈的腳步跨過生命中最沉重的事情。"},{"english":"Reporters across the Silver Bridge to later see in the upstream water is indeed very clear.","chinese":"記者在跨過銀溪橋後見到，上游的水的確很清。"},{"english":"He strided across several rain puddle on his way home.","chinese":"他在回家的路上跨過了好幾個雨水坑。"},{"english":"Crossing the mountains, trading tea and salt with antlers and musks.","chinese":"跨過了千山萬嶺，馱走鹿茸麝香，換來鹽巴茶葉。"}],"related":[]}