{"definition":["frequency-hopping spread spectrum"],"pinyin":["tiao4 pin2"],"simplified":["跳频"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"跳頻","characters":[{"definition":["to jump\/to hop\/to skip over\/to bounce\/to palpitate"],"pinyin":["tiao4"],"word":"跳"},{"definition":["frequency\/frequently\/repetitious"],"pinyin":["pin2"],"word":"頻"}],"containing_words":[],"sentences":[{"english":"In this paper , the implementation of DFH system receiver is target.","chinese":"本文以差分跳頻通信系統的實現爲目的。"},{"english":"The principle of FH communication is described.","chinese":"簡述了跳頻通信的基本原理。"},{"english":"Chapter 4 depictions the realization structure and state flows.","chinese":"第四章敘述了自適應跳頻的具體實現結構和流程。"},{"english":"It also is known as frequency- hopping code division multiple access (FH-CDMA).","chinese":"跳頻也稱爲跳頻碼分多址。"},{"english":"It also is known as frequency- hopping code division multiple access (FH-CDMA).","chinese":"跳頻也稱爲跳頻碼分多址。"},{"english":"This paper discusses a new algorithm to generate wide gap differential frequency hopping code sequence.","chinese":"本文介紹了一種新的寬間隔的差分跳頻序列生成方法。"},{"english":"The design of FH multiple-access code adapting for multi-network is put forward.","chinese":"提出了較適合於多網通信的跳頻地址碼的設計方法。"},{"english":"Differential frequency hopping (DFH) is a kind of new frequency hopping (FH) technique.","chinese":"差分跳頻是一種新型的跳頻通信技術。"},{"english":"Differential frequency hopping (DFH) is a kind of new frequency hopping (FH) technique.","chinese":"差分跳頻是一種新型的跳頻通信技術。"},{"english":"Based on ultra-short wave communication, author discusses the channel equalizer.","chinese":"針對超短波跳頻系統，討論信道均衡技術。"},{"english":"Synchronization is one of the key techniques to frequency-hopping (FH) communication system.","chinese":"同步是跳頻通信系統關鍵技術之一。"},{"english":"Finally, a modified scheme of FFH-OCDMA system was proposed.","chinese":"在此基礎上，提出了光跳頻碼分多址系統的改進方案。"},{"english":"An acquisition method of frequency hopping signal in a TDMA system is presented in this paper.","chinese":"本文提出一種時分多址跳頻信號的捕獲方法。"}],"related":[]}