{"definition":["to plunge into\/to jump into"],"pinyin":["tiao4 jin4"],"simplified":["跳进"],"rank":18464.0,"normalized_rank":0.2583353154338002,"fraction":0.000002803646301510269,"cumulative_fraction":0.9708541763601144,"word":"跳進","characters":[{"definition":["to jump\/to hop\/to skip over\/to bounce\/to palpitate"],"pinyin":["tiao4"],"word":"跳"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[{"definition":["lit. even jumping into the Yellow River can't get you clean\/fig. to become inexorably mixed up\/mired in controversy\/in deep trouble"],"pinyin":["tiao4 jin4 Huang2 He2 xi3 bu4 qing1"],"word":"跳進黃河洗不清"}],"sentences":[{"english":"The big boys jumped into the river but little Ned hung back.","chinese":"大些的男孩子都跳進河裏了，但小內德畏縮不前。"},{"english":"B:I took off my shirt and my watch and jumped into the water.","chinese":"我脫掉上衣，解下手錶，跳進水裏。"},{"english":"With that I jumped onto the brightly-lit bus which started moving on, leaving the old man behind.","chinese":"再跳進通明的汽車裏，驀地離開他了。"},{"english":"The soldier turned his horse quickly and plunged into the river.","chinese":"士兵迅速掉轉馬頭，跳進河裏。"},{"english":"If you can't see the bottom, jump in, don't dive.","chinese":"如果水深不見底，跳進去時腳先落水，不要俯衝下水。"},{"english":"He made a dive from the bridge to save the drowning child.","chinese":"他從橋上跳進水裏去搶救落水兒童。"},{"english":"Jump into it and found it not easy.","chinese":"跳進去才發現這裏面也不簡單。"},{"english":"But sometimes you just have to take the plunge.","chinese":"你是說，讓我不管三七二十一，跳進海里就好了？"},{"english":"He saw and heard the rumbling of the waves of that Ocean, but did not dive into It.","chinese":"他看到和聽到了海浪的隆隆聲，但沒有跳進去。"},{"english":"Kobe, you are a big rubbish, please get into the rubbish bin.","chinese":"秦中原，你是一個大垃圾，請趕快跳進垃圾桶裏。"},{"english":"The people that are jumping in now will lose big.","chinese":"現在跳進去的人將損失慘重。"},{"english":"He took a quick look and without another word jumped into the icy water.","chinese":"他匆忙看了一眼，二話沒說，就跳進冰冷刺骨的水裏。"},{"english":"I am wearing a dress made of rainbow, dipping myself into the blue brook of time.","chinese":"我披一件彩霞，跳進了時間深處流淌藍色溪流中。"},{"english":"Splash! A big-eyed, bulging bullfrog plops into a pond.","chinese":"“撲通”，一隻眼睛又大又突的牛蛙跳進池塘裏。"},{"english":"The order to abandon the ship was given and hundreds of people plunged into the icy water.","chinese":"棄船的命令發出了，數百人跳進了冰冷刺骨的海水裏。"},{"english":"Towards evening， the boat struck a rock and the girl jumped into the sea.","chinese":"天將黑時，小船撞在了一塊礁石上，姑娘跳進了海里。"}],"related":[]}