{"definition":["to practice\/to put into practice"],"pinyin":["jian4 xing2"],"simplified":["践行"],"rank":15737.0,"normalized_rank":0.22018104738852434,"fraction":0.0000037929366787535836,"cumulative_fraction":0.9619587677834212,"word":"踐行","characters":[{"definition":["to fulfill (a promise)\/to tread\/to walk"],"pinyin":["jian4"],"word":"踐"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"}],"containing_words":[],"sentences":[{"english":"He also began to carry it out as soon as he took charge of FengXi warlord.","chinese":"在掌控奉系軍閥統治權後，他也開始踐行這一思想。"},{"english":"So, find out what it is that you want to be practicing.","chinese":"所以，首先應該搞明白什麼是你想要踐行的。"},{"english":"Moral models were apotheosis practising moral criterion in any times.","chinese":"道德典範是任何時代踐行道德規範的楷模。"},{"english":"Constructing the harmonious campus culture is concrete fulfillment for constructing harmonious university.","chinese":"建設和諧的校園文化，是構建和諧大學的具體踐行。"},{"english":"The more you live these commandments, the more His spirit can rest with you.","chinese":"愈是能夠踐行這“兩大誡命”，聖靈愈是與你同在。"},{"english":"The implementation of the scientific outlook of development should adhere to humanism.","chinese":"當前科學發展觀的踐行，亦應堅持以人爲本的精神。"},{"english":"People who use the principles say they work.","chinese":"踐行了這些信條的人們都說管用。"},{"english":"So, practice good defensive design on all of them.","chinese":"所以，所有這些頁面都要好好地踐行防護性設計。"},{"english":"Guardiola adopted the measure to be in charge only of the First Divison team of Barcelona.","chinese":"瓜迪奧拉在自己成爲一隊教練後也踐行着一個原則。"},{"english":"Women with great virtue in Shandong practiced the concept of virtue in different ways.","chinese":"山東守貞女性通過不同的行爲模式踐行其貞節觀。"}],"related":[{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"word":"實踐"},{"definition":["to practice what one preaches (idiom)"],"pinyin":["shen1 ti3 li4 xing2"],"word":"身體力行"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引領"},{"definition":["to hold fast to\/to stick to"],"pinyin":["jian1 shou3"],"word":"堅守"},{"definition":["to hope\/to expect\/expectation(s)"],"pinyin":["qi1 xu3"],"word":"期許"},{"definition":["to guide\/to lead (around)\/to conduct\/to boot\/introduction\/primer"],"pinyin":["yin3 dao3"],"word":"引導"},{"definition":["to advocate\/to initiate\/to propose\/to be a proponent of (an idea or school of thought)"],"pinyin":["chang4 dao3"],"word":"倡導"},{"definition":["to extend\/to spread\/to popularize\/generalization\/promotion (of a product etc)"],"pinyin":["tui1 guang3"],"word":"推廣"},{"definition":["to offer respectfully\/to consecrate\/to dedicate\/to devote"],"pinyin":["feng4 xian4"],"word":"奉獻"},{"definition":["to develop\/to make full use of"],"pinyin":["fa1 yang2"],"word":"發揚"},{"definition":["firm\/steady\/staunch\/resolute"],"pinyin":["jian1 ding4"],"word":"堅定"},{"definition":["genuine\/honest\/in good faith\/honesty\/integrity"],"pinyin":["cheng2 xin4"],"word":"誠信"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落實"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["to proclaim\/to make public or well known"],"pinyin":["xuan1 yang2"],"word":"宣揚"},{"definition":["notion\/thought\/concept\/sense\/views\/ideology\/general impressions"],"pinyin":["guan1 nian4"],"word":"觀念"}]}