{"definition":["to rise (in society)"],"pinyin":["ji1 shen1"],"simplified":["跻身"],"rank":8601.0,"normalized_rank":0.12033914904929136,"fraction":0.000010624543638265147,"cumulative_fraction":0.9165674248353812,"word":"躋身","characters":[{"definition":["to go up (esp. in rank)\/to rise\/to ascend"],"pinyin":["ji1"],"word":"躋"},{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"}],"containing_words":[],"sentences":[{"english":"Yao also is near the top of another, more unfortunate leaderboard.","chinese":"在另一個更令人遺憾的排行榜上，姚明也躋身前列。"},{"english":"Near Mohammed Sultan, Clarke Quay, Great World City, Orchard Road, Killinery.","chinese":"穆罕默德蘇丹，克拉碼頭，躋身世界大都會，烏節路。"},{"english":"Annika's achievements rank her among the most successful golfers.","chinese":"安尼卡的成就使她躋身於最成功的高爾夫運動員之列。"},{"english":"Near Mohammed Sultan, Clarke Quay, Great World City, Orchard Road, Killiney.","chinese":"穆罕默德蘇丹，克拉碼頭，躋身世界大都會，烏節路。"},{"english":"That might make Brazil a top-five source of oil .","chinese":"屆時巴西將躋身於全球前五大石油產地。"},{"english":"Ling said female students really don't have much choice if they want to secure employment in the competitive white-collar job market.","chinese":"凌說女畢業生要想躋身白領市場就比無他法。"},{"english":"The time has passed for five-years, Oushennuo has been about one of the top brands list.","chinese":"時過五年，歐神諾已躋身頂尖品牌之列。"},{"english":"China will be at the forefront of combating climate change.","chinese":"中國將躋身於對抗氣候變化的前沿。"},{"english":"Queen Elizabeth II was in the top 10 for a record 41st time.","chinese":"英國女王伊麗莎白二世今年第41次躋身前十名。"},{"english":"By 2001, they had made their way onto the Forbes rich list.","chinese":"到2001年，他們已經躋身福布斯財富榜。"},{"english":"Johnson and Aouita blazed their way to the top of track and field .","chinese":"約翰遜和阿烏伊塔各闢蹊徑，躋身田徑比賽榜首。"},{"english":"This part let young Maliya score a success, ascend body distinguished personages.","chinese":"這個角色讓年輕的瑪利亞獲得了成功，躋身名流。"},{"english":"Its 1, 000 megabits-per-second capability makes it one of the fastest in the world.","chinese":"每秒千兆的傳輸能力使其躋身全球最快的網絡行列。"},{"english":"In a short time it became one of Israel's leading folklore groups.","chinese":"此後不久，它就躋身爲以色列一支主要的民間藝術團。"},{"english":"And why was he among the kal online geons foremost liberal thinkers of the age?","chinese":"爲何他能躋身那個時代最重要的自由主義思想家之列？"},{"english":"You will be counted among the few, who actually change.","chinese":"你會躋身與少數真正可以改變的精英之列。"}],"related":[]}