{"definition":["seriously injured"],"pinyin":["shen1 fu4 zhong4 shang1"],"simplified":["身负重伤"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"身負重傷","characters":[{"definition":["body\/life\/oneself\/personally\/one's morality and conduct\/the main part of a structure or body\/pregnant\/classifier for sets of clothes: suit, twinset\/Kangxi radical 158"],"pinyin":["shen1"],"word":"身"},{"definition":["to bear\/to carry (on one's back)\/to turn one's back on\/to be defeated\/negative (math. etc)"],"pinyin":["fu4"],"word":"負"},{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["chong2","zhong4"],"word":"重"},{"definition":["to injure\/injury\/wound"],"pinyin":["shang1"],"word":"傷"}],"containing_words":[],"sentences":[{"english":"Poor Barry stopped a packet when his car was in collision with a lorry.","chinese":"巴里的車與一輛卡車相撞，可憐的巴里身負重傷。"},{"english":"He received severe injuries and nearly lost his life during the Second World War.","chinese":"在第二次世界大戰期間他身負重傷險些喪命。"},{"english":"Imperial search teams found Dodonna's wounded body and took the officer captive.","chinese":"帝國搜索隊找到身負重傷的多登納，俘虜了這位軍官。"},{"english":"Despite his terrible injuries, he wouldn't give up the struggle for life.","chinese":"他儘管身負重傷，但仍然沒有放棄求生的努力。"},{"english":"Poor John stopped a packet when his car was in collision with a lorry.","chinese":"約翰的車與一輛卡車相撞，可憐的約翰身負重傷。"},{"english":"He was seriously injured after a fight with General Grievous on Boz Pity.","chinese":"他在博茲皮蒂與格里弗斯將軍的戰鬥中身負重傷。"},{"english":"Small brightness load personally in construction.","chinese":"小輝在一次施工中身負重傷。"},{"english":"Although he was seriously wounded, he flatly refused to quit the battle line.","chinese":"他雖然身負重傷，但堅決不下火線。"},{"english":"Another American was injured.","chinese":"另一個美軍士兵則身負重傷。"},{"english":"Arthur killed Modred in battle but he himself was badly wounded.","chinese":"亞瑟殺死莫德雷德，自己也身負重傷。"}],"related":[]}