{"definition":["lit. When we get to the mountain, there'll be a way through. (idiom)\/fig. Everything will turn out for the best.\/Let's worry about it when it happens.\/It will be all right on the night.\/cf couplet 車到山前必有路，船到橋頭自然直|车到山前必有路，船到桥头自然直"],"pinyin":["che1 dao4 shan1 qian2 bi4 you3 lu4"],"simplified":["车到山前必有路"],"rank":53620.0,"normalized_rank":0.7502133672855484,"fraction":9.634523372887523e-8,"cumulative_fraction":0.9993908430999164,"word":"車到山前必有路","characters":[{"definition":["car\/vehicle\/CL:輛|辆[liang4]\/machine\/to shape with a lathe\/Kangxi radical 159","surname Che","war chariot (archaic)\/rook (in Chinese chess)\/rook (in chess)"],"pinyin":["Che1","che1","ju1"],"word":"車"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"},{"definition":["mountain\/hill\/anything that resembles a mountain\/CL:座[zuo4]\/bundled straw in which silkworms spin cocoons\/gable","surname Shan"],"pinyin":["Shan1","shan1"],"word":"山"},{"definition":["front\/forward\/ahead\/first\/top (followed by a number)\/future\/ago\/before\/BC (e.g. 前293年)\/former\/formerly"],"pinyin":["qian2"],"word":"前"},{"definition":["certainly\/must\/will\/necessarily"],"pinyin":["bi4"],"word":"必"},{"definition":["to have\/there is\/there are\/to exist\/to be"],"pinyin":["you3"],"word":"有"},{"definition":["road\/CL:條|条[tiao2]\/journey\/route\/line (bus etc)\/sort\/kind","surname Lu"],"pinyin":["Lu4","lu4"],"word":"路"}],"containing_words":[{"definition":["lit. When we get to the mountain, there'll be a way through and when the boat gets to the pier-head, it will go straight with the current. (idiom)\/fig. Everything will turn out for the best.\/Let's worry about it when it happens.\/It will be all right on the night."],"pinyin":["che1 dao4 shan1 qian2 bi4 you3 lu4 , chuan2 dao4 qiao2 tou2 zi4 ran2 zhi2"],"word":"車到山前必有路，船到橋頭自然直"}],"sentences":[{"english":"Don't worry about that situation. It will eventually work itself out.","chinese":"不要爲那種狀況擔心，肯定會車到山前必有路的。"},{"english":"The approach is \"build it and they will come\".","chinese":"對待問題的方法就是“車到山前必有路”。"}],"related":[]}