{"definition":["steel rolling mill"],"pinyin":["zha2 ji1"],"simplified":["轧机"],"rank":32957.0,"normalized_rank":0.4611111888405412,"fraction":7.25070872623217e-7,"cumulative_fraction":0.9926929786524751,"word":"軋機","characters":[{"definition":["surname Ya","to crush together (in a crowd)\/to make friends\/to check (accounts)","to crush\/to knock sb down with a vehicle","to roll (steel)"],"pinyin":["Ya4","ga2","ya4","zha2"],"word":"軋"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[],"sentences":[{"english":"The current galvanizing mill will be removed and the six-high mill will be built in its place.","chinese":"目前鍍鋅廠將被刪除，將在其位置上興建的六輥軋機。"},{"english":"The article describes the structural features and configuration of the edger stand with whole hydraulic screw-down for HCM Rough mills.","chinese":"簡要介紹全液壓壓下立輥軋機的結構特點及組成。"},{"english":"The development of slab width gauge in 3 h rolling mill is introduced.","chinese":"介紹三輥軋機板坯測寬儀的研製過程。"},{"english":"This paper presents the loop control system for high speed wire rod mill at Tangshan Iron and Steel Co.","chinese":"本文介紹唐鋼高速線材軋機的活套控制系統。"},{"english":"Planetary-Dissolver, Kneader, Triple roll mill.","chinese":"行星溶解，捏合機，三輥軋機。"},{"english":"The biting ability of compact mill and the restricted condition of forced biting were discussed.","chinese":"論述了緊湊式軋機咬入能力和強迫咬入的限制條件。"},{"english":"The shell not-rotation is the important technical requirement for planetary cross-mill.","chinese":"軋件不轉是行星斜軋機軋製的重要工藝要求。"},{"english":"A robust repetitive controller for roll eccentricity compensation of cold mill is designed.","chinese":"設計了用於冷軋機的軋輥偏心補償的魯棒重複控制器。"},{"english":"Jigang will fix this problem during the recent shut down of the finishing mill.","chinese":"濟鋼會在最近的精軋機停產時解決這一問題。"},{"english":"The rolling strategy is the base for presetting the process control parameters of cold tandem mill.","chinese":"軋製策略是冷連軋機進行過程控制參數設定的基礎。"},{"english":"One kind of speed synchronization control method for deflector roll of cold rolling mill is introduced in the paper.","chinese":"介紹一種冷軋機偏導輥的速度同步控制方式。"},{"english":"The article gives the key elements to select four-row cylindrical roller bearings for plate mill application.","chinese":"簡要介紹軋機用四列圓柱滾子軸承的選用要點。"},{"english":"This paper analyzes the characteristics of hydraulic loop system of rolling mill.","chinese":"本文對軋機液壓活套系統的工作特性進行了分析。"},{"english":"FQMTM is the core of Danieli seamless pipe production process.","chinese":"FQMTM軋機是達涅利無縫鋼管生產的核心設備。"},{"english":"The article describes the design and calculation of air-cushion piler at the rear end of the cross-cut shear in cold rolling mills.","chinese":"簡要介紹冷軋機橫切機組尾部氣墊垛板的設計計算。"},{"english":"The rolling mill is the complex mechano-electronic system controlled by computer.","chinese":"軋機是計算機控制的複雜機電系統。"}],"related":[]}