{"definition":["to roll steel (into sheets or bars)"],"pinyin":["zha2 gang1"],"simplified":["轧钢"],"rank":32845.0,"normalized_rank":0.4595441635302842,"fraction":7.319318210857278e-7,"cumulative_fraction":0.9926114177408384,"word":"軋鋼","characters":[{"definition":["surname Ya","to crush together (in a crowd)\/to make friends\/to check (accounts)","to crush\/to knock sb down with a vehicle","to roll (steel)"],"pinyin":["Ya4","ga2","ya4","zha2"],"word":"軋"},{"definition":["steel"],"pinyin":["gang1"],"word":"鋼"}],"containing_words":[{"definition":["a steel rolling mill"],"pinyin":["zha2 gang1 ji1"],"word":"軋鋼機"},{"definition":["a steel rolling mill"],"pinyin":["zha2 gang1 chang3"],"word":"軋鋼廠"},{"definition":["steel rails"],"pinyin":["zha2 gang1 tiao2"],"word":"軋鋼條"}],"sentences":[{"english":"Avoid shock loading and high overloads during mill operation.","chinese":"軋鋼時，避免衝擊負荷及過負荷運作。"},{"english":"It makes the system of steel rolling working in best value nearby.","chinese":"使軋鋼系統工作在最佳值附近。"},{"english":"In the heating process of rolling reduction of fuel consumption and ignition loss is of great significance.","chinese":"軋鋼加熱過程中，降低燃耗與燒損具有重要意義。"},{"english":"The quality of the rolling bearings is directly related to the operation condition of the rolling mill.","chinese":"滾動軸承狀態的好壞直接關係到軋鋼機運行的質量。"},{"english":"Applicable for bearings in working conditions of rolling mill.","chinese":"適合軋鋼廠軸承的工況條件。"},{"english":"The experiences to use converter gas in heating furnace of the rod rolling mill in Tangshan Iron and Steel Company are introduced.","chinese":"介紹了唐鋼棒材軋鋼加熱爐燒轉爐煤氣的經驗。"},{"english":"A heavy steel rolling mill is being built .","chinese":"一座大型軋鋼廠正在建設中。"},{"english":"The practical production show that the converter gas can be used in reheating furnace of steel rolling.","chinese":"實踐證明，軋鋼加熱爐使用轉爐煤氣是可行的。"},{"english":"C. All tankage and connecting flumes are boiler plate.","chinese":"所有筒槽和與之相連接的水槽爲平軋鋼板製造。"},{"english":"The utility model relates to a vertical roller of a rolling mill.","chinese":"本實用新型涉及軋鋼機立輥。"},{"english":"Specialized processing rolling mill accessories.","chinese":"專門加工軋鋼機配件。"},{"english":"Joe's beloved mother has recently died in a steel- mill accident.","chinese":"喬的母親剛剛死於軋鋼事故。"},{"english":"The present invention relates to one kind of roller way billet heat insulating apparatus.","chinese":"本發明涉及一種軋鋼廠輥道鋼坯的保溫裝置。"}],"related":[]}