{"definition":["software system"],"pinyin":["ruan3 jian4 xi4 tong3"],"simplified":["软件系统"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"軟件系統","characters":[{"definition":["soft\/flexible"],"pinyin":["ruan3"],"word":"軟"},{"definition":["item\/component\/classifier for events, things, clothes etc"],"pinyin":["jian4"],"word":"件"},{"definition":["system\/department\/faculty"],"pinyin":["xi4"],"word":"系"},{"definition":["to gather\/to unite\/to unify\/whole"],"pinyin":["tong3"],"word":"統"}],"containing_words":[],"sentences":[{"english":"Large scaled geosciences software systems often use several dozens of types of data.","chinese":"大型的地質行業軟件系統使用到多達幾十種數據類型。"},{"english":"The paper introduces the design and realization of the main control software system of the robot glazing system.","chinese":"文章介紹了機器人施釉主控軟件系統的設計與實現。"},{"english":"Most software systems consist of several concerns that crosscut multiple modules.","chinese":"大多數軟件系統由一些橫切多個模塊的關注點組成。"},{"english":"The track like data structure which resembles the track layouts in stations, is an important part of a PC based interlocking software system.","chinese":"站場形數據結構是微機聯鎖軟件系統的重要組成部分。"},{"english":"Boundary classes handle the input and output functions required by a software system.","chinese":"邊界類處理軟件系統的輸入與輸出。"},{"english":"The main functions and the usual architecture of spaceflight control software systems are introduced.","chinese":"介紹航天飛控軟件系統的主要功能及其常規體系結構。"},{"english":"A computer program for DNA and polypeptide sequence analysis was made.","chinese":"本文介紹了一種DNA和多肽鏈序列分析的軟件系統。"},{"english":"SNMP agent is an integrated part of router software system .","chinese":"路由器網管代理是路由器軟件系統的重要組成部分。"},{"english":"And your strategy relies increasingly on the development and delivery of business software systems.","chinese":"您的策略越來越多地依賴業務軟件系統的開發和交付。"},{"english":"One of the first tasks with any software system is the installation and configuration.","chinese":"任何軟件系統的最初任務之一都是安裝和配置。"},{"english":"It was also applied for detailed description of the behaviors of Flight Control Software ( FCS ) using statecharts.","chinese":"通過仿真驗證了飛行控制軟件系統功能的正確性。"},{"english":"The engineering image denoising is realized with MATLAB software system.","chinese":"應用MATLAB軟件系統實現工程圖像的去噪。"},{"english":"We would like to extend this capability to software systems and architectures.","chinese":"我們希望將此功能擴展到軟件系統和體系結構中。"},{"english":"As an example, an onboard software system is generated from the foundation class library.","chinese":"最後給出由基本類庫生成星載機軟件系統的實例。"},{"english":"Independently develop software system of dynamic pressure rise measurement actualized on freeze-dryer.","chinese":"自主開發出了在凍幹機上實施動壓法的軟件系統。"},{"english":"Incidentally, Observer was used widely in the software system.","chinese":"有時候，觀察器會在軟件系統中得到廣泛使用。"}],"related":[]}