{"definition":["mollusk\/mollusks"],"pinyin":["ruan3 ti3 dong4 wu4"],"simplified":["软体动物"],"rank":47545.0,"normalized_rank":0.6652162355015181,"fraction":1.8568354136837769e-7,"cumulative_fraction":0.9985564241824301,"word":"軟體動物","characters":[{"definition":["soft\/flexible"],"pinyin":["ruan3"],"word":"軟"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"}],"containing_words":[],"sentences":[{"english":"Any of various marine gastropods, such as a periwinkle, having a spiral shell.","chinese":"任一種海棲軟體動物，如濱螺，長有螺旋形的殼。"},{"english":"This mollusk feeds by filtering water, catching miniscule animals.","chinese":"這個軟體動物以過濾海水捕捉微生物爲食。"},{"english":"Fossil seashells trace the evolution of various mollusks throughmillions of years.","chinese":"貝殼化石見證了軟體動物幾百萬年的進化史。"},{"english":"Sprigg interpreted the patterns as the fossil remains of soft-bodied creatures like jellyfish or their relatives.","chinese":"斯普里格認爲這是某種類似水母的軟體動物化石。"},{"english":"It blew up in his face, as he is about as talented as a mollusc.","chinese":"他那像軟體動物一樣的智商，在他那大臉上開了花。"},{"english":"The resources of mollusca of the Southern Dongting Lake in Yuanjiang were investigated.","chinese":"對沅江南洞庭湖部分湖泊軟體動物資源作了初步調查。"},{"english":"Monobutyltin(MBT)was not detected in all mollusks.","chinese":"所有軟體動物均未檢測出單丁基錫。"},{"english":"There was this mollusk and he walks up to a sea cucumber.","chinese":"有一個軟體動物，他走着去找一個海蔘。"},{"english":"These include mollusks like clams and oysters, and reef-building corals.","chinese":"包括類似蛤和牡蠣的軟體動物，以及礁石結構的珊瑚。"},{"english":"They are formed when extra debris enters a mollusk during the harvesting process.","chinese":"這些額外的時形成的碎片進入軟體動物在收穫過程。"},{"english":"There were large reef communities that harbored squidlike nautiloids.","chinese":"海中還有大量像烏賊一樣躲在礁石下軟體動物。"},{"english":"The existence and extended diversity of antimicrobial peptides has been revealed in mussel in recent years.","chinese":"近年來在海洋軟體動物貽貝中發現了新的抗菌肽家族。"}],"related":[]}