{"definition":["soft drink"],"pinyin":["ruan3 yin3 liao4"],"simplified":["软饮料"],"rank":25085.0,"normalized_rank":0.3509716956053335,"fraction":0.0000014685349262310376,"cumulative_fraction":0.9844161707064744,"word":"軟飲料","characters":[{"definition":["soft\/flexible"],"pinyin":["ruan3"],"word":"軟"},{"definition":["to drink","to give (animals) water to drink"],"pinyin":["yin3","yin4"],"word":"飲"},{"definition":["material\/stuff\/grain\/feed\/to expect\/to anticipate\/to guess"],"pinyin":["liao4"],"word":"料"}],"containing_words":[],"sentences":[{"english":"The group urges schools to stop selling full-calorie soft drinks.","chinese":"協會還敦促學校停止出售富含熱量的軟飲料。"},{"english":"Soft-drinks manufacturers typically consume several times the volume that makes it into their products.","chinese":"軟飲料生產商通常在產品生產過程中會消耗掉部分水。"},{"english":"The study also forecast an explosion in the diet soft-drink market.","chinese":"該研究還預測低糖軟飲料市場將迅猛增長。"},{"english":"In Africa, most soft drinks are sold in returnable glass bottles.","chinese":"在非洲，大部分軟飲料裝在可退的玻璃瓶裏賣。"},{"english":"More students like having ice-cream, ice lollies and soft drinks after school.","chinese":"大多數學生課後愛喫冰淇淋，冰棍和軟飲料。"},{"english":"Here is a contract of Coca - Cola soft drink on consignment .","chinese":"下面是一份可口可樂軟飲料寄售合同。"},{"english":"Try store-brand soft drinks, if you must have soft drinks.","chinese":"嘗試超市自有品牌的軟飲料，如果你非喝不可。"},{"english":"This constant beverage use increases the risk of tooth decay.","chinese":"這些源源不斷地軟飲料增加了牙齒腐爛的風險。"},{"english":"I: You know… coca cola cans, soft drink cans.","chinese":"你知道可口可樂罐，軟飲料罐。"},{"english":"The soft-drinks and healthy drinks are also provided without additional charge.","chinese":"軟飲料和健康飲料，也提供了無額外收費。"},{"english":"Don’t order milkshake or sugary soft drinks.","chinese":"不要點奶昔或含糖的軟飲料。"},{"english":"There are no free soft drinks or volleyball courts.","chinese":"這裏沒有免費軟飲料，也沒有排球場。"},{"english":"The bottler has been struggling to revive soft-drink sales in the U.S.","chinese":"該公司一直竭力振興在美國的軟飲料銷售。"},{"english":"That day, I quit drinking soft drink , and replaced it with water.","chinese":"那天，我戒酒軟飲料，而代之以水。"},{"english":"We put the soft drinks in a bucket of ice to keep them cold.","chinese":"我們把那些軟飲料放在一桶冰裏冷藏。"},{"english":"I used to drink too many soft drinks.","chinese":"我過去常喝太多的軟飲料。"}],"related":[]}