{"definition":["axis\/axial"],"pinyin":["zhou2 xiang4"],"simplified":["轴向"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"軸向","characters":[{"definition":["axis\/axle\/spool (for thread)\/roller (for scrolls)\/classifier for calligraphy rolls etc","see 壓軸戲|压轴戏[ya1 zhou4 xi4]\/Taiwan pr. [zhou2]"],"pinyin":["zhou2","zhou4"],"word":"軸"},{"definition":["surname Xiang","towards\/to face\/to turn towards\/direction\/to support\/to side with\/shortly before\/formerly\/always\/all along\/(suffix) suitable for ...\/oriented to ..."],"pinyin":["Xiang4","xiang4"],"word":"向"}],"containing_words":[],"sentences":[{"english":"Influence of loading path on axial strength of circular tubular TX-joints.","chinese":"荷載路徑對TX型圓管節點軸向承載力的影響。"},{"english":"Incremental encoders without bearings for drives with large axial play or high speeds.","chinese":"無軸承的驅動器增量式編碼器與大型軸向或高速行駛。"},{"english":"The radial-axial large ring rolling technology was introduced.","chinese":"研究了大型環件的徑軸向軋製工藝。"},{"english":"The special features and applications of warp-knitted biaxial and multiaxial reinforcement sturctures are described .","chinese":"描述了雙軸向和多軸向加固經編織物特點和應用。"},{"english":"Magneto bearings transmit axial forces in only one direction.","chinese":"磁軸承只傳遞一個方向的軸向力。"},{"english":"High contact angles carry high axial loads.","chinese":"高接觸角帶有相當的軸向載荷。"},{"english":"This paper presents a strict analysis of the axial conformal slot-array on a metallic cylindrically-tipped wedge.","chinese":"本文提出一種嚴格分析圓楔體軸向共形縫隙陣的方法。"},{"english":"A single-row Tapered roller bearing can support a combined radial and axial load.","chinese":"阿單排圓錐滾子軸承可以支持合併徑向和軸向負荷。"},{"english":"Objective To determine axis tension for rat carotid segment.","chinese":"目的測定大鼠頸動脈血管段的軸向張力。"},{"english":"The depth of cut is significant factors to influence surface residual stress.","chinese":"軸向殘餘應力爲壓應力，其主要影響因素是進給量。"},{"english":"Multifunctional reactor with different axial furnace temperature can be designed and manufactured by our company.","chinese":"可以設計製作不同軸向爐內溫度的多功能反應器。"},{"english":"They are optical-mechanical method, displacement detecting method and direct adjustment method.","chinese":"軸向位移檢測法和直接調整法。"},{"english":"A mathematical model of axisymmetric compression of semi-solid alloy slurry was described.","chinese":"描述了一種軸向擠壓的半固態合金漿料的數學模型。"},{"english":"At the vortex center zone, the tangential velocity was less than the axial velocity.","chinese":"渦心附近的切向速度小於軸向速度。"},{"english":"Afterwards the pipes will have to be secured against axial displacement by means of a clamping device.","chinese":"然後管材必需通過夾緊裝置成軸向的轉移。"},{"english":"This paper mainly introduces the structure and performance of a seawater hydraulic axial piston pump.","chinese":"主要介紹軸向柱塞式海水泵的結構特點及其性能。"}],"related":[]}