{"definition":["comparatively large"],"pinyin":["jiao4 da4"],"simplified":["较大"],"rank":1214.0,"normalized_rank":0.016985435059393057,"fraction":0.00013352880082077346,"cumulative_fraction":0.6510972233222909,"word":"較大","characters":[{"definition":["to compare\/to dispute\/compared to\/(before adj.) relatively\/comparatively\/rather\/also pr. [jiao3]"],"pinyin":["jiao4"],"word":"較"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"}],"containing_words":[],"sentences":[{"english":"Build a sub-process that you can use to manage larger business systems.","chinese":"構建可以用來管理較大業務系統的子流程。"},{"english":"Moreover, the relatively high proportion of mature or over-mature forests shows that resources in support are insufficient.","chinese":"近成過熟林所佔比例較大，後備資源不足。"},{"english":"In addition, the number of the zenith delay parameters has effect on the tropospheric refraction.","chinese":"天頂延遲參數個數的選擇對對流層折射有較大影響。"},{"english":"CIPP evaluation pattern makes strong influence in the world.","chinese":"CIPP是一種在國內外影響較大的課程評價模式。"},{"english":"Compared with the Ming dynasty, the system of selecting officials in Qing dynasty had a big change.","chinese":"比之明代，清代的選官制度有了較大改變。"},{"english":"It has the biggest gap on the audience's satisfaction with comfort of spaces.","chinese":"觀賞者對各設施空間舒適與氣氛滿意度之差異性較大。"},{"english":"The total lignans content of Dysosma versipellis is related to the habitat.","chinese":"商品八角蓮總木脂素含量則與產地有較大關係。"},{"english":"Egg cells were relatively large and pear shaped.","chinese":"卵細胞較大，呈洋梨形。"},{"english":"Although the farm is large, my Dad has two men working for him.","chinese":"儘管農場較大，我爸爸只僱了兩個人幫他幹活。"},{"english":"Injecting drug in a short period would be more effective if MEC is relatively high.","chinese":"MEC較大時，比較適合採用短時間集中注射方式。"},{"english":"In a larger company, you would assign these roles to specific user groups.","chinese":"在較大的公司中，會將這些角色分配給特定的用戶組。"},{"english":"But you should not have a huge imbalance between exposition and application.","chinese":"但你不能在解經和應用上出現較大的不平衡。"},{"english":"Results Near-infrared spectrum of these products had a big difference.","chinese":"結果正僞品的近紅外光譜圖存在較大差別。"},{"english":"Large cysts can cause backaches and a dragging sensation.","chinese":"體積較大的囊腫可引起背痛及牽扯感。"},{"english":"Have taken place in people's consumption of a major change.","chinese":"人們的消費觀念已經發生了較大的轉變。"},{"english":"Key enterprises have made great progress in making up deficits and getting surpluses.","chinese":"重點企業扭虧增盈有較大進展。"}],"related":[{"definition":["relatively\/opposite\/to resist\/to oppose\/relative\/vis-a-vis\/counterpart"],"pinyin":["xiang1 dui4"],"word":"相對"},{"definition":["maximum\/enormous"],"pinyin":["ji2 da4"],"word":"極大"},{"definition":["clear\/distinct\/obvious"],"pinyin":["ming2 xian3"],"word":"明顯"},{"definition":["outstanding\/notable\/remarkable\/statistically significant"],"pinyin":["xian3 zhu4"],"word":"顯著"},{"definition":["completely\/totally\/total\/entire\/overall\/population (statistics)"],"pinyin":["zong3 ti3"],"word":"總體"},{"definition":["whole entity\/entire body\/synthesis\/as a whole (situation, construction, team etc)\/global\/macrocosm\/integral\/holistic\/whole"],"pinyin":["zheng3 ti3"],"word":"整體"},{"definition":["to compare\/to dispute\/compared to\/(before adj.) relatively\/comparatively\/rather\/also pr. [jiao3]"],"pinyin":["jiao4"],"word":"較"},{"definition":["equivalent to\/appropriate\/considerably\/to a certain extent\/fairly\/quite"],"pinyin":["xiang1 dang1"],"word":"相當"},{"definition":["individual\/specific\/respective\/just one or two"],"pinyin":["ge4 bie2"],"word":"個別"},{"definition":["slight\/light\/trivial\/to a small extent"],"pinyin":["qing1 wei1"],"word":"輕微"},{"definition":["better"],"pinyin":["jiao4 hao3"],"word":"較好"},{"definition":["to adjust\/adjustment\/revision\/CL:個|个[ge4]"],"pinyin":["tiao2 zheng3"],"word":"調整"},{"definition":["hidden\/potential\/latent"],"pinyin":["qian2 zai4"],"word":"潛在"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["trend\/tendency"],"pinyin":["qu1 shi4"],"word":"趨勢"},{"definition":["one step further\/to move forward a step\/further onwards"],"pinyin":["jin4 yi1 bu4"],"word":"進一步"}]}