{"definition":["to state explicitly in writing\/to specify\/to stipulate"],"pinyin":["zai3 ming2"],"simplified":["载明"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"載明","characters":[{"definition":["to carry\/to convey\/to load\/to hold\/to fill up\/and\/also\/as well as\/simultaneously","to record in writing\/to carry (i.e. publish in a newspaper etc)\/Taiwan pr. [zai4]\/year"],"pinyin":["zai3","zai4"],"word":"載"},{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"}],"containing_words":[],"sentences":[{"english":"An invitation for submission of bid shall clearly contain the particulars set forth in Paragraph 2 of Article 16 of this Law.","chinese":"投標邀請書應當載明本法第十六條第二款規定的事項。"},{"english":"In the application shall be stated the reasons therefor, with relevant evidence attached.","chinese":"申請書應當載明申請理由，並附有關證據。"},{"english":"In the diplomas shall be recorded the length of study and the subjects studied.","chinese":"結業證書應當載明修業年限和學業內容。"},{"english":"Evaluate conclusion is just valid on the base date of evaluation which is specified in the evaluation report.","chinese":"評估結論僅在評估報告載明的評估基準日有效。"},{"english":"The application shall clearly set forth causes for application with relevant evidence attached thereto.","chinese":"申請書應當載明申請理由，並附有關證據。"},{"english":"In witness whereof the parties hereto have put their hands the day and year first above written.","chinese":"雙方已於文首載明的日期簽署本協議，以資證明。"},{"english":"There are first the positive institutions embodied in law;","chinese":"最初，有集中載明於法律中的明定的制度。"},{"english":"The conditions and amount for payment of surrender value shall be specified in the insurance contract.","chinese":"償付解約金之條件及金額，應載明於保險契約。"}],"related":[]}