{"definition":["light machine gun"],"pinyin":["qing1 ji1 qiang1"],"simplified":["轻机枪"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"輕機槍","characters":[{"definition":["light\/easy\/gentle\/soft\/reckless\/unimportant\/frivolous\/small in number\/unstressed\/neutral\/to disparage"],"pinyin":["qing1"],"word":"輕"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"},{"definition":["gun\/firearm\/rifle\/spear\/thing with shape or function similar to a gun\/CL:支[zhi1],把[ba3],桿|杆[gan3],條|条[tiao2],枝[zhi1]\/to substitute for another person in a test\/to knock\/classifier for rifle shots","surname Qiang"],"pinyin":["Qiang1","qiang1"],"word":"槍"}],"containing_words":[{"definition":["Bren gun, British light machine gun first produced in 1937"],"pinyin":["Bu4 lun2 qing1 ji1 qiang1"],"word":"布倫輕機槍"}],"sentences":[{"english":"We fought with them with grenade and sub-machine gun in the jungle.","chinese":"在叢林中，我們用手榴彈和輕機槍掙扎着。"},{"english":"In battle, light machine guns are soldiers' main weapon.","chinese":"戰鬥中，輕機槍是士兵們主要的作戰武器。"},{"english":"Just two light machine-guns for the whole company.","chinese":"整個連只有二挺輕機槍。"},{"english":"The rest were in trenches with light MG and SMGs.","chinese":"其餘的人都在戰壕裏用輕機槍和衝鋒槍射擊。"},{"english":"You'd be lucky to shoot a fighter down with a light machine-gun.","chinese":"你很幸運能用輕機槍打下一架戰鬥機。"},{"english":"We even received a DP (Degtyarev) light machine-gun and a couple of drum magazines for it.","chinese":"我們得到了一挺捷格加廖夫輕機槍和幾個彈盤。"},{"english":"DP was a light machine-gun. We had a lot of them, in every platoon.","chinese":"捷格加廖夫是輕機槍，我們有很多，每個排都有。"},{"english":"Almost invariably, BAR men are exemplary in their conservation of ammunition.","chinese":"勃朗寧輕機槍手通常是節約彈藥的模範。"},{"english":"Could You Please Oblige Us With A Bren Gun?","chinese":"請把布朗式輕機槍給我們，好嗎？"}],"related":[]}