{"definition":["severity (of the case)\/degree of seriousness\/whether sth is slight or serious"],"pinyin":["qing1 zhong4"],"simplified":["轻重"],"rank":18056.0,"normalized_rank":0.2526268660892925,"fraction":0.0000029232019779101916,"cumulative_fraction":0.9696862446941784,"word":"輕重","characters":[{"definition":["light\/easy\/gentle\/soft\/reckless\/unimportant\/frivolous\/small in number\/unstressed\/neutral\/to disparage"],"pinyin":["qing1"],"word":"輕"},{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["chong2","zhong4"],"word":"重"}],"containing_words":[{"definition":["to play a critical role (idiom)\/influential"],"pinyin":["ju3 zu2 qing1 zhong4"],"word":"舉足輕重"},{"definition":["insignificant"],"pinyin":["wu2 zu2 qing1 zhong4"],"word":"無足輕重"},{"definition":["slight or important, urgent or non-urgent (idiom); to deal with important matters first\/sense of priority"],"pinyin":["qing1 zhong4 huan3 ji2"],"word":"輕重緩急"},{"definition":["lit. not knowing what's important (idiom); no appreciation of the gravity of things\/naive\/doesn't know who's who\/no sense of priorities"],"pinyin":["bu4 zhi1 qing1 zhong4"],"word":"不知輕重"},{"definition":["to invert the importance of things (i.e. stress the unimportant and neglect the important)\/lacking a sense of perspective\/to put the cart before the horse"],"pinyin":["qing1 zhong4 dao4 zhi4"],"word":"輕重倒置"},{"definition":["slight or important, urgent or non-urgent (idiom); to deal with important matters first\/sense of priority\/also written 輕重緩急|轻重缓急"],"pinyin":["huan3 ji2 qing1 zhong4"],"word":"緩急輕重"},{"definition":["lit. to inquire whether the tripods are light or heavy (idiom); a laughable attempt to seize power"],"pinyin":["wen4 ding3 qing1 zhong4"],"word":"問鼎輕重"},{"definition":["to invert the importance of things (i.e. stress the incidental and neglect the main point)\/lacking a sense of perspective\/to put the cart before the horse"],"pinyin":["qing1 zhong4 zhu3 ci4"],"word":"輕重主次"}],"sentences":[{"english":"The level of calcification was positive correlation with time of clinical symptom.","chinese":"鈣化的輕重與臨牀表現出現的早晚成正相關。"},{"english":"City and urban agglomeration are playing a key role in a regional economic development.","chinese":"城市和城市羣在一個區域發展中起着舉足輕重的作用。"},{"english":"The other two members of the committee are just featherweight .","chinese":"委員會的其他兩個成員只是無足輕重的人。"},{"english":"Clouds play an important role in the global climate system.","chinese":"雲在全球氣候系統中扮演着舉足輕重的角色。"},{"english":"Electrocardiographic abnormality was associated with the degree of clinical condition and prognosis.","chinese":"心電圖異常與病情輕重及預後密切相關。"},{"english":"Research and application of such master models are prevailing in the industry now.","chinese":"主模型的研製和應用已日益顯示出舉足輕重的地位。"},{"english":"These young people do not know the proper way to act.","chinese":"這些年輕人做事情不知輕重。"},{"english":"Here's just some lame extra footy.","chinese":"這裏的只是一些跛腳的額外無足輕重。"},{"english":"The new Baiyun Airport takes an important role in the Guangzhou municipal construction.","chinese":"新白雲機場在廣州城市建設中具有舉足輕重的地位。"},{"english":"In this prison he is a heavy hitter.","chinese":"在這個監獄裏，他可是個舉足輕重的人物。"},{"english":"Serve the citizens in order of priority and urgency on practical affair, take the easiest the first .","chinese":"我們爲市民辦實事要分輕重緩急，先易後難。"},{"english":"He just laughed, and dismissed the question as unimportant.","chinese":"他只是笑了笑，認爲問題無足輕重而不予考慮。"},{"english":"South-Pearl was playing a decisive role in our country′s pearl industry.","chinese":"在我國珍珠產業中，南珠具有舉足輕重的地位。"},{"english":"The medical ethics construction has the pivotal function in the hospital management work.","chinese":"醫德建設在醫院管理工作中具有舉足輕重的作用。"},{"english":"When collective security is at stake, public opinion can carry great weight.","chinese":"當涉及集體的安全時，輿論是舉足輕重的。"},{"english":"When this book first came out, critics called her a lightweight.","chinese":"當她出版了第一本書時評論家們說她無足輕重。"}],"related":[{"definition":["good and bad\/merits and drawbacks"],"pinyin":["you1 lie4"],"word":"優劣"},{"definition":["length\/duration\/accident\/right and wrong\/good and bad\/long and short"],"pinyin":["chang2 duan3"],"word":"長短"},{"definition":["good and evil\/good versus evil"],"pinyin":["shan4 e4"],"word":"善惡"},{"definition":["good or bad\/good and bad\/standard\/quality"],"pinyin":["hao3 huai4"],"word":"好壞"},{"definition":["whether or not (at the end of a phrase)"],"pinyin":["yu3 fou3"],"word":"與否"},{"definition":["what is true and what is false\/(to get to know) the real situation"],"pinyin":["xu1 shi2"],"word":"虛實"},{"definition":["duty\/responsibility\/to reproach\/to blame"],"pinyin":["ze2"],"word":"責"},{"definition":["to look at\/to regard\/to inspect"],"pinyin":["shi4"],"word":"視"},{"definition":["strong or weak\/intensity\/amount of force or pressure"],"pinyin":["qiang2 ruo4"],"word":"強弱"},{"definition":["to judge"],"pinyin":["ping2 duan4"],"word":"評斷"},{"definition":["to turn upside down\/to reverse\/back to front\/confused\/deranged\/crazy"],"pinyin":["dian1 dao3"],"word":"顛倒"},{"definition":["noble and lowly\/high versus low social hierarchy of ruler to people, father to son, husband to wife in Confucianism"],"pinyin":["gui4 jian4"],"word":"貴賤"},{"definition":["subjective"],"pinyin":["zhu3 guan1"],"word":"主觀"},{"definition":["to implicate\/implicated\/to link together"],"pinyin":["qian1 lian2"],"word":"牽連"},{"definition":["conversely\/in reverse order\/in an opposite direction"],"pinyin":["fan3 guo5 lai2"],"word":"反過來"},{"definition":["difference\/distinction\/disparity"],"pinyin":["cha1 bie2"],"word":"差別"}]}