{"definition":["Whig Party"],"pinyin":["Hui1 ge2 dang3"],"simplified":["辉格党"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"輝格黨","characters":[{"definition":["splendor\/to shine upon"],"pinyin":["hui1"],"word":"輝"},{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"},{"definition":["party\/association\/club\/society\/CL:個|个[ge4]","surname Dang"],"pinyin":["Dang3","dang3"],"word":"黨"}],"containing_words":[],"sentences":[{"english":"Whig opposition was not strong enough to defeat all the president's proposals.","chinese":"輝格黨的反對不足以阻止總統的所有的建議。"},{"english":"Whigs, on the other hand, were more comfortable with the market.","chinese":"另一方面，輝格黨對市場比較滿意。"},{"english":"In retaliation, the Whigs expelled Tyler from their party.","chinese":"由於政見的牴觸，泰勒被輝格黨開除出黨。"},{"english":"The act was supported by both Whigs and Tories.","chinese":"輝格黨和託利黨都支持該法案。"},{"english":"The Whigs argued that such a law would give presidents too much power over the economy.","chinese":"輝格黨認爲這樣一部法律給予總統太大的經濟權力。"},{"english":"Whig Party in the US in pre-Civil-War times.","chinese":"在美國內戰前期輝格黨成員。"},{"english":"The opposition Whig Party was happy over Van Buren's failures.","chinese":"反對黨輝格黨看到範布倫的失敗很高興。"},{"english":"The Whigs believed they could defeat President Martin Van Buren in his attempt to win a second term.","chinese":"輝格黨認爲他們能夠擊敗試圖連任的現任總統範布倫。"},{"english":"Whigs became more representative of northern business and farming interests.","chinese":"輝格黨更多的代表了北方工商農階級的利益。"},{"english":"The Tories and the Whigs were alternatively in power for a long time.","chinese":"長期以來，輝格黨和託利黨輪流掌權。"}],"related":[]}