{"definition":["to reflect\/to shine"],"pinyin":["hui1 ying4"],"simplified":["辉映"],"rank":24854.0,"normalized_rank":0.34773970590292835,"fraction":0.0000014997741383794913,"cumulative_fraction":0.9840731346696048,"word":"輝映","characters":[{"definition":["splendor\/to shine upon"],"pinyin":["hui1"],"word":"輝"},{"definition":["to reflect (light)\/to shine\/to project (an image onto a screen etc)"],"pinyin":["ying4"],"word":"映"}],"containing_words":[],"sentences":[{"english":"For a long time, Hong Kong has embraced the Eastern and Western cultures.","chinese":"長期以來，中西方文化在香港相互輝映，相互交融。"},{"english":"Each other and the beauty of 56 historic sites humanities.","chinese":"與湖光山色交相輝映的有56處人文歷史古蹟。"},{"english":"And together they're going to form a trilogy which feed off each other.","chinese":"他們將一起組成一個交相輝映的三部曲。"},{"english":"Beautiful moon that shineth by night.","chinese":"美麗的月亮輝映着夜晚。"},{"english":"Rebels fighters and prisoners embraced.","chinese":"造反派戰士和囚犯相互輝映。"},{"english":"You live in this, and dwell in lover's eyes.","chinese":"你長在詩裏和情人眼裏輝映。"},{"english":"Listen to the raucous cry of a grackle and its mate's answering call.","chinese":"聆聽鷯哥吵鬧的叫聲，一對對交相輝映。"},{"english":"B-BOX. Extreme sports and graffiti it might be a taste of an ordinary street passion.","chinese":"極限運動與塗鴉互相輝映，領略非一般的街頭激情。"},{"english":"HIbiscus colored Dining Room echoes the colors of the garden.","chinese":"芙蓉花色的餐廳輝映花園的顏色。"},{"english":"The pastel turquoise seat cushionsmatched the pastel turquoise laminate of the table top.","chinese":"崧藍綠色的彈性座墊和崧藍綠色桌面相互輝映。"},{"english":"For a long time, Hong Kong has embraced the eastern and western cultures.","chinese":"長時期以來，中西方文化在香港相互輝映，相互交融。"},{"english":"And all that's best of dark and bright meet in her aspect and her eyes;","chinese":"所有的光明和黑暗交相輝映出她的雍容和溫柔的眼波。"},{"english":"With the two towers rivaling each other, the ancient city of Xi'an is even more beautiful and spectacular than ever before.","chinese":"鐘樓的鼓樓交相輝映，使古城西安更加美麗壯觀。"},{"english":"Mass-tone moves perforative and whole room, brunet floor to it reflect.","chinese":"主色調貫穿整個房間，深色的地板與之輝映。"},{"english":"Mountainous overlapping scenery here alone good, reflect kyushu brothers concentric force.","chinese":"峯巒疊嶂此處風景獨好，輝映九州兄弟勠力同心。"},{"english":"The snow mountains look extremely elegant against the blue sky.","chinese":"雪山和藍天交相輝映，分外美麗。"}],"related":[]}