{"definition":["in turn\/one after another"],"pinyin":["lun2 fan1"],"simplified":["轮番"],"rank":12239.0,"normalized_rank":0.17123948903781847,"fraction":0.00000592318818754976,"cumulative_fraction":0.9453588961067779,"word":"輪番","characters":[{"definition":["wheel\/disk\/ring\/steamship\/to take turns\/to rotate\/by turn\/classifier for big round objects: disk, or recurring events: round, turn"],"pinyin":["lun2"],"word":"輪"},{"definition":["foreign (non-Chinese)\/barbarian\/classifier for occurrences (of an event, action or speech utterance)\/classifier for iterations: times, -fold (as in twofold etc)\/classifier for situations: kind, sort","surname Pan"],"pinyin":["Pan1","fan1"],"word":"番"}],"containing_words":[],"sentences":[{"english":"On the screen flashes three types of pictures.","chinese":"在屏幕上輪番放着三種類型的圖片。"},{"english":"That limited the rate of fire would very limited even with rotation.","chinese":"即使槍手們輪番上陣，所能節省的時間也非常有限。"},{"english":"The stability of the economy and society would surely be affected, leaving people haunted.","chinese":"輪番提價勢必影響經濟和社會穩定，搞得人心惶惶。"},{"english":"But it too eventually succumbed to record industry attacks.","chinese":"但最終也沒能挺過唱片行業的輪番攻擊。"},{"english":"The surprise and shock, rinse and Fang Zhai is staged by dreams and nightmares.","chinese":"這種驚喜和驚嚇，是漱芳齋輪番上演的美夢和惡夢。"},{"english":"We took turns stoking the furnaces.","chinese":"我們輪番給鍋爐添煤。"},{"english":"Raising price again and again should affect economy and social stability, and make people nervous.","chinese":"輪番提價勢必影響經濟和社會穩定，搞得人心惶惶。"},{"english":"Air strikes, artillery and tanks have been used.","chinese":"空襲，大炮和坦克輪番上陣。"},{"english":"School means seven classes with seven different teachers.","chinese":"在學校你每天要上七節課，常常七個老師輪番上陣。"},{"english":"Son-in-law of the new home, her relatives and family room turns wine before dinner.","chinese":"新女婿上門後，孃家房族親戚輪番擺宴請酒。"},{"english":"After everybody tested him several times, he finally showed his true colours.","chinese":"經過大家輪番地考驗，他終於原形畢露。"},{"english":"As you alternate eyes, your finger will seem to change position.","chinese":"當你輪番睜閉眼時，你的指頭似乎是變換了位置。"},{"english":"She was no longer the alternate succubus .","chinese":"她不再是那個輪番變幻的魔女了。"}],"related":[]}