{"definition":["export item\/product for export"],"pinyin":["shu1 chu1 pin3"],"simplified":["输出品"],"rank":67104.0,"normalized_rank":0.9388720216025632,"fraction":9.196590492301726e-9,"cumulative_fraction":0.9999795984588172,"word":"輸出品","characters":[{"definition":["to lose\/to transport\/to donate\/to enter (a password)"],"pinyin":["shu1"],"word":"輸"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["article\/commodity\/product\/goods\/kind\/grade\/rank\/character\/disposition\/nature\/temperament\/variety\/to taste sth\/to sample\/to criticize\/to comment\/to judge\/to size up\/fret (on a guitar or lute)"],"pinyin":["pin3"],"word":"品"}],"containing_words":[],"sentences":[{"english":"That is what you export.","chinese":"這是你們的輸出品。"},{"english":"The country's leading export is watches.","chinese":"這個國家的主輸出品是手錶。"},{"english":"What are the chief exports of China?","chinese":"中國的主要輸出品是什麼？"},{"english":"Superficial happiness without spiritual holiness in one of hell's major exports.","chinese":"缺乏屬靈聖潔的膚淺快樂是地獄最大宗的輸出品。"},{"english":"Any export listed in a .","chinese":"任何的輸出品列出在一。"},{"english":"Bulk pack in export cartons on pallets for delivery.","chinese":"大量要遞送的在草鋪上輸出品硬紙盒的包裹。"},{"english":"Coffee is a major export of Brazil.","chinese":"咖啡是巴西的主要輸出品。"},{"english":"Sugar is one chief export of China.","chinese":"糖是中國的主要輸出品之一。"},{"english":"Generally, avoid storing build output in version control.","chinese":"通常應避免在版本控制系統中存放構建輸出品。"},{"english":"Breaking into export markets is always much harder than entering markets at home.","chinese":"總是闖入輸出品市場是加難的超過在家進入市場。"},{"english":"Exports would seem to offer a tempting way out of this problem.","chinese":"輸出品會從這一個問題提供一個誘惑人的方法。"},{"english":"A copy of our illustrated export catalogue will be sent to you today.","chinese":"我們的列舉輸出品目錄的副本將會在今天被送給你。"},{"english":"What is the leading export of Belize?","chinese":"貝里斯的首要輸出品是什麼？"}],"related":[]}