{"definition":["pipe\/pipeline"],"pinyin":["shu1 shui3 guan3"],"simplified":["输水管"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"輸水管","characters":[{"definition":["to lose\/to transport\/to donate\/to enter (a password)"],"pinyin":["shu1"],"word":"輸"},{"definition":["surname Shui","water\/river\/liquid\/beverage\/additional charges or income\/(of clothes) classifier for number of washes"],"pinyin":["Shui3","shui3"],"word":"水"},{"definition":["surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["Guan3","guan3"],"word":"管"}],"containing_words":[],"sentences":[{"english":"It can also be used in pumping station and diversion works with long pipes.","chinese":"本裝置也可以應用於長輸水管道抽水站及引水工程。"},{"english":"The utility model solves the problem that the traditional rocker arm type water conveying pipe can not be bent.","chinese":"解決了傳統的搖臂式輸水管不能彎曲的問題。"},{"english":"Lincoln and Bellick go to the water station to cut off the main conduit water.","chinese":"林肯和巴利克來到了水站，斷開了主輸水管道的供水。"},{"english":"And the great pipes for carrying water under the streets had burst .","chinese":"埋在街道下的大輸水管道也破裂了。"},{"english":"The concrete water transmission pipes within Huangpo reservoir have been aged with severe seepage.","chinese":"黃坡水庫壩內輸水管老化和滲漏嚴重。"},{"english":"The invention relates to a kind of aqueduct and process of production.","chinese":"該發明涉及一種輸水管及其成型工藝。"},{"english":"The quake destroyed the city’s water mains, paralyzing the fire department.","chinese":"地震破壞了輸水管道，消防署也無能爲力。"},{"english":"The reliabilities of some kinds of aqueduct systems are analyzed.","chinese":"分析了幾種輸水管系統的可靠性。"},{"english":"The utility model belongs to the field of the cast-in-situ engineering of a delivery pipe with large caliber.","chinese":"本實用新型屬於大口徑輸水管現澆工程領域。"}],"related":[]}