{"definition":["to inject\/infusion"],"pinyin":["shu1 zhu4"],"simplified":["输注"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"輸注","characters":[{"definition":["to lose\/to transport\/to donate\/to enter (a password)"],"pinyin":["shu1"],"word":"輸"},{"definition":["to inject\/to pour into\/to concentrate\/to pay attention\/stake (gambling)\/classifier for sums of money\/variant of 註|注[zhu4]"],"pinyin":["zhu4"],"word":"注"}],"containing_words":[],"sentences":[{"english":"Key work in understanding the problems of using animal blood for human transfusions was provided by Ponfick and Landois.","chinese":"頗費克和蘭德思發現了給人輸注動物血的關鍵問題。"},{"english":"Objective Understanding ingredient blood of feeding in unite rescuing traffic incidents curative effect observing.","chinese":"目的瞭解成分血聯合輸注搶救交通傷的療效觀察。"},{"english":"Objective To explore the therapeutic effects of platelet transfusion in acute leukemic patients.","chinese":"目的探討急性白血病患者反覆輸注血小板的治療效果。"},{"english":"There was no depression of uterine activity during infusion period and second stage of labor.","chinese":"此後在連續輸注及第二產程中無宮縮抑制現象。"},{"english":"Objective To study the neuroprotective effect on rats with cold saline infusion intra-arterially.","chinese":"目的研究大鼠動脈內少量冷鹽水輸注的神經保護作用。"},{"english":"Objective:To compare the effect of labor induced with intravenous infusion of high and low dose of oxytocin in late gestation.","chinese":"比較大小劑量縮宮素靜脈輸注對晚期妊娠引產的效果。"},{"english":"The patients in the control group were intravenously administered compound sodium lactate.","chinese":"對照組麻醉後常規輸注複方乳酸鈉。"},{"english":"To study the cryoprecipitate infusion in the treatment of patients with massive blood loss efficacy.","chinese":"探討冷沉澱輸注在大量失血患者治療中的療效。"},{"english":"Objective To study the effect of ultraviolet blood irradiation therapy (UBIT) on the efficiency of platelet transfusions.","chinese":"目的探討血液光量子療法對血小板輸注效果的影響。"},{"english":"Plasmapheresis prior to plasma infusion in TTP treatment.","chinese":"血漿置換治療明顯優於血漿輸注。"},{"english":"This usually occurs after a large dose of regular insulin.","chinese":"這通常是由於大劑量的輸注短效胰島素引起的。"},{"english":"Manufacturer states that infusion time does not affect blood kalium and natrium levels in the body .","chinese":"出廠標明輸注時間不影響身體血液的鉀鈉水平。"},{"english":"The researchers gave the drug by intravenous infusions for three consecutive days every three weeks.","chinese":"研究人員每三週連續三天靜脈輸注此藥。"},{"english":"Objective To explore the application of indwelling needle in transfusing mannitol in vein.","chinese":"目的探討靜脈留置針在靜脈輸注甘露醇中的應用。"},{"english":"We already are able to infuse insulin semi-automatically.","chinese":"我們已經能夠半自動地輸注胰島素。"},{"english":"Conclusion UBIO can reduce refractoriness to platelet transfusion.","chinese":"結論血液光量子療法可減少血小板輸注無效。"}],"related":[]}