{"definition":["to lose"],"pinyin":["shu1 diao4"],"simplified":["输掉"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"輸掉","characters":[{"definition":["to lose\/to transport\/to donate\/to enter (a password)"],"pinyin":["shu1"],"word":"輸"},{"definition":["to fall\/to drop\/to lag behind\/to lose\/to go missing\/to reduce\/fall (in prices)\/to lose (value, weight etc)\/to wag\/to swing\/to turn\/to change\/to exchange\/to swap\/to show off\/to shed (hair)\/(used after certain verbs to express completion, fulfillment, removal etc)"],"pinyin":["diao4"],"word":"掉"}],"containing_words":[],"sentences":[{"english":"Mancini had effectively lost his midfield.","chinese":"曼奇尼實際上輸掉了中場。"},{"english":"The game is a draw if both teams lose at once.","chinese":"若兩個隊伍同時輸掉，則該盤遊戲爲和局。"},{"english":"That \"if\" is big enough to imply this is a battle lost.","chinese":"那個“如果”大得足以暗指這一次輸掉的戰役了。"},{"english":"I was a point from losing this match, and now I managed to come back.","chinese":"就差一分輸掉比賽，現在我設法將比分扳了回來。"},{"english":"My brother would have lost the argument if Dad hadn't interceded for him.","chinese":"如果當時父親不替哥哥求情，他就會輸掉這場爭論。"},{"english":"If you can't, you lose the game.","chinese":"若你無法如此做，則你輸掉這盤遊戲。"},{"english":"They have now endured seven defeats in all competitions and there are a lot of stiff challenges still.","chinese":"他們在各項賽事中已輸掉七場，而硬仗還數不勝數。"},{"english":"they're setting up in advance to lose.","chinese":"他們在輸掉之前爲自己找好藉口。"},{"english":"I realised that I'd let Holland and my team-mates down.","chinese":"我意識到，我讓荷蘭隊和我的隊友輸掉了比賽。"},{"english":"He got through the preliminaries but lost out in the finals.","chinese":"他通過了預賽，但在決賽中輸掉了。"},{"english":"The young adult losted his everything.","chinese":"那個年輕人把什麼都輸掉了。"},{"english":"The young man has gambled everything away.","chinese":"那個年輕人把什麼都輸掉了。"},{"english":"When Nefarious Lich leaves play, you lose the game.","chinese":"當極惡巫妖離場時，你輸掉此盤遊戲。"},{"english":"And whoever said T-Mac have no clue. Without TMac we lose this game.","chinese":"無論誰說麥迪沒主意，可是沒有麥迪我們會輸掉比賽。"},{"english":"Bad luck with Chinese National Football Team, they lost their first round.","chinese":"國足這次運氣不好，第一輪就輸掉了比賽。"},{"english":"Only five months ago, Mr Hsieh lost a race for the mayorship of Taipei.","chinese":"就在五個月前，謝長廷輸掉了臺北市長選舉。"}],"related":[]}