{"definition":["vas deferens"],"pinyin":["shu1 jing1 guan3"],"simplified":["输精管"],"rank":44797.0,"normalized_rank":0.626768150210569,"fraction":2.436366592325648e-7,"cumulative_fraction":0.9979708363920547,"word":"輸精管","characters":[{"definition":["to lose\/to transport\/to donate\/to enter (a password)"],"pinyin":["shu1"],"word":"輸"},{"definition":["essence\/extract\/vitality\/energy\/semen\/sperm\/mythical goblin spirit\/highly perfected\/elite\/the pick of sth\/proficient (refined ability)\/extremely (fine)\/selected rice (archaic)"],"pinyin":["jing1"],"word":"精"},{"definition":["surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["Guan3","guan3"],"word":"管"}],"containing_words":[],"sentences":[{"english":"This tube leads from the scrotum into the abdomen.","chinese":"輸精管自陰囊引出，進入腹腔。"},{"english":"Know the course and parts of the deferent ducts.","chinese":"熟悉輸精管的行程和分部。"},{"english":"Cause dead sperm disease is the main reason of the gonads and inflammation of the vas deferens attached.","chinese":"引起死精症的主要原因是附性腺和輸精管的炎症。"},{"english":"Ejaculation canal is the continuance after abdomen of seminiferous duct crock and spermatic canal are confluent .","chinese":"射精管是輸精管壺腹與精囊管匯合之後的延續。"},{"english":"Use v. boars to simplify the process.","chinese":"利用輸精管結紮的公豬，可使過程簡單化。"},{"english":"For men vasectomy is the only option for sterilization.","chinese":"對於男性來講，輸精管結紮術是唯一的絕育手術。"},{"english":"The epithelial cells and the smooth cells of rabbit vas deferens were observed by TEM.","chinese":"應用透射電鏡觀察了兔輸精管上皮細胞和平滑肌細胞。"},{"english":"Our patient has a blind vas deferens.","chinese":"我們這個病人沒有輸精管。"},{"english":"Risug is injected through special syringes into the vas deferens.","chinese":"注入是通過特殊的針筒進入輸精管。"},{"english":"Condoms or a vasectomy are still the only male contraceptive choices.","chinese":"男性避孕目前僅能靠保險套或輸精管結紮手術。"},{"english":"It is this vas deferens that is cut in a vasectomy.","chinese":"輸精管切除術恰恰切斷的就是這根管道。"},{"english":"The tail and epididymis vasectomy pot belly is the place of storage sperm.","chinese":"附睾尾部及輸精管壺腹部是貯存精子的場所。"}],"related":[]}