{"definition":["to rove around\/to run around in circles\/to walk back and forth"],"pinyin":["zhuan4 lai2 zhuan4 qu4"],"simplified":["转来转去"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"轉來轉去","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"He loafed about the street looking for something to do.","chinese":"他在街上轉來轉去，想找點事做。"},{"english":"The log twiddled round and round in the river.","chinese":"那根圓木在河水中轉來轉去。"},{"english":"For there he can maneuver you onto all fours.","chinese":"他於是就轉來轉去，你還可以四肢趴着。"},{"english":"His glance roved the boy sitting by the window.","chinese":"他的目光轉來轉去地看着坐在窗戶旁邊的男孩。"},{"english":"Don't stop, so the beast's upstream instead.","chinese":"轉來轉去不停止，於是石獸反而逆流而上了。"},{"english":"They both looked out through the window at the guests milling about in the yard.","chinese":"他們一起看向窗外，看着客人們在後院裏轉來轉去。"},{"english":"The thou Ao eye pupil son turns around, one slavering of face facial expression.","chinese":"古傲眼珠子轉來轉去，一臉的垂涎表情。"},{"english":"Boemio casually walks around all of it, occasionally laughing.","chinese":"波密奧在這些東西周圍轉來轉去，偶爾還笑笑。"},{"english":"She at home roves , is excited the cheeks to be bright red.","chinese":"她在家裏轉來轉去，興奮得臉頰飛紅。"}],"related":[]}