{"definition":["to return\/to go back"],"pinyin":["zhuan4 qu4"],"simplified":["转去"],"rank":27938.0,"normalized_rank":0.3908888671246485,"fraction":0.0000011351220264783843,"cumulative_fraction":0.98811078152706,"word":"轉去","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[{"definition":["to rove around\/to run around in circles\/to walk back and forth"],"pinyin":["zhuan4 lai2 zhuan4 qu4"],"word":"轉來轉去"}],"sentences":[{"english":"He loafed about the street looking for something to do.","chinese":"他在街上轉來轉去，想找點事做。"},{"english":"Li Busu was familiar with the route so they made rapid progress. He turned this way and that through open crevices .","chinese":"李不俗駕輕就熟，在那些嵌裂透漏的縫隙中鑽來轉去。"},{"english":"The log twiddled round and round in the river.","chinese":"那根圓木在河水中轉來轉去。"},{"english":"The heavy door swung inwards.","chinese":"那扇沉重的門向內轉去。"},{"english":"And are you now turning away from the LORD?","chinese":"你們今日竟轉去不跟從耶和華嗎？"},{"english":"For there he can maneuver you onto all fours.","chinese":"他於是就轉來轉去，你還可以四肢趴着。"},{"english":"Sell the gold back and put the money towards a new style.","chinese":"你應該把黃金賣回去，折現轉去買新樣式。"},{"english":"His glance roved the boy sitting by the window.","chinese":"他的目光轉來轉去地看着坐在窗戶旁邊的男孩。"},{"english":"Don't stop, so the beast's upstream instead.","chinese":"轉來轉去不停止，於是石獸反而逆流而上了。"},{"english":"They both looked out through the window at the guests milling about in the yard.","chinese":"他們一起看向窗外，看着客人們在後院裏轉來轉去。"},{"english":"The thou Ao eye pupil son turns around, one slavering of face facial expression.","chinese":"古傲眼珠子轉來轉去，一臉的垂涎表情。"},{"english":"Boemio casually walks around all of it, occasionally laughing.","chinese":"波密奧在這些東西周圍轉來轉去，偶爾還笑笑。"},{"english":"Look out for cars turning in your direction.","chinese":"注意車子正往你的方向轉去。"},{"english":"Daenerys could only twist and turn beside him.","chinese":"丹妮莉絲只能在他身邊扭來轉去。"},{"english":"He turned their heart to hate his people, to deal subtilly with his servants.","chinese":"使敵人的心轉去恨他的百姓，並用詭計待他的僕人。"},{"english":"She at home roves , is excited the cheeks to be bright red.","chinese":"她在家裏轉來轉去，興奮得臉頰飛紅。"}],"related":[{"definition":["to gesticulate\/to point out\/to point the finger of blame"],"pinyin":["zhi3 zhi3 dian3 dian3"],"word":"指指點點"},{"definition":["to come to sb's door\/to call on sb"],"pinyin":["zhao3 shang4 men2"],"word":"找上門"},{"definition":["rumor"],"pinyin":["chuan2 wen2"],"word":"傳聞"},{"definition":["accidentally\/to act before thinking"],"pinyin":["wu4 da3 wu4 zhuang4"],"word":"誤打誤撞"},{"definition":["to be of no interest to anyone (idiom)"],"pinyin":["wu2 ren2 wen4 jin1"],"word":"無人問津"},{"definition":["to change one's mind\/to go back on one's word"],"pinyin":["bian4 gua4"],"word":"變卦"},{"definition":["like a swarm of bees\/everyone swarms around pushing and shouting\/a hornet's nest"],"pinyin":["yi1 wo1 feng1"],"word":"一窩蜂"},{"definition":["to turn back\/to put back\/reversal\/melodic inversion (in music)"],"pinyin":["zhuan3 hui2"],"word":"轉回"},{"definition":["to make progress\/progress"],"pinyin":["zhang3 jin4"],"word":"長進"},{"definition":["main job\/day job\/steady full-time job (as opposed to temporary or casual)\/chief or principal post (as opposed to deputy)"],"pinyin":["zheng4 zhi2"],"word":"正職"},{"definition":["to try to persuade sb to give up (their job, plans etc)"],"pinyin":["quan4 tui4"],"word":"勸退"},{"definition":["not to engage in honest work\/to ignore one's proper occupation\/not to attend to one's proper duties"],"pinyin":["bu4 wu4 zheng4 ye4"],"word":"不務正業"},{"definition":["aloof\/indifferent\/unconcerned"],"pinyin":["wu2 dong4 yu2 zhong1"],"word":"無動於衷"},{"definition":["pediatrics\/pediatric (department)\/sth of little importance\/trifle\/a child's play\/(slang) childish\/petty\/stingy"],"pinyin":["xiao3 er2 ke1"],"word":"小兒科"},{"definition":["profession\/role (acting)"],"pinyin":["hang2 dang5"],"word":"行當"},{"definition":["to count\/reckoning"],"pinyin":["ji4 shu4"],"word":"計數"}]}