{"definition":["rotor (electricity)"],"pinyin":["zhuan4 zi3"],"simplified":["转子"],"rank":36134.0,"normalized_rank":0.5055615407216711,"fraction":5.472701231053837e-7,"cumulative_fraction":0.994702044352711,"word":"轉子","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi3","zi5"],"word":"子"}],"containing_words":[],"sentences":[{"english":"The critical speed of one turbopump rotor on elastic support was computed by FEMQZ.","chinese":"計算分析了某渦輪泵轉子在彈性支承下的臨界轉速。"},{"english":"Electric machines are composed of stator and rotor.","chinese":"電機是由定子和轉子兩部分構成的。"},{"english":"The prestress method should be developed in the study of the rotor dynamics problems.","chinese":"預應力法在轉子動力學問題的研究中可進一步拓展。"},{"english":"The Transfer Matrix Method (TMM) and the Finite Element Method (FEM) are two ordinary calculating methods for rotary system.","chinese":"傳遞矩陣法和有限元法是轉子動力學分析的常用方法。"},{"english":"Depending on the characteristics of products used and on the type of stators and rotors.","chinese":"根據產品使用特點及定子和轉子的類型確定流量。"},{"english":"In China, some aero-engines start to use single crystal turbine blades in practice.","chinese":"在國內，某些發動機上亦開始使用單晶渦輪轉子葉片。"},{"english":"The explicit expressions of free surface and resultant forces imposing on the rotor are obtained.","chinese":"求得了自由面和作用在轉子上的合力的顯式表達式。"},{"english":"This paper presents an improved scheme of rotor position estimation for PMSM.","chinese":"介紹了一種永磁同步電動機轉子位置估算的改進方法。"},{"english":"Unbalance is one of the most frequent faults occurs in turbomachinery.","chinese":"其中以不平衡爲轉子系統中最常發生之故障。"},{"english":"Rotor is an important assembly of hammer mill.","chinese":"轉子是錘片式粉碎機的主要工作部件。"},{"english":"When rub-impact occurs, there is a rub-impact force on rotor and box.","chinese":"當碰摩發生時，轉子與機匣都受到碰摩力的作用。"},{"english":"A new type of arc cycloidal internal meshing rotary pump was studied.","chinese":"對一種新型圓弧擺線內齧合轉子泵進行了研究。"},{"english":"Cold-rolled steel impeller metal external rotor motors welding.","chinese":"冷軋鋼板葉輪金屬外轉子電機弧焊。"},{"english":"The dispit beater contains the rotor parts of sieve-mesh of normal beater.","chinese":"打漿機包含普通打漿機篩網轉子部件。"},{"english":"The Atkinson cycle can be used in a rotary engine.","chinese":"阿特金森循環的，可以用在轉子發動機。"},{"english":"Rotary blade has applied latest V-shaped cutting technique.","chinese":"轉子刀具採用最新的V形切割技術。"}],"related":[]}