{"definition":["change over to\/shift to\/switch to"],"pinyin":["zhuan3 ru4"],"simplified":["转入"],"rank":6434.0,"normalized_rank":0.0900200075553006,"fraction":0.000016717503805855334,"cumulative_fraction":0.8876312328044892,"word":"轉入","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"}],"containing_words":[{"definition":["to go underground\/to turn to secret activities"],"pinyin":["zhuan3 ru4 di4 xia4"],"word":"轉入地下"}],"sentences":[{"english":"The procession has turned onto Lianyue Rd. Too bad Lian Yue's not here.","chinese":"現隊伍轉入蓮嶽路，可惜連嶽不在。"},{"english":"The picture dissolved into a view of a house.","chinese":"電影漸隱轉入一座房子。"},{"english":"We have got past the big rivers and just turned into a little one.","chinese":"我們已經經過了大河，正轉入一條小河中。"},{"english":"“My goal is to turn an acute-care emergency patient into an outpatient,” he declared.","chinese":"“我的目標是把急診病人轉入門診部，”他說。"},{"english":"He stepped off and turned into a narrow lane.","chinese":"他走了下來，轉入一條窄巷。"},{"english":"Telling laughable without looking, I do not know to turn that process.","chinese":"長恨春歸無覓處，不知轉入此中來。"},{"english":"And then we'll turn to value questions.","chinese":"然後，我們轉入價值理論。"},{"english":"The first involves incorporating active phytase into conventional feed rations, while the second uses genetic engineering to introduce the phytase into crops.","chinese":"第二項技術是採用遺傳工程將植酸酶基因轉入穀物中。"},{"english":"That's where we get to the second part of our story.","chinese":"到這裏就該轉入我們這篇文章的下半部分了。"},{"english":"Huodataidu on porphyrin As for the Horn into a blind alley or.","chinese":"豁達大度，就卟至於轉入死衚衕或牛角尖。"},{"english":"Just into the Japanese school, there are many places I was surprised.","chinese":"剛轉入日本的中學時，有很多地方令我感到驚訝。"},{"english":"A check in the box indicates the file will be carried forward to the next revision.","chinese":"勾選的文件將轉入修改版本中。"},{"english":"Since then, China out of the monarchy into the period of democratic revolution.","chinese":"自此之後，中國脫離了帝制而轉入了民主革命時期。"},{"english":"levels. “He has now moved on to the next level, ” Miscavige said.","chinese":"“他現在轉入了下一個更高層次，”密斯凱維吉說。"},{"english":"The car branched off to the left.","chinese":"那輛車轉入左邊的小路上去了。"},{"english":"After several hours in \"whisper\" mode, we opted to enter my personal chat room.","chinese":"“私聊”了幾小時，我們轉入我開的私人聊天室。"}],"related":[{"definition":["less advanced\/underdeveloped\/lagging behind\/the younger generation\/the less experienced ones"],"pinyin":["hou4 jin4"],"word":"後進"},{"definition":["to change direction\/fig. to change one's stance","to get lost\/to lose one's way"],"pinyin":["zhuan3 xiang4","zhuan4 xiang4"],"word":"轉向"},{"definition":["to withdraw from\/to evacuate"],"pinyin":["che4 li2"],"word":"撤離"},{"definition":["to gallop\/speedily\/to proceed to\/to pilot (ship, plane etc)\/to sail"],"pinyin":["shi3"],"word":"駛"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["via"],"pinyin":["jing1 you2"],"word":"經由"},{"definition":["to reach\/to arrive"],"pinyin":["dao4 da2"],"word":"到達"},{"definition":["neighboring\/adjacent\/near\/vicinity"],"pinyin":["lin2 jin4"],"word":"鄰近"},{"definition":["to seal\/to close\/to confine\/to seal off\/to close down\/sealed\/confined\/closed\/unreceptive"],"pinyin":["feng1 bi4"],"word":"封閉"},{"definition":["to migrate\/to move"],"pinyin":["qian1 yi2"],"word":"遷移"},{"definition":["to flow into\/to converge (of river)\/(computing) to import (data)"],"pinyin":["hui4 ru4"],"word":"匯入"},{"definition":["to operate\/operations\/workings\/activities (usu. of an organization)\/thread (computing)"],"pinyin":["yun4 zuo4"],"word":"運作"},{"definition":["to cross over (by ferry)\/transition\/interim\/caretaker (administration)"],"pinyin":["guo4 du4"],"word":"過渡"},{"definition":["to travel along a route (of vehicles etc)"],"pinyin":["xing2 shi3"],"word":"行駛"},{"definition":["soon after"],"pinyin":["sui2 hou4"],"word":"隨後"},{"definition":["building (a relatively large, multi-storey one)\/CL:幢[zhuang4],座[zuo4]"],"pinyin":["da4 lou2"],"word":"大樓"}]}