{"definition":["metonymy"],"pinyin":["zhuan3 yu4"],"simplified":["转喻"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"轉喻","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["surname Yu","to describe sth as\/an analogy\/a simile\/a metaphor\/an allegory"],"pinyin":["Yu4","yu4"],"word":"喻"}],"containing_words":[],"sentences":[{"english":"In chapter five, the relation between metonymy and syntax is discussed.","chinese":"第五章討論了轉喻同句法的關係。"},{"english":"Thought that the violence an extension explains, completes to one kind of intrinsic real writing.","chinese":"想暴力的一個轉喻，以完成對一種內在真實的書寫。"},{"english":"Metonymy expresses in a disguised form among other spiritual field and culture phenomena.","chinese":"轉喻在其他精神領域和文化現象中也有變相的表現。"},{"english":"Meanwhile, metonymy in English news adapts to the social world.","chinese":"轉喻的使用也順應了社交世界。"},{"english":"Metaphorical and metonymic sense extensions have their respective features.","chinese":"隱喻和轉喻意義擴展各有其特點。"},{"english":"The Idealized Cognitive Model (ICM) which contains stands-for relations is what we referred as metonymic models.","chinese":"包含有替代關係的理想認知模型即被稱爲轉喻模型。"},{"english":"Secondly, the formation mechanism for English euphemism is metonymy rather than metaphor.","chinese":"第二，委婉語的構成機制是轉喻而非隱喻。"},{"english":"The interpretation of nominal tautology requires metonymic reasoning.","chinese":"同語的理解需要運用轉喻推理。"},{"english":"Metonymy is a common phenomenon in Chinese texts.","chinese":"轉喻是漢語文本中常見的語言現象。"},{"english":"Metonymy has its own logic, which shows the main characteristics as follows.","chinese":"轉喻有自身的邏輯特徵。"},{"english":"Morphemes metaphor or metonymy used to form the meaning of a word is called recessive relationship.","chinese":"語素義通過比喻或轉喻來構成詞義的叫作隱性關係。"},{"english":"Metonymy is a basic mode of thinking used in everyday communication.","chinese":"轉喻是被廣泛用於日常交際中的一種基本思維方式。"},{"english":"The overlapping or interaction of metaphor and metonymy sometimes exists in semantic extension.","chinese":"隱喻和轉喻在詞義延伸中有時會交叉或相互作用。"},{"english":"Body words are changed into measure words by means of metaphor.","chinese":"人體詞的量詞化是在隱喻或轉喻的機制下完成的。"},{"english":"Metaphor and metonymy is one of the important topics of cognitive linguistics in modern western research.","chinese":"隱喻和轉喻是當代西方認知語言學研究的重要課題。"},{"english":"Metaphor focuses on the property of similarity between two domains, while metonymy focuses on that of contiguity.","chinese":"但是，隱喻注重相似性，轉喻以相鄰關係爲特徵。"}],"related":[{"definition":["to mix\/to blend\/to dilute"],"pinyin":["chan1 za2"],"word":"攙雜"},{"definition":["(Tw) obstinate\/argumentative\/opinionated\/skeptical of superstitions\/(Taiwanese, Tai-lo pr. [thih-khí])"],"pinyin":["tie3 chi3"],"word":"鐵齒"},{"definition":["legendary magic potion of immortals\/panacea\/fig. wonder solution to a problem"],"pinyin":["xian1 yao4"],"word":"仙藥"},{"definition":["Coriolanus, 1607 tragedy by William Shakespeare 莎士比亞|莎士比亚"],"pinyin":["Ke1 li4 ao4 lan2 na4 si1"],"word":"科利奧蘭納斯"},{"definition":["heritage\/historical legacy"],"pinyin":["li4 shi3 yi2 chan3"],"word":"歷史遺產"},{"definition":["rhetoric\/flowery language"],"pinyin":["ci2 zao3"],"word":"詞藻"},{"definition":["consul (of the Roman Republic)\/magistrate (chief administrator)"],"pinyin":["zhi2 zheng4 guan1"],"word":"執政官"},{"definition":["rhetoric"],"pinyin":["xiu1 ci2 xue2"],"word":"修辭學"},{"definition":["worm"],"pinyin":["ru2 chong2"],"word":"蠕蟲"},{"definition":["to store\/to have sth in storage"],"pinyin":["ku4 cang2"],"word":"庫藏"},{"definition":["to run in parallel without hindrance\/not mutually exclusive\/two processes can be implemented without conflict"],"pinyin":["bing4 xing2 bu4 bei4"],"word":"並行不悖"},{"definition":["moth"],"pinyin":["deng1 e2"],"word":"燈蛾"},{"definition":["take from the long to supplement the short (idiom)\/to offset each other's deficiencies\/to complement each other"],"pinyin":["jie2 chang2 bu3 duan3"],"word":"截長補短"},{"definition":["to hunt\/(fig.) to seek (fame etc)"],"pinyin":["lie4 qu3"],"word":"獵取"},{"definition":["Homer's Iliad"],"pinyin":["Yi1 li4 ya4 te4"],"word":"伊利亞特"},{"definition":["circumcision"],"pinyin":["ge1 li3"],"word":"割禮"}]}