{"definition":["see 拐彎抹角|拐弯抹角[guai3 wan1 mo4 jiao3]"],"pinyin":["zhuan3 wan1 mo4 jiao3"],"simplified":["转弯抹角"],"rank":55989.0,"normalized_rank":0.7833587508569669,"fraction":7.255088055038028e-8,"cumulative_fraction":0.9995894074151304,"word":"轉彎抹角","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["to bend\/bent\/a bend\/a turn (in the road etc)\/CL:道[dao4]"],"pinyin":["wan1"],"word":"彎"},{"definition":["to plaster\/to go around\/to skirt","to smear\/to wipe\/to erase\/classifier for wisps of cloud, light-beams etc","to wipe"],"pinyin":["ma1","mo3","mo4"],"word":"抹"},{"definition":["angle\/corner\/horn\/horn-shaped\/unit of money equal to 0.1 yuan, or 10 cents (a dime)\/CL:個|个[ge4]","role (theater)\/to compete\/ancient three legged wine vessel\/third note of pentatonic scale","surname Jue"],"pinyin":["Jue2","jiao3","jue2"],"word":"角"}],"containing_words":[],"sentences":[{"english":"She always angles for a free ticket.","chinese":"她轉彎抹角地想要一張免費票。"},{"english":"Shiqu tortuous, from west to east, drainage density Shop at the end of black gravel.","chinese":"石渠轉彎抹角，由西向東，渠底密鋪黑色卵石。"},{"english":"Tell me the point, and don't beat around the bush.","chinese":"告訴我重點，不要轉彎抹角地說。"},{"english":"His beating around the bush manners of speaking has made it difficult for us to fathom his true intention.","chinese":"他講得很轉彎抹角，我們難以摸透他的真正用意。"},{"english":"Abrupt and often disconcertingly frank in speech.","chinese":"說話率直的，不轉彎抹角的。"},{"english":"But the negotiations proved long and tortuous .","chinese":"但談判還是轉彎抹角地拖了很久。"},{"english":"I think he must be a policeman, he keeps fishing for information.","chinese":"我想他肯定是警察，他不斷地轉彎抹角地打聽消息。"},{"english":"I wish you'd stop beating about the bush and tell me that you really want.","chinese":"我希望你不要轉彎抹角，快告訴我你到底想要什麼。"},{"english":"One day something happened which in a roundabout way was enlightening.","chinese":"有一天發生了一件事，很有一點轉彎抹角的啓發性。"},{"english":"He speaks in a roundabout way and no one knows what he is drive at.","chinese":"他講得很轉彎抹角，我們難以摸透他的真正用意。"}],"related":[]}