{"definition":["to roll\/to wander around\/to appear repeatedly"],"pinyin":["zhuan4 you5"],"simplified":["转悠"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"轉悠","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["long or drawn out\/remote in time or space\/leisurely\/to swing\/pensive\/worried"],"pinyin":["you1"],"word":"悠"}],"containing_words":[],"sentences":[{"english":"“He was just wandering around, ” the white coat answered.","chinese":"“他剛纔在到處轉悠來着，”穿白大衣的人說。"},{"english":"You walked about my seat, playing with blue plums.","chinese":"你在我凳子邊上轉悠，和藍梅一塊玩兒。"},{"english":"This man does hang about the house.","chinese":"這個人常在我家周圍轉悠。"},{"english":"He hung about the entrance all day, hoping for a chance to speak to the director.","chinese":"他在門口轉悠了一整天，企望有機會同局長談談。"},{"english":"On my first day I wandered around for twenty minutes before I could find the copy room.","chinese":"第一天上班我轉悠了20分鐘才找到複印室在哪裏。"},{"english":"Originally think that I got news to specially go to in garden and turn leisurely today yesterday.","chinese":"原來以爲我是昨日得了消息今日特地去園子裏轉悠。"},{"english":"Yesterday we tooted around Nottingham in our car.","chinese":"昨天我們開着車在諾丁漢轉悠。"},{"english":"Yesterday we tootled around Nottingham in our car.","chinese":"昨天我們開着車在諾丁漢轉悠。"},{"english":"I walked around for a couple days. Eventually, I flew home.","chinese":"我就那麼轉悠了幾天，最後，就飛回去了。"},{"english":"A whole have their own like a gyroscope, around the day and night.","chinese":"一個個都把自己整得像個陀螺，沒日沒夜的轉悠。"},{"english":"Do you not see how the blackbird Walks around the feet Of the women about you?","chinese":"您沒看見黑鸝麼？它正在你身旁女人的腳邊轉悠。"}],"related":[]}