{"definition":["turning point\/breaking point"],"pinyin":["zhuan3 zhe2 dian3"],"simplified":["转折点"],"rank":13162.0,"normalized_rank":0.18415345655002588,"fraction":0.00000523271401249282,"cumulative_fraction":0.9504989324274392,"word":"轉折點","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["to break (e.g. stick or bone)\/a loss","to break\/to fracture\/to snap\/to suffer loss\/to bend\/to twist\/to turn\/to change direction\/convinced\/to convert into (currency)\/discount\/rebate\/tenth (in price)\/classifier for theatrical scenes\/to fold\/accounts book","to turn sth over\/to turn upside down\/to tip sth out (of a container)"],"pinyin":["she2","zhe1","zhe2"],"word":"折"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[],"sentences":[{"english":"The turning point of the Ming Dynasty from prosperity to decline was the reign of Emperor Shenzong.","chinese":"明朝由盛到衰的轉折點是明神宗的統治。"},{"english":"Stocks are slightly lower as investors weigh up the chances of whether this is a major turning point.","chinese":"投資者考量這是一個重要轉折點的機率，股市小跌。"},{"english":"The turning point in Saudi policy came in the spring of 2002.","chinese":"沙特阿拉伯政策的轉折點是2002年春天。"},{"english":"Valley Forge was a turning point in the American Revolution.","chinese":"弗吉谷是美國革命史上的轉折點。"},{"english":"The results show saddle-node bifurcation arises in the turning point of amplitude-frequency curve.","chinese":"研究結果表明幅頻曲線轉折點出現鞍結分叉。"},{"english":"Revolution of the Xinhai Year was the turning point to the national industry in Zhejiang.","chinese":"辛亥革命對浙江的民族工業來說是一個重要的轉折點。"},{"english":"“This was a very important turning point for China’s economy, ” he says.","chinese":"吳說，“這份報告是中國經濟的一個重要轉折點”。"},{"english":"Was that something of a watershed for Spanish football?","chinese":"可以認爲那是西班牙足球的轉折點嗎？"},{"english":"\"Close to a tipping point the system becomes more inert, \" Scheffer said.","chinese":"系統接近轉折點時，會變得更加遲鈍。"},{"english":"But eventually, the economy would reach a turning-point.","chinese":"但是最後，經濟會到達一個轉折點。"},{"english":"This is a major turning point.","chinese":"這是一個重大的轉折點。"},{"english":"It was also the turning point for the Irish Brigade.","chinese":"同樣地，這也是愛爾蘭旅的轉折點。"},{"english":"It is one of the biggest turnarounds in history.","chinese":"這可以說是歷史上最大的轉折點之一。"},{"english":"The international experience indicates that China starts to experience the Lewisian Turing Point.","chinese":"國際經驗表明我國開始進入劉易斯轉折點。"},{"english":"The Islamic Revolution serves as the turning point in America's nuclear policy toward Iran.","chinese":"伊斯蘭革命成爲美國伊核政策的轉折點。"},{"english":"We also find that the turning points in these inverted U-shaped relationships vary for different pollutants.","chinese":"並且證實不同的環境質量指標對應於不同的轉折點。"}],"related":[{"definition":["turning point"],"pinyin":["zhuan3 lie4 dian3"],"word":"轉捩點"},{"definition":["to transform\/to change"],"pinyin":["bian4 ge2"],"word":"變革"},{"definition":["to indicate\/to foretell\/to forebode\/to betoken"],"pinyin":["yu4 shi4"],"word":"預示"},{"definition":["start\/beginning"],"pinyin":["kai1 duan1"],"word":"開端"},{"definition":["shift in the trend of events\/turnaround\/plot shift in a book\/turn in the conversation"],"pinyin":["zhuan3 zhe2"],"word":"轉折"},{"definition":["node"],"pinyin":["jie2 dian3"],"word":"節點"},{"definition":["end\/conclusion\/to come to an end\/to terminate (sth)"],"pinyin":["zhong1 jie2"],"word":"終結"},{"definition":["task\/problem\/issue"],"pinyin":["ke4 ti2"],"word":"課題"},{"definition":["dividing range\/drainage divide\/(fig.) dividing line\/watershed"],"pinyin":["fen1 shui3 ling3"],"word":"分水嶺"},{"definition":["creed\/article of faith"],"pinyin":["xin4 tiao2"],"word":"信條"},{"definition":["stumbling block\/obstacle\/someone who gets in your way"],"pinyin":["ban4 jiao3 shi2"],"word":"絆腳石"},{"definition":["self-actualization (psychology)\/self-realization"],"pinyin":["zi4 wo3 shi2 xian4"],"word":"自我實現"},{"definition":["starting point"],"pinyin":["qi3 dian3"],"word":"起點"},{"definition":["opportunity\/turning point\/juncture"],"pinyin":["qi4 ji1"],"word":"契機"},{"definition":["21st century"],"pinyin":["er4 shi2 yi1 shi4 ji4"],"word":"二十一世紀"},{"definition":["critical point\/boundary point"],"pinyin":["lin2 jie4 dian3"],"word":"臨界點"}]}