{"definition":["transferred meaning"],"pinyin":["zhuan3 yi4"],"simplified":["转义"],"rank":59506.0,"normalized_rank":0.8325661438585201,"fraction":4.496110907347511e-8,"cumulative_fraction":0.9997935279307648,"word":"轉義","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["Yi4","yi4"],"word":"義"}],"containing_words":[],"sentences":[{"english":"The character which when preceded by an escape character represents any non-upper case character.","chinese":"前跟轉義字符用於表示任意非大寫字母的字符。"},{"english":"The character which when preceded by an escape character represents the word-end boundary assertion.","chinese":"前跟轉義字符用於判斷單詞結束邊界的字符。"},{"english":"The character which when preceded by an escape character represents a non-word character.","chinese":"前跟轉義字符用於表示任意非單詞字符的字符。"},{"english":"The expect and reply strings may contain escape sequences.","chinese":"期待以及回覆字串可以包含轉義序列。"},{"english":"Post-processor bug fix for escaped XML code that it does not recognize.","chinese":"對於不被公認的轉義XML的後處理中的缺陷修正。"},{"english":"The character which when preceded by an escape character represents any non-space character.","chinese":"前跟轉義字符用於表示任意非空白字符的字符。"},{"english":"Characters are escaped with a backslash automatically.","chinese":"字元都會被自動加上一個反斜線進行轉義。"},{"english":"Single quotation marks interpolate and see the backslashes as escape characters.","chinese":"單引號插入並將反斜槓看作是轉義符。"},{"english":"It must be escaped in basic syntax.","chinese":"在基本語法中它必須轉義。"},{"english":"This happens when one escapes text that has already been escaped.","chinese":"如果轉義已經轉義的文本就會出現這種情況。"},{"english":"This happens when one escapes text that has already been escaped.","chinese":"如果轉義已經轉義的文本就會出現這種情況。"},{"english":"Any special character preceded by an escape shall match itself.","chinese":"肆意特殊字符前邊加轉義符都般配本身。"},{"english":"Specifies an escape character that is used to indicate that a parameter marker character in a name is meant literally.","chinese":"指定用於表示名稱中參數標記原義的轉義符。"},{"english":"The character which when preceded by an escape character represents any non-lower case character.","chinese":"前跟轉義字符用於表示任意非小寫字母的字符。"},{"english":"The character which when preceded by an escape character represents the end quote operator.","chinese":"前跟轉義字符用於標識引用操作符結束的字符。"},{"english":"Use escape sequences to manage long input.","chinese":"使用轉義序列來管理較長的輸入。"}],"related":[]}