{"definition":["to pass on to"],"pinyin":["zhuan3 gei3"],"simplified":["转给"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"轉給","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["to supply\/to provide","to\/for\/for the benefit of\/to give\/to allow\/to do sth (for sb)\/(grammatical equivalent of 被)\/(grammatical equivalent of 把)\/(sentence intensifier)"],"pinyin":["gei3","ji3"],"word":"給"}],"containing_words":[],"sentences":[{"english":"This is Mr. Tian speaking. Could you connect me with Mr. Brown?","chinese":"我是田先生，你能轉給布朗先生嗎？"},{"english":"He said that a countrywoman had brought it and asked him to give it to me.","chinese":"他說是一個鄉下婦女送來，託他轉給我的。"},{"english":"Responsibility for tackling smuggling will soon pass to the UK Borders Agency.","chinese":"跟蹤走私的責任很快將轉給英國海關機構。"},{"english":"Talking of Captain Leclere, has not Dantès given you a letter from him?","chinese":"說到萊克勒船長，唐太斯沒有把一封他的信轉給你嗎？"},{"english":"Tencent declined to comment and referred all questions to GaoPeng.","chinese":"騰訊拒絕評論，並將所有問題轉給高朋。"},{"english":"The Department of Parks and Recreation referred calls about the attack to the police.","chinese":"公園相關部門已將此次襲擊有關的舉報電話轉給警方。"},{"english":"I’ll switch you over to Mr. Clark.","chinese":"我將您的電話轉給克拉克先生。"},{"english":"I“‘ll transfer your call.","chinese":"我把電話轉給負責人。"},{"english":"Is informed the case already to forward to Nanjing the Bureau of industry and commerce to process.","chinese":"被告知案子已經轉給南京市工商局處理。"},{"english":"He will come and kill those tenants and give the vineyard to others.","chinese":"他要來除滅那些園戶，將葡萄園轉給別人。"},{"english":"Please wait and I'll connect you to Ms. Almay.","chinese":"請稍等，我幫您轉給艾爾媚女士。"},{"english":"And in the following winter this player was offloaded to Dynamo Kiev.","chinese":"而在接下來的冬天這名球員就被轉給了基輔迪那摩。"},{"english":"Could you put me through to Customer Service?","chinese":"您可以幫我轉給客服部嗎？"},{"english":"I'll switch your call to Mr. Lin.","chinese":"我把你的電話轉給林西席。"},{"english":"Once the kernel is loaded, the bootloader transfers control to the kernel.","chinese":"一旦裝入了內核，引導裝載程序就將控制轉給內核。"},{"english":"Select which account do you want to send money from and to.","chinese":"選擇你有從哪個賬戶轉錢同轉給誰。"}],"related":[]}