{"definition":["torque"],"pinyin":["zhuan4 ju3"],"simplified":["转矩"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"轉矩","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["carpenter's square\/rule\/regulation\/pattern\/to carve"],"pinyin":["ju3"],"word":"矩"}],"containing_words":[{"definition":["torque arm"],"pinyin":["zhuan4 ju3 bi4"],"word":"轉矩臂"}],"sentences":[{"english":"Dynamic and thermal brake torque characteristics of the larger.","chinese":"熱動和制動轉矩較大等優良的特性。"},{"english":"A theoretical study on the determination of the torque distribution ratio in transfer case is conducted.","chinese":"提出了分動器轉矩分配比確定方法。"},{"english":"The speed estimation is core question of the speed sensorless direct torque control system.","chinese":"速度辨識是無速度傳感器直接轉矩控制的核心問題。"},{"english":"Another kind requests the motor output low torque, maintains the high speed.","chinese":"另一種是要求馬達輸出小轉矩，保持高轉速。"},{"english":"Torque on a Magnetic Dipole in a Constant Field.","chinese":"穩恆磁場中磁偶極子的轉矩。"},{"english":"At present, because of the application of computer, the performance of torque measuring instrument has been improved greatly.","chinese":"目前，由於微機的應用，轉矩測量儀性能大大提高。"},{"english":"The torque rheometer is an ideal instrument used to study flowing property of polymer material.","chinese":"轉矩流變儀是研究材料流變性能的重要儀器。"},{"english":"These advantages make Synchron Motors ideally suited for a broad range of speeds with light to moderate torque loads.","chinese":"這些優勢使其成爲輕，中度轉矩負載應用的理想選擇。"},{"english":"The torque sensor, which is capable of detecting the cutting torque without contact, is developed.","chinese":"開發了不用接觸就能測得銑削扭矩的轉矩傳感器。"},{"english":"The low-velocity friction torque model proposed in this paper conformed well to the experimental results.","chinese":"所建立的低速摩擦轉矩模型與實驗結果基本一致。"},{"english":"The torque ripple could be significantly reduced by SVM-based DTC scheme.","chinese":"基於SVM的DTC方案可以有效地減小轉矩波動。"},{"english":"This thesis research the direct torque control of square-wave brushless DC motor.","chinese":"本文主要研究方波無刷直流電機的直接轉矩控制。"},{"english":"Formulas are derived for calculating running and starting capacitance.","chinese":"以最大起動轉矩爲條件，導出了起動電容計算公式。"},{"english":"The armature voltage and external load torque are inputs to the system.","chinese":"電樞電壓和外負載轉矩是系統的輸入。"},{"english":"External torques arise from outside the system.","chinese":"外轉矩是由系統外部生產的。"},{"english":"Cogging torque is one of the main concerns of permanent magnet motor.","chinese":"齒槽轉矩削弱是永磁電機研究的重點和難點之一。"}],"related":[]}