{"definition":["converter (rotary furnace in steelmaking)"],"pinyin":["zhuan4 lu2"],"simplified":["转炉"],"rank":32701.0,"normalized_rank":0.4575294167028108,"fraction":7.409824339511677e-7,"cumulative_fraction":0.9925053657248112,"word":"轉爐","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["stove\/furnace"],"pinyin":["lu2"],"word":"爐"}],"containing_words":[],"sentences":[{"english":"Steel making in the open-hearth furnace is a very slow process, much slower than the Bessemer one.","chinese":"平爐鍊鋼是一個很慢的過程，比轉爐鍊鋼慢得多。"},{"english":"The abrasive grit we get is prime material for electric steelmaking and converter.","chinese":"這種鐵粒可作爲轉爐和電爐鍊鋼的優質原料。"},{"english":"Free CaO is the main factor affecting the distensibility of slag.","chinese":"遊離氧化鈣是造成轉爐渣膨脹的主要因素。"},{"english":"TSO, TSC is a compound probe best-suited to dynamic control.","chinese":"TSC副槍是用於氧氣轉爐動態控制用的複合探頭。"},{"english":"The converter sludges come out of the dedusting system during the production of steel making.","chinese":"轉爐煙塵是鍊鋼生產過程中排出的含鐵粉塵。"},{"english":"The practice of production with reduced hot metal consumption of the converter concast route at Handan Iron & Steel Group Co. is introduced.","chinese":"介紹了邯鋼降低轉爐連鑄鋼鐵料消耗的生產實踐。"},{"english":"The problems in the scrubbing water treatment system of converter flue gas of Xiangtan Iron & Steel Co. Ltd.","chinese":"介紹了湘鋼轉爐煙氣除塵水處理系統存在的問題。"},{"english":"The framework of converter puncher is analyzed by fatigue analyzing.","chinese":"對轉爐捅風眼機機架進行疲勞分析。"},{"english":"The behaviour of the vanadium bearing slag in smelting process has been discussed.","chinese":"討論了含釩轉爐渣在鍊鋼過程中的行爲。"},{"english":"Melting behavior of silica flux in the converting process of high grade copper matte was investigated.","chinese":"研究了高品位銅冰銅轉爐吹煉石英熔劑熔化行爲。"},{"english":"The experiences to use converter gas in heating furnace of the rod rolling mill in Tangshan Iron and Steel Company are introduced.","chinese":"介紹了唐鋼棒材軋鋼加熱爐燒轉爐煤氣的經驗。"},{"english":"The key technologies for production of special steel in a converter are also described.","chinese":"對轉爐特殊鋼生產工藝的技術關鍵進行了論述。"},{"english":"The technical features of 100t converter and wide and heavy continuous casting slab system were introduced.","chinese":"介紹柳鋼100噸轉爐及寬厚板坯連鑄系統技術特點。"},{"english":"The practical production show that the converter gas can be used in reheating furnace of steel rolling.","chinese":"實踐證明，軋鋼加熱爐使用轉爐煤氣是可行的。"},{"english":"Slag splashing is effective in extending the lining life.","chinese":"濺渣護爐技術是提高轉爐爐齡的有效措施。"},{"english":"Necessity of slag detection during tapping steel for basic oxygen converter is discussed.","chinese":"主要敘述轉爐出鋼檢測夾渣的必要性。"}],"related":[]}