{"definition":["to shift\/to divert or distract (attention etc)\/to change\/to transform\/metastasis (medicine)\/to evacuate (people)"],"pinyin":["zhuan3 yi2"],"simplified":["转移"],"rank":1768.0,"normalized_rank":0.024736613826200102,"fraction":0.00008875133160189066,"cumulative_fraction":0.711320280146195,"word":"轉移","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["to move\/to shift\/to change\/to alter\/to remove"],"pinyin":["yi2"],"word":"移"}],"containing_words":[{"definition":["to move one's base (of operations)\/to reposition\/to relocate"],"pinyin":["zhuan3 yi2 zhen4 di4"],"word":"轉移陣地"},{"definition":["mass transfer (in LED panel manufacturing)"],"pinyin":["ju4 liang4 zhuan3 yi2"],"word":"巨量轉移"},{"definition":["teleportation"],"pinyin":["shun4 jian1 zhuan3 yi2"],"word":"瞬間轉移"},{"definition":["to relocate\/to evacuate"],"pinyin":["zhuan3 yi2 an1 zhi4"],"word":"轉移安置"},{"definition":["transfer payment (payment from government or private sector for which no good or service is required in return)"],"pinyin":["zhuan3 yi2 zhi1 fu4"],"word":"轉移支付"},{"definition":["to shift one's eyes\/(fig.) to shift one's attention\/to divert attention"],"pinyin":["zhuan3 yi2 shi4 xian4"],"word":"轉移視線"},{"definition":["metastasis"],"pinyin":["yuan3 duan1 zhuan3 yi2"],"word":"遠端轉移"}],"sentences":[{"english":"The results indicated that interfacial charge transfer may be the rate limiting step.","chinese":"分析表明界面的電荷轉移是反應的速度控制步。"},{"english":"Transom mand cockpit components sorted and being moved to the boat.","chinese":"橫樑和駕駛艙部分排序和被轉移到小船。"},{"english":"He brought the subject to those who were agitating for a raise in their company.","chinese":"他把話題轉移到公司裏鬧着要加薪的那幫人身上。"},{"english":"In an information-based world, power diffusion may pose a bigger danger than power transition.","chinese":"在信息化世界，權力擴散比權力轉移更危險。"},{"english":"The research could lead to new therapies for preventing cancer metastasis.","chinese":"這項研究將會引發癌轉移的新療法。"},{"english":"There, robotic arms transfer the fuel into storage cassettes underwater.","chinese":"在那裏，機器手臂將燃料轉移到水下的儲藏容器裏。"},{"english":"Similar shifts occurred in other crisis-hit countries.","chinese":"在其它受危機打擊的國家也出現了類似的轉移。"},{"english":"Eliminating problem by transferring the blame to others is often called scape-goating.","chinese":"消除問題靠轉移指責給別人常常被叫做替罪羊現象。"},{"english":"It was due to energy or charge transfer within the clusters.","chinese":"它起因於分子團內部的能量或電荷轉移。"},{"english":"Application of quadrupole mass-spectrometer in the transfer system for photocathode manufacturing(PC) is introduced.","chinese":"介紹了四極質譜儀在光陰極轉移系統中的應用。"},{"english":"The mechanism of corrosion inhibition has been explained from the point of view of electron transfer.","chinese":"從電子轉移的角度說明了含氮有機化合物的緩蝕機理。"},{"english":"The main cause of treatment failure was local recurrence and distant metastasis.","chinese":"局部復發和遠處轉移是治療失敗的主要原因。"},{"english":"You already know that my diversion is ironing.","chinese":"你已經知道了，我自己轉移注意力的方法就是熨衣服。"},{"english":"We report a case pre-senting as abdominal masses with unilateral pleural seeding.","chinese":"我們要報告一例以腹部腫瘤表現並單側肋膜轉移。"},{"english":"This forum conduct and actions divides into section the forum disallows to transfer.","chinese":"本論壇作爲分類論壇不允許轉移。"},{"english":"The nightclub has a landfill diversion rate of 89 percent.","chinese":"這家夜總會的垃圾填埋轉移率達到89%。"}],"related":[{"definition":["to change\/to transform\/shift\/transformation\/CL:個|个[ge4]"],"pinyin":["zhuan3 bian4"],"word":"轉變"},{"definition":["to extend\/to expand\/extension\/expansion"],"pinyin":["kuo4 zhan3"],"word":"擴展"},{"definition":["to change\/to transform\/isomerization (chemistry)"],"pinyin":["zhuan3 hua4"],"word":"轉化"},{"definition":["to expand\/to enlarge\/to broaden one's scope"],"pinyin":["kuo4 da4"],"word":"擴大"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"發展"},{"definition":["to handle\/to treat\/to deal with\/to process\/to deal with a criminal case\/to mete out punishment\/to offer for sale at a reduced price\/to punish"],"pinyin":["chu3 li3"],"word":"處理"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"},{"definition":["to spread\/to proliferate\/to diffuse\/spread\/proliferation\/diffusion"],"pinyin":["kuo4 san4"],"word":"擴散"},{"definition":["to change direction\/fig. to change one's stance","to get lost\/to lose one's way"],"pinyin":["zhuan3 xiang4","zhuan4 xiang4"],"word":"轉向"},{"definition":["one step further\/to move forward a step\/further onwards"],"pinyin":["jin4 yi1 bu4"],"word":"進一步"},{"definition":["to achieve\/to implement\/to realize\/to bring about"],"pinyin":["shi2 xian4"],"word":"實現"},{"definition":["property\/assets"],"pinyin":["zi1 chan3"],"word":"資產"},{"definition":["general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead","to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])"],"pinyin":["jiang1","jiang4","qiang1"],"word":"將"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"},{"definition":["to guide\/to lead (around)\/to conduct\/to boot\/introduction\/primer"],"pinyin":["yin3 dao3"],"word":"引導"},{"definition":["gradually"],"pinyin":["zhu2 jian4"],"word":"逐漸"}]}