{"definition":["axis of rotation"],"pinyin":["zhuan4 zhou2"],"simplified":["转轴"],"rank":29170.0,"normalized_rank":0.4081261455374757,"fraction":0.0000010120628870337756,"cumulative_fraction":0.9894317012494088,"word":"轉軸","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["axis\/axle\/spool (for thread)\/roller (for scrolls)\/classifier for calligraphy rolls etc","see 壓軸戲|压轴戏[ya1 zhou4 xi4]\/Taiwan pr. [zhou2]"],"pinyin":["zhou2","zhou4"],"word":"軸"}],"containing_words":[{"definition":["axis of rotation"],"pinyin":["xuan2 zhuan3 zhou2"],"word":"旋轉軸"},{"definition":["axis of rotation"],"pinyin":["zi4 zhuan4 zhou2"],"word":"自轉軸"},{"definition":["erhua variant of 轉軸|转轴[zhuan4 zhou2]"],"pinyin":["zhuan4 zhou2 'r"],"word":"轉軸兒"}],"sentences":[{"english":"The main rotary shaft can be simultaneously fixed with a plurality of circular discs with self rotation shafts.","chinese":"主轉軸上可同時固定多個帶自轉軸的圓盤。"},{"english":"The main rotary shaft can be simultaneously fixed with a plurality of circular discs with self rotation shafts.","chinese":"主轉軸上可同時固定多個帶自轉軸的圓盤。"},{"english":"The hydraulic pressure revolution axis design thickens the plate, the anti-collision, is not easy to distort.","chinese":"液壓轉軸設計加厚板材，抗碰撞，不易變形。"},{"english":"The axis of rotation and its support are part of the central pedestal.","chinese":"旋轉軸和它的支撐結構是中央操作檯的一部分。"},{"english":"The North Pole is the spot on Earth’s globe that marks the northern end of an imaginary stick Earth spins around.","chinese":"北極是地球表面與假想的自轉軸相交的北交點。"},{"english":"The shape of the molecule of the compound is in chain configuration having diad axis.","chinese":"該化合物分子爲鏈狀結構，具有2次旋轉軸。"},{"english":"The energy in the wind turns two or three propeller-like blades around a rotor.","chinese":"風力推動固定在轉軸上兩三個像推進器一樣的葉片。"},{"english":"But it turns once on its axis in 24 hours.","chinese":"但是它繞着自轉軸運轉一週需要24小時。"},{"english":"The starter drive gear is mounted on the armature shaft.","chinese":"啓動機驅動安裝在電樞轉軸上的齒輪。"},{"english":"The research then focuses on the mechanism which a pivot can resist external torques at arbitrary position.","chinese":"其次探討當此轉軸靜止時抵抗外加扭矩之機制。"},{"english":"EDIT: Later I understood that G2A compresses dynamic range significantly.","chinese":"隨後我意識到活動的轉軸貢獻很大。"},{"english":"A method of infrared short range telemetry for torque measurement of rotating shaft is stated.","chinese":"提出一種對旋轉軸扭矩測試的紅外近程遙測法。"},{"english":"The top of the outer pipe is furled through a movable rotating shaft.","chinese":"外管頂部通過活動轉軸收合。"},{"english":"Commonly, hard disks have several disk platters mounted on a single central spindle.","chinese":"通常硬盤有幾個安放在一根中央轉軸上的碟盤。"},{"english":"Hold the spinning Bicycle Wheel Gyroscope with its axis horizontal.","chinese":"手上拿著車輪迴旋儀並保持它的轉軸水平。"},{"english":"This conclusion is consistent with the hypothesis that the rotational axis of the minor planet has no precession.","chinese":"這個結論和小行星自轉軸不進動的假定是一致的。"}],"related":[]}