{"definition":["to transfer ships"],"pinyin":["zhuan3 chuan2"],"simplified":["转船"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"轉船","characters":[{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"},{"definition":["boat\/vessel\/ship\/CL:條|条[tiao2],艘[sou1],隻|只[zhi1]"],"pinyin":["chuan2"],"word":"船"}],"containing_words":[],"sentences":[{"english":"You want to have your goods shipped from Swatow to Osaka via HongKong, where they can be transshipped .","chinese":"你想通過香港把貨從汕頭運到大阪，在香港轉船。"},{"english":"This then allows for direct shipments and eliminates transshipping of the product.","chinese":"這樣就可以直接裝船運送產品，而不需轉船。"},{"english":"The goods wil, be transhippedkin Hong Kong.","chinese":"貨物將在香港轉船。"},{"english":"No direct liner are available, we shall transship the goods to ensure timely delivery.","chinese":"爲保證及時交貨，如果沒有直達班輪，我們將轉船。"},{"english":"For example, \"From Qingdao to Helsinki W\/T (with transshipment) Hong Kong by Vessel\".","chinese":"如“通過船運，從青島經香港轉船發往赫爾辛基”。"},{"english":"We don't have liners to China, we must transship the goods at Sydney.","chinese":"我們沒有開往中國的航班，貨物必須在悉尼轉船。"},{"english":"So far as I know， there are risks of pilferage or damage to the goods during transshipment in Hongkong.","chinese":"據我所知，在香港轉船期間有貨物被盜或損壞的風險。"},{"english":"The goods will be transshipped in Hong Kong.","chinese":"貨物將在香港轉船。"},{"english":"On perusal, we find that transshipment and partial shipment are not allowed.","chinese":"在詳閱後，我們發現不允許轉船和分批裝運。"},{"english":"On account of lack of direct steamer, please allow transhipment in your L\/C.","chinese":"因爲沒有直達船，在你的信用證中請註明准許轉船。"},{"english":"Please amend the L\/C to read Partial shipments and transhipment allowed.","chinese":"請將信用證改削爲許可分批裝運和轉船。"},{"english":"They are to be transshipped at Singapore and are expected to reach your port early next month.","chinese":"此貨物將在新加坡轉船，預定於下月到達你方港口。"},{"english":"Maybe you are right, but the goods are to be transshipped at New.","chinese":"可能您是對的，但貨物要在紐約或舊金山轉船。"},{"english":"The goods will be transhipped in Hong Kong.","chinese":"貨品將在噴鼻港轉船。"},{"english":"If transshipment is allowed, the port of transshipment is marked.","chinese":"如果允許轉船，應標明轉運港。"},{"english":"There are risks of damage to the goods during transshipment.","chinese":"在轉船期間有貨物被損壞的風險。"}],"related":[]}