{"definition":["bombard"],"pinyin":["hong1 ji1"],"simplified":["轰击"],"rank":33775.0,"normalized_rank":0.4725560701243826,"fraction":6.733947927140931e-7,"cumulative_fraction":0.9932648787046956,"word":"轟擊","characters":[{"definition":["explosion\/bang\/boom\/rumble\/to attack\/to shoo away\/to expel"],"pinyin":["hong1"],"word":"轟"},{"definition":["to hit\/to strike\/to break\/Taiwan pr. [ji2]"],"pinyin":["ji1"],"word":"擊"}],"containing_words":[{"definition":["proton bombardment"],"pinyin":["zhi4 zi3 hong1 ji1"],"word":"質子轟擊"}],"sentences":[{"english":"The city was bombarded with enemy shells for a whole day.","chinese":"該城被敵人炮火轟擊了整整一天。"},{"english":"Can understand the meaning of bombardment degassing , we know why.","chinese":"只要明白轟擊去氣的含義，我們就知道爲什麼了。"},{"english":"Let's see you avoid a blast from my Synchro Cannon.","chinese":"讓我看看你們能不能逃過我的同步炮的轟擊。"},{"english":"Enemy fire battered the walls of the fort.","chinese":"敵人炮火轟擊城堡的圍牆。"},{"english":"It is unfavorable to study MS of aminoglycosides using electron impact ionization.","chinese":"使用電子轟擊離子化方法研究氨基糖甙類是不理想的。"},{"english":"The mechanism of negative-ion-sulfurizing was also discussed in this paper.","chinese":"本文還對負離子轟擊滲硫的機理進行了探討。"},{"english":"Density of fire increases proportionably to the curiousness of the target.","chinese":"火力的密度與轟擊目標的謹慎度成正比。"},{"english":"They heard the guns blasting away all night.","chinese":"他們聽見槍炮整夜連續轟擊。"},{"english":"The little town was bombarded with enemy shells for a whole week.","chinese":"這個小城被敵人的炮火轟擊了整整一個星期。"},{"english":"Bushman also had the students blast each other with loud noises.","chinese":"布什曼也讓學生們用強噪音轟擊彼此。"},{"english":"It thundered at the town, and thundered at the cliffs, and brought the coast down, madly .","chinese":"它大聲恐嚇城市，轟擊懸崖，而且瘋狂地打壞堤岸。"},{"english":"“It’s a double anti-whammy, ” he said.","chinese":"利維森博士稱這是一個雙重反轟擊防禦系統。"},{"english":"In x-ray crystallography, crystals of protein are bombarded with intense x-ray beams.","chinese":"在X射線結晶中用強脈衝X射線束轟擊蛋白晶體。"},{"english":"Heavy guns have to be bedded in before they will fire accurately.","chinese":"大炮必須事先固定炮位，方能準確轟擊目標。"},{"english":"The laser caused the atoms to generate bursts of gold plasmons.","chinese":"激光轟擊材料產生金原子等離子體。"},{"english":"Flak hails on the plane.","chinese":"高射炮火像雹子般轟擊飛機。"}],"related":[]}