{"definition":["to manage well"],"pinyin":["ban4 hao3"],"simplified":["办好"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"辦好","characters":[{"definition":["to do\/to manage\/to handle\/to go about\/to run\/to set up\/to deal with"],"pinyin":["ban4"],"word":"辦"},{"definition":["good\/well\/proper\/good to\/easy to\/very\/so\/(suffix indicating completion or readiness)\/(of two people) close\/on intimate terms\/(after a personal pronoun) hello","to be fond of\/to have a tendency to\/to be prone to"],"pinyin":["hao3","hao4"],"word":"好"}],"containing_words":[],"sentences":[{"english":"Had done, it is its devoir.","chinese":"辦好了，是它的本分。"},{"english":"I guarantee that you'll like this book.","chinese":"我管保這件事情能辦好。"},{"english":"First, countries should, first and foremost, run their own affairs well.","chinese":"第一，各國首先要把自己的事情辦好。"},{"english":"Actually manage the existing foreign-invested enterprises well.","chinese":"切實辦好現有外商投資企業。"},{"english":"He gave his solemn promise to do better.","chinese":"他莊重地保證把事情辦好。"},{"english":"I hope you can hold this case down like David.","chinese":"我希望你能像大衛那樣把這個案子順利地辦好。"},{"english":"You've sold your house before you've got your emigration clearance to go to Australia?","chinese":"你還沒辦好去澳大利亞的移民簽證就把房子賣了？"},{"english":"Get the job done in three days.","chinese":"盡着三天把事情辦好。"},{"english":"Host the grand sporting event well. Develop Hainan province intoaharmonious and prosperous special economic zone.","chinese":"辦好品牌賽事，繁榮特區經濟，構建和諧海南。"},{"english":"Do you cooperate with coworkers to get things done?","chinese":"你是否能和同事齊心協力將事情辦好？"},{"english":"As soon as they returned home, the marriage was concluded.","chinese":"他們回家後很快就辦好了婚事。"},{"english":"Travel agencies can complete the procedures even faster.","chinese":"旅行社可以較快地辦好這些手續。"},{"english":"African Commodities Exhibitions shall be organized well to enlarge the two-way flow of goods.","chinese":"辦好非洲商品展覽會，擴大雙向貨物貿易。"},{"english":"There are some people who believe that if you want something done right, you’d better do it yourself.","chinese":"有些人認爲想把事辦好就得親自動手。"},{"english":"Is he drawing back before the good which he can do?","chinese":"在能辦好事時難道可以退卻嗎？"},{"english":"In China, people buy things for the Spring Festival one month ahead of the year.","chinese":"中國人習慣在春節前一個月就辦好年貨。"}],"related":[]}