{"definition":["to accomplish\/to get sth done"],"pinyin":["ban4 dao4"],"simplified":["办到"],"rank":22603.0,"normalized_rank":0.31624529542624485,"fraction":0.0000018518721743704715,"cumulative_fraction":0.9803162341737912,"word":"辦到","characters":[{"definition":["to do\/to manage\/to handle\/to go about\/to run\/to set up\/to deal with"],"pinyin":["ban4"],"word":"辦"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"}],"containing_words":[],"sentences":[{"english":"B: That's fine. I can make it.","chinese":"好的，我能辦到。"},{"english":"You may be able to do these things if you build a big chest.","chinese":"或許當你練出了強大的胸肌後你就能辦到了。"},{"english":"Can I get a Half year & Multi-entry Business (F) visa inside of China?","chinese":"本人能辦到在華半年內屢次貿易入出境有效簽證麼？"},{"english":"Thank god,I made it.","chinese":"感謝上帝，我辦到了。"},{"english":"The old squad leader is a man of his word; he never makes a promise he cannot keep.","chinese":"老班長是說一不二的，他答應的事一定能辦到。"},{"english":"That is why it is unlikely that the bank one's requirement can be achieved.","chinese":"所以某甲的要求是不可能辦到的。"},{"english":"I'm going to get them started on monism if I can.","chinese":"如果能辦到我就設法讓他們談一元論。"},{"english":"The local pilot felt it was an impossible task.","chinese":"當地導航員認爲這是無法辦到的。"},{"english":"And he did it all without steroids.","chinese":"他沒有藉助類固醇便辦到了。"},{"english":"How does he think only the three of us can do it?","chinese":"他怎麼想得出只有我們三個人就能辦到呢？"},{"english":"What I want is to take my bus to school, but at the moment that’s impossible.","chinese":"我真想做的事是坐車去學校，不過這會兒沒法兒辦到。"},{"english":"Within weeks, Ben will be trained to stop nipping, not a likely possibility with a wolf.","chinese":"訓練幾周後，班便不再咬，但狼則不太可能辦到。"},{"english":"Jiangwai has pursuing education's education by establishing overseas schools in China and organizing Jiangwai students to study abroad.","chinese":"把國外的學校辦到中國來，讓江外學子走出國門。"},{"english":"That can be done. I understand you’ll ship the goods before the end of May?","chinese":"沒問題，可以辦到，你們將在5月底前交貨嗎？"},{"english":"But she does it with a lot of help from a nanny.","chinese":"不過，她是在保姆的鼎力相助下才辦到的。"},{"english":"Weeks with the first belief that \"foreigners do something Chinese people will certainly be able to do.\"","chinese":"周同第堅信“外國人辦到的事中國人也一定能辦到”。"}],"related":[]}