{"definition":["holistic diagnosis and treatment (TCM)"],"pinyin":["bian4 zheng4 lun4 zhi4"],"simplified":["辨证论治"],"rank":56508.0,"normalized_rank":0.7906202342143187,"fraction":6.802557411766039e-8,"cumulative_fraction":0.9996258635757094,"word":"辨證論治","characters":[{"definition":["to distinguish\/to recognize"],"pinyin":["bian4"],"word":"辨"},{"definition":["certificate\/proof\/to prove\/to demonstrate\/to confirm\/variant of 症[zheng4]"],"pinyin":["zheng4"],"word":"證"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"論"},{"definition":["to rule\/to govern\/to manage\/to control\/to harness (a river)\/to treat (a disease)\/to wipe out (a pest)\/to punish\/to research"],"pinyin":["zhi4"],"word":"治"}],"containing_words":[],"sentences":[{"english":"The inner treatment pays attention to whole body in accordance and starts from syndrome differentiation and treatment method.","chinese":"內治法從整體觀念著手，以辨證論治爲依歸。"},{"english":"Three problems of treatment based on syndrome differentiation, TBSD are discussed here.","chinese":"着重探討了有關辨證論治的三大問題。"},{"english":"It is indicated that treatment of amenia based on differentiation of syndromes and the endometrial thickness have close correlativity.","chinese":"說明閉經的辨證論治與子宮內膜厚度有密切的相關性。"},{"english":"Therefore it was important to emphasize the role of wind-evil in the pathogenesis of palmus in the syndrome differentiation.","chinese":"在辨證論治的前提下，重視風邪爲患在發病中的作用。"},{"english":"The theoretic system of traditional Chinese medicine is characterized by the concept of organic wholeness and treatment based on syndrome differentiation.","chinese":"中醫學理論體系的基本特點是整體觀和辨證論治。"},{"english":"TCM is characterized by the concept of organic wholeness and treatment based on syndrome differentiation.","chinese":"中醫理論體系的基本特點是整體觀念和辨證論治。"},{"english":"The treatment group were given TCM treatment, and external deposited Reticulitermes external application.","chinese":"治療組採用傳統中醫辨證論治，並配合敷胸散外敷。"},{"english":"Treatment for liver cancer mainly by drying dampness and resolving phlegm.","chinese":"治療肝癌以燥溼化痰爲主進行辨證論治。"},{"english":"This article presents the authors clinical experience int he treatment of diarrhea on syndrome differentiation.","chinese":"結合臨牀經驗論述泄瀉辨證論治的體會。"},{"english":"Clarifying the treatment method to tension-type headache by differentiation of TCM.","chinese":"闡述緊張型頭痛的中醫辨證論治的方法。"},{"english":"To combine treatment based on differentiation of syndromes and specific treatment.","chinese":"辨證論治與獨殊治療相結合。"},{"english":"Syndrome differentiation and treatment should be form five viscera.","chinese":"治療上宜從五臟辨證論治。"}],"related":[{"definition":["interpretation of the cause\/onset and process of an illness\/pathogenesis"],"pinyin":["bing4 ji1"],"word":"病機"},{"definition":["to investigate"],"pinyin":["bian4 zheng4"],"word":"辨證"},{"definition":["twelve channels of TCM"],"pinyin":["shi2 er4 jing1 mai4"],"word":"十二經脈"},{"definition":["to show an effect\/to produce an effect\/a conspicuous effect"],"pinyin":["xian3 xiao4"],"word":"顯效"},{"definition":["treatment involving the use of tonics to restore the patient's health\/reinforcing method (in acupuncture)"],"pinyin":["bu3 fa3"],"word":"補法"},{"definition":["body palpation (diagnostic method in TCM)\/tactile examination"],"pinyin":["chu4 zhen3"],"word":"觸診"},{"definition":["reinforcing and reducing methods (in acupuncture)"],"pinyin":["bu3 xie4"],"word":"補瀉"},{"definition":["prognosis"],"pinyin":["yu4 hou4"],"word":"預後"},{"definition":["correct diagnosis\/to prescribe the right cure for an illness\/to suit the medicine to the illness"],"pinyin":["dui4 zheng4"],"word":"對症"},{"definition":["symptom (of a disease)"],"pinyin":["bing4 zhuang4"],"word":"病狀"},{"definition":["panacea\/cure-all"],"pinyin":["wan4 ling2 dan1"],"word":"萬靈丹"},{"definition":["to treat the symptoms\/reactive (rather than proactive)"],"pinyin":["tou2 tong4 yi1 tou2"],"word":"頭痛醫頭"},{"definition":["Chinese and Western medicine\/a doctor trained in Chinese and Western medicine"],"pinyin":["zhong1 xi1 yi1"],"word":"中西醫"},{"definition":["druggist"],"pinyin":["yao4 shang1"],"word":"藥商"},{"definition":["to take a tonic or nourishing food to build up one's health"],"pinyin":["bu3 yang3"],"word":"補養"},{"definition":["medicinal dietary supplement that helps build up one's health"],"pinyin":["yao4 bu3"],"word":"藥補"}]}