{"definition":["to investigate"],"pinyin":["bian4 zheng4"],"simplified":["辨证"],"rank":35679.0,"normalized_rank":0.49919550039875205,"fraction":5.706265434032928e-7,"cumulative_fraction":0.9944477942441404,"word":"辨證","characters":[{"definition":["to distinguish\/to recognize"],"pinyin":["bian4"],"word":"辨"},{"definition":["certificate\/proof\/to prove\/to demonstrate\/to confirm\/variant of 症[zheng4]"],"pinyin":["zheng4"],"word":"證"}],"containing_words":[{"definition":["diagnosis and treatment based on an overall analysis of the illness and the patient's condition"],"pinyin":["bian4 zheng4 shi1 zhi4"],"word":"辨證施治"},{"definition":["holistic diagnosis and treatment (TCM)"],"pinyin":["bian4 zheng4 lun4 zhi4"],"word":"辨證論治"},{"definition":["pattern-syndrome identification based on the eight principles (TCM)"],"pinyin":["ba1 gang1 bian4 zheng4"],"word":"八綱辨證"}],"sentences":[{"english":"At level seven, one would experience unconditional love and no judgmental thoughts.","chinese":"在第七級別，人就會獲得自由的愛和辨證的思想。"},{"english":"Objective To investigate the effectiveness of treatment based syndrome differentiation for bronchial asthma.","chinese":"目的觀察中醫療法辨證治療支氣管哮喘的療效。"},{"english":"Or, whether it fits for all diseases of internal medicine, not only those caused by exogenous pathogenic agents?","chinese":"六經辨證是否同時既適用於傷寒病又適用於雜病？"},{"english":"This article introduces the clinical experience in the treatment of androgenic alopecia.","chinese":"介紹中醫辨證治療雄激素源性脫髮的臨牀經驗。"},{"english":"Methods:360 plums he spirit the sufferer presses Chinese medicine dialectics the cent type proceed treatment.","chinese":"方法將360例梅核氣患者按中醫辨證分型進行治療。"},{"english":"Combine the industry and markets actual, did the analysis of the dialectics .","chinese":"結合產業與市場實際，做了辨證的分析。"},{"english":"To choose different drugs based on different stages of arthralgia syndrome.","chinese":"根據痹證不同時期的病理特點，提出分期辨證用藥。"},{"english":"The inner treatment pays attention to whole body in accordance and starts from syndrome differentiation and treatment method.","chinese":"內治法從整體觀念著手，以辨證論治爲依歸。"},{"english":"Three problems of treatment based on syndrome differentiation, TBSD are discussed here.","chinese":"着重探討了有關辨證論治的三大問題。"},{"english":"The dialectical materialism philosophic thought is generally implied in theory and practice of accounting.","chinese":"會計理論和實踐中普遍滲透着辨證唯物主義哲學思想。"},{"english":"To evaluate the usability of endoscopy for the diagnosis of rhinorrhea.","chinese":"評價鼻內窺鏡應用於鼻淵辨證施治中的價值。"},{"english":"Objectives To discuss the methods of treating acute cerebral infarction with differentiating cold and heat syndromes.","chinese":"目的探討運用寒熱辨證治療急性腦梗死的方法。"},{"english":"It is indicated that treatment of amenia based on differentiation of syndromes and the endometrial thickness have close correlativity.","chinese":"說明閉經的辨證論治與子宮內膜厚度有密切的相關性。"},{"english":"Objective:Observe dialectics cent the type cures the clinical curative effect of the plum he spirit.","chinese":"目的觀察辨證分型治療梅核氣的臨牀療效。"},{"english":"Therefore it was important to emphasize the role of wind-evil in the pathogenesis of palmus in the syndrome differentiation.","chinese":"在辨證論治的前提下，重視風邪爲患在發病中的作用。"},{"english":"The theoretic system of traditional Chinese medicine is characterized by the concept of organic wholeness and treatment based on syndrome differentiation.","chinese":"中醫學理論體系的基本特點是整體觀和辨證論治。"}],"related":[{"definition":["holistic diagnosis and treatment (TCM)"],"pinyin":["bian4 zheng4 lun4 zhi4"],"word":"辨證論治"},{"definition":["interpretation of the cause\/onset and process of an illness\/pathogenesis"],"pinyin":["bing4 ji1"],"word":"病機"},{"definition":["Chinese and Western medicine\/a doctor trained in Chinese and Western medicine"],"pinyin":["zhong1 xi1 yi1"],"word":"中西醫"},{"definition":["to take a tonic or nourishing food to build up one's health"],"pinyin":["bu3 yang3"],"word":"補養"},{"definition":["correct diagnosis\/to prescribe the right cure for an illness\/to suit the medicine to the illness"],"pinyin":["dui4 zheng4"],"word":"對症"},{"definition":["(TCM) the four methods of diagnosis, namely 望診|望诊[wang4 zhen3] (observation), 聞診|闻诊[wen2 zhen3] (auscultation and olfaction), 問診|问诊[wen4 zhen3] (interrogation), 切診|切诊[qie4 zhen3] (pulse feeling and palpation)"],"pinyin":["si4 zhen3"],"word":"四診"},{"definition":["to investigate\/dialectical"],"pinyin":["bian4 zheng4"],"word":"辯證"},{"definition":["medicinal dietary supplement that helps build up one's health"],"pinyin":["yao4 bu3"],"word":"藥補"},{"definition":["medical knowledge\/principles of medical science"],"pinyin":["yi1 li3"],"word":"醫理"},{"definition":["theoretical foundation"],"pinyin":["li3 lun4 ji1 chu3"],"word":"理論基礎"},{"definition":["food therapy\/treatment via food (TCM)"],"pinyin":["shi2 liao2"],"word":"食療"},{"definition":["condition or type of pulse (in Chinese medicine)"],"pinyin":["mai4 xiang4"],"word":"脈象"},{"definition":["stagnation of 氣|气[qi4] (TCM)"],"pinyin":["qi4 zhi4"],"word":"氣滯"},{"definition":["deficiency of 氣|气[qi4] (TCM)"],"pinyin":["qi4 xu1"],"word":"氣虛"},{"definition":["suboptimal health status"],"pinyin":["ya4 jian4 kang1"],"word":"亞健康"},{"definition":["witch doctor\/medicine man\/shaman"],"pinyin":["wu1 yi1"],"word":"巫醫"}]}