{"definition":["figure of speech"],"pinyin":["ci2 ge2"],"simplified":["辞格"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"辭格","characters":[{"definition":["to resign\/to dismiss\/to decline\/to take leave\/ballad (archaic poetic genre)\/variant of 詞|词[ci2]"],"pinyin":["ci2"],"word":"辭"},{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"}],"containing_words":[{"definition":["figure of speech"],"pinyin":["xiu1 ci2 ge2"],"word":"修辭格"}],"sentences":[{"english":"This paper discusses rhetorical devices of English idioms.","chinese":"本文論述修辭格的英語成語。"},{"english":"Metaphor and metonymy are treated as two different figures of speech in traditional rhetoric.","chinese":"傳統的修辭理論把隱喻和換喻作爲兩個並列的修辭格。"},{"english":"Therefore, the general principle of word order translation should not be applied mechanically to the translation of anticlimax.","chinese":"突降辭格的翻譯不能套用一般的語序翻譯原則。"},{"english":"Oxymoron, as one of English rhetorical devices, is a special language phenomenon in English.","chinese":"英語中的修辭格矛盾修飾法，是一種特殊的語言現象。"},{"english":"Irony is an often used figure of speech.","chinese":"反語是一種常用的修辭格。"},{"english":"Wang, Rongpei. 2000. Studies in English Lexicology.","chinese":"李鑫華，2000，《英語修辭格詳論》。"},{"english":"The figure of speech \"duplication\" has two basic forms: duplicated words and morphological repetition.","chinese":"復疊辭格包括復辭和疊字兩種基本形式。"},{"english":"They play a crux role in creating and applying figures of speech.","chinese":"它們在辭格的形成和運用中起着至關重要的作用。"},{"english":"The powerful functions of rhetorics in the English translation of Chinese economic and trade news headlines are reaffirmed at the end of this essay.","chinese":"肯定修辭格在漢語經貿新聞標題英譯中的強大作用。"},{"english":"As one of the oldest rhetorical devices, tropes are often employed in English news publications.","chinese":"比喻是語言中歷史最悠久的修辭格之一。"},{"english":"This paper tries to search translation strategies of malapropism from Chinese to English by analyzing samples.","chinese":"本文試通過譯法例析探尋飛白辭格的漢英翻譯策略。"},{"english":"Hyperbole is a commonly-used figure of speech.","chinese":"誇張辭格是一種常用的修辭手法。"},{"english":"Parallelism is the most commonly used English speech in one of the figure of speech.","chinese":"排比是演說中英語最常用的修辭格之一。"},{"english":"Antithesis is a figure of speech in rhetoric.","chinese":"對照是修辭學中的一個修辭格。"}],"related":[]}