{"definition":["to argue (that)\/to allege\/to dispute\/to plead (e.g. not guilty)"],"pinyin":["bian4 cheng1"],"simplified":["辩称"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"辯稱","characters":[{"definition":["to dispute\/to debate\/to argue\/to discuss"],"pinyin":["bian4"],"word":"辯"},{"definition":["to fit\/balanced\/suitable","to weigh\/to state\/to name\/name\/appellation\/to praise","variant of 秤[cheng4]\/steelyard"],"pinyin":["chen4","cheng1","cheng4"],"word":"稱"}],"containing_words":[],"sentences":[{"english":"But Myhra argues that the plane was indeed intentionally designed for stealth.","chinese":"但是Myhra辯稱這架飛機確實是爲了隱形而設計。"},{"english":"The Pentagon argued that the United States can do whatever it wants in international waters.","chinese":"五角大樓辯稱美國可以在國際水域做任何事情。"},{"english":"Compartamos also argues that its profits will build a microfinance industry.","chinese":"國民銀行辯稱，其利潤將用來打造小額貸款產業。"},{"english":"They argued in effect better that one should die so that three could survive.","chinese":"辯稱“犧牲一人保全三人“是更好的結果。"},{"english":"Still, Hall argued that the law was constitutional.","chinese":"豪爾還是辯稱該法合憲。"},{"english":"Kim, however, defends Melanie to the officer.","chinese":"然而，金姆，向女警們爲梅勒妮辯稱。"},{"english":"Doctors and parents who support these surgeries claim that the child understands.","chinese":"贊成這些手術的醫生和父母辯稱孩子瞭解一切。"},{"english":"She acknowledged that error and said that \"he had to do a year over\" to cover.","chinese":"她知道馬失前蹄了，辯稱“他確實需要念多一年書”。"},{"english":"Supporters says the corrida is an art form that it is vital to preserve.","chinese":"支持鬥牛者還辯稱鬥牛是一項必須保存的藝術形式。"},{"english":"The robber pled that he was forced to do it.","chinese":"搶匪辯稱他是被迫去搶劫的。"},{"english":"And that's exactly what Dugan's lawyers argued at trial last November.","chinese":"而這正是去年11月杜根的律師在審訊中辯稱的。"},{"english":"But Ezcurra argues that Cancun was built with fatal flaws.","chinese":"不過埃茲柯拉辯稱，坎昆是在致命缺失上建造起來的。"}],"related":[]}