{"definition":["to debate\/to argue"],"pinyin":["bian4 shuo1"],"simplified":["辩说"],"rank":61973.0,"normalized_rank":0.8670826745764135,"fraction":3.0071391133558025e-8,"cumulative_fraction":0.9998851920999386,"word":"辯說","characters":[{"definition":["to dispute\/to debate\/to argue\/to discuss"],"pinyin":["bian4"],"word":"辯"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"}],"containing_words":[],"sentences":[{"english":"Some might argue he needs to make it tough on them.","chinese":"有人可能會辯說他需要也讓他們感到困難。"},{"english":"She contended that sheep do as much damage to the countryside as kangaroos.","chinese":"她力辯說羊對鄉村的危害和袋鼠一樣。"},{"english":"But Riedel contends there are still plenty of opportunities ahead.","chinese":"但裏德爾分辯說，中國還存在着大量的機會。"},{"english":"Other people argue that file sharing should not be illegal.","chinese":"另一些人則爭辯說文件共享不應該是非法的。"},{"english":"I would argue that it does, but I would never get anywhere with that.","chinese":"我想要同她爭辯說有，但卻從來也說不出個所以然。"},{"english":"I couldn't get my point across in the debate.","chinese":"在辯說中我沒有辦法清晰地表明本身的不雅點。"},{"english":"Its supporters have justified the space station as a terminal for the space shuttle.","chinese":"空間站的支持者曾分辯說它是航天飛機的終點站。"},{"english":"He can argue that there is a precedent.","chinese":"多迪克爭辯說曾有先例。"},{"english":"They argue that Jesus ate meat, so meat eating must be OK.","chinese":"他們爭辯說耶穌也喫肉，所以喫肉是可以的。"},{"english":"I am aware that some will argue that the fetus has an inalienable right to life.","chinese":"我很清楚一些人會爭辯說胎兒有不可剝奪的生存權。"},{"english":"Some argue that Japan is an example of a nation-state.","chinese":"有人爭辯說，日本是一個民族國家的例子。"},{"english":"Britain argued that Iran had entered the binding commercial agreement.","chinese":"英國辯說伊朗已經簽訂了約束性商業協議。"},{"english":"You could argue that the user does not need that sort of hand guiding.","chinese":"您可能會爭辯說，用戶不需要這種手把手的指導。"},{"english":"It argues the procedure is effective in reducing repeat offenses.","chinese":"他爭辯說這項實施有效地減少了重新犯罪。"},{"english":"People wiser than I would care to argue with often say that extreme emotions cannot be sustained for long.","chinese":"比我聰明的人也許會爭辯說，濃情並不能持久。"}],"related":[]}