{"definition":["peasant revolt"],"pinyin":["nong2 min2 qi3 yi4"],"simplified":["农民起义"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"農民起義","characters":[{"definition":["peasant\/to farm\/agriculture\/diligent (old)\/government field official (old)","surname Nong"],"pinyin":["Nong2","nong2"],"word":"農"},{"definition":["surname Min","the people\/nationality\/citizen"],"pinyin":["Min2","min2"],"word":"民"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"},{"definition":["justice\/righteousness\/meaning\/foster (father etc)\/adopted\/artificial (tooth, limb etc)\/relationship\/friendship","surname Yi\/(Tw) abbr. for 義大利|义大利[Yi4 da4 li4], Italy"],"pinyin":["Yi4","yi4"],"word":"義"}],"containing_words":[],"sentences":[{"english":"This novel criticizes the peasants' uprising and sing the praises of the reactionary rulers.","chinese":"這本小說批判農民起義，但對反動統治者歌功頌德。"},{"english":"Gone are the days of Mao when peasant uprisings could collectively capture the nation.","chinese":"在農民起義共同奪取國家政權之後，毛時代就在消亡。"},{"english":"History, outbreaks of several anti-exploitation of the peasant uprising against oppression.","chinese":"歷史上曾暴發過多次反剝削反壓迫的農民起義。"},{"english":"Another legend says that the practice of hanging red lanterns has something to do with Huang Chao, leader of a peasant uprising.","chinese":"還有人說，正月十五掛紅燈和農民起義領袖黃巢有關。"},{"english":"Frequent burst of peasant uprisings showed that the dynasties' days were numbered.","chinese":"農民起義頻頻爆發，表明這個朝代的大數已盡。"},{"english":"The peasants were constrained by the harsh laws of the Qin Dynasty and staged an uprising.","chinese":"在秦朝的苛法逼迫下，終於發生了農民起義。"},{"english":"Sympathizing with the peasant uprisings, he praised the peasant leaders.","chinese":"因爲他同情農民起義，所以他讚揚農民領袖。"},{"english":"But when hunger is stronger than the fear of being shot, peasant revolts take place.","chinese":"但當飢餓超過槍殺的恐懼時，農民起義便發生了。"},{"english":"The Government of the Qing Dynasty collaborated with foreign reactionary forces to crush down the peasant uprising of the Taiping Heavenly Kingdom.","chinese":"清朝政府勾結外國反動勢力鎮壓太平天國農民起義。"},{"english":"Ming and Qing Dynasties, many times here in the peasant uprising , against feudal rule.","chinese":"明清時期，這裏發生多次農民起義，反抗封建統治。"},{"english":"Mencius' is the theoretical forefather of the various peasant uprisings in Chinese history.","chinese":"孟子是中國曆代農民起義戰爭的理論始祖。"},{"english":"This was the beginning of China's first great peasant uprising .","chinese":"中國歷史上第一次大規模的農民起義在大澤鄉爆發了。"},{"english":"The peasants staged an uprising against the corrupt officials.","chinese":"農民起義反對貪官污吏。"}],"related":[{"definition":["internal trouble and outside aggression (idiom); in a mess both domestically and abroad"],"pinyin":["nei4 you1 wai4 huan4"],"word":"內憂外患"},{"definition":["to resist the enemy"],"pinyin":["kang4 di2"],"word":"抗敵"},{"definition":["volunteer army"],"pinyin":["yi4 jun1"],"word":"義軍"},{"definition":["to defect\/to betray\/to mutiny"],"pinyin":["pan4 bian4"],"word":"叛變"},{"definition":["to loot\/looting"],"pinyin":["qiang3 lu:e4"],"word":"搶掠"},{"definition":["White Lotus society"],"pinyin":["Bai2 lian2 jiao4"],"word":"白蓮教"},{"definition":["to transition to a new dynasty or regime"],"pinyin":["gai3 chao2 huan4 dai4"],"word":"改朝換代"},{"definition":["Liu Yuan, warlord at the end of the Western Jin dynasty 西晋, founder of Cheng Han of the Sixteen Kingdoms 成漢|成汉 (304-347)"],"pinyin":["Liu2 Yuan1"],"word":"劉淵"},{"definition":["armed rebellion"],"pinyin":["pan4 luan4"],"word":"叛亂"},{"definition":["iron hoof (of the oppressor)"],"pinyin":["tie3 ti2"],"word":"鐵蹄"},{"definition":["Russian army"],"pinyin":["E2 jun1"],"word":"俄軍"},{"definition":["Yan Xishan (1883-1960), warlord in Shanxi"],"pinyin":["Yan2 Xi1 shan1"],"word":"閻錫山"},{"definition":["destruction"],"pinyin":["fu4 mie4"],"word":"覆滅"},{"definition":["Hunan army, irregular force formed in 1850s to fight the Taiping heavenly kingdom rebellion"],"pinyin":["Xiang1 jun1"],"word":"湘軍"},{"definition":["military clique\/junta\/warlord"],"pinyin":["jun1 fa2"],"word":"軍閥"},{"definition":["to forfeit sovereignty and humiliate the country (idiom)\/to surrender territory under humiliating terms"],"pinyin":["sang4 quan2 ru3 guo2"],"word":"喪權辱國"}]}