{"definition":["to meet head-on\/face-to-face\/directly"],"pinyin":["ying2 tou2"],"simplified":["迎头"],"rank":29651.0,"normalized_rank":0.4148559595931331,"fraction":9.68707531855782e-7,"cumulative_fraction":0.9899081694499108,"word":"迎頭","characters":[{"definition":["to welcome\/to meet\/to face\/to forge ahead (esp. in the face of difficulties)"],"pinyin":["ying2"],"word":"迎"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"}],"containing_words":[{"definition":["to try hard to catch up"],"pinyin":["ying2 tou2 gan3 shang4"],"word":"迎頭趕上"},{"definition":["to deliver a frontal assault\/to meet head-on (idiom)"],"pinyin":["ying2 tou2 tong4 ji1"],"word":"迎頭痛擊"},{"definition":["erhua variant of 迎頭|迎头[ying2 tou2]"],"pinyin":["ying2 tou2 'r"],"word":"迎頭兒"},{"definition":["to hit head on"],"pinyin":["ying2 tou2 da3 ji1"],"word":"迎頭打擊"}],"sentences":[{"english":"Although the gendarmerie is ahead of the market the market is catching up.","chinese":"雖然憲兵，是市場上的領先地位，市場正在迎頭趕上。"},{"english":"Paul was badly injured when his car was in head-on collision with a bus.","chinese":"保爾的汽車同一輛公共汽車迎頭相撞時，受了重傷。"},{"english":"The ship struck the rocks head on .","chinese":"那隻船迎頭撞上了礁石。"},{"english":"Just after doing that, he crushed into a group of pigs.","chinese":"纔剛罵完，他便迎頭撞上一羣過馬路的豬。"},{"english":"The Federals kept on coming long past the point where all the pleasure of whipping them vanished.","chinese":"迎頭痛擊的樂趣早已消失，北軍仍在衝鋒。"},{"english":"In the second trial your trucks meet head-on travelling up the one-way road.","chinese":"在第二次試驗中，雙方的卡車在單行道上迎頭相遇。"},{"english":"He was badly injured when his car was in head-on collision with a bus.","chinese":"他的車和一輛公共汽車迎頭相撞，受了重傷。"},{"english":"He greeted me with a stream of abuse.","chinese":"他對我一頓迎頭臭罵。"},{"english":"They made head against the enemy.","chinese":"他們迎頭痛擊敵人。"},{"english":"Skyfire fires up fast and web pages load quickly.","chinese":"天火大火迎頭趕上和網頁加載迅速。"},{"english":"China may just leave them in the dust.","chinese":"中國會迎頭而上而你們只能在後面望塵莫及。"},{"english":"The science has caught up and the shamans are exposed.","chinese":"科學已經迎頭趕上，巫師的醜惡嘴臉終被曝光。"},{"english":"Europe is extraordinarily chic in Beijing nowadays; the city is making up for lost time.","chinese":"歐洲人在北京現在很時尚，北京城正在努力迎頭趕上。"},{"english":"Spain and France remain the biggest markets, but China is catching up.","chinese":"西班牙和法國仍是最大市場，但中國正迎頭趕上。"},{"english":"Not only had they not kept up, they'd fallen behind.","chinese":"他們不僅沒有迎頭趕上，反而是掉隊了。"},{"english":"Gawain refuses, determined to meet his fate head-on.","chinese":"加文拒絕，決心迎接他的命運迎頭。"}],"related":[]}