{"definition":["mortar (weapon)"],"pinyin":["pai3 ji1 pao4"],"simplified":["迫击炮"],"rank":19536.0,"normalized_rank":0.27333398626054595,"fraction":0.0000025084795399954426,"cumulative_fraction":0.9737002192357512,"word":"迫擊炮","characters":[{"definition":["to force\/to compel\/to approach or go towards\/urgent\/pressing"],"pinyin":["po4"],"word":"迫"},{"definition":["to hit\/to strike\/to break\/Taiwan pr. [ji2]"],"pinyin":["ji1"],"word":"擊"},{"definition":["cannon\/CL:座[zuo4]\/firecracker","to prepare herbal medicine by roasting or parching (in a pan)","to sauté\/to fry\/to dry by heating"],"pinyin":["bao1","pao2","pao4"],"word":"炮"}],"containing_words":[],"sentences":[{"english":"Twelve enemy transport aircraft on the handstand were knocked out by mortar shells.","chinese":"停機坪上的十二架敵方運輸機被迫擊炮彈擊毀了。"},{"english":"Indian jawans retaliated after mortars were fired from the Pakistani side.","chinese":"巴方發起迫擊炮襲擊後，印度士兵開始報復。"},{"english":"The streets are blasted with the thick black residue of mortar attacks.","chinese":"路面沾滿了迫擊炮轟炸後留下的又黑又厚的痕跡。"},{"english":"A few mortar shells were landing somewhere with a flat thudding sound.","chinese":"不知哪裏落了幾顆迫擊炮彈，悶聲悶氣地轟轟幾響。"},{"english":"The mortar position should be protected from direct-fire weapons as best as possible.","chinese":"迫擊炮位應儘量避開敵軍直接火力打擊。"},{"english":"The mortar ammo bearers should provide security to the gun team.","chinese":"迫擊炮炮彈搬運兵應擔負起炮組的保衛任務。"},{"english":"The Hedgehog was actually a group of whirling dervish sort of bombs fired ahead of the attacking ship.","chinese":"“刺蝟”實際上就是向船的前方前發射迫擊炮彈。"},{"english":"When you were in the Guards mortars , did you have anti-aircraft cover?","chinese":"當你在近衛迫擊炮部隊時，有高射炮掩護嗎？"},{"english":"A mortar and pestle was first used to pulverize the granules of Ignition Powder .","chinese":"迫擊炮和杵首次用來粉碎的顆粒點火粉末。"},{"english":"Were 50 mm company mortars any good?","chinese":"連屬50毫米迫擊炮怎麼樣？"},{"english":"The enemy was mortaring a crossroads behind us.","chinese":"敵人正用迫擊炮轟擊我們背後的一個十字路口。"},{"english":"You get to use the mortar aimpoint on the map.","chinese":"你開始使用地圖上的迫擊炮瞄準點。"},{"english":"Make use of Pitbulls to assist with clearing the skies and defeating clumps of infantry with the mortar.","chinese":"使用鬥犬輔助清除空軍，並用迫擊炮打擊大堆得步兵。"},{"english":"At other times they were stopped by mortars shells and machine-gun fire.","chinese":"另有幾次，他們被迫擊炮和機槍火力阻止停了下來。"},{"english":"The radar will be able to detect the firing of mortar shells at Israeli territory.","chinese":"該雷達可以探測到向以色列境內發射的迫擊炮彈。"},{"english":"Some [of the mortars] hit in our street.","chinese":"一些迫擊炮擊中我們這條街。"}],"related":[]}