{"definition":["to recount\/to narrate\/to give an account of"],"pinyin":["shu4 shuo1"],"simplified":["述说"],"rank":23144.0,"normalized_rank":0.3238145873266828,"fraction":0.0000017584464931788344,"cumulative_fraction":0.9812928485838074,"word":"述說","characters":[{"definition":["to state\/to tell\/to narrate\/to relate"],"pinyin":["shu4"],"word":"述"},{"definition":["to persuade","to speak\/to say\/to explain\/to scold\/to tell off\/a theory (typically the last character in a compound, as in 日心說|日心说 heliocentric theory)"],"pinyin":["shui4","shuo1"],"word":"說"}],"containing_words":[],"sentences":[{"english":"Stories can be told on any platform.","chinese":"故事可以以任何一種形式述說。"},{"english":"This is a story about a prince's vengeance.","chinese":"述說一段王子復仇記。"},{"english":"She doesn’t tell me one ofthose stories about the old ancestors.","chinese":"她不再和我述說我們以色列人先祖的事蹟了。"},{"english":"8He told them everything that had happened and sent them to Joppa.","chinese":"把這事都述說給他們聽，就打發他們往約帕去。"},{"english":"A man sing love songs, the white knuckles, declare we hopeless love .","chinese":"一個人唱情歌，泛白的指節，述說我們無望的愛情。"},{"english":"He described rushing floodwaters up to 20 feet deep in some places.","chinese":"他描述說奔湧的洪水在某些地區深達20英尺。"},{"english":"Elijah had spoken the Word of God boldly to kings and rulers.","chinese":"伊萊賈曾大膽地向君王和統治者述說神的話。"},{"english":"And when he had declared all these things unto them, he sent them to Joppa.","chinese":"把這事都述說給他們聽，就打發他們往約帕去。"},{"english":"The prophet that hath a dream, let him tell a dream;","chinese":"得夢的先知可以述說那夢。"},{"english":"In the real environment and space, it narrates the preciousness and tenaciousness of life.","chinese":"它在現實的環境和空間中，述說著生命的珍貴和頑強。"},{"english":"A young sailor, Ishmael , tells the story of their exciting and dangerous trip.","chinese":"來看看年輕水手依修魯述說這段刺激危險的旅程。"},{"english":"The heavens declare the glory of God and the firmament shows His handiwork.","chinese":"諸天述說神的榮耀，穹蒼傳揚祂的手段。"},{"english":"He loved to recite his personal experiences.","chinese":"他喜歡述說他個人的經歷。"},{"english":"My mouth shall shew forth thy righteousness and thy salvation all the day;","chinese":"我的口終日要述說你的公義，和你的救恩。"},{"english":"Love you than I can say, and the use of text messaging, full of Zhongchang to you tells me.","chinese":"愛你在心口難開，且用短信，向你述說我滿腹衷腸。"},{"english":"And he told Zares his wife, and his friends, all that had befallen him.","chinese":"哈曼將所遭遇的，都給他的愛妻則勒士和朋友述說了。"}],"related":[{"definition":["to recount\/to tell of\/to relate\/(fig.) (of a thing) to stand as testament to (some past history)"],"pinyin":["su4 shuo1"],"word":"訴說"},{"definition":["to talk about\/to narrate\/to give an account"],"pinyin":["jiang3 shu4"],"word":"講述"},{"definition":["to relate (a story or information)\/to tell or talk about\/to recount\/narration\/telling\/narrative\/account"],"pinyin":["xu4 shu4"],"word":"敘述"},{"definition":["experience\/CL:個|个[ge4],次[ci4]\/to experience\/to go through"],"pinyin":["jing1 li4"],"word":"經歷"},{"definition":["to recall\/memories\/CL:個|个[ge4]"],"pinyin":["hui2 yi4"],"word":"回憶"},{"definition":["countless\/numberless\/innumerable"],"pinyin":["wu2 shu4"],"word":"無數"},{"definition":["to tell in detail"],"pinyin":["xi4 shuo1"],"word":"細說"},{"definition":["(of a story etc) to unfold\/to play out\/to develop (a technique etc)\/to enact\/(logic) to deduce\/to infer"],"pinyin":["yan3 yi4"],"word":"演繹"},{"definition":["to come and go\/to have friendly relations with\/in the past\/previous"],"pinyin":["guo4 wang3"],"word":"過往"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或許"},{"definition":["thought-provoking\/worth thinking over\/to provide food for thought"],"pinyin":["nai4 ren2 xun2 wei4"],"word":"耐人尋味"},{"definition":["changes\/vicissitudes"],"pinyin":["bian4 qian1"],"word":"變遷"},{"definition":["unceasing torrent (idiom)\/talking non-stop\/gabbling forty to the dozen"],"pinyin":["tao1 tao1 bu4 jue2"],"word":"滔滔不絕"},{"definition":["to pass on\/to convey\/to relay\/to transmit\/transmission"],"pinyin":["chuan2 da2"],"word":"傳達"},{"definition":["to interpret\/to comment and explain\/to annotate\/to perform (i.e. interpret a theatrical role)\/to decode\/interpretation\/annotation"],"pinyin":["quan2 shi4"],"word":"詮釋"},{"definition":["luck\/fate\/opportunity\/the ups and downs of life"],"pinyin":["ji4 yu4"],"word":"際遇"}]}