{"definition":["to burst forth"],"pinyin":["beng4 fa1"],"simplified":["迸发"],"rank":22511.0,"normalized_rank":0.31495809606424796,"fraction":0.0000018707032882356609,"cumulative_fraction":0.9801450897121032,"word":"迸發","characters":[{"definition":["to burst forth\/to spurt\/to crack\/split"],"pinyin":["beng4"],"word":"迸"},{"definition":["to send out\/to show (one's feeling)\/to issue\/to develop\/to make a bundle of money\/classifier for gunshots (rounds)"],"pinyin":["fa1"],"word":"發"}],"containing_words":[{"definition":["to burst forth\/to burst out"],"pinyin":["beng4 fa1 chu1"],"word":"迸發出"}],"sentences":[{"english":"You can feel new ideas and plans cooking up in your head.","chinese":"你的大腦能在烹飪時迸發出新鮮的想法與計劃。"},{"english":"The outbreak of war in Europe in 1914 shocked the American public.","chinese":"一九一四年歐戰的迸發震驚了美國大衆。"},{"english":"The ancient Chinese civilization has been revitalized.","chinese":"文明古國迸發出前所未有的青春活力。"},{"english":"Mottoes are blurted out from the wisdom of philosphers.","chinese":"格言是由哲學家的機智中迸發而出的。"},{"english":"If you have someone of special interest with you, you need to remember that the room belongs to two people.","chinese":"如果有人對你愛慾迸發，記住房間屬於兩個人。"},{"english":"You want them to pull the pass-it-on trigger and share your site.","chinese":"你希望他們迸發傳遞的念頭去和別人分享你的網站。"},{"english":"It was the improvisation of the ebullition.","chinese":"它是激情迸發的即興創作。"},{"english":"In the open air their rapture broke into speech.","chinese":"來到戶外，他們如醉如癡的狂喜迸發成語言。"},{"english":"A destructive economic force unlike any seen for generations had been unleashed.","chinese":"幾代人都未曾見過的毀滅性經濟力量迸發了出來。"},{"english":"That's the sound of steam bursting from the Earth at Nevada Geothermal's Blue Mountain project.","chinese":"這是來自內華達州藍山地熱項目的滾滾蒸汽迸發聲。"},{"english":"Just as she remembers his words, she remembers the brushback stirring her competitive juices.","chinese":"當她憶起他的話，心頭就迸發出競爭的激情。"},{"english":"Since then, the Chinese society has shown unprecedented vigor and creativity.","chinese":"中國社會迸發出前所未有的活力和創造力。"},{"english":"That is my inspired time.","chinese":"那是我迸發靈感之時。"},{"english":"Have you experienced moments of genius and inspiration?","chinese":"你是否經歷過天賦和靈感迸發的時刻？"},{"english":"Some sparks from a passing train set the haystack on fire.","chinese":"列過往火車迸發出的一些火花點着了乾草堆。"},{"english":"It landed on a pile of firewood where the yellow yolk burst into flames.","chinese":"鳥蛋掉到一堆柴火上，蛋黃隨即迸發出黃色的火焰。"}],"related":[]}