{"definition":["to add something extra\/an additional increment\/addendum\/to append\/an additional posthumous title"],"pinyin":["zhui1 jia1"],"simplified":["追加"],"rank":8093.0,"normalized_rank":0.11323156996348273,"fraction":0.000011750615051878093,"cumulative_fraction":0.9108998577782728,"word":"追加","characters":[{"definition":["to chase after\/to seek\/to do one's utmost to seek or procure sth\/to recall","to sculpt\/to carve\/musical instrument (old)"],"pinyin":["dui1","zhui1"],"word":"追"},{"definition":["abbr. for Canada 加拿大[Jia1 na2 da4]\/surname Jia","to add\/plus\/(used after an adverb such as 不, 大, 稍 etc, and before a disyllabic verb, to indicate that the action of the verb is applied to sth or sb previously mentioned)\/to apply (restrictions etc) to (sb)\/to give (support, consideration etc) to (sth)"],"pinyin":["Jia1","jia1"],"word":"加"}],"containing_words":[],"sentences":[{"english":"Does tax preference transition period exist when foreign-funded enterprises deposit additional funds.","chinese":"外商投資企業追加投資是否存在稅收優惠過渡期？"},{"english":"The new US$100 million funding is subject to approval by the World Bank's Board of Directors.","chinese":"1億美元追加資金需經世行董事會審批。"},{"english":"With a view to that, toler can be set to guarantee the success in stop loss.","chinese":"故此透過追加點數，以確保用家能成功止損。"},{"english":"You can send in an ad dition al order later.","chinese":"你可以以後再下追加訂單。"},{"english":"This will mean additional demand for domestic bank credit in the near term.","chinese":"這意味着近期內國內銀行信貸將追加需求。"},{"english":"While an additional 60 billion, one third will be used for rail transit construction.","chinese":"而追加的60億元中，三分之一將用於軌道交通建設。"},{"english":"A stock dividend is a prorata distribution of additional shares of a corporation's stock to the stockholders.","chinese":"紅股是按照比例分配給持股人的公司股本的追加股份。"},{"english":"Ketamine produced a dose-dependent reduction in the \"rescue\" opioid requirements.","chinese":"氯胺酮可劑量依賴性地減少追加阿片類藥物的需要量。"},{"english":"If it does not, consider supplemental insurance.","chinese":"如果無效或不包含則要考慮追加保險。"},{"english":"square metres of land in the rst quarter;Wanke also acquired 5.62 million square metres of additional land reserves in the rst half of this year.","chinese":"萬科在今年上半年也追加了562萬平米的土地儲備。"},{"english":"If you are prepared to increase the commi ion, we will order extra 3000 sets.","chinese":"如果你們增加佣金，我們將追加定購3000套。"},{"english":"The reordering newsboy problem was researched under the uncertainty circumstances.","chinese":"研究模糊環境下可追加訂購的報童問題。"},{"english":"Besides the capital equipment investment, what other areas will require investment?","chinese":"除了資本性的設備投資之外，還需要哪些追加投資？"},{"english":"Clearly, the need to fund an additional supplementary budget for disaster reconstruction is fueling these worries some more.","chinese":"顯然，災後重建的額外追加預算帶來更多的憂慮。"},{"english":"I have to superadd the budget expenses, in my opinion.","chinese":"看來，我得追加預算開支啦。"},{"english":"Power is generated from the hips and torso.","chinese":"用髖部和軀幹發力，用雙肩還原爲手臂追加速度。"}],"related":[{"definition":["extra\/added\/additional"],"pinyin":["e2 wai4"],"word":"額外"},{"definition":["ruling"],"pinyin":["cai2 ding4"],"word":"裁定"},{"definition":["to reject\/to turn down\/to overrule"],"pinyin":["bo2 hui2"],"word":"駁回"},{"definition":["to appeal (a judicial case)\/appeal"],"pinyin":["shang4 su4"],"word":"上訴"},{"definition":["to deduct"],"pinyin":["kou4 chu2"],"word":"扣除"},{"definition":["to delay\/to extend\/to postpone\/to defer"],"pinyin":["yan2 qi1"],"word":"延期"},{"definition":["to penalize\/to punish"],"pinyin":["chu3 fa2"],"word":"處罰"},{"definition":["follow-up\/(dialect) to remarry"],"pinyin":["hou4 xu4"],"word":"後續"},{"definition":["to give\/to impose\/to apply"],"pinyin":["yu3 yi3"],"word":"予以"},{"definition":["to take effect\/to go into effect"],"pinyin":["sheng1 xiao4"],"word":"生效"},{"definition":["to compensate\/to make up"],"pinyin":["bu3 chang2"],"word":"補償"},{"definition":["to replenish\/to supplement\/to complement\/additional\/supplementary\/CL:個|个[ge4]"],"pinyin":["bu3 chong1"],"word":"補充"},{"definition":["judgment (by a court of law)\/to pass judgment on\/to sentence"],"pinyin":["pan4 jue2"],"word":"判決"},{"definition":["to use discretion\/to take circumstances into account\/to make allowances pertinent to a situation"],"pinyin":["zhuo2 qing2"],"word":"酌情"},{"definition":["to amend\/to alter\/to modify"],"pinyin":["xiu1 gai3"],"word":"修改"},{"definition":["to compensate"],"pinyin":["pei2 chang2"],"word":"賠償"}]}