{"definition":["to return\/to give back\/to send back\/to repatriate"],"pinyin":["song4 huan2"],"simplified":["送还"],"rank":33178.0,"normalized_rank":0.4642032655688162,"fraction":7.106190875638857e-7,"cumulative_fraction":0.992851697644543,"word":"送還","characters":[{"definition":["to deliver\/to carry\/to give (as a present)\/to present (with)\/to see off\/to send"],"pinyin":["song4"],"word":"送"},{"definition":["still\/still in progress\/still more\/yet\/even more\/in addition\/fairly\/passably (good)\/as early as\/even\/also\/else","surname Huan","to pay back\/to return"],"pinyin":["Huan2","hai2","huan2"],"word":"還"}],"containing_words":[],"sentences":[{"english":"The South Korean puppet regime must return my daughter to her mother's arms right away.","chinese":"韓國傀儡政權必須馬上送還我的女兒到母親的懷抱。"},{"english":"I'll check into it and get back to you.","chinese":"我查對一下然後送還給你。"},{"english":"And the foster parents gave his daughter back to him finally.","chinese":"最後，那對養父母還是把女兒送還給了山姆。"},{"english":"Whom Joves great Son to her glad Husband gave.","chinese":"由約夫的偉大兒子送還她丈夫。"},{"english":"He’d run six blocks to return it.","chinese":"他追了六個街區送還給我。"},{"english":"\"As soon as we are done with the brain, we will return it, \" Mr Winter said.","chinese":"“工作一旦完成，我們就會將腦組織送還，”溫特說。"},{"english":"The money was returned intact by its finder.","chinese":"錢原封未動地被撿拾者送還。"},{"english":"I am sorry for the delay, sir. We will send it back to you right away.","chinese":"先生，對於延誤十分抱歉，我們將馬上送還衣服給您。"},{"english":"I'll check into it and get back to you。","chinese":"我查對一下然後送還給你。"},{"english":"The property has been returned to the original owner.","chinese":"這些財產已送還原主。"},{"english":"You think thing like this, I how be willing to the white white ground took back you?","chinese":"你想這樣的東西，我怎肯白白地送還你們？"},{"english":"I sent three shirts today in the laundry and only two came back.","chinese":"今天共送洗了三件襯衫，只送還了兩件。"},{"english":"He'd run six blocks to return it.","chinese":"他追了六個街區送還給我。"},{"english":"I\"ll check into it and get back to you.","chinese":"我查對一下然後送還給你。"}],"related":[]}