{"definition":["reverse reaction\/counterreaction\/inverse response"],"pinyin":["ni4 fan3 ying4"],"simplified":["逆反应"],"rank":69593.0,"normalized_rank":0.9736963608635428,"fraction":3.795418298410236e-9,"cumulative_fraction":0.9999951885774055,"word":"逆反應","characters":[{"definition":["contrary\/opposite\/backwards\/to go against\/to oppose\/to betray\/to rebel"],"pinyin":["ni4"],"word":"逆"},{"definition":["contrary\/in reverse\/inside out or upside down\/to reverse\/to return\/to oppose\/opposite\/against\/anti-\/to rebel\/to use analogy\/instead\/abbr. for 反切[fan3 qie4] phonetic system"],"pinyin":["fan3"],"word":"反"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"}],"containing_words":[],"sentences":[{"english":"So we have first, a reversible process.","chinese":"所以我們有，首先，一個可逆反應。"},{"english":"Furthermore, the cyclic Voltammetry curve of gingerol indicated that the reaction was half reversible process.","chinese":"薑辣素的循環伏安掃描曲線表現爲準可逆反應。"},{"english":"The results show that the reaction can be considered as a second-order irreversible reaction.","chinese":"結果表明該反應爲二級不可逆反應。"},{"english":"Finally, the effects of reversible reaction to the isotope enrichment was investigated.","chinese":"最後研究了逆反應對同位素濃縮過程的影響。"},{"english":"The reversible reaction appeared on grain boundary surface quite markedly.","chinese":"晶界的這種可逆反應十分明顯。"},{"english":"The reverse of Reaction 11 for acetate may be combined with the electron acceptor reactions.","chinese":"的逆反應可以與電子接受體反應組合在一起。"},{"english":"So the thermodynamics feasibility of reverse reaction sintering is demonstrated.","chinese":"論證了逆反應燒結的熱力學可行性。"},{"english":"Under the condition of dissociation the irreversibility was easily to occur.","chinese":"當有離解作用存在時，將伴隨有不可逆反應發生。"},{"english":"Later on, we will talk about reversible reactions.","chinese":"等一會我會討論可逆反應。"},{"english":"The results showed that the synthesizing process was an instantaneous and irreversible reaction.","chinese":"結果表明，該合成過程爲瞬間不可逆反應。"},{"english":"The general differential kinetic equation for several kinds of reversible reactions is first given in this paper.","chinese":"本文提出了幾類可逆反應通用的微分動力學方程。"},{"english":"First one is a series reversible.","chinese":"第一個是串聯的可逆反應。"},{"english":"And we've looked at reversible reactions.","chinese":"還看過可逆反應。"},{"english":"So that thermodynamics feasibility of reverse reaction sintering is demonstrated .","chinese":"論證了逆反應燒結的熱力學可行性。"},{"english":"Equilibrium or reversible reactions.","chinese":"平衡反應或可逆反應。"},{"english":"The control step in this electrochemical process was attributed to the diffusion of nitrobenzene or its electrochemical reductive product.","chinese":"結果表明，該反應屬擴散控制的準可逆反應。"}],"related":[]}