{"definition":["perspective drawing"],"pinyin":["tou4 shi4 tu2"],"simplified":["透视图"],"rank":60388.0,"normalized_rank":0.844906468176794,"fraction":3.926798162585976e-8,"cumulative_fraction":0.999830579388106,"word":"透視圖","characters":[{"definition":["to penetrate\/to pass through\/thoroughly\/completely\/transparent\/to appear\/to show"],"pinyin":["tou4"],"word":"透"},{"definition":["to look at\/to regard\/to inspect"],"pinyin":["shi4"],"word":"視"},{"definition":["diagram\/picture\/drawing\/chart\/map\/CL:張|张[zhang1]\/to plan\/to scheme\/to attempt\/to pursue\/to seek"],"pinyin":["tu2"],"word":"圖"}],"containing_words":[],"sentences":[{"english":"A Content Package or Package describes a folder that is used to hold multiple perspectives.","chinese":"程序包或包是指一個用於保存多個透視圖的文件夾。"},{"english":"You will be able to edit and save perspectives into any unlocked content package.","chinese":"您能夠編輯並將透視圖保存到任何未鎖定的程序包中。"},{"english":"By default, the plug-in perspective is launched.","chinese":"默認情況下，啓動插件透視圖。"},{"english":"The Danish practice have sent us these new renderings of the project.","chinese":"丹麥的做法已經給我們這些新的透視圖的項目。"},{"english":"Select the package name where you want the perspective to be stored.","chinese":"選擇您希望將透視圖存儲到的程序包的名稱。"},{"english":"From there you can select and display the newly saved perspective.","chinese":"從這裏您可以選擇並顯示新保存的透視圖。"},{"english":"The toolbars and menu bar are configured on a per-perspective basis.","chinese":"工具欄和菜單欄都是基於透視圖配置的。"},{"english":"The default test perspective comes with a preconfigured set of views.","chinese":"默認的測試透視圖設定了一組預先配置好的視圖。"},{"english":"With some product licenses, this perspective might not be available.","chinese":"對於某些產品許可證，此透視圖可能不可用。"},{"english":"Besides, the authors make a suggestion on how the automatic plotting of terrain perspective graphy with high level of reality can ber…","chinese":"此外，還對生成高度真實感地形透視圖提出了建議。"},{"english":"Isometric drawing is much simpler than perspective drawing.","chinese":"等角圖較透視圖簡單得多。"},{"english":"To do that, switch over to the debug perspective and test your updated application from there.","chinese":"切換到糾錯透視圖並在此測試更新過的應用程序。"},{"english":"You can switch perspectives whenever you need to.","chinese":"在需要時，您可以切換透視圖。"},{"english":"You will now be in the Server perspective.","chinese":"現在您位於服務器透視圖。"},{"english":"What is Two-Point Perspective Drawing?","chinese":"什麼是兩點透視圖？。"},{"english":"Besides, the authors make a suggestion on how the automatic plotting of terrain perspective graphy with high level of reality can be realized.","chinese":"此外，還對生成高度真實感地形透視圖提出了建議。"}],"related":[]}