{"definition":["out-and-out\/thoroughly"],"pinyin":["tou4 ding3"],"simplified":["透顶"],"rank":32598.0,"normalized_rank":0.4560883130692709,"fraction":7.479893600405405e-7,"cumulative_fraction":0.9924286844073088,"word":"透頂","characters":[{"definition":["to penetrate\/to pass through\/thoroughly\/completely\/transparent\/to appear\/to show"],"pinyin":["tou4"],"word":"透"},{"definition":["apex\/crown of the head\/top\/roof\/most\/to carry on the head\/to push to the top\/to go against\/to replace\/to substitute\/to be subjected to (an aerial bombing, hailstorm etc)\/(slang) to \"bump\" a forum thread to raise its profile\/classifier for headwear, hats, veils etc"],"pinyin":["ding3"],"word":"頂"}],"containing_words":[],"sentences":[{"english":"As for the film itself, I can simply report that it isn't too bad at all.","chinese":"至於影片本身，我只能說，還不算糟糕透頂。"},{"english":"The whole family is rotten to the core.","chinese":"這一家人腐敗透頂。"},{"english":"Choose sitting on that couch watching mind- numbing sprit-crushing game shows, stuffing fucking junk food into your mouth.","chinese":"選擇在沙發上看無聊透頂的節目，往嘴裏塞垃圾食物。"},{"english":"Mrs. Smith was worried sick, and Chase is practically a basket case.","chinese":"史密斯太太都急出病來了，而蔡斯簡直就絕望透頂了。"},{"english":"But the Taiwanese people had lost all faith in he KMT, and refused it another chance.","chinese":"但百姓對國民黨已失望透頂，不再給它機會。"},{"english":"If you will put up with my atrocious pronunciation, I would like to read you a few pages of your ancestor's work.","chinese":"如果您能忍受我糟糕透頂的發音，咱們不妨念幾頁。"},{"english":"The bird has a tuft of red on top of its head.","chinese":"這諄鳥的透頂上有一小簇紅色蹬羽毛。"},{"english":"The new military rulers said that the previous government had been riddled with corruption.","chinese":"新的軍事統治者說，前政府已經腐敗透頂。"},{"english":"The game was \"terrible, \" Buffett recalls. \"Humiliating, \" says Osberg.","chinese":"巴菲特回憶說，那場橋牌打得糟糕透頂。"},{"english":"Getting up in the morning is pretty terrible.","chinese":"早上起牀的感覺簡直糟糕透頂。"},{"english":"Michael was too clever and intelligent for me.","chinese":"邁克爾聰明透頂，我鬥不過他。"},{"english":"He built private houses whit public funds. The whole thing smells to high heaven.","chinese":"他用公款蓋房這件事真是腐敗透頂。"},{"english":"How does a 15)lunatic like you help a guy like me?","chinese":"荒謬透頂，像你這樣的瘋子怎麼能幫助像我這樣的人？"},{"english":"But the Taiwanese people had lost all faith inthe KMT, and refused it another chance.","chinese":"但百姓對國民黨已失望透頂，不再給它機會。"},{"english":"I spend 5 nights at this hotel, and I was very disappointed.","chinese":"我在這家酒店住了5晚，失望透頂了。"},{"english":"Is fear of being single keeping you in a bad relationship?","chinese":"是否單身的恐懼讓你的人際關係糟糕透頂？"}],"related":[]}