{"definition":["one by one\/one after another"],"pinyin":["zhu2 ge4"],"simplified":["逐个"],"rank":18417.0,"normalized_rank":0.2576777244553887,"fraction":0.0000028154704892860853,"cumulative_fraction":0.9707221328816468,"word":"逐個","characters":[{"definition":["to pursue\/to chase\/individually\/one by one"],"pinyin":["zhu2"],"word":"逐"},{"definition":["individual\/this\/that\/size\/classifier for people or objects in general"],"pinyin":["ge4"],"word":"個"}],"containing_words":[],"sentences":[{"english":"All the mechanical parts been electroplated, he began to examine them one by one.","chinese":"所有的機械部件都電鍍好以後，他開始逐個檢查。"},{"english":"Trim toenails straight across using nail clippers.","chinese":"用指甲刀逐個修剪腳趾甲。"},{"english":"Please hand in your paper one by one.","chinese":"請逐個把試卷交上來。"},{"english":"Eg: He ticked the items one by one.","chinese":"他逐個在項目前面打鉤。"},{"english":"I am traveling on in time in my review of these arguments.","chinese":"我正在依時間順序逐個檢視那些論點。"},{"english":"To test failover, stop the clones one by one.","chinese":"要測試故障轉移，逐個地停止克隆。"},{"english":"A hundred millions of them laid down side by side would make a line only about an inch song.","chinese":"一億個微粒逐個地排列成線，也只有大約一英寸長。"},{"english":"For the independent or vertical row of cross-pin, can be used individually embroidered embroidered France.","chinese":"對於獨立或豎向並排的十字針，可採用逐個繡的繡法。"},{"english":"Today is the only day when I can bring myself to tell my wife I love her.","chinese":"今天是獨逐個天我願意跟老婆說我愛她的日子。"},{"english":"Why is the toilet, please listen to me on one one.","chinese":"爲什麼是廁所呢，請聽我議逐個道來。"},{"english":"Further, you can configure unordered delivery on a stream-by-stream basis within an association.","chinese":"另外，您可以在一個聯合中按照逐個流配置無序發送。"},{"english":"Filters in the chain do their processing one by one.","chinese":"鏈中的過濾器逐個執行其處理。"},{"english":"The solution of the whole team organization problem can be obtained by solving the sub-problems one by one.","chinese":"逐個解決子問題，即可獲得整個團隊組織問題的解。"},{"english":"Instead you output the information from the two feeds one after the other.","chinese":"作爲替代方法，您可以逐個輸出來自兩個提要的信息。"},{"english":"The following sections examine these federated objects one by one.","chinese":"接下來的幾個小節逐個研究這些聯邦對象。"},{"english":"If bicycle pump, then the alignment hole- by-blow look at a better effect.","chinese":"如有自行車打氣筒，則對準小孔逐個吹一下效果更佳。"}],"related":[]}