{"definition":["comma (punct.)"],"pinyin":["dou4 hao4"],"simplified":["逗号"],"rank":43650.0,"normalized_rank":0.6107201320778476,"fraction":2.7210229647064155e-7,"cumulative_fraction":0.9976754560652707,"word":"逗號","characters":[{"definition":["to stay\/to stop\/to tease (play with)\/amusing\/short pause in reading aloud, equivalent to comma (also written 讀|读[dou4])"],"pinyin":["dou4"],"word":"逗"},{"definition":["ordinal number\/day of a month\/mark\/sign\/business establishment\/size\/ship suffix\/horn (wind instrument)\/bugle call\/assumed name\/to take a pulse\/classifier used to indicate number of people","roar\/cry\/CL:個|个[ge4]"],"pinyin":["hao2","hao4"],"word":"號"}],"containing_words":[],"sentences":[{"english":"The value passed to the actions should be comma-delimited lists of values.","chinese":"傳遞給動作的值應該是以逗號分隔的值列表。"},{"english":"Semi-colons show a pause which is longer than a comma, but not as long as a full stop.","chinese":"分號表達的是一個比逗號長句號短的停頓。"},{"english":"A comma-separated value is the default configuration for the delimited data handler.","chinese":"逗號分隔值是帶分隔符的數據處理程序的缺省配置。"},{"english":"Where there are multiple daemons or clients on a line, separate each one with a comma.","chinese":"當一行有多個守護進程或客戶端時，用逗號分隔開來。"},{"english":"Use comma to separate and distinguish additional or incidental information inserted into a sentence.","chinese":"使用逗號分割插入語和主句成分。"},{"english":"A comma should only be used to separate function arguments.","chinese":"逗號只能用於分隔函數的自變量。"},{"english":"Avoid lazy text-inspired speak, with overuse of dot-dot-dot’s and consecutive commas.","chinese":"過多使用省略號和連續逗號。"},{"english":"Stay away from the use of colons in greetings and closings and use commas instead.","chinese":"在問候詞以及結尾用逗號代替冒號。"},{"english":"The access rights are stored as a comma-separated list of rights.","chinese":"訪問權被存儲成一個以逗號隔開的權限列表。"},{"english":"Commas may be used to write multiple sub-expressions on a single line.","chinese":"逗號被用來在一行中寫入多個子表達式。"},{"english":"If a match is found, a comma is inserted between the two subpatterns.","chinese":"如果找到匹配，則在兩個子模式之間插入一個逗號。"},{"english":"If the string contains more than one address, separate the addresses with commas.","chinese":"如果字符串包含多個地址，地址之間用逗號分隔。"},{"english":"Eliminate commas, that are, not necessary. Parenthetical words _ however _ should be enclosed in commas.","chinese":"避免不必要的逗號，而附加式說明需要用逗號隔開。"},{"english":"Eliminate commas, that are, not necessary. Parenthetical words _ however _ should be enclosed in commas.","chinese":"避免不必要的逗號，而附加式說明需要用逗號隔開。"},{"english":"In writing, non-identifying relative clauses are always separated by commas in this way.","chinese":"書寫時，非限定關係從句總是用逗號隔開。"},{"english":"Comma is a kind of punctuation.","chinese":"逗號是一種標點符號。"}],"related":[{"definition":["modal particle"],"pinyin":["yu3 qi4 ci2"],"word":"語氣詞"},{"definition":["punctuation\/a punctuation mark"],"pinyin":["biao1 dian3 fu2 hao4"],"word":"標點符號"},{"definition":["Chinese back-sloping comma 、 (punct. used to separate items in a list)"],"pinyin":["dun4 hao4"],"word":"頓號"},{"definition":["to write characters in simplified form\/the simplified form of a character\/to abbreviate (a word or expression)\/to write in simple language"],"pinyin":["jian3 xie3"],"word":"簡寫"},{"definition":["ellipsis (punct.)"],"pinyin":["sheng3 lu:e4 hao4"],"word":"省略號"},{"definition":["phonetic symbol"],"pinyin":["yin1 biao1"],"word":"音標"},{"definition":["synonym"],"pinyin":["tong2 yi4 ci2"],"word":"同義詞"},{"definition":["exclamation mark ! (punct.)"],"pinyin":["jing1 tan4 hao4"],"word":"驚嘆號"},{"definition":["bane of one's existence\/vile spawn"],"pinyin":["nie4 zhong3"],"word":"孽種"},{"definition":["to digress\/to stray from the subject"],"pinyin":["li2 ti2"],"word":"離題"},{"definition":["faulty wording\/mispronunciation due to a speech defect"],"pinyin":["yu3 bing4"],"word":"語病"},{"definition":["to ask for trouble\/to invite difficulties"],"pinyin":["zi4 zhao3 ma2 fan5"],"word":"自找麻煩"},{"definition":["saying in which the second part, uttered after a pause or totally left out, is the intended meaning of the allegory presented in the first part"],"pinyin":["xie1 hou4 yu3"],"word":"歇後語"},{"definition":["to listen with respectful attention\/(a polite request to sb to speak)\/we are all ears"],"pinyin":["xi3 er3 gong1 ting1"],"word":"洗耳恭聽"},{"definition":["lit. if it's wrong, it's wrong (idiom); to make the best after a mistake\/to accept an error and adapt to it\/to muddle through"],"pinyin":["jiang1 cuo4 jiu4 cuo4"],"word":"將錯就錯"},{"definition":["(of a pupil) to write down (in a dictation exercise)\/dictation\/(music) to transcribe by ear"],"pinyin":["ting1 xie3"],"word":"聽寫"}]}