{"definition":["(coll.) As a matter of fact, ... (used to introduce evidence for what one has just asserted)"],"pinyin":["zhe4 bu5"],"simplified":["这不"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"這不","characters":[{"definition":["this\/these\/(commonly pr. [zhei4] before a classifier, esp. in Beijing)"],"pinyin":["zhe4"],"word":"這"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"}],"containing_words":[],"sentences":[{"english":"It's not like we're back in Ontario, how's that?","chinese":"這不像是回到了安大略湖，怎麼會？"},{"english":"\"I say, \" he said, addressing the driver, \"so you tell me it's not dangerous here?","chinese":"“我說”他對着馬伕說，“你告訴我這不危險哦？"},{"english":"\"It's not just about the cost, \" Metz said.","chinese":"“這不只是花費問題，”麥茲說道。"},{"english":"Even when deep inside we know it can t be.","chinese":"哪怕在內心深處我們清楚這不可能。"},{"english":"Truly, the pure fragrance of tea came out from the tradition of \"no sugar\".","chinese":"真的，中國茶的清香和甘甜，全在這不放糖的傳統裏。"},{"english":"To feel or express strong unwillingness or repugnance .","chinese":"她對這不受歡迎的建議感到反感。"},{"english":"I think it's unjust.","chinese":"我覺得這不公正。"},{"english":"A girl told me donating blood would make her gain weight. Not true.","chinese":"有位姑娘告訴我，獻血會使她的體重增加，這不正確。"},{"english":"But this is inconsequent and very dangerous I think.","chinese":"但這不重要，而且十分危險。"},{"english":"Is it not stange that most of us choose sucking rather than running?","chinese":"但我們大多寧肯吮吸卻不願奔流向前，這不奇怪嗎？"},{"english":"That doesn’t mean anyone older than 85 should stop taking blood pressure medication.","chinese":"但這不意味着85歲以上的人就應停止服用降壓藥。"},{"english":"This doesn include make-up, if you want request \"make-up\" on catagory list.","chinese":"這不包括化妝，如果你想要求“化妝”的類別列表。"},{"english":"Oh, isn't this a Taoist temple?","chinese":"啊，這不就是一座道觀嘛？"},{"english":"Fund launched to the impact of second-line blue-chip, this do not want to go.","chinese":"基金髮起的二線藍籌股，這不希望去影響。"},{"english":"You've all ganged up against me, it's not fair.","chinese":"你們一幫人結夥反對我，這不公平。"},{"english":"This does not necessarily represent supplication within the glossary.","chinese":"但在術語表中這不一定是必須的。"}],"related":[]}