{"definition":["recently\/currently"],"pinyin":["zhe4 yi1 zhen4 zi5"],"simplified":["这一阵子"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"這一陣子","characters":[{"definition":["this\/these\/(commonly pr. [zhei4] before a classifier, esp. in Beijing)"],"pinyin":["zhe4"],"word":"這"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["disposition of troops\/wave\/spate\/burst\/spell\/short period of time\/classifier for events or states of short duration"],"pinyin":["zhen4"],"word":"陣"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi3","zi5"],"word":"子"}],"containing_words":[],"sentences":[{"english":"Hopefully we won't need to do another one like that for a while.","chinese":"但願這一陣子不用再來一次像這樣的。"},{"english":"\"Butter is awful dear these days, \" he suggested.","chinese":"“這一陣子黃油可是貴得嚇人，”他暗示道。"},{"english":"Her streak of bad luck seems to be bottoming out.","chinese":"她這一陣子壞運氣似乎到頭了。"},{"english":"This is a time always asking myself, and I for what?","chinese":"這一陣子老是在問自己，我適合什麼？"},{"english":"These days Tom has been dabbling at painting.","chinese":"這一陣子湯姆迷上了畫畫。"},{"english":"I believe more and more people today are crying out \"money no enough.\"","chinese":"這一陣子，大喊“錢不夠用”的人一定越來越多。"},{"english":"I am busy these days, so I haven't been Alec's blog for a long time.","chinese":"這一陣子好忙，因此有一段時間未上有朋的部落格。"},{"english":"I believe more and more people today are crying out \"money not enough.\"","chinese":"這一陣子，大喊“錢不夠用”的人一定很多。"},{"english":"These days, you need to be able to ride the breaking wave of constant change.","chinese":"這一陣子，你需要有能力乘著不斷變動的碎波前進。"},{"english":"Sally's friendship for Susan seems to have been cooling down for sometime.","chinese":"薩利對蘇珊的友誼這一陣子似乎冷淡下去了。"}],"related":[]}