{"definition":["thus\/if this happens then"],"pinyin":["zhe4 yang4 yi1 lai2"],"simplified":["这样一来"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"這樣一來","characters":[{"definition":["this\/these\/(commonly pr. [zhei4] before a classifier, esp. in Beijing)"],"pinyin":["zhe4"],"word":"這"},{"definition":["manner\/pattern\/way\/appearance\/shape\/classifier: kind, type"],"pinyin":["yang4"],"word":"樣"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"}],"containing_words":[],"sentences":[{"english":"As a result, it is not necessary to maintain a positive ketosis test long term.","chinese":"這樣一來，就沒有必要堅持長期測試積極酮症了。"},{"english":"As a result, significantly impact on the stability of the solder.","chinese":"這樣一來，就大大影響了焊錫的穩定性。"},{"english":"He closed a head gate so that the moat dried up and she could walk through.","chinese":"這樣一來，壕中的水乾了，姑娘就可以走到果園去了。"},{"english":"We should thus subordinate the prevention of first offences to the prevention of recidivism .","chinese":"這樣一來，我們便會讓預防初犯屈從於預防累犯。"},{"english":"As a result, the stability of the county began to peace.","chinese":"這樣一來，安定郡開始太平起來。"},{"english":"because that way a lot of different groups can use the same space.","chinese":"因爲這樣一來很多不同的團隊可以用同一個空間。"},{"english":"Photography cannot escape the issues that arise when taking into consideration the standpoint of the observer.","chinese":"這樣一來，攝影人就無法逃脫觀察立場的問題了。"},{"english":"For this reason, they believed in Fei Changfang even more firmly than before.","chinese":"這樣一來，他們愈發相信起費長房的話來。"},{"english":"Because it would follow then, that when I'm asleep, I'm dead.","chinese":"因爲這樣一來我睡覺時，我是死的。"},{"english":"At this point, advertising on Bing becomes far more interesting.","chinese":"這樣一來，Bing的廣告業務便更有看頭了。"},{"english":"That created a constant military presence in the streets.","chinese":"這樣一來在街道上始終有軍事存在。"},{"english":"This removes it at once beyond the special care of the founder.","chinese":"這樣一來，它立即就可以擺脫創業人的特殊照料。"},{"english":"Thus actual power had shifted still more in Bormann's favor.","chinese":"這樣一來，就更有利於博爾曼操縱實權了。"},{"english":"And that may lead to more effective treatments or preventive measures.","chinese":"這樣一來，我們就能提供更有效的治療或預防措施。"},{"english":"This way, I can share my summer vacation with them.","chinese":"這樣一來，我就能跟他們一同分享我的暑假了。"},{"english":"The personality theory must be false.","chinese":"這樣一來人格理論一定是錯誤的了。"}],"related":[]}