{"definition":["proficient (in sth)\/to understand sth through and through"],"pinyin":["tong1 xiao3"],"simplified":["通晓"],"rank":31653.0,"normalized_rank":0.4428665370139773,"fraction":8.13533314501548e-7,"cumulative_fraction":0.9916907948013391,"word":"通曉","characters":[{"definition":["classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)","to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc"],"pinyin":["tong1","tong4"],"word":"通"},{"definition":["dawn\/daybreak\/to know\/to let sb know\/to make explicit"],"pinyin":["xiao3"],"word":"曉"}],"containing_words":[],"sentences":[{"english":"Any fool can create wealth, but only the wise know what to do with it.","chinese":"愚者亦能創造財富，唯有智者才通曉用財之道。"},{"english":"She rarely had to access the Jedi archives; her knowledge of galactic politics was immense.","chinese":"她通曉銀河系的政治狀況，幾乎不用去查絕地檔案館。"},{"english":"Integration into the multi-ethnic life, proficient in English is essential.","chinese":"融入多元種族生活，通曉英語，至關重要。"},{"english":"The student knowing English will help him in learning French.","chinese":"這位學生通曉英語對他學法語很有幫助。"},{"english":"As a frequent moviegoer, I am keeping abreast of the latest development of Hollywood movies.","chinese":"我是電影院裏的常客，通曉好萊塢電影最新動態。"},{"english":"He knows all the Indian languages and dialects.","chinese":"他通曉印第安語和方言。"},{"english":"Michael is all genned up computers.","chinese":"邁克爾通曉計算機。"},{"english":"She thinks she knows all, as maybe most mothers do.","chinese":"她總認爲她通曉天下事，可能每位作母親的都是這樣。"},{"english":"Bob is a man of the world; why not go to him for advice?","chinese":"鮑勃是個通曉世故的人，幹嗎不去聽聽他的意見呢？"},{"english":"He telleth all things Past and to Come.","chinese":"他通曉所有的事物的過去和將來。"},{"english":"He knew all the local languages and dialects.","chinese":"他通曉當地所有的語言和方言。"},{"english":"Most of the students understand English well.","chinese":"這些學生中大多數通曉英語。"},{"english":"The worldly-wise students had seen videos of the Tiananmen massacre online.","chinese":"通曉世事的學生們曾在網上目睹當時的視頻。"},{"english":"He knew four languages and traveled around the kingdom for the leader.","chinese":"他通曉四種語言，並曾爲皇帝遍遊整個王國。"}],"related":[]}