{"definition":["ventilation duct"],"pinyin":["tong1 feng1 guan3"],"simplified":["通风管"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"通風管","characters":[{"definition":["classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)","to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc"],"pinyin":["tong1","tong4"],"word":"通"},{"definition":["wind\/news\/style\/custom\/manner\/CL:陣|阵[zhen4],絲|丝[si1]"],"pinyin":["feng1"],"word":"風"},{"definition":["surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["Guan3","guan3"],"word":"管"}],"containing_words":[],"sentences":[{"english":"Connect the vent hose to the axle shaft tube.","chinese":"向主動軸管上連接通風管。"},{"english":"Please fit the ventilation ducts.","chinese":"請裝上通風管道。"},{"english":"Once the ventilator shaft became blocked, the warehouse quickly filled with fumes.","chinese":"通風管一旦堵塞，倉庫很快就充滿了煙霧。"},{"english":"Or, at least, to buy another roll of duct tape.","chinese":"或者，至少，可以再買一圈採暖通風管。"},{"english":"The results of an actural use of the duct in a ship are also presented.","chinese":"同時還介紹了該種通風管制品在艦艇上的實用效果。"},{"english":"Actually, this is a special form of chimney and ventilation pipe.","chinese":"其實，這是特殊形式的煙囪和通風管道。"},{"english":"Please cut those air pipes carefully and keep the top boss safely.","chinese":"切除時請小心別傷到通風管的上半截。"},{"english":"Ventilation pipe is vital part of ventilation system.","chinese":"通風管道是通風系統的重要組成部分。"},{"english":"The Hisense air-conditioning has infinity transmitter near its draft flue.","chinese":"我家的海信空調通風管附近私藏有竊聽器。"},{"english":"How many airways are there in this coal mine?","chinese":"這個煤礦有多少個通風管道？"},{"english":"He stuffed the ventilator shafts up to stop the smoke from entering his room.","chinese":"他堵住了通風管道，用以防止煙氣進入他的房間。"},{"english":"Disconnect the vent hose from the axle shaft tube.","chinese":"從主動軸管上斷開通風管。"},{"english":"Smoke seeped in through the vents.","chinese":"濃煙從通風管中滲入。"}],"related":[]}