{"definition":["to understand clearly\/to be sensible or reasonable\/understanding"],"pinyin":["tong1 da2"],"simplified":["通达"],"rank":22593.0,"normalized_rank":0.3161053824521148,"fraction":0.0000018531859730122292,"cumulative_fraction":0.98029770975892,"word":"通達","characters":[{"definition":["classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)","to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc"],"pinyin":["tong1","tong4"],"word":"通"},{"definition":["surname Da","to attain\/to reach\/to amount to\/to communicate\/eminent"],"pinyin":["Da2","da2"],"word":"達"}],"containing_words":[{"definition":["morpheme access model (MA model)"],"pinyin":["ci2 su4 tong1 da2 mo2 xing2"],"word":"詞素通達模型"},{"definition":["word access model"],"pinyin":["ci2 tong1 da2 mo2 xing2"],"word":"詞通達模型"}],"sentences":[{"english":"The level of the open space determines the nature and hierarchy of the access.","chinese":"通達空間的層次決定了通路的性質和等級。"},{"english":"Move, and the way will open.","chinese":"跳舞吧，那扇門會開啓，那條路會通達。"},{"english":"Therefore the prudent shall keep silence in that time;","chinese":"所以通達人見這樣的時勢，必靜默不言。"},{"english":"Indeed he is so sensible about many things.","chinese":"的確，他對許多事物都通達明理。"},{"english":"Zhao Tongda also undertakes investigating to Wei Haifeng.","chinese":"趙通達也對魏海峯進行調查。"},{"english":"As for the shortcuts, but also access to one of the characteristics of the letter.","chinese":"至於快捷鍵，也是通達信的特色之一。"},{"english":"Shen Cong acute hearing be on bad terms with Zhao Tongda, divorce finally.","chinese":"沈聰聰和趙通達不和，最終離婚。"},{"english":"We have evolved as perspicuous of animals.","chinese":"我們已經進化成爲通達的動物了。"},{"english":"Understanding of Life is the reflection and exploration of life.","chinese":"《達生》是莊子對通達人生的思考和探索。"},{"english":"It is like a tree with roots, trunk, branches, leaves and finally fruits.","chinese":"結果是世出世間法，沒有一樣不通達。"},{"english":"The man that wandereth out of the way of understanding shall remain in the congregation of the dead.","chinese":"迷離通達道路的，必住在陰魂的會中。"},{"english":"Set inside the hospital \" place of appraisal of Jilin understand judicatory \" .","chinese":"醫院內設有“吉林通達司法鑑定所”。"},{"english":"The unfolding of your words gives light; it gives understanding to the simple.","chinese":"你的言語一解開，就發出亮光，使愚人通達。"},{"english":"China\"s central government information office didn\"t respond to calls seeking comment.","chinese":"中國中央府的新聞辦公室沒有迴應記者的置評小通達。"},{"english":"Today you don’t study history or literature to become a better person.","chinese":"今天你不會爲了變成通達之人而去學習歷史或文學。"},{"english":"When you meditate you get universal energy through your crown chakra into the whole of your body.","chinese":"冥想時萬物能量通過頂輪通達全身。"}],"related":[{"definition":["to link up\/to thread together"],"pinyin":["guan4 tong1"],"word":"貫通"},{"definition":["to move along one's course (of celestial bodies etc)\/(fig.) to function\/to be in operation\/(of a train service etc) to operate\/to run\/(of a computer) to run"],"pinyin":["yun4 xing2"],"word":"運行"},{"definition":["door\/strategic gateway\/portal\/faction\/sect\/family status\/family\/web portal\/(old) brothel"],"pinyin":["men2 hu4"],"word":"門戶"},{"definition":["to link\/to join\/to attach\/connection\/a link (on web page)"],"pinyin":["lian2 jie1"],"word":"連接"},{"definition":["system\/CL:個|个[ge4]"],"pinyin":["xi4 tong3"],"word":"系統"},{"definition":["to achieve\/to implement\/to realize\/to bring about"],"pinyin":["shi2 xian4"],"word":"實現"},{"definition":["to extend\/to expand\/extension\/expansion"],"pinyin":["kuo4 zhan3"],"word":"擴展"},{"definition":["to work\/to operate\/to revolve\/to turn around"],"pinyin":["yun4 zhuan3"],"word":"運轉"},{"definition":["border\/edge\/boundary\/interval\/between\/inter-\/to meet\/time\/occasion\/to meet with (circumstances)"],"pinyin":["ji4"],"word":"際"},{"definition":["abbr. for 黃帝內經|黄帝内经[Huang2 di4 Nei4 jing1], The Yellow Emperor's Internal Canon, medical text c. 300 BC"],"pinyin":["Nei4 jing1"],"word":"內經"},{"definition":["smooth and unhindered\/fluent"],"pinyin":["shun4 chang4"],"word":"順暢"},{"definition":["(conjunction used to express contrast with a previous clause) but\/then\/standard\/norm\/principle\/to imitate\/to follow\/classifier for written items"],"pinyin":["ze2"],"word":"則"},{"definition":["without inconvenience\/unimpeded\/unhindered\/unobstructed\/unfettered\/unhampered"],"pinyin":["wu2 ai4"],"word":"無礙"},{"definition":["to break new ground (for agriculture)\/to open up (a new seam)\/to develop (border regions)\/fig. to open up (new horizons)"],"pinyin":["kai1 tuo4"],"word":"開拓"},{"definition":["meteorological feature\/CL:個|个[ge4]\/meteorology\/atmosphere\/ambience\/scene"],"pinyin":["qi4 xiang4"],"word":"氣象"},{"definition":["to spur\/to provide impetus\/to drive"],"pinyin":["dai4 dong4"],"word":"帶動"}]}