{"definition":["speedometer"],"pinyin":["su4 du4 ji4"],"simplified":["速度计"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"速度計","characters":[{"definition":["fast\/rapid\/quick\/velocity"],"pinyin":["su4"],"word":"速"},{"definition":["to estimate\/Taiwan pr. [duo4]","to pass\/to spend (time)\/measure\/limit\/extent\/degree of intensity\/degree (angles, temperature etc)\/kilowatt-hour\/classifier for events and occurrences"],"pinyin":["du4","duo2"],"word":"度"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"計"}],"containing_words":[],"sentences":[{"english":"Well, the speedometer is worn out.","chinese":"嗯，速度計磨損了。"},{"english":"This paper discusses the static model of a multi-finger micromechanical accelerometer.","chinese":"討論了一種梳齒式微機械加速度計的靜態模型。"},{"english":"Test the accelerometers which is fixed in three-axis rotary table on the ground.","chinese":"第三，在地面進行加速度計的三軸轉檯實驗。"},{"english":"A novel non-contact fiber optic accelerometer is presented.","chinese":"介紹一種新型光纖非接觸加速度計。"},{"english":"The speedometer was indicating 95 mph.","chinese":"速度計指示着每小時95英里。"},{"english":"Another application refers to a wireless headset equipped with an accelerometer.","chinese":"另一項專利則描述了一種裝有加速度計的無線耳機。"},{"english":"The instrument that measures the speed is a speedometer.","chinese":"用來測定速度的儀器是速度計。"},{"english":"The speedometer was touching 120 mph .","chinese":"速度計接近120英里每小時。"},{"english":"Quartz resonator is a key part of the quartz vibrating beam accelerometer.","chinese":"石英諧振器是石英振梁式加速度計的關鍵部件。"},{"english":"Potting is a key step for the packaging of high-g micro-electro-mechanical system(MEMS) accelerometer.","chinese":"灌封是高量程微機械加速度計實用化的一個關鍵步驟。"},{"english":"\"Don't you ever look at the speedometer?\" the officer scolded.","chinese":"“你有沒有看一下速度計？”警官冷冷的問。"},{"english":"Silicon-micro-accelerometer is fabricated by plasma etch technology.","chinese":"採用等離子體刻蝕技術製作成硅微加速度計。"},{"english":"The piezoelectric acceleration sensor is a kind of common accelerometer.","chinese":"壓電式加速度變送器是一種常用的加速度計。"},{"english":"The speedometer is faulty.","chinese":"這個速度計有毛病。"},{"english":"PDA Piezoelectric Accelerometer, twistlock plug.","chinese":"PDA壓電式加速度計，卡口。"},{"english":"Accelerometer is one of the main inertial components in inertial measuring and navigation systems.","chinese":"加速度計是慣性測量和導航系統的主要慣性元件之一。"}],"related":[]}