{"definition":["one after the other\/a succession of\/a series of"],"pinyin":["lian2 chuan4"],"simplified":["连串"],"rank":33844.0,"normalized_rank":0.4735214696458802,"fraction":6.695993744156829e-7,"cumulative_fraction":0.9933112076241329,"word":"連串","characters":[{"definition":["surname Lian","to link\/to join\/to connect\/continuously\/in succession\/including\/(used with 也[ye3], 都[dou1] etc) even\/company (military)"],"pinyin":["Lian2","lian2"],"word":"連"},{"definition":["to string together\/to skewer\/to connect wrongly\/to gang up\/to rove\/string\/bunch\/skewer\/classifier for things that are strung together, or in a bunch, or in a row: string of, bunch of, series of\/to make a swift or abrupt linear movement (like a bead on an abacus)\/to move across"],"pinyin":["chuan4"],"word":"串"}],"containing_words":[{"definition":["a succession of\/a series of"],"pinyin":["yi1 lian2 chuan4"],"word":"一連串"}],"sentences":[{"english":"Looking at the artistic creations of Pan Li-hong gave rise to a series of thoughts.","chinese":"看了潘麗紅的美術創作，引發一連串的思考。"},{"english":"This cluster of record-breaking events could be merely an streak of bad luck.","chinese":"這一連串破紀錄的事件也許只是一連串的黴運。"},{"english":"This cluster of record-breaking events could be merely an streak of bad luck.","chinese":"這一連串破紀錄的事件也許只是一連串的黴運。"},{"english":"Black-tie dinners and champagne parties were being held in the capitals of Europe.","chinese":"歐洲各國首都則舉行了一連串正式慶祝晚宴。"},{"english":"Ben had it out with his roommate about coming back home so late and making a lot of noise.","chinese":"是有深夜遲歸引起一連串噪音，班因而與他起了口角。"},{"english":"The co-workers submitted a laundry list of complaints to the committee.","chinese":"員工向委員會提出一連串的抱怨。"},{"english":"English isn't just a list of English words.","chinese":"學習英語並非僅是死記一連串的單字。"},{"english":"Nobody foresaw the seismic events of the next eight years.","chinese":"沒人會想到接下8年的連串震撼性事件。"},{"english":"Children ask a seemingly never-ending stream of questions from an early age.","chinese":"孩子們從很小時就開始問一連串似乎永無止境的問題。"},{"english":"Bad days generally occur when a number of little frustrations happen in succession.","chinese":"糟糕的日子通常出現於當一連串小挫折連續發生時。"},{"english":"A series of explosions had rocked the Taj Mahal only despite midnight.","chinese":"子夜後，泰姬瑪哈大酒店響起了一連串的爆炸聲。"},{"english":"The list ended up with sweetbreads.","chinese":"那一連串菜單的最後一道是牛雜碎。"},{"english":"Various adversity has soured her view of life.","chinese":"一連串的不幸使她的人生觀變得酸腐。"},{"english":"In fact, Turtles could have had a string of losers in a row with multiple false breakouts .","chinese":"實際上，海龜們會因爲假突破而形成一連串的虧損。"},{"english":"Even in the sweltering heat, the milestones keep coming.","chinese":"儘管悶熱難當，我們已經跑過了一連串的里程碑。"},{"english":"The three candidates met in a series of debates.","chinese":"那三位候選人在一連串的辯論中碰面。"}],"related":[]}