{"definition":["to be related\/to entail\/to involve\/joint (liability etc)"],"pinyin":["lian2 dai4"],"simplified":["连带"],"rank":6807.0,"normalized_rank":0.09523876149035301,"fraction":0.000015347795733009823,"cumulative_fraction":0.89361273540453,"word":"連帶","characters":[{"definition":["surname Lian","to link\/to join\/to connect\/continuously\/in succession\/including\/(used with 也[ye3], 都[dou1] etc) even\/company (military)"],"pinyin":["Lian2","lian2"],"word":"連"},{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"帶"}],"containing_words":[{"definition":["to bear joint responsibility for sth\/joint liability (law)"],"pinyin":["lian2 dai4 ze2 ren4"],"word":"連帶責任"}],"sentences":[{"english":"Precise and predictable patterns of this MEFP design allow the agile LAM to use aim point selection for precision effects and minimum collateral damage.","chinese":"在選擇當中自主估算精確效果和最小量連帶損害值。"},{"english":"This tutorial window, with the original search box, should still be here.","chinese":"教程的窗口，連帶原來的搜索框，應該還在這。"},{"english":"The partners shall assume unlimited joint liability for the debts of the enterprise.","chinese":"合夥人對企業債務負連帶無窮責任。"},{"english":"The new partner shall bear unlimited joint and several liability for the debts of the partnership incurred before he enters into the partnership.","chinese":"新合夥人對入夥前合夥企業的債務承擔無限連帶責任。"},{"english":"This is connected, obviously, with Hobbes's denial of free will.","chinese":"這說法跟霍布士否定自由意志明顯有連帶關係。"},{"english":"There are internal and external validity and effectiveness of untruthful joint and several debt.","chinese":"不真正連帶債務分爲對內效力和對外效力。"},{"english":"He was the collateral damage.","chinese":"他是連帶被株連的犧牲品。"},{"english":"Such tort-feasors are jointly and severally liable.","chinese":"此種侵權行爲爲要承擔共同和連帶責任。"},{"english":"The hotel has a pool with bar and spacious sun terrace with loungers and umbrellas.","chinese":"酒店設有一個游泳池和一間連帶迷人海景露臺的餐廳。"},{"english":"But in spite of these associations, home and house are in reality very different.","chinese":"但儘管有這些連帶的關係，家與屋事實是很不相同的。"},{"english":"Overrule a plaintiff to require the other respondent the litigation solicit that the assumption connects to take liability to pay compensation.","chinese":"駁回原告要求其他被告承擔連帶賠償責任的訴訟請求。"},{"english":"Their home was destroyed — along with three puppies that were inside.","chinese":"最終這家人的屋子付之一炬，連帶屋中的三隻小狗。"},{"english":"He should undertake the duty of indemnity to the right spouse.","chinese":"應當承擔對受害配偶的連帶損害賠償責任。"},{"english":"Otherwise the original obligor and the new obligor are collectively and bisectally liable.","chinese":"其餘情況下，原債務人和新債務人承擔連帶責任。"},{"english":"In case there are two or more guarantors, they shall undertake guaranty liabilities jointly and severally.","chinese":"保證人爲二人以上的，相互之間負連帶保證責任。"},{"english":"All of the obligations of the Guarantor hereunder shall be joint several.","chinese":"擔保人在本擔保書項下承擔的義務均應是連帶的。"}],"related":[{"definition":["to lead to\/to create\/to cause\/to bring about"],"pinyin":["dao3 zhi4"],"word":"導致"},{"definition":["to intensify\/to sharpen\/to accelerate\/to aggravate\/to exacerbate\/to embitter"],"pinyin":["jia1 ju4"],"word":"加劇"},{"definition":["to trigger\/to spark"],"pinyin":["chu4 fa1"],"word":"觸發"},{"definition":["to be bound to\/undoubtedly will"],"pinyin":["shi4 bi4"],"word":"勢必"},{"definition":["thereupon\/subsequently\/accordingly"],"pinyin":["sui2 zhi1"],"word":"隨之"},{"definition":["on end\/in a row\/in succession"],"pinyin":["jie1 lian2"],"word":"接連"},{"definition":["majority\/most"],"pinyin":["duo1 shu4"],"word":"多數"},{"definition":["grave\/serious\/severe\/critical"],"pinyin":["yan2 zhong4"],"word":"嚴重"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"},{"definition":["to lead to\/to trigger\/to initiate\/to cause\/to evoke (emotions)"],"pinyin":["yin3 fa1"],"word":"引發"},{"definition":["slight\/light\/trivial\/to a small extent"],"pinyin":["qing1 wei1"],"word":"輕微"},{"definition":["to come apart"],"pinyin":["tuo1 jie2"],"word":"脫節"},{"definition":["to continue\/to persist\/sustainable\/preservation"],"pinyin":["chi2 xu4"],"word":"持續"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"},{"definition":["clear\/distinct\/obvious"],"pinyin":["ming2 xian3"],"word":"明顯"},{"definition":["not only (this one)\/not just (...) but also"],"pinyin":["bu4 jin3"],"word":"不僅"}]}