{"definition":["day after day\/for several days running"],"pinyin":["lian2 ri4"],"simplified":["连日"],"rank":16458.0,"normalized_rank":0.2302687728233039,"fraction":0.0000034973319843581704,"cumulative_fraction":0.9645809593694358,"word":"連日","characters":[{"definition":["surname Lian","to link\/to join\/to connect\/continuously\/in succession\/including\/(used with 也[ye3], 都[dou1] etc) even\/company (military)"],"pinyin":["Lian2","lian2"],"word":"連"},{"definition":["abbr. for 日本[Ri4 ben3], Japan","sun\/day\/date, day of the month"],"pinyin":["Ri4","ri4"],"word":"日"}],"containing_words":[],"sentences":[{"english":"Yad entrance mine market both showed a high consolidation positive trend.","chinese":"連日來進口礦市場皆呈現出高位盤整向上的趨勢。"},{"english":"Foreign - funded enterprises over the past few days have been close-out cigarettes on the deal.","chinese":"連日來外資企業已紛紛對香菸進行清倉處理。"},{"english":"Affected by the poor weather which has lasted for many weeks, lychee production in Doumen has decreased this year.","chinese":"受連日陰雨的影響，斗門荔枝今年的產量有所減少。"},{"english":"SERIES】A series of rainy days spoiled their vacation.","chinese":"連日的雨天，破壞了他們的假期。"},{"english":"Since the days of son for empathetic.","chinese":"談及兒子連日以來爲情所困。"},{"english":"The quake was the second to shake the Tokyo area in as many days.","chinese":"這場地震是連日來第二場發生在東京周邊的地震。"},{"english":"In recent days, Qiongshan City to take a major move to prefectural city Fengxiang Road correlation.","chinese":"連日來，瓊山市採取大動作，對府城鳳翔路進行整容。"},{"english":"Air Force days of the KMT held an emergency meeting to deploy air defense.","chinese":"國民黨空軍連日召開緊急會議，部署空防。"},{"english":"Sentiment was helped by signs of coordinated action to ease the global crisis.","chinese":"應對全球危機的一致行動緩解了連日以來的陰霾。"},{"english":"Asia's stock markets are calming down after days of heavy selling.","chinese":"亞洲股市經過連日股票拋售後星期四相對平穩。"},{"english":"Days of torrential rain in Prachuap County, Thailand, caused severe flooding.","chinese":"泰國巴蜀縣，連日豪雨淹水成災。"},{"english":"Heavy snowfall in provinces to the north had cut off parts of the busy railway line that starts in the city and ends in Beijing.","chinese":"連日的暴雪已經切斷了繁忙的京廣鐵路線的部分路段。"},{"english":"But Haitians ravenous from days without nourishment say the food is not nearly enough.","chinese":"但對連日來缺乏營養的海地人說，食品遠遠不夠。"},{"english":"Consecutive rainy days reduce summer heat in Beijing.","chinese":"連日陰雨，讓北京夏天的暑熱減去了幾分。"}],"related":[{"definition":["on end\/in a row\/in succession"],"pinyin":["jie1 lian2"],"word":"接連"},{"definition":["one after another\/in succession\/one by one\/continuously\/diverse\/in profusion\/numerous and confused\/pell-mell"],"pinyin":["fen1 fen1"],"word":"紛紛"},{"definition":["to be related\/to entail\/to involve\/joint (liability etc)"],"pinyin":["lian2 dai4"],"word":"連帶"},{"definition":["to visit\/to call on\/to seek\/to inquire\/to investigate"],"pinyin":["fang3"],"word":"訪"},{"definition":["frequency\/frequently\/repetitious"],"pinyin":["pin2"],"word":"頻"},{"definition":["time and again\/repeatedly\/frequently"],"pinyin":["lu:3"],"word":"屢"},{"definition":["one after another (idiom)\/in quick succession"],"pinyin":["jie1 er4 lian2 san1"],"word":"接二連三"},{"definition":["to intensify\/to sharpen\/to accelerate\/to aggravate\/to exacerbate\/to embitter"],"pinyin":["jia1 ju4"],"word":"加劇"},{"definition":["for this reason\/with regards to this\/in this respect\/in order to do this\/to this end"],"pinyin":["wei4 ci3"],"word":"為此"},{"definition":["region\/district"],"pinyin":["yi1 dai4"],"word":"一帶"},{"definition":["to worry\/anxiety (about)"],"pinyin":["you1 lu:4"],"word":"憂慮"},{"definition":["power\/influence\/potential\/momentum\/tendency\/trend\/situation\/conditions\/outward appearance\/sign\/gesture\/male genitals"],"pinyin":["shi4"],"word":"勢"},{"definition":["recently\/lately"],"pinyin":["jin4 lai2"],"word":"近來"},{"definition":["surrounding"],"pinyin":["wai4 wei2"],"word":"外圍"},{"definition":["to start out on a trip\/to dispatch troops"],"pinyin":["chu1 dong4"],"word":"出動"},{"definition":["immediately\/presently\/following which"],"pinyin":["sui2 ji2"],"word":"隨即"}]}