{"definition":["consecutive defeats\/to lose several times in a row"],"pinyin":["lian2 bai4"],"simplified":["连败"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"連敗","characters":[{"definition":["surname Lian","to link\/to join\/to connect\/continuously\/in succession\/including\/(used with 也[ye3], 都[dou1] etc) even\/company (military)"],"pinyin":["Lian2","lian2"],"word":"連"},{"definition":["to defeat\/to damage\/to lose (to an opponent)\/to fail\/to wither"],"pinyin":["bai4"],"word":"敗"}],"containing_words":[],"sentences":[{"english":"They have had good streaks and they have had bad streaks.","chinese":"他們既有連勝也有連敗。"},{"english":"He also lost four in a row to Andy Murray.","chinese":"與穆雷的對決，也是四陣連敗，無一勝蹟。"},{"english":"He broke a three-match losing streak in Rome last week and is hoping for better.","chinese":"上週在羅馬他擊破了三連敗魔咒，希望未來會更好。"},{"english":"LT: \"Well it was great to finally break our losing streak.\"","chinese":"太好了，我們的球隊終於結束了連敗的情況。"},{"english":"Wow… after that bad streak right before Yao came back I figured JVG was out of contention.","chinese":"姚明回來前的連敗我以爲老範已經退出了競爭的行列。"},{"english":"The Sixers lost their first 15 games before beating the Houston Rockets.","chinese":"76人在擊敗休斯頓火箭之前他們開局15連敗。"},{"english":"Coach Lawrence Frank was fired at 0-16.","chinese":"主教練弗蘭克在16連敗的時候被炒了魷魚。"},{"english":"But two successive defeats Sharapova, the group only theoretically possible.","chinese":"而兩連敗的莎拉波娃，小組出線僅剩理論上的可能。"},{"english":"Persistent train refers to a fading streak of light that remains after the fireball has vanished.","chinese":"持久性訓練是指衰落連敗的光後剩下的火球已經消失。"},{"english":"Yet the losses keep coming, in spectacular fashion.","chinese":"然而連敗還在以一種壯觀的方式繼續。"},{"english":"We're heartened by United losing their last two games.","chinese":"曼聯遭遇兩連敗，我們受此鼓舞。"}],"related":[]}