{"definition":["to link\/to connect"],"pinyin":["lian2 xi4"],"simplified":["连系"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"連繫","characters":[{"definition":["surname Lian","to link\/to join\/to connect\/continuously\/in succession\/including\/(used with 也[ye3], 都[dou1] etc) even\/company (military)"],"pinyin":["Lian2","lian2"],"word":"連"},{"definition":["to connect\/to arrest\/to worry","to tie\/to fasten\/to button up"],"pinyin":["ji4","xi4"],"word":"繫"}],"containing_words":[{"definition":["copula (linguistics)"],"pinyin":["lian2 xi4 ci2"],"word":"連繫詞"}],"sentences":[{"english":"The rafters, spaced at approximately 80cm centers, are nailed to the purlin.","chinese":"椽子釘在連繫樑上，中心間距爲80釐米。"},{"english":"Maintaining close community ties through participating wide-ranging activities.","chinese":"旅發局透過參與不同活動，與社會各界保持連繫。"},{"english":"Linking verbs are followed by a subject complement .","chinese":"連繫動詞之後須帶主語補語。"},{"english":"Where may I check in for United flight number 706?","chinese":"我該到哪裏辦連繫航空706次班機登機手續？"},{"english":"Paul wanted them to be knit together in love.","chinese":"保羅期望他們能用愛心互相連繫起來。"},{"english":"It reflects a chain-like interconnection between quantities .","chinese":"它反映了諸量之間的一種鏈式的連繫。"},{"english":"At the lower end of each roof slope, eaves purlins are provided over the ceiling joists.","chinese":"屋面兩坡的下方，檐口的連繫梁支承在平頂擱柵之上。"},{"english":"This year is the year of mid-term review of the UN Millennium Development Goals (MDGs).","chinese":"今年是連繫國千年成長方針中期審評年。"},{"english":"This being is linked or connected to the higher \"I\" from the point of Anthroposophy.","chinese":"這個存在體是跟人智學中的高層次的”我“連繫的。"},{"english":"I have a good bond with others in on-line brand community.","chinese":"我在虛擬品牌社區中與其他人有很好的連繫。"},{"english":"If you have any questions, please contact your insurance agent.","chinese":"如有任何疑問請連繫您的保險代理人。"},{"english":"For connection to occur, something powerful must touch something good.","chinese":"要有連繫出現，就必須有一股力量觸發美善。"},{"english":"The United Nations Security Council is charged with the maintenance of international peace and security.","chinese":"連繫國理事會負有維持國際寂靜與的責任。"},{"english":"I'll look to one of my classroom experiences to answer this one.","chinese":"我將連繫我的一項課堂教學實踐來解答這個問題。"},{"english":"Through that thread you are related to the body, and through that thread also you are related to your soul.","chinese":"經由那條線你與身體連繫，也同時與你的靈魂連結。"},{"english":"This domain name was expired; please contact with your service provider to renew it.","chinese":"這個域名已經過期，請連繫域名註冊商進行續用。"}],"related":[{"definition":["connection\/contact\/relation\/to get in touch with\/to integrate\/to link\/to touch"],"pinyin":["lian2 xi4"],"word":"聯繫"},{"definition":["inseparably close"],"pinyin":["jin3 mi4"],"word":"緊密"},{"definition":["to get in touch with\/to contact\/to stay in contact (with)\/liaison\/(math.) connection"],"pinyin":["lian2 luo4"],"word":"聯絡"},{"definition":["to interact\/interactive"],"pinyin":["hu4 dong4"],"word":"互動"},{"definition":["to join\/to connect\/to link up\/to communicate"],"pinyin":["gou1 tong1"],"word":"溝通"},{"definition":["variant of 關係|关系[guan1 xi5]"],"pinyin":["guan1 xi5"],"word":"關系"},{"definition":["to coordinate\/to harmonize\/to fit together\/to match (colors etc)\/harmonious\/concerted"],"pinyin":["xie2 tiao2"],"word":"協調"},{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"word":"協助"},{"definition":["to appeal\/to demand (an answer)\/requirement\/demand\/claim\/appeal\/(marketing) message"],"pinyin":["su4 qiu2"],"word":"訴求"},{"definition":["development\/growth\/to develop\/to grow\/to expand"],"pinyin":["fa1 zhan3"],"word":"發展"},{"definition":["between\/among\/inter-"],"pinyin":["zhi1 jian1"],"word":"之間"},{"definition":["information\/news\/message\/text message or SMS"],"pinyin":["xun4 xi1"],"word":"訊息"},{"definition":["to maintain\/to keep up\/to hold together"],"pinyin":["wei2 xi4"],"word":"維繫"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"},{"definition":["to yield\/to permit\/to let sb do sth\/to have sb do sth\/to make sb (feel sad etc)\/by (indicates the agent in a passive clause, like 被[bei4])"],"pinyin":["rang4"],"word":"讓"},{"definition":["steady\/stable\/stability\/to stabilize\/to pacify"],"pinyin":["wen3 ding4"],"word":"穩定"}]}