{"definition":["continuous casting (metallurgy)"],"pinyin":["lian2 zhu4"],"simplified":["连铸"],"rank":33742.0,"normalized_rank":0.4720943573097534,"fraction":6.75730434743884e-7,"cumulative_fraction":0.9932426238315698,"word":"連鑄","characters":[{"definition":["surname Lian","to link\/to join\/to connect\/continuously\/in succession\/including\/(used with 也[ye3], 都[dou1] etc) even\/company (military)"],"pinyin":["Lian2","lian2"],"word":"連"},{"definition":["to cast or found metals"],"pinyin":["zhu4"],"word":"鑄"}],"containing_words":[],"sentences":[{"english":"Oxy-hydrogen flame can replace other flames for cutting billet.","chinese":"完全可以代替其它燃氣用於連鑄坯切割。"},{"english":"Development and Application of Continuous Rolling Mill Set for Round Aluminum Pole in Qingtongxia Aluminum Group Co. , Ltd.","chinese":"電工圓鋁杆連鑄連軋機組在我公司的發展應用。"},{"english":"The principal processes and physical metallurgy of direct connection of continuous casting-hot rolling technology is reviewed.","chinese":"闡述了連鑄連軋的基本方式及其金屬學特點。"},{"english":"The possibility of transverse corner cracking in slab of peritectic carbon steel is greater than that of other carbon steels.","chinese":"介紹了影響包晶碳鋼角橫裂的連鑄工藝操作和設備。"},{"english":"The displayed models use 500 ccm ATV Motor which are already mass produced.","chinese":"展出的汽車模型，用500連鑄亞視目前已批量生產。"},{"english":"The paper introduces the stopper auto control system of Conti.","chinese":"介紹了鍊鋼廠連鑄生產中的塞棒自動控制系統。"},{"english":"The billet crack breakout would take place often in the process of continuous casting.","chinese":"鑄坯裂紋漏鋼在連鑄生產過程中經常發生。"},{"english":"This paper mainly introduces the application of magnesia coating in tundish for CSP caster.","chinese":"介紹鎂質噴塗料在CSP連鑄中間罐上的應用。"},{"english":"In this paper the on-line real-time detecting system of molder surface temperature of continuous casting is designed.","chinese":"設計了連鑄鑄坯表面溫度在線實時測量系統。"},{"english":"An investigation has been carried out into the \"metallurgical criterion\" of the slab solidification during continuous casting.","chinese":"本文論述了連鑄坯凝固冷卻過程的“冶金標準”。"},{"english":"Continuous casting low-temperature molten steel, micro-electricity of micro-micro-particle, and casting blank speeding-up and normal pouring.","chinese":"連鑄低溫鋼水，微微粒子的微電，鑄坯提速正常澆製。"},{"english":"Breakout prediction system (BOPS) is a key technical equipment of high efficient continuous casting technique.","chinese":"漏鋼預報系統屬於高效連鑄生產的關鍵工藝和裝備。"},{"english":"EUROSTRIP ○R direct strip production technology is steadily consolidating its advanced position in strip casting.","chinese":"技術在帶鋼連鑄生產領域穩居領先地位。"},{"english":"The electromagnetic soft-contact continuous casting(EMCC) technique is a novel technique.","chinese":"電磁軟接觸連鑄技術是一門新興技術。"},{"english":"A description is made of new technology for producing starter sheets of copper electrolysis by continuous casting and rolling.","chinese":"介紹了連鑄連軋法生產電解銅始極片的新工藝。"},{"english":"The paper introduces servo drive technology applied in Horizontal Continuous Casting System.","chinese":"本文介紹了伺服驅動技術在水平連鑄中的應用。"}],"related":[]}