{"definition":["to enter the capital\/to go to Beijing"],"pinyin":["jin4 Jing1"],"simplified":["进京"],"rank":11087.0,"normalized_rank":0.155121514418032,"fraction":0.0000069797742507764235,"cumulative_fraction":0.9379581209203558,"word":"進京","characters":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"},{"definition":["abbr. for Beijing\/surname Jing\/Jing ethnic minority","capital city of a country\/big\/algebraic term for a large number (old)\/artificial mound (old)"],"pinyin":["Jing1","jing1"],"word":"京"}],"containing_words":[],"sentences":[{"english":"The warfare becomes critical like this, having may let Gong does the east rather and alone go to the capital?","chinese":"戰事這樣喫緊，有沒有可能讓龔東寧單獨進京？"},{"english":"Group Vice President Kim Tae-Beijing to accept the award on behalf of group companies.","chinese":"集團公司副總經理金太代表集團公司進京領獎。"},{"english":"At the age of four, father to Beijing, into the Earth Institute kindergarten.","chinese":"四歲上，隨父進京，進入地科院幼兒園。"},{"english":"It was in the street, he accidentally received a petition to Beijing to complain to the case.","chinese":"那是他在街上無意中受理的一個進京上訪告狀案。"},{"english":"One scholar third go to the capital sitting the imperial examinations, and live in a regular live stores.","chinese":"有位秀才第三次進京趕考，住在一個經常住的店裏。"},{"english":"Traffic into Beijing is tightly regulated and vehicles need to have special permission to enter the capital.","chinese":"入京交通管制十分嚴格，車輛需獲得特許證方可進京。"},{"english":"Have place Xiucai third time to go to the capital rushing firmly having a test in, within a store who often lives.","chinese":"有位秀才第三次進京趕考，住在一個經常住的店裏。"},{"english":"Just don't know, does he how elect you up this to go to the capital.","chinese":"只是不知道，他要如何接你這個案首進京。"},{"english":"Pu seventies also want to test Beijing, but still not in the.","chinese":"蒲松齡七十多歲還欲進京考試，但是還是不中。"},{"english":"Without any delay, Laetitia began packing after put down the phone.","chinese":"霽霞毫未耽擱，撂下電話馬上收拾行李準備進京。"}],"related":[]}