{"definition":["to enter\/to join\/to go into"],"pinyin":["jin4 ru4"],"simplified":["进入"],"rank":231.0,"normalized_rank":0.003231989702405104,"fraction":0.0005127963387009236,"cumulative_fraction":0.4098899107639539,"word":"進入","characters":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"}],"containing_words":[],"sentences":[{"english":"And if war comes do such men as these shoulder the musket and go into the trenches?","chinese":"但一旦戰爭來臨，這類人會肩扛步槍進入戰壕嗎？"},{"english":"The deposit insurance fund fell into the red in 2009.","chinese":"存款保險資金在2009年進入紅色警戒區。"},{"english":"We enter the temple of the God of wealth will feel the feeling of beautiful decoration.","chinese":"我們進入財神廟便會感到金碧輝煌的感覺。"},{"english":"People in jeans were debarred .","chinese":"穿牛仔褲的人均未準進入。"},{"english":"Feel how you are coming into s state of Balance with the Earth.","chinese":"感受你現在進入到一種與地球完全合一的全然狀態。"},{"english":"She clicks on the link to the registration form and begins entering her information.","chinese":"她在登記表的連接處點擊一下，開始進入她的信息。"},{"english":"It is right before tollgate entering Jiangsu Province.","chinese":"就在進入江蘇省收費站之前。"},{"english":"Design of a switch, when to switch, the program re-entering the main requirement.","chinese":"設計一個開關，當進行切換後，程序再進入主要要求。"},{"english":"But, she's never achieved chart success with her music.","chinese":"但是她的音樂從沒有成功的進入過排行榜。"},{"english":"Phosphated bodies should be uniformly wet or dry when they enter the phosphate bath.","chinese":"磷化過的車身必須全溼或全乾狀態進入電泳槽。"},{"english":"As the police moved in, the hostages were running out, he said.","chinese":"隨着警方進入該區域，人質也都四散跑出。"},{"english":"Ark Angel now entering Earth orbit.","chinese":"“方舟天使”號現在進入地球軌道。"},{"english":"Water went down his throat and he started to choke.","chinese":"水進入他的喉嚨，他開始嗆住了。"},{"english":"Nani's passage to the World Cup with Portugal was plain sailing by comparison with Evra's exertions.","chinese":"納尼進入世界盃比起埃弗拉來講就順理成章的多。"},{"english":"When you go to a new school, you don't know the ground rules of how you are supposed to behave.","chinese":"當你進入一所新學校，常常不知道有何遵循的規矩。"},{"english":"In 840, large numbers of Uighurs (an ancient name for modern Uygurs) entered Xinjiang.","chinese":"公元840年，大批迴鶻人進入新疆。"}],"related":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"},{"definition":["to open\/to start\/(computing) to enable"],"pinyin":["kai1 qi3"],"word":"開啟"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"},{"definition":["to enter"],"pinyin":["zou3 jin4"],"word":"走進"},{"definition":["to separate oneself from\/to break away from\/diastasis (medicine)\/abscission\/abjunction (botany)"],"pinyin":["tuo1 li2"],"word":"脫離"},{"definition":["to begin\/beginning\/to start\/initial\/CL:個|个[ge4]"],"pinyin":["kai1 shi3"],"word":"開始"},{"definition":["termination\/to finish\/to end\/to conclude\/to close"],"pinyin":["jie2 shu4"],"word":"結束"},{"definition":["stage\/section\/phase\/period\/CL:個|个[ge4]"],"pinyin":["jie1 duan4"],"word":"階段"},{"definition":["to start (a machine)\/(fig.) to set in motion\/to launch (an operation)\/to activate (a plan)"],"pinyin":["qi3 dong4"],"word":"啟動"},{"definition":["to bloom\/to open\/to be open (to the public)\/to open up (to the outside)\/to be open-minded\/unrestrained by convention\/unconstrained in one's sexuality"],"pinyin":["kai1 fang4"],"word":"開放"},{"definition":["to become\/to turn into"],"pinyin":["cheng2 wei2"],"word":"成為"},{"definition":["and\/besides\/moreover\/furthermore\/in addition"],"pinyin":["bing4 qie3"],"word":"並且"},{"definition":["to open\/to show (a ticket)\/to turn on\/to switch on"],"pinyin":["da3 kai1"],"word":"打開"},{"definition":["to unfold\/to carry out\/to be in full swing\/to launch"],"pinyin":["zhan3 kai1"],"word":"展開"},{"definition":["period of time\/time\/time period\/period\/CL:個|个[ge4]"],"pinyin":["qi1 jian1"],"word":"期間"}]}