{"definition":["timeline\/work schedule"],"pinyin":["jin4 du4 biao3"],"simplified":["进度表"],"rank":45696.0,"normalized_rank":0.6393463265848642,"fraction":2.2319979147189425e-7,"cumulative_fraction":0.9981801874320412,"word":"進度表","characters":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"},{"definition":["to estimate\/Taiwan pr. [duo4]","to pass\/to spend (time)\/measure\/limit\/extent\/degree of intensity\/degree (angles, temperature etc)\/kilowatt-hour\/classifier for events and occurrences"],"pinyin":["du4","duo2"],"word":"度"},{"definition":["exterior surface\/family relationship via females\/to show (one's opinion)\/a model\/a table (listing information)\/a form\/a meter (measuring sth)"],"pinyin":["biao3"],"word":"表"}],"containing_words":[],"sentences":[{"english":"Carries out and supervises the regular Guestroom Servicing Programme according to the established schedule.","chinese":"根據進度表開展有序的客房維修程序並監督之。"},{"english":"The time schedule set down in the order is imperatively binding on the supplier.","chinese":"定單中所列進度表對供應商具有當然的約束力。"},{"english":"Record a baseline of your regular activities and determine a reasonable schedule.","chinese":"記錄平時鍛鍊的基準線，制定合理的進度表。"},{"english":"Draw a horizontal timeline with a dot at each end.","chinese":"畫一個每段結尾都帶有圓點的水平時間進度表。"},{"english":"According to the schedule- the first softbisexualngl batch process will feel produced on Octofeelr first this year.","chinese":"根據進度表，本年十月一日將初度批量坐褥。"},{"english":"You make plans and schedules and work toward them.","chinese":"你做出計劃，進度表，並根據他們分配工作。"},{"english":"I have the schedules and the scripts.","chinese":"我有進度表和腳本。"},{"english":"If you export a schedule, it will contain the data source configuration information.","chinese":"如果您導出進度表，那麼它將包含數據源配置信息。"},{"english":"A version of the syllabus and calendar is also available that lists all aspects of each class together.","chinese":"亦可取得詳列每堂課程內容的教學大綱與進度表。"},{"english":"Please follow the online Weekly Schedule and come to class well-prepared.","chinese":"請參照網路上的每週進度表並在上課前預作準備。"},{"english":"If you looked at the schedule I set forth.","chinese":"如果你看看我制定的進度表。"}],"related":[]}