{"definition":["entering and leaving a country"],"pinyin":["jin4 chu1 jing4"],"simplified":["进出境"],"rank":29363.0,"normalized_rank":0.4108264659381865,"fraction":9.954214375715155e-7,"cumulative_fraction":0.9896254497627072,"word":"進出境","characters":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["border\/place\/condition\/boundary\/circumstances\/territory"],"pinyin":["jing4"],"word":"境"}],"containing_words":[],"sentences":[{"english":"Objective To discuss the techniques and methods of rodents killing in in-and-out small - scale ships.","chinese":"目的探討進出境小型船舶滅鼠的技術和方法。"},{"english":"Loading and unloading inbound and outbound means of transport may be subject to supervision and control of the Customs.","chinese":"海關可以對進出境運輸工具裝卸貨物實施監裝監卸。"},{"english":"The Customs valuation of inward and outward articles shall be determined by the Customs according to law.","chinese":"進出境物品的完稅價格，由海關依法確定。"},{"english":"In China, ivories are also listed as prohibited items of entry and exit from the country.","chinese":"在中國，象牙製品也屬於禁止進出境物品之列。"},{"english":"The belongings of a temporary visitor who is leaving the country should not exceed travel needs.","chinese":"短期旅客攜帶進出境的行李物品應以旅行需用品爲限。"},{"english":"The dutiable price for inward and outward articles shall be determined by the Customs in accordance with law.","chinese":"進出境物品的完稅價格，由海關依法確定。"}],"related":[]}