{"definition":["to feed (a machine)\/foreign goods (abbr. of 進口資料|进口资料)"],"pinyin":["jin4 liao4"],"simplified":["进料"],"rank":35529.0,"normalized_rank":0.4970968057868006,"fraction":5.782173800001134e-7,"cumulative_fraction":0.99436155752314,"word":"進料","characters":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"},{"definition":["material\/stuff\/grain\/feed\/to expect\/to anticipate\/to guess"],"pinyin":["liao4"],"word":"料"}],"containing_words":[],"sentences":[{"english":"Both size and related position of the manhole and the feeding port are variable upon necessity.","chinese":"入孔與進料口的大小和相對位置，可根據需求改變。"},{"english":"It can also reach pre-screening purpose to increase feeding efficiency.","chinese":"給料機還可以進行預篩分，從而增加有效進料。"},{"english":"Optimum Design of Plastic Injection Mould Gate Based on MoldFlow;","chinese":"對透明塑料罩殼注射模結構，採用點澆口進料。"},{"english":"Auto settling & feeding, single layer or double layer packing film.","chinese":"自動理糖進料，單層或雙層包裝膜包裝。"},{"english":"The higher the pressure became, the more apparente the action of flow rate became.","chinese":"而壓力差提高，進料速率將起到明顯作用。"},{"english":"On the other hand, at high cell temperature, OCV is higher with low feed of methanol concentration.","chinese":"在高溫下，低濃度的甲醇進料擁有較高的開路電位。"},{"english":"For on-road diesel, judicious selection of easy-to-treat feedstock is a potential strategy.","chinese":"生產低硫柴油時，選擇容易脫硫之進料是上策之一。"},{"english":"It is the first time that end - charging has been adopted on a walking -beam type steel tube reheating, furnace in China.","chinese":"步進梁式鋼管再加熱爐端部進料在國內尚屬首例。"},{"english":"To melt the charge radio frequency induction heating or resistance heating have been used.","chinese":"爲了熔化進料，可用射頻感應加熱或電阻加熱法。"},{"english":"The combined stream then flows to the surge section of the Feed Reactor Drum .","chinese":"合併後的物流然後流入進料反應罐的緩衝段。"},{"english":"The most complex part of RFCC is in the feed injection zone.","chinese":"提升管的進料段是裂化反應最複雜的區域。"},{"english":"The check list is styourdard of incoming quality check for 1st portion raw material for rrev up.","chinese":"這個檢查表是爬坡坐蓐原資料進料檢驗的依據。"},{"english":"For the injection mold structure of transparent plastic cover shell, point gate feeding is adopted.","chinese":"對透明塑料罩殼注射模結構，採用點澆口進料。"},{"english":"Examples of parts our feeder systems process are molded parts, electrical contacts, diagnostic membranes, pallets, Tyvek sheets.","chinese":"我們進料系統進包括電氣接觸，診斷膜，托盤。"},{"english":"Article 3. The bonded factory shall be placed under Customs control.","chinese":"第三條進料加工保稅工廠受海關監管。"},{"english":"Materials will be mixed, respectively, after the three-tier co-extrusion blown film line to feed the population.","chinese":"將混合後的物料分別送到三層共擠吹膜設備的進料口。"}],"related":[]}