{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"simplified":["进行"],"rank":54.0,"normalized_rank":0.0007555300603024919,"fraction":0.0016529810152565068,"cumulative_fraction":0.2563664781915805,"word":"進行","characters":[{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"}],"containing_words":[{"definition":["progressive\/gradual"],"pinyin":["jin4 xing2 xing4"],"word":"進行性"},{"definition":["march (musical)"],"pinyin":["jin4 xing2 qu3"],"word":"進行曲"},{"definition":["primary progressive aphasia (PPA), speech disorder (sometimes related to dementia)"],"pinyin":["yuan2 fa1 xing4 jin4 xing2 xing4 shi1 yu3"],"word":"原發性進行性失語"},{"definition":["March of the Volunteer Army (PRC National Anthem)"],"pinyin":["Yi4 yong3 jun1 Jin4 xing2 qu3"],"word":"義勇軍進行曲"},{"definition":["to carry out a transaction"],"pinyin":["jin4 xing2 jiao1 yi4"],"word":"進行交易"},{"definition":["to have sex\/to have sexual intercourse"],"pinyin":["jin4 xing2 xing4 jiao1"],"word":"進行性交"},{"definition":["progressive aphasia\/gradual loss of speech"],"pinyin":["jin4 xing2 xing4 shi1 yu3"],"word":"進行性失語"},{"definition":["executable program"],"pinyin":["jin4 xing2 bian1 cheng2"],"word":"進行編程"},{"definition":["to communicate\/to carry out communications"],"pinyin":["jin4 xing2 tong1 xin4"],"word":"進行通信"}],"sentences":[{"english":"Jia-wen Luo do the experimental investigation and make a research summary and finish the research report.","chinese":"由羅家文進行實驗探究並將成果彙總並製成研究報告。"},{"english":"He transacts business with a large number of stores.","chinese":"他與很多商店進行交易。"},{"english":"Wants efficient changeovers between products with minimum downtime.","chinese":"用最少時間進行產品間轉換。"},{"english":"Some problems concerned with the mast cells in the cardiac wall were discussed in this paper.","chinese":"文中對心壁內這種細胞的有關問題進行了討論。"},{"english":"In this paper, we propose a mathematical model of planar reflector on the Solar pond.","chinese":"本文提出了太陽池反射板的數學模型，並進行了計算。"},{"english":"The paper studied 7 case Masked civet of dystocia in farm condition.","chinese":"本文對7例在養殖條件下難產的花面狸進行了研究。"},{"english":"The paper compares the economical efficiency of the VRV heat pump air condition system to the traditional heating systems.","chinese":"對VRV熱泵空調系統採暖的經濟性進行了分析比較。"},{"english":"The process of phytosterol extraction from soybean oil deodorizer distillate was studied.","chinese":"對脫臭餾出物中提取植物甾醇的工藝進行了研究。"},{"english":"At the same time, the use of coal exhaustive method to optimize selection.","chinese":"同時利用窮舉法對配煤進行優化選取。"},{"english":"The next step is to desaturate the layer that will take on the bloom effect.","chinese":"下一步是對圖層進行去飽和，圖層將獲得輝光效果。"},{"english":"The act expressly provides for injunctive relief.","chinese":"刑事救濟規定對受害人進行充分補償。"},{"english":"The epidemic was stopped before the annual pilgrimage to Mecca got under way.","chinese":"這傳染病在一年一度進行麥加朝聖之前停止。"},{"english":"No junketing activity would be conducted on official expenses without permission of the company.","chinese":"在未得到公司授權情況下，不得以公費進行宴請活動。"},{"english":"You work on your muscle groups in a certain order.","chinese":"對各個肌肉羣，你是在按照一個特定的順序進行。"},{"english":"I also worked at an insurance company for my graduate field work.","chinese":"並且我在一家保險公司進行了我的畢業設計。"},{"english":"The type of surgery is the first to be conducted on an infant.","chinese":"這是首次在初生嬰兒身上進行的同類型手術。"}],"related":[{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"},{"definition":["to launch\/to develop\/to unfold\/(of an exhibition etc) to open"],"pinyin":["kai1 zhan3"],"word":"開展"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["to pass through\/to penetrate\/by means of\/via"],"pinyin":["tou4 guo4"],"word":"透過"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"},{"definition":["to participate (in sth)"],"pinyin":["can1 yu4"],"word":"參與"},{"definition":["to evaluate\/to assess\/assessment\/evaluation"],"pinyin":["ping2 gu1"],"word":"評估"},{"definition":["to unfold\/to carry out\/to be in full swing\/to launch"],"pinyin":["zhan3 kai1"],"word":"展開"},{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge"],"pinyin":["bing4"],"word":"並"},{"definition":["to provide assistance\/to aid"],"pinyin":["xie2 zhu4"],"word":"協助"},{"definition":["and\/besides\/moreover\/furthermore\/in addition"],"pinyin":["bing4 qie3"],"word":"並且"},{"definition":["to organize\/organization\/(biology) tissue\/(textiles) weave\/CL:個|个[ge4]"],"pinyin":["zu3 zhi1"],"word":"組織"},{"definition":["general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead","to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])"],"pinyin":["jiang1","jiang4","qiang1"],"word":"將"},{"definition":["to implement\/to carry out\/to execute\/to run"],"pinyin":["zhi2 xing2"],"word":"執行"},{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有關"},{"definition":["to target\/to focus on\/to be aimed at or against\/in response to"],"pinyin":["zhen1 dui4"],"word":"針對"}]}