{"definition":["victim\/fatality"],"pinyin":["yu4 nan4 zhe3"],"simplified":["遇难者"],"rank":8928.0,"normalized_rank":0.12491430330334533,"fraction":0.000010035669891504113,"cumulative_fraction":0.9199467461705424,"word":"遇難者","characters":[{"definition":["surname Yu","to meet\/to encounter\/to treat\/to receive\/opportunity\/chance"],"pinyin":["Yu4","yu4"],"word":"遇"},{"definition":["difficult (to...)\/problem\/difficulty\/difficult\/not good","disaster\/distress\/to scold"],"pinyin":["nan2","nan4"],"word":"難"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"UN Secretary-General Ban Ki- moon has also extended his condolences.","chinese":"聯合國祕書長潘基文也對巴西火災遇難者表示哀悼。"},{"english":"The remaining victim, Boote, was also from the Royal Military police.","chinese":"另一名遇難者布特也來自皇家憲兵隊。"},{"english":"He is ordering flags at all government buildings to be flown at half-staff in honor of the victims.","chinese":"他已下令所有政府大樓降半旗悼念遇難者。"},{"english":"Unclaimed bodies of the victims, such as rehabilitation work is under way.","chinese":"遇難者遺體認領等善後工作也正在展開。"},{"english":"Memorial to the victims of genocide.","chinese":"種族大屠殺遇難者紀念碑。"},{"english":"Among the dead was Laith Misha'an, the leader of the local pro-government Sunni militia.","chinese":"其中一名遇難者爲當地支持政府派遜尼派義勇軍領袖。"},{"english":"Many families of the victims also holding a sign hanging family photos.","chinese":"很多遇難者家屬還舉着掛有親人照片的牌子。"},{"english":"Many victims' family members object to Arad's plan to list the names randomly.","chinese":"許多遇難者家屬反對阿拉德隨意排列死者姓名的方案。"},{"english":"DNA of Germanywing victims may be confirmed this week.","chinese":"德翼墜機遇難者DNA確認或本週內完成。"},{"english":"Reports suggested a 14-year-old boy was among those killed.","chinese":"有報道稱，遇難者中包括一名14歲的男孩。"},{"english":"A security guard watches as a relative of a fire victim breaks down.","chinese":"一位遇難者的親屬失聲痛哭，一名保安在一邊觀看。"},{"english":"A minute of silence was observed for the quake victims before the run.","chinese":"起跑前，全體與會者向汶川大地震遇難者默哀一分鐘。"},{"english":"The casualties included a young Israeli-American rabbi and his wife.","chinese":"遇難者包括一名以色列裔美國猶太教士和他的妻子。"},{"english":"He put the rock up for sale on an a auction site to raise money for earthquake victims.","chinese":"他把這顆巨石放上拍賣網以爲地震遇難者募款。"},{"english":"At least a dozen of the victims were local journalists.","chinese":"至少有十二名遇難者是當地的新聞記者。"},{"english":"At the edge of the little town, banners say Wufu is in ' deep mourning.","chinese":"五福鎮的邊緣地區掛著“深切哀悼”遇難者的標語。"}],"related":[]}