{"definition":["to wander\/to roam about\/to loaf about\/to be idle"],"pinyin":["you2 dang4"],"simplified":["游荡"],"rank":20116.0,"normalized_rank":0.28144893876009125,"fraction":0.000002367173197193092,"cumulative_fraction":0.9751141008683744,"word":"遊蕩","characters":[{"definition":["to walk\/to tour\/to roam\/to travel"],"pinyin":["you2"],"word":"遊"},{"definition":["to wash\/to squander\/to sweep away\/to move\/to shake\/dissolute\/pond"],"pinyin":["dang4"],"word":"蕩"}],"containing_words":[{"definition":["Ein Gespenst geht um in Europa.\/the opening sentence of Marx and Engels' \"Communist Manifesto\""],"pinyin":["Yi1 ge4 you1 ling2 zai4 Ou1 zhou1 you2 dang4"],"word":"一個幽靈在歐洲遊蕩"}],"sentences":[{"english":"So in the interest of helping out the next generation of thieves, I'm going to offer you a few pointers.","chinese":"所以，爲了有助於下一代遊蕩者們，我準備教你幾招。"},{"english":"We found people wandering like ghosts through the ruins .","chinese":"孤魂野鬼一樣的人們在廢墟里遊蕩。"},{"english":"People walked through the streets aimlessly with nowhere to go, carrying the few bags and possessions they had left.","chinese":"人們帶着僅剩的財物包裹漫無目的遊蕩。"},{"english":"We need to cough up the goop and not let it just hang out in the back of the throat.).","chinese":"我們需要這種糊狀物質，不讓他在咽喉裏遊蕩。"},{"english":"On average throughout all the quarter-million responses, minds were wandering 47 percent of the time.","chinese":"在25萬迴應中，平均下來思緒47%的時間在遊蕩。"},{"english":"Christlike vagrant wanders through a perverse and grotesque land filled with religious and sacrilegious imagery.","chinese":"像督流浪滿宗教瀆聖象異墮落遊蕩。"},{"english":"All love to be out by the light of the moon.","chinese":"它們都愛在月光下出來遊蕩。"},{"english":"When it was time for his appointment he drifted uptown to the club entrance.","chinese":"快到約會的時間，他遊遊蕩蕩地向夜總會的大門走去。"},{"english":"Drunken youths hang around outside looking for trouble.","chinese":"喝醉的年輕人在街頭遊蕩，酗酒滋事。"},{"english":"But stop and loiter all the time, to sing it in extatic songs.","chinese":"偶爾懶了遊蕩而已，哼着歌曲說說夢囈。"},{"english":"And there would be some strange people hanging out.","chinese":"會有一些奇奇怪怪的人在那裏遊蕩。"},{"english":"And I am told that it is haunted by the Ghost of Might-have-Been.","chinese":"我聽說這棟房子裏遊蕩着一個叫做“沒準”的鬼魂。"},{"english":"He also walked the streets by himself, observing and thinking.","chinese":"他也會一個人遊蕩在街頭，一邊觀察和思考。"},{"english":"The meteor has unleashed vicious alien creatures who roam the island in search of prey.","chinese":"流星釋放出的邪惡外星生物遊蕩在小島上找尋食物。"},{"english":"They love to swing from tree to tree.","chinese":"它們喜歡在樹間遊蕩。"},{"english":"Is there a sense of relief not walking around with Battlestar secrets anymore?","chinese":"不再隨神祕的太空堡壘四處遊蕩是否有一種解脫感呢？"}],"related":[{"definition":["to come and go\/to roam about (mostly unseen)\/(of a ghost) to haunt (a place)\/(of a criminal) to stalk (the streets)\/(of the sun) to rise and set"],"pinyin":["chu1 mo4"],"word":"出沒"},{"definition":["to walk around\/to move about\/to stretch one's legs\/to go for a walk\/to be mobile (e.g. after an illness)\/to visit one another\/to pay a visit (go to the toilet)"],"pinyin":["zou3 dong4"],"word":"走動"},{"definition":["all over the place\/everywhere and all directions"],"pinyin":["si4 chu4"],"word":"四處"},{"definition":["to loiter (i.e. reluctant to leave)\/to linger on"],"pinyin":["liu2 lian2"],"word":"流連"},{"definition":["alone"],"pinyin":["du2 zi4"],"word":"獨自"},{"definition":["to have nothing to do\/to idle one's time away (idiom)"],"pinyin":["wu2 suo3 shi4 shi4"],"word":"無所事事"},{"definition":["to make a noise\/noisy"],"pinyin":["xuan1 nao4"],"word":"喧鬧"},{"definition":["downtown area\/city center"],"pinyin":["nao4 shi4"],"word":"鬧市"},{"definition":["during the night\/at night\/nighttime"],"pinyin":["ye4 li5"],"word":"夜裡"},{"definition":["to look for"],"pinyin":["xun2 mi4"],"word":"尋覓"},{"definition":["to see\/to catch sight of"],"pinyin":["kan4 jian4"],"word":"看見"},{"definition":["to stare blankly\/to be stunned\/to be lost in thought"],"pinyin":["fa1 dai1"],"word":"發呆"},{"definition":["quiet"],"pinyin":["ji4 jing4"],"word":"寂靜"},{"definition":["to rock\/to sway\/to shake"],"pinyin":["huang4 dang5"],"word":"晃蕩"},{"definition":["to pass through"],"pinyin":["chuan1 guo4"],"word":"穿過"},{"definition":["coast\/seaside\/seashore\/beach"],"pinyin":["hai3 bian1"],"word":"海邊"}]}