{"definition":["to disassociate\/to drift away\/to leave (a collective)\/free (component)"],"pinyin":["you2 li2"],"simplified":["游离"],"rank":16559.0,"normalized_rank":0.23168189386201785,"fraction":0.0000034596697566277925,"cumulative_fraction":0.9649323172988584,"word":"遊離","characters":[{"definition":["to walk\/to tour\/to roam\/to travel"],"pinyin":["you2"],"word":"遊"},{"definition":["surname Li","to leave\/to part from\/to be away from\/(in giving distances) from\/without (sth)\/independent of\/one of the Eight Trigrams 八卦[ba1 gua4], symbolizing fire\/☲"],"pinyin":["Li2","li2"],"word":"離"}],"containing_words":[],"sentences":[{"english":"Epidural migration of a sequestrated disc to posterior epidural space is rare.","chinese":"遊離的髓核移位至後方硬膜外間隙是非常少見的。"},{"english":"Mechanical pulps are made to different freeness or drainage rates.","chinese":"機械漿根據不同的遊離度和濾水性生產。"},{"english":"Studying the chemical method in transforming lutein esters to lutein.","chinese":"建了化學法轉化葉黃素酯爲遊離態葉黃素的工藝。"},{"english":"Objective To evaluate the effects of curing scaring ectropion by transplanting dissociate skin petal.","chinese":"目的探討遊離皮瓣移植治療瘢痕性瞼外翻的效果。"},{"english":"Free CaO is the main factor affecting the distensibility of slag.","chinese":"遊離氧化鈣是造成轉爐渣膨脹的主要因素。"},{"english":"He said he swam away from the ship without even getting his hair wet.","chinese":"他說他遊離船身甚至連頭髮都沒有溼。"},{"english":"Applicable only to milk-based infant formula of calcium pantothenate or other free forms of pantothenic acid.","chinese":"本方法適用於含泛酸鈣及遊離泛酸的奶基嬰幼兒食品。"},{"english":"Objective To discuss the relation between fetal placenta product free estriol level and pregnancy outcome. Methods The free estriol was detected with immunofluorescence in pregnancy.","chinese":"目的探討胎兒胎盤產物遊離雌三醇水平與妊娠的關係。"},{"english":"Never is aluminum found free in nature .","chinese":"鋁在自然界從不以遊離態存在。"},{"english":"Oxygen, nitrogen and carbon monoxide molecules drift into the upper atmosphere, where solar radiation ionizes them.","chinese":"分子飄到大氣層上部時，會受太陽輻射而遊離。"},{"english":"Transplantation of skin with intact subdermal vascular plexus is a new type of skin graft.","chinese":"帶真皮下血管網皮膚遊離移植是一種新的植皮術。"},{"english":"The lone holdout among nations that negotiated this accord: the United States.","chinese":"唯一一個遊離在外的談判國家就是美國。"},{"english":"Free flap transfer is being increasingly used for DCIS.","chinese":"DCIS已越來越多地採用遊離瓣轉移。"},{"english":"Conclusion Transplanting dissociate skin petal is effective for scaring ectropion.","chinese":"結論耳後遊離皮瓣移植治療瘢痕性瞼外翻效果良好。"},{"english":"Quite a few female verses dissociate from the literary history.","chinese":"好象女性詩歌是遊離於文學史之外的另類。"},{"english":"Garlic's anti-oxidising function helps protect against harmful free radicals.","chinese":"大蒜具抗氧化作用，有助對抗有害的遊離基。"}],"related":[]}