{"definition":["to operate\/operations\/workings\/activities (usu. of an organization)\/thread (computing)"],"pinyin":["yun4 zuo4"],"simplified":["运作"],"rank":1849.0,"normalized_rank":0.02586990891665384,"fraction":0.00008412252703172565,"cumulative_fraction":0.7183166342438752,"word":"運作","characters":[{"definition":["to move\/to transport\/to use\/to apply\/fortune\/luck\/fate"],"pinyin":["yun4"],"word":"運"},{"definition":["to do\/to grow\/to write or compose\/to pretend\/to regard as\/to feel\/writings or works","worker\/workshop\/(slang) troublesome\/high-maintenance (person)"],"pinyin":["zuo1","zuo4"],"word":"作"}],"containing_words":[{"definition":["multithreading"],"pinyin":["duo1 gong1 yun4 zuo4"],"word":"多工運作"}],"sentences":[{"english":"Avoid shock loading and high overloads during mill operation.","chinese":"軋鋼時，避免衝擊負荷及過負荷運作。"},{"english":"At present, hospitals continue to operate on a fee-per-service model.","chinese":"目前，醫院繼續採取服務收費的運作模式。"},{"english":"Today it operates in 98 countries.","chinese":"今天，在九十八個國家運作。"},{"english":"Yes, I was last year formal abdication comes down to run Hefei group to buy a network.","chinese":"是的，我是去年正式辭職下來運作合肥團購網的。"},{"english":"Signification, on the other hand, comes into play in the Vorstellung.","chinese":"在另一方面，真實意義是在觀念的領域運作。"},{"english":"Thus, in the ordinary course of warehousing, the temptations to embezzle are strictly limited.","chinese":"所以在普通倉庫的運作中，侵佔的誘惑被嚴格限制了。"},{"english":"'Indra's Dart' operated via a circular 'reflector'.","chinese":"“因陀羅的標槍”經過一個圓形的“反射體”而運作。"},{"english":"In theory, Whitehall officials and ministers back in London oversaw the empire.","chinese":"從理論上說，倫敦白廳官員與部長們監視帝國運作。"},{"english":"The new legislation would have operated under a \"three strikes\" system.","chinese":"新的立法將在“事不過三”體系下運作。"},{"english":"Able to operate in a matrix management structure.","chinese":"熟悉矩陣式管理結構下的運作。"},{"english":"The close-ended fund meets the serious challenge on the securities market.","chinese":"封閉式基金在證券市場的運作上遇到嚴重的挑戰。"},{"english":"The platforms are operated using Advanced Ceramics Research’s integrated ground station.","chinese":"該平臺採用先進陶瓷研究公司的綜合地面站運作。"},{"english":"Does such an administration operate within the political system, or supplant it?","chinese":"這種管治是在既有政制中運作，抑或另起爐竈？"},{"english":"The light will move through the meridians and cells allowing for the act of regeneration.","chinese":"光將會通過經絡和細胞運作，從而允許再生行爲發生。"},{"english":"The workings of the incentive mechanism are based on priority-based reward system.","chinese":"這種激勵機制是通過基於優先權的報酬系統來運作的。"},{"english":"But if we work viscosity, all is changed.","chinese":"但是我們運作黏性，一切都隨之改變。"}],"related":[{"definition":["running\/operation (of airport, bus service, business etc)"],"pinyin":["ying2 yun4"],"word":"營運"},{"definition":["to be in operation\/to do business\/(of train, bus etc) to be in service\/operation\/service"],"pinyin":["yun4 ying2"],"word":"運營"},{"definition":["mechanism"],"pinyin":["ji1 zhi4"],"word":"機制"},{"definition":["to serve\/service\/CL:項|项[xiang4]"],"pinyin":["fu2 wu4"],"word":"服務"},{"definition":["to ensure\/to guarantee"],"pinyin":["que4 bao3"],"word":"確保"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["to move along one's course (of celestial bodies etc)\/(fig.) to function\/to be in operation\/(of a train service etc) to operate\/to run\/(of a computer) to run"],"pinyin":["yun4 xing2"],"word":"運行"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"規範"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"監管"},{"definition":["to construct\/to build\/infrastructure\/architecture\/framework"],"pinyin":["jia4 gou4"],"word":"架構"},{"definition":["to implement\/to carry out\/to put into practice"],"pinyin":["shi2 xing2"],"word":"實行"},{"definition":["steady\/stable\/stability\/to stabilize\/to pacify"],"pinyin":["wen3 ding4"],"word":"穩定"},{"definition":["to evaluate\/to assess\/assessment\/evaluation"],"pinyin":["ping2 gu1"],"word":"評估"},{"definition":["business\/professional work\/service\/CL:項|项[xiang4]"],"pinyin":["ye4 wu4"],"word":"業務"},{"definition":["condition\/state\/situation\/CL:個|个[ge4]"],"pinyin":["zhuang4 kuang4"],"word":"狀況"}]}