{"definition":["shipment\/to dispatch\/to ship out\/to send"],"pinyin":["yun4 chu1"],"simplified":["运出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"運出","characters":[{"definition":["to move\/to transport\/to use\/to apply\/fortune\/luck\/fate"],"pinyin":["yun4"],"word":"運"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[{"definition":["outward freight (accountancy)"],"pinyin":["yun4 chu1 yun4 fei4"],"word":"運出運費"}],"sentences":[{"english":"They were carrying four or five at a time.","chinese":"他們一次要運出來四五具屍體。"},{"english":"This was the holy ikon that had been brought away from Smolensk, and had accompanied the army ever since.","chinese":"這是從斯摩棱斯克運出並且從此就跟着軍隊的聖像。"},{"english":"Whatever sent the precious metals out of a country impoverished it.","chinese":"而將貴金屬從一個國家運出則會使其變窮。"},{"english":"Logs must be hauled out of the forest.","chinese":"木材應從森林運出來。"},{"english":"And the U. S. and Britain are airlifting by helicopter scores of people with special needs.","chinese":"美國和英國動用直升機把有特殊需要的人運出黎巴嫩。"},{"english":"They will case the bottles and ship them out.","chinese":"他們將把瓶子裝箱然後運出去。"},{"english":"Please complete a Limited Release tag and we will ship the box.","chinese":"請填寫一下免除責任行李牌，我們將運出。"},{"english":"All coal was moved from the work face by electrically-driven conveyors.","chinese":"所有的煤都用電動傳送帶從工作面運出來。"},{"english":"The loosened coal falls onto a conveyor for removal from the mine.","chinese":"鬆脫的煤塊落到傳送帶上，被運出礦井外。"},{"english":"S . and Britain are airlifting by helicopter scores of people with special needs .","chinese":"美國和英國動用直升機把有特殊需要的人運出黎巴嫩。"},{"english":"Quote both ways. I would like to see if it is feasible to ship packaged insoles out of Asia.","chinese":"散裝報價我想看看把包裝的鞋墊運出亞洲是否可行。"},{"english":"The machines ordered on the 10th April were despatched to your address yesterday.","chinese":"對於4月10日所訂機器，我們於昨天運出，請查收。"},{"english":"I can ship you out in my crate.","chinese":"我可以把你放在板條箱裏運出去。"},{"english":"This transaction is simple and risk free and the box can be shipped out in 48hrs.","chinese":"這項交易是簡單，無風險的箱運出，可在48小時。"},{"english":"“There were lorries coming out of the park with hundreds of tusks, ” she said.","chinese":"竟會有數百的象牙通過卡車運出國家公園。"},{"english":"Once removed from the mine, coal becomes merchandise available for sale.","chinese":"一旦運出了礦場，煤就成爲可供銷售的商品。"}],"related":[]}