{"definition":["to work\/to operate\/to revolve\/to turn around"],"pinyin":["yun4 zhuan3"],"simplified":["运转"],"rank":6040.0,"normalized_rank":0.08450743637457503,"fraction":0.00001836252568296245,"cumulative_fraction":0.8807313615974411,"word":"運轉","characters":[{"definition":["to move\/to transport\/to use\/to apply\/fortune\/luck\/fate"],"pinyin":["yun4"],"word":"運"},{"definition":["see 轉文|转文[zhuai3 wen2]","to revolve\/to turn\/to circle about\/to walk about\/classifier for revolutions (per minute etc): revs, rpm\/classifier for repeated actions","to turn\/to change direction\/to transfer\/to forward (mail)"],"pinyin":["zhuai3","zhuan3","zhuan4"],"word":"轉"}],"containing_words":[{"definition":["the time comes, fortune turns (idiom); to have a lucky break\/things change for the better"],"pinyin":["shi2 lai2 yun4 zhuan3"],"word":"時來運轉"}],"sentences":[{"english":"The result of running-in indicates that the refitting project is feasible.","chinese":"試運轉及裝車路試說明，改裝設計方案是可行的。"},{"english":"That is what revs his engine.","chinese":"這才能使他的發動機運轉。"},{"english":"The range fan needs a lot of power to run.","chinese":"抽油煙機需要很大的功率來運轉。"},{"english":"To ensure the hotel equipments operation normally and safety.","chinese":"確保酒店設備安全並正常運轉。"},{"english":"At present, Otis is operating in more than 200 ries and regions.","chinese":"目前，奧的斯電梯在200多個國家和地區運轉着。"},{"english":"But rather nature has been a sense set it into motion.","chinese":"自然已經是開始運轉了的。"},{"english":"Ocean waves move the hydraulic fluid, which spins the generator.","chinese":"海浪推動液壓油從而驅動發電機運轉。"},{"english":"Predictability is the ability of a machine to behave as expected.","chinese":"可預測性是機器按照期望的那樣來運轉的能力。"},{"english":"BesGas Three has remained in operation for decades since.","chinese":"此後，貝斯平第三氣體精煉廠持續運轉了幾十年。"},{"english":"The system is running smoothly with large through-put volume, easy to operate.","chinese":"人員通過量高，機械運轉平穩。"},{"english":"Ensure that the grille is in place while the machinery is in operation.","chinese":"機器運轉時一定要放好安全網罩。"},{"english":"Delivers you a peach blossom, a change inone's fortune from bad to good depends entirely on it.","chinese":"送你一隻桃花，時來運轉全靠它。"},{"english":"Our time will come.","chinese":"我們會時來運轉的。"},{"english":"The churn revolved as usual, but the butter would not come.","chinese":"攪黃油的機器照常運轉着，但是黃油就是攪不出來。"},{"english":"Once the flow of water stops or even slows down, the water mill, that is the economy, will stop moving.","chinese":"一旦水流減慢或停止，水磨坊，即經濟將停止運轉。"},{"english":"Adjustable relief valve, may be caused by non normal operation of hydraulic system.","chinese":"任意調整溢流閥後，可能會造成液壓系統非正常運轉。"}],"related":[{"definition":["to move along one's course (of celestial bodies etc)\/(fig.) to function\/to be in operation\/(of a train service etc) to operate\/to run\/(of a computer) to run"],"pinyin":["yun4 xing2"],"word":"運行"},{"definition":["to operate\/operations\/workings\/activities (usu. of an organization)\/thread (computing)"],"pinyin":["yun4 zuo4"],"word":"運作"},{"definition":["to rotate\/to revolve\/to spin\/to whirl"],"pinyin":["xuan2 zhuan3"],"word":"旋轉"},{"definition":["to rotate (about an axis)\/to revolve\/to turn\/to move in a circle\/to gyrate","to turn sth around\/to swivel"],"pinyin":["zhuan3 dong4","zhuan4 dong4"],"word":"轉動"},{"definition":["to drive\/to propel\/drive (vehicle wheel)\/drive mechanism (tape or disk)\/device driver (computing software)"],"pinyin":["qu1 dong4"],"word":"驅動"},{"definition":["track (for trains etc)\/orbit (of a satellite)\/(fig.) a person's established path in life\/desired trajectory (of a business or other endeavor)\/(audio engineering) track\/(quantum mechanics) orbital"],"pinyin":["gui3 dao4"],"word":"軌道"},{"definition":["change\/variation\/to change\/to vary\/CL:個|个[ge4]"],"pinyin":["bian4 hua4"],"word":"變化"},{"definition":["to disturb\/to interfere\/perturbation\/interference (physics)"],"pinyin":["gan1 rao3"],"word":"干擾"},{"definition":["smooth\/steady"],"pinyin":["ping2 wen3"],"word":"平穩"},{"definition":["(of Taoists) to practice austerities\/to practice asceticism"],"pinyin":["xiu1 lian4"],"word":"修煉"},{"definition":["brain\/cerebrum"],"pinyin":["da4 nao3"],"word":"大腦"},{"definition":["to achieve\/to implement\/to realize\/to bring about"],"pinyin":["shi2 xian4"],"word":"實現"},{"definition":["system\/CL:個|个[ge4]"],"pinyin":["xi4 tong3"],"word":"系統"},{"definition":["to undulate\/to fluctuate\/wave motion\/rise and fall"],"pinyin":["bo1 dong4"],"word":"波動"},{"definition":["(line of) thought\/thinking"],"pinyin":["si1 wei2"],"word":"思維"},{"definition":["to change\/to switch\/to convert\/to transform"],"pinyin":["zhuan3 huan4"],"word":"轉換"}]}