{"definition":["to move along one's course (of celestial bodies etc)\/(fig.) to function\/to be in operation\/(of a train service etc) to operate\/to run\/(of a computer) to run"],"pinyin":["yun4 xing2"],"simplified":["运行"],"rank":1177.0,"normalized_rank":0.01646775705511172,"fraction":0.00013732786855985525,"cumulative_fraction":0.6460952397950847,"word":"運行","characters":[{"definition":["to move\/to transport\/to use\/to apply\/fortune\/luck\/fate"],"pinyin":["yun4"],"word":"運"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"}],"containing_words":[{"definition":["luggage that has been checked in (on flight)"],"pinyin":["tuo1 yun4 xing2 li5"],"word":"托運行李"},{"definition":["to decommission"],"pinyin":["tui4 chu1 yun4 xing2"],"word":"退出運行"},{"definition":["operating method\/running mode"],"pinyin":["yun4 xing2 fang1 shi4"],"word":"運行方式"},{"definition":["run-time (in computing)"],"pinyin":["yun4 xing2 shi2"],"word":"運行時"},{"definition":["run-time error (in computing)"],"pinyin":["yun4 xing2 shi2 cuo4 wu4"],"word":"運行時錯誤"},{"definition":["operational state\/running state"],"pinyin":["yun4 xing2 zhuang4 kuang4"],"word":"運行狀況"}],"sentences":[{"english":"An application that can run statics analysis on sports matches .","chinese":"一個應用程序可以運行在體育靜力學的研究與分析。"},{"english":"This is a very good Huffman tree C code can run.","chinese":"這是一個很不錯的赫夫曼樹C代碼，可以運行。"},{"english":"It provides the opportunity to test unrelated applications running together.","chinese":"它提供了測試一起運行的無關應用程序的機會。"},{"english":"All kinds of protective device make sure tranverse mobile platform safe running .","chinese":"多種安全保護裝置保證移車平臺安全運行。"},{"english":"Registratie ongedaan maken van de User Account Control Support Library is mislukt.","chinese":"取消用戶賬戶支持運行庫失敗。"},{"english":"An easy to use collaborative environment for editing and running features. There is already RubyMine and LowDown, but I have some different ideas myself.","chinese":"提供易於使用的協助環境來編輯和運行相關功能。"},{"english":"Operation of a power system disconnected from neighboring power systems.","chinese":"一個電力系統與相鄰系統解列後的一種運行。"},{"english":"This almost-falling into chaos keeps life proliferating.","chinese":"這種幾近墜落乃至混沌的運行狀態確保了生命的增殖。"},{"english":"Both servers are running with one partition only.","chinese":"這兩臺服務器都只以一個分區運行。"},{"english":"Designing G-Code compiling environment.","chinese":"設計了G代碼編譯運行環境。"},{"english":"You can also export the test classes to run in Integration Edition.","chinese":"您還可以導出測試類以便在集成版中運行它們。"},{"english":"This function terminates the running process and all the associated threads.","chinese":"這個函數終止運行中的進程及其相關線程。"},{"english":"Using schedules and user groups enables control over how the tests run.","chinese":"使用測試調度和用戶組能夠控制測試的運行。"},{"english":"Please Populate Memory in Pairs for Normal Operation.","chinese":"請成對安裝內存模塊以使其正常運行。"},{"english":"The world famous brand electrical control components to ensure long-term trouble-free operation of the machine.","chinese":"世界名牌電器控制元器件，確保機器長期無故障運行。"},{"english":"I get the program \"running\" I have noway of assessing its quality.","chinese":"在程序真正運行之前，沒有辦法評估其質量。"}],"related":[{"definition":["to operate\/operations\/workings\/activities (usu. of an organization)\/thread (computing)"],"pinyin":["yun4 zuo4"],"word":"運作"},{"definition":["to work\/to operate\/to revolve\/to turn around"],"pinyin":["yun4 zhuan3"],"word":"運轉"},{"definition":["track (for trains etc)\/orbit (of a satellite)\/(fig.) a person's established path in life\/desired trajectory (of a business or other endeavor)\/(audio engineering) track\/(quantum mechanics) orbital"],"pinyin":["gui3 dao4"],"word":"軌道"},{"definition":["system\/CL:個|个[ge4]"],"pinyin":["xi4 tong3"],"word":"系統"},{"definition":["to adjust\/adjustment\/revision\/CL:個|个[ge4]"],"pinyin":["tiao2 zheng3"],"word":"調整"},{"definition":["trend\/tendency"],"pinyin":["qu1 shi4"],"word":"趨勢"},{"definition":["to start (a machine)\/(fig.) to set in motion\/to launch (an operation)\/to activate (a plan)"],"pinyin":["qi3 dong4"],"word":"啟動"},{"definition":["to continue\/to persist\/sustainable\/preservation"],"pinyin":["chi2 xu4"],"word":"持續"},{"definition":["expansion\/dilation\/to expand (e.g. one's power or influence)\/to broaden"],"pinyin":["kuo4 zhang1"],"word":"擴張"},{"definition":["to undulate\/to fluctuate\/wave motion\/rise and fall"],"pinyin":["bo1 dong4"],"word":"波動"},{"definition":["theory\/CL:個|个[ge4]\/to argue\/to take notice of"],"pinyin":["li3 lun4"],"word":"理論"},{"definition":["to flow\/to circulate\/to go from place to place\/to be mobile\/(of assets) liquid"],"pinyin":["liu2 dong4"],"word":"流動"},{"definition":["to correspond\/a correspondence\/corresponding\/homologous\/matching with sth\/counterpart"],"pinyin":["dui4 ying4"],"word":"對應"},{"definition":["to keep\/to maintain\/to preserve"],"pinyin":["wei2 chi2"],"word":"維持"},{"definition":["border\/edge\/boundary\/interval\/between\/inter-\/to meet\/time\/occasion\/to meet with (circumstances)"],"pinyin":["ji4"],"word":"際"},{"definition":["rule (e.g. of science)\/law of behavior\/regular pattern\/rhythm\/discipline"],"pinyin":["gui1 lu:4"],"word":"規律"}]}