{"definition":["to make life difficult for\/to embarrass\/unable to make it through"],"pinyin":["guo4 bu5 qu4"],"simplified":["过不去"],"rank":19966.0,"normalized_rank":0.27935024414813986,"fraction":0.000002402207827639956,"cumulative_fraction":0.9747565648738276,"word":"過不去","characters":[{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"},{"definition":["(negative prefix)\/not\/no"],"pinyin":["bu4"],"word":"不"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"Why do you always speak evil things of me and not good?","chinese":"爲什麼你總是對我過不去，說惡不說好？"},{"english":"When somebody chooses you…We talked about this. You stand up. You be a man.","chinese":"有人跟你過不去，你要面對他，要像個男人。"},{"english":"Everything has been going wrong today.","chinese":"今天似乎每件事都跟我過不去。"},{"english":"The road was too narrow for cars to pass.","chinese":"這條路太窄，車子過不去。"},{"english":"The farrier, a small man with a sharp face, always enjoyed disagreeing with the butcher.","chinese":"長着尖臉的小個子馬掌匠最愛和屠戶過不去。"},{"english":"They had difficulties with the people of the country and with the law.","chinese":"他們是同這個國家的人民和法律過不去。"},{"english":"Some politicians seem to have it in for the environment these days.","chinese":"近來，一些政客們似乎總是和環境過不去。"},{"english":"Everything allows nature to take its course, the senior general demeanor, do not not be able to pass with oneself.","chinese":"凡事順其自然，大將風度，不要跟自己過不去。"},{"english":"I promised not to go there.","chinese":"我答應過不去那兒。"},{"english":"I'm not saying this to disparage kids.","chinese":"我這麼說並非和孩子們過不去。"},{"english":"You shouldn't worry about the present either. There is no river that can't be crossed.","chinese":"你對目前的申請別犯愁，沒有過不去的河嘛。"},{"english":"John's pals were giving him a hard time about his girlfriend.","chinese":"約翰的朋友們因爲他的女朋友而和他過不去。"},{"english":"because it's, otherwise not really doable.","chinese":"因爲，否則就過不去了。"},{"english":"Way on the face very hard time, but also hard support.","chinese":"路子面子上很過不去，卻還硬撐着。"},{"english":"The road is too narrow for the truck to pass.","chinese":"路太窄了，卡車過不去了。"}],"related":[]}