{"definition":["lit. can pass through (an opening)\/fig. can get by (in life)\/tolerably well\/not too bad\/How are you getting by?\/How's life?"],"pinyin":["guo4 de2 qu4"],"simplified":["过得去"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"過得去","characters":[{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"}],"containing_words":[],"sentences":[{"english":"I'm able to get by, but it could be better.","chinese":"我的餬口還過得去，不過還可以更好。"},{"english":"Don't bother to move I think I can just brush past.","chinese":"用不着讓開，我想我剛好能過得去。"},{"english":"I'd say her work is of a reasonable standard.","chinese":"我認爲她的工作水平還過得去。"},{"english":"Use a decent camera.","chinese":"買個還過得去的相機。"},{"english":"Well, maybe you can go without it for awhile, until you do find a used version.","chinese":"也許，在找到一個二手的之前，一時沒有它也過得去。"},{"english":"B: I'm able to get by, but it could be better.","chinese":"我的生活還過得去，不過還可以更好。"},{"english":"Does the new manager pass muster?","chinese":"新的經理還過得去嗎？"},{"english":"His pronunciation, if not good, is at least tolerable.","chinese":"他的發音如果說不算好，至少也還過得去。"},{"english":"Your work will get by,but try to improve it.","chinese":"你的作業還過得去，但要努力改進。"}],"related":[]}