{"definition":["past participle (in European grammar)"],"pinyin":["guo4 qu5 fen1 ci2"],"simplified":["过去分词"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"過去分詞","characters":[{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"},{"definition":["to go\/to go to (a place)\/(of a time etc) last\/just passed\/to send\/to remove\/to get rid of\/to reduce\/to be apart from in space or time\/to die (euphemism)\/to play (a part)\/(when used either before or after a verb) to go in order to do sth\/(after a verb of motion indicates movement away from the speaker)\/(used after certain verbs to indicate detachment or separation)"],"pinyin":["qu4"],"word":"去"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"},{"definition":["word\/statement\/speech\/lyrics\/CL:組|组[zu3],個|个[ge4]\/a form of lyric poetry, flourishing in the Song dynasty 宋朝|宋朝[Song4 chao2]\/CL:首[shou3]"],"pinyin":["ci2"],"word":"詞"}],"containing_words":[],"sentences":[{"english":"Past participles (- ed form) for adjectives of passive or completed actions.","chinese":"過去分詞表達完成或被動感覺的形容詞。"},{"english":"Strewbis most commonly used in the past participle formbstrewn.","chinese":"多見於其過去分詞形式。"},{"english":"Do you mean present and past participles?","chinese":"那一定是指現在分詞或過去分詞了。"},{"english":"The past participle used as object complement.","chinese":"過去分詞用作賓語補足語。"},{"english":"Praised by the teacher, the student smiled happily.","chinese":"在此過去分詞表示學生被老師表揚。"},{"english":"Do you know how to write the past participle of this irregular verb?","chinese":"你知道這個不規則動詞的過去分詞怎麼寫嗎？"},{"english":"Who knows the Past Tense and the Past Participle form of this verb?","chinese":"誰知道一般過去時和這個動詞的過去分詞？"},{"english":"Past tense and past participle of the composition method.","chinese":"過去式和過去分詞的構成方法。"},{"english":"Used with past participle to form passive voice.","chinese":"與過去分詞連用，成被動態。"}],"related":[]}