{"definition":["peroxide"],"pinyin":["guo4 yang3 hua4 wu4"],"simplified":["过氧化物"],"rank":49087.0,"normalized_rank":0.6867908161123781,"fraction":1.5911561327950606e-7,"cumulative_fraction":0.9988216956018324,"word":"過氧化物","characters":[{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"},{"definition":["oxygen (chemistry)"],"pinyin":["yang3"],"word":"氧"},{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"},{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"}],"containing_words":[{"definition":["myeloperoxidase (aka MPO) (molecular biology)"],"pinyin":["sui3 guo4 yang3 hua4 wu4 mei2"],"word":"髓過氧化物酶"}],"sentences":[{"english":"Insulin was labeled with horseradish peroxidase by sodium periodate oxidation method.","chinese":"用高碘酸鈉氧化法將辣根過氧化物酶標記於胰島素。"},{"english":"Presently, Peroxidase is employed as indicator for blanching treatments of vegetables.","chinese":"目前蔬菜的熱燙終點以過氧化物酶作爲指示劑來確定。"},{"english":"May form explosive peroxides.","chinese":"可能生成爆炸性過氧化物。"},{"english":"Orgnic peroxides are the initiators used in polymerization.","chinese":"有機過氧化物可用作聚合引發劑。"},{"english":"The activity of manganese-dependent peroxidase was determined by using guaiacol as substrate.","chinese":"擬定了用愈創木酚測定錳過氧化物酶活力的方法。"},{"english":"The crystals were confirmed to be the SHP crystal through enzyme activity test.","chinese":"活性檢測證實，所得到的晶體爲過氧化物酶晶體。"},{"english":"The effect of peroxide to aggrandize bromoform sonolysis is proved.","chinese":"驗證了過氧化物對超聲波處理溴仿的強化作用。"},{"english":"It is well known that hydroperoxides are unstable and decompose spontaneously.","chinese":"這是衆所周知，氫過氧化物是不穩定的和自發分解。"},{"english":"During bulb morphogenesis, the activity and the number of isozymic bands of peroxidase increased.","chinese":"鱗莖發生過程中過氧化物酶活性及同工酶帶逐漸增加。"},{"english":"Changes in activity of peroxidase in leaf disks of Vitis bryonifolia under salinity were investigated.","chinese":"研究了鹽漬下華北葡萄葉過氧化物酶活性變化。"},{"english":"Glutathione peroxidase ( GSH - Px ) acts as a free radical scavenger .","chinese":"谷胱甘肽過氧化物酶是生物機體內的自由基清除劑。"},{"english":"Coagent Selection For Peroxide-Cured Elastomers , from Sartomer Company, Inc. It is good for Peroxide-cured rubber compound design.","chinese":"美國沙多瑪公司，過氧化物硫化共架橋劑選擇資料。"},{"english":"Hormones and nutritional factor can regulate peroxisome proliferation response.","chinese":"持續的過氧化物酶體增殖可導致肝癌。"},{"english":"Selenium content in wool is closely related to erytlirocyte glutathione peroxidase activity in blood of sheep .","chinese":"羊毛硒含量與羊血谷胱甘肽過氧化物酶活性顯著相關。"},{"english":"The activity of glutathione peroxidase of serum was measured.","chinese":"同時測定血清谷光苷肽過氧化物酶活性。"},{"english":"The hydroperoxides are unstable compounds .","chinese":"氫過氧化物是不穩定的化合物。"}],"related":[]}