{"definition":["too much\/excessively"],"pinyin":["guo4 yu2"],"simplified":["过于"],"rank":3502.0,"normalized_rank":0.0489975235403579,"fraction":0.000039596431286299105,"cumulative_fraction":0.8126451483735794,"word":"過於","characters":[{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[{"definition":["nothing can surpass"],"pinyin":["mo4 guo4 yu2"],"word":"莫過於"},{"definition":["supply exceeds demand"],"pinyin":["gong1 guo4 yu2 qiu2"],"word":"供過於求"}],"sentences":[{"english":"Greek men were said to be a bit too soppy .","chinese":"希臘男人被認爲有點“過於纏綿”。"},{"english":"The most interesting thing was to climb the Fragrant Mount.","chinese":"最有趣的事情莫過於爬香山了。"},{"english":"The Way of the Dragon God believes that the heart, more than anything else, points the way forward.","chinese":"龍神道相信指引方向的最大力量莫過於心。"},{"english":"Others said the plan was too big.","chinese":"還有的人說該計劃過於寵大。"},{"english":"Widdowson ever criticized, \"Structuralism focuses on language analysis and only reflects one aspect of communicative competence.\"","chinese":"而交際法有，過於恰恰相反注重語言在語境中的運用。"},{"english":"But don't over-intellectualize your emotional reaction. Instead, get out of your head and trust your instincts.","chinese":"不要不要對自己的情感過於理智，相信你的直覺。"},{"english":"On the whole it's a good plan and we shouldn't nitpick .","chinese":"總的來說，這個計劃是好的，我們不應過於挑剔。"},{"english":"The style of the website, must have successional , cannot too too bouncing.","chinese":"網站的風格，一定要有連續性，不能太過於跳躍。"},{"english":"Select the right clothes, do not wear baggy clothes.","chinese":"不要穿過於鬆垮肥大的衣服，穿着一定要合身。"},{"english":"The new version emphasizes their looks and emotions too much, some say.","chinese":"有人認爲新劇過於強調他們的外表和情感了。"},{"english":"Our elders exaggerate about love in college. They say love is a waste of time and money.","chinese":"我們長輩們總是過於誇張大學校園裏的愛情。"},{"english":"For many young people their ego, or over-confidence, could be their Achilles' heel.","chinese":"年輕人的弱點也許是自負，過於的自信。"},{"english":"He had had enough of violence. Some of the people around today seemed to enjoy what they did far too much.","chinese":"但現在有些人似乎過於享受自己的暴力行動。"},{"english":"'There was a period we became too profit oriented, ' he said. Mr.","chinese":"他說，曾有一段時間豐田變得過於以利潤爲導向。"},{"english":"However, the interface is slightly cluttered and the selection of hotels is limited.","chinese":"但是界面設計有點過於緊湊，酒店的選擇也非常有限。"},{"english":"In sending twenty, they had been perhaps a little over-zealous.","chinese":"而他們往倫敦投送了20顆，表現得真是過於積極了。"}],"related":[]}