{"definition":["overload"],"pinyin":["guo4 zai4"],"simplified":["过载"],"rank":33316.0,"normalized_rank":0.4661340646118114,"fraction":7.014224970715841e-7,"cumulative_fraction":0.9929491156678508,"word":"過載","characters":[{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"},{"definition":["to carry\/to convey\/to load\/to hold\/to fill up\/and\/also\/as well as\/simultaneously","to record in writing\/to carry (i.e. publish in a newspaper etc)\/Taiwan pr. [zai4]\/year"],"pinyin":["zai3","zai4"],"word":"載"}],"containing_words":[],"sentences":[{"english":"Configuration of adjustable overtemperature protection, motor overload protection.","chinese":"配置可調式超溫保護，馬達過載保護。"},{"english":"How Does Bloglines Cure Information Overload?","chinese":"博客訂閱如何處理信息過載？"},{"english":"This article is not intended to provide a guide to the mechanisms by which overloading and partitioning can be prevented.","chinese":"本文將不對阻止過載或是劃分的機制介紹。"},{"english":"Invite overload and application noise.","chinese":"邀請過載和程序雜音。"},{"english":"The utility model is mainly used on an overload protection structure of a hydraulic coupler.","chinese":"主要用於液力偶合器的過載保護結構上。"},{"english":"To assess the predict value of the serum level of iron and ferritin for iron overload.","chinese":"研究血清鐵和血清鐵蛋白對肝鐵過載的預測價值。"},{"english":"An overload relay which based on PIC single-chip microcomputer was introduced.","chinese":"介紹了基於PIC單片機的過載繼電器。"},{"english":"The fire has been blamed on a space heater or an overloaded power strip.","chinese":"這場火災是由於取暖器或者是電源插座過載所致。"},{"english":"A vacuum micro-electronics pressure sensor with the function of overloading protection is brought forward.","chinese":"提出了一種帶過載保護功能的真空微電子壓力傳感器。"},{"english":"A principle of preventing chain over-load trip based on wide-area information is proposed.","chinese":"文中提出了基於廣域信息的防連鎖過載跳閘保護原理。"},{"english":"Filtering protection waste gas exhaustion system.","chinese":"過載保護功能，廢氣抽風系統。"},{"english":"And an overload of any kind of information can have negative effects.","chinese":"其實，任何類型的信息只要過載了都有消極作用。"},{"english":"Machine mechanical Slowly device can avoid the overload caused by a breakdown.","chinese":"機上的機械緩行裝置可避免因過載而引起的機件損壞。"},{"english":"The mechanical slowing-down device on the machine may prevent damage to parts caused by overload.","chinese":"機上的機械緩行裝置可避免因過載而引起的機件損壞。"},{"english":"The control wires are connected on the user terminal block of the driver board.","chinese":"在過載情況下，導電板將與端子分離，關掉開關。"},{"english":"A double-protect electrical circuit for preventing over loading and anti-interference techniques are adopted .","chinese":"該電源採用了雙重過載保護電路和抗干擾技術。"}],"related":[]}