{"definition":["Daoist School of the Warring States Period (475-221 BC), based on the teachings of Laozi or Lao-tze 老子[Lao3 zi3] (c. 500 BC-) and Zhuangzi 庄子 (369-286 BC)"],"pinyin":["Dao4 jia1"],"simplified":["道家"],"rank":27548.0,"normalized_rank":0.3854322611335749,"fraction":0.0000011767256501340349,"cumulative_fraction":0.987660525361192,"word":"道家","characters":[{"definition":["road\/path\/CL:條|条[tiao2],股[gu3]\/principle\/truth\/morality\/reason\/skill\/method\/Dao (of Daoism)\/to say\/to speak\/to talk\/classifier for long thin things (rivers, cracks etc), barriers (walls, doors etc), questions (in an exam etc), commands, courses in a meal, steps in a process\/(old) circuit (administrative division)"],"pinyin":["dao4"],"word":"道"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[{"definition":["The Sopranos (US TV series)"],"pinyin":["Hei1 dao4 Jia1 zu2"],"word":"黑道家族"}],"sentences":[{"english":"The potential view of education of Taoism is loaded with Chinese education tradition.","chinese":"潛隱的道家教育思想，也負載着中國教育的一脈傳統。"},{"english":"Taoists maintain a negative and helpless attitude toward man's fate.","chinese":"道家對人之命運持一種自然的無可奈何的態度。"},{"english":"These two themes can respectively represent Confucian and Taoist ideal of life.","chinese":"這兩個主題可以分別代表儒家和道家的生活理想。"},{"english":"There is a concept in Taoism called ‘Wu Wei.’","chinese":"在道家學說裏有種理念叫做無爲。"},{"english":"Li Bai, the superstar of poetry circles in Tang Dynasty, is deeply impressed by Taoism.","chinese":"唐代詩壇巨星李白，受道家思想影響甚深。"},{"english":"That coheres with philosophy of Daoism and Chan Buddhism.","chinese":"這恰恰回到了道家的哲學和禪學境界裏來了。"},{"english":"Judging from Taoist thought, his intolerable Ren Zhen thought officialdom dark.","chinese":"從道家思想上看，他的任真思想無法忍受官場的黑暗。"},{"english":"The concept of modern Sub conciousness must be applied for studying the mind philosophy of Taosim.","chinese":"深入研究道家精神哲學，必須引入現代潛意識概念。"},{"english":"Shen Congwen's fictions of \"Xiangxi\" (the west part of Hunan Province) of subject matters are saturated with the spirit of Daoist art.","chinese":"沈從文的湘西題材小說浸透了道家藝術精神。"},{"english":"But there is still a difference among them between the rationalists and sentimentalists.","chinese":"但是新道家之中仍有主理派與主情派的區別。"},{"english":"For example, the Mao Shan Daoist Life Nourishing Company is currently enjoying a test run.","chinese":"目前已有茅山道家養生有限公司，正在試驗經營。"},{"english":"In the development of Mingmen theory, the Taoism regimen contributed more Mingmen theory is a combined thing by the Taoism regimen and medical practising.","chinese":"命門學說是道家養生理論與醫學實踐逐步結合的產物。"},{"english":"Great concern about life is the main value of Taoists .","chinese":"關注生命是道家與道教的基本價值取向。"},{"english":"Accordingly, in culture and ideology are vigorously promoted science of Taoism Taoism.","chinese":"與此相應，在文化思想上則大力提倡道家黃老之學。"},{"english":"Penglai, a town on the north of the Shandong peninsula famed in Taoism.","chinese":"蓬萊，有名的道家仙地，位於山東半島北部。"},{"english":"We can say, it is the thought and the behavior of the recluses that breeds the taoist school.","chinese":"可以說，隱者羣落的思想和行爲孕育了道家學派。"}],"related":[{"definition":["Taoism\/Daoism (Chinese system of beliefs)"],"pinyin":["Dao4 jiao4"],"word":"道教"},{"definition":["Buddhism\/Buddhist"],"pinyin":["Fo2 jia1"],"word":"佛家"},{"definition":["Confucian school, founded by Confucius 孔子[Kong3 zi3] (551-479 BC) and Mencius 孟子[Meng4 zi3] (c. 372-c. 289 BC)"],"pinyin":["Ru2 jia1"],"word":"儒家"},{"definition":["Confucian study of ethics\/study of Daoism\/school for Daoism in Tang and Song times\/Daoist magic\/another name for 理學|理学, rational learning of Song dynasty neo-Confucianism"],"pinyin":["dao4 xue2"],"word":"道學"},{"definition":["arts of healing, divination, horoscope etc\/supernatural arts (old)"],"pinyin":["fang1 shu4"],"word":"方術"},{"definition":["Zen Buddhism"],"pinyin":["Chan2 zong1"],"word":"禪宗"},{"definition":["Confucianism"],"pinyin":["Ru2 jiao4"],"word":"儒教"},{"definition":["a Daoist\/a follower of Daoism"],"pinyin":["Dao4 jiao4 tu2"],"word":"道教徒"},{"definition":["to achieve the Dao\/to become an immortal"],"pinyin":["de2 dao4"],"word":"得道"},{"definition":["to grow old with unfailing eyes and ears (idiom)"],"pinyin":["chang2 sheng1 jiu3 shi4"],"word":"長生久視"},{"definition":["to practice Daoism"],"pinyin":["xiu1 dao4"],"word":"修道"},{"definition":["oneness of heaven and humanity\/the theory that man is an integral part of nature"],"pinyin":["tian1 ren2 he2 yi1"],"word":"天人合一"},{"definition":["Taoist external alchemy"],"pinyin":["wai4 dan1"],"word":"外丹"},{"definition":["The Book of Changes (\"I Ching\")"],"pinyin":["Yi4 jing1"],"word":"易經"},{"definition":["profound theory\/philosophical theory of Wei and Jin 玄學|玄学 sect"],"pinyin":["xuan2 li3"],"word":"玄理"},{"definition":["Buddhism"],"pinyin":["Fo2 jiao4"],"word":"佛教"}]}