{"definition":["Darfur, region of west Sudan"],"pinyin":["Da2 er3 fu4 er3"],"simplified":["达尔富尔"],"rank":31332.0,"normalized_rank":0.43837533054440136,"fraction":8.367437571725951e-7,"cumulative_fraction":0.9914257232253104,"word":"達爾富爾","characters":[{"definition":["surname Da","to attain\/to reach\/to amount to\/to communicate\/eminent"],"pinyin":["Da2","da2"],"word":"達"},{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"},{"definition":["rich\/abundant\/wealthy","surname Fu"],"pinyin":["Fu4","fu4"],"word":"富"},{"definition":["thus\/so\/like that\/you\/thou"],"pinyin":["er3"],"word":"爾"}],"containing_words":[],"sentences":[{"english":"Dr. Arthur Pang is examining a pregnant woman with traditional instrument in Darfur.","chinese":"彭偉強醫生在達爾富爾地區爲一名孕婦檢查。"},{"english":"That will have very negative consequences on the prospect of peace in Darfur, \" said Gambari.\"","chinese":"這對於達爾富爾地區的和平前景來說是相當負面的。"},{"english":"More than 9, 000 international military and police personnel are in Darfur.","chinese":"在達爾富爾有將近9千多名國際軍隊和警方人員。"},{"english":"Is Darfur terrorism?","chinese":"蘇丹西部達爾富爾地區是恐怖主義麼？"},{"english":"It is already involved in peacekeeping operations in places including Haiti and Darfur.","chinese":"中國已經參與了在海地和達爾富爾的爲何行動。"},{"english":"Sudanese authorities are thought to have detained hundreds of Darfurians in the aftermath of the attack.","chinese":"據信蘇丹當局在襲擊發生後拘留了數百名達爾富爾人。"},{"english":"On the issue of Darfur, our position has always been to promote a dialogue and peace talks.","chinese":"關於達爾富爾問題，我們的立場是勸和促談。"},{"english":"We are very concerned for the population remaining behind in southern Darfur,\" Nicolai said.","chinese":"我們非常擔心留在達爾富爾南部的人口。"},{"english":"The genocide in Darfur shames the conscience of us all.","chinese":"達爾富爾的種族滅絕使我們所有的良知蒙羞。"},{"english":"We sincerely wish an early and proper settlement of the Darfur issue.","chinese":"我們也衷心希望達爾富爾問題早日得到妥善解決。"},{"english":"The rest of time I will be focusing on rehabbing and also working on my film on Darfur.","chinese":"同時還籌備我在達爾富爾的電影事業。"},{"english":"He also said the party would not contest polls in Darfur.","chinese":"他還表示，他們的政黨不會在達爾富爾地區拉選票。"}],"related":[]}