{"definition":["oseltamivir\/Tamiflu"],"pinyin":["da2 fei1"],"simplified":["达菲"],"rank":20465.0,"normalized_rank":0.2863319015572314,"fraction":0.000002280462486837104,"cumulative_fraction":0.9759248784172349,"word":"達菲","characters":[{"definition":["surname Da","to attain\/to reach\/to amount to\/to communicate\/eminent"],"pinyin":["Da2","da2"],"word":"達"},{"definition":["abbr. for the Philippines 菲律賓|菲律宾[Fei1 lu:4 bin1]","luxuriant (plant growth)\/rich with fragrance\/phenanthrene C14H10","poor\/humble\/unworthy\/radish (old)"],"pinyin":["Fei1","fei1","fei3"],"word":"菲"}],"containing_words":[],"sentences":[{"english":"We believe that the sea is the production of \"Tamiflu\" short-term performance thickening.","chinese":"我們認爲，海正生產“達菲”短期增厚業績。"},{"english":"AJ Duffy is president of the United Teachers Los Angeles union. Mr.","chinese":"AJ達菲是美國洛杉磯教師聯合會主席。"},{"english":"Honolulu and Santa Fe had the best overall air, the report said.","chinese":"報告稱，檀香山和聖達菲的空氣質量綜合指標最好。"},{"english":"Santa Fe means \"Holy Faith\" in Spanish.","chinese":"聖達菲，西班牙語的意思是“神聖的信仰”。"},{"english":"Now, the Duffy blood-group protein is essentially necessary for Plasmodium vivax to get into the red cell.","chinese":"現在間日瘧原蟲必須依靠達菲蛋白進入紅細胞。"},{"english":"She also said the shelf life of Tamiflu has been extended from five to seven years.","chinese":"她還說達菲的保質期已經從5年延長到了7年。"},{"english":"'That's what he was strong at, convincing clients to spend their money, ' Mr. Duffy recalls.","chinese":"達菲回憶說，說服客戶花錢是他的強項。"},{"english":"Duffy thinks they may have been thwarted by low water levels.","chinese":"達菲認爲是低水位擊敗了它們。"},{"english":"Santa Fe is preparing to celebrate its four hundredth anniversary.","chinese":"聖達菲正準備慶祝它立市四百週年。"},{"english":"The area of the Santa Fe Trail around Fort Union was also involved in the American Civil War. By eighteen-sixty-two, the trail was the main supply line for Union forces in the Southwest.","chinese":"在聯合堡周圍的聖達菲區域還捲入了美國內戰。"},{"english":"\"A lot of enzymes found in the liver are rhythmic,\" Duffield said.","chinese":"“大量肝臟裏發現的酶是有節律的，”達菲爾德說。"},{"english":"The square was named after Duffy.","chinese":"該廣場被命名爲達菲廣場。"},{"english":"So, red blood cells of most African people do not express the Duffy blood-group protein.","chinese":"因此，大部分非洲人的紅細胞不會表達達菲蛋白。"},{"english":"Healthcare workers would be given priority for doses of Relenza and Tamiflu.","chinese":"醫務工作者會優先使用瑞樂沙和達菲。"},{"english":"He carried his goods on the backs on mules. He reached the center of Santa Fe in November.","chinese":"他將貨物放在騾背上，他於當年11月到達了聖達菲。"},{"english":"Maureen Duffy reminded us of the audacity and courage of Aphra Behn in this regard.","chinese":"就這一問題，達菲提到了勇敢果敢的埃弗拉本。"}],"related":[]}