{"definition":["violator"],"pinyin":["wei2 zhe3"],"simplified":["违者"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"違者","characters":[{"definition":["to disobey\/to violate\/to separate\/to go against"],"pinyin":["wei2"],"word":"違"},{"definition":["(after a verb or adjective) one who (is) ...\/(after a noun) person involved in ...\/-er\/-ist\/(used after a number or 後|后[hou4] or 前[qian2] to refer to sth mentioned previously)\/(used after a term, to mark a pause before defining the term)\/(old) (used at the end of a command)\/(old) this"],"pinyin":["zhe3"],"word":"者"}],"containing_words":[],"sentences":[{"english":"The exiles were forbidden to return at the peril of their lives.","chinese":"流放犯已被禁止返回，違者處死。"},{"english":"Fishing in this pond is forbidden; penalty $5.","chinese":"塘禁止釣魚，違者罰款五元。"},{"english":"Offenders will be fined 2, 000 Syrian pounds _ about $45.","chinese":"違者將處以2000敘利亞幣的罰款，約45美元。"},{"english":"Imposture is not allowed, violates will be punished as the regulation stipulates.","chinese":"體檢時，不得冒名代替，違者按有關規定予以處理。"},{"english":"In the 17th century, Sultan Murad IV banned smoking on the pain of death.","chinese":"在17世紀，蘇丹木拉四世禁止吸菸，違者處死。"},{"english":"Any violator shall be banned according to law and its operations shall be stopped.","chinese":"違者將依法予以取締，停止運營。"},{"english":"It is an offense to litter handbills.","chinese":"請勿亂丟宣傳單張，違者必究。"},{"english":"The harbor superintendence departments shall not accept the ship exit formalities of any violator.","chinese":"違者，港務監督部門不予以受理船舶人出境手續。"},{"english":"Offenders shielding IP address.","chinese":"違者屏蔽IP處理。"},{"english":"Offenders may face a fine of HK$1m and imprisonment of two years.","chinese":"違者最高可被罰款100萬港元及監禁兩年。"},{"english":"Prisoners were forbidden to approach the fence under pain of death .","chinese":"犯人嚴禁接近圍欄，違者格殺勿論。"},{"english":"The emphasis in juvenile courts is upon rehabilitation of youthful offenders rather than punishment.","chinese":"少年法庭的重心是使青少年違者回歸社會而非懲罰。"},{"english":"Violating this rule will result you an instant ban.","chinese":"違者將直接導致你的賬號被禁言。"},{"english":"The juvenile delinquent was sent to the reformatory.","chinese":"該少年違者被關進教養院改造。"}],"related":[]}