{"definition":["telemetry"],"pinyin":["yao2 ce4"],"simplified":["遥测"],"rank":33866.0,"normalized_rank":0.4738292781889665,"fraction":6.687235086545111e-7,"cumulative_fraction":0.9933259274241154,"word":"遙測","characters":[{"definition":["distant\/remote\/far\/far away"],"pinyin":["yao2"],"word":"遙"},{"definition":["to survey\/to measure\/to conjecture"],"pinyin":["ce4"],"word":"測"}],"containing_words":[],"sentences":[{"english":"A spectrum is then obtained and telemetered to the ground.","chinese":"然後記錄它的光譜，並將數據通過遙測系統發回地面。"},{"english":"This Paper brings forward a new technology of EEG Telemetry .","chinese":"本文提出了一種新型的腦電遙測技術。"},{"english":"The checking and accepting standards of Hydrological Data Acquisition System (HDAS) construction vary with its work mode.","chinese":"水文遙測系統工作制式不同，系統的驗收標準也不同。"},{"english":"Telemetering is one of the ideal methods of metering biomedical signal.","chinese":"遙測技術是生物信號測量的理想方法之一。"},{"english":"SN388 telemetry instrument is one of complete seismograph in the world.","chinese":"SN388遙測儀是世界上較完善的地震儀器之一。"},{"english":"A method of infrared short range telemetry for torque measurement of rotating shaft is stated.","chinese":"提出一種對旋轉軸扭矩測試的紅外近程遙測法。"},{"english":"An essential part of bio-telemetry encompasses the transmission of data.","chinese":"生物遙測術的一個基礎的部分包括，傳輸數據。"},{"english":"It is absolutely necessary to demodulate the time-coordinated signal for a real-time system.","chinese":"對於一個實時的遙測系統，時統解調是必不可少的。"},{"english":"At last, the . remote measure technology of cylinder pressure's parameters.","chinese":"最後研究了氣缸壓力等參數的遙測技術。"},{"english":"The simulation results give references to design reentry remote sensing system rationally in engineering application.","chinese":"該文爲工程應用中合理設計再入遙測系統提供了參考。"},{"english":"Based on the characteristics of telemetric phase sensitive signal, two practical demodulation schemes are introduced .","chinese":"根據遙測相敏信號特點，介紹兩款實用解調方案。"},{"english":"At the test chamber, the FVC circuit resumes the signal.","chinese":"文章給出了信號遙測的電路設計。"},{"english":"The model matches the satellite image quite well.","chinese":"模型結果與衛星遙測非常接近。"},{"english":"This echoes what has happened to motor-racing telemetry.","chinese":"這些系統模仿了過去在賽車場合出現的遙測裝置。"},{"english":"This paper introduced the renovation of water regime forecasting system of Feilaixia hydro project.","chinese":"主要講述了飛來峽水情遙測預報調度系統的改造工作。"},{"english":"Data transmission is the base of Telemeter Seismographic Network.","chinese":"數據傳輸是遙測地震臺網的運行基礎之一。"}],"related":[]}