{"definition":["Sunni (subdivision of Islam)"],"pinyin":["Xun4 ni2"],"simplified":["逊尼"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"遜尼","characters":[{"definition":["to abdicate\/modest\/yielding\/unpretentious\/inferior to\/(slang) to suck"],"pinyin":["xun4"],"word":"遜"},{"definition":["Buddhist nun\/(often used in phonetic spellings)"],"pinyin":["ni2"],"word":"尼"}],"containing_words":[{"definition":["Sunni sect (of Islam)"],"pinyin":["Xun4 ni2 pai4"],"word":"遜尼派"}],"sentences":[{"english":"Among the dead was Laith Misha'an, the leader of the local pro-government Sunni militia.","chinese":"其中一名遇難者爲當地支持政府派遜尼派義勇軍領袖。"},{"english":"In Bahrain, the conflict between Sunnis and Shiites is clearly central.","chinese":"在巴林，遜尼派和什葉派穆斯林的衝突顯然是焦點。"},{"english":"The woman eventually attacked members of government-backed Sunni groups in Diyala province, the suspect said.","chinese":"嫌犯說，老師最後襲擊了有政府背景的某遜尼派團體。"},{"english":"The Sunni caliph is the spiritual and political head of the community.","chinese":"遜尼派哈里發，是精神文明建設和政治領導社會。"},{"english":"He says the Sunni community feels it is not fairly represented in the Shiite-led government.","chinese":"他說，遜尼派社區感覺由什葉派領導政府並不公平。"},{"english":"So the Sunnis too have quietened their opposition to the US.","chinese":"因此，遜尼派穆斯林也有轉趨淡靜，他們反對美國。"},{"english":"The risk of a vengeful takeover by the Sunni majority is too great.","chinese":"由遜尼多數派憤怒掌權，將會帶來極大風險。"},{"english":"The Sunni Arabs not so much.","chinese":"遜尼派阿拉伯人並非如此。"},{"english":"Which of these countries has approximately 19 million Sunni Muslims?","chinese":"下列哪個國家有接近一千九百萬的遜尼派穆斯林？"},{"english":"The government is led by a Sunni, Prime Minister Fuad Saniora.","chinese":"黎巴嫩政府由遜尼派總理西尼烏拉爲首。"},{"english":"Hussein and his unreconciled supporters among Iraq's Sunni minority, there was an explosion of anger.","chinese":"侯賽因先生及其遜尼派中不甘心的支持者們怒氣爆發。"},{"english":"US military helicopter has gone down northwest of Baghdad with Sunni insurgents tied to Al-Qaeda claiming responsibility.","chinese":"與阿爾蓋達組織有聯繫的遜尼造反派稱對其負責。"},{"english":"The team would have to include Shia as well as Sunni members.","chinese":"這個團隊既要有什葉派也要有遜尼派的成員。"},{"english":"The country's Sunni monarch King Hamad made the announcement in a national broadcast.","chinese":"該國的遜尼派國王哈馬德在全國廣播中宣部了該決定。"},{"english":"Death-squad killings of Sunnis would rise.","chinese":"敢死隊對遜尼派的殺戮會增加。"},{"english":"The ruling Taliban—mostly fundamentalist Sunni ethnic Pashtuns—saw Hazaras as infidels animals other.","chinese":"掌權的塔利班絕大多數是原教旨遜尼派和普什圖族人。"}],"related":[]}