{"definition":["recursion\/recursive (calculation)\/recurrence"],"pinyin":["di4 tui1"],"simplified":["递推"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"遞推","characters":[{"definition":["to hand over\/to pass on sth\/to gradually increase or decrease\/progressively"],"pinyin":["di4"],"word":"遞"},{"definition":["to push\/to cut\/to refuse\/to reject\/to decline\/to shirk (responsibility)\/to put off\/to delay\/to push forward\/to nominate\/to elect\/massage"],"pinyin":["tui1"],"word":"推"}],"containing_words":[{"definition":["recurrence formula"],"pinyin":["di4 tui1 gong1 shi4"],"word":"遞推公式"},{"definition":["recurrence relation"],"pinyin":["di4 tui1 guan1 xi4"],"word":"遞推關係"},{"definition":["nonrecursive"],"pinyin":["fei1 di4 tui1"],"word":"非遞推"}],"sentences":[{"english":"The recurrence formula of the time-constant of the sensor is also given.","chinese":"本文還提出了傳感器時間常數的實時遞推計算方法。"},{"english":"There is a recursive formula for the number of spanning trees in a graph.","chinese":"對於一個圖的生成樹的棵數，存在一個遞推公式。"},{"english":"Generating functions are an ideal tool for studying sequences defined by recurrence .","chinese":"母函數是研究用遞推關係來確定的函數的最理想工具。"},{"english":"Jones matrix based step-down iteration synthesis procedure for filter of this kind is proposed.","chinese":"提出了一種基於瓊斯矩陣的反向遞推設計方法。"},{"english":"And recursive LSM formulas with weights using moving window are presented.","chinese":"並給出了帶移動窗的加權最小二乘遞推公式。"},{"english":"A method for calculating the interlobe sealing line with ordered corresponding points and a recurrence formula are proposed.","chinese":"提出了對應點序列法與遞推公式來求齒面密封線長度。"},{"english":"In this paper, Two Different Concepts for the Recursion of Least Square Estimation is Introduced.","chinese":"本文闡述了兩類不同概念的遞推最小二乘估計。"},{"english":"The updating equation of image Jacobian matrix is also given.","chinese":"此外還給出了圖像雅可比矩陣的遞推公式。"},{"english":"The solution of the equation set is obtained by means of reflection transmittance coefficient matrix algorithm.","chinese":"藉助反射透射係數陣遞推算法，得出了方程組的解。"},{"english":"Kalman filtering is the recursive version of ihe first estimate.","chinese":"卡爾曼濾波即是線性最小方差估計的遞推形式。"},{"english":"A variable-order recursive extended least squares method and a new criterion of order estimation is derived in the paper .","chinese":"本文給出變階式遞推增廣的最小二乘法及階估計準則。"},{"english":"In the sixth chapter, we study the recurrence relations on the Thiele and Thiele-werner continued fraction GVRI.","chinese":"第六章研究廣義逆復向量連分式有理插值的遞推關係。"},{"english":"This program for CFP uses a new recursive formula which includes explicitly the boson seniority number.","chinese":"計算母分系數使用了包含辛弱數的遞推公式。"},{"english":"Making this inference requires stitching those two fragments of information together.","chinese":"使用這個遞推需要將兩個片段信息拼接起來。"},{"english":"From recurrence formula is derived the formulation of determining the number and location of pressure-release pond.","chinese":"用遞推法導出確定減壓池級數及位置的計算公式。"},{"english":"RFFT is a recursive algorithm based on Fast Fourier Transformation.","chinese":"是一種基於快速付立葉變換的遞推算法。"}],"related":[]}