{"definition":["the monk coming from afar is good at reading scriptures (idiom)\/foreign talent is valued higher than local talent"],"pinyin":["yuan3 lai2 de5 he2 shang5 hui4 nian4 jing1"],"simplified":["远来的和尚会念经"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"遠來的和尚會念經","characters":[{"definition":["far\/distant\/remote\/(intensifier in a comparison) by far\/much (lower etc)","to distance oneself from (classical)"],"pinyin":["yuan3","yuan4"],"word":"遠"},{"definition":["to come\/to arrive\/to come round\/ever since\/next"],"pinyin":["lai2"],"word":"來"},{"definition":["aim\/clear","of\/~'s (possessive particle)\/(used after an attribute)\/(used to form a nominal expression)\/(used at the end of a declarative sentence for emphasis)","really and truly","see 的士[di1 shi4]"],"pinyin":["de5","di1","di2","di4"],"word":"的"},{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["still\/yet\/to value\/to esteem","surname Shang"],"pinyin":["Shang4","shang4"],"word":"尚"},{"definition":["can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])","to balance an account\/accountancy\/accounting"],"pinyin":["hui4","kuai4"],"word":"會"},{"definition":["to read\/to study (a subject)\/to attend (a school)\/to read aloud\/to give (sb) a tongue-lashing (CL:頓|顿[dun4])\/to miss (sb)\/idea\/remembrance\/twenty (banker's anti-fraud numeral corresponding to 廿[nian4])"],"pinyin":["nian4"],"word":"念"},{"definition":["classics\/sacred book\/scripture\/to pass through\/to undergo\/to bear\/to endure\/warp (textile)\/longitude\/menstruation\/channel (TCM)\/abbr. for economics 經濟|经济[jing1 ji4]","surname Jing"],"pinyin":["Jing1","jing1"],"word":"經"}],"containing_words":[],"sentences":[],"related":[]}