{"definition":["long-distance"],"pinyin":["yuan3 ju4 li2"],"simplified":["远距离"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"遠距離","characters":[{"definition":["far\/distant\/remote\/(intensifier in a comparison) by far\/much (lower etc)","to distance oneself from (classical)"],"pinyin":["yuan3","yuan4"],"word":"遠"},{"definition":["at a distance of\/distance\/to be apart"],"pinyin":["ju4"],"word":"距"},{"definition":["surname Li","to leave\/to part from\/to be away from\/(in giving distances) from\/without (sth)\/independent of\/one of the Eight Trigrams 八卦[ba1 gua4], symbolizing fire\/☲"],"pinyin":["Li2","li2"],"word":"離"}],"containing_words":[{"definition":["off-site monitoring"],"pinyin":["yuan3 ju4 li2 jian1 shi4"],"word":"遠距離監視"}],"sentences":[{"english":"Set the camera for a long-distance shot.","chinese":"調好相機，拍一張遠距離的照片。"},{"english":"Devastators should be used to decimate infantry and attack units at very long ranges.","chinese":"毀滅戰艦應該被用於遠距離大批屠殺步兵和攻擊單位。"},{"english":"The geomagnetic orientation is one of the important mechanisms for orientation of insects in the long distance migration.","chinese":"地磁定向是昆蟲遠距離遷飛定向的重要機制之一。"},{"english":"The synoptic model of the far distance tropical cyclone torrential rainfalls in Shandong province was established.","chinese":"建立了山東省遠距離熱帶氣旋暴雨的天氣學模型。"},{"english":"At distance, Bulwer's Petrel appears to be uniform black.","chinese":"在遠距離之下，穴鳥呈現一致的黑色。"},{"english":"Distinctive orange handle indicates \"open\/close\" and direction of flow at a distance.","chinese":"獨特的橙色手柄可以遠距離指示“啓閉”和流體方向。"},{"english":"In turn, the uncover map allows you to activate every teleport.","chinese":"反過來，開啓的地圖將允許你激活遠距離移動物體。"},{"english":"Distinctive red handle indicates \"open\/close\" and direction of flow at a distance.","chinese":"特別的紅色手柄能夠遠距離表示“啓閉”和流向。"},{"english":"The station is only a dream. It constantly outdistances us.","chinese":"車站只是一個夢，距離我們很遠距離的夢。"},{"english":"Over five years ago, scientists succeeded in teleporting information.","chinese":"5年前，科學家成功實現了遠距離傳輸信息。"},{"english":"Is this someone who has seen a face at night or at a distance?","chinese":"他是在夜間或在遠距離上見過那張臉嗎？"},{"english":"Myopia (nearsightedness) is an abnormal elongation of the eye, causing distant objects to appear blurred.","chinese":"近視是視力不正常的伸長，使遠距離的物體模糊不清。"},{"english":"The bow can shoot the target in the distance only when stretched to its full extent.","chinese":"只有拉滿弓才能射得到那麼遠距離的靶子。"},{"english":"And then there's distance diagnosis, which is digitally done.","chinese":"並且有用作遠距離診斷的數碼設備。"},{"english":"Bow and crossbow is the most in common use in ancient times.","chinese":"弓弩是古代最常用的遠距離作戰武器。"},{"english":"The weapon is heavy, takes long time to be assembled, and has a poor accuracy at longer distance.","chinese":"武器沉重，花長時間裝配，而且在較遠距離精度低。"}],"related":[{"definition":["passive"],"pinyin":["bei4 dong4"],"word":"被動"},{"definition":["different place\/abroad"],"pinyin":["yi4 di4"],"word":"異地"},{"definition":["really\/indeed"],"pinyin":["di2 que4"],"word":"的確"},{"definition":["distance\/CL:個|个[ge4]\/to be apart from"],"pinyin":["ju4 li2"],"word":"距離"},{"definition":["exotic\/foreign"],"pinyin":["yi4 guo2"],"word":"異國"},{"definition":["conversely\/in reverse order\/in an opposite direction"],"pinyin":["fan3 guo5 lai2"],"word":"反過來"},{"definition":["to separate\/to part"],"pinyin":["fen1 kai1"],"word":"分開"},{"definition":["to be in contact (with sb)\/to associate\/to interact\/to get along (well, poorly)"],"pinyin":["xiang1 chu3"],"word":"相處"},{"definition":["this kind of\/so\/this way\/like this\/such"],"pinyin":["zhe4 yang4"],"word":"這樣"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或許"},{"definition":["relation\/relationship\/to concern\/to affect\/to have to do with\/guanxi\/CL:個|个[ge4]"],"pinyin":["guan1 xi5"],"word":"關係"},{"definition":["counterpart\/other person involved\/opposite side\/other side\/receiving party"],"pinyin":["dui4 fang1"],"word":"對方"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"畢竟"},{"definition":["(in the) past\/former\/previous\/to go over\/to pass by","(verb suffix)"],"pinyin":["guo4 qu4","guo4 qu5"],"word":"過去"},{"definition":["target\/object\/partner\/boyfriend\/girlfriend\/CL:個|个[ge4]"],"pinyin":["dui4 xiang4"],"word":"對象"},{"definition":["to take the initiative\/to do sth of one's own accord\/spontaneous\/active\/opposite: passive 被動|被动[bei4 dong4]\/drive (of gears and shafts etc)"],"pinyin":["zhu3 dong4"],"word":"主動"}]}