{"definition":["to exceed by far\/to outclass"],"pinyin":["yuan3 chao1 guo4"],"simplified":["远超过"],"rank":25483.0,"normalized_rank":0.3565402319757111,"fraction":0.0000014168588463219138,"cumulative_fraction":0.9849902474310888,"word":"遠超過","characters":[{"definition":["far\/distant\/remote\/(intensifier in a comparison) by far\/much (lower etc)","to distance oneself from (classical)"],"pinyin":["yuan3","yuan4"],"word":"遠"},{"definition":["to exceed\/to overtake\/to surpass\/to transcend\/to pass\/to cross\/ultra-\/super-"],"pinyin":["chao1"],"word":"超"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"}],"containing_words":[{"definition":["surpassing by far"],"pinyin":["yuan3 yuan3 chao1 guo4"],"word":"遠遠超過"}],"sentences":[{"english":"God loves you infinitely more than you can imagine.","chinese":"神的愛遠超過你所能想像的。"},{"english":"But later I knew that your bearing is far beyond my imagination.","chinese":"然而後來我才明白，你的氣度是遠超過我的想像的。"},{"english":"Mr Obama has managed to develop a political career far more lucrative than those of his predecessors.","chinese":"奧巴馬政治生涯的“錢途”遠超過他的前任們。"},{"english":"He in Peruse people's heart is much more important than Bolivar.","chinese":"他在祕魯人民心中的地位遠超過玻利瓦爾。"},{"english":"Today more than 130 million are.","chinese":"而今天這個數字遠超過一億三千多萬。"},{"english":"There are many, more than in a two-legged encounter.","chinese":"很多未知因素，遠超過兩回合的比賽制。"},{"english":"The Phoenix as a preamp is far exceeding my expectations.","chinese":"鳳凰作爲前級遠超過我的期望。"},{"english":"The transformation wrought by outflows was much more severe than the earlier reionization.","chinese":"噴出物造成的轉變遠超過先前的再遊離過程。"},{"english":"Women suffer significantly more fire-related injuries and deaths than men.","chinese":"婦女因失火而受傷和死亡的情況遠超過男性。"},{"english":"It would appear that the reasons go deeper than Thatcher's frail health.","chinese":"其中的原由似乎遠超過撒切爾夫人虛弱的健康狀況。"},{"english":"Of course, the winners are far outnumbered by the losers.","chinese":"當然，勝利者從數據上已經遠超過失敗者。"},{"english":"I am simply saying that the non-calls easily outnumber the superstar calls.","chinese":"我只是在說，沒有吹罰的次數遠超過明星哨。"},{"english":"He really likes antique art much more than modern art.","chinese":"他的確喜愛古典藝術遠超過現代藝術。"},{"english":"Wind carries your scent even farther than 25 feet, so make you're down wind.","chinese":"風攜帶你的氣味甚至遠超過25英尺，所以請你順風。"},{"english":"The main public room in the hotel has large windows that look far out over Death Valley.","chinese":"主要在酒店的公共房間有大窗戶，看遠超過死谷。"}],"related":[]}