{"definition":["to sell to faraway lands"],"pinyin":["yuan3 xiao1"],"simplified":["远销"],"rank":23690.0,"normalized_rank":0.3314538357141858,"fraction":0.0000016694001407930563,"cumulative_fraction":0.982228658159742,"word":"遠銷","characters":[{"definition":["far\/distant\/remote\/(intensifier in a comparison) by far\/much (lower etc)","to distance oneself from (classical)"],"pinyin":["yuan3","yuan4"],"word":"遠"},{"definition":["to melt (metal)\/to cancel or annul\/to sell\/to spend\/to fasten with a bolt\/bolt or pin"],"pinyin":["xiao1"],"word":"銷"}],"containing_words":[],"sentences":[{"english":"Presently bestselling inside and out of province, sells in distant markets of Macao, soon infiltrates the international market.","chinese":"現暢銷省內外，遠銷澳門，即將打入國際市場。"},{"english":"Our products are selling to the USA , Europe , the middle-east and etc.","chinese":"產品遠銷中東，歐美等國家和地區。"},{"english":"Heli exports forklift trucks to over 40 countries.","chinese":"合力叉車已經將他們的叉車遠銷至40餘個國家。"},{"english":"Lee: Yes, our company has engaged in textile production for many years, and our products have been sold all over the world.","chinese":"我們公司從事紡織品生產多年，產品遠銷全世界。"},{"english":"At present, our products sell well widely to Europe, America and South-East Asia.","chinese":"目前，我們的產品暢銷，遠銷歐洲，美洲和東南亞。"},{"english":"Our products are sold to Hong Kong, South-east Asia, Mid-east, Europe, Africa, America etc.","chinese":"產品已遠銷歐美，中東及非洲南美市場。"},{"english":"Main products for the textile, machinery and electrical, leather products, exported around the world.","chinese":"主營產品爲輕紡，機電，皮革等產品，遠銷世界各地。"},{"english":"As a food process county, the products in XiangYin are selling to not only internal but also external.","chinese":"湘陰縣作爲一個食品加工大縣，其產品遠銷國內外。"},{"english":"Products as more than 10 countries, of a \"giant-Sen\" brand.","chinese":"產品遠銷十多個國家，力創“巨森”品牌。"},{"english":"They sells well on west Europe and many other countries.","chinese":"產品遠銷西歐各國及世界各國。"},{"english":"Our quality products have been sold well in Europe, America, East-South Asia, etc.","chinese":"我們優質的產品已遠銷歐洲，美洲，東南亞等。"},{"english":"If you need to have products exported to foreign countries, do not come to us anti -.","chinese":"如果你有產品需要遠銷國外，不防找我們。"},{"english":"Best-selling products all over the country, exported to Europe and the United States and other regions.","chinese":"產品暢銷全國各地，還出口遠銷到歐美等地區。"}],"related":[]}