{"definition":["to produce the opposite of the desired result"],"pinyin":["shi4 de2 qi2 fan3"],"simplified":["适得其反"],"rank":20674.0,"normalized_rank":0.2892560827165503,"fraction":0.0000022292243398085663,"cumulative_fraction":0.9763961594487434,"word":"適得其反","characters":[{"definition":["surname Shi","to fit\/suitable\/proper\/just (now)\/comfortable\/well\/to go\/to follow or pursue"],"pinyin":["Shi4","shi4"],"word":"適"},{"definition":["structural particle: used after a verb (or adjective as main verb), linking it to following phrase indicating effect, degree, possibility etc","to have to\/must\/ought to\/to need to","to obtain\/to get\/to gain\/to catch (a disease)\/proper\/suitable\/proud\/contented\/to allow\/to permit\/ready\/finished"],"pinyin":["de2","de5","dei3"],"word":"得"},{"definition":["his\/her\/its\/their\/that\/such\/it (refers to sth preceding it)"],"pinyin":["qi2"],"word":"其"},{"definition":["contrary\/in reverse\/inside out or upside down\/to reverse\/to return\/to oppose\/opposite\/against\/anti-\/to rebel\/to use analogy\/instead\/abbr. for 反切[fan3 qie4] phonetic system"],"pinyin":["fan3"],"word":"反"}],"containing_words":[],"sentences":[{"english":"But Messrs Kasich and Walker, in particular, seem to have stirred unusually fierce opposition.","chinese":"不過對於卡斯奇和沃克爾兩位來說，似乎適得其反。"},{"english":"It's kind of an obsession. That seems unnecessary and counterproductive.'","chinese":"這是一種執迷，看起來沒有必要，而且適得其反。"},{"english":"We have to pay for the mistakes, but also to be overkill.","chinese":"我們必須支付的錯誤，而且會適得其反。"},{"english":"The effort comes just a year after a crackdown on pedophilia backfired.","chinese":"努力僅僅一年後，在打擊戀童了適得其反的。"},{"english":"But the heavy hand of the government can be stifling here.","chinese":"但是政府這種大刀闊斧的做法可能會適得其反。"},{"english":"But to not practice, to not get an injury would be counterproductive.","chinese":"但爲了躲避傷病而因噎廢食的做法只能是適得其反。"},{"english":"Children are life renewing itself, Captain Butler.","chinese":"錢是延長生命的，我的掙法適得其反。"},{"english":"Indeed, half-hearted human-rights diplomacy can backfire nastily.","chinese":"心術不正的人權外交可能適得其反。"},{"english":"I believe that exerting pressure cannot solve the problem but rather may lead to the contrary.","chinese":"我想施壓不僅解決不了問題，反而可能會適得其反。"},{"english":"Some, like last year's infamous Buzz, backfired and were scrapped.","chinese":"像去年臭名昭著的巴茲，結果適得其反，最後被銷燬。"},{"english":"Canvassing is considered to be bad form and is therefore counter—productive.","chinese":"遊說拉票被認爲是不好的形式，只會適得其反。"},{"english":"So far, though, Mr Obama's lamentable salesmanship has pushed harder the other way.","chinese":"然仍，知道目前，奧巴馬令人惋惜的推銷術適得其反。"},{"english":"I think this is almost always counter-productive.","chinese":"不過我覺得這幾乎總是適得其反的。"},{"english":"If what you’re saying is not compelling, it could backfire.","chinese":"如果你說的話本身就不具可信性，就只能適得其反了。"},{"english":"It may seem counterproductive to those of you trying to lose weight to eat before a work-out.","chinese":"在工作時如果你努力地想要減肥，可能會適得其反。"},{"english":"The un skilled novice can misuse the principle and get himself fired quite easily.","chinese":"拍得技巧不夠可能會適得其反，很容易引火燒身。"}],"related":[{"definition":["the gains do not make up for the losses (idiom)"],"pinyin":["de2 bu4 chang2 shi1"],"word":"得不償失"},{"definition":["see 拔苗助長|拔苗助长[ba2 miao2 zhu4 zhang3]"],"pinyin":["ya4 miao2 zhu4 zhang3"],"word":"揠苗助長"},{"definition":["plain\/clear\/obvious"],"pinyin":["qian3 xian3"],"word":"淺顯"},{"definition":["retort with challenging questions\/debate"],"pinyin":["bian4 nan4"],"word":"便難"},{"definition":["to avoid the important and dwell on the trivial\/to keep silent about major charges while admitting minor ones"],"pinyin":["bi4 zhong4 jiu4 qing1"],"word":"避重就輕"},{"definition":["to treat only the symptoms but not the root cause"],"pinyin":["zhi4 biao1"],"word":"治標"},{"definition":["to work to no avail (idiom)"],"pinyin":["tu2 lao2 wu2 gong1"],"word":"徒勞無功"},{"definition":["extremely difficult\/even more difficult"],"pinyin":["nan2 shang4 jia1 nan2"],"word":"難上加難"},{"definition":["lit. change to more severe (idiom); to become more intense (esp. of shortcoming)\/to aggravate\/to intensify"],"pinyin":["bian4 ben3 jia1 li4"],"word":"變本加厲"},{"definition":["nonfeasance\/omission (law)"],"pinyin":["bu4 zuo4 wei2"],"word":"不作為"},{"definition":["to encourage\/to foster\/to foment"],"pinyin":["zhu4 zhang3"],"word":"助長"},{"definition":["to disdain as beneath contempt (idiom)"],"pinyin":["bu4 xie4 yi1 gu4"],"word":"不屑一顧"},{"definition":["to judge"],"pinyin":["ping2 duan4"],"word":"評斷"},{"definition":["to move aside\/to get out of the way\/to back down\/to concede"],"pinyin":["tui4 rang4"],"word":"退讓"},{"definition":["to seize every opportunity\/to be full of tricks"],"pinyin":["tou2 ji1 qu3 qiao3"],"word":"投機取巧"},{"definition":["resolute\/definitive\/categorically\/absolutely"],"pinyin":["duan4 ran2"],"word":"斷然"}]}