{"definition":["to be airworthy\/to be seaworthy"],"pinyin":["shi4 hang2"],"simplified":["适航"],"rank":31794.0,"normalized_rank":0.4448393099492116,"fraction":8.033148806212127e-7,"cumulative_fraction":0.9918047401196056,"word":"適航","characters":[{"definition":["surname Shi","to fit\/suitable\/proper\/just (now)\/comfortable\/well\/to go\/to follow or pursue"],"pinyin":["Shi4","shi4"],"word":"適"},{"definition":["boat\/ship\/craft\/to navigate\/to sail\/to fly"],"pinyin":["hang2"],"word":"航"}],"containing_words":[],"sentences":[{"english":"It didn't reach required standards of safety and seaworthiness.","chinese":"它沒有達到安全性和適航性的規定標準。"},{"english":"Thus your ship is unseaworthy, and she will be detained in our port.","chinese":"所以你的船是不適航的，將會在本港被滯留。"},{"english":"An advisory memorandum regarding airworthiness.","chinese":"有關適航性的警告性備忘錄。"},{"english":"Preparation of service information in coordination with the Airworthiness Department.","chinese":"配合適航部門準備服務信息。"},{"english":"In charge of organizing and carrying out aero-products' airworthiness certification and management.","chinese":"負責組織實施公司航空產品的適航審定與管理工作。"},{"english":"Liability for seaworthiness is one of\"least legal obligations\"of carriers.","chinese":"適航責任爲承運人的“最低法定義務”之一。"},{"english":"Service information and Instructions for Continued Airworthiness.","chinese":"服務信息和持續適航文件。"},{"english":"Transact airworthiness-related business.","chinese":"辦理適航相關業務。"},{"english":"Airworthiness approval as long as the Government, I would dare to try.","chinese":"只要政府適航部門批准，我就敢嘗試。"},{"english":"This wing could easily be returned to airworthy status by replacing the lower lines.","chinese":"這隻翅膀很容易返回到適航狀態下通過更換線路。"},{"english":"Aircraft built in accordance with this certification regulation are to receive an airworthiness certification.","chinese":"按照這一認證法規制造的飛機將可以收到適航認證。"},{"english":"To monitor and certify work is in compliance with airworthiness and company requirements.","chinese":"監督和確保工作與適航和公司要求相一致。"},{"english":"At the time of delivery, the shipowner shall exercise due diligence to make the ship seaworthy.","chinese":"交船時，出租人應當做到謹慎處理，使船舶適航。"},{"english":"In charge of aero-products related airworthiness certification affairs.","chinese":"負責公司航空產品適航審定事務。"},{"english":"The influence of various parameters of planing boat on rapidity and navigability is also analyzed.","chinese":"分析了滑行艇諸要素對其快速性及適航性的影響。"},{"english":"Ship working violently and secured movable things for seaworthiness.","chinese":"船強烈顛簸，爲適航性固定了可移動的物件。"}],"related":[]}