{"definition":["marketable\/saleable\/appropriate to the market"],"pinyin":["shi4 xiao1"],"simplified":["适销"],"rank":53583.0,"normalized_rank":0.7496956892812671,"fraction":9.678316660946103e-8,"cumulative_fraction":0.9993872708814094,"word":"適銷","characters":[{"definition":["surname Shi","to fit\/suitable\/proper\/just (now)\/comfortable\/well\/to go\/to follow or pursue"],"pinyin":["Shi4","shi4"],"word":"適"},{"definition":["to melt (metal)\/to cancel or annul\/to sell\/to spend\/to fasten with a bolt\/bolt or pin"],"pinyin":["xiao1"],"word":"銷"}],"containing_words":[],"sentences":[{"english":"You need to have done all of the research regarding your product or services' marketability.","chinese":"您需要做的所有有關研究您的產品或服務的適銷性。"},{"english":"For the first time you transfer marketable products.","chinese":"第一時間爲您傳遞適銷對路的產品。"},{"english":"Second, developing marketable commodities to satisfy new consumer demand.","chinese":"二是開發適銷商品，滿足新型消費需求。"},{"english":"Meanwhile, the market demand with the development of marketable products.","chinese":"同時，公司隨市場需求不斷開發適銷對路產品。"},{"english":"The price is a bit high mahogany furniture in the exhibition is \" marketable\".","chinese":"價格有點高的紅木傢俱展是“適銷對路”。”"},{"english":"Ford has too few of the right products for today's market.","chinese":"福特公司現有的適銷對路產品實在太少。"},{"english":"The products will be suitable for sale only when they meet with the standards.","chinese":"只有按標準設計和生產，才能適銷對路。"},{"english":"The basic requirement of such assets is marketability.","chinese":"對這些資產的基本要求是具有適銷性。"},{"english":"Making goods readily marketaBle is the Businessmen's fundamental technique of operation.","chinese":"使商品適銷對路，是商家的基本經營術。"},{"english":"So you need both a good plan and a marketable product.","chinese":"所以你需要一個良好的計劃和適銷對路的產品。"}],"related":[]}