{"definition":["adapter (device)"],"pinyin":["shi4 pei4 qi4"],"simplified":["适配器"],"rank":24387.0,"normalized_rank":0.3412057700110531,"fraction":0.0000015705732874075281,"cumulative_fraction":0.983356702752938,"word":"適配器","characters":[{"definition":["surname Shi","to fit\/suitable\/proper\/just (now)\/comfortable\/well\/to go\/to follow or pursue"],"pinyin":["Shi4","shi4"],"word":"適"},{"definition":["to join\/to fit\/to mate\/to mix\/to match\/to deserve\/to make up (a prescription)\/to allocate"],"pinyin":["pei4"],"word":"配"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[],"sentences":[{"english":"Working with the right queue is the task of the adapter configuration, as detailed above.","chinese":"調用正確的隊列是適配器配置的工作，如上文中所述。"},{"english":"There are plenty of extras, including a cigarette-lighter adapter.","chinese":"有很多羣衆演員，包括香菸打火機適配器。"},{"english":"The next line configures the email adapter.","chinese":"下一行配置了電子郵件適配器。"},{"english":"You can use technology adapters to integrate to a wide range of applications.","chinese":"您可以使用技術適配器集成到應用程序的更廣範圍。"},{"english":"Instead, connectors and protocol adapters are used.","chinese":"而是使用連接器和協議適配器。"},{"english":"Power adaptors are cheap, usually costing $2 or less.","chinese":"電力適配器價格低廉，通常不超過2美元。"},{"english":"This adapter supports outbound mode only.","chinese":"此適配器僅支持出站模式。"},{"english":"Both support a wide variety of network adapters.","chinese":"都支持多種類型的網絡適配器。"},{"english":"Where is my adapter?","chinese":"我的適配器在哪裏？"},{"english":"The adapters now have icons on the pallet.","chinese":"適配器現在在托盤上具有圖標。"},{"english":"This means you can also operate it from your vehicle's cigarette lighter adapter.","chinese":"這意味着你也能夠在你的汽車的點菸器適配器它。"},{"english":"At Environment, select the environment for the analysis adaptor.","chinese":"在環境模式下，爲分析適配器模板選擇一個環境。"},{"english":"The host-side adapter inherits from the host view of the add-in.","chinese":"宿主端適配器從外接程序的宿主視圖中繼承。"},{"english":"This paper describe the principle and structure of SFN Adapter's design in detail.","chinese":"本文詳細介紹了單頻網適配器的設計原理和結構。"},{"english":"I created a map of each cable and which adapter it was plugged into.","chinese":"我記錄了每條線纜和它原來插入的適配器的對應關係。"},{"english":"Built-in protocol transformation capabilities and support for multiple types of adapters.","chinese":"內置協議轉換功能並支持多種類型的適配器。"}],"related":[]}