{"definition":["to just happen to coincide with"],"pinyin":["shi4 feng2"],"simplified":["适逢"],"rank":19462.0,"normalized_rank":0.27229863025198325,"fraction":0.0000025302302063978705,"cumulative_fraction":0.9735138450742304,"word":"適逢","characters":[{"definition":["surname Shi","to fit\/suitable\/proper\/just (now)\/comfortable\/well\/to go\/to follow or pursue"],"pinyin":["Shi4","shi4"],"word":"適"},{"definition":["to meet by chance\/to come across\/(of a calendar event) to come along\/(of an event) to fall on (a particular day)\/to fawn upon"],"pinyin":["feng2"],"word":"逢"}],"containing_words":[{"definition":["to just happen to coincide with the occasion (idiom)\/to be present just at the right time"],"pinyin":["shi4 feng2 qi2 hui4"],"word":"適逢其會"}],"sentences":[{"english":"The formation of this fifth Committee cannot come at a better time.","chinese":"本屆委員會的成立適逢其時。"},{"english":"So let me start by offering my congratulations to Harvard University as you celebrate your 375th anniversary.","chinese":"今年適逢哈佛大學建校375週年，在此先恭喜各位。"},{"english":"Yet all this comes even as military-to-military relations are improving.","chinese":"然而所有這一切適逢軍事對軍事關係改善之時。"},{"english":"Pittsburgh was a perfect venue for this work.","chinese":"在這方面，以匹茲堡作爲會議地點適逢其會。"},{"english":"The latest round of the eurozone crisis could not have come at a better time.","chinese":"最近一輪的歐元區危機適逢其時。"},{"english":"As the Mid-Autumn festival, invited the moon a totally.","chinese":"適逢中秋佳節，遙邀明月共賞。"},{"english":"Talking about heritage, Hong Kong Customs will celebrate its centenary this year.","chinese":"談及歷史和傳統，今年適逢香港海關成立一百週年。"},{"english":"It is so happened that today is also a traditional festival in China, that is Mid-Autumn Day.","chinese":"今天又適逢中國傳統節日中秋節。"},{"english":"This year, the summer solstice falls on a weekend -- this Sunday. Father's Day.","chinese":"今年，夏至適逢週末，本星期日又是父親節。"},{"english":"2007 marks Hong Kong's first decade of reunification with China.","chinese":"2007年，適逢香港迴歸祖國十週年。"}],"related":[]}