{"definition":["sooner or later"],"pinyin":["chi2 zao3"],"simplified":["迟早"],"rank":12595.0,"normalized_rank":0.1762203909168497,"fraction":0.0000056407214795719214,"cumulative_fraction":0.9474185405731026,"word":"遲早","characters":[{"definition":["late\/delayed\/slow","surname Chi"],"pinyin":["Chi2","chi2"],"word":"遲"},{"definition":["early\/morning\/Good morning!\/long ago\/prematurely"],"pinyin":["zao3"],"word":"早"}],"containing_words":[{"definition":["if you live a life of crime, sooner or later you'll pay for it"],"pinyin":["chu1 lai2 hun4 chi2 zao3 yao4 huan2 de5"],"word":"出來混遲早要還的"}],"sentences":[{"english":"But sooner or later we will return to our emotional set-point.","chinese":"但是遲早我們會返回到我們的情感點。"},{"english":"If your ideas have merit, sooner or later someone will publish them.","chinese":"如果你的想法有價值，遲早有人會出版它們的。"},{"english":"There is another version of the pigeonhole principle that comes in handy.","chinese":"另外一種版本的鴿子洞原理遲早也能碰到。"},{"english":"Therefore, when you begin romancing her, sooner or later she'll start to do the same.","chinese":"所以，當你開始爲她浪漫時，遲早她也會做同樣的事。"},{"english":"Those mnemonics sometimes come in handy. All right.","chinese":"這些記憶術遲早有用，好了。"},{"english":"She swears that she will be avenged on her enemy sooner or later.","chinese":"她發誓遲早要向她的敵人報仇。"},{"english":"And I was sure that, sooner or later, Perot, too, would turn his fire on me.","chinese":"我也十分清楚，佩羅遲早也會把火力對準我。"},{"english":"People who cannot find time for recreation are obtiged sooner or later to find time for illness.","chinese":"擠不出時間休息娛樂的人遲早會被迫擠出時間養病。"},{"english":"For me, I'm still a student and sonner or later running about my job.","chinese":"至於我，還是學生，也是遲早會爲了工作奔波。"},{"english":"Sooner or later, the wave will come along and knock down what we have worked so hard to build up.","chinese":"浪濤遲早會襲來摧毀我們辛勤勞動所建造起來的一切。"},{"english":"He just likes to talk on the phone, you’ll get through sooner or later.","chinese":"他就是喜歡“煲電話粥”，你遲早會打通的。"},{"english":"Sooner or later, they will wring the truth out of the prisoner.","chinese":"我們遲早是會從囚犯口裏逼出真情的。"},{"english":"Sooner or later the US Treasury and the Fed had to draw the line and the financial sector will eventually be healthier as a result.","chinese":"美聯儲和財政部遲早會出手，最終金融機構也會康復。"},{"english":"I'll get even with you sonner or later.","chinese":"跟你這筆帳我遲早會要回來的。"},{"english":"Yet the details of her skeleton proclaim her human affinity.","chinese":"骨骼細節遲早會證明她與人類的密切關係。"},{"english":"And, sooner or later, spending will have to be restrained to reduce the balance of payments deficit.","chinese":"同時，遲早的事情，消費將受到抑止以減少支付虧損。"}],"related":[{"definition":["if not\/otherwise\/else\/or else"],"pinyin":["fou3 ze2"],"word":"否則"},{"definition":["whatever the case\/in any event\/no matter what\/by all possible means"],"pinyin":["wu2 lun4 ru2 he2"],"word":"無論如何"},{"definition":["in a word\/in short\/in brief"],"pinyin":["zong3 zhi1"],"word":"總之"},{"definition":["at the minimum\/at the very least"],"pinyin":["qi3 ma3"],"word":"起碼"},{"definition":["not necessarily\/not likely"],"pinyin":["bu4 jian4 de5"],"word":"不見得"},{"definition":["just in case\/if by any chance\/contingency"],"pinyin":["wan4 yi1"],"word":"萬一"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"畢竟"},{"definition":["in the end\/after all is said and done"],"pinyin":["zhong1 jiu1"],"word":"終究"},{"definition":["to have to\/must\/compulsory\/necessarily"],"pinyin":["bi4 xu1"],"word":"必須"},{"definition":["to say again\/to put off a discussion until later\/moreover\/what's more\/besides"],"pinyin":["zai4 shuo1"],"word":"再說"},{"definition":["outcome\/result\/conclusion\/in the end\/as a result\/to kill\/to dispatch","to bear fruit\/CL:個|个[ge4]"],"pinyin":["jie1 guo3","jie2 guo3"],"word":"結果"},{"definition":["improbable\/unlikely\/will not (act, happen etc)\/not able\/not having learned to do sth\/(coll.) (Tw) don't mention it\/not at all"],"pinyin":["bu4 hui4"],"word":"不會"},{"definition":["moreover\/besides\/in addition\/furthermore"],"pinyin":["kuang4 qie3"],"word":"況且"},{"definition":["can't say for sure\/maybe"],"pinyin":["shuo1 bu5 ding4"],"word":"說不定"},{"definition":["perhaps\/maybe"],"pinyin":["huo4 xu3"],"word":"或許"},{"definition":["only\/merely\/nothing but\/no more than\/it's just that ..."],"pinyin":["zhi3 bu5 guo4"],"word":"只不過"}]}