{"definition":["late (with a task etc)\/slow"],"pinyin":["chi2 chi2"],"simplified":["迟迟"],"rank":6515.0,"normalized_rank":0.09115330264575434,"fraction":0.000016423066932474813,"cumulative_fraction":0.8889738722459856,"word":"遲遲","characters":[{"definition":["late\/delayed\/slow","surname Chi"],"pinyin":["Chi2","chi2"],"word":"遲"},{"definition":["late\/delayed\/slow","surname Chi"],"pinyin":["Chi2","chi2"],"word":"遲"}],"containing_words":[],"sentences":[{"english":"Command, huang feng call third reconnaissance teams, have been slow to respond.","chinese":"司令部內，黃鳴鋒呼叫第三偵察小隊，遲遲沒有迴應。"},{"english":"The quick, decisive victory that Napoleon expected never happened.","chinese":"拿破崙期盼着的速決速勝遲遲沒有發生。"},{"english":"Mr Wang didn't and the meeting had to be .","chinese":"王老師遲遲未到，會議只好推遲。"},{"english":"He always replied rather tardily to my letters.","chinese":"他對我的信總是遲遲不作答覆。"},{"english":"The government has not yet announced the punishment of Zhang and his company.","chinese":"政府對張悟本和悟本堂公司的處罰遲遲未至。"},{"english":"Mr Clemente mixes his rounds with courteous visits to borrowers who have fallen behind on their payments.","chinese":"他同時也對遲遲未繳貸款的人家做有禮貌的訪問。"},{"english":"Such events are very interesting, but the suspense of them cannot last long.","chinese":"這種事很令人好奇，可是謎底也不會遲遲解不開。"},{"english":"But it hasn t happened to the people find joy.","chinese":"但衆人發現歡喜卻遲遲未到。"},{"english":"The Government has been dilatory in condemning the outrage.","chinese":"政府遲遲才譴責是次暴行。"},{"english":"Occasionally the accumulation of toxin, also be the reason that weight does not fall tardy .","chinese":"有時候毒素的累積，也正是體重遲遲不降的原因。"},{"english":"In the winter time the Rat slept a great deal, retiring early and rising late.","chinese":"冬令時節，河鼠很貪睡，早早就上牀，遲遲纔起來。"},{"english":"On Monday, he made an overdue start on that.","chinese":"而直到星期一，他才遲遲逾期開始。"},{"english":"Thank you for your leaving late in the afternoon !","chinese":"謝謝你在暮色四合時遲遲離去。"},{"english":"The Presidential inauguration came, and still no decision of the court;","chinese":"總統就職儀式進行過了，但法庭裁決遲遲未定。"},{"english":"I musing late in the autumn day, gazing off southward.","chinese":"我在秋日裏沉思遲遲，望斷南凝汽。"},{"english":"you will lose your chance if you delay your action.","chinese":"如果遲遲不採取行動，你就會坐失良機。"}],"related":[]}