{"definition":["Liaodong Peninsula"],"pinyin":["Liao2 dong1 Ban4 dao3"],"simplified":["辽东半岛"],"rank":39636.0,"normalized_rank":0.5545590642620291,"fraction":3.9778903319876523e-7,"cumulative_fraction":0.996346272987396,"word":"遼東半島","characters":[{"definition":["short name for Liaoning 遼寧|辽宁[Liao2 ning2] province\/Liao or Khitan dynasty (907-1125)"],"pinyin":["Liao2"],"word":"遼"},{"definition":["east\/host (i.e. sitting on east side of guest)\/landlord","surname Dong"],"pinyin":["Dong1","dong1"],"word":"東"},{"definition":["half\/semi-\/incomplete\/(after a number) and a half"],"pinyin":["ban4"],"word":"半"},{"definition":["island\/CL:個|个[ge4],座[zuo4]"],"pinyin":["dao3"],"word":"島"}],"containing_words":[],"sentences":[{"english":"Moreover, it is one of the locations opening to the outside world on the Liaodong Peninsula.","chinese":"同時，它也是遼東半島對外開放的窗口之一。"},{"english":"The fishery has always been an important prehistoric mode of subsistence in Liaodong Peninsula.","chinese":"漁業始終是史前時期遼東半島重要生業之一。"},{"english":"Dalian is a beautiful seaside city on the southern tip of Liaodong Peninsular.","chinese":"大連是遼東半島南端的一個美麗的海濱城市。"},{"english":"My hometown is Dalian which locates in the Liaotong Peninsula.","chinese":"我的家鄉是大連，位於遼東半島。"},{"english":"Lüshun is a city and port in the northeast of China at the tip of Liaodong Peninsula.","chinese":"旅順是中國東北遼東半島頂端的一個城市和港口。"},{"english":"Ground in the Dalian City Eurasia is big six east coastses, Chinese northeast, Liaotung Peninsula is the most south to carry.","chinese":"大連市地處歐亞大陸東岸，中國東北遼東半島最南端。"},{"english":"My hometown dalian is located in the liaodong peninsula.","chinese":"我的家鄉大連坐落於遼東半島。"},{"english":"My hometown is the dalian city which locate at the front of the peninsula of liaodong in liaoning province.","chinese":"我的家鄉是大連，它位於中國遼寧遼東半島的最前端。"},{"english":"My hometown is the city of dalian. It lies at the head of liaodong byland. In china liaoning province.","chinese":"我的家鄉是大連，它位於中國遼寧遼東半島的最前端。"},{"english":"Yingkou is situated in northwestern Liaodong Peninsula. It is a garden-like port city.","chinese":"營口位於遼東半島西北部，是一座花園般的港口城市。"},{"english":"Dalian is in the south of the Liaodong Peninsula.","chinese":"大連位於遼東半島南部。"},{"english":"The peninsula existent multiple planation surfaces. this article mainly studies in the planation surfaces in the limestone areas of Liaodong Peninsula.","chinese":"本文中主要研究遼東半島內的石灰岩地區的夷平面。"}],"related":[]}