{"definition":["to dodge a pit only to fall into a well (idiom)\/out of the frying pan into the fire"],"pinyin":["bi4 keng1 luo4 jing3"],"simplified":["避坑落井"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"避坑落井","characters":[{"definition":["to avoid\/to shun\/to flee\/to escape\/to keep away from\/to leave\/to hide from"],"pinyin":["bi4"],"word":"避"},{"definition":["hole\/pit\/tunnel\/to defraud"],"pinyin":["keng1"],"word":"坑"},{"definition":["colloquial reading for 落[luo4] in certain compounds","to fall or drop\/(of the sun) to set\/(of a tide) to go out\/to lower\/to decline or sink\/to lag or fall behind\/to fall onto\/to rest with\/to get or receive\/to write down\/whereabouts\/settlement","to leave out\/to be missing\/to leave behind or forget to bring\/to lag or fall behind"],"pinyin":["la4","lao4","luo4"],"word":"落"},{"definition":["Jing, one of the 28 constellations of Chinese astronomy\/surname Jing","a well\/CL:口[kou3]\/neat\/orderly"],"pinyin":["Jing3","jing3"],"word":"井"}],"containing_words":[],"sentences":[],"related":[{"definition":["blessings never come in pairs (idiom)"],"pinyin":["fu2 wu2 shuang1 zhi4"],"word":"福無雙至"},{"definition":["cow and famous steed at the same trough (idiom); fig. the common and the great are treated alike"],"pinyin":["niu2 ji4 tong2 zao4"],"word":"牛驥同皂"},{"definition":["lit. like stepping on a tiger's tail or spring ice (idiom)\/fig. extremely dangerous situation"],"pinyin":["hu3 wei3 chun1 bing1"],"word":"虎尾春冰"},{"definition":["unexpected calamity"],"pinyin":["heng4 huo4"],"word":"橫禍"},{"definition":["to transform gold into base metal (idiom); fig. to edit sb else's beautiful prose and ruin it"],"pinyin":["dian3 jin1 cheng2 tie3"],"word":"點金成鐵"},{"definition":["lit. a caged bird in a pavilion (idiom); fig. to lose vigilance by comfortable living\/unaware of the disasters ahead\/a fool's paradise"],"pinyin":["yan4 que4 chu4 tang2"],"word":"燕雀處堂"},{"definition":["lit. the heart of a sheep in the skin of a tiger (idiom)\/fig. impressive in appearance but lacking in substance\/braggart"],"pinyin":["yang2 zhi4 hu3 pi2"],"word":"羊質虎皮"},{"definition":["to throw stones at sb who fell down a well (idiom); to hit a person who is down"],"pinyin":["tou2 jing3 xia4 shi2"],"word":"投井下石"},{"definition":["precarious as the morning dew (idiom); fig. ephemeral and precarious nature of human existence"],"pinyin":["wei1 ru2 zhao1 lu4"],"word":"危如朝露"},{"definition":["Mr Zhu Yun breaks the railing (idiom); to challenge and admonish boldly"],"pinyin":["Zhu1 Yun2 zhe1 kan3"],"word":"朱雲折檻"},{"definition":["see 驚弓之鳥|惊弓之鸟[jing1 gong1 zhi1 niao3]"],"pinyin":["shang1 gong1 zhi1 niao3"],"word":"傷弓之鳥"},{"definition":["lit. the dog that bites does not show its fangs (idiom)\/fig. You can't tell the really dangerous enemy from his external appearance."],"pinyin":["yao3 ren2 gou3 'r bu4 lu4 chi3"],"word":"咬人狗兒不露齒"},{"definition":["no room to advance or to retreat (idiom); without any way out of a dilemma\/trapped\/in an impossible situation"],"pinyin":["jin4 tui4 wei2 gu3"],"word":"進退維谷"},{"definition":["lit. the old man lost his horse, but it all turned out for the best (idiom)\/fig. a blessing in disguise\/it's an ill wind that blows nobody any good"],"pinyin":["sai4 weng1 shi1 ma3"],"word":"塞翁失馬"},{"definition":["ravenous wolves hold the road (idiom); wicked people in power\/a vicious tyranny rules the land"],"pinyin":["chai2 lang2 dang1 dao4"],"word":"豺狼當道"},{"definition":["to beat a tiger from the front door, only to have a wolf come in at the back (idiom); fig. facing one problem after another"],"pinyin":["qian2 men2 ju4 hu3 , hou4 men2 jin4 lang2"],"word":"前門拒虎，後門進狼"}]}