{"definition":["to stride toward (success)\/to march toward\/to take a step toward"],"pinyin":["mai4 xiang4"],"simplified":["迈向"],"rank":13833.0,"normalized_rank":0.193541617114155,"fraction":0.000004773614376012044,"cumulative_fraction":0.9538515308062716,"word":"邁向","characters":[{"definition":["to take a step\/to stride"],"pinyin":["mai4"],"word":"邁"},{"definition":["surname Xiang","towards\/to face\/to turn towards\/direction\/to support\/to side with\/shortly before\/formerly\/always\/all along\/(suffix) suitable for ...\/oriented to ..."],"pinyin":["Xiang4","xiang4"],"word":"向"}],"containing_words":[],"sentences":[{"english":"The obvious one is the move towards the architecture that are by and large loosely coupled distributed systems.","chinese":"最明顯的一個是邁向架構，是對大松耦合分佈式系統。"},{"english":"Failure is an essential step towards success.","chinese":"失敗是邁向成功之路所必不可少的。"},{"english":"Dr. Sun Yat-sen led the Chinese people to a free country.","chinese":"孫逸仙博士帶領中國人民邁向自由。"},{"english":"There are many ways to avoid success in life, but the most sure-fire just might be procrastination.","chinese":"在我們的人生道路中有許多事情牽拌着我們邁向成功。"},{"english":"We are reaching out for a new and boundless frontier.","chinese":"我們現在正邁向一個沒有邊際的新境界。"},{"english":"They have often raise a man from mediocrity to success.","chinese":"它們常常使一個平庸之輩邁向成功。"},{"english":"In fact, one may pay for frustration on the way to success.","chinese":"挫折其實就是邁向成功所應繳的學費。"},{"english":"Look at life through the wind-shield.","chinese":"透過檔風玻璃邁向人生。"},{"english":"Your habits alone determine who you become. Your habits alone determine if you succeed.","chinese":"僅僅你的習慣就能決定你能成爲誰，是否邁向成功。"},{"english":"It was, for a brief time, a brisk stroll into the future.","chinese":"在一個短暫時間內，它是一次邁向未來的輕快漫步。"},{"english":"The march to China's cities is part of a global sea change.","chinese":"邁向中國城市的行軍是全球大變化的一部分。"},{"english":"Yu of the Xia Dynasty exploited the road towards civilization in the Huanghe River Basin.","chinese":"夏禹的功業，據說開闢了黃河流域邁向文明的道路。"},{"english":"Xing to eat at home, cattle father and mother to encourage them to advance to marriage.","chinese":"邢致在一一家喫飯，牛父牛母鼓勵他倆早點邁向婚姻。"},{"english":"Striver itself more to being a success means a group of people.","chinese":"奮鬥者本身也更多的是指那羣正在邁向成功的人。"},{"english":"We should work to maintain a medium-high rate of growth and promote the development of industries toward the medium-high end.","chinese":"保持經濟中高速增長，推動產業邁向中高端水平。"},{"english":"Zhanhaoju is sincerely willing to hand by hand stride with the vast consumers and customers in the new century.","chinese":"展灝居願真誠與廣大客戶及消費者攜手邁向新的世紀。"}],"related":[]}