{"definition":["reducing agent"],"pinyin":["huan2 yuan2 ji4"],"simplified":["还原剂"],"rank":59149.0,"normalized_rank":0.8275712506820757,"fraction":4.744272873012796e-8,"cumulative_fraction":0.999777031145131,"word":"還原劑","characters":[{"definition":["still\/still in progress\/still more\/yet\/even more\/in addition\/fairly\/passably (good)\/as early as\/even\/also\/else","surname Huan","to pay back\/to return"],"pinyin":["Huan2","hai2","huan2"],"word":"還"},{"definition":["Hara (Japanese surname)","former\/original\/primary\/raw\/level\/cause\/source"],"pinyin":["Yuan2","yuan2"],"word":"原"},{"definition":["dose (medicine)"],"pinyin":["ji4"],"word":"劑"}],"containing_words":[],"sentences":[{"english":"Silver-coated carbonyl iron powder was prepared by using electroless plating method.","chinese":"用化學鍍法，甲醛爲還原劑，製備鍍銀羰基鐵粉。"},{"english":"The result of the novel reductive applied to the he copper anode-furnace in Jinchang Smelter is introduced.","chinese":"介紹新型還原劑在金昌冶煉廠銅陽極爐上的應用效果。"},{"english":"Reductant in the reaction of elements in valence increased.","chinese":"在反應中還原劑中元素的化合價升高。"},{"english":"The plant added carbamide as reducer into calciner continuously.","chinese":"該工廠使用尿素作爲還原劑，向分解爐內連續加入。"},{"english":"Reduction of tertiary amides to amines with combined reducing agents was studied.","chinese":"採用具有強活性的複合還原劑實現了叔酰胺的還原。"},{"english":"Here, ethanol is developed to be nontoxic reductant.","chinese":"發展了乙醇作爲一種無毒的還原劑。"},{"english":"Saturated cyclic steroid and terpenoid compound is the better reductant.","chinese":"含有飽和環的甾萜類是良好的還原劑。"},{"english":"All four preferred electroless baths use hypophosphite as a reducing agent.","chinese":"所有四個優先使用化學浴次磷酸鈉作爲還原劑。"},{"english":"The process for removing the chromium from the silicon steel plant wastewaters was studied by using sodium sulfite as reducer.","chinese":"用亞硫酸鈉爲還原劑對硅鋼含鉻廢水進行了試驗研究。"},{"english":"L-cysteine is also a reducing agent.","chinese":"半胱氨酸也是一種還原劑。"},{"english":"The present invention provides a reducer nozzle used for denitration by an SNCR method.","chinese":"本發明提供一種用於SNCR法脫硝的還原劑噴嘴。"},{"english":"Oxidizing agent and reducing agent make Iris typhifolia Kitag solution decline to colorless.","chinese":"氧化劑和還原劑會迅速使北陵鳶尾色素溶液降至無色。"},{"english":"Formaldehyde is a strong reducing agent, could be removed by oxidant.","chinese":"甲醛是強還原劑，可用氧化劑將其去除。"},{"english":"The chemical reductants fail to reduce carbonyl group under ambient conditions.","chinese":"羰基在一般條件下不易被化學還原劑還原。"},{"english":"A new technology for preparation of basic chromium sulfate, using sugar as a reductive agent to sodium dichromate, was introduced.","chinese":"以紅礬鈉爲原料，蔗糖爲還原劑，製備了鹼式硫酸鉻。"},{"english":"Arsenical compounds are not compatible with reducing agents.","chinese":"含砷化合物與還原劑不能共用。"}],"related":[]}