{"definition":["far from the center\/remote\/outlying"],"pinyin":["bian1 yuan3"],"simplified":["边远"],"rank":20090.0,"normalized_rank":0.28108516502735303,"fraction":0.00000237155252599895,"cumulative_fraction":0.9750525009374359,"word":"邊遠","characters":[{"definition":["side\/edge\/margin\/border\/boundary\/CL:個|个[ge4]\/simultaneously","suffix of a noun of locality"],"pinyin":["bian1","bian5"],"word":"邊"},{"definition":["far\/distant\/remote\/(intensifier in a comparison) by far\/much (lower etc)","to distance oneself from (classical)"],"pinyin":["yuan3","yuan4"],"word":"遠"}],"containing_words":[],"sentences":[{"english":"Take the plight of one community in China's far north-east.","chinese":"來看一下中國邊遠的東北地區一個社區的情況。"},{"english":"The remote county set up several middle-sized power stations in 1988.","chinese":"那個邊遠縣於1988年修建了幾座中型發電站。"},{"english":"There are 262 outlying islands and several are served by regularferries.","chinese":"在262個邊遠的小島之中有幾個是有渡輪服務的。"},{"english":"This had the effect however on turning areas such as Lijiang into small fiefdoms .","chinese":"在麗江這樣的邊遠小封地都是這樣。"},{"english":"Monkeypox occurs primarily in remote villages in Central and West Africa, near tropical rainforests.","chinese":"猴痘主要在中非和西非靠近熱帶雨林的邊遠村莊發生。"},{"english":"Why, they ask, does he live in such a strange out-of-the-way place?","chinese":"爲什麼他住在那麼邊遠的地方？"},{"english":"Further enhance the countermeasure and powerful steps of outlying district's agricultural technology extension.","chinese":"進一步加強邊遠地區科技推廣的對策和有力措施。"},{"english":"You need various IVR scenarios to enable IVCM to respond remote callers interactively.","chinese":"你需要這套方案使各邊遠來電IVCM迴應互動。"},{"english":"However, there is still a need to increase coverage to remote areas and migrant workers.","chinese":"但是，仍有必要提高邊遠地區和流動人口的覆蓋率。"},{"english":"They hope to civilize all the natives in the distant area.","chinese":"他們希望使邊遠地區所有的老百姓都能接受文明。"},{"english":"Heavy vehicles are used to transport the coal to distant parts of the country.","chinese":"用重型汽車把煤運往這個國家的邊遠地區。"},{"english":"People, a lot of them anyway, are tired of living out in the suburban boonies.","chinese":"人們，至少有許多人對居住在市郊邊遠地區感到厭倦。"},{"english":"Park in remote, but safe sections of parking lots.","chinese":"把車停放在停車場邊遠而又安全的地方。"},{"english":"In the outlying provinces that are part of Beijing's airshed, there is a great deal of heavy industry.","chinese":"在北京氣流區域的邊遠省份有很多重工業。"},{"english":"There are vast expanses of virgin land in the remote regions.","chinese":"在邊遠地區有大片大片未開墾的土地。"},{"english":"There are still many children who can not afford to go to school because of poverty in the remote areas of our country.","chinese":"在我國的邊遠地區仍有不少孩子因爲貧困而上不起學。"}],"related":[]}