{"definition":["mail van\/mail coach"],"pinyin":["you2 che1"],"simplified":["邮车"],"rank":48240.0,"normalized_rank":0.6749401872035594,"fraction":1.7298348783138965e-7,"cumulative_fraction":0.9986811032356014,"word":"郵車","characters":[{"definition":["post (office)\/mail"],"pinyin":["you2"],"word":"郵"},{"definition":["car\/vehicle\/CL:輛|辆[liang4]\/machine\/to shape with a lathe\/Kangxi radical 159","surname Che","war chariot (archaic)\/rook (in Chinese chess)\/rook (in chess)"],"pinyin":["Che1","che1","ju1"],"word":"車"}],"containing_words":[],"sentences":[{"english":"Two masked men held up a mail van.","chinese":"兩個戴面具的人攔路搶劫了一輛郵車。"},{"english":"The mail reached London at the dreary hour of five.","chinese":"郵車到達倫敦是在天已昏暗的五點鐘。"},{"english":"Only a few posting-chaises were setting out at a gallop from the Hotel des Princes and the Hotel Meurice.","chinese":"只有少數幾輛郵車從親王旅社和默里斯旅社奔馳出發。"},{"english":"Can I catch the last mail today?","chinese":"我能趕上今天最後一班的郵車嗎？"},{"english":"The mail-cart of a flying travel is on highway dash around madly.","chinese":"一輛飛速行駛的郵車在公路上橫衝直撞。"},{"english":"He takes a trip in the tight, smelly night mail-coach for Clavering.","chinese":"他乘一輛擁擠的，氣味熏天的夜班郵車去克拉弗林。"},{"english":"Mail comes to this remote village only once a week.","chinese":"郵車每週只到這個偏偏僻的村落一主。"},{"english":"Furthermore, this paper discusses the design and implementation of the remote monitoring system over Bluetooth.","chinese":"討論了基於藍牙技術的郵車調度系統的硬件實現。"},{"english":"The mail picked us up about dusk at the Royal George on the heath.","chinese":"黃昏時分，我們在“喬治王”前的荒地上搭乘了郵車。"},{"english":"The realization of hardware for post vehicle management information system based on bluetooth is discussed in this paper.","chinese":"討論了基於藍牙技術的郵車調度系統的硬件實現。"},{"english":"A mail van was parked beside my house when I got home.","chinese":"我回家的時候，一輛郵車停在我房子旁邊。"}],"related":[]}