{"definition":["to allocate\/to provide\/to outfit with"],"pinyin":["pei4 bei4"],"simplified":["配备"],"rank":2632.0,"normalized_rank":0.036825094791039965,"fraction":0.000056003148724565384,"cumulative_fraction":0.7716232659978419,"word":"配備","characters":[{"definition":["to join\/to fit\/to mate\/to mix\/to match\/to deserve\/to make up (a prescription)\/to allocate"],"pinyin":["pei4"],"word":"配"},{"definition":["to prepare\/get ready\/to provide or equip"],"pinyin":["bei4"],"word":"備"}],"containing_words":[],"sentences":[{"english":"In the latter period, they were armed with Winchester rifles, clubs and knives.","chinese":"在後階段，她們還配備了連發槍以及軍棍和軍刀。"},{"english":"I want this for every cannon . How many men will you need?","chinese":"我需要配備到每門炮，你要多少人？"},{"english":"And equipped with more than a decade has experienced drivers.","chinese":"並配備有十年以上駕齡，經驗豐富的司機。"},{"english":"Ideally, people culling and disposing of birds should have protective equipment.","chinese":"宰殺和處理禽類的人應該配備保護裝置。"},{"english":"That's especially true if your employer maintains an on-site charging station.","chinese":"當你老闆配備了一臺一站式充電站時更是如此。"},{"english":"Those variants equip an organism specially well to cope with the exigencies of the environments.","chinese":"變異使生物體配備得特別完善以應付環境的嚴酷要求。"},{"english":"The second floor includes a grandstand area and lounge area.","chinese":"二層則設有看臺區，並配備專門的休息室。"},{"english":"It features a modern dual-axis accelerometer to track the magnitude of your movements.","chinese":"它配備了現代雙軸加速度跟蹤的嚴重性你的動作。"},{"english":"This telephone with an inductor call became the company’s trademark.","chinese":"這部配備感應器的電話機成了該公司的招牌產品。"},{"english":"Kitchens will be staffed by a base of full-time chefs together with a stream of trainee chefs on work experience.","chinese":"廚房將配備專職廚師，還有一些實習生。"},{"english":"The test cabinets are standard-wise equipped with a lockable main switch according to VDE.","chinese":"按照VDE標準，試驗箱配備可鎖的主電源開關。"},{"english":"It has a 3.0-megapixel camera and camcorder, and comes with 4GB of internal memory.","chinese":"機型配備3百萬像素攝像頭，內置4GB內存。"},{"english":"Apartments include free internet access and a flat-screen TV with satellite channels.","chinese":"每間空調客房都配備了衛星電視和免費無線網絡連接。"},{"english":"The Moisturizing Shaving System is equipped with a dual blade system to give you an ultra close shave.","chinese":"剃的保溼系統，配備了雙刀片系統給你一個超近距離。"},{"english":"Scott led by people with a pony and Amundsen led equipped with the dogs and ski.","chinese":"斯科特率領的人與小馬和亞孟森領導配備警犬和滑雪。"},{"english":"They were enriched with the wisdom of God, and girded with the panoply of heaven.","chinese":"他們因上帝的智慧而富足，以天上的甲冑爲配備。"}],"related":[{"definition":["equipment\/facilities\/installations\/CL:個|个[ge4]"],"pinyin":["she4 bei4"],"word":"設備"},{"definition":["facilities\/installation"],"pinyin":["she4 shi1"],"word":"設施"},{"definition":["system\/CL:個|个[ge4]"],"pinyin":["xi4 tong3"],"word":"系統"},{"definition":["to transport (people, a payload etc)"],"pinyin":["da1 zai4"],"word":"搭載"},{"definition":["special\/dedicated"],"pinyin":["zhuan1 yong4"],"word":"專用"},{"definition":["to set up\/to arrange\/to establish\/to found\/to display"],"pinyin":["she4"],"word":"設"},{"definition":["to set up\/to install"],"pinyin":["she4 zhi4"],"word":"設置"},{"definition":["to put to use\/to apply\/practical\/applied (science, linguistics etc)\/application\/practical use\/(computing) app"],"pinyin":["ying4 yong4"],"word":"應用"},{"definition":["to belong or be dedicated exclusively to\/proprietary\/private\/personal"],"pinyin":["zhuan1 shu3"],"word":"專屬"},{"definition":["to install\/installation\/equipment\/system\/unit\/device"],"pinyin":["zhuang1 zhi4"],"word":"裝置"},{"definition":["to possess\/to have\/equipped with\/able to fulfill (conditions or requirements)"],"pinyin":["ju4 bei4"],"word":"具備"},{"definition":["to serve\/service\/CL:項|项[xiang4]"],"pinyin":["fu2 wu4"],"word":"服務"},{"definition":["to install\/to erect\/to fix\/to mount\/installation"],"pinyin":["an1 zhuang1"],"word":"安裝"},{"definition":["to recharge (a battery)\/(fig.) to recharge one's batteries (through leisure)\/to update one's skills and knowledge"],"pinyin":["chong1 dian4"],"word":"充電"},{"definition":["advanced (technology)\/to advance"],"pinyin":["xian1 jin4"],"word":"先進"},{"definition":["to replace (a worn-out tire etc)\/to change (one's address etc)"],"pinyin":["geng1 huan4"],"word":"更換"}]}