{"definition":["matching\/fitting in with\/compatible with\/to correspond\/to fit\/to conform to\/rapport\/to coordinate with\/to act in concert with\/to cooperate\/to become man and wife\/to combine parts of machine"],"pinyin":["pei4 he2"],"simplified":["配合"],"rank":1319.0,"normalized_rank":0.018454521287759013,"fraction":0.00012203393857115747,"cumulative_fraction":0.6645134333161623,"word":"配合","characters":[{"definition":["to join\/to fit\/to mate\/to mix\/to match\/to deserve\/to make up (a prescription)\/to allocate"],"pinyin":["pei4"],"word":"配"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"}],"containing_words":[{"definition":["to coordinate closely\/to act in close partnership with"],"pinyin":["jin3 mi4 pei4 he2"],"word":"緊密配合"}],"sentences":[{"english":"Under the match of dark set, once one day inside sweep two records of counties.","chinese":"在暗組的配合下，曾有一天之內橫掃兩個縣的記錄。"},{"english":"Objective To evaluate the treatment of cooperative care of patients with IVP.","chinese":"目的探討靜脈腎盂造影的護理配合。"},{"english":"Wang Lei's sharp break in the Moco and the formation of the basket with even 4 hours.","chinese":"王磊犀利的突破和莫科在籃下形成配合連得4分。"},{"english":"Miami ran plays and the Mavs played defense.","chinese":"熱火打出了配合，而小牛祭出了防守。"},{"english":"A new method has been used for calculation stability constants of metal com-plexes.","chinese":"提出了配合物穩定常數的一種新計算方法。"},{"english":"Able to work under pressure, working independently, willingness to work overtime or work with shift.","chinese":"具抗壓性，能獨立作業，並配合加班及輪班。"},{"english":"Particularly suitable for people with to do aerobic exercise to Dietary Fat Reduction.","chinese":"特別適合人們配合做有氧運動來減脂。"},{"english":"Some will try to get you to think they are super-adaptable and would fit into any type of situation.","chinese":"有些會嘗試你覺得自己超能配合適應任何類型的情況。"},{"english":"Objective To observe the curative effect of Liyan Ice Bar on bulbar paralysis.","chinese":"目的觀察利咽冰棒配合針刺治療球麻痹的臨牀療效。"},{"english":"Removes gently with Revlon ColorStay Eye& Lip Makeup Remover .","chinese":"卸妝時請配合使用露華濃不脫色眼脣部卸妝乳。"},{"english":"Conclusion Balancing acupuncture is superior to conventional acupuncture in treating stiff neck.","chinese":"目的觀察平衡針配合運動療法治療落枕臨牀療效。"},{"english":"To observe the effects of needling combined with function training on the balance function of stroke patients.","chinese":"探討針刺配合功能訓練對腦卒中患者平衡功能的影響。"},{"english":"We accommodate differences of students, adapt our work to meet individual needs and group differences.","chinese":"我們堅信有教無類，以配合學生個體需要和羣體差異。"},{"english":"These days I am practicing it with my casette tape recorder at home.","chinese":"這幾天，我正在家裏配合錄音機練習。"},{"english":"The geometry of the sans serif, all-caps typography provided that tie.","chinese":"幾何形狀的無襯，全帽印刷術提供配合。"},{"english":"Use stain removal spray gun with stain removal agent to do pre-wash preparation.","chinese":"利用去漬槍，配合預處理劑完成洗前預處理。"}],"related":[{"definition":["to assist\/to aid\/supplementary\/auxiliary\/subsidiary"],"pinyin":["fu3 zhu4"],"word":"輔助"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"},{"definition":["preceding period\/early stage"],"pinyin":["qian2 qi1"],"word":"前期"},{"definition":["control\/to exercise control over\/to contain"],"pinyin":["kong4 zhi4"],"word":"控制"},{"definition":["to join together\/to combine"],"pinyin":["xian2 jie1"],"word":"銜接"},{"definition":["perfect\/perfection\/perfectly"],"pinyin":["wan2 mei3"],"word":"完美"},{"definition":["to catch up with\/to keep pace with"],"pinyin":["gen1 shang4"],"word":"跟上"},{"definition":["late stage\/later period"],"pinyin":["hou4 qi1"],"word":"後期"},{"definition":["to start on a journey\/to be on one's way"],"pinyin":["shang4 lu4"],"word":"上路"},{"definition":["to reinforce\/to strengthen\/to increase"],"pinyin":["jia1 qiang2"],"word":"加強"},{"definition":["rhythm\/tempo\/musical pulse\/cadence\/beat"],"pinyin":["jie2 zou4"],"word":"節奏"},{"definition":["and\/besides\/moreover\/furthermore\/in addition"],"pinyin":["bing4 qie3"],"word":"並且"},{"definition":["to exploit\/to make use of\/to use\/to take advantage of\/to utilize"],"pinyin":["li4 yong4"],"word":"利用"},{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推進"},{"definition":["result\/effect\/efficacy\/(theater) sound or visual effects"],"pinyin":["xiao4 guo3"],"word":"效果"}]}