{"definition":["to compound (medicines etc)\/to prepare (by mixing ingredients)\/to concoct"],"pinyin":["pei4 zhi4"],"simplified":["配制"],"rank":19785.0,"normalized_rank":0.2768178193163852,"fraction":0.000002448920668235774,"cumulative_fraction":0.9743173146911366,"word":"配製","characters":[{"definition":["to join\/to fit\/to mate\/to mix\/to match\/to deserve\/to make up (a prescription)\/to allocate"],"pinyin":["pei4"],"word":"配"},{"definition":["to manufacture\/to make"],"pinyin":["zhi4"],"word":"製"}],"containing_words":[],"sentences":[{"english":"The confection of the nutritious liquid is a important technical problem in the hydroponics .","chinese":"營養液配製是無土栽培一個關鍵的技術問題。"},{"english":"The regulations also ban unregulated health practitioners from commissioning or formulating their own medicines.","chinese":"法規還嚴禁不合格的中醫醫生從業或配製自己的藥方。"},{"english":"The preparation of beverages such as betel nut, to prevent the occurrence of severe malaria disease.","chinese":"如用檳榔配製飲料，可預防瘴氣重而發生的疾病。"},{"english":"Lime water may be bought at any druggist's, or easily prepared at home.","chinese":"石灰水可從藥店購得，不過在家裏配製也很容易。"},{"english":"Kava is also the name of the pungent beverage prepared from the plant's roots.","chinese":"卡瓦根也是由植物根配製的辛辣飲料的名字。"},{"english":"After washing the feeding and preparation equipment, rinse thoroughly in safe water.","chinese":"在清洗餵養和配製器具後，再用安全飲水徹底沖洗。"},{"english":"Stock standard solutions are used to prepare primary dilution standards.","chinese":"儲備標準溶液是用於配製第一稀釋標準溶液。"},{"english":"The total floating wage system for the staff is a great development of the income and allocation system.","chinese":"勞動工資制度是收入分配製度的主要內容。"},{"english":"Introduced the preparation of color glaze used in unglazed ware altering to green body.","chinese":"介紹了素燒坯改素坯施釉用色釉的配製。"},{"english":"One of the coolest things about 4Food is the ability to save the burgers you’ve made to the food system.","chinese":"它最酷的功能之一是把你個人配製的漢堡存入系統。"},{"english":"This paper introduces a method of preparing and using a new room-temperature quick phosphating solution.","chinese":"介紹一種新型常溫快速磷化液的配製和使用方法。"},{"english":"Post allowance system (PAS) is an innovation method of distribution system in college and university.","chinese":"高校崗位津貼制度是高校分配製度的創新之舉。"},{"english":"Application of special fine sand concrete to the construction of Dongxiguan Hydropower Station;","chinese":"東西關水電站採用特細砂配製水工混凝土。"},{"english":"We will reform the income distribution system.","chinese":"改革收入分配製度。"},{"english":"Several lower alkalinity and small addition concrete expansion agents were prepared with different raw materials.","chinese":"利用不同的原料配製了多組低鹼低摻型混凝土膨脹劑。"},{"english":"The research supplied theoretical way to confect electrostatic spraying preparation.","chinese":"這些規律爲以後靜電噴霧製劑的配製提供了理論依據。"}],"related":[{"definition":["to manufacture\/to turn out (a product)"],"pinyin":["zhi4 cheng2"],"word":"製成"},{"definition":["swim bladder"],"pinyin":["yu2 biao4"],"word":"魚鰾"},{"definition":["to fire (in a kiln)"],"pinyin":["shao1 zhi4"],"word":"燒製"},{"definition":["raw materials for making soup\/packaged soup mix"],"pinyin":["tang1 liao4"],"word":"湯料"},{"definition":["medicinal cuisine"],"pinyin":["yao4 shan4"],"word":"藥膳"},{"definition":["to prepare\/preparation (chemistry)"],"pinyin":["zhi4 bei4"],"word":"製備"},{"definition":["to seem almost genuine\/easily mistaken for the real thing"],"pinyin":["ji1 ke3 luan4 zhen1"],"word":"幾可亂真"},{"definition":["tortoise plastron\/turtle shell"],"pinyin":["gui1 ban3"],"word":"龜板"},{"definition":["complementary item"],"pinyin":["bu3 chong1 pin3"],"word":"補充品"},{"definition":["to modulate\/modulation"],"pinyin":["tiao2 zhi4"],"word":"調制"},{"definition":["sweetener (food additive)"],"pinyin":["tian2 wei4 ji4"],"word":"甜味劑"},{"definition":["camphor C10H16O"],"pinyin":["zhang1 nao3"],"word":"樟腦"},{"definition":["to copy\/to imitate\/to make by imitating a model"],"pinyin":["fang3 zhi4"],"word":"仿製"},{"definition":["chicken raised for meat\/broiler\/(computing) zombie\/infected computer in a botnet"],"pinyin":["rou4 ji1"],"word":"肉雞"},{"definition":["turmeric"],"pinyin":["jiang1 huang2"],"word":"薑黃"},{"definition":["patent medicine\/medicine already made up"],"pinyin":["cheng2 yao4"],"word":"成藥"}]}