{"definition":["phenol (chemistry)"],"pinyin":["fen1 lei4 hua4 he2 wu4"],"simplified":["酚类化合物"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"酚類化合物","characters":[{"definition":["phenol"],"pinyin":["fen1"],"word":"酚"},{"definition":["kind\/type\/class\/category\/similar\/like\/to resemble"],"pinyin":["lei4"],"word":"類"},{"definition":["to make into\/to change into\/-ization\/to ... -ize\/to transform\/abbr. for 化學|化学[hua4 xue2]","variant of 花[hua1]"],"pinyin":["hua1","hua4"],"word":"化"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["thing\/object\/matter\/abbr. for physics 物理"],"pinyin":["wu4"],"word":"物"}],"containing_words":[],"sentences":[{"english":"The major components of acidic fraction are phenols and organic acids.","chinese":"酸性組分主要由酚類化合物和有機羧酸組成。"},{"english":"The gingerols from ginger were extracted with supercritical CO2 fluid extraction.","chinese":"以生薑爲原料，採用超臨界CO2萃取姜酚類化合物。"},{"english":"The possibility of using this electrochemical reaction for polyphenolic compound analysis is proposed.","chinese":"提出電化學測試分析多酚類化合物的可能性。"},{"english":"Aldehydic and phenolic compounds are found in cinnamon and mustard.","chinese":"在肉桂和芥菜中含有醛類和酚類化合物。"},{"english":"This paper presents the experimental results of investigating the composition of phenol compounds of Chinese Larch tree.","chinese":"研究了混合態的興安落葉松樹木中酚類化合物的組成。"},{"english":"Natural goethite has the ability to degrade phenolic compounds better than synthetic goethite.","chinese":"天然針鐵礦降解酚類化合物的能力高於合成針鐵礦。"},{"english":"The analytic method of phenols in water was introduced in detail.","chinese":"詳細介紹了水中酚類化合物的測定方法。"},{"english":"No chlorinated phenolic compounds was found in the hypochlorite effluents.","chinese":"次氯酸鹽漂白段廢液中的氯代酚類化合物含量極少。"},{"english":"Caffeic acid is another phenolic compound found in grapes.","chinese":"咖啡酸是葡萄中含有的另一種酚類化合物。"}],"related":[]}