{"definition":["alkyd resin"],"pinyin":["chun2 suan1 shu4 zhi1"],"simplified":["醇酸树脂"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"醇酸樹脂","characters":[{"definition":["alcohol\/wine with high alcohol content\/rich\/pure\/good wine\/sterols"],"pinyin":["chun2"],"word":"醇"},{"definition":["sour\/tart\/sick at heart\/grieved\/sore\/aching\/pedantic\/impractical\/to make sarcastic remarks about sb\/an acid"],"pinyin":["suan1"],"word":"酸"},{"definition":["tree\/CL:棵[ke1]\/to cultivate\/to set up"],"pinyin":["shu4"],"word":"樹"},{"definition":["fat\/rouge (cosmetics)\/resin"],"pinyin":["zhi1"],"word":"脂"}],"containing_words":[],"sentences":[{"english":"A general program of formulating of recipe suitable for self-drying water-soluble alkyd resin was established.","chinese":"建立了適合於水溶性醇酸樹脂配方設計的通用程序。"},{"english":"The title alkyd resin modified waterborne nitrocellulose emulsion was prepared by alkyd resin phase inversion process.","chinese":"採用醇酸樹脂相反轉乳化法制備了硝化纖維素乳液。"},{"english":"Properties of ethoxyl and hydroxyl containing organo-silicone copolymerized with alkyd resin were studied.","chinese":"研究了乙氧基羥基硅樹脂與醇酸樹脂共聚物的性能。"},{"english":"Coatings based on alkyd resins tend to be relatively low cost but exhibit poor durability.","chinese":"在多元醇酸樹脂爲基礎的塗料成本較低但耐久性不佳。"},{"english":"Silicone alkyds are generally cross-linked with amino resins.","chinese":"硅多元醇酸樹脂通常用氨基樹脂作爲交聯劑。"},{"english":"Produced by the series of alkyd paint and excellent quality.","chinese":"所生產之醇酸樹脂系列塗料，質量優良。"},{"english":"The produce of alkyd resin have long history, manufacturing process is perfect.","chinese":"醇酸樹脂的生產已有很長的歷史，生產工藝成熟穩定。"},{"english":"The alkyd was styrened using a post styrenation process.","chinese":"採用後苯乙烯化方法合成苯乙烯改性醇酸樹脂。"},{"english":"The preparations of palm oil alkyd resin and its paint with melamine were related.","chinese":"闡述了棕櫚油醇酸樹脂及其醇酸氨基漆的製法。"}],"related":[]}