{"definition":["to come to oneself\/to come to realize\/to come to see the truth\/to wake up to reality"],"pinyin":["xing3 wu4"],"simplified":["醒悟"],"rank":23730.0,"normalized_rank":0.3320134876107061,"fraction":0.0000016623932147036837,"cumulative_fraction":0.9822953062889728,"word":"醒悟","characters":[{"definition":["to wake up\/to be awake\/to become aware\/to sober up\/to come to"],"pinyin":["xing3"],"word":"醒"},{"definition":["to comprehend\/to apprehend\/to become aware"],"pinyin":["wu4"],"word":"悟"}],"containing_words":[{"definition":["a sudden realization\/to realize sth in a flash"],"pinyin":["huang3 ran2 xing3 wu4"],"word":"恍然醒悟"}],"sentences":[{"english":"Until last hurt, I will not awake?","chinese":"直到最後的傷害，我才肯醒悟嗎？"},{"english":"Cuiping finally realized her act and took the pipe and went out bare foot to the balcony.","chinese":"倒是翠平猛然醒悟過來，拎着菸袋光着腳跑到陽臺上。"},{"english":"When the penny drops like this, there are only two possible outcomes.","chinese":"當年輕人幡然醒悟時，只有兩種可能的後果。"},{"english":"You're infatuated with her now, but the scales will soon fall form your eyes.","chinese":"你現在還迷戀着她，但不久就會猛然醒悟過來的。"},{"english":"The necessity of making a living disentranced him from his gamble.","chinese":"謀生的必要使他醒悟，不再賭博了。"},{"english":"This one could be a prelude to the anger and disillusionment that is only beginning to swell.","chinese":"這可能就是剛剛開始膨脹的憤怒和醒悟的前奏。"},{"english":"At last it dawned on me that these obstacles were my life. \"------Alfred D'Souza.\"","chinese":"可到最後我翻然醒悟，這些障礙物就是我的生活。"},{"english":"The harshness of recent reality disentranced him from his idleness.","chinese":"最近的嚴酷現實使他醒悟，不再遊手好閒了。"},{"english":"Now I began to understand: As a writer, I was also an activist.","chinese":"如今我開始醒悟，作爲一名作家，也可以積極參與。"},{"english":"Truth enlightens the mind, but won't always bring happiness to your heart.","chinese":"真相使人醒悟，卻未必使人快樂。"},{"english":"After a long journey, he finally wakes up to the reality of life.","chinese":"一番長途旅行後，牠終於醒悟到生活的現實面。"},{"english":"I misunderstood the south west chicken awakening.","chinese":"西鳳醒悟本人誤解向南了。"},{"english":"But by the next morning, Cassandra had come around.","chinese":"但是到了第二天早上，卡桑德醒悟了過來。"},{"english":"Dad, you have just worded a profound change in my personality.","chinese":"爸爸，你剛纔這番話發人深思，使我幡然醒悟。"},{"english":"Meanwhile, they awake to the break of happiness, the betrayal of connubial .","chinese":"同一刻，他們醒悟到幸福的破裂，配偶的背叛。"},{"english":"Fake and low-quality products have disillusioned customers in China.","chinese":"假冒僞劣商品使中國的消費者飽受其害，並最終醒悟。"}],"related":[{"definition":["to realize suddenly\/to wake up with a start"],"pinyin":["jing1 jue2"],"word":"驚覺"},{"definition":["suddenly (understand sth)\/in a flash"],"pinyin":["huang3 ran2"],"word":"恍然"},{"definition":["to suddenly realize\/to suddenly see the light"],"pinyin":["huang3 ran2 da4 wu4"],"word":"恍然大悟"},{"definition":["suddenly and completely (realize, change one's strategy etc)"],"pinyin":["fan1 ran2"],"word":"幡然"},{"definition":["to realize suddenly\/to wake up to the truth\/to suddenly awake from sleep"],"pinyin":["meng3 xing3"],"word":"猛醒"},{"definition":["to become aware\/to detect\/to realize\/to perceive"],"pinyin":["fa1 jue2"],"word":"發覺"},{"definition":["to collect one's thoughts (after being surprised or shocked)\/to snap out of it (after being lost in thought)"],"pinyin":["hui2 shen2"],"word":"回神"},{"definition":["to figure out\/to realize\/to become convinced\/to come round (to an idea)\/to get over it"],"pinyin":["xiang3 tong1"],"word":"想通"},{"definition":["clear-headed\/sober\/awake"],"pinyin":["qing1 xing3"],"word":"清醒"},{"definition":["to rouse\/to be woken by sth\/to wake with a start\/to sleep lightly"],"pinyin":["jing1 xing3"],"word":"驚醒"},{"definition":["stunned\/amazed"],"pinyin":["e4 ran2"],"word":"愕然"},{"definition":["to stun\/to shock and amaze\/stupefied\/astonishment"],"pinyin":["jing1 e4"],"word":"驚愕"},{"definition":["relieved\/at ease\/feel relieved"],"pinyin":["shi4 ran2"],"word":"釋然"},{"definition":["to forget one's manners\/to forget oneself\/to lose self-control (in a situation)"],"pinyin":["shi1 tai4"],"word":"失態"},{"definition":["to stop\/to pull back"],"pinyin":["shou1 shou3"],"word":"收手"},{"definition":["to turn pale with fright (idiom)"],"pinyin":["da4 jing1 shi1 se4"],"word":"大驚失色"}]}