{"definition":["medical scientist"],"pinyin":["yi1 xue2 jia1"],"simplified":["医学家"],"rank":37849.0,"normalized_rank":0.5295566157849817,"fraction":4.709238242565932e-7,"cumulative_fraction":0.9955722813625684,"word":"醫學家","characters":[{"definition":["medical\/medicine\/doctor\/to cure\/to treat"],"pinyin":["yi1"],"word":"醫"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[],"sentences":[{"english":"A forensic scientist there tells Holloway’s father it’s bone from a human female.","chinese":"那裏的法醫學家告訴哈勒維的父親這個骨頭是女性的。"},{"english":"Jessica, a 42-year-old forensic scientist, is typical of the lucky group.","chinese":"四十二歲的法醫學家傑西卡是幸運組的典型。"},{"english":"Eating fruit is regarded as the golden rule and precious percept after a meal, but physicians put forward the objection.","chinese":"飯後一隻果被奉爲金科玉律，但醫學家卻提出了異議。"},{"english":"Li Jianyi was a traditional Chinese physician with great achievements in modern times.","chinese":"李健頤是近現代醫學史上一位頗有建樹的中醫學家。"},{"english":"A practicing forensic scientist has a built-in bias or predisposition toward the prosecution's side.","chinese":"開業的法醫學家對辯方有一種固有的偏愛或傾向。"},{"english":"Smallpox inoculation or variolation is a great invention of medicine in ancient China.","chinese":"人痘接種預防天花是中國古代醫學家的偉大發明。"},{"english":"Li Shizhen(1518–1593), was one of the greatest physicians and pharmacologists.","chinese":"李時珍是最偉大的醫學家和藥理學家之一。"},{"english":"REBT pays more attention to the collaboration between the therapist and patient.","chinese":"REBT更注重臨牀醫學家和病人之間的協作。"},{"english":"Forensic experts will begin to examine victims' remains from today.","chinese":"法醫學家將從今天開始這項工作。"},{"english":"I had a best friend for a while who was a professional therapist.","chinese":"我之前有位摯友，她是個專業的臨牀醫學家。"}],"related":[{"definition":["pharmacology"],"pinyin":["yao4 wu4 xue2"],"word":"藥物學"},{"definition":["offspring a famous family (idiom); good breeding\/blue blood"],"pinyin":["ming2 men2 wang4 zu2"],"word":"名門望族"},{"definition":["scholar of the rationalist school of Neo-Confucianism 理學|理学[Li3 xue2]"],"pinyin":["li3 xue2 jia1"],"word":"理學家"},{"definition":["founding master of a monastery\/founder\/originator"],"pinyin":["kai1 shan1 zu3 shi1"],"word":"開山祖師"},{"definition":["anecdote\/apocryphal story"],"pinyin":["yi4 wen2"],"word":"軼聞"},{"definition":["to spread\/to hand down\/to disseminate"],"pinyin":["chuan2 bu4"],"word":"傳布"},{"definition":["botanist"],"pinyin":["zhi2 wu4 xue2 jia1"],"word":"植物學家"},{"definition":["the Book of History, one of the Five Classics of Confucianism 五經|五经[Wu3 jing1], a compendium of documents which make up the oldest extant texts of Chinese history, from legendary times down to the time of Confucius, also known as 尚書經|尚书经[Shang4 shu1 jing1], 尚書|尚书[Shang4 shu1], 書|书[Shu1]"],"pinyin":["Shu1 jing1"],"word":"書經"},{"definition":["Chinese phonetics (concerned also with rhyme in poetry)"],"pinyin":["yin1 yun4 xue2"],"word":"音韻學"},{"definition":["divination combined with mystical Confucian philosopy, prevalent during the Eastern Han Dynasty (25-220)"],"pinyin":["chen4 wei3"],"word":"讖緯"},{"definition":["healer\/physician\/medical man\/doctor (esp. of TCM)"],"pinyin":["yi1 jia1"],"word":"醫家"},{"definition":["to run a newspaper\/to publish a newspaper"],"pinyin":["ban4 bao4"],"word":"辦報"},{"definition":["to write for sb else\/a lawyer who writes legal documents for his clients"],"pinyin":["dai4 shu1"],"word":"代書"},{"definition":["Laiyang county level city in Yantai 煙台|烟台, Shandong"],"pinyin":["Lai2 yang2"],"word":"萊陽"},{"definition":["standing above the common crowd (idiom); outstanding\/excellent and unrivaled"],"pinyin":["zhuo2 er3 bu4 qun2"],"word":"卓爾不群"},{"definition":["Marcus Tullius Cicero (106-43 BC), famous Roman politician, orator and philosopher, murdered at the orders of Marc Anthony"],"pinyin":["Xi1 sai1 luo2"],"word":"西塞羅"}]}