{"definition":["doctor-patient"],"pinyin":["yi1 huan4"],"simplified":["医患"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"醫患","characters":[{"definition":["medical\/medicine\/doctor\/to cure\/to treat"],"pinyin":["yi1"],"word":"醫"},{"definition":["to suffer (from illness)\/to contract (a disease)\/misfortune\/trouble\/danger\/worry"],"pinyin":["huan4"],"word":"患"}],"containing_words":[],"sentences":[{"english":"To explain the current tense physician-patient relationship is an exigent social problem.","chinese":"解讀目前緊張的醫患關係是一個迫切的社會課題。"},{"english":"Informed consent is the most basic and key right of patients.","chinese":"患者知情同意權是醫患關係中最基礎和最核心的權利。"},{"english":"The matey relation between the doctors and patients has active effect on preventing medical disputes.","chinese":"融洽的醫患關係對防範醫療糾紛起着積極的作用。"},{"english":"Doctor-patient relationship has become a pain spot of whole society in recent several years.","chinese":"近幾年，醫患關係成爲整個社會的痛點。"},{"english":"In recent years, physician-patient relationship has becoming very nervous in our country.","chinese":"近年來醫患關係緊張成了一個社會熱點問題。"},{"english":"The doctor-patient relationship is based on trust.","chinese":"醫患關係以信任爲基礎。"},{"english":"It's of great importance to construct Doctor-patient Communication and make it a compulsory course for medical education.","chinese":"在高等醫學教育中開設醫患溝通學必修課程意義重大。"},{"english":"In recent years, the doctor-patient relationship is turning into social hot spot gradually.","chinese":"近年來，醫患關係逐漸成爲社會的一大熱點。"},{"english":"By mainly exploring causes and effects about media involving in physician-patient disputes.","chinese":"探討傳媒介入醫患糾紛的原因及作用。"},{"english":"The ancient doctor-patient relationship changes following the whirligig of time and society.","chinese":"古代醫患關係因時代與社會的變遷而有所改變。"},{"english":"We believe with the promotion of medical ethics, the relationship between doctors and patients will become more harmonious.","chinese":"我們相信隨着醫德的提升，醫患關係將變得更加和諧。"},{"english":"Currently medical dispute is in an increasing tendency and the doctor-patient conflict aggravates in China.","chinese":"現階段我國的醫患糾紛日益增多，醫患矛盾尖銳。"},{"english":"Currently medical dispute is in an increasing tendency and the doctor-patient conflict aggravates in China.","chinese":"現階段我國的醫患糾紛日益增多，醫患矛盾尖銳。"},{"english":"It could damage the patient-doctor relationship.","chinese":"這或許會破壞醫患之間的關係。"},{"english":"Communication without language plays a key role in the communication between the doctors and patients.","chinese":"而非語言性溝通在醫患溝通中發揮着非常重要的作用。"},{"english":"That is a part of the special joy of a psychotherapy relationship.","chinese":"這也是心理治療中醫患關係最有樂趣的一點。"}],"related":[{"definition":["civil society"],"pinyin":["gong1 min2 she4 hui4"],"word":"公民社會"},{"definition":["to treat the symptoms\/reactive (rather than proactive)"],"pinyin":["tou2 tong4 yi1 tou2"],"word":"頭痛醫頭"},{"definition":["(Tw) to guide sb in the right direction\/to correct (behavior etc)"],"pinyin":["dao3 zheng4"],"word":"導正"},{"definition":["lit. to prescribe the right medicine for an illness (idiom); fig. to study a problem to find the right way to solve it\/to take appropriate steps"],"pinyin":["dui4 zheng4 xia4 yao4"],"word":"對症下藥"},{"definition":["Quality of Service\/QOS"],"pinyin":["fu2 wu4 zhi4 liang4"],"word":"服務質量"},{"definition":["fears of trouble in the rear (idiom); family worries (obstructing freedom of action)\/worries about the future consequences\/often in negative expressions, meaning \"no worries about anything\""],"pinyin":["hou4 gu4 zhi1 you1"],"word":"後顧之憂"},{"definition":["initiative\/active role"],"pinyin":["neng2 dong4 xing4"],"word":"能動性"},{"definition":["bring order out of chaos\/set to rights things which have been thrown into disorder"],"pinyin":["bo1 luan4 fan3 zheng4"],"word":"撥亂反正"},{"definition":["to discharge one's duties\/conscientious"],"pinyin":["jin4 zhi2"],"word":"盡職"},{"definition":["Chinese and Western medicine\/a doctor trained in Chinese and Western medicine"],"pinyin":["zhong1 xi1 yi1"],"word":"中西醫"},{"definition":["plan of convenience (idiom); stop-gap measure\/makeshift stratagem\/interim step"],"pinyin":["quan2 yi2 zhi1 ji4"],"word":"權宜之計"},{"definition":["social relation"],"pinyin":["she4 hui4 guan1 xi4"],"word":"社會關係"},{"definition":["highest common factor HCF\/greatest common divisor GCD"],"pinyin":["zui4 da4 gong1 yue1 shu4"],"word":"最大公約數"},{"definition":["to yield to one another\/mutual accommodation"],"pinyin":["hu4 rang4"],"word":"互讓"},{"definition":["stake\/vital interest\/concern"],"pinyin":["li4 hai4 guan1 xi5"],"word":"利害關係"},{"definition":["fair competition"],"pinyin":["gong1 ping2 jing4 zheng1"],"word":"公平競爭"}]}