{"definition":["medical knowledge\/principles of medical science"],"pinyin":["yi1 li3"],"simplified":["医理"],"rank":57480.0,"normalized_rank":0.8042197752997635,"fraction":5.970484938653026e-8,"cumulative_fraction":0.9996878037804912,"word":"醫理","characters":[{"definition":["medical\/medicine\/doctor\/to cure\/to treat"],"pinyin":["yi1"],"word":"醫"},{"definition":["texture\/grain (of wood)\/inner essence\/intrinsic order\/reason\/logic\/truth\/science\/natural science (esp. physics)\/to manage\/to pay attention to\/to run (affairs)\/to handle\/to put in order\/to tidy up"],"pinyin":["li3"],"word":"理"}],"containing_words":[],"sentences":[{"english":"In the theory of TCM the term \"triple warmer\" is also used to locate the body parts.","chinese":"在中醫理論中，三焦也是劃分軀體部位的一個概念。"},{"english":"Chinese medicine theory, the waist for kidney Fu, the main female reproductive and menstrual.","chinese":"中醫理論中，腰爲腎之腑，主生殖和女性月經。"},{"english":"Development and innovation of theory of TCM should sparkplug the standpoint of Yin -Ya ng equalitarian and c…","chinese":"中醫理論的發展與創新，應倡導陰陽平等協調的觀點。"},{"english":"TCM is characterized by the concept of organic wholeness and treatment based on syndrome differentiation.","chinese":"中醫理論體系的基本特點是整體觀念和辨證論治。"},{"english":"Theory of TCM, the waist of renal government office of reproductive and female menstruation, Lord.","chinese":"中醫理論中，腰爲腎之府，主生殖和女性月經。"},{"english":"Inheritance and innovation of Chinese medicine theory has been the world wide attention.","chinese":"如何將中醫理論繼承和創新已被世人廣泛關注。"},{"english":"Yin-yang is involved in every aspect of traditional Chinese medicine's theoretical system.","chinese":"陰陽理論涉及傳統中醫理論體系的各個方面。"},{"english":"It deals with the philosophic origin of magnifying Yin and respecting Yang idea and its influence to the theory of TCM.","chinese":"討論崇陰尊陽思想的哲學淵源及其對中醫理論的影響。"},{"english":"Without theoretical support the modernization of TCM could only be like a flower as the broad leaved Epiphyllum briefly.","chinese":"沒有中醫理論的支持，中醫藥現代化只能是曇花一現。"},{"english":"Traditional Chinese medicine is a natural-philosophized medicine.","chinese":"中醫理論是自然哲學性質的醫學。"},{"english":"Can abuse blindly in no way, must act according to the Chinese medicine theory, dialectical selects.","chinese":"決不能盲目濫用，必須根據中醫理論，辨證選用。"},{"english":"Chinese materia medica refers to medicinals used under the guidance of traditional Chinese medical theory.","chinese":"中藥指在中醫理論指導下應用的藥物。"},{"english":"Viscera-state doctrine, as a basis of TCM theory, has come into being for more than two thousand years.","chinese":"藏象學說作爲中醫理論的基石已形成兩千多年。"}],"related":[{"definition":["(TCM) the four methods of diagnosis, namely 望診|望诊[wang4 zhen3] (observation), 聞診|闻诊[wen2 zhen3] (auscultation and olfaction), 問診|问诊[wen4 zhen3] (interrogation), 切診|切诊[qie4 zhen3] (pulse feeling and palpation)"],"pinyin":["si4 zhen3"],"word":"四診"},{"definition":["interpretation of the cause\/onset and process of an illness\/pathogenesis"],"pinyin":["bing4 ji1"],"word":"病機"},{"definition":["to investigate"],"pinyin":["bian4 zheng4"],"word":"辨證"},{"definition":["theoretical foundation"],"pinyin":["li3 lun4 ji1 chu3"],"word":"理論基礎"},{"definition":["(TCM) diagnosis based on the patient's pulse\/to make such a diagnosis"],"pinyin":["mai4 zhen3"],"word":"脈診"},{"definition":["Chinese and Western medicine\/a doctor trained in Chinese and Western medicine"],"pinyin":["zhong1 xi1 yi1"],"word":"中西醫"},{"definition":["anatomy"],"pinyin":["jie3 pou1 xue2"],"word":"解剖學"},{"definition":["authentic tradition\/handed-down teachings or techniques"],"pinyin":["zhen1 chuan2"],"word":"真傳"},{"definition":["folklore"],"pinyin":["min2 su2 xue2"],"word":"民俗學"},{"definition":["healer\/physician\/medical man\/doctor (esp. of TCM)"],"pinyin":["yi1 jia1"],"word":"醫家"},{"definition":["to guide patiently and systematically (idiom)"],"pinyin":["xun2 xun2 shan4 you4"],"word":"循循善誘"},{"definition":["arts of healing, divination, horoscope etc\/supernatural arts (old)"],"pinyin":["fang1 shu4"],"word":"方術"},{"definition":["to interpret and make glossaries and commentaries on classic texts"],"pinyin":["xun4 gu3"],"word":"訓詁"},{"definition":["easy to learn","study of the Book of Changes 易經|易经[Yi4 jing1]"],"pinyin":["Yi4 xue2","yi4 xue2"],"word":"易學"},{"definition":["treatment involving the use of tonics to restore the patient's health\/reinforcing method (in acupuncture)"],"pinyin":["bu3 fa3"],"word":"補法"},{"definition":["political relations"],"pinyin":["zheng4 zhi4 guan1 xi4"],"word":"政治關係"}]}