{"definition":["to form gradually\/to lead to"],"pinyin":["niang4 cheng2"],"simplified":["酿成"],"rank":13040.0,"normalized_rank":0.1824465182656388,"fraction":0.000005313293662520607,"cumulative_fraction":0.9498558291601196,"word":"釀成","characters":[{"definition":["to ferment\/to brew\/to make honey (of bees)\/to lead to\/to form gradually\/wine\/stuffed vegetables (cooking method)"],"pinyin":["niang4"],"word":"釀"},{"definition":["surname Cheng","to succeed\/to finish\/to complete\/to accomplish\/to become\/to turn into\/to be all right\/OK!\/one tenth"],"pinyin":["Cheng2","cheng2"],"word":"成"}],"containing_words":[],"sentences":[{"english":"Conditions for a war were engendering in that country.","chinese":"那個國家正在釀成戰爭的形勢。"},{"english":"Five straight days of rain caused flooding.","chinese":"連續五天的雨勢釀成了水患。"},{"english":"How are you an asset to a company's balance sheet?","chinese":"怎麼能把自己釀成企業決算表中的資產呢？"},{"english":"This danger independences is as a result of \"country\" cause.","chinese":"這類傷害惡果是由於有了“國家”釀成的。"},{"english":"Unemployment in Gyumri is reaching tragic levels and children suffer from its effects most of all.","chinese":"失業已經釀成悲劇，孩子們是這些影響的最大受害者。"},{"english":"This same thing, happening in wartime, would lead to a disaster.","chinese":"同樣白勺事，如發生在戰時，就會釀成大禍。"},{"english":"Even small mistakes can have devastating consequences.","chinese":"即使是小錯也可能釀成大禍。"},{"english":"Eventually led to a big mistake, and she seemed to win their hearts and a decision.","chinese":"最終釀成了大錯，她似乎決定收心了。"},{"english":"A catastrophe is brewing.","chinese":"一場災禍正在釀成。"},{"english":"The man who caused the mistake finficwisly conceded to the police that he hlisting done it.","chinese":"釀成這次交通事故的人最終向警察認可他是生事人。"},{"english":"But I fear the trajectory of political hotheadedness in the U.S. will come to tragedy.","chinese":"但我擔心在美國政治衝動將釀成慘劇。"},{"english":"Every inordinate cup is unblessed and the ingredient is a devil.","chinese":"每一杯過量的酒都是魔鬼釀成的毒汁。"},{"english":"Qing is a hardworking girl and very determined to turn her dream into reality.","chinese":"青是個很喫苦的女孩，一向執着於將胡想釀成實際。"},{"english":"An entire street is sells clothes, turned a clothing street.","chinese":"一整條街都是賣衣服的，釀成了服裝一條街。"},{"english":"N & S Korea have had plenty of skirmishes over the years that didn't lead to all-out war.","chinese":"南北朝鮮這些年一直摩擦不斷，從未釀成大戰。"},{"english":"Honey is secreted by the bees gather nectar plant juices precipitate.","chinese":"蜂蜜是由蜜蜂採集植物蜜腺分泌的汁液釀成。"}],"related":[]}