{"definition":["to release\/to make available\/to liberate\/disengagement"],"pinyin":["shi4 chu1"],"simplified":["释出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"釋出","characters":[{"definition":["to explain\/to release\/Buddha (abbr. for 釋迦牟尼|释迦牟尼[Shi4 jia1 mou2 ni2])\/Buddhism"],"pinyin":["shi4"],"word":"釋"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"We'll keep you posted on developments with this one as it nears its release date.","chinese":"我們將保留您的留言於開發上和接近釋出遊戲時。"},{"english":"And given the opportunity to dissipate potential energy, these channels will slowly spread.","chinese":"一旦有機會釋出位能，這些通道會緩慢擴張。"},{"english":"I saw one in Akihabara yesterday for twice the RRP .","chinese":"我看到一個在秋葉原昨天兩倍釋出。"},{"english":"Through pyrolysis , Hg and pyrolytic vapor will be reliefed from organic samples.","chinese":"生物樣品經高溫熱解，汞及大量熱解氣體一同釋出。"},{"english":"A reasonable request. For the next major release, we have to do something about this limitation.","chinese":"我們必須在下個大版本釋出時做點事情來解決此限制。"},{"english":"Release the medicine by pushing on the plunger.","chinese":"推手柄，釋出藥物。"},{"english":"This build 7264 has confirmed to be legitimate.","chinese":"版本7264已確定正式釋出，如下圖。"},{"english":"Soak disposable chopstick in hot water before use to release carbon dioxide.","chinese":"宜先用熱水浸泡，時間越久二氧化硫釋出越多。"},{"english":"Releases resources associated with this object.","chinese":"釋出與這個物件相關聯的資源。"},{"english":"Huge amount of carbon could be coming out of the world.","chinese":"世界上大量的碳都會釋出。"},{"english":"The sauna is supposed to emit radiation in the infrared part of the spectrum, which adjoins the microwave spectrum.","chinese":"這種機器應該會釋出光譜中臨近微波的紅外線。"},{"english":"The default theme has received some attention since last release and comes in light and dark versions.","chinese":"自從上一版本釋出後，默認的主題去年以來極受關注。"},{"english":"As coal burns, it releases traces of mercury that waft out of smokestacks .","chinese":"煤燃燒時所釋出微量的汞會飄出煙囪。"},{"english":"One-half of physicians were not satisfied with the policy pertaining to the approval of prescription refills.","chinese":"五成以上基層醫師表達對於慢箋釋出制度不滿意。"},{"english":"It binds phosphate far stronger than most other PAM and does not leach back out even after the full adsorption capacity is reached.","chinese":"當其容量的吸收已達到最高點時，也不會釋出還原。"},{"english":"C burning gasoline would evolve more energy than that of gasohol .","chinese":"燃燒汽油較酒精汽油釋出較大的能量。"}],"related":[{"definition":["public\/to publish\/to make public"],"pinyin":["gong1 kai1"],"word":"公開"},{"definition":["to sell"],"pinyin":["fa1 shou4"],"word":"發售"},{"definition":["to plan\/to lay out\/to design"],"pinyin":["qi3 hua4"],"word":"企劃"},{"definition":["to go on stage\/fig. to appear on the scene\/used in advertising to mean new product"],"pinyin":["deng1 chang3"],"word":"登場"},{"definition":["to rush (to do sth urgent)\/to try to be the first\/to forestall"],"pinyin":["qiang3 xian1"],"word":"搶先"},{"definition":["to draw\/to draft"],"pinyin":["hui4 zhi4"],"word":"繪製"},{"definition":["voice actor (loanword from Japanese 声優 seiyū)"],"pinyin":["sheng1 you1"],"word":"聲優"},{"definition":["to sell"],"pinyin":["fan4 shou4"],"word":"販售"},{"definition":["to reappear"],"pinyin":["chong2 xian4"],"word":"重現"},{"definition":["follow-up\/(dialect) to remarry"],"pinyin":["hou4 xu4"],"word":"後續"},{"definition":["information\/news\/message\/text message or SMS"],"pinyin":["xun4 xi1"],"word":"訊息"},{"definition":["animation\/cartoon"],"pinyin":["dong4 hua4"],"word":"動畫"},{"definition":["to include (in a collection)\/to put together (stories, poems etc)\/to record\/to employ\/to recruit"],"pinyin":["shou1 lu4"],"word":"收錄"},{"definition":["to release\/to issue\/to announce\/to distribute"],"pinyin":["fa1 bu4"],"word":"發布"},{"definition":["to lead to\/to trigger\/to initiate\/to cause\/to evoke (emotions)"],"pinyin":["yin3 fa1"],"word":"引發"},{"definition":["manufacturer\/producer"],"pinyin":["chang3 shang1"],"word":"廠商"}]}