{"definition":["to let go\/to loosen one's grip\/to put sth down"],"pinyin":["shi4 shou3"],"simplified":["释手"],"rank":60625.0,"normalized_rank":0.8482224056636772,"fraction":3.780820535724043e-8,"cumulative_fraction":0.9998396888299556,"word":"釋手","characters":[{"definition":["to explain\/to release\/Buddha (abbr. for 釋迦牟尼|释迦牟尼[Shi4 jia1 mou2 ni2])\/Buddhism"],"pinyin":["shi4"],"word":"釋"},{"definition":["hand\/(formal) to hold\/person engaged in certain types of work\/person skilled in certain types of work\/personal(ly)\/convenient\/classifier for skill\/CL:雙|双[shuang1],隻|只[zhi1]"],"pinyin":["shou3"],"word":"手"}],"containing_words":[{"definition":["to love sth too much to part with it (idiom); to fondle admiringly"],"pinyin":["ai4 bu4 shi4 shou3"],"word":"愛不釋手"}],"sentences":[{"english":"I could not tear myself away from the novel.","chinese":"這本小說讓我不忍釋手。"},{"english":"He was enthusing about his new radio.","chinese":"他對自己的新收音機愛不釋手。"},{"english":"He was enthusing about his new pocket cassette recorder.","chinese":"他對自己的新袖珍錄音機愛不釋手。"},{"english":"Read it, I know you will love it.","chinese":"捧讀它吧，我敢打賭你一定會愛不釋手。"},{"english":"There was so much to love about the new desktop.","chinese":"新的桌面有太多的東西讓人愛不釋手了。"},{"english":"The red rose is a cup of attractive good wine to the mature man.","chinese":"紅玫瑰對成熟的男人來講，是愛不釋手的酒。"},{"english":"However, the thing that your person often fondles admiringly is not beautiful certainly however.","chinese":"然而，令人往往愛不釋手的東西卻並不一定都是美的。"},{"english":"Parents love newborn, often holding to embrace to fondle admiringly.","chinese":"父母疼愛新生兒，往往抱來抱去，愛不釋手。"},{"english":"Thank you for the Milestone, it's really unputdownable to me.","chinese":"謝謝你送我里程碑，這一次我愛不釋手。"},{"english":"George is mad about his new saxophone.","chinese":"喬治對他的新薩克斯風愛不釋手。"},{"english":"This well-tailored fashionaBle dress in sophisticated coloring can certainly make you touch it admiringly .","chinese":"這件時裝精緻的色彩，典雅的裁剪定會使您愛不釋手。"},{"english":"People say (that)this book is a page-turner.","chinese":"人們說這本書讓人愛不釋手。"}],"related":[]}