{"definition":["Richmond (name)"],"pinyin":["Li3 shi4 man3"],"simplified":["里士满"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"里士滿","characters":[{"definition":["Li (surname)","li, ancient measure of length, approx. 500 m\/neighborhood\/ancient administrative unit of 25 families\/(Tw) borough, administrative unit between the township 鎮|镇[zhen4] and neighborhood 鄰|邻[lin2] levels"],"pinyin":["Li3","li3"],"word":"里"},{"definition":["member of the senior ministerial class (old)\/scholar (old)\/bachelor\/honorific\/soldier\/noncommissioned officer\/specialist worker","surname Shi"],"pinyin":["Shi4","shi4"],"word":"士"},{"definition":["Manchu ethnic group","to fill\/full\/filled\/packed\/fully\/completely\/quite\/to reach the limit\/to satisfy\/satisfied\/contented"],"pinyin":["Man3","man3"],"word":"滿"}],"containing_words":[],"sentences":[{"english":"Walk around Richmond, the American International University in London.","chinese":"里士滿倫敦美國國際大學校園行。"},{"english":"Hampton Court Palace in the London Borough of Richmond upon Thames. (Jason Hawkes)","chinese":"漢普敦皇宮，泰晤士河畔里士滿，倫敦。"},{"english":"He galloped over the winter - dried grass of Richmond Park .","chinese":"他在里士滿公園冬天凍枯了的草場上馳騁起來。"},{"english":"The author is Economist and Vice President of the Federal Reserve Bank of Richmond.","chinese":"作者是經濟學家，並擔任里士滿聯邦儲備銀行副主席。"},{"english":"Sands had been trading in Kidder Peabody 's Richmond office.","chinese":"桑茲過去在基德公司里士滿分公司交易。"},{"english":"Asland is a small town about eight kilometres from the city of Richmond.","chinese":"阿什蘭德是一個離里士滿市大約八公里的小鎮。"},{"english":"Then she returned to Point Richmond to check on the house.","chinese":"後來他們又回到里士滿點查看他們的房子。"},{"english":"I live on the other side in neighborhood called Outer Richmond,","chinese":"我住在相鄰的另一端，外里士滿區。"},{"english":"Liu Jie was born in Richmond City—the Capital of Virginia State.","chinese":"劉潔是出生於美國弗吉尼亞州首府里士滿市的華裔。"}],"related":[]}