{"definition":["Rio de Janeiro"],"pinyin":["Li3 yue1 re4 nei4 lu2"],"simplified":["里约热内卢"],"rank":25654.0,"normalized_rank":0.3589327438333357,"fraction":0.000001394816224665762,"cumulative_fraction":0.9852305844120428,"word":"里約熱內盧","characters":[{"definition":["Li (surname)","li, ancient measure of length, approx. 500 m\/neighborhood\/ancient administrative unit of 25 families\/(Tw) borough, administrative unit between the township 鎮|镇[zhen4] and neighborhood 鄰|邻[lin2] levels"],"pinyin":["Li3","li3"],"word":"里"},{"definition":["to make an appointment\/to invite\/approximately\/pact\/treaty\/to economize\/to restrict\/to reduce (a fraction)\/concise","to weigh in a balance or on a scale"],"pinyin":["yao1","yue1"],"word":"約"},{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"熱"},{"definition":["inside\/inner\/internal\/within\/interior"],"pinyin":["nei4"],"word":"內"},{"definition":["(old) rice vessel\/black\/old variant of 廬|庐[lu2]\/(slang) (Tw) troublesome\/fussy","surname Lu\/abbr. for Luxembourg 盧森堡|卢森堡[Lu2 sen1 bao3]"],"pinyin":["Lu2","lu2"],"word":"盧"}],"containing_words":[],"sentences":[{"english":"Ipanema Beach in Rio De Janeiro, Brazil, at night.","chinese":"巴西里約熱內盧的伊帕內瑪海灘的夜晚。"},{"english":"The slate in 2016, held in Rio de Janeiro, Brazil.","chinese":"2016年夏奧會在巴西的里約熱內盧舉行。"},{"english":"The technology is currently being trialled at a clinic in Rio de Janeiro.","chinese":"這項技術目前正在里約熱內盧的一個診所進行測試。"},{"english":"Towns situated in the hills near Rio de Janeiro were worst hit.","chinese":"位在里約熱內盧市附近的山丘城鎮，災情最爲慘重。"},{"english":"The only other blue macaw is in Rio de Janeiro.","chinese":"僅存的另一隻藍色金剛鸚鵡在里約熱內盧。"},{"english":"Ipanema Beach in Rio De Janeiro, Brazil, at night","chinese":"巴西里約熱內盧的伊帕內瑪海灘的夜晚。"},{"english":"Rio de Janeiro was the capital of Brazil.","chinese":"里約熱內盧是巴西的舊國。"},{"english":"The next edition will take place in July 2011 in Rio de Janeiro, Brazil.","chinese":"下一版將在2011年7月在里約熱內盧，巴西舉行。"},{"english":"The main attraction here is Rio's most recognisable symbol, Cristo Redentor (Christ the Redeemer). (Jesus Ochoa\/LPI)","chinese":"耶穌基督像是里約熱內盧最易識別的象徵。"},{"english":"Here, a favela in Rio de Janeiro is transformed by dozens of images.","chinese":"幾十幅圖像改變了里約熱內盧的貧民區形象。"},{"english":"Biodiversity was the buzzword of the Rio Earth Summit.","chinese":"宭生物多樣性是里約熱內盧地球峯會上的時髦詞兒。"},{"english":"Tiago, who was on vacation in Rio de Janiero, also refused to comment.","chinese":"蒂亞戈，誰是度假的里約熱內盧，也拒絕發表評論。"},{"english":"Brazilian children play in a Rio de Janeiro favela.","chinese":"里約熱內盧貧民窟裏孩童們在玩耍。"},{"english":"I went down to Brazil and spent two weeks with my family in Rio de Janeiro.","chinese":"我去了巴西里約熱內盧，跟我的家人在那呆了兩週。"},{"english":"Rio de Janeiro is a big natural harbour.","chinese":"里約熱內盧是一個天然大海港。"},{"english":"Samba drummers liven up the atmosphere on Ipanema Beach in Rio de Janeiro.","chinese":"鼓手使有生機的氣氛中在瑪海灘位於里約熱內盧。"}],"related":[]}