{"definition":["to replay string instrument\/fig. to harp on the same string\/to raise the same old topic again"],"pinyin":["chong2 tan2"],"simplified":["重弹"],"rank":51690.0,"normalized_rank":0.7232101632784408,"fraction":1.198476316536463e-7,"cumulative_fraction":0.99918237974988,"word":"重彈","characters":[{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["chong2","zhong4"],"word":"重"},{"definition":["crossball\/bullet\/shot\/shell\/ball","to pluck (a string)\/to play (a string instrument)\/to spring or leap\/to shoot (e.g. with a catapult)\/(of cotton) to fluff or tease\/to flick\/to flip\/to accuse\/to impeach\/elastic (of materials)"],"pinyin":["dan4","tan2"],"word":"彈"}],"containing_words":[{"definition":["to play the same old tune (idiom); unoriginal"],"pinyin":["lao3 diao4 chong2 tan2"],"word":"老調重彈"},{"definition":["replaying the same old tunes (idiom); conservative, unoriginal and discredited\/to keep harping on about the same old stuff"],"pinyin":["jiu4 diao4 chong2 tan2"],"word":"舊調重彈"}],"sentences":[{"english":"You've been getting the fourth, the fifth, and the sixth implementation of a good idea funded.","chinese":"而是第四手甚至更後的，一個新想法都被老調重彈了。"},{"english":"Now he's started on his hobbyhorse.","chinese":"現在他又開始老調重彈了。"},{"english":"That spokesman is striking up the same old tune.","chinese":"那個發言人又在老調重彈。"},{"english":"Was this just more of the same or something new?","chinese":"這究竟是老調重彈還是一種新情況呢？"},{"english":"Don't get him started on his hobbyhorse.","chinese":"不要讓他又開始他的老調重彈。"},{"english":"That's a string that's been harped on many times before.","chinese":"這是一種老調重彈。"},{"english":"A renewal of those worries isn't the only problem currently facing Huawei.","chinese":"華爲目前面對的問題不單隻這個老調重彈的擔憂。"},{"english":"We can do what we have been doing.","chinese":"我們也可以一如既往，舊調重彈。"},{"english":"So why are we at it again about shepherds and sheep?","chinese":"然而我們爲什麼還舊調重彈，一再提到牧人與羊羣呢？"},{"english":"The opposition ridiculed the government's proposals, saying they often have nothing new.","chinese":"反對派揶揄政府的建議，說成是老調重彈。"}],"related":[]}