{"definition":["to reset"],"pinyin":["chong2 she4"],"simplified":["重设"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"重設","characters":[{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["chong2","zhong4"],"word":"重"},{"definition":["to set up\/to arrange\/to establish\/to found\/to display"],"pinyin":["she4"],"word":"設"}],"containing_words":[],"sentences":[{"english":"An existing replicate can be redefined by remastering the replicate.","chinese":"通過重設主控可以重新定義現有的複製。"},{"english":"This is the best way to reset your sleep schedule.","chinese":"這是最好的重設你睡眠時間表的方法。"},{"english":"If it is too long, reset action will be very slow to take effect.","chinese":"如果設置過長，重設動作將會非常慢。"},{"english":"When resized, a metafile preserves an image better than a bitmap.","chinese":"重設大小時，中繼檔保存的影像優於點陣圖。"},{"english":"Resetting to factory defaults will restore remote Non-Volatile user settings.","chinese":"重設爲工廠默認值會恢復遠程非易失用戶設置。"},{"english":"Under my leadership, my department realigned the way we source and market projects.","chinese":"在我的領導下，我們重設了資源和市場計劃。"},{"english":"Overriding the default mapping registry with the new type mappings.","chinese":"用新的類型映射重設缺省的映射註冊表。"},{"english":"And huge waves of mortgage resets are due over the next two years.","chinese":"未來兩年還有鉅額的重設過的抵押貸款將到期。"},{"english":"I have to reset your converter boxes.","chinese":"我必須得重設你的轉換盒。"},{"english":"Remastering allows you to change what columns are in a replicate definition without interrupting the replication.","chinese":"重設主控允許改變複製定義中的列，而不用中止複製。"},{"english":"Each setting will be restored to its default value.","chinese":"每個設置指標將被重設到其初始數值。"},{"english":"An option to reset the password will display.","chinese":"將顯示重設密碼選項。"},{"english":"They slip out as Tuxhorn resets his alarm.","chinese":"在塔克斯宏重設報警器之前溜了出來。"},{"english":"Whether the image collection pane should be resizable or not.","chinese":"圖片集窗格是否可以重設大小。"},{"english":"Of course you don't have to reset your loss-limit after every single pot or even at all.","chinese":"當然，沒有必要再每一輪之後都重設損失上限。"},{"english":"Resize the icons, using that new slider in the status bar.","chinese":"用狀態欄的新滑塊重設圖標的大小。"}],"related":[{"definition":["my limited view (lit. view through a thin tube)\/my limited understanding\/my opinion (humble)"],"pinyin":["guan3 jian4"],"word":"管見"},{"definition":["to be in overall charge\/to oversee"],"pinyin":["zong1 li3"],"word":"綜理"},{"definition":["conclusion\/judgment\/verdict"],"pinyin":["duan4 yu3"],"word":"斷語"},{"definition":["to sit for imperial examinations"],"pinyin":["ying4 ju3"],"word":"應舉"},{"definition":["to run a newspaper\/to publish a newspaper"],"pinyin":["ban4 bao4"],"word":"辦報"},{"definition":["part-time work"],"pinyin":["ban4 zhi2"],"word":"半職"},{"definition":["security measures (esp. border security)\/official seal (esp. military seal during Qing and Ming times)"],"pinyin":["guan1 fang2"],"word":"關防"},{"definition":["lit. to scratch the outside of the boot (idiom)\/fig. beside the point\/ineffectual"],"pinyin":["ge2 xue1 sao1 yang3"],"word":"隔靴搔癢"},{"definition":["forged book\/book of dubious authenticity\/misattributed book\/Apocrypha"],"pinyin":["wei3 shu1"],"word":"偽書"},{"definition":["micro-\/microscopic\/to make the minute visible"],"pinyin":["xian3 wei1"],"word":"顯微"},{"definition":["to turn peril into safety (idiom); to avert a danger (esp. political or medical)"],"pinyin":["zhuan3 wei1 wei2 an1"],"word":"轉危為安"},{"definition":["video program"],"pinyin":["shi4 pin2 jie2 mu4"],"word":"視頻節目"},{"definition":["transition"],"pinyin":["guo4 du4 shi2 qi1"],"word":"過渡時期"},{"definition":["lit. to return the jade annulus to Zhao (idiom); fig. to return something intact to its rightful owner"],"pinyin":["wan2 bi4 gui1 Zhao4"],"word":"完璧歸趙"},{"definition":["to feel embarrassed\/to feel akward"],"pinyin":["fan4 nan2"],"word":"犯難"},{"definition":["loom"],"pinyin":["zhi1 ji1"],"word":"織機"}]}