{"definition":["to repeat\/to follow the same road as"],"pinyin":["chong2 dao3"],"simplified":["重蹈"],"rank":20901.0,"normalized_rank":0.2924321072293033,"fraction":0.0000021766723941382704,"cumulative_fraction":0.9768960391031098,"word":"重蹈","characters":[{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["chong2","zhong4"],"word":"重"},{"definition":["to tread on\/to trample\/to stamp\/to fulfill\/Taiwan pr. [dao4]"],"pinyin":["dao3"],"word":"蹈"}],"containing_words":[{"definition":["to follow the track of an overturned cart\/to repeat a disastrous policy"],"pinyin":["chong2 dao3 fu4 zhe2"],"word":"重蹈覆轍"}],"sentences":[{"english":"Note what works for competitors and avoid their pitfalls.","chinese":"注意汲取對手的成功並避免重蹈他們的覆輒。"},{"english":"In an effort not to repeat the same situation with their own children, they have few rules.","chinese":"爲了不使孩子重蹈覆轍，他們很少給孩子立規矩。"},{"english":"Otherwise, you are doomed to repeat it.","chinese":"否則，你就註定會重蹈覆轍。"},{"english":"I made a blunder, and I tell myself that I'll never make that mistake again.","chinese":"我犯了個大錯，我告訴自己絕不會再重蹈覆轍。"},{"english":"In this context, history could repeat itself in the Arab World.","chinese":"以此類推，阿拉伯世界有可能重蹈覆轍。"},{"english":"We made the mistake of romanticizing villages, and we don't need to make that mistake again.","chinese":"我們錯誤地把鄉村浪漫化，我們不要再重蹈覆轍。"},{"english":"Acknowledge your role in it so you can avoid repeating it.","chinese":"承認你對婚姻失敗負有責任，從而避免重蹈覆轍。"},{"english":"To reGREt one’s errors to the point of not repeating them is true repentance.","chinese":"反思自己的過錯以至於不重蹈覆轍纔是真正的悔悟。"},{"english":"The experience of graying Japan over the past couple of decades is one that Chinese leaders surely want to avoid.","chinese":"中國領導人肯定不願重蹈過去幾十年銀髮日本的教訓。"},{"english":"The General met Lincoln’s original fate, the electric chair.","chinese":"將軍重蹈林肯覆轍，坐上了死刑的電椅。"},{"english":"It should be clear to everyone that we will not repeat the mistakes of the past.","chinese":"大家應當清楚，我們不會重蹈覆轍。"},{"english":"I am the sister of a ten-year-old boy who is busy making them now.","chinese":"我是一個十歲男孩的姐姐，他正忙於重蹈我的覆轍。"},{"english":"Who can guarantee that we won’t repeat our previous mistakes?","chinese":"誰敢保證在這件事情上我們不會重蹈覆轍？"},{"english":"Old McDonald gave up smoking for a while, but soon returned to his old ways.","chinese":"老麥克唐納戒了一段時間煙，但不久又重蹈覆轍。"},{"english":"By learning about these pitfalls now, you will be able to avoid them in the future.","chinese":"現在學習到這些缺陷可以避免你在今後重蹈覆轍。"},{"english":"He who does not learn from history dooms to repeat it.","chinese":"不向歷史學習的人註定要重蹈覆轍。"}],"related":[{"definition":["disastrous policy"],"pinyin":["fu4 zhe2"],"word":"覆轍"},{"definition":["to follow the track of an overturned cart\/to repeat a disastrous policy"],"pinyin":["chong2 dao3 fu4 zhe2"],"word":"重蹈覆轍"},{"definition":["to learn a lesson from the mistakes of one's predecessor (idiom)"],"pinyin":["qian2 che1 zhi1 jian4"],"word":"前車之鑒"},{"definition":["lit. trailing dust\/fig. sb's footsteps\/course in life"],"pinyin":["hou4 chen2"],"word":"後塵"},{"definition":["to recur (of events, esp. adverse ones)\/to repeat (a performance)"],"pinyin":["chong2 yan3"],"word":"重演"},{"definition":["old road\/familiar way\/beaten track\/conventional behavior"],"pinyin":["lao3 lu4"],"word":"老路"},{"definition":["lit. to return in a swirl of dust (idiom)\/fig. to regroup and come back even stronger\/to make a comeback"],"pinyin":["juan3 tu3 chong2 lai2"],"word":"卷土重來"},{"definition":["wielding the halberd within the household (idiom); internecine strife"],"pinyin":["tong2 shi4 cao1 ge1"],"word":"同室操戈"},{"definition":["to think of the pain when the pain is gone (idiom)\/to ponder about a painful experience"],"pinyin":["tong4 ding4 si1 tong4"],"word":"痛定思痛"},{"definition":["to repeat a crime\/persistent offender"],"pinyin":["zai4 fan4"],"word":"再犯"},{"definition":["to draw a lesson (from a setback)"],"pinyin":["xi1 qu3 jiao4 xun5"],"word":"吸取教訓"},{"definition":["obstinately clinging to one's course (idiom)\/willful\/one's own way\/dogmatic"],"pinyin":["yi1 yi4 gu1 xing2"],"word":"一意孤行"},{"definition":["to reoccur"],"pinyin":["zai4 fa1 sheng1"],"word":"再發生"},{"definition":["to play with fire and get burnt (idiom); fig. to play with evil and suffer the consequences\/to get one's fingers burnt"],"pinyin":["wan2 huo3 zi4 fen2"],"word":"玩火自焚"},{"definition":["to advance prematurely"],"pinyin":["mao4 jin4"],"word":"冒進"},{"definition":["consigned to eternal damnation\/with no hope of reprieve"],"pinyin":["wan4 jie2 bu4 fu4"],"word":"萬劫不復"}]}