{"definition":["anew\/from the beginning\/(in poetry and song) repetition of a melody or rhythm","main\/most important\/essential"],"pinyin":["chong2 tou2","zhong4 tou2"],"simplified":["重头"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"重頭","characters":[{"definition":["heavy\/serious\/to attach importance to","to repeat\/repetition\/again\/re-\/classifier: layer"],"pinyin":["chong2","zhong4"],"word":"重"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"}],"containing_words":[{"definition":["opera (or role) involving much singing and action\/(fig.) highlight\/main feature\/major activity"],"pinyin":["zhong4 tou2 xi4"],"word":"重頭戲"}],"sentences":[{"english":"Using a gun is one of the students' specialities.","chinese":"用槍，是警官學校特殊的重頭戲之一。"},{"english":"The launch of the iPad was the highlight - another groundbreaking consumer Internet device that re-defined a market!","chinese":"iPad是蘋果的重頭戲，重新定義了一個市場。"},{"english":"And India plays a large role in this multi-country orchestration of development of new products.","chinese":"印度在這個新產品開發的多國交響樂中演奏重頭樂器。"},{"english":"They must be able to reproduce a build from bare iron at will.","chinese":"他們必須能夠隨意地重頭開始再造一個構建。"},{"english":"I can't make an entire life disappear to start a new one.","chinese":"我不能讓生命就此消逝無蹤，重頭再來。"},{"english":"I cant make an entier life disappear to start a new one.","chinese":"我不能讓生命就此消失無蹤，重頭再來。"},{"english":"I can't make an entier life disappear to start a new one.","chinese":"我不能讓生命就此消逝無蹤，重頭再來。"},{"english":"Our main attraction tonight is lady mud wrestling.","chinese":"我們今晚的重頭戲是女子泥漿摔跤。"},{"english":"Instead of having yourself as a solid wall to lean onto during this time, you’ll be feeling that you need to start all over again.","chinese":"這段時間你不再堅強，而是感到需要重頭來過。"},{"english":"School performance, expenditures, and income were given the most weight.","chinese":"學校的品質表現，消費以及收入佔了評分標準的重頭。"},{"english":"They have decided to make a fresh start in a different town.","chinese":"他們已決定在另一個市鎮重頭幹起。"},{"english":"EVERYONE knows that the CCTV Spring Festival Gala has long dominated Chinese New Year`s Eve.","chinese":"衆所周知，央視春晚是每年除夕夜的重頭節目。"},{"english":"For some guys, the annual fishing trip is the highlight of their calendar.","chinese":"有些人把每年的釣魚之旅視爲是行事曆上的重頭戲。"},{"english":"Given the current situation, you back home.","chinese":"基於目前的情形，你要重頭來過。"},{"english":"One to live to make mistakes and then one to come back and do it again.","chinese":"第一次可以犯錯，然後再重頭來過。"},{"english":"We want to finish as quickly as possible and start again.","chinese":"我們想盡可能快地結束這一切，然後再重頭來過。"}],"related":[{"definition":["fashionable for a while (idiom); all the rage"],"pinyin":["feng1 mi3 yi1 shi2"],"word":"風靡一時"},{"definition":["to suffer untold hardships (idiom); trials and tribulations\/with difficulty\/after some effort"],"pinyin":["qian1 xin1 wan4 ku3"],"word":"千辛萬苦"},{"definition":["tone sandhi\/modified tone\/(music) to change key\/modulation"],"pinyin":["bian4 diao4"],"word":"變調"},{"definition":["long and tedious\/redundant\/superfluous\/supernumerary\/verbose (of writing)"],"pinyin":["rong3 chang2"],"word":"冗長"},{"definition":["to win instant success (idiom)\/to become an instant hit"],"pinyin":["yi1 pao4 er2 hong2"],"word":"一炮而紅"},{"definition":["to abridge (a text)\/to edit out (of a movie)\/to cut back (a budget, a curriculum)"],"pinyin":["shan1 jian3"],"word":"刪減"},{"definition":["As You Like It, comedy by Shakespeare","to everyone's delight and satisfaction"],"pinyin":["Jie1 da4 huan1 xi3","jie1 da4 huan1 xi3"],"word":"皆大歡喜"},{"definition":["interlude\/to cross the stage\/to do sth as a mere formality\/to go through the motions"],"pinyin":["guo4 chang3"],"word":"過場"},{"definition":["radio drama"],"pinyin":["guang3 bo1 ju4"],"word":"廣播劇"},{"definition":["monodrama\/one-man show\/comic talk"],"pinyin":["du2 jiao3 xi4"],"word":"獨角戲"},{"definition":["lit. an easy drive on a familiar path (idiom); fig. experience makes progress easy\/a task that is so familiar one can do it with one's hand tied behind one's back"],"pinyin":["jia4 qing1 jiu4 shu2"],"word":"駕輕就熟"},{"definition":["contemporary drama"],"pinyin":["shi2 zhuang1 ju4"],"word":"時裝劇"},{"definition":["serialized drama\/dramatic series\/show in parts"],"pinyin":["lian2 xu4 ju4"],"word":"連續劇"},{"definition":["Genesis (first book of the Bible)","creation myth"],"pinyin":["Chuang4 shi4 ji4","chuang4 shi4 ji4"],"word":"創世紀"},{"definition":["large-scale Chinese opera\/Beijing opera\/major dramatic production (movie, TV series etc)"],"pinyin":["da4 xi4"],"word":"大戲"},{"definition":["to take a curtain call\/(fig.) to come to an end"],"pinyin":["xie4 mu4"],"word":"謝幕"}]}