{"definition":["to take sb's temperature"],"pinyin":["liang2 ti3 wen1"],"simplified":["量体温"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"量體溫","characters":[{"definition":["capacity\/quantity\/amount\/to estimate\/abbr. for 量詞|量词[liang4 ci2], classifier (in Chinese grammar)\/measure word","to measure"],"pinyin":["liang2","liang4"],"word":"量"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"},{"definition":["surname Wen","warm\/lukewarm\/temperature\/to warm up\/mild\/soft\/tender\/to review (a lesson etc)\/fever (TCM)\/old variant of 瘟[wen1]"],"pinyin":["Wen1","wen1"],"word":"溫"}],"containing_words":[],"sentences":[{"english":"Temperature taking is intrusive and will upset the child.","chinese":"測量體溫是對小兒煩擾，會使小兒不安。"},{"english":"Continue to hold the thermometer in place while taking his temperature.","chinese":"量體溫的過程中要一直拿住體溫計。"},{"english":"Open your mouth, dear. We're going to take your temperature.","chinese":"張開嘴，親愛的，我幫你量一量體溫。"},{"english":"Let me feel her pulse, and take her temperature.","chinese":"我來給她把脈和量體溫。"},{"english":"A thermometer is defined as an apparatus which measures the temperature of the body.","chinese":"體溫講可以定義爲一種測量體溫的儀器。"},{"english":"What Japan is doing is they are making everyone take a temperature when they get off the airplane, \" she said.","chinese":"日本的做法是，他們讓所有下飛機的乘客量體溫。"},{"english":"That's how my mom took my temperature when I was a child.","chinese":"而老媽在我小時候就是這樣幫我量體溫。"},{"english":"Let me have your temperature, put this thermometer under your armpit.","chinese":"我給你量體溫，把溫度計放到腋窩下。"},{"english":"Let me take your temperature. Would you put the thermometer under your arm. Please?","chinese":"我來給你量量體溫，請把體溫表放在腋下。"},{"english":"I didn't take my temperature, but I felt feverish.","chinese":"我沒有量體溫，但我感覺有點發燒。"},{"english":"Take your child's temperature with easy with this 1-Second Ear Thermometer.","chinese":"一秒耳溫計可簡單快速幫助寶寶測量體溫。"},{"english":"She took the patient's temperature.","chinese":"她替病人量體溫。"},{"english":"Let me take your temperature. Would you put the thermometer under your arm.","chinese":"我來給你量量體溫，請把體溫表放在腋下。"},{"english":"Advise staff to measure body temperature before coming to work.","chinese":"建議員工在上班前先測量體溫。"},{"english":"Let me put this into your mouth and take your temperature.","chinese":"我把這放到你嘴裏，給你量量體溫。"},{"english":"Here introduces how to design infrared ear thermometer.","chinese":"很多情況下，需要用紅外耳溫計迅速測量體溫。"}],"related":[]}