{"definition":["lit. measure the body then tailor the suit (idiom); fig. to act according to actual circumstances\/To live within one's means."],"pinyin":["liang2 ti3 cai2 yi1"],"simplified":["量体裁衣"],"rank":35322.0,"normalized_rank":0.4942006072223077,"fraction":5.887277691341726e-7,"cumulative_fraction":0.9942407725691428,"word":"量體裁衣","characters":[{"definition":["capacity\/quantity\/amount\/to estimate\/abbr. for 量詞|量词[liang4 ci2], classifier (in Chinese grammar)\/measure word","to measure"],"pinyin":["liang2","liang4"],"word":"量"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"},{"definition":["to cut out (as a dress)\/to cut\/to trim\/to reduce\/to diminish\/to cut back (e.g. on staff)\/decision\/judgment"],"pinyin":["cai2"],"word":"裁"},{"definition":["clothes\/CL:件[jian4]\/Kangxi radical 145","to dress\/to wear\/to put on (clothes)"],"pinyin":["yi1","yi4"],"word":"衣"}],"containing_words":[{"definition":["eat depending on the dish, cut cloth according to the body (idiom); to fit the appetite to the dishes and the dress to the figure\/to act according to actual circumstances\/to live within one's means"],"pinyin":["kan1 cai4 chi1 fan4 , liang2 ti3 cai2 yi1"],"word":"看菜吃飯，量體裁衣"}],"sentences":[{"english":"Tailor each letter to the open position, identifying your accomplishments and achievements.","chinese":"對每一個崗位量體裁衣，寫明你的成績和成就。"},{"english":"Independently design and tailor for different customers based on individual needs.","chinese":"依據個性化需求爲不同的客戶獨立設計量體裁衣。"},{"english":"Time is a dressmaker, specializing in altreations.","chinese":"時間是一個裁縫，擅長於量體裁衣。"},{"english":"The invention copies the real model, and makes the shoe-pads meet the usage demands with maximum limit.","chinese":"本發明量體裁衣，最大限度地使鞋墊適合使用需要。"},{"english":"Customize individualized door like a tailor, long production period.","chinese":"定製木門就像是裁縫量體裁衣一樣，週期長產量小。"}],"related":[]}