{"definition":["Taurus (constellation and sign of the zodiac)"],"pinyin":["Jin1 niu2 zuo4"],"simplified":["金牛座"],"rank":18453.0,"normalized_rank":0.2581814111622571,"fraction":0.0000028068578093012315,"cumulative_fraction":0.9708233239886772,"word":"金牛座","characters":[{"definition":["gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)"],"pinyin":["Jin1","jin1"],"word":"金"},{"definition":["ox\/cow\/bull\/CL:條|条[tiao2],頭|头[tou2]\/newton (abbr. for 牛頓|牛顿[niu2 dun4])\/(slang) awesome","surname Niu"],"pinyin":["Niu2","niu2"],"word":"牛"},{"definition":["seat\/base\/stand\/CL:個|个[ge4]\/classifier for buildings, mountains and similar immovable objects"],"pinyin":["zuo4"],"word":"座"}],"containing_words":[],"sentences":[{"english":"The Ecraft workh element of Taurus can leadvertisement to strength mainly because well mainly because desire for solid ground form and structure.","chinese":"土相星座的特質讓金牛座祈望並具有腳踏實地的能力。"},{"english":"The Earth element of Taurus brings strength and the desire for solid ground form. and structure.","chinese":"土相星座的特質讓金牛座渴望並具有腳踏實地的能力。"},{"english":"His theories might be the best display of Taur; being obsessive and realistic.","chinese":"這也可能正是體現出金牛座的偏執與理性吧。"},{"english":"The Pleiades marks the shoulder of the Bull in the constellation Taurus.","chinese":"昴宿星標誌着金牛座的金牛的肩部。"},{"english":"Taurus is the second sign of the zodiac, representing growth and development.","chinese":"金牛座是十二宮的第二個星座，代表成長。"},{"english":"Lucky Jupiter plants itself in compatible Earth sign Taurus for an entire year.","chinese":"幸運的木星位於土象的金牛座並持續一整年。"},{"english":"The Earth element of Taurus produces strength and the desire for solid ground form and structure.","chinese":"土相星座的特質讓金牛座抱負並具有踏結結實的能力。"},{"english":"So is Leo and Taurus compatibility, the best?","chinese":"因此，獅子座和金牛座最配嗎？"},{"english":"Taurus rules your ninth house, which is naturally one of the luckiest areas of your sign's chart.","chinese":"金牛座掌管你的第九宮，即星盤上最自然而然的幸運。"},{"english":"Cancer, linked with Taurus.","chinese":"巨蟹，跟金牛座有干連。"},{"english":"I think our Taurean celebrities also exhibit this trust.","chinese":"相信金牛座的明星們會給我們帶來更多的驚喜。"},{"english":"The Earth element of Taurus brings strength and his awesome desire for solid ground form and structure.","chinese":"土相星座的特質讓金牛座慾望並具有踏踏實實的能力。"},{"english":"You should be more careful around Tauruses.","chinese":"你對金牛座的人應該更小心。"},{"english":"This Sun in Taurus Full Moon is called Wesak (WE-sock).","chinese":"這時太陽在金牛座，滿月時分就稱爲衛塞節。"},{"english":"The Egoodh element of Taurus can raise strength properly desire for solid ground form and structure.","chinese":"土相星座的特質讓金牛座願望並具有實事求是的能力。"},{"english":"She is a typical Taurus\/Taurean\/has a typical Taurean personality.","chinese":"她有典型的金牛座性格。"}],"related":[{"definition":["Capricornus"],"pinyin":["Mo2 jie2 zuo4"],"word":"摩羯座"},{"definition":["Cancer (constellation and sign of the zodiac)"],"pinyin":["Ju4 xie4 zuo4"],"word":"巨蟹座"},{"definition":["Libra (constellation and sign of the zodiac)"],"pinyin":["Tian1 cheng4 zuo4"],"word":"天秤座"},{"definition":["Scorpio or Scorpius (constellation and sign of the zodiac)"],"pinyin":["Tian1 xie1 zuo4"],"word":"天蠍座"},{"definition":["Leo (constellation and sign of the zodiac)"],"pinyin":["Shi1 zi5 zuo4"],"word":"獅子座"},{"definition":["Aries (constellation and sign of the zodiac)"],"pinyin":["Bai2 yang2 zuo4"],"word":"白羊座"},{"definition":["Aquarius (constellation and sign of the zodiac)"],"pinyin":["Shui3 ping2 zuo4"],"word":"水瓶座"},{"definition":["Sagittarius (constellation and sign of the zodiac)\/popular variant of 人馬座|人马座[Ren2 ma3 zuo4]"],"pinyin":["She4 shou3 zuo4"],"word":"射手座"},{"definition":["Gemini (constellation and sign of the zodiac)"],"pinyin":["Shuang1 zi3 zuo4"],"word":"雙子座"},{"definition":["Pisces (constellation and sign of the zodiac)"],"pinyin":["Shuang1 yu2 zuo4"],"word":"雙魚座"},{"definition":["Virgo (constellation and sign of the zodiac)\/popular variant of 室女座[Shi4 nu:3 zuo4]"],"pinyin":["Chu3 nu:3 zuo4"],"word":"處女座"},{"definition":["Capricorn (constellation and sign of the zodiac)"],"pinyin":["Mo2 jie2 zuo4"],"word":"魔羯座"},{"definition":["constellation\/astrological sign\/CL:張|张[zhang1]"],"pinyin":["xing1 zuo4"],"word":"星座"},{"definition":["Capricorn (star sign)\/northern people in classical times, a branch of the Huns or Xiongnu 匈奴"],"pinyin":["Mo2 jie2"],"word":"摩羯"},{"definition":["Taurus (star sign)\/Jinniu district of Chengdu city 成都市[Cheng2 du1 shi4], Sichuan"],"pinyin":["Jin1 niu2"],"word":"金牛"},{"definition":["Scorpio (constellation)"],"pinyin":["tian1 xie1"],"word":"天蠍"}]}