{"definition":["to clinch (a nail)\/to nail down"],"pinyin":["ding1 lao2"],"simplified":["钉牢"],"rank":62099.0,"normalized_rank":0.8688455780504526,"fraction":2.9341502999248367e-8,"cumulative_fraction":0.9998889253317697,"word":"釘牢","characters":[{"definition":["nail\/to follow closely\/to keep at sb (to do sth)\/variant of 盯[ding1]","to join things together by fixing them in place at one or more points\/to nail\/to pin\/to staple\/to sew on"],"pinyin":["ding1","ding4"],"word":"釘"},{"definition":["firm\/sturdy\/fold (for animals)\/sacrifice\/prison"],"pinyin":["lao2"],"word":"牢"}],"containing_words":[],"sentences":[{"english":"When you've fastened the boards, tie the strings off so that they don't slip.","chinese":"木板釘牢後，把繩子打結繫緊，免得鬆脫。"},{"english":"You will have to fasten the lid down with nails .","chinese":"你必須用釘子把蓋子釘牢。"},{"english":"Use the battens of two by one inches and steel nails for nailing to the wall.","chinese":"由一個使用條板二移動和釘牢的鋼釘子對牆壁。"},{"english":"A conductive spike is created thus causing a dead short.","chinese":"一導電用大釘釘牢如此創造引起死者。"},{"english":"Will you nail down that loose board in the floor?","chinese":"請你把那塊鬆動的地板釘牢好嗎？"},{"english":"The carpenter kept pounding at the nail until he drove it home.","chinese":"那根釘子，直到把它釘牢爲止。"},{"english":"I nail the carpet down to ground.","chinese":"我把地毯釘牢在地上。"},{"english":"The deck chairs have been put up for the winter.","chinese":"鴻漸和辛楣並坐在釘牢甲板上的長椅子上。"},{"english":"These nails are too small to hold the box together.","chinese":"這些釘子太小了，不能把箱子釘牢。"},{"english":"Hung-chien and Hsin-mei sat in the lounge chairs, which were nailed to the deck.","chinese":"鴻漸和辛楣並坐在釘牢甲板上的長椅子上。"},{"english":"The roof was never securely battened down.","chinese":"屋頂板條一直沒釘牢。"},{"english":"The girder was clinched into the wall.","chinese":"大梁被釘牢在牆中。"},{"english":"He stayed at home and nailed up the mail slot.","chinese":"他在家準備把那個郵箱釘牢了。"},{"english":"The worker battened down the loose windows.","chinese":"工人用板條釘牢鬆脫的窗戶。"},{"english":"Will you nail down that loose board in the floor ?","chinese":"請你把那塊鬆動的地板釘牢好嗎？"},{"english":"He was busy battening down all the shutters and doors.","chinese":"他正忙着用板條釘牢所有的百葉窗和門。"}],"related":[]}