{"definition":["conifer"],"pinyin":["zhen1 ye4 shu4"],"simplified":["针叶树"],"rank":60531.0,"normalized_rank":0.8469072237068543,"fraction":3.824613823782623e-8,"cumulative_fraction":0.9998361177792696,"word":"針葉樹","characters":[{"definition":["needle\/pin\/injection\/stitch\/CL:根[gen1],支[zhi1]"],"pinyin":["zhen1"],"word":"針"},{"definition":["leaf\/page\/lobe\/(historical) period\/classifier for small boats","surname Ye"],"pinyin":["Ye4","ye4"],"word":"葉"},{"definition":["tree\/CL:棵[ke1]\/to cultivate\/to set up"],"pinyin":["shu4"],"word":"樹"}],"containing_words":[],"sentences":[{"english":"A variety of conifers and hardwoods makes up the bulk of the vegetation .","chinese":"大部分植被由各種針葉樹類和闊葉樹類構成。"},{"english":"In some conifers adventitious roots can form the largest part of the root system.","chinese":"在一些針葉樹不定根形成的根系統的最大部分。"},{"english":"As a rule, in the Northwest, these hosts are various kinds of conifer trees.","chinese":"作爲一項規則，西北，這些主機是針葉樹各種樹木。"},{"english":"Bees produce a compound called propolis from the sap on needle-leaved trees or evergreens.","chinese":"蜜蜂利用針葉樹或常綠植物的汁液製造蜂膠化合物。"},{"english":"The trouble is, other conifer eates didn't exhibit the same cancer.","chinese":"但問題是，其它喫針葉樹的恐龍並沒有患同樣的癌症。"},{"english":"Coniferous chemical wood pulp, sulphite other than dissolving grades, unbleached.","chinese":"針葉樹亞硫酸鹽化學木漿，溶解級除外，未漂白。"},{"english":"The results indicated that the average water consumption rate of broadleaf trees was more than conifer trees.","chinese":"結果表明，針葉樹種耗水速率低於闊葉樹種。"},{"english":"In conifer orchards new stumps should be removed.","chinese":"在針葉樹的種子園，新的伐樁應予除掉。"},{"english":"Conifer forests cover the eastern versant.","chinese":"東部山區被針葉樹林覆蓋。"},{"english":"The Baikushev's Pine is a coniferous tree from the species Bosnian Pine situated in Pirin, Bulgaria.","chinese":"百庫西樹是針葉樹源於保加利亞波斯尼亞松物種。"},{"english":"Theoretic analysis for elastic modulus of softwood was carried out in this paper.","chinese":"本文是關於針葉樹木材彈性特性研究的理論分析。"},{"english":"Cupressus of north temperate regions having dark scalelike leaves and rounded cones.","chinese":"北方溫帶柏科常綠針葉樹，深色鱗狀樹葉，圓形球果。"},{"english":"On that piece of land I would also recommend conifers or maybe cedars.","chinese":"那塊地嘛，我還建議你種引起針葉樹，或許是雪松。"},{"english":"Non-coniferous chemical wood pulp, sulphite, other than dissolving grades, unbleached.","chinese":"非針葉樹亞硫酸鹽化學木漿，溶解級除外，未漂白。"},{"english":"The evergreens traditionally brought indoors were decorated with apples, symbolizing the Garden of Eden.","chinese":"傳統上帶入室內的針葉樹用蘋果裝飾，象徵着伊甸園。"},{"english":"It has been known that the self-sterility of conifers results from embryo collapse after self-fertilization.","chinese":"業已知道，針葉樹自花不育是由於自花受精後胚凋萎。"}],"related":[]}