{"definition":["Yinchuan city, capital of Ningxia Hui Autonomous Region 寧夏回族自治區|宁夏回族自治区"],"pinyin":["Yin2 chuan1"],"simplified":["银川"],"rank":11822.0,"normalized_rank":0.1654051180165937,"fraction":0.0000062631700805112,"cumulative_fraction":0.9428196888602391,"word":"銀川","characters":[{"definition":["silver\/silver-colored\/relating to money or currency"],"pinyin":["yin2"],"word":"銀"},{"definition":["abbr. for Sichuan Province 四川[Si4 chuan1] in southwest China","river\/creek\/plain\/an area of level country"],"pinyin":["Chuan1","chuan1"],"word":"川"}],"containing_words":[{"definition":["Yinchuan city, capital of Ningxia Hui Autonomous Region 寧夏回族自治區|宁夏回族自治区[Ning2 xia4 Hui2 zu2 Zi4 zhi4 qu1]"],"pinyin":["Yin2 chuan1 Shi4"],"word":"銀川市"}],"sentences":[{"english":"After eating breakfast, you will visit the Western Xia Tombs on the way back to Yinchuan.","chinese":"早餐後，回銀川路上，參觀西夏陵墓。"},{"english":"Yin Chuan City arrives at Xi'an passenger ticket number money , this several day.","chinese":"銀川市到西安的機票多少錢，這幾天的。"},{"english":"Yinchuan has a desert climate.","chinese":"銀川地處沙漠氣候。"},{"english":"The type of air pollution in Yinchuan is coal-burning pattern.","chinese":"銀川市空氣污染類型爲煤煙型污染。"},{"english":"Objective:To investigate health state and community nursing demands of empty nest elderly in Yinchuan city.","chinese":"調查銀川市空巢老人的健康狀況及社區護理需求。"},{"english":"I want to know if there is a non-stop flight from Xiamen to Yinchuan this Monday.","chinese":"我想知道本週一有沒有從廈門直飛銀川的航班？"},{"english":"But I dont think Kunming and Yinchuan are second-tier cities.","chinese":"但是我不認爲昆明和銀川是二線城市。"},{"english":"Where world medium-size bus passenger car 145 speed change boxes Yinchuan has sell?","chinese":"宇通中巴客車145變速箱銀川哪裏有賣的？"},{"english":"Objective To understand the security capacity of medical insurance on Yinchuan s retirees.","chinese":"目的瞭解銀川市退休職工基本醫療保障程度。"},{"english":"Sha river lies in the county in Ningxia, capital of Yinchuan City from 47 km.","chinese":"沙湖位於寧夏平羅縣境內，距首府銀川市47公里。"},{"english":"A electroacoustic band made of prisoners are rehearsing on playground.","chinese":"寧夏銀川監獄操場上，由囚犯組建的電聲樂隊在排練。"},{"english":"So I decided to take him to see, can not be in vain Yinchuan trip.","chinese":"所以我還是決定帶他去看看吧，也不能白來銀川一趟。"},{"english":"After the tombs, you will see the cliff carvings at Helan Mountain and then be brought to Yinchuan.","chinese":"之後，觀賞賀蘭山上的峭壁雕刻，之後回銀川。"},{"english":"Ningxia Hui Autonomous Region is briefly named Ning, with Yinchuan as its provincial seat.","chinese":"寧夏回族自治區，簡稱寧，首府是銀川。"},{"english":"Objective To probe into the effects of family environment factors on problem conduct of children in Yinchuan City.","chinese":"目的瞭解銀川市家庭環境對兒童行爲問題發生的影響。"},{"english":"The next station is Yinchuan. Please exit the Feiji to the right. To transfer, please take the stairs in the middle of the platform.","chinese":"銀川，請從飛機前進方向嘅右門落車，中部樓梯換乘。"}],"related":[{"definition":["Ürümqi or Urumqi prefecture level city and capital of Xinjiang Uighur autonomous region 新疆維吾爾自治區|新疆维吾尔自治区 in west China"],"pinyin":["Wu1 lu3 mu4 qi2"],"word":"烏魯木齊"},{"definition":["Guiyang prefecture-level city and capital of Guizhou province 貴州|贵州[Gui4 zhou1], short name 筑[Zhu4]"],"pinyin":["Gui4 yang2"],"word":"貴陽"},{"definition":["Nanning prefecture level city and capital of Guangxi Zhuang autonomous region in south China 廣西壯族自治區|广西壮族自治区"],"pinyin":["Nan2 ning2"],"word":"南寧"},{"definition":["Shenyang subprovincial city and capital of Liaoning province 遼寧省|辽宁省 in northeast China\/old names include Fengtian 奉天, Shengjing 盛京 and Mukden"],"pinyin":["Shen3 yang2"],"word":"瀋陽"},{"definition":["Zhengzhou prefecture level city and capital of Henan Province in central China"],"pinyin":["Zheng4 zhou1"],"word":"鄭州"},{"definition":["Ulaanbaatar or Ulan Bator, capital of Mongolia"],"pinyin":["Wu1 lan2 ba1 tuo1"],"word":"烏蘭巴托"},{"definition":["Harbin, subprovincial city and capital of Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1] in northeast China"],"pinyin":["Ha1 er3 bin1"],"word":"哈爾濱"},{"definition":["Lanzhou prefecture-level city and capital of Gansu province 甘肅|甘肃[Gan1 su4]"],"pinyin":["Lan2 zhou1"],"word":"蘭州"},{"definition":["inland\/interior"],"pinyin":["nei4 lu4"],"word":"內陸"},{"definition":["Jiayu Pass in Gansu, at the western terminus of the Great Wall\/Jiayuguan prefecture-level city in Gansu"],"pinyin":["Jia1 yu4 guan1"],"word":"嘉峪關"},{"definition":["Chongqing city (Chungking), formerly in Sichuan province, a municipality since 1997, short name 渝[Yu2]"],"pinyin":["Chong2 qing4"],"word":"重慶"},{"definition":["Lijiang prefecture-level city in northwest Yunnan"],"pinyin":["Li4 jiang1"],"word":"麗江"},{"definition":["Xining prefecture level city and capital of Qinghai province 青海省[Qing1 hai3 sheng3] in west China"],"pinyin":["Xi1 ning2"],"word":"西寧"},{"definition":["Xiamen or Amoy, subprovincial city in Fujian, abbr. 廈|厦[Xia4]"],"pinyin":["Xia4 men2"],"word":"廈門"},{"definition":["provincial capital"],"pinyin":["sheng3 hui4"],"word":"省會"},{"definition":["Binhai (place name)\/Binhai New District, subprovincial district of Tianjin\/Binhai county in Yancheng 鹽城|盐城[Yan2 cheng2], Jiangsu\/fictitious city Binhai in political satire\/Primorsky, a territory in the far east of Russia","coastal\/bordering the sea"],"pinyin":["Bin1 hai3","bin1 hai3"],"word":"濱海"}]}