{"definition":["China Banking Regulatory Commission (CBRC), abbr. for 中國銀行業監督管理委員會|中国银行业监督管理委员会[Zhong1 guo2 Yin2 hang2 ye4 Jian1 du1 Guan3 li3 Wei3 yuan2 hui4]"],"pinyin":["Yin2 Jian1 hui4"],"simplified":["银监会"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"銀監會","characters":[{"definition":["silver\/silver-colored\/relating to money or currency"],"pinyin":["yin2"],"word":"銀"},{"definition":["supervisor","to supervise\/to inspect\/jail\/prison"],"pinyin":["jian1","jian4"],"word":"監"},{"definition":["can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])","to balance an account\/accountancy\/accounting"],"pinyin":["hui4","kuai4"],"word":"會"}],"containing_words":[],"sentences":[{"english":"CBRC shall, on the same day as issuing the approval certificate, submit to the Ministry of Commerce the approval certificate stub.","chinese":"銀監會在代發當日將批准證書存根送商務部。"},{"english":"To administer and guide the operations of overseas resident offices of the Commission.","chinese":"管理和指導銀監會駐外機構的業務工作。"},{"english":"To be responsible for the foreign-related protocol arrangement and administration, and reception for foreign guests.","chinese":"負責銀監會涉外禮賓安排和管理，接待外賓來訪。"},{"english":"The specific conditions for establishment of a branch shall be formulated by the CBRC separately.","chinese":"設立分支機構的具體條件由銀監會另行制定。"},{"english":"To compile and administer the budgets for foreign affairs expenses of the Commission departments.","chinese":"負責銀監會機關外事經費預算的編制及管理。"},{"english":"The China Banking Regulatory Commission recently accelerated research and investigation on affordable housing construction.","chinese":"銀監會最近加緊了對保障住房建設的研究和調查。"},{"english":"To enact norms for foreign affairs and administration rules for foreign affairs activities of the Commission institutions.","chinese":"負責制定銀監會系統外事規範和外事活動管理規定。"},{"english":"To be responsible for the internal audit of the Commission institutions.","chinese":"負責銀監會系統的內審工作。"},{"english":"The China Banking Regulatory Commission has told banks to write off non-performing project loans by the end of this year, the person said.","chinese":"中國銀監會已經通知銀行在年底註銷不良的項目貸款。"},{"english":"After examined and verified by the banking regulatory bureau, the application for extension shall be submitted to CBRC for verification and approval.","chinese":"延期申請經銀監局審覈同意後報銀監會覈准。"}],"related":[{"definition":["China Insurance Regulatory Commission (CIRC), abbr. for 中國保險監督管理委員會|中国保险监督管理委员会[Zhong1 guo2 Bao3 xian3 Jian1 du1 Guan3 li3 Wei3 yuan2 hui4]"],"pinyin":["Bao3 Jian1 hui4"],"word":"保監會"},{"definition":["abbr. for 國家發展和改革委員會|国家发展和改革委员会, PRC National Development and Reform Commission (NDRC), formed in 2003"],"pinyin":["Fa1 gai3 wei3"],"word":"發改委"},{"definition":["Department of Trade\/Department of Commerce"],"pinyin":["Shang1 wu4 bu4"],"word":"商務部"},{"definition":["People's Bank of China"],"pinyin":["Ren2 min2 Yin2 hang2"],"word":"人民銀行"},{"definition":["Ministry of Finance"],"pinyin":["Cai2 zheng4 bu4"],"word":"財政部"},{"definition":["China Securities Regulatory Commission (CSRC)\/abbr. for 中國證券監督管理委員會|中国证券监督管理委员会"],"pinyin":["Zhong1 guo2 Zheng4 jian4 hui4"],"word":"中國證監會"},{"definition":["balance of payments"],"pinyin":["guo2 ji4 shou1 zhi1"],"word":"國際收支"},{"definition":["State Administration of Foreign Exchange (SAFE)"],"pinyin":["Guo2 jia1 Wai4 hui4 Guan3 li3 ju2"],"word":"國家外匯管理局"},{"definition":["see 國務院國有資產監督管理委員會|国务院国有资产监督管理委员会[Guo2 wu4 yuan4 Guo2 you3 Zi1 chan3 Jian1 du1 Guan3 li3 Wei3 yuan2 hui4]"],"pinyin":["Guo2 Zi1 Wei3"],"word":"國資委"},{"definition":["working report\/operating report"],"pinyin":["gong1 zuo4 bao4 gao4"],"word":"工作報告"},{"definition":["spokesman"],"pinyin":["xin1 wen2 fa1 yan2 ren2"],"word":"新聞發言人"},{"definition":["to call a conference\/to convene a meeting"],"pinyin":["zhao4 kai1 hui4 yi4"],"word":"召開會議"},{"definition":["Hong Kong Federation of Trade Unions"],"pinyin":["Xiang1 gang3 Gong1 hui4 Lian2 he2 hui4"],"word":"香港工會聯合會"},{"definition":["Ministry of Land and Resources (MLR), formed in 1998"],"pinyin":["Guo2 tu3 Zi1 yuan2 bu4"],"word":"國土資源部"},{"definition":["PRC National Development and Reform Commission (NDRC), formed in 2003"],"pinyin":["Guo2 jia1 Fa1 zhan3 he2 Gai3 ge2 Wei3 yuan2 hui4"],"word":"國家發展和改革委員會"},{"definition":["centrally-managed state-owned enterprise (PRC)"],"pinyin":["zhong1 yang1 qi3 ye4"],"word":"中央企業"}]}