{"definition":["brass instrument (music)"],"pinyin":["tong2 guan3"],"simplified":["铜管"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"銅管","characters":[{"definition":["copper (chemistry)\/see also 紅銅|红铜[hong2 tong2]\/CL:塊|块[kuai4]"],"pinyin":["tong2"],"word":"銅"},{"definition":["surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["Guan3","guan3"],"word":"管"}],"containing_words":[{"definition":["brass instruments"],"pinyin":["tong2 guan3 yue4 qi4"],"word":"銅管樂器"}],"sentences":[{"english":"The top of the funnel is connected to a tube.","chinese":"通過杯狀或漏斗狀吹口吹奏的銅管樂器。"},{"english":"Copper tubing shall not be used on the downstream side of the backflow preventer.","chinese":"在防迴流閥的下游不應該安裝銅管。"},{"english":"They announced themselves with the subtlety of a brass band.","chinese":"以銅管樂隊般美妙的聲音宣佈他們的到來。"},{"english":"You'll want to make sure that there is no water in the copper pipe you are soldering.","chinese":"你先要確認要焊接的銅管裏沒有水。"},{"english":"Many of the workers play in the factory's brass band.","chinese":"許多工人都在工廠銅管樂隊中演奏。"},{"english":"Flanging, easy flow and the resistance caused by impurities hold, the brass has corrosive effect.","chinese":"內翻邊，易造成阻流及雜質存留，對銅管有腐蝕作用。"},{"english":"The results show that the failure of oil-cooler is bolt-like dezincification corrosion.","chinese":"結果表明，冷油器銅管的腐蝕屬於栓狀脫鋅腐蝕。"},{"english":"They invited me to join their brass band.","chinese":"他們約請我加盟他們銅管樂隊。"},{"english":"The brass band is banging away in the park.","chinese":"銅管樂隊在公園裏吹吹打打。"},{"english":"An organ stop that produces a tone like that of the brass wind instrument.","chinese":"銅管樂器家族中任何一種像喇叭帶有筏的樂器。"},{"english":"School brass band will provide music for entertainment.","chinese":"由學校銅管樂隊助興。"},{"english":"Jazz's brass instruments are often played alongside drums and stringed instruments.","chinese":"爵士樂中的銅管樂器通常會和鼓以及絃樂器一起演奏。"},{"english":"Flare up the cooper tube to connect a union.","chinese":"把銅管做成喇叭口形狀以便接上活絡接頭。"},{"english":"He plays in the brass of the orchestra.","chinese":"他在管弦樂團裏演奏銅管樂器。"},{"english":"Trumpets and horns are brasses.","chinese":"小喇叭和號角都是銅管樂器。"},{"english":"There are also early brass and keyboard instruments.","chinese":"這裏還有早期的銅管樂器和鍵盤樂器。"}],"related":[]}