{"definition":["steep decline"],"pinyin":["rui4 jian3"],"simplified":["锐减"],"rank":15701.0,"normalized_rank":0.219677360681656,"fraction":0.000003805782709917434,"cumulative_fraction":0.9618219755067744,"word":"銳減","characters":[{"definition":["acute"],"pinyin":["rui4"],"word":"銳"},{"definition":["to lower\/to decrease\/to reduce\/to subtract\/to diminish"],"pinyin":["jian3"],"word":"減"}],"containing_words":[],"sentences":[{"english":"At his death, he had lost about a third of his weight and had only a few dollars.","chinese":"他死時，體重銳減約三分之一，而且身上只剩幾文錢。"},{"english":"By 2005, that number had dwindled to 21, 000.","chinese":"到了2005年，這個數字銳減到2萬1千條。"},{"english":"Long-term dependence on U. S. and European markets plummeted Indian software outsourcing orders.","chinese":"長期依賴於歐美市場的印度軟件外包訂單銳減。"},{"english":"The distance the high-heel wearers could flex their feet up and down was also drastically reduced.","chinese":"穿高跟鞋的女性，她們能夠上下活動腳的距離銳減。"},{"english":"Currently, China's export volume is suffering a sharp drop and the trade surplus is decreasing significantly.","chinese":"目前我國外貿出口數量銳減，貿易順差額明顯下降。"},{"english":"As demands for this product are very keen, our stocks are getting low very fast.","chinese":"由於最近對此商品的需求甚殷，使我們存貨銳減。"},{"english":"The results showed that the grain yield and rice quality decreased under the conditions of thin plough layer.","chinese":"結果表明，薄耕層使米質變劣，產量銳減。"},{"english":"The earthquake dispeopled the city.","chinese":"地震使該城人口銳減。"},{"english":"The result of Han immigrant is, greatly reduction of SHE population and possible disappear of SHE ethnic.","chinese":"漢化的結果是畲族人口的銳減和行將消失。"},{"english":"The number of tigers has reduced abruptly in the last fifty years.","chinese":"在曩昔的五十年裏，山君的數量銳減。"},{"english":"The dry spell quickly diminished our water suply.","chinese":"乾旱期使我們的水供應銳減。"}],"related":[]}