{"definition":["acute angle"],"pinyin":["rui4 jiao3"],"simplified":["锐角"],"rank":50876.0,"normalized_rank":0.7118212471842514,"fraction":1.3108790892201508e-7,"cumulative_fraction":0.9990803425565216,"word":"銳角","characters":[{"definition":["acute"],"pinyin":["rui4"],"word":"銳"},{"definition":["angle\/corner\/horn\/horn-shaped\/unit of money equal to 0.1 yuan, or 10 cents (a dime)\/CL:個|个[ge4]","role (theater)\/to compete\/ancient three legged wine vessel\/third note of pentatonic scale","surname Jue"],"pinyin":["Jue2","jiao3","jue2"],"word":"角"}],"containing_words":[],"sentences":[{"english":"Some vessels turned back to be acute angles and some were observed as blind channels.","chinese":"毛細血管部分成銳角折返，亦可見毛細血管盲端。"},{"english":"Sharp corners are stress-risers in the forgings, as well as make the dies weak in service.","chinese":"銳角會增加鍛件中的應力，同時在使用時削弱鍛模。"},{"english":"The ramp sits at an acute angle to deflect the intake airstream from the longitudinal direction.","chinese":"這個斜面銳角使進氣口的氣流縱向流變。"},{"english":"The sharp-edged triangle poking out of the flat ocean was in fact the tip of a shipwreck.","chinese":"在海平面上突出的銳角三角形實際上是一條漁船。"},{"english":"The spade coins shaped acute angle of Three Jin states should be the legal currency made by Han state.","chinese":"三晉銳角布中的涅金布當是韓國鑄造的法定流通貨幣。"},{"english":"ANGLE OF INCIDENCE, The acute angle which the wing chord makes with the longitudinal axis of the aircraft.","chinese":"安裝角，飛機的縱軸與機翼絃線所形成的銳角。"},{"english":"We must bestir ourselves to get there on time.","chinese":"你可以得到銳角精確的三等分。"},{"english":"The acute angle theorem is extended under the condition of the variational structure.","chinese":"在具有變分結構條件下推廣了銳角原理。"}],"related":[]}