{"definition":["bauxite\/aluminum ore"],"pinyin":["lu:3 tu3"],"simplified":["铝土"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"鋁土","characters":[{"definition":["aluminum (chemistry)"],"pinyin":["lu:3"],"word":"鋁"},{"definition":["Tu (ethnic group)\/surname Tu","earth\/dust\/clay\/local\/indigenous\/crude opium\/unsophisticated\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Tu3","tu3"],"word":"土"}],"containing_words":[{"definition":["Ferralosols (Chinese Soil Taxonomy)"],"pinyin":["Tie3 lu:3 tu3"],"word":"鐵鋁土"}],"sentences":[{"english":"Industrial Index of Karst Accumulat ion Bauxite Orebody at Pingguo;","chinese":"岩溶堆積型鋁土礦是國內新類型的鋁土礦牀。"},{"english":"Industrial Index of Karst Accumulat ion Bauxite Orebody at Pingguo;","chinese":"岩溶堆積型鋁土礦是國內新類型的鋁土礦牀。"},{"english":"Once the bauxite is gone, they fear, the streams will run dry.","chinese":"他們擔心一旦鋁土不在了，溪流將會乾涸。"},{"english":"The troughed ore washer is a key equipment used for desliming the bauxite ore.","chinese":"槽式洗礦機是鋁土礦脫泥的關鍵設備。"},{"english":"The authors suggest that the main material source of bauxite is originated from its underlying Ordovician limestone.","chinese":"本文認爲孝義鋁土礦物質來源主要是下伏奧陶系灰巖。"},{"english":"Aluminum is made from bauxite.","chinese":"鋁是從鋁土巖提煉出來的。"},{"english":"All of the bauxites are formed by weathering without any exception.","chinese":"鋁土礦全部是風化作用形成的，無一例外。"},{"english":"Vietnam has an estimated eight billion tons of high-quality bauxite, the third-largest reserves in the world.","chinese":"越南估計擁有80億噸高品質鋁土，儲量世界第三。"},{"english":"This photo shows a plume of foam in bauxite waste.","chinese":"這張圖片中羽毛狀的泡沫是在鋁土廢料中形成的。"},{"english":"Debao bauxite deposit in Guangxi province is a karst accumulation type deposit.","chinese":"廣西德保鋁土礦屬於岩溶堆積型礦牀。"},{"english":"Becouse of the above advantages the scales of alumina refineries in Australia are large.","chinese":"同時，澳大利亞的鋁土礦還具有開採容易的特點。"},{"english":"The dissolving behavior of iron in bauxite tails in vitriol solution was studied.","chinese":"研究了複雜鋁土礦浮選尾礦在酸介質中鐵的溶解行爲。"},{"english":"The bauxite belongs to the genesis of continental mineralization and is batanogeochemical weathering eluvial ore deposits.","chinese":"鋁土礦是陸上成礦，是植物化學風化殘積礦牀。"},{"english":"Our country is abundant in bauxite which has the property of high-alumina content and high-silica content.","chinese":"我國鋁土礦資源豐富且具有高鋁高硅的特性。"},{"english":"Some samples of bauxites and wall-rocks are collected and measured for REE.","chinese":"對鋁土礦及其圍巖系統取樣，進行稀土元素分析。"},{"english":"Bauxite is the main material in refining aluminum and refractories industries.","chinese":"鋁土礦是鍊鋁工業及耐火材料工業的主要原料。"}],"related":[]}