{"definition":["billet (steel industry)"],"pinyin":["gang1 pi1"],"simplified":["钢坯"],"rank":28705.0,"normalized_rank":0.4016201922404264,"fraction":0.0000010577538842415605,"cumulative_fraction":0.9889504718426292,"word":"鋼坯","characters":[{"definition":["steel"],"pinyin":["gang1"],"word":"鋼"},{"definition":["blank (e.g. for a coin)\/unburnt earthenware\/semifinished product\/Taiwan pr. [pei1]"],"pinyin":["pi1"],"word":"坯"}],"containing_words":[],"sentences":[{"english":"The working principle of automatic hydraulic billet shears in continuous-casting steel line was introduced.","chinese":"介紹了全自動液壓鋼坯在線剪的工作原理。"},{"english":"How do you see the billet market?","chinese":"你如何看待鋼坯市場？"},{"english":"Clamp machine of billet material is used at the working procedure of stock heat up stove.","chinese":"鋼坯夾持機是用於型鋼廠加熱爐的備料工序。"},{"english":"Penetrable induction heating are widely used in billet forging.","chinese":"感應透熱技術已經廣泛地應用於鍛造鋼坯的生產中。"},{"english":"The technical requirement of oxidation resistant coatings applied to steel billet in high temperature dynamic process was analyzed.","chinese":"分析了動態過程鋼坯高溫防氧化塗料的技術要求。"},{"english":"How do you view the short-term outlook of the billet market?","chinese":"你如何看待鋼坯市場短期前景？"},{"english":"The article introduces a new-designed descaling machine used for round billet.","chinese":"介紹一種新型圓鋼坯除鱗機。"},{"english":"This year, 50 axle billet enjoys Bao Gang Shanghai duty-free policy.","chinese":"今年，寶鋼50車軸鋼坯享受上海免稅政策。"},{"english":"The present invention relates to one kind of roller way billet heat insulating apparatus.","chinese":"本發明涉及一種軋鋼廠輥道鋼坯的保溫裝置。"},{"english":"The oxidation resistant coatings applied to steel billet at high temperature were summarized.","chinese":"概述了國內外鋼坯高溫防氧化塗料的研究現狀。"}],"related":[]}