{"definition":["hawser\/steel rope"],"pinyin":["gang1 si1 sheng2"],"simplified":["钢丝绳"],"rank":30310.0,"normalized_rank":0.4240762245883061,"fraction":9.179073177078293e-7,"cumulative_fraction":0.9905300493220172,"word":"鋼絲繩","characters":[{"definition":["steel"],"pinyin":["gang1"],"word":"鋼"},{"definition":["silk\/thread\/trace\/(cuisine) shreds or julienne strips\/CL:條|条[tiao2]\/classifier: a thread (of cloud, smoke etc), a bit, an iota, a hint (of sth) etc"],"pinyin":["si1"],"word":"絲"},{"definition":["rope\/CL:根[gen1]"],"pinyin":["sheng2"],"word":"繩"}],"containing_words":[],"sentences":[{"english":"Effective measure solving the problem on decrease of rope is to use the steel wire rope with metal core.","chinese":"解決鋼絲繩直徑減小的有效措施是使用鋼芯鋼絲繩。"},{"english":"Effective measure solving the problem on decrease of rope is to use the steel wire rope with metal core.","chinese":"解決鋼絲繩直徑減小的有效措施是使用鋼芯鋼絲繩。"},{"english":"Chief officer, the wire rope loose.","chinese":"大副，把鋼絲繩解開。"},{"english":"What is the use of that wire which he has fastened there?","chinese":"他拴在那裏的那根鋼絲繩有什麼用處了？"},{"english":"A wireline bailer that is used to remove sand and debris from the bottom of a well.","chinese":"從井底去除砂子和碎片所用的由鋼絲繩起下的撈砂筒。"},{"english":"The polished rod is attached to the horsehead by the bridle.","chinese":"光桿用一段鋼絲繩固定於驢頭。"},{"english":"I should have let the wire do the work.","chinese":"我應該讓鋼絲繩完成這部份工作。"},{"english":"This paper introduces the principle of non-destructive ration examining device for TCK wire rope.","chinese":"介紹了TCK型鋼絲繩無損定量檢測裝置的檢測原理。"},{"english":"Protect wire slings from sharp corners or edges with padding.","chinese":"使用墊板保護鋒利的拐角或邊緣處的鋼絲繩。"},{"english":"The research process and performance of high drop point fiber core grease were introduced.","chinese":"簡要介紹了高滴點鋼絲繩麻芯脂的研製過程及其性能。"},{"english":"Technical target of the product on zinc - plated wire rope grease is formulated.","chinese":"制定鍍鋅鋼絲繩脂產品技術指標。"},{"english":"The steel wire establishment is much long, the hanging basket can climb high.","chinese":"鋼絲繩設置多長，吊籃就能攀升多高。"},{"english":"A wireline device that uses knives to remove wax from tubing.","chinese":"利用刮蠟片從油管上刮蠟的由鋼絲繩起下的裝置。"},{"english":"It should use two steel lines and steel tube cover tope of frame to suspend if open box.","chinese":"開箱吊運時用二條鋼絲繩和鋼管套在底架頂環中起吊。"},{"english":"After the rope is tightened, the device shall be removed.","chinese":"鋼絲繩被卡緊後將該裝置撤掉。"},{"english":"The chemical propellant is packed inside the tool which is lowered on wireline.","chinese":"化學推進劑被裝在工具內，工具用鋼絲繩下入井內。"}],"related":[]}