{"definition":["iron and steel works\/steelworks"],"pinyin":["gang1 tie3 chang3"],"simplified":["钢铁厂"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"鋼鐵廠","characters":[{"definition":["steel"],"pinyin":["gang1"],"word":"鋼"},{"definition":["iron (metal)\/arms\/weapons\/hard\/strong\/violent\/unshakeable\/determined\/close\/tight (slang)","surname Tie"],"pinyin":["Tie3","tie3"],"word":"鐵"},{"definition":["factory\/yard\/depot\/workhouse\/works\/(industrial) plant"],"pinyin":["chang3"],"word":"廠"}],"containing_words":[],"sentences":[{"english":"And Chinese steel mills have been forced to make purchases on the spot market.","chinese":"中國的鋼鐵廠被迫在現貨市場購貨。"},{"english":"Selection of flowmeter which is generally used in iron and steel works is introduced.","chinese":"介紹幾種鋼鐵廠中常用的流量儀表的選用。"},{"english":"Surya Narayan Bandaru Has Pakistan Iron oar and Coke reserves for establishment of a Steel Plant ?","chinese":"巴基斯塔有儲備鐵槳和焦炭來建造鋼鐵廠嗎？"},{"english":"My grandfather Herman worked in the Wheeling Steel plant.","chinese":"我的祖父赫爾曼在一個鋼鐵廠工作。"},{"english":"Leasing Gujiao steel plants, the placement of laid-off employees 500 people.","chinese":"租賃古交鋼鐵廠，安置下崗職工500多人。"},{"english":"It is possible to premix the ore at the shipping point thus saving time at the iron works.","chinese":"礦石在裝運地點預先混合可給鋼鐵廠節省很多時間。"},{"english":"Why this fire incidents repeatedly happening in this steel factory ?…. Officials should seriously look into the matter….","chinese":"爲什麼這家鋼鐵廠三番五次發生火災事故？"},{"english":"Therefore, the utility model is suitable for trolleys of sintering machines or burning machine in steel plant.","chinese":"適用各鋼鐵廠燒結機或焙燒機臺車上。"},{"english":"Eight trucks worth of scrap were sold to local steel mills.","chinese":"八卡車之多的廢金屬被賣給當地鋼鐵廠。"},{"english":"Many steelworks have to be closed down, causing major unemployment in an area.","chinese":"許多鋼鐵廠倒閉，導致該地區的大批人失業。"},{"english":"The blanks for the plant are supplied by Pavlodar steel works.","chinese":"這些坯料由巴布洛達爾鋼鐵廠供應。"},{"english":"Dirty old steel factories are being upgraded or relocated.","chinese":"骯髒陳舊的鋼鐵廠正在進行設備升級或遷移。"},{"english":"The blanks for the plant are supplied by the neighbor – Pavlodar steel works.","chinese":"這個廠所用的坯料由臨近的巴普洛達爾鋼鐵廠提供。"},{"english":"At Shijingshan we passed the huge steel mill and the power plant.","chinese":"我們經過石景山這座大鋼鐵廠和發電廠。"},{"english":"The control system has been put into use in Laiwu Iron and Steel Company.","chinese":"相應控制軟件在萊蕪鋼鐵廠已得到較好的應用。"},{"english":"Starting bare-handed , you have built up so many steel plants. This is nothing short of miraculous.","chinese":"你們白手起家，修建了許多鋼鐵廠，這簡直是個奇蹟。"}],"related":[]}