{"definition":["pinion gear"],"pinyin":["zhui1 chi3 lun2"],"simplified":["锥齿轮"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"錐齒輪","characters":[{"definition":["cone\/awl\/to bore"],"pinyin":["zhui1"],"word":"錐"},{"definition":["tooth\/CL:顆|颗[ke1]"],"pinyin":["chi3"],"word":"齒"},{"definition":["wheel\/disk\/ring\/steamship\/to take turns\/to rotate\/by turn\/classifier for big round objects: disk, or recurring events: round, turn"],"pinyin":["lun2"],"word":"輪"}],"containing_words":[],"sentences":[{"english":"Gear Box uses the two-stage transmission made up of spiral cone-shaped gear and columned bevel wheel;","chinese":"減速器採用螺旋錐齒輪，圓柱斜齒輪二級傳動。"},{"english":"Going into the gearbox, universal joints connect the centre drive shaft to the internal bevel gears.","chinese":"進入變速箱，萬向節連接中心傳動軸到內部錐齒輪。"},{"english":"Priciples of cutting epicycloid bevel gear by continuous indexing method are investigated systematically.","chinese":"對擺線齒錐齒輪連續分類法銑齒原理進行了系統研究。"},{"english":"These provide a foundation for the control of grinding quality of spiral bevel gear.","chinese":"研究結果爲螺旋錐齒輪磨齒質量的控制提供了依據。"},{"english":"But in actual applications, spiral bevel gears on rigs are often damaged.","chinese":"但在實際應用中，鑽機中弧齒圓錐齒輪常損壞。"},{"english":"The parametric modeling method for loxodrome normal circular-arc spiral bevel gear was presented.","chinese":"給出了斜航式法向圓弧螺旋錐齒輪的參數化建模方法。"},{"english":"Bevel gear actuators are recommended when pressure exceeds limits shown.","chinese":"果壓差超過所列的極限值，則建議採用錐齒輪執行器。"},{"english":"Camber line wonts do orthogonal arc tooth wimble gear.","chinese":"中心線不成直角的弧齒錐齒輪。"},{"english":"Optimization method was used in the design of the spiral bevel gear of the main reducer.","chinese":"採用優化的方法設計了主減速器螺旋錐齒輪。"},{"english":"According to the simulation results, the process of bevel gear was determined.","chinese":"確定了精鍛錐齒輪的成形工藝。"},{"english":"Rotate gear for several rounds, and the imprints left on the small bevel gear surface are touch imprints.","chinese":"此時粘印到小錐齒輪面上的印痕即爲接觸印痕。"},{"english":"Camber line becomes orthogonal arc tooth wimble gear.","chinese":"中心線成直角的弧齒錐齒輪。"},{"english":"It used bevel gears to transmit power to the prop.","chinese":"它使用的錐齒輪轉交權力交給道具。"},{"english":"The bevel gear's cold forging die was designed based on the principles of cold precision forming.","chinese":"基於冷鍛成形原理，對錐齒輪冷精鍛模進行了設計。"}],"related":[]}