{"definition":["fault"],"pinyin":["cuo4 chu5"],"simplified":["错处"],"rank":58111.0,"normalized_rank":0.8130482839673723,"fraction":5.48875877000865e-8,"cumulative_fraction":0.9997239631685524,"word":"錯處","characters":[{"definition":["mistake\/wrong\/bad\/interlocking\/complex\/to grind\/to polish\/to alternate\/to stagger\/to miss\/to let slip\/to evade\/to inlay with gold or silver","surname Cuo"],"pinyin":["Cuo4","cuo4"],"word":"錯"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"}],"containing_words":[],"sentences":[{"english":"Self- checking regularly is also needed for discovering and correcting error in medical records.","chinese":"進行階段性自我檢查，發現錯處及時糾正。"},{"english":"Expose your hidden faults .","chinese":"揭露你隱藏的錯處。"},{"english":"It is the nature of folly to see the faults of others and forget his own.","chinese":"愚蠢的本質是隻看到別人的錯處而忘卻了自己的過失。"},{"english":"Language originate before philosophy, and that's what's wrong with philosophy.","chinese":"語言起源於哲學以前，這就是哲學的錯處。"},{"english":"I don't see anything wrong in space travel.","chinese":"我不認爲空間旅行有什麼錯處。"},{"english":"My teacher always points out and corrects my mistakes whenever I hand in my composition .","chinese":"每次交的作文，老師總是給我指出錯處並加以改正。"},{"english":"The mischief is that he did it without permission.","chinese":"錯處就在他做這事末經許可。"},{"english":"Blame someone else, find someone else's mistakes, which is directly opposite and rituals.","chinese":"非難別人，找別人的錯處，這和禮儀是直接對立的。"},{"english":"Mistakes were scored in red ink.","chinese":"錯處用紅墨水作了記號。"},{"english":"In retrospect, its easy to see why we were wrong.","chinese":"回顧過去就很容易明白我們的錯處了。"},{"english":"He is a mean and nasty boss who is always finding faults with his employees.","chinese":"他是刻薄不仁的老闆，經常挑僱員的錯處。"}],"related":[]}