{"definition":["galvanized\/zinc-coated"],"pinyin":["du4 xin1"],"simplified":["镀锌"],"rank":24628.0,"normalized_rank":0.3445776726875883,"fraction":0.0000015317432386622542,"cumulative_fraction":0.983730731591723,"word":"鍍鋅","characters":[{"definition":["-plated\/to plate"],"pinyin":["du4"],"word":"鍍"},{"definition":["zinc (chemistry)"],"pinyin":["xin1"],"word":"鋅"}],"containing_words":[],"sentences":[{"english":"The current galvanizing mill will be removed and the six-high mill will be built in its place.","chinese":"目前鍍鋅廠將被刪除，將在其位置上興建的六輥軋機。"},{"english":"The zinc nail and the copper penny are called electrodes.","chinese":"鍍鋅釘和銅硬幣就是電池的電極。"},{"english":"Domestically, no cyanogen zinc acid salt galvanized is still the mainstream.","chinese":"就國內而言，無氰鋅酸鹽鍍鋅仍是主流。"},{"english":"It's obviously that corrosion-resistance and brightness are much better than those of Zn plating.","chinese":"實驗結果表明，其耐蝕性和光亮度明顯優於鍍鋅層。"},{"english":"The method has been applied in the determination of Zn2+in wastewater with a satisfactory result.","chinese":"應用該方法進行了鍍鋅廢液中鋅的測定，結果滿意。"},{"english":"A mat final aspect was chosen for its resemblance to the colour of the zinc domes and pinnacles.","chinese":"地板最終選擇與鍍鋅圓頂和尖塔相近的顏色。"},{"english":"Galvanized low carbon steel wire cloth?","chinese":"鍍鋅低碳鋼絲布？"},{"english":"A chromium-free phytic acid passivating coatings for galvanized parts is studied.","chinese":"對鍍鋅件植酸鈍化膜進行了研究。"},{"english":"Secondary frame including purlins, doors frame… made of galvanized steel profiles.","chinese":"次鋼構包括檁條，門框架等等，由鍍鋅鋼型材料製作。"},{"english":"Material aluminium alloy , All parts are hot-dip galvanized steel.","chinese":"鋁合金製件，熱鍍鋅鋼製件。"},{"english":"The steel ring will be stainless steel or zinc-plated.","chinese":"袋口圈可以有不鏽鋼圈，鍍鋅鋼圈。"},{"english":"Exhaust air from rear side; galvanized steel molding frame, white coated steel cover.","chinese":"後部排風，鍍鋅板型材框架，白色彩鋼板蒙板。"},{"english":"Castings and forgings and hydrogen brittleness sensitivity to the spare parts of the appropriate USES weak acid galvanizing.","chinese":"鑄鍛件和對氫脆敏感的零件宜用弱酸性鍍鋅液。"},{"english":"Each wire is galvanized and the cable is covered with a protective coating.","chinese":"每根鋼絲進行了鍍鋅處理，懸索也要塗上防腐層。"},{"english":"Clamp body and kdeeper are aluminium , the other parts are hot-dip galvanized steel.","chinese":"線夾本體和抽匣爲鋁製件，其餘爲熱鍍鋅鋼製件。"},{"english":"Zinc-coated steel wires for stranded conductors.","chinese":"絞線用鍍鋅鋼線。"}],"related":[]}