{"definition":["to key in\/to input"],"pinyin":["jian4 ru4"],"simplified":["键入"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"鍵入","characters":[{"definition":["key (on a piano or computer keyboard)\/button (on a mouse or other device)\/chemical bond\/linchpin"],"pinyin":["jian4"],"word":"鍵"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"}],"containing_words":[],"sentences":[{"english":"Type the text that appears as a hyperlink in your document.","chinese":"鍵入在文檔中作爲超級鏈接顯示的文本。"},{"english":"The idea of an edit box, of course, is to allow users to type something in.","chinese":"編輯框旨在允許用戶鍵入某些內容。"},{"english":"You type at the keyboard words that you want to encrypt.","chinese":"你從鍵盤上鍵入你想加密的單詞。"},{"english":"Type the account name in the format \"domainuser\".","chinese":"請以“域用戶”格式鍵入帳戶名。"},{"english":"Type in the title or the author's name, please.","chinese":"請鍵入書名或作者姓名。"},{"english":"Step 6 – Type the keys that you want to use to bring up the emoticon.","chinese":"鍵入你想使用的關鍵字來說明圖釋。"},{"english":"A computer can soak up all you key into it.","chinese":"計算機你鍵入什麼它都能記住。"},{"english":"So Arg V bracket I, gives me the Ife string that I typed in.","chinese":"那麼Argv，把我剛鍵入的字符串Ife傳給我。"},{"english":"Enter a name for the new configuration.","chinese":"爲這個新配置鍵入一個名稱。"},{"english":"The account name you typed is not valid.","chinese":"鍵入的帳戶名無效。"},{"english":"In the Confirm password box , retype the password to use with this account .","chinese":"請在“確認密碼”框中再次鍵入此帳戶的密碼。"},{"english":"Type the footnote or endnote content in this area.","chinese":"在這一區域鍵入腳註或尾註的內容。"},{"english":"This saves you the trouble of having to re-type the regular expression every time.","chinese":"這樣您就不必每次都要重新鍵入正則表達式。"},{"english":"Enter the name of your configured test case.","chinese":"鍵入您的配置測試用例的名稱。"},{"english":"The alias is expanded from what you type to its expansion.","chinese":"別名從您鍵入的內容展開爲其展開形式。"},{"english":"In the first window, type in the Bonjour or IP address and hit connect.","chinese":"在第一個窗口中，鍵入或IP地址和卓悅擊中連接。"}],"related":[]}