{"definition":["suppression\/repression\/to suppress\/to put down\/to quell"],"pinyin":["zhen4 ya1"],"simplified":["镇压"],"rank":19052.0,"normalized_rank":0.26656219831264955,"fraction":0.000002639421471290596,"cumulative_fraction":0.9724530792336128,"word":"鎮壓","characters":[{"definition":["to press down\/to calm\/to subdue\/to suppress\/to guard\/garrison\/small town\/to cool or chill (food or drinks)"],"pinyin":["zhen4"],"word":"鎮"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"}],"containing_words":[{"definition":["Campaign to Suppress Counterrevolutionaries (PRC political campaign from 1950-1952), abbr. to 鎮反運動|镇反运动[Zhen4 fan3 Yun4 dong4]"],"pinyin":["Zhen4 ya1 Fan3 ge2 ming4 Yun4 dong4"],"word":"鎮壓反革命運動"}],"sentences":[{"english":"At last the rebellion was crushed down.","chinese":"叛亂最終被鎮壓下去。"},{"english":"During this period of 6 years, he quelled the nationalities' Risingup in Yunnan successfully.","chinese":"其間，他成功地鎮壓了滇東北各族人民起義。"},{"english":"Khomeini’s regime responded with remarkable brutality, slaughtering thousands of the organization’s members.","chinese":"霍梅尼政權殘忍的鎮壓遊行，屠殺了幾千名組織成員。"},{"english":"The Syrian government launched a violent campaign against pro-democracy protesters in March.","chinese":"敘利亞政府三月份對主張民主的示威者展開暴力鎮壓。"},{"english":"The political repression in this country is imposed by severe fear.","chinese":"這個國家的政治鎮壓是通過恐怖行動來實施的。"},{"english":"The riot police started to crack down on them.","chinese":"防暴警察開始對他們採取鎮壓行動。"},{"english":"Finally the Northwest Army's suppressing the Heavenly Gate Society marked the Red Spears' falling.","chinese":"西北軍對天門會的鎮壓標誌着紅槍會的衰亡。"},{"english":"Indian Defense Minister Arackaparambil Kurian Antony says that has ramifications on this side of the border.","chinese":"印度國防部長安東尼說，這些鎮壓對印度也有影響。"},{"english":"Gradually the Government was systematized and lawlessness suppressed.","chinese":"政府漸漸地變得系統化和非法地鎮壓。"},{"english":"The Syrian government is continuing its crackdown Monday against anti-government protesters.","chinese":"敘利亞政府正在繼續鎮壓反日反政府示威者。"},{"english":"It is actually reflection of this view that she cruelly kept down the Movement of 1898.","chinese":"她殘酷地鎮壓戊戌變法運動就是這一基本思想的反映。"},{"english":"The military and civil authorities are working together to put down the unrest.","chinese":"軍政和民政當局正聯手鎮壓動亂。"},{"english":"Their subjugation became a pillar of the Islamic state.","chinese":"對她們的鎮壓成爲這個伊斯蘭國家的一個支柱。"},{"english":"This argument is only too blatantly an alibi for domestic repression.","chinese":"這一辯解完全是在爲國內的鎮壓活動開脫。"},{"english":"The murderer was executed according to law.","chinese":"那個殺人犯已經依法鎮壓了。"},{"english":"The reactionaries crushed the movement of the students into submission.","chinese":"反動派鎮壓了學生運動。"}],"related":[{"definition":["to suppress\/to inhibit\/to stifle"],"pinyin":["ya1 zhi4"],"word":"壓制"},{"definition":["to encircle and annihilate\/refers to repeated campaigns of the Guomindang against the communists from 1930 onwards"],"pinyin":["wei2 jiao3"],"word":"圍剿"},{"definition":["to conspire"],"pinyin":["tu2 mou2"],"word":"圖謀"},{"definition":["to attack\/to accuse\/to charge\/an attack (terrorist or military)"],"pinyin":["gong1 ji1"],"word":"攻擊"},{"definition":["to start\/to launch\/to unleash\/to mobilize\/to arouse"],"pinyin":["fa1 dong4"],"word":"發動"},{"definition":["to strike back\/to beat back\/to counterattack"],"pinyin":["fan3 ji1"],"word":"反擊"},{"definition":["army\/troops\/CL:支[zhi1],個|个[ge4]"],"pinyin":["jun1 dui4"],"word":"軍隊"},{"definition":["to suppress\/to beat down"],"pinyin":["da3 ya1"],"word":"打壓"},{"definition":["to oppress\/to repress\/to constrict\/oppression\/stress (physics)"],"pinyin":["ya1 po4"],"word":"壓迫"},{"definition":["to rule (a country)\/to govern\/rule\/regime"],"pinyin":["tong3 zhi4"],"word":"統治"},{"definition":["to drive (vehicle)\/to drive out\/to chase away\/to herd (people towards a gate)"],"pinyin":["qu1 gan3"],"word":"驅趕"},{"definition":["to cut off\/to chop sth in half"],"pinyin":["zhan3 duan4"],"word":"斬斷"},{"definition":["attack (esp. surprise attack)\/raid\/to attack"],"pinyin":["xi2 ji1"],"word":"襲擊"},{"definition":["to attempt\/to try\/attempt\/CL:種|种[zhong3]"],"pinyin":["qi3 tu2"],"word":"企圖"},{"definition":["to chase to kill"],"pinyin":["zhui1 sha1"],"word":"追殺"},{"definition":["to obstruct"],"pinyin":["dang3 zhu4"],"word":"擋住"}]}