{"definition":["electrical ballast"],"pinyin":["zhen4 liu2 qi4"],"simplified":["镇流器"],"rank":43885.0,"normalized_rank":0.6140080869699047,"fraction":2.6611721376930233e-7,"cumulative_fraction":0.9977386891938992,"word":"鎮流器","characters":[{"definition":["to press down\/to calm\/to subdue\/to suppress\/to guard\/garrison\/small town\/to cool or chill (food or drinks)"],"pinyin":["zhen4"],"word":"鎮"},{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[],"sentences":[{"english":"If not ventilated properly, their ballast circuitry can get fried enough to fail.","chinese":"如果通風不當，它們的鎮流器電路會火燙到失效。"},{"english":"Sound generated by the vibration of laminations in the electromagnetic field that transforms the current for discharge lamp use.","chinese":"由電感鎮流器中鐵芯片的震動所產生的聲音。"},{"english":"The main methods are also put forward to handle acoustic resonance with electronic ballast.","chinese":"並分析總結了電子鎮流器解決聲共振問題的方法。"},{"english":"Railway ballast will be loaded onto ballast trains at an established ballast siding.","chinese":"鐵路道碴，將載入碴列車在一個既定的鎮流器偏袒。"},{"english":"The forecast of dimmable electronic ballast is also presented.","chinese":"最後給出了可調光電子鎮流器的前景預測。"},{"english":"The ballast tanks are complete and have been installed.","chinese":"鎮流器坦克是完整的和已安裝的。"},{"english":"A novel UHF electronic ballast with dimming feature is proposed in this paper.","chinese":"本文提出了一種新型可調光的超高頻電子鎮流器。"},{"english":"Perform crane ballast sequence, or any other sequence.","chinese":"執行起重機鎮流器序列，或任何其他序列。"},{"english":"Arc lamps require a current-limiting ballast .","chinese":"弧光燈需要一個限流鎮流器。"},{"english":"Arc lamps require a current- limiting ballast.","chinese":"弧光燈需要一個限流鎮流器。"},{"english":"No ballasts, cooling fans or reflectors needed.","chinese":"沒有鎮流器，散熱風扇或反射器所需要的。"},{"english":"The Electronic BaLlast is a kind of electronic equipments unitizing the ignoring and current limiting .","chinese":"電子鎮流器是集點燃與限流爲一體的電子裝置。"},{"english":"Lamp life depends on whether the start ballast is program or instant.","chinese":"燈壽命取決於啓動鎮流器是程序式的還是瞬時的。"},{"english":"The ballast and trigger are all mounted inside the lamp body that's easy for installation.","chinese":"鎮流器，觸發器等均裝在燈體內，安裝簡單方便。"},{"english":"The system of Automotive head lamp electronic ballast is one of the most popular research subjects.","chinese":"目前高強度汽車頭燈電子鎮流器系統是研究熱點之一。"},{"english":"The utility model relates to a low-tension sodium lamp electronic ballast, belonging to the field of lighting technology.","chinese":"本實用新型低壓鈉燈電子鎮流器，屬於照明技術領域。"}],"related":[]}