{"definition":["determined\/unshakable"],"pinyin":["tie3 le5 xin1"],"simplified":["铁了心"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"鐵了心","characters":[{"definition":["iron (metal)\/arms\/weapons\/hard\/strong\/violent\/unshakeable\/determined\/close\/tight (slang)","surname Tie"],"pinyin":["Tie3","tie3"],"word":"鐵"},{"definition":["(completed action marker)\/(modal particle indicating change of state, situation now)\/(modal particle intensifying preceding clause)","to finish\/to achieve\/variant of 瞭|了[liao3]\/to understand clearly"],"pinyin":["le5","liao3"],"word":"了"},{"definition":["heart\/mind\/intention\/center\/core\/CL:顆|颗[ke1],個|个[ge4]"],"pinyin":["xin1"],"word":"心"}],"containing_words":[],"sentences":[{"english":"I could tell he was dying to drive that car.","chinese":"我能看出來他是鐵了心要開那輛車。"},{"english":"Clever animals like foxes may even plot revenge with single- minded determination.","chinese":"一些像狐狸這樣聰明的動物甚至會鐵了心地設計復仇。"},{"english":"We are going to finish this project come hell or high water.","chinese":"我們是鐵了心要完成這項計劃的。"},{"english":"This iron the heart was done, not sedulous also ground does what SEO.","chinese":"這回鐵了心搞了，也不刻意地搞啥SEO了。"},{"english":"Although (she is)determined about further education, she is still concerned about money.","chinese":"儘管她鐵了心要去進修，她還是擔心錢的問題。"},{"english":"Committed savers are those not afraid to go for the best deal.","chinese":"如果你鐵了心要做一個節省狂，那就別害怕砍價到底。"},{"english":"The trustees decided that they really wanted a \"Sunflowers\".","chinese":"理事會鐵了心堅持要買一幅“向日葵”。"},{"english":"Dargis is sure to make a move on the cat.","chinese":"達吉斯是鐵了心要除掉那貓了。"},{"english":"Look TOM is iron the heart comes with the train of thought of media operation electron business affairs.","chinese":"看來TOM是鐵了心以媒體的思路來運營電子商務了。"},{"english":"Becomes useful is ate steelyard Tuo iron heart.","chinese":"趙成材是吃了秤砣鐵了心了。"}],"related":[]}