{"definition":["casting\/foundry goods"],"pinyin":["zhu4 jian4"],"simplified":["铸件"],"rank":39382.0,"normalized_rank":0.5510052747191247,"fraction":4.072775789447908e-7,"cumulative_fraction":0.9962440683577014,"word":"鑄件","characters":[{"definition":["to cast or found metals"],"pinyin":["zhu4"],"word":"鑄"},{"definition":["item\/component\/classifier for events, things, clothes etc"],"pinyin":["jian4"],"word":"件"}],"containing_words":[],"sentences":[{"english":"The new water-based mold coating for resin-bonded sand mold and core for aluminium castings has been developed.","chinese":"爲鋁鑄件樹脂砂型芯研製出新型的水基淺色塗料。"},{"english":"Analysed the factors for caused blowhole in hydraulic castings and action solved .","chinese":"分析了液壓件鑄件產生氣孔缺陷的因素及解決的對策。"},{"english":"Shringkage porosity is a common defect style for aluminum alloy castings.","chinese":"縮松是鋁合金鑄件中常見的缺陷。"},{"english":"Connection rod and crass head is alloy-casting pieces.","chinese":"連桿爲合金鋼鑄件，十字頭爲球墨鑄鐵。"},{"english":"We have 2 pensile dip painting line to paint castings according to customers' requirements.","chinese":"有2條浸漆線用於按顧客要求對鑄件進行塗漆處理。"},{"english":"Sand making core of turbine blade for aluminum alloy is more difficult.","chinese":"渦輪葉片鑄件的難點是葉片砂芯的製作。"},{"english":"This can make complex shaped castings without any draft or flash.","chinese":"它能製造沒有拔模斜度和縫脊的複雜形狀鑄件。"},{"english":"What inspection functions are performed for the detection of casting cracks, porosity, and shrinks?","chinese":"如何檢驗鑄件的裂紋，縮孔，縮松？"},{"english":"Comprehend foundry technics, familiar with the casting defects in the form of easy to produce.","chinese":"對鑄造工藝有一定了解，熟悉鑄件易產生的缺陷形式。"},{"english":"During intersectant mould - core forming in die-casting die , bending pin postponing core - drawing mechanism is designed.","chinese":"鑄件要採用交叉型芯成型，設計了彎銷延時抽芯機構。"},{"english":"The aluminum wheel castings were pretty rough and hard to work with.","chinese":"該鋁合金輪轂鑄件的人相當粗糙和努力的工作。"},{"english":"Die-casting machine is the important equipment used to process alloy castings with complex shapes.","chinese":"壓鑄機是加工外形複雜的合金鑄件的重要設備。"},{"english":"Misrun is the common defects found in oven door castings process.","chinese":"澆不足是焦爐爐門鑄件常見鑄造缺陷。"},{"english":"This article introduces riser locating way for several kinds of plate castings.","chinese":"介紹幾種板類鑄件不增加鑄件熱節的冒口設置方法。"},{"english":"This article introduces riser locating way for several kinds of plate castings.","chinese":"介紹幾種板類鑄件不增加鑄件熱節的冒口設置方法。"},{"english":"Dispersed shrinkage is the main reason causing leakage of multi-cylinder heads of diesel engines.","chinese":"縮松缺陷是導致多缸柴油機缸蓋鑄件滲漏的主要原因。"}],"related":[]}