{"definition":["lit. honing a bull's horn; fig. to waste time on an insoluble or insignificant problem\/to bash one's head against a brick wall\/a wild goose chase\/a blind alley\/to split hairs\/same as idiom 鑽牛角尖|钻牛角尖"],"pinyin":["zuan1 niu2 jiao3"],"simplified":["钻牛角"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"鑽牛角","characters":[{"definition":["an auger\/diamond","to drill\/to bore\/to get into\/to make one's way into\/to enter (a hole)\/to thread one's way through\/to study intensively\/to dig into\/to curry favor for personal gain"],"pinyin":["zuan1","zuan4"],"word":"鑽"},{"definition":["ox\/cow\/bull\/CL:條|条[tiao2],頭|头[tou2]\/newton (abbr. for 牛頓|牛顿[niu2 dun4])\/(slang) awesome","surname Niu"],"pinyin":["Niu2","niu2"],"word":"牛"},{"definition":["angle\/corner\/horn\/horn-shaped\/unit of money equal to 0.1 yuan, or 10 cents (a dime)\/CL:個|个[ge4]","role (theater)\/to compete\/ancient three legged wine vessel\/third note of pentatonic scale","surname Jue"],"pinyin":["Jue2","jiao3","jue2"],"word":"角"}],"containing_words":[{"definition":["lit. to penetrate into a bull's horn (idiom); fig. to waste time on an insoluble or insignificant problem\/to bash one's head against a brick wall\/a wild goose chase\/a blind alley\/to split hairs"],"pinyin":["zuan1 niu2 jiao3 jian1"],"word":"鑽牛角尖"}],"sentences":[{"english":"Advice is not for the knowledge of knowledge, into a dead end.","chinese":"建議就是不要爲了知識而知識，鑽牛角尖。"},{"english":"Don't be too single-minded. It will only serve to bind you later on.","chinese":"別太鑽牛角尖，這隻會成爲你日後的羈絆。"},{"english":"Ongoing from that was a phase of a propensity for depression, for compulsion, for paranoia.","chinese":"那的確是一段抑鬱，容易偏執鑽牛角尖的日子。"},{"english":"The fact that you want to do better with your time means you’re stuck as-is.","chinese":"事實上你想做得更好意味着你已被卡住，鑽牛角尖了。"},{"english":"Does not overanalyze negative points, but instead looks for the positive points in the subject being analyzed.","chinese":"不會鑽牛角尖過度悲觀，能看到事物積極的一面。"}],"related":[]}