{"definition":["to get into\/to dig into (studies, job etc)\/to squeeze into"],"pinyin":["zuan1 jin4"],"simplified":["钻进"],"rank":12357.0,"normalized_rank":0.17289046213255355,"fraction":0.000005832828036522224,"cumulative_fraction":0.9460522477928156,"word":"鑽進","characters":[{"definition":["an auger\/diamond","to drill\/to bore\/to get into\/to make one's way into\/to enter (a hole)\/to thread one's way through\/to study intensively\/to dig into\/to curry favor for personal gain"],"pinyin":["zuan1","zuan4"],"word":"鑽"},{"definition":["to go forward\/to advance\/to go in\/to enter\/to put in\/to submit\/to take in\/to admit\/(math.) base of a number system\/classifier for sections in a building or residential compound"],"pinyin":["jin4"],"word":"進"}],"containing_words":[],"sentences":[{"english":"The barrel was nearly empty and I had to climb right inside to get my apple.","chinese":"蘋果桶快空了，我只好鑽進去拿蘋果。"},{"english":"It was just impossible for him to get into this I-shaped hole.","chinese":"要他鑽進這個“工”字形的洞口，是完全不可能的。"},{"english":"By ten thirty, he had already got between the sheets.","chinese":"到十點半時他已鑽進被窩睡覺了。"},{"english":"Drilling holes in the original wolf and from the sheep pen, but also guess, would leave a sheep.","chinese":"原來狼又從窟窿裏鑽進羊圈，又叼走了一隻羊。"},{"english":"The thief whisked into a red car when a policeman appeared at the corner.","chinese":"警察在街角一露頭，小偷立刻鑽進了一輛紅色小轎車。"},{"english":"She fell on some meat loaf, and it penetrated her spleen.","chinese":"她踩到塊肉糜糕摔了一跤，它鑽進了她的脾臟。"},{"english":"We had just started to curl up in our sleeping bags when we both heard a loud crack.","chinese":"我們正要鑽進睡袋休息，忽然聽到一聲很大的噼啪聲。"},{"english":"ARTISTS routinely deride businesspeople as money-obsessed bores.","chinese":"藝術家們常常嘲笑生意人鑽進了錢眼兒裏。"},{"english":"The cat insinuated herself into the kitchen.","chinese":"那隻貓悄悄地鑽進廚房。"},{"english":"A sample of mud from the deepest or current drilling depth of a well.","chinese":"從井眼的最深處或目前鑽進深度處採集的泥漿樣本。"},{"english":"A hydraulic system is used for loading drilling force so as to greatly reduce the hole forming time.","chinese":"採用液壓系統加載鑽進力，極大的縮減了成孔時間。"},{"english":"Foster: I could dive into that cake fully clothed.","chinese":"我穿的再漂亮，看到那蛋糕都想一頭鑽進去。"},{"english":"This paper discusses the procedures of DTH hammer and core drilling with casing.","chinese":"本文主要論述了空氣潛孔錘跟管取心鑽進規程。"},{"english":"The goblin went into the small pot to show the fisherman how he can go in to the small pot.","chinese":"小妖精鑽進小罐子給漁夫看他是怎樣進去的。"},{"english":"Originally wolf again from the hole in drill into the sheep turn, again the grasp walked a sheep.","chinese":"原來狼又從窟窿裏鑽進羊圈，又叼走了一隻羊。"},{"english":"On cold nights Munchie jumps upsintosmy bed and crawls under the covers.","chinese":"在寒冷的夜晚，麥奇會跳上我的牀，鑽進我的被窩。"}],"related":[]}