{"definition":["strip"],"pinyin":["chang2 tiao2"],"simplified":["长条"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"長條","characters":[{"definition":["chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance","length\/long\/forever\/always\/constantly"],"pinyin":["chang2","zhang3"],"word":"長"},{"definition":["strip\/item\/article\/clause (of law or treaty)\/classifier for long thin things (ribbon, river, road, trousers etc)"],"pinyin":["tiao2"],"word":"條"}],"containing_words":[],"sentences":[{"english":"The coastal desert occupies a long strip between the Pacific Ocean and the Andes Mountains.","chinese":"海岸荒漠佔領長條狀的之間的太平洋和安第斯山脈。"},{"english":"Then cut the remaining stick in two, lengthwise.","chinese":"然後縱向把火柴切成兩長條。"},{"english":"After rolling, these inclusions turn from ball-like shape to chain-like and dot-linked shapes.","chinese":"夾雜形狀經軋製後由球形逐漸變爲長條形和點鏈狀。"},{"english":"I cut down a big tree, and then began to make a long hole in it.","chinese":"我砍倒了一棵大樹，然後開始掏成一個長條形洞。"},{"english":"A length of yarn, cord, or thread, especially a strong silk thread used mainly to bind the edges of buttonholes .","chinese":"在弄斷線，長條或粗紗的紡織過程中使結合在一起。"},{"english":"This type of small gold \"Cube Money\" was produced by cutting segments from a larger sheet or bar of gold.","chinese":"這種又稱“印子金”的金片是自大塊或長條金版切割。"},{"english":"Long pieces of squared-off metal, normally stainless steel, which are used in building construction.","chinese":"長條的金屬，通常是不鏽鋼，用於建築。"},{"english":"Then I asked for a three-penny loaf, and was told they had none such.","chinese":"於是我就要買三便士的長條麪包，可他們說沒有。"},{"english":"The paintings hang in a single, long space in the gallery.","chinese":"畫作在畫廊裏一條單獨的，長條狀的過道展覽。"},{"english":"Roll out thin on a floured board.","chinese":"在撒了麪粉的板上磋成細長條。"},{"english":"The hematomas had crescent or long ribbon shape.","chinese":"血腫呈新月形及長條狀。"},{"english":"The alloying layer was formed on the saw blade tooth of 20 steel by ion penetrating W and Mo.","chinese":"鋸的主要部分，長條形薄鋼片，上面有許多尖齒。"},{"english":"Then use the tip of the squeegee to clear a narrow strip at the top.","chinese":"然後用清潔刷的頂端從頂部開一小塊狹長條。"},{"english":"Add juice to tall glass of ice. Fill with cola, stir add long twist of lime.","chinese":"檸檬汁入加冰高杯，入可樂，直調後飾萊姆長條。"},{"english":"The street-facing elevation incorporates windows that divide the surface into horizontal bands.","chinese":"臨街立面採用的窗戶把表面分成了水平的長條。"},{"english":"Little Ran, come down take the wash raiment of chip tore growth to your three uncles tie up up.","chinese":"少冉，下來拿件乾淨衣裳撕成長條給你三叔包紮上。"}],"related":[{"definition":["cube\/block\/square\/rectangle\/diamond ♦ (in card games)"],"pinyin":["fang1 kuai4"],"word":"方塊"},{"definition":["(bird species of China) mandarin duck (Aix galericulata)\/(fig.) affectionate couple\/happily married couple"],"pinyin":["yuan1 yang1"],"word":"鴛鴦"},{"definition":["lace\/decorative border"],"pinyin":["hua1 bian1"],"word":"花邊"},{"definition":["circle"],"pinyin":["yuan2 quan1"],"word":"圓圈"},{"definition":["vague\/faint\/indistinct"],"pinyin":["yin3 yue1"],"word":"隱約"},{"definition":["both ends\/both parties to a deal"],"pinyin":["liang3 tou2"],"word":"兩頭"},{"definition":["(of alcohol) to go to one's head\/(old) (of a bride-to-be) to bind one's hair into a bun\/(of a prostitute) to receive a patron for the first time","above\/on top of\/on the surface of"],"pinyin":["shang4 tou2","shang4 tou5"],"word":"上頭"},{"definition":["round\/circular"],"pinyin":["yuan2 xing2"],"word":"圓形"},{"definition":["two sides\/both sides"],"pinyin":["liang3 ce4"],"word":"兩側"},{"definition":["decorative design"],"pinyin":["hua1 wen2"],"word":"花紋"},{"definition":["strewn at random\/disorderly\/untidy\/irregular\/uneven"],"pinyin":["cuo4 luo4"],"word":"錯落"},{"definition":["four sides"],"pinyin":["si4 bian1"],"word":"四邊"},{"definition":["vein lines (in marble or fingerprint)\/grain (in wood etc)"],"pinyin":["wen2 li3"],"word":"紋理"},{"definition":["roof\/topmost part\/top (of tree, wall etc)\/apex"],"pinyin":["ding3 bu4"],"word":"頂部"},{"definition":["spotlessly white\/pure white"],"pinyin":["jie2 bai2"],"word":"潔白"},{"definition":["waist"],"pinyin":["yao1 jian1"],"word":"腰間"}]}