{"definition":["long-term peace and stability (of governments)"],"pinyin":["chang2 zhi4 jiu3 an1"],"simplified":["长治久安"],"rank":25473.0,"normalized_rank":0.35640031900158103,"fraction":0.000001418318622590533,"cumulative_fraction":0.984976073149498,"word":"長治久安","characters":[{"definition":["chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance","length\/long\/forever\/always\/constantly"],"pinyin":["chang2","zhang3"],"word":"長"},{"definition":["to rule\/to govern\/to manage\/to control\/to harness (a river)\/to treat (a disease)\/to wipe out (a pest)\/to punish\/to research"],"pinyin":["zhi4"],"word":"治"},{"definition":["(long) time\/(long) duration of time"],"pinyin":["jiu3"],"word":"久"},{"definition":["content\/calm\/still\/quiet\/safe\/secure\/in good health\/to find a place for\/to install\/to fix\/to fit\/to bring (a charge against sb)\/to pacify\/to harbor (good intentions)\/security\/safety\/peace\/ampere","surname An"],"pinyin":["An1","an1"],"word":"安"}],"containing_words":[],"sentences":[{"english":"It is only a magic weapon for petrochemical enterprise to be stable long time.","chinese":"安全文化是石化企業長治久安的唯一法寶。"},{"english":"Whether Saab will survive in the long term is less clear.","chinese":"薩博能否長治久安尚不明朗。"},{"english":"How in-depth public opinion, meaning people can shun long-term stability.","chinese":"如何深入民意，順意民心纔可以長治久安。"},{"english":"Without the rule of law, there will not be long-term order and security.","chinese":"不實行法制，社會難以實現長治久安。"},{"english":"In order to defend the social stability and security, police should be armed with science and technology.","chinese":"爲維護社會的長治久安，應提倡科技興警。"},{"english":"The seas and oceans bear on the enduring peace, lasting stability and sustainable development of China.","chinese":"海洋關係國家長治久安和可持續發展。"},{"english":"Law is the principal factor that can keep a country lastingly stable and peaceful.","chinese":"法律是一個國家維持長治久安的主要條件。"}],"related":[]}