{"definition":["remarkable (progress, improvement, expansion etc)"],"pinyin":["chang2 zu2"],"simplified":["长足"],"rank":12590.0,"normalized_rank":0.17615043442978467,"fraction":0.000005647582428034432,"cumulative_fraction":0.9473903203242552,"word":"長足","characters":[{"definition":["chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance","length\/long\/forever\/always\/constantly"],"pinyin":["chang2","zhang3"],"word":"長"},{"definition":["excessive","foot\/to be sufficient\/ample"],"pinyin":["ju4","zu2"],"word":"足"}],"containing_words":[{"definition":["rapid progress"],"pinyin":["chang2 zu2 jin4 bu4"],"word":"長足進步"}],"sentences":[{"english":"The plastic surgery industry has been amply augmented.","chinese":"近年來，整形外科手術業得到了長足的發展。"},{"english":"And it was the poems composing in play itself to get considerable development in the Tang Dynasty too.","chinese":"並且戲作詩本身也是在唐代得到長足的發展的。"},{"english":"Since the 20th century, a great progress has been made in research on infiltration and runoff yield.","chinese":"20世紀以來，入滲與產流研究取得了長足進展。"},{"english":"Over the past 3 decades, China-EU relations have made substantial progress.","chinese":"30年來，中歐關係取得了長足發展。"},{"english":"Since China' s reform and opening policy, the non-state running enterprises of Wenzhou have made great progress.","chinese":"改革開放以來，溫州民營經濟取得了長足的進展。"},{"english":"After she changed schools, she began to make much better progress.","chinese":"她轉學以後，開始有長足的進步。"},{"english":"Tonight, I cannot help but marvel at how far we have come together.","chinese":"今晚，我不禁對雙方交往的長足進展感到驚歎。"},{"english":"But next year on Broadway I hope to see a large improvement in that.","chinese":"不過明年到百老匯混的話，我一定要有長足的進步。"},{"english":"To be sure, Europe has come far over the past 10 years.","chinese":"誠然，過去10年歐洲已經有了長足進步。"},{"english":"He also noted that he hopes bilateral friendship will make long-term progress in the future.","chinese":"他還希望雙邊友好關係在未來取得長足進展。"},{"english":"Big Blue has come a long way since 1984.","chinese":"“藍色巨人”自1984年來有了長足的進步。"},{"english":"This paper has analyzed the difficulties, which the development of natural food plant spices industry has faced.","chinese":"近年來天然食用植物香料工業獲得了長足的發展。"},{"english":"Reportage in China has made great progress in the new period. However, masterpieces that can shake the world haven't yet appearers.","chinese":"新時期我國報告文學有長足發展，但優秀之作不多。"},{"english":"Along with the official education, the private developed as well.","chinese":"在官學的帶動下，私學教育也獲得了長足發展。"},{"english":"He has made considerable progress in his studies at the university.","chinese":"他在大學的學業上有了長足的進展。"},{"english":"This study provides a theoretical basis for developing attractant of C. buqueti.","chinese":"本研究爲研製長足大竹象取食引誘劑提供了理論依據。"}],"related":[]}