{"definition":["a long talk"],"pinyin":["chang2 tan2"],"simplified":["长谈"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"長談","characters":[{"definition":["chief\/head\/elder\/to grow\/to develop\/to increase\/to enhance","length\/long\/forever\/always\/constantly"],"pinyin":["chang2","zhang3"],"word":"長"},{"definition":["surname Tan","to speak\/to talk\/to converse\/to chat\/to discuss"],"pinyin":["Tan2","tan2"],"word":"談"}],"containing_words":[],"sentences":[{"english":"Jim and I have just had a long talk.","chinese":"我和吉姆剛進行過一次長談。"},{"english":"A long conversation with a friend.","chinese":"和好友的一次促膝長談。"},{"english":"I spent 4 hours chatting with my grandmother in-law last night.","chinese":"昨晚，我和丈夫的祖母促膝長談了4個小時。"},{"english":"I have long talked with him on the subject.","chinese":"關於這個問題我已經和他作過一次長談。"},{"english":"I've really enjoyed our long talks together at lunch.","chinese":"我十分喜愛我們在午飯後的長談。"},{"english":"Whenthe employee leaves your office after a long talk stand up to say good- bye.","chinese":"當僱員和你長談之後要離開你辦公室時，起身道別。"},{"english":"Time alone with a good book.","chinese":"和好友的一次促膝長談。"},{"english":"Call a friend you haven't spoken to recently and have a good long chat.","chinese":"給一個近來沒聯繫過的朋友打電話，美美的長談一番。"},{"english":"But it’s OK to have long talks with your children.","chinese":"但是和孩子進行一次長談是可以的。"},{"english":"I had a long talk with her that night.","chinese":"那天晚上，我和她秉燭長談。"},{"english":"I went down to meet him at the end of last season and had a long chat with him.","chinese":"上賽季末我去探望過他，並跟他促膝長談過。"},{"english":"Just want to pull a long process bite gold, but female manager came after.","chinese":"正想拉住程咬金長談一番，不料女掌櫃追了過來。"},{"english":"When the employee leaves your office after a long talk, stand up to say good- bye.","chinese":"當僱員和你長談之後要離開你辦公室時，起身道別。"},{"english":"We used to have long phone talks about our babies to share some fun and loss.","chinese":"我們過去常常在電話里長談我們的寶寶，分享樂與失。"},{"english":"As a good long talk with a few old friends.","chinese":"比和幾個老朋友促膝長談更加有效。"},{"english":"On New Year's Eve, my father and my uncle talked about their work together.","chinese":"除夕那天，我的爸爸和叔叔促膝長談他們的工作。"}],"related":[]}