{"definition":["door\/strategic gateway\/portal\/faction\/sect\/family status\/family\/web portal\/(old) brothel"],"pinyin":["men2 hu4"],"simplified":["门户"],"rank":5909.0,"normalized_rank":0.08267457641347083,"fraction":0.000018952567250738376,"cumulative_fraction":0.8782879050177567,"word":"門戶","characters":[{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["Men2","men2"],"word":"門"},{"definition":["a household\/door\/family"],"pinyin":["hu4"],"word":"戶"}],"containing_words":[{"definition":["to form one's own group or school of thought\/to set up one's own business\/to establish oneself"],"pinyin":["zi4 li4 men2 hu4"],"word":"自立門戶"},{"definition":["sectarian bias\/parochialism"],"pinyin":["men2 hu4 zhi1 jian4"],"word":"門戶之見"},{"definition":["open door policy\/Egyptian President Sadat's infitah policy towards investment and relations with Israel"],"pinyin":["men2 hu4 kai1 fang4"],"word":"門戶開放"},{"definition":["to be dependent upon sb"],"pinyin":["bang4 ren2 men2 hu4"],"word":"傍人門戶"},{"definition":["to live apart from parents (of married couple)\/to achieve independence"],"pinyin":["du2 li4 men2 hu4"],"word":"獨立門戶"},{"definition":["web portal"],"pinyin":["men2 hu4 wang3 zhan4"],"word":"門戶網站"}],"sentences":[{"english":"In addition to governance concerns, this part discusses staffing and portal operations.","chinese":"除管理問題外，本部分還討論員工管理和門戶操作。"},{"english":"Portal-based access.","chinese":"基於門戶的訪問。"},{"english":"In this article we provide you with some common sense guidelines for setting your own portal governance strategy.","chinese":"本文將向您介紹設置門戶管理策略的一些常識性指南。"},{"english":"What kinds of operating systems can you use to implement the portal?","chinese":"可以使用哪幾種操作系統實現門戶？"},{"english":"This person creates virtual portals and typically manages the shared resources.","chinese":"這個人創建了虛擬門戶並且往往管理這一共享資源。"},{"english":"In the beginning, the search engine is only an accessorial tool in some famous portal sites.","chinese":"起初，搜索引擎只是一些著名門戶網站的輔助工具。"},{"english":"Yongdeng County, which has a long history, is the gateway of the Hexi Corridor.","chinese":"永登縣歷史悠久，是通往河西走廊的門戶。"},{"english":"Design constraints indicate anything unique in a customer environment to which the portal will need to conform.","chinese":"設計限制表示門戶需要遵循的客戶環境中的特殊要求。"},{"english":"Lu'anzhou port under construction will be the largest gateway to the outside world of Changzhou.","chinese":"在建的常州錄安洲港，是常州最大的對外開放門戶。"},{"english":"I want a portal combined or integrated with a business directory.","chinese":"我希望有一個門戶網站合併或企業目錄中。"},{"english":"The function of stomata in plants is controlling gas exchange and modulating water balance.","chinese":"氣孔是植物控制氣體交換和調節水分散失的門戶。"},{"english":"One portal implementation might address the needs of many user communities.","chinese":"一個門戶實現可以滿足許多用戶羣體的需求。"},{"english":"Myself also thinks the website of trade family status that does verticality has an outlook.","chinese":"我自己也認爲做垂直性的行業門戶網站是有前途的。"},{"english":"Massive data dumps and even friendly online government portals are insufficient.","chinese":"大量的數據轉儲和甚而友好的網上政府門戶是不足的。"},{"english":"One of the top five news portals is Google News.","chinese":"五大新聞門戶網站之一是谷歌新聞。"},{"english":"Organizations typically have a very clear picture of what purpose a portal should serve.","chinese":"組織對於門戶所應具有的用途通常是非常明確的。"}],"related":[{"definition":["hub (e.g. of traffic network)\/hinge\/pivot\/fulcrum"],"pinyin":["shu1 niu3"],"word":"樞紐"},{"definition":["area\/region\/district"],"pinyin":["qu1 yu4"],"word":"區域"},{"definition":["to link\/to join\/to attach\/connection\/a link (on web page)"],"pinyin":["lian2 jie1"],"word":"連接"},{"definition":["inland\/interior"],"pinyin":["nei4 lu4"],"word":"內陸"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["strategy"],"pinyin":["zhan4 lu:e4"],"word":"戰略"},{"definition":["radiation"],"pinyin":["fu2 she4"],"word":"輻射"},{"definition":["to link\/to join\/link\/connection"],"pinyin":["xiang1 lian2"],"word":"相連"},{"definition":["railtrack connection\/to integrate into sth\/to dock\/to connect\/to be in step with\/to bring into line with\/to align"],"pinyin":["jie1 gui3"],"word":"接軌"},{"definition":["domain\/territory"],"pinyin":["ban3 tu2"],"word":"版圖"},{"definition":["fulcrum (for a lever)"],"pinyin":["zhi1 dian3"],"word":"支點"},{"definition":["border\/edge\/boundary\/interval\/between\/inter-\/to meet\/time\/occasion\/to meet with (circumstances)"],"pinyin":["ji4"],"word":"際"},{"definition":["external\/foreign\/pertaining to external or foreign (affairs)"],"pinyin":["dui4 wai4"],"word":"對外"},{"definition":["dealings\/contacts\/to go back and forth"],"pinyin":["wang3 lai2"],"word":"往來"},{"definition":["way\/channel"],"pinyin":["tu2 jing4"],"word":"途徑"},{"definition":["one's conduct\/deed\/activity\/accomplishment\/achievement\/to act as\/as (in the capacity of)\/qua\/to view as\/to look upon (sth as)\/to take sth to be"],"pinyin":["zuo4 wei2"],"word":"作為"}]}