{"definition":["ticket (for theater, cinema etc)"],"pinyin":["men2 piao4"],"simplified":["门票"],"rank":3790.0,"normalized_rank":0.05302701719530452,"fraction":0.00003567678602742936,"cumulative_fraction":0.8234266967886411,"word":"門票","characters":[{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["Men2","men2"],"word":"門"},{"definition":["ticket\/ballot\/banknote\/CL:張|张[zhang1]\/person held for ransom\/amateur performance of Chinese opera\/classifier for groups, batches, business transactions"],"pinyin":["piao4"],"word":"票"}],"containing_words":[],"sentences":[{"english":"I finally reach Leifeng, the entry fee a bargain 40 yuan.","chinese":"最後我來到雷鋒塔，門票很便宜，只要40元。"},{"english":"It' really surprises me that Xiao gives me an ticket of Olympic.","chinese":"確實比較驚喜，老肖居然送我一張奧運門票。"},{"english":"The Shanghai Expo ticket sales in Hong Kong was officially launched three months ago.","chinese":"三個月前，上海世博會的門票正式在香港開售。"},{"english":"You will have to re-submit your Request List but the ticket availability may have changed in the new round.","chinese":"重新提交時，門票的有無情況可能會有所變化。"},{"english":"Right now the Disney park charge visitors exorbitant price for food gifts and entry.","chinese":"現在迪斯尼公園的食物，禮品，門票都超貴。"},{"english":"Note: All purchasers must adhere to this ticket limit.","chinese":"所有購票者必須遵守此門票限額。"},{"english":"All the way so far there were only 'private' beach areas, with pricey entry fees.","chinese":"到目前爲止整條路還是私人浴場區，門票極爲昂貴。"},{"english":"A fantasy novel can be a ticket to a land of magic.","chinese":"奇幻小說就像一張通向魔法世界的門票。"},{"english":"Our tickets showed that our visit time was 9:15.","chinese":"我們拿到的門票顯示我們參觀的時間是在9點15。"},{"english":"He brought no milk with him, but two tickets for a bull-fight down on their table.","chinese":"他沒帶來牛奶，卻把兩張鬥牛門票放在了桌上。"},{"english":"That my father-in-law has season tickets to UNC basketball games?","chinese":"我的岳父有北卡洛來納大學籃球比賽的門票嗎？"},{"english":"Details of the matches and ticketing options will be released soon.","chinese":"比賽詳情以及於日門票預訂事宜將後公佈。"},{"english":"I spent RM200 on tickets for the baseball game with my family.","chinese":"我花了200令吉買全家人的棒球賽門票。"},{"english":"But his flying fingers definitely sell tickets.","chinese":"但他那翻飛的手指決定了門票的收入。"},{"english":"Design a ticket or an advertisement for the Ming Tombs.","chinese":"讓每名學生設計一張十三陵的門票或宣傳廣告。"},{"english":"We showed our tickets and were allowed to pass in.","chinese":"我們出示了門票，就讓我們進去了。"}],"related":[{"definition":["ticket price\/fare\/admission fee"],"pinyin":["piao4 jia4"],"word":"票價"},{"definition":["free (of charge)"],"pinyin":["mian3 fei4"],"word":"免費"},{"definition":["to enter the venue for a meeting\/to enter into an examination\/to enter a stadium, arena etc"],"pinyin":["ru4 chang3"],"word":"入場"},{"definition":["to buy tickets\/(Tw) to buy votes (in an election)"],"pinyin":["mai3 piao4"],"word":"買票"},{"definition":["to place an order\/to book ahead"],"pinyin":["yu4 ding4"],"word":"預訂"},{"definition":["privilege\/favorable (terms)\/preferential (treatment)\/discount (price)"],"pinyin":["you1 hui4"],"word":"優惠"},{"definition":["air ticket\/passenger ticket\/CL:張|张[zhang1]"],"pinyin":["ji1 piao4"],"word":"機票"},{"definition":["to sign up\/to enter one's name\/to apply\/to register\/to enroll\/to enlist"],"pinyin":["bao4 ming2"],"word":"報名"},{"definition":["shopping"],"pinyin":["gou4 wu4"],"word":"購物"},{"definition":["at one's own expense\/self-funded"],"pinyin":["zi4 fei4"],"word":"自費"},{"definition":["on that day","the same day"],"pinyin":["dang1 tian1","dang4 tian1"],"word":"當天"},{"definition":["the scene (of a crime, accident etc)\/(on) the spot\/(at) the site"],"pinyin":["xian4 chang3"],"word":"現場"},{"definition":["price"],"pinyin":["jia4 qian5"],"word":"價錢"},{"definition":["to exercise\/to move about\/to operate\/to use connections (personal influence)\/loose\/shaky\/active\/movable\/activity\/campaign\/maneuver\/behavior\/CL:項|项[xiang4],個|个[ge4]"],"pinyin":["huo2 dong4"],"word":"活動"},{"definition":["to agree\/to conclude\/to draw up\/to subscribe to (a newspaper etc)\/to order"],"pinyin":["ding4"],"word":"訂"},{"definition":["booking\/reservation\/to book\/to make an appointment"],"pinyin":["yu4 yue1"],"word":"預約"}]}