{"definition":["lit. flash point\/crucial point\/essential point"],"pinyin":["shan3 guang1 dian3"],"simplified":["闪光点"],"rank":28992.0,"normalized_rank":0.4056356945979601,"fraction":0.0000010289962917497601,"cumulative_fraction":0.9892499169164319,"word":"閃光點","characters":[{"definition":["surname Shan","to dodge\/to duck out of the way\/to beat it\/shaken (by a fall)\/to sprain\/to pull a muscle\/lightning\/spark\/a flash\/to flash (across one's mind)\/to leave behind\/(Internet slang) (of a display of affection) \"dazzlingly\" saccharine"],"pinyin":["Shan3","shan3"],"word":"閃"},{"definition":["light\/ray\/CL:道[dao4]\/bright\/only\/merely\/to use up"],"pinyin":["guang1"],"word":"光"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[],"sentences":[{"english":"A great way to break up the classic black party dress is to add shine.","chinese":"打破老派黑色派對裝魔咒的一大法寶就是增加閃光點。"},{"english":"And all the sparkles plus the pink is a bit yuck.","chinese":"那些閃光點加上裙子的粉色看得我直觳觫。"},{"english":"Just be yourself you have the shinning point that makes you outstand.","chinese":"做自己，你有閃光點，那纔是讓你出衆的地方。"},{"english":"This is where Draven shines.","chinese":"這就是德萊文的閃光點。"},{"english":"Sometimes, some humor also shines through in the search results.","chinese":"有時，你會在結果中看到一些幽默詼諧的閃光點。"},{"english":"Personally, this is where Metroplex really shines.","chinese":"個人認爲，這纔是大都市的閃光點。"},{"english":"But in broad-brush personality terms, the real you is probably shining through.","chinese":"但是真正的你其實渾身上下充滿了閃光點。"},{"english":"Another bright spot in many troubled cities is temporary jobs.","chinese":"在那些困難城市的另一個閃光點就是臨時工作。"}],"related":[]}