{"definition":["to flash\/to sparkle\/to appear suddenly"],"pinyin":["shan3 chu1"],"simplified":["闪出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"閃出","characters":[{"definition":["surname Shan","to dodge\/to duck out of the way\/to beat it\/shaken (by a fall)\/to sprain\/to pull a muscle\/lightning\/spark\/a flash\/to flash (across one's mind)\/to leave behind\/(Internet slang) (of a display of affection) \"dazzlingly\" saccharine"],"pinyin":["Shan3","shan3"],"word":"閃"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"Down came the hammer and out flew the sparks.","chinese":"錘子敲下來，閃出了火花。"},{"english":"Bigamy lightened the horizon of his shadowy thoughts for a moment.","chinese":"一時間，在他的思想中模模糊糊閃出了重婚這個念頭。"},{"english":"He flashed pride from filmy eyes.","chinese":"他朦朧的眼中閃出驕傲的光芒。"},{"english":"He spoke with firmness, but his face was very sad and his eyes were dim.","chinese":"他講得很堅定，但臉色很悽傷，雙眼閃出悲觀的神情。"},{"english":"A bit of grease shone on her bottom lip, but she didn't wipe it away.","chinese":"她的脣下閃出一抹油膩的光澤，但她沒有去擦。"},{"english":"She interrupted him with a gleam of joy in her eyes.","chinese":"她立刻打斷了他的話，眼裏閃出了快樂的光。"},{"english":"If they move from their positions, the glyph flares with searing light.","chinese":"當他們一離開原地，符文就會閃出灼熱的光芒。"},{"english":"In such a night, through which came a dim Yanmou where innocence.","chinese":"在這樣一個夜晚，透過朦朧的眼眸裏所閃出的純真。"},{"english":"He took a step forward, and one of the disks shimmered.","chinese":"博茲朝前走上一步，接着某一塊碟片閃出微光。"},{"english":"The President's eyes gleamed with anger as he listened to the farmer's complaint.","chinese":"總統聽到農夫的控訴時，眼睛裏閃出憤怒的火花。"},{"english":"And a number of the sentiment indexes are, or very close to, flashing outright sell signals.","chinese":"而且一些情緒指數正在名趨於閃出直接的賣出信號。"},{"english":"It's enriched with organic chamomile which brings out natural highlights leaving your baby's hair soft and shiny.","chinese":"本品富含有機洋柑橘幫助寶寶頭髮柔軟閃出自然光澤。"},{"english":"A good idea suddenly flashed through my mind.","chinese":"我的腦中突然閃出一個好主意。"},{"english":"I saw the sudden flare of a flashlight in the darkness.","chinese":"我看到手電筒在黑暗中突然閃出的亮光。"}],"related":[]}