{"definition":["flash point (chemistry)"],"pinyin":["shan3 dian3"],"simplified":["闪点"],"rank":51302.0,"normalized_rank":0.7177815398821933,"fraction":1.2495684859381393e-7,"cumulative_fraction":0.9991348889945086,"word":"閃點","characters":[{"definition":["surname Shan","to dodge\/to duck out of the way\/to beat it\/shaken (by a fall)\/to sprain\/to pull a muscle\/lightning\/spark\/a flash\/to flash (across one's mind)\/to leave behind\/(Internet slang) (of a display of affection) \"dazzlingly\" saccharine"],"pinyin":["Shan3","shan3"],"word":"閃"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[],"sentences":[{"english":"High flash point which ensures a safety working environment even under high current erosion operation.","chinese":"高閃點，就算是高電流量電蝕也極爲安全。"},{"english":"Its high flash point and non-toxic nature insure safety in its application.","chinese":"其高閃點和無毒性確保應用安全。"},{"english":"High flash point which ensures a safety working environment even under high current erosion operations.","chinese":"高閃點，就算是高電流量電蝕也極爲安全。"},{"english":"The flash point must be high, the display must be small, satisfies the fire protection the safety requirements.","chinese":"閃點要高，發揮性要小，以滿足防火的安全要求。"},{"english":"This paper introduces the development of close flash point instruments for penetrant, which is an electronic thermometer with data display.","chinese":"本文介紹一種滲透液閉口閃點測量儀器的研製。"},{"english":"The original OFP had a really unhelpful UI.","chinese":"原版閃點行動中的用戶界面並不非常有用。"}],"related":[]}