{"definition":["to close\/to shut up"],"pinyin":["bi4 shang5"],"simplified":["闭上"],"rank":14826.0,"normalized_rank":0.20743497544527306,"fraction":0.000004229555760697624,"cumulative_fraction":0.9583043605150748,"word":"閉上","characters":[{"definition":["to close\/to stop up\/to shut\/to obstruct"],"pinyin":["bi4"],"word":"閉"},{"definition":["on top\/upon\/above\/upper\/previous\/first (of multiple parts)\/to climb\/to get onto\/to go up\/to attend (class or university)","see 上聲|上声[shang3 sheng1]"],"pinyin":["shang3","shang4"],"word":"上"}],"containing_words":[{"definition":["Shut up!"],"pinyin":["bi4 shang5 zui3 ba1"],"word":"閉上嘴巴"}],"sentences":[{"english":"With the eyes nine-tenths closed, focus at the tip of your nose.","chinese":"眼睛閉上十分之九，注意力集中在鼻尖。"},{"english":"So I just shut my mouth and waited.","chinese":"所以我就閉上我的嘴巴，靜靜的等待。"},{"english":"His breathing slowed and he closed his eyes.","chinese":"索皮的呼吸變得緩慢了，它閉上了眼睛。"},{"english":"I haven't told anyone, so keep your mouth shut.","chinese":"我沒有告訴任何人，所以閉上你的嘴。"},{"english":"When we start to play this game, please close your eyes.","chinese":"當我們開始做這個遊戲時請閉上你們的眼睛。"},{"english":"Her eyes were vair, And never closed when I kiss her.","chinese":"在我吻她時，她從不閉上毛茸茸的雙眼。"},{"english":"Shut the other eye, please.","chinese":"請把另一隻眼睛也閉上。"},{"english":"I can't open my eyes to watch you jumping into the fiery pit, for I will shut my eyes at the time.","chinese":"我不會眼睜睜看着你往火坑裏跳，到時候我會閉上的。"},{"english":"Close your eyes as you do this.","chinese":"這麼做的時候，閉上你的眼睛。"},{"english":"If you want a new friend you should close one eye.","chinese":"如果想要交一個新朋友，則要閉上一隻眼睛。"},{"english":"Closing your eyes and breathing into your belly, imagine roots growing from your feet deep into the ground.","chinese":"閉上雙眼，氣沉丹田，想象雙足深深紮根於大地。"},{"english":"Now then - hold out your hands and close your eyes.","chinese":"喏，伸出你的手，閉上你的眼睛。"},{"english":"Her body relaxed and her eyes closed.","chinese":"她的身體鬆弛下來，閉上了雙眼。"},{"english":"Close your eyes and for ten to fifteen minutes and practice deep, slow, and comfortable breathing into your lower abdomen.","chinese":"閉上雙眼，從腹部由內而外慢慢深呼吸十至十五分鐘。"},{"english":"Your eyes close, I die.","chinese":"你眼睛閉上，我死了。"},{"english":"These my eyes an easy death shall close.","chinese":"在我從容就義之後，我的眼睛將永遠閉上。"}],"related":[]}