{"definition":["closure (math.)"],"pinyin":["bi4 bao1"],"simplified":["闭包"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"閉包","characters":[{"definition":["to close\/to stop up\/to shut\/to obstruct"],"pinyin":["bi4"],"word":"閉"},{"definition":["surname Bao","to cover\/to wrap\/to hold\/to include\/to take charge of\/to contract (to or for)\/package\/wrapper\/container\/bag\/to hold or embrace\/bundle\/packet\/CL:個|个[ge4],隻|只[zhi1]"],"pinyin":["Bao1","bao1"],"word":"包"}],"containing_words":[],"sentences":[{"english":"You could actually use a closure to do the resource setup and cleanup instead.","chinese":"實際上可以使用閉包代替該方法來建立和清除資源。"},{"english":"This closure will be executed as soon as the initial page finishes loading.","chinese":"這個閉包在在初始頁面加載完成後立即執行。"},{"english":"I'll also circle back to some interesting comparisons between closures and higher-order functions in a later installment.","chinese":"後續內容還會對閉包與高階函數做一些有趣的對比。"},{"english":"We can disable this behavior by defining the closure to be static.","chinese":"我們可以通過將閉包定義爲靜態閉包禁用此行爲。"},{"english":"Now let's explore some of the spicier aspects of closures.","chinese":"現在我們來研究閉包的一些更刺激的方面。"},{"english":"The closure can include indirect relation paths as well.","chinese":"這種閉包也可以包含間接關聯路徑。"},{"english":"Note that you can use closures and reference variables later too.","chinese":"注意，稍後您也可以使用閉包和引用變量。"},{"english":"What's so special about closures?","chinese":"閉包有什麼特別之處？"},{"english":"For the function, we are once again using the shorthand closure notation.","chinese":"對於這個函數，我們再次使用了一個簡短的閉包註釋。"},{"english":"That way every new domain class created already has the fields and event closures in place.","chinese":"這樣，新創建域類時它們就有適當的字段和事件閉包。"},{"english":"The names of these closures should speak for themselves.","chinese":"這些閉包名稱反映了它們的含義。"},{"english":"Closures are one of the common features of functional languages.","chinese":"閉包是函數語言的共有特徵之一。"},{"english":"So closures in C# are awesome, and expressive and great.","chinese":"所以閉包在c#中是可怕的，富於表現力的和偉大的。"},{"english":"I don't want to hardcode the tax rate into the closure.","chinese":"我不想將稅率硬編碼到閉包裏。"},{"english":"When a nested function is used in this way, it is often explicitly called a closure.","chinese":"當某個內嵌函數被這樣使用時，它通常就被稱作閉包。"},{"english":"Consequently, the closure I passed in is executed for each iteration.","chinese":"所以，每個迭代都要執行我傳遞進去的閉包。"}],"related":[]}