{"definition":["to close the passes\/to seal off the country\/seclusion (monastic practice, e.g. of Chan Buddhists)"],"pinyin":["bi4 guan1"],"simplified":["闭关"],"rank":29358.0,"normalized_rank":0.4107565094511214,"fraction":9.957133928252394e-7,"cumulative_fraction":0.9896204722175864,"word":"閉關","characters":[{"definition":["to close\/to stop up\/to shut\/to obstruct"],"pinyin":["bi4"],"word":"閉"},{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["Guan1","guan1"],"word":"關"}],"containing_words":[{"definition":["to close the passes and seal off the country\/to close a country to exclude foreign contact"],"pinyin":["bi4 guan1 suo3 guo2"],"word":"閉關鎖國"},{"definition":["close the country to international intercourse"],"pinyin":["bi4 guan1 zi4 shou3"],"word":"閉關自守"},{"definition":["closed-door policy"],"pinyin":["bi4 guan1 zheng4 ce4"],"word":"閉關政策"}],"sentences":[{"english":"The closed-door policy of the Qing dynasty closed people's visions and minds.","chinese":"閉關鎖國政策封禁了人們的眼界和思想。"},{"english":"The ancient civilization became a byword for isolation and stagnation.","chinese":"閉關鎖國，停滯不前成了這個文明古國的代名詞。"},{"english":"One when he was probably kind of forced into six months retreat.","chinese":"他可能被逼去做了六個月的閉關而做的夢。"},{"english":"No country can develop healthily with its door closed.","chinese":"閉關鎖國，任何一個國家都不能健康的發展。"},{"english":"Yet these advantages could all be frittered away if the nation were to close its borders.","chinese":"如果我們閉關鎖國，排斥移民，這些優勢將蕩然無存。"},{"english":"When Bankei held his seclusion-weeks of meditation, pupils from many parts of Japan came to attend.","chinese":"盤珪閉關時，總有弟子從各地趕來一同打坐。"},{"english":"Turkmenistan's shackling is typical of broader failure in the region.","chinese":"土庫曼斯坦的閉關鎖國是這個區域更大的失敗。"},{"english":"I am looking for a very nice website design for our yoga retreat center.","chinese":"我想給我們的瑜伽閉關中心網站設計非常漂亮。"},{"english":"He proceeds to shut Japan off from the rest of the world, something his successors continue for 250 years.","chinese":"他從閉關鎖國中獲益，他的繼承人延續到250年後。"},{"english":"A retreat practice written by Yogi Chen based on traditional Chan training.","chinese":"陳上師所作，基於傳統禪修訓練的閉關修法。"},{"english":"The close-door policy couldn't steer a country to prosperity.","chinese":"閉關自守的政策不能引導國家走向繁榮。"},{"english":"By afternoon, I closed our doors started to review, the placement test is imminent.","chinese":"到了下午，我閉關房門開始複習，分班考試迫在眉睫。"},{"english":"A closed economy will not put a country on the way to prosperity .","chinese":"閉關自守的經濟不會使一個國家富起來。"},{"english":"As a consequence, the country declined into poverty and ignorance.","chinese":"長期閉關自守，把中國搞得貧窮落後，愚昧無知。"},{"english":"We pursued the policy of “self-seclusion” in the past, resulting in “the destitution of the people and exhaustion of the financial resource”.","chinese":"過去實行“閉關自守”政策，結果搞得“民窮財困”。"},{"english":"All of us come down on the closed door policy of the government.","chinese":"我們所有的人都對政府的閉關政策。"}],"related":[{"definition":["(of Taoists) to practice austerities\/to practice asceticism"],"pinyin":["xiu1 lian4"],"word":"修煉"},{"definition":["to confess\/to repent\/remorse\/repentance\/penitent\/confession (Buddhism)"],"pinyin":["chan4 hui3"],"word":"懺悔"},{"definition":["to sit quietly\/to meditate\/to stage a sit-in"],"pinyin":["jing4 zuo4"],"word":"靜坐"},{"definition":["used for 師傅|师傅 (in Taiwan)\/master\/qualified worker"],"pinyin":["shi1 fu5"],"word":"師父"},{"definition":["there"],"pinyin":["na4 'r"],"word":"那兒"},{"definition":["at last\/in the end\/finally\/eventually"],"pinyin":["zhong1 yu2"],"word":"終於"},{"definition":["meditation"],"pinyin":["jing4 xin1"],"word":"靜心"},{"definition":["(in the) past\/former\/previous\/to go over\/to pass by","(verb suffix)"],"pinyin":["guo4 qu4","guo4 qu5"],"word":"過去"},{"definition":["termination\/to finish\/to end\/to conclude\/to close"],"pinyin":["jie2 shu4"],"word":"結束"},{"definition":["week\/religious service\/worship\/CL:個|个[ge4]"],"pinyin":["li3 bai4"],"word":"禮拜"},{"definition":["(of alcohol) to ferment\/(of a crisis) to be brewing\/to mull over (an issue)\/to hold exploratory discussions"],"pinyin":["yun4 niang4"],"word":"醞釀"},{"definition":["to read a book\/to study\/to attend school"],"pinyin":["du2 shu1"],"word":"讀書"},{"definition":["to learn\/to study"],"pinyin":["xue2 xi2"],"word":"學習"},{"definition":["to review (a lesson etc)"],"pinyin":["wen1 xi2"],"word":"溫習"},{"definition":["magic transformation performed by Daoist immortal\/fig. to reveal\/to enlighten"],"pinyin":["dian3 hua4"],"word":"點化"},{"definition":["so-called\/what is called"],"pinyin":["suo3 wei4"],"word":"所謂"}]}