{"definition":["to start\/to set in motion\/to move\/to march\/to dig in (eating)\/to tuck in (eating)"],"pinyin":["kai1 dong4"],"simplified":["开动"],"rank":19881.0,"normalized_rank":0.2781609838680341,"fraction":0.0000024261481584453127,"cumulative_fraction":0.9745513470443656,"word":"開動","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"}],"containing_words":[],"sentences":[{"english":"His mind reached after an understanding of the problem.","chinese":"他開動腦筋，想弄懂這個問題。"},{"english":"That mixture is enough to move his jeep; however, whenever the car moves, it exhales food smell.","chinese":"當車子開動時，總是會散發出食物的味道。"},{"english":"Depress this button in case of fire.","chinese":"他按下按鈕開動了機器。"},{"english":"We lowered interest rates and began printing more money.","chinese":"我們降低了利率，開動機器狂印美元。"},{"english":"There are plans for more building projects in many of the Jewish suburbs.","chinese":"而以政府在猶太郊區計劃開動更多的建設項目。"},{"english":"Toyota’s assembly plants reopened after being shut down for just two days.","chinese":"關門僅僅兩天之後豐田的組裝線就重新開動了。"},{"english":"Once under way, it was like riding along in a skip – until we reached full speed.","chinese":"車一開動就好像是在蹦跳着前進，直到加快到了全速。"},{"english":"I hurt it the very moment I was getting into the moving tram.","chinese":"我是在硬擠上已開動的電車時碰傷的。"},{"english":"In Sweden, there is a train that works mainly on cattle.","chinese":"在瑞典，就有一種主要靠牲口開動的火車。"},{"english":"Do you know how to work the machine for lifting the platform?","chinese":"你知道怎樣開動機器，升起平臺？"},{"english":"The worker depressed the lever to start the machine.","chinese":"工人壓下控制桿開動機器。"},{"english":"The machine will start instantly you press the button.","chinese":"你一按電鈕機器就會開動。"},{"english":"We got to the stine prior to train hiszheimeris disease left.","chinese":"火車尚未開動之前，我們就到了車站。"},{"english":"So I need to do something intelligent to exercise my brain.","chinese":"所以我得做點開動腦筋的事情讓大腦也得到鍛鍊。"},{"english":"While the world is not so crowded, while the car is not actuate.","chinese":"趁世界還不那麼擁擠，趁汽車還未開動。"},{"english":"Brainstorm ideas for the script.","chinese":"開動腦筋，爲劇本想些點子。"}],"related":[{"definition":["to start out on a trip\/to dispatch troops"],"pinyin":["chu1 dong4"],"word":"出動"},{"definition":["to announce\/to read (the news)"],"pinyin":["bo1 bao4"],"word":"播報"},{"definition":["to finish\/to end\/to complete"],"pinyin":["wan2 bi4"],"word":"完畢"},{"definition":["to ignite\/to light a fire\/to agitate\/to start an engine\/ignition\/fig. to stir up trouble"],"pinyin":["dian3 huo3"],"word":"點火"},{"definition":["cabin of a plane"],"pinyin":["ji1 cang1"],"word":"機艙"},{"definition":["to act with confusion\/to be in a flurry\/to be flustered"],"pinyin":["shou3 mang2 jiao3 luan4"],"word":"手忙腳亂"},{"definition":["to get on or into (a bus, train, car etc)"],"pinyin":["shang4 che1"],"word":"上車"},{"definition":["preparation\/to prepare\/to intend\/to be about to\/reserve (fund)"],"pinyin":["zhun3 bei4"],"word":"準備"},{"definition":["to be eager to give sth a try (idiom)"],"pinyin":["yue4 yue4 yu4 shi4"],"word":"躍躍欲試"},{"definition":["to cry out in alarm or surprise"],"pinyin":["jing1 hu1"],"word":"驚呼"},{"definition":["car door\/door of bus, railway carriage etc"],"pinyin":["che1 men2"],"word":"車門"},{"definition":["to overtake\/to catch up with\/to hurry\/to rush\/to try to catch (the bus etc)\/to drive (cattle etc) forward\/to drive (sb) away\/to avail oneself of (an opportunity)\/until"],"pinyin":["gan3"],"word":"趕"},{"definition":["to dash (run fast)\/to rush\/to dart"],"pinyin":["fei1 ben1"],"word":"飛奔"},{"definition":["departure (of a coach or train)\/to dispatch a vehicle"],"pinyin":["fa1 che1"],"word":"發車"},{"definition":["to prepare\/to make ready\/preparation\/preparatory"],"pinyin":["yu4 bei4"],"word":"預備"},{"definition":["automatic\/voluntarily"],"pinyin":["zi4 dong4"],"word":"自動"}]}