{"definition":["prologue of play\/opening remarks\/preamble (of speeches, articles etc)"],"pinyin":["kai1 chang3 bai2"],"simplified":["开场白"],"rank":21113.0,"normalized_rank":0.2953982622808613,"fraction":0.0000021303974864230383,"cumulative_fraction":0.9773526061737422,"word":"開場白","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"},{"definition":["surname Bai","white\/snowy\/pure\/bright\/empty\/blank\/plain\/clear\/to make clear\/in vain\/gratuitous\/free of charge\/reactionary\/anti-communist\/funeral\/to stare coldly\/to write wrong character\/to state\/to explain\/vernacular\/spoken lines in opera"],"pinyin":["Bai2","bai2"],"word":"白"}],"containing_words":[],"sentences":[{"english":"By way of an introduction, I'd just like to give some historical background for this issue.","chinese":"作爲開場白，我來解釋一下這件事的歷史背景。"},{"english":"In other words, this kind of question is often a lead-in to a suggestion or invitation.","chinese":"換言之，這種問題通常是建議或邀請的開場白。"},{"english":"I'm talking about intros that ooze with concern.","chinese":"我講的是富有關懷的開場白。"},{"english":"But he ain’t had time to get good started yet.","chinese":"可是眼下，他恐怕還沒來得及準備好開場白呢。"},{"english":"Opening remarks from IR head. Standard disclosures, etc.","chinese":"說開場白的是IR的老闆，關於標準披露等等。"},{"english":"The introduction to a persuasive speech is very important.","chinese":"說服性演講的開場白很重要。"},{"english":"The Ambassador's witty opening remarks soon broke the silence.","chinese":"但劉大使的風趣開場白很快打破了現場的肅靜。"},{"english":"He prefaced his speech with an amusing story.","chinese":"他以一個有趣的故事作爲開場白。"},{"english":"The truth is in my boxer shorts\" isn't a very good chat - up line.\"","chinese":"是個很好的開場白。"},{"english":"Forgetting the introductory remarks really mortified me.","chinese":"忘記了開場白真使我窘迫。"},{"english":"This is a gambit for leadership in the region.","chinese":"這就是地區領導者的開場白。"},{"english":"She prefaced her remarks with a few words of welcome to the guest.","chinese":"她先講了幾句對於客人暗示接待的話作爲開場白。"},{"english":"I'm trying to think of some chat-up lines.","chinese":"我正在想搭訕的開場白。"},{"english":"It was all God's grace. He started with these words.","chinese":"都是主的恩典，這是他的開場白。"},{"english":"It was unusual for a junior to reject such an opening.","chinese":"一位下級拒絕這樣的開場白是很少見的。"},{"english":"Sometimes the best and most fun ice breaker is honesty.","chinese":"有時候最好也最有趣的開場白就是大實話。"}],"related":[{"definition":["Zen saying repeated as cant\/(fig.) catchphrase\/mantra\/favorite expression\/stock phrase"],"pinyin":["kou3 tou2 chan2"],"word":"口頭禪"},{"definition":["friendly advice\/words spoken on sb's behalf\/a good word\/kind words\/words that sound fine but are not followed up with actions"],"pinyin":["hao3 hua4"],"word":"好話"},{"definition":["lit. to open the door and see the mountain; fig. to get right to the point (idiom)"],"pinyin":["kai1 men2 jian4 shan1"],"word":"開門見山"},{"definition":["It is said that ... (at the start of a narrative)\/to discuss\/to recount"],"pinyin":["hua4 shuo1"],"word":"話說"},{"definition":["polite phrase\/conventional greetings\/cliché\/to try to worm facts out of sb"],"pinyin":["tao4 hua4"],"word":"套話"},{"definition":["a lie\/untrue statement\/misstatement"],"pinyin":["jia3 hua4"],"word":"假話"},{"definition":["to tell the truth\/to tell it as it is"],"pinyin":["shi2 hua4 shi2 shuo1"],"word":"實話實說"},{"definition":["to quarrel\/to bicker\/glib repartee"],"pinyin":["dou4 zui3"],"word":"鬥嘴"},{"definition":["unpleasant talk\/malicious words"],"pinyin":["huai4 hua4"],"word":"壞話"},{"definition":["(speak) without thinking the matter through"],"pinyin":["sui2 kou3"],"word":"隨口"},{"definition":["long-winded\/wordy\/troublesome\/pesky\/also pr. [luo1 suo1]"],"pinyin":["luo1 suo5"],"word":"囉嗦"},{"definition":["lit. two segments with a single cut (idiom)\/fig. to make a clean break (idiom)"],"pinyin":["yi1 dao1 liang3 duan4"],"word":"一刀兩斷"},{"definition":["to be a real headache\/to find sth a real headache\/to beat one's brains"],"pinyin":["shang1 nao3 jin1"],"word":"傷腦筋"},{"definition":["unimportant\/not serious\/it doesn't matter\/never mind\/it looks all right, but"],"pinyin":["bu4 yao4 jin3"],"word":"不要緊"},{"definition":["to play tricks on\/to make fun of\/to tease"],"pinyin":["xi4 nong4"],"word":"戲弄"},{"definition":["hard to say\/unpleasant to say\/can't be sure"],"pinyin":["bu4 hao3 shuo1"],"word":"不好說"}]}