{"definition":["(of a bus, train etc) to leave for\/heading for"],"pinyin":["kai1 wang3"],"simplified":["开往"],"rank":8087.0,"normalized_rank":0.11314762217900465,"fraction":0.000011762147284400185,"cumulative_fraction":0.910829319491264,"word":"開往","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["to go (in a direction)\/to\/towards\/(of a train) bound for\/past\/previous"],"pinyin":["wang3"],"word":"往"}],"containing_words":[],"sentences":[{"english":"The teminal station is Xinzhuang. Next stop is People's square.","chinese":"本次列車開往莘莊，下一站人民廣場。"},{"english":"The bus for the railroad station, I think it's no. 36.","chinese":"乘開往火車站的大衆汽車，我想是36路吧。"},{"english":"Conductor: Yes, you take the train to Songjiazhuang direction, and go nine stops.","chinese":"是的，你坐開往宋家莊方向的列車，一種九站路。"},{"english":"There are also about five long-distance buses daily to Dali and Lijiang.","chinese":"每天大約有5班長途班車開往大理和麗江。"},{"english":"A : Sorry, all the trains from here to Shanghai are through trains.","chinese":"對不起，從這裏開往上海的列車都是過路車。"},{"english":"The ship was for Dalian.","chinese":"這破船開往大連。"},{"english":"The next day, we drove inland.","chinese":"第二天，我們乘車開往內陸。"},{"english":"The terminal station is Xinzhuang , next stop is South Huangpi Road.","chinese":"本次列車開往莘莊，下一站，黃陂南路。"},{"english":"Which bus goes to Tainan in the morning?","chinese":"那一號公車在早晨時開往臺南？"},{"english":"The trolleybus connects here with a bus for the airport.","chinese":"這輛無軌電車與開往機場的公共汽車銜接。"},{"english":"On the train to Beijing, XuAiLian and ZhangSheng meet and alternate goodwill.","chinese":"在開往北京的火車上，徐愛蓮與張升相遇並互生好感。"},{"english":"The train on platform 3 is for London, calling at Didcot and Reading.","chinese":"站臺的火車開往倫敦，在迪科特和雷丁停車。"},{"english":"On a brigantine going to New Orleans.","chinese":"一條準備開往新奧爾良的雙桅船。"},{"english":"After plundering enough pelf, he took a train bound for the border.","chinese":"在搶得足夠的錢財後，他乘上開往邊境的火車。"},{"english":"From Simao we drove southward through the mountains towards Jinghong.","chinese":"我們的車了從思茅往南開，通過叢山，開往景洪。"},{"english":"This train connects with the one leaving for London half an hour later.","chinese":"坐這班火車可換乘半小時後開往倫敦的那趟車。"}],"related":[]}