{"definition":["to open and close"],"pinyin":["kai1 he2"],"simplified":["开合"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"開合","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"}],"containing_words":[{"definition":["variant of 信口開河|信口开河[xin4 kou3 kai1 he2]"],"pinyin":["xin4 kou3 kai1 he2"],"word":"信口開合"}],"sentences":[{"english":"Opening and closing of these three knives is accomplished by a thumb stud.","chinese":"開合這三把刀可以用拇指柱來完成。"},{"english":"Since mediaeval times, velar and guttural and its opening closing mouth have had many transformations.","chinese":"中古以來牙喉音及其開合口發生了許多變化。"},{"english":"The invention relates to an auto on-off loose-leaf wind power machine which can gather energy to increase the speed.","chinese":"本發明涉及一種聚能增速自動開合活葉式風力機。"},{"english":"And to her it seemed that the angle of his jaw had changed; its pitch had become unpleasantly aggressive.","chinese":"在她眼裏他那下齶已棱角畢露，開合時咄咄逼人。"},{"english":"My old artificial hand had a pretty basic open-close mechanism similar to a clamp.","chinese":"我的舊人工手有一個基本的開合機構，如同一個夾子。"},{"english":"Open-system equipment using digital input automatic adjustment function.","chinese":"設備的開合系統採用數字輸入自動調節功能。"},{"english":"Healthy valves open and close in coordination with the pumping action of your heart's atria and ventricles.","chinese":"健康瓣膜的開合會嚴密配合心房與心室的泵血動作。"},{"english":"\" Another way of referencing the situation is to say that a woman is \"losing patency.","chinese":"還有一種說法叫做婦女正在失去開合度。"},{"english":"Trunnion bascule bridges are doubtless one of the renowned bridge types in Chicago.","chinese":"耳軸開合橋是芝加哥最出名的橋的種類之一。"},{"english":"It is essential that all press fasteners for each garment are opened and closed to test their function.","chinese":"每一件衣服上所有的按扣都必需經過開合功能測試。"},{"english":"Of cupboard door close, what performing empty and fact alternately is Thespian.","chinese":"櫃門的開合，交替上演着虛與實的戲劇。"},{"english":"Ups and downs of leisure vertical direction in the plane with no open cooperation.","chinese":"休閒的起落在平面的垂直方向上沒有開合作用。"},{"english":"Wang Mei opens and closes the diamond as she counts.","chinese":"王梅一邊數數，一邊開合“寶石建議。”"},{"english":"The more complex movable ways are, the greater probability of collision happens.","chinese":"開合移動方式越複雜，碰撞事故概率越大。"},{"english":"The fixing of female and male head brings with stable self-locking mechanism, separating and combining smoothly.","chinese":"公母頭的固定帶有穩定的自鎖機構，開合自如。"},{"english":"This telescopic umbrella has 8 ribs, the auto release\/close button is fitted into the handle.","chinese":"這種摺疊傘傘架有8根，開合傘的按鈕在傘柄中。"}],"related":[{"definition":["to align\/(typography) to justify"],"pinyin":["dui4 qi2"],"word":"對齊"},{"definition":["what is true and what is false\/(to get to know) the real situation"],"pinyin":["xu1 shi2"],"word":"虛實"},{"definition":["to sway\/to swing\/to move back and forth\/to oscillate"],"pinyin":["bai3 dong4"],"word":"擺動"},{"definition":["to blend into one another\/to blend together well"],"pinyin":["hun2 ran2 yi1 ti3"],"word":"渾然一體"},{"definition":["intricate\/complicated\/tangled\/involved\/to synthesize"],"pinyin":["cuo4 zong1"],"word":"錯綜"},{"definition":["to arrange"],"pinyin":["pu1 pai2"],"word":"鋪排"},{"definition":["to lengthen and shorten\/flexible\/adjustable\/retractable\/extensible\/telescoping (collapsible)"],"pinyin":["shen1 suo1"],"word":"伸縮"},{"definition":["to be quick-witted"],"pinyin":["ling2 dong4"],"word":"靈動"},{"definition":["changeable\/changing\/varied\/full of changes"],"pinyin":["bian4 hua4 duo1 duan1"],"word":"變化多端"},{"definition":["countless changes\/constant permutation"],"pinyin":["qian1 bian4 wan4 hua4"],"word":"千變萬化"},{"definition":["strewn at random\/disorderly\/untidy\/irregular\/uneven"],"pinyin":["cuo4 luo4"],"word":"錯落"},{"definition":["oblique attack (brush movement in painting)"],"pinyin":["ce4 feng1"],"word":"側鋒"},{"definition":["to mark off\/interval\/segment (e.g. of market)\/compartment\/segmentation"],"pinyin":["qu1 ge2"],"word":"區隔"},{"definition":["to crisscross\/to intertwine"],"pinyin":["jiao1 cuo4"],"word":"交錯"},{"definition":["to rotate\/to revolve\/to spin\/to whirl"],"pinyin":["xuan2 zhuan3"],"word":"旋轉"},{"definition":["dexterous\/deft\/easy\/light and easy to use\/nimble\/agile\/lithe\/graceful"],"pinyin":["qing1 qiao3"],"word":"輕巧"}]}