{"definition":["to launch\/to develop\/to unfold\/(of an exhibition etc) to open"],"pinyin":["kai1 zhan3"],"simplified":["开展"],"rank":611.0,"normalized_rank":0.008548682719348565,"fraction":0.0002521329950488098,"cumulative_fraction":0.5427084291215712,"word":"開展","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["surname Zhan","to spread out\/to open up\/to exhibit\/to put into effect\/to postpone\/to prolong\/exhibition"],"pinyin":["Zhan3","zhan3"],"word":"展"}],"containing_words":[],"sentences":[{"english":"Further eytogenetic analysis and breeding utilization of this intergeneric hybrid are still being carried out.","chinese":"目前正進一步開展細胞遺傳和育種利用研究。"},{"english":"Sepals oblong or linear, erect or spreading, base of lateral pair saccate .","chinese":"萼片長圓形或線形，直立或開展，基於側配對。"},{"english":"To perform shift and work overtime when necessary.","chinese":"開展本班次工作和必要時延時工作。"},{"english":"Launch an effort to get together the various departments.","chinese":"開展將各個部門聚集在一起的工作。"},{"english":"The report said the pipeline agency was hampered by a chronic inspector shortage.","chinese":"報告說，長期缺乏檢查員妨礙了管道安全局開展工作。"},{"english":"What persuaded you to start Global Voices in Bangla?","chinese":"是什麼使你決心開展孟加拉版的全球之聲？"},{"english":"Objective To evaluate the effectiveness of health education on HIV\/AIDS-related knowledge, attitude, and performance (KAP) in Jianghua Yao Autonomous County.","chinese":"目的對江華縣開展艾滋病防治健康教育進行效果評價。"},{"english":"The government will phase out an advertising campaign.","chinese":"政府將分階段開展廣告宣傳。"},{"english":"If we recover the waste materials through grading recovery, we can create these renewable resources.","chinese":"如果我們開展分級回收，就能夠創造這些再生資源。"},{"english":"How do you campaign?","chinese":"如何開展一場競選？"},{"english":"Hold feeding programs with non-profit organizations.","chinese":"和非營利組織一起開展供養項目。"},{"english":"Now a mass movement to plant trees is in full swing all over the country.","chinese":"羣衆性的技術革新運動正在該廠蓬勃開展。"},{"english":"So making the study of slag mucks as silicon fertilizer was significant.","chinese":"因此，開展工礦廢渣作硅肥的研究具有重要意義。"},{"english":"He gathered up his strength for the new job.","chinese":"他鼓足勁頭來開展新的工作。"},{"english":"The Hainan example represents the first province-wide spatial planning.","chinese":"海南省是全國第一個開展省域空間規劃的改革試點。"},{"english":"I heard that a mass campaign encouraging show love to the victims of earthquake-stricken area is now widespread.","chinese":"我聽說爲地震災區的災民獻愛心的活動在廣泛開展。"}],"related":[{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["to impel\/to carry forward\/to push on\/to advance\/to drive forward"],"pinyin":["tui1 jin4"],"word":"推進"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落實"},{"definition":["to unfold\/to carry out\/to be in full swing\/to launch"],"pinyin":["zhan3 kai1"],"word":"展開"},{"definition":["active\/energetic\/vigorous\/positive (outlook)\/proactive"],"pinyin":["ji1 ji2"],"word":"積極"},{"definition":["to start (a machine)\/(fig.) to set in motion\/to launch (an operation)\/to activate (a plan)"],"pinyin":["qi3 dong4"],"word":"啟動"},{"definition":["to implement\/to carry out"],"pinyin":["shi2 shi1"],"word":"實施"},{"definition":["to reinforce\/to strengthen\/to increase"],"pinyin":["jia1 qiang2"],"word":"加強"},{"definition":["to combine\/to join\/unite\/alliance"],"pinyin":["lian2 he2"],"word":"聯合"},{"definition":["to advance together"],"pinyin":["bing4 jin4"],"word":"並進"},{"definition":["project"],"pinyin":["zhuan1 an4"],"word":"專案"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["by means of\/through\/via\/to pass through\/to get through\/to adopt\/to pass (a bill or inspection etc)\/to switch over"],"pinyin":["tong1 guo4"],"word":"通過"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["to implement\/to carry out\/to execute\/to run"],"pinyin":["zhi2 xing2"],"word":"執行"}]}