{"definition":["wide open"],"pinyin":["kai1 chang3"],"simplified":["开敞"],"rank":41980.0,"normalized_rank":0.5873546653981224,"fraction":3.1925306994704564e-7,"cumulative_fraction":0.9971822748862684,"word":"開敞","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["open to the view of all\/spacious\/to open wide\/to disclose"],"pinyin":["chang3"],"word":"敞"}],"containing_words":[],"sentences":[{"english":"The second chapter for urban open space of relevant basic research.","chinese":"第二章爲城市開敞空間的相關基礎研究。"},{"english":"The powerhouse is designed to be of shaft and semi-underground type and the substation of open type.","chinese":"廠房採用豎井半地下式佈置，開敞式變電站。"},{"english":"The open spaces differ according to aspect.","chinese":"開敞空地隨方位而不同。"},{"english":"Among all factors influencing its actual functions and effects, the structure of the Green Open Space is undoubtedly the crucial one.","chinese":"而綠色開敞空間的結構是決定其功能能否優化的關鍵。"},{"english":"The maximum inscribed circle diameter on the steel bar pitch of the grating .","chinese":"鋼格板開敞通孔的最大內接圓直徑。"},{"english":"Chapter four is optimization countermeasures on open space of yanji city.","chinese":"第四章爲延吉市開敞空間的優化對策。"},{"english":"The kitchen has slide away windows that open directly to the garden.","chinese":"廚房擁有向花園開敞的推拉窗。"},{"english":"The hallway runs through the entire house with a single-arm open staircase rising to the top of the building.","chinese":"走廊貫穿整個房屋，單臂開敞樓梯上到建築的頂部。"},{"english":"Contrary to the widely opened living room, the library on the semi-basement is a space for silence and moderation.","chinese":"與開敞的起居室相反，書房是安靜舒適的半地下空間。"},{"english":"Its expansive atmosphere aims to fill the role of an inviting open space on Ginza Dori .","chinese":"開敞的氣氛是爲了在銀座大街的露天廣場吸引遊人。"},{"english":"PSCO: Are you sure that the liferafts can be transferred from side to side on a single open deck?","chinese":"你確認救生筏能在單一開敞甲板舷對舷移動嗎？"},{"english":"Downstairs, the architects included an open-concept kitchen, living and dining space.","chinese":"樓下包括開敞式的廚房，起居室和餐廳。"},{"english":"The third chapter of open space for research in yanji city.","chinese":"第三章爲延吉市開敞空間特徵研究。"},{"english":"Barn B, meanwhile is an open-air shed made from a lattice frame of locally harvested bamboo.","chinese":"農舍B是一個當地產柱子構架起來的開敞倉庫。"}],"related":[]}