{"definition":["to start a war\/to make war\/to battle against"],"pinyin":["kai1 zhan4"],"simplified":["开战"],"rank":8723.0,"normalized_rank":0.12204608733367844,"fraction":0.000010387038039360784,"cumulative_fraction":0.9178493397737676,"word":"開戰","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["to fight\/fight\/war\/battle"],"pinyin":["zhan4"],"word":"戰"}],"containing_words":[],"sentences":[{"english":"He's got a new movie opening soon.","chinese":"他的另一部新作馬上要開戰首映。"},{"english":"The waiting is over. The World Cup is about to kick off.","chinese":"漫長的等待終於結束了，南非世界盃即將鳴鑼開戰。"},{"english":"We will wage guerrilla warfare against the Burmese army if conflict breaks out.","chinese":"如果開戰，我們會針對緬甸政府軍發起游擊戰。"},{"english":"Edward struck first, and overwhelmed the younger de Montfort.","chinese":"愛德華首先開戰，並打敗了年輕的孟福爾。"},{"english":"But his move also underscores the frustration of trying to do battle against the amorphous online community.","chinese":"但是他的行動卻是試圖與整個無組織的網絡社區開戰。"},{"english":"The White House made no comment Friday on the anniversary of the start of the war.","chinese":"星期五，白宮對伊戰開戰紀念日無任何評論。"},{"english":"China is despo to show off her military power, looking for a reason to start war.","chinese":"中國急切想炫耀軍事實力，正在找一個理由開戰。"},{"english":"Zaiyi advised to kill the foreigners and fight against the foreign countries.","chinese":"主張殺洋人，殺教民，與外國開戰。"},{"english":"The ancient Greeks sacrificed lambs or calves to the gods before engaging in battle.","chinese":"古希臘人在開戰前用羊羔或牛犢祭神。"},{"english":"Warring with the mainstream media is standard republican foolery.","chinese":"對主流媒體開戰是共和黨典型的愚蠢行爲。"},{"english":"Constantine went to war with the other guy on the other side, and he won.","chinese":"君士坦丁和對面的傢伙開戰，勝利了。"},{"english":"By 1958, Communist-led guerrillas known as the Viet Cong had begun to battle the South Vietnamese government.","chinese":"1958年，越共遊擊隊即越共開始與南越政府開戰。"},{"english":"Rukia sighed and started working, for once not trying to start a fight.","chinese":"露琪亞嘆了口氣，然後開始工作，這一次不要開戰。"},{"english":"War of resistance against aggression wins, country in all battle, does Chinese whereto go?","chinese":"抗戰勝利，國共開戰，中國向何處去？"},{"english":"A TAX dispute as old as mail-order catalogues turned into warfare this month.","chinese":"一項跟郵購目錄一樣古老的稅務糾紛在這個月開戰了。"},{"english":"\"Do you disapprove, nanna?\" Justine growled, ready to do battle.","chinese":"“你不贊成嗎？外婆？”賈斯丁咆哮着，準備開戰了。"}],"related":[{"definition":["(of a sports competition or match) to commence\/(of a war or battle) to break out\/to perform acrobatic or choreographed fighting (in Chinese opera)\/to brawl\/to come to blows"],"pinyin":["kai1 da3"],"word":"開打"},{"definition":["hostile\/enemy (factions)\/combative"],"pinyin":["di2 dui4"],"word":"敵對"},{"definition":["war\/to wage war"],"pinyin":["da4 zhan4"],"word":"大戰"},{"definition":["to fight\/fight\/war\/battle"],"pinyin":["zhan4"],"word":"戰"},{"definition":["to negotiate\/negotiation\/talks\/conference\/CL:個|个[ge4]"],"pinyin":["tan2 pan4"],"word":"談判"},{"definition":["to declare war"],"pinyin":["xuan1 zhan4"],"word":"宣戰"},{"definition":["war\/conflict\/CL:場|场[chang2],次[ci4]"],"pinyin":["zhan4 zheng1"],"word":"戰爭"},{"definition":["decisive battle\/to fight a decisive battle\/to fight for supremacy in ..."],"pinyin":["jue2 zhan4"],"word":"決戰"},{"definition":["battlefield\/CL:個|个[ge4]"],"pinyin":["zhan4 chang3"],"word":"戰場"},{"definition":["utterly defeated\/routed\/crushed\/to collapse (of army)"],"pinyin":["kui4 bai4"],"word":"潰敗"},{"definition":["odds of success\/stratagem that ensures success\/to be sure of success"],"pinyin":["sheng4 suan4"],"word":"勝算"},{"definition":["to leave a place where some event is taking place\/(of an actor) to exit\/(sports) to leave the field\/(of an audience) to leave"],"pinyin":["tui4 chang3"],"word":"退場"},{"definition":["army\/troops\/CL:支[zhi1],個|个[ge4]"],"pinyin":["jun1 dui4"],"word":"軍隊"},{"definition":["peace talks"],"pinyin":["he2 tan2"],"word":"和談"},{"definition":["to expel\/to deport\/banishment"],"pinyin":["qu1 zhu2"],"word":"驅逐"},{"definition":["to start\/to launch\/to unleash\/to mobilize\/to arouse"],"pinyin":["fa1 dong4"],"word":"發動"}]}