{"definition":["to dig out\/to excavate\/to scoop out"],"pinyin":["kai1 wa1"],"simplified":["开挖"],"rank":15910.0,"normalized_rank":0.2226015418409749,"fraction":0.00000371104323008404,"cumulative_fraction":0.9626076774568264,"word":"開挖","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["to dig\/to excavate\/to scoop out"],"pinyin":["wa1"],"word":"挖"}],"containing_words":[],"sentences":[{"english":"This article aims to analyze various processing methods for groundwater excavation of the foundation ditch in earthwork construction.","chinese":"分析土方工程施工中基坑開挖地下水的各種處理辦法。"},{"english":"The temporary concrete lining guard wall method was used in excavating vertical shaft.","chinese":"豎井開挖採用了臨時混凝士襯砌護壁措施。"},{"english":"At Futang hydropower station, the cylinder restricted surge tank is 31.","chinese":"福堂水電站圓筒阻抗式調壓井工程開挖直徑31。"},{"english":"In this paper, the excavation work of deep foundation pit for the north concrete anchor of south branch of Runyang Bridge is introduced.","chinese":"介紹了潤揚大橋南汊北錨碇深基坑工程開挖實例。"},{"english":"The excavation of inclined shaft was always difficult in the construction of Pumped-Storage Power Station.","chinese":"在抽水蓄能電站中斜井開挖施工歷來是一個難點。"},{"english":"The paper will generally analyze and discuss the non-digging pulling pipe construction technology.","chinese":"本文將針對非開挖拉管施工技術進行整體的分析探討。"},{"english":"The paper has certain refernce value for actual application of blasting excavation of rock in engineering.","chinese":"本文對岩石爆破開挖的實際應用具有一定價值。"},{"english":"High speed decoiler with cantilever support, adopting ground recoiling reduces the heavy labor of excavating a pit.","chinese":"採用高速懸臂開卷，地面放卷，減少開挖地坑之苦。"},{"english":"The excavation of the left-bank diversion tunnel of Longtan Hydropower Project adopts the excavation by layer.","chinese":"龍灘水電站左岸導流洞開挖採用分層開挖法。"},{"english":"The excavation of the left-bank diversion tunnel of Longtan Hydropower Project adopts the excavation by layer.","chinese":"龍灘水電站左岸導流洞開挖採用分層開挖法。"},{"english":"Deep-hole blasting was used to excavate soil-rock in some project in Shenzhen.","chinese":"深圳某土石方開挖工程採用中深孔爆破方式。"},{"english":"Excavate side earth should ensure the stability of the slope and upright.","chinese":"在開挖槽邊棄土時，應保證邊坡和直立幫的穩定。"},{"english":"Britain had already dug thousands of miles of canals to connect the different shires .","chinese":"英國已經開挖了數千裏的運河連接不同的郡。"},{"english":"From the top of the unexcavated acropolis, I had a bird's eye view of the whole city.","chinese":"我從還未開挖的衛城高處俯瞰這整座失落的城市。"},{"english":"Prior to foundation pit excavation, the culvert section shall be prefabricated and carried to position.","chinese":"基坑開挖前涵節預製並按序運至工點擺放。"},{"english":"Tunnel discharge disaster is a severe problem of Zoumaling tunnel.","chinese":"重慶走馬嶺隧道開挖中岩溶湧水災害是一個突出問題。"}],"related":[{"definition":["pipeline\/general term for pipes, cables etc"],"pinyin":["guan3 xian4"],"word":"管線"},{"definition":["unit in charge of construction\/builder"],"pinyin":["shi1 gong1 dan1 wei4"],"word":"施工單位"},{"definition":["form of a mountain"],"pinyin":["shan1 ti3"],"word":"山體"},{"definition":["farmland"],"pinyin":["nong2 di4"],"word":"農地"},{"definition":["to construct\/to erect"],"pinyin":["jia4 she4"],"word":"架設"},{"definition":["to build\/to construct"],"pinyin":["xing1 jian4"],"word":"興建"},{"definition":["to investigate\/to survey"],"pinyin":["kan1 ce4"],"word":"勘測"},{"definition":["to lay (railroad tracks, carpet, pipeline)\/to install (wiring, cable)\/to construct (road, concrete slab)"],"pinyin":["pu1 she4"],"word":"鋪設"},{"definition":["roadway\/floor\/deck\/bridge floor"],"pinyin":["qiao2 mian4"],"word":"橋面"},{"definition":["to drive a vehicle\/movement of vehicles"],"pinyin":["xing2 che1"],"word":"行車"},{"definition":["front window\/store front","paving\/pavement"],"pinyin":["pu1 mian4","pu4 mian4"],"word":"鋪面"},{"definition":["gutter"],"pinyin":["pai2 shui3 gou1"],"word":"排水溝"},{"definition":["building"],"pinyin":["lou2 yu3"],"word":"樓宇"},{"definition":["to repair in a rush\/rush repairs"],"pinyin":["qiang3 xiu1"],"word":"搶修"},{"definition":["track (railroad, streetcar etc)"],"pinyin":["lu4 gui3"],"word":"路軌"},{"definition":["to park (a vehicle) (loanword)\/parking\/parked car"],"pinyin":["bo2 che1"],"word":"泊車"}]}