{"definition":["to go (of car, train etc)\/to drive off"],"pinyin":["kai1 zou3"],"simplified":["开走"],"rank":17893.0,"normalized_rank":0.250346284610972,"fraction":0.0000029687469974911145,"cumulative_fraction":0.9692061778532184,"word":"開走","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["to walk\/to go\/to run\/to move (of vehicle)\/to visit\/to leave\/to go away\/to die (euph.)\/from\/through\/away (in compound verbs, such as 撤走[che4 zou3])\/to change (shape, form, meaning)"],"pinyin":["zou3"],"word":"走"}],"containing_words":[],"sentences":[{"english":"When we got to the railway station, the train had left.","chinese":"我們到火車站時，火車已經開走了。"},{"english":"He ran to the station only to find the train had left.","chinese":"他跑到火車站卻發現火車已開走。"},{"english":"She stared towards them and they ran to his car and sped off.","chinese":"她緊盯着他們，他們倆嚇得趕緊跑進車開走了。"},{"english":"Before I got to the bus stop, the bus had already left.","chinese":"到了公交車站前，汽車已經開走了。"},{"english":"You've missed the bus, it just went by.","chinese":"你錯過了公共汽車，它剛開走。"},{"english":"I had hardly entered the station before the last train left.","chinese":"我剛一到車站最後一班火車就開走了。"},{"english":"I sent the Willys to find out if the major's alive.","chinese":"我看着威利斯開走去找那個少校，希望他還活着。"},{"english":"Soon we heard the sound of the lorry revving up and moving off.","chinese":"不一會兒，我們聽到了卡車起動和開走的聲音。"},{"english":"When ZhangHui got to the railway station yesterday morning, the train had already left.","chinese":"張輝趕到火車站時，火車已經開走了。"},{"english":"Check your rear-view mirror before you drive away.","chinese":"開走之前先看看後視鏡。"},{"english":"The last bus having gone，we had to walk home.","chinese":"末班公共汽車已開走了，我們只好走路回家。"},{"english":"A great screaming, and then, slip away.","chinese":"接着一聲尖叫，然後滑至一邊開走。"},{"english":"She ran to the station only to find that the train had left.","chinese":"她跑到火車站，但火車卻開走了。"},{"english":"When the cars vanished, the street was open its entire length and width.","chinese":"車子都開走後，整個街道都露了出來。"},{"english":"I crossed the motorway and watched as he drove off.","chinese":"我穿過了高速公路，看着他開走了。"},{"english":"The train which left just now is going to Sichuan Prov.","chinese":"剛剛開走的那列火車是開往四川的。"}],"related":[]}