{"definition":["to open up\/to set up\/to establish"],"pinyin":["kai1 pi4"],"simplified":["开辟"],"rank":5713.0,"normalized_rank":0.07993228212052103,"fraction":0.000019806390390253822,"cumulative_fraction":0.8744916892435713,"word":"開闢","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["to open (a door)\/to open up (for development)\/to dispel\/to refute\/to repudiate"],"pinyin":["pi4"],"word":"闢"}],"containing_words":[{"definition":["pioneer\/groundbreaker"],"pinyin":["kai1 pi4 zhe3"],"word":"開闢者"}],"sentences":[{"english":"This process will certainly open up broad prospects for theoretical innovation.","chinese":"這一過程必將爲理論創新開闢廣闊前景。"},{"english":"So that a new way to produce high-purity manganese carbonate is opened up.","chinese":"從而爲高純度碳酸錳的製備開闢了一條新的途徑。"},{"english":"This example indicates a new way of finding new insecticidal crystal protein.","chinese":"這爲尋找新異殺蟲晶體蛋白基因開闢了新的思路。"},{"english":"As a result, the supervisory organs became dependency on the government and powerful ministers came into being.","chinese":"監察機構成了政府的附庸，爲權臣的產生開闢了道路。"},{"english":"The concept of satellite network has provided new application directions and developable space for small satellites.","chinese":"衛星組網爲小衛星開闢了新的應用方向和發展空間。"},{"english":"For the new air route opened up and religious reform provided the necessary conditions.","chinese":"爲新航路的開闢和宗教改革提供了必要的條件。"},{"english":"The new road was hacked out of the jungle.","chinese":"這條新路是在叢林地帶開闢出來的。"},{"english":"In this paper, a new way is indicated to the exploitation and utilization of Macrocarpiam officinale.","chinese":"本研究爲山茱萸的開發利用開闢了新的途徑。"},{"english":"Ferry lines across the Huangpu River will be completed within three months.","chinese":"三個月後還將開闢橫渡黃浦江的渡輪線。"},{"english":"They used axes to clear a path through the forest.","chinese":"他們用斧子開闢出一條穿過森林的小道。"},{"english":"This study opens up a new area for mulching materials for dry land wheat.","chinese":"該項研究爲旱地小麥覆蓋材料開闢了新的領域。"},{"english":"A stream of clear brook opened another realm.","chinese":"一澗清澈的小溪開闢的另一番境界裏。"},{"english":"Non- motorized access will be in the \"three vertical and three horizontal\" peripheral gradually open up.","chinese":"非機動車通道將在“三橫三縱”的周邊陸續開闢。"},{"english":"The exploration of the South China Sea Silk Road began in the Western Han Peniod.","chinese":"南海絲綢之路的開闢，始於西漢時期。"},{"english":"These biotechnique opened up broad prospects for exploit of microalgae.","chinese":"這些生物技術爲微藻類的利用開闢了廣闊的前景。"},{"english":"Self-organized criticality opens up a new way to the investigation of disasters.","chinese":"自組織臨界性爲災害問題的研究開闢了新途徑。"}],"related":[{"definition":["to break new ground (for agriculture)\/to open up (a new seam)\/to develop (border regions)\/fig. to open up (new horizons)"],"pinyin":["kai1 tuo4"],"word":"開拓"},{"definition":["to initiate\/to start\/to found"],"pinyin":["kai1 chuang4"],"word":"開創"},{"definition":["to exploit (a resource)\/to open up (for development)\/to develop"],"pinyin":["kai1 fa1"],"word":"開發"},{"definition":["to extend\/to expand\/extension\/expansion"],"pinyin":["kuo4 zhan3"],"word":"擴展"},{"definition":["to construct (often sth abstract, such as good relations)\/to set up\/to develop\/construction (abstract)\/architecture"],"pinyin":["jian4 gou4"],"word":"建構"},{"definition":["domain\/territory"],"pinyin":["ban3 tu2"],"word":"版圖"},{"definition":["to create\/to bring about\/to produce\/to set (a record)"],"pinyin":["chuang4 zao4"],"word":"創造"},{"definition":["to broaden"],"pinyin":["tuo4 kuan1"],"word":"拓寬"},{"definition":["to build\/to construct"],"pinyin":["xing1 jian4"],"word":"興建"},{"definition":["to construct (sth abstract)"],"pinyin":["gou4 jian4"],"word":"構建"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["opportunity\/turning point\/juncture"],"pinyin":["qi4 ji1"],"word":"契機"},{"definition":["to open\/to start\/(computing) to enable"],"pinyin":["kai1 qi3"],"word":"開啟"},{"definition":["path\/route\/method\/ways and means"],"pinyin":["lu4 jing4"],"word":"路徑"},{"definition":["to plan (how to do sth)\/planning\/plan\/program"],"pinyin":["gui1 hua4"],"word":"規劃"},{"definition":["to start using\/(computing) to enable (a feature)"],"pinyin":["qi3 yong4"],"word":"啟用"}]}