{"definition":["open-minded","to open up (windows for air, ideas for discussion, transportation routes etc)"],"pinyin":["kai1 tong1","kai1 tong5"],"simplified":["开通"],"rank":2901.0,"normalized_rank":0.04058875379513943,"fraction":0.000050121126227790695,"cumulative_fraction":0.7858790981357323,"word":"開通","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["classifier for an activity, taken in its entirety (tirade of abuse, stint of music playing, bout of drinking etc)","to go through\/to know well\/(suffix) expert\/to connect\/to communicate\/open\/to clear\/classifier for letters, telegrams, phone calls etc"],"pinyin":["tong1","tong4"],"word":"通"}],"containing_words":[],"sentences":[{"english":"Consider the recent opening of the new, expanded Fairview Container Terminal at the Port of Prince Rupert.","chinese":"最近在魯伯特王子島港新開通了怡景集裝箱轉運站。"},{"english":"Do you require fund transfer services?","chinese":"您是否需要開通銀證轉帳服務？"},{"english":"You must sign the service agreement before we can go to work.","chinese":"服務開通前您得先簽一下這個協議。"},{"english":"1 minute to the airport light rail (up and running by 2011).","chinese":"離2011年底開通的機場輕鐵僅1分鐘路程。"},{"english":"But setting up a blog is just the first step.","chinese":"話雖如此，開通一個博客卻僅僅是第一步。"},{"english":"Within the next three years it hopes to serve the pet jet-set in 25 North American cities.","chinese":"在未來三年裏，北美25個城市有望開通寵物航班。"},{"english":"The Panama Canal opened almost one hundred years ago.","chinese":"巴拿馬運河開通於近100年前。"},{"english":"1932 - The Sydney Harbour Bridge opens.","chinese":"1932年的今天，悉尼海港大橋開通。"},{"english":"you know, like, paying bills and setting up cable, and you know, talking to doctors.","chinese":"比如，支付賬單，開通網絡，還有去找醫生看病。"},{"english":"And unlike those plans, Virgin lets you turn on service only when you want it.","chinese":"不同於其他方案，維珍讓你僅當需要時纔開通服務。"},{"english":"Last week China introduced the world's fastest scheduled service between Shanghai and Hangzhou.","chinese":"上週，中國速度最快的高鐵滬杭高鐵開通了。"},{"english":"With the opening of the bridge, the value of great natural environment in Dinghai becomes increasingly important.","chinese":"隨着跨海大橋的開通，定海自然環境的價值日益凸顯。"},{"english":"In addition, turn up, or off, the air conditioning or heater during the day.","chinese":"補充一下，在這些天裏開通或者關閉，空調和加熱器。"},{"english":"For example Nanchang to Shanghai high-speed railway line started generating profits in the first year of its operation after opening to public.","chinese":"比如，南昌到上海的高鐵從開通第一年就開始盈利。"},{"english":"The second is diagnosing the closing fault of the train coupling cock.","chinese":"二是監測列車管折角塞門開通關閉狀態。"},{"english":"The Confucius Institute Online has opened channels in 9 languages, with 100,000 registered users.","chinese":"網絡孔子學院開通9個語種，註冊用戶達10萬人。"}],"related":[{"definition":["to bloom\/to open\/to be open (to the public)\/to open up (to the outside)\/to be open-minded\/unrestrained by convention\/unconstrained in one's sexuality"],"pinyin":["kai1 fang4"],"word":"開放"},{"definition":["to open to traffic (e.g. new bridge, rail line etc)\/(of a locality) to have a transportation service\/(Tw) to commute"],"pinyin":["tong1 che1"],"word":"通車"},{"definition":["high speed rail"],"pinyin":["gao1 tie3"],"word":"高鐵"},{"definition":["to start (a machine)\/(fig.) to set in motion\/to launch (an operation)\/to activate (a plan)"],"pinyin":["qi3 dong4"],"word":"啟動"},{"definition":["to start using\/(computing) to enable (a feature)"],"pinyin":["qi3 yong4"],"word":"啟用"},{"definition":["bidirectional\/two-way\/interactive"],"pinyin":["shuang1 xiang4"],"word":"雙向"},{"definition":["to link\/to join\/to attach\/connection\/a link (on web page)"],"pinyin":["lian2 jie1"],"word":"連接"},{"definition":["to be in operation\/to do business\/(of train, bus etc) to be in service\/operation\/service"],"pinyin":["yun4 ying2"],"word":"運營"},{"definition":["railroad\/railway\/CL:條|条[tiao2]"],"pinyin":["tie3 lu4"],"word":"鐵路"},{"definition":["Hong Kong-Zhuhai-Macau Bridge"],"pinyin":["Gang3 Zhu1 Ao4 Da4 qiao2"],"word":"港珠澳大橋"},{"definition":["the whole front (in a war)\/the whole length (of a road or railway line)"],"pinyin":["quan2 xian4"],"word":"全線"},{"definition":["running\/operation (of airport, bus service, business etc)"],"pinyin":["ying2 yun4"],"word":"營運"},{"definition":["to implement\/to carry out"],"pinyin":["shi2 shi1"],"word":"實施"},{"definition":["air or shipping route"],"pinyin":["hang2 xian4"],"word":"航線"},{"definition":["to forecast\/to predict\/to estimate"],"pinyin":["yu4 ji4"],"word":"預計"},{"definition":["plan\/project\/program\/to plan\/to map out\/CL:個|个[ge4],項|项[xiang4]"],"pinyin":["ji4 hua4"],"word":"計劃"}]}