{"definition":["Eid al-Fitr or Feast of Breaking the Fast, celebrated on the last day of Ramadan"],"pinyin":["Kai1 zhai1 jie2"],"simplified":["开斋节"],"rank":43051.0,"normalized_rank":0.6023393449274551,"fraction":2.88451790679178e-7,"cumulative_fraction":0.9975076174129206,"word":"開齋節","characters":[{"definition":["to open\/to start\/to turn on\/to boil\/to write out (a prescription, check, invoice etc)\/to operate (a vehicle)\/carat (gold)\/abbr. for Kelvin, 開爾文|开尔文[Kai1 er3 wen2]\/abbr. for 開本|开本[kai1 ben3], book format"],"pinyin":["kai1"],"word":"開"},{"definition":["to fast or abstain from meat, wine etc\/vegetarian diet\/study room\/building\/to give alms (to a monk)"],"pinyin":["zhai1"],"word":"齋"},{"definition":["festival\/holiday\/node\/joint\/section\/segment\/part\/to economize\/to save\/to abridge\/moral integrity\/classifier for segments, e.g. lessons, train wagons, biblical verses\/CL:個|个[ge4]","see 節骨眼|节骨眼[jie1 gu5 yan3]"],"pinyin":["jie1","jie2"],"word":"節"}],"containing_words":[],"sentences":[{"english":"Eid-al-Fitr marks the end of Muslim fasting month of Ramadan.","chinese":"開齋節標示著穆斯林齋戒月的結束。"},{"english":"Change from well-known after the Eid al-Fitr.","chinese":"從這以後開齋節變的很有名了。"},{"english":"There was a Festival of the Fast-Breaking Ceremony in the mosque today.","chinese":"今天在清真寺舉行了開齋節慶典。"},{"english":"Muslims attend the Eid-al-Fitr prayers at the Jama Masjid (mosque) in the old quarters of Delhi October 14, 2007 .","chinese":"穆斯林在印度德里的一間清真寺參與開齋節祈禱。"},{"english":"But, I will expected a lot of vehicles went there.","chinese":"但，我會預料開齋節會有很多人上雲頂。"},{"english":"The first day of Hari Raya, my father and again he planned to go Genting Highland.","chinese":"開齋節的第一天，我老爸再一次計劃到雲頂高原遊玩。"},{"english":"For Allah, I determine to perform two rakaats of the Eid-ul-Fitr Prayer following the Imam.","chinese":"我誠意爲主，跟從領導者，進行兩拜開齋節拜。"},{"english":"That few days of raya I work for my dad in his clinic.","chinese":"開齋節的那幾天都在我爸的診療所幫忙。"},{"english":"Today is the first day of Hari Raya Puasa .","chinese":"今天是回教開齋節的第一天。"},{"english":"\"The Eid here is totally different from the Islamic world, \" noted Auf.","chinese":"這裏的開齋節與伊斯蘭世界完全不同。"}],"related":[]}