{"definition":["indirect election"],"pinyin":["jian1 jie1 xuan3 ju3"],"simplified":["间接选举"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"間接選舉","characters":[{"definition":["between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms","gap\/to separate\/to thin out (seedlings)\/to sow discontent"],"pinyin":["jian1","jian4"],"word":"間"},{"definition":["to receive\/to answer (the phone)\/to meet or welcome sb\/to connect\/to catch\/to join\/to extend\/to take one's turn on duty\/to take over for sb"],"pinyin":["jie1"],"word":"接"},{"definition":["to choose\/to pick\/to select\/to elect"],"pinyin":["xuan3"],"word":"選"},{"definition":["to lift\/to hold up\/to cite\/to enumerate\/to act\/to raise\/to choose\/to elect\/act\/move\/deed"],"pinyin":["ju3"],"word":"舉"}],"containing_words":[],"sentences":[{"english":"The President of the United States election implement indirect elections.","chinese":"美國總統選舉實行間接選舉制。"},{"english":"Indirect elections take place at national and provincial levels and in cities with sub-districts.","chinese":"在設區的市和省以至中央實行間接選舉。"},{"english":"Too many levels of indirect election are not conducive to enhancing the representativeness of the institutions.","chinese":"過多層次的間接選舉不利於提高代表機關的代表性。"},{"english":"The President and Vice-President are elected indirectly by an electoral college for five-year terms.","chinese":"總統和副總統每五年由選舉團間接選舉產生。"},{"english":"Indirect election puts an end to the possible unhealthy tendencies during elections.","chinese":"間接選舉杜絕了選舉過程中可能產生的不正之風。"},{"english":"Indirect elections are held for the leadership of the provinces, autonomous regions, municipalities with districts, as well as the central authorities.","chinese":"在省和設區的市以至中央，實行間接選舉。"}],"related":[]}