{"definition":["disconnected\/interrupted\/suspended\/a gap\/a break"],"pinyin":["jian4 duan4"],"simplified":["间断"],"rank":10040.0,"normalized_rank":0.14047262602661145,"fraction":0.000008205840338789794,"cumulative_fraction":0.9300271091561966,"word":"間斷","characters":[{"definition":["between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms","gap\/to separate\/to thin out (seedlings)\/to sow discontent"],"pinyin":["jian1","jian4"],"word":"間"},{"definition":["to break\/to snap\/to cut off\/to give up or abstain from sth\/to judge\/(usu. used in the negative) absolutely\/definitely\/decidedly"],"pinyin":["duan4"],"word":"斷"}],"containing_words":[],"sentences":[{"english":"This study provide in-depth analysis on the North American market for three-phase uninterruptible power supplies (UPS).","chinese":"本報告深入分析北美市場三相不間斷電源供應情況。"},{"english":"Often appear these days giddy and disgusting, this kind of symptom is discontinuity .","chinese":"最近幾天老是出現頭暈噁心，這種症狀是間斷性的。"},{"english":"Get uninterrupted 8 hours sleep each night.","chinese":"每晚8小時的不間斷睡眠。"},{"english":"Gloom golems howl incessantly but do not communicate.","chinese":"深黯魔像會不間斷地嚎叫，但無法進行交流。"},{"english":"Experimental comparison was also made between the continuous bubble method and the intermittent bubble method of diazomethane.","chinese":"對重氮甲烷連續鼓泡法和間斷鼓泡法進行了試驗對比。"},{"english":"In printing, to separate continuous-form paper into discrete sheets using a burster.","chinese":"末端連在一起以使形成不間斷的整體。"},{"english":"We have had a continuous presence in the Mainland for more than 135 years.","chinese":"我們在中國內地的業務從未間斷，已超過了135年。"},{"english":"The weathering layer is an obvious index for sedimentary discontinuity and change of environment.","chinese":"風化層是沉積間斷和環境變遷的明顯標誌。"},{"english":"We have always been able to supply these firms with their monthly requirements without interruption.","chinese":"我方始終能供給這些公司每月所需的數量，從無間斷。"},{"english":"Thermopsis is one of the few genera within Fabaceae with the distribution pattern of the East Asia North American disjunction.","chinese":"黃華屬是豆科少數幾個東亞北美間斷分佈屬之一。"},{"english":"It spots in London in Spring.","chinese":"倫敦的春天總是下間斷性的小雨。"},{"english":"At night send out the signal for rescue continously to the direction for rescue with the flashlight.","chinese":"夜晚用手電筒，向求救方向不間斷的發射求救信號。"},{"english":"The unknown displacement field is approximated by discontinuous , piecewisely differentiable functions.","chinese":"用間斷分片可微的函數來近似未知位移場。"},{"english":"The series of wars fought intermittently between France and England.","chinese":"法國和英國間的一系列間斷性戰爭。"},{"english":"Powerful devices and always-on access.","chinese":"強大的設備和不間斷的訪問。"},{"english":"Objective To investigate the value of high-vacuum discontinuous suction technique for treatment of decubitus ulcers.","chinese":"目的應用高負壓間斷吸引技術治療嚴重壓瘡。"}],"related":[{"definition":["never"],"pinyin":["cong2 wei4"],"word":"從未"},{"definition":["to persevere with\/to persist in\/to insist on"],"pinyin":["jian1 chi2"],"word":"堅持"},{"definition":["conscious\/aware\/on one's own initiative\/conscientious"],"pinyin":["zi4 jue2"],"word":"自覺"},{"definition":["always\/at all times\/never (if used in negative sentence)"],"pinyin":["cong2 lai2"],"word":"從來"},{"definition":["to come and go\/to have friendly relations with\/in the past\/previous"],"pinyin":["guo4 wang3"],"word":"過往"},{"definition":["to continue\/to persist\/sustainable\/preservation"],"pinyin":["chi2 xu4"],"word":"持續"},{"definition":["for this reason\/with regards to this\/in this respect\/in order to do this\/to this end"],"pinyin":["wei4 ci3"],"word":"為此"},{"definition":["unswerving from start to finish (idiom)"],"pinyin":["shi3 zhong1 ru2 yi1"],"word":"始終如一"},{"definition":["unceasing\/uninterrupted\/continuous\/constant"],"pinyin":["bu4 duan4"],"word":"不斷"},{"definition":["from beginning to end\/all along"],"pinyin":["shi3 zhong1"],"word":"始終"},{"definition":["to extend as long as\/to lengthen out to"],"pinyin":["chang2 da2"],"word":"長達"},{"definition":["(in the) past\/former\/previous\/to go over\/to pass by","(verb suffix)"],"pinyin":["guo4 qu4","guo4 qu5"],"word":"過去"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["frequently\/often"],"pinyin":["pin2 fan2"],"word":"頻繁"},{"definition":["to advance\/to conduct\/underway\/in progress\/to do\/to carry out\/to carry on\/to execute"],"pinyin":["jin4 xing2"],"word":"進行"},{"definition":["often\/frequently"],"pinyin":["shi2 chang2"],"word":"時常"}]}