{"definition":["occasionally\/now and then"],"pinyin":["jian4 huo4"],"simplified":["间或"],"rank":27289.0,"normalized_rank":0.3818085151036056,"fraction":0.000001204753354491526,"cumulative_fraction":0.98735211784501,"word":"間或","characters":[{"definition":["between\/among\/within a definite time or space\/room\/section of a room or lateral space between two pairs of pillars\/classifier for rooms","gap\/to separate\/to thin out (seedlings)\/to sow discontent"],"pinyin":["jian1","jian4"],"word":"間"},{"definition":["maybe\/perhaps\/might\/possibly\/or"],"pinyin":["huo4"],"word":"或"}],"containing_words":[],"sentences":[{"english":"They enjoy a boozy night out once in a while .","chinese":"他們間或晚上出去大醉一場。"},{"english":"Occasionally, the moon and a handful of stars shone through the clouds.","chinese":"透過那一片片雲，間或可以看到月亮和點點星光。"},{"english":"Nip Pressure point between two rollers or cylinders.","chinese":"在兩根墨轆間或兩個圓筒間的壓力點。"},{"english":"When life such as butterflies, occasionally stop recreation, do not forget lightly.","chinese":"人生當如彩蝶，間或停憩，勿忘翩躚。"},{"english":"Semaphores are a mechanism for inter-task communication and interrupt-task communication.","chinese":"信號量是任務間或任務與中斷見通訊的機制。"},{"english":"Samples can be installed in the space between and on the pillars.","chinese":"展品可陳列於立柱間或安裝在立柱上。"},{"english":"Every once in a while there are efforts to reform some of these anti-shareholder practices.","chinese":"間或也有作出努力來改革這些對抗股東的做法。"},{"english":"Interdigital, or toe web infection, is the most common kind of athlete's foot.","chinese":"趾間或腳趾頭的感染，是腳癬中最常見的。"},{"english":"Take a break and refresh your mind occasionally each day.","chinese":"休息一下，並且每天間或保持清醒的頭腦。"},{"english":"America's solution is to lard the industry with money.","chinese":"美國的方法是間或的給這個產業一些補貼。"},{"english":"Parkman occasionally allows a supercilious tone to creep into his writings.","chinese":"帕克曼間或在文章裏流露出高傲的態度。"},{"english":"She had never been regular in her monthlies, and she was probably less so now, with the excitement.","chinese":"她的月事從來沒有規律，就是現在，她間或缺乏激情。"},{"english":"It usually occurs between gametes or protoplasm.","chinese":"常發生在配子間或原生質間。"},{"english":"Or like a cradled creature lies.","chinese":"間或嬰兒似地靜躺在搖籃裏。"},{"english":"Now and then we wake to watch the gentle sweep of the Southern Cross through the sky.","chinese":"我們間或醒來凝視星空中南十字星的曼妙身形。"}],"related":[]}