{"definition":["to close firmly\/to fasten securely\/to make fast\/to lock"],"pinyin":["guan1 jin3"],"simplified":["关紧"],"rank":38711.0,"normalized_rank":0.5416171141549956,"fraction":4.3369952940680045e-7,"cumulative_fraction":0.9959620451297541,"word":"關緊","characters":[{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["Guan1","guan1"],"word":"關"},{"definition":["tight\/strict\/close at hand\/near\/urgent\/tense\/hard up\/short of money\/to tighten"],"pinyin":["jin3"],"word":"緊"}],"containing_words":[{"definition":["indifferent\/insignificant"],"pinyin":["wu2 guan1 jin3 yao4"],"word":"無關緊要"},{"definition":["lockjaw\/trismus"],"pinyin":["ya2 guan1 jin3 bi4 zheng4"],"word":"牙關緊閉症"}],"sentences":[{"english":"In my eyes it would be no marriage at all, but that would be nothing.","chinese":"在我後來，這根本算不上婚姻，不過這也無關緊要。"},{"english":"But size matters little when it comes to eating the crabs at the end of the safari.","chinese":"但當談到抓到以後喫螃蟹時大小並無關緊要。"},{"english":"He lacdfds. com on his back, his teeth set, his right hand clenched on his breast.","chinese":"他仰臥着，牙關緊閉，右手緊握着拳頭胸口上。"},{"english":"As soon as the alarm went, the crew raced around shutting the watertight doors.","chinese":"警報一響，船員們跑來跑去把船上的水密門關緊。"},{"english":"Did you leave the doors and windows firmly fastened?","chinese":"你把門和窗戶關緊了嗎？"},{"english":"In a resource-based economy money would become irrelevant.","chinese":"在一個資源導向經濟裏，金錢將變得無關緊要。"},{"english":"This means nothing that happens in your life is insignificant.","chinese":"這就意味着你生命裏發生的事情沒有無關緊要的。"},{"english":"It's mostly about principles -- contravening evidence and ideas don't matter too much.","chinese":"它大部分是關於原則，反駁證據和觀點是無關緊要的。"},{"english":"It doesn’t matter he’s real or not, the legend will remain.","chinese":"他是真與否，都無關緊要，傳說還是會流傳下去。"},{"english":"There is often some overlap with the Conclusions, but that's okay.","chinese":"在結論部分會有一些重疊的信息，但是這無關緊要。"},{"english":"He often remonstrated with others about unimportant matter.","chinese":"他常與別人爭辯一些無關緊要的問題。"},{"english":"Such acceptance is critical to project success.","chinese":"這樣的認同對於項目的成功至關緊要。"},{"english":"But these became unnecessary in an era of floating rates.","chinese":"但是這在浮動匯率的時代就無關緊要了。"},{"english":"Our perception of the whole is not distracted by inessential details.","chinese":"我們對整體的感知並沒有被無關緊要的細節打亂。"},{"english":"Setting the stage is vital.","chinese":"設置階段是至關緊要的。"},{"english":"Maybe it doesn’t matter to Cody or others that I am scared.","chinese":"也對於科迪和其他人來說，我害不害怕無關緊要。"}],"related":[]}