{"definition":["to take care\/to keep an eye on\/to look after\/to tell\/to remind"],"pinyin":["guan1 zhao4"],"simplified":["关照"],"rank":12977.0,"normalized_rank":0.1815650665286192,"fraction":0.000005362926055653664,"cumulative_fraction":0.9495195381654756,"word":"關照","characters":[{"definition":["mountain pass\/to close\/to shut\/to turn off\/to concern\/to involve","surname Guan"],"pinyin":["Guan1","guan1"],"word":"關"},{"definition":["according to\/in accordance with\/to shine\/to illuminate\/to reflect\/to look at (one's reflection)\/to take (a photo)\/photo\/as requested\/as before"],"pinyin":["zhao4"],"word":"照"}],"containing_words":[{"definition":["to be indebted to sb for care\/thank you for looking after me"],"pinyin":["cheng2 meng2 guan1 zhao4"],"word":"承蒙關照"},{"definition":["please treat me kindly (conventional greeting on first meeting)"],"pinyin":["qing3 duo1 guan1 zhao4"],"word":"請多關照"}],"sentences":[{"english":"Whenever you need money, send me words three weeks ahead.","chinese":"無論何時假如你需要錢，請於三星期前來信關照。"},{"english":"After Marquis also invited a lot of attention.","chinese":"以後還請侯爵多多關照。"},{"english":"The fire had crumbled down to greyness, and one of the lamps made a gurgling appeal for attention.","chinese":"爐火已經暗淡，一盞燈咯咯響着請求關照。"},{"english":"Book art is the natural and human attention, imagery, America has become the main pursuit.","chinese":"書藝是對自然以及人的關照，意象美成爲了主要追求。"},{"english":"New report, Nice to meet you.","chinese":"新人報到，請多關照。"},{"english":"I know little about the stock and hope you give me more support and consideration.","chinese":"這回請你多多關照，我對股票知之甚少。"},{"english":"The cold, pale sunlight fell on their gloomy faces, long hair and lusterless eyes.","chinese":"冷淡的陽關照著他們的愁眉苦臉和長髮白眼。"},{"english":"Newland will particularly appreciate what you have done because of dear May and his new relations.","chinese":"你對梅和他的新親戚的關照，紐蘭會分外感激的。"},{"english":"I am truly honored by the kindnessattention you have shown me today.","chinese":"今天你們對我的厚意與關照，我真的感到很榮幸。"},{"english":"I am inexperienced, but also invite more attention.","chinese":"我初出茅廬，還請多多關照。"},{"english":"We shall be glad if you will se to it that the contract is duly signed.","chinese":"如果你方對合同圓滿簽字給予關照，我們將十分高興。"},{"english":"Special to employ seafarers post, hope that the leadership of more concern.","chinese":"特來聘海員一職，希望各位領導多多關照。"},{"english":"The hope in later day, we looks after mutually, helps mutually.","chinese":"英語翻譯希望在以後的日子裏，我們互相關照。"},{"english":"Studying history is not only to seek the anecdote in the recesses, but to pay close attention to the reality.","chinese":"歷史研究並非只爲索隱鉤沉，主要在於關照現實。"},{"english":"Now, then, I must see you all back into your rooms;","chinese":"好吧，現在我得關照大家回自己房間裏去。"},{"english":"The third is to surpass the realism, guide the future.","chinese":"三是實現河現實關照的趄越指向未來。"}],"related":[{"definition":["senior\/older generation\/precursor"],"pinyin":["qian2 bei4"],"word":"前輩"},{"definition":["to empathize\/to allow (for sth)\/to show understanding\/to appreciate"],"pinyin":["ti3 liang4"],"word":"體諒"},{"definition":["enthusiasm\/zeal\/zealous\/zest\/enthusiastic\/ardent\/warmhearted"],"pinyin":["re4 xin1"],"word":"熱心"},{"definition":["timely\/apt to the occasion\/in due course"],"pinyin":["shi4 shi2"],"word":"適時"},{"definition":["to be concerned about\/to care about"],"pinyin":["guan1 xin1"],"word":"關心"},{"definition":["many thanks\/thanks a lot"],"pinyin":["duo1 xie4"],"word":"多謝"},{"definition":["lenient\/tolerant\/indulgent\/charitable\/to forgive"],"pinyin":["kuan1 rong2"],"word":"寬容"},{"definition":["to experience\/experience"],"pinyin":["yue4 li4"],"word":"閱歷"},{"definition":["to help\/to lend a hand\/to do a favor\/to do a good turn"],"pinyin":["bang1 mang2"],"word":"幫忙"},{"definition":["to instruct\/to teach\/guidance\/teaching"],"pinyin":["jiao4 dao3"],"word":"教導"},{"definition":["making an all-out effort (idiom); to try one's heart out\/to do one's utmost"],"pinyin":["jin4 xin1 jin4 li4"],"word":"盡心盡力"},{"definition":["considerate (of other people's needs)"],"pinyin":["ti3 tie1"],"word":"體貼"},{"definition":["attitude (of the heart)\/state of one's psyche\/way of thinking\/mentality"],"pinyin":["xin1 tai4"],"word":"心態"},{"definition":["to understand\/to make allowances for\/understanding"],"pinyin":["liang4 jie3"],"word":"諒解"},{"definition":["we\/us\/ourselves\/our"],"pinyin":["wo3 men5"],"word":"我們"},{"definition":["affectionate\/intimate\/warmhearted\/to get intimate with sb"],"pinyin":["qin1 re4"],"word":"親熱"}]}