{"definition":["to elucidate\/to explain clearly\/to expound"],"pinyin":["chan3 ming2"],"simplified":["阐明"],"rank":19382.0,"normalized_rank":0.2711793264589425,"fraction":0.0000025557762910987084,"cumulative_fraction":0.9733104728399044,"word":"闡明","characters":[{"definition":["to express\/to disclose\/to enlighten\/to open"],"pinyin":["chan3"],"word":"闡"},{"definition":["Ming Dynasty (1368-1644)\/surname Ming\/Ming (c. 2000 BC), fourth of the legendary Flame Emperors, 炎帝[Yan2 di4] descended from Shennong 神農|神农[Shen2 nong2] Farmer God","bright\/opposite: dark 暗[an4]\/(of meaning) clear\/to understand\/next\/public or open\/wise\/generic term for a sacrifice to the gods"],"pinyin":["Ming2","ming2"],"word":"明"}],"containing_words":[],"sentences":[{"english":"The line was going out fast but steadily and the fish was not panicked.","chinese":"釣索朝水中溜得既快又穩，闡明這魚並不受驚。"},{"english":"To clarify the safety of Monascus and Chinese traditional medicine synbiotics.","chinese":"闡明紅曲黴與健胃中藥合生素的安全性。"},{"english":"By means of comparative analysis in order, this paper puts special emphasis on clarifying their dual characteristic.","chinese":"本文將通過逐項對比分析，着重闡明二者的對偶性。"},{"english":"This article clarifies the value of governance to application development teams.","chinese":"本文會嚮應用程序開發團隊闡明治理的價值。"},{"english":"Throughout, she illustrates her analysis with excerpts from discussions.","chinese":"自始至終，她摘引討論內容來闡明她的分析。"},{"english":"The basic requirements in nuclear safety review are clarified for class 1E cables of nu- clear power plants.","chinese":"闡明對核電廠1E級電纜核安全審查的基本要求。"},{"english":"However, much more research will be necessary to clarify the pharmacology of indigo naturalis.","chinese":"但是，茯靈的藥理作用要闡明，還需要大量的研究。"},{"english":"That's officially spelt out in the latest five-year plan.","chinese":"這在最新的五年計劃裏都正式闡明瞭。"},{"english":"By introducing a typical case this paper expounds the common reasons for disbanding a corporation compulsorily in judicial procedure.","chinese":"以典型案例作引子，闡明瞭公司司法解散的理由。"},{"english":"The Christian doctrine of creation finds its expression within the Church.","chinese":"而基督教的創世論教義是在教會內得到闡明的。"},{"english":"Whether caffeine banishes cellulite is less clear.","chinese":"咖啡因是否可以減少脂肪組織尚未闡明。"},{"english":"The cases are analyzed in order to illustrate the feasibility of wastewater treatment with thermophilic bacteria.","chinese":"通過實例闡明瞭利用嗜熱菌處理廢水的可行性。"},{"english":"Clarify the oil painting art language real meaning and the existence values of the critical appearance.","chinese":"闡明油畫藝術語言臨界狀態的真正意義和存在價值。"},{"english":"Hiddink's plans should be clarified shortly.","chinese":"希丁克的計劃應該被簡短的闡明。"},{"english":"First of all, the author expounded that it is necessary to study the supervising mode inside company of our country .","chinese":"首先，闡明瞭研究公司內部監督模式問題的必要性。"},{"english":"At the beginning, the renamed history of Guazhou was introduced.","chinese":"首先，闡明瞭瓜州縣更名的歷史沿革。"}],"related":[{"definition":["to explain\/to expound\/to interpret\/elucidation"],"pinyin":["chan3 shi4"],"word":"闡釋"},{"definition":["to expound (a position)\/to elaborate (on a topic)\/to treat (a subject)"],"pinyin":["chan3 shu4"],"word":"闡述"},{"definition":["reason\/cause"],"pinyin":["yuan2 you2"],"word":"緣由"},{"definition":["abbr. for 論語|论语[Lun2 yu3], The Analects (of Confucius)","opinion\/view\/theory\/doctrine\/to discuss\/to talk about\/to regard\/to consider\/per\/by the (kilometer, hour etc)"],"pinyin":["Lun2","lun4"],"word":"論"},{"definition":["to decipher\/to decode\/to interpret"],"pinyin":["jie3 du2"],"word":"解讀"},{"definition":["to sum up\/to summarize\/to conclude from facts\/induction (method of deduction in logic)"],"pinyin":["gui1 na4"],"word":"歸納"},{"definition":["to elucidate\/to expound\/to study and explain"],"pinyin":["chan3 fa1"],"word":"闡發"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"規範"},{"definition":["actual proof\/concrete evidence\/empirical"],"pinyin":["shi2 zheng4"],"word":"實證"},{"definition":["treatise\/discourse\/exposition"],"pinyin":["lun4 shu4"],"word":"論述"},{"definition":["clear-cut\/definite\/explicit\/to clarify\/to specify\/to make definite"],"pinyin":["ming2 que4"],"word":"明確"},{"definition":["evidence\/proof\/to confirm\/corroboration"],"pinyin":["zuo3 zheng4"],"word":"佐證"},{"definition":["an assertion\/to declare\/to state"],"pinyin":["chen2 shu4"],"word":"陳述"},{"definition":["to gather\/to unite\/to unify\/whole"],"pinyin":["tong3"],"word":"統"},{"definition":["cognition\/cognitive\/understanding\/perception\/awareness\/to be cognizant of\/to recognize\/to realize"],"pinyin":["ren4 zhi1"],"word":"認知"}]}