{"definition":["to expound (a position)\/to elaborate (on a topic)\/to treat (a subject)"],"pinyin":["chan3 shu4"],"simplified":["阐述"],"rank":7058.0,"normalized_rank":0.09875057714101827,"fraction":0.000014578493639447442,"cumulative_fraction":0.8973670836275098,"word":"闡述","characters":[{"definition":["to express\/to disclose\/to enlighten\/to open"],"pinyin":["chan3"],"word":"闡"},{"definition":["to state\/to tell\/to narrate\/to relate"],"pinyin":["shu4"],"word":"述"}],"containing_words":[],"sentences":[{"english":"The Rapid Displacement Heating (RDH) cooking process has been developed by Beloit Corporation as an energy efficient pulping system.","chinese":"闡述了快速置換加熱間歇蒸煮化學和技術的原理。"},{"english":"Objective To review the recent developments in the research of oxazolidinone antibacterial drugs.","chinese":"目的闡述惡唑烷酮類抗菌藥物的最新研究進展。"},{"english":"The application principles and methods are demonstrated of nuclear radiation technique in gemmology.","chinese":"闡述了核輻照技術在寶石學中的應用原理和方法。"},{"english":"In the first part, the author explain the meaning of medium-small investor.","chinese":"論文第一章首先闡述了投資者和中小投資者的內涵。"},{"english":"This article Legionella disease related to recent research carried out on the preliminary.","chinese":"本文就軍團菌病有關研究近況進行了初步闡述。"},{"english":"The water feed whole-course control system used in China-bult 300MW unit is described.","chinese":"闡述了國產300MW機組的鍋爐給水全程控制系統。"},{"english":"The illumination energy saving on Dayaowan container stack yard is dismissed based on the illumination theory.","chinese":"從照明原理闡述大窯灣集裝箱堆場高杆燈照明節能。"},{"english":"Finally, elaborated the tax revenue drafts accepts relational the concept and the characteristic.","chinese":"最後，闡述了稅收徵納關係的概念和特徵。"},{"english":"The fourth chapter focuses on the apocalypse and a second think of patent pools.","chinese":"第四章闡述了專利池所帶來的啓示的反思。"},{"english":"Elaborated in the industrialization production the steamed bun anti-aging engineering research present situation.","chinese":"闡述了工業化生產中饅頭抗老化技術研究現狀。"},{"english":"It elaborates the factors influencing forestland value.","chinese":"闡述了影響林地價值的因素。"},{"english":"Chapter four sum up the basic characteristic and the last sum up great meaning of Ren Bishi's Party building thought.","chinese":"第五章主要闡述任弼時的黨建思想的重大意義。"},{"english":"And it detailedly expatiates the frame synchronization and the network synchronization methods.","chinese":"詳細闡述了幀同步和網同步方法。"},{"english":"The innovations of my thesis are generalized in the fifth part.","chinese":"在第五部分中，概括性地闡述了發生額法的創新之處。"},{"english":"Infliximab and its side-effect profile are discussed, along with other associated complications.","chinese":"針對英利昔單抗的副作用和相關併發症進行了闡述。"},{"english":"This paper dwells the concepts of retrogressive aggradation and the datum of erosion.","chinese":"本文闡述了溯源淤積和侵蝕基準面的概念。"}],"related":[{"definition":["to decipher\/to decode\/to interpret"],"pinyin":["jie3 du2"],"word":"解讀"},{"definition":["to explain\/to expound\/to interpret\/elucidation"],"pinyin":["chan3 shi4"],"word":"闡釋"},{"definition":["treatise\/discourse\/exposition"],"pinyin":["lun4 shu4"],"word":"論述"},{"definition":["to explain\/to illustrate\/to indicate\/to show\/to prove\/explanation\/directions\/caption\/CL:個|个[ge4]"],"pinyin":["shuo1 ming2"],"word":"說明"},{"definition":["explanation\/to explain\/to interpret\/to resolve\/CL:個|个[ge4]"],"pinyin":["jie3 shi4"],"word":"解釋"},{"definition":["to relate (a story or information)\/to tell or talk about\/to recount\/narration\/telling\/narrative\/account"],"pinyin":["xu4 shu4"],"word":"敘述"},{"definition":["to sum up\/to conclude\/summary\/résumé\/CL:個|个[ge4]"],"pinyin":["zong3 jie2"],"word":"總結"},{"definition":["to sum up\/to summarize\/to conclude from facts\/induction (method of deduction in logic)"],"pinyin":["gui1 na4"],"word":"歸納"},{"definition":["to embody\/to reflect\/to incarnate"],"pinyin":["ti3 xian4"],"word":"體現"},{"definition":["cognition\/cognitive\/understanding\/perception\/awareness\/to be cognizant of\/to recognize\/to realize"],"pinyin":["ren4 zhi1"],"word":"認知"},{"definition":["to express\/to convey"],"pinyin":["biao3 da2"],"word":"表達"},{"definition":["to interpret\/to comment and explain\/to annotate\/to perform (i.e. interpret a theatrical role)\/to decode\/interpretation\/annotation"],"pinyin":["quan2 shi4"],"word":"詮釋"},{"definition":["to investigate\/to probe"],"pinyin":["tan4 tao3"],"word":"探討"},{"definition":["practice\/to put into practice\/to live up to (a promise)\/to carry out (a project)"],"pinyin":["shi2 jian4"],"word":"實踐"},{"definition":["to explain"],"pinyin":["jiang3 jie3"],"word":"講解"},{"definition":["aspect\/facet\/level (political, psychological, spiritual etc)\/(geology) bedding plane"],"pinyin":["ceng2 mian4"],"word":"層面"}]}