{"definition":["antifreeze"],"pinyin":["fang2 dong4"],"simplified":["防冻"],"rank":25171.0,"normalized_rank":0.35217494718285225,"fraction":0.0000014558348726940497,"cumulative_fraction":0.9845418880985046,"word":"防凍","characters":[{"definition":["to protect\/to defend\/to guard against\/to prevent"],"pinyin":["fang2"],"word":"防"},{"definition":["to freeze\/to feel very cold\/aspic or jelly"],"pinyin":["dong4"],"word":"凍"}],"containing_words":[{"definition":["antifreeze agent"],"pinyin":["fang2 dong4 ji4"],"word":"防凍劑"}],"sentences":[{"english":"If the temperature is below 0℃ please use Varlon Brand anti-freeze glass cleaner.","chinese":"如氣溫低於此溫度，可使用慧霖牌防凍型玻璃水。"},{"english":"Industrial calcium chloride aqueous solution used as anti-icing fluid has some corrosive action to common metals.","chinese":"工業氯化鈣水溶液作爲防凍液有一定的腐蝕性。"},{"english":"And its also used as a freezproof agent and anti-freezing agent.","chinese":"作爲防凍劑和融雪劑廣泛用於融雪化冰。"},{"english":"But small amount anti-freeze was added to it. And that seem to solve the problem.","chinese":"但是加入了一些防凍劑，這貌似可以解決這個問題了。"},{"english":"Make sure your vehicle has fresh antifreeze.","chinese":"確認您的車輛有新鮮的防凍液。"},{"english":"Shall I put some anti- freeze in the radiator?","chinese":"要不要在散熱器裏注入一些防凍劑？"},{"english":"Strengthen research into and product development of anti-seepage, anti-freezing and anti-expansion ditch technologies. 2.2.","chinese":"加強渠道防滲防凍脹技術的研究和產品開發。"},{"english":"Fast and accurate testing of anti-freeze strength.","chinese":"快速準確地檢測防凍抗力。"},{"english":"Oil storage in ports: thermal insulation for the media pipes and freeze protection for water pipes.","chinese":"港口碼頭油庫介質管線的伴熱保溫和水管線的防凍。"},{"english":"An antifreeze is a liquid that is added to water to keep it from freezing.","chinese":"防凍液是一種液體，加入到水中可防止水結凍。"},{"english":"Antifreeze poisonings are one of the most common poisonings of small animals.","chinese":"防凍液中毒是小動物的最常見的中毒之一。"},{"english":"Tommy kicked over a gallon of antifreeze and disappeared into the locker room.","chinese":"湯米一腳踢翻了一桶防凍液，消失在更衣室裏。"},{"english":"Antifreezing efficiency is one of the key measures.","chinese":"是防凍增效的關鍵措施之一。"},{"english":"The cement cannot in the open work, probably take the frostproof measure.","chinese":"水泥不能在露天施工，要採取防凍措施。"},{"english":"Apply to replacement of the cooling fluid or antifreeze used before.","chinese":"適用於更換冷卻液或防凍液前使用。"},{"english":"Light should be left in place for winterization.","chinese":"燈應該被適當留在防凍處理地。"}],"related":[]}