{"definition":["disaster prevention\/to protect against natural disasters"],"pinyin":["fang2 zai1"],"simplified":["防灾"],"rank":16511.0,"normalized_rank":0.2310103115861934,"fraction":0.000003478208915239258,"cumulative_fraction":0.9647657723002376,"word":"防災","characters":[{"definition":["to protect\/to defend\/to guard against\/to prevent"],"pinyin":["fang2"],"word":"防"},{"definition":["disaster\/calamity"],"pinyin":["zai1"],"word":"災"}],"containing_words":[],"sentences":[{"english":"Fourth, we should further strengthen cooperation in disaster prevention and mitigation, and post-disaster reconstruction.","chinese":"第四，進一步加強防災減災和災後重建合作。"},{"english":"Since fire and water have no mercy people should be alert for disasters.","chinese":"正因爲水火無情，所以人們都應提高防災意識。"},{"english":"Formulate disaster prevention and mitigation plans and strengthen disaster monitoring and early warning.","chinese":"制定完善防災減災預案，加強災害監測預警。"},{"english":"Hundreds of health professionals worldwide have been trained in emergency preparedness.","chinese":"世界各地有許多衛生專業人員接受了防災應急培訓。"},{"english":"Earthquake Prediction is a main course for students majoring in disaster prevention.","chinese":"地震預報課程是防災技術系學生的一門主要專業課。"},{"english":"IEE carried out the seismic disaster prevention planning for Jinxian County of Jiangxi Province.","chinese":"江西省進賢縣抗震防災規劃，由抗震所完成。"},{"english":"These results can provide a decision-making basis for disaster prevention and evacuation of urban residents.","chinese":"該研究結果可爲城市居民防災避難提供決策依據。"},{"english":"We will continue to make earnest effort to strengthen disaster prevention and mitigation.","chinese":"我們要繼續紮紮實實加強防災減災工作。"},{"english":"Fourth, carefully carry out emergency exercises to enhance the level of mine disaster prevention and resilience.","chinese":"四是認真開展應急演練活動，提升礦井防災抗災水平。"},{"english":"Basic frame of Urban planning theories for disaster preventing are put forward in the end.","chinese":"最後提出了城市防災規劃理論初步框架。"},{"english":"Urban disaster prevention is an important part of a harmonious society.","chinese":"城市防災救災是和諧社會的重要組成部分。"},{"english":"Landslide predicting and forcasting is one of effect measures to lessen and prevent calamity .","chinese":"對滑坡進行預測預報是減災防災的重要措施之一。"},{"english":"Undertake take precautions against natural calamities prevents the another obligation that caustic job is an underwriter actively.","chinese":"積極進行防災防損工作是保險人的又一義務。"},{"english":"So the significance of urban disaster-prevention system planning is very obvious.","chinese":"因此城市防災空間的規劃建設研究是極具實際意義的。"},{"english":"The building fire prevention is a vital part of building disaster prevention.","chinese":"建築防火是建築防災的一個重要分支。"}],"related":[{"definition":["to relieve disaster\/to help disaster victims"],"pinyin":["jiu4 zai1"],"word":"救災"},{"definition":["to meet a contingency\/to adapt oneself to changes"],"pinyin":["ying4 bian4"],"word":"應變"},{"definition":["to do a drill\/to practice\/training\/drill"],"pinyin":["yan3 lian4"],"word":"演練"},{"definition":["preparedness\/to bring sth to a state of readiness"],"pinyin":["zheng3 bei4"],"word":"整備"},{"definition":["calamity\/disaster\/CL:個|个[ge4]"],"pinyin":["zai1 hai4"],"word":"災害"},{"definition":["measures to reduce disasters"],"pinyin":["jian3 zai1"],"word":"減災"},{"definition":["to rescue\/to administer first aid"],"pinyin":["jiu4 hu4"],"word":"救護"},{"definition":["safety net"],"pinyin":["an1 quan2 wang3"],"word":"安全網"},{"definition":["to save water"],"pinyin":["jie2 shui3"],"word":"節水"},{"definition":["to extinguish a fire\/firefighting"],"pinyin":["mie4 huo3"],"word":"滅火"},{"definition":["to mobilize\/to arouse\/mobilization\/CL:次[ci4],個|个[ge4]"],"pinyin":["dong4 yuan2"],"word":"動員"},{"definition":["after a catastrophe\/post-traumatic"],"pinyin":["zai1 hou4"],"word":"災後"},{"definition":["military platoon or squad"],"pinyin":["fen1 dui4"],"word":"分隊"},{"definition":["service\/duties\/an orderly (military)"],"pinyin":["qin2 wu4"],"word":"勤務"},{"definition":["to respond to an emergency\/to meet a contingency\/(attributive) emergency"],"pinyin":["ying4 ji2"],"word":"應急"},{"definition":["to dispatch (vehicles, staff etc)\/to schedule\/to manage\/dispatcher\/scheduler"],"pinyin":["diao4 du4"],"word":"調度"}]}