{"definition":["to be on guard\/wariness\/to guard against\/preventive"],"pinyin":["fang2 fan4"],"simplified":["防范"],"rank":3404.0,"normalized_rank":0.047626376393883015,"fraction":0.000041023216611247626,"cumulative_fraction":0.8086971227284059,"word":"防範","characters":[{"definition":["to protect\/to defend\/to guard against\/to prevent"],"pinyin":["fang2"],"word":"防"},{"definition":["pattern\/model\/example"],"pinyin":["fan4"],"word":"範"}],"containing_words":[{"definition":["to neglect to take precautions\/relaxed vigilance"],"pinyin":["shu1 yu2 fang2 fan4"],"word":"疏於防範"}],"sentences":[{"english":"The development of financial circles and strick precaution of the risk are closely linked with disclosure of financial information.","chinese":"金融業的發展及其風險的防範與信息披露息息相關。"},{"english":"How to defense collusive attack is the key problems for the designing of fingerprinting.","chinese":"所以設計指紋算法的關鍵問題是如何防範合謀攻擊。"},{"english":"Objective To explore the happen of nurses' injuries caused by sharp instruments and the preventive countermeasures.","chinese":"目的探討銳器傷的發生情況與防範對策。"},{"english":"This use of lawyers by business people is called preventive law .","chinese":"企業家這樣使用律師，叫做防範性法律顧問工作。"},{"english":"In addition, setting up powerful prevention overawe is an important assurance of financial safety.","chinese":"另外，建設強大的防範威懾也是金融安全的重要保證。"},{"english":"The policy emphasizes the prevention of nuclear proliferation and nuclear terrorism.","chinese":"該政策強調防止核擴散及防範核恐怖主義。"},{"english":"Farcinia is spreading seriously and those families which raise cattles must take measures against it.","chinese":"疽病傳染嚴重，養家畜的家庭一定要做好防範。"},{"english":"To avoid misusage of your phone, please take safety measure, such as.","chinese":"爲了使您的手機免受誤用，請採取防範措施，如。"},{"english":"Peace-building can be the primary means to belongs two aspects, prevent and combat.","chinese":"平安建設的手段，主要包括打擊和防範兩大類。"},{"english":"Preparedness focuses on surveillance, from case detection and investigation and laboratory confirmation.","chinese":"防範注重於監測，從病例發現到調查和實驗室確認。"},{"english":"Propolis may help treat food poisoning.","chinese":"蜂膠或有助於防範食物中毒。"},{"english":"Intensified preparedness measures, also by industry, are already fully under way.","chinese":"人們，還包括醫藥行業，已在全力強化防範措施。"},{"english":"Whatever how wide, we also guard the villainy , keep the false away and oppose the sellout.","chinese":"但不管多寬，都要警惕邪惡，防範虛僞，反對背叛。"},{"english":"You may want to consider photo-sharing Web sites with higher fences.","chinese":"你也許想考慮一下其他一些防範性比較強的網站。"},{"english":"The organization of prevention, provision of personnel, technical equipment and communications and liaison.","chinese":"防範組織，人員配備，技術裝備，通信聯絡等。"},{"english":"It is good to use these appliances but maintenance and precautions are to be taken.","chinese":"這是好事，但使用這些電器維修和應採取的防範。"}],"related":[{"definition":["response\/to answer\/to reply"],"pinyin":["ying4 dui4"],"word":"應對"},{"definition":["to reinforce\/to strengthen\/to increase"],"pinyin":["jia1 qiang2"],"word":"加強"},{"definition":["to put an end to"],"pinyin":["du4 jue2"],"word":"杜絕"},{"definition":["to hit\/to strike\/to attack\/to crack down on sth\/blow\/(psychological) shock\/percussion (music)"],"pinyin":["da3 ji1"],"word":"打擊"},{"definition":["feasible\/realistic\/practical\/earnestly\/conscientiously"],"pinyin":["qie4 shi2"],"word":"切實"},{"definition":["to prevent\/to take precautions against\/to protect\/to guard against\/precautionary\/prophylactic"],"pinyin":["yu4 fang2"],"word":"預防"},{"definition":["authorities"],"pinyin":["dang1 ju2"],"word":"當局"},{"definition":["risk\/hazard"],"pinyin":["feng1 xian3"],"word":"風險"},{"definition":["to defend\/to safeguard\/to protect\/to uphold\/to maintain"],"pinyin":["wei2 hu4"],"word":"維護"},{"definition":["to oversee\/to take charge of\/to supervise\/to administer\/supervisory\/supervision"],"pinyin":["jian1 guan3"],"word":"監管"},{"definition":["to call on (sb to do sth)\/to appeal (to)\/an appeal"],"pinyin":["hu1 yu4"],"word":"呼籲"},{"definition":["to threaten\/to menace"],"pinyin":["wei1 xie2"],"word":"威脅"},{"definition":["to meet a contingency\/to adapt oneself to changes"],"pinyin":["ying4 bian4"],"word":"應變"},{"definition":["to ensure\/to guarantee"],"pinyin":["que4 bao3"],"word":"確保"},{"definition":["to lower\/to reduce"],"pinyin":["jian3 di1"],"word":"減低"},{"definition":["to target\/to focus on\/to be aimed at or against\/in response to"],"pinyin":["zhen1 dui4"],"word":"針對"}]}