{"definition":["safety goggles"],"pinyin":["fang2 hu4 yan3 jing4"],"simplified":["防护眼镜"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"防護眼鏡","characters":[{"definition":["to protect\/to defend\/to guard against\/to prevent"],"pinyin":["fang2"],"word":"防"},{"definition":["to protect"],"pinyin":["hu4"],"word":"護"},{"definition":["eye\/small hole\/crux (of a matter)\/CL:隻|只[zhi1],雙|双[shuang1]\/classifier for big hollow things (wells, stoves, pots etc)"],"pinyin":["yan3"],"word":"眼"},{"definition":["mirror\/lens"],"pinyin":["jing4"],"word":"鏡"}],"containing_words":[],"sentences":[{"english":"Eye protection is provided for your safety and must be worn.","chinese":"爲了您的安全，防護眼鏡已經準備，必須戴好。"},{"english":"Use the products should be worn when good protective glasses and rubber glove.","chinese":"使用該產品時應戴好防護眼鏡和膠皮手套。"},{"english":"Wore protective clothing, thick gloves, safety glasses, Keep unproductive personal at a distance.","chinese":"穿保護衣服，厚的手套，安全的防護眼鏡。"},{"english":"The evaporator also only used by briefed persons, you have to wear safety glasses.","chinese":"蒸發器也由專人使用，必須戴防護眼鏡。"},{"english":"Eye Protection: Wear goggles when working with liquids.","chinese":"使用縫紉機時，建議戴安全防護眼鏡。"},{"english":"She makes sure to wear special protective glasses and gloves when making soap.","chinese":"她使一定要戴上特製的防護眼鏡和手套時肥皂。"},{"english":"Encloses safe protection magic eye to avoid the danger of colliding.","chinese":"使用縫紉機時，建議戴安全防護眼鏡。"},{"english":"For your personal protection, we recommend that you wear safety glasses.","chinese":"使用縫紉機時，建議戴安全防護眼鏡。"},{"english":"Eight, drive in long-term snow mushroom, the navigator had better wear protecting glasses.","chinese":"長時間雪中行駛，駕駛員最好戴防護眼鏡。"},{"english":"Avoid looking at the laser light without the protective goggles.","chinese":"避免看無防護眼鏡激光。"},{"english":"Put on these glasses, please.","chinese":"請戴上防護眼鏡。"}],"related":[]}