{"definition":["excessive self-defense (self-defense with excessive force)"],"pinyin":["fang2 wei4 guo4 dang4"],"simplified":["防卫过当"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"防衛過當","characters":[{"definition":["to protect\/to defend\/to guard against\/to prevent"],"pinyin":["fang2"],"word":"防"},{"definition":["surname Wei\/vassal state during the Zhou Dynasty (1066-221 BC), located in present day Henan and Hebei Provinces","to guard\/to protect\/to defend\/abbr. for 衛生|卫生, hygiene\/health\/abbr. for 衛生間|卫生间, toilet"],"pinyin":["Wei4","wei4"],"word":"衛"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"},{"definition":["at or in the very same...\/suitable\/adequate\/fitting\/proper\/to replace\/to regard as\/to think\/to pawn\/(coll.) to fail (a student)","to be\/to act as\/manage\/withstand\/when\/during\/ought\/should\/match equally\/equal\/same\/obstruct\/just at (a time or place)\/on the spot\/right\/just at"],"pinyin":["dang1","dang4"],"word":"當"}],"containing_words":[],"sentences":[{"english":"Chapter IV, The Criminal Subjective of Unjustifiable Self-defense.","chinese":"第四章防衛過當的主觀罪過形式。"},{"english":"Chapter II, Concept and nature of Unjustifiable Self-defense.","chinese":"文章主要對防衛過當的概念和本質進行了探討。"},{"english":"The first part, an overview of over-defense.","chinese":"第一部分，防衛過當概述。"},{"english":"It is very important and necessary to study the circumstance of the subjective crime of excessive defense.","chinese":"研究防衛過當的主觀罪過形式實屬重要。"},{"english":"And further analysis of the over-defense conviction and sentencing should grasp the elements.","chinese":"並進一步分析了對防衛過當定罪量刑應當把握的要素。"},{"english":"The third part, the criminal responsibility of over-defense.","chinese":"第三部分，防衛過當的刑事責任。"}],"related":[]}