{"definition":["supplementary\/incidentally\/in parentheses\/by chance\/in passing\/additionally\/secondary\/subsidiary\/to attach"],"pinyin":["fu4 dai4"],"simplified":["附带"],"rank":11096.0,"normalized_rank":0.15524743609474906,"fraction":0.000006970869615537848,"cumulative_fraction":0.9380208967010788,"word":"附帶","characters":[{"definition":["to add\/to attach\/to be close to\/to be attached"],"pinyin":["fu4"],"word":"附"},{"definition":["band\/belt\/girdle\/ribbon\/tire\/area\/zone\/region\/CL:條|条[tiao2]\/to wear\/to carry\/to take along\/to bear (i.e. to have)\/to lead\/to bring\/to look after\/to raise"],"pinyin":["dai4"],"word":"帶"}],"containing_words":[{"definition":["collateral damage (both as a legal term, and as a military euphemism)"],"pinyin":["fu4 dai4 sun3 hai4"],"word":"附帶損害"}],"sentences":[{"english":"Unlike those of the West, Chinese loans are \"no strings attached.\"","chinese":"不象西方國家，中國的貸款是“無附帶條件”。"},{"english":"Other pad irons not to be supplied along with equipments shall be provided by the bidder.","chinese":"設備未附帶的其它墊鐵由投標人提供。"},{"english":"Incidentally, here's a good piece of news.","chinese":"附帶告訴你一個好消息。"},{"english":"It also comes jam-packed with premade code snippets for common CSS styles.","chinese":"它還附帶果醬與常見的CSS樣式代碼段預製包裝。"},{"english":"Brain Freeze now only affects your frost damage spells with chilling effects.","chinese":"大腦凍結現在隻影響附帶寒冷效果的冰系傷害法術。"},{"english":"This software is sold or published without their source code.","chinese":"這種軟件出售或發佈時並沒有附帶源代碼。"},{"english":"Our code is in the solutions folder on the CD included with this book.","chinese":"我們的代碼在本書所附帶光盤中的解決方案文件夾中。"},{"english":"There is an increase in the occurrence of collateral damage during the course of our operation.","chinese":"我方執行任務其間，附帶性破壞的發生次數上升了。"},{"english":"This kind of previous job is accessary .","chinese":"這種事先的準備工作是附帶進行的。"},{"english":"The chairman accompanied his speech with gestures.","chinese":"會議主席作講演時附帶做着手勢。"},{"english":"There are also four adapters to charge some popular brand mobile phones.","chinese":"另外附帶四個轉接頭可以連接大多數品牌手機。"},{"english":"If aid is out of humanity, why should it be given with proviso ?","chinese":"西方的援助如果真的是出於人道，爲什麼要附帶條件？"},{"english":"The radio that came with the Evader worked just fine.","chinese":"附帶強制收兌的無線電工作就好了。"},{"english":"The book is not only new but also with a small disk.","chinese":"書並不舊並且附帶小盤，欣喜之餘特做此證明。"},{"english":"HBL Revision 99 comes with some major improvements.","chinese":"宏寶修訂99附帶一些重大改進。"},{"english":"If you use chlorine tablets or iodine tablets, follow the directions that come with the tablets.","chinese":"如果你使用氯片或碘片，遵照藥片附帶的指示使用。"}],"related":[{"definition":["this place\/here (literary)"],"pinyin":["ci3 chu4"],"word":"此處"},{"definition":["extra\/added\/additional"],"pinyin":["e2 wai4"],"word":"額外"},{"definition":["equivalent to\/appropriate\/considerably\/to a certain extent\/fairly\/quite"],"pinyin":["xiang1 dang1"],"word":"相當"},{"definition":["surname Ying","to agree (to do sth)\/should\/ought to\/must\/(legal) shall","to answer\/to respond\/to comply with\/to deal or cope with"],"pinyin":["Ying4","ying1","ying4"],"word":"應"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["content\/substance\/details\/CL:個|个[ge4],項|项[xiang4]"],"pinyin":["nei4 rong2"],"word":"內容"},{"definition":["only natural\/as it should be\/certainly\/of course\/without doubt"],"pinyin":["dang1 ran2"],"word":"當然"},{"definition":["and\/furthermore\/also\/together with\/(not) at all\/simultaneously\/to combine\/to join\/to merge"],"pinyin":["bing4"],"word":"並"},{"definition":["to have sth to do with\/to relate to\/related to\/to concern\/concerning"],"pinyin":["you3 guan1"],"word":"有關"},{"definition":["to have\/to involve"],"pinyin":["dai4 you3"],"word":"帶有"},{"definition":["value\/worth\/fig. values (ethical, cultural etc)\/CL:個|个[ge4]"],"pinyin":["jia4 zhi2"],"word":"價值"},{"definition":["and\/besides\/moreover\/furthermore\/in addition"],"pinyin":["bing4 qie3"],"word":"並且"},{"definition":["label\/tag\/tab (of a window) (computing)"],"pinyin":["biao1 qian1"],"word":"標籤"},{"definition":["general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead","to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])"],"pinyin":["jiang1","jiang4","qiang1"],"word":"將"},{"definition":["follow-up\/(dialect) to remarry"],"pinyin":["hou4 xu4"],"word":"後續"},{"definition":["among\/in the middle\/in the center"],"pinyin":["dang1 zhong1"],"word":"當中"}]}