{"definition":["determiner (in grammar, i.e. article, demonstrative, possessive pronoun, noun genitive etc)"],"pinyin":["xian4 ding4 ci2"],"simplified":["限定词"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"限定詞","characters":[{"definition":["limit\/bound\/to set a limit (on)"],"pinyin":["xian4"],"word":"限"},{"definition":["to set\/to fix\/to determine\/to decide\/to order"],"pinyin":["ding4"],"word":"定"},{"definition":["word\/statement\/speech\/lyrics\/CL:組|组[zu3],個|个[ge4]\/a form of lyric poetry, flourishing in the Song dynasty 宋朝|宋朝[Song4 chao2]\/CL:首[shou3]"],"pinyin":["ci2"],"word":"詞"}],"containing_words":[{"definition":["possessive (in grammar)"],"pinyin":["wu4 zhu3 xian4 ding4 ci2"],"word":"物主限定詞"}],"sentences":[{"english":"Determiners are used at the beginning of noun groups.","chinese":"限定詞用於名詞短語前面。"},{"english":"DP hypothesis concerns with determiner phrases.","chinese":"DP假說是關於限定詞短語的假說。"},{"english":"At last, a discussion concerning the treatment of these culture-bound words and phrases is presented.","chinese":"最後，詳細討論了這些文化限定詞的翻譯方法。"},{"english":"Supply suitable determiners in the following blanks where necessary.","chinese":"在下列空格中有必要的地方填上適當的限定詞。"},{"english":"You use specific determiners when people know exactly which things or people you are talking about.","chinese":"當所涉及之人物或事物確定，使用特定限定詞。"},{"english":"Now, all other things being equal is a big qualifier. Right?","chinese":"其他條件相同是一個很重要的限定詞，對吧？"},{"english":"But for brevity, you usually like to leave the package qualifier off. What happens if you do?","chinese":"但爲簡潔起見，通常不會指定變量的包限定詞。"},{"english":"Singular count nouns always take a determiner.","chinese":"可數名詞單數前需用限定詞。"},{"english":"Plural count nouns do not need a determiner.","chinese":"可數名詞複數前不需用限定詞。"},{"english":"It moves beyond the shallow \"pass\" or \"fail\" qualifiers.","chinese":"它超越了“通過”或“失敗”限定詞的範疇。"},{"english":"You can use this new qualifier to control transaction boundaries.","chinese":"可以使用這個新限定詞控制事務邊界。"},{"english":"I claim that the definite article takes up the head position of D.","chinese":"本文認爲，定冠詞位於限定詞的中心語位置。"},{"english":"Singular nouns are used only in the singular, always with a determiner.","chinese":"單數名詞只有單數形式，總是與限定詞連用。"},{"english":"Please refer to chapter 5 Determiners for the details of determiners .","chinese":"限定詞的詳情，請參考本書第5章限定詞。"},{"english":"Please refer to chapter 5 Determiners for the details of determiners .","chinese":"限定詞的詳情，請參考本書第5章限定詞。"},{"english":"In English the determiner and the noun it precedes should concord in number .","chinese":"英語中，限定詞和名詞在數上應該保持一致。"}],"related":[]}