{"definition":["to eliminate"],"pinyin":["chu2 diao4"],"simplified":["除掉"],"rank":22374.0,"normalized_rank":0.3130412883186658,"fraction":0.000001893475798026122,"cumulative_fraction":0.9798872955587068,"word":"除掉","characters":[{"definition":["to get rid of\/to remove\/to exclude\/to eliminate\/to wipe out\/to divide\/except\/not including"],"pinyin":["chu2"],"word":"除"},{"definition":["to fall\/to drop\/to lag behind\/to lose\/to go missing\/to reduce\/fall (in prices)\/to lose (value, weight etc)\/to wag\/to swing\/to turn\/to change\/to exchange\/to swap\/to show off\/to shed (hair)\/(used after certain verbs to express completion, fulfillment, removal etc)"],"pinyin":["diao4"],"word":"掉"}],"containing_words":[],"sentences":[{"english":"The motion that the remark of the last speaker be expunged from the record.","chinese":"該提議要求把最後一個發言的人的講話從記錄上除掉。"},{"english":"The motion that the remark of the last speaker (should) be expunged from the record.","chinese":"該提議要求把最後一個發言的人的講話從記錄上除掉。"},{"english":"It also wipes out the system restore with a reset, making it harder to recover the system.","chinese":"它還清除掉系統還原設置，使其難以恢復系統。"},{"english":"So he constantly removed distractions and demands on the conscious mind.","chinese":"因此，他不斷地移除掉意識心理上的干擾和要求。"},{"english":"Village work to get to meet with siew, he put away the resolution dove.","chinese":"中村功得以脫身去與蕭船見面，他決議除掉白鴿。"},{"english":"In that day the Lord will snatch away their finery: the bangles and headbands and crescent necklaces","chinese":"到那日，主必除掉她們華美的腳釧，髮網，月牙圈。"},{"english":"And Nathan said unto David, The LORD also hath put away thy sin; thou shalt not die.","chinese":"拿單說，耶和華已經除掉你的罪，你必不至於死。"},{"english":"The student whited out those letters at the edge of the page.","chinese":"那個學生把那頁邊上的字母除掉。"},{"english":"I used weedkiller to get rid of the weeds in the garden.","chinese":"我用殺蟲劑來除掉花園裏的蟲子。"},{"english":"Oppressed and condemned, he was taken away, and who would have thought any more of his destiny?","chinese":"他受了不義的審判而被除掉，有誰懷念他的命運？"},{"english":"Circumcise therefore the foreskin of your heart, and be no longer stubborn.","chinese":"所以你們要將心裏的污穢除掉，不可再硬著頸項。"},{"english":"Turk action qol at quite remove kato action failure.","chinese":"特科行動組組善於挺除掉加藤的行動失敗。"},{"english":"The Bible should be demythologized and examined for its historical value.","chinese":"應該除掉聖經的神話色彩，審視聖經的歷史價值。"},{"english":"The cashew nuts contain a toxin which is eliminated through frying.","chinese":"腰果堅果含有毒素，油炸後便會除掉。"},{"english":"Today, I got fed up with the amount of hair on my feet, so I went to get my foot hair waxed off.","chinese":"今天，我厭煩了腳上厚厚的汗毛，便去把它用蠟除掉。"},{"english":"The second hexane wash may be decanted off and the wet solid screened.","chinese":"第二次的乙烷洗液可以除掉，溼的固體進行過篩。"}],"related":[{"definition":["to root out\/to eradicate\/to sweep away\/to abolish"],"pinyin":["chan3 chu2"],"word":"剷除"},{"definition":["to kill"],"pinyin":["sha1 diao4"],"word":"殺掉"},{"definition":["to cut weeds and eliminate the roots (idiom); to destroy root and branch\/to eliminate completely"],"pinyin":["zhan3 cao3 chu2 gen1"],"word":"斬草除根"},{"definition":["to eradicate\/to exterminate"],"pinyin":["jian3 chu2"],"word":"剪除"},{"definition":["to kill\/to murder"],"pinyin":["zhu1 sha1"],"word":"誅殺"},{"definition":["to put an end to\/to annihilate\/to cause to perish\/to perish\/annihilation (in quantum field theory)"],"pinyin":["xiao1 mie4"],"word":"消滅"},{"definition":["to wipe out\/to exterminate"],"pinyin":["zhu1 chu2"],"word":"誅除"},{"definition":["to get rid of"],"pinyin":["gan4 diao4"],"word":"幹掉"},{"definition":["remnants (of a defeated clique)\/rump"],"pinyin":["yu2 dang3"],"word":"餘黨"},{"definition":["to eliminate"],"pinyin":["mie4 diao4"],"word":"滅掉"},{"definition":["to eliminate (by armed force)"],"pinyin":["jiao3 mie4"],"word":"剿滅"},{"definition":["henchmen"],"pinyin":["dang3 yu3"],"word":"黨羽"},{"definition":["to wipe out\/to exterminate"],"pinyin":["zhu1 mie4"],"word":"誅滅"},{"definition":["lit. calamity within one's bosom (idiom); major trouble hidden within"],"pinyin":["xin1 fu4 zhi1 huan4"],"word":"心腹之患"},{"definition":["to rope in\/fig. to involve sb\/to entice"],"pinyin":["la1 long3"],"word":"拉攏"},{"definition":["an execution\/to put sb to death"],"pinyin":["chu3 si3"],"word":"處死"}]}