{"definition":["cathode ray tube"],"pinyin":["yin1 ji2 she4 xian4 guan3"],"simplified":["阴极射线管"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"陰極射線管","characters":[{"definition":["overcast (weather)\/cloudy\/shady\/Yin (the negative principle of Yin and Yang)\/negative (electric.)\/feminine\/moon\/implicit\/hidden\/genitalia","surname Yin"],"pinyin":["Yin1","yin1"],"word":"陰"},{"definition":["extremely\/pole (geography, physics)\/utmost\/top"],"pinyin":["ji2"],"word":"極"},{"definition":["to shoot\/to launch\/to allude to\/radio- (chemistry)"],"pinyin":["she4"],"word":"射"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"},{"definition":["surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["Guan3","guan3"],"word":"管"}],"containing_words":[],"sentences":[{"english":"Three dispatchers were scanning cathode ray tube displays for information.","chinese":"三名調度員正在研究陰極射線管所顯示的情報。"},{"english":"The corresponding electric currents are used to deflect an electron beam in a cathode-ray tube.","chinese":"相應的電流就用來使陰極射線管裏的電子束偏轉。"},{"english":"The so - called visual display unit is in fact a cathode ray tube.","chinese":"所謂可見顯示裝置實際上是一個陰極射線管。"},{"english":"Disclosed is a storage-transport device of an electron gun with a cathode ray tube.","chinese":"一種陰極射線管電子槍儲運裝置。"},{"english":"The expression \"flat panel display\" does not cover cathode-ray tube technology.","chinese":"所稱“平板顯示”不包括陰極射線管技術。"},{"english":"And if I evacuate it, I have a cathode ray tube.","chinese":"如果我對其抽真空，我會得到一根陰極射線管。"},{"english":"The operation remained focused on traditional cathode-ray-tube TVs until this year.","chinese":"但湯姆遜直到今年仍專注於傳統的陰極射線管電視機。"},{"english":"A display device that uses a cathode ray tube.","chinese":"一種使用陰極射線管的顯示裝置。"}],"related":[]}