{"definition":["negative ion\/anion (physics)"],"pinyin":["yin1 li2 zi3"],"simplified":["阴离子"],"rank":55715.0,"normalized_rank":0.7795251353658025,"fraction":7.474054495330928e-8,"cumulative_fraction":0.99956923126341,"word":"陰離子","characters":[{"definition":["overcast (weather)\/cloudy\/shady\/Yin (the negative principle of Yin and Yang)\/negative (electric.)\/feminine\/moon\/implicit\/hidden\/genitalia","surname Yin"],"pinyin":["Yin1","yin1"],"word":"陰"},{"definition":["surname Li","to leave\/to part from\/to be away from\/(in giving distances) from\/without (sth)\/independent of\/one of the Eight Trigrams 八卦[ba1 gua4], symbolizing fire\/☲"],"pinyin":["Li2","li2"],"word":"離"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi3","zi5"],"word":"子"}],"containing_words":[{"definition":["anionic site"],"pinyin":["yin1 li2 zi3 bu4 wei4"],"word":"陰離子部位"}],"sentences":[{"english":"Hydrotalcite-like compounds are a sort of anionic clays with double-layer structure.","chinese":"水滑石類化合物是一種具有層狀結構的陰離子粘土。"},{"english":"On the contrary, for the anionic surfactant an opposite effect was observed.","chinese":"相反，對陰離子活性劑觀察到相反的效應。"},{"english":"BOD white water value in broken paper reclamation. It has unexampled excellent feature than anionic starch.","chinese":"BOD的含量，具有陰離子型澱粉無可比擬的優點。"},{"english":"Multifunctiona synergist MAT is a king of anionic surfactant.","chinese":"多功能增效劑MAT屬陰離子表面活性劑。"},{"english":"In this article, ion chromatography was used to analyze anion in latex.","chinese":"採用離子色譜法對乳膠製品中陰離子進行分析。"},{"english":"It'shows a thousandfold selectivity for fluoride over other common anions.","chinese":"它對氟離子的選擇性比其它普通陰離子高几千倍。"},{"english":"All anions were measured by means of conductivity detection.","chinese":"所有陰離子利用電導度檢測。"},{"english":"A fluorometric spectrophotometry was used to determine the content of anionic surfactant in crude oil.","chinese":"測定原油中所含的陰離子表面活性劑。"},{"english":"Anionic tungstate complex was synthesized by reaction of tungstate with tartaric acid.","chinese":"由鎢酸鹽和酒石酸反應合成了鎢陰離子配合物。"},{"english":"This study was performed to investigate the electrochemical oxidation of anionic surfactants.","chinese":"該研究調查了氧化的陰離子表面活性劑。"},{"english":"The anionic complex of VO2(PAR)-reacts with ethyl violet in the presence of PVA to form an ion-association complex.","chinese":"釩與PAR的絡陰離子和乙基紫反應形成離子締合物。"},{"english":"Various iodinated strong base quaternary ammonium anion exchange resins were prepared.","chinese":"製備了數種不同的強鹼型陰離子碘化樹脂。"},{"english":"The detection limits of cations were 0.","chinese":"陰離子的檢出限爲0。"},{"english":"Generally ionic salts with a large anion should have a high dissociation constant.","chinese":"一般情況下，包含大的陰離子的鹽具有高的分解常數。"},{"english":"The effect of anions could be neglected.","chinese":"陰離子對電流效率的作用可以忽略。"},{"english":"The retention behaviour and mechanism of organic acids on an anion exchange column Shim pack IC A1 (Shimadzu, Japan) have been studied.","chinese":"研究了有機酸在陰離子交換樹脂上的保留行爲。"}],"related":[]}