{"definition":["caught in (a bad situation)\/to fall into (trap etc)"],"pinyin":["xian4 yu2"],"simplified":["陷于"],"rank":16185.0,"normalized_rank":0.22644914862955245,"fraction":0.00000359776459163918,"cumulative_fraction":0.9636125570767974,"word":"陷於","characters":[{"definition":["pitfall\/trap\/to get stuck\/to sink\/to cave in\/to frame (false charge)\/to capture (a city in battle)\/to fall (to the enemy)\/defect"],"pinyin":["xian4"],"word":"陷"},{"definition":["(literary) Oh!\/Ah!","in\/at\/to\/from\/by\/than\/out of","surname Yu\/Taiwan pr. [Yu2]"],"pinyin":["Yu1","wu1","yu2"],"word":"於"}],"containing_words":[{"definition":["to be paralyzed\/at a standstill"],"pinyin":["xian4 yu2 tan1 huan4"],"word":"陷於癱瘓"}],"sentences":[{"english":"Rwanda was in the throes of genocide.","chinese":"盧旺達陷於種族滅絕的陣痛。"},{"english":"The disturbance of self-regard is absent in mourning; but otherwise the features are the same.","chinese":"在悲傷中不會陷於自重，但其他特點是相同的。"},{"english":"There have been no six-party talks with North Korea since 2009.","chinese":"六方會談自2009年以來一直陷於停頓。"},{"english":"You harshly scold your daughter for knocking the cup over. she breaks down in tears.","chinese":"你狠狠地臭罵女兒一頓，令她陷於痛苦之中。"},{"english":"Many of the Gods have fallen into a deep slumber.","chinese":"很多神靈已經陷於了深睡傍邊。"},{"english":"His anxieties threatened to unbalance his mind.","chinese":"他的憂慮可能使他陷於精神錯亂。"},{"english":"He was entrapped to destruction.","chinese":"他中計而陷於死地。"},{"english":"The North, by contrast, stagnates in isolation and depravation.","chinese":"相比之下，北邊仍然陷於孤立，貧困不堪。"},{"english":"It penalises lower-rated assets and rewards the spreading of risk.","chinese":"這使得低等級資產陷於不利處境但有利於分攤風險。"},{"english":"With a restricted range of foods, if children turn their nose up at one particular foodyouy, you could be stuck for choice.","chinese":"由於食物嚴格分類，如果孩子們挑食，你便陷於抉擇。"},{"english":"The most brilliant leadership can be mired in detail.","chinese":"最有才幹的領導也會陷於拘泥瑣事的困境中。"},{"english":"They were hopelessly deadlocked in almost total differences of opinion and outlook.","chinese":"他們絕望地陷於意見和觀點完全分歧的僵局之中。"},{"english":"Due to an unexpected situation, our plan will be put into cold storage until further notice.","chinese":"由於意外情況，我們的計畫陷於停頓，改日另行通知。"},{"english":"The general strike will disorganize the whole country.","chinese":"大罷工會使整個國家陷於混亂。"},{"english":"One circle system of ball games could possibly make one team into the most unfavorable situation.","chinese":"單循環賽制有可能使其中某隊陷於嚴重不公平的境地。"},{"english":"Many, who could not escape, were trapped and burned to death.","chinese":"許多鳥沒法逃走，陷於火宅而燒死了。"}],"related":[]}