{"definition":["in turn\/successively\/one after the other\/bit by bit"],"pinyin":["lu4 xu4"],"simplified":["陆续"],"rank":2454.0,"normalized_rank":0.03433464385152435,"fraction":0.00006051400337222594,"cumulative_fraction":0.7612322748843462,"word":"陸續","characters":[{"definition":["shore\/land\/continent","six (banker's anti-fraud numeral)","surname Lu"],"pinyin":["Lu4","liu4","lu4"],"word":"陸"},{"definition":["to continue\/to replenish"],"pinyin":["xu4"],"word":"續"}],"containing_words":[{"definition":["in succession\/one after another\/continuously"],"pinyin":["lu4 lu4 xu4 xu4"],"word":"陸陸續續"}],"sentences":[{"english":"Reports of deaths across the country trickle in almost every day.","chinese":"全國各地的死亡報告幾乎每天都陸陸續續傳來。"},{"english":"At about that time the debris began to hit the ground.","chinese":"差不多在那時，航天飛機殘骸開始陸續撞到地面。"},{"english":"After the bell rang, a succession of little visitors came to our door, vying to see Holly.","chinese":"鈴響後，一夥小參觀者陸續來到門前，爭着要看霍莉。"},{"english":"Please be informed that Property Management Company is conducting continuously HVAC conversion works to CCP.","chinese":"物業公司正在陸續對園區各樓進行空調轉換工作。"},{"english":"There might be more after that, including an immense bundle of confidential diplomatic cables.","chinese":"陸續可能還有大量貨色，包括成堆的機密外交電報。"},{"english":"Our publication house plans to publish a series of modern versions of the classics.","chinese":"出版社計劃陸續出版一些古代經籍的白話譯文。"},{"english":"Recently I put my photos in order and will post them here one by one.","chinese":"最近抽空整理了一些相片，會將它們陸續傳上來。"},{"english":"The next morning, the courtroom began filling up at eight-thirty.","chinese":"第二天早上，八點半的時候人們開始陸續進入法庭。"},{"english":"Every October, white storks fly to the South to spend the winter.","chinese":"十月的時候，白鸛會陸續飛往南方過冬。"},{"english":"Helicopters delivered materials for the operation Monday morning at the top of the dam.","chinese":"26日上午，多架直升機已陸續將物資運抵壩頂。"},{"english":"Non- motorized access will be in the \"three vertical and three horizontal\" peripheral gradually open up.","chinese":"非機動車通道將在“三橫三縱”的周邊陸續開闢。"},{"english":"At present, some of these people have returned home.","chinese":"目前一些邊民已經陸續返回。"},{"english":"However afterwards one after another attended each competition and wins an award.","chinese":"然而後來就陸陸續續地參加各項的比賽並獲獎。"},{"english":"Ocular infections with helminthic parasites are uncommon and have been well described previously.","chinese":"眼睛的寄生蟲感染相當少見，但陸續都有病例被報告。"},{"english":"Scores of books have followed, selling millions of copies.","chinese":"海量的讀物陸續出版，熱賣多達上百萬冊。"},{"english":"They were decommissioned from combat successively from the beginning of this century.","chinese":"這些戰略導彈從本世紀初開始陸續退出戰鬥序列。"}],"related":[{"definition":["in succession\/following closely"],"pinyin":["xiang1 ji4"],"word":"相繼"},{"definition":["auxiliary verb introducing future action: may (be able to)\/will (cause)\/should (enable)\/going to"],"pinyin":["jiang1 hui4"],"word":"將會"},{"definition":["many\/multiple\/multi- (faceted, ethnic etc)"],"pinyin":["duo1 ge5"],"word":"多個"},{"definition":["to forecast\/to predict\/to estimate"],"pinyin":["yu4 ji4"],"word":"預計"},{"definition":["related\/relevant\/pertinent\/to be interrelated\/(statistics) correlation"],"pinyin":["xiang1 guan1"],"word":"相關"},{"definition":["plan\/project\/program\/to plan\/to map out\/CL:個|个[ge4],項|项[xiang4]"],"pinyin":["ji4 hua4"],"word":"計劃"},{"definition":["on the eve of\/to be about to\/to be on the verge of"],"pinyin":["ji2 jiang1"],"word":"即將"},{"definition":["variant of 計劃|计划[ji4 hua4]"],"pinyin":["ji4 hua4"],"word":"計畫"},{"definition":["along with\/in the wake of\/following"],"pinyin":["sui2 zhe5"],"word":"隨著"},{"definition":["one after another\/in succession\/one by one\/continuously\/diverse\/in profusion\/numerous and confused\/pell-mell"],"pinyin":["fen1 fen1"],"word":"紛紛"},{"definition":["follow-up\/(dialect) to remarry"],"pinyin":["hou4 xu4"],"word":"後續"},{"definition":["general\/commander-in-chief (military)\/king (chess piece)\/to command\/to lead","to desire\/to invite\/to request","will\/shall\/to use\/to take\/to checkmate\/just a short while ago\/(introduces object of main verb, used in the same way as 把[ba3])"],"pinyin":["jiang1","jiang4","qiang1"],"word":"將"},{"definition":["to participate (in sth)"],"pinyin":["can1 yu4"],"word":"參與"},{"definition":["numerous"],"pinyin":["zhong4 duo1"],"word":"眾多"},{"definition":["to begin\/beginning\/to start\/initial\/CL:個|个[ge4]"],"pinyin":["kai1 shi3"],"word":"開始"},{"definition":["among\/in the middle\/in the center"],"pinyin":["dang1 zhong1"],"word":"當中"}]}