{"definition":["the factorial of a number, e.g. 5! = 5.4.3.2.1 = 120"],"pinyin":["jie1 cheng2"],"simplified":["阶乘"],"rank":69852.0,"normalized_rank":0.9773201068935122,"fraction":3.3574854178244397e-9,"cumulative_fraction":0.9999961175790232,"word":"階乘","characters":[{"definition":["rank or step\/stairs"],"pinyin":["jie1"],"word":"階"},{"definition":["four horse military chariot (archaic)\/four (archaic)\/generic term for history books","surname Cheng","to ride\/to mount\/to make use of\/to avail oneself of\/to take advantage of\/to multiply (math.)\/Buddhist sect or creed"],"pinyin":["Cheng2","cheng2","sheng4"],"word":"乘"}],"containing_words":[],"sentences":[{"english":"This limits greatly the possible range of your factorial function.","chinese":"這極大地限制了階乘函數的可能範圍。"},{"english":"So there's no N factorial involved here.","chinese":"所以不包含N的階乘。"},{"english":"Divided by NA factorial times the same thing for B.","chinese":"再除以NA的階乘，對B同樣。"},{"english":"There are a few features of this factorial function that are interesting.","chinese":"這個階乘函數有幾個非常有趣的地方。"},{"english":"How to use extended precision arithmetic to handle bigger factorials?","chinese":"如何使用擴展精度運算處理更大的階乘？"},{"english":"The symbol now has two meanings, the combinatorial and the factorial.","chinese":"現在符號有兩重意義，即組合意義和階乘意義。"},{"english":"If you've written factorial code, you've probably noticed that the code is still wrong.","chinese":"編寫了階乘代碼後，您可能發現該代碼仍有錯誤。"},{"english":"So this is going to turn out to be a relatively simple case, because the factorials are going to cancel.","chinese":"這樣將產生一個相對簡單的結果，因爲階乘被消去了。"},{"english":"When factorials are needed they are read from the table.","chinese":"當需要階乘時，將從該表中讀取階乘。"},{"english":"When factorials are needed they are read from the table.","chinese":"當需要階乘時，將從該表中讀取階乘。"},{"english":"Now, let's return to the factorial function.","chinese":"現在，讓我們回到階乘函數上來。"},{"english":"In this example, a table of factorials is calculated once.","chinese":"該示例將計算一次階乘表。"},{"english":"Like particles, you have to divide by N factorial. .","chinese":"像粒子這樣，你需要除以N的階乘。"},{"english":"What would be an efficient way of calculating ratio of two factorials with arbitrary precision?","chinese":"什麼是兩階乘計算任意精度比的一種有效途徑？"}],"related":[]}