{"definition":["according to custom\/to do as local custom requires\/do as the Romans do"],"pinyin":["sui2 su2"],"simplified":["随俗"],"rank":54893.0,"normalized_rank":0.7680242888923091,"fraction":8.276931443071553e-8,"cumulative_fraction":0.9995044916456688,"word":"隨俗","characters":[{"definition":["surname Sui","to follow\/to comply with\/varying according to...\/to allow\/subsequently"],"pinyin":["Sui2","sui2"],"word":"隨"},{"definition":["custom\/convention\/popular\/common\/coarse\/vulgar\/secular"],"pinyin":["su2"],"word":"俗"}],"containing_words":[{"definition":["When you enter a village, follow the local customs (idiom); do as the natives do\/When in Rome, do as the Romans do"],"pinyin":["ru4 xiang1 sui2 su2"],"word":"入鄉隨俗"},{"definition":["When you enter a country, follow the local customs (idiom); do as the natives do\/When in Rome, do as the Romans do"],"pinyin":["ru4 jing4 sui2 su2"],"word":"入境隨俗"}],"sentences":[{"english":"When in Rome, do as the Romans do and take the chance to practice your English skills.","chinese":"入鄉隨俗，同時利用這個機會來練練你的英語吧。"},{"english":"Follow the customs of the new country you are in, or keep your own customs?","chinese":"入鄉隨俗還是保留自己國家的習俗？"},{"english":"But when you go to the United States, you had better \"do as the Romans do.\"","chinese":"若你們去美國，最好還是“入境隨俗”。"},{"english":"Why were they like this?For the same reasons many Christians mingle with the world today.","chinese":"其實，今天的基督徒也有這種隨俗的心態。"},{"english":"For the same reasons many Christians mingle with the world today.","chinese":"其實，今天的基督徒也有這種隨俗的心態。"},{"english":"They assumed that immigrants would quickly adopt the mores of their host societies.","chinese":"他們認爲，移民會很快入鄉隨俗，向主流社會靠近。"},{"english":"A man must consider what a blind man's-buff is this game of conformity.","chinese":"一個人必須要想到，隨衆隨俗無異於矇住你的眼睛。"},{"english":"The best way is to not comment, do as the Romans do, as soon as possible into the team.","chinese":"最好的做法就是不加評論，入鄉隨俗，儘快融入團隊。"},{"english":"They just do so out of social customs.","chinese":"大多數人這樣做只是隨俗而已。"},{"english":"For nonconformity, the world whips you with its displeasure.","chinese":"只因不隨俗，整個世界都不悅鞭策着你。"},{"english":"Respect other cultures. Try to blend in as much as possible.","chinese":"尊重當地文化，要入鄉隨俗。"}],"related":[]}