{"definition":["to follow the crowd\/going with the tide"],"pinyin":["sui2 da4 liu2"],"simplified":["随大流"],"rank":39398.0,"normalized_rank":0.5512291354777329,"fraction":4.065476908104811e-7,"cumulative_fraction":0.9962505789598594,"word":"隨大流","characters":[{"definition":["surname Sui","to follow\/to comply with\/varying according to...\/to allow\/subsequently"],"pinyin":["Sui2","sui2"],"word":"隨"},{"definition":["big\/huge\/large\/major\/great\/wide\/deep\/older (than)\/oldest\/eldest\/greatly\/very much\/(dialect) father\/father's elder or younger brother","see 大夫[dai4 fu5]"],"pinyin":["da4","dai4"],"word":"大"},{"definition":["to flow\/to disseminate\/to circulate or spread\/to move or drift\/to degenerate\/to banish or send into exile\/stream of water or sth resembling one\/class, rate or grade"],"pinyin":["liu2"],"word":"流"}],"containing_words":[{"definition":["not following the crowd\/to go against the tide"],"pinyin":["bu4 sui2 da4 liu2"],"word":"不隨大流"}],"sentences":[{"english":"Conforming also makes people feel better about themselves by bolstering self-confidence.","chinese":"隨大流可以增加自信使人們自我感覺更好。"},{"english":"Our preferences are shaped by the masses.","chinese":"我們的偏好其實是“隨大流”的。"},{"english":"2-Don't follow the crowd, follow your own way. Do what you love.","chinese":"不要隨大流，走自己的路，做你所喜歡的。"},{"english":"People use conformity to ingratiate themselves with others.","chinese":"人們利用隨大流來討好其他人。"},{"english":"The people who truly succeed in life are those who didn’t follow the crowd.","chinese":"在生活中真正成功的人是那些不隨大流的人。"},{"english":"The strong-minded rarely follow the crowd.","chinese":"意志堅強的人很少隨大流。"},{"english":"On most issues, he followed the crowd.","chinese":"在大部分問題上，他都隨大流。"},{"english":"I just do it to conform.","chinese":"我這麼做只是隨大流。"},{"english":"He is mainstream on most issues, but not all.","chinese":"雖然很多事他都隨大流，但也有例外。"},{"english":"At the end I listened to them and started ignoring him and pulling faces.","chinese":"最後我也只能隨大流，不理他又向他做鬼臉。"},{"english":"Social approval People use conformity to ingratiate themselves with others.","chinese":"社會認可人們利用隨大流來討好其他人。"}],"related":[]}