{"definition":["random number"],"pinyin":["sui2 ji1 shu4"],"simplified":["随机数"],"rank":59953.0,"normalized_rank":0.8388202538021351,"fraction":4.189557890937453e-8,"cumulative_fraction":0.9998129356562576,"word":"隨機數","characters":[{"definition":["surname Sui","to follow\/to comply with\/varying according to...\/to allow\/subsequently"],"pinyin":["Sui2","sui2"],"word":"隨"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"},{"definition":["frequently\/repeatedly","number\/figure\/several\/CL:個|个[ge4]","to count\/to count as\/to regard as\/to enumerate (sb's shortcomings)"],"pinyin":["shu3","shu4","shuo4"],"word":"數"}],"containing_words":[],"sentences":[{"english":"Initializes the random-number generator.","chinese":"初始化隨機數生成器。"},{"english":"We will put the random number if to one of four \"buckets\".","chinese":"我們將隨機數放入四個“桶”中。"},{"english":"To enter the random number, select the primality testing algorithm for primality testing.","chinese":"對輸入的隨機數，選擇素性檢測算法進行素性檢測。"},{"english":"Computers usually only generate pseudorandom numbers.","chinese":"計算機通常只生成僞隨機數。"},{"english":"Assigning random numbers to execution threads will help you achieve this.","chinese":"向執行線程分配隨機數將幫助您實現這個目的。"},{"english":"I specialized in the process of random number generation.","chinese":"我專門研究隨機數生成過程。"},{"english":"The sender and recipient each keep a liner congruential random number generator for their connections.","chinese":"送出者和吸收者都爲連接準備一個隨機數發生器。"},{"english":"For example, consider a random number generator.","chinese":"例如，考慮一個隨機數產生器。"},{"english":"A randomizer button, displaying a quote from a list of about 30.","chinese":"一個隨機數發生器按鈕，顯示來自約30清單報價。"},{"english":"If you move right there is Page 2, the randomizer button page.","chinese":"如果您移動右邊是第2頁的隨機數發生器按鈕的頁面。"},{"english":"Spawning a random number of movieclips - function doesn't work?","chinese":"產生隨機數的影片剪輯功能不工作？"},{"english":"Returns a nonnegative random number less than the specified maximum.","chinese":"返回一個小於所指定最大值的非負隨機數。"},{"english":"Other enhancements are on-device random number generation and double precision support.","chinese":"其他的增強有設備的隨機數生成器以及雙精度的支持。"},{"english":"The random number is for demonstration purposes.","chinese":"隨機數只是用於演示目的。"},{"english":"Thus, in this example, I shall use this random number technique.","chinese":"因而在這個例子中，我將使用這種隨機數技術。"}],"related":[]}