{"definition":["to parrot other people's words (idiom); to chime in with others"],"pinyin":["sui2 sheng1 fu4 he4"],"simplified":["随声附和"],"rank":48076.0,"normalized_rank":0.6726456144278259,"fraction":1.7590304036862823e-7,"cumulative_fraction":0.9986524819862128,"word":"隨聲附和","characters":[{"definition":["surname Sui","to follow\/to comply with\/varying according to...\/to allow\/subsequently"],"pinyin":["Sui2","sui2"],"word":"隨"},{"definition":["sound\/voice\/tone\/noise\/reputation\/classifier for sounds"],"pinyin":["sheng1"],"word":"聲"},{"definition":["to add\/to attach\/to be close to\/to be attached"],"pinyin":["fu4"],"word":"附"},{"definition":["and\/together with\/with\/sum\/union\/peace\/harmony\/Taiwan pr. [han4] when it means \"and\" or \"with\"","surname He\/Japanese (food, clothes etc)","to combine a powdery substance (flour, plaster etc) with water\/Taiwan pr. [huo4]","to complete a set in mahjong or playing cards","to compose a poem in reply (to sb's poem) using the same rhyme sequence\/to join in the singing\/to chime in with others","to mix (ingredients) together\/to blend\/classifier for rinses of clothes\/classifier for boilings of medicinal herbs"],"pinyin":["He2","he2","he4","hu2","huo2","huo4"],"word":"和"}],"containing_words":[],"sentences":[{"english":"What he says is ridiculous, yet many people echo his words.","chinese":"他的講話真荒唐，但有很多人隨聲附和。"},{"english":"They echoed every word of their leader.","chinese":"他們隨聲附和他們領導人的每句話。"},{"english":"He echoed every word of his superior.","chinese":"隨聲附和他上級的每一句話。"},{"english":"“Yeah, the same, ” Matthew echoed, a dim grin on his face.","chinese":"“是啊，一樣，”馬修隨聲附和，臉上笑意隱約。"},{"english":"Only my voice took up the tunes, and my heart danced in their cadence.","chinese":"我只隨聲附和，我的心應節跳舞。"},{"english":"If Kyl agrees, the majority of the caucus will follow suit.","chinese":"假如凱爾同意，核心會議的多數人會隨聲附和。"},{"english":"What he said is ridiculous, but many people echoed his words.","chinese":"他的講話真荒唐，但竟然有很多人隨聲附和。"},{"english":"They echoed every word of their leader .","chinese":"他們隨聲附和他們首領的每一句話。"}],"related":[]}