{"definition":["(of a price) to fluctuate according to the market\/to sell at the market price"],"pinyin":["sui2 hang2 jiu4 shi4"],"simplified":["随行就市"],"rank":35666.0,"normalized_rank":0.4990136135323829,"fraction":5.715024091644646e-7,"cumulative_fraction":0.9944403717197474,"word":"隨行就市","characters":[{"definition":["surname Sui","to follow\/to comply with\/varying according to...\/to allow\/subsequently"],"pinyin":["Sui2","sui2"],"word":"隨"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"},{"definition":["at once\/right away\/only\/just (emphasis)\/as early as\/already\/as soon as\/then\/in that case\/as many as\/even if\/to approach\/to move towards\/to undertake\/to engage in\/to suffer\/subjected to\/to accomplish\/to take advantage of\/to go with (of foods)\/with regard to\/concerning"],"pinyin":["jiu4"],"word":"就"},{"definition":["market\/city\/CL:個|个[ge4]"],"pinyin":["shi4"],"word":"市"}],"containing_words":[],"sentences":[{"english":"Market regulations of foreign exchange quotas and cash remittances are permitted, and prices are e changeable according t changes of the market.","chinese":"允許外匯額度和現匯進行市場調節，價格隨行就市。"},{"english":"Peasants now sell vegetables at moving prices determined by their supply and their customer's demand.","chinese":"現在農民出售蔬菜，價格都是隨行就市。"},{"english":"Market regulations of foreign exchange quotas and cash remittances are permitted and prices are changeable according t changes of the market.","chinese":"允許外匯額度和現匯進行市場調理，價格隨行就市。"}],"related":[]}