{"definition":["to accompany"],"pinyin":["sui2 xing2"],"simplified":["随行"],"rank":12918.0,"normalized_rank":0.18073957998125167,"fraction":0.0000054033618582944195,"cumulative_fraction":0.9492019438393028,"word":"隨行","characters":[{"definition":["surname Sui","to follow\/to comply with\/varying according to...\/to allow\/subsequently"],"pinyin":["Sui2","sui2"],"word":"隨"},{"definition":["row\/line\/commercial firm\/line of business\/profession\/to rank (first, second etc) among one's siblings (by age)\/(in data tables) row\/(Tw) column","to walk\/to go\/to travel\/a visit\/temporary\/makeshift\/current\/in circulation\/to do\/to perform\/capable\/competent\/effective\/all right\/OK!\/will do\/behavior\/conduct\/Taiwan pr. [xing4] for the behavior-conduct sense"],"pinyin":["hang2","xing2"],"word":"行"}],"containing_words":[{"definition":["entourage\/retinue"],"pinyin":["sui2 xing2 ren2 yuan2"],"word":"隨行人員"},{"definition":["(of a price) to fluctuate according to the market\/to sell at the market price"],"pinyin":["sui2 hang2 jiu4 shi4"],"word":"隨行就市"}],"sentences":[{"english":"This form is to be completed in English and Chinese by non-travelling parents of minors under 18 years of age.","chinese":"此表格由十八歲以下申請人的不隨行父母填寫。"},{"english":"Cissokho's entourage are also in Milan and they are concerned.","chinese":"西索霍的隨行人員也一直米蘭，他們對此憂心忡忡。"},{"english":"A chef who was traveling with the group was also hurt, so everyone started cooking, Mr. Dhao said.","chinese":"隨行而來的廚師也受了傷，所以每個人都成了廚子。"},{"english":"He discover two same, so he ask retinue .","chinese":"他發現兩個相同的，所以他要求隨行人員。"},{"english":"The idea is to compact distances between lead and following cars.","chinese":"其實就是要縮短領頭車和隨行車輛的距離。"},{"english":"This system is a friction-free alternative to trailing cables, such as with high-bay stackers.","chinese":"該系統無摩擦，是替隨行電纜的良好替代品。"},{"english":"The party entered holy Benares by boat along the Ganges .","chinese":"隨行人員乘小舟延着恆河進入神聖的貝拿勒斯。"},{"english":"On this splendid season, let dazzle colour with you all the way accompanying.","chinese":"在這個燦爛的季節，讓炫彩伴你一路隨行。"},{"english":"The images moonlight, frost, moon are much more than arbitrary symbols.","chinese":"月光，白霜，明月的意象，比象徵更加隨行。"},{"english":"A number of experienced staff went with the students on both Shanghai and Beijing trips.","chinese":"隨行的還包括我校幾位有豐富面試經驗的教職工。"},{"english":"An example of an advanced body signal is seen during heeling.","chinese":"一個高級身體信號的例子就是隨行訓練中的目光。"},{"english":"Scientists also went with their experiments, engineers with their screwdrivers.","chinese":"科學家和工程師也會各自帶着實驗設備和螺絲刀隨行。"},{"english":"Market regulations of foreign exchange quotas and cash remittances are permitted, and prices are e changeable according t changes of the market.","chinese":"允許外匯額度和現匯進行市場調節，價格隨行就市。"},{"english":"Peasants now sell vegetables at moving prices determined by their supply and their customer's demand.","chinese":"現在農民出售蔬菜，價格都是隨行就市。"},{"english":"Within a year, he had acquired several oceangoing vessels.","chinese":"一年之內，他吸引“捕獲”了好幾艘遠洋航行船隨行。"},{"english":"Another path bit golden couple also accompanying.","chinese":"另外程咬金夫婦亦隨行。"}],"related":[{"definition":["to carry\/to take along\/to bring along\/to hold (hands)\/also pr. [xi1]"],"pinyin":["xie2"],"word":"攜"},{"definition":["visitor\/guest\/object (in grammar)"],"pinyin":["bin1"],"word":"賓"},{"definition":["at sb's invitation\/on invitation"],"pinyin":["ying4 yao1"],"word":"應邀"},{"definition":["to be present\/to be on the scene"],"pinyin":["zai4 chang3"],"word":"在場"},{"definition":["to lead a group\/leader of a group\/captain (of sports squad)"],"pinyin":["ling3 dui4"],"word":"領隊"},{"definition":["to pay a visit"],"pinyin":["lai2 fang3"],"word":"來訪"},{"definition":["to go on a tour\/to have an outing"],"pinyin":["chu1 you2"],"word":"出遊"},{"definition":["to meet with\/meeting"],"pinyin":["hui4 mian4"],"word":"會面"},{"definition":["on that day","that very day\/the same day"],"pinyin":["dang1 ri4","dang4 ri4"],"word":"當日"},{"definition":["to visit\/to call on\/to seek\/to inquire\/to investigate"],"pinyin":["fang3"],"word":"訪"},{"definition":["to pay a visit"],"pinyin":["dao4 fang3"],"word":"到訪"},{"definition":["to present as a gift"],"pinyin":["zeng4 song4"],"word":"贈送"},{"definition":["numerous"],"pinyin":["zhong4 duo1"],"word":"眾多"},{"definition":["honored guest\/distinguished guest\/VIP"],"pinyin":["gui4 bin1"],"word":"貴賓"},{"definition":["family member\/(family) dependent"],"pinyin":["jia1 shu3"],"word":"家屬"},{"definition":["to meet\/to rendezvous\/to merge\/to link up\/meeting\/confluence"],"pinyin":["hui4 he2"],"word":"會合"}]}