{"definition":["narrowly\/almost\/nearly"],"pinyin":["xian3 xie1"],"simplified":["险些"],"rank":10020.0,"normalized_rank":0.14019280007835128,"fraction":0.000008234159998401007,"cumulative_fraction":0.929862728859804,"word":"險些","characters":[{"definition":["danger\/dangerous\/rugged"],"pinyin":["xian3"],"word":"險"},{"definition":["classifier indicating a small amount or small number greater than 1: some, a few, several"],"pinyin":["xie1"],"word":"些"}],"containing_words":[],"sentences":[{"english":"One car went too fast and narrowly missed hitting another car.","chinese":"一輛汽車開得太快，險些兒撞上另一輛汽車。"},{"english":"She nearly fell down by stumbling over my stretched leg.","chinese":"她絆在我伸出的腿上，險些跌倒。"},{"english":"Emotional when the mirror will be almost blurted out the true identity of the Ming house.","chinese":"情緒激動之時，明鏡險些將明樓的真實身份脫口而出。"},{"english":"He received severe injuries and nearly lost his life during the Second World War.","chinese":"在第二次世界大戰期間他身負重傷險些喪命。"},{"english":"In February she nearly died after eating a lightbulb.","chinese":"在今年2月份，她就因喫下燈泡險些喪命。"},{"english":"Betrayed by his friends, nearly to death.","chinese":"曾因同伴背叛險些喪命，後爲蠻幽王所救。"},{"english":"Almost none of them agreed to this arrangement.","chinese":"險些沒有人同意這種按排。"},{"english":"Blade regiment several times, but nearly will also save himself falling.","chinese":"刀鋒貪生怕死幾次撲救，卻險些也將本人墮入。"},{"english":"Giggs almost delivered a second outstanding goal midway through a far more open second half.","chinese":"在下半場中段，吉格斯險些再次打入一粒精彩入球。"},{"english":"He dived into the lake to save the drowning child.","chinese":"他跳入湖裏救出險些兒淹死的那個孩子。"},{"english":"She saved a lot of ants from getting stepped on.","chinese":"她還救了許多險些被踩死的螞蟻。"},{"english":"I was caught off balance by the sudden wind and nearly fell.","chinese":"突然一陣風吹得我東搖西晃險些倒。"},{"english":"His hesitation nearly cost him the chance.","chinese":"他的猶豫險些讓他錯過機會。"},{"english":"A boulder rolled down the slope and narrowly missed the car.","chinese":"一塊石頭從山上滾下，險些把車砸壞。"},{"english":"The car only just cleared (ie nearly hit) the gatepost .","chinese":"汽車險些碰上門柱。"},{"english":"He nearly fell down steep ravines several times in Vietnam and Laos.","chinese":"在越南和老撾，他有好幾次都險些墜入陡峭的峽谷。"}],"related":[]}