{"definition":["aggregate\/ensemble\/bundle"],"pinyin":["ji2 he2 ti3"],"simplified":["集合体"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"集合體","characters":[{"definition":["to gather\/to collect\/collected works\/classifier for sections of a TV series etc: episode"],"pinyin":["ji2"],"word":"集"},{"definition":["100 ml\/one-tenth of a peck\/measure for dry grain equal to one-tenth of sheng 升 or liter, or one-hundredth dou 斗","to close\/to join\/to fit\/to be equal to\/whole\/together\/round (in battle)\/conjunction (astronomy)\/1st note of pentatonic scale\/old variant of 盒[he2]"],"pinyin":["ge3","he2"],"word":"合"},{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"}],"containing_words":[],"sentences":[{"english":"We're basically a set of equilibria in a big membrane.","chinese":"我們本質上就是一系列膜的平衡的集合體。"},{"english":"Potential sources are the aggregates of probable epicenters in the future.","chinese":"潛在震源區是未來可能的震中集合體。"},{"english":"Additionally, a software service may itself be an aggregate of other software services.","chinese":"另外，一項軟件服務本身就是其它軟件服務的集合體。"},{"english":"Understanding the interactions required of a framework aids in the development of new ensembles.","chinese":"瞭解框架必需的交互有助於開發新的集合體。"},{"english":"We are becoming a planet of racial and cultural hybrids.","chinese":"我們的星球正變成一個各種族和文化的集合體。"},{"english":"Natural talc is a multimineral aggregate.","chinese":"天然滑石礦是多種礦物的集合體。"},{"english":"The aggregation is a count of members.","chinese":"多晶硅是細小硅晶的集合體。"},{"english":"Ownership has been described as \"the entirety of powers of use and disposal allowed by law\".","chinese":"所有權被稱作是䏰“法定使用權和處置權的集合體。”"},{"english":"But you can think about the human brain as a collection of specialized tools.","chinese":"但我們認爲人腦纔是所有特殊的工具的集合體。"},{"english":"An aggregation of fragments is the only kind of whole we now have.","chinese":"這種碎片的集合體是我們現有的唯一完整無缺的方式。"},{"english":"Modern metropolitans is the very hugeness aggregate of the isolated buildings.","chinese":"現代大城市正是聚集了這種孤立建築物的龐大集合體。"},{"english":"A submicroscopic aggregate of organic and inorganic molecules in colloidal solution.","chinese":"有機分子和無機分子在膠體溶液中的亞微觀集合體。"},{"english":"The form of secondary minerals is schistose aggregated and spherical.","chinese":"次生礦物形態主要呈片狀集合體和球狀體。"},{"english":"This writing will deal only with the welting of single fiber elements and not fiber assemblies.","chinese":"這章論述內容只限於單纖維，而不涉及纖維集合體。"},{"english":"The operetta is a pastiche of 18th century style.","chinese":"輕喜劇是18世紀風格的集合體。"}],"related":[]}