{"definition":["lit. to paint holding two brushes (idiom); fig. to work on two tasks at the same time\/to attack one problem from two angles at the same time"],"pinyin":["shuang1 guan3 qi2 xia4"],"simplified":["双管齐下"],"rank":27555.0,"normalized_rank":0.385530200215466,"fraction":0.0000011758497843728635,"cumulative_fraction":0.9876687587913024,"word":"雙管齊下","characters":[{"definition":["surname Shuang","two\/double\/pair\/both\/even (number)"],"pinyin":["Shuang1","shuang1"],"word":"雙"},{"definition":["surname Guan","to take care (of)\/to control\/to manage\/to be in charge of\/to look after\/to run\/to care about\/tube\/pipe\/woodwind\/classifier for tube-shaped objects\/particle similar to 把[ba3] in 管...叫 constructions\/writing brush\/(coll.) to\/towards"],"pinyin":["Guan3","guan3"],"word":"管"},{"definition":["(name of states and dynasties at several different periods)\/surname Qi","neat\/even\/level with\/identical\/simultaneous\/all together\/to even sth out"],"pinyin":["Qi2","qi2"],"word":"齊"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[{"english":"Most transnational corporations engaged in food marketing have done both.","chinese":"大多數從事食品營銷的跨國公司都在雙管齊下。"},{"english":"Akula Subs and Apocalypse Tanks fire their load at the same time.","chinese":"阿庫拉潛艇和天啓坦克現在可以雙管齊下。"},{"english":"Additionally, mass publicity and appropriate economic methods should be carried out alongside. (Translated by Jieping Hu.","chinese":"另外，公衆宣傳和適當的經濟手段應該雙管齊下。"},{"english":"Instead, the company is determined to double-down on its now aging strategy.","chinese":"他們反而決心雙管齊下，延續他歷來的戰略。"},{"english":"Do both, but in any event, don't merely read the book.","chinese":"雙管齊下，但是任何情況下，不要只是讀書。"},{"english":"We believe in doing both, and learning while we do it.","chinese":"我們堅持雙管齊下，並在進行的過程中不斷的學習。"},{"english":"South Korean banks have plans to help with both.","chinese":"沒錯，韓國多家銀行就推出了這種雙管齊下的服務。"}],"related":[]}