{"definition":["unshielded twisted pair\/UTP"],"pinyin":["shuang1 jiao3 xian4"],"simplified":["双绞线"],"rank":49453.0,"normalized_rank":0.6919116309655394,"fraction":1.5313053057816686e-7,"cumulative_fraction":0.9988788354783352,"word":"雙絞線","characters":[{"definition":["surname Shuang","two\/double\/pair\/both\/even (number)"],"pinyin":["Shuang1","shuang1"],"word":"雙"},{"definition":["to twist (strands into a thread)\/to entangle\/to wring\/to hang (by the neck)\/to turn\/to wind\/classifier for skeins of yarn"],"pinyin":["jiao3"],"word":"絞"},{"definition":["thread\/string\/wire\/line\/CL:條|条[tiao2],股[gu3],根[gen1]\/(after a number) tier (unofficial ranking of a Chinese city)"],"pinyin":["xian4"],"word":"線"}],"containing_words":[],"sentences":[{"english":"In addition, the definition for twisted-pair is different in different network standard.","chinese":"另外，不同網絡標準中對雙絞線線腳定義也是不同的。"},{"english":"The twisted pair line also extremely has between each kind of equipment connection is fastidious.","chinese":"雙絞線在各種設備之間的接法也非常有講究。"},{"english":"Crossover functions may be implemented internally to a MAU or elsewhere in the twisted-pair link.","chinese":"交叉功能大多在MAU內或雙絞線鏈路中其他處實現。"},{"english":"The network media is shielded twisted-pair censtomair conditionershled.","chinese":"網絡介質利用屏蔽雙絞線。"},{"english":"The network media is shielded twisted-pair cable.","chinese":"網絡介質使用屏蔽雙絞線。"},{"english":"Twisted-pair cables are most popular transmission medium in network engineering.","chinese":"雙絞線是綜合佈線工程中最常用的傳輸介質。"},{"english":"Her beautiful twisted wire and bead designs will have you dashing to your bead box.","chinese":"她美麗的雙絞線和珠設計，將你衝你的珠框。"},{"english":"Fiber-optic cable is rapidly replacing twisted-pair telephone lines.","chinese":"光纜正迅速地取代雙絞線的電話線。"},{"english":"It is designed to provide unipolar differential drive to twisted pair or parallel wire transmission lines.","chinese":"它旨在爲雙絞線或並行線傳輸線路提供單極差分驅動。"},{"english":"Sharpest and clearest VGA quality over CAT5 of any manufacturer.","chinese":"最大和最明確的VGA質量超過任何製造商雙絞線。"},{"english":"Shielded twisted pair is often used on networks using Token Ring topology.","chinese":"屏蔽雙絞線通常被用來對網絡使用令牌環拓撲。"}],"related":[]}