{"definition":["heterocyclic (chemistry)"],"pinyin":["za2 huan2"],"simplified":["杂环"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"雜環","characters":[{"definition":["mixed\/miscellaneous\/various\/to mix"],"pinyin":["za2"],"word":"雜"},{"definition":["ring\/hoop\/loop\/(chain) link\/classifier for scores in archery etc\/to surround\/to encircle\/to hem in","surname Huan"],"pinyin":["Huan2","huan2"],"word":"環"}],"containing_words":[],"sentences":[{"english":"Heterocycle is always pyrimidine or triazine.","chinese":"其中雜環部分常爲嘧啶環或均三嗪環。"},{"english":"The bases and pentoses of the common nucleotides are heterocyclic compounds.","chinese":"常見核苷酸中的鹼基和戊糖是雜環化合物。"},{"english":"The digested enzymes activate the cancer-causing HCAs.","chinese":"這些被消化的酶激活了致癌性雜環化合胺物質。"},{"english":"It is a heterocyclic compound that is found in small amounts in most proteins .","chinese":"它是雜環化合物，在多數蛋白質中都有少量存在。"},{"english":"Aim Synthesis of nitrogen heterocycle ferrocenesulfonyl amide was studied.","chinese":"目的研究氮雜環二茂鐵磺酰胺類化合物的合成。"},{"english":"Heterocyclic compounds which modulate cannabinoid receptors are presented.","chinese":"提供了調節大麻素受體的雜環化合物。"},{"english":"Daily intakes of HCAs, including PhIP, were also calculated.","chinese":"雜環胺的日常攝入，包括PhIP，也計算在內。"},{"english":"Melamine is a small polar triazine compound.","chinese":"三聚氰胺是一種三嗪類含氮雜環有機化合物。"},{"english":"In this paper, we studied two kinds of phosphorus heterocycle.","chinese":"本論文中，我們研究了兩類不同的含磷雜環化合物。"},{"english":"Vegetables do not form heterocyclic amines or any other carcinogens during cooking.","chinese":"蔬菜在烹飪過程中不會形成雜環胺或者其它致癌物。"},{"english":"Aim To study on synthesis and antibacterial activity evaluation of poly heterocycles.","chinese":"目的研究多雜環化合物的合成方法和抗菌活性。"},{"english":"Heterocyclic compounds with nitrogen heteroatom(s)only.","chinese":"僅含有氮雜原子的雜環化合物。"},{"english":"Cooking at a lower temperature will decrease the formation of HCAs.","chinese":"低溫燒烤能夠減少雜環胺化合物的形成。"},{"english":"Heterocyclic compounds with oxygen heteroatom (s)only.","chinese":"僅含有氧雜原子的雜環化合物。"},{"english":"In this paper, the study on heterocyclic HCMV protease inhibitors was reported.","chinese":"對雜環類HCMV蛋白酶抑制劑進行研究。"},{"english":"This paper reviews the recent advance in heteroaromatic molecular tweezers involving multiple hydrogen-bonding sites.","chinese":"綜述了芳雜環類多重氫鍵分子鉗人工受體研究進展。"}],"related":[]}