{"definition":["to leave home (to live somewhere else)"],"pinyin":["li2 jia1 chu1 zou3"],"simplified":["离家出走"],"rank":13910.0,"normalized_rank":0.1946189470149567,"fraction":0.0000047187267883119584,"cumulative_fraction":0.9542167583619776,"word":"離家出走","characters":[{"definition":["surname Li","to leave\/to part from\/to be away from\/(in giving distances) from\/without (sth)\/independent of\/one of the Eight Trigrams 八卦[ba1 gua4], symbolizing fire\/☲"],"pinyin":["Li2","li2"],"word":"離"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"},{"definition":["to walk\/to go\/to run\/to move (of vehicle)\/to visit\/to leave\/to go away\/to die (euph.)\/from\/through\/away (in compound verbs, such as 撤走[che4 zou3])\/to change (shape, form, meaning)"],"pinyin":["zou3"],"word":"走"}],"containing_words":[],"sentences":[{"english":"Is there anything I can do to improve the situation rather than leave?","chinese":"除了離家出走，我還可以做些什麼來改變現狀嗎？"},{"english":"Originally wanted to dissolve the heart of small read slowly, and, behold, the little read away from home.","chinese":"原本想化解小念心裏的心結，不料，小念離家出走。"},{"english":"Heathcliff overhears and runs away from Wuthering Heights. Ch 9","chinese":"希斯克裏夫無意間聽到，於是從呼嘯山莊離家出走。"},{"english":"Should couples be forced to divorce when their children leave home?","chinese":"孩子離家出走了，夫婦就該被迫離婚啦？"},{"english":"Then he upped and ran away from home.","chinese":"然後他突然離家出走。"},{"english":"Then he ran off and soon came to a great marsh where the wild ducks lived.","chinese":"於是他離家出走，不久就來到一片野鴨住的廣闊沼澤。"},{"english":"The man bunked off and left his wife with three children.","chinese":"那個男人已離家出走，丟下妻予和三個孩子。"},{"english":"I decided I'd leave home.","chinese":"我決定離家出走。"},{"english":"It was one of my ex-girlfriends who ran away from home because of me.","chinese":"那是我一個前女友爲了我而離家出走。"},{"english":"One night that autumn, he fled his house during a raging storm.","chinese":"那年秋天一個暴風雨的夜晚，他離家出走。"},{"english":"Now he had disappeared and Fred thought Marty had run away from home.","chinese":"現在他不見了，佛瑞德認爲他離家出走了。"},{"english":"Your decision to leave the house is a double-edged sword.","chinese":"你決定離家出走，這一招兒既害人又害己。"},{"english":"Fai son again for the cute and the sea uncle had a fight, and away from home.","chinese":"輝仔再次爲了可愛一事與海叔發生爭吵，並離家出走。"},{"english":"Jack bunked off and left his wife with two children.","chinese":"傑克已離家出走，丟下妻子和兩個孩子。"}],"related":[{"definition":["cannot figure out\/to be unable to take a lighter view\/to take things too hard\/to be depressed\/to fret over trifles"],"pinyin":["xiang3 bu5 kai1"],"word":"想不開"},{"definition":["to close a door\/to lock a door\/(of a shop etc) to close (for the night, or permanently)"],"pinyin":["guan1 men2"],"word":"關門"},{"definition":["to lament\/to complain tearfully\/to wail accusingly"],"pinyin":["ku1 su4"],"word":"哭訴"},{"definition":["to rain curses (on sb)\/to let sb have it\/to bawl sb out"],"pinyin":["da4 ma4"],"word":"大罵"},{"definition":["to faint\/to swoon\/to black out\/to become unconscious"],"pinyin":["yun1 dao3"],"word":"暈倒"},{"definition":["to expel (a member of an organization)\/to fire (an employee)"],"pinyin":["kai1 chu2"],"word":"開除"},{"definition":["noisy\/raucous\/to shout and scream"],"pinyin":["chao3 nao4"],"word":"吵鬧"},{"definition":["to go mad\/to go crazy\/to lose one's mind"],"pinyin":["fa1 feng1"],"word":"發瘋"},{"definition":["to be missing\/to disappear\/unaccounted for"],"pinyin":["shi1 zong1"],"word":"失蹤"},{"definition":["son"],"pinyin":["er2 zi5"],"word":"兒子"},{"definition":["neighbor\/next door\/CL:個|个[ge4]"],"pinyin":["lin2 ju1"],"word":"鄰居"},{"definition":["to suspend schooling\/to defer study"],"pinyin":["xiu1 xue2"],"word":"休學"},{"definition":["almost\/nearly"],"pinyin":["cha4 dian3"],"word":"差點"},{"definition":["to charge\/to demand payment"],"pinyin":["yao4 qian2"],"word":"要錢"},{"definition":["to cause havoc\/to run amok"],"pinyin":["da4 nao4"],"word":"大鬧"},{"definition":["to drive out\/to turn back"],"pinyin":["gan3 zou3"],"word":"趕走"}]}