{"definition":["hard to accomplish\/difficult to achieve"],"pinyin":["nan2 yi3 shi2 xian4"],"simplified":["难以实现"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"難以實現","characters":[{"definition":["difficult (to...)\/problem\/difficulty\/difficult\/not good","disaster\/distress\/to scold"],"pinyin":["nan2","nan4"],"word":"難"},{"definition":["abbr. for Israel 以色列[Yi3 se4 lie4]","to use\/by means of\/according to\/in order to\/because of\/at (a certain date or place)"],"pinyin":["Yi3","yi3"],"word":"以"},{"definition":["real\/true\/honest\/really\/solid\/fruit\/seed\/definitely"],"pinyin":["shi2"],"word":"實"},{"definition":["to appear\/present\/now\/existing\/current"],"pinyin":["xian4"],"word":"現"}],"containing_words":[],"sentences":[{"english":"It is difficult to achieve the precision measurement of the position of the micro holes with traditional methods.","chinese":"微小孔系的精密測量用傳統的手段是難以實現的。"},{"english":"'It goes without saying such a target would be difficult to reach, ' Mr. Ito said Tuesday.","chinese":"伊東孝紳週二說，不用說，這一目標將難以實現。"},{"english":"Last but not least, it is impractical to modernize and globalize the theory of artistic conception.","chinese":"意境理認的“現代化”與“世界化”難以實現。"},{"english":"It is very difficult to realize the deep hole drilling process because of its specialty.","chinese":"深孔鑽削加工由於其特殊性，是比較難以實現的。"},{"english":"The simple via connection has been difficult to achieve high-quality signal transmission.","chinese":"因此簡單的過孔連接已經難以實現高質量的信號傳輸。"},{"english":"Yet profound exploration of human physiology remained elusive.","chinese":"然而對人體生理學的深入探索仍難以實現。"},{"english":"However, the processes that promote lung tissue repair have remained elusive.","chinese":"然而，促進肺組織修復的進程仍然難以實現。"},{"english":"'It goes without saying such a target would be difficult to reach, ' Mr.","chinese":"伊東孝紳週二說，不用說，這一目標將難以實現。"},{"english":"Without the rule of law, there will not be long-term order and security.","chinese":"不實行法制，社會難以實現長治久安。"},{"english":"A number of countries -- including Japan -- are struggling to meet that target.","chinese":"包括日本在內的許多國家都難以實現這一目標。"},{"english":"But it is also hardly to realize for us ordinary people.","chinese":"然而這對於我這種平頭百姓，也是難以實現的夢想。"},{"english":"We could not have reached our scalability goals without it.","chinese":"如果沒有它，我們就難以實現可伸縮性目標。"},{"english":"A major reason for this is the difficult to accurately measure the material level.","chinese":"一個主要原因是其料位精確測量難以實現。"}],"related":[]}