{"definition":["hard to say\/can't guarantee\/difficult to protect\/difficult to preserve"],"pinyin":["nan2 bao3"],"simplified":["难保"],"rank":24886.0,"normalized_rank":0.3481874274201447,"fraction":0.000001495540787200495,"cumulative_fraction":0.9841210614601452,"word":"難保","characters":[{"definition":["difficult (to...)\/problem\/difficulty\/difficult\/not good","disaster\/distress\/to scold"],"pinyin":["nan2","nan4"],"word":"難"},{"definition":["Bulgaria\/Bulgarian\/abbr. for 保加利亞|保加利亚[Bao3 jia1 li4 ya4]","to defend\/to protect\/to keep\/to guarantee\/to ensure\/civil administration unit in the baojia 保甲[bao3 jia3] system (old)"],"pinyin":["Bao3","bao3"],"word":"保"}],"containing_words":[{"definition":["powerless to defend oneself (idiom); helpless"],"pinyin":["zi4 shen1 nan2 bao3"],"word":"自身難保"},{"definition":["like a clay Bodhisattva fording a river, can't guarantee his own safety\/unable to save oneself, let alone others"],"pinyin":["ni2 pu2 sa4 guo4 jiang1 , zi4 shen1 nan2 bao3"],"word":"泥菩薩過江，自身難保"}],"sentences":[{"english":"then shall ye make me endanger my head to the king.","chinese":"這樣，你們就使我的頭在王那裏難保。"},{"english":"Alexander II is very clear, if not abandoned the small profits, then the Italian there is no guarantee.","chinese":"亞歷山大二世很清楚，若不棄小利，則大利難保。"},{"english":"He is now like a clay Buddha fording the river, hardly able to save himself.","chinese":"他現在也是泥菩薩過河自身難保了。"},{"english":"So that was the end of the shrine.","chinese":"這就是那座神龕的結局，他自身都難保，如何守護人？"},{"english":"That remark might arouse snickers from people around the league.","chinese":"這番話難保不會招致聯盟其他成員的竊笑。"},{"english":"Beauty is as summer fruits, which are easy to corrupt, and cannot last;","chinese":"美猶如盛夏的水果，是容易腐爛而難保持的。"},{"english":"It's hard for beginners to keep their balance on in-line skates.","chinese":"初學者穿着直排輪鞋很難保持平衡。"},{"english":"They find it difficult to keep good staff because of the brain drain.","chinese":"由於人才外流，他們很難保住一班齊備的人馬了。"},{"english":"He could not keep himself safe like mud bodhisattva pass river.","chinese":"他本人是泥菩薩過河，自身難保。"},{"english":"Okay, so I'm endangering myself so that this evil principle can die?","chinese":"我自身難保了，這條爛規定可以廢止嗎？"},{"english":"The stronger the suffering, the harder it is to keep self-remembering on track.","chinese":"痛苦越強，就越難保持記得自己。"},{"english":"whereas governments would let some banks fail.","chinese":"而銀行卻自身難保。"},{"english":"This results in test cases being difficult to keep up-to-date.","chinese":"這導致測試用例很難保持最新。"},{"english":"Online donors also tend to be tougher to retain.","chinese":"網絡捐款者也趨向於更難保留。"},{"english":"Other works of art that have been revered for generations have eventually gone out of fashion.","chinese":"有些曾被崇拜了幾代的藝術品卻最終難保風光依舊。"},{"english":"Beauty is as summer fruits, which are easy to corrupt, and cannot last.","chinese":"美有如盛夏的水果，而容易腐爛而難保持的。"}],"related":[]}