{"definition":["electric locomotive"],"pinyin":["dian4 li4 ji1 che1"],"simplified":["电力机车"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"電力機車","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["power\/force\/strength\/ability\/strenuously","surname Li"],"pinyin":["Li4","li4"],"word":"力"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"},{"definition":["car\/vehicle\/CL:輛|辆[liang4]\/machine\/to shape with a lathe\/Kangxi radical 159","surname Che","war chariot (archaic)\/rook (in Chinese chess)\/rook (in chess)"],"pinyin":["Che1","che1","ju1"],"word":"車"}],"containing_words":[],"sentences":[{"english":"Zhuzhou Electric Locomotive could not be reached for comment Thursday.","chinese":"記者週四無法聯繫株洲電力機車公司就此置評。"},{"english":"Hungarian V43 EL was standing-by at the border of Austria and Hungary.","chinese":"奧匈邊境等待上陣的匈牙利V43型電力機車。"},{"english":"This thesis carries on the improvement to the electronic control cabinet of SS4G locomotive.","chinese":"本文針對SS4G型電力機車電子控制櫃進行了改進。"},{"english":"The specific scheme to apply electric locomotive power supply on airconditioned trains in our country is put forward.","chinese":"提出了我國空調列車採用電力機車供電的具體方案。"},{"english":"Excellent commutating grade treated to give wide operating range for electrical locomotive and light rail traction motors.","chinese":"換向性能好，廣泛應用於電力機車和輕軌牽引電機。"},{"english":"Rail locomotives powered from an external source of electricity or by electric accumulators.","chinese":"鐵道電力機車，由外部電力或蓄電池驅動。"}],"related":[]}