{"definition":["electric arc welding"],"pinyin":["dian4 hu2 han4"],"simplified":["电弧焊"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"電弧焊","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["arc"],"pinyin":["hu2"],"word":"弧"},{"definition":["to weld\/to solder"],"pinyin":["han4"],"word":"焊"}],"containing_words":[],"sentences":[{"english":"Electrode for arc welding consists of the core and the coat.","chinese":"電弧焊的焊條是由焊芯和藥皮兩個部分組成的。"},{"english":"A new detecting method for lack of manual weld is proposed.","chinese":"提出了一種對手工電弧焊進行漏焊檢測的新方法。"},{"english":"Inert gas arc weld the spring strut mount.","chinese":"惰性氣體電弧焊減震器支座。"},{"english":"The most widely used industrial welding method is arc welding.","chinese":"電弧焊是工業上最常用的燒焊方法。"},{"english":"Perhaps I need to pull apart another SCR and try the arc welding approach.","chinese":"也許我需要把除了另一可控硅和審判電弧焊接的辦法。"},{"english":"Is used as an ordinary arc soldering power source, safely, reliable and easy to use.","chinese":"一種普通的電弧焊接電源，安全可靠，易於使用。"},{"english":"Manual arc welding is one of the most commonly applied welding processes in fabricating steel structure.","chinese":"手工電弧焊是鋼結構製造中最通用的焊接方法之一。"},{"english":"The problem of automatic surfacing with arc welding of worn machine parts is discussed.","chinese":"討論了對磨損機械零件進行自動電弧焊堆焊的問題。"},{"english":"The ceramic lined pipes were welded by arc welding process .","chinese":"採用電弧焊接方法焊接陶瓷內襯複合鋼管。"},{"english":"For inert-gas arc welding, plasma welding, cutting.","chinese":"惰性氣體保護電弧焊接，等離子焊接，切割。"},{"english":"It gives a reference to automatic arc welding tracking technique.","chinese":"爲電弧焊的自動跟蹤技術提供參考。"},{"english":"The manual arc welding normally refers to the manual welding using coated electrode.","chinese":"手工電弧焊通常是指採用藥皮焊條的手工焊接法。"},{"english":"Galvanized sheet is readily spot- or seam-welded, but arc gas welding will boil off the zinc coating.","chinese":"鍍鋅板上有焊點或焊縫，但是電弧焊會燒掉鋅層。"}],"related":[]}