{"definition":["electric field"],"pinyin":["dian4 chang3"],"simplified":["电场"],"rank":27287.0,"normalized_rank":0.3817805325087795,"fraction":0.00000120504530974525,"cumulative_fraction":0.9873497081923236,"word":"電場","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["large place used for a specific purpose\/stage\/scene (of a play)\/classifier for sporting or recreational activities\/classifier for number of exams","threshing floor\/classifier for events and happenings: spell, episode, bout"],"pinyin":["chang2","chang3"],"word":"場"}],"containing_words":[],"sentences":[{"english":"The positive and negative charges are then separated by updrafts and gravity, producing the electric field.","chinese":"正負電荷受上升氣流與重力的影響而分離，產生電場。"},{"english":"If the electric field added is unchangeable , what produces is the direct current.","chinese":"如果所加的電場不變，產生的是直流電。"},{"english":"A composite formula for calculation of horizontal electric field generated by return stroke current is presented.","chinese":"提出了一種計算地閃回擊電流水平電場的混合法。"},{"english":"The magnetic field is in a direction perpendicular to electric field of the cathode sheath.","chinese":"磁場垂直於陰極鞘層中電場的方問。"},{"english":"He had an inherent interest in induced current and in the induction field.","chinese":"他對感應電流和感應電場有着內在的興趣。"},{"english":"If that occurred, the ratfish might learn to turn around on its own when I flipped the switch only.","chinese":"果若如此，當我打開電場時，鼠魚也許就會自己轉向。"},{"english":"The electric and magnetic field shows the similar distribution on a plane in the far field.","chinese":"任何電流源遠場面上之電場與磁場呈現相似之分佈。"},{"english":"The electric field was simulated by electric potential equation.","chinese":"電場由電勢方程近似反映，只考慮周向自感應磁場。"},{"english":"In total, China will build seven of these mega-wind farms.","chinese":"中國將總共建造7座類似容量的風電場。"},{"english":"Electric field distributions and the equation of motion ofthe particles near axis in RFQ Linac are given.","chinese":"給出了它的近軸區內高頻電場的分佈及粒子運動方程。"},{"english":"E-field distribution are similar on spheres at different radius. (4).","chinese":"電流陣列在不同半徑場球面上之電場分佈相同。"},{"english":"Then electric fields generated by the solar wind sweep away the charged particles.","chinese":"然後，太陽風產生的電場將帶電粒子一掃而空。"},{"english":"At high external field, the polyampholyte chain is more extended.","chinese":"電場強度較高時，兩性聚離子鏈構型更爲舒展。"},{"english":"The displacement current corresponding to a variable irrotational electric field does not excite any magnetic field.","chinese":"對應於可變有源無旋電場的位移電流不激發磁場。"},{"english":"Airtightness as well as uniform electric field is of great importance to the stability of the electrolysis system.","chinese":"密封性以及均勻電場對電解體系的穩定性十分重要。"},{"english":"Hence, only one field line can pass through each point of the field.","chinese":"因而，在每一點處只能通過一條電場線。"}],"related":[]}