{"definition":["electromotive force"],"pinyin":["dian4 dong4 shi4"],"simplified":["电动势"],"rank":64804.0,"normalized_rank":0.9066920375526424,"fraction":1.6641449462260268e-8,"cumulative_fraction":0.9999503467320676,"word":"電動勢","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["power\/influence\/potential\/momentum\/tendency\/trend\/situation\/conditions\/outward appearance\/sign\/gesture\/male genitals"],"pinyin":["shi4"],"word":"勢"}],"containing_words":[],"sentences":[{"english":"The letter E is commonly used for electromotive force.","chinese":"通常用E這個字母表示電動勢。"},{"english":"The measured values and the theoretical ones of electromotive force are very close, that is to say, the sensor is reliable.","chinese":"測試電動勢與理論值十分相近，說明這種測頭可靠。"},{"english":"Once the measurement connections are made, take care to avoid errors due to thermally generated potentials.","chinese":"連好電路以後，特別注意避免由熱電動勢引起的誤差。"},{"english":"How do the induced electromotive force (emf) distribute in a conductor loop?","chinese":"導體迴路中感應電動勢是如何分佈的？"},{"english":"The process whereby changes in the current flow in a circuit produce magnetism or an emf.","chinese":"電路中的電流變化產生磁力或電動勢的過程。"},{"english":"Phase difference between the terminal voltage of an alternator and its electromotive force.","chinese":"交流電機的端電壓和其電動勢之間的相角差。"},{"english":"A coil of wire that moves in a magnetic field will have an electromotive force induced in it.","chinese":"當線圈在磁場中運動時，其內部會感應起一個電動勢。"},{"english":"The other pair is formed of junctions of copper and the material whose Seebeck emf is to be determined.","chinese":"另一對是形成了銅路口及材料的塞貝克電動勢。"},{"english":"Minimizing temperature gradients within the circuit also reduces thermoelectric EMFs.","chinese":"將電路中的溫度梯度減至最小也可以降低熱電動勢。"},{"english":"The occurence of peak in EMF curve had also been analysed.","chinese":"同時還分析了電動勢曲線產生峯值的原因。"}],"related":[]}