{"definition":["capacitor"],"pinyin":["dian4 rong2 qi4"],"simplified":["电容器"],"rank":32011.0,"normalized_rank":0.44787542148783455,"fraction":7.894470060693293e-7,"cumulative_fraction":0.9919775061007728,"word":"電容器","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["surname Rong","to hold\/to contain\/to allow\/to tolerate\/appearance\/look\/countenance"],"pinyin":["Rong2","rong2"],"word":"容"},{"definition":["device\/tool\/utensil\/CL:臺|台[tai2]"],"pinyin":["qi4"],"word":"器"}],"containing_words":[],"sentences":[{"english":"Study on degradation of methyl orange wastewater by high voltage discharge;","chinese":"用自放電電壓的高低來判定電容器的質量。"},{"english":"Variable capacitor soldering joints made with RG213 coaxial braid.","chinese":"可變電容器的焊點與RG213同軸電纜編織的連接。"},{"english":"The effect of electrolyte on high frequency electrical property of wet tantalum capacitors was studied.","chinese":"研究了電解質對高頻液體鉭電容器電性能的影響。"},{"english":"It thus acts as a supercapacitor.","chinese":"因此它的作用相當於一個超級電容器。"},{"english":"Assembling capacitor bank now is used widely in power system.","chinese":"集合式並聯電容器已廣泛用於電力系統。"},{"english":"The effect of aging voltage on the capacitance and leakage current of al electrolytic capacitors.","chinese":"老練電壓對鋁電解電容器容量和漏電流的影響。"},{"english":"Metallized film capacitors & filters, VDE, UL, TUV approved.","chinese":"金屬化薄膜電容器&濾波器，有VDE等多項認證。"},{"english":"A capacitor is the electrical equivalent of the bucket.","chinese":"電容器就是吊桶的電子等價物。"},{"english":"Metal nickel powder, its prepn. method, conductive paste and multi-layer ceramic capacitor.","chinese":"金屬鎳粉，其製備方法，導電膏和多層陶瓷電容器。"},{"english":"The recent advances of high power low resistance for supercapacitor at home and abroad are reviewed.","chinese":"綜述了國內外高功率內阻超級電容器的最新研究進展。"},{"english":"An ultracapacitor system for an electric vehicle has been implemented.","chinese":"介紹了採用超級電容器系統的電動汽車用控制器。"},{"english":"To operate at higher voltages, supercapacitors are connected in series.","chinese":"工作在更高的電壓，超級電容器串聯連接。"},{"english":"Their common principle is to use the variable capacity in a condenser .","chinese":"它們的普遍原理是利用電容器的可變電容。"},{"english":"The capacitor integrates the current.","chinese":"電容器匯合了電流。"},{"english":"Establish and maintain power capacitor manufacturing process and standards.","chinese":"建立和維護電力電容器製造過程及標準。"},{"english":"The rubber plug is one of the key factors that influence the capacitor life.","chinese":"鋁電解電容器橡膠塞的質量是影響壽命的關鍵因素。"}],"related":[]}