{"definition":["voltmeter"],"pinyin":["dian4 ya1 biao3"],"simplified":["电压表"],"rank":61532.0,"normalized_rank":0.8609125124172764,"fraction":3.2407033163348935e-8,"cumulative_fraction":0.9998714323948088,"word":"電壓表","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"},{"definition":["exterior surface\/family relationship via females\/to show (one's opinion)\/a model\/a table (listing information)\/a form\/a meter (measuring sth)"],"pinyin":["biao3"],"word":"表"}],"containing_words":[],"sentences":[{"english":"The meter reading will be the algebraic sum of all these sources.","chinese":"而電壓表的讀數則是所有這些源的代數和。"},{"english":"The ohmmeter uses an internal current source and electrometer voltmeter to make the measurement.","chinese":"歐姆計使用內部的電流源和靜電計電壓表來進行測量。"},{"english":"Reference junction compensation is required for thermocouple measurement with voltmeters.","chinese":"參考交界補償所需的熱電偶測量電壓表。"},{"english":"Operation can be conducted after the indicating value of direct current voltmeter of the panel is zero.","chinese":"待面板的直流電壓表的指示值爲0時方可進行操作。"},{"english":"Here was a voltage meter.","chinese":"這就是一種電壓表。"},{"english":"So, we should choose the voltmeters with high precision.","chinese":"因此，必須選用精度較高的電壓表進行試驗測量。"},{"english":"Digit, Display Low-Cost, Subminiature Digital Panel Voltmeters.","chinese":"位，顯示低成本，超小型數字面板電壓表。"},{"english":"The voltmeter leads are placed a known distance apart.","chinese":"電壓表的引線則按已知的距離放置。"},{"english":"And even more interesting is the voltage meter and ammeter become free Charge by-product.","chinese":"而且更妙的是電壓表和電流表成了免費的副產品。"},{"english":"Therefore, a voltmeter with high input resistance, such as an electrometer, is required.","chinese":"所以需要使用具有高輸入電阻的電壓表，例如靜電計。"},{"english":"A kind of circuit for automatic range selection of voltmeters is introduced and designed.","chinese":"提出並設計了一種適用於電壓表的量程自動轉換電路。"},{"english":"Please return these ammeters and voltmeters on board as soon as they are rectified.","chinese":"電流表與電壓表效正後請儘快送回船上。"},{"english":"And the excitation voltage and output were also fed through the selector switch to the digital voltmeter.","chinese":"其激勵電壓和輸出也通過選擇開關接到數字電壓表上。"}],"related":[]}