{"definition":["electronic computer"],"pinyin":["dian4 zi3 ji4 suan4 ji1"],"simplified":["电子计算机"],"rank":34954.0,"normalized_rank":0.4890518097743204,"fraction":6.075588829993617e-7,"cumulative_fraction":0.9940208276408162,"word":"電子計算機","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["(noun suffix)","son\/child\/seed\/egg\/small thing\/1st earthly branch: 11 p.m.-1 a.m., midnight, 11th solar month (7th December to 5th January), year of the Rat\/Viscount, fourth of five orders of nobility 五等爵位[wu3 deng3 jue2 wei4]\/ancient Chinese compass point: 0° (north)"],"pinyin":["zi3","zi5"],"word":"子"},{"definition":["surname Ji","to calculate\/to compute\/to count\/to regard as important\/to plan\/ruse\/meter\/gauge"],"pinyin":["Ji4","ji4"],"word":"計"},{"definition":["to regard as\/to figure\/to calculate\/to compute"],"pinyin":["suan4"],"word":"算"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[],"sentences":[{"english":"Does electronical computer based on microprocessors made of silicon chip come to an end?","chinese":"以硅片微處理器爲核心的電子計算機要走到盡頭了嗎？"},{"english":"No wonder people sy tht computers tke over theworld.","chinese":"難怪有人說電子計算機正漸漸接收世界。"},{"english":"Electronic computers have great importance in the production of modern industry.","chinese":"電子計算機在現代工業生產中很重要。"},{"english":"No wonder people say that computers are catching over the earth.","chinese":"難怪有人說電子計算機正漸漸接筦世界。"},{"english":"The measurement is automatical recorded by a specialized electronic computer.","chinese":"測量結果用專用電子計算機自動記錄。"},{"english":"No wonder people say that puters are taking over the world.","chinese":"難怪有人說電子計算機正漸漸接管世界。"},{"english":"Electronic computers work quickly and accurately.","chinese":"電子計算機算得既快又準確。"},{"english":"Computers are capable of doing extremely complicated work in all branches of learning.","chinese":"電子計算機能從事各種專業知識的極爲複雜工作。"},{"english":"Our company has decided to computerize its wages department.","chinese":"我們公司已決定用電子計算機控制工資部門。"},{"english":"In many countries, more and more companies are replacing people with computers .","chinese":"在許多有越來越多的公司使用電子計算機宋代替人。"},{"english":"RISC designs trace their root to the first eletronic computers.","chinese":"RISC的設計可以追溯到第一臺電子計算機。"},{"english":"The increase of the numbers of the city would frustrate even the biggest computer.","chinese":"城市數量的增加會讓最強大的電子計算機也感到畏懼。"},{"english":"Computers have become element of our everyday life.","chinese":"電子計算機正垂垂成爲我們日常生活的一部分。"},{"english":"Accurate and rapid computation chiefly characterizes the electronic computer.","chinese":"計算精確而快速是該電子計算機的主要特點。"},{"english":"Design calculation of chamber sand-mold drying oven is programmed by comuter instead of using diagram method.","chinese":"本文采用電子計算機進行砂型室式乾燥爐的設計計算。"},{"english":"Computers haudio-videoe be a compenent of our everyday life.","chinese":"電子計算機正垂垂成爲我們日常生活的一局部。"}],"related":[]}