{"definition":["electric motor"],"pinyin":["dian4 dong4 ji1"],"simplified":["电动机"],"rank":27819.0,"normalized_rank":0.3892239027325004,"fraction":0.000001146362303746753,"cumulative_fraction":0.9879750261294964,"word":"電動機","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[],"sentences":[{"english":"This paper presents an improved scheme of rotor position estimation for PMSM.","chinese":"介紹了一種永磁同步電動機轉子位置估算的改進方法。"},{"english":"This paper presents a field-oriented vector control system for permanent magnet synchronous motor.","chinese":"本文闡述了永磁同步電動機磁場定向矢量控制系統。"},{"english":"The small battery-powered motor is assembled in the cap, which features a hot foil decoration.","chinese":"小型電池供電的電動機組裝帽，採用了熱箔裝飾。"},{"english":"Alternating current motor is the important power equipment applicated in various fields.","chinese":"交流電動機是廣泛用於各領域的重要動力設備。"},{"english":"The motor of frequently reversible discharging equipment is very easy to be burnt out.","chinese":"頻繁可逆運轉卸料設備，其電動機極易燒燬。"},{"english":"The alternating current excitation motor (ACEM) is a kind of novel adjustable speed motor by changing frequency.","chinese":"交流勵磁電動機是一種新穎的變頻調速電動機。"},{"english":"The alternating current excitation motor (ACEM) is a kind of novel adjustable speed motor by changing frequency.","chinese":"交流勵磁電動機是一種新穎的變頻調速電動機。"},{"english":"YZRE YZE series electromagnetic braking motors for crane and metallurgical uses.","chinese":"YZE系列起重及冶金用電磁製動電動機。"},{"english":"Nonlinear L2 robust control for bearing less permanent magnet synchronous motors (BPMSM) was presented.","chinese":"對無軸承永磁同步電動機提出非線性L2魯棒控制。"},{"english":"We've laid away some electric motors for this people's commune.","chinese":"我們已經爲這個人民公社保留起幾臺電動機了。"},{"english":"Also considering buying servos.","chinese":"也可以考慮購買伺服電動機。"},{"english":"High school or technical school degree. Be able to use the electric instrument correctly.","chinese":"高中及技術學校以上，能正確使用電動機具。"},{"english":"This heavy freighter is driven by two electric motors.","chinese":"這輛重型運輸汽車是由兩臺電動機驅動的。"},{"english":"Would you please inspect the motor and pumps?","chinese":"請檢查一下電動機與泵浦，好嗎？"},{"english":"Drive uses one three-phase induction motor per pillar.","chinese":"每根柱都使用一個三相感應電動機進行驅動。"},{"english":"Shall we inspect the next one ?","chinese":"我們檢查下一個電動機好嗎？"}],"related":[]}