{"definition":["electrophoresis"],"pinyin":["dian4 yong3"],"simplified":["电泳"],"rank":47420.0,"normalized_rank":0.6634673233248919,"fraction":1.8758125051758284e-7,"cumulative_fraction":0.9985330973955914,"word":"電泳","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["swimming\/to swim"],"pinyin":["yong3"],"word":"泳"}],"containing_words":[],"sentences":[{"english":"Electrophoretic coating process on the aluminium alloy support used for solar energy heat unit is introduced.","chinese":"介紹了太陽能熱水器鋁合金托架的電泳塗漆工藝。"},{"english":"Phosphated bodies should be uniformly wet or dry when they enter the phosphate bath.","chinese":"磷化過的車身必須全溼或全乾狀態進入電泳槽。"},{"english":"The main factors influencing precipitation of electrophoretic coatings and their solving methods are given in this article.","chinese":"介紹了影響電泳漆沉澱的主要因素和採取的對策。"},{"english":"Electrophosresis in discontinuous buffer system was applied for the presenting patterns and fractions of the pancreatic amylase isoenzymes.","chinese":"應用不連續緩衝系統薄膜電泳法行酶譜分析。"},{"english":"Results There was a significant difference between the electrophoretograms of semen vaccariae and its adulterants.","chinese":"結果王不留行及僞品的電泳圖譜存在顯著差異。"},{"english":"It requires substantially less electrical consumption for deposition and, as a result, less refrigeration for cooling.","chinese":"電泳本身耗電量少，從而用於冷卻的冷量也少。"},{"english":"Conclusion Polyacrylamide gel electrophoresis technology can be used for seed identification of Andrographis paniculata seeds.","chinese":"結論聚丙烯酰胺凝膠電泳手藝可用於穿心蓮種子剖斷。"},{"english":"Gradient gel electrophoresis determine small, dense low-density lipoprotein in plasma of patients with coronary heart disease.","chinese":"梯度膠電泳法測定冠心病患者血漿小密低密度脂蛋白。"},{"english":"After transformation, no shrinkage was found in electrophoretic paint film, and the liquidity was remarkably improved.","chinese":"轉換後，電泳漆膜基本沒有縮孔，流平性大大改善。"},{"english":"It is revealed that in double diffusion and immunoelectrophoresis the product yielded a single precipitating line.","chinese":"以雙擴及免疫電泳鑑定，均呈現單一沉澱線。"},{"english":"Objective To study different thick agarose gel how to impact the DNA electrophoresis.","chinese":"目的研究不同厚度的瓊脂糖凝膠對電泳的影響。"},{"english":"As media of electrophoresis, optimum concentration of agarose was 2%.","chinese":"用於電泳介質的瓊脂糖最佳濃度爲2%。"},{"english":"The polypeptide patterns of the eggs of Anopheles sinensis and An. anthropophagus were compared with two-dimensional electrophoresis in polyacrylamide gel.","chinese":"用二維電泳法比較分析兩種按蚊卵的蛋白質多肽圖譜。"},{"english":"Fibroin obtained from degummed raw silk was studied by sodium dodecyl sulphate polyacrylamide gel electrophoresis.","chinese":"用聚丙烯酰胺凝膠電泳研究了從生絲脫膠獲得的絲素。"},{"english":"The immune effect was detected by counter immunoelectrophoresis.","chinese":"用對流免疫電泳試驗檢測免疫效果。"},{"english":"Granulosa cell apoptosis was detected by agarose gel electrophoresis.","chinese":"用瓊脂糖凝膠電泳檢測兩類卵的顆粒細胞凋亡。"}],"related":[]}