{"definition":["electromagnetism"],"pinyin":["dian4 ci2 xue2"],"simplified":["电磁学"],"rank":57610.0,"normalized_rank":0.8060386439634547,"fraction":5.8683005998496734e-8,"cumulative_fraction":0.9996954925680755,"word":"電磁學","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["magnetic\/magnetism\/porcelain"],"pinyin":["ci2"],"word":"磁"},{"definition":["to learn\/to study\/to imitate\/science\/-ology"],"pinyin":["xue2"],"word":"學"}],"containing_words":[],"sentences":[{"english":"This thesis concentrates on the parallel techniques and their applications in computational electromagnetics.","chinese":"本文着力於計算電磁學中並行技術及其應用的研究。"},{"english":"A 5tool measures the casing-wall thickness either electromagnetically or mechanically.","chinese":"下井儀器按照電磁學原理或者機械原理測量套管壁厚。"},{"english":"Time Domain Transient Electromagnetic Field(TDTEF) is a frontier branch of modern electromagnetics.","chinese":"時域瞬態電磁場是現代電磁學的前沿研究領域。"},{"english":"In particular, electromagnetism is a very abstract subject.","chinese":"尤其是，電磁學是很抽象的學科。"},{"english":"Seismo-electromagnetism is widely used for earthquake forecast.","chinese":"地震電磁學的技術應用是地震預報的基礎。"},{"english":"Tesla electromagnetics are composed of potentials and their corresponding motion.","chinese":"特斯拉的電磁學是由勢能組成，它們相當於運動。"},{"english":"The application of finite elements method (FEM) in electromagnetics has a history of 30 years.","chinese":"有限元法在電磁學中的應用已有30年的歷史了。"},{"english":"The equations of electromagnetism weathered the revolution of relativity unchanged.","chinese":"經受過相對論變革之後的電磁學方程並沒有變化。"},{"english":"Tne equations of electromagnetism weathered the revolution of relativity unchanged.","chinese":"經受過相對論變革之後的電磁學方程並沒有變化。"}],"related":[]}