{"definition":["electrolysis"],"pinyin":["dian4 jie3"],"simplified":["电解"],"rank":9103.0,"normalized_rank":0.1273627803506219,"fraction":0.000009731598494750707,"cumulative_fraction":0.9216772083147192,"word":"電解","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["acrobatic display (esp. on horseback) (old)\/variant of 懈[xie4] and 邂[xie4] (old)","surname Xie","to divide\/to break up\/to split\/to separate\/to dissolve\/to solve\/to melt\/to remove\/to untie\/to loosen\/to open\/to emancipate\/to explain\/to understand\/to know\/a solution\/a dissection","to transport under guard"],"pinyin":["Xie4","jie3","jie4","xie4"],"word":"解"}],"containing_words":[{"definition":["electrolyte"],"pinyin":["dian4 jie3 zhi4"],"word":"電解質"}],"sentences":[{"english":"The amount of electrolyte leakage was highly related to the treating time and concentration of toxin.","chinese":"且電解質外滲的程度與毒素濃度和處理時間呈正比。"},{"english":"Try to drink plenty of water or electrolyte fluids to get rid of stomach virus.","chinese":"爲了消除腸胃感染病毒，要喝大量的水或電解質液體。"},{"english":"In the simplest chemicing cell the electrolyte is the most efficient of sulfuric air conditioning unitidity in wdinedr.","chinese":"在最容易的化學電池內，電解液是硫酸的水溶液。"},{"english":"Disclosed is an electrolytic cell for removal of material from a solution.","chinese":"本發明公開了一種從溶液去除物質的電解池。"},{"english":"The electrolyser circuit is protected by a 30-amp circuit breaker.","chinese":"該電解槽的電路是被一個30安培的斷路器。"},{"english":"The effect of electrolyte on high frequency electrical property of wet tantalum capacitors was studied.","chinese":"研究了電解質對高頻液體鉭電容器電性能的影響。"},{"english":"Therefore, it is feasible to directly electrolytic produce low-titanium aluminium alloys in practice.","chinese":"因此電解法生產低鈦鋁合金在實際上也是可行的。"},{"english":"Hydrogen gas can be produced by the electrolysis of ordinary water.","chinese":"通過電解普通水可以製取氫氣。"},{"english":"A study was made of the effect of cathode material and various operating conditions on the elec- troboc reduchon of glucose.","chinese":"研究了陰極材料及工藝條件對葡萄糖電解還原的影響。"},{"english":"This paper worked on the pre-electrolysis process in silicon electrorefining.","chinese":"電解質的預電解淨化是該方法成功的基礎。"},{"english":"This paper worked on the pre-electrolysis process in silicon electrorefining.","chinese":"電解質的預電解淨化是該方法成功的基礎。"},{"english":"Porous alumina was prepared by anodization in oxalic acid electrolyte.","chinese":"在草酸電解液中，用陽極氧化法制備了多孔氧化鋁。"},{"english":"The development situation of new techniques for metal anode cells in our company is described in this paper.","chinese":"介紹公司近幾年金屬陽極電解槽技術開發進展情況。"},{"english":"In batteries, charged particles travel through electrolytes.","chinese":"在電池裏，帶電粒子穿過電解液。"},{"english":"The synthesis and application of cationic polyelectrolyte with high density charge.","chinese":"高密度電荷陽離子聚電解質的製備及應用。"},{"english":"Electrode selection for oxidation of cerium by cation ion-exchange membran electrolysis in sulfuric acid solution was reported in this paper.","chinese":"報導了硫酸介質中電解氧化鈰的陰陽極選擇。"}],"related":[]}