{"definition":["electric charge"],"pinyin":["dian4 he4"],"simplified":["电荷"],"rank":41472.0,"normalized_rank":0.5802470863123137,"fraction":3.339968102601008e-7,"cumulative_fraction":0.9970165381657684,"word":"電荷","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["Holland\/the Netherlands\/abbr. for 荷蘭|荷兰[He2 lan2]","lotus","to carry on one's shoulder or back\/burden\/responsibility"],"pinyin":["He2","he2","he4"],"word":"荷"}],"containing_words":[{"definition":["electric charge on nucleus\/atomic number"],"pinyin":["he2 dian4 he4 shu4"],"word":"核電荷數"},{"definition":["positive electric charge"],"pinyin":["yang2 dian4 he4"],"word":"陽電荷"},{"definition":["electric charge coupling"],"pinyin":["dian4 he4 ou3 he2"],"word":"電荷耦合"},{"definition":["charge-coupled device (CCD) (electronics)"],"pinyin":["dian4 he4 ou3 he2 qi4 jian4"],"word":"電荷耦合器件"},{"definition":["electrical charge"],"pinyin":["dian4 he4 liang4"],"word":"電荷量"}],"sentences":[{"english":"The relationship between bond valence and bond covalency has been investigated by a semiempirical method.","chinese":"方法研究了固體材料中鍵電荷與鍵共價性的關係。"},{"english":"These ignition wires send the charge to each spark plug.","chinese":"這些點火導線將電荷運送至每個火花塞。"},{"english":"The results indicated that interfacial charge transfer may be the rate limiting step.","chinese":"分析表明界面的電荷轉移是反應的速度控制步。"},{"english":"Where was the device that connected charge and magnetic flux?","chinese":"連接電荷和磁通量的元件在哪裏？"},{"english":"Then there is the change in that charge over time, better known as current.","chinese":"然後是隨時間而改變的電荷，就是我們知道的電流。"},{"english":"The positive and negative charges are then separated by updrafts and gravity, producing the electric field.","chinese":"正負電荷受上升氣流與重力的影響而分離，產生電場。"},{"english":"The other is to form'core-shell'structure that releases the static charge.","chinese":"形成所謂的“芯殼結構”來泄漏靜電荷。"},{"english":"The simulation results show that the proposed charge pump circuit works ex.","chinese":"提出了一種高性能低壓電荷泵電路。"},{"english":"The ions in TATB are with positive and negative charges in turns.","chinese":"整個TATB分子上面離子的淨電荷是正負相間的。"},{"english":"It was due to energy or charge transfer within the clusters.","chinese":"它起因於分子團內部的能量或電荷轉移。"},{"english":"But positively-charged lightning also occurs, most often in the winter.","chinese":"但是擁有正電荷的閃電同樣存在，大多出現在冬季。"},{"english":"The main content includes:1, It studies the mathematical models and working mechanisms of the charge pump PLL (CPPLL) with high-performance.","chinese":"研究了高性能電荷泵型鎖相環的數學模型和工作機制。"},{"english":"Electric charge may be detected qualitatively by sprinkling or blowing indicating powders.","chinese":"靜電荷可以用撒佈指示粉劑的方法，予以探測。"},{"english":"The current is the charge flow per unit time.","chinese":"電流是每單位時間流動的電荷。"},{"english":"This energy is something like positive and negative electrical charges pulsating throughout.","chinese":"這種能量就像正負電荷一樣脈動着流遍全身。"},{"english":"So, the bulk of the atom is positive.","chinese":"原子的主體帶正電荷。"}],"related":[]}