{"definition":["lightning flashes"],"pinyin":["dian4 shan3"],"simplified":["电闪"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"電閃","characters":[{"definition":["lightning\/electricity\/electric (bound form)\/to get (or give) an electric shock\/phone call or telegram etc\/to send via telephone or telegram etc"],"pinyin":["dian4"],"word":"電"},{"definition":["surname Shan","to dodge\/to duck out of the way\/to beat it\/shaken (by a fall)\/to sprain\/to pull a muscle\/lightning\/spark\/a flash\/to flash (across one's mind)\/to leave behind\/(Internet slang) (of a display of affection) \"dazzlingly\" saccharine"],"pinyin":["Shan3","shan3"],"word":"閃"}],"containing_words":[],"sentences":[{"english":"For just then, lightning flashed and dark clouds began to fill the sky.","chinese":"正在這時，電閃雷鳴，天空一片烏雲壓頂。"},{"english":"I walked down the hill into town, ignoring the flashes of lightning all round me.","chinese":"我顧不上一路的電閃雷鳴，沿着山路向市區走去。"},{"english":"and the rain is coming down, the lightning hits and there's thunder.","chinese":"大雨傾盆，電閃雷鳴。"},{"english":"Under the lightnings of thine unfamiliar eyes.","chinese":"你神奇的眼睛電閃雷鳴。"},{"english":"Lightning usually accompanies thunder.","chinese":"電閃通常伴着雷聲。"},{"english":"The positive lightning center is located to the south of the urban area.","chinese":"正電閃的空間分佈中心偏於市區的南側。"},{"english":"Winds, heavy rain, thunder, lightning shaking the love and support.","chinese":"狂風，暴雨，雷轟，電閃搖撼着我愛你的憑據。"},{"english":"They jump to a negative charge, making a huge spark called a lightning bolt.","chinese":"它們跳向負電荷，產生巨大的電火花，叫電閃。"},{"english":"Mother is all of a flutter because of thunder and lightning.","chinese":"由於電閃雷鳴，媽媽感到十分不安。"},{"english":"The lightning bolt is a zigzag.","chinese":"電閃是一個之字形。"},{"english":"Thunder lightning, heavy rain, such as injection.","chinese":"雷鳴電閃，大雨如注。"},{"english":"He paints an otherworldly, murky scene of dread in the cemetery where lightening flashes and thunder roars.","chinese":"他把墓地描寫得陰森恐怖，不時伴有電閃雷鳴。"},{"english":"As the afternoon progressed, the winds whipped up , along with thunder and lightning.","chinese":"到了下午，風越掛越猛，外面電閃雷鳴。"},{"english":"The dark sky, thunder and lightning.","chinese":"黑暗的天空中，電閃雷鳴。"},{"english":"You see lightning and hear thunder.","chinese":"你會看到電閃，聽到雷鳴。"},{"english":"The most intense high winds, rain and lightning lasted for about an hour, she said.","chinese":"狂風暴雨和電閃雷鳴持續了約一個小時。"}],"related":[]}