{"definition":["sudden inspiration\/bright idea\/clever trick"],"pinyin":["ling2 ji1"],"simplified":["灵机"],"rank":57690.0,"normalized_rank":0.8071579477564954,"fraction":5.8099095491049004e-8,"cumulative_fraction":0.9997001653119114,"word":"靈機","characters":[{"definition":["quick\/alert\/efficacious\/effective\/to come true\/spirit\/departed soul\/coffin"],"pinyin":["ling2"],"word":"靈"},{"definition":["machine\/engine\/opportunity\/intention\/aircraft\/pivot\/crucial point\/flexible (quick-witted)\/organic\/CL:臺|台[tai2]","surname Ji"],"pinyin":["Ji1","ji1"],"word":"機"}],"containing_words":[{"definition":["a bright idea suddenly occurs (idiom); to hit upon an inspiration\/to be struck by a brainwave"],"pinyin":["ling2 ji1 yi1 dong4"],"word":"靈機一動"}],"sentences":[{"english":"The traditional theory of computability is based on Turing machines.","chinese":"傳統的可計算性理論以圖靈機爲基礎模型。"},{"english":"One day, while sitting outside in his lawn chair, Larry had his eureka moment.","chinese":"一天，當拉里坐在屋外的摺椅上時，突然靈機一動。"},{"english":"Thensuddenly, an idea came into her racing, terrified brain.","chinese":"後來她靈機一動，恐懼的大腦想出一個主意。"},{"english":"Why dont she a brainwave, through right rare to du from far away.","chinese":"她靈機一動，何不通過右少見到杜自遠。"},{"english":"He got an idea. He removed the map, and then patiently tore it up into small pieces.","chinese":"他靈機一動，把地圖撕下來，耐心地撕成小塊。"},{"english":"In other words, the system and the universal Turing machine can emulate each other.","chinese":"換言之，此係統可與通用圖靈機互相模擬。"},{"english":"His inspiration, come up with a \"imitative\" strategy.","chinese":"東方朔靈機一動，想出一個“照方抓藥”的計謀。"},{"english":"Lisp: Turing Machines are an awkward way to describe computation.","chinese":"用圖靈機描述計算過程太笨拙。"},{"english":"No one wants to program a Turing machine.","chinese":"沒人想在圖靈機上寫程序。"},{"english":"Then I had a brainstorm.","chinese":"突然我靈機一動。"},{"english":"At this dark and hopeless moment an inspiration burst upon him!","chinese":"正在這灰心絕望的時刻，他忽然靈機一動，計上心來。"},{"english":"Finally, the operation's expression ability of Turing machine properties is proved.","chinese":"最後證明了這類操作的圖靈機表達能力。"}],"related":[]}