{"definition":["lingzhi or reishi mushroom (Ganoderma lucidum)"],"pinyin":["ling2 zhi1"],"simplified":["灵芝"],"rank":22237.0,"normalized_rank":0.3111244805730836,"fraction":0.00000191595635256286,"cumulative_fraction":0.979626356609296,"word":"靈芝","characters":[{"definition":["quick\/alert\/efficacious\/effective\/to come true\/spirit\/departed soul\/coffin"],"pinyin":["ling2"],"word":"靈"},{"definition":["Zoysia pungens"],"pinyin":["zhi1"],"word":"芝"}],"containing_words":[],"sentences":[{"english":"ObjectiveTo investigate the in vitro antitumor action of the different extracts of different solvents from Ganoderma lipsiense.","chinese":"目的探討樹舌靈芝各溶劑提取物的抗癌作用。"},{"english":"The biology activity and separation of peptides in fermentive ganoderma lucidum were studied.","chinese":"研究了發酵靈芝粉中肽類化合物的分離及其生物活性。"},{"english":"Triterpenoids are the main efficacious ingredients in ganoderma spore lipids.","chinese":"靈芝三萜類化合物是靈芝孢子油中的主要功效成分。"},{"english":"Triterpenoids are the main efficacious ingredients in ganoderma spore lipids.","chinese":"靈芝三萜類化合物是靈芝孢子油中的主要功效成分。"},{"english":"The hypha achieves the request as the mother culture by observation.","chinese":"試驗觀察靈芝菌種達到作爲母種使用的要求。"},{"english":"This article mainly discussed the mechanism of micro-milling and extraction of ganoderma lucidum polysaccharides.","chinese":"本文介紹了微粉提取靈芝多聚糖的作用機理。"},{"english":"Lingzhi Detox Tea slimming effect with the double.","chinese":"配合靈芝排毒茶瘦身功效加倍。"},{"english":"Bai Suzhen laughs in the face of death, selects the ganoderma lucidum immortal grass finally, excited goes.","chinese":"白素珍捨生忘死，終於摘取靈芝仙草，興奮而去。"},{"english":"With the core of glossy ganoderma culture, Alphay concentrates its efforts on creating enterprise culture.","chinese":"公司以靈芝文化爲核心，着力打造企業文化。"},{"english":"Ganoderma lucidum is one of most frequently used fungi in Chinese medicine and nutrition.","chinese":"靈芝是我國醫藥學寶庫中的一種珍貴的藥食兩用菌。"},{"english":"Respective additions of selenium and cerium resulted in an obvious increase of polysaccharide content in the supernatant.","chinese":"兩種元素還可明顯提高菌液中靈芝多糖的含量。"},{"english":"Some original work on genetic engineering of Ganoderma lucidum have been carried out.","chinese":"論文在靈芝基因工程方面做了一些開創性的研究。"},{"english":"The Lycium barbarum polysaccharides and the Ganoderma lucidum polysaccharides have different bio- active functions.","chinese":"靈芝多糖和枸杞多糖均具有良好的生理活性功能。"},{"english":"XiaoFei deliberately put the emperor to a huge ganoderma lucidum side.","chinese":"蕭妃故意把皇上帶到一顆巨大的靈芝身邊。"},{"english":"Ganoderma Lucidum is called as Mesona chinensis, has no toxic side effects on human body.","chinese":"靈芝自古以來被稱爲“仙草”，對人體無毒無副作用。"},{"english":"Liquid Ganoderma spore oil capsule and preparation method relates to a Chinese medicinal preparation.","chinese":"靈芝孢子油液體膠囊及製備方法，涉及一種中藥製劑。"}],"related":[{"definition":["rounded embroidery design"],"pinyin":["tuan2 hua1"],"word":"團花"},{"definition":["(myth.) peaches of immortality, kept by Xi Wangmu\/fresh or confectionery peaches offered as a birthday gift"],"pinyin":["shou4 tao2"],"word":"壽桃"},{"definition":["eye-opening ceremony for a religious idol (Buddhism)\/to consecrate\/to bless\/transparent\/translucent\/haircut\/shaving the head or face (humorous)\/a method of decoration\/first light (astronomy)"],"pinyin":["kai1 guang1"],"word":"開光"},{"definition":["calabash or bottle gourd (Lagenaria siceraria)\/hoist\/generic term for block and tackle (or parts thereof)\/muddled\/(poker) full house"],"pinyin":["hu2 lu5"],"word":"葫蘆"},{"definition":["decorative motif\/figure"],"pinyin":["wen2 shi4"],"word":"紋飾"},{"definition":["line\/trace\/mark\/pattern\/grain (of wood etc)"],"pinyin":["wen2"],"word":"紋"},{"definition":["(bird species of China) mandarin duck (Aix galericulata)\/(fig.) affectionate couple\/happily married couple"],"pinyin":["yuan1 yang1"],"word":"鴛鴦"},{"definition":["lotus flower (Nelumbo nucifera Gaertn, among others)\/water-lily"],"pinyin":["lian2 hua1"],"word":"蓮花"},{"definition":["tree bark"],"pinyin":["shu4 pi2"],"word":"樹皮"},{"definition":["bamboo joint"],"pinyin":["zhu2 jie2"],"word":"竹節"},{"definition":["branch and leaf"],"pinyin":["zhi1 ye4"],"word":"枝葉"},{"definition":["to draw\/to paint"],"pinyin":["hui4"],"word":"繪"},{"definition":["Yunlong district of Xuzhou city 徐州市[Xu2 zhou1 shi4], Jiangsu\/Yunlong county in Dali Bai autonomous prefecture 大理白族自治州[Da4 li3 Bai2 zu2 zi4 zhi4 zhou1], Yunnan"],"pinyin":["Yun2 long2"],"word":"雲龍"},{"definition":["pen container\/brush pot"],"pinyin":["bi3 tong3"],"word":"筆筒"},{"definition":["big\/huge\/massive"],"pinyin":["shuo4 da4"],"word":"碩大"},{"definition":["pot\/classifier for bottled liquid"],"pinyin":["hu2"],"word":"壺"}]}