{"definition":["Qinghai province (Tsinghai) in west China, abbr. 青, capital Xining 西寧|西宁"],"pinyin":["Qing1 hai3 sheng3"],"simplified":["青海省"],"rank":11381.0,"normalized_rank":0.15923495585745667,"fraction":0.0000066815419590974975,"cumulative_fraction":0.939965194755875,"word":"青海省","characters":[{"definition":["abbr. for 青海[Qing1 hai3], Qinghai Province","green\/blue\/black\/youth\/young (of people)"],"pinyin":["Qing1","qing1"],"word":"青"},{"definition":["ocean\/sea\/CL:個|个[ge4],片[pian4]\/great number of people or things\/(dialect) numerous","surname Hai"],"pinyin":["Hai3","hai3"],"word":"海"},{"definition":["to inspect\/to examine\/to be aware\/to pay a visit (to one's parents or elders)","to save\/to economize\/to do without\/to omit\/to leave out\/province\/(archaic) central government department"],"pinyin":["sheng3","xing3"],"word":"省"}],"containing_words":[],"sentences":[{"english":"A giant mulish horse team saved city of sweet day heart to set out from Qinghai.","chinese":"一支龐大的騾馬隊伍從青海省香日德城出發了。"},{"english":"Qinghai Province is located west China, northeast Qinghai-Tibet Plain.","chinese":"青海省位於中國西部，青躲高原東北部。"},{"english":"The remoteness of Qinghai Province has made it the site of many prison camps.","chinese":"青海省地區因地處偏遠成爲監獄營區用地。"},{"english":"Officials have placed Ziketan and the surrounding part of Qinghai province in quarantine.","chinese":"中國官方已將青海省子科灘鎮及周圍地區隔離。"},{"english":"Go and need to how much be to Qinghai province Hainan State fare from Guangzhou?","chinese":"從廣州去到青海省海南州車費要多少錢？"},{"english":"A 26-year-old intersexual from Qinghai Province will receive free surgery to become fully male today in Beijing.","chinese":"自青海省的26歲陰陽人患者將接受收費手術調整。"},{"english":"Fang Yannian was born in Xining city, Qinghai province in 1946.","chinese":"方延年，一九四六年生於青海省西寧市。"},{"english":"Pasture industrialization is the crux of sustainable and stable development of animal husbandry economics.","chinese":"草業產業化是青海省畜牧業經濟持續穩定發展的關鍵。"},{"english":"In 2004, eight villagers in Qinghai province died of plague.","chinese":"2004年，中國青海省八位村民死於鼠疫。"},{"english":"The earthquake was centered near the Qinghai Province in western China.","chinese":"地震的中心是在中國西部的青海省。"},{"english":"Huangzhong County is the Qinghai Province river area of huangshui traveling resources concentrates the county.","chinese":"湟中縣是青海省河湟地區旅遊資源富集縣。"},{"english":"The Changjiang River rises in the Tanggula Mountains of Qinghai Province.","chinese":"它發源於青海省的唐古拉山脈。"},{"english":"In Xining City, the capital of Qinghai Province, some taxi drivers have started to refuse to take Tibetan passengers.","chinese":"在青海省省府西寧市，已有部分出租車拒載藏人。"},{"english":"A photographer from Nanjing found her when he was taking photos for the students in Yushu, Qinghai Province.","chinese":"南京的一名攝影師在拍青海省玉樹的學生時發現她。"},{"english":"Populus cathayana is the main species to plant farmland forest net work in Qinghai province hill .","chinese":"青楊是青海省營造山地農田林網的主要樹種。"},{"english":"Yushu Tibetan Autonomous Prefecture, is an autonomous prefecture in Qinghai Province.","chinese":"玉樹藏族自治州，是青海省下轄的一個自治州。"}],"related":[{"definition":["Golmud or Ge'ermu city (Tibetan: na gor mo grong khyer) in Haixi Mongol and Tibetan autonomous prefecture 海西蒙古族藏族自治州[Hai3 xi1 Meng3 gu3 zu2 Zang4 zu2 zi4 zhi4 zhou1], Qinghai"],"pinyin":["Ge2 er3 mu4 shi4"],"word":"格爾木市"},{"definition":["Haixi Mongol and Tibetan autonomous prefecture (Tibetan: Mtsho-nub Sog-rigs dang Bod-rigs rang-skyong-khul) in Qinghai"],"pinyin":["Hai3 xi1 Meng3 gu3 zu2 Zang4 zu2 zi4 zhi4 zhou1"],"word":"海西蒙古族藏族自治州"},{"definition":["Haixi Mongol and Tibetan autonomous prefecture (Tibetan: Mtsho-nub Sog-rigs dang Bod-rigs rang-skyong-khul) in Qinghai"],"pinyin":["Hai3 xi1 zhou1"],"word":"海西州"},{"definition":["Yushu Tibetan autonomous prefecture (Tibetan: yus hru'u bod rigs rang skyong khul) in Qinghai"],"pinyin":["Yu4 shu4 Zang4 zu2 zi4 zhi4 zhou1"],"word":"玉樹藏族自治州"},{"definition":["Hainan Tibetan autonomous prefecture (Tibetan Mtsho-lho Bod-rigs rang-skyong-khul), Qinghai"],"pinyin":["Hai3 nan2 Zang4 zu2 Zi4 zhi4 zhou1"],"word":"海南藏族自治州"},{"definition":["Gansu Province, abbr. 甘[Gan1], short name 隴|陇[Long3], capital Lanzhou 蘭州|兰州[Lan2 zhou1]"],"pinyin":["Gan1 su4 Sheng3"],"word":"甘肅省"},{"definition":["Haibei Tibetan autonomous prefecture (Tibetan: Mtsho-byang Bod-rigs rang-skyong-khul) in Qinghai"],"pinyin":["Hai3 bei3 Zang4 zu2 zi4 zhi4 zhou1"],"word":"海北藏族自治州"},{"definition":["Tibetan autonomous region, Tibetan: Bod rang skyong ljongs, abbr. 藏[Zang4], capital Lhasa 拉薩|拉萨[La1 sa4]"],"pinyin":["Xi1 zang4 Zi4 zhi4 qu1"],"word":"西藏自治區"},{"definition":["Xining prefecture level city and capital of Qinghai province 青海省[Qing1 hai3 sheng3] in west China"],"pinyin":["Xi1 ning2 shi4"],"word":"西寧市"},{"definition":["Haibei Tibetan autonomous prefecture in Qinghai"],"pinyin":["Hai3 bei3 zhou1"],"word":"海北州"},{"definition":["Gonghe county in Hainan Tibetan autonomous prefecture 海南藏族自治州[Hai3 nan2 Zang4 zu2 Zi4 zhi4 zhou1], Qinghai"],"pinyin":["Gong4 he2 xian4"],"word":"共和縣"},{"definition":["Golog Tibetan autonomous prefecture (Tibetan: Mgo-log Bod-rigs rang-skyong-khul) in south Qinghai"],"pinyin":["Guo3 luo4 zhou1"],"word":"果洛州"},{"definition":["Gannan Tibetan autonomous prefecture\/abbr. for 甘南藏族自治州"],"pinyin":["Gan1 nan2 zhou1"],"word":"甘南州"},{"definition":["Guide county in Hainan Tibetan autonomous prefecture 海南藏族自治州[Hai3 nan2 Zang4 zu2 Zi4 zhi4 zhou1], Qinghai"],"pinyin":["Gui4 de2 xian4"],"word":"貴德縣"},{"definition":["see 海南藏族自治州[Hai3 nan2 Zang4 zu2 Zi4 zhi4 zhou1]"],"pinyin":["Hai3 nan2 zhou1"],"word":"海南州"},{"definition":["Huangnan Tibetan autonomous prefecture (Tibetan: Rma-lho Bod-rigs rang skyong khul) in Qinghai"],"pinyin":["Huang2 nan2 zhou1"],"word":"黃南州"}]}