{"definition":["over-the-counter drug"],"pinyin":["fei1 chu3 fang1 yao4"],"simplified":["非处方药"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"非處方藥","characters":[{"definition":["abbr. for 非洲[Fei1 zhou1], Africa","to not be\/not\/wrong\/incorrect\/non-\/un-\/in-\/to reproach or blame\/(colloquial) to insist on\/simply must"],"pinyin":["Fei1","fei1"],"word":"非"},{"definition":["place\/location\/spot\/point\/office\/department\/bureau\/respect\/classifier for locations or items of damage: spot, point","to reside\/to live\/to dwell\/to be in\/to be situated at\/to stay\/to get along with\/to be in a position of\/to deal with\/to discipline\/to punish"],"pinyin":["chu3","chu4"],"word":"處"},{"definition":["square\/power or involution (math.)\/upright\/honest\/fair and square\/direction\/side\/party (to a contract, dispute etc)\/place\/method\/prescription (medicine)\/just when\/only or just\/classifier for square things\/abbr. for square or cubic meter","surname Fang"],"pinyin":["Fang1","fang1"],"word":"方"},{"definition":["medicine\/drug\/substance used for a specific purpose (e.g. poisoning, explosion, fermenting)\/CL:種|种[zhong3],服[fu4],味[wei4]\/to poison"],"pinyin":["yao4"],"word":"藥"}],"containing_words":[],"sentences":[{"english":"It is possible that you inadvertently took an excessive dose of an over-the-counter preparation.","chinese":"有可能是你把非處方藥喫過量了。"},{"english":"The FDA said over-the-counter drugs remain safe and effective when used as directed.","chinese":"FDA說，在指導下使用非處方藥仍然是安全有效的。"},{"english":"Some over-the-counter drugs can help alleviate your sinus problems.","chinese":"一些非處方藥能夠減輕你的鼻炎。"},{"english":"The injections and nonprescription pharmaceuticals shall, in addition, list the names of all supplementary materials in use.","chinese":"注射劑和非處方藥還應當列出所用的全部輔料名稱。"},{"english":"One side effect of taking many prescription and over-the-counter drugs can be a worrisome increase in memory lapses.","chinese":"處方藥和非處方藥的副作用之一就是記憶力衰退。"},{"english":"Have some over-the-counter (OTC) remedies on hand for when symptoms strike.","chinese":"準備一些非處方藥物應對症狀的出現。"},{"english":"In the U. S. and many other countries, KI is a non-prescription, over-the-counter drug.","chinese":"在美國同其他許多國家一樣，碘片是一種非處方藥。"},{"english":"The product is used as over-the-counter drug for subcalorism.","chinese":"本品爲感冒用藥類非處方藥藥品。"},{"english":"As for colds, the sooner a person starts taking over-the-counter remedies, the sooner relief will come.","chinese":"患者越早開始服用非處方藥，感冒就好得越快。"},{"english":"D. A complete list of all prescription and nonprescription drugs should be obtained.","chinese":"一體系的處方藥及非處方藥必須給予。"},{"english":"The drug is available, although illegally, as an over-the-counter pill.","chinese":"這種藥物被非法地做作爲一種非處方藥。"}],"related":[]}