{"definition":["nonmetal (chemistry)"],"pinyin":["fei1 jin1 shu3"],"simplified":["非金属"],"rank":27092.0,"normalized_rank":0.3790522295132427,"fraction":0.0000012260660880133683,"cumulative_fraction":0.9871126416941208,"word":"非金屬","characters":[{"definition":["abbr. for 非洲[Fei1 zhou1], Africa","to not be\/not\/wrong\/incorrect\/non-\/un-\/in-\/to reproach or blame\/(colloquial) to insist on\/simply must"],"pinyin":["Fei1","fei1"],"word":"非"},{"definition":["gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)"],"pinyin":["Jin1","jin1"],"word":"金"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"}],"containing_words":[],"sentences":[{"english":"All other metals and nonmetals lie within the boundaries of lead and diamond.","chinese":"所有其他金屬和非金屬都處在鉛和金剛石的界限之內。"},{"english":"Porous ceramics is a kind of inorganic non-metal material that mostly includes pores.","chinese":"多孔陶瓷是一類以氣孔爲主相的無機非金屬材料。"},{"english":"Non-metallic mineral resources are very rich in Inner Mongolia, but development and utilization are very poor.","chinese":"我區非金屬礦產資源豐富，但開發利用程度很低。"},{"english":"Nonmetals are generally gases or soft solids that do not conduct electricity.","chinese":"非金屬一般爲氣體或不導電的軟固體。"},{"english":"This article deals with one of the subjects of technical economic polices about non-metallic mining industry.","chinese":"本文爲非金屬礦工業技術經濟政策研究系列課題之一。"},{"english":"Even nonmetallic materials are dangerous to touch at these low temperatures.","chinese":"在這種低溫下，甚至接觸非金屬材料也是危險的。"},{"english":"This method is extensively applicable to packaging non-metal, metal valuable products and exhibits.","chinese":"廣泛適用於非金屬，金屬珍貴製品及陳列品的包裝。"},{"english":"Applicable to the collection delivery of all kinds of rolls, either fine sheet metal nonmetallic material.","chinese":"適用於各種卷料之收放，薄板金屬及非金屬材料均可。"},{"english":"The machine could peer beneath passengers' clothes to search for hidden bombs and non-metal weapons.","chinese":"這個機器可以透過乘客衣服尋找炸彈和非金屬武器。"},{"english":"Plastics and ceramics are non-metals;","chinese":"塑料和陶瓷是非金屬。"},{"english":"Nonmetal nanoclusters are generated by inert-gas condensation.","chinese":"採用惰性氣體凝聚法獲得非金屬團簇澱積體。"},{"english":"A section of non-metallic tubing used to deliver compressed air for paint or powder application.","chinese":"爲油漆或粉末塗裝釋放壓縮空氣的非金屬管部分。"},{"english":"The invention relates to a method for removing non-metallic inclusion in molten steel.","chinese":"本發明涉及一種鋼液中非金屬夾雜去除方法。"},{"english":"The sealing ring by a similar to the rubber or plastic non-metallic materials.","chinese":"該密封圈由一種類似於橡膠或塑料的非金屬材料製成。"},{"english":"Calcium sulphate whisker is a new nonmetal material prepared from gypsum.","chinese":"硫酸鈣晶須是由生石膏製備而成的新型非金屬材料。"},{"english":"Nonmetals such as wood, glass and plastic cannot conduct heat easily.","chinese":"非金屬例如木，玻璃和塑料不能很輕易地傳熱。"}],"related":[]}