{"definition":["near\/to approach"],"pinyin":["kao4 jin4"],"simplified":["靠近"],"rank":4791.0,"normalized_rank":0.06703230590572662,"fraction":0.00002554739849947989,"cumulative_fraction":0.8537665620907338,"word":"靠近","characters":[{"definition":["to lean against or on\/to stand by the side of\/to come near to\/to depend on\/to trust\/to fuck (vulgar)\/traditional military costume drama where the performers wear armor (old)"],"pinyin":["kao4"],"word":"靠"},{"definition":["near\/close to\/approximately"],"pinyin":["jin4"],"word":"近"}],"containing_words":[],"sentences":[{"english":"Lie on your back with your legs spread or raise your knees to your head.","chinese":"平躺，張開雙腿或者把膝蓋擡到靠近頭部的地方。"},{"english":"Mengsk approached the smaller man and stood before him, an intimidating presence.","chinese":"蒙克斯以威迫的姿態靠近並站在這位小矮人前面。"},{"english":"Make sure none of the audio components are positioned too close to the TV set.","chinese":"確認各聲頻設備是否太靠近電視機。"},{"english":"Ads close to top-of-the-page headlines did well.","chinese":"靠近頁頂標題的廣告表現良好。"},{"english":"While the White Swan comes easily to Nina, the dark mysteries of the Black Swan evade her.","chinese":"當白天鵝靠近妮娜的時候，黑天鵝的隱祕躲在暗處。"},{"english":"Birds fly over oil on the water near Breton Sound Island.","chinese":"一大羣鳥飛越靠近布萊頓水聲島的油漬水域。"},{"english":"A girl passed close to him, and Lieutenant Blandford started.","chinese":"一個女孩靠近他走過，布蘭佛德中尉喫驚地動了一下。"},{"english":"Project is located in the former Central New Film Factory near North Third Ring Road area.","chinese":"項目選址在原中央新影廠靠近北三環的區域。"},{"english":"The Lord is close to the brokenhearted and saves those who are crushed in spirit.","chinese":"耶和華靠近傷心的人，拯救靈性痛悔的人。"},{"english":"Rajin-Sonbong (or Rason, for short) lies by the Sea of Japan in the country’s north-east, near the border with Russia.","chinese":"羅津靠近日本海，在北韓的東北部，接近俄國邊界。"},{"english":"Don't put the fermentation container close to potting plants.","chinese":"發酵容器不能靠近盆栽植物放置。"},{"english":"Lie face down on the floor with your elbows bent and your palms next to your shoulders.","chinese":"臉朝地板向下，肘關節彎曲，手心靠近肩膀。"},{"english":"Iron at temperatures close to and above its critical temperature has an affinity for carbon.","chinese":"鐵在靠近並高於其臨界溫度時對碳具有親合力。"},{"english":"The staggering totals indicate why McGrady needed to get to the hoop.","chinese":"搖擺不定的數據表明了爲什麼麥迪需要更靠近籃圈。"},{"english":"I'll walk, trot , canter or gallop to be near you.","chinese":"我會步行，小跑，慢跑或馳騁在靠近你。"},{"english":"Meanwhile, Seret had inched along the car toward Stephen.","chinese":"與此同時，塞裏特沿着汽車一點一點地靠近了史蒂芬。"}],"related":[{"definition":["to be right next to\/to lean closely against"],"pinyin":["jin3 kao4"],"word":"緊靠"},{"definition":["to touch\/(fig.) to touch on (a matter)"],"pinyin":["chu4 peng4"],"word":"觸碰"},{"definition":["surroundings\/environment\/to encompass"],"pinyin":["zhou1 wei2"],"word":"周圍"},{"definition":["to be far from\/to keep away from"],"pinyin":["yuan3 li2"],"word":"遠離"},{"definition":["to press close to\/to snuggle close\/intimate"],"pinyin":["tie1 jin4"],"word":"貼近"},{"definition":["area\/region\/district"],"pinyin":["qu1 yu4"],"word":"區域"},{"definition":["surname Li","to leave\/to part from\/to be away from\/(in giving distances) from\/without (sth)\/independent of\/one of the Eight Trigrams 八卦[ba1 gua4], symbolizing fire\/☲"],"pinyin":["Li2","li2"],"word":"離"},{"definition":["(in the) vicinity\/nearby\/neighboring\/next to"],"pinyin":["fu4 jin4"],"word":"附近"},{"definition":["distance\/CL:個|个[ge4]\/to be apart from"],"pinyin":["ju4 li2"],"word":"距離"},{"definition":["to cross over\/to transcend\/to cover distance\/to overcome\/to rise above"],"pinyin":["yue4 guo4"],"word":"越過"},{"definition":["outer side"],"pinyin":["wai4 ce4"],"word":"外側"},{"definition":["out\/outward"],"pinyin":["xiang4 wai4"],"word":"向外"},{"definition":["to detour\/to bypass\/to circumvent\/to avoid\/to wind around (of a road etc)"],"pinyin":["rao4 guo4"],"word":"繞過"},{"definition":["to pass through"],"pinyin":["chuan1 guo4"],"word":"穿過"},{"definition":["to touch"],"pinyin":["peng4 chu4"],"word":"碰觸"},{"definition":["to draw close to"],"pinyin":["kao4 long3"],"word":"靠攏"}]}