{"definition":["Mr Gram\/Dr. Hans Christian Jaochim Gram (1953-1938), Danish doctor and inventor of the Gram stain 革蘭氏染色法|革兰氏染色法"],"pinyin":["Ge2 lan2 shi4"],"simplified":["革兰氏"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"革蘭氏","characters":[{"definition":["animal hide\/leather\/to reform\/to remove\/to expel (from office)"],"pinyin":["ge2"],"word":"革"},{"definition":["orchid (蘭花|兰花 Cymbidium goeringii)\/fragrant thoroughwort (蘭草|兰草 Eupatorium fortunei)\/lily magnolia (木蘭|木兰)","surname Lan\/abbr. for Lanzhou 蘭州|兰州[Lan2 zhou1], Gansu"],"pinyin":["Lan2","lan2"],"word":"蘭"},{"definition":["clan name\/maiden name","see 月氏[Yue4 zhi1] and 閼氏|阏氏[yan1 zhi1]"],"pinyin":["shi4","zhi1"],"word":"氏"}],"containing_words":[{"definition":["Gram stain (used to distinguished two different kinds of bacteria)"],"pinyin":["Ge2 lan2 shi4 ran3 se4 fa3"],"word":"革蘭氏染色法"},{"definition":["Gram negative (bacteria that do not retain Gram stain, often the more dangerous kind)"],"pinyin":["Ge2 lan2 shi4 yin1 xing4"],"word":"革蘭氏陰性"}],"sentences":[{"english":"It recognizes lipopolysaccharide, a component of the outer membrane of Gram-negative bacteria.","chinese":"它識別廣泛存在革蘭氏陰性菌細胞外膜上的脂多糖。"},{"english":"Staphylococcus is the main strain of gram-positive bacterias.","chinese":"結論血培養陽性細菌株以革蘭氏陰性菌爲主。"},{"english":"When checking purulent fluid, can search inside the cell see diplococcus of negative of coloring of change orchid family name.","chinese":"檢查膿液時，在細胞內可找見革蘭氏染色陰性雙球菌。"},{"english":"Fucidin has a powerful antibacterial activity against a number of gram-positive microorganisms.","chinese":"立思丁對一系列革蘭氏陽性細菌有強大的抗菌作用。"},{"english":"This Gram-positive oval-shaped bacterium is one of the causes of pneumonia.","chinese":"這種橢圓形的革蘭氏陽性菌可能引起肺炎。"},{"english":"Ran Chenggong calls bacterium of negative of change orchid family name lubriciously .","chinese":"染成紅色的稱爲革蘭氏陰性菌。"},{"english":"It also has a good antibacterial effect to gram-positive bacterial.","chinese":"對革蘭氏陽性菌具有很好的抗菌作用。"},{"english":"Aim To explore new agents of quinolone derivatives with high activity against Gram-positive organisms.","chinese":"目的尋找新的高效抗革蘭氏陽性菌的喹諾酮類藥物。"},{"english":"Conclusion Elsinochrome A had bacteriostasis effects on Gram-positive bacterial growth.","chinese":"結論痂囊腔菌素A能抑制革蘭氏陽性細菌的生長。"},{"english":"Immunohistochemical analysis was also taken for examination of distribution of Bifidobacterium infantis in tissues.","chinese":"組織切片革蘭氏染色，進行圖像分析。"},{"english":"The strain was gram negative, ellipse cell, no spores and no flagellum.","chinese":"菌株細胞呈橢球形，革蘭氏陰性，不產芽孢，無鞭毛。"},{"english":"For Gram-positive bacteria and penicillin-resistant Staphylococcus aureus infection.","chinese":"用於革蘭氏陽性菌及耐青黴素葡萄球菌的感染。"},{"english":"Its mellow extraction has the strong antibacterial function to the Gelanshi masculine bacterium.","chinese":"其醇提取物對革蘭氏陽性細菌有較強的抗菌作用。"},{"english":"Helicobacter pylori is a Gram-negative flagellated spiral bacteria.","chinese":"幽門螺旋桿菌是一種革蘭氏陰性帶有鞭毛的螺旋菌。"},{"english":"The pathogenic bacteria were mainly gram-negative bacteria and secondly was fungi.","chinese":"病原菌主要爲革蘭氏陰性菌，其次是真菌。"},{"english":"The bacteria are anaerobic, gram-positive, spore-forming rods that produce a potent neurotoxin.","chinese":"細菌厭氧，革蘭氏陽性，孢子形成燃料棒產生強大的。"}],"related":[]}