{"definition":["saddle point (math.), a critical point of a function of several variables that is neither a maximum nor a minimum"],"pinyin":["an1 dian3"],"simplified":["鞍点"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"鞍點","characters":[{"definition":["saddle"],"pinyin":["an1"],"word":"鞍"},{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"}],"containing_words":[],"sentences":[{"english":"But the saddle point in the imaginary plane should convolute here.","chinese":"但是在虛擬平面上的鞍點應該環繞這裏。"},{"english":"And enlarge the application of the generalized saddle point .","chinese":"並且拓廣了廣義鞍點的應用。"},{"english":"Super efficient point in vector optimization problems with set-valued maps characterized by generalized saddle point;","chinese":"本文研究集值優化問題嚴有效解的廣義鞍點刻畫問題。"},{"english":"The rate of a process is based upon the energy barrier required to cross the corresponding saddle point, and a harmonic prefactor.","chinese":"越過馬鞍點和前因子所需的能量決定該過程的速度。"},{"english":"The dimers crawl up the potential basin away from the minimum and converge upon saddle points.","chinese":"二聚物查尋法將沿着從極小值點到馬鞍點的路徑運作。"},{"english":"In three-dimensions it could even be a saddle point.","chinese":"在三維空間的時候，這個甚至可以是鞍點。"},{"english":"Moreover, we develop corresponding duality theory and related saddle point theory.","chinese":"同時，我們還建立了對偶理論及相關的鞍點理論。"},{"english":"By using the properties of generalized saddle points and a separation theorem, a property of generalized saddle points is proved with set separation.","chinese":"本文研究集值優化問題嚴有效解的廣義鞍點刻畫問題。"}],"related":[]}