{"definition":["to consolidate\/consolidation\/to strengthen"],"pinyin":["gong3 gu4"],"simplified":["巩固"],"rank":4561.0,"normalized_rank":0.06381430750073454,"fraction":0.000027452844462908692,"cumulative_fraction":0.8476687845154796,"word":"鞏固","characters":[{"definition":["secure\/solid"],"pinyin":["gong3"],"word":"鞏"},{"definition":["hard\/strong\/solid\/sure\/assuredly\/undoubtedly\/of course\/indeed\/admittedly"],"pinyin":["gu4"],"word":"固"}],"containing_words":[],"sentences":[{"english":"Finally, I give back to help others, which cements the knowledge in.","chinese":"最後，我返回來幫助其他人，進一步鞏固我的知識。"},{"english":"Third, after-school careful review, the consolidation of the knowledge the teacher said on the day.","chinese":"第三，課後認真複習，鞏固當天老師講過地知識。"},{"english":"There are also signs that Chinese policymakers are focusing more on shoring up rural infrastructure.","chinese":"還有跡象表明中國的決策者更注重鞏固農鄉基本產業。"},{"english":"Conclusion Consolidate of anisometropia amblyopia have been cured is found to arrest palindromia.","chinese":"結論屈光參差性弱視治癒後的鞏固是預防復發的根本。"},{"english":"It also helped fortify our market position online.","chinese":"這也有助於鞏固我們的在線市場地位。"},{"english":"To prepare for the coming storm, the first task of the newly-formed alliance was to fortify their defenses.","chinese":"爲應對災難降臨，新聯盟的首要任務就是鞏固防禦。"},{"english":"Reinforcing a special American-Indian relationship should be a strategic priority of the next U.S. president.","chinese":"鞏固特殊的美印關係應該是美國下任總統的戰略重點。"},{"english":"The consolidation and development of village political power at the grass-roots level is directly connected with the countryside safely.","chinese":"農村基層政權的鞏固與發展直接關係到國家的安危。"},{"english":"All Party comrades must strive to consolidate and develop this united front.","chinese":"全黨同志必須爲這個統一戰線的鞏固和發展而奮鬥。"},{"english":"Acquiring Atheros will help Qualcomm cement relationships with new customers.","chinese":"收購創銳訊將有助於高通鞏固與新客戶的關係。"},{"english":"She will attend the Kabul conference aimed at shoring up the Afghan government of President Hamid Karzai.","chinese":"她將參加旨在鞏固阿富汗卡爾扎伊政府的喀布爾會議。"},{"english":"These results have further strengthened China’s bilateral economic ties with the two countries respectively.","chinese":"這些成果進一步鞏固了我同兩國的經濟紐帶。"},{"english":"A miner's lamp is fixed onto his helmet.","chinese":"礦燈鞏固在礦工的頭盔上。"},{"english":"Crime in full glory consolidates authority by the sacred fear it inspires.","chinese":"道貌岸然的罪行通過激發神聖的恐懼來鞏固權威。"},{"english":"On the other hand, we have sanctions which are strengthening the illegitimate government.","chinese":"另一方面，制裁卻鞏固了這個非法政府的權力。"},{"english":"Fourth, the international community should undertake joint responsibilities and consolidate the momentum of world economic recovery.","chinese":"第四，國際社會要共擔責任，鞏固世界經濟復甦勢頭。"}],"related":[{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["one step further\/to move forward a step\/further onwards"],"pinyin":["jin4 yi1 bu4"],"word":"進一步"},{"definition":["stable\/steady\/firm\/to stabilize"],"pinyin":["wen3 gu4"],"word":"穩固"},{"definition":["strategy"],"pinyin":["zhan4 lu:e4"],"word":"戰略"},{"definition":["to strengthen\/to intensify"],"pinyin":["qiang2 hua4"],"word":"強化"},{"definition":["to increase\/to strengthen"],"pinyin":["zeng1 qiang2"],"word":"增強"},{"definition":["to reinforce\/to strengthen\/to increase"],"pinyin":["jia1 qiang2"],"word":"加強"},{"definition":["to promote\/to enhance\/to further\/to advance (a cause etc)"],"pinyin":["zeng1 jin4"],"word":"增進"},{"definition":["optimization\/to optimize\/to make superior"],"pinyin":["you1 hua4"],"word":"優化"},{"definition":["developing\/under development\/in the pipeline"],"pinyin":["fa1 zhan3 zhong1"],"word":"發展中"},{"definition":["economic development"],"pinyin":["jing1 ji4 fa1 zhan3"],"word":"經濟發展"},{"definition":["to display\/to exhibit\/to bring out implicit or innate qualities\/to express (a thought or moral)\/to develop (an idea)\/to elaborate (on a theme)"],"pinyin":["fa1 hui1"],"word":"發揮"},{"definition":["active\/energetic\/vigorous\/positive (outlook)\/proactive"],"pinyin":["ji1 ji2"],"word":"積極"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"},{"definition":["to break new ground (for agriculture)\/to open up (a new seam)\/to develop (border regions)\/fig. to open up (new horizons)"],"pinyin":["kai1 tuo4"],"word":"開拓"},{"definition":["to defend\/to safeguard\/to protect\/to uphold\/to maintain"],"pinyin":["wei2 hu4"],"word":"維護"}]}