{"definition":["Han Xin (-196 BC), famous general of first Han emperor Liu Bang 劉邦|刘邦[Liu2 Bang1]"],"pinyin":["Han2 Xin4"],"simplified":["韩信"],"rank":34537.0,"normalized_rank":0.4832174387530956,"fraction":6.313532361778566e-7,"cumulative_fraction":0.9937625675268364,"word":"韓信","characters":[{"definition":["Han, one of the Seven Hero States of the Warring States 戰國七雄|战国七雄\/Korea from the fall of the Joseon dynasty in 1897\/Korea, esp. South Korea 大韓民國|大韩民国\/surname Han"],"pinyin":["Han2"],"word":"韓"},{"definition":["letter\/mail\/CL:封[feng1]\/to trust\/to believe\/to profess faith in\/truthful\/confidence\/trust\/at will\/at random"],"pinyin":["xin4"],"word":"信"}],"containing_words":[],"sentences":[{"english":"When Han arrived, there is no pot of rice.","chinese":"當韓信趕來，鍋裏已經沒有飯了。"},{"english":"Hong Hyun-ik is a North Korea researcher at the Sejong Institute in Seoul.","chinese":"韓信一是首爾世宗研究所的北韓問題研究員。"},{"english":"Thinking of his ambition, Han Xin swallowed the insult and crawled between the rascal's legs.","chinese":"向到自己的遠大志向，韓信忍辱爬了過去。"},{"english":"Han Xin made a kite with cowherd.","chinese":"當時是韓信用牛皮做一隻風箏。"},{"english":"Finally, we should also consider Han Kin's notion of fate in order to assess him comprehensively.","chinese":"最後，要全面看待韓信還要對他的天命觀有所認識。"},{"english":"Then the king called letter to him.","chinese":"於是漢王召見韓信拜他爲大將。"},{"english":"Han Xin made his living by fishing in his early days but he was very ambitious . He kept a sword with him everyday.","chinese":"韓信早年靠釣魚爲生，但他志向遠大，每天劍不離身。"},{"english":"The third message tells us that the Hanshin good with swords.","chinese":"第三個信息告訴我們，韓信好帶刀劍。"},{"english":"Conclusion The methods developed in this experiment can be used for the quality control of Herba Scutellaria indica.","chinese":"結論所用方法可用於韓信草的質量控制。"},{"english":"Later, Han Xin became a general of Han Dynasty and achieved fame.","chinese":"後來，韓信成爲漢朝大將，成就了一代英名。"},{"english":"Then added, Hanshin can not \"rule of Health merchants.\"","chinese":"然後又說，韓信不能“治生商賈”。"}],"related":[{"definition":["Liu Bei (161-223), warlord at the end of the Han dynasty and founder of the Han kingdom of Shu 蜀漢|蜀汉 (c. 200-263), later the Shu Han dynasty"],"pinyin":["Liu2 Bei4"],"word":"劉備"},{"definition":["Guan Yu (-219), general of Shu and blood-brother of Liu Bei in Romance of the Three Kingdoms, fearsome fighter famous for virtue and loyalty\/posthumously worshipped and identified with the guardian Bodhisattva Sangharama"],"pinyin":["Guan1 Yu3"],"word":"關羽"},{"definition":["Zhao Yun (-229), general of Shu in Romance of the Three Kingdoms"],"pinyin":["Zhao4 Yun2"],"word":"趙雲"},{"definition":["Huang Zhong (-220), general of Shu in Romance of the Three Kingdoms, portrayed as an old fighter"],"pinyin":["Huang2 Zhong1"],"word":"黃忠"},{"definition":["Zhuge Liang (181-234), military leader and prime minister of Shu Han 蜀漢|蜀汉 during the Three Kingdoms period\/the main hero of the fictional Romance of Three Kingdoms 三國演義|三国演义, where he is portrayed as a sage and military genius\/mastermind"],"pinyin":["Zhu1 ge3 Liang4"],"word":"諸葛亮"},{"definition":["Liu Bang (256 or 247-195 BC), bandit leader who became first Han emperor Han Gaozu 漢高祖|汉高祖 (reigned 202-195 BC)"],"pinyin":["Liu2 Bang1"],"word":"劉邦"},{"definition":["Jing Ke (-227 BC), celebrated in verse and fiction as would-be assassin of King Ying Zheng of Qin 秦嬴政 (later the First Emperor 秦始皇)"],"pinyin":["Jing1 Ke1"],"word":"荊軻"},{"definition":["Di Renjie (607-700), Tang dynasty politician, prime minister under Wu Zetian, subsequently hero of legends\/master sleuth Judge Dee, aka Chinese Sherlock Holmes, in novel Three murder cases solved by Judge Dee 狄公案[Di2 gong1 an4] translated by Dutch sinologist R.H. van Gulik 高羅珮|高罗佩[Gao1 Luo2 pei4]"],"pinyin":["Di2 Ren2 jie2"],"word":"狄仁傑"},{"definition":["Lü Bu (-198), general and warlord"],"pinyin":["Lu:3 Bu4"],"word":"呂布"},{"definition":["Xiang Yu the Conqueror (232-202 BC), warlord defeated by first Han emperor"],"pinyin":["Xiang4 Yu3"],"word":"項羽"},{"definition":["Sun Bin (-316 BC), political strategist of the School of Diplomacy 縱橫家|纵横家[Zong4 heng2 jia1] during the Warring States Period (425-221 BC)"],"pinyin":["Sun1 Bin4"],"word":"孫臏"},{"definition":["to confront\/to face the enemy"],"pinyin":["dui4 di2"],"word":"對敵"},{"definition":["Wei State (407-225 BC), one of the Seven Hero States of the Warring States 戰國七雄|战国七雄\/Wei State or Cao Wei 曹魏 (220-265), the most powerful of the Three Kingdoms"],"pinyin":["Wei4 guo2"],"word":"魏國"},{"definition":["capable person"],"pinyin":["gan4 jiang4"],"word":"幹將"},{"definition":["skilled manipulator\/tactician\/strategist\/advisor\/counsellor"],"pinyin":["mou2 shi4"],"word":"謀士"},{"definition":["the state of Chu, one of the most important of the small states contending for power in China between 770 and 223 BC, located around present-day Hubei"],"pinyin":["Chu3 guo2"],"word":"楚國"}]}