{"definition":["audio file (computer)"],"pinyin":["yin1 pin2 wen2 jian4"],"simplified":["音频文件"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"音頻文件","characters":[{"definition":["sound\/noise\/note (of musical scale)\/tone\/news\/syllable\/reading (phonetic value of a character)"],"pinyin":["yin1"],"word":"音"},{"definition":["frequency\/frequently\/repetitious"],"pinyin":["pin2"],"word":"頻"},{"definition":["language\/culture\/writing\/formal\/literary\/gentle\/(old) classifier for coins\/Kangxi radical 67","surname Wen"],"pinyin":["Wen2","wen2"],"word":"文"},{"definition":["item\/component\/classifier for events, things, clothes etc"],"pinyin":["jian4"],"word":"件"}],"containing_words":[],"sentences":[{"english":"The service takes a string and returns the audio file as an attachment.","chinese":"這個服務接收字符串並將音頻文件作爲一個附件返回。"},{"english":"Teach user with predefined transcript and from audio file.","chinese":"用戶預定義教成績單和音頻文件。"},{"english":"It takes a lot of resource to generate a sizable amount of data to represent an audio file.","chinese":"生成大量數據以代表一個音頻文件需要耗費許多資源。"},{"english":"This course has audio files that are stored on a computer or on a CD.","chinese":"本課程有儲存在電腦或光盤上的音頻文件。"},{"english":"Automatically upload the audio file to a network location for processing.","chinese":"自動將音頻文件上傳到網絡位置以便處理。"},{"english":"Put a voice on your job-search profile.","chinese":"在你的求職文件中放上一份音頻文件。"},{"english":"The first line gets the path of the audio file.","chinese":"第一行是獲取音頻文件路徑。"},{"english":"WAV, Import audio files, audio wave mapping.","chinese":"導入音頻文件，繪出音頻波形圖。"},{"english":"FM is the world's largest audio-archive focussed on electronic music.","chinese":"FM是世界上最大的致力於電子音樂的音頻文件庫。"},{"english":"View Hecht's audio slideshow on the project here.","chinese":"此處查看赫特的幻燈片音頻文件。"},{"english":"This will also work for audio files such as FLAC , APE or musepack.","chinese":"這也將工作，如後手，超支或千千音頻文件。"},{"english":"A podcast can be easily created from a digital audio file.","chinese":"泡播很容易從數字音頻文件生成。"},{"english":"He has also started recording phone conversations and meetings to store as audio files.","chinese":"他還起頭以音頻文件記實電話談話和會議實況。"}],"related":[]}