{"definition":["to resound\/to resonate"],"pinyin":["xiang3 che4"],"simplified":["响彻"],"rank":23895.0,"normalized_rank":0.33432205168385265,"fraction":0.0000016365551747491214,"cumulative_fraction":0.9825674802604591,"word":"響徹","characters":[{"definition":["echo\/sound\/noise\/to make a sound\/to sound\/to ring\/loud\/classifier for noises"],"pinyin":["xiang3"],"word":"響"},{"definition":["thorough\/penetrating\/to pervade\/to pass through"],"pinyin":["che4"],"word":"徹"}],"containing_words":[],"sentences":[{"english":"Suddenly a great cracking sound split the air .","chinese":"突然，一聲巨大的爆裂聲響徹雲霄。"},{"english":"Where once the very air vibrated with the twittering of thousands of kinds of birds is now only silence.","chinese":"成千上萬的鳥兒那響徹四方的呢喃也歸爲寂靜。"},{"english":"Long be heard this roar over endless realms, in the echoing of a thousand heartstrings .","chinese":"願這長嘯之聲響徹天地，在千億心絃間久久地迴盪。"},{"english":"When Avril appears, screams filled the Shanghai Grand Stage.","chinese":"當艾薇兒出場時，尖叫聲響徹整個上海大舞臺。"},{"english":"Everlasting SongThere are slight ripples of ice over the lake, where she has taken her boat.","chinese":"永恆之歌她在微弱響徹冰的喧鬧聲的湖上下了船。"},{"english":"An outcry went pealing through the night.","chinese":"一聲喊叫響徹夜空。"},{"english":"The sound of the cackling kookaburra rang out across the earth.","chinese":"笑翠鳥清脆的叫聲響徹地球。"},{"english":"The buzzing of an alarm goes off across the yard.","chinese":"警報的嗡嗡聲響徹整個院子。"},{"english":"The National Anthem of make the welkin ring.","chinese":"嘹亮的國歌響徹雲霄。"},{"english":"That you could hear the arteries clanging shut all across the city?","chinese":"你甚至可以聽到整個城市上空都響徹着叫罵聲？"},{"english":"There's music on clinton street all through the evening.","chinese":"柯靈頓街上的音樂，響徹整個晚上。"},{"english":"Let freedom ring from Stone Mountain of Georgia.","chinese":"讓自由之聲響徹從格魯吉亞的石山區。"},{"english":"The voice resounded across the heavens.","chinese":"這聲音響徹三山五嶽。"},{"english":"At dawn, the whole town wakes to recorded patriotic songs and messages blared from loudspeakers.","chinese":"天矇矇亮，喇叭裏就響徹着愛國歌曲和語錄。"},{"english":"I gave my horse a lash that sounded through the forest.","chinese":"我給了我的馬一皮鞭，那聲音響徹森林。"},{"english":"Gun salute as the resounding sound of the National Day, China's military parade ceremony began.","chinese":"隨着六十聲國慶禮炮響徹雲霄，中國閱兵儀式開始。"}],"related":[]}