{"definition":["at most\/at best"],"pinyin":["ding3 duo1"],"simplified":["顶多"],"rank":16619.0,"normalized_rank":0.2325213717067984,"fraction":0.000003431934007524025,"cumulative_fraction":0.9651389852700658,"word":"頂多","characters":[{"definition":["apex\/crown of the head\/top\/roof\/most\/to carry on the head\/to push to the top\/to go against\/to replace\/to substitute\/to be subjected to (an aerial bombing, hailstorm etc)\/(slang) to \"bump\" a forum thread to raise its profile\/classifier for headwear, hats, veils etc"],"pinyin":["ding3"],"word":"頂"},{"definition":["many\/much\/often\/a lot of\/numerous\/more\/in excess\/how (to what extent)\/multi-\/Taiwan pr. [duo2] when it means \"how\""],"pinyin":["duo1"],"word":"多"}],"containing_words":[],"sentences":[{"english":"At most can support about half.","chinese":"頂多能支撐半個左右。"},{"english":"At most you are only a foolish elephant fooled by some people, HAWHAW.","chinese":"呵呵，你頂多是一頭被別人忽悠的笨象。"},{"english":"I can't give you more than$35, can you sell it for that?","chinese":"我頂多能出35美元，這個價錢你肯賣嗎？"},{"english":"\"What you can do now, at best, is to assign people to a part of West Africa, \" Jackson says.","chinese":"現在能做的頂多是將人們劃分爲西非的一部分。"},{"english":"At this stage of our evolution, they’re little more than remnants.","chinese":"我們進化到這一階段，它們頂多是進化的餘留物罷了。"},{"english":"When it comes to how a page looks, at best you're only able to make suggestions.","chinese":"說到頁面的外觀，頂多您只能提提建議。"},{"english":"The closest it does is it would let you test.","chinese":"它頂多能讓你檢查你的計算。"},{"english":"In the cold weather a second cotton tunic over the first one sufficed.","chinese":"天冷的話，就在身上的布衣上頂多加上一件棉布外褂。"},{"english":"There were not more than seven women in the post office then.","chinese":"當時在郵局裏頂多有七個女人。"},{"english":"The students can attend no more than 25 classes a week at best.","chinese":"學生每週頂多能上二十五節課。"},{"english":"You've only got a buck to lose and $1000 bucks to gain.","chinese":"損失頂多一塊美金，收穫可能會有一千塊美金。"},{"english":"I think he is fifteen at (the) most.","chinese":"我想他頂多有15歲。"},{"english":"Freezing. Maybe a couple of degrees over. Have you ever been to Wisconsin?","chinese":"像冰一樣，頂多高几度，你有沒有去過威斯康辛州？"},{"english":"Your current car is old and only worth about $1, 500.","chinese":"你現在開的車很舊頂多也就值個千把塊錢。"},{"english":"They see each other once a month at most.","chinese":"姐妹倆頂多隔一個月才見一次面。"},{"english":"At best he was commended for his athletic presence and stalwart demeanor.","chinese":"人們推薦他的理由頂多是健美的身型和忠實的態度。"}],"related":[]}