{"definition":["top floor\/the top of a building"],"pinyin":["ding3 ceng2"],"simplified":["顶层"],"rank":17228.0,"normalized_rank":0.2410420718313209,"fraction":0.000003202749133350792,"cumulative_fraction":0.9671572334009648,"word":"頂層","characters":[{"definition":["apex\/crown of the head\/top\/roof\/most\/to carry on the head\/to push to the top\/to go against\/to replace\/to substitute\/to be subjected to (an aerial bombing, hailstorm etc)\/(slang) to \"bump\" a forum thread to raise its profile\/classifier for headwear, hats, veils etc"],"pinyin":["ding3"],"word":"頂"},{"definition":["layer\/stratum\/laminated\/floor (of a building)\/storey\/classifier for layers\/repeated\/sheaf (math.)"],"pinyin":["ceng2"],"word":"層"}],"containing_words":[],"sentences":[{"english":"Top-design is very important for information resource management system in e-government.","chinese":"實例證明電子政務信息資源管理系統需要頂層設計。"},{"english":"The top-level design of micro turbine Jet-engine is presented in the paper.","chinese":"對微型渦輪噴氣發動機的頂層設計問題進行了研究。"},{"english":"A top layer is coextensive with and secured to the first side of the synthetic rubber layer.","chinese":"頂層與合成橡膠層的第一側同延並固定到該第一側。"},{"english":"At the top is the super-hot corona, which is made of structures such as loops and streams of ionized gas.","chinese":"最頂層的是超熱日冕，由日冕環和電離氣體流組成。"},{"english":"In 1, the top of the plant room in direct sunlight, poor ventilation.","chinese":"機房在廠房的最頂層陽光直照，通風不良。"},{"english":"The 10% share has gone from 35 to 48.","chinese":"10%的頂層的份額從35增加至48。"},{"english":"In summer the sun beats down on the roof, so that the upper rooms become unbearably hot.","chinese":"夏天炎日照射屋頂，頂層的房間熱得受不了。"},{"english":"It is one of the common engineering accidents that temperature crevice arises in the top coat vertical wall of a brick concrete building.","chinese":"磚混房屋頂層縱牆出現溫度裂縫是常見工程事故之一。"},{"english":"Qatari prime minister Sheikh Hamad bin Jassim, who recently purchased another penthouse in the same development.","chinese":"他於最近在同一地方購買了另一棟頂層公寓。"},{"english":"Can be circled and the wooden ladder to the top, look around Pingliang city scenery.","chinese":"可以木梯盤旋而上至頂層，舉目四望平涼城市風光。"},{"english":"Around the veranda paved with stepping Ishidan, leading to the top.","chinese":"四周廊子鋪有踏磴，可通頂層。"},{"english":"And it's that strong support layer that evens out the top layer and wards off wrinkles.","chinese":"它的這一強有力的支持層，文思了頂層和病房了皺紋。"},{"english":"The buddha's tooth installs in a golden box, puts in a temple top layer darkroom.","chinese":"佛牙裝在一個金盒子中，擱在廟的頂層一個暗室裏。"},{"english":"Long before any code is written. This is top-level section is going to change the fundamentals of how your site functions.","chinese":"這一頂層部分將會改變形成你的網站功能的基礎。"},{"english":"The suite occupies the entire top floor of the hotel.","chinese":"這個套房佔據了整個酒店的頂層。"},{"english":"You need to reach the absolute top of the building to get to the proper Vantage point.","chinese":"你需要上到建築物的最頂層來佔取有利地形。"}],"related":[{"definition":["building (a relatively large, multi-storey one)\/CL:幢[zhuang4],座[zuo4]"],"pinyin":["da4 lou2"],"word":"大樓"},{"definition":["property\/real estate\/abbr. for 物業管理|物业管理[wu4 ye4 guan3 li3], property management"],"pinyin":["wu4 ye4"],"word":"物業"},{"definition":["top floor\/attic\/loft\/garret\/penthouse\/(flat) rooftop (often used as an outdoor living area etc)"],"pinyin":["ding3 lou2"],"word":"頂樓"},{"definition":["office building"],"pinyin":["xie3 zi4 lou2"],"word":"寫字樓"},{"definition":["story\/floor"],"pinyin":["lou2 ceng2"],"word":"樓層"},{"definition":["(used in the names of grand buildings such as 百老匯大廈|百老汇大厦 Broadway Mansions (in Shanghai) or 帝國大廈|帝国大厦 Empire State Building etc)"],"pinyin":["da4 sha4"],"word":"大廈"},{"definition":["office of an association\/meeting place\/clubhouse\/club"],"pinyin":["hui4 suo3"],"word":"會所"},{"definition":["building under construction\/commercial property\/real estate (for sale or rent)"],"pinyin":["lou2 pan2"],"word":"樓盤"},{"definition":["high level\/high class"],"pinyin":["gao1 ceng2"],"word":"高層"},{"definition":["unit (of measure)\/unit (group of people as a whole)\/work unit (place of employment, esp. in the PRC prior to economic reform)\/CL:個|个[ge4]"],"pinyin":["dan1 wei4"],"word":"單位"},{"definition":["garden\/CL:座[zuo4],個|个[ge4]"],"pinyin":["hua1 yuan2"],"word":"花園"},{"definition":["shopping mall\/shopping center\/department store\/emporium\/CL:家[jia1]\/the business world"],"pinyin":["shang1 chang3"],"word":"商場"},{"definition":["upper layer"],"pinyin":["shang4 ceng2"],"word":"上層"},{"definition":["hall\/lounge"],"pinyin":["da4 ting1"],"word":"大廳"},{"definition":["to quote a price\/seller's first offer"],"pinyin":["kai1 jia4"],"word":"開價"},{"definition":["building"],"pinyin":["lou2 yu3"],"word":"樓宇"}]}