{"definition":["terminal bud (growing at the tip of a plant)"],"pinyin":["ding3 ya2"],"simplified":["顶芽"],"rank":67560.0,"normalized_rank":0.9452520532228954,"fraction":8.028769477406271e-9,"cumulative_fraction":0.9999835100753044,"word":"頂芽","characters":[{"definition":["apex\/crown of the head\/top\/roof\/most\/to carry on the head\/to push to the top\/to go against\/to replace\/to substitute\/to be subjected to (an aerial bombing, hailstorm etc)\/(slang) to \"bump\" a forum thread to raise its profile\/classifier for headwear, hats, veils etc"],"pinyin":["ding3"],"word":"頂"},{"definition":["bud\/sprout"],"pinyin":["ya2"],"word":"芽"}],"containing_words":[],"sentences":[{"english":"A regeneration system of plantlets was established with apical bud of Acer negundo L.","chinese":"初步建立了複葉槭頂芽組培再生體系。"},{"english":"The tissue culture of the Netherlands cucumber was studied by using the asepsis seeding of apical buds as the explants.","chinese":"以荷蘭青瓜無菌苗的頂芽爲外植體進行組織培養。"},{"english":"The terminal bud continues vegetative activity during most of the growing season.","chinese":"在大部分生長季節，這種莖的頂芽繼續着植物的生長。"},{"english":"All the pear buds tested in Taipei area began to sprout from late-April to early-May.","chinese":"不論頂芽及側芽，均在四月底到五月初開始萌發。"},{"english":"The explanation begins with the apical bud.","chinese":"解釋要從頂芽開始。"},{"english":"The terminal bud is better than axillary bud for its lower browning rate .","chinese":"下部腋生枝條頂芽作外植體比其他部位取材褐變率低。"},{"english":"The disinfection efficiency of top bud was better than the others.","chinese":"以頂芽爲外植體時，外植體的消毒效果最好。"},{"english":"Selection from progeny of terminal bud propagation.","chinese":"從頂芽繁殖後代中選育。"},{"english":"The buds release this hormone down the plant stem.","chinese":"頂芽將生長素釋放至植株莖部。"}],"related":[]}