{"definition":["smooth and unhindered\/fluent"],"pinyin":["shun4 chang4"],"simplified":["顺畅"],"rank":9326.0,"normalized_rank":0.13048283967372296,"fraction":0.000009324320915805917,"cumulative_fraction":0.9237981858648806,"word":"順暢","characters":[{"definition":["to obey\/to follow\/to arrange\/to make reasonable\/along\/favorable"],"pinyin":["shun4"],"word":"順"},{"definition":["free\/unimpeded\/smooth\/at ease\/free from worry\/fluent"],"pinyin":["chang4"],"word":"暢"}],"containing_words":[],"sentences":[{"english":"You can by hand small pushes, so that lymph flow more smoothly.","chinese":"可以用手輕輕地推按，使淋巴的流動更順暢。"},{"english":"This product sells well, there are no goods remaining every month.","chinese":"這種產品銷路順暢，基本上每月都是滿產滿銷。"},{"english":"They'll pay less and the data network will function more smoothly.","chinese":"那就是他們會話的更少，同時通信網絡將會更加順暢。"},{"english":"There was so little traffic that Stone got home from work in half of the usual time.","chinese":"交通順暢，史東只用了平常一半的時間就到家了。"},{"english":"SCOOT's primary aim is keep traffic flowing smoothly and pedestrians safe.","chinese":"SCOOT的首要目標是保持交通順暢和步行者安全。"},{"english":"China and ASEAN countries keep unimpeded communication on relevant issue.","chinese":"中國與東盟各國就有關問題保持着順暢的溝通。"},{"english":"\"Bi Shun \" has the meaning of thinking of writing is going on smoothly and without obstacles.","chinese":"筆順就是寫作思路順暢，沒有障礙的意思。"},{"english":"The car can keep running without the tune-ups, but it won't run as smoothly and efficiently as you'd like.","chinese":"沒有調整汽車也能開，但是不會開得那麼順暢和有效。"},{"english":"The more liquid a market, after all, the more smoothly it should function.","chinese":"歸根結底，市場流動性越好，其運行也就應該越順暢。"},{"english":"Say goodbye to lawless driving, ensure the smooth flow of traffic.","chinese":"告別違章行車，保證交通順暢。"},{"english":"I had to sleep propped up on pillows so I could breathe.","chinese":"睡覺時必須得斜靠在枕頭上才能呼吸順暢。"},{"english":"Also, probiotics and magnesium vitamins often help keep your body on a healthy, digestive roll.","chinese":"益生菌和鎂維生素使你的消化系統順暢健康地運作。"},{"english":"It allows administrators to manage the system and ensure things are running smoothly.","chinese":"它讓管理員可以管理系統，確保系統運行順暢。"},{"english":"BIf the traffic is OK, it should take about 30 minutes by taxi.","chinese":"B如果交通順暢的話，乘出租車30分鐘就到了。"},{"english":"Nicked insert lowers and disperses resistance at milling, and enables high feed rate by restraining chattering.","chinese":"專用斷屑槽切削抵抗小，提高切削排出順暢性。"},{"english":"A much smoother installation.","chinese":"更加順暢的安裝。"}],"related":[{"definition":["light\/gentle\/relaxed\/effortless\/uncomplicated\/to relax\/to take things less seriously"],"pinyin":["qing1 song1"],"word":"輕鬆"},{"definition":["smoothly\/without a hitch"],"pinyin":["shun4 li4"],"word":"順利"},{"definition":["steady\/stable\/stability\/to stabilize\/to pacify"],"pinyin":["wen3 ding4"],"word":"穩定"},{"definition":["to operate\/operations\/workings\/activities (usu. of an organization)\/thread (computing)"],"pinyin":["yun4 zuo4"],"word":"運作"},{"definition":["unimpeded\/free-flowing\/straight path\/unclogged\/move without obstruction"],"pinyin":["chang4 tong1"],"word":"暢通"},{"definition":["to be capable of\/to be able to\/can"],"pinyin":["neng2 gou4"],"word":"能夠"},{"definition":["smooth\/steady"],"pinyin":["ping2 wen3"],"word":"平穩"},{"definition":["to ensure\/to guarantee"],"pinyin":["que4 bao3"],"word":"確保"},{"definition":["to coordinate\/to harmonize\/to fit together\/to match (colors etc)\/harmonious\/concerted"],"pinyin":["xie2 tiao2"],"word":"協調"},{"definition":["correct\/proper"],"pinyin":["zheng4 que4"],"word":"正確"},{"definition":["norm\/standard\/specification\/regulation\/rule\/within the rules\/to fix rules\/to regulate\/to specify"],"pinyin":["gui1 fan4"],"word":"規範"},{"definition":["assistance\/aid\/to help\/to assist"],"pinyin":["bang1 zhu4"],"word":"幫助"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"},{"definition":["to defend\/to safeguard\/to protect\/to uphold\/to maintain"],"pinyin":["wei2 hu4"],"word":"維護"},{"definition":["condition\/state\/situation\/CL:個|个[ge4]"],"pinyin":["zhuang4 kuang4"],"word":"狀況"},{"definition":["at the same time\/simultaneously"],"pinyin":["tong2 shi2"],"word":"同時"}]}