{"definition":["to congratulate beforehand\/to offer best wishes for"],"pinyin":["yu4 zhu4"],"simplified":["预祝"],"rank":17353.0,"normalized_rank":0.24279098400794705,"fraction":0.0000031547224941132162,"cumulative_fraction":0.9675547630319206,"word":"預祝","characters":[{"definition":["to advance\/in advance\/beforehand\/to prepare"],"pinyin":["yu4"],"word":"預"},{"definition":["surname Zhu","to wish\/to express good wishes\/to pray\/(old) wizard"],"pinyin":["Zhu4","zhu4"],"word":"祝"}],"containing_words":[],"sentences":[{"english":"So here's to the impending revolution in biology. Come Darwin's 300th anniversary there will be even more to celebrate.","chinese":"所以，我們預祝即將來臨的生物學革命。當達爾文誕生"},{"english":"We wish Nantong Zhanyang Fiber Co. , Ltd a promising future on the land of Haimen.","chinese":"我們預祝展陽公司在海門大地上展現陽光燦爛的前景。"},{"english":"Hereby, I'd like to wish this Sino-EU Economic Forum a complete success.","chinese":"在此，我預祝中歐經濟論壇取得圓滿成功。"},{"english":"At last, I wish a complete success for the UCEA and CCEA Continuing Education Forum.","chinese":"最後，我預祝本次論壇取得圓滿成功。"},{"english":"I wish all the athletes the best of luck in their competitions.","chinese":"我預祝各參賽健兒在運動會能夠取得佳績。"},{"english":"We congratulate you beforehand on your success.","chinese":"我們預祝你事業成功。"},{"english":"John crossed his fingers during the race so that Bill would win.","chinese":"比爾在賽跑時，約翰叉起兩指預祝他獲勝。"},{"english":"First I'd like to wish King World Hotel a more successful new year.","chinese":"首先預祝君豪大飯店在新的一年裏更上一層樓。"},{"english":"Wish all colleagues a pleasant holiday and a happy family in advance.","chinese":"預祝全體同事節日愉快，閤家歡樂。"},{"english":"The Governor General welcomed Ambassador Zhang as the new Chinese Ambassador to Canada and wished him all the best in his tenure.","chinese":"約翰斯頓總督歡迎章大使履新，預祝他任內工作順利。"},{"english":"I wish the conference a full success.","chinese":"我預祝會議取得圓滿成功。"},{"english":"I wish this forum a complete success.","chinese":"我預祝本次會議圓滿成功。"}],"related":[]}