{"definition":["prefabricated\/preinstalled\/bundled (software)"],"pinyin":["yu4 zhuang1"],"simplified":["预装"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"預裝","characters":[{"definition":["to advance\/in advance\/beforehand\/to prepare"],"pinyin":["yu4"],"word":"預"},{"definition":["adornment\/to adorn\/dress\/clothing\/costume (of an actor in a play)\/to play a role\/to pretend\/to install\/to fix\/to wrap (sth in a bag)\/to load\/to pack"],"pinyin":["zhuang1"],"word":"裝"}],"containing_words":[],"sentences":[{"english":"The anti-virus software of this computer was pre-installed.","chinese":"這臺計算機的殺毒軟件是預裝的。"},{"english":"A client for the service comes preinstalled with current Eseries models.","chinese":"提供有效的服務客戶預裝在目前的E系列機型。"},{"english":"The desktop version comes pre-installed with a GUI while the server version does not","chinese":"桌面版預裝了GUI，而服務器版沒有。"},{"english":"A complete, pre-assembled Wing-Handle can be fitted through cut-out.","chinese":"安裝時，將整個預裝好的翼形把手穿入開口。"},{"english":"Then the concepts of collaborative digital pre-assembly techniques are presented.","chinese":"在此基礎上，闡述協同數字化預裝配技術的概念。"},{"english":"You can buy a prefilled container or make your own saline solution.","chinese":"你可以買已經預裝好的鹽水或者自己製作鹽水。"},{"english":"The information encoded in the DNA is the preloaded software.","chinese":"編譯在DNA中的信息是預裝的軟件。"},{"english":"These were on the pre-assembled samples, which is why it causes me concern.","chinese":"預裝的樣本是引起我們注意的原因。"},{"english":"Customer deployment reference or pre-installation points cannot be reused.","chinese":"“客戶部署相關”或者預裝分不能被重新使用。"},{"english":"This applies to all software pre-loaded into a device or just included in the BST.","chinese":"這適用於所有的軟件預裝入裝置或只包含在鈦酸鍶鋇。"},{"english":"The client will be preinstalled in selected devices.","chinese":"客戶端將會預裝在特定的設備中。"},{"english":"Assembly sequence planning is the core of digital product pre-assembly.","chinese":"在數字化產品預裝配研究中，裝配序列規劃是核心。"},{"english":"Equipment must be preassembled, wired and shipped in one piece.","chinese":"設備必須預裝，有線和運送一件。"},{"english":"Go on pre-installation of piping in hull section first.","chinese":"先進行管道分段預裝。"},{"english":"Some systems must be equipped to handle a complete power-up .","chinese":"有些系統必須預裝好才能管理統一的電源。"}],"related":[]}