{"definition":["to award\/to confer on (sb)"],"pinyin":["ban1 gei3"],"simplified":["颁给"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"頒給","characters":[{"definition":["to promulgate\/to send out\/to issue\/to grant or confer"],"pinyin":["ban1"],"word":"頒"},{"definition":["to supply\/to provide","to\/for\/for the benefit of\/to give\/to allow\/to do sth (for sb)\/(grammatical equivalent of 被)\/(grammatical equivalent of 把)\/(sentence intensifier)"],"pinyin":["gei3","ji3"],"word":"給"}],"containing_words":[],"sentences":[{"english":"The Nobel has never been given out for applied sciences before.","chinese":"諾貝爾獎以前從未頒給過應用科學領域。"},{"english":"The first prize was awarded to the best competitor of the annual sports meeting .","chinese":"頭獎頒給了這一年一度的運動會上最優秀的運動員。"},{"english":"The highest scholarship went to a postgraduate majoring in physics.","chinese":"最高額的獎學金頒給了一位物理研究生。"},{"english":"His citation says he showed outstanding and exemplary courage.","chinese":"頒給他的嘉獎令稱他表現出非凡的勇氣，堪爲表率。"},{"english":"Last year, the award went to young director Li Yu.","chinese":"去年，這個電影節的獎項頒給了年輕的女導演李玉。"},{"english":"The prize for the best actor went to them.","chinese":"最佳表演獎頒給給了他們倆。"},{"english":"Our teacher presented the award to that straight-A student.","chinese":"老師把獎頒給了那個總考A的學生。"},{"english":"He present a silver cup to the winner.","chinese":"他把銀盃頒給了獲勝者。"},{"english":"I want to thank Dr. Steinberg for this  honorary degree.","chinese":"我要感謝斯坦博格博士頒給我這個名譽學位。"},{"english":"This award goes to the best multihull sailing yacht (catamaran, trimaran, etc) launched in the past year by any brand worldwide.","chinese":"這個獎項是頒給過去一年由亞洲船廠生產的最佳船艇。"},{"english":"Last year, the academy gave the prize to Turkey's Orhan Pamuk.","chinese":"去年，皇家科學院將此獎項頒給土耳其的奧汗。"},{"english":"Most importantly, Blueberry Garden is definitely worthy of the prize bestowed upon it.","chinese":"更重要的是，她對得起頒給她的大獎。"},{"english":"Luodian, a suburb of Shanghai, had considered offering the boxier honorary citizenship.","chinese":"羅店位於上海市郊，曾考慮要頒給泰森榮譽鎮民。"},{"english":"The best teachers award goes to you.","chinese":"因爲您的身教言教，頒給您最佳教師獎。"}],"related":[]}