{"definition":["rather\/quite\/to have much"],"pinyin":["po1 ju4"],"simplified":["颇具"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"頗具","characters":[{"definition":["rather\/quite\/considerably\/oblique\/inclined\/slanting\/Taiwan pr. [po3]","surname Po\/Taiwan pr. [Po3]"],"pinyin":["Po1","po1"],"word":"頗"},{"definition":["tool\/device\/utensil\/equipment\/instrument\/talent\/ability\/to possess\/to have\/to provide\/to furnish\/to state\/classifier for devices, coffins, dead bodies"],"pinyin":["ju4"],"word":"具"}],"containing_words":[],"sentences":[{"english":"Their names are fairly self explanatory.","chinese":"它們的名稱本身就頗具解釋性。"},{"english":"But the continual offence is a very disputable concept in the theory of quantity of crime.","chinese":"而連續犯則是刑法罪數論中頗具爭議的概念。"},{"english":"It is the first time that temporal China forms a comparatively full-scale group of scientists.","chinese":"這一時期的中國第一次形成了頗具規模的科學家羣體。"},{"english":"The acoustics of the room have been expertly planned.","chinese":"這房間的音響效果設計得頗具匠心。"},{"english":"With all its defects the little play has a real charm.","chinese":"儘管有許多不足之處，這出小戲仍頗具魅力。"},{"english":"For gelatinous blobs, sea anemones have a lot of personality.","chinese":"對於凝膠狀的斑斑點點的海葵來說，其頗具人性。"},{"english":"There are also various cooking methods with local ethnic characteristics.","chinese":"烹飪的方法也是多種多樣的，頗具地方民族特色。"},{"english":"Home in the food industry and the strength of large-scale distribution department.","chinese":"家在食品行業內頗具規模和實力的經銷部。"},{"english":"Sheng Xuanhuai is an quite influential character in Chinese modern history.","chinese":"盛宣懷是中國近代史上頗具影響的人物。"},{"english":"The works are instructive, often beautiful and occasionally thrilling.","chinese":"這些精美絕倫的展品頗具啓發性，有的甚至令人震撼。"},{"english":"Brothers tobacco pipe, this is on the drum tower avenue a multi-faceted shop.","chinese":"兄弟菸斗，這是鼓樓大街上頗具特色的一家小店。"},{"english":"Have already become a plastic toy factory with considerable scale now.","chinese":"現已成爲一家頗具規模的塑膠玩具廠。"},{"english":"Such road-pricing,however,can be controversial.","chinese":"但這種道路收費方式頗具爭議。"},{"english":"Duck gizzards with spicy peanuts was Sichuan-inspired.","chinese":"鴨胗拌香辣花生頗具四川風味。"},{"english":"In a word, the study on Industry-Academy-Research cooperation is very significant.","chinese":"產學研合作的研究是一項頗具意義的課題。"},{"english":"The topic of gene materials has been very conflictive in the last 40 years.","chinese":"在過去的40年中，關於基因材料的話題頗具爭議。"}],"related":[]}