{"definition":["to receive"],"pinyin":["ling3 dao4"],"simplified":["领到"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"領到","characters":[{"definition":["neck\/collar\/to lead\/to receive\/classifier for clothes, mats, screens etc"],"pinyin":["ling3"],"word":"領"},{"definition":["to (a place)\/until (a time)\/up to\/to go\/to arrive\/(verb complement denoting completion or result of an action)"],"pinyin":["dao4"],"word":"到"}],"containing_words":[],"sentences":[{"english":"A: The boy will take your key and show you to your room.","chinese":"行李生將拿這鑰匙把您領到房間去。"},{"english":"He was led to the exclusive counter by the staff of the shop.","chinese":"他被商店的職員領到了專門出售高檔商品的櫃檯。"},{"english":"They led the father and son to Gessler, the cruel governor.","chinese":"他們把泰勒父子領到殘暴的總督蓋勒面前。"},{"english":"The detectives swore out a search warrant.","chinese":"偵探宣誓所控屬實後領到一張搜查證。"},{"english":"She swore out a warrant for the arrest of the man who stole her car.","chinese":"她宣誓所控屬實，因此領到了偷她車那個人的逮捕證。"},{"english":"He was at once conducted to the best room in the hotel, which Dolohov had taken for the occasion.","chinese":"他立刻被人領到多洛霍夫於是夜租用的上等客房裏去。"},{"english":"Dormitory parents and cafeteria workers receive paychecks from the school.","chinese":"宿舍的舍長和自助食堂的工人從學校領到了工資。"},{"english":"He'll lovingly take you to your mansion in heaven.","chinese":"祂會慈祥地將你引領到天上的家。"},{"english":"When I arrive, I was taken to the warden.","chinese":"我到達時，被領到監獄長那裏。"},{"english":"All the workers hired by the factory can get a year-end bonus.","chinese":"工廠裏所有的在聘職工都可以領到年終獎金。"},{"english":"When Dr. Yoetz arrived, he was taken to Atzel's room.","chinese":"猶茲大夫來了以後被領到阿採爾的房間。"},{"english":"Police said an informant led narcotics officers to the house.","chinese":"警方說是一名告密者把緝毒警察引領到此的。"},{"english":"He finished regulation time with only four fouls.","chinese":"他在在這段調整時間內僅僅領到四次犯規。"},{"english":"Many needy students in the school have gotten student loan.","chinese":"大多數貧困生都領到了貸學金。"},{"english":"I got my clothing allowance of 100 yuan yesterday.","chinese":"我昨天領到了100元的服裝費。"},{"english":"Love and knowledge, so far as they were possible, led upward toward the heavens.","chinese":"愛情與知識，總是可以把我引領到天堂的境界。"}],"related":[]}