{"definition":["much obliged\/thank you\/to ask advice\/(ironically or humorously) to experience\/to taste"],"pinyin":["ling3 jiao4"],"simplified":["领教"],"rank":25692.0,"normalized_rank":0.35946441313503,"fraction":0.0000013894150524718704,"cumulative_fraction":0.9852834906454138,"word":"領教","characters":[{"definition":["neck\/collar\/to lead\/to receive\/classifier for clothes, mats, screens etc"],"pinyin":["ling3"],"word":"領"},{"definition":["religion\/teaching\/to make\/to cause\/to tell","surname Jiao","to teach"],"pinyin":["Jiao4","jiao1","jiao4"],"word":"教"}],"containing_words":[],"sentences":[{"english":"I noticed when I took my first step inside . I bumped my head on the doorframe .","chinese":"我剛踏進第一步時就領教了，我一頭撞在了門框上。"},{"english":"For Ferguson was learned.","chinese":"對此，弗格森是領教過的。"},{"english":"Oogway may have picked you, but when l'm through with you.","chinese":"烏龜是選中了你，不過等你在我這兒領教過之後。"},{"english":"The Chinese dare to die such as return of spirit perhaps you haven't accepted?","chinese":"中國人誓死如歸的精神也許你們還沒領教過吧？"},{"english":"True parties of'inborn Chi Kung'only so-so, Joe's master accepted.","chinese":"真派的‘先天氣功’不過如此，喬老爺領教了。"},{"english":"She has had a hard line from men before.","chinese":"男人的強硬立場，她也是領教過的。"},{"english":"Readers of 1Q84 have been warned.","chinese":"而《1Q84》的讀者早已有所領教。"},{"english":"I have tasted of his anger.","chinese":"我領教了他的怒氣。"},{"english":"I have seen some of these bright ideas of Smith's before.","chinese":"史密斯的鬼點子我已領教過一些了。"},{"english":"Starting in 1972, we were exposed to such a Soviet steamroller.","chinese":"從一九七二年起，我們就領教了蘇聯這種高壓手段。"},{"english":"Before Mr. Ch'u I can only humbly ask for instruction.","chinese":"在褚先生前面只能虛心領教做學生。"},{"english":"It is astonishing, after the manic energy of India and the peace is welcome.","chinese":"領教過印度瘋狂的能量後，安靜平和的氛圍真不錯。"},{"english":"For its part, the IOC has learned how scorpions behave.","chinese":"國際奧委會可是領教過蠍子是如何表現的。"},{"english":"Anyway, didn't I realized how is that particular someone like?","chinese":"反正，某人是怎麼樣的，我之前不就領教過了嗎？"}],"related":[]}