{"definition":["to feel grateful to sb\/to appreciate the kindness"],"pinyin":["ling3 qing2"],"simplified":["领情"],"rank":25269.0,"normalized_rank":0.35354609432932715,"fraction":0.0000014454704611868524,"cumulative_fraction":0.98468400067574,"word":"領情","characters":[{"definition":["neck\/collar\/to lead\/to receive\/classifier for clothes, mats, screens etc"],"pinyin":["ling3"],"word":"領"},{"definition":["feeling\/emotion\/passion\/situation"],"pinyin":["qing2"],"word":"情"}],"containing_words":[],"sentences":[{"english":"How ungrateful then that, as the talks limp towards collapse, accusing fingers are being pointed at America.","chinese":"隨着對話走向破裂，大家非常不領情面得指責美國。"},{"english":"It's monstrous that he should be so ungrateful for all the help his friends have given him.","chinese":"太可怕了，他竟然對朋友們的幫助如此不領情。"},{"english":"After all I had done, she was still ungrateful.","chinese":"儘管我做了這一切，可她仍然不領情。"},{"english":"It was Johnny's turn to be patronizingly patient.","chinese":"輪到約翰尼要人領情地耐心了。"},{"english":"I'm afraid I stand off because she will not be grateful.","chinese":"恐怕我不能同意，因爲她是不會領情的。"},{"english":"It is a mistake to lavish kindness ungrateful people.","chinese":"對於不領情的人來說浪費感情是一種錯誤。"},{"english":"I'm not ungrateful. But I would like to have a baby.","chinese":"我並非不領情，但是我真的想要一個孩子。"},{"english":"If invited to someone's house for dinner, don't be one of he ungrateful fed.","chinese":"如果應邀到某人家中赴宴，別吃了還不領情。"},{"english":"It’s the typical face work frequently adopted by Chinese government, yet the foreigners never showed their gratefulness.","chinese":"這是中國政府典型面子工程，可外國人仍不領情。"},{"english":"More than the water did not appreciate, contemplating the psychological pull head incense.","chinese":"餘得水並不領情，心理盤算着拔香頭。"}],"related":[{"definition":["lit. change to more severe (idiom); to become more intense (esp. of shortcoming)\/to aggravate\/to intensify"],"pinyin":["bian4 ben3 jia1 li4"],"word":"變本加厲"},{"definition":["lit. wading in mud and water\/a slovenly job\/sloppy"],"pinyin":["tuo1 ni2 dai4 shui3"],"word":"拖泥帶水"},{"definition":["to bear grudges"],"pinyin":["ji4 hen4"],"word":"記恨"},{"definition":["to blame\/to rebuke"],"pinyin":["ze2 guai4"],"word":"責怪"},{"definition":["to submit to humiliation (idiom); to suffer in silence\/to swallow one's anger\/to grin and bear it"],"pinyin":["ren3 qi4 tun1 sheng1"],"word":"忍氣吞聲"},{"definition":["not to hear, not to question (idiom)\/to show no interest in sth\/uncritical\/not in the least concerned"],"pinyin":["bu4 wen2 bu4 wen4"],"word":"不聞不問"},{"definition":["to have an acrimonious falling-out\/to shed all pretense of cordiality\/to tear into each other"],"pinyin":["si1 po4 lian3"],"word":"撕破臉"},{"definition":["the cool eye of a bystander\/a detached point of view"],"pinyin":["leng3 yan3 pang2 guan1"],"word":"冷眼旁觀"},{"definition":["to keep on saying (idiom); to repeat over and over again"],"pinyin":["kou3 kou5 sheng1 sheng1"],"word":"口口聲聲"},{"definition":["to question intensely\/to interrogate\/to demand information"],"pinyin":["bi1 wen4"],"word":"逼問"},{"definition":["to gesticulate\/to point out\/to point the finger of blame"],"pinyin":["zhi3 zhi3 dian3 dian3"],"word":"指指點點"},{"definition":["to fawn on\/to curry favor with\/to make up to"],"pinyin":["ba1 jie5"],"word":"巴結"},{"definition":["to disdain as beneath contempt (idiom)"],"pinyin":["bu4 xie4 yi1 gu4"],"word":"不屑一顧"},{"definition":["to indulge\/to connive at"],"pinyin":["zong4 rong2"],"word":"縱容"},{"definition":["to resign oneself to adversity (idiom); to grin and bear it\/to submit meekly to insults, maltreatment, humiliation etc"],"pinyin":["ni4 lai2 shun4 shou4"],"word":"逆來順受"},{"definition":["to remain unmoved"],"pinyin":["bu4 wei2 suo3 dong4"],"word":"不為所動"}]}