{"definition":["the first time\/for the first time"],"pinyin":["tou2 yi1 hui2"],"simplified":["头一回"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"頭一回","characters":[{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"},{"definition":["one\/1\/single\/a (article)\/as soon as\/entire\/whole\/all\/throughout\/\"one\" radical in Chinese characters (Kangxi radical 1)\/also pr. [yao1] for greater clarity when spelling out numbers digit by digit"],"pinyin":["yi1"],"word":"一"},{"definition":["to circle\/to go back\/to turn around\/to answer\/to return\/to revolve\/Hui ethnic group (Chinese Muslims)\/time\/classifier for acts of a play\/section or chapter (of a classic book)"],"pinyin":["hui2"],"word":"回"}],"containing_words":[],"sentences":[{"english":"It was the first time I saw you blush.","chinese":"那是我頭一回看見你臉紅。"},{"english":"This being a first, he approached the door cautiously.","chinese":"這是頭一回聽到敲門聲，雷利小心翼翼地打開門。"},{"english":"For the first time in a while, social media is a two-horse race.","chinese":"幾年來，社交媒體領域頭一回開始了雙龍爭霸的局面。"},{"english":"I first encountered this when fishing on a friend's power boat.","chinese":"頭一回趕上這種事兒是在搭朋友的汽艇釣魚時。"},{"english":"Ya'll act like you never seen a white person before .","chinese":"你們一個個都表現得象是頭一回見到白人一樣。"},{"english":"Now she heard of pain-killer for the first time.","chinese":"她頭一回聽說止痛藥這個名詞。"},{"english":"This year wasn't the first time Balliet tried to quit. But before, she'd always failed.","chinese":"今年並非貝利葉頭一回戒菸，但以前她總是失敗。"},{"english":"But this time researchers achieved a first in another sense - making an object vanish in all three dimensions.","chinese":"而此次讓物體從三個維度都“消失”卻是頭一回。"},{"english":"Now she heard of Pain-killer for the first time. She ordered a lot at once.","chinese":"她頭一回聽說止痛藥這個名詞，現在就派上了用場。"}],"related":[]}