{"definition":["to create a work of calligraphy for display in a prominent place (typically, a sign)"],"pinyin":["ti2 xie3"],"simplified":["题写"],"rank":23303.0,"normalized_rank":0.3260392036153513,"fraction":0.0000017307107440750675,"cumulative_fraction":0.9815701046203952,"word":"題寫","characters":[{"definition":["surname Ti","topic\/problem for discussion\/exam question\/subject\/to inscribe\/to mention\/CL:個|个[ge4],道[dao4]"],"pinyin":["Ti2","ti2"],"word":"題"},{"definition":["to write"],"pinyin":["xie3"],"word":"寫"}],"containing_words":[],"sentences":[{"english":"The book treats the problem too sketchily.","chinese":"該書關於這一問題寫得太簡略。"},{"english":"Write the key discussion questions on a whiteboard or flipchart.","chinese":"把關鍵性的討論問題寫在白板上或者活頁白掛紙上。"},{"english":"The name of the Ma Ling Mountain House was the inscription by Cai Yuanpei, a great educator and then president of Beijing University.","chinese":"別名“馬嶺山房”是北大校長教育家蔡元培題寫的。"},{"english":"The original Spring Festival couplets inscribed in peach wood board, then rewrite on paper.","chinese":"原來春聯題寫在桃木板上，後來改寫在紙上。"},{"english":"In the Ming and the Qing Dynasties, female mainly carries out the dramatic theory in the preface and postscript.","chinese":"明清女性主要以題寫序跋的方式開展戲曲理論批評。"},{"english":"After 1902, Doyle wrote four more books about the great detective.","chinese":"一九0二年後，道爾又以這個神探爲題寫了四本書。"},{"english":"Now, suppose you need to write articles and essays on some topics.","chinese":"現在假定你需要就某些主題寫幾篇文章或隨筆。"},{"english":"I am going to write an article on our school for my history project.","chinese":"我打算爲我的歷史課題寫一篇關於我校的文章。"},{"english":"Write the problem out on paper, and burn it to symbolically release the pain.","chinese":"把問題寫在紙上，象徵性的把他燒掉來釋放情緒。"},{"english":"These four characters, is Ma Yun's holograph inscribe.","chinese":"這四個字，是馬雲當年親筆題寫的。"},{"english":"Arts Hongtang\" by the Chinese collector Yan-tang, chairman of the Association personally inscribed.\"","chinese":"“藝鴻堂”是由中國收藏家協會會長閆振堂親筆題寫。"},{"english":"At the same year for Japanese rock, hand County 《 the kind thoughts temple 》 writes the horizontal tablet.","chinese":"同年爲日本巖手縣《善念寺》題寫匾額。"},{"english":"As a rough rule, you might consider writing 3-5 pages single space for each question.","chinese":"大致而言，你不妨每題寫三至五頁，單行間距。"},{"english":"I’ve even written a short disquisition on the issue.","chinese":"我甚至就這個問題寫過短篇專題論文。"},{"english":"The signboard at the entrance was inscribed by the K'anghsi (Kangxi) emperor in 1699.","chinese":"入口的牌匾由康熙皇帝與1699年題寫。"},{"english":"Lantern haveers record riddleson a piece of or post you on the lanterns.","chinese":"燈籠的主人會將猜謎題寫在一張紙條上並貼在燈籠上。"}],"related":[]}