{"definition":["outstanding\/notable\/remarkable\/statistically significant"],"pinyin":["xian3 zhu4"],"simplified":["显著"],"rank":3080.0,"normalized_rank":0.043093196032068064,"fraction":0.00004652029610598741,"cumulative_fraction":0.7944921945947561,"word":"顯著","characters":[{"definition":["to make visible\/to reveal\/prominent\/conspicuous\/(prefix) phanero-"],"pinyin":["xian3"],"word":"顯"},{"definition":["(chess) move\/trick\/all right!\/(dialect) to add","aspect particle indicating action in progress","to make known\/to show\/to prove\/to write\/book\/outstanding","to touch\/to come in contact with\/to feel\/to be affected by\/to catch fire\/to burn\/(coll.) to fall asleep\/(after a verb) hitting the mark\/succeeding in","to wear (clothes)\/to contact\/to use\/to apply"],"pinyin":["zhao1","zhao2","zhe5","zhu4","zhuo2"],"word":"著"}],"containing_words":[],"sentences":[{"english":"The garbage collection pause times are the most significant delays any threads encounter.","chinese":"垃圾收集停頓時間是任何線程遇到的最顯著的延遲。"},{"english":"The unique design and construction is what makes it so effective.","chinese":"它的顯著效果來自其獨特的設計及構造。"},{"english":"There were insignificant effects on the fertility rate by cutting barley awn.","chinese":"剪芒對大麥結實率無顯著影響。"},{"english":"Different irrigation maximums also influenced plant significantly at blooming and fruit-bearing stage.","chinese":"不同灌水上限對開花結果期也有顯著影響。"},{"english":"However, there was no significant difference in the lowest SaO2 between the two groups.","chinese":"兩組之間最低血氧飽和度的差異無顯著性意義。"},{"english":"Chronic conditions are managed equally well with chiropractic or yoga.","chinese":"慢性病通過脊神經療法或者瑜伽均可獲得顯著療效。"},{"english":"We expect yield curves to steepen significantly over the medium term.","chinese":"我們預計收益率曲線將在中期顯著變陡。"},{"english":"Correlation analysis showed there was relationship between pet owning and health.","chinese":"相關分析表明，是否擁有寵物犬與身心健康顯著相關。"},{"english":"The crack initiation time determined the composite's toughness.","chinese":"木粉對裂紋引發時間的影響最爲顯著。"},{"english":"The cost is dropped remarkably when cutting thick steel plate.","chinese":"用於厚鋼板氣割時節約成本顯著。"},{"english":"This face-protecting structure has remarkable advantages and is worthy of popularizing.","chinese":"該護面結構優點顯著，有推廣應用的價值。"},{"english":"Maximal oxygen uptake and minute ventilation did not change in either group.","chinese":"最大耗氧量和每分鐘通氣量，兩組均未發生顯著改變。"},{"english":"The diversity and evenness of rodents were influenced significantly by the density of C. dauricus .","chinese":"黃鼠密度顯著地影響鼠類的多樣性和均勻性。"},{"english":"The sludge concentration has a significant impact on membrane filtration resistance.","chinese":"污泥濃度對膜過濾阻力上升速率影響顯著。"},{"english":"The research indicates that chilled water thermal storage system has remarkable economic efficiency and social efficiency.","chinese":"研究表明水蓄冷空調具有顯著的經濟效益和社會效益。"},{"english":"These exist cross-action between specialty and grade. (4) There exist the apparent characteristic on development.","chinese":"並且學科和年級間存在顯著的交互作用。"}],"related":[{"definition":["to lessen\/to decrease\/to reduce\/to lower"],"pinyin":["jian3 shao3"],"word":"減少"},{"definition":["to continue\/to persist\/sustainable\/preservation"],"pinyin":["chi2 xu4"],"word":"持續"},{"definition":["to show\/to illustrate\/to display\/to demonstrate"],"pinyin":["xian3 shi4"],"word":"顯示"},{"definition":["comparatively large"],"pinyin":["jiao4 da4"],"word":"較大"},{"definition":["whole entity\/entire body\/synthesis\/as a whole (situation, construction, team etc)\/global\/macrocosm\/integral\/holistic\/whole"],"pinyin":["zheng3 ti3"],"word":"整體"},{"definition":["maximum\/enormous"],"pinyin":["ji2 da4"],"word":"極大"},{"definition":["completely\/totally\/total\/entire\/overall\/population (statistics)"],"pinyin":["zong3 ti3"],"word":"總體"},{"definition":["one step further\/to move forward a step\/further onwards"],"pinyin":["jin4 yi1 bu4"],"word":"進一步"},{"definition":["thus\/thereby"],"pinyin":["cong2 er2"],"word":"從而"},{"definition":["hidden\/potential\/latent"],"pinyin":["qian2 zai4"],"word":"潛在"},{"definition":["strong\/powerful\/robust"],"pinyin":["qiang2 jing4"],"word":"強勁"},{"definition":["to expand\/to enlarge\/to broaden one's scope"],"pinyin":["kuo4 da4"],"word":"擴大"},{"definition":["slight\/light\/trivial\/to a small extent"],"pinyin":["qing1 wei1"],"word":"輕微"},{"definition":["to lower\/to reduce"],"pinyin":["jian3 di1"],"word":"減低"},{"definition":["trend\/tendency"],"pinyin":["qu1 shi4"],"word":"趨勢"},{"definition":["to grow\/to increase"],"pinyin":["zeng1 zhang3"],"word":"增長"}]}