{"definition":["femtosecond, fs, 10^-15 s"],"pinyin":["fei1 miao3"],"simplified":["飞秒"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"飛秒","characters":[{"definition":["to fly"],"pinyin":["fei1"],"word":"飛"},{"definition":["second (unit of time)\/arc second (angular measurement unit)\/(coll.) instantly"],"pinyin":["miao3"],"word":"秒"}],"containing_words":[],"sentences":[{"english":"Researches on the two-photon photopolymerization technology of a Zr-based inorganic-organic hybrid material have been processed.","chinese":"飛秒激光摻鋯有機無機雜化材料雙光子聚合工藝研究。"},{"english":"Researches on the two-photon photopolymerization technology of SU8 negative photoresist have been processed.","chinese":"飛秒激光SU8負性光刻膠雙光子聚合工藝研究。"},{"english":"A brief discussion on the development of the femtochemistry is presented in this review.","chinese":"對飛秒化學的發展作了簡要的討論。"},{"english":"The ultrafast process in semiconductor was studied by using femtosecond pulse laser.","chinese":"用飛秒脈衝激光技術研究了半導體中的超快過程。"},{"english":"The study of filament caused by propagation of ultra-strong femtosecond laser in air;","chinese":"分析了飛秒激光脈衝在大氣中傳輸時光絲的形成機理。"},{"english":"And chalcogenide allows for \"femtosecond response time\" (now that's fast).","chinese":"硫族化物可以允許“飛秒反應時間”。"},{"english":"The femto—second laser cutting glass technique was also briefly described.","chinese":"最後對飛秒激光切割玻璃的方法做了簡要的介紹。"},{"english":"A new method, temporal filtering, is proposed for improving quality of femtosecond laser pulse.","chinese":"提出用時間域濾波改善飛秒激光脈衝質量。"},{"english":"If you take a walk around the block, you'll be 3 femtoseconds younger than your friend who stayed home.","chinese":"如果你繞着樓走，你會比房間中的朋友年輕3飛秒。"},{"english":"Theoretical analysis of fs-laser induced microexplosion in fused silica .","chinese":"飛秒激光在石英玻璃中誘導微爆炸的理論研究。"},{"english":"Surprisingly, this quantum beating lasted the entire 660 femtoseconds.","chinese":"值得驚奇的是量子拍持續了整整660飛秒。"},{"english":"Calculation and evaluation of dispersions in a femtosecond pulse amplification system.","chinese":"飛秒脈衝放大器中色散的計算和評價方法。"},{"english":"This is a femtosecond laser fired from plasma.","chinese":"這就是等離子體裏發射出的飛秒激光。"},{"english":"Femtosecond laser-frequency comb techniques are vastly simplifying the measurement.","chinese":"飛秒激光光梳技術大大簡化了光頻的測量。"},{"english":"Femtosecond lasers possess unique features that are not achievable with other lasers.","chinese":"飛秒激光具有別種激光無法獲得的特殊性質。"},{"english":"The mechanism of filamentation formed by femtosecond pulse laser beam propagating in atmosphere is investigated.","chinese":"分析了飛秒激光脈衝在大氣中傳輸時光絲的形成機理。"}],"related":[]}