{"definition":["to fly over\/to fly past"],"pinyin":["fei1 guo4"],"simplified":["飞过"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"飛過","characters":[{"definition":["to fly"],"pinyin":["fei1"],"word":"飛"},{"definition":["(experienced action marker)","surname Guo","to cross\/to go over\/to pass (time)\/to celebrate (a holiday)\/to live\/to get along\/excessively\/too-"],"pinyin":["Guo4","guo4","guo5"],"word":"過"}],"containing_words":[{"definition":["to just scrape through with a narrow pass (in an exam)"],"pinyin":["di1 kong1 fei1 guo4"],"word":"低空飛過"},{"definition":["(of birds) to migrate south for the winter"],"pinyin":["nan2 fei1 guo4 dong1"],"word":"南飛過冬"}],"sentences":[{"english":"And the fairy mistress of dreams is coming towards you, flying through the twilight sky.","chinese":"仙鄉里的夢婆飛過朦朧的天空，向你飛來。"},{"english":"Is the sky in memory of Feiyan, flew over, they left off.","chinese":"記憶是天空中的飛雁，飛過，便留下過。"},{"english":"My parents used to live in South America and i used to fly there from Europe in the holidays.","chinese":"我的父母住在美國南部而我常在假期從歐洲飛過去。"},{"english":"A swallow flew past.","chinese":"一隻燕子飛過去了。"},{"english":"They ducked down behind a wall as stones began to fly.","chinese":"他們在石塊飛過來時急忙俯身蹲到一堵牆後。"},{"english":"Mother looked, woodpeckers physicians see small tits fly over.","chinese":"循聲望去，啄木鳥醫師看到是小山雀飛過來了。"},{"english":"Some wild geese have just flown over.","chinese":"一些野鵝剛剛飛過。"},{"english":"An airplane flew across the sky trailing white vapor .","chinese":"一架飛機從空中飛過，尾部拖着一條水汽形成的白線。"},{"english":"A hundred planes will fly by the castle as a mark of respect.","chinese":"100架飛機將飛過城堡以示敬意。"},{"english":"Thoughts pass in my mind like swallows of lucks in the sky.","chinese":"思想掠過我的心上，有如一羣野燕飛過天空。"},{"english":"The number of flowers fluttering butterflies fly.","chinese":"飄飄的彩蝶飛過多少花。"},{"english":"Cards that fly all over the table, spill onto the floor, and disappear beneath a laser beam.","chinese":"卡片飛過桌子，落在地板上，消失在激光束下。"},{"english":"At that moment, the Jade Emperor flew past on a turbulent cloud, waving his arms.","chinese":"在那時，玉皇大帝揮舞著雙手，乘著一片亂雲飛過。"},{"english":"Many a winter's night she flies through the streets of the town, and peeps in at the windows;","chinese":"她常常在冬夜飛過城市的街道，朝窗子裏面望。"},{"english":"An arrow whizzed past his head.","chinese":"一支箭在他頭旁颼地飛過。"},{"english":"Two green-and-white butterflies fluttered past them.","chinese":"兩隻藍白色的蝴蝶從他們身邊飛過。"}],"related":[]}