{"definition":["to endure\/to suffer\/to be subjected to"],"pinyin":["bao3 shou4"],"simplified":["饱受"],"rank":10635.0,"normalized_rank":0.14879744798735187,"fraction":0.000007474492428211513,"cumulative_fraction":0.9346950655097964,"word":"飽受","characters":[{"definition":["to eat till full\/satisfied"],"pinyin":["bao3"],"word":"飽"},{"definition":["to receive\/to accept\/to suffer\/subjected to\/to bear\/to stand\/pleasant\/(passive marker)"],"pinyin":["shou4"],"word":"受"}],"containing_words":[],"sentences":[{"english":"Why did he let them suffer such cruel hardships?","chinese":"祂爲何容讓他們飽受如此殘酷的虐待？"},{"english":"Growing up in a family of musicians, he was saturated with music at an early age.","chinese":"他在音樂世家長大，小時候就飽受音樂薰陶。"},{"english":"The mountain appreared barren, as though it had suffered through many years of arid climate.","chinese":"這座山看起來光禿禿的，似乎飽受了常年的乾旱天氣。"},{"english":"Fett's armor and body were extremely battered by his ordeal in the Sarlacc.","chinese":"在沙拉克中的煎熬使費特的盔甲和身軀都飽受摧殘。"},{"english":"Seawater intake pipe-work systems always suffer the problems of fouling.","chinese":"海水管道系統經常飽受海洋生物污染的侵害。"},{"english":"I was able to meet the person buried under the clenches of her illness.","chinese":"我可以遇到這麼一些飽受病魔折磨的人。"},{"english":"Before being liberated from slavery, these people had been scorned and used and treated as outcasts.","chinese":"以色列人脫離奴役前，飽受嘲弄利用，被視作賤民。"},{"english":"Europe was wracked by religious wars for several hundred years.","chinese":"歐洲就飽受宗教戰爭的摧殘。"},{"english":"Aguirre is now the ruler of a group of slowly starving, hallucinating men.","chinese":"阿基爾現在成了一羣飽受飢餓與幻覺困擾者的首領。"},{"english":"Since the outbreak of the financial crisis, Greenspan has been roundly criticized.","chinese":"金融海嘯爆發以來，葛老飽受批評。"},{"english":"And art made tongue-tied by authority.","chinese":"學術結舌失語，飽受當局鉗制。"},{"english":"The preparations for the summit, at any rate, have been unusually contentious.","chinese":"不管怎樣，這次峯會的籌備工作還是飽受爭議。"},{"english":"Subjected to torture and cruelty, Vosa succumbed to the dark side.","chinese":"飽受痛苦和折磨的沃薩終於向黑暗面屈服了。"},{"english":"Zhang Ziyi has been criticized for not replying to accusations of charity fraudleveled against her.","chinese":"章子怡因一直未對“詐捐”指責做出迴應而飽受批評。"},{"english":"How can one haunted by madness be joyful?","chinese":"一個飽受瘋癲折磨人如何才能喜悅？"},{"english":"The private army is under fire.","chinese":"這支私人軍隊正飽受抨擊。"}],"related":[]}