{"definition":["to enjoy fully\/to experience to the full over a long period"],"pinyin":["bao3 chang2"],"simplified":["饱尝"],"rank":32602.0,"normalized_rank":0.456144278258923,"fraction":7.475514271599546e-7,"cumulative_fraction":0.9924316753429056,"word":"飽嘗","characters":[{"definition":["to eat till full\/satisfied"],"pinyin":["bao3"],"word":"飽"},{"definition":["to taste\/to try\/to experience\/already\/ever\/once"],"pinyin":["chang2"],"word":"嘗"}],"containing_words":[],"sentences":[{"english":"Other plants can't do without tanking up loads of sunlight.","chinese":"其它的植物就非得飽嘗充足的陽光。"},{"english":"Teenagers experience a feeling of isolation.","chinese":"青少年飽嘗了一種孤立感。"},{"english":"He is no stranger to poverty.","chinese":"他曾飽嘗貧窮之苦。"},{"english":"Therefore they shall eat the fruit of their own way, and shall be filled with their own devices.","chinese":"所以他們必要自食其果，飽嘗獨斷獨行的滋味。"},{"english":"They suffer from thirst first and always.","chinese":"由於他們總是飽嘗口渴的折磨。"},{"english":"People in many countries are suffering from public hazards. 6.For example, …","chinese":"現在許多國家的人民飽嘗公害之苦。"},{"english":"Your pain and your hunger, they're drivin' you home.","chinese":"你飽嘗的苦楚和睏乏，催促著歸家的腳步。"},{"english":"Nourished lavenders have been surrounded by chained hearts.","chinese":"用串聯的心縈繞著飽嘗滋養的薰衣草。"},{"english":"Even so being full of your ne'er-cloying sweetness.","chinese":"同樣，飽嘗了你的不膩人的甜蜜。"},{"english":"This legendary man has endured almost all the bitterness of human life.","chinese":"這位傳奇人物曾飽嘗人世的辛酸。"},{"english":"The life expectancy of these hardy settlers upon arriving was two years.","chinese":"這些飽嘗磨難的拓居者到達新大陸後的壽命只有兩年。"},{"english":"Of the fruit of a man's mouth shall his belly be satisfied: and the offspring of his lips shall fill him.","chinese":"人必以口中果實充滿肚腹，必飽嘗自己脣舌的出產。"},{"english":"He had strong beliefs against racism and went to prison for his people.","chinese":"他反對種族主義，爲了他的人民他曾飽嘗牢獄之苦。"},{"english":"He knew poverty and sorrow in his early days.","chinese":"他早年飽嘗過窮困和憂愁。"},{"english":"As long as you watch, can have beautiful scenery along the way.","chinese":"只要你細心觀看，就能飽嘗沿途美景。"},{"english":"Make it too short and you’ll end up frustrated.","chinese":"如果過短，最終會使你飽嘗挫折。"}],"related":[]}