{"definition":["to provide for\/to keep (animals, a family etc)\/to raise animals\/to feed and clothe\/support\/the necessities of life\/to give birth"],"pinyin":["yang3 huo5"],"simplified":["养活"],"rank":13238.0,"normalized_rank":0.18521679515341455,"fraction":0.000005182351731225454,"cumulative_fraction":0.9508946982107296,"word":"養活","characters":[{"definition":["to raise (animals)\/to bring up (children)\/to keep (pets)\/to support\/to give birth"],"pinyin":["yang3"],"word":"養"},{"definition":["to live\/alive\/living\/work\/workmanship"],"pinyin":["huo2"],"word":"活"}],"containing_words":[],"sentences":[{"english":"The man has a large family to support.","chinese":"這個人要養活一大家子人。"},{"english":"It has sustained them for generations, providing everything they need to survive.","chinese":"祂世世代代養活着他們，賜予他們生存所必須的一切。"},{"english":"Mehlman said it is average Americans who pay the bill for illegal immigrants.","chinese":"梅爾曼表示，是普通的美國人在養活那些非法移民。"},{"english":"His meager wage is not enough to support their five children.","chinese":"靠他一個人的微薄工資不足以養活他們的五個孩子。"},{"english":"I pity anyone who has to feed a family on such a low income.","chinese":"我憐憫任何必要以如此菲薄的收益養活百口的人。"},{"english":"He had a big family to feed.","chinese":"他還有一大家子人要養活，他不可能走開啊。"},{"english":"He sponged off his family for many years.","chinese":"多年以來他一直靠着父母養活。"},{"english":"Who earns his living without doing a day's work?","chinese":"誰白天不幹活卻能養活自己？"},{"english":"Side of the water is not only to feed the one who brought prosperity back to town.","chinese":"這一方水不僅養活了一方人，還給小鎮帶來了繁榮。"},{"english":"It also means students can work and support themselves more easily around their learning.","chinese":"這還意味着學生更容易在學習之餘去打工養活自己。"},{"english":"His wages are adequate to support three people.","chinese":"他的工資夠養活三口人。"},{"english":"So then, don't be afraid.  I will provide for you and your children.","chinese":"現在你們不要害怕，我必養活你們和你們的婦人孩子。"},{"english":"By doing this, they believe the child could survive and be grow up sound and happy.","chinese":"他們相信只有說壞話，才能夠養活這個小孩。"},{"english":"My home has the eight people person, whole is feed by a person of my father.","chinese":"我家裏有八口人，全靠我爸爸一個人養活。"},{"english":"But you can't feed her, who's to blame.","chinese":"可你養活不起，這怪誰呢？"},{"english":"She prostituted herself in order to support her children.","chinese":"她爲養活子女而操皮肉生涯。"}],"related":[]}