{"definition":["to maintain\/to conserve\/curing (concrete etc)"],"pinyin":["yang3 hu4"],"simplified":["养护"],"rank":10298.0,"normalized_rank":0.1440823807591678,"fraction":0.000007879142409872791,"cumulative_fraction":0.9321068566394494,"word":"養護","characters":[{"definition":["to raise (animals)\/to bring up (children)\/to keep (pets)\/to support\/to give birth"],"pinyin":["yang3"],"word":"養"},{"definition":["to protect"],"pinyin":["hu4"],"word":"護"}],"containing_words":[],"sentences":[{"english":"Results show that the recycling agent can heal the small fracture in asphalt road.","chinese":"再生養護劑可使瀝青路面上的細小裂縫基本癒合。"},{"english":"It costs more and more to run this car each year.","chinese":"這輛車每年的養護費用越來越多了。"},{"english":"The whole maintenance, forms smuggles the homogeneous ground.","chinese":"整體養護，形成夾帶均一的地坪。"},{"english":"This paper introduces control system of sleeper maintenance based on OMRON PLC.","chinese":"介紹了以歐姆龍PLC爲核心的軌枕養護控制系統。"},{"english":"Bituminous road asphalt pavement planer is a kind of popular road maintenance equipment.","chinese":"瀝青路面銑刨機是一種常用的路面養護機械。"},{"english":"After the completion of the building should be well maintenance, keep wet surface masonry.","chinese":"砌築完畢後應做好養護，保持砌體表面潮溼。"},{"english":"One method of soil conservation is the use of windbreaks.","chinese":"土壤養護的辦法之一是利用防風林。"},{"english":"Consequently, maintenance and operation are important parts of highway engineering.","chinese":"因此養護和運營也是公路工程的重要部分。"},{"english":"Measuring results had certain reference value to maintenance and management of tall fescue lawn.","chinese":"所測結果對高羊茅的養護和管理有一定的參考價值。"},{"english":"Exterior walls and ceilings covered with maintenance-pine relief tempered with bio-based oil.","chinese":"外牆壁和天花板被塗了生物油的養護松覆蓋。"},{"english":"Take the average temperature in the curing time as curing temperature.","chinese":"養護溫度取各溼噴樁養護期的平均氣溫。"},{"english":"Take the average temperature in the curing time as curing temperature.","chinese":"養護溫度取各溼噴樁養護期的平均氣溫。"},{"english":"The project will also address highway maintenance and safety issues.","chinese":"此外該項目還注重公路養護和交通安全問題。"},{"english":"We finish the design and implementation of a management system, project maintance.","chinese":"並在此基礎上設計與實現了工程養護管理系統。"},{"english":"Higher curing temperature and addition of air-entrained agent could decrease bleeding capacity of grout effectively.","chinese":"提高養護溫度或摻加引氣劑可降低灌漿材料的泌水率。"},{"english":"It is efficient to use concrete curing agent in evaporating and curing process for ready-made rei…","chinese":"在蒸養預製鋼筋混凝土生產中應用養護劑是有效的。"}],"related":[{"definition":["to strengthen\/to intensify"],"pinyin":["qiang2 hua4"],"word":"強化"},{"definition":["to take good care of (or conserve) one's health\/to keep in good repair\/to maintain\/maintenance"],"pinyin":["bao3 yang3"],"word":"保養"},{"definition":["character\/intrinsic quality (of a person)\/quality (of a product or service, or as in \"quality of life\", \"air quality\" etc)"],"pinyin":["pin3 zhi4"],"word":"品質"},{"definition":["to coordinate\/to harmonize\/to fit together\/to match (colors etc)\/harmonious\/concerted"],"pinyin":["xie2 tiao2"],"word":"協調"},{"definition":["condition\/state\/situation\/CL:個|个[ge4]"],"pinyin":["zhuang4 kuang4"],"word":"狀況"},{"definition":["to ensure\/to guarantee"],"pinyin":["que4 bao3"],"word":"確保"},{"definition":["to use\/to put to use"],"pinyin":["yun4 yong4"],"word":"運用"},{"definition":["to prevent\/to take precautions against\/to protect\/to guard against\/precautionary\/prophylactic"],"pinyin":["yu4 fang2"],"word":"預防"},{"definition":["to evaluate\/to assess\/assessment\/evaluation"],"pinyin":["ping2 gu1"],"word":"評估"},{"definition":["to adjust\/to regulate\/to harmonize\/to reconcile (accountancy etc)"],"pinyin":["tiao2 jie2"],"word":"調節"},{"definition":["practical\/workable\/to implement\/to carry out\/to decide"],"pinyin":["luo4 shi2"],"word":"落實"},{"definition":["clean\/to clean"],"pinyin":["qing1 jie2"],"word":"清潔"},{"definition":["via"],"pinyin":["jing1 you2"],"word":"經由"},{"definition":["to harm\/to damage\/to injure\/impairment\/loss\/disability"],"pinyin":["sun3 shang1"],"word":"損傷"},{"definition":["optimization\/to optimize\/to make superior"],"pinyin":["you1 hua4"],"word":"優化"},{"definition":["to combine\/to link\/to integrate\/binding\/CL:次[ci4]"],"pinyin":["jie2 he2"],"word":"結合"}]}