{"definition":["beekeeper\/apiculturist"],"pinyin":["yang3 feng1 ren2"],"simplified":["养蜂人"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"養蜂人","characters":[{"definition":["to raise (animals)\/to bring up (children)\/to keep (pets)\/to support\/to give birth"],"pinyin":["yang3"],"word":"養"},{"definition":["bee\/wasp"],"pinyin":["feng1"],"word":"蜂"},{"definition":["man\/person\/people\/CL:個|个[ge4],位[wei4]"],"pinyin":["ren2"],"word":"人"}],"containing_words":[],"sentences":[{"english":"Lenin went up to the house and saw the bee-keeper.","chinese":"列寧走到房子旁見到了養蜂人。"},{"english":"Beekeepers will naturally deny that they are slave owners who steal the products of the","chinese":"養蜂人自然會否認自己是偷蜜蜂勞動產品的奴隸主。"},{"english":"He says that there are many different filtering methods used by beekeepers and honey packers.","chinese":"他說養蜂人和蜂蜜分裝工人使用的過濾方法有很多種。"},{"english":"Y. S. Beekeepers of Generations have been dedicated to research and develop the highest quality Bee Products:Y. S.","chinese":"各代養蜂人一直致力於研究和開發高質量的蜂產品。"},{"english":"The beekeeper's family will then migrate with them to their summer location.","chinese":"養蜂人的家在那時將會遷移回它們夏天在的那個地方。"},{"english":"Every year, beekeepers will come honey, litchi honey is a good thing.","chinese":"每年，養蜂人都會趕來採蜜，荔枝蜜是很好的東西。"},{"english":"So the people that should be praised for protecting the honey bees are the beekeepers.","chinese":"所以人們應該讚揚養蜂人保護蜜蜂這種行爲。"},{"english":"Seeing the bee-man they went into action simultaneously stinging him fiercely and maliciously .","chinese":"它們看見了養蜂人，蜂擁而上，兇狠地蜇起他來。"},{"english":"There were beekeepers who found their hives empty this spring.","chinese":"這春季好多養蜂人發現它們的蜂房是空的。"},{"english":"US Beekeepers report a decrease of 70% of their hives .","chinese":"美國養蜂人報告說他們的麻蜂數量下降了70%。"},{"english":"The Beaky Birds beekeepers did not find dead adult bees as they often do after winter.","chinese":"養蜂人沒有像往常那樣在冬天後發現死亡的成年蜜蜂。"},{"english":"The beekeeper hived the swarm.","chinese":"養蜂人把蜂羣裝入蜂箱。"},{"english":"From the flowers of the white clover, regarded by beekeepers to be the best honey.","chinese":"採自苜宿小花被養蜂人公認爲最好的蜂蜜。"},{"english":"He says beekeepers were brought in to help.","chinese":"同時，養蜂人也被找來幫忙。"},{"english":"A beekeeper has been called in to take care of the problem.","chinese":"該鎮請來一名養蜂人來解決這個問題。"},{"english":"In a harvest season, a beekeeper tried making honey.","chinese":"養蜂人在一次收穫的季節裏，想要嘗試釀蜜。"}],"related":[]}