{"definition":["remaining"],"pinyin":["yu2 xia4"],"simplified":["余下"],"rank":11494.0,"normalized_rank":0.1608159724651267,"fraction":0.0000065764380677569065,"cumulative_fraction":0.9407142669779514,"word":"餘下","characters":[{"definition":["extra\/surplus\/remaining\/remainder after division\/(following numerical value) or more\/in excess of (some number)\/residue (math.)\/after\/I\/me","surname Yu","variant of 餘|余[yu2], remainder"],"pinyin":["Yu2","yu2"],"word":"餘"},{"definition":["down\/downwards\/below\/lower\/later\/next (week etc)\/second (of two parts)\/to decline\/to go down\/to arrive at (a decision, conclusion etc)\/measure word to show the frequency of an action"],"pinyin":["xia4"],"word":"下"}],"containing_words":[],"sentences":[{"english":"Saw the rest several later on live, indeed as expected, you all the way kill into 5 strong.","chinese":"隨後看了餘下的幾場直播，果然，你一路殺進5強。"},{"english":"Ross: All right, so I don't know what sycophant means, but the rest is right.","chinese":"那我不知道“拍馬屁”的意思，但餘下的是對的。"},{"english":"He spends the rest of the book describing how to survive without one.","chinese":"本書餘下的篇幅裏描述了沒有車該如何生存。"},{"english":"Cut the remaining half chorizo and bacon into slices and lay them on top.","chinese":"餘下半份香腸和煙肉切片，鋪上表面。"},{"english":"The rest went to Fang.","chinese":"餘下的就都進了方的腰包。"},{"english":"Like the rest of us, Koreans live in interesting times.","chinese":"就像餘下的我們，朝鮮人生活在一個有趣的時代。"},{"english":"Filling the remaining modest gap in concerned-parents' control can hardly be a compelling state interest.","chinese":"填補餘下的小漏洞不能說是州政府的迫切利益。"},{"english":"Actuarial gains and losses are recognised over the average remaining service lives of employees.","chinese":"精算收益及虧損於僱員的平均餘下服務年期內確認。"},{"english":"And the only things left in the castle were Darkness and the Red Death.","chinese":"城堡中只餘下黑暗和紅死魔，此外別無一物。"},{"english":"Next, you need to fill in the remaining cells.","chinese":"接下來，需要填充餘下的單元格。"},{"english":"He never used the full-court press the same way again.","chinese":"在餘下的賽季，他再也沒那樣使用全場緊逼。"},{"english":"Finally, a ridge is formed around the tree trunk with the remaining soil.","chinese":"最後，把餘下的土在樹幹周圍培埂。"},{"english":"Chapter 6 discusses the remaining steps.","chinese":"第6章會討論餘下的步驟。"},{"english":"What remains, in ChengDu, I have only one thing to do.","chinese":"餘下來的，在成都，我就只有一件事可以做了。"},{"english":"The town sits on toxic waste from a century ofsmall-scale mining.","chinese":"這個城市座落在一百年前的小礦餘下的有毒廢料周圍。"},{"english":"I thought you weren't talking to me for the rest of your life?","chinese":"我認爲你不會跟我談你餘下來的生活吧？"}],"related":[]}