{"definition":["(math.) cosine"],"pinyin":["yu2 xian2"],"simplified":["余弦"],"rank":59853.0,"normalized_rank":0.8374211240608341,"fraction":4.247948941682226e-8,"cumulative_fraction":0.9998087180706624,"word":"餘弦","characters":[{"definition":["extra\/surplus\/remaining\/remainder after division\/(following numerical value) or more\/in excess of (some number)\/residue (math.)\/after\/I\/me","surname Yu","variant of 餘|余[yu2], remainder"],"pinyin":["Yu2","yu2"],"word":"餘"},{"definition":["bow string\/string of musical instrument\/watchspring\/chord (segment of curve)\/hypotenuse\/CL:根[gen1]"],"pinyin":["xian2"],"word":"弦"}],"containing_words":[{"definition":["hyperbolic cosine or cosh (math.)"],"pinyin":["shuang1 qu1 yu2 xian2"],"word":"雙曲餘弦"}],"sentences":[{"english":"Discrete Cosines Transform(DCT) is an effective tool for analysis image signal.","chinese":"離散餘弦變換是分析圖像信號的有效工具。"},{"english":"Near perfect reconstruction cosine-modulated filter banks with high stop attenuation can be achieved using the proposed method.","chinese":"該方法可獲得很高阻帶衰減的餘弦調製濾波器組。"},{"english":"The parameters of equivalent four? terminal networks of the single cosine type ultrasonic horn are derived.","chinese":"推導出餘弦形單一超聲變幅杆的等效四端網絡參量。"},{"english":"Above, we plotted both the sine and cosine on the same graph.","chinese":"上面，我們在同一圖中繪製了正弦和餘弦曲線。"},{"english":"This paper studies the grating projective images compression technology based on Discrete Cosine Transformation(DCT).","chinese":"文中研究了基於離散餘弦變換的光柵投影圖的壓縮。"},{"english":"The focal switch of cosine-Gaussian beams focused by a thin lens without aperture is studied in detail.","chinese":"研究了餘弦高斯光束通過無光闌透鏡後的焦開關現象。"},{"english":"And they tried to run it, and it ran a long time.","chinese":"他們又去試了試餘弦，也不行。"},{"english":"Let us plot both the sine and the cosine curves.","chinese":"假設我們同時繪製正弦和餘弦曲線。"},{"english":"I hear some cosines. I hear some sines.","chinese":"我還聽到了餘弦，還有正弦。"},{"english":"Google can even work with trigonometric functions, including sine and cosine. Google.","chinese":"甚至能用三角函數計算，包括正弦和餘弦。"},{"english":"According to quantified standard data, the closed degree of between stylebooks was computed with cosine of included angle.","chinese":"據標準化數據用夾角餘弦計算樣本間的貼近度。"},{"english":"The confidence level and uncertainty limit of cosine of uniform R.","chinese":"均勻隨機變數餘弦之均值不確定範圍之信心準位。"}],"related":[]}