{"definition":["one's remaining years"],"pinyin":["yu2 nian2"],"simplified":["余年"],"rank":50145.0,"normalized_rank":0.7015936087753417,"fraction":1.4174427568293614e-7,"cumulative_fraction":0.9989807005640671,"word":"餘年","characters":[{"definition":["extra\/surplus\/remaining\/remainder after division\/(following numerical value) or more\/in excess of (some number)\/residue (math.)\/after\/I\/me","surname Yu","variant of 餘|余[yu2], remainder"],"pinyin":["Yu2","yu2"],"word":"餘"},{"definition":["surname Nian","year\/CL:個|个[ge4]"],"pinyin":["Nian2","nian2"],"word":"年"}],"containing_words":[],"sentences":[{"english":"Traditional Beijing roast duck is famous all over the world with a hundred years of history.","chinese":"老北京前門烤鴨名揚四海，至今已有百餘年的歷史。"},{"english":"He held the assignment for over ten years.","chinese":"他擔任這一任務達10餘年之久。"},{"english":"I remember that for one hundred years, they have set their armies to destroy us.","chinese":"我記得這百餘年來它們不停地派軍隊來企圖消滅我們。"},{"english":"He has cloistered himself in a monastery for more than thirty years.","chinese":"他隱居於修道院中已三十餘年。"},{"english":"No. 4 semi-portal crane has been used in Qingtongxia Hydropower Station for more than 30 years.","chinese":"青銅峽水電廠4號半門式起重機投入運行已30餘年。"},{"english":"Professor FENG Run-shen is engaged in medicine for more than 60 years.","chinese":"馮潤身教授從醫60餘年，注重醫德，醫技精湛。"},{"english":"China's aircraft leasing business has an experience of more than 20 years, but still in its infancy.","chinese":"中國的飛機租賃業歷經20餘年，仍處於起步階段。"},{"english":"For more than one decade I devoted myself to revolutionary struggle.","chinese":"我從事革命鬥爭，已經十餘年了。"},{"english":"Graduated from Hubei Medical College and has engaged in clinic and science research over ten years.","chinese":"從事皮膚性病科科研臨牀十餘年。"},{"english":"As early as two thousand years ago, China and Thailand started contact.","chinese":"早在兩千餘年前，中泰就開始了交往活動。"},{"english":"It took a hundred thousand men more than twenty years to build the Great Pyramid.","chinese":"大金字塔是由十多萬人修造了二十餘年才建成的。"},{"english":"Background Shexiang Baoxinwan has been used in treating coronary heart disease(CHD) for over thirty years.","chinese":"背景麝香保心丸自研發上市至今已達三十餘年之久。"},{"english":"Intramedullary fixation of rib fractures with generic Kirschner wires has been practiced for over 50 years.","chinese":"採用普通克氏針髓內固定肋骨骨折已有50餘年。"},{"english":"Luancheng County history goes back to ancient times, there are more than 2,500 years.","chinese":"欒城縣歷史源遠流長，有2500餘年的歷史。"},{"english":"The king, who has reigned for six decades, is widely revered.","chinese":"廣受尊崇的普密蓬國王已經在位六十餘年。"},{"english":"Master Sang began practicing Feng Shui over 40 years ago.","chinese":"曾大師四十餘年來一直致力於實踐風水學。"}],"related":[]}