{"definition":["residual heat\/surplus heat\/fig. old people's capacity for work"],"pinyin":["yu2 re4"],"simplified":["余热"],"rank":20888.0,"normalized_rank":0.29225022036293424,"fraction":0.0000021798839019292333,"cumulative_fraction":0.9768677223630512,"word":"餘熱","characters":[{"definition":["extra\/surplus\/remaining\/remainder after division\/(following numerical value) or more\/in excess of (some number)\/residue (math.)\/after\/I\/me","surname Yu","variant of 餘|余[yu2], remainder"],"pinyin":["Yu2","yu2"],"word":"餘"},{"definition":["to warm up\/to heat up\/hot (of weather)\/heat\/fervent"],"pinyin":["re4"],"word":"熱"}],"containing_words":[],"sentences":[{"english":"He will return to San Paolo and perhaps continue playing there.","chinese":"而他將會返回聖保羅，繼續發揮餘熱。"},{"english":"However he now has a chance to revive the embers of his career with Lecce.","chinese":"而現在，他有機會在萊切發揮自己職業生涯的餘熱。"},{"english":"The residual energy of heat will be excluded from the machine.","chinese":"直燃機排出的餘熱以熱能的形式存在。"},{"english":"These retired men are content to devote their remaining energy here.","chinese":"能夠來這裏發揮餘熱，這些退休老人也得其所哉。"},{"english":"The steam used for production will adopt the residual heat from the thermal power plant of Tianyuan Salt Factory of Pingdingshan Haolong Corporation.","chinese":"生產用蒸汽利用平頂山皓龍公司天源製鹽廠電廠餘熱。"},{"english":"The utility model relates to a high-efficient energy-saving heat exchanger, particularly a waste heat recovery and reuse device of a boiler.","chinese":"高效節能換熱裝置涉及一種鍋爐餘熱回收利用裝置。"},{"english":"The power generation technology utilizing the temperature difference of engine exhaust gas is introduced.","chinese":"介紹了利用發動機排氣餘熱的溫差發電技術。"},{"english":"Excess heat in the commodity above the disired transit temperature.","chinese":"貨物本身高於所需運輸溫度的那部分餘熱。"},{"english":"They tried to recuperated waste heat to produce electric current.","chinese":"他們試圖回收餘熱發電。"},{"english":"This paper analyzes the process of decay heat removal after Chinese Experimental Fast Reactor(CEFR) scram .","chinese":"分析了中國實驗快堆事故停堆後餘熱的排放過程。"},{"english":"Waste heat accounts for about 40% of the energy produced by power stations.","chinese":"餘熱約佔發電站產生能源的40%。"},{"english":"Tradditionally the power generation with waste gas of long dry kiln is considered as one of the energy saving measures.","chinese":"利用幹法窯的窯尾餘熱發電是一項傳統的節能措施。"},{"english":"The heat pipe air preheaters are widely used in the recovery of waste heat of gas.","chinese":"熱管式空氣預熱器廣泛應用於煙氣的餘熱回收。"},{"english":"And it would serve as a subplot in the eventual unraveling and dissolution of the Soviet Union.","chinese":"並且在蘇聯最終解體中也發揮了餘熱。"},{"english":"You body's afterheat, rapid palpitation, not tranquil lips.","chinese":"你身體的餘熱，急促的心跳，不平靜的吻。"},{"english":"Economizer leakage is a main problem in running of heat recovery boiler.","chinese":"省煤器泄漏是餘熱鍋爐運行中常遇到的問題。"}],"related":[{"definition":["inner product\/the dot product of two vectors"],"pinyin":["nei4 ji1"],"word":"內積"},{"definition":["toil\/hard work"],"pinyin":["ku3 lao2"],"word":"苦勞"},{"definition":["lit. to return to office after living as a hermit on Mount Dongshan (idiom); fig. to make a comeback"],"pinyin":["dong1 shan1 zai4 qi3"],"word":"東山再起"},{"definition":["medicinal dietary supplement that helps build up one's health"],"pinyin":["yao4 bu3"],"word":"藥補"},{"definition":["courage\/bravery"],"pinyin":["dan3 po4"],"word":"膽魄"},{"definition":["to no avail\/of no use"],"pinyin":["wu2 ji4 yu2 shi4"],"word":"無濟於事"},{"definition":["to pour oil on the fire (idiom); fig. to aggravate a situation\/to enrage people and make matters worse"],"pinyin":["huo3 shang4 jiao1 you2"],"word":"火上澆油"},{"definition":["lit. doesn't hurt, doesn't tickle (idiom); sth is wrong, but not quite sure what\/fig. not getting to any matter of substance\/scratching the surface\/superficial\/perfunctory"],"pinyin":["bu4 tong4 bu4 yang3"],"word":"不痛不癢"},{"definition":["to hate\/hatred\/to resent\/embittered"],"pinyin":["fen4 hen4"],"word":"憤恨"},{"definition":["to take a tonic or nourishing food to build up one's health"],"pinyin":["bu3 yang3"],"word":"補養"},{"definition":["to sleep peacefully (idiom)\/(fig.) to rest easy\/to be free of worries"],"pinyin":["gao1 zhen3 wu2 you1"],"word":"高枕無憂"},{"definition":["to ask oneself honestly\/to search in one's heart"],"pinyin":["men2 xin1 zi4 wen4"],"word":"捫心自問"},{"definition":["to be reluctant to give up a post"],"pinyin":["lian4 zhan4"],"word":"戀棧"},{"definition":["retort with challenging questions\/debate"],"pinyin":["bian4 nan4"],"word":"便難"},{"definition":["everything"],"pinyin":["jin4 shu4"],"word":"盡數"},{"definition":["to force someone to do something"],"pinyin":["qiang3 ren2 suo3 nan2"],"word":"強人所難"}]}