{"definition":["fraction (of a distillate)\/key (one component part of a distillate)"],"pinyin":["liu2 fen4"],"simplified":["馏分"],"rank":21473.0,"normalized_rank":0.3004351293495446,"fraction":0.000002061933979424792,"cumulative_fraction":0.978107273426302,"word":"餾分","characters":[{"definition":["to distill\/to break a liquid substance up into components by boiling","to steam\/to cook in a steamer\/to reheat cold food by steaming it"],"pinyin":["liu2","liu4"],"word":"餾"},{"definition":["part\/share\/ingredient\/component","to divide\/to separate\/to distribute\/to allocate\/to distinguish (good and bad)\/part or subdivision\/fraction\/one tenth (of certain units)\/unit of length equivalent to 0.33 cm\/minute (unit of time)\/minute (angular measurement unit)\/a point (in sports or games)\/0.01 yuan (unit of money)"],"pinyin":["fen1","fen4"],"word":"分"}],"containing_words":[],"sentences":[{"english":"The effect of feed aromaticity on the reactions of vacuum residue hydrotreating was studied.","chinese":"研究摻入不同芳香性重餾分油對渣油加氫反應的影響。"},{"english":"With the rising of VGO distillate, the content of basic nitrogen gradually increases.","chinese":"隨着蠟油餾分的變重，鹼性氮含量呈遞增的變化趨勢。"},{"english":"Various solvent naphtha fraction generally have to go through refining.","chinese":"各種溶劑油餾分一般都需要經過精製加工。"},{"english":"Deacidification test for lube distillates by a compound solvent was introduced.","chinese":"一種複合脫酸溶劑被用於潤滑油餾分的脫酸實驗。"},{"english":"Gasoline and distillate stocks also fell.","chinese":"汽油和餾分油庫存也出現了下降。"},{"english":"Polysulfides was synthesized using FCC gasoline and sulfur.","chinese":"以單質硫和FCC餾分油爲原料合成有機硫化劑。"},{"english":"A volatile fraction of petroleum consisting chiefly of pentanes and hexanes.","chinese":"主要由戊烷和己烷組成的一種揮發性石油餾分。"},{"english":"This paper systematically introduced separation technology of cracked C5 residue abroad.","chinese":"介紹了國外裂解碳五餾分的分離技術。"},{"english":"Finally, the future development of inhibitors for cracking C5 fractions is prospected.","chinese":"最後展望了裂解碳五餾分阻聚劑今後的研究方向。"},{"english":"Light petroleum distillate, generally known AS naphtha, wAS the logical choice.","chinese":"輕石油餾分，如石腦油是合乎邏輯的選擇。"},{"english":"The naphtha fraction of the pyrolytic oil was objected to GC analysis.","chinese":"之後，對熱解油按不同餾分進行了更細入的分析。"},{"english":"The distillates more than 490 ℃ can be used as asphalt modifier.","chinese":"大於490℃的餾分可作爲瀝青改性劑。"}],"related":[]}