{"definition":["first (hotel of its type, store of its type etc)"],"pinyin":["shou3 jia1"],"simplified":["首家"],"rank":6289.0,"normalized_rank":0.08799126943041427,"fraction":0.000017261416443542888,"cumulative_fraction":0.8851657722872205,"word":"首家","characters":[{"definition":["head\/chief\/first (occasion, thing etc)\/classifier for poems, songs etc"],"pinyin":["shou3"],"word":"首"},{"definition":["home\/family\/(polite) my (sister, uncle etc)\/classifier for families or businesses\/refers to the philosophical schools of pre-Han China\/noun suffix for a specialist in some activity, such as a musician or revolutionary, corresponding to English -ist, -er, -ary or -ian\/CL:個|个[ge4]"],"pinyin":["jia1"],"word":"家"}],"containing_words":[],"sentences":[{"english":"It is the first domestic enterprise manufacturing top-grade fog-proof dressing mirrors cabinet .","chinese":"是國內首家生產高檔防霧化妝鏡櫃企業。"},{"english":"Among them, Kang force lifts are A shares is the first private enterprises lift.","chinese":"其中，康力升降機是A股首家的民營升降機企業。"},{"english":"PUMA is the first sports shoe manufacture to offer Velcro fasteners.","chinese":"PUMA是首家採用粘扣帶的運動鞋生產商。"},{"english":"Xiangtan Humanity Hospital is China's first men's brand hospital.","chinese":"上湘潭博愛醫院是我國首家男科品牌醫院。"},{"english":"Settle of hotel of east of first case forest at Beijing on the west the square austral passenger station.","chinese":"首家格林東方酒店落戶於北京西客運站南廣場。"},{"english":"This is the first Zhangjiajie was listed on the five-star hotel.","chinese":"這是張家界首家獲得掛牌的五星級酒店。"},{"english":"China Southern Airlines will become the first Boeing 787 operators.","chinese":"南航將成爲國內首家波音787運營商。"},{"english":"Baosteel Corporation is the first enterprise to issue environmental report in the iron and steel industry in China.","chinese":"寶鋼股份是我國鋼鐵行業首家發佈環境報告的企業。"},{"english":"Just imagine his joy when he met me – the first \"corozo supplier\" in China at that time !","chinese":"那時我還是內地首家引進果實扣的供應商而已。"},{"english":"Our company is the first Coordinated Process Company to supply and manufacture rinks in China.","chinese":"本公司是國內首家真冰滑冰場供應制作一條龍企業。"},{"english":"It is the first domestic specialized is engaged in the glassware production of large private enterprises.","chinese":"是國內首家專業從事玻璃儀器生產的大型民營企業。"},{"english":"The first sub-branch in Shenyang has recently opened.","chinese":"最近我們在瀋陽的首家支行開業。"},{"english":"Singapore Air is the first airline in the world to receive and operate the A380.","chinese":"新航是全球首家使用A380的航空公司。"},{"english":"The company is China's first development and production of non-friable chimney professional manufacturers.","chinese":"本公司是中國首家開發生產不易碎燈罩的專業廠家。"},{"english":"The country's first biological pharmaceutical professional bank opens in Changsha.","chinese":"全國首家生物醫藥專業銀行長沙掛牌。"},{"english":"He established 1st private law office, Yongsen law Office, in the Province in 1994.","chinese":"1994年創辦廣東首家個體制永森律師事務所。"}],"related":[{"definition":["to open a business\/to open a practice\/open (for business)"],"pinyin":["kai1 ye4"],"word":"開業"},{"definition":["to create\/original creation\/to be the first to do sth"],"pinyin":["shou3 chuang4"],"word":"首創"},{"definition":["first case\/first instance"],"pinyin":["shou3 li4"],"word":"首例"},{"definition":["the whole family\/the same family\/the family ... (when preceded by a family name)\/group"],"pinyin":["yi1 jia1"],"word":"一家"},{"definition":["to prepare to build sth"],"pinyin":["chou2 jian4"],"word":"籌建"},{"definition":["one-stop (service, shop etc)"],"pinyin":["yi1 zhan4 shi4"],"word":"一站式"},{"definition":["to enter and garrison\/(fig.) to establish a presence in"],"pinyin":["jin4 zhu4"],"word":"進駐"},{"definition":["flagship (store)"],"pinyin":["qi2 jian4 dian4"],"word":"旗艦店"},{"definition":["test point\/to carry out trial\/pilot scheme"],"pinyin":["shi4 dian3"],"word":"試點"},{"definition":["to offer (goods or services)\/to open (for business etc)"],"pinyin":["kai1 she4"],"word":"開設"},{"definition":["to establish\/to set up\/to be tenable\/to hold water"],"pinyin":["cheng2 li4"],"word":"成立"},{"definition":["to continue\/to follow after\/to go on with\/to succeed\/to inherit\/then\/afterwards"],"pinyin":["ji4"],"word":"繼"},{"definition":["general headquarters"],"pinyin":["zong3 bu4"],"word":"總部"},{"definition":["to interlock\/to be linked\/chain (store etc)"],"pinyin":["lian2 suo3"],"word":"連鎖"},{"definition":["to blossom everywhere\/to spring up all over the place\/to flourish on a large scale"],"pinyin":["bian4 di4 kai1 hua1"],"word":"遍地開花"},{"definition":["to draw into\/to pull into\/to introduce"],"pinyin":["yin3 ru4"],"word":"引入"}]}