{"definition":["severed head"],"pinyin":["shou3 ji2"],"simplified":["首级"],"rank":41061.0,"normalized_rank":0.574496663075567,"fraction":3.466968637970889e-7,"cumulative_fraction":0.9968766424047768,"word":"首級","characters":[{"definition":["head\/chief\/first (occasion, thing etc)\/classifier for poems, songs etc"],"pinyin":["shou3"],"word":"首"},{"definition":["level\/grade\/rank\/step (of stairs)\/CL:個|个[ge4]\/classifier: step, level"],"pinyin":["ji2"],"word":"級"}],"containing_words":[],"sentences":[{"english":"LiuMeng ordered, within three days LinZhenHai head take necessary.","chinese":"劉猛下令，三天之內必需取下林振海的首級。"},{"english":"On Terephon, Luke beheaded her after a struggle.","chinese":"盧克在泰雷豐與盧米婭交手，斬下了她的首級。"},{"english":"When the messenger arrived, he told Jehu, 'They have brought the heads of the princes.'","chinese":"有使者來告訴耶戶說，他們將王衆子的首級送來了。"},{"english":"He is represented as a headless body holding its decapitated head in its hands.","chinese":"人們把他描繪成手持自己首級的無頭之軀。"},{"english":"And there came a messenger, and told him, saying, They have brought the heads of the king's sons.","chinese":"有使者來告訴耶戶說，他們將王衆子的首級送來了。"},{"english":"And the woman said unto Joab, Behold, his head shall be thrown to thee over the wall.","chinese":"婦人對約押說，那人的首級必從城牆上丟給你。"},{"english":"And he said, Put them in two heaps at the entrance of the gate until the morning.","chinese":"耶戶說，將首級在城門口堆作兩堆，擱到早晨。"},{"english":"Then Jehu ordered, 'Put them in two piles at the entrance of the city gate until morning.'","chinese":"耶戶說，將首級在城門口堆作兩堆，擱到明日。"},{"english":"A minute later the head of John was handed to the frightened Salome .","chinese":"不大會兒，約翰的首級就交給了魂飛魄散的莎樂美。"},{"english":"And they cut off the head of Sheba the son of Bichri, and cast it out to Joab.","chinese":"他們便割下比基利的兒子示巴的首級，丟給約押。"},{"english":"He was driven back to pao an with a price on his head .","chinese":"在懸賞緝拿他的首級的情況下他被迫退到保安去。"},{"english":"The briber described the tribe head's bribery.","chinese":"賄賂者描寫了部降首級的納賄行動。"},{"english":"' Then Jehu ordered, 'Put them in two piles at the entrance of the city gate until morning.","chinese":"耶戶說，將首級在城門口堆作兩堆，擱到明日。"}],"related":[]}