{"definition":["leadership conference\/summit meeting"],"pinyin":["shou3 nao3 hui4 yi4"],"simplified":["首脑会议"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"首腦會議","characters":[{"definition":["head\/chief\/first (occasion, thing etc)\/classifier for poems, songs etc"],"pinyin":["shou3"],"word":"首"},{"definition":["brain\/mind\/head\/essence"],"pinyin":["nao3"],"word":"腦"},{"definition":["can\/to be possible\/to be able to\/will\/to be likely to\/to be sure to\/to assemble\/to meet\/to gather\/to see\/union\/group\/association\/CL:個|个[ge4]\/a moment (Taiwan pr. for this sense is [hui3])","to balance an account\/accountancy\/accounting"],"pinyin":["hui4","kuai4"],"word":"會"},{"definition":["to comment on\/to discuss\/to suggest"],"pinyin":["yi4"],"word":"議"}],"containing_words":[],"sentences":[{"english":"The main topic of the meeting was expected to be the political crisis in Zimbabwe.","chinese":"預計，這次首腦會議的主題是津巴布韋的政治危機。"},{"english":"Chinese Premier Li Peng attended the first Asia-Europe summit.","chinese":"李鵬總理出席了首屆亞歐首腦會議。"},{"english":"Each year, the Commission selects key development themes relating to the World Summit.","chinese":"每年，與世界首腦會議有關係的委託選擇鍵發展主題。"},{"english":"Many problems call for an immediate solution before the five-state summit is held in our city.","chinese":"五國首腦會議在我市召開前有很多問題需要立刻解決。"},{"english":"The two-day Greater Mekong Subregion summit begins Sunday.","chinese":"爲期兩天的大湄公河次區域首腦會議將於星期天開幕。"},{"english":"This is the consensus reached among member states at the UN Millenium Summit.","chinese":"這是各國在千年首腦會議上達成的共識。"},{"english":"But the diplomat said the summit meeting should not be affected.","chinese":"這位外交官同事表示首腦會議將不會受到影響。"},{"english":"We were then raised to the summit of the highest apostolate by the favour of the divine mercy.","chinese":"我們隨後向首腦會議提出的最高牧靈的贊成神恩。"},{"english":"The shallowness of the summit's achievements has been brutally exposed.","chinese":"首腦會議那些微薄的成果，殘忍地暴露出來。"},{"english":"He may personally participate in summit conferences .","chinese":"他親自參加首腦會議。"},{"english":"What the summit has brought out is the multisectoral approach.","chinese":"首腦會議產生的成果就是多部門辦法。"}],"related":[]}