{"definition":["saber\/cavalry sword"],"pinyin":["ma3 dao1"],"simplified":["马刀"],"rank":40000.0,"normalized_rank":0.5596518965203643,"fraction":3.8494300203491506e-7,"cumulative_fraction":0.9964886856946326,"word":"馬刀","characters":[{"definition":["horse\/CL:匹[pi3]\/horse or cavalry piece in Chinese chess\/knight in Western chess","surname Ma\/abbr. for Malaysia 馬來西亞|马来西亚[Ma3 lai2 xi1 ya4]"],"pinyin":["Ma3","ma3"],"word":"馬"},{"definition":["knife\/blade\/single-edged sword\/cutlass\/CL:把[ba3]\/(slang) dollar (loanword)\/classifier for sets of one hundred sheets (of paper)\/classifier for knife cuts or stabs","surname Dao"],"pinyin":["Dao1","dao1"],"word":"刀"}],"containing_words":[],"sentences":[{"english":"He hoped for the best, hoped Saber and the others would be okay.","chinese":"他往好的方面考慮，希望馬刀小隊和其他人都會很好。"},{"english":"Never jerk the horse's mouth while making any of the movements with the saber.","chinese":"當用馬刀進行每一次刺出時，不要猛拉馬的嘴。"},{"english":"At this time, saw a mantis sword play, to seize a dragonfly.","chinese":"這時，只見螳螂一個揮馬刀，把蜻蜓抓住了。"},{"english":"Use this treatment by 9 months later, the cancer got smaller Obviously.","chinese":"伽馬刀治療九個月後隨訪圖片，腫瘤明顯縮小。"},{"english":"Rings or other targets which offer no resistance to the saber should not be used.","chinese":"不應該用對馬刀沒有任何抵抗力的環或其他目標物。"},{"english":"Objective To investigate gamma knife radiosurgery for adrenal gland metastases.","chinese":"目的探討腎上腺轉移瘤的伽馬刀治療效果。"},{"english":"Use this treatment by2 years later, the cancer almost disappeared.","chinese":"伽馬刀治療兩年後，腫瘤消失。"},{"english":"He stripped a tree with his sabre.","chinese":"他用馬刀颳去樹皮。"},{"english":"His face was seamed with sabre cuts.","chinese":"他的臉上留有馬刀砍下的傷痕。"},{"english":"Use this treatment by one month later, the cancer got smaller Obviously.","chinese":"伽馬刀治療後一個月，病竈明顯縮小。"},{"english":"I'm sending Team Saber, Mendez, and you ahead.","chinese":"我要讓馬刀小隊，門德茲和你先進去。"}],"related":[]}