{"definition":["Marlow (name)"],"pinyin":["Ma3 luo4"],"simplified":["马洛"],"rank":57354.0,"normalized_rank":0.8024568718257244,"fraction":6.058071514770185e-8,"cumulative_fraction":0.9996802281255672,"word":"馬洛","characters":[{"definition":["horse\/CL:匹[pi3]\/horse or cavalry piece in Chinese chess\/knight in Western chess","surname Ma\/abbr. for Malaysia 馬來西亞|马来西亚[Ma3 lai2 xi1 ya4]"],"pinyin":["Ma3","ma3"],"word":"馬"},{"definition":["surname Luo\/old name of several rivers (in Henan, Shaanxi, Sichuan and Anhui)","used in transliteration"],"pinyin":["Luo4","luo4"],"word":"洛"}],"containing_words":[{"definition":["St Malo, town in Normandy"],"pinyin":["Sheng4 Ma3 luo4"],"word":"聖馬洛"}],"sentences":[{"english":"Christopher Marlowe is one of the outstanding representatives of English Renaissance dramatists.","chinese":"克里斯托弗馬洛是文藝復興時期英國戲劇的傑出代表。"},{"english":"Real Mallorca striker Dani Guiza admits he fancies a move to Roma.","chinese":"馬洛卡前鋒古伊薩承認他夢想加盟羅馬。"},{"english":"My Chinese name is Lei Chen, u guys can just call me Mallory.","chinese":"我的中文名字叫陳雷，大家也可以叫我馬洛裏。"},{"english":"Mallory dreamed of being the first man to climb Mount Everest.","chinese":"馬洛裏曾夢想成爲第一個登上珠穆朗瑪峯的人。"},{"english":"Having a great time here in Mallorca. Neil.","chinese":"我們在馬洛卡玩得很開心，尼爾。"},{"english":"Multani cannot be the target of spells or abilities. \"To make peace with the forest, make peace with me. ? ─Multani, to UrzaIllus.\"","chinese":"馬洛術士穆塔尼不能成爲咒語或異能的目標。"},{"english":"Malo and Espiritu Santo Is.","chinese":"馬洛和聖埃斯皮裏圖是。"},{"english":"Flamingos standing together are reflected in a pond at the Bird Zoo in Marlow, eastern Germany.","chinese":"紅鶴羣起站立在德國東部馬洛池塘邊，形成倒影。"},{"english":"Malloy always talked hard, but he had a soft , womanish face.","chinese":"馬洛伊說話很嚴厲，但有一張溫厚的女人似的臉。"},{"english":"Or the one-shouldered white cocktail number that she paired this summer in Mallorca with the chunky necklace?","chinese":"或是今夏在馬洛卡單肩白色雞尾酒會裝配短粗項鍊？"},{"english":"Customers wait in a busy shop in a market in Palma, Mallorca.","chinese":"客戶在一間繁忙位於馬洛卡帕爾馬市場的店邊。"},{"english":"My flight was scheduled to stopover in Mallorca and then continue to Hamburg.","chinese":"偶的航班預定是在馬洛卡停一下然後再飛到漢堡。"},{"english":"Even with Marlow, you feel that he never lets you know what's really in his mind.","chinese":"馬洛也一樣，感覺他不會讓你明白他的心。"},{"english":"Marlowe stinks like a smoked fish.","chinese":"馬洛身上散發出一股薰魚似的氣味。"},{"english":"Marlowe was killed by a man whom he was treacherously trying to stab.","chinese":"馬洛背信棄義正想捅死一人，結果被那人所殺。"},{"english":"He was a member of the Footlights and the president of the Marlowe Society.","chinese":"他是一個成員腳燈和主席馬洛社會。"}],"related":[]}