{"definition":["Equidae\/horse family"],"pinyin":["ma3 ke1"],"simplified":["马科"],"rank":50192.0,"normalized_rank":0.7022511997537532,"fraction":1.4086840992176454e-7,"cumulative_fraction":0.9989873445897764,"word":"馬科","characters":[{"definition":["horse\/CL:匹[pi3]\/horse or cavalry piece in Chinese chess\/knight in Western chess","surname Ma\/abbr. for Malaysia 馬來西亞|马来西亚[Ma3 lai2 xi1 ya4]"],"pinyin":["Ma3","ma3"],"word":"馬"},{"definition":["branch of study\/administrative section\/division\/field\/branch\/stage directions\/family (taxonomy)\/rules\/laws\/to mete out (punishment)\/to levy (taxes etc)\/to fine sb\/CL:個|个[ge4]"],"pinyin":["ke1"],"word":"科"}],"containing_words":[{"definition":["Bamako, capital of Mali"],"pinyin":["Ba1 ma3 ke1"],"word":"巴馬科"}],"sentences":[{"english":"It is a place for the toughest people and equines.","chinese":"這是一個最困難的人民和馬科舉行。"},{"english":"And a smaller faction of it, led by ArthurMutambara, has now endorsed Mr Makoni.","chinese":"穆塔姆巴拉領導的小派別已經決定支持馬科尼先生了。"},{"english":"A female horse or the female of other equine species.","chinese":"雌馬或其它馬科動物中的雌性。"},{"english":"In fact, the capital of Mali, Bamako, means \"place of the crocodiles\" in the Bambara language.","chinese":"首都巴馬科在班巴拉語中意指鱷魚之地。"},{"english":"The picture shows the Bamako Convention Building.","chinese":"圖爲馬裏巴馬科會議大廈。"},{"english":"Even in Bamako, the capital city, Mali is thoroughly under-developed.","chinese":"其實在首都巴馬科，馬裏依然顯得欠發達。"},{"english":"To reach the Castillo de San Marcos you must drive through part of the city of Saint Augustine.","chinese":"要去聖馬科斯堡，你必須驅車經過聖奧古斯丁市。"},{"english":"The Castillo de San Marcos grew very slowly. It took twenty-three years to complete.","chinese":"修建聖馬科斯堡進展很慢，它用了23年時間才完成。"},{"english":"A city of central Mali near the Niger River northeast of Bamako.","chinese":"馬裏中部一城市，靠近尼日樂河，位於巴馬科東北部。"},{"english":"A busy street in the middle of Bamako, Mali.","chinese":"圖中是馬面共跟國巴馬科市中心的一條繁閒的街講。"},{"english":"Castillo de San Marcos soon became Fort Saint Mark.","chinese":"聖馬科斯堡很快就變成了聖馬克堡壘。"},{"english":"“My project topic is stress relief, ” DeMarco explains.","chinese":"“我的設計的主題是緩解壓力，”德馬科說。"}],"related":[]}