{"definition":["young horse (colt or filly)"],"pinyin":["ma3 ju1"],"simplified":["马驹"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"馬駒","characters":[{"definition":["horse\/CL:匹[pi3]\/horse or cavalry piece in Chinese chess\/knight in Western chess","surname Ma\/abbr. for Malaysia 馬來西亞|马来西亚[Ma3 lai2 xi1 ya4]"],"pinyin":["Ma3","ma3"],"word":"馬"},{"definition":["colt"],"pinyin":["ju1"],"word":"駒"}],"containing_words":[{"definition":["see 馬駒|马驹[ma3 ju1]"],"pinyin":["ma3 ju1 zi5"],"word":"馬駒子"}],"sentences":[{"english":"The foal balked at the high stone fence.","chinese":"在高高的石圍牆面前小馬駒停步不前。"},{"english":"It has a mane and long horsey nose — must be a horse swing.","chinese":"有鬃毛和長長馬一樣鼻子的那就是小馬駒鞦韆了。"},{"english":"The littlest knight followed on his pony.","chinese":"小小騎士乘着馬駒緊隨其後。"},{"english":"The colts and calves are gambolling round the stockman.","chinese":"小馬駒和小牛犢圍着飼養員歡蹦亂跳。"},{"english":"Midwives must reach the babbling fool status before you foal out.","chinese":"助產士必須滿了你的小馬駒在胡說傻瓜地位。"},{"english":"From the moment a foal is born, it faces demands simply to survive.","chinese":"從小馬駒出生那一刻起，它面臨的需要僅僅是生存。"},{"english":"If so, then no ponies for you.","chinese":"如果是的，你就沒有小馬駒。"},{"english":"So the littlest knight set out on his pony to find the dragon.","chinese":"於是這位最小個子的騎士騎上馬駒出發尋龍。"},{"english":"The little colt seihd at the fence and refused to jump over it.","chinese":"這匹小馬駒到障礙物前會害怕，不敢跳過去。"},{"english":"Then the littlest knight, astride his flying dragon, flew home with his pony galloping beneath.","chinese":"接着小小騎士駕着飛龍返回家鄉，馬駒則在地下飛奔。"},{"english":"A wild pony nuzzles its mother on Assateague Island.","chinese":"在阿薩蒂格島上一匹野馬駒用鼻愛撫着它媽媽。"},{"english":"Calf, Lamb, Piglet and Foal.","chinese":"犢牛，羔羊，仔豬和馬駒。"},{"english":"No mare shall ever produce a foal before it's time.","chinese":"母馬將永遠沒有產生一個小馬駒之前的時間。"},{"english":"You'll have the foal and the hundred silver ducats!","chinese":"你會得到小馬駒和100個達科特銀幣的。"},{"english":"There are several types of orthopedic diseases that can occur in foals and young horses.","chinese":"有幾種類型的骨科疾病常發生於馬駒和年輕馬。"},{"english":"The foals are born with nearly white eyes.","chinese":"馬駒出生與眼睛接近白色。"}],"related":[]}