{"definition":["famous"],"pinyin":["chi2 ming2"],"simplified":["驰名"],"rank":12603.0,"normalized_rank":0.17633232129615378,"fraction":0.000005637218016527235,"cumulative_fraction":0.9474636489736016,"word":"馳名","characters":[{"definition":["to run fast\/to speed\/to gallop\/to disseminate\/to spread"],"pinyin":["chi2"],"word":"馳"},{"definition":["name\/noun (part of speech)\/place (e.g. among winners)\/famous\/classifier for people"],"pinyin":["ming2"],"word":"名"}],"containing_words":[],"sentences":[{"english":"Ahernaria famous, there are 1900 years of history.","chinese":"深州蜜桃馳名中外，有1900多年的歷史。"},{"english":"The British are well known for their gardens.","chinese":"英國的花園世界馳名。"},{"english":"It is a year-round tourist center noted for its scenery and winter sports. Population, 83,790.","chinese":"是一個四季旅遊中心，以其自然風景和冬季運動馳名。"},{"english":"Cezanne is known for his unique still life paintings of apples.","chinese":"賽尚以獨具一格的蘋果靜物畫馳名遐邇。"},{"english":"A good lady and a famous Queen.","chinese":"一位好夫人，一位馳名的女王。"},{"english":"\" Shidao red mine famous and known as \"the first mine of stone.","chinese":"石島紅礦山馳名中外被譽爲“中國石材第一礦”。"},{"english":"The caves by Lijiang River are well-known all over the world.","chinese":"灕江沿岸的巖洞也是世界馳名。"},{"english":"Hangzhou West Lake is famous for its beautiful scenery in the world.","chinese":"杭州西湖以其美景而馳名於世。"},{"english":"Chapter two illustrates several theory bases of protection of well-known trademark .","chinese":"第二章闡釋了馳名商標保護的幾種理論基礎。"},{"english":"The southwestern city of Bordeaux wine has a long history, its wines worldwide.","chinese":"西南部城市波爾多釀酒歷史悠久，其葡萄酒馳名於世。"},{"english":"My aunt is famous for her beauty.","chinese":"我姑姑因貌美而馳名。"},{"english":"This educate is update to its excellent teaching.","chinese":"這所清華教授優秀，遠近馳名。"},{"english":"Since becoming Director-General of the G. I. O. , he has become renowned worldwide for his flawless simultaneous interpretations.","chinese":"就任新聞局局長以來，更以完美的同步翻譯馳名中外。"},{"english":"The anti-dilution of well-known trademark is a key issue of trademark law.","chinese":"馳名商標反淡化保護問題是商標法中的核心問題。"},{"english":"Company's trademark Yangsheng Tang for the Chinese well-known trademarks.","chinese":"公司持有的養生堂商標爲中國馳名商標。"},{"english":"How about I cook up some 'famous hundred-year-old traditional noodles' costing several thousands of dollars?","chinese":"我做個數千元的“百年老記馳名麪條”給你如何？"}],"related":[]}