{"definition":["standing wave"],"pinyin":["zhu4 bo1"],"simplified":["驻波"],"rank":54729.0,"normalized_rank":0.7657297161165755,"fraction":8.408311307247293e-8,"cumulative_fraction":0.9994908104765022,"word":"駐波","characters":[{"definition":["to halt\/to stay\/to be stationed (of troops, diplomats etc)"],"pinyin":["zhu4"],"word":"駐"},{"definition":["Poland\/Polish\/abbr. for 波蘭|波兰[Bo1 lan2]","wave\/ripple\/storm\/surge"],"pinyin":["Bo1","bo1"],"word":"波"}],"containing_words":[],"sentences":[{"english":"The method can be used for measuring the voltage standing-wave ratio and tuning match of the microwave signal source quickly.","chinese":"還可快速測量微波源的駐波比和實現對它的匹配。"},{"english":"Indoing sos the standing wave nature of the solution is emphasized.","chinese":"簡正波具有駐波性質，基本已反映在一階近似解中。"},{"english":"Application: Suitable for railway, VSWR at good performance, RFID system, closed processing, anti-water ability.","chinese":"駐波比性能好，封閉式處理，防水防腐能力強。"},{"english":"The SWR wattmeter application in short-wave communication system is considered.","chinese":"闡述了駐波功率表在短波通信中的應用。"},{"english":"A scalar wave tends to propagate as a transverse wave or a standing wave.","chinese":"分級梯狀波往往是以橫波或駐波傳播。"},{"english":"This paper discusses the method of suppressing the interference of stationary wave.","chinese":"這裏討論了壓制這種駐波干擾的方法。"},{"english":"Besides, the essay discloses the process of energy transformation between any wave band and the wave belly next to it.","chinese":"並討論了駐波在相鄰波節與波腹之間能量的轉化過程。"},{"english":"When the heating power of traveling-wave stage increased, the onset temperature decreased at first and then increased.","chinese":"隨着駐波級加熱功率的增加，起振溫度趨於降低。"},{"english":"In this paper the model of two level atomic momentum spread in amplitude modulated standing light wave was investigated.","chinese":"分析了二能級原子在振幅調製駐波場中動量擴散模型。"},{"english":"For example, peaks in the measured receive signal correspond to frequencies that create standing waves.","chinese":"例如，接收信號的最高峯對應的是產生駐波的頻段。"},{"english":"This \"channeling\" phenomenon is advantageous for atomic deposition in laser SW.","chinese":"這種現象有利於提高原子在駐波場中聚焦沉積的效果。"},{"english":"It was calculated that standing wave was formed because of the reflection of microwave on the stainless steel wall of the oven.","chinese":"計算結果表明微波在爐腔內金屬壁上全反射形成駐波。"},{"english":"The reflectionless potential well affected by a standing laser field is studied.","chinese":"研究弱激光駐波場中的無反射勢阱。"},{"english":"There are just standing waves in these waters.","chinese":"在這些洪水中只有駐波。"},{"english":"Methods Use a standing wave tube to measure the sound absorption coefficient of many kinds of grain.","chinese":"採用駐波管法測量了多種糧食的吸聲係數。"},{"english":"Low IMD and low VSWR provides improved system performance .","chinese":"低的互調幹擾和低的電壓駐波比保證了系統的性能。"}],"related":[]}