{"definition":["stationed in China\/located in China"],"pinyin":["zhu4 hua2"],"simplified":["驻华"],"rank":8649.0,"normalized_rank":0.12101073132511578,"fraction":0.000010538708793670329,"cumulative_fraction":0.9170753034797884,"word":"駐華","characters":[{"definition":["to halt\/to stay\/to be stationed (of troops, diplomats etc)"],"pinyin":["zhu4"],"word":"駐"},{"definition":["Mt Hua 華山|华山 in Shaanxi\/surname Hua","abbr. for China","magnificent\/splendid\/flowery","old variant of 花[hua1]\/flower"],"pinyin":["Hua2","Hua4","hua1","hua2"],"word":"華"}],"containing_words":[],"sentences":[{"english":"The security guard of the apartment did not enter the Visa Office of the South Korean Embassy.","chinese":"公寓保安人員沒有進入韓國駐華使館領事部。"},{"english":"Jean-Marie Lehn, French ambassador to China and winner of Nobel Prize for Chemistry delivered a speech.","chinese":"法國駐華大使和諾貝爾化學獎得主廉恩博士發表演講。"},{"english":"Mr. Zhang Shigang is holding the position of UNEP Country Coordinator in China.","chinese":"張世鋼先生現任聯合國環境規劃署駐華代表。"},{"english":"Two of this season's shows are sponsored by the US Embassy.","chinese":"該演出季的兩場演出得到了美國駐華使館的贊助。"},{"english":"This American barista didn't give the Ambassador to China an ounce of face.","chinese":"美國店小二竟不給駐華大使一點面子。"},{"english":"Present at the briefing were over 60 journalists from home and abroad and information officials from foreign embassies in China.","chinese":"60餘名中外記者和部分駐華使館新聞官出席。"},{"english":"Mr. Ji Jae Ryong, the new DPRK Ambassador to China arrived in Beijing today.","chinese":"新任朝鮮駐華大使池在龍先生已於今天抵達北京。"},{"english":"Please click here for a map of the Cana'dian Em'bassy area.","chinese":"加拿大駐華大使館位置圖，請在此點擊。"},{"english":"Be transferred from the Ministry of Commerce Ambassador demoted?","chinese":"調離商務部駐華大使算是降職？"},{"english":"The foreign office of Jilin Province has already informed relevant embassies in China.","chinese":"吉林省外辦已將上述情況通報了有關國家駐華使館。"},{"english":"Locke is the first Chinese-American to serve as ambassador to China.","chinese":"駱家輝是第一位擔任駐華大使的美籍華人。"},{"english":"Fifth, to further carry out the work on the team of wives of African diplomatic envoys to China.","chinese":"五是進一步開展非洲駐華使節夫人小組工作。"},{"english":"Our FCS China office supports these trade and tourism missions.","chinese":"美國駐華使領館商務處爲這些訪團提供支持。"},{"english":"Kamyshev Serhii, Ambassador Extraordinary and Plenipotentiary of Embassy of Ukraine gave a splendid speech in this forum.","chinese":"烏克蘭駐華大使閣下在此次論壇上致辭。"},{"english":"He works at the French Legation in China.","chinese":"他在法國駐華大使館工作。"},{"english":"S Korea appoints new ambassador to China.","chinese":"韓國任命新駐華大使。"}],"related":[]}