{"definition":["to leave port\/to put off"],"pinyin":["shi3 chu1"],"simplified":["驶出"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"駛出","characters":[{"definition":["to gallop\/speedily\/to proceed to\/to pilot (ship, plane etc)\/to sail"],"pinyin":["shi3"],"word":"駛"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"Just before pulling out of the parking spot, check your mirrors and your blind spot.","chinese":"駛出停車區前，查看你的後視鏡及盲點。"},{"english":"The milk cart squeaked out of the village.","chinese":"運奶車吱吱地響着慢慢駛出了村子。"},{"english":"A car whined in protest, but skidded staunchly out of its driveway.","chinese":"有輛小汽車嗚隆隆響着，好不容易蹣跚駛出馬路。"},{"english":"The train went on up the track out of sight, around one of the hills of burnt timber.","chinese":"火車沿着鐵軌，盤山而上，駛出視線之外。"},{"english":"Small motorboats chug out of the harbor.","chinese":"小摩托艇軋軋地駛出海港。"},{"english":"For a while, field command on the three cars out of the camp.","chinese":"一會，上田指揮着三輛車駛出大本營。"},{"english":"The train slithered slowly out of the station.","chinese":"火車慢慢駛出了車站。"},{"english":"We drove out of the street where we'd lived for nine years without looking back.","chinese":"我們駛出了居住了九年的街道，沒有向回看。"},{"english":"The train puffed out of the station.","chinese":"火車吐着煙駛出了車站。"},{"english":"I drove out of Newtown and went to begin my search for the mysterious man on the moor.","chinese":"我駛出了紐頓，去開始搜尋沼地上的那位神祕人士。"},{"english":"From the moment we headout of the harbour I feel a growing lightness.","chinese":"從我們駛出海港那一刻起，我感到越來越輕盈。"},{"english":"From the East 4th Ring Road, take the Chaoyang Park Bridge exit.","chinese":"在東四環路在朝陽公園橋出口駛出。"},{"english":"The train starts out of the station with the whistle.","chinese":"火車拉着鼻兒駛出車站。"},{"english":"It was still dark when the ship began to move.","chinese":"當輪船駛出海港時，天還未亮，到處都是漆黑一片。"},{"english":"The train hissed off the station.","chinese":"列車嘶嘶作響駛出了車站。"},{"english":"The train whooped out through the suburbs.","chinese":"火車隆隆地駛出郊區。"}],"related":[]}