{"definition":["bound for"],"pinyin":["shi3 wang3"],"simplified":["驶往"],"rank":20913.0,"normalized_rank":0.2926000027982595,"fraction":0.0000021725850205861363,"cumulative_fraction":0.9769221349395536,"word":"駛往","characters":[{"definition":["to gallop\/speedily\/to proceed to\/to pilot (ship, plane etc)\/to sail"],"pinyin":["shi3"],"word":"駛"},{"definition":["to go (in a direction)\/to\/towards\/(of a train) bound for\/past\/previous"],"pinyin":["wang3"],"word":"往"}],"containing_words":[],"sentences":[{"english":"The bus was traveling from Monterrey, Mexico to Houston.","chinese":"這輛巴士但是正從墨西哥蒙特雷市駛往美國休斯頓。"},{"english":"This train goes to London and all stations beyond.","chinese":"這列火車駛往倫敦及以遠的各站。"},{"english":"This ship will bear up to Havana.","chinese":"這艘船將駛往哈瓦那。"},{"english":"We sailed out of the harbour toward the Pacific.","chinese":"我們離港駛往太平洋。"},{"english":"The carriage drove off towards London, where Jane was to join the party for home.","chinese":"馬車駛往倫敦，簡要在那兒搭伴和他們一起回家。"},{"english":"A wagon loaded with asters heads for the local market.","chinese":"一輛滿載着紫菀花的馬車駛往當地的市場。"},{"english":"We have not yet decided but it is heading towards this area.","chinese":"我們仍未作出決定，但這艘船正駛往該區域。"},{"english":"The vessel is sailing from Hongkong to Shanghai.","chinese":"這船從香港開航駛往上海。"},{"english":"There is no available direct steamer for your port this month.","chinese":"本月沒有駛往貴港的直達輪船。"},{"english":"The current Orient Express runs from Paris to Vienna.","chinese":"現在的“東方列車”從巴黎駛往維也納。"},{"english":"The vessel is fully loaded with cargo for Shanghai.","chinese":"這艘船滿載貨物駛往上海。"},{"english":"He went on board and the ship sailed for Leghorn .","chinese":"他上了船後，船便駛往勒格翁去了。"},{"english":"Afterwards , we sailed into North Inlet and I forgot to watch Hands carefully .","chinese":"然後，我們把船駛往北部水灣，我也忘了注意漢茲。"},{"english":"After leaving Calais, the ship made for Dover.","chinese":"離開加來後，那艘船便駛往多佛。"},{"english":"The powerboat picked us up and headed to higher ground.","chinese":"汽艇帶上我們往高地方向駛往。"},{"english":"They are on their way to Trieste, Italy, right now, \" said Marina Haluzan, a spokeswoman for the Croatian ministry.\"","chinese":"他們正在駛往意大利裏雅斯德港的途中。"}],"related":[]}