{"definition":["(of a car, ship, train etc) to enter"],"pinyin":["shi3 ru4"],"simplified":["驶入"],"rank":13721.0,"normalized_rank":0.191974591803898,"fraction":0.0000048498146972339725,"cumulative_fraction":0.9533126272448728,"word":"駛入","characters":[{"definition":["to gallop\/speedily\/to proceed to\/to pilot (ship, plane etc)\/to sail"],"pinyin":["shi3"],"word":"駛"},{"definition":["to enter\/to go into\/to join\/to become a member of\/to confirm or agree with\/abbr. for 入聲|入声[ru4 sheng1]"],"pinyin":["ru4"],"word":"入"}],"containing_words":[{"definition":["Do not enter! (road sign)"],"pinyin":["jin4 zhi3 shi3 ru4"],"word":"禁止駛入"}],"sentences":[{"english":"The Australian government has indicated that a prosecution will follow because the ship ran aground in a no-go zone.","chinese":"澳大利亞政府提出起訴因爲船隻駛入了禁止區域。"},{"english":"The car has slowly, hard into the track.","chinese":"車子又緩緩的，艱難的駛入了正軌。"},{"english":"It turns out that the driver is a fugitive, who hijacks the family's car.","chinese":"兇徒劫持了這家人，驅車駛入深山之中。"},{"english":"He has a stern face and he simply nods before shooting off into the gathering darkness.","chinese":"他一臉嚴肅地點點頭，開車駛入越來越濃的夜色中。"},{"english":"I drove into Rome on a tank when the city was liberated.","chinese":"當時我開着一輛坦克駛入剛剛被解放的羅馬城。"},{"english":"Mukherjee has now seen many patients voyage into the night.","chinese":"現在，穆克吉看見許多癌症病人的航程駛入了黑夜。"},{"english":"The beach defences were softened up before the landing craft was in.","chinese":"在登陸艇駛入以前，海灘防禦工事已遭削弱。"},{"english":"There can be no pause until you come into port.","chinese":"在你駛入碼頭之前，你不可能停留。"},{"english":"The robber ditched the cops by driving down an alley.","chinese":"那竊賊把車駛入小巷躲開了警察。"},{"english":"Kashmiri fisherman rows his boat through autumn leaves in Kashmir's Dal Lake in Srinagar.","chinese":"一位克什米爾漁民撐船駛入秋天的斯里那加戴爾湖。"},{"english":"The purpose of the visit was to navigate into an ice-filled fiord.","chinese":"這次出行是爲了能駛入冰雪覆蓋的峽灣。"},{"english":"Finally, we destinated to climb the mountain.","chinese":"最後，我們駛入攀登高山。"},{"english":"Drive past this sign or drive on the road to which the ban applies.","chinese":"學習駕駛者不可駛越此標誌，或駛入禁止學車的道路。"},{"english":"He steamed the ship slowly into port.","chinese":"他把船緩慢地駛入港口。"},{"english":"Please drive along the cement road, do not into the grassland…","chinese":"球車請沿水泥路行駛，請勿駛入草地。"},{"english":"A mrt train was entering the station Fu-Hsing Kang.","chinese":"駛入復興崗站的捷運列車。"}],"related":[]}