{"definition":["to steer (the plane) away from\/to drive away (from a place)\/to leave"],"pinyin":["shi3 li2"],"simplified":["驶离"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"駛離","characters":[{"definition":["to gallop\/speedily\/to proceed to\/to pilot (ship, plane etc)\/to sail"],"pinyin":["shi3"],"word":"駛"},{"definition":["surname Li","to leave\/to part from\/to be away from\/(in giving distances) from\/without (sth)\/independent of\/one of the Eight Trigrams 八卦[ba1 gua4], symbolizing fire\/☲"],"pinyin":["Li2","li2"],"word":"離"}],"containing_words":[],"sentences":[{"english":"I let the plane down gently, pulled off the runway, and taxied back to parking.","chinese":"我穩穩地降落了飛機，駛離跑道，滑行回了停機場。"},{"english":"The ship is standing off to sea.","chinese":"船在駛離海岸，開向大海。"},{"english":"About eight of these massive ships leave every day.","chinese":"每天大約有八艘這樣的巨輪駛離港口。"},{"english":"The south side of old Hsi-Kou Station. 1968.","chinese":"南下列車駛離昔日的舊溪口站南端。"},{"english":"We pushed off frow the shore and were soon out to sea.","chinese":"我們乘船駛離岸邊，不久就到了海上。"},{"english":"He sped his car off the accidental site.","chinese":"他加快車速駛離了出事地點。"},{"english":"He drove away rapidly.","chinese":"他快速駕車駛離。"},{"english":"If you're in a car, move away from bridges or elevated highways that can collapse.","chinese":"如果你在車內，駛離可能發生坍塌的橋樑和高速公路。"},{"english":"They got to the station too late; the coach was pulling out.","chinese":"他們晚了一步到達車站，客車正好駛離。"},{"english":"The train surged off the small station.","chinese":"列車轟隆隆地駛離了小站。"},{"english":"When he caromed off the wall, he was going 86 miles an hour.","chinese":"當他駛離水泥牆，車速依然達每小時86英里。"},{"english":"The ship hauled off the island to the big ship.","chinese":"那艘船駛離了小島向大船靠去。"},{"english":"Her train huffed out of the town.","chinese":"她乘坐的火車噴着氣駛離了城鎮。"},{"english":"On June 6, the ship completed the departure formalities and from the port of Cape Town.","chinese":"6月6日，該船辦妥相關離港手續並駛離開普敦港。"},{"english":"Then I heard the train stutter out of the staiton.","chinese":"後來，我聽到火車突突地駛離了車站。"},{"english":"The truck left the loading dock with hoses still attached.","chinese":"卡車駛離裝貨月臺時塑料水龍帶還連在上面。"}],"related":[]}