{"definition":["device driver (computing software)"],"pinyin":["qu1 dong4 cheng2 xu4"],"simplified":["驱动程序"],"rank":23715.0,"normalized_rank":0.331803618149511,"fraction":0.0000016657507001215082,"cumulative_fraction":0.9822703471803096,"word":"驅動程序","characters":[{"definition":["to expel\/to urge on\/to drive\/to run quickly"],"pinyin":["qu1"],"word":"驅"},{"definition":["(of sth) to move\/to set in movement\/to displace\/to touch\/to make use of\/to stir (emotions)\/to alter\/abbr. for 動詞|动词[dong4 ci2], verb"],"pinyin":["dong4"],"word":"動"},{"definition":["rule\/order\/regulations\/formula\/journey\/procedure\/sequence","surname Cheng"],"pinyin":["Cheng2","cheng2"],"word":"程"},{"definition":["order\/sequence\/preface"],"pinyin":["xu4"],"word":"序"}],"containing_words":[],"sentences":[{"english":"Check the initialization status of the driver.","chinese":"檢查驅動程序的初始狀態。"},{"english":"This isolation level is defined when the driver and its libraries are loaded.","chinese":"這個隔離級別是在驅動程序及其庫載入的時候定義的。"},{"english":"The device driver got stuck in an infinite loop. This usually indicates.","chinese":"設備驅動程序已經陷入無限死循環中這通常表示。"},{"english":"It should be quite obvious by now when you would use this driver.","chinese":"現在，您應該非常清楚何時適合使用這個驅動程序。"},{"english":"This device driver should perform some diagnostics of the device itself.","chinese":"這個設備驅動程序需要對設備本身執行一些診斷操作。"},{"english":"This method can also be used to design event-driven programs based on DOS.","chinese":"同時也可應用於DOS下消息驅動程序的設計。"},{"english":"Drivers can use the default workqueue provided by the kernel.","chinese":"驅動程序可以使用內核提供的缺省工作隊列。"},{"english":"WHQL signing of the NDIS Driver – NDIS driver has been certified with Microsoft Certification.","chinese":"NDIS驅動程序獲得了微軟的數字簽名。"},{"english":"Printer driver management routines.","chinese":"打印機驅動程序管理例程。"},{"english":"Your moni tor tells you what to do to get the driver you want to add.","chinese":"監視器會告訴爲得到你要增加的驅動程序你該做什麼。"},{"english":"The Count is the gent in the Homburg, on the right of the driver.","chinese":"計數是根特，在洪堡，在右邊的驅動程序。"},{"english":"Serially interfaced, 8-digit LED display driver.","chinese":"串行接口，8位LED顯示驅動程序。"},{"english":"Alge-Timing Timy USB Driver helps ensure the correct functionality of Timy devices.","chinese":"USB驅動程序有助於確保微小器件的正確功能。"},{"english":"Color match file corrupt; re-install driver.","chinese":"顏色調配文件損壞，請重新安裝驅動程序。"},{"english":"BSP and driver design of the interconnecting gateway are the emphases of the dissertation.","chinese":"互聯網關的BSP和驅動程序設計是本論文的重點。"},{"english":"The motion driven program is the key part to guarantee pointing accurate.","chinese":"該系統的運動驅動程序是保證點樣精度的關鍵部分。"}],"related":[]}