{"definition":["to verify a calculation\/a double-check"],"pinyin":["yan4 suan4"],"simplified":["验算"],"rank":55796.0,"normalized_rank":0.7806584304562562,"fraction":7.415663444586154e-8,"cumulative_fraction":0.9995752598474454,"word":"驗算","characters":[{"definition":["to examine\/to test\/to check"],"pinyin":["yan4"],"word":"驗"},{"definition":["to regard as\/to figure\/to calculate\/to compute"],"pinyin":["suan4"],"word":"算"}],"containing_words":[],"sentences":[{"english":"He still stuck on the answer although he had checked several times.","chinese":"儘管經過數次驗算，他還是對該答案不敢相信。"},{"english":"The strength of bucket belts is calculated and checked.","chinese":"對畚斗帶強度進行了驗算和校覈。"},{"english":"Analysing and calculating the strength of generator frame and rotor with finite element method.","chinese":"利用有限元方法分析驗算了機座和轉子的強度。"},{"english":"Coiler cost estimate is performed through self-learning method.","chinese":"以開卷機爲例對自學習式成本估算法進行驗算。"},{"english":"And it's also researched that the method of design and checking calculation.","chinese":"並研究了體外預應力加固結構的設計和驗算方法。"},{"english":"The deflection and the crack width of the SRC transfer girder are calculated.","chinese":"驗算鋼骨混凝土轉換梁的撓度和裂縫寬度。"},{"english":"Their reliability and practicality are tested and verified by an engineering example.","chinese":"經對工程實例驗算，驗證了本研究的可靠性和實用性。"},{"english":"Checking the stree of the structure.","chinese":"並驗算了結構的成橋應力。"},{"english":"The calculated results are shown to agree with experimental data of push-out tests.","chinese":"驗算結果表明，本文公式與試驗結果符合良好。"},{"english":"The paper presents how to check starting time and motors power.","chinese":"本文給出了啓動時間和電機功率的驗算方法。"},{"english":"Second, checking computations of many dashes of steel supporting and the optimization of steel supporting waist beam.","chinese":"基坑開挖時多道鋼支撐的驗算及鋼支撐的優化。"},{"english":"Let's just check this.","chinese":"讓我們來驗算一下。"}],"related":[]}