{"definition":["to start in surprise\/to give a jolt of surprise"],"pinyin":["jing1 qi3"],"simplified":["惊起"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"驚起","characters":[{"definition":["to startle\/to be frightened\/to be scared\/alarm"],"pinyin":["jing1"],"word":"驚"},{"definition":["to rise\/to raise\/to get up\/to set out\/to start\/to appear\/to launch\/to initiate (action)\/to draft\/to establish\/to get (from a depot or counter)\/verb suffix, to start\/starting from (a time, place, price etc)\/classifier for occurrences or unpredictable events: case, instance\/classifier for groups: batch, group"],"pinyin":["qi3"],"word":"起"}],"containing_words":[],"sentences":[{"english":"We frightened two birds when we were walking in the woods.","chinese":"我們在樹林裏散步時驚起了兩隻鳥。"},{"english":"The dog flushed a quail.","chinese":"那隻狗於鵪鶉驚起。"},{"english":"Start tup but look back, have no hate.","chinese":"驚起卻回頭，有恨無人省。"},{"english":"The dog flushed a pheasant from the bushes.","chinese":"那隻狗於雉從灌木叢中驚起。"},{"english":"The hunters beat the brush for game.","chinese":"獵人拍打樹叢以驚起獵物。"},{"english":"I am started at the loud noise.","chinese":"我被那響亮的吵鬧聲驚起。"},{"english":"In the morning, when the birds are roused by the stir of milking the cows, I will waken you.","chinese":"明日清晨，鳥雀被擠奶姑娘驚起時我會將你喚醒。"},{"english":"A duck flies off in alarm as an osprey swoops in to catch its lunch.","chinese":"魚鷹猛撲到池塘抓魚作午餐的時候驚起了一隻鴨子。"},{"english":"When we are walking in the toest , few birds are disturbed.","chinese":"咱們在樹林裏散步時驚起了兩隻鳥。"},{"english":"Two birds were roused when we had a walk in the woods.","chinese":"我們在樹林裏散步時驚起了兩隻鳥。"},{"english":"The noise jumped me out of my chair.","chinese":"這噪聲把我從椅子上驚起。"},{"english":"I started up from my day-dreams and poured water from my jar on thy joined palms.","chinese":"我從幻夢中驚起把我罐裏的水倒在你掬着的手掌裏。"},{"english":"That startles several bumblebees.","chinese":"將幾隻大黃蜂驀地驚起。"},{"english":"I scream at them, and they don't flinch.","chinese":"我向他們尖聲喊叫，但他們並沒驚起。"},{"english":"Thee dog roused a deer from the bushes.","chinese":"狗驚起了叢林中的一隻鹿。"},{"english":"The hunting dog put up some partridges.","chinese":"獵狗驚起了幾隻鷓鴣。"}],"related":[]}