{"definition":["physical examination\/clinical examination\/health checkup"],"pinyin":["ti3 ge2 jian3 cha2"],"simplified":["体格检查"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"體格檢查","characters":[{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"},{"definition":["square\/frame\/rule\/(legal) case\/style\/character\/standard\/pattern\/(grammar) case\/(classical) to obstruct\/to hinder\/(classical) to arrive\/to come\/(classical) to investigate\/to study exhaustively"],"pinyin":["ge2"],"word":"格"},{"definition":["to check\/to examine\/to inspect\/to exercise restraint"],"pinyin":["jian3"],"word":"檢"},{"definition":["see 山查[shan1 zha1]","surname Zha","to research\/to check\/to investigate\/to examine\/to refer to\/to look up (e.g. a word in a dictionary)"],"pinyin":["Zha1","cha2","zha1"],"word":"查"}],"containing_words":[],"sentences":[{"english":"I consent to take any pre-employment physical examination required by the Company.","chinese":"本人願意接受公司要求的職前體格檢查。"},{"english":"On physical examination he was afebrile with no sign of meningism.","chinese":"經體格檢查無發熱及假性腦膜炎跡象。"},{"english":"Physical examination revealed tachypnea; tachycardia, and cyanosis.","chinese":"體格檢查發現呼吸急促，心動過速及發紺。"},{"english":"It cannot easily be palpated on physical examination.","chinese":"通過體格檢查很難被觸診。"},{"english":"She has to have a medical before going abroad.","chinese":"出國前她必須進行體格檢查。"},{"english":"Her physical examination was remarkable for bilateral crackles in the lung bases.","chinese":"體格檢查在雙肺底部可聞明顯的雜音。"},{"english":"I have to have a medical examination before going abroad.","chinese":"出國前我必須進行體格檢查。"},{"english":"Hand-Carried Ultrasound Performed by Hospitalists: Does It Improve the Cardiac Physical Examination?","chinese":"醫務工作者進行的便攜式超聲能否改善心臟體格檢查？"},{"english":"Physical. examination and some tests of child's motion and physiology.","chinese":"體格檢查和運動生理測查。"},{"english":"Immediately before the physical examination, the patient should void as normally and completely as possible.","chinese":"在體格檢查前患者應該放鬆和排空膀胱。"},{"english":"Patients were evaluated on the basis of a physical examination and a review of medical records.","chinese":"病人在體格檢查和醫療文件回顧的基礎上被評估。"},{"english":"A presumptive diagnosis of pancreatitis can be made based on a history and physical examination.","chinese":"胰腺炎可以根據病史和體格檢查作出初步診斷。"},{"english":"We shall have to pat more doctors on the physical examination of new students.","chinese":"我們有必要加派醫生爲新生進行體格檢查。"},{"english":"How about the physical examination, Dr. Shi?","chinese":"體格檢查怎麼樣呢？"},{"english":"Crepitus and air bubbles at Stensen's duct with palpation may be observed at physical examination.","chinese":"體格檢查時可以觸及捻發音和腮腺導管內氣泡。"},{"english":"We shall have to put on more doctors and nurses for the physical examination of new students.","chinese":"我們有必要加派醫生和護士爲新生進行體格檢查。"}],"related":[]}