{"definition":["genre\/style\/form of writing"],"pinyin":["ti3 cai2"],"simplified":["体裁"],"rank":27777.0,"normalized_rank":0.38863626824115394,"fraction":0.0000011501577220451636,"cumulative_fraction":0.9879268037342608,"word":"體裁","characters":[{"definition":["body\/form\/style\/system\/substance\/to experience\/aspect (linguistics)"],"pinyin":["ti3"],"word":"體"},{"definition":["to cut out (as a dress)\/to cut\/to trim\/to reduce\/to diminish\/to cut back (e.g. on staff)\/decision\/judgment"],"pinyin":["cai2"],"word":"裁"}],"containing_words":[{"definition":["lit. measure the body then tailor the suit (idiom); fig. to act according to actual circumstances\/To live within one's means."],"pinyin":["liang2 ti3 cai2 yi1"],"word":"量體裁衣"},{"definition":["lit. tailor the clothes to fit the body (idiom); fig. act according to real circumstances"],"pinyin":["xiang4 ti3 cai2 yi1"],"word":"相體裁衣"},{"definition":["eat depending on the dish, cut cloth according to the body (idiom); to fit the appetite to the dishes and the dress to the figure\/to act according to actual circumstances\/to live within one's means"],"pinyin":["kan1 cai4 chi1 fan4 , liang2 ti3 cai2 yi1"],"word":"看菜吃飯，量體裁衣"}],"sentences":[{"english":"Why to examine the difference between literary language to the difference from the genre?","chinese":"爲什麼從體裁差別的角度去探討文學語言的區別。"},{"english":"The second chapter analyzed the external factors of music's genres changes.","chinese":"第三章因情立體，洞察音樂體裁流變的中介因素。"},{"english":"Tailor each letter to the open position, identifying your accomplishments and achievements.","chinese":"對每一個崗位量體裁衣，寫明你的成績和成就。"},{"english":"There are many types or genres of material in the Bible.","chinese":"聖經裏有各種不同的寫作風格和體裁。"},{"english":"I’ve written a novel and a non-fiction book. I write this blog.","chinese":"我已經寫了一部小說並出了一部散文體裁的書。"},{"english":"The pluralizing of minoritarian literature and its poetics is one of the most important features in American postmodernism.","chinese":"後現代派小說是二十世紀美國文學的主要體裁。"},{"english":"Not exactly right, it is a genre of poetry.","chinese":"不完全對，其實它是一種詩的體裁。"},{"english":"As a poetic form in Chinese poetry, the trisyllabic verse has been ignored in the academic circle over a long period.","chinese":"在中國詩歌體裁中，三言是一種極少受到關注的類型。"},{"english":"Independently design and tailor for different customers based on individual needs.","chinese":"依據個性化需求爲不同的客戶獨立設計量體裁衣。"},{"english":"The seven-character quatrain is one of the most representative forms of the Tang poetry.","chinese":"七言絕句是唐代詩歌中最具代表性的體裁之一。"},{"english":"It is significant that all Carters works are tinged with the Gothic.","chinese":"卡特在創作生涯中貫穿使用了哥特體裁。"},{"english":"The order of the day in that genre is \"short and sweet\".","chinese":"的命令，在這一天體裁是“短期和甜”。"},{"english":"Much of the previous research has mainly dealt with expository writing.","chinese":"以前的對比修辭研究主要集中在說明文體裁上。"},{"english":"Time is a dressmaker, specializing in altreations.","chinese":"時間是一個裁縫，擅長於量體裁衣。"},{"english":"Filmmaking is all about genres and having a strong antagonist.","chinese":"電影製作是有體裁的，都有強烈的反派角色。"},{"english":"Palindrome poem is a unique literature type of the ancient poems of our country.","chinese":"迴文詩是我國古典詩歌中一種較爲獨特的體裁。"}],"related":[{"definition":["regular verse\/strict poetic form with eight lines of 5, 6 or 7 syllables and even lines rhyming"],"pinyin":["lu:4 shi1"],"word":"律詩"},{"definition":["an excerpt\/a digest"],"pinyin":["xuan3 lu4"],"word":"選錄"},{"definition":["a pre-Tang Dynasty genre of poetry, relatively free in form, usually having four, five, six or seven characters per line"],"pinyin":["gu3 ti3 shi1"],"word":"古體詩"},{"definition":["names of the tunes to which 詞|词[ci2] poems are composed"],"pinyin":["ci2 pai2"],"word":"詞牌"},{"definition":["words and sentences"],"pinyin":["ci2 ju4"],"word":"詞句"},{"definition":["a genre of poetry, developed in the Tang Dynasty, characterized by its strict form"],"pinyin":["jin4 ti3 shi1"],"word":"近體詩"},{"definition":["style (of literature)\/form"],"pinyin":["ti3 li4"],"word":"體例"},{"definition":["antithesis (two lines of poetry matching in sense and sound)\/to fight\/to wage war"],"pinyin":["dui4 zhang4"],"word":"對仗"},{"definition":["quatrain (poetic form)"],"pinyin":["jue2 ju4"],"word":"絕句"},{"definition":["paradigm"],"pinyin":["fan4 shi4"],"word":"範式"},{"definition":["to elucidate\/to expound\/to study and explain"],"pinyin":["chan3 fa1"],"word":"闡發"},{"definition":["writing style in which the main subject is approached directly from the outset\/opposite of 冒題|冒题[mao4 ti2]"],"pinyin":["po4 ti2"],"word":"破題"},{"definition":["poetry in the old style"],"pinyin":["jiu4 ti3 shi1"],"word":"舊體詩"},{"definition":["old verse\/poetry in the old style"],"pinyin":["jiu4 shi1"],"word":"舊詩"},{"definition":["Tang poetry\/a Tang poem"],"pinyin":["Tang2 shi1"],"word":"唐詩"},{"definition":["rhetoric"],"pinyin":["xiu1 ci2"],"word":"修辭"}]}