{"definition":["high position\/eminent status\/top job\/raised position\/upper (limbs)\/a high (i.e. local maximum)\/high point on scale, high grade, temperature, latitude etc"],"pinyin":["gao1 wei4"],"simplified":["高位"],"rank":3978.0,"normalized_rank":0.05565738110895023,"fraction":0.00003346639280148598,"cumulative_fraction":0.8299147475929982,"word":"高位","characters":[{"definition":["high\/tall\/above average\/loud\/your (honorific)","surname Gao"],"pinyin":["Gao1","gao1"],"word":"高"},{"definition":["position\/location\/place\/seat\/classifier for people (honorific)\/classifier for binary bits (e.g. 十六位 16-bit or 2 bytes)\/(physics) potential"],"pinyin":["wei4"],"word":"位"}],"containing_words":[],"sentences":[{"english":"The second quarter, the continuous high card.","chinese":"二季度，重卡產銷量持續處於高位。"},{"english":"Yad entrance mine market both showed a high consolidation positive trend.","chinese":"連日來進口礦市場皆呈現出高位盤整向上的趨勢。"},{"english":"The high notes are always harder to play, regardless of the brand of harmonica.","chinese":"無論是哪個品牌的口琴，高位孔都比較難吹好。"},{"english":"But in the top job there simply isn't time to read every dot and comma before taking a decision.","chinese":"但身居高位，通常沒有時間在做出決定前字斟句酌。"},{"english":"But the mid-term election made his position untenable.","chinese":"然而中期選舉的局勢讓他高位難守。"},{"english":"They proclaimed a fast, and set Naboth on high among the people.","chinese":"宣告禁食，叫拿伯坐在民間的高位上。"},{"english":"The use of dynamic display, to continue to show high single-digit to the data.","chinese":"採用動態顯示，來不斷顯示個位到高位的數據。"},{"english":"This paper studies the measuring method of fluorescence lifetime for the high-lying triplet state of Na2.","chinese":"本文研究了鈉分子高位三重態熒光壽命的測量方法。"},{"english":"Objective To study the application of laparoscopic surgery on high cryptorchidism.","chinese":"目的探討腹腔鏡在高位隱睾手術中的應用。"},{"english":"Objective To discuss the curative effect of contradrainage and thread drawing method to treat high anal horseshoe fistula (HAHS).","chinese":"目的探討對口引流掛線在治療高位馬蹄瘻的效果。"},{"english":"So, on a big-endian system, it thought every file was empty.","chinese":"因此，在高位優先系統上，它認爲每個文件都是空的。"},{"english":"Between graben are relatively high-standing blocks called horsts.","chinese":"介於地塹之間的是較高位的斷塊，稱爲地壘。"},{"english":"Third, how will supply respond if the price stays high?","chinese":"第三，如果金價繼續維持高位，供給將會有何變化？"},{"english":"Zhang Ling's husband, family letters and visits from high-jumped a tree or high paraplegia .","chinese":"信訪戶張玲的丈夫從高樹上跌摔成高位截癱。"},{"english":"The high-stand swamp organic facies just appears in the edge of the basin, and its hydrocarbon generation capacity is the lowest.","chinese":"高位沼澤有機相由於處於盆地邊緣，對生烴貢獻不大。"},{"english":"The conventional treatment of osteogenic sarcoma is a high amputation as well as disarticulation.","chinese":"骨肉瘤的傳統療法是高位截肢，關節離斷。"}],"related":[{"definition":["to fall back\/to return to low level after a rise (in water level, price etc)"],"pinyin":["hui2 luo4"],"word":"回落"},{"definition":["to fall back (of water level or share prices)"],"pinyin":["hui2 die1"],"word":"回跌"},{"definition":["to bounce\/to bounce back\/to boomerang\/to ricochet\/rebound (of stock market etc)\/bounce\/backlash\/negative repercussions"],"pinyin":["fan3 tan2"],"word":"反彈"},{"definition":["to vibrate\/to shake\/to shudder"],"pinyin":["zhen4 dang4"],"word":"震蕩"},{"definition":["short term\/short-term"],"pinyin":["duan3 qi1"],"word":"短期"},{"definition":["vulnerable\/weak"],"pinyin":["ruo4 shi4"],"word":"弱勢"},{"definition":["tendency\/trend\/path"],"pinyin":["zou3 shi4"],"word":"走勢"},{"definition":["rising trend\/upward momentum (e.g. in prices)"],"pinyin":["zhang3 shi4"],"word":"漲勢"},{"definition":["to fall\/to tumble"],"pinyin":["xia4 die1"],"word":"下跌"},{"definition":["large fall"],"pinyin":["da4 die1"],"word":"大跌"},{"definition":["to rise\/to go up"],"pinyin":["shang4 zhang3"],"word":"上漲"},{"definition":["bull market (prices appear to be rising)"],"pinyin":["kan4 zhang3"],"word":"看漲"},{"definition":["(of sales, prices etc) to fall\/to drop\/decline\/slump"],"pinyin":["xia4 cuo4"],"word":"下挫"},{"definition":["(of trains) up (i.e. towards the capital)\/(of river boats) to go against the current\/to submit (a document) to higher authorities"],"pinyin":["shang4 xing2"],"word":"上行"},{"definition":["phony\/so-called\/armchair (expert)\/vain (promise)\/(finance) short-seller\/bear (market)\/short (selling)"],"pinyin":["kong1 tou2"],"word":"空頭"},{"definition":["a big margin\/substantially"],"pinyin":["da4 fu2"],"word":"大幅"}]}