{"definition":["hyperbaric oxygen\/hyperbaric oxygenation\/also abbr. for 高壓氧治療|高压氧治疗[gao1 ya1 yang3 zhi4 liao2], hyperbaric therapy"],"pinyin":["gao1 ya1 yang3"],"simplified":["高压氧"],"rank":35107.0,"normalized_rank":0.4911924782785108,"fraction":5.990921806413698e-7,"cumulative_fraction":0.9941131123608762,"word":"高壓氧","characters":[{"definition":["high\/tall\/above average\/loud\/your (honorific)","surname Gao"],"pinyin":["Gao1","gao1"],"word":"高"},{"definition":["see 壓根兒|压根儿[ya4 gen1 r5]","to press\/to push down\/to keep under (control)\/pressure"],"pinyin":["ya1","ya4"],"word":"壓"},{"definition":["oxygen (chemistry)"],"pinyin":["yang3"],"word":"氧"}],"containing_words":[{"definition":["hyperbaric medicine\/hyperbaric oxygen therapy (HBOT)\/also 高壓氧療法|高压氧疗法[gao1 ya1 yang3 liao2 fa3]"],"pinyin":["gao1 ya1 yang3 zhi4 liao2"],"word":"高壓氧治療"},{"definition":["hyperbaric oxygen therapy (HBOT)\/also 高壓氧治療|高压氧治疗[gao1 ya1 yang3 zhi4 liao2]"],"pinyin":["gao1 ya1 yang3 liao2 fa3"],"word":"高壓氧療法"}],"sentences":[{"english":"Hyperbaric oxygen exposure is probably the most accepted model of oxidative lung injury.","chinese":"高壓氧倉被公認爲氧化肺損傷的重要模式。"},{"english":"Objective To explore the curative effect and mechanism of hyperbaric oxygenation(HBO) therapy for perennial allergic rhinitis.","chinese":"目的探討高壓氧治療常年性變應性鼻炎的療效及機理。"},{"english":"High oxygenic pressure vessels worked as the environmental control and ecological protection has no exception.","chinese":"作爲環控生保系統的高壓氧容器也不例外。"},{"english":"Objective To explore the effect of hyperbaric oxygen on patients with diabetic foot.","chinese":"目的探討高壓氧綜合治療糖尿病足的療效。"},{"english":"Treatment group on the basis of combined therapy using high-pressure oxygen(hyperbaric oxygen, HBO)treatment.","chinese":"治療組在綜合治療的基礎上採用高壓氧治療。"},{"english":"Objective To promote the effect of hyperbaric oxygen therapy for posterior cerebral artery infarction due to brain hernia.","chinese":"目的提高腦疝性大腦後動脈梗死的高壓氧治療效果。"},{"english":"Objective To observe the effects of hyperbaric oxygen in the treatment of post-stroke depression.","chinese":"目的觀察高壓氧治療卒中後抑鬱症的療效。"},{"english":"Among them cure of high-pressured oxygen cabin is optimal.","chinese":"其中高壓氧艙治療最佳。"},{"english":"There's the hyperbaric chamber; a concentrated dose of oxygen might help.","chinese":"高壓氧艙也是一種選擇，高劑量的氧氣可以起些效果。"},{"english":"Objective To explore the effect of hyperbaric therapy in treating phlebitis caused by venous indwelling needle.","chinese":"目的探討高壓氧治療靜脈留置針所致靜脈炎的療效。"},{"english":"Doctors do not know if you open a number of hyperbaric oxygen treatment.","chinese":"不知道醫生給你開的高壓氧有幾個療程。"},{"english":"Objective to explore clinical effect of Hyperbaric oxygenation on ocular fundus diseases and ocular traumas .","chinese":"目的探討高壓氧治療眼底病及眼外傷的臨牀療效。"},{"english":"Can the patient after thyroid cancer art do high-pressured oxygen to treat?","chinese":"甲狀腺癌術後患者可以做高壓氧治療嗎？"}],"related":[]}