{"definition":["high temperature"],"pinyin":["gao1 wen1"],"simplified":["高温"],"rank":4473.0,"normalized_rank":0.06258307332838974,"fraction":0.00002846023606588288,"cumulative_fraction":0.8452132547101876,"word":"高溫","characters":[{"definition":["high\/tall\/above average\/loud\/your (honorific)","surname Gao"],"pinyin":["Gao1","gao1"],"word":"高"},{"definition":["surname Wen","warm\/lukewarm\/temperature\/to warm up\/mild\/soft\/tender\/to review (a lesson etc)\/fever (TCM)\/old variant of 瘟[wen1]"],"pinyin":["Wen1","wen1"],"word":"溫"}],"containing_words":[{"definition":["heat-resistant"],"pinyin":["nai4 gao1 wen1"],"word":"耐高溫"}],"sentences":[{"english":"The application of chemical oil displacement agents for high temperature and salinity reservoir was prospected.","chinese":"分析了高溫高鹽油藏用化學驅油劑的應用前景。"},{"english":"By means of high - temperature curing, the curing period of lime - fly ash stabilized bound macadam is shortened.","chinese":"通過高溫養生手段縮短二灰穩定碎石的養生齡期。"},{"english":"These materials are found capable of withstanding high temperature and high pressure.","chinese":"發現這些材料能承受高溫高壓。"},{"english":"This article describes briefly the preparation technology and the main performance of waterborne high temperature anticorrosion coatings.","chinese":"簡述了水性高溫防腐塗料的製備工藝及主要性能。"},{"english":"That is it. So you want high temperature bricks, what are you going to make them out of?","chinese":"這就是它，因此你想要高溫磚，你打算怎麼做它？"},{"english":"The mechanism of high temperature creep associated with the climb of extended dislocations is investigated.","chinese":"本文研究了擴展位錯攀移的高溫蠕變機制。"},{"english":"The diapause of housefly larvae can be terminated by high temperature.","chinese":"高溫可解除家蠅幼蟲的滯育。"},{"english":"In addition, high temperature, continuous wave operation of the laser has also been achieved.","chinese":"此外，高溫，連續波運行的設計目標也已達到。"},{"english":"After it is available, I am denied for the access to Bikram Yoga.","chinese":"它是可用後，我被剝奪了對高溫瑜伽訪問。"},{"english":"Hot-water hoses must be reinforced to withstand high temperatures.","chinese":"熱水管必須能承受高溫。"},{"english":"Then they bake it in an extremely hot oven.","chinese":"最後將它置入高溫爐裏烘焙。"},{"english":"The secret, Palumbi said, may be that the high temperatures last for a short period of time.","chinese":"帕盧比說，奧祕可能在於高溫只持續了很短一段時間。"},{"english":"The high temperature valve is suitable for sealing high-temperature pipelines in the production process of titanium sponge.","chinese":"適用作海綿鈦生產過程中密封高溫管道使用。"},{"english":"High temperature rated grease is standard for extended bearing life.","chinese":"高溫潤滑脂是標準的額定延長軸承壽命。"},{"english":"The room and high temperature mechanical strength of the hot-pressed B4C ceramic are studied.","chinese":"研究了熱壓燒結B4C陶瓷的室溫和高溫力學強度。"},{"english":"In this project, properties of transition-metal silicides were investigated for structural as well as functional applications.","chinese":"研究金屬硅化物的高溫結構性能和功能特性。"}],"related":[{"definition":["low temperature"],"pinyin":["di1 wen1"],"word":"低溫"},{"definition":["temperature\/CL:個|个[ge4]"],"pinyin":["wen1 du4"],"word":"溫度"},{"definition":["Celsius\/centigrade"],"pinyin":["She4 shi4"],"word":"攝氏"},{"definition":["to expose to strong sunlight"],"pinyin":["pu4 shai4"],"word":"曝曬"},{"definition":["(of the sun) to scorch\/to expose to a scorching sun"],"pinyin":["bao4 shai4"],"word":"暴曬"},{"definition":["air temperature\/CL:個|个[ge4]"],"pinyin":["qi4 wen1"],"word":"氣溫"},{"definition":["climate\/atmosphere\/situation\/CL:種|种[zhong3]"],"pinyin":["qi4 hou4"],"word":"氣候"},{"definition":["blistering hot\/sizzling hot (weather)"],"pinyin":["yan2 re4"],"word":"炎熱"},{"definition":["to burn\/to cook\/to stew\/to bake\/to roast\/to heat\/to boil (tea, water etc)\/fever\/to run a temperature\/(coll.) to let things go to one's head"],"pinyin":["shao1"],"word":"燒"},{"definition":["humidity level"],"pinyin":["shi1 du4"],"word":"濕度"},{"definition":["to take a meal\/to eat"],"pinyin":["jin4 shi2"],"word":"進食"},{"definition":["sultry\/sultriness\/hot and stuffy\/stifling hot"],"pinyin":["men1 re4"],"word":"悶熱"},{"definition":["to heat"],"pinyin":["jia1 re4"],"word":"加熱"},{"definition":["weather"],"pinyin":["tian1 qi4"],"word":"天氣"},{"definition":["to pass\/to go through\/process\/course\/CL:個|个[ge4]"],"pinyin":["jing1 guo4"],"word":"經過"},{"definition":["to become cooler\/to lower the temperature\/cooling\/(of interest, activity etc) to decline"],"pinyin":["jiang4 wen1"],"word":"降溫"}]}