{"definition":["blast furnace"],"pinyin":["gao1 lu2"],"simplified":["高炉"],"rank":21740.0,"normalized_rank":0.304170805758818,"fraction":0.000002009819966635082,"cumulative_fraction":0.9786504176377618,"word":"高爐","characters":[{"definition":["high\/tall\/above average\/loud\/your (honorific)","surname Gao"],"pinyin":["Gao1","gao1"],"word":"高"},{"definition":["stove\/furnace"],"pinyin":["lu2"],"word":"爐"}],"containing_words":[],"sentences":[{"english":"A axle of blast furnace charging wagon broke in use.","chinese":"高爐上料車車軸在使用過程中發生斷裂。"},{"english":"Production costs and pollution can be reduced in iron-smelting by means of SAD in small blast furnace.","chinese":"小高爐使用硫酸渣鍊鐵能降低生產成本，減少污染。"},{"english":"The blast furnace slag is grinded to have the granularity the same as that of the cement.","chinese":"高爐礦渣粉需要磨細，粒度與水泥粒度相同。"},{"english":"The paper summarizes the new technologies adopted in No. 1 BF of Xiangtan Iron and Steel Co.","chinese":"對湘鋼1號高爐採用的新技術進行了總結分析。"},{"english":"Also \"blast home\" to meet the \"bull\" in foreshadowing the arrival of a new vision.","chinese":"也爲“高爐家”迎接“牛”年的到來鋪墊新的願景。"},{"english":"There are no artificial colors of flavors in our Meat Blast Brand Twists.","chinese":"有沒有在我們的口味高爐品牌彎人造肉的顏色。"},{"english":"The bosh becomes larger from the tuyeres up to the maximum internal diameter of the furnace.","chinese":"爐腹從風口開始上至高爐口徑最大處變得大起來。"},{"english":"Taphole driller is a key equipment to open the taphole blast furnace.","chinese":"開鐵口機是完成打開高爐鐵口操作的關鍵設備。"},{"english":"Ground granulate blast furnace slag (GGBFS) is a by-product of the iron and steel manufacturing industry.","chinese":"高爐礦渣是中國鋼鐵業大量排放的一種冶金廢渣。"},{"english":"Furnace grate is a main part of hot blast stove.","chinese":"爐箅子是高爐熱風爐的重要部件之一。"},{"english":"The phenomenon of sinter degradation takes place in the upper shaft of blast furnaces.","chinese":"燒結礦在高爐爐身上部會發生低溫還原粉化現象。"},{"english":"Mine is back to Cold Blast Whole system of screening.","chinese":"冷返礦是整粒系統高爐槽下篩分出的。"},{"english":"Blast furnace is a complex metallurgical reactor with gas-solid counter flow.","chinese":"高爐是一個複雜的氣固向流反應器。"},{"english":"Analyzed the effects of protection of titanium-bearing pellet ore on the parameters of blast furnace production.","chinese":"分析了鈦球護爐對高爐生產各種參數的影響。"},{"english":"The research of the application of continuous analysis technique in blast furnace top comprehensive gas has been introduced.","chinese":"介紹了攀鋼高爐爐頂綜合煤氣連續分析技術應用研究。"},{"english":"The feasibility of admixing blast furnace gas to spreader-stoker-coal fired boilers is being discussed.","chinese":"分析了拋煤機鍋爐摻燒高爐煤氣的可行性。"}],"related":[]}