{"definition":["Gaul"],"pinyin":["Gao1 lu2"],"simplified":["高卢"],"rank":58653.0,"normalized_rank":0.8206315671652232,"fraction":5.0946191774814326e-8,"cumulative_fraction":0.9997526486480957,"word":"高盧","characters":[{"definition":["high\/tall\/above average\/loud\/your (honorific)","surname Gao"],"pinyin":["Gao1","gao1"],"word":"高"},{"definition":["(old) rice vessel\/black\/old variant of 廬|庐[lu2]\/(slang) (Tw) troublesome\/fussy","surname Lu\/abbr. for Luxembourg 盧森堡|卢森堡[Lu2 sen1 bao3]"],"pinyin":["Lu2","lu2"],"word":"盧"}],"containing_words":[{"definition":["Gaulish or Gallic (language)"],"pinyin":["Gao1 lu2 yu3"],"word":"高盧語"}],"sentences":[{"english":"He marched into southern France, which was then called Gaul.","chinese":"他進軍到當時稱爲高盧的法國南部。"},{"english":"Caesar subdued Gaul in 50 B. C.","chinese":"凱撒在公元前五十年時征服高盧。"},{"english":"A dancer’s body combined with winning charm and Gallic grace.","chinese":"她有舞者的身材，無與倫比的魅力和高盧人的優雅。"},{"english":"France's president held a crisis meeting in response to the defeat of Les Bleus.","chinese":"法國總統也就高盧雄雞的失利召開了緊急會議。"},{"english":"Evidence for the Gallican rites of ordination and some other matters is derived from this book.","chinese":"證據高盧聖儀式的協調和一些其他事項源自這本書。"},{"english":"The Gauls were accustomed to offer human sacrifices, usually criminals.","chinese":"高盧人習慣於提供人類作爲獻祭，通過是罪犯。"},{"english":"Gaulish coat of chainmail, of a very fine mesh.","chinese":"一件鎖子甲制的高盧外衣，有很好網眼。"},{"english":"French people generally regarded as Chicken Gauls a symbol of courage.","chinese":"法國人普遍把高盧雞視爲勇敢的象徵。"},{"english":"According to him, it had the measure of a Gaulish pint.","chinese":"根據他所說，有一個高盧人用的一品脫大的量度器。"},{"english":"Latin did not replace the Celtic language in Britain as it did in Gaul.","chinese":"拉丁語沒有像在高盧那樣取代塞爾特語。"},{"english":"Christianity also took root in the second and third centuries AD.","chinese":"公元前二和三世紀，基督教也在高盧領土紮根下來。"},{"english":"It is the statue of the \"Dying Gaul\".","chinese":"這是一尊“垂死掙扎的高盧人”的雕塑。"},{"english":"This is the only known, surviving reference to the goddess Gallia.","chinese":"這是唯一已知的，倖存的參考女神高盧。"},{"english":"Julius Caesar subdued Gaul in 50 B. C.","chinese":"凱撒在公元前五十年時征服高盧。"}],"related":[]}