{"definition":["to be at loggerheads\/to have a falling out"],"pinyin":["nao4 mao2 dun4"],"simplified":["闹矛盾"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"鬧矛盾","characters":[{"definition":["noisy\/cacophonous\/to make noise\/to disturb\/to vent (feelings)\/to fall ill\/to have an attack (of sickness)\/to go in (for some activity)\/to joke"],"pinyin":["nao4"],"word":"鬧"},{"definition":["spear\/lance\/pike"],"pinyin":["mao2"],"word":"矛"},{"definition":["shield\/(currency) Vietnamese dong\/currency unit of several countries (Indonesian rupiah, Dutch gulden etc)"],"pinyin":["dun4"],"word":"盾"}],"containing_words":[],"sentences":[{"english":"But one morning Brother and Sister don't get along well!","chinese":"但是有一天早晨熊哥哥和熊妹妹鬧矛盾了。"},{"english":"He had often been in trouble with the police.","chinese":"過去他常和警察鬧矛盾。"},{"english":"I have never got on badly with anybody.","chinese":"我從沒有與任何人鬧矛盾。"},{"english":"Thee man often has trouble with his wife.","chinese":"這個人經常同他的妻子鬧矛盾。"},{"english":"He often has trouble with his wife.","chinese":"他經常和他的妻子鬧矛盾。"},{"english":"In these cases, it may also be necessary to separate the females in question.","chinese":"在這種情況下，分開鬧矛盾的雌性豬豬就非常重要了。"},{"english":"Do you know a couple whose marriage is struggling?","chinese":"你知道哪一對夫妻鬧矛盾嗎？"},{"english":"Between you and me, I think she has a problem with her boyfriend.","chinese":"你別說出去，我想她和男朋友鬧矛盾了。"},{"english":"The man often has trouble with his wife.","chinese":"這個男人經常與他的妻子鬧矛盾。"},{"english":"Then one day, after a misunderstanding, Joyce stopped talking to Jessica.","chinese":"有一天，兩人鬧矛盾，喬依絲不再和傑西卡說話了。"},{"english":"I wonder why sometimes we fall apart …oh yeah.","chinese":"我納悶爲什麼有些時候我們會鬧矛盾。"},{"english":"As wife and mother of contradictions I the son of the measures to be taken?","chinese":"當老婆和媽鬧矛盾了我這個做兒子的該採取哪些措施？"},{"english":"Sometimes our conflicts will break the peace.","chinese":"有時你我鬧矛盾打破寧靜。"},{"english":"The first example is of a situation where you're not getting along with your best friend.","chinese":"第一個例子是你跟你最好的朋友最近鬧矛盾。"},{"english":"These two roommates often come into conflict.","chinese":"這兩個室友經常鬧矛盾。"},{"english":"The children are often in conflict with each other over toys.","chinese":"這些孩子經常因爲爭搶玩具鬧矛盾。"}],"related":[]}