{"definition":["to have a falling out\/to have a big argument"],"pinyin":["nao4 fan1"],"simplified":["闹翻"],"rank":30634.0,"normalized_rank":0.42860940495012106,"fraction":8.909014567383721e-7,"cumulative_fraction":0.9908230710882842,"word":"鬧翻","characters":[{"definition":["noisy\/cacophonous\/to make noise\/to disturb\/to vent (feelings)\/to fall ill\/to have an attack (of sickness)\/to go in (for some activity)\/to joke"],"pinyin":["nao4"],"word":"鬧"},{"definition":["to turn over\/to flip over\/to overturn\/to rummage through\/to translate\/to decode\/to double\/to climb over or into\/to cross"],"pinyin":["fan1"],"word":"翻"}],"containing_words":[{"definition":["to create a big disturbance"],"pinyin":["nao4 fan1 tian1"],"word":"鬧翻天"}],"sentences":[{"english":"One day, mom was not at home.","chinese":"媽媽不在家，孩子們鬧翻天。"},{"english":"On the night of June 1, all hell broke loose.","chinese":"6月1日晚上，全都鬧翻了天。"},{"english":"Did you hear the carryings-on next door last night ?","chinese":"你聽見沒聽見昨晚隔壁鬧翻天了？"},{"english":"He'll raise hell if we don't finish on time.","chinese":"如果我們不按時完工的話，他會鬧翻天的。"},{"english":"Then might mess up, first was the daughter goes home \"to raise a rumpus \".","chinese":"這下可亂套了，首先是女兒回家“鬧翻了天”。"},{"english":"For a start, by the end of the week the children are imploding.","chinese":"開始時，孩子們在週末把家裏鬧翻了天。"},{"english":"All hell broke out around here when your column appeared.","chinese":"你的專欄文章一發表，我們這裏就鬧翻了天。"},{"english":"But we broke up a year ago. He hasn't spoken to me since then.","chinese":"但是一年前鬧翻了，從此他再也沒有理過我。"},{"english":"But the two men fell out in 1455, and Fust sued Gutenberg.","chinese":"但兩人於1455年鬧翻，福斯特控告了古滕伯格。"},{"english":"They split up, spread out, sunned themselves, bickered.","chinese":"他們鬧翻，舒展身軀曬太陽，他們鬥嘴。"},{"english":"Amazingly, just about everyone he works with falls out with him.","chinese":"讓人喫驚的是跟他工作過的所有人都跟他鬧翻了。"},{"english":"She is out with her husband.","chinese":"她和她丈夫鬧翻了。"},{"english":"He fell out with his father and became a wanderer .","chinese":"他和父親鬧翻了，成了一名遊子。"},{"english":"The party went a whole night, it seemed as the house wound be raised the roof.","chinese":"派對進行了整個晚上，似乎把房子都要鬧翻天。"},{"english":"The couple recently had a falling-out over where they should go on their vacation.","chinese":"那對夫妻最近爲了究竟該去哪裏渡假而鬧翻了。"},{"english":"Mr Yamadayev had fallen out with Chechnya's president, Ramzan Kadyrov.","chinese":"此前亞瑪迪耶夫已經與車臣總統卡德羅夫鬧翻。"}],"related":[{"definition":["to rupture\/to burst open\/to break\/to break off relations with\/a rupture"],"pinyin":["jue2 lie4"],"word":"決裂"},{"definition":["to break off relations\/to break with sb"],"pinyin":["jue2 jiao1"],"word":"絕交"},{"definition":["to have an acrimonious falling-out\/to shed all pretense of cordiality\/to tear into each other"],"pinyin":["si1 po4 lian3"],"word":"撕破臉"},{"definition":["to question intensely\/to interrogate\/to demand information"],"pinyin":["bi1 wen4"],"word":"逼問"},{"definition":["lit. to take different roads and urge the horses on (idiom)\/fig. to part ways"],"pinyin":["fen1 dao4 yang2 biao1"],"word":"分道揚鑣"},{"definition":["to act in a fit of pique\/to get in a huff\/to be peeved"],"pinyin":["du3 qi4"],"word":"賭氣"},{"definition":["to lay one's cards on the table"],"pinyin":["tan1 pai2"],"word":"攤牌"},{"definition":["to part on bad terms\/(of a meeting etc) to break up in discord"],"pinyin":["bu4 huan1 er2 san4"],"word":"不歡而散"},{"definition":["stuck together as by glue (of lovers)\/joined at the hip"],"pinyin":["ru2 jiao1 si4 qi1"],"word":"如膠似漆"},{"definition":["to vanish\/to disappear from the face of the earth"],"pinyin":["ren2 jian1 zheng1 fa1"],"word":"人間蒸發"},{"definition":["to disagree\/dissent"],"pinyin":["yi4 jian4 bu4 he2"],"word":"意見不合"},{"definition":["(coll.) to pester\/to harass"],"pinyin":["si3 chan2 lan4 da3"],"word":"死纏爛打"},{"definition":["to lament\/to complain tearfully\/to wail accusingly"],"pinyin":["ku1 su4"],"word":"哭訴"},{"definition":["lit. lotus roots may break, but the fiber remains joined (idiom); lovers part, but still long for one another"],"pinyin":["ou3 duan4 si1 lian2"],"word":"藕斷絲連"},{"definition":["to expel (a member of an organization)\/to fire (an employee)"],"pinyin":["kai1 chu2"],"word":"開除"},{"definition":["to match one's strength with\/to compete\/more competitive\/to set oneself against sb\/disobliging\/to make a special effort"],"pinyin":["jiao4 jin4"],"word":"較勁"}]}