{"definition":["Wei (220-265) and Jin (265-420) dynasties"],"pinyin":["Wei4 Jin4"],"simplified":["魏晋"],"rank":34485.0,"normalized_rank":0.4824898912876191,"fraction":6.350026768494049e-7,"cumulative_fraction":0.9937296495719784,"word":"魏晉","characters":[{"definition":["surname Wei\/name of vassal state of Zhou dynasty from 661 BC in Shanxi, one of the Seven Hero Warring States\/Wei state, founded by Cao Cao 曹操[Cao2 Cao1], one of the Three Kingdoms after the Han dynasty\/the Wei dynasty 221-265\/Wei prefecture and Wei county at different historical periods","tower over a palace gateway (old)"],"pinyin":["Wei4","wei4"],"word":"魏"},{"definition":["surname Jin\/the Jin Dynasties (265-420)\/Western Jin 西晉|西晋[Xi1 Jin4] (265-316), Eastern Jin 東晉|东晋[Dong1 Jin4] (317-420) and Later Jin Dynasty (936-946)\/short name for Shanxi province 山西[Shan1 xi1]","to move forward\/to promote\/to advance"],"pinyin":["Jin4","jin4"],"word":"晉"}],"containing_words":[{"definition":["Wei, Jin and North-South dynasties\/generic term for historic period 220-589 between Han and Sui"],"pinyin":["Wei4 Jin4 Nan2 Bei3 Chao2"],"word":"魏晉南北朝"}],"sentences":[{"english":"Later, when metaphysics and buddhism arose in Wei Jin period, the shape and bearing of an object.","chinese":"魏晉時期玄佛興起，理溝通了形與神。"},{"english":"The fifth chapter mainly discusses its transfer during Wei and Jin dynasties.","chinese":"第五章主要討論相和歌辭在魏晉時期的轉型問題。"},{"english":"The aesthetic value-orientation of literature in Wei-Jin limes and the Six Dynasties obviously advocated \"purity\".","chinese":"魏晉六朝文學審美價值取向明顯尚清。"},{"english":"Taoism has its beginning in Han-Wei-Jin period.","chinese":"漢魏晉乃道教開端的時代。"},{"english":"Jikang is a famous philosopher in Wei-jin Period of China.","chinese":"嵇康是中國古代魏晉時期著名哲學家。"},{"english":"The forth chapter discusses the development and transformation of the imitating ancient poetry in Wei, Jin and Northern & Southern dynasties.","chinese":"第四章論述魏晉南北朝擬“古詩”的發展流變。"},{"english":"Luji is one important writer and theorist of arts during Wei and Jin Dynasty.","chinese":"陸機是我國魏晉之際的重要作家和文學理論家。"},{"english":"The influence of metaphysics on poems can be traced back to the Wei and Jin dynasties, when metaphysics coming in- to being.","chinese":"玄學對詩歌的影響可上推至魏晉之際玄學初起之時。"},{"english":"The system of village started in the Wei, Jin, and Southern and Northern dynasties was a great progress of local primary-level organizations.","chinese":"魏晉南北朝時代村的出現是地方基層組織的一大變革。"},{"english":"The argument of norm and nature is the central issue of Wei-Jin metaphysics.","chinese":"“自然”與“名教”之辯是魏晉玄學的中心議題。"},{"english":"It is literature researcher that has first prompted the thesis that scholar-officials in Wei and Jin dynasties valued feelings.","chinese":"魏晉時期士人的重情是文學研究者首先提出來的。"},{"english":"Weijin and Northern and Southern Dynasties is the prosperous period of the patriarchal clan in the Chinese history.","chinese":"魏晉南北朝時期是中國歷史上宗族強盛的時期。"},{"english":"It was inital and taking shape stage about the Peach culture before the Qin Dynasty and Wei Jin Dynasty.","chinese":"先秦至魏晉是桃文化的濫觴和形成期。"},{"english":"The epidemic disease in the Wei, Jin, Sixteen States and Northern Dynasties spread continuously.","chinese":"魏晉十六國北朝疫病流行呈現出連綿不斷的趨勢。"},{"english":"XIAO-Yan is the first emperor of the Liang Dynasty in Wei and Jin era.","chinese":"梁武帝蕭衍是魏晉南北朝時期梁朝的開國帝王。"},{"english":"In the first chapter, we mainly discuss the state of authors' biography.","chinese":"第一章主要論述魏晉時期作家傳記史料的情況。"}],"related":[{"definition":["the Song dynasty (960-1279)\/refers to the Northern (960-1127) and Southern Song (1128-1279)"],"pinyin":["Liang3 Song4"],"word":"兩宋"},{"definition":["Han dynasty (206 BC-220 AD)\/refers to the Western Han and Eastern Han"],"pinyin":["liang3 Han4"],"word":"兩漢"},{"definition":["Han Dynasty (206 BC-220 AD)"],"pinyin":["Han4 chao2"],"word":"漢朝"},{"definition":["the Han dynasty (206 BC-220 AD)"],"pinyin":["Han4 dai4"],"word":"漢代"},{"definition":["Sima Qian (145-86 BC), Han Dynasty historian, author of Records of the Grand Historian 史記|史记[Shi3 ji4], known as the father of Chinese historiography"],"pinyin":["Si1 ma3 Qian1"],"word":"司馬遷"},{"definition":["Wei, Jin and North-South dynasties\/generic term for historic period 220-589 between Han and Sui"],"pinyin":["Wei4 Jin4 Nan2 Bei3 Chao2"],"word":"魏晉南北朝"},{"definition":["beginning\/origin\/to originate\/to initiate"],"pinyin":["fa1 duan1"],"word":"發端"},{"definition":["the Qin (221-207 BC) and Han (206 BC-220 AD) dynasties"],"pinyin":["Qin2 Han4"],"word":"秦漢"},{"definition":["Eastern or later Han dynasty, 25-220"],"pinyin":["Dong1 han4"],"word":"東漢"},{"definition":["History of the Former Han Dynasty, second of the 24 dynastic histories 二十四史[Er4 shi2 si4 Shi3], composed by Ban Gu 班固[Ban1 Gu4] in 82 during Eastern Han (later Han), 100 scrolls"],"pinyin":["Han4 shu1"],"word":"漢書"},{"definition":["the Hundred Schools of Thought, the various schools of thought and their exponents during the Spring and Autumn and Warring States Periods (770-220 BC)"],"pinyin":["zhu1 zi3 bai3 jia1"],"word":"諸子百家"},{"definition":["A New Account of the Tales of the World, collection of anecdotes, conversations, remarks etc of historic personalities, compiled and edited by Liu Yiqing 劉義慶|刘义庆[Liu2 Yi4 qing4]"],"pinyin":["Shi4 shuo1 Xin1 yu3"],"word":"世說新語"},{"definition":["the Spring and Autumn (770-476 BC) and Warring States (475-221 BC) periods"],"pinyin":["Chun1 qiu1 Zhan4 guo2"],"word":"春秋戰國"},{"definition":["Gu Kaizhi or Ku K'aichih (346-407), famous painter of Eastern Jin dynasty, one of the Four Great Painters of the Six Dynasties 六朝四大家"],"pinyin":["Gu4 Kai3 zhi1"],"word":"顧愷之"},{"definition":["History of the Early Tang Dynasty, sixteenth of the 24 dynastic histories 二十四史[Er4 shi2 si4 Shi3], compiled under Liu Xu 劉昫|刘昫[Liu2 Xu4] in 945 during Later Jin 後晉|后晋[Hou4 Jin4] of the Five Dynasties, 200 scrolls"],"pinyin":["Jiu4 Tang2 shu1"],"word":"舊唐書"},{"definition":["Shijing, the Book of Songs, early collection of Chinese poems and one of the Five Classics of Confucianism 五經|五经[Wu3 jing1]"],"pinyin":["Shi1 jing1"],"word":"詩經"}]}