{"definition":["robust (loanword)\/solid"],"pinyin":["lu3 bang4"],"simplified":["鲁棒"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"魯棒","characters":[{"definition":["(bound form) crass\/stupid\/rude\/(used to represent the sounds of \"ru\", \"lu\" etc in loanwords)","surname Lu\/Lu, ancient state of China 魯國|鲁国[Lu3 guo2]\/Lu, short name for Shandong 山東|山东[Shan1 dong1]"],"pinyin":["Lu3","lu3"],"word":"魯"},{"definition":["stick\/club\/cudgel\/smart\/capable\/strong\/wonderful\/classifier for legs of a relay race"],"pinyin":["bang4"],"word":"棒"}],"containing_words":[{"definition":["robustness"],"pinyin":["lu3 bang4 xing4"],"word":"魯棒性"}],"sentences":[{"english":"A dual watermarking algorithm that accepted JPEG compression was presented.","chinese":"提出了一類抗壓縮的魯棒加半脆弱雙水印算法。"},{"english":"A robust repetitive controller for roll eccentricity compensation of cold mill is designed.","chinese":"設計了用於冷軋機的軋輥偏心補償的魯棒重複控制器。"},{"english":"This paper studies the robust stabilization problem of chaotic Lurie system.","chinese":"研究混沌魯裏葉系統的魯棒鎮定問題。"},{"english":"In this paper, robust ambients (ROAM) is proposed to eliminate those security breaches.","chinese":"爲了消除上述安全隱患，提出了魯棒灰箱演算。"},{"english":"First, the condition of realization of robust diagonal dominance at a certain point is given.","chinese":"首先給出了系統在某一點處實現魯棒對角優勢的條件。"},{"english":"The actuator placement optimization of piezothermoelastic biotic thermal robust structure is studied in this paper.","chinese":"研究了熱壓電仿生熱魯棒結構致動器放置優化的問題。"},{"english":"Firstly the setpoint tracking controller is designed in terms of the robust H2 optimal performance objective.","chinese":"首先設定值跟蹤控制器設計的魯棒H2最優性能目標。"},{"english":"This paper considers the robust stabilization problem of an affine nonlinear uncertain systems.","chinese":"考慮了仿射非線性不確定系統的魯棒鎮定性。"},{"english":"Exponential dissipativity of Cohen-Grossberg neural networks with mixed delays and reaction-diffusion terms;","chinese":"討論了混合時滯區間神經網絡的全局魯棒指數穩定性。"},{"english":"A new blind beamformer with improved Hopfield network is presented in this paper.","chinese":"本文提出了一種魯棒的盲神經網絡波束形成算法。"},{"english":"A new robust adaptive current control scheme for the induction machine is proposed.","chinese":"提出一種新型感應電機魯棒自適應電流控制方案。"},{"english":"The stability perturbation bounds of a single-input-single-output system with both parametric and dynamic uncertainties is studied.","chinese":"研究了混合攝動模式下反饋系統魯棒穩定的攝動界。"},{"english":"In this paper, the realizations of robust diagonal dominance by constant compensator are discussed.","chinese":"本文研究了利用常數補償器實現魯棒對角優勢的問題。"},{"english":"Experimental results show that our proposed method can track articulated hand robustly and efficiently.","chinese":"實驗結果表明，該方法可以魯棒地跟蹤關節人手。"},{"english":"The robust exponential stability in mean square of the system is analyzed.","chinese":"分析了該系統的魯棒均方指數穩定性。"},{"english":"This paper proposes a robust mesh watermarking algorithm using wavelet transform for semi-regular meshes obtained by remeshing.","chinese":"提出了一種小波變換域的魯棒網格水印算法。"}],"related":[]}