{"definition":["robustness"],"pinyin":["lu3 bang4 xing4"],"simplified":["鲁棒性"],"rank":66632.0,"normalized_rank":0.9322681292236228,"fraction":1.0510389134059116e-8,"cumulative_fraction":0.9999749407506764,"word":"魯棒性","characters":[{"definition":["(bound form) crass\/stupid\/rude\/(used to represent the sounds of \"ru\", \"lu\" etc in loanwords)","surname Lu\/Lu, ancient state of China 魯國|鲁国[Lu3 guo2]\/Lu, short name for Shandong 山東|山东[Shan1 dong1]"],"pinyin":["Lu3","lu3"],"word":"魯"},{"definition":["stick\/club\/cudgel\/smart\/capable\/strong\/wonderful\/classifier for legs of a relay race"],"pinyin":["bang4"],"word":"棒"},{"definition":["nature\/character\/property\/quality\/attribute\/sexuality\/sex\/gender\/suffix forming adjective from verb\/suffix forming noun from adjective, corresponding to -ness or -ity\/essence\/CL:個|个[ge4]"],"pinyin":["xing4"],"word":"性"}],"containing_words":[],"sentences":[{"english":"Dead-zone operator is adopted in the adaptive algorithm, which improves the robustness of the algorithm.","chinese":"自適應算法中採用了死區算子，增強了算法的魯棒性。"},{"english":"The experiments show that the watermarking is perceptually invisible and robustable.","chinese":"實驗結果表明，水印具有良好隱蔽性和魯棒性。"},{"english":"The performance of the starter is robust.","chinese":"且軟起動器具有較好的魯棒性。"},{"english":"The simulation result indicates that the method has strong robustness.","chinese":"仿真結果表明，本方法具有較好的魯棒性。"},{"english":"Line shift text watermarking algorithm, strong robustness, use of boundary.","chinese":"行移文本水印算法，強魯棒性，邊界掃描採用投影法。"},{"english":"The simulation indicates this control strategy has remarkable self-adaptability and robustness character.","chinese":"仿真證明，該控制策略具有良好的自適應性和魯棒性。"},{"english":"Dead-zone operator is adopted in the adaptive algorithm to improve the algorithm's robustness.","chinese":"自適應算法中採用了死區算子，增強了算法的魯棒性。"},{"english":"It has the characteristic of less counting quantity and stronger robustness.","chinese":"該算法具有計算量小，魯棒性較強的特點。"},{"english":"The proposed algorithm solved the conflict of watermark robustness and perceptual invisibility.","chinese":"算法很好地解決了水印魯棒性和不可見性之間的矛盾。"},{"english":"This paper improves the decoupling control scheme with the impedance tracking.","chinese":"文中以阻抗跟蹤法改善交叉解耦控制的魯棒性。"},{"english":"The experimental results show that the algorithm has better robustness and fidelity.","chinese":"實驗結果證明該算法具有較好的魯棒性和高保真性。"},{"english":"Orthogonal transforms are traditionally realized by \"multiplication addition arithmetic\" with less robustness.","chinese":"傳統上都採用“乘加算術”實現正交變換，魯棒性差。"},{"english":"The robustness analysis gives template parameter inequalities which guarantee the corresponding CNNs working well for performing prescribed tasks.","chinese":"魯棒性分析給出了完成相應功能的參數不等式。"},{"english":"The algorithm has robustness and realiability.","chinese":"算法具有魯棒性和實用性。"},{"english":"It is believed that the work will help the design of robust watermarks.","chinese":"相信，這一工作有助於更強魯棒性的水印算法的設計。"},{"english":"Emulated experiment results show that this method is robust and feasible.","chinese":"仿真實驗結果表明這種方法的強魯棒性和可行性。"}],"related":[]}