{"definition":["gill slit (in fish)"],"pinyin":["sai1 lie4"],"simplified":["鳃裂"],"rank":67627.0,"normalized_rank":0.946189470149567,"fraction":7.882791850544337e-9,"cumulative_fraction":0.9999840393901795,"word":"鰓裂","characters":[{"definition":["gills of fish"],"pinyin":["sai1"],"word":"鰓"},{"definition":["to split\/to crack\/to break open\/to rend"],"pinyin":["lie4"],"word":"裂"}],"containing_words":[],"sentences":[{"english":"A brief discussion has been made in the clinical diagnosis and the causes of misdiagnosis in the first branchial cleft diseases.","chinese":"文章闡述了第一鰓裂囊腫的臨牀診斷及其誤診原因。"},{"english":"Bilateral branchial cleft fistulas are uncommon, but the incidence is higher in the same family.","chinese":"雙側鰓裂異常臨牀上較爲罕見，且常有家族遺傳傾向。"},{"english":"Branchial cleft cyst had the relatively fixed location and hadn't been enhanced.","chinese":"鰓裂囊腫有其相對固定的發病部位，增強掃描無強化。"},{"english":"Consulsion:Surgical resection was the main method to treat the congenital branchial cleft cysts.","chinese":"手術切除仍爲治療鰓裂畸形的主要方法。"},{"english":"Objective To analyze the clinical feature and prognosis of primary branchial carcinoma.","chinese":"目的探討原發性鰓裂癌臨牀特點及預後。"},{"english":"Objective To evaluate the significance of dissection of the facial nerve in resection of the first branchial fistula.","chinese":"目的探討面神經解剖在第一鰓裂瘻管切除術中的意義。"},{"english":"Objective To improve the recognization and the diagnostic accuracy of brachial cleft cyst (BCC) by CT scan.","chinese":"目的提高對鰓裂囊腫CT表現的認識和診斷準確率。"},{"english":"The second branchial fistula and thyroglossal fistula are relatively common lesions.","chinese":"第二鰓裂瘻和甲狀舌管瘻在臨牀上較爲常見。"},{"english":"IV. They present a propulsive tail, pharynx and branchial openings.","chinese":"它們有一條推進用的尾巴，咽及鰓裂。"}],"related":[]}