{"definition":["scaly\/squamous"],"pinyin":["lin2 zhuang4"],"simplified":["鳞状"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"鱗狀","characters":[{"definition":["scales (of fish)"],"pinyin":["lin2"],"word":"鱗"},{"definition":["accusation\/suit\/state\/condition\/strong\/great\/-shaped"],"pinyin":["zhuang4"],"word":"狀"}],"containing_words":[{"definition":["squamous cell carcinoma"],"pinyin":["lin2 zhuang4 xi4 bao1 ai2"],"word":"鱗狀細胞癌"}],"sentences":[{"english":"Histologically, dentigerous cysts are lined by stratified squamous nonkeratinizing epithelium.","chinese":"組織學上含齒囊腫爲多層鱗狀未角化上皮細胞所覆蓋。"},{"english":"The differential diagnosis includes squamous cell carcinoma, verrucous carcinoma and condyloma acuminatum.","chinese":"鑑別診斷包括鱗狀細胞癌，疣狀癌以及尖銳溼疣。"},{"english":"This is another pelvic exenteration for cervical squamous cell carcinoma.","chinese":"另例宮頸鱗狀細胞癌，行盆腔清除術。"},{"english":"Cutaneous squamous cell carcinoma (SCC) is a common cancer.","chinese":"表皮鱗狀細胞癌爲一常見之皮膚癌。"},{"english":"On the stone, there are scalelike stripes.","chinese":"石頭上有鱗狀的條紋。"},{"english":"Histopathologic diagnosis was \"Well-differentiated (Grade) Squamous Carciinoma\".","chinese":"病理診斷均爲“高分化鱗狀細胞癌”。"},{"english":"The ulcer base at the left shows loss of overlying squamous epithelium with only necrotic debris remaining.","chinese":"左邊潰瘍基底面缺少鱗狀上皮僅存有壞死的碎片。"},{"english":"Cupressus of north temperate regions having dark scalelike leaves and rounded cones.","chinese":"北方溫帶柏科常綠針葉樹，深色鱗狀樹葉，圓形球果。"},{"english":"Adenosquamous carcinomas are consisting of both glandular and squamous histologic components.","chinese":"鱗狀腺癌是由腺體及鱗狀組織所構成。"},{"english":"\"Wet\" keratin, under the microscope, appears as cohesive eosinophilic squames arranged in pavement-like sheets.","chinese":"溼角蛋白鏡下是鱗狀細胞排列呈緻密的嗜酸性團塊。"},{"english":"This iron pipe is scaly with rust.","chinese":"這鐵管上有鱗狀般的鐵鏽。"},{"english":"This is normal cervical non-keratinizing squamous epithelium.","chinese":"正常宮頸鱗狀上皮，無角化。"}],"related":[]}