{"definition":["alkaline earth (i.e. beryllium Be 鈹|铍, magnesium Mg 鎂|镁, calcium Ca 鈣|钙, strontium Sr 鍶|锶, barium Ba 鋇|钡 and radium Ra 鐳|镭)"],"pinyin":["jian3 tu3 jin1 shu3"],"simplified":["碱土金属"],"rank":70065.0,"normalized_rank":0.9803002532424832,"fraction":3.065530164100576e-9,"cumulative_fraction":0.999996805133648,"word":"鹼土金屬","characters":[{"definition":["base\/alkali\/soda (chemistry)"],"pinyin":["jian3"],"word":"鹼"},{"definition":["Tu (ethnic group)\/surname Tu","earth\/dust\/clay\/local\/indigenous\/crude opium\/unsophisticated\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Tu3","tu3"],"word":"土"},{"definition":["gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)"],"pinyin":["Jin1","jin1"],"word":"金"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"}],"containing_words":[],"sentences":[{"english":"The calculated results of energy gap on alkaline earth mixed halides are reasonable.","chinese":"對鹼土金屬復鹵化物的能隙進行了計算，結果合理。"},{"english":"It does not absorb the alkaline-earth metal ions and behave as the polyamine resins.","chinese":"但不吸附鹼土金屬離子，這和聚多胺樹脂相同。"},{"english":"The crystal structures of alkali-earth metal dihydrogen diphthalates have been measured.","chinese":"測定了鹼土金屬鄰苯二甲酸氫鹽的晶體結構。"},{"english":"The article discusses the thickening mechanism of unsaturated polyesters with alkaline-earth metallic oxide.","chinese":"本文研究了鹼土金屬氧化物對不飽和聚酯的增稠機理。"},{"english":"The alkaline-earth metal strontium is the smallest element in abundance for the silver-white soft metal.","chinese":"鍶是鹼土金屬中丰度最小的元素，爲銀白色軟金屬。"},{"english":"By two alkyl halide with alkali metal or alkaline earth metal polysulfides from condensation.","chinese":"由二滷代烷與鹼金屬或鹼土金屬的多硫化物縮聚而成。"}],"related":[]}