{"definition":["alkaline soil"],"pinyin":["jian3 tu3"],"simplified":["碱土"],"rank":65563.0,"normalized_rank":0.9173114322891162,"fraction":1.3867874551883557e-8,"cumulative_fraction":0.9999619123934615,"word":"鹼土","characters":[{"definition":["base\/alkali\/soda (chemistry)"],"pinyin":["jian3"],"word":"鹼"},{"definition":["Tu (ethnic group)\/surname Tu","earth\/dust\/clay\/local\/indigenous\/crude opium\/unsophisticated\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]"],"pinyin":["Tu3","tu3"],"word":"土"}],"containing_words":[{"definition":["alkaline earth (i.e. beryllium Be 鈹|铍, magnesium Mg 鎂|镁, calcium Ca 鈣|钙, strontium Sr 鍶|锶, barium Ba 鋇|钡 and radium Ra 鐳|镭)"],"pinyin":["jian3 tu3 jin1 shu3"],"word":"鹼土金屬"}],"sentences":[{"english":"The calculated results of energy gap on alkaline earth mixed halides are reasonable.","chinese":"對鹼土金屬復鹵化物的能隙進行了計算，結果合理。"},{"english":"Subsurface drain pipe system is a practical and effective solution to the improvement of submerged land and saline land.","chinese":"暗管排水是改良低溼地和治理鹽鹼土有效的工程措施。"},{"english":"It does not absorb the alkaline-earth metal ions and behave as the polyamine resins.","chinese":"但不吸附鹼土金屬離子，這和聚多胺樹脂相同。"},{"english":"The crystal structures of alkali-earth metal dihydrogen diphthalates have been measured.","chinese":"測定了鹼土金屬鄰苯二甲酸氫鹽的晶體結構。"},{"english":"The article discusses the thickening mechanism of unsaturated polyesters with alkaline-earth metallic oxide.","chinese":"本文研究了鹼土金屬氧化物對不飽和聚酯的增稠機理。"},{"english":"Results showed that MDM could obviously improve the physical and chemical properties of the alkali soil.","chinese":"結果表明，MDM可顯著改善草甸鹼土的理化性質。"},{"english":"Ecological effect of peat and weathered coal on alkali-saline soil.","chinese":"草炭與風化炭改良鹽鹼土的生態效應。"},{"english":"The alkaline-earth metal strontium is the smallest element in abundance for the silver-white soft metal.","chinese":"鍶是鹼土金屬中丰度最小的元素，爲銀白色軟金屬。"},{"english":"By two alkyl halide with alkali metal or alkaline earth metal polysulfides from condensation.","chinese":"由二滷代烷與鹼金屬或鹼土金屬的多硫化物縮聚而成。"}],"related":[]}