{"definition":["alkali metal"],"pinyin":["jian3 jin1 shu3"],"simplified":["碱金属"],"rank":64650.0,"normalized_rank":0.9045373777510388,"fraction":1.7225359969707997e-8,"cumulative_fraction":0.9999477337325487,"word":"鹼金屬","characters":[{"definition":["base\/alkali\/soda (chemistry)"],"pinyin":["jian3"],"word":"鹼"},{"definition":["gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)"],"pinyin":["Jin1","jin1"],"word":"金"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"}],"containing_words":[],"sentences":[{"english":"The element K promotes the dissociation of acetylene on Ru(1010)surface.","chinese":"鹼金屬K的存在促進了乙炔的分解。"},{"english":"This is a movie about Alkali Metal.","chinese":"這一套的短片是有關鹼金屬的短片。"},{"english":"The method can also be used for the calculations of the phonon dispersions of other alkali halides.","chinese":"這種方法還可用於其它鹼金屬鹵化物聲子譜的計算。"},{"english":"The hydrogenation of alkali metals using lanthanide trichloride and naphthalene as catalyst has been studied.","chinese":"本文研究了稀土氯化物對鹼金屬氫化反應的催化作用。"},{"english":"And, in fact, this is the case for all the alkali metals.","chinese":"事實上，所有的鹼金屬都有這樣的性質。"},{"english":"Thirdly, the binding energy of a crown-ether molecule complexing with an alkali-metal ion is estimated.","chinese":"最後估算了冠醚分子絡合鹼金屬離子的結合能。"},{"english":"A new chalcogenide glass system containing higher content of alkali metal ions was developed.","chinese":"開發了有高含量鹼金屬離子的新型硫化物玻璃。"},{"english":"Several methods to prevent alkalis from jeopardizing are provided .","chinese":"給出了預防鹼金屬危害的方法。"},{"english":"By two alkyl halide with alkali metal or alkaline earth metal polysulfides from condensation.","chinese":"由二滷代烷與鹼金屬或鹼土金屬的多硫化物縮聚而成。"},{"english":"In this paper a scheme for the laser decelerated alkali metal atomic beam frequency standards is proposed.","chinese":"本文提出一個激光減速的鹼金屬原子束頻標的方案。"},{"english":"With this result, it is convenient to study the highly excited states in the experiments for alkalis.","chinese":"在鹼金屬的實驗中，對高激發態的研究提供了方便。"}],"related":[]}