{"definition":["inconvenient\/troublesome\/annoying\/to trouble or bother sb\/to put sb to trouble"],"pinyin":["ma2 fan5"],"simplified":["麻烦"],"rank":3186.0,"normalized_rank":0.04457627355784702,"fraction":0.000044795424466986815,"cumulative_fraction":0.7993297886289795,"word":"麻煩","characters":[{"definition":["generic name for hemp, flax etc\/hemp or flax fiber for textile materials\/sesame\/CL:縷|缕[lu:3]\/(of materials) rough or coarse\/pocked\/pitted\/to have pins and needles or tingling\/to feel numb","surname Ma"],"pinyin":["Ma2","ma2"],"word":"麻"},{"definition":["to feel vexed\/to bother\/to trouble\/superfluous and confusing\/edgy"],"pinyin":["fan2"],"word":"煩"}],"containing_words":[{"definition":["to look for trouble"],"pinyin":["zhao3 ma2 fan5"],"word":"找麻煩"},{"definition":["to ask for trouble\/to invite difficulties"],"pinyin":["zi4 zhao3 ma2 fan5"],"word":"自找麻煩"},{"definition":["to create difficulties\/to invite trouble\/to be troublesome"],"pinyin":["re3 ma2 fan5"],"word":"惹麻煩"},{"definition":["to cause trouble for sb\/to inconvenience"],"pinyin":["tian1 ma2 fan5"],"word":"添麻煩"}],"sentences":[{"english":"Hunting without a license will land you in trouble.","chinese":"無證狩獵將會使你陷入麻煩。"},{"english":"Trouble develops, however, when any human instinct or appetite causes overdeveloped.","chinese":"但假使人的欲求或喜好過度膨脹則會帶來麻煩。"},{"english":"Most administrators think of paging as something that is onerous.","chinese":"大多數管理員都認爲分頁是一件很麻煩的事情。"},{"english":"Why she’s a spicy dish: Shilpa has the best of intentions but trouble always seems to find her.","chinese":"希爾帕雖是一片好心，但麻煩總是找上她。"},{"english":"He has had a bit of trouble, and I have to straighten it out for him.","chinese":"他遇到了點兒麻煩，我得替他把這事了結掉。"},{"english":"From that day forward he never bothered me again.","chinese":"從那天起，他再也沒找過我的麻煩。"},{"english":"Julia is afraid she will embarrass herself and the whole team.","chinese":"茱麗雅害怕自己將舞蹈隊帶來麻煩甚至搞砸。"},{"english":"The Box Hill line, causing trouble for Zhao Yingxiong.","chinese":"匣子上山一行，爲趙英雄帶來了麻煩。"},{"english":"To tell you the truth, when I have trouble, I always ask her for advice.","chinese":"跟你說老實話，每當我有麻煩時總向她徵求意見。"},{"english":"At once I stood up and said it was too inconvenient, I then walked quickly to follow him.","chinese":"我立即起身說那太麻煩了，就疾步跟過去。"},{"english":"much to worry about; they always make trouble for you.","chinese":"事要操心，還老是惹麻煩給你。"},{"english":"That means you will have a little bit of trig to do in the integral.","chinese":"這意味着，在積分的時候會遇到一點小麻煩。"},{"english":"I will answer for it that we shall find no inconvenience from narrow roads on Wednesday.","chinese":"我敢保險，禮拜三我們不會因爲路窄遇到什麼麻煩。"},{"english":"John and Jack went through many troubles together to become foul weather friends.","chinese":"約翰和傑克經歷了許多麻煩，一起成爲患難之交。"},{"english":"I've caused much bother by lossing my ticket.","chinese":"我因爲丟了票引起了很多麻煩。"},{"english":"14-8 And trouble for me it'll be, fighting every day until I die.","chinese":"我的麻煩是每天奮鬥直到生命結束。"}],"related":[{"definition":["only\/merely\/no more than\/but\/however\/anyway (to get back to a previous topic)\/cannot be more (after adjectival)"],"pinyin":["bu4 guo4"],"word":"不過"},{"definition":["anxious\/worried\/uneasy\/to worry\/to be anxious"],"pinyin":["dan1 xin1"],"word":"擔心"},{"definition":["to help\/to lend a hand\/to do a favor\/to do a good turn"],"pinyin":["bang1 mang2"],"word":"幫忙"},{"definition":["if (coming after a conditional clause)"],"pinyin":["de5 hua4"],"word":"的話"},{"definition":["after all\/all in all\/when all is said and done\/in the final analysis"],"pinyin":["bi4 jing4"],"word":"畢竟"},{"definition":["as one wishes\/as one pleases\/at random\/negligent\/casual\/wanton"],"pinyin":["sui2 bian4"],"word":"隨便"},{"definition":["there is nothing to be done\/one can't do anything about it"],"pinyin":["mei2 ban4 fa3"],"word":"沒辦法"},{"definition":["to say again\/to put off a discussion until later\/moreover\/what's more\/besides"],"pinyin":["zai4 shuo1"],"word":"再說"},{"definition":["in a word\/in short\/in brief"],"pinyin":["zong3 zhi1"],"word":"總之"},{"definition":["actually\/in fact\/really"],"pinyin":["qi2 shi2"],"word":"其實"},{"definition":["to help\/to assist\/to support\/for sb (i.e. as a help)\/hired (as worker)\/side (of pail, boat etc)\/outer layer\/upper (of a shoe)\/group\/gang\/clique\/party\/secret society"],"pinyin":["bang1"],"word":"幫"},{"definition":["sometimes\/now and then"],"pinyin":["you3 shi2"],"word":"有時"},{"definition":["improbable\/unlikely\/will not (act, happen etc)\/not able\/not having learned to do sth\/(coll.) (Tw) don't mention it\/not at all"],"pinyin":["bu4 hui4"],"word":"不會"},{"definition":["question\/problem\/issue\/topic\/CL:個|个[ge4]"],"pinyin":["wen4 ti2"],"word":"問題"},{"definition":["ought to\/should\/must"],"pinyin":["ying1 gai1"],"word":"應該"},{"definition":["because\/owing to\/on account of"],"pinyin":["yin1 wei4"],"word":"因為"}]}