{"definition":["ephedrine"],"pinyin":["ma2 huang2 su4"],"simplified":["麻黄素"],"rank":40043.0,"normalized_rank":0.5602535223091237,"fraction":3.836292033931577e-7,"cumulative_fraction":0.9965052087562392,"word":"麻黃素","characters":[{"definition":["generic name for hemp, flax etc\/hemp or flax fiber for textile materials\/sesame\/CL:縷|缕[lu:3]\/(of materials) rough or coarse\/pocked\/pitted\/to have pins and needles or tingling\/to feel numb","surname Ma"],"pinyin":["Ma2","ma2"],"word":"麻"},{"definition":["surname Huang or Hwang","yellow\/pornographic\/to fall through"],"pinyin":["Huang2","huang2"],"word":"黃"},{"definition":["raw silk\/white\/plain, unadorned\/vegetarian (food)\/essence\/nature\/element\/constituent\/usually\/always\/ever"],"pinyin":["su4"],"word":"素"}],"containing_words":[],"sentences":[{"english":"The State practices monopoly for the purchase and marketing of ephedrine.","chinese":"國家對麻黃素實行統購統銷。"},{"english":"Strengthening ephedrine management control.","chinese":"加強麻黃素的經營管理。"},{"english":"Standardizing control over ephedrine use.","chinese":"規範麻黃素的使用管理。"},{"english":"Speculation and transfer of certificates for ephedrine purchase and use shall be prohibited.","chinese":"禁止倒賣和轉讓麻黃素購用證明。"},{"english":"No unit or individual without appointment shall operate ephedrine business.","chinese":"未經指定的任何單位和個人，不得經營麻黃素業務。"},{"english":"The State practices license control system for the export of ephedrine.","chinese":"國家對麻黃素的出口實行許可證管理制度。"},{"english":"No ephedrine shall be imported any more under any circumstances as of the date of issuance of this Circular.","chinese":"從本通知下發之日起，一律不再進口麻黃素。"},{"english":"Departments of public health must enhance control over prescribed ephedrine preparations.","chinese":"衛生部門要加強對麻黃素單方製劑的管理。"},{"english":"Speculation and transfer of ephedrine export licenses and certificates of purchase and use for export are prohibited.","chinese":"禁止倒賣和轉讓麻黃素出口許可證和出口購用證明。"},{"english":"He was found to have traces of the banned substance, ephedrine, in his blood stream.","chinese":"在他的血液中發現有違禁物質麻黃素的跡象。"}],"related":[]}