{"definition":["ephedrine"],"pinyin":["ma2 huang2 jian3"],"simplified":["麻黄碱"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"麻黃鹼","characters":[{"definition":["generic name for hemp, flax etc\/hemp or flax fiber for textile materials\/sesame\/CL:縷|缕[lu:3]\/(of materials) rough or coarse\/pocked\/pitted\/to have pins and needles or tingling\/to feel numb","surname Ma"],"pinyin":["Ma2","ma2"],"word":"麻"},{"definition":["surname Huang or Hwang","yellow\/pornographic\/to fall through"],"pinyin":["Huang2","huang2"],"word":"黃"},{"definition":["base\/alkali\/soda (chemistry)"],"pinyin":["jian3"],"word":"鹼"}],"containing_words":[{"definition":["methamphetamine"],"pinyin":["qu4 yang3 ma2 huang2 jian3"],"word":"去氧麻黃鹼"},{"definition":["methamphetamine"],"pinyin":["tuo1 yang3 ma2 huang2 jian3"],"word":"脫氧麻黃鹼"}],"sentences":[{"english":"The methamphetamine \"pervitin\" is one of the most widespread drugs in the area because of ease of availability.","chinese":"脫氧麻黃鹼在當地可以輕易獲得，因而氾濫成災。"},{"english":"In this article a new kind of inclusion complex involving carbenoxolone sodium and pseduoephedrine was synthesized.","chinese":"合成了甘珀酸鈉和右旋麻黃鹼的包合物。"},{"english":"Conclusion Ephedrine injected intravenously can decrease the level of anesthesia .","chinese":"結論靜脈注射麻黃鹼可減淺麻醉深度。"},{"english":"The number of theory plates was not less than 2000 determined by the peaks of Ephedrine hydrochloride.","chinese":"理論板數按鹽痠麻黃鹼峯計算應不低於2000。"},{"english":"Protein precipitation was accomplished by the addition of methanol.","chinese":"血漿樣品用甲醇沉澱蛋白提取鹽痠麻黃鹼。"},{"english":"Some people died because of overtrain and overdosage of Ephedrine.","chinese":"有些人死於因訓練過度和過量的麻黃鹼。"},{"english":"This is the first study large enough to confirm the link that meth kills by causing strokes.","chinese":"這是首個足夠大樣本來確認麻黃鹼與中風關聯的研究。"},{"english":"Aim To determine the Ephedrine Hydrochloride content in Compound Nasal Spray.","chinese":"目的測定複方噴鼻劑中鹽痠麻黃鹼的含量。"},{"english":"Objective To study the action of pseudoephedrine salicylate on the central nervous system of mice.","chinese":"目的瞭解僞麻黃鹼水楊酸對小鼠中樞神經系統的作用。"},{"english":"Two different extraction methods of ephedrine from Herba Ephedrae were compared and analysed.","chinese":"比較分析了從麻黃草中提取麻黃鹼的兩種方法。"}],"related":[]}