{"definition":["pyrite"],"pinyin":["huang2 tie3 kuang4"],"simplified":["黄铁矿"],"rank":61799.0,"normalized_rank":0.8646481888265499,"fraction":3.094725689472962e-8,"cumulative_fraction":0.9998798913603516,"word":"黃鐵礦","characters":[{"definition":["surname Huang or Hwang","yellow\/pornographic\/to fall through"],"pinyin":["Huang2","huang2"],"word":"黃"},{"definition":["iron (metal)\/arms\/weapons\/hard\/strong\/violent\/unshakeable\/determined\/close\/tight (slang)","surname Tie"],"pinyin":["Tie3","tie3"],"word":"鐵"},{"definition":["ore\/mine"],"pinyin":["kuang4"],"word":"礦"}],"containing_words":[],"sentences":[{"english":"The induced-flotation behavior of chalcopyrite and pyrite was investigated.","chinese":"考察了黃銅礦和黃鐵礦的誘導浮選行爲。"},{"english":"The Pyrite is one of main typomorphic characteristic of W-Sb-Au deposits series of western Hunan.","chinese":"黃鐵礦是湘西鎢銻金礦牀系列的主要標型礦物之一。"},{"english":"The pyroelectricity characteristics of pyrite can be used as the indicators for prospecting of gold deposit.","chinese":"黃鐵礦的熱電性特徵可作爲金礦的找礦標誌。"},{"english":"The pulp concentration has effect on the leaching rate of pyrrhotite and marmatite.","chinese":"礦漿濃度對磁黃鐵礦和鐵閃鋅礦的細菌浸出有影響。"},{"english":"After the pyrolysis coking process, the pyrrhotite was the main form of the catalyst residual.","chinese":"經過熱解制焦後，催化劑殘留的主要形態是磁黃鐵礦。"},{"english":"These minerals serve as indicators of pyrites related to gold mineralization.","chinese":"黃鐵礦是主要的載金礦物。"},{"english":"It was proved there existed the direct effect when pyrrhotite was leached by thiobacillus ferrooxidans.","chinese":"生物浸出磁黃鐵礦的過程中存在細菌的直接作用。"},{"english":"This paper deals firstly with the distribution of pyrites in coals.","chinese":"首先揭示了煤中黃鐵礦的分佈賦存規律。"},{"english":"The Na 2S-induced flotation behavior of chalcopyrite and pyrite has been investigated.","chinese":"本文研究了黃銅礦，黃鐵礦的硫化鈉誘導浮選行爲。"},{"english":"Pyrite occuritig in the Mashan magnetite-pyrite deposit is a common mineral of hydrothermal process.","chinese":"馬山鐵硫礦牀中黃鐵礦爲熱液作用下的常見礦物。"},{"english":"The rate of oxidation reaction of pyrites increased.","chinese":"黃鐵礦的氧化速率增大。"},{"english":"The adsorption process of xanthate on the surfaces of arsenopyrite and pyrite was studied.","chinese":"研究了毒砂和黃鐵礦表面吸附黃藥的過程。"},{"english":"The gold bearing minerals of Zimudang gold deposit are mainly arsenic bearing pyrite and arsenopyrite.","chinese":"紫木凼金礦牀主要載金礦物爲含砷黃鐵礦和毒砂。"},{"english":"Pyrite and quartz are the main gold bearing minerals in Daqingling gold deposit.","chinese":"黃鐵礦和石英是大慶嶺金礦的主要載金礦物。"},{"english":"Pyrite-bearing sulfide quartz veins are favourable prospecting criteria.","chinese":"含黃鐵礦硫化物石英脈是有利的找礦標誌。"},{"english":"Why does pyrite have such a strong capacity of adsorbing nanometer sized gold?","chinese":"爲什麼黃鐵礦對納米金的吸附作用強？"}],"related":[]}