{"definition":["Chinese goldthread (Coptis chinensis), rhizome used in medicine"],"pinyin":["huang2 lian2"],"simplified":["黄连"],"rank":30585.0,"normalized_rank":0.4279238313768836,"fraction":8.952807855442301e-7,"cumulative_fraction":0.9907793125429009,"word":"黃連","characters":[{"definition":["surname Huang or Hwang","yellow\/pornographic\/to fall through"],"pinyin":["Huang2","huang2"],"word":"黃"},{"definition":["surname Lian","to link\/to join\/to connect\/continuously\/in succession\/including\/(used with 也[ye3], 都[dou1] etc) even\/company (military)"],"pinyin":["Lian2","lian2"],"word":"連"}],"containing_words":[{"definition":["no choice but to suffer in silence (idiom)\/also written 啞巴吃黃蓮|哑巴吃黄莲\/(often precedes 有苦說不出|有苦说不出[you3 ku3 shuo1 bu5 chu1])"],"pinyin":["ya3 ba5 chi1 huang2 lian2"],"word":"啞巴吃黃連"},{"definition":["to be forced to suffer in silence (idiom)\/unable to speak of one's bitter suffering\/sometimes written 啞子吃黃連，有苦說不出|哑子吃黄连，有苦说不出"],"pinyin":["ya3 ba5 chi1 huang2 lian2 , you3 ku3 shuo1 bu5 chu1"],"word":"啞巴吃黃連，有苦說不出"}],"sentences":[{"english":"Quantitative analysis on different proportions of couple of Coptis and Scute.","chinese":"對黃連與黃芩的不同比例配伍進行定量研究。"},{"english":"ObjectiveTo optimize the extraction technology of Huanglian Jiedu Decoction.","chinese":"目的選擇黃連解毒湯方藥的提取工藝。"},{"english":"Objective To investigate the allergic reaction of Shuanghuanglian Injection(SI)and chlorogenic acid.","chinese":"目的觀察綠原酸和注射用雙黃連的致敏性。"},{"english":"Rhizoma coptidis was extracted with water, and silk fabrics were dyed with the extract.","chinese":"用水提取黃連並用該提取液對絲綢進行染色。"},{"english":"OBJECTIVE To determine the chlorogenic acid contents in Shuanghuanglian oral solution.","chinese":"目的測定雙黃連口服液中綠原酸的含量。"},{"english":"The content of oil in the seeds is high, which is good material for bio-diesel oil.","chinese":"黃連木種子含油率高，是生產生物柴油的好原料。"},{"english":"The primary active ingredienn are berberine and hydrastine alkaloids, among others.","chinese":"非洲防已鹼是一種與黃連素聯繫密切的生物鹼。"},{"english":"Conclusion Berberine has good cure effect on metabolism syndrome.","chinese":"結論黃連素治療代謝綜合症有較好的療效。"},{"english":"To optimize the best technique for preparation of Shuanghuanglian(double coptis chinensis) Dripping Pill and to determine its dissolution limit.","chinese":"優選雙黃連滴丸的最佳製備工藝並進行溶出時限檢查。"},{"english":"The method can be used for quality control of Huanglian Yanggan Pills.","chinese":"可用於控制黃連羊肝丸的質量。"},{"english":"Objectiv To evaluate the effect of the Shuang Huanglian inhaled in the gasping pneumonia.","chinese":"目的評價雙黃連霧化吸入對喘憋性肺炎的療效。"},{"english":"Berberine (Ber), an isoquinoline-type alkaloid, has significant antibacterial effect.","chinese":"黃連素屬於異喹啉生物鹼，具有顯著的抗菌作用。"},{"english":"The experimental group was treated with coptis chinensis compound while the control group was only perfused with sterile water.","chinese":"實驗組灌喂複方黃連，對照組裸鼠僅灌喂無菌水。"},{"english":"SYNOPSIS: Guyanling is a composite Chinese medicine made up of Coptis chinensis Franch, and some other herbs.","chinese":"骨炎靈是由黃連等中藥組成的複方製劑。"},{"english":"The seeds of Coptis chinensis need stratification to break dormancy.","chinese":"黃連種子需要在低溫條件下才能解除休眠。"},{"english":"Sister is already dumb, and it still fails I eat Coptis?","chinese":"姐經已係啞巴咗，唔通還得食黃連唔成？"}],"related":[{"definition":["variant of 黃檗|黄檗[huang2 bo4]"],"pinyin":["huang2 bo4"],"word":"黃柏"},{"definition":["dwarf lilyturf (Ophiopogon japonicus), its tuber used in TCM"],"pinyin":["mai4 dong1"],"word":"麥冬"},{"definition":["dried ginger"],"pinyin":["gan1 jiang1"],"word":"乾薑"},{"definition":["bezoar"],"pinyin":["niu2 huang2"],"word":"牛黃"},{"definition":["liquorice (Sophora flavescens), with roots used in TCM"],"pinyin":["ku3 shen1"],"word":"苦參"},{"definition":["black atractylodes rhizome (dried rhizome of any of several atractylodes species) (TCM)"],"pinyin":["cang1 zhu2"],"word":"蒼術"},{"definition":["monk fruit, the sweet fruit of Siraitia grosvenorii, a vine of the Curcubitaceae family native to southern China and northern Thailand, used in Chinese medicine"],"pinyin":["luo2 han4 guo3"],"word":"羅漢果"},{"definition":["sore\/skin ulcer"],"pinyin":["chuang1 yang2"],"word":"瘡瘍"},{"definition":["ladybell root (Radix adenophorae)"],"pinyin":["sha1 shen1"],"word":"沙參"},{"definition":["plantain herb (Plantago asiatica)"],"pinyin":["che1 qian2 cao3"],"word":"車前草"},{"definition":["mole cricket\/Gryllolaptaptidae, family of burrowing insects of order Orthoptera (a serious agricultural pest)"],"pinyin":["lou2 gu1"],"word":"螻蛄"},{"definition":["Ningpo figwort (Scrophularia ningpoensis)\/root of Ningpo figwort (used in TCM)"],"pinyin":["xuan2 shen1"],"word":"玄參"},{"definition":["dodder (Cuscuta sinensis, a parasitic vine with seeds used in medicine)"],"pinyin":["tu4 si1 zi3"],"word":"菟絲子"},{"definition":["King Solomon's seal (plant of genus Polygonatum)"],"pinyin":["huang2 jing1"],"word":"黃精"},{"definition":["cicada slough\/fig. to free oneself\/to extricate oneself from"],"pinyin":["chan2 tui4"],"word":"蟬蛻"},{"definition":["turtle shell"],"pinyin":["bie1 jia3"],"word":"鱉甲"}]}