{"definition":["jute (Corchorus capsularis Linn.)\/plant fiber used for rope or sacks"],"pinyin":["huang2 ma2"],"simplified":["黄麻"],"rank":46817.0,"normalized_rank":0.6550305709848474,"fraction":1.9896750541281354e-7,"cumulative_fraction":0.9984166342552188,"word":"黃麻","characters":[{"definition":["surname Huang or Hwang","yellow\/pornographic\/to fall through"],"pinyin":["Huang2","huang2"],"word":"黃"},{"definition":["generic name for hemp, flax etc\/hemp or flax fiber for textile materials\/sesame\/CL:縷|缕[lu:3]\/(of materials) rough or coarse\/pocked\/pitted\/to have pins and needles or tingling\/to feel numb","surname Ma"],"pinyin":["Ma2","ma2"],"word":"麻"}],"containing_words":[],"sentences":[{"english":"Which hatch does the shortage of the jute come out of?","chinese":"黃麻短卸是從哪個艙出來的？"},{"english":"Jute uprise is banner of brightness of one side of viatic of success of exploration China revolution.","chinese":"黃麻起義是探索中國革命成功道路的一面光輝旗幟。"},{"english":"Compared with jute and Brown linen, sisal carpets can be frequently used.","chinese":"與黃麻和棕麻相比，劍麻地毯可頻繁使用。"},{"english":"It is uselessly laden with jute, and has been lying there idle for ever so long.","chinese":"它無用的載着黃麻，停靠在那兒已經很久了。"},{"english":"The characters of jute fibers, and its industrial development in recent years were presented in this paper.","chinese":"介紹了黃麻的性能和近年來的產業發展情況。"},{"english":"Objective To evaluate the identification methods for Trema rientalis(L. ) BL.","chinese":"目的建立山黃麻生藥鑑定的方法。"},{"english":"Huangma soil on the plain is the main cultivated soil on the Loess Plateau.","chinese":"塬地黃麻土是黃土高原的主要土種。"},{"english":"As one of natural fibers, jute is grabbing more attention for its unique advantages.","chinese":"黃麻作爲天然纖維的一種，其優勢也正日益引起關注。"},{"english":"Jute detail lines midsole for a breezy finish.","chinese":"一個涼風習習的完成爲底的黃麻詳細線。"},{"english":"Rafael Benitez has poured scorn on speculation that Xabi Alonso could be offloaded to Real Madrid.","chinese":"拉法貝尼特斯對阿隆索可能轉會去黃麻表示不屑一顧。"},{"english":"It is uselessly laden with jute, and has been idle for ever so long.","chinese":"船上裝滿了無用的黃麻，一直就閒置在那裏。"}],"related":[]}