{"definition":["ferrous metals (i.e. iron, chromium, manganese and alloys containing them)"],"pinyin":["hei1 se4 jin1 shu3"],"simplified":["黑色金属"],"rank":29335.0,"normalized_rank":0.4104347096106222,"fraction":9.974651243475824e-7,"cumulative_fraction":0.9895975481830191,"word":"黑色金屬","characters":[{"definition":["abbr. for Heilongjiang province 黑龍江|黑龙江[Hei1 long2 jiang1]","black\/dark\/sinister\/secret\/shady\/illegal\/to hide (sth) away\/to vilify\/(loanword) to hack (computing)"],"pinyin":["Hei1","hei1"],"word":"黑"},{"definition":["color\/CL:種|种[zhong3]\/look\/appearance\/sex","color\/dice"],"pinyin":["se4","shai3"],"word":"色"},{"definition":["gold\/chemical element Au\/generic term for lustrous and ductile metals\/money\/golden\/highly respected\/one of the eight categories of ancient musical instruments 八音[ba1 yin1]","surname Jin\/surname Kim (Korean)\/Jurchen Jin dynasty (1115-1234)"],"pinyin":["Jin1","jin1"],"word":"金"},{"definition":["category\/genus (taxonomy)\/family members\/dependents\/to belong to\/subordinate to\/affiliated with\/be born in the year of (one of the 12 animals)\/to be\/to prove to be\/to constitute","to join together\/to fix one's attention on\/to concentrate on"],"pinyin":["shu3","zhu3"],"word":"屬"}],"containing_words":[],"sentences":[{"english":"This black metal plate is called a collector.","chinese":"這塊黑色金屬板被稱爲集熱器。"},{"english":"Suitable for welding ferrous metal workpiece with general AC electrode.","chinese":"適合焊接黑色金屬工件與一般交流電極。"},{"english":"The ferrous metals can be classified into steels, cast irons, and wrought irons.","chinese":"黑色金屬可分爲鋼，鑄鐵和熟鐵。"},{"english":"Ferrous Metal Foundries Industry in the U. S.","chinese":"美國黑色金屬鑄造業。"},{"english":"It should sound something like a black metal raspy voice.","chinese":"這聽起來應該像黑色金屬的刺耳聲音。"},{"english":"It can be applied to determine the Brinell hardness for ferrous metal and non-ferrous metal.","chinese":"適用於黑色金屬，有色金屬的布氏硬度測定。"},{"english":"Carbon is found in almost all ferrous metals.","chinese":"幾乎所有的黑色金屬中都含有碳。"},{"english":"The experimental results show that chemical wear is dominant in diamond cutting of ferrous metals.","chinese":"化學磨損在金剛石刀具切削黑色金屬時占主導地位。"},{"english":"Ferrous & Non-Ferrous Metals, Natural Rubber, Latex and Synthetic Rubber.","chinese":"有色與黑色金屬，天然橡膠，乳膠。"},{"english":"Think of it as freedom of choice wrapped in black sheet-metal.","chinese":"是否要裹黑色金屬片你自主選擇。"},{"english":"Light stability, in the presence of organic matter reduction of the vulnerability of black metallic silver .","chinese":"在有機物存在時易被還原爲黑色金屬銀。"}],"related":[]}