{"definition":["to point out\/to indicate"],"pinyin":["dian3 chu1"],"simplified":["点出"],"rank":23871.0,"normalized_rank":0.33398626054594044,"fraction":0.000001639912660166946,"cumulative_fraction":0.9825281560774471,"word":"點出","characters":[{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"},{"definition":["to go out\/to come out\/to occur\/to produce\/to go beyond\/to rise\/to put forth\/to happen\/(used after a verb to indicate an outward direction or a positive result)\/classifier for dramas, plays, operas etc"],"pinyin":["chu1"],"word":"出"}],"containing_words":[],"sentences":[{"english":"The class should have begun at 1:15, but the professor was half an hour late.","chinese":"課本應該在1點出15分開始，但教授遲到了半小時。"},{"english":"You call me later how come out walk ?","chinese":"叫我以後點出嚟行？"},{"english":"Is there anyone cool enough to point out these people's names?","chinese":"有沒有那位牛友能點出這些人的名字啊？"},{"english":"To point a moral, or adorn a tale.","chinese":"爲了點出一個寓意，或者點綴一則故事。"},{"english":"At last, epilog point out real life meaning and negative-said influence.","chinese":"結語點出了崇陶的現實意義及負面影響。"},{"english":"It's the one day I need to flag for you as one that you may feel tired or less than optimistic.","chinese":"我得點出，這一天你會覺得疲沓或是不甚樂觀。"},{"english":"We don't want you to be able to get all Feral talents and OoC.","chinese":"我們並不希望你能夠點出所有的野性天賦。"},{"english":"The result show that strongest point of stress appear in the top of strengthen board on back bend beam.","chinese":"結果顯示應力最大點出現在後彎梁加強板上端部。"}],"related":[]}