{"definition":["to ignite\/to light a fire\/to agitate\/to start an engine\/ignition\/fig. to stir up trouble"],"pinyin":["dian3 huo3"],"simplified":["点火"],"rank":12014.0,"normalized_rank":0.16809144711989146,"fraction":0.000006097631451649769,"cumulative_fraction":0.9440059872852098,"word":"點火","characters":[{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"},{"definition":["fire\/urgent\/ammunition\/fiery or flaming\/internal heat (Chinese medicine)\/hot (popular)\/classifier for military units (old)\/Kangxi radical 86","surname Huo"],"pinyin":["Huo3","huo3"],"word":"火"}],"containing_words":[{"definition":["ignition switch"],"pinyin":["dian3 huo3 kai1 guan1"],"word":"點火開關"}],"sentences":[{"english":"These ignition wires send the charge to each spark plug.","chinese":"這些點火導線將電荷運送至每個火花塞。"},{"english":"The survey principle of a magneto ignition system ignition advance angle was introduced.","chinese":"本文介紹了磁電機點火系統的點火提前角測量原理。"},{"english":"The survey principle of a magneto ignition system ignition advance angle was introduced.","chinese":"本文介紹了磁電機點火系統的點火提前角測量原理。"},{"english":"The performance is optimized by using a pyrotechnic igniter as described in the Igniter web page.","chinese":"性能優化，使用煙火點火器中所述的引爆器的網頁。"},{"english":"A fire could be lit under the vat in winter to stop the water from freezing.","chinese":"在大缸下面是可以點火的爲了防止水冬天結冰。"},{"english":"Preventive measures in industry include inerting and elimination of ignition sources.","chinese":"工業預防措施包括惰化和消除點火源。"},{"english":"This system can be extended to realize the multi-center data acquisition, and the measurement of many-headed ignition coil.","chinese":"將此係統進行擴展可實現多頭點火線圈的測試。"},{"english":"An expendable jet perforating gun with large horizontal firing charges.","chinese":"帶有水平點火大射孔彈的消毀式聚能射孔槍。"},{"english":"A new ignition system where a two layered centre core ignition system having a pyrotechnic composition is given.","chinese":"介紹一種帶煙火劑雙層中心點火管的新型點火系統。"},{"english":"A new ignition system where a two layered centre core ignition system having a pyrotechnic composition is given.","chinese":"介紹一種帶煙火劑雙層中心點火管的新型點火系統。"},{"english":"Hydrogen is easily ignited by heat, open flames, electrical sparks, and static electricity.","chinese":"電系統爲點火，喇叭，燈光，發熱器和起動器提供電。"},{"english":"Place ignition switch into openings on steering column.","chinese":"放置點火開關至打開的轉向柱上。"},{"english":"Kurt watched the Pelicans fire their jets and scorch the grass.","chinese":"庫爾特看着鵜鶘運兵船點火，它們的噴焰把草燒焦。"},{"english":"Above, an artist's conception of the Space Launch System blasting off.","chinese":"圖中，藝術家設想的太空發射系統點火升空了。"},{"english":"Disconnect the secondary spark plug cable from the ignition coil.","chinese":"從點火線圈上拆下輔助火星塞電纜。"},{"english":"I will prepare the other bull and put it on the wood but not set fire to it.","chinese":"我也預備一隻牛犢放在柴上，也不點火。"}],"related":[{"definition":["to discharge smoke\/to fume with rage"],"pinyin":["mao4 yan1"],"word":"冒煙"},{"definition":["lighter\/cigarette lighter"],"pinyin":["da3 huo3 ji1"],"word":"打火機"},{"definition":["the fire of a stove"],"pinyin":["lu2 huo3"],"word":"爐火"},{"definition":["to ignite\/to combust\/to burn\/combustion\/flaming"],"pinyin":["ran2 shao1"],"word":"燃燒"},{"definition":["see 鍋|锅[guo1]\/see 涮鍋子|涮锅子[shuan4 guo1 zi5]\/bowl (of a smoking pipe etc)"],"pinyin":["guo1 zi5"],"word":"鍋子"},{"definition":["to start\/to set in motion\/to move\/to march\/to dig in (eating)\/to tuck in (eating)"],"pinyin":["kai1 dong4"],"word":"開動"},{"definition":["to manufacture charcoal\/to burn charcoal (often a reference to suicide by carbon monoxide poisoning)"],"pinyin":["shao1 tan4"],"word":"燒炭"},{"definition":["to stop burning\/to go out (of fire)\/to die out\/extinguished"],"pinyin":["xi1 mie4"],"word":"熄滅"},{"definition":["at the scene\/on the spot"],"pinyin":["dang1 chang3"],"word":"當場"},{"definition":["to set about (a task)\/to hit\/to punch\/to touch"],"pinyin":["dong4 shou3"],"word":"動手"},{"definition":["boiler"],"pinyin":["guo1 lu2"],"word":"鍋爐"},{"definition":["to rotate (about an axis)\/to revolve\/to turn\/to move in a circle\/to gyrate","to turn sth around\/to swivel"],"pinyin":["zhuan3 dong4","zhuan4 dong4"],"word":"轉動"},{"definition":["to heat"],"pinyin":["jia1 re4"],"word":"加熱"},{"definition":["to attempt\/to try\/attempt\/CL:種|种[zhong3]"],"pinyin":["qi3 tu2"],"word":"企圖"},{"definition":["smoke\/mist\/vapor\/smog\/fumes"],"pinyin":["yan1 wu4"],"word":"煙霧"},{"definition":["to shoot (a projectile)\/to fire (a rocket)\/to launch\/to emit (a particle)\/to discharge\/emanation\/emission"],"pinyin":["fa1 she4"],"word":"發射"}]}