{"definition":["spot welding"],"pinyin":["dian3 han4"],"simplified":["点焊"],"rank":54520.0,"normalized_rank":0.7628055349572566,"fraction":8.641875510226385e-8,"cumulative_fraction":0.9994730140520564,"word":"點焊","characters":[{"definition":["point\/dot\/drop\/speck\/o'clock\/point (in space or time)\/to draw a dot\/to check on a list\/to choose\/to order (food in a restaurant)\/to touch briefly\/to hint\/to light\/to ignite\/to pour a liquid drop by drop\/(old) one fifth of a two-hour watch 更[geng1]\/dot stroke in Chinese characters\/classifier for items"],"pinyin":["dian3"],"word":"點"},{"definition":["to weld\/to solder"],"pinyin":["han4"],"word":"焊"}],"containing_words":[],"sentences":[{"english":"Microstructure of spot-welded joints are mainly composed of equiaxial grains.","chinese":"點焊接頭的金相組織主要由等軸晶構成。"},{"english":"Can you spot weld a tube to a sheet metal？","chinese":"你能把一個鋼管點焊到鋼板上嗎？"},{"english":"Minimum of three tack welds.","chinese":"最少有三個點焊。"},{"english":"The test study is carried out difficultly because of the transient in aluminum alloy RSW.","chinese":"鋁合金電阻點焊的瞬時性給試驗研究帶來了困難。"},{"english":"The hot rinse assemblies are tack welded to the tray rim to keep them from moving.","chinese":"沖洗槽熱水槽被點焊在混凝土板邊緣防止其移動。"},{"english":"At same time, RSW quality judgment and classification can be implemented using statistic analysis.","chinese":"進而利用統計分析可以實現點焊質量判定與分類。"},{"english":"Spot welding requires both an electric current and a forging pressure to produce the weld.","chinese":"點焊需要電流及鍛壓來產生焊縫。"},{"english":"A Review of the Application of Invert Technology to the Resistance Spot Welding;","chinese":"設計了一種新型的電流型控制的逆變點焊機。"},{"english":"Reducing welding current and weld time were found to reduce electrode sticking.","chinese":"電極粘附力隨點焊電流和點焊時間的減小而下降。"},{"english":"Reducing welding current and weld time were found to reduce electrode sticking.","chinese":"電極粘附力隨點焊電流和點焊時間的減小而下降。"},{"english":"A new current control resistance welder with inversion is designed.","chinese":"設計了一種新型的電流型控制的逆變點焊機。"},{"english":"The performance of the new developed automatic spot welding machine for tantalum block queuing has been greatly enhanced.","chinese":"新研製的鉭芯自動成排點焊機性能有了很大提高。"},{"english":"Consequently, the technique of prolonging the electrode life of aluminum alloy spot welding is of reality significance.","chinese":"因此研究鋁合金點焊電極的延壽技術至關重要。"},{"english":"This paper discusses the source of heat for spot welding and the theory of diffusion welding of brass and red copper.","chinese":"探討了點焊熱量的來源和黃銅與紫銅的擴散焊機理。"}],"related":[]}