{"definition":["flourishing period\/golden age"],"pinyin":["ding3 sheng4 shi2 qi1"],"simplified":["鼎盛时期"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"鼎盛時期","characters":[{"definition":["ancient cooking cauldron with two looped handles and three or four legs\/pot (dialect)\/to enter upon a period of (classical)\/Kangxi radical 206\/one of the 64 hexagrams of the Book of Changes"],"pinyin":["ding3"],"word":"鼎"},{"definition":["flourishing\/vigorous\/magnificent\/extensively","surname Sheng","to hold\/to contain\/to ladle\/to pick up with a utensil"],"pinyin":["Sheng4","cheng2","sheng4"],"word":"盛"},{"definition":["o'clock\/time\/when\/hour\/season\/period","surname Shi"],"pinyin":["Shi2","shi2"],"word":"時"},{"definition":["a period of time\/phase\/stage\/classifier for issues of a periodical, courses of study\/time\/term\/period\/to hope\/Taiwan pr. [qi2]"],"pinyin":["qi1"],"word":"期"}],"containing_words":[],"sentences":[{"english":"The Qing Dynasty is the Anhui local chronicle development prosperous time.","chinese":"清代是安徽方誌發展的鼎盛時期。"},{"english":"1912 - 1937 was the peak period of Jiangnan Dockyard in the history of old China.","chinese":"1937年是江南造船所在舊中國歷史上的鼎盛時期。"},{"english":"The aging athlete's heyday is over.","chinese":"這個老運動員的鼎盛時期結束了。"},{"english":"The victory opened the period of great prosperity for Liubei.","chinese":"漢中爭奪戰的勝利，開啓了劉備事業的鼎盛時期。"},{"english":"The great days of Hollywood have become legendry .","chinese":"好萊塢鼎盛時期成了神話。"},{"english":"In the middle of Yuan Dynasty, the terracotta technology in CiZao reached its peak.","chinese":"元朝中葉，磁竈製陶技術達到鼎盛時期。"},{"english":"Jungar-Russian relationship during prosperity of Khan Kingdom of Jungar will be discussed.","chinese":"第三章論述了準噶爾汗國鼎盛時期的準俄關係。"},{"english":"Traditional printing of woodcut developed its flouring at Ming Dynasty.","chinese":"傳統版畫在明代發展到了鼎盛時期。"},{"english":"What if this moment right now is the pinnacle of our life?","chinese":"如果現在就是我們人生的鼎盛時期，情況會怎麼樣呢？"},{"english":"Tang Dynasty, a Chinese Buddhism statue prosperous time.","chinese":"唐代，一箇中國佛教造像的鼎盛時期。"},{"english":"Tang Dynasty was a period of full boom of the chant poems on chivalry.","chinese":"唐代是詠俠詩的繁榮鼎盛時期。"},{"english":"The Tang Dynasty was the most magnificent period in feudal society.","chinese":"唐朝是封建社會的鼎盛時期。"},{"english":"At his peak, he was able to produce up to 100 brooms a day.","chinese":"鼎盛時期，他曾經一天製作100多把掃帚。"},{"english":"There are some pictures from the golden age of our team.","chinese":"這有一些我隊鼎盛時期的圖片。"},{"english":"In the heyday of globalisation, small countries were fashionable and prosperous.","chinese":"在全球化鼎盛時期，小國成爲時尚並且興旺發達。"},{"english":"Old-style private education had reached unprecedented heyday in Ming dynasty.","chinese":"私塾教育，在明代發展到了前所未有的鼎盛時期。"}],"related":[]}