{"definition":["a forced draft (of wind, for smelting metal)\/blast (in blast furnace)\/bellows\/to draw air using bellows"],"pinyin":["gu3 feng1"],"simplified":["鼓风"],"rank":54092.0,"normalized_rank":0.7568172596644887,"fraction":9.12360167887076e-8,"cumulative_fraction":0.9994350757806318,"word":"鼓風","characters":[{"definition":["drum\/CL:通[tong4],面[mian4]\/to drum\/to strike\/to rouse\/to bulge\/to swell"],"pinyin":["gu3"],"word":"鼓"},{"definition":["wind\/news\/style\/custom\/manner\/CL:陣|阵[zhen4],絲|丝[si1]"],"pinyin":["feng1"],"word":"風"}],"containing_words":[{"definition":["bellows\/ventilator\/air blower"],"pinyin":["gu3 feng1 ji1"],"word":"鼓風機"},{"definition":["a blast furnace (in modern times)\/a draft assisted furnace for smelting metals"],"pinyin":["gu3 feng1 lu2"],"word":"鼓風爐"},{"definition":["hydraulic bellows\/water-driven ventilation (for metal smelting furnace)"],"pinyin":["shui3 li4 gu3 feng1"],"word":"水力鼓風"}],"sentences":[{"english":"The function of the fire-blower of old times was similar to that of an air-blower now.","chinese":"以前吹火筒的功能就類似於現在的鼓風機。"},{"english":"Blasting gas stove with Two Head Stov.","chinese":"燃氣鼓風雙頭雙尾竈。"},{"english":"The paper introduces the nickel smelting blast furnace control system.","chinese":"介紹了某鎳冶煉廠鼓風爐控制系統。"},{"english":"After analyzing, there is the friction trace on the Teflon paster on the fan.","chinese":"經分析，鼓風機的特氟隆貼片上也有摩擦過的痕跡。"},{"english":"Proposals for development of the oxygen-enriched blast technique are made as well.","chinese":"還對發展富氧鼓風技術提出了建議。"},{"english":"The working fundamentals and effects of blower matched governor for mechanized shaft kiln are introduced, and the selection principles of blower are proposed.","chinese":"介紹了機立窯鼓風機調速裝置的工作原理和工作效果。"},{"english":"The same powerful positive displacement blower technology used in large truck mounted vacuums is employed in the SAVE-YOUR-BACK-VAC.","chinese":"吸塵器上還使用了同樣強大的正排量鼓風機技術。"},{"english":"The argon typically acts as a \"shroud\" gas to provide protection to the tuyere.","chinese":"氬主要作爲覆蓋氣體對鼓風口提供保護。"},{"english":"We can extract iron from haematite by heating it with carbon in a blast furnace.","chinese":"我們可以把赤鐵礦和碳在鼓風爐內一起加熱來提取鐵。"},{"english":"Some vacuums have blower features for drying wet horses.","chinese":"一些吸塵器配有專門用來吹乾馬的鼓風機。"},{"english":"These plants would then be burned in blast furnaces in order to eliminate the toxic elements.","chinese":"之後這些植物被投進鼓風爐來消除有毒元素。"},{"english":"The finite element modal analysis of fan axis is discussed.","chinese":"對某鼓風機軸有限元模型進行了模態分析。"},{"english":"Roots blowers are important manufacturing equipments widely used in industrial field.","chinese":"羅茨鼓風機是在工業領域應用十分廣泛的重要設備。"},{"english":"The A\/C unit controls the air temperature and the blower drives the airflow.","chinese":"暖風機控制空氣溫度，鼓風機用來驅動氣流。"},{"english":"The furnace dehumidified blast technology develops with the blowing technique.","chinese":"高爐脫溼鼓風技術隨着噴吹技術的發展而迅速發展。"},{"english":"Coke is used predominantly as a fuel reluctant in the blast furnace.","chinese":"焦炭最初是在鼓風爐裏作爲助燃劑使用。"}],"related":[]}