{"definition":["Qi state of Western Zhou and the Warring states (1122-265 BC), centered in Shandong"],"pinyin":["Qi2 guo2"],"simplified":["齐国"],"rank":32443.0,"normalized_rank":0.4539196619702545,"fraction":7.590836596820473e-7,"cumulative_fraction":0.9923119221587772,"word":"齊國","characters":[{"definition":["(name of states and dynasties at several different periods)\/surname Qi","neat\/even\/level with\/identical\/simultaneous\/all together\/to even sth out"],"pinyin":["Qi2","qi2"],"word":"齊"},{"definition":["country\/nation\/state\/national\/CL:個|个[ge4]","surname Guo"],"pinyin":["Guo2","guo2"],"word":"國"}],"containing_words":[],"sentences":[{"english":"The king of Zhao accpeted the gifts gladly and sent a hundred thousand troops to help Qi.","chinese":"趙王見了禮物十分高興，派了十萬士兵去援助齊國。"},{"english":"One year, there was a great famine in the State of Qi.","chinese":"有一年，齊國發生了特大的饑荒。"},{"english":"Later when the state of qi guanzhong ruler, and cao foam did lu general.","chinese":"後來管仲當了齊國的宰相，而曹沫做了魯國的將軍。"},{"english":"Chu and Qi were only able to compete with them.","chinese":"當時只有楚國和齊國能與之抗衡。"},{"english":"Qi began to  launch the second round of attacks. They beat the drums again.","chinese":"齊國開始發動第二輪進攻，他們重新擂起戰鼓。"},{"english":"The Ji-xia academy was a famous institution of Qi in the Warring States Period.","chinese":"稷下學宮是戰國時期齊國的一所著名學府。"},{"english":"A carpenter called Shijun someday passed by Quyuan, a place in the State of Qi.","chinese":"木匠石君有一天路過齊國一個叫曲轅的地方。"},{"english":"After the foundation of the Qi, salt economy was paid attention to.","chinese":"齊國建立之後，鹽業經濟受到了重點關注。"},{"english":"He uttered the hardship of the mission to Confucius as soon as talk started.","chinese":"沈先生一見面就向孔子傾述這回出使齊國的艱難之處。"},{"english":"There is a big bird which has lived in the palace for three years.","chinese":"齊國有一隻大鳥，棲在王宮的庭院裏依然整整三年了。"},{"english":"Qi is the main currency of the country to use a knife.","chinese":"齊國是使用刀幣的主要國家。"},{"english":"Duke Huan appointed Guan Zhong the chief minister, and yet the state of Qi was not peaceful and orderly.","chinese":"桓公任命管仲作上卿，可是齊國還不太平。"},{"english":"As you know, it is well known how Qi treats missioner.","chinese":"可是你知道齊國對待使節陽奉陰違是出了名的。"},{"english":"Duke Huan bestowed on him the revenues from the commodity tax of Qi for one year, yet the state was not peaceful and orderly.","chinese":"桓公賜給他齊國一年的貨物稅，可是齊國還不太平。"},{"english":"Duke Huan bestowed on him the revenues from the commodity tax of Qi for one year, yet the state was not peaceful and orderly.","chinese":"桓公賜給他齊國一年的貨物稅，可是齊國還不太平。"},{"english":"Recently there appeared two works that mentioned the so-called Qi State bird-worm inscription existing in the Qi bronze wares.","chinese":"近來有兩種論著提到所謂齊國銅器中的鳥蟲書。"}],"related":[{"definition":["Duke Huan of Qi (reigned 685-643 BC), one of the Five Hegemons 春秋五霸"],"pinyin":["Qi2 Huan2 gong1"],"word":"齊桓公"},{"definition":["the state of Chu, one of the most important of the small states contending for power in China between 770 and 223 BC, located around present-day Hubei"],"pinyin":["Chu3 guo2"],"word":"楚國"},{"definition":["the state of Qin, one of the seven states of the Warring States Period (475-220 BC)"],"pinyin":["Qin2 guo2"],"word":"秦國"},{"definition":["Lord Menchang of Qi, Chancellor of Qi and of Wei during the Warring States Period (475-221 BC)"],"pinyin":["Meng4 chang2 jun1"],"word":"孟嘗君"},{"definition":["Linzi district of Zibo city 淄博市[Zi1 bo2 shi4], Shandong"],"pinyin":["Lin2 zi1"],"word":"臨淄"},{"definition":["Lu, vassal state at the time of the Zhou Dynasty 周朝|周朝[Zhou1 chao2], located in the southwest of present-day Shandong 山東|山东[Shan1 dong1], birthplace of Confucius"],"pinyin":["Lu3 guo2"],"word":"魯國"},{"definition":["feudal vassal\/feudal princes, esp. the monarchs (dukes or princes) of the several vassal states 諸侯國|诸侯国 of Zhou during Western Zhou and Spring and Autumn periods 11th-5th century BC\/subordinate warlord\/local official"],"pinyin":["zhu1 hou2"],"word":"諸侯"},{"definition":["Duke Wen of Jin (697-628 BC, reigned 636-628 BC), one of the Five Hegemons 春秋五霸"],"pinyin":["Jin4 Wen2 gong1"],"word":"晉文公"},{"definition":["vassal state"],"pinyin":["zhu1 hou2 guo2"],"word":"諸侯國"},{"definition":["monarch"],"pinyin":["guo2 jun1"],"word":"國君"},{"definition":["posthumous name of the first Han emperor Liu Bang 劉邦|刘邦 (256 or 247-195 BC), reigned 202-195 BC"],"pinyin":["Han4 Gao1 zu3"],"word":"漢高祖"},{"definition":["vassal state"],"pinyin":["feng1 guo2"],"word":"封國"},{"definition":["Zuo Zhuan or Tsochuan, Mr Zuo's Annals or Mr Zuo's commentary on 春秋[Chun1 qiu1], early history c. 400 BC attributed to famous blind historian Zuo Qiuming 左丘明[Zuo3 Qiu1 ming2]"],"pinyin":["Zuo3 Zhuan4"],"word":"左傳"},{"definition":["capital of a country (literary)"],"pinyin":["jing1 shi1"],"word":"京師"},{"definition":["Wei State (407-225 BC), one of the Seven Hero States of the Warring States 戰國七雄|战国七雄\/Wei State or Cao Wei 曹魏 (220-265), the most powerful of the Three Kingdoms"],"pinyin":["Wei4 guo2"],"word":"魏國"},{"definition":["Emperor Wu of the Han dynasty (141-87 BC)"],"pinyin":["Han4 Wu3 di4"],"word":"漢武帝"}]}