{"definition":["gearbox"],"pinyin":["chi3 lun2 xiang1"],"simplified":["齿轮箱"],"rank":-1.0,"normalized_rank":-1.0,"fraction":-1.0,"cumulative_fraction":-1.0,"word":"齒輪箱","characters":[{"definition":["tooth\/CL:顆|颗[ke1]"],"pinyin":["chi3"],"word":"齒"},{"definition":["wheel\/disk\/ring\/steamship\/to take turns\/to rotate\/by turn\/classifier for big round objects: disk, or recurring events: round, turn"],"pinyin":["lun2"],"word":"輪"},{"definition":["box\/trunk\/chest"],"pinyin":["xiang1"],"word":"箱"}],"containing_words":[],"sentences":[{"english":"The faults diagnosis of the gearbox were analyzed by wavelet analysis method.","chinese":"文中主要用小波分析對齒輪箱進行了故障診斷。"},{"english":"Lightnin reducer allows you to change the seal without removing gear driver.","chinese":"維修和更換密封不需要移動萊寧的齒輪箱傳動系統。"},{"english":"Remove transfer case from under vehicle.","chinese":"從車輛下拆卸動力分導齒輪箱。"},{"english":"For frames of machines, gearboxes, valves and pump bodies, machine housings.","chinese":"對於機，齒輪箱，閥門和泵體，機座的框架。"},{"english":"In the paper, the wavelet neural network is applied in fault diagnosis of the gear-box.","chinese":"本文將小波神經網絡應用到齒輪箱故障診斷當中。"},{"english":"Fuel oil purifier overhauled and cleaned, gear case oil renewed.","chinese":"燃油分油機解體清潔，齒輪箱換油。"},{"english":"When the gears are engaged, the crankshaft keeps the car moving.","chinese":"而曲軸，在齒輪箱掛擋時，又使汽車持續運動。"},{"english":"Lubricating transmit device under the lubricator, separated with gear box.","chinese":"伸線部分採用全浸式潤滑，與齒輪箱部分隔離處理。"},{"english":"After gear box is reinstalled, just tighten up the screws and washers with even force.","chinese":"重新安裝齒輪箱將跟螺絲及華司用力平均鎖緊即可。"},{"english":"The different loading sets for four-square power cycling gear-box test stand are described in this paper.","chinese":"介紹了功率封閉齒輪箱試驗檯的各種加載機構。"},{"english":"Transfer case noisy in all drive modes.","chinese":"動力分導齒輪箱在所有驅動模式中發出噪音。"},{"english":"The wings are driven by a crankshaft that is connected to a gearbox.","chinese":"機翼由連接着齒輪箱的機軸驅動。"},{"english":"The encloser trailing bar assembly is arranged behind the gear case assembly.","chinese":"在齒輪箱總成的後面，設置有罩殼拖板總成。"}],"related":[]}