{"definition":["gingivitis"],"pinyin":["yin2 yan2"],"simplified":["龈炎"],"rank":68695.0,"normalized_rank":0.9611321757866608,"fraction":5.4011721938914905e-9,"cumulative_fraction":0.9999910663152008,"word":"齦炎","characters":[{"definition":["gums (of the teeth)","variant of 啃[ken3]"],"pinyin":["ken3","yin2"],"word":"齦"},{"definition":["flame\/inflammation\/-itis"],"pinyin":["yan2"],"word":"炎"}],"containing_words":[{"definition":["gingivitis"],"pinyin":["ya2 yin2 yan2"],"word":"牙齦炎"},{"definition":["gingivitis"],"pinyin":["chi3 yin2 yan2"],"word":"齒齦炎"}],"sentences":[{"english":"Have you ever been treated for gingivitis or periodontitis?","chinese":"您針對牙齦炎或牙周炎治療過嗎？"},{"english":"Looks like gingivitis.","chinese":"看起來像牙齦炎。"},{"english":"Early indications of clinical gingivitis?","chinese":"早期齦炎的臨牀指徵？"},{"english":"Clinical observation on curative effect of compound areca gargle on dental plaque and gingivitis.","chinese":"複方檳榔含漱液對控制菌斑和消除牙齦炎療效觀察。"},{"english":"In medical term, this is called pregnancy gingivitis.","chinese":"在醫學上，這叫做妊娠性牙齦炎。"},{"english":"It also helps relieve toothaches and gingivitis.","chinese":"它還有助於緩解牙痛和齒齦炎。"},{"english":"Objective To observe the effects of microwave on treatment of hyperplastic gingivitis.","chinese":"目的觀察微波治療纖維增生性齦炎效果。"},{"english":"It is this stage that gingivitis is most notable.","chinese":"這是這個階段牙齦炎是最顯着的。"},{"english":"The incidence of gingivitis led by crowns with poor margin fitness is 100%.","chinese":"密合性差的修復體齦炎發生率爲100%。"},{"english":"Elderly patients with diabetes are often accompanied by varying degrees of gingivitis and periodontitis .","chinese":"老年糖尿病患者往往伴有不同程度的牙齦炎和牙周炎。"},{"english":"Obijective To observe the effects of Compound tea polyphenols oral rinse in treatment of gingivitis in children.","chinese":"目的觀察複方茶多酚含漱液對少兒牙齦炎的治療效果。"},{"english":"To grasp histopathological feature of marginal gingivitis and gingiva hyperplasia.","chinese":"瞭解邊緣性齦炎及齦增生的組織病理特點。"},{"english":"The recurrent rate of the marginal gingivitis can be decreased in a magnetic field that interferes with adhesive force of the dental tophus.","chinese":"用磁場影響牙結石重新附着可降低緣齦炎的複發率。"},{"english":"Scaling is one of the major methods for treating gingivitis and periodontitis.","chinese":"潔治是治療牙齦炎和牙周炎的主要手段之一。"},{"english":"Those who don’t floss regularly have much higher chances of developing an oral disease, such as gingivitis.","chinese":"不經常使用牙線的人會更容易患上牙齦炎等口腔疾病。"},{"english":"Be aware of the causes and symptoms of gingivitis.","chinese":"要注意的原因和牙齦炎的症狀。"}],"related":[]}