{"definition":["tornado\/waterspout\/twister"],"pinyin":["long2 juan3"],"simplified":["龙卷"],"rank":47633.0,"normalized_rank":0.6664474696738628,"fraction":1.8393180984603454e-7,"cumulative_fraction":0.9985726770394496,"word":"龍捲","characters":[{"definition":["dragon\/CL:條|条[tiao2]\/imperial","surname Long"],"pinyin":["Long2","long2"],"word":"龍"},{"definition":["to roll (up)\/to sweep up\/to carry on\/roll"],"pinyin":["juan3"],"word":"捲"}],"containing_words":[{"definition":["tornado\/hurricane\/twister\/cyclone"],"pinyin":["long2 juan3 feng1"],"word":"龍捲風"}],"sentences":[{"english":"A scientist said they were probably picked up by a waterspout or mini-tornado out at sea.","chinese":"科學家說它們很可能是被龍捲風從海上捲來的。"},{"english":"Tornado sudden and violent attacks, the wind is the strongest on the ground.","chinese":"龍捲的襲擊突然而猛烈，產生的風是地面上最強的。"},{"english":"The tornado disrupted broadcasting along the entire coast.","chinese":"龍捲風使整個沿海的廣播都中斷了。"},{"english":"They can show themselves as water spouts .","chinese":"他們可以查看自己的水龍捲。"},{"english":"Much of Greensburg, Kansas has been leveled by a tornado.","chinese":"差不多整個堪薩斯州的格林斯堡都被龍捲風推平了。"},{"english":"In some areas, red earth produces dramatic scarlet-hued tornadoes.","chinese":"在有一些地方，紅色的地球製造猩紅色的龍捲風。"},{"english":"In fact, 70 percent of tornado warnings are false alarms.","chinese":"事實上，70%的龍捲風警報都是誤報。"},{"english":"Waterspouts are spinning columns of rising moist air that typically form over warm water.","chinese":"水龍捲的旋轉柱上升潮溼的空氣，通常形式的溫水。"},{"english":"1884 - First known photograph of a tornado is made.","chinese":"1884年的今天，首張已知的龍捲風照片被拍攝。"},{"english":"Tornadoes have a strong instability in the cumulonimbus of.","chinese":"龍捲風產生於強烈不穩定的積雨雲中。"},{"english":"Further south in Washington County, Alabama, a large tornado was reported on the ground.","chinese":"報道說，華盛頓市偏南的地區，還有一股大的龍捲風。"},{"english":"It's one of many tornados that are destroying our city.","chinese":"這是那些毀滅我們城市的龍捲風之一。"},{"english":"And rebuilding after the floods and tornadoes may deliver a fillip in the second half of the year.","chinese":"而且洪水以及龍捲風後重建也可以刺激下半年的經濟。"},{"english":"US deadliest tornado kills 122 people in Missouri.","chinese":"美國密蘇蘇裏州遭致命龍捲風襲擊，122人死亡。"},{"english":"A spectacle of two dragons drinking water appeared in Shekou, Shenzhen.","chinese":"據我理解，說的是在深圳出現的水龍捲。"},{"english":"The funnel crowd dropped right there at the laundromat.","chinese":"龍捲風正好到達自助洗衣店。"}],"related":[]}