{"definition":["Mt Longmen, the northwest boundary of the Sichuan basin, an active geological fault line\/Mt Longmen in Shandong\/Mt Longmen in Henan"],"pinyin":["Long2 men2 shan1"],"simplified":["龙门山"],"rank":50971.0,"normalized_rank":0.7131504204384873,"fraction":1.297741102802577e-7,"cumulative_fraction":0.999092732261624,"word":"龍門山","characters":[{"definition":["dragon\/CL:條|条[tiao2]\/imperial","surname Long"],"pinyin":["Long2","long2"],"word":"龍"},{"definition":["gate\/door\/CL:扇[shan4]\/gateway\/doorway\/CL:個|个[ge4]\/opening\/valve\/switch\/way to do something\/knack\/family\/house\/(religious) sect\/school (of thought)\/class\/category\/phylum or division (taxonomy)\/classifier for large guns\/classifier for lessons, subjects, branches of technology\/(suffix) -gate (i.e. scandal; derived from Watergate)","surname Men"],"pinyin":["Men2","men2"],"word":"門"},{"definition":["mountain\/hill\/anything that resembles a mountain\/CL:座[zuo4]\/bundled straw in which silkworms spin cocoons\/gable","surname Shan"],"pinyin":["Shan1","shan1"],"word":"山"}],"containing_words":[{"definition":["Longmenshan fault line, a tectonically active thrust fault line at the northwest boundary of the Sichuan basin"],"pinyin":["Long2 men2 shan1 duan4 ceng2"],"word":"龍門山斷層"}],"sentences":[{"english":"The paper also discusses the structural evolution history of the forel…","chinese":"並討論了龍門山中段中生代前陸盆地的構造演化歷史。"},{"english":"The Devonian strata are well developed in the Baishi Goujiaregionofcentral Longmen Mountains , Sichuan .","chinese":"龍門山中段白石苟家地區泥盆紀地層十分發育。"},{"english":"The eastern margin of the Tibet Plateau is composed of the Minshan Block and Longmenshan.","chinese":"青藏高原東緣由岷山斷塊和龍門山構造帶構成。"},{"english":"There is a Yi River here, and on the two sides are Fragrant Mountain and longmen Mountain.","chinese":"這裏有一條伊水，河兩岸是香山和龍門山。"},{"english":"It is found that there exists a good coupling relationship between Longmen Mountain and its foreland basin.","chinese":"得出了龍門山及其前陸盆地存在良好的耦合關係。"}],"related":[]}