{"definition":["faucet\/water tap\/bicycle handle bar\/chief (esp. of gang)\/boss\/decision maker\/(market) leader (of companies)\/front end of mud-flow\/figurehead on prow of dragon boat 龍船|龙船"],"pinyin":["long2 tou2"],"simplified":["龙头"],"rank":3527.0,"normalized_rank":0.049347305975683126,"fraction":0.00003919017555074234,"cumulative_fraction":0.8136283891460103,"word":"龍頭","characters":[{"definition":["dragon\/CL:條|条[tiao2]\/imperial","surname Long"],"pinyin":["Long2","long2"],"word":"龍"},{"definition":["head\/hair style\/the top\/end\/beginning or end\/a stub\/remnant\/chief\/boss\/side\/aspect\/first\/leading\/classifier for pigs or livestock\/CL:個|个[ge4]","suffix for nouns"],"pinyin":["tou2","tou5"],"word":"頭"}],"containing_words":[{"definition":["faucet\/tap"],"pinyin":["shui3 long2 tou2"],"word":"水龍頭"},{"definition":["big boss\/leader of a group\/dominant (position)"],"pinyin":["long2 tou2 lao3 da4"],"word":"龍頭老大"},{"definition":["key enterprises\/leading enterprises"],"pinyin":["long2 tou2 qi3 ye4"],"word":"龍頭企業"},{"definition":["lit. dragon's head, snake's tail (idiom); fig. a strong start but weak finish"],"pinyin":["long2 tou2 she2 wei3"],"word":"龍頭蛇尾"},{"definition":["lever-style guillotine decorated with a dragon's head at the hinged end, used to behead criminals related to the emperor"],"pinyin":["long2 tou2 zha2"],"word":"龍頭鍘"}],"sentences":[{"english":"Remove the old faucet and scrape any old putty or caulk from the basin.","chinese":"拆調舊水龍頭，並颳去洗槽舊的膩子或填充物。"},{"english":"And Rinpoche has vowed to turn off the water while brushing his teeth.","chinese":"仁波切本身則誓言在刷牙時要關閉水龍頭。"},{"english":"She bent her mouth to the tap and drank the tepid water.","chinese":"她把嘴伸到水龍頭底下去喝那微溫的水。"},{"english":"Hongjia Ferry hydropower station is a tap station of wujiang River step exploitation in Guizhou province.","chinese":"洪家渡水電站是貴州省烏江梯級開發的一個龍頭電站。"},{"english":"The insult to the adult consulter results in multiplication of the faulty faucets.","chinese":"對成年諮詢者的侮辱導致有缺陷水龍頭成倍增加。"},{"english":"Exclusive distribution of \"HIESTAND Swiss Gourmet Bakery\" leader in frozen premium good.","chinese":"的獨家經銷商，優質冷凍產品的龍頭企業。"},{"english":"Add low flow aerators to all the faucets in your home.","chinese":"把你家裏的每個水龍頭都裝上加氣儀。"},{"english":"You are left with the holes in your sink and the supply tubes waiting for the new faucet.","chinese":"您留給在您的水槽和等待新的龍頭的供應管的孔。"},{"english":"If there aren’t any leaks, wash up with your new faucet fixture.","chinese":"如果沒有任何漏水，就可以清洗你的新水龍頭了。"},{"english":"Filtered water is always on tap, making it very convenient to use.","chinese":"隨時打開龍頭都有過濾水，用起來很方便。"},{"english":"The faucets on my kitchen sink are stuck. I can't turn them off.","chinese":"我廚房水槽上面的水龍頭給卡住了，我關不上。"},{"english":"Including moon cakes Guang-moon cakes have become the leading annual output value exceeding 100 million yuan.","chinese":"其中中秋月餅更成爲廣式月餅的龍頭，年產值超億元。"},{"english":"Then draw water from the lowest faucet in the house.","chinese":"然後從最低的水龍頭中接水就可以了。"},{"english":"When swabbing bibcock, do not use dissolvent of soda acid sex.","chinese":"擦洗龍頭時，不要用酸鹼性溶劑。"},{"english":"Not only this, you also get the advantage of knowing whether the water is cold or hot.","chinese":"不僅如此，你還可以通過這款水龍頭知道水的冷熱。"},{"english":"The water falls from the tap drop by drop.","chinese":"水從水龍頭裏一滴一滴地往下流。"}],"related":[{"definition":["slab\/(geology) tectonic plate\/(fig.) sector (of the stock market or of industry)\/(economic) bloc"],"pinyin":["ban3 kuai4"],"word":"板塊"},{"definition":["to spur\/to provide impetus\/to drive"],"pinyin":["dai4 dong4"],"word":"帶動"},{"definition":["tycoon\/magnate\/big player (including company, country, school etc)\/big shot"],"pinyin":["ju4 tou2"],"word":"巨頭"},{"definition":["to push (for acceptance of a plan)\/to push forward\/to promote\/to actuate\/CL:個|个[ge4]"],"pinyin":["tui1 dong4"],"word":"推動"},{"definition":["industry\/estate\/property\/industrial"],"pinyin":["chan3 ye4"],"word":"產業"},{"definition":["transformation\/to transform"],"pinyin":["zhuan3 xing2"],"word":"轉型"},{"definition":["to march\/to advance"],"pinyin":["jin4 jun1"],"word":"進軍"},{"definition":["industry\/business"],"pinyin":["hang2 ye4"],"word":"行業"},{"definition":["state enterprise\/(Tw) abbr. for 國際企業管理|国际企业管理, international business management (as a subject of study)"],"pinyin":["guo2 qi3"],"word":"國企"},{"definition":["power\/influence\/potential\/momentum\/tendency\/trend\/situation\/conditions\/outward appearance\/sign\/gesture\/male genitals"],"pinyin":["shi4"],"word":"勢"},{"definition":["innovation\/to bring forth new ideas\/to blaze new trails"],"pinyin":["chuang4 xin1"],"word":"創新"},{"definition":["effect (scientific phenomenon)"],"pinyin":["xiao4 ying4"],"word":"效應"},{"definition":["to crane one's neck\/to await eagerly\/to lead\/to show the way"],"pinyin":["yin3 ling3"],"word":"引領"},{"definition":["bellwether"],"pinyin":["ling3 tou2 yang2"],"word":"領頭羊"},{"definition":["in succession\/following closely"],"pinyin":["xiang1 ji4"],"word":"相繼"},{"definition":["supplier"],"pinyin":["gong1 ying4 shang1"],"word":"供應商"}]}