{"definition":["Pompeium, Roman town in Bay of Naples destroyed by eruption of Vesuvius in 79\/Pompey (Roman general)"],"pinyin":["Pang2 pei2"],"simplified":["庞培"],"rank":57143.0,"normalized_rank":0.7995047080715795,"fraction":6.247842429690697e-8,"cumulative_fraction":0.9996672523202944,"word":"龐培","characters":[{"definition":["huge\/enormous\/tremendous","surname Pang"],"pinyin":["Pang2","pang2"],"word":"龐"},{"definition":["to bank up with earth\/to cultivate (lit. or fig.)\/to train (people)"],"pinyin":["pei2"],"word":"培"}],"containing_words":[],"sentences":[{"english":"This would have caused a lot of ' sluggishness' in Pompey's ranks.","chinese":"這在龐培軍隊中導致了許多遲滯。"},{"english":"Pompey the Great and Julius Caesar were fighting each other for control of Rome.","chinese":"龐培和凱撒大的戰鬥，羅馬控制對方。"},{"english":"Once, Pompeii was a busy city of 22000 people.","chinese":"以前，龐培是一個擁有兩萬兩千人口的繁華城市。"},{"english":"They do not see them because Pompeii has no people.","chinese":"然而遊客卻看不到龐培城的居民。"},{"english":"A new trouble was in store for pompeii .","chinese":"一場新的災難即將向龐培襲來。"},{"english":"Panic spreads among Pompey's young soldiers as they turn and flee.","chinese":"龐培的年輕士兵被嚇得四處逃散。"},{"english":"Today, more than 250 years since excavations started.","chinese":"從挖掘龐培城開始至今，250多年過去了。"},{"english":"They can also be unintended caches such as at Pompeii.","chinese":"他們也可以是隨意的容器，就像在龐培古城一樣。"},{"english":"In addition to Pompey, the Optimates faction included most of the Roman Senate.","chinese":"除了龐培，貴族派包括了幾乎所有的羅馬議員。"},{"english":"He had superiority in cavalry, both he and Ceasar knew that.","chinese":"龐培有騎兵優勢，他和愷撒都明白這一點。"},{"english":"My wife and I were touring Italy and had spent the day at Pompeii.","chinese":"我和妻子去意大利旅遊，花了一天時間參觀龐培。"},{"english":"According to tradition, it was founded in 75 BC by Pompey the Great as a military settlement.","chinese":"相傳西元前75年由龐培創建，當作屯兵之地。"},{"english":"Pompeii is no longer a buried city.","chinese":"龐培不再是地下城了。"}],"related":[]}